{
  "source_id": "七元召魔伏六天神咒经",
  "source_file": "chunked_daozang\\七元召魔伏六天神咒经.json",
  "total_chunks": 3,
  "total_original_chars": 2299,
  "total_translated_chars": 15264,
  "total_translation_time": 77.09622478485107,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\七元召魔伏六天神咒经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Seven Primes Summoning Demons and Subduing the Six Heavens Spirit Incantation Scripture**\n\n**Scripture Title:** *The Seven Primes Summoning Demons and Subduing the Six Heavens Spirit Incantation Scripture*. Author unknown, one scroll. Source text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Seven Primes Summoning Demons and Subduing the Six Heavens Spirit Incantation Scripture**\n\nAt that time, the Dao Lord addressed the thirty-six Heavenly Spirit Kings, the Five Qi Heavenly Lords, the Great Spirits of the Wastelands, the Five Lakes Great Generals, the Guardians of the Numinous, the Flying Dragon Direct Riders, the Lords of the Three and Five, the Five Venerable Thearchs, and the Primal King Heavenly Perfected. He declared: \"When I formerly expounded this scripture for all sentient beings, the demonic officials trembled, and the earthly spirits and gods all prostrated to listen. Each heard my command and decree, their transgressions pardoned, their sins absolved. Returning to a single mind, they all generated good thoughts.\n\nFrom this day forward, wherever a Daoist saves others, I shall assist in driving away afflictions, slaying demons to cure illness, aiding the celestial orthodox *qi*, and annihilating all spirits. Summon them, and they shall arrive at once.\"\n\n---\n\n**The Seven Perfected Summoning Heavenly Perfected and Subduing Demons Chapter**\n\nThe Dao spoke: \"In former times, I drove away evil and harm for the gods and humans, extinguishing wickedness and eliminating misfortune. If, after the Three Dragons, a Daoist can perform these meritorious deeds within this Dharma, then in regions beset by calamity, they shall establish the Altar of the Northern Dipper’s Seven Primes, light lamps, and perform the Daoist rites. They shall summon the Lords of the Three and Five and the spirits of the Primal *Qi*, manifesting awe-inspiring power to extinguish evil and sever the demonic hosts. All sentient beings shall have their disasters dispelled, their adversities transcended, and their years prolonged without end.\"\n\nThe Numinous Official Heavenly Worthy summoned the Great Demon King of the North, decreeing to all spirits and demons: \"From this day forward, you shall assist Daoists in performing rituals, slaying demons and executing the wicked, so that the living may attain peace. Hasten, as the law commands!\"\n\n---\n\n**The Seven Perfected Commanding the Summoning of the Five Thunder Spirit Soldiers to Subdue Demons Chapter**\n\nThe Seven Perfected declared: \"In former times, I expounded the *Divine Incantation Wondrous Scripture* for sentient beings to extinguish sins and eliminate misfortune, suppressing and subduing demonic and perverse forces, aiding Heaven and assisting transformation. If a Daoist, with single-minded focus, establishes a ritual arena, lights lamps, and performs the Daoist rites, using talismans to suppress and bind, pursuing and capturing spirits and demons, I shall summon the Five Thunder Spirit Soldiers—countless legions of ten thousand myriad riders—to descend upon the ritual arena, annihilating demonic specters and severing venomous plagues and pestilential spirits. I shall summon them to appear before me.\"\n\n\"We invoke the Eastern Great Cloud Thunder Fire Bell Spirit Soldiers, the Nine Myriad Myriad Riders of the Wood Essence Officials, leading the spirits of Horn and Neck, treading the clouds of the Nine *Qi*, wielding blades and brandishing swords, descending upon the ritual arena to execute and smite the pestilential *qi* demon soldiers of Liu Yuanda, who spread green sickness. Swiftly gather their poisonous *qi* to give life to the people and assist the Dao in its transformative work. Hasten, as the law commands!\"\n\n\"We invoke the Southern Great Cloud Thunder Fire Bell Spirit Soldiers, the Three Myriad Myriad Riders of the Fire Essence Officials, leading the spirits of Well and Ghost, treading the clouds of the Three *Qi*, wielding blades and brandishing swords, descending upon the ritual arena to execute and sever the pestilential *qi* demon soldiers of Zhang Yuanbo, who spread red poisonous plagues. Swiftly gather their poisonous *qi* to give life to the people and assist the Dao in its transformative work. Hasten, as the law commands!\"\n\n\"We invoke the Western Great Cloud Thunder Fire Bell Spirit Soldiers, the Seven Myriad Myriad Riders, the Great Spirits of the Metal Essence leading the mighty soldiers of Straddling and Bond, treading the clouds of the Seven *Qi*, wielding blades and brandishing swords, descending upon the ritual arena to capture and restrain the demonic specters of the Five Directions. Zhao Gongming’s pestilential poison demons shall flee a thousand *li*, their poison gathered and restrained to give life to the people and assist the governance of the Dao. Hasten, as the law commands!\"\n\n\"We invoke the Northern Great Cloud Thunder Fire Bell Spirit Soldiers, the Five Myriad Myriad Riders, the Great Spirits of the Water Essence leading the spirit soldiers of Dipper and Ox, treading the clouds of the Five *Qi*, overturning heaven and earth, descending upon the ritual arena to gather and execute the pestilential poison demons of Zhong Shiji. Swiftly depart ten thousand *li*, all subdued and annihilated. Hasten, as the law commands!\"\n\n\"We invoke the Central Great Cloud Thunder Fire Bell Spirit Soldiers, the Twelve Myriad Riders, the Earth Thearch Spirit Talismans leading the mighty soldiers of the Four Directions, treading the clouds of the Yellow *Qi*, wielding blades and brandishing swords, descending upon the ritual arena to gather and execute the pestilential poison demons of Shi Wenye. Swiftly depart a thousand *li*, so that the people may live in peace and the land attain tranquility. Hasten, as the law commands!\"\n\nThe Seven Perfected declared: \"These Five Heavens each possess spirit soldiers in countless legions. When a ritual arena is established, their majestic radiance is instantly prepared. If there are those afflicted by illness, simply light the Seven Primes Lamps, visualize and regulate the breath, and envision the original master arriving from the direction of their affliction to suppress and subdue. All mad, perverse, demonic, and inauspicious *qi* shall spontaneously transform into blood.\"\n\n\"First, knock the teeth seven times, recite the Heavenly Peng Incantation one hundred and twenty times, and secretly visualize the true *qi* of the Seven Primes. Drive away the hundred poisons, dispel disasters, and summon blessings. Notify the Five Directions’ Great Cloud Thunder Talismans as follows:\n\n1. The First Prime Spirit Talisman, to be inscribed on a peachwood board one *chi* and nine *cun* long, mirrors the *Gen* Palace.\n2. The Second Prime Spirit Talisman, to be inscribed on a catalpa wood board one *chi* and three *cun* long, mirrors the *Xun* Palace.\n3. The Third Prime Spirit Talisman, to be inscribed on a paulownia wood board two *chi* long, mirrors the *Kan* Palace.\n4. The Fourth Prime Spirit Talisman, to be inscribed on a silverwood board one *chi* and five *cun* long, mirrors the *Dui* Palace.\n5. The Fifth Prime Spirit Talisman, to be inscribed on a peachwood board two *chi* long, mirrors the *Kun* Palace.\n6. The Sixth Prime Spirit Talisman, to be inscribed on a white poplar wood board three *chi* long, mirrors the *Qian* Palace.\n7. The Seventh Prime Spirit Talisman, to be inscribed on a peachwood board one *chi* and three *cun* long, mirrors the *Li* Palace.\n8. The Eighth Prime Spirit Talisman, to be inscribed on a white poplar wood board one *chi* and seven *cun* long, mirrors the *Zhen* Palace.\n9. The Ninth Prime Spirit Talisman, governing the Three Myriad Six Thousand Spirit *Qi*, to be inscribed on a peachwood board two *chi* long, mirrors the Central Palace.\"\n\nThe Seven Perfected declared: \"These talismans emerged from Mount Fengdu. The Perfected who attained the Dao all summoned the Five Directions’ Cloud Thunder, the Tiger Rushing Soldiers, and the stellar spirits using these talismans. They captured the spirits and demons of the Five Directions, commanded the heavenly soldiers, stirred clouds and moved rain, and restrained evil demons. These talismans are concealed within the Cloud Cliffs of the Eight Heavens, harmonizing Heaven and pacifying Earth.\"\n\nShould Daoist practitioners or those seeking immortality wish to receive these teachings, they must present offerings of silk, pledge their sincerity with gold and valuables, and transmit them with reverence—never recklessly bestowing them upon the undeserving or those burdened by past transgressions in the evil realms. If a Daoist of true lineage performs the rites according to the ordained liturgy, they may transmit these talismans beneath the stars at night. For those who receive them as disciples under a master’s guidance, adhering to the rituals with devotion and offering sacrifices to seek blessings, five silver plates inscribed in cinnabar should be used to consecrate afflicted households, banishing malevolent spirits and scattering the myriad specters in flight.\n\nThe Heavenly Emperor’s revealed talismans command and subdue pernicious influences. After a thousand days of cultivation, the practitioner shall be attended by divine beings—celestial immortals, transcendent beings, august immortals, feathered immortals, perfected ones, numinous beings, sages, and auspicious spirits—who will secretly aid the Daoist. Guard these sacred texts in concealment, transmitting them only to the worthy.\n\nThe five numinous talismans each command a million spirit soldiers and flying celestial ghost hosts as their guardians. Receiving these talismans from a master is as solemn as standing before the imperial throne.\n\nThe Seven Perfected summoned and subdued the demonic legions of the Six Caverns:\n\nThe Seven Perfected declared: \"We, on behalf of the heavens, expound the Five Cloud Spirit Talismans of the Divine Perfected for self-protection, enabling flight through the Seven Primes and treading upon the Nine *Qi* of Primordial Essence. The Supreme August Highest Perfected’s Three Heavenly True Decree resides on the southern slope of Mount Fengdu, veiled by the Nine *Qi*. Should any Daoist in future generations encounter these talismans, they must, on their natal day, prepare forty *chi* of white silk, five fruits, fragrant oils, and a pledge of sincerity to swear an oath with their master. They shall then offer sacrifices to us, the Seven Prime Supreme August Nine Perfected, and receive the talismans. Store them in a brocade pouch, conceal them in a quiet chamber, and set up a high altar to pay homage morning and evening.\n\nThe Most High Northern Pole Venerable Deity, having petitioned the Supreme Emperor of the Grand Tenuity, shall attain the Five *Qi* suffusing the body, binding all demons. Myriad spirits shall pay homage, the Three Officials shall commend them, earth deities shall serve, and demonic hordes shall tremble in submission, none daring to disobey.\"\n\nThe incantation reads:\n*\"Mysterious Dipper, Primordial Essence,\nThree Pure Ones radiant and bright.\nHosts of spirits open the Dao,\nSweeping away all misfortune.\nEight Mighties summon and command,\nSeizing and slaying wayward spirits.\nProlonging years without end,\nThe receiver attains long life.\nDivine *Qi* of the Four Darknesses,\nConverge and restrain Mount Feng.\nBind and dispatch the Six Heavens—\nWho dares delay?\nHide, vile and hideous ones!\nEight Directions’ mighty spirits,\nAll submit to my Perfection.\nSwiftly, swiftly, as decreed by law!\"*\n\nThe Seven Perfected say: Should there be in the world a Daoist who knows Our Divine Chart, they may wander in the company of the Hundred Spirits, tread the Net of Principles and ride the Chariot of Records, summoning and commanding the myriad numina. They shall attain the Dao, recover their true Dao-nature, and forever depart from the ghostly officials of Fengdu.\n\nThe Seven Perfected’s Net of Principles comprises nine Dao-paths. Treading the Net of Principles in the ritual arena, one faces north to ascend the Net of Principles above. A thousand gold pieces are left in concealment—this is not transmitted to the unworthy.\n\nThe Scripture of the Luminous Plain Maiden can summon the Hundred Demons to serve as guards; Daoists who carry it upon their person shall do so.\n\nThe Scripture of the Jade Maiden of Supreme Yin’s Engendering: Daoists who carry it shall enjoy long life and enduring vision, knowing the ways of ghosts and spirits.\n\nThe Scripture of the Jade Maiden of Vast Spirit: Daoists who ingest it shall be coeval with Heaven and Earth.\n\nThe Scripture of the Plain Maiden of Precious Life: Daoists who carry it shall have the myriad spirits pay homage, traversing the Three Realms.\n\nThe Scripture of the Jade Maiden of Supreme Harmony: Daoists who ingest it shall wander the Five Marchmounts, with the myriad spirits bowing in their courtyard.\n\nThe Seven Perfected say: When I first beheld this Chart, demonic palaces trembled, mountains swallowed their mists, and the sun and moon shone brightly across the Three Realms. The demonic hordes turned eastward, divine soldiers wielded their halberds, six-tusked beasts brandished their whips, and shooting stars hung low over the Three Realms. The Black Mystery’s secret writ was arrayed upon the Starry Mechanism.\n\nLater, those who study as Perfected Ones shall, in accordance with the statutes, establish the Great Rites, circulating through the Five Lakes and Seven Marshes, the Seven Temples and Twenty-Four Marchmounts.\n\nShould any Daoist carry these, they must enclose them in a crimson pouch and, within a quiet chamber, transmit them to a worthy recipient once every thirty years—never to the unworthy. To transmit to one unfit is to ruin the true Dao, bringing calamity and suffering upon oneself. Guard your speech, seal your conduct, and walk the path without transgression; thus shall you behold the true Dao and be inscribed in name within the Jasper Palace.\n\nThe Seven Perfected say: Daoists of later generations, whether dwelling among men, in the marketplace, or in mountain valleys, who cultivate the true instructions and wander forth to teach and transform, healing the sick and offering expedient aid to all beings, must single-mindedly arouse compassion and widely practice the Dao-qi—then shall I assist them.\n\nThe Seven Perfected say: Should a Daoist wander through the lands and encounter the calamities of the Nine Nines and Hundred Sixes, they may, in accordance with Our statutes, establish the Seven Primordials’ lamp-images, perform the Dao, recite incantations, and submit memorials to beseech the eradication of disasters and the prolongation of years without end. Upon attaining the Dao, they may carry this Chart and image to traverse the Three Realms and ascend through the Golden Gate.\n\nThe Seven Perfected say: Among the Three Realms, if there be a Daoist whose past karma aligns with the Dao and who beholds this Chart, they must wholeheartedly uphold and practice it as though standing before the imperial presence, proclaiming it within the Gate of Service.\n\nThe true images of the Upper Symbols are arrayed as follows.\n\nThe Scripture of the Seven Primordials’ Summons to Subdue the Demons of the Six Heavens concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "七元召魔伏六天神咒经 经名：七元召魔伏六天神咒经。 撰人不详，一卷。 底本出处：《正统道藏》正一部。 七元召魔伏六天神咒经 尔时，道君告三十六天神王，五炁天君，圹野大神，五湖大将军，卫灵大神，飞龙直骑，三五之君，五老上帝，元王天真、我昔为一切众生说此经时，魔官振动，大地鬼神悉皆伏听，各闻勑令，放汝罪谴，各还一心，咸生善念。 自今已去，若有道士救人之处，我当为助驱驰，杀鬼治病，佐天正炁，消灭众精，召请立至矣。 七真召天真伏魔品 道言：我昔为诸天人，驱邪去害，灭恶除凶。 若三龙之后，有道士能於此法中，行是功德。 有灾之方，当为大建北斗七元坛，燃灯行道，召三五之君、一炁之神，明威灭邪，斩鬼神兵马。 一切众生消灾度厄，延年无穷。 灵官天尊召北方大魔王，勅一切神鬼，自今已去，当助道士作法，杀鬼戮凶，生人获泰。 七真命召五雷神兵伏魔品 七真曰：我昔为众生说《神咒妙经》灭罪除凶，镇精邪，佐天助化。 若有道士，一心目专，一法建立道场，燃灯行道，符章压镇，追捉鬼神。 我当为召请五雷神兵亿亿万骑，来降道场，消灭精魅，挥割虫毒疫精。 我当召请，来到御前。 奉请东方大云雷火铃神兵、木精吏兵九亿万骑，部领角亢之精，步九炁之云，轮刀仗剑，来降道场，诛伐刘元达疫炁鬼兵，行其青病，急收毒气，以生人民，助道行化。 急急如律令。 奉请南方大云雷火铃神兵、炎精吏兵三亿万骑，部领井鬼之精，步三炁之云，轮刀仗剑，来降道场，诛斩张元伯疫炁鬼兵，行其赤毒疫病，急收毒气，以生人民，助道行化，急急如律令。 奉请西方大云雷火铃神兵七亿万骑，金精大神部领奎娄强兵，步七炁之云，轮刀仗剑，来降道场，收摄五方妖魅，赵公明殟毒疫鬼急去千里，收殟摄毒，以生人民，助道政化。 急急如律令。 奉请北方大云雷火铃神兵五亿万骑，水精大神部领斗牛神兵，步五炁之云，翻天转地，来降道场，收斩钟士季疫毒之鬼，急去万里，悉皆伏灭。 急急如律令。 奉请中央大云雷火铃神兵一十二万骑，土皇神符部领四方强兵，步黄炁之云，输刀仗剑，来降道场，收斩史文业殟毒疫鬼，速出千里，生民安泰，国土清平。 急急如律令。 七真曰：是此五天，各有神兵亿万，启建道场，威光立备。 若有疾病之人，但燃七元灯，存想吐纳。 想见本师，从所在之方来为禁伏。 一切狂邪妖魅不祥之炁，皆自成血。 先叩齿七通，念天蓬咒一百二十遍，阴密存念七元真炁，驱驰百毒，消灾降福，具告五方云雷大符如左： 第一元神符镇艮宫，桃木板长一尺九寸篆之。 第二元神符镇巽宫，梓木板长一尺三寸。 第三元神符镇坎宫，桐木板可长二尺。 第四元神符镇兑宫，银木板可长一尺五寸。 第五元神符镇坤宫，桃木板长二尺 第六元神符镇乾宫，白杨木板长三尺。 第七元神符镇离宫，桃木板长一尺三寸。 第八元神符镇震宫，白杨木板长一尺七寸。 第九元神符镇中宫，总摄三万六千神炁，桃木板长二尺。 七真曰：此符出乎酆都山，真人得道，皆召用五方云雷、虎贲、星辰。 召请皆用此符，摄五方鬼神，役使天兵，悉兴云动雨，禁戒恶魔。 此符藏八天云崖，和天静地。",
      "translated_text": "**The Seven Primes Summoning Demons and Subduing the Six Heavens Spirit Incantation Scripture**\n\n**Scripture Title:** *The Seven Primes Summoning Demons and Subduing the Six Heavens Spirit Incantation Scripture*. Author unknown, one scroll. Source text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Seven Primes Summoning Demons and Subduing the Six Heavens Spirit Incantation Scripture**\n\nAt that time, the Dao Lord addressed the thirty-six Heavenly Spirit Kings, the Five Qi Heavenly Lords, the Great Spirits of the Wastelands, the Five Lakes Great Generals, the Guardians of the Numinous, the Flying Dragon Direct Riders, the Lords of the Three and Five, the Five Venerable Thearchs, and the Primal King Heavenly Perfected. He declared: \"When I formerly expounded this scripture for all sentient beings, the demonic officials trembled, and the earthly spirits and gods all prostrated to listen. Each heard my command and decree, their transgressions pardoned, their sins absolved. Returning to a single mind, they all generated good thoughts.\n\nFrom this day forward, wherever a Daoist saves others, I shall assist in driving away afflictions, slaying demons to cure illness, aiding the celestial orthodox *qi*, and annihilating all spirits. Summon them, and they shall arrive at once.\"\n\n---\n\n**The Seven Perfected Summoning Heavenly Perfected and Subduing Demons Chapter**\n\nThe Dao spoke: \"In former times, I drove away evil and harm for the gods and humans, extinguishing wickedness and eliminating misfortune. If, after the Three Dragons, a Daoist can perform these meritorious deeds within this Dharma, then in regions beset by calamity, they shall establish the Altar of the Northern Dipper’s Seven Primes, light lamps, and perform the Daoist rites. They shall summon the Lords of the Three and Five and the spirits of the Primal *Qi*, manifesting awe-inspiring power to extinguish evil and sever the demonic hosts. All sentient beings shall have their disasters dispelled, their adversities transcended, and their years prolonged without end.\"\n\nThe Numinous Official Heavenly Worthy summoned the Great Demon King of the North, decreeing to all spirits and demons: \"From this day forward, you shall assist Daoists in performing rituals, slaying demons and executing the wicked, so that the living may attain peace. Hasten, as the law commands!\"\n\n---\n\n**The Seven Perfected Commanding the Summoning of the Five Thunder Spirit Soldiers to Subdue Demons Chapter**\n\nThe Seven Perfected declared: \"In former times, I expounded the *Divine Incantation Wondrous Scripture* for sentient beings to extinguish sins and eliminate misfortune, suppressing and subduing demonic and perverse forces, aiding Heaven and assisting transformation. If a Daoist, with single-minded focus, establishes a ritual arena, lights lamps, and performs the Daoist rites, using talismans to suppress and bind, pursuing and capturing spirits and demons, I shall summon the Five Thunder Spirit Soldiers—countless legions of ten thousand myriad riders—to descend upon the ritual arena, annihilating demonic specters and severing venomous plagues and pestilential spirits. I shall summon them to appear before me.\"\n\n\"We invoke the Eastern Great Cloud Thunder Fire Bell Spirit Soldiers, the Nine Myriad Myriad Riders of the Wood Essence Officials, leading the spirits of Horn and Neck, treading the clouds of the Nine *Qi*, wielding blades and brandishing swords, descending upon the ritual arena to execute and smite the pestilential *qi* demon soldiers of Liu Yuanda, who spread green sickness. Swiftly gather their poisonous *qi* to give life to the people and assist the Dao in its transformative work. Hasten, as the law commands!\"\n\n\"We invoke the Southern Great Cloud Thunder Fire Bell Spirit Soldiers, the Three Myriad Myriad Riders of the Fire Essence Officials, leading the spirits of Well and Ghost, treading the clouds of the Three *Qi*, wielding blades and brandishing swords, descending upon the ritual arena to execute and sever the pestilential *qi* demon soldiers of Zhang Yuanbo, who spread red poisonous plagues. Swiftly gather their poisonous *qi* to give life to the people and assist the Dao in its transformative work. Hasten, as the law commands!\"\n\n\"We invoke the Western Great Cloud Thunder Fire Bell Spirit Soldiers, the Seven Myriad Myriad Riders, the Great Spirits of the Metal Essence leading the mighty soldiers of Straddling and Bond, treading the clouds of the Seven *Qi*, wielding blades and brandishing swords, descending upon the ritual arena to capture and restrain the demonic specters of the Five Directions. Zhao Gongming’s pestilential poison demons shall flee a thousand *li*, their poison gathered and restrained to give life to the people and assist the governance of the Dao. Hasten, as the law commands!\"\n\n\"We invoke the Northern Great Cloud Thunder Fire Bell Spirit Soldiers, the Five Myriad Myriad Riders, the Great Spirits of the Water Essence leading the spirit soldiers of Dipper and Ox, treading the clouds of the Five *Qi*, overturning heaven and earth, descending upon the ritual arena to gather and execute the pestilential poison demons of Zhong Shiji. Swiftly depart ten thousand *li*, all subdued and annihilated. Hasten, as the law commands!\"\n\n\"We invoke the Central Great Cloud Thunder Fire Bell Spirit Soldiers, the Twelve Myriad Riders, the Earth Thearch Spirit Talismans leading the mighty soldiers of the Four Directions, treading the clouds of the Yellow *Qi*, wielding blades and brandishing swords, descending upon the ritual arena to gather and execute the pestilential poison demons of Shi Wenye. Swiftly depart a thousand *li*, so that the people may live in peace and the land attain tranquility. Hasten, as the law commands!\"\n\nThe Seven Perfected declared: \"These Five Heavens each possess spirit soldiers in countless legions. When a ritual arena is established, their majestic radiance is instantly prepared. If there are those afflicted by illness, simply light the Seven Primes Lamps, visualize and regulate the breath, and envision the original master arriving from the direction of their affliction to suppress and subdue. All mad, perverse, demonic, and inauspicious *qi* shall spontaneously transform into blood.\"\n\n\"First, knock the teeth seven times, recite the Heavenly Peng Incantation one hundred and twenty times, and secretly visualize the true *qi* of the Seven Primes. Drive away the hundred poisons, dispel disasters, and summon blessings. Notify the Five Directions’ Great Cloud Thunder Talismans as follows:\n\n1. The First Prime Spirit Talisman, to be inscribed on a peachwood board one *chi* and nine *cun* long, mirrors the *Gen* Palace.\n2. The Second Prime Spirit Talisman, to be inscribed on a catalpa wood board one *chi* and three *cun* long, mirrors the *Xun* Palace.\n3. The Third Prime Spirit Talisman, to be inscribed on a paulownia wood board two *chi* long, mirrors the *Kan* Palace.\n4. The Fourth Prime Spirit Talisman, to be inscribed on a silverwood board one *chi* and five *cun* long, mirrors the *Dui* Palace.\n5. The Fifth Prime Spirit Talisman, to be inscribed on a peachwood board two *chi* long, mirrors the *Kun* Palace.\n6. The Sixth Prime Spirit Talisman, to be inscribed on a white poplar wood board three *chi* long, mirrors the *Qian* Palace.\n7. The Seventh Prime Spirit Talisman, to be inscribed on a peachwood board one *chi* and three *cun* long, mirrors the *Li* Palace.\n8. The Eighth Prime Spirit Talisman, to be inscribed on a white poplar wood board one *chi* and seven *cun* long, mirrors the *Zhen* Palace.\n9. The Ninth Prime Spirit Talisman, governing the Three Myriad Six Thousand Spirit *Qi*, to be inscribed on a peachwood board two *chi* long, mirrors the Central Palace.\"\n\nThe Seven Perfected declared: \"These talismans emerged from Mount Fengdu. The Perfected who attained the Dao all summoned the Five Directions’ Cloud Thunder, the Tiger Rushing Soldiers, and the stellar spirits using these talismans. They captured the spirits and demons of the Five Directions, commanded the heavenly soldiers, stirred clouds and moved rain, and restrained evil demons. These talismans are concealed within the Cloud Cliffs of the Eight Heavens, harmonizing Heaven and pacifying Earth.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1277,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.811087131500244,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\七元召魔伏六天神咒经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若有道士学道求仙之人，可赍命帛，质信金资而传，不得妄受福考生人过去恶道。 若有道士有本，可依科祭醮，夜露星辰传之。 有本为师宗传请者，为弟子，依科修奉，醮祭求福，当用银板五片，朱书镇有病之家，恶鬼殄溃，万魅逃踪。 天帝告符，召摄精崇，千日修行，皆置神人、天人、仙人、皇人、羽人、真人、灵人、圣人、灵瑞，阴助道士。 见文秘藏，勿传非其人。 灵符五道，皆有百万神兵、飞天鬼众侍卫。 此符受师重法，如对御前。 七真召摄六洞诸魔品 七真曰：我为诸天，说神真护身五云神符，飞步七元，蹑元精九炁。 上皇高真元始三夭真券，在酆都镇其山之阳，有九炁覆之。 若有道士后世之中，若有见闻此符，当以本命日，白素四十尺，五果香油质信，与师为誓，醮祭我七元上皇九真，当受之。 锦囊盛之，秘藏静室之中，立其高座，旦夕朝。 太上北极尊神，谒太微帝君，后得五炁通身，束系众魔，万灵朝迎，三官所举，地祇奉侍，群魔振伏，莫敢违逆乃为咒曰： 玄斗元精，三素朗明。 群精启道，扫除不祥。 八威召命，摄戮邪精。 延年无穷，受者长生。 神炁四冥，制会酆山。 束送六天，敢有稽延。 伏匿凶丑，八方威神，尽归我真。 急急如律令。",
      "translated_text": "Should Daoist practitioners or those seeking immortality wish to receive these teachings, they must present offerings of silk, pledge their sincerity with gold and valuables, and transmit them with reverence—never recklessly bestowing them upon the undeserving or those burdened by past transgressions in the evil realms. If a Daoist of true lineage performs the rites according to the ordained liturgy, they may transmit these talismans beneath the stars at night. For those who receive them as disciples under a master’s guidance, adhering to the rituals with devotion and offering sacrifices to seek blessings, five silver plates inscribed in cinnabar should be used to consecrate afflicted households, banishing malevolent spirits and scattering the myriad specters in flight.\n\nThe Heavenly Emperor’s revealed talismans command and subdue pernicious influences. After a thousand days of cultivation, the practitioner shall be attended by divine beings—celestial immortals, transcendent beings, august immortals, feathered immortals, perfected ones, numinous beings, sages, and auspicious spirits—who will secretly aid the Daoist. Guard these sacred texts in concealment, transmitting them only to the worthy.\n\nThe five numinous talismans each command a million spirit soldiers and flying celestial ghost hosts as their guardians. Receiving these talismans from a master is as solemn as standing before the imperial throne.\n\nThe Seven Perfected summoned and subdued the demonic legions of the Six Caverns:\n\nThe Seven Perfected declared: \"We, on behalf of the heavens, expound the Five Cloud Spirit Talismans of the Divine Perfected for self-protection, enabling flight through the Seven Primes and treading upon the Nine *Qi* of Primordial Essence. The Supreme August Highest Perfected’s Three Heavenly True Decree resides on the southern slope of Mount Fengdu, veiled by the Nine *Qi*. Should any Daoist in future generations encounter these talismans, they must, on their natal day, prepare forty *chi* of white silk, five fruits, fragrant oils, and a pledge of sincerity to swear an oath with their master. They shall then offer sacrifices to us, the Seven Prime Supreme August Nine Perfected, and receive the talismans. Store them in a brocade pouch, conceal them in a quiet chamber, and set up a high altar to pay homage morning and evening.\n\nThe Most High Northern Pole Venerable Deity, having petitioned the Supreme Emperor of the Grand Tenuity, shall attain the Five *Qi* suffusing the body, binding all demons. Myriad spirits shall pay homage, the Three Officials shall commend them, earth deities shall serve, and demonic hordes shall tremble in submission, none daring to disobey.\"\n\nThe incantation reads:\n*\"Mysterious Dipper, Primordial Essence,\nThree Pure Ones radiant and bright.\nHosts of spirits open the Dao,\nSweeping away all misfortune.\nEight Mighties summon and command,\nSeizing and slaying wayward spirits.\nProlonging years without end,\nThe receiver attains long life.\nDivine *Qi* of the Four Darknesses,\nConverge and restrain Mount Feng.\nBind and dispatch the Six Heavens—\nWho dares delay?\nHide, vile and hideous ones!\nEight Directions’ mighty spirits,\nAll submit to my Perfection.\nSwiftly, swiftly, as decreed by law!\"*",
      "overlap_context": "e Seven Perfected declared: \"These talismans emerged from Mount Fengdu. The Perfected who attained the Dao all summoned the Five Directions’ Cloud Thunder, the Tiger Rushing Soldiers, and the stellar spirits using these talismans. They captured the spirits and demons of the Five Directions, commanded the heavenly soldiers, stirred clouds and moved rain, and restrained evil demons. These talismans are concealed within the Cloud Cliffs of the Eight Heavens, harmonizing Heaven and pacifying Earth.\"",
      "start_char": 1277,
      "end_char": 1760,
      "start_sentence": 44,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.210683345794678,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\七元召魔伏六天神咒经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "七真曰：若世间有道士知我神图者，可与百神同游，步纲驾纪，摄召万灵，得道克复道真，永离酆都鬼官矣。 七真纲符九道，步纲道场，北面迁纲上，千金留藏，不传非辈。 通光素女神章，能召百魔侍卫，道士佩带。 太元阴生玉女神章，道士佩之，长生久视知鬼神。 广灵玉女神章，道士服之，与天地相毕。 宝生素女神章，道士佩者，万灵朝礼，举行三界。 太和玉女神章，道士服之，周行五岳，万神礼庭。 七真曰：我昔见此图之时，魔宫振动，山岳吞烟，日月朗明於三界，群魔东首，神兵秉钺，六齿扬鞭，奔星下垂於三界，列玄秘券於星玑。 后学真人，依科明建大法，周运五湖七泽、七庙二十四岳。 若有道士佩之者，以绛囊盛之，於静室遇贤者，三十年一传，勿传非其人。 不得其人，毁败真道，祸考其身。 慎口勿言，闭守其行，行按不犯，立见真道，克名琼宫之中矣。 七真曰：后学道士，或居人间，或居朝市，或居山谷，修习真诀，游行教化，见疾为医，方便救济一切众生，一心当发慈悲，广行道炁，我当助子。 七真曰：若是道士游行国界，遇阳九百六灾否，可依吾科令，建立七元灯象，行道念咒，表奏章词，请灭灾祸，延年元穷。 后得道时，可与此图象周行三界，升入金门也。 七真曰：三界之中，若有道士宿命合道，乃见此图，当一心奉行，如对御前，奉宣门下。 具列上象真图如左。 七元召魔伏六天神咒经竟",
      "translated_text": "The Seven Perfected say: Should there be in the world a Daoist who knows Our Divine Chart, they may wander in the company of the Hundred Spirits, tread the Net of Principles and ride the Chariot of Records, summoning and commanding the myriad numina. They shall attain the Dao, recover their true Dao-nature, and forever depart from the ghostly officials of Fengdu.\n\nThe Seven Perfected’s Net of Principles comprises nine Dao-paths. Treading the Net of Principles in the ritual arena, one faces north to ascend the Net of Principles above. A thousand gold pieces are left in concealment—this is not transmitted to the unworthy.\n\nThe Scripture of the Luminous Plain Maiden can summon the Hundred Demons to serve as guards; Daoists who carry it upon their person shall do so.\n\nThe Scripture of the Jade Maiden of Supreme Yin’s Engendering: Daoists who carry it shall enjoy long life and enduring vision, knowing the ways of ghosts and spirits.\n\nThe Scripture of the Jade Maiden of Vast Spirit: Daoists who ingest it shall be coeval with Heaven and Earth.\n\nThe Scripture of the Plain Maiden of Precious Life: Daoists who carry it shall have the myriad spirits pay homage, traversing the Three Realms.\n\nThe Scripture of the Jade Maiden of Supreme Harmony: Daoists who ingest it shall wander the Five Marchmounts, with the myriad spirits bowing in their courtyard.\n\nThe Seven Perfected say: When I first beheld this Chart, demonic palaces trembled, mountains swallowed their mists, and the sun and moon shone brightly across the Three Realms. The demonic hordes turned eastward, divine soldiers wielded their halberds, six-tusked beasts brandished their whips, and shooting stars hung low over the Three Realms. The Black Mystery’s secret writ was arrayed upon the Starry Mechanism.\n\nLater, those who study as Perfected Ones shall, in accordance with the statutes, establish the Great Rites, circulating through the Five Lakes and Seven Marshes, the Seven Temples and Twenty-Four Marchmounts.\n\nShould any Daoist carry these, they must enclose them in a crimson pouch and, within a quiet chamber, transmit them to a worthy recipient once every thirty years—never to the unworthy. To transmit to one unfit is to ruin the true Dao, bringing calamity and suffering upon oneself. Guard your speech, seal your conduct, and walk the path without transgression; thus shall you behold the true Dao and be inscribed in name within the Jasper Palace.\n\nThe Seven Perfected say: Daoists of later generations, whether dwelling among men, in the marketplace, or in mountain valleys, who cultivate the true instructions and wander forth to teach and transform, healing the sick and offering expedient aid to all beings, must single-mindedly arouse compassion and widely practice the Dao-qi—then shall I assist them.\n\nThe Seven Perfected say: Should a Daoist wander through the lands and encounter the calamities of the Nine Nines and Hundred Sixes, they may, in accordance with Our statutes, establish the Seven Primordials’ lamp-images, perform the Dao, recite incantations, and submit memorials to beseech the eradication of disasters and the prolongation of years without end. Upon attaining the Dao, they may carry this Chart and image to traverse the Three Realms and ascend through the Golden Gate.\n\nThe Seven Perfected say: Among the Three Realms, if there be a Daoist whose past karma aligns with the Dao and who beholds this Chart, they must wholeheartedly uphold and practice it as though standing before the imperial presence, proclaiming it within the Gate of Service.\n\nThe true images of the Upper Symbols are arrayed as follows.\n\nThe Scripture of the Seven Primordials’ Summons to Subdue the Demons of the Six Heavens concludes.",
      "overlap_context": "mordial Essence,\nThree Pure Ones radiant and bright.\nHosts of spirits open the Dao,\nSweeping away all misfortune.\nEight Mighties summon and command,\nSeizing and slaying wayward spirits.\nProlonging years without end,\nThe receiver attains long life.\nDivine *Qi* of the Four Darknesses,\nConverge and restrain Mount Feng.\nBind and dispatch the Six Heavens—\nWho dares delay?\nHide, vile and hideous ones!\nEight Directions’ mighty spirits,\nAll submit to my Perfection.\nSwiftly, swiftly, as decreed by law!\"*",
      "start_char": 1761,
      "end_char": 2338,
      "start_sentence": 65,
      "end_sentence": 82,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.074454307556152,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\七元召魔伏六天神咒经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}