{
  "source_id": "七真年谱",
  "source_file": "chunked_daozang\\七真年谱.json",
  "total_chunks": 8,
  "total_original_chars": 7233,
  "total_translated_chars": 44014,
  "total_translation_time": 212.07075905799866,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
    "category": "谱箓类"
  },
  "full_translation": "**Chronological Biography of the Seven Perfected Ones**\n*Text Title:* *Chronological Biography of the Seven Perfected Ones* (七真年谱). One fascicle. Compiled by Li Daoqian of the Yuan dynasty.\n\n*Source Text:* *Daoist Canon of the Zhengtong Era* (《正統道藏》), *Dongzhen* Section, *Pulu* Category.\n\n**Chronological Biography of the Seven Perfected Ones**\nCompiled by Li Daoqian of Yishan, Disciple of the Gate\n\nIn the second year of the Zhenghe reign of Emperor Huizong of the Song (壬辰, 1112), Ancestral Master Chongyang was born on the twenty-second day of the twelfth lunar month.\n\nAccording to the *Biography* composed by Wang Cui of Beiping: The Founding Patriarch of the Quanzhen School, Wang Zhe, styled Zhiming and known as Master Chongyang (重陽子), was a native of Xianyang in Jingzhao. His family was renowned for its wealth and prominence, later relocating to Liujiang Village in Zhongnan County. His mother conceived after dreaming an extraordinary dream, and after twenty-four months of gestation, he was born, initially named Zhongfu and styled Yunqing.\n\nFrom childhood, he stood apart from his peers. In adulthood, he possessed a handsome beard and brows, a robust and imposing stature, and a bold, unconstrained spirit, unconcerned with trivial conventions. In his youth, he pursued the path of the imperial examinations, enrolled in the Jingzhao Academy, and excelled in composition. His literary talent was swift and incisive, and he once ranked first among scholars in the regional examinations.\n\nYet he harbored a fondness for archery and horsemanship. In the early years of the Jin dynasty’s Tianjuan era, he responded to a call for martial talent, adopting the name Shixiong and the style Dewei. Later, upon entering the Dao, he reverted to his present name and style, though he continued to refer to himself as \"the one afflicted by wind.\"\n\nIn the third year of the Zhenghe era, *guisi* (1113), Master Chongyang was two years old.\nIn the fourth year of the Zhenghe era, *jiawu* (1114), Master Chongyang was three years old.\nIn the fifth year of the Zhenghe era, *yiwei* (1115), Master Chongyang was four years old.\nIn the sixth year of the Zhenghe era, *bingshen* (1116), Master Chongyang was five years old.\nIn the seventh year of the Zhenghe era, *dingyou* (1117), Master Chongyang was six years old.\nIn the first year of the Chonghe era, *wuxu* (1118), Master Chongyang was seven years old.\nIn the first year of the Xuanhe era, *jihai* (1119), Master Chongyang was eight years old.\n\nOn the fifth day of the first lunar month this year, the Pure and Tranquil Immortal Lady Sun was born in Ninghai Prefecture.\n\nIn the second year of the Xuanhe era, *gengzi* (1120), Master Chongyang was nine years old.\nIn the third year of the Xuanhe era, *xinchou* (1121), Master Chongyang was ten years old.\nIn the fourth year of the Xuanhe era, *renyin* (1122), Master Chongyang was eleven years old.\nIn the fifth year of the Xuanhe era, *guimao* (1123), Master Chongyang was twelve years old.\n\nOn the first day of the third lunar month this year, the Perfected Lord Tan of Everlasting Truth was born in Ninghai Prefecture, initially named Yu and styled Boyu. On the twentieth day of the fifth lunar month, the Perfected Lord Ma of Cinnabar Yang was born in Jiangxian Alley of present-day Ninghai. According to tradition, his original name was Congyi, styled Yifu, and he was a native of Fufeng in Guanzhong. During the Five Dynasties’ turmoil, his family relocated to the coastal region.\n\nIn the sixth year of the Xuanhe era, *jiachen* (1124), Master Chongyang was thirteen years old.\nIn the seventh year of the Xuanhe era, *yisi* (1125), Master Chongyang was fourteen years old.\nIn the first year of the Jingkang era of Emperor Qinzong, *bingwu* (1126), Master Chongyang was fifteen years old.\nIn the fifth year of the Tianhui era of Emperor Taizong of Jin, *dingwei* (1127), Master Chongyang was sixteen years old.\nIn the sixth year of the Tianhui era, *wushen* (1128), Master Chongyang was seventeen years old.\nThis year, the Perfected Lord Tan of Everlasting Truth was six years old. According to the stele inscription of the Perfected Lord composed by the Duke of Mi: at six years old, while playing, he fell into a well. As people rushed to rescue him, they saw him sitting calmly atop the water, and he was pulled out unharmed.\nIn the seventh year of the Tianhui era, *jiyou* (1129), Master Chongyang was eighteen years old.\nIn the eighth year of the Tianhui era, *gengxu* (1130), Master Chongyang was nineteen years old.\nIn the ninth year of the Tianhui era, *xinhai* (1131), Master Chongyang was twenty years old.\nIn the tenth year of the Tianhui era, *renzi* (1132), Master Chongyang was twenty-one years old.\nIn the eleventh year of the Tianhui era, *guichou* (1133), Master Chongyang was twenty-two years old.\nIn the twelfth year of the Tianhui era, *jiayin* (1134), Master Chongyang was twenty-three years old.\nIn the thirteenth year of the Tianhui era, *yimao* (1135), Master Chongyang was twenty-four years old.\nIn the fourteenth year of the Tianhui era, *bingchen* (1136), Master Chongyang was twenty-five years old.\nIn the fifteenth year of the Tianhui era, *dingsi* (1137), Master Chongyang was twenty-six years old.\nThis year, the Perfected Lord Tan of Everlasting Truth was fifteen years old. The stele inscription of the Perfected Lord composed by the Duke of Mi states: at fifteen, he devoted himself to learning, and his *Grapevine Verse* had already become widely celebrated.\nIn the first year of the Tianjuan era, *wuwu* (1138), Master Chongyang was twenty-seven years old.\nAccording to tradition: at the beginning of the Tianjuan era, he participated in the military examinations, changing his name to Shixiong and his style to Dewei.\nIn the second year of the Tianjuan era, *jiwei* (1139), Master Chongyang was twenty-eight years old.\nIn the third year of the Tianjuan era, *gengshen* (1140), Master Chongyang was twenty-nine years old.\nOn the third day of the first lunar month, the Perfected Lord Hao of Broad Tranquility was born in Ninghai Prefecture, initially named Sheng; his style is unknown.\nIn the first year of the Huangtong era, *xinyou* (1141), Master Chongyang was thirty years old.\nIn the second year of the Huangtong era, *renxu* (1142), Master Chongyang was thirty-one years old.\nOn the eighteenth day of the third lunar month this year, the Perfected Lord Wang of Cinnabar Yang was born in Ninghai Prefecture.\nIn the third year of the Huangtong era, *guihai* (1143), Master Chongyang was thirty-two years old.\nIn the fourth year of the Huangtong era, *jiazi* (1144), Master Chongyang was thirty-three years old.\nIn the fifth year of the Huangtong era, *yichou* (1145), Master Chongyang was thirty-four years old.\nIn the sixth year of the Huangtong era, *bingyin* (1146), Master Chongyang was thirty-five years old.\nIn the seventh year of the Huangtong era, *dingmao* (1147), Master Chongyang was thirty-six years old.\nOn the twelfth day of the seventh lunar month, the Perfected Lord Liu of Everlasting Life was born in Wuguan Village of Donglai.\nIn the eighth year of the Huangtong era, *wuchen* (1148), Master Chongyang was thirty-seven years old.\nOn the nineteenth day of the first lunar month this year, the Perfected Lord Qiu of Everlasting Spring was born in Bindu of Qixia County in Dengzhou.\nThe Perfected Lord Wang of Cinnabar Yang was seven years old. According to the preface of the *Cloud Radiance Collection* by the Perfected Lord himself: at seven years old, I encountered the August Lord of Floriate Brilliance in midair, who awakened me to avoid ignorance.\nIn the first year of the Tiande era of Hailing, *jisi* (1149), Master Chongyang was thirty-eight years old.\nIn the second year of the Tiande era, *gengwu* (1150), Master Chongyang was thirty-nine years old.\nIn the third year of the Tiande era, *xinwei* (1151), Master Chongyang was forty years old.\nIn the fourth year of the Tiande era, *renshen* (1152), Master Chongyang was forty-one years old.\nIn the first year of the Zhenyuan era, *guiyou* (1153), Master Chongyang was forty-two years old.\nIn the second year of the Zhenyuan era, *jiaxu* (1154), Master Chongyang was forty-three years old.\nIn the third year of the Zhenyuan era, *yihai* (1155), Master Chongyang was forty-four years old.\nIn the first year of the Zhenglong era, *bingzi* (1156), Master Chongyang was forty-five years old.\nIn the second year of the Zhenglong era, *dingchou* (1157), Master Chongyang was forty-six years old.\nIn the third year of the Zhenglong era, *wuyin* (1158), Master Chongyang was forty-seven years old.\nIn the fourth year of the Zhenglong era, *jimao* (1159), Master Chongyang was forty-eight years old.\nThis year, on the fifteenth day of the sixth lunar month, the Master drank wine at Ganhe Town in Zhongnan. There, he encountered two immortals with unbound hair and felt cloaks, their ages and appearances identical. One of them slowly said: \"This one is teachable.\" They then transmitted oral instructions to him. Thus, the Master’s poem *Encountering the Perfected* states: \"At forty-eight, I first met them; the oral instructions transmitted brought immediate attainment.\" Those he encountered were the Perfected Lord Lü of Pure Yang.\nIn the fifth year of the Zhenglong era, *gengchen* (1160), Master Chongyang was forty-nine years old.\nOn the Mid-Autumn Festival, the Master encountered the Perfected Immortals again in Liquan County, who transmitted five secret verses to him and said: \"Hasten to the eastern sea and seek Tan and Ma.\" Soon after, the Perfected Immortals vanished without a trace.\nIn the first year of the Dading era of Emperor Shizong, *xinsi* (1161), Master Chongyang was fifty years old.\nAt Nanshi Village in Zhongnan, he dug a pit over a *zhang* deep, sealed it several *chi* high, and called it the \"Tomb of the Living Dead.\" He sat within it.\nHe also planted a crabapple tree at each of the four corners. When asked the reason, he replied: \"In the future, I shall unify the teachings of the four seas into one family.\"\nIn the second year of the Dading era, *renwu* (1162), Master Chongyang was fifty-one years old.\nThis year, he sat in the \"Tomb of the Living Dead.\"\nIn the third year of the Dading era, *guiwei* (1163), Master Chongyang was fifty-two years old.\nIn autumn, he filled the \"Tomb of the Living Dead\" and moved to Liujiang Village, where he built a thatched hut and resided with Master Yuchan He and Master Lingyang Li—this is the present-day ancestral court, Chongyang Wanshou Palace.\nIn the fourth year of the Dading era, *jiashen* (1164), Master Chongyang was fifty-three years old.\nThe Master’s preface to the *Complete Perfection Collection* states: Once, I carried a gourd of wine from Ganhe, intending to return to my hut. On the way, I met a gentleman who called out: \"You who suffer from madness, will you share your wine with me?\" I gave it to him, and he drank it all in one draught. He then instructed me to fill the gourd with river water. I did so and handed it to him. He returned it to me, telling me to drink it—it was the wine of the immortal’s carriage.\n\nThe Master further asked: \"Do you know Liu Haichan?\"\nI replied: \"I have only seen his portrait.\"\nThe Master laughed and departed.\n\nIn the fifth year of the Dading era, *yiyou* (1165), Master Chongyang was fifty-four years old. That year, he wrote on the wall of the Upper Clarity Great Peace Palace on Mount Zhongnan:\n*\"Madness, madness—old illness flares,*\n*Life’s span no more than fifty-eight.*\n*Two masters Yu come to settle,*\n*One spirit, true nature—search and sweep.\"*\n\nIn the sixth year of the Dading era, *bingxu* (1166), Master Chongyang was fifty-five years old. That year, he wrote on the wall of Lü the Daoist’s hut in Luancun, Chang’an:\n*\"Earth’s lung, Chongyangzi,*\n*Called Wang the Mad One.*\n*Coming, long days and months;*\n*Departing, free as west or east.*\n*Cloud and water as companions,*\n*Void and emptiness as neighbors.*\n*One spirit, true nature abides—*\n*Not the same as the crowd’s heart.\"*\n\nThat year, Perfected Lord Changchun, at nineteen years of age, renounced the world and entered the Dao, residing on Kunjian Mountain.\n\nIn the seventh year of the Dading era, *dinghai* (1167), Master Chongyang was fifty-six years old. On the twenty-sixth day of the fourth month, he set fire to the thatched hut in Liujiang Village himself, dancing gracefully by the flames. When asked why, he replied:\n*\"The thatched hut burns—matter done,*\n*Next, let all people cultivate instead.\"*\n\nThat night, he lodged in Ganhe Town and took leave of the assembly, saying: \"I go to the Eastern Sea to catch a horse.\" In the fifth month, he passed through the Upper Clarity Palace on North Yushan, where he inscribed on its wall:\n*\"Qiu, Tan, Wang, Feng—catching horses with Liu,*\n*On Kunlun’s peak, striking jade balls.*\n*If you still wander within the mortal sea,*\n*You’ll win three thousand eight hundred tallies.\"*\n\nThe stone inscription remains to this day. On the eighteenth day of the intercalary seventh month, he arrived in Ninghai Prefecture, where he met Perfected Lord Danyang and Gao Jucai, inviting the Master to the Pavilion of Joyful Old Age of Fan Mingshu.\n\nIn the ninth month, Perfected Lord Changchun journeyed from Kunjian Mountain to pay homage to the Patriarch at Quanzhen Hermitage. He requested to become a disciple, and the Patriarch bestowed upon him the Daoist name *Chuji*, the courtesy name *Tongmi*, and the sobriquet *Changchunzi*, then presented him with a poem.\n\nThe Patriarch further sat with his back turned before the divination stall of Perfected Lord Guangning, inspiring him to follow. Guangning accompanied him to Chaoyuan Abbey, where the Patriarch transmitted oral instructions and bestowed two *ci* poems upon him.\n\nOn the first day of the tenth month, the Patriarch secluded himself within a locked chamber in Danyang’s residence, setting a hundred-day term. He ate but once every five days, converting Danyang and his wife. That winter, Perfected Lord Changzhen took ordination within the enclosure. The Patriarch bestowed upon him the Daoist name *Chuduan*, the courtesy name *Tongzheng*, and the sobriquet *Changzhenzi*. At the time, he was forty-five years old.\n\nIn the *wuzǐ* year of the Dading reign (1168), the Patriarch Wang Chongyang was fifty-seven. On the tenth day of the first month, he emerged from seclusion, having completed ten transformations of the pear. On the eighth day of the second month, Perfected Lord Danyang took ordination. The Patriarch bestowed upon him the Daoist name *Gang*, the courtesy name *Xuanbao*, and the sobriquet *Danyangzi*. He was then forty-six. On that same day, Perfected Lord Yuyang arrived from Niuxian Mountain, wishing to become a disciple. The Patriarch bestowed upon him the Daoist name *Chuyi*. He was twenty-seven.\n\nOn the last day of the second month, the Patriarch led Danyang, Changzhen, Changchun, and Yuyang into Kunjian Mountain at the mouth of Stone Gate, where they opened Yanxia Grotto and took up residence. In the third month, Perfected Lord Guangning came to Kunjian Mountain to take ordination. The Patriarch bestowed upon him the Daoist name *Lin* and the sobriquet *Tianranzi*. He was twenty-nine.\n\nIn the eighth month, the Patriarch led the five perfected ones from Yanxia Grotto to relocate to Jiangshi Hermitage in Wendeng County, where he established the Seven Treasures Assembly. In the *jǐchǒu* year of the Dading reign (1169), the Patriarch was fifty-eight. In spring, Perfected Lord Yuyang took leave of the Patriarch and retired to seclusion on Zha Mountain.\n\nIn the fourth month, the Patriarch led Danyang, Changzhen, Changchun, and Guangning to relocate to Golden Lotus Hall in Ninghai Prefecture. En route, they passed through Longquan, where the Patriarch’s umbrella handle, which contained the sobriquet *Jieyangzi*, was carried away by the wind and fell before Perfected Lord Yuyang on Zha Mountain—this was the name bestowed upon him.\n\nOn the fifth day of the fifth month, Sun the Immortal Maiden arrived at Golden Lotus Hall to take ordination. The Patriarch bestowed upon her the Daoist name *Buer* and the sobriquet *Qingjin Sanren*. She was fifty-one. In the sixth month, Perfected Lord Guangning took leave of the Patriarch and also retired to Zha Mountain.\n\nIn the eighth month, the Patriarch established the Golden Lotus Assembly. In the ninth month, he journeyed to Fushan County in Dengzhou, where he established the Three Lights Assembly, and to Penglai, where he established the Jade Splendor Assembly. That month, the Patriarch led Danyi, Changzhen, and Changchun west to Laizhou, where he converted Perfected Lord Changsheng to ordination. He bestowed upon him the Daoist name *Chuxuan*, the courtesy name *Tongmiao*, and the sobriquet *Changshengzi*. He was twenty-three.\n\nIn the tenth month, he established the Equality Assembly in Yexian County. That month, he led the four disciples to Bianliang, lodging at the porcelain merchant Wang’s inn. In the *gēngyín* year of the Dading reign (1170), on the fourth day of the first month, the Patriarch summoned Danyang, Changzhen, and Changchun to stand at his bedside. Changsheng had already departed in concealment. The Patriarch said: *\"Danyang has attained the Dao; Changzhen has comprehended the Way. I have no concerns. As for Chuji’s studies, let him follow Danyang. As for Chuxuan, let Changzhen take charge of him. Now I go to keep my appointment with the Perfected of my teacher.\"* Danyang requested a parting hymn, and the Patriarch replied: *\"I have already written it at Lüxian Hermitage in Luancun, Chang’an. Now I shall recite it for you.\"* With these words, he passed away. That year, in the intercalary fifth month, spring began on the eleventh day of the first month, and he was fifty-eight at his passing.\n\nThe four disciples observed full rites and temporarily interred him in Meng Zongxian’s flower garden. Later, Perfected Lord Danyang led the three companions into Guanzhong to pay respects to the two perfected ones, He and Li, at Taiping Abbey in Zhongnan. They met Shi Chuhou in Jingzhao, Liu Tongwei and Yan Chuchang in Zhongnan. The two perfected ones were friends of the Patriarch, and the three disciples were also disciples of the Patriarch.\n\nIn the *xīnmǎo* year of the Dading reign (1171), Perfected Lord Danyang was forty-nine. That year, he and the three companions resided at the Patriarch’s hermitage in Liujiang, repairing the burial site. In the tenth month, Perfected Lord Guangning entered Guanzhong, begging alms in Jingzhao Prefecture.\n\nIn the *rénchén* year of the Dading reign (1172), Perfected Lord Danyang was fifty. In spring, he converted natural coins in Chang’an and led the three companions back to Bianliang to transport the Patriarch’s immortal remains west for burial at the Patriarch’s hermitage in Liujiang Village. In the ninth month, Perfected Lord Guangning traveled west to Qishan, where he encountered one named *Datong*, with the courtesy name *Taigu*, and the sobriquet *Guangningzi*.\n\nIn the *guǐsì* year of the Dading reign (1173), Perfected Lord Danyang was fifty-one. That year, the four masters observed mourning and guarded the tomb at Liujiang. In the sixth month, Perfected Lord Guangning crossed the Great Celebration Pass and returned east.\n\nIn the *jiǎwǔ* year of the Dading reign (1174), Perfected Lord Danyang was fifty-two. In the second month, Perfected Lord Qingning arrived in Zhen Ding and sat in silence outside Chaotian Gate. In the eighth month, Danyang, Changzhen, Changsheng, and Changchun sat together one moonlit night at the Zhenwu Temple in Qin Crossing, Hu County, each declaring their aspirations. Danyang embraced poverty, Changzhen served the state, Changsheng lacked resolve, and Changchun sought reclusion. At dawn, they parted ways. Danyang resided in the enclosure at Liujiang, Changzhen at Chaoyuan Abbey in Luoyang, Changsheng at the Earth God Temple in Luoyang’s marketplace, and Changchun journeyed west into Fanxi. These events are recorded in *The Gold and Jade Collection*.\n\nIn the *yǐwèi* year of the Dading reign (1175), Perfected Lord Danyang was fifty-three. That year, Perfected Lord Changzhen begged alms at Erzu Town in Cizhou, where a madman struck out two of his teeth. The townspeople were enraged and wished to report the matter to the authorities, but the Perfected spat out the teeth and departed. In the second month, Perfected Lord Guangning sat beneath the stone bridge in Wozhou. In summer, the Venerable Qingjin entered Guanzhong to offer sacrifices at the Patriarch’s sanctuary, then left Guanzhong to reside in the Wind Immortal Maiden’s Grotto in Luoyang.\n\nIn the *bǐngshēn* year of the Dading reign (1176), Perfected Lord Danyang was fifty-four. That year, Perfected Lord Changzhen traveled through Cizhou and resided at Baijia Beach. In the sixth month, Perfected Lord Guangning dreamed at night of a divine being who once more imparted the profound meaning of the *Book of Changes*; upon waking, he drew thirty-three diagrams the following morning. This is recorded in *The Grand Antiquity Collection*.\n\nIn the *dīngyǒu* year of the Dading reign (1177), Perfected Lord Danyang was fifty-five. Perfected Lord Changzhen performed his teachings in Gaotang County, where he wrote the characters for \"tortoise\" and \"serpent\" for Wu Liu of the tea shop, saying: \"Place these on the wall to suppress fire disasters.\" That year, the county town suffered a great fire, but the tea shop alone was spared.\n\nIn the *wùxū* year of the Dading reign (1178), Perfected Lord Danyang was fifty-six. On the first day of the eighth month, Liu Jiang departed Huan and journeyed west to Luoshan and Huating to perform his teachings. Perfected Lord Changsheng moved that year to reside in Yunxi Grotto northeast of Luoyang; his disciples gathered daily, and they carved out three wells in the grotto.\n\nIn the *jǐhài* year of the Dading reign (1179), Perfected Lord Danyang was fifty-seven. On the fifteenth day of the second month, he took Li Dacheng to reside in Huan for a hundred days, then moved to Youde Abbey in Longzhou in the eighth month. After residing in Huan for eleven months, he departed on the eighteenth day, lodged at Goudou Fortress, and converted Jie Yuan Li Zihe to the Dao. Perfected Lord Changzhen traveled through Weizhou and resided at the Prefectural Lord’s Temple in Huojia County.\n\nIn the *gēngzǐ* year of the Dading reign (1180), Perfected Lord Danyang was fifty-eight. That spring, Zhao Penglai of Zhangtai Street in Jingzhao donated his residence to be converted into an abbey and invited the Perfected to reside in Huan. On the twenty-fourth day of the eighth month, the officials and commoners of Chang’an requested prayers for rain; the Perfected composed a poem, promising rain by the twenty-fifth day, and the rain arrived as predicted on that day. See *The Gold and Jade Collection*. Perfected Lord Changzhen traveled west to Tongzhou and resided at Xili Abbey. Perfected Lord Changchun moved from Fanxi to reside on Longmen Mountain in Longzhou.\n\nIn the *xīnchǒu* year of the Dading reign (1181), Perfected Lord Danyang was fifty-nine. In early April, he resided in Huan within the Bamboo Garden Abbey of Zhang Chaosan in Liujiang Village, Huo County. After conducting the Yellow Register Retreat on the Zhongyuan Festival, he returned to the ancestral abbey. Perfected Lord Changzhen resided in Chunyang Grotto in Huayin County, while Perfected Lord Changsheng returned east to Laizhou.\n\nIn the *rényín* year of the Dading reign (1182), Perfected Lord Danyang was sixty. That year, in the fourth month, he returned east to Ninghai, and in the twelfth month, he performed his teachings in Wendeng, where many fishermen burned their nets. On the eighth day, a mirage appeared above the South Sea, and scholars celebrated it with poetry. Perfected Lord Changsheng resided in Wu Officials, building an abbey, and lectured on the *Scripture of the Dao and Its Virtue* and the *Yellow Court Scripture*. In autumn, Perfected Lord Yuyang came to Ninghai to pay respects to Perfected Lord Danyang, and they lodged together in the Golden Lotus Hall. Perfected Lord Guangning resided in Zhen Ding Prefecture, where he ascended the dais to expound the Dao; his audience often numbered in the hundreds. On the twenty-ninth day of the twelfth month, Immortal Sun Qingzhen ascended to the heavens in Luoyang at the age of sixty-four.\n\nIn the *guǐmǎo* year of the Dading reign (1183), Perfected Lord Danyang was sixty-one. In the fourth month, he performed his teachings in Zhiyang. On the Xiayuan Festival, he conducted a retreat in Wendeng, where the Patriarch appeared in the sky above a white tortoise. On the twenty-second day of the twelfth month, Perfected Lord Danyang ascended to the heavens at Yuxian Palace in Laiyang County. Perfected Lords Changsheng and Yuyang jointly oversaw the funeral rites, guarding the tomb for a hundred days before each returning to their secluded abodes.\n\nIn the *jiǎchén* year of the Dading reign (1184), Perfected Lord Changzhen was sixty-two. On the eighteenth day of the first month, Perfected Lord Changsheng conducted a retreat at the home of Jiang Shouzhen in Changyang County. Between the hours of *si* and *wu*, Patriarch Chongyang appeared in the sky wearing a cloud crown and crimson robes, while Perfected Lord Danyang appeared with three topknots, both manifesting amidst colorful clouds. In the fifth month, during a drought, the prefect of Deng Prefecture invited Perfected Lord Changsheng to pray for rain, and a mirage appeared above Bamboo Island. The following day, Perfected Lord Danyang appeared to the northwest of Yingxian Bridge, and on that day, the rain was abundant.\n\nIn the *yǐsì* year of the Dading reign (1185), Perfected Lord Changzhen was sixty-three. On the first day of the fourth month, he ascended to the heavens at Chaoyuan Abbey in Luoyang. His poems and verses on expounding the Dao and interacting with the world, titled *The Water and Cloud Collection*, circulated widely.\n\nIn the *bǐngwǔ* year of the Dading reign (1186), Perfected Lord Changsheng was forty. In winter, Perfected Lord Changchun descended Longmen Mountain and resided at the ancestral abbey on Zhongnan.\n\nIn the *dīngwèi* year of the Dading reign (1187), Perfected Lord Changsheng was forty-one. On the thirteenth day of the eleventh month, Perfected Lord Yuyang received an imperial summons to Yan. The Emperor inquired about the principles of prolonging life, to which the Master replied: \"Cherishing essence and preserving spirit are the essentials of cultivating the body; governing with uprightness and non-action is the foundation of ruling the realm.\" The Emperor treated him with the rites due to one beyond the world.\n\nIn the *wùshēn* year of the Dading reign (1188), Perfected Lord Changsheng was forty-two. That year, in the second month, Perfected Lord Changchun received an imperial edict to attend court. On the eleventh day, he was ordered by imperial decree to preside over the Wanchun Festival Retreat and was bestowed with a headscarf and robe. In April, he resided at Gong Abbey. On the eighteenth day of the fifth month, he was summoned for an audience at Longsong Island. In the seventh month, he presented five compositions in response to the imperial command. On the Mid-Autumn Festival, he received an edict to return to Zhongnan Mountain. That month, Perfected Lord Yuyang also received an edict to return to his mountain. In the twelfth month, the Emperor fell ill, and an envoy was dispatched to summon Perfected Lord Yuyang once more. The Perfected said to the envoy: \"I fear I shall not again behold the Son of Heaven’s countenance.\"\n\nIn the *jǐyǒu* year of the Dading reign (1189), Perfected Lord Changsheng was forty-three. On the third day of the first month, Perfected Lord Yuyang arrived in the capital. The heir apparent commanded the Perfected to preside over the retreat for the late Emperor before returning.\n\nIn the first year of the Mingchang reign of Emperor Zhangzong (1190), Perfected Lord Changsheng was forty-four. On the Double Fifth Festival, Liu Zhi of Laiyang County invited Perfected Lord Yuyang to conduct a retreat and informed the Master of his lack of an heir. The Master replied: \"You are wealthy and fond of propriety; you should not be without descendants.\"\n\nThe Master wrote the four characters \"Four-Four Perfected\" and said, \"A son shall be born on the fourteenth day of the fourth month next year.\" When the child was born, Liu Zhi came to request a name, and the Master said: \"I have already given him the name Perfected. Today is the descent day of the Pure Yang Perfected Lord.\"\n\nIn the second year of the Mingchang reign (1191), Perfected Lord Changsheng was forty-five. In the tenth month of this year, Perfected Lord Changchun returned east to Qixia, residing at the TaiXu Abbey.\n\nIn the third year of the Mingchang reign (1192), Perfected Lord Changsheng was forty-six. In the tenth month of winter, Perfected Lord Changchun conducted a retreat at Zhiyang Grotto.\n\nIn the fourth year of the Mingchang reign (1193), Perfected Lord Changsheng was forty-seven.\n\nIn the fifth year of the Mingchang reign (1194), Perfected Lord Changsheng was forty-eight. In the ninth month of autumn, Perfected Lord Changchun conducted a retreat in Fushan County; the Heavenly Gate opened, and auspicious cranes appeared. A poem on this event is recorded in *Fanxi Collection*.\n\nIn the sixth year of the Mingchang reign (1195), Perfected Lord Changsheng was forty-nine.\n\nIn the first year of the Cheng’an reign (1196), Perfected Lord Changsheng was fifty.\n\nIn the second year of the Cheng’an reign (1197), Perfected Lord Changsheng was fifty-one. In the sixth month, Perfected Lord Yuyang was summoned. On the third day of the seventh month, he was received in the side hall and granted a seat. The Emperor inquired about the Way of nurturing life, and the audience lasted until dusk before he returned. The following day, the Emperor bestowed upon him the title \"Master of Embracing the Mystery\" and a purple robe, and ordered the construction of Xiuzhen and Chongfu Abbeys in the capital, allowing the Perfected to reside in either as he pleased. A monthly stipend of two hundred strings of cash was granted for vegetarian meals. In winter, Perfected Lord Changsheng was summoned to court. The Emperor inquired about the Supreme Dao, and the Master replied: \"The essence of the Supreme Dao lies in moderating desires to secure bodily peace and lightening taxes to ensure national prosperity.\" The Emperor said: \"These are the words of Master Guangcheng.\" He then ordered accommodations and provisions be arranged for the Master at Tianchang Abbey.\n\nIn the third year of the Cheng’an reign (1198), Perfected Lord Changsheng was fifty-two. His responses fully accorded with the Emperor’s wishes. In the third month, he received the imperial decree to return to his mountain retreat. Five abbey plaques were bestowed: *Lingxu*, *Taiwei*, *Longxiang*, *Jixian*, and *Miaozhen*, with orders to establish abbeys and ordain Daoists. Perfected Lord Yuyang remained in the capital.\n\nIn spring, Master Lü of Zhongnan arrived in the capital. The Master requested that the ancestral abbey be named Lingxu Abbey and entrusted the imperial decree to Lü, appointing him to oversee the abbey’s affairs. A poem was composed to see him off. In summer, the Master received the decree to return east to attend to his parents.\n\nIn the fourth year of the Cheng’an reign (1199), Perfected Lord Changsheng was fifty-three. This year, Perfected Lord Changchun conducted a retreat at Zhiyang.\n\nIn the fifth year of the Cheng’an reign (1200), Perfected Lord Changsheng was fifty-four.\n\nIn the first year of the Taihe reign (1201), Perfected Lord Changsheng was fifty-five. This year, he traveled to Guangling and composed *On the Daoist Principles of Sin and Fortune*.\n\nPerfected Lord Yuyang received an imperial decree to conduct a universal retreat at Taiqing Abbey in Bozhou. A poem on this event is recorded in *Yunguang Collection*.\n\nIn the second year of the Taihe reign (1202), Perfected Lord Changsheng was fifty-six. He conducted a retreat in Binzhou, where jade blossoms and jade trees appeared as auspicious signs. A poem on this event is recorded in *Panyang Collection*. Perfected Lord Changchun conducted a retreat at Zhiyang.\n\nIn the third year of the Taihe reign (1203), Perfected Lord Changsheng was fifty-seven. On the sixth day of the second month this year, he ascended as an immortal at Lingxu Abbey in Wuguan.\n\nPerfected Lord Yuyang received an imperial decree to conduct a universal retreat at Taiqing Abbey in Bozhou, where he ordained over a thousand Daoists at the altar.\n\nIn the fourth year of the Taihe reign (1204), Perfected Lord Changchun was fifty-seven.\n\nIn the fifth year of the Taihe reign (1205), Perfected Lord Changchun was fifty-eight. In the fifth month of summer, he conducted a retreat in Laizhou, where auspicious cranes and colorful clouds appeared. A lyric on this event is recorded in *Fanxi Collection*.\n\nIn the sixth year of the Taihe reign (1206), Perfected Lord Changchun was fifty-nine.\n\nIn the seventh year of the Taihe reign (1207), Perfected Lord Changchun was sixty. The Imperial Consort donated two collections of Daoist scriptures, one sent by courier to Taixu Abbey in Qixia and the other to Yuxu Abbey at Shengshui.\n\nIn the eighth year of the Taihe reign (1208), Perfected Lord Changchun was sixty-one.\n\nIn the first year of the Da’an reign (1209), Perfected Lord Changchun was sixty-two. This year, he traveled to Aoshan, composing twenty poems.\n\nPerfected Lord Yuyang arrived in Beijing on the fourteenth day of the seventh month, invited by Chancellor Böömur. He resided at Huayang Abbey. At that time, a severe drought occurred, and officials and commoners asked the Perfected about the timing of rain. The Perfected said: \"On the seventeenth day, there will be sufficient rain.\" The prediction came true on that day.\n\nIn the *gengwu* year of the Da Yuan reign (1210), Perfected Lord Changchun was sixty-three. In summer, after conducting a retreat in Yutian County, Jizhou, Perfected Lord Yuyang addressed the assembly: \"The qi of the Dao is about to return to the north. Divine beings are moving through the void, and the clashing of blades is visible. Could this not portend suffering for the living?\"\n\nIn the *xinwei* year of the Da Yuan reign (1211), Perfected Lord Changchun was sixty-four. This year, he was summoned from the Eastern Sea to the capital and traveled to Langshan in Dexing. Poems on these events are recorded in *Mingdao Collection*.\n\nIn the *renshen* year (1212), Perfected Lord Changchun was sixty-five. On the thirtieth day of the twelfth month this year, Perfected Lord Guangning ascended as an immortal at Xiantian Abbey in Ninghai Prefecture, aged seventy-three.\n\nIn the *guiyou* year (1213), Perfected Lord Changchun was sixty-six.\n\nIn the *jiaxu* year (1214), Perfected Lord Changchun was sixty-seven. This year, he traveled to Yunjiandong, composing poems.\n\nIn the *yihai* year (1215), Perfected Lord Changshun was sixty-eight.\n\nIn the *bingzi* year (1216), Perfected Lord Changchun was sixty-nine. At that time, he resided in Dengzhou. The Jin ruler sent Wang Tingyu, the military supervisor of Dongping, to deliver an imperial decree summoning the Master to Bianjing. The Master said: \"I follow the principles of Heaven in my actions; wherever Heaven commands, I dare not disobey.\" He then passed away.\n\nIn the *dingchou* year (1217), Perfected Lord Changchun was seventy. Perfected Lord Yuyang ascended as an immortal at Yuxu Abbey in Shengshui on the twenty-third day of the fourth month, aged seventy-six.\n\nIn the *wuyin* year (1218), Perfected Lord Changchun was seventy-one.\n\nIn the *jimao* year (1219), Perfected Lord Changchun was seventy-two.\n\nResiding at Haotian Abbey in Laizhou. At that time, the Qi and Lu regions had fallen to the Song. In the eighth month, the Song ruler sent envoys to summon the Master, who did not rise to respond. The prefect of the state replied: \"With the Master dwelling here, we truly have something to rely upon.\" The Master said: \"My comings and goings are not for the likes of you to know. One day, I fear I may not be able to remain here.\"\n\nThat year, in the fifth month, the Sacred Martial Emperor Taizu, from the Naiman state, dispatched his attendant Liu Zhonglu bearing an imperial edict to summon the Master. In the twelfth month, Zhonglu arrived in Laizhou.\n\nIn the *gengchen* year (1220), Perfected Lord Changchun was seventy-three. In the first month, he set out northward from Laizhou. By the second month, he reached the Yan capital. In the fourth month, officials requested that he perform a jiao ritual at the Taiyi Palace. In the fifth month, he arrived at Dexing Prefecture and lodged at Longyang Abbey. By the eighth month, he reached Xuande Prefecture and stayed at Chaoyuan Abbey.\n\nIn the *xinsi* year (1221), Perfected Lord Changchun was seventy-four. That year, on the first day of the fifth month, he reached the Luju River. By the seventh month, he arrived at Mount Abuqan, where he left Song Dao’an and eight others to establish Qixia Abbey. On the Mid-Autumn Day, he reached Mount Jin, passing through the White Bone Steppe. By the eleventh month, he arrived at the city of Yemisiqan. All these journeys were recorded in verse, as seen in the *Wudao Collection*.\n\nIn the *renwu* year (1222), Perfected Lord Changchun was seventy-five. In the third month of spring, he passed through the Iron Gate and reached the imperial encampment. The Emperor set up two tents to the east of his royal quarters for the Master’s residence. From time to time, he inquired about the supreme Dao. The Master broadly responded with the principles of restraining desires to preserve the body, the Dao of Heaven loving life and abhorring killing, and governance favoring non-action and the principle of clarity and stillness. The Emperor was pleased and ordered the Left Scribe to record these in the annals. For details, see the *Qinghui Record* and *Record of the Western Journey*.\n\nIn the *guiwei* year (1223), Perfected Lord Changchun was seventy-six. On the seventh day of the third month of that year, he received an edict to return east. He was bestowed the title \"Divine Immortal\" and entrusted with overseeing all Daoist affairs throughout the realm. Matters great and small were to be handled at the Divine Immortal’s discretion, with no interference from others. All corvée labor for abbeys was exempted, and local officials were ordered to provide constant protection. In the sixth month, he reached Fengzhou. By the eighth month, he arrived at Xuande Prefecture.\n\nIn the *jiashen* year (1224), Perfected Lord Changchun was seventy-seven. In the second month of spring, he resided at Qiuyang Abbey on Mount Jin. In the third month, officials in the Yan capital requested that he stay at the Taiyi Palace. That month, his immortal retinue entered the Yan capital.\n\nIn the *yiyou* year (1225), Perfected Lord Changchun was seventy-eight. In the ninth month of autumn, Mars trespassed against the Tail constellation, foretelling disaster in the Yan region. The Pacification Commissioner Wang Ji requested that the Master perform a jiao ritual to avert it. Once the ritual was completed, Mars retreated several celestial lodges.\n\nIn the *bingxu* year (1226), Perfected Lord Changchun was seventy-nine. In the fifth month of summer, a great drought afflicted the Yan region. Officials and commoners requested that the Master perform a jiao ritual. Rain fell abundantly in due time, and renowned scholars in the capital all composed poems in celebration.\n\nIn the *dinghai* year (1227), Perfected Lord Changchun was eighty. In summer, a great drought again struck. Scholars and commoners in the capital entreated the Master to perform a jiao ritual. The Master said: \"I was already preparing for the ritual when you came to request it—what is called ‘good deeds coinciding without prior agreement.’\" He further stated that two rituals should be prepared: one on the first day of the fifth month for praying for rain, and another on the third day for celebrating the rain. Later, all unfolded as the Master had foretold.\n\nThat month, he received an edict renaming the Taiyi Palace as the Changchun Palace. In the sixth month, the Taiye Pond dried up, and the northern pass mountain collapsed. Someone reported this to the Master, who smiled and said: \"As the mountain crumbles and the waters dry, I shall soon depart with them.\"\n\nOn the fourth day of the seventh month, the Master said to his disciples: \"Formerly, Master Danyang once gave me a prophecy, saying: ‘After my passing, the Daoist teaching will flourish greatly. In all directions, regions will transform into Daoist villages, and abbeys will be granted names and plaques. You will also preside over grand abbeys, and there will be envoys bearing tokens traveling by post to oversee Daoist affairs. This will be the time for you to achieve your work, fulfill your name, and retire.’ Now, every word of Master Danyang’s prophecy has come to pass. I depart without regret.\"\n\nOn the ninth day, he ascended to the Baoxuan Hall, left a final hymn, and passed away.\n\n**Postscript**\nThe compilation of chronological records by the ancients is a long-standing practice, intended to document the truth of their comings and goings, allowing later generations to examine and observe them.\n\nThough the Seven Perfected of our Mysterious Gate roamed beyond the world, their Dao truly filled the human realm. During the revolution of our imperial dynasty, their salvific and beneficent deeds were not insignificant. Thus, Li Han of Fenglong, styled Jingzhai, said: \"The salvation of the Seven Perfected was truly the heart of the Supreme Emperor. The Supreme Emperor’s love for the people was truly expressed through the teachings of the Seven Perfected. Otherwise, why would Heaven have brought forth a sagely emperor to pacify the Four Seas, and Heaven have brought forth Changchun to assist the great mandate, gathering essence and spirit together, beginning and ending as one?\" From this, the truth is self-evident.\n\nIn my spare moments from burning incense and reciting scriptures, I, in my presumptuous ignorance, have broadly examined the collected works of the Perfected Masters and various biographies compiled by others. Beginning with the year of Ancestral Master Chongyang’s descent into the world and concluding with the autumn of Perfected Lord Changchun’s ascension as an immortal—a span of one hundred and sixteen years—I have arranged their comings, goings, and deeds in detailed order, compiling them into a single record.\n\nWhere discrepancies arose between one or two biographies and the collected works of the Perfected Masters, I discarded the biographies in favor of the collected works, for the collected works preserve the truest records, while biographies may lack detail.\n\nAlas! The grand trajectory of the Seven Perfected is now complete. As for the Perfected Masters’ dwelling in stillness yet manifesting like dragons, thundering in voice yet profound in silence, moving as spirits with Heaven following, and the subtleties of their effortless non-action—these cannot be fully captured by brush or tongue. What I have recorded here merely touches upon their cultivation of the Dao and establishment of teachings, offering a modest introduction for beginners. May those who aspire to higher truths know whom to revere as their foundation. I dare not presume this record to be exhaustive for my fellow practitioners.\n\nRespectfully inscribed by Li Daoqian, styled Tianle Daoren, on the Zhongyuan Festival of the *xinsi* year of the Zhiyuan era (1271), at the Yunxi Abbey in the Ancestral Court of Mount Zhongnan.\n\n**The Chronological Record of the Seven Perfected concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "七真年谱 经名：七真年谱。 一卷。 元李道谦撰。 底本出处：《正统道藏》洞真部谱录类。 七真年谱 门下夷山李道谦编 宋徽宗政和二年壬辰，重阳祖师生於是年十二月二十二日。 按北平王粹所撰传云：全真祖师王嘉字知明，号重肠子，京兆咸阳人。 世以赀产着姓，后迁终南县刘蒋村。 其母感异梦而妊，及二十有四月乃生，始名中孚，字允卿。 自稚不群，既长，美须眉，躯干雄伟，志个傥，不拘小节。 弱冠修进士业，系京兆学籍，善於属文，才思敏捷，尝解试一路之士。",
      "translated_text": "**Chronological Biography of the Seven Perfected Ones**\n*Text Title:* *Chronological Biography of the Seven Perfected Ones* (七真年谱). One fascicle. Compiled by Li Daoqian of the Yuan dynasty.\n\n*Source Text:* *Daoist Canon of the Zhengtong Era* (《正統道藏》), *Dongzhen* Section, *Pulu* Category.\n\n**Chronological Biography of the Seven Perfected Ones**\nCompiled by Li Daoqian of Yishan, Disciple of the Gate\n\nIn the second year of the Zhenghe reign of Emperor Huizong of the Song (壬辰, 1112), Ancestral Master Chongyang was born on the twenty-second day of the twelfth lunar month.\n\nAccording to the *Biography* composed by Wang Cui of Beiping: The Founding Patriarch of the Quanzhen School, Wang Zhe, styled Zhiming and known as Master Chongyang (重陽子), was a native of Xianyang in Jingzhao. His family was renowned for its wealth and prominence, later relocating to Liujiang Village in Zhongnan County. His mother conceived after dreaming an extraordinary dream, and after twenty-four months of gestation, he was born, initially named Zhongfu and styled Yunqing.\n\nFrom childhood, he stood apart from his peers. In adulthood, he possessed a handsome beard and brows, a robust and imposing stature, and a bold, unconstrained spirit, unconcerned with trivial conventions. In his youth, he pursued the path of the imperial examinations, enrolled in the Jingzhao Academy, and excelled in composition. His literary talent was swift and incisive, and he once ranked first among scholars in the regional examinations.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 219,
      "start_sentence": 0,
      "end_sentence": 12,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.066812753677368,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "然颇喜弓马，金天眷初乃慨然应武略，易名世雄，字德威。 后入道，改称今名字焉，仍以害风自呼之。 政和三年癸巳，重阳祖师二岁。 政和四年甲午，重阳祖师三岁。 政和五年乙未，重阳祖师四岁。 政和六年丙申，重阳祖师五岁。 政和七年丁酉，重阳祖师六岁。 重和元年戊戌，重阳祖师七岁。 宣和元年己亥，重阳祖师八岁。 此年正月初五日，清净孙仙姑生於宁海州。 宣和二年庚子，重阳祖师九岁。 宣和三年辛丑，重阳祖师十岁。 宣和四年壬寅，重阳祖师年十一。 宣和五年癸卯，重阳祖师年十二。 是年三月初一日，长真谭真人生於宁海州，始名玉，字伯玉。 五月二十日，丹阳马真人生於宁海今之降仙坊。 按传； 初名从义，字宜甫，本关中扶风人，五代兵乱，迁海上。",
      "translated_text": "Yet he harbored a fondness for archery and horsemanship. In the early years of the Jin dynasty’s Tianjuan era, he responded to a call for martial talent, adopting the name Shixiong and the style Dewei. Later, upon entering the Dao, he reverted to his present name and style, though he continued to refer to himself as \"the one afflicted by wind.\"\n\nIn the third year of the Zhenghe era, *guisi* (1113), Master Chongyang was two years old.\nIn the fourth year of the Zhenghe era, *jiawu* (1114), Master Chongyang was three years old.\nIn the fifth year of the Zhenghe era, *yiwei* (1115), Master Chongyang was four years old.\nIn the sixth year of the Zhenghe era, *bingshen* (1116), Master Chongyang was five years old.\nIn the seventh year of the Zhenghe era, *dingyou* (1117), Master Chongyang was six years old.\nIn the first year of the Chonghe era, *wuxu* (1118), Master Chongyang was seven years old.\nIn the first year of the Xuanhe era, *jihai* (1119), Master Chongyang was eight years old.\n\nOn the fifth day of the first lunar month this year, the Pure and Tranquil Immortal Lady Sun was born in Ninghai Prefecture.\n\nIn the second year of the Xuanhe era, *gengzi* (1120), Master Chongyang was nine years old.\nIn the third year of the Xuanhe era, *xinchou* (1121), Master Chongyang was ten years old.\nIn the fourth year of the Xuanhe era, *renyin* (1122), Master Chongyang was eleven years old.\nIn the fifth year of the Xuanhe era, *guimao* (1123), Master Chongyang was twelve years old.\n\nOn the first day of the third lunar month this year, the Perfected Lord Tan of Everlasting Truth was born in Ninghai Prefecture, initially named Yu and styled Boyu. On the twentieth day of the fifth lunar month, the Perfected Lord Ma of Cinnabar Yang was born in Jiangxian Alley of present-day Ninghai. According to tradition, his original name was Congyi, styled Yifu, and he was a native of Fufeng in Guanzhong. During the Five Dynasties’ turmoil, his family relocated to the coastal region.",
      "overlap_context": "was born, initially named Zhongfu and styled Yunqing.\n\nFrom childhood, he stood apart from his peers. In adulthood, he possessed a handsome beard and brows, a robust and imposing stature, and a bold, unconstrained spirit, unconcerned with trivial conventions. In his youth, he pursued the path of the imperial examinations, enrolled in the Jingzhao Academy, and excelled in composition. His literary talent was swift and incisive, and he once ranked first among scholars in the regional examinations.",
      "start_char": 219,
      "end_char": 548,
      "start_sentence": 13,
      "end_sentence": 30,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.982761859893799,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "宣和六年甲辰，重阳祖师年十三。 宣和七年乙巳，重阳祖师年十四。 钦宗靖康元年丙午，重阳祖师年十五。 金太宗天会五年丁未，重阳祖师年十六。 天会六年戊申，重阳祖师年十七。 其年长真真人六岁。 按密国公撰真人碑云：六岁因戏堕於井，人急下救之，见公安坐水上，随挈而出。 天会七年己酉，重阳祖师年十八。 天会八年庚戌，重阳祖师年十九。 天会九年辛亥，重阳祖师年二十。 天会十年壬子，重阳祖师年二十一。 天会十一年癸丑，重阳祖师年二十二。 天会十二年甲寅，重阳祖师年二十三。 天会十三年乙卯，重阳祖师年二十四。 天会十四年丙辰，重阳祖师年二十五。 天会十五年丁巳，重阳祖师年二十六。 此年长真真人年十五，密国公作真人碑云：公十有五岁而志于学，其《葡萄篇》已脍炙人口。 天眷元年戊午，重阳祖师年二十七。 按传：天眷初应试武举，易名世雄，字德威。 天眷二年已未，重阳祖师年二十八。 天眷三年庚申、重阳祖师年二十九。 正月初三日，广宁郝真人生於宁海州，初名升，字财未闻也。 皇统元年辛酉，重阳祖师年三十。 皇统二年壬戌，重阳祖师年三十一。 其年三月十八日，玉阳王真人生於宁海州。 皇统三年癸亥，重阳祖师年三十二。 皇统四年甲子，重阳祖师年三十三。 皇统五年乙丑，重阳祖师年三十四。 皇统六年丙寅，重阳祖师年三十五。 皇统七年丁卯，重阳祖师年三十六。 七月十二日，长生刘真人生於东莱之武官庄。 皇统八年戊辰，重阳祖师年三十七。 是年正月十九日，长春丘真人生於登州栖霞县之滨都。 玉阳真人年七岁，按真人《云光集》自序云：余七岁遇束华帝君於空中，警觉不令昏昧。 海陵天德元年己巳，重阳祖师年三十八。 天德二年庚午，重阳祖师年三十九。 天德三年辛未，重阳祖师年四十。 天德四年壬申，重阳祖师年四十一。 贞元元年癸酉，重阳祖师年四十二。 贞元二年甲戌，重阳祖师年四十三。 贞元三年乙亥，重阳祖师年四十四。 正隆元年丙子，重阳祖师年四十五。 正隆二年丁丑，重阳祖师年四十六。 正隆三年戊寅，重阳祖师年四十七。 正隆四年己卯，重阳祖师年四十八。 此年六月望日，师饮酒於终南甘河镇，会二仙人被发披毡，而年貌同一，其人徐曰：此子可教。 因授以口诀。 故师《遇真》诗云：四旬八上始遭逢，口诀传来便有功。 其所遇者，纯阳吕真君也。 正隆五年庚辰，重阳祖师年四十九。 中秋日，师於醴泉县再遇真仙传秘语五篇，且曰：速去束海，投谭捉马。 已而真仙忽失所在。 世宗大定元年辛巳，重阳祖师年五十。 於终南南时村凿圹丈余，封高数尺，以活死人目之，坐於墓中。 又於四隅各植海棠一株，人问其故，答曰：吾将来使四海教风为一家耳。 大定二年壬午，重阳祖师年五十一。 是年坐活死人墓中。 大定三年癸未，重阳祖师年五十二。 秋，填活死人墓，迁刘蒋村，结茅与玉蟾和公、灵阳李公三人同居，即今之祖庭重阳万寿宫也。 大定四年甲申，重阳祖师年五十三。 师《全真集》自序云：余尝从甘河拥酒一葫欲归庵，道逢一先生叫云：害风肯与我酒吃否。 余与之，先生一引而尽，却令余以葫取河水。 余取得水授与先生，先生复授余，令余饮之，乃仙酣车。",
      "translated_text": "In the sixth year of the Xuanhe era, *jiachen* (1124), Master Chongyang was thirteen years old.\nIn the seventh year of the Xuanhe era, *yisi* (1125), Master Chongyang was fourteen years old.\nIn the first year of the Jingkang era of Emperor Qinzong, *bingwu* (1126), Master Chongyang was fifteen years old.\nIn the fifth year of the Tianhui era of Emperor Taizong of Jin, *dingwei* (1127), Master Chongyang was sixteen years old.\nIn the sixth year of the Tianhui era, *wushen* (1128), Master Chongyang was seventeen years old.\nThis year, the Perfected Lord Tan of Everlasting Truth was six years old. According to the stele inscription of the Perfected Lord composed by the Duke of Mi: at six years old, while playing, he fell into a well. As people rushed to rescue him, they saw him sitting calmly atop the water, and he was pulled out unharmed.\nIn the seventh year of the Tianhui era, *jiyou* (1129), Master Chongyang was eighteen years old.\nIn the eighth year of the Tianhui era, *gengxu* (1130), Master Chongyang was nineteen years old.\nIn the ninth year of the Tianhui era, *xinhai* (1131), Master Chongyang was twenty years old.\nIn the tenth year of the Tianhui era, *renzi* (1132), Master Chongyang was twenty-one years old.\nIn the eleventh year of the Tianhui era, *guichou* (1133), Master Chongyang was twenty-two years old.\nIn the twelfth year of the Tianhui era, *jiayin* (1134), Master Chongyang was twenty-three years old.\nIn the thirteenth year of the Tianhui era, *yimao* (1135), Master Chongyang was twenty-four years old.\nIn the fourteenth year of the Tianhui era, *bingchen* (1136), Master Chongyang was twenty-five years old.\nIn the fifteenth year of the Tianhui era, *dingsi* (1137), Master Chongyang was twenty-six years old.\nThis year, the Perfected Lord Tan of Everlasting Truth was fifteen years old. The stele inscription of the Perfected Lord composed by the Duke of Mi states: at fifteen, he devoted himself to learning, and his *Grapevine Verse* had already become widely celebrated.\nIn the first year of the Tianjuan era, *wuwu* (1138), Master Chongyang was twenty-seven years old.\nAccording to tradition: at the beginning of the Tianjuan era, he participated in the military examinations, changing his name to Shixiong and his style to Dewei.\nIn the second year of the Tianjuan era, *jiwei* (1139), Master Chongyang was twenty-eight years old.\nIn the third year of the Tianjuan era, *gengshen* (1140), Master Chongyang was twenty-nine years old.\nOn the third day of the first lunar month, the Perfected Lord Hao of Broad Tranquility was born in Ninghai Prefecture, initially named Sheng; his style is unknown.\nIn the first year of the Huangtong era, *xinyou* (1141), Master Chongyang was thirty years old.\nIn the second year of the Huangtong era, *renxu* (1142), Master Chongyang was thirty-one years old.\nOn the eighteenth day of the third lunar month this year, the Perfected Lord Wang of Cinnabar Yang was born in Ninghai Prefecture.\nIn the third year of the Huangtong era, *guihai* (1143), Master Chongyang was thirty-two years old.\nIn the fourth year of the Huangtong era, *jiazi* (1144), Master Chongyang was thirty-three years old.\nIn the fifth year of the Huangtong era, *yichou* (1145), Master Chongyang was thirty-four years old.\nIn the sixth year of the Huangtong era, *bingyin* (1146), Master Chongyang was thirty-five years old.\nIn the seventh year of the Huangtong era, *dingmao* (1147), Master Chongyang was thirty-six years old.\nOn the twelfth day of the seventh lunar month, the Perfected Lord Liu of Everlasting Life was born in Wuguan Village of Donglai.\nIn the eighth year of the Huangtong era, *wuchen* (1148), Master Chongyang was thirty-seven years old.\nOn the nineteenth day of the first lunar month this year, the Perfected Lord Qiu of Everlasting Spring was born in Bindu of Qixia County in Dengzhou.\nThe Perfected Lord Wang of Cinnabar Yang was seven years old. According to the preface of the *Cloud Radiance Collection* by the Perfected Lord himself: at seven years old, I encountered the August Lord of Floriate Brilliance in midair, who awakened me to avoid ignorance.\nIn the first year of the Tiande era of Hailing, *jisi* (1149), Master Chongyang was thirty-eight years old.\nIn the second year of the Tiande era, *gengwu* (1150), Master Chongyang was thirty-nine years old.\nIn the third year of the Tiande era, *xinwei* (1151), Master Chongyang was forty years old.\nIn the fourth year of the Tiande era, *renshen* (1152), Master Chongyang was forty-one years old.\nIn the first year of the Zhenyuan era, *guiyou* (1153), Master Chongyang was forty-two years old.\nIn the second year of the Zhenyuan era, *jiaxu* (1154), Master Chongyang was forty-three years old.\nIn the third year of the Zhenyuan era, *yihai* (1155), Master Chongyang was forty-four years old.\nIn the first year of the Zhenglong era, *bingzi* (1156), Master Chongyang was forty-five years old.\nIn the second year of the Zhenglong era, *dingchou* (1157), Master Chongyang was forty-six years old.\nIn the third year of the Zhenglong era, *wuyin* (1158), Master Chongyang was forty-seven years old.\nIn the fourth year of the Zhenglong era, *jimao* (1159), Master Chongyang was forty-eight years old.\nThis year, on the fifteenth day of the sixth lunar month, the Master drank wine at Ganhe Town in Zhongnan. There, he encountered two immortals with unbound hair and felt cloaks, their ages and appearances identical. One of them slowly said: \"This one is teachable.\" They then transmitted oral instructions to him. Thus, the Master’s poem *Encountering the Perfected* states: \"At forty-eight, I first met them; the oral instructions transmitted brought immediate attainment.\" Those he encountered were the Perfected Lord Lü of Pure Yang.\nIn the fifth year of the Zhenglong era, *gengchen* (1160), Master Chongyang was forty-nine years old.\nOn the Mid-Autumn Festival, the Master encountered the Perfected Immortals again in Liquan County, who transmitted five secret verses to him and said: \"Hasten to the eastern sea and seek Tan and Ma.\" Soon after, the Perfected Immortals vanished without a trace.\nIn the first year of the Dading era of Emperor Shizong, *xinsi* (1161), Master Chongyang was fifty years old.\nAt Nanshi Village in Zhongnan, he dug a pit over a *zhang* deep, sealed it several *chi* high, and called it the \"Tomb of the Living Dead.\" He sat within it.\nHe also planted a crabapple tree at each of the four corners. When asked the reason, he replied: \"In the future, I shall unify the teachings of the four seas into one family.\"\nIn the second year of the Dading era, *renwu* (1162), Master Chongyang was fifty-one years old.\nThis year, he sat in the \"Tomb of the Living Dead.\"\nIn the third year of the Dading era, *guiwei* (1163), Master Chongyang was fifty-two years old.\nIn autumn, he filled the \"Tomb of the Living Dead\" and moved to Liujiang Village, where he built a thatched hut and resided with Master Yuchan He and Master Lingyang Li—this is the present-day ancestral court, Chongyang Wanshou Palace.\nIn the fourth year of the Dading era, *jiashen* (1164), Master Chongyang was fifty-three years old.\nThe Master’s preface to the *Complete Perfection Collection* states: Once, I carried a gourd of wine from Ganhe, intending to return to my hut. On the way, I met a gentleman who called out: \"You who suffer from madness, will you share your wine with me?\" I gave it to him, and he drank it all in one draught. He then instructed me to fill the gourd with river water. I did so and handed it to him. He returned it to me, telling me to drink it—it was the wine of the immortal’s carriage.",
      "overlap_context": " old.\n\nOn the first day of the third lunar month this year, the Perfected Lord Tan of Everlasting Truth was born in Ninghai Prefecture, initially named Yu and styled Boyu. On the twentieth day of the fifth lunar month, the Perfected Lord Ma of Cinnabar Yang was born in Jiangxian Alley of present-day Ninghai. According to tradition, his original name was Congyi, styled Yifu, and he was a native of Fufeng in Guanzhong. During the Five Dynasties’ turmoil, his family relocated to the coastal region.",
      "start_char": 549,
      "end_char": 1887,
      "start_sentence": 31,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.01459574699402,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "又曰：子识刘海蟾否。 余曰：但尝见画像耳。 先生笑之而去。 大定五年乙酉，重阳祖师年五十四。 是年於终南上清太平宫壁上书云：害风害风旧病发，寿命不过五十八。 两个先生庾定来，一．灵真性成搜刷。 大定六年丙戌，重阳祖师年五十五。 是岁於长安滦村吕道人庵壁书云：地肺重阳子，呼为王害风。 来时长日月，去后任西东。 作伴云和水，为邻虚与空。 一灵真性在，不与众心同。 此年长春真人年一十九，弃俗入道，居昆箭山。 大定七年丁亥，重阳祖师年五十六。 於四月二十六日将刘蒋村茅庵自焚之，婆娑舞於火边。 人问，答：茅庵烧了事休休，次有人人却要修。 是日宿甘河镇，辞众日：余东海捉马去。 五月过北郁山上清宫，题其壁云：丘谭王风捉马刘，昆仑顶上打玉球。 你还般在寰海内，赢得三千八百筹。 至今石刻犹在。 闰七月十八日，抵宁海州，会丹阳真人洎高巨才，邀师於范明叔怡老亭。",
      "translated_text": "The Master further asked: \"Do you know Liu Haichan?\"\nI replied: \"I have only seen his portrait.\"\nThe Master laughed and departed.\n\nIn the fifth year of the Dading era, *yiyou* (1165), Master Chongyang was fifty-four years old. That year, he wrote on the wall of the Upper Clarity Great Peace Palace on Mount Zhongnan:\n*\"Madness, madness—old illness flares,*\n*Life’s span no more than fifty-eight.*\n*Two masters Yu come to settle,*\n*One spirit, true nature—search and sweep.\"*\n\nIn the sixth year of the Dading era, *bingxu* (1166), Master Chongyang was fifty-five years old. That year, he wrote on the wall of Lü the Daoist’s hut in Luancun, Chang’an:\n*\"Earth’s lung, Chongyangzi,*\n*Called Wang the Mad One.*\n*Coming, long days and months;*\n*Departing, free as west or east.*\n*Cloud and water as companions,*\n*Void and emptiness as neighbors.*\n*One spirit, true nature abides—*\n*Not the same as the crowd’s heart.\"*\n\nThat year, Perfected Lord Changchun, at nineteen years of age, renounced the world and entered the Dao, residing on Kunjian Mountain.\n\nIn the seventh year of the Dading era, *dinghai* (1167), Master Chongyang was fifty-six years old. On the twenty-sixth day of the fourth month, he set fire to the thatched hut in Liujiang Village himself, dancing gracefully by the flames. When asked why, he replied:\n*\"The thatched hut burns—matter done,*\n*Next, let all people cultivate instead.\"*\n\nThat night, he lodged in Ganhe Town and took leave of the assembly, saying: \"I go to the Eastern Sea to catch a horse.\" In the fifth month, he passed through the Upper Clarity Palace on North Yushan, where he inscribed on its wall:\n*\"Qiu, Tan, Wang, Feng—catching horses with Liu,*\n*On Kunlun’s peak, striking jade balls.*\n*If you still wander within the mortal sea,*\n*You’ll win three thousand eight hundred tallies.\"*\n\nThe stone inscription remains to this day. On the eighteenth day of the intercalary seventh month, he arrived in Ninghai Prefecture, where he met Perfected Lord Danyang and Gao Jucai, inviting the Master to the Pavilion of Joyful Old Age of Fan Mingshu.",
      "overlap_context": "ee years old.\nThe Master’s preface to the *Complete Perfection Collection* states: Once, I carried a gourd of wine from Ganhe, intending to return to my hut. On the way, I met a gentleman who called out: \"You who suffer from madness, will you share your wine with me?\" I gave it to him, and he drank it all in one draught. He then instructed me to fill the gourd with river water. I did so and handed it to him. He returned it to me, telling me to drink it—it was the wine of the immortal’s carriage.",
      "start_char": 1887,
      "end_char": 2252,
      "start_sentence": 94,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.567391395568848,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "九月，长春真人自昆箭山来谒祖师于全真庵，请为弟子，祖师训名处机，字通密，号长春子，仍赠之以诗。 祖师又於广宁真人卦肆前背坐感发之，广宁从至朝元观，祖师授以口诀及以二词付之。 祖师於十月一日就丹阳宅内，锁门居环，百日为期，约五日一食，化丹阳夫妇。 是冬，长真真人就环内出家，祖师训名处端，字通正，号长真子，时四十五岁矣。 大定八年戊子，重阳祖师年五十七。 正月初十日出环，分梨十化毕。 二月初八，丹阳真人出家，祖师训名釭，字玄宝，号丹阳子，时年四十六。 是日玉阳真人自牛仙山来，愿为门弟子，祖师训名处一，时年二十七。 二月晦日，祖师挈丹阳、长真、长春、玉阳入昆箭山石门口开烟霞洞居之。 三月，广宁真人来昆箭山出家，祖师训名璘，号恬然子，时二十九岁。 八月，祖师挈五真人自烟霞洞迁居文登县姜实庵，立七宝会。 大定九年己丑，重阳祖师年五十八。 春，玉阳真人辞祖师，隐居查山。 四月，祖师引丹阳、长真、长春、广宁迁居宁海州金莲堂。 途中至龙泉，以所执伞柄内盛介阳子号，乘风而起，至查山玉阳公前堕地，盖赐公之号也。 重午日，孙仙姑诣金莲堂出家，祖师训名不二，号清今散人，时年五十一。 六月，广宁真人辞祖师，亦居查山。 八月，祖师立金莲会。 九月，诣登州福山县，立三光会，於蓬莱立玉华会。 是月，祖师领丹易、长真、长春西至莱州，化长生真人出家，训名处玄，字通妙，号长生子，时年二十三。 十月，於掖县立平等会。 是月挈四子至汴梁，寓磁器王氏旅邸中。 大定十年庚寅，重阳祖师於正月初四日召丹阳、长真、长春立於榻下，时长生遁去，曰：丹阳已得道，长真已知道，吾无虑矣。 处机所学，一听丹阳。 处玄，长真当管领之。 吾今赴师真之约耳。 丹阳请留颂，师曰：吾已书於长安滦村吕仙庵矣，今口授汝。 言讫而逝。 是年闰五月，於正月十一日始立春，是止五十八岁矣。 四子尽礼，权座于孟宗献之花圃。 既而丹阳真人率三友入关，谒和、李二真人于终南太平宫。 会史处厚于京兆，刘通微、严处常于终南。 二真人乃祖师之友，三子亦祖师之弟子也。 大定十一年辛卯，丹阳真人年四十九。 是年与三友居刘蒋祖庵，修治葬所。 十月，广宁真人入关，乞食于京兆府。 大定十二年壬辰，丹阳真人年五十。 春，於长安化自然钱，率三友复往汴梁，迁祖师仙柩西归，葬于刘蒋村祖庵。 九月，广宁真人西游岐山，偶得名大通，字太古，号广宁子。 大定十三年癸巳，丹阳真人年五十一。 是年四师刘蒋居丧守坟。 六月，广宁真人度大庆关东归。 大定十四年甲午，丹阳真人年五十二。 二月，庆宁真人至真定，默坐于朝天门外。 八月，丹阳、长真、长生、长春於鄂县秦渡镇真武庙月夜共坐，各言其志，丹阳罚贫，长真国是，长生阙志，长春国闲，翼旦乃别。 丹阳刘蒋居环，长真居洛阳朝元宫，长生居洛阳市土地庙，长春西入翻溪。 事见《金玉集》。 大定十五年乙未，丹阳真人年五十三。 是年长真真人乞食於磁州二祖镇，遇一妄人欧落二齿，市人共怒之，欲明於官，真人吐之而去。 二月，广宁真人坐沃州石桥下。 夏，清摩散人入关，致祭祖庭，既而出关，居洛阳风仙姑洞。",
      "translated_text": "In the ninth month, Perfected Lord Changchun journeyed from Kunjian Mountain to pay homage to the Patriarch at Quanzhen Hermitage. He requested to become a disciple, and the Patriarch bestowed upon him the Daoist name *Chuji*, the courtesy name *Tongmi*, and the sobriquet *Changchunzi*, then presented him with a poem.\n\nThe Patriarch further sat with his back turned before the divination stall of Perfected Lord Guangning, inspiring him to follow. Guangning accompanied him to Chaoyuan Abbey, where the Patriarch transmitted oral instructions and bestowed two *ci* poems upon him.\n\nOn the first day of the tenth month, the Patriarch secluded himself within a locked chamber in Danyang’s residence, setting a hundred-day term. He ate but once every five days, converting Danyang and his wife. That winter, Perfected Lord Changzhen took ordination within the enclosure. The Patriarch bestowed upon him the Daoist name *Chuduan*, the courtesy name *Tongzheng*, and the sobriquet *Changzhenzi*. At the time, he was forty-five years old.\n\nIn the *wuzǐ* year of the Dading reign (1168), the Patriarch Wang Chongyang was fifty-seven. On the tenth day of the first month, he emerged from seclusion, having completed ten transformations of the pear. On the eighth day of the second month, Perfected Lord Danyang took ordination. The Patriarch bestowed upon him the Daoist name *Gang*, the courtesy name *Xuanbao*, and the sobriquet *Danyangzi*. He was then forty-six. On that same day, Perfected Lord Yuyang arrived from Niuxian Mountain, wishing to become a disciple. The Patriarch bestowed upon him the Daoist name *Chuyi*. He was twenty-seven.\n\nOn the last day of the second month, the Patriarch led Danyang, Changzhen, Changchun, and Yuyang into Kunjian Mountain at the mouth of Stone Gate, where they opened Yanxia Grotto and took up residence. In the third month, Perfected Lord Guangning came to Kunjian Mountain to take ordination. The Patriarch bestowed upon him the Daoist name *Lin* and the sobriquet *Tianranzi*. He was twenty-nine.\n\nIn the eighth month, the Patriarch led the five perfected ones from Yanxia Grotto to relocate to Jiangshi Hermitage in Wendeng County, where he established the Seven Treasures Assembly. In the *jǐchǒu* year of the Dading reign (1169), the Patriarch was fifty-eight. In spring, Perfected Lord Yuyang took leave of the Patriarch and retired to seclusion on Zha Mountain.\n\nIn the fourth month, the Patriarch led Danyang, Changzhen, Changchun, and Guangning to relocate to Golden Lotus Hall in Ninghai Prefecture. En route, they passed through Longquan, where the Patriarch’s umbrella handle, which contained the sobriquet *Jieyangzi*, was carried away by the wind and fell before Perfected Lord Yuyang on Zha Mountain—this was the name bestowed upon him.\n\nOn the fifth day of the fifth month, Sun the Immortal Maiden arrived at Golden Lotus Hall to take ordination. The Patriarch bestowed upon her the Daoist name *Buer* and the sobriquet *Qingjin Sanren*. She was fifty-one. In the sixth month, Perfected Lord Guangning took leave of the Patriarch and also retired to Zha Mountain.\n\nIn the eighth month, the Patriarch established the Golden Lotus Assembly. In the ninth month, he journeyed to Fushan County in Dengzhou, where he established the Three Lights Assembly, and to Penglai, where he established the Jade Splendor Assembly. That month, the Patriarch led Danyi, Changzhen, and Changchun west to Laizhou, where he converted Perfected Lord Changsheng to ordination. He bestowed upon him the Daoist name *Chuxuan*, the courtesy name *Tongmiao*, and the sobriquet *Changshengzi*. He was twenty-three.\n\nIn the tenth month, he established the Equality Assembly in Yexian County. That month, he led the four disciples to Bianliang, lodging at the porcelain merchant Wang’s inn. In the *gēngyín* year of the Dading reign (1170), on the fourth day of the first month, the Patriarch summoned Danyang, Changzhen, and Changchun to stand at his bedside. Changsheng had already departed in concealment. The Patriarch said: *\"Danyang has attained the Dao; Changzhen has comprehended the Way. I have no concerns. As for Chuji’s studies, let him follow Danyang. As for Chuxuan, let Changzhen take charge of him. Now I go to keep my appointment with the Perfected of my teacher.\"* Danyang requested a parting hymn, and the Patriarch replied: *\"I have already written it at Lüxian Hermitage in Luancun, Chang’an. Now I shall recite it for you.\"* With these words, he passed away. That year, in the intercalary fifth month, spring began on the eleventh day of the first month, and he was fifty-eight at his passing.\n\nThe four disciples observed full rites and temporarily interred him in Meng Zongxian’s flower garden. Later, Perfected Lord Danyang led the three companions into Guanzhong to pay respects to the two perfected ones, He and Li, at Taiping Abbey in Zhongnan. They met Shi Chuhou in Jingzhao, Liu Tongwei and Yan Chuchang in Zhongnan. The two perfected ones were friends of the Patriarch, and the three disciples were also disciples of the Patriarch.\n\nIn the *xīnmǎo* year of the Dading reign (1171), Perfected Lord Danyang was forty-nine. That year, he and the three companions resided at the Patriarch’s hermitage in Liujiang, repairing the burial site. In the tenth month, Perfected Lord Guangning entered Guanzhong, begging alms in Jingzhao Prefecture.\n\nIn the *rénchén* year of the Dading reign (1172), Perfected Lord Danyang was fifty. In spring, he converted natural coins in Chang’an and led the three companions back to Bianliang to transport the Patriarch’s immortal remains west for burial at the Patriarch’s hermitage in Liujiang Village. In the ninth month, Perfected Lord Guangning traveled west to Qishan, where he encountered one named *Datong*, with the courtesy name *Taigu*, and the sobriquet *Guangningzi*.\n\nIn the *guǐsì* year of the Dading reign (1173), Perfected Lord Danyang was fifty-one. That year, the four masters observed mourning and guarded the tomb at Liujiang. In the sixth month, Perfected Lord Guangning crossed the Great Celebration Pass and returned east.\n\nIn the *jiǎwǔ* year of the Dading reign (1174), Perfected Lord Danyang was fifty-two. In the second month, Perfected Lord Qingning arrived in Zhen Ding and sat in silence outside Chaotian Gate. In the eighth month, Danyang, Changzhen, Changsheng, and Changchun sat together one moonlit night at the Zhenwu Temple in Qin Crossing, Hu County, each declaring their aspirations. Danyang embraced poverty, Changzhen served the state, Changsheng lacked resolve, and Changchun sought reclusion. At dawn, they parted ways. Danyang resided in the enclosure at Liujiang, Changzhen at Chaoyuan Abbey in Luoyang, Changsheng at the Earth God Temple in Luoyang’s marketplace, and Changchun journeyed west into Fanxi. These events are recorded in *The Gold and Jade Collection*.\n\nIn the *yǐwèi* year of the Dading reign (1175), Perfected Lord Danyang was fifty-three. That year, Perfected Lord Changzhen begged alms at Erzu Town in Cizhou, where a madman struck out two of his teeth. The townspeople were enraged and wished to report the matter to the authorities, but the Perfected spat out the teeth and departed. In the second month, Perfected Lord Guangning sat beneath the stone bridge in Wozhou. In summer, the Venerable Qingjin entered Guanzhong to offer sacrifices at the Patriarch’s sanctuary, then left Guanzhong to reside in the Wind Immortal Maiden’s Grotto in Luoyang.",
      "overlap_context": "y Palace on North Yushan, where he inscribed on its wall:\n*\"Qiu, Tan, Wang, Feng—catching horses with Liu,*\n*On Kunlun’s peak, striking jade balls.*\n*If you still wander within the mortal sea,*\n*You’ll win three thousand eight hundred tallies.\"*\n\nThe stone inscription remains to this day. On the eighteenth day of the intercalary seventh month, he arrived in Ninghai Prefecture, where he met Perfected Lord Danyang and Gao Jucai, inviting the Master to the Pavilion of Joyful Old Age of Fan Mingshu.",
      "start_char": 2252,
      "end_char": 3496,
      "start_sentence": 114,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.49182057380676,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "大定十六年丙申，丹阳真人年五十四。 长真真人此岁游历治州，居白家滩。 六月中，广宁真人夜梦神人复授《易》之大义，既寤，明朝挥三十三图，事见《太古集》。 大定十七年丁酉，丹阳真人五十五。 长真真人行化於高唐县，与荼肆昊六书龟蛇字，曰：可置之壁问，以镇火灾。 是年县城大火，唯荼肆乃免。 大定十八年戊戌，丹阳真人年五十六。 於八月一日刘蒋出环，西游陇山华亭行化。 长生真人是年迁洛城东北云溪洞居之，门徒日集，凿三井洞。 大定十九年己亥，丹阳真人年五十七。 二月十五日，於华亭县挈李大乘同居环百日，至八月迁陇州佑德观，居环十一月，十八日出环，宿勾兜堡，化解元李子和出家。 长真真人游历卫州，获嘉县府君庙居之。 大定二十年庚子，丹阳真人年五十八。 是年春，京兆章台街赵蓬莱施宅为庵，请真人居环。 八月二十四日，长安僚庶请祈雨，真人作诗，期以二十五日，雨足，至期果应。 见《金玉集》。 长真真人西游同州，居西里庵。 长春真人自墦溪迁居陇州龙门山。 大定二十一年辛丑，丹阳真人年五十九。 四月初，於鄂县刘蒋村张朝散竹园庵内居环，中元日作黄录醮罢，复归祖庵。 长真真人居华阴县纯阳洞，长生真人东归莱州。 大定二十二年壬寅，丹阳真人年六十。 此年四月东归宁海，十二月行化文登，渔户焚网者甚众。 初八日，海市见于南海之上，士人以诗庆之。 长生真人居武官建庵，往《道德》、《黄庭》等经。 秋，玉阳真人来宁海谒丹阳真人，同宿於金莲堂。 广宁真人居真定府，升堂演道，听众常数百人。 十二月二十九日，清争孙仙姑升仙于洛阳，年六十四矣。 大定二十三年癸卯，丹阳真人年六十一。 四月行化芝阳，下元日文登作醮，祖师现於空际白龟之上。 丹阳於十二月二十二日升仙於莱阳县游仙宫，长生、玉阳二真人同主葬事，守坟百日，各归其隐所。 大定二十四年甲辰，长真真人年六十二。 是年正月十八日，长生真人於昌阳县姜守争家作醮，巳，午问重阳祖师云冠绛服，丹阳真人三髻，现於空际彩云之上。 五月早，登郡太守请长生真人祈雨，海市现於竹岛。 明日，丹阳真人现於应仙桥之西北，是日雨足。 大定二十五年乙巳，长真真人年六十三。 是岁四月初一日升仙於洛阳朝元宫，其畅道接物诗词，目曰《水云集》，行于世。 大定二十六年丙午，长生真人年四十。 冬，长春真人下龙门山，居终南祖庵。 大定二十七年丁未，长生真人年四十一。 是年十一月十三日，玉阳真人奉诏至燕，帝问延生之理，师曰：惜精全神，修身之要，端拱无为，治天下之本。 上待以方外之礼。 大定二十八年戊申，长生真人年四十二。 此年二月，长春真人奉韶至阙下，十一日圣旨令主万春节醮，蒙赐巾袍。 四月，劫居宫庵。 五月十八日，召见於长松岛。 七月，应制进词五首，中秋得旨还终南山，是月，玉阳真人亦得旨还山。 十二月，上弗豫，遣使复召玉阳真人，真人谓使者曰：恐不及再睹天颜矣。 大定二十九年己酉，长生真人年四十三。 正月初三日，玉阳真人至都，嗣君命真人为先帝主醮而归。 章宗明昌元年庚戌，长生真人年四十四。 重午日，莱阳县刘植请玉阳真人斋，且以无嗣告於师，师曰：公富而好礼，未应绝也。",
      "translated_text": "In the *bǐngshēn* year of the Dading reign (1176), Perfected Lord Danyang was fifty-four. That year, Perfected Lord Changzhen traveled through Cizhou and resided at Baijia Beach. In the sixth month, Perfected Lord Guangning dreamed at night of a divine being who once more imparted the profound meaning of the *Book of Changes*; upon waking, he drew thirty-three diagrams the following morning. This is recorded in *The Grand Antiquity Collection*.\n\nIn the *dīngyǒu* year of the Dading reign (1177), Perfected Lord Danyang was fifty-five. Perfected Lord Changzhen performed his teachings in Gaotang County, where he wrote the characters for \"tortoise\" and \"serpent\" for Wu Liu of the tea shop, saying: \"Place these on the wall to suppress fire disasters.\" That year, the county town suffered a great fire, but the tea shop alone was spared.\n\nIn the *wùxū* year of the Dading reign (1178), Perfected Lord Danyang was fifty-six. On the first day of the eighth month, Liu Jiang departed Huan and journeyed west to Luoshan and Huating to perform his teachings. Perfected Lord Changsheng moved that year to reside in Yunxi Grotto northeast of Luoyang; his disciples gathered daily, and they carved out three wells in the grotto.\n\nIn the *jǐhài* year of the Dading reign (1179), Perfected Lord Danyang was fifty-seven. On the fifteenth day of the second month, he took Li Dacheng to reside in Huan for a hundred days, then moved to Youde Abbey in Longzhou in the eighth month. After residing in Huan for eleven months, he departed on the eighteenth day, lodged at Goudou Fortress, and converted Jie Yuan Li Zihe to the Dao. Perfected Lord Changzhen traveled through Weizhou and resided at the Prefectural Lord’s Temple in Huojia County.\n\nIn the *gēngzǐ* year of the Dading reign (1180), Perfected Lord Danyang was fifty-eight. That spring, Zhao Penglai of Zhangtai Street in Jingzhao donated his residence to be converted into an abbey and invited the Perfected to reside in Huan. On the twenty-fourth day of the eighth month, the officials and commoners of Chang’an requested prayers for rain; the Perfected composed a poem, promising rain by the twenty-fifth day, and the rain arrived as predicted on that day. See *The Gold and Jade Collection*. Perfected Lord Changzhen traveled west to Tongzhou and resided at Xili Abbey. Perfected Lord Changchun moved from Fanxi to reside on Longmen Mountain in Longzhou.\n\nIn the *xīnchǒu* year of the Dading reign (1181), Perfected Lord Danyang was fifty-nine. In early April, he resided in Huan within the Bamboo Garden Abbey of Zhang Chaosan in Liujiang Village, Huo County. After conducting the Yellow Register Retreat on the Zhongyuan Festival, he returned to the ancestral abbey. Perfected Lord Changzhen resided in Chunyang Grotto in Huayin County, while Perfected Lord Changsheng returned east to Laizhou.\n\nIn the *rényín* year of the Dading reign (1182), Perfected Lord Danyang was sixty. That year, in the fourth month, he returned east to Ninghai, and in the twelfth month, he performed his teachings in Wendeng, where many fishermen burned their nets. On the eighth day, a mirage appeared above the South Sea, and scholars celebrated it with poetry. Perfected Lord Changsheng resided in Wu Officials, building an abbey, and lectured on the *Scripture of the Dao and Its Virtue* and the *Yellow Court Scripture*. In autumn, Perfected Lord Yuyang came to Ninghai to pay respects to Perfected Lord Danyang, and they lodged together in the Golden Lotus Hall. Perfected Lord Guangning resided in Zhen Ding Prefecture, where he ascended the dais to expound the Dao; his audience often numbered in the hundreds. On the twenty-ninth day of the twelfth month, Immortal Sun Qingzhen ascended to the heavens in Luoyang at the age of sixty-four.\n\nIn the *guǐmǎo* year of the Dading reign (1183), Perfected Lord Danyang was sixty-one. In the fourth month, he performed his teachings in Zhiyang. On the Xiayuan Festival, he conducted a retreat in Wendeng, where the Patriarch appeared in the sky above a white tortoise. On the twenty-second day of the twelfth month, Perfected Lord Danyang ascended to the heavens at Yuxian Palace in Laiyang County. Perfected Lords Changsheng and Yuyang jointly oversaw the funeral rites, guarding the tomb for a hundred days before each returning to their secluded abodes.\n\nIn the *jiǎchén* year of the Dading reign (1184), Perfected Lord Changzhen was sixty-two. On the eighteenth day of the first month, Perfected Lord Changsheng conducted a retreat at the home of Jiang Shouzhen in Changyang County. Between the hours of *si* and *wu*, Patriarch Chongyang appeared in the sky wearing a cloud crown and crimson robes, while Perfected Lord Danyang appeared with three topknots, both manifesting amidst colorful clouds. In the fifth month, during a drought, the prefect of Deng Prefecture invited Perfected Lord Changsheng to pray for rain, and a mirage appeared above Bamboo Island. The following day, Perfected Lord Danyang appeared to the northwest of Yingxian Bridge, and on that day, the rain was abundant.\n\nIn the *yǐsì* year of the Dading reign (1185), Perfected Lord Changzhen was sixty-three. On the first day of the fourth month, he ascended to the heavens at Chaoyuan Abbey in Luoyang. His poems and verses on expounding the Dao and interacting with the world, titled *The Water and Cloud Collection*, circulated widely.\n\nIn the *bǐngwǔ* year of the Dading reign (1186), Perfected Lord Changsheng was forty. In winter, Perfected Lord Changchun descended Longmen Mountain and resided at the ancestral abbey on Zhongnan.\n\nIn the *dīngwèi* year of the Dading reign (1187), Perfected Lord Changsheng was forty-one. On the thirteenth day of the eleventh month, Perfected Lord Yuyang received an imperial summons to Yan. The Emperor inquired about the principles of prolonging life, to which the Master replied: \"Cherishing essence and preserving spirit are the essentials of cultivating the body; governing with uprightness and non-action is the foundation of ruling the realm.\" The Emperor treated him with the rites due to one beyond the world.\n\nIn the *wùshēn* year of the Dading reign (1188), Perfected Lord Changsheng was forty-two. That year, in the second month, Perfected Lord Changchun received an imperial edict to attend court. On the eleventh day, he was ordered by imperial decree to preside over the Wanchun Festival Retreat and was bestowed with a headscarf and robe. In April, he resided at Gong Abbey. On the eighteenth day of the fifth month, he was summoned for an audience at Longsong Island. In the seventh month, he presented five compositions in response to the imperial command. On the Mid-Autumn Festival, he received an edict to return to Zhongnan Mountain. That month, Perfected Lord Yuyang also received an edict to return to his mountain. In the twelfth month, the Emperor fell ill, and an envoy was dispatched to summon Perfected Lord Yuyang once more. The Perfected said to the envoy: \"I fear I shall not again behold the Son of Heaven’s countenance.\"\n\nIn the *jǐyǒu* year of the Dading reign (1189), Perfected Lord Changsheng was forty-three. On the third day of the first month, Perfected Lord Yuyang arrived in the capital. The heir apparent commanded the Perfected to preside over the retreat for the late Emperor before returning.\n\nIn the first year of the Mingchang reign of Emperor Zhangzong (1190), Perfected Lord Changsheng was forty-four. On the Double Fifth Festival, Liu Zhi of Laiyang County invited Perfected Lord Yuyang to conduct a retreat and informed the Master of his lack of an heir. The Master replied: \"You are wealthy and fond of propriety; you should not be without descendants.\"",
      "overlap_context": "rfected Lord Changzhen begged alms at Erzu Town in Cizhou, where a madman struck out two of his teeth. The townspeople were enraged and wished to report the matter to the authorities, but the Perfected spat out the teeth and departed. In the second month, Perfected Lord Guangning sat beneath the stone bridge in Wozhou. In summer, the Venerable Qingjin entered Guanzhong to offer sacrifices at the Patriarch’s sanctuary, then left Guanzhong to reside in the Wind Immortal Maiden’s Grotto in Luoyang.",
      "start_char": 3497,
      "end_char": 4769,
      "start_sentence": 165,
      "end_sentence": 216,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.48941230773926,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "为写四四应真四字，明年四月十四而生子，来乞名，师曰：吾已与名应真矣，今日纯阳真君降世辰也。 明昌二年辛亥，长生真人年四十五。 是岁十月，长春真人东归栖霞，住太虚观。 明昌三年壬子，长生真人年四十六。 冬十月，长春真人芝阳洞作醮。 明昌四年癸丑，长生真人年四十七。 明昌五年甲寅，长生真人年四十八。 秋九月，长春真人福山县醮，天门开，瑞鹤现，有诗见《墦溪集》。 明昌六年乙卯，长生真人年四十九。 承安元年丙辰，长生真人年五十。 承安二年丁巳，长生真人年五十一。 六月，玉阳真人被召，七月初三日见於便殿赐坐，帝问以养生之道，抵暮方归。 翼日，赐体玄大师号及紫衣，劝赐燕都修真、崇福二观，俾真人任便居之，月给斋钱二百襁。 冬，长生真人奉召赴阙，帝问以至道，师曰：至道之要，寡嗜欲则身安，薄赋敛则国泰。 帝曰：先生广成子之言乎。 劲近侍馆谷于天长观。 承安三年戊午，长生真人年五十二。 应对悉合上意，三月得旨还山，劫赐观额五道，曰灵虚，曰太微，曰龙翔，曰集仙，日妙真，令立观度人。 玉阳真人犹居都下。 春，终南吕庵主至都，师为请祖庵为灵虚观，以劫牒付吕，俾知观事，仍以诗送行。 夏，师得旨东归侍亲。 承安四年己未，长生真人年五十三。 是年长春真人芝阳作醮。 承安五年庚申，长生真人年五十四。 泰和元年辛酉，长生真人年五十五。 是年游广陵，着《天道罪福论》。 玉阳真人奉诏诣亳州太清宫作普天醮，有诗见《云光集》。 泰和二年壬戌，长生真人年五十六。 滨州作醮，有琼葩玉树之瑞，有诗见《盘阳集》。 长春真人芝阳作醮。 泰和三年癸亥，长生真人年五十七。 此年二月初六日升仙於武官灵虚观。 玉阳真人奉诏诣亳州太清宫作普天醮，临坛度道士千余人。 泰和四年甲子，长春真人年五十七。 泰和五年乙丑，长春真人年五十八。 夏五月，莱州醮，有瑞鹤彩云现，有词见《墦溪集》。 泰和六年丙寅，长春真人年五十九。 泰和七年丁卯，长春真人年六十。 元妃施道经二藏，一驿送栖霞太虚观，一驿送圣水玉虚观。 泰和八年戊辰，长春真人年六十一。 大安元年己巳，长春真人年六十二。 是年游鳌山，有诗二十首。 玉阳真人七月十四日至北京，应孛木鲁参政之请也，居华阳观。 是时大旱，僚庶告真人雨期，真人曰：十七日沾足矣。 至日果应。 大元庚午，长春真人年六十三。 夏，玉阳真人蓟州玉田县醮毕，谓众曰：北方道气将回，空中有神明往来，刀剑击触之象，莫非生灵将受苦耶。 大元辛未，长春真人年六十四。 是年东海召至燕都，及游德兴琅山，俱有诗，见《呜道集》。 壬申，长春真人年六十五。 是年十二月三十日，广宁真人升仙于宁海州先天观，春秋七十三矣。 癸酉，长春真人年六十六。 甲戌，长春真人年六十七。 此年游昆箭烟霞洞，有诗。 乙亥长春真人年六十八。 丙子，长春真人年六十九。 时居登州，金主命东平监军王庭玉责诏召师归汴京，师曰：我循天理而行，天使行处无敢违也。 乃不起。 丁丑，长春真人年七十。 玉阳真人四月二十三日升仙於圣水玉虚观，时七十六岁矣。 戊寅，长春真人年七十一。 己卯，长春真人年七十二。",
      "translated_text": "The Master wrote the four characters \"Four-Four Perfected\" and said, \"A son shall be born on the fourteenth day of the fourth month next year.\" When the child was born, Liu Zhi came to request a name, and the Master said: \"I have already given him the name Perfected. Today is the descent day of the Pure Yang Perfected Lord.\"\n\nIn the second year of the Mingchang reign (1191), Perfected Lord Changsheng was forty-five. In the tenth month of this year, Perfected Lord Changchun returned east to Qixia, residing at the TaiXu Abbey.\n\nIn the third year of the Mingchang reign (1192), Perfected Lord Changsheng was forty-six. In the tenth month of winter, Perfected Lord Changchun conducted a retreat at Zhiyang Grotto.\n\nIn the fourth year of the Mingchang reign (1193), Perfected Lord Changsheng was forty-seven.\n\nIn the fifth year of the Mingchang reign (1194), Perfected Lord Changsheng was forty-eight. In the ninth month of autumn, Perfected Lord Changchun conducted a retreat in Fushan County; the Heavenly Gate opened, and auspicious cranes appeared. A poem on this event is recorded in *Fanxi Collection*.\n\nIn the sixth year of the Mingchang reign (1195), Perfected Lord Changsheng was forty-nine.\n\nIn the first year of the Cheng’an reign (1196), Perfected Lord Changsheng was fifty.\n\nIn the second year of the Cheng’an reign (1197), Perfected Lord Changsheng was fifty-one. In the sixth month, Perfected Lord Yuyang was summoned. On the third day of the seventh month, he was received in the side hall and granted a seat. The Emperor inquired about the Way of nurturing life, and the audience lasted until dusk before he returned. The following day, the Emperor bestowed upon him the title \"Master of Embracing the Mystery\" and a purple robe, and ordered the construction of Xiuzhen and Chongfu Abbeys in the capital, allowing the Perfected to reside in either as he pleased. A monthly stipend of two hundred strings of cash was granted for vegetarian meals. In winter, Perfected Lord Changsheng was summoned to court. The Emperor inquired about the Supreme Dao, and the Master replied: \"The essence of the Supreme Dao lies in moderating desires to secure bodily peace and lightening taxes to ensure national prosperity.\" The Emperor said: \"These are the words of Master Guangcheng.\" He then ordered accommodations and provisions be arranged for the Master at Tianchang Abbey.\n\nIn the third year of the Cheng’an reign (1198), Perfected Lord Changsheng was fifty-two. His responses fully accorded with the Emperor’s wishes. In the third month, he received the imperial decree to return to his mountain retreat. Five abbey plaques were bestowed: *Lingxu*, *Taiwei*, *Longxiang*, *Jixian*, and *Miaozhen*, with orders to establish abbeys and ordain Daoists. Perfected Lord Yuyang remained in the capital.\n\nIn spring, Master Lü of Zhongnan arrived in the capital. The Master requested that the ancestral abbey be named Lingxu Abbey and entrusted the imperial decree to Lü, appointing him to oversee the abbey’s affairs. A poem was composed to see him off. In summer, the Master received the decree to return east to attend to his parents.\n\nIn the fourth year of the Cheng’an reign (1199), Perfected Lord Changsheng was fifty-three. This year, Perfected Lord Changchun conducted a retreat at Zhiyang.\n\nIn the fifth year of the Cheng’an reign (1200), Perfected Lord Changsheng was fifty-four.\n\nIn the first year of the Taihe reign (1201), Perfected Lord Changsheng was fifty-five. This year, he traveled to Guangling and composed *On the Daoist Principles of Sin and Fortune*.\n\nPerfected Lord Yuyang received an imperial decree to conduct a universal retreat at Taiqing Abbey in Bozhou. A poem on this event is recorded in *Yunguang Collection*.\n\nIn the second year of the Taihe reign (1202), Perfected Lord Changsheng was fifty-six. He conducted a retreat in Binzhou, where jade blossoms and jade trees appeared as auspicious signs. A poem on this event is recorded in *Panyang Collection*. Perfected Lord Changchun conducted a retreat at Zhiyang.\n\nIn the third year of the Taihe reign (1203), Perfected Lord Changsheng was fifty-seven. On the sixth day of the second month this year, he ascended as an immortal at Lingxu Abbey in Wuguan.\n\nPerfected Lord Yuyang received an imperial decree to conduct a universal retreat at Taiqing Abbey in Bozhou, where he ordained over a thousand Daoists at the altar.\n\nIn the fourth year of the Taihe reign (1204), Perfected Lord Changchun was fifty-seven.\n\nIn the fifth year of the Taihe reign (1205), Perfected Lord Changchun was fifty-eight. In the fifth month of summer, he conducted a retreat in Laizhou, where auspicious cranes and colorful clouds appeared. A lyric on this event is recorded in *Fanxi Collection*.\n\nIn the sixth year of the Taihe reign (1206), Perfected Lord Changchun was fifty-nine.\n\nIn the seventh year of the Taihe reign (1207), Perfected Lord Changchun was sixty. The Imperial Consort donated two collections of Daoist scriptures, one sent by courier to Taixu Abbey in Qixia and the other to Yuxu Abbey at Shengshui.\n\nIn the eighth year of the Taihe reign (1208), Perfected Lord Changchun was sixty-one.\n\nIn the first year of the Da’an reign (1209), Perfected Lord Changchun was sixty-two. This year, he traveled to Aoshan, composing twenty poems.\n\nPerfected Lord Yuyang arrived in Beijing on the fourteenth day of the seventh month, invited by Chancellor Böömur. He resided at Huayang Abbey. At that time, a severe drought occurred, and officials and commoners asked the Perfected about the timing of rain. The Perfected said: \"On the seventeenth day, there will be sufficient rain.\" The prediction came true on that day.\n\nIn the *gengwu* year of the Da Yuan reign (1210), Perfected Lord Changchun was sixty-three. In summer, after conducting a retreat in Yutian County, Jizhou, Perfected Lord Yuyang addressed the assembly: \"The qi of the Dao is about to return to the north. Divine beings are moving through the void, and the clashing of blades is visible. Could this not portend suffering for the living?\"\n\nIn the *xinwei* year of the Da Yuan reign (1211), Perfected Lord Changchun was sixty-four. This year, he was summoned from the Eastern Sea to the capital and traveled to Langshan in Dexing. Poems on these events are recorded in *Mingdao Collection*.\n\nIn the *renshen* year (1212), Perfected Lord Changchun was sixty-five. On the thirtieth day of the twelfth month this year, Perfected Lord Guangning ascended as an immortal at Xiantian Abbey in Ninghai Prefecture, aged seventy-three.\n\nIn the *guiyou* year (1213), Perfected Lord Changchun was sixty-six.\n\nIn the *jiaxu* year (1214), Perfected Lord Changchun was sixty-seven. This year, he traveled to Yunjiandong, composing poems.\n\nIn the *yihai* year (1215), Perfected Lord Changshun was sixty-eight.\n\nIn the *bingzi* year (1216), Perfected Lord Changchun was sixty-nine. At that time, he resided in Dengzhou. The Jin ruler sent Wang Tingyu, the military supervisor of Dongping, to deliver an imperial decree summoning the Master to Bianjing. The Master said: \"I follow the principles of Heaven in my actions; wherever Heaven commands, I dare not disobey.\" He then passed away.\n\nIn the *dingchou* year (1217), Perfected Lord Changchun was seventy. Perfected Lord Yuyang ascended as an immortal at Yuxu Abbey in Shengshui on the twenty-third day of the fourth month, aged seventy-six.\n\nIn the *wuyin* year (1218), Perfected Lord Changchun was seventy-one.\n\nIn the *jimao* year (1219), Perfected Lord Changchun was seventy-two.",
      "overlap_context": "arrived in the capital. The heir apparent commanded the Perfected to preside over the retreat for the late Emperor before returning.\n\nIn the first year of the Mingchang reign of Emperor Zhangzong (1190), Perfected Lord Changsheng was forty-four. On the Double Fifth Festival, Liu Zhi of Laiyang County invited Perfected Lord Yuyang to conduct a retreat and informed the Master of his lack of an heir. The Master replied: \"You are wealthy and fond of propriety; you should not be without descendants.\"",
      "start_char": 4769,
      "end_char": 6064,
      "start_sentence": 217,
      "end_sentence": 278,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.370988845825195,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "居莱州昊天观。 是时齐鲁陷宋，八月，宋主遣使召师，不起，州牧谢曰：师居此，我辈诚有所依。 师曰：吾之出处，非若辈可知也，他日恐不能留居此耳。 是年五月，太祖圣武皇帝自奈蛮国遣近侍刘仲禄持韶召师，十二月仲禄至莱州。 庚辰，长春真人年七＋1二。 正月自莱州北行，二月至燕都，四月官僚请作醮於太极宫，五月至德兴府，寓龙阳观，八月至宣德州，寓朝元观。 辛巳，长春真人年七十四。 是年五月朔抵陆局河，七月至阿不罕山，留宋道安等九人立栖霞观，中秋日抵金山，遇白骨甸，十一月至邪迷思干城，俱有诗，见《呜道集》。 壬午，长春真人年七十五。 春三月过铁门，达于行在，上设二帐於御喔之东以居之，时问以至道，师大略对以节欲保躬，天道好生恶杀，治尚无为清静之理。 上悦，乃命左史书诸策。 其详见《庆会录》、《西游记》。 癸未，长春真人年七十六。 是岁三月七日得旨东还，赐号神仙，俾掌管天下道门，大小事务一听神仙处置，他人无得干预，宫观差役尽行镯兔，所在官司常切卫护。 六月抵丰州，八月至宣德州。 甲申，长春真人年七十七。 春二月居缙山秋阳观，三月燕京官僚请住太极宫，是月仙仗入燕都。 乙酉，长春真人年七十八。 秋九月，荧惑犯尾宿，主燕地灾，宣抚王楫请师作醮禳之，醮竟荧惑乃退数舍矣。 丙戌，长春真人年七十九。 夏五月，燕境大旱，僚庶请师作醮，雨随时沾足，在都名儒皆有诗贺之。 丁亥，长春真人年八十。 夏大旱，在京士庶祷师作醮，师曰：我方留意醮事，公辈来请，所谓好事不约而同也。 仍云当备二醮，以五月初一日为祈雨，三日为贺雨醮。 后皆如师言。 是月得旨，改太极宫为长春宫。 六月，太液池涸，北口山摧，人告於师，师笑曰：山摧水枯，吾将与之俱乎。 七月四日，师谓门人曰：昔丹阳尝授记於予云：吾殁之后，教门大兴，四方往往化为道乡，道院皆劝赐名额，又当住持大宫观，仍有使者佩符乘传干教门事，此汝功成名遂归休之时也。 今丹阳师之言一一皆验，吾归无憾焉。 九日登宝玄堂，留颂而逝。 后序 古人之有年谱，尚矣，所以着出处之实，使后世得以考观者焉。 我玄门之七真，身虽游乎方外，道实满于人问。 当国朝革命之际，其救世及物之功不为不腆，故封龙李翰长敬斋云：七真之救世也，真吋上帝之心也。 上帝之爱民也，真藉七真之教也。 不然，何为天生圣皇出，宁四海。 天生长春，左右大命，相与聚精会神，同始共终哉。 观此自可见矣。 仆因焚诵之暇，不揆狂斐，褊考师真文集及诸家所撰传记，起重阳祖师降世之岁，讫长春真人升仙之秋，一百一十六年之问出处事迹，详节编次，通为一谱。 其或一二传记所载与各师真文集不相同者，舍传记而取文集也，盖文集纪录之真，传记有所未详也。 呜呼，七真始终之大盘具矣，若夫师真之尸居而龙见，雷声而渊默，神动而天随，从容无为之妙，固不得以尽笔舌形容之，今之纪者，但取其修真立教之边，姑此启诸童蒙，俾於向上诸师知所宗本，非敢以渍我同志者也。 至元辛未岁中元日天乐道人李道谦书于终南祖庭之筠溪道院。 七真年谱竟",
      "translated_text": "Residing at Haotian Abbey in Laizhou. At that time, the Qi and Lu regions had fallen to the Song. In the eighth month, the Song ruler sent envoys to summon the Master, who did not rise to respond. The prefect of the state replied: \"With the Master dwelling here, we truly have something to rely upon.\" The Master said: \"My comings and goings are not for the likes of you to know. One day, I fear I may not be able to remain here.\"\n\nThat year, in the fifth month, the Sacred Martial Emperor Taizu, from the Naiman state, dispatched his attendant Liu Zhonglu bearing an imperial edict to summon the Master. In the twelfth month, Zhonglu arrived in Laizhou.\n\nIn the *gengchen* year (1220), Perfected Lord Changchun was seventy-three. In the first month, he set out northward from Laizhou. By the second month, he reached the Yan capital. In the fourth month, officials requested that he perform a jiao ritual at the Taiyi Palace. In the fifth month, he arrived at Dexing Prefecture and lodged at Longyang Abbey. By the eighth month, he reached Xuande Prefecture and stayed at Chaoyuan Abbey.\n\nIn the *xinsi* year (1221), Perfected Lord Changchun was seventy-four. That year, on the first day of the fifth month, he reached the Luju River. By the seventh month, he arrived at Mount Abuqan, where he left Song Dao’an and eight others to establish Qixia Abbey. On the Mid-Autumn Day, he reached Mount Jin, passing through the White Bone Steppe. By the eleventh month, he arrived at the city of Yemisiqan. All these journeys were recorded in verse, as seen in the *Wudao Collection*.\n\nIn the *renwu* year (1222), Perfected Lord Changchun was seventy-five. In the third month of spring, he passed through the Iron Gate and reached the imperial encampment. The Emperor set up two tents to the east of his royal quarters for the Master’s residence. From time to time, he inquired about the supreme Dao. The Master broadly responded with the principles of restraining desires to preserve the body, the Dao of Heaven loving life and abhorring killing, and governance favoring non-action and the principle of clarity and stillness. The Emperor was pleased and ordered the Left Scribe to record these in the annals. For details, see the *Qinghui Record* and *Record of the Western Journey*.\n\nIn the *guiwei* year (1223), Perfected Lord Changchun was seventy-six. On the seventh day of the third month of that year, he received an edict to return east. He was bestowed the title \"Divine Immortal\" and entrusted with overseeing all Daoist affairs throughout the realm. Matters great and small were to be handled at the Divine Immortal’s discretion, with no interference from others. All corvée labor for abbeys was exempted, and local officials were ordered to provide constant protection. In the sixth month, he reached Fengzhou. By the eighth month, he arrived at Xuande Prefecture.\n\nIn the *jiashen* year (1224), Perfected Lord Changchun was seventy-seven. In the second month of spring, he resided at Qiuyang Abbey on Mount Jin. In the third month, officials in the Yan capital requested that he stay at the Taiyi Palace. That month, his immortal retinue entered the Yan capital.\n\nIn the *yiyou* year (1225), Perfected Lord Changchun was seventy-eight. In the ninth month of autumn, Mars trespassed against the Tail constellation, foretelling disaster in the Yan region. The Pacification Commissioner Wang Ji requested that the Master perform a jiao ritual to avert it. Once the ritual was completed, Mars retreated several celestial lodges.\n\nIn the *bingxu* year (1226), Perfected Lord Changchun was seventy-nine. In the fifth month of summer, a great drought afflicted the Yan region. Officials and commoners requested that the Master perform a jiao ritual. Rain fell abundantly in due time, and renowned scholars in the capital all composed poems in celebration.\n\nIn the *dinghai* year (1227), Perfected Lord Changchun was eighty. In summer, a great drought again struck. Scholars and commoners in the capital entreated the Master to perform a jiao ritual. The Master said: \"I was already preparing for the ritual when you came to request it—what is called ‘good deeds coinciding without prior agreement.’\" He further stated that two rituals should be prepared: one on the first day of the fifth month for praying for rain, and another on the third day for celebrating the rain. Later, all unfolded as the Master had foretold.\n\nThat month, he received an edict renaming the Taiyi Palace as the Changchun Palace. In the sixth month, the Taiye Pond dried up, and the northern pass mountain collapsed. Someone reported this to the Master, who smiled and said: \"As the mountain crumbles and the waters dry, I shall soon depart with them.\"\n\nOn the fourth day of the seventh month, the Master said to his disciples: \"Formerly, Master Danyang once gave me a prophecy, saying: ‘After my passing, the Daoist teaching will flourish greatly. In all directions, regions will transform into Daoist villages, and abbeys will be granted names and plaques. You will also preside over grand abbeys, and there will be envoys bearing tokens traveling by post to oversee Daoist affairs. This will be the time for you to achieve your work, fulfill your name, and retire.’ Now, every word of Master Danyang’s prophecy has come to pass. I depart without regret.\"\n\nOn the ninth day, he ascended to the Baoxuan Hall, left a final hymn, and passed away.\n\n**Postscript**\nThe compilation of chronological records by the ancients is a long-standing practice, intended to document the truth of their comings and goings, allowing later generations to examine and observe them.\n\nThough the Seven Perfected of our Mysterious Gate roamed beyond the world, their Dao truly filled the human realm. During the revolution of our imperial dynasty, their salvific and beneficent deeds were not insignificant. Thus, Li Han of Fenglong, styled Jingzhai, said: \"The salvation of the Seven Perfected was truly the heart of the Supreme Emperor. The Supreme Emperor’s love for the people was truly expressed through the teachings of the Seven Perfected. Otherwise, why would Heaven have brought forth a sagely emperor to pacify the Four Seas, and Heaven have brought forth Changchun to assist the great mandate, gathering essence and spirit together, beginning and ending as one?\" From this, the truth is self-evident.\n\nIn my spare moments from burning incense and reciting scriptures, I, in my presumptuous ignorance, have broadly examined the collected works of the Perfected Masters and various biographies compiled by others. Beginning with the year of Ancestral Master Chongyang’s descent into the world and concluding with the autumn of Perfected Lord Changchun’s ascension as an immortal—a span of one hundred and sixteen years—I have arranged their comings, goings, and deeds in detailed order, compiling them into a single record.\n\nWhere discrepancies arose between one or two biographies and the collected works of the Perfected Masters, I discarded the biographies in favor of the collected works, for the collected works preserve the truest records, while biographies may lack detail.\n\nAlas! The grand trajectory of the Seven Perfected is now complete. As for the Perfected Masters’ dwelling in stillness yet manifesting like dragons, thundering in voice yet profound in silence, moving as spirits with Heaven following, and the subtleties of their effortless non-action—these cannot be fully captured by brush or tongue. What I have recorded here merely touches upon their cultivation of the Dao and establishment of teachings, offering a modest introduction for beginners. May those who aspire to higher truths know whom to revere as their foundation. I dare not presume this record to be exhaustive for my fellow practitioners.\n\nRespectfully inscribed by Li Daoqian, styled Tianle Daoren, on the Zhongyuan Festival of the *xinsi* year of the Zhiyuan era (1271), at the Yunxi Abbey in the Ancestral Court of Mount Zhongnan.\n\n**The Chronological Record of the Seven Perfected concludes.**",
      "overlap_context": "ster to Bianjing. The Master said: \"I follow the principles of Heaven in my actions; wherever Heaven commands, I dare not disobey.\" He then passed away.\n\nIn the *dingchou* year (1217), Perfected Lord Changchun was seventy. Perfected Lord Yuyang ascended as an immortal at Yuxu Abbey in Shengshui on the twenty-third day of the fourth month, aged seventy-six.\n\nIn the *wuyin* year (1218), Perfected Lord Changchun was seventy-one.\n\nIn the *jimao* year (1219), Perfected Lord Changchun was seventy-two.",
      "start_char": 6064,
      "end_char": 7288,
      "start_sentence": 279,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.08697557449341,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\七真年谱.txt",
        "category": "谱箓类"
      }
    }
  ]
}