{
  "source_id": "三天易髓",
  "source_file": "chunked_daozang\\三天易髓.json",
  "total_chunks": 5,
  "total_original_chars": 4381,
  "total_translated_chars": 24853,
  "total_translation_time": 124.98724722862244,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\三天易髓.txt",
    "category": "方法类"
  },
  "full_translation": "**Three Days Refining the Marrow**\n\n*Scripture Title:* Three Days Refining the Marrow\n*Composed by:* Yuanying Chanzi (Li Daochun)\n*Collated by:* Hunranzi (Wang Jie)\n*One fascicle.*\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Dongzhen Section, Methods Category.\n\n---\n\n**Confucians call it the Supreme Ultimate;**\nThe Fire Talisman points directly:\nHeaven and Earth as crucible and vessel.\nAbove, it props up the heavens; below, it props up the earth—\nThis very person is the crucible and vessel.\n\n*Ah!*\nOnce you know where to begin,\nThe work is simple and easy.\n\n---\n\n**The Hidden Dragon Does Not Act**\nAs the first yang arises,\nGuard stillness,\nConstantly preserve sincerity,\nAnd the heart settles into steadfastness.\n\n*Ah!*\nWhen the dragon attains concealment,\nDo not advance lightly.\n\n---\n\n**The Dragon Appears in the Fields**\nStir the wind of Xun,\nAdvance the fire’s work—\nIn an instant,\nThe entire crucible glows red.\n\n*Is that so?*\nThe dragon appears in the fields,\nIts light pervading empty space.\n\n---\n\n**All Day Vigilant**\nHeaven and Earth unite,\nYin and yang balance—\nEight ounces of mercury,\nHalf a catty of lead.\n\n*Hehe!*\nThe maiden of mercury submits,\nThe infant of cinnabar receives.\n\n---\n\n**Perhaps Leaping in the Abyss**\nWater restrains fire,\nMetal overcomes wood—\nAt this time,\nIt is fitting to bathe.\n\n*(Tenfold power!)*\nPerhaps leaping in the abyss,\nPreserve the center with utmost care.\n\n---\n\n**The Flying Dragon in the Heavens**\nThe five qi converge,\nThe three flowers gather,\nWood and metal unite,\nLead and mercury stabilize.\n\n*Hūm!*\nThe flying dragon in the heavens,\nClouds move and rain descends.\n\n---\n\n**The Excessive Dragon Has Regrets**\nThe body is pure yang,\nThe six yangs complete—\nThen cease the fire,\nAnd do not speculate.\n\n*Stop!*\nIf you do not maintain fullness,\nThe excessive dragon will have regrets.\n\n---\n\n**Treading Frost to Ice**\nAs the first yin arises,\nDo not act recklessly;\nFirmly grasp and hold,\nGuarding the city with care.\n\n*Be meticulous!*\nPrevent the subtle and stop the gradual—\nTreading frost leads to ice.\n\n---\n\n**Upright, Square, and Great**\nEncountering the six in the second,\nGradually retreat;\nYin is centered,\nYang is in its hidden position.\n\n*Ditch!*\nMisty rain obscures,\nYet it benefits without practice.\n\n---\n\n**Containing Splendor, It Can Be Steadfast**\nWhite snow congeals,\nThe yellow sprout grows—\nFirmly cherish and protect,\nDo not speculate.\n\n*Gather!*\nThe yang crucible is firmly sealed,\nContaining splendor, it can be steadfast.\n\n---\n\n**Tying the Sack Without Fault**\nMercury seeks to fly,\nLead seeks to flee—\nAt this time,\nGuard with care.\n\n*Gah!*\nTake the bottomless sack,\nTie its mouth shut.\n\n---\n\n**Yellow Skirts, Primordial Auspiciousness**\nAll yin is exhausted,\nThe elixir path complete—\nThe utmost essence congeals,\nThe primordial qi rests.\n\n*Tut!*\nGather and return to the center,\nYellow skirts bring primordial auspiciousness.\n\n---\n\n**Dragons Battle in the Wilds**\nYin is concealed,\nYang arises again—\nAt this point,\nGuard once more.\n\n*Be cautious!*\nIf you encounter wild battle,\nIts blood will be dark and yellow.\n\n---\n\n**Warming and Nurturing the Spiritual Embryo**\nEmpty the heart,\nFill the abdomen,\nGuard tranquility,\nAwait the return of yang.\n\n*Ah!*\nIn an instant,\nThe celestial cycle is complete.\n\n---\n\n**The Mysterious Pearl Takes Form**\nOverturn the crucible,\nKick over the furnace—\nThe work is complete,\nThe mysterious pearl is born.\n\nReturn to the root and restore life,\nEmbrace the origin and return to the void.\n\n---\n\n**Fifteen verses, corresponding to the numbers three and five.**\n\n---\n\n**The Dao Speaks of the Golden Elixir**\nThe Golden Elixir is firm like gold,\nRound like cinnabar,\nRefined to ever greater clarity—\nThus is nature likened to the Golden Elixir.\n\nThe elixir is the crucible and vessel,\nThe medicine and ingredients.\n\n**Verse:**\nSince ancient times, this thing,\nFormless and without substance,\nLacking nothing, with no excess,\nWithout end, without rest.\nIts benefit is like gold,\nIts radiance like the sun.\n\n**Elixir**\nThe Daoists call it the Mysterious Pearl,\nThe Confucians call it the Supreme Ultimate,\nThe Daoists call it the Golden Elixir—\nThree names, one body.\nIt is right before your eyes,\nYet people do not recognize it.\nThis very thing—\nDo not doubt it further.\n\n---\n\n**Illustration of the Golden Elixir Clearly Revealed**\nAll illustrations and nine quatrains\nReveal the life’s root as the elixir’s function.\nThe annotated verses\nManifest nature as the elixir’s essence.\n\n---\n\n**1. Beginning the Work**\nBegin the work to establish the elixir’s foundation,\nDo not rely on midnight or noon.\nIn stillness, at the first movement,\nIt is the time when gui arises.\n\n**Elixir**\nBeware of misapprehension—\nSpring flowers, autumn moon,\nPeach red, plum white,\nThe scorching heat of the ninth summer,\nWinter’s snowfall—\nHow could summer be so?\nThere is no method to speak of.\n\n*Ah!*\nDo not doubt further.\n\nIn the twelfth month, plum holds jade,\nIn frosty skies, chrysanthemums sprout gold.\nWhen the wind comes, listen to the roaring waves,\nWhen the moon rises, watch the tide’s birth.\n\n---\n\n**2. Setting Up the Crucible**\nThe outer form is the crucible and vessel,\nWithin lies the medicinal material.\nIf you can gather it,\nThe spiritual embryo will form in an instant.\n\n**Elixir**\nPlant hemp to get hemp,\nEstablish the crucible through non-action.\nThe formless sets up the furnace,\nThe crucible and vessel are firm—\nNo need for effort.\n\n*Tut!*\nIn emptiness that is not empty,\nRefine the supreme treasure;\nIn non-action that is nowhere,\nSmelt the true suchness.\n\nBefore white snow blooms,\nThe yellow sprout first bears fruit.\nIf you wish the infant to be born,\nFirst let the maiden of mercury die.\n\n---\n\n**3. Gathering the Medicine**\nMercury is sought on the southern mountain,\nLead is sought in the northern sea.\nHarmonize with the earth of Kun,\nSubdue with the metal of Qian.\n\n**Elixir**\nWhat is it that you gather?\nSeeking mercury on the mountain’s peak,\nSeeking lead in the sea’s depths,\nScooping the moon from water,\nSearching for heaven beneath the earth.\n\n*Hehe!*\nNot knowing the true seed,\nYou waste your efforts in vain refinement.\n\nEnter the sea to seize the flood dragon,\nWith skill, capture the sun and moon.\nSend them to the crucible to burn,\nRefine them into a ball of snow.\n\n---\n\n**4. Practicing the Work**\nThe fire’s timing is no great matter,\nNothing more than wisdom and firmness.\nWood and metal never part,\nThe supreme treasure grows ever brighter.\n\n**Elixir**\nBeware of eyes growing flowers.\n\n**5. Maintaining Fullness**\nThe fire is great, the furnace hard to steady;\nToo much lead, the crucible must peril.\nAttain the mean without excess,\nAnd the elixir will not lack mercury.\n\n**Elixir**\nToo much is as bad as too little.\nTo master is not as good as to employ;\nTo take in much is not as good as to let out little.\nEver harbor the thief’s mind, yet steal nothing from others.\n\nKnow this:\nCareless storage invites theft,\nAlluring appearance invites lust.\nSit within closed doors,\nAnd calamities will naturally lessen.\nThe household thief is hardest to guard against—\nDo not overreach.\n\n**6. Nurturing**\nWhen nature settles, golden sand congeals;\nWhen the heart is empty, the infant is formed.\nYet it must be constantly warmed and nourished,\nLifted out to shine with radiance.\n\n**Elixir**\nHold fast,\nThe work of nurturing—\nLike a hen brooding her eggs.\nA hair’s breadth of error,\nA thousand miles of loss.\n\nLook closely:\nFirmly plant your roots,\nOpen your heart’s ground.\nRaising and guiding the child\nRequires a tongueless nurse.\nA moment’s neglect,\nAnd the hawk flies past Silla.\n\n**7. Harmonizing the Spirit**\nWhen qi is full, the infant sheds its husk,\nIts upbringing wholly entrusted to the mother.\nNurture and teach with the greater body,\nMoving in and out without hindrance.\n\n**Elixir**\nDo not stir—thirty blows await!\nEmerging from being, entering non-being,\nFreely roaming at will.\nLet go, gather back,\nVast and without attainment.\nSubtle as a mote of dust,\nVast as the cosmos.\nThe infant passes through Heaven’s Gate,\nRoaming to and fro.\nIn an instant, it traverses the eight poles;\nIn a flash, it crosses the three mountains.\n\n**8. Shedding the Husk**\nWhen the work is complete and merit fulfilled,\nSpiritual powers are wondrous and boundless.\nComing and going without obstruction,\nIn stillness, it meets the Empty Sovereign.\n\n**Elixir**\nStand firm where your feet are—\nThe root precedes the sprout,\nThe child follows the flower.\nWhen the flower fades, the child is formed,\nClouds and heaven share the same longevity.\nOnly when the stone shatters is the jade found;\nOnly when the sand is gone is the gold revealed.\nWhen the water clears, the fish appear of themselves;\nWhen the clouds disperse, the moon’s brilliance shines.\n\n**9. Consummation**\nKick over the furnace that burns the sky,\nOverturn the cauldron that boils the sea.\nRend asunder the emptiness,\nRevealing the solitary True Suchness.\n\n**Elixir**\nHouse broken, family gone—\nHaving attained this one thing,\nAll affairs are wholly complete.\nUtterly luminous and clear,\nThe emptiness stands stark.\n\n*Hah!*\nThe one-horned fire dragon soars into the heavens,\nStartling the spring with a thunderclap.\n\nWhen completion is truly complete,\nThere is no \"after\" in the real \"nothingness.\"\nWhen \"nothingness\" is truly complete,\nThe body merges with the Great Void.\n\n**Explanation of the *Sutra of Perfect Enlightenment***\n**Direct Pointers to the *Heart Sutra***\n\nOne day, Layman Ji’an, who reverently upheld the *Prajñāpāramitā Heart Sutra*, visited me seeking further elucidation of its meaning.\n\nI said: \"This single scroll of scripture is known before it is even recited—what need is there for explanation? To forcibly add annotations would be like placing a head upon a head.\"\n\nJi’an replied: \"Yet for beginners, the profound meaning is not easily grasped. Moreover, the many interpretations by various masters leave students with lingering doubts. I implore your compassion to enlighten me.\"\n\nI said: \"When the World-Honored One of the future expounded this sutra, he guided all beings by directly pointing to the essential mystery. From the very first phrase to the very last, it does not depart from a single word: *emptiness*. Within it, the samadhi of language repeatedly exhorts, repeatedly explains itself, making it easy for learners to comprehend. Alas, later generations cling to the text, some fixating on form, others attaching to the view of emptiness, ultimately failing to penetrate the essential mystery. Past patriarchs, out of necessity, added annotations, establishing various expedient means to respond to conditions and guide beings, allowing people to enter according to their understanding. But in their eagerness to help, they have instead caused those of the highest capacity to pile doubt upon doubt. This is precisely what is meant by: 'Those of middling or lesser capacity cannot be spoken to of the highest.'\n\nNow, since you have doubts and seek explanation, this is the very root of awakening. I shall not refrain from speaking—listen carefully.\n\nConsider the *Mahāprajñāpāramitā Sutra of the Great Wisdom That Reaches the Other Shore, the Essential Nature of the Heart*—it is the direct path. In short, the great wisdom that reaches the other shore is the dharma-gate of seeing one’s nature, the shortcut traversed by all. Those who practice this Way observe themselves in their daily conduct, constantly and attentively guarding their mindfulness, never allowing it to lapse. With long and unbroken practice, they attain great freedom, unimpeded in all directions, unbound by creation. Thus it is said: 'When bodhisattvas practice the profound *prajñāpāramitā*,' this is the time of practicing this Way. When effort deepens and power is perfected, wisdom becomes fully integrated, uniting with the original source, entering the sudden and complete. Transcending the ordinary, surpassing the sagely—this is what is meant by 'reaching the other shore.'\n\nAt this time, they perceive that the five aggregates are empty. When the five aggregates are empty, what phenomena could remain? Thus they are able to transcend all suffering and distress.\n\n'Śāriputra'—the sharpest child within the house. 'Child' is like the master of a house, referring to the pure dharmakāya. Form is not different from emptiness; emptiness is not different from form. Form is precisely emptiness; emptiness is precisely form. Feeling, perception, volition, and consciousness are also thus.\n\nEarlier in the sutra, the five aggregates are all empty—form, the sharpest child within the house. These dharmas are empty in nature, identical in substance to emptiness, indestructible through kalpas. This is what is meant by: 'neither arising nor ceasing,' without coming or going; 'neither defiled nor pure,' without contamination or attachment; 'neither increasing nor decreasing,' without surplus or lack.\n\nTherefore, within emptiness there is no form, no feeling, perception, volition, or consciousness; no eye, ear, nose, tongue, body, or mind; no form, sound, smell, taste, touch, or dharmas. This is called the empty nature, originally without the five aggregates or the six consciousnesses—how could there be the six sense objects? Consciousness arises from the eye realm; where there is the eye realm, there are the five aggregates; where there are the five aggregates, there are the six sense faculties; where there are the six sense faculties, there are the six consciousnesses; where there are the six consciousnesses, there are the six sense objects.\"\n\nWithout the eye realm, how could there be sense objects or consciousness? Thus it is said: even unto the absence of the mind-consciousness realm. The mind-consciousness realm encompasses the prior eighteen realms. Without this mind-consciousness, there is no ignorance, nor is there the exhaustion of ignorance. What is meant by \"no exhaustion of ignorance\" is merely that ignorance does not arise. If ignorance were utterly extinguished, one would fall into dead emptiness. The *Dan Shu* says: \"Quelling thoughts is the nurturing of the fire\"—this is what it means.\n\nIgnorance is the root of birth and death. The *Dan Shu* says: \"Where thoughts arise is the Mysterious Female; the gate of the Mysterious Female is called the root of heaven and earth.\" Is this not the root of birth and death? Therefore, without ignorance, there is neither old age and death, nor the exhaustion of old age and death; no suffering, origination, cessation, or path; no wisdom, nor delusion; no attainment. With nothing to attain, there is nothing to lose.\n\nThus all dharma of the mind is empty. To realize the dharma of the mind is called *bodhi*; to realize the emptiness of dharmas is called *sattva*. Beginners rely on *prajñāpāramitā*, and so their minds are without obstruction. This is called moving from existence into non-existence, from the coarse to the subtle, awakening great wisdom to shatter delusion, ever-pure and harmonious with the original nature. At the ultimate perfection, the mind is one with the great void, vast and unobstructed.\n\nWith no attachments, there is no fear, and one is far removed from inverted dreams and illusions. The dreaming mind is the work of confusion. Without confusion, the *Dharmakāya* is pure, and thus one can attain ultimate *nirvāṇa*. All buddhas of the three times and ancestral masters of past generations relied on *prajñāpāramitā* to attain *Anuttarā Samyaksaṃbodhi*. Later true learners of the Buddha follow this path, awakening the six wisdoms to purify and harmonize with the original nature, thereby realizing the supreme, perfect enlightenment.\n\nFor this reason, *prajñāpāramitā* is the fourfold mantra. *Mahā* is the great divine mantra, referring to the indestructible four great elements of the body, whose spiritual powers are unfathomable. *Prajñā* is the great luminous mantra, referring to the all-pervading wisdom that is diligent, bright, and wondrous. *Pāramitā* is the unsurpassed mantra, referring to harmony with the original nature, the supreme vehicle. *Mita* is the unequaled mantra, referring to the ultimate perfection, beyond which there is nothing higher.\n\nOne who realizes these four mantras can then eliminate all suffering—this is true and not false. Thus the World-Honored One expounded this *prajñāpāramitā* mantra, which is the explanation of the meaning of the preceding four-line mantra. Thus it is said: *Gate* refers to the emptiness of persons; *gate* again refers to the emptiness of dharmas; *pāragate* refers to the emptiness of all mind-dharmas upon reaching the other shore; *pārasaṃgate* refers to reaching the shore without needing a boat. These four *gate* mantras correspond to the four great elements within the body. When the four great elements are all empty, the true and constant alone is revealed—thus it is said: *bodhi svāhā*. *Bodhi* is the beginning; *svāhā* is the end. When beginning and end are one, one embraces the original and returns to the void, surpassing buddhas and ancestors.\n\nThough it be thus, those who transmit and receive this teaching must straighten their spines and focus their gaze, lest they miss the mark. If one can, in the midst of daily activities, stumble upon and recognize one’s own nature, one will realize that this sūtra is not obtained from without. Not only this *Heart Sūtra*, but all the vast teachings of Buddhism and Daoism, and the hundred schools of thought—one need only a single shout to penetrate them from beginning to end. If this is not yet so, then investigate this single point. Do not doubt further.\n\nDrawing on the principles of Confucianism and Buddhism to illuminate the Dao, the learner will understand that the three teachings are fundamentally one, without dualistic views.\n\nThe *Yin Fu Jing* [*Direct Pointer to the Yin Fu Jing*]:\nThe *Yin Fu Jing* concerns the mechanism of yin-yang harmony, a principle universally practiced. Observing the Dao of heaven, heaven displays signs to indicate fortune and misfortune, which the sage emulates. Mastering the movements of heaven is perfection. The transformations of heaven and earth are mirrored by the sage. Heaven has five thieves: the five *qi* give birth to the myriad things, and the five *qi* steal from the myriad things. Those who see this prosper. Seeing the five aggregates as empty, one transcends all suffering and distress. The five thieves reside in the mind; the mechanism of theft is within. When applied to heaven, the heavenly principle is not violated.\n\nThe cosmos lies within the hand, grasping the movements of heaven. The myriad transformations arise within the body. Heaven and earth are none other than myself. Heavenly nature is human nature; what heaven bestows upon humanity is *xing* (nature). The human heart is the mechanism. What sets this mechanism in motion is the heart.\n\nEstablish the Dao of heaven to stabilize humanity. Heaven establishes its lineage and institutes teachings to transform people. When heaven unleashes its killing mechanism, the heavenly mechanism, though inherently without intent, reveals that within killing lies the intent for life. Dragons and serpents rise from the land; their coils, being utterly still and desireless, enable them to respond to opportunity and arise in accord with the times. When humans unleash their killing mechanism, the human heart, though originally without intent, can conceal and yet manifest.\n\nHeaven and earth reverse themselves. The divine mechanism operates wondrously, thus their reversals are unfathomable. When heaven and humanity act in unison, the human mechanism aligns with the heavenly mechanism. The foundation of myriad changes is established. By establishing the foundation in the heart, all changes are stabilized.\n\nNature may be skillful or clumsy; things are not uniform and thus can be concealed. Skill and clumsiness are indistinguishable. The nine orifices are perverse; if one orifice is unsettled, all nine become perverse. It lies in the three essentials. When body, heart, and intent are settled, all nine orifices are unobstructed.\n\nFire is born from wood, just as the five thieves reside in the heart—when misfortune arises, it must overcome. The heart is harmed by the five thieves. Treachery arises within the state; the myriad transformations arise within the body—when the time moves, it must collapse. The body is the mechanism of myriad transformations.\n\nThose who know this and cultivate refinement, skillfully governing the crown, carefully guard against fire and prevent treachery—these are called sages. Enriching the state and pacifying the people—this is what defines a sage.\n\nHeaven gives life, heaven brings death; it animates the myriad things without sharing the sage’s concerns—this is the principle of the Dao. Generation and transformation are the constant principles of the Dao.\n\nHeaven and earth are the thieves of the myriad things; heaven gives life to the myriad things and also kills them. The myriad things are the thieves of humanity; they nourish humanity and yet can also steal from them. Humanity is the thief of the myriad things; humans complete the myriad things and yet steal from them.\n\nWhen the three thieves are fitting, humans can transform things, and the three thieves are all transmuted. When the three powers are at peace, humans follow the heavenly principle, and the three powers are all at peace.\n\nThus it is said: Eat in season, and the hundred bones are ordered. With regulated eating and drinking, the hundred bones are all in harmony. Move in accord with the mechanism, and the myriad transformations are at peace. In movement and stillness, responding to opportunity, the myriad transformations are all at peace.\n\nHumans know the divine as divine, mistaking the thief for their child, unaware of the divine nature of the non-divine. This is not the mark of dharmas; this is called the mark of dharmas. The sun and moon have their cycles; their waxing and waning follow fixed patterns. Great and small have their determinations. Though great and small differ, each has its fixed form.\n\nSagehood arises therein; when great and small are undifferentiated, sagehood arises. Spirit and illumination emerge. When the sun and moon unite their virtues, spirit and illumination manifest.\n\nThe thief is the mechanism. It does not depart from the square inch. All under heaven see it—every thing is fully revealed—yet none know it, and even when face-to-face, they do not recognize it.\n\nThe noble person who attains it embodies it in their conduct; the noble person acts in accord with the times. The petty person who attains it treats life lightly; the petty person is without restraint.\n\nThe blind excel in hearing; sound and form are concentrated in the ear. The deaf excel in seeing; crimson hues are concentrated in the eye. Cutting off one source of desire, crimson hues lie hidden in the heart. Employing the teacher yields tenfold results. When the heart is concentrated on one, achievement is tenfold.\n\nReversing by day and night, one turns inward to see and listen, returning to the body to achieve sincerity. Employing the teacher yields ten-thousandfold results. Morning and evening, never forgetting—achievement is ten-thousandfold.\n\nThe heart arises from things, and with the heart arise all dharmas. It dies through things. When the heart perishes, all dharmas perish.\n\nThe mechanism lies in the eye. Without the eye-realm, even to the absence of the mind-consciousness realm.\n\nHeaven’s lack of favor is Heaven’s release of the killing mechanism, yet great favor arises. All things fulfill their lives.\n\nSwift thunder and fierce winds, repeated thunderclaps— the noble person cultivates and reflects in fear and trembling. None are not stirred into motion. Fear brings forth blessing.\n\nSupreme joy abounds in nature; constant joy lies in my stillness. In utmost stillness, there is integrity. In extreme stillness, frugality in movement.\n\nHeaven’s utmost partiality is to give life and take life. Employed with utmost impartiality, it is without faction or bias.\n\nThe regulation of birds lies in qi. The regulation of bird-thieves lies in governing qi.\n\nLife is the root of death; when qi flourishes, spirit darkens. Death is the root of life; when qi dissipates, spirit quickens.\n\nFavor arises from harm; halting the sun lengthens wisdom. Harm arises from favor. Capturing the thief secures achievement.\n\nThe foolish deem the patterns of heaven and earth sagely; the ignorant cannot follow heaven’s principle, yet take patterns as sagacity. I find wisdom in the patterns of seasonal things. The enlightened, possessing heaven and earth within themselves, thus find wisdom in the patterns of seasonal things.\n\n○ Observing heaven’s Dao, grasping heaven’s actions—this is perfection. The three heavens complete the marrow’s transformation.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "三天易髓 经名：三天易髓。 元茔蟾子（李道纯）撰，混然子（王玠）校正。 一卷。 底本出处：《正统道藏》洞真部方法类。 儒曰太极 火符直指 乾坤鼎器 上柱天，下柱地，只这人，是鼎器。 咦，既知下手，工夫简易。 潜龙勿用 一阳生，宜守静，常存诚，心正定。 咦，龙得潜藏，勿宜轻进。 见龙在田 鼓巽风，进火功，剎那间，满炉红。 是么，见龙在田，光遍虚空。 终日乾乾 天地交，阴阳均，汞八两，铅半斤。 呵呵，姹女敛伏，婴儿仰承。 或跃在渊 水制火，金克木，到斯时，宜沐浴。 (囗十力)，或跃在渊，存中谨笃。 飞龙在天 五炁朝，三花聚，木金交，铅汞住。 吽，飞龙在天，云行雨致。 亢龙有悔 体纯乾，六阳备，便住火，莫拟议。 住，若不持盈，亢龙有悔。 履霜至冰 始生阴，莫妄行，牢执捉，谨守城。 子细，防微杜渐，履霜至冰。 直方大 逢六二，渐渐退，阴正中，阳伏位。 堑，烟雨蒙蒙，不习自利。 含章可贞， 白雪凝，黄芽生，牢爱护莫拟议。 收，阳炉固济，含章可贞。 括囊无咎 汞要飞，铅要走，至斯时，宜谨守。 嘎，把没底囊，括结其口。 黄裳元吉 群阴尽，丹道毕，至精凝，元炁息。 咄，收拾归中，黄裳元吉。 龙战于野 阴既藏，阳再生，到这裹，再堤防。 小心，若逢野战，其血玄黄。 温养灵胎 虚其心，实其腹，守安静，待阳复。 咦，一剎那间，周天数足。 玄珠成象 掀倒鼎，踢翻炉，功备也，产玄珠。 归根复命，抱本还虚。 右十五颂，准三五之数。 道曰金丹 金丹者，如金之坚，如丹之圆，愈炼愈明，故喻性为金丹也。 丹，炉鼎也，药物也。 颂曰 亘古此物，无形无质。 无欠无余，无休无息。 其利如金，其红如日。 丹 释曰玄珠，儒曰太极。 道曰金丹，名三体一。 只在目前，世人不识。 只这便是，休更疑惑。 金丹了然图 凡图并绝句九首，发明命本为丹之用。 注脚颂，显性为丹之〔体〕。 一、下手 下手立丹基，休将子午推。 静中才一动，便是癸生时。 丹 切忌错会，春花秋月。 桃红李白，九夏酷热。 三冬下雪，夏间如何？ 无法可说。 咦，休更疑惑。 腊月梅含玉，霜天菊吐金。 风来听浪吼，月上看潮生。 二、安炉 外象为炉鼎，中间是药材，诚能收拾得，即刻结灵胎。 丹 种麻得麻，无为立鼎。 罔象安炉，鼎炉坚固，勿用工夫。 咄，空不空中烹至宝，无为无处炼真如。 白雪未开花，黄芽先结子，欲得婴儿生，先教姹女死。 三、采药 汞向南山采，铅从北海寻，调和藉坤土，制伏仗乾金。 丹 采个甚么？ 山头求汞，海底求铅。 水中捞月，地下寻天。 呵呵，不知真种子，徒尔费烹煎。 入海捉蛟龙，工夫擒日月。 送鼎中烧，炼作一团雪。 四、行功 火侯无多事，无非只慧刚。 木金常不间，至宝愈增光。 丹 切忌眼生花。",
      "translated_text": "**Three Days Refining the Marrow**\n\n*Scripture Title:* Three Days Refining the Marrow\n*Composed by:* Yuanying Chanzi (Li Daochun)\n*Collated by:* Hunranzi (Wang Jie)\n*One fascicle.*\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Dongzhen Section, Methods Category.\n\n---\n\n**Confucians call it the Supreme Ultimate;**\nThe Fire Talisman points directly:\nHeaven and Earth as crucible and vessel.\nAbove, it props up the heavens; below, it props up the earth—\nThis very person is the crucible and vessel.\n\n*Ah!*\nOnce you know where to begin,\nThe work is simple and easy.\n\n---\n\n**The Hidden Dragon Does Not Act**\nAs the first yang arises,\nGuard stillness,\nConstantly preserve sincerity,\nAnd the heart settles into steadfastness.\n\n*Ah!*\nWhen the dragon attains concealment,\nDo not advance lightly.\n\n---\n\n**The Dragon Appears in the Fields**\nStir the wind of Xun,\nAdvance the fire’s work—\nIn an instant,\nThe entire crucible glows red.\n\n*Is that so?*\nThe dragon appears in the fields,\nIts light pervading empty space.\n\n---\n\n**All Day Vigilant**\nHeaven and Earth unite,\nYin and yang balance—\nEight ounces of mercury,\nHalf a catty of lead.\n\n*Hehe!*\nThe maiden of mercury submits,\nThe infant of cinnabar receives.\n\n---\n\n**Perhaps Leaping in the Abyss**\nWater restrains fire,\nMetal overcomes wood—\nAt this time,\nIt is fitting to bathe.\n\n*(Tenfold power!)*\nPerhaps leaping in the abyss,\nPreserve the center with utmost care.\n\n---\n\n**The Flying Dragon in the Heavens**\nThe five qi converge,\nThe three flowers gather,\nWood and metal unite,\nLead and mercury stabilize.\n\n*Hūm!*\nThe flying dragon in the heavens,\nClouds move and rain descends.\n\n---\n\n**The Excessive Dragon Has Regrets**\nThe body is pure yang,\nThe six yangs complete—\nThen cease the fire,\nAnd do not speculate.\n\n*Stop!*\nIf you do not maintain fullness,\nThe excessive dragon will have regrets.\n\n---\n\n**Treading Frost to Ice**\nAs the first yin arises,\nDo not act recklessly;\nFirmly grasp and hold,\nGuarding the city with care.\n\n*Be meticulous!*\nPrevent the subtle and stop the gradual—\nTreading frost leads to ice.\n\n---\n\n**Upright, Square, and Great**\nEncountering the six in the second,\nGradually retreat;\nYin is centered,\nYang is in its hidden position.\n\n*Ditch!*\nMisty rain obscures,\nYet it benefits without practice.\n\n---\n\n**Containing Splendor, It Can Be Steadfast**\nWhite snow congeals,\nThe yellow sprout grows—\nFirmly cherish and protect,\nDo not speculate.\n\n*Gather!*\nThe yang crucible is firmly sealed,\nContaining splendor, it can be steadfast.\n\n---\n\n**Tying the Sack Without Fault**\nMercury seeks to fly,\nLead seeks to flee—\nAt this time,\nGuard with care.\n\n*Gah!*\nTake the bottomless sack,\nTie its mouth shut.\n\n---\n\n**Yellow Skirts, Primordial Auspiciousness**\nAll yin is exhausted,\nThe elixir path complete—\nThe utmost essence congeals,\nThe primordial qi rests.\n\n*Tut!*\nGather and return to the center,\nYellow skirts bring primordial auspiciousness.\n\n---\n\n**Dragons Battle in the Wilds**\nYin is concealed,\nYang arises again—\nAt this point,\nGuard once more.\n\n*Be cautious!*\nIf you encounter wild battle,\nIts blood will be dark and yellow.\n\n---\n\n**Warming and Nurturing the Spiritual Embryo**\nEmpty the heart,\nFill the abdomen,\nGuard tranquility,\nAwait the return of yang.\n\n*Ah!*\nIn an instant,\nThe celestial cycle is complete.\n\n---\n\n**The Mysterious Pearl Takes Form**\nOverturn the crucible,\nKick over the furnace—\nThe work is complete,\nThe mysterious pearl is born.\n\nReturn to the root and restore life,\nEmbrace the origin and return to the void.\n\n---\n\n**Fifteen verses, corresponding to the numbers three and five.**\n\n---\n\n**The Dao Speaks of the Golden Elixir**\nThe Golden Elixir is firm like gold,\nRound like cinnabar,\nRefined to ever greater clarity—\nThus is nature likened to the Golden Elixir.\n\nThe elixir is the crucible and vessel,\nThe medicine and ingredients.\n\n**Verse:**\nSince ancient times, this thing,\nFormless and without substance,\nLacking nothing, with no excess,\nWithout end, without rest.\nIts benefit is like gold,\nIts radiance like the sun.\n\n**Elixir**\nThe Daoists call it the Mysterious Pearl,\nThe Confucians call it the Supreme Ultimate,\nThe Daoists call it the Golden Elixir—\nThree names, one body.\nIt is right before your eyes,\nYet people do not recognize it.\nThis very thing—\nDo not doubt it further.\n\n---\n\n**Illustration of the Golden Elixir Clearly Revealed**\nAll illustrations and nine quatrains\nReveal the life’s root as the elixir’s function.\nThe annotated verses\nManifest nature as the elixir’s essence.\n\n---\n\n**1. Beginning the Work**\nBegin the work to establish the elixir’s foundation,\nDo not rely on midnight or noon.\nIn stillness, at the first movement,\nIt is the time when gui arises.\n\n**Elixir**\nBeware of misapprehension—\nSpring flowers, autumn moon,\nPeach red, plum white,\nThe scorching heat of the ninth summer,\nWinter’s snowfall—\nHow could summer be so?\nThere is no method to speak of.\n\n*Ah!*\nDo not doubt further.\n\nIn the twelfth month, plum holds jade,\nIn frosty skies, chrysanthemums sprout gold.\nWhen the wind comes, listen to the roaring waves,\nWhen the moon rises, watch the tide’s birth.\n\n---\n\n**2. Setting Up the Crucible**\nThe outer form is the crucible and vessel,\nWithin lies the medicinal material.\nIf you can gather it,\nThe spiritual embryo will form in an instant.\n\n**Elixir**\nPlant hemp to get hemp,\nEstablish the crucible through non-action.\nThe formless sets up the furnace,\nThe crucible and vessel are firm—\nNo need for effort.\n\n*Tut!*\nIn emptiness that is not empty,\nRefine the supreme treasure;\nIn non-action that is nowhere,\nSmelt the true suchness.\n\nBefore white snow blooms,\nThe yellow sprout first bears fruit.\nIf you wish the infant to be born,\nFirst let the maiden of mercury die.\n\n---\n\n**3. Gathering the Medicine**\nMercury is sought on the southern mountain,\nLead is sought in the northern sea.\nHarmonize with the earth of Kun,\nSubdue with the metal of Qian.\n\n**Elixir**\nWhat is it that you gather?\nSeeking mercury on the mountain’s peak,\nSeeking lead in the sea’s depths,\nScooping the moon from water,\nSearching for heaven beneath the earth.\n\n*Hehe!*\nNot knowing the true seed,\nYou waste your efforts in vain refinement.\n\nEnter the sea to seize the flood dragon,\nWith skill, capture the sun and moon.\nSend them to the crucible to burn,\nRefine them into a ball of snow.\n\n---\n\n**4. Practicing the Work**\nThe fire’s timing is no great matter,\nNothing more than wisdom and firmness.\nWood and metal never part,\nThe supreme treasure grows ever brighter.\n\n**Elixir**\nBeware of eyes growing flowers.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1209,
      "start_sentence": 0,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.67817521095276,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\三天易髓.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "杀人手段，无非铁汉。 提起疑团，一刀两段。 嘎，文以怀胎，武以讨叛。 会举烧山火，能兴刮地风。 迷云全扫尽，独现一轮红。 五、持盈 火大炉难稳，铅多鼎必危。 得中无过极，丹作汞无亏。 丹 过犹不及，能撰不如能使，多入不如少出。 常作贼心莫偷他物。 知么，慢藏诲盗，治容诲淫。 闭门屋裹坐，自然少灾祸。 家贼最难防，也须休托大。 六、温养 性定金砂结，心空赤子成。 更须常暖养，拈出便光明。 丹 牢把捉，温养工夫，如鸡覆子。 差之毫厘，失之千里。 仔细看，牢着脚根，放开心地。 养育提携子，须凭没口婆。 分毫失照顾，鹞子过新罗。 七、调神 炁足婴兄蜕，提携全在娘。 养教全大体，出入了无妨。 丹 休动动着三十棒，出有入无，纵横自在。 放去收来，廓然无得。 细入微尘，大周天界。 赤子出天关，纵横去复还。 须臾游八极，倏忽过三山。 八、脱胎 行满功成日，神通妙无量。 去来无所碍，定裹谒虚皇。 丹 当脚住，根在苗先，子从花后。 花谢子成，云天齐寿。 石破方逢玉，沙无始得金。 水清鱼自现，云散月华明。 九、了当 踢倒烧天鼎，掀翻煮海炉。 虚空擘拶碎，独露一真如。 丹 家破人亡，了得一个，万事全毕。 彻底莹然，虚空突兀。 咄，独角火龙飞上天，惊起一声春霹雳。 了时真了了，无后实无无。 了了无无了，身多混太虚。 释曰圆觉 心经直指 济庵居士奉持《般若心经》，一日访余，请益解义。 余曰：夫此一卷经，未举先知，何须解说，若强添注脚，是头上安头也。 济庵曰：然如是初机之人，未能深解义趣，兼之诸家解多有，同学者不能无疑。 望师慈悯，开我余曰：当来世尊，宣说此经，诱化群品，直指玄要。 自起初一句，至末后一句，都不出一个空字。 其间语言三昧，再四叮咛，反覆自解，使学者易为晓会。 奈何后人着在文字上，或泥形体，或着空见，到底不通玄要。 前代宗师不获已，下个注脚，设立种种方便，随机应物，使世人随其所解而入。 只为老婆心切，反使上乘之人，疑上添疑。 正所谓中人以下，不可以语上也。 今公有疑求解义，即是悟底根本。 余今不兔饶舌，谛听谛听。 且如《摩诃般若大智慧也波罗蜜多到彼岸也心性本也经》径路也。 总而言之，大智慧而到彼岸也，是为见性法门，众所通行之截径也。 行斯道者，向日用常行处，观诸己，常切照顾，念兹在兹，忽令间断，久久纯熟，得大自在，四通八达，造化难拘。 故名菩萨行深般若波罗蜜多时，则是行斯道之时也。 功深力到，智慧圆通，合和本来，入於圆顿，超凡越圣，是谓到彼岸也。 当此之时，照见五蕴皆空。 五蕴既空，万象何有，所以能度一切苦厄者也。 舍利子者，舍中之利子。 子者，犹屋中之主人，是谓清浄法身也。 色不异空，空不异色，色即是空，空即是色。 受想行识，亦复如是。 此经上文五蕴皆空色，舍中之利子。 是诸法空相，与虚空同体，历劫不坏，所谓不生不灭者，无往来也； 不垢不净者，无染着也； 不增不减者，无余欠也。 是故空中无色、无受想行识、无眼耳鼻舌身意、无色声香味触法； 此谓空相元无五蕴，亦无六识，岂有六尘。 识者由眼界，而所染有眼界便有五蕴，有五蕴便有六根，有六根便有六识，有六识便有六尘也。",
      "translated_text": "**5. Maintaining Fullness**\nThe fire is great, the furnace hard to steady;\nToo much lead, the crucible must peril.\nAttain the mean without excess,\nAnd the elixir will not lack mercury.\n\n**Elixir**\nToo much is as bad as too little.\nTo master is not as good as to employ;\nTo take in much is not as good as to let out little.\nEver harbor the thief’s mind, yet steal nothing from others.\n\nKnow this:\nCareless storage invites theft,\nAlluring appearance invites lust.\nSit within closed doors,\nAnd calamities will naturally lessen.\nThe household thief is hardest to guard against—\nDo not overreach.\n\n**6. Nurturing**\nWhen nature settles, golden sand congeals;\nWhen the heart is empty, the infant is formed.\nYet it must be constantly warmed and nourished,\nLifted out to shine with radiance.\n\n**Elixir**\nHold fast,\nThe work of nurturing—\nLike a hen brooding her eggs.\nA hair’s breadth of error,\nA thousand miles of loss.\n\nLook closely:\nFirmly plant your roots,\nOpen your heart’s ground.\nRaising and guiding the child\nRequires a tongueless nurse.\nA moment’s neglect,\nAnd the hawk flies past Silla.\n\n**7. Harmonizing the Spirit**\nWhen qi is full, the infant sheds its husk,\nIts upbringing wholly entrusted to the mother.\nNurture and teach with the greater body,\nMoving in and out without hindrance.\n\n**Elixir**\nDo not stir—thirty blows await!\nEmerging from being, entering non-being,\nFreely roaming at will.\nLet go, gather back,\nVast and without attainment.\nSubtle as a mote of dust,\nVast as the cosmos.\nThe infant passes through Heaven’s Gate,\nRoaming to and fro.\nIn an instant, it traverses the eight poles;\nIn a flash, it crosses the three mountains.\n\n**8. Shedding the Husk**\nWhen the work is complete and merit fulfilled,\nSpiritual powers are wondrous and boundless.\nComing and going without obstruction,\nIn stillness, it meets the Empty Sovereign.\n\n**Elixir**\nStand firm where your feet are—\nThe root precedes the sprout,\nThe child follows the flower.\nWhen the flower fades, the child is formed,\nClouds and heaven share the same longevity.\nOnly when the stone shatters is the jade found;\nOnly when the sand is gone is the gold revealed.\nWhen the water clears, the fish appear of themselves;\nWhen the clouds disperse, the moon’s brilliance shines.\n\n**9. Consummation**\nKick over the furnace that burns the sky,\nOverturn the cauldron that boils the sea.\nRend asunder the emptiness,\nRevealing the solitary True Suchness.\n\n**Elixir**\nHouse broken, family gone—\nHaving attained this one thing,\nAll affairs are wholly complete.\nUtterly luminous and clear,\nThe emptiness stands stark.\n\n*Hah!*\nThe one-horned fire dragon soars into the heavens,\nStartling the spring with a thunderclap.\n\nWhen completion is truly complete,\nThere is no \"after\" in the real \"nothingness.\"\nWhen \"nothingness\" is truly complete,\nThe body merges with the Great Void.\n\n**Explanation of the *Sutra of Perfect Enlightenment***\n**Direct Pointers to the *Heart Sutra***\n\nOne day, Layman Ji’an, who reverently upheld the *Prajñāpāramitā Heart Sutra*, visited me seeking further elucidation of its meaning.\n\nI said: \"This single scroll of scripture is known before it is even recited—what need is there for explanation? To forcibly add annotations would be like placing a head upon a head.\"\n\nJi’an replied: \"Yet for beginners, the profound meaning is not easily grasped. Moreover, the many interpretations by various masters leave students with lingering doubts. I implore your compassion to enlighten me.\"\n\nI said: \"When the World-Honored One of the future expounded this sutra, he guided all beings by directly pointing to the essential mystery. From the very first phrase to the very last, it does not depart from a single word: *emptiness*. Within it, the samadhi of language repeatedly exhorts, repeatedly explains itself, making it easy for learners to comprehend. Alas, later generations cling to the text, some fixating on form, others attaching to the view of emptiness, ultimately failing to penetrate the essential mystery. Past patriarchs, out of necessity, added annotations, establishing various expedient means to respond to conditions and guide beings, allowing people to enter according to their understanding. But in their eagerness to help, they have instead caused those of the highest capacity to pile doubt upon doubt. This is precisely what is meant by: 'Those of middling or lesser capacity cannot be spoken to of the highest.'\n\nNow, since you have doubts and seek explanation, this is the very root of awakening. I shall not refrain from speaking—listen carefully.\n\nConsider the *Mahāprajñāpāramitā Sutra of the Great Wisdom That Reaches the Other Shore, the Essential Nature of the Heart*—it is the direct path. In short, the great wisdom that reaches the other shore is the dharma-gate of seeing one’s nature, the shortcut traversed by all. Those who practice this Way observe themselves in their daily conduct, constantly and attentively guarding their mindfulness, never allowing it to lapse. With long and unbroken practice, they attain great freedom, unimpeded in all directions, unbound by creation. Thus it is said: 'When bodhisattvas practice the profound *prajñāpāramitā*,' this is the time of practicing this Way. When effort deepens and power is perfected, wisdom becomes fully integrated, uniting with the original source, entering the sudden and complete. Transcending the ordinary, surpassing the sagely—this is what is meant by 'reaching the other shore.'\n\nAt this time, they perceive that the five aggregates are empty. When the five aggregates are empty, what phenomena could remain? Thus they are able to transcend all suffering and distress.\n\n'Śāriputra'—the sharpest child within the house. 'Child' is like the master of a house, referring to the pure dharmakāya. Form is not different from emptiness; emptiness is not different from form. Form is precisely emptiness; emptiness is precisely form. Feeling, perception, volition, and consciousness are also thus.\n\nEarlier in the sutra, the five aggregates are all empty—form, the sharpest child within the house. These dharmas are empty in nature, identical in substance to emptiness, indestructible through kalpas. This is what is meant by: 'neither arising nor ceasing,' without coming or going; 'neither defiled nor pure,' without contamination or attachment; 'neither increasing nor decreasing,' without surplus or lack.\n\nTherefore, within emptiness there is no form, no feeling, perception, volition, or consciousness; no eye, ear, nose, tongue, body, or mind; no form, sound, smell, taste, touch, or dharmas. This is called the empty nature, originally without the five aggregates or the six consciousnesses—how could there be the six sense objects? Consciousness arises from the eye realm; where there is the eye realm, there are the five aggregates; where there are the five aggregates, there are the six sense faculties; where there are the six sense faculties, there are the six consciousnesses; where there are the six consciousnesses, there are the six sense objects.\"",
      "overlap_context": "rom water,\nSearching for heaven beneath the earth.\n\n*Hehe!*\nNot knowing the true seed,\nYou waste your efforts in vain refinement.\n\nEnter the sea to seize the flood dragon,\nWith skill, capture the sun and moon.\nSend them to the crucible to burn,\nRefine them into a ball of snow.\n\n---\n\n**4. Practicing the Work**\nThe fire’s timing is no great matter,\nNothing more than wisdom and firmness.\nWood and metal never part,\nThe supreme treasure grows ever brighter.\n\n**Elixir**\nBeware of eyes growing flowers.",
      "start_char": 1209,
      "end_char": 2515,
      "start_sentence": 100,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.72419834136963,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\三天易髓.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "无眼界、尘识何有，故曰乃至无意识界； 意识界者，前十八界也。 无此意识，则无无明、亦无无明尽； 所谓无无明尽者，只是无明不起也。 若尽无无，则落顽空矣。 丹书云：息念为养火，此之谓也。 无明者，生死之根本。 丹书云：念头起处为玄牝，玄牝之门，是谓天地根。 岂非生死之根本乎。 所以无无明则乃至无老死、亦无老死尽； 无苦集灭道，亦无智慧而无愚痴，亦无得。 以无所得，以无所得，亦无所失。 故是以心法皆空也。 了得心法，名曰菩提； 了得法空，名曰萨埵，初机之人依般若波罗蜜多，故心无坚碍。 此谓自有入无，从粗达妙，发大智慧而破愚痴，常清净而合和本来，且於圆满极则，心同太虚，廓然无碍也。 既无挂碍，故无有恐怖，远离颠倒梦想。 梦想心者，昏迷之为也。 既无昏乱，则法身清净，所以能究竟涅盘也。 三世诸佛，历代祖师，皆依般若波罗蜜多，故得阿耨多罗三藐三菩提。 后正学佛者，依是而行，发六慧智，以清净合和本来，故证无上至真正等正觉也。 以此之故方知般若波罗蜜多是四咒也。 摩诃是大神咒，谓四大坚固身，神通莫测也。 般若是大明咒，谓智慧圆通，精进明妙也。 波罗是无上咒，谓合和本来，是最上一乘也。 蜜多是无等等咒。 谓圆满极则，无上可上也。 了此四咒者，然后能除一切苦，是真实不虚妄也。 故世尊说此般若波罗蜜多咒，即是解说前四句咒之义也。 故曰：揭谛谓人空也，又揭谛，谓法空也。 波罗揭谛，到彼岸心法俱空也。 波罗僧揭谛，到岸不须船也。 此四揭谛神咒，即身中四大也。 四大俱空，真常独露，故曰菩提萨婆诃。 菩提为始也，萨婆诃谓终也。 始终如一，则抱本还虚，超返佛祖。 虽然如是，传济庵者，要在竖起脊急着眼力，莫教蹉过，诚能於日用常行中，筑着磕着，认得自家底，方信此经不从外得。 不惟此卷《心经》，至於释老一大藏教典，诸子百家，只消一喝，彻头彻尾都竟。 其或未然，参○只此便是。 休更疑惑。 引儒释之理证道，使学者知三教本一，不生二见。 阴符经〔直指〕 阴符经，阴阳符合之机，众所通行之义。 观天之道，天垂象，示吉凶，圣人则之。 执天之行，尽矣。 天地变化，圣人效之。 天有五贼，五炁生万物，五炁盗万物。 见之者昌。 照见五蕴皆空，度一切苦厄。 五贼在心，盗机在内。 施行於天。 天理弗违。",
      "translated_text": "Without the eye realm, how could there be sense objects or consciousness? Thus it is said: even unto the absence of the mind-consciousness realm. The mind-consciousness realm encompasses the prior eighteen realms. Without this mind-consciousness, there is no ignorance, nor is there the exhaustion of ignorance. What is meant by \"no exhaustion of ignorance\" is merely that ignorance does not arise. If ignorance were utterly extinguished, one would fall into dead emptiness. The *Dan Shu* says: \"Quelling thoughts is the nurturing of the fire\"—this is what it means.\n\nIgnorance is the root of birth and death. The *Dan Shu* says: \"Where thoughts arise is the Mysterious Female; the gate of the Mysterious Female is called the root of heaven and earth.\" Is this not the root of birth and death? Therefore, without ignorance, there is neither old age and death, nor the exhaustion of old age and death; no suffering, origination, cessation, or path; no wisdom, nor delusion; no attainment. With nothing to attain, there is nothing to lose.\n\nThus all dharma of the mind is empty. To realize the dharma of the mind is called *bodhi*; to realize the emptiness of dharmas is called *sattva*. Beginners rely on *prajñāpāramitā*, and so their minds are without obstruction. This is called moving from existence into non-existence, from the coarse to the subtle, awakening great wisdom to shatter delusion, ever-pure and harmonious with the original nature. At the ultimate perfection, the mind is one with the great void, vast and unobstructed.\n\nWith no attachments, there is no fear, and one is far removed from inverted dreams and illusions. The dreaming mind is the work of confusion. Without confusion, the *Dharmakāya* is pure, and thus one can attain ultimate *nirvāṇa*. All buddhas of the three times and ancestral masters of past generations relied on *prajñāpāramitā* to attain *Anuttarā Samyaksaṃbodhi*. Later true learners of the Buddha follow this path, awakening the six wisdoms to purify and harmonize with the original nature, thereby realizing the supreme, perfect enlightenment.\n\nFor this reason, *prajñāpāramitā* is the fourfold mantra. *Mahā* is the great divine mantra, referring to the indestructible four great elements of the body, whose spiritual powers are unfathomable. *Prajñā* is the great luminous mantra, referring to the all-pervading wisdom that is diligent, bright, and wondrous. *Pāramitā* is the unsurpassed mantra, referring to harmony with the original nature, the supreme vehicle. *Mita* is the unequaled mantra, referring to the ultimate perfection, beyond which there is nothing higher.\n\nOne who realizes these four mantras can then eliminate all suffering—this is true and not false. Thus the World-Honored One expounded this *prajñāpāramitā* mantra, which is the explanation of the meaning of the preceding four-line mantra. Thus it is said: *Gate* refers to the emptiness of persons; *gate* again refers to the emptiness of dharmas; *pāragate* refers to the emptiness of all mind-dharmas upon reaching the other shore; *pārasaṃgate* refers to reaching the shore without needing a boat. These four *gate* mantras correspond to the four great elements within the body. When the four great elements are all empty, the true and constant alone is revealed—thus it is said: *bodhi svāhā*. *Bodhi* is the beginning; *svāhā* is the end. When beginning and end are one, one embraces the original and returns to the void, surpassing buddhas and ancestors.\n\nThough it be thus, those who transmit and receive this teaching must straighten their spines and focus their gaze, lest they miss the mark. If one can, in the midst of daily activities, stumble upon and recognize one’s own nature, one will realize that this sūtra is not obtained from without. Not only this *Heart Sūtra*, but all the vast teachings of Buddhism and Daoism, and the hundred schools of thought—one need only a single shout to penetrate them from beginning to end. If this is not yet so, then investigate this single point. Do not doubt further.\n\nDrawing on the principles of Confucianism and Buddhism to illuminate the Dao, the learner will understand that the three teachings are fundamentally one, without dualistic views.\n\nThe *Yin Fu Jing* [*Direct Pointer to the Yin Fu Jing*]:\nThe *Yin Fu Jing* concerns the mechanism of yin-yang harmony, a principle universally practiced. Observing the Dao of heaven, heaven displays signs to indicate fortune and misfortune, which the sage emulates. Mastering the movements of heaven is perfection. The transformations of heaven and earth are mirrored by the sage. Heaven has five thieves: the five *qi* give birth to the myriad things, and the five *qi* steal from the myriad things. Those who see this prosper. Seeing the five aggregates as empty, one transcends all suffering and distress. The five thieves reside in the mind; the mechanism of theft is within. When applied to heaven, the heavenly principle is not violated.",
      "overlap_context": ", smell, taste, touch, or dharmas. This is called the empty nature, originally without the five aggregates or the six consciousnesses—how could there be the six sense objects? Consciousness arises from the eye realm; where there is the eye realm, there are the five aggregates; where there are the five aggregates, there are the six sense faculties; where there are the six sense faculties, there are the six consciousnesses; where there are the six consciousnesses, there are the six sense objects.\"",
      "start_char": 2515,
      "end_char": 3417,
      "start_sentence": 181,
      "end_sentence": 232,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.013588666915894,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\三天易髓.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "宇宙在乎手，执天之行。 万化生乎身。 天地即我。 天性人也，天付之与人者，性也。 人心机也。 人发其机者，心也。 立天之道，以定人也。 立天垂统，设教化人。 天发杀机，天机发泄本无心，故杀中有生意者存。 龙蛇起陆，龙蛇之垫，至静无欲，故能应机顺时而起。 人发杀机，人心发泄本由心，故能隐而显。 天地反覆。 神机妙用，故反覆莫测。 天人合发，人机合天机。 万变定基。 以心立基，万变俱定。 性有巧拙，物之不齐，可以伏藏。 巧拙不分。 九窍之邪，一窍不定，九窍俱邪。 在乎三要。 身心意定，九窍俱通。 火生於木，犹五贼在心，祸发必克。 心为五贼害。 奸生於国，万化生身，时动必溃。 身为万化机。 知之修炼，善御冠者，谨火防奸。 谓之圣人。 富国安民，是谓圣人。 天生天杀，鼓万物不与圣人同忧，道之理也。 生生化化，道之常理。 天地，万物之盗； 天生万物，亦杀万物。 万物，人之盗； 万物养人，亦能盗人。 人，万物之盗。 人成万物，亦盗万物。 三盗既宜，人能转物，三盗俱化。 三才既安。 人循天理，三才俱安。 故曰：食其时，百骸理； 饮食有节，百骸俱理。 动其机，万化安。 动静应机，万化俱安。 人知其神而神，认贼为子，不知不神之所以神。 即非法相，是名法相，日月有数，日月亏盈，因有定数。 大小有定。 大小不齐，自有定体。 圣功生焉，大小不分，圣功生。 神明出焉。 日月合德，神明着矣。 其盗，机也。 不离方寸。 天下莫不见，物物全彰，莫能知，对面不相识。 君子得之固躬、君子时中。 小人得之轻命。 小人无忌惮。 瞽者善听，声色专於耳。 聋者善视，绛色专於目，绝利一源，绛色潜於心。 用师十倍。 心专於一，克功十倍。",
      "translated_text": "The cosmos lies within the hand, grasping the movements of heaven. The myriad transformations arise within the body. Heaven and earth are none other than myself. Heavenly nature is human nature; what heaven bestows upon humanity is *xing* (nature). The human heart is the mechanism. What sets this mechanism in motion is the heart.\n\nEstablish the Dao of heaven to stabilize humanity. Heaven establishes its lineage and institutes teachings to transform people. When heaven unleashes its killing mechanism, the heavenly mechanism, though inherently without intent, reveals that within killing lies the intent for life. Dragons and serpents rise from the land; their coils, being utterly still and desireless, enable them to respond to opportunity and arise in accord with the times. When humans unleash their killing mechanism, the human heart, though originally without intent, can conceal and yet manifest.\n\nHeaven and earth reverse themselves. The divine mechanism operates wondrously, thus their reversals are unfathomable. When heaven and humanity act in unison, the human mechanism aligns with the heavenly mechanism. The foundation of myriad changes is established. By establishing the foundation in the heart, all changes are stabilized.\n\nNature may be skillful or clumsy; things are not uniform and thus can be concealed. Skill and clumsiness are indistinguishable. The nine orifices are perverse; if one orifice is unsettled, all nine become perverse. It lies in the three essentials. When body, heart, and intent are settled, all nine orifices are unobstructed.\n\nFire is born from wood, just as the five thieves reside in the heart—when misfortune arises, it must overcome. The heart is harmed by the five thieves. Treachery arises within the state; the myriad transformations arise within the body—when the time moves, it must collapse. The body is the mechanism of myriad transformations.\n\nThose who know this and cultivate refinement, skillfully governing the crown, carefully guard against fire and prevent treachery—these are called sages. Enriching the state and pacifying the people—this is what defines a sage.\n\nHeaven gives life, heaven brings death; it animates the myriad things without sharing the sage’s concerns—this is the principle of the Dao. Generation and transformation are the constant principles of the Dao.\n\nHeaven and earth are the thieves of the myriad things; heaven gives life to the myriad things and also kills them. The myriad things are the thieves of humanity; they nourish humanity and yet can also steal from them. Humanity is the thief of the myriad things; humans complete the myriad things and yet steal from them.\n\nWhen the three thieves are fitting, humans can transform things, and the three thieves are all transmuted. When the three powers are at peace, humans follow the heavenly principle, and the three powers are all at peace.\n\nThus it is said: Eat in season, and the hundred bones are ordered. With regulated eating and drinking, the hundred bones are all in harmony. Move in accord with the mechanism, and the myriad transformations are at peace. In movement and stillness, responding to opportunity, the myriad transformations are all at peace.\n\nHumans know the divine as divine, mistaking the thief for their child, unaware of the divine nature of the non-divine. This is not the mark of dharmas; this is called the mark of dharmas. The sun and moon have their cycles; their waxing and waning follow fixed patterns. Great and small have their determinations. Though great and small differ, each has its fixed form.\n\nSagehood arises therein; when great and small are undifferentiated, sagehood arises. Spirit and illumination emerge. When the sun and moon unite their virtues, spirit and illumination manifest.\n\nThe thief is the mechanism. It does not depart from the square inch. All under heaven see it—every thing is fully revealed—yet none know it, and even when face-to-face, they do not recognize it.\n\nThe noble person who attains it embodies it in their conduct; the noble person acts in accord with the times. The petty person who attains it treats life lightly; the petty person is without restraint.\n\nThe blind excel in hearing; sound and form are concentrated in the ear. The deaf excel in seeing; crimson hues are concentrated in the eye. Cutting off one source of desire, crimson hues lie hidden in the heart. Employing the teacher yields tenfold results. When the heart is concentrated on one, achievement is tenfold.",
      "overlap_context": "ich the sage emulates. Mastering the movements of heaven is perfection. The transformations of heaven and earth are mirrored by the sage. Heaven has five thieves: the five *qi* give birth to the myriad things, and the five *qi* steal from the myriad things. Those who see this prosper. Seeing the five aggregates as empty, one transcends all suffering and distress. The five thieves reside in the mind; the mechanism of theft is within. When applied to heaven, the heavenly principle is not violated.",
      "start_char": 3417,
      "end_char": 4064,
      "start_sentence": 233,
      "end_sentence": 292,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.052584648132324,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\三天易髓.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "三反昼夜，反视反听，反身而诚。 用师万倍。 旦夕不忘，克功万倍。 心生於物，心生种种法生。 死於物。 心灭种种法灭。 机在目。 无眼界、乃至无意识界。 天之无恩，天发杀机，而大恩生。 万物遂其生。 迅雷烈风，荐雷震，君子以恐惧修省。 莫不蠢然。 恐致福也。 至乐性余，常乐我静，至静则廉。 极於静，俭於动。 天之至私，有生有杀。 用之至公。 无党无偏。 禽之制在气。 禽盗之制，在乎御气。 生者死之根，气盛则神冥。 死者生之根。 气泯则神活。 恩生於害，停日长智，害生於恩。 擒盗获功。 愚人以天地之文理圣，愚者不能循天理，文理以为圣。 我以时物文理哲。 达者以天地备乎身，故以时物文理以为哲。 ○观天之道，执天之行尽矣。 三天易髓竟",
      "translated_text": "Reversing by day and night, one turns inward to see and listen, returning to the body to achieve sincerity. Employing the teacher yields ten-thousandfold results. Morning and evening, never forgetting—achievement is ten-thousandfold.\n\nThe heart arises from things, and with the heart arise all dharmas. It dies through things. When the heart perishes, all dharmas perish.\n\nThe mechanism lies in the eye. Without the eye-realm, even to the absence of the mind-consciousness realm.\n\nHeaven’s lack of favor is Heaven’s release of the killing mechanism, yet great favor arises. All things fulfill their lives.\n\nSwift thunder and fierce winds, repeated thunderclaps— the noble person cultivates and reflects in fear and trembling. None are not stirred into motion. Fear brings forth blessing.\n\nSupreme joy abounds in nature; constant joy lies in my stillness. In utmost stillness, there is integrity. In extreme stillness, frugality in movement.\n\nHeaven’s utmost partiality is to give life and take life. Employed with utmost impartiality, it is without faction or bias.\n\nThe regulation of birds lies in qi. The regulation of bird-thieves lies in governing qi.\n\nLife is the root of death; when qi flourishes, spirit darkens. Death is the root of life; when qi dissipates, spirit quickens.\n\nFavor arises from harm; halting the sun lengthens wisdom. Harm arises from favor. Capturing the thief secures achievement.\n\nThe foolish deem the patterns of heaven and earth sagely; the ignorant cannot follow heaven’s principle, yet take patterns as sagacity. I find wisdom in the patterns of seasonal things. The enlightened, possessing heaven and earth within themselves, thus find wisdom in the patterns of seasonal things.\n\n○ Observing heaven’s Dao, grasping heaven’s actions—this is perfection. The three heavens complete the marrow’s transformation.",
      "overlap_context": "tains it embodies it in their conduct; the noble person acts in accord with the times. The petty person who attains it treats life lightly; the petty person is without restraint.\n\nThe blind excel in hearing; sound and form are concentrated in the ear. The deaf excel in seeing; crimson hues are concentrated in the eye. Cutting off one source of desire, crimson hues lie hidden in the heart. Employing the teacher yields tenfold results. When the heart is concentrated on one, achievement is tenfold.",
      "start_char": 4064,
      "end_char": 4356,
      "start_sentence": 293,
      "end_sentence": 322,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.518700361251831,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\三天易髓.txt",
        "category": "方法类"
      }
    }
  ]
}