{
  "source_id": "三洞神符记",
  "source_file": "chunked_daozang\\三洞神符记.json",
  "total_chunks": 5,
  "total_original_chars": 6102,
  "total_translated_chars": 39799,
  "total_translation_time": 196.28162455558777,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\神符类\\三洞神符记.txt",
    "category": "神符类"
  },
  "full_translation": "**Record of the Three Caverns’ Divine Talismans**\n\n**Title:** *Record of the Three Caverns’ Divine Talismans*. Author unknown, likely composed during the Tang dynasty. Originally a chapter in the *Great Treatise of the Daoist Gate*, later extracted as an independent text. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, Cavern of Perfection Division, Category of Divine Talismans. See also *Seven Lots from the Cloudy Satchel*, Scroll 7.\n\n**Record of the Three Caverns’ Divine Talismans: On the Methods of the Three Origins, Eight Convergences, and Six Scripts**\n\nThe *Great Treatise of the Daoist Gate* states: At the primordial division of yin and yang, there arose the qi of the Three Origins, Five Powers, and Eight Convergences, forming the *Flying Script of the Heavens*. Later, these were compiled into the *Luminous Chapters of the Eight Dragons’ Cloud Seal*.\n\nMaster Lu explained the Three Capacities as the Three Origins. Once the Three Origins were established, the Five Phases were complete. Taking the Five Phases as five positions, the harmonization of three and five was called the Eight Convergences, serving as the foundation of all scripts. There were also the *Luminous Chapters of the Eight Dragons’ Cloud Seal*, wherein the natural, soaring, mysterious qi coalesced in the void to form writing. Each character spanned a zhang in size, originating within the various heavens to give rise to all things.\n\nAccording to the *True Reports* as recounted by Lady Ziwei of the Purple Tenuity, the *Script of the Three Origins and Eight Convergences* is the progenitor of all literary compositions. The *Eight Dragons’ Cloud Seal* is the root and origin of all writing. It is also said: The Eight Convergences correspond to the Three Capacities and Five Phases, taking form after the separation of existence. Another text states: The *Five Chapters of the Vermilion Script of Numinous Treasure* emerged prior to the Primordial Beginning. Thus, the Three Origins cannot refer to the Three Capacities, nor can the Five Powers refer to the Five Phases. These must instead be the Three Qi of the Venerable Lord of the Three Treasures. These Three Qi are not the Five Powers. Therefore, the *Verses on the Generation of the Nine Heavens* states: \"The myriad transformations of heaven and earth, if not nurtured by the Three Origins and guided by the Nine Qi, cannot come into being.\" It further says: \"The Three Qi are the honor of heaven and earth; the Nine Qi are the root of the myriad things.\" Thus, these Three Origins existed before the opening of heaven and earth and the birth of the Three Capacities.\n\nMaster Song explained the Eight Convergences as merely the Three Qi and Five Powers. The Three Origins are: first, the qi of the *Chaotic Cavern of the Supreme Jade Emperor of Primordial Vacuity*; second, the qi of the *Vermilion Chaos of the Supreme Jade Purity of Primordial Vacuity*; third, the qi of the *Mysterious Tranquility of the Supreme Jade Void of Primordial Vacuity*. The Five Powers are the convergence of three and five within the Three Origins, namely the harmony of yin and yang. Yin comprises Lesser Yin and Greater Yin; yang comprises Lesser Yang and Greater Yang. The harmony within harmony constitutes the Five Powers.\n\n*Seal* (篆) means *to compile* (撰), referring to the compilation of cloud scripts, hence the term *cloud seal*. This encompasses the texts of the Three Origins and Eight Convergences, as well as the *Chapters of the Eight Dragons’ Cloud Seal*. All are celestial scripts, exemplified by the Three Origins and Eight Convergences. The *Cloud Seal of Luminous Radiance* corresponds to the examples of the Five Talismans and Five Victories.\n\nThe original text of the Eight Convergences comprises 1,109 characters. The true script of its chapters totals 668 characters. These are the primordial roots of the Three Capacities, giving rise to heaven and earth, unfolding the transformations of humans and spirits, and serving as the origin of the myriad things. Hence, it is said there are the Dao of Heaven, the Dao of Earth, the Dao of Spirits, and the Dao of Humans—this is what is meant.\n\nThe *Jade Instructions* states: In practicing this method, the Five Chapters are divided by character count, each with four applications:\n1. To summon the Nine Heavens’ Celestial Thearchs, verify the registers of divine immortals, and seek transcendence to attain perfection.\n2. To summon the celestial lodges and stellar palaces, rectify the divisions of heaven, and safeguard the state and pacify the people.\n3. To restrain and control the qi of the Six Heavens of Fengdu.\n4. To command the Water Thearch and summon dragons and birds.\n\nRegarding the inner sounds of the various heavens: each heaven has eight characters, and the thirty-two heavens together comprise 256 characters. These expound upon the measurements and conjunctions of the heavens, the names and titles of great sages and true immortals, the offices they govern, the locations of their terrace-cities, the transformations and ascents of immortals, the ranks of their descents, the classifications of demons, and the karmic causes of human and ghostly rebirths. Thirteen characters denote the names of the primordial essences of the Five Directions, used in methods for ingesting and refining, cultivating the spirit and transforming the form, and ascending in broad daylight. The remaining 122 characters lack explanations of their primordial sounds.\n\nSecond, the Eight Convergences are developed into the scripts of dragons and phoenixes, called *Dragon Script*. All that follows was transmitted by the mysterious sages to transcribe celestial writing.\n\nThird, during the time of the Yellow Thearch, Cang Jie, observing the forms of dragons and phoenixes and gathering the traces of birds, created ancient script to replace knotted cords—this is the ancient form.\n\nFourth, during the Zhou dynasty, Shi Zhou transformed ancient script into *Greater Seal Script*.\n\nFifth, during the Qin dynasty, Cheng Miao altered *Greater Seal Script* into *Lesser Seal Script*.\n\nSixth, after the Qin, Xu Yang of Xuyang transformed *Lesser Seal Script* into *Clerical Script*. It is also said that the Han referred to clerical script as *Assistant Script*. Some claim Cheng Miao created it while imprisoned, deriving it from the writing of convict laborers, hence the name *clerical*. These constitute the Six Scripts.\n\n**Cloud Seal**\nThere are also the *Luminous Chapters of the Cloud Seal*, which follow the forms of Sanskrit script. The texts are divided into sixty-four types, disseminated across the thirty-six heavens. In contemporary scriptural transmission, celestial writing is explained using clerical characters, intermingled in practice.\n\n**Eight Forms, Six Scripts, Six Writings**\n1. Greater Seal Script\n2. Lesser Seal Script\n3. Talisman-Carving Script\n4. Worm Script\n5. Seal-Engraving Script\n6. Title Script\n7. Weapon Script\n8. Clerical Script\n\nDuring the reign of Wang Mang, the Minister of Education, Zhen Feng, was tasked with standardizing writing, resulting in the Six Writings:\n1. Ancient Script (the script from Confucius’ wall)\n2. Variant Characters (ancient script with unusual forms)\n3. Seal Script\n4. Assistant Script (clerical script)\n5. Curling Seal Script (used for engraving seals)\n6. Bird Seal Script (transliteration)\n\nCang Jie’s initial writing must have employed brushes. The *Book of Songs* mentions \"vermilion tubes,\" which were brushes. The claim that Meng Tian invented the brush likely stems from his prominence as a Qin general across three generations, whose refined brush-making technique earned him sole renown.\n\nDuring the reign of Emperor He of Han, Cai Lun first created paper. Before this, only bamboo slips and wooden tablets were used for writing. *Die* (tablets) served to record matters in detail, while *jian* (slips) were concise and uncluttered. Yet it was known that the original script was the Celestial Script of the Golden Slips; all other scripts—from earthly writings downward, the Eight Styles and Six Writings—derived externally from the true form, which scholars may further investigate.\n\nIt remains unknown when texts were first transcribed onto paper to form scrolls. Now, it is said that brushes existed from the beginning of the kalpa, and the Supreme Perfection (Tai Zhen) inscribed them—how could they be absent? And what of the Eight Styles and Six Writings? For the Celestial Venerable (Tian Zun) embodies creation, encompassing all methods.\n\nLater generations inherited and employed these, naturally developing them in sequence. The Six Writings are as follows:\n1. **Pictographic**—such as the sun and moon;\n2. **Indicative**—such as \"above\" and \"below\";\n3. **Phono-semantic**—such as rivers and seas;\n4. **Associative**—such as \"martial\" (武) and \"trust\" (信);\n5. **Mutually explanatory**—such as \"elder\" (考) and \"aged\" (老);\n6. **Phonetic loan**—such as \"command\" (令) and \"chief\" (长).\n\n**Talismanic Script**\nAll myriad things operate through the essence of *qi*. Thus, the Two Modes (yin and yang) and Three Luminaries (sun, moon, stars) all function through the *qi* within them. Once the myriad things exist, they too operate through the *qi* within them. Therefore, the Five Phases and Six Entities all possess *qi*.\n\nBy spreading the refined *qi* of the Dao onto bamboo slips and ink, and uniting it with the *qi* of things, one repels deceit and falsehood, aids the true and authentic, summons and assembles the host of spirits, governs life and death, sustains the kalpic order, and stabilizes the Five Directions.\n\nThese talismans originate from the structuring of emptiness. The Supreme Perfection (Tai Zhen) transcribed the celestial patterns by gazing upward, arranging them according to directional positions and distinguishing the differences among talismanic diagrams, script, and charts.\n\n- **Talismans** (*fu*) draw upon the configurations of clouds, phenomena, and celestial bodies;\n- **Script** (*shu*) distinguishes and analyzes sounds, phrases, and their measured meanings;\n- **Charts** (*tu*) depict the forms of numinous transformations.\n\nYet talismans contain script, blending with the semblance of diagrams, while script contains charts, employing both form and sound. Thus, the Eight Styles and Six Writings mutually elucidate one another.\n\n**The Eight Manifestations**\nThe Eight Manifestations are:\n1. **Celestial Script**—the Eightfold Convergence;\n2. **Divine Script**—Cloud Seal Script;\n3. **Earthly Script**—the forms of dragons and phoenixes;\n4. **Inner Script**—what tortoises, dragons, fish, and birds disgorge;\n5. **Outer Script**—borne by scales, shells, feathers, and fur;\n6. **Demonic Script**—miscellaneous, obscure forms incomprehensible to humans;\n7. **Central States Script**—grass script and Cloud Seal Script;\n8. **Barbarian Script**—resembling the tracks of insects and worms.\n\nAmong these Six Writings and Eight Styles, some modern characters resemble ancient ones, or ancient characters resemble modern ones. Talismanic colors intermingle, collectively forming a single method and serving a unified purpose—thus, their similarities and differences are not fixed.\n\nThis follows the explanation of Master Song, though the original text has not been seen. In the Three Caverns scriptures, talismans with characters resemble the ancient characters in the *Book of Documents*, some of which remain identical to those of today.\n\n**Jade-Character Formula**\nThe Supreme Dao Lord (Tai Shang Dao Jun) at the Southern Cinnabar Cavern of Yang’s Summit bestowed this numinous script and Jade-Character Formula upon the scholar Wang Long. It remains uncertain to which era the commentary belongs; scholars may investigate it further.\n\nIt also expounds methods for talismanic rites, offerings to the Five Directions, visualization, and disaster aversion—precisely the interpretive formulas for the Eightfold Convergence. Within the original text’s principles, it further clarifies the logic, much like elucidating the principles of resonance within the true script.\n\nThe *Scripture on Stabilizing the Will* asks: Does this emerge from the subtleties of thought? Matters contain further matters, as in the *Jade Formula*, which further clarifies the transmission of scriptures and the solemn rituals of covenant bestowal. Thus, all scriptures containing interpretive formulas are collectively called *Jade Formulas*.\n\n**August Script of the Thearchs**\nThe *Scripture of the Three August Ones* states: The August Script of the Thearchs arises naturally from emptiness and non-being, forming characters from *qi* congealed in the void. Without origin or precedence, without end or limit, it appears and vanishes with the kalpic cycles yet endures eternally.\n\n**Celestial Script**\nThe *Scripture of the Inner Sounds of the Heavens* states: Suddenly, a celestial script appeared, its characters a *zhang* square, naturally manifesting in the void. Its text shimmered with radiant colors, its eight corners trailing beams of light, its luminous brilliance dazzling the eyes, rendering it unreadable.\n\nThe Celestial Perfected Sovereign (Tian Zhen Huang Ren) said: This script is august and wondrous, beyond ordinary comparison. Thus, it inaugurated the beginning of the Great Existence and sealed the celestial radiance to treasure the Dao and honor its script. Its characters are profound and recondite, unlike the forms of common writing—it esteems its wondrous imagery and conceals its ultimate truth.\n\n**Dragon Script**\nThe *Scripture of Numinous Treasure* states: When the Vermilion Clarity unfolded the celestial chart, the workings of destiny proceeded naturally. The Primordial Beginning (Yuan Shi) stabilized and settled it, scattering the Five Chapters. The Vermilion Script of Jade Characters and the Eightfold Might of Dragon Script safeguard the kalpic order, ensuring the heavens endure eternally. This is the Dragon Script.\n\n**Phoenix Script**\nThe *Scripture of the Vermilion Phoenix* states: This scripture’s original text was stored within the Purple Chamber of the Six Harmonies of the Supreme Lord (Tai Shang), guarded by six-headed lion-like beasts flanking the walls, with jade lads and jade maidens attending the Phoenix Script.\n\n**Jade Tablets and Golden Script**\nThe Three Primes distribute the scriptures, all inscribed as Golden Cinnabar Scripts, contained in bags of natural cloud brocade, sealed with the talismanic seals of the Three Primes, and stored in the Palace of Great Existence above the Nine Heavens—these are called Jade Tablets and Golden Script.\n\nIt is also said: They are inscribed on purple jade slips, with characters of raw gold, bound with golden threads and wrapped in azure silk.\n\nThe *Canons of the Supreme Perfection* state: Jade Tablets and Golden Script are inscribed on slips of the Seven Treasures, also called Purple Slips.\n\n**Stone Characters**\nThe *Scripture of Fundamental Practices* states: The Dao said: In the past, in the world of Chan Li, there was a King of the Realm of Dust who had a daughter named Gua Yin. Though born mute, by the age of fourteen, her parents found this strange and abandoned her in the empty mountains south of the Southern Floating Mulberry. Wandering the mountains, she suddenly encountered a divine person at the Cypress Grove beneath the Cinnabar Mound’s abode. The divine being took Gua Yin’s right hand and inscribed upon a red stone, saying to Gua Yin: Though you cannot speak, you may remember this.\n\nHeaven, moved by her plight, took pity on her affliction and dispatched the Vermilion Palace’s Divine Youth to teach Gua Yin the arts of bodily preservation, bestowing upon her the Eight-Character Red Script. Thereupon, Gua Yin could speak.\n\nThe *Scripture of the Jade Essentials of the Numinous Treasure* states: The Dao addressed A Qiu Zeng, saying: In your past life, you and the Southern Culmen’s Venerable Deity dwelled together in the world of Chan Li. Beneath the Cypress Grove at the Cinnabar Mound’s abode, you both resolved to pursue the Dao. At that time, the Southern Culmen was surnamed Huang and named Du Ming. He took your right hand, and together you inscribed the red stone to record your names. The Southern Palace later transcribed your brushstrokes onto the Southern Pavilion, where they remain to this day. The stone characters also endure—do you recall them? Qiu Zeng’s heart awakened, and lifting his gaze, he beheld what the Southern Culmen had presided over: on the southern wall, carved script read: *In the Tai Jia year, on the first day of the seventh month, Huang Du Ming and Wang A Qiu Zeng together made their vow beneath the Cypress Grove of the Cinnabar Mound*—twenty-three characters in all, each perfectly distinct.\n\n**Inscribed on Plain Silk**\nThe *Scripture of the Five Talismans* states: When the Five Talismans are transmitted as one, they are inscribed on *nanhe* silk—*nanhe* being red silk. They are sealed in a casket of golden blossoms, stamped with the seal of the Dark Capital, and entrusted to the Lord of the Shocking Waters Grotto’s Mystery.\n\nThe *Scripture of the Questions of the Immortal Duke* states: The *Scriptures of the Dao and Its Virtue (Upper and Lower)*, the *Mysterious Scripture of the Cavern of Perfection*, the *Celestial Writings of the Three Sovereigns*, and the various odes of the Highest Clarity—all were composed by the Most High and inscribed on *nanhe* silk, hence called *inscribed on plain silk*.\n\n**Jade Characters**\nThe *Scripture of the Inner Sounds and Jade Characters* states: The Heavenly Perfected Sovereign said: The inner sounds of the heavens are naturally jade characters, each a *zhang* in breadth, spontaneously manifesting in the Void Mystery above. Their eight corners radiate beams, their luminous essence dazzling the eyes. The numinous script of the Eight Assemblies bears no fixed form; its purport is profound and recondite, difficult to fathom in detail. All are the great Brahmanic hidden language of the heavens, congealed from the soaring mystery of *qi*, harmonizing the sounds of the five directions. They arose above the Primordial Beginning and emerged from the Cavernous Void, unfolding with the turning of the kalpas to universally accomplish the work of heaven and earth. The Heavenly Worthy commanded the Heavenly Perfected Sovereign to annotate their correct sounds, that the sovereign’s Dao might flow clearly and its blessings extend to the ten directions. The Sovereign dared not disobey, and taking up his brush, annotated them, saying: Though my spirit and soul may suddenly perish, I shall record what I have witnessed, briefly annotating the meaning of the Five Harmonies. This Dao suffices to open the path and deliver heaven and humanity. Harmonizing the five directions and the boundless sounds, it perfects the inner sounds of the heavens—hence the meaning of the Five Harmonies.\n\n**Script Born in the East**\nThe *Scripture of Great Peace* states: Script is born in the East and flourishes in the South. Thus, celestial script arises in the northeast, and writings emerge from the northeast, where heaven reveals its patterns. The tiger bears markings and dwells in the *yin* (third earthly branch). The dragon bears markings and dwells in the *chen* (fifth earthly branch). Script is born in the East and thrives in the South—thus true script first appears in the northeast.\n\n**Jade Register**\nThe *Hidden Writings of Jade Clarity* contain the Emperor’s Slips of Gold Script and the Mysterious Jade Registers, which may transmit the *Feathered Jade Scripture of the Cavern of Mystery*. It further states: Without the Emperor’s Chart and Jade Register, one may not hear or behold the Hidden Writings of the Jade Wisdom of the Highest Sovereign, the Jade Clarity, or the Feathered Scriptures of the Golden Mystery and Hidden Mystery.\n\n**Jade Chapters**\nThe *Preface to the Many Chapters* states: The Primordial Beginning commanded the Great Perfected to take up the brush, while the Jade Consort swept the mat. Gold was cast into slips, and the Jade Chapters were inscribed. The Five Elders recorded them, secreting them in the Palace of the Nine Numinous Immortals, where they were stored in cloud-woven caskets and transmitted to the Immortal Duke Ge.\n\n**Jade Tablets**\nThe *Scripture of the Golden Root* states: The Most High Lord of the Great Dao entrusted the *True Scripture of the Great Cavern* to the High Minister, the Azure Youth, who recorded it in the Azure Palace of the Eastern Flowery Capital to transmit to later sages destined to become Perfected Ones. These golden slips and jade tablets emerged from the Palace of the Numinous Capital of the Most High, carved from jade.\n\n**Cinnabar Script and Ink Registers**\nThe *Canons of the Supreme Perfection* state: Cinnabar slips are vermilion-lacquered slips, signifying fire as the master of yang. Ink registers are script written in ink, signifying water as the master of yin. Those who study longevity and adhere to them shall not die. Thus, they are called *cinnabar slips and ink registers*, and are transmitted only in secret.\n\n**Jade Tallies**\nThe Heavenly Sovereign wields the Flying Immortal’s Jade Tally; the Human Sovereign wields the Jade Tally of the Highest Sovereign’s Preservation of Life; the Earthly Sovereign wields the Jade Tally of the Primordial Sovereign’s Determination of Records.\n\n**The Book of Blessed Continuity**\nThe *Scripture of the Thirty-Nine Chapters* states: The Most High possesses the Gate of Jade Feathers, which coalesce to form an embryo. It is named Wang Xuan, the honored one of the three *qi*. The Primordial Elder is the guest of the Celestial Thearch, together supporting the myriad bodies. The Terrace of Spirits carves their names upon the slips of Blessed Continuity. It further states: The Most High’s golden slips and jade tablets are the Book of Blessed Continuity.\n\n**Jade and Coral Script**\nThe *Feathered Scripture of Flight* states: Gold script and jade registers are the Jade and Coral Script.\n\n**White Silver’s Compilation**\nThe *Scripture of the Golden Chamber’s Life-Prolonging Arts* states: In the Palace of the Numinous Capital of the Great Constant, there are the arts of the Golden Chamber for prolonging life and reversing the years. All are cast in gold slips, inscribed on white silver’s compilation, and written in purple ink.\n\n**Red Script**\nThe *Scripture of the Jade Essentials* states: The Primordial Beginning’s Red Script of the Five Chapters of True Writ is placed with the Five Thearchs, guided by yin and yang. It turns the pivot of the Nine Heavens and revolves the radiance of the Five Stars.\n\n**Fire-Refined True Script**\nThe *Scripture of Fundamental Forms* states: In the first year of the Red Brightness, I and the Highest Great Sage, the Jade Thearch, refined this true script in this land, using fire to illuminate and reveal its characters. At that time, the true script’s fire overflowed, and *qi* arose elsewhere, transforming into a forest of the Seven Treasures. Thus, its branches and leaves became purple script on a golden ground with silver engravings and jade characters. Within it were all manner of dragons, birds, fierce beasts, and divine insects. Constantly feeding on the forest’s dew and absorbing the true *qi* into their bodies, their lives were prolonged. After thirty million kalpas, when their terms ended, they all transformed into flying immortals, ceaselessly following the Dao, thereby attaining the true and effortless Dao.\n\n**Characters of the Golden Flask’s Ink**\n\n**The *Shengji* states:** In the kingdom of Futi, two scribes of virtuous script were presented, now old, now young. When they concealed their forms, shadows appeared; when their voices were heard, their forms vanished. At times, they produced a four-inch golden flask, sealed with a lock of five dragons and bound with green clay. Within the flask was ink as thick as lacquer, which, when sprinkled upon wood or stone, transformed into characters of seal script, clerical script, and tadpole script, recording the origins of creation and human relations.\n\nThe Venerable Lord composed Daoist scriptures totaling one hundred thousand words, all transcribed onto jade tablets, bound with golden cords, and stored in jade cases. When the ink in the golden flask was exhausted, the two from Futi wished to cut open their hearts and drip their blood to replace the ink.\n\n**The *Jade Clarity Hidden Book of the Golden Tiger Talisman* states:** The crimson script of Yu Yi summons the sun to share its chariot; the yellow chapters of Jie Lin dwell with the moon.\n\n**The *Upper Clarity Scripture for Dispelling Demons* states:** Open the cavern gate in the Grove of Rarities, seek the numinous traces in the Cinnabar Grotto. Unseal the vermilion coffer of the Primordial Heaven, gaze upon the jade tablets of the Upper Clarity. The mysterious script is already engraved on jade tablets, and the crimson names are first inscribed at the Numinous Portal. Four encounters with the Three Origins in the Mysterious Palace, six visitations to the Five Elders in the Numinous Chamber.\n\n**The *Eight Simplicities Scripture* states:** The Eight Simplicities True Scripture’s mysterious script arises within the Great Void, appearing on the Western Tortoise Mountain, above the Dark Garden, and beneath the Shaded Face of the Accumulated Stones.\n\n**The *Eight Simplicities Lofty Mystery Feathered Chapters* states:** The numinous script is dense upon the Cavern’s summit; the purple characters gleam in the Jade Grove. Divine radiance streams its brilliance through the Nine Origins; the golden tones resonate emptily in the Purple Heaven. The majesty of the script blazes forth; *qi* spreads across the Purple Court. The assembled perfected ones offer obeisance, celebrating the Upper Clarity.\n\n**The *Jade Thearch’s Seven Sages Mysterious Record* states:** Then, turning the Nine Empyreans, white tablets and azure records were presented. The Supreme Sage Lord received them in the Nine Empyreans, weaving the flying mysterious purple *qi* into characters of spontaneity. The mysterious record inscribed the names of later students who attained the Dao. The numinous sounds harmonized, and the jade tones conveyed truth—sometimes through the form of the characters, sometimes through hidden tones. In the fourfold convergence above and below, all manifested the empty-born names of the mysterious, engraved in the Hall of Vast Numinosity.\n\nThe ancient script comprised one hundred thousand jade words, with no fixed forms for the characters and no standard sounds for the rhymes. None but the supreme sages could fathom their meaning. After seven thousand years, in the chamber of Kunlun and the source of the Northern Cavern, the characters grew to a *zhang* in size, their patterns resplendent and dazzling. Their fourfold convergence cast forth rays, dimly arising and vanishing as if present, as if absent. Streaming radiance and purple *qi* swept away their impurities; molten gold refined and illuminated their script. Thus, through countless kalpas, the forms of the characters became vivid.\n\nOn the seventeenth day of the ninth month in the first year of the Middle August Era, the Seven Sages, in unison with the numinous, assembled in the Palace of Purity and Equality. They swore celestial oaths to heaven, pledging their vows to the numinous, and received the numinous script. The Supreme Highest resolved their obstructions, and the Seven Sages comprehended its wondrous sounds. It was recorded as the *Turning Heaven’s Nine Empyreans: The Chapter on Attaining the Dao*, inscribed on white silver tablets with soaring azure script. It was stored in a cloud-brocade pouch, sealed with the Seal of Destiny’s Summons, and entrusted to the Left Celestial Duke of the Five Elders’ Immortal Capital for safekeeping in the Jade Palace.\n\n**The *Jade Thearch’s Seven Sages Mysterious Record* states:** The Seven Sages’ Mysterious Record, the celestial script of Turning Heaven, is formed sometimes through rhyming harmony, sometimes through the mutual support of branches and categories, or through the fourfold convergence above and below to complete the sounds of the characters. Sometimes it marks the correct taboo names, or combines single and compound forms—all emerging from the ancient emptiness of the Lofty Cavern, compiled by the perfected ones to clarify the numinous script.\n\nFor later students who possess a mysterious name, upon seeing this script, their names are cut from the azure emptiness (initial *sou* angle), recorded by the Four Offices and inscribed by the Five Thearchs.\n\n**The *Eight Simplicities Scripture* states:** In the Western Florescence Palace, there are *lang* tablets of budding script. Only those who become perfected ones may obtain this text.\n\n**The *Three Caverns Pearl Satchel* states:** In the first year of the Supreme August Era, on the seventh month, the Queen Mother of the West taught in the Southern Floating Cavern Chamber, transmitting it to the Perfected Lord of Pure Emptiness, Lord Wang, who passed it to Yu the Great. Yu sealed the script within the Southern Floating Cavern Chamber, in the stone *gong*.\n\n(Note: The character *gong* 碽 is also written as such.) Thus, the *Five Talismans* states: \"The numinous script of the Nine Heavens remains sealed within the stone *gong*.\" Upon examining the various character types, this *gong* character is not found.\n\nThe *Jade Instructions* (Lower Volume) states: \"The true script of the Five Elders is sealed and titled with a jade *gong*.\" This is another example.\n\n**Kong Lingfu’s *Records of Kuaiji* states:** South of Mount Kuaiji lies Mount Wanwei, atop which stands a stone locally called the Stone Basket. Its cliffs rise sheer into the clouds, and one must ascend by ladder to reach it. When Yu the Great regulated the floodwaters and his work was not yet complete, he fasted on this mountain. Opening the Stone Basket, he found golden tablets inscribed with characters, through which he understood the configurations of mountains and rivers. Thereupon, he dredged and guided the hundred streams, each according to its proper course.\n\n**Script and Talisman Techniques:**\nWithdraw the gaze and reverse the hearing; gather the thoughts and preserve sincerity. Let the heart be as the Great Void, inwardly and outwardly pure and bright. The Primordial Beginning is myself; I am the Primordial Beginning. Where intention goes, the brush moves—one *qi* completes the talisman.\n\nIf the strokes within the talisman differ slightly, do not be rigid; value instead the spontaneity of the brush, where the heart attains the wondrous.\n\nHowever, in the Clear Subtlety tradition, the method of dashing strokes must distinguish between water and fire. For praying for rain or snow, performing water refinement, or treating yang illnesses, use the water brush. For praying for clear skies, summoning lightning, stirring thunder, dispelling epidemics, performing fire refinement, or treating yin conditions, use the fire brush. Employ the taboo names of the Three Heavens or the Five Thearchs as appropriate.\n\n**The Five Chapters of the Most High’s Proclamation:**\n\n**Eastern Azure Essence Flying Cloud Jade Chapter**\nThe Wood Duke, Mulberry Elder Azure August Lord,\nWhite Prime Grand Unity, Left Unsurpassed Hero.\nPeach Prosperity guards life and protects the root of vitality,\nEntering and exiting the Flowery Chamber to blend with the hundred spirits.\nWithin the Mysterious, the Great August opens the Eight Gates,\nRevolving the Five Constants and turning the Dharma Wheel.\nPrimal Chaos and Cavernous Emptiness, kalpas without end,\nWhirling winds part and unite, planting the divine spirits.\nAncestral kalpas transform and give birth, illuminating the Three Luminaries;\nAmong the myriad heavens, only the Dao is my body.\n\n**Mysterious Vastness of the Great Possession, Wondrous Brahma-qi,**\nNine Harmonies and Ten Unions reflect the Primordial Azure.\nUniversally delivering heaven and humanity through the Five Portals,\nTransforming naturally to ascend to the Highest Clarity.\nThe Azure Thearch guards the hun-soul without form or shadow,\nBoundless and infinite, treading the Mysterious Flower.\nWithin the Cavernous Radiance, whistling and chanting, he rides the Supreme Rosy Clouds,\nGolden Perfection flows in resonance, illuminating the Cloud Encampment.\nGathering qi and assembling mist, he grasps the talismans and registers,\nSeparating the dead souls from the living bodies to distinguish the Perfected.\nCommanding the flying clouds to nurture the Nine Qi,\nStooping to refine the Cavernous Wisdom of the spontaneous spirits.\n\n**Southern Vermilion Script, Mysterious Essence Congealed Jade Chapter**\nThe Vermilion Mound and Southern Prosperity hold the Imperial Perfected,\nCommanding and restraining the earthly deities to attend and escort.\nReceiving refinement and rebirth, emerging from the Five Portals,\nForever departing the demonic palaces, the immortal Dao is accomplished.\nForcing the demonic hordes to converge, erasing the ledgers of sins,\nFollowing the kalpas in revolution to extinguish the roots of evil.\nThe Han Controller records those who are delivered,\nThe myriad heavens strictly examine and guard the forms and hun-souls.\nAncestral kalpas, vast and distant, revolve the Great Net,\nJade Mountain and White Stone convene in the Upper Capital.\nThe Life-Favoring Han Lord extends the threads of destiny,\nDelivering from calamity, restoring the bones, reviving the dead.\nAt every moment ascending beyond the Three Realms,\nCarefree, he bows his head to the Jade Emperor.\nEmpty and Cavernous, spontaneously uniting with Brahma-qi,\nThe hun-soul and spirit become pure and upright, the body radiant with light.\nThose who rely on life and death are all immediately delivered,\nCountless generations of ancestors suffer no more.\nReturning to form, roaming the vastness of the Great Void,\nReceiving transformation and rebirth as noble beings.\nThe Crimson Thearch nurtures qi, circulating the constructive and defensive,\nNeither born nor perishing, ensuring eternal existence.\nThe Three Qi soar and hurl the Fire Bells,\nVermilion script congeals the chapters, gathering primordial essence.\nAwakening to principle and forgetting the body, embodying Cavernous Perfection,\nAlone he ascends in flight to feast in the Jade Capital.\n\n**Western Flowing Essence, Spirit Flower Jade Chapter**\nFlying Heaven blazes with brilliance, equal to the Celestial Balance,\nThe Luminous Elder of the Pristine Radiance commands the Yellow Warriors.\nThe myriad thearchs establish rites as the heavens sing,\nRivers and seas fall silent, mountains conceal the clouds.\nSun and moon halt their wheels, uniting the Three Luminaries,\nThe Jade Armillary and stellar constellations align with the Eight Classics.\nThe hordes of demons and ghostly essences extinguish their forms and vitality,\nReturning corpses to life, bones become human.\nPenetrating the mysterious and investigating the subtle, mastering all chapters,\nFlowing radiance stirs the distant spirit flowers.\nThe myriad Dao lineages and ancestral origins, great and carefree,\nGraceful and resplendent, their virtue is unmatched.\nThe Golden Watchtower and Jade Capital, chambers of yin and yang,\nThe Mysterious Vastness and towering peaks, the jeweled terraces shine.\nThrough corpse liberation, returning to form, exhausting the workings of creation,\nThe Nine Palaces thoroughly penetrate, inhaling the Golden Effulgence.\nCavernously resplendent in three hues—azure, yellow, and white,\nWithin and without, flourishing and obscure, the form, qi, and spirit.\nThe White Thearch attends the po-soul, fortifying and guarding,\nThe Azure Empyrean suspends pearls to guide the wondrous Perfected.\nRestraining dragons and tigers, the auspicious clouds manifest might,\nIn an instant, silent resonance delivers heaven and humanity.\nEncountering the scriptures and Dharma, all receive salvation,\nPreserving their original years, all cultivate good hearts.\nForever delivering from the Three Paths and Five Sufferings,\nPassing through the barriers of the myriad heavens, the demon kings submit.\nSupervision and promotion are unrestrained by the Celestial Gates’ system,\nThe Three Realms and Five Thearchs declare the Highest Clarity.\n\n**Northern Purple Register, Mysterious Darkness Jade Chapter**\nPrimordial subtlety returns to color, yet no form remains,\nTotal qi pervades the Net of Heaven, vast and boundless, the Supreme Mystery.\nHis nape bears white light, forming the Nine Images,\nPrimordial Azure unfolds transformation, boundless and profound.\nThe Mysterious Darkness Duke bestows the Perfected Talismans,\nThe Grand Unity Primordial Lord oversees the ranks of immortals.\nCrimson radiance and vermilion auspices dance with the embryonic immortals,\nFlying chariots and jade hues shine upon the Mushroom Fields.\nNine dragons rear their heads, spitting fire pearls,\nThe Dark Tortoise spews flames, vomiting golden lotuses.\nThe nation is secure, the people prosperous, rejoicing in great peace,\nThe earth becomes azure jade, linked with the Dipper.\nSun, moon, and stellar lodges revolve the Jade Balance,\nDivine winds fall silent, mountains swallow the mist.\nFlying Heaven gazes down upon the chiming of jade,\nDark Wisdom and Heavenly Perfected unite with spontaneity.\nRoaming the Three Realms, entering the Golden Gate,\nRevolving without cessation, calamities do not approach.\nThe Black Thearch circulates blood, flowing through the meridians,\nCentering and regulating the Five Qi, penetrating the hundred rivers.\nThirty-five divisions revolve the Five Constants,\nThe primordial net flows and evolves, the Winnowing Basket and Dipper turn.\nPassing through the Wind Marsh and Vajra Heaven,\nThe cosmic order nourishes and generates the myriad qi in full.\nNine Harmonies and Ten Unions enable transformation,\nAt dawn’s flight, bowing before the Jade Emperor.\n\n**Central Flying Flower, Total Cloud Jade Chapter**\nCongealing essence, flying flowers with eight-pointed rays,\nVast and surging, the Great Void radiates the Chamber of Radiance.\nThe hundred demons conceal their rhymes, the qi of the Numinous Treasure,\nSpontaneously uniting and parting, planting yin and yang.\nThe Non-Ultimate Supreme Perfected is the root of heaven,\nVast and distant, the kalpas’ peaks seem as if existing or perishing.\nThe great circulation of Brahma-qi pervades the ten directions,\nThe immeasurable mysteries are difficult to detail.\nThe Supreme Elder of Total Spirit grasps the Five Dippers,\nSternly commanding the Northern Feng to sweep away inauspiciousness.\nThe vast Brahma of the Primordial Abyss revolves the Crimson Clarity,\nThe boundless Dragon Han records the Extended Prosperity.\nThe Thirty-Two Heavens follow the seasonal measures,\nThus composing the Five Chapters to guard the emperors.\nCommanding the myriad heavens with the might of the Eight Radiances,\nReversing death to create life, preserving the Supreme Yang.\nThe Three Primordial Purple Mists circulate above and below,\nThe Yellow Thearch, Central Lord, summons the Returning Yellow.\nThe Muddy Pellet and Crimson Palace unite the hundred spirits,\nGathering the hun-soul and returning the po-soul without hindrance or misfortune.\nOverseeing the host of spirits, grasping the Great Dipper,\nThe Azure Empyrean’s empty songs praise the Dharma King.\nThe myriad heavens’ great sages together proclaim goodness,\nPreserving their original years, free from harm.\nDelivering those on the verge of death, reviving the extinguished,\nTranscending the Formless to merge with the Supreme Thearch.\nThe myriad immortals assist and protect, accomplishing the Supreme Dao,\nThe karmic conditions of past lives may then be fulfilled.\n\n**Record of the Three Caverns’ Divine Talismans concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "三洞神符记 经名：三洞神符记。 撰人不详，约出於唐代。 原系《玄门大论》中一篇，后分出单行。 一卷。 底本出处：《正统道藏》洞真部神符类。 参见《云笈七签》卷七。 三洞神符记 说三元八会六书之法 《道门大论》曰：一者阴阳初分，有三元五德八会之气，以成飞天之书，后撰为八龙云篆明光之章。 陆先生解三才，谓之三元。 三元既立，五行咸具。 以五行为五位，三五和合，谓之八会，为众书之文。 又有八龙云篆明光之章，自然飞玄之气，结空成文，字方一丈，肇於诸天之内，生立一切也。 按《真诰》紫微夫人说，三元八会之书，建文章之祖，八龙云篆，是根宗所起，有书之始也。 又云：八会是三才五行，形在既判之后。 亦书云：灵宝赤书五篇真文，出於元始之先。 即此而论，三元应非三才，五德应非五行也。 此正应是三宝丈人之三气。 三气自非五德耳。 故《九天生神章》云：天地万化，自非三元所育，九气所导，莫能生也。 又曰：三气为天地之尊，九气为万物之根。 故知此三元，在天地未开，三才未生之前也。 宋法师解八会秪是三气五德。 三元者，一曰混洞太无元高上玉皇之气，二曰赤混太无元无上玉清之气，三曰冥寂玄通元无上玉虚之气。 五德者，即三元所有三五会，即阴阳和，阴有少阴、太阴，阳有少阳、太阳，就和中之和，为五德也。 篆者，撰也，撰集云书，谓之云篆。 此即三元八会之文、八龙云篆之章。 皆是天书，三元八会之例是也。 云篆明光，则五符五胜之例是也。 八会本文凡一千一百九字。 其篇真文，合六百六十· 八字。 是三才之元根，生立天地，开化人神，万物之由。 故云有天道、地道、神道、人道，此之谓也。 《玉诀》云：修用此法，五篇皆分字数，各有四条： 一者，主召九天上帝，校神仙图箓，求仙致真之法。 二者，主召天宿星宫，正天分度，保国宁民之道。 三者，摄制酆都六天之气。 四者，勑命水帝，制召龙鸟也。 其诸天内音，一天有八字，三十二天合二百五十六字。 论诸天度数期会，大圣真仙，名讳位号，所治官府，台城处所，神仙变化，升降品次，众魔种类，人鬼生死转轮因缘。 其十三字是五方元精名号，服御求仙、炼神化形、白日腾空之法。 余一百二十二字阙元音解。 二者，演八会为龙凤之文，谓之龙书。 此下皆玄圣所述，以写天文也。 三者，轩辕之时，苍颉傍龙凤之势，采鸟迹为古文，以代结绳，即古体也。 四者，周时史籀变古文为大篆。 五者，秦时程邈变大篆为小篆。 六者，秦后盱阳变小篆为隶书。 又云：汉谓隶书曰佐书。 或言程邈狱中所造，出於徒隶，故以隶为名。 此即为六书也。 云篆 又有云篆明光之章，为顺形梵书，文别为六十四种，播于三十六天。 今经书相傅，皆以隶字解天书，相杂而行也。 八体六书六文 一曰大篆，二曰小篆，三曰刻符，四曰虫书，五曰摹印，六曰署书，七曰殳书，八日隶书。 王莽时使司徒甄丰校定文字，复有六书：一曰古文，孔子壁中书，二曰奇字，古文异书，三曰篆书，四曰佐书，即隶书，五日缪篆，所以摹印，六曰鸟篆，翻言也。 仓颉始书，已应有笔。 《诗》云彤管，则是笔也。 而言蒙恬造笔者，盖恬为秦将，三世有名，制削笔精，能独擅名也。",
      "translated_text": "**Record of the Three Caverns’ Divine Talismans**\n\n**Title:** *Record of the Three Caverns’ Divine Talismans*. Author unknown, likely composed during the Tang dynasty. Originally a chapter in the *Great Treatise of the Daoist Gate*, later extracted as an independent text. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, Cavern of Perfection Division, Category of Divine Talismans. See also *Seven Lots from the Cloudy Satchel*, Scroll 7.\n\n**Record of the Three Caverns’ Divine Talismans: On the Methods of the Three Origins, Eight Convergences, and Six Scripts**\n\nThe *Great Treatise of the Daoist Gate* states: At the primordial division of yin and yang, there arose the qi of the Three Origins, Five Powers, and Eight Convergences, forming the *Flying Script of the Heavens*. Later, these were compiled into the *Luminous Chapters of the Eight Dragons’ Cloud Seal*.\n\nMaster Lu explained the Three Capacities as the Three Origins. Once the Three Origins were established, the Five Phases were complete. Taking the Five Phases as five positions, the harmonization of three and five was called the Eight Convergences, serving as the foundation of all scripts. There were also the *Luminous Chapters of the Eight Dragons’ Cloud Seal*, wherein the natural, soaring, mysterious qi coalesced in the void to form writing. Each character spanned a zhang in size, originating within the various heavens to give rise to all things.\n\nAccording to the *True Reports* as recounted by Lady Ziwei of the Purple Tenuity, the *Script of the Three Origins and Eight Convergences* is the progenitor of all literary compositions. The *Eight Dragons’ Cloud Seal* is the root and origin of all writing. It is also said: The Eight Convergences correspond to the Three Capacities and Five Phases, taking form after the separation of existence. Another text states: The *Five Chapters of the Vermilion Script of Numinous Treasure* emerged prior to the Primordial Beginning. Thus, the Three Origins cannot refer to the Three Capacities, nor can the Five Powers refer to the Five Phases. These must instead be the Three Qi of the Venerable Lord of the Three Treasures. These Three Qi are not the Five Powers. Therefore, the *Verses on the Generation of the Nine Heavens* states: \"The myriad transformations of heaven and earth, if not nurtured by the Three Origins and guided by the Nine Qi, cannot come into being.\" It further says: \"The Three Qi are the honor of heaven and earth; the Nine Qi are the root of the myriad things.\" Thus, these Three Origins existed before the opening of heaven and earth and the birth of the Three Capacities.\n\nMaster Song explained the Eight Convergences as merely the Three Qi and Five Powers. The Three Origins are: first, the qi of the *Chaotic Cavern of the Supreme Jade Emperor of Primordial Vacuity*; second, the qi of the *Vermilion Chaos of the Supreme Jade Purity of Primordial Vacuity*; third, the qi of the *Mysterious Tranquility of the Supreme Jade Void of Primordial Vacuity*. The Five Powers are the convergence of three and five within the Three Origins, namely the harmony of yin and yang. Yin comprises Lesser Yin and Greater Yin; yang comprises Lesser Yang and Greater Yang. The harmony within harmony constitutes the Five Powers.\n\n*Seal* (篆) means *to compile* (撰), referring to the compilation of cloud scripts, hence the term *cloud seal*. This encompasses the texts of the Three Origins and Eight Convergences, as well as the *Chapters of the Eight Dragons’ Cloud Seal*. All are celestial scripts, exemplified by the Three Origins and Eight Convergences. The *Cloud Seal of Luminous Radiance* corresponds to the examples of the Five Talismans and Five Victories.\n\nThe original text of the Eight Convergences comprises 1,109 characters. The true script of its chapters totals 668 characters. These are the primordial roots of the Three Capacities, giving rise to heaven and earth, unfolding the transformations of humans and spirits, and serving as the origin of the myriad things. Hence, it is said there are the Dao of Heaven, the Dao of Earth, the Dao of Spirits, and the Dao of Humans—this is what is meant.\n\nThe *Jade Instructions* states: In practicing this method, the Five Chapters are divided by character count, each with four applications:\n1. To summon the Nine Heavens’ Celestial Thearchs, verify the registers of divine immortals, and seek transcendence to attain perfection.\n2. To summon the celestial lodges and stellar palaces, rectify the divisions of heaven, and safeguard the state and pacify the people.\n3. To restrain and control the qi of the Six Heavens of Fengdu.\n4. To command the Water Thearch and summon dragons and birds.\n\nRegarding the inner sounds of the various heavens: each heaven has eight characters, and the thirty-two heavens together comprise 256 characters. These expound upon the measurements and conjunctions of the heavens, the names and titles of great sages and true immortals, the offices they govern, the locations of their terrace-cities, the transformations and ascents of immortals, the ranks of their descents, the classifications of demons, and the karmic causes of human and ghostly rebirths. Thirteen characters denote the names of the primordial essences of the Five Directions, used in methods for ingesting and refining, cultivating the spirit and transforming the form, and ascending in broad daylight. The remaining 122 characters lack explanations of their primordial sounds.\n\nSecond, the Eight Convergences are developed into the scripts of dragons and phoenixes, called *Dragon Script*. All that follows was transmitted by the mysterious sages to transcribe celestial writing.\n\nThird, during the time of the Yellow Thearch, Cang Jie, observing the forms of dragons and phoenixes and gathering the traces of birds, created ancient script to replace knotted cords—this is the ancient form.\n\nFourth, during the Zhou dynasty, Shi Zhou transformed ancient script into *Greater Seal Script*.\n\nFifth, during the Qin dynasty, Cheng Miao altered *Greater Seal Script* into *Lesser Seal Script*.\n\nSixth, after the Qin, Xu Yang of Xuyang transformed *Lesser Seal Script* into *Clerical Script*. It is also said that the Han referred to clerical script as *Assistant Script*. Some claim Cheng Miao created it while imprisoned, deriving it from the writing of convict laborers, hence the name *clerical*. These constitute the Six Scripts.\n\n**Cloud Seal**\nThere are also the *Luminous Chapters of the Cloud Seal*, which follow the forms of Sanskrit script. The texts are divided into sixty-four types, disseminated across the thirty-six heavens. In contemporary scriptural transmission, celestial writing is explained using clerical characters, intermingled in practice.\n\n**Eight Forms, Six Scripts, Six Writings**\n1. Greater Seal Script\n2. Lesser Seal Script\n3. Talisman-Carving Script\n4. Worm Script\n5. Seal-Engraving Script\n6. Title Script\n7. Weapon Script\n8. Clerical Script\n\nDuring the reign of Wang Mang, the Minister of Education, Zhen Feng, was tasked with standardizing writing, resulting in the Six Writings:\n1. Ancient Script (the script from Confucius’ wall)\n2. Variant Characters (ancient script with unusual forms)\n3. Seal Script\n4. Assistant Script (clerical script)\n5. Curling Seal Script (used for engraving seals)\n6. Bird Seal Script (transliteration)\n\nCang Jie’s initial writing must have employed brushes. The *Book of Songs* mentions \"vermilion tubes,\" which were brushes. The claim that Meng Tian invented the brush likely stems from his prominence as a Qin general across three generations, whose refined brush-making technique earned him sole renown.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1264,
      "start_sentence": 0,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.430057764053345,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\三洞神符记.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "汉和帝时蔡伦始造纸尔。 前唯书简牒。 牒者，诠牒语事也。 简者，在简而不繁也。 但知本是天书金简，余地书已下，八体六文，皆从真出外，学者自更详之。 又未知何时书於此经在纸作卷。 今谓劫初已自有笔，太真所书，何言无也？ 及以八体六文等耶？ 以天尊造化，具一切法也。 后人承用，自有前后耳。 六文，一曰像形，日月是也，二曰指事，上下是也，三曰形声，河海是也，四曰会意，武信是也，五曰转注，考老是也，六曰假借，令长是也。 符字 一切万物，莫不以精气为用。 故二仪三景，皆以精气行乎其中。 万物既有，亦以精气行乎其中也。 是则五行六物，莫不有精气者也。 以道之精气布之简墨，会物之精气，以却邪伪，辅助正真，召会群灵，制御生死，保持劫运，安镇五方。 然此符本於结空，太真仰写天文，分置方位，区别图像符书之异。 符者，通取云物星辰之势； 书者，别析音句诠量之旨； 图者，画取灵变之状。 然符中有书，参似图像。 书中有图，形声并用。 故有八体六文，更相发显。 八显 八显者，一曰天书，八会是也，二曰神书，云篆是也，三曰地书，龙凤之像也，四曰内书，龟龙鱼鸟所吐者也，五曰外书，鳞甲羽毛所载也，六曰鬼书，杂体微昧，非人所解者也，七曰中夏书，草艺云篆是也，八曰戎夷书，类於蜫虫者也。 此六文八体，或今字同古，或古字同今，符彩交加，共成一法，合为一用，故同异无定也。 此依宋法师所说，未见正文。 而三洞经中，符有字者，如古文《尚书》中有古字，与今同者耳。 玉字诀 太上道君於南丹洞阳上绾，为学士王龙赐说此灵文玉字之诀。 但未知定是何世所注。 学者寻之。 又说诸修行符醮五方思存禳灾等法，然正是解诀八会之文，而就本文理中复明理，如解真文中更明感通之理。 《定志经》又云：出思微之义？ 事中复有事，如《玉诀》中复明传经及盟授威仪之事。 然诸经中凡有解诀，皆通谓之《玉诀》也。 皇文帝书 《三皇经》云：皇文帝书，皆出自然虚无，空中结气成字，无祖无先，无穷无极，随运隐见，绵绵常存。 天书 《诸天内音经》云：忽有天书，字方一丈，自然见空，其上文彩焕烂，八角垂芒，精光乱眼，不可得看。 天真皇人曰：斯文尊妙，不譬於常。 是故开大有之始，而闭天光明。 以宝其道，而尊其文。 其字宛奥，非凡书之体。 盖贵其妙象而隐其至真也。 龙章 《灵宝经》云：赤明开图，运度自然，元始安镇，敷落五篇，赤书玉字，八威龙文，保制劫运，使天长存。 此之龙章也。 凤文 《紫凤赤书经》云：此经旧文，藏在太上六合紫房之内，有六头狮子巨兽夹墙，玉童玉女侍卫凤文。 玉牒金书 三元布经，皆刻金丹之书，盛以自然云锦之囊，封以三元宝神之章，藏於九天之上大有之官，谓之玉牒金书。 又云：以紫玉为简，生金为文，编以金缕，缠以青丝。 《太上太真科》云：玉牒金书，七宝为简，又名紫简。 石字 《本行经》云：道言：昔禅黎世界队王有女字絓音，生仍不言，年至十四，主怪之焉，乃弃女於南浮长桑之阿空山之中。 女行山周市，忽与神人会於丹陵之舍栢林之下。 神执絓音右手，题赤石之上，语桂音曰：汝虽不能言，可忆此也。",
      "translated_text": "During the reign of Emperor He of Han, Cai Lun first created paper. Before this, only bamboo slips and wooden tablets were used for writing. *Die* (tablets) served to record matters in detail, while *jian* (slips) were concise and uncluttered. Yet it was known that the original script was the Celestial Script of the Golden Slips; all other scripts—from earthly writings downward, the Eight Styles and Six Writings—derived externally from the true form, which scholars may further investigate.\n\nIt remains unknown when texts were first transcribed onto paper to form scrolls. Now, it is said that brushes existed from the beginning of the kalpa, and the Supreme Perfection (Tai Zhen) inscribed them—how could they be absent? And what of the Eight Styles and Six Writings? For the Celestial Venerable (Tian Zun) embodies creation, encompassing all methods.\n\nLater generations inherited and employed these, naturally developing them in sequence. The Six Writings are as follows:\n1. **Pictographic**—such as the sun and moon;\n2. **Indicative**—such as \"above\" and \"below\";\n3. **Phono-semantic**—such as rivers and seas;\n4. **Associative**—such as \"martial\" (武) and \"trust\" (信);\n5. **Mutually explanatory**—such as \"elder\" (考) and \"aged\" (老);\n6. **Phonetic loan**—such as \"command\" (令) and \"chief\" (长).\n\n**Talismanic Script**\nAll myriad things operate through the essence of *qi*. Thus, the Two Modes (yin and yang) and Three Luminaries (sun, moon, stars) all function through the *qi* within them. Once the myriad things exist, they too operate through the *qi* within them. Therefore, the Five Phases and Six Entities all possess *qi*.\n\nBy spreading the refined *qi* of the Dao onto bamboo slips and ink, and uniting it with the *qi* of things, one repels deceit and falsehood, aids the true and authentic, summons and assembles the host of spirits, governs life and death, sustains the kalpic order, and stabilizes the Five Directions.\n\nThese talismans originate from the structuring of emptiness. The Supreme Perfection (Tai Zhen) transcribed the celestial patterns by gazing upward, arranging them according to directional positions and distinguishing the differences among talismanic diagrams, script, and charts.\n\n- **Talismans** (*fu*) draw upon the configurations of clouds, phenomena, and celestial bodies;\n- **Script** (*shu*) distinguishes and analyzes sounds, phrases, and their measured meanings;\n- **Charts** (*tu*) depict the forms of numinous transformations.\n\nYet talismans contain script, blending with the semblance of diagrams, while script contains charts, employing both form and sound. Thus, the Eight Styles and Six Writings mutually elucidate one another.\n\n**The Eight Manifestations**\nThe Eight Manifestations are:\n1. **Celestial Script**—the Eightfold Convergence;\n2. **Divine Script**—Cloud Seal Script;\n3. **Earthly Script**—the forms of dragons and phoenixes;\n4. **Inner Script**—what tortoises, dragons, fish, and birds disgorge;\n5. **Outer Script**—borne by scales, shells, feathers, and fur;\n6. **Demonic Script**—miscellaneous, obscure forms incomprehensible to humans;\n7. **Central States Script**—grass script and Cloud Seal Script;\n8. **Barbarian Script**—resembling the tracks of insects and worms.\n\nAmong these Six Writings and Eight Styles, some modern characters resemble ancient ones, or ancient characters resemble modern ones. Talismanic colors intermingle, collectively forming a single method and serving a unified purpose—thus, their similarities and differences are not fixed.\n\nThis follows the explanation of Master Song, though the original text has not been seen. In the Three Caverns scriptures, talismans with characters resemble the ancient characters in the *Book of Documents*, some of which remain identical to those of today.\n\n**Jade-Character Formula**\nThe Supreme Dao Lord (Tai Shang Dao Jun) at the Southern Cinnabar Cavern of Yang’s Summit bestowed this numinous script and Jade-Character Formula upon the scholar Wang Long. It remains uncertain to which era the commentary belongs; scholars may investigate it further.\n\nIt also expounds methods for talismanic rites, offerings to the Five Directions, visualization, and disaster aversion—precisely the interpretive formulas for the Eightfold Convergence. Within the original text’s principles, it further clarifies the logic, much like elucidating the principles of resonance within the true script.\n\nThe *Scripture on Stabilizing the Will* asks: Does this emerge from the subtleties of thought? Matters contain further matters, as in the *Jade Formula*, which further clarifies the transmission of scriptures and the solemn rituals of covenant bestowal. Thus, all scriptures containing interpretive formulas are collectively called *Jade Formulas*.\n\n**August Script of the Thearchs**\nThe *Scripture of the Three August Ones* states: The August Script of the Thearchs arises naturally from emptiness and non-being, forming characters from *qi* congealed in the void. Without origin or precedence, without end or limit, it appears and vanishes with the kalpic cycles yet endures eternally.\n\n**Celestial Script**\nThe *Scripture of the Inner Sounds of the Heavens* states: Suddenly, a celestial script appeared, its characters a *zhang* square, naturally manifesting in the void. Its text shimmered with radiant colors, its eight corners trailing beams of light, its luminous brilliance dazzling the eyes, rendering it unreadable.\n\nThe Celestial Perfected Sovereign (Tian Zhen Huang Ren) said: This script is august and wondrous, beyond ordinary comparison. Thus, it inaugurated the beginning of the Great Existence and sealed the celestial radiance to treasure the Dao and honor its script. Its characters are profound and recondite, unlike the forms of common writing—it esteems its wondrous imagery and conceals its ultimate truth.\n\n**Dragon Script**\nThe *Scripture of Numinous Treasure* states: When the Vermilion Clarity unfolded the celestial chart, the workings of destiny proceeded naturally. The Primordial Beginning (Yuan Shi) stabilized and settled it, scattering the Five Chapters. The Vermilion Script of Jade Characters and the Eightfold Might of Dragon Script safeguard the kalpic order, ensuring the heavens endure eternally. This is the Dragon Script.\n\n**Phoenix Script**\nThe *Scripture of the Vermilion Phoenix* states: This scripture’s original text was stored within the Purple Chamber of the Six Harmonies of the Supreme Lord (Tai Shang), guarded by six-headed lion-like beasts flanking the walls, with jade lads and jade maidens attending the Phoenix Script.\n\n**Jade Tablets and Golden Script**\nThe Three Primes distribute the scriptures, all inscribed as Golden Cinnabar Scripts, contained in bags of natural cloud brocade, sealed with the talismanic seals of the Three Primes, and stored in the Palace of Great Existence above the Nine Heavens—these are called Jade Tablets and Golden Script.\n\nIt is also said: They are inscribed on purple jade slips, with characters of raw gold, bound with golden threads and wrapped in azure silk.\n\nThe *Canons of the Supreme Perfection* state: Jade Tablets and Golden Script are inscribed on slips of the Seven Treasures, also called Purple Slips.\n\n**Stone Characters**\nThe *Scripture of Fundamental Practices* states: The Dao said: In the past, in the world of Chan Li, there was a King of the Realm of Dust who had a daughter named Gua Yin. Though born mute, by the age of fourteen, her parents found this strange and abandoned her in the empty mountains south of the Southern Floating Mulberry. Wandering the mountains, she suddenly encountered a divine person at the Cypress Grove beneath the Cinnabar Mound’s abode. The divine being took Gua Yin’s right hand and inscribed upon a red stone, saying to Gua Yin: Though you cannot speak, you may remember this.",
      "overlap_context": "Variant Characters (ancient script with unusual forms)\n3. Seal Script\n4. Assistant Script (clerical script)\n5. Curling Seal Script (used for engraving seals)\n6. Bird Seal Script (transliteration)\n\nCang Jie’s initial writing must have employed brushes. The *Book of Songs* mentions \"vermilion tubes,\" which were brushes. The claim that Meng Tian invented the brush likely stems from his prominence as a Qin general across three generations, whose refined brush-making technique earned him sole renown.",
      "start_char": 1264,
      "end_char": 2523,
      "start_sentence": 61,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.668954849243164,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\三洞神符记.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天为其感，愍其疾，遣朱宫灵童下教絓音治身之卫，授其赤书八字。 絓音於是能言。 《灵宝玉诀经》云：道告阿丘曾曰：汝前生与南极尊神同在禅黎世界，於丹陵之舍栢林之下同发道意，尔时南极姓皇字度明，执汝右手，俱题赤石，以记姓名，南宫即书汝笔迹题於南轩，今犹尚在，石字亦存，汝忆之不？ 丘曾心悟，举目即见南极所主，南壁刻书云：太甲岁七月一日皇度明王阿丘曾同於丹陵栢林下发愿，合二十三字，字甚分明。 题素 《五符经》云：五符一通，书以南和之缯，南和，赤色缯也。 封以金英之函，印以玄都之章，付震水洞玄之君。 《仙公请问经》云：《道德上下经》及《洞真玄经》、《三皇天文》、上清众篇咏等，皆是太上所撰，而为文书於南和之缯，故曰题素也。 玉字 《内音玉字经》云：天真皇人曰：诸天内音自然玉字，字方一丈，自然而见空玄之上，八角垂芒，精光乱眼，灵书八会，字无正形，其趣宛奥，难可寻详，皆诸天之中大梵隐语，结飞玄之气，合和五方之音，生於元始之上，出於空洞之中，随运开度，普成天地之功。 天尊命天真皇人注解其正音，使皇道清畅，泽被十方。 皇人不敢违命，按笔注解之曰：形魂顿丧，率我所见，聊注其文五合之义，其道足以开度天人也。 和合五方，无量之音，以成诸天内音，故曰五合之义也。 文生东 《太平经》云：文者生於东，明於南，故天文生东北，故书出东北而天见其象。 虎有文章，家在寅。 龙有文章，家在辰。 文者生於东，盛於南，是知真文初出在东北也。 玉箓 《玉清隐书》有帝简金书、玄玉箓籍，可以传玄羽玉经也。 又云：自非帝图玉箓者，不得闻见上皇玉慧玉清之隐书、金玄隐玄之羽经也。 玉篇 《众篇序》 云：元始命太真按笔，玉妃拂筵，铸金为简，刻书玉篇，五老掌录，秘於九灵仙都之宫，云蕴而授葛仙公之经也。 玉札 《金根经》云：太上大道君以大洞真经付上相青童君，掌录於东华青宫，使传后圣，应为真人者。 此金简玉札，出自太上灵都之宫，刻玉为之。 丹书墨箓 《太真科》云：丹简者，乃朱漆之简，明火主阳也。 墨箓者，以墨书文，明水主阴也。 人学长生，遵之不死。 故名丹简墨箓，秘不妄传。 玉策 天皇手执飞仙玉策，人皇手执上皇保命玉策，地皇手执元皇定录玉策。 福连之书 《三十九章经》曰：太上有琼羽之门，合延为胎，命之王玄，一为三气之尊，元老为上帝之宾，并扶兆身，神台刊名於福连之简。 又曰：太上金简玉札，为福连之书。 琅蚪琼文 《飞行羽经》云：金书玉箓，乃琅蚪琼文也。 白银之编 《金房度命经》云：太常灵神都宫中，有金房度命回年之诀，皆铸金为简，刻白银之编，紫笔书文也。 赤书 《玉诀经》云：元始赤书五篇真文，置以五帝，导以阴阳，转轮九天之纽，运明五星之光也。 火炼真文 《本相经》曰：吾昔赤明元年与高上大圣玉帝於此土中炼其真文，以火莹发字形尔。 时真文火漏，余处气生，化为七宝林，是以枝叶成紫书金地银镂玉文，其中及诸龙禽猛兽一切神虫，常食林露，真气入身，命皆得长寿，三千万劫当终之后，皆转化为飞仙，从道不辍，亦得正真无为之道。 金壶墨汁字",
      "translated_text": "Heaven, moved by her plight, took pity on her affliction and dispatched the Vermilion Palace’s Divine Youth to teach Gua Yin the arts of bodily preservation, bestowing upon her the Eight-Character Red Script. Thereupon, Gua Yin could speak.\n\nThe *Scripture of the Jade Essentials of the Numinous Treasure* states: The Dao addressed A Qiu Zeng, saying: In your past life, you and the Southern Culmen’s Venerable Deity dwelled together in the world of Chan Li. Beneath the Cypress Grove at the Cinnabar Mound’s abode, you both resolved to pursue the Dao. At that time, the Southern Culmen was surnamed Huang and named Du Ming. He took your right hand, and together you inscribed the red stone to record your names. The Southern Palace later transcribed your brushstrokes onto the Southern Pavilion, where they remain to this day. The stone characters also endure—do you recall them? Qiu Zeng’s heart awakened, and lifting his gaze, he beheld what the Southern Culmen had presided over: on the southern wall, carved script read: *In the Tai Jia year, on the first day of the seventh month, Huang Du Ming and Wang A Qiu Zeng together made their vow beneath the Cypress Grove of the Cinnabar Mound*—twenty-three characters in all, each perfectly distinct.\n\n**Inscribed on Plain Silk**\nThe *Scripture of the Five Talismans* states: When the Five Talismans are transmitted as one, they are inscribed on *nanhe* silk—*nanhe* being red silk. They are sealed in a casket of golden blossoms, stamped with the seal of the Dark Capital, and entrusted to the Lord of the Shocking Waters Grotto’s Mystery.\n\nThe *Scripture of the Questions of the Immortal Duke* states: The *Scriptures of the Dao and Its Virtue (Upper and Lower)*, the *Mysterious Scripture of the Cavern of Perfection*, the *Celestial Writings of the Three Sovereigns*, and the various odes of the Highest Clarity—all were composed by the Most High and inscribed on *nanhe* silk, hence called *inscribed on plain silk*.\n\n**Jade Characters**\nThe *Scripture of the Inner Sounds and Jade Characters* states: The Heavenly Perfected Sovereign said: The inner sounds of the heavens are naturally jade characters, each a *zhang* in breadth, spontaneously manifesting in the Void Mystery above. Their eight corners radiate beams, their luminous essence dazzling the eyes. The numinous script of the Eight Assemblies bears no fixed form; its purport is profound and recondite, difficult to fathom in detail. All are the great Brahmanic hidden language of the heavens, congealed from the soaring mystery of *qi*, harmonizing the sounds of the five directions. They arose above the Primordial Beginning and emerged from the Cavernous Void, unfolding with the turning of the kalpas to universally accomplish the work of heaven and earth. The Heavenly Worthy commanded the Heavenly Perfected Sovereign to annotate their correct sounds, that the sovereign’s Dao might flow clearly and its blessings extend to the ten directions. The Sovereign dared not disobey, and taking up his brush, annotated them, saying: Though my spirit and soul may suddenly perish, I shall record what I have witnessed, briefly annotating the meaning of the Five Harmonies. This Dao suffices to open the path and deliver heaven and humanity. Harmonizing the five directions and the boundless sounds, it perfects the inner sounds of the heavens—hence the meaning of the Five Harmonies.\n\n**Script Born in the East**\nThe *Scripture of Great Peace* states: Script is born in the East and flourishes in the South. Thus, celestial script arises in the northeast, and writings emerge from the northeast, where heaven reveals its patterns. The tiger bears markings and dwells in the *yin* (third earthly branch). The dragon bears markings and dwells in the *chen* (fifth earthly branch). Script is born in the East and thrives in the South—thus true script first appears in the northeast.\n\n**Jade Register**\nThe *Hidden Writings of Jade Clarity* contain the Emperor’s Slips of Gold Script and the Mysterious Jade Registers, which may transmit the *Feathered Jade Scripture of the Cavern of Mystery*. It further states: Without the Emperor’s Chart and Jade Register, one may not hear or behold the Hidden Writings of the Jade Wisdom of the Highest Sovereign, the Jade Clarity, or the Feathered Scriptures of the Golden Mystery and Hidden Mystery.\n\n**Jade Chapters**\nThe *Preface to the Many Chapters* states: The Primordial Beginning commanded the Great Perfected to take up the brush, while the Jade Consort swept the mat. Gold was cast into slips, and the Jade Chapters were inscribed. The Five Elders recorded them, secreting them in the Palace of the Nine Numinous Immortals, where they were stored in cloud-woven caskets and transmitted to the Immortal Duke Ge.\n\n**Jade Tablets**\nThe *Scripture of the Golden Root* states: The Most High Lord of the Great Dao entrusted the *True Scripture of the Great Cavern* to the High Minister, the Azure Youth, who recorded it in the Azure Palace of the Eastern Flowery Capital to transmit to later sages destined to become Perfected Ones. These golden slips and jade tablets emerged from the Palace of the Numinous Capital of the Most High, carved from jade.\n\n**Cinnabar Script and Ink Registers**\nThe *Canons of the Supreme Perfection* state: Cinnabar slips are vermilion-lacquered slips, signifying fire as the master of yang. Ink registers are script written in ink, signifying water as the master of yin. Those who study longevity and adhere to them shall not die. Thus, they are called *cinnabar slips and ink registers*, and are transmitted only in secret.\n\n**Jade Tallies**\nThe Heavenly Sovereign wields the Flying Immortal’s Jade Tally; the Human Sovereign wields the Jade Tally of the Highest Sovereign’s Preservation of Life; the Earthly Sovereign wields the Jade Tally of the Primordial Sovereign’s Determination of Records.\n\n**The Book of Blessed Continuity**\nThe *Scripture of the Thirty-Nine Chapters* states: The Most High possesses the Gate of Jade Feathers, which coalesce to form an embryo. It is named Wang Xuan, the honored one of the three *qi*. The Primordial Elder is the guest of the Celestial Thearch, together supporting the myriad bodies. The Terrace of Spirits carves their names upon the slips of Blessed Continuity. It further states: The Most High’s golden slips and jade tablets are the Book of Blessed Continuity.\n\n**Jade and Coral Script**\nThe *Feathered Scripture of Flight* states: Gold script and jade registers are the Jade and Coral Script.\n\n**White Silver’s Compilation**\nThe *Scripture of the Golden Chamber’s Life-Prolonging Arts* states: In the Palace of the Numinous Capital of the Great Constant, there are the arts of the Golden Chamber for prolonging life and reversing the years. All are cast in gold slips, inscribed on white silver’s compilation, and written in purple ink.\n\n**Red Script**\nThe *Scripture of the Jade Essentials* states: The Primordial Beginning’s Red Script of the Five Chapters of True Writ is placed with the Five Thearchs, guided by yin and yang. It turns the pivot of the Nine Heavens and revolves the radiance of the Five Stars.\n\n**Fire-Refined True Script**\nThe *Scripture of Fundamental Forms* states: In the first year of the Red Brightness, I and the Highest Great Sage, the Jade Thearch, refined this true script in this land, using fire to illuminate and reveal its characters. At that time, the true script’s fire overflowed, and *qi* arose elsewhere, transforming into a forest of the Seven Treasures. Thus, its branches and leaves became purple script on a golden ground with silver engravings and jade characters. Within it were all manner of dragons, birds, fierce beasts, and divine insects. Constantly feeding on the forest’s dew and absorbing the true *qi* into their bodies, their lives were prolonged. After thirty million kalpas, when their terms ended, they all transformed into flying immortals, ceaselessly following the Dao, thereby attaining the true and effortless Dao.\n\n**Characters of the Golden Flask’s Ink**",
      "overlap_context": "Chan Li, there was a King of the Realm of Dust who had a daughter named Gua Yin. Though born mute, by the age of fourteen, her parents found this strange and abandoned her in the empty mountains south of the Southern Floating Mulberry. Wandering the mountains, she suddenly encountered a divine person at the Cypress Grove beneath the Cinnabar Mound’s abode. The divine being took Gua Yin’s right hand and inscribed upon a red stone, saying to Gua Yin: Though you cannot speak, you may remember this.",
      "start_char": 2523,
      "end_char": 3808,
      "start_sentence": 120,
      "end_sentence": 165,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.72952938079834,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\三洞神符记.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "《圣纪》云：浮提国献善书二人，乍老乍少，隐形则出影，闻声则藏形，时出金壶四寸，上有五龙之检，封以青泥，壶中有墨汁，若淳漆，洒木石皆成篆隶科斗之字，记造化人伦之始。 老君撰道经垂十万言，皆写以玉牒，编以金绳，贮以玉函。 及金壶汁尽，浮提二人乃欲刳心沥血，以代墨焉。 琼札 《玉清隐书金虎符》云：郁仪赤文，招日同舆，结璘黄章，与月共居。 《上清消魔经》：启洞门於希林，寻灵迹於丹穴，发元天之朱匮，望上清之琼札，玄书既刻於玉章，绛名始刊於灵阙，四遇三元於玄宫，六造五老於灵室。 紫字 《八素经》云：八素真经玄文生於太空之内，见於西龟之山，玄圃之上，积石之阴。 《八素高玄羽章》：灵文郁乎洞标，紫字焕乎琼林，神光流辉於九元，金音虚朗於紫天，文威焕赫； 气布紫庭，众真晏礼，称庆上清。 自然之字 《玉帝七圣玄记》云：尔乃回天九霄，白简青录，上圣帝君受於九空，结飞玄紫气自然之字，玄记后学得道之名，灵音韵合，玉朗禀真，或以字体，或以隐音，上下四会，皆表玄名空生，刻书广灵之堂。 旧文有十万玉言，字无正类，韵无正音，自非上圣，莫能意通。 积七千年而后，昆仑之室，北洞之源，字方一丈，文蔚焕烂，四合垂芒，虚生晻蔼，若存若亡。 流光紫气拂其秽，黄金冶炼莹其文，遂经累劫，字体鲜明。 至中皇元年九月十七日，七圣齐灵清齐长宫，金青盟天，脆誓告灵，奉受灵文。 高上解其曲滞，七圣通其妙音，记为回天九霄得道之篇，刻以白银之简，结以飞青之文，藏於云锦之囊，封以启命之章，付於五老仙都左仙公掌录琼宫也。 四会成字 《玉帝七圣玄记》云：七圣玄记，回天上文，或以韵合，或以支类相参，或上下四会以成字音，或标其正讳，或单复相兼，皆出玄古空洞之中，高真撰集，以明灵文。 后学之人，若有玄名者，得见此文，青空捒初角切名，四司所保，五帝记名也。 琅简蕊书 《八素经》云：西华宫有琅简蕊书，当为真人者，乃得此文。 石碽 《三洞珠囊》云：西王母以上皇元年七月於南浮洞室下教，以授清虚真人王君，传於夏禹，禹封文於南浮洞室石□之中。 □亦有作此碽者。 故《五符》云：九天灵书，犹封於石碽是也。 今检诸字类，无此碽字也。 《玉诀》下云：五老真文，封题玉碽。 亦其例也。 孔灵符《会稽记》云：会稽山南有宛委山，其上有石，俗呼为石篑。 壁立干云，累梯然后至焉。 昔禹治洪水，厥功未就，斋於此山，发石篑，得金简字，以知山河体势，於是疏导百川，各尽其宜也。 书符诀 收视反听，摄念存诚，心若太虚，内外贞白，元始即我，我即元始，意到运笔，一炁成符。 若符中点画微有不同，不必拘泥，贵乎信笔而成，心中得意妙处也。 但清微中抹笔之法，须分水火。 如祈雨雪，行水炼，治阳病，悉用水笔。 祈晴、起电动雷、袪殟、行火炼、治阴证，悉用火笔。 或三天讳，或五帝讳，随宜用之。 太上敷落五篇 东方苍精飞云玉篇 木公扶桑苍皇君，白元太一左无英。 桃康保命卫生根，出入华房混百神。 玄中太皇开八门，回度五常运法轮。 混沌洞虚无期劫，徊风离合植神灵。 祖劫化生明三景，诸天唯道为我身。",
      "translated_text": "**The *Shengji* states:** In the kingdom of Futi, two scribes of virtuous script were presented, now old, now young. When they concealed their forms, shadows appeared; when their voices were heard, their forms vanished. At times, they produced a four-inch golden flask, sealed with a lock of five dragons and bound with green clay. Within the flask was ink as thick as lacquer, which, when sprinkled upon wood or stone, transformed into characters of seal script, clerical script, and tadpole script, recording the origins of creation and human relations.\n\nThe Venerable Lord composed Daoist scriptures totaling one hundred thousand words, all transcribed onto jade tablets, bound with golden cords, and stored in jade cases. When the ink in the golden flask was exhausted, the two from Futi wished to cut open their hearts and drip their blood to replace the ink.\n\n**The *Jade Clarity Hidden Book of the Golden Tiger Talisman* states:** The crimson script of Yu Yi summons the sun to share its chariot; the yellow chapters of Jie Lin dwell with the moon.\n\n**The *Upper Clarity Scripture for Dispelling Demons* states:** Open the cavern gate in the Grove of Rarities, seek the numinous traces in the Cinnabar Grotto. Unseal the vermilion coffer of the Primordial Heaven, gaze upon the jade tablets of the Upper Clarity. The mysterious script is already engraved on jade tablets, and the crimson names are first inscribed at the Numinous Portal. Four encounters with the Three Origins in the Mysterious Palace, six visitations to the Five Elders in the Numinous Chamber.\n\n**The *Eight Simplicities Scripture* states:** The Eight Simplicities True Scripture’s mysterious script arises within the Great Void, appearing on the Western Tortoise Mountain, above the Dark Garden, and beneath the Shaded Face of the Accumulated Stones.\n\n**The *Eight Simplicities Lofty Mystery Feathered Chapters* states:** The numinous script is dense upon the Cavern’s summit; the purple characters gleam in the Jade Grove. Divine radiance streams its brilliance through the Nine Origins; the golden tones resonate emptily in the Purple Heaven. The majesty of the script blazes forth; *qi* spreads across the Purple Court. The assembled perfected ones offer obeisance, celebrating the Upper Clarity.\n\n**The *Jade Thearch’s Seven Sages Mysterious Record* states:** Then, turning the Nine Empyreans, white tablets and azure records were presented. The Supreme Sage Lord received them in the Nine Empyreans, weaving the flying mysterious purple *qi* into characters of spontaneity. The mysterious record inscribed the names of later students who attained the Dao. The numinous sounds harmonized, and the jade tones conveyed truth—sometimes through the form of the characters, sometimes through hidden tones. In the fourfold convergence above and below, all manifested the empty-born names of the mysterious, engraved in the Hall of Vast Numinosity.\n\nThe ancient script comprised one hundred thousand jade words, with no fixed forms for the characters and no standard sounds for the rhymes. None but the supreme sages could fathom their meaning. After seven thousand years, in the chamber of Kunlun and the source of the Northern Cavern, the characters grew to a *zhang* in size, their patterns resplendent and dazzling. Their fourfold convergence cast forth rays, dimly arising and vanishing as if present, as if absent. Streaming radiance and purple *qi* swept away their impurities; molten gold refined and illuminated their script. Thus, through countless kalpas, the forms of the characters became vivid.\n\nOn the seventeenth day of the ninth month in the first year of the Middle August Era, the Seven Sages, in unison with the numinous, assembled in the Palace of Purity and Equality. They swore celestial oaths to heaven, pledging their vows to the numinous, and received the numinous script. The Supreme Highest resolved their obstructions, and the Seven Sages comprehended its wondrous sounds. It was recorded as the *Turning Heaven’s Nine Empyreans: The Chapter on Attaining the Dao*, inscribed on white silver tablets with soaring azure script. It was stored in a cloud-brocade pouch, sealed with the Seal of Destiny’s Summons, and entrusted to the Left Celestial Duke of the Five Elders’ Immortal Capital for safekeeping in the Jade Palace.\n\n**The *Jade Thearch’s Seven Sages Mysterious Record* states:** The Seven Sages’ Mysterious Record, the celestial script of Turning Heaven, is formed sometimes through rhyming harmony, sometimes through the mutual support of branches and categories, or through the fourfold convergence above and below to complete the sounds of the characters. Sometimes it marks the correct taboo names, or combines single and compound forms—all emerging from the ancient emptiness of the Lofty Cavern, compiled by the perfected ones to clarify the numinous script.\n\nFor later students who possess a mysterious name, upon seeing this script, their names are cut from the azure emptiness (initial *sou* angle), recorded by the Four Offices and inscribed by the Five Thearchs.\n\n**The *Eight Simplicities Scripture* states:** In the Western Florescence Palace, there are *lang* tablets of budding script. Only those who become perfected ones may obtain this text.\n\n**The *Three Caverns Pearl Satchel* states:** In the first year of the Supreme August Era, on the seventh month, the Queen Mother of the West taught in the Southern Floating Cavern Chamber, transmitting it to the Perfected Lord of Pure Emptiness, Lord Wang, who passed it to Yu the Great. Yu sealed the script within the Southern Floating Cavern Chamber, in the stone *gong*.\n\n(Note: The character *gong* 碽 is also written as such.) Thus, the *Five Talismans* states: \"The numinous script of the Nine Heavens remains sealed within the stone *gong*.\" Upon examining the various character types, this *gong* character is not found.\n\nThe *Jade Instructions* (Lower Volume) states: \"The true script of the Five Elders is sealed and titled with a jade *gong*.\" This is another example.\n\n**Kong Lingfu’s *Records of Kuaiji* states:** South of Mount Kuaiji lies Mount Wanwei, atop which stands a stone locally called the Stone Basket. Its cliffs rise sheer into the clouds, and one must ascend by ladder to reach it. When Yu the Great regulated the floodwaters and his work was not yet complete, he fasted on this mountain. Opening the Stone Basket, he found golden tablets inscribed with characters, through which he understood the configurations of mountains and rivers. Thereupon, he dredged and guided the hundred streams, each according to its proper course.\n\n**Script and Talisman Techniques:**\nWithdraw the gaze and reverse the hearing; gather the thoughts and preserve sincerity. Let the heart be as the Great Void, inwardly and outwardly pure and bright. The Primordial Beginning is myself; I am the Primordial Beginning. Where intention goes, the brush moves—one *qi* completes the talisman.\n\nIf the strokes within the talisman differ slightly, do not be rigid; value instead the spontaneity of the brush, where the heart attains the wondrous.\n\nHowever, in the Clear Subtlety tradition, the method of dashing strokes must distinguish between water and fire. For praying for rain or snow, performing water refinement, or treating yang illnesses, use the water brush. For praying for clear skies, summoning lightning, stirring thunder, dispelling epidemics, performing fire refinement, or treating yin conditions, use the fire brush. Employ the taboo names of the Three Heavens or the Five Thearchs as appropriate.\n\n**The Five Chapters of the Most High’s Proclamation:**\n\n**Eastern Azure Essence Flying Cloud Jade Chapter**\nThe Wood Duke, Mulberry Elder Azure August Lord,\nWhite Prime Grand Unity, Left Unsurpassed Hero.\nPeach Prosperity guards life and protects the root of vitality,\nEntering and exiting the Flowery Chamber to blend with the hundred spirits.\nWithin the Mysterious, the Great August opens the Eight Gates,\nRevolving the Five Constants and turning the Dharma Wheel.\nPrimal Chaos and Cavernous Emptiness, kalpas without end,\nWhirling winds part and unite, planting the divine spirits.\nAncestral kalpas transform and give birth, illuminating the Three Luminaries;\nAmong the myriad heavens, only the Dao is my body.",
      "overlap_context": "eaves became purple script on a golden ground with silver engravings and jade characters. Within it were all manner of dragons, birds, fierce beasts, and divine insects. Constantly feeding on the forest’s dew and absorbing the true *qi* into their bodies, their lives were prolonged. After thirty million kalpas, when their terms ended, they all transformed into flying immortals, ceaselessly following the Dao, thereby attaining the true and effortless Dao.\n\n**Characters of the Golden Flask’s Ink**",
      "start_char": 3808,
      "end_char": 5078,
      "start_sentence": 166,
      "end_sentence": 211,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.46284317970276,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\三洞神符记.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "郁罗大有妙梵气，九和十合映始青。 普度天人飞五户，变化自然升上清。 青帝护魂无形影，无穷无极蹈玄英。 洞景啸咏驭太霞，金真流响朗云营。 摄气聚烟执符箓，死魂生身别至真。 统御飞云育九气，俯研洞惠自然神。 南方赤字玄精凝章玉篇 朱陵南昌有帝真，勑制地祇侍送迎。 受炼更生出五户，永离鬼宫仙道成。 逼合鬼群除罪簿，随劫轮转灭恶根。 韩司主录随所度，诸天严校卫形魂。 祖劫渺渺运大罗，玉山白石会上京。 好生韩君延寿算，度厄回骸起死形。 时刻升迁超三界，逍遥稽首玉帝尊。 空洞自然合梵气，魂神澄正身光明。 生死受赖皆即度，亿曾万祖苦不经。 反形游行太空际，受化更生为贵人。 赤帝养气通营卫，不生不灭使长存。 三气飞腾掷火铃，赤字凝章聚元精。 悟理兼忘体洞真，独步飞升宴玉京。 西方流精神英玉篇 飞天炜烨齐天钧，皓景元老摄黄兵。 万帝设礼诸天唱，河海静默岳藏云。 日月停轮合三景，璇玑星斗齐八经。 群魔鬼精灭形爽，回尸起死骨成人。 通玄究微悉其章，流辉感激渺神英。 万道宗祖大乘逸，窈窕琼华德可胜。 金阙玉京阴阳室，郁罗萧仞宝台明。 尸解返形穷造化，九宫通彻噏金涬。 洞焕三色青黄白，内外蓊冥形气神。 白帝侍魄营固守，碧落悬珠引妙真。 禁制龙虎威庆云，倏欻寂响度天人。 遇值经法普得济，全其本年咸善心。 永度三涂五苦难，历关诸天魔王倾。 监举无拘天门制，三界五帝言上清。 北方紫册玄冥玉篇 元眇复色无复形，总气弥罗浩太玄。 项负白光成九象，始青开化杳无边。 玄冥公子度真符，太一元君掌列仙。 彤辉绛瑞舞胎仙，飞軿玉彩射芝田。 九龙骤首吐火珠，玄龟炎迸吐金莲。 国安民富欣太平，土作碧玉与斗连。 日月星宿旋玉衡，神风静默山吞烟。 飞天下观琳琅响，冥慧天真合自然。 游行三界入金门，轮转不灭灾不干。 黑帝通血流脉津，中理五气贯百川。 三十五分回五常，元纲流演箕斗旋。 历度风泽金刚天，纲纪滋生万气全。 九和十合能变化，飞晨稽首玉帝前。 中央飞英总云玉篇 结精飞英八角芒，郁勃太空焕景房。 百魔隐韵气灵宝，自然离合植阴阳。 无无上真为天根，渺渺劫仞若存亡。 大行梵气周十方，无量玄奥难可详。 总灵上老握五斗，严摄北酆扫不祥。 溟涬大梵运赤明，辽廓龙汉纪延康。 三十二天按节度，故作五篇镇帝王。 统御万天威八景，回死作生保至阳。 三素紫烟循上下，黄帝中主招回黄。 泥丸绛宫合百神，摄魂还魄无滞殃。 总监众灵掌大魁，碧落空歌赞法王。 诸天大圣同称善，全其本年无中伤。 济度垂死绝而生，超凌无色混太皇。 万仙辅翼成至道，宿命因缘始可当。 三洞神符记竟",
      "translated_text": "**Mysterious Vastness of the Great Possession, Wondrous Brahma-qi,**\nNine Harmonies and Ten Unions reflect the Primordial Azure.\nUniversally delivering heaven and humanity through the Five Portals,\nTransforming naturally to ascend to the Highest Clarity.\nThe Azure Thearch guards the hun-soul without form or shadow,\nBoundless and infinite, treading the Mysterious Flower.\nWithin the Cavernous Radiance, whistling and chanting, he rides the Supreme Rosy Clouds,\nGolden Perfection flows in resonance, illuminating the Cloud Encampment.\nGathering qi and assembling mist, he grasps the talismans and registers,\nSeparating the dead souls from the living bodies to distinguish the Perfected.\nCommanding the flying clouds to nurture the Nine Qi,\nStooping to refine the Cavernous Wisdom of the spontaneous spirits.\n\n**Southern Vermilion Script, Mysterious Essence Congealed Jade Chapter**\nThe Vermilion Mound and Southern Prosperity hold the Imperial Perfected,\nCommanding and restraining the earthly deities to attend and escort.\nReceiving refinement and rebirth, emerging from the Five Portals,\nForever departing the demonic palaces, the immortal Dao is accomplished.\nForcing the demonic hordes to converge, erasing the ledgers of sins,\nFollowing the kalpas in revolution to extinguish the roots of evil.\nThe Han Controller records those who are delivered,\nThe myriad heavens strictly examine and guard the forms and hun-souls.\nAncestral kalpas, vast and distant, revolve the Great Net,\nJade Mountain and White Stone convene in the Upper Capital.\nThe Life-Favoring Han Lord extends the threads of destiny,\nDelivering from calamity, restoring the bones, reviving the dead.\nAt every moment ascending beyond the Three Realms,\nCarefree, he bows his head to the Jade Emperor.\nEmpty and Cavernous, spontaneously uniting with Brahma-qi,\nThe hun-soul and spirit become pure and upright, the body radiant with light.\nThose who rely on life and death are all immediately delivered,\nCountless generations of ancestors suffer no more.\nReturning to form, roaming the vastness of the Great Void,\nReceiving transformation and rebirth as noble beings.\nThe Crimson Thearch nurtures qi, circulating the constructive and defensive,\nNeither born nor perishing, ensuring eternal existence.\nThe Three Qi soar and hurl the Fire Bells,\nVermilion script congeals the chapters, gathering primordial essence.\nAwakening to principle and forgetting the body, embodying Cavernous Perfection,\nAlone he ascends in flight to feast in the Jade Capital.\n\n**Western Flowing Essence, Spirit Flower Jade Chapter**\nFlying Heaven blazes with brilliance, equal to the Celestial Balance,\nThe Luminous Elder of the Pristine Radiance commands the Yellow Warriors.\nThe myriad thearchs establish rites as the heavens sing,\nRivers and seas fall silent, mountains conceal the clouds.\nSun and moon halt their wheels, uniting the Three Luminaries,\nThe Jade Armillary and stellar constellations align with the Eight Classics.\nThe hordes of demons and ghostly essences extinguish their forms and vitality,\nReturning corpses to life, bones become human.\nPenetrating the mysterious and investigating the subtle, mastering all chapters,\nFlowing radiance stirs the distant spirit flowers.\nThe myriad Dao lineages and ancestral origins, great and carefree,\nGraceful and resplendent, their virtue is unmatched.\nThe Golden Watchtower and Jade Capital, chambers of yin and yang,\nThe Mysterious Vastness and towering peaks, the jeweled terraces shine.\nThrough corpse liberation, returning to form, exhausting the workings of creation,\nThe Nine Palaces thoroughly penetrate, inhaling the Golden Effulgence.\nCavernously resplendent in three hues—azure, yellow, and white,\nWithin and without, flourishing and obscure, the form, qi, and spirit.\nThe White Thearch attends the po-soul, fortifying and guarding,\nThe Azure Empyrean suspends pearls to guide the wondrous Perfected.\nRestraining dragons and tigers, the auspicious clouds manifest might,\nIn an instant, silent resonance delivers heaven and humanity.\nEncountering the scriptures and Dharma, all receive salvation,\nPreserving their original years, all cultivate good hearts.\nForever delivering from the Three Paths and Five Sufferings,\nPassing through the barriers of the myriad heavens, the demon kings submit.\nSupervision and promotion are unrestrained by the Celestial Gates’ system,\nThe Three Realms and Five Thearchs declare the Highest Clarity.\n\n**Northern Purple Register, Mysterious Darkness Jade Chapter**\nPrimordial subtlety returns to color, yet no form remains,\nTotal qi pervades the Net of Heaven, vast and boundless, the Supreme Mystery.\nHis nape bears white light, forming the Nine Images,\nPrimordial Azure unfolds transformation, boundless and profound.\nThe Mysterious Darkness Duke bestows the Perfected Talismans,\nThe Grand Unity Primordial Lord oversees the ranks of immortals.\nCrimson radiance and vermilion auspices dance with the embryonic immortals,\nFlying chariots and jade hues shine upon the Mushroom Fields.\nNine dragons rear their heads, spitting fire pearls,\nThe Dark Tortoise spews flames, vomiting golden lotuses.\nThe nation is secure, the people prosperous, rejoicing in great peace,\nThe earth becomes azure jade, linked with the Dipper.\nSun, moon, and stellar lodges revolve the Jade Balance,\nDivine winds fall silent, mountains swallow the mist.\nFlying Heaven gazes down upon the chiming of jade,\nDark Wisdom and Heavenly Perfected unite with spontaneity.\nRoaming the Three Realms, entering the Golden Gate,\nRevolving without cessation, calamities do not approach.\nThe Black Thearch circulates blood, flowing through the meridians,\nCentering and regulating the Five Qi, penetrating the hundred rivers.\nThirty-five divisions revolve the Five Constants,\nThe primordial net flows and evolves, the Winnowing Basket and Dipper turn.\nPassing through the Wind Marsh and Vajra Heaven,\nThe cosmic order nourishes and generates the myriad qi in full.\nNine Harmonies and Ten Unions enable transformation,\nAt dawn’s flight, bowing before the Jade Emperor.\n\n**Central Flying Flower, Total Cloud Jade Chapter**\nCongealing essence, flying flowers with eight-pointed rays,\nVast and surging, the Great Void radiates the Chamber of Radiance.\nThe hundred demons conceal their rhymes, the qi of the Numinous Treasure,\nSpontaneously uniting and parting, planting yin and yang.\nThe Non-Ultimate Supreme Perfected is the root of heaven,\nVast and distant, the kalpas’ peaks seem as if existing or perishing.\nThe great circulation of Brahma-qi pervades the ten directions,\nThe immeasurable mysteries are difficult to detail.\nThe Supreme Elder of Total Spirit grasps the Five Dippers,\nSternly commanding the Northern Feng to sweep away inauspiciousness.\nThe vast Brahma of the Primordial Abyss revolves the Crimson Clarity,\nThe boundless Dragon Han records the Extended Prosperity.\nThe Thirty-Two Heavens follow the seasonal measures,\nThus composing the Five Chapters to guard the emperors.\nCommanding the myriad heavens with the might of the Eight Radiances,\nReversing death to create life, preserving the Supreme Yang.\nThe Three Primordial Purple Mists circulate above and below,\nThe Yellow Thearch, Central Lord, summons the Returning Yellow.\nThe Muddy Pellet and Crimson Palace unite the hundred spirits,\nGathering the hun-soul and returning the po-soul without hindrance or misfortune.\nOverseeing the host of spirits, grasping the Great Dipper,\nThe Azure Empyrean’s empty songs praise the Dharma King.\nThe myriad heavens’ great sages together proclaim goodness,\nPreserving their original years, free from harm.\nDelivering those on the verge of death, reviving the extinguished,\nTranscending the Formless to merge with the Supreme Thearch.\nThe myriad immortals assist and protect, accomplishing the Supreme Dao,\nThe karmic conditions of past lives may then be fulfilled.\n\n**Record of the Three Caverns’ Divine Talismans concludes.**",
      "overlap_context": "osperity guards life and protects the root of vitality,\nEntering and exiting the Flowery Chamber to blend with the hundred spirits.\nWithin the Mysterious, the Great August opens the Eight Gates,\nRevolving the Five Constants and turning the Dharma Wheel.\nPrimal Chaos and Cavernous Emptiness, kalpas without end,\nWhirling winds part and unite, planting the divine spirits.\nAncestral kalpas transform and give birth, illuminating the Three Luminaries;\nAmong the myriad heavens, only the Dao is my body.",
      "start_char": 5079,
      "end_char": 6274,
      "start_sentence": 212,
      "end_sentence": 276,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.99023938179016,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\三洞神符记.txt",
        "category": "神符类"
      }
    }
  ]
}