{
  "source_id": "三洞众戒文",
  "source_file": "chunked_daozang\\三洞众戒文.json",
  "total_chunks": 5,
  "total_original_chars": 5710,
  "total_translated_chars": 36132,
  "total_translation_time": 170.03779458999634,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\戒律类\\三洞众戒文.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Precepts for the Three Caverns**\n*Scripture Title:* *The Precepts for the Three Caverns*\nOriginal compiler: Zhang Wanfu. Two fascicles.\nSource text: *Daoist Canon of the Zhengtong Era*, Cavern of Perfection Section, Precepts and Disciplines Category.\n\n**Preface to *The Precepts for the Three Caverns***\nCompiled by Zhang Wanfu, Daoist of the Great Clarity Abbey in the capital\n\nWanfu respectfully observes: The Three Caverns contain many scriptures expounding precepts, too numerous to detail in full. Those who study the Dao and seek truth invariably begin with fasting and precepts. Thus, the *Lingbao* *Ascending Mystery, Pacing the Void* states: \"All arise from fasting and precepts, accumulating merit to bind past karmic ties.\" The Left Immortal of the Supreme Ultimate also says: \"To study the Dao without cultivating fasting and precepts is but vain toil in the mountains and forests.\" From this, the matter is clear.\n\nNow, precepts restrain all evil conduct and serve as the foremost defense among all practices. Without upholding precepts, the Dao cannot be attained. Yet if the scriptures of the Dao are not transmitted by a master, their practice lacks spiritual efficacy. The liturgical codes of the Three Caverns provide comprehensive regulations, but masters and disciples, each adhering to their own tradition, differ in transmission across Wu, Shu, and the capital. This is because teachings and precepts require gradual or sudden awakening. People vary in wisdom; methods are adapted to their capacity, yet all must accord with the Dao.\n\nI fear that those of limited vision may rashly generate doubts. The sequence of transmitting scriptures and methods has already been outlined in *The Catalog of the Three Caverns*. Now, following the scriptures, I have extracted the precept texts and appended them to their respective methods. On the day of transmission, they are conferred in accordance with the method, enabling Daoists to recite and practice them, preventing wrongdoing and restraining evil, governing the six senses, advancing in rank to become Perfected Immortals, and transcending the Three Realms. From shallow to profound, distinctions exist; from mortal to sage, each has its gradations.\n\nHere, I briefly present the main outline to facilitate awakening to the mystery:\n- For those beginning to awaken and enter the Dao: the Three Refuges Precepts;\n- For registered disciples: the Five Precepts and Eight Precepts;\n- For laymen and laywomen: the Supreme Ten Precepts;\n- For newly tonsured: the Initial Perfection Precepts;\n- For Orthodox Unity disciples: the Seventy-Two Precepts;\n- For male and female officials: the One Hundred Eighty Precepts of Lord Lao;\n- For devout disciples: the Celestial Worthy’s Ten Precepts and Fourteen Rules for Conduct;\n- For the *Five Thousand Characters* and the Golden Seal: the Yin-Yang Precepts of the Great Clarity;\n- For High Mystery Masters of the Supreme: the Twenty-Seven Precepts;\n- For the Cavern of Divinities: the *Three Essential Sayings*, the Five Precepts, the Thirteen Precepts, and the Seven Hundred Twenty Gates of Precepts;\n- For the Inner Teachings of Ascending Mystery: the One Hundred Twenty-Nine Precepts;\n- For the Initial Alliance of Numinous Treasure: the Precepts for Closing the Six Senses;\n- For the Middle Alliance: the Upper Grade Precepts of Wisdom;\n- For the Great Alliance: the One Hundred Eighty Precepts of the Three Primes;\n- For the Highest Clarity: the Two Hundred Great Precepts of Wisdom and Contemplating the Body.\n\nFor all transmissions, each is conferred with the ritual vestments. The codes and precepts for the vestments are proclaimed, the rank of the method is briefly conferred, and then the essential precepts of the Celestial Worthy are transmitted. After three days of admonitions, a fast is held to give thanks. The names and appearances of the Three Masters, along with the location of the abbey, are all recorded to the left.\n\nThese are written simultaneously with the transmitted scriptures and methods. Though they are all contained within the scriptures, consulting them at the time of transmission is difficult. Thus, they are presented here.\n\n---\n\n**The Precepts for the Three Caverns, Fascicle One**\n**The Three Refuges Precepts for Beginning the Aspiration to Enter the Dao**\n*From the Supreme Mystery Section*\n\nThe Primordial Celestial Worthy addressed the Celestial Worthy of the Great Dao, saying: The Dao is vast and formless, yet in motion, it takes form. It spreads qi and moves spirit, giving birth to all beings. Embracing the One and containing the Origin, it is emptiness and quiescence. Patterns respond and images coalesce; it enfolds truth and emits essence. Endowed with perception, it shapes forms, transforming yellow into green. Riding the moment, it attends to encounters, responding to the feelings of things. Therefore, I tell you: close your ears and listen with your heart.\n\nThe Dao is the origin and head of all things, the unborn and spiritually generative. It creates and transforms heaven and earth, sun and moon, mountains and rivers. It flows essence and disperses qi, reaching everywhere. Distant, it is boundless; near, it is unfathomable. Vast, it encompasses all; subtle, it enters all. It weaves the cosmos and moistens even the hairs. Guarding it brings clarity and emptiness; awakening to it brings spiritual illumination. It is serene and unchanging, free from restlessness and clamor. It abides eternally, unobstructed and freely flowing. Though kalpas pass, it remains unaltered, serving as a model for all ages. It can preserve spirit, guard the body, govern the state, and attain immortality.\n\nThe Dao, the scriptures, and the master are the common path for all. They suppress evil and promote good, serving as precepts for humans and devas. The body, spirit, and life are the wondrous treasures of existence. Returning to the origin and transforming through the root, they are the foundation of sagely perfection. The body is a temporary vessel, formed by the congealing of essence and qi, returning to emptiness and quiescence. Spirit is a lodging, abiding where the Dao moves and life endures, returning to constancy. Life arises spontaneously, sustained by food and breath, returning to the multitude. Sin and fortune, good and evil, fortune and misfortune arise accordingly. All forms undergo birth and transformation, shifting and floating in emptiness, unable to endure. They return to the Dao, the scriptures, and the master—like a child returning to its mother, like all things relying on the earth. Precepts must not be lost even for a moment.\n\nHeaven, without this Dao, cannot revolve;\n\nEarth, without this Dao, cannot bear and nurture;\nSun and moon, without this Dao, cannot shine and illuminate;\nYin and yang, without this Dao, cannot generate and transform;\nGhosts and spirits, without this Dao, cannot perceive clearly;\nRulers and leaders, without this Dao, cannot govern and order;\nDaoists, without this Dao and its precepts, cannot abide in constancy.\nThe threefold Dao is divinely wondrous—long life may be preserved.\n\nThe Most High Lord of the Great Dao bows his head and addresses the Heavenly Worthy, saying: \"May this Dao be taught to all heavenly and human beings.\"\nThereupon, fragrant incense of a hundred harmonies is burned, the grand music of the celestial spheres is played, the perfected ones scatter flowers, and all the heavens assemble. The men and women are commanded to prostrate themselves and receive the Three Refuges and Precepts.\n\nThe first precept: take refuge in the Most High, Boundless Great Dao;\nThe second precept: take refuge in the thirty-six divisions of the venerable scriptures;\nThe third precept: take refuge in the Great Dharma Master of the Mysterious Center.\n\nThe Heavenly Worthy says: \"The Three Refuges are the pivot of heaven and earth, the root of divine immortals, the first gate of practice, the primal sign of establishing the mind. They circulate qi, awaken the numinous, and enter the principle in profound obscurity. They encompass all that has form and unite the body with what lies beyond. Those who uphold them receive the joyful blessings of heaven, earth, and the divine spirits. Their wisdom and intellect are opened, their ears and eyes are clear, and all things hold them in awe. Their six viscera are harmonious and joyful, the perfected ones protect them, and they become parents to all beings. They endure through the ages without loss, and humans and spirits commune in peace.\"\n\n**Disciples’ Observance of Precepts and Rituals Toward Their Masters**\n\nWhen a disciple parts from the master for a month, they must don their cap and sash, hold a tablet, and inquire after the master; they may not wear plain clothes.\nWhen a disciple parts from the master for a night, they must bow and kneel in reverence; upon returning, the same is observed.\nA disciple may not refer to themselves as \"disciple\" in the master’s presence; all speech must use their own name.\nWhen a disciple approaches the master, they may not sit without permission; they may sit only when bidden.\nA disciple may not address the master as \"Daoist\"; they must always call them \"my master.\"\nA disciple may not violate the master’s name taboo; if questioned, they must answer in a low voice.\nA disciple may not act rudely toward the master; officials on both sides are charged with oversight.\nIf a disciple sees the master commit a fault, they must admonish them in a secluded place while kneeling; they may not speak of the master’s faults or shame before others.\nWhen a disciple speaks with the master, they may not raise their voice or speak loudly.\nWhen a disciple shares a room with the master, they may not lie down first or rise later.\nWhen a disciple eats with the master, they may not begin eating before the master or stop after the master.\nWhen a disciple greets the master, they must do so according to their rank, wearing their cap and robe, holding a tablet; they may not approach casually in plain clothes.\nWhen a disciple follows the master in daily life, they must always be humble and reverent; they may not be without respect even for a moment.\nWhen a disciple serves a master who is younger than themselves, they must still show reverence, treating the master as they would an official of two thousand bushels or their own parents. They may not rely on their own seniority or nobility to slight the master, for the consequences are grave, as set forth in the *Mingzhen Ordinances*.\nWhen a disciple sits with the master and the master rises or moves, the disciple must stand at once; they may not remain seated in comfort.\nIf a disciple has not yet received the precepts and is of equal rank in qi or senior in age, or is a relative such as a brother, nephew, or descendant, and later seeks to receive the precepts from the master, they must still be humble and reverent, addressing the master by name in all speech; they may not act as they normally would.\nA disciple may not serve as master to one with whom they share mourning garments of coarse hemp. The reason is this: when receiving the precepts, one bears witness for three generations of ancestors and seven generations of parents, who come to oversee their descendants’ reception. If the covenant is violated, the nine generations of ancestors suffer punishment, and calamity befalls the one who received the precepts.\nA disciple may not harbor anger, resentment, or hatred toward the master; the penalties are set forth in the *Scripture of Illuminating the Perfected*.\nWhen a disciple seeks the Dao and its methods from the master, they must don their cap and sash, hold a tablet, and humbly entreat; they may not approach casually.\nWhen a disciple has been apart from the master for a year, on the first day of each month they must don their cap and sash, hold a tablet, bow three times, kneel, and inquire after the master. After the greeting, they bow twice more, completing five bows. The same is observed upon parting, so that each may remember clearly.\nA disciple may not argue with the master or act with careless disdain.\nWhen a disciple serves the master, they must always be reverent; they may not be arrogant or discourteous. The penalties are set forth in the *Scripture of Illuminating the Perfected*; all should take heed.\nA disciple may not contend with the master over merit or fame, nor lack a mind of deference.\nWhen a disciple approaches the master, they must inquire about what they have received; they may not discuss private or base matters.\nWhen a disciple serves the master and the master returns from a journey, the disciple must go to meet them according to the distance; they may not remain seated in comfort. When walking with the master, the disciple may not tread on the master’s shadow; they must be cautious.\nWhen a disciple sits with the master, they may not accept others’ bows, for there is no second seat of honor.\nA disciple may not secretly act with malice or harbor resentment toward the master.\nWhen a disciple goes out or undertakes any task, they must first consult the master; they may not act on their own.\nWhen a disciple serves the master, they must be loving, faithful, and sincere; they may not waver or harbor divided loyalty.\nA disciple may not steal from or reveal the contents of the master’s vessels or cases, nor violate the master’s prohibitions; the ordinances impose penalties for such offenses.\nA disciple may not betray or oppose the master; they must be cautious, as the *Scripture of Illuminating the Perfected* makes clear.\nWhen a disciple is with the master, they may not spit or snort to the sides; they must be cautious.\nWhen a disciple attends the master in the presence of guests, they must stand to the master’s left or right; they may not sit arrogantly or act no differently from common folk. To do so is to commit unfilial impiety; they must be cautious.\nWhen a disciple receives the master’s teachings and later achieves profound virtue and is revered by others, they must remain humble and remember their original master, never forgetting their prior kindness.\nA disciple may not casually sit in the master’s bed or seat; the spirits swiftly take note of such transgressions.\n\nHere follows the translation:\n\n---\n\nThe above are the thirty-six precepts for disciples serving their masters.\n\n*Three Caverns Precepts, Scroll One* concludes.\n*Three Caverns Precepts, Scroll Two*\nCompiled by Daoist Zhang Wanfu of the Great Clarity Abbey in the capital\n\n**Precepts of the First Covenant of the Numinous Treasure, Closing the Six Passions**\n\nThe First Precept: Let the eyes not wander in broad gazing, nor be distracted by manifold hues, lest the pupils be lost and sight dimmed, the light no longer bright and clear.\n\nThe Second Precept: Let the ears not indulge in chaotic hearing, nor be confounded by the five tones, lest the spirit be harmed and rightness undone, evil sounds and wailing arise.\n\nThe Third Precept: Let the nose not seek out diverse scents, nor be tainted by foul and rank qi, lest turbidity arise and the form lose its purity and uprightness.\n\nThe Fourth Precept: Let the mouth not crave rich flavors, nor be stained by fatty and pungent fare, lest the five spirits be sullied and the organs and viscera swell and rupture.\n\nThe Fifth Precept: Let the hands not commit evil deeds, nor steal the belongings of others, nor covet profit for oneself, lest calamity come unawares.\n\nThe Sixth Precept: Let the heart not cling to desires, nor agitate the five spirits, lest essence be harmed, qi dissipated, and the body fall into confusion and delusion.\n\nThe Heavenly Worthy declares: These six precepts address the great afflictions of the body.\nIn future lives, though one may be born male or female in human form, if the six passions remain impure, the scriptural teachings unseen, the Dharma-sound unheard, the form unaware of itself, one will sink into the gates of transgression, leading to a foreshortened life, failing to complete the allotted years, and dwelling long in evil destinies—how pitiable indeed!\nThus are these precepts expounded to deliver gods and humans. With a faithful and devout heart, single-mindedly take refuge, reverently uphold the sagely teachings, and close the gates of evil. Then the form will enter emptiness, the six penetrations and wisdom will arise, the six passions will be at peace, the spirit will be serene, qi will be harmonious, essence will be secure, and life will be long and enduring, never perishing.\n\nWanfu says: The six passions are the gates of defilement and the source of bodily ruin. Therefore, in holding the precepts, one must first restrain the six passions. When the six passions are at peace, the spirit and the Dao return as one.\nThus, when scholars first enter the Middle Vehicle, they must first close the six passions before gradually ascending to the One Dao.\nThis is the proper sequence; those who understand will reflect upon it.\n\n**Three Precepts**\n\nThe Scripture states: Those who study wondrous essence, mysterious transformations, divine changes, and the manifold arts of the Great Dao must purify themselves and fast, recite and practice the pure precepts, thoroughly comprehend their meaning and intent, move and rest in communion with the spirits, diligently practice the good Dao, meticulously attend to wondrous matters, carefully weigh merit and transgression, and never give rise to delusion or falsehood. With a clear and settled mind, and the precepts and practices complete, only then may one practice the Dao, so that the heart’s intent aligns with the spoken word.\nThose who fail to cultivate this will confuse humans and spirits, destroy themselves and mislead others. To practice the Dao is to benefit both self and others; thus, one must be cautious, never trifling or boasting of the Dao to others.\nNor should one harm others for personal gain. One must uphold these precepts to restrain oneself.\n\nThe First Precept: Clearly discern causes and conditions; do not forget the root while chasing the branches.\n\nThe Second Precept: Carefully guard against self-interest; do not seek benefit for oneself at the expense of others.\n\nThe Third Precept: Diligently practice and cultivate; do not blend with the vulgar and lose the true.\n\nThe above Three Supreme Precepts are practiced by the Supreme Sovereign, upheld by the Celestial Thearchs, and cultivated by superior scholars. Those who practice and uphold them without breach will unite with the three qi of the correct spirits. Body and spirit will become one, undivided, attaining the Dao and abiding forever—this is called the Supreme One.\nThose who do not practice these precepts but wear talismans and texts will labor in vain without effect; they are not disciples of the Supreme One.\n\n**Five Precepts**\n\nThe Scripture states: The Thearch Haoying addressed the Yellow Thearch, saying: \"I received the essential precepts of the multitude of scriptures from the Supreme Lord Lao, and through diligent practice, I attained my present state. The Dharma should be disseminated to exhort and transform future generations; it must not be concealed or cut off from posterity.\nOnly when the heart is refined can one attain long life. It is fitting to broadly proclaim these precepts to achieve the merit of universal salvation.\"\n\nThe Yellow Thearch bowed his head and prostrated himself twice, receiving the decree and vowing to comply.\n\nThe First Precept: Let the eyes not covet the five colors; vow to cease killing and study long life.\n\nThe Second Precept: Let the ears not covet the five tones; wish to hear the good and follow without delusion.\n\nThe Third Precept: Let the nose not covet the five qi; use ritual incense to dispel worldly impurities.\n\nThe Fourth Precept: Let the mouth not covet the five flavors; practice embryonic breathing and renounce evil speech.\n\nThe Fifth Precept: Let the body not covet the five adornments; engage in diligent labor to accord with the Dao.\n\nThe above Five Precepts: The Five Elder Thearchs each dispatch twenty-five spirits to guard the bodies of those who receive and uphold them, freeing them from disasters and extending their years, bringing peace to the nation and the household, and delivering all beings.\nAt the time of transmission, follow the method of the Three Precepts. The Three Precepts summon the three qi of the Primordial Origin and the Celestial Worthy of Primordial Beginning, while the Five Precepts extend the five qi of benevolence, propriety, trust, righteousness, and wisdom. Three and five make eight, pervading all without omission. Refine and perfect them, and all things, great and small, will be complete.\n\n**Eight Precepts**\n\nThe Supreme One states: All precepts and disciplines should be practiced together. Among them, urgency and ease, complexity and simplicity, loftiness and humility each have their significance. In accordance with the standards of the Primordial Origin, transformations generate numbers, and stages gradually complete one another. Three, five, eight, nine, ten, a hundred, a thousand, ten thousand—though one may adapt to what is fitting, none may be omitted.\nThose who know to turn toward the correct Dharma and cultivate long life without death, having already integrated the Three and Five Precepts, should receive the Eight Precepts.\n\nFirst: Resolve the five phases and cultivate the five virtues.\n\nSecond: Practice the five affairs without fail.\n\nThird: Harmonize the eight correct principles; act and withdraw in accord with the seasons.\n\nFourth: Clearly discern the five celestial stems and abide together with qi.\n\nFifth: Carefully examine the Imperial Ultimate; let above and below be in harmony.\n\nSixth: Cultivate the three virtues and await the assembly of the Three Clarities.\n\nSeventh: Resolve doubts and transform the false into the true.\n\nEighth: Examine and verify, dispel misfortune and summon blessings, refine the ordinary and ascend to sageliness, never failing the Three Honored Ones.\n\nThe above Eight Precepts must be upheld in full. If one transgresses and breaks them, one must repent, confess one’s faults, reform one’s intentions, and resolutely guard against future lapses.\nAfter practicing them for three years, the good spirits of the eight directions will gather to protect one.\n\nAfter six years, one is safeguarded from the Six Adversities. The Six Adversities are: misfortune and premature death, constant suffering from illness, perpetual anxiety, accumulated hardship and poverty, repulsive appearance, and frailty with no recourse.\n\nAfter eight years, one perpetually enjoys the Five Blessings. The Five Blessings are: longevity, wealth and honor, health and peace, love of virtue, and a timely end.\n\nRefining existence into non-existence, one naturally recognizes past lives. After nine years, spiritual penetrations arise, and one transcends the ordinary to attain sageliness.\n\n**Three Essential Writings**\n\nThe Scripture states: For those who aspire to learning, whose strength is yet insufficient, excessive knowledge leads to failure, and indolence invites calamity. A good teacher illuminates what the disciple can bear, gradually imparting knowledge according to their capacity, fostering daily progress through inspired effort. First, set aside complex precepts and reveal the essential formulas. All scriptures and methods are to be practiced in due order, and as merits accumulate, natural mastery arises. Mastery originates from essentials, and there are three essential formulas.\n\nThe first is called *Cause*. From the beginningless past, the knowing nature persists. The spiritual essence is indestructible; suffering in death remains, while joy in life lacks mechanism. One who does not recognize cause will surely not resent Heaven, blame others, fault things, or lament the body. Accepting suffering and joy as they come, one avoids delusion.\n\nThe second is called *Condition*. Following cause through movement and stillness, harmonizing inner and outer, one neither encroaches upon others to benefit oneself nor entraps oneself to mislead others. Though diminished, one remains unharmed; though benefited, one causes no injury. Recognizing root and branch, one avoids perverse doubts.\n\nThe third is called *Diligence*. Guarding the heart and mouth with care, strictly commanding the body and spirits, one seeks the sagely, inquires earnestly, receives teachings, and obeys them. One expands good conditions and severs evil causes. With right vision, the disciple advances without retreat, does not defy the teacher to act on one’s own, does not blindly follow superficial trends, does not grow arrogant or indolent to disrupt the community, does not obstinately oppose the multitude, does not conceal truth to display falsehood, and does not begin without finishing.\n\nBy long remembering these three formulas, one delivers others and benefits oneself. The divine scribes of the Three Sovereigns will naturally appear in form, serving and aiding one, communicating with true spirits, refining the ordinary into sageliness, and transforming the coarse into the refined. Without knowing these three, one will never attain the Dao.\n\n**Eight Defeats**\n\nThe Scripture states: In purification, order and discipline are urgent. Urgency lies in ordering and disciplining body and mind. When body and mind are ordered and disciplined, one is preserved from disorder and defeat.\n\nDefeat arises from many sources, but its major forms are eight:\n\n1. Killing to sustain oneself,\n2. Stealing from others to supply oneself,\n3. Taking pleasure in lust,\n4. Deceiving others with false speech,\n5. Indulging in wine to one’s whim,\n6. Reclining on high, broad, and grand beds,\n7. Competing in the use of fragrant oils and ornate adornments,\n8. Delighting in singing and dancing performances.\n\nNoble persons and those who study the sagely and true immortals do not engage in these eight acts. Thus, the Eight Defeats cannot arise. When the Eight Defeats do not arise, the Eight Accomplishments naturally stand. Once established, they are not lost, prolonging life and preserving destiny. Spiritual penetrations become thorough, and the verification of truth through practice and cultivation is swift.\n\n**Three Essentials**\n\nThe Heavenly Sovereign said: The first essential is to first seek longevity; the second essential is to conceal one’s form; the third essential is to avoid worldly glory.\n\n**Thirteen Prohibitions**\n\nThe Immortal said: Those who wish to prolong life and attain longevity must avoid the following prohibitions.\n\nProhibit ejaculation, or life will be cut short;\nProhibit overeating, or qi and vessels will be blocked;\nProhibit excessive drinking, or the bladder will be strained;\nProhibit extreme heat, or marrow and bones will be consumed;\nProhibit extreme cold, or muscles and flesh will be harmed;\nProhibit cold food, or illness and stagnation will arise;\nProhibit coughing and spitting, or bodily fluids will be lost;\nProhibit prolonged gazing, or the eyes will dim;\nProhibit prolonged listening, or hearing will be obstructed;\nProhibit prolonged weeping, or the spirit will grieve;\nProhibit sudden shouting, or the soul will be startled;\nProhibit internal brooding, or the mind will be distracted;\nProhibit anger and resentment, or the spirit will be displeased.\n\n**Seven Hundred Twenty Essential Precepts**\n\nThe Scripture states: The seven hundred twenty essential precepts are treasures of the heavens, transmitted orally and worn on the body, not recorded in scriptures. If one has not yet met a teacher, one should ingest talismans to elicit a response, summoning the spirits to descend and receive them.\n\nFrom the beginningless past, people have possessed consciousness in the heart. The heart’s consciousness is restless, changing in an instant—swifter than a team of horses passing a crack, slower than clouds drifting between lightning flashes. The heart’s goodness and evil shift unpredictably; among all urgencies, none is as swift as the heart’s. The heart is harder to restrain than tigers and leopards; monkeys, apes, deer, and horses are all easier to control. Among all things, the heart is the most difficult to master. Only the highest sages can skillfully guide the heart. Middle and lower sages and true immortals constantly struggle with the heart, examining within and observing without day and night, ever fearful of transgression and the dissipation of spirit. Once the spirit scatters, it cannot be retrieved; once the body falls, how can it be restored? To preserve the body from falling and the spirit from scattering, to attain longevity and become a divine immortal, ascending to the rank of the highest sages—this depends on pure purification.\n\nPurification has many levels. The five emotions and six desires surge and compete, inner and outer falling out of alignment, leading to confusion and disorder. Turning from the correct to the perverse, abandoning root for branch, deceiving the unseen and the seen, one invites judgment and sinks into the Nine Springs’ abyss, where myriad torments await, and liberation is without term—all due to the failure to purify.\n\nThose who aspire to learning must urgently practice purification. In purification, aligning the heart is primary, and upholding precepts is the foundation. The foundation restrains the heart; when the heart is settled, life arises. Forgetting precepts and losing the foundation, the heart becomes chaotic, and death follows. Seeking life within death, seeking immortality within life—all must involve pure purification and the recitation and practice of precepts.\n\nAs emotions and desires multiply, precepts become boundless. The boundless dharma gates were established by the many sages to guide and lead all beings, enabling their entry. Each has its proper place, differing among the heavens, with times for action and concealment, varying across ages. In general, they are not disparate; all share in common the seven hundred twenty gates, which are the most wondrous and supreme. Those who uphold them in full attain the ultimate Dao, enabling transformations across seventy-four directions. The nine heavens each have eight, and eight times nine is seventy-two. From above to below, they total seventy-four directions.\n\nThose who cannot uphold the precepts—or uphold them incompletely—vary in their stages and ranks, and their transformations differ accordingly. With differing transformations, they cannot avoid accumulating afflictions; thus, the supreme sages command their full observance.\n\nAll sentient beings possess the Three and the Five, yet these vary in measure. The foolish and the wise differ, each leading and encompassing the other, restraining and elevating in mutual dependence. Once the first consciousness stirs, countless impulses arise without end. To guard the One is impossible; one must directly address the Three and the Five. Interwoven and mutually sustaining, the Three Qi flow and circulate, the Eight Assemblies lend support, the Great One traverses, and the Nine Palaces achieve completion. The One Source is the root; the Nine Transformations are the branches. With root and branches established, the Nine and the One reside as the essence. The root guides the branches; the branches return in harmony to the source. The One Source responds to the branches; when the branches’ sensations stir, the root remains eternally quiescent. Quiescence responds to all movements—movement is called \"external arising.\"\n\nWhat arises externally is movement; what abides internally is quiescence. Quiescence and movement meet midway, sharing both difference and sameness. Sameness moves to dispel departure; difference rests to aid arrival. Arrival does not disturb quiescence; departure does not exhaust movement. Movement without exhaustion does not depart from quiescence; quiescence without disturbance does not doubt movement. Quiescence illumines with clarity, thus free from disturbance and doubt; movement arises gradually, thus free from labor and separation. Free from labor and separation, one constantly unites with long life; free from disturbance and doubt, one abides in eternal joy. Abiding without abiding, acting without acting—this is the highest of the Dao.\n\nThe original One, through division and transformation, becomes multiplicity. Eight and nine revolve, multiplying and accumulating into gates—seven hundred and twenty in all. A gate is pattern, principle, and return. Dispersed and scattered, one responds and returns; return and cultivation proceed through pattern. Attaining the gate enables entry, yet one has not yet returned to the source. Initially coarse and manifold, with practice the conditions refine and diminish. The many and the few incline toward one another, supplementing and interpenetrating. As perception and awakening unfold, the gate becomes increasingly discernible. With long-cultivated goodness and courageous vigor, one swiftly attains the goal. For those who have not yet attained swiftly, the passage of kalpas is boundless. In general, transformation entails relinquishing the old and embracing the new. Astonishing to hear and wondrous to behold, this occurs within the seven hundred twenty gates. Accumulating through eight and nine, refining to the utmost, the seven hundred twenty merge as one.\n\nTo guard the One without loss is difficult; to practice it without firmness is arduous. Thought follows thought without pause; even a moment’s lapse invites deviation. Deviation invites obstruction; obstruction veils the correct. Veiled, the gate is blocked; blocked, one’s vision becomes deluded. Delusion leads to suffering; at suffering’s extremity, one yearns to return. The spirit of perception stirs, awakening suddenly. One strengthens one’s thought, thought following thought in unbroken succession. Through accumulation over time, the One Qi permeates the body. Body and spirit become thoroughly pervaded; the eight and nine shine clearly. Transformations become boundless, arising from awakening to guarding the One. Guarding the One requires support—nothing is more urgent than the precepts. Upholding them without deficiency prevents deviation from entering. With deviation barred, the correct qi draws near. Intimacy deepens over time, naturally merging into oneness, uniting with the Dao in truth. The fruition of precept-support is attained; through precepts, one enters the Dao—hence they are called the gate. Those of refined aspiration and sincere devotion follow accordingly.\n\nMaster Wanfu said: The human mind is not one; perception may be dim or bright. The wondrous Dao is without fixed form; spiritual transformation is difficult to fathom. A bright mind awakens to the Dao; a dull spirit strays from truth. The mind attains clarity through quiescence; the spirit falls into chaos through movement. Chaos loses the Dao; clarity unites with truth. Thus, guarding the correct and dispelling deviation prevents delusive thoughts from arising. Turning from brightness toward darkness, evil thoughts arise. Good and evil arise not from another—truly, they are self-created. Delusion and awakening lie within oneself, not dependent on others. Therefore, the Great Sage Heavenly Worthy, in vast compassion, transforms beings with skillful means, guiding all without exception. Establishing boundless dharma gates, he gathers all, administering medicine according to need, dispelling the illnesses of the multitude. Universally exhorting practitioners, he commands all to uphold the precepts.\n\nPrecepts are of many kinds, with gates great and small. Ultimately, they converge at the root, equally accomplishing the correct Dao. Yet the Three, Five, Six, and Eight differ gradually or suddenly. Once perception and awakening are clear, one ultimately upholds the One Precept. The One Precept is simply to restrain the mind from arising in other thoughts—this is what is meant by \"guarding the One without loss, thought following thought without pause.\" Scholars should reflect deeply and practice accordingly.\n\nThe Lower Scroll of the Precept Texts of the Three Caverns concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "三洞众戒文 经名：三洞众戒文。 原题张万福编录。 二卷。 底本出处：《正统道藏》洞真部戒律类。 三洞众戒文序 三洞弟子京太清观道士张万福编录 万福伏按三洞诸经，说戒多矣，难以具详。 学道求真，莫不先持斋戒。 故灵宝升玄步虚章云：皆从斋戒起，累功结宿缘。 又太极左仙公云：学道不修斋戒，亦徒劳山林矣。 由是详之。 夫戒者，戒诸恶行，防众行之最，若不持戒，道无由得，然道经不师受，则行之不神。 三洞科仪，备有条格，而师资禀训，各据一门，吴蜀京都，相承或异，良以教戒，须渐顿悟。 人有贤愚，设法随机，要存合道。 恐局见之徒，妄生疑惑，其传授经法次第，已如三洞法目。 今又依经，箓出戒文，附诸法次，受法之日，随法转授，令道士诵习，防非止恶，以制六情，进品上仙，远超三界，自浅之深，非无优劣，从凡入圣，各有等差。 聊举大纲，庶通玄觉，即始起心入道，受三归戒； 箓生，五戒、八戒； 在俗男女，无上十戒； 新出家者，初真戒； 正一弟子，七十二戒； 男官、女官，老君百八十戒； 清信弟子，天尊十戒、十四持身品； 五千文金纽，太清阴阳戒； 太上高玄法师，二十七戒； 洞 神，三道要言、五戒、十三戒、七百二十戒门； 升玄内教，百二十九戒； 灵宝初盟，闭塞六情戒； 中盟，智慧上品大戒； 大盟，三元百八十品戒； 上清，智慧观身二百大戒。 凡受法，各授法服，宣示法服科戒，简授法位，乃授天尊要戒，及劝戒三日后，设斋谢恩，授三师名讳形状，居观方所，并具之于左。 右与所授经法，同时书写，虽具在经中，临事披览难见也。 三洞众戒文卷上 始起心入道三归戒文出太玄部 元始天尊告太上大道君曰：夫道寞而无也，动而有也，布炁行神，众兆生也，抱一含元，虚无空寂，文应象成，包真吐精，禀识作状，回黄化青，乘机赴会，缘感物情，吾故告汝，塞耳心听。 道者，众物祖首，至无生神，造化天地、日月、山川，流精散炁，无所不之，远而莫极，迩难得穷，大无不包，细无不入，经纬宇宙，润洽毛发，守之清虚，悟之神明，淡泊不渝，躁聒勿哗，常在不亡，虚通无阂，载劫讵易，永世为范，可以保神，可以守身，可以治国，可以得仙。 道、经、师者，众常通也，抑恶举善，戒人天也。 身、神、命者，生妙宝也，回元转化，根圣真也，身权假也，精构炁凝，归於虚寂，神附托也，道行生存归於常，命自来也，饮食呼吸归於众，罪福缘对，善恶吉凶从之兴，群形生化，变幻浮虚，不可保久，归之於道、经、师。 若赤子归母，众物依地，不可须臾失戒。 天不用此道，不能运行；",
      "translated_text": "**The Precepts for the Three Caverns**\n*Scripture Title:* *The Precepts for the Three Caverns*\nOriginal compiler: Zhang Wanfu. Two fascicles.\nSource text: *Daoist Canon of the Zhengtong Era*, Cavern of Perfection Section, Precepts and Disciplines Category.\n\n**Preface to *The Precepts for the Three Caverns***\nCompiled by Zhang Wanfu, Daoist of the Great Clarity Abbey in the capital\n\nWanfu respectfully observes: The Three Caverns contain many scriptures expounding precepts, too numerous to detail in full. Those who study the Dao and seek truth invariably begin with fasting and precepts. Thus, the *Lingbao* *Ascending Mystery, Pacing the Void* states: \"All arise from fasting and precepts, accumulating merit to bind past karmic ties.\" The Left Immortal of the Supreme Ultimate also says: \"To study the Dao without cultivating fasting and precepts is but vain toil in the mountains and forests.\" From this, the matter is clear.\n\nNow, precepts restrain all evil conduct and serve as the foremost defense among all practices. Without upholding precepts, the Dao cannot be attained. Yet if the scriptures of the Dao are not transmitted by a master, their practice lacks spiritual efficacy. The liturgical codes of the Three Caverns provide comprehensive regulations, but masters and disciples, each adhering to their own tradition, differ in transmission across Wu, Shu, and the capital. This is because teachings and precepts require gradual or sudden awakening. People vary in wisdom; methods are adapted to their capacity, yet all must accord with the Dao.\n\nI fear that those of limited vision may rashly generate doubts. The sequence of transmitting scriptures and methods has already been outlined in *The Catalog of the Three Caverns*. Now, following the scriptures, I have extracted the precept texts and appended them to their respective methods. On the day of transmission, they are conferred in accordance with the method, enabling Daoists to recite and practice them, preventing wrongdoing and restraining evil, governing the six senses, advancing in rank to become Perfected Immortals, and transcending the Three Realms. From shallow to profound, distinctions exist; from mortal to sage, each has its gradations.\n\nHere, I briefly present the main outline to facilitate awakening to the mystery:\n- For those beginning to awaken and enter the Dao: the Three Refuges Precepts;\n- For registered disciples: the Five Precepts and Eight Precepts;\n- For laymen and laywomen: the Supreme Ten Precepts;\n- For newly tonsured: the Initial Perfection Precepts;\n- For Orthodox Unity disciples: the Seventy-Two Precepts;\n- For male and female officials: the One Hundred Eighty Precepts of Lord Lao;\n- For devout disciples: the Celestial Worthy’s Ten Precepts and Fourteen Rules for Conduct;\n- For the *Five Thousand Characters* and the Golden Seal: the Yin-Yang Precepts of the Great Clarity;\n- For High Mystery Masters of the Supreme: the Twenty-Seven Precepts;\n- For the Cavern of Divinities: the *Three Essential Sayings*, the Five Precepts, the Thirteen Precepts, and the Seven Hundred Twenty Gates of Precepts;\n- For the Inner Teachings of Ascending Mystery: the One Hundred Twenty-Nine Precepts;\n- For the Initial Alliance of Numinous Treasure: the Precepts for Closing the Six Senses;\n- For the Middle Alliance: the Upper Grade Precepts of Wisdom;\n- For the Great Alliance: the One Hundred Eighty Precepts of the Three Primes;\n- For the Highest Clarity: the Two Hundred Great Precepts of Wisdom and Contemplating the Body.\n\nFor all transmissions, each is conferred with the ritual vestments. The codes and precepts for the vestments are proclaimed, the rank of the method is briefly conferred, and then the essential precepts of the Celestial Worthy are transmitted. After three days of admonitions, a fast is held to give thanks. The names and appearances of the Three Masters, along with the location of the abbey, are all recorded to the left.\n\nThese are written simultaneously with the transmitted scriptures and methods. Though they are all contained within the scriptures, consulting them at the time of transmission is difficult. Thus, they are presented here.\n\n---\n\n**The Precepts for the Three Caverns, Fascicle One**\n**The Three Refuges Precepts for Beginning the Aspiration to Enter the Dao**\n*From the Supreme Mystery Section*\n\nThe Primordial Celestial Worthy addressed the Celestial Worthy of the Great Dao, saying: The Dao is vast and formless, yet in motion, it takes form. It spreads qi and moves spirit, giving birth to all beings. Embracing the One and containing the Origin, it is emptiness and quiescence. Patterns respond and images coalesce; it enfolds truth and emits essence. Endowed with perception, it shapes forms, transforming yellow into green. Riding the moment, it attends to encounters, responding to the feelings of things. Therefore, I tell you: close your ears and listen with your heart.\n\nThe Dao is the origin and head of all things, the unborn and spiritually generative. It creates and transforms heaven and earth, sun and moon, mountains and rivers. It flows essence and disperses qi, reaching everywhere. Distant, it is boundless; near, it is unfathomable. Vast, it encompasses all; subtle, it enters all. It weaves the cosmos and moistens even the hairs. Guarding it brings clarity and emptiness; awakening to it brings spiritual illumination. It is serene and unchanging, free from restlessness and clamor. It abides eternally, unobstructed and freely flowing. Though kalpas pass, it remains unaltered, serving as a model for all ages. It can preserve spirit, guard the body, govern the state, and attain immortality.\n\nThe Dao, the scriptures, and the master are the common path for all. They suppress evil and promote good, serving as precepts for humans and devas. The body, spirit, and life are the wondrous treasures of existence. Returning to the origin and transforming through the root, they are the foundation of sagely perfection. The body is a temporary vessel, formed by the congealing of essence and qi, returning to emptiness and quiescence. Spirit is a lodging, abiding where the Dao moves and life endures, returning to constancy. Life arises spontaneously, sustained by food and breath, returning to the multitude. Sin and fortune, good and evil, fortune and misfortune arise accordingly. All forms undergo birth and transformation, shifting and floating in emptiness, unable to endure. They return to the Dao, the scriptures, and the master—like a child returning to its mother, like all things relying on the earth. Precepts must not be lost even for a moment.\n\nHeaven, without this Dao, cannot revolve;",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1019,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.65316343307495,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\三洞众戒文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "地不用此道，不能载植； 日月不用此道，不能明照； 阴阳不用此道，不能生化； 鬼神不用此道，不能彻视； 君长不用此 道，不能治理； 道士不用此道戒，不能常在，三道神妙，长生可守。 太上大道君稽首上白天尊曰：愿以此道，教诸天人。 於是焚百和宝香，奏钧天广乐，众真散花，诸天齐到，命诸男女伏受三归依戒。 第一戒者，归身太上无极大道； 第二戒者，归神三十六部尊经； 第三戒者，归命玄中大法师。 天尊曰：三归戒者，天地之枢纽，神仙之根柢，发行之初门，建心之元兆，运炁启灵，冥真入理，包罗有象，联形无外。 持之者，天地神明，庆快心智，耳目开张，万物敬畏，六府和乐，众真卫护，群生父母，长世不遗，人神交泰。 弟子奉师科戒文 弟子别师经月，皆冠带执简问讯，不得白服。 弟子别师经宿，皆礼拜长跪，还亦如之。 弟子不得向师称弟子，言皆称名。 弟子诣师，不得专辄而坐，命坐方坐。 弟子不得唤师作道士，皆云家师。 弟子不得犯师名讳，若人问 不止，下声答之。 弟子不得唐突师，左右皆有司察之官。 弟子见师有过失，当於深隐处长跪谏之，不得在人前言师是非丑鄙。 弟子与师言，不得高声大语。 弟子与师共室，不得先卧在后起。 弟子与师同食，不得在师前食听在前止。 弟子问讯师，皆当随其所受高下，巾褐执简，不得趣尔白服。 弟子随师起居行止，皆当谦卑恭敬，不得斯须无敬。 弟子事师，师年少，弟子年高，弟子皆应恭敬，譬如官长二千石、父母同等，不得自恃高贵，轻忽於师，其关不小，具在《明真科》。 弟子与师同在席坐，师若起动行止，弟子即须倚立，不得安然端坐。 弟子先未受法戒，或炁类齐等，或复耆年，或是姓从兄弟子孙，后诣师受法，皆须谦卑恭敬，言皆称名，不得比常。 弟子与师亲服总麻者，皆不得相为师，所以尔者，受法，皆证三曾七祖父母，来监临子孙所受，若违盟，九祖受考，殃及受法之身。 弟子不得忿嫉责怒师主，及怀恨在心，罪科具出《明真经》。 弟子诣师请道法， 皆当冠带执简，谦苦求请，不得趣尔。 弟子与师别经年，月朔皆冠带执简，礼三拜长跪，问讯讫，复再拜，合成五拜，别亦如之，明各识焉。 弟子不得与师争口，忽忽哂意。 弟子事师，皆当恭敬，不得傲慢无礼，罚在《明真经》中，宜各慎之。 弟子不得与师争竞功名，无有推让之心。 弟子诣师，当请问所受，不得论及私鄙。 弟子事师，师若远行还，弟子皆当随路远近奉迎，不得端坐晏然，待师至，弟子与师同行，不得践师影，慎之。 弟子与师共在座，不得受人跪拜，所以尔者，座无二尊。 弟子不得阴行横勃，忿斗师主。 弟子若出入，及所营作，每先谘问於师，不得自专。 弟子事师，皆当恩爱信实，不得犹豫二心。 弟子不得窃盗、发泄师器笈中，犯师禁戒，科律得罪。 弟子不得背判师主，慎之，具在《明真经》文。 弟子与师同处，不得洟唾左右，慎之。 弟子侍从师，若值宾客，弟子侍卫师左右，不得高抗大坐，与凡俗无别，皆入不孝，慎之。 弟子受师法业，后玄德成就，为人所宗，皆当谦下，存忆本师，勿忘先恩也。 弟子事师，不得辄坐师床席处所，神司之急示也。",
      "translated_text": "Earth, without this Dao, cannot bear and nurture;\nSun and moon, without this Dao, cannot shine and illuminate;\nYin and yang, without this Dao, cannot generate and transform;\nGhosts and spirits, without this Dao, cannot perceive clearly;\nRulers and leaders, without this Dao, cannot govern and order;\nDaoists, without this Dao and its precepts, cannot abide in constancy.\nThe threefold Dao is divinely wondrous—long life may be preserved.\n\nThe Most High Lord of the Great Dao bows his head and addresses the Heavenly Worthy, saying: \"May this Dao be taught to all heavenly and human beings.\"\nThereupon, fragrant incense of a hundred harmonies is burned, the grand music of the celestial spheres is played, the perfected ones scatter flowers, and all the heavens assemble. The men and women are commanded to prostrate themselves and receive the Three Refuges and Precepts.\n\nThe first precept: take refuge in the Most High, Boundless Great Dao;\nThe second precept: take refuge in the thirty-six divisions of the venerable scriptures;\nThe third precept: take refuge in the Great Dharma Master of the Mysterious Center.\n\nThe Heavenly Worthy says: \"The Three Refuges are the pivot of heaven and earth, the root of divine immortals, the first gate of practice, the primal sign of establishing the mind. They circulate qi, awaken the numinous, and enter the principle in profound obscurity. They encompass all that has form and unite the body with what lies beyond. Those who uphold them receive the joyful blessings of heaven, earth, and the divine spirits. Their wisdom and intellect are opened, their ears and eyes are clear, and all things hold them in awe. Their six viscera are harmonious and joyful, the perfected ones protect them, and they become parents to all beings. They endure through the ages without loss, and humans and spirits commune in peace.\"\n\n**Disciples’ Observance of Precepts and Rituals Toward Their Masters**\n\nWhen a disciple parts from the master for a month, they must don their cap and sash, hold a tablet, and inquire after the master; they may not wear plain clothes.\nWhen a disciple parts from the master for a night, they must bow and kneel in reverence; upon returning, the same is observed.\nA disciple may not refer to themselves as \"disciple\" in the master’s presence; all speech must use their own name.\nWhen a disciple approaches the master, they may not sit without permission; they may sit only when bidden.\nA disciple may not address the master as \"Daoist\"; they must always call them \"my master.\"\nA disciple may not violate the master’s name taboo; if questioned, they must answer in a low voice.\nA disciple may not act rudely toward the master; officials on both sides are charged with oversight.\nIf a disciple sees the master commit a fault, they must admonish them in a secluded place while kneeling; they may not speak of the master’s faults or shame before others.\nWhen a disciple speaks with the master, they may not raise their voice or speak loudly.\nWhen a disciple shares a room with the master, they may not lie down first or rise later.\nWhen a disciple eats with the master, they may not begin eating before the master or stop after the master.\nWhen a disciple greets the master, they must do so according to their rank, wearing their cap and robe, holding a tablet; they may not approach casually in plain clothes.\nWhen a disciple follows the master in daily life, they must always be humble and reverent; they may not be without respect even for a moment.\nWhen a disciple serves a master who is younger than themselves, they must still show reverence, treating the master as they would an official of two thousand bushels or their own parents. They may not rely on their own seniority or nobility to slight the master, for the consequences are grave, as set forth in the *Mingzhen Ordinances*.\nWhen a disciple sits with the master and the master rises or moves, the disciple must stand at once; they may not remain seated in comfort.\nIf a disciple has not yet received the precepts and is of equal rank in qi or senior in age, or is a relative such as a brother, nephew, or descendant, and later seeks to receive the precepts from the master, they must still be humble and reverent, addressing the master by name in all speech; they may not act as they normally would.\nA disciple may not serve as master to one with whom they share mourning garments of coarse hemp. The reason is this: when receiving the precepts, one bears witness for three generations of ancestors and seven generations of parents, who come to oversee their descendants’ reception. If the covenant is violated, the nine generations of ancestors suffer punishment, and calamity befalls the one who received the precepts.\nA disciple may not harbor anger, resentment, or hatred toward the master; the penalties are set forth in the *Scripture of Illuminating the Perfected*.\nWhen a disciple seeks the Dao and its methods from the master, they must don their cap and sash, hold a tablet, and humbly entreat; they may not approach casually.\nWhen a disciple has been apart from the master for a year, on the first day of each month they must don their cap and sash, hold a tablet, bow three times, kneel, and inquire after the master. After the greeting, they bow twice more, completing five bows. The same is observed upon parting, so that each may remember clearly.\nA disciple may not argue with the master or act with careless disdain.\nWhen a disciple serves the master, they must always be reverent; they may not be arrogant or discourteous. The penalties are set forth in the *Scripture of Illuminating the Perfected*; all should take heed.\nA disciple may not contend with the master over merit or fame, nor lack a mind of deference.\nWhen a disciple approaches the master, they must inquire about what they have received; they may not discuss private or base matters.\nWhen a disciple serves the master and the master returns from a journey, the disciple must go to meet them according to the distance; they may not remain seated in comfort. When walking with the master, the disciple may not tread on the master’s shadow; they must be cautious.\nWhen a disciple sits with the master, they may not accept others’ bows, for there is no second seat of honor.\nA disciple may not secretly act with malice or harbor resentment toward the master.\nWhen a disciple goes out or undertakes any task, they must first consult the master; they may not act on their own.\nWhen a disciple serves the master, they must be loving, faithful, and sincere; they may not waver or harbor divided loyalty.\nA disciple may not steal from or reveal the contents of the master’s vessels or cases, nor violate the master’s prohibitions; the ordinances impose penalties for such offenses.\nA disciple may not betray or oppose the master; they must be cautious, as the *Scripture of Illuminating the Perfected* makes clear.\nWhen a disciple is with the master, they may not spit or snort to the sides; they must be cautious.\nWhen a disciple attends the master in the presence of guests, they must stand to the master’s left or right; they may not sit arrogantly or act no differently from common folk. To do so is to commit unfilial impiety; they must be cautious.\nWhen a disciple receives the master’s teachings and later achieves profound virtue and is revered by others, they must remain humble and remember their original master, never forgetting their prior kindness.\nA disciple may not casually sit in the master’s bed or seat; the spirits swiftly take note of such transgressions.",
      "overlap_context": " returning to constancy. Life arises spontaneously, sustained by food and breath, returning to the multitude. Sin and fortune, good and evil, fortune and misfortune arise accordingly. All forms undergo birth and transformation, shifting and floating in emptiness, unable to endure. They return to the Dao, the scriptures, and the master—like a child returning to its mother, like all things relying on the earth. Precepts must not be lost even for a moment.\n\nHeaven, without this Dao, cannot revolve;",
      "start_char": 1019,
      "end_char": 2247,
      "start_sentence": 43,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.28278207778931,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\三洞众戒文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右弟子奉师科戒，合三十六条。 三洞众戒文卷上竟 三洞众戒文卷下 三洞弟子京太清观道士张万福编录 灵宝初盟闭塞六情戒文 第一戒者，目无广瞻，乱诸华色，亡睛失明，光不朗彻。 第二戒者，耳无乱听，混於五音，伤神败正，恶声啼吟。 第三戒者，鼻无广嗅，杂炁臭腥，易有混浊，形不澄正。 第四戒者，口无贪味，脂熏之属，浊注五神，藏府愤溃。 第五戒者，手无犯恶，不窃人物，贪利入己，祸不自觉。 第六戒者，心无爱欲，摇动五神，伤精丧炁，体发迷荒。 天尊言：其六戒者，身之大患。 来生男女虽受人形而六情不纯，未见经教，不闻法音，形不自觉，沉迷罪门，致令短促，不竟天年，长处恶道，甚可哀怜。 故说是戒，开度天人，善心信向，一意归命，尊奉圣教，闭诸恶门，则形入虚空，六通智慧，六情恬夷，神自宁也，炁自和也，精自固也，寿命长远，终不亡也。 万福曰：六情者，染罪之门，丧身之源也，所以持戒先制六情，六情恬夷，神道归也。 故学士初入中乘，先须闭塞六情，然后渐阶一道。 故以为次，达者详之矣。 三戒文 经曰：凡学妙精、玄变神化、大道众术，当洁己清斋，诵习清戒，洞晓义趣，动静通神，勤行善道，谨密妙事，谛在功过，勿生谬妄，心识明定，戒业又全，然后行道，应心如口。 不能修此，人鬼乱壤，灭己误他，为道兼济，济物安己，慎勿戏弄，以道夸人。 又勿害他，以利於己，当持此戒，以制之也。 第一戒者，谛识因缘，勿忘本逐末。 第二戒者，谛守少私，勿利我损物。 第三戒者，谛习勤行，勿混俗失真。 右三上戒，上皇所行，上帝所奉，上士所修，修行奉持，全而不破，三炁正神，降与为一，身神又一，一无二焉，得道常存，号曰太上。 不行此戒，服佩符文，劳而无验，非太上弟子也。 五戒文 经云：帝昊英告黄帝曰：吾受太上老君众经要戒，勤行之报，得有今日，法应流布，劝化将来，不得闭塞，杜绝后生。 子心精炼，方与长生，宜广宣戒，以成兼济之功矣。 黄帝稽首再拜，奉旨遵行。 第一戒者，目不贪五色，誓止杀，学长生。 第二戒者，耳不贪五音，愿闻善，从无惑。 第三戒者，鼻不贪五气，用法香，遣俗秽。 第四戒者，口不贪五味，习胎息，绝恶言。 第五戒者，身不贪五彩，履勤劳，以顺道。 右五戒，五老帝君各遣二十五神，防护受持者身，免脱灾害，延年寿命，安国宁家，救度一切。 受授之时，依如三戒法，三戒招玄元始三炁，五戒延仁、礼、信、义、智五炁，三五为八，周有遍无，炼而精之，洪纤毕备。 八戒文 太上曰：凡诸戒律，通应共行，其间缓急、繁简、高卑，各有意义，准仪玄元，变化生数，阶渐相成，三五八九，十百千万，虽随缘所堪，亦不可越略。 知回向正法，修长生不死，三、五已参，宜受八戒。 第一，星解五行，备修五德。 第二，习五事，不可无恒。 第三，平理八正，行藏顺时。 第四，明识五纪，与炁同存。 第五，精审皇极，上下相和。 第六，修三德，期会三清。 第七，决定疑惑，化伪为真。 第八，考校征验，消祸降福，炼凡登圣，无负三尊。 右八戒，持之必全，犯破即谢，首悔责躬，改意革心，坚防后失。 行之三年，八方善神会来拥护。",
      "translated_text": "Here follows the translation:\n\n---\n\nThe above are the thirty-six precepts for disciples serving their masters.\n\n*Three Caverns Precepts, Scroll One* concludes.\n*Three Caverns Precepts, Scroll Two*\nCompiled by Daoist Zhang Wanfu of the Great Clarity Abbey in the capital\n\n**Precepts of the First Covenant of the Numinous Treasure, Closing the Six Passions**\n\nThe First Precept: Let the eyes not wander in broad gazing, nor be distracted by manifold hues, lest the pupils be lost and sight dimmed, the light no longer bright and clear.\n\nThe Second Precept: Let the ears not indulge in chaotic hearing, nor be confounded by the five tones, lest the spirit be harmed and rightness undone, evil sounds and wailing arise.\n\nThe Third Precept: Let the nose not seek out diverse scents, nor be tainted by foul and rank qi, lest turbidity arise and the form lose its purity and uprightness.\n\nThe Fourth Precept: Let the mouth not crave rich flavors, nor be stained by fatty and pungent fare, lest the five spirits be sullied and the organs and viscera swell and rupture.\n\nThe Fifth Precept: Let the hands not commit evil deeds, nor steal the belongings of others, nor covet profit for oneself, lest calamity come unawares.\n\nThe Sixth Precept: Let the heart not cling to desires, nor agitate the five spirits, lest essence be harmed, qi dissipated, and the body fall into confusion and delusion.\n\nThe Heavenly Worthy declares: These six precepts address the great afflictions of the body.\nIn future lives, though one may be born male or female in human form, if the six passions remain impure, the scriptural teachings unseen, the Dharma-sound unheard, the form unaware of itself, one will sink into the gates of transgression, leading to a foreshortened life, failing to complete the allotted years, and dwelling long in evil destinies—how pitiable indeed!\nThus are these precepts expounded to deliver gods and humans. With a faithful and devout heart, single-mindedly take refuge, reverently uphold the sagely teachings, and close the gates of evil. Then the form will enter emptiness, the six penetrations and wisdom will arise, the six passions will be at peace, the spirit will be serene, qi will be harmonious, essence will be secure, and life will be long and enduring, never perishing.\n\nWanfu says: The six passions are the gates of defilement and the source of bodily ruin. Therefore, in holding the precepts, one must first restrain the six passions. When the six passions are at peace, the spirit and the Dao return as one.\nThus, when scholars first enter the Middle Vehicle, they must first close the six passions before gradually ascending to the One Dao.\nThis is the proper sequence; those who understand will reflect upon it.\n\n**Three Precepts**\n\nThe Scripture states: Those who study wondrous essence, mysterious transformations, divine changes, and the manifold arts of the Great Dao must purify themselves and fast, recite and practice the pure precepts, thoroughly comprehend their meaning and intent, move and rest in communion with the spirits, diligently practice the good Dao, meticulously attend to wondrous matters, carefully weigh merit and transgression, and never give rise to delusion or falsehood. With a clear and settled mind, and the precepts and practices complete, only then may one practice the Dao, so that the heart’s intent aligns with the spoken word.\nThose who fail to cultivate this will confuse humans and spirits, destroy themselves and mislead others. To practice the Dao is to benefit both self and others; thus, one must be cautious, never trifling or boasting of the Dao to others.\nNor should one harm others for personal gain. One must uphold these precepts to restrain oneself.\n\nThe First Precept: Clearly discern causes and conditions; do not forget the root while chasing the branches.\n\nThe Second Precept: Carefully guard against self-interest; do not seek benefit for oneself at the expense of others.\n\nThe Third Precept: Diligently practice and cultivate; do not blend with the vulgar and lose the true.\n\nThe above Three Supreme Precepts are practiced by the Supreme Sovereign, upheld by the Celestial Thearchs, and cultivated by superior scholars. Those who practice and uphold them without breach will unite with the three qi of the correct spirits. Body and spirit will become one, undivided, attaining the Dao and abiding forever—this is called the Supreme One.\nThose who do not practice these precepts but wear talismans and texts will labor in vain without effect; they are not disciples of the Supreme One.\n\n**Five Precepts**\n\nThe Scripture states: The Thearch Haoying addressed the Yellow Thearch, saying: \"I received the essential precepts of the multitude of scriptures from the Supreme Lord Lao, and through diligent practice, I attained my present state. The Dharma should be disseminated to exhort and transform future generations; it must not be concealed or cut off from posterity.\nOnly when the heart is refined can one attain long life. It is fitting to broadly proclaim these precepts to achieve the merit of universal salvation.\"\n\nThe Yellow Thearch bowed his head and prostrated himself twice, receiving the decree and vowing to comply.\n\nThe First Precept: Let the eyes not covet the five colors; vow to cease killing and study long life.\n\nThe Second Precept: Let the ears not covet the five tones; wish to hear the good and follow without delusion.\n\nThe Third Precept: Let the nose not covet the five qi; use ritual incense to dispel worldly impurities.\n\nThe Fourth Precept: Let the mouth not covet the five flavors; practice embryonic breathing and renounce evil speech.\n\nThe Fifth Precept: Let the body not covet the five adornments; engage in diligent labor to accord with the Dao.\n\nThe above Five Precepts: The Five Elder Thearchs each dispatch twenty-five spirits to guard the bodies of those who receive and uphold them, freeing them from disasters and extending their years, bringing peace to the nation and the household, and delivering all beings.\nAt the time of transmission, follow the method of the Three Precepts. The Three Precepts summon the three qi of the Primordial Origin and the Celestial Worthy of Primordial Beginning, while the Five Precepts extend the five qi of benevolence, propriety, trust, righteousness, and wisdom. Three and five make eight, pervading all without omission. Refine and perfect them, and all things, great and small, will be complete.\n\n**Eight Precepts**\n\nThe Supreme One states: All precepts and disciplines should be practiced together. Among them, urgency and ease, complexity and simplicity, loftiness and humility each have their significance. In accordance with the standards of the Primordial Origin, transformations generate numbers, and stages gradually complete one another. Three, five, eight, nine, ten, a hundred, a thousand, ten thousand—though one may adapt to what is fitting, none may be omitted.\nThose who know to turn toward the correct Dharma and cultivate long life without death, having already integrated the Three and Five Precepts, should receive the Eight Precepts.\n\nFirst: Resolve the five phases and cultivate the five virtues.\n\nSecond: Practice the five affairs without fail.\n\nThird: Harmonize the eight correct principles; act and withdraw in accord with the seasons.\n\nFourth: Clearly discern the five celestial stems and abide together with qi.\n\nFifth: Carefully examine the Imperial Ultimate; let above and below be in harmony.\n\nSixth: Cultivate the three virtues and await the assembly of the Three Clarities.\n\nSeventh: Resolve doubts and transform the false into the true.\n\nEighth: Examine and verify, dispel misfortune and summon blessings, refine the ordinary and ascend to sageliness, never failing the Three Honored Ones.\n\nThe above Eight Precepts must be upheld in full. If one transgresses and breaks them, one must repent, confess one’s faults, reform one’s intentions, and resolutely guard against future lapses.\nAfter practicing them for three years, the good spirits of the eight directions will gather to protect one.",
      "overlap_context": "they must stand to the master’s left or right; they may not sit arrogantly or act no differently from common folk. To do so is to commit unfilial impiety; they must be cautious.\nWhen a disciple receives the master’s teachings and later achieves profound virtue and is revered by others, they must remain humble and remember their original master, never forgetting their prior kindness.\nA disciple may not casually sit in the master’s bed or seat; the spirits swiftly take note of such transgressions.",
      "start_char": 2248,
      "end_char": 3572,
      "start_sentence": 94,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.26235055923462,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\三洞众戒文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "六年，保免六极。 六极者，凶祸短折，常多疾苦，恒怀忧虑，积苦贫乏，形容丑恶，尪弱无施也。 八年，永享五福。 五福者，长寿，富贵，康宁，好德，考终。 炼有入无，自识宿命也。 九年神通，超凡成圣矣。 三诀文 经曰：志学之士，才力未强，多知为败，怠堕致殃，善行教者，照其所堪，随品稍□，悱愤日新，且闭繁科，示以要诀，众经诸法，渐次修行，功德成就，自然遍通，通由要起，要诀有三。 一者曰因。 无始中来，仍有识性，性灵无灭，死苦尚存，生乐无机关。 不识因者，定不怨天，不尤人，不咎物，不戚身，苦乐是甘，无妄惑也。 二者曰缘。 因循动静，内外取和，不侵人益身，不陷己误物，损而无伤，利而无害，识本知末，无邪疑也。 三者曰勤。 谨慎心口，严勑身神，闻圣寻请，受教遵承，增广善缘，断绝恶因。 正见子精进无退，不违师自任，不漫信浮随，不骄怠乱群，不苟执干众，不藏真出伪，不有始无终也。 右久忆此诀三，度人济己，三皇神史自然见形，为之使役，通达真灵，炼凡成圣，变粗为精，不知此三，终不得道。 八败文 经曰：斋以齐整为急，急以齐整身心，身心齐整，保无乱败。 败起多端，大略有八： 一者杀生自活，二者盗他自供，三者淫欲为快，四者妄语诳人，五者醉酒恣意，六者杂卧高广大床，七者竞玩香油华饰，八者着歌舞作唱。 右八者，大人君子、学圣真仙，不为此八事，则八败无从起，八败无起，则八成自然立，立则不失，延年保命，神通洞达，思真行道，明验必速也。 三要文 天皇曰：第一之要，先求长生； 第二之要，当求藏形； 第三之要，当避世荣。 十三禁文 仙人曰：夫欲延寿长生，避诸禁忌如右。 禁无施精，命夭没； 禁无大食，炁脉闭； 禁无大饮，膀胱急； 禁无大温，消髓骨； 禁无大寒，伤肌肉； 禁无寒食，生病结； 禁无欬唾，失肌汁； 禁无久视，令目； 禁无久听，聪明闭； 禁无久泣，神悲戚、禁无卒呼，惊魂魄； 禁无内念，志恍惚； 禁无恚怒，神不乐。 七百二十门要戒律诀文 经曰：七百二十门要戒律文，诸天宝秘，佩身传口，不书经中。 若未遇其师，当服符取应，见神来降，仍请受之。 凡人从无始中来，有识在心，心识浮动，回易须臾，驷马过隙，比之迟也，云间迅电，亦非速也。 心之善恶，反覆无常，一切诸急，莫若心之疾也。 心之难持，甚於虎豹，猴猿鹿马，皆易制也，一切之中，心难驭也。 善能调御心者，其唯上圣之人乎？ 中下圣真，恒与心争，昼夜俯仰，内省外观，常恐越逸，损灭心神，神散不可追还，身陨岂得重立？ 立身不殒，养神不散，长生神仙，位登上圣，要在清斋。 斋各有品，五情六欲，纵横竞兴，内外参差，致生迷乱，背正向邪，弃本逐末，欺负幽明，招考沉沦，九泉之府，楚掠万端，解脱无期，由於不斋故也。 志学之士，急务修斋，斋直齐心，守戒为主，主以制心，心定则生，忘戒失主，心乱则死，死中求生，生求不死，悉当清斋，诵习行戒。 情欲既多，戒遂无量，无量法门，众圣开设，趣引群生，使之能入，各有方所，诸天不同，时有行藏，历世舛异，大略不殊，一切所共，七百二十门最为妙胜。 持之全者，入道究竟，故能变化七十四方，九天各八，八九七十二，爰上及下，合七十四方。",
      "translated_text": "After six years, one is safeguarded from the Six Adversities. The Six Adversities are: misfortune and premature death, constant suffering from illness, perpetual anxiety, accumulated hardship and poverty, repulsive appearance, and frailty with no recourse.\n\nAfter eight years, one perpetually enjoys the Five Blessings. The Five Blessings are: longevity, wealth and honor, health and peace, love of virtue, and a timely end.\n\nRefining existence into non-existence, one naturally recognizes past lives. After nine years, spiritual penetrations arise, and one transcends the ordinary to attain sageliness.\n\n**Three Essential Writings**\n\nThe Scripture states: For those who aspire to learning, whose strength is yet insufficient, excessive knowledge leads to failure, and indolence invites calamity. A good teacher illuminates what the disciple can bear, gradually imparting knowledge according to their capacity, fostering daily progress through inspired effort. First, set aside complex precepts and reveal the essential formulas. All scriptures and methods are to be practiced in due order, and as merits accumulate, natural mastery arises. Mastery originates from essentials, and there are three essential formulas.\n\nThe first is called *Cause*. From the beginningless past, the knowing nature persists. The spiritual essence is indestructible; suffering in death remains, while joy in life lacks mechanism. One who does not recognize cause will surely not resent Heaven, blame others, fault things, or lament the body. Accepting suffering and joy as they come, one avoids delusion.\n\nThe second is called *Condition*. Following cause through movement and stillness, harmonizing inner and outer, one neither encroaches upon others to benefit oneself nor entraps oneself to mislead others. Though diminished, one remains unharmed; though benefited, one causes no injury. Recognizing root and branch, one avoids perverse doubts.\n\nThe third is called *Diligence*. Guarding the heart and mouth with care, strictly commanding the body and spirits, one seeks the sagely, inquires earnestly, receives teachings, and obeys them. One expands good conditions and severs evil causes. With right vision, the disciple advances without retreat, does not defy the teacher to act on one’s own, does not blindly follow superficial trends, does not grow arrogant or indolent to disrupt the community, does not obstinately oppose the multitude, does not conceal truth to display falsehood, and does not begin without finishing.\n\nBy long remembering these three formulas, one delivers others and benefits oneself. The divine scribes of the Three Sovereigns will naturally appear in form, serving and aiding one, communicating with true spirits, refining the ordinary into sageliness, and transforming the coarse into the refined. Without knowing these three, one will never attain the Dao.\n\n**Eight Defeats**\n\nThe Scripture states: In purification, order and discipline are urgent. Urgency lies in ordering and disciplining body and mind. When body and mind are ordered and disciplined, one is preserved from disorder and defeat.\n\nDefeat arises from many sources, but its major forms are eight:\n\n1. Killing to sustain oneself,\n2. Stealing from others to supply oneself,\n3. Taking pleasure in lust,\n4. Deceiving others with false speech,\n5. Indulging in wine to one’s whim,\n6. Reclining on high, broad, and grand beds,\n7. Competing in the use of fragrant oils and ornate adornments,\n8. Delighting in singing and dancing performances.\n\nNoble persons and those who study the sagely and true immortals do not engage in these eight acts. Thus, the Eight Defeats cannot arise. When the Eight Defeats do not arise, the Eight Accomplishments naturally stand. Once established, they are not lost, prolonging life and preserving destiny. Spiritual penetrations become thorough, and the verification of truth through practice and cultivation is swift.\n\n**Three Essentials**\n\nThe Heavenly Sovereign said: The first essential is to first seek longevity; the second essential is to conceal one’s form; the third essential is to avoid worldly glory.\n\n**Thirteen Prohibitions**\n\nThe Immortal said: Those who wish to prolong life and attain longevity must avoid the following prohibitions.\n\nProhibit ejaculation, or life will be cut short;\nProhibit overeating, or qi and vessels will be blocked;\nProhibit excessive drinking, or the bladder will be strained;\nProhibit extreme heat, or marrow and bones will be consumed;\nProhibit extreme cold, or muscles and flesh will be harmed;\nProhibit cold food, or illness and stagnation will arise;\nProhibit coughing and spitting, or bodily fluids will be lost;\nProhibit prolonged gazing, or the eyes will dim;\nProhibit prolonged listening, or hearing will be obstructed;\nProhibit prolonged weeping, or the spirit will grieve;\nProhibit sudden shouting, or the soul will be startled;\nProhibit internal brooding, or the mind will be distracted;\nProhibit anger and resentment, or the spirit will be displeased.\n\n**Seven Hundred Twenty Essential Precepts**\n\nThe Scripture states: The seven hundred twenty essential precepts are treasures of the heavens, transmitted orally and worn on the body, not recorded in scriptures. If one has not yet met a teacher, one should ingest talismans to elicit a response, summoning the spirits to descend and receive them.\n\nFrom the beginningless past, people have possessed consciousness in the heart. The heart’s consciousness is restless, changing in an instant—swifter than a team of horses passing a crack, slower than clouds drifting between lightning flashes. The heart’s goodness and evil shift unpredictably; among all urgencies, none is as swift as the heart’s. The heart is harder to restrain than tigers and leopards; monkeys, apes, deer, and horses are all easier to control. Among all things, the heart is the most difficult to master. Only the highest sages can skillfully guide the heart. Middle and lower sages and true immortals constantly struggle with the heart, examining within and observing without day and night, ever fearful of transgression and the dissipation of spirit. Once the spirit scatters, it cannot be retrieved; once the body falls, how can it be restored? To preserve the body from falling and the spirit from scattering, to attain longevity and become a divine immortal, ascending to the rank of the highest sages—this depends on pure purification.\n\nPurification has many levels. The five emotions and six desires surge and compete, inner and outer falling out of alignment, leading to confusion and disorder. Turning from the correct to the perverse, abandoning root for branch, deceiving the unseen and the seen, one invites judgment and sinks into the Nine Springs’ abyss, where myriad torments await, and liberation is without term—all due to the failure to purify.\n\nThose who aspire to learning must urgently practice purification. In purification, aligning the heart is primary, and upholding precepts is the foundation. The foundation restrains the heart; when the heart is settled, life arises. Forgetting precepts and losing the foundation, the heart becomes chaotic, and death follows. Seeking life within death, seeking immortality within life—all must involve pure purification and the recitation and practice of precepts.\n\nAs emotions and desires multiply, precepts become boundless. The boundless dharma gates were established by the many sages to guide and lead all beings, enabling their entry. Each has its proper place, differing among the heavens, with times for action and concealment, varying across ages. In general, they are not disparate; all share in common the seven hundred twenty gates, which are the most wondrous and supreme. Those who uphold them in full attain the ultimate Dao, enabling transformations across seventy-four directions. The nine heavens each have eight, and eight times nine is seventy-two. From above to below, they total seventy-four directions.",
      "overlap_context": "oubts and transform the false into the true.\n\nEighth: Examine and verify, dispel misfortune and summon blessings, refine the ordinary and ascend to sageliness, never failing the Three Honored Ones.\n\nThe above Eight Precepts must be upheld in full. If one transgresses and breaks them, one must repent, confess one’s faults, reform one’s intentions, and resolutely guard against future lapses.\nAfter practicing them for three years, the good spirits of the eight directions will gather to protect one.",
      "start_char": 3572,
      "end_char": 4862,
      "start_sentence": 144,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.23258066177368,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\三洞众戒文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "不能持戒，或持之不全，各随阶品，变化不同，变化不同则不免累患，是故上圣令持之矣。 一切含生，皆有三五，又有多少，愚智不同，更相领摄，抑扬相缘，一识既动，无端竞兴，守一不可，直指三五，交互扶持，三炁流行，八会相辅，太一游历，九宫相成，一源为本，九化为末，有本有末，九一居宗，宗本引末，末同还源，源一应末，末感既动，本应恒寂，寂应诸动，动名外来。 外来曰动，内住曰寂，寂动於半，有异有同，同动以救去，异寂以济来，来不惊寂，去不劳动，动而不劳，不离寂也； 寂而不惊，不疑动也。 寂照明彻，故无惊疑； 动以徐生，故无劳隔。 无劳隔者，常合长生； 无惊疑者，长乐常住。 住无所住，为而无为，为道之最。 用本一焉，分化成数，八九回旋，相乘积门，七百二十也。 门者，文也，理也，还也，散逸应还，还修由文，得门能入，未归源也。 本因粗多，增缘精少，少多相倾，补续相涉，识悟转开，见门稍审，长善勇猛，诣速臻，臻未速者，经届无央，大略变化，舍故即新，骇听殊观，正在七百二十门中，积历八九，究炼毕竟，七百二十，共为一矣。 守一勿失，行一难坚，念念相仍，不可暂替，暂替则邪干，邪干则正翳，正翳则门塞，门塞则见迷，迷者陷苦，苦极思回，识神感发，超然醒悟，更坚其念，念念相续，因积积久，一炁浃身，身神通彻，八九朗然，变化无穷，由悟守一，守一须资，唯戒为急。 持之不亏，邪不得入，邪不得入，正炁相亲，亲密久之，自然混合，与道同真。 资戒果遂，由戒入道，故谓为门，精志之俦，谛从之耳。 万福曰：夫人心不一，识有暗明，妙道无方，神化难测，心明则悟道，神昧则迷真，而心以寂明，神由动乱，乱则失道，明乃会真，故守正除邪，则妄心不起，背明向暗，乃恶念斯生。 善否非他，谅自身造，迷悟在己，亦不由人，是以大圣天尊，弘慈化物，善权方便，接引无遗，广设法门，招提一切，随宜授药，众病消除，普劝行人，悉令持戒。 戒有多种，大小异门，究竟归根，同成正道，但三五六八，渐顿稍殊，识悟既明，终持一戒。 一戒者，唯戒於心，不起他念也，即此戒谓守一勿失，念念相仍是也。 学士当谛思行之矣。 三洞众戒文卷下竟",
      "translated_text": "Those who cannot uphold the precepts—or uphold them incompletely—vary in their stages and ranks, and their transformations differ accordingly. With differing transformations, they cannot avoid accumulating afflictions; thus, the supreme sages command their full observance.\n\nAll sentient beings possess the Three and the Five, yet these vary in measure. The foolish and the wise differ, each leading and encompassing the other, restraining and elevating in mutual dependence. Once the first consciousness stirs, countless impulses arise without end. To guard the One is impossible; one must directly address the Three and the Five. Interwoven and mutually sustaining, the Three Qi flow and circulate, the Eight Assemblies lend support, the Great One traverses, and the Nine Palaces achieve completion. The One Source is the root; the Nine Transformations are the branches. With root and branches established, the Nine and the One reside as the essence. The root guides the branches; the branches return in harmony to the source. The One Source responds to the branches; when the branches’ sensations stir, the root remains eternally quiescent. Quiescence responds to all movements—movement is called \"external arising.\"\n\nWhat arises externally is movement; what abides internally is quiescence. Quiescence and movement meet midway, sharing both difference and sameness. Sameness moves to dispel departure; difference rests to aid arrival. Arrival does not disturb quiescence; departure does not exhaust movement. Movement without exhaustion does not depart from quiescence; quiescence without disturbance does not doubt movement. Quiescence illumines with clarity, thus free from disturbance and doubt; movement arises gradually, thus free from labor and separation. Free from labor and separation, one constantly unites with long life; free from disturbance and doubt, one abides in eternal joy. Abiding without abiding, acting without acting—this is the highest of the Dao.\n\nThe original One, through division and transformation, becomes multiplicity. Eight and nine revolve, multiplying and accumulating into gates—seven hundred and twenty in all. A gate is pattern, principle, and return. Dispersed and scattered, one responds and returns; return and cultivation proceed through pattern. Attaining the gate enables entry, yet one has not yet returned to the source. Initially coarse and manifold, with practice the conditions refine and diminish. The many and the few incline toward one another, supplementing and interpenetrating. As perception and awakening unfold, the gate becomes increasingly discernible. With long-cultivated goodness and courageous vigor, one swiftly attains the goal. For those who have not yet attained swiftly, the passage of kalpas is boundless. In general, transformation entails relinquishing the old and embracing the new. Astonishing to hear and wondrous to behold, this occurs within the seven hundred twenty gates. Accumulating through eight and nine, refining to the utmost, the seven hundred twenty merge as one.\n\nTo guard the One without loss is difficult; to practice it without firmness is arduous. Thought follows thought without pause; even a moment’s lapse invites deviation. Deviation invites obstruction; obstruction veils the correct. Veiled, the gate is blocked; blocked, one’s vision becomes deluded. Delusion leads to suffering; at suffering’s extremity, one yearns to return. The spirit of perception stirs, awakening suddenly. One strengthens one’s thought, thought following thought in unbroken succession. Through accumulation over time, the One Qi permeates the body. Body and spirit become thoroughly pervaded; the eight and nine shine clearly. Transformations become boundless, arising from awakening to guarding the One. Guarding the One requires support—nothing is more urgent than the precepts. Upholding them without deficiency prevents deviation from entering. With deviation barred, the correct qi draws near. Intimacy deepens over time, naturally merging into oneness, uniting with the Dao in truth. The fruition of precept-support is attained; through precepts, one enters the Dao—hence they are called the gate. Those of refined aspiration and sincere devotion follow accordingly.\n\nMaster Wanfu said: The human mind is not one; perception may be dim or bright. The wondrous Dao is without fixed form; spiritual transformation is difficult to fathom. A bright mind awakens to the Dao; a dull spirit strays from truth. The mind attains clarity through quiescence; the spirit falls into chaos through movement. Chaos loses the Dao; clarity unites with truth. Thus, guarding the correct and dispelling deviation prevents delusive thoughts from arising. Turning from brightness toward darkness, evil thoughts arise. Good and evil arise not from another—truly, they are self-created. Delusion and awakening lie within oneself, not dependent on others. Therefore, the Great Sage Heavenly Worthy, in vast compassion, transforms beings with skillful means, guiding all without exception. Establishing boundless dharma gates, he gathers all, administering medicine according to need, dispelling the illnesses of the multitude. Universally exhorting practitioners, he commands all to uphold the precepts.\n\nPrecepts are of many kinds, with gates great and small. Ultimately, they converge at the root, equally accomplishing the correct Dao. Yet the Three, Five, Six, and Eight differ gradually or suddenly. Once perception and awakening are clear, one ultimately upholds the One Precept. The One Precept is simply to restrain the mind from arising in other thoughts—this is what is meant by \"guarding the One without loss, thought following thought without pause.\" Scholars should reflect deeply and practice accordingly.\n\nThe Lower Scroll of the Precept Texts of the Three Caverns concludes.",
      "overlap_context": "ng their entry. Each has its proper place, differing among the heavens, with times for action and concealment, varying across ages. In general, they are not disparate; all share in common the seven hundred twenty gates, which are the most wondrous and supreme. Those who uphold them in full attain the ultimate Dao, enabling transformations across seventy-four directions. The nine heavens each have eight, and eight times nine is seventy-two. From above to below, they total seventy-four directions.",
      "start_char": 4862,
      "end_char": 5721,
      "start_sentence": 197,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.60691785812378,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\三洞众戒文.txt",
        "category": "戒律类"
      }
    }
  ]
}