{
  "source_id": "三洞枢机杂说",
  "source_file": "chunked_daozang\\三洞枢机杂说.json",
  "total_chunks": 6,
  "total_original_chars": 5171,
  "total_translated_chars": 27513,
  "total_translation_time": 143.13244676589966,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\三洞枢机杂说.txt",
    "category": "方法类"
  },
  "full_translation": "*The Miscellaneous Sayings on the Pivotal Mechanisms of the Three Caverns*\n**Text Title:** *Miscellaneous Sayings on the Pivotal Mechanisms of the Three Caverns*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Methods* category of the *Dongshen* section\n\n---\n\n### **Daily Daoist Exercises: The Immortal’s First Stage**\n\nAt dawn each morning—or at the first watch of the fifth night watch—calm the mind and settle the thoughts. Clench the fists to retain spirit, sit with solemn dignity, and sever all worldly concerns. In stillness, free of thought, visualize the body within the formless and the mind within the realm of non-action. Thus, harmonious *qi* will naturally arise. Then, knock the teeth seven times and swallow saliva seven times, each time directing the saliva down to the lower *dantian*. With time, it will become a treasure.\n\nNext, relax the body and limbs to perform the twelve forms of *daoyin*:\n\n1. **Opening the Hundred Passes**\n   Grasp both feet with both hands, three times. With each repetition, swallow and retain the breath without exhaling.\n\n2. **Left and Right Pressing**\n   Thread one hand past the shin to grasp the top of the foot, while the other hand presses the calf. Alternate sides, performing three repetitions each. With each, swallow and retain.\n\n3. **Single Leg Extension**\n   Extend one foot while one hand supports the bed and the other grasps the foot. Alternate sides, three times each. With each, swallow and retain.\n\n4. **Double Foot Grasping**\n   Grasp one foot with both hands, alternating sides three times. With each, swallow and retain.\n\n5. **Left and Right Pressing the Void**\n   Interlock the backs of the hands, extend the elbows, and slowly release. Grasp the breast with one hand while the other presses into the empty space, as if pushing a heavy object. Alternate sides, three times each. With each, swallow and retain.\n\n6. **Supporting the Sky and Pressing the Earth**\n   Interlock the hands, raise them overhead, and slowly lean the head forward until it is one or two *cun* from the ground. Perform three times. With each, swallow and retain.\n\n7. **Dragon Coiling and Phoenix Beak**\n   Thread the left hand through the right, interlocking the wrists, and press the fingertips together. Alternate sides, three times each. With each, swallow and retain.\n\n8. **Phoenix Spreading Its Wings**\n   First swing the hands back, then extend them forward like a phoenix spreading its wings. Alternate three times. With each, swallow and retain.\n\n9. **Left and Right Swinging**\n   Interlock the hands, cradle the head, and swing left and right. Perform three times. With each, swallow and retain.\n\n10. **Pushing East and West**\n    Interlock the hands, extend them forward, and swing east and west. Perform three times. With each, swallow and retain.\n\n11. **Striking the Gate of Heaven**\n    Interlock the hands and rub the nose. Every seven rubs count as one repetition, followed by one swallow. Perform three sets of seven (twenty-one swallows in total).\n\n12. **The Immortal’s Dry Bath**\n    Rub the hands together until warm, then massage the eyes, face, ears, neck, and shoulders as if washing them. The more repetitions, the better.\n\nThe above daily *daoyin* exercises, though ideally performed at dawn, are not restricted to morning or evening. Practice them regularly when unoccupied, and naturally, the hands will grow skillful, the sinews supple, the bones strong, and the *qi* harmonious. Illnesses will be dispelled, vitality will flourish, excess food will be digested, hunger will subside, and all endeavors will proceed without obstruction. Though one may not yet attain longevity, prolonged practice will eliminate superficial ailments of the body.\n\nAs the saying goes:\n*Even if no great power is gained,*\n*It still surpasses needless toil of the mind.*\nThis is the truth of it.\n\n**The Method of Pecking, Swallowing, and Massage**\n\n*The Zhen’gao* states: When traveling at night, one should frequently clack the teeth. There is no fixed number for clacking the teeth, for it slays demonic and malevolent spirits, who ever dread the sound of teeth. If one combines this with rinsing the mouth and reciting incantations, it is also excellent.\n\nThe immortal Liu Jing said to Huangfu Long: Upon rising in the morning before washing, sit calmly and rinse the saliva in the mouth—called \"jade spring\"—until it fills the mouth, then swallow it. Immediately clack the teeth fourteen times, then rinse and swallow the saliva again as before, and clack the teeth once more, following the same method. Clacking the teeth summons the spirits within the body and settles them, and it also prevents the teeth from decaying. Swallowing the saliva makes the body radiant and strong, bestows a lustrous complexion, expels the Three Corpses worms, and is called \"refining the essence,\" enabling one to attain longevity. If practiced throughout life, one may achieve immortality.\n\n*The Zhen’gao Taisu Danjing Jing* states: On the face, one should frequently rub the hands until warm, then massage the face in all directions, following its contours, pressing deeply as if in a heavy rain. This gives the face a luminous glow and prevents wrinkles and blemishes. After five years of practice, the complexion will resemble that of a young maiden. First, vigorously rub the palms until hot, then wipe the face and eyes. Stroke the hair with the hands as if combing it, and alternately massage the arms with the hands to prevent graying hair and floating pulse.\n\n*The Wai Dadong Zhenjing Jingjing Anmo Pian* states: Upon rising from bed, sit upright and regulate the breath. First, clasp the hands and place them behind the neck, then look upward, causing the neck to strain against the hands. Do this three or four times to harmonize the essence and circulate the blood, preventing wind and qi from entering. With prolonged practice, one will neither die nor fall ill. Additionally, bend and stretch the body, extend the limbs to their utmost, and arch the back while loosening the hundred joints, each performed three times.\n\nIt also cites *The Scripture on Dispelling Demons and Ascending Spirits*: If the body feels unwell, press the tongue against the throat, rinse the mouth with saliva, and swallow it repeatedly. Soon, the discomfort will dissipate, and the body will feel relaxed and supple. It further states: Pressing the sides of the nose without limit regulates the breath, irrigates the Central Peak, and is recorded in the Emperor’s register. When sitting, one should often close the eyes and inwardly visualize the five viscera and intestines. With prolonged practice, they will become distinctly clear.\n\nOne should frequently cover the mouth and nose with the hands, breathe gently through the eyes for a long while until fluid forms in the palms, then use it to massage the face and eyes. Regular practice will make the body fragrant.\n\n*The Zhen’gao* states: Combing the hair should be done frequently to circulate the blood and qi and dispel wind and dampness. Alternate combs should be used, and the hair need not be unbound. *The Taiji Jing* states: When combing the hair, face the direction of the king. At the start of combing, silently recite: *\"Mud-pellet’s dark flower, preserve essence and long endure; left as the hidden moon, right as the sun’s root; six harmonies refine the essence, a hundred spirits receive grace.\"* After reciting, swallow the saliva three times. With regular practice, the hair will not fall out but will grow anew. Combs should be changed often, and the combing should be thorough but not painful. One may also have an attendant comb the hair to ensure thoroughness, preventing stagnation of blood and qi and strengthening the hair roots.\n\n*The Lower Scroll of the Red Writ and Jade Formulae* states: On the day of *gengshen*, the Supreme Lord of the Northern Palace of the Great Mystery records the transgressions of the Three Corpses and the spirits of the people, submitting them to the Emperor. On this day, if one observes purification rites, upholds the precepts, and contemplates the spirits day and night, the Three Corpses will be unable to ascend to heaven and report one’s sins. The Earthly Offices will instead record one’s good deeds. The Emperor and the Great Unity will rejo\n\nWhen spectral apparitions and tomb phantoms dare to offend my spirit,\nMay the Northern Emperor strike them down and cast their qi into the abyss;\nRecorded in the registers of the Supreme August, reverently presented to the Jade Dawn.\nRecite this invocation twice, then knock the teeth thrice—\nThus shall one no longer dream of tombs or the ghosts of deceased kin.\nFor those who frequently suffer inauspicious dreams, this method may be applied.\nThereby, ghostly qi vanishes and malevolent specters disperse.\n\nIt is further said: If the arms remain unguarded, sinking wind-toxins and stagnant qi congeal in the meridians, causing numbness in the bones and rendering one inert. Acupuncture and moxibustion may cure this, as may the invocation of the Northern Emperor’s *Qu Zhe* (Twisting and Turning). Should one practice this a hundred times, the ailment will also dissipate.\n\nFirst, gently massage the afflicted arm with one hand. After a long while, close the eyes and turn the gaze inward, swallow saliva thrice, and knock the teeth three times. Compose the mind and softly invoke:\n*\"Supreme Four Mysteries, Five Florets, Six Courts.\nThree Hun and Seven Po, Heaven’s Opening and Earth’s Essence.\nDivine Palace, Guardians of the Body, Celestial Embryo, Radiant Above.\nFour Limbs and Hundred Spirits, Nine Joints and Myriad Numinous Ones.\nEnrolled in the Jade Dawn, inscribed in the Jade City.\nJade Lads attend my body, Jade Lads guard my life.\nEver aligned with the One Light, ascending as an immortal to the Upper Clarity.\nLong as the sun and moon, years enduring beyond measure.\nTranscending to ascend as an immortal, attaining the Great Peace.\nSwirling winds and congealed ailments, demonic qi and flying ghosts,\nTomb specters and yin vapors, lingering malign forces—\nAssailing my four limbs, disrupting my household’s prosperity.\nGreat Unity’s Celestial Soldiers, Dragon and Tiger manifesting might,\nSever the inauspicious ghosts, shatter the wind-demons.\nExamine and expel hidden grievances, conceal all poisons and wrongs.\nRestore me to normality, that I may shine with the sun and moon.\nIf examined and found transgressing the Northern Asterism, let them be as those who offend the radiant majesty above.\"*\n\nIn ancient times, Tang Lan dwelled in the mountains and was struck by a ghost, leaving his body limp as a silk sack. A Daoist taught him this method, and he was immediately cured. This is the *Qu Zhe* method of the Northern Emperor—effective for all ailments involving twisting or obstruction, not merely wind-induced numbness. Tang Lan now resides on Mount Hua, refining the elixir and attaining immortality.\n\nA Perfected One asked: *\"Why do people frequently fall ill?\"*\nA Divine Person replied: *\"When the liver spirit departs and does not return in due time, the eyes lose their brightness. When the heart spirit is absent, the lips turn pale. When the lung spirit is absent, the nose becomes blocked. When the kidney spirit is absent, the ears grow deaf. When the spleen spirit is absent, the mouth cannot taste sweetness. When the head spirit is absent, one becomes dizzy and disoriented. When the abdominal spirit is absent, the center becomes disordered, and nothing can be transformed. When the spirits of the four limbs depart, one cannot move. The nature of spirit and essence is to dwell in emptiness and stillness, not in turbidity and chaos. To summon the spirits, one must fast and observe precepts, suspending their images in the chamber—thus, all illnesses vanish. Without fasting and precepts, the spirits will not return to the person but will instead ascend to heaven to lodge complaints. Hence, people’s illnesses accumulate, and the dead are unending.\"*\n\nIt is further said: Rub the face and eyes with both hands until slightly warm, making this a regular practice. Wrinkles in the aging face first appear beneath the eyes, while the decline of the body and depletion of qi begin between the kidneys. These two places are the gates and windows of wrinkles and decay, the passes and fords of vitality. Therefore, practicing this method in daily life wards off wrinkles and decline, preserving health and harmony.\n\n*The Scripture of the Celestial Treasure’s Natural Cyclical Movements* states: The Celestial Treasure’s natural cycles include the Greater Yang Nine and Greater Hundred Six, as well as the Lesser Yang Nine and Lesser Hundred Six. Three thousand six hundred and sixty years constitute the Lesser Yang Nine and Lesser Hundred Six. Nine thousand nine hundred years constitute the Greater Yang Nine and Greater Hundred Six. The heavens’ exhaustion is called Yang Nine, and the earth’s depletion is called Hundred Six. In the *jiashen* year following the Jin clan’s era, the cycles of heaven and earth’s fortune and misfortune reach their conclusion. When the Yang Nine assembly arrives, the Dao and virtue become manifest, calamities and ugliness instantly dissolve, and the sagely ruler assumes his mandate in the *renchen* year.\n\n*The Yellow Writs of the Forty-Four Methods* states: When retiring at night and about to close the eyes, press the hand over the heart thrice, shut the eyes, and softly invoke:\n*\"Supreme Numinous Nine Palaces, Great Unity guards the chamber.\nHundred spirits assume their positions, hun and po harmonize.\nLong life without death, sealing away inauspiciousness and misfortune.\"*\nAfter the invocation, sleep—this is called the *Nine Palaces Hidden Invocation for Sleeping Spirits*. Practicing this regularly brings peace to the hun and po, ensuring constant good fortune.\n\nIf the ears ring, it is due to external influences intruding. The ear spirit, Jiao Nü, says: One should immediately sound the bell to alert the Nine Palaces, informing them of the outsider’s intrusion so they may prepare. The \"bell sound\" refers to the ringing in the ears. Upon hearing it, cross the hands to cover the ears and invoke:\n*\"The Red Child dwells in the palace, the Nine Perfected in the chamber.\nAttend to the divine command, discerning the inauspicious.\nGreat Unity’s flowing fire extinguishes the myriad misfortunes.\"*\n\nThe ranks of the Perfected and Immortals:\nPerfected and Immortals are each divided into three grades, forming nine ranks. Each of these nine ranks is further divided into three, totaling twenty-seven ranks. In the Jade Clarity, the Perfected hold the primary position; in the Upper Clarity, the True Ones hold it; and in the Great Clarity, the Immortals hold it. Yet the Perfected may also be called True, the True may be called Perfected, the Immortals may be called True, the True may be called Immortals, the Immortals may be called Perfected, and the Perfected may be called Immortals. A Perfected appears every thousand years, a True One every five hundred, an Immortal every hundred and fifty, and a Worthy every hundred.\n\n*The Inner Transmission of the Supreme Perfected and Primordial Master* states: The divine kings of the heavens scatter flowers and burn incense to honor those who attain the Dao. It is further said: The Supreme Lord dispatches envoys in embroidered robes to convey felicitations.\n\n*Zhuangzi, \"Autumn Floods\" (Chapter Seventeen)* states: Zhuangzi and Huizi strolled above the Hao Bridge.\n\nZhuangzi said: \"See how the minnows swim so leisurely—this is the joy of fish!\"\nHuizi replied: \"You are not a fish—how can you know the joy of fish?\"\nZhuangzi said: \"You are not me—how can you know that I do not know the joy of fish?\"\nHuizi said: \"I am not you, so I do not know you. But you are certainly not a fish—is it not complete that you do not know the joy of fish?\"\nZhuangzi said: \"Let us return to the beginning. When you asked, *'How do you know the fish are joyful?'*—you already knew that I knew, yet you asked me. I knew it here above the Hao.\"\n\nFang Qian, styled Daochong, was a native of Baixiang County in Zhaobang, Jizhou. He cared for others while neglecting himself. The mountain folk often suffered from miasmic malaria, but those who took refuge in his name were cured. When people begged for his method, Qian replied: \"A rectified heart can dispel evil. I dwell in poverty and have no wealth to give, but I constantly recite the *Dharma-Wheel Scripture of the Dao and Its Virtue*, rejoice in all good deeds, and show compassion toward all wrongs. This can heal oneself—and others as well.\"\n\nIn *The Traditions of Divine Transcendents*, when Magu scattered rice upon the ground, the grains that fell became cinnabar. Wang Fangping laughed and said: \"You are still young, girl—this is why you delight in such clever transformations. I am old now and no longer care for such tricks.\"\n\nSun Bo of Hedong was a man of refined talent, skilled in composition. He studied the Dao and practiced the arts of Mozi. He could make plants, trees, metal, and stone all burst into flame, their light illuminating for miles. He could also turn his own body into a blazing fire, breathe flames from his mouth, and point at great trees or growing grass to wither them instantly—then point again to restore them as before. He could even cause an entire army to divide into separate columns of fire. When he set fire to others, water poured upon the flames would not extinguish them for days—only when Bo pointed at them would they cease. When crossing great waters, not only did his own body remain dry, but he could keep hundreds of followers from getting wet. He could also spread mats upon the water, sit and feast, make merry, and have people dance upon the surface without sinking, all rejoicing without restraint. Those who were ill would seek his aid, and he would heal them without a word—merely pointing at them and declaring their recovery, and they would be cured. He could also swallow swords, pass through walls, and bend mirrors into blades or blades into mirrors, maintaining the transformation indefinitely until he pointed at them to restore their original form. Later, he entered the forest, fearing that the mountain spirits might have taken his elixir, and ascended as a transcendent.\n\nThe wood blocks evil paths and seals demonic routes, obstructing the way of spirits. Consuming its pills and elixirs, one’s spirit flourishes in all directions, while the *qi* of nourishment and defense becomes light and agile. Ingesting its decoctions and powders dispels all ailments, enabling longevity and enduring vision. The formula for compounding this wood is not recorded here.\n\nDuring famine years when grain is scarce, or when the destitute cannot obtain it, they may rely solely on *nan zhu* (southern candlewood), or mix it with *fu ling* (poria), or blend it with honey, or combine it with pine and cypress leaves. Pound the *nan zhu* plant, extract its juice, and soak the green-dragon rice in it to prepare the medicinal concoction. This tree is woody yet resembles grass, hence it is called *nan zhu cao mu* (southern candlewood plant). It is also named *hou yao* (monkey medicine), *nan du*, *hou zhuo*, *wei na mu*, or the \"King of Plants.\" It grows in all famous mountains, with the greatest abundance in Wu and Yue.\n\nThe middle scroll of *The Canon of the Supreme Perfected* states: \"Within the thousand *li* of the Son of Heaven’s domain, fields supply the ancestral temples and sustain the distant and near. Like the sun and moon in their vastness, this expanse spans a thousand *li*, hence it is called the *jing shi* (capital). *Jing* means great, and *shi* means multitude—the Son of Heaven’s abode, where the great multitude gathers.\"\n\n*The Scripture of Opening and Closing in the Pillow of Lord Lao* says: \"This vital *qi* should always remain calmly within the body; do not let it recklessly depart. The mouth is the gateway of the five disasters, and the heart is the door of the eight poisons. [...] When writing talismans, first recite the incantation three times. [...] Bite the brush’s tip. Write the talisman on a sesame cake, secretly chanting the spell seven times.\"\n\n**Authentic Talisman Script**\nEach morning at dawn, knock the teeth twenty-four times and recite this incantation thrice. Then, facing east, take three talisman pills with tea made from *mao xiang* (cogon grass). The incantation reads:\n*\"Treasure of the August Spirit, imperishable through kalpas untold.\nMind and spirit ever harmonized, lifespan naturally prolonged.\nFirm and unyielding, never waning, dispelling all misfortunes and woes.\nThis script is concealed by the Perfected; guard it well to the end as at the start.\nSwiftly, swiftly, as the command of the Most High Lord Lao!\"*\n\n**Method for Communicating with True Incense**\nIncense serves to summon spirits, convey messages, guide comings and goings, and signal distances. Thus, those who tend incense, attend to incense, or serve as jade lads, jade maidens, or incense officials must fulfill their duties with reverence, never treating it lightly. As recorded in *The Comprehensive Refinement Canon of the Three Caverns*.\n\n*The Scripture of the Flowing Pearl* states: \"Burning foreign, foul, toxic, or pungent incense—such as frankincense or conch-shell incense—violates Daoist prohibitions and is not the incense used by true practitioners. True practitioners favor the subtle fragrance of *zi wei* (purple-tinted) and secluded woods, which delights all who encounter it. This refers to *chen xiang* (aloeswood) and *jian xiang* (eaglewood). Foreign incense, with its pungent toxicity, is detested by true practitioners—this refers to frankincense.\"\n\nWang Zijin, the Upright Man of Tongbai, said to Qingxu Zhenren Wang Zideng: \"In the past, Su Shangqing loved burning pungent incense, its *qi* surging before the image of the Celestial Worthy of Primordial Beginning. The Earthly Bureau reported this to the Most High, who disapproved and subsequently demoted his immortal rank.\"\n\n*The Fragrant Register of Divine Immortals* states: \"Many in the world offer frankincense to Heaven. Frankincense, also called foreign incense, is detested by the Supreme Emperor and the Five Planets, for its *qi* is pungent and foul. Conch-shell incense and musk are especially forbidden. *Chen xiang* (aloeswood), *jian xiang* (eaglewood), *jiang zhen xiang* (resinous eaglewood), *bai tan xiang* (sandalwood), *su he xiang* (storax), and *qing mu xiang* (aristolochia) carry their fragrance forty *li* upward. *Ding xiang* (clove) and *an xi xiang* (benzoin) repel evil and dispel impurity. Only raw *long nao* (borneol) may be used; cooked borneol risks contamination by the *qi* of its wood.\"\n\n**Method for Making Descending-Truth Fragrant Beads**\nTake three *jin* of *chen shui xiang* (aloeswood), two *jin* of *xun mu xiang* (costusroot), nine *liang* of *qing mu xiang* (aristolochia), five *liang* of *ji she xiang* (clove), three *liang* of *wu shen* (black ginseng), six *liang* of *que tou xiang* (sparrow-head incense), two *liang* of *xiang bai zhi* (angelica), two *liang* of *zhan fu xiang* (benzoin), two *liang* of *bai tan* (sandalwood), three *liang* of *ai xiang* (mugwort), four *liang* of *an xi xiang* (benzoin), and three *liang* of *mu lan* (magnolia). Grind each separately, then mix with ten *liang* of dried jujube pulp. Pound thirty thousand times, steam in a white porcelain vessel for a day, blend with three *jin* of white honey, and pound until well combined. Form into pills the size of *ji tou* seeds (gorgon fruit), string them with green thread, and dry in the sun. These are called the *Three Perfections and Nine Harmonies Fragrant Bead Pills*. When burned on the altar, their fragrance ascends to the Nine Heavens, where the Heavenly Perfected and Jade Maidens, perceiving it, descend to witness the ceremony in the void. Recorded in *The Rites of the Nine Heavens’ Life-Nourishing Fast*.\n\n**Method for Divine Candle Oil**\nFrom *The Scripture of the Cavernous Spirit*, the method for fragrant oil: Take nine *jin* of *chen shui xiang* (aloeswood), three *jin* of *qing gui pi* (green cinnamon bark), ten *liang* of *qing mu xiang* (aristolochia), ten *liang* of *zhen tan* (true sandalwood), eight *liang* of *ji she xiang* (clove), eight *liang* of *su he xiang* (storax), ten *liang* of *que tou xiang* (sparrow-head incense), eighteen *liang* of *ling ling xiang* (highland basil), twenty *liang* of dried jujube fat, ten *liang* of *huo xiang* (patchouli), six *liang* of *xuan su* (perilla), and eight *liang* of *bai zhi* (angelica). After purifying through fasting, select an auspicious day—*ping*, *jian*, *kai*, or *cheng*—face east or south, and chop the ingredients. Place them in a silk bag and steep in oil for seven days without opening. If pounded and mixed with honey, then ignited with a solar-concentrating mirror, it will attract and summon true spirits. Recorded in *The Refinement Canon for Daoist Practitioners of the Three Caverns*.\n\n**Method for Divine Candle Oil**\nTake five *liang* of *zhan fu* (benzoin), three *liang* of *xun lu* (frankincense), six *liang* of *ling ling xiang* (highland basil), six *liang* of *gan song* (spikenard), three *liang* of *bai mao xiang* (cogon grass), three *liang* of *wu shen* (black ginseng), and three *liang* of *bai zhi* (angelica). Chop finely, place in a silk bag, and steep in oil for three, five, or seven days. Then use it to light lamps, and the fragrance will be rich and lingering, capable of summoning and descending heavenly perfected beings. The key to refining incense and lamps lies in using colored lantern covers to shield from insects and wind, thereby prolonging the light. Beyond the lamps and candles of the fasting altar, wax torches should be abundant and never lacking. Recorded in *The Rites of the Nine Heavens’ Life-Nourishing Fast*.\n\n**Incense Formula**\nTake twenty *liang* of fresh *mao xiang* (cogon grass), clean and remove the outer skin, retaining twelve *liang* of the pure material. Chop finely, stir-fry with two *liang* of honey until yellow.\n\nPound two *liang* of *xiang fu zi* (nutgrass) until finely chopped. Take one and a half *liang* of *ding xiang pi* (clove bark) and seven *liang* of *huang tan* (sandalwood), finely chopped. Add one *liang* of *jiang zhen xiang* (lignum dalbergiae odoriferae). Grind all ingredients evenly into small pieces, then blend with twenty-four *liang* of refined honey. Knead thoroughly, place in a ceramic vessel, and bury it in a shady spot two to three *chi* deep. After ten days, it may be retrieved for use. For each batch, after mixing with honey, add three *liang* of coarse *jian xiang* (agarwood) powder.\n\n**Qingyuan Incense Formula**\nTake ten *liang* of *gan song* (spikenard), thirty *liang* of *xiang bai zhi* (angelica), five *liang* of *xuan shen* (figwort root), six *liang* of *ling ling xiang* (lysimachia), seven *liang* of *mao xiang* (cogon grass), five *liang* of *ding xiang pi* (clove bark), three *liang* of *huo xiang* (patchouli), three *liang* of *xiang fu zi* (nutgrass), half a *jin* of *mu she* (musk), and five *liang* of *jiang zhen xiang* (lignum dalbergiae odoriferae). Clean and wash all ingredients, then chop and grind into coarse powder. Blend with refined honey, store in a sealed vessel, and allow to mature over time.\n\nHere ends the *Miscellaneous Sayings from the Pivotal Mechanisms of the Three Caverns*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "三洞枢机杂说 经名：三洞枢机杂说。 撰人不详。 一卷。 底本出处：《正统道藏》洞神部方法类。 三洞枢机杂说 日用导引神仙初地门 每朝凌晨，或五更初，澄心静虑，握固存神，端严敷坐，屏绝缘务，寂无思念，想身於无身之中，存心於无为之境。 是以和气聿然自至，即便叩齿七通，咽液七数。 度度想液直至下丹田，日久成宝也。 然后舒展体骨，为十二般导引。 一通百关，两手攀两脚头，三度，三度咽纳，不得出气。 二左推右推，以一手串脚胫，攀脚面，又一手推脚肚。 如此互换，以三为度。 度度咽纳。 三单展足，以一手托床，一手攀脚头。 如此互换各三数，度度咽纳。 四双攀足，以两手攀一脚，如此互换三度，度度咽纳。 五左右托空，以两手背锁，摆出其肘，缓缓解散，一手攀乳，傍一手托虚空，想如推重物。 如此互换，以三为数，度度咽纳。 六托夫据地，以两手相锁，反仰托天，缓缓和头向前，可去地一二寸许，亦以三为数，度度咽纳。 七龙盘凤觜，以左手串入右手，互把其腕，手头柱觜。 如此互换，以三为数，度度咽纳。 八凤凰展翼，两手先摆后，以凤翼展却向前。 如此互换三度，度度咽纳。 九左摆右摆，以两手相锁，抱头面，左摆右摆，以三为数，度度咽纳。 十推东推西，以两手相锁，托前，摆东摆西，以三为数，度度咽纳。 十一击天门，以两手相锁，摩鼻，每七摩为一度，咽纳一咽，如此亦以三七二十一咽为足。 十二仙人乾浴。 以两手相擦，似有热气，便摩两目，以至於面部、两耳、项、膊，一如澡洗法，唯多为妙。 已上日用导引，虽云凌晨，亦不拘早晚，但无事常习，自然手熟、筋软、骨壮、气和，有疾除疾，无疾爽神，食饱消食，馁过止饥，一切作为，并无所碍。 虽未可以长生，久视亦且除身中浮疾。 谚云：纵然不得力，犹胜别劳心。 此之谓也。",
      "translated_text": "*The Miscellaneous Sayings on the Pivotal Mechanisms of the Three Caverns*\n**Text Title:** *Miscellaneous Sayings on the Pivotal Mechanisms of the Three Caverns*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Methods* category of the *Dongshen* section\n\n---\n\n### **Daily Daoist Exercises: The Immortal’s First Stage**\n\nAt dawn each morning—or at the first watch of the fifth night watch—calm the mind and settle the thoughts. Clench the fists to retain spirit, sit with solemn dignity, and sever all worldly concerns. In stillness, free of thought, visualize the body within the formless and the mind within the realm of non-action. Thus, harmonious *qi* will naturally arise. Then, knock the teeth seven times and swallow saliva seven times, each time directing the saliva down to the lower *dantian*. With time, it will become a treasure.\n\nNext, relax the body and limbs to perform the twelve forms of *daoyin*:\n\n1. **Opening the Hundred Passes**\n   Grasp both feet with both hands, three times. With each repetition, swallow and retain the breath without exhaling.\n\n2. **Left and Right Pressing**\n   Thread one hand past the shin to grasp the top of the foot, while the other hand presses the calf. Alternate sides, performing three repetitions each. With each, swallow and retain.\n\n3. **Single Leg Extension**\n   Extend one foot while one hand supports the bed and the other grasps the foot. Alternate sides, three times each. With each, swallow and retain.\n\n4. **Double Foot Grasping**\n   Grasp one foot with both hands, alternating sides three times. With each, swallow and retain.\n\n5. **Left and Right Pressing the Void**\n   Interlock the backs of the hands, extend the elbows, and slowly release. Grasp the breast with one hand while the other presses into the empty space, as if pushing a heavy object. Alternate sides, three times each. With each, swallow and retain.\n\n6. **Supporting the Sky and Pressing the Earth**\n   Interlock the hands, raise them overhead, and slowly lean the head forward until it is one or two *cun* from the ground. Perform three times. With each, swallow and retain.\n\n7. **Dragon Coiling and Phoenix Beak**\n   Thread the left hand through the right, interlocking the wrists, and press the fingertips together. Alternate sides, three times each. With each, swallow and retain.\n\n8. **Phoenix Spreading Its Wings**\n   First swing the hands back, then extend them forward like a phoenix spreading its wings. Alternate three times. With each, swallow and retain.\n\n9. **Left and Right Swinging**\n   Interlock the hands, cradle the head, and swing left and right. Perform three times. With each, swallow and retain.\n\n10. **Pushing East and West**\n    Interlock the hands, extend them forward, and swing east and west. Perform three times. With each, swallow and retain.\n\n11. **Striking the Gate of Heaven**\n    Interlock the hands and rub the nose. Every seven rubs count as one repetition, followed by one swallow. Perform three sets of seven (twenty-one swallows in total).\n\n12. **The Immortal’s Dry Bath**\n    Rub the hands together until warm, then massage the eyes, face, ears, neck, and shoulders as if washing them. The more repetitions, the better.\n\nThe above daily *daoyin* exercises, though ideally performed at dawn, are not restricted to morning or evening. Practice them regularly when unoccupied, and naturally, the hands will grow skillful, the sinews supple, the bones strong, and the *qi* harmonious. Illnesses will be dispelled, vitality will flourish, excess food will be digested, hunger will subside, and all endeavors will proceed without obstruction. Though one may not yet attain longevity, prolonged practice will eliminate superficial ailments of the body.\n\nAs the saying goes:\n*Even if no great power is gained,*\n*It still surpasses needless toil of the mind.*\nThis is the truth of it.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 714,
      "start_sentence": 0,
      "end_sentence": 33,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.94053626060486,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\三洞枢机杂说.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "啄咽按摩法 《真诰》云：夜行常当啄齿，啄齿亦无止限数，杀鬼、邪鬼，常畏齿声，是故不得犯人。 若兼以漱液、祝说，亦善也。 仙人刘京语皇甫隆曰：夫朝睡起，未澡洗之前，安坐漱口中唾，曰玉泉，令满口，咽之； 即叩齿二七止，又更漱唾如前，又叩齿，一如上法。 夫叩齿者，召身内神，令安之也； 又令人齿不朽。 咽液者，令人身体光润力壮，有颜色，去三尸虫，名曰炼精，使人长生。 若能终身行之，得仙也。 《真诰太素丹景经》曰：一面之上，欲常得两手摩拭之热，高下随形，皆使极雨。 令人面有光泽，皱斑不生。 行之五年，色如少女。 先当切摩两掌令热，然后拭面目，顺手摩发，如理栉之状，两臂亦更互以手摩之，使发不白，脉不浮。 《外大洞真经精景按摩篇》曰：卧起，当平气正坐，先叉两手，乃度以掩项后因，即面视上，使项与两手争，为之三四，使人精和血通，风气不能入。 久行之，不死不病。 又屈动身体，伸手四极，反张宣摇百关，各为之三。 又引《消魔上灵经》曰：若体中不宁，当反舌塞喉，漱满咽液无数。 须臾，不宁之痾自即除也，亦觉身中宽软。 又曰：鼻亦得按其左右，唯令无数也。 令人气平，所以灌溉中岳，名书帝录。 坐常欲闭目，内视五藏肠胃，久行之，自得分明了了也。 常能手掩口鼻，临目微气，久许时，手中生液，遂以摩面目，常行之，令人体香。 真诰云：栉头理发，欲得多过，通血气，散风湿也。 数易栉，更番用之也。 亦可不须解发。 《太极经》曰：理发欲向王地，既栉发之始而微祝曰：泥丸玄华，保精长存； 左为隐月，右为日根； 六合精炼，百神受恩。 祝毕，咽液三过，能常行之，发不落，而日生之。 当数易栉，栉取多，而不使痛。 亦可令侍者栉，取多也。 血液不滞，发根常坚也。 《赤书玉诀》下云：太玄上宫北帝常以庚申日，制天民，三尸魂神条人罪状，上奏帝君。 当此日，能修斋奉戒，昼夜思神，则三尸不得上天言人之罪，地司奏人善功列言。 帝君太一欢喜，即记姓名左契长为种民。 太上上宫至真尊神，常以甲子日，遣太一中台大使 者，下周诸地诸天，检校神祇，枝散杂俗鬼精。 又其日，能斋烧香，中台大使者皆条善功，奏上三天，上帝即为除监天领地鬼神主，书名玉历，长为真人。 北帝曲折祝 《真诰》云：风病之所生，生於丘坟、阴湿，三泉壅滞。 是故，地官以水气相激，多作风痹之疾。 重者举体不授，轻者半身，或失手足也。 若常梦在东北及西北，经接故居，或见灵状处所者，正欲与冢气相接也。 墓之东北为绝命，西北为九厄，此皆冢讼之凶地。 若见亡者於其间，益其验也。 若遇此梦者，卧觉，当正向上三啄齿，而祝之曰：太元上玄九都紫天，理魂护命高素真人，我受上法，受教泰玄； 长生久视，身飞体仙； 冢墓永安，鬼讼塞闲，魂魄和悦，恶气不烟；",
      "translated_text": "**The Method of Pecking, Swallowing, and Massage**\n\n*The Zhen’gao* states: When traveling at night, one should frequently clack the teeth. There is no fixed number for clacking the teeth, for it slays demonic and malevolent spirits, who ever dread the sound of teeth. If one combines this with rinsing the mouth and reciting incantations, it is also excellent.\n\nThe immortal Liu Jing said to Huangfu Long: Upon rising in the morning before washing, sit calmly and rinse the saliva in the mouth—called \"jade spring\"—until it fills the mouth, then swallow it. Immediately clack the teeth fourteen times, then rinse and swallow the saliva again as before, and clack the teeth once more, following the same method. Clacking the teeth summons the spirits within the body and settles them, and it also prevents the teeth from decaying. Swallowing the saliva makes the body radiant and strong, bestows a lustrous complexion, expels the Three Corpses worms, and is called \"refining the essence,\" enabling one to attain longevity. If practiced throughout life, one may achieve immortality.\n\n*The Zhen’gao Taisu Danjing Jing* states: On the face, one should frequently rub the hands until warm, then massage the face in all directions, following its contours, pressing deeply as if in a heavy rain. This gives the face a luminous glow and prevents wrinkles and blemishes. After five years of practice, the complexion will resemble that of a young maiden. First, vigorously rub the palms until hot, then wipe the face and eyes. Stroke the hair with the hands as if combing it, and alternately massage the arms with the hands to prevent graying hair and floating pulse.\n\n*The Wai Dadong Zhenjing Jingjing Anmo Pian* states: Upon rising from bed, sit upright and regulate the breath. First, clasp the hands and place them behind the neck, then look upward, causing the neck to strain against the hands. Do this three or four times to harmonize the essence and circulate the blood, preventing wind and qi from entering. With prolonged practice, one will neither die nor fall ill. Additionally, bend and stretch the body, extend the limbs to their utmost, and arch the back while loosening the hundred joints, each performed three times.\n\nIt also cites *The Scripture on Dispelling Demons and Ascending Spirits*: If the body feels unwell, press the tongue against the throat, rinse the mouth with saliva, and swallow it repeatedly. Soon, the discomfort will dissipate, and the body will feel relaxed and supple. It further states: Pressing the sides of the nose without limit regulates the breath, irrigates the Central Peak, and is recorded in the Emperor’s register. When sitting, one should often close the eyes and inwardly visualize the five viscera and intestines. With prolonged practice, they will become distinctly clear.\n\nOne should frequently cover the mouth and nose with the hands, breathe gently through the eyes for a long while until fluid forms in the palms, then use it to massage the face and eyes. Regular practice will make the body fragrant.\n\n*The Zhen’gao* states: Combing the hair should be done frequently to circulate the blood and qi and dispel wind and dampness. Alternate combs should be used, and the hair need not be unbound. *The Taiji Jing* states: When combing the hair, face the direction of the king. At the start of combing, silently recite: *\"Mud-pellet’s dark flower, preserve essence and long endure; left as the hidden moon, right as the sun’s root; six harmonies refine the essence, a hundred spirits receive grace.\"* After reciting, swallow the saliva three times. With regular practice, the hair will not fall out but will grow anew. Combs should be changed often, and the combing should be thorough but not painful. One may also have an attendant comb the hair to ensure thoroughness, preventing stagnation of blood and qi and strengthening the hair roots.\n\n*The Lower Scroll of the Red Writ and Jade Formulae* states: On the day of *gengshen*, the Supreme Lord of the Northern Palace of the Great Mystery records the transgressions of the Three Corpses and the spirits of the people, submitting them to the Emperor. On this day, if one observes purification rites, upholds the precepts, and contemplates the spirits day and night, the Three Corpses will be unable to ascend to heaven and report one’s sins. The Earthly Offices will instead record one’s good deeds. The Emperor and the Great Unity will rejo",
      "overlap_context": "nd naturally, the hands will grow skillful, the sinews supple, the bones strong, and the *qi* harmonious. Illnesses will be dispelled, vitality will flourish, excess food will be digested, hunger will subside, and all endeavors will proceed without obstruction. Though one may not yet attain longevity, prolonged practice will eliminate superficial ailments of the body.\n\nAs the saying goes:\n*Even if no great power is gained,*\n*It still surpasses needless toil of the mind.*\nThis is the truth of it.",
      "start_char": 715,
      "end_char": 1825,
      "start_sentence": 34,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.62560224533081,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\三洞枢机杂说.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "游魅冈象，敢干我神； 北帝打制，收气入渊； 得录上皇，谨奏玉晨。 如此者再祝，又三叩齿，则不梦梦冢墓及家死鬼。 若常得恶梦不祥者，皆可按此法。 於是鬼炁灭，邪魅散形也。 又云：手臂不护者，沈风毒炁在脉中结痾，痹骨使人然也。 宜针灸则愈，又宜按北帝曲折之祝。 若行之百过，病亦消除也。 先以一手，徐徐按摩疾臂。 良久毕，乃瞑目内视，咽唾三过，叩齿三通，正心微祝曰：太上四玄，五华六庭。 三魂七魄，天开地精。 神府营卫，天胎上明。 四支百神，九节万灵。 受录玉晨，刊书玉城。 玉童侍身，玉童护命。 永齐一景，飞仙上清。 长与日月，年俱后倾。 超腾升仙，得整太平。 流风结痾，注鬼五飞。 魍魅冢气，阴气相徊。 凌我四支，干家盛衰。 太一天丁，龙虎曜威。 斩鬼不祥，风邪即摧。 考注匿讼，百毒隐非。 使我复常，日月同晖。 考注见犯北辰，忮如干明上威。 昔唐览居山，为鬼所击，举身不授如绵囊。 有道人教，按此法，皆即除之。 此北帝曲折之法，诸疾有曲折者，用此法皆佳，不但风痹不授而已。 唐览今在华山合虹，丹服得不死。 真人问曰：凡人何故数有病乎？ 神人答曰：故肝神去，出游不时还，目无明也。 心神去不在，其唇青白也。 肺神去不在，其鼻不通也。 肾神去不在，其耳聋也。 脾神去不在，令人口不知甘也。 头神去不在，令人眴冥也。 腹神去不在，令人中央甚不调，无所能化也。 四肢神去，令人不能自移也。 夫精神，其性常居空闲，不居混浊。 欲思其神，皆当斋戒，悬象室中，百病消亡。 不斋不戒，精神不肯还反人也，皆上天共诉人也。 所以，人病积多，死者不绝。 又云：以两手摩拭面目，令小热，以为常，每欲数也。 人之将老面皱者，先从两目下始也。 人之体衰气少者，先从两肾间始也。 谓此二处，皱衰之户牖，气力之关津。 故起居常行此法，以辟皱衰，而气力常保康和也。 《灵宝天地运度经》云：灵宝自然运度，有大阳九大百六也，小阳九小百六也。 三千六百六十年，为小阳九小百六也。 九千九百年，为大阳九大百六。 夫天息谓之阳九，地亏谓之百六。 至金氏之后甲申之岁，是天地运度否泰所终。 阳九会至时，道德方明，凶丑顿释，圣君受任於壬辰之年也。 《黄素四十四方经》云：常夜寝欲合眼时，以手抚心三过，闭目微祝曰：太灵九宫，太一守房。 百神参位，魂魄和同。 长生不死，塞灭邪凶。 祝毕而寝，此名为九宫隐祝寝魂之法。 常能行之，使人魂魄安宁，常吉利也。 又耳鸣者，外使入也。 耳神娇女云：宜即声锺，以闻九宫，使知外人来入，令备也。 声锺者，是今耳鸣之音也。 其闻之者，错手掩耳而祝曰：赤子在宫，九真在房。 清听神命，亦察不祥。 太一流火，以灭万凶。 圣真仙品 圣真仙，各三合为九品。 九品又各有三合，为二十七品。 玉清以圣为正位，上清以真为正位，太清以仙为正位。 至於圣亦称真，真亦称圣，仙亦称真，真亦称仙，仙亦称圣，圣亦称仙。 一千年一圣，五百年一真，一百五十年一仙，百年一贤也。 《无上真人文始内传》云：诸天神王，散花烧香，以供养得道之人也。 又云：太上遣绣衣使者，传命与君喜。 《庄子·秋水第十七篇》云：庄子与惠子，游於濠梁之上。",
      "translated_text": "When spectral apparitions and tomb phantoms dare to offend my spirit,\nMay the Northern Emperor strike them down and cast their qi into the abyss;\nRecorded in the registers of the Supreme August, reverently presented to the Jade Dawn.\nRecite this invocation twice, then knock the teeth thrice—\nThus shall one no longer dream of tombs or the ghosts of deceased kin.\nFor those who frequently suffer inauspicious dreams, this method may be applied.\nThereby, ghostly qi vanishes and malevolent specters disperse.\n\nIt is further said: If the arms remain unguarded, sinking wind-toxins and stagnant qi congeal in the meridians, causing numbness in the bones and rendering one inert. Acupuncture and moxibustion may cure this, as may the invocation of the Northern Emperor’s *Qu Zhe* (Twisting and Turning). Should one practice this a hundred times, the ailment will also dissipate.\n\nFirst, gently massage the afflicted arm with one hand. After a long while, close the eyes and turn the gaze inward, swallow saliva thrice, and knock the teeth three times. Compose the mind and softly invoke:\n*\"Supreme Four Mysteries, Five Florets, Six Courts.\nThree Hun and Seven Po, Heaven’s Opening and Earth’s Essence.\nDivine Palace, Guardians of the Body, Celestial Embryo, Radiant Above.\nFour Limbs and Hundred Spirits, Nine Joints and Myriad Numinous Ones.\nEnrolled in the Jade Dawn, inscribed in the Jade City.\nJade Lads attend my body, Jade Lads guard my life.\nEver aligned with the One Light, ascending as an immortal to the Upper Clarity.\nLong as the sun and moon, years enduring beyond measure.\nTranscending to ascend as an immortal, attaining the Great Peace.\nSwirling winds and congealed ailments, demonic qi and flying ghosts,\nTomb specters and yin vapors, lingering malign forces—\nAssailing my four limbs, disrupting my household’s prosperity.\nGreat Unity’s Celestial Soldiers, Dragon and Tiger manifesting might,\nSever the inauspicious ghosts, shatter the wind-demons.\nExamine and expel hidden grievances, conceal all poisons and wrongs.\nRestore me to normality, that I may shine with the sun and moon.\nIf examined and found transgressing the Northern Asterism, let them be as those who offend the radiant majesty above.\"*\n\nIn ancient times, Tang Lan dwelled in the mountains and was struck by a ghost, leaving his body limp as a silk sack. A Daoist taught him this method, and he was immediately cured. This is the *Qu Zhe* method of the Northern Emperor—effective for all ailments involving twisting or obstruction, not merely wind-induced numbness. Tang Lan now resides on Mount Hua, refining the elixir and attaining immortality.\n\nA Perfected One asked: *\"Why do people frequently fall ill?\"*\nA Divine Person replied: *\"When the liver spirit departs and does not return in due time, the eyes lose their brightness. When the heart spirit is absent, the lips turn pale. When the lung spirit is absent, the nose becomes blocked. When the kidney spirit is absent, the ears grow deaf. When the spleen spirit is absent, the mouth cannot taste sweetness. When the head spirit is absent, one becomes dizzy and disoriented. When the abdominal spirit is absent, the center becomes disordered, and nothing can be transformed. When the spirits of the four limbs depart, one cannot move. The nature of spirit and essence is to dwell in emptiness and stillness, not in turbidity and chaos. To summon the spirits, one must fast and observe precepts, suspending their images in the chamber—thus, all illnesses vanish. Without fasting and precepts, the spirits will not return to the person but will instead ascend to heaven to lodge complaints. Hence, people’s illnesses accumulate, and the dead are unending.\"*\n\nIt is further said: Rub the face and eyes with both hands until slightly warm, making this a regular practice. Wrinkles in the aging face first appear beneath the eyes, while the decline of the body and depletion of qi begin between the kidneys. These two places are the gates and windows of wrinkles and decay, the passes and fords of vitality. Therefore, practicing this method in daily life wards off wrinkles and decline, preserving health and harmony.\n\n*The Scripture of the Celestial Treasure’s Natural Cyclical Movements* states: The Celestial Treasure’s natural cycles include the Greater Yang Nine and Greater Hundred Six, as well as the Lesser Yang Nine and Lesser Hundred Six. Three thousand six hundred and sixty years constitute the Lesser Yang Nine and Lesser Hundred Six. Nine thousand nine hundred years constitute the Greater Yang Nine and Greater Hundred Six. The heavens’ exhaustion is called Yang Nine, and the earth’s depletion is called Hundred Six. In the *jiashen* year following the Jin clan’s era, the cycles of heaven and earth’s fortune and misfortune reach their conclusion. When the Yang Nine assembly arrives, the Dao and virtue become manifest, calamities and ugliness instantly dissolve, and the sagely ruler assumes his mandate in the *renchen* year.\n\n*The Yellow Writs of the Forty-Four Methods* states: When retiring at night and about to close the eyes, press the hand over the heart thrice, shut the eyes, and softly invoke:\n*\"Supreme Numinous Nine Palaces, Great Unity guards the chamber.\nHundred spirits assume their positions, hun and po harmonize.\nLong life without death, sealing away inauspiciousness and misfortune.\"*\nAfter the invocation, sleep—this is called the *Nine Palaces Hidden Invocation for Sleeping Spirits*. Practicing this regularly brings peace to the hun and po, ensuring constant good fortune.\n\nIf the ears ring, it is due to external influences intruding. The ear spirit, Jiao Nü, says: One should immediately sound the bell to alert the Nine Palaces, informing them of the outsider’s intrusion so they may prepare. The \"bell sound\" refers to the ringing in the ears. Upon hearing it, cross the hands to cover the ears and invoke:\n*\"The Red Child dwells in the palace, the Nine Perfected in the chamber.\nAttend to the divine command, discerning the inauspicious.\nGreat Unity’s flowing fire extinguishes the myriad misfortunes.\"*\n\nThe ranks of the Perfected and Immortals:\nPerfected and Immortals are each divided into three grades, forming nine ranks. Each of these nine ranks is further divided into three, totaling twenty-seven ranks. In the Jade Clarity, the Perfected hold the primary position; in the Upper Clarity, the True Ones hold it; and in the Great Clarity, the Immortals hold it. Yet the Perfected may also be called True, the True may be called Perfected, the Immortals may be called True, the True may be called Immortals, the Immortals may be called Perfected, and the Perfected may be called Immortals. A Perfected appears every thousand years, a True One every five hundred, an Immortal every hundred and fifty, and a Worthy every hundred.\n\n*The Inner Transmission of the Supreme Perfected and Primordial Master* states: The divine kings of the heavens scatter flowers and burn incense to honor those who attain the Dao. It is further said: The Supreme Lord dispatches envoys in embroidered robes to convey felicitations.\n\n*Zhuangzi, \"Autumn Floods\" (Chapter Seventeen)* states: Zhuangzi and Huizi strolled above the Hao Bridge.",
      "overlap_context": "ae* states: On the day of *gengshen*, the Supreme Lord of the Northern Palace of the Great Mystery records the transgressions of the Three Corpses and the spirits of the people, submitting them to the Emperor. On this day, if one observes purification rites, upholds the precepts, and contemplates the spirits day and night, the Three Corpses will be unable to ascend to heaven and report one’s sins. The Earthly Offices will instead record one’s good deeds. The Emperor and the Great Unity will rejo",
      "start_char": 1825,
      "end_char": 3062,
      "start_sentence": 82,
      "end_sentence": 156,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.893932580947876,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\三洞枢机杂说.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "庄子曰：鲦鱼出游从容，是鱼乐也。 惠子曰：子非鱼，安知鱼之乐耶？ 庄子曰：子非我，安知我不知鱼之乐耶？ 惠子曰：我非子，故不知子矣。 子固非鱼也，子之不知鱼，全矣？ 庄子曰：请循其本。 惠子曰：汝安知鱼乐云者，既已知吾知之而问我，我知之濠上也。 方谦之字道冲，冀州赵邦柏人县人，外身济物，山家多患山疟，寄名即断。 人有请其方者，谦之答曰：心正可以治邪，吾居贫无财可施，常诵法轮《道德经》随喜众善，慈悲众恶，如此可以自治，亦能治他也。 《神仙传》，麻姑以米掷地，视米堕地，皆成丹砂。 王方平笑曰：姑故年少也，吾老耳了，不喜复作此曹狡狯变化也。 孙博河东人，有清才，能属文，乃学道，治墨子之术。 能使草木金石皆为火，光照数里。 亦能使我身成炎火，口中吐火，指大树生草，皆枯焦。 更指之，则复如故。 亦能使三军之众，各成一聚火也。 每作火烧他人，以水沃之，经日不灭，须博自指乃止也。 行大水中，非但己身不沾濡，能使从者数百人皆不沾。 又能於水上布席，坐饮食作乐，使人舞水上，不设而尽欢。 有疾病者，就恃自治，亦无以云，为直指之，言愈即愈。 又能吞刀剑，及从壁中出入。 引镜为刀，屈刀为镜，可积时不改，须博指之，乃复故形也。 后入林，虑山中舍神丹而仙去矣。 叙朮",
      "translated_text": "Zhuangzi said: \"See how the minnows swim so leisurely—this is the joy of fish!\"\nHuizi replied: \"You are not a fish—how can you know the joy of fish?\"\nZhuangzi said: \"You are not me—how can you know that I do not know the joy of fish?\"\nHuizi said: \"I am not you, so I do not know you. But you are certainly not a fish—is it not complete that you do not know the joy of fish?\"\nZhuangzi said: \"Let us return to the beginning. When you asked, *'How do you know the fish are joyful?'*—you already knew that I knew, yet you asked me. I knew it here above the Hao.\"\n\nFang Qian, styled Daochong, was a native of Baixiang County in Zhaobang, Jizhou. He cared for others while neglecting himself. The mountain folk often suffered from miasmic malaria, but those who took refuge in his name were cured. When people begged for his method, Qian replied: \"A rectified heart can dispel evil. I dwell in poverty and have no wealth to give, but I constantly recite the *Dharma-Wheel Scripture of the Dao and Its Virtue*, rejoice in all good deeds, and show compassion toward all wrongs. This can heal oneself—and others as well.\"\n\nIn *The Traditions of Divine Transcendents*, when Magu scattered rice upon the ground, the grains that fell became cinnabar. Wang Fangping laughed and said: \"You are still young, girl—this is why you delight in such clever transformations. I am old now and no longer care for such tricks.\"\n\nSun Bo of Hedong was a man of refined talent, skilled in composition. He studied the Dao and practiced the arts of Mozi. He could make plants, trees, metal, and stone all burst into flame, their light illuminating for miles. He could also turn his own body into a blazing fire, breathe flames from his mouth, and point at great trees or growing grass to wither them instantly—then point again to restore them as before. He could even cause an entire army to divide into separate columns of fire. When he set fire to others, water poured upon the flames would not extinguish them for days—only when Bo pointed at them would they cease. When crossing great waters, not only did his own body remain dry, but he could keep hundreds of followers from getting wet. He could also spread mats upon the water, sit and feast, make merry, and have people dance upon the surface without sinking, all rejoicing without restraint. Those who were ill would seek his aid, and he would heal them without a word—merely pointing at them and declaring their recovery, and they would be cured. He could also swallow swords, pass through walls, and bend mirrors into blades or blades into mirrors, maintaining the transformation indefinitely until he pointed at them to restore their original form. Later, he entered the forest, fearing that the mountain spirits might have taken his elixir, and ascended as a transcendent.",
      "overlap_context": "thousand years, a True One every five hundred, an Immortal every hundred and fifty, and a Worthy every hundred.\n\n*The Inner Transmission of the Supreme Perfected and Primordial Master* states: The divine kings of the heavens scatter flowers and burn incense to honor those who attain the Dao. It is further said: The Supreme Lord dispatches envoys in embroidered robes to convey felicitations.\n\n*Zhuangzi, \"Autumn Floods\" (Chapter Seventeen)* states: Zhuangzi and Huizi strolled above the Hao Bridge.",
      "start_char": 3062,
      "end_char": 3579,
      "start_sentence": 157,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.740489959716797,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\三洞枢机杂说.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "夫木乃辟塞邪津，气遏鬼路矣。 餐其丸饵，则灵心四敷，荣卫轻盈。 服其煎散，则百疾瘳除，可以长生久视也。 合木方不录。 南烛 凶年无谷，或穷不能得者，皆单服南烛，或和茯苓，或以蜜和南烛，或杂松柏叶也。 南烛草木捣，取汁以掩青龙之稻米，作药服之。 其树是木而似草，故号曰南烛草木，一名猴药，一名男读，一名后卓，一名惟那木，一名草木之王。 名山皆有，吴越最多。 《太真科》中卷云：天子邦畿，有田千里，供宗庙赡遐迩。 象日月之遥，故千里也。 号曰京师，京大也，师众也。 天子所居，大众归集也。 《老君枕中开阖经》云：此生气常当安隐某身，勿得妄出也。 口是五灾户，心是八毒门。 □□□□□□□。 凡书符，先念三过。 部临啮鳞。 书符於胡饼上，密咒七遍。 前符真书 每朝清旦，叩齿二十四通，持此咒三遍。 然后向东，以茅香汤，服符三丸。 咒曰：皇灵之宝珍，弥劫无衰朽。 精神常和同，算命自长久。 坚存不暂亏，能破诸殃咎。 真人秘此文，慎终常如首。 急急一如太上老君口勑律令。 通灵真香法 夫香者，所以降灵通神，传言驿行，导达往来，表明远近。 所以典香侍香、玉童玉女、香官使者，专司其职，不可轻也。 出三洞备炼科。 《流珠经》云：烧异域秽臭毒恶辛烈之香，谓乳香、螺甲香。 此犯道禁，非真人常修行之香也。 真人爱紫微幽木之香，闻者皆喜。 谓沈水笺香。 胡香辛烈毒恶，真人恶之。 胡香谓乳香。 桐柏直人王子晋谓清虚真人王子登曰：昔苏上卿爱烧辛烈之香，炁冲於中华天尊形像之前，地府上奏，太上恶之，乃退减仙位。 《神仙香谱》云：世人多以乳香供天，夫乳香者，一名胡香，上帝与五星恶闻者，盖炁味辛烈，熏秽故也。 螺甲麝脐，尤为所忌。 沈香、笺香、降真香、白檀香、苏合香、青木香，此香上冲四十里。 丁香、安息香，此香辟邪却秽。 龙脑只可用生者，熟龙脑，虑其木之炁间杂。 降真香珠法 以沈水香三斤，熏木香二斤，青木香九两，鸡舌香五两，乌参三两，雀头香六两，香白茞二两，詹匐香二两，白檀二两，艾香三两，安息香四两，木兰三两，凡十二物。 别捣筛毕，内乾枣肉十两，捣三万杵，於白瓮器中蒸一日，以白密三斤和，令相得捣，熟丸之如鸡头子，大青线穿之，曝令乾，名曰三真九和香珠丸。 坛内烧之，上彻九天，天真玉女闻之，降鉴於虚空之中。 出九天生神斋仪。 香油神烛法 《洞神经》香油法。 以沈水香九斤，青桂皮三斤，青木香十两，真檀十两，鸡舌香八两，苏合香八两，雀头香十两，零陵香十八两，乾枣脂二十两，藿香十两，萱苏六两，白茞八两，凡十二物。 先斋，取平、建、开、成日，东向或南向，锉，绢囊盛。 沈油中，七日勿开。 若捣节蜜和，阳燧火烧之，感降真灵。 出三洞道士修炼科。 神烛油法。 詹匐五两，熏陆三两，零陵香六两，甘松六两，白茅香三两，乌参三两，白茞三两，凡七物。 锉令细，绢囊盛之，沈油中三日或五日、七日，然后用之然灯，财灵香馥郁，可以感降天真矣。 修香灯之要，必在彩笼罩之，护虫拒风，而光延久尔。 斋坛灯烛之外，蜡炬以多为佳，不可阙也。 出九天生神仪。 香方 新茅香，二十两，净择去浮皮，取净十二两，细锉，以蜜二两同炒，令黄。",
      "translated_text": "The wood blocks evil paths and seals demonic routes, obstructing the way of spirits. Consuming its pills and elixirs, one’s spirit flourishes in all directions, while the *qi* of nourishment and defense becomes light and agile. Ingesting its decoctions and powders dispels all ailments, enabling longevity and enduring vision. The formula for compounding this wood is not recorded here.\n\nDuring famine years when grain is scarce, or when the destitute cannot obtain it, they may rely solely on *nan zhu* (southern candlewood), or mix it with *fu ling* (poria), or blend it with honey, or combine it with pine and cypress leaves. Pound the *nan zhu* plant, extract its juice, and soak the green-dragon rice in it to prepare the medicinal concoction. This tree is woody yet resembles grass, hence it is called *nan zhu cao mu* (southern candlewood plant). It is also named *hou yao* (monkey medicine), *nan du*, *hou zhuo*, *wei na mu*, or the \"King of Plants.\" It grows in all famous mountains, with the greatest abundance in Wu and Yue.\n\nThe middle scroll of *The Canon of the Supreme Perfected* states: \"Within the thousand *li* of the Son of Heaven’s domain, fields supply the ancestral temples and sustain the distant and near. Like the sun and moon in their vastness, this expanse spans a thousand *li*, hence it is called the *jing shi* (capital). *Jing* means great, and *shi* means multitude—the Son of Heaven’s abode, where the great multitude gathers.\"\n\n*The Scripture of Opening and Closing in the Pillow of Lord Lao* says: \"This vital *qi* should always remain calmly within the body; do not let it recklessly depart. The mouth is the gateway of the five disasters, and the heart is the door of the eight poisons. [...] When writing talismans, first recite the incantation three times. [...] Bite the brush’s tip. Write the talisman on a sesame cake, secretly chanting the spell seven times.\"\n\n**Authentic Talisman Script**\nEach morning at dawn, knock the teeth twenty-four times and recite this incantation thrice. Then, facing east, take three talisman pills with tea made from *mao xiang* (cogon grass). The incantation reads:\n*\"Treasure of the August Spirit, imperishable through kalpas untold.\nMind and spirit ever harmonized, lifespan naturally prolonged.\nFirm and unyielding, never waning, dispelling all misfortunes and woes.\nThis script is concealed by the Perfected; guard it well to the end as at the start.\nSwiftly, swiftly, as the command of the Most High Lord Lao!\"*\n\n**Method for Communicating with True Incense**\nIncense serves to summon spirits, convey messages, guide comings and goings, and signal distances. Thus, those who tend incense, attend to incense, or serve as jade lads, jade maidens, or incense officials must fulfill their duties with reverence, never treating it lightly. As recorded in *The Comprehensive Refinement Canon of the Three Caverns*.\n\n*The Scripture of the Flowing Pearl* states: \"Burning foreign, foul, toxic, or pungent incense—such as frankincense or conch-shell incense—violates Daoist prohibitions and is not the incense used by true practitioners. True practitioners favor the subtle fragrance of *zi wei* (purple-tinted) and secluded woods, which delights all who encounter it. This refers to *chen xiang* (aloeswood) and *jian xiang* (eaglewood). Foreign incense, with its pungent toxicity, is detested by true practitioners—this refers to frankincense.\"\n\nWang Zijin, the Upright Man of Tongbai, said to Qingxu Zhenren Wang Zideng: \"In the past, Su Shangqing loved burning pungent incense, its *qi* surging before the image of the Celestial Worthy of Primordial Beginning. The Earthly Bureau reported this to the Most High, who disapproved and subsequently demoted his immortal rank.\"\n\n*The Fragrant Register of Divine Immortals* states: \"Many in the world offer frankincense to Heaven. Frankincense, also called foreign incense, is detested by the Supreme Emperor and the Five Planets, for its *qi* is pungent and foul. Conch-shell incense and musk are especially forbidden. *Chen xiang* (aloeswood), *jian xiang* (eaglewood), *jiang zhen xiang* (resinous eaglewood), *bai tan xiang* (sandalwood), *su he xiang* (storax), and *qing mu xiang* (aristolochia) carry their fragrance forty *li* upward. *Ding xiang* (clove) and *an xi xiang* (benzoin) repel evil and dispel impurity. Only raw *long nao* (borneol) may be used; cooked borneol risks contamination by the *qi* of its wood.\"\n\n**Method for Making Descending-Truth Fragrant Beads**\nTake three *jin* of *chen shui xiang* (aloeswood), two *jin* of *xun mu xiang* (costusroot), nine *liang* of *qing mu xiang* (aristolochia), five *liang* of *ji she xiang* (clove), three *liang* of *wu shen* (black ginseng), six *liang* of *que tou xiang* (sparrow-head incense), two *liang* of *xiang bai zhi* (angelica), two *liang* of *zhan fu xiang* (benzoin), two *liang* of *bai tan* (sandalwood), three *liang* of *ai xiang* (mugwort), four *liang* of *an xi xiang* (benzoin), and three *liang* of *mu lan* (magnolia). Grind each separately, then mix with ten *liang* of dried jujube pulp. Pound thirty thousand times, steam in a white porcelain vessel for a day, blend with three *jin* of white honey, and pound until well combined. Form into pills the size of *ji tou* seeds (gorgon fruit), string them with green thread, and dry in the sun. These are called the *Three Perfections and Nine Harmonies Fragrant Bead Pills*. When burned on the altar, their fragrance ascends to the Nine Heavens, where the Heavenly Perfected and Jade Maidens, perceiving it, descend to witness the ceremony in the void. Recorded in *The Rites of the Nine Heavens’ Life-Nourishing Fast*.\n\n**Method for Divine Candle Oil**\nFrom *The Scripture of the Cavernous Spirit*, the method for fragrant oil: Take nine *jin* of *chen shui xiang* (aloeswood), three *jin* of *qing gui pi* (green cinnamon bark), ten *liang* of *qing mu xiang* (aristolochia), ten *liang* of *zhen tan* (true sandalwood), eight *liang* of *ji she xiang* (clove), eight *liang* of *su he xiang* (storax), ten *liang* of *que tou xiang* (sparrow-head incense), eighteen *liang* of *ling ling xiang* (highland basil), twenty *liang* of dried jujube fat, ten *liang* of *huo xiang* (patchouli), six *liang* of *xuan su* (perilla), and eight *liang* of *bai zhi* (angelica). After purifying through fasting, select an auspicious day—*ping*, *jian*, *kai*, or *cheng*—face east or south, and chop the ingredients. Place them in a silk bag and steep in oil for seven days without opening. If pounded and mixed with honey, then ignited with a solar-concentrating mirror, it will attract and summon true spirits. Recorded in *The Refinement Canon for Daoist Practitioners of the Three Caverns*.\n\n**Method for Divine Candle Oil**\nTake five *liang* of *zhan fu* (benzoin), three *liang* of *xun lu* (frankincense), six *liang* of *ling ling xiang* (highland basil), six *liang* of *gan song* (spikenard), three *liang* of *bai mao xiang* (cogon grass), three *liang* of *wu shen* (black ginseng), and three *liang* of *bai zhi* (angelica). Chop finely, place in a silk bag, and steep in oil for three, five, or seven days. Then use it to light lamps, and the fragrance will be rich and lingering, capable of summoning and descending heavenly perfected beings. The key to refining incense and lamps lies in using colored lantern covers to shield from insects and wind, thereby prolonging the light. Beyond the lamps and candles of the fasting altar, wax torches should be abundant and never lacking. Recorded in *The Rites of the Nine Heavens’ Life-Nourishing Fast*.\n\n**Incense Formula**\nTake twenty *liang* of fresh *mao xiang* (cogon grass), clean and remove the outer skin, retaining twelve *liang* of the pure material. Chop finely, stir-fry with two *liang* of honey until yellow.",
      "overlap_context": "hout restraint. Those who were ill would seek his aid, and he would heal them without a word—merely pointing at them and declaring their recovery, and they would be cured. He could also swallow swords, pass through walls, and bend mirrors into blades or blades into mirrors, maintaining the transformation indefinitely until he pointed at them to restore their original form. Later, he entered the forest, fearing that the mountain spirits might have taken his elixir, and ascended as a transcendent.",
      "start_char": 3579,
      "end_char": 4863,
      "start_sentence": 181,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.10111355781555,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\三洞枢机杂说.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "香附子，二两锉。 丁香皮一两半。 黄檀七两，细锉。 降真香。 一两。 右捣令均碎，炼好蜜二十四两，和揉匀，以瓷器盛，埋阴地三、二尺，十日外取用。 每料用蜜拌和讫，入笺香粗末三两。 清远香方 甘松，十两。 香白芷，三十两。 玄参，五两。 零陵香，六两。 茅香，七两。 丁香皮，五两。 藿香，三两。 香附子，三两。 木麝，半斤。 降真香。 五两。 右件净洗，锉捣为粗末，炼蜜和之，器盛之，久窨。 三洞枢机杂说竟",
      "translated_text": "Pound two *liang* of *xiang fu zi* (nutgrass) until finely chopped. Take one and a half *liang* of *ding xiang pi* (clove bark) and seven *liang* of *huang tan* (sandalwood), finely chopped. Add one *liang* of *jiang zhen xiang* (lignum dalbergiae odoriferae). Grind all ingredients evenly into small pieces, then blend with twenty-four *liang* of refined honey. Knead thoroughly, place in a ceramic vessel, and bury it in a shady spot two to three *chi* deep. After ten days, it may be retrieved for use. For each batch, after mixing with honey, add three *liang* of coarse *jian xiang* (agarwood) powder.\n\n**Qingyuan Incense Formula**\nTake ten *liang* of *gan song* (spikenard), thirty *liang* of *xiang bai zhi* (angelica), five *liang* of *xuan shen* (figwort root), six *liang* of *ling ling xiang* (lysimachia), seven *liang* of *mao xiang* (cogon grass), five *liang* of *ding xiang pi* (clove bark), three *liang* of *huo xiang* (patchouli), three *liang* of *xiang fu zi* (nutgrass), half a *jin* of *mu she* (musk), and five *liang* of *jiang zhen xiang* (lignum dalbergiae odoriferae). Clean and wash all ingredients, then chop and grind into coarse powder. Blend with refined honey, store in a sealed vessel, and allow to mature over time.\n\nHere ends the *Miscellaneous Sayings from the Pivotal Mechanisms of the Three Caverns*.",
      "overlap_context": "nse and lamps lies in using colored lantern covers to shield from insects and wind, thereby prolonging the light. Beyond the lamps and candles of the fasting altar, wax torches should be abundant and never lacking. Recorded in *The Rites of the Nine Heavens’ Life-Nourishing Fast*.\n\n**Incense Formula**\nTake twenty *liang* of fresh *mao xiang* (cogon grass), clean and remove the outer skin, retaining twelve *liang* of the pure material. Chop finely, stir-fry with two *liang* of honey until yellow.",
      "start_char": 4863,
      "end_char": 5064,
      "start_sentence": 244,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.830772161483765,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\三洞枢机杂说.txt",
        "category": "方法类"
      }
    }
  ]
}