{
  "source_id": "上清天关三图经",
  "source_file": "chunked_daozang\\上清天关三图经.json",
  "total_chunks": 6,
  "total_original_chars": 7108,
  "total_translated_chars": 45778,
  "total_translation_time": 232.3154637813568,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清天关三图经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Scripture of the Three Celestial Pass Charts**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Three Celestial Pass Charts*\n**Author:** Unknown, approximately dated to the Northern and Southern Dynasties period. Adapted from excerpts of *The Scripture of the Three Celestial Passes and the Seven Stars’ Shifting Degrees*. One scroll.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n### **The Hidden Secrets of the Grand Empyrean**\n\nFor those who cultivate the Dao of the Seven Stars’ Shifting Degrees, to summon the Nine Lords of the Jade Terrace, with the inner illumination of Mysterious Essence, severing the roots of death—one must still the heart within the secluded chamber, untouched by worldly dust. Stand alone before the altar, gazing upon the dawn of the empyrean, burning incense to left and right, dispersing mist and clouds across the courtyard. With focused intent and unyielding contemplation, visualize without wavering.\n\nAfter seven years of such practice, a jade chariot with a flying canopy and cinnabar carriage poles shall descend to welcome the adept’s body, ascending through the Celestial Pass. The path of death shall be sealed in the northeast, and the record of life inscribed among the Southern Immortals. This is the rarely attained Dao, the easily descended Perfected.\n\nThose whose names are inscribed in the Golden Register and Jade Roster, having received this Dao, shall choose the six auspicious conjunction days: *renyin*, *bingyin*, *jiazi*, *jiawu*, *xinwei*, and *xinchou*. These are the times when the Most High aligns with the celestial harmonies.\n\nOn these days, the Jade Emperor commands the Jade Lads of the Eastern Palace of Azure Radiance to verify the Golden Register and Jade Roster of those studying the Dao. For those who, with diligent resolve, ascend to move the Jade Emperor, he shall order the Six Palaces of Fengdu under the Northern Emperor to sever the roots of the death register, inscribing the life register at the Gate of Man. The Seven Stars shall be secretly arrayed over the Ghost Gate, traversing the Mysterious Pivot to part the Celestial Pass.\n\nAt each purificatory retreat, with focused intent and absorption in the Mysterious, close the eyes and inwardly visualize. Strike the teeth thirty-six times and contemplate the First Great Star, the Mysterious Pivot of Yang Brightness, the Celestial Pivot, the Hun-Spirit of the Supreme Nine Lords of the Upper Mystery. Clad in a flying cloud-brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Mysterious Pivot of Yang Brightness, Celestial Pivot, Hun-Spirit of the Supreme Perfected Nine Lords of the Upper Mystery, merging and transforming as one spirit, I beseech you: sever my path of death at the Ghost Gate, inscribe my life record at the Southern Pavilion, dispel the Seven Mysteries from the Three Paths, receive rebirth to become an immortal, return the Seven Essences to the Mysterious Shade, and convey my form through the Celestial Pass.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nWith unwavering cultivation, one shall summon the guests of the Jade Emperor, who descends upon clouds of purple radiance, attended by twelve Jade Maidens of Precious Blossoms and twelve Golden Lads of the Jade Dawn, guarding the adept’s body.\n\nNext, contemplate the Second Origin Star, the Northern Womb of Yin Essence, the Celestial Rotator, the Hun-Spirit of the Supreme Jade Nine Lords. Clad in a flying yellow brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, swallow the qi and recite the incantation:\n\n*\"O Northern Womb of Yin Essence, Celestial Rotator, Hun-Spirit of the Supreme Jade Nine Lords, merging and transforming as one spirit, I beseech you: excise my yang transgressions in the Great Yin, convey my yin qi to the Great Yang, shift the Seven Origins to sever death, part the Six Harmonies at the Celestial Pass, extricate my seven ancestors from the Three Paths, and receive the root of rebirth at the Southern Pavilion.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Third Perfected Star, the Nine Ultimates of the Supreme Perfected, the Lady of the Upper Origin, the Celestial Mechanism, the Po-Essence of the Supreme Plain Nine Lords. Clad in a flying azure brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Nine Ultimates of the Supreme Perfected, Lady of the Upper Origin, Celestial Mechanism, Po-Essence of the Supreme Plain Nine Lords, merging and transforming as one spirit, I beseech you: unbind the roots of karmic opposition, sever the source of the death path, grant me eyes that see clearly and penetrate the infinite. May the Mysterious Perfected gaze upward to infuse me, and may my essence irrigate my body. Ascend to grasp the August Keeper, tread the Seven Origins, ride the luminous void, and commune with Heaven.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Fourth Pivot Star, the Unfettered Mechanism of the Mysterious Dark, the Celestial Balance, the Hun-Essence of the Supreme Void Nine Lords. Clad in a flying purple brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Unfettered Mechanism of the Mysterious Dark, Celestial Balance, Hun-Essence of the Supreme Void Nine Lords, merging and transforming as one spirit, I beseech you: shift and convey the Seven Stars, seal the Ghost Gate, obstruct the qi of death, part the luminous Celestial Pass, return the Northern Dipper to the Mysterious Pivot, convey the qi of life to the Western Kun, depart from the Northern Emperor of Fengdu, and inscribe my name at the Southern Pavilion.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Fifth Rigid Star, the Celestial Balance of Cinnabar Origin, the Jade Balance, the Hun-Spirit of the Supreme Mystery Nine August Lords. Clad in a cinnabar brocade cloak and skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Celestial Balance of Cinnabar Origin, Jade Balance, Hun-Spirit of the Supreme Mystery Nine August Lords, merging and transforming as one spirit, descend the Seven Essences upon me, revolve the Four to return the Three, open the Seven Origins, seal the death gate in the northeast, receive the life palace of the Nine Mysteries, inscribe my name in the Eastern Radiance, and attend the Jade Dawn.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Sixth Chronicle Star, the Life Mechanism of the Northern Culmen, the Opening Yang, the Hun-Spirit of the Supreme Cinnabar August Void Nine Lords. Clad in a flying vermilion brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Life Mechanism of the Northern Culmen, Opening Yang, Hun-Spirit of the Supreme Cinnabar August Void Nine Lords, merging and transforming as one spirit, open for me the Three Charts of the Celestial One’s Mysterious Pass above, revolve the Six Palaces of Fengdu under the Northern Emperor below, govern the yin officials, eradicate the roots of the Nine Deaths, return the Three to the Four, convey my name through the Seven Origins, eternally preserve me, and share the Dipper’s longevity.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Seventh Pass Star, the Mysterious Yang of the Celestial Pass, the Shaking Radiance, the Great Brightness, the Supreme Jade Emperor Dao Lord. Clad in a flying cinnabar brocade gauze skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Mysterious Yang of the Celestial Pass, Shaking Radiance, Great Brightness, Supreme Jade Emperor Dao Lord...\"*\n\nThe Mysterious Yang of the Celestial Pass, Shaking Radiance, Great Brightness, Supreme Jade Emperor Dao Lord—merged with the myriad transformations as a single spirit—wish to summon for me the Nine Perfected Lords of the Imperial Dawn. The Nine Yin merge as one, revolving the Gate of Heaven, releasing my Seven Mysterious Ancestors, allowing them to roam the clouds of the Mysterious, severing my roots of death in the Northern Yin, and inscribing my name in the Jade Register of Eastern Florescence.\n\nUpon completion, swallow the qi fourteen times.\n\nOnce the contemplation of the Seven Origins is complete, knock the teeth twelve times. With eyes closed, visualize the Seven Stars of the Northern Dipper, their radiance blazing and illuminating the north. The essence of the stars shines inwardly, descending to cover my body. The Perfected Lords within the Dipper undergo primordial transformations, their forms ever-changing. Together, they ride clouds of verdant mist to welcome my body, ascending into the midst of the Seven Stars. I perceive myself within the Dipper’s central canopy, resplendent with luminous essence, a crown of light encircling my body. Following the Dipper’s revolution like a wheel’s turning, in but a moment, the Celestial Pass opens. The Seven Stars and Nine Lords each bestow upon me the talismans of the Seven Origins for Opening the Pass, to govern the Six Palaces of Fengdu under the Northern Emperor and sever the roots of deathly qi.\n\nHaving received the talismans, I revolve and return to my original essence, once more within the Dipper. The seven talismans blaze with illumination like the essence of fire, propelling me downward. Suddenly, I tread upon the void, and in an instant, I am peacefully settled upon my resting couch. Knock the teeth thirty-six times, then raise the head and recite the incantation:\n\n*\"Mysterious radiance shines with essence, flowing light startles form. Riding mist, I vanish and transform, ascending to the Seven Stars. The turning jade mechanism urges the reins, swift as lightning’s startled flight. The Celestial One opens the Pass, conveying me to life’s dwelling. In the Northern Emperor’s yin palaces, my name of death is erased. If not conveyed, if not erased, I turn to the Seven Essences. I bear the Seven Origins, flowing gold and fire bells. The mechanism of the Opening Pass scatters through the Eight Darknesses, dispatching the Six Jia, driving the Six Ding. Heaven sends down its Mysterious Cover, the Emperor grants divine soldiers. I beseech the Eastern Florescence to inscribe my jade name. Soaring through the void, I ascend to the Jade Purity.\"*\n\nUpon completion, swallow the qi thirty-six times in a single breath.\n\nThus concludes the Dao of opening the Celestial Pass, severing the roots of death, and merging the myriad transformations. Practicing this for seven years, bearing the talismans of the Seven Origins for Opening the Pass, one will possess a chariot of flying mist and verdant clouds to welcome the body. This must be cultivated in secrecy; do not transmit it lightly.\n\nThe talismans of the Supreme Lord for Opening the Pass of the Seven Origins are contained in the following scroll.\n\nOnce the practice of conveying and transforming through the Seven Stars is complete, and after seven years of cultivation, one bears the talismans of the Seven Origins for Opening the Pass.\n\nWithin the scroll, the images of the Perfected are depicted. Aside from those already annotated, they wear jade-green crowns and green sashes, crimson robes and vermilion shoes, riding upon clouds of five colors. When visualizing the Perfected, each wears a jade-green crown and yellow robes, green sashes and azure skirts. The palaces and halls are adorned with gold, arranged as befits their splendor.\n\n**The Method of the Northern Emperor’s Six Palaces of Fengdu for Conveying the Dead**\n\nMount Fengdu lies in the north, in the land of *gui*. Thus, the northeast is the gate of ghosts and the root of deathly qi. The mountain rises sixteen hundred *li* high, with a circumference of thirty thousand *li*. Its primordial cavern lies beneath the mountain, with a circumference of fifteen thousand *li*. Both above and below, there are palaces of ghosts and spirits. Atop the mountain are Six Palaces, and within the cavern are another Six Palaces—each palace spanning a thousand *li*—constituting the Six and Two Celestial Palaces of ghosts and spirits.\n\nThe first is named the Palace of Utter Yin, Cutting Off.\nThe second is named the Palace of Grand Execution, Faithful to Affairs, the Ancestral.\nThe third is named the Palace of Bright Dawn, Enduring Transgression, the Martial City.\nThe fourth is named the Palace of Tranquil Illumination, the Qi of Sin.\nThe fifth is named the Palace of the Ancestral Numen, the Seven Wrongs.\nThe sixth is named the Palace of Daring to Administer, the Winding and Repeated.\n\nThese Six Palaces are governed by the Northern Emperor and administered by the ghostly spirits of the Six Heavens. They oversee the names of the dead, and none who die do not pass through the Six Palaces of Fengdu. Therefore, the Supreme Lord constantly employs the Seven Stars to convey and transform the practitioner, passing through the Celestial Pass, opening the Southern Culmen’s palace to sever and block the northeastern gate of death.\n\nOnce the practice of conveying and transforming through the capital is complete, knock the left teeth nine times, call the names of the Six Palaces, and recite the incantation:\n\n*\"I am a servant of the Supreme Lord, my name inscribed in the Jade Purity. Below, I govern the Six Heavens and the ghostly palaces of the Northern Emperor, all within my command. Whatever is under my jurisdiction—what ghost dare arise? To my right, I bear the Opening Pass; to my left, I carry fire bells. Casting fire for ten thousand *li*, my might subdues the myriad spirits. Those who transgress are slain; those who offend are destroyed. By the Supreme Lord’s command, I capture without cease.\"*\n\nAfter reciting this once, the celestial light trembles and the myriad demons are bound in form. After three recitations, the ghostly *xie* are extinguished at their roots, the Six Palaces erase the names of the dead, the Celestial Pass conveys the living, and the Southern Culmen gives life to humanity. Those who do not know the names of the palaces of Fengdu or which spirits govern them, who do not learn to sever and block the roots of death, will never attain immortality.\n\nOnce the practice of conveying and transforming through the Seven Stars is complete, next visualize and contemplate the Two August Stars of the Imperial Honored Ones. Sit upright facing east, knock the teeth thirty-six times, and visualize the Two August Stars: the Highest Jade Emperor of the Eight Effulgences, the Nine Perfected Lords, and the Supreme Lord of the Grand Tenuity, the Primordial Lords of the Seven Stars of the Great Plain. Clad in skirts of purple brocade and flying clouds, crowned with the diadem of the Mysterious Dawn, they descend from the Mysterious Dipper into my body. Recite the incantation:\n\n*\"Highest Jade Emperor of the Eight Effulgences, Nine Perfected Lords, Supreme Lord of the Grand Tenuity, Primordial Lords of the Seven Stars of the Great Plain—merged with the Nine Transformations as the Two August Ones of the Supreme Emperor—open the Celestial Pass above for me, convey and transform my jade name, sever and block the ghostly gate, cutting off the roots of death in the Six Palaces of the Northern Emperor. Ascend to the Seven Origins, bestow upon me the Eight Effulgences, the Seven Essences, the Nine August Ones’ flying chariot of verdant clouds. Together, we ascend to the Imperial Dawn, collectively attend the August Consort, and command the myriad spirits.\"*\n\nUpon completion, swallow the qi twenty-one times.\n\nNext, visualize the two talismans of the Imperial Honored Ones ascending into the canopy of the Seven Stars. The governance of the Two August Stars lies beneath the canopy, constantly covering the two stars. Their luminous essence is unseen, and no one beholds them. Thus, the golden script and jade characters state: *\"One who beholds the Two Stars extends life by six hundred square years.\"*\n\nWithout the Two Emperors’ flying celestial talismans, you cannot ascend beneath the canopy of the Seven Stars, nor will the Two Stars reveal themselves to you. Only when you bear the two talismans will the Two Emperors bathe your body in their dark radiance. After nine years of cultivation, you shall ascend to the Imperial Dawn in broad daylight.\n\nThe supreme method of severing the Five Separations, absolving transgressions, cutting off death, and transcending into life—this is the Way of the Six Convergences and the One Initiation. You must cultivate the Five Dawns to depart from the Gate of Death and attain the method of transcending into the Palace of Life, where immortals take flight. On the days of the Five Separations—*ren-shen*, *bing-shen*, *wu-shen*, *jia-shen*, and *geng-shen*—the Imperial Lords hold grand feasts. Their jade-green chariots, adorned with emerald canopies, descend to the mortal realm accompanied by immortal officials and jade maidens, circling the Ten Heavens. They inspect those who study the Dao, while the Northern Emperor and the Five Lords of the Great Dark carry the Registers of Death to the Accounting Palace of Fengdu, where they examine and verify the Ledgers of Life.\n\nThe True August Lords of the Five Directions and Five Stars each govern one direction, collectively overseeing all immortals who are destined to attain the Dao, their names bound in the Scroll of Radiant Flowers. For those burdened with yin transgressions, yang sins, or offenses recorded in the Palace of the Great Yin under the Northern Emperor—where the separation of the good and evil, the living and the dead occurs—the days of the Five Separations are when sins are first confessed to the Great Yin, life is cultivated in the Great Yang, death’s records are stricken from the Northern Emperor’s ledgers, and transcendence is sought from the Five Stars.\n\nOn each of these days, don fresh robes, burn incense, and enter your chamber. Repent your transgressions, contemplate virtue, focus your spirit within, and concentrate your mind upon the Mysterious, free from all other thoughts. As the Imperial Lords traverse the Three Realms, the divine officials record your merits and present your name to the Jade Emperor. After five years of such practice, the True August Lords of the Five Stars will descend into your chamber.\n\nOn the days of the Five Separations, at dawn, noon, and midnight, enter your chamber, burn incense, face north, bow twice, and click your teeth three times. Recite the incantation:\n\n*\"Supreme Jade Emperor and August Lords, I beseech you to absolve the yin evils and unrighteous deeds committed by my seven ancestors and myself—killing, lust, arrogance, harm, and transgressions beyond count—both yang sins and yin offenses, all recorded by the Northern Emperor. I beg you to disperse and erase these names, sever the roots of death, and transcend the Celestial Pass, that I may be inscribed in the Jade Register of the Eastern Flower. May my seven ancestors and parents be reborn in the Southern Immortals’ realm.\"*\n\nConclude by visualizing the True August Lord of the Northern Star, the Dark Origin, clad in a purple brocade flying skirt, a tiger tally at his waist, and a floral crown upon his head. He rides a chariot of green mist and flying clouds, accompanied by twelve immortal officials, descending from the north to cover your body. His radiance is dense and luminous, his essence resplendent. Look up and recite the incantation:\n\n*\"True August Lord of the North, sovereign of all flying immortals, descending in clouds with your canopy, come and crown my body. I beseech you to seal the ghostly gate, sever the roots of death, inscribe my name in the Jade Purity, and unlock the Celestial Pass. May I depart from the Northern Emperor and ascend to the Southern Terrace, my lifespan bound to the True August Lord, together safeguarding the Northern Dawn.\"*\n\nThen swallow the *qi* twenty-five times and cease.\n\nFace east, bow twice, and click your teeth three times. Visualize and recite the incantation:\n\n*\"August Lord of the Jade Dawn and Lord of the Primordial Radiance of the Great Ultimate, I beseech you to absolve the yin sins and yang offenses I have committed since my first year, along with the heavy transgressions of my seven ancestors, all bound in the Three Yins. I beg you to release and dissolve these names, seal the roots of death, erase my past entanglements from the Northern Emperor, and inscribe my name in the Jade Register of the Eastern Flower. May my seven ancestors and parents ascend together to the Imperial Dawn.\"*\n\nNext, visualize the Central True August Lord of the Eastern Star, Azure Tooth, clad in a cloud-brocade skirt adorned with dragon patterns, a tiger tally at his waist, and a floral crown upon his head. He rides a jade chariot of azure mist and flying clouds, accompanied by twelve immortal officials, descending from the east to cover your body. His radiance is lush and resplendent. Face east and recite the incantation:\n\n*\"Central True Lord of the East, whose flowing radiance fills the Nine Gates, illuminating within and without, crowning my body, I beseech you to petition the Northern Emperor to sever my roots of death, transcend my jade name, and admit me among the inner immortals of the Eastern Flower. May I ascend and forever depart the path of death. May my seven ancestors and parents enjoy blessings, their lives bound to the moon’s waxing and the sun’s setting, riding the void to float upon the heavens, ascending in flight.\"*\n\nThen swallow the *qi* nine times and cease.\n\nFace south, bow twice, and click your teeth three times. Recite the incantation:\n\n*\"Three Primordial Lords of the Upper Clarity, Supreme Primordial Lord of the Southern Culmen, and Jade Worthy Lord of the Nine Qi of the Great Yang, I beseech you to absolve the primordial evils and unfilial deeds I have committed since gaining awareness—rebellion, unrighteousness, lewdness, theft, yin sins, and yang offenses—along with the entanglements of my seven ancestors, all recorded in the Great Yin and bound in the Northern Dawn. I beg you to release and dissolve the records of the Three Officials, sever the roots of death’s *qi*, transcend the northeastern gate, and ascend to unlock the southwestern pass. May my seven ancestors and parents all receive the Emperor’s grace.\"*\n\nConclude by visualizing the True August Lord of the Southern Star, Blazing Delight, clad in a cloud-frost skirt adorned with phoenix patterns and dragon bells, a tiger-script tally at his waist, and a crown of the Dark Dawn upon his head. He wears a flying azure brocade robe and rides a crimson chariot of vermilion mist, accompanied by twelve immortal officials, descending from the south to cover your body. His radiance blazes like the rising sun. Recite the incantation:\n\n*\"True August Lord of the South, whose dark radiance flows through the Three Gates, ascending in a vermilion chariot to the Seven Origins, your inner light shining brilliantly, crowning my body, sever the Northern Emperor’s recorded sins, dissolve entanglements, and disperse the Great Yin. May I depart the ghostly gate, cut off the roots of past entanglements, unlock the Celestial Pass, and ascend to the Southern Terrace. May my seven ancestors and parents together pay homage before the Emperor.\"*\n\nThen swallow the *qi* eight times and cease.\n\nFace west, bow twice, and click your teeth three times. Recite the incantation:\n\n*\"Three Primordial Lords of the Great Simplicity and Four Elders of the Dao’s Center, I beseech you to absolve the offenses I have committed since gaining awareness—envy of the worthy, careless disclosure of scriptures, treading in filth and defiling the pure, defiling the Three Luminaries, and swearing oaths that bring sorrow—all offending the August Lords, with entanglements recorded in the Great Yin and sins bound in the ghostly officials. I beg you to release and dissolve these roots of judgment, sever the path of death, and inscribe my name in the Gate of Life. May my seven ancestors and parents ascend to the Hall of Blessings.\"*\n\nThen conclude.\n\nNext, visualize the Perfected Sovereign of the Great White Star of the West, clad in a luminous brocade skirt adorned with flowing bells, a tiger-patterned sash at his waist, and the *Fuchen* crown upon his head. He rides a chariot of pale mist, accompanied by twelve immortal officials, descending from the West to overshadow your body. His radiance pierces through, illuminating the Western Quarter with resplendent brilliance. Then recite the incantation while looking upward:\n\n*\"Perfected Sovereign of the West,\nPale light illumines the mysterious standard,\nTriple-drawn jade chariot,\nWhite effulgence soars through the heavens.\nTurning the morning star, he descends,\nHis true form revealed in splendor.\nFor me, he revolves the Nine Portals,\nConveying my body to the imperial court.\nMy name departs the records of Great Yin,\nAscending to the Mysterious Palace in shared song.\nMy lifespan rivals heaven and earth,\nUnwithering for a hundred million years.\nMy seven ancestors and parents\nTogether ascend the dawn’s celestial heights.\"*\n\nConclude, then swallow the *qi* six times and cease.\n\nNext, face center, bow twice, and click your teeth three times. Recite the incantation:\n\n*\"Most High Supreme Thearch, Jade Sovereign,\nI beseech you to absolve the myriad transgressions and countless offenses I have committed from birth until this day—entanglements of my seven ancestors’ karmic bonds, unresolved and bound in Great Yin.\nI beg you to dissolve and release them,\nScatter and sever my name from the Dark Thearch’s records,\nCut the roots of death’s *qi* from the *Guihu* of *Gui* Earth.\nConvey my name through the Celestial Gate,\nPassing through the Five Mornings.\nMay my seven ancestors and parents\nAll attain rebirth as immortals.\"*\n\nConclude.\n\nNext, visualize the Perfected Sovereign of the Central Star, *Dancheng Yan*, clad in a yellow-cloud dragon-brocade tiger-skirt, a golden talisman at his waist, and a purple crown upon his head. He rides a flying chariot of yellow mist, accompanied by twelve immortal officials, descending from the center to crown and overshadow your body. His radiance pierces through, illuminating the Middle Primordial with dazzling brilliance. Then recite the incantation while looking upward:\n\n*\"Perfected Sovereign of the Central Star,\nWho governs the Five Thearchs and turns the Mysterious Net,\nTriple-drawn through yellow mist,\nCirculating through the Four Quarters.\nFor me, sever the roots of death,\nConvey my name to the Southern Yang Palace.\nDeparting the Five to return to the Six,\nSoaring with me in shared flight,\nTransforming through ten thousand streams,\nEternally enjoying boundless life.\nAscend to the Supreme Ultimate’s Golden Gates and Jade Hall,\nMy seven ancestors and parents\nTogether bearing blessed prosperity.\"*\n\nConclude, then swallow the *qi* twelve times and cease.\n\nThus, the five transgressions are severed before the Five Thearchs, and the Five Mornings are visualized to convey life. The ritual concludes here.\n\nIf performed unfailingly on its appointed days, after seven years the Five Mornings’ Perfected Sovereigns will be moved to manifest in your bedchamber. The Supreme Thearch will personally dispatch five Jade Maidens of the Five Directions to guard your body, and the Dark Thearch of Great Yin will come to pay homage at your gate, no longer daring to bind you with your sins.\n\nThose who seek immortality and pursue the true Dao should practice this diligently.\n\nThis method of repentance for transgressions to seek immortality was requested of the Golden Gate Sage by the High Minister Azure Lad, serving as a warning for later learners seeking life—it is not the repentance ritual of the Supreme Thearch himself. If you perform these rites, the Thearch will also witness your sincerity. Should past transgressions remain unresolved, the Six Heavens’ Palaces will not strike your name from the records of death, nor will the Gate-Opening Bureau convey your body. Thus, the Bureau of Union and Separation and the Gate-Opening Bureau—the latter being the Palace of Life-Conveyance, the former the source of death’s filling—depend entirely on your devoted pursuit to attain the true Dao.\n\n---\n\n**The Supreme Thearch’s Inner Illumination Method for Seeking Immortality**\n*Transmitted by the Upper Primordial Sovereign of the Southern Culmen*\n\nThe Thearch constantly dwells in the Bright Mystery Terrace, within the golden chambers and purple gates. He illumines himself with the Mysterious Lamp, radiating rosy light through the eight windows, contemplating the Great Perfected in the Five Forms, and unfolding the Three Vows in the Thearch’s chamber. The numinous descends upon the Purple Canopy, and the Primordial Sovereign bestows golden lads. Naturally, he is titled the Thearch’s rank, governing the Mysterious Palace. The Supreme Grade arises from the wondrous beginning; the Dao resides in the faintest glimmer. Now I impart this to you—practice it diligently.\n\nThe Upper Primordial Sovereign of the Southern Culmen declared: \"You who study the Way of divine perfection, dwelling in the numinous palace above, within the jade chambers—yet do not know how to illumine yourself with the Mysterious Lamp, radiating its light within the Five Viscera, thereby attaining clarity. The spirits of your form and body will thus return to their source.\n\nIf you can light the lamp at your *benming* in the evening, at your *xingnian* in the morning, and constantly at *taisui*, making vows in these three places, your body will become serene and your *qi* upright. The true light will inwardly illumine, and the myriad spirits will shine with clarity.\"\n\nThe Primordial Sovereign received and practiced this method for three years, whereupon twenty-four Night-Light Lads arrived, and the Mysterious Light naturally brightened—no longer requiring the lamp to radiate its glow.\n\nThis is the wondrous method of the Highest Perfected, not transmitted to the lower world. If one bears a golden name and jade script in the Mysterious Register, practicing this for nine years, their body will radiate light, seeing clearly for ten thousand *li*. The natural vision will be luminous, and the Night-Light Lads will descend to your chamber, bestowing upon you the true scriptures. You will ascend to the morning in broad daylight.\n\nConstantly light the lamp above your *benming* in the quiet room where you dwell. In the evening, enter the room, face the lamp, and kneel lengthwise. Click your teeth twelve times and recite the incantation:\n\n*\"Mysterious light illumines Great Yin,\nEight directions bright and clear.\nSerene spirit within the secluded chamber,\nGazing upward to the radiance of Highest Clarity.\nFive glories arise from the Luminous Terrace,\nJade mushrooms naturally grow.\nPiercing illumination connects to the Great Perfected,\nThe myriad spirits watch over my form.\nEradicating the *qi* of the Nine Yin,\nInscribing my name in the Eastern Florescence.\nPreserve me without end,\nEver parallel with the sun and moon.\nDeliver me from the seven ancestors’ calamities,\nReceive greater glory in the Southern Palace.\nMysterious light plays before the Jade Thearch,\nReceiving the Inner Illumination Scripture.\nHeaven descends the flying rosy chariot,\nSoaring through the void in a green carriage.\nAttaining audience in the Thearch’s hall,\nAdvancing to bow in the Jade Thearch’s court.\"*\n\nConclude, bow twice, face your *benming*, raise your head, and swallow saliva seven times.\n\nAlso, constantly light the lamp above your *xingnian*. In the morning, face the lamp, click your teeth twelve times, and recite the incantation:\n\n*\"Bright lamp illumines my *xingnian*,\nScattered light blazes in the eight directions.\nInfant-like hues, serene and clear,\nInner vision merges with empty brightness.\nReleasing and illuminating the spirit’s robe,\nI commune with the Jade Perfected.\nGazing upward to the lofty Highest Dao,\nVast and distant, without trace.\nYearning for the descent of mysterious clouds,\nReining the flying dragon’s bridle.\nReversing my hundred-year span,\nReturning to an infant’s countenance.\nBestow upon me the Maiden of Western Florescence,\nGrant me the Golden Morning Lad.\nAttending incense, treading the years of life,\nBowing my head in the Jade Thearch’s chamber.\nSpirit at peace, the Dao flows smoothly,\nFear dissolved in the incense smoke.\nComposing my heart, I focus on the Great Mystery,\nDevotion piercing the Void’s depths.\nThe chamber summons the Divine Empyrean’s descent,\nEyes closed, beholding the Immortal Lords.\nDelivering my seven ancestors from calamity,\nConveying my form to return to the Southern Palace.\"*\n\nConclude.\n\nUpon completion, bow twice more, face the lamp, and swallow qi thirty-four times.\n\nAlways light a lamp on the Tai Sui star to commune with the spirits, fulfill vows to seek the True, and after three years, the mysterious radiance will inwardly reflect—divine perfected ones will descend, bestowing upon you the method of deathlessness. At that time, responses will naturally arise.\n\nMorning and evening, burn incense, strike the teeth twelve times, and facing the lamp, recite the incantation:\n*\"The lamp’s flame illumines the Supreme Perfected,\nIts bright light piercing the Mysterious Void.\nUnveiling the peerless Dao,\nHeart fixed on the Jade Thearch’s chamber.\nPenetrating the hollow vastness within,\nThe spirit beholds, the form relaxes.\nCumulative devotion summons the numinous descent,\nHeart serene, principles subtly dwell.\nAt dawn, I worship in the Thearch’s hall,\nAt dusk, I chant the Golden Perfected’s scripture.\nRoaming freely within the Mysterious Capital,\nFor ten thousand years, I revert to an infant’s visage.\nA celestial crown of purple auroras,\nThe Thearch grants a jade-green chariot.\nFloating atop the Five Peaks’ summits,\nFollowing my will to attain all desires.\nSeven ancestors escape the Three Wretched Realms,\nBlessings and fortune overflow in abundance.\"*\n\nUpon completion, bow twice more and swallow saliva thirty-four times.\n\nIf you can perpetually keep lamps lit in three places without extinguishing them, the Seven Mysteries and Nine Ancestors will immediately depart the Ten Sufferings, ascending to the Southern Immortals. Your body’s spirits will become pure and upright, your eyes seeing ten thousand miles, your ears hearing distant sounds, your mind’s wisdom foreseeing the yet-unmanifest. Divine perfected ones will descend, and the Radiant Lad of the Night will teach you the Dao of immortality-seeking. After nine years of this practice, your numinous radiance will naturally brighten, penetrating both inner and outer.\n\nThe Five Separations will absolve transgressions before the Five Thearchs; store the Five Mornings to transcend life. The matter concludes here.\n\n**The Five Vows of the Thearch-Lord for Immortality-Seeking**\n\nThe Thearch-Lord regularly observes the following five days of vows and ten assemblies: the ninth day of the ninth month, the fifth day of the tenth month, the third day of the third month, the eighth day of the fourth month, and the seventh day of the seventh month. Ascend to the Jade Terrace of the Supreme Ultimate, within the golden chambers of the lofty Jade Palace. There, hold the Five Vows in the jade palace, yearning for the descent of the Mysterious Perfected. The Void initiates the Jade Thearch, golden tones resound through the Great Empyrean, summoning the Five Thearchs to guard the numinous. Myriad blessings converge in the cinnabar chamber—thus, devotion elicits the True, and the True, moved by devotion, descends.\n\nOn these days, always bathe in purity and fast, enter the chamber to burn incense, and with a sincere heart, bow to the four directions. Sit upright, facing east—the direction of the dawning radiance. Strike the teeth thirty-six times.\n\n**First Vow:** May I be born of the qi of spontaneity, my body formed within qi, my form equal to the Three Luminaries, eternally enjoying the root of the boundless.\n\n**Second Vow:** May my body always dwell above the Great Empyrean, within the jade palace’s chambers, feasting with the Jade Thearch at dawn, resting with the Mysterious Mother at dusk. When thirsty, may I sip from the Jade Mushroom’s wellspring and the Vast Spring’s jade nectar; when hungry, may I partake of the Dragon Embryo’s jade fat and the Scarlet Tree’s crimson fruit.\n\n**Third Vow:** May my body generate ten thousand auspices and seventy-two radiant lights, with extraordinary hair and bones, donning feathered robes. Riding clouds and driving through the void, I shall enter and exit the Thearch’s palace, with myriad blessings converging and boundless virtues.\n\n**Fourth Vow:** May I be unborn with the Unborn, undying with the Undying. Dying, yet living again, becoming a True Sovereign, governing the Ten Heavens and leading the host of immortals.\n\n**Fifth Vow:** May all sentient beings, born and unborn, together preserve the Three Luminaries. May those of the Dao and the Seven Mysteries’ ancestors ascend to the Southern Palace, and may the world’s blessings be universally attained.\n\nThe Four Directions’ Five Vows converge in the Jade Hall.\n\n**Next Vow:** May the Nine Mysteries nurture my body, my hun and po spirits and true gods eternally dwell within my palace, ascending to communicate with celestial immortals, descending to reach the abyssal depths.\n\n**Vow to Heaven, Vow to Earth, Vow to Wind, Vow to Spirits, Vow to Immortals:** When the Five Vows unite as one, the register of longevity is secured. Purple mists descend from heaven, the Five Numinous Ones guard the earth. Riding clouds and driving through the void, ascending in a green chariot, I reach the Golden Gate and ascend to the Jade Clarity. Blessings extend to the seven ancestors, who are reborn in the womb. The Five Vows’ fivefold union ensures eternal prosperity and integrity.\n\n**Middle Vows (also five):** Attain the root of the Dao.\n**Vow to Yin, Vow to Yang, Vow to the Great Empyrean, Vow to the Great Void, Vow to the Great Mystery:** Feast in the Jade Chamber, forming karmic bonds with the Thearch. Gazing upon the living palace, unveil the Nine Heavens. The Primordial Father inscribes the register, the Mysterious Mother records the years. Peaches and pomegranates congeal essence, securing the cinnabar field. The body ascends to the Golden Gate, the name is inscribed in the Jade Volume. Seven ancestors are liberated, blessings and fortune converge.\n\n**Lower Vows (also five):**\n**Vow to the Great Void, Vow to the Great Existence, Vow to the Supreme, Vow to the Supreme Perfected, Vow to Divine Immortals:** May I traverse the Five Peaks’ summits, drifting between the Nine Empyreans, entering and exiting the Passes’ chambers, transcending the Gates of Death. May Heaven and Earth be my parents, the Three Luminaries guard me for ten thousand years. May spirits guard the Nine Origins’ apertures, numinous qi descend spontaneously. The Eight Directions’ Five Vows converge with resonance.\n\nUpon completing the Five Vows, strike the teeth thirty-four times and recite the incantation:\n*\"Supreme Thearch of the Upper Origin,\nThearch-One’s Mysterious Scripture,\nFive clouds scatter radiance,\nLushly filling the Three Clarities.\nJade lads and jade maidens,\nBurning incense to serve the numinous.\nThe Upper Vows unfold,\nUniting with my form.\nGrant me immortality,\nAscending to the Thearch’s court.\nThe Northern Thearch severs death,\nThe Southern Pass inscribes life.\nThe Eastern Florescence’s golden register\nRecords my name above.\nBoundless vows\nAlign with me as one.\"*\n\nUpon concluding the prayer, strike the teeth twenty-one times and, looking upward, swallow qi five times.\n\nThis is the Thearch-Lord’s method of unfolding the Upper Vows to unite with the numinous. Those who regularly practice thus will have jade blossoms as attendants, jade lads scattering incense, their devotion ascending to the Nine Heavens, eliciting responses from the Thearch-Emperors. After five years of this, the Dao will naturally descend.\n\nFor all under heaven in the ten directions who hold the Dao’s vows, the Dao will invariably descend to you. At the moment of vowing, ensure your heart and mind are undivided, free from stray thoughts or external distractions. If the true spirits scatter, the True will not descend. If one treads through filth and defilement, the True will also remain distant.\n\nThe Thearch-Lord’s Five Assemblies of Upper Vows conclude here. On each of these days, if you can sincerely vow and contemplate according to the method, the Thearch will dispatch jade lads to guard your body, summoning the Five Directions’ vows. The Dao of immortals will descend upon your form.\n\nAfter five years of such practice, one may ascend to the Nine Heavens upon clouds, where one’s name is inscribed in the Register of Immortals. Even one’s seven generations of ancestors will receive blessings and joy, escaping the Three Wretched Paths to dwell in the Southern Palace of Immortals.\n\nThe Supreme Prime Lord of the Southern Culmen states: Those who study in the world know only to seek in the morning and expect results by evening, to utter a single vow and hope for the Dao’s descent, to recite spells and await response—yet they do not understand that ascending the heights of Mount Qi begins with the first step on the mountain’s base, that a thousand-foot tree grows from the tiniest sprout. The Dao is lofty and truly wondrous; how could one set foot and immediately climb the cloud ladder?\n\nEven the Thearch-Lord, who governs the true qi by mandate, must still kindle a bright lamp to commune with the Dao. How much more should the Five Vows be cherished as blessings, for they naturally encompass all things. The path of seeking immortality must begin with vows, followed by the pursuit of those vows, so that resonance may summon the numinous. The greatness of the Five Vows lies in their boundless inclusivity—no blessing is left unbestowed, no joy left unshared, no goodness left unpurified. If one can focus the heart sincerely upon the vows, there will be no lack of response. Those of later generations who hold such sentiments should take heed and reflect deeply.\n\nThe Most Exalted Azure Lad of the Upper Prime states: In my past studies, I traversed seven hundred years, scaling perilous peaks, crossing from east to west, journeying through south and north, wandering the Central Plains. I studied under thirty-two masters and received over three hundred teachings, yet I had not ascended to the Golden Gates to receive from the Sage Lord the sacred scriptures of purple texts, the Dao of ingesting the yellow essence of sun and moon to restrain the hun and po, of binding the radiant brilliance of the Nine Perfected and Eight Ways, of dissolving form and concealing transformation, of traversing the purple passage of flaming light, of wielding the flowing gold and fire bells, of exhaling and inhaling flying auroras, of soaring through the void and treading the clouds, of pacing the Seven Primordial Treasures. The Sage Lord, by the shifting of the Seven Stars—a treasure of the Supreme Thearch—swore an oath and transmitted these teachings, enabling me to sever the six palaces of death and seal the northeastern ghostly gate. Only then did my name ascend to the Celestial Pass, where my body was shifted, allowing me to ascend the Three Primes and serve in office. Thus, I attained the rank of Most Exalted Minister, overseeing the host of immortals. The Seven Stars blazed and fell from the heavens, revolving the essence of the Nine Origins. Above, I rode the qi of the Three Primes; below, I governed the names of the Six Heavens. Birth and death, separation and union—none occur apart from the Seven Stars. For when the Dipper’s influence falls upon a person, they die; when it shifts away, they live. Thus, the Seven Stars are the ministers of heaven, the Celestial Pass the treasury of life’s renewal.\n\nIf one studies without severing the gate of death beneath the Northern Dipper or shifting the eye of life at the Southern Pass, how can life be preserved? The Supreme Emperor entrusted this scripture to the chambers of the Six Directions, commanding the Jade Maiden of the Western Flower and the Golden Lad of the Golden Dawn—three hundred in all—to guard the sacred text. Later, it was transmitted to the assembled perfected and emerged from the famous mountains. The Lord of the Western City later discovered this text within the stone chamber of Wangwu Mountain. After retiring to purify himself for three months, he presented his pledge and journeyed to the mountain to receive and peruse it. Through the practice of the Seven Stars’ shifting, he attained the rank of Perfected. Since then, no one without a jade name or immortal destiny has been able to encounter this Dao. For those who possess this scripture, the Six Palaces of Fengdu will record their names and shift them to the Southern Pass—how much more so for those who cultivate its practice?\n\nThe Lord of the Western City states: This original text comprised three scrolls—*The Celestial Pass* and *The Celestial Charts*—which do not circulate in the world. The Southern Marchmount Lady received only one scroll, *The Seven Stars’ Shifting*. Here ends *The Upper Clarity Scripture of the Three Charts of the Celestial Pass*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清天关三图经 经名：上清天关三图经。 撰人不徉，约出於南北期。 系摘录《天关三图七星移度经》改编而成。 一卷。 底本出处：《正统道藏》正一部。 上清天关三图经 太霄隐诀 凡修七星移度之道，上招玉当九君，玄精内照，断塞死根，当寂心豳房，不关风尘，独立对境，盻观霄晨摊烧香左右，散烟霞庭，精中苦念，存想勿眠。 如此七年，则致琼舆飞盖丹辕，来迎兆身，上登天关，塞死路於东北，记生录於南仙，所谓难希之道，易降之真者也。 夫有金格玉名，得披此道，当以壬寅，丙寅、甲子、甲午、辛未、辛丑，此六会日，高上值合之时也。 玉帝常以其日，使侍仙玉郎校定青华东宫金格玉名，学仙之录。 是其日，有勤志上彻，感启玉皇者，即命北帝酆都六宫，断绝死录之根，证生录於人门，秘七星加於鬼门，度玄枢，披天关。 每当清斋，苦念注玄，冥目内存，叩齿三十六通，思第一太星玄枢阳明天枢魂神上玄九君，衣飞云锦裙，头戴玄晨之冠，从玄斗中下入我身中、因祝曰： 玄枢阳明天枢魂神上真真九君，混合变化，共为一神，愿为我断死路於鬼户，度生录於南轩，除七玄於三涂，受胎生而更仙，回七精以玄荫，度我形於天关。 毕，咽气二七过。 修行不懈，上招玉皇之宾，帝降紫霞之云，卫以宝华玉女、金晨玉童各十二人，卫子身。 次思第二元星北胎阴精天璇魂神上玉九君，同着黄锦飞裙，头建玄晨之冠，从玄斗中下降入我身，咽气咒曰： 北胎阴精天璇魂上玉九君，混合万变，共为一神，愿为我削阳罪於太阴，度阴气於太阳，移七元以断死，披六合於天关，拔七祖於三涂，受胎根於南轩。 毕，便咽气二七过。 次思第三真星九极上真上元夫人天玑魄精上素九君，同着青锦飞裙，头建玄晨之冠，从玄斗中下降入我身，气咒曰： 九极上真上元夫人天玑魄精上素九君，混合变化，共为一神，愿为我披解宿对之根，断绝死道之源，令我目明彻视，洞鉴无穷，玄真仰注，精灌我身，上攀皇魁，飞步七元，驾景乘空，与天相倾。 毕，便咽气二七过。 次思第四枢星纵玑玄冥天权魂精上虚九君，同着紫锦飞裙，头建玄晨之冠，从玄斗中下降入我身中，便咒曰： 纵玑玄冥天权魂精上虚九君，混合万变，共为一神，愿为我移度七星，填塞鬼门，断塞死气，披朗天关，回北斗於玄枢，度生气於西坤，离北帝於酆都，得记名於南轩。 毕，咽气二七过。 次思第五刚星天平丹元玉衡魂灵上玄九皇君，同着丹锦帔裙，头戴玄晨之冠，从玄斗中下降入我身中，便咒曰： 天平丹元玉衡魂灵上玄九皇君，混合万变，共为一神，为我上降七精，下注我身，回四转三，豁落七元，塞死户於束北，受生宫於九玄，记名东华，得侍玉晨。 毕，咽气二七过。 次思第六纪星命机北极闿阳魂灵上丹皇虚九君，同衣朱锦飞裙，头建玄晨之冠，从玄斗中下降入我身中，咒曰： 命机北极闿阳魂灵上丹皇虚九君，混合万变，共为一神，为我上开天一三图玄关，下转北帝酆都六宫，制御阴官，落除九死之根，回三还四，度名七元，长保无穷，与斗同年。 毕，咽气二七过。 次思第七关星玄阳天关摇光太明太上玉皇道君，同着丹锦飞罗裙，头建玄晨之冠，从玄斗中下降入我身中，便咒曰：",
      "translated_text": "**The Supreme Clarity Scripture of the Three Celestial Pass Charts**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Three Celestial Pass Charts*\n**Author:** Unknown, approximately dated to the Northern and Southern Dynasties period. Adapted from excerpts of *The Scripture of the Three Celestial Passes and the Seven Stars’ Shifting Degrees*. One scroll.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n### **The Hidden Secrets of the Grand Empyrean**\n\nFor those who cultivate the Dao of the Seven Stars’ Shifting Degrees, to summon the Nine Lords of the Jade Terrace, with the inner illumination of Mysterious Essence, severing the roots of death—one must still the heart within the secluded chamber, untouched by worldly dust. Stand alone before the altar, gazing upon the dawn of the empyrean, burning incense to left and right, dispersing mist and clouds across the courtyard. With focused intent and unyielding contemplation, visualize without wavering.\n\nAfter seven years of such practice, a jade chariot with a flying canopy and cinnabar carriage poles shall descend to welcome the adept’s body, ascending through the Celestial Pass. The path of death shall be sealed in the northeast, and the record of life inscribed among the Southern Immortals. This is the rarely attained Dao, the easily descended Perfected.\n\nThose whose names are inscribed in the Golden Register and Jade Roster, having received this Dao, shall choose the six auspicious conjunction days: *renyin*, *bingyin*, *jiazi*, *jiawu*, *xinwei*, and *xinchou*. These are the times when the Most High aligns with the celestial harmonies.\n\nOn these days, the Jade Emperor commands the Jade Lads of the Eastern Palace of Azure Radiance to verify the Golden Register and Jade Roster of those studying the Dao. For those who, with diligent resolve, ascend to move the Jade Emperor, he shall order the Six Palaces of Fengdu under the Northern Emperor to sever the roots of the death register, inscribing the life register at the Gate of Man. The Seven Stars shall be secretly arrayed over the Ghost Gate, traversing the Mysterious Pivot to part the Celestial Pass.\n\nAt each purificatory retreat, with focused intent and absorption in the Mysterious, close the eyes and inwardly visualize. Strike the teeth thirty-six times and contemplate the First Great Star, the Mysterious Pivot of Yang Brightness, the Celestial Pivot, the Hun-Spirit of the Supreme Nine Lords of the Upper Mystery. Clad in a flying cloud-brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Mysterious Pivot of Yang Brightness, Celestial Pivot, Hun-Spirit of the Supreme Perfected Nine Lords of the Upper Mystery, merging and transforming as one spirit, I beseech you: sever my path of death at the Ghost Gate, inscribe my life record at the Southern Pavilion, dispel the Seven Mysteries from the Three Paths, receive rebirth to become an immortal, return the Seven Essences to the Mysterious Shade, and convey my form through the Celestial Pass.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nWith unwavering cultivation, one shall summon the guests of the Jade Emperor, who descends upon clouds of purple radiance, attended by twelve Jade Maidens of Precious Blossoms and twelve Golden Lads of the Jade Dawn, guarding the adept’s body.\n\nNext, contemplate the Second Origin Star, the Northern Womb of Yin Essence, the Celestial Rotator, the Hun-Spirit of the Supreme Jade Nine Lords. Clad in a flying yellow brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, swallow the qi and recite the incantation:\n\n*\"O Northern Womb of Yin Essence, Celestial Rotator, Hun-Spirit of the Supreme Jade Nine Lords, merging and transforming as one spirit, I beseech you: excise my yang transgressions in the Great Yin, convey my yin qi to the Great Yang, shift the Seven Origins to sever death, part the Six Harmonies at the Celestial Pass, extricate my seven ancestors from the Three Paths, and receive the root of rebirth at the Southern Pavilion.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Third Perfected Star, the Nine Ultimates of the Supreme Perfected, the Lady of the Upper Origin, the Celestial Mechanism, the Po-Essence of the Supreme Plain Nine Lords. Clad in a flying azure brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Nine Ultimates of the Supreme Perfected, Lady of the Upper Origin, Celestial Mechanism, Po-Essence of the Supreme Plain Nine Lords, merging and transforming as one spirit, I beseech you: unbind the roots of karmic opposition, sever the source of the death path, grant me eyes that see clearly and penetrate the infinite. May the Mysterious Perfected gaze upward to infuse me, and may my essence irrigate my body. Ascend to grasp the August Keeper, tread the Seven Origins, ride the luminous void, and commune with Heaven.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Fourth Pivot Star, the Unfettered Mechanism of the Mysterious Dark, the Celestial Balance, the Hun-Essence of the Supreme Void Nine Lords. Clad in a flying purple brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Unfettered Mechanism of the Mysterious Dark, Celestial Balance, Hun-Essence of the Supreme Void Nine Lords, merging and transforming as one spirit, I beseech you: shift and convey the Seven Stars, seal the Ghost Gate, obstruct the qi of death, part the luminous Celestial Pass, return the Northern Dipper to the Mysterious Pivot, convey the qi of life to the Western Kun, depart from the Northern Emperor of Fengdu, and inscribe my name at the Southern Pavilion.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Fifth Rigid Star, the Celestial Balance of Cinnabar Origin, the Jade Balance, the Hun-Spirit of the Supreme Mystery Nine August Lords. Clad in a cinnabar brocade cloak and skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Celestial Balance of Cinnabar Origin, Jade Balance, Hun-Spirit of the Supreme Mystery Nine August Lords, merging and transforming as one spirit, descend the Seven Essences upon me, revolve the Four to return the Three, open the Seven Origins, seal the death gate in the northeast, receive the life palace of the Nine Mysteries, inscribe my name in the Eastern Radiance, and attend the Jade Dawn.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Sixth Chronicle Star, the Life Mechanism of the Northern Culmen, the Opening Yang, the Hun-Spirit of the Supreme Cinnabar August Void Nine Lords. Clad in a flying vermilion brocade skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Life Mechanism of the Northern Culmen, Opening Yang, Hun-Spirit of the Supreme Cinnabar August Void Nine Lords, merging and transforming as one spirit, open for me the Three Charts of the Celestial One’s Mysterious Pass above, revolve the Six Palaces of Fengdu under the Northern Emperor below, govern the yin officials, eradicate the roots of the Nine Deaths, return the Three to the Four, convey my name through the Seven Origins, eternally preserve me, and share the Dipper’s longevity.\"*\n\nUpon completion, swallow the qi fourteen times.\n\nNext, contemplate the Seventh Pass Star, the Mysterious Yang of the Celestial Pass, the Shaking Radiance, the Great Brightness, the Supreme Jade Emperor Dao Lord. Clad in a flying cinnabar brocade gauze skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Mysterious Yang of the Celestial Pass, Shaking Radiance, Great Brightness, Supreme Jade Emperor Dao Lord...\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1272,
      "start_sentence": 0,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.93208599090576,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清天关三图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "玄阳天关摇光太明太上玉皇道君，混合万变，共为一神，愿为我上招帝晨九真帝君，九阴混合，回转天门，解我七玄之祖，令得遨游玄云，削我北阴死根，记我东华玉篇。 毕，便咽气二七过。 存七元毕，叩齿十二通，瞑目思北方七星，光明焕照北方，星精内映，来覆我身，斗中真君混沌变化，无有常形，共乘绿霞之云，来迎我身，同升七星之中。 自觉我身在斗中央华盖之下，精光焕赫，冠匝一身，随斗运转，如车之轮。 须臾之顷，已开天关，七星九君，各授我豁落七元开关之符，以制北帝六宫，断塞死气之根。 受符而旋，以复本元，还在斗中，七符焕照，如火之精，运我来下，豁然蹈空，倏忽之间，安住寝床。 叩齿三十六通，仰头咒曰： 玄光耀精，流景震形，乘霞遁变，上升七星，璇玑促辔，如电奔惊，天一开关，度我着生，北帝阴宫，落我死名，不度不落，上向七精、我佩七元，流金火铃，豁落天机，流漫八冥，运使六甲，策御六丁，天降玄覆，帝给神兵，乞丐东华，记我玉名，飞空乘虚，上诣玉清。 毕，便三十六一咽气止。 以开天关，断死根，混合万变之道，毕於此。 行之七年，佩豁落七元符，财有飞霞绿軿，来迎兆身，唯在秘修，慎勿轻传。 帝君豁落七元符 开天关符，在下卷内。 行移度七星事毕，行之七年，佩豁落七元。 卷内画相真人，除已注说外，并碧冠绿帔，绛服朱履，乘五色彩云。 存思真人，各碧冠黄服，绿帔青裙，余宫殿间金，取宜装饰。 北帝酆都六宫度死法 酆都山在北方癸地，故东北为鬼户死气之根。 山高上千六百里，周回三万里，其山洞元在山之下，周回一万五千里，其上下并有鬼神宫室，山上有六宫，洞中又有六宫，一宫周回千里，是为六二天鬼神之宫。 第一名纣绝阴天宫。 第二名泰杀谅事宗天宫。 第三名明晨耐犯武城天宫。 第四名恬照罪气天宫。 第五名宗灵七非天宫。 第六名敢司连宛屡天宫。 右六宫，是北帝所主，六天鬼神所治，领人之死名，死者莫不由酆都六宫也。 是故帝君常以七星移度学生之人，过天关，开南极之宫断塞东北之死户也。 子行移度都毕，当叩左齿九通，呼六宫之名，而咒曰： 吾是帝君之臣，名书玉清，下统六天，北帝鬼宫，悉是我营，我之所部，何鬼敢生，右佩豁落，左带火铃，掷火万里，威制万灵，有犯者戮，有干者形，帝君有命，收捕无停。 如此者毕，一咒则天光骇动，万魔束形，三咒则鬼祆灭种，六宫绝人死名，天关度人，南极生人。 学不知酆都宫名分鸟神所治，不学断塞死根，万无成仙也。 行移度七星事毕，次思存一帝尊二星。 当平坐东向，叩齿三十六通，存帝尊二星，高上玉皇八景元君九尊、太微玉帝君太素七星元君，同着飞云紫锦裙，建玄晨之冠，从玄斗中下降入我身，咒曰： 高上玉皇八景元君九尊、太微帝君太素七星元君，九变混合上帝二尊，为我上开天关，移度玉名，断塞鬼户北帝六宫死根断绝，上升七元，赐我八景七精九皇飞舆绿軿，同登帝晨，总朝皇妃，摄御万灵。 毕，咽气三七过。 次存帝尊二符，上登七星华盖之中，二尊星治在华盖之下，常覆二星，精光不见，人无见者，故金书玉字云：得见二星，延寿六百方年。",
      "translated_text": "The Mysterious Yang of the Celestial Pass, Shaking Radiance, Great Brightness, Supreme Jade Emperor Dao Lord—merged with the myriad transformations as a single spirit—wish to summon for me the Nine Perfected Lords of the Imperial Dawn. The Nine Yin merge as one, revolving the Gate of Heaven, releasing my Seven Mysterious Ancestors, allowing them to roam the clouds of the Mysterious, severing my roots of death in the Northern Yin, and inscribing my name in the Jade Register of Eastern Florescence.\n\nUpon completion, swallow the qi fourteen times.\n\nOnce the contemplation of the Seven Origins is complete, knock the teeth twelve times. With eyes closed, visualize the Seven Stars of the Northern Dipper, their radiance blazing and illuminating the north. The essence of the stars shines inwardly, descending to cover my body. The Perfected Lords within the Dipper undergo primordial transformations, their forms ever-changing. Together, they ride clouds of verdant mist to welcome my body, ascending into the midst of the Seven Stars. I perceive myself within the Dipper’s central canopy, resplendent with luminous essence, a crown of light encircling my body. Following the Dipper’s revolution like a wheel’s turning, in but a moment, the Celestial Pass opens. The Seven Stars and Nine Lords each bestow upon me the talismans of the Seven Origins for Opening the Pass, to govern the Six Palaces of Fengdu under the Northern Emperor and sever the roots of deathly qi.\n\nHaving received the talismans, I revolve and return to my original essence, once more within the Dipper. The seven talismans blaze with illumination like the essence of fire, propelling me downward. Suddenly, I tread upon the void, and in an instant, I am peacefully settled upon my resting couch. Knock the teeth thirty-six times, then raise the head and recite the incantation:\n\n*\"Mysterious radiance shines with essence, flowing light startles form. Riding mist, I vanish and transform, ascending to the Seven Stars. The turning jade mechanism urges the reins, swift as lightning’s startled flight. The Celestial One opens the Pass, conveying me to life’s dwelling. In the Northern Emperor’s yin palaces, my name of death is erased. If not conveyed, if not erased, I turn to the Seven Essences. I bear the Seven Origins, flowing gold and fire bells. The mechanism of the Opening Pass scatters through the Eight Darknesses, dispatching the Six Jia, driving the Six Ding. Heaven sends down its Mysterious Cover, the Emperor grants divine soldiers. I beseech the Eastern Florescence to inscribe my jade name. Soaring through the void, I ascend to the Jade Purity.\"*\n\nUpon completion, swallow the qi thirty-six times in a single breath.\n\nThus concludes the Dao of opening the Celestial Pass, severing the roots of death, and merging the myriad transformations. Practicing this for seven years, bearing the talismans of the Seven Origins for Opening the Pass, one will possess a chariot of flying mist and verdant clouds to welcome the body. This must be cultivated in secrecy; do not transmit it lightly.\n\nThe talismans of the Supreme Lord for Opening the Pass of the Seven Origins are contained in the following scroll.\n\nOnce the practice of conveying and transforming through the Seven Stars is complete, and after seven years of cultivation, one bears the talismans of the Seven Origins for Opening the Pass.\n\nWithin the scroll, the images of the Perfected are depicted. Aside from those already annotated, they wear jade-green crowns and green sashes, crimson robes and vermilion shoes, riding upon clouds of five colors. When visualizing the Perfected, each wears a jade-green crown and yellow robes, green sashes and azure skirts. The palaces and halls are adorned with gold, arranged as befits their splendor.\n\n**The Method of the Northern Emperor’s Six Palaces of Fengdu for Conveying the Dead**\n\nMount Fengdu lies in the north, in the land of *gui*. Thus, the northeast is the gate of ghosts and the root of deathly qi. The mountain rises sixteen hundred *li* high, with a circumference of thirty thousand *li*. Its primordial cavern lies beneath the mountain, with a circumference of fifteen thousand *li*. Both above and below, there are palaces of ghosts and spirits. Atop the mountain are Six Palaces, and within the cavern are another Six Palaces—each palace spanning a thousand *li*—constituting the Six and Two Celestial Palaces of ghosts and spirits.\n\nThe first is named the Palace of Utter Yin, Cutting Off.\nThe second is named the Palace of Grand Execution, Faithful to Affairs, the Ancestral.\nThe third is named the Palace of Bright Dawn, Enduring Transgression, the Martial City.\nThe fourth is named the Palace of Tranquil Illumination, the Qi of Sin.\nThe fifth is named the Palace of the Ancestral Numen, the Seven Wrongs.\nThe sixth is named the Palace of Daring to Administer, the Winding and Repeated.\n\nThese Six Palaces are governed by the Northern Emperor and administered by the ghostly spirits of the Six Heavens. They oversee the names of the dead, and none who die do not pass through the Six Palaces of Fengdu. Therefore, the Supreme Lord constantly employs the Seven Stars to convey and transform the practitioner, passing through the Celestial Pass, opening the Southern Culmen’s palace to sever and block the northeastern gate of death.\n\nOnce the practice of conveying and transforming through the capital is complete, knock the left teeth nine times, call the names of the Six Palaces, and recite the incantation:\n\n*\"I am a servant of the Supreme Lord, my name inscribed in the Jade Purity. Below, I govern the Six Heavens and the ghostly palaces of the Northern Emperor, all within my command. Whatever is under my jurisdiction—what ghost dare arise? To my right, I bear the Opening Pass; to my left, I carry fire bells. Casting fire for ten thousand *li*, my might subdues the myriad spirits. Those who transgress are slain; those who offend are destroyed. By the Supreme Lord’s command, I capture without cease.\"*\n\nAfter reciting this once, the celestial light trembles and the myriad demons are bound in form. After three recitations, the ghostly *xie* are extinguished at their roots, the Six Palaces erase the names of the dead, the Celestial Pass conveys the living, and the Southern Culmen gives life to humanity. Those who do not know the names of the palaces of Fengdu or which spirits govern them, who do not learn to sever and block the roots of death, will never attain immortality.\n\nOnce the practice of conveying and transforming through the Seven Stars is complete, next visualize and contemplate the Two August Stars of the Imperial Honored Ones. Sit upright facing east, knock the teeth thirty-six times, and visualize the Two August Stars: the Highest Jade Emperor of the Eight Effulgences, the Nine Perfected Lords, and the Supreme Lord of the Grand Tenuity, the Primordial Lords of the Seven Stars of the Great Plain. Clad in skirts of purple brocade and flying clouds, crowned with the diadem of the Mysterious Dawn, they descend from the Mysterious Dipper into my body. Recite the incantation:\n\n*\"Highest Jade Emperor of the Eight Effulgences, Nine Perfected Lords, Supreme Lord of the Grand Tenuity, Primordial Lords of the Seven Stars of the Great Plain—merged with the Nine Transformations as the Two August Ones of the Supreme Emperor—open the Celestial Pass above for me, convey and transform my jade name, sever and block the ghostly gate, cutting off the roots of death in the Six Palaces of the Northern Emperor. Ascend to the Seven Origins, bestow upon me the Eight Effulgences, the Seven Essences, the Nine August Ones’ flying chariot of verdant clouds. Together, we ascend to the Imperial Dawn, collectively attend the August Consort, and command the myriad spirits.\"*\n\nUpon completion, swallow the qi twenty-one times.\n\nNext, visualize the two talismans of the Imperial Honored Ones ascending into the canopy of the Seven Stars. The governance of the Two August Stars lies beneath the canopy, constantly covering the two stars. Their luminous essence is unseen, and no one beholds them. Thus, the golden script and jade characters state: *\"One who beholds the Two Stars extends life by six hundred square years.\"*",
      "overlap_context": "Upon completion, swallow the qi fourteen times.\n\nNext, contemplate the Seventh Pass Star, the Mysterious Yang of the Celestial Pass, the Shaking Radiance, the Great Brightness, the Supreme Jade Emperor Dao Lord. Clad in a flying cinnabar brocade gauze skirt, crowned with the diadem of the Mysterious Dawn, descending from the Mysterious Dipper into one’s body, recite the incantation:\n\n*\"O Mysterious Yang of the Celestial Pass, Shaking Radiance, Great Brightness, Supreme Jade Emperor Dao Lord...\"*",
      "start_char": 1272,
      "end_char": 2536,
      "start_sentence": 33,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.056862592697144,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清天关三图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "子无二帝飞空上符，则不得上登华盖之下，二星亦不见於子。 得佩二符，二帝自以玄光映子之身，修行九年，白日升晨。 五离解过绝死度生上法 行六会一启度之道，当修五晨离於死户，度於生官工飞仙之法。 当以壬申、丙申、戊申、甲申、庚申，五离之日，是时帝君高宴，景龙之舆，绿厦飞軿，从仙官玉女，凋旋十天，下降人间，看察学仙之人一命北帝太沧五君，赍死录上诣平都主算宫，推校究生簿录。 五方五星真皇道君，各统一方，总领诸仙应得道者，言名束华。 有阴罪阴过, 阳罪阳过，结在北帝太阴君，言名酆都之宫，离别善恶生死之人。 是故五离之日，首罪於太阴，修生於太阳，落死籍於北帝，求仙於五星。 每至其日，斋盛衣服，烧香入室，悔过念善，存神内思，一心注玄，无有他念。 帝君周行三界，神官自记子之功，言名於玉皇也。 如此五年，克得五星真皇，来降子室也。 每至五离日，平旦、日中、夜半三时，入室烧香，北向再拜，叩齿三通，咒曰： 高上玉皇帝君，乞丐原除我七祖以来，下及某身所行阴恶无道，杀生淫慢，害出法，千条万犯，阳罪阴过，名奏北帝者，并乞除散，削灭罪名，断落死根，度入天关，得在东华书字玉篇，七祖父母，反胎南仙。 毕，思北方辰星真皇道君精原，着紫锦飞裙，腰带虎符，首建华冠，乘绿霞飞云，从十二仙官，从北方来下降覆我身，光色郁蔼，焕赫精芒，仰咒曰： 北上真皇，总统飞仙，乘云回軿，来冠我身，乞为我填塞鬼户，离绝死根，言名玉清，披释天关，我得去离北帝，上升南轩，寿与真皇，同保北晨。 便咽气二十五过止。 东向再拜，叩齿三通，存咒曰： 玉晨太上君、太极元景君，乞丐原某年一以来所行阴罪阳过，上及七祖宿对重愆，结在三阴者，并乞披释，离灭罪名，填塞死根，北帝除我宿结，东华记我玉篇，七玄父母，同升帝晨。 次思东方岁星中真皇君青牙，着云锦龙纹之裙，腰带虎符，首建华冠，乘碧霞飞云玉舆，从十二仙官，从东方来下降覆我身，光色郁郁焕烂，向东方仰咒曰： 东方中真，流霞九门，光映内外，覆冠兆身，乞丐赐我，告下北帝，离我死根，度我玉名，东华内真，我得升度，永离死路，七玄父母，成享福祚，与月俱生，与日同暮，乘虚浮空，上登飞步。 便咽气九过止。 南向再拜，叩齿三通，存咒曰： 上清三元君、南极上元君、太阳九气玉贤元君，乞丐原某有知以来，所行元恶不孝，违逆无道，奸淫偷窃，阴罪阳过，上及七祖宿结流逮，简目在於太阴，罪名系於北晨，乞丐披释，离灭三官宿对之目，填绝死气之根，过度东北之户，上升西南开关，七玄父母，咸蒙帝恩。 毕，次思南方荧惑星真皇君淮停，着云霜凤华龙铃裙，腰带虎书，首建玄晨之冠，飞青锦衣，乘丹霞绛舆，从十二仙官，从南方来下降覆我身，光色焕赫，如日之升，仰咒曰： 南方真皇，玄象流光，徘徊三门，参驾丹舆，上升七元，光明内映，洞冠我身，为我降绝北帝罪名，解结散滞，消灭太阴，身离鬼户之中，断绝宿对之根，上披天关，升入南轩，七祖父母，同谒帝前。 便咽气八过止。 西向再拜，叩齿三通，存咒曰： 太素三元君、四老道中君，乞丐原赦某有识以来，所行所犯妬贤能，轻泄经文，履秽染尘，洿慢三光，咒誓悲泪，上触帝君，宿对结在太阴，罪名系於鬼官者，乞句披释，离灭考根，断塞死路，度名生门，七祖父母，上升福堂。",
      "translated_text": "Without the Two Emperors’ flying celestial talismans, you cannot ascend beneath the canopy of the Seven Stars, nor will the Two Stars reveal themselves to you. Only when you bear the two talismans will the Two Emperors bathe your body in their dark radiance. After nine years of cultivation, you shall ascend to the Imperial Dawn in broad daylight.\n\nThe supreme method of severing the Five Separations, absolving transgressions, cutting off death, and transcending into life—this is the Way of the Six Convergences and the One Initiation. You must cultivate the Five Dawns to depart from the Gate of Death and attain the method of transcending into the Palace of Life, where immortals take flight. On the days of the Five Separations—*ren-shen*, *bing-shen*, *wu-shen*, *jia-shen*, and *geng-shen*—the Imperial Lords hold grand feasts. Their jade-green chariots, adorned with emerald canopies, descend to the mortal realm accompanied by immortal officials and jade maidens, circling the Ten Heavens. They inspect those who study the Dao, while the Northern Emperor and the Five Lords of the Great Dark carry the Registers of Death to the Accounting Palace of Fengdu, where they examine and verify the Ledgers of Life.\n\nThe True August Lords of the Five Directions and Five Stars each govern one direction, collectively overseeing all immortals who are destined to attain the Dao, their names bound in the Scroll of Radiant Flowers. For those burdened with yin transgressions, yang sins, or offenses recorded in the Palace of the Great Yin under the Northern Emperor—where the separation of the good and evil, the living and the dead occurs—the days of the Five Separations are when sins are first confessed to the Great Yin, life is cultivated in the Great Yang, death’s records are stricken from the Northern Emperor’s ledgers, and transcendence is sought from the Five Stars.\n\nOn each of these days, don fresh robes, burn incense, and enter your chamber. Repent your transgressions, contemplate virtue, focus your spirit within, and concentrate your mind upon the Mysterious, free from all other thoughts. As the Imperial Lords traverse the Three Realms, the divine officials record your merits and present your name to the Jade Emperor. After five years of such practice, the True August Lords of the Five Stars will descend into your chamber.\n\nOn the days of the Five Separations, at dawn, noon, and midnight, enter your chamber, burn incense, face north, bow twice, and click your teeth three times. Recite the incantation:\n\n*\"Supreme Jade Emperor and August Lords, I beseech you to absolve the yin evils and unrighteous deeds committed by my seven ancestors and myself—killing, lust, arrogance, harm, and transgressions beyond count—both yang sins and yin offenses, all recorded by the Northern Emperor. I beg you to disperse and erase these names, sever the roots of death, and transcend the Celestial Pass, that I may be inscribed in the Jade Register of the Eastern Flower. May my seven ancestors and parents be reborn in the Southern Immortals’ realm.\"*\n\nConclude by visualizing the True August Lord of the Northern Star, the Dark Origin, clad in a purple brocade flying skirt, a tiger tally at his waist, and a floral crown upon his head. He rides a chariot of green mist and flying clouds, accompanied by twelve immortal officials, descending from the north to cover your body. His radiance is dense and luminous, his essence resplendent. Look up and recite the incantation:\n\n*\"True August Lord of the North, sovereign of all flying immortals, descending in clouds with your canopy, come and crown my body. I beseech you to seal the ghostly gate, sever the roots of death, inscribe my name in the Jade Purity, and unlock the Celestial Pass. May I depart from the Northern Emperor and ascend to the Southern Terrace, my lifespan bound to the True August Lord, together safeguarding the Northern Dawn.\"*\n\nThen swallow the *qi* twenty-five times and cease.\n\nFace east, bow twice, and click your teeth three times. Visualize and recite the incantation:\n\n*\"August Lord of the Jade Dawn and Lord of the Primordial Radiance of the Great Ultimate, I beseech you to absolve the yin sins and yang offenses I have committed since my first year, along with the heavy transgressions of my seven ancestors, all bound in the Three Yins. I beg you to release and dissolve these names, seal the roots of death, erase my past entanglements from the Northern Emperor, and inscribe my name in the Jade Register of the Eastern Flower. May my seven ancestors and parents ascend together to the Imperial Dawn.\"*\n\nNext, visualize the Central True August Lord of the Eastern Star, Azure Tooth, clad in a cloud-brocade skirt adorned with dragon patterns, a tiger tally at his waist, and a floral crown upon his head. He rides a jade chariot of azure mist and flying clouds, accompanied by twelve immortal officials, descending from the east to cover your body. His radiance is lush and resplendent. Face east and recite the incantation:\n\n*\"Central True Lord of the East, whose flowing radiance fills the Nine Gates, illuminating within and without, crowning my body, I beseech you to petition the Northern Emperor to sever my roots of death, transcend my jade name, and admit me among the inner immortals of the Eastern Flower. May I ascend and forever depart the path of death. May my seven ancestors and parents enjoy blessings, their lives bound to the moon’s waxing and the sun’s setting, riding the void to float upon the heavens, ascending in flight.\"*\n\nThen swallow the *qi* nine times and cease.\n\nFace south, bow twice, and click your teeth three times. Recite the incantation:\n\n*\"Three Primordial Lords of the Upper Clarity, Supreme Primordial Lord of the Southern Culmen, and Jade Worthy Lord of the Nine Qi of the Great Yang, I beseech you to absolve the primordial evils and unfilial deeds I have committed since gaining awareness—rebellion, unrighteousness, lewdness, theft, yin sins, and yang offenses—along with the entanglements of my seven ancestors, all recorded in the Great Yin and bound in the Northern Dawn. I beg you to release and dissolve the records of the Three Officials, sever the roots of death’s *qi*, transcend the northeastern gate, and ascend to unlock the southwestern pass. May my seven ancestors and parents all receive the Emperor’s grace.\"*\n\nConclude by visualizing the True August Lord of the Southern Star, Blazing Delight, clad in a cloud-frost skirt adorned with phoenix patterns and dragon bells, a tiger-script tally at his waist, and a crown of the Dark Dawn upon his head. He wears a flying azure brocade robe and rides a crimson chariot of vermilion mist, accompanied by twelve immortal officials, descending from the south to cover your body. His radiance blazes like the rising sun. Recite the incantation:\n\n*\"True August Lord of the South, whose dark radiance flows through the Three Gates, ascending in a vermilion chariot to the Seven Origins, your inner light shining brilliantly, crowning my body, sever the Northern Emperor’s recorded sins, dissolve entanglements, and disperse the Great Yin. May I depart the ghostly gate, cut off the roots of past entanglements, unlock the Celestial Pass, and ascend to the Southern Terrace. May my seven ancestors and parents together pay homage before the Emperor.\"*\n\nThen swallow the *qi* eight times and cease.\n\nFace west, bow twice, and click your teeth three times. Recite the incantation:\n\n*\"Three Primordial Lords of the Great Simplicity and Four Elders of the Dao’s Center, I beseech you to absolve the offenses I have committed since gaining awareness—envy of the worthy, careless disclosure of scriptures, treading in filth and defiling the pure, defiling the Three Luminaries, and swearing oaths that bring sorrow—all offending the August Lords, with entanglements recorded in the Great Yin and sins bound in the ghostly officials. I beg you to release and dissolve these roots of judgment, sever the path of death, and inscribe my name in the Gate of Life. May my seven ancestors and parents ascend to the Hall of Blessings.\"*",
      "overlap_context": " the August Consort, and command the myriad spirits.\"*\n\nUpon completion, swallow the qi twenty-one times.\n\nNext, visualize the two talismans of the Imperial Honored Ones ascending into the canopy of the Seven Stars. The governance of the Two August Stars lies beneath the canopy, constantly covering the two stars. Their luminous essence is unseen, and no one beholds them. Thus, the golden script and jade characters state: *\"One who beholds the Two Stars extends life by six hundred square years.\"*",
      "start_char": 2536,
      "end_char": 3879,
      "start_sentence": 69,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.87903952598572,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清天关三图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "毕。 次思西方太白星真皇君，着皓锦流铃裙，腰带虎章，首建扶晨之冠，乘素霞飞軿，从十二仙官，从西方来下降覆我身，光明洞彻，焕赫西方，便仰咒曰： 西方真皇，素映玄标，参驾玉舆，素华郁霄，回晨来降，真形披交，为我回转九户，度身皇朝，身离太阴之录，上升玄宫同谣，寿倾天地，亿年不雕，七玄父母，咸登晨霄。 毕，便咽气六过止。 次中央再拜，叩齿三通，存咒曰： 高上太帝君玉皇君，乞丐原赦某受 生以来，迄于今日所行所犯亿愆兆过，七祖宿对连染不解，事结太阴者，并乞解除披释，散绝北帝玄名，断绝癸地鬼户死气之根，度名天关，历过五晨，七玄父母，咸蒙更仙。 毕。 次思中央镇星真皇君耽骋延，着黄云龙锦虎裙，腰佩金符，首建紫冠，驾黄霞飞舆，从十二仙官，从中央来下，冠覆我身，光明洞彻，焕落中元，便仰咒曰： 中央镇星真皇君，总摄五帝，运转玄纲，参驾黄霞，周行四方，为我落绝死根，度名南阳之宫，离五还六，与我同翔，变化万津，永享无量，上登太极金阙玉堂，七祖父母，同荷利昌。 毕，便咽气十二过止。 五离首过於五帝，存五晨以度生，事毕於此也。 若常至其日，行之不废，七年感彻五晨真皇，见形於子寝房也。 太帝自遣五方玉女五人，卫子之身，北帝太阴亦来朝子之门，不敢拘子之罪也。 学仙求真，宜勤行焉。 悔过求仙之道，是上相青童君请金阙圣君之法，为后学求生之者作戒尔，非太帝君之悔过也。 行其事，帝君亦鉴子之心，自宿过不尽，六天之宫亦不落子死名，开关之府亦不度子之身，是故离合之府，开关之门，开关之门为度生之宫，离合之府为填死之源也。 惟在精求，便得其真也。 帝君明灯内观求仙上法 南极上元君受 帝君常居朗玄之台，金房紫户之内，明玄灯以自映，通霞光於八窗，念太真於五形，披三愿於帝房，灵上降於紫盖，元皇给以金童，自然号我帝位，总掌於玄宫，太品生乎始妙，道在微芒，今以相告，子勤奉焉。 告南极上元君曰：子学神真之道，处灵宫之上，琼房之内，而不知明灯以自映，通玄光於五藏之内，因得明矣，形体之神，因得归也。 子能暮明灯於本命，朝明灯於行年，常明灯於太岁，三处愿念，即体澄气正，真光内照，万神朗清。 元君奉受法度，施行三年，即致夜光童子二十四人，玄光自然而明，不须明灯而通光也。 然此上真之妙法，亦不传於下世，若有金名玉字玄格者，得吾此道，行之九年，身体光明，彻视万里，朗观自然，夜光童子降子之房，授子真书，白日登晨。 常明灯於所住静室本命之上，暮入室，向灯长跪，叩齿十二通，咒曰： 玄光映太阴，八达朗且明，澄神曲室裹，仰彻耀上清，五辉发朗台，玉芝自然生，洞照通太真，万神监我形，削灭九阴气，记上东华名，保我无终休，长与日月并，拔度七玄难，南宫更受荣，明光戏玉皇，上受内观经，天降飞霄辇，腾空御绿軿，得谒太帝馆，进拜玉皇庭。 毕，再拜，向本命仰头，咽液七过止。 又常明灯於行年之上，朝而向灯，叩齿十二通，咒曰： 明灯照行年，散光焕八方，婴婴色象澄，内观朗空同，披释朗神衿，子与玉真通，仰宗高上道，眇邈无行踪，思得玄云降，控辔御飞龙，却我百年期，还反婴儿容，赐我西华女，给我金晨童，侍香履年命，稽首玉帝房，神泰道亦畅，惧适香烟中，整心注太玄，精感洞虚无，室招神霄降，瞑目瞩仙公，拔过七祖难，度形还南宫。",
      "translated_text": "Then conclude.\n\nNext, visualize the Perfected Sovereign of the Great White Star of the West, clad in a luminous brocade skirt adorned with flowing bells, a tiger-patterned sash at his waist, and the *Fuchen* crown upon his head. He rides a chariot of pale mist, accompanied by twelve immortal officials, descending from the West to overshadow your body. His radiance pierces through, illuminating the Western Quarter with resplendent brilliance. Then recite the incantation while looking upward:\n\n*\"Perfected Sovereign of the West,\nPale light illumines the mysterious standard,\nTriple-drawn jade chariot,\nWhite effulgence soars through the heavens.\nTurning the morning star, he descends,\nHis true form revealed in splendor.\nFor me, he revolves the Nine Portals,\nConveying my body to the imperial court.\nMy name departs the records of Great Yin,\nAscending to the Mysterious Palace in shared song.\nMy lifespan rivals heaven and earth,\nUnwithering for a hundred million years.\nMy seven ancestors and parents\nTogether ascend the dawn’s celestial heights.\"*\n\nConclude, then swallow the *qi* six times and cease.\n\nNext, face center, bow twice, and click your teeth three times. Recite the incantation:\n\n*\"Most High Supreme Thearch, Jade Sovereign,\nI beseech you to absolve the myriad transgressions and countless offenses I have committed from birth until this day—entanglements of my seven ancestors’ karmic bonds, unresolved and bound in Great Yin.\nI beg you to dissolve and release them,\nScatter and sever my name from the Dark Thearch’s records,\nCut the roots of death’s *qi* from the *Guihu* of *Gui* Earth.\nConvey my name through the Celestial Gate,\nPassing through the Five Mornings.\nMay my seven ancestors and parents\nAll attain rebirth as immortals.\"*\n\nConclude.\n\nNext, visualize the Perfected Sovereign of the Central Star, *Dancheng Yan*, clad in a yellow-cloud dragon-brocade tiger-skirt, a golden talisman at his waist, and a purple crown upon his head. He rides a flying chariot of yellow mist, accompanied by twelve immortal officials, descending from the center to crown and overshadow your body. His radiance pierces through, illuminating the Middle Primordial with dazzling brilliance. Then recite the incantation while looking upward:\n\n*\"Perfected Sovereign of the Central Star,\nWho governs the Five Thearchs and turns the Mysterious Net,\nTriple-drawn through yellow mist,\nCirculating through the Four Quarters.\nFor me, sever the roots of death,\nConvey my name to the Southern Yang Palace.\nDeparting the Five to return to the Six,\nSoaring with me in shared flight,\nTransforming through ten thousand streams,\nEternally enjoying boundless life.\nAscend to the Supreme Ultimate’s Golden Gates and Jade Hall,\nMy seven ancestors and parents\nTogether bearing blessed prosperity.\"*\n\nConclude, then swallow the *qi* twelve times and cease.\n\nThus, the five transgressions are severed before the Five Thearchs, and the Five Mornings are visualized to convey life. The ritual concludes here.\n\nIf performed unfailingly on its appointed days, after seven years the Five Mornings’ Perfected Sovereigns will be moved to manifest in your bedchamber. The Supreme Thearch will personally dispatch five Jade Maidens of the Five Directions to guard your body, and the Dark Thearch of Great Yin will come to pay homage at your gate, no longer daring to bind you with your sins.\n\nThose who seek immortality and pursue the true Dao should practice this diligently.\n\nThis method of repentance for transgressions to seek immortality was requested of the Golden Gate Sage by the High Minister Azure Lad, serving as a warning for later learners seeking life—it is not the repentance ritual of the Supreme Thearch himself. If you perform these rites, the Thearch will also witness your sincerity. Should past transgressions remain unresolved, the Six Heavens’ Palaces will not strike your name from the records of death, nor will the Gate-Opening Bureau convey your body. Thus, the Bureau of Union and Separation and the Gate-Opening Bureau—the latter being the Palace of Life-Conveyance, the former the source of death’s filling—depend entirely on your devoted pursuit to attain the true Dao.\n\n---\n\n**The Supreme Thearch’s Inner Illumination Method for Seeking Immortality**\n*Transmitted by the Upper Primordial Sovereign of the Southern Culmen*\n\nThe Thearch constantly dwells in the Bright Mystery Terrace, within the golden chambers and purple gates. He illumines himself with the Mysterious Lamp, radiating rosy light through the eight windows, contemplating the Great Perfected in the Five Forms, and unfolding the Three Vows in the Thearch’s chamber. The numinous descends upon the Purple Canopy, and the Primordial Sovereign bestows golden lads. Naturally, he is titled the Thearch’s rank, governing the Mysterious Palace. The Supreme Grade arises from the wondrous beginning; the Dao resides in the faintest glimmer. Now I impart this to you—practice it diligently.\n\nThe Upper Primordial Sovereign of the Southern Culmen declared: \"You who study the Way of divine perfection, dwelling in the numinous palace above, within the jade chambers—yet do not know how to illumine yourself with the Mysterious Lamp, radiating its light within the Five Viscera, thereby attaining clarity. The spirits of your form and body will thus return to their source.\n\nIf you can light the lamp at your *benming* in the evening, at your *xingnian* in the morning, and constantly at *taisui*, making vows in these three places, your body will become serene and your *qi* upright. The true light will inwardly illumine, and the myriad spirits will shine with clarity.\"\n\nThe Primordial Sovereign received and practiced this method for three years, whereupon twenty-four Night-Light Lads arrived, and the Mysterious Light naturally brightened—no longer requiring the lamp to radiate its glow.\n\nThis is the wondrous method of the Highest Perfected, not transmitted to the lower world. If one bears a golden name and jade script in the Mysterious Register, practicing this for nine years, their body will radiate light, seeing clearly for ten thousand *li*. The natural vision will be luminous, and the Night-Light Lads will descend to your chamber, bestowing upon you the true scriptures. You will ascend to the morning in broad daylight.\n\nConstantly light the lamp above your *benming* in the quiet room where you dwell. In the evening, enter the room, face the lamp, and kneel lengthwise. Click your teeth twelve times and recite the incantation:\n\n*\"Mysterious light illumines Great Yin,\nEight directions bright and clear.\nSerene spirit within the secluded chamber,\nGazing upward to the radiance of Highest Clarity.\nFive glories arise from the Luminous Terrace,\nJade mushrooms naturally grow.\nPiercing illumination connects to the Great Perfected,\nThe myriad spirits watch over my form.\nEradicating the *qi* of the Nine Yin,\nInscribing my name in the Eastern Florescence.\nPreserve me without end,\nEver parallel with the sun and moon.\nDeliver me from the seven ancestors’ calamities,\nReceive greater glory in the Southern Palace.\nMysterious light plays before the Jade Thearch,\nReceiving the Inner Illumination Scripture.\nHeaven descends the flying rosy chariot,\nSoaring through the void in a green carriage.\nAttaining audience in the Thearch’s hall,\nAdvancing to bow in the Jade Thearch’s court.\"*\n\nConclude, bow twice, face your *benming*, raise your head, and swallow saliva seven times.\n\nAlso, constantly light the lamp above your *xingnian*. In the morning, face the lamp, click your teeth twelve times, and recite the incantation:\n\n*\"Bright lamp illumines my *xingnian*,\nScattered light blazes in the eight directions.\nInfant-like hues, serene and clear,\nInner vision merges with empty brightness.\nReleasing and illuminating the spirit’s robe,\nI commune with the Jade Perfected.\nGazing upward to the lofty Highest Dao,\nVast and distant, without trace.\nYearning for the descent of mysterious clouds,\nReining the flying dragon’s bridle.\nReversing my hundred-year span,\nReturning to an infant’s countenance.\nBestow upon me the Maiden of Western Florescence,\nGrant me the Golden Morning Lad.\nAttending incense, treading the years of life,\nBowing my head in the Jade Thearch’s chamber.\nSpirit at peace, the Dao flows smoothly,\nFear dissolved in the incense smoke.\nComposing my heart, I focus on the Great Mystery,\nDevotion piercing the Void’s depths.\nThe chamber summons the Divine Empyrean’s descent,\nEyes closed, beholding the Immortal Lords.\nDelivering my seven ancestors from calamity,\nConveying my form to return to the Southern Palace.\"*\n\nConclude.",
      "overlap_context": "ince gaining awareness—envy of the worthy, careless disclosure of scriptures, treading in filth and defiling the pure, defiling the Three Luminaries, and swearing oaths that bring sorrow—all offending the August Lords, with entanglements recorded in the Great Yin and sins bound in the ghostly officials. I beg you to release and dissolve these roots of judgment, sever the path of death, and inscribe my name in the Gate of Life. May my seven ancestors and parents ascend to the Hall of Blessings.\"*",
      "start_char": 3879,
      "end_char": 5225,
      "start_sentence": 97,
      "end_sentence": 126,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.21029233932495,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清天关三图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "毕，再拜，向灯咽气二七过止。 常太岁上明灯以通神，理愿以求真，三年玄光内映，神真下降，授子不死之方，当时自有感应也。 当朝夕烧香，叩齿十二过，向灯咒曰： 灯火映太真，明光彻玄虚，披朗无上道，心注玉帝庐，洞达空洞内，神睹形自舒，积感致灵降，心恬理潜居，朝礼太帝堂，夕诵金真书，逍遥玄都裹，万岁反婴孩，天冠紫霄霞，帝给绿琼舆，浮游五岳巅，适意得所如，七祖免三涂，福庆有盈余。 毕，再拜，咽液二七过止。 若能恒於三处明灯不灭，七玄九祖即得去离十苦，上升南仙，一身神明澄正，目视万里，耳聪远听，心智逆知未然，神真来降，夜光童子当教子求仙之道。 九年如此，灵光自明，通於表裹也。 五离首过於五帝，存五晨以度生，事毕於此也。 帝君五愿求仙上法 帝君常以九月九日、十月五日、三月三日、四月八日、七月七日，此五愿十会之时也，上登太极琼台，高上玉殿金室之内，存五愿於琼宫，希玄真以自降，虚无启以玉帝，金音畅於太空，召五帝以卫灵，万庆会於丹房，故有感而致真，真亦感发而降焉。 是其日，常沐浴清斋，入室烧香，心拜四方，正束向平坐，东向者，是当阳始晖之方也。 叩齿三十六通。 第一上愿我生自然之气，气中结成我身，身与三光齐伦，长享无极之根。 二愿我身常处太空之上，琼宫玉房之裹，朝与玉帝同宴，夕与玄母同止，渴嗡浪井洪泉玉芝，饥纳龙胎琼腴绛树赤子。 三愿我身生万瑞七十二光，奇毛异骨，飞羽衣裳，乘云驾空，出入帝宫，众庆来臻，万善无量。 四愿与无俱生，与无俱死，死而又生，生为真皇，封掌十天，总领群仙。 五愿一切众生，已生未生，同保日月三光，有道之人，七玄之祖，上升南宫，天下之福，靡有不当。 四方五愿，并会玉堂。 次上愿九玄扶养我身，魂魄真神恒居我宫，上通天仙，下逮洞渊。 愿天、愿地、愿风、愿神、愿仙，五愿一合，定籍长生，天降紫烟，地卫五灵，乘云驾虚，飞辇绿軿，上造金阙，进登玉清，庆及七祖，更受胎生，五愿五合，长享利贞。 中愿亦五，得道本根，愿阴、愿阳、愿太空、愿太无、愿太玄，上宴玉房，与帝因缘，游盼生阙，披朗九天，元父定籍，玄母记年，桃康结精，保固丹田，身腾金阙，名书玉篇，七祖解脱，福庆来臻。 下愿亦五，愿太虚、愿太有、愿太上、愿太真、愿神仙，运身於五岳之巅，飘飖九霄之际，出入开关之裹，移脱死户之外。 愿天地为我父母，三光卫我万年，神守九原之孔，灵降自然之气，八方五愿，与响而会。 五愿毕，叩齿二七通，咒曰： 大帝上元，帝一玄经，五云散景，郁郁三清，玉童玉女，烧香侍灵，上愿开陈，与我合形，使我神仙，上升帝庭，北帝落死，南关注生，东华金格，得上我名，无穷之愿，与我齐并。 祝毕，又叩齿三七遍，仰咽气五过止。 此帝君开陈上愿，与灵合形之道也。 常能尔者，则玉华侍卫，玉童散香，上彻九天，感应帝皇，五年如此，道自降矣。 天下十方有道之愿，道无不降子之情。 口愿之际，当令心意在一，不得他念外想，真神散越，则真不降也。 履淹冒秽，真亦远也。 帝君上愿五会之道，毕於此也。 每至其日，若能精心愿念如法，帝遣玉童卫子之身，招致五方之愿，神仙之道来降尔形。",
      "translated_text": "Upon completion, bow twice more, face the lamp, and swallow qi thirty-four times.\n\nAlways light a lamp on the Tai Sui star to commune with the spirits, fulfill vows to seek the True, and after three years, the mysterious radiance will inwardly reflect—divine perfected ones will descend, bestowing upon you the method of deathlessness. At that time, responses will naturally arise.\n\nMorning and evening, burn incense, strike the teeth twelve times, and facing the lamp, recite the incantation:\n*\"The lamp’s flame illumines the Supreme Perfected,\nIts bright light piercing the Mysterious Void.\nUnveiling the peerless Dao,\nHeart fixed on the Jade Thearch’s chamber.\nPenetrating the hollow vastness within,\nThe spirit beholds, the form relaxes.\nCumulative devotion summons the numinous descent,\nHeart serene, principles subtly dwell.\nAt dawn, I worship in the Thearch’s hall,\nAt dusk, I chant the Golden Perfected’s scripture.\nRoaming freely within the Mysterious Capital,\nFor ten thousand years, I revert to an infant’s visage.\nA celestial crown of purple auroras,\nThe Thearch grants a jade-green chariot.\nFloating atop the Five Peaks’ summits,\nFollowing my will to attain all desires.\nSeven ancestors escape the Three Wretched Realms,\nBlessings and fortune overflow in abundance.\"*\n\nUpon completion, bow twice more and swallow saliva thirty-four times.\n\nIf you can perpetually keep lamps lit in three places without extinguishing them, the Seven Mysteries and Nine Ancestors will immediately depart the Ten Sufferings, ascending to the Southern Immortals. Your body’s spirits will become pure and upright, your eyes seeing ten thousand miles, your ears hearing distant sounds, your mind’s wisdom foreseeing the yet-unmanifest. Divine perfected ones will descend, and the Radiant Lad of the Night will teach you the Dao of immortality-seeking. After nine years of this practice, your numinous radiance will naturally brighten, penetrating both inner and outer.\n\nThe Five Separations will absolve transgressions before the Five Thearchs; store the Five Mornings to transcend life. The matter concludes here.\n\n**The Five Vows of the Thearch-Lord for Immortality-Seeking**\n\nThe Thearch-Lord regularly observes the following five days of vows and ten assemblies: the ninth day of the ninth month, the fifth day of the tenth month, the third day of the third month, the eighth day of the fourth month, and the seventh day of the seventh month. Ascend to the Jade Terrace of the Supreme Ultimate, within the golden chambers of the lofty Jade Palace. There, hold the Five Vows in the jade palace, yearning for the descent of the Mysterious Perfected. The Void initiates the Jade Thearch, golden tones resound through the Great Empyrean, summoning the Five Thearchs to guard the numinous. Myriad blessings converge in the cinnabar chamber—thus, devotion elicits the True, and the True, moved by devotion, descends.\n\nOn these days, always bathe in purity and fast, enter the chamber to burn incense, and with a sincere heart, bow to the four directions. Sit upright, facing east—the direction of the dawning radiance. Strike the teeth thirty-six times.\n\n**First Vow:** May I be born of the qi of spontaneity, my body formed within qi, my form equal to the Three Luminaries, eternally enjoying the root of the boundless.\n\n**Second Vow:** May my body always dwell above the Great Empyrean, within the jade palace’s chambers, feasting with the Jade Thearch at dawn, resting with the Mysterious Mother at dusk. When thirsty, may I sip from the Jade Mushroom’s wellspring and the Vast Spring’s jade nectar; when hungry, may I partake of the Dragon Embryo’s jade fat and the Scarlet Tree’s crimson fruit.\n\n**Third Vow:** May my body generate ten thousand auspices and seventy-two radiant lights, with extraordinary hair and bones, donning feathered robes. Riding clouds and driving through the void, I shall enter and exit the Thearch’s palace, with myriad blessings converging and boundless virtues.\n\n**Fourth Vow:** May I be unborn with the Unborn, undying with the Undying. Dying, yet living again, becoming a True Sovereign, governing the Ten Heavens and leading the host of immortals.\n\n**Fifth Vow:** May all sentient beings, born and unborn, together preserve the Three Luminaries. May those of the Dao and the Seven Mysteries’ ancestors ascend to the Southern Palace, and may the world’s blessings be universally attained.\n\nThe Four Directions’ Five Vows converge in the Jade Hall.\n\n**Next Vow:** May the Nine Mysteries nurture my body, my hun and po spirits and true gods eternally dwell within my palace, ascending to communicate with celestial immortals, descending to reach the abyssal depths.\n\n**Vow to Heaven, Vow to Earth, Vow to Wind, Vow to Spirits, Vow to Immortals:** When the Five Vows unite as one, the register of longevity is secured. Purple mists descend from heaven, the Five Numinous Ones guard the earth. Riding clouds and driving through the void, ascending in a green chariot, I reach the Golden Gate and ascend to the Jade Clarity. Blessings extend to the seven ancestors, who are reborn in the womb. The Five Vows’ fivefold union ensures eternal prosperity and integrity.\n\n**Middle Vows (also five):** Attain the root of the Dao.\n**Vow to Yin, Vow to Yang, Vow to the Great Empyrean, Vow to the Great Void, Vow to the Great Mystery:** Feast in the Jade Chamber, forming karmic bonds with the Thearch. Gazing upon the living palace, unveil the Nine Heavens. The Primordial Father inscribes the register, the Mysterious Mother records the years. Peaches and pomegranates congeal essence, securing the cinnabar field. The body ascends to the Golden Gate, the name is inscribed in the Jade Volume. Seven ancestors are liberated, blessings and fortune converge.\n\n**Lower Vows (also five):**\n**Vow to the Great Void, Vow to the Great Existence, Vow to the Supreme, Vow to the Supreme Perfected, Vow to Divine Immortals:** May I traverse the Five Peaks’ summits, drifting between the Nine Empyreans, entering and exiting the Passes’ chambers, transcending the Gates of Death. May Heaven and Earth be my parents, the Three Luminaries guard me for ten thousand years. May spirits guard the Nine Origins’ apertures, numinous qi descend spontaneously. The Eight Directions’ Five Vows converge with resonance.\n\nUpon completing the Five Vows, strike the teeth thirty-four times and recite the incantation:\n*\"Supreme Thearch of the Upper Origin,\nThearch-One’s Mysterious Scripture,\nFive clouds scatter radiance,\nLushly filling the Three Clarities.\nJade lads and jade maidens,\nBurning incense to serve the numinous.\nThe Upper Vows unfold,\nUniting with my form.\nGrant me immortality,\nAscending to the Thearch’s court.\nThe Northern Thearch severs death,\nThe Southern Pass inscribes life.\nThe Eastern Florescence’s golden register\nRecords my name above.\nBoundless vows\nAlign with me as one.\"*\n\nUpon concluding the prayer, strike the teeth twenty-one times and, looking upward, swallow qi five times.\n\nThis is the Thearch-Lord’s method of unfolding the Upper Vows to unite with the numinous. Those who regularly practice thus will have jade blossoms as attendants, jade lads scattering incense, their devotion ascending to the Nine Heavens, eliciting responses from the Thearch-Emperors. After five years of this, the Dao will naturally descend.\n\nFor all under heaven in the ten directions who hold the Dao’s vows, the Dao will invariably descend to you. At the moment of vowing, ensure your heart and mind are undivided, free from stray thoughts or external distractions. If the true spirits scatter, the True will not descend. If one treads through filth and defilement, the True will also remain distant.\n\nThe Thearch-Lord’s Five Assemblies of Upper Vows conclude here. On each of these days, if you can sincerely vow and contemplate according to the method, the Thearch will dispatch jade lads to guard your body, summoning the Five Directions’ vows. The Dao of immortals will descend upon your form.",
      "overlap_context": "ence,\nGrant me the Golden Morning Lad.\nAttending incense, treading the years of life,\nBowing my head in the Jade Thearch’s chamber.\nSpirit at peace, the Dao flows smoothly,\nFear dissolved in the incense smoke.\nComposing my heart, I focus on the Great Mystery,\nDevotion piercing the Void’s depths.\nThe chamber summons the Divine Empyrean’s descent,\nEyes closed, beholding the Immortal Lords.\nDelivering my seven ancestors from calamity,\nConveying my form to return to the Southern Palace.\"*\n\nConclude.",
      "start_char": 5225,
      "end_char": 6494,
      "start_sentence": 127,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.683462619781494,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清天关三图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "如此五年，克乘云上升九天，列名来华，七祖父母，亦荷福庆，得去三涂，受仙南宫也。 南极上元君曰：世人之学，唯知朝求而暮获，一念而希降，吐咒而望应，而不知登栖岐之巅，起於山迹，千丈之木，出於毫末，道高而真妙，岂可发足而登於云梯耶。 帝君受气而掌真，犹尚明灯以自通，五愿以希庆，岂不能包於自然也。 夫求仙之道，皆当先愿而后求愿，感而致灵尔。 五愿之大也。 愿亦无所不包，福亦无所不覆，庆亦无所不流，可谓蠲愿善矣。 若能精心在愿，亦无不响应，后来有情者，为复访而意焉。 上相青童君曰：吾往学经历七百年，涉峻登巅，越东跨西，殊南经北，逍遥中原，经师三十二人，凡受三百余事，未得上登金阙，诣圣君受灵书紫文，服日月黄华拘魂制魄之道，结璘郁仪九真八道，解形遁变紫度炎光，流金火铃吐纳飞霞，腾空步云蹑行七元宝经。 圣君以七星移度，太帝所宝，告盟见授，使断落六宫死名，填塞东北鬼户，上闻天关移度我身，然后可得上登三元奉行，遂得上相之司，总领群仙，七星焕落於天，回转九元之精，上乘三元之气，下统六天之名，生死离合，莫不由於七星。 故人为斗所加则死，斗所移则生，故七星为天之相，开关为度生之府。 夫学不知断死户於北斗，度生目於南关，生不可保乎。 上帝以此经移於六合之房，命西华玉女、金晨金童三百人，侍卫灵文，后传众真，乃出於名山。 西城王君后於王屋石室之内，见有此文，王君方退斋三月，赍信诣山，奉受披省，是七星移度，修行其道，得成真人。 自无玉名成仙之人，莫能闻见此道。 有经之子，酆都之六宫便记子之名，移度南关，况复修行之耶。 王君云：此本有三卷，天关、天图二卷，不行於世，南岳夫人所受，正得一卷七星移度尔。 上清天关三图经竟",
      "translated_text": "After five years of such practice, one may ascend to the Nine Heavens upon clouds, where one’s name is inscribed in the Register of Immortals. Even one’s seven generations of ancestors will receive blessings and joy, escaping the Three Wretched Paths to dwell in the Southern Palace of Immortals.\n\nThe Supreme Prime Lord of the Southern Culmen states: Those who study in the world know only to seek in the morning and expect results by evening, to utter a single vow and hope for the Dao’s descent, to recite spells and await response—yet they do not understand that ascending the heights of Mount Qi begins with the first step on the mountain’s base, that a thousand-foot tree grows from the tiniest sprout. The Dao is lofty and truly wondrous; how could one set foot and immediately climb the cloud ladder?\n\nEven the Thearch-Lord, who governs the true qi by mandate, must still kindle a bright lamp to commune with the Dao. How much more should the Five Vows be cherished as blessings, for they naturally encompass all things. The path of seeking immortality must begin with vows, followed by the pursuit of those vows, so that resonance may summon the numinous. The greatness of the Five Vows lies in their boundless inclusivity—no blessing is left unbestowed, no joy left unshared, no goodness left unpurified. If one can focus the heart sincerely upon the vows, there will be no lack of response. Those of later generations who hold such sentiments should take heed and reflect deeply.\n\nThe Most Exalted Azure Lad of the Upper Prime states: In my past studies, I traversed seven hundred years, scaling perilous peaks, crossing from east to west, journeying through south and north, wandering the Central Plains. I studied under thirty-two masters and received over three hundred teachings, yet I had not ascended to the Golden Gates to receive from the Sage Lord the sacred scriptures of purple texts, the Dao of ingesting the yellow essence of sun and moon to restrain the hun and po, of binding the radiant brilliance of the Nine Perfected and Eight Ways, of dissolving form and concealing transformation, of traversing the purple passage of flaming light, of wielding the flowing gold and fire bells, of exhaling and inhaling flying auroras, of soaring through the void and treading the clouds, of pacing the Seven Primordial Treasures. The Sage Lord, by the shifting of the Seven Stars—a treasure of the Supreme Thearch—swore an oath and transmitted these teachings, enabling me to sever the six palaces of death and seal the northeastern ghostly gate. Only then did my name ascend to the Celestial Pass, where my body was shifted, allowing me to ascend the Three Primes and serve in office. Thus, I attained the rank of Most Exalted Minister, overseeing the host of immortals. The Seven Stars blazed and fell from the heavens, revolving the essence of the Nine Origins. Above, I rode the qi of the Three Primes; below, I governed the names of the Six Heavens. Birth and death, separation and union—none occur apart from the Seven Stars. For when the Dipper’s influence falls upon a person, they die; when it shifts away, they live. Thus, the Seven Stars are the ministers of heaven, the Celestial Pass the treasury of life’s renewal.\n\nIf one studies without severing the gate of death beneath the Northern Dipper or shifting the eye of life at the Southern Pass, how can life be preserved? The Supreme Emperor entrusted this scripture to the chambers of the Six Directions, commanding the Jade Maiden of the Western Flower and the Golden Lad of the Golden Dawn—three hundred in all—to guard the sacred text. Later, it was transmitted to the assembled perfected and emerged from the famous mountains. The Lord of the Western City later discovered this text within the stone chamber of Wangwu Mountain. After retiring to purify himself for three months, he presented his pledge and journeyed to the mountain to receive and peruse it. Through the practice of the Seven Stars’ shifting, he attained the rank of Perfected. Since then, no one without a jade name or immortal destiny has been able to encounter this Dao. For those who possess this scripture, the Six Palaces of Fengdu will record their names and shift them to the Southern Pass—how much more so for those who cultivate its practice?\n\nThe Lord of the Western City states: This original text comprised three scrolls—*The Celestial Pass* and *The Celestial Charts*—which do not circulate in the world. The Southern Marchmount Lady received only one scroll, *The Seven Stars’ Shifting*. Here ends *The Upper Clarity Scripture of the Three Charts of the Celestial Pass*.",
      "overlap_context": "nd are undivided, free from stray thoughts or external distractions. If the true spirits scatter, the True will not descend. If one treads through filth and defilement, the True will also remain distant.\n\nThe Thearch-Lord’s Five Assemblies of Upper Vows conclude here. On each of these days, if you can sincerely vow and contemplate according to the method, the Thearch will dispatch jade lads to guard your body, summoning the Five Directions’ vows. The Dao of immortals will descend upon your form.",
      "start_char": 6494,
      "end_char": 7190,
      "start_sentence": 160,
      "end_sentence": 176,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.553720712661743,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清天关三图经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}