{
  "source_id": "上清太上黄素四十四方经",
  "source_file": "chunked_daozang\\上清太上黄素四十四方经.json",
  "total_chunks": 7,
  "total_original_chars": 8005,
  "total_translated_chars": 50755,
  "total_translation_time": 260.24420499801636,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清太上黄素四十四方经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Highest Yellow Plain Forty-Four Methods Scripture**\n\n**Scripture Title:** *The Supreme Clarity Highest Yellow Plain Forty-Four Methods Scripture*. Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. One scroll. Base text from: *The Orthodox Daoist Canon*, Section Zheng, Part One.\n\n---\n\n**The Supreme Clarity Highest Yellow Plain Forty-Four Methods Scripture**\n\nThe Most High Great Dao Lord, Mysterious Numinous and Transcendent, governs the transformations above, harmonizing the thousand Perfected, paying homage to the ten directions. Thereupon, he summoned the Eight Emperors, concealed his march in the morning waves, beheaded the Six Heavens, and rightly established the Three Ways. His awe-inspiring might shook the heavens, his radiance streaming across ten thousand peaks.\n\nThus, he commanded the Perfected of the Great Ultimate and the Four Directors of the High Ministers, who served the Jade Dawn, to reveal the lofty chapters of the Vermilion Plain and eradicate the teachings of the Cold Numinous. Thereupon, they opened the Supreme Way of the Eight Assemblies, systematizing the essential principles of divine transcendents. In all, forty-four methods were compiled into a single work, collectively titled *The Yellow Plain Scripture*. It was sealed in a casket of cinnabar blossoms, encased in a brocade pouch of mysterious numen, and entrusted to the Left Duke of the Immortal Capital, concealed within the Chamber of the Seven Radiant Gems.\n\nFurthermore, he commanded thirty-seven Jade Maidens of the Northern Cold to constantly guard the bodies of those who possessed this scripture. According to the *Luminous Statutes of the Four Poles*, within seven hundred years, it was to be transmitted to only three individuals.\n\n*The Supreme Highest Yellow Plain Forty-Four Methods* are all celestial writings from above the Nine Heavens, hidden texts of the Eight Assemblies. Therefore, the Most High Dao Lord commanded the High Transcendents of Supreme Clarity and the Perfected of the Great Ultimate to systematize and arrange their contents, compiling them into forty-four divine methods of the *Yellow Plain*. These were established collectively after the rectification of the Six Heavens. These chapters all derive from the commands of the Most High Sages and were inscribed by the brush of the High Ministers. Thus, the Dao is perfected in the Great Perfected, surpassing all other works in subtlety. They are called the *Orthodox Dharma of the Three Heavens*, which overawes the malevolent *qi* of the Six Heavens and eradicates the inauspiciousness of a thousand demons.\n\nThose with predestined affinity who are fated to behold this text are surely opened by the mysterious and transcendent, and must possess the destined portion of divine transcendents. This divine scripture is not transmitted in the worldly realm. Whoever divulges it will be punished by the Three Heavens for treachery, reported to the Imperial Lord, and their transgression of disclosure will be accounted a breach of covenant. Within three years, the Most High will dispatch the divine soldiers of the Five Emperors to punish their person. They will die as lowly ghosts, and their seven generations of ancestors will together be examined by the Water Officials.\n\nAll who receive *The Supreme Highest Yellow Plain Forty-Four Methods Scripture*—both master and disciple—must observe a retreat of forty-five days, abstaining from worldly affairs. They must first invoke the divine luminaries and, only after careful consideration, transmit it under covenant. The covenant employs a jade tablet, one foot and five *fen* in length, one *cun* and four *fen* in width, to invoke the covenant of the Perfected of the Four Poles. Additionally, forty feet of yellow plain silk and two pairs of golden rings are used in place of the blood-oath of solemn proclamation. If, after receiving the scripture, one violates the covenant, transmits it to the unworthy, the punishment is as recorded above, and they will be penalized by divine soldiers. Be cautious!\n\nThe Most High Dao Lord commanded the Perfected of the Great Ultimate and the High Ministers in attendance to compile *The Yellow Plain Divine Scripture: Forty-Four Methods* as follows:\n\n---\n\nAll who read *The Thirty-Nine Chapters of the Great Cavern Perfected Scripture*, who can comprehend its subtle sounds, discourse without hindrance on the profound, exhaustively investigate its mysteries, expound and praise its numinous chapters, whose resonant voices shake the heavens, whose subtle principles penetrate all, and who recite it in secluded chambers with crystalline clarity and no obstruction—such persons possess the talent of High Transcendents. Only those who read this scripture can ascend to the presence of the Most High, summon the Nine Perfected, share rank with High Transcendents, and hold office as Directors of Destinies. According to *The Supreme Highest Yellow Plain Forty-Four Methods*, they may be called *Dadong* (Great Cavern) Dharma Masters.\n\nThe *Dadong* Dharma Masters are truly without peer, overseeing the void and presiding over the mysterious, communicating with spirits and connecting with the subtle. Their radiance gives life to the myriad Perfected, and their rank corresponds to the High Transcendents of the Great Ultimate. This is called \"refined study and mysterious resonance,\" not limited to ten thousand recitations. Even if one merely possesses this scripture without studying or reciting it, they may still serve as a Master of the Most High and a Teacher-Lord of ghosts and spirits.\n\n---\n\nAll who read *The Great Vermilion Hidden Book of the Golden Flower Cavern Chamber* and *The Feminine One’s Treasured Chapters*, who can savor the mysterious and true, grasp the principles of the Cavern Scriptures, awaken to the obscure and profound, wander freely in the void, encounter all without obstruction, aspire to the Perfected with sincerity, and silently vow in secluded chambers to communicate with the numinous—such persons may, through their refined resonance with the Great Plain, ascend and descend with the Nine Perfected, harmonize the Five Spirits, and have their names recorded by the Directors of Destinies. According to *The Supreme Highest Yellow Plain Forty-Four Methods*, they may be called *Sandong* (Three Caverns) Dharma Masters and Perfected of the Primordial Radiance.\n\nThe Perfected of the Primordial Radiance hold rank corresponding to the High Transcendents of the Imperial Unity. The High Transcendents of the Imperial Unity oversee the void above the void and are the supreme Perfected among all spirits. Even if one merely possesses this scripture without being able to study and resonate with it, they may still serve as a Master of the Three Origins and hold the office of a terrestrial transcendent.\n\n---\n\nAll who read *The Great Vermilion Hidden Book of the Cavern Perfected Mysterious Scripture* and the affairs of the Imperial Unity’s dissolution of knots and nurturing of the hundred spirits, who can refine their study to achieve mysterious resonance, penetrate the profound and reach the numinous, return their essence to the mysterious origin, disperse the seven scriptures, govern the obscure and unblock the stagnant, and savor the radiance of the celestial clarity—such persons are chosen by the mysterious and inscribed in the imperial register, their radiance mapped in the Three Origins. Their essence penetrates the divine luminaries, and they resonate with the Turtle Mountain. According to *The Supreme Highest Yellow Plain Forty-Four Methods*, they may call themselves *Xuandong* (Mysterious Cavern) Dharma Masters and High Radiance Perfected.\n\nThe High Radiance Perfected hold rank corresponding to the High Transcendents of the Nine Palaces. Such scriptures enable one to greatly harmonize with the Imperial Unity, encompass the Five Spirits, have the Nine Numinous attend as ministers, and serve as officials of the Three Bureaus. Even if one has not yet cultivated these practices, they may still serve as Masters of the Three Heavens and hold office above the terrestrial administrators.\n\n---\n\nAll who can diligently advance in the Three Scriptures, expound and comprehend their marvelous texts, resonate with the lofty and remote, and immerse themselves in the profound and distant—such persons are surely inscribed in jade registers and inscribed with golden and jade names.\n\nSome receive these scriptures at the very outset, granted through karmic bonds with numinous beings, while others encounter them in their entirety and suddenly obtain them. Those who receive these scriptures have all been tested by the Great Ultimate, their sincerity and devotion examined, their ranks and capacities assessed—this having already been declared prior to transmission. It is not necessary to revere an oath-bound master or enter into blood-sealed covenants.\n\nAccording to the *Supreme Yellow Register of the Forty-Four Directions*, one may then style oneself as a Master of the Numinous Bureau and High Radiance Perfected, bearing the title of the Ninefold Transcendent Grandee. If one’s resonance ascends to evoke response, jade tones echo in secret harmony, myriad cycles complete, and yin and yang merge, one may then ride clouds and mount dragons, ascending in broad daylight to the void, entering the Three Clarities to become a Minister of the Great Ultimate and assume office above the High Transcendents.\n\nAll who obtain the Supreme Dragon Scriptures of the Great Perfection Dao, or the Jade Clarity’s Hidden Writings of the Mystic Plumage, and can penetrate the subtle, resolve the obscure, elucidate the marvelous, and by analogy bring forth myriad accomplishments—those who set their aspirations toward the morning clouds and savor the distant purity—such persons are surely inscribed in golden registers and jade tablets, their names recorded in the imperial chambers, their perfected beings steeped in dark radiance, their clarity and emptiness refined and serene. Such talents are all destined to become High Transcendents.\n\nAccording to the *Supreme Yellow Register of the Forty-Four Directions*, one may then be called a Master of the Three Heavens and Supreme Perfected. The Supreme Perfected hold rank corresponding to the Ministers of the Great Ultimate Transcendents. Even if one merely possesses these scriptures, the Three Bureaus will attend as servants, the Four Luminaries will serve as ministers, all directions will align, and though no trial be declared, one may command spirits and commune with the numinous, assuredly attaining the terrestrial perfected.\n\nAll who diligently test their secret devotion, immerse themselves in the profound and true, purify themselves through fasting to the utmost, and yearn for the divine immortals—those who suddenly encounter these Three Grades of Scriptures without a master’s transmission—such persons are surely those whose karmic bonds with the mysterious have long been destined, their names already listed among the Perfected of the Imperial Homeland. Those who receive these scriptures in secret transmission are marked by extraordinary distinction to manifest worldly merit.\n\nAccording to the *Supreme Yellow Register of the Forty-Four Directions*, one may then undertake the hidden covenant of the numinous oath. On a *jiazi* day, enter a purified chamber in fasting, and at midnight when generative *qi* arises, recline or sit as one wishes. Close the eyes in faint semblance, knock the teeth twenty-four times, and mentally bow to the four directions. When finished, softly recite the incantation:\n\n*\"Supreme Nine Numinous, Three Pristine Primordial Essences,\nDivine Lords of the Immortal Capital, Three Clarities of the Four Poles,\nOnce I received the transforming Dharma and encountered the supreme scriptures,\nYet the mysterious masters are distant and unseen in form.\nI beseech the hidden covenant, swearing by the numinous and bright,\nWith jade lads attending in guard, jade blossoms sustaining life,\nEight vows and nine unions, wondrous wisdom penetrating the numinous,\nMay I vow for the divine, vow for immortality, and soar through the Jade Clarity.\"*\n\nWhen the incantation is complete, knock the teeth twenty-four times again, swallow saliva ten times, and mentally bow before the scriptures. Then one may sleep or rise to recite the scriptures, and auspicious responses will surely follow. By practicing this regularly, within three years one may become a Scripture Master and fulfill the office of Perfected Grandee. This is the inner method of the Yellow Register, requiring no further recourse to oath-bound masters or blood-sealed covenants. Even after receiving the scriptures, the Perfected should continue this practice.\n\nWhen receiving the Three Scripture Methods of the Great Cavern, one should retire to a secluded chamber, avoiding the company of the profane, and make a clean copy to place upon the scripture stand. One should always offer incense in reverence, and set aside a separate bed to the east for the stand. When performing rites or making vows, one should conduct them facing the stand. The scriptures that may be recited should not be placed upon the stand.\n\nAll Daoists who receive the Three Grades of Perfected Scriptures and the *Feminine One’s Mystic Plumage of the Hidden Cavern* should diligently yearn for the lofty and remote, resonate with the numinous and bright, purify the heart through fasting, and single-mindedly cultivate the Dao to secure life, unwavering in their devotion, savoring the mysterious clarity of the luminous. Such persons are assured of attaining High Transcendence. According to the *Supreme Yellow Register of the Forty-Four Directions*, one may then perform the Hidden Rites of the Eight Audiences and Three Audiences.\n\nOn the days of *jiayin*, *wushen*, *gengshen*, *dingsi*, *jisi*, *guihai*, or *yihai*, enter the chamber at dawn, burn incense to the left and right, close the eyes in faint semblance, knock the teeth twenty-four times, and mentally bow to the four directions. Then softly recite the incantation:\n\n*\"Supreme Supreme Numinous, Three Pristine Primordial Essences,\nReverently on this auspicious day, I present the inner audience to the Perfected Scriptures.\nDivine lads and jade maidens scatter incense in the empty courtyard,\nThat I may become a divine immortal, and heaven and earth incline toward me.\"*\n\nWhen the incantation is complete, swiftly close both eyes so that inner and outer darkness merge, with no mutual perception. Knock the teeth thirty times, swallow saliva three times, then open the eyes—the rite is complete. This is called the Hidden Rite of the Eight Audiences and Three Primordials. By practicing this regularly, one may attain numinous penetration and clear vision, resonate with the Three Primordials, unite with the marvelous and responsive, ascend and descend the Great Mystery, have jade maidens attend the scriptures, present one’s prayers for life, and become an immortal undying, with heaven and earth inclining toward one. Those who have not yet received the scriptures but practice this for three years may become Scripture Masters, blessed with numinous portents and auspicious signs.\n\nWhen cultivating and receiving the *Great Cavern Perfected Scriptures* and the *Feminine One’s Mystic Writings*, one should always sleep in a separate chamber, avoiding contact with others, and place the scriptures in a clean and purified stand. Morning and evening, burn incense, bow in reverence, and present vows to the world, thereby erasing the records of transgressions.\n\nOn the third, seventh, and twenty-first days of the month, the jade maidens attending the scriptures will report one’s transgressions to the Three Primordials, and together with the Supreme Unity Sovereign Lord, they will examine one’s conduct. On these days, enter the chamber, burn incense, knock the teeth twenty-one times, and softly recite the incantation:\n\n*\"Supreme Numinous Directions, Great Cavern Perfected Scriptures,\nOnce by good fortune I encountered the numinous and bright,\nUnfolded the seven charts of protection, received the audience of the Three Clarities.\nIf there be transgressions to shield, may the Sovereign Lord disperse the numinous,\nThe Three Images open in clarity, the Supreme Emperor unite in form,\nThat I may become a flying immortal, my divine perfection enduring forever.\"*\n\nWhen the incantation is complete, knock the teeth fourteen times, mentally bow to the four directions, then open the eyes—the rite is complete.\n\nThose who regularly practice this will experience the esoteric resonance of the Three Origins, and the Sovereign Lord will pardon their transgressions. Any sins reported against them will be disregarded. Whenever Daoist practitioners engage in the visualization of superior methods or cultivate the affairs of the Supreme Unity, they must avoid encountering corpses, blood, or defilements. Should one inadvertently witness such things, they may perform the esoteric rite of the Three Luminaries’ Concealment to dissolve the impurity.\n\nTake one *zhū* of true cinnabar, scatter it into water, and use it to wash the eyes, rinse the mouth, and cleanse the hands and feet. Then, enter the chamber and settle into repose. Cross the hands over the heart, knock the teeth fourteen times, and mentally bow to the four directions. Softly recite the incantation:\n\n*\"Supreme Dao of the Three Origins, Supreme Unity guards my form,\nThe Lord of Life’s Attendants, the Five Spirits of Yellow Tranquility,\nBlood-corpses disperse and vanish, inauspicious defilements sink and fade,\nSeven fluids coil and infuse, the five viscera flourish anew,\nThat I may become a divine immortal, ever enjoying fortune and purity.\"*\n\nWhen the incantation is complete, swiftly close both eyes and gather the *qi*, uniting inner and outer in darkness so that neither hears nor sees the other. After a while, when a slight warmth is felt within the body, the sign is complete. Then knock the teeth seven times, swallow saliva three times, and the rite is finished. This is the esoteric method of the Three Luminaries’ Concealment for dissolving defilement.\n\nWhenever Daoist practitioners cultivate superior methods and wish to examine, recite, or read scriptures, they must burn incense on both sides when opening the case. Mentally bow before the scripture, knock the teeth three times, and softly recite the incantation:\n\n*\"Supreme Method of the Jade Emperor, ascending to the Three Clarities,\nOn this auspicious day of fasting and sincerity, I dare to open the divine scripture,\nTen thousand trials concealed, all endeavors shall succeed,\nJade lads attend and guard, jade blossoms scatter fragrance,\nI report above to the Three Origins, that I may attain long life.\"*\n\nWhen the incantation is complete, open the scripture and only then may one recite and read it. This is called the Great Emperor’s Method for Opening Scriptures. It commands jade maidens and jade lads to attend, burn incense, and summon the descent of numinous spirits, ascending to the Nine Heavens.\n\nWhenever Daoist practitioners receive and study Cavern Scriptures or cultivate the affairs of the Supreme Unity, they must not reveal the name of the Supreme Unity Sovereign Lord to those of differing aspirations. To disclose it is to violate the Dark Mystery’s Yin Punishment. Should one transgress thrice, the Five Spirits will abandon their abode, and one will no longer become an immortal. Beyond three transgressions, one dies as a lowly ghost, with no hope of immortality.\n\nAfter receiving scriptures, Daoist practitioners should, morning and evening, visualize and recite the name of the Supreme Unity Sovereign Lord. First knock the teeth three times, then softly recite the incantation:\n\n*\"Ascending Brahma, treading prosperity, the Sevenfold Numinous Venerable,\nSupreme Unity’s sagely plans, Five Spirits of Yellow Tranquility,\nAscend to the Nine Heavens, stand alongside the Emperor,\nI beseech to become a flying immortal, my seven ancestors as womb-infants,\nDissolve transgressions and release sins, ascend to the Jade Clarity.\"*\n\nWhen the incantation is complete, knock the teeth seven times and swallow saliva three times. This is the method of visualizing the spirit, releasing sins, and petitioning the Emperor for immortality. Practicing this for seven years will evoke the resonance of numinous spirits, delight the Sovereign Lord, and prompt the Mysterious Mother to record one’s life. The Five Spirits will abide constantly, the sins of the seven ancestors will be absolved, and they will be reborn as Southern Immortals. One will attain eternal life, ascending in broad daylight to the morning heavens.\n\nDaoist practitioners receiving and studying the methods must not speak of matters concerning death. To mention such things disturbs the *qi* of life, preventing it from residing with the Emperor. Thus, the *qi* of death circulates within, the spirit of life departs, and malevolent *qi* roams the corpse, filling its orifices—this is the gradual onset of illness and death.\n\nThose who receive the Supreme Unity’s visualization of the Five Spirits and cultivate the Nine Palaces’ Fusion with the Sovereign Lord must take care never to harbor anger or wish for their own death. After receiving scriptures, if one’s speech reaches forty instances of such transgressions, they will no longer be deemed a Perfected One. The jade lads and maidens attending the scriptures will report them to the Sovereign Lord as the sin of a fleeing life. The practitioner will surely be examined by the Dark Void and reprimanded by the Supreme Highest. Within three years, their body will perish. These are the statutes of the Yellow Simplicity and the methods of the Supreme Mystery.\n\nWhenever cultivating superior methods or practicing the Feminine Unity or Supreme Unity’s affairs, all scriptures one possesses must be honored with incense, ritual, and incantations to serve the numinous spirits. One must not personally violate them with defilement or negligence, nor recklessly discuss scriptural methods with those of differing aspirations. Those who commit such transgressions will have their faults recorded by the jade lads and maidens attending the scriptures, who will report them to the Sovereign Lord. For each person told, one jade lad and one jade maiden will be lost, returning to the Three Simplicities’ chambers. If three people are told, the jade lads and maidens will all depart. One may then suffer disasters of water or fire, suddenly lose their scriptures, or have them vanish unawares. If transmitted to the unworthy, the Three Heavens’ Life Controllers will punish the transgressor’s body, and they will die as lowly ghosts, eternally serving the Water Officials. These are the statutes and ordinances of the Jade Emperor.\n\nWhenever cultivating the affairs of the Supreme Unity or practicing superior methods of spirit visualization, one must take care never to see corpses or defiled objects. Seeing one corpse results in a year’s inability to practice, nullifying a year’s progress. This is the statute of the Supreme Unity, which both retroactively punishes past transgressions and obstructs future advancement. For one corpse seen in a year, the punishment is three years of severed progress and interrupted practice. If one encounters twenty-four corpses, they will no longer be able to cultivate the Supreme Unity or seek immortality.\n\nThose who cultivate superior methods, the Feminine Unity, or the Supreme Unity’s affairs must ensure that the *qi* of the Three Hun and Five Spirits within their body constantly suffuses their headscarves and garments, while the seven *po*, nine numinous spirits, and residual essence always dwell beneath their shoes. Thus, Daoist students must not sleep on shared mats. Their hempen garments must not borrow the *qi* of others, and their shoes must not be tainted by defiled earth or allow others to touch them, lest the Three Hun be startled.\n\nWhenever Daoist practitioners practice *qi*-absorption, spirit visualization, cloud-swallowing, or seek the Dao of long life, they must never consume the five pungent vegetables or succumb to the maladies of wine and lust. Thus, the divine persons of antiquity said: *\"The five pungent vegetables are the axes that hew the viscera; wine and lust are the coffins that bury the body.\"*\n\nThose who can sever the harm wrought by axes and seal the deathly abode of coffins may then tread the path of ceaseless life and erase the trails leading to divine transcendence. Whenever one seeks reverent awe, one must first strike the Celestial Bell upon the left teeth twenty-six times, then close the *qi* and hiss five times with a \"chih-chih\" sound to the left, thereby constantly repelling the *qi* of malevolent spirits, inauspicious entities, and foul things.\n\nWhen retiring at night, just before sleep, place the hand over the heart three times, close the eyes, and softly recite the incantation:\n*\"Great Numinous Nine Palaces, Great One guards the chamber,\nA hundred spirits attend their stations, hun and *po* harmonize as one,\nLife eternal, deathless, sealing away all inauspicious and baleful forces.\"*\nUpon completing the incantation, sleep—this is called the *Nine Palaces Hidden Incantation for Sleeping Spirits*. Practicing this regularly will pacify one’s hun and *po*, ensuring constant protection of auspiciousness.\n\nWhen transmitting the above method, the master possessing the scripture must first seek a spiritual response before imparting it. Entering the chamber to burn incense, one silently vows before the deities, then bows before the scripture and softly recites:\n*\"Supreme Primordial Lord, Great Divine of the Immortal Capital,\nOn this auspicious day, I open the Eight Vows to declare:\nI wish to transmit this superior method to [name],\nDare I inform the Numinous Origin—grant a sign if it may be proclaimed.\"*\nAfter the incantation, retire to sleep, and a divine response will surely be received. The disciple will then know in their heart whether it is fitting to receive the transmission.\n\nThe method for a scripture master to transmit teachings begins with bowing in the four directions to invoke the divine, establishing the ancestral master as the principal authority. Then, holding the scripture, one rises, faces heaven, and recites an incantation, swearing an oath before the divine spirits as a sacred covenant. One must state the name of the recipient, invoke the great deities, and declare the title of the scripture to be transmitted, setting forth its precepts and recording the vow in writing. After the incantation, the disciple bows twice, kneels to receive the scripture, and bows twice again. This is the inner method of the Perfected One’s divine covenant—it need not involve blood-oaths or risk betrayal.\n\nWhenever a scripture master transmits teachings, they must follow the above method: purify themselves in seclusion, avoid worldly affairs, invoke the divine, and seek a secret response before proceeding. If the signs are inauspicious or the response unfavorable, this indicates the celestial spirits are manifesting their will to prevent transmission. If a disciple disobeys the divine and receives the transmission regardless, according to the statutes of the *Yellow and White Scriptures*, they will face dark judgment, their seven generations of ancestors will be eternally confined to hell, their own body will perish, and transcendence will be beyond hope.\n\nIn matters of cultivating the Great One, when making vows or offerings, one must never kowtow. Those who kowtow overturn the Nine Heavens, disturb the Thousand Perfected, disrupt the divine palaces, and invert the Mud Pill Palace, causing the Heavenly Emperor to wail in the Upper Palace and the Great One to weep in the Central Field. Repeatedly doing so renders one’s meditative focus futile: the Three Perfected abandon their abodes, the Seven Spirits scatter, and the Mystic Dwelling invites misfortune—this is the greatest taboo of the Supreme Five Spirits. Thus, the Perfected Ones of antiquity merely stored the intention of kowtowing in their hearts, conducting affairs through refined focus and spiritual resonance, never relying on physical prostration to beseech the divine.\n\nIn practicing the Dao of the Great One, Perfected Ones and Daoist practitioners must not perform ritual bows, for this is also forbidden by the Lord Emperor and the Five Spirits. When engaging in focused contemplation and making vows, one should only bow in the heart, without physical prostration. Those who do not cultivate and receive the superior methods are no different from external scholars.\n\nWhen Daoist practitioners enter seclusion to fast and cultivate, should they suddenly experience wondrous spiritual responses or auspicious dreams, these are signs that the Dao is nearing fruition. The practitioner must diligently cultivate without ceasing, and the celestial convergence will naturally occur. If one persists without interruption, the Perfected Spirits and Jade Maidens will rest in one’s chamber. Upon waking, one should lie supine, face upward, click the teeth twenty-one times, close the eyes, and softly recite:\n*\"Supreme Red Child, Cinnabar Emperor revolves the Pearl,\nGreat One, Lord of the Imperial Honored, coalesces the Heavenly Count,\nSeven Numinous Ones ascend in response, Five Spirits return in wanderings,\nDivine Youth and Jade Maiden, resplendent paired talismans,\nSeven Stars ascend together, mounting the Dawn Mound.\"*\nAfter the incantation, click the teeth twenty-one more times, swallow saliva three times, then open the eyes—this is complete. This is called the *Incantation for the Great One to Retain the Spirit and Convene the Immortal Worthies*. Practicing this for three years will cause the deities of the Nine Heavens and the Jade Maidens of the Supreme Mystery to descend and guard you.\n\nWhen Daoist practitioners enter seclusion to fast and cultivate, if they frequently encounter inauspicious entities, strange apparitions, blood omens, demonic spirits, or foul *qi* attempting to frighten or test them, they should perform the *Northern Emperor’s Incantation to Slay Demons and Exorcise Malevolent Spirits*. First, click the teeth thirty-six times, then recite:\n*\"The Two Images invert, the banner of the Mystic One,\nSeven Spirits guard life, ascending to the Three Clarities,\nDual Emperors drive out, the mighty Cypress Legion,\nThree hundred thousand warriors, encamp to guard the divine,\nA hundred colossal beasts, spewing might to seize spirits,\nBrandishing swords to expel evil, beheading demonic spirits,\nWhat the Divine Earl incants, a thousand demons vanish in form.\"*\nAfter the incantation, click the teeth thirty-six more times. This is the *Northern Emperor’s Incantation to Slay Demons and Exorcise Malevolent Spirits*. When the divine spirits and upright *qi* hear this incantation, they will all come to protect you, and the inauspicious *qi* will be destroyed.\n\nWhen Daoist practitioners lodge alone in mountains and forests and are frequently harassed or tested by mountain spirits and malevolent ghosts, they should click their teeth fourteen times, hold their breath, and recite:\n*\"Yesterday I was summoned by the Emperor, entrusted with the true origin,\nCommanded to seal and govern these Five Peaks, to hew and divide Feng Mountain,\nAll mountain spirits and myriad numina, assemble before the Emperor to receive their duties,\nSeven Spirits initiate the procession, Three Origins administer the Perfected,\nIf any minor demons remain, execute them at once,\nMountain spirits and marsh wardens, hasten to receive my command,\nThe divine master’s oral decree, ascends to the Three Clarities,\nAll as in the Great Cavern’s method.\"*\nAfter the incantation, click the teeth fourteen more times.\n\nHere the Perfected Lord’s method for capturing spirits and subduing mountain demons and the hundred ghosts. All mountain deities, earth numina, and the spirits of proper *qi* in dwellings and shrines—upon hearing this incantation—will come bearing whips to receive and escort, with divine soldiers standing guard, as though ten thousand men shared the same lodging.\n\nWhenever Daoists conceal their traces in mountains and forests, refine their thoughts to summon the numinous, or recite the Cavern Scriptures so that their voices resound, they are often tested and defeated by the Great Demon of the Northern Emperor. At each dusk and night, the adept should click their teeth thirty-six times, then recite:\n\n*\"Great Demon King of the Northern Emperor, who receives duties before the Perfected Lord,\nGhosts of the Yellow Springs’ bends, the Four Luminaries and Feng Mountain,\nA thousand demons blend their forms, nine heads share one body,\nDivine tigers release their venom, beheading and thunderous annihilation,\nThe Divine Duke utters the incantation, none spared in the slaughter,\nThe Supreme Subtlety issues its command, governing mountains and rivers,\nClashing bells are cast, radiance streaming through the Nine Heavens,\nWind and fire launch their assault, ten ranks of divine blades arrayed,\nMalevolent tests are subdued and extinguished, ten thousand spirits beheaded,\nIf any demonic poison dares arise, it is sealed within the Three Passes,\nFollow the Cavern’s method—none shall defy these words.\"*\n\nAfter the incantation, click the teeth thirty-six more times. This is called the **Three Heavens’ Orthodox Method for Incanting Demons and Spirits**. Those who practice it regularly will be attended by divine soldiers, the spirits of mountains and rivers will be subdued, a thousand demons will be sealed, and ten thousand trials will not disturb them.\n\nWhenever Daoists engage in the Great Cavern’s methods or the affairs of the Great One or Imperial One, at dusk they should enter their chamber, burn incense, and bow in reverence before the scriptures. Then, clicking their teeth fourteen times, they softly recite:\n\n*\"Supreme One, Imperial Honored One, Imperial One of the Mysterious Scripture,\nFive clouds scatter their radiance, dense and penetrating through the Three Clarities,\nJade lads and jade maidens burn incense and attend the numinous,\nI humbly present my wishes, that I may merge my form with the divine,\nGranting me immortality as a transcendent, ever prosperous and upright.\"*\n\nAfter the incantation, click the teeth fourteen more times. This is called **Burning Incense to the Imperial One, Presenting Wishes Above, and Merging with the Numinous**. Those who practice this regularly will be attended by jade effulgences, divine spirits will aid their perfection, fragrant clouds will scatter and ascend to the Nine Heavens. Within three years, jade maidens and jade lads will appear before them.\n\nWhenever Daoists enter their chamber to fast and cultivate sincerity, when about to eat, they should hold the chopsticks in their left hand and tap the plate three times, then softly recite:\n\n*\"Two Mysteries, Supreme Dao, Four Poles in pure clarity,\nSupreme One, Imperial Lord, the hundred spirits in yellow tranquility,\nReceive sustenance in the Three Palaces, irrigating the spirit of the spleen,\nOffering to the Great Harmony above, partaking of the five fragrances,\nThe life of the hun-soul and fetal spirit, the seven fluids flow and settle,\nA hundred passages harmonize, the five viscera flourish in radiance,\nThe Twin Sovereigns merge with the effulgence, soaring to ascend the Upper Clarity.\"*\n\nAfter eating, tap the plate three more times. This is called the **Method for the Hun-Soul and Fetal Spirit to Receive Fragrance and the Hundred Spirits to Partake of Sustenance**. Those who practice this regularly will find their spirit and *qi* harmonized, their hun and po at peace, evil and trials averted, and enduring prosperity and uprightness.\n\nWhenever Daoists arrange their hair into a topknot or wash their hair to let it down, they should first click their teeth seven times, then softly intone:\n\n*\"The Supreme Emperor scatters blossoms, the Mysterious returns to the Great Spirit,\nOn this auspicious day, I arrange my hair and wash away the dust,\nAverting evil and illness, attaining long life as a transcendent.\"*\n\nAfter the incantation, once the hair is arranged, click the teeth seven more times to conclude. This is called the **Supreme Emperor’s Method for Scattering Blossoms While Arranging Hair**. Those who practice it will remain free from illness throughout the year, their ears and eyes keen, their head and brain free from pain.\n\nWhenever Daoists enter their chamber to burn incense and make vows, they should first click their teeth three times, then softly recite:\n\n*\"Jade effulgences scatter their radiance, the nine *qi* merge with the mist,\nFragrant clouds densely woven, directly piercing the Nine Heavens,\nThe jade maiden attending the incense reports above to the Emperor,\nGranting me long life, that I may become a true transcendent in this world,\nWhatever I face or wish for, none shall defy these words.\"*\n\nAfter the incantation, bow in reverence and focus the mind, expressing whatever is in one’s heart. This is called the **Supreme Constancy’s Hidden Incantation for Scattering Incense, Inviting the Nine Heavens’ Numinous Presence into the Chamber, and the Method for Wishes to Meet with Transcendents**.\n\nWhenever Daoists travel alone and lodge in mountains, forests, or temple halls—places teeming with demonic spirits and malevolent ghosts—they should first click their teeth thirty-six times, hold their breath, and softly recite:\n\n*\"Supreme Emperor of Yang’s Origin, the Four Directions’ hidden passes,\nA thousand demons and ten thousand poisons dare not stand before me,\nGreat beasts with double jaws, disemboweling and dismembering livers,\nDivine lords and messengers guard and defend the encampment,\nYellow-robed master soldiers, slaying and beheading demonic souls,\nAnnihilating a thousand demons, crushing mountain traitors,\nEradicating their kind and lineage, beheading and exterminating them,\nThe Jade Emperor’s supreme command, purging the Three Origins.\"*\n\nAfter the incantation, click the teeth thirty-six more times. This is called the **Supreme Constancy’s Method for Wielding the Divine Inner Incantation to Seal and Annihilate Ten Thousand Demons**. Those who recite it regularly will find divine soldiers attending them, ten thousand ghosts submitting, and a thousand demons dead and subdued.\n\nWhenever Daoists prepare for sleep and remove their clothes, they should first click their teeth three times, stand, and intone:\n\n*\"Receiving the command of the Supreme Emperor, ascending to the Nine Palaces,\nA hundred spirits settle into their positions, arrayed to attend the Divine Duke,\nHun and po harmonize and refine, the five viscera flourish in radiance,\nA hundred elixirs mystically infuse, the seven fluids fill the void,\nCrossed fire and bells radiate, extinguishing ghosts and averting misfortune,\nI humbly wish for transcendence, eternal life without end.\"*\n\nAfter the intonation, click the teeth three more times, then remove the clothes and lie down. This is called the **Supreme Emperor’s Method for Sleeping Spirits and Annihilating Ghosts and Misfortune**. Those who practice it will remain clear in spirit and free from illness, their hun and po ever present, and receive many auspicious signs.\n\nWhenever Daoists bathe their bodies or wash their hands and face, they should first stand before the water, click their teeth three times, and softly intone:\n\n*\"The Four Great open the Mysterious, Heaven and Earth as constancy,\nMysterious water washes away filth, averting and dispelling inauspiciousness,\nThe Twin Sovereigns guard the gate, the Seven Numinous settle the chamber,\nCloudy essences refine and irrigate, ten thousand *qi* blend in harmony,\nInner and outer prosper and remain upright, preserving this yellow robe.\"*\n\nAfter the incantation, click the teeth three more times, then wash the hands and face. This is called the **Method for Washing Away Filth and Averting Misfortune, the Seven Chambers’ Incantation**. Those who practice it regularly will find their spirit bright and blood purified, all inauspicious *qi* dissolved.\n\nWhen Daoists travel at night or find themselves in places that inspire fear and trembling, they should click their teeth twice seven times, then softly intone:\n\n*\"I am the True King of Lesser Existence, the Three Heavens’ Master Lords,\nOnce receiving the Supreme Shang’s divine formula, the scripture for slaying evil,\nNight-wandering corpse-spirits, seven malign specters,\nNine demons as thieves, a thousand fiends in swarms,\nThe mighty Hèbǎi Diagram’s troops, colossal beasts by the thousand,\nWielding blades to sever ten thousand perils—\nShould they face me, they shall be shattered,\nSeven Dragon Beacons pursue evil without pause,\nThe Jade Emperor’s divine incantation, sword swinging east and west,\nEradicating misfortune and expelling evil,\nTen thousand ghosts instantly suspended,\nThe Three Heavens’ Orthodox Dharma—all as I declare.\"*\n\nAfter the incantation, click the teeth twice seven times again.\nThis is called the **Three Heavens’ Orthodox Dharma, the Hidden Incantation for Dispelling the Six Heavens’ Concealments**.\nAny ghost subjected to this invocation will be struck blind and maimed, perishing of its own accord.\nWherever one travels in fear, simply follow this method—it need not be confined to night journeys.\nThose who recite it regularly will find ten thousand demons subdued and a thousand perils dissolved.\n\n---\n\nThe **Method for Daoists to Invoke and Eliminate the Three Corpses** is practiced on the last day of the lunar month, the first day of the new moon, and on the days of *jiǎyín*, *gēngyín*, and *gēngshēn*. On these occasions, the seven *pò*-spirits and wandering corpse-ghosts within the body, along with the various blood-corpses, ascend to heaven to report one’s transgressions. They then return to harm the body or wander into other regions, becoming so-called \"external ghosts\" that conspire to bring calamity.\nThus, evil dreams disturb the sleeping soul, and illnesses cling to the spirit-chamber.\nAll nightmares and ailments arise from the machinations of the seven *pò* and wandering corpses.\nOn these days, one should bathe, don clean robes, burn incense, enter the chamber, and focus the mind upward in reverence, avoiding all other distractions.\nAt the hour when *qi* first stirs in the night, or at dusk, lie facing east, place the hands over the heart, and first click the teeth three times seven. Then softly intone:\n\n*\"Seven Numinous, Five Spirits, Eight Vows, Four Declarations,\nI report to the Spirit-Mandate, the Central August’s Twin Perfected,\nRecord the hun-soul, refine the pò-spirit, seal and extinguish evil essences,\nBlood-ghosts and wandering corpses, lingering defilements—forever obliterated,\nHarmonize my gate of life, seal my gate of death,\nIf any dark mandate exists, let it be judged before the Emperor,\nGrant me long life, eternal kalpas preserved,\nBy the Great Emperor’s Dharma, I dare address the Three Origins.\"*\n\nAfterward, click the teeth three times seven again, swallow saliva ten times, and conclude.\nThis is called the **Great Emperor’s Method for Restraining the Hun-Soul and Vanquishing the Corpse-Spirit**.\nAny blood-corpses or seven *pò* subjected to this incantation will be destroyed beneath the dead corpse, their *hun* illuminated and *pò* softened, transformed within the Three Palaces.\nIt dispels evil, removes illness, and ensures the spirit remains bright and undying.\nThose who recite it regularly will never suffer from dullness or confusion.\n\n---\n\nWhen focusing the mind on the supreme Dao and invoking the expulsion of the Three Corpses, one should gather the roots of *bái zhǐ* and *qīng mù xiāng*, boil them in east-flowing water, and bathe the body to repel all blood-corpses and malign *qi*. These herbs may also be blended into incense and burned to summon divine clarity.\nIf *qīng mù xiāng* is unavailable, *bái zhǐ* alone may suffice.\n\n---\n\nOn the days of *gēngshēn* and *jiǎyín*, the blood-ghosts and wandering corpses align in their appointed cycles.\nOn these days, celestial *qi* intermingles, the seven *pò* vie in chaos, defilement obscures the true, and perverse essences surge.\nThrough diligent practice of the Dharma and the refinement of fluids, the seven spirits scatter like whirlwinds.\nOn such days, one must purify the body in seclusion, avoiding shared mats, and take care not to meet with spouse or share a bed.\nOne must also refrain from quarreling over wealth or lust, or engaging in unorthodox conduct.\nDuring incense-burning and *qi*-cultivation, the recitation of incantations may be accompanied by scripture-chanting to harmonize the spirit.\nIf contemplating the affairs of the Cavern Chamber’s Imperial Unity, one must ensure the essence remains pure and true.\n\n---\n\nWhen Daoists suddenly experience inauspicious dreams—such as dreaming of fighting with others or being seized—these too are the work of the seven *pò* and wandering corpses.\nThey may lead external ghosts into one’s home, scatter the three *hun*, incite strife among the five spirits, or bind one so they cannot return, thus causing nightmares and foreshadowing misfortune.\nUpon waking, face upward in bed, place the hands over the heart, click the teeth three times seven, and softly intone:\n\n*\"Nine Heavens’ Supreme Emperor, Four Gates’ Eight Numinous,\nSeven Chambers’ Two Mysteries, Three Pristine Original Essences,\nGrand Unity and Peach Prosperity, ascending to the Three Clarities,\nI beseech the Imperial Lords, summon the Yellow Tranquility,\nHasten to gather the seven pò, verify them in the divine court,\nIf any inauspiciousness exists—seven corpse-ghosts and demonic troops—\nI invoke the Twin Perfected, streaming torches to refine their forms,\nGreat Tàiwēi Emperor, sever and strike down evil essences,\nThree hun harmonized and refined, blood-corpses scattered and dissolved,\nSpirits return to the deserted abode, turning toward upright prosperity,\nGrant me divine transcendence, eternal kalpas preserved.\"*\n\nAfter the incantation, click the teeth twice seven times and swallow saliva ten times.\nThis is called the **Great Emperor’s Divine Incantation for Dispelling Nightmares and Averting Misfortune**.\nThose who practice it will find their three *hun* harmonized and refined, their seven *pò* restrained, their spirit bright and *qi* upright, corpse-defilements dispersed and destroyed.\nThe ghosts thus invoked will have already been consigned to hell.\nAfter these three incantations, unless blessed by numinous and auspicious responses, one will no longer dream of the extraordinary.\n\n---\n\nWhen Daoists make vows to the divine, focus their thoughts on the supreme Dharma, or recite hidden incantations, they should burn incense, bow in reverence, and whisper the words silently, ensuring no one hears.\nIf invoking the vanquishing of the Six Heavens and the destruction of malign ghosts, one may speak softly, but not so loudly as to be overheard or understood by others.\nWhen reciting scriptures, however, one may proceed as desired.\n\n---\n\nThe eight solar terms are days when the immortals of the Three Heavens gather for feasts and rites.\nThose who cultivate the Dao and make vows should observe these days for their practices and morning devotions.\nAs for the rites performed on the new and full moons, these do not pertain to the supreme Dharma.\n\nOn such days, when preparing to perform rites, make vows, or recite incantations, one should first strike the teeth seven times, then bow in reverence to the four directions, and softly intone the following incantation:\n\n*\"Supreme Clarity Jade Emperor, Three Primordial Sovereigns, Most High Numinous Ones, Divine Lords of the Immortal Capital—on this auspicious day, the Eight Vows are declared:\nThe first vow: to ascend the soaring heavens and attain the long-lived immortals.\nThe second vow: that heaven and earth harmonize with luminous winds and clouds.\nThe third vow: that the Five Viscera remain ever-present within me.\nThe fourth vow: that the Seven Ancestors be freed from karmic bonds and transgressions.\nThe fifth vow: that the Lord Emperor sever the roots of my mortal lineage.\nThe sixth vow: that in life after life, wisdom be fully awakened.\nThe seventh vow: to vanquish malign spirits and decapitate the Six Heavens.\nThe eighth vow: that numinous beings descend and heed my pleas from east to west.\nMay the first vow unite with all others, and may every word spoken be fulfilled.\nMay divine beings and immortals ascend to pay homage to the Three Origins.\"*\n\nUpon completing the incantation, bow again as before. One may then express one’s intentions freely, seeking liberation for the Seven Ancestors’ transgressions and confessing one’s own offenses, appending these to the ritual proceedings.\n\nThis is called the *Hidden Incantation of the Three Origins and Eight Homages*, the essential method of the immortals’ vows. Practicing it for three years will dissolve the sins of the Seven Ancestors, one’s parents, and oneself. Thereafter, the Jade Flower will descend as a guardian, spirits will respond in kind, and the Eight Vows, once declared, will assuredly secure the covenant of the numinous immortals.\n\nThe *Forty-Four Directions of the Yellow Simplicity* above is the method of the Great Dao Lord’s primordial *qi* of the Three Heavens, later compiled into the wondrous scriptures as a model for ritual practice. According to this scriptural text, the divine method is truly sublime, enabling cultivators to apply it for the governance of the body—a proven and efficacious spiritual formula.\n\nWithout the jade tablets of the Three Origins, the imperial charts, or the registers of immortality, the Forty-Four Directions must not be transmitted. This divine formula surpasses all other texts in marvel, concealed within the imperial chambers. At the time of transmission, only those who have transcended the ranks of high immortals, undergone trials by the Supreme Ultimate, received audience with the Jade Emperor twice, and been reapproved by the Most High may receive it. This is the true method of the Three Heavens, bound by a seven-generation covenant, never to be passed to those unworthy of the mysterious and upright. Should one violate celestial prohibitions and recklessly divulge the arcane method, the covenanted ancestors will be confined together in the earthly prisons, the self will be examined by the Water Officials, and the hope of immortality shall be forfeit.\n\nHere ends the *Scripture of the Forty-Four Directions of the Yellow Simplicity of Supreme Clarity*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清太上黄素四十四方经 经名：上清太上黄素四十四方经。 撰人不详，约出於东晋。 系早期上清派重要经典。 一卷。 底本出处：《正统道藏》正一部。 上清太上黄素四十四方经 太上大道君玄灵秀虚，维任上化，理会千真，参谒十方，乃檄摄八帝，隐浪晨征，馘灭六天，正立三道，威锋霄落，流焕万仞。 於是乃命太极真人、四司上宰，臣侍玉晨，启正丹素之高章，伐灭寒灵之法化，遂开八会之上道，科条神仙之要衷，凡四十四方，合而成目，总为黄素之书。 遂封以丹蕊之箧，盛以玄灵锦囊，付仙都左公，藏於七瑛之房。 又命北寒玉女三十七人，常卫於有经者之身。 依四极明科，使七百年中，得传三人。 《太上黄素四十四方》，皆九天之上书，八会之隐文也。 是以太上道君命上清高仙、太极真人，科集品目，陈其次序，合为黄素神方四十四首。 是伐正六天之后，共所衷立也。 此之篇章，皆出於高圣之命，注於上宰之笔，故道备太真，妙冠众品，所谓三天正法，威诚六天之凶炁，伐灭千妖之不祥。 夫有宿命，应得见此文，皆玄挺开会，必有神仙定分也。 此之神经，不传於世道，说之者则三天刺奸，上闻帝君，告子之罪，以为宣漏之愆盟也。 将未三年，太上使五帝神兵罚子身矣，死为下鬼，七祖父母，同考水官。 凡受《太上黄素四十四方经》，师及弟子各斋四十五日，不交人事，先启告神明，审可付者然后盟传。 盟用玉札一枚，长一尺五分，广一寸四分，以四极上真之盟。 又用黄素四十尺，金镮两双，以代歃血敢宣之约。 若受经之后，犯约愆盟，传非其人，罪同於上记，见罚於神兵也。 兆慎之哉。 太上道君命太极真人、侍宸上宰，共撰《黄素神经四十四方》如左： 凡读《大洞真经三十九章》，能通释微音，谈无畅玄，穷究幽深，摅赞灵章，弘音震响，妙理旁通，隐诵寂室，琅然无滞。 若此人者，皆上仙之才也。 然读此之经，故能提携太上，摄命九真，高仙同品，司命齐备。 依《太上黄素四十四方》，便得称为大洞法师。 大洞法师，真称无族，监虚领玄，通神接微，光生万真，位准太极上仙。 此谓精研密感，非万徧之限也。 若但有此经，不学之者，又不隐诵，亦得为太上主者之任，及为鬼神之师君也。 凡读《太丹隐书金华洞房》，及《雌一宝章》者，能浪味玄真，领理洞经，幽悟冥涂，逸浪虚庭，触类无滞，希真笃诚，陈闻寂室，密愿通灵者，其人或精感太素，陟降九真，五神混合，司命录篇。 依《太上黄素四十四方》，便得称为三洞法师及元景真人。 元景真人，位准帝一高仙。 帝一高仙监虚上无，为总神之上真也。 若子但有此经，未能研感者，亦自得为三元主者，及受地上陆仙之任矣。 凡读《太丹隐书洞真玄经》，及帝一解结哺养百神之事者，能精研密感，通玄达灵，回精玄元，开散七经，理幽琮滞，味景霄清，其人玄简帝牖，图景三元，精彻神明，感会龟山。 依《太上黄素四十四方》，便得自称为玄洞法师上景真人。 上景真人，位准九宫上仙大夫。 如此之经，故能大混帝一，领括五神，九灵侍宰，三官司臣矣。 若未能研修其事者，亦自得为三天主者，地司之上任矣。 凡能精进三经，说解奇文，萧浪上契，耽味玄远者，其人皆必琼书秀简，金籍玉名。",
      "translated_text": "**The Supreme Clarity Highest Yellow Plain Forty-Four Methods Scripture**\n\n**Scripture Title:** *The Supreme Clarity Highest Yellow Plain Forty-Four Methods Scripture*. Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. One scroll. Base text from: *The Orthodox Daoist Canon*, Section Zheng, Part One.\n\n---\n\n**The Supreme Clarity Highest Yellow Plain Forty-Four Methods Scripture**\n\nThe Most High Great Dao Lord, Mysterious Numinous and Transcendent, governs the transformations above, harmonizing the thousand Perfected, paying homage to the ten directions. Thereupon, he summoned the Eight Emperors, concealed his march in the morning waves, beheaded the Six Heavens, and rightly established the Three Ways. His awe-inspiring might shook the heavens, his radiance streaming across ten thousand peaks.\n\nThus, he commanded the Perfected of the Great Ultimate and the Four Directors of the High Ministers, who served the Jade Dawn, to reveal the lofty chapters of the Vermilion Plain and eradicate the teachings of the Cold Numinous. Thereupon, they opened the Supreme Way of the Eight Assemblies, systematizing the essential principles of divine transcendents. In all, forty-four methods were compiled into a single work, collectively titled *The Yellow Plain Scripture*. It was sealed in a casket of cinnabar blossoms, encased in a brocade pouch of mysterious numen, and entrusted to the Left Duke of the Immortal Capital, concealed within the Chamber of the Seven Radiant Gems.\n\nFurthermore, he commanded thirty-seven Jade Maidens of the Northern Cold to constantly guard the bodies of those who possessed this scripture. According to the *Luminous Statutes of the Four Poles*, within seven hundred years, it was to be transmitted to only three individuals.\n\n*The Supreme Highest Yellow Plain Forty-Four Methods* are all celestial writings from above the Nine Heavens, hidden texts of the Eight Assemblies. Therefore, the Most High Dao Lord commanded the High Transcendents of Supreme Clarity and the Perfected of the Great Ultimate to systematize and arrange their contents, compiling them into forty-four divine methods of the *Yellow Plain*. These were established collectively after the rectification of the Six Heavens. These chapters all derive from the commands of the Most High Sages and were inscribed by the brush of the High Ministers. Thus, the Dao is perfected in the Great Perfected, surpassing all other works in subtlety. They are called the *Orthodox Dharma of the Three Heavens*, which overawes the malevolent *qi* of the Six Heavens and eradicates the inauspiciousness of a thousand demons.\n\nThose with predestined affinity who are fated to behold this text are surely opened by the mysterious and transcendent, and must possess the destined portion of divine transcendents. This divine scripture is not transmitted in the worldly realm. Whoever divulges it will be punished by the Three Heavens for treachery, reported to the Imperial Lord, and their transgression of disclosure will be accounted a breach of covenant. Within three years, the Most High will dispatch the divine soldiers of the Five Emperors to punish their person. They will die as lowly ghosts, and their seven generations of ancestors will together be examined by the Water Officials.\n\nAll who receive *The Supreme Highest Yellow Plain Forty-Four Methods Scripture*—both master and disciple—must observe a retreat of forty-five days, abstaining from worldly affairs. They must first invoke the divine luminaries and, only after careful consideration, transmit it under covenant. The covenant employs a jade tablet, one foot and five *fen* in length, one *cun* and four *fen* in width, to invoke the covenant of the Perfected of the Four Poles. Additionally, forty feet of yellow plain silk and two pairs of golden rings are used in place of the blood-oath of solemn proclamation. If, after receiving the scripture, one violates the covenant, transmits it to the unworthy, the punishment is as recorded above, and they will be penalized by divine soldiers. Be cautious!\n\nThe Most High Dao Lord commanded the Perfected of the Great Ultimate and the High Ministers in attendance to compile *The Yellow Plain Divine Scripture: Forty-Four Methods* as follows:\n\n---\n\nAll who read *The Thirty-Nine Chapters of the Great Cavern Perfected Scripture*, who can comprehend its subtle sounds, discourse without hindrance on the profound, exhaustively investigate its mysteries, expound and praise its numinous chapters, whose resonant voices shake the heavens, whose subtle principles penetrate all, and who recite it in secluded chambers with crystalline clarity and no obstruction—such persons possess the talent of High Transcendents. Only those who read this scripture can ascend to the presence of the Most High, summon the Nine Perfected, share rank with High Transcendents, and hold office as Directors of Destinies. According to *The Supreme Highest Yellow Plain Forty-Four Methods*, they may be called *Dadong* (Great Cavern) Dharma Masters.\n\nThe *Dadong* Dharma Masters are truly without peer, overseeing the void and presiding over the mysterious, communicating with spirits and connecting with the subtle. Their radiance gives life to the myriad Perfected, and their rank corresponds to the High Transcendents of the Great Ultimate. This is called \"refined study and mysterious resonance,\" not limited to ten thousand recitations. Even if one merely possesses this scripture without studying or reciting it, they may still serve as a Master of the Most High and a Teacher-Lord of ghosts and spirits.\n\n---\n\nAll who read *The Great Vermilion Hidden Book of the Golden Flower Cavern Chamber* and *The Feminine One’s Treasured Chapters*, who can savor the mysterious and true, grasp the principles of the Cavern Scriptures, awaken to the obscure and profound, wander freely in the void, encounter all without obstruction, aspire to the Perfected with sincerity, and silently vow in secluded chambers to communicate with the numinous—such persons may, through their refined resonance with the Great Plain, ascend and descend with the Nine Perfected, harmonize the Five Spirits, and have their names recorded by the Directors of Destinies. According to *The Supreme Highest Yellow Plain Forty-Four Methods*, they may be called *Sandong* (Three Caverns) Dharma Masters and Perfected of the Primordial Radiance.\n\nThe Perfected of the Primordial Radiance hold rank corresponding to the High Transcendents of the Imperial Unity. The High Transcendents of the Imperial Unity oversee the void above the void and are the supreme Perfected among all spirits. Even if one merely possesses this scripture without being able to study and resonate with it, they may still serve as a Master of the Three Origins and hold the office of a terrestrial transcendent.\n\n---\n\nAll who read *The Great Vermilion Hidden Book of the Cavern Perfected Mysterious Scripture* and the affairs of the Imperial Unity’s dissolution of knots and nurturing of the hundred spirits, who can refine their study to achieve mysterious resonance, penetrate the profound and reach the numinous, return their essence to the mysterious origin, disperse the seven scriptures, govern the obscure and unblock the stagnant, and savor the radiance of the celestial clarity—such persons are chosen by the mysterious and inscribed in the imperial register, their radiance mapped in the Three Origins. Their essence penetrates the divine luminaries, and they resonate with the Turtle Mountain. According to *The Supreme Highest Yellow Plain Forty-Four Methods*, they may call themselves *Xuandong* (Mysterious Cavern) Dharma Masters and High Radiance Perfected.\n\nThe High Radiance Perfected hold rank corresponding to the High Transcendents of the Nine Palaces. Such scriptures enable one to greatly harmonize with the Imperial Unity, encompass the Five Spirits, have the Nine Numinous attend as ministers, and serve as officials of the Three Bureaus. Even if one has not yet cultivated these practices, they may still serve as Masters of the Three Heavens and hold office above the terrestrial administrators.\n\n---\n\nAll who can diligently advance in the Three Scriptures, expound and comprehend their marvelous texts, resonate with the lofty and remote, and immerse themselves in the profound and distant—such persons are surely inscribed in jade registers and inscribed with golden and jade names.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1265,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.289207220077515,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上黄素四十四方经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "或受书之始，见授灵人因缘，或遇会此总，忽而得之。 得此之经，皆太极试观，察子诚向，品会高下，故已陈於未授之前矣，不必尽崇盟师，为歃血之约也。 依《太上黄素四十四方》，便得自称为总神法司上景先生，及九玄大夫之号。 若动会上感，琼音密响，万徧既周，雌雄亦混，即便乘云驾龙，白日腾虚，上登三清，得为太极公卿，及高仙之上任矣。 凡得太上龙书太真道经，及玉清隐文玄羽之章，能通微释玄，判疑喻幽，傍赞妙理，触类万成，放志晨霄，仰味遐清者，其人必有金书玉箓，琼简帝室，玄真郁浪，清虚淑穆，若此才者，皆必上仙也。 依《太上黄素四十四方》，便得为三天法师太上真人。 太上真人，位准太极仙卿。 若但有此经，则三官奉侍，四明司臣，万向皆合，试观不陈，役鬼通灵，必获地真也。 凡精试密向，耽味玄真，清斋若至，感慕神仙，忽自遇此三品之经，而不师受者，其人皆玄会宿感，列籍帝乡真人。 有密授应得此经，其人异挺以标世功。 依《太上黄素四十四方》，听得隐盟玄誓神科也。 当以甲子之日，清斋入室，夜半生炁之时，眠坐任意，临目仿髴，叩齿二十四通，心拜四方，毕，微咒曰： 太上九灵，三素元精，仙都大神，四极三清，昔奉法化，遇会上经，玄师冥远，靡览真形，乞丐隐盟，誓以神明，玉童侍卫，玉华扶生，八愿九合，妙慧通灵，愿神愿仙，飞行玉清。 咒毕，又叩齿二十四通，咽液十过，心拜经前，因此而寝，亦可起坐诵经，必有吉感。 常能行之，三年之中，得为经师，成其真人大夫之任矣。 此是黄素内法，不烦复经营师，及唼血之盟也。 真人虽已受经，亦常行之。 凡受大洞三经法，当隐静别室，不杂俗人，并净写一通，以为机上之书。 常当奉以烧香，又别施东面一床，以安机也。 兆礼愿之时，皆对席行事，其可诵读之经，不得参於机上也。 凡为道士，受三品真经，雌一洞玄隐玄羽章，当勤慕上契，感会神明，精心斋浄，专道固生，孜孜不替，味景玄清。 若此人者，必获上仙，依《太上黄素四十四方》，得行八朝三朝内礼隐法。 当以甲寅、戊申、庚申、丁巳、己巳、癸亥、乙亥之日，平旦入室，烧香左右，临目仿髴，叩齿二十四通，心拜四方，微咒曰： 太上太灵，三素元精，谨以吉日，内朝真经，神童玉女，散香虚庭，使我神仙，天地相倾。 咒毕，疾闭两目，使内外冥合，不相闻见。 又叩齿三十通，咽液三过，开目，都毕也。 此名为八朝三元内礼隐法。 常能行之，令人通灵彻视，精应三元，真会妙感，陟降太玄，侍经玉女，奏子求生，神仙不死，天地相倾。 诸未受经者，行之三年，得为经师，灵瑞吉祥。 凡修受大洞真经、雌一奇文者，皆当别寝一室，不交人物，常置经於机格洁净之处，旦夕烧香礼拜，陈愿人间，内除罪籍。 常以月三日、七日、二十一日，侍经玉女乃奏人罪过於三元，与太一帝君共详子之云为也。 是其日也，当入室烧香，叩齿三七通，微咒曰： 太上神方，大洞真经，昔以有幸，适遇神明，启荫七图，受会三清，若有荫罪，帝君散灵，三象开明，上帝合形，令我飞仙，神真长生。 咒毕，又叩齿二七通，心拜四方，开目，都毕。",
      "translated_text": "Some receive these scriptures at the very outset, granted through karmic bonds with numinous beings, while others encounter them in their entirety and suddenly obtain them. Those who receive these scriptures have all been tested by the Great Ultimate, their sincerity and devotion examined, their ranks and capacities assessed—this having already been declared prior to transmission. It is not necessary to revere an oath-bound master or enter into blood-sealed covenants.\n\nAccording to the *Supreme Yellow Register of the Forty-Four Directions*, one may then style oneself as a Master of the Numinous Bureau and High Radiance Perfected, bearing the title of the Ninefold Transcendent Grandee. If one’s resonance ascends to evoke response, jade tones echo in secret harmony, myriad cycles complete, and yin and yang merge, one may then ride clouds and mount dragons, ascending in broad daylight to the void, entering the Three Clarities to become a Minister of the Great Ultimate and assume office above the High Transcendents.\n\nAll who obtain the Supreme Dragon Scriptures of the Great Perfection Dao, or the Jade Clarity’s Hidden Writings of the Mystic Plumage, and can penetrate the subtle, resolve the obscure, elucidate the marvelous, and by analogy bring forth myriad accomplishments—those who set their aspirations toward the morning clouds and savor the distant purity—such persons are surely inscribed in golden registers and jade tablets, their names recorded in the imperial chambers, their perfected beings steeped in dark radiance, their clarity and emptiness refined and serene. Such talents are all destined to become High Transcendents.\n\nAccording to the *Supreme Yellow Register of the Forty-Four Directions*, one may then be called a Master of the Three Heavens and Supreme Perfected. The Supreme Perfected hold rank corresponding to the Ministers of the Great Ultimate Transcendents. Even if one merely possesses these scriptures, the Three Bureaus will attend as servants, the Four Luminaries will serve as ministers, all directions will align, and though no trial be declared, one may command spirits and commune with the numinous, assuredly attaining the terrestrial perfected.\n\nAll who diligently test their secret devotion, immerse themselves in the profound and true, purify themselves through fasting to the utmost, and yearn for the divine immortals—those who suddenly encounter these Three Grades of Scriptures without a master’s transmission—such persons are surely those whose karmic bonds with the mysterious have long been destined, their names already listed among the Perfected of the Imperial Homeland. Those who receive these scriptures in secret transmission are marked by extraordinary distinction to manifest worldly merit.\n\nAccording to the *Supreme Yellow Register of the Forty-Four Directions*, one may then undertake the hidden covenant of the numinous oath. On a *jiazi* day, enter a purified chamber in fasting, and at midnight when generative *qi* arises, recline or sit as one wishes. Close the eyes in faint semblance, knock the teeth twenty-four times, and mentally bow to the four directions. When finished, softly recite the incantation:\n\n*\"Supreme Nine Numinous, Three Pristine Primordial Essences,\nDivine Lords of the Immortal Capital, Three Clarities of the Four Poles,\nOnce I received the transforming Dharma and encountered the supreme scriptures,\nYet the mysterious masters are distant and unseen in form.\nI beseech the hidden covenant, swearing by the numinous and bright,\nWith jade lads attending in guard, jade blossoms sustaining life,\nEight vows and nine unions, wondrous wisdom penetrating the numinous,\nMay I vow for the divine, vow for immortality, and soar through the Jade Clarity.\"*\n\nWhen the incantation is complete, knock the teeth twenty-four times again, swallow saliva ten times, and mentally bow before the scriptures. Then one may sleep or rise to recite the scriptures, and auspicious responses will surely follow. By practicing this regularly, within three years one may become a Scripture Master and fulfill the office of Perfected Grandee. This is the inner method of the Yellow Register, requiring no further recourse to oath-bound masters or blood-sealed covenants. Even after receiving the scriptures, the Perfected should continue this practice.\n\nWhen receiving the Three Scripture Methods of the Great Cavern, one should retire to a secluded chamber, avoiding the company of the profane, and make a clean copy to place upon the scripture stand. One should always offer incense in reverence, and set aside a separate bed to the east for the stand. When performing rites or making vows, one should conduct them facing the stand. The scriptures that may be recited should not be placed upon the stand.\n\nAll Daoists who receive the Three Grades of Perfected Scriptures and the *Feminine One’s Mystic Plumage of the Hidden Cavern* should diligently yearn for the lofty and remote, resonate with the numinous and bright, purify the heart through fasting, and single-mindedly cultivate the Dao to secure life, unwavering in their devotion, savoring the mysterious clarity of the luminous. Such persons are assured of attaining High Transcendence. According to the *Supreme Yellow Register of the Forty-Four Directions*, one may then perform the Hidden Rites of the Eight Audiences and Three Audiences.\n\nOn the days of *jiayin*, *wushen*, *gengshen*, *dingsi*, *jisi*, *guihai*, or *yihai*, enter the chamber at dawn, burn incense to the left and right, close the eyes in faint semblance, knock the teeth twenty-four times, and mentally bow to the four directions. Then softly recite the incantation:\n\n*\"Supreme Supreme Numinous, Three Pristine Primordial Essences,\nReverently on this auspicious day, I present the inner audience to the Perfected Scriptures.\nDivine lads and jade maidens scatter incense in the empty courtyard,\nThat I may become a divine immortal, and heaven and earth incline toward me.\"*\n\nWhen the incantation is complete, swiftly close both eyes so that inner and outer darkness merge, with no mutual perception. Knock the teeth thirty times, swallow saliva three times, then open the eyes—the rite is complete. This is called the Hidden Rite of the Eight Audiences and Three Primordials. By practicing this regularly, one may attain numinous penetration and clear vision, resonate with the Three Primordials, unite with the marvelous and responsive, ascend and descend the Great Mystery, have jade maidens attend the scriptures, present one’s prayers for life, and become an immortal undying, with heaven and earth inclining toward one. Those who have not yet received the scriptures but practice this for three years may become Scripture Masters, blessed with numinous portents and auspicious signs.\n\nWhen cultivating and receiving the *Great Cavern Perfected Scriptures* and the *Feminine One’s Mystic Writings*, one should always sleep in a separate chamber, avoiding contact with others, and place the scriptures in a clean and purified stand. Morning and evening, burn incense, bow in reverence, and present vows to the world, thereby erasing the records of transgressions.\n\nOn the third, seventh, and twenty-first days of the month, the jade maidens attending the scriptures will report one’s transgressions to the Three Primordials, and together with the Supreme Unity Sovereign Lord, they will examine one’s conduct. On these days, enter the chamber, burn incense, knock the teeth twenty-one times, and softly recite the incantation:\n\n*\"Supreme Numinous Directions, Great Cavern Perfected Scriptures,\nOnce by good fortune I encountered the numinous and bright,\nUnfolded the seven charts of protection, received the audience of the Three Clarities.\nIf there be transgressions to shield, may the Sovereign Lord disperse the numinous,\nThe Three Images open in clarity, the Supreme Emperor unite in form,\nThat I may become a flying immortal, my divine perfection enduring forever.\"*\n\nWhen the incantation is complete, knock the teeth fourteen times, mentally bow to the four directions, then open the eyes—the rite is complete.",
      "overlap_context": "isters, and serve as officials of the Three Bureaus. Even if one has not yet cultivated these practices, they may still serve as Masters of the Three Heavens and hold office above the terrestrial administrators.\n\n---\n\nAll who can diligently advance in the Three Scriptures, expound and comprehend their marvelous texts, resonate with the lofty and remote, and immerse themselves in the profound and distant—such persons are surely inscribed in jade registers and inscribed with golden and jade names.",
      "start_char": 1265,
      "end_char": 2493,
      "start_sentence": 43,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.570234060287476,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上黄素四十四方经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "常当行之者，则三元密感，帝君赦过，诸有奏之罪者，皆不见用也。 凡道士存思上法，及修学太一之事，皆禁见死户血秽之物。 若兆见之者，听得三光隐谢解秽内法。 当以真朱一铢，散内水中，因以洗目漱口，并洗手足毕，入室正寝，交手心上，叩齿二七通，心拜四方，乃微咒曰： 三元上道，太一护形，司命公子，五神黄宁，血尸散灭，凶秽沈零，七液缠注，五藏华生，令我神仙，长享利贞。 咒毕，因疾闭两眼，并炁自使，内外冥合，不相闻见。 良久，觉身中小热，为候竟。 又叩齿七下，咽液三过，都毕。 此谓三光隐谢解秽之内法也。 凡道士修受上法，欲有所看省，诵读经文，发箧之时，皆当烧香左右，心拜经前，啄齿三通，乃微咒曰： 玉帝上法，上闻三清，吉日斋诚，敢开神经，万试隐伏，所向皆成，玉童侍护，玉华散馨，上告三元，与我长生。 咒毕，开经，然后乃得诵读之。 此名为大帝开经之法。 令玉女玉童侍守烧香，启降神灵，上闻九天。 凡道士受学洞经，修行太一之事，不得宣泄太一帝君之名字，以语不同志之人。 泄则犯太玄阴考，兆三犯之者，则五神废宅，不得复为仙矣。 过三以往，死为下鬼，已无仙冀。 凡道士受经以后，常晨夕存咒太一帝君之名字，先叩齿三通，乃微咒曰： 凌梵履昌，七灵丈人，太一务猷，五神黄宁，上升九天，与帝同并，乞愿飞仙，七祖胎婴，解愆释罪，上登玉清。 咒毕，又啄齿七通，咽掖三过，此为存神释罪，请帝求仙也。 行之七年，则神明感会，帝君喜欢，玄母注生，五神常存，七祖罪释，受胎南仙，长生不死，白日升晨。 凡道士受学生法，不得称及死事。 称及死事者，则生炁变动，不居於帝，故死炁运入，生神离弃，是以恶炁游尸，陈其间孔矣。 将病将死之渐也。 夫受太一存五神，修九宫混帝君者，慎不得有所圭怒，及愿己之死也。 受经已后，言满四十者，皆不得复为真人，侍经玉童玉女，奏子於帝君，以为奔生之罪。 兆必见考於玄虚，受责於太上，将未三年，身必亡失。 此黄素之科，太玄之法用。 凡修受上法，及行雌一，太一之事，兆所有经文，皆当烧香礼咒，以奉神明，不得身犯洿慢，并妄说经法，以语不同志之人。 有此愆者，则侍经玉童玉女记子之过，上白帝君。 说语一人，则损一玉童、一玉女，以还於三素之房。 过语三人，则玉童玉女都去子矣。 或遭水火之灾，忽自失经，或不觉而去。 若传非其人，则三天司命罚子之身，死为下鬼，长役水官。 此玉帝之科表也。 凡修太一之事，及行上法存神之道，慎不可见尸及血秽之物。 见一死尸，则一年不得行事，有却倾一年之功，然此帝一之科，科常却罚於既往，又进塞於将来。 若一年之见尸者，则罚功断事各三年也。 若遇见二十四尸者，皆不得复修太一求仙也。 凡修受上法，及雌一、太一之事者，兆身中三魂五神之炁，常熏於巾服之中，七魄九灵余精，常栖於履屐之下。 是以道士学生，不杂席而寝，故衣褐之服，不借非己之炁，履屐之物常恶土秽之熏，亦不欲使杂人犯触诸物，以惊三魂。 凡道士吐纳和炁，存神服霞，修求长生之道，慎不可食五熏之菜，及为酒色之病败也。 是故古之神人云：五熏为伐藏之斧斤，酒色为丧身之棺椁。",
      "translated_text": "Those who regularly practice this will experience the esoteric resonance of the Three Origins, and the Sovereign Lord will pardon their transgressions. Any sins reported against them will be disregarded. Whenever Daoist practitioners engage in the visualization of superior methods or cultivate the affairs of the Supreme Unity, they must avoid encountering corpses, blood, or defilements. Should one inadvertently witness such things, they may perform the esoteric rite of the Three Luminaries’ Concealment to dissolve the impurity.\n\nTake one *zhū* of true cinnabar, scatter it into water, and use it to wash the eyes, rinse the mouth, and cleanse the hands and feet. Then, enter the chamber and settle into repose. Cross the hands over the heart, knock the teeth fourteen times, and mentally bow to the four directions. Softly recite the incantation:\n\n*\"Supreme Dao of the Three Origins, Supreme Unity guards my form,\nThe Lord of Life’s Attendants, the Five Spirits of Yellow Tranquility,\nBlood-corpses disperse and vanish, inauspicious defilements sink and fade,\nSeven fluids coil and infuse, the five viscera flourish anew,\nThat I may become a divine immortal, ever enjoying fortune and purity.\"*\n\nWhen the incantation is complete, swiftly close both eyes and gather the *qi*, uniting inner and outer in darkness so that neither hears nor sees the other. After a while, when a slight warmth is felt within the body, the sign is complete. Then knock the teeth seven times, swallow saliva three times, and the rite is finished. This is the esoteric method of the Three Luminaries’ Concealment for dissolving defilement.\n\nWhenever Daoist practitioners cultivate superior methods and wish to examine, recite, or read scriptures, they must burn incense on both sides when opening the case. Mentally bow before the scripture, knock the teeth three times, and softly recite the incantation:\n\n*\"Supreme Method of the Jade Emperor, ascending to the Three Clarities,\nOn this auspicious day of fasting and sincerity, I dare to open the divine scripture,\nTen thousand trials concealed, all endeavors shall succeed,\nJade lads attend and guard, jade blossoms scatter fragrance,\nI report above to the Three Origins, that I may attain long life.\"*\n\nWhen the incantation is complete, open the scripture and only then may one recite and read it. This is called the Great Emperor’s Method for Opening Scriptures. It commands jade maidens and jade lads to attend, burn incense, and summon the descent of numinous spirits, ascending to the Nine Heavens.\n\nWhenever Daoist practitioners receive and study Cavern Scriptures or cultivate the affairs of the Supreme Unity, they must not reveal the name of the Supreme Unity Sovereign Lord to those of differing aspirations. To disclose it is to violate the Dark Mystery’s Yin Punishment. Should one transgress thrice, the Five Spirits will abandon their abode, and one will no longer become an immortal. Beyond three transgressions, one dies as a lowly ghost, with no hope of immortality.\n\nAfter receiving scriptures, Daoist practitioners should, morning and evening, visualize and recite the name of the Supreme Unity Sovereign Lord. First knock the teeth three times, then softly recite the incantation:\n\n*\"Ascending Brahma, treading prosperity, the Sevenfold Numinous Venerable,\nSupreme Unity’s sagely plans, Five Spirits of Yellow Tranquility,\nAscend to the Nine Heavens, stand alongside the Emperor,\nI beseech to become a flying immortal, my seven ancestors as womb-infants,\nDissolve transgressions and release sins, ascend to the Jade Clarity.\"*\n\nWhen the incantation is complete, knock the teeth seven times and swallow saliva three times. This is the method of visualizing the spirit, releasing sins, and petitioning the Emperor for immortality. Practicing this for seven years will evoke the resonance of numinous spirits, delight the Sovereign Lord, and prompt the Mysterious Mother to record one’s life. The Five Spirits will abide constantly, the sins of the seven ancestors will be absolved, and they will be reborn as Southern Immortals. One will attain eternal life, ascending in broad daylight to the morning heavens.\n\nDaoist practitioners receiving and studying the methods must not speak of matters concerning death. To mention such things disturbs the *qi* of life, preventing it from residing with the Emperor. Thus, the *qi* of death circulates within, the spirit of life departs, and malevolent *qi* roams the corpse, filling its orifices—this is the gradual onset of illness and death.\n\nThose who receive the Supreme Unity’s visualization of the Five Spirits and cultivate the Nine Palaces’ Fusion with the Sovereign Lord must take care never to harbor anger or wish for their own death. After receiving scriptures, if one’s speech reaches forty instances of such transgressions, they will no longer be deemed a Perfected One. The jade lads and maidens attending the scriptures will report them to the Sovereign Lord as the sin of a fleeing life. The practitioner will surely be examined by the Dark Void and reprimanded by the Supreme Highest. Within three years, their body will perish. These are the statutes of the Yellow Simplicity and the methods of the Supreme Mystery.\n\nWhenever cultivating superior methods or practicing the Feminine Unity or Supreme Unity’s affairs, all scriptures one possesses must be honored with incense, ritual, and incantations to serve the numinous spirits. One must not personally violate them with defilement or negligence, nor recklessly discuss scriptural methods with those of differing aspirations. Those who commit such transgressions will have their faults recorded by the jade lads and maidens attending the scriptures, who will report them to the Sovereign Lord. For each person told, one jade lad and one jade maiden will be lost, returning to the Three Simplicities’ chambers. If three people are told, the jade lads and maidens will all depart. One may then suffer disasters of water or fire, suddenly lose their scriptures, or have them vanish unawares. If transmitted to the unworthy, the Three Heavens’ Life Controllers will punish the transgressor’s body, and they will die as lowly ghosts, eternally serving the Water Officials. These are the statutes and ordinances of the Jade Emperor.\n\nWhenever cultivating the affairs of the Supreme Unity or practicing superior methods of spirit visualization, one must take care never to see corpses or defiled objects. Seeing one corpse results in a year’s inability to practice, nullifying a year’s progress. This is the statute of the Supreme Unity, which both retroactively punishes past transgressions and obstructs future advancement. For one corpse seen in a year, the punishment is three years of severed progress and interrupted practice. If one encounters twenty-four corpses, they will no longer be able to cultivate the Supreme Unity or seek immortality.\n\nThose who cultivate superior methods, the Feminine Unity, or the Supreme Unity’s affairs must ensure that the *qi* of the Three Hun and Five Spirits within their body constantly suffuses their headscarves and garments, while the seven *po*, nine numinous spirits, and residual essence always dwell beneath their shoes. Thus, Daoist students must not sleep on shared mats. Their hempen garments must not borrow the *qi* of others, and their shoes must not be tainted by defiled earth or allow others to touch them, lest the Three Hun be startled.\n\nWhenever Daoist practitioners practice *qi*-absorption, spirit visualization, cloud-swallowing, or seek the Dao of long life, they must never consume the five pungent vegetables or succumb to the maladies of wine and lust. Thus, the divine persons of antiquity said: *\"The five pungent vegetables are the axes that hew the viscera; wine and lust are the coffins that bury the body.\"*",
      "overlap_context": " encountered the numinous and bright,\nUnfolded the seven charts of protection, received the audience of the Three Clarities.\nIf there be transgressions to shield, may the Sovereign Lord disperse the numinous,\nThe Three Images open in clarity, the Supreme Emperor unite in form,\nThat I may become a flying immortal, my divine perfection enduring forever.\"*\n\nWhen the incantation is complete, knock the teeth fourteen times, mentally bow to the four directions, then open the eyes—the rite is complete.",
      "start_char": 2493,
      "end_char": 3750,
      "start_sentence": 77,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.342169761657715,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上黄素四十四方经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "夫能断斤斧之所伤，塞棺椁之死宅者，然后可以涉生生之涂径，灭神仙之蹊路矣。 凡欲求畏恐，常呜天钟於左齿二十六通才先闭炁，左嘘之叱叱五通，常辟精邪恶物不祥之炁。 常夜寝临欲眠时，以手抚心三通，闭目微咒曰： 太灵九宫，太一守房，百神参位，魂魄和同，长生不死，塞减邪凶。 祝毕而寝，此名为九宫隐咒寝魂之法。 常能行之，使人魂魄安宁，常保吉祥。 凡传授上法之时，有经之师当先求感应，然后传之。 当入室烧香，密愿神明，乃心拜经前，微咒曰： 太上元君，仙都大神，今日吉日，八愿开陈，欲传某上法，敢告灵元，未知可否，须应乃宣。 咒毕，便寝，必获灵应。 子自知其善否之心，审可授之方。 凡经师授经之法，先心拜四方，以感神明，为宗师之主，余乃执经起立，仰天而咒，告誓神灵，以为玄科之约，当说受经者之姓名，并启大神，陈受经之品目，为之科条，铭策告誓，合丽文传讳而陈之。 咒毕，弟子再拜，跪受毕，又再拜。 此真人告神之盟内法，不必尽存割血，为敢漏之约也。 凡经师传授之时，皆当依如上法，清斋别处，不交人事，启告神明、求诸密感，尔乃传之。 若真应横错，所感非祥者，此皆天灵显根，不使传也。 若弟子不顺神明，违而传之，依黄素之科，受子冥考，七祖魂魄，长闭地狱，身亦将亡，仙安所冀。 凡存修太一之事，欲有所礼愿，慎不可叩头。 兆叩头者，则倾九天，动千真，神宫回覆，泥丸倒悬，天帝号於上府，太一泣於中田。 数如此者，则存念无益，三真弃宫，七神漂散，玄宅纳凶，是为太上五神之至忌也。 故古之真人，但心存叩头，运精感而行事，不因颊颗以祈灵也。 凡修行太一之道，真人道士不得有所礼拜，亦帝君五神之所忌也。 若有所精思，行礼愿之时，但心拜而已，不形屈也。 自不修受上法者，不得同於外学之夫矣。 凡道士登斋入室，忽有灵感妙应，当有吉祥之梦者，皆道之欲成。 兆当勤修若至，感莫上会，如是不替，则真灵玉女，将憩子之寝矣。 卧觉之时，当正身上向，叩齿三七通，闭目微咒曰： 上一赤子，丹皇运珠，太一帝尊，凝天伯无，七灵上感，五神归游，灵童玉女，豁落双符，七星同升，上登晨丘。 祝毕，又叩齿三七通，咽液三过，开目，都毕。 此名为太一留神，感会仙贤之咒也。 如此者三年，则九天诸神及太玄玉女，将降卫於子。 凡道士入室斋诚，有存修，而数有不祥之物，及奇怪血光诸鬼精恶炁，来恐试人者，兆当行北帝祝鬼杀邪神方。 先叩齿三十六通，乃咒之曰： 二象回倾，玄一之旌，七灵护命，上诣三清，双皇驱除，赫栢罗兵，三十万人，侍卫神营，巨兽百文，吐威摄精，挥剑逐邪，馘落魔灵，神伯所咒，千祆灭形。 祝毕，又叩齿三十六通。 此名为北帝祝鬼杀邪神方，诸神灵正炁闻此之祝，皆来奉卫於子，而向不祥之炁，即得死灭。 凡道士独宿山林，而多为山精恶鬼所犯试者，当叩齿二七通，闭气咒曰： 吾昨被帝召，摄领真元，令我封掌此五岳，挥割酆山，山精万灵，受事俱会帝前，七神启引，三元司真，若有小妖，即时枭残，山精泽尉，速来奉迎，神师口命，上闻三清，一如大洞之法，咒毕，又叩齿二七下。",
      "translated_text": "Those who can sever the harm wrought by axes and seal the deathly abode of coffins may then tread the path of ceaseless life and erase the trails leading to divine transcendence. Whenever one seeks reverent awe, one must first strike the Celestial Bell upon the left teeth twenty-six times, then close the *qi* and hiss five times with a \"chih-chih\" sound to the left, thereby constantly repelling the *qi* of malevolent spirits, inauspicious entities, and foul things.\n\nWhen retiring at night, just before sleep, place the hand over the heart three times, close the eyes, and softly recite the incantation:\n*\"Great Numinous Nine Palaces, Great One guards the chamber,\nA hundred spirits attend their stations, hun and *po* harmonize as one,\nLife eternal, deathless, sealing away all inauspicious and baleful forces.\"*\nUpon completing the incantation, sleep—this is called the *Nine Palaces Hidden Incantation for Sleeping Spirits*. Practicing this regularly will pacify one’s hun and *po*, ensuring constant protection of auspiciousness.\n\nWhen transmitting the above method, the master possessing the scripture must first seek a spiritual response before imparting it. Entering the chamber to burn incense, one silently vows before the deities, then bows before the scripture and softly recites:\n*\"Supreme Primordial Lord, Great Divine of the Immortal Capital,\nOn this auspicious day, I open the Eight Vows to declare:\nI wish to transmit this superior method to [name],\nDare I inform the Numinous Origin—grant a sign if it may be proclaimed.\"*\nAfter the incantation, retire to sleep, and a divine response will surely be received. The disciple will then know in their heart whether it is fitting to receive the transmission.\n\nThe method for a scripture master to transmit teachings begins with bowing in the four directions to invoke the divine, establishing the ancestral master as the principal authority. Then, holding the scripture, one rises, faces heaven, and recites an incantation, swearing an oath before the divine spirits as a sacred covenant. One must state the name of the recipient, invoke the great deities, and declare the title of the scripture to be transmitted, setting forth its precepts and recording the vow in writing. After the incantation, the disciple bows twice, kneels to receive the scripture, and bows twice again. This is the inner method of the Perfected One’s divine covenant—it need not involve blood-oaths or risk betrayal.\n\nWhenever a scripture master transmits teachings, they must follow the above method: purify themselves in seclusion, avoid worldly affairs, invoke the divine, and seek a secret response before proceeding. If the signs are inauspicious or the response unfavorable, this indicates the celestial spirits are manifesting their will to prevent transmission. If a disciple disobeys the divine and receives the transmission regardless, according to the statutes of the *Yellow and White Scriptures*, they will face dark judgment, their seven generations of ancestors will be eternally confined to hell, their own body will perish, and transcendence will be beyond hope.\n\nIn matters of cultivating the Great One, when making vows or offerings, one must never kowtow. Those who kowtow overturn the Nine Heavens, disturb the Thousand Perfected, disrupt the divine palaces, and invert the Mud Pill Palace, causing the Heavenly Emperor to wail in the Upper Palace and the Great One to weep in the Central Field. Repeatedly doing so renders one’s meditative focus futile: the Three Perfected abandon their abodes, the Seven Spirits scatter, and the Mystic Dwelling invites misfortune—this is the greatest taboo of the Supreme Five Spirits. Thus, the Perfected Ones of antiquity merely stored the intention of kowtowing in their hearts, conducting affairs through refined focus and spiritual resonance, never relying on physical prostration to beseech the divine.\n\nIn practicing the Dao of the Great One, Perfected Ones and Daoist practitioners must not perform ritual bows, for this is also forbidden by the Lord Emperor and the Five Spirits. When engaging in focused contemplation and making vows, one should only bow in the heart, without physical prostration. Those who do not cultivate and receive the superior methods are no different from external scholars.\n\nWhen Daoist practitioners enter seclusion to fast and cultivate, should they suddenly experience wondrous spiritual responses or auspicious dreams, these are signs that the Dao is nearing fruition. The practitioner must diligently cultivate without ceasing, and the celestial convergence will naturally occur. If one persists without interruption, the Perfected Spirits and Jade Maidens will rest in one’s chamber. Upon waking, one should lie supine, face upward, click the teeth twenty-one times, close the eyes, and softly recite:\n*\"Supreme Red Child, Cinnabar Emperor revolves the Pearl,\nGreat One, Lord of the Imperial Honored, coalesces the Heavenly Count,\nSeven Numinous Ones ascend in response, Five Spirits return in wanderings,\nDivine Youth and Jade Maiden, resplendent paired talismans,\nSeven Stars ascend together, mounting the Dawn Mound.\"*\nAfter the incantation, click the teeth twenty-one more times, swallow saliva three times, then open the eyes—this is complete. This is called the *Incantation for the Great One to Retain the Spirit and Convene the Immortal Worthies*. Practicing this for three years will cause the deities of the Nine Heavens and the Jade Maidens of the Supreme Mystery to descend and guard you.\n\nWhen Daoist practitioners enter seclusion to fast and cultivate, if they frequently encounter inauspicious entities, strange apparitions, blood omens, demonic spirits, or foul *qi* attempting to frighten or test them, they should perform the *Northern Emperor’s Incantation to Slay Demons and Exorcise Malevolent Spirits*. First, click the teeth thirty-six times, then recite:\n*\"The Two Images invert, the banner of the Mystic One,\nSeven Spirits guard life, ascending to the Three Clarities,\nDual Emperors drive out, the mighty Cypress Legion,\nThree hundred thousand warriors, encamp to guard the divine,\nA hundred colossal beasts, spewing might to seize spirits,\nBrandishing swords to expel evil, beheading demonic spirits,\nWhat the Divine Earl incants, a thousand demons vanish in form.\"*\nAfter the incantation, click the teeth thirty-six more times. This is the *Northern Emperor’s Incantation to Slay Demons and Exorcise Malevolent Spirits*. When the divine spirits and upright *qi* hear this incantation, they will all come to protect you, and the inauspicious *qi* will be destroyed.\n\nWhen Daoist practitioners lodge alone in mountains and forests and are frequently harassed or tested by mountain spirits and malevolent ghosts, they should click their teeth fourteen times, hold their breath, and recite:\n*\"Yesterday I was summoned by the Emperor, entrusted with the true origin,\nCommanded to seal and govern these Five Peaks, to hew and divide Feng Mountain,\nAll mountain spirits and myriad numina, assemble before the Emperor to receive their duties,\nSeven Spirits initiate the procession, Three Origins administer the Perfected,\nIf any minor demons remain, execute them at once,\nMountain spirits and marsh wardens, hasten to receive my command,\nThe divine master’s oral decree, ascends to the Three Clarities,\nAll as in the Great Cavern’s method.\"*\nAfter the incantation, click the teeth fourteen more times.",
      "overlap_context": "and their shoes must not be tainted by defiled earth or allow others to touch them, lest the Three Hun be startled.\n\nWhenever Daoist practitioners practice *qi*-absorption, spirit visualization, cloud-swallowing, or seek the Dao of long life, they must never consume the five pungent vegetables or succumb to the maladies of wine and lust. Thus, the divine persons of antiquity said: *\"The five pungent vegetables are the axes that hew the viscera; wine and lust are the coffins that bury the body.\"*",
      "start_char": 3750,
      "end_char": 4996,
      "start_sentence": 120,
      "end_sentence": 157,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.885990619659424,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上黄素四十四方经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "此为帝君捕神咒伐山精百鬼之法，诸山神地祇、房祠正炁之神，闻此之咒，皆来执鞭奉迎，神兵侍卫，若与万人同宿矣。 凡道士隐迹山林，精思感灵，或读洞经，发响之时，多为北帝大魔试败於人。 兆每至昏夜，当叩齿三十六通，毕乃咒曰： 北帝大魔王，受事帝君前，泉曲之鬼，四明酆山，千祆混形，九首同身，神虎放毒，馘灭雷震，神公吐咒，所戮无亲，太微有命，摄录山川，呜铃交掷，流焕九天，风火征伐，神锋十陈，凶试伏灭，万精枭残，妖毒敢起，受闭三关，请依洞法，莫不如言。 咒毕，又叩齿三十六通。 此名为三天正法咒魔神方。 常能行之，则神兵侍卫，山川摄精，千祆受闭，万试不干。 凡修大洞法，及太一、帝一之事者，常至黄昏时，入室烧香，心拜经前，因叩齿二七通，乃微咒曰： 太一帝尊，帝一玄经，五云散景，郁彻三清，玉童玉女，烧香侍灵，上愿开陈，与我合形，使我神仙，长亨利贞。 咒毕，又叩齿二七通。 此名为帝一烧香，开陈上愿，与灵合形之道也。 常能尔者，则玉华侍卫，神灵辅真，散郁香云，上彻九天，将来三年，则玉女玉童都见於子矣。 凡道士入室斋诚之时，临食当以左手持着琢柈三过，乃微咒曰： 二玄上道，四极清泠，太一帝君，百神黄宁，受粮三宫，灌溉脾灵，上飨太和，餐味五馨，魂胎之命，七液流停，百关通和，五藏华明，双皇合景，飞行上清。 食毕，又琢柈三过。 此名为魂胎受馨，百神飨粮之道。 常能行之，令人神明炁和，魂魄安宁，辟恶除试，常保利贞。 凡道士理发将髻，及沐头将散发之时，先啄齿七通，乃微祝曰： 太帝散华，玄归大神，今日吉日，理发沐尘，辟恶除病，长生神仙。 咒毕，乃发髻毕，叩齿七通，都毕。 此名为太帝散华理发内法，令人终年不病，耳目聪明，头脑不痛。 凡道士入室烧香，有所修愿，皆先啄齿三通，乃微咒曰： 玉华散景，九炁合烟，香云密罗，径冲九天，侍香玉女，上闻帝前，令我长生，世为真仙，所向所愿，莫不如言。 咒毕，心拜精念，亦适意所陈矣。 此名为太常隐咒散香，九天降灵寝室，愿会神仙之方也。 凡道士行来独宿山林庙座之间，饶有魔精恶鬼之地，当先啄齿三十六通，闭炁，微咒曰： 太帝阳元，四维幽关，千祆万毒，敢当吾前，巨兽重吻，刳腹屠肝，神公使者，守卫营蕃，黄衣师兵，斩伐妖魂，馘灭千魔，摧落山奸，绝种灭类，取令枭残，玉帝上命，清荡三元。 咒毕，又叩齿三十六通。 此名为太常挥神内咒，塞灭万魔之法。 常能诵之，则神兵见卫，万鬼受事，千祆死伏。 凡道士临眠解衣之时，先啄齿三通，立而祝曰： 受命太帝，上升九宫，百神安位，列侍神公，魂魄和炼，五藏华丰，百醴玄注，七液虚充，火铃交焕，灭鬼除凶，上愿神仙，常生无穷。 祝毕，又叩齿三通，脱衣而卧。 此名为太帝寝神灭鬼凶之法。 令人精明不病，魂魄常存，数有吉感。 凡道士浴身及洗手面之时，先临水啄齿三通，乃微祝曰： 四大开玄，天地为常，玄水澡秽，辟除不祥，双皇守门，七灵安房，云津炼灌，万炁混康，内外利贞，保兹黄裳。 咒毕，又叩齿三通，乃洗沐手面。 此名为澡秽除凶七房祝法。 常能行之者，使人神明血净，解诸凶炁。",
      "translated_text": "Here the Perfected Lord’s method for capturing spirits and subduing mountain demons and the hundred ghosts. All mountain deities, earth numina, and the spirits of proper *qi* in dwellings and shrines—upon hearing this incantation—will come bearing whips to receive and escort, with divine soldiers standing guard, as though ten thousand men shared the same lodging.\n\nWhenever Daoists conceal their traces in mountains and forests, refine their thoughts to summon the numinous, or recite the Cavern Scriptures so that their voices resound, they are often tested and defeated by the Great Demon of the Northern Emperor. At each dusk and night, the adept should click their teeth thirty-six times, then recite:\n\n*\"Great Demon King of the Northern Emperor, who receives duties before the Perfected Lord,\nGhosts of the Yellow Springs’ bends, the Four Luminaries and Feng Mountain,\nA thousand demons blend their forms, nine heads share one body,\nDivine tigers release their venom, beheading and thunderous annihilation,\nThe Divine Duke utters the incantation, none spared in the slaughter,\nThe Supreme Subtlety issues its command, governing mountains and rivers,\nClashing bells are cast, radiance streaming through the Nine Heavens,\nWind and fire launch their assault, ten ranks of divine blades arrayed,\nMalevolent tests are subdued and extinguished, ten thousand spirits beheaded,\nIf any demonic poison dares arise, it is sealed within the Three Passes,\nFollow the Cavern’s method—none shall defy these words.\"*\n\nAfter the incantation, click the teeth thirty-six more times. This is called the **Three Heavens’ Orthodox Method for Incanting Demons and Spirits**. Those who practice it regularly will be attended by divine soldiers, the spirits of mountains and rivers will be subdued, a thousand demons will be sealed, and ten thousand trials will not disturb them.\n\nWhenever Daoists engage in the Great Cavern’s methods or the affairs of the Great One or Imperial One, at dusk they should enter their chamber, burn incense, and bow in reverence before the scriptures. Then, clicking their teeth fourteen times, they softly recite:\n\n*\"Supreme One, Imperial Honored One, Imperial One of the Mysterious Scripture,\nFive clouds scatter their radiance, dense and penetrating through the Three Clarities,\nJade lads and jade maidens burn incense and attend the numinous,\nI humbly present my wishes, that I may merge my form with the divine,\nGranting me immortality as a transcendent, ever prosperous and upright.\"*\n\nAfter the incantation, click the teeth fourteen more times. This is called **Burning Incense to the Imperial One, Presenting Wishes Above, and Merging with the Numinous**. Those who practice this regularly will be attended by jade effulgences, divine spirits will aid their perfection, fragrant clouds will scatter and ascend to the Nine Heavens. Within three years, jade maidens and jade lads will appear before them.\n\nWhenever Daoists enter their chamber to fast and cultivate sincerity, when about to eat, they should hold the chopsticks in their left hand and tap the plate three times, then softly recite:\n\n*\"Two Mysteries, Supreme Dao, Four Poles in pure clarity,\nSupreme One, Imperial Lord, the hundred spirits in yellow tranquility,\nReceive sustenance in the Three Palaces, irrigating the spirit of the spleen,\nOffering to the Great Harmony above, partaking of the five fragrances,\nThe life of the hun-soul and fetal spirit, the seven fluids flow and settle,\nA hundred passages harmonize, the five viscera flourish in radiance,\nThe Twin Sovereigns merge with the effulgence, soaring to ascend the Upper Clarity.\"*\n\nAfter eating, tap the plate three more times. This is called the **Method for the Hun-Soul and Fetal Spirit to Receive Fragrance and the Hundred Spirits to Partake of Sustenance**. Those who practice this regularly will find their spirit and *qi* harmonized, their hun and po at peace, evil and trials averted, and enduring prosperity and uprightness.\n\nWhenever Daoists arrange their hair into a topknot or wash their hair to let it down, they should first click their teeth seven times, then softly intone:\n\n*\"The Supreme Emperor scatters blossoms, the Mysterious returns to the Great Spirit,\nOn this auspicious day, I arrange my hair and wash away the dust,\nAverting evil and illness, attaining long life as a transcendent.\"*\n\nAfter the incantation, once the hair is arranged, click the teeth seven more times to conclude. This is called the **Supreme Emperor’s Method for Scattering Blossoms While Arranging Hair**. Those who practice it will remain free from illness throughout the year, their ears and eyes keen, their head and brain free from pain.\n\nWhenever Daoists enter their chamber to burn incense and make vows, they should first click their teeth three times, then softly recite:\n\n*\"Jade effulgences scatter their radiance, the nine *qi* merge with the mist,\nFragrant clouds densely woven, directly piercing the Nine Heavens,\nThe jade maiden attending the incense reports above to the Emperor,\nGranting me long life, that I may become a true transcendent in this world,\nWhatever I face or wish for, none shall defy these words.\"*\n\nAfter the incantation, bow in reverence and focus the mind, expressing whatever is in one’s heart. This is called the **Supreme Constancy’s Hidden Incantation for Scattering Incense, Inviting the Nine Heavens’ Numinous Presence into the Chamber, and the Method for Wishes to Meet with Transcendents**.\n\nWhenever Daoists travel alone and lodge in mountains, forests, or temple halls—places teeming with demonic spirits and malevolent ghosts—they should first click their teeth thirty-six times, hold their breath, and softly recite:\n\n*\"Supreme Emperor of Yang’s Origin, the Four Directions’ hidden passes,\nA thousand demons and ten thousand poisons dare not stand before me,\nGreat beasts with double jaws, disemboweling and dismembering livers,\nDivine lords and messengers guard and defend the encampment,\nYellow-robed master soldiers, slaying and beheading demonic souls,\nAnnihilating a thousand demons, crushing mountain traitors,\nEradicating their kind and lineage, beheading and exterminating them,\nThe Jade Emperor’s supreme command, purging the Three Origins.\"*\n\nAfter the incantation, click the teeth thirty-six more times. This is called the **Supreme Constancy’s Method for Wielding the Divine Inner Incantation to Seal and Annihilate Ten Thousand Demons**. Those who recite it regularly will find divine soldiers attending them, ten thousand ghosts submitting, and a thousand demons dead and subdued.\n\nWhenever Daoists prepare for sleep and remove their clothes, they should first click their teeth three times, stand, and intone:\n\n*\"Receiving the command of the Supreme Emperor, ascending to the Nine Palaces,\nA hundred spirits settle into their positions, arrayed to attend the Divine Duke,\nHun and po harmonize and refine, the five viscera flourish in radiance,\nA hundred elixirs mystically infuse, the seven fluids fill the void,\nCrossed fire and bells radiate, extinguishing ghosts and averting misfortune,\nI humbly wish for transcendence, eternal life without end.\"*\n\nAfter the intonation, click the teeth three more times, then remove the clothes and lie down. This is called the **Supreme Emperor’s Method for Sleeping Spirits and Annihilating Ghosts and Misfortune**. Those who practice it will remain clear in spirit and free from illness, their hun and po ever present, and receive many auspicious signs.\n\nWhenever Daoists bathe their bodies or wash their hands and face, they should first stand before the water, click their teeth three times, and softly intone:\n\n*\"The Four Great open the Mysterious, Heaven and Earth as constancy,\nMysterious water washes away filth, averting and dispelling inauspiciousness,\nThe Twin Sovereigns guard the gate, the Seven Numinous settle the chamber,\nCloudy essences refine and irrigate, ten thousand *qi* blend in harmony,\nInner and outer prosper and remain upright, preserving this yellow robe.\"*\n\nAfter the incantation, click the teeth three more times, then wash the hands and face. This is called the **Method for Washing Away Filth and Averting Misfortune, the Seven Chambers’ Incantation**. Those who practice it regularly will find their spirit bright and blood purified, all inauspicious *qi* dissolved.",
      "overlap_context": "ese Five Peaks, to hew and divide Feng Mountain,\nAll mountain spirits and myriad numina, assemble before the Emperor to receive their duties,\nSeven Spirits initiate the procession, Three Origins administer the Perfected,\nIf any minor demons remain, execute them at once,\nMountain spirits and marsh wardens, hasten to receive my command,\nThe divine master’s oral decree, ascends to the Three Clarities,\nAll as in the Great Cavern’s method.\"*\nAfter the incantation, click the teeth fourteen more times.",
      "start_char": 4996,
      "end_char": 6258,
      "start_sentence": 158,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.311134576797485,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上黄素四十四方经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "凡道士夜行之时，及有所畏恐心震之地，叩齿二七通，乃咒曰： 吾是小有真王，三天师君，昔受太上神方，杀邪之文，夜行游尸，七恶妖魂，九鬼共贼，千魔成群，赫栢图兵，巨兽罗千，挥割万祆，当我即残，龙烽七独，逐邪无间，玉帝神咒，挥剑东西，灭凶除邪，万鬼即悬，三天正法，皆如我言。 咒毕，又叩齿二七通。 此名为三天正法除六天之隐咒也。 鬼有被此祝者，皆目盲脚残，自然死灭矣。 凡行来有畏之处，但按如此，不必须夜行事也。 常能诵之，则万魔伏试，千祆灭形。 凡道士祝灭三尸之法，常以月晦朔之日，及甲寅、庚寅、庚申之日，兆身中七魄游尸、诸血尸之鬼，上天白人罪过，自还中伤於身，或游走他乡，名呼外鬼，协进为祆贼。 是以恶梦交於寝魂，痾告缠於神室。 人所以恶梦疾病者，皆七魄游尸之所为也。 至其日，常当沐俗洁服，烧香入室，精念上慕，不营他事。 以夜之生炁时，或黄昏之时，正寝东首，接手心上，先叩齿三七通，乃微咒曰： 七灵五神，八愿四陈，上告灵命，中皇双真，录魂炼魄，塞灭邪精，血鬼游尸，秽滞长泯，和我生关，闭我死门，若有冥命，听对帝前，使我长生，劫龄常存，太帝之法，敢告三元。 毕，又叩齿三七通，咽液十过，都毕。 此名为太帝制魂伐尸神咒之法也。 血尸七魄被此咒者，皆得灭於死尸之下，魂明魄柔，受化於三宫之中，辟恶除病，令人神明不死。 常能诵之，则终身不厌昧。 凡存念上道，咒除三尸之时，常当采处白芷草根，及青木香，合以东流水，煮取其汁，以沐浴於身，辟诸血尸恶气，亦常可和香烧之，以致神明。 若无青木香者，亦可单用白芷。 凡庚申、甲寅之日，是血鬼游尸直合之日。 此之日也，天炁交合，七魄竞乱，淫秽混真，邪精流焕，明法勤津，七神飙散。 每至其日，当清斋别处，不杂他席，慎不可与夫妻相见，及同床而寝。 又不可争竞财色，所行非道之方也。 每当烧香感气，修行之时，诵咒之法，亦可诵经混神。 若思洞房帝一之事，唯使精真以为意也。 凡道士忽得不祥之梦，或梦与人斗争，或相收录者，此亦七魄游尸之所为也。 或导将外鬼来入本宅，或三魂散翳，五神战勃，或被束缚不得来还，故使恶梦非祥，将有祸败之渐也。 卧觉之时，即正寝上向，接手心上，叩齿三七通，毕，微咒曰： 九天上帝，四门八灵，七房二玄，三素元精，太一桃康，上诣三清，请告帝君，摄命黄宁，速召七魄，校实神庭，若有不祥，七尸鬼兵，从呼双真，流烛炼形，太微大帝，斩伐邪精，三魂和柔，血尸流零，神归绝宅，触向利贞，使我神仙，长保劫龄。 咒毕，又啄齿二七通，咽液十过。 此名为太帝神祝辟梦除凶之法。 能行之者，则三魂和炼，七魄受制，神明炁正，尸秽散灭，而向所咒之鬼，即已受於地狱矣。 经三咒之后，自非灵感吉应，不复梦於非常矣。 凡道士礼愿神明，精思上法，行诸隐咒之时，皆当烧香心拜，密咒而已， 勿使得耳闻之也。 若欲咒伐六天，灭诸凶鬼者，乃可小发声耳，亦不得乃大高响，使傍人闻解之也。 若读诵之时，乃任意耳。 凡八节之日，皆三天仙灵，期宴礼会之日也。 兆修行礼愿，朝礼之时，皆当斋用此日，至於朔望朝礼，非上法也。",
      "translated_text": "When Daoists travel at night or find themselves in places that inspire fear and trembling, they should click their teeth twice seven times, then softly intone:\n\n*\"I am the True King of Lesser Existence, the Three Heavens’ Master Lords,\nOnce receiving the Supreme Shang’s divine formula, the scripture for slaying evil,\nNight-wandering corpse-spirits, seven malign specters,\nNine demons as thieves, a thousand fiends in swarms,\nThe mighty Hèbǎi Diagram’s troops, colossal beasts by the thousand,\nWielding blades to sever ten thousand perils—\nShould they face me, they shall be shattered,\nSeven Dragon Beacons pursue evil without pause,\nThe Jade Emperor’s divine incantation, sword swinging east and west,\nEradicating misfortune and expelling evil,\nTen thousand ghosts instantly suspended,\nThe Three Heavens’ Orthodox Dharma—all as I declare.\"*\n\nAfter the incantation, click the teeth twice seven times again.\nThis is called the **Three Heavens’ Orthodox Dharma, the Hidden Incantation for Dispelling the Six Heavens’ Concealments**.\nAny ghost subjected to this invocation will be struck blind and maimed, perishing of its own accord.\nWherever one travels in fear, simply follow this method—it need not be confined to night journeys.\nThose who recite it regularly will find ten thousand demons subdued and a thousand perils dissolved.\n\n---\n\nThe **Method for Daoists to Invoke and Eliminate the Three Corpses** is practiced on the last day of the lunar month, the first day of the new moon, and on the days of *jiǎyín*, *gēngyín*, and *gēngshēn*. On these occasions, the seven *pò*-spirits and wandering corpse-ghosts within the body, along with the various blood-corpses, ascend to heaven to report one’s transgressions. They then return to harm the body or wander into other regions, becoming so-called \"external ghosts\" that conspire to bring calamity.\nThus, evil dreams disturb the sleeping soul, and illnesses cling to the spirit-chamber.\nAll nightmares and ailments arise from the machinations of the seven *pò* and wandering corpses.\nOn these days, one should bathe, don clean robes, burn incense, enter the chamber, and focus the mind upward in reverence, avoiding all other distractions.\nAt the hour when *qi* first stirs in the night, or at dusk, lie facing east, place the hands over the heart, and first click the teeth three times seven. Then softly intone:\n\n*\"Seven Numinous, Five Spirits, Eight Vows, Four Declarations,\nI report to the Spirit-Mandate, the Central August’s Twin Perfected,\nRecord the hun-soul, refine the pò-spirit, seal and extinguish evil essences,\nBlood-ghosts and wandering corpses, lingering defilements—forever obliterated,\nHarmonize my gate of life, seal my gate of death,\nIf any dark mandate exists, let it be judged before the Emperor,\nGrant me long life, eternal kalpas preserved,\nBy the Great Emperor’s Dharma, I dare address the Three Origins.\"*\n\nAfterward, click the teeth three times seven again, swallow saliva ten times, and conclude.\nThis is called the **Great Emperor’s Method for Restraining the Hun-Soul and Vanquishing the Corpse-Spirit**.\nAny blood-corpses or seven *pò* subjected to this incantation will be destroyed beneath the dead corpse, their *hun* illuminated and *pò* softened, transformed within the Three Palaces.\nIt dispels evil, removes illness, and ensures the spirit remains bright and undying.\nThose who recite it regularly will never suffer from dullness or confusion.\n\n---\n\nWhen focusing the mind on the supreme Dao and invoking the expulsion of the Three Corpses, one should gather the roots of *bái zhǐ* and *qīng mù xiāng*, boil them in east-flowing water, and bathe the body to repel all blood-corpses and malign *qi*. These herbs may also be blended into incense and burned to summon divine clarity.\nIf *qīng mù xiāng* is unavailable, *bái zhǐ* alone may suffice.\n\n---\n\nOn the days of *gēngshēn* and *jiǎyín*, the blood-ghosts and wandering corpses align in their appointed cycles.\nOn these days, celestial *qi* intermingles, the seven *pò* vie in chaos, defilement obscures the true, and perverse essences surge.\nThrough diligent practice of the Dharma and the refinement of fluids, the seven spirits scatter like whirlwinds.\nOn such days, one must purify the body in seclusion, avoiding shared mats, and take care not to meet with spouse or share a bed.\nOne must also refrain from quarreling over wealth or lust, or engaging in unorthodox conduct.\nDuring incense-burning and *qi*-cultivation, the recitation of incantations may be accompanied by scripture-chanting to harmonize the spirit.\nIf contemplating the affairs of the Cavern Chamber’s Imperial Unity, one must ensure the essence remains pure and true.\n\n---\n\nWhen Daoists suddenly experience inauspicious dreams—such as dreaming of fighting with others or being seized—these too are the work of the seven *pò* and wandering corpses.\nThey may lead external ghosts into one’s home, scatter the three *hun*, incite strife among the five spirits, or bind one so they cannot return, thus causing nightmares and foreshadowing misfortune.\nUpon waking, face upward in bed, place the hands over the heart, click the teeth three times seven, and softly intone:\n\n*\"Nine Heavens’ Supreme Emperor, Four Gates’ Eight Numinous,\nSeven Chambers’ Two Mysteries, Three Pristine Original Essences,\nGrand Unity and Peach Prosperity, ascending to the Three Clarities,\nI beseech the Imperial Lords, summon the Yellow Tranquility,\nHasten to gather the seven pò, verify them in the divine court,\nIf any inauspiciousness exists—seven corpse-ghosts and demonic troops—\nI invoke the Twin Perfected, streaming torches to refine their forms,\nGreat Tàiwēi Emperor, sever and strike down evil essences,\nThree hun harmonized and refined, blood-corpses scattered and dissolved,\nSpirits return to the deserted abode, turning toward upright prosperity,\nGrant me divine transcendence, eternal kalpas preserved.\"*\n\nAfter the incantation, click the teeth twice seven times and swallow saliva ten times.\nThis is called the **Great Emperor’s Divine Incantation for Dispelling Nightmares and Averting Misfortune**.\nThose who practice it will find their three *hun* harmonized and refined, their seven *pò* restrained, their spirit bright and *qi* upright, corpse-defilements dispersed and destroyed.\nThe ghosts thus invoked will have already been consigned to hell.\nAfter these three incantations, unless blessed by numinous and auspicious responses, one will no longer dream of the extraordinary.\n\n---\n\nWhen Daoists make vows to the divine, focus their thoughts on the supreme Dharma, or recite hidden incantations, they should burn incense, bow in reverence, and whisper the words silently, ensuring no one hears.\nIf invoking the vanquishing of the Six Heavens and the destruction of malign ghosts, one may speak softly, but not so loudly as to be overheard or understood by others.\nWhen reciting scriptures, however, one may proceed as desired.\n\n---\n\nThe eight solar terms are days when the immortals of the Three Heavens gather for feasts and rites.\nThose who cultivate the Dao and make vows should observe these days for their practices and morning devotions.\nAs for the rites performed on the new and full moons, these do not pertain to the supreme Dharma.",
      "overlap_context": "the Seven Numinous settle the chamber,\nCloudy essences refine and irrigate, ten thousand *qi* blend in harmony,\nInner and outer prosper and remain upright, preserving this yellow robe.\"*\n\nAfter the incantation, click the teeth three more times, then wash the hands and face. This is called the **Method for Washing Away Filth and Averting Misfortune, the Seven Chambers’ Incantation**. Those who practice it regularly will find their spirit bright and blood purified, all inauspicious *qi* dissolved.",
      "start_char": 6259,
      "end_char": 7506,
      "start_sentence": 198,
      "end_sentence": 235,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.7746205329895,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上黄素四十四方经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "凡是其日，欲行礼愿陈咒之时，当先叩齿七通，心拜四方，乃微咒曰： 上清玉帝，三素元君，太上高灵，仙都大神，今日吉日，八愿开陈，上愿飞霄，长生神仙，中愿天地，合景风云，下愿五藏，与我常存，次愿七祖，释罗脱愆，又愿帝君，斫伐胞根，六愿世世，智慧开全，七愿灭鬼，馘斩六天，八愿降灵，彻听东西，上愿一合，莫不如所言，愿神愿仙，上朝三元。 咒毕，又拜如初，亦适意所陈，求解脱七祖之愆，及首己之罪状，以续於行事之后也。 此名为三元八朝隐咒，上愿神仙之要法也。 行之三年，七祖父母，及己之罪，都解释矣。 然后玉华降卫，感会神明，八愿开陈，必获灵仙之要契也。 右太上黄素四十四方，是太上大道君正炁三天之法，后撰集妙经，以为科表也。 按此之经文，神法真妙，修生之人，使得立用以治身也。 必验之神方也。 自非三元秀简，帝图玉箓者，四十四方弗可染也。 此之神方，妙绝於众品籍，隐於帝房。 传授之时，皆须高仙过品，太极试观，再闻玉帝，重奏太上，乃得授之。 所谓三天正法，连盟七世，不传於非玄挺质之子。 若不祟天禁，妄泄玄法，连盟之祖，同闭地狱，身考水官，仙可冀乎。 上清太上黄素四十四方经竟",
      "translated_text": "On such days, when preparing to perform rites, make vows, or recite incantations, one should first strike the teeth seven times, then bow in reverence to the four directions, and softly intone the following incantation:\n\n*\"Supreme Clarity Jade Emperor, Three Primordial Sovereigns, Most High Numinous Ones, Divine Lords of the Immortal Capital—on this auspicious day, the Eight Vows are declared:\nThe first vow: to ascend the soaring heavens and attain the long-lived immortals.\nThe second vow: that heaven and earth harmonize with luminous winds and clouds.\nThe third vow: that the Five Viscera remain ever-present within me.\nThe fourth vow: that the Seven Ancestors be freed from karmic bonds and transgressions.\nThe fifth vow: that the Lord Emperor sever the roots of my mortal lineage.\nThe sixth vow: that in life after life, wisdom be fully awakened.\nThe seventh vow: to vanquish malign spirits and decapitate the Six Heavens.\nThe eighth vow: that numinous beings descend and heed my pleas from east to west.\nMay the first vow unite with all others, and may every word spoken be fulfilled.\nMay divine beings and immortals ascend to pay homage to the Three Origins.\"*\n\nUpon completing the incantation, bow again as before. One may then express one’s intentions freely, seeking liberation for the Seven Ancestors’ transgressions and confessing one’s own offenses, appending these to the ritual proceedings.\n\nThis is called the *Hidden Incantation of the Three Origins and Eight Homages*, the essential method of the immortals’ vows. Practicing it for three years will dissolve the sins of the Seven Ancestors, one’s parents, and oneself. Thereafter, the Jade Flower will descend as a guardian, spirits will respond in kind, and the Eight Vows, once declared, will assuredly secure the covenant of the numinous immortals.\n\nThe *Forty-Four Directions of the Yellow Simplicity* above is the method of the Great Dao Lord’s primordial *qi* of the Three Heavens, later compiled into the wondrous scriptures as a model for ritual practice. According to this scriptural text, the divine method is truly sublime, enabling cultivators to apply it for the governance of the body—a proven and efficacious spiritual formula.\n\nWithout the jade tablets of the Three Origins, the imperial charts, or the registers of immortality, the Forty-Four Directions must not be transmitted. This divine formula surpasses all other texts in marvel, concealed within the imperial chambers. At the time of transmission, only those who have transcended the ranks of high immortals, undergone trials by the Supreme Ultimate, received audience with the Jade Emperor twice, and been reapproved by the Most High may receive it. This is the true method of the Three Heavens, bound by a seven-generation covenant, never to be passed to those unworthy of the mysterious and upright. Should one violate celestial prohibitions and recklessly divulge the arcane method, the covenanted ancestors will be confined together in the earthly prisons, the self will be examined by the Water Officials, and the hope of immortality shall be forfeit.\n\nHere ends the *Scripture of the Forty-Four Directions of the Yellow Simplicity of Supreme Clarity*.",
      "overlap_context": " and the destruction of malign ghosts, one may speak softly, but not so loudly as to be overheard or understood by others.\nWhen reciting scriptures, however, one may proceed as desired.\n\n---\n\nThe eight solar terms are days when the immortals of the Three Heavens gather for feasts and rites.\nThose who cultivate the Dao and make vows should observe these days for their practices and morning devotions.\nAs for the rites performed on the new and full moons, these do not pertain to the supreme Dharma.",
      "start_char": 7507,
      "end_char": 7987,
      "start_sentence": 236,
      "end_sentence": 250,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.07084822654724,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上黄素四十四方经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}