{
  "source_id": "上清高上灭魔洞景金元玉清隐书经",
  "source_file": "chunked_daozang\\上清高上灭魔洞景金元玉清隐书经.json",
  "total_chunks": 3,
  "total_original_chars": 4277,
  "total_translated_chars": 30183,
  "total_translation_time": 158.82904314994812,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清高上灭魔洞景金元玉清隐书经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Jade Clarity Hidden Book of the Cavernous Perfection**\n\n**Scripture Title:** *The Supreme Jade Clarity Hidden Book of the Cavernous Perfection* (abbreviated as *The Jade Clarity Hidden Book*). The author is unknown, approximately dating to the Eastern Jin dynasty. It is a key early scripture of the Shangqing (Highest Clarity) tradition. The original text comprised four scrolls and eight chapters, later divided into four separate works:\n\n1. *The Three Chapters of the Supreme Cavernous Perfection Jade Clarity Hidden Book on the Destruction of Demons and the Divine Wisdom of the Highest Mystery*\n2. *The Three Chapters of the Supreme Highest Jade Clarity Hidden Book of the Jade Emperor’s Divine Wisdom for the Destruction of Demons*\n3. *The Supreme Highest Cavernous Radiance Golden Prime Jade Clarity Hidden Book* (one chapter)\n4. *The Supreme Highest Golden Prime Feathered Chapters Jade Clarity Hidden Book* (one chapter)\n\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n### *The Supreme Highest Cavernous Radiance Golden Prime Jade Clarity Hidden Book*\n\nThe Lord Emperor of the Supreme Tenuity Heaven, dwelling in leisure above the luminous rosy clouds, within the jade towers of the Golden Flower Chamber, harmonized the Dark Pivot and the Void Axis, ascending to the curved repose of the Jasper Chamber. There, he feasted upon Dragon Mountain and observed a three-year purification fast. Then, he summoned the Celestial Guests of the Three Primes and the Five Worthies of the Grand Simplicity, dispatching writs to the myriad spirits and convening the thousand perfected. The Nine Heavens aligned in formation, the Eight Emperors halted their chariots. Crimson seals were unveiled at the Jade Gates, and the Yin Armor arrayed before the Jasper Portals.\n\nThereupon, the Nine August Perfected Sovereigns and the Upper Prime Forbidden Lords transcended the Jade Void Heaven, unsealed the chambers of the Five Perfected, girded the talismans of the Transcendent Records, and mounted the chariots of the Three Simplicities. Ascending to the Lord Emperor of the Supreme Tenuity Jade Clarity Heaven, they manifested their divine canopies before alighting.\n\nAt that moment, the Primordial Illumination shone resplendent, the Celestial Origin unfolded in full array. Rivers and seas stilled their waves, the Eight Winds dispersed the mists. Auspicious clouds met the Dragon Carriages, radiance soared above the Nine Mysteries. Golden Immortals wielded their halberds, Great Masters lowered their banners. Heavenly Soldiers led the vanguard, their lofty blades cleaving the sky. The Nine Numinous Ones opened the path, the Four Luminaries supported the procession. Flying banners filled myriad roads, mounted warriors numbered in the billions. They lingered beneath the Jasper Towers, displayed their splendor atop the luminous rosy clouds. Their divine regalia were fully arrayed, with none unpresented.\n\nThereupon, the Lord Emperor of the Supreme Tenuity Heaven resumed his curved feast in the Jasper Chamber, reciting the Cavernous Chapters anew. He chanted the numinous verses of the Purple Void, resonating the Jade Microtones through the Seven Mysteries.\n\nThen, he commanded the Supreme Perfected of the Supreme Tenuity to order the assembled spirits to align their armor and sharpen their blades. Mounting the Eight-Jasper Jade Chariot, they harnessed the radiance of the Dark Effulgence. The Rosy Clouds marshaled the spirits, escorting the sun and flanking the moon. The Seven Dawns merged their brilliance, the Upper Stars drove away obstacles. Fire-armored soldiers flared their essence, the Eight Simplicities unfurled their carriages. The Primordial Hardness guarded the troops, feathered canopies hovered in the void. Ten thousand riders vied in splendor, venomous dragons flanked the chariots. Swirling mists coiled around the carriages, bearing the flowered banners of the Dark Above, gleaming with the fire-bells of flowing gold. The Five Rosy Clouds displayed their radiance, the Six Perfections shone in clarity. They struck the resonant bells of the Nine Flowers, beat the azure drums of the Dark Florescence. They clanged gold and shattered jade, struck the jasper chimes and tapped the jade zithers. Dragons roared and tigers howled, phoenixes danced and luan birds sang. The Eight Sounds harmonized as one, the myriad rhythms rang in unison. Cloud chimes soared into the mysteries, heavenly maidens arrayed their zithers. Dharma melodies played in due time, rhythmic sequences ascended in offering. The Celestial Harmonies spread in four directions, the vast music filled the empty courtyard. Divine tigers raised their voices, heavenly beasts arrayed their troops. Reverse-scaled and four-throated, they shook their manes and bared their forms. Clenching blades to sever demons, brandishing swords to capture spirits, they lay in wait for the fiends of the Six Heavens, beheaded the mountain-and-peak malevolent essences. Feathered riders floated in the void, divine blades blazed with light. They brandished the Wheel of Jade Characters, displayed the splendor of the Supreme Clarity. Gazing upon the cloud radiance, they lingered in ranks, pursuing the tilting canopies through the Rosy Cloud City.\n\nAfter a long while, the August Jade Emperor of the Supreme Sovereign then commanded the Jade Gentleman of the Dark Wings, the Grand Guardian Perfected, to go forth and welcome the Lord Emperor of the Supreme Tenuity Heaven. Gently guiding him forward, they turned their gaze toward the Jasper Chamber.\n\nThe Lord Emperor of the Supreme Tenuity Heaven then prostrated himself beneath the latticed window, bowing before the imperial throne of the August Emperor. Leaning upon the jasper countenance, he perceived the subtle resonance; gazing up at the divine eyes, he addressed the Emperor, saying:\n\n*\"This humble servant, fortunate in his transformation, has deeply awakened to the congealed mystery. Having been granted the imperial throne, I oversee the assembly of the perfected. I have scattered the dews of emptiness across the Seven Awakenings, sounded the jade chimes in the heavens above. Yearning for the divine path of the Pure Mystery, I aspire to the divine kingship of the Jade Void. Truly, I am but a subtle speck in the Dark Flow, offering my hidden heart to distant realms. Yet the Heavenly Honored One stands lofty and transcendent, his divine canopy shining in illumination. Casting his gaze upon the lower currents, he has already bestowed his great mercy.\"*\n\nThereupon, the August Jade Emperor of the Supreme Sovereign inclined his throne and chanted in repose, gazing emptily into the vast sky. He intoned the *Hidden Book of the Jade Clarity*, singing the numinous verses of the Primordial Radiance. The jade tones gleamed afar, the pure and subtle sounds resonated clearly.\n\nThe verses said:\n\n*The upper radiance emits the dawn’s glow,*\n*The golden heavens dense with purple clarity.*\n*The Three Simplicities illumine the jasper doors,*\n*The Dark Above shines upon the void’s numina.*\n*Hand plucking the blossoms of the azure groves,*\n*Turning the canopy toward the Great Nothing’s court.*\n*Feasting in repose within the emerald chambers,*\n*Striding aloft the resplendent Jade Capital.*\n*Upholding the crimson radiance’s jade,*\n*Long mists scatter the void’s encampments.*\n*The Dark Return may surely be preserved—*\n*Why resent the lack of birth?*\n*The Four Kings dwell within whose body?*\n*Transformations divide—how could forms be one?*\n*Swiftly, swiftly, discern the wondrous ranks,*\n*Merge with your qi’s luminous clarity.*\n\nThereupon, the Jade Emperor concluded his chant and commanded the Lord Emperor of the Supreme Tenuity Heaven to be seated, leading the myriad spirits into the chamber’s pavilion. They scattered flower incense throughout the Jade Palace, arrayed the vast music of the Celestial Harmonies, resonating the numinous tones across the Eight Seas, stirring the dark waves beyond the heavens. Beating drums and fanning winds, the thousand divine feathered guards poured jade goblets, gazing upon the Jasper Flower Chamber. The Nine Flowers offered their fruits, white essences and cinnabar elixirs. Hidden mushrooms formed the feast, phoenix platters and moon nectars. Jade ladles served in succession, dark-feathered attendants circulated the cups. They lingered in the chambers of the Eight Jades, feasted in the halls of the Nine Gemstones.\n\nThereupon, the August Jade Emperor of the Supreme Sovereign, concentrating his spirit in distant contemplation, chanted the mysteries of the Dark. Suddenly, he sighed and said:\n\n*\"To align with the Dark Model, to penetrate the subtle and profound—how deep indeed! You, having been granted the imperial throne and received the affairs of the Jade Void, lead flying immortals to court at the Golden Gates, with the Four Luminaries assisting at the wheels’ sides. Gazing afar upon the empty mountains, overseeing the celestial peaks, responding in harmony to transcendent songs, unfolding and praising wondrous wisdom—truly, you should thoroughly observe the hidden texts, align with the supreme methods, and elevate your gatherings to subtle resonance. Strive on!\"*\n\nThen the August Jade Emperor commanded the Supreme Venerable Perfected, opening the casket of luminous pearls to retrieve the *Jade Purity’s Hidden Writ of the Concealed Dark Plumes*, bestowing it upon the Celestial Emperor of the Grand Tenuity. Thereupon, the Emperor descended from his seat, bowing deeply before the August Sovereign to receive the scripture. He then entrusted it to the Supreme Perfected of the Grand Tenuity, the Dark Plume Jade Lord, who in turn transmitted it to the Perfected of the Highest Clarity and the exalted guests of the Three Primordials’ Great Simplicity.\n\nMoreover, the Emperor surveyed the hosts of heavens, examining those among the ten directions who bore predestined affinities—those who had gathered in assemblies of true immortals or whose names were inscribed in the imperial registers of golden script and the hundred-jade ledgers—only these were deemed worthy of its transmission. Forty-five Jade Lads and Jade Maidens, attendants of the scripture, oversaw the bodies of its recipients, reporting transgressions to the Lords of Destiny and recording faults in the registers of the Three Primordials. Those who guarded its secrecy would enjoy blessings, while those who leaked it would be ensnared by calamity; suffering or joy would manifest instantly for their seven generations, and the consequences of sin or merit would converge in the present year. The inspectors of the Three Heavens would report to the Emperor, inscribing sins and recording faults without fail. Good and evil, truth and deceit—how could one not be vigilant?\n\nThe *August Jade Wisdom and Jade Purity’s Hidden Writ* is the esoteric discourse of the Highest Sovereign, the sacred text of the Jade Emperor. It is also named the *Cavern Radiance and Golden Mystery’s Concealed Dark Plume Scripture*. The Emperor concealed it within the *Cloud Radiance Pavilion* and the *Luminous Rosy Chamber*, sealing it in a casket of cinnabar petals and wrapping it in a cloud-brocade pouch. The Supreme Venerable Perfected was appointed its guardian, attended by the Dark Radiance Jade Lads. It was decreed that within seven hundred years, it might be transmitted to only three individuals. Unless one’s name was inscribed in the imperial charts and jade registers of true immortals, one could neither hear of nor behold this scripture. Those who beheld it would ascend as flying immortals of the Highest Clarity.\n\nThe method of transmission required the Five Elders to bestow the charts, the Great Unity to examine the candidate, and the ability to govern life across the ten directions, convene assemblies in the cavern-heavens, and swear oaths in cinnabar script, sealing them with blood pacts. First, one must fast for seven hundred days before receiving it. The oath was sworn upon thirty feet of azure silk and two pairs of golden rings, solemnizing the covenant before the Emperor, ascending to the Jade Clarity, and ensuring the transcendence of one’s ancestors as embryonic immortals. Should the sacred text be leaked, seven generations would suffer misfortune, their souls bound to the gates of death, their lifespans severed at the ford of the Five Paths. The Three Officials would inflict torment, extinguishing all hope of immortality; their bodies would endure the perils of fire and water, their trials more treacherous than treading upon ice. How could one not be vigilant? How could one not be vigilant?\n\nThe *Jade Purity’s Hidden Writ and Golden Mystery’s Dark Plume Scripture* are the treasured texts of the Primal Sovereign, concealed by the Jade Emperor and overseen by the inspectors of the Three Heavens, who punish all violations of its sanctity. On the day the disciple begins the fast, the Jade Lads and Maidens attending the scripture report to the Emperor. Once the numinous voice resounds, the Great Unity examines the candidate, the August Lord observes from above, the Supreme Venerable attends at his side, and the plume immortals preside over the truth. The disciple must enter the chamber in purified robes, burn incense, and cultivate utmost sincerity and focus before reciting the scripture ten times over.\n\n---\n\n**Cavern Radiance and Golden Mystery’s Jade Purity Hidden Writ**\n\nThe Darkly Profound and Primal Void unfolds its chapters through the Four Numinous Ones; the Jade Wisdom disperses demons as the Six Perfections are arrayed. The exalted assemblies of the Three Primordials convene, feasting with the Nine Perfected. Myriad spirits receive their duties as the Jade Emperor conceals the Dark Mystery. The Nine Harmonies and Hundred Convergences ascend the Dharma Wheel, drifting upon the lofty carriage to establish the Radiant Upper Primordial. The Dao’s paths are boundless; embodying the One, spirit congeals. The Void transforms and unites, the Seven Ways aligning in division. Preserving life in the Jade Clarity, one roams the Void’s ford, secretly observing the myriad destinies and governing the cavern-heavens. The towering edifice of virtue, the majestic and exalted Sovereign—twin radiance wings the spirit, the Four Luminaries reflect the Two Mysteries. The Five Ways intermingle in splendor, the myriad models flow in perfection. Circling the celestial degrees, seven transformations and nine revolutions—gazing upon the Great Void’s transformations, one strides to the Jade Palace. The clear waves mirror afar; the Dao awakens the Highest Perfected. The subtle and profound Void—chanting the Darkly Profound, the Eight Simplicities converge in unison to pay homage in the Jade Clarity. Summoning the Grand Tenuity, they convene the myriad spirits. The Three Primordials present their registers; the Five Elders gather in the court. The exalted Perfected stand in solemn array, the Golden Immortals in wondrous forms. Feathered skirts and jade sleeves, brocade capes with chiming bells, green auroras draped in purity—from the jade chambers, essence emanates. The sounds resonate in Grand Harmony; ten thousand chants pierce the Dark. The numinous light of eightfold radiance, the seven qi intermingling—noble scions unite in transformation, the Imperial Unity congeals in form. Wondrously chanting divine wisdom, the Jade Dao’s Hidden Scripture—numinous sounds scatter like jade, dark echoes present themselves anew. The Five August Ones command their chariots; the exalted ones ascend the imperial court. The Darkly Profound summons immortals; the Jade Emperor’s banners—Five Marchmount Spirit-Kings assist, the Four Luminaries convey. The Two Ways and their paths guide the Highest Perfected. The cavern-heavens’ lofty observances, the wondrous capital of clouds—the celestial gates open wide, the numinous barriers reveal their clarity. Dancing in the Great Void, the Seven Spirits perpetually arise. Twin feasts in the Empty Cavern, dreaming of roaming the Highest Clarity. Essence resonates afar; the Dao harmonizes with the Nameless. The Ten Absolutes converge in harmony; the Two Images rest in the Void. Governing the primordial and ordering qi, the myriad transformations merge in perfection. Registers are inscribed in the cloud chambers; the treasure ledgers of the exalted spirits—purifying the spirit in the Purple Void, how could one’s mandate be overthrown?\n\nThen, at times, the divine and wondrous connect, the unfettered gaze flows eternally. The Four Mysteries reflect in unison; flying light flashes like lightning in the dark. The sun’s radiance revolves in twin motion; the Purple Court illuminates the body. The Dao awakens the Highest Perfected; the Seven Numinous Ones align in accord. The spirit’s mechanism is swift and keen; the Eight August Ones establish the scripture. Names are presented in the imperial hall; feathered registers in the Great Void. The body feasts in the ledger chambers, soaring through the Jade Void. In the Southern Palace, one receives immortality. The Seven Primordials return to the womb, resting in the radiance of the lofty jade. Transforming and ascending the divine thoroughfare, singing dark hymns in the clouds—the imperial guests dwell together, preserving this Dark Return. The Cinnabar Sovereign revolves the pearl; the Primal Unity’s Red Child. The Heavenly Earl congeals in the Void; the wondrous and subtle cloudscapes. The lush cloudy mounds—hand parting the golden gates, body bearing the jade talismans. The vermilion auroras blaze; the eight lights ascend in reverence. The form, delicate and darkly true, governs the myriad streams of life, preserving the golden dawn in the jade realm.\n\nThereupon, sins vanish from the Three Paths; the numinous breath stirs the Nine Celestial Bodies. Embracing the true in the Purple Chamber, the Five August Ones escort the immortals. Preserving the Crimson Palace, dwelling in the Cinnabar Mystery—ten revolutions and five returns, the numinous quakes the myriad origins. Fragrant winds scatter in eight directions; evil demons are extinguished like smoke. Myriad upon myriad, they come before the Emperor. The Immortal Sovereign announces the talismans; the Dao’s paths converge in the Three Perfected. Jade sounds ascend to fill the heavens; seven generations are freed from suffering. \"Let me become a flying immortal, my name transferred to the Jade Gate. The Three Qi entwine; the Nine Souls are divided. The Imperial Unity transforms the radiance; the myriad transformations attain perfection. Sevenfold ascent and return; the Three Lights reflect the true. Opposing and extinguishing the Five Paths, severing the roots of the womb—twin August Ones guard at the sides, grasping the talismans of the Ten Mysteries. The jade registers are illuminated; blessings overflow the Dragon Spring. Ascending the Brahma-realm, treading in prosperity, the Five Qi unite and extend. Riding with the Great Unity, ascending the imperial carriage together—summoning the noble scions, presenting the registers to the Seven Spirits. Inscribed in the Yellow Registers, grasping the tally to ascend—soaring to reflect the Jade Splendor, effulgent in the numinous origin. Extinguishing demons and dispersing calamities, eternally sealing the imperial palace. The Dark Qi scatters in four directions; the Great Void merges in emptiness. The numinous flies to the outer assistants; the Six Dings record within. Clouds move and rain descends, flowing through the Three Palaces. The Nine August Ones gaze below; the hidden dragon is inscribed above. The Moon Mother shares the carriage, circling the imperial ramparts. Donning vermilion kerchiefs and feathered robes, chiming bells upon the flowery peaks—transcending the earthly gates, the bridges of the Yellow Springs’ bends. The Five Elders unite the talismans, circling the golden imperial realm. Together, they pass through water and fire, merging in the Purple Chamber. Seven openings receive immortality; the court convenes in the Jade Hall. The Nine Luminaries arise in unison; the Five Splendors revolve their light. The Eight Qi rejoice in harmony; the Ten Absolutes stand firm. The Supreme Emperor exults; the Dark Mother abides in eternal well-being. The Nine Numinous Ones converge in unison; the Left Assistants and Right Ministers. The Great Void congeals in radiance; the myriad qi merge in unity. Ascending the cavern chambers, circling to unite with the Jade Clarity. The divine winds fan the gates; purple auroras and green scriptures. The lush cavern’s numinous mechanism—the Nine Harmonies and Hundred Clarities. Spirits face the golden dawn; the unfettered plumes in the Dragon Capital. Blessings flow through myriad paths; the seven ancestors follow in birth, each preserving the Southern Immortals. None fail to be embraced as embryos; the Nine Unions and Three Separations. Pristine radiance encircles the form; the blessed radiance of the Sun King. Together with the feathered moon spirits, the Great Unity summons demons. The Nine Heavens examine the essence, rescuing the dead from their accumulated sins and transcending them to the immortal court. The Lords of Destiny present the registers; the Imperial Unity merges in unity. The Three Primordials grasp the talismans; the Seven Spirits govern the Void. Impure qi scatter in profusion; blood corpses sink and decay. Severing the roots and returning to the womb, the myriad qi attain perfection. The Great Simplicity’s charts and registers, the Golden Immortals share the same carriage. Great blessings entwine; generations flourish in unison. Treasure vaults of wondrous radiance; the Three Passages ascend in clarity. White qi lingers in circuits; congealing in lush pearl and jade. Flying waves in the jade dawn—eternally preserving the kalpa’s lifespan. The Five Radiance entwine in brilliance; the Seven Gates receive illumination. Numinous talismans scatter wisdom; ordering qi and governing spirits. Circling the Cavern Yang on the right, grasping the Non-Male on the left. The noble scions present the registers; the inner guardians of Peach Prosperity. The Dark Mother embraces the charts; the Five Spirits of Yellow Tranquility. The womb’s roots are eightfold unbound; the August Elders inscribe the names. The Nine Knots unravel; the Five Poisons govern essence. Rescued from the Three Realms, returning to the immortal court as embryonic transcendents. The Seven Primordials unbind the nets; generations of ancestors receive birth. The treasure ledgers of the Great Void—together, they aid the numinous encampment. The Six Palaces shine in clarity; the golden scriptures and feathered scriptures. For generations, they become true immortals, donning brocade and azure. The Emperor’s teachers entwine; uniting with the radiance of the Jade Clarity. Scattering incense at the Dragon Windows, merging with the Five Cities. Treading the radiant thoroughfares, hands parting the Four Luminaries. Eight radiance and nine refinements—striding the Cloud Capital. Governing the Six Abysses, inscribing names in the Eight Jades. Five penetrations and seven unions; the Three Qi unite at last. Myriad branches of layered splendor—eternally preserving the immortal spirits. Grasping the jade talismans, ascending to the feathered court. Circling winds merge in transformation; the Jade Emperor’s Hidden Scripture. Long bound in singular destiny, the supreme vow must be fulfilled. Receiving the Emperor’s grace, ascending to pay homage in the Jade Clarity.\n\nThe Jade Clarity’s Hidden Scripture, the Hidden Feathered Classic—also named the Cavernous Radiance Golden Mystery—is the secret treasure of the Jade Emperor. To practice this method, one must first perform the Great Unification of the Hundred Spirits, mastering the transformations of yin and yang and the Supreme Unity’s Upper Dao, before proceeding further. These sacred verses are the precious scrolls of emperors and sovereigns, untying the knotted bonds of the seven ancestors, safeguarding the myriad spirits within the primordial womb, and gathering the life-Dao from the ten directions, their numinous resonance ascending to fill the heights.\n\nOnce the ten thousand cycles are complete, the body shines with golden dawn. Then, wondrous radiance subtly stirs, lingering upon the cloud-wheels; the jade bells chime in the Great Empyrean, and the perfected take their places among the Upper Immortals. Thus, in every movement and stillness, one must not neglect its weighty purpose.\n\nOn the day of one’s natal destiny, purify the fast and enter the chamber. Burn incense to the left and right, face north, and bow twice. Then, with the heart fixed upon the Jade Emperor and the Primordial Lady of the Jade Clarity, seek deliverance from the transgressions of the Seven Mysteries and petition for one’s own immortality. When finished, sit upright and recite the scripture.\n\nAfter reciting the scripture three times, read once the *Highest Jade Emperor’s Divine Wisdom for Annihilating Demons*. That evening, perform ten recitations of the Hidden Scripture and four readings of the *Divine Wisdom*. Upon completion, close the eyes, inwardly gaze, calm the spirit, and regulate the qi. Sit or lie as one wishes, then knock the teeth thirty times and softly intone the prayer:\n\n*\"Great Wisdom of the Five Emperors, this is the Hidden Mystery.\nTen cycles and four returns—annihilate demons, summon the perfected.\nSeven spirits unite in harmony; the Great Unification gathers the Five Spirits.\nJade resonance shakes the Eight Directions; the Upper Primordial’s Seven Mysteries.\nMysterious wind scatters the gates, fanning away the roots of the womb.\nEternally safeguard the fetal infant, eternally receive the true immortals.\nAscend to the Upper Clarity, to the Jade Emperor’s celestial chariot.\"*\n\nThen knock the teeth thirty times again and swallow saliva ten times. Thereupon, the hundred spirits assemble, the five viscera become tranquil, the Imperial Lord rejoices, the Great Unity preserves life, the body is purified, the qi is fortified, the hun is softened, the po is pacified, the Director of Destinies records one’s fate, and the Royal Elder inscribes one’s name. No one may weep for oneself; the flying wheel ascends to the Jade Clarity. The knots of the womb unravel, the Eight Radiance unite in form, great fortune entwines, and the Seven Mysteries share in glory.\n\nWhen the ten recitations are complete, bow to the four directions in reverence of the wondrous and exalted spirits. Those who maintain long fasts, sever worldly ties, purify the body, and wear clean garments may dwell in seclusion and recite daily. Alternatively, on the days of *jiǎzǐ* or the eight solar terms—times of the Upper Primordial’s courtly feasts—one need not wait for the natal destiny day to proceed.\n\nDuring the ten recitations of the Hidden Scripture, the Great Unity oversees, the Director of Destinies determines life, the myriad spirits merge in unity, the Imperial Lord solidifies form, the Three Palaces convene with the perfected, and the Nine Chambers receive the numinous. On that night, wondrous responses and auspicious signs will manifest, whereupon the Eight Purities will envelop the body, and the Three Primordials will confer perfection.\n\nIn practicing this Dao, one must focus the essence, preserve the true, and concentrate the qi. With a sincere and earnest heart, enduring hardship and adversity without forgetting the Supreme Dao, subtle resonance will readily converge, the Dharma-wheel will swiftly ascend, and at dawn, one will ascend to the Great Empyrean, soaring through the chambers of yin.\n\nIf, however, the mind scatters into myriad thoughts, sincerity falters, the body remains defiled and impure, the heart lacks supreme longing, and one violates the numinous prohibitions or transgresses the sacred statutes, then the Imperial Lord will censure one’s sins, calamity will entwine the body, no hope of immortality will remain, the Seven Mysteries will be further imprisoned, the hun and po will enter wind and fire, and the kalpas will multiply one’s transgressions. Those who uphold the prohibitions become numinous immortals; those who violate them face execution.\n\nIf a Daoist’s body is unwell and illness is perceived, one may seclude oneself in a separate chamber, invoke the divine luminaries, and seek deliverance from the entanglements of transgressions and the sins of the Seven Mysteries. Upon receiving permission to recite the scripture, visualize the true qi and perform the rites and prayers as prescribed. When all is done, calm the body and rest. Naturally, the hun and fetal spirit will be fortified within, the Three Passes will receive the numinous, evil toxins will disperse, and the body and qi will become tranquil. Upon awakening, the body will be healthy and at peace, free from all illness.\n\nIf others are afflicted with illness or face dire straits, one may recite the scripture on their behalf. First, invoke the divine luminaries, face north, bow twice, and state the person’s name to the Primordial Lady of the Jade Clarity. Seek deliverance from their transgressions and the sins of their seven ancestors, salvation for the living in the ten directions, and relief from the eight difficulties. Then burn incense, recite the scripture in seclusion, and perform the prayers as prescribed. Great fortune will manifest in the body.\n\nEntering the fast and secluding oneself for seven days to recite the scripture is called the *Great Unification of the Hundred Spirits*, the audience with the Imperial Unity, the deliverance from transgressions and entanglements, the gathering of life and salvation from peril—none will fail to receive grace. This is the supreme method of the Jade Emperor. One must not tread upon it with a defiled or impure body, nor profane it with contamination. The Three Heavens will察 transgressions, and the punishment will be equal to that for leaking secrets. Be cautious, be cautious.\n\nThe *Highest Upper Clarity Scripture of the Jade Emperor’s Cavernous Radiance Golden Primordial Hidden Book for Annihilating Demons* ends here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真高上玉清隐书经 经名：洞真高上玉清隐书经。 简称《玉清隐书》。 撰人不详，约出於东晋。 系早期上清派重要经典。 原本有四卷八篇，后分作四种。 即：《上清太上玉清隐书灭魔神慧高玄真经》三篇； 《上清高上灭魔玉帝神慧玉清隐书》三篇； 《上清高上灭魔洞景金元玉清隐书经》一篇； 《上清高上金元羽章玉清隐书经》一篇。 底本出处：《正统道藏》正一部。 上清高上灭魔洞景金元玉清隐书经 太微天帝君，闲居於明霞之上，琼阙之内金华之房，合变冥枢萧朗上契曲寝瑶室，时宴龙山，清斋三年，乃命太素三元上皇五贤之宾，檄落万灵，理召千真，九天齐陈，八帝停轮，披朱见於玉户，阴甲列於琼门。 爰有九皇上真上元禁君，超玉虚之天，启五真之房，带逸录之符，乘三素之軿，上诣玉清太微天帝君，显灵盖而后乘焉。 是时玄始映朗，天元敷陈，河海静波，八风散烟，庆云接於龙轩，景浮扬於九玄，金仙秉钺，大师伏幡，天丁前驱，高锋厉天，九灵启路，四明扶输，飞旌万涂，罗骑亿千，踯躅於琼阙之下，扬华於明霞之巅，灵仪阐备，莫不毕陈。 於是太微天帝君方复曲宴琼室，重诵洞章，歌紫虚之灵辞，琅微音於七玄。 于时乃命太微上真，勑使群灵整甲齐锋，乃登八琼玉辇，驾玄景之晖，太霞部灵，引日侠月，七晨合明，上星驱除，火甲扬精，八素启舆，元刚卫兵，羽盖停空，万骑相倾，毒龙翼轩，飞烟绕軿，戴玄上之华幡，焕流金之火铃，五霞陈曜，六度休明，抚九华之呜钟，打碧鼓之玄英，撞金折玉，叩璈拍琼，龙吟虎啸，鸾舞凤呜，八音同和，万律齐声，云璈绝玄，天女罗筝，法响时奏，续节上呈，天钧四陈，广乐虚庭，神虎仰号，天兽罗兵，逆鳞四喉，振豪奋形，衔刀割魔，挥剑捕灵，伺六天之凶夫，斩山岳之邪精，羽骑浮空，神锋曜明，挥轮玉字，扬华上清，望云景而徊辈，逐倾盖於霞城。 既至良久，於是上皇玉帝君，乃命玄羽玉郎太保真人，出迎太微天帝君，徐引使前，遂盻於琼房焉。 太微天帝君，乃稽首伏於窗轩之下，进拜於帝皇之机，凭琼颜而妙感，仰灵眸而陈辞曰： 贱臣幸化，重悟凝玄，得司帝位，领括群真，浪虚津於七觉，遂呜玉於霄上，希清玄之神涂，想玉虚之神王，实亦妙眇於玄流，奏冥心於遐方，而天尊高秀，灵盖显照，垂观下流，已弘大恩矣。 於是上皇玉帝君，乃推机偃咏，虚眺太空，昤玉清之隐书，歌元景之灵章，玉音遐璨，清微琅振。 其辞曰： 上景发晨晖，金霄郁紫清。 三素曜琼扉，玄上照虚灵。 手掇青林华，回盖太无庭。 寝宴颐绿房，飞步秀玉京。 提携朱景玉，长烟乱虚营。 玄归自可保，何以怨无生。 四王宅谁身，变分岂一形。 欻欻推妙品，混尔至气明。 於是玉帝吟歌毕，乃命太微天帝君，使坐引万灵於房轩，散华香於玉宇，陈天钧之广乐，响灵音於八海，振冥波於天外，鼓扇乘风，千神羽卫，方酌玉爵，盼於琼华之房，九英穕荐，素实丹方，隐芝结馔，凤俎月浆，玉摄重奏，玄羽运觞，流连於八琼之室，曲宴於九琳之堂。 於是上皇玉帝君，方凝神遐想，高咏绝玄，忽然而叹曰：上契玄范，通达冲微，亦深矣哉。 子既司帝位，受事玉虚，飞仙朝於金阙，四明辅於轮侧，遐盼空山，领括天岳，应和绝唱，摅赞妙慧，诚宜极观幽文，冲契上法，高会秀感，其勉之乎。",
      "translated_text": "**The Supreme Jade Clarity Hidden Book of the Cavernous Perfection**\n\n**Scripture Title:** *The Supreme Jade Clarity Hidden Book of the Cavernous Perfection* (abbreviated as *The Jade Clarity Hidden Book*). The author is unknown, approximately dating to the Eastern Jin dynasty. It is a key early scripture of the Shangqing (Highest Clarity) tradition. The original text comprised four scrolls and eight chapters, later divided into four separate works:\n\n1. *The Three Chapters of the Supreme Cavernous Perfection Jade Clarity Hidden Book on the Destruction of Demons and the Divine Wisdom of the Highest Mystery*\n2. *The Three Chapters of the Supreme Highest Jade Clarity Hidden Book of the Jade Emperor’s Divine Wisdom for the Destruction of Demons*\n3. *The Supreme Highest Cavernous Radiance Golden Prime Jade Clarity Hidden Book* (one chapter)\n4. *The Supreme Highest Golden Prime Feathered Chapters Jade Clarity Hidden Book* (one chapter)\n\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n### *The Supreme Highest Cavernous Radiance Golden Prime Jade Clarity Hidden Book*\n\nThe Lord Emperor of the Supreme Tenuity Heaven, dwelling in leisure above the luminous rosy clouds, within the jade towers of the Golden Flower Chamber, harmonized the Dark Pivot and the Void Axis, ascending to the curved repose of the Jasper Chamber. There, he feasted upon Dragon Mountain and observed a three-year purification fast. Then, he summoned the Celestial Guests of the Three Primes and the Five Worthies of the Grand Simplicity, dispatching writs to the myriad spirits and convening the thousand perfected. The Nine Heavens aligned in formation, the Eight Emperors halted their chariots. Crimson seals were unveiled at the Jade Gates, and the Yin Armor arrayed before the Jasper Portals.\n\nThereupon, the Nine August Perfected Sovereigns and the Upper Prime Forbidden Lords transcended the Jade Void Heaven, unsealed the chambers of the Five Perfected, girded the talismans of the Transcendent Records, and mounted the chariots of the Three Simplicities. Ascending to the Lord Emperor of the Supreme Tenuity Jade Clarity Heaven, they manifested their divine canopies before alighting.\n\nAt that moment, the Primordial Illumination shone resplendent, the Celestial Origin unfolded in full array. Rivers and seas stilled their waves, the Eight Winds dispersed the mists. Auspicious clouds met the Dragon Carriages, radiance soared above the Nine Mysteries. Golden Immortals wielded their halberds, Great Masters lowered their banners. Heavenly Soldiers led the vanguard, their lofty blades cleaving the sky. The Nine Numinous Ones opened the path, the Four Luminaries supported the procession. Flying banners filled myriad roads, mounted warriors numbered in the billions. They lingered beneath the Jasper Towers, displayed their splendor atop the luminous rosy clouds. Their divine regalia were fully arrayed, with none unpresented.\n\nThereupon, the Lord Emperor of the Supreme Tenuity Heaven resumed his curved feast in the Jasper Chamber, reciting the Cavernous Chapters anew. He chanted the numinous verses of the Purple Void, resonating the Jade Microtones through the Seven Mysteries.\n\nThen, he commanded the Supreme Perfected of the Supreme Tenuity to order the assembled spirits to align their armor and sharpen their blades. Mounting the Eight-Jasper Jade Chariot, they harnessed the radiance of the Dark Effulgence. The Rosy Clouds marshaled the spirits, escorting the sun and flanking the moon. The Seven Dawns merged their brilliance, the Upper Stars drove away obstacles. Fire-armored soldiers flared their essence, the Eight Simplicities unfurled their carriages. The Primordial Hardness guarded the troops, feathered canopies hovered in the void. Ten thousand riders vied in splendor, venomous dragons flanked the chariots. Swirling mists coiled around the carriages, bearing the flowered banners of the Dark Above, gleaming with the fire-bells of flowing gold. The Five Rosy Clouds displayed their radiance, the Six Perfections shone in clarity. They struck the resonant bells of the Nine Flowers, beat the azure drums of the Dark Florescence. They clanged gold and shattered jade, struck the jasper chimes and tapped the jade zithers. Dragons roared and tigers howled, phoenixes danced and luan birds sang. The Eight Sounds harmonized as one, the myriad rhythms rang in unison. Cloud chimes soared into the mysteries, heavenly maidens arrayed their zithers. Dharma melodies played in due time, rhythmic sequences ascended in offering. The Celestial Harmonies spread in four directions, the vast music filled the empty courtyard. Divine tigers raised their voices, heavenly beasts arrayed their troops. Reverse-scaled and four-throated, they shook their manes and bared their forms. Clenching blades to sever demons, brandishing swords to capture spirits, they lay in wait for the fiends of the Six Heavens, beheaded the mountain-and-peak malevolent essences. Feathered riders floated in the void, divine blades blazed with light. They brandished the Wheel of Jade Characters, displayed the splendor of the Supreme Clarity. Gazing upon the cloud radiance, they lingered in ranks, pursuing the tilting canopies through the Rosy Cloud City.\n\nAfter a long while, the August Jade Emperor of the Supreme Sovereign then commanded the Jade Gentleman of the Dark Wings, the Grand Guardian Perfected, to go forth and welcome the Lord Emperor of the Supreme Tenuity Heaven. Gently guiding him forward, they turned their gaze toward the Jasper Chamber.\n\nThe Lord Emperor of the Supreme Tenuity Heaven then prostrated himself beneath the latticed window, bowing before the imperial throne of the August Emperor. Leaning upon the jasper countenance, he perceived the subtle resonance; gazing up at the divine eyes, he addressed the Emperor, saying:\n\n*\"This humble servant, fortunate in his transformation, has deeply awakened to the congealed mystery. Having been granted the imperial throne, I oversee the assembly of the perfected. I have scattered the dews of emptiness across the Seven Awakenings, sounded the jade chimes in the heavens above. Yearning for the divine path of the Pure Mystery, I aspire to the divine kingship of the Jade Void. Truly, I am but a subtle speck in the Dark Flow, offering my hidden heart to distant realms. Yet the Heavenly Honored One stands lofty and transcendent, his divine canopy shining in illumination. Casting his gaze upon the lower currents, he has already bestowed his great mercy.\"*\n\nThereupon, the August Jade Emperor of the Supreme Sovereign inclined his throne and chanted in repose, gazing emptily into the vast sky. He intoned the *Hidden Book of the Jade Clarity*, singing the numinous verses of the Primordial Radiance. The jade tones gleamed afar, the pure and subtle sounds resonated clearly.\n\nThe verses said:\n\n*The upper radiance emits the dawn’s glow,*\n*The golden heavens dense with purple clarity.*\n*The Three Simplicities illumine the jasper doors,*\n*The Dark Above shines upon the void’s numina.*\n*Hand plucking the blossoms of the azure groves,*\n*Turning the canopy toward the Great Nothing’s court.*\n*Feasting in repose within the emerald chambers,*\n*Striding aloft the resplendent Jade Capital.*\n*Upholding the crimson radiance’s jade,*\n*Long mists scatter the void’s encampments.*\n*The Dark Return may surely be preserved—*\n*Why resent the lack of birth?*\n*The Four Kings dwell within whose body?*\n*Transformations divide—how could forms be one?*\n*Swiftly, swiftly, discern the wondrous ranks,*\n*Merge with your qi’s luminous clarity.*\n\nThereupon, the Jade Emperor concluded his chant and commanded the Lord Emperor of the Supreme Tenuity Heaven to be seated, leading the myriad spirits into the chamber’s pavilion. They scattered flower incense throughout the Jade Palace, arrayed the vast music of the Celestial Harmonies, resonating the numinous tones across the Eight Seas, stirring the dark waves beyond the heavens. Beating drums and fanning winds, the thousand divine feathered guards poured jade goblets, gazing upon the Jasper Flower Chamber. The Nine Flowers offered their fruits, white essences and cinnabar elixirs. Hidden mushrooms formed the feast, phoenix platters and moon nectars. Jade ladles served in succession, dark-feathered attendants circulated the cups. They lingered in the chambers of the Eight Jades, feasted in the halls of the Nine Gemstones.\n\nThereupon, the August Jade Emperor of the Supreme Sovereign, concentrating his spirit in distant contemplation, chanted the mysteries of the Dark. Suddenly, he sighed and said:\n\n*\"To align with the Dark Model, to penetrate the subtle and profound—how deep indeed! You, having been granted the imperial throne and received the affairs of the Jade Void, lead flying immortals to court at the Golden Gates, with the Four Luminaries assisting at the wheels’ sides. Gazing afar upon the empty mountains, overseeing the celestial peaks, responding in harmony to transcendent songs, unfolding and praising wondrous wisdom—truly, you should thoroughly observe the hidden texts, align with the supreme methods, and elevate your gatherings to subtle resonance. Strive on!\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1280,
      "start_sentence": 0,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.81540012359619,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上灭魔洞景金元玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "乃命上皇太老真人，开琼珠之箧，出玉清隐书隐玄羽经，以传太微天帝君。 於是帝君下席，稽辞於上皇之前，再拜受书，出付太微上真羽玄玉郎，以授诸上清真人，及太素三元高上玉贤之宾。 又帝君领括众天，试观十方诸有宿命之人，真仙之会及有帝简金书，百玉录籍之名者，乃得授传之耳。 侍书玉童玉女各四十五人，主司有经者之身，纠罪於司命，纪过於三元。 密慎者则享福，漏泄者则祸缠，苦乐立应於七祖，罪福交会於当年。 三天司察，奏之帝君，书罪录过，无不上闻，善恶违情，可不慎焉。 上皇玉慧玉清隐书者，乃高上之诀辞，玉帝之灵章也。 一名洞景金玄隐玄羽经。 玉帝君藏经於景云之阙琼霞之房，封以丹蕊之箧，閟以云锦之囊，主以太老上真，侍以玄景玉童。 使七百年中，得传三人。 自非真仙之名，帝图玉录者，不得闻见此经。 得见之者，飞仙上清。 传授之法，皆五老授图，太一试观，故能摄生十方，领会洞天，启誓丹青，歃血为盟。 先斋七百日，然后传之。 盟用青锦三十尺，金环两双，所以重誓冥科，崇约帝君，上登玉清，累祖胎仙。 漏泄宝文，七世被殃，系魂鬼於死户之下，伐年命於五道之津，三官考毒，已无仙冀，切身殊於水火，崄巇过於履冰，可不慎哉，可不慎哉。 玉清隐书金玄羽经，皆虚皇之宝书，玉帝所秘藏，三天司察，纠诸违慢之罪。 兆登斋之日，侍经玉童玉女上闻帝君。 灵音既震，则太一鉴试，帝尊下观，太老侍侧，羽仙司真矣。 兆当清斋入室，净服烧香，唯精唯专，然后乃十转诵经耳。 洞景金玄玉清隐书 玄玄虚上，四灵敷篇，玉慧散魔，六度休陈，高会三元，朝宴九真，万灵受事，玉帝隐玄，九和百会，参乘法轮，流浪高轩，立景上元，道逵无方，体一凝神，冲化合变，七道齐分，保生玉清，逍遥虚津，阴察万兆，括领洞天，巍巍德宇，峨峨高尊，双景翼灵，四映二玄，五道交焕，万范流全，周落天度，七变九旋，观化太空，飞步玉宸，清波远镜，道悟上真，精微太虚，高唱绝玄，於是八素同期，俱朝玉清，檄命太微，征召万灵，三元奏简，五老会庭，高真森罗，金仙殊形，羽裙玉袂，锦帔流铃，绿霞被素，玉室发精，音响太和，万唱绝冥，灵光八晖，七气混生，公子合变，帝一凝形，妙咏神慧，玉道隐经，灵音琼散，玄响续呈，五皇命驾，高秀皇庭，玄上招仙，玉帝之旌，五岳神王，辅输四明，二道方涂，理会上仙，洞天高观，妙景云京，天扉廓散，灵禁开明，腾舞太无，七神常生，双宴空洞，游梦上清，精感远畅，道合无名，十绝交和，二象虚停，摄元理气，万化浑成，录简云房，宝籍高灵； 澄神紫虚，命胡可倾。 或乃神元妙接，逸观常流，四玄总映，飞光电幽，日华双运，紫庭照躯，道悟上真，七灵同符，神机颖速，八皇定书，名奏帝堂，羽籍太无，身宴录房，飞行玉虚，南宫受仙，七元反胎，寝映高琼，变升神衢，霄歌玄唱，帝宾同居，保兹玄归，丹皇运珠，上一赤子，凝天伯无，妙眇云景，郁郁云丘，手排金扉，身荷玉符，朱霄霞焕，八光仰投，体娇冥真，摄生万流，保景金晨，长宴玉州。 於是罪灭三涂，灵吹九辰，纳真紫房，五皇携仙，保会绛宫，逸宅丹玄，十转五回，灵震万原，香风八披，恶魔绝烟，万万千千，来对帝前，仙皇告符，道逵三真，琼音上充，七世无间，令我飞仙，名迁玉门，三气缠绵，九魂已分，帝一变景，万化亦臻，七度上徊，三光映真，对灭五道，伐破胞根，双皇侠守，把符十玄，玉籍已明，福盈龙泉，陵梵履昌，五气合延，参乘太一，同升帝轩，并命公子，奉籍七神，黄录刻名，握节上迁，飞映玉华，焕落灵元，灭魔散祸，长闭帝宫，玄气四霏，大混虚冲，灵飞外辅，六丁注中，云行雨施，流布三宫，九皇下视，上策隐龙，月母同轩，徊盖帝墉，披朱巾羽，呜铃华峰，越出地户，泉曲之梁，五老合符，徊金帝乡，俱过水火，混一紫房，七开受仙，朝会玉堂，九曜同生，五华运光，八气庆合，十绝牢张，上帝欢熙，玄母常康，九灵同期，左弼右卿，太无结晖，万气混并，上登洞房，徊合玉清，神风扇扉，紫霞绿经，郁洞灵机，九和百明，神对金霄，逸羽龙京，景福万涂，七祖顺生，各保南仙，莫不胎婴，九合三离，素华绕形，福景日王，并羽月灵，太一召魔，九天校精，拔回死积，越度仙庭，司命奏籍，帝一混并，三元把符，七神虚营，秽气纷纷，血尸沉零，绝根反胎，万气以成，太素录图，金仙同軿，大福缠绵，累支同荣，宝藏秀华，三关霄清，白气徘徊，凝郁珠琼，飞浪玉晨，长保劫龄，五晖缠曜，七门受明，神符散慧，理气摄灵，右徊洞阳，左携无英，公子奉籍，内守桃康，玄母抱图，五神黄宁，胞根八解，皇老刻名，九结披散，五毒摄精，拔出三界，反胎仙庭，七元解罗，累祖受生，宝录太无，俱济神营，六府焕爽，金书羽经，世为真仙，披落锦青，帝师缠绵，合景玉清，散香龙窗，玄合五城，足蹑景衢，手排四明，八晖九炼，飞步云京，领会六渊，刻名八琼，五通七合，三气乃并，万条重华，世保仙灵，把持玉符，身升羽庭，徊风合化，玉帝隐经，长契壹运，上愿必成，受帝之恩，上朝玉清。",
      "translated_text": "Then the August Jade Emperor commanded the Supreme Venerable Perfected, opening the casket of luminous pearls to retrieve the *Jade Purity’s Hidden Writ of the Concealed Dark Plumes*, bestowing it upon the Celestial Emperor of the Grand Tenuity. Thereupon, the Emperor descended from his seat, bowing deeply before the August Sovereign to receive the scripture. He then entrusted it to the Supreme Perfected of the Grand Tenuity, the Dark Plume Jade Lord, who in turn transmitted it to the Perfected of the Highest Clarity and the exalted guests of the Three Primordials’ Great Simplicity.\n\nMoreover, the Emperor surveyed the hosts of heavens, examining those among the ten directions who bore predestined affinities—those who had gathered in assemblies of true immortals or whose names were inscribed in the imperial registers of golden script and the hundred-jade ledgers—only these were deemed worthy of its transmission. Forty-five Jade Lads and Jade Maidens, attendants of the scripture, oversaw the bodies of its recipients, reporting transgressions to the Lords of Destiny and recording faults in the registers of the Three Primordials. Those who guarded its secrecy would enjoy blessings, while those who leaked it would be ensnared by calamity; suffering or joy would manifest instantly for their seven generations, and the consequences of sin or merit would converge in the present year. The inspectors of the Three Heavens would report to the Emperor, inscribing sins and recording faults without fail. Good and evil, truth and deceit—how could one not be vigilant?\n\nThe *August Jade Wisdom and Jade Purity’s Hidden Writ* is the esoteric discourse of the Highest Sovereign, the sacred text of the Jade Emperor. It is also named the *Cavern Radiance and Golden Mystery’s Concealed Dark Plume Scripture*. The Emperor concealed it within the *Cloud Radiance Pavilion* and the *Luminous Rosy Chamber*, sealing it in a casket of cinnabar petals and wrapping it in a cloud-brocade pouch. The Supreme Venerable Perfected was appointed its guardian, attended by the Dark Radiance Jade Lads. It was decreed that within seven hundred years, it might be transmitted to only three individuals. Unless one’s name was inscribed in the imperial charts and jade registers of true immortals, one could neither hear of nor behold this scripture. Those who beheld it would ascend as flying immortals of the Highest Clarity.\n\nThe method of transmission required the Five Elders to bestow the charts, the Great Unity to examine the candidate, and the ability to govern life across the ten directions, convene assemblies in the cavern-heavens, and swear oaths in cinnabar script, sealing them with blood pacts. First, one must fast for seven hundred days before receiving it. The oath was sworn upon thirty feet of azure silk and two pairs of golden rings, solemnizing the covenant before the Emperor, ascending to the Jade Clarity, and ensuring the transcendence of one’s ancestors as embryonic immortals. Should the sacred text be leaked, seven generations would suffer misfortune, their souls bound to the gates of death, their lifespans severed at the ford of the Five Paths. The Three Officials would inflict torment, extinguishing all hope of immortality; their bodies would endure the perils of fire and water, their trials more treacherous than treading upon ice. How could one not be vigilant? How could one not be vigilant?\n\nThe *Jade Purity’s Hidden Writ and Golden Mystery’s Dark Plume Scripture* are the treasured texts of the Primal Sovereign, concealed by the Jade Emperor and overseen by the inspectors of the Three Heavens, who punish all violations of its sanctity. On the day the disciple begins the fast, the Jade Lads and Maidens attending the scripture report to the Emperor. Once the numinous voice resounds, the Great Unity examines the candidate, the August Lord observes from above, the Supreme Venerable attends at his side, and the plume immortals preside over the truth. The disciple must enter the chamber in purified robes, burn incense, and cultivate utmost sincerity and focus before reciting the scripture ten times over.\n\n---\n\n**Cavern Radiance and Golden Mystery’s Jade Purity Hidden Writ**\n\nThe Darkly Profound and Primal Void unfolds its chapters through the Four Numinous Ones; the Jade Wisdom disperses demons as the Six Perfections are arrayed. The exalted assemblies of the Three Primordials convene, feasting with the Nine Perfected. Myriad spirits receive their duties as the Jade Emperor conceals the Dark Mystery. The Nine Harmonies and Hundred Convergences ascend the Dharma Wheel, drifting upon the lofty carriage to establish the Radiant Upper Primordial. The Dao’s paths are boundless; embodying the One, spirit congeals. The Void transforms and unites, the Seven Ways aligning in division. Preserving life in the Jade Clarity, one roams the Void’s ford, secretly observing the myriad destinies and governing the cavern-heavens. The towering edifice of virtue, the majestic and exalted Sovereign—twin radiance wings the spirit, the Four Luminaries reflect the Two Mysteries. The Five Ways intermingle in splendor, the myriad models flow in perfection. Circling the celestial degrees, seven transformations and nine revolutions—gazing upon the Great Void’s transformations, one strides to the Jade Palace. The clear waves mirror afar; the Dao awakens the Highest Perfected. The subtle and profound Void—chanting the Darkly Profound, the Eight Simplicities converge in unison to pay homage in the Jade Clarity. Summoning the Grand Tenuity, they convene the myriad spirits. The Three Primordials present their registers; the Five Elders gather in the court. The exalted Perfected stand in solemn array, the Golden Immortals in wondrous forms. Feathered skirts and jade sleeves, brocade capes with chiming bells, green auroras draped in purity—from the jade chambers, essence emanates. The sounds resonate in Grand Harmony; ten thousand chants pierce the Dark. The numinous light of eightfold radiance, the seven qi intermingling—noble scions unite in transformation, the Imperial Unity congeals in form. Wondrously chanting divine wisdom, the Jade Dao’s Hidden Scripture—numinous sounds scatter like jade, dark echoes present themselves anew. The Five August Ones command their chariots; the exalted ones ascend the imperial court. The Darkly Profound summons immortals; the Jade Emperor’s banners—Five Marchmount Spirit-Kings assist, the Four Luminaries convey. The Two Ways and their paths guide the Highest Perfected. The cavern-heavens’ lofty observances, the wondrous capital of clouds—the celestial gates open wide, the numinous barriers reveal their clarity. Dancing in the Great Void, the Seven Spirits perpetually arise. Twin feasts in the Empty Cavern, dreaming of roaming the Highest Clarity. Essence resonates afar; the Dao harmonizes with the Nameless. The Ten Absolutes converge in harmony; the Two Images rest in the Void. Governing the primordial and ordering qi, the myriad transformations merge in perfection. Registers are inscribed in the cloud chambers; the treasure ledgers of the exalted spirits—purifying the spirit in the Purple Void, how could one’s mandate be overthrown?\n\nThen, at times, the divine and wondrous connect, the unfettered gaze flows eternally. The Four Mysteries reflect in unison; flying light flashes like lightning in the dark. The sun’s radiance revolves in twin motion; the Purple Court illuminates the body. The Dao awakens the Highest Perfected; the Seven Numinous Ones align in accord. The spirit’s mechanism is swift and keen; the Eight August Ones establish the scripture. Names are presented in the imperial hall; feathered registers in the Great Void. The body feasts in the ledger chambers, soaring through the Jade Void. In the Southern Palace, one receives immortality. The Seven Primordials return to the womb, resting in the radiance of the lofty jade. Transforming and ascending the divine thoroughfare, singing dark hymns in the clouds—the imperial guests dwell together, preserving this Dark Return. The Cinnabar Sovereign revolves the pearl; the Primal Unity’s Red Child. The Heavenly Earl congeals in the Void; the wondrous and subtle cloudscapes. The lush cloudy mounds—hand parting the golden gates, body bearing the jade talismans. The vermilion auroras blaze; the eight lights ascend in reverence. The form, delicate and darkly true, governs the myriad streams of life, preserving the golden dawn in the jade realm.\n\nThereupon, sins vanish from the Three Paths; the numinous breath stirs the Nine Celestial Bodies. Embracing the true in the Purple Chamber, the Five August Ones escort the immortals. Preserving the Crimson Palace, dwelling in the Cinnabar Mystery—ten revolutions and five returns, the numinous quakes the myriad origins. Fragrant winds scatter in eight directions; evil demons are extinguished like smoke. Myriad upon myriad, they come before the Emperor. The Immortal Sovereign announces the talismans; the Dao’s paths converge in the Three Perfected. Jade sounds ascend to fill the heavens; seven generations are freed from suffering. \"Let me become a flying immortal, my name transferred to the Jade Gate. The Three Qi entwine; the Nine Souls are divided. The Imperial Unity transforms the radiance; the myriad transformations attain perfection. Sevenfold ascent and return; the Three Lights reflect the true. Opposing and extinguishing the Five Paths, severing the roots of the womb—twin August Ones guard at the sides, grasping the talismans of the Ten Mysteries. The jade registers are illuminated; blessings overflow the Dragon Spring. Ascending the Brahma-realm, treading in prosperity, the Five Qi unite and extend. Riding with the Great Unity, ascending the imperial carriage together—summoning the noble scions, presenting the registers to the Seven Spirits. Inscribed in the Yellow Registers, grasping the tally to ascend—soaring to reflect the Jade Splendor, effulgent in the numinous origin. Extinguishing demons and dispersing calamities, eternally sealing the imperial palace. The Dark Qi scatters in four directions; the Great Void merges in emptiness. The numinous flies to the outer assistants; the Six Dings record within. Clouds move and rain descends, flowing through the Three Palaces. The Nine August Ones gaze below; the hidden dragon is inscribed above. The Moon Mother shares the carriage, circling the imperial ramparts. Donning vermilion kerchiefs and feathered robes, chiming bells upon the flowery peaks—transcending the earthly gates, the bridges of the Yellow Springs’ bends. The Five Elders unite the talismans, circling the golden imperial realm. Together, they pass through water and fire, merging in the Purple Chamber. Seven openings receive immortality; the court convenes in the Jade Hall. The Nine Luminaries arise in unison; the Five Splendors revolve their light. The Eight Qi rejoice in harmony; the Ten Absolutes stand firm. The Supreme Emperor exults; the Dark Mother abides in eternal well-being. The Nine Numinous Ones converge in unison; the Left Assistants and Right Ministers. The Great Void congeals in radiance; the myriad qi merge in unity. Ascending the cavern chambers, circling to unite with the Jade Clarity. The divine winds fan the gates; purple auroras and green scriptures. The lush cavern’s numinous mechanism—the Nine Harmonies and Hundred Clarities. Spirits face the golden dawn; the unfettered plumes in the Dragon Capital. Blessings flow through myriad paths; the seven ancestors follow in birth, each preserving the Southern Immortals. None fail to be embraced as embryos; the Nine Unions and Three Separations. Pristine radiance encircles the form; the blessed radiance of the Sun King. Together with the feathered moon spirits, the Great Unity summons demons. The Nine Heavens examine the essence, rescuing the dead from their accumulated sins and transcending them to the immortal court. The Lords of Destiny present the registers; the Imperial Unity merges in unity. The Three Primordials grasp the talismans; the Seven Spirits govern the Void. Impure qi scatter in profusion; blood corpses sink and decay. Severing the roots and returning to the womb, the myriad qi attain perfection. The Great Simplicity’s charts and registers, the Golden Immortals share the same carriage. Great blessings entwine; generations flourish in unison. Treasure vaults of wondrous radiance; the Three Passages ascend in clarity. White qi lingers in circuits; congealing in lush pearl and jade. Flying waves in the jade dawn—eternally preserving the kalpa’s lifespan. The Five Radiance entwine in brilliance; the Seven Gates receive illumination. Numinous talismans scatter wisdom; ordering qi and governing spirits. Circling the Cavern Yang on the right, grasping the Non-Male on the left. The noble scions present the registers; the inner guardians of Peach Prosperity. The Dark Mother embraces the charts; the Five Spirits of Yellow Tranquility. The womb’s roots are eightfold unbound; the August Elders inscribe the names. The Nine Knots unravel; the Five Poisons govern essence. Rescued from the Three Realms, returning to the immortal court as embryonic transcendents. The Seven Primordials unbind the nets; generations of ancestors receive birth. The treasure ledgers of the Great Void—together, they aid the numinous encampment. The Six Palaces shine in clarity; the golden scriptures and feathered scriptures. For generations, they become true immortals, donning brocade and azure. The Emperor’s teachers entwine; uniting with the radiance of the Jade Clarity. Scattering incense at the Dragon Windows, merging with the Five Cities. Treading the radiant thoroughfares, hands parting the Four Luminaries. Eight radiance and nine refinements—striding the Cloud Capital. Governing the Six Abysses, inscribing names in the Eight Jades. Five penetrations and seven unions; the Three Qi unite at last. Myriad branches of layered splendor—eternally preserving the immortal spirits. Grasping the jade talismans, ascending to the feathered court. Circling winds merge in transformation; the Jade Emperor’s Hidden Scripture. Long bound in singular destiny, the supreme vow must be fulfilled. Receiving the Emperor’s grace, ascending to pay homage in the Jade Clarity.",
      "overlap_context": " You, having been granted the imperial throne and received the affairs of the Jade Void, lead flying immortals to court at the Golden Gates, with the Four Luminaries assisting at the wheels’ sides. Gazing afar upon the empty mountains, overseeing the celestial peaks, responding in harmony to transcendent songs, unfolding and praising wondrous wisdom—truly, you should thoroughly observe the hidden texts, align with the supreme methods, and elevate your gatherings to subtle resonance. Strive on!\"*",
      "start_char": 1280,
      "end_char": 3256,
      "start_sentence": 33,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 76.4004955291748,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上灭魔洞景金元玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "玉清隐书隐玄羽经，一名洞景金玄，玉帝所秘藏。 修此之法，当先行大混百神，变化雌雄及帝一上道，然后乃得续行之耳。 此之灵章，帝皇之宝篇，解七祖之□结，保万神於胎元，摄生道於十方，振灵音以上充。 万徧既周，则身耀金晨，尔乃灵霞妙感，俯徊云轮，呜铃太霄，列位上真。 所以俯仰殊格，未行其重故也。 当以本命之日，清斋入室，烧香左右，北面再拜，乃心存於玉帝琼元君，求得解七玄之愆，乞己神仙。 毕，平坐诵经。 诵经三徧，辄一过读高上灭魔玉帝神慧。 是夕当十转隐经，四读帝慧也。 读毕，乃临目内视，夷神平气，坐卧随意，当叩齿三十通，而微祝曰： 五帝大慧，是谓隐玄，十转四回，灭魔召真，七灵同期，大混五神，琼音八震，上元七玄，玄风散扉，扇伐胞根，长保胎婴，世受真仙，上升上清，玉帝之轩。 毕，又叩齿三十通，咽液十过。 於是百神并会，五藏夷平，帝君欢熙，太一保生，体清气固，魂柔魄宁，司命定录，皇老书名，人无哭己，飞轮玉清，胞结解散，八晖同形，大福缠绵，七玄同荣。 十转既竟，心拜四方，所以尊妙高灵也。 长斋之士，绝交人事，体清服洁，隐静别处，亦可日日诵习。 或可甲子之日，及诸八节之日，此皆上元朝宴之时，不必须待本命日，尔乃行事也。 夫十转隐经之时，皆太一监察，司命定生，万灵混合，帝君凝形，三宫会真，九房受灵。 是其夕也，当有玄感妙应，灵瑞吉祥，然后八素郁躯，三元授真也。 夫修此之道，惟使精专，存真念气，心诚苦密，忧乐轗轲，不忘於至道，然后冥感易会，法轮速升，晨登太霄，飞行阴房矣。 若乃情散万念，精诚不固，形尸秽浊，心无至慕，犯慢灵禁，动违科素者，则帝君纠其罪，祸败缠其躯，己身无仙冀，七玄更被囚，魂鬼入风火，年劫增其尤，奉禁者灵仙，犯违者身诛也。 道士体不平和，觉疾病之处，可隐静别室，启乞神明，求得解脱愆罗及七玄之罪，听得转经，存念真气，礼祝如法。 施行都毕，乃静身安寝，自然魂胎内固，三关受灵，邪毒散出，体夷气平。 既悟之后，觉身体康宁，都无复痾疾矣。 若他人疾病，有诸急难之地，皆听为转经。 当先启告神灵，北向再拜，说某名字於玉清琼元君，求得上解某愆及七祖之罪，济生十方，身勉八难，然后烧香隐诵，祝请如法，大福皆应身。 登斋入室，七日转经，名曰大混百神，朝会帝一，解愆脱罗，摄生济厄，无不受恩。 此玉帝上法，不可轻履尸秽，及干冒淹浊，三天察过，罪同漏泄，慎之慎之。 上清高上灭魔洞景金元玉清隐书经竟",
      "translated_text": "The Jade Clarity’s Hidden Scripture, the Hidden Feathered Classic—also named the Cavernous Radiance Golden Mystery—is the secret treasure of the Jade Emperor. To practice this method, one must first perform the Great Unification of the Hundred Spirits, mastering the transformations of yin and yang and the Supreme Unity’s Upper Dao, before proceeding further. These sacred verses are the precious scrolls of emperors and sovereigns, untying the knotted bonds of the seven ancestors, safeguarding the myriad spirits within the primordial womb, and gathering the life-Dao from the ten directions, their numinous resonance ascending to fill the heights.\n\nOnce the ten thousand cycles are complete, the body shines with golden dawn. Then, wondrous radiance subtly stirs, lingering upon the cloud-wheels; the jade bells chime in the Great Empyrean, and the perfected take their places among the Upper Immortals. Thus, in every movement and stillness, one must not neglect its weighty purpose.\n\nOn the day of one’s natal destiny, purify the fast and enter the chamber. Burn incense to the left and right, face north, and bow twice. Then, with the heart fixed upon the Jade Emperor and the Primordial Lady of the Jade Clarity, seek deliverance from the transgressions of the Seven Mysteries and petition for one’s own immortality. When finished, sit upright and recite the scripture.\n\nAfter reciting the scripture three times, read once the *Highest Jade Emperor’s Divine Wisdom for Annihilating Demons*. That evening, perform ten recitations of the Hidden Scripture and four readings of the *Divine Wisdom*. Upon completion, close the eyes, inwardly gaze, calm the spirit, and regulate the qi. Sit or lie as one wishes, then knock the teeth thirty times and softly intone the prayer:\n\n*\"Great Wisdom of the Five Emperors, this is the Hidden Mystery.\nTen cycles and four returns—annihilate demons, summon the perfected.\nSeven spirits unite in harmony; the Great Unification gathers the Five Spirits.\nJade resonance shakes the Eight Directions; the Upper Primordial’s Seven Mysteries.\nMysterious wind scatters the gates, fanning away the roots of the womb.\nEternally safeguard the fetal infant, eternally receive the true immortals.\nAscend to the Upper Clarity, to the Jade Emperor’s celestial chariot.\"*\n\nThen knock the teeth thirty times again and swallow saliva ten times. Thereupon, the hundred spirits assemble, the five viscera become tranquil, the Imperial Lord rejoices, the Great Unity preserves life, the body is purified, the qi is fortified, the hun is softened, the po is pacified, the Director of Destinies records one’s fate, and the Royal Elder inscribes one’s name. No one may weep for oneself; the flying wheel ascends to the Jade Clarity. The knots of the womb unravel, the Eight Radiance unite in form, great fortune entwines, and the Seven Mysteries share in glory.\n\nWhen the ten recitations are complete, bow to the four directions in reverence of the wondrous and exalted spirits. Those who maintain long fasts, sever worldly ties, purify the body, and wear clean garments may dwell in seclusion and recite daily. Alternatively, on the days of *jiǎzǐ* or the eight solar terms—times of the Upper Primordial’s courtly feasts—one need not wait for the natal destiny day to proceed.\n\nDuring the ten recitations of the Hidden Scripture, the Great Unity oversees, the Director of Destinies determines life, the myriad spirits merge in unity, the Imperial Lord solidifies form, the Three Palaces convene with the perfected, and the Nine Chambers receive the numinous. On that night, wondrous responses and auspicious signs will manifest, whereupon the Eight Purities will envelop the body, and the Three Primordials will confer perfection.\n\nIn practicing this Dao, one must focus the essence, preserve the true, and concentrate the qi. With a sincere and earnest heart, enduring hardship and adversity without forgetting the Supreme Dao, subtle resonance will readily converge, the Dharma-wheel will swiftly ascend, and at dawn, one will ascend to the Great Empyrean, soaring through the chambers of yin.\n\nIf, however, the mind scatters into myriad thoughts, sincerity falters, the body remains defiled and impure, the heart lacks supreme longing, and one violates the numinous prohibitions or transgresses the sacred statutes, then the Imperial Lord will censure one’s sins, calamity will entwine the body, no hope of immortality will remain, the Seven Mysteries will be further imprisoned, the hun and po will enter wind and fire, and the kalpas will multiply one’s transgressions. Those who uphold the prohibitions become numinous immortals; those who violate them face execution.\n\nIf a Daoist’s body is unwell and illness is perceived, one may seclude oneself in a separate chamber, invoke the divine luminaries, and seek deliverance from the entanglements of transgressions and the sins of the Seven Mysteries. Upon receiving permission to recite the scripture, visualize the true qi and perform the rites and prayers as prescribed. When all is done, calm the body and rest. Naturally, the hun and fetal spirit will be fortified within, the Three Passes will receive the numinous, evil toxins will disperse, and the body and qi will become tranquil. Upon awakening, the body will be healthy and at peace, free from all illness.\n\nIf others are afflicted with illness or face dire straits, one may recite the scripture on their behalf. First, invoke the divine luminaries, face north, bow twice, and state the person’s name to the Primordial Lady of the Jade Clarity. Seek deliverance from their transgressions and the sins of their seven ancestors, salvation for the living in the ten directions, and relief from the eight difficulties. Then burn incense, recite the scripture in seclusion, and perform the prayers as prescribed. Great fortune will manifest in the body.\n\nEntering the fast and secluding oneself for seven days to recite the scripture is called the *Great Unification of the Hundred Spirits*, the audience with the Imperial Unity, the deliverance from transgressions and entanglements, the gathering of life and salvation from peril—none will fail to receive grace. This is the supreme method of the Jade Emperor. One must not tread upon it with a defiled or impure body, nor profane it with contamination. The Three Heavens will察 transgressions, and the punishment will be equal to that for leaking secrets. Be cautious, be cautious.\n\nThe *Highest Upper Clarity Scripture of the Jade Emperor’s Cavernous Radiance Golden Primordial Hidden Book for Annihilating Demons* ends here.",
      "overlap_context": "d Capital. Governing the Six Abysses, inscribing names in the Eight Jades. Five penetrations and seven unions; the Three Qi unite at last. Myriad branches of layered splendor—eternally preserving the immortal spirits. Grasping the jade talismans, ascending to the feathered court. Circling winds merge in transformation; the Jade Emperor’s Hidden Scripture. Long bound in singular destiny, the supreme vow must be fulfilled. Receiving the Emperor’s grace, ascending to pay homage in the Jade Clarity.",
      "start_char": 3257,
      "end_char": 4249,
      "start_sentence": 58,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.613147497177124,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上灭魔洞景金元玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}