{
  "source_id": "上清侍帝晏桐柏真人真图赞",
  "source_file": "chunked_daozang\\上清侍帝晏桐柏真人真图赞.json",
  "total_chunks": 7,
  "total_original_chars": 3782,
  "total_translated_chars": 23565,
  "total_translation_time": 124.04582285881042,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\赞颂类\\上清侍帝晏桐柏真人真图赞.txt",
    "category": "赞颂类"
  },
  "full_translation": "**Hymn of Praise to the Perfected Portrait of the Supreme Clarity Attendant of the Celestial Dawn, the Perfected One of Tung-pai**\n\n*Title:* *Hymn of Praise to the Perfected Portrait of the Supreme Clarity Attendant of the Celestial Dawn, the Perfected One of Tung-pai*\n*Compiled by:* Sima Chengzhen of the Tang Dynasty\n*Volume:* One\n*Source:* *Daoist Canon of the Zhengtong Era*, Section of Mysteries, Category of Hymns and Praises\n\n---\n\n**Hymn of Praise to the Perfected Portrait of the Supreme Clarity Attendant of the Celestial Dawn, the Perfected One of Tung-pai**\n*Recorded by:* Sima Chengzhen of White Clouds on Mount Tiantai\n\nThose who attain the Dao and achieve perfection may conceal or reveal themselves. Ascending to spirit and transforming their form, they follow many arts and many paths. The Great Lord Mao left his kin to enter the sacred peaks, and when his immortal work was complete, he returned, riding a chariot of clouds in broad daylight. The Master of High Mound prepared his body to evade the world, and once his elixir was perfected, he did not return, driving dragons and cranes to wander the luminous realms and ascend in secret. Such wondrous and subtle manifestations serve to reward the diligence of Daoist scholars, while those who perish in the mundane world may cease their longing for separation in life. Some are bound by fate to differing destinies of light and shadow, and their course cannot be altered. Others, by nature, delight in distinctions of speech and silence, and reason allows them to follow their own inclination. The comings and goings of ancient immortals encompass both revelation and concealment, yet the records of their time rarely capture their depths. Thus, accounts may repeat or vary, and only by harmonizing their subtle shifts can one grasp their ultimate subtlety.\n\nThe Perfected One of Tung-pai, Lord Wang, was the Crown Prince Jin of King Ling of Zhou. According to the *Records of the Grand Historian*, the prince was sagely but died young. Yet the *Biographies of the Immortals* states that he concealed himself and ascended as a transcendent. These two accounts differ, but there is reason for it. The Grand Historian’s official history records his early death, while the Daoist scriptures document his later ascension as an immortal. Though the accounts of true immortals seem contradictory, even in the same era, the divergence between self and other, like tiles and jade, spans generations. Moreover, he was endowed with numinous *qi* from past lives, having long cultivated it before. Borrowing the womb of a mortal, he briefly embodied this world. As a child, he was already sagely—proof of his long-cultivated nature. At birth, he bore a beard—evidence of his former appearance. Refining his spirit to the subtlest realms, he eluded the riddles of immortality and the constraints of fate. He knew that the Emperor’s single act was a sign of his ethereal destiny, and he awaited Master Kuang’s three-year prophecy. He explained to the Emperor the intent behind his ephemeral form—how could he willingly abandon his soul? Yet Master Kuang’s cautious words on short-lived mortals made clear that he was not fated to die. Thus, he swiftly departed the mortal realm to return to the immortal realm, valuing true transcendence over the crown prince’s station. He lingered by the Luo River to compose his thoughts, delighting in the carefree melodies of his flute. Moved by the descent of Fu Qiu, he received the wondrous methods of transcending the world. Thus, he shed his form to feign death and withdrew to the mountains to cultivate the Dao. On the day he spread his wings, he bid farewell to the world and soared into the heavens. That he first died and later ascended as an immortal is no cause for doubt.\n\nFor this reason, the tomb at Jingling, though ancient, opened to reveal a flying sword. The shrine of the Ji clan stands to this day, its spirit still present. The means of his transformation and ascension are clearly evident in principle and fact.\n\nChengzhen, having long dwelled on Mount Song, admired the lofty seclusion of mountains and forests. Whenever he visited the temple halls, he revered the lingering numinous traces. Facing the wind and landscape with an empty heart, he recalled the seven days as if they were yesterday. Gazing at the clouds and sky with profound longing, he looked up to the Three Clarities and their boundless mystery. Later, by decree of the Jade Dawn, he was honored with the rank of Attendant and Right Assistant, assuming the office of the Golden Court to ascend the renowned mountain of Tung-pai. As overseer of the Five Peaks, he was served by all spirits. Where the Eight Caves converge, immortals gather in assembly. Zhou Ziyang received the talisman of plain melody, while Xia Mingchen was entrusted with the Yellow Water method. Those who shared a deep affinity transmitted secret instructions to fellow Daoists, while those who returned in sincerity revealed the hidden paths to the extraordinary courts. The numinous cavern was truly wondrous, and the Cinnabar Waters perfected the realm of the divine. The blessed land was marked by marvels, and yellow clouds shrouded the land of immortality. Forests, dwellings, and rock chambers provided resting places, while stone bridges and towering peaks recorded his ascents and wanderings. Thus, he sought the secluded and towering, making his abode in quietude. Embracing stillness and emptiness, he rarely engaged the senses. Studying the biographies of immortals, he traced the origins of the Yi and Luo. Revisiting the *True Declarations*, he admired the descent of the Hua Yang Perfected. With light brush and ink, he respectfully rendered their portraits. Daring to compose this hymn of praise, he hoped to express his sincere devotion.\n\nNow, he burns incense to open the celestial vaults within the plain scrolls. Inwardly listening to the *qi* and contemplating, he offers his luminous presence to the Crimson Palace.\n\nFrom his time in the world to his ascension as a perfected one, he created eleven portraits, compiling them into this single volume.\n\n**Hymn of Praise to the Perfected Portrait of the Supreme Clarity Attendant of the Celestial Dawn, Right Assistant and Overseer of the Five Peaks, the Perfected Lord Wang, the Immortal of Tung-pai**\n\n**First Portrait:**\nIn the twenty-third year of King Ling of Zhou, the Gu and Luo rivers threatened to destroy the royal palace. The king wished to dam them. The Crown Prince admonished him, saying: \"This must not be done. I have heard that the ancient rulers of the people did not level mountains, did not fill marshes, did not block rivers, and did not drain wetlands. Furthermore, it is said: 'Those who rise must have the merit of Yu and Lü; those who fall must bear the failure of Gong and Gun.'\"\n\n\"Now that I hold office, is it not true that I must indeed have some fault? Yet by disturbing the great spirits of the two rivers, I have caused them to vie in their brilliance and harm the royal palace. If the king adorns this, is it not impermissible?\n\nFurthermore, it is said: 'Those who assist in offerings will be tasted; those who assist in breaches will be harmed.' If the king dams the state’s rivers to adorn the palace, this is assisting the state’s ruin. Will this not manifest disaster and bring about harm?\n\nSince the time of our former kings—Li, Xuan, You, and Ping—greed has invited heavenly calamity, and it has not yet ceased. If I now manifest it further, I fear it will extend to our descendants and the royal house, becoming ever more debased.\"\n\nThe king ultimately dammed the rivers. Later, King Jing favored many sycophants, and disorder began from this. When King Jing passed, the royal house fell into great chaos. By the time of King Zhen Ding, it had become truly base.\n\nThe painting depicts the palaces and gates of the Zhou court, the Gu and Luo rivers converging, and the gradual ruin of the royal precincts. Palace attendants, bearing earth on their backs, seek to dam the rivers. The Crown Prince, clad in full regalia, stands before King Ling to remonstrate.\n\n**Hymn of Praise:**\n\nEndowed with divine youth and sagely wisdom, he succeeded with radiant brilliance and keen discernment. He admonished against damming the waters, earnestly remonstrated against palace embellishments—yet how was his counsel not heeded? Instead, greater works were undertaken. His forewarnings of calamity and ruin proved true, leading indeed to baseness and destitution.\n\nSecond: When Duke Ping of Jin sent Shu Yu to Zhou, he met the Crown Prince and spoke with him. After five praises and three refusals, Shu Yu withdrew in hesitation, his words unfulfilled. Returning, he told the Duke: \"The Crown Prince is fifteen years of age, yet I could not converse with him.\" Then Master Kuang said: \"Let your servant go blind and attend him.\" Arriving, he asked about the conduct of the noble man, the virtue of Yao and Shun, and what makes kings and lords esteemed or debased. He further inquired about warmth, reverence, sincerity, and diligence—how unchanging virtue unfolds things from their beginning, how learning below ascends to the imperial dawn, and who since ancient times has equaled the Son of Heaven. The Crown Prince answered each question with clarity and reasoned eloquence. Master Kuang, struck with awe, stamped his feet and exclaimed: \"Excellent! Excellent!\" Then, with a start, he rose and said: \"Though blind, your servant begs leave to return.\" The Crown Prince asked: \"I hear you discern a person’s lifespan—pray tell me mine.\" Master Kuang replied: \"Your voice is clear yet impure, your complexion red and pale like fire—you will not live long.\" The Crown Prince said: \"In three years, I shall ascend as a guest to the Emperor’s abode. Be cautious in speech, lest misfortune befall you.\" Master Kuang returned home and died within three years.\n\nThe painting depicts the Eastern Palace’s halls, the Crown Prince seated within, and the exchanges with Shu Yu and Master Kuang. Master Kuang is shown stamping his feet in admiration.\n\n**Hymn of Praise:**\n\n**Hymn of Praise:**\nHis learning vast and penetrating, his discourse on things profound and lucid.\nShu Yu was left speechless, Master Kuang could not refute.\nHe divined the hidden wonders of the spirit, misjudged the essence of voice and form.\nThe guest’s ascent to the Emperor’s abode had its appointed time—how could the blind seer fathom it?\nThe *Liexian Zhuan* states: The Crown Prince loved to play the sheng, mimicking the phoenix’s cry. Roaming between the Yi and Luo rivers, the Daoist Master Fuqiu met him and led him up Mount Songgao. At that time, Fuqiu had just descended to transmit secret arts; once his practice was complete, he planned to feign death and achieve liberation through *shijie*. Thus he foretold to Master Kuang the three-year term.\nThe painting depicts the Crown Prince playing the sheng, roaming by the Yi and Luo, and Master Fuqiu descending to receive him.\n\n**Hymn of Praise:**\nHis rank lodged in the heir’s palace, his name inscribed in the halls of immortals.\nHis aspirations soared to the Milky Way, his heart wearied of city walls.\nHe tuned his sheng to the phoenix’s song, yearning for truth by the Luo’s banks.\nFuqiu descended to bestow his teachings, entrusting his form to liberation.\nWhen he told Master Kuang, “In three years, I shall ascend as a guest to the Emperor’s abode,” he meant that within three years, he would first achieve *shijie* before ascending as a guest to the Emperor—hence his veiled prophecy.\nThereupon, he secretly shed his form, leaving only a sword and a crow; his true body concealed, he withdrew to Mount Song. To make his kin forget the pain of parting, he feigned death to sever their longing. The Dao is not easily attained—only through accumulated study does one ascend as an immortal.\nThe painting shows the palace halls, the Crown Prince’s outward death, the ministers’ wailing, and the Crown Prince journeying southeast with Fuqiu toward Mount Songgao.\n\n**Hymn of Praise:**\nHis sword and staff held arcane arts, his talismans and elixirs myriad in method.\n\nBefore his form had fully transformed, he silently examined his molted essence.\nSeeking a master to extend the Dao, he bid farewell to kin and love alike.\nSecluded in the mountains, he found ease; the tomb’s sorrow was but a fleeting grief.\n\nFifth Record states: Fuqiu Gong received him on Mount Songgao for over thirty years. Later, when sought in the mountains, he appeared to Huan Liang, saying, “Tell my family: on the seventh day of the seventh month, await me at the summit of Weishi Mountain.”\nThe Crown Prince concealed himself on Mount Songgao, studying under Fuqiu Gong.\nThrough concentrated meditation, he refined his spirit; through elixirs, he transformed his substance.\nOnce his Daoist practice was complete, the time for his immortal ascension drew near.\nThus he emerged to meet Huan Liang, bidding him inform his family.\nThe painting depicts Mount Songgao, where he pursued his studies—\namidst rocky forests and dwellings, scriptures and alchemical crucibles lay in solemn order, with Fuqiu Gong seated among them.\nBefore the altar, a platform was raised, where the Prince sat in meditation, burning incense and refining his spirit.\nAnother scene shows the Prince emerging from the mountain, then meeting Huan Liang in conversation.\n\n**Hymn of Praise:**\nDwelling in the mountains, he concealed his traces, studying the Dao to refine his form.\nYears passed, spanning decades, as his practice aligned with the numinous.\nHe foretold the seventh day, when he would ascend to the Three Clarities.\nHuan Liang returned with the message, and the kingdom awaited his arrival.\n\nSixth Record states: Indeed, he mounted a white crane and alighted upon the mountain’s peak. Gazing from afar, none could approach; he raised his hand in farewell to the people of his time, lingering for days before departing.\nA shrine was erected on Weishi Mountain—first, he feigned death and concealed himself; later, he revealed his immortality.\nHis divine transformations knew no bounds; his spiritual changes followed their own course.\nThus he could descend to bid farewell to the people of Hou, raising his hand to leave a trace of affection.\nAscending to the clouded heavens, he rode the crane into the vanishing light.\nThe people of his time cherished his lingering traces, preserving them in a shrine.\nHis sacred image could be passed to later generations, for his spirit and qi remained.\nThe words of Master Kuang on his untimely end were like the clam and oyster;\nthe Crown Prince’s prophecy of ascending as a guest to the Emperor was now as clear as the tortoise and crane.\n\nThe painting shows the Prince riding a crane, alighting upon the summit of Weishi Mountain, raising his hand in farewell to the people of his time.\nIt also depicts the imperial procession of the Zhou kingdom, along with the gathered crowds, gazing from afar yet unable to approach—\nand the Prince, guiding the crane as he ascends to heaven.\n\n**Hymn of Praise:**\nHe captivated the kingdom, perching his crane upon the mountain’s peak.\nFrom afar, he raised his hand in farewell, forever severing the bonds of mortal years.\nLingering for days, he left traces of affection, then soared through the Three Heavens.\nHis solitary carriage roamed boundlessly, while the multitude was left in sorrowful longing.\n\nThe Seventh Heaven of Supreme Clarity, the Highest Sage, the Supreme Jade Dawn, the Mysterious August Lord of the Great Dao—\nHe is the sovereign of the myriad Dao, revered by all perfected beings, the foundation upon which the world’s teachings rest.\nThose who attain the Dao and ascend as immortals must journey to the Golden Portals to pay homage and receive their celestial duties.\nThere, offices are divided and ranks assigned according to the depth of virtue and merit; vestments and ritual forms follow the hierarchy of grades and bestowals.\nThus, crowns differ in design, staffs in color; chariots and canopies vary in form, dragons and cranes serve as distinct mounts—\nall ordered by degree to facilitate ascent and descent.\nHerein, the Prince reverently received the sacred decree.\nThe painting depicts the celestial palaces of the Supreme Clarity Heaven, portraying the Lord of the Dao in form.\nPerfected beings stand in attendance, two youths at his side, together bearing a tray upon which rests a jade tablet.\nAnother perfected one stands aside, proclaiming the decree to the Prince.\n\n**Hymn of Praise:**\nForm and sound enter the wondrous, the Dao perfected to ascend as true.\nPaying homage at the Golden Portals, receiving the jade decree from the Jade Dawn.\nVirtue and merit thus established, office and rank duly observed.\nRituals aligned in reverence, spirit congealed through ten thousand kalpas.\n\nThe Eighth: At the Golden Portals, the Prince knelt to receive his investiture, bestowed with the title:\n*Attendant to the Emperor of the Dawn, Overseer of the Five Peaks, Right Assistant to the Perfected of Paulownia-Cypress.*\nHaving received the sacred decree, he prepared to depart for the Grotto Palace.\nFeathered staffs led the way, rainbow banners followed behind; the dragon chariot descended in splendor, the crane’s reins circled in flight.\nDivine immortals stood in attendance, reed pipes and flutes played in harmony.\nDescending through the Great Clarity upon clouds, he steered toward the Grotto Heavens, his carriage steady.\nTruly, the numinous power of the Dao and the grandeur of the celestial procession were a magnificent sight.\nThe painting shows the Prince riding a cloud chariot with a feathered canopy, divine immortals in escort, banners and staffs leading the procession.\nDragons and cranes soar in flight as they descend from heaven, bound for the Grotto Palace of Paulownia-Cypress Mountain.\n\n**Hymn of Praise:**\nThe bestowed decree received, feathered regalia complete.\nHelmets and armor gleam upon the floating carriage, dragons and cranes race with reins.\nBanners and staffs lead the procession, immortal gatherings assemble in splendor.\nDescending from heaven by celestial steps, gazing toward the mountain to assume his post.\n\nThe Ninth: Mount Tiantai, also called Paulownia-Cypress Mountain.\nWithin the mountain lies a grotto palace named the Golden Court, where radiant essence lingers at dawn, its light illuminating the grotto realm.\nJasper terraces and jade chambers gleam with clarity, their halls resplendent.\nIts springs flow with stone marrow and golden essence; its trees bear jade buds and lush verdure.\nTruly, it is a blessed realm for nurturing the true, a numinous dwelling for attaining the divine.\nHere the Prince dwells, governing the hidden and manifest, serving as assistant to the Emperor of the Dawn.\nAt times, he attends court and oversees the affairs of the Five Peaks.\nAll spirits receive their duties in this place.\nThe painting depicts Paulownia-Cypress Mountain and the Golden Court Grotto Palace.\nThe Prince sits within the palace, surrounded by immortal attendants.\nThe Lords of the Five Peaks, each leading their subordinate spirits, come to pay homage.\n\n**Hymn of Praise:**\nThe mountain holds a jade grotto, the palace named Golden Court.\nThe Nine Heavens align in resonance, the Three Dawns conceal their essence.\nServing the Emperor in this duty, assisting the Perfected in steadfastness.\nOverseeing the Five Peaks, commanding the hundred spirits.\n\nThe Tenth: The Perfected of Purple Yang, Zhou Jishan, once entered Paulownia-Cypress Mountain.\nThere, he encountered the Perfected Prince Wang, who bestowed upon him a plain memorial inscribed with cinnabar talismans.\nLater, the Attendant of the Luminous Dawn, Xia Fu, entered Paulownia-Cypress Mountain and met the Perfected Prince Wang, who taught him the method of the Yellow Water and Cloud Elixir.\nThe painting shows the Perfected Zhou Jishan, clad in the robes of a Daoist, on Paulownia-Cypress Mountain.\nHe meets the Perfected Prince Wang, who holds in his left hand a plain memorial with cinnabar talismans, about to bestow it upon Zhou.\nZhou kneels in reverence to receive it.\nAnother scene depicts Xia Fu in ancient attire, encountering the Prince.\nThe Prince holds a scroll, about to present it to Xia, who kneels with both hands raised to accept it.\nBoth Zhou and Xia are dressed as mountain recluses, each with a staff placed beside them, kneeling upon the stone before the Prince.\nThe Prince wears the robes of a perfected being, accompanied by three to five immortal attendants at his side.\n\n**Hymn of Praise:**\nZhou sought the Dao, receiving the cinnabar talismans.\nXia pursued immortality, mastering the Yellow Water’s mysteries.\nRefining form through wondrous arts, none achieve without a teacher.\nHidden resonance thus connects, the appointed hour may be awaited.\n\nThe Eleventh: In the third year of the Xingning era of the Jin dynasty, a Daoist practitioner named Yang resided on Mount Mao, where his earnest devotion summoned many perfected beings to descend and bestow teachings.\nOn the twenty-sixth day of the sixth month of that year, the Perfected Prince Wang of Paulownia-Cypress, accompanied by other perfected beings, descended to Yang’s dwelling—but did not speak to him.\nYang recorded the event, noting: *There was one whose youthful appearance was extraordinary.\nHe wore a lotus crown, a crimson robe adorned with white pearls, and a sword at his waist.\nLater, he spoke much of the affairs of Golden Court Mountain.*\nThe perfected beings then proclaimed:\n*\"The Eight Vastnesses and Four Extremes are distant and boundless, their numinous shores remote.\nWondrous words sprout like buds, jade tones resound with brilliance.\nAt dawn, they soar through the clouds; pure and mysterious qi gathers.\nBestowed with office in the Jade Void, the heart sheds its burdens.\nMired beyond the subtle net, harmony congeals beyond the still waves.\nThose who attain this shall surely ascend the vast heavens, traversing the true courts.\nThe Three Primes may be seen, and immortal names may be established.\nBut if the heart is reckless and wandering, the eyes fixed upon sensual forms—\nif in motion one shares the fate of nets and snares, in stillness contends with strife—\nthen the path to immortality remains distant, and the span of life grows ever more constrained.\nTake heed, and be vigilant.\"*\nThey further proclaimed:\n*\"Those who possess the Dao must delve deeply into its numinous mysteries, dwelling in the heart beyond worldly affairs.\nIf one merely savors diligence in trivial matters, clinging to the dregs of the world, it is but a fleeting indulgence.\"*\nThey also descended with songs and verses, which are not recorded here in full.\nThe painting depicts Yang on Mount Mao, at the altar where he practiced the Dao.\nThe Perfected Prince Wang descends to meet him, wearing a lotus crown, a crimson robe adorned with white pearls, and a sword at his waist.\nYang holds paper and brush before him, recording the event.\nHis robes follow the style of a true immortal, and his sword is depicted according to the patterns described in the scriptures.\n\n**Hymn of Praise:**\nThe true immortals are not distant; resonance is but a thread of subtlety.\nAnswering the hidden resolve, they descend in numinous form.\n\n\"True teachings are set forth in words,\nboth in hymns and in narratives.\nThe vision does not linger long—\nthe pure and true return to the One.\nHere ends the *Hymn of Praise to the Perfected Portrait of the Upper Clarity’s Attendant to the Celestial Emperor, the True Person of Tongbai.*\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清侍帝晨桐柏真人真图赞 经名：上清侍帝晨桐柏真人真图赞。 唐司马承祯编撰。 一卷。 底本出处：《正统道藏》洞玄部赞颂类。 上清侍帝晨桐柏真人真图赞 天台白云司马承祯录 夫得道成真，有隐有显。 跻神化质，多术多途。 大茅君辞亲入岳，仙业备而归来，坐致旖舆。 白日轻举。 高丘子办形避世，丹药就而不返。 行驭龙鹤，逛景潜升。 见灵妙者，以．奖诸道学之勤。 混终碎者，以息其生离之望。 或命分有照冥之异，事不可违。 或性乐有语默之殊，理从自适。 古仙出处，兼此显晦。 时人记传，罕能详测。 故迩有再三，述有前后。 会通机变，方知至妙焉。 桐柏真人王君，即周灵王之太子，子晋也。 按史记云：太子圣而早卒。 据列仙传曰：隐而登仙。 两说不同，盖有由矣。 司马公述乎国史，刘子政验以道书。 国史载其前卒之踪，道书着其后仙之事。 真仙相反，尚见异於同时。 彼我相违，瓦与悬於数纪。 且其特禀灵气，已积习於前生。 假孕人胎，暂应身於此世。 幼而通圣，是习性之久也。 诞而有髭，是身貌之昔也。 炼神入微，谜仙促限。 知宾帝之一举，期师旷於三载。 说宾帝乃冲形之旨，岂肯沈魂。 诚师旷慎不寿之言，明知弗天。 良以早毙人间，遽还仙境。 轻此储位，重彼真仙。 游洛川以伫怀，畅笙歌之逸韵。 感浮丘而降接，传出世之奇方。 故能蜕形示终，隐山学道。 振羽之日，谢时冲天。 其初卒后仙，亦不足疑怪也。 是以京陵之墓，经古启而剑飞。 维氏之祠，迄今立而神在。 化升之致，事理昭然。 承祯早处嵩岳，慕山林之抗边。 每谒堂庙，钦影响之余灵。 对风景而虚心，怀七日之如昨，瞻云天而悠思，仰三清之又玄。 复以玉晨策命，当侍弼之荣秩。 金庭宰职，赴桐柏之名山。 五岳是司，群神所奉。 八洞交会，诸仙游集。 周紫阳受素奏之符，夏明晨禀黄水之法。 密契者，传秘诀於同道。 归诚者，告幽逦之殊庭。 灵墟信奇，丹水济成神之域。 福地旌异，黄云霭不死之乡。 林宇岩房，存诸柄憩。 石梁峰阙，纪其登游。 所以负岌幽寻，为室静处。 希夷尚阀，视听罕通。 乃观仙传，追伊洛之发边。 复披真诰，慕华阳之降形。 轻运丹青，敬载图象。 敢为赞述，庶表诚心。 方以焚香启骯，窥天洞於素牒。 听气内思，奉光仪於绛府。 自以在世，迄于升真。 凡有一十一图。 纂成一卷。 上清侍帝晨，领五岳司，右弼桐柏真人王仙君真图赞。 第一，周灵王二十三年，谷洛二水国，将毁王宫，王欲壅之。 太子谏曰：不可。 晋闻古之长民者，不堕山，不崇薮，不防川，不窦泽。 又日：其兴者，必有夏吕之功焉。 其废者，必有共鲧之败焉。",
      "translated_text": "**Hymn of Praise to the Perfected Portrait of the Supreme Clarity Attendant of the Celestial Dawn, the Perfected One of Tung-pai**\n\n*Title:* *Hymn of Praise to the Perfected Portrait of the Supreme Clarity Attendant of the Celestial Dawn, the Perfected One of Tung-pai*\n*Compiled by:* Sima Chengzhen of the Tang Dynasty\n*Volume:* One\n*Source:* *Daoist Canon of the Zhengtong Era*, Section of Mysteries, Category of Hymns and Praises\n\n---\n\n**Hymn of Praise to the Perfected Portrait of the Supreme Clarity Attendant of the Celestial Dawn, the Perfected One of Tung-pai**\n*Recorded by:* Sima Chengzhen of White Clouds on Mount Tiantai\n\nThose who attain the Dao and achieve perfection may conceal or reveal themselves. Ascending to spirit and transforming their form, they follow many arts and many paths. The Great Lord Mao left his kin to enter the sacred peaks, and when his immortal work was complete, he returned, riding a chariot of clouds in broad daylight. The Master of High Mound prepared his body to evade the world, and once his elixir was perfected, he did not return, driving dragons and cranes to wander the luminous realms and ascend in secret. Such wondrous and subtle manifestations serve to reward the diligence of Daoist scholars, while those who perish in the mundane world may cease their longing for separation in life. Some are bound by fate to differing destinies of light and shadow, and their course cannot be altered. Others, by nature, delight in distinctions of speech and silence, and reason allows them to follow their own inclination. The comings and goings of ancient immortals encompass both revelation and concealment, yet the records of their time rarely capture their depths. Thus, accounts may repeat or vary, and only by harmonizing their subtle shifts can one grasp their ultimate subtlety.\n\nThe Perfected One of Tung-pai, Lord Wang, was the Crown Prince Jin of King Ling of Zhou. According to the *Records of the Grand Historian*, the prince was sagely but died young. Yet the *Biographies of the Immortals* states that he concealed himself and ascended as a transcendent. These two accounts differ, but there is reason for it. The Grand Historian’s official history records his early death, while the Daoist scriptures document his later ascension as an immortal. Though the accounts of true immortals seem contradictory, even in the same era, the divergence between self and other, like tiles and jade, spans generations. Moreover, he was endowed with numinous *qi* from past lives, having long cultivated it before. Borrowing the womb of a mortal, he briefly embodied this world. As a child, he was already sagely—proof of his long-cultivated nature. At birth, he bore a beard—evidence of his former appearance. Refining his spirit to the subtlest realms, he eluded the riddles of immortality and the constraints of fate. He knew that the Emperor’s single act was a sign of his ethereal destiny, and he awaited Master Kuang’s three-year prophecy. He explained to the Emperor the intent behind his ephemeral form—how could he willingly abandon his soul? Yet Master Kuang’s cautious words on short-lived mortals made clear that he was not fated to die. Thus, he swiftly departed the mortal realm to return to the immortal realm, valuing true transcendence over the crown prince’s station. He lingered by the Luo River to compose his thoughts, delighting in the carefree melodies of his flute. Moved by the descent of Fu Qiu, he received the wondrous methods of transcending the world. Thus, he shed his form to feign death and withdrew to the mountains to cultivate the Dao. On the day he spread his wings, he bid farewell to the world and soared into the heavens. That he first died and later ascended as an immortal is no cause for doubt.\n\nFor this reason, the tomb at Jingling, though ancient, opened to reveal a flying sword. The shrine of the Ji clan stands to this day, its spirit still present. The means of his transformation and ascension are clearly evident in principle and fact.\n\nChengzhen, having long dwelled on Mount Song, admired the lofty seclusion of mountains and forests. Whenever he visited the temple halls, he revered the lingering numinous traces. Facing the wind and landscape with an empty heart, he recalled the seven days as if they were yesterday. Gazing at the clouds and sky with profound longing, he looked up to the Three Clarities and their boundless mystery. Later, by decree of the Jade Dawn, he was honored with the rank of Attendant and Right Assistant, assuming the office of the Golden Court to ascend the renowned mountain of Tung-pai. As overseer of the Five Peaks, he was served by all spirits. Where the Eight Caves converge, immortals gather in assembly. Zhou Ziyang received the talisman of plain melody, while Xia Mingchen was entrusted with the Yellow Water method. Those who shared a deep affinity transmitted secret instructions to fellow Daoists, while those who returned in sincerity revealed the hidden paths to the extraordinary courts. The numinous cavern was truly wondrous, and the Cinnabar Waters perfected the realm of the divine. The blessed land was marked by marvels, and yellow clouds shrouded the land of immortality. Forests, dwellings, and rock chambers provided resting places, while stone bridges and towering peaks recorded his ascents and wanderings. Thus, he sought the secluded and towering, making his abode in quietude. Embracing stillness and emptiness, he rarely engaged the senses. Studying the biographies of immortals, he traced the origins of the Yi and Luo. Revisiting the *True Declarations*, he admired the descent of the Hua Yang Perfected. With light brush and ink, he respectfully rendered their portraits. Daring to compose this hymn of praise, he hoped to express his sincere devotion.\n\nNow, he burns incense to open the celestial vaults within the plain scrolls. Inwardly listening to the *qi* and contemplating, he offers his luminous presence to the Crimson Palace.\n\nFrom his time in the world to his ascension as a perfected one, he created eleven portraits, compiling them into this single volume.\n\n**Hymn of Praise to the Perfected Portrait of the Supreme Clarity Attendant of the Celestial Dawn, Right Assistant and Overseer of the Five Peaks, the Perfected Lord Wang, the Immortal of Tung-pai**\n\n**First Portrait:**\nIn the twenty-third year of King Ling of Zhou, the Gu and Luo rivers threatened to destroy the royal palace. The king wished to dam them. The Crown Prince admonished him, saying: \"This must not be done. I have heard that the ancient rulers of the people did not level mountains, did not fill marshes, did not block rivers, and did not drain wetlands. Furthermore, it is said: 'Those who rise must have the merit of Yu and Lü; those who fall must bear the failure of Gong and Gun.'\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1010,
      "start_sentence": 0,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.9436559677124,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\上清侍帝晏桐柏真人真图赞.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "今吾执政，无乃实有所辟。 而滑大二川之神，使至於争明以妨王宫。 王而饰之，无乃不可乎。 又日：佐飨者尝，佐闯者伤。 王将防国川以饰宫，是佐国也。 其无乃章祸，且遇伤乎。 自我先王，厉宣幽平而贪天祸至，于今未弥。 我又章之惧，长及子孙王室，其愈卑乎。 王卒壅之，其后景王多宠人，乱於是乎始生。 景王崩，王室大乱。 及贞定王，遂卑。 图画周朝宫阙，作谷洛二水相合，而闻稍毁。 宫城处人，夫负土欲壅此川。 作太子具冠服立於灵王前谏事。 赞曰：",
      "translated_text": "\"Now that I hold office, is it not true that I must indeed have some fault? Yet by disturbing the great spirits of the two rivers, I have caused them to vie in their brilliance and harm the royal palace. If the king adorns this, is it not impermissible?\n\nFurthermore, it is said: 'Those who assist in offerings will be tasted; those who assist in breaches will be harmed.' If the king dams the state’s rivers to adorn the palace, this is assisting the state’s ruin. Will this not manifest disaster and bring about harm?\n\nSince the time of our former kings—Li, Xuan, You, and Ping—greed has invited heavenly calamity, and it has not yet ceased. If I now manifest it further, I fear it will extend to our descendants and the royal house, becoming ever more debased.\"\n\nThe king ultimately dammed the rivers. Later, King Jing favored many sycophants, and disorder began from this. When King Jing passed, the royal house fell into great chaos. By the time of King Zhen Ding, it had become truly base.\n\nThe painting depicts the palaces and gates of the Zhou court, the Gu and Luo rivers converging, and the gradual ruin of the royal precincts. Palace attendants, bearing earth on their backs, seek to dam the rivers. The Crown Prince, clad in full regalia, stands before King Ling to remonstrate.\n\n**Hymn of Praise:**",
      "overlap_context": "*First Portrait:**\nIn the twenty-third year of King Ling of Zhou, the Gu and Luo rivers threatened to destroy the royal palace. The king wished to dam them. The Crown Prince admonished him, saying: \"This must not be done. I have heard that the ancient rulers of the people did not level mountains, did not fill marshes, did not block rivers, and did not drain wetlands. Furthermore, it is said: 'Those who rise must have the merit of Yu and Lü; those who fall must bear the failure of Gong and Gun.'\"",
      "start_char": 1010,
      "end_char": 1224,
      "start_sentence": 78,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.131309986114502,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\上清侍帝晏桐柏真人真图赞.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "禀神幼圣，继明英聪。 咨谏壅水，切净饰宫。 如何不纳，更事修崇。 预言祸败，果致卑穷。 第二，晋平公使叔誉于周，见太子与之言。 五称三穷，遗巡而退，其言不遂。 归告公曰：太子行年十五，而臣不能与言。 又师旷日：臣请暝而往，与之言。 既至乃问君子之行，尧舜之德，又问王侯君何以为尊，何以为下。 又问温恭敦敏，方德不改，开物於初。 下学以起，上登帝晨，乃参天子，自古谁也。 太子皆应声而答，辩拚明理。 师旷罄然，举躅其足日：善哉，善哉。 乃蹙然而起日：暝臣请归。 太子问日：闻女知人年长短，希我告也。 师旷日：女声清污，女色赤白火色不寿。 太子日：后三年，上宾於帝所，女慎无言，殃将及女。 师旷归，未三年而卒。 图画东宫殿宇，作太子坐处，与叔誉、师旷问答事。 其师旷乃举躅其足。 赞曰：",
      "translated_text": "Endowed with divine youth and sagely wisdom, he succeeded with radiant brilliance and keen discernment. He admonished against damming the waters, earnestly remonstrated against palace embellishments—yet how was his counsel not heeded? Instead, greater works were undertaken. His forewarnings of calamity and ruin proved true, leading indeed to baseness and destitution.\n\nSecond: When Duke Ping of Jin sent Shu Yu to Zhou, he met the Crown Prince and spoke with him. After five praises and three refusals, Shu Yu withdrew in hesitation, his words unfulfilled. Returning, he told the Duke: \"The Crown Prince is fifteen years of age, yet I could not converse with him.\" Then Master Kuang said: \"Let your servant go blind and attend him.\" Arriving, he asked about the conduct of the noble man, the virtue of Yao and Shun, and what makes kings and lords esteemed or debased. He further inquired about warmth, reverence, sincerity, and diligence—how unchanging virtue unfolds things from their beginning, how learning below ascends to the imperial dawn, and who since ancient times has equaled the Son of Heaven. The Crown Prince answered each question with clarity and reasoned eloquence. Master Kuang, struck with awe, stamped his feet and exclaimed: \"Excellent! Excellent!\" Then, with a start, he rose and said: \"Though blind, your servant begs leave to return.\" The Crown Prince asked: \"I hear you discern a person’s lifespan—pray tell me mine.\" Master Kuang replied: \"Your voice is clear yet impure, your complexion red and pale like fire—you will not live long.\" The Crown Prince said: \"In three years, I shall ascend as a guest to the Emperor’s abode. Be cautious in speech, lest misfortune befall you.\" Master Kuang returned home and died within three years.\n\nThe painting depicts the Eastern Palace’s halls, the Crown Prince seated within, and the exchanges with Shu Yu and Master Kuang. Master Kuang is shown stamping his feet in admiration.\n\n**Hymn of Praise:**",
      "overlap_context": " King Jing favored many sycophants, and disorder began from this. When King Jing passed, the royal house fell into great chaos. By the time of King Zhen Ding, it had become truly base.\n\nThe painting depicts the palaces and gates of the Zhou court, the Gu and Luo rivers converging, and the gradual ruin of the royal precincts. Palace attendants, bearing earth on their backs, seek to dam the rivers. The Crown Prince, clad in full regalia, stands before King Ling to remonstrate.\n\n**Hymn of Praise:**",
      "start_char": 1224,
      "end_char": 1557,
      "start_sentence": 93,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.962814092636108,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\上清侍帝晏桐柏真人真图赞.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "学聚该洞，辩物谈述。 叔誉斯穷，师旷匪诘。 隐妙神性，谬测声质。 宾帝有期，暝臣诅悉。 第三，列仙传曰：太子好吹笙作凤凰呜。 游伊洛之间，道士浮丘公接上嵩高山者。 此时浮丘公初降授以秘术，修习既成，拟托卒尸解。 所以预言於师旷，有三年之期。 图画太子吹笙，游於伊洛问，道士浮丘公降接之事。 赞曰 位寓储官，字着仙阁。 志浚云汉，边厌城郭。 学凤调篁，思真伫洛。 浮丘降授，解形是托。 第四，与师旷言云：后三年，上宾於帝所者。 谓三年之内，必先尸解，方乃上宾於帝，故通而预言耳。 於是密蜕解形，空留剑乌，潜冥真体，隐适嵩山。 使亲忘我难，故示终以绝思。 为道既不易，故积学以登仙。 图画宫殿，作太子外卒形，群臣吨泣事，及太子共浮丘公束南行，向嵩高山事。 赞曰： 剑杖有术，符药多方。",
      "translated_text": "**Hymn of Praise:**\nHis learning vast and penetrating, his discourse on things profound and lucid.\nShu Yu was left speechless, Master Kuang could not refute.\nHe divined the hidden wonders of the spirit, misjudged the essence of voice and form.\nThe guest’s ascent to the Emperor’s abode had its appointed time—how could the blind seer fathom it?\nThe *Liexian Zhuan* states: The Crown Prince loved to play the sheng, mimicking the phoenix’s cry. Roaming between the Yi and Luo rivers, the Daoist Master Fuqiu met him and led him up Mount Songgao. At that time, Fuqiu had just descended to transmit secret arts; once his practice was complete, he planned to feign death and achieve liberation through *shijie*. Thus he foretold to Master Kuang the three-year term.\nThe painting depicts the Crown Prince playing the sheng, roaming by the Yi and Luo, and Master Fuqiu descending to receive him.\n\n**Hymn of Praise:**\nHis rank lodged in the heir’s palace, his name inscribed in the halls of immortals.\nHis aspirations soared to the Milky Way, his heart wearied of city walls.\nHe tuned his sheng to the phoenix’s song, yearning for truth by the Luo’s banks.\nFuqiu descended to bestow his teachings, entrusting his form to liberation.\nWhen he told Master Kuang, “In three years, I shall ascend as a guest to the Emperor’s abode,” he meant that within three years, he would first achieve *shijie* before ascending as a guest to the Emperor—hence his veiled prophecy.\nThereupon, he secretly shed his form, leaving only a sword and a crow; his true body concealed, he withdrew to Mount Song. To make his kin forget the pain of parting, he feigned death to sever their longing. The Dao is not easily attained—only through accumulated study does one ascend as an immortal.\nThe painting shows the palace halls, the Crown Prince’s outward death, the ministers’ wailing, and the Crown Prince journeying southeast with Fuqiu toward Mount Songgao.\n\n**Hymn of Praise:**\nHis sword and staff held arcane arts, his talismans and elixirs myriad in method.",
      "overlap_context": "\"Your voice is clear yet impure, your complexion red and pale like fire—you will not live long.\" The Crown Prince said: \"In three years, I shall ascend as a guest to the Emperor’s abode. Be cautious in speech, lest misfortune befall you.\" Master Kuang returned home and died within three years.\n\nThe painting depicts the Eastern Palace’s halls, the Crown Prince seated within, and the exchanges with Shu Yu and Master Kuang. Master Kuang is shown stamping his feet in admiration.\n\n**Hymn of Praise:**",
      "start_char": 1557,
      "end_char": 1902,
      "start_sentence": 114,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.792961359024048,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\上清侍帝晏桐柏真人真图赞.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "代形未化，蜕质默详。 寻师道长，辞亲爱忘。 隐山自逸，痉墓徒伤。 第五，传曰：浮丘公接上嵩高三十余年，后求之於山，见桓良日：告我家，七月七日，待我於维氏山头者。 太子隐於嵩高，师於浮丘公。 精思以炼神，饵药以变质。 道业既就，仙举有期。 乃出见桓良，令报我家也。 图画嵩高山，作修学。 岩林居处，严中有经书、丹鳌，浮丘公坐在其中。 严前作坛，王君坐在坛上，烧香精思事。 又王君出於山，次见桓良共语事。 赞曰： 栖山隐迹，学道炼形。 年淹数纪业契群灵。 告期七日，将迈三清。 桓良返报，周国待迎。 第六，传曰：果乘白鹤驻山巅，望之不得到，举手谢时人，数日而去。 立祠於维氏山者，此则初卒而隐，后仙而显。 神化无方，灵变自适也。 故能降谢堠氏，举手留情。 上登云天，冲鹤灭景。 时人永慕於余迹，祠宇以存之。 灵像可传於后世，神气而在焉，师旷不寿之语，彼类於蚌蚶。 太子宾帝之言，此可明於龟鹤矣。 图画王君乘鹤，驻在维氏山头，举手谢时人。 并作周国帝王仪仗，及时人众等，望不得到。 及王君控鹤升天事。 赞曰： 倾人国内，驻鹤山巅。 遥谢举手，永绝归年。 留情数日，冲景三天。 孤轩畅远，众被悲旋。",
      "translated_text": "Before his form had fully transformed, he silently examined his molted essence.\nSeeking a master to extend the Dao, he bid farewell to kin and love alike.\nSecluded in the mountains, he found ease; the tomb’s sorrow was but a fleeting grief.\n\nFifth Record states: Fuqiu Gong received him on Mount Songgao for over thirty years. Later, when sought in the mountains, he appeared to Huan Liang, saying, “Tell my family: on the seventh day of the seventh month, await me at the summit of Weishi Mountain.”\nThe Crown Prince concealed himself on Mount Songgao, studying under Fuqiu Gong.\nThrough concentrated meditation, he refined his spirit; through elixirs, he transformed his substance.\nOnce his Daoist practice was complete, the time for his immortal ascension drew near.\nThus he emerged to meet Huan Liang, bidding him inform his family.\nThe painting depicts Mount Songgao, where he pursued his studies—\namidst rocky forests and dwellings, scriptures and alchemical crucibles lay in solemn order, with Fuqiu Gong seated among them.\nBefore the altar, a platform was raised, where the Prince sat in meditation, burning incense and refining his spirit.\nAnother scene shows the Prince emerging from the mountain, then meeting Huan Liang in conversation.\n\n**Hymn of Praise:**\nDwelling in the mountains, he concealed his traces, studying the Dao to refine his form.\nYears passed, spanning decades, as his practice aligned with the numinous.\nHe foretold the seventh day, when he would ascend to the Three Clarities.\nHuan Liang returned with the message, and the kingdom awaited his arrival.\n\nSixth Record states: Indeed, he mounted a white crane and alighted upon the mountain’s peak. Gazing from afar, none could approach; he raised his hand in farewell to the people of his time, lingering for days before departing.\nA shrine was erected on Weishi Mountain—first, he feigned death and concealed himself; later, he revealed his immortality.\nHis divine transformations knew no bounds; his spiritual changes followed their own course.\nThus he could descend to bid farewell to the people of Hou, raising his hand to leave a trace of affection.\nAscending to the clouded heavens, he rode the crane into the vanishing light.\nThe people of his time cherished his lingering traces, preserving them in a shrine.\nHis sacred image could be passed to later generations, for his spirit and qi remained.\nThe words of Master Kuang on his untimely end were like the clam and oyster;\nthe Crown Prince’s prophecy of ascending as a guest to the Emperor was now as clear as the tortoise and crane.\n\nThe painting shows the Prince riding a crane, alighting upon the summit of Weishi Mountain, raising his hand in farewell to the people of his time.\nIt also depicts the imperial procession of the Zhou kingdom, along with the gathered crowds, gazing from afar yet unable to approach—\nand the Prince, guiding the crane as he ascends to heaven.\n\n**Hymn of Praise:**\nHe captivated the kingdom, perching his crane upon the mountain’s peak.\nFrom afar, he raised his hand in farewell, forever severing the bonds of mortal years.\nLingering for days, he left traces of affection, then soared through the Three Heavens.\nHis solitary carriage roamed boundlessly, while the multitude was left in sorrowful longing.",
      "overlap_context": " true body concealed, he withdrew to Mount Song. To make his kin forget the pain of parting, he feigned death to sever their longing. The Dao is not easily attained—only through accumulated study does one ascend as an immortal.\nThe painting shows the palace halls, the Crown Prince’s outward death, the ministers’ wailing, and the Crown Prince journeying southeast with Fuqiu toward Mount Songgao.\n\n**Hymn of Praise:**\nHis sword and staff held arcane arts, his talismans and elixirs myriad in method.",
      "start_char": 1902,
      "end_char": 2389,
      "start_sentence": 136,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.281230449676514,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\上清侍帝晏桐柏真人真图赞.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "第七上清天高圣太上玉晨玄皇大道君，为万道之主。 诸真之所尊奉，世学之所宗禀。 得道登仙者，必诣金阙，而朝拜受事焉。 於是分司列位，随德业之高卑，章服法仪，因品秩以班锡。 故冠岐殊制，婶节异色。 舆盖各形，龙鹤分驭。 ．咸有等差，以资升降。 王君是焉，敬承圣旨。 图画天上上清宫阙，作道君形像。 仙真侍卫，作二童侧立。 共捧案，案上有玉策。 并作一真人侧立，宣付王君。 赞曰： 形声入妙，道备登真。 奉朝金阙，禀策玉晨。 德业爰叔，职位攸遵仪齐奉，万劫凝神。 第八，王君於金阙拜受策命。 号日：侍帝晨，领五岳司，右弼王桐柏真人。 既承圣旨，将赴洞宫，羽节导前，霓旌从后。 龙舆降翕，鹤辔回翔。 神仙侍卫，笙仿奏乐。 下太清而乘云，指洞霄而稳驾。 谅道气之灵，景真仪之盛观也。 图画王君乘云车羽盖，仙灵侍从，旌节导引。 龙鹤飞翔，从天而降，欲赴桐柏山洞宫事。 赞曰： 班锡所禀，羽仪咸备。 蕾胃景浮轩，龙鹤骋辔。 旖节导从，蕾买仙会萃。 自天乘阶，瞻山赴位。 第九，天台山一名桐柏栖山。 山有洞府号日：金庭官。 精晖伏晨，光照洞域。 琼台玉室，莹朗轩庭。 泉则石髓金精，树则苏牙琳碧。 信谓养真之福境，成神之灵墟也。 王君处焉，以理幽显，侍弼帝晨。 有时朝奉，领司诸岳。 群神於兹受事矣。 图画桐柏山，作金庭洞宫。 王君坐在宫中，众仙侍卫。 并五岳君各领佐命，等百神来拜谒。 赞曰： 山有玉洞，宫日金庭。 九天通象，三晨伏精。 侍帝斯任，弼王所贞。 领司五岳，统御百灵。 第十，紫阳真人周季山，昔入桐柏山。 见真人王君，授以素奏丹符。 又明晨侍郎夏馥，入桐柏山遇真人王君，授黄水云浆之法。 图画真人周季山，作道士服於桐柏山，见真人王君，王君以左手执素奏丹符，欲付周君，周君长跪而受之。 作夏馥着古人衣，遇见王君。 王君把一卷书欲付馥，馥长跪举两手受之。 其周夏二人，皆作山人装束。 各作一岌，解在其人边，石上着跪於王君。 王君作真人衣服，并有三五个仙人侍在左右。 赞曰： 周君访道，丹符见授。 夏氏求仙，黄水之究。 炼形奇术，非师不就。 幽感爰通，冥期可候。 第十一，晋兴宁三年，有学道者杨君，处於茅山精思所感，多有诸真降授。 以其年六月二十六日，桐柏真人王君，共诸真降於杨之所居，而未与之言。 杨君记日：有一人年甚少，整顿非常。 建芙蓉冠，着朱衣，以白珠缀，衣缝带剑。 多论金庭山事於后。 又降告曰：夫八朗四极，灵岸辽遐。 奇言吐颖，琼音灿振。 晨飞波霄，清玄气赴。 授职玉虚，心遗艰锋。 沈滞於眇罗之外，凝和于寂波之表。 若此者，必能旋腾寥汉，周历真庭矣。 三元可得而而见，降名可得立耳。 如其心并僭浪，目击色袂。 动与网罟共启，静与争竞之分者。 此乃适仙路邈，求生日阔也。 子其慎之。 又降曰：有道者，皆当深研灵奥。 栖心事外。 但思味勤笃，糟粕余物，亦是享耳。 又降有歌述等词，此不备载。 图画茅山杨君，学道坛宇处，王真人降见，着芙蓉冠，绛衣白珠缀，衣缝带剑。 杨君把纸笔附前而书。 其衣作真仙之制，其剑皱依经中样式。 赞曰： 真仙匪遥，感通惟密。 应彼幽志，降兹灵质。",
      "translated_text": "The Seventh Heaven of Supreme Clarity, the Highest Sage, the Supreme Jade Dawn, the Mysterious August Lord of the Great Dao—\nHe is the sovereign of the myriad Dao, revered by all perfected beings, the foundation upon which the world’s teachings rest.\nThose who attain the Dao and ascend as immortals must journey to the Golden Portals to pay homage and receive their celestial duties.\nThere, offices are divided and ranks assigned according to the depth of virtue and merit; vestments and ritual forms follow the hierarchy of grades and bestowals.\nThus, crowns differ in design, staffs in color; chariots and canopies vary in form, dragons and cranes serve as distinct mounts—\nall ordered by degree to facilitate ascent and descent.\nHerein, the Prince reverently received the sacred decree.\nThe painting depicts the celestial palaces of the Supreme Clarity Heaven, portraying the Lord of the Dao in form.\nPerfected beings stand in attendance, two youths at his side, together bearing a tray upon which rests a jade tablet.\nAnother perfected one stands aside, proclaiming the decree to the Prince.\n\n**Hymn of Praise:**\nForm and sound enter the wondrous, the Dao perfected to ascend as true.\nPaying homage at the Golden Portals, receiving the jade decree from the Jade Dawn.\nVirtue and merit thus established, office and rank duly observed.\nRituals aligned in reverence, spirit congealed through ten thousand kalpas.\n\nThe Eighth: At the Golden Portals, the Prince knelt to receive his investiture, bestowed with the title:\n*Attendant to the Emperor of the Dawn, Overseer of the Five Peaks, Right Assistant to the Perfected of Paulownia-Cypress.*\nHaving received the sacred decree, he prepared to depart for the Grotto Palace.\nFeathered staffs led the way, rainbow banners followed behind; the dragon chariot descended in splendor, the crane’s reins circled in flight.\nDivine immortals stood in attendance, reed pipes and flutes played in harmony.\nDescending through the Great Clarity upon clouds, he steered toward the Grotto Heavens, his carriage steady.\nTruly, the numinous power of the Dao and the grandeur of the celestial procession were a magnificent sight.\nThe painting shows the Prince riding a cloud chariot with a feathered canopy, divine immortals in escort, banners and staffs leading the procession.\nDragons and cranes soar in flight as they descend from heaven, bound for the Grotto Palace of Paulownia-Cypress Mountain.\n\n**Hymn of Praise:**\nThe bestowed decree received, feathered regalia complete.\nHelmets and armor gleam upon the floating carriage, dragons and cranes race with reins.\nBanners and staffs lead the procession, immortal gatherings assemble in splendor.\nDescending from heaven by celestial steps, gazing toward the mountain to assume his post.\n\nThe Ninth: Mount Tiantai, also called Paulownia-Cypress Mountain.\nWithin the mountain lies a grotto palace named the Golden Court, where radiant essence lingers at dawn, its light illuminating the grotto realm.\nJasper terraces and jade chambers gleam with clarity, their halls resplendent.\nIts springs flow with stone marrow and golden essence; its trees bear jade buds and lush verdure.\nTruly, it is a blessed realm for nurturing the true, a numinous dwelling for attaining the divine.\nHere the Prince dwells, governing the hidden and manifest, serving as assistant to the Emperor of the Dawn.\nAt times, he attends court and oversees the affairs of the Five Peaks.\nAll spirits receive their duties in this place.\nThe painting depicts Paulownia-Cypress Mountain and the Golden Court Grotto Palace.\nThe Prince sits within the palace, surrounded by immortal attendants.\nThe Lords of the Five Peaks, each leading their subordinate spirits, come to pay homage.\n\n**Hymn of Praise:**\nThe mountain holds a jade grotto, the palace named Golden Court.\nThe Nine Heavens align in resonance, the Three Dawns conceal their essence.\nServing the Emperor in this duty, assisting the Perfected in steadfastness.\nOverseeing the Five Peaks, commanding the hundred spirits.\n\nThe Tenth: The Perfected of Purple Yang, Zhou Jishan, once entered Paulownia-Cypress Mountain.\nThere, he encountered the Perfected Prince Wang, who bestowed upon him a plain memorial inscribed with cinnabar talismans.\nLater, the Attendant of the Luminous Dawn, Xia Fu, entered Paulownia-Cypress Mountain and met the Perfected Prince Wang, who taught him the method of the Yellow Water and Cloud Elixir.\nThe painting shows the Perfected Zhou Jishan, clad in the robes of a Daoist, on Paulownia-Cypress Mountain.\nHe meets the Perfected Prince Wang, who holds in his left hand a plain memorial with cinnabar talismans, about to bestow it upon Zhou.\nZhou kneels in reverence to receive it.\nAnother scene depicts Xia Fu in ancient attire, encountering the Prince.\nThe Prince holds a scroll, about to present it to Xia, who kneels with both hands raised to accept it.\nBoth Zhou and Xia are dressed as mountain recluses, each with a staff placed beside them, kneeling upon the stone before the Prince.\nThe Prince wears the robes of a perfected being, accompanied by three to five immortal attendants at his side.\n\n**Hymn of Praise:**\nZhou sought the Dao, receiving the cinnabar talismans.\nXia pursued immortality, mastering the Yellow Water’s mysteries.\nRefining form through wondrous arts, none achieve without a teacher.\nHidden resonance thus connects, the appointed hour may be awaited.\n\nThe Eleventh: In the third year of the Xingning era of the Jin dynasty, a Daoist practitioner named Yang resided on Mount Mao, where his earnest devotion summoned many perfected beings to descend and bestow teachings.\nOn the twenty-sixth day of the sixth month of that year, the Perfected Prince Wang of Paulownia-Cypress, accompanied by other perfected beings, descended to Yang’s dwelling—but did not speak to him.\nYang recorded the event, noting: *There was one whose youthful appearance was extraordinary.\nHe wore a lotus crown, a crimson robe adorned with white pearls, and a sword at his waist.\nLater, he spoke much of the affairs of Golden Court Mountain.*\nThe perfected beings then proclaimed:\n*\"The Eight Vastnesses and Four Extremes are distant and boundless, their numinous shores remote.\nWondrous words sprout like buds, jade tones resound with brilliance.\nAt dawn, they soar through the clouds; pure and mysterious qi gathers.\nBestowed with office in the Jade Void, the heart sheds its burdens.\nMired beyond the subtle net, harmony congeals beyond the still waves.\nThose who attain this shall surely ascend the vast heavens, traversing the true courts.\nThe Three Primes may be seen, and immortal names may be established.\nBut if the heart is reckless and wandering, the eyes fixed upon sensual forms—\nif in motion one shares the fate of nets and snares, in stillness contends with strife—\nthen the path to immortality remains distant, and the span of life grows ever more constrained.\nTake heed, and be vigilant.\"*\nThey further proclaimed:\n*\"Those who possess the Dao must delve deeply into its numinous mysteries, dwelling in the heart beyond worldly affairs.\nIf one merely savors diligence in trivial matters, clinging to the dregs of the world, it is but a fleeting indulgence.\"*\nThey also descended with songs and verses, which are not recorded here in full.\nThe painting depicts Yang on Mount Mao, at the altar where he practiced the Dao.\nThe Perfected Prince Wang descends to meet him, wearing a lotus crown, a crimson robe adorned with white pearls, and a sword at his waist.\nYang holds paper and brush before him, recording the event.\nHis robes follow the style of a true immortal, and his sword is depicted according to the patterns described in the scriptures.\n\n**Hymn of Praise:**\nThe true immortals are not distant; resonance is but a thread of subtlety.\nAnswering the hidden resolve, they descend in numinous form.",
      "overlap_context": "ingdom, along with the gathered crowds, gazing from afar yet unable to approach—\nand the Prince, guiding the crane as he ascends to heaven.\n\n**Hymn of Praise:**\nHe captivated the kingdom, perching his crane upon the mountain’s peak.\nFrom afar, he raised his hand in farewell, forever severing the bonds of mortal years.\nLingering for days, he left traces of affection, then soared through the Three Heavens.\nHis solitary carriage roamed boundlessly, while the multitude was left in sorrowful longing.",
      "start_char": 2390,
      "end_char": 3647,
      "start_sentence": 169,
      "end_sentence": 255,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.74845027923584,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\上清侍帝晏桐柏真人真图赞.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "诚训着言，咏歌兼述。 见景非久，冲真返一。 上清侍帝晨桐柏真人真图赞竟",
      "translated_text": "\"True teachings are set forth in words,\nboth in hymns and in narratives.\nThe vision does not linger long—\nthe pure and true return to the One.\nHere ends the *Hymn of Praise to the Perfected Portrait of the Upper Clarity’s Attendant to the Celestial Emperor, the True Person of Tongbai.*\"",
      "overlap_context": "acticed the Dao.\nThe Perfected Prince Wang descends to meet him, wearing a lotus crown, a crimson robe adorned with white pearls, and a sword at his waist.\nYang holds paper and brush before him, recording the event.\nHis robes follow the style of a true immortal, and his sword is depicted according to the patterns described in the scriptures.\n\n**Hymn of Praise:**\nThe true immortals are not distant; resonance is but a thread of subtlety.\nAnswering the hidden resolve, they descend in numinous form.",
      "start_char": 3647,
      "end_char": 3684,
      "start_sentence": 256,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.1854007244110107,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\上清侍帝晏桐柏真人真图赞.txt",
        "category": "赞颂类"
      }
    }
  ]
}