{
  "source_id": "上清洞真解过诀",
  "source_file": "chunked_daozang\\上清洞真解过诀.json",
  "total_chunks": 6,
  "total_original_chars": 6014,
  "total_translated_chars": 36439,
  "total_translation_time": 185.33372831344604,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清洞真解过诀.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Upper Clarity Scripture of Resolving Transgressions: Jade Instructions**\n\n**Preface to the Scripture**\n*Title:* The Upper Clarity Scripture of Resolving Transgressions: Jade Instructions. Author unknown, approximately dated to the Northern and Southern Dynasties. Compiled from the Upper Clarity tradition’s scriptures and instructions for repentance and absolution. One scroll. Base text from *The Orthodox Daoist Canon*, Cavern Mystery Section, Jade Instructions category.\n\n---\n\n**The Upper Clarity Scripture of Resolving Transgressions**\n\n**First: The Eight Seasonal Days of Repentance by the Perfected Lord Pei of Pure Numinosity**\n\nThe Perfected Lord Pei of Pure Numinosity said: The Perfected Lord of the Great Ultimate regularly gathers with immortals at the Palace of the Great Ultimate on the noon of the *Lichun* (Beginning of Spring) day to inscribe jade tablets with the names of immortals.\n\nOn the midnight of that same evening, facing due north and gazing toward the North Star, one bows twice, prostrates, and confesses the number of one’s transgressions, seeking absolution. After stating one’s intent, one bows twice again and ceases.\n\nOn the noon of the *Chunfen* (Spring Equinox) day, the Perfected Lords of the Jade Terrace of Kunlun and the Great Simplicity gather with all immortal officials to establish the true scriptures.\n\nOn the noon of the *Lixia* (Beginning of Summer) day, the Five Emperors of the Upper Clarity convene with all immortals at the Purple Tenuity Palace to meet the Four Perfected Lords and deliberate the merits and transgressions of those seeking the Dao.\n\nOn the noon of the *Xiazhi* (Summer Solstice) day, the Three Officials of Heaven gather with the Controller of Destinies and the River Marquis to assess the sins and blessings of all people, adding or subtracting years from their lifespans.\n\nOn the noon of the *Liqiu* (Beginning of Autumn) day, the Perfected Lords of the Five Marchmounts visit the Yellow Elder Lord at the Yellow Chamber Cloud Court Mountain to convene with immortal officials at noon and determine the divine charts and numinous medicines of the world.\n\nOn the noon of the *Qiufen* (Autumn Equinox) day, the Supreme August Emperor ascends the Upper Clarity Numinous Watchtower of the Great Tenuity Palace to meet with the Three Elder Lords of the Most High, the Perfected Lords of the Northern Culmen, the Great Spirits of the Eight Seas, the Venerable Immortal Officials of the Five Marchmounts, and the myriad immortals. Together, they deliberate the sins and blessings of all beings under heaven, recording the diligence or negligence of Dao-seekers, itemizing each detail, and submitting them to the Controller of Destinies.\n\nOn the noon of the *Lidong* (Beginning of Winter) day, the Perfected Lord of the Yang Terrace gathers with immortal officials and jade maidens to newly determine and register the names of those who have just attained the Dao and entered the ranks of immortals.\n\nOn the noon of the *Dongzhi* (Winter Solstice) day, all the Perfected and Immortals proceed to the Eastern Flower Palace of the Square Cauldron to visit the Azure Lad of the Eastern Sea and inscribe the names of all immortals in the golden register of the immortal roster.\n\nRegularly, on the evenings, midnights, and noons of the eight seasonal days, one repents for the sins of one’s seven generations of ancestors and parents, as well as one’s own transgressions. By doing so, the names of these transgressions are erased. With prolonged practice, one becomes an immortal who does not die.\n\nOn the days of the Autumn and Spring Equinoxes, the Most High and the Perfected observe and deliberate the affairs of the myriad immortals. Those who are not truly upright must not lightly use these days for repentance.\n\nThe Perfected and Immortal Officials gather at noon on the eight seasonal days, and absolution is granted only after three days. Those who wish to cultivate the Dao must first purify themselves through fasting and not neglect this practice.\n\nThe fifth instruction received by Ziyuan from Master Jiang teaches that on the eight seasonal days, one should meditate and confess the number of transgressions committed since one’s birth, sincerely presenting one’s case in the hope that the Heavenly August and the Perfected will record one’s protection, enabling one to reform and return to goodness, thereby seeking long life and immortality.\n\nThe Autumn Equinox is a day when qi resides in pure emptiness, the true day of Great Harmony. On this day, all the Perfected and Immortals hear petitions.\n\nMoreover, the immortal officials of the Earthly Bureau of Censorious Clerks and the various departments impeach and report the merits and transgressions of Daoists in their respective regions, as well as the sins and life-and-death matters of all people.\n\n*The True Record of Immortal Taboos* states:\n*\"If you wish to ascend to heaven, be cautious on the Autumn Equinox;\nSins great and small are all heard above.\nSeeking immortality with sins is most difficult—\nThus, those who study the Dao grow cold at heart.\"*\n\nThese are the essential words of Master Zhongyang of the Vermilion Fire Cinnabar Mound.\n\nOn the Autumn Equinox, qi is harmonized at noon, aligning with Heaven and Earth. The great fiery qi is subdued by the withering force, while the dark water envelops the essence, nurtured within the palace of metal’s birth. Thus, the radiance of the Great Yang shifts to the Lesser Yang, storing and nourishing Heaven and Earth. At this juncture, the boundaries of hardness and softness are determined, the sequences of the two images are united, and luminous brilliance is manifested. The three luminaries of yin and yang are distinguished, marking the standard days of the eight seasons and the essential ladder for seeking the Dao.\n\nEach time this day arrives at noon, the Jade August Emperor, the Supreme August Emperor, ascends the Vast Cold Upper Clarity Numinous Abode, the Crimson City Purple Terrace of the Celestial Watchtower in the Great Void, where the multitudes of Perfected gather at the Terrace of the Great Tenuity. Above, they open the gates of the Nine Heavens to summon the Perfected August Ones of the Nine Heavens; in the middle, they invite the Three Elder Lords of the Most High and the Perfected Lords of the Northern Culmen; and below, they command the Perfected of the Five Marchmounts and the famous mountains who have attained immortality. The myriad numinous and august ones convene at the Palace of the Vast Yang to collectively deliberate and determine the sins and blessings of all people under heaven, recording the diligence or negligence of those who study the Dao and seek immortality. They itemize the days of transgressions, the measures of good and evil in cultivation, the forms of rewards and punishments, and the conditions of life and death, each according to their respective departments and origins, and submit them to the Controller of Destinies. These are inscribed in the August Register, where sins and blessings, no matter how minute, are carved into the registers of the Crimson City. Hidden crimes and secret virtues, no matter how slight, are all distinctly known.\n\nOn the midnight of that evening, one should go to the central courtyard, face north, gaze toward the North Star, remove one’s headscarf, bow twice, prostrate, and kneel to reverently address the Most High, the August Emperor of the Northern Culmen. One secretly repents for the sins of one’s seven generations of ancestors and parents, and confesses the number of transgressions committed since one’s birth, beseeching pardon and vowing from this day forward to reform past wrongs and cultivate future goodness. One’s words must be sincere, one’s oaths engraved in the cinnabar heart, and one’s pledges sworn before Heaven and Earth, never daring to commit evil deeds again.\n\nOne should express these words with utmost sincerity. With prolonged practice, one becomes an immortal who does not die.\n\nUpon completion, one says:\n*\"May the Most High Emperor erase my name from the record of sins and transfer the document to the Three Officials, allowing my name to be inscribed in the jade roster of immortals, attaining long life, eternal vision, communion with the Perfected, and penetration to the numinous.\"*\n\nUpon completion, one kowtows four times, bows again, and returns to the quiet chamber, deeply reproaching oneself while visualizing the spirits of the Three Origins, causing them to ascend and report to the Most High. Doing this thrice inscribes one’s name in the register of immortals and erases all sins and transgressions.\n\nThe Three Origins refer to the spirits of the Mud-Pill Palace, Crimson Palace, and Cinnabar Field. By visualizing the Three Origins and their spirits, one petitions the Heavenly Worthy, beseeching mercy and aid in ensuring one’s words ascend and are heard. After three petitions on the Autumn Equinox, the register of life is fixed, and the name of death is removed.\n\nThis method derives from the *Scripture of the Azure Chart*, a secret art of longevity. Though common folk may favor the Dao, they remain entangled in the human realm, where transgressions abound and violations are manifold. Thus, the Autumn Equinox method of confessing faults may not yet be applicable. Only by entering the mountains and forests, distancing oneself from worldly affairs, dwelling in solitude, and refraining from harming all things may one perform it. Having sworn oaths of repentance and vows of reform, one’s words have reached the hearing of the Most High—one must take care never again to commit deeds that violate life and transgress the Dao. Should one repeat offenses tenfold, Heaven and Earth will not forgive, and death shall serve as proof; no further amendment or remedy will be possible. Seeking the Dao in this manner will yield nothing. Nurturing life is like the interplay of water and fire: gaining its benefit leads to ascension in broad daylight, while violating its precepts results in descent into the Three Springs.\n\nThis day holds particular weight among the seven nodal days, for it is what Master Zhao Boxuan called the \"gateway of life and death.\" The *Three-Nine Plain Discourse* states: \"On the day of autumnal judgment, high and low assemble, for it is the day of life and death.\" The ancients regarded the Autumn Equinox as the day of autumnal judgment. The reason lies in this: on the Autumn Equinox, the Perfected, immortals, and spirits of the Nine Heavens, Eight Lands, and Supreme August Thearch gather for three days and nights to determine the fate of all people. The matters deliberated are many, and the assembled deities are of the highest rank.\n\nOn each of the eight nodal days, the celestial and terrestrial Perfected officials convene in succession, remaining for three days and nights before returning to their respective domains. This is the oral instruction of Master Zhi Gongzi, distinct from the regulations of the seven nodal days.\n\nThe *Golden Root Scripture* of the Night-Watching Divine Youth states: \"On the eight nodal days, the assemblies for seeking immortality reach their peak, as the Mandate of Heaven summons all Perfected to gather. One day before the node, the myriad spirits approach the palace; at noon on the nodal day, high and low enter to pay homage; one day after the node, sins and blessings are distinguished. For three days and nights, celestial affairs are concluded. Beware of transgressions, strive to accumulate merit, and your name may ascend to the Perfected, inscribed in the Great Ultimate. I do not speak falsely—those who understand must keep this deeply secret. Hasten to confess your faults, and guard this teaching with care.\" This, too, was an oral transmission from Master Zhi Gong, passed down to Master Pei.\n\n**Second Method: Confessing Faults on the Eight Nodal Days (by Master Xu)**\nMaster Xu’s oral instruction states: On the eight nodal days, after midnight, sit upright facing north, visualize your form and spirit until they appear manifest. Upon completion, cross your hands above your head and knock your head on the ground thirty-six times—thus sins and transgressions are erased, and form and spirit attain union.\n\n**Third Method: Confessing Faults for Ancestors on the Five Penetrating Days (by Master Xu)**\nOn the Five Penetrating Days, face north and beseech the exile of one’s three generations of ancestors and five generations of forebears, thereby dissolving the sins and transgressions of one’s forebears. The Five Penetrating Days are the first day of the tenth month and the first day of the second month. Without resolving the burdens of one’s ancestors, one’s pursuit of immortality will remain distant.\n\n**Fourth Method: Confessing Faults for Ancestors and Oneself on the Five Pervading Days (by Master Xu)**\nOn the Five Pervading Days, face north and bow five times, calling aloud the names of the August Lords and their consorts three times:\n- The True August of Jupiter: Yu Can, Yu Can, Yu Can; Lady Flying Cloud, Flying Cloud, Flying Cloud.\n- The True August of Mars: Wei Ting, Wei Ting, Wei Ting; Lady Hua Ping, Hua Ping, Hua Ping.\n- The True August of Saturn: Dan Yan, Dan Yan, Dan Yan; Lady Fei Xian, Fei Xian, Fei Xian.\n- The True August of Venus: De Biao, De Biao, De Biao; Lady Ling En, Ling En, Ling En.\n- The True August of Mercury: Jing Yuan, Jing Yuan, Jing Yuan; Lady Long E, Long E, Long E.\n\nThe personal names of the Five August Consorts have no prior textual source; these are the separate oral instructions of Lady Zhaoling. Afterward, knock the teeth together five times, remove the headscarf, and kneel lengthily. Reverently address the August Lords of the Five Stars and the Moon, the High Perfected of the Dao, the Ladies of the Dao, the Most High of Jade Purity, the Supreme August Thearch of Highest Clarity, and the Sagely Lord of the Great Dao before them, confessing the myriad sins and transgressions of one’s seven generations of ancestors and parents down to oneself, beseeching liberation. Petition the Three Officials to report to the Heavenly Thearch, that one’s name may be severed from guilt and erased from the cinnabar tablets. Pray to join the Perfected of the Five Stars, together ascending to the radiant dawn, entering Highest Clarity, and traversing the Jade Towers.\n\nOn the sixth day of the first month at noon...\n\nOn the first day of the second month at the evening meal hour, the seventh day of the third month at midnight, the ninth day of the fourth month at breakfast hour, the fifteenth day of the fifth month at midnight, the third day of the sixth month at noon, the seventh day of the seventh month at midnight, the fourth day of the eighth month at noon, the second day of the ninth month at dawn, the first day of the tenth month at dawn, the sixth day of the eleventh month at midnight, and the twelfth day of the twelfth month at midnight—these are the five propitious days of convergence.\n\nThe Most High concealed the days of the Five Penetrations within the Jade Bamboo Shoots of the Five Marchmounts, hiding the Way of Returning to the Origin within the Palace of the Nine Dawns. Having cultivated the Five Penetrations, one must practice the Return to the Origin. The Five Penetrations open at the Emperor’s Beginning, while the Return to the Origin opens at the Mysterious End. Thus, those who cultivate the Five Penetrations and practice the Seven Origins’ Way of Return must abstain from consuming bloody or foul substances and avoid all corpses and impurities. Violators shall face the trials of the Great Mystery.\n\nThe Five Penetrations are the Most High’s days of auspicious assembly; the Return to the Origin is the Most High’s day of renewal. Without knowing the Five Penetrations, one cannot dissolve sins or erase transgressions; without knowing the hidden Way of the Return to the Origin, one’s name cannot be inscribed among the Perfected. On these days, one should meditate upon auspicious matters, first repenting the sins and transgressions within one’s body—this is what is meant by liberating seven generations and severing oneself from penal bonds. Failure to do so will bar one from the immortals of the Nine Palaces.\n\n**The Primordial One’s Method for Repenting and Dissolving Sins at Midnight and Noon (Fifth)**\nThe Primordial One states: If you have sins and transgressions and wish to repent and seek their dissolution, at midnight or noon, enter a chamber, close the door, sit upright, and face north. Visualize the Imperial Lord within your Purple Chamber, as described above. Then visualize yourself within the Purple Chamber, prostrating before the Imperial Lord, inwardly confessing your faults. Hold your breath for a long while until your entire body is drenched in sweat, your clothes soaked through. Repeat this three times, and the sins you dissolve will naturally disperse.\n\nWhen your whole body is bathed in sweat, recite the following prayer:\n*\"So-and-so has sinned, his transgressions known to the hundred spirits. I beseech deliverance from the seventy-two perils of water and fire. Guardian of Destiny, Primordial One, I implore the Imperial Lord for salvation. My sweat flows through my body, my Three Hun tremble in fear. I humbly entreat the Most High to forever remove my afflictions.\"*\n\nAfterward, call the Imperial Lord’s name three times. The Imperial Lord’s taboo name is *Lingfan*, his style *Lǚchānglíng*; he is also called *Seven Spirits* or *Divine Elder*. He constantly resides in the Purple Chamber of the Great Ultimate, seated in perfect uprightness, his countenance like that of an infant. A purple qi ever shrouds his divine form; he wears a robe of five-colored radiance and a crown adorned with the sun and moon. Upon his left ear rests a sun nine inches in diameter; upon his right, a moon one foot across. Once the visualization is complete, open your eyes. This is called the *Imperial Lord’s Way of Dissolving Transgressions*, an inner repentance to the Five Spirits, with sweating as its sign.\n\nThe worldly method of repentance involves kowtowing and striking one’s cheeks, but this is an external practice. Those who cultivate the Three Ones and guard the Grotto Chamber, serving the Imperial Lord and revering the Primordial One, must never kowtow or strike their cheeks. Kowtowing startles the Three Hun, disturbs the Mud-Pill Palace, agitates the Purple Chamber, and troubles the Imperial Lord. Striking one’s cheeks hardens the womb-knot, strains the Eastern Po’s sinews, grieves the Primordial One, and causes the Five Spirits to depart—this is a grave taboo. If, in thought or deed, one merely *visualizes* kowtowing or striking the cheeks, the repentance is inwardly accomplished. The immortals bow in their hearts alone, their forms unbending; this, I say, is fitting.\n\n**Master Liu’s Method for Repenting on Behalf of One’s Family on Chen-Si Days of the Five Virtues (Sixth)**\nMaster Liu records: People accumulate many sins, and though the Heavenly Net is wide, none escape its mesh. The unseen shortens one’s allotted years, thus cutting life short. Though the Way of life resides within the body, without repentance, one suffers illness, sorrow, and misfortune. This text is drawn from the *Twenty-Third Scroll of the Inner Chapters of the Taiwei Wenchang Hetu*.\n\nWhen a household experiences misfortune, decline, or failure in endeavors; when descendants do not flourish; when an official’s rank does not advance; when livestock perish; or when sudden disasters strike—all arise from the weight of transgressions. If one washes away filth, purifies the heart, refrains from excess and envy, avoids unprincipled conduct, cultivates compassion and empathy, shares others’ sorrows and joys, regards others’ losses as one’s own and others’ gains as one’s own; if one does not slander, does not sow discord, practices charity, and rescues those in distress—then life will lengthen daily, and one’s wishes will be fulfilled.\n\nOn *chen-si* days at dusk, sweep and purify the ground of Heavenly Virtue (referring to the earth of *jia, geng, bing, xin,* and *ren*). Burn incense, and with the whole household facing north, remove your headscarves and kowtow dozens of times without speaking. Inwardly, pray: *\"May the sins and transgressions committed by our household be dissolved.\"* Thus may one attain peace and longevity. If wrongdoing continues unabated, even frequent repentance will be of no benefit. But if one commits no further transgressions and regularly practices this method of repentance, one shall forever be free from sorrow and misfortune.\n\nThe *jia-chen*, *bing-chen*, *wu-chen*, *geng-chen*, *ren-chen*, *ji-si*, *xin-si*, *gui-si*, *yi-si*, and *ding-si* days.\n*(Listed above: the Five Virtue Days.)*\n\n**The Seventh Method of Repentance on the Five Dao-Returning Days for Dissolving the Register of Sins in the Hidden Dao of the Supreme Return**\n\nThe *Inner Chapter on Dissolving the Register of Sins in the Hidden Dao of the Supreme Return* states: The Supreme Jade Perfected Concealed Origin’s Inner Contemplation employs the *ding* days of the six *ding*. At this time, the Celestial Origin unfolds its array; the primordial matrix is doubly secured. The seven *po* ascend to report, and the three *hun* record transgressions. Offenses bind seven generations of ancestors, and accumulated punishments weigh upon the Three Yin. Thus, there exists this method of dissolution to absolve entanglements and calamities.\n\nThose who practice this Dao are truly the greatest among seekers of immortality. Reflect upon the Seven Origins, contemplate the Dao of the Nine Mornings. The sleeping mats and bedding must not be shared with others, nor should clothing. If men and women share a bed, their names are inscribed in the Register of Northern Darkness. Those who violate defilement will have their misfortunes recorded in the earthly prisons. Even masters and kin sharing a resting place commit an offense.\n\nThe *Five Penetrations* are the auspicious assembly days of the Supreme. The *Returning Origin* is the day of renewal for the Supreme. Without knowledge of the *Five Penetrations*, one cannot dissolve sins or erase transgressions. Without knowledge of the Hidden Dao of the Returning Origin, one cannot have their name inscribed among the Perfected. On these days, one should reflect upon auspicious matters and first repent the sins within one’s body—this is what is meant by \"dissolving the bonds of seven generations and escaping the records of punishment.\" One must not reveal this to the immortals of the Nine Palaces.\n\nThe Supreme conceals the *Five Penetration* days, sealing them within the Jade Bamboo of the Five Peaks. The Hidden Dao of the Returning Origin is concealed within the Palace of the Nine Mornings. Having cultivated the *Five Penetrations*, one should practice the Returning Origin. The *Five Penetrations* are linked to the Imperial Beginning; the Returning Origin opens at the Mysterious End. Thus, those who cultivate the *Five Penetrations* and practice the Dao of the Seven Origins’ Return must not consume blood or meat, nor witness corpses or defilement. Violators will face the trials of the Supreme Mystery.\n\nFor those who cultivate matters of the Purple Chamber in the Grotto Chamber and contemplate the Nine Mornings and Seven Origins: at the initial moment of sleep, the inception of the hexagram, before eating, and after meals, first recite this subtle invocation:\n\n*\"Five Emperors, Five Penetrations,\nSix Harmonies, Purple Chamber,\nReturning Origin, Hidden Dao,\nVast and Lofty Seven Perfected,\nThe soul’s begetter is the Mysterious Father—\nthe Father transforms into the One, becoming spirit.\nThe po’s begetter is the Mysterious Mother—\nthe Mother transforms into the Two, giving birth to the body.\nThe gatherer of my sinews and bones is the Duke’s Son;\nthe steward of my essence and qi is White Origin.\nLong life and enduring vision,\nascend as an immortal to the Ten Heavens.\"*\n\nUpon completion, ensure no one hears the invocation. This is the Supreme’s hidden prayer, used to dispel evil qi, summon spirit, and ensure one remains untroubled by obscurity throughout life.\n\n**The Eighth: Dissolving the Eight Trials of the Seven Generations’ Parents on the Six Jia Days, Six Ding Days, Month’s End Evenings, and Six Jia Days**\n\nRegularly, during the *jia-zi* cycle, on the *ding-mao* day at midnight, sit upright on the bed, face north, clasp hands, and knock the teeth seven times. Then, gaze upward and visualize the Seven Stars, making them radiant in the north. After a long while, recite this subtle invocation:\n\n*\"First, the Supreme Star: Mysterious Pivot, Yang Brightness, Celestial Pivot, Soul Spirit, Supreme Mystery’s Nine Lords.\"*\n\nCall upon them seven times. Then recite again:\n\n*\"May the yang sins and yang transgressions of my seven generations, down to my own body, all be dissolved. May all I undertake be as I wish, all matters align with my heart. May I traverse the Seven Origins, harmonize with Heaven, have my name inscribed in the Morning Dipper, and extend my lifespan by billions and thousands.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your heart. Visualize the heart’s light, making inner and outer radiantly clear. Focus intently. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow. This is called *Dissolving the Morning’s Entangled Net and Illuminating the Inner Dao*.\n\nDuring the *jia-xu* cycle, on the *ding-chou* day at midnight, sit upright on the bed, face north, clasp hands, and knock the teeth seven times. Then, gaze upward and visualize the Seven Stars, making them radiant in the north. After a long while, recite this subtle invocation:\n\n*\"Second, the Origin Star: Northern Terrace, Yin Essence, Celestial Vertical, Soul Spirit, Supreme King’s Nine Lords.\"*\n\nCall upon them seven times. Then recite again:\n\n*\"May the yin sins and yin transgressions of my seven generations, down to my own body, all be dissolved. May the Six Qi be full, the Four Spirits equally numinous. May I traverse the Seven Origins, have my name inscribed in the Jade Book, ascend to the Purple Clarity, ride the mysterious chariot, and move freely with auspicious correctness, in harmony with Heaven.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your spleen. Make them illuminate inner and outer, the five viscera distinct. As the stars enter your mouth, let your eyes perceive their radiance scattering and filling your mouth, a slight warmth in the mouth signifying the stars’ essence has entered. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nDuring the *jia-shen* cycle, on the *ding-hai* day at midnight, sit upright on the bed, face north, clasp hands, and knock the teeth seven times. Then, gaze upward and visualize the Seven Stars, making them radiant in the north. After a long while, recite this subtle invocation:\n\n*\"Third, the Perfected Star: Nine Ultimates, Supreme Perfected, Supreme Origin’s Lady, Celestial Mechanism, Po Essence, Supreme Simplicity’s Nine Lords.\"*\n\nCall upon them seven times. Then recite:\n\n*\"May the death sins and death transgressions of my seven generations, down to my own body—accumulated evils, private concealments, and violations of the Three Officials of Heaven, Earth, and Water—all be dissolved. May my eyes see clearly, penetrating even the obscure. May I traverse the Seven Origins, have my name inscribed in the Upper Clarity, command the myriad spirits, ascend to the Jade Court, ride the luminous chariot through the void, and harmonize with Heaven.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your liver. Make their light illuminate the five viscera, inner and outer radiantly clear. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn the *jia-wu*旬 (ten-day period) and *ding-you* day, at midnight, sit upright on your bed, face north, clasp your hands, and knock your teeth seven times. Then, gaze upward and visualize the seven stars shining brightly in the north. After a long while, softly recite:\n\n*\"The Fourth Pivot Star, Rotating Root of the Dark and Mysterious Heaven, drives forth the Essence of the Hun to the Nine Lords of the Upper Void.\"*\n\nRecite this seven times. Then, recite again:\n\n*\"May the ungrateful and unvirtuous deeds of my seven generations—down to my own body—my lack of benevolence and filial piety, and the countless hidden evils, all be dissolved. May I ingest essence and absorb vitality, daily growing in strength. May I ascend through the Seven Origins, have my name inscribed in the Great Mystery, be listed among the Jade Emperor’s court, ride the swift winds of the Nine Heavens, command spirits and guide numinous beings, and renew with the sun and moon.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your spleen. Let their light illuminate and penetrate the five viscera. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn the *jia-chen*旬 and *ding-wei* day, at midnight, sit upright on your bed, face north, clasp your hands, and knock your teeth seven times. Then, gaze upward and visualize the seven stars shining brightly in the north. After a long while, softly recite:\n\n*\"The Fifth Principle Star, Heavenly Balance of the Cinnabar Origin and Jade Pivot, drives forth the Numinous Hun to the Nine Lords of the Upper Primordium.\"*\n\nRecite this seven times. Then, recite again:\n\n*\"May the inner and outer defilements of my seven generations—down to my own body—my hidden and manifest transgressions, countless as the sands, recorded in the dark prisons, all be dissolved. May my body be filled and my qi abundant, the Yellow Court governing my stomach. May the Upper and Middle harmonize with the Lower, the Primordial Simplicity casting its radiance. May my name be inscribed in the Purple Palace, attended on the right by Jade Maidens and on the left by Jade Lads. May I shine with the sun and moon, and be enthroned as a Perfected King.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your stomach. Let their light brightly illuminate and distinguish the five viscera. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn the *jia-yin*旬 and *ding-si* day, at midnight, sit upright on your bed, face north, clasp your hands, and knock your teeth seven times. Then, gaze upward and visualize the seven stars shining brightly in the north. After a long while, softly recite:\n\n*\"The Sixth Chronicle Star, Life’s Mechanism of the Northern Culmen, drives forth the Numinous Hun of the Radiant Yang to the Nine Lords of the Cinnabar Void and August Sovereign.\"*\n\nRecite this seven times. Then, recite again:\n\n*\"May the thieving and malevolent sins of my seven generations—down to my own body—my treacherous, rebellious, and reckless transgressions, recorded in the imperial archives, all be dissolved. May the hundred diseases be cured, my body and qi flourish in uprightness. May my name be inscribed on the Immortal Terrace, carved in gold in the Upper Clarity. May I command the myriad spirits and traverse the Nine Luminaries.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your kidneys. Let their light brightly illuminate and distinguish the five viscera. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn yang days, visualize the stars entering the left kidney; on yin days, the right kidney. The first day is yang, the second yin.\n\nThis practice strictly forbids exposure to blood, filth, or foul odors, as well as the consumption of meat or pungent foods. Violations will bring misfortune upon the seven ancestors and calamity upon oneself, leading to death as a lowly ghost and expulsion from the imperial gates.\n\nOn the evening of the last day of the lunar month, before the next day’s dawn (the first day of the new moon), before the crow of the rooster, sit upright on your bed in your chamber, face east, clasp your hands, and knock your teeth seven times. Then, gaze upward and visualize the seven stars of the north shining brightly to your left. After a long while, softly recite:\n\n*\"The Seventh Barrier Star, Dark Yang of the Heavenly Gate, Shaking Radiance of the Great Luminous, Supreme Jade Emperor and Dao Lord.\"*\n\nRecite this seven times. Then, recite again:\n\n*\"May the hidden and obscure sins of my seven generations—down to my own body—my violations of the Five Punishments and the spirits within, countless as the sands, recorded in the Ghost Officials of the Northern Emperor, all be dissolved. May my spirit and essence flow freely, granting me the power to sit or stand at will. May my ears hear beyond sound, my eyes emit purple light. May my name be inscribed in the Jade Simplicity, my vision penetrating the forms of ghosts. May my name be recorded by the Imperial Lord, my fate equal to the Two Luminaries. May I traverse the Seven Origins and repose in the Purple Court.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your pupils, illuminating both eyes, and allowing inner and outer vision. Visualize the five viscera distinctly.\n\nOn yang days, visualize the stars entering the left pupil; on yin days, the right pupil. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn the six *jia* days, at midnight—the time when generative qi arises—lie or sit on your bed in your chamber, your head facing any direction. Clench your fists, hold your breath, and settle your spirit. After a long while, knock your teeth nine times. Then, visualize the nine stars of the Northern Dipper shining brightly above your crown, their radiance intermingling. Softly recite:\n\n*\"The Eighth Imperial Star, Lofty Jade Emperor and Spirit of the Eight Effulgences; the Ninth Revered Star, Supreme Jade Emperor of the Great Tenuity and the Seven Dawns of Primordial Simplicity.\"*\n\nRecite this nine times. Then, recite again:\n\n*\"May the great and small sins of my nine generations of ancestors—down to my own body—my transgressions in hills, mountains, and water sources, those recorded in the Registers of the Dead, my hidden evils, concealed treacheries, and deceits, countless as the sands, listed in the Ghost Emperor’s archives on Mount Feng, the offenses under the statutes of death, recorded in the Black Registers of the Nine Primordials of the Northern Uppermost and the Great Ultimate Perfected Ones—be beseeched before the Nine Primordials, the Supreme Emperor, the Revered Jade Mystery Lord, to be dissolved in every instance. May I traverse the Seven Paths, ascend to the Jade Clarity, wander the Great Void, ride the radiance of dawn’s birth, repose in the Eight Simplicities of the North, harmonize with the sun, collectively attend the August Consort, and govern the myriad spirits.\"*\n\nThen, visualize the Seven Stars of the Northern Dipper descending from heaven and entering directly into the Purple Chamber of my Mud-Palace, causing its radiance to illuminate the Mud-Palace thoroughly and extend its luminous brilliance to permeate my entire body and the five viscera, so that inner and outer are suffused with purple-cloud qi, dense and luxuriant. Hold this vision steadfastly.\n\nWhen the visualization is complete, bow twice in the heart, then swallow saliva twenty-seven times.\n\nOn the days of the Six Jia or the last day of the lunar month, as well as on the days of the Six Ding, the visualization may be adjusted in frequency to suit one’s condition, without requiring excessive repetition.\n\nIn all matters, follow this model, ensuring the full perfection of the true method.\n\nHere ends the Supreme Clarity’s *Dao of Returning to the Origin and Atoning for Transgressions*. The *Perfected Explication of Absolving Transgressions* from the *Cavern of Supreme Clarity* is complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清洞真解过诀 经名：上清洞真解过诀。 撰人不详，约出矜南北期。 系纂集上清派谢罪解过经诀而成。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 上清洞真解过诀 清灵真人裴君八节日谢罪第一 清灵真人裴君曰：太极真人常以立春日日中时，会仙人於太极宫，刻玉简，记仙名。 常以其夕夜半时，正北向，仰视北极，再拜顿首，陈己罪多少之数，求解释之意毕，复再拜，乃止。 至春分之日，日中之时，昆仑瑶台太素真人会诸仙官，定真经。 至立夏之日，日中之时，上清五帝会诸仙人於紫微宫，见四真人，论求道之功罪。 至夏至之日，日中，天上三官会於司命、河侯，校定万民罪福，增年减算。 至立秋之日，日中，五岳诸真人诣中央黄老君於黄房云庭山，会仙官於日中，定天下神图灵药。 至秋分之日，日中之时，上皇太帝乃登上清灵阙太微之馆，会太上三老君、北极诸真公、八海大神、五岳尊灵仙官万万，共集议天下万兆之罪福，记学道之懃懈，一一条列，付之司命。 至立冬之日，日中，阳台真人会诸仙官玉女，新定得道始入仙名录籍。 至冬至之日，日中，天真众仙皆诣方诸东华太宫，诣东海青童君，刻定众仙籍金书内字。 常以八节夕、夜半、日中，谢七世祖、父母罪，及自身中罪过，过名自除也。 久行之，神仙不死。 夫秋分、春分日，太上神真观议万仙，自非真正者，不可轻用其日谢罪也。 众真仙官，以八节日日中共会集，凡三日乃解。 欲修道者，当先斋戒，勿失之也。 支子元受蒋先生第五首之诀，以八节之日存思，陈己立身以来罪过多少之数，输诚自状以上，希天皇诸真关写之佑，克身归善，以求长生神仙者也。 盖秋分之节者，气处清虚，太和之正日也。 众真诸仙，是其日皆听讼焉。 又地上刺奸吏部境诸仙官，并纠奏所在道士之功过，及万民有罪死生者也。 《仙忌真记》曰：子欲升天慎秋分，罪无大小皆上闻，以罪求仙仙甚难，是故学道为心寒。 此是朱火丹陵仲阳先生之要言矣。 秋分气调日中，以顺天地者也。 夫大炎之气，摧於凋落之势，玄水包津，胎於金生之府，乃太阳光转少阳，藏养天地，於是所以定刚柔之际，合二象之序，焕成流明，乃别阴阳三光，实八节之标日，求道之要梯矣。 每至其日日中之时，上皇太帝君玉尊陛下，乃登广寒上清灵宅，太空之阙丹城紫台长锦玉楼，群真集于太微之观，上关九天之门，请九天之真皇，中邀太上三老君、北极诸真，及八海大神，下命五岳名山诸得仙者。 灵 尊万万，并会於寥阳之殿，共集议定天下万民之罪福，纪录学道求仙者之懃懈，疏识犯过日月，修行善恶刑罚之科，生死之状，各随其所属部境，根源条列，付之司命，书于皇录，罪福纤芥，刻于丹城之籍，伏匿之犯恶，阴德之细功者，无不一一缕别而知之者也。 其夕夜半，当出中庭，北向仰视北极，脱巾再拜，顿首长跪，上启太上北极天尊大帝君，因密谢七世祖、父母罪，及自陈己立身以来罪过多少之状，乞得赦贷，从今自去，改往修来之言，言必使信，誓于丹心，盟於天地，不敢犯恶之行也。 其中言在意陈之，久行之，神仙不死。 毕云：愿太上皇帝削某罪名，移书三官，使神仙之录某厕玉札，长生久视，通真达灵。",
      "translated_text": "**The Upper Clarity Scripture of Resolving Transgressions: Jade Instructions**\n\n**Preface to the Scripture**\n*Title:* The Upper Clarity Scripture of Resolving Transgressions: Jade Instructions. Author unknown, approximately dated to the Northern and Southern Dynasties. Compiled from the Upper Clarity tradition’s scriptures and instructions for repentance and absolution. One scroll. Base text from *The Orthodox Daoist Canon*, Cavern Mystery Section, Jade Instructions category.\n\n---\n\n**The Upper Clarity Scripture of Resolving Transgressions**\n\n**First: The Eight Seasonal Days of Repentance by the Perfected Lord Pei of Pure Numinosity**\n\nThe Perfected Lord Pei of Pure Numinosity said: The Perfected Lord of the Great Ultimate regularly gathers with immortals at the Palace of the Great Ultimate on the noon of the *Lichun* (Beginning of Spring) day to inscribe jade tablets with the names of immortals.\n\nOn the midnight of that same evening, facing due north and gazing toward the North Star, one bows twice, prostrates, and confesses the number of one’s transgressions, seeking absolution. After stating one’s intent, one bows twice again and ceases.\n\nOn the noon of the *Chunfen* (Spring Equinox) day, the Perfected Lords of the Jade Terrace of Kunlun and the Great Simplicity gather with all immortal officials to establish the true scriptures.\n\nOn the noon of the *Lixia* (Beginning of Summer) day, the Five Emperors of the Upper Clarity convene with all immortals at the Purple Tenuity Palace to meet the Four Perfected Lords and deliberate the merits and transgressions of those seeking the Dao.\n\nOn the noon of the *Xiazhi* (Summer Solstice) day, the Three Officials of Heaven gather with the Controller of Destinies and the River Marquis to assess the sins and blessings of all people, adding or subtracting years from their lifespans.\n\nOn the noon of the *Liqiu* (Beginning of Autumn) day, the Perfected Lords of the Five Marchmounts visit the Yellow Elder Lord at the Yellow Chamber Cloud Court Mountain to convene with immortal officials at noon and determine the divine charts and numinous medicines of the world.\n\nOn the noon of the *Qiufen* (Autumn Equinox) day, the Supreme August Emperor ascends the Upper Clarity Numinous Watchtower of the Great Tenuity Palace to meet with the Three Elder Lords of the Most High, the Perfected Lords of the Northern Culmen, the Great Spirits of the Eight Seas, the Venerable Immortal Officials of the Five Marchmounts, and the myriad immortals. Together, they deliberate the sins and blessings of all beings under heaven, recording the diligence or negligence of Dao-seekers, itemizing each detail, and submitting them to the Controller of Destinies.\n\nOn the noon of the *Lidong* (Beginning of Winter) day, the Perfected Lord of the Yang Terrace gathers with immortal officials and jade maidens to newly determine and register the names of those who have just attained the Dao and entered the ranks of immortals.\n\nOn the noon of the *Dongzhi* (Winter Solstice) day, all the Perfected and Immortals proceed to the Eastern Flower Palace of the Square Cauldron to visit the Azure Lad of the Eastern Sea and inscribe the names of all immortals in the golden register of the immortal roster.\n\nRegularly, on the evenings, midnights, and noons of the eight seasonal days, one repents for the sins of one’s seven generations of ancestors and parents, as well as one’s own transgressions. By doing so, the names of these transgressions are erased. With prolonged practice, one becomes an immortal who does not die.\n\nOn the days of the Autumn and Spring Equinoxes, the Most High and the Perfected observe and deliberate the affairs of the myriad immortals. Those who are not truly upright must not lightly use these days for repentance.\n\nThe Perfected and Immortal Officials gather at noon on the eight seasonal days, and absolution is granted only after three days. Those who wish to cultivate the Dao must first purify themselves through fasting and not neglect this practice.\n\nThe fifth instruction received by Ziyuan from Master Jiang teaches that on the eight seasonal days, one should meditate and confess the number of transgressions committed since one’s birth, sincerely presenting one’s case in the hope that the Heavenly August and the Perfected will record one’s protection, enabling one to reform and return to goodness, thereby seeking long life and immortality.\n\nThe Autumn Equinox is a day when qi resides in pure emptiness, the true day of Great Harmony. On this day, all the Perfected and Immortals hear petitions.\n\nMoreover, the immortal officials of the Earthly Bureau of Censorious Clerks and the various departments impeach and report the merits and transgressions of Daoists in their respective regions, as well as the sins and life-and-death matters of all people.\n\n*The True Record of Immortal Taboos* states:\n*\"If you wish to ascend to heaven, be cautious on the Autumn Equinox;\nSins great and small are all heard above.\nSeeking immortality with sins is most difficult—\nThus, those who study the Dao grow cold at heart.\"*\n\nThese are the essential words of Master Zhongyang of the Vermilion Fire Cinnabar Mound.\n\nOn the Autumn Equinox, qi is harmonized at noon, aligning with Heaven and Earth. The great fiery qi is subdued by the withering force, while the dark water envelops the essence, nurtured within the palace of metal’s birth. Thus, the radiance of the Great Yang shifts to the Lesser Yang, storing and nourishing Heaven and Earth. At this juncture, the boundaries of hardness and softness are determined, the sequences of the two images are united, and luminous brilliance is manifested. The three luminaries of yin and yang are distinguished, marking the standard days of the eight seasons and the essential ladder for seeking the Dao.\n\nEach time this day arrives at noon, the Jade August Emperor, the Supreme August Emperor, ascends the Vast Cold Upper Clarity Numinous Abode, the Crimson City Purple Terrace of the Celestial Watchtower in the Great Void, where the multitudes of Perfected gather at the Terrace of the Great Tenuity. Above, they open the gates of the Nine Heavens to summon the Perfected August Ones of the Nine Heavens; in the middle, they invite the Three Elder Lords of the Most High and the Perfected Lords of the Northern Culmen; and below, they command the Perfected of the Five Marchmounts and the famous mountains who have attained immortality. The myriad numinous and august ones convene at the Palace of the Vast Yang to collectively deliberate and determine the sins and blessings of all people under heaven, recording the diligence or negligence of those who study the Dao and seek immortality. They itemize the days of transgressions, the measures of good and evil in cultivation, the forms of rewards and punishments, and the conditions of life and death, each according to their respective departments and origins, and submit them to the Controller of Destinies. These are inscribed in the August Register, where sins and blessings, no matter how minute, are carved into the registers of the Crimson City. Hidden crimes and secret virtues, no matter how slight, are all distinctly known.\n\nOn the midnight of that evening, one should go to the central courtyard, face north, gaze toward the North Star, remove one’s headscarf, bow twice, prostrate, and kneel to reverently address the Most High, the August Emperor of the Northern Culmen. One secretly repents for the sins of one’s seven generations of ancestors and parents, and confesses the number of transgressions committed since one’s birth, beseeching pardon and vowing from this day forward to reform past wrongs and cultivate future goodness. One’s words must be sincere, one’s oaths engraved in the cinnabar heart, and one’s pledges sworn before Heaven and Earth, never daring to commit evil deeds again.\n\nOne should express these words with utmost sincerity. With prolonged practice, one becomes an immortal who does not die.\n\nUpon completion, one says:\n*\"May the Most High Emperor erase my name from the record of sins and transfer the document to the Three Officials, allowing my name to be inscribed in the jade roster of immortals, attaining long life, eternal vision, communion with the Perfected, and penetration to the numinous.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1273,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.91387343406677,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清洞真解过诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "毕，又叩头四下，再拜而还静室，深自克责，并存念三元中神，令上启太上。 如此者三，名上仙籍，罪咎除灭也。 三元，泥丸、绛宫、丹田三神也。 存念三元三神，上启天尊，求乞恩赦，助己所陈，令必上闻者也。 三启秋分，生籍乃定，死名乃除。 此一法出经命青图，是长生秘法矣。 俗人虽好道，未离人间，人间甚多罪咎，犯之者非一，恐未便可施用秋分首过之法也。 入山林中，远去人事，萧然独处，不犯万物，乃可为之。 既有反善之辞誓，有改行之言，言已闻於高上之听，慎不可复使犯恶违生之事也。 重犯罪十过，天地弗赦，身死为验，非可复改补者矣。 以此求道，无所复索也。 养生有如水火之交耳，得其益则白日升天，犯戒法则身没三泉也。 又其日尤重於七节，赵伯玄所谓生死门户者也。 《三九素语》曰：秋判之日，尊卑尽会，生死之日也。 古人以秋分日，为秋判日也。 所以尔者，秋分之日，乃会九天八地众真仙神上皇至尊，三日三夕，共定万民之命。 所聚议者咸多，而神尊并集故也。 诸八节日，会天地诸真官，先后及节，凡三日三夕，而各还所司。 此是支公子元诀，别此一事，不杂七节之条例也。 候夜神童《金根经》曰：八节之日，求仙极会，天命众真，皆当集对。 未节一日，万灵诣阙，节日日中，尊卑入谒，节后一日，罪福分别，三日三夕，天事乃毕。 子其慎罪，务为功德，名可上真，列编太极。 吾不诡言，知者深密，急宜谢过，秘而慎泄。 此亦支公口所告出，以传示裴君。 许先生八节日谢罪第二 许先生口诀曰：常以八节日夜半之后，平坐北向，存形念景，令如见兆身。 毕，以两手交头上，以叩地二九过，则罪咎除，形景得分。 许先生五通日为先人谢罪第三 常以五通日，北向谢请兆三曾五祖先人之谪，则兆先世罪咎解也。 五通日者，十月朝，二月日一是也。 不解先人负谪，欲求仙，去仙远矣。 许先生五达日为先人及己身谢罪第四 以五达之日，北向五再拜，心呼上皇君及夫人名字三过： 岁星真皇郁粲郁粲郁粲，夫人飞云飞云飞云。 荧惑真皇维停维停维停，夫人华瓶华瓶华瓶。 镇星真皇耽延耽延耽延，夫人非贤非贤非贤。 太白真皇德标德标德标，夫人灵恩灵恩灵恩。 辰星真皇精原精原精原，夫人龙娥龙娥龙娥。 右五皇夫人专字，先文无出，此乃昭灵夫人别口诀。 毕，叩齿五通毕，解巾长跪，谨启五星日月上皇高真道君、道君夫人、玉清太上上清上皇上帝、大道圣君几前，因陈七祖父母以下，下及一．身千罪万过，上世以来乞得解脱，三官告下天帝，使罪名离释，消除丹简。 乞得与五星之真，俱奔华晨，上登上清，交行玉阙。 正月六日中时，",
      "translated_text": "Upon completion, one kowtows four times, bows again, and returns to the quiet chamber, deeply reproaching oneself while visualizing the spirits of the Three Origins, causing them to ascend and report to the Most High. Doing this thrice inscribes one’s name in the register of immortals and erases all sins and transgressions.\n\nThe Three Origins refer to the spirits of the Mud-Pill Palace, Crimson Palace, and Cinnabar Field. By visualizing the Three Origins and their spirits, one petitions the Heavenly Worthy, beseeching mercy and aid in ensuring one’s words ascend and are heard. After three petitions on the Autumn Equinox, the register of life is fixed, and the name of death is removed.\n\nThis method derives from the *Scripture of the Azure Chart*, a secret art of longevity. Though common folk may favor the Dao, they remain entangled in the human realm, where transgressions abound and violations are manifold. Thus, the Autumn Equinox method of confessing faults may not yet be applicable. Only by entering the mountains and forests, distancing oneself from worldly affairs, dwelling in solitude, and refraining from harming all things may one perform it. Having sworn oaths of repentance and vows of reform, one’s words have reached the hearing of the Most High—one must take care never again to commit deeds that violate life and transgress the Dao. Should one repeat offenses tenfold, Heaven and Earth will not forgive, and death shall serve as proof; no further amendment or remedy will be possible. Seeking the Dao in this manner will yield nothing. Nurturing life is like the interplay of water and fire: gaining its benefit leads to ascension in broad daylight, while violating its precepts results in descent into the Three Springs.\n\nThis day holds particular weight among the seven nodal days, for it is what Master Zhao Boxuan called the \"gateway of life and death.\" The *Three-Nine Plain Discourse* states: \"On the day of autumnal judgment, high and low assemble, for it is the day of life and death.\" The ancients regarded the Autumn Equinox as the day of autumnal judgment. The reason lies in this: on the Autumn Equinox, the Perfected, immortals, and spirits of the Nine Heavens, Eight Lands, and Supreme August Thearch gather for three days and nights to determine the fate of all people. The matters deliberated are many, and the assembled deities are of the highest rank.\n\nOn each of the eight nodal days, the celestial and terrestrial Perfected officials convene in succession, remaining for three days and nights before returning to their respective domains. This is the oral instruction of Master Zhi Gongzi, distinct from the regulations of the seven nodal days.\n\nThe *Golden Root Scripture* of the Night-Watching Divine Youth states: \"On the eight nodal days, the assemblies for seeking immortality reach their peak, as the Mandate of Heaven summons all Perfected to gather. One day before the node, the myriad spirits approach the palace; at noon on the nodal day, high and low enter to pay homage; one day after the node, sins and blessings are distinguished. For three days and nights, celestial affairs are concluded. Beware of transgressions, strive to accumulate merit, and your name may ascend to the Perfected, inscribed in the Great Ultimate. I do not speak falsely—those who understand must keep this deeply secret. Hasten to confess your faults, and guard this teaching with care.\" This, too, was an oral transmission from Master Zhi Gong, passed down to Master Pei.\n\n**Second Method: Confessing Faults on the Eight Nodal Days (by Master Xu)**\nMaster Xu’s oral instruction states: On the eight nodal days, after midnight, sit upright facing north, visualize your form and spirit until they appear manifest. Upon completion, cross your hands above your head and knock your head on the ground thirty-six times—thus sins and transgressions are erased, and form and spirit attain union.\n\n**Third Method: Confessing Faults for Ancestors on the Five Penetrating Days (by Master Xu)**\nOn the Five Penetrating Days, face north and beseech the exile of one’s three generations of ancestors and five generations of forebears, thereby dissolving the sins and transgressions of one’s forebears. The Five Penetrating Days are the first day of the tenth month and the first day of the second month. Without resolving the burdens of one’s ancestors, one’s pursuit of immortality will remain distant.\n\n**Fourth Method: Confessing Faults for Ancestors and Oneself on the Five Pervading Days (by Master Xu)**\nOn the Five Pervading Days, face north and bow five times, calling aloud the names of the August Lords and their consorts three times:\n- The True August of Jupiter: Yu Can, Yu Can, Yu Can; Lady Flying Cloud, Flying Cloud, Flying Cloud.\n- The True August of Mars: Wei Ting, Wei Ting, Wei Ting; Lady Hua Ping, Hua Ping, Hua Ping.\n- The True August of Saturn: Dan Yan, Dan Yan, Dan Yan; Lady Fei Xian, Fei Xian, Fei Xian.\n- The True August of Venus: De Biao, De Biao, De Biao; Lady Ling En, Ling En, Ling En.\n- The True August of Mercury: Jing Yuan, Jing Yuan, Jing Yuan; Lady Long E, Long E, Long E.\n\nThe personal names of the Five August Consorts have no prior textual source; these are the separate oral instructions of Lady Zhaoling. Afterward, knock the teeth together five times, remove the headscarf, and kneel lengthily. Reverently address the August Lords of the Five Stars and the Moon, the High Perfected of the Dao, the Ladies of the Dao, the Most High of Jade Purity, the Supreme August Thearch of Highest Clarity, and the Sagely Lord of the Great Dao before them, confessing the myriad sins and transgressions of one’s seven generations of ancestors and parents down to oneself, beseeching liberation. Petition the Three Officials to report to the Heavenly Thearch, that one’s name may be severed from guilt and erased from the cinnabar tablets. Pray to join the Perfected of the Five Stars, together ascending to the radiant dawn, entering Highest Clarity, and traversing the Jade Towers.\n\nOn the sixth day of the first month at noon...",
      "overlap_context": " before Heaven and Earth, never daring to commit evil deeds again.\n\nOne should express these words with utmost sincerity. With prolonged practice, one becomes an immortal who does not die.\n\nUpon completion, one says:\n*\"May the Most High Emperor erase my name from the record of sins and transfer the document to the Three Officials, allowing my name to be inscribed in the jade roster of immortals, attaining long life, eternal vision, communion with the Perfected, and penetration to the numinous.\"*",
      "start_char": 1273,
      "end_char": 2332,
      "start_sentence": 36,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.129642486572266,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清洞真解过诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "二月一日哺时， 三月七日夜半， 四月九日食时， 五月十五日夜半， 六月三日中时， 七月七日夜半， 八月四日中时， 九月二日平旦， 十月一日平旦， 十一月六日夜半， 十二月十二日夜半。 右记五达吉日。 太上藏五通之日，封於五岳之玉笋，隐回元之道，隐於九晨之宫。 既修五通，当行回元，五通开於帝始，回元开於玄终。 故修五通，行七元回道者，不食血腥物，见诸尸秽，犯者受太玄考。 五通者，太上之吉会日。 回元者，太上之更新日也。 不知五通，不得解罪除过，不知回元隐道，不得刻名上真。 常以其日，思存吉事，首谢身中罪过，所谓解免七世，离脱刑名者也。 不以示九宫中仙矣。 太一首谢除罪夜半日中谢罪第五 太一曰：兆若有罪过，欲首谢求除罪者，夜半及日中，入室闭户端坐，北向存帝君在兆紫房中，存思如上，因又存兆身在紫房中，伏帝君前，内自陈愆，屏气良久，匝令一身汗出，衣服沾蒸。 如此者三过，所解罪自散也。 汗匝一体，乃祝曰： 某甲有罪，上闻百神，乞度七九，水火之患，守命太一，丐济帝君，汗流一体，怖在三魂，恩惟太上，永令除患。 毕，因三呼帝君名字。 帝君讳陵梵，字履昌灵，一名七灵，一名神丈人，常治太极紫房中，端坐平正，貌如婴儿之状。 常有紫气覆其神形，衣．五色华衣，巾日月之冠，左耳上有日径九寸，右耳上有月径一尺。 存毕，乃开目。 名曰帝君解过之道，内谢五神，流汗为应矣。 世人谢过，乃叩头搏颊，此外法也。 若修三一守洞房，事帝君奉太一者，慎不可以叩头搏颊也。 人叩头者，惊三魂，扰泥丸，懆紫房，烦帝君也。 夫人搏颊者，坚胞结，东魄筋，太一悲，五神迁，乃大忌也。 若所行所念，但心存叩头搏颊，亦内解於心中矣。 仙人存心拜而已，形不屈也，吾谓为宜。 刘先生辰巳五德日为先人举家谢过第六 刘先生记曰：人多罪过，天网疏而不漏，阴夺人算，故不寿。 虽有生道在於身中，而不谢过，则多疾病忧患也。 此文出《太微文昌河图内篇》第二十三。 其人家轗轲衰耗，或所为不成，或子孙不昌，或为吏不迁，或六畜死亡，或飞祸横集，皆由多过之故也。 能洗垢清心，不淫不嫉，不行非理，慈仁恻隐，忧人之忧，乐人之乐，见人所失如己之失，见人有得如己有得，不为谗贼，不行两舌，布施救患，日益寿命，常得所愿。 乃以辰巳之日黄昏时，扫除天德之地，谓甲庚丙辛壬地是也。 烧香，举家北向，解巾叩头数十下，口勿言，但心中言，愿解举家身中所犯罪过，如此则可得平安长生。 其作过不止，虽数谢亦无所益矣。 既不有过，能常修此谢过之道，则永无忧患。",
      "translated_text": "On the first day of the second month at the evening meal hour, the seventh day of the third month at midnight, the ninth day of the fourth month at breakfast hour, the fifteenth day of the fifth month at midnight, the third day of the sixth month at noon, the seventh day of the seventh month at midnight, the fourth day of the eighth month at noon, the second day of the ninth month at dawn, the first day of the tenth month at dawn, the sixth day of the eleventh month at midnight, and the twelfth day of the twelfth month at midnight—these are the five propitious days of convergence.\n\nThe Most High concealed the days of the Five Penetrations within the Jade Bamboo Shoots of the Five Marchmounts, hiding the Way of Returning to the Origin within the Palace of the Nine Dawns. Having cultivated the Five Penetrations, one must practice the Return to the Origin. The Five Penetrations open at the Emperor’s Beginning, while the Return to the Origin opens at the Mysterious End. Thus, those who cultivate the Five Penetrations and practice the Seven Origins’ Way of Return must abstain from consuming bloody or foul substances and avoid all corpses and impurities. Violators shall face the trials of the Great Mystery.\n\nThe Five Penetrations are the Most High’s days of auspicious assembly; the Return to the Origin is the Most High’s day of renewal. Without knowing the Five Penetrations, one cannot dissolve sins or erase transgressions; without knowing the hidden Way of the Return to the Origin, one’s name cannot be inscribed among the Perfected. On these days, one should meditate upon auspicious matters, first repenting the sins and transgressions within one’s body—this is what is meant by liberating seven generations and severing oneself from penal bonds. Failure to do so will bar one from the immortals of the Nine Palaces.\n\n**The Primordial One’s Method for Repenting and Dissolving Sins at Midnight and Noon (Fifth)**\nThe Primordial One states: If you have sins and transgressions and wish to repent and seek their dissolution, at midnight or noon, enter a chamber, close the door, sit upright, and face north. Visualize the Imperial Lord within your Purple Chamber, as described above. Then visualize yourself within the Purple Chamber, prostrating before the Imperial Lord, inwardly confessing your faults. Hold your breath for a long while until your entire body is drenched in sweat, your clothes soaked through. Repeat this three times, and the sins you dissolve will naturally disperse.\n\nWhen your whole body is bathed in sweat, recite the following prayer:\n*\"So-and-so has sinned, his transgressions known to the hundred spirits. I beseech deliverance from the seventy-two perils of water and fire. Guardian of Destiny, Primordial One, I implore the Imperial Lord for salvation. My sweat flows through my body, my Three Hun tremble in fear. I humbly entreat the Most High to forever remove my afflictions.\"*\n\nAfterward, call the Imperial Lord’s name three times. The Imperial Lord’s taboo name is *Lingfan*, his style *Lǚchānglíng*; he is also called *Seven Spirits* or *Divine Elder*. He constantly resides in the Purple Chamber of the Great Ultimate, seated in perfect uprightness, his countenance like that of an infant. A purple qi ever shrouds his divine form; he wears a robe of five-colored radiance and a crown adorned with the sun and moon. Upon his left ear rests a sun nine inches in diameter; upon his right, a moon one foot across. Once the visualization is complete, open your eyes. This is called the *Imperial Lord’s Way of Dissolving Transgressions*, an inner repentance to the Five Spirits, with sweating as its sign.\n\nThe worldly method of repentance involves kowtowing and striking one’s cheeks, but this is an external practice. Those who cultivate the Three Ones and guard the Grotto Chamber, serving the Imperial Lord and revering the Primordial One, must never kowtow or strike their cheeks. Kowtowing startles the Three Hun, disturbs the Mud-Pill Palace, agitates the Purple Chamber, and troubles the Imperial Lord. Striking one’s cheeks hardens the womb-knot, strains the Eastern Po’s sinews, grieves the Primordial One, and causes the Five Spirits to depart—this is a grave taboo. If, in thought or deed, one merely *visualizes* kowtowing or striking the cheeks, the repentance is inwardly accomplished. The immortals bow in their hearts alone, their forms unbending; this, I say, is fitting.\n\n**Master Liu’s Method for Repenting on Behalf of One’s Family on Chen-Si Days of the Five Virtues (Sixth)**\nMaster Liu records: People accumulate many sins, and though the Heavenly Net is wide, none escape its mesh. The unseen shortens one’s allotted years, thus cutting life short. Though the Way of life resides within the body, without repentance, one suffers illness, sorrow, and misfortune. This text is drawn from the *Twenty-Third Scroll of the Inner Chapters of the Taiwei Wenchang Hetu*.\n\nWhen a household experiences misfortune, decline, or failure in endeavors; when descendants do not flourish; when an official’s rank does not advance; when livestock perish; or when sudden disasters strike—all arise from the weight of transgressions. If one washes away filth, purifies the heart, refrains from excess and envy, avoids unprincipled conduct, cultivates compassion and empathy, shares others’ sorrows and joys, regards others’ losses as one’s own and others’ gains as one’s own; if one does not slander, does not sow discord, practices charity, and rescues those in distress—then life will lengthen daily, and one’s wishes will be fulfilled.\n\nOn *chen-si* days at dusk, sweep and purify the ground of Heavenly Virtue (referring to the earth of *jia, geng, bing, xin,* and *ren*). Burn incense, and with the whole household facing north, remove your headscarves and kowtow dozens of times without speaking. Inwardly, pray: *\"May the sins and transgressions committed by our household be dissolved.\"* Thus may one attain peace and longevity. If wrongdoing continues unabated, even frequent repentance will be of no benefit. But if one commits no further transgressions and regularly practices this method of repentance, one shall forever be free from sorrow and misfortune.",
      "overlap_context": "the Great Dao before them, confessing the myriad sins and transgressions of one’s seven generations of ancestors and parents down to oneself, beseeching liberation. Petition the Three Officials to report to the Heavenly Thearch, that one’s name may be severed from guilt and erased from the cinnabar tablets. Pray to join the Perfected of the Five Stars, together ascending to the radiant dawn, entering Highest Clarity, and traversing the Jade Towers.\n\nOn the sixth day of the first month at noon...",
      "start_char": 2332,
      "end_char": 3383,
      "start_sentence": 78,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.45913624763489,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清洞真解过诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "甲辰、丙辰、戊辰、庚辰、壬辰、 己巳、辛巳、癸巳、乙巳、丁巳。 右五德日。 太上回元隐道用除罪籍回元五通之日谢过第七 太上回元隐道用除罪籍内篇曰：太上玉真隐元内观，用六丁之日。 是时天元敷陈，胞结重固，七魄上言，三魂记过，连愆七祖，积罚三阴，故有消除之法，以解脱愆罹。 施此道者，乃为求仙之大者矣。 诸思七元，存九晨之道，所寝林席不与他人同止，衣服亦然。 男女同席而息，乃列罪北玄之籍，若犯乎污秽者，逮殃注於地狱也。 师及同气相杂而止，亦为犯也。 五通者，太上之吉会日。 回元者，太上之更新日也。 不知五通，不得解罪除过。 不知回元隐道，不得刻名上真。 常以其日思存吉事，首谢身中罪过，所谓解脱七世，离脱刑名者也。 不以示九宫中仙矣。 太上藏五通之日，封于五岳之玉笋，隐回元之道，隐於九晨之宫。 既修五通，当行回元。 五通关於帝始，回元开於玄终。 故修五通，行七元回道者，不食血腥，勿见诸尸秽。 犯者受太玄考。 诸修洞房紫房中事，及存九晨七元者，眠初起初卦时，临食食毕，先微祝曰： 五皇五通，六合紫房，回元隐道，豁落七真，生魂者玄父，父变一成神，生魄者玄母，母化二生身，摄吾筋骨者公子，为吾精气者白元，长生久视，飞仙十天。 毕，勿令耳闻祝音。 此太上隐祝，以除邪气，致精神，使人终身不厌昧。 六甲之旬六丁之日月晦之夕六甲之日为七世父母解考八条第八 常以甲子之旬，丁卯之日，夜半之时，於寝状平坐，北向接手，叩齿七通，乃仰存七星，使焕明於北方，良久，微祝曰： 第一太星玄枢阳明天枢魂神上玄九君。 作七呼之，毕，乃又祝曰： 愿得除某七世以来，下逮某身阳罪阳过，皆令消除，所向如愿，万事合心，飞步七元，与天相倾，名刊斗晨，延纪 亿千。 毕，乃存北斗七星从天上而来，飞入我口，径在心中，存心光，令内外洞彻，极思念之。 毕，心存北向再拜，拜毕，咽液二九过，亦可起拜。 此谓解晨结罗内映上道。 甲戌之旬，丁丑之日，夜半之时，於寝床平坐，北向接手，先叩齿七过毕，乃仰存七星，使焕明於北方，良久，微祝曰： 第二元星北台阴精天纵魂神上王九君。 作七呼之，毕，乃又祝曰： 愿得除某七世以来，下逮某身阴罪阴过，皆令消除，六气盈满，四神同灵，飞行七元，名刊玉书，上登紫清，乘玄驾无，出入利贞，与天同符。 毕，乃存北斗七星从天中而来，飞入我口，径在脾中，使洞鉴内外，五脏分明。 存星来入口，当令目觉光芒四散满口，口中小热，即星精来入之验也。 毕，心存北向再拜，拜毕，咽液二九过，亦可起拜。 甲申之旬，丁亥之日，夜半之时，於寝状平坐，北向接手，叩齿七过毕，乃仰存七星，使焕明於北向，良久，微祝曰： 第三真星九极上真上元夫人天机魄精上素九君。 作七呼之，毕，乃祝曰： 愿得除某七世以来，下逮某身死罪死过，积恶私匿，违犯天地水三官者，皆令消除，目明彻视，鉴洞幽无，飞行七元，名书上清，役使万神，上登玉庭，驾景乘空，与天相倾。 毕，乃存北斗七星从天而来，下飞入我口，径在肝中，使光照五脏，内外洞明。 毕，心存北向再拜，拜毕，咽液二九过，亦可起拜。",
      "translated_text": "The *jia-chen*, *bing-chen*, *wu-chen*, *geng-chen*, *ren-chen*, *ji-si*, *xin-si*, *gui-si*, *yi-si*, and *ding-si* days.\n*(Listed above: the Five Virtue Days.)*\n\n**The Seventh Method of Repentance on the Five Dao-Returning Days for Dissolving the Register of Sins in the Hidden Dao of the Supreme Return**\n\nThe *Inner Chapter on Dissolving the Register of Sins in the Hidden Dao of the Supreme Return* states: The Supreme Jade Perfected Concealed Origin’s Inner Contemplation employs the *ding* days of the six *ding*. At this time, the Celestial Origin unfolds its array; the primordial matrix is doubly secured. The seven *po* ascend to report, and the three *hun* record transgressions. Offenses bind seven generations of ancestors, and accumulated punishments weigh upon the Three Yin. Thus, there exists this method of dissolution to absolve entanglements and calamities.\n\nThose who practice this Dao are truly the greatest among seekers of immortality. Reflect upon the Seven Origins, contemplate the Dao of the Nine Mornings. The sleeping mats and bedding must not be shared with others, nor should clothing. If men and women share a bed, their names are inscribed in the Register of Northern Darkness. Those who violate defilement will have their misfortunes recorded in the earthly prisons. Even masters and kin sharing a resting place commit an offense.\n\nThe *Five Penetrations* are the auspicious assembly days of the Supreme. The *Returning Origin* is the day of renewal for the Supreme. Without knowledge of the *Five Penetrations*, one cannot dissolve sins or erase transgressions. Without knowledge of the Hidden Dao of the Returning Origin, one cannot have their name inscribed among the Perfected. On these days, one should reflect upon auspicious matters and first repent the sins within one’s body—this is what is meant by \"dissolving the bonds of seven generations and escaping the records of punishment.\" One must not reveal this to the immortals of the Nine Palaces.\n\nThe Supreme conceals the *Five Penetration* days, sealing them within the Jade Bamboo of the Five Peaks. The Hidden Dao of the Returning Origin is concealed within the Palace of the Nine Mornings. Having cultivated the *Five Penetrations*, one should practice the Returning Origin. The *Five Penetrations* are linked to the Imperial Beginning; the Returning Origin opens at the Mysterious End. Thus, those who cultivate the *Five Penetrations* and practice the Dao of the Seven Origins’ Return must not consume blood or meat, nor witness corpses or defilement. Violators will face the trials of the Supreme Mystery.\n\nFor those who cultivate matters of the Purple Chamber in the Grotto Chamber and contemplate the Nine Mornings and Seven Origins: at the initial moment of sleep, the inception of the hexagram, before eating, and after meals, first recite this subtle invocation:\n\n*\"Five Emperors, Five Penetrations,\nSix Harmonies, Purple Chamber,\nReturning Origin, Hidden Dao,\nVast and Lofty Seven Perfected,\nThe soul’s begetter is the Mysterious Father—\nthe Father transforms into the One, becoming spirit.\nThe po’s begetter is the Mysterious Mother—\nthe Mother transforms into the Two, giving birth to the body.\nThe gatherer of my sinews and bones is the Duke’s Son;\nthe steward of my essence and qi is White Origin.\nLong life and enduring vision,\nascend as an immortal to the Ten Heavens.\"*\n\nUpon completion, ensure no one hears the invocation. This is the Supreme’s hidden prayer, used to dispel evil qi, summon spirit, and ensure one remains untroubled by obscurity throughout life.\n\n**The Eighth: Dissolving the Eight Trials of the Seven Generations’ Parents on the Six Jia Days, Six Ding Days, Month’s End Evenings, and Six Jia Days**\n\nRegularly, during the *jia-zi* cycle, on the *ding-mao* day at midnight, sit upright on the bed, face north, clasp hands, and knock the teeth seven times. Then, gaze upward and visualize the Seven Stars, making them radiant in the north. After a long while, recite this subtle invocation:\n\n*\"First, the Supreme Star: Mysterious Pivot, Yang Brightness, Celestial Pivot, Soul Spirit, Supreme Mystery’s Nine Lords.\"*\n\nCall upon them seven times. Then recite again:\n\n*\"May the yang sins and yang transgressions of my seven generations, down to my own body, all be dissolved. May all I undertake be as I wish, all matters align with my heart. May I traverse the Seven Origins, harmonize with Heaven, have my name inscribed in the Morning Dipper, and extend my lifespan by billions and thousands.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your heart. Visualize the heart’s light, making inner and outer radiantly clear. Focus intently. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow. This is called *Dissolving the Morning’s Entangled Net and Illuminating the Inner Dao*.\n\nDuring the *jia-xu* cycle, on the *ding-chou* day at midnight, sit upright on the bed, face north, clasp hands, and knock the teeth seven times. Then, gaze upward and visualize the Seven Stars, making them radiant in the north. After a long while, recite this subtle invocation:\n\n*\"Second, the Origin Star: Northern Terrace, Yin Essence, Celestial Vertical, Soul Spirit, Supreme King’s Nine Lords.\"*\n\nCall upon them seven times. Then recite again:\n\n*\"May the yin sins and yin transgressions of my seven generations, down to my own body, all be dissolved. May the Six Qi be full, the Four Spirits equally numinous. May I traverse the Seven Origins, have my name inscribed in the Jade Book, ascend to the Purple Clarity, ride the mysterious chariot, and move freely with auspicious correctness, in harmony with Heaven.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your spleen. Make them illuminate inner and outer, the five viscera distinct. As the stars enter your mouth, let your eyes perceive their radiance scattering and filling your mouth, a slight warmth in the mouth signifying the stars’ essence has entered. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nDuring the *jia-shen* cycle, on the *ding-hai* day at midnight, sit upright on the bed, face north, clasp hands, and knock the teeth seven times. Then, gaze upward and visualize the Seven Stars, making them radiant in the north. After a long while, recite this subtle invocation:\n\n*\"Third, the Perfected Star: Nine Ultimates, Supreme Perfected, Supreme Origin’s Lady, Celestial Mechanism, Po Essence, Supreme Simplicity’s Nine Lords.\"*\n\nCall upon them seven times. Then recite:\n\n*\"May the death sins and death transgressions of my seven generations, down to my own body—accumulated evils, private concealments, and violations of the Three Officials of Heaven, Earth, and Water—all be dissolved. May my eyes see clearly, penetrating even the obscure. May I traverse the Seven Origins, have my name inscribed in the Upper Clarity, command the myriad spirits, ascend to the Jade Court, ride the luminous chariot through the void, and harmonize with Heaven.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your liver. Make their light illuminate the five viscera, inner and outer radiantly clear. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.",
      "overlap_context": " *ren*). Burn incense, and with the whole household facing north, remove your headscarves and kowtow dozens of times without speaking. Inwardly, pray: *\"May the sins and transgressions committed by our household be dissolved.\"* Thus may one attain peace and longevity. If wrongdoing continues unabated, even frequent repentance will be of no benefit. But if one commits no further transgressions and regularly practices this method of repentance, one shall forever be free from sorrow and misfortune.",
      "start_char": 3384,
      "end_char": 4649,
      "start_sentence": 124,
      "end_sentence": 170,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.229544162750244,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清洞真解过诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "甲午之旬，丁酉之日，夜半之时，於寝床平坐，北向接手，叩齿七过毕，乃仰存七星，使焕明於北方，良久，微祝曰： 第四纽星旋根玄冥天推魄精上虚九君。 作七呼之，毕，乃又祝曰： 愿得除某七世以来，下逮某身无恩无德，不仁不孝，阴恶之罪，数千万计，皆令消灭，服食纳精，日以进益，飞登七元，录刊太玄，上列玉皇，乘欻九天，役神御灵，日月同新。 毕，乃存北斗七星从天而来，下飞入我口，径在脾中，使光明洞彻，映着五脏。 毕，心存北向再拜，拜毕，咽液二九过，亦可起拜。 甲辰之旬，丁未之日，夜半之时，於寝床平坐，北向接手，叩齿七过毕，乃仰存七星，使焕明於北方，良久，微祝曰： 第五纲星天平丹元玉衡魄灵上君上元九君。 作七呼之，毕，乃又祝曰： 愿得除某七世以来，下逮某身内外秽罪，表裹沈过，数千亿万，纪在幽关者，皆令消除，当令体充气盈，黄庭镇胃，中上刻下，太素垂景，标名紫宫，右侍玉女，左侍玉童，日月同晖，位为真王。 毕，乃存北斗七星从天上而来，下飞入我口，径在胃中，使光朗洞照，五脏分别。 毕，心存北向再拜，拜毕，咽液二九过，亦可起拜。 甲寅之旬，丁巳之日，夜半之时，於寝床平坐，北向接手，先叩齿七过，乃仰存七星，使焕明北方，良久，微祝曰： 第六纪星命机北极闿阳魄灵上丹 虚皇九君。 作七呼之，毕，乃又祝曰： 愿得除某七世以来，下逮某身所犯所行贼恶罪过，奸逆乱妄，列纪帝宫者，皆令消灭，百病康愈，体气利贞，名书仙台，刻金上清，役使万神，飞行九明。 毕，存北斗七星从天上而来，下飞入我口，径在肾中，使光明洞彻，五脏分别。 毕，心存向北再拜，拜毕，咽液二九过，亦可起拜。 阳日存在左肾，阴日存在右肾，一日为阳，二日为阴。 此道尤禁见血秽臭慢，杂食荤辛，则上注延於七祖，以下注祸其身，死为下鬼，名除帝门。 月晦之夕明日，月朔也。 未鸡呜之前，当於寝室床上，东向接手平坐，叩齿七过，乃仰存北方七星，使焕明於我之左面也。 良久，微祝曰： 第七关星玄阳天关摇光大明太上玉皇道君。 七呼之，毕，乃祝曰： 愿得除某七世以来，下逮某身暗昧私匿，犯罪五刑身中之神数千万亿，纪在北帝鬼官者，皆令消灭，当令某神精八达，坐在立亡，耳聪绝音，目生紫光，刊玉太素，洞鉴鬼形，名书帝君，命均二明，飞行七元，寝宴紫庭。 毕，存北斗七星从天而来，下径入我目瞳中，通映两眼，使内外自照，存见五脏，使分明。 阳日存星入左目瞳，阴日存星入右目瞳。 毕，心存北向再拜，拜毕，咽液二九过，亦可起拜。 六甲日夜半生气之时，於寝室床，卧坐首向随意也。 握固而闭气定神，良久，叩齿九过毕，存北斗九星，使焕明於顶上也。 九星光芒以相映及於是，乃微祝曰： 第八帝星高上玉皇神八景元君第九尊星太微玉帝君、太素七晨元君。 九过呼之，毕，乃祝曰： 愿得除某九世祖父母以来，下逮某身诸丘山水源大小罪过，名上死籍者，阴匿贼恶伏奸藏欺，事有亿万，列在鬼帝酆山上者，死罪条例之愆，纪于北上九元太极真人黑薄者，乞九元太上帝尊玉玄君，皆令事事消除，飞行七道，上登玉清，同游太无，乘景晨生，北晏八素，与日相倾，总朝皇妃，摄御万灵。",
      "translated_text": "On the *jia-wu*旬 (ten-day period) and *ding-you* day, at midnight, sit upright on your bed, face north, clasp your hands, and knock your teeth seven times. Then, gaze upward and visualize the seven stars shining brightly in the north. After a long while, softly recite:\n\n*\"The Fourth Pivot Star, Rotating Root of the Dark and Mysterious Heaven, drives forth the Essence of the Hun to the Nine Lords of the Upper Void.\"*\n\nRecite this seven times. Then, recite again:\n\n*\"May the ungrateful and unvirtuous deeds of my seven generations—down to my own body—my lack of benevolence and filial piety, and the countless hidden evils, all be dissolved. May I ingest essence and absorb vitality, daily growing in strength. May I ascend through the Seven Origins, have my name inscribed in the Great Mystery, be listed among the Jade Emperor’s court, ride the swift winds of the Nine Heavens, command spirits and guide numinous beings, and renew with the sun and moon.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your spleen. Let their light illuminate and penetrate the five viscera. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn the *jia-chen*旬 and *ding-wei* day, at midnight, sit upright on your bed, face north, clasp your hands, and knock your teeth seven times. Then, gaze upward and visualize the seven stars shining brightly in the north. After a long while, softly recite:\n\n*\"The Fifth Principle Star, Heavenly Balance of the Cinnabar Origin and Jade Pivot, drives forth the Numinous Hun to the Nine Lords of the Upper Primordium.\"*\n\nRecite this seven times. Then, recite again:\n\n*\"May the inner and outer defilements of my seven generations—down to my own body—my hidden and manifest transgressions, countless as the sands, recorded in the dark prisons, all be dissolved. May my body be filled and my qi abundant, the Yellow Court governing my stomach. May the Upper and Middle harmonize with the Lower, the Primordial Simplicity casting its radiance. May my name be inscribed in the Purple Palace, attended on the right by Jade Maidens and on the left by Jade Lads. May I shine with the sun and moon, and be enthroned as a Perfected King.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your stomach. Let their light brightly illuminate and distinguish the five viscera. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn the *jia-yin*旬 and *ding-si* day, at midnight, sit upright on your bed, face north, clasp your hands, and knock your teeth seven times. Then, gaze upward and visualize the seven stars shining brightly in the north. After a long while, softly recite:\n\n*\"The Sixth Chronicle Star, Life’s Mechanism of the Northern Culmen, drives forth the Numinous Hun of the Radiant Yang to the Nine Lords of the Cinnabar Void and August Sovereign.\"*\n\nRecite this seven times. Then, recite again:\n\n*\"May the thieving and malevolent sins of my seven generations—down to my own body—my treacherous, rebellious, and reckless transgressions, recorded in the imperial archives, all be dissolved. May the hundred diseases be cured, my body and qi flourish in uprightness. May my name be inscribed on the Immortal Terrace, carved in gold in the Upper Clarity. May I command the myriad spirits and traverse the Nine Luminaries.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your kidneys. Let their light brightly illuminate and distinguish the five viscera. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn yang days, visualize the stars entering the left kidney; on yin days, the right kidney. The first day is yang, the second yin.\n\nThis practice strictly forbids exposure to blood, filth, or foul odors, as well as the consumption of meat or pungent foods. Violations will bring misfortune upon the seven ancestors and calamity upon oneself, leading to death as a lowly ghost and expulsion from the imperial gates.\n\nOn the evening of the last day of the lunar month, before the next day’s dawn (the first day of the new moon), before the crow of the rooster, sit upright on your bed in your chamber, face east, clasp your hands, and knock your teeth seven times. Then, gaze upward and visualize the seven stars of the north shining brightly to your left. After a long while, softly recite:\n\n*\"The Seventh Barrier Star, Dark Yang of the Heavenly Gate, Shaking Radiance of the Great Luminous, Supreme Jade Emperor and Dao Lord.\"*\n\nRecite this seven times. Then, recite again:\n\n*\"May the hidden and obscure sins of my seven generations—down to my own body—my violations of the Five Punishments and the spirits within, countless as the sands, recorded in the Ghost Officials of the Northern Emperor, all be dissolved. May my spirit and essence flow freely, granting me the power to sit or stand at will. May my ears hear beyond sound, my eyes emit purple light. May my name be inscribed in the Jade Simplicity, my vision penetrating the forms of ghosts. May my name be recorded by the Imperial Lord, my fate equal to the Two Luminaries. May I traverse the Seven Origins and repose in the Purple Court.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your pupils, illuminating both eyes, and allowing inner and outer vision. Visualize the five viscera distinctly.\n\nOn yang days, visualize the stars entering the left pupil; on yin days, the right pupil. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.\n\nOn the six *jia* days, at midnight—the time when generative qi arises—lie or sit on your bed in your chamber, your head facing any direction. Clench your fists, hold your breath, and settle your spirit. After a long while, knock your teeth nine times. Then, visualize the nine stars of the Northern Dipper shining brightly above your crown, their radiance intermingling. Softly recite:\n\n*\"The Eighth Imperial Star, Lofty Jade Emperor and Spirit of the Eight Effulgences; the Ninth Revered Star, Supreme Jade Emperor of the Great Tenuity and the Seven Dawns of Primordial Simplicity.\"*\n\nRecite this nine times. Then, recite again:\n\n*\"May the great and small sins of my nine generations of ancestors—down to my own body—my transgressions in hills, mountains, and water sources, those recorded in the Registers of the Dead, my hidden evils, concealed treacheries, and deceits, countless as the sands, listed in the Ghost Emperor’s archives on Mount Feng, the offenses under the statutes of death, recorded in the Black Registers of the Nine Primordials of the Northern Uppermost and the Great Ultimate Perfected Ones—be beseeched before the Nine Primordials, the Supreme Emperor, the Revered Jade Mystery Lord, to be dissolved in every instance. May I traverse the Seven Paths, ascend to the Jade Clarity, wander the Great Void, ride the radiance of dawn’s birth, repose in the Eight Simplicities of the North, harmonize with the sun, collectively attend the August Consort, and govern the myriad spirits.\"*",
      "overlap_context": " Seven Origins, have my name inscribed in the Upper Clarity, command the myriad spirits, ascend to the Jade Court, ride the luminous chariot through the void, and harmonize with Heaven.\"*\n\nUpon completion, visualize the Northern Dipper’s seven stars descending from the heavens, flying into your mouth, and entering your liver. Make their light illuminate the five viscera, inner and outer radiantly clear. Then, face north and bow twice. After bowing, swallow saliva eighteen times, or rise and bow.",
      "start_char": 4650,
      "end_char": 5927,
      "start_sentence": 171,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.36202120780945,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清洞真解过诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "毕，又存北斗七星从天而来，下径入我泥丸紫房中，使洞照泥丸，及光明接彻一身五脏，使内外通生紫光云气，极令郁郁，仿髴念之。 毕，心存再拜毕，咽液三九过。 若六甲日与月晦，及六丁日，存思相仿近者，自可以次调适，畴量修之，不必使频仍相切近也。 每事效此，唯令全备於真法也。 於是太上回元谢罪之道毕矣。 上清洞真解过诀竟",
      "translated_text": "Then, visualize the Seven Stars of the Northern Dipper descending from heaven and entering directly into the Purple Chamber of my Mud-Palace, causing its radiance to illuminate the Mud-Palace thoroughly and extend its luminous brilliance to permeate my entire body and the five viscera, so that inner and outer are suffused with purple-cloud qi, dense and luxuriant. Hold this vision steadfastly.\n\nWhen the visualization is complete, bow twice in the heart, then swallow saliva twenty-seven times.\n\nOn the days of the Six Jia or the last day of the lunar month, as well as on the days of the Six Ding, the visualization may be adjusted in frequency to suit one’s condition, without requiring excessive repetition.\n\nIn all matters, follow this model, ensuring the full perfection of the true method.\n\nHere ends the Supreme Clarity’s *Dao of Returning to the Origin and Atoning for Transgressions*. The *Perfected Explication of Absolving Transgressions* from the *Cavern of Supreme Clarity* is complete.",
      "overlap_context": "n the Black Registers of the Nine Primordials of the Northern Uppermost and the Great Ultimate Perfected Ones—be beseeched before the Nine Primordials, the Supreme Emperor, the Revered Jade Mystery Lord, to be dissolved in every instance. May I traverse the Seven Paths, ascend to the Jade Clarity, wander the Great Void, ride the radiance of dawn’s birth, repose in the Eight Simplicities of the North, harmonize with the sun, collectively attend the August Consort, and govern the myriad spirits.\"*",
      "start_char": 5927,
      "end_char": 6084,
      "start_sentence": 207,
      "end_sentence": 212,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.239510774612427,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清洞真解过诀.txt",
        "category": "玉诀类"
      }
    }
  ]
}