{
  "source_id": "上清高上金元羽章玉清隐书经",
  "source_file": "chunked_daozang\\上清高上金元羽章玉清隐书经.json",
  "total_chunks": 8,
  "total_original_chars": 9125,
  "total_translated_chars": 61212,
  "total_translation_time": 297.3502516746521,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Pervading Jade Purity Hidden Scripture of the Cavern of Reality**\n\n**Scripture Title:** *The Supreme Pavillion Jade Purity Hidden Scripture of the Cavern of Reality* (abbreviated as *The Jade Purity Hidden Scripture*). Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. The original text comprised four scrolls and eight chapters, later divided into four separate works:\n\n- *The Supreme Cavern Jade Purity Hidden Scripture of the Most High for Annihilating Demons and Divine Wisdom of the Lofty Mystery* (three chapters)\n- *The Most High Scripture of the Jade Purity Hidden Scripture for Annihilating Demons, Divine Wisdom of the Jade Emperor* (three chapters)\n- *The Scripture of the Jade Purity Hidden Scripture of the Cavern Radiance Golden Prime* (one chapter)\n- *The Scripture of the Golden Prime Feathered Chapters of the Jade Purity Hidden Scripture of the Most High Cavern* (one chapter)\n\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, First Division.\n\n---\n\n### *The Scripture of the Golden Prime Feathered Chapters of the Jade Purity Hidden Scripture of the Most High Cavern*\n\nSuch are the myriad numinous hidden tones of the *Feathered Chapters Jade Purity Hidden Scripture*, concealed within the Jade Terrace and Jasper Chambers of the Jade Purity Upper Palace by the Most High Jade Emperor. Attending the scripture are the Orchid Court Jade Maidens—An Lǜfàn, Huáng Míngjī, and seven hundred others—along with the Northern Desert Golden Immortals and Jade Lads—Líng Huìcōng, Wáng Dìngyún, and five hundred others—who hold night-shining precious luminants and perpetually scatter the blossoms of the Three Qi’s returning incense to anoint the divine scripture’s supreme essence.\n\nAll the Five Emperors, the ten thousand immortals, and the host of sages ascend thrice each month to the Jade Purity Upper Palace to scatter incense, pay homage to the perfected, and offer rites before the divine scripture.\n\nThe Great King of the Jade Purity Dispelling Demons of the Northern Terrace’s Golden Mystery Cavern was born amid the primordial kalpa. When the Two Modes divided and the Three Symbols took root, heaven and earth lay veiled in obscurity, dim and profound. He was rightly born in the Northern Desert’s Broad Cold Courtyard, by the banks of the Cold Valley within the Central Plain of Level Mounds. The Primordial was his father, the Mysterious his mother; they wove his form, and with the Three Qi as his name, his taboo is: **__**.\n\nShedding his purple womb, his six eyes blazed with essence. His body soared ninety million *zhang*, emanating a hundred shifting lights. The Seven Primes intertwined, suffusing his jade form with radiance. The Three Luminants awaited his brilliance, and the sun and moon opened their clarity for him.\n\nThereupon, the Most High Jade Emperor bestowed upon him the Golden Perfection, Jade Radiance, Purple Script, and Cinnabar Chapters, along with the Jade Seal, Phoenix Casket, and the Banner of Command over Demon Spirits. He was enfeoffed to govern the Nine Mysteries, oversee the Five Peaks, inspect and restrain the Northern Feng, rectify the Three and Five, behead the Six Heavens, and receive his commission in the Upper Palace, his might subduing the myriad spirits.\n\nThe Most High assigned seven thousand Jade Maidens of the Jade Terrace and two thousand four hundred Golden Immortals and Jade Lads to scatter blossoms and incense in attendance upon the King. Golden-headed colossal beasts stood guard at the Jade Gates. He ruled the Northern Emperor’s Cold Realm and the Broad Numinous Palace, often riding the Nine-Colored Flowing Bell Flying Chariot with its Purple Canopy, accompanied by a thousand perfected of the Mulberry Grove. Ascending to the Great Void, he roamed the Dark Jade Purity, journeyed east to the Azure Florescence to verify the Square Cauldrons, and traveled west to Tortoise Mountain to register the celestial perfected. In the southern Cavern Yang of the Southern Culmen’s Upper Prime, he excised the dead and inscribed the living, engraving the registers to pacify and prosper. At the center, he paid homage to the Golden Gates of the Most High Jade Capital, receiving his charge from the Boundless and governing the Five Directions. He oversaw life and death in the ledgers, controlled the demonic hordes of the Northern Feng, ruled above the Supreme, and commanded below the Abyssal. The Five Peaks, Four Marshes, Twelve River Sources, and the myriad immortals and numinous hosts—none were not subject to the King.\n\nThe Great King of Dispelling Demons rules beneath the Seven-Treasure Palace of the Northern Broad Cold, governing the Northern Fengluo Mountain. This mountain lies in the north, in the *guǐ* region, rising two thousand six hundred *lǐ* with a circumference of thirty thousand *lǐ*. The mountain is entirely adorned with seven-jeweled pearl palaces, all inhabited by ghosts and spirits.\n\nAt its base lies a valley ten thousand *zhang* deep, called the Spring of Mound Cold, which is the prison of ghosts and spirits. The Great Demon King of the Northern Emperor resides in the Palace of the Yin-Heaven of Zhòu’s Severed End atop the mountain.\n\nThere is a Great Demon King, surnamed Wǎn Gōng, with the taboo **__**, whose official retinue numbers thirty-eight thousand. All their names are subject to the Great King of Dispelling Demons.\n\nWhenever later disciples attain immortality, the Great King of Dispelling Demons commands the Great Demon King to submit their names for approval, after which they may ascend to the Upper Clarity.\n\nThe Great Demon King constantly seeks to thwart disciples’ studies, resenting their attainment of immortality. Once one achieves immortality, they become a perfected transcendent above the Great Demon King. Thus, disciples are often tested by the Great Demon King, and many fail, defeated by him.\n\nIf disciples know the Great Demon King’s secret name and the location of his palace, they will not be subjected to his trials and will naturally receive his endorsement for ascent to the Upper Clarity.\n\nDisciples should regularly recite the incantation of the Hundred Spirits of the Dispelling Demons King to repel the Great Demon’s trials. Once the demonic trials are dispelled, true numina will descend, and one may behold their true form, ascending in broad daylight to the Jade Purity Palace.\n\nThe Great Demon King wears a robe of dark script, a crown spanning the heavens, and a belt with a dragon-headed sword. He often rides a feathered chariot, flying through the clouds, and sings a ballad of three thousand words to confuse and corrupt later disciples.\n\nThus, the Most High recorded its verses in the *Treasure Scripture of Dispelling Demons*. Those who know its tune will not be subjected to trials, nor suffer harm or corruption.\n\nThe Great Demon King of the Eastern Azure Emperor is surnamed Pò Luò, with the taboo **__**. He wears a crown spanning the heavens and a robe of azure feathers, with a belt of azure cords and a tiger-headed satchel. Sometimes he dons a crimson unlined garment or transforms into a radiance of azure and vermilion. He commands nine thousand officials and resides in the Eastern Land of Peace, the Age of Nàshàn.\n\nOn the day of the vernal equinox, he rides a feathered chariot of azure wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality.\n\nThose who cultivate the Dao of immortality should, on this day, enter their chamber facing west and recite the *Incantation of the Jade Purity Purple Dao Void Sovereign Supreme Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested.\n\nAfter nine years, the Purple Dao Void Sovereign Supreme Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe Dao of the Supreme Jade Form, if lightly divulged, brings destruction to the body and loss of life.\n\nOn the day of the vernal equinox, the Jade Controller of the Eastern Azure Emperor summons the Great Demon King of the Eastern Azure Emperor and ascends to the Jade Terrace of Yùyuènàlínchāng beneath the Celestial Purple Pavilion of Heaven, where he receives his duties from the Jade Purity Purple Dao Void Sovereign Supreme Lord. On this day, one should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Western White Emperor, surnamed Dèng, styled Érhū, wears a horizontal celestial white crown and a robe of white feathers, with a belt of plain spirit sashes and a five-colored tiger-headed talisman pouch. He may don a black-lined unlined robe or transform into an elderly woman with a white kerchief, holding a golden tablet, or manifest as radiance of purple and azure. Commanding seven thousand officials, he resides in the Western Land of Fortune, the Age of Shèngxíng. On the day of the autumnal equinox, he rides a feathered chariot of white wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality. Those who cultivate the Dao of immortality should, on this day, enter their chamber facing south and recite the *Incantation of the Jade Purity Winged Sun Void Sovereign Supreme Dao Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested. After twelve years, the Winged Sun Void Sovereign Supreme Dao Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe supreme jade-secret Dao, if lightly divulged, brings destruction to the body and doom to the spirit-officials.\n\nOn the day of the autumnal equinox, the Jade Controller of the Western White Emperor summons the Great Demon King of the Western White Emperor and ascends to the Jade Tower of Gāotáolìchōnglóngluó beneath Heaven, where he receives his duties from the Jade Purity Winged Sun Void Sovereign Supreme Dao Lord. On this day, one should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Southern Vermilion Emperor, surnamed Zhě, styled Shànghuán, wears a horizontal celestial vermilion crown and a robe of azure feathers, with a belt of cinnabar spirit sashes and a tiger-headed talisman pouch. He may don a yellow gauze robe or take the form of a human-headed bird-bodied being resembling a phoenix, or manifest as radiance of dark and yellow. Commanding eight thousand officials, he resides in the Wǎnlí City Realm, the Age of Qìxián. On the day of the summer solstice, he rides a feathered chariot of vermilion wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality. Those who cultivate the Dao of immortality should, on this day, enter their chamber facing north and recite the *Incantation of the Jade Purity Prosperous Yang Ji Void Sovereign High Prime Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested. After eighteen years, the Prosperous Yang Ji Void Sovereign High Prime Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe supreme jade-secret Dao, if lightly divulged, brings destruction to the body.\n\nOn the day of the summer solstice, the Jade Controller of the Southern Vermilion Emperor summons the Great Demon King of the Southern Vermilion Emperor and ascends to the Vermilion Pavilion of Bìluòkōnggēyúlí beneath Heaven, where he receives his duties from the Jade Purity Prosperous Yang Ji Void Sovereign High Prime Lord. On this day, one should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Northern Black Emperor, surnamed Xiāo, styled Yáogōng, wears a horizontal celestial dark crown and a robe of dark feathers, with a belt of dark spirit sashes and a tiger-headed talisman pouch. He may don a black-lined unlined robe or take the form of a human-bodied snake-headed being, or manifest as radiance of azure and white. Commanding five thousand officials, he resides in the Yúdǎn Wilds, the Age of Serenity. On the day of the winter solstice, he rides a feathered chariot of black wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality. Those who cultivate the Dao of immortality should, on this day, enter their chamber facing southwest and recite the *Incantation of the Jade Purity Sevenfold Serenity Life-Guiding Supreme Void Sovereign Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested. Within fifteen years, the Sevenfold Serenity Life-Guiding Supreme Void Sovereign Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe supreme jade-secret Dao, if lightly divulged, brings destruction to life.\n\nOn the day of the winter solstice, the Jade Controller of the Northern Black Emperor summons the Great Demon King of the Northern Black Emperor and ascends to the Dark Pavilion of Jiāmótǎnlóuyúyì beneath Heaven, where he receives his duties from the Jade Purity Sevenfold Serenity Life-Guiding Supreme Void Sovereign Lord. On this day, one should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Northwest Hào Emperor, surnamed Guāngmíng, styled Fǎmíng, wears a horizontal celestial purple crown and a robe of purple feathers, with a belt of purple sashes and a tiger-headed talisman pouch. He may don a white gauze unlined robe or take the form of a woman with a flying-cloud coiffure, holding a golden staff, or manifest as radiance of purple and white. Commanding ten thousand officials, he resides in the Northwest Land of Fortune and Virtue, the Age of Yánxián. On the day of the Beginning of Winter, he rides a feathered chariot of purple wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality. Those who cultivate the Dao of immortality should, on this day, enter their chamber facing southeast and recite the *Incantation of the Jade Purity Great Brightness Void Sovereign Cavern Purity Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested. Within twelve years, the Great Brightness Void Sovereign Cavern Purity Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe supreme jade-secret Dao, if divulged to the world, brings destruction to the body.\n\nOn the day of the Beginning of Winter, the Jade Controller of the Northwest Hào Emperor summons the Great Demon King of the Northwest Hào Emperor and ascends to the Purple Pavilion of Fúrèngàihuáfúluó beneath Heaven, where he receives his duties from the Jade Purity Great Brightness Void Sovereign Cavern Purity Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Southeast Hào Emperor bears the surname Fāngshēng and the personal name Zāizhǎn. He wears a horizontal Heavenly Yellow Crown, dons a robe of yellow feathers, and girds himself with a tiger-headed pouch tied by a yellow sash. At times, he appears in a single layer of purple gauze, or as a human-headed serpent with a white sash in its mouth, or transforms into a radiance of azure and green hues. He commands an entourage of six thousand officials and resides in the Primordial Blessed Field of the Worthy in the Southeast. On the day of the Beginning of Summer, he rides a yellow-feathered chariot, soaring through the clouds to roam and feast among the Five Peaks, testing and thwarting those who cultivate the immortal Dao. On this day, the disciple should enter their chamber, face the northwest, and recite the *Incantation of the Jade Purity Primordial Void Sovereign Supreme Empyrean Lord for Dispelling Demons* once, whereupon celestial demons will naturally perish, and one will not be tested. Within fifteen years, the Primordial Void Sovereign Supreme Empyrean Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved. The supreme jade-secret Dao, if divulged to the world, brings destruction to the body.\n\nOn the day of the Beginning of Summer, the Jade Controller of the Southeast Hào Emperor summons the Great Demon King of the Southeast Hào Emperor and ascends to the Yellow Pavilion of Jùwèiyéqú Chūmò beneath Heaven, where he receives his duties from the Jade Purity Primordial Void Sovereign Supreme Empyrean Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Northeast Cāng Emperor bears the surname Shào and the personal name Wúliàng. He wears a horizontal Heavenly Azure Crown, dons a robe of azure feathers, and girds himself with a tiger-headed pouch tied by an azure sash. At times, he appears in a single layer of green gauze, or as a dragon-headed human with a green staff in hand, or transforms into a spirit of fire. He commands an entourage of nine thousand officials and resides in the Blessed Assembly Capital of Cháng’ān. On the day of the Beginning of Spring, he rides an azure-feathered chariot, soaring through the clouds to roam and feast among the Five Peaks, testing and thwarting those who cultivate the immortal Dao. On this day, the disciple should enter their chamber, face the southwest, and recite the *Incantation of the Jade Purity Seven Observations Non-Being Void Sovereign Golden Numinous Lord for Dispelling Demons* once, whereupon celestial demons will naturally perish, and one will not be tested. Within ten years, the Seven Observations Non-Being Void Sovereign Golden Numinous Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved. The supreme jade-secret Dao, if divulged, brings calamity to seven generations of ancestors and severs one’s own fate.\n\nOn the day of the Beginning of Spring, the Jade Controller of the Northeast Cāng Emperor summons the Great Demon King of the Northeast Cāng Emperor and ascends to the Azure Pavilion of Chōngróng Yùyù Dísā beneath Heaven, where he receives his duties from the Jade Purity Seven Observations Non-Being Void Sovereign Golden Numinous Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Southwest Huáng Emperor bears the surname Wǔwūyíng and the personal name Tōngbó. He wears a horizontal Heavenly Green Crown, dons a robe of green feathers, and girds himself with a tiger-headed pouch tied by a green sash. At times, he appears in a single layer of yellow gauze, or as a nine-headed figure wielding a golden halberd, or transforms into a radiance of purple and black hues. He commands an entourage of seven thousand officials and resides in the Western Palace’s Extended Blessing Village of Benevolent Tranquility. On the day of the Beginning of Autumn, he rides a green-feathered chariot, soaring through the clouds to roam and feast among the Five Peaks, testing and thwarting those who cultivate the immortal Dao. On this day, the disciple should enter their chamber, face the northeast, and recite the *Incantation of the Jade Purity Eight Observations Lofty Primordial Void Sovereign Radiance-Halting Lord for Dispelling Demons* once, whereupon celestial demons will naturally perish, and one will not be tested. Within nine years, the Eight Observations Lofty Primordial Void Sovereign Radiance-Halting Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved. The supreme jade-secret Dao, if divulged, subjects one to trial and destruction, bringing calamity to seven generations.\n\nThe Jade Controller of the Southwest Huáng Emperor, on the day of the Beginning of Autumn, summons the Great Demon King of the Southwest Huáng Emperor and ascends to the Purple Pavilion of Dānyuán Chábǎo Lúnfǎ beneath Heaven, where he receives his duties from the Jade Purity Eight Observations Lofty Primordial Void Sovereign Radiance-Halting Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon Kings of the Eight Directions were born alongside the Six Heavens, and their officials number in the tens of thousands. When they roam, they are accompanied by ghostly soldiers, banners, canopies, and insignia of the five colors and dark yellow, soaring through the clouds or dwelling among the Five Peaks, descending through the Eight Realms to envy and harm the immortal Dao, testing and thwarting those who cultivate it, unwilling to let them attain immortality. Thus, the Eight Supreme Emperor Lords employ the divine incantations for dispelling demons to restrain them with their majesty. Disciples who know only the supreme taboo names of the Highest Sovereign but not the names of the celestial demons will never achieve the immortal Dao. Those who know the secret names of the demon kings and restrain them with divine incantations will cause the demon kings to submit their names in guarantee, reporting them to the Jade Purity, whereupon the immortal Dao will unfailingly be achieved. This method is profoundly wondrous, concealed by the Supreme in the secluded Seven Treasures Golden Hall of the Dark Coffer, revealed but once in ten thousand kalpas. Without one’s golden name and jade characters recorded in the imperial registers, one will never behold its text. Those who obtain this method will attain immortality without study. The Supreme appoints left officials to execute and guard against negligence, carelessness, or unauthorized disclosure. For those who are not true adepts, seven generations of ancestors will be punished, and one’s own fate will be extinguished, bound in the Three Wretched Realms for ten thousand kalpas without deliverance.\n\n**Hidden Text of the Jade Purity Great King for Dispelling Demons and the Golden Numinous Hundred Spirits Incantation**\n\nThe Supreme Void is tranquil and at ease; the four qi are solemn and reverent. The Eight Mysteries of the Profound gather; golden chimes resound through the empty sky. Jade wisdom soars through the empyrean; the cavernous subtle stirs the primordial. The four radiant scenes unfold their numen; the six perfections rest in harmony. Through refinement and transformation, they merge and change; stepping upon rosy clouds, they ascend the peaks. In the high assembly of the Jade Purity, the Three Primordials’ Upper Palace, they attend the banquet of the Nine Emperors before the Eight Luminous Cinnabar Windows. The luminous opens the Dao above; the Seven Primordials shine through. The clear waves mirror the distant; essence scatters in the Jade Chamber. The lofty perfected stand in array, luxuriant as flowing light. Golden immortals hold blossoms; pure spirits disperse fragrance. Flying celestial beasts guard the Jade Emperor. The two images rest in the void; the three luminaries veil the dusk. Divine talismans transform myriad times; the Seven Stars intersect in their courses. The Nine Emperors display their canopies, lingering at the cavern’s gate. Towering and lofty is the Supreme Void; majestic and venerable is virtue. The myriad transformations arise in unity; the dark examines the sacred source. A summons is issued to the Five Emperors; the Upper Primordial is invoked. The demon-dispelling majesty transforms; the returning wind and swift thunder sweep away evil and banish demons. Essence is bound, spirits captured; the Emperor Lord receives his mandate. Those guilty are executed; those meritorious are pardoned. Their names are recorded in the Three Heavens; the great deities who preside over this are the Golden Numinous and Jade Wisdom, all as the jade text decrees. In the vast capital of Yùluó, the disciple’s private existence is preserved. The dark canopy commands all; riding the wheel-less void, they are the ancestors of the hundred spirits. The sun’s radiance shifts and changes; the gate of awakened attainment opens the dharma containing light. Through long kalpas, they swiftly depart from the divine. The resplendent chamber and bright guests—all are the demon kings of the Northern Fēng. Their eerie songs and mysterious chants disrupt our cloudy encampment. The immortals check the names and submit them to the Jade Dawn. The commands of the Supreme are all as the Great Perfected decrees.\n\nThen the Five Elders take up their reins, ascending the lofty and resplendent imperial court. Their feathered skirts and jade sleeves ripple, embroidered capes with flowing bells; golden crowns and purple sashes radiate the sun’s essence, their numinous light illuminating the wheel. Eightfold radiance purifies the mysteries; the Five Thearchs flank the imperial carriage, escorting the Four Luminaries. The grotto-heavens gaze in wonder, wondrous scenes forming cloudy encampments. The gates of heaven unseal, the numinous barriers open in clarity. Soaring through the purple empyrean, the eight paths merge into darkness. The Dao’s subtleties stretch far and wide; wandering dreams ascend to the Upper Clarity. The Seven Sages align in harmony, their principles commanding long life. Thrice they circle and five times they turn, delivering the Seven Stars. The Great One attends to his duties, inscribing records in the immortal court. Ascending the Brahma-realm, treading prosperity, the five qi converge, the Ten Perfections firmly arrayed. The cinnabar names are opened and delivered; the Mysterious Mother rejoices. Eternal life is forever preserved. The White Prime and the Peerless, the Solar Assembly and the Yellow Tranquility—all Five Elders unite in accord. Branches flourish in splendor, preserving the Southern Immortals. None fail to be embraced as embryos; the three qi behold the light. Golden immortals bathe in form, decayed corpses soar in flight, ascending to the Three Clarities. The Great One examines demons; the Celestial Origin captures essence. Trials are extinguished, calamities dissolved—no reckless births are permitted. The Six Masters brandish lightning, hurling fire-bells. Their might shakes the eight realms; the ten directions stand in solemn stillness. Dragons soar and phoenixes glide, ascending to pierce the Four Luminaries. Cinnabar texts record their names; golden scriptures of feathered classics. The world safeguards the radiant dragon, its destiny aligned with the immortal court. The Nine Perfected entwine in harmony; the highest vows are fulfilled. Demons are subdued, protections upheld—soaring to ascend the Jade Clarity.\n\n*The Inner Chapter of the Golden Numinous Hundred Spirits for Dispelling Demons*\nA treasure of the August Supreme, concealed within the Jasper Palace, bestowed upon the highest sages, not transmitted to lesser immortals. Those with golden names and jade characters, arrayed in vermilion charts, whose viscera bloom with life—only they may receive this text. Practicing ten thousand repetitions, they ride the radiance and mount the clouds, soaring through the Three Clarities, entering and departing the imperial dawn. They open the way for seven generations of ancestors, severing karmic roots, delivering lives to the Southern Palace, preserving the purple embryo within the primordial womb. They gather the Dao of life from the ten directions, command Jade Wisdom in the golden chamber, seek numinous radiance through wondrous resonance, and embrace the eight assemblies within the nine voids. Thus they summon true radiance to descend in curves, beholding the divine countenance of the Jade Emperor. They await the insignia in the Orchid Court, subduing the celestial demons of the Northern Feng. All who practice this Dao shall, on the eight solar terms and their own birthdays and the days of the Great Year Star, recite the scripture and perform the Dao-circuits, treading upon sacred mountains—always facing north. They shall strike the left teeth thirty-two times, reciting the chapter in a hushed voice. With each recitation, the spirit brightens and qi purifies; celestial demons vanish like shadows, and the immortal Dao naturally manifests. Those who recklessly divulge this method shall see their seven generations of ancestors held accountable, their own lives forfeit, and immortality forever denied.\n\n*The Jade Clarity Purple Dao Hidden Writ of the Golden Numinous Feathered Chapter of the Upper Lord of the Void Emperor Yuyue Nalin Chang in the Heavenly Central Dispelling-Demons Wisdom Incantation*\nThe four expansions of the Jade Heaven, the eight generations of lofty numina. The Two Nets gleam and fall; Jade Wisdom illumines the Clarity. The golden chant resounds in emptiness, vibrating the purple jasper. A hundred harmonies bind the true; demonic names are checked and restrained. The Three Waves are tranquil; the defiled are purged. Poison is expelled, goodness embraced; whistling commands the ghostly soldiers. The Northern Feng is unbound, roaming the cloudy encampments. The Jade Emperor chants and whistles; the demonic hordes collapse. The Six Heavens vanish like shadows; the Three Paths spread their numina. The August Supreme scatters his radiance; our Dao is now clear. The Great One inscribes the register, attending to the preservation of life. The Duke’s son delivers the talisman, severing the Seven Stars. The five sufferings disperse entirely; decayed bones flourish as immortals. Trials are extinguished, the true preserved. Feathered robes of deep green, girded with gold and jade, interlacing bells flowing. Circling and converging in the Jade Empyrean, together they enter the Yellow Tranquility. Ten thousand prohibitions open the paths; soaring to the Purple Court.\n\n*The Jade Clarity Winged Sun Hidden Writ of the Golden Numinous Feathered Chapter of the Upper Dao Lord of the Void Emperor Gao Tao Li Chong in the Heavenly Central Dispelling-Demons Wisdom Incantation*\nLofty peaches resplendent, the Dragon Net soaring. Golden radiance unfurls, the Four Luminaries gleaming. Radiant clouds flourish in emptiness; vermilion orchids overflow. Jade chambers and purple terraces, intersecting clouds in four directions. The Departed Net spreads its wings; the divine hall stands majestic. The golden numen shines in emptiness, girding the divine kings. The Five Elders and Eight Radiance unite in firm array. The numinous flourishes, Jade Wisdom whistles clear through the void. Flying essence and feathered canopies, dancing wheels in the hollow sky. Thrice entering the Northern Clarity, twice visiting the Upper Palace. Commanding the Northern Emperor, checking and capturing demon kings. Beheading the Six Heavens, purging the Northern Feng’s kalpas. Binding essence and restraining demons, submitting to the Jade Emperor. With a sudden roar, the myriad myriads collapse. The Dao spreads the Three Perfected, perfecting our immortal lords. Ascending the Brahma-realm, treading prosperity, guarding the Crimson Palace. The Controller of Destinies preserves the tally; cinnabar script in the Southern Prosperity. Severing the Seven Mysteries, decayed bones flourish anew. Delivering the Three Paths, soaring through the empyrean peaks. Extinguishing trials and summoning numina, dispelling demons in shared merit. The Dao aligns with the Imperial Unity, riding the radiance and spurring the dragon. Soaring to ascend the lofty peach, the Dragon Net in the heavenly center.\n\n*The Jade Clarity Prosperous Yang Hidden Writ of the Golden Numinous Feathered Chapter of the Highest Lord of the Void Emperor Ji in the Azure Empyrean Heavenly Central Dispelling-Demons Wisdom Incantation*\nThe Northern Emperor unleashes the great demons; their eerie songs swirl around the cloudy ranks. Vapors thickly veil the hollow sky; luxuriant growth disrupts the celestial true. Flying through the ninefold radiance of mystery, their hordes number in the tens of thousands. Riding the void, they probe the celestial qi, testing or offending our immortals. The Highest commands Jade Wisdom; the feathered chapter resounds with the Golden Numinous. The Ten Perfections reverse the vermilion radiance; the divine chant naturally perfects the true. Numinous banners subdue the myriad demons, solemn as wind sweeping dust. Binding essence to extinguish the defiled, sealing and checking the Northern Feng’s mountain. The luminous aligns with the demonic source; the radiant dispels the demonic chapter. The Five Elders deliver talismanic registers; the Controller of Destinies fixes the years of life. The dark and desolate chariots of the Earls, uniting radiance to refine my body. Numinous splendor reflects the imperial seat; lifting and guiding the highest person. The Red Child summons the divine lords, descending to welcome the eight imperial guests. Soaring to ascend the Azure Empyrean Court, drifting and chanting into the threefold convenience. Severing the roots of the five sufferings, returning the embryo to birth the Seven Mysteries. Decayed bones all ascend in flight, entering together the mist of emptiness.\n\n*The Jade Clarity Sevenfold Stillness Guiding Life Hidden Writ of the Golden Numinous Feathered Chapter of the Highest Lord of the Void Emperor Jiama Tanlou Yu in the Heavenly Central Dispelling-Demons Wisdom Incantation*\n\nThe Seven Stillnesses ride the kalpas in return, soaring through the void into the Northern Origin. Concealing breath in the Grotto-Clear Lodge, dimly luminous they ascend the radiant clouds. Flying and traversing, they gaze upon the Yin Chamber; sun and moon plant the numinous root. They reckon the revolutions of the Three Images, the Seven Stars shining in their divisions. Heavenly demons fill the Cloud Palace, foul qi swirling in profusion. Winding and restraining, they arise upon the path, called the Great Demon Host. Their chants and songs blanket the empty grottoes, confounding and deluding the gates of those who study transcendence. The Void Emperor commands the Eight Emperors, ascending to open the Veiled Pass. The Golden Mystery illumines Jade Wisdom; pure recitation dissolves the demonic scripture. They hasten the seals to summon the Northern Emperor, ascending to face the Jade Clarity Lord. Binding demons and extinguishing demonic trials, all conforms to the writ of the Nine Heavens. The Grotto-Yang flourishes with numinous standards, sealing fast the source of the Gate of Death. They unbind the embryo and scatter stagnant blood, a hundred joints birthing the true spirits. The true spirits assist my body, controlling demons to command long life. Numinous blessings fill the seven ancestors, returning the embryo to birth as an immortal. Preserving authenticity in the Jiama Heaven, for generations they are honored as paragons of the Dao and virtue.\n\n*The Jade Clarity Great Brightness Void Emperor Grotto-Clear Lord Fu Dao Gai Hua Fu Luo Heavenly Central Dispelling-Demons Wisdom Incantation Hidden Writ of the Golden Mystery Feathered Chapter*\n\nThe Flying Emperor gazes upon the cloud chariot, the Grotto-Clear reflecting the Floating Net. The dark abyss scatters the vermilion portals, the court of the numinous illumining the Great Radiance. Drifting transcendent upon the Dark Empyrean, resplendent they gleam with radiant splendor. The Three Clarities preserve the kalpas’ use, together with these countless eons of camphorwood. Whistling they ride the divine clarity, grasping the tally to restrain the heavenly demons. The Five Elders summon the Northern Emperor, gathering and seizing the households of ghosts and spirits. The Crimson Deng obscure the celestial perfected, blocking the myriad immortals’ passes. The Golden Mystery and Grotto-Jade Wisdom, the Feathered Chapter extinguishes the chants and songs. The incantation commands and binds the demonic hosts, receiving the task to dispel demons. Escorting the transcendent back to the imperial seat, they drift upon these dark ford waves. Resplendent and bright, the treasure of the Great Radiance, the perfected ones mutually unfold their blossoms. The Five Numinous convey the talismanic registers, prolonging and securing the stem of destiny. Preserving my ten-thousand-kalpa merit—who can fathom the celestial records’ abundance? The seven ancestors ascend to be born in heaven, liberated and delivered from the Dark Net. The Grotto-Clear extinguishes the transcendent trials; the body soars to ascend the Dark Capital.\n\n*The Jade Clarity Primordial Void Emperor Great Empyrean Lord Ju Wei Ye Qu Chu Mo Heavenly Central Dispelling-Demons Wisdom Incantation Hidden Writ of the Golden Mystery Feathered Chapter*\n\nResplendent they illumine the Great Empyrean, riding the void in return. Golden efflorescence dawns in the morning, dragon radiance soars through the empty sky. Jade transcendent attend in escort, the Five Elders support the banners. The Great Yang opens the ford, the Seven Origins shine forth in splendor. The Five Emperors unite in perfection, the Three Radiance linger in circuit. Feasting in the cloud chambers, ascending to open the vermilion mechanism. They summon the Eight Heavens, gathering and governing the Four Extremities. Myriad numina gird their sashes, receiving tasks in the Great Tenuity. Bearing heaven and breaking their foreheads, seizing the interval to unleash their might. Chants and songs fly through the void, testing and confounding my heart. They inscribe the name of the Northern Emperor, sealing and shearing without remainder. Divine perfected emerge in excursion, heaven and earth collapse and topple. The demonic hosts submit in surrender, the transcendent all take flight. The profound script is completed in curves, shining together with me. The Primordial Father and Dark Mother, the myriad spirits all return. They stride beyond the Jade Radiance, the body ascends the golden ladder. Drawing forth from the Three Paths, the Seven Mysteries scatter and unfold. Preserving transcendence in the Great Empyrean, blessings and felicity towering and majestic.\n\n*The Jade Clarity Seven Observances Non-Birth Void Emperor Golden Numinous Lord Chong Rong Yu Yu Di Sha Heavenly Central Dispelling-Demons Wisdom Incantation Hidden Writ of the Golden Mystery Feathered Chapter*\n\nThe Impalpable Void illumines the morning lamp, blazing and gleaming in the vast hall. Treasure clouds fan the Nine Peaks, the Jade Chamber where the Void Emperor sits. The Purple Guests display the Dark Registers, the returning wind cradles the Dao in health. The golden talismans summon the Crossing Ministers, the numinous banners seize the Demon Kings. The vessels and seals extinguish the myriad trials, uniting with the transcendent to perfect my merit. Within the radiant treasure of destiny, life is born; the moving pearl guards the highest offices. The numinous irrigation of the Seven Passes’ palaces, returning the aged to transform into infants. Drawing forth from the Earth Gate’s difficulties, preserving this sun and moon’s light. The seven ancestors depart the dark night, receiving blessings in the Southern Culmen’s chambers. The golden talismans enter the Dark Chamber, the body soars to ascend the Impalpable Void.\n\n*The Jade Clarity Eight Observances High Origin Void Emperor Tranquil Radiance Lord Shan Yuan Cha Bao Lun Fa Heavenly Central Dispelling-Demons Wisdom Incantation Hidden Writ of the Golden Mystery Feathered Chapter*\n\nThe Tranquil Radiance Wheel of Dharma Heaven, the Eight Observances illumine the Jade Clarity. Flying blossoms fall and scatter their radiance, returning fragrance flows through the golden court. The rainbow’s glow illumines the Dark Terrace, the Three Emperors unite to open the dawn. Whistling and shrilling they attend the Golden Gate, preserving these kalpas of accumulated lives. The Northern Origin hastens the celestial revolutions, wielding the banner to summon the Five Numinous. They forbid and seal the Northern Feng Palace, feasting and commanding the cloud encampments. The Highest observes the Eight Wastes—from where do the chants and songs arise? Flourishing and nurturing, they drum the vast Dao, proclaiming titles to sprinkle the Eight Darks. The feathered writ seizes the demonic hosts, the Golden Mystery binds the myriad essences. The Demon Kings all receive their tasks, extinguishing trials and dissolving the demonic scriptures. The Dark Mandate responds to the talismanic assembly, the Five Emperors command and it is already pure. The Duke’s Son holds the Five Talismans, the Great One secures my form. The Three Origins display the registers, inscribing the book upon the Eastern Florescence’s jade. The Seven Mysteries all ascend in flight, rejoicing together in the Eight Observances’ court.\n\nThe Dispelling-Demons Wisdom Incantation’s Golden Mystery Hidden Writ is all knotted from the soaring dark’s spontaneous qi to complete its chapters, resplendent above the Eight Heavens, flourishing within the Jade Clarity. It controls demons and establishes the perfected, extinguishes trials and summons the transcendent. The golden tones drift and ring in the Purple Void, the jade wisdom vibrates and resounds in the Radiance Court.\n\nThus the Highest Floating Wheel is employed to rigorously test, the Void Emperor wields the reins to observe the perfected. Assisting the Jade Transcendent in attendance, commanding the Five Elders to restrain the numinous. Above they display the profound and wondrous noble practices, below they exalt the towering and majestic beyond description. Blessings and felicity fill the dark leaves, layered shade flows through the seed bodies. Decayed bones receive its dark reliance, receiving rebirth as embryo transcendent. Lofty and difficult to name, numinous and difficult to proclaim—thus the supreme sages established the chapters, calling them Hidden Writ.\n\nThe Eight Heavens’ Void Emperor Lord received it from the Nine Empyreans, transmitting it to the Jade Clarity Jade Emperor Lord Dispelling-Demons Great King. The Great King transmitted it to the Five Emperors’ Highest Perfected Lords, who transmitted it to the Highest Jade Emperor Lord. The Highest Jade Emperor Lord transmitted it to the Supreme Emperor, the Supreme Emperor transmitted it to the Supreme Lord of the Great Dao. The Supreme Lord of the Great Dao transmitted it to the Great Tenuity Heaven Emperor Lord, the Great Tenuity Heaven Emperor Lord transmitted it to the Later Sage Nine Mysteries Golden Watchtower Emperor Lord, who transmitted it to the High Minister Azure Youth Lord.\n\nThese true transmissions, passed from one perfected being to another, are compiled as numinous writs. According to the statutes, only those who have listened for seven thousand years and are destined to attain transcendence may receive them. Without one’s name recorded in the Imperial Register of the Golden List and inscribed in the Upper Clarity, they must not be rashly proclaimed. To lightly divulge this Dao brings calamity upon seven generations of ancestors, and one’s own life is forfeit—be clear and cautious in upholding it.\n\nShould one’s name appear on the Purple Terrace and be deemed worthy of this text, one must establish sincerity in the heart, present as offerings eight taels of gold, eighty bolts of cinnabar brocade, and sixty bolts of purple silk. The master shall perform an eighty-day retreat in response, or twenty-seven days, and transmit the text only after the covenant is sworn. To transmit without covenant and lightly divulge it is to break faith with Heaven, bringing guilt upon seven generations of ancestors, calamity upon descendants, and blindness and deafness to oneself for life, so that one never attains transcendence.\n\nIn cultivating this Dao, on each of the eight solar terms, one must recite one chapter according to the term. Furthermore, on one’s own life-day, the first day of the sexagenary cycle, the day of the Great Year Star, and whenever one undertakes a retreat to practice the Dao, one must recite the thirty-nine chapters of the scripture, the *Feminine One’s Five Elders’ Treasure Scripture*, the *Mysterious Mother’s Eight Gates and Twelve Supreme Vows*, and all together recite the *Eight Heavens’ Wisdom Mantra* once. When traveling to famous mountains or journeying to the four quarters in search of the Dao of transcendence, one must recite one chapter according to the direction before proceeding. Practiced thus, all trials vanish of themselves, demon kings show reverence and protection, all endeavors succeed, and all undertakings are accomplished. True persons manifest in bodily form, bringing forth natural numinous medicines; the body shines with jade radiance, and the inner chant of transcendence resounds, enabling flight to the Upper Clarity.\n\n**Jade Clarity’s Fragrant Grove Prosperous Forest Flourishing Jade Terrace Heaven’s Nine Radiance Great Dawn Hidden Writ: Golden Mystery Inner Text**\nWorn by the Primordial Master, transmitted to the Utterly Transcendent Perfected.\n\nFor those cultivating the Dao of transcendence, inscribe it in white on a green tablet and place it in the East to extinguish the great demon kings and their retinues of the Eastern Azure Emperor and summon the transcendent officials of the East. Practicing thus for nine years, the Azure Perfected, Supreme Sage, and August Elder of the Upper Heights manifest in bodily form, dispatching transcendent officials to procure natural numinous medicines. Also, inscribe it in white on green silk and wear it on the body when traveling in the East to reach the Great Hall of Peace in the World of Accepting Goodness, where demon kings gird their robes, bow their heads in reverence, and welcome one, while transcendent officials stand in attendance. Entering the Eastern Marchmount, one obtains an azure cloud feather canopy. After nine years, one flies to the Jade Clarity Palace. Without this text, one must not rashly practice the Dao of the Eastern Azure Emperor or lightly summon the transcendent officials of the Azure Emperor, lest one be harmed by great demons, lose one’s authenticity, incur calamity, and never attain transcendence.\n\n**Jade Clarity’s Lofty Peach Tower Soaring Dragon Net Observing Numinous Origin Dawn Hidden Writ: Golden Mystery Inner Text**\nWorn by the Nine Elders of the Transcendent Capital, transmitted to the Vast Numinous Elder.\n\nFor those cultivating the Dao of transcendence, inscribe it in red on a white tablet and place it in the West to extinguish the great demon kings and their retinues of the Western White Emperor and summon the transcendent officials of the West. Practicing thus for twelve years, the White Radiance, Plain Numinous, Seven Sages, and Golden Numinous Lords manifest in bodily form, dispatching transcendent officials to procure natural numinous medicines. Also, inscribe it in vermilion on white silk and wear it on the body when traveling to the World of Prosperity in the Western Fortune Hall Prefecture, where demon kings gird their robes, bow their heads in reverence, and welcome one, while transcendent officials stand in attendance. Entering the Western Marchmount, one obtains a plain cloud feather canopy. After twelve years, one flies to the Jade Clarity Palace. Without this text, one must not rashly practice the Dao of the Western White Emperor or enter the Western Marchmount and lightly summon the transcendent officials of the White Emperor, lest one be harmed by great demon kings, lose one’s authenticity, incur calamity, and never attain transcendence.\n\n**Jade Clarity’s Azure Empyrean Empty Song Remnant Pear Heaven’s Total Dawn Nine Poles Hidden Writ: Golden Mystery Inner Text**\nWorn by the Jade Clarity’s Supreme Primordial Lord, transmitted to the Southern Culmen Supreme Primordial Lord.\n\nFor those cultivating the Dao of transcendence, inscribe it in black on a cinnabar tablet and place it in the South to extinguish the great demon kings and their retinues of the Southern Vermilion Emperor and summon the transcendent officials of the South. Practicing thus for eighteen years, the Cavern Yang Cinnabar Numinous Supreme Perfected Radiance Lord manifests in bodily form, dispatching transcendent officials to procure natural numinous medicines. Also, inscribe it in black on crimson silk and wear it on the body when traveling to the World of Abandoning Worthies in the Southern Wanli City Prefecture, where demon kings gird their robes, bow their heads in reverence, and welcome one, while transcendent officials stand in attendance. Entering the Southern Marchmount, one obtains the Southern Culmen’s Treasure Scripture and a cinnabar cloud feather canopy. After eighteen years, one flies to the Jade Clarity Palace. Without this text, one must not rashly practice the Dao of the Southern Vermilion Emperor or enter the Southern Marchmount and lightly summon the transcendent officials of the Vermilion Emperor, lest one be harmed by great demons, lose one’s authenticity, incur calamity, and never attain transcendence.\n\n**Jade Clarity’s Kapila’s Tower Dragon Concealing Heaven’s Obscure Radiance Revolving Root Hidden Writ: Golden Mystery Inner Text**\nReceived by the Nine Heavens’ True Kings, transmitted to the Supreme Lord of the Dao.\n\nFor those cultivating the Dao of transcendence, inscribe it in yellow on a black tablet and place it in the North to extinguish the great demon kings and their retinues of the Northern Emperor and summon the transcendent officials of the North. After fifteen years, the Northern Culmen’s Mysterious Supreme Jade Perfected Lord bestows the Supreme Treasure Scripture and dispatches fifteen transcendent officials. Also, inscribe it in yellow on black silk and wear it on the body when traveling to the World of Serenity in the Northern Yudan Wilds, where myriad numina gird their robes, demon kings bow their heads in reverence and welcome one, while transcendent officials stand in attendance. Entering the Northern Marchmount, one obtains a mysterious cloud feather canopy and flies to the Jade Clarity Palace. Without this text, one must not practice the Dao of the Northern Black Emperor or enter the Northern Marchmount and lightly summon transcendent officials, lest one be harmed by great demons, incur calamity, and lose transcendence.\n\n**Jade Clarity’s Supporting Blade Canopy Floating Flower Net Heaven’s Mysterious Radiance Dawn Level Hidden Writ: Golden Mystery Inner Text**\nReceived by the Three Primordials of the Grand Simplicity from the Primordial Heavenly King, transmitted to the Jade Maiden of Great Harmony.\n\nFor those cultivating the Dao of transcendence, inscribe it in purple splendor on a yellow tablet and place it in the Northwest to extinguish the great demon kings and their retinues of the Vast Emperor and summon the transcendent officials of the Northwest’s World of Extending Worthies in the Wilds of Fortune and Virtue.\n\nAfter twelve years, the jade maidens of the Upper Offices will descend to your bedchamber, bestowing upon you the Dao of spirit-perfection. Further, inscribe it in purple upon yellow silk and wear it upon your person. When you journey to the Northwest’s World of Extending Worthies, the myriad spirits will gird themselves in attendance, and the demon kings will bow their heads in reverence, allowing you to ascend upon a canopy of flying clouds and roam the Jade Clarity Palace. Without this writ, you may not lightly practice the Dao of transcendence or summon transcendent officials, lest you be harmed by great demons, your body perish, and transcendence be lost.\n\n**Jade Clarity’s Concealed Writ of the Golden Mystery: Possessing the Radiance of the Celestial Confluence’s Dawn Command**\nReceived by the Fusang Great Emperor from the Supreme Empyrean Perfected King, transmitted to the Celestial Emperor of the Grand Tenuity.\n\nInscribe it in yellow upon a green tablet and place it in the Southeast to extinguish the great demon kings and their retinues of the Vast Emperor, and to summon the transcendent officials of the Southeast’s World of Cultivated Worthies in the Fields of Fortune. After fifteen years, twenty-four jade maidens will attend you, fetching natural numinous medicines and flying elixir pellets. Further, inscribe it in yellow upon green silk and wear it upon your person. When you journey to the World of Cultivated Worthies, the myriad spirits will gird themselves in attendance, and the demon kings will bow their heads in reverence, allowing you to ascend upon a canopy of verdant clouds and fly to the Jade Clarity Palace. Without this writ, you may not lightly practice the Dao of transcendence or summon transcendent officials, lest you be harmed by great demons, your body incur great calamity, and transcendence be lost.\n\n**Jade Clarity’s Concealed Writ of the Golden Mystery: The Flourishing Dawn of the Celestial Equilibrium’s Mysterious Radiance**\nReceived by the Queen Mother of the West from the Supreme Master of the Northern Culmen, transmitted to the Supreme Perfected of the Vermilion Essence.\n\nInscribe it in blue upon a purple tablet and place it in the Northeast to extinguish the great demon kings and their retinues of the Azure Emperor, and to summon the transcendent officials of the Northeast’s World of Assembled Fortune in the Everlasting Peace of Chang’an. After ten years, eighteen transcendent youths will attend you, fetching natural numinous medicines and the supreme flying mystery feathered regalia. Further, inscribe it in blue upon living purple silk and wear it upon your person. When you journey to the Northeast’s World of Everlasting Peace, the myriad spirits will gird themselves in attendance, and the demon kings will bow their heads in reverence, allowing you to ascend upon a canopy of purple clouds and fly to the Jade Clarity Palace. Without this writ, you may not lightly practice the Dao of transcendence or summon transcendent officials, lest you be harmed by great demons, your body incur great calamity, and transcendence be lost.\n\n**Jade Clarity’s Concealed Writ of the Golden Mystery: The Wheel of the Dharma’s High Celestial Dragon Mist**\nReceived by the Ninefold Mystery Golden Portal Emperor of the Later Sages from the High Origin’s Void Sovereign of Suspended Radiance, transmitted to the Grand Minister Supreme Youth.\n\nInscribe it in yellow upon a green tablet and place it in the Southwest to extinguish the great demon kings and their retinues of the Yellow Emperor, and to summon the transcendent officials of the Southwest’s World of Extending Fortune in the Village of Benevolent Stillness. After nine years, the Eight Emperors’ attendant perfected jade transcendent beings will manifest in your form, bestowing upon you the transcendent medicines of flying immortality and the seventy-four transformations of radiant refinement to transmute your body. Further, inscribe it in yellow upon green silk and wear it upon your person. When you journey to the Southwest’s World of Extending Fortune in the Village of Benevolent Stillness, the myriad spirits will gird themselves in attendance, and the demon kings will bow their heads in reverence. The Three Primordials will descend with flying chariots of jade wheels to welcome you into the chambers of the Three Primordials. Without this writ, you may not lightly practice the Dao of transcendence or summon transcendent officials, lest you be harmed by great demons, your body perish, and transcendence be lost.\n\n**Jade Clarity’s Concealed Writ of the Golden Mystery: The Central Hidden Writ of the Eight Heavens**\nBorn before the Primordial Beginning, congealed from the qi of the flying mystery to form the jade writ—this is the writ of the Jade Clarity Heaven. Each character spans a zhang, resplendent in the vast firmament, subduing demons and extinguishing spirits, summoning gods and seizing numina. Thus, the supreme sages transmit it to one another, receiving it to wield numinous might. This writ is concealed and not transmitted to the world; without a golden name in the Orchid Terrace or jade characters in the Purple Chamber, one may neither see nor hear of it. Should one obtain this scripture, the exalted will assign twelve jade youths and eight jade maidens to attend the perfected, safeguarding the text’s bearer and correcting lapses of negligence. To lightly divulge it is to consign one’s seven ancestors to punishment in the earth prisons and to subject one’s own body to the Three Offices’ interrogation.\n\nThe Master of the Void of Mount Bell received it from the Yellow Venerable Lord. After wearing it for nine years, his inner and outer being became luminously transparent, the concealed writ manifesting of itself. It arrayed within his form, its radiance illuminating the nine palaces, shining upon the ten directions. The original writ he wore flew into the Eight Heavens. In the first year of the Kai-Guang era, on the first day of the first month, he shed his body at Mount Bell, and the concealed writ was transmitted to the Perfected of Profound Spirit, Bao Shixuan. Shixuan was once the attendant of Duke Mu of Qin and is now titled the Perfected of Profound Absoluteness, dwelling in the grotto chambers of Mount Jiuyi.\n\nThe Ninefold Mystery Golden Portal Emperor of the Later Sages descended to become the teacher of the Zhou, changing his title to Laozi. He transmitted the Concealed Writ of the Eight Heavens to King You. King You, deeming himself to dwell in the course of natural destiny, to succeed the qi of the Five Emperors, and to regulate the transformations of yin and yang, did not revere the celestial writ. Laozi, knowing the decline of the Zhou’s culture, retrieved the writ and departed, crossing west of the Zhou. There, he established teachings and transformations, encountering the Pass Prefect Yin Xi. Xi’s heart was bound by purple cords, his face bore a circular luminance, his neck bore the Mandate of Heaven, his back carried the Seven Primordials, his golden name was inscribed upon the Mystery Chart, and his cinnabar tally was tied to the Purple Chamber. His qi aligned with the Grand Tenuity, and his form merged with the perfected. Thus, he expounded the *Scripture of the Dao and Its Virtue* in two chapters.\n\nIn the land of Lǜnà, Laozi opened his mouth, and the concealed writ emerged from it to be transmitted to Xi. Xi, adhering to the covenant, received it and thereby summoned the cloud chariot of the Eight Effulgences, roaming freely through the eight directions. He ascended into the void, his neck radiating the light of precious luminosity, his seventy-two marks illuminating his form. Following the course of transformation, he ascended into the Eight Heavens. His Dao is lofty and wondrous, beyond all description.\n\nFor all later learners who do not obtain this writ, it is fitting to cease yearning for distant visions and to spare their spirit the weariness of secluded mountains.\n\nThe Grand Minister Supreme Youth transmitted this writ to the Perfected King of the Western City, who ascended to the rank of Perfected of the Four Culmens. Now, one copy is sealed within the Western City Mountain.\n\nShould one possess a name inscribed in gold and characters writ in purple, then in the years of gengzi, renyin, gengwu, or wuyu, on the eighth day of the fourth month, the seventh day of the seventh month, or the first day of the tenth month, within the world of the Eight Heavens, one must meditate with utmost sincerity and ardent devotion—only then may this writ be obtained.\n\n*The Scripture of the Jade Concealment of the Golden Primordial Feathered Chapters of Highest Clarity* concludes here.\n\nThe *Golden Primordial Feathered Chapters of the Jade Concealment of the Mysterious Clarity* comprises two scrolls, their texts identical but their talismans distinct; thus, the sigils are appended below.\n\nThe Concealed Writ of the Nine Radiant Great Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Primordial Dawn of the Observing Spirit of the Golden Primordial Inner Text\nThe Concealed Writ of the Nine Culmens of the Grand Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Revolving Root of the Multitudinous Luminaries of the Golden Primordial Inner Text\nThe Concealed Writ of the Mysterious Effulgence of the Level Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Conjoined Radiance of the Mandate of Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Harmonized Radiance of the Mysterious Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Lofty Dragon Mist of the Golden Primordial Inner Text\n\n#1 \"Northern Direction\" (the original text erroneously reads \"Yufang\")",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真高上玉清隐书经 经名：洞真高上玉清隐书经。 简称《玉清隐书》。 撰人不详，约出於东晋。 系早期上清派重要经典。 原本有四卷八篇，后分作四种。 即：《上清太上玉清隐书灭魔神慧高玄真经》三篇； 《上清高上灭魔玉帝神慧玉清隐书》三篇； 《上清高上灭魔洞景金元玉清隐书经》一篇； 《上清高上金元羽章玉清隐书经》一篇。 底本出处：《正统道藏》正一部。 上清高上金元羽章玉清隐书经 如是羽章玉清隐书万灵隐音，高上玉帝藏之玉清上宫瑶台琼房之内，侍经兰庭玉女安绿梵、皇明基等七百人，北漠金仙玉童龄慧聪、王定云等五百人，执夜光宝明，常散三气返香之华，以拂神经之上品。 是五帝万仙众圣，一月皆三登玉清上宫，散香朝真，礼於神经也。 北台金玄洞微玉清消魔大王，生乎始劫之中，二仪分判，三象植灵，天地翳莽，幽幽冥冥，正诞於北漠广寒之庭，平丘中域寒谷之滨，元为我父，玄为我母，始结我身，以三气为字，讳曰： 。 我脱落紫胞而六眼焕精，竦身九千万丈，体生百变之光，七元交络，洞映玉形，三景待以朗曜，日月为之开明。 於是受命高上玉皇，授以金真玉光紫文丹章，玉玺凤函命魔灵幡，封掌九玄，总领五岳，检摄北酆，匡正三五，馘斩六天，受任上宫，威制万灵。 太上以瑶台玉女七千人，金仙玉童二千四百人，执华散香，侍卫於王，金头巨兽备於玉阙，治北帝寒乡广灵之宫，时乘碧霞九色流铃飞舆紫盖，从桑林千真，上升太虚，游冥玉清，东诣青华，校定方诸，西游龟山，定录天真，南方之洞阳南极上元，削死注生，勒箓安昌，中礼金阙太上玉京，受事於无极，总司於五方，典生死於图籍，制群妖於北酆，上统无上，下领无渊，五岳四渍十二河源万仙群灵，莫不咸隶於王焉。 消魔大王治天北广寒七宝宫下，领北罗酆山，山在北方癸地，高二千六百里，周回三万里，其山并有七宝珠宫，皆鬼神所住。 山下有万丈之谷，名曰丘寒之泉，则是鬼神之狱，北帝大魔王即住在山上纣绝阴天宫中。 有大魔王，姓宛躬，讳 产生，官属三万八千人，名悉隶属於消魔大王。 凡后学成仙，消魔大王皆使大魔王保举列言，然后乃得飞行上清。 大魔王常欲败人之学，恶人得仙，得仙便成大魔王之上真，故学常为大魔王所试，多有不过，皆是大魔所败。 学者有知大魔王秘名，所住宫府，则不被试校，亦自然得保举於上清也。 兆为学常当诵消魔王百神之咒，则禳於大魔之试，魔试既灭，真灵克降，得见真形，便白日飞腾，上升玉清之宫。 大魔王衣玄文之裘，头戴横天之冠，腰带龙头之剑，常乘羽输之车，飞行云中，常作谣歌，有三千言，乱败於后学。 故太上具书其曲，在消魔宝真经中，有知其曲，则试败不行，无复有伤坏之患。 东方青帝大魔王，姓迫落，讳 万形，头戴横天之冠，衣青羽之裘，腰带青绶虎头肇囊，或着绛章单衣，或化为青赤二色之光，领官属九千人，住在东方安大堂乡纳善之世。 常以春分之日，乘青轮羽车，飞行云中，游宴五岳，试败学仙之人。 凡修仙之道，当以此日入室西向，诵玉清紫道虚皇上君消魔咒一遍，则天魔自灭，又不被试。 九年则致紫道虚皇上君降形於兆身，修行自致感应，仙道自成也。",
      "translated_text": "**The Supreme Pervading Jade Purity Hidden Scripture of the Cavern of Reality**\n\n**Scripture Title:** *The Supreme Pavillion Jade Purity Hidden Scripture of the Cavern of Reality* (abbreviated as *The Jade Purity Hidden Scripture*). Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. The original text comprised four scrolls and eight chapters, later divided into four separate works:\n\n- *The Supreme Cavern Jade Purity Hidden Scripture of the Most High for Annihilating Demons and Divine Wisdom of the Lofty Mystery* (three chapters)\n- *The Most High Scripture of the Jade Purity Hidden Scripture for Annihilating Demons, Divine Wisdom of the Jade Emperor* (three chapters)\n- *The Scripture of the Jade Purity Hidden Scripture of the Cavern Radiance Golden Prime* (one chapter)\n- *The Scripture of the Golden Prime Feathered Chapters of the Jade Purity Hidden Scripture of the Most High Cavern* (one chapter)\n\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, First Division.\n\n---\n\n### *The Scripture of the Golden Prime Feathered Chapters of the Jade Purity Hidden Scripture of the Most High Cavern*\n\nSuch are the myriad numinous hidden tones of the *Feathered Chapters Jade Purity Hidden Scripture*, concealed within the Jade Terrace and Jasper Chambers of the Jade Purity Upper Palace by the Most High Jade Emperor. Attending the scripture are the Orchid Court Jade Maidens—An Lǜfàn, Huáng Míngjī, and seven hundred others—along with the Northern Desert Golden Immortals and Jade Lads—Líng Huìcōng, Wáng Dìngyún, and five hundred others—who hold night-shining precious luminants and perpetually scatter the blossoms of the Three Qi’s returning incense to anoint the divine scripture’s supreme essence.\n\nAll the Five Emperors, the ten thousand immortals, and the host of sages ascend thrice each month to the Jade Purity Upper Palace to scatter incense, pay homage to the perfected, and offer rites before the divine scripture.\n\nThe Great King of the Jade Purity Dispelling Demons of the Northern Terrace’s Golden Mystery Cavern was born amid the primordial kalpa. When the Two Modes divided and the Three Symbols took root, heaven and earth lay veiled in obscurity, dim and profound. He was rightly born in the Northern Desert’s Broad Cold Courtyard, by the banks of the Cold Valley within the Central Plain of Level Mounds. The Primordial was his father, the Mysterious his mother; they wove his form, and with the Three Qi as his name, his taboo is: **__**.\n\nShedding his purple womb, his six eyes blazed with essence. His body soared ninety million *zhang*, emanating a hundred shifting lights. The Seven Primes intertwined, suffusing his jade form with radiance. The Three Luminants awaited his brilliance, and the sun and moon opened their clarity for him.\n\nThereupon, the Most High Jade Emperor bestowed upon him the Golden Perfection, Jade Radiance, Purple Script, and Cinnabar Chapters, along with the Jade Seal, Phoenix Casket, and the Banner of Command over Demon Spirits. He was enfeoffed to govern the Nine Mysteries, oversee the Five Peaks, inspect and restrain the Northern Feng, rectify the Three and Five, behead the Six Heavens, and receive his commission in the Upper Palace, his might subduing the myriad spirits.\n\nThe Most High assigned seven thousand Jade Maidens of the Jade Terrace and two thousand four hundred Golden Immortals and Jade Lads to scatter blossoms and incense in attendance upon the King. Golden-headed colossal beasts stood guard at the Jade Gates. He ruled the Northern Emperor’s Cold Realm and the Broad Numinous Palace, often riding the Nine-Colored Flowing Bell Flying Chariot with its Purple Canopy, accompanied by a thousand perfected of the Mulberry Grove. Ascending to the Great Void, he roamed the Dark Jade Purity, journeyed east to the Azure Florescence to verify the Square Cauldrons, and traveled west to Tortoise Mountain to register the celestial perfected. In the southern Cavern Yang of the Southern Culmen’s Upper Prime, he excised the dead and inscribed the living, engraving the registers to pacify and prosper. At the center, he paid homage to the Golden Gates of the Most High Jade Capital, receiving his charge from the Boundless and governing the Five Directions. He oversaw life and death in the ledgers, controlled the demonic hordes of the Northern Feng, ruled above the Supreme, and commanded below the Abyssal. The Five Peaks, Four Marshes, Twelve River Sources, and the myriad immortals and numinous hosts—none were not subject to the King.\n\nThe Great King of Dispelling Demons rules beneath the Seven-Treasure Palace of the Northern Broad Cold, governing the Northern Fengluo Mountain. This mountain lies in the north, in the *guǐ* region, rising two thousand six hundred *lǐ* with a circumference of thirty thousand *lǐ*. The mountain is entirely adorned with seven-jeweled pearl palaces, all inhabited by ghosts and spirits.\n\nAt its base lies a valley ten thousand *zhang* deep, called the Spring of Mound Cold, which is the prison of ghosts and spirits. The Great Demon King of the Northern Emperor resides in the Palace of the Yin-Heaven of Zhòu’s Severed End atop the mountain.\n\nThere is a Great Demon King, surnamed Wǎn Gōng, with the taboo **__**, whose official retinue numbers thirty-eight thousand. All their names are subject to the Great King of Dispelling Demons.\n\nWhenever later disciples attain immortality, the Great King of Dispelling Demons commands the Great Demon King to submit their names for approval, after which they may ascend to the Upper Clarity.\n\nThe Great Demon King constantly seeks to thwart disciples’ studies, resenting their attainment of immortality. Once one achieves immortality, they become a perfected transcendent above the Great Demon King. Thus, disciples are often tested by the Great Demon King, and many fail, defeated by him.\n\nIf disciples know the Great Demon King’s secret name and the location of his palace, they will not be subjected to his trials and will naturally receive his endorsement for ascent to the Upper Clarity.\n\nDisciples should regularly recite the incantation of the Hundred Spirits of the Dispelling Demons King to repel the Great Demon’s trials. Once the demonic trials are dispelled, true numina will descend, and one may behold their true form, ascending in broad daylight to the Jade Purity Palace.\n\nThe Great Demon King wears a robe of dark script, a crown spanning the heavens, and a belt with a dragon-headed sword. He often rides a feathered chariot, flying through the clouds, and sings a ballad of three thousand words to confuse and corrupt later disciples.\n\nThus, the Most High recorded its verses in the *Treasure Scripture of Dispelling Demons*. Those who know its tune will not be subjected to trials, nor suffer harm or corruption.\n\nThe Great Demon King of the Eastern Azure Emperor is surnamed Pò Luò, with the taboo **__**. He wears a crown spanning the heavens and a robe of azure feathers, with a belt of azure cords and a tiger-headed satchel. Sometimes he dons a crimson unlined garment or transforms into a radiance of azure and vermilion. He commands nine thousand officials and resides in the Eastern Land of Peace, the Age of Nàshàn.\n\nOn the day of the vernal equinox, he rides a feathered chariot of azure wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality.\n\nThose who cultivate the Dao of immortality should, on this day, enter their chamber facing west and recite the *Incantation of the Jade Purity Purple Dao Void Sovereign Supreme Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested.\n\nAfter nine years, the Purple Dao Void Sovereign Supreme Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1241,
      "start_sentence": 0,
      "end_sentence": 30,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.48253130912781,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "高上玉形之道，轻泄灭身亡命。 东方青帝玉司君，常於春分之日，摄东方青帝大魔王，上诣郁悦那林昌玉台天紫阁之下，受事於玉清紫道虚皇上君也。 当此之日，亦应诵消魔智慧百神咒一遍也。 西方白帝大魔王，姓邓，讳 儿呼，头戴横天素冠，衣白羽之裘，腰带素灵之绶五色虎头肇囊，或着皂纹单衣，或化为老妪，巾白巾，手执金板，或化为紫苍二色之光，领官属七千人，住在西极福堂州盛行之世。 常以秋分之日，乘白轮羽车，飞行云中，游宴五岳，试败学仙之人。 凡修仙之道，当以其日入室南向，诵玉清翼日虚皇上道君消魔咒一遍，则天魔自灭，又不被试。 一十二年，则致翼日虚皇上道君降形於兆身，修行自致感应，仙道自成也。 高上玉秘之道，轻泄身灭鬼官。 西方白帝玉司君，常以秋分之日，摄西方白帝大魔王，上诣高桃厉冲龙罗天玉阙之下，受事於玉清翼日虚皇上道君也。 当此之日，亦应诵消魔智慧百神咒一遍也。 南方赤帝大魔王，姓赭，讳 上桓，头戴横天朱冠，衣青羽之裘，腰带丹灵之绶虎头肇囊，或着黄罗之衣，或为人头鸟身，身如凤凰，或化为玄黄二色之光，领官属八千人，住在宛梨城境弃贤之世。 常以夏至之日，乘赤轮羽车，飞行云中，游宴五岳，试败学仙之人。 凡修仙之道，当以其日入室北向，诵玉清昌阳姬虚皇高元君消魔咒一遍，则天魔自灭，又不被试。 一十八年，则致昌阳姬虚皇高元君降形於兆身，修行自致感应，仙道自成也。 高上玉秘之道，轻泄灭身。 南方赤帝玉司君，常以夏至之日，摄南方赤帝大魔王，上诣碧落空歌余梨天朱阁之下，受事於玉清昌阳姬虚皇高元君也。 当此之日，亦应诵消魔智慧百神咒一遍也。 北方黑帝大魔王，姓枭，讳 摇公，头戴横天玄冠，衣玄羽之裘，腰带玄灵之绶虎头肇囊，或着青纱单衣，或为人身蛇头，或化为青白二色之光，领官属五千人，住在郁亶野清静之世。 常以冬至之日，乘黑轮羽车，飞行云中，游宴五岳，试败学仙之人。 凡修仙之道，当以其日入室西南向，诵玉清七静导生高上虚皇君消魔咒一遍，则天魔自灭，又不被试。 十五年中，则致七静导生高上虚皇君降形於兆身，修行自致感应，仙道自成也。 高上玉秘之道，轻泄灭命。 北方黑帝玉司君，常以冬至之日，摄北方黑帝大魔王，上诣迦摩坦娄于翳天玄阁之下，受事於玉清七静导生高上虚皇君也。 当此之日，亦应诵消魔智慧百神咒一遍也。 西北方浩帝大魔王，姓光明，讳 法明，头戴横天紫冠，衣紫羽之裘，腰带紫绶虎头肇囊，或着白纱单衣，或为女子，作飞云髻，手执金杖，或化为紫白二色之光，领官属万人，住在西北福德之野延贤之世。 常以立冬之日，乘紫轮羽车，飞行云中，游宴五岳，试败学仙之人。 凡修仙之道，当以其日入室东南向，诵玉清太明虚皇洞清君消魔咒一遍，则天魔自灭，又不被试。 十二年中，则致太明虚皇洞清君降形於兆身，修行自致感应，仙道自成也。 高上玉秘之道，轻世灭身。 西北方浩帝主司微君，常以立冬之日，摄西北方浩帝大魔王，上诣扶刃盖华浮罗天紫阁之下，受事於玉清太明虚皇洞清君也。 兆当此之日，亦应诵消魔智慧百神咒一遍也。",
      "translated_text": "The Dao of the Supreme Jade Form, if lightly divulged, brings destruction to the body and loss of life.\n\nOn the day of the vernal equinox, the Jade Controller of the Eastern Azure Emperor summons the Great Demon King of the Eastern Azure Emperor and ascends to the Jade Terrace of Yùyuènàlínchāng beneath the Celestial Purple Pavilion of Heaven, where he receives his duties from the Jade Purity Purple Dao Void Sovereign Supreme Lord. On this day, one should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Western White Emperor, surnamed Dèng, styled Érhū, wears a horizontal celestial white crown and a robe of white feathers, with a belt of plain spirit sashes and a five-colored tiger-headed talisman pouch. He may don a black-lined unlined robe or transform into an elderly woman with a white kerchief, holding a golden tablet, or manifest as radiance of purple and azure. Commanding seven thousand officials, he resides in the Western Land of Fortune, the Age of Shèngxíng. On the day of the autumnal equinox, he rides a feathered chariot of white wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality. Those who cultivate the Dao of immortality should, on this day, enter their chamber facing south and recite the *Incantation of the Jade Purity Winged Sun Void Sovereign Supreme Dao Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested. After twelve years, the Winged Sun Void Sovereign Supreme Dao Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe supreme jade-secret Dao, if lightly divulged, brings destruction to the body and doom to the spirit-officials.\n\nOn the day of the autumnal equinox, the Jade Controller of the Western White Emperor summons the Great Demon King of the Western White Emperor and ascends to the Jade Tower of Gāotáolìchōnglóngluó beneath Heaven, where he receives his duties from the Jade Purity Winged Sun Void Sovereign Supreme Dao Lord. On this day, one should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Southern Vermilion Emperor, surnamed Zhě, styled Shànghuán, wears a horizontal celestial vermilion crown and a robe of azure feathers, with a belt of cinnabar spirit sashes and a tiger-headed talisman pouch. He may don a yellow gauze robe or take the form of a human-headed bird-bodied being resembling a phoenix, or manifest as radiance of dark and yellow. Commanding eight thousand officials, he resides in the Wǎnlí City Realm, the Age of Qìxián. On the day of the summer solstice, he rides a feathered chariot of vermilion wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality. Those who cultivate the Dao of immortality should, on this day, enter their chamber facing north and recite the *Incantation of the Jade Purity Prosperous Yang Ji Void Sovereign High Prime Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested. After eighteen years, the Prosperous Yang Ji Void Sovereign High Prime Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe supreme jade-secret Dao, if lightly divulged, brings destruction to the body.\n\nOn the day of the summer solstice, the Jade Controller of the Southern Vermilion Emperor summons the Great Demon King of the Southern Vermilion Emperor and ascends to the Vermilion Pavilion of Bìluòkōnggēyúlí beneath Heaven, where he receives his duties from the Jade Purity Prosperous Yang Ji Void Sovereign High Prime Lord. On this day, one should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Northern Black Emperor, surnamed Xiāo, styled Yáogōng, wears a horizontal celestial dark crown and a robe of dark feathers, with a belt of dark spirit sashes and a tiger-headed talisman pouch. He may don a black-lined unlined robe or take the form of a human-bodied snake-headed being, or manifest as radiance of azure and white. Commanding five thousand officials, he resides in the Yúdǎn Wilds, the Age of Serenity. On the day of the winter solstice, he rides a feathered chariot of black wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality. Those who cultivate the Dao of immortality should, on this day, enter their chamber facing southwest and recite the *Incantation of the Jade Purity Sevenfold Serenity Life-Guiding Supreme Void Sovereign Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested. Within fifteen years, the Sevenfold Serenity Life-Guiding Supreme Void Sovereign Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe supreme jade-secret Dao, if lightly divulged, brings destruction to life.\n\nOn the day of the winter solstice, the Jade Controller of the Northern Black Emperor summons the Great Demon King of the Northern Black Emperor and ascends to the Dark Pavilion of Jiāmótǎnlóuyúyì beneath Heaven, where he receives his duties from the Jade Purity Sevenfold Serenity Life-Guiding Supreme Void Sovereign Lord. On this day, one should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Northwest Hào Emperor, surnamed Guāngmíng, styled Fǎmíng, wears a horizontal celestial purple crown and a robe of purple feathers, with a belt of purple sashes and a tiger-headed talisman pouch. He may don a white gauze unlined robe or take the form of a woman with a flying-cloud coiffure, holding a golden staff, or manifest as radiance of purple and white. Commanding ten thousand officials, he resides in the Northwest Land of Fortune and Virtue, the Age of Yánxián. On the day of the Beginning of Winter, he rides a feathered chariot of purple wheels, flying through the clouds to feast and roam the Five Peaks, testing and corrupting those who study immortality. Those who cultivate the Dao of immortality should, on this day, enter their chamber facing southeast and recite the *Incantation of the Jade Purity Great Brightness Void Sovereign Cavern Purity Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested. Within twelve years, the Great Brightness Void Sovereign Cavern Purity Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.\n\nThe supreme jade-secret Dao, if divulged to the world, brings destruction to the body.\n\nOn the day of the Beginning of Winter, the Jade Controller of the Northwest Hào Emperor summons the Great Demon King of the Northwest Hào Emperor and ascends to the Purple Pavilion of Fúrèngàihuáfúluó beneath Heaven, where he receives his duties from the Jade Purity Great Brightness Void Sovereign Cavern Purity Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.",
      "overlap_context": "who study immortality.\n\nThose who cultivate the Dao of immortality should, on this day, enter their chamber facing west and recite the *Incantation of the Jade Purity Purple Dao Void Sovereign Supreme Lord for Dispelling Demons* once. Then, celestial demons will naturally perish, and one will not be tested.\n\nAfter nine years, the Purple Dao Void Sovereign Supreme Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved.",
      "start_char": 1241,
      "end_char": 2476,
      "start_sentence": 31,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.48616981506348,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "东南方昊帝大魔王，姓方生，讳 灾展，头戴横天黄冠，衣黄羽之裘，腰带黄绶虎头肇囊，或着紫纱单衣，或为人头蛇身，口衔素绶，或化为苍绿二色之光，领官属六千人，住在东南元福田用贤之世。 常以立夏之日，乘黄轮羽车，飞行云中，游宴五岳，试败学仙之人。 凡修仙之道，当以其日入室西北向，诵玉清始元虚皇太霄君消魔咒一遍，则天魔自灭，又不被试。 十五年，则致始元虚皇太霄君降形於兆身，修行自致感应，仙道自成也。 高上玉秘之道，轻泄灭身。 东南方昊帝主司微君，常以立夏之日，摄东南方昊帝大魔王，上诣具渭耶渠初默天黄阁之下，受事於玉清始元虚皇太霄君也。 当此之日，亦应诵消魔智慧百神咒一遍也。 东北方仓帝大魔王，姓邵，讳 无量，头戴横天青冠，衣青羽之裘，腰带青绶虎头鞶囊，或着绿纱单衣，或龙头人身，手执青节，或化为火精，领官属九千人，住在福集都长安之世。 常以立春之日，乘苍轮羽车，飞行云中，游宴五岳，试败学仙之人。 凡修仙之道，当以其日入室西南向，诵玉清七观无生虚皇金灵君消魔咒一遍，则天魔自灭，又不被试。 十年，则致七观无生虚皇金灵君降形於兆身，修行则自致感应，仙道自成也。 高上玉秘之道，轻泄殃连七祖，己身亡命。 东北方苍帝主司微君，常以立春之日，摄东北方苍帝大魔王，上诣冲容育郁敌沙天青阁之下，受事於玉清七观无生虚皇金灵君也。 当此之日，亦应诵消魔智慧百神咒一遍也。 西南方黄帝大魔王，姓五乌盈，讳 通勃，头戴横天绿冠，衣绿羽之裘，腰带绿绶虎头肇囊，或着黄纱单衣，或为一人九头，手执金戟，或化为紫皂二色之光，领官属七千人，住在西官延福乡仁静之世。 常以立秋之日，乘绿轮羽车，飞行云中，游宴五岳，试败学仙之人。 凡修仙之道，当以其日入室东北向，诵玉清八观高元虚皇停景君消魔咒一遍，则天魔自灭，又不被试。 九年则致八观高元虚皇停景君降形於兆身，修行自致感应，仙道自成也。 高上玉被之道，轻泄被考灭身，殃及七玄。 西南方黄帝主司微君，常以立秋之日，摄西南方黄帝大魔王，上诣单缘察宝轮法天紫阁之下，受事於玉清八观高元虚皇停景君也。 当此之日，亦应诵消魔智慧百神内咒一遍也。 八方大魔王，皆与六天同生，而其官属皆有万众，游行则从鬼兵，幡盖麾节，五色玄黄，飞行云中，或在五岳，下历八间，妬害仙道，试败学仙之人，不欲令得仙，故高上八帝君，以消魔神咒威而制之。 学者徒知上皇至讳，不知天魔之名，仙道终不得成。 有知魔王秘讳，而以神咒制之，魔王便自连名保举，列言於玉清，仙道无不成也。 其法玄妙，高上藏之於幽匮七宝金堂，万劫一宣，自无金名玉字，列图帝籍，终不得见其文。 有得此法，不学自仙，高上以左官执杀侍卫，检慢轻泄非真，七祖充责，己身灭命，幽执三涂，万劫不原。 玉清消魔大王金玄百神内咒隐文 高虚抚闲，四气肃恭，玄玄八会，金磬朗空，玉慧逸霄，洞微发冲，四景敷灵，六度休冲，炼化合变，飞步霞峰，高会玉清，三元上宫，朝宴九帝，八朗丹窗，明上开道，七元焕通，清波遐镜，精散玉房，高真森罗，郁若流光，金仙执华，素灵散芳，飞天巨兽，备卫玉皇，二象停虚，三晖翳昏，神符万变，七星交奔，九帝显盖，徘徊洞门，峨峨高虚，巍巍德尊，混生万化，阴察圣源，檄命五帝，征召上元，消魔变威，回风迅雷，扫除妖祟，收摄魔群，束精捕灵，受命帝君，有罪者戮，有功者原，勒名三天，主司大神，金玄玉慧，皆如玉文，郁罗广都，兆生私存，玄幄总命，乘空无轮，百神之宗，日发易迁，悟达之门，度法含光，运长弥劫，速离开神，华寝明宾，皆是北酆魔王，谣歌玄音，乱我云营，仙按名检，察付玉晨，高上之命，悉如太真。",
      "translated_text": "The Great Demon King of the Southeast Hào Emperor bears the surname Fāngshēng and the personal name Zāizhǎn. He wears a horizontal Heavenly Yellow Crown, dons a robe of yellow feathers, and girds himself with a tiger-headed pouch tied by a yellow sash. At times, he appears in a single layer of purple gauze, or as a human-headed serpent with a white sash in its mouth, or transforms into a radiance of azure and green hues. He commands an entourage of six thousand officials and resides in the Primordial Blessed Field of the Worthy in the Southeast. On the day of the Beginning of Summer, he rides a yellow-feathered chariot, soaring through the clouds to roam and feast among the Five Peaks, testing and thwarting those who cultivate the immortal Dao. On this day, the disciple should enter their chamber, face the northwest, and recite the *Incantation of the Jade Purity Primordial Void Sovereign Supreme Empyrean Lord for Dispelling Demons* once, whereupon celestial demons will naturally perish, and one will not be tested. Within fifteen years, the Primordial Void Sovereign Supreme Empyrean Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved. The supreme jade-secret Dao, if divulged to the world, brings destruction to the body.\n\nOn the day of the Beginning of Summer, the Jade Controller of the Southeast Hào Emperor summons the Great Demon King of the Southeast Hào Emperor and ascends to the Yellow Pavilion of Jùwèiyéqú Chūmò beneath Heaven, where he receives his duties from the Jade Purity Primordial Void Sovereign Supreme Empyrean Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Northeast Cāng Emperor bears the surname Shào and the personal name Wúliàng. He wears a horizontal Heavenly Azure Crown, dons a robe of azure feathers, and girds himself with a tiger-headed pouch tied by an azure sash. At times, he appears in a single layer of green gauze, or as a dragon-headed human with a green staff in hand, or transforms into a spirit of fire. He commands an entourage of nine thousand officials and resides in the Blessed Assembly Capital of Cháng’ān. On the day of the Beginning of Spring, he rides an azure-feathered chariot, soaring through the clouds to roam and feast among the Five Peaks, testing and thwarting those who cultivate the immortal Dao. On this day, the disciple should enter their chamber, face the southwest, and recite the *Incantation of the Jade Purity Seven Observations Non-Being Void Sovereign Golden Numinous Lord for Dispelling Demons* once, whereupon celestial demons will naturally perish, and one will not be tested. Within ten years, the Seven Observations Non-Being Void Sovereign Golden Numinous Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved. The supreme jade-secret Dao, if divulged, brings calamity to seven generations of ancestors and severs one’s own fate.\n\nOn the day of the Beginning of Spring, the Jade Controller of the Northeast Cāng Emperor summons the Great Demon King of the Northeast Cāng Emperor and ascends to the Azure Pavilion of Chōngróng Yùyù Dísā beneath Heaven, where he receives his duties from the Jade Purity Seven Observations Non-Being Void Sovereign Golden Numinous Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon King of the Southwest Huáng Emperor bears the surname Wǔwūyíng and the personal name Tōngbó. He wears a horizontal Heavenly Green Crown, dons a robe of green feathers, and girds himself with a tiger-headed pouch tied by a green sash. At times, he appears in a single layer of yellow gauze, or as a nine-headed figure wielding a golden halberd, or transforms into a radiance of purple and black hues. He commands an entourage of seven thousand officials and resides in the Western Palace’s Extended Blessing Village of Benevolent Tranquility. On the day of the Beginning of Autumn, he rides a green-feathered chariot, soaring through the clouds to roam and feast among the Five Peaks, testing and thwarting those who cultivate the immortal Dao. On this day, the disciple should enter their chamber, face the northeast, and recite the *Incantation of the Jade Purity Eight Observations Lofty Primordial Void Sovereign Radiance-Halting Lord for Dispelling Demons* once, whereupon celestial demons will naturally perish, and one will not be tested. Within nine years, the Eight Observations Lofty Primordial Void Sovereign Radiance-Halting Lord will manifest in the disciple’s body. Through cultivation, resonance will naturally arise, and the immortal Dao will be achieved. The supreme jade-secret Dao, if divulged, subjects one to trial and destruction, bringing calamity to seven generations.\n\nThe Jade Controller of the Southwest Huáng Emperor, on the day of the Beginning of Autumn, summons the Great Demon King of the Southwest Huáng Emperor and ascends to the Purple Pavilion of Dānyuán Chábǎo Lúnfǎ beneath Heaven, where he receives his duties from the Jade Purity Eight Observations Lofty Primordial Void Sovereign Radiance-Halting Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.\n\nThe Great Demon Kings of the Eight Directions were born alongside the Six Heavens, and their officials number in the tens of thousands. When they roam, they are accompanied by ghostly soldiers, banners, canopies, and insignia of the five colors and dark yellow, soaring through the clouds or dwelling among the Five Peaks, descending through the Eight Realms to envy and harm the immortal Dao, testing and thwarting those who cultivate it, unwilling to let them attain immortality. Thus, the Eight Supreme Emperor Lords employ the divine incantations for dispelling demons to restrain them with their majesty. Disciples who know only the supreme taboo names of the Highest Sovereign but not the names of the celestial demons will never achieve the immortal Dao. Those who know the secret names of the demon kings and restrain them with divine incantations will cause the demon kings to submit their names in guarantee, reporting them to the Jade Purity, whereupon the immortal Dao will unfailingly be achieved. This method is profoundly wondrous, concealed by the Supreme in the secluded Seven Treasures Golden Hall of the Dark Coffer, revealed but once in ten thousand kalpas. Without one’s golden name and jade characters recorded in the imperial registers, one will never behold its text. Those who obtain this method will attain immortality without study. The Supreme appoints left officials to execute and guard against negligence, carelessness, or unauthorized disclosure. For those who are not true adepts, seven generations of ancestors will be punished, and one’s own fate will be extinguished, bound in the Three Wretched Realms for ten thousand kalpas without deliverance.\n\n**Hidden Text of the Jade Purity Great King for Dispelling Demons and the Golden Numinous Hundred Spirits Incantation**\n\nThe Supreme Void is tranquil and at ease; the four qi are solemn and reverent. The Eight Mysteries of the Profound gather; golden chimes resound through the empty sky. Jade wisdom soars through the empyrean; the cavernous subtle stirs the primordial. The four radiant scenes unfold their numen; the six perfections rest in harmony. Through refinement and transformation, they merge and change; stepping upon rosy clouds, they ascend the peaks. In the high assembly of the Jade Purity, the Three Primordials’ Upper Palace, they attend the banquet of the Nine Emperors before the Eight Luminous Cinnabar Windows. The luminous opens the Dao above; the Seven Primordials shine through. The clear waves mirror the distant; essence scatters in the Jade Chamber. The lofty perfected stand in array, luxuriant as flowing light. Golden immortals hold blossoms; pure spirits disperse fragrance. Flying celestial beasts guard the Jade Emperor. The two images rest in the void; the three luminaries veil the dusk. Divine talismans transform myriad times; the Seven Stars intersect in their courses. The Nine Emperors display their canopies, lingering at the cavern’s gate. Towering and lofty is the Supreme Void; majestic and venerable is virtue. The myriad transformations arise in unity; the dark examines the sacred source. A summons is issued to the Five Emperors; the Upper Primordial is invoked. The demon-dispelling majesty transforms; the returning wind and swift thunder sweep away evil and banish demons. Essence is bound, spirits captured; the Emperor Lord receives his mandate. Those guilty are executed; those meritorious are pardoned. Their names are recorded in the Three Heavens; the great deities who preside over this are the Golden Numinous and Jade Wisdom, all as the jade text decrees. In the vast capital of Yùluó, the disciple’s private existence is preserved. The dark canopy commands all; riding the wheel-less void, they are the ancestors of the hundred spirits. The sun’s radiance shifts and changes; the gate of awakened attainment opens the dharma containing light. Through long kalpas, they swiftly depart from the divine. The resplendent chamber and bright guests—all are the demon kings of the Northern Fēng. Their eerie songs and mysterious chants disrupt our cloudy encampment. The immortals check the names and submit them to the Jade Dawn. The commands of the Supreme are all as the Great Perfected decrees.",
      "overlap_context": " divulged to the world, brings destruction to the body.\n\nOn the day of the Beginning of Winter, the Jade Controller of the Northwest Hào Emperor summons the Great Demon King of the Northwest Hào Emperor and ascends to the Purple Pavilion of Fúrèngàihuáfúluó beneath Heaven, where he receives his duties from the Jade Purity Great Brightness Void Sovereign Cavern Purity Lord. On this day, the disciple should also recite the *Incantation of Wisdom for Dispelling Demons and the Hundred Spirits* once.",
      "start_char": 2477,
      "end_char": 3940,
      "start_sentence": 62,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.90993070602417,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "於是五老策辔，高秀皇庭，羽裙玉袂，锦帔流铃，金冠紫佩，日华吐精，灵光曜轮，八晖玄清，五帝翼舆，辅辅四明，洞天盼观，妙景云营，天扉解关，灵禁开明，翱腾紫霄，八涂合冥，道妙远畅，游梦上清，七圣同符，理命长生，三回五转，拔度七星，太一务猷，勒录仙庭，凌梵履昌，五气合并，十绝牢张，开度丹名，玄母欢熙，永保常生，白元无英，日会黄宁，五老齐契，枝秀华荣，保录南仙，莫不胎婴，三气观光，金仙浴形，朽尸腾飞，上升三清，太一校魔，天元摄精，灭试消凶，不得妄生，六师扬电，放掷火铃，威振八界，十方肃霐，龙飞凤翔，上披四明，丹文录字，金书羽经，世保景龙，运契仙庭，九真缠绵，上愿克成，制魔保举，飞登玉清。 消魔金玄百神内篇，皇上宝秘，藏之琼宫，授於上圣，不传下仙，有金名玉字，列图朱轩，胃藏生华，当得此文，修行万徧，驾景乘云，飞腾三清，出入帝晨，上开七祖，解拔宿根，度生录於南宫，保紫胞於胎元，摄生道於十方，命玉慧於金房，希灵霞於妙感，抚八会於九空，尔乃招真景以曲降，睹神颜於玉皇，期徽章於兰庭，制天魔於北酆。 凡行此道，常以八节及本命、太岁之日，转经行道，履行名山，皆当北向，叩左齿三十二通，切声而诵篇。 诵咏一篇，神朗气清，天魔灭景，仙道自成。 轻泄此法，七祖充责，己身亡命，终不得仙。 玉清紫道虚皇上君郁悦那林昌玉台天中消魔智慧咒隐文金玄羽章 玉天四张，八世高灵，二罗焕落，玉慧洞清，金唱虚音，振响紫琼，百和结真，检制魔名，三波夷恬，渎格贾生，吐毒纳善，啸命鬼兵，北酆不拘，放浪云营，玉帝唱啸，群魔摧倾，六天灭景，三道布灵，皇上散晖，我道已明，太一勒籍，务猷保生，公子度符，拔解七星，五苦咸散，朽骨仙荣，灭试保真，羽服郁青，带金佩玉，交落流铃，回合玉霄，同入黄宁，万禁开涂，飞腾紫庭。 玉清翼日虚皇上道君高桃厉冲龙罗天中消魔智慧咒隐文金玄羽章 高桃奕奕，龙罗昂昂，金晖骞张，四明焕光，景云秀虚，朱兰洋洋，玉房紫阶，交云四通，离罗翼翼，神宇堂堂，金灵曜虚，映带神王，五老八景，上合牢张，神昌玉慧，啸朗发空，飞精羽盖，舞轮空洞，三入北清，二谒上宫，勒命北帝，检摄魔王，斩灭六天，严劫北酆，束精缚妖，受事玉皇，玃然飙蝭，万万皆崩，道布三真，成我仙公，陵梵履昌，守固绛宫，司命保算，丹书南昌，解拔七玄，腐骨更蓊，起度三涂，翱翔霄峰，灭试召灵，消魔同功，道合帝一，乘景策龙，飞登高桃，龙罗天中。 玉清昌阳姬虚皇高元君碧落空歌余梨天中消魔智慧咒隐文金玄羽章 北帝放大魔，谣歌绕云陈，氛氛翳空洞，蓊蓊乱天真，飞行九玄霞，肆群数万千，乘虚参天气，试或干我仙，高上命玉慧，羽章朗金玄，十绝回朱景，神唱自成真，灵幡征万魔，肃若风拂尘，束精灭贾生，封检北酆山，皛配祆端，绝景消魔篇，五老度符籍，司命定命年，幽寥伯吏车，合景炼我身，灵晖映帝席，携提高上人，赤子招神公，降致八帝宾，飞登碧落庭，飘讽入三便，拔解五苦根，返胎生七玄，朽骨皆升飞，同入虚无烟。 玉清七静导生高上虚皇君迦摩坦娄于翳天中消魔智慧咒隐文金玄羽章",
      "translated_text": "Then the Five Elders take up their reins, ascending the lofty and resplendent imperial court. Their feathered skirts and jade sleeves ripple, embroidered capes with flowing bells; golden crowns and purple sashes radiate the sun’s essence, their numinous light illuminating the wheel. Eightfold radiance purifies the mysteries; the Five Thearchs flank the imperial carriage, escorting the Four Luminaries. The grotto-heavens gaze in wonder, wondrous scenes forming cloudy encampments. The gates of heaven unseal, the numinous barriers open in clarity. Soaring through the purple empyrean, the eight paths merge into darkness. The Dao’s subtleties stretch far and wide; wandering dreams ascend to the Upper Clarity. The Seven Sages align in harmony, their principles commanding long life. Thrice they circle and five times they turn, delivering the Seven Stars. The Great One attends to his duties, inscribing records in the immortal court. Ascending the Brahma-realm, treading prosperity, the five qi converge, the Ten Perfections firmly arrayed. The cinnabar names are opened and delivered; the Mysterious Mother rejoices. Eternal life is forever preserved. The White Prime and the Peerless, the Solar Assembly and the Yellow Tranquility—all Five Elders unite in accord. Branches flourish in splendor, preserving the Southern Immortals. None fail to be embraced as embryos; the three qi behold the light. Golden immortals bathe in form, decayed corpses soar in flight, ascending to the Three Clarities. The Great One examines demons; the Celestial Origin captures essence. Trials are extinguished, calamities dissolved—no reckless births are permitted. The Six Masters brandish lightning, hurling fire-bells. Their might shakes the eight realms; the ten directions stand in solemn stillness. Dragons soar and phoenixes glide, ascending to pierce the Four Luminaries. Cinnabar texts record their names; golden scriptures of feathered classics. The world safeguards the radiant dragon, its destiny aligned with the immortal court. The Nine Perfected entwine in harmony; the highest vows are fulfilled. Demons are subdued, protections upheld—soaring to ascend the Jade Clarity.\n\n*The Inner Chapter of the Golden Numinous Hundred Spirits for Dispelling Demons*\nA treasure of the August Supreme, concealed within the Jasper Palace, bestowed upon the highest sages, not transmitted to lesser immortals. Those with golden names and jade characters, arrayed in vermilion charts, whose viscera bloom with life—only they may receive this text. Practicing ten thousand repetitions, they ride the radiance and mount the clouds, soaring through the Three Clarities, entering and departing the imperial dawn. They open the way for seven generations of ancestors, severing karmic roots, delivering lives to the Southern Palace, preserving the purple embryo within the primordial womb. They gather the Dao of life from the ten directions, command Jade Wisdom in the golden chamber, seek numinous radiance through wondrous resonance, and embrace the eight assemblies within the nine voids. Thus they summon true radiance to descend in curves, beholding the divine countenance of the Jade Emperor. They await the insignia in the Orchid Court, subduing the celestial demons of the Northern Feng. All who practice this Dao shall, on the eight solar terms and their own birthdays and the days of the Great Year Star, recite the scripture and perform the Dao-circuits, treading upon sacred mountains—always facing north. They shall strike the left teeth thirty-two times, reciting the chapter in a hushed voice. With each recitation, the spirit brightens and qi purifies; celestial demons vanish like shadows, and the immortal Dao naturally manifests. Those who recklessly divulge this method shall see their seven generations of ancestors held accountable, their own lives forfeit, and immortality forever denied.\n\n*The Jade Clarity Purple Dao Hidden Writ of the Golden Numinous Feathered Chapter of the Upper Lord of the Void Emperor Yuyue Nalin Chang in the Heavenly Central Dispelling-Demons Wisdom Incantation*\nThe four expansions of the Jade Heaven, the eight generations of lofty numina. The Two Nets gleam and fall; Jade Wisdom illumines the Clarity. The golden chant resounds in emptiness, vibrating the purple jasper. A hundred harmonies bind the true; demonic names are checked and restrained. The Three Waves are tranquil; the defiled are purged. Poison is expelled, goodness embraced; whistling commands the ghostly soldiers. The Northern Feng is unbound, roaming the cloudy encampments. The Jade Emperor chants and whistles; the demonic hordes collapse. The Six Heavens vanish like shadows; the Three Paths spread their numina. The August Supreme scatters his radiance; our Dao is now clear. The Great One inscribes the register, attending to the preservation of life. The Duke’s son delivers the talisman, severing the Seven Stars. The five sufferings disperse entirely; decayed bones flourish as immortals. Trials are extinguished, the true preserved. Feathered robes of deep green, girded with gold and jade, interlacing bells flowing. Circling and converging in the Jade Empyrean, together they enter the Yellow Tranquility. Ten thousand prohibitions open the paths; soaring to the Purple Court.\n\n*The Jade Clarity Winged Sun Hidden Writ of the Golden Numinous Feathered Chapter of the Upper Dao Lord of the Void Emperor Gao Tao Li Chong in the Heavenly Central Dispelling-Demons Wisdom Incantation*\nLofty peaches resplendent, the Dragon Net soaring. Golden radiance unfurls, the Four Luminaries gleaming. Radiant clouds flourish in emptiness; vermilion orchids overflow. Jade chambers and purple terraces, intersecting clouds in four directions. The Departed Net spreads its wings; the divine hall stands majestic. The golden numen shines in emptiness, girding the divine kings. The Five Elders and Eight Radiance unite in firm array. The numinous flourishes, Jade Wisdom whistles clear through the void. Flying essence and feathered canopies, dancing wheels in the hollow sky. Thrice entering the Northern Clarity, twice visiting the Upper Palace. Commanding the Northern Emperor, checking and capturing demon kings. Beheading the Six Heavens, purging the Northern Feng’s kalpas. Binding essence and restraining demons, submitting to the Jade Emperor. With a sudden roar, the myriad myriads collapse. The Dao spreads the Three Perfected, perfecting our immortal lords. Ascending the Brahma-realm, treading prosperity, guarding the Crimson Palace. The Controller of Destinies preserves the tally; cinnabar script in the Southern Prosperity. Severing the Seven Mysteries, decayed bones flourish anew. Delivering the Three Paths, soaring through the empyrean peaks. Extinguishing trials and summoning numina, dispelling demons in shared merit. The Dao aligns with the Imperial Unity, riding the radiance and spurring the dragon. Soaring to ascend the lofty peach, the Dragon Net in the heavenly center.\n\n*The Jade Clarity Prosperous Yang Hidden Writ of the Golden Numinous Feathered Chapter of the Highest Lord of the Void Emperor Ji in the Azure Empyrean Heavenly Central Dispelling-Demons Wisdom Incantation*\nThe Northern Emperor unleashes the great demons; their eerie songs swirl around the cloudy ranks. Vapors thickly veil the hollow sky; luxuriant growth disrupts the celestial true. Flying through the ninefold radiance of mystery, their hordes number in the tens of thousands. Riding the void, they probe the celestial qi, testing or offending our immortals. The Highest commands Jade Wisdom; the feathered chapter resounds with the Golden Numinous. The Ten Perfections reverse the vermilion radiance; the divine chant naturally perfects the true. Numinous banners subdue the myriad demons, solemn as wind sweeping dust. Binding essence to extinguish the defiled, sealing and checking the Northern Feng’s mountain. The luminous aligns with the demonic source; the radiant dispels the demonic chapter. The Five Elders deliver talismanic registers; the Controller of Destinies fixes the years of life. The dark and desolate chariots of the Earls, uniting radiance to refine my body. Numinous splendor reflects the imperial seat; lifting and guiding the highest person. The Red Child summons the divine lords, descending to welcome the eight imperial guests. Soaring to ascend the Azure Empyrean Court, drifting and chanting into the threefold convenience. Severing the roots of the five sufferings, returning the embryo to birth the Seven Mysteries. Decayed bones all ascend in flight, entering together the mist of emptiness.\n\n*The Jade Clarity Sevenfold Stillness Guiding Life Hidden Writ of the Golden Numinous Feathered Chapter of the Highest Lord of the Void Emperor Jiama Tanlou Yu in the Heavenly Central Dispelling-Demons Wisdom Incantation*",
      "overlap_context": "hey are the ancestors of the hundred spirits. The sun’s radiance shifts and changes; the gate of awakened attainment opens the dharma containing light. Through long kalpas, they swiftly depart from the divine. The resplendent chamber and bright guests—all are the demon kings of the Northern Fēng. Their eerie songs and mysterious chants disrupt our cloudy encampment. The immortals check the names and submit them to the Jade Dawn. The commands of the Supreme are all as the Great Perfected decrees.",
      "start_char": 3940,
      "end_char": 5196,
      "start_sentence": 90,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.66600441932678,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "七静乘劫回，飞虚入北元，隐息洞清馆，暧暧陵景云，飞行盼阴房，日月植灵根，推度三象运，七星焕以分，天魔横云宫，秽气何纷纷，宛勒当道生，称为大魔群，谣歌盖空洞，乱惑学仙门，虚皇命八帝，上披于翳关，金玄朗玉慧，清诵消魔篇，催检摄北帝，上对玉清君，束魔灭祆试，悉如九天文，洞阳郁灵标，闭固死户源，解胞散滞血，百节生正神，正神辅我身，制魔命长存，灵福充七祖，返胎生来仙，保真迦摩天，世为道德尊。 玉清太明虚皇洞清君扶刀盖华浮罗天中消魔智慧咒隐文金玄羽章 飞皇盼云舆，洞清映浮罗，玄湄散朱轩，朝灵朗太霞，泛真玄霄上，晃晃曜景华，三清保劫用，同此亿椿柯，萧萧乘神清，握节检天魔，五老征北帝，收摄鬼神家，赭邓掩天真，壅塞万仙阿，金玄洞玉慧，羽章灭谣歌，命篇束群祆，受事诣消魔，携仙回帝席，泛此玄津波，秀朗宝太晖，真人互翻葩，五灵度符籍，延昌固命柯，保我万劫功，谁测天纪多，七祖上生天，解脱度幽罗，洞清灭仙试，身飞升玄都。 玉清始虚皇太霄君具渭耶渠初默天中消魔智慧咒隐文金玄羽章 皓映太霄，乘虚而回，金华曜晨，龙景空飞，玉仙侠侍，五老扶麾，太阳启津，七元焕开，五帝齐真，三景徘徊，宴轮云房，上披朱机，征命八天，总摄四垂，万灵束带，受事太微，担天折额，承间吐威，谣歌飞空，试惑我怀，勒名北帝，检剪无遗，神真出游，天地倾摧，群魔降伏，仙仙皆飞，冲成曲文，与我同晖，元父玄母，万神总归，超步玉霞，身登金梯，拔出三涂，七玄散披，保仙太霄，福庆巍巍。 玉清七观无生虚皇金灵君冲容育郁敌沙天中消魔智慧咒隐文金玄羽章 冲虚映晨灯，炜晔广陵堂，宝云扇九岭，玉房坐虚皇，紫宾表玄籍，回风孩道康，金符召渡卿，灵幡摄魔王，器霐灭万试，合仙成我功，于景宝命生，运珠守上官，灵灌七关府，返老化婴童，拔出地户难，保此日月光，七祖离幽夜，受福南极房，金符入玄室，身飞升冲容。 玉清八观高元虚皇渟景君单缘察宝轮法天中消魔智慧咒隐文金玄羽章 渟景轮法天，八观映玉清，飞华落散景，返香流金庭，虹映焕玄台，三帝合启明，萧刅侍金门，保此累劫生，北元促天运，杖幡征五灵，禁闭北酆宫，宴麾检云营，高上观八荒，谣歌从何生，郁育鼓洋道，称号洒八冥，羽书摄群祆，金玄束万精，魔王并受事，灭试消魔经，玄命应符会，五帝勅己清，公子执五符，太一固我形，三元标箓籍，刻书东华琼，七玄皆升飞，同欢八观庭。 消魔智慧咒金玄隐文，皆结飞玄自然之气以成其章，焕乎八天之上，郁乎玉清之中，制魔定真，灭试招仙，金音逸朗於紫虚，玉慧振响於霞庭。 故高上浮轮以严试，虚皇策辔以观真，辅玉仙以侍卫，命五老以检灵，上标玄妙之贵行，下崇巍巍乎难称，福庆充於玄叶，重荫流於种躬，朽骨蒙其玄赖，受更生於胎仙，高难可名，神难可宣，故上圣置篇，称为隐文焉。 八天虚皇帝君受之於九空，以传玉清玉帝君消魔大王，大王以传五帝上真君，以传高上玉皇君，高上玉皇君以传太帝，太帝以传太上大道君，太上大道君以传太微天帝君，太微天帝君以传后圣九玄金阙帝君，帝君以传上相青童君。",
      "translated_text": "The Seven Stillnesses ride the kalpas in return, soaring through the void into the Northern Origin. Concealing breath in the Grotto-Clear Lodge, dimly luminous they ascend the radiant clouds. Flying and traversing, they gaze upon the Yin Chamber; sun and moon plant the numinous root. They reckon the revolutions of the Three Images, the Seven Stars shining in their divisions. Heavenly demons fill the Cloud Palace, foul qi swirling in profusion. Winding and restraining, they arise upon the path, called the Great Demon Host. Their chants and songs blanket the empty grottoes, confounding and deluding the gates of those who study transcendence. The Void Emperor commands the Eight Emperors, ascending to open the Veiled Pass. The Golden Mystery illumines Jade Wisdom; pure recitation dissolves the demonic scripture. They hasten the seals to summon the Northern Emperor, ascending to face the Jade Clarity Lord. Binding demons and extinguishing demonic trials, all conforms to the writ of the Nine Heavens. The Grotto-Yang flourishes with numinous standards, sealing fast the source of the Gate of Death. They unbind the embryo and scatter stagnant blood, a hundred joints birthing the true spirits. The true spirits assist my body, controlling demons to command long life. Numinous blessings fill the seven ancestors, returning the embryo to birth as an immortal. Preserving authenticity in the Jiama Heaven, for generations they are honored as paragons of the Dao and virtue.\n\n*The Jade Clarity Great Brightness Void Emperor Grotto-Clear Lord Fu Dao Gai Hua Fu Luo Heavenly Central Dispelling-Demons Wisdom Incantation Hidden Writ of the Golden Mystery Feathered Chapter*\n\nThe Flying Emperor gazes upon the cloud chariot, the Grotto-Clear reflecting the Floating Net. The dark abyss scatters the vermilion portals, the court of the numinous illumining the Great Radiance. Drifting transcendent upon the Dark Empyrean, resplendent they gleam with radiant splendor. The Three Clarities preserve the kalpas’ use, together with these countless eons of camphorwood. Whistling they ride the divine clarity, grasping the tally to restrain the heavenly demons. The Five Elders summon the Northern Emperor, gathering and seizing the households of ghosts and spirits. The Crimson Deng obscure the celestial perfected, blocking the myriad immortals’ passes. The Golden Mystery and Grotto-Jade Wisdom, the Feathered Chapter extinguishes the chants and songs. The incantation commands and binds the demonic hosts, receiving the task to dispel demons. Escorting the transcendent back to the imperial seat, they drift upon these dark ford waves. Resplendent and bright, the treasure of the Great Radiance, the perfected ones mutually unfold their blossoms. The Five Numinous convey the talismanic registers, prolonging and securing the stem of destiny. Preserving my ten-thousand-kalpa merit—who can fathom the celestial records’ abundance? The seven ancestors ascend to be born in heaven, liberated and delivered from the Dark Net. The Grotto-Clear extinguishes the transcendent trials; the body soars to ascend the Dark Capital.\n\n*The Jade Clarity Primordial Void Emperor Great Empyrean Lord Ju Wei Ye Qu Chu Mo Heavenly Central Dispelling-Demons Wisdom Incantation Hidden Writ of the Golden Mystery Feathered Chapter*\n\nResplendent they illumine the Great Empyrean, riding the void in return. Golden efflorescence dawns in the morning, dragon radiance soars through the empty sky. Jade transcendent attend in escort, the Five Elders support the banners. The Great Yang opens the ford, the Seven Origins shine forth in splendor. The Five Emperors unite in perfection, the Three Radiance linger in circuit. Feasting in the cloud chambers, ascending to open the vermilion mechanism. They summon the Eight Heavens, gathering and governing the Four Extremities. Myriad numina gird their sashes, receiving tasks in the Great Tenuity. Bearing heaven and breaking their foreheads, seizing the interval to unleash their might. Chants and songs fly through the void, testing and confounding my heart. They inscribe the name of the Northern Emperor, sealing and shearing without remainder. Divine perfected emerge in excursion, heaven and earth collapse and topple. The demonic hosts submit in surrender, the transcendent all take flight. The profound script is completed in curves, shining together with me. The Primordial Father and Dark Mother, the myriad spirits all return. They stride beyond the Jade Radiance, the body ascends the golden ladder. Drawing forth from the Three Paths, the Seven Mysteries scatter and unfold. Preserving transcendence in the Great Empyrean, blessings and felicity towering and majestic.\n\n*The Jade Clarity Seven Observances Non-Birth Void Emperor Golden Numinous Lord Chong Rong Yu Yu Di Sha Heavenly Central Dispelling-Demons Wisdom Incantation Hidden Writ of the Golden Mystery Feathered Chapter*\n\nThe Impalpable Void illumines the morning lamp, blazing and gleaming in the vast hall. Treasure clouds fan the Nine Peaks, the Jade Chamber where the Void Emperor sits. The Purple Guests display the Dark Registers, the returning wind cradles the Dao in health. The golden talismans summon the Crossing Ministers, the numinous banners seize the Demon Kings. The vessels and seals extinguish the myriad trials, uniting with the transcendent to perfect my merit. Within the radiant treasure of destiny, life is born; the moving pearl guards the highest offices. The numinous irrigation of the Seven Passes’ palaces, returning the aged to transform into infants. Drawing forth from the Earth Gate’s difficulties, preserving this sun and moon’s light. The seven ancestors depart the dark night, receiving blessings in the Southern Culmen’s chambers. The golden talismans enter the Dark Chamber, the body soars to ascend the Impalpable Void.\n\n*The Jade Clarity Eight Observances High Origin Void Emperor Tranquil Radiance Lord Shan Yuan Cha Bao Lun Fa Heavenly Central Dispelling-Demons Wisdom Incantation Hidden Writ of the Golden Mystery Feathered Chapter*\n\nThe Tranquil Radiance Wheel of Dharma Heaven, the Eight Observances illumine the Jade Clarity. Flying blossoms fall and scatter their radiance, returning fragrance flows through the golden court. The rainbow’s glow illumines the Dark Terrace, the Three Emperors unite to open the dawn. Whistling and shrilling they attend the Golden Gate, preserving these kalpas of accumulated lives. The Northern Origin hastens the celestial revolutions, wielding the banner to summon the Five Numinous. They forbid and seal the Northern Feng Palace, feasting and commanding the cloud encampments. The Highest observes the Eight Wastes—from where do the chants and songs arise? Flourishing and nurturing, they drum the vast Dao, proclaiming titles to sprinkle the Eight Darks. The feathered writ seizes the demonic hosts, the Golden Mystery binds the myriad essences. The Demon Kings all receive their tasks, extinguishing trials and dissolving the demonic scriptures. The Dark Mandate responds to the talismanic assembly, the Five Emperors command and it is already pure. The Duke’s Son holds the Five Talismans, the Great One secures my form. The Three Origins display the registers, inscribing the book upon the Eastern Florescence’s jade. The Seven Mysteries all ascend in flight, rejoicing together in the Eight Observances’ court.\n\nThe Dispelling-Demons Wisdom Incantation’s Golden Mystery Hidden Writ is all knotted from the soaring dark’s spontaneous qi to complete its chapters, resplendent above the Eight Heavens, flourishing within the Jade Clarity. It controls demons and establishes the perfected, extinguishes trials and summons the transcendent. The golden tones drift and ring in the Purple Void, the jade wisdom vibrates and resounds in the Radiance Court.\n\nThus the Highest Floating Wheel is employed to rigorously test, the Void Emperor wields the reins to observe the perfected. Assisting the Jade Transcendent in attendance, commanding the Five Elders to restrain the numinous. Above they display the profound and wondrous noble practices, below they exalt the towering and majestic beyond description. Blessings and felicity fill the dark leaves, layered shade flows through the seed bodies. Decayed bones receive its dark reliance, receiving rebirth as embryo transcendent. Lofty and difficult to name, numinous and difficult to proclaim—thus the supreme sages established the chapters, calling them Hidden Writ.\n\nThe Eight Heavens’ Void Emperor Lord received it from the Nine Empyreans, transmitting it to the Jade Clarity Jade Emperor Lord Dispelling-Demons Great King. The Great King transmitted it to the Five Emperors’ Highest Perfected Lords, who transmitted it to the Highest Jade Emperor Lord. The Highest Jade Emperor Lord transmitted it to the Supreme Emperor, the Supreme Emperor transmitted it to the Supreme Lord of the Great Dao. The Supreme Lord of the Great Dao transmitted it to the Great Tenuity Heaven Emperor Lord, the Great Tenuity Heaven Emperor Lord transmitted it to the Later Sage Nine Mysteries Golden Watchtower Emperor Lord, who transmitted it to the High Minister Azure Youth Lord.",
      "overlap_context": " guests. Soaring to ascend the Azure Empyrean Court, drifting and chanting into the threefold convenience. Severing the roots of the five sufferings, returning the embryo to birth the Seven Mysteries. Decayed bones all ascend in flight, entering together the mist of emptiness.\n\n*The Jade Clarity Sevenfold Stillness Guiding Life Hidden Writ of the Golden Numinous Feathered Chapter of the Highest Lord of the Void Emperor Jiama Tanlou Yu in the Heavenly Central Dispelling-Demons Wisdom Incantation*",
      "start_char": 5196,
      "end_char": 6441,
      "start_sentence": 102,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.25501203536987,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "皆真真相承，集为灵文，依科皆七千年听传合仙之人，自无金名帝图，录字上清，不得妄宣。 轻泄此道，殃及七祖，己身亡命，明慎而奉焉。 若有简名紫台，应得此文，当以信立心，交赍上金八两，丹锦八十尺，紫纹六十尺，师与对斋八十日，或二十七日，告盟而传。 无盟而轻泄，则愆天信，罪延七祖，殃钟后嗣，世世盲聋，身不得仙。 修行此道，每至八节之日，当随节各诵一遍。 又以本命、甲子、太岁之日，及当登斋行道，诵经三十九章、雌一五老宝经，玄母八门行间十二上愿，悉当并诵八天智慧咒一遍。 若游行名山，或之方面，求神仙之道，当随方诵一遍，然后行事。 如此万试自灭，魔王敬护，所向皆合，所作克成，真人降形，致自然灵药，身映玉光，神仙内唱，飞行上清。 玉清郁悦那林昌玉台天九晖太晨隐书金玄内文 文始先生所佩，以传郁绝真人。 凡修神仙之道，当以白书青板上，置东方，以灭东方青帝大魔王官属，招致东方仙官。 行之九年，则青真上圣皇上丈人降形於兆身，役使仙官，取自然灵药。 又以白书青缯佩身，行来东方，则致安大堂乡纳善之世界大魔王，束带稽首礼迎，仙官侍卫。 入东岳，则致青云羽盖。 九年飞行上清宫。 无此文，不得妄行东方青帝之道，轻召青帝仙官，则为大魔所伤，失真被殃，终不成仙。 玉清高桃厉冲龙罗观灵元晨隐书金玄内文 九老仙都所佩，以传广灵丈人。 行神仙之道，当以赤书白板上，置西方，以灭西方白帝大魔王官属，招致西方仙官。 行之十二年，则白景素灵七圣金灵君降形於兆身，役使仙官，取自然灵药。 又以朱书白缯佩身，行来西方福堂州盛行之世界，大魔王束带稽首礼迎，仙官侍卫。 入西岳，则致素云羽盖。 十二年飞行玉清宫。 无文则不得妄行西方白帝之道，及入西岳轻召白帝仙官，则为大魔王所伤，失真被殃，终不成仙也。 玉清碧落空歌余梨天总晨九极隐书金玄内文 玉清高上元君所佩，以传南极上元君。 行神仙之道，当以黑书丹板上，置南方，以灭南方赤帝大魔王官属，招致南方仙官。 行之一十八年，则洞阳丹灵上真景君降形於兆身，役使仙官，取自然灵药。 又以黑书绛文佩身，行之南方宛梨城境弃贤之世界，则大魔王束带稽首礼迎，仙官侍卫。 入南岳，则得南极宝书，致丹云羽盖。 一十八年，飞行玉清宫。 无此文，不得妄行南方赤帝之道，及入南岳轻召赤帝仙官，则为大魔所伤，失真被殃，终不得成仙也。 玉清迦摩坦娄于翳天杳曜旋根隐书金玄内文 九天真王所受，以传太上道君。 行神仙之道，当以黄书黑板上，置北方，以灭北方大魔王官属，招致北方仙官。 十五年，则致北极玄上玉真君授兆高上宝书，役使仙官十五人。 又以黄书皂文佩身，行之北方#1郁亶之野清静世界，则万灵束带，魔王稽首礼迎，仙官侍卫。 入北岳，则致玄云羽盖，飞行玉清宫。 无此文，不得行北方黑帝之道，及入北岳轻召仙官，则为大魔所伤，被殃失仙。 玉清扶刀盖华浮罗天玄景晨平隐书金玄内文 太素三元君受之於元始天王，以传太和玉女。 行神仙之道，当以紫华书黄板上。 置西北方，以灭浩帝大魔王官属，招致西北福德之野延贤世界仙官。",
      "translated_text": "These true transmissions, passed from one perfected being to another, are compiled as numinous writs. According to the statutes, only those who have listened for seven thousand years and are destined to attain transcendence may receive them. Without one’s name recorded in the Imperial Register of the Golden List and inscribed in the Upper Clarity, they must not be rashly proclaimed. To lightly divulge this Dao brings calamity upon seven generations of ancestors, and one’s own life is forfeit—be clear and cautious in upholding it.\n\nShould one’s name appear on the Purple Terrace and be deemed worthy of this text, one must establish sincerity in the heart, present as offerings eight taels of gold, eighty bolts of cinnabar brocade, and sixty bolts of purple silk. The master shall perform an eighty-day retreat in response, or twenty-seven days, and transmit the text only after the covenant is sworn. To transmit without covenant and lightly divulge it is to break faith with Heaven, bringing guilt upon seven generations of ancestors, calamity upon descendants, and blindness and deafness to oneself for life, so that one never attains transcendence.\n\nIn cultivating this Dao, on each of the eight solar terms, one must recite one chapter according to the term. Furthermore, on one’s own life-day, the first day of the sexagenary cycle, the day of the Great Year Star, and whenever one undertakes a retreat to practice the Dao, one must recite the thirty-nine chapters of the scripture, the *Feminine One’s Five Elders’ Treasure Scripture*, the *Mysterious Mother’s Eight Gates and Twelve Supreme Vows*, and all together recite the *Eight Heavens’ Wisdom Mantra* once. When traveling to famous mountains or journeying to the four quarters in search of the Dao of transcendence, one must recite one chapter according to the direction before proceeding. Practiced thus, all trials vanish of themselves, demon kings show reverence and protection, all endeavors succeed, and all undertakings are accomplished. True persons manifest in bodily form, bringing forth natural numinous medicines; the body shines with jade radiance, and the inner chant of transcendence resounds, enabling flight to the Upper Clarity.\n\n**Jade Clarity’s Fragrant Grove Prosperous Forest Flourishing Jade Terrace Heaven’s Nine Radiance Great Dawn Hidden Writ: Golden Mystery Inner Text**\nWorn by the Primordial Master, transmitted to the Utterly Transcendent Perfected.\n\nFor those cultivating the Dao of transcendence, inscribe it in white on a green tablet and place it in the East to extinguish the great demon kings and their retinues of the Eastern Azure Emperor and summon the transcendent officials of the East. Practicing thus for nine years, the Azure Perfected, Supreme Sage, and August Elder of the Upper Heights manifest in bodily form, dispatching transcendent officials to procure natural numinous medicines. Also, inscribe it in white on green silk and wear it on the body when traveling in the East to reach the Great Hall of Peace in the World of Accepting Goodness, where demon kings gird their robes, bow their heads in reverence, and welcome one, while transcendent officials stand in attendance. Entering the Eastern Marchmount, one obtains an azure cloud feather canopy. After nine years, one flies to the Jade Clarity Palace. Without this text, one must not rashly practice the Dao of the Eastern Azure Emperor or lightly summon the transcendent officials of the Azure Emperor, lest one be harmed by great demons, lose one’s authenticity, incur calamity, and never attain transcendence.\n\n**Jade Clarity’s Lofty Peach Tower Soaring Dragon Net Observing Numinous Origin Dawn Hidden Writ: Golden Mystery Inner Text**\nWorn by the Nine Elders of the Transcendent Capital, transmitted to the Vast Numinous Elder.\n\nFor those cultivating the Dao of transcendence, inscribe it in red on a white tablet and place it in the West to extinguish the great demon kings and their retinues of the Western White Emperor and summon the transcendent officials of the West. Practicing thus for twelve years, the White Radiance, Plain Numinous, Seven Sages, and Golden Numinous Lords manifest in bodily form, dispatching transcendent officials to procure natural numinous medicines. Also, inscribe it in vermilion on white silk and wear it on the body when traveling to the World of Prosperity in the Western Fortune Hall Prefecture, where demon kings gird their robes, bow their heads in reverence, and welcome one, while transcendent officials stand in attendance. Entering the Western Marchmount, one obtains a plain cloud feather canopy. After twelve years, one flies to the Jade Clarity Palace. Without this text, one must not rashly practice the Dao of the Western White Emperor or enter the Western Marchmount and lightly summon the transcendent officials of the White Emperor, lest one be harmed by great demon kings, lose one’s authenticity, incur calamity, and never attain transcendence.\n\n**Jade Clarity’s Azure Empyrean Empty Song Remnant Pear Heaven’s Total Dawn Nine Poles Hidden Writ: Golden Mystery Inner Text**\nWorn by the Jade Clarity’s Supreme Primordial Lord, transmitted to the Southern Culmen Supreme Primordial Lord.\n\nFor those cultivating the Dao of transcendence, inscribe it in black on a cinnabar tablet and place it in the South to extinguish the great demon kings and their retinues of the Southern Vermilion Emperor and summon the transcendent officials of the South. Practicing thus for eighteen years, the Cavern Yang Cinnabar Numinous Supreme Perfected Radiance Lord manifests in bodily form, dispatching transcendent officials to procure natural numinous medicines. Also, inscribe it in black on crimson silk and wear it on the body when traveling to the World of Abandoning Worthies in the Southern Wanli City Prefecture, where demon kings gird their robes, bow their heads in reverence, and welcome one, while transcendent officials stand in attendance. Entering the Southern Marchmount, one obtains the Southern Culmen’s Treasure Scripture and a cinnabar cloud feather canopy. After eighteen years, one flies to the Jade Clarity Palace. Without this text, one must not rashly practice the Dao of the Southern Vermilion Emperor or enter the Southern Marchmount and lightly summon the transcendent officials of the Vermilion Emperor, lest one be harmed by great demons, lose one’s authenticity, incur calamity, and never attain transcendence.\n\n**Jade Clarity’s Kapila’s Tower Dragon Concealing Heaven’s Obscure Radiance Revolving Root Hidden Writ: Golden Mystery Inner Text**\nReceived by the Nine Heavens’ True Kings, transmitted to the Supreme Lord of the Dao.\n\nFor those cultivating the Dao of transcendence, inscribe it in yellow on a black tablet and place it in the North to extinguish the great demon kings and their retinues of the Northern Emperor and summon the transcendent officials of the North. After fifteen years, the Northern Culmen’s Mysterious Supreme Jade Perfected Lord bestows the Supreme Treasure Scripture and dispatches fifteen transcendent officials. Also, inscribe it in yellow on black silk and wear it on the body when traveling to the World of Serenity in the Northern Yudan Wilds, where myriad numina gird their robes, demon kings bow their heads in reverence and welcome one, while transcendent officials stand in attendance. Entering the Northern Marchmount, one obtains a mysterious cloud feather canopy and flies to the Jade Clarity Palace. Without this text, one must not practice the Dao of the Northern Black Emperor or enter the Northern Marchmount and lightly summon transcendent officials, lest one be harmed by great demons, incur calamity, and lose transcendence.\n\n**Jade Clarity’s Supporting Blade Canopy Floating Flower Net Heaven’s Mysterious Radiance Dawn Level Hidden Writ: Golden Mystery Inner Text**\nReceived by the Three Primordials of the Grand Simplicity from the Primordial Heavenly King, transmitted to the Jade Maiden of Great Harmony.\n\nFor those cultivating the Dao of transcendence, inscribe it in purple splendor on a yellow tablet and place it in the Northwest to extinguish the great demon kings and their retinues of the Vast Emperor and summon the transcendent officials of the Northwest’s World of Extending Worthies in the Wilds of Fortune and Virtue.",
      "overlap_context": "ive Emperors’ Highest Perfected Lords, who transmitted it to the Highest Jade Emperor Lord. The Highest Jade Emperor Lord transmitted it to the Supreme Emperor, the Supreme Emperor transmitted it to the Supreme Lord of the Great Dao. The Supreme Lord of the Great Dao transmitted it to the Great Tenuity Heaven Emperor Lord, the Great Tenuity Heaven Emperor Lord transmitted it to the Later Sage Nine Mysteries Golden Watchtower Emperor Lord, who transmitted it to the High Minister Azure Youth Lord.",
      "start_char": 6441,
      "end_char": 7674,
      "start_sentence": 114,
      "end_sentence": 156,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.21855926513672,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "十二年，则致上官玉女降兆寝房，授兆神真之道。 又紫笔黄纹上佩身，行之西北延贤世界，则万灵束带，魔王稽首礼迎，得乘飞云羽盖，游行玉清宫。 无此文，不得轻行神仙之道，呼召仙官，则为大魔所伤，身没失仙。 玉清具渭耶渠初默天合晖晨命隐书金玄内文 扶桑大帝受之於太霄真王，以传太微天帝君。 当以黄笔书苍板上，置东南方，以灭昊帝大魔王官属，招致东南方福田用贤世界昊帝仙官。 十五年，则致玉女二十四人，给兆驱使，取自然灵药飞行之丸。 又以黄书绿纹上佩身，行之用贤世界，则万灵束带，魔王稽首礼迎，得乘绿云羽盖，飞行玉清宫。 无此文，不得轻行神仙之道，呼召仙官，则为大魔所伤，身被大殃，不得仙也。 玉清冲容育郁离沙天齐晖晨玄隐书金玄内文 西王母受之於北极皇上先生，以传赤精上真君。 当以青书紫板上，置东北方，以灭苍帝大魔王官属，招致东北方福集都长安世界苍帝仙官，十年则致仙童十八人，给兆驱使，取自然灵药，高上飞玄羽章。 又以青书生紫纹上佩身，行之东北长安世界，则万灵束带，魔王稽首礼迎，得乘紫云羽盖，飞行玉清宫。 无此文，不得轻行神仙之道，呼召仙官，则为大魔所伤，身被大殃，不得仙也。 玉清单缘察宝轮法天高上龙烟隐书金玄内文 后圣九玄金阙帝君受之於高元虚皇停景君，以传上相青童君。 当以黄书绿板上，置西南方，以灭黄帝大魔王官属，招致西南方延福乡仁静之世界黄帝仙官，九年则八帝侍真玉仙降形於兆身，授兆飞仙灵药，七十四变光炼化兆身也。 又以黄书绿纹之上佩身，行之西南延福乡仁静世界，则万灵束带，魔王稽首礼迎，三元降下飞舆琼轮，迎兆登三元之房也。 无此文，不得轻行神仙之道，呼召仙官，则为大魔所伤，灭身失仙也。 玉清八天中隐书金玄内文，生於元始之先，结飞玄之气以成於玉文，即玉清天中之书也。 字方一丈，焕明太空，制魔灭精，召神摄灵。 故上圣相承，受之以威神。 此文隐藏，不传於世，自无金名兰台，玉字紫房，不得见闻。 得有其篇，高上给以玉童十二人，玉女八人，侍真典经，防卫有文者身，纠於漏慢。 轻泄则七祖受责於地狱，己身被考於三官。 钟山虚无子受之於黄老君，佩身九年，内外映彻，隐文自明，罗列一形之中，光曜九府，照明十方，身所佩本文飞入八天。 至开光元年正月一日，於钟山脱身，隐文以传郁灵真人鲍世玄。 世玄即秦穆公侍郎，今受号为郁绝真人，治在九疑山洞室之中。 后圣九玄金阙帝君，下为周师，改号为老子，以八天隐文授於幽王。 幽王自谓居自然之运，代五帝之气，错阴阳之化，不崇天文。 老子知周文衰，收文而去周西度，制作教化，遇关令尹喜，喜心结紫络，面有圆明，项带承天，背负七元，金名表於玄图，丹札系於紫房，气参太微，触形合真，即为述道德经上下二章。 於绿那之国，老子张口，於是隐文从口而出，以授於喜。 喜依盟奉受，即致八景云舆，洞游八方，竦身於虚无之内，项生宝明之光，七十二相，映照一形，随运变化，升入八天。 其道高妙，非可载称。 凡以后学，不得此文，便当绝思於遐望，无烦损神於幽山也。 上相青童君以此文传西城王君，位登四极真人，今封一通於西城山中。",
      "translated_text": "After twelve years, the jade maidens of the Upper Offices will descend to your bedchamber, bestowing upon you the Dao of spirit-perfection. Further, inscribe it in purple upon yellow silk and wear it upon your person. When you journey to the Northwest’s World of Extending Worthies, the myriad spirits will gird themselves in attendance, and the demon kings will bow their heads in reverence, allowing you to ascend upon a canopy of flying clouds and roam the Jade Clarity Palace. Without this writ, you may not lightly practice the Dao of transcendence or summon transcendent officials, lest you be harmed by great demons, your body perish, and transcendence be lost.\n\n**Jade Clarity’s Concealed Writ of the Golden Mystery: Possessing the Radiance of the Celestial Confluence’s Dawn Command**\nReceived by the Fusang Great Emperor from the Supreme Empyrean Perfected King, transmitted to the Celestial Emperor of the Grand Tenuity.\n\nInscribe it in yellow upon a green tablet and place it in the Southeast to extinguish the great demon kings and their retinues of the Vast Emperor, and to summon the transcendent officials of the Southeast’s World of Cultivated Worthies in the Fields of Fortune. After fifteen years, twenty-four jade maidens will attend you, fetching natural numinous medicines and flying elixir pellets. Further, inscribe it in yellow upon green silk and wear it upon your person. When you journey to the World of Cultivated Worthies, the myriad spirits will gird themselves in attendance, and the demon kings will bow their heads in reverence, allowing you to ascend upon a canopy of verdant clouds and fly to the Jade Clarity Palace. Without this writ, you may not lightly practice the Dao of transcendence or summon transcendent officials, lest you be harmed by great demons, your body incur great calamity, and transcendence be lost.\n\n**Jade Clarity’s Concealed Writ of the Golden Mystery: The Flourishing Dawn of the Celestial Equilibrium’s Mysterious Radiance**\nReceived by the Queen Mother of the West from the Supreme Master of the Northern Culmen, transmitted to the Supreme Perfected of the Vermilion Essence.\n\nInscribe it in blue upon a purple tablet and place it in the Northeast to extinguish the great demon kings and their retinues of the Azure Emperor, and to summon the transcendent officials of the Northeast’s World of Assembled Fortune in the Everlasting Peace of Chang’an. After ten years, eighteen transcendent youths will attend you, fetching natural numinous medicines and the supreme flying mystery feathered regalia. Further, inscribe it in blue upon living purple silk and wear it upon your person. When you journey to the Northeast’s World of Everlasting Peace, the myriad spirits will gird themselves in attendance, and the demon kings will bow their heads in reverence, allowing you to ascend upon a canopy of purple clouds and fly to the Jade Clarity Palace. Without this writ, you may not lightly practice the Dao of transcendence or summon transcendent officials, lest you be harmed by great demons, your body incur great calamity, and transcendence be lost.\n\n**Jade Clarity’s Concealed Writ of the Golden Mystery: The Wheel of the Dharma’s High Celestial Dragon Mist**\nReceived by the Ninefold Mystery Golden Portal Emperor of the Later Sages from the High Origin’s Void Sovereign of Suspended Radiance, transmitted to the Grand Minister Supreme Youth.\n\nInscribe it in yellow upon a green tablet and place it in the Southwest to extinguish the great demon kings and their retinues of the Yellow Emperor, and to summon the transcendent officials of the Southwest’s World of Extending Fortune in the Village of Benevolent Stillness. After nine years, the Eight Emperors’ attendant perfected jade transcendent beings will manifest in your form, bestowing upon you the transcendent medicines of flying immortality and the seventy-four transformations of radiant refinement to transmute your body. Further, inscribe it in yellow upon green silk and wear it upon your person. When you journey to the Southwest’s World of Extending Fortune in the Village of Benevolent Stillness, the myriad spirits will gird themselves in attendance, and the demon kings will bow their heads in reverence. The Three Primordials will descend with flying chariots of jade wheels to welcome you into the chambers of the Three Primordials. Without this writ, you may not lightly practice the Dao of transcendence or summon transcendent officials, lest you be harmed by great demons, your body perish, and transcendence be lost.\n\n**Jade Clarity’s Concealed Writ of the Golden Mystery: The Central Hidden Writ of the Eight Heavens**\nBorn before the Primordial Beginning, congealed from the qi of the flying mystery to form the jade writ—this is the writ of the Jade Clarity Heaven. Each character spans a zhang, resplendent in the vast firmament, subduing demons and extinguishing spirits, summoning gods and seizing numina. Thus, the supreme sages transmit it to one another, receiving it to wield numinous might. This writ is concealed and not transmitted to the world; without a golden name in the Orchid Terrace or jade characters in the Purple Chamber, one may neither see nor hear of it. Should one obtain this scripture, the exalted will assign twelve jade youths and eight jade maidens to attend the perfected, safeguarding the text’s bearer and correcting lapses of negligence. To lightly divulge it is to consign one’s seven ancestors to punishment in the earth prisons and to subject one’s own body to the Three Offices’ interrogation.\n\nThe Master of the Void of Mount Bell received it from the Yellow Venerable Lord. After wearing it for nine years, his inner and outer being became luminously transparent, the concealed writ manifesting of itself. It arrayed within his form, its radiance illuminating the nine palaces, shining upon the ten directions. The original writ he wore flew into the Eight Heavens. In the first year of the Kai-Guang era, on the first day of the first month, he shed his body at Mount Bell, and the concealed writ was transmitted to the Perfected of Profound Spirit, Bao Shixuan. Shixuan was once the attendant of Duke Mu of Qin and is now titled the Perfected of Profound Absoluteness, dwelling in the grotto chambers of Mount Jiuyi.\n\nThe Ninefold Mystery Golden Portal Emperor of the Later Sages descended to become the teacher of the Zhou, changing his title to Laozi. He transmitted the Concealed Writ of the Eight Heavens to King You. King You, deeming himself to dwell in the course of natural destiny, to succeed the qi of the Five Emperors, and to regulate the transformations of yin and yang, did not revere the celestial writ. Laozi, knowing the decline of the Zhou’s culture, retrieved the writ and departed, crossing west of the Zhou. There, he established teachings and transformations, encountering the Pass Prefect Yin Xi. Xi’s heart was bound by purple cords, his face bore a circular luminance, his neck bore the Mandate of Heaven, his back carried the Seven Primordials, his golden name was inscribed upon the Mystery Chart, and his cinnabar tally was tied to the Purple Chamber. His qi aligned with the Grand Tenuity, and his form merged with the perfected. Thus, he expounded the *Scripture of the Dao and Its Virtue* in two chapters.\n\nIn the land of Lǜnà, Laozi opened his mouth, and the concealed writ emerged from it to be transmitted to Xi. Xi, adhering to the covenant, received it and thereby summoned the cloud chariot of the Eight Effulgences, roaming freely through the eight directions. He ascended into the void, his neck radiating the light of precious luminosity, his seventy-two marks illuminating his form. Following the course of transformation, he ascended into the Eight Heavens. His Dao is lofty and wondrous, beyond all description.\n\nFor all later learners who do not obtain this writ, it is fitting to cease yearning for distant visions and to spare their spirit the weariness of secluded mountains.\n\nThe Grand Minister Supreme Youth transmitted this writ to the Perfected King of the Western City, who ascended to the rank of Perfected of the Four Culmens. Now, one copy is sealed within the Western City Mountain.",
      "overlap_context": "Writ: Golden Mystery Inner Text**\nReceived by the Three Primordials of the Grand Simplicity from the Primordial Heavenly King, transmitted to the Jade Maiden of Great Harmony.\n\nFor those cultivating the Dao of transcendence, inscribe it in purple splendor on a yellow tablet and place it in the Northwest to extinguish the great demon kings and their retinues of the Vast Emperor and summon the transcendent officials of the Northwest’s World of Extending Worthies in the Wilds of Fortune and Virtue.",
      "start_char": 7674,
      "end_char": 8922,
      "start_sentence": 157,
      "end_sentence": 192,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.87127757072449,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "若有金名紫字，当以庚子、壬寅、庚午、戊午之岁，四月八日、七月七日、十月一日，於八天之世界精思苦念，当得此文。 上清高上金元羽章玉清隐书经竟 金玄羽章玉清隐书，藏经有两部，文并同，符则各异，故附篆于后。 九晖太晨隐书金玄内文 观灵元晨隐书金玄内文 总晨九极隐书金玄内文 沓曜旋根隐书金玄内文 玄景晨平隐书金玄内文 合晖晨命隐书金玄内文 齐晖晨玄隐书金玄内文 高上龙烟隐书金玄内文 #1『北方』，原本误作『郁方』。",
      "translated_text": "Should one possess a name inscribed in gold and characters writ in purple, then in the years of gengzi, renyin, gengwu, or wuyu, on the eighth day of the fourth month, the seventh day of the seventh month, or the first day of the tenth month, within the world of the Eight Heavens, one must meditate with utmost sincerity and ardent devotion—only then may this writ be obtained.\n\n*The Scripture of the Jade Concealment of the Golden Primordial Feathered Chapters of Highest Clarity* concludes here.\n\nThe *Golden Primordial Feathered Chapters of the Jade Concealment of the Mysterious Clarity* comprises two scrolls, their texts identical but their talismans distinct; thus, the sigils are appended below.\n\nThe Concealed Writ of the Nine Radiant Great Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Primordial Dawn of the Observing Spirit of the Golden Primordial Inner Text\nThe Concealed Writ of the Nine Culmens of the Grand Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Revolving Root of the Multitudinous Luminaries of the Golden Primordial Inner Text\nThe Concealed Writ of the Mysterious Effulgence of the Level Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Conjoined Radiance of the Mandate of Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Harmonized Radiance of the Mysterious Dawn of the Golden Primordial Inner Text\nThe Concealed Writ of the Lofty Dragon Mist of the Golden Primordial Inner Text\n\n#1 \"Northern Direction\" (the original text erroneously reads \"Yufang\")",
      "overlap_context": "course of transformation, he ascended into the Eight Heavens. His Dao is lofty and wondrous, beyond all description.\n\nFor all later learners who do not obtain this writ, it is fitting to cease yearning for distant visions and to spare their spirit the weariness of secluded mountains.\n\nThe Grand Minister Supreme Youth transmitted this writ to the Perfected King of the Western City, who ascended to the rank of Perfected of the Four Culmens. Now, one copy is sealed within the Western City Mountain.",
      "start_char": 8922,
      "end_char": 9150,
      "start_sentence": 193,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.460766553878784,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上金元羽章玉清隐书经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}