{
  "source_id": "上清神宝洞房真讳上经",
  "source_file": "chunked_daozang\\上清神宝洞房真讳上经.json",
  "total_chunks": 3,
  "total_original_chars": 2539,
  "total_translated_chars": 15849,
  "total_translation_time": 86.23445057868958,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\上清神宝洞房真讳上经.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Supreme Clarity Scripture of the Divine Treasure and the True Taboo Names of the Grotto Chamber**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Divine Treasure and the True Taboo Names of the Grotto Chamber*. Also known as *The Arrayed Records of the Azure Lad*.\n\nAuthor unknown, approximately composed during the late Eastern Jin dynasty. Attributed to the Golden Portal Emperor Lord, who revealed it to the Azure Lad, who in turn transmitted it to Lady Wei and Xu Yuanyou. It expounds upon the preservation of the Three Perfected Ones within the Grotto Chamber of the body and the essential secrets of the various spirits. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Orthodox Tradition*, *Great Mystery Section*.\n\n---\n\n**The Supreme Clarity Scripture of the Divine Treasure and the True Taboo Names of the Grotto Chamber**\n\nThis scripture is also named *The Arrayed Records of the Dao Lord Azure Lad* and *The Jade Scripture of the Grand Protector*. Cultivated by divine immortals, it is the perfection of Supreme Clarity.\n\nIn former times, Lady Wei Huacun transmitted it to Lord Xu Yuanyou, who dwelled in the Western City’s Rampart Terrace. There, he swore an oath with the Purple Radiance and the Tenfold Flowered Jade of Medicinal Essence, cutting the brocade of starry clouds and the soaring phoenix of treasured auroras to proclaim it to Supreme Clarity. After a hundred years, it was passed to the perfected ones, its texts never exposed to the common folk, so that the heavens of true illumination might be revealed.\n\nThe Jade Protector King Azure transmitted it to the Dao Lord, whose taboo name was Longguangxuan and whose style was Youwu. Born of the primordial qi of Wood Perfection in the Eastern Jade Na Country, upon the Mountain of Mystic Pendants, his jade-like form was embraced by verdant splendor, his flowing pearls flanked by guardians. After nine thousand circuits, fragrant blossoms of jasper unfolded, the roots of medicinal herbs gleamed, and his nine-foot jade countenance surveyed the ten directions. Heavenly maidens bore his robes, the Jade Emperor bowed in reverence, and his chanting voice rang clear, startling the forests and valleys.\n\nThe Heavenly Treasure Divine Immortal King bestowed upon the Azure Prime Perfected One a secret register of one hundred fifty-five texts, their true titles complete and exhaustive. Transforming the gates of the myriad destinies, he inaugurated the kalpa of Brahma, declaring the root of the Dao’s unfolding:\n\nThe utmost Dao is the Grotto of Emptiness.\nThe root of transformation is awakened intent.\nHeaven and Earth do not speak, yet they manifest signs.\nThe ten thousand things and all species bear their forms.\nThunder, wind, clouds, and qi move by resonance.\nThus it is because awakened intent is attained—all things are transformed through the Grotto of Emptiness.\nTransformation is constancy.\nChange is name.\nThe myriad images of Heaven and Earth all arise from the Grotto of Emptiness, yet the Grotto of Emptiness has no being.\nThe images of transformation and awakened intent all emerge from the Grotto Chamber.\nThe Grotto Chamber is being within non-being.\nThe Grotto of Emptiness is non-being within being.\nThe chamber exists, yet things do not depend on man.\nHeaven’s craft surpasses man’s, for its intent is not perceived yet is attained.\nMan attains it through intent.\nAttainment is taking.\nHeaven manifests intent to man, bestowing it.\nWhen what is bestowed aligns, then virtue and primordial qi merge as one, and there is nothing that cannot be done, nothing that cannot be seen.\nLife and death, coming and going, the waxing and waning of the myriad kinds—all reside within awakened intent.\nHeaven and Earth are our father and mother, and there is nothing in which they differ.\nBeginning and end, being and non-being—none lie beyond this.\nActing and responding in accord, the subtle is revealed.\nThe subtle is the true taboo names of the Divine Treasure of the Supreme Clarity Grotto Chamber.\nThe true is the truth of this.\nThe taboo is the reverence for this.\nOne who attains this becomes a Most High Immortal.\n\nThe Jade Protector Dao Lord, at that time, emanated a radiance of jasper light, boundless and inexhaustible. His head bore a towering crown, his form adorned with pearls and treasures, draped in the hues of auroral clouds. Heaven and Earth proclaimed auspicious omens, and cinnabar mushrooms displayed their fragrance. Having perfected the true Dao, he withdrew to his retreat and addressed the perfected ones of later sagacity after the Golden Portal Emperor Lord:\n\n“Great indeed! Profound and ultimate! By generating and broadly bestowing, nurturing the source of transformation, this is called the Jade Treasure. The infant guards the feminine, its profound blessings unseen—thus it is named the Azure Lad.”\n\nThe Golden Portal Emperor Lord addressed the Azure Lad:\n\n“Your body possesses jade bones, your heart the Nine Sovereigns. The windows of the sun ascend and descend, the purple will rests beneath your cheeks, your azure eyes shine deeply. Naturally, you are fit to ascend as a high perfected one. The secret taboos of the utmost Dao are now revealed to you. As your form dwells in celestial harmony, you must also refine and cool it, so that being and non-being merge in transformation, ascending to the Mystic Palace.”\n\nThe Azure Lad Dao Lord withdrew to the fragrant grove of his retreat, pacing with his elbows and entreating further instruction. The Lord then declared:\n\n“You must dwell in seclusion, close your eyes and practice seeing as though they were open. Whether your eyes are open or closed, do not abandon seeing in order to see. After a hundred days of this, at night your vision will penetrate with light. You must then gather the light of Heaven within the Mystic Mirror, contemplating the crystal water within your body. Then, gaze upward at the true extremity below, where the Three Perfected Ones of the Grotto Chamber reside within a square inch.\n\nAfter a hundred days of this, you will hear a sound like the thunder of Heaven, and within that square inch, a space of a square *zhang* will appear. After a hundred and eighty days, it will be like a great hall. After three hundred days, like a palace. After a thousand days, it will equal Heaven and Earth. Without thought, you will think; without reflection, you will reflect; without awareness, you will be aware; without intent, you will intend. Only through the communion of essence will the myriad images be complete. All that was attained through awakened intent will reside within.\n\nThe divine Dao will manifest of itself, dimly yet brilliantly, and you will be far removed from the world. Within the Grotto Chamber, you will witness your own endless transformations, boundless and without limit. Should you suddenly ascend to Heaven, sit serenely in the Grotto Chamber, holding the scripture and facing south. The Yellow and the Old will then nourish you with divine marvels.”\n\nThe Azure Lad Dao Lord practiced this for a thousand days. His body bore the *huoluo* talisman, and he rode the clouds upon a phoenix to reach the Palace of the Sun. There, the crimson qi of the sun congealed its essence, coiling in a thousand folds. The spirit of the sun’s root condensed the purest jade, named Yuyi Chizhang Longwen. The Azure Lad bowed to it and gathered the sun’s essence.\n\n**The Luminous Jade Text of Supreme Clarity**\n\nThe Azure Lad Dao Lord said:\n\n“Drink the cinnabar of the sun, its double rings radiant and bright. Draw in and absorb the utmost essence, ascending to the moon. The yellow qi expands and enfolds, secretly gathering the golden rays. Nurture emptiness to cultivate brightness, and your spirit will be profoundly serene—thus it is called *Jielin Huangshu Huwen*.”\n\nThe Azure Lad Dao Lord gazed into the emptiness of the Mystic Ultimate, communing with the luminaries of the divine. The qi of the sun and moon conjoined, refining and cooling the true form.\n\nThe heavens and earth receive their subtlest essence, while the numinous spirits emerge from their chambers. Gazing back upon the Nine Heavens, soaring across the Eight Extremities, the Golden Perfected gather qi, and the Jade Empyrean radiates renewed light. The light permeates the singular form, revealing within the Three Palaces. The Three Palaces merge and transform into twenty-seven palaces, towering like the Golden Court, where Jade Infants sit in array.\n\nThe Mud-Pill Palace contains nine chambers, each with its own name, connecting below to the Long Loft and the Twelve Jade Cities. Within the Central Cinnabar Field lie nine palaces:\n\nBetween the high points of the two breasts, where the flesh is level, lies the Guarding Inch of the Twin Fields. On the left resides the great spirit Mingning, styled Shu Ping; on the right, the great spirit Zhengjing, styled Zi Zhang. Clad in embroidered red robes, they hold fire bells to illuminate the four directions.\n\nThe Loft encircles the Palace of the Perfected, wherein dwells the Jade Clarity Perfected, named Tian Yu, styled Xuan Tong. Clad in azure cloud robes, he holds a jade mirror.\n\nThe lungs form the Luminous Clarity Palace, home to the Pristine Flower Dao Lord, named Cheng, styled Yu Xu. Clad in flying cloud robes, seated upon a golden couch, he holds a great pearl like a chicken’s egg.\n\nThe heart forms the Cinnabar Prime Palace, wherein dwells the Jade Perfected, named Long Jing, styled Xi Shen. Clad in red brocade jade robes, he holds the sun in his mouth.\n\nThe spleen forms the Yellow Chamber Palace, wherein dwells the Central Jade Maiden, named Shesheng, styled Bo Hun. Clad in purple rosy cloud robes, she holds a jade ruler.\n\nThe liver forms the Orchid Spirit Palace, wherein dwells the Wood Duke, named Chang Jing, styled Meng Xian. Clad in azure cloud robes, he holds the Jade Emperor’s writ, seated upon a striped dragon.\n\nThe gallbladder forms the Supreme Perfection Palace, wherein dwells the Mystic Radiance Lad, named Yan Wei Yu, styled Xian Hun Zi. Clad in purple cloud robes, he holds a sword.\n\nThe left kidney forms the Jade Emperor’s Palace, wherein dwells the Mystic Minister Lord, named Tong Zhen, styled You Fu. Clad in green cloud robes, he holds a fiery jade.\n\nThe right kidney forms the Jade Maiden’s Palace, wherein dwells the Upright Perfection Lad, named Xu Gen, styled Zheng Xian. Clad in yellow jade robes, he sits with palms joined, facing inward.\n\nWithin the depths of the intestines lies the Supreme Constancy Palace, wherein dwells the Lofty Lord, named Dong Ying, styled Han Hua. Clad in azure cloud robes, he holds a bamboo staff.\n\nThe nine palaces above are inhabited by spirits like infants, seated amidst purple clouds, governing the square inch within.\n\nThe Lower Cinnabar Field also contains nine palaces:\n\nBeside the navel, between the two high points where the flesh is level, lies the Guarding Twin Fields. Within reside two great spirits: on the left, Biaoyuan, styled Qi Wang; on the right, Liming, styled Jing Qing. Clad in purple embroidered robes, they hold fire torches to illuminate the Nine Abysses below and guard the radiance of life.\n\nOne inch inward lies the Hall of Light, home to the great spirit Taokang, named Yu Wei, styled Shang Ming. Clad in red brocade robes, he sits upon a golden couch.\n\nTwo inches inward lies the Grotto Chamber, home to the Mystic Supreme Emperor Lord, named Wu You, styled Ming Zhen. Clad in dark brocade robes, he holds a key.\n\nThree inches inward lies the Cinnabar Field Palace, wherein dwells the great spirit of the Life Palace, named Wu Guang, styled Qin Yuan. Clad in red gauze robes, he holds a jade bell.\n\nFour inches inward lies the Flowing Pearl Palace, wherein dwells the great spirit of Weak Water, named Ji Yuan, styled Tian Ying. Clad in white silk robes.\n\nFive inches inward lies the Purple Ultimate Palace, wherein dwells the Great Unity spirit, named Baoling, styled Qingsheng. Clad in plain brocade robes.\n\nOne inch upward lies the Grotto Prime Palace, wherein dwells the Southern Jade Consort, named Su, styled Jue Chang. Clad in azure cloud robes.\n\nTwo inches upward lies the Grotto Court Palace, wherein dwells the Azure Prime Supreme Emperor, named Da Huang, styled Zeng Zi. Clad in yellow embroidered robes.\n\nThree inches upward lies the Grotto Yang Palace, wherein dwells the Great Lord of the Sun’s Mystery, named Yu Ming, styled Jian Sheng. Clad in dark brocade robes.\n\nFour inches upward lies the Grotto Perfection Palace, wherein dwells the Great Unity spirit, named Bo Gao, styled Du Yuan. Clad in vermilion robes, he sits upright, facing outward.\n\nThe nine palaces of the Lower Cinnabar Field, each a square inch, are inhabited by spirits shaped like infants, seated amidst yellow clouds.\n\nThe Azure Lad Dao Lord clearly beheld the twenty-seven Perfected, arrayed like Jade Infants, secretly forming a lotus chamber. The spirit turns inward, beyond knowing, and the form unites with the Supreme Mystery. The Dao and its virtue come to dwell, becoming one with heaven. The incantation reads:\n\nTwin gates layered in residence,\nNine Jade Cities of the palaces.\nThe Three Palaces arrayed,\nCinnabar and azure spread their essence.\nCirculating through a hundred passages,\nRefining the corpse’s form.\nSubtle existence merges with qi,\nTransforming to generate light.\nCommanding the Great Possession,\nAscending to fly in Jade Clarity.\nThe Dao replete with numinous treasures,\nThe Mystery governs the Perfected’s names.\nVirtue blankets all beings,\nThe Jade Emperor’s face brightens.\nThe body bears the dragon chariot,\nCircling the myriad heavens.\nGazing down upon the Three Luminaries,\nSeated, knowing a hundred million years.\nComposing this scripture in one chapter,\nInscribed upon the Eastern Flower Jade Tower of the Mystic Observatory,\nTo transmit the golden names and azure writings on jade slips\nTo those of the Highest Perfection.\n\nThe Jade Scripture of the Azure Lad’s Protection of the Dao Lord\n\nNinefold unfolding of the Dragon Embryo’s origin,\nThe embryo’s subtlety in the Great Non-Beginning.\nJade emptiness flows in constant non-being,\nIntent and truth treasure their abundant meeting.\nFlanking the sun at the eastern mulberry dawn,\nSwallowing and absorbing from the Purple Gate.\nThe Three Primes reach the Prime of Non-Beginning,\nSupreme virtue governs the Upper Mystery.\nMoved and stirred, yet indistinct,\nWondrous enlightenment follows the Dao’s nature.\nTaokang, father of the jade celestial sphere,\nLife’s essence ascends to the Mud-Pill.\nCinnabar pearls nurture the cloud’s root,\nHeaven’s awn descends into the abyss.\nThe true spirit merges with the mother’s essence,\nTrickling like a gentle flowing spring.\nSilently guiding the Lord Bo Yu,\nMorning rosy clouds rise as congealed mist.\nIlluminating and enfolding the Upper Jade Duke,\nSupporting and settling within the visage’s chamber.\nVenus conceals the mushroom’s bloom,\nThe Supreme Emperor bows at the jade steps.\nMerging and transforming, the true and constant name,\nWisdom and wisdom command the Nine Returns.\nA hundred million years are not too many,\nUnchanging, the flying spirit elixir.\nThe Great Dao attains eternal abiding,\nEternal abiding between opening and closing.\n\nThe Jade Scripture of the Azure Lad Dao Lord is a covenant of utmost gravity, the mysterious pivot of the Dao. Now, resting in the Azure Grove, it oversees the Highest Perfected, harmonizing and guiding the spirit and qi, nurturing the origin of life. The numinous treasures and true names precede heaven and earth. Those who know this scripture will attain transcendence; those who know its precious names will ascend to the ancestral mystery, serving on high beside the Imperial Throne, with boundless years of life.\n\nThe Upper Clarity Scripture of the Numinous Treasure’s Grotto-Chamber True Names is here concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清神宝洞房真讳上经 经名：上清神宝洞房真讳上经。 又名《青童这君列纪》。 撰人不详，约出於东晋南期。 假托金阙帝君告青童君，徒向魏夫人传许远游。 言存守身中洞房三真及诸神要诀。 一卷。 底本出处：《正统道藏》太玄部。 上清神宝洞房真讳上经 此经一名青童道君列纪，一名太保玉经。 神仙修之，为上清之真。 昔魏君华存，授之许君远游，居西城墉台，盟紫景十华药玉，割星云宝霄翔凤之锦，以告上清。 百年以传真人，不以露文地民，发真昭之天矣。 玉保王青遗道君，讳龙光玄，字幽无，生木真一气青厦流光九变东玉那国玄珞之山，翠华含精，流珠侠卫，九千历周，香敷琼葩，明落药本，玉仪九尺，洞观十方，天女捧衣，玉帝稽颡，吟声朗彻，林谷骇震。 天宝神仙王，授青元上真秘箓一百五十五书，真目周悉。 化庶兆门，以启梵运，开道之本曰： 至道者，洞虚也。 化本者，觉意也。 天地不言，有以示也。 万物群品，有以象也。 雷风云气，有以感也。 所以然者，以觉意得也，莫不洞虚而变化也。 化者，常也。 变者，名也。 天地万象皆生於洞虚，洞虚无有也。 化象觉意，皆出於洞房也。 洞房，有中无也，洞虚，无中有也。 房有也，物不因人也。 天也，其工巧於人，不逮见而得之意也，人以意得也。 得者，取之也。 天以意示人，与之也。 所与合，则道德与元炁混一，无所不能为也，无所不可见也。 生死去来，万类消息，在觉意中也。 天地，吾父母也，无不同也。 终始有无，不出此也。 随作随应，显乎几矣。 几者，上清神宝洞房真讳也。 真者，真乎此也。 讳者，讳乎此也。 得此者，太上仙矣。 玉保道君，於时身流琼光，照无穷尽，首建危冠，珠宝映形，披御霞彩，天地告瑞，丹芝呈芳。 以真道成，退斋告於金阙帝君后圣之真曰：大哉，深乎至矣，以发生广施，长养化源，是为玉宝，婴儿守雌，厚泽不形，故号青童。 金阙帝君告青童曰：子体有玉骨，心有九皇，日窗高下，紫志颐下，碧睛深映，自宜位登高真，至道秘讳，今得开晓，而一形寓於天和，亦应炼冷，使有无合化，上升玄宫。 青童道君退斋郁林，肘步请究，乃告之曰：子当闲居，闭目习视，令如开目，开目闭目，不可去见以见。 持之百日，夜视而光通矣。 当复收天光於玄镜，历念子身中有水晶，即仰看真极下，洞房中方寸三真。 视百日，当闻如天震雷，方寸之中，可方丈矣。 百八十日，如大屋矣。 三百日，如官殿矣。 千日，与天地等矣。 不以念而念，不以思而思，不以觉而觉，不以意而意，惟精所通，万象备矣。 向之觉意所得，皆在其中矣。 神道自显，显而昧昧，辽然与世远矣。 洞房中当见子之造化无穷，无边无极际也。 子忽升天，安坐洞房，执经南向，黄老则哺子以神奇矣。 青童道君行之千日，身佩豁落，驾凤乘云，以造日宫。 日中赤炁凝精，盘流千折，日根之神结玉之粹，其名郁仪赤章龙文。 青童揖之，以采日精。 洞明玉清太上之文 青童道君曰：饮日之丹，重环耀明，引吸至精，以升月中，黄气融廓，密采金芒，含虚养明，湛尔其神，故曰结璘黄书虎文。 ． 青童道君仰玄极之虚，通交神之曜，日月结炁，炼冷真形。",
      "translated_text": "**The Supreme Clarity Scripture of the Divine Treasure and the True Taboo Names of the Grotto Chamber**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Divine Treasure and the True Taboo Names of the Grotto Chamber*. Also known as *The Arrayed Records of the Azure Lad*.\n\nAuthor unknown, approximately composed during the late Eastern Jin dynasty. Attributed to the Golden Portal Emperor Lord, who revealed it to the Azure Lad, who in turn transmitted it to Lady Wei and Xu Yuanyou. It expounds upon the preservation of the Three Perfected Ones within the Grotto Chamber of the body and the essential secrets of the various spirits. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Orthodox Tradition*, *Great Mystery Section*.\n\n---\n\n**The Supreme Clarity Scripture of the Divine Treasure and the True Taboo Names of the Grotto Chamber**\n\nThis scripture is also named *The Arrayed Records of the Dao Lord Azure Lad* and *The Jade Scripture of the Grand Protector*. Cultivated by divine immortals, it is the perfection of Supreme Clarity.\n\nIn former times, Lady Wei Huacun transmitted it to Lord Xu Yuanyou, who dwelled in the Western City’s Rampart Terrace. There, he swore an oath with the Purple Radiance and the Tenfold Flowered Jade of Medicinal Essence, cutting the brocade of starry clouds and the soaring phoenix of treasured auroras to proclaim it to Supreme Clarity. After a hundred years, it was passed to the perfected ones, its texts never exposed to the common folk, so that the heavens of true illumination might be revealed.\n\nThe Jade Protector King Azure transmitted it to the Dao Lord, whose taboo name was Longguangxuan and whose style was Youwu. Born of the primordial qi of Wood Perfection in the Eastern Jade Na Country, upon the Mountain of Mystic Pendants, his jade-like form was embraced by verdant splendor, his flowing pearls flanked by guardians. After nine thousand circuits, fragrant blossoms of jasper unfolded, the roots of medicinal herbs gleamed, and his nine-foot jade countenance surveyed the ten directions. Heavenly maidens bore his robes, the Jade Emperor bowed in reverence, and his chanting voice rang clear, startling the forests and valleys.\n\nThe Heavenly Treasure Divine Immortal King bestowed upon the Azure Prime Perfected One a secret register of one hundred fifty-five texts, their true titles complete and exhaustive. Transforming the gates of the myriad destinies, he inaugurated the kalpa of Brahma, declaring the root of the Dao’s unfolding:\n\nThe utmost Dao is the Grotto of Emptiness.\nThe root of transformation is awakened intent.\nHeaven and Earth do not speak, yet they manifest signs.\nThe ten thousand things and all species bear their forms.\nThunder, wind, clouds, and qi move by resonance.\nThus it is because awakened intent is attained—all things are transformed through the Grotto of Emptiness.\nTransformation is constancy.\nChange is name.\nThe myriad images of Heaven and Earth all arise from the Grotto of Emptiness, yet the Grotto of Emptiness has no being.\nThe images of transformation and awakened intent all emerge from the Grotto Chamber.\nThe Grotto Chamber is being within non-being.\nThe Grotto of Emptiness is non-being within being.\nThe chamber exists, yet things do not depend on man.\nHeaven’s craft surpasses man’s, for its intent is not perceived yet is attained.\nMan attains it through intent.\nAttainment is taking.\nHeaven manifests intent to man, bestowing it.\nWhen what is bestowed aligns, then virtue and primordial qi merge as one, and there is nothing that cannot be done, nothing that cannot be seen.\nLife and death, coming and going, the waxing and waning of the myriad kinds—all reside within awakened intent.\nHeaven and Earth are our father and mother, and there is nothing in which they differ.\nBeginning and end, being and non-being—none lie beyond this.\nActing and responding in accord, the subtle is revealed.\nThe subtle is the true taboo names of the Divine Treasure of the Supreme Clarity Grotto Chamber.\nThe true is the truth of this.\nThe taboo is the reverence for this.\nOne who attains this becomes a Most High Immortal.\n\nThe Jade Protector Dao Lord, at that time, emanated a radiance of jasper light, boundless and inexhaustible. His head bore a towering crown, his form adorned with pearls and treasures, draped in the hues of auroral clouds. Heaven and Earth proclaimed auspicious omens, and cinnabar mushrooms displayed their fragrance. Having perfected the true Dao, he withdrew to his retreat and addressed the perfected ones of later sagacity after the Golden Portal Emperor Lord:\n\n“Great indeed! Profound and ultimate! By generating and broadly bestowing, nurturing the source of transformation, this is called the Jade Treasure. The infant guards the feminine, its profound blessings unseen—thus it is named the Azure Lad.”\n\nThe Golden Portal Emperor Lord addressed the Azure Lad:\n\n“Your body possesses jade bones, your heart the Nine Sovereigns. The windows of the sun ascend and descend, the purple will rests beneath your cheeks, your azure eyes shine deeply. Naturally, you are fit to ascend as a high perfected one. The secret taboos of the utmost Dao are now revealed to you. As your form dwells in celestial harmony, you must also refine and cool it, so that being and non-being merge in transformation, ascending to the Mystic Palace.”\n\nThe Azure Lad Dao Lord withdrew to the fragrant grove of his retreat, pacing with his elbows and entreating further instruction. The Lord then declared:\n\n“You must dwell in seclusion, close your eyes and practice seeing as though they were open. Whether your eyes are open or closed, do not abandon seeing in order to see. After a hundred days of this, at night your vision will penetrate with light. You must then gather the light of Heaven within the Mystic Mirror, contemplating the crystal water within your body. Then, gaze upward at the true extremity below, where the Three Perfected Ones of the Grotto Chamber reside within a square inch.\n\nAfter a hundred days of this, you will hear a sound like the thunder of Heaven, and within that square inch, a space of a square *zhang* will appear. After a hundred and eighty days, it will be like a great hall. After three hundred days, like a palace. After a thousand days, it will equal Heaven and Earth. Without thought, you will think; without reflection, you will reflect; without awareness, you will be aware; without intent, you will intend. Only through the communion of essence will the myriad images be complete. All that was attained through awakened intent will reside within.\n\nThe divine Dao will manifest of itself, dimly yet brilliantly, and you will be far removed from the world. Within the Grotto Chamber, you will witness your own endless transformations, boundless and without limit. Should you suddenly ascend to Heaven, sit serenely in the Grotto Chamber, holding the scripture and facing south. The Yellow and the Old will then nourish you with divine marvels.”\n\nThe Azure Lad Dao Lord practiced this for a thousand days. His body bore the *huoluo* talisman, and he rode the clouds upon a phoenix to reach the Palace of the Sun. There, the crimson qi of the sun congealed its essence, coiling in a thousand folds. The spirit of the sun’s root condensed the purest jade, named Yuyi Chizhang Longwen. The Azure Lad bowed to it and gathered the sun’s essence.\n\n**The Luminous Jade Text of Supreme Clarity**\n\nThe Azure Lad Dao Lord said:\n\n“Drink the cinnabar of the sun, its double rings radiant and bright. Draw in and absorb the utmost essence, ascending to the moon. The yellow qi expands and enfolds, secretly gathering the golden rays. Nurture emptiness to cultivate brightness, and your spirit will be profoundly serene—thus it is called *Jielin Huangshu Huwen*.”\n\nThe Azure Lad Dao Lord gazed into the emptiness of the Mystic Ultimate, communing with the luminaries of the divine. The qi of the sun and moon conjoined, refining and cooling the true form.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1232,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.81277942657471,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上清神宝洞房真讳上经.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天地纳其几，神明出其室，回盻九天，飞驰八表，金真摄炁，玉霄重光。 光通一形，内见三宫，三宫合化，二十七宫，峨峨金庭，坐列玉婴。 泥丸九官，宫各有名，下通长楼，十二玉城。 中丹田有九宫。 两乳高处陷平，为守寸双田，左有大神，名命宁，字叔平； 右有大神，名正精，字子张，着红绣衣，手执火铃，以照四方。 楼环为真人宫，中有玉清真人，名天玉，字玄通，着青云衣，手执玉镜。 肺为皓清宫，有素华道君，名曰成，字玉虚，着飞云衣，坐金床，手执大珠如鸡子。 心为丹元宫，中有玉真，名龙精，字曦渗，着红锦玉衣，口衔日。 脾为黄室宫，中有中部玉女，名摄生，字伯昏，着紫霞衣，手执玉尺。 肝为兰灵宫，中有木公，名长精，字孟贤，着碧霄衣，手执玉帝之文，坐班龙之上。 胆为太真宫，中有玄光童子，名彦威玉，字仙魂子，着紫云衣，手执剑。 左肾为玉帝宫，中有玄卿君，名统真，字幽赋，着绿云衣，手执火玉。 右肾为玉女宫，中有正真童子，名曰虚根，字正仙，着黄玉衣，合掌坐相向。 穷肠之裹为太常宫，中有高上君，名洞英，字含华，着青云衣，手执笻。 上之九宫，神如婴儿，坐紫云间，治方寸中。 下丹田有九官。 脐傍两问高处陷中，为守双田，中有二大神，左曰标元，字期亡； 右曰理明，字敬清，着紫绣衣，手执火炬，下烛九渊，护镇生明。 入一寸为明堂，有桃康大神，名玉威，字上明，着红锦衣，坐金床。 二寸为洞房，有玄上帝君，名无猷，字命真，着玄锦衣，手执钥。 三寸为丹田宫，中为生宫大神，名务光，字勤元，着赤铢衣，手执玉铃。 四寸为流珠宫，中有弱水大神，名积渊，字天英，着白绡衣。 五寸为紫极宫，中有太乙大神，名保灵，字庆生，着单锦衣。 却上一寸为洞元宫，中有南上玉妃，名苏，字决昌，着碧云衣。 却上二寸为洞庭宫，中有碧元上帝，名大黄，字曾子，着黄绣衣。 却上三寸为洞阳宫，中有日玄大君，名郁明，字监生，着玄锦衣。 却上四寸为洞真官，中有帝一大神，名伯高，字都元，着朱衣，正坐，并向外。 下丹田九宫，亦各方寸，神形如婴儿，坐黄云中。 青童道君洞见二十七真，罗布玉婴，密为莲房，反神无知，形合太玄，道德来居，与天为一。 祝曰： 骈阙累居，玉官九城，三官布列，丹碧罗精，周流百关，伏炼尸形，妙有合炁，变化生明，役御大有，上飞玉清。 道备神宝，玄领真讳，德被群品，玉帝开颜，身带龙舆，周旋万天，俯窥三辰，坐知亿年，作经一章，刻东华玉阙玄观之上，以传金名青书玉简，高真之人。 青童玉保王道经 九开龙胎先，胎几太无始，玉空流常无，意真宝繁会，侠日东桑霞，咽吸出紫阙，三元极元初，至德理上玄，感激但恍惚，妙觉道自然，桃康璇玑父，命精升泥丸，朱珠养云根，天芒下入渊，真神合母精，涓涓淡流泉，默御伯玉君，晨霞起凝烟，照韫上玉公，掖致镇容间，金曜隐芝华，太帝揖玉阶，混化真常名，智惠命九还，亿龄无足多，不变飞神丹，大道得长存，长存开阖间。 青童道君玉经，盟禁至重，道之玄枢焉。 于今偃息青林，总校上真，调御神炁，育生元元，神宝真讳，先乎天地，有知此文，身得神仙，知其宝讳，拔登祖玄，高侍帝宸，寿无穷年。",
      "translated_text": "The heavens and earth receive their subtlest essence, while the numinous spirits emerge from their chambers. Gazing back upon the Nine Heavens, soaring across the Eight Extremities, the Golden Perfected gather qi, and the Jade Empyrean radiates renewed light. The light permeates the singular form, revealing within the Three Palaces. The Three Palaces merge and transform into twenty-seven palaces, towering like the Golden Court, where Jade Infants sit in array.\n\nThe Mud-Pill Palace contains nine chambers, each with its own name, connecting below to the Long Loft and the Twelve Jade Cities. Within the Central Cinnabar Field lie nine palaces:\n\nBetween the high points of the two breasts, where the flesh is level, lies the Guarding Inch of the Twin Fields. On the left resides the great spirit Mingning, styled Shu Ping; on the right, the great spirit Zhengjing, styled Zi Zhang. Clad in embroidered red robes, they hold fire bells to illuminate the four directions.\n\nThe Loft encircles the Palace of the Perfected, wherein dwells the Jade Clarity Perfected, named Tian Yu, styled Xuan Tong. Clad in azure cloud robes, he holds a jade mirror.\n\nThe lungs form the Luminous Clarity Palace, home to the Pristine Flower Dao Lord, named Cheng, styled Yu Xu. Clad in flying cloud robes, seated upon a golden couch, he holds a great pearl like a chicken’s egg.\n\nThe heart forms the Cinnabar Prime Palace, wherein dwells the Jade Perfected, named Long Jing, styled Xi Shen. Clad in red brocade jade robes, he holds the sun in his mouth.\n\nThe spleen forms the Yellow Chamber Palace, wherein dwells the Central Jade Maiden, named Shesheng, styled Bo Hun. Clad in purple rosy cloud robes, she holds a jade ruler.\n\nThe liver forms the Orchid Spirit Palace, wherein dwells the Wood Duke, named Chang Jing, styled Meng Xian. Clad in azure cloud robes, he holds the Jade Emperor’s writ, seated upon a striped dragon.\n\nThe gallbladder forms the Supreme Perfection Palace, wherein dwells the Mystic Radiance Lad, named Yan Wei Yu, styled Xian Hun Zi. Clad in purple cloud robes, he holds a sword.\n\nThe left kidney forms the Jade Emperor’s Palace, wherein dwells the Mystic Minister Lord, named Tong Zhen, styled You Fu. Clad in green cloud robes, he holds a fiery jade.\n\nThe right kidney forms the Jade Maiden’s Palace, wherein dwells the Upright Perfection Lad, named Xu Gen, styled Zheng Xian. Clad in yellow jade robes, he sits with palms joined, facing inward.\n\nWithin the depths of the intestines lies the Supreme Constancy Palace, wherein dwells the Lofty Lord, named Dong Ying, styled Han Hua. Clad in azure cloud robes, he holds a bamboo staff.\n\nThe nine palaces above are inhabited by spirits like infants, seated amidst purple clouds, governing the square inch within.\n\nThe Lower Cinnabar Field also contains nine palaces:\n\nBeside the navel, between the two high points where the flesh is level, lies the Guarding Twin Fields. Within reside two great spirits: on the left, Biaoyuan, styled Qi Wang; on the right, Liming, styled Jing Qing. Clad in purple embroidered robes, they hold fire torches to illuminate the Nine Abysses below and guard the radiance of life.\n\nOne inch inward lies the Hall of Light, home to the great spirit Taokang, named Yu Wei, styled Shang Ming. Clad in red brocade robes, he sits upon a golden couch.\n\nTwo inches inward lies the Grotto Chamber, home to the Mystic Supreme Emperor Lord, named Wu You, styled Ming Zhen. Clad in dark brocade robes, he holds a key.\n\nThree inches inward lies the Cinnabar Field Palace, wherein dwells the great spirit of the Life Palace, named Wu Guang, styled Qin Yuan. Clad in red gauze robes, he holds a jade bell.\n\nFour inches inward lies the Flowing Pearl Palace, wherein dwells the great spirit of Weak Water, named Ji Yuan, styled Tian Ying. Clad in white silk robes.\n\nFive inches inward lies the Purple Ultimate Palace, wherein dwells the Great Unity spirit, named Baoling, styled Qingsheng. Clad in plain brocade robes.\n\nOne inch upward lies the Grotto Prime Palace, wherein dwells the Southern Jade Consort, named Su, styled Jue Chang. Clad in azure cloud robes.\n\nTwo inches upward lies the Grotto Court Palace, wherein dwells the Azure Prime Supreme Emperor, named Da Huang, styled Zeng Zi. Clad in yellow embroidered robes.\n\nThree inches upward lies the Grotto Yang Palace, wherein dwells the Great Lord of the Sun’s Mystery, named Yu Ming, styled Jian Sheng. Clad in dark brocade robes.\n\nFour inches upward lies the Grotto Perfection Palace, wherein dwells the Great Unity spirit, named Bo Gao, styled Du Yuan. Clad in vermilion robes, he sits upright, facing outward.\n\nThe nine palaces of the Lower Cinnabar Field, each a square inch, are inhabited by spirits shaped like infants, seated amidst yellow clouds.\n\nThe Azure Lad Dao Lord clearly beheld the twenty-seven Perfected, arrayed like Jade Infants, secretly forming a lotus chamber. The spirit turns inward, beyond knowing, and the form unites with the Supreme Mystery. The Dao and its virtue come to dwell, becoming one with heaven. The incantation reads:\n\nTwin gates layered in residence,\nNine Jade Cities of the palaces.\nThe Three Palaces arrayed,\nCinnabar and azure spread their essence.\nCirculating through a hundred passages,\nRefining the corpse’s form.\nSubtle existence merges with qi,\nTransforming to generate light.\nCommanding the Great Possession,\nAscending to fly in Jade Clarity.\nThe Dao replete with numinous treasures,\nThe Mystery governs the Perfected’s names.\nVirtue blankets all beings,\nThe Jade Emperor’s face brightens.\nThe body bears the dragon chariot,\nCircling the myriad heavens.\nGazing down upon the Three Luminaries,\nSeated, knowing a hundred million years.\nComposing this scripture in one chapter,\nInscribed upon the Eastern Flower Jade Tower of the Mystic Observatory,\nTo transmit the golden names and azure writings on jade slips\nTo those of the Highest Perfection.\n\nThe Jade Scripture of the Azure Lad’s Protection of the Dao Lord\n\nNinefold unfolding of the Dragon Embryo’s origin,\nThe embryo’s subtlety in the Great Non-Beginning.\nJade emptiness flows in constant non-being,\nIntent and truth treasure their abundant meeting.\nFlanking the sun at the eastern mulberry dawn,\nSwallowing and absorbing from the Purple Gate.\nThe Three Primes reach the Prime of Non-Beginning,\nSupreme virtue governs the Upper Mystery.\nMoved and stirred, yet indistinct,\nWondrous enlightenment follows the Dao’s nature.\nTaokang, father of the jade celestial sphere,\nLife’s essence ascends to the Mud-Pill.\nCinnabar pearls nurture the cloud’s root,\nHeaven’s awn descends into the abyss.\nThe true spirit merges with the mother’s essence,\nTrickling like a gentle flowing spring.\nSilently guiding the Lord Bo Yu,\nMorning rosy clouds rise as congealed mist.\nIlluminating and enfolding the Upper Jade Duke,\nSupporting and settling within the visage’s chamber.\nVenus conceals the mushroom’s bloom,\nThe Supreme Emperor bows at the jade steps.\nMerging and transforming, the true and constant name,\nWisdom and wisdom command the Nine Returns.\nA hundred million years are not too many,\nUnchanging, the flying spirit elixir.\nThe Great Dao attains eternal abiding,\nEternal abiding between opening and closing.\n\nThe Jade Scripture of the Azure Lad Dao Lord is a covenant of utmost gravity, the mysterious pivot of the Dao. Now, resting in the Azure Grove, it oversees the Highest Perfected, harmonizing and guiding the spirit and qi, nurturing the origin of life. The numinous treasures and true names precede heaven and earth. Those who know this scripture will attain transcendence; those who know its precious names will ascend to the ancestral mystery, serving on high beside the Imperial Throne, with boundless years of life.",
      "overlap_context": " the sun, its double rings radiant and bright. Draw in and absorb the utmost essence, ascending to the moon. The yellow qi expands and enfolds, secretly gathering the golden rays. Nurture emptiness to cultivate brightness, and your spirit will be profoundly serene—thus it is called *Jielin Huangshu Huwen*.”\n\nThe Azure Lad Dao Lord gazed into the emptiness of the Mystic Ultimate, communing with the luminaries of the divine. The qi of the sun and moon conjoined, refining and cooling the true form.",
      "start_char": 1232,
      "end_char": 2488,
      "start_sentence": 62,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.273290157318115,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上清神宝洞房真讳上经.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "上清神宝洞房真讳上经竟",
      "translated_text": "The Upper Clarity Scripture of the Numinous Treasure’s Grotto-Chamber True Names is here concluded.",
      "overlap_context": " of the Azure Lad Dao Lord is a covenant of utmost gravity, the mysterious pivot of the Dao. Now, resting in the Azure Grove, it oversees the Highest Perfected, harmonizing and guiding the spirit and qi, nurturing the origin of life. The numinous treasures and true names precede heaven and earth. Those who know this scripture will attain transcendence; those who know its precious names will ascend to the ancestral mystery, serving on high beside the Imperial Throne, with boundless years of life.",
      "start_char": 2489,
      "end_char": 2503,
      "start_sentence": 99,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.148380994796753,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上清神宝洞房真讳上经.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}