{
  "source_id": "上清金真玉光八景飞经",
  "source_file": "chunked_daozang\\上清金真玉光八景飞经.json",
  "total_chunks": 8,
  "total_original_chars": 9215,
  "total_translated_chars": 61481,
  "total_translation_time": 287.2548325061798,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Scripture of the Golden Perfection and Jade Radiance of the Eight Luminaries**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants*. Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. One scroll.\n\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n**Collated Editions:** Dunhuang manuscripts DX1962+2052+P.2728+2848+S.238.\n\n---\n\n**The Supreme Clarity Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants**\nComposed by the Most Exalted Azure Youth Lord\n\nThe *Hidden Writ of the Golden Perfection and Jade Radiance* was received by the Nine Heavens Venerable from the Golden Perfection and Jade Radiance of the Numinous Capital of the Great Void, bestowed by the Primordial Heavenly King. It is named the *Scripture of the Eight Luminants*, the *Supreme Scripture of the Eight Purities* by the Great Perfected, the *Expansive Seven Origins* by the Azure Perfected Youth, and the *Hidden Writ of Jade Secrets* by the Most High Great Dao Lord.\n\nThe Golden Chapters emerged before the Nine Mysteries, their upper sections named after the four seasons. This Dao is lofty and wondrous, revered among all scriptures, governing the myriad Perfected, guiding the host of immortals. Its mysterious talismans flow and reflect, illuminating the Purple Dawn. It is concealed within the Palace of Great Abundance above the Nine Heavens, in the Golden Splendor Purple Hall and Jade Treasure Chamber.\n\nForged in gold as tablets to inscribe the numinous text, carved in jade as cinnabar script to clarify its chapters, its radiance shines brilliantly, illuminating the Great Void. Sun and moon flank its light, the Five Dawns assist its numen. Three thousand Jade Radiance Maidens and three thousand Azure Youths are commanded to attend the jade script. Jade consorts tend the incense, divine winds waft the mist. Mighty dragons and venomous beasts guard the jade gates. Phoenixes spread their wings, sacred simurghs shade the mystery. The host of Perfected feast in ritual, the ten thousand sages pay homage. Jade steps bear canopies across the celestial court; the Great Emperor humbles himself before the throne. The Jade Sovereign alters the measures to propel the cycles; the Jade Armillary commands the Dipper to turn the spirits. The divine provinces are sung into harmony; the Seven Transformations dance in the heavens. The Three and Five traverse the numinous transformations; the Nine Mysteries scatter their celestial paths. The Five Phases are marshaled to summon souls; the Expansive Seven are harnessed to command spirits. The Eight Luminants ascend to the void; demons are subdued by the Golden Perfection. The *Hidden Writ* is unveiled in the chamber of stillness; its wondrous verses are chanted in the spaceless. The myriad emperors are governed in the Supreme; the multitudes below are gathered in the ever-generating.\n\nAt the inception of the primordial qi, the Nine Heavens Venerable sat in command of the Numinous Capital. He summoned the Jade Perfected, the Five Elders, the Thirty-Nine Emperors, the Supreme Sovereign Masters, the Myriad Origin Dao Lords, the Lofty Sage Great Spirits, the Most High Great Dao Lord, the Great Emperor of Fusang in the Sun Valley, the Supreme Prime of the Southern Culmen, the Three Primordial Ladies of Purple Purity, the Queen Mother of the Western Tortoise, and the Three Primordial Ladies of Great Purity. Together, they ascended the Sevenfold Crimson Chambers of the Supreme Jade Treasure Terrace in the Purple Jade Palace of the Supreme. Edicts were issued to the Five Emperors and the officials of the four directions. The divine soldiers of the Numinous Capital aided in guarding the Supreme Prime.\n\nThe Most Exalted Jade Maidens of Great Harmony were commanded to deploy the talismans of the Golden Perfection for summoning spirits and subduing demons, placing them in the five directions. The Four Perfected of the Great Ultimate recited the chapters of the Great Void. Their wondrous chanting resonated clearly; the Eight Luminants aligned in perfection. Jade radiance illuminated the heavens; the Expansive Seven shone brilliantly. The Three Dawns paused their splendor; the Eight Winds turned their banners. Dark drums sounded beneath cloud canopies; the Nine Qi reflected the numinous. The Three and Five assisted in praise; the Six Sixes merged in harmony. Profound and obscure above, resplendent and majestic in the Great Obscurity, incense flew around the sun, lightning stirred the essence. Floral radiance intermingled; divine candles merged their light. Flowing through a thousand kalpas, attaining the wondrous and forgetting the cycles.\n\nThereupon, the Nine Heavens Venerable descended upon the Dark Terrace. He commanded the Left Immortal Attendant Li Yufei and the Supervisor of Numinous Envoys Deng Yuansheng to wield the nine-colored banners and the jade script of imperial edicts. They proclaimed the covenant to the Four Luminants, transmitting it to the host of Perfected. The *Eight Luminants Scripture of the Golden Perfection and Jade Radiance* and the *Expansive Seven Origins*, bestowed by the Most High Great Dao Lord, ascended to the supreme rank. They roamed the Jade Clarity, aided by Golden Immortals, guarded by the Five Emperors. The affairs of the mandate were revealed in full. Cloud chariots bore canopies; flying dragons readied their carriages. Dragons soared beyond the heavens; in an instant, billions of immortals assembled. Jade wheels and azure carriages flowed with radiant mist. The host played cloud songs; phoenixes cried and simurghs soared. Mists intermingled and gathered, lingering between the Dark and Supreme. Soughing beyond the Great Rosy Clouds, they wandered beyond the boundless, each returning to their Jade Void abodes, as if moved by the numinous wind’s qi.\n\nThe Most High Great Dao Lord then ascended the towering terrace and the Ninefold Chambers. He summoned the Nine Mysteries Golden Gate Emperor of Later Saints and the Most Exalted Azure Lord. For three months, they fasted in accordance with the covenant, receiving the transmission from the two lords. Each was to seal a copy in the Golden Gate Upper Palace and the Azure Palace of the Square Cauldron.\n\nWhen the great kalpa completes its cycle, the Three Ways wane and wax, the Two Qi part and unite. The governance of beings has its appointed time. In the age of the Tang, the Yang Nine unleashed calamity. Malevolence was eradicated; the worthy were sought. In that year, those who cultivated the *True Scripture of the Great Cavern*, who refined the Dark Pass of the One Feminine, who deployed the Eight Ways to summon the formless, who studied the Golden Floral of the Three Origins, who recited the Pure Numinous in the chamber of stillness, who marshaled the Five Phases to summon souls, who wore the Tiger Script of the Golden Spirit, who shifted the Seven Stars at the Celestial Pass, who grasped the Dark Names in the Emperor’s Chart, who established the Azure Record in the Supreme Clarity, who bound the Jade Embryo to weave the network, who contained the Jade Womb to nurture the inner spirit, who severed worldly attachments to prolong life, who guarded silence in spontaneity—such ones could receive the mysterious transmission of the Eight Luminants, learn the wondrous secrets of the Golden Perfection, deploy the summoning of spirits in secluded chambers, and place the Expansive Seven to command the gods. They would deliver their seven ancestors from the dark palace, free them from the Five Sufferings of the Knife Mountains, escape the Eight Perils of the Fire Realms, and dissolve the burden of stones from past roots.\n\nThose who obtain this scripture transcend the Nine Mysteries, soaring freely with flying shadows, gazing upon the Three Clarities. Without such a person, it must not be transmitted for kalpas.\n\nThe *Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants* was born above the Nine Heavens, before the existence of light. Its mysterious radiance flows and reflects, neither present nor absent, suspended in profound obscurity, illuminating the Jade Palace. Accumulated over seven thousand kalpas, its text is most luminous. Gazing upon it in the Great Void above the Dark Mystery, one cannot fathom it; destroying it, it does not perish. Resplendent and radiant, it shines through the Ten Heavens.\n\nIn the first year of Jian Shi, when the year lay in the Eastern Pivot and the celestial stems aligned in auspicious conjunction, the Nine Heavens Venerable One purified the Seven Treasures Jade Terrace in the Great Void. With a covenant of gold and azure, he invoked the heavens to receive the numinous scripture, summoning spirits and subduing demons through the Seven Radiant Ones of the Vast Expanse. Once the mysterious chapters were fathomed, no master or lineage was known—it arose suddenly, inexplicably. Upon enacting its text, the Eight Luminants manifested in form, their light illuminating the jade chamber and beckoning the myriad perfected beings. At that moment, the Emperor of Heaven issued his decree, and none among the host of immortals failed to attend his court, offering reverence in prostration and paying homage to the Jade Scripture.\n\nThis is the celestial pledge of the Nine Heavens’ Emperor, the majestic writ of the Jade Sovereign. To his left, the Left Auxiliary bore the staff of the Immortal Capital; to his right stood the Jade Gentlemen of the Attendant Immortals, along with ten billion myriad spirit officials of the Five Directions, charged with safeguarding the sacred text and aiding those who wore its talismans. In accordance with the Four Luminants of the Supreme Ultimate, it was transmitted once in ten thousand kalpas, concealed within the Palace of Great Abundance above the Nine Heavens—the Golden Radiance Purple Hall, the Jade Treasure Chamber—where natural flying nets draped the chamber, jade tables and golden couches stood arrayed. Jade Morn’s youths held incense to the left, Golden Flower’s maidens scattered mist to the right; the Grand Consort attended before, Jade Immortals flanked behind. A canopy of dark clouds and purple shade sheltered the hall, while the perfected immortals and exalted sages ascended thrice monthly to perform their rites.\n\nSuch were the precious instructions and divine decrees: when the Three and Five altered the course of destiny and the great kalpas turned in their cycles, this scripture was to be revealed in the world for seven hundred years. Only those whose names were inscribed in the Emperor’s register, whose jade characters shone in Purple Clarity, whose golden storehouses and jade bones harmonized with the True—only they were permitted to receive its covenant transmission. To lightly divulge the Emperor’s treasure would subject one’s seven ancestors, parents, and self to the Three Offices’ judgment, consigning them to the Knife Mountain Hell, where for ten thousand kalpas there would be no reprieve. Let those who receive it exercise utmost caution.\n\nThe Celestial Venerable of Primordial Beginning revealed it in the Void of Supreme Mystery, transmitting it to the Nine Heavens Venerable One, the Supreme Perfected of the Great Dao, the Azure Perfected Youth, the Five Elders of the Upper Perfected, the Thirty-Nine Emperors, the Venerable Master of the Supreme Sovereign, the Lord of Myriad Beginnings, the Upper Prime of the Southern Culmen, the Three Primordial Ladies of Purple Simplicity, the Queen Mother of the Western Tortoise, the Three Primordial Ladies of Supreme Simplicity, and the Lady of Supreme Perfection. The Venerable Master of the Supreme Sovereign transmitted it to the Purple Clarity Emperor Lord; the Lord of Myriad Beginnings to the Venerable Master of the Yellow Stone and the Three Heavens Jade Youths; the Supreme Perfected of the Great Dao to the Eastern Sea Youth, the Lady of Purple Tenuity, and the Golden Watchtower Emperor Lord of the Nine Mysteries of the Latter Sage. The Emperor Lord entrusted it to the Minister of the Upper Prime, the Azure Youth, the Four Perfected of the Supreme Ultimate, and the Lord of the Western City. Thus, the precious instructions were passed mouth-to-mouth among the exalted perfected, compiled and enacted by the Minister Emperor Lord, who arranged the liturgies and expounded the Dharma. In due succession, they were gathered into a sacred scroll, one copy of which was sealed within the stone chamber of Mount Wangwu.\n\nShould there be one of lofty aspiration and earnest devotion, who forsakes worldly glory, ascends the numinous mountain, and cultivates with diligent austerity—whose name is recorded in the Azure Palace—such a one shall receive this scripture, and the Emperor Lord shall dispatch perfected beings to secretly transmit it to their person. Once obtained, the Five Emperors shall guard their chamber, summoning spirits and subduing demons, mastering essence and governing spirits. Through cultivation and recitation of the scripture, they shall ascend to correspond with the Nine Heavens, free from the misfortune of trial and failure. By enacting its methods, perfected beings shall descend to converse with them, and within seven years, they shall traverse the void; after nine years of devoted practice, they shall ascend in broad daylight.\n\nThe supreme Way is not transmitted to the untrue. All who receive *The Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants* are divinely ordained, their past lives destined for immortality. They must burn incense in a separate chamber, bowing morning and evening, their hearts filled with the presence of the divine perfected, the Jade Radiance, and the Purple Qi, suffusing the hall of purification. In reverent devotion, as if gazing upon the gods themselves, the Emperor shall dispatch twenty-four maidens of Golden Flower and twenty-four youths of Jade Morn to attend and protect them, rewarding merit and punishing transgression, discerning good from evil. Moreover, the Water and Fire Officials of the Left and Right shall scrutinize any leaks or violations of the statutes, meting out punishment with the Wind-Knife’s trial, extending guilt to the seven ancestors.\n\nThe statutes of life and death demand vigilance in cultivation. Those who study the supreme Way, entering the mountains to fast and recite the numinous chapters without this scripture, who recklessly employ the talismans for summoning spirits, subduing demons, and the Seven Radiant Ones of the Vast Expanse, shall not presume to invoke the Jade Scripture. The perfected shall not descend, and celestial demons shall assail their person. For this scripture is the pledge of the Nine Heavens’ Emperor, the writ of the Jade Sovereign. To act without its mandate is to fail in attaining the Dao; to recite it with shallow intent in pursuit of immortality is to labor in vain, inviting calamity instead. The Three Offices shall seize and punish, extinguishing the self.\n\nThose who wish to cultivate the Dao must prepare the full complement of scriptures, ensuring their completeness and coherence, their rituals and enactments in proper measure. After ten thousand recitations, perfected beings shall descend to their chamber, and they shall attain immortality on the appointed day—though not necessarily after ten thousand recitations, for it lies in the depth of their devotion. Those who wear the talismans for summoning spirits, subduing demons, and the Seven Radiant Ones of the Vast Expanse shall be born under the Supreme Unity, their lifespans altered by the Controller of Destinies, their names recorded in the registers of the Supreme Mystery. Proclaimed to the Four Offices, the Five Emperors, the spirit officials, the Five Marchmounts, the Nine Rivers, and the myriad numinous beings, all shall bow in reverence and protection of their person. This is the true imperial writ of the Celestial Sovereign, by which spirits are commanded and numinous powers are wielded.\n\nIn practicing this Way, one must not rashly enter defiled or polluted places, nor tread the filth of life and death. To violate this prohibition is to drive the perfected spirits away, returning them to the Upper Palace, where their names shall no longer exert control, bringing harm upon the self. Let those who receive this teaching take heed above all else.\n\nOn the day of the Beginning of Spring, when the Three Primordial Ladies of Simplicity ascend to the Celestial Sovereign and the Supreme Thearch holds his celestial feast, it is the day of the Primordial Radiance’s procession, the occasion for receiving immortality. Those who cultivate the methods of *The Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants* must bathe and fast on that day, entering their chamber at dawn to burn incense and perform the rites. They shall arrange the talismans for summoning spirits, beckoning the perfected, and subduing demons in the Five Directions, standing at the center facing the northeast. Knocking their teeth twelve times, they shall visualize clouds of purple, green, and white swirling from the northeast, then silently invoke: *\"Three Primordial Ladies of Simplicity, I beseech you to turn your divine chariots and descend upon me. Inscribe my name anew and bestow upon me the gift of immortality.\"*\n\nUpon completion, visualize once more the Upper Palace of Pristine Subtlety in the northeast, the Palace of Primordial Yang, where the Lord of the Dao of the Primordial Radiance, Controller of Emptiness and Recorder of Destinies, surnamed Ge and named Taizhou Xian, resides. His form measures seven inches and eight fen, clad in a cord of dark yellow, crowned with a seven-hued luminous jade coronet, and shod in five-colored shoes. In his hand, he holds the staff of awe-inspiring power, riding the chariot of the Eight Luminants, a carriage of soaring tortoise and dark clouds, drawn by azure dragons. He is attended by twenty-three Immortal Lads of Supreme Harmony, descending to govern within the Mud-Pellet Palace of your body. Then silently intone:\n\n*\"Great Spirit of the Primordial Radiance, the mysterious Dao revolves its essence. At the inception of the celestial reckoning, the myriad qi merge and arise. The Nine Subtleties ascend in transformation, returning to descend upon my form. Preserve and secure my primordial auspiciousness, oversee and unify the numinous powers of the Emperor. Summon the perfected and subdue demons; may my Dao be majestic and luminous. Ascend to Supreme Harmony, filling me with jade mushrooms. Attain communion with the divine and penetrating vision, gazing upon the Three Clarities. May I ride the flying radiance and together ascend to the Imperial Court.\"*\n\nUpon completion, tilt your head back and swallow the eight qi.\n\nThis is the Way of the Primordial Radiance. Practiced for eight years, the clouds of the Three Simplicities and the flying wheels of the Eight Chariots shall come to welcome your body, ascending to the Court of the Imperial Dawn. These are the Eight Dao Secret Invocations of the Primordial Radiance for summoning spirits, not to be transmitted to those who are not immortals.\n\nOn the day of the Spring Equinox, the Heavenly Emperor of the Supreme Tenuity ascends to the Highest Jade Emperor’s banquet, the occasion for the Radiant Dawn’s procession and the day of receiving immortality. On that day, follow the method above. At midnight, face east, knock your teeth nine times, and visualize clouds of dark, azure, and yellow swirling from the northeast. Then silently invoke:\n\n*\"Heavenly Emperor of the Supreme Tenuity, I beseech you to turn your divine chariot and descend upon me. Inscribe my name upon the Emperor’s tablet and bestow upon me the gift of immortality.\"*\n\nUpon completion, visualize once more the Upper Palace of Azure Yang in the east, the Palace of Mysterious Subtlety, where the Great Lord of the Dao of the Radiant Dawn, the Venerable Master, surnamed Yu and named Youxiao, resides. His form measures nine inches, clad in a cord of purple and azure, crowned with a nine-hued penetrating-heaven treasure coronet, and shod in nine-colored shoes. In his hand, he holds the talisman of life and spirit, attended by thirty-six Immortal Lads of the Great Yang. He rides the chariot of the Eight Luminants, a carriage of azure clouds, drawn by verdant dragons, descending to govern within the Hall of Light of your body. Then silently intone:\n\n*\"Primordial Dawn of the Upper Origin, summoning spirits and beckoning the perfected. Receiving the qi and the mandate of the celestial reckoning, following the imperial precedents of the Dao’s canon. The mysterious canopy revolves its essence, feasting in the Jade Dawn above. Return your numen to descend and secure my body. Preserve my essence and refine my qi; may the Five Flowers bloom resplendently. Let the purple qi flow and illuminate, attaining mastery over the divine. May I ride the flying radiance and feast in the jasper pavilion above.\"*\n\nUpon completion, tilt your head back and swallow the nine qi.\n\nThis is the Way of the Radiant Dawn. Practiced for eight years, the flying wheels of the dark clouds shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Radiant Dawn, not to be transmitted to those who are not immortals.\n\nOn the day of the Summer Commencement, the Three Primordial Perfected of the Supreme Ultimate ascend to the banquet in the Palace of Purple Tenuity, the occasion for the Mysterious Radiance’s procession and the day of receiving immortality. On that day, follow the method above. At dawn, face southeast, knock your teeth nine times, and visualize clouds of azure, purple, and yellow swirling from the northwest. Then silently invoke:\n\n*\"Supreme Ultimate of the Great Perfection, Three Primordial Perfected, I beseech you to turn your divine chariots and descend upon my chamber. Inscribe my name upon the jade tablet and make me an immortal.\"*\n\nUpon completion, visualize once more the Upper Palace of Lesser Yang in the southeast, the Palace of Supreme Tenuity, where the Lord of the Dao of the Boundless Mysterious Radiance and Jade Luminance, surnamed Wang and named Wuying, resides. His form measures eight inches and eight fen, clad in a cord of cinnabar brocade, crowned with a jade coronet of boundless advancement, and shod in nine-colored shoes. In his hand, he holds the talisman for summoning spirits, riding the chariot of the Mysterious Radiance and green clouds, a five-colored cloud carriage drawn by phoenixes. He is attended by thirty-nine Immortal Lads of Numinous Flight, descending to govern within the Grotto Chamber of your body. Then silently intone:\n\n*\"Supreme Numen of the Mysterious Radiance, riding the banquet of the eight qi, creating the radiance of the Nine Mysteries, soaring without bounds. Return your perfected essence to descend, dissolving my karmic obstructions. Shelter me with flying clouds, cover me with the purple canopy. May I ride the Eight Luminants and ascend to the celestial heights.\"*\n\nUpon completion, tilt your head back and swallow the eight qi.\n\nThis is the Way of the Mysterious Radiance. Practiced for eight years, the clouds of azure, purple, and yellow, and the green chariot of the Mysterious Radiance shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Mysterious Radiance, not to be transmitted to those who are not immortals.\n\nOn the day of the Summer Solstice, the Great Emperor Lord of Fusang ascends to the banquet in the Palace of Supreme Tenuity, the occasion for the Void Radiance’s procession and the day of receiving immortality. On that day, follow the method above. At dawn, face south, knock your teeth eight times, and visualize clouds of red, white, and azure swirling from the southeast. Then silently invoke:\n\n*\"Great Emperor Lord of Fusang, I beseech you to turn your divine radiance and gaze upon my body. Record my name in the Eastern Florescence and grant me the power to ride the flying mist.\"*\n\nUpon completion, face south once more and visualize the Upper Palace of the Great Yang in the Palace of Purple Tenuity, where the Lord of the Dao of the Void Radiance, the Grand Marshal Yuanxian, surnamed Xuan and named Boshi, resides. His form measures eight inches and eight fen, clad in a cord of crimson brocade, crowned with a jade coronet of celestial brilliance, and shod in nine-colored shoes. In his hand, he holds the talisman for subduing demons, riding the chariot of the Eight Paths of Luminous Radiance, a carriage of red clouds drawn by phoenixes. He is attended by thirty-six Jade Lads of the Crimson Terrace and Upper Palace, descending to govern within the Cinnabar Field of your body’s Central Origin. Then silently intone:\n\n*\"Void Radiance, initiate the numinous, riding the qi in revolving return. Swiftly drive the Eight Paths, emanating luminous majesty. Descend upon my chamber, illuminating my cinnabar splendor. Subdue demons and command spirits; may the myriad numina be vanquished. Grant me penetrating vision of the profound, to soar in radiance with the dawn.\"*\n\nUpon completion, tilt your head back and swallow the eight qi.\n\nThis is the Way of the Void Radiance. Practiced for eight years, the chariot of the Eight Paths of Luminous Radiance shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Void Radiance, not to be transmitted to those who are not immortals.\n\nOn the day of the Autumn Commencement, the Supreme Perfected of Great Simplicity, the White Thearch, ascends to the Jade Heaven to visit the August Perfected of the Mysterious Empyrean—this is the day for the Radiant Void to perform the Dao and receive immortality. On that day, follow the method above: at dawn, face the southwest, knock the teeth twelve times, and visualize white, red, and purple clouds revolving in the due west. Then silently intone:\n\n*\"Perfected of Great Simplicity, I beseech the revolving divine radiance to descend upon my body, that my name may be presented in the Jade Heaven and I be made a Perfected.\"*\n\nUpon completion, visualize within the Palace of Subtle Yang in the Upper Mansion of Lesser Yin in the southwest: the Lord of the Dao of Primordial Radiance of the Great One of the Void, whose surname is Huang and given name Yunzhu, standing seven inches and eight fen tall. He wears a sash of dark yellow plain silk, a Seven Treasures Advancing Wisdom crown upon his head, and nine-colored shoes upon his feet. In his hand he holds the tally of life and spirit, riding a soaring jade chariot with a five-hued canopy of vermilion clouds, drawn by six dragons. Following him are twenty-four jade lads of the Upper Palace of Yellow Simplicity, descending to govern within the Lower Cinnabar Field of your body. Then silently intone:\n\n*\"Supreme Perfected of Primordial Radiance, Mysterious Numinous of the Eight Paths, governing above the Yellow Mother and below my form, your divine chariot lingers in revolving return, streaming radiance through the Purple Clarity. Through cyclic revolutions you command the qi, and the Three Qi blaze with luminosity. You subdue spirits and seize demons; my Dao penetrates the essence. May I long preserve the Upper Radiance and soar as an immortal in eternal life.\"*\n\nUpon completion, tilt your head back and swallow the seven qi.\n\nThis is the Way of the Primordial Radiance. Practiced for eight years, the soaring jade chariot shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Primordial Radiance, not to be transmitted to those who are not immortals.\n\nOn the Autumnal Equinox, the Supreme Perfected of the Southern Culmen, the Red Thearch, ascends to the Terrace of Soaring Winds to attend the feast of the Nine Numinous Ladies—this is the day for the Luminous Radiance to perform the Dao and receive immortality. On that day, follow the method above: at dawn, face the west, knock the teeth twelve times, and visualize green, yellow, and red clouds revolving in the southwest. Then silently intone:\n\n*\"Supreme Perfected of the Southern Culmen, August Thearch of the Upper Sovereign, I beseech the revolving divine radiance to glance down upon my chamber, bestow upon me a jade tablet, and present it to the Nine Numinous, that I may ride the flying radiance and ascend into formlessness.\"*\n\nUpon completion, visualize within the Palace of Subtle Essence in the Upper Mansion of Greater Yin in the due west: the Lord of the Dao of Luminous Harmony, whose surname is Hao and given name Eryi, standing six inches and eight fen tall. He wears a sash of white-patterned plain silk, a Boundless Treasure Heaven crown upon his head, and nine-colored shoes upon his feet. In his hand he holds the jade tally of life-preserving destiny, riding a chariot of crimson jasper and azure jade, drawn by white tigers. Following him are twenty-two jade lads of the Upper Palace of Plain Numinosity, descending to govern within the Canopy Palace of your body. Then silently intone:\n\n*\"Daoist Ancestor of Luminous Radiance, who unifies and governs the Nine Heavens, spreading your vast net through the Purple Empyrean, swiftly driving the Eight Mists, your jade chariot pauses in revolving return to descend upon my body. Illuminate me with radiance and bestow upon me the Golden Perfection. Expansively summon the numinous; may my body know no delay. May I ride the flying radiance and ascend to feast in the dawn of the Empyrean.\"*\n\nUpon completion, tilt your head back and swallow the seven qi.\n\nThis is the Way of the Luminous Radiance. Practiced for eight years, the crimson jasper and azure chariot shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Luminous Radiance, not to be transmitted to those who are not immortals.\n\nOn the day of the Winter Commencement, the Perfected of the Upper Clarity, the Thearch and August Ancestor, ascends to the Supreme Nine Heavens to attend the feast of the Jade Thearch—this is the day for the Penetrating Radiance to perform the Dao and receive immortality. On that day, follow the method above: at dawn, face the northwest, knock the teeth nine times, and visualize green, blue, and purple clouds revolving in the southwest. Then silently intone:\n\n*\"Perfected of the Upper Clarity, Thearch and August Ancestor, I beseech the divine chariot to revolve and descend upon my chamber, bestow upon me a jade name, and present it to the Upper Clarity, that I may ride the flying radiance and ascend into formlessness.\"*\n\nUpon completion, visualize within the Palace of Pure Subtlety in the Upper Mansion of Yin Brilliance in the northwest: the Lord of the Dao of Penetrating Radiance of the Register of Life, whose surname is Xuan and given name Yuanfu, standing five inches and eight fen tall. He wears a sash of dark yellow, a Nine Mysteries Flying Dawn jade crown upon his head, and five-colored shoes upon his feet. In his hand he holds the law of seizing and slaying, riding an eight-radiance cinnabar chariot of mysterious radiance, drawn by a dark warrior. Following him are twenty-four jade lads of the Great Mystery, descending to govern within the Granary of Life Palace of your body. Then silently intone:\n\n*\"August Lord of Penetrating Radiance, Mysterious Numinous of the Yin Spirit, riding the clouds and driving the dragons, your chariot drawn by flying mists, you roam above the Jade Clarity and govern below the Great Mystery. Your purple chariot revolves and descends to enter my body. May I ride the Eight Radiance and stand equal to the Perfected.\"*\n\nUpon completion, tilt your head back and swallow the five qi.\n\nThis is the Way of the Penetrating Radiance. Practiced for eight years, the eight-radiance cinnabar chariot of mysterious radiance shall descend to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Penetrating Radiance, not to be transmitted to those who are not immortals.\n\nOn the Winter Solstice, the Jade Consort of the Great Empyrean, the Supreme Perfected of the Great Void, ascends to the Palace of the Great Sovereign to attend the feast of the Thearch of the Heavenly Apex—this is the day for the Pure Radiance to perform the Dao and receive immortality. On that day, follow the method above: at dawn, face the due north, knock the teeth twelve times, and visualize vermilion, azure, and yellow clouds revolving in the northeast. Then silently intone:\n\n*\"Jade Consort of the Great Empyrean, Supreme Perfected of the Great Void, I beseech the divine chariot to revolve and descend upon my chamber, bestow upon me a jade name, and present it to the Great Empyrean, that I may become a Perfected and feast in the Upper Palace.\"*\n\nUpon completion, visualize within the Palace of the Dao of Subtlety in the Upper Mansion of Yin Essence in the north: the Lord of the Dao of Mysterious Harmony, whose surname is Yu and given name Yinjing, standing five inches and eight fen tall. He wears a sash of five-colored dark clouds, a Mysterious Dawn treasure crown upon his head, and five-colored lion shoes upon his feet. In his hand he holds the tally of summoning the numinous, riding a jade chariot of lingering return, drawn by black-feathered phoenixes. Following him are thirty-six jade lads of the Upper Palace of the Great Mystery, descending to govern within the Mysterious Valley Palace of your body. Then silently intone:\n\nIn clarity and pristine truth, one shares the numinous with the Primordial Beginning, receiving transformation from the Nine Origins, embracing the qi of the Vermilion Infant. The jade chariot lingers in return, roaming freely through the Purple Clarity. Its wheels turn through the eight nodes, its weft aligns with the celestial warp. It erases my death-record, preserving life in the southern birth. I attain the flying radiance, guiding the reins of the green canopy.\n\nUpon completion, swallow the five qi and cease.\n\nThis is the Dao of Clarity and Radiance. Practicing it for eight years will summon the jade chariot of lingering return to descend and receive your body, ascending to the Great Clarity. The eight secret words of Clarity and Radiance must not be transmitted to those who are not immortals.\n\nPracticing the eight secret methods of the *Flying Scripture of the Eight Radiant Scenes*, the Jade Emperor of the Highest Sovereign commands the myriad saints of the ten directions and the numinous immortals of the Five Peaks to all come and protect your body, descending with the mysterious chariot and flying carriage, allowing you to ascend to the Upper Clarity together with the Perfected. The True Sovereign guards your destiny, the Great One defends your body. In all your comings and goings, you shall suffer no calamity or misfortune.\n\nIf your name is not inscribed in the jade registers of immortality, nor recorded in the charts of the Purple Palace of the Netherworld, you must not awaken your heart with this scripture. Once you obtain this scripture, the Eastern Florescence will inscribe your name in its records, and your rank will equal that of the Perfected. Treasure it and keep it secret—do not lightly disclose it. To recklessly reveal these secret words is to invite annihilation upon your family.\n\nFor those who cultivate the *Golden Perfection and Jade Radiance Scripture of the Eight Flying Scenes*, when placing the talismans for summoning the numinous, attracting the Perfected, and subduing demons, one must first face north toward the incense burner, strike the left teeth thirty-six times, and chant the *Chapter of Golden Perfection and the Great Void* once before proceeding.\n\nChanting this single verse will resound through the Nine Heavens, penetrate the Unbounded, and illuminate the Cavernous Origin. The Jade Emperor will heed it in awe, and all demons will be bound. This chapter is supremely wondrous, hence it is called *Golden Perfection*. Its verses say:\n\nHeavenly demons ride the void and arise,\nMyriad spirits tremble in the divine court.\nEntrusting transformation to the chant of songs,\nThey shift and enter the nameless.\nHow clamorous the chaotic qi,\nDefiled paths arise along the way.\nWithin the clouds, the Vermilion Palace converges,\nThe Northern Emperor dispatches divine soldiers.\nSoaring and wheeling, they know the Dao,\nThe mysterious workings come to summon.\nThe upper radiance guides the flying reins,\nThe flying carriage inspects the cloud encampment.\nUrging the Northern Emperor’s records,\nThey gather and seize the names of all demons.\nThe vast expanse unfurls the celestial net,\nUnleashing might, casting the flowing bells.\nGolden Perfection aids the hollow and empty,\nJade radiance shines through the eight darknesses.\nThe Golden Mystery guards the upper palace,\nDivine tigers slay the celestial essences.\nSevering the myriad baleful qi,\nCountless billions all made level.\nUpholding the Nine Heavens’ trust,\nA single whistle commands all to yield.\nSummoning the Perfected, exploring the Three Caverns,\nWisdom recites, clear and resonant.\nGazing at the eight paths toward the mysterious rosy clouds,\nSeven revolutions weave the celestial warp.\nMerging with the Emperor’s singular truth,\nLiberating the seven generations of ancestors.\nErasing the roots of the five sufferings,\nThe returned soul receives glory anew.\nGolden light illuminates the silent chamber,\nDivine candles naturally arise.\nFloral incense scatters through the jade realm,\nMist and qi penetrate the Jade Capital.\nThe Emperor dispatches the lingering chariot,\nThe Three Origins descend with the green canopy.\nThe swift carriage soars through the Nine Mysteries,\nPaying homage at the Jade Emperor’s court.\n\nUpon completion, proceed with your practice. After one recitation, heavenly soldiers will aid the Perfected, the Jade Emperor will subdue demons, your cultivation will ascend, and you will summon the true numinous. Without this chapter, the Dao of immortality cannot be achieved, and heavenly demons will defeat you, bringing harm to your body instead. Thus, it is composed as a chapter—examine it carefully and practice accordingly.\n\nThe talisman for summoning the numinous, attracting the Perfected, and subduing demons is also called the *Trust of the Nine Heavens*.\n\n**Green Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with ink on a green wood tablet, nine inches wide and twelve inches long. Place it on the eastern side of the chamber. Practice reciting the scripture within the chamber for a hundred days, and you will converse with divine beings. After three years, the chamber will naturally generate clouds of blue-green radiance.\n\nTo summon Perfected Ones and heavenly immortals, inscribe the talisman according to the method, place it facing north, and meditate with focus for a hundred days. The Perfected will descend in form, and immortals will visit your chamber to transmit the Dao of divine perfection.\n\nTo subdue demons, inscribe the talisman as above, place it in the center, and chant the *Chapter of the Great Void* once. Then the Northern Emperor will wield his troops, heavenly demons will lose their forms, myriad spirits will vanish, and all within and without will be purified. Additionally, inscribe with ink on a nine-inch piece of blue-green silk and wear it on your body for eight years. The Emperor will descend with the eight chariots of the radiant scenes to welcome your body, ascending in broad daylight to the Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To recklessly disclose or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**Red Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with blue-green ink on a red wood tablet, nine inches wide and twelve inches long. Place it on the southern side of the chamber. Practice reciting the scripture within the chamber for a hundred days, and you will converse with divine beings. After three years, the chamber will naturally generate clouds of red radiance.\n\nTo summon Perfected Ones and heavenly immortals, inscribe the talisman according to the method, place it facing east, and meditate with focus for a hundred days. The Perfected will descend in form, and immortals will visit your chamber to transmit the Dao of divine perfection.\n\nTo subdue demons, inscribe the talisman as above, place it in the west, and chant the *Chapter of the Great Void* once. Then the Northern Emperor will wield his troops, heavenly demons will lose their forms, myriad spirits will vanish, and all within and without will be purified. Additionally, inscribe with blue-green ink on a nine-inch piece of crimson silk and wear it on your body for eight years. The Emperor will descend with the eight chariots of the radiant scenes to welcome your body, ascending to the Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**White Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with yellow ink on a white wood tablet, nine inches wide and twelve inches long. Place it on the western side of the chamber...\n\nIf you wish to subdue demons, inscribe the talisman according to the method and place it on the eastern side. Recite the *Chapter of the Great Void* once, and the Northern Emperor will wield his troops, causing celestial demons to lose their forms, the myriad spirits to extinguish their radiance, and all within and without to become solemnly pure. Additionally, inscribe with yellow ink on a nine-inch piece of white silk and wear it on your body for eight years. The Emperor will descend with the dark radiance of the green chariot to welcome your body, ascending to the Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**Black Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with white ink on a black wood tablet, nine inches wide and twelve inches long. Place it on the northern side of the chamber. Practice reciting the scriptures and enter the chamber for a hundred days, where you will converse with divine beings. After three years, the chamber will naturally generate clouds of black mist. If you wish to summon Perfected Ones and celestial immortals, inscribe the talisman according to the above method and place it in the western direction. Focus your thoughts for a hundred days, and the Perfected Ones will descend in form, while immortals will visit your chamber to transmit the Dao of divine perfection.\n\nIf you wish to subdue demons, inscribe the talisman according to the method and place it on the southern side. Recite the *Chapter of the Great Void* once, and the Northern Emperor will wield his troops, causing celestial demons to lose their forms, the myriad spirits to diminish their radiance, and all within and without to become solemnly pure. Additionally, inscribe with white ink on a nine-inch piece of black silk and wear it on your body for eight years. The Emperor will dispatch the eight chariots of radiant scenes to welcome your body, ascending to the Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**Yellow Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with vermilion ink on a yellow wood tablet, nine inches wide and twelve inches long. Place it in the center of the chamber. Practice reciting the scriptures and enter the chamber for a hundred days, where you will converse with divine beings. After three years, the chamber will naturally generate clouds of yellow mist. If you wish to summon Perfected Ones and celestial immortals, inscribe the talisman according to the above method and place it in the southern direction. Focus your thoughts for a hundred days, and the Perfected Ones will descend in form, while immortals will visit your chamber to transmit the Dao of divine perfection.\n\nIf you wish to subdue demons, inscribe the talisman according to the method and place it on the northern side. Recite the *Chapter of the Great Void* once, and the Northern Emperor will wield his troops, causing celestial demons to lose their forms, the myriad spirits to extinguish their radiance, and all within and without to become solemnly pure. Additionally, inscribe with vermilion ink on a nine-inch piece of yellow silk and wear it on your body for eight years. The Emperor will dispatch the meandering imperial carriage to welcome your body, ascending to the Palace of Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\nOnce all talismans are inscribed, face north and click your teeth thirty-six times, then softly invoke:\n*\"By the mandate of the Nine Heavens, I proclaim to the myriad spirits: three generations succeed one another, the five qi intermingle, the Five Emperors manifest their chariots, guiding the reins in the celestial court. They enact and spread the true Dharma, subdue demons and restrain spirits, sever and slay malevolent omens. The myriad Dao are made equal and level. Those who follow the Dao and later learners—may the Imperial Lords record their names. Summon the Perfected to the hidden depths, where qi merges with the formless, transform radiance and refine the bones, ascend the Dao to the Three Clarities, swiftly ride the chariots, and ascend to the Jade Court.\"*\n\nUpon completion, place the talismans according to their positions, and the Perfected Immortals will descend at once, sparing your body from misfortune. Those who study without this Dao will rarely escape bodily destruction. This may be called the wondrous Dharma—without study, one attains immortality of their own accord.\n\n**The Supreme Talisman of the Seven Luminaries of the Imperial Lord, known as the *August Might Chapter*:**\nThis is the first of the Seven Luminaries, the talisman of the essence of the sun. If you wish to practice reciting scriptures in pursuit of immortality, inscribe with orpiment on fresh green silk and wear it on your body. If you wish to summon Perfected Ones, inscribe with vermilion on white paper, face east, and ingest it. Focus your thoughts for a hundred days, and the Perfected Ones will descend to your chamber to converse with you. If you wish to subdue demons, inscribe with green ink on a nine-inch yellow wood tablet and place it on the monthly cyclical sign. The celestial demons will naturally disperse, and the myriad spirits will restrain their forms. Guard the *August Might Chapter* closely, do not disclose it, and practice it in secret—after seven years, you will ascend as a flying immortal.\n\nThis is the second of the Seven Luminaries, the talisman of the essence of the moon. If you wish to practice reciting scriptures in pursuit of immortality, inscribe with azurite on crimson silk and wear it on your body. If you wish to commune with spirits and summon the divine, inscribe with yellow ink on white paper, face west, and ingest it. Focus your thoughts for a hundred days, and divine beings will descend in form to converse with you. If you wish to subdue demons and restrain spirits, inscribe with black ink on a nine-inch red wood tablet and place it in the northeast. After a hundred days, the Northern Emperor will capture the demons, the Celestial Prime will restrain the spirits, the myriad malevolent omens will be eradicated, and all within and without will be cleansed. Guard the *August Might Chapter* closely, practice it in secret—after seven years, you will ascend as a flying immortal and ascend to heaven in broad daylight.\n\nThis is the third of the Seven Luminaries, the talisman of the essence of Jupiter. If you wish to practice the Dao in pursuit of immortality, inscribe with vermilion on fresh green silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Eastern Marchmount, inscribe with black ink on green paper, face east, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the elixir of divine immortality. If you wish to subdue the demons of the Green Emperor, inscribe with white ink on a nine-inch green wood tablet and place it on the eastern side for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish. Guard the *August Might Chapter* closely, practice it in secret—after seven years, you will ascend as a flying immortal and ascend to heaven in broad daylight.\n\nThis is the fourth of the Seven Luminaries, the talisman of the essence of Venus. If you wish to practice the Dao in pursuit of immortality, inscribe with orpiment on white silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Western Marchmount, inscribe with yellow ink on white paper, face west, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the true scriptures and converse with you. If you wish to subdue the demons of the White Emperor, inscribe with vermilion on a nine-inch white wood tablet and face west for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.\n\nThe Imperial August Chapter, when practiced for seven years, enables transcendence as a divine immortal and ascension to heaven in broad daylight.\n\nThis is the fifth of the Seven Luminaries, the talisman of the essence of Mars. If you wish to practice the Dao in pursuit of immortality, inscribe with orpiment on raw purple silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Southern Marchmount, inscribe with azure ink on red paper, face south, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the divine mushroom and treasure scriptures and converse with you. If you wish to subdue the demons of the Red Emperor, inscribe with black ink on a nine-inch red wood tablet and face south for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.\n\nThe Imperial August Chapter, when practiced for seven years, enables transcendence as a divine immortal and ascension to heaven in broad daylight.\n\nThis is the sixth of the Seven Luminaries, the talisman of the essence of Mercury. If you wish to practice the Dao in pursuit of immortality, inscribe with black ink on yellow silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Northern Marchmount, inscribe with white ink on black paper, face north, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the divine immortals’ medicine and converse with you. If you wish to subdue the demons of the Black Emperor, inscribe with yellow ink on a nine-inch black wood tablet and face north for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.\n\nThe Imperial August Chapter, when practiced for seven years, enables transcendence as a divine immortal, soaring flight, and ascension to heaven in broad daylight.\n\nThis is the seventh of the Seven Luminaries, the talisman of the essence of Saturn. If you wish to practice the Dao in pursuit of immortality, inscribe with vermilion on greenish-blue silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Central Marchmount, inscribe with vermilion on yellow paper, face the Grand Year Star, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to confer upon you the divine immortals’ medicine and the true scriptures of the Five Elders. If you wish to subdue the demons of the Yellow Emperor, inscribe with azure ink on a nine-inch yellow wood tablet and place it beneath the Grand Year Star for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.\n\nThe Highest Jade Emperor, the Primordial August Lord of the Dao, received the talismans of the Seven Luminaries from the Nine Heavens’ Venerable One. These talismans summon the officials of the flying immortals, enable communion with spirits, and allow clear vision. They subdue demons, suppress spirits, wield awe over the ten directions, and unleash fire for ten thousand miles. They grant the power to kill or spare with a thought. When practiced for nine years, one may ride the dark chariot and soar through the Upper Clarity.\n\nTo apply the supreme Dao, cultivate and seek immortality, subdue demons, and command spirits, inscribe the talismans according to the method. Face north, knock the left teeth thirty-six times, and visualize the radiance of the sun, moon, and five stars illuminating your body. Whisper the incantation:\n\n*\"The Seven Luminaries shine forth,\nTheir might flows, their essence radiates,\nLight cast for ten thousand miles,\nDivine brilliance of the Five Spirits.\nAbove, they seize Fengdu,\nRecord the names of ghosts,\nBy the celestial emperor’s decree,\nSever and slay Jia Sheng.\nI am equipped with the Seven Luminaries,\nWielding golden bells of fire,\nWithin, I guard the six palaces,\nWithout, I draw in flowing essence.\nFlying immortals, true ones,\nAttend me in my purification,\nGazing into the empty void,\nThe Three Ways unite in clarity.\nI ride the dark clouds,\nHarnessing the green chariot,\nThe Five Marchmounts escort me,\nConveying me to ascend the Clarity.\"*\n\nWhen finished, apply the talismans according to their positions for seven years, and true immortals will surely descend to confer upon you the treasure scriptures of the Upper Realized Ones.\n\nThose with golden bones and jade names, inscribed in purple in the Upper Clarity, who obtain the talismans for summoning spirits, attracting the Perfected, and subduing demons—the talismans of the Seven Luminaries—will have their names recorded in the Nine Heavens. The Emperor will command the myriad Perfected Ones and the four bureaus’ spirit officials to distinguish and protect their bodies. As they come and go, ascending the Five Marchmounts, immortal officials will welcome and guard them. Ten thousand demons will bow their heads, and all malevolent spirits will lose their essence. After a hundred days of cultivation, they will commune with spirits, and true immortals will descend to confer upon them the true scriptures. Within seven years, they will ride flying chariots, roam the Five Marchmounts, and traverse the Three Clarities.\n\nIf the secret is revealed to three people, the transmission will not be genuine. The seven generations of ancestors, down to oneself, will all be cast into the Mountain of Knives. Among the three disciples, none will be spared for ten thousand kalpas. Those who receive this must guard it in secrecy, as strictly as the Four Brightnesses.\n\nFor all scholars of the supreme learning, even if they achieve the Dao and ascend as immortals, without these scriptures, the Jade Bureau of the Nine Heavens will not dispatch their immortals, the gates of the Celestial Pass will remain closed to them, and the officials of the Five Marchmounts will not guard their bodies. Thus, the trust of the Nine Heavens and the Imperial August Chapter are bestowed only upon those who have already become Perfected Ones and are not circulated in the world. Those who obtain them will become immortals.\n\nThose who hold the left auxiliary insignia, the right attendants of the immortal capital, the jade lads who serve the immortals, and the spirit officials of the five directions who safeguard these scriptures must not treat them lightly or reveal them to the Upper Realized Ones. Violating these prohibitions will result in the destruction of one’s body.\n\nAccording to the ancient statutes, these scriptures are transmitted once in ten thousand kalpas. In the present age, within seven hundred years, only three transmissions are permitted. In accordance with the statutes of the Bright Code, master and disciple must face each other in purification for ninety days, presenting one golden dragon, one jade fish, a hundred feet of purple silk, and three taels of gold to the master who possesses the scriptures. They must swear an oath by the trust of the Nine Heavens. Those who transmit without an alliance will suffer the trials of the wind and blade. Those who receive without sincerity, who belittle the Dao and disdain the Perfected, will be consigned to the ghostly officials, and their transgressions will extend to the seven mysteries. Thus, the statutes of the Four Poles clearly mandate threefold trust. If a master receives the scriptures but does not follow the statutes, using them for other purposes, they will be condemned to the Three Bureaus, forever confined to hell, and never attain immortality.\n\nZhao Boxuan, who once studied under Master Wanshi, achieved the Dao and was to ascend to the Golden Gates. However, lacking the talismans for summoning spirits, attracting the Perfected, and the Seven Luminaries, he was demoted to Mount Rong in an instant. Seven hundred years later, he sought out the Pure and True Youth, received the scriptures according to the alliance, and swore an oath at Mount Weiyu. Now, he has ascended as the Left Bureau Lord of the Upper Clarity.\n\nLord Wang transmitted the scriptures at Mount Yangluo on the morning of the zi hour of the eleventh month. He swore an oath to the Nine Heavens and passed them to the Lady of the Southern Marchmount, who is now sealed within Mount Yangluo.\n\nThe Pine Master of the Southern Marchmount, in the year of Yangshuo, transmitted the scriptures to Gu Xizi at Mount Taihua, instructing him to seal one copy within Mount Wushu.\n\nThe Paulownia-Cypress Perfected, on the twenty-ninth day of the sixth month, bestowed this text upon Xu Yuanyou.\n\nThe *Upper Clarity Golden Perfected Jade Radiance Eight Effulgences Flying Scripture* concludes.\n\n---\n1. According to the colophon of the Dunhuang manuscript: *\"Copied by Wu Zhong, a scribe, on the thirteenth day of the intercalary fifth month in the first year of Ruyi (692).\"* It is thus known to be a Tang manuscript from the reign of Empress Wu.\n2. The following notes only correct errors and omissions in the *Daoist Canon* edition; variant characters are not emended.\n3. The Dunhuang manuscript lacks the character *非* (\"not\"); it is suspected that *非* should read *於* (\"at\").\n4. *\"The Celestial King of Primordial Beginning initiated it in the Supreme Void, transmitting it to the Nine Heavens Venerable, the Grand Perfected, and the Supreme Dao Lord of Great Dao\"*—the Dunhuang manuscript reads: *\"The Nine Heavens Venerable received it in the Supreme Void, transmitting it to the Celestial King of Primordial Beginning, the Vast-Life Grand Perfected, and the Supreme Dao Lord of Great Dao.\"*\n5. *\"者身\"* (\"those who embody\")—the Dunhuang manuscript reads *\"之身\"* (\"this body\").\n6. The character *\"经\"* (\"scripture\") originally appeared as *\"圣\"* (\"sacred\"); emended according to the Dunhuang manuscript.\n7. *\"万遍\"* (\"ten thousand recitations\")—the Dunhuang manuscript reads *\"一遍\"* (\"one recitation\").\n8. The character *\"念\"* (\"recite\") originally appeared as *\"合\"* (\"join\"); emended according to the Dunhuang manuscript.\n9. *\"五华结鲜\"* (\"Five Effulgences bind in freshness\")—the Dunhuang manuscript reads *\"五藏洁鲜\"* (\"Five Viscera purified and fresh\").\n10. *\"西面\"* (\"westward\") originally appeared as *\"西南\"* (\"southwest\"); emended according to the Dunhuang manuscript.\n11. The character *\"如\"* (\"as\") originally appeared as *\"负\"* (\"bear\"); emended according to the Dunhuang manuscript.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清金真玉光八景飞经 经名：上清金真玉光八景飞经。 撰人不详，约出於东晋。 是早期上清派重要经典。 一卷。 底本出处：《正统道藏》正一部。 参校本：敦煌DX1962+2052+P.2728+2848+S.238号抄本#1。 上清金真玉光八景飞经 上相青童君撰 金真玉光太上隐书 九天丈人受太空灵都金真玉光於元始天王，名之八景飞经，广生太真名之八素上经，青真小童名之豁落七元，太上大道君名曰隐书玉诀。 金章同出於九玄之先，目其上篇而四时名焉。 其道高妙，众经之尊，总统万真，匡御群仙，玄符流映，洞明紫晨，秘於九天之上大有之宫，金辉紫殿玉宝琼房。 铸金为简，以撰灵文，刻玉丹书，以明其篇，流光奕奕，辉焕太空，日月侠照，五晨翼灵。 命金华之女、玉晨之童各三千人，侍卫玉文，玉妃典香，灵风扬烟，巨龙毒兽，备守玉阙，琼凤抚翼，神鸾荫玄，众真宴礼，万圣朝轩，玉陛骋盖於霄庭，太帝屈节於几前，玉皇改度以推运，璇玑命斗以回神，唱神州以齐景，变七转以舞天，历三五於神化，散轨度於九玄，策五行以招魂，御豁落以威灵，命八景以登空，摄天魔於金真，披隐书於寂室，咏妙章於无间，理万帝於上上，总群下於生生。 是时建炁之始，九天丈人坐命灵都，携契玉仙，五老上真、三十九帝、上皇先生、万始道君、高圣大神、太上大道君、扶桑大帝旸谷神王、南极上元、紫素三元君、西龟王母、太素三元君，上登上上上紫琼宫玉宝台七映朱房，施檄五帝四方司官，灵都神兵，辅卫上元。 命上仙太和玉女，施金真招灵摄魔之符，置於五方。 太极四真人，诵太空之章，妙唱朗彻，八景齐真，玉光焕霄，豁落洞明，三晨停晖，八风回旌，玄鼓云盖，九炁映灵，三五翼赞，六六合并，蓊蔼玄玄之上，焕赫郁乎太冥，飞香绕日，流电激精，华光交洒，神烛合明，流缅千劫，得妙忘旋。 於是九天丈人即临玄台之上，命左仙侍郎李羽非、监灵使者邓元生，执九色之麾，琼文帝章，告盟四明，启付众真，太上大道君八景飞经金真玉光豁落七元，位登至上，洞游玉清，金仙辅翼，五帝卫灵，启命事悉，云轮骋盖，飞虬整驾，龙超霄际，倏顷之间，亿仙立会，琼轮碧辇，流精蓊蔼，众吹云歌，凤鸣鸾迈，交烟互集，徘徊玄太，萧萧非#2太霞之上，放浪於无涯之外，各返玉虚之馆，豁若灵风之运炁。 太上大道君还登峻层之台，九曲之房，引后圣九玄金阙帝君、上相青君，对斋三月，依盟启受於二君，使各封一通於金阙上宫、方诸青宫。 至大劫之周，三道亏盈，二炁离合，理物有期，承唐之世，阳九放灾，翦除凶勃，搜采上贤。 至此之年，若有修行大洞之真经，精雌一之幽关，施八道以招无，研金华於三元，诵素灵於寂室，策五行以招魂，佩金神之虎文，移七星於天关，掌玄名於帝图，建青录於上清，胞玉秀以结络，含琼胎以内灵，绝世好以长阜，独守默於自然，可得玄授於八景，告妙诀於金真，施招灵於曲宇，置豁落以御神，拔七祖於幽宫，免五苦於刀山，离八难於火乡，灭负石於宿根。 有得此文，超腾九玄，纵迹飞影，洞睹三清。 自无其人，累劫勿传。 《金真玉光八景飞经》，乃生九天之上，无景之先，玄光流映，若无若存，悬精晻蔼，洞曜琼宫，积七千余劫，其文甚明，仰着空玄之上，太虚之中，览亦不测，毁亦不亡，焕赫洞耀，彻照十天。",
      "translated_text": "**The Supreme Clarity Scripture of the Golden Perfection and Jade Radiance of the Eight Luminaries**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants*. Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. One scroll.\n\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n**Collated Editions:** Dunhuang manuscripts DX1962+2052+P.2728+2848+S.238.\n\n---\n\n**The Supreme Clarity Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants**\nComposed by the Most Exalted Azure Youth Lord\n\nThe *Hidden Writ of the Golden Perfection and Jade Radiance* was received by the Nine Heavens Venerable from the Golden Perfection and Jade Radiance of the Numinous Capital of the Great Void, bestowed by the Primordial Heavenly King. It is named the *Scripture of the Eight Luminants*, the *Supreme Scripture of the Eight Purities* by the Great Perfected, the *Expansive Seven Origins* by the Azure Perfected Youth, and the *Hidden Writ of Jade Secrets* by the Most High Great Dao Lord.\n\nThe Golden Chapters emerged before the Nine Mysteries, their upper sections named after the four seasons. This Dao is lofty and wondrous, revered among all scriptures, governing the myriad Perfected, guiding the host of immortals. Its mysterious talismans flow and reflect, illuminating the Purple Dawn. It is concealed within the Palace of Great Abundance above the Nine Heavens, in the Golden Splendor Purple Hall and Jade Treasure Chamber.\n\nForged in gold as tablets to inscribe the numinous text, carved in jade as cinnabar script to clarify its chapters, its radiance shines brilliantly, illuminating the Great Void. Sun and moon flank its light, the Five Dawns assist its numen. Three thousand Jade Radiance Maidens and three thousand Azure Youths are commanded to attend the jade script. Jade consorts tend the incense, divine winds waft the mist. Mighty dragons and venomous beasts guard the jade gates. Phoenixes spread their wings, sacred simurghs shade the mystery. The host of Perfected feast in ritual, the ten thousand sages pay homage. Jade steps bear canopies across the celestial court; the Great Emperor humbles himself before the throne. The Jade Sovereign alters the measures to propel the cycles; the Jade Armillary commands the Dipper to turn the spirits. The divine provinces are sung into harmony; the Seven Transformations dance in the heavens. The Three and Five traverse the numinous transformations; the Nine Mysteries scatter their celestial paths. The Five Phases are marshaled to summon souls; the Expansive Seven are harnessed to command spirits. The Eight Luminants ascend to the void; demons are subdued by the Golden Perfection. The *Hidden Writ* is unveiled in the chamber of stillness; its wondrous verses are chanted in the spaceless. The myriad emperors are governed in the Supreme; the multitudes below are gathered in the ever-generating.\n\nAt the inception of the primordial qi, the Nine Heavens Venerable sat in command of the Numinous Capital. He summoned the Jade Perfected, the Five Elders, the Thirty-Nine Emperors, the Supreme Sovereign Masters, the Myriad Origin Dao Lords, the Lofty Sage Great Spirits, the Most High Great Dao Lord, the Great Emperor of Fusang in the Sun Valley, the Supreme Prime of the Southern Culmen, the Three Primordial Ladies of Purple Purity, the Queen Mother of the Western Tortoise, and the Three Primordial Ladies of Great Purity. Together, they ascended the Sevenfold Crimson Chambers of the Supreme Jade Treasure Terrace in the Purple Jade Palace of the Supreme. Edicts were issued to the Five Emperors and the officials of the four directions. The divine soldiers of the Numinous Capital aided in guarding the Supreme Prime.\n\nThe Most Exalted Jade Maidens of Great Harmony were commanded to deploy the talismans of the Golden Perfection for summoning spirits and subduing demons, placing them in the five directions. The Four Perfected of the Great Ultimate recited the chapters of the Great Void. Their wondrous chanting resonated clearly; the Eight Luminants aligned in perfection. Jade radiance illuminated the heavens; the Expansive Seven shone brilliantly. The Three Dawns paused their splendor; the Eight Winds turned their banners. Dark drums sounded beneath cloud canopies; the Nine Qi reflected the numinous. The Three and Five assisted in praise; the Six Sixes merged in harmony. Profound and obscure above, resplendent and majestic in the Great Obscurity, incense flew around the sun, lightning stirred the essence. Floral radiance intermingled; divine candles merged their light. Flowing through a thousand kalpas, attaining the wondrous and forgetting the cycles.\n\nThereupon, the Nine Heavens Venerable descended upon the Dark Terrace. He commanded the Left Immortal Attendant Li Yufei and the Supervisor of Numinous Envoys Deng Yuansheng to wield the nine-colored banners and the jade script of imperial edicts. They proclaimed the covenant to the Four Luminants, transmitting it to the host of Perfected. The *Eight Luminants Scripture of the Golden Perfection and Jade Radiance* and the *Expansive Seven Origins*, bestowed by the Most High Great Dao Lord, ascended to the supreme rank. They roamed the Jade Clarity, aided by Golden Immortals, guarded by the Five Emperors. The affairs of the mandate were revealed in full. Cloud chariots bore canopies; flying dragons readied their carriages. Dragons soared beyond the heavens; in an instant, billions of immortals assembled. Jade wheels and azure carriages flowed with radiant mist. The host played cloud songs; phoenixes cried and simurghs soared. Mists intermingled and gathered, lingering between the Dark and Supreme. Soughing beyond the Great Rosy Clouds, they wandered beyond the boundless, each returning to their Jade Void abodes, as if moved by the numinous wind’s qi.\n\nThe Most High Great Dao Lord then ascended the towering terrace and the Ninefold Chambers. He summoned the Nine Mysteries Golden Gate Emperor of Later Saints and the Most Exalted Azure Lord. For three months, they fasted in accordance with the covenant, receiving the transmission from the two lords. Each was to seal a copy in the Golden Gate Upper Palace and the Azure Palace of the Square Cauldron.\n\nWhen the great kalpa completes its cycle, the Three Ways wane and wax, the Two Qi part and unite. The governance of beings has its appointed time. In the age of the Tang, the Yang Nine unleashed calamity. Malevolence was eradicated; the worthy were sought. In that year, those who cultivated the *True Scripture of the Great Cavern*, who refined the Dark Pass of the One Feminine, who deployed the Eight Ways to summon the formless, who studied the Golden Floral of the Three Origins, who recited the Pure Numinous in the chamber of stillness, who marshaled the Five Phases to summon souls, who wore the Tiger Script of the Golden Spirit, who shifted the Seven Stars at the Celestial Pass, who grasped the Dark Names in the Emperor’s Chart, who established the Azure Record in the Supreme Clarity, who bound the Jade Embryo to weave the network, who contained the Jade Womb to nurture the inner spirit, who severed worldly attachments to prolong life, who guarded silence in spontaneity—such ones could receive the mysterious transmission of the Eight Luminants, learn the wondrous secrets of the Golden Perfection, deploy the summoning of spirits in secluded chambers, and place the Expansive Seven to command the gods. They would deliver their seven ancestors from the dark palace, free them from the Five Sufferings of the Knife Mountains, escape the Eight Perils of the Fire Realms, and dissolve the burden of stones from past roots.\n\nThose who obtain this scripture transcend the Nine Mysteries, soaring freely with flying shadows, gazing upon the Three Clarities. Without such a person, it must not be transmitted for kalpas.\n\nThe *Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants* was born above the Nine Heavens, before the existence of light. Its mysterious radiance flows and reflects, neither present nor absent, suspended in profound obscurity, illuminating the Jade Palace. Accumulated over seven thousand kalpas, its text is most luminous. Gazing upon it in the Great Void above the Dark Mystery, one cannot fathom it; destroying it, it does not perish. Resplendent and radiant, it shines through the Ten Heavens.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1303,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.057559967041016,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "於是九天丈人以建始元年，岁在东维，天甲吉辰，清斋太空七宝琼台，以金青盟天，请受灵篇，招灵摄魔豁落七元，玄章既测，亦无师宗，不知从何忽然而生。 案文施行，八景见形，光烛琼室，招致万真，於时启命帝皇，群仙莫不诣庭，施俯仰之礼，朝宴玉经也。 此乃九天之帝信，玉皇之威章，左辅执节仙都，右置侍仙玉郎、五方灵官十亿万人，典卫宝文，营辅佩者之身。 依太极四明，万劫一传，秘於九天之上大有之宫，金晖紫殿玉宝琼房，施飞罗自然之帐，玉几金床，玉晨之童，执香侍左，金华之女，散烟於右，太妃侍前，玉仙辅后，玄云紫盖，荫乎堂宇，诸真仙上圣，一月三登行礼。 如是宝诀法告，三五改运，大劫交周，七百年中当行世间。 若有玄名帝简，玉字紫清，金藏玉骨合真之人，听得盟传。 轻泄帝宝，七祖、父母，及兆之身，被考三官，充刀山地狱，三徒之中，万劫不原，奉者详慎。 元始天王启之於空玄之上，以传九天丈人、太真太上大道君#3、青真小童、五老上真、三十九帝、上皇先生、万始道君、南极上元、紫素三元君、西龟王母、太素三元君、太真夫人。 上皇先生以传紫清帝君，万始道君以传黄石先生、三天玉童，太上大道君以传东海小童、紫微夫人、后圣九玄金阙帝君，帝君以付上相青童君、太极四真人、西城王君。 如是宝诀，皆上真口口相传，上相帝君科校撰集施行祝说法度，先后相次，集为宝卷，今封一通於王屋山石室之中。 若有勤尚高志，弃放世荣，登陟灵山，精修苦念，名掌青宫，当得此文，帝君当遣真人玄授兆身。 兆得此文，五帝卫房，招灵摄魔，制精御神，修道诵经，上应九天，无复试败之凶。 按法施用，真人下降，与兆共言，不过七年，乘空而行，九年精感，白日登晨。 上上之道，不传非真。 凡有得《金真玉光八景飞经》者身#4，皆玄挺应会，宿命当仙，每以别室烧香，朝夕礼拜，心存神真玉光紫炁，满於斋堂之中，躬礼崇奉，如眼对神，帝遣金华之女、玉晨之童各二十四人，侍卫兆身，赏功罚过，分别善恶也。 又有左右水火二官，纠察漏泄，违科犯禁，罚以风刀之考，愆连七祖。 生死之科，明慎修行。 凡修学上道，入山登斋，诵咏灵章，而无此文，施安招灵摄魔之符、豁落七元上法，不得妄动於玉篇，真不为降，天魔犯身。 故此文为九天之信，玉皇之章，无信而行，因致道真不得，轻以短见诵咏求仙，积劳无感，反收祸殃，三官执考，灭兆之身。 兆欲修道，当备众经#5，令部数充足，上下相成，俯仰之格，施行合度，斋诵万遍#6，得真人降房，克日成仙，不必万遍，正在精研。 有佩招灵摄魔豁落七元之符，皆太一定生，司命改年，主录校籍，注上太玄，普告四司五帝灵官，五岳九河神仙万灵，皆稽首奉迎，营卫兆身。 此上帝真皇章信，故得制神使灵也。 凡行此道，不得至冒淹入秽，履生死之污。 犯此之禁，真灵高逝，反正上宫，施名不制，反误兆身，子得其法，慎此为先。 立春之日，三素元君上诣天皇，太帝游宴之时，元景行道受仙之日也。 兆修《金真玉光八景飞经》之法，当以其日沐浴斋戒，清朝入室，烧香行礼，施安招灵致真摄魔之符，置於五方，兆於中央，东北向，叩齿十二通，仰思紫、绿、白三色之云，东北而回，便心念#7微言：三素元君，乞回神驾，下降我身，右别我名，赐我神仙。",
      "translated_text": "In the first year of Jian Shi, when the year lay in the Eastern Pivot and the celestial stems aligned in auspicious conjunction, the Nine Heavens Venerable One purified the Seven Treasures Jade Terrace in the Great Void. With a covenant of gold and azure, he invoked the heavens to receive the numinous scripture, summoning spirits and subduing demons through the Seven Radiant Ones of the Vast Expanse. Once the mysterious chapters were fathomed, no master or lineage was known—it arose suddenly, inexplicably. Upon enacting its text, the Eight Luminants manifested in form, their light illuminating the jade chamber and beckoning the myriad perfected beings. At that moment, the Emperor of Heaven issued his decree, and none among the host of immortals failed to attend his court, offering reverence in prostration and paying homage to the Jade Scripture.\n\nThis is the celestial pledge of the Nine Heavens’ Emperor, the majestic writ of the Jade Sovereign. To his left, the Left Auxiliary bore the staff of the Immortal Capital; to his right stood the Jade Gentlemen of the Attendant Immortals, along with ten billion myriad spirit officials of the Five Directions, charged with safeguarding the sacred text and aiding those who wore its talismans. In accordance with the Four Luminants of the Supreme Ultimate, it was transmitted once in ten thousand kalpas, concealed within the Palace of Great Abundance above the Nine Heavens—the Golden Radiance Purple Hall, the Jade Treasure Chamber—where natural flying nets draped the chamber, jade tables and golden couches stood arrayed. Jade Morn’s youths held incense to the left, Golden Flower’s maidens scattered mist to the right; the Grand Consort attended before, Jade Immortals flanked behind. A canopy of dark clouds and purple shade sheltered the hall, while the perfected immortals and exalted sages ascended thrice monthly to perform their rites.\n\nSuch were the precious instructions and divine decrees: when the Three and Five altered the course of destiny and the great kalpas turned in their cycles, this scripture was to be revealed in the world for seven hundred years. Only those whose names were inscribed in the Emperor’s register, whose jade characters shone in Purple Clarity, whose golden storehouses and jade bones harmonized with the True—only they were permitted to receive its covenant transmission. To lightly divulge the Emperor’s treasure would subject one’s seven ancestors, parents, and self to the Three Offices’ judgment, consigning them to the Knife Mountain Hell, where for ten thousand kalpas there would be no reprieve. Let those who receive it exercise utmost caution.\n\nThe Celestial Venerable of Primordial Beginning revealed it in the Void of Supreme Mystery, transmitting it to the Nine Heavens Venerable One, the Supreme Perfected of the Great Dao, the Azure Perfected Youth, the Five Elders of the Upper Perfected, the Thirty-Nine Emperors, the Venerable Master of the Supreme Sovereign, the Lord of Myriad Beginnings, the Upper Prime of the Southern Culmen, the Three Primordial Ladies of Purple Simplicity, the Queen Mother of the Western Tortoise, the Three Primordial Ladies of Supreme Simplicity, and the Lady of Supreme Perfection. The Venerable Master of the Supreme Sovereign transmitted it to the Purple Clarity Emperor Lord; the Lord of Myriad Beginnings to the Venerable Master of the Yellow Stone and the Three Heavens Jade Youths; the Supreme Perfected of the Great Dao to the Eastern Sea Youth, the Lady of Purple Tenuity, and the Golden Watchtower Emperor Lord of the Nine Mysteries of the Latter Sage. The Emperor Lord entrusted it to the Minister of the Upper Prime, the Azure Youth, the Four Perfected of the Supreme Ultimate, and the Lord of the Western City. Thus, the precious instructions were passed mouth-to-mouth among the exalted perfected, compiled and enacted by the Minister Emperor Lord, who arranged the liturgies and expounded the Dharma. In due succession, they were gathered into a sacred scroll, one copy of which was sealed within the stone chamber of Mount Wangwu.\n\nShould there be one of lofty aspiration and earnest devotion, who forsakes worldly glory, ascends the numinous mountain, and cultivates with diligent austerity—whose name is recorded in the Azure Palace—such a one shall receive this scripture, and the Emperor Lord shall dispatch perfected beings to secretly transmit it to their person. Once obtained, the Five Emperors shall guard their chamber, summoning spirits and subduing demons, mastering essence and governing spirits. Through cultivation and recitation of the scripture, they shall ascend to correspond with the Nine Heavens, free from the misfortune of trial and failure. By enacting its methods, perfected beings shall descend to converse with them, and within seven years, they shall traverse the void; after nine years of devoted practice, they shall ascend in broad daylight.\n\nThe supreme Way is not transmitted to the untrue. All who receive *The Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants* are divinely ordained, their past lives destined for immortality. They must burn incense in a separate chamber, bowing morning and evening, their hearts filled with the presence of the divine perfected, the Jade Radiance, and the Purple Qi, suffusing the hall of purification. In reverent devotion, as if gazing upon the gods themselves, the Emperor shall dispatch twenty-four maidens of Golden Flower and twenty-four youths of Jade Morn to attend and protect them, rewarding merit and punishing transgression, discerning good from evil. Moreover, the Water and Fire Officials of the Left and Right shall scrutinize any leaks or violations of the statutes, meting out punishment with the Wind-Knife’s trial, extending guilt to the seven ancestors.\n\nThe statutes of life and death demand vigilance in cultivation. Those who study the supreme Way, entering the mountains to fast and recite the numinous chapters without this scripture, who recklessly employ the talismans for summoning spirits, subduing demons, and the Seven Radiant Ones of the Vast Expanse, shall not presume to invoke the Jade Scripture. The perfected shall not descend, and celestial demons shall assail their person. For this scripture is the pledge of the Nine Heavens’ Emperor, the writ of the Jade Sovereign. To act without its mandate is to fail in attaining the Dao; to recite it with shallow intent in pursuit of immortality is to labor in vain, inviting calamity instead. The Three Offices shall seize and punish, extinguishing the self.\n\nThose who wish to cultivate the Dao must prepare the full complement of scriptures, ensuring their completeness and coherence, their rituals and enactments in proper measure. After ten thousand recitations, perfected beings shall descend to their chamber, and they shall attain immortality on the appointed day—though not necessarily after ten thousand recitations, for it lies in the depth of their devotion. Those who wear the talismans for summoning spirits, subduing demons, and the Seven Radiant Ones of the Vast Expanse shall be born under the Supreme Unity, their lifespans altered by the Controller of Destinies, their names recorded in the registers of the Supreme Mystery. Proclaimed to the Four Offices, the Five Emperors, the spirit officials, the Five Marchmounts, the Nine Rivers, and the myriad numinous beings, all shall bow in reverence and protection of their person. This is the true imperial writ of the Celestial Sovereign, by which spirits are commanded and numinous powers are wielded.\n\nIn practicing this Way, one must not rashly enter defiled or polluted places, nor tread the filth of life and death. To violate this prohibition is to drive the perfected spirits away, returning them to the Upper Palace, where their names shall no longer exert control, bringing harm upon the self. Let those who receive this teaching take heed above all else.\n\nOn the day of the Beginning of Spring, when the Three Primordial Ladies of Simplicity ascend to the Celestial Sovereign and the Supreme Thearch holds his celestial feast, it is the day of the Primordial Radiance’s procession, the occasion for receiving immortality. Those who cultivate the methods of *The Scripture of the Golden Perfection and Jade Radiance of the Eight Luminants* must bathe and fast on that day, entering their chamber at dawn to burn incense and perform the rites. They shall arrange the talismans for summoning spirits, beckoning the perfected, and subduing demons in the Five Directions, standing at the center facing the northeast. Knocking their teeth twelve times, they shall visualize clouds of purple, green, and white swirling from the northeast, then silently invoke: *\"Three Primordial Ladies of Simplicity, I beseech you to turn your divine chariots and descend upon me. Inscribe my name anew and bestow upon me the gift of immortality.\"*",
      "overlap_context": " Golden Perfection and Jade Radiance of the Eight Luminants* was born above the Nine Heavens, before the existence of light. Its mysterious radiance flows and reflects, neither present nor absent, suspended in profound obscurity, illuminating the Jade Palace. Accumulated over seven thousand kalpas, its text is most luminous. Gazing upon it in the Great Void above the Dark Mystery, one cannot fathom it; destroying it, it does not perish. Resplendent and radiant, it shines through the Ten Heavens.",
      "start_char": 1303,
      "end_char": 2596,
      "start_sentence": 25,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.93098831176758,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "毕，还思东北清微上府始阳宫中，元景司空司录道君，姓葛，讳 太咒献，形长七寸八分，身着玄黄之绶，头冠七色耀天玉冠，足蹑五色之履，手执威神之策，乘八景之舆，飞龟玄云之车，骖驾青龙，从太和仙童二十三人，下治兆身泥丸官中，乃微祝曰： 元景大神，玄道回精，上节告始，万炁混生，九微上化，回降我形，保固元吉，监总帝灵，招真制魔，我道威明，上致太和，玉芝充盈，通神彻视，洞睹三清，得乘飞景，俱升帝庭。 毕，仰咽八炁。 此元景之道，行之八年，则三素之云、八舆飞轮，迎兆之身，上升帝晨。 所谓八道元景招灵秘言，不传非仙之人。 春分之日，太微天帝君上诣高上玉皇游宴之时，始景行道受仙之日也。 至其日，如上法，夜半东向，叩齿九通，仰思玄、青、黄三色之云，东北而回，便心念微言：太微天帝君，乞回神驾，下降我身，上我帝简，赐我神仙。 毕，还思东方青阳上府玄微宫中，始景老子大道君，姓羽，讳 幽窕，形长九寸，身着紫青之绶，头戴九色通天宝冠，足蹑九色之履，手执命神之章，从太阳仙童三十六人，乘八景之舆，青云之车，骖驾苍龙，下治兆身明堂宫中，仍微祝曰： 始景上元，招灵致真，承炁命节，法典帝先，回精玄盖，上宴玉晨，回灵下降，镇固我身，保精炼炁，五华结鲜#8，紫炁流映，洞得御神，骖乘飞景，上宴琼轩。 毕，仰咽九炁。 此始景之道，行之八年，则玄云飞轮来迎兆身，上升太清。 八道始景秘言，勿传非仙之人。 立夏之日，太极上真三元真人上诣紫微宫游宴之时，玄景行直受仙之日也。 至其日，如上法，清旦东南向，叩齿九通，仰思青、紫、黄三色之云，西北回，便心念微言：太极上真，三元真人，乞回神驾，下降我房，书我玉名，使我神仙。 毕，还思东南少阳上府太微宫中，玄景玉光无极道君，姓王，讳 无英，形长八寸八分，身着丹锦之绶，头戴无极进贤玉冠，足蹑九色之履，手执招灵之章，乘玄景绿舆，五色云车，骖驾凤凰，从灵飞仙童三十九人，下治兆身洞房宫中，仍微祝曰： 玄景上灵，骖宴八炁，造景九玄，翱翔无外，回真下降，解我宿滞，荫以飞云，覆以紫盖，得乘八景，上升霄际。 毕，仰咽八炁止。 此玄景之道，行之八年，则紫、青、黄三色之云，玄景绿舆来迎兆身，上升太清。 玄景八道秘言，勿传非仙之人。 夏至之日，扶桑公太帝君上诣太微宫游宴之时也，虚景行道受仙之日。 至其日，如上法，清旦南向，叩齿八通，仰思赤、白、青三色之云，东南而回，便心念微言：扶桑大帝君，乞回神光，下盼兆身，记名东华，得乘飞烟。 毕，还南向，思太阳上府紫微宫中，虚景太尉元先道君，姓玄，讳 伯史，形长八寸八分，身着绛锦丹绶，头戴平天曜精玉冠，足蹑九色之履，手执制魔之章，乘光明八道之舆，赤云之车，骖驾凤凰，从丹台上宫玉童三十六人，下治兆身中元丹田宫中，仍微祝曰： 虚景启灵，乘炁旋回，迅驾八道，光明吐威，下降我房，映我丹辉，摄魔御神，万灵悉摧，使我洞幽，与景斋飞。 毕，仰咽八炁止。 此虚景之道，行之八年，则致光明八道之舆，来迎兆身，上升太清。 虚景八道秘言，勿传非仙之人也。",
      "translated_text": "Upon completion, visualize once more the Upper Palace of Pristine Subtlety in the northeast, the Palace of Primordial Yang, where the Lord of the Dao of the Primordial Radiance, Controller of Emptiness and Recorder of Destinies, surnamed Ge and named Taizhou Xian, resides. His form measures seven inches and eight fen, clad in a cord of dark yellow, crowned with a seven-hued luminous jade coronet, and shod in five-colored shoes. In his hand, he holds the staff of awe-inspiring power, riding the chariot of the Eight Luminants, a carriage of soaring tortoise and dark clouds, drawn by azure dragons. He is attended by twenty-three Immortal Lads of Supreme Harmony, descending to govern within the Mud-Pellet Palace of your body. Then silently intone:\n\n*\"Great Spirit of the Primordial Radiance, the mysterious Dao revolves its essence. At the inception of the celestial reckoning, the myriad qi merge and arise. The Nine Subtleties ascend in transformation, returning to descend upon my form. Preserve and secure my primordial auspiciousness, oversee and unify the numinous powers of the Emperor. Summon the perfected and subdue demons; may my Dao be majestic and luminous. Ascend to Supreme Harmony, filling me with jade mushrooms. Attain communion with the divine and penetrating vision, gazing upon the Three Clarities. May I ride the flying radiance and together ascend to the Imperial Court.\"*\n\nUpon completion, tilt your head back and swallow the eight qi.\n\nThis is the Way of the Primordial Radiance. Practiced for eight years, the clouds of the Three Simplicities and the flying wheels of the Eight Chariots shall come to welcome your body, ascending to the Court of the Imperial Dawn. These are the Eight Dao Secret Invocations of the Primordial Radiance for summoning spirits, not to be transmitted to those who are not immortals.\n\nOn the day of the Spring Equinox, the Heavenly Emperor of the Supreme Tenuity ascends to the Highest Jade Emperor’s banquet, the occasion for the Radiant Dawn’s procession and the day of receiving immortality. On that day, follow the method above. At midnight, face east, knock your teeth nine times, and visualize clouds of dark, azure, and yellow swirling from the northeast. Then silently invoke:\n\n*\"Heavenly Emperor of the Supreme Tenuity, I beseech you to turn your divine chariot and descend upon me. Inscribe my name upon the Emperor’s tablet and bestow upon me the gift of immortality.\"*\n\nUpon completion, visualize once more the Upper Palace of Azure Yang in the east, the Palace of Mysterious Subtlety, where the Great Lord of the Dao of the Radiant Dawn, the Venerable Master, surnamed Yu and named Youxiao, resides. His form measures nine inches, clad in a cord of purple and azure, crowned with a nine-hued penetrating-heaven treasure coronet, and shod in nine-colored shoes. In his hand, he holds the talisman of life and spirit, attended by thirty-six Immortal Lads of the Great Yang. He rides the chariot of the Eight Luminants, a carriage of azure clouds, drawn by verdant dragons, descending to govern within the Hall of Light of your body. Then silently intone:\n\n*\"Primordial Dawn of the Upper Origin, summoning spirits and beckoning the perfected. Receiving the qi and the mandate of the celestial reckoning, following the imperial precedents of the Dao’s canon. The mysterious canopy revolves its essence, feasting in the Jade Dawn above. Return your numen to descend and secure my body. Preserve my essence and refine my qi; may the Five Flowers bloom resplendently. Let the purple qi flow and illuminate, attaining mastery over the divine. May I ride the flying radiance and feast in the jasper pavilion above.\"*\n\nUpon completion, tilt your head back and swallow the nine qi.\n\nThis is the Way of the Radiant Dawn. Practiced for eight years, the flying wheels of the dark clouds shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Radiant Dawn, not to be transmitted to those who are not immortals.\n\nOn the day of the Summer Commencement, the Three Primordial Perfected of the Supreme Ultimate ascend to the banquet in the Palace of Purple Tenuity, the occasion for the Mysterious Radiance’s procession and the day of receiving immortality. On that day, follow the method above. At dawn, face southeast, knock your teeth nine times, and visualize clouds of azure, purple, and yellow swirling from the northwest. Then silently invoke:\n\n*\"Supreme Ultimate of the Great Perfection, Three Primordial Perfected, I beseech you to turn your divine chariots and descend upon my chamber. Inscribe my name upon the jade tablet and make me an immortal.\"*\n\nUpon completion, visualize once more the Upper Palace of Lesser Yang in the southeast, the Palace of Supreme Tenuity, where the Lord of the Dao of the Boundless Mysterious Radiance and Jade Luminance, surnamed Wang and named Wuying, resides. His form measures eight inches and eight fen, clad in a cord of cinnabar brocade, crowned with a jade coronet of boundless advancement, and shod in nine-colored shoes. In his hand, he holds the talisman for summoning spirits, riding the chariot of the Mysterious Radiance and green clouds, a five-colored cloud carriage drawn by phoenixes. He is attended by thirty-nine Immortal Lads of Numinous Flight, descending to govern within the Grotto Chamber of your body. Then silently intone:\n\n*\"Supreme Numen of the Mysterious Radiance, riding the banquet of the eight qi, creating the radiance of the Nine Mysteries, soaring without bounds. Return your perfected essence to descend, dissolving my karmic obstructions. Shelter me with flying clouds, cover me with the purple canopy. May I ride the Eight Luminants and ascend to the celestial heights.\"*\n\nUpon completion, tilt your head back and swallow the eight qi.\n\nThis is the Way of the Mysterious Radiance. Practiced for eight years, the clouds of azure, purple, and yellow, and the green chariot of the Mysterious Radiance shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Mysterious Radiance, not to be transmitted to those who are not immortals.\n\nOn the day of the Summer Solstice, the Great Emperor Lord of Fusang ascends to the banquet in the Palace of Supreme Tenuity, the occasion for the Void Radiance’s procession and the day of receiving immortality. On that day, follow the method above. At dawn, face south, knock your teeth eight times, and visualize clouds of red, white, and azure swirling from the southeast. Then silently invoke:\n\n*\"Great Emperor Lord of Fusang, I beseech you to turn your divine radiance and gaze upon my body. Record my name in the Eastern Florescence and grant me the power to ride the flying mist.\"*\n\nUpon completion, face south once more and visualize the Upper Palace of the Great Yang in the Palace of Purple Tenuity, where the Lord of the Dao of the Void Radiance, the Grand Marshal Yuanxian, surnamed Xuan and named Boshi, resides. His form measures eight inches and eight fen, clad in a cord of crimson brocade, crowned with a jade coronet of celestial brilliance, and shod in nine-colored shoes. In his hand, he holds the talisman for subduing demons, riding the chariot of the Eight Paths of Luminous Radiance, a carriage of red clouds drawn by phoenixes. He is attended by thirty-six Jade Lads of the Crimson Terrace and Upper Palace, descending to govern within the Cinnabar Field of your body’s Central Origin. Then silently intone:\n\n*\"Void Radiance, initiate the numinous, riding the qi in revolving return. Swiftly drive the Eight Paths, emanating luminous majesty. Descend upon my chamber, illuminating my cinnabar splendor. Subdue demons and command spirits; may the myriad numina be vanquished. Grant me penetrating vision of the profound, to soar in radiance with the dawn.\"*\n\nUpon completion, tilt your head back and swallow the eight qi.\n\nThis is the Way of the Void Radiance. Practiced for eight years, the chariot of the Eight Paths of Luminous Radiance shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Void Radiance, not to be transmitted to those who are not immortals.",
      "overlap_context": "form the rites. They shall arrange the talismans for summoning spirits, beckoning the perfected, and subduing demons in the Five Directions, standing at the center facing the northeast. Knocking their teeth twelve times, they shall visualize clouds of purple, green, and white swirling from the northeast, then silently invoke: *\"Three Primordial Ladies of Simplicity, I beseech you to turn your divine chariots and descend upon me. Inscribe my name anew and bestow upon me the gift of immortality.\"*",
      "start_char": 2596,
      "end_char": 3827,
      "start_sentence": 51,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.210427045822144,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "立秋之日，太素上真白帝君上诣玉天玄皇高真也，元景行道受仙之日。 至其日，如上法，清旦西南向，叩齿十二通，仰思白、赤、紫三色之云，正西而回，便心念微言：太素真人，乞回神光，下降兆身，奏名玉天，得为真人。 毕，思西南少阴上府灵微阳宫之中，元景太一淡天道君，姓黄，讳 运珠，形长七寸八分，着玄黄素绶，头带七宝进贤之冠，足蹑九色之履，手执命神之策，乘翛条玉辇，五彩朱盖紫云之车，骖驾六龙，从黄素上宫仙童二十四人，治兆身下丹田宫中，仍微祝曰： 元景上真，八道玄灵，上治黄母，下治兆形，徘徊神辇，流映紫清，历运御气，三炁焕明，制神摄魔，我道洞精，长保上景，飞仙长生。 毕，仰咽七炁止。 此元景之道，行之八年，则致翛条玉辇来迎兆身，上升太清。 元景八道秘言，勿传非仙之人。 秋分之日，南极上真赤帝君上诣阆风台，诣九灵夫人游宴之时也，明景行道受仙之日。 至其日，如上法，清旦西向，叩齿十二通，仰思青、黄、赤三色之云，西南而回，便心念微言：南极上真，上皇赤帝君，乞回神光，下盼兆房，赐书玉简，上奏九灵，得乘飞景，升入无形。 毕，思正西太阴上府精微兑宫中，明景太和道君，姓浩，讳 二仪，形长六寸八分，身着白文素灵之绶，头戴无极宝天之冠，足蹑九色之履，手执度命保生玉章，乘绛琳碧辇，白云之车，骖驾白虎，从素灵上宫玉童二十二人，下治兆身华盖宫中，仍微祝曰： 明景道宗，总统九天，弘络紫霄，迅御八烟，回停玉辇，下降我身，启以光明，授以金真，豁落招灵，身无稽延，得乘飞景，上晏霄晨。 毕，仰咽七炁止。 此明景之道，行之八年，则致绛琳碧舆来迎兆身，上升太清。 明景八道秘言，勿传非仙之人。 立冬之日，上清真人帝君皇祖上诣高上九天，玉帝游宴之时也，洞景行道受仙之日也。 至其日，如上法，清旦西北向，叩齿九通，仰思绿、青、紫三色之云，西南回，便心念微言：上清真人，帝君皇祖，乞回神驾，下降兆房，赐书玉名，上奏上清，得乘飞景，升入无形。 毕，思西北阴晖上府清微中宫，洞景司录太阳道君，姓玄，讳 元辅，形长五寸八分，身着玄黄之绶，头戴九玄飞晨玉冠，足蹑五色之履，手执摄杀之律，乘玄景八光丹辇，紫云之车，骖驾玄武，从太玄仙童二十四人，下治兆身仓命宫中，仍微祝曰： 洞景帝尊，玄灵阴神，乘霞御龙，骖驾飞烟，上游玉清，下治太玄，回降紫辇，来入我身，得乘八景，位同真人。 毕，仰咽五炁止。 此洞景之道，行之八，则致玄景八光丹辇，下迎兆身，上升太清。 洞景八道秘言，勿传非仙之人。 冬至之日，太霄玉妃太虚上真人上诣太皇宫，太微天帝君游宴之时，清景行道受仙之日也。 至其日，如上法，清旦正北向，叩齿十二通，仰思朱、碧、黄三色之云，东北而回，便心念微言：太霄玉妃，太虚真人，乞回神驾，下降我房，赐书玉名，奏上太霄，得为真人，游宴上宫。 毕，思北方阴精上府道微宫中，谏议玄和道君，姓玉，讳 阴精，形长五寸八分，身着玄云五色之绶，头戴玄晨宝冠，足蹑五色狮子之履，手执招灵之策，乘徘徊玉辇，锦云之炁珠玉之车，骖驾玄凤黑翮，从太玄上宫仙童三十六人，下治兆身玄谷宫中，仍微祝曰：",
      "translated_text": "On the day of the Autumn Commencement, the Supreme Perfected of Great Simplicity, the White Thearch, ascends to the Jade Heaven to visit the August Perfected of the Mysterious Empyrean—this is the day for the Radiant Void to perform the Dao and receive immortality. On that day, follow the method above: at dawn, face the southwest, knock the teeth twelve times, and visualize white, red, and purple clouds revolving in the due west. Then silently intone:\n\n*\"Perfected of Great Simplicity, I beseech the revolving divine radiance to descend upon my body, that my name may be presented in the Jade Heaven and I be made a Perfected.\"*\n\nUpon completion, visualize within the Palace of Subtle Yang in the Upper Mansion of Lesser Yin in the southwest: the Lord of the Dao of Primordial Radiance of the Great One of the Void, whose surname is Huang and given name Yunzhu, standing seven inches and eight fen tall. He wears a sash of dark yellow plain silk, a Seven Treasures Advancing Wisdom crown upon his head, and nine-colored shoes upon his feet. In his hand he holds the tally of life and spirit, riding a soaring jade chariot with a five-hued canopy of vermilion clouds, drawn by six dragons. Following him are twenty-four jade lads of the Upper Palace of Yellow Simplicity, descending to govern within the Lower Cinnabar Field of your body. Then silently intone:\n\n*\"Supreme Perfected of Primordial Radiance, Mysterious Numinous of the Eight Paths, governing above the Yellow Mother and below my form, your divine chariot lingers in revolving return, streaming radiance through the Purple Clarity. Through cyclic revolutions you command the qi, and the Three Qi blaze with luminosity. You subdue spirits and seize demons; my Dao penetrates the essence. May I long preserve the Upper Radiance and soar as an immortal in eternal life.\"*\n\nUpon completion, tilt your head back and swallow the seven qi.\n\nThis is the Way of the Primordial Radiance. Practiced for eight years, the soaring jade chariot shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Primordial Radiance, not to be transmitted to those who are not immortals.\n\nOn the Autumnal Equinox, the Supreme Perfected of the Southern Culmen, the Red Thearch, ascends to the Terrace of Soaring Winds to attend the feast of the Nine Numinous Ladies—this is the day for the Luminous Radiance to perform the Dao and receive immortality. On that day, follow the method above: at dawn, face the west, knock the teeth twelve times, and visualize green, yellow, and red clouds revolving in the southwest. Then silently intone:\n\n*\"Supreme Perfected of the Southern Culmen, August Thearch of the Upper Sovereign, I beseech the revolving divine radiance to glance down upon my chamber, bestow upon me a jade tablet, and present it to the Nine Numinous, that I may ride the flying radiance and ascend into formlessness.\"*\n\nUpon completion, visualize within the Palace of Subtle Essence in the Upper Mansion of Greater Yin in the due west: the Lord of the Dao of Luminous Harmony, whose surname is Hao and given name Eryi, standing six inches and eight fen tall. He wears a sash of white-patterned plain silk, a Boundless Treasure Heaven crown upon his head, and nine-colored shoes upon his feet. In his hand he holds the jade tally of life-preserving destiny, riding a chariot of crimson jasper and azure jade, drawn by white tigers. Following him are twenty-two jade lads of the Upper Palace of Plain Numinosity, descending to govern within the Canopy Palace of your body. Then silently intone:\n\n*\"Daoist Ancestor of Luminous Radiance, who unifies and governs the Nine Heavens, spreading your vast net through the Purple Empyrean, swiftly driving the Eight Mists, your jade chariot pauses in revolving return to descend upon my body. Illuminate me with radiance and bestow upon me the Golden Perfection. Expansively summon the numinous; may my body know no delay. May I ride the flying radiance and ascend to feast in the dawn of the Empyrean.\"*\n\nUpon completion, tilt your head back and swallow the seven qi.\n\nThis is the Way of the Luminous Radiance. Practiced for eight years, the crimson jasper and azure chariot shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Luminous Radiance, not to be transmitted to those who are not immortals.\n\nOn the day of the Winter Commencement, the Perfected of the Upper Clarity, the Thearch and August Ancestor, ascends to the Supreme Nine Heavens to attend the feast of the Jade Thearch—this is the day for the Penetrating Radiance to perform the Dao and receive immortality. On that day, follow the method above: at dawn, face the northwest, knock the teeth nine times, and visualize green, blue, and purple clouds revolving in the southwest. Then silently intone:\n\n*\"Perfected of the Upper Clarity, Thearch and August Ancestor, I beseech the divine chariot to revolve and descend upon my chamber, bestow upon me a jade name, and present it to the Upper Clarity, that I may ride the flying radiance and ascend into formlessness.\"*\n\nUpon completion, visualize within the Palace of Pure Subtlety in the Upper Mansion of Yin Brilliance in the northwest: the Lord of the Dao of Penetrating Radiance of the Register of Life, whose surname is Xuan and given name Yuanfu, standing five inches and eight fen tall. He wears a sash of dark yellow, a Nine Mysteries Flying Dawn jade crown upon his head, and five-colored shoes upon his feet. In his hand he holds the law of seizing and slaying, riding an eight-radiance cinnabar chariot of mysterious radiance, drawn by a dark warrior. Following him are twenty-four jade lads of the Great Mystery, descending to govern within the Granary of Life Palace of your body. Then silently intone:\n\n*\"August Lord of Penetrating Radiance, Mysterious Numinous of the Yin Spirit, riding the clouds and driving the dragons, your chariot drawn by flying mists, you roam above the Jade Clarity and govern below the Great Mystery. Your purple chariot revolves and descends to enter my body. May I ride the Eight Radiance and stand equal to the Perfected.\"*\n\nUpon completion, tilt your head back and swallow the five qi.\n\nThis is the Way of the Penetrating Radiance. Practiced for eight years, the eight-radiance cinnabar chariot of mysterious radiance shall descend to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Penetrating Radiance, not to be transmitted to those who are not immortals.\n\nOn the Winter Solstice, the Jade Consort of the Great Empyrean, the Supreme Perfected of the Great Void, ascends to the Palace of the Great Sovereign to attend the feast of the Thearch of the Heavenly Apex—this is the day for the Pure Radiance to perform the Dao and receive immortality. On that day, follow the method above: at dawn, face the due north, knock the teeth twelve times, and visualize vermilion, azure, and yellow clouds revolving in the northeast. Then silently intone:\n\n*\"Jade Consort of the Great Empyrean, Supreme Perfected of the Great Void, I beseech the divine chariot to revolve and descend upon my chamber, bestow upon me a jade name, and present it to the Great Empyrean, that I may become a Perfected and feast in the Upper Palace.\"*\n\nUpon completion, visualize within the Palace of the Dao of Subtlety in the Upper Mansion of Yin Essence in the north: the Lord of the Dao of Mysterious Harmony, whose surname is Yu and given name Yinjing, standing five inches and eight fen tall. He wears a sash of five-colored dark clouds, a Mysterious Dawn treasure crown upon his head, and five-colored lion shoes upon his feet. In his hand he holds the tally of summoning the numinous, riding a jade chariot of lingering return, drawn by black-feathered phoenixes. Following him are thirty-six jade lads of the Upper Palace of the Great Mystery, descending to govern within the Mysterious Valley Palace of your body. Then silently intone:",
      "overlap_context": "ommand spirits; may the myriad numina be vanquished. Grant me penetrating vision of the profound, to soar in radiance with the dawn.\"*\n\nUpon completion, tilt your head back and swallow the eight qi.\n\nThis is the Way of the Void Radiance. Practiced for eight years, the chariot of the Eight Paths of Luminous Radiance shall come to welcome your body, ascending to the Great Clarity. These are the Eight Dao Secret Invocations of the Void Radiance, not to be transmitted to those who are not immortals.",
      "start_char": 3828,
      "end_char": 5084,
      "start_sentence": 77,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.96699595451355,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "清景素真，元始同灵，受化九元，含炁朱婴，徘徊玉辇，逍遥紫清，轮转八节，纬度天经，削我死录，保命南生，得乘飞景，按辔绿軿。 毕，仰咽五炁止。 此清景之道，行之八年，致徘徊玉辇下迎兆身，上升太清。 清景八道秘言，勿传非仙之人。 行八景飞经八道秘诀，上皇玉帝告命诸天十方众圣、五岳灵仙，悉来护兆身，降致玄舆飞辇，得与真人同升上清，真皇守兆之命，太一防兆之身，出入游行，无有凶横之患。 若无仙名玉籍，列图紫宫幽冥，亦不可以此经启悟兆心。 兆得此经，即东华注簿，位同真人，唯宝唯秘，不可轻宣。 妄泄秘言，死灭兆门。 夫修《金真玉光八景飞经》，案置招灵致真摄魔之符，皆当先北向香炉，叩左齿三十六通，咏金真太空之章一遍，然后行事也。 咏此一句，上响九天，中彻无间，外朗洞元，玉帝骇听，群魔束身，此章至妙，故为金真。 其篇曰： 天魔乘空发，万精骇神庭。 托化谣歌章，随变入无名。 嚣气何纷纷，秽道当涂生。 云中合朱宫，北帝踊神兵。 鼓翔自知道，玄运来相征。 上景按飞辔，飞驾检云营。 促校北帝录，收摄群魔名。 豁落张天罗，放威掷流铃。 金真辅空洞，玉光焕八冥。 金玄守上官，神虎戮天精。 翦灭万祆气，亿亿悉齐平。 上承九天信，啸命靡不倾。 招真究三洞，慧诵朗且清。 八道望玄霞，七转纬天经。 混合帝一真，拔度七祖程。 削灭五苦根，反魂更受荣。 金光耀寂室，神烛自然生。 华香散玉宇，烟气彻玉京。 帝遣徘徊辇，三元降绿軿。 迅驾腾九玄，朝礼玉皇庭。 毕，便修所行。 如此一遍，天兵辅真，玉帝摄魔，修行上彻，招致真灵，学无此章，仙道不成，天魔所败，反误兆身，故撰为篇，审而奉行。 招灵致真摄魔之符一名九天信 青帝招灵致真摄魔之符，以墨书青木简上，令广九寸，长一尺二寸，置室东面，修行诵经，入室百日，与神人共言，三年室生自然青霞之云。 欲致真人天仙，当书如法，着符北面，精思百日，真人降形，诸仙诣房，授子神真之道。 兆欲摄魔，书符如法，安着中央，诵太空之章一遍，则北帝操兵，天魔丧形，万精灭景，内外肃清。 又墨书青缯九寸，佩身八年，帝降八舆之轮，下迎兆身，白日上升。 九天之秘信，兆当宝密。 修行其道，道无不降，仙无不成，泄露宣传，妄与非真，道则远也，祸灭兆身。 赤帝招灵致真摄魔之符，以青书赤木简上，令广九寸，长一尺二寸，置室南面，修行诵经，入室百日，与神人共言，三年室生自然赤霞之云。 欲致真人天仙，当书如法，着符东面，精思百日，真人降形，仙人诣房，授子神真之道。 兆欲摄魔，书符如上法，安着西方，诵太空之章一遍，则北帝操兵，天魔丧形，万精灭景，内外肃清。 又青书绛缯九寸，佩身八年，帝降八景之舆，下迎兆身，上升太清。 九天秘信，兆当宝密。 修行其道，道无不降，仙无不成。 泄语三人，传付非真，道则远也，祸灭兆身。 白帝招灵致真摄魔之符，以黄书白木简上，令广九寸，长一尺二寸，置室西面#9，修行诵经，入室百日，与神人共言，三年室生自然白霞之云。 欲致真人天仙，当书如上法，着符中央，精思百日，真人降形，仙人诣房，授子神真之道。",
      "translated_text": "In clarity and pristine truth, one shares the numinous with the Primordial Beginning, receiving transformation from the Nine Origins, embracing the qi of the Vermilion Infant. The jade chariot lingers in return, roaming freely through the Purple Clarity. Its wheels turn through the eight nodes, its weft aligns with the celestial warp. It erases my death-record, preserving life in the southern birth. I attain the flying radiance, guiding the reins of the green canopy.\n\nUpon completion, swallow the five qi and cease.\n\nThis is the Dao of Clarity and Radiance. Practicing it for eight years will summon the jade chariot of lingering return to descend and receive your body, ascending to the Great Clarity. The eight secret words of Clarity and Radiance must not be transmitted to those who are not immortals.\n\nPracticing the eight secret methods of the *Flying Scripture of the Eight Radiant Scenes*, the Jade Emperor of the Highest Sovereign commands the myriad saints of the ten directions and the numinous immortals of the Five Peaks to all come and protect your body, descending with the mysterious chariot and flying carriage, allowing you to ascend to the Upper Clarity together with the Perfected. The True Sovereign guards your destiny, the Great One defends your body. In all your comings and goings, you shall suffer no calamity or misfortune.\n\nIf your name is not inscribed in the jade registers of immortality, nor recorded in the charts of the Purple Palace of the Netherworld, you must not awaken your heart with this scripture. Once you obtain this scripture, the Eastern Florescence will inscribe your name in its records, and your rank will equal that of the Perfected. Treasure it and keep it secret—do not lightly disclose it. To recklessly reveal these secret words is to invite annihilation upon your family.\n\nFor those who cultivate the *Golden Perfection and Jade Radiance Scripture of the Eight Flying Scenes*, when placing the talismans for summoning the numinous, attracting the Perfected, and subduing demons, one must first face north toward the incense burner, strike the left teeth thirty-six times, and chant the *Chapter of Golden Perfection and the Great Void* once before proceeding.\n\nChanting this single verse will resound through the Nine Heavens, penetrate the Unbounded, and illuminate the Cavernous Origin. The Jade Emperor will heed it in awe, and all demons will be bound. This chapter is supremely wondrous, hence it is called *Golden Perfection*. Its verses say:\n\nHeavenly demons ride the void and arise,\nMyriad spirits tremble in the divine court.\nEntrusting transformation to the chant of songs,\nThey shift and enter the nameless.\nHow clamorous the chaotic qi,\nDefiled paths arise along the way.\nWithin the clouds, the Vermilion Palace converges,\nThe Northern Emperor dispatches divine soldiers.\nSoaring and wheeling, they know the Dao,\nThe mysterious workings come to summon.\nThe upper radiance guides the flying reins,\nThe flying carriage inspects the cloud encampment.\nUrging the Northern Emperor’s records,\nThey gather and seize the names of all demons.\nThe vast expanse unfurls the celestial net,\nUnleashing might, casting the flowing bells.\nGolden Perfection aids the hollow and empty,\nJade radiance shines through the eight darknesses.\nThe Golden Mystery guards the upper palace,\nDivine tigers slay the celestial essences.\nSevering the myriad baleful qi,\nCountless billions all made level.\nUpholding the Nine Heavens’ trust,\nA single whistle commands all to yield.\nSummoning the Perfected, exploring the Three Caverns,\nWisdom recites, clear and resonant.\nGazing at the eight paths toward the mysterious rosy clouds,\nSeven revolutions weave the celestial warp.\nMerging with the Emperor’s singular truth,\nLiberating the seven generations of ancestors.\nErasing the roots of the five sufferings,\nThe returned soul receives glory anew.\nGolden light illuminates the silent chamber,\nDivine candles naturally arise.\nFloral incense scatters through the jade realm,\nMist and qi penetrate the Jade Capital.\nThe Emperor dispatches the lingering chariot,\nThe Three Origins descend with the green canopy.\nThe swift carriage soars through the Nine Mysteries,\nPaying homage at the Jade Emperor’s court.\n\nUpon completion, proceed with your practice. After one recitation, heavenly soldiers will aid the Perfected, the Jade Emperor will subdue demons, your cultivation will ascend, and you will summon the true numinous. Without this chapter, the Dao of immortality cannot be achieved, and heavenly demons will defeat you, bringing harm to your body instead. Thus, it is composed as a chapter—examine it carefully and practice accordingly.\n\nThe talisman for summoning the numinous, attracting the Perfected, and subduing demons is also called the *Trust of the Nine Heavens*.\n\n**Green Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with ink on a green wood tablet, nine inches wide and twelve inches long. Place it on the eastern side of the chamber. Practice reciting the scripture within the chamber for a hundred days, and you will converse with divine beings. After three years, the chamber will naturally generate clouds of blue-green radiance.\n\nTo summon Perfected Ones and heavenly immortals, inscribe the talisman according to the method, place it facing north, and meditate with focus for a hundred days. The Perfected will descend in form, and immortals will visit your chamber to transmit the Dao of divine perfection.\n\nTo subdue demons, inscribe the talisman as above, place it in the center, and chant the *Chapter of the Great Void* once. Then the Northern Emperor will wield his troops, heavenly demons will lose their forms, myriad spirits will vanish, and all within and without will be purified. Additionally, inscribe with ink on a nine-inch piece of blue-green silk and wear it on your body for eight years. The Emperor will descend with the eight chariots of the radiant scenes to welcome your body, ascending in broad daylight to the Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To recklessly disclose or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**Red Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with blue-green ink on a red wood tablet, nine inches wide and twelve inches long. Place it on the southern side of the chamber. Practice reciting the scripture within the chamber for a hundred days, and you will converse with divine beings. After three years, the chamber will naturally generate clouds of red radiance.\n\nTo summon Perfected Ones and heavenly immortals, inscribe the talisman according to the method, place it facing east, and meditate with focus for a hundred days. The Perfected will descend in form, and immortals will visit your chamber to transmit the Dao of divine perfection.\n\nTo subdue demons, inscribe the talisman as above, place it in the west, and chant the *Chapter of the Great Void* once. Then the Northern Emperor will wield his troops, heavenly demons will lose their forms, myriad spirits will vanish, and all within and without will be purified. Additionally, inscribe with blue-green ink on a nine-inch piece of crimson silk and wear it on your body for eight years. The Emperor will descend with the eight chariots of the radiant scenes to welcome your body, ascending to the Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**White Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with yellow ink on a white wood tablet, nine inches wide and twelve inches long. Place it on the western side of the chamber...",
      "overlap_context": "ame Yinjing, standing five inches and eight fen tall. He wears a sash of five-colored dark clouds, a Mysterious Dawn treasure crown upon his head, and five-colored lion shoes upon his feet. In his hand he holds the tally of summoning the numinous, riding a jade chariot of lingering return, drawn by black-feathered phoenixes. Following him are thirty-six jade lads of the Upper Palace of the Great Mystery, descending to govern within the Mysterious Valley Palace of your body. Then silently intone:",
      "start_char": 5084,
      "end_char": 6316,
      "start_sentence": 101,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.67013883590698,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "兆欲摄魔，当书符如法，安着东面，诵太空之章一遍，则北帝操兵，天魔丧形，万精灭景，内外肃清。 又黄书白缯九寸，佩身八年，帝降玄景绿舆，下迎兆身，上升太清。 九天秘信，兆当宝密。 修行其道，道无不降，仙无不成。 泄语三人，传付非真，道则远也，祸灭兆身。 黑帝招灵致真摄魔之符，以白书黑木简上，令广九寸，长一尺二寸，置室北面，修行诵经，入室百日，与神人共言，三年室生自然黑霞之云。 欲致真人天仙，当书如上法，着符西方，精思百日，真人降形，仙人诣房，授子神真之道。 兆欲摄魔，书符如法，安着南面，诵太空之章一遍，则北帝操兵，天魔丧形，万精减景，内外肃清。 又白书黑缯九寸，佩身八年，帝遣光明八道之舆，下迎兆身，上升太清。 九天秘信，兆当宝密。 修行其道，道无不降，仙无不成。 泄语三人，传付非真，道则远也，祸灭兆身。 黄帝招灵致真摄魔之符，以朱书黄木简上，令广九寸，长一尺二寸，置室中央，修行诵经，入室百日，与神人共言，三年室生自然黄霞之云。 欲致真人天仙，当书如上法，着符南面，精思百日，真人降形，仙人诣房，授子神真之道。 兆欲摄魔，书符如法，以着北面，诵太空之章一遍，则北帝操兵，天魔丧形，万精灭景，内外肃清。 又朱书黄缯九寸，佩身八年，帝遣徘徊之辇，下迎兆身，上升太清宫。 九天秘信，兆当宝密。 修行其道，道无不降，仙无不成。 泄语三人，传付非真，道则远也，祸灭兆身。 书符都毕，北向叩齿三十六通，微祝曰： 九天有命，普告万灵，三代相推，五炁交并，五帝显驾，控辔霄庭，施布正法，收魔束精，剪戮凶祆，万道齐平，道流后学，帝君记名，招真洞幽炁交无形，变景炼骨，道升三清，得迅飞舆，上造玉庭。 毕，随位置符，真仙立降，身无祸殃。 学无此道，鲜不丧身，可谓妙法，不学自仙也。 帝君豁落七元上符一名帝皇威章 此一元豁落日精之符。 兆欲修行诵经求仙，当以雌黄书生碧上，佩身。 兆欲上致真人，朱书白纸，东向服之，精思百日，真人降房，与兆共言。 兆欲制魔，当以青书黄木九寸板上，着月建上，天魔自消，万精束形。 帝皇之章，慎勿泄扬，秘而奉修，七年飞仙。 此二元豁落月精之符。 兆欲修行诵经求仙，当以空青书绛缯，佩身。 兆欲通灵致神，黄书白纸，西向服之，精思百日，神人降形，与兆共言。 兆欲制魔摄精，当以黑书赤木九寸板上，施着东北之上，百日，北帝捕魔，天元摄精，万祆绝灭，内外荡清。 帝皇之章，秘而修行，七年飞仙，白日升天。 此三元豁落岁星精符。 兆欲行道求仙，当以朱书生碧，佩身。 兆欲致东岳真人仙官，当以黑书青纸，东向服之，精思百日，仙官立到，真人诣房，赐兆神仙之药也。 兆欲制青帝之魔，当以白书青木九寸板上，着东面百日，天魔束形，万精自丧。 帝皇之章，秘而修行，七年飞仙，白日升天。 此四元豁落太白星精符。 兆欲行道求仙，当以雌黄书白素，佩身。 兆欲致西岳真人仙官，当以黄书白纸，西向服之，精思百日，仙官立到，真人诣房，赐兆真书，与兆共言。 兆欲制白帝之魔，当以朱书白木九寸板上，向西面百日，天魔束形，万精自丧。",
      "translated_text": "If you wish to subdue demons, inscribe the talisman according to the method and place it on the eastern side. Recite the *Chapter of the Great Void* once, and the Northern Emperor will wield his troops, causing celestial demons to lose their forms, the myriad spirits to extinguish their radiance, and all within and without to become solemnly pure. Additionally, inscribe with yellow ink on a nine-inch piece of white silk and wear it on your body for eight years. The Emperor will descend with the dark radiance of the green chariot to welcome your body, ascending to the Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**Black Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with white ink on a black wood tablet, nine inches wide and twelve inches long. Place it on the northern side of the chamber. Practice reciting the scriptures and enter the chamber for a hundred days, where you will converse with divine beings. After three years, the chamber will naturally generate clouds of black mist. If you wish to summon Perfected Ones and celestial immortals, inscribe the talisman according to the above method and place it in the western direction. Focus your thoughts for a hundred days, and the Perfected Ones will descend in form, while immortals will visit your chamber to transmit the Dao of divine perfection.\n\nIf you wish to subdue demons, inscribe the talisman according to the method and place it on the southern side. Recite the *Chapter of the Great Void* once, and the Northern Emperor will wield his troops, causing celestial demons to lose their forms, the myriad spirits to diminish their radiance, and all within and without to become solemnly pure. Additionally, inscribe with white ink on a nine-inch piece of black silk and wear it on your body for eight years. The Emperor will dispatch the eight chariots of radiant scenes to welcome your body, ascending to the Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**Yellow Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with vermilion ink on a yellow wood tablet, nine inches wide and twelve inches long. Place it in the center of the chamber. Practice reciting the scriptures and enter the chamber for a hundred days, where you will converse with divine beings. After three years, the chamber will naturally generate clouds of yellow mist. If you wish to summon Perfected Ones and celestial immortals, inscribe the talisman according to the above method and place it in the southern direction. Focus your thoughts for a hundred days, and the Perfected Ones will descend in form, while immortals will visit your chamber to transmit the Dao of divine perfection.\n\nIf you wish to subdue demons, inscribe the talisman according to the method and place it on the northern side. Recite the *Chapter of the Great Void* once, and the Northern Emperor will wield his troops, causing celestial demons to lose their forms, the myriad spirits to extinguish their radiance, and all within and without to become solemnly pure. Additionally, inscribe with vermilion ink on a nine-inch piece of yellow silk and wear it on your body for eight years. The Emperor will dispatch the meandering imperial carriage to welcome your body, ascending to the Palace of Great Clarity. This is the secret trust of the Nine Heavens—treasure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\nOnce all talismans are inscribed, face north and click your teeth thirty-six times, then softly invoke:\n*\"By the mandate of the Nine Heavens, I proclaim to the myriad spirits: three generations succeed one another, the five qi intermingle, the Five Emperors manifest their chariots, guiding the reins in the celestial court. They enact and spread the true Dharma, subdue demons and restrain spirits, sever and slay malevolent omens. The myriad Dao are made equal and level. Those who follow the Dao and later learners—may the Imperial Lords record their names. Summon the Perfected to the hidden depths, where qi merges with the formless, transform radiance and refine the bones, ascend the Dao to the Three Clarities, swiftly ride the chariots, and ascend to the Jade Court.\"*\n\nUpon completion, place the talismans according to their positions, and the Perfected Immortals will descend at once, sparing your body from misfortune. Those who study without this Dao will rarely escape bodily destruction. This may be called the wondrous Dharma—without study, one attains immortality of their own accord.\n\n**The Supreme Talisman of the Seven Luminaries of the Imperial Lord, known as the *August Might Chapter*:**\nThis is the first of the Seven Luminaries, the talisman of the essence of the sun. If you wish to practice reciting scriptures in pursuit of immortality, inscribe with orpiment on fresh green silk and wear it on your body. If you wish to summon Perfected Ones, inscribe with vermilion on white paper, face east, and ingest it. Focus your thoughts for a hundred days, and the Perfected Ones will descend to your chamber to converse with you. If you wish to subdue demons, inscribe with green ink on a nine-inch yellow wood tablet and place it on the monthly cyclical sign. The celestial demons will naturally disperse, and the myriad spirits will restrain their forms. Guard the *August Might Chapter* closely, do not disclose it, and practice it in secret—after seven years, you will ascend as a flying immortal.\n\nThis is the second of the Seven Luminaries, the talisman of the essence of the moon. If you wish to practice reciting scriptures in pursuit of immortality, inscribe with azurite on crimson silk and wear it on your body. If you wish to commune with spirits and summon the divine, inscribe with yellow ink on white paper, face west, and ingest it. Focus your thoughts for a hundred days, and divine beings will descend in form to converse with you. If you wish to subdue demons and restrain spirits, inscribe with black ink on a nine-inch red wood tablet and place it in the northeast. After a hundred days, the Northern Emperor will capture the demons, the Celestial Prime will restrain the spirits, the myriad malevolent omens will be eradicated, and all within and without will be cleansed. Guard the *August Might Chapter* closely, practice it in secret—after seven years, you will ascend as a flying immortal and ascend to heaven in broad daylight.\n\nThis is the third of the Seven Luminaries, the talisman of the essence of Jupiter. If you wish to practice the Dao in pursuit of immortality, inscribe with vermilion on fresh green silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Eastern Marchmount, inscribe with black ink on green paper, face east, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the elixir of divine immortality. If you wish to subdue the demons of the Green Emperor, inscribe with white ink on a nine-inch green wood tablet and place it on the eastern side for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish. Guard the *August Might Chapter* closely, practice it in secret—after seven years, you will ascend as a flying immortal and ascend to heaven in broad daylight.\n\nThis is the fourth of the Seven Luminaries, the talisman of the essence of Venus. If you wish to practice the Dao in pursuit of immortality, inscribe with orpiment on white silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Western Marchmount, inscribe with yellow ink on white paper, face west, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the true scriptures and converse with you. If you wish to subdue the demons of the White Emperor, inscribe with vermilion on a nine-inch white wood tablet and face west for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.",
      "overlap_context": "sure and guard it closely. Practicing this Dao, no Dao will fail to descend, and no immortality will fail to be achieved. To disclose it to three people or transmit it to the unworthy is to distance the Dao and invite calamity that will annihilate your body.\n\n**White Emperor’s Talisman for Summoning the Numinous, Attracting the Perfected, and Subduing Demons:**\nInscribe with yellow ink on a white wood tablet, nine inches wide and twelve inches long. Place it on the western side of the chamber...",
      "start_char": 6316,
      "end_char": 7549,
      "start_sentence": 150,
      "end_sentence": 192,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.719751834869385,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "帝皇之章，行之七年，神仙度世，白日升天。 此五元豁落荧惑星精符。 兆欲行道求仙，当以雌黄书生紫，佩身。 兆欲致南岳真人仙官，当以青书赤纸，南向服之，精思百日，仙官立到，真人诣房，赐兆神芝宝文，与兆共言。 兆欲制赤帝之魔，当以黑书赤木九寸板上，向南面百日，天魔束形，万精自丧。 帝皇之章，行之七年，神仙度世，白日升天。 此六元豁落辰星精符。 兆欲行道求仙，当以黑书黄素，佩身。 兆欲致北岳真人仙官，当以白书黑纸，向北服之，精思百日，仙官立致，真人诣房，赐兆神仙之药，与兆共言。 兆欲制黑帝之魔，当以黄书黑木九寸板上，向北面百日，天魔束形，万精自丧。 帝皇之章，行之七年，神仙飞行，白日升天。 此七元豁落镇星精符。 兆欲行道求仙，当以朱书青碧，佩身。 兆欲致中岳真人仙官，当以朱书黄纸，向太岁上服之，精思百日，仙官立到，真人诣房，授兆神仙之药，五老真书。 兆欲制黄帝之魔，当以青书黄木九寸板上，置於太岁之上百日，天魔束形，万精自丧。 帝皇之章，行之七年，神仙飞行，白日升天。 此高上玉帝元皇道君，受九天丈人豁落七元之符，主致上真飞仙之官，通灵彻视，与神交言，制魔伏灵，威摄十方，流火万里，坐在立亡，行之九年，得乘玄舆，飞行上清。 施行上道，修行求仙，摄魔御精，书符如法，北向叩左齿三十六通，存日月五星精光，洞映兆身； 微祝曰： 七元焕落，流威吐精，掷光万里，神耀五灵，上摄北酆，检录鬼名，天帝命章，剪戮贾生，我备豁落，流金火铃，内保六府，外引流精，飞仙真人，与我斋并，洞睹空洞，三道合明，得御玄云，骖驾绿軿，携率五岳，运我升清。 毕，随位施用七年，克有真人来降，授兆上真宝文也。 夫有金骨玉名，紫字上清，得佩招灵致真摄魔之符、豁落七元之符，则九天记名，帝告万真四司灵官，右别兆身，出入行来，登陟五岳，仙官卫迎，万魔伏首，群凶丧精。 修行百日，与神通灵，真人下降，授兆真经也。 七年之中，得乘飞軿，游戏五岳，出入三清。 泄语三人，传不得真，七祖父母，下及兆身，并充刀山，三徒之中，万劫不原。 得者保秘，慎如#10四明。 凡上学之士，道成飞升，而无此文，亦九天玉司不遣兆仙，天关之门亦不可得前，五岳之官亦不卫兆之身。 故九天之信，帝皇之章，施於已成真人，不行於世。 得者便仙，其有左辅执节，仙都右置，侍仙玉郎，五方灵官，典卫此文，不可轻慢，泄露上真，有犯其禁，死灭兆身。 上古之科，万劫一传，今有其人，七百年中听得三传。 依明科之法，师弟子对斋九十日，赍金龙、玉鱼各一枚，紫纹百尺，上金三两，以奉有经之师，誓於九天之信。 无盟而传，身被风刀之考，受而无信，轻道贱真，身没鬼官，愆连七玄。 故四极明科有三分之信，师受不依科文，以营他用，死没三官，长充地狱，万不得仙。 赵伯玄，昔师万始先生，受书道成，当登金阙，而无招灵致真、豁落七元二符，於俯仰之格，方退还戎山，七百年后，诣清真小童，依盟受之，誓於委羽之山，今升为上清左司君。 王君以经於阳洛山，十一月上午子时，盟九天以传南岳夫人，今封於阳洛山中。",
      "translated_text": "The Imperial August Chapter, when practiced for seven years, enables transcendence as a divine immortal and ascension to heaven in broad daylight.\n\nThis is the fifth of the Seven Luminaries, the talisman of the essence of Mars. If you wish to practice the Dao in pursuit of immortality, inscribe with orpiment on raw purple silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Southern Marchmount, inscribe with azure ink on red paper, face south, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the divine mushroom and treasure scriptures and converse with you. If you wish to subdue the demons of the Red Emperor, inscribe with black ink on a nine-inch red wood tablet and face south for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.\n\nThe Imperial August Chapter, when practiced for seven years, enables transcendence as a divine immortal and ascension to heaven in broad daylight.\n\nThis is the sixth of the Seven Luminaries, the talisman of the essence of Mercury. If you wish to practice the Dao in pursuit of immortality, inscribe with black ink on yellow silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Northern Marchmount, inscribe with white ink on black paper, face north, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the divine immortals’ medicine and converse with you. If you wish to subdue the demons of the Black Emperor, inscribe with yellow ink on a nine-inch black wood tablet and face north for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.\n\nThe Imperial August Chapter, when practiced for seven years, enables transcendence as a divine immortal, soaring flight, and ascension to heaven in broad daylight.\n\nThis is the seventh of the Seven Luminaries, the talisman of the essence of Saturn. If you wish to practice the Dao in pursuit of immortality, inscribe with vermilion on greenish-blue silk and wear it on your body. If you wish to summon the Perfected Ones and immortal officials of the Central Marchmount, inscribe with vermilion on yellow paper, face the Grand Year Star, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to confer upon you the divine immortals’ medicine and the true scriptures of the Five Elders. If you wish to subdue the demons of the Yellow Emperor, inscribe with azure ink on a nine-inch yellow wood tablet and place it beneath the Grand Year Star for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.\n\nThe Highest Jade Emperor, the Primordial August Lord of the Dao, received the talismans of the Seven Luminaries from the Nine Heavens’ Venerable One. These talismans summon the officials of the flying immortals, enable communion with spirits, and allow clear vision. They subdue demons, suppress spirits, wield awe over the ten directions, and unleash fire for ten thousand miles. They grant the power to kill or spare with a thought. When practiced for nine years, one may ride the dark chariot and soar through the Upper Clarity.\n\nTo apply the supreme Dao, cultivate and seek immortality, subdue demons, and command spirits, inscribe the talismans according to the method. Face north, knock the left teeth thirty-six times, and visualize the radiance of the sun, moon, and five stars illuminating your body. Whisper the incantation:\n\n*\"The Seven Luminaries shine forth,\nTheir might flows, their essence radiates,\nLight cast for ten thousand miles,\nDivine brilliance of the Five Spirits.\nAbove, they seize Fengdu,\nRecord the names of ghosts,\nBy the celestial emperor’s decree,\nSever and slay Jia Sheng.\nI am equipped with the Seven Luminaries,\nWielding golden bells of fire,\nWithin, I guard the six palaces,\nWithout, I draw in flowing essence.\nFlying immortals, true ones,\nAttend me in my purification,\nGazing into the empty void,\nThe Three Ways unite in clarity.\nI ride the dark clouds,\nHarnessing the green chariot,\nThe Five Marchmounts escort me,\nConveying me to ascend the Clarity.\"*\n\nWhen finished, apply the talismans according to their positions for seven years, and true immortals will surely descend to confer upon you the treasure scriptures of the Upper Realized Ones.\n\nThose with golden bones and jade names, inscribed in purple in the Upper Clarity, who obtain the talismans for summoning spirits, attracting the Perfected, and subduing demons—the talismans of the Seven Luminaries—will have their names recorded in the Nine Heavens. The Emperor will command the myriad Perfected Ones and the four bureaus’ spirit officials to distinguish and protect their bodies. As they come and go, ascending the Five Marchmounts, immortal officials will welcome and guard them. Ten thousand demons will bow their heads, and all malevolent spirits will lose their essence. After a hundred days of cultivation, they will commune with spirits, and true immortals will descend to confer upon them the true scriptures. Within seven years, they will ride flying chariots, roam the Five Marchmounts, and traverse the Three Clarities.\n\nIf the secret is revealed to three people, the transmission will not be genuine. The seven generations of ancestors, down to oneself, will all be cast into the Mountain of Knives. Among the three disciples, none will be spared for ten thousand kalpas. Those who receive this must guard it in secrecy, as strictly as the Four Brightnesses.\n\nFor all scholars of the supreme learning, even if they achieve the Dao and ascend as immortals, without these scriptures, the Jade Bureau of the Nine Heavens will not dispatch their immortals, the gates of the Celestial Pass will remain closed to them, and the officials of the Five Marchmounts will not guard their bodies. Thus, the trust of the Nine Heavens and the Imperial August Chapter are bestowed only upon those who have already become Perfected Ones and are not circulated in the world. Those who obtain them will become immortals.\n\nThose who hold the left auxiliary insignia, the right attendants of the immortal capital, the jade lads who serve the immortals, and the spirit officials of the five directions who safeguard these scriptures must not treat them lightly or reveal them to the Upper Realized Ones. Violating these prohibitions will result in the destruction of one’s body.\n\nAccording to the ancient statutes, these scriptures are transmitted once in ten thousand kalpas. In the present age, within seven hundred years, only three transmissions are permitted. In accordance with the statutes of the Bright Code, master and disciple must face each other in purification for ninety days, presenting one golden dragon, one jade fish, a hundred feet of purple silk, and three taels of gold to the master who possesses the scriptures. They must swear an oath by the trust of the Nine Heavens. Those who transmit without an alliance will suffer the trials of the wind and blade. Those who receive without sincerity, who belittle the Dao and disdain the Perfected, will be consigned to the ghostly officials, and their transgressions will extend to the seven mysteries. Thus, the statutes of the Four Poles clearly mandate threefold trust. If a master receives the scriptures but does not follow the statutes, using them for other purposes, they will be condemned to the Three Bureaus, forever confined to hell, and never attain immortality.\n\nZhao Boxuan, who once studied under Master Wanshi, achieved the Dao and was to ascend to the Golden Gates. However, lacking the talismans for summoning spirits, attracting the Perfected, and the Seven Luminaries, he was demoted to Mount Rong in an instant. Seven hundred years later, he sought out the Pure and True Youth, received the scriptures according to the alliance, and swore an oath at Mount Weiyu. Now, he has ascended as the Left Bureau Lord of the Upper Clarity.\n\nLord Wang transmitted the scriptures at Mount Yangluo on the morning of the zi hour of the eleventh month. He swore an oath to the Nine Heavens and passed them to the Lady of the Southern Marchmount, who is now sealed within Mount Yangluo.",
      "overlap_context": "ibe with yellow ink on white paper, face west, and ingest it. Focus your thoughts for a hundred days, and the immortal officials will arrive at once, while the Perfected Ones will visit your chamber to bestow upon you the true scriptures and converse with you. If you wish to subdue the demons of the White Emperor, inscribe with vermilion on a nine-inch white wood tablet and face west for a hundred days. The celestial demons will restrain their forms, and the myriad spirits will naturally perish.",
      "start_char": 7549,
      "end_char": 8789,
      "start_sentence": 193,
      "end_sentence": 227,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.58466100692749,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "南岳松子，以阳朔之年，於太华山传经於谷希子，令封一通於鸟鼠山中。 桐栢真人，以六月二十九日，以此文授许远游。 上清金真玉光八景飞经竟 #1按敦煌本卷末题曰：『如意元年（692）闰五月十三日经生邬忠写』。 可知为唐武后时抄本。 以下仅校补《道藏》本错漏字，异体字不校。 #2敦煌本无『非』字。 疑『非』字当作『於』。 #3『元始天王启之於空玄之上，以传九天丈人、太真太上大道君』，敦煌本作 『九天丈人受之於空玄，以传元始天王、广生太真太上大道君』。 #4『者身』，敦煌本作『之身 』。 #5『经』 字原本作 『圣』，据敦煌本改。 #6『万遍』，敦煌本作『一遍』。 #7『念』字原作『合』，据敦煌本改。 #8『五华结鲜』，敦煌本作 『五藏洁鲜』 。 #9『西面』原作『西南』，据敦煌本改。 #10『如』字原作『 负 』，据敦煌本改。",
      "translated_text": "The Pine Master of the Southern Marchmount, in the year of Yangshuo, transmitted the scriptures to Gu Xizi at Mount Taihua, instructing him to seal one copy within Mount Wushu.\n\nThe Paulownia-Cypress Perfected, on the twenty-ninth day of the sixth month, bestowed this text upon Xu Yuanyou.\n\nThe *Upper Clarity Golden Perfected Jade Radiance Eight Effulgences Flying Scripture* concludes.\n\n---\n1. According to the colophon of the Dunhuang manuscript: *\"Copied by Wu Zhong, a scribe, on the thirteenth day of the intercalary fifth month in the first year of Ruyi (692).\"* It is thus known to be a Tang manuscript from the reign of Empress Wu.\n2. The following notes only correct errors and omissions in the *Daoist Canon* edition; variant characters are not emended.\n3. The Dunhuang manuscript lacks the character *非* (\"not\"); it is suspected that *非* should read *於* (\"at\").\n4. *\"The Celestial King of Primordial Beginning initiated it in the Supreme Void, transmitting it to the Nine Heavens Venerable, the Grand Perfected, and the Supreme Dao Lord of Great Dao\"*—the Dunhuang manuscript reads: *\"The Nine Heavens Venerable received it in the Supreme Void, transmitting it to the Celestial King of Primordial Beginning, the Vast-Life Grand Perfected, and the Supreme Dao Lord of Great Dao.\"*\n5. *\"者身\"* (\"those who embody\")—the Dunhuang manuscript reads *\"之身\"* (\"this body\").\n6. The character *\"经\"* (\"scripture\") originally appeared as *\"圣\"* (\"sacred\"); emended according to the Dunhuang manuscript.\n7. *\"万遍\"* (\"ten thousand recitations\")—the Dunhuang manuscript reads *\"一遍\"* (\"one recitation\").\n8. The character *\"念\"* (\"recite\") originally appeared as *\"合\"* (\"join\"); emended according to the Dunhuang manuscript.\n9. *\"五华结鲜\"* (\"Five Effulgences bind in freshness\")—the Dunhuang manuscript reads *\"五藏洁鲜\"* (\"Five Viscera purified and fresh\").\n10. *\"西面\"* (\"westward\") originally appeared as *\"西南\"* (\"southwest\"); emended according to the Dunhuang manuscript.\n11. The character *\"如\"* (\"as\") originally appeared as *\"负\"* (\"bear\"); emended according to the Dunhuang manuscript.",
      "overlap_context": " was demoted to Mount Rong in an instant. Seven hundred years later, he sought out the Pure and True Youth, received the scriptures according to the alliance, and swore an oath at Mount Weiyu. Now, he has ascended as the Left Bureau Lord of the Upper Clarity.\n\nLord Wang transmitted the scriptures at Mount Yangluo on the morning of the zi hour of the eleventh month. He swore an oath to the Nine Heavens and passed them to the Lady of the Southern Marchmount, who is now sealed within Mount Yangluo.",
      "start_char": 8790,
      "end_char": 9178,
      "start_sentence": 228,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.114309549331665,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉光八景飞经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}