{
  "source_id": "上清高上灭魔玉帝神慧玉清隐书",
  "source_file": "chunked_daozang\\上清高上灭魔玉帝神慧玉清隐书.json",
  "total_chunks": 5,
  "total_original_chars": 5648,
  "total_translated_chars": 37696,
  "total_translation_time": 188.89338374137878,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清高上灭魔玉帝神慧玉清隐书.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Perfected Jade Purity Hidden Writ of the Cavern of Reality**\n\n**Scripture Title:** *The Supreme Perfected Jade Purity Hidden Writ of the Cavern of Reality* (abbreviated as *The Jade Purity Hidden Writ*). Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. Originally comprising four scrolls and eight chapters, later divided into four texts:\n\n1. *The Supreme Perfected Jade Purity Hidden Writ of the Cavern of Reality: Scripture of Divine Wisdom and Primordial Perfection for Annihilating Demons* (three chapters);\n2. *The Supreme Perfected Scripture of the Jade Emperor’s Divine Wisdom for Annihilating Demons from the Jade Purity Hidden Writ* (three chapters);\n3. *The Supreme Perfected Scripture of the Cavern of Radiance’s Golden Primordial Jade Purity Hidden Writ for Annihilating Demons* (one chapter);\n4. *The Supreme Perfected Scripture of the Golden Primordial Feathered Chapters from the Jade Purity Hidden Writ* (one chapter).\n\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Zhengyi Section, First Division.\n\n---\n\n### *The Supreme Perfected Scripture of the Jade Emperor’s Divine Wisdom for Annihilating Demons from the Jade Purity Hidden Writ*\n\n#### **Inner Text of the Jade Purity Inscribed Stone Hidden Inscription**\n\nThe inner text of the Supreme Perfected inscribed stone, the hidden inscription of spirits and gods on the northern wall of the Jade Purity Upper Palace, was transmitted by the Supreme Jade Emperor to the Celestial Emperor of the Grand Tenuity. The Three Ways establish rectitude, and the Celestial Emperor of the Grand Tenuity bestowed it upon the Later Sage, the Lord of the Dao of Great Peace, who inscribed it upon the Six Palaces of Fengdu and commanded the Northern Emperor to govern the mountains of Fengdu.\n\nThe Lord of the Dao inscribed its words, traversing the Ten Heavens to summon spirits and annihilate demons, overawing the myriad essences, sealing the Five Peaks, binding the host of spirits, ascending to unlock the Celestial Pass, revolving the Five Stars, unfurling a myriad transformations of radiance. The true light illumines with clarity, molten gold intermingles in splendor, and the Ten Heavens darken in obscurity. Those to be slain are slain, those to be executed are executed; all accords with the will, and life and death are judged with equity.\n\nThis Way is solemn and wondrous, the essence of the Jade Emperor. Those who behold its text achieve mastery without study. The dead of the Northern Fengdu are erased, names recorded in the Azure Flower Register, and perfected immortals come to pay homage, ascending to the royal court of the Upper Realm.\n\nThe Jade Purity Hidden Writ holds the mysterious purport of numinous subtlety, its jade-like tones penetrating the profound, its wondrous import luminous and penetrating. The eight thunders unleash their might, commanding spirits and deploying qi, directing the turning of the celestial pivot, rotating the Five Celestial Bodies. The Seven Stars hasten in motion, seated to command the Nine Heavens. The myriad spirits submit in totality, the Jade Bureau assumes its floating station, the Two Radiant Ones pause their brilliance, a thousand essences cower in retreat, and the host of demons are crushed and annihilated. Chanting its verses opens the Celestial Pass; reciting its incantations loosens the hearts of the myriad perfected. Purple auroras flow in reflection, golden immortals attend in spirit, the Primordial Heaven spreads across the court, the Eight Winds are solemn and clear. The mysterious light lingers in obscurity, the Three Radiant Ones merge in brightness, the celestial abyss lies in tranquil waves, mighty dragons stand in solemn array, divine tigers display their might, venomous beasts gather as troops, severing the heads of inauspicious omens. Demons and monsters assume their proper forms, ten thousand times ten thousand receive their duties, a thousand times a thousand are all pacified. The Five Penetrations and Seven Unions align, and the Three Qi converge as one.\n\nYou who possess jade bones must seek the treasure scriptures, cultivate with diligent and arduous practice, and ascend to the Cloudy Encampment, reaching the Mysterious Palace to pay homage to the Three Pure Ones.\n\nThe Fengdu Mountains lie in the northern *gui* region, rising three thousand six hundred *li* in height, with a circumference of thirty thousand *li*. The grotto-heaven within the mountains spans fifteen thousand *li* in circumference, both above and below containing palaces of spirits and gods. Atop the mountain stand Six Palaces, and within the grotto lie another Six Palaces, each palace extending a thousand *li* in circumference. These are the palaces of the Six Heavens’ spirits and gods, twelve in total, with the upper palaces governing ghosts and the grotto palaces governing spirits. The registers of life and death derive their names from here, all subject to the Northern Emperor.\n\nThe Jade Purity inscribed stone hidden inscription comprises two chapters: one to govern ghosts, the other to restrain spirits. On the northern walls of the twelve palaces, one chapter of the hidden inscription is engraved in each.\n\n**First Palace:** Palace of the Cut-Off Yin of Zhou;\n**Second Palace:** Palace of the Grand Execution and Faithful Affairs;\n**Third Palace:** Palace of the Bright Dawn Enduring Transgressions in the Martial City;\n**Fourth Palace:** Palace of the Tranquil Illumination of Sinful Qi;\n**Fifth Palace:** Palace of the Seven Errors of the Ancestral Numinous;\n**Sixth Palace:** Palace of the Daring Controller of Repeated Offenses.\n\nThe above Six Palaces govern the Fengdu Mountains, presiding over the myriad ghosts and administering the life and death of the people upon the earth. The Jade Emperor’s inscribed stone hidden inscription is written upon the northern walls of the palaces to restrain the host of malevolent forces, preventing them from wanton violence and unjust harm to the living. Those who obtain and bear this text shall be guarded by the myriad ghosts, their names erased from the Northern Fengdu, their fate transferred to the Southern Palace, and they shall become perfected beings.\n\nThe Six Palaces within the grotto of the Fengdu Mountains govern the myriad spirits. The Jade Emperor’s hidden inscription of names is written upon the northern walls of the palaces to restrain the numinous powers of the Six Palaces and their myriad spirits.\n\n**First Palace:** Palace of the Radiant and Illuminating Grotto-Heaven of Total Numinosity;\n**Second Palace:** Palace of the Mysterious Controller of the Weighty and Upright Ancestral Void;\n**Third Palace:** Palace of the Unifying Immortals Ascending to the Subtle and Rare;\n**Fourth Palace:** Palace of the Upright and Perfected, the Luminous Controller of the Curved;\n**Fifth Palace:** Palace of the Cloudy Jade Record of Luminous Clarity;\n**Sixth Palace:** Palace of the Lofty Void and Crimson Reflection of the Cloudy Origin.\n\nThe above names of the Six Palaces within the Fengdu Mountains govern the myriad spirits, and the registers of life and death are all bound to them. Those who know the names of the Six Palaces within the grotto and bear the Jade Emperor’s hidden inscription shall have the Southern Spirits pay inner homage, no longer harming people. Their names of death are erased from the Northern Fengdu, their fate transferred to the Southern Palace, with perfected spirits as guards and attendants, ascending to heaven in broad daylight.\n\nThe Jade Purity inscribed stone hidden text is to be written in vermilion on a three-*chi* length of blue-green silk and worn upon the body. Additionally, write it in blue-green upon the northern wall of one’s dwelling. When coming and going, near and far, the myriad ghosts shall pay homage to you, and a thousand ghosts shall guard the perfected. This is the mysterious ancient Dao, the Jade Purity hidden text. Those who obtain it become divine immortals, no longer subject to the palaces of Fengdu.\n\nThose who receive it must keep it secret and take care not to show it to others. Those with golden bones and jade names, whose names are recorded in the Azure Bureau, having obtained this text, must follow the mysterious regulations. Within seven hundred years, they are permitted to transmit it three times. If transmitted to an unworthy recipient, the Northern Emperor shall report the offense, extending punishment to the seven generations of ancestors, who shall forever bear the burden of ghostly retribution. Their bodies shall perish, their forms be destroyed, and they shall never attain immortality.\n\nThe inscribed text within the Jade Purity’s carved stone hidden script comprises ninety-one words. The Jade Emperor engraved this upon the northern wall of the Six Palaces of Fengdu Grotto-Heaven to govern and restrain the myriad spirits. Those with jade bones, whose names are recorded in the Purple Purity, upon encountering this text, must transcribe it in vermilion upon a three-foot length of green silk and wear it, and also inscribe it in vermilion upon the northern wall of their dwelling. Then true immortals shall descend, the ten thousand spirits shall guard their form, the thousand demons shall flee in terror, the heavenly demons shall lose their essence, their might shall command the Ten Heavens, and they shall govern all beings. Their luminous spirit shall transform their body, and the ten thousand transformations shall be instantly accomplished. They shall ride the void and mount the floating clouds, soaring through the Jade Purity. To lightly divulge this precious script brings calamity upon the seven mysteries; the body perishes into the offices of ghosts, and one shall never attain immortality.\n\nAll who receive the Jade Purity’s hidden script, the *Dongjing Jinxuan* chapter, must recite it ten thousand times and constantly invoke the names of the upper and lower Six Palaces of Fengdu ten thousand times. Then they shall naturally comprehend the hidden names inscribed upon the stone. This sound emanates from the Highest Jade Void Heaven, a spontaneous composition, wherein the inner names of heavenly demons are recorded, or the jade tablets of the Nine Heavens are displayed. Its words are profound and distant, beyond the comprehension of beginners or ordinary mortals. Unless the Great Emperor descends, seated upon a jasper chariot, ascending the dawn clouds, riding the floating radiance of the Luo River and the purple heavens, one cannot thoroughly master this inscription. Those of later learning who are earnest, upon seeing this text, shall have their names recorded in the Eastern Florescence, their bones and appearance aligned with immortality, and the heavenly perfected shall descend in response—thus they receive this script. They must only follow the method and wear it upon their person to repel the myriad spirits. When the Dao is fulfilled and qi is clarified, they shall surely attain insight into the hidden sounds, roaming through the Jade Purity.\n\nAll who receive the Jade Purity’s hidden script, the *Dongjing Jinxuan* chapter, yet lack the inner text of the Jade Emperor’s carved stone hidden inscription, may not recite the *Jinxuan* chapter. To recite it lightly stirs the Highest Heavens, and the ten thousand demons seize the opportunity to arise. Those who possess only the inner text of the hidden inscription but do not receive the *Dongjing Jinxuan* likewise have no means to restrain demons. When the upper and lower are mutually aligned, the two practices are equally employed, and the Three Radiant Ones harmonize, the ten thousand qi become solemn and clear.\n\nThe *Golden Root Scripture* states: \"Those who cultivate the Great Grotto must sit in the numinous thunder; those who cultivate the *Jinxuan* must wear the hidden inscription.\" This Dao is most wondrous, concealed within the Nine Bends Chamber of the Jade Void, guarded by golden spirits and attended by jade maidens bearing towels. The thirty-six perfected oversee the jade tablets. Those who violate the regulations or transgress the prohibitions shall be reported to the Three Purities, their bodies perishing into the offices of ghosts, forever bearing punishment in the Dark Springs. The heavenly statutes sternly warn: do not recklessly proclaim this.\n\nAll who receive the Jade Purity’s hidden script and the inner inscription of the carved stone must first purify themselves with a seven-day fast. Upon completion of the fast, they shall present thirty feet of brocade silk, nine pairs of golden rings, and make an oath before the Northern Emperor, swearing an alliance before transmission. Those who maintain long fasts must sever ties with the mortal world, their bodies untouched by impurity, their forms pure and qi clarified, before they may cultivate and practice this Dao. The Great One shall oversee the trial, the Controller of Destinies shall determine their life, the mysterious response shall wondrously inform, ascending to the Jade Purity. The Imperial Lord shall rejoice in fear, and the assembled perfected shall attend the court. When the Dao is perfected through ten thousand recitations, they shall ascend in a green chariot, joining the dark floating clouds to reach the Imperial Court.\n\n**Highest Method for Diminishing Demons and Slaying Ghosts**\n\nOn *jiǎ*-*yǐ* days, the Ghost-Culling Capital Officer, surnamed Song, named Ju Ying, presides over the register of the ten thousand ghosts of *jiǎ*-*yǐ* days.\nOn *bǐng*-*dīng* days, the Ghost-Culling Capital Officer, surnamed You Tong, named Fa Sheng, presides over the register of the ten thousand ghosts of *bǐng*-*dīng* days.\nOn *wù*-*jǐ* days, the Ghost-Culling Capital Officer, surnamed Huang, named An Zheng Li, presides over the register of the ten thousand ghosts of *wù*-*jǐ* days.\nOn *gēng*-*xīn* days, the Ghost-Culling Capital Officer, surnamed Bo, named Xi Zi Liu, presides over the register of the ten thousand ghosts of *gēng*-*xīn* days.\nOn *rén*-*guǐ* days, the Ghost-Culling Capital Officer, surnamed Zheng, named Xuan Qiu Bo, presides over the register of the ten thousand ghosts of *rén*-*guǐ* days.\n\nThe Jade Emperor states: These Five Emperors’ Ghost-Culling Capital Officers all receive the title of Pure Void from the Northern Emperor. Though they preside over the culling of ghosts, their rank is not insignificant, for they are revered by the Five Peaks and relied upon by cultivators. Every 2,400 years, they ascend to the Jade Purity to become the officials of the General Immortals. If cultivators do not know the inner names of the Capital Officers or lack the jade script for slaying ghosts, demons and ghosts shall surely test them, corrupting their immortal rectitude.\n\nAll the myriad ghosts of the Northern Emperor, the demons of the world, and the suffering souls who have not yet ascended, whose names are recorded in the Northern Fengdu, are entirely governed by these officers. Those who know their names shall diligently record them in the Nine Heavens, the ten thousand demons shall be extinguished, the myriad ghosts shall hide their forms, and there shall be no further trials or defeats—immortality shall naturally be achieved. Yet this is a secret of the Highest Heavens, concealed within the Jasper Terrace and not transmitted to the lower world. Those who lightly divulge it shall be subjected to the trials of the wind and blade, and their seven generations of ancestors shall be punished upon Mount Meng.\n\nThese divine officers wear crowns of interwoven seven treasures and kingfisher feathers, jade hairpins, robes of purple silk edged with golden flowers and kingfisher feathers, white sashes, crimson skirts, vermilion shoes, and red-embroidered narrow garments, bearing five-colored ceremonial banners.\n\nThe *Northern Emperor’s Cold Numinosity Jade Scripture for Diminishing Demons and Slaying Ghosts* is received from the Highest Three Heavens, guarded by thirty-six jade maidens. It is also called the *Nine Heavens’ Life-Numinosity Scripture*, worn by the Highest Divine Numinous-Shao King. To slay the ghosts of *jiǎ*-*yǐ* days, one must transcribe the script in vermilion and present a white memorial [above], one foot and two inches in length, three inches and two fen in width, placing it upon the west at *gēng*, or upon *xīn* on *yǐ* days. Hold the breath for seven breaths, knock the left teeth thirty-six times, and recite the incantation:\n\n*\"Riding the heavens, treading the qi, I carry out the mighty decree. The Highest Jade Scripture universally subdues the ten thousand evils. The Cold Numinosity receives restraint, stern as the heavenly bell. I solemnly command the Capital Officer to govern and restrain the Northern Fengdu. First execute the ghostly souls, then sever the demon kings. Great and small shall be extinguished, high and low shall be overthrown. As the heavens command, cut off their breath in the Palace of Fire. The Great One oversees the decree, the Five Elders hasten the work. Heaven is clear, earth is bright, the ten thousand passages are opened. All under the charge of *jiǎ*-*yǐ* shall respectfully obey.\"*\n\nUpon completion, draw in the qi and swallow it seven times to conclude. Practicing this for seven days, the heavenly demons will bind their forms and manifest their images, submitting to service before your eyes. Ghostly souls shall be extinguished, and the myriad spirits will perish of themselves. Inscribe in vermilion on white silk and wear it upon your person, and you may traverse the world—all demonic trials shall be eradicated, and the ten thousand ghosts will dare not interfere. You may command eight Vermilion Elixir Jade Maidens. These divine officers wear robes of golden splendor with green and crimson silk, yellow skirts, and azure gauze undergarments, with sashes, crowns, and footwear as before.\n\nThe Vermilion Numinosity Jade Text for the North Emperor to extinguish demons and slay ghosts was received in the Highest Three Heavens, guarded by sixty-four Jade Maidens of the Vermilion Palace. One is named *She-Slaughtering Statute*, worn by the Highest Vanquisher of Demon Kings.\n\nTo slay ghosts on *bǐng*-*dīng* days, inscribe the text in yellow on a black memorial, one foot and two inches in length, three inches and two fen in width. Place it in the north at *rén* on *bǐng* days, or at *guǐ* on *dīng* days. Hold the breath for five breaths, knock the teeth thirty-six times, and recite the incantation:\n\n*\"The Highest proclaims the decree, universally subduing the ten thousand spirits. The Capital Officer receives the talisman, reviewing the cases in Jade Clarity. Supervising the Northern Fengdu, he itemizes and delivers the names of demons. What the Celestial Emperor requires, none shall delay in presenting. The August Elders oversee the decree, the Five Immortals command the troops. Heavenly Unity wields the halberd, slaying without cease. Ten thousand times ten thousand shall submit to the law, a thousand times a thousand shall have their forms destroyed. All under the *Slaughtering Statute*’s restraint shall be utterly purged.\"*\n\nUpon completion, draw in the qi and swallow it five times to conclude. Practicing this for five days, ghosts and demons will bind their forms and reveal their images, submitting to service before your presence. The myriad evils shall be eradicated, and the thousand spirits will perish of themselves. Inscribe in yellow on dark silk and wear it upon your person, and as you traverse the world, all demonic evils shall be vanquished, and the host of spirits will dare not interfere. After five years, you may command twelve Yellow Silk Jade Maidens. These divine officers wear robes of golden splendor with black trim and purple silk, crimson skirts, and yellow brocade undergarments, with sashes, crowns, and footwear as before.\n\nThe White Numinosity Jade Text for the North Emperor to extinguish demons and slay ghosts was received in the Highest Three Heavens, guarded by thirty-six White Numinosity Jade Maidens. One is named *Nine Heavens’ Military Missive*, worn by the Jade Clarity and Jade Firmament Kings.\n\nTo slay ghosts on *gēng*-*xīn* days, inscribe in black on a vermilion memorial, one foot and two inches in length, three inches and two fen in width. Place it in the south at *bǐng* on *gēng* days, or at *dīng* on *xīn* days. Hold the breath for three breaths, knock the left teeth thirty-six times, and recite the incantation:\n\n*\"Heaven opens, earth communicates, the mysterious qi shines clear. Sweeping away floating obscurities, the Five Paths gleam brightly. Bearing the Emperor’s decree, I review and restrain the ten thousand spirits. Those under the Northern Fengdu’s charge shall be strictly bound to their true forms. What the Highest restrains shall promptly manifest their qi. The demonic hordes shall come of themselves, ghostly souls shall be extinguished of their essence. Wind arises, lightning strikes—from heaven, all is sternly pacified. All shall obey the mysterious talisman, submitting to the law in the Emperor’s court.\"*\n\nUpon completion, draw in the qi and swallow it three times to conclude. Practicing this for three days, ghosts and demons will bind their forms and manifest their images, submitting to service before your eyes. The myriad demons shall submit to the law, and the host of evils shall be eradicated. Inscribe in black on vermilion silk and wear it upon your person, and as you traverse the world, the ten thousand demons shall flee in hiding, and the host of spirits will dare not interfere. After three years, you may command five Great Mystery Jade Maidens. These divine officers wear robes of golden splendor with green trim and crimson silk, black-edged, red skirts, and azure gauze undergarments, with sashes, crowns, and footwear as before.\n\nThe Mighty Numinosity Jade Text for the North Emperor to extinguish demons and slay ghosts was received in the Highest Three Heavens, guarded by twenty-five Great Mystery Jade Maidens. One is named *Mighty Divine Jade Tally*, worn by the Jade Clarity Vanquisher of Demon Kings.\n\nTo slay ghosts on *rén*-*guǐ* days, inscribe in azure on a yellow memorial, one foot and two inches in length, three inches and two fen in width. Place it in the center at *wù* on *rén* days, or at *jǐ* on *guǐ* days. Hold the breath for twelve breaths, knock the teeth thirty-six times, and recite the incantation:\n\n*\"Heaven topples, earth surges, the four seasons restrain their light. The Five Phases hasten to review, examining and fixing the ten directions. The Celestial Emperor ascends his floating throne, the August Elders emerge from their chambers. What the Highest punishes shall be sternly eradicated without mercy. First execute the ghostly souls, then sever the host of evils. A thousand demonic trials, ten thousand tests—none shall fail to submit. All shall obey the Jade Text, the Flowing Bells of the Eight Directions. The *Huoluo* cross in flight, mountains and peaks collapse. Upholding heaven and obeying the decree, the Capital Officers unite in merit.\"*\n\nUpon completion, draw in the qi and swallow it twelve times to conclude. Practicing this for twelve days, ghosts and demons will bind their forms and manifest their images, submitting to service before your eyes. The myriad demons shall be extinguished, and the host of demonic trials shall perish of their essence. Inscribe in azure on yellow silk and wear it upon your person, and as you traverse the world, the ten thousand ghosts shall flee of themselves, and the thousand demonic trials shall conceal their images. After twelve years, you may command nine Azure-Waisted Jade Maidens. These divine scribes wear robes of golden splendor with kingfisher trim and vermilion gauze, red-edged crimson skirts, and white-embroidered undergarments, with sashes, crowns, and footwear as before.\n\nThe Cavern Numinosity Jade Text for the North Emperor to extinguish demons and slay ghosts was received in the Highest Three Heavens, guarded by twelve Yellow Silk Jade Maidens. One is named *Yellow Divine Mighty Tally*, worn by the Highest Jade Emperor Lord.\n\nTo slay ghosts on *wù*-*jǐ* days, inscribe in white on a cyan memorial, one foot and two inches in length, three inches and two fen in width. Place it in the east at *jiǎ* on *wù* days, or at *yǐ* on *jǐ* days. Hold the breath for nine breaths, knock the left teeth thirty-six times, and recite the incantation:\n\n*\"Within the Yellow Center, the qi is ordered, decrees are issued to the Nine Heavens. The Three Numinosities respond to the talisman, the Five Elders review the immortals. Hastening to supervise the North Emperor, they bind and deliver demonic forms. The host of evils shall be blinded, unable to shift or escape. What the Celestial Emperor proclaims shall be pursued and captured without exception. Should any dare to transgress, they shall be swiftly restrained at Fengdu Mountain. Clear as the Emperor’s trust, I face the Jade Dawn.\"*\n\nUpon completion, draw in the qi and swallow it nine times to conclude. Practicing this for nine days, ghosts and demons will bind their forms and manifest their images, submitting to service before your eyes. The myriad demons shall be extinguished, and the host of demonic trials shall perish of their essence. Inscribe in white on cyan silk and wear it upon your person, and as you traverse the world, the ten thousand ghosts shall submit and flee, the thousand demonic trials shall conceal their images, and none shall dare to interfere. After nine years, you may command seven White Numinosity Jade Maidens.\n\nThe Jade Emperor states: The Jade Text for Slaying Ghosts emerges from the Hidden Void of the Nine Heavens, bestowed by the Most High upon the Chief Scribe for Slaying Ghosts to govern the myriad demons and eradicate the host of malevolent spirits. Even the Demon-Quelling King and the Divine Empyrean King received it from the arcane incantations of the Most High’s divine wisdom, concealed within the Jade Purity. All who aspire to immortality and traverse renowned mountains, enduring perilous obstacles, must adhere to and perform these rites. When ascending to recite scriptures in purification or seeking the Dao of flight, they should likewise employ these methods to repel demonic trials. In places where ghosts abound among mortals, these rites must also be performed to extinguish ghostly and demonic influences. Those who practice this Dao must do so with utmost sincerity, unwavering resolve, and no trace of doubt, following the prescribed days. Then, the heavenly demons shall reveal their forms and submit to judgment. Should any fail to manifest their true forms, it is because their own impurities remain unresolved, though the ghosts and demons shall still be bound in darkness and receive their forms from the Chief Scribe. If frivolous practitioners, lacking purity of intent, rashly summon ghosts, the ghosts shall instead harm them, bringing great calamity. Be vigilant and do not act carelessly.\n\nThe Jade Purity Divine Empyrean King states: Ghosts and demons are cunning and endlessly transformative—now sinking, now rising; now appearing, now vanishing; now gathering, now concealing; now hiding, now manifesting; now in qi, now dead, now alive; now soaring in clouds, now dwelling in empty caverns. Their five-colored forms flicker and shift, never constant. All such beings derive their power from the governance of the Six Heavens, subject to the decree of the Three Heavens, existing within their allotted span. Thus, they indulge in their malevolence. The Most High, observing that later learners are often crafty and mortal hearts impure, with harm proliferating and wickedness flourishing, permits their existence to awe the people, aligning the true to punish the false, and employing them as officials to examine and test. Therefore, their root and kind are not eradicated. When their allotted span ends, their qi shall naturally dissipate, and mortal hearts shall spontaneously purify, allowing learners to naturally attain immortality.\n\nGhosts, as entities, are greedy and impure, their malevolence born of their own nature. They test later learners, no longer possessing truth, for the Nine Heavens reveal their forms in reverse. Thus, the Five Emperors’ Jade Text for Slaying Ghosts was established to restrain their violence. If later learners obtain this text, the ghosts and demons shall self-destruct, and their malevolent trials shall not interfere. The prohibitions of the Nine Heavens, in accordance with the Bright Statutes of the Four Poles, permit transmission to one person every seven hundred years. Those who lightly disclose or neglect it shall suffer great calamity. Adhere carefully and practice diligently.\n\nThe Most High Demon-Quelling King states: Even perfected True Persons who have attained transcendence are tested by malevolent demons—how much more so for ordinary learners? Those who fail to achieve immortality yet are not tested are protected by the Nine Heavens’ demonic restraints. Thus, demons must first test their alignment with truth or falsehood. Those who receive demonic protection shall ascend to heaven in broad daylight—how could they be faulted by demons? Yet demons seek only to cause failure, not to allow success. Therefore, the Most High exposes their violence and establishes the Jade Text for Slaying Ghosts, the chapters for extinguishing demons, and the Jade Emperor’s divine wisdom, all to prevent and eradicate this violence. If demons test with reason, there is no need for further methods of eradication. Later learners must therefore diligently cultivate and employ the Jade Text, reciting the Jade Emperor’s divine wisdom to avert such disasters. Without receiving the qi of the Jade Void and forming the radiant jade embryo, those who vainly seek bodily flight shall only weary themselves in futile toil, achieving nothing of their aspirations.\n\nThe Supreme Method of the Nine Heavens for Expelling Malevolent Spirits and Divine Wisdom\nThe Great Wisdom of the Hidden Mystery Jade Emperor of the Highest Clarity, also called the Inner Method of the Nine Heavens’ Divine Incantation for Expelling Demons.\n\nThese scriptural texts embody the supreme Dao of the August Void, the divine secrets of the Most High, gathering the true essence of spiritual destiny, extinguishing demonic influences, and commanding the Six Heavens. They summon and guard divine soldiers, shatter malevolent spirits, and execute perverse essences. They were established during the Jade Emperor’s great trial as the law of the Three Heavens. When the resounding tones of jade chime, malevolent impurities are dispelled, mountain spirits are annihilated, and the myriad spirits submit to service. Divine transcendents assist and protect, the Nine Demons submit their forms, cold spirits lose their qi, the Celestial Blade shines upward, and divine might presses downward. Poisons are repelled, trials are averted, and the myriad demons vanish without trace.\n\nThis method must never be lightly disclosed. Those who transmit it must swear solemn oaths and vow not to reveal it. Should they violate their oaths and disregard the prohibitions, their bodies shall become lowly ghosts, eternally confined in hell, while their seven generations of ancestors shall suffer the punishments of the Wind Blade.\n\nThe Divine Incantation of the Nine Heavens Jade Emperor states:\nThe transformation of the Nine Heavens perpetually generates the Dao,\nPreserving the luminous Great Prime, its radiance veiled in vermilion jade.\nAbiding in the cinnabar mystery, receiving service in the Jade Purity,\nTen revolutions, nine passages, seven blends, five completions.\nDivine splendor blazes, shaking the imperial court with its strategy.\nThe Dao attains three transformations, recording the destiny of spirits and numina.\nThe Jade Emperor disperses wisdom, the Hidden Mystery Feathered Scripture,\nA thousand perfected ones incline their wheels, the Five Emperors command their expeditions.\nClad in vermilion kerchiefs and feathered robes, they array themselves in the imperial court,\nGirded with the divine tiger on the left, wielding golden soldiers on the right.\nThe Nine Heavens’ expedition, brandishing fiery bells,\nExtinguishes demons, shatters spirits, severs perversity, and corrects essences.\nWind and fire resound in majesty, the Six Heavens collapse,\nThe Northern Fengdu is breached, the Nine Demons’ spirits are sealed.\nThose who oppose the Dao are executed; those who follow transformation live.\nThe Emperor delegates command, ordering divine soldiers to guard.\nA thousand perversities are extinguished, ten thousand ghosts find no rest.\nShould any dare to test or interfere, they are delivered to the Celestial Soldiers.\nDemons are extinguished, poisons are punished;\nOnce extinguished and punished, perversity is restrained and essence recorded.\nThe Six Heavens are executed, their might shaking the Seven Spirits.\nPrecious spirits drive out impurity, the Empyrean surges through the Three Clarities.\nThe myriad perfected ones receive service, assembling in the imperial court.\nThe Six Symbols harmonize, the Seven Dawns shine brightly.\nDivine winds scatter demons, the Dao flows without name.\nDivine wisdom extinguishes demons, the Jade Emperor’s incantation arises.\nThe Nine Heavens bestow command, gathering the true and governing the numinous.\nI humbly receive the Emperor’s mandate—thus the immortal Dao is revealed.\n\nUpon completing the incantation, strike the teeth thirty-six times and swallow saliva ten times. Thus the ritual concludes, and one may retire.\n\nShould a Daoist travel alone or lodge in a place of unsettling energy—whether in forests, temples, or regions where mountain spirits and malevolent ghosts abound, ever eager to assail and test mortals—those who feel their spirit tremble in fear ought to recite the Jade Emperor’s divine incantation to dispel and repel them. Once the numinous sound resounds, celestial demons are vanquished, myriad evils scatter, and divine perfected ones encamp in defense.\n\nIf one lodges among a multitude of ten thousand, on that very night, wondrous spiritual responses shall arise: divine soldiers will manifest in protection, striking down treacherous fiends, driving out inauspicious impurities. The Three Palaces receive the true, the Five Emperors lend their aid, the inner numinous gates are fortified, and outer pernicious qi is subdued. Thus the spirit is serene, the body at peace, and all fear dispelled.\n\n**The Jade Emperor’s Incantation for Ghostly Defense and Numinous Protection**\n\nThe Jade Emperor’s incantation states:\nThe Nine Heavens issue command, upholding the Jade Clarity.\nHasten the summoning of a thousand perfected ones, assembling in the imperial court.\nThe Supreme One gazes below, the Twin Sovereigns flank his form.\nThey survey the myriad evils, ordering qi and safeguarding life.\nShould any inauspicious force dare test the divine,\nInvoke the Emperor’s Dao, dispatching the divine soldiers to order.\nSeven spirits wield halberds, celestial blades march to the right.\nBrandishing swords at the vanguard, they hurl flaming bells.\nSummon the armored couriers, the martial legions of Heavenly Soldiers.\nWind and fire unite in battle, vanquishing evil and refining essence.\nAbove, they overawe the Six Heavens; below, they subdue demonic spirits.\nOnce awed and subdued, the myriad fiends are extinguished in form.\nDivine spears sweep like lightning, leaving no trace of treacherous demons.\nThe Immortal Sovereigns hold the tally—who dares delay the command?\nThose who defy the tally or violate the decree shall be executed and punished.\nLet each respect and take heed, preserving this Yellow Tranquility.\nThe Nine Heavens proclaim the mandate—let all spirits heed with reverence.\n\nShould you, the adept, walk at night in fear, your heart trembling and resolve faltering—whether in the grip of nightmares, when demons test mortals, or when malevolent forces violate the true and disrupt qi, seeking to sicken and harm—hasten to perform the Jade Emperor’s method for numinous protection.\n\nThe adept must concentrate the mind upon the utmost Dao, seeking deliverance from the imperial realm. Face north, strike the teeth thirty-six times, hold the breath, and silently recite the incantation to completion. Then strike the teeth ten more times as before, and swallow saliva ten times. Thus treacherous evil is shattered, demonic forces subdued and extinguished. The Seven Spirits entwine in defense, the Supreme One surveys and subdues. The myriad spirits guard the true, and outer pernicious qi is overawed.\n\nThis may also be recited daily, vibrating the voice in recitation, whether seated or reclining, to bar the approach of all demonic tests and seal the inauspicious traces of treacherous ghosts. Before retiring each night, one may also recite it, ensuring the spirit’s peace, dispelling nightmares and malevolent influences, dissolving all poisons and evils, and securing a life free from fear.\n\nOn days when the incantation is practiced, one need not face north or hold the breath. The purpose of holding the breath and reciting silently is this: when demonic forces have already tested one’s surroundings and treacherous spirits have violated the chamber of the spirit, the divine command is issued to the true to reclaim and suppress their malevolence. The incantation for external repose, however, does not follow this same method.\n\nHere ends the *Highest Clarity’s Supreme Scripture of the Jade Emperor’s Numinous Wisdom for Extinguishing Demons*, from the *Hidden Writings of the Jade Clarity*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真高上玉清隐书经 经名：洞真高上玉清隐书经。 简称《玉清隐书》。 撰人不详，约出於东晋。 系早期上清派重要经典。 原本有四卷八篇，后分作四种。 即：《上清太上玉清隐书灭魔神慧高玄真经》三篇； 《上清高上灭魔玉帝神慧玉清隐书》三篇； 《上清高上灭魔洞景金元玉清隐书经》一篇； 《上清高上金元羽章玉清隐书经》一篇。 底本出处：《正统道藏》正一部。 上清高上灭魔玉帝神慧玉清隐书经 高上玉清刻石隐铭内文 上清高上刻石内文，玉清上宫北壁隐书鬼神内铭，高上玉帝以传太微天帝君。 三道立正，太微天帝君以授后圣太平道君，以刻书酆都六宫，下制北帝酆都之山。 道君书其文，备游十天，召神灭魔，威伏万精，封检五岳，束缚群灵，上披天关，回转五星，纵景万变，真光洞明，流金交焕，十天郁冥，欲杀者杀，欲戮者戮，适意所造，平断死生。 其道严妙，玉帝之精，有见其文，不学立成，北酆落死，青华记名，真仙来朝，上造王庭。 玉清隐书，玄旨秀灵，琼音洞微，妙趣明彻，八电激威，制灵使气，策召璇玑，输转五辰，七星奔移，坐命九天，万神总归，玉司浮位，二景停晖，千精伏窜，群魔灭摧，咏其辞则天关洞开，说其咒则万真解怀，紫霞流映，金仙侍灵，天元敷庭，八风肃清，玄光冥滞，三景合明，天渊静波，巨虬严征，神虎振威，毒兽罗兵，斩馘不祥，妖魔伏形，万万受事，千千皆平，五通七合，三气齐并。 子有玉骨，当寻宝经，勤心苦行，克造云营，上之玄宫，朝谒三清。 酆都山在北方癸地，山高三千六百里，周回三万里。 其山洞天在山高下，周迥一万五千里，其上下并有鬼神宫室，山上有六宫，洞中又有六宫，一宫辄周回千里。 是为六天鬼神之宫，二处合一十二宫，上宫主鬼，洞中主神，生死之所由名簿，悉隶北帝君也。 玉清刻石隐铭内文二篇，一篇制鬼，一篇检神。 十二宫北壁，辄刻一篇隐铭内文也。 第一宫名纣绝阴天宫，第二宫名泰杀谅事宗天宫，第三宫名明晨耐犯武城天宫，第四宫名恬照罪气天宫，第五宫名宗灵七非天宫，第六宫名敢司连宛屡天宫。 右六宫治酆都山上，主领万鬼，总统地上人民之死生。 玉帝刻石隐铭，以书宫北壁，制检群凶，不使横暴，枉害生民。 学者得佩此文，则万鬼卫身，北酆落名，度命南宫，得为真人也。 酆都山洞中六宫，主领万神玉帝隐铭刻名文，书宫北壁，以制六宫万神之灵。 第一宫名休明总灵洞天宫，第二宫名玄司重正宗虚天宫，第三宫名统仙升灵希微天宫，第四宫名正真邵灵宛司天宫，第五宫名云楼玉纪明朗天宫，第六宫名崇虚赤映云由天宫。 右酆都山洞中宫名，总领万神，生死簿录，莫不系之。 若有知洞中六宫之名，佩玉帝隐文，南神内朝，不复害人，北酆落除死目，度名南宫，真神卫从，白日升天。 右玉清刻石隐文，以朱书青缯三尺佩之，兼青书所住北壁，出入行来，远近万鬼朝己，千鬼卫真。 此玄古道，玉清隐文，得者神仙，不复隶於酆都之宫。 受者秘之，慎勿示人。 有金骨玉名，名参青官，得有此文，当依玄科，七百年内听得三传。 传非其人，北帝为所奏，殊延七祖，长充鬼责，身没形残，万不得仙。",
      "translated_text": "**The Supreme Perfected Jade Purity Hidden Writ of the Cavern of Reality**\n\n**Scripture Title:** *The Supreme Perfected Jade Purity Hidden Writ of the Cavern of Reality* (abbreviated as *The Jade Purity Hidden Writ*). Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. Originally comprising four scrolls and eight chapters, later divided into four texts:\n\n1. *The Supreme Perfected Jade Purity Hidden Writ of the Cavern of Reality: Scripture of Divine Wisdom and Primordial Perfection for Annihilating Demons* (three chapters);\n2. *The Supreme Perfected Scripture of the Jade Emperor’s Divine Wisdom for Annihilating Demons from the Jade Purity Hidden Writ* (three chapters);\n3. *The Supreme Perfected Scripture of the Cavern of Radiance’s Golden Primordial Jade Purity Hidden Writ for Annihilating Demons* (one chapter);\n4. *The Supreme Perfected Scripture of the Golden Primordial Feathered Chapters from the Jade Purity Hidden Writ* (one chapter).\n\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Zhengyi Section, First Division.\n\n---\n\n### *The Supreme Perfected Scripture of the Jade Emperor’s Divine Wisdom for Annihilating Demons from the Jade Purity Hidden Writ*\n\n#### **Inner Text of the Jade Purity Inscribed Stone Hidden Inscription**\n\nThe inner text of the Supreme Perfected inscribed stone, the hidden inscription of spirits and gods on the northern wall of the Jade Purity Upper Palace, was transmitted by the Supreme Jade Emperor to the Celestial Emperor of the Grand Tenuity. The Three Ways establish rectitude, and the Celestial Emperor of the Grand Tenuity bestowed it upon the Later Sage, the Lord of the Dao of Great Peace, who inscribed it upon the Six Palaces of Fengdu and commanded the Northern Emperor to govern the mountains of Fengdu.\n\nThe Lord of the Dao inscribed its words, traversing the Ten Heavens to summon spirits and annihilate demons, overawing the myriad essences, sealing the Five Peaks, binding the host of spirits, ascending to unlock the Celestial Pass, revolving the Five Stars, unfurling a myriad transformations of radiance. The true light illumines with clarity, molten gold intermingles in splendor, and the Ten Heavens darken in obscurity. Those to be slain are slain, those to be executed are executed; all accords with the will, and life and death are judged with equity.\n\nThis Way is solemn and wondrous, the essence of the Jade Emperor. Those who behold its text achieve mastery without study. The dead of the Northern Fengdu are erased, names recorded in the Azure Flower Register, and perfected immortals come to pay homage, ascending to the royal court of the Upper Realm.\n\nThe Jade Purity Hidden Writ holds the mysterious purport of numinous subtlety, its jade-like tones penetrating the profound, its wondrous import luminous and penetrating. The eight thunders unleash their might, commanding spirits and deploying qi, directing the turning of the celestial pivot, rotating the Five Celestial Bodies. The Seven Stars hasten in motion, seated to command the Nine Heavens. The myriad spirits submit in totality, the Jade Bureau assumes its floating station, the Two Radiant Ones pause their brilliance, a thousand essences cower in retreat, and the host of demons are crushed and annihilated. Chanting its verses opens the Celestial Pass; reciting its incantations loosens the hearts of the myriad perfected. Purple auroras flow in reflection, golden immortals attend in spirit, the Primordial Heaven spreads across the court, the Eight Winds are solemn and clear. The mysterious light lingers in obscurity, the Three Radiant Ones merge in brightness, the celestial abyss lies in tranquil waves, mighty dragons stand in solemn array, divine tigers display their might, venomous beasts gather as troops, severing the heads of inauspicious omens. Demons and monsters assume their proper forms, ten thousand times ten thousand receive their duties, a thousand times a thousand are all pacified. The Five Penetrations and Seven Unions align, and the Three Qi converge as one.\n\nYou who possess jade bones must seek the treasure scriptures, cultivate with diligent and arduous practice, and ascend to the Cloudy Encampment, reaching the Mysterious Palace to pay homage to the Three Pure Ones.\n\nThe Fengdu Mountains lie in the northern *gui* region, rising three thousand six hundred *li* in height, with a circumference of thirty thousand *li*. The grotto-heaven within the mountains spans fifteen thousand *li* in circumference, both above and below containing palaces of spirits and gods. Atop the mountain stand Six Palaces, and within the grotto lie another Six Palaces, each palace extending a thousand *li* in circumference. These are the palaces of the Six Heavens’ spirits and gods, twelve in total, with the upper palaces governing ghosts and the grotto palaces governing spirits. The registers of life and death derive their names from here, all subject to the Northern Emperor.\n\nThe Jade Purity inscribed stone hidden inscription comprises two chapters: one to govern ghosts, the other to restrain spirits. On the northern walls of the twelve palaces, one chapter of the hidden inscription is engraved in each.\n\n**First Palace:** Palace of the Cut-Off Yin of Zhou;\n**Second Palace:** Palace of the Grand Execution and Faithful Affairs;\n**Third Palace:** Palace of the Bright Dawn Enduring Transgressions in the Martial City;\n**Fourth Palace:** Palace of the Tranquil Illumination of Sinful Qi;\n**Fifth Palace:** Palace of the Seven Errors of the Ancestral Numinous;\n**Sixth Palace:** Palace of the Daring Controller of Repeated Offenses.\n\nThe above Six Palaces govern the Fengdu Mountains, presiding over the myriad ghosts and administering the life and death of the people upon the earth. The Jade Emperor’s inscribed stone hidden inscription is written upon the northern walls of the palaces to restrain the host of malevolent forces, preventing them from wanton violence and unjust harm to the living. Those who obtain and bear this text shall be guarded by the myriad ghosts, their names erased from the Northern Fengdu, their fate transferred to the Southern Palace, and they shall become perfected beings.\n\nThe Six Palaces within the grotto of the Fengdu Mountains govern the myriad spirits. The Jade Emperor’s hidden inscription of names is written upon the northern walls of the palaces to restrain the numinous powers of the Six Palaces and their myriad spirits.\n\n**First Palace:** Palace of the Radiant and Illuminating Grotto-Heaven of Total Numinosity;\n**Second Palace:** Palace of the Mysterious Controller of the Weighty and Upright Ancestral Void;\n**Third Palace:** Palace of the Unifying Immortals Ascending to the Subtle and Rare;\n**Fourth Palace:** Palace of the Upright and Perfected, the Luminous Controller of the Curved;\n**Fifth Palace:** Palace of the Cloudy Jade Record of Luminous Clarity;\n**Sixth Palace:** Palace of the Lofty Void and Crimson Reflection of the Cloudy Origin.\n\nThe above names of the Six Palaces within the Fengdu Mountains govern the myriad spirits, and the registers of life and death are all bound to them. Those who know the names of the Six Palaces within the grotto and bear the Jade Emperor’s hidden inscription shall have the Southern Spirits pay inner homage, no longer harming people. Their names of death are erased from the Northern Fengdu, their fate transferred to the Southern Palace, with perfected spirits as guards and attendants, ascending to heaven in broad daylight.\n\nThe Jade Purity inscribed stone hidden text is to be written in vermilion on a three-*chi* length of blue-green silk and worn upon the body. Additionally, write it in blue-green upon the northern wall of one’s dwelling. When coming and going, near and far, the myriad ghosts shall pay homage to you, and a thousand ghosts shall guard the perfected. This is the mysterious ancient Dao, the Jade Purity hidden text. Those who obtain it become divine immortals, no longer subject to the palaces of Fengdu.\n\nThose who receive it must keep it secret and take care not to show it to others. Those with golden bones and jade names, whose names are recorded in the Azure Bureau, having obtained this text, must follow the mysterious regulations. Within seven hundred years, they are permitted to transmit it three times. If transmitted to an unworthy recipient, the Northern Emperor shall report the offense, extending punishment to the seven generations of ancestors, who shall forever bear the burden of ghostly retribution. Their bodies shall perish, their forms be destroyed, and they shall never attain immortality.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1238,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.61158299446106,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上灭魔玉帝神慧玉清隐书.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "右玉清刻石隐文内铭，凡九十一言，玉帝刻书酆都洞天六宫北壁，以检制万神。 若有玉骨，名书紫清，得遇此文，当以朱书青缯三尺佩之，又朱书所住北壁，则真仙下降，万灵卫形，千妖伏窜，天魔丧精，威制十天，总统众生，纵景变体，万化立成，乘空驾浮，飞行玉清。 轻泄宝文，殃连七玄，身没鬼官，永不得仙。 凡受玉清隐文洞景金玄之章，诵咏万褊，常呼酆都上下六宫名万徧，自当洞解刻石隐名。 此音发於高上玉虚之天，自然之篇，皆着天魔内名，或表九天玉章，其辞幽远，非始学凡夫所可意通。 自非大帝下降，坐致琼轩，参晨乘云，驾浮洛景紫天，不得谙究此铭。 后学有心者，得见此篇，皆东华书名，骨相合仙，天真降感，故受此文。 但当依法佩身，以却万灵，道满气澄，必得洞览隐音，游行玉清也。 凡受玉清隐书洞景金玄之章，而无玉帝刻石隐铭内文，皆不得诵咏金玄之章。 轻诵骇动高上，万魔乘机而生。 徒有隐铭内文，而不受洞景金玄，亦无以制魔。 上下相部，二用齐并，三景合契，万气肃清。 《金根经》言：凡修大洞，当坐震灵； 凡修金玄，当佩隐铭。 其道至妙，藏於玉虚九曲之房，金神侍卫，玉华执巾，三十六真典领玉篇，违科犯禁，列奏三清，身没鬼官，长责幽泉，天科重告，慎勿妄宣。 凡受玉清隐书刻石内铭，皆先清斋七日，斋竟，然后赍锦缯三十尺，金镮九双，告北帝而盟，誓而传。 长斋之士，绝交人间，身不染秽，体清气澄，乃得修行行此道。 太一监试，司命定生，玄感妙告，上彻玉清，帝君惧悦，群真诣庭，万遍道备，克乘绿軿，参驾玄浮，上造帝庭。 高上减魔杀鬼上法 甲乙日杀鬼都伯吏，姓宋，名巨映，主领甲乙日万鬼目录。 丙丁日杀鬼都伯吏，姓友筒，讳法生，主领丙丁日万鬼目录。 戊己日杀鬼都伯吏，姓黄，讳安正理，主领戊己日万鬼目录。 庚辛日杀鬼都伯吏，姓帛，讳西子留，主领庚辛日万鬼目录。 壬癸日杀鬼都伯吏，姓郑，讳玄丘伯，主领壬癸日万鬼目录。 玉帝曰：此五帝杀鬼都伯吏，皆受北帝清虚之号，虽为领杀鬼之主，至於谐级，亦不为轻，乃五岳所宗奉，学者所仰凭也。 其例二千四百年，皆转升玉清，为总仙之官也。 学者不知伯吏内名，又无杀鬼玉文，鬼魔莫不干试，毁其仙正也。 诸以北帝万鬼，天下群魔，及苦爽未升者，名隶北酆，悉总主之，有知其名，则勤录九天，万魔灭凶，群鬼匿爽，将无复试败之患，必自然成真也。 然此高上所秘，藏之於瑶台，不传於下世。 轻泄者役身负风刀之考，七祖受罚於蒙山也。 此神吏，七宝间翠元冠，碧玉簪，金华翠缘，紫绡之服，白绶，绛裙，朱履，红绣窄衣，执棨幡五色。 北帝寒灵灭魔杀鬼玉文，受之於高上三天，卫以玉女三十六人，一名九天命灵文，高上神霄王所佩，欲杀甲乙日鬼，当朱书文白奏〔上〕#1，长一尺二寸，广三寸二分，置西方庚上，乙日辛上，闭气七息，叩左齿三十六通，咒曰： 乘天履气，奉行威章，高上玉文，普摄万凶，寒灵受制，严如天钟，明告伯吏，检制北酆，先戮鬼爽，后剪魔王，大小灭种，高下摧崩，如天之命，绝气火宫，太一监诏，五老促翁，天清地朗，万津开通，甲乙所执，靡不敬从。",
      "translated_text": "The inscribed text within the Jade Purity’s carved stone hidden script comprises ninety-one words. The Jade Emperor engraved this upon the northern wall of the Six Palaces of Fengdu Grotto-Heaven to govern and restrain the myriad spirits. Those with jade bones, whose names are recorded in the Purple Purity, upon encountering this text, must transcribe it in vermilion upon a three-foot length of green silk and wear it, and also inscribe it in vermilion upon the northern wall of their dwelling. Then true immortals shall descend, the ten thousand spirits shall guard their form, the thousand demons shall flee in terror, the heavenly demons shall lose their essence, their might shall command the Ten Heavens, and they shall govern all beings. Their luminous spirit shall transform their body, and the ten thousand transformations shall be instantly accomplished. They shall ride the void and mount the floating clouds, soaring through the Jade Purity. To lightly divulge this precious script brings calamity upon the seven mysteries; the body perishes into the offices of ghosts, and one shall never attain immortality.\n\nAll who receive the Jade Purity’s hidden script, the *Dongjing Jinxuan* chapter, must recite it ten thousand times and constantly invoke the names of the upper and lower Six Palaces of Fengdu ten thousand times. Then they shall naturally comprehend the hidden names inscribed upon the stone. This sound emanates from the Highest Jade Void Heaven, a spontaneous composition, wherein the inner names of heavenly demons are recorded, or the jade tablets of the Nine Heavens are displayed. Its words are profound and distant, beyond the comprehension of beginners or ordinary mortals. Unless the Great Emperor descends, seated upon a jasper chariot, ascending the dawn clouds, riding the floating radiance of the Luo River and the purple heavens, one cannot thoroughly master this inscription. Those of later learning who are earnest, upon seeing this text, shall have their names recorded in the Eastern Florescence, their bones and appearance aligned with immortality, and the heavenly perfected shall descend in response—thus they receive this script. They must only follow the method and wear it upon their person to repel the myriad spirits. When the Dao is fulfilled and qi is clarified, they shall surely attain insight into the hidden sounds, roaming through the Jade Purity.\n\nAll who receive the Jade Purity’s hidden script, the *Dongjing Jinxuan* chapter, yet lack the inner text of the Jade Emperor’s carved stone hidden inscription, may not recite the *Jinxuan* chapter. To recite it lightly stirs the Highest Heavens, and the ten thousand demons seize the opportunity to arise. Those who possess only the inner text of the hidden inscription but do not receive the *Dongjing Jinxuan* likewise have no means to restrain demons. When the upper and lower are mutually aligned, the two practices are equally employed, and the Three Radiant Ones harmonize, the ten thousand qi become solemn and clear.\n\nThe *Golden Root Scripture* states: \"Those who cultivate the Great Grotto must sit in the numinous thunder; those who cultivate the *Jinxuan* must wear the hidden inscription.\" This Dao is most wondrous, concealed within the Nine Bends Chamber of the Jade Void, guarded by golden spirits and attended by jade maidens bearing towels. The thirty-six perfected oversee the jade tablets. Those who violate the regulations or transgress the prohibitions shall be reported to the Three Purities, their bodies perishing into the offices of ghosts, forever bearing punishment in the Dark Springs. The heavenly statutes sternly warn: do not recklessly proclaim this.\n\nAll who receive the Jade Purity’s hidden script and the inner inscription of the carved stone must first purify themselves with a seven-day fast. Upon completion of the fast, they shall present thirty feet of brocade silk, nine pairs of golden rings, and make an oath before the Northern Emperor, swearing an alliance before transmission. Those who maintain long fasts must sever ties with the mortal world, their bodies untouched by impurity, their forms pure and qi clarified, before they may cultivate and practice this Dao. The Great One shall oversee the trial, the Controller of Destinies shall determine their life, the mysterious response shall wondrously inform, ascending to the Jade Purity. The Imperial Lord shall rejoice in fear, and the assembled perfected shall attend the court. When the Dao is perfected through ten thousand recitations, they shall ascend in a green chariot, joining the dark floating clouds to reach the Imperial Court.\n\n**Highest Method for Diminishing Demons and Slaying Ghosts**\n\nOn *jiǎ*-*yǐ* days, the Ghost-Culling Capital Officer, surnamed Song, named Ju Ying, presides over the register of the ten thousand ghosts of *jiǎ*-*yǐ* days.\nOn *bǐng*-*dīng* days, the Ghost-Culling Capital Officer, surnamed You Tong, named Fa Sheng, presides over the register of the ten thousand ghosts of *bǐng*-*dīng* days.\nOn *wù*-*jǐ* days, the Ghost-Culling Capital Officer, surnamed Huang, named An Zheng Li, presides over the register of the ten thousand ghosts of *wù*-*jǐ* days.\nOn *gēng*-*xīn* days, the Ghost-Culling Capital Officer, surnamed Bo, named Xi Zi Liu, presides over the register of the ten thousand ghosts of *gēng*-*xīn* days.\nOn *rén*-*guǐ* days, the Ghost-Culling Capital Officer, surnamed Zheng, named Xuan Qiu Bo, presides over the register of the ten thousand ghosts of *rén*-*guǐ* days.\n\nThe Jade Emperor states: These Five Emperors’ Ghost-Culling Capital Officers all receive the title of Pure Void from the Northern Emperor. Though they preside over the culling of ghosts, their rank is not insignificant, for they are revered by the Five Peaks and relied upon by cultivators. Every 2,400 years, they ascend to the Jade Purity to become the officials of the General Immortals. If cultivators do not know the inner names of the Capital Officers or lack the jade script for slaying ghosts, demons and ghosts shall surely test them, corrupting their immortal rectitude.\n\nAll the myriad ghosts of the Northern Emperor, the demons of the world, and the suffering souls who have not yet ascended, whose names are recorded in the Northern Fengdu, are entirely governed by these officers. Those who know their names shall diligently record them in the Nine Heavens, the ten thousand demons shall be extinguished, the myriad ghosts shall hide their forms, and there shall be no further trials or defeats—immortality shall naturally be achieved. Yet this is a secret of the Highest Heavens, concealed within the Jasper Terrace and not transmitted to the lower world. Those who lightly divulge it shall be subjected to the trials of the wind and blade, and their seven generations of ancestors shall be punished upon Mount Meng.\n\nThese divine officers wear crowns of interwoven seven treasures and kingfisher feathers, jade hairpins, robes of purple silk edged with golden flowers and kingfisher feathers, white sashes, crimson skirts, vermilion shoes, and red-embroidered narrow garments, bearing five-colored ceremonial banners.\n\nThe *Northern Emperor’s Cold Numinosity Jade Scripture for Diminishing Demons and Slaying Ghosts* is received from the Highest Three Heavens, guarded by thirty-six jade maidens. It is also called the *Nine Heavens’ Life-Numinosity Scripture*, worn by the Highest Divine Numinous-Shao King. To slay the ghosts of *jiǎ*-*yǐ* days, one must transcribe the script in vermilion and present a white memorial [above], one foot and two inches in length, three inches and two fen in width, placing it upon the west at *gēng*, or upon *xīn* on *yǐ* days. Hold the breath for seven breaths, knock the left teeth thirty-six times, and recite the incantation:\n\n*\"Riding the heavens, treading the qi, I carry out the mighty decree. The Highest Jade Scripture universally subdues the ten thousand evils. The Cold Numinosity receives restraint, stern as the heavenly bell. I solemnly command the Capital Officer to govern and restrain the Northern Fengdu. First execute the ghostly souls, then sever the demon kings. Great and small shall be extinguished, high and low shall be overthrown. As the heavens command, cut off their breath in the Palace of Fire. The Great One oversees the decree, the Five Elders hasten the work. Heaven is clear, earth is bright, the ten thousand passages are opened. All under the charge of *jiǎ*-*yǐ* shall respectfully obey.\"*",
      "overlap_context": " jade names, whose names are recorded in the Azure Bureau, having obtained this text, must follow the mysterious regulations. Within seven hundred years, they are permitted to transmit it three times. If transmitted to an unworthy recipient, the Northern Emperor shall report the offense, extending punishment to the seven generations of ancestors, who shall forever bear the burden of ghostly retribution. Their bodies shall perish, their forms be destroyed, and they shall never attain immortality.",
      "start_char": 1239,
      "end_char": 2485,
      "start_sentence": 37,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.65608024597168,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上灭魔玉帝神慧玉清隐书.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "毕，引气七咽止。 行此七日，天魔束形见景，受事於眼前，鬼爽灭种，万精自亡，朱书白素佩身，可游行天下，群妖试灭，万鬼不敢干也，役使太丹玉女八人。 此神吏，金华绿绛绡之服，黄裙，青罗窄衣，绶带冠履同前。 北帝丹灵灭魔杀鬼玉文，受於高上三天，卫以朱宫玉女六十四人，一名摄杀律，高上消魔王所佩。 欲杀丙丁日鬼，当黄书文黑奏上，长一尺二寸，广三寸二分，置北方壬上，丁日置癸上，闭气五息，叩齿三十六通，咒曰： 高上告命，普摄万灵，伯吏受符，校案玉清，检督北酆，条送魔名，上帝所须，元亏时呈，皇老监诏，五仙部兵，天一秉钺，斩灭无停，万万伏法，千千戮形，杀律所摄，莫不悉清。 毕，引气五咽止。 行之五日，鬼魔皆束形露景，受事於服前，万凶灭迹，千精自丧，黄书玄缯佩身，游行天下，万妖灭凶，群灵不敢干也。 五年自得役使黄素玉女十二人。 此神吏，金华皂缘，紫绡之服，绛裙，黄锦窄衣，绶带冠履同前。 北帝素灵灭魔杀鬼玉文，受之於高上三天，卫以素灵玉女三十六人，一名九天兵信，玉清玉霄王所佩。 欲杀庚辛日鬼，当黑〔书〕丹奏上，长一尺二寸，广三寸二分，置南方丙上，辛日置丁上，闭气三息，叩左齿三十六通，咒曰： 天开地通，玄气朗清，扫除浮翳，五道焕明，奉帝诏命，检校万灵，北酆所部，严束正形，高上所摄，促气时呈，群魔自到，鬼爽灭精，风发电激，自天肃平，皆如玄符，伏法帝庭。 毕，引气三咽止。 行之三日，鬼魔皆束形见景，受事於眼前，万魔伏法，群凶灭迹也。 黑书丹文上佩身，游行天下，万魔窜伏，群灵不敢干。 三年自得役使太玄玉女五人。 此神吏，金华绿缘，绛绡之服，皂缘，红裙，青罗窄衣，绶带冠履同前。 北帝威灵灭魔杀鬼玉文，受之於高上三天，卫以太玄玉女二十五人，一名威神玉策，玉清消魔王所佩。 欲杀壬癸日鬼，当青书黄〔奏〕上，长一尺二寸，广三寸二分，置中央戊上，癸日置己上，闭气十二息，叩齿三十六通，咒曰： 天摧地激，四时摄光，五行促校，检定十方，天帝浮位，皇老出房，高上所讨，严剪无容，先戮鬼爽，后截群凶，千妖万试，莫不伏降，皆如玉文，流铃八冲，豁落交掷，山岳摧崩，承天顺命，伯吏齐功。 毕，引气十二咽止。 行之十二日，鬼魔束形，皆见景受事於眼前，万魔灭种，群妖丧精，青书黄缯上佩身，游行天下，万鬼自窜，千妖匿景。 十二年，自得役使青腰玉女九人。 此神史，金华翠缘，朱罗之服，红缘绛裙，白绣窄衣，绶带冠履同前。 北帝洞灵灭魔杀鬼玉文，受之於高上三天，卫以黄素玉女十二人，一名黄神威灵策，高上玉帝君所佩。 欲杀戊己日鬼，当白书青奏上，长一尺二寸，广三寸二分，置东方甲上，己日置乙上，闭气九息，叩左齿三十六通，咒曰： 黄中理气，制命九天，三灵应符，五老校仙，促检北帝，束送魔身，群凶瞽目，不得推迁，上帝所告，捕追无亲，敢有越逸，急制酆山，明如帝信，上对玉晨。 毕，引气九咽止。 行之九日，鬼魔束形见景，受事於眼前，万魔灭种，群妖丧精。 白书青缯上佩身，游行天下，万鬼伏窜，千妖匿景，不敢干犯。 九年自得役使素灵玉女七人。",
      "translated_text": "Upon completion, draw in the qi and swallow it seven times to conclude. Practicing this for seven days, the heavenly demons will bind their forms and manifest their images, submitting to service before your eyes. Ghostly souls shall be extinguished, and the myriad spirits will perish of themselves. Inscribe in vermilion on white silk and wear it upon your person, and you may traverse the world—all demonic trials shall be eradicated, and the ten thousand ghosts will dare not interfere. You may command eight Vermilion Elixir Jade Maidens. These divine officers wear robes of golden splendor with green and crimson silk, yellow skirts, and azure gauze undergarments, with sashes, crowns, and footwear as before.\n\nThe Vermilion Numinosity Jade Text for the North Emperor to extinguish demons and slay ghosts was received in the Highest Three Heavens, guarded by sixty-four Jade Maidens of the Vermilion Palace. One is named *She-Slaughtering Statute*, worn by the Highest Vanquisher of Demon Kings.\n\nTo slay ghosts on *bǐng*-*dīng* days, inscribe the text in yellow on a black memorial, one foot and two inches in length, three inches and two fen in width. Place it in the north at *rén* on *bǐng* days, or at *guǐ* on *dīng* days. Hold the breath for five breaths, knock the teeth thirty-six times, and recite the incantation:\n\n*\"The Highest proclaims the decree, universally subduing the ten thousand spirits. The Capital Officer receives the talisman, reviewing the cases in Jade Clarity. Supervising the Northern Fengdu, he itemizes and delivers the names of demons. What the Celestial Emperor requires, none shall delay in presenting. The August Elders oversee the decree, the Five Immortals command the troops. Heavenly Unity wields the halberd, slaying without cease. Ten thousand times ten thousand shall submit to the law, a thousand times a thousand shall have their forms destroyed. All under the *Slaughtering Statute*’s restraint shall be utterly purged.\"*\n\nUpon completion, draw in the qi and swallow it five times to conclude. Practicing this for five days, ghosts and demons will bind their forms and reveal their images, submitting to service before your presence. The myriad evils shall be eradicated, and the thousand spirits will perish of themselves. Inscribe in yellow on dark silk and wear it upon your person, and as you traverse the world, all demonic evils shall be vanquished, and the host of spirits will dare not interfere. After five years, you may command twelve Yellow Silk Jade Maidens. These divine officers wear robes of golden splendor with black trim and purple silk, crimson skirts, and yellow brocade undergarments, with sashes, crowns, and footwear as before.\n\nThe White Numinosity Jade Text for the North Emperor to extinguish demons and slay ghosts was received in the Highest Three Heavens, guarded by thirty-six White Numinosity Jade Maidens. One is named *Nine Heavens’ Military Missive*, worn by the Jade Clarity and Jade Firmament Kings.\n\nTo slay ghosts on *gēng*-*xīn* days, inscribe in black on a vermilion memorial, one foot and two inches in length, three inches and two fen in width. Place it in the south at *bǐng* on *gēng* days, or at *dīng* on *xīn* days. Hold the breath for three breaths, knock the left teeth thirty-six times, and recite the incantation:\n\n*\"Heaven opens, earth communicates, the mysterious qi shines clear. Sweeping away floating obscurities, the Five Paths gleam brightly. Bearing the Emperor’s decree, I review and restrain the ten thousand spirits. Those under the Northern Fengdu’s charge shall be strictly bound to their true forms. What the Highest restrains shall promptly manifest their qi. The demonic hordes shall come of themselves, ghostly souls shall be extinguished of their essence. Wind arises, lightning strikes—from heaven, all is sternly pacified. All shall obey the mysterious talisman, submitting to the law in the Emperor’s court.\"*\n\nUpon completion, draw in the qi and swallow it three times to conclude. Practicing this for three days, ghosts and demons will bind their forms and manifest their images, submitting to service before your eyes. The myriad demons shall submit to the law, and the host of evils shall be eradicated. Inscribe in black on vermilion silk and wear it upon your person, and as you traverse the world, the ten thousand demons shall flee in hiding, and the host of spirits will dare not interfere. After three years, you may command five Great Mystery Jade Maidens. These divine officers wear robes of golden splendor with green trim and crimson silk, black-edged, red skirts, and azure gauze undergarments, with sashes, crowns, and footwear as before.\n\nThe Mighty Numinosity Jade Text for the North Emperor to extinguish demons and slay ghosts was received in the Highest Three Heavens, guarded by twenty-five Great Mystery Jade Maidens. One is named *Mighty Divine Jade Tally*, worn by the Jade Clarity Vanquisher of Demon Kings.\n\nTo slay ghosts on *rén*-*guǐ* days, inscribe in azure on a yellow memorial, one foot and two inches in length, three inches and two fen in width. Place it in the center at *wù* on *rén* days, or at *jǐ* on *guǐ* days. Hold the breath for twelve breaths, knock the teeth thirty-six times, and recite the incantation:\n\n*\"Heaven topples, earth surges, the four seasons restrain their light. The Five Phases hasten to review, examining and fixing the ten directions. The Celestial Emperor ascends his floating throne, the August Elders emerge from their chambers. What the Highest punishes shall be sternly eradicated without mercy. First execute the ghostly souls, then sever the host of evils. A thousand demonic trials, ten thousand tests—none shall fail to submit. All shall obey the Jade Text, the Flowing Bells of the Eight Directions. The *Huoluo* cross in flight, mountains and peaks collapse. Upholding heaven and obeying the decree, the Capital Officers unite in merit.\"*\n\nUpon completion, draw in the qi and swallow it twelve times to conclude. Practicing this for twelve days, ghosts and demons will bind their forms and manifest their images, submitting to service before your eyes. The myriad demons shall be extinguished, and the host of demonic trials shall perish of their essence. Inscribe in azure on yellow silk and wear it upon your person, and as you traverse the world, the ten thousand ghosts shall flee of themselves, and the thousand demonic trials shall conceal their images. After twelve years, you may command nine Azure-Waisted Jade Maidens. These divine scribes wear robes of golden splendor with kingfisher trim and vermilion gauze, red-edged crimson skirts, and white-embroidered undergarments, with sashes, crowns, and footwear as before.\n\nThe Cavern Numinosity Jade Text for the North Emperor to extinguish demons and slay ghosts was received in the Highest Three Heavens, guarded by twelve Yellow Silk Jade Maidens. One is named *Yellow Divine Mighty Tally*, worn by the Highest Jade Emperor Lord.\n\nTo slay ghosts on *wù*-*jǐ* days, inscribe in white on a cyan memorial, one foot and two inches in length, three inches and two fen in width. Place it in the east at *jiǎ* on *wù* days, or at *yǐ* on *jǐ* days. Hold the breath for nine breaths, knock the left teeth thirty-six times, and recite the incantation:\n\n*\"Within the Yellow Center, the qi is ordered, decrees are issued to the Nine Heavens. The Three Numinosities respond to the talisman, the Five Elders review the immortals. Hastening to supervise the North Emperor, they bind and deliver demonic forms. The host of evils shall be blinded, unable to shift or escape. What the Celestial Emperor proclaims shall be pursued and captured without exception. Should any dare to transgress, they shall be swiftly restrained at Fengdu Mountain. Clear as the Emperor’s trust, I face the Jade Dawn.\"*\n\nUpon completion, draw in the qi and swallow it nine times to conclude. Practicing this for nine days, ghosts and demons will bind their forms and manifest their images, submitting to service before your eyes. The myriad demons shall be extinguished, and the host of demonic trials shall perish of their essence. Inscribe in white on cyan silk and wear it upon your person, and as you traverse the world, the ten thousand ghosts shall submit and flee, the thousand demonic trials shall conceal their images, and none shall dare to interfere. After nine years, you may command seven White Numinosity Jade Maidens.",
      "overlap_context": "eavenly bell. I solemnly command the Capital Officer to govern and restrain the Northern Fengdu. First execute the ghostly souls, then sever the demon kings. Great and small shall be extinguished, high and low shall be overthrown. As the heavens command, cut off their breath in the Palace of Fire. The Great One oversees the decree, the Five Elders hasten the work. Heaven is clear, earth is bright, the ten thousand passages are opened. All under the charge of *jiǎ*-*yǐ* shall respectfully obey.\"*",
      "start_char": 2485,
      "end_char": 3732,
      "start_sentence": 70,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.590216875076294,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上灭魔玉帝神慧玉清隐书.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "玉帝曰：杀鬼玉文，出自九天隐空之中，高上以付杀鬼都吏，以制御万魔，剪灭群凶。 如消魔王、神霄王等，皆受之於高上神慧秘咒，自玉清中之微辞。 凡学仙之夫，游行名山，经历险阻，皆当依具施行。 又登斋诵经，修求飞腾之道，亦案其施之，以遏鬼试。 若在人中多鬼之处，亦当施之，以灭鬼妖也。 若行此之道，皆当精心苦诚，执志审固，无有疑预，如法计日，天魔无不露形伏法。 若万一不见真形者，便是己身自履秽未消，虽尔鬼魔亦於冥内受形於伯吏也。 若浮好之士，身不精感，轻施召鬼，鬼反害於己，便受大殃也。 明慎之，勿轻脱也。 玉清神霄王曰：凡鬼魔巧便，变化万端，或沉或浮，或见或亡，或聚或隐，或藏或形，或气或死或生，或飞云中，或治空洞，五色恍惚，无有常形，如此皆承六天之运，受会於三天，在其度之内，故得肆其凶丑。 高上亦以后学多巧，民心不纯，洎害繁生，恶逆滋彰，故容之以威民，使协真以罚非，役之以兼考官，故不灭其根种也。 若使运终数讫，则其气自消，民心自然而纯学者，自然成仙也。 今鬼之为物，贪浊无廉，因威生凶，干试后学，无复有真，皆九天逆明其象，故置五帝杀鬼玉文，以检截其凶横也。 若后学得此文，将鬼魔自灭，其凶试不干也。 九天禁限，依四极明科，七百年中有其人，听三传。 轻泄漏慢，身受大殃，宜详慎奉行。 高上消魔王曰：凡上真已成真人，犹凶魔所试，何况凡学之夫耶。 仙道不成，亦不被试者，皆是九天制魔保举，故魔宜先试其邪正也。 得魔保举，便白日升天，岂可为咎魔也。 但魔所试，其欲令败，不欲使过，故高上明其凶横，置於杀鬼玉文，灭魔之章，及玉帝神慧，皆以防灭此横也。 若使其干试以理者，亦当不须又消灭之方也。 后学故宜勤修，施行玉文，及诵玉帝神慧，以禳此灾也。 自非受气玉虚，结秀琼胎者，空身而求肉飞之举，无有此文，自劳鬼於疲曳，无获於图尚也。 高上九天驱除邪精神慧上法 上清隐玄玉帝大慧，一名九天驱除神咒内法。 此之经文，皆虚皇之上道，高上所神秘，摄灵命真，灭魔总慧，振六天，招卫神兵，摧落奸妖，伐戮邪精，盖玉帝大试之时，正立三天之法也。 琼音既震，则凶秽消除，山精残灭，万灵受事，神真辅卫，九魔伏形，寒灵失气，天锋仰曜，神威俯摄，辟毒禳试，万妖灭迹。 此法至不可轻泄，传授之者，皆立盟为誓，约不宣漏。 若违盟负誓，不崇科禁者，身为下鬼长闭地狱，七玄之祖受风刀考罚矣。 九天玉帝神咒曰：九天上化，化道常生，保景太元，寝映朱琼，逸宅丹玄，受事玉清，十转九过，七混五成，神晖赫曜，振策皇庭，道达三变，录神命灵，玉帝散慧，隐玄羽经，千真倾轮，五皇命征，披朱巾羽，森列帝庭，左佩神虎，右策金兵，九天征伐，焕掷火铃，灭魔破妖，剪邪校精，风火奕震，六天摧倾，豁落北酆，九魔塞灵，逆道者诛，顺化者生，上帝委命，勑卫神兵，千邪灭试，万鬼无停，敢试有干，一付天丁，有妖则灭，有毒则刑，既灭既刑，摄邪录精，六天已诛，威震七灵，宝神驱秽，霄浪三清，万真受事，俱会帝庭，六象调和，七晨晖明，神风散魔，道畅无名，神慧灭魔，玉帝咒生，九天垂命，摄真御灵，请奉皇命，仙道乃明。",
      "translated_text": "The Jade Emperor states: The Jade Text for Slaying Ghosts emerges from the Hidden Void of the Nine Heavens, bestowed by the Most High upon the Chief Scribe for Slaying Ghosts to govern the myriad demons and eradicate the host of malevolent spirits. Even the Demon-Quelling King and the Divine Empyrean King received it from the arcane incantations of the Most High’s divine wisdom, concealed within the Jade Purity. All who aspire to immortality and traverse renowned mountains, enduring perilous obstacles, must adhere to and perform these rites. When ascending to recite scriptures in purification or seeking the Dao of flight, they should likewise employ these methods to repel demonic trials. In places where ghosts abound among mortals, these rites must also be performed to extinguish ghostly and demonic influences. Those who practice this Dao must do so with utmost sincerity, unwavering resolve, and no trace of doubt, following the prescribed days. Then, the heavenly demons shall reveal their forms and submit to judgment. Should any fail to manifest their true forms, it is because their own impurities remain unresolved, though the ghosts and demons shall still be bound in darkness and receive their forms from the Chief Scribe. If frivolous practitioners, lacking purity of intent, rashly summon ghosts, the ghosts shall instead harm them, bringing great calamity. Be vigilant and do not act carelessly.\n\nThe Jade Purity Divine Empyrean King states: Ghosts and demons are cunning and endlessly transformative—now sinking, now rising; now appearing, now vanishing; now gathering, now concealing; now hiding, now manifesting; now in qi, now dead, now alive; now soaring in clouds, now dwelling in empty caverns. Their five-colored forms flicker and shift, never constant. All such beings derive their power from the governance of the Six Heavens, subject to the decree of the Three Heavens, existing within their allotted span. Thus, they indulge in their malevolence. The Most High, observing that later learners are often crafty and mortal hearts impure, with harm proliferating and wickedness flourishing, permits their existence to awe the people, aligning the true to punish the false, and employing them as officials to examine and test. Therefore, their root and kind are not eradicated. When their allotted span ends, their qi shall naturally dissipate, and mortal hearts shall spontaneously purify, allowing learners to naturally attain immortality.\n\nGhosts, as entities, are greedy and impure, their malevolence born of their own nature. They test later learners, no longer possessing truth, for the Nine Heavens reveal their forms in reverse. Thus, the Five Emperors’ Jade Text for Slaying Ghosts was established to restrain their violence. If later learners obtain this text, the ghosts and demons shall self-destruct, and their malevolent trials shall not interfere. The prohibitions of the Nine Heavens, in accordance with the Bright Statutes of the Four Poles, permit transmission to one person every seven hundred years. Those who lightly disclose or neglect it shall suffer great calamity. Adhere carefully and practice diligently.\n\nThe Most High Demon-Quelling King states: Even perfected True Persons who have attained transcendence are tested by malevolent demons—how much more so for ordinary learners? Those who fail to achieve immortality yet are not tested are protected by the Nine Heavens’ demonic restraints. Thus, demons must first test their alignment with truth or falsehood. Those who receive demonic protection shall ascend to heaven in broad daylight—how could they be faulted by demons? Yet demons seek only to cause failure, not to allow success. Therefore, the Most High exposes their violence and establishes the Jade Text for Slaying Ghosts, the chapters for extinguishing demons, and the Jade Emperor’s divine wisdom, all to prevent and eradicate this violence. If demons test with reason, there is no need for further methods of eradication. Later learners must therefore diligently cultivate and employ the Jade Text, reciting the Jade Emperor’s divine wisdom to avert such disasters. Without receiving the qi of the Jade Void and forming the radiant jade embryo, those who vainly seek bodily flight shall only weary themselves in futile toil, achieving nothing of their aspirations.\n\nThe Supreme Method of the Nine Heavens for Expelling Malevolent Spirits and Divine Wisdom\nThe Great Wisdom of the Hidden Mystery Jade Emperor of the Highest Clarity, also called the Inner Method of the Nine Heavens’ Divine Incantation for Expelling Demons.\n\nThese scriptural texts embody the supreme Dao of the August Void, the divine secrets of the Most High, gathering the true essence of spiritual destiny, extinguishing demonic influences, and commanding the Six Heavens. They summon and guard divine soldiers, shatter malevolent spirits, and execute perverse essences. They were established during the Jade Emperor’s great trial as the law of the Three Heavens. When the resounding tones of jade chime, malevolent impurities are dispelled, mountain spirits are annihilated, and the myriad spirits submit to service. Divine transcendents assist and protect, the Nine Demons submit their forms, cold spirits lose their qi, the Celestial Blade shines upward, and divine might presses downward. Poisons are repelled, trials are averted, and the myriad demons vanish without trace.\n\nThis method must never be lightly disclosed. Those who transmit it must swear solemn oaths and vow not to reveal it. Should they violate their oaths and disregard the prohibitions, their bodies shall become lowly ghosts, eternally confined in hell, while their seven generations of ancestors shall suffer the punishments of the Wind Blade.\n\nThe Divine Incantation of the Nine Heavens Jade Emperor states:\nThe transformation of the Nine Heavens perpetually generates the Dao,\nPreserving the luminous Great Prime, its radiance veiled in vermilion jade.\nAbiding in the cinnabar mystery, receiving service in the Jade Purity,\nTen revolutions, nine passages, seven blends, five completions.\nDivine splendor blazes, shaking the imperial court with its strategy.\nThe Dao attains three transformations, recording the destiny of spirits and numina.\nThe Jade Emperor disperses wisdom, the Hidden Mystery Feathered Scripture,\nA thousand perfected ones incline their wheels, the Five Emperors command their expeditions.\nClad in vermilion kerchiefs and feathered robes, they array themselves in the imperial court,\nGirded with the divine tiger on the left, wielding golden soldiers on the right.\nThe Nine Heavens’ expedition, brandishing fiery bells,\nExtinguishes demons, shatters spirits, severs perversity, and corrects essences.\nWind and fire resound in majesty, the Six Heavens collapse,\nThe Northern Fengdu is breached, the Nine Demons’ spirits are sealed.\nThose who oppose the Dao are executed; those who follow transformation live.\nThe Emperor delegates command, ordering divine soldiers to guard.\nA thousand perversities are extinguished, ten thousand ghosts find no rest.\nShould any dare to test or interfere, they are delivered to the Celestial Soldiers.\nDemons are extinguished, poisons are punished;\nOnce extinguished and punished, perversity is restrained and essence recorded.\nThe Six Heavens are executed, their might shaking the Seven Spirits.\nPrecious spirits drive out impurity, the Empyrean surges through the Three Clarities.\nThe myriad perfected ones receive service, assembling in the imperial court.\nThe Six Symbols harmonize, the Seven Dawns shine brightly.\nDivine winds scatter demons, the Dao flows without name.\nDivine wisdom extinguishes demons, the Jade Emperor’s incantation arises.\nThe Nine Heavens bestow command, gathering the true and governing the numinous.\nI humbly receive the Emperor’s mandate—thus the immortal Dao is revealed.",
      "overlap_context": "d demons will bind their forms and manifest their images, submitting to service before your eyes. The myriad demons shall be extinguished, and the host of demonic trials shall perish of their essence. Inscribe in white on cyan silk and wear it upon your person, and as you traverse the world, the ten thousand ghosts shall submit and flee, the thousand demonic trials shall conceal their images, and none shall dare to interfere. After nine years, you may command seven White Numinosity Jade Maidens.",
      "start_char": 3733,
      "end_char": 4983,
      "start_sentence": 102,
      "end_sentence": 131,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.418142318725586,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上灭魔玉帝神慧玉清隐书.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "咒毕，又叩齿三十六通，咽液十过。 於是乃寝，都毕也。 若道士他行独宿，及有心震之地，或於林庙之间，多有山精恶鬼，喜来犯试於人，心神畏恐者，当诵玉帝神咒之法，以禳辟之。 灵音既震，则天魔灭试，万邪窜迹，神真营卫。 若与万人同宿，是夕也，当有灵应妙觉，神兵见卫，伐戮奸祆，驱灭凶秽，三宫受真，五帝辅弼，内填灵阙，外威贼气，於是神清体平，都无所畏矣。 玉帝咒鬼卫灵上法 玉帝咒曰：九天有命，上奉玉清，促召千真，俱会帝庭，太一下观，双皇翼形，鉴察万邪，理气摄生，若有不祥，干试神明，请帝之道，勑整神兵，七神秉钺，天锋右征，挥剑前驱，焕掷火铃，檄命甲驺，武卒天丁，风火齐战，伐邪校精，上威六天，下摄魔灵，既威既摄，万凶灭形，神戈电扫，奸妖无生，仙皇秉节，有令敢停，拒节违令，是诛是刑，各敬各慎，保兹黄宁，九天告命，万神敬听。 兆若夜行畏恐，心震意怯，或恶梦之时，魔鬼试人，犯真干气，欲病害人者，急行玉帝卫灵之法。 兆当心存至道，求济於帝方，北向叩齿三十六通，闭气密咒毕，又叩齿如上十过，咽液十过，於是奸恶消摧，伏魔伏灭，七神缠绵，太一鉴摄，万灵卫真，外威凶气，亦可日日诵习，振响诵念，坐卧随意，以塞百邪之来试，闭奸鬼之凶迹。 每当卧寝，亦可诵之，今人神安，辟梦除厌，消诸毒恶，使终身不恐。 诵习之日，不复北向闭气也。 所以闭气密咒者，谓鬼魔已试其左右，奸精已干其神室，故敕灵命真，以收其凶恶耳。 而寝外之咒，不复同之於此法也。 上清高上灭魔玉帝神慧玉清隐书经竟 #1『上』字原缺，据文义补。 后文凡方括号中缺文，均据文义补。",
      "translated_text": "Upon completing the incantation, strike the teeth thirty-six times and swallow saliva ten times. Thus the ritual concludes, and one may retire.\n\nShould a Daoist travel alone or lodge in a place of unsettling energy—whether in forests, temples, or regions where mountain spirits and malevolent ghosts abound, ever eager to assail and test mortals—those who feel their spirit tremble in fear ought to recite the Jade Emperor’s divine incantation to dispel and repel them. Once the numinous sound resounds, celestial demons are vanquished, myriad evils scatter, and divine perfected ones encamp in defense.\n\nIf one lodges among a multitude of ten thousand, on that very night, wondrous spiritual responses shall arise: divine soldiers will manifest in protection, striking down treacherous fiends, driving out inauspicious impurities. The Three Palaces receive the true, the Five Emperors lend their aid, the inner numinous gates are fortified, and outer pernicious qi is subdued. Thus the spirit is serene, the body at peace, and all fear dispelled.\n\n**The Jade Emperor’s Incantation for Ghostly Defense and Numinous Protection**\n\nThe Jade Emperor’s incantation states:\nThe Nine Heavens issue command, upholding the Jade Clarity.\nHasten the summoning of a thousand perfected ones, assembling in the imperial court.\nThe Supreme One gazes below, the Twin Sovereigns flank his form.\nThey survey the myriad evils, ordering qi and safeguarding life.\nShould any inauspicious force dare test the divine,\nInvoke the Emperor’s Dao, dispatching the divine soldiers to order.\nSeven spirits wield halberds, celestial blades march to the right.\nBrandishing swords at the vanguard, they hurl flaming bells.\nSummon the armored couriers, the martial legions of Heavenly Soldiers.\nWind and fire unite in battle, vanquishing evil and refining essence.\nAbove, they overawe the Six Heavens; below, they subdue demonic spirits.\nOnce awed and subdued, the myriad fiends are extinguished in form.\nDivine spears sweep like lightning, leaving no trace of treacherous demons.\nThe Immortal Sovereigns hold the tally—who dares delay the command?\nThose who defy the tally or violate the decree shall be executed and punished.\nLet each respect and take heed, preserving this Yellow Tranquility.\nThe Nine Heavens proclaim the mandate—let all spirits heed with reverence.\n\nShould you, the adept, walk at night in fear, your heart trembling and resolve faltering—whether in the grip of nightmares, when demons test mortals, or when malevolent forces violate the true and disrupt qi, seeking to sicken and harm—hasten to perform the Jade Emperor’s method for numinous protection.\n\nThe adept must concentrate the mind upon the utmost Dao, seeking deliverance from the imperial realm. Face north, strike the teeth thirty-six times, hold the breath, and silently recite the incantation to completion. Then strike the teeth ten more times as before, and swallow saliva ten times. Thus treacherous evil is shattered, demonic forces subdued and extinguished. The Seven Spirits entwine in defense, the Supreme One surveys and subdues. The myriad spirits guard the true, and outer pernicious qi is overawed.\n\nThis may also be recited daily, vibrating the voice in recitation, whether seated or reclining, to bar the approach of all demonic tests and seal the inauspicious traces of treacherous ghosts. Before retiring each night, one may also recite it, ensuring the spirit’s peace, dispelling nightmares and malevolent influences, dissolving all poisons and evils, and securing a life free from fear.\n\nOn days when the incantation is practiced, one need not face north or hold the breath. The purpose of holding the breath and reciting silently is this: when demonic forces have already tested one’s surroundings and treacherous spirits have violated the chamber of the spirit, the divine command is issued to the true to reclaim and suppress their malevolence. The incantation for external repose, however, does not follow this same method.\n\nHere ends the *Highest Clarity’s Supreme Scripture of the Jade Emperor’s Numinous Wisdom for Extinguishing Demons*, from the *Hidden Writings of the Jade Clarity*.",
      "overlap_context": "us spirits drive out impurity, the Empyrean surges through the Three Clarities.\nThe myriad perfected ones receive service, assembling in the imperial court.\nThe Six Symbols harmonize, the Seven Dawns shine brightly.\nDivine winds scatter demons, the Dao flows without name.\nDivine wisdom extinguishes demons, the Jade Emperor’s incantation arises.\nThe Nine Heavens bestow command, gathering the true and governing the numinous.\nI humbly receive the Emperor’s mandate—thus the immortal Dao is revealed.",
      "start_char": 4983,
      "end_char": 5643,
      "start_sentence": 132,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.617361307144165,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上灭魔玉帝神慧玉清隐书.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}