{
  "source_id": "上清天宝斋初夜仪",
  "source_file": "chunked_daozang\\上清天宝斋初夜仪.json",
  "total_chunks": 4,
  "total_original_chars": 3400,
  "total_translated_chars": 22953,
  "total_translation_time": 127.34309363365173,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\上清天宝斋初夜仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Shangqing Heavenly Treasure Retreat First Night Rite**\n\n*Sutra Title:* *Shangqing Heavenly Treasure Retreat First Night Rite*. One scroll. Source text: *Zhengtong Daoist Canon*, *Dongzhen* Section, *Weiyi* Category.\n\nThe *Shangqing Heavenly Treasure Retreat* is the essential method for Dao seekers aspiring to immortality. Only after receiving the full transmission of *Shangqing* esoteric teachings may one perform this retreat. Those who have received only intermediate methods are not permitted to undertake the *Heavenly Treasure Retreat*.\n\nFirst, prayers are offered for the blessings of emperors and rulers; next, petitions are made for the grace of ancestral spirits. Through this, past transgressions are purified, new faults repented, merits perfected, and virtue fully realized—naturally attaining immortality and ascending in broad daylight.\n\n**Offerings for the Son of Heaven (Emperor):**\n- Five golden dragons, each weighing five *liang*\n- Five jade discs, each three *cun* square\n- Nine bolts of azure silk (east)\n- Three bolts of crimson silk (south)\n- Seven bolts of white silk (west)\n- Five bolts of black silk (north)\n- Twelve bolts of yellow silk (center)\n\nAll above ceremonial silks must be tightly woven and of substantial thickness. Thin or flimsy fabrics are not to be used.\n\n**Offerings for Dukes and Marquises:**\n- Five golden dragons, each weighing one *liang*\n- Five jade discs, of varying sizes\n- One bolt each of azure silk (east), crimson silk (south), white silk (west), black silk (north), and yellow silk (center)\n\nAll ceremonial silks must be tightly woven and of substantial thickness. Thin or flimsy fabrics are not to be used.\n\n**Offerings for Commoners:**\n- Nine *chi* of azure silk (east)\n- Three *chi* of crimson silk (south)\n- Seven *chi* of white silk (west)\n- Five *chi* of black silk (north)\n- Twelve *chi* of yellow silk (center)\n\nAll ceremonial silks must be tightly woven and of substantial thickness. Thin or flimsy fabrics are not to be used.\n\nThe *Azure Lad* states: If one’s cultivation is long-standing, dwelling in mountains and caves with profound devotion to the Dao and earnest desire for immortality, then incense and lamps alone suffice—no need for dragons or silks. With purity of heart and sincerity, the Dao is naturally attained.\n\nFor those preparing the retreat:\nFirst, inscribe nine *True Writs* in yellow on azure paper and place them upon a small table at the *Heavenly Gate*. On the day of repayment to the celestial officials, burn them at the *Heavenly Gate*.\n\nFrom the Son of Heaven to commoners, thirty-two *Heavenly Lamps* are lit upon the altar’s tiers, one lamp per station. The middle and lower tiers may be adjusted according to one’s capacity.\n\nBeyond the altar, light the *Twenty-Eight Constellation Lamps*, the *Five Planetary Lamps*, the *Five Lamps of One’s Destiny*, and the *Nine Lamps of One’s Current Year* at their respective positions. Candles should be provided in sufficient quantity.\n\nThe altar’s gates and placards follow the same method as the *Yellow Register Retreat*.\n\nFirst, the retreat’s sponsor is led before the *Mystic Master* to declare the retreat’s purpose.\nNext, the *Invocation of the Dao* is chanted.\nThen, the *Three Masters* are purified.\n\nNext, the *Praise of Hua-Xia* is recited, and the sponsor is led to the *Earthly Gate*.\n\nNext, the *Water Edict* is pronounced.\nNext, the *Ascent to the Altar* incantation is chanted as one enters through the *Heavenly Gate*:\n\n*\"The qi of Heaven’s Mystery is pure,\nThe Three Luminaries illumine with clarity.\nWithin the golden chamber and Daoist sanctum,\nFive sacred mushrooms flourish as treasures.\nViolet clouds and purple canopies\nCome to adorn my form.\nJade lads and jade maidens\nConvey my spirit’s efficacy.\nThe Five Thearchs align in radiance,\nThe Three Luminaries share their chariot.\nMounting dragons and cranes,\nI ascend into the Purple Court.\nThe retreat’s sponsor seeks blessings,\nWishing to preserve long life.\nMessengers of communion with the Perfected,\nHasten to report to the Supreme Clarity.\"*\n\nNext, the procession circles the altar. During the day, begin from the East; at night, from the North.\nNext, incense is offered at the *Imperial Table*.\nNext, incense is offered at one’s station.\nNext, each participant bows to the masters, contemplating as prescribed.\n\nNext, the *Guardian Spirit Incantation* is recited.\nNext, the *Dharma Drum* is struck twenty-four times.\nNext, the *Incense Burner is Opened*:\n\n*\"To the Five Numinous Elders of the Upper Primordial,\nThe Vacuous and Spontaneous Original Heavenly Venerable of the One,\nThe Supreme Heavenly Treasure Lord,\nThe Bearers of Golden Chapters and Fragrant Commands,\nThe Jade Maidens of Pure Spirit,\nThe Eighty-One Attendants of the Left and Right Jade Numinous Spontaneity,\nThe Flying Radiance Dragon-Riders—\nAll emerge in solemn majesty.\nWe invoke the local earthbound Perfected Officials of this realm.\nWe now burn incense and perform the Dao,\nDedicating this to the retreat’s sponsor, [Rank] [Name],\nWho establishes the Great Retreat of the Heavenly Treasure of Supreme Clarity,\nA one-night Daoist arena,\nThree days of ritual proceedings,\nWith refined orchid offerings,\nPurified and adorned with fragrant flowers,\nSilken banners and golden dragons,\nTo beseech blessings and invoke grace.\nMay the Golden Elixir and Jade Radiance of the Supreme Ten Directions\nDescend and flow into the sponsor’s being,\nAnd may our petition swiftly reach the presence of the August Jade Emperor and the Myriad Saints.\"*\n\nNext, each participant states their name and rank:\n\n*\"The humble servant [Name], holding the ritual office of [Rank],\nConducts the Great Retreat of the Heavenly Treasure of Supreme Clarity,\nThe first-night ritual proceedings,\nAlong with all Daoist participants and the retreat’s sponsor,\nRespectfully and with sincere devotion, jointly petitions:\nThe Vacuous and Spontaneous Limitless Dao,\nThe Primordial Heavenly Venerable of the Origin,\nThe Supreme Heavenly Treasure Sovereign of Supreme Clarity,\nThe Jade Emperor of Supreme Clarity,\nThe Most High Dao Lord,\nThe Most High Lord Lao,\nThe Most High Elder,\nThe August Jade Emperor of the Supreme Mystery,\nThe Queen Mother of the West,\nThe Lady of the Southern Marchmount,\nThe Great Sage Hosts of the Ten Directions who have attained the Dao,\nThe Perfected Lords of Mysterious Virtue,\nThe Jade Sovereign of the Void,\nThe Great Jade Emperor,\nThe Eastern Florescence and Southern Culmen,\nThe Western Numinosity and Northern Perfection,\nThe Golden Watchtower of the Jade Capital in the Mysterious Metropolis,\nThe Seven Treasures of the Purple Tenuity’s Upper Palace,\nThe Sovereign of the Numinous Treasure of the Perfected and Radiant August Dao,\nThe Thirty-Two Heavenly Emperors,\nThe Twenty-Four Lofty Perfected,\nThe Master Wen Shi of the Xia Teaching of Great Peace,\nThe Three Officials of Heaven, Earth, and Water,\nThe Supreme Ministers and Prime Ministers,\nThe Four Administrations of the Sun, Moon, and Stars,\nThe Five Thearchs,\nThe Celestial Immortals, Earthbound Immortals, Flying Immortals, and Divine Immortals,\nThe Great Dharma Masters of the Mysterious Center,\nThe Three Masters of the Scriptures and Ordinations,\nThe Three Heavenly Dharma Masters,\nThe Five Marchmounts and Four Waterways,\nThe Eight Seas and Nine Rivers,\nThe Famous Mountains and Grotto-Heavens,\nThe Officials and Attendants of the Three Realms,\nAnd all Perfected Numinosities.\n\nWe have heard:\nThe round and clear, the square and turbid,\nConceive the Origin within the Mysterious Pass;\nReceiving form and dividing appearance,\nThey draw upon the numinous power of the Wondrous Dao.\"*\n\nThe ceaseless cycle revolves, nurturing all without omission;\nIt covers and bears, gives life and completes, governing brightness and transgressions, blessings and misfortunes.\nThis is the teaching expounded by the Primordial Thearch, the statutes flowing from the Most High.\nIt scatters the Dharma rain to cleanse worldly toils;\nIt navigates the vessel of compassion to transcend the sea of suffering.\n\nThus, the patron of this retreat, so-and-so, dares to present earnest supplications,\nTo knock upon the Mysterious Pass from above,\nBeseeching blessings and imploring grace,\nDispelling calamities and dispersing misfortunes.\nArrayed are incense and lamps, silken banners, and golden dragons,\nAs a single night’s Daoist sanctuary is established,\nTo attend the Dharma assemblies of the three watches.\n\nYour servant, born of humble flesh and nourished by common milk,\nHas, by accumulated karmic affinities, been fortunate to dwell within the transformative influence of the Mysterious,\nAnd from youth, donning cap and hempen robe, has aspired to the true lineage.\nReceiving the Dharma register at the Star Altar,\nTransmitting the fragrant lamp in the Moon Palace,\nOn the day of ascending the altar, at the hour of making vows,\nPledged to expound the profound Dao and proclaim the sacred scriptures.\nFor all who turn toward this Way, how dare I not make it known above?\n\nThe patron’s blue petition shall now be reverently proclaimed.\nProceed to read the petition.\n\nIn accordance with the petition’s intent,\nThe sincerity of the prayer for blessings runs deep,\nTo deliver and ferry the living and the dead,\nTo extend blessings and longevity.\nWith mind set and intention raised,\nThe Three Realms take distant note.\nAcknowledging past transgressions and pursuing faults,\nMay the myriad sages grant indulgence.\nHolding incense and fire in hand,\nThe heart prays to the Void and Nonexistent.\nPerforming the Dao for three watches,\nEstablishing a single retreat,\nRefining the orchid’s fragrance,\nAdorning with pure incense and flowers.\nInviting the lofty Perfected of the Three Isles,\nDescending the exalted sages of the Ten Directions.\nThe vast and distant Mysterious Heavens,\nAll supplications reach and are heard;\nThe boundless Great Dao,\nIts profound meaning is invoked.\nMay it discern the earnest plea for redress of wrongs,\nAnd heed the words of repentance for past faults.\nDeign to bestow profound grace,\nAnd broadly open the statutes of pardon.\nConsidering the foolishness and shortcomings of the past,\nForsaking the deep transgressions of former times,\nThe errors of past lives,\nThe faults of this present existence.\nMay it allow the hundred bones to be joyfully unobstructed,\nThe six palaces harmoniously regulated,\nThe five viscera gladdened,\nThe myriad spirits at peace.\nThe Crimson Palace inscribed with the characters of ascension,\nThe Dark Bureau purged of names of decay.\nAll myriad entanglements dissolved,\nA thousand auspicious signs arrive in succession.\nEnmities cease their opposition,\nCreditors halt their claims,\nAccidental killings and unintended harms,\nAll are resolved and released.\n\nLet the mind be free of distracting thoughts,\nAnd the contemplation fixed upon the Mysterious Pass.\nTonight, briefly disclose the reasons for this retreat;\nTomorrow, separately present the prayers and supplications.\nThe local earth deities and territorial Perfected Officials,\nRecord the merits of this retreat,\nAnd report them above to the Perfected Realm.\nAll earnest wishes,\nAscend before the Jade Thearch’s throne in the Three Pure Ones’ boundless court.\n\nProceed to pay homage to the Ten Directions.\n\nWith devoted hearts, we take refuge and submit,\nTo the Highest Heavenly Treasure Primordial Sovereign of the Infinite and Boundless North,\nThe Most High Heavenly Worthy of Supreme Clarity.\nFor each direction, perform one bow in like manner.\n\nProceed with sincere repentance.\n\nWith devoted hearts, we take refuge and submit,\nTo the Heavenly Treasure Primordial Sovereigns of the Boundless Great Dao in the Ten Directions,\nThe Jade Thearchs of Supreme Clarity.\nToday, we repent and dissolve our faults and transgressions,\nMay vast compassion descend,\nAnd profound blessings be bestowed.\n\nWe pay homage to all in the east, west, south, north,\nAbove and below, the four intermediate directions,\nThe sun, moon, and stars,\nThe famous mountains and grotto-heavens,\nThe Five Marchmounts and Four Waterways,\nThe Eight Seas and Nine Rivers,\nThe officials and attendants of the Three Realms,\nAnd all Perfected Numinosities.\n\nWe pray for the present emperor,\nMay his sagely reign be long and distant,\nAnd the imperial domain secure and unshaken.\n\nWe repent for ourselves, the officials, civil and military,\nAnd for the patron of this retreat,\nThe nine generations of ancestors and distant kin,\nInner and outer relatives,\nThe four companions and three masters,\nSuperiors and subordinates,\nAll family members.\nFor transgressions and faults in past lives and this present existence,\nThrough countless kalpas,\nDisrespecting the sacred and scorning the worthy,\nDeceiving and misleading the four assemblies,\nBeing disloyal and unfilial,\nDestroying images and scriptures,\nHarming the innocent,\nAnd injuring living beings.\nSuch offenses and trespasses,\nPiled high as mountains,\nWithout the power of the Dao to dissolve and dispel,\nThere would be no means to attain the fruits of immortality.\nMay all past faults be extinguished,\nAnd new blessings fully realized.\nMay auspiciousness and felicity prevail,\nAnd the Perfected Numinosities grant their protection.\nEnmities cease their opposition,\nCreditors halt their claims,\nAccidental killings and unintended harms,\nAll are resolved and released.\nThe Crimson Palace inscribed with records,\nThe Dark Bureau purged of names,\nEternally dwelling in the blessed land,\nForever flourishing in the realm of longevity.\nMisfortunes sink into the nine nights,\nBlessings arise from the ten directions.\nWe bow our heads in reverence and take refuge,\nIn the true Three Treasures.\n\nProceed to recite the *Primordial Three Heavens Chapters*.\n\n**Hymn to the Clear and Subtle Heaven**\nThe Primordial pervades the empty void,\nThe three qi refine the upper gate.\nPurple radiance bathes the great expanse,\nThe four luminaries plant the numinous root.\nWondrous transformations issue from the eastern jade,\nThe three conveniences open the western Kunlun.\nVastly reflecting the ninefold clarity,\nThe five blossoms gird the brocade clouds.\nThe net of separation shines with divine lamps,\nThe seven stars fear the northern origin.\nSoaring to the precincts of Supreme Clarity,\nWing to wing, the Thearch’s singular honor.\nLofty and exalted, the Highest unfurls,\nHow the feathered youths swarm!\nFlowing fragrance, originally without color,\nPervades the myriad immortals.\nTo the left, revolving through the three kalpas,\nTo the right, turning the nine celestial gates.\nGolden blossoms and white clouds,\nThe eight winds dance in the empty wheel.\nThe four seasons never cease their mechanism,\nBlue and white are early distinct.\nNine nines transform the kalpa’s fate,\nThree threes pass through a single kalpa.\nHeaven and Earth have their final meeting,\nObstruction and stimulus return to their proper turn.\nThe Dharma of Orthodox Unity is clearly understood,\nThe six celestial texts are strictly cultivated.\nGreat Peace returns to the empty void,\nTo serve and assist the later sagely sovereign.\n\n**Hymn to the Yu-Yu Heaven**\nA numinous wind rises at the western gate,\nBrocade clouds arise from the eastern jade.\nThe three qi illumine the jade isles,\nFlowing fragrance rides the light smoke.\nFive blossoms scatter in the wind,\nSuddenly and fleetingly brightening the ninefold clarity.\nThe soaring trees fear the vermilion sun,\nYellow blossoms follow the moon’s birth.\nWithin, the lads who gather magic mushrooms,\nClothed in feathers, girded with flying azure.\nTheir soaring forms traverse the myriad peaks,\nCarefree, feasting in green chariots.\nControlling the ninefold empty wheels,\nTheir movement unfolds without fixed measure.\nTo the left, they command the three celestial texts,\nTo the right, they marshal the six celestial soldiers.\nExamining qi, they return to the empty cavern,\nThe six perfections respond to the turning of fate.\nThe kalpa’s fate has its own meeting,\nWho can fathom defeat and success?\nVast waves engulf the net of clouds,\nThe six directions leave no form behind.\nCorpse-souls drift in the long current,\nLonely spirits sink and scatter.\nGrieving this going and coming,\nOnly then is the true Dharma perceived.\nThose who pursue learning with utmost refinement,\nBind their jade names in the Eastern Flower.\nRejoicing in those inscribed on the white tablets,\nTogether they delight in Great Peace.\n\n**Hymn to the Great Red Heaven**\nThe celestial scriptures revolve through the celestial passes,\nThe five qi turn the three subtleties.\nThe purple portals emit jade tablets,\nThe golden gates receive the divine radiance.\n\nThe Eight Assemblies converge with the true wind,\nRadiant and bright, the layered darkness unfolds.\nBeyond the Nine Pures at heaven’s edge,\nThe lofty dawn revolves in solitude.\nThree hues return to empty nothingness,\nThe four seasons respond to the jade mechanism.\nThe River Lord has already raised his brush,\nThe five phases subtly propel one another.\nThe six perfections know no end or kalpa,\nWhen fate is exhausted, they ride qi to return.\nTen thousand demons spread across the heavens,\nHordes of malevolence vie to display their might.\nThe multitudes bear the brunt of calamity,\nPiles of corpses move one to sorrow.\nWondrous is the scripture of the true Dharma,\nTreading kalpas, its brilliance never fades.\nAt the appointed time, they will be received,\nTheir covenant lies at the Nine Heavens’ gate.\nWith you, I pledge Great Peace,\nReleasing the body to fly wingless.\n\n**Threefold Prostration**\nWith devoted heart, we bow in reverence,\nTo the Boundless, the Ineffable, the Primordial Highest Heavenly Treasure Yuanjun, Supreme Clarity Heavenly Worthy.\nWith devoted heart, we bow in reverence,\nTo the Thirty-Six Sections of the Supreme Clarity True Scripture, the Natural Yellow Writ of the Utmost Numinous Text.\nWith devoted heart, we bow in reverence,\nTo the Three Supreme Worthies of the Mysterium, the Dharma Masters, the Sagely Hosts of Virtue, and all the Immortals and Perfected.\n\n**Reiterating Names and Titles**\nThe Void, the Spontaneous, the Boundless Dao, the Highest Primordial Heavenly Treasure Yuanjun, the Jade Emperor, the Most High Lord Lao, the Supreme Ministers, the Officials of the Three Realms, and all the true numina.\nYour servant, though unworthy, has encountered the transformation of the Dao, possessing from past lives a numinous origin. Having received the true talismans and obtained the jade decrees, on the day of ordination and the hour of vows, I pledged to expound the mysterious principles and proclaim the sagely canon.\nThe officiants, fervent in their prayers for grace and profound in their repentance for transgressions, have observed the three days of the ritual, established this single fast, sent incense flying to the Eight Sceneries, and kindled lamps blooming with a thousand flowers. They pray before the precious throne, concentrating their thoughts upon the azure heavens above.\nWe humbly beseech the Void’s sagely hosts and the Most High Perfected to witness this sincerity and bestow abundant auspicious blessings. May your servant attain the Dao, remain unassailed by demonic trials, be protected by the myriad sages, and be assisted by the thousand spirits.\nToday, in accordance with the ritual statutes, we recite the precepts and circumambulate the altar. Tomorrow, we shall burn incense and present further petitions. May your compassionate illumination descend, gazing upon our devotion, delivering the deluded, and swiftly elevating them to the cloud paths. May the living and the dead alike find peace, preserving purity together, with lifespans towering like Mount Tai and blessings deep as the Eastern Sea.\nAbove, we extol the Heavenly Worthy’s nurturing grace; below, we fulfill our vow of submission. Grateful for the true and numinous, we implore your radiant regard. With reverence, we bow again.\n\n**Eight Vows**\nTo the Supreme Clarity Jade Emperor, the Primordial Lady of the Grand Simplicity, the Most High Numinous Immortal Capital’s Great Deity, we now present our eight vows:\nFirst, to soar through the heavens and attain long life as divine immortals;\nSecond, for heaven and earth to unite in harmonious winds and clouds;\nThird, for the Five Peaks to endure with our bodies forever;\nFourth, for the nine generations of ancestors to have their sins absolved and transgressions dissolved;\nFifth, for fortune and longevity to sever the roots of rebirth;\nSixth, for refinement of form and the full flowering of wisdom;\nSeventh, to vanquish demons and decapitate the lords of the Six Heavens;\nEighth, for the sweet dew to extend through eternal kalpas.\n\n**Reactivating the Censer**\nImmortal spirits, immortal officials, golden lads and messengers, the Five Emperors and Five Peaks, divine immortals and perfected beings, the true numina of the Three Luminaries, the Left and Right Dragon-Tiger Celestial Immortals, the Five Numinous Incense Officials—now summon and bring forth the primordial qi of the ten directions’ supreme true beings, the spontaneous golden liquid, the cinnabar essence, the mushroom stalks, the jade perfected of the Nine Heavens, to this fast’s altar. May they gaze upon the fast’s sponsor, shelter and uplift them to ascend as immortals, soaring through the great void, ascending the Nine Heavens in radiant splendor. Jade lads and jade maidens, attend and guard the incense smoke.\nConvey your servant’s earlier petitions swiftly to the Most High Perfected, the Supreme Clarity Jade Emperor, and the myriad sages before them.\n\n**Hymn of Circumambulation**\nOnce around the altar, descending from the platform:\nThe host of immortals emerges from the grotto’s truth,\nResplendent, they illuminate the Great Clarity.\nThose who serve are called immortals,\nTheir forms and essences enduring forever.\nCarefree, they sport in the mysterious void,\nTheir palaces arrayed beyond form.\nTheir brilliance adorns the Seven Treasures’ grove,\nRadiant as the sun and moon’s essence.\nDragon scales intertwine in swift flight,\nPhoenixes soar with mournful cries.\nThe Most High governs the Mysterious Palace,\nThe host of perfected recites the grotto scriptures.\nBurning incense, we bow in reverence,\nCircling left, we depart the palace walls.\nThree rounds return to the high seat,\nThe Heavenly Worthy responds to the sound.\nWith single-minded devotion to the supreme Dao,\nMay the world universally know peace.\n\n**Incantation for Descending the Altar**\nThose who cultivate immortality now descend the altar, exiting through the Earth Gate:\nFortune and longevity having passed,\nNames are stricken from the registers of the dead.\nBy the Celestial Emperor’s decree,\nThey shall live for a hundred million kalpas as one.\nThe rites concluded, all return to their stations,\nThe myriad spirits find repose.\nThe gates are opened, the true numina descend once more.\nBefore the Mysterium’s master, they bow in gratitude and disperse.\n\nThe rites of the Supreme Clarity Heavenly Treasure Fast’s first watch are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清天宝斋初夜仪 经名：上清天宝斋初夜仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 上清天宝斋初夜仪 上清天宝斋者，学道之人，求仙要诀。 学授上清毕法之后，得行此斋。 如授中法，不得行天宝斋也。 先为帝王国主祈福，次为祖祢请恩，洗涤宿瑕，忏谢新过，功行圆满，道德着充，自然成仙，白日腾翥。 天子镇信 金龙五枚各重五两，玉璧五枚各方三寸，东方青绫九匹，南方赤绫三匹，西方白绫七匹，北方黑绫五匹，中央黄绫一十二匹。 已上镇彩纹缯，并须密致厚实者。 如是轻薄者，不用。 公侯镇信 金龙五枚各重一两，玉璧五枚各随大小，东方青绫一匹，南方赤绫一匹，西方白绫一匹，北方皂绫一匹，中央黄绫一匹。 已上镇信彩缯，并须密致厚实者。 如是轻薄者，不用。 庶人镇信 东方青绢九尺，南方绯绢三尺，西方白绢七尺，北方皂绢五尺，中央黄绢一丈二尺。 已上镇信彩缯，并须密致厚实。 轻薄者，不在用限。 青童君曰：若是修行志久，在山岩中，奉道诚深，求仙愿切，但备香灯，无烦龙彩，精洁虔心，自然得道也。 凡欲修斋，先以黄书真文九道於青纸上，安在天门一小案上。 还官之日，只於天门烧之。 上至天子，下至庶人，於坛上级点三十二天灯，每位一盏。 中级下级，随力所办。 坛外，更点二十八宿灯及五星灯、本命五灯、行年九灯於本属位上。 蜡烛随事充足。 坛上门户榜子，一如黄箓斋法 先引斋主於玄师前，关告斋意 次唱道 次清三师",
      "translated_text": "**Shangqing Heavenly Treasure Retreat First Night Rite**\n\n*Sutra Title:* *Shangqing Heavenly Treasure Retreat First Night Rite*. One scroll. Source text: *Zhengtong Daoist Canon*, *Dongzhen* Section, *Weiyi* Category.\n\nThe *Shangqing Heavenly Treasure Retreat* is the essential method for Dao seekers aspiring to immortality. Only after receiving the full transmission of *Shangqing* esoteric teachings may one perform this retreat. Those who have received only intermediate methods are not permitted to undertake the *Heavenly Treasure Retreat*.\n\nFirst, prayers are offered for the blessings of emperors and rulers; next, petitions are made for the grace of ancestral spirits. Through this, past transgressions are purified, new faults repented, merits perfected, and virtue fully realized—naturally attaining immortality and ascending in broad daylight.\n\n**Offerings for the Son of Heaven (Emperor):**\n- Five golden dragons, each weighing five *liang*\n- Five jade discs, each three *cun* square\n- Nine bolts of azure silk (east)\n- Three bolts of crimson silk (south)\n- Seven bolts of white silk (west)\n- Five bolts of black silk (north)\n- Twelve bolts of yellow silk (center)\n\nAll above ceremonial silks must be tightly woven and of substantial thickness. Thin or flimsy fabrics are not to be used.\n\n**Offerings for Dukes and Marquises:**\n- Five golden dragons, each weighing one *liang*\n- Five jade discs, of varying sizes\n- One bolt each of azure silk (east), crimson silk (south), white silk (west), black silk (north), and yellow silk (center)\n\nAll ceremonial silks must be tightly woven and of substantial thickness. Thin or flimsy fabrics are not to be used.\n\n**Offerings for Commoners:**\n- Nine *chi* of azure silk (east)\n- Three *chi* of crimson silk (south)\n- Seven *chi* of white silk (west)\n- Five *chi* of black silk (north)\n- Twelve *chi* of yellow silk (center)\n\nAll ceremonial silks must be tightly woven and of substantial thickness. Thin or flimsy fabrics are not to be used.\n\nThe *Azure Lad* states: If one’s cultivation is long-standing, dwelling in mountains and caves with profound devotion to the Dao and earnest desire for immortality, then incense and lamps alone suffice—no need for dragons or silks. With purity of heart and sincerity, the Dao is naturally attained.\n\nFor those preparing the retreat:\nFirst, inscribe nine *True Writs* in yellow on azure paper and place them upon a small table at the *Heavenly Gate*. On the day of repayment to the celestial officials, burn them at the *Heavenly Gate*.\n\nFrom the Son of Heaven to commoners, thirty-two *Heavenly Lamps* are lit upon the altar’s tiers, one lamp per station. The middle and lower tiers may be adjusted according to one’s capacity.\n\nBeyond the altar, light the *Twenty-Eight Constellation Lamps*, the *Five Planetary Lamps*, the *Five Lamps of One’s Destiny*, and the *Nine Lamps of One’s Current Year* at their respective positions. Candles should be provided in sufficient quantity.\n\nThe altar’s gates and placards follow the same method as the *Yellow Register Retreat*.\n\nFirst, the retreat’s sponsor is led before the *Mystic Master* to declare the retreat’s purpose.\nNext, the *Invocation of the Dao* is chanted.\nThen, the *Three Masters* are purified.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 612,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.633220911026,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\上清天宝斋初夜仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "次华夏赞，引至地户 次勑水 次升坛咒从天门入 天玄炁清，三光洞明。 金房道室，五芝宝生。 玄云紫盖，来映我形。 玉童玉女，为我致灵。 五帝齐景，三光同軿。 腾驾龙鹤，升入紫庭。 斋主请福，愿保长生。 通真使者，速达上清。 次旋行，上五方香昼从东，夜从北 次上御案香 次上本位香 次各礼师存念如法 次卫灵神咒 次鸣法鼓二十四通 次发炉 上元五灵五老、虚无自然元一天尊，无上天宝君，直香金章、素灵玉女、左右玉灵自然通真、飞光龙骑各八十一人，并出严庄，关启此间土地里域真官。 臣今正尔烧香行道，奉为斋主某官，修设上清天宝大斋，一宿道场，三朝法事，精排兰味，严洁香花，缯彩金龙，祈恩请福。 愿得无上十方，金丹玉光，降流斋主身中，所启速闻高上玉帝万圣几前。 次各称名位 具法位臣某奉行上清天宝大斋，初夜法事，及诸道众斋主等谨同诚上启：虚无自然无极大道元始天尊，无上天宝元君上清玉帝，太上道君，太上老君，太上丈人，无上玄老高上玉皇，西龟王母、南岳夫人，十方得道大圣众，至真玄德诸君丈人，玉虚上帝，玉帝大帝，东华南极、西灵北真、玄都玉京金阙七宝玄台紫微上宫灵宝至真明皇道君，三十二天帝，二十四高真，太平下教文始先生，天地水三官上相上宰，日月星辰四司五帝，天仙地仙飞仙神仙，玄中大法师，经籍度三师，三天大法师，五岳四渎、八海九江、名山洞府三界官属，一切真灵。 臣闻：圆清方浊，孕元於玄关； 禀象分形，资灵於妙道。",
      "translated_text": "Next, the *Praise of Hua-Xia* is recited, and the sponsor is led to the *Earthly Gate*.\n\nNext, the *Water Edict* is pronounced.\nNext, the *Ascent to the Altar* incantation is chanted as one enters through the *Heavenly Gate*:\n\n*\"The qi of Heaven’s Mystery is pure,\nThe Three Luminaries illumine with clarity.\nWithin the golden chamber and Daoist sanctum,\nFive sacred mushrooms flourish as treasures.\nViolet clouds and purple canopies\nCome to adorn my form.\nJade lads and jade maidens\nConvey my spirit’s efficacy.\nThe Five Thearchs align in radiance,\nThe Three Luminaries share their chariot.\nMounting dragons and cranes,\nI ascend into the Purple Court.\nThe retreat’s sponsor seeks blessings,\nWishing to preserve long life.\nMessengers of communion with the Perfected,\nHasten to report to the Supreme Clarity.\"*\n\nNext, the procession circles the altar. During the day, begin from the East; at night, from the North.\nNext, incense is offered at the *Imperial Table*.\nNext, incense is offered at one’s station.\nNext, each participant bows to the masters, contemplating as prescribed.\n\nNext, the *Guardian Spirit Incantation* is recited.\nNext, the *Dharma Drum* is struck twenty-four times.\nNext, the *Incense Burner is Opened*:\n\n*\"To the Five Numinous Elders of the Upper Primordial,\nThe Vacuous and Spontaneous Original Heavenly Venerable of the One,\nThe Supreme Heavenly Treasure Lord,\nThe Bearers of Golden Chapters and Fragrant Commands,\nThe Jade Maidens of Pure Spirit,\nThe Eighty-One Attendants of the Left and Right Jade Numinous Spontaneity,\nThe Flying Radiance Dragon-Riders—\nAll emerge in solemn majesty.\nWe invoke the local earthbound Perfected Officials of this realm.\nWe now burn incense and perform the Dao,\nDedicating this to the retreat’s sponsor, [Rank] [Name],\nWho establishes the Great Retreat of the Heavenly Treasure of Supreme Clarity,\nA one-night Daoist arena,\nThree days of ritual proceedings,\nWith refined orchid offerings,\nPurified and adorned with fragrant flowers,\nSilken banners and golden dragons,\nTo beseech blessings and invoke grace.\nMay the Golden Elixir and Jade Radiance of the Supreme Ten Directions\nDescend and flow into the sponsor’s being,\nAnd may our petition swiftly reach the presence of the August Jade Emperor and the Myriad Saints.\"*\n\nNext, each participant states their name and rank:\n\n*\"The humble servant [Name], holding the ritual office of [Rank],\nConducts the Great Retreat of the Heavenly Treasure of Supreme Clarity,\nThe first-night ritual proceedings,\nAlong with all Daoist participants and the retreat’s sponsor,\nRespectfully and with sincere devotion, jointly petitions:\nThe Vacuous and Spontaneous Limitless Dao,\nThe Primordial Heavenly Venerable of the Origin,\nThe Supreme Heavenly Treasure Sovereign of Supreme Clarity,\nThe Jade Emperor of Supreme Clarity,\nThe Most High Dao Lord,\nThe Most High Lord Lao,\nThe Most High Elder,\nThe August Jade Emperor of the Supreme Mystery,\nThe Queen Mother of the West,\nThe Lady of the Southern Marchmount,\nThe Great Sage Hosts of the Ten Directions who have attained the Dao,\nThe Perfected Lords of Mysterious Virtue,\nThe Jade Sovereign of the Void,\nThe Great Jade Emperor,\nThe Eastern Florescence and Southern Culmen,\nThe Western Numinosity and Northern Perfection,\nThe Golden Watchtower of the Jade Capital in the Mysterious Metropolis,\nThe Seven Treasures of the Purple Tenuity’s Upper Palace,\nThe Sovereign of the Numinous Treasure of the Perfected and Radiant August Dao,\nThe Thirty-Two Heavenly Emperors,\nThe Twenty-Four Lofty Perfected,\nThe Master Wen Shi of the Xia Teaching of Great Peace,\nThe Three Officials of Heaven, Earth, and Water,\nThe Supreme Ministers and Prime Ministers,\nThe Four Administrations of the Sun, Moon, and Stars,\nThe Five Thearchs,\nThe Celestial Immortals, Earthbound Immortals, Flying Immortals, and Divine Immortals,\nThe Great Dharma Masters of the Mysterious Center,\nThe Three Masters of the Scriptures and Ordinations,\nThe Three Heavenly Dharma Masters,\nThe Five Marchmounts and Four Waterways,\nThe Eight Seas and Nine Rivers,\nThe Famous Mountains and Grotto-Heavens,\nThe Officials and Attendants of the Three Realms,\nAnd all Perfected Numinosities.\n\nWe have heard:\nThe round and clear, the square and turbid,\nConceive the Origin within the Mysterious Pass;\nReceiving form and dividing appearance,\nThey draw upon the numinous power of the Wondrous Dao.\"*",
      "overlap_context": "the *Twenty-Eight Constellation Lamps*, the *Five Planetary Lamps*, the *Five Lamps of One’s Destiny*, and the *Nine Lamps of One’s Current Year* at their respective positions. Candles should be provided in sufficient quantity.\n\nThe altar’s gates and placards follow the same method as the *Yellow Register Retreat*.\n\nFirst, the retreat’s sponsor is led before the *Mystic Master* to declare the retreat’s purpose.\nNext, the *Invocation of the Dao* is chanted.\nThen, the *Three Masters* are purified.",
      "start_char": 612,
      "end_char": 1230,
      "start_sentence": 32,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.781253576278687,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\上清天宝斋初夜仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "循环不辍，化育无遗，覆载生成，司明罪福。 此即元皇演教，太上流科。 飞法雨，以荡尘劳； 运慈舟，而超苦海。 是以斋主某敢投切恳，上叩玄关，乞福祈恩，消灾散祸，罗列香灯、缯彩、金龙，建一宵之道场，赴三时之法席。 臣以胎生陋质，乳哺凡庸，宿积庆缘，幸居玄化，早年冠褐，志慕真宗。 受法录於星坛，传香灯於月殿。 登坛之日，告盟之时，许阐玄猷，宣扬圣典。 凡有归向，敢不上闻。 斋主青词，谨当宣奏。 次读词 按如词旨，祈福诚探，拔度存亡，资延福寿，发心举意，三界遥知，谢过追愆，万圣容许，手持香火，心祝虚无，行道三时，设斋一座，精修兰味，严洁香花。 延三岛之高真，降十方之上圣。 玄穹渺邈，启告皆通，大道无涯，叩其深意。 鉴察追非之恳，聆闻悔过之词。 俯赐玄恩，弘开宥典。 念向来之愚短，舍已往之深非。 前代之尤，今生之过。 庶使百骸通悦，六府，均调，五藏欢怡，万神安稳。 丹宫有飞升之字，黑府无朽败之名。 万累俱消，千祥竟至。 冤仇息对，债主停词，故杀误伤，咸令解释。 精心绝念，注想玄关。 今夜略启斋因，来日别陈祝恳。 此间土地里域真官，录此斋功，上闻真界。 所有恳愿，上彻三清无极道君玉帝几前。 次礼十方 臣等志心归命，北方无极无穷元始高上天宝元君、上清天尊。 每方仿此各一礼 次各虔诚忏悔 臣等志心归命，十方无极大道天宝元君、上清玉帝。 臣等以今忏悔，散铄咎愆，普降洪慈，深贻巨泽。 遍礼东西南北、上下四维、日月星辰、名山洞府、五岳四渎、八海九江、三界官属，一切真灵。 上祝当今皇帝，圣算遐长，皇图巩固。 忏悔臣等官寮文武及以斋主九玄先远、内外宗亲、四友三师、上下眷属，前生今世，历劫罪尤，轻圣慢贤，诱欺四辈，不忠不孝，毁像毁经，残害无辜，损伤生类。 如斯咎衅，堆积如山，不凭道力消禳，无以得阶仙果，愿以旧愆消尽，新庆全臻。 惟吉惟祯，真灵翼佑。 冤仇息对，债主停词。 故杀误伤，咸令解释。 丹宫署简，黑部除名，永泰福乡，长芳寿域。 祸沉九夜，福起十方。 稽首归依，正真三宝。 次朗诵元始三天章 清微天颂 元始洞空无，三炁精上门。 紫融灌大虚，四明植灵根。 妙化发束琼，三便启西昆。 浩映九玄清，五华带锦云。 离罗焕神灯，七星惧北元。 飘飖上清畿，翼翼帝一尊。 落落高上张，羽童何纷纷。 流香本无色，洞入万仙群。 左回三流劫，右转九天关。 金华缨素云，八风舞空轮。 四时无停机，青白早分明。 九九改劫运，三三度一椿。 天地有终会，否激归任翻。 洞明正一法，严修六天文。 太平反空无，奉翼后圣君。 禹余天颂 灵风起西门，锦云生东琼。 三气焕玉洲，流香乘烟轻。 五花披风散，倏欻朗九清。 骞树惧朱日，黄华逐月生。 中有采芝童，衣羽带飞青。 飘景万岭峰，逍遥宴绿軿。 控御九空轮，运开无稽程。 左令三天文，右摄六天兵。 检炁反空洞，六度应运倾。 劫运自有会，谁测败与成。 洪波沦云纲，六合无遗形。 魄尸漂长流，孤魂湮复零。 悲此去来际，乃觉正法明。 至学加精修，东华结琼名。 欣有白简人，相与乐太平。 大赤天颂 洞关运天经，五气转三微。 紫户吐琼简，金门纳神晖。",
      "translated_text": "The ceaseless cycle revolves, nurturing all without omission;\nIt covers and bears, gives life and completes, governing brightness and transgressions, blessings and misfortunes.\nThis is the teaching expounded by the Primordial Thearch, the statutes flowing from the Most High.\nIt scatters the Dharma rain to cleanse worldly toils;\nIt navigates the vessel of compassion to transcend the sea of suffering.\n\nThus, the patron of this retreat, so-and-so, dares to present earnest supplications,\nTo knock upon the Mysterious Pass from above,\nBeseeching blessings and imploring grace,\nDispelling calamities and dispersing misfortunes.\nArrayed are incense and lamps, silken banners, and golden dragons,\nAs a single night’s Daoist sanctuary is established,\nTo attend the Dharma assemblies of the three watches.\n\nYour servant, born of humble flesh and nourished by common milk,\nHas, by accumulated karmic affinities, been fortunate to dwell within the transformative influence of the Mysterious,\nAnd from youth, donning cap and hempen robe, has aspired to the true lineage.\nReceiving the Dharma register at the Star Altar,\nTransmitting the fragrant lamp in the Moon Palace,\nOn the day of ascending the altar, at the hour of making vows,\nPledged to expound the profound Dao and proclaim the sacred scriptures.\nFor all who turn toward this Way, how dare I not make it known above?\n\nThe patron’s blue petition shall now be reverently proclaimed.\nProceed to read the petition.\n\nIn accordance with the petition’s intent,\nThe sincerity of the prayer for blessings runs deep,\nTo deliver and ferry the living and the dead,\nTo extend blessings and longevity.\nWith mind set and intention raised,\nThe Three Realms take distant note.\nAcknowledging past transgressions and pursuing faults,\nMay the myriad sages grant indulgence.\nHolding incense and fire in hand,\nThe heart prays to the Void and Nonexistent.\nPerforming the Dao for three watches,\nEstablishing a single retreat,\nRefining the orchid’s fragrance,\nAdorning with pure incense and flowers.\nInviting the lofty Perfected of the Three Isles,\nDescending the exalted sages of the Ten Directions.\nThe vast and distant Mysterious Heavens,\nAll supplications reach and are heard;\nThe boundless Great Dao,\nIts profound meaning is invoked.\nMay it discern the earnest plea for redress of wrongs,\nAnd heed the words of repentance for past faults.\nDeign to bestow profound grace,\nAnd broadly open the statutes of pardon.\nConsidering the foolishness and shortcomings of the past,\nForsaking the deep transgressions of former times,\nThe errors of past lives,\nThe faults of this present existence.\nMay it allow the hundred bones to be joyfully unobstructed,\nThe six palaces harmoniously regulated,\nThe five viscera gladdened,\nThe myriad spirits at peace.\nThe Crimson Palace inscribed with the characters of ascension,\nThe Dark Bureau purged of names of decay.\nAll myriad entanglements dissolved,\nA thousand auspicious signs arrive in succession.\nEnmities cease their opposition,\nCreditors halt their claims,\nAccidental killings and unintended harms,\nAll are resolved and released.\n\nLet the mind be free of distracting thoughts,\nAnd the contemplation fixed upon the Mysterious Pass.\nTonight, briefly disclose the reasons for this retreat;\nTomorrow, separately present the prayers and supplications.\nThe local earth deities and territorial Perfected Officials,\nRecord the merits of this retreat,\nAnd report them above to the Perfected Realm.\nAll earnest wishes,\nAscend before the Jade Thearch’s throne in the Three Pure Ones’ boundless court.\n\nProceed to pay homage to the Ten Directions.\n\nWith devoted hearts, we take refuge and submit,\nTo the Highest Heavenly Treasure Primordial Sovereign of the Infinite and Boundless North,\nThe Most High Heavenly Worthy of Supreme Clarity.\nFor each direction, perform one bow in like manner.\n\nProceed with sincere repentance.\n\nWith devoted hearts, we take refuge and submit,\nTo the Heavenly Treasure Primordial Sovereigns of the Boundless Great Dao in the Ten Directions,\nThe Jade Thearchs of Supreme Clarity.\nToday, we repent and dissolve our faults and transgressions,\nMay vast compassion descend,\nAnd profound blessings be bestowed.\n\nWe pay homage to all in the east, west, south, north,\nAbove and below, the four intermediate directions,\nThe sun, moon, and stars,\nThe famous mountains and grotto-heavens,\nThe Five Marchmounts and Four Waterways,\nThe Eight Seas and Nine Rivers,\nThe officials and attendants of the Three Realms,\nAnd all Perfected Numinosities.\n\nWe pray for the present emperor,\nMay his sagely reign be long and distant,\nAnd the imperial domain secure and unshaken.\n\nWe repent for ourselves, the officials, civil and military,\nAnd for the patron of this retreat,\nThe nine generations of ancestors and distant kin,\nInner and outer relatives,\nThe four companions and three masters,\nSuperiors and subordinates,\nAll family members.\nFor transgressions and faults in past lives and this present existence,\nThrough countless kalpas,\nDisrespecting the sacred and scorning the worthy,\nDeceiving and misleading the four assemblies,\nBeing disloyal and unfilial,\nDestroying images and scriptures,\nHarming the innocent,\nAnd injuring living beings.\nSuch offenses and trespasses,\nPiled high as mountains,\nWithout the power of the Dao to dissolve and dispel,\nThere would be no means to attain the fruits of immortality.\nMay all past faults be extinguished,\nAnd new blessings fully realized.\nMay auspiciousness and felicity prevail,\nAnd the Perfected Numinosities grant their protection.\nEnmities cease their opposition,\nCreditors halt their claims,\nAccidental killings and unintended harms,\nAll are resolved and released.\nThe Crimson Palace inscribed with records,\nThe Dark Bureau purged of names,\nEternally dwelling in the blessed land,\nForever flourishing in the realm of longevity.\nMisfortunes sink into the nine nights,\nBlessings arise from the ten directions.\nWe bow our heads in reverence and take refuge,\nIn the true Three Treasures.\n\nProceed to recite the *Primordial Three Heavens Chapters*.\n\n**Hymn to the Clear and Subtle Heaven**\nThe Primordial pervades the empty void,\nThe three qi refine the upper gate.\nPurple radiance bathes the great expanse,\nThe four luminaries plant the numinous root.\nWondrous transformations issue from the eastern jade,\nThe three conveniences open the western Kunlun.\nVastly reflecting the ninefold clarity,\nThe five blossoms gird the brocade clouds.\nThe net of separation shines with divine lamps,\nThe seven stars fear the northern origin.\nSoaring to the precincts of Supreme Clarity,\nWing to wing, the Thearch’s singular honor.\nLofty and exalted, the Highest unfurls,\nHow the feathered youths swarm!\nFlowing fragrance, originally without color,\nPervades the myriad immortals.\nTo the left, revolving through the three kalpas,\nTo the right, turning the nine celestial gates.\nGolden blossoms and white clouds,\nThe eight winds dance in the empty wheel.\nThe four seasons never cease their mechanism,\nBlue and white are early distinct.\nNine nines transform the kalpa’s fate,\nThree threes pass through a single kalpa.\nHeaven and Earth have their final meeting,\nObstruction and stimulus return to their proper turn.\nThe Dharma of Orthodox Unity is clearly understood,\nThe six celestial texts are strictly cultivated.\nGreat Peace returns to the empty void,\nTo serve and assist the later sagely sovereign.\n\n**Hymn to the Yu-Yu Heaven**\nA numinous wind rises at the western gate,\nBrocade clouds arise from the eastern jade.\nThe three qi illumine the jade isles,\nFlowing fragrance rides the light smoke.\nFive blossoms scatter in the wind,\nSuddenly and fleetingly brightening the ninefold clarity.\nThe soaring trees fear the vermilion sun,\nYellow blossoms follow the moon’s birth.\nWithin, the lads who gather magic mushrooms,\nClothed in feathers, girded with flying azure.\nTheir soaring forms traverse the myriad peaks,\nCarefree, feasting in green chariots.\nControlling the ninefold empty wheels,\nTheir movement unfolds without fixed measure.\nTo the left, they command the three celestial texts,\nTo the right, they marshal the six celestial soldiers.\nExamining qi, they return to the empty cavern,\nThe six perfections respond to the turning of fate.\nThe kalpa’s fate has its own meeting,\nWho can fathom defeat and success?\nVast waves engulf the net of clouds,\nThe six directions leave no form behind.\nCorpse-souls drift in the long current,\nLonely spirits sink and scatter.\nGrieving this going and coming,\nOnly then is the true Dharma perceived.\nThose who pursue learning with utmost refinement,\nBind their jade names in the Eastern Flower.\nRejoicing in those inscribed on the white tablets,\nTogether they delight in Great Peace.\n\n**Hymn to the Great Red Heaven**\nThe celestial scriptures revolve through the celestial passes,\nThe five qi turn the three subtleties.\nThe purple portals emit jade tablets,\nThe golden gates receive the divine radiance.",
      "overlap_context": "ous Center,\nThe Three Masters of the Scriptures and Ordinations,\nThe Three Heavenly Dharma Masters,\nThe Five Marchmounts and Four Waterways,\nThe Eight Seas and Nine Rivers,\nThe Famous Mountains and Grotto-Heavens,\nThe Officials and Attendants of the Three Realms,\nAnd all Perfected Numinosities.\n\nWe have heard:\nThe round and clear, the square and turbid,\nConceive the Origin within the Mysterious Pass;\nReceiving form and dividing appearance,\nThey draw upon the numinous power of the Wondrous Dao.\"*",
      "start_char": 1230,
      "end_char": 2470,
      "start_sentence": 57,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.47635769844055,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\上清天宝斋初夜仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "八会交真风，晃朗重冥开。 天际九清外，落落高晨回。 三色反空无，四候应玉机。 河侯已鼓笔，五行潜相推。 六度无终劫，运极乘炁归。 万魔罗天布，群凶竞吐威。 兆民负灾冲，积尸令人悲。 妙哉正法文，履劫明不衰。 至时相奉迎，契在九天扉。 与尔期太平，放身无翼飞。 次三礼 志心稽首礼，无极无穷元始高上天宝元君上清天尊。 志心稽首礼，三十六部上清真经自然黄书至极灵文。 志心稽首礼，太上三尊玄中法师道德圣众一切仙真。 次重称名位 虚无自然无极大道高上元始天宝元君，玉皇上帝，太上老君，上相上宰，三界官属，一切真灵。 臣以忝逢道化，宿有灵源，参佩真符，获披琼报。 受道之日，告盟之时，许阐玄猷，宣扬圣典。 斋官祈恩情切，谢过诚深，法中三朝，设斋一座，香飞八景，灯吐千花。 祷祝於宝座之前，注想於碧霄之上。 伏愿虚无圣众太上高真，监此精虔，厚贻祯贶。 令臣得道，魔试不侵，万圣护持，千灵翼赞。 今依科法，说戒绕坛，明日烧香，更申启奏。 愿开慈照，俯视精诚，拔度沉迷，早升云路，存亡获泰，共保清贞，寿峻南山，福深东海。 上明天尊覆育之泽，下副臣等归命之诚。 感谢正真，垂映下照，稽首再拜。 次八愿 上清玉帝太素元君太上高灵仙都大神，今日上告，八愿开陈：一愿飞霄，长生神真； 二愿天地，合景风云； 三愿五岳，与身长存； 四愿九祖，解罪脱愆； 五愿福寿，断绝胎根； 六愿端正，智惠开全； 七愿灭鬼，斩馘六天； 八愿甘露，永劫长延。 次复炉 仙灵仙官，金童使者，五帝五岳，神仙真人，三光正真左右龙虎天仙，五灵香官，当令召致无上十方正真生炁，自然金液，丹精芝英，九天玉真，在此斋坛，洞观斋主，覆护升仙，飞行太空，腾景九天，玉童玉女，侍卫香烟。 传臣向来所启，速达高真上清玉帝万圣几前。 吟游坛颂，一匝，下坛 众仙出洞真，焕烂耀太清，奉者号仙人，形质永长生。 逍遥戏玄虚，宫殿罗无形。 情璨七宝林，晃朗日月精。 龙鳞交横驰，凤凰翔悲鸣。 太上治玄宫，众真诵洞经。 焚香稽首礼，左行远宫城。 三周归高坐，天尊当应声。 一心弘至道，天下普安宁。 学仙注下坛咒从地户出 福寿既往，殒籍落名。 天帝有命，亿劫齐生。 事毕复位，万神咸宁。 有关启，复降真灵。 至玄师前，拜谢而散 上清天宝斋初夜仪竟",
      "translated_text": "The Eight Assemblies converge with the true wind,\nRadiant and bright, the layered darkness unfolds.\nBeyond the Nine Pures at heaven’s edge,\nThe lofty dawn revolves in solitude.\nThree hues return to empty nothingness,\nThe four seasons respond to the jade mechanism.\nThe River Lord has already raised his brush,\nThe five phases subtly propel one another.\nThe six perfections know no end or kalpa,\nWhen fate is exhausted, they ride qi to return.\nTen thousand demons spread across the heavens,\nHordes of malevolence vie to display their might.\nThe multitudes bear the brunt of calamity,\nPiles of corpses move one to sorrow.\nWondrous is the scripture of the true Dharma,\nTreading kalpas, its brilliance never fades.\nAt the appointed time, they will be received,\nTheir covenant lies at the Nine Heavens’ gate.\nWith you, I pledge Great Peace,\nReleasing the body to fly wingless.\n\n**Threefold Prostration**\nWith devoted heart, we bow in reverence,\nTo the Boundless, the Ineffable, the Primordial Highest Heavenly Treasure Yuanjun, Supreme Clarity Heavenly Worthy.\nWith devoted heart, we bow in reverence,\nTo the Thirty-Six Sections of the Supreme Clarity True Scripture, the Natural Yellow Writ of the Utmost Numinous Text.\nWith devoted heart, we bow in reverence,\nTo the Three Supreme Worthies of the Mysterium, the Dharma Masters, the Sagely Hosts of Virtue, and all the Immortals and Perfected.\n\n**Reiterating Names and Titles**\nThe Void, the Spontaneous, the Boundless Dao, the Highest Primordial Heavenly Treasure Yuanjun, the Jade Emperor, the Most High Lord Lao, the Supreme Ministers, the Officials of the Three Realms, and all the true numina.\nYour servant, though unworthy, has encountered the transformation of the Dao, possessing from past lives a numinous origin. Having received the true talismans and obtained the jade decrees, on the day of ordination and the hour of vows, I pledged to expound the mysterious principles and proclaim the sagely canon.\nThe officiants, fervent in their prayers for grace and profound in their repentance for transgressions, have observed the three days of the ritual, established this single fast, sent incense flying to the Eight Sceneries, and kindled lamps blooming with a thousand flowers. They pray before the precious throne, concentrating their thoughts upon the azure heavens above.\nWe humbly beseech the Void’s sagely hosts and the Most High Perfected to witness this sincerity and bestow abundant auspicious blessings. May your servant attain the Dao, remain unassailed by demonic trials, be protected by the myriad sages, and be assisted by the thousand spirits.\nToday, in accordance with the ritual statutes, we recite the precepts and circumambulate the altar. Tomorrow, we shall burn incense and present further petitions. May your compassionate illumination descend, gazing upon our devotion, delivering the deluded, and swiftly elevating them to the cloud paths. May the living and the dead alike find peace, preserving purity together, with lifespans towering like Mount Tai and blessings deep as the Eastern Sea.\nAbove, we extol the Heavenly Worthy’s nurturing grace; below, we fulfill our vow of submission. Grateful for the true and numinous, we implore your radiant regard. With reverence, we bow again.\n\n**Eight Vows**\nTo the Supreme Clarity Jade Emperor, the Primordial Lady of the Grand Simplicity, the Most High Numinous Immortal Capital’s Great Deity, we now present our eight vows:\nFirst, to soar through the heavens and attain long life as divine immortals;\nSecond, for heaven and earth to unite in harmonious winds and clouds;\nThird, for the Five Peaks to endure with our bodies forever;\nFourth, for the nine generations of ancestors to have their sins absolved and transgressions dissolved;\nFifth, for fortune and longevity to sever the roots of rebirth;\nSixth, for refinement of form and the full flowering of wisdom;\nSeventh, to vanquish demons and decapitate the lords of the Six Heavens;\nEighth, for the sweet dew to extend through eternal kalpas.\n\n**Reactivating the Censer**\nImmortal spirits, immortal officials, golden lads and messengers, the Five Emperors and Five Peaks, divine immortals and perfected beings, the true numina of the Three Luminaries, the Left and Right Dragon-Tiger Celestial Immortals, the Five Numinous Incense Officials—now summon and bring forth the primordial qi of the ten directions’ supreme true beings, the spontaneous golden liquid, the cinnabar essence, the mushroom stalks, the jade perfected of the Nine Heavens, to this fast’s altar. May they gaze upon the fast’s sponsor, shelter and uplift them to ascend as immortals, soaring through the great void, ascending the Nine Heavens in radiant splendor. Jade lads and jade maidens, attend and guard the incense smoke.\nConvey your servant’s earlier petitions swiftly to the Most High Perfected, the Supreme Clarity Jade Emperor, and the myriad sages before them.\n\n**Hymn of Circumambulation**\nOnce around the altar, descending from the platform:\nThe host of immortals emerges from the grotto’s truth,\nResplendent, they illuminate the Great Clarity.\nThose who serve are called immortals,\nTheir forms and essences enduring forever.\nCarefree, they sport in the mysterious void,\nTheir palaces arrayed beyond form.\nTheir brilliance adorns the Seven Treasures’ grove,\nRadiant as the sun and moon’s essence.\nDragon scales intertwine in swift flight,\nPhoenixes soar with mournful cries.\nThe Most High governs the Mysterious Palace,\nThe host of perfected recites the grotto scriptures.\nBurning incense, we bow in reverence,\nCircling left, we depart the palace walls.\nThree rounds return to the high seat,\nThe Heavenly Worthy responds to the sound.\nWith single-minded devotion to the supreme Dao,\nMay the world universally know peace.\n\n**Incantation for Descending the Altar**\nThose who cultivate immortality now descend the altar, exiting through the Earth Gate:\nFortune and longevity having passed,\nNames are stricken from the registers of the dead.\nBy the Celestial Emperor’s decree,\nThey shall live for a hundred million kalpas as one.\nThe rites concluded, all return to their stations,\nThe myriad spirits find repose.\nThe gates are opened, the true numina descend once more.\nBefore the Mysterium’s master, they bow in gratitude and disperse.\n\nThe rites of the Supreme Clarity Heavenly Treasure Fast’s first watch are now complete.",
      "overlap_context": "pirits sink and scatter.\nGrieving this going and coming,\nOnly then is the true Dharma perceived.\nThose who pursue learning with utmost refinement,\nBind their jade names in the Eastern Flower.\nRejoicing in those inscribed on the white tablets,\nTogether they delight in Great Peace.\n\n**Hymn to the Great Red Heaven**\nThe celestial scriptures revolve through the celestial passes,\nThe five qi turn the three subtleties.\nThe purple portals emit jade tablets,\nThe golden gates receive the divine radiance.",
      "start_char": 2470,
      "end_char": 3402,
      "start_sentence": 135,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.452261447906494,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\上清天宝斋初夜仪.txt",
        "category": "威仪类"
      }
    }
  ]
}