{
  "source_id": "上清太上回元隐道除罪籍经",
  "source_file": "chunked_daozang\\上清太上回元隐道除罪籍经.json",
  "total_chunks": 3,
  "total_original_chars": 2572,
  "total_translated_chars": 15948,
  "total_translation_time": 76.66683292388916,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清太上回元隐道除罪籍经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Scripture of the Great Highest’s Reversion to the Hidden Dao for Removing Sins from the Registers**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Great Highest’s Reversion to the Hidden Dao for Removing Sins from the Registers*\n*Author unknown, approximately dated to the Eastern Jin or Southern Dynasties period. The text also appears in* The Crimson Scripture of the Nine Perfected’s Central Scripture on the Elixir of Life-Generating Cinnabar. *One scroll.*\n*Source of the base text:* *The Orthodox Daoist Canon*, *Zhengyi Section, First Division*.\n\n---\n\n**The Supreme Clarity Scripture of the Great Highest’s Reversion to the Hidden Dao for Removing Sins from the Registers**\n\nThe Great Highest’s Jade Perfected Conceals the Primordial in Inner Contemplation. On the six *ding* days within the six *jia* cycles, at midnight—the hour when generative *qi* arises—Heaven’s Primordial unfolds its array, the womb’s bonds are doubly secure, the seven *po* ascend in speech, and the three *hun* record transgressions. Ancestral errors of seven generations and accumulated punishments of the Three Yin thus necessitate the method of dissolution to absolve transgressions and sins.\n\nThose who practice this Dao are called seekers of immortality. Regularly, on the *ding-mao* day within the *jia-zi* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly intone the incantation:\n\n*\"First, the Supreme Star: Dark Pivot, Yang Brightness, Hun Spirit, Supreme Mystery, Nine Lords of the Upper Primordial.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the Yang sins and Yang transgressions of my seven generations past, down to my own person, all be dissolved. May all aspirations be fulfilled, all affairs align with the heart, and may I ascend the Seven Primordials, attaining harmony with Heaven. May my name be inscribed in the Dipper’s dawn, and my lifespan extended for billions of years.\"*\n\nUpon completion, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into the heart. Envision the starlight illuminating within and without, penetrating all. Focus intently upon this—this is called *Dissolving the Morning’s Entangling Net and Illuminating the Inner Dao*.\n\nOn the *ding-chou* day within the *jia-xu* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly intone the incantation:\n\n*\"Second, the Primordial Star: Northern Terrace, Yin Essence, Celestial Rotator, Hun Spirit, Supreme Jade, Nine Lords of the Upper Mystery.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the Yin sins and Yin transgressions of my seven generations past, down to my own person, all be dissolved. May the Six *Qi* fill and overflow, the Four Spirits be rendered empty and receptive. May I ascend the Seven Primordials, my name inscribed in the Jade Scriptures, ascend to the Purple Clarity, ride the Dark Chariot of Emptiness, and move in harmony with Heaven’s decree, prosperous and upright.\"*\n\nUpon completion, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into the lungs. Let their light penetrate within and without, making the Five Viscera distinct. Again, visualize the stars entering your mouth, sensing their radiance scattering and filling it. When warmth is felt within the mouth, this is the sign of the stellar essence’s arrival.\n\nIn all contemplations of the Seven Primordials and the Dao of the Nine Mornings, the bed and mat must not be shared with others, nor should clothing. Those who sleep together, male and female, are recorded in the Registers of Northern Mystery’s Sins. If one violates defilement, calamity is inscribed in the Earth Prison.\n\nHowever, sharing with a master or fellow disciple of the same *qi* is not considered a violation.\n\nOn the *ding-hai* day within the *jia-shen* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly pray:\n\n*\"Third, the Perfected Star: Nine Ultimates, Supreme Perfected, Upper Primordial Person, Heavenly Mechanism, *Po* Essence, Supreme Simplicity, Nine Lords of the Upper Plain.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the death sins and death transgressions of my seven ancestors past, down to my own person—accumulated evils, private wickedness, and offenses against the Three Officials of Heaven, Earth, and Water—all be dissolved. May my eyes see clearly, penetrating the obscure and unseen. May I ascend the Seven Primordials, my name inscribed in the Supreme Clarity, command the myriad spirits, ascend to the Jade Court, ride the luminous chariot through the void, and attain harmony with Heaven.\"*\n\nUpon completion, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into the liver. Let their light illuminate the Five Viscera, penetrating within and without. Then, facing north, bow twice. Upon rising, swallow saliva nine times, or stand and bow.\n\nOn the *ding-you* day within the *jia-wu* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly pray:\n\n*\"Fourth, the Pivot Star: Rotating Root, Dark Obscurity, Celestial Balance, *Po* Essence, Supreme Emptiness, Nine Lords of the Upper Void.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the sins of ingratitude and lack of virtue, of unkindness and unfiliality—myriad Yin evils of my seven generations past, down to my own person—all be eradicated. May I ingest essence and absorb *qi*, daily advancing in attainment. May I ascend the Seven Primordials, my name recorded in the Great Mystery, listed among the Jade Emperor’s ranks, ride the luminous chariot through the Nine Heavens, command spirits and govern numina, and share the heart of the sun and moon.\"*\n\nUpon completion, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into the spleen. Let their light shine brilliantly, illuminating the Five Viscera. Then, swallow saliva fourteen times.\n\nOn the *ding-wei* day within the *jia-chen* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly pray:\n\n*\"Fifth, the Principal Star: Celestial Balance, Cinnabar Primordial, Jade Pivot, *Po* Spirit, Upper Primordial Lord, Supreme Mystery, Nine August Lords.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the inner and outer defilements and transgressions of my seven generations past, down to my own person—myriad errors recorded in the Dark Pass—all be dissolved. May my body fill the Yellow Court, stabilizing the stomach’s center. May I ascend to the Great Simplicity, ride the luminous chariot to the Purple Palace, with Jade Maidens attending on the right and Jade Lads on the left. May I share the radiance of the sun and moon, and be enthroned as a Perfected King.\"*\n\nThen, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into your stomach, their radiance illuminating and distinctly revealing the five viscera. This done, swallow saliva thirty-six times.\n\nOn a *ding-si* day within the *jia-yin* ten-day period, at midnight, sit upright on your bed in the bedchamber, facing north with hands clasped. First, knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly pray:\n\n*\"Sixth, the Star of Destiny’s Mechanism: Northern Culmen, Opening Yang, *Po* Spirit, Upper Cinnabar, True Sovereign of the Void, Nine Lords.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the sins and transgressions of my seven generations past, down to my own person—all the thieving, malevolent, treacherous, rebellious, and reckless crimes I have committed or enacted, those that have implicated the celestial records and imperial officials—all be dissolved. May the hundred ailments be healed, the body’s qi flow smoothly and uprightly, my name inscribed on the Terrace of Immortals, engraved upon golden tablets of the Upper Clarity. May I command the ten thousand spirits and soar through the Nine Luminaries.\"*\n\nThis done, visualize the Seven Stars of the Northern Dipper descending from the heavens, entering directly into your mouth and settling in the kidneys, their radiance penetrating and distinctly revealing the five viscera. This done, swallow saliva twenty-eight times.\n\nOn yang days, visualize the stars entering the left kidney; on yin days, the right kidney. The first day is yang, the second yin. This practice strictly forbids exposure to blood, filth, foul odors, or the consumption of meat and pungent foods. Violation will bring calamity upon the seven ancestors above and oneself below, reducing one to a lowly ghost after death, erased from the gates of the celestial court.\n\nOn the evening of the last day of the lunar month, before the cock crows at the dawn of the new moon, sit upright on your bed in the bedchamber, facing east with hands clasped. Knock the teeth seven times, then gaze upward and visualize the Seven Stars of the Northern Dipper shining brilliantly to your left. After a long while, softly pray:\n\n*\"Seventh, the Pass Star: Mysterious Yang, Celestial Pass, Jade Radiance, Great Brilliance, Supreme Jade Sovereign of the Dao.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the hidden and obscured sins of my seven generations past, down to my own person—all the violations of the Celestial Net, the Five Punishments, and the myriad spirits within the body, recorded in the Ghost Bureau of the Northern Emperor—all be dissolved. May my spirit and essence flow freely in eight directions, enabling me to sit or stand at will, to hear sounds beyond hearing, and to see with eyes that emit purple light. May my name be carved upon the jade tablets of the Great Simplicity, my vision penetrating the formless. May my name be inscribed in the records of the Celestial Lords, my destiny equal to the Two Luminaries. May I soar through the Seven Primes and repose in the Purple Court.\"*\n\nThis done, visualize the Seven Stars of the Northern Dipper descending from the heavens, entering directly into your mouth, and passing into the pupils of your eyes, illuminating both within and without, enabling you to see the five viscera distinctly. On yang days, visualize the stars entering the left pupil; on yin days, the right pupil.\n\nOn the six *jia* days, at the hour when generative qi arises at midnight, lie or sit on your bed in the bedchamber with your head facing any direction. Clench your fists, close your breath, and settle the spirit. After a long while, knock the teeth nine times. Then visualize the Nine Stars of the Northern Dipper shining brilliantly above your neck, their rays extending so that two stars appear before the Dipper’s handle, their radiance intermingling. Softly pray:\n\n*\"Eighth, the Imperial Star: Most High Jade Sovereign, Spirit of the Eight Effulgences, Primordial Lord. Ninth, the Venerable Star: Jade Sovereign of the Great Tenuity, Spirit of the Seven Dawns of the Primordial Simplicity.\"*\n\nInvoke them nine times, then pray:\n\n*\"May the sins and transgressions of my nine generations of ancestors, down to my own person—all the great and small offenses committed against hills, mountains, rivers, and streams, those inscribed in the registers of the dead, the hidden malevolence, concealed treachery, and myriad deceptions recorded in the Ghost Bureau of Mount Feng—along with the capital crimes listed in the black ledgers of the Nine Primes of the Great Ultimate before the Northern Emperor, beseech the Most High Jade Sovereign of the Nine Primes to dissolve them all. May I soar through the Seven Paths, ascend to the Jade Clarity, and wander the Great Void. May I ride the luminous chariot of dawn’s birth, feast in the Eight Simplicities of the north, and rival the sun in splendor. May I join the celestial assembly, command the ten thousand spirits, and govern the myriad numina.\"*\n\nThis done, visualize the Seven Stars of the Northern Dipper descending from the heavens and entering the Purple Chamber of the Muddy Pellet, their radiance illuminating it so that light suffuses the entire body and the five viscera, both within and without, generating clouds of purple qi that billow densely. Hold this vision steadfastly. This done, swallow saliva fifty-four times.\n\nShould the days of the six jia or six ding, or the last day of the lunar month, find one’s meditative focus nearing completion, one may then proceed with gradual refinement, weighing and cultivating the practice without undue frequency or intensity. In all matters, follow this example, ensuring the true method remains wholly intact.\n\nHerein concludes the Dao of the Most High’s Return to the Origin and Atonement for Transgressions.\n\nThe Most High sealed the Five Penetrations on the Five Marchmounts’ jade caskets. The Dao of Returning to the Origin was concealed within the Palace of the Nine Dawns. Having cultivated the Five Penetrations, one must practice the Return to the Origin: the Five Penetrations open at the Sovereign’s Beginning, while the Return to the Origin is bound to the Mysterious End. Thus, those who cultivate the Five Penetrations and traverse the Seven Primes’ Hidden Dao of Return must abstain from blood, raw flesh, and pungent foods. Should one encounter corpses or impurities and transgress, they shall face the Great Mysterious Judgment.\n\nThe Five Penetrations are the Most High’s auspicious days; the Return to the Origin, the Most High’s days of renewal. Without knowledge of the Five Penetrations, one cannot dissolve transgressions or erase faults; without knowledge of the Return to the Origin’s Hidden Dao, one cannot be enrolled among the Perfected of the Upper Realms. On these days, one should meditate upon auspicious matters, first atoning for the transgressions within one’s body—thereby untying the knots of seven generations and escaping the bonds of punishment and fate. Only then may one be revealed to the immortals of the Nine Palaces.\n\nFor all who cultivate the affairs of the Cavern Chamber and Purple Chamber, or visualize the Nine Primes and Seven Primes, at the onset of sleep or upon first lying down, and before and after meals, first offer this subtle invocation:\n\n*\"Five Stars, Five Penetrations,\nSix Harmonies, Purple Chamber,\nReturn to the Origin, Hidden Dao,\nVast and Lofty Seven Dawns.\nThe soul’s begetter is the Mysterious Father—\nthe Father transforms into the One, becoming spirit.\nThe spirit’s begetter is the Mysterious Mother—\nthe Mother transforms into the Two, giving birth to the body.\nThe Lord Son gathers my sinews and bones;\nWhite Prime governs my essence and qi.\nLong life and enduring vision,\nsoaring as an immortal through the Ten Heavens.\"*\n\nThis done, ensure no ear hears the sound of the invocation. This is the Most High’s Hidden Invocation, for dispelling pernicious qi, summoning spirit and essence, and ensuring one remains untroubled by obscurity throughout life.\n\nHere ends the *Upper Clarity Scripture of the Most High’s Hidden Dao of Returning to the Origin for Erasing the Registers of Transgressions*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清太上回元隐道除罪籍经 经名：上清太上回元隐道除罪籍经。 撰人不详，约出於东晋南朝。 经文又见於《九真中经绛生神丹诀》中。 一卷。 底本出处：《正统道藏》正一部。 上清太上回元隐道除罪籍经 太上玉真隐元内观，用六甲之旬六丁之日，夜半是生气之时，天元敷陈，胞结重固，七魄上言，三魂记过，违愆七祖，积罚三阴，故有消除之法，以解脱愆罪#1。 施此道者，乃曰求仙之夫者矣。 常以甲子之旬丁卯之日，夜半之时，於寝室床上平坐，北向接手，叩齿七通毕，乃仰存七星，使焕明於北方，良久，微咒曰：第一太星玄枢阳明魂神上玄九君。 作七呼之，乃又祝曰：愿得除某七世已来，下逮某身阳罪阳过，皆令消除，所向如愿，万事合心，飞步七元，与天相倾，名刊斗晨，延纪亿年。 毕，乃存北斗七星从天来下，飞入我口，径在心中。 存星光，令内外洞彻，极思念之。 此谓解晨结罗内映上道。 甲戌之旬丁丑之日，夜半之时，於寝室床上平坐，北向接手，先叩齿七通毕，乃仰存七星，使焕明於北方，良久，微咒曰：第二元星北台阴精天璇魂神上玉九君。 作七呼之，乃又祝曰：愿得除某七世已来，下逮某身阴罪阴过，皆令消除，六气盈满，四神用虚，飞行七元，名刊玉书，上登紫清，乘玄驾无，出入利贞，与天同符。 毕，乃存北斗七星从天中而来，飞入我口，径在肺中，使洞鉴内外，五藏分明。 又存星来入口，当令自觉光芒四散满口，口中觉小热，即星精来入之验也。 诸思七元存九晨之道，所寝床席不与他人同止，衣服亦然。 男女同席而息者，乃列罪北玄之籍。 若犯乎洿秽者，殃注於地狱也。 师友同气不为犯也。 甲申之旬丁亥之日，夜半之时，於寝室床上平坐，北向接手，叩齿七通毕，乃仰天存七星，使焕明於北方，良久，微祝曰：第三真星九极上真上元真人天机魄精上素九君。 作七呼之，乃祝曰：愿得某七祖已来，下逮某身死罪死过，积恶私慝，犯违天地水三官者，皆令消除，目明彻视，洞监幽无，飞行七元，名书上清，役使万神，上登玉庭，驾景乘空，与天相倾。 毕，乃存北斗七星从天来下，飞入我口，径在肝中，使光照五藏，内外洞明。 毕，心存北向再拜，拜毕，咽液九过，亦可起拜。 甲午之旬丁酉之日，夜半之时，於寝室床上平坐，北向接手，叩齿七通，乃仰存七星，使焕明於北方，良久，微祝曰：第四纽星璇根玄冥天权魄精上虚九君#2。 作七呼之。 又祝曰：愿得除某七世以来，下逮某身无恩无德，不仁不孝，阴恶之罪数千万计，皆令消灭，服食纳精，日以进益，飞登七元，刊录太玄，上列玉皇，乘景九天，役神御灵，日月同心。 毕，乃存北斗七星从天来，飞入我口，径在脾中，使光明洞彻，映照五藏。 毕，咽液二七过。 甲辰之旬丁未之日，夜半之时，於寝室床上，北向平坐接手，叩齿七通毕，乃仰存七星，使焕明於北方，良久，微祝曰：第五纲星天平丹元玉衡魄灵上元君上玄九皇君。 作七呼之。 又祝曰：愿得除某七世已来，下逮某身内外秽罪，表裹洗过数千万亿，记在幽关者，皆令消除。 当令体充黄庭，盈镇胃中，上列太素，乘景紫宫，右侍玉女，左侍玉童，日月同晖，位为真王。",
      "translated_text": "**The Supreme Clarity Scripture of the Great Highest’s Reversion to the Hidden Dao for Removing Sins from the Registers**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Great Highest’s Reversion to the Hidden Dao for Removing Sins from the Registers*\n*Author unknown, approximately dated to the Eastern Jin or Southern Dynasties period. The text also appears in* The Crimson Scripture of the Nine Perfected’s Central Scripture on the Elixir of Life-Generating Cinnabar. *One scroll.*\n*Source of the base text:* *The Orthodox Daoist Canon*, *Zhengyi Section, First Division*.\n\n---\n\n**The Supreme Clarity Scripture of the Great Highest’s Reversion to the Hidden Dao for Removing Sins from the Registers**\n\nThe Great Highest’s Jade Perfected Conceals the Primordial in Inner Contemplation. On the six *ding* days within the six *jia* cycles, at midnight—the hour when generative *qi* arises—Heaven’s Primordial unfolds its array, the womb’s bonds are doubly secure, the seven *po* ascend in speech, and the three *hun* record transgressions. Ancestral errors of seven generations and accumulated punishments of the Three Yin thus necessitate the method of dissolution to absolve transgressions and sins.\n\nThose who practice this Dao are called seekers of immortality. Regularly, on the *ding-mao* day within the *jia-zi* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly intone the incantation:\n\n*\"First, the Supreme Star: Dark Pivot, Yang Brightness, Hun Spirit, Supreme Mystery, Nine Lords of the Upper Primordial.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the Yang sins and Yang transgressions of my seven generations past, down to my own person, all be dissolved. May all aspirations be fulfilled, all affairs align with the heart, and may I ascend the Seven Primordials, attaining harmony with Heaven. May my name be inscribed in the Dipper’s dawn, and my lifespan extended for billions of years.\"*\n\nUpon completion, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into the heart. Envision the starlight illuminating within and without, penetrating all. Focus intently upon this—this is called *Dissolving the Morning’s Entangling Net and Illuminating the Inner Dao*.\n\nOn the *ding-chou* day within the *jia-xu* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly intone the incantation:\n\n*\"Second, the Primordial Star: Northern Terrace, Yin Essence, Celestial Rotator, Hun Spirit, Supreme Jade, Nine Lords of the Upper Mystery.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the Yin sins and Yin transgressions of my seven generations past, down to my own person, all be dissolved. May the Six *Qi* fill and overflow, the Four Spirits be rendered empty and receptive. May I ascend the Seven Primordials, my name inscribed in the Jade Scriptures, ascend to the Purple Clarity, ride the Dark Chariot of Emptiness, and move in harmony with Heaven’s decree, prosperous and upright.\"*\n\nUpon completion, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into the lungs. Let their light penetrate within and without, making the Five Viscera distinct. Again, visualize the stars entering your mouth, sensing their radiance scattering and filling it. When warmth is felt within the mouth, this is the sign of the stellar essence’s arrival.\n\nIn all contemplations of the Seven Primordials and the Dao of the Nine Mornings, the bed and mat must not be shared with others, nor should clothing. Those who sleep together, male and female, are recorded in the Registers of Northern Mystery’s Sins. If one violates defilement, calamity is inscribed in the Earth Prison.\n\nHowever, sharing with a master or fellow disciple of the same *qi* is not considered a violation.\n\nOn the *ding-hai* day within the *jia-shen* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly pray:\n\n*\"Third, the Perfected Star: Nine Ultimates, Supreme Perfected, Upper Primordial Person, Heavenly Mechanism, *Po* Essence, Supreme Simplicity, Nine Lords of the Upper Plain.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the death sins and death transgressions of my seven ancestors past, down to my own person—accumulated evils, private wickedness, and offenses against the Three Officials of Heaven, Earth, and Water—all be dissolved. May my eyes see clearly, penetrating the obscure and unseen. May I ascend the Seven Primordials, my name inscribed in the Supreme Clarity, command the myriad spirits, ascend to the Jade Court, ride the luminous chariot through the void, and attain harmony with Heaven.\"*\n\nUpon completion, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into the liver. Let their light illuminate the Five Viscera, penetrating within and without. Then, facing north, bow twice. Upon rising, swallow saliva nine times, or stand and bow.\n\nOn the *ding-you* day within the *jia-wu* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly pray:\n\n*\"Fourth, the Pivot Star: Rotating Root, Dark Obscurity, Celestial Balance, *Po* Essence, Supreme Emptiness, Nine Lords of the Upper Void.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the sins of ingratitude and lack of virtue, of unkindness and unfiliality—myriad Yin evils of my seven generations past, down to my own person—all be eradicated. May I ingest essence and absorb *qi*, daily advancing in attainment. May I ascend the Seven Primordials, my name recorded in the Great Mystery, listed among the Jade Emperor’s ranks, ride the luminous chariot through the Nine Heavens, command spirits and govern numina, and share the heart of the sun and moon.\"*\n\nUpon completion, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into the spleen. Let their light shine brilliantly, illuminating the Five Viscera. Then, swallow saliva fourteen times.\n\nOn the *ding-wei* day within the *jia-chen* cycle, at midnight, sit upright on the bed in the bedchamber, face north, clasp the hands, and knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly pray:\n\n*\"Fifth, the Principal Star: Celestial Balance, Cinnabar Primordial, Jade Pivot, *Po* Spirit, Upper Primordial Lord, Supreme Mystery, Nine August Lords.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the inner and outer defilements and transgressions of my seven generations past, down to my own person—myriad errors recorded in the Dark Pass—all be dissolved. May my body fill the Yellow Court, stabilizing the stomach’s center. May I ascend to the Great Simplicity, ride the luminous chariot to the Purple Palace, with Jade Maidens attending on the right and Jade Lads on the left. May I share the radiance of the sun and moon, and be enthroned as a Perfected King.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1238,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.621185302734375,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上回元隐道除罪籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "毕，乃存北斗七星从天来下，飞入我口，径在胃中，使光明洞照，五藏分别。 毕，咽液二九过。 甲寅之旬丁巳之日，夜半之时，於寝室床上北向接手，先叩齿七通，乃仰存七星，使焕明於北方，良久，微祝曰：第六纪星命机北极闿阳魄灵上丹真皇虚无九君。 作七呼之。 又祝曰：愿得除某七世已来，下逮某身所犯所行贼恶罪过，奸逆乱妄，引纪帝官者，皆令消灭，百痾康愈，体气利贞，名书仙台，刻金上清，役使万神，飞行九明。 毕，存北斗七星从天来下，径入我口，在肾中，使光明洞彻，五藏分别。 毕，咽液二七过。 阳日存在左肾，阴日存在右肾。 一日为阳，二日为阴。 此道尤禁见血秽臭漫，杂食荤辛，则上注延於七祖，下注祸逮某一身，死为下鬼，名除帝门。 月晦之夕明日月朔，未鸡鸣之前，当於寝室床上，东向接手平坐，叩齿七通，乃仰存北斗七星，使焕明於我之左面，良久，微祝曰：第七关星玄阳天关瑶光大明太上玉皇道君。 作七呼之。 又祝曰：愿得除某七世已来暗昧匿罪，犯天罗五刑身中之神数千万亿，记在北帝鬼官者，皆令消灭，当令某神精八达，坐在立亡，耳听绝音，目生紫光，刊玉太素，洞鉴无形，名书帝君，命均二明，飞行七元，寝宴紫庭。 毕，存北斗七星从天来下，径入我口，从口入至目童中，通映两眼，使内外自照，存见五藏，使分明。 阳日存星入左目童，阴日存星入右目童。 六甲日夜半生气之时，於寝室床，卧坐首向随意也，握固而闭气定神，良久，叩齿九通毕，存北斗九星，使焕明於项上，令九星光芒，二星在斗柄前，光芒以相映及於是，乃微祝曰：第八帝星高上玉皇神八景元君、第九尊星太微玉帝君神太素七晨元君。 九过呼之，乃祝曰：愿得除某九祖父母已来，下逮某身诸丘山川源大小罪过，名上死籍，阴匿贼恶，伏奸藏欺，事有亿万，列在鬼帝酆山上者，死罪条例之愆，记于北上九元太极真人黑簿者，乞九元太上帝尊玉玄君，皆令事事消除，飞行七道，上登玉清，同游太无，乘景晨生，北宴八素，与日相倾，总朝皇妃，摄御万灵。 毕，又存北斗七星从天来下，经入於泥丸紫房中，使洞照泥丸，令光明接彻一身五藏，使内外通生紫光云气，极令郁郁，仿髴念之。 毕，咽液三九过。",
      "translated_text": "Then, visualize the Seven Stars of the Northern Dipper descending from the heavens, flying into your mouth, and entering directly into your stomach, their radiance illuminating and distinctly revealing the five viscera. This done, swallow saliva thirty-six times.\n\nOn a *ding-si* day within the *jia-yin* ten-day period, at midnight, sit upright on your bed in the bedchamber, facing north with hands clasped. First, knock the teeth seven times. Then, gazing upward, visualize the Seven Stars shining brilliantly in the north. After a long while, softly pray:\n\n*\"Sixth, the Star of Destiny’s Mechanism: Northern Culmen, Opening Yang, *Po* Spirit, Upper Cinnabar, True Sovereign of the Void, Nine Lords.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the sins and transgressions of my seven generations past, down to my own person—all the thieving, malevolent, treacherous, rebellious, and reckless crimes I have committed or enacted, those that have implicated the celestial records and imperial officials—all be dissolved. May the hundred ailments be healed, the body’s qi flow smoothly and uprightly, my name inscribed on the Terrace of Immortals, engraved upon golden tablets of the Upper Clarity. May I command the ten thousand spirits and soar through the Nine Luminaries.\"*\n\nThis done, visualize the Seven Stars of the Northern Dipper descending from the heavens, entering directly into your mouth and settling in the kidneys, their radiance penetrating and distinctly revealing the five viscera. This done, swallow saliva twenty-eight times.\n\nOn yang days, visualize the stars entering the left kidney; on yin days, the right kidney. The first day is yang, the second yin. This practice strictly forbids exposure to blood, filth, foul odors, or the consumption of meat and pungent foods. Violation will bring calamity upon the seven ancestors above and oneself below, reducing one to a lowly ghost after death, erased from the gates of the celestial court.\n\nOn the evening of the last day of the lunar month, before the cock crows at the dawn of the new moon, sit upright on your bed in the bedchamber, facing east with hands clasped. Knock the teeth seven times, then gaze upward and visualize the Seven Stars of the Northern Dipper shining brilliantly to your left. After a long while, softly pray:\n\n*\"Seventh, the Pass Star: Mysterious Yang, Celestial Pass, Jade Radiance, Great Brilliance, Supreme Jade Sovereign of the Dao.\"*\n\nInvoke it seven times, then pray:\n\n*\"May the hidden and obscured sins of my seven generations past, down to my own person—all the violations of the Celestial Net, the Five Punishments, and the myriad spirits within the body, recorded in the Ghost Bureau of the Northern Emperor—all be dissolved. May my spirit and essence flow freely in eight directions, enabling me to sit or stand at will, to hear sounds beyond hearing, and to see with eyes that emit purple light. May my name be carved upon the jade tablets of the Great Simplicity, my vision penetrating the formless. May my name be inscribed in the records of the Celestial Lords, my destiny equal to the Two Luminaries. May I soar through the Seven Primes and repose in the Purple Court.\"*\n\nThis done, visualize the Seven Stars of the Northern Dipper descending from the heavens, entering directly into your mouth, and passing into the pupils of your eyes, illuminating both within and without, enabling you to see the five viscera distinctly. On yang days, visualize the stars entering the left pupil; on yin days, the right pupil.\n\nOn the six *jia* days, at the hour when generative qi arises at midnight, lie or sit on your bed in the bedchamber with your head facing any direction. Clench your fists, close your breath, and settle the spirit. After a long while, knock the teeth nine times. Then visualize the Nine Stars of the Northern Dipper shining brilliantly above your neck, their rays extending so that two stars appear before the Dipper’s handle, their radiance intermingling. Softly pray:\n\n*\"Eighth, the Imperial Star: Most High Jade Sovereign, Spirit of the Eight Effulgences, Primordial Lord. Ninth, the Venerable Star: Jade Sovereign of the Great Tenuity, Spirit of the Seven Dawns of the Primordial Simplicity.\"*\n\nInvoke them nine times, then pray:\n\n*\"May the sins and transgressions of my nine generations of ancestors, down to my own person—all the great and small offenses committed against hills, mountains, rivers, and streams, those inscribed in the registers of the dead, the hidden malevolence, concealed treachery, and myriad deceptions recorded in the Ghost Bureau of Mount Feng—along with the capital crimes listed in the black ledgers of the Nine Primes of the Great Ultimate before the Northern Emperor, beseech the Most High Jade Sovereign of the Nine Primes to dissolve them all. May I soar through the Seven Paths, ascend to the Jade Clarity, and wander the Great Void. May I ride the luminous chariot of dawn’s birth, feast in the Eight Simplicities of the north, and rival the sun in splendor. May I join the celestial assembly, command the ten thousand spirits, and govern the myriad numina.\"*\n\nThis done, visualize the Seven Stars of the Northern Dipper descending from the heavens and entering the Purple Chamber of the Muddy Pellet, their radiance illuminating it so that light suffuses the entire body and the five viscera, both within and without, generating clouds of purple qi that billow densely. Hold this vision steadfastly. This done, swallow saliva fifty-four times.",
      "overlap_context": "seven times, then pray:\n\n*\"May the inner and outer defilements and transgressions of my seven generations past, down to my own person—myriad errors recorded in the Dark Pass—all be dissolved. May my body fill the Yellow Court, stabilizing the stomach’s center. May I ascend to the Great Simplicity, ride the luminous chariot to the Purple Palace, with Jade Maidens attending on the right and Jade Lads on the left. May I share the radiance of the sun and moon, and be enthroned as a Perfected King.\"*",
      "start_char": 1238,
      "end_char": 2103,
      "start_sentence": 35,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.906644582748413,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上回元隐道除罪籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若六甲日及月晦日、六丁日，存思相彷近者，自可以次调适，筹量修之，不必使频仍相切近也。 每事效此，唯令全备於真法也。 於是太上回元谢罪之道毕矣。 太上藏五通日，封于五岳之玉笥。 隐回元之道，隐於九晨之宫。 既修五通，当行回元，五通开於帝始，回元关於玄终。 故修五通，行七元回隐道者，不食血腥荤物，见诸尸秽，犯者受太玄考。 五通者，太上之吉日； 回元者，太上之更新日也。 不知五通，不得解罪除过； 不知回元隐道，不得列名上真。 常以其日思存吉事，首谢身中罪过，所谓解适七世，离脱刑名者也。 不以示九宫中仙矣。 诸修洞房紫房中事，及存九元七元者，眠初起初卧时，及临食食毕，先微祝曰： 五星五通，六合紫房，回元隐道，豁落七晨，生魂者玄父，父变一成神； 生魄者玄母，母化二生身，摄吾筋骨者公子，为吾精气者白元，长生久视，飞仙十天。 毕，勿令耳闻祝音。 此太上隐祝，以除邪气，致精神，使人终身不厌昧也。 上清太上回元隐道除罪籍经竟 #1『罪』字原本作『罗』，据《洞房上经》改。 #2『九君』原本作『九宫』，据前后文改。",
      "translated_text": "Should the days of the six jia or six ding, or the last day of the lunar month, find one’s meditative focus nearing completion, one may then proceed with gradual refinement, weighing and cultivating the practice without undue frequency or intensity. In all matters, follow this example, ensuring the true method remains wholly intact.\n\nHerein concludes the Dao of the Most High’s Return to the Origin and Atonement for Transgressions.\n\nThe Most High sealed the Five Penetrations on the Five Marchmounts’ jade caskets. The Dao of Returning to the Origin was concealed within the Palace of the Nine Dawns. Having cultivated the Five Penetrations, one must practice the Return to the Origin: the Five Penetrations open at the Sovereign’s Beginning, while the Return to the Origin is bound to the Mysterious End. Thus, those who cultivate the Five Penetrations and traverse the Seven Primes’ Hidden Dao of Return must abstain from blood, raw flesh, and pungent foods. Should one encounter corpses or impurities and transgress, they shall face the Great Mysterious Judgment.\n\nThe Five Penetrations are the Most High’s auspicious days; the Return to the Origin, the Most High’s days of renewal. Without knowledge of the Five Penetrations, one cannot dissolve transgressions or erase faults; without knowledge of the Return to the Origin’s Hidden Dao, one cannot be enrolled among the Perfected of the Upper Realms. On these days, one should meditate upon auspicious matters, first atoning for the transgressions within one’s body—thereby untying the knots of seven generations and escaping the bonds of punishment and fate. Only then may one be revealed to the immortals of the Nine Palaces.\n\nFor all who cultivate the affairs of the Cavern Chamber and Purple Chamber, or visualize the Nine Primes and Seven Primes, at the onset of sleep or upon first lying down, and before and after meals, first offer this subtle invocation:\n\n*\"Five Stars, Five Penetrations,\nSix Harmonies, Purple Chamber,\nReturn to the Origin, Hidden Dao,\nVast and Lofty Seven Dawns.\nThe soul’s begetter is the Mysterious Father—\nthe Father transforms into the One, becoming spirit.\nThe spirit’s begetter is the Mysterious Mother—\nthe Mother transforms into the Two, giving birth to the body.\nThe Lord Son gathers my sinews and bones;\nWhite Prime governs my essence and qi.\nLong life and enduring vision,\nsoaring as an immortal through the Ten Heavens.\"*\n\nThis done, ensure no ear hears the sound of the invocation. This is the Most High’s Hidden Invocation, for dispelling pernicious qi, summoning spirit and essence, and ensuring one remains untroubled by obscurity throughout life.\n\nHere ends the *Upper Clarity Scripture of the Most High’s Hidden Dao of Returning to the Origin for Erasing the Registers of Transgressions*.",
      "overlap_context": "n in splendor. May I join the celestial assembly, command the ten thousand spirits, and govern the myriad numina.\"*\n\nThis done, visualize the Seven Stars of the Northern Dipper descending from the heavens and entering the Purple Chamber of the Muddy Pellet, their radiance illuminating it so that light suffuses the entire body and the five viscera, both within and without, generating clouds of purple qi that billow densely. Hold this vision steadfastly. This done, swallow saliva fifty-four times.",
      "start_char": 2104,
      "end_char": 2554,
      "start_sentence": 54,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.139003038406372,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上回元隐道除罪籍经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}