{
  "source_id": "上清金书玉字上经",
  "source_file": "chunked_daozang\\上清金书玉字上经.json",
  "total_chunks": 3,
  "total_original_chars": 3021,
  "total_translated_chars": 18950,
  "total_translation_time": 97.30161762237549,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\上清金书玉字上经.txt",
    "category": "方法类"
  },
  "full_translation": "**The Supreme Clarity Scripture of Golden Writ and Jade Characters**\n\n**Scripture Title:** *The Supreme Clarity Scripture of Golden Writ and Jade Characters*. Also known as *The Golden Writ and Jade Characters Scripture of the Grotto Chamber*.\n\nAuthor unknown, approximately dating to the Eastern Jin and Northern and Southern Dynasties. It is said to be the scripture of the Supreme Clarity Purple Essence Lord and the August Primordial Purple Void Lord, transmitted by the Minister of the Left, the Azure Lad. It expounds the method of visualizing the nine stars of the Northern Dipper and the deities of the Grotto Chamber. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Compendium of Perfected Reality*.\n\n---\n\n**The Supreme Clarity Scripture of Golden Writ and Jade Characters**\n*Transmitted by the Azure Lad of the Square Cauldron Palace*\n\nVisualize the true stars above your head while contemplating the deities of the Grotto Chamber. Let your right toe point to the Emperor Star and your left toe to the Venerable Star. When settling into visualization, slightly bend your left foot to align with the star. Grasp the Northern Terrace with your left hand and hold the Pivot Root with your right. Silently recite the incantation, then lie within the Northern Dipper. Practicing this for nine years eliminates death and ascends to life, and your name is inscribed in the Square Cauldron Prefecture. Practicing for eighteen years, the Nine Essences descend, and cloud chariots appear to welcome you.\n\nThe Pivot Root is the essence-name of the Pivot Star. The Northern Terrace is the essence-name of the Origin Star. Resting within the Nine Stars of the Dipper, with the heart’s aspiration to become a flying immortal and ascend to the Realized, you are sheltered beneath the Florid Canopy, ascending by cloud at dawn.\n\nThe following twenty-four characters were inscribed by the Most High on the eastern wall of the Jade Chamber of Mount Emei. The script is ancient and indecipherable; it is now revealed here.\n\nThe Azure Lad said: When constructing the Grotto Chamber, the face should have three yang aspects, with the two *si* (巳) positions intersecting. The nose is the Celestial Mountain; gaze upward toward the Bright Hall. The Spirit Pass is the Purple Gate, through which the Grotto Chamber is seen—square and circular, walls standing upright, one *cun* in perfect measure. Quietly visualize the essence of the Dipper, allowing it to settle within. It illuminates and shelters the Red Child and the Three Kings of No-Flower, thereby achieving flight as an immortal. Mounting the dark dragon-drawn carriage, you ascend to the Florid Dawn, commanding jade maidens and jade lads. The essential Dao is complete—practice it in secrecy.\n\nThe Azure Canopy Purple Lad of the Square Cauldron Palace, having first practiced the Grotto Chamber method, reposed in the Florid Dawn, rising and resting within the Nine Essences, binding the hun and po souls to the Northern Dipper. Thus, he is titled the True Person Within the Dipper.\n\nFormer masters received *The Grotto Chamber Scripture* from the Supreme Clarity Purple Essence Lord and the August Primordial Purple Void Lord. The Azure Spirit Yang Peace Lord transmitted it to the Central Yellow Venerable Lord, and the Three Heavens Supreme Unity Origin Lord, who then established the Supreme Mystery Master’s Immortal Prefecture. They ordained the Golden Writ and inscribed the Jade Characters, naming it *The Grotto Chamber Scripture*. The Jade Sovereign entrusted it to the later sages, Lords Li and Peng, to bestow upon those whose bone destiny aligned with immortality. Practicing it, their names were listed in the Origin Register, death was eradicated, and life was transcended. They flew as divine immortals, appointed as ministers to the later sages, Lords Li and Peng.\n\nThereupon, the two lords presented one copy of the *Golden Writ Grotto Chamber Scripture* to the perfected immortals of the Western Mystery Palace and the Terrace of the Square Cauldron, to transmit to those destined to achieve immortality in the future. They also presented one copy of the *Jade Characters Grotto Chamber Scripture* to the Square Cauldron Palace and the Immortal Capital Prefecture of the Dark Continent, to instruct those whose predestined bone names aligned with the Dao.\n\nThe two later sage lords rode the chariot of the Great Void, drifting through the gates of the Ten Heavens and Nine Grottoes. When the appointed time arrives, they will govern as emperors, administering the true offices of the Spirit Terrace and teaching the multitudes in the era of Great Peace.\n\nThe two lords, perceiving the past and examining the paths of the myriad destinies, soar through the empty mystery, discerning who among the Dao-seeking scholars may succeed or fail. If one’s heart is sincere and will resolute, steadfastly yearning for the divine and true, unwavering throughout the year, with a spirit unshaken, and if the numinous mirror reveals a bone form already inscribed in the Jade Record of Immortal Names, then the two lords will concur, and only then may one obtain this scripture.\n\nThose who receive and practice this scripture have a predestined bone destiny, and their names have already been recorded in the Register of the Mysterious Pavilion, ensuring life and eradicating death. The two later sage lords often conceal their traces and hide their true form, never transmitting it themselves. They allow karmic conditions to guide the way, enabling those who encounter it to obtain this divine scripture.\n\nSome copies may emerge among the common or the impure, but though such people may possess this scripture, they do not practice it. Thus, they are merely used as agents of the hidden teachings. Therefore, those whose bone destiny aligns with immortality and who obtain this scripture often do so through past causes, leading them to acquire it. Some may encounter true immortals who, having fulfilled their allotted time and reached the year of transmission, carefully examine their bone form before bestowing it upon them.\n\nYou must diligently aspire to flight as an immortal, reciting the incantation in your heart whether sitting or rising. Practicing over time, you will naturally obtain this scripture. Do not dismiss it because it emerged from humble origins, nor scorn its text or belittle its transmission. All of this is the mysterious mandate of the later sages, secretly arranged and precisely aligned with those destined for the Dao—hence its bestowal upon you.\n\nWhat we now revere and uphold is in accordance with the intent of the two lords, thus we respect even the humble. Just as in the world, those who honor their teachers and ancestors do so with reverence, though their teachers may not all be lofty sages. It is the distant veneration of their root and heart.\n\nSeclude yourself for seven days before receiving this scripture. Practice with strict discipline, upholding and following it. Do not mingle with the impure or the defiled. Practice in secrecy, ensuring no one perceives it. Outwardly, conform to the world; inwardly, be radiant and discerning. Only then may you be spoken to of the affairs of the Grotto Chamber.\n\nThis is the essential secret of the True Mother of Tortoise Mountain, commanded by the Lord of the Western City.\n\nThe twenty-eight constellations are suspended above the Florid Dawn, governing the deities of the four directions. According to the statutes of the Four Poles and Four Perfected, and the covenant of the *Supreme Clarity Golden Writ and Jade Characters of the Grotto Chamber*, one must swear an oath upon torn silk, pledging not to recklessly divulge it.\n\nUpon receiving this scripture, present thirty-two feet of azure silk to the one who bestows it. The number eight corresponds to each of the four directions, totaling thirty-two feet. The recipient of the scripture shall then divide the silk to offer to their master, as per the oral instructions.\n\nIf one first receives this from a true immortal whose traces are utterly untraceable, then the portion of silk to be divided cannot be delivered, and what one receives becomes an offering dispersed to meet the needs of the Dao. It must not be used for miscellaneous external offerings.\n\nThe August Sovereign’s covenant employs gold and azure tablets—what is called the \"alliance azure silk.\" The *Nine White Scriptures* state: \"When you receive the gold and azure, your name has already been inscribed above. Guard it carefully and do not scatter it elsewhere in pursuit of wealth or glory. This is its meaning.\"\n\nProcure this gold silk with only the finest quality; do not carelessly combine it merely to fulfill an obligation. The Mysterious Center will also examine your sincerity.\n\nAll these are the scriptures of the Most High, each with fixed statutes. Initially, one may transmit it once every hundred years; within seven hundred years, it may be transmitted three times. Beyond this, it may not be further disseminated. If transmitted to an unworthy recipient or recklessly bestowed beyond the limit, it constitutes a breach of secrecy. For such a breach, one’s grandparents and parents will be examined by the Three Officials, and upon death, the offender will suffer celestial punishment and become a lowly ghost.\n\nThe Lord of the Western City states: \"If within a hundred years there are two worthy recipients, transmission may be permitted, but the oath must still adhere to the three transmissions within seven hundred years.\"\n\nThe Dipper stars are the purple canopy of the Great Ultimate, the numinous grove of the Mysterious Perfected, the divine seat of the Nine August Ones, and the banquet chamber of the Heavenly Worthy. By practicing this Dao, one’s position becomes that of an immortal patriarch, riding the eight-scened dragon to ascend to the Grand Tenuity, entering and exiting the Purple Court, resting in the Northern Dipper, soaring through the Grotto Passes, gazing upon the Mysterious Canopy, inhaling the Florid Dawn, and mounting the flowing radiance to reach the Three Mysteries, entering and exiting the Purple Chamber, roaming the Great Primordium. One’s name is inscribed in the Golden Pavilion, and one is ranked among the Perfected.\n\nAt night before sleeping, first visualize the Dipper stars above your bed, drawing their image and contemplating them as described above. Let your head align with the Nine Ultimates, allowing true qi to enter the Mud Pill, and your feet tread upon the two stars of the August Emperor. Constantly focus your mind on ascending as an immortal, so that the Lofty One restrains your seven po, and the Grand Tenuity governs your three hun. Grasp the Northern Terrace with your left hand and hold the Pivot Root with your right.\n\nAfter practicing this for eighteen years, your complexion will revert to that of an infant. One day, the essence of the nine stars will suddenly transform into the Nine Elder Lords of the Supreme Emperor, all descending together to welcome you with dark radiance and flying dragons. They will present you with the true bell, riding the eight-chariot jade carriage adorned with purple feathers and a florid canopy, led by immortal officials. Before you, phoenixes will cry; behind you, celestial hooks will sound. Clad in emerald robes and azure sashes, you will ascend at dawn, attended by jade lads and jade maidens bearing your towels.\n\nBefore sleeping each night, secretly knock your teeth thirty-seven times and swallow saliva thirty-seven times, then silently pray: \"Nine stars of great essence, True Lord of the Northern Culmen, augment my vital embryo, strengthen my three hun. Draw the sun’s splendor from the left, restrain the moon’s essence from the right. The Yellow Radiance of the central dawn, the Yellow Perfected of the Primordial Void—enable me to ascend as an immortal, to mount the purple mist. May the divine tiger and jade talisman ever guard my Gate of Life. May the myriad evils submit to the law, and may I receive refinement from the Lord of the Dipper.\"\n\nAt dawn upon rising, secretly knock your teeth twenty-seven times and swallow saliva twenty-seven times, then silently pray: \"Primordial One of Heaven, seven youths within the Dipper, purple essence of the Upper Clarity, dwelling within my body. Florid Dawn and purple canopy, Mysterious Palace of the Great Simplicity. The numinous qi of the Later Sage descends into the Grotto Chamber—enable me to ascend as an immortal, to traverse the Golden Hall of the Great Ultimate.\"\n\nWhen first visualizing the stars at night, always silently recite their names before contemplating them. The prayer is as follows:\n\n\"First, the essence of the Great Star, named Mysterious Pivot: May I ascend as an immortal, riding the void and steering the floating.\nSecond, the essence of the Origin Star, named Northern Terrace: May I ascend as an immortal, roaming the Terrace of the Grotto.\nThird, the essence of the True Star, named Nine Ultimates of the Upper Perfected: May I ascend as an immortal, governing the Three Mysteries.\nFourth, the essence of the Pivot Star, named Pivot Root: May my jade name be ranked among the flying immortals.\nFifth, the essence of the Network Star, named Celestial Balance: May I ascend as an immortal, ascending to the Upper Clarity.\nSixth, the essence of the Chronicle Star, named Life Mechanism: May I ascend as an immortal, my name inscribed in the Grand Tenuity.\nSeventh, the essence of the Pass Star, named Mysterious Yang: May I ascend as an immortal, commanding jade lads.\nEighth, the essence of the Emperor Star, named Lofty Jade Sovereign: May I ascend as an immortal, entering the hall of the Later Sage.\nNinth, the essence of the August Star, named Emperor Lord of the Grand Tenuity: May I ascend as an immortal, entering the cinnabar-jade chamber.\"\n\nAfter reciting these nine invocations in order, then visualize the stars and rest within the Dipper. Then again silently knock your teeth, swallow saliva, and pray to the nine stars of great essence and the True Lord of the Northern Culmen as described above.\n\nOnce all visualizations and prayers are complete, after a long while, visualize the essence of the Dipper stars suddenly entering the Grotto Chamber, illuminating your entire body, penetrating the five viscera. The three barriers and hundred joints all glow with crimson radiance. Pray: \"Primordial essence of the Grotto Chamber, Great Worthy of the Red Child, Florid Canopy of the Dipper’s light, come illuminate the Mud Pill. Refine my bones and blood, restrain my po and govern my hun. Enable me to ascend as an immortal, riding the clouds to the dawn, ascending to pay court to the Jade Emperor and the Primordial Lord of the Great One.\"\n\nWhen this is complete, the external image of the Dipper stars merely divides its essence to enter the Mud Pill—it does not mean moving from one place to another. Thus, both the bed and the head contain them.\n\nThe Azure Lad states: \"Sleeping with the yin essence of the Northern Dipper brings the immortal’s numen; the Grotto Chamber’s reception of the Northern Dipper’s yang essence causes the five viscera to generate spontaneously, enabling one to ride the radiance and roam the Upper Clarity.\" According to the Azure Lad’s words, the Northern Dipper possesses both yin and yang spirits—perhaps also an analogy for the two essences of human hun and po.\n\nThe stars of the Northern Dipper cover the Florid Dawn, their essence radiating nine paths, their light shading the ten heavens. The yang revolves nine nines, hence its lofty reverence. Mortals see only seven stars and not the other two. The eighth and ninth are the spirits of the August Emperor and the Great August One, hidden within the Mysterious Mirror, preserving and governing the celestial hun. Their numinous light blazes brilliantly, serving as the anchor for these seven stars, yet they do not shine upon those of the worldly realm who pursue glory and fame.\n\nThe perfected Daoist immortals, exalted transcendents, and the officials of the Upper Clarity and Great Clarity may behold them, yet even upon seeing, they must not speak of it recklessly. After witnessing them, the Most High Jade Emperor and the Imperial Lord of the Grand Tenuity shall come to you and confer upon you a true office. Among worldly folk who carelessly glimpse them, there are those who mistakenly see these two stars—those who see must take care never to speak of it.\n\nThe *Divine Records of the Most High* states: Whoever sees one of the high stars of the Northern Dipper in the Grand Tenuity gains three hundred years added to their lifespan; seeing both grants six hundred years. Yet common people, steeped in impurity, seldom merit the descent of these two august ones. These stars surpass the seven in size, their radiance suffused with purple splendor, unlike ordinary stars—resplendent and awe-inspiring. Those who see them must bow in reverence, kowtow, and make their entreaties. Always on the third and twenty-seventh nights of the lunar month, secretly await them, letting no one know. With sincere devotion over time, none shall fail to see them. The stars possess three essences, hence the use of the twenty-seventh day.\n\nBy the Most High’s law, those who recklessly reveal the names of the numinous essences or disclose what they have seen shall suffer bodily harm by blade and fire, meet sudden torment in the earth-prison hells, and implicate their parents in life and death, incurring the wrath of the Three Officials. In the Qin era, Xu Fu was but a common man when he first glimpsed the two stars; he dared not speak of it and thus gained extended years. Only then did he come to believe in the existence of immortals and turn to the study of the Dao. Han Zhong, Sima Jizhu, the Perfected Mencius Zhuo of Mount Song, Zhang Jujun, and Yin Gui—all these, too, were among those who beheld them.\n\nDuring the Han dynasty, Huo Guang, the Chancellor, had a slave in charge of his wardrobe named Huanche, who was somewhat literate. Once, he saw among Huo Guang’s solemn preparations a short scroll that read: *\"Always on the third and twenty-seventh nights of the lunar month, secretly await the Northern Dipper. Do this repeatedly, and you shall see something. Upon seeing, bow; after bowing and making your entreaties, do not speak of it—all shall gain three hundred years.\"* Huanche committed this to memory and tested it not once but many times. One night, he suddenly saw the two stars above the Dipper, their light extraordinary. He bowed and departed, and thus gained six hundred years. Yet this slave, though possessing some intent, lacked great aspiration; he did not study the Dao but merely prolonged his years until death.\n\nThis account comes from Lord Wang, who transmitted it to the Great Lord Mao. Here ends the *Upper Scripture of the Golden Book and Jade Characters of the Upper Clarity*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清金书玉字上经 经名：上清金书玉字上经。 又名《金书玉字洞房上经》。 撰人不详，约出於东晋南北朝。 据称乃上清紫精君、皇初紫虚君之经，上相青童君传授。 内言存思北斗九星及洞房神君之法。 一卷。 底本出处：《正统道藏》洞真部方法类。 上清金书玉字上经 方诸官青童君传 头上真星，兼思洞房神，右足指帝星，左足指尊星，临存时小屈左足，以对於星也。 左手把北台，右手执璇根，密存祝讫，而卧北斗中也。 行之九年，除死上生，名刻方诸府。 行之十八年，九精来下，云车见迎。 璇根，纽星之精名也。 北台，元星之精名也。 卧息九斗之内，心愿飞仙上真，荫庇华盖之下，白日乘云登晨。 右二十四字，太上刻峨嵋玉房东壁，字文本古文，不可解，今出之。 青童有言：作洞房，面有三阳，两巳纵横，鼻为天山，仰望明堂，神关紫户，遂见洞房，方圆璧立，一寸正方，静存斗精，来安其中，照荫赤子，无英三王，乃成飞仙，乘玄驾龙，上造华辰，驱使玉女玉童，要道毕矣，密奉密行。 方诸宫青盖紫童，始昔施行洞房，偃息华辰，卧起九精之内，拘魂魄於北斗上，是以号斗中真人也。 先师往受上清紫精君、皇初紫虚君《洞房上经》，青灵阳安君以传中央黄老君，三天太一元君，即造太玄主仙府，使定金书，刻玉字，名曰洞房上经。 玉皇以付后圣李、彭二君，使与骨命应得仙者，按而行之，列名元图，刻生除死，飞行神仙，谒为后君之官，以佐来圣李、彭二君。 於是二君以金书洞房经一通，付西玄宫洞台内诸得道真人，以传授当来成仙者。 於是二君以玉字洞房经一通，付方诸官及玄洲仙都府，使教宿命骨名当得道者。 后圣二君乘太虚之舆，浮游十天九洞之门，须期运告会，乃治为帝，理真官於神台，教种人於太平。 二君皆逆已察陌万兆宿命善恶，飞揽虚玄，知学仙道士可成与难。 若心诚志专，固慕神真者，终年惓惓，情无倾动，灵鉴形骨，已有仙名玉录者，然后二君意同，於是子乃得此书。 得书行者，骨命已定，玄阁录已有生名仙籍故也。 后圣二君，常藏影匿端，初不自传，但使因缘致往，令彼其於遭值，得此神经耳。 或书出凡庸，或出於俗浊之人，此辈虽有此经，而不行也，所以为人受阴教而使役也。 故骨命有仙分得书者，多由历因，致以获於此。 或遇真仙之人，先受书期尽，应出传之年，已审视形骨，乃有授子者。 子其懃念飞仙，坐起祝之於心，行之久久，子自得此经。 子不可谓书出非所卑贱之间，而蔑其文，轻其授矣。 此皆是后圣之玄命，阴已处分，应得道之审，故与於子也。 今所宗奉，所以承二君之意，故敬及卑贱也。 亦如世问师主宗者，皆致恭敬，师主岂尽高贤哉，盖远宗其根心耳。 静斋七日，乃受此经，修行谨戒，奉而按之，不得杂处秽俗殗乱之人，密而行，使不觉，外同俗，内镜灼，如是始可与言洞房之事也。 此龟山真母要诀，以勅西城王君。 二十八宿仰系於华辰，管运于四方之神。 按四极四真之科法，太上洞房金书玉字之信，皆当立裂缯之誓，为不妄泄之约也。 受得此经，以青锦之帛三十二尺，以奉有书者。 四方之数各八，合三十二尺也。 有书得此帛，又分以师，如口诀。",
      "translated_text": "**The Supreme Clarity Scripture of Golden Writ and Jade Characters**\n\n**Scripture Title:** *The Supreme Clarity Scripture of Golden Writ and Jade Characters*. Also known as *The Golden Writ and Jade Characters Scripture of the Grotto Chamber*.\n\nAuthor unknown, approximately dating to the Eastern Jin and Northern and Southern Dynasties. It is said to be the scripture of the Supreme Clarity Purple Essence Lord and the August Primordial Purple Void Lord, transmitted by the Minister of the Left, the Azure Lad. It expounds the method of visualizing the nine stars of the Northern Dipper and the deities of the Grotto Chamber. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Compendium of Perfected Reality*.\n\n---\n\n**The Supreme Clarity Scripture of Golden Writ and Jade Characters**\n*Transmitted by the Azure Lad of the Square Cauldron Palace*\n\nVisualize the true stars above your head while contemplating the deities of the Grotto Chamber. Let your right toe point to the Emperor Star and your left toe to the Venerable Star. When settling into visualization, slightly bend your left foot to align with the star. Grasp the Northern Terrace with your left hand and hold the Pivot Root with your right. Silently recite the incantation, then lie within the Northern Dipper. Practicing this for nine years eliminates death and ascends to life, and your name is inscribed in the Square Cauldron Prefecture. Practicing for eighteen years, the Nine Essences descend, and cloud chariots appear to welcome you.\n\nThe Pivot Root is the essence-name of the Pivot Star. The Northern Terrace is the essence-name of the Origin Star. Resting within the Nine Stars of the Dipper, with the heart’s aspiration to become a flying immortal and ascend to the Realized, you are sheltered beneath the Florid Canopy, ascending by cloud at dawn.\n\nThe following twenty-four characters were inscribed by the Most High on the eastern wall of the Jade Chamber of Mount Emei. The script is ancient and indecipherable; it is now revealed here.\n\nThe Azure Lad said: When constructing the Grotto Chamber, the face should have three yang aspects, with the two *si* (巳) positions intersecting. The nose is the Celestial Mountain; gaze upward toward the Bright Hall. The Spirit Pass is the Purple Gate, through which the Grotto Chamber is seen—square and circular, walls standing upright, one *cun* in perfect measure. Quietly visualize the essence of the Dipper, allowing it to settle within. It illuminates and shelters the Red Child and the Three Kings of No-Flower, thereby achieving flight as an immortal. Mounting the dark dragon-drawn carriage, you ascend to the Florid Dawn, commanding jade maidens and jade lads. The essential Dao is complete—practice it in secrecy.\n\nThe Azure Canopy Purple Lad of the Square Cauldron Palace, having first practiced the Grotto Chamber method, reposed in the Florid Dawn, rising and resting within the Nine Essences, binding the hun and po souls to the Northern Dipper. Thus, he is titled the True Person Within the Dipper.\n\nFormer masters received *The Grotto Chamber Scripture* from the Supreme Clarity Purple Essence Lord and the August Primordial Purple Void Lord. The Azure Spirit Yang Peace Lord transmitted it to the Central Yellow Venerable Lord, and the Three Heavens Supreme Unity Origin Lord, who then established the Supreme Mystery Master’s Immortal Prefecture. They ordained the Golden Writ and inscribed the Jade Characters, naming it *The Grotto Chamber Scripture*. The Jade Sovereign entrusted it to the later sages, Lords Li and Peng, to bestow upon those whose bone destiny aligned with immortality. Practicing it, their names were listed in the Origin Register, death was eradicated, and life was transcended. They flew as divine immortals, appointed as ministers to the later sages, Lords Li and Peng.\n\nThereupon, the two lords presented one copy of the *Golden Writ Grotto Chamber Scripture* to the perfected immortals of the Western Mystery Palace and the Terrace of the Square Cauldron, to transmit to those destined to achieve immortality in the future. They also presented one copy of the *Jade Characters Grotto Chamber Scripture* to the Square Cauldron Palace and the Immortal Capital Prefecture of the Dark Continent, to instruct those whose predestined bone names aligned with the Dao.\n\nThe two later sage lords rode the chariot of the Great Void, drifting through the gates of the Ten Heavens and Nine Grottoes. When the appointed time arrives, they will govern as emperors, administering the true offices of the Spirit Terrace and teaching the multitudes in the era of Great Peace.\n\nThe two lords, perceiving the past and examining the paths of the myriad destinies, soar through the empty mystery, discerning who among the Dao-seeking scholars may succeed or fail. If one’s heart is sincere and will resolute, steadfastly yearning for the divine and true, unwavering throughout the year, with a spirit unshaken, and if the numinous mirror reveals a bone form already inscribed in the Jade Record of Immortal Names, then the two lords will concur, and only then may one obtain this scripture.\n\nThose who receive and practice this scripture have a predestined bone destiny, and their names have already been recorded in the Register of the Mysterious Pavilion, ensuring life and eradicating death. The two later sage lords often conceal their traces and hide their true form, never transmitting it themselves. They allow karmic conditions to guide the way, enabling those who encounter it to obtain this divine scripture.\n\nSome copies may emerge among the common or the impure, but though such people may possess this scripture, they do not practice it. Thus, they are merely used as agents of the hidden teachings. Therefore, those whose bone destiny aligns with immortality and who obtain this scripture often do so through past causes, leading them to acquire it. Some may encounter true immortals who, having fulfilled their allotted time and reached the year of transmission, carefully examine their bone form before bestowing it upon them.\n\nYou must diligently aspire to flight as an immortal, reciting the incantation in your heart whether sitting or rising. Practicing over time, you will naturally obtain this scripture. Do not dismiss it because it emerged from humble origins, nor scorn its text or belittle its transmission. All of this is the mysterious mandate of the later sages, secretly arranged and precisely aligned with those destined for the Dao—hence its bestowal upon you.\n\nWhat we now revere and uphold is in accordance with the intent of the two lords, thus we respect even the humble. Just as in the world, those who honor their teachers and ancestors do so with reverence, though their teachers may not all be lofty sages. It is the distant veneration of their root and heart.\n\nSeclude yourself for seven days before receiving this scripture. Practice with strict discipline, upholding and following it. Do not mingle with the impure or the defiled. Practice in secrecy, ensuring no one perceives it. Outwardly, conform to the world; inwardly, be radiant and discerning. Only then may you be spoken to of the affairs of the Grotto Chamber.\n\nThis is the essential secret of the True Mother of Tortoise Mountain, commanded by the Lord of the Western City.\n\nThe twenty-eight constellations are suspended above the Florid Dawn, governing the deities of the four directions. According to the statutes of the Four Poles and Four Perfected, and the covenant of the *Supreme Clarity Golden Writ and Jade Characters of the Grotto Chamber*, one must swear an oath upon torn silk, pledging not to recklessly divulge it.\n\nUpon receiving this scripture, present thirty-two feet of azure silk to the one who bestows it. The number eight corresponds to each of the four directions, totaling thirty-two feet. The recipient of the scripture shall then divide the silk to offer to their master, as per the oral instructions.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1235,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.219773054122925,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上清金书玉字上经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若先受之於真仙，迹绝无踪者，则所分无由而致，受之乃为施散，供道用可须者。 又不得以外供杂碎。 上皇告盟，重用金青札，所谓盟青帛也。 九素经曰：子受金青，上已刻名，慎无他散，以求富荣。 斯其义也。 市此金帛，每令上好者，不可苟合以解责，玄中亦当审子情状矣。 此皆太上之书，皆有定科。 初听一百年得一传，七百年中得三传，过此不得复出。 传非其人，过限妄授，皆为泄闭。 泄闭，其祖父母以下受考三官，身死天刑，乃为下鬼。 王君云：百年之内有二人可授者，亦听，要以七百年内三传为誓。 斗星者，太极之紫盖，玄真之灵林，九皇之神席，天尊之宴房也。 子行其道，位为仙宗，得飞八景之龙，上造太微，出入紫庭，宴息北斗，飞旋洞关，俯仰玄盖，呼吸华辰，得乘流景，以造三玄，出入紫房，遨游太元，名上金阁，列为真人。 暮卧，先存斗星在所卧席上，令画像按而存之，如上法。 令我头首九极，使真气入於泥丸，足蹑尊帝二星，常心念飞仙，令高上拘我七魄，太微制我三魂，左手把北台，右手执璇根。 行之十八年，必色反婴颜。 一旦忽有九星之精，变成上帝九老之公，并俱来下迎以玄景飞龙，要以真铃，乘八舆琼输紫羽华盖，导以仙官，前啸凤呜，后作天钧，翠衣青带，白日登晨，玉童玉女。 乃为执巾。 暮卧，常密三七叩齿，咽液三七，阴祝曰：九星太精，北极真君，益我精胎，强我三魂，左引日华，右拘月津，辰中黄景，元虚黄真，使我飞仙，上登紫烟，神虎玉符，常守生门，万邪伏法，受炼斗君。 平旦欲起，常密二七叩齿，咽液二七，阴祝曰：天元上一，斗中七童，上清紫精，在兆身中，华辰紫盖，太素玄宫，后圣灵气，下入洞房，使我飞仙，得行太极金堂。 暮始外存星之时，皆先阴祝星名，然后存星耳。 祝曰： 第一太星精，名玄枢，愿某飞仙，乘虚驾浮。 第二元星精，名北台，愿某飞仙，游行洞台。 第三真星精，名九极上真，愿某飞仙，得治三玄。 第四纽星精，名璇根，愿某玉名，列为飞仙。 第五纲星精，名天平，愿某飞仙，登行上清。 第六纪星精，名命机，愿某飞仙，名书太微。 第七关星精，名玄阳，愿某飞仙，得使玉童。 第八帝星精，名高上玉皇，愿某飞仙，得登后圣之堂。 第九尊星精，名太微帝君，愿某飞仙，得入丹瑶玉房。 右九条，以次祝毕，乃存星而安卧斗中也。 然后又密叩齿咽液，祝九星太精，北极真君之说也。 所存所祝都毕，良久，乃存斗星之精，忽然入洞房之中，光照一身，洞彻五内，三关百节，皆令赤光赫然，祝曰：洞房元精，赤子太尊，斗光华盖，来照泥丸，保炼骨血，拘魄制魂，使某飞仙，乘云登晨，上朝玉帝，太一元君。 都毕也。 所外斗星之像，但分精入於泥丸耳，非又去此适彼之意也。 是为席上、头中两处皆有耳。 青童君曰：卧北斗阴精，致仙使灵，洞房致北斗阳精，使五藏自生，遂得乘景，游行上清。 如青童君之辞，北斗有阴阳二精神也。 恐亦喻人之有魂魄二精矣。 北斗之星，覆盖华辰，精辉九道，光荫十天，阳转九九，所以高尊，世人唯见七星，而不见其二，其第八、第九，皆是帝皇太尊之精神，玄隐内镜，保制天魂，灵光炜灼，为此七星作镇，但不照於世间流俗荣名之人耳。",
      "translated_text": "If one first receives this from a true immortal whose traces are utterly untraceable, then the portion of silk to be divided cannot be delivered, and what one receives becomes an offering dispersed to meet the needs of the Dao. It must not be used for miscellaneous external offerings.\n\nThe August Sovereign’s covenant employs gold and azure tablets—what is called the \"alliance azure silk.\" The *Nine White Scriptures* state: \"When you receive the gold and azure, your name has already been inscribed above. Guard it carefully and do not scatter it elsewhere in pursuit of wealth or glory. This is its meaning.\"\n\nProcure this gold silk with only the finest quality; do not carelessly combine it merely to fulfill an obligation. The Mysterious Center will also examine your sincerity.\n\nAll these are the scriptures of the Most High, each with fixed statutes. Initially, one may transmit it once every hundred years; within seven hundred years, it may be transmitted three times. Beyond this, it may not be further disseminated. If transmitted to an unworthy recipient or recklessly bestowed beyond the limit, it constitutes a breach of secrecy. For such a breach, one’s grandparents and parents will be examined by the Three Officials, and upon death, the offender will suffer celestial punishment and become a lowly ghost.\n\nThe Lord of the Western City states: \"If within a hundred years there are two worthy recipients, transmission may be permitted, but the oath must still adhere to the three transmissions within seven hundred years.\"\n\nThe Dipper stars are the purple canopy of the Great Ultimate, the numinous grove of the Mysterious Perfected, the divine seat of the Nine August Ones, and the banquet chamber of the Heavenly Worthy. By practicing this Dao, one’s position becomes that of an immortal patriarch, riding the eight-scened dragon to ascend to the Grand Tenuity, entering and exiting the Purple Court, resting in the Northern Dipper, soaring through the Grotto Passes, gazing upon the Mysterious Canopy, inhaling the Florid Dawn, and mounting the flowing radiance to reach the Three Mysteries, entering and exiting the Purple Chamber, roaming the Great Primordium. One’s name is inscribed in the Golden Pavilion, and one is ranked among the Perfected.\n\nAt night before sleeping, first visualize the Dipper stars above your bed, drawing their image and contemplating them as described above. Let your head align with the Nine Ultimates, allowing true qi to enter the Mud Pill, and your feet tread upon the two stars of the August Emperor. Constantly focus your mind on ascending as an immortal, so that the Lofty One restrains your seven po, and the Grand Tenuity governs your three hun. Grasp the Northern Terrace with your left hand and hold the Pivot Root with your right.\n\nAfter practicing this for eighteen years, your complexion will revert to that of an infant. One day, the essence of the nine stars will suddenly transform into the Nine Elder Lords of the Supreme Emperor, all descending together to welcome you with dark radiance and flying dragons. They will present you with the true bell, riding the eight-chariot jade carriage adorned with purple feathers and a florid canopy, led by immortal officials. Before you, phoenixes will cry; behind you, celestial hooks will sound. Clad in emerald robes and azure sashes, you will ascend at dawn, attended by jade lads and jade maidens bearing your towels.\n\nBefore sleeping each night, secretly knock your teeth thirty-seven times and swallow saliva thirty-seven times, then silently pray: \"Nine stars of great essence, True Lord of the Northern Culmen, augment my vital embryo, strengthen my three hun. Draw the sun’s splendor from the left, restrain the moon’s essence from the right. The Yellow Radiance of the central dawn, the Yellow Perfected of the Primordial Void—enable me to ascend as an immortal, to mount the purple mist. May the divine tiger and jade talisman ever guard my Gate of Life. May the myriad evils submit to the law, and may I receive refinement from the Lord of the Dipper.\"\n\nAt dawn upon rising, secretly knock your teeth twenty-seven times and swallow saliva twenty-seven times, then silently pray: \"Primordial One of Heaven, seven youths within the Dipper, purple essence of the Upper Clarity, dwelling within my body. Florid Dawn and purple canopy, Mysterious Palace of the Great Simplicity. The numinous qi of the Later Sage descends into the Grotto Chamber—enable me to ascend as an immortal, to traverse the Golden Hall of the Great Ultimate.\"\n\nWhen first visualizing the stars at night, always silently recite their names before contemplating them. The prayer is as follows:\n\n\"First, the essence of the Great Star, named Mysterious Pivot: May I ascend as an immortal, riding the void and steering the floating.\nSecond, the essence of the Origin Star, named Northern Terrace: May I ascend as an immortal, roaming the Terrace of the Grotto.\nThird, the essence of the True Star, named Nine Ultimates of the Upper Perfected: May I ascend as an immortal, governing the Three Mysteries.\nFourth, the essence of the Pivot Star, named Pivot Root: May my jade name be ranked among the flying immortals.\nFifth, the essence of the Network Star, named Celestial Balance: May I ascend as an immortal, ascending to the Upper Clarity.\nSixth, the essence of the Chronicle Star, named Life Mechanism: May I ascend as an immortal, my name inscribed in the Grand Tenuity.\nSeventh, the essence of the Pass Star, named Mysterious Yang: May I ascend as an immortal, commanding jade lads.\nEighth, the essence of the Emperor Star, named Lofty Jade Sovereign: May I ascend as an immortal, entering the hall of the Later Sage.\nNinth, the essence of the August Star, named Emperor Lord of the Grand Tenuity: May I ascend as an immortal, entering the cinnabar-jade chamber.\"\n\nAfter reciting these nine invocations in order, then visualize the stars and rest within the Dipper. Then again silently knock your teeth, swallow saliva, and pray to the nine stars of great essence and the True Lord of the Northern Culmen as described above.\n\nOnce all visualizations and prayers are complete, after a long while, visualize the essence of the Dipper stars suddenly entering the Grotto Chamber, illuminating your entire body, penetrating the five viscera. The three barriers and hundred joints all glow with crimson radiance. Pray: \"Primordial essence of the Grotto Chamber, Great Worthy of the Red Child, Florid Canopy of the Dipper’s light, come illuminate the Mud Pill. Refine my bones and blood, restrain my po and govern my hun. Enable me to ascend as an immortal, riding the clouds to the dawn, ascending to pay court to the Jade Emperor and the Primordial Lord of the Great One.\"\n\nWhen this is complete, the external image of the Dipper stars merely divides its essence to enter the Mud Pill—it does not mean moving from one place to another. Thus, both the bed and the head contain them.\n\nThe Azure Lad states: \"Sleeping with the yin essence of the Northern Dipper brings the immortal’s numen; the Grotto Chamber’s reception of the Northern Dipper’s yang essence causes the five viscera to generate spontaneously, enabling one to ride the radiance and roam the Upper Clarity.\" According to the Azure Lad’s words, the Northern Dipper possesses both yin and yang spirits—perhaps also an analogy for the two essences of human hun and po.\n\nThe stars of the Northern Dipper cover the Florid Dawn, their essence radiating nine paths, their light shading the ten heavens. The yang revolves nine nines, hence its lofty reverence. Mortals see only seven stars and not the other two. The eighth and ninth are the spirits of the August Emperor and the Great August One, hidden within the Mysterious Mirror, preserving and governing the celestial hun. Their numinous light blazes brilliantly, serving as the anchor for these seven stars, yet they do not shine upon those of the worldly realm who pursue glory and fame.",
      "overlap_context": "r Poles and Four Perfected, and the covenant of the *Supreme Clarity Golden Writ and Jade Characters of the Grotto Chamber*, one must swear an oath upon torn silk, pledging not to recklessly divulge it.\n\nUpon receiving this scripture, present thirty-two feet of azure silk to the one who bestows it. The number eight corresponds to each of the four directions, totaling thirty-two feet. The recipient of the scripture shall then divide the silk to offer to their master, as per the oral instructions.",
      "start_char": 1235,
      "end_char": 2519,
      "start_sentence": 44,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.65809941291809,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上清金书玉字上经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "诸成道高仙贵真，及上清、太清之官，乃得见之，见之皆不得妄道。 既见之后，高上玉皇、太微帝君乃当诣子，授子真官。 俗人跳脱，亦有误见此二星者，见者慎勿言见也。 太上神录曰：诸见北斗高上太微一星，皆增算三百年，见二星增算六百年。 但俗人多秽，未致於二尊来降耳。 此星乃大於七星，光皆紫华，有异於常，焕焕甚可畏。 见者皆当拜，叩头请乞。 常以月三日、二十七日夜，窃候之，勿令人知。 诚心久久，无不见者。 星有三精，故用二十七日也。 太上法，诸妄说精名，及见而泄者，身被兵火，卒而获考地狱，生死父母，得罪三官。 秦时徐福，本凡人也，亦悟见二星，乃不敢道，遂得增年，於是始信天下有仙，乃知学道耳。 韩众、司马季主，及中岳真人孟子卓、张巨君，逮尹轨之徒，皆亦得见之者也。 汉相国霍光，家有典衣奴子，名还车，粗知书，曾见光严具中有短卷书云：常以月三日、二十七日，使窃候北斗，数数为之，当有所见，见而拜，拜而请乞毕，勿传，皆增年三百岁。 於是还车密识，常试视之非一，忽见二星在斗上，光明非常，乃拜而还，还车遂得增年六百。 此奴小有意而无大志，遂不学道，唯盈年於未死耳。 此语出王君，君以传大茅君。 上清金书玉字上经竟",
      "translated_text": "The perfected Daoist immortals, exalted transcendents, and the officials of the Upper Clarity and Great Clarity may behold them, yet even upon seeing, they must not speak of it recklessly. After witnessing them, the Most High Jade Emperor and the Imperial Lord of the Grand Tenuity shall come to you and confer upon you a true office. Among worldly folk who carelessly glimpse them, there are those who mistakenly see these two stars—those who see must take care never to speak of it.\n\nThe *Divine Records of the Most High* states: Whoever sees one of the high stars of the Northern Dipper in the Grand Tenuity gains three hundred years added to their lifespan; seeing both grants six hundred years. Yet common people, steeped in impurity, seldom merit the descent of these two august ones. These stars surpass the seven in size, their radiance suffused with purple splendor, unlike ordinary stars—resplendent and awe-inspiring. Those who see them must bow in reverence, kowtow, and make their entreaties. Always on the third and twenty-seventh nights of the lunar month, secretly await them, letting no one know. With sincere devotion over time, none shall fail to see them. The stars possess three essences, hence the use of the twenty-seventh day.\n\nBy the Most High’s law, those who recklessly reveal the names of the numinous essences or disclose what they have seen shall suffer bodily harm by blade and fire, meet sudden torment in the earth-prison hells, and implicate their parents in life and death, incurring the wrath of the Three Officials. In the Qin era, Xu Fu was but a common man when he first glimpsed the two stars; he dared not speak of it and thus gained extended years. Only then did he come to believe in the existence of immortals and turn to the study of the Dao. Han Zhong, Sima Jizhu, the Perfected Mencius Zhuo of Mount Song, Zhang Jujun, and Yin Gui—all these, too, were among those who beheld them.\n\nDuring the Han dynasty, Huo Guang, the Chancellor, had a slave in charge of his wardrobe named Huanche, who was somewhat literate. Once, he saw among Huo Guang’s solemn preparations a short scroll that read: *\"Always on the third and twenty-seventh nights of the lunar month, secretly await the Northern Dipper. Do this repeatedly, and you shall see something. Upon seeing, bow; after bowing and making your entreaties, do not speak of it—all shall gain three hundred years.\"* Huanche committed this to memory and tested it not once but many times. One night, he suddenly saw the two stars above the Dipper, their light extraordinary. He bowed and departed, and thus gained six hundred years. Yet this slave, though possessing some intent, lacked great aspiration; he did not study the Dao but merely prolonged his years until death.\n\nThis account comes from Lord Wang, who transmitted it to the Great Lord Mao. Here ends the *Upper Scripture of the Golden Book and Jade Characters of the Upper Clarity*.",
      "overlap_context": "radiating nine paths, their light shading the ten heavens. The yang revolves nine nines, hence its lofty reverence. Mortals see only seven stars and not the other two. The eighth and ninth are the spirits of the August Emperor and the Great August One, hidden within the Mysterious Mirror, preserving and governing the celestial hun. Their numinous light blazes brilliantly, serving as the anchor for these seven stars, yet they do not shine upon those of the worldly realm who pursue glory and fame.",
      "start_char": 2519,
      "end_char": 3009,
      "start_sentence": 85,
      "end_sentence": 102,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.423745155334473,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上清金书玉字上经.txt",
        "category": "方法类"
      }
    }
  ]
}