{
  "source_id": "上清佩符文诀",
  "source_file": "chunked_daozang\\上清佩符文诀.json",
  "total_chunks": 10,
  "total_original_chars": 11960,
  "total_translated_chars": 77743,
  "total_translation_time": 363.5415725708008,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Writs of Jade Talismans for Upper Clarity**\n\n**Title:** *The Writs of Jade Talismans for Upper Clarity*\nAuthor unknown, likely composed between the Tang and Song dynasties. According to the *Song History: Treatise on Arts and Letters*, the original text comprised five scrolls, later divided into five works: *The Writs of the Azure Tallies for Upper Clarity*, *The Writs of the White Tallies*, *The Crimson Spring Writs*, *The Writs of the Black Tallies*, and *The Writs of the Yellow Tallies*. Here, they are presented as one. The base text is from the *Daoist Canon of the Zhengtong Era*, under the Jade Writs section of the Cavern Mystery Division.\n\n---\n\n### **The Writs of the Azure Tallies for Upper Clarity**\n\n**The Primordial Record of the Nine Heavens’ True Writs, Inscribed by the Originator to Examine the Earth**\nThe Three Origins’ Mystic Terrace Jade Tallies and Purple Writs—also called *The Primordial Record of the Nine Heavens’ True Writs, Inscribed by the Originator to Examine the Earth*, or *The Three Origins’ Tiger Writs*, or *The Flying Heavenly Perfected’s Proclamation to the Essences of the Six Heavens and Myriad Spirits*—govern mountains and rivers, inspect the spirits of the Nine Lands, and command ninety Jade Maidens. Through this, one may welcome the Sagely Lord in the Palace of Upper Clarity during the Great Peace. The recipient must transcribe it with a yellow brush upon azure silk and offer it in sacrifice at the sacred peak of their natal destiny. They shall then wear it for nine years. If they have not yet ascended to heaven, they must transcribe another copy, burn it, and scatter the ashes into the azure mist of the clouds. They shall transcribe yet another copy and bury it at the sacred peak of their natal destiny, tread the sources of the rivers, govern the earth’s spirits, and command the myriad gods. After nine years, they will ride the chariot of the Three Origins and ascend to the Palace of the Three Origins. If one defiles it with impurity, offends the celestial perfected, or carelessly reveals its proclamations, their seven generations will bear blame, their body will perish, and they will lose immortality.\n*From the* Scripture of the Three Origins’ Jade Tallies.\n\n---\n\n### **The Vermilion Writs of the Phoenix Script**\n\nThe Supreme Dao Lord addressed the Perfected of the Great Ultimate: \"Though your rank has ascended to the Great Ultimate and you oversee the divine lineage, without the chapters of the Phoenix Script, you may not casually ascend to Jade Clarity or visit the Three Origins. I now impart this to you—diligently uphold it.\"\n\n**The Nine-One Hidden Tones of the Jade Characters of the Phoenix’s Qi**\nThose who wear it become divine immortals; those who practice it attain perfectedhood; those who revere it ward off calamities. If one maintains a perpetual fast, engages in ascetic practice, dwells in secluded heights, and recites it ten thousand times, they will spur dragons to drive the void and ascend to Jade Clarity.\n*From the* Scripture of the Purple Phoenix and Vermilion Writs.\n\n---\n\n### **The Supreme Jade Dawn Banner for Commanding Demon-Spirits**\n\nThose who wear it master the Great Demon-Spirit King of the Eastern Azure Emperor. The method requires entering a chamber at sunset, facing east, reciting the Azure Emperor’s hymn, and displaying the banner within the room, placing it in the east. It is inscribed in white upon azure silk.\n\n---\n\n### **The True Talisman of the Divine Tiger**\n\nThere is the True Talisman of the Divine Tiger, which subdues the Six Heavens and governs the spirits of heaven and earth, enabling the destruction of a thousand essences. When worn, all ghosts vanish, and no demon dares invade. Advancing while wearing it allows one to audience with the Jade Emperor; venerating it in one’s chamber summons the host of perfected to their abode.\n\n---\n\n### **The Supreme Talisman of the Divine Tiger**\n\nWearing this talisman allows one to traverse perilous passes, cross mountains and seas, summon spirits, command ghosts, and bestow seals upon sacred peaks. Wherever one goes, a thousand demons prostrate themselves, ten thousand spirits bind their forms, and a\n\n### **The Supreme Talisman of the Divine Tiger** *(continued)*\n\nInscribe in white upon azure silk and wear it upon the body; when traveling eastward, one shall summon the Great Peace of the World of Na Shan, where the Demon King of the Six Heavens will gird his sash, bow in reverence, and offer welcome. The immortals shall attend as guards, and upon entering Mount Tai, one shall be borne aloft by a canopy of azure clouds and, after nine years, ascend to the Upper Clarity.\n\n*Recorded in the* **Hidden Writ of Jade Clarity**.\n\n---\n\n### **The Talisman of the Seven Luminaries and the Star of Pacification**\n\nTo summon the Perfected and immortals of the Central Marchmount, inscribe in vermilion upon yellow paper, face the Year-Star, and wear it. Cultivate with focused intent for a hundred days, and the immortals shall arrive at once; the Perfected shall visit your chamber to bestow the elixir of transcendence and the Five Elders’ sacred writ.\n\nTo subdue the demons of the Yellow Emperor, inscribe in azure upon a nine-inch yellow wooden tablet and place it above the Year-Star. After a hundred days, the celestial demons shall bind their forms, and the myriad spirits shall perish of themselves. The **Imperial August Script**, practiced for seven years, enables flight as an immortal.\n\n*Recorded in the* **Scripture of the Seven Luminaries**.\n\n---\n\n### **The Hidden Writ of the Eastern Mons**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then wander the land of Ahaluoti in the east, subdue the host of spirits, behead celestial demons, tame the Five Weapons, and roam the famed mountains. The Hu Elders shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Inner Writ of the Southern Branch Tone**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then wander the land of Yishata, subdue the host of spirits, behead celestial demons, tame the Five Weapons, and roam the famed mountains. The Yue Elders’ officials shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Inner Writ of the Western Primordial Azure Grotto**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then enter the land of Nivīlu Lüna, subdue the host of spirits, behead celestial demons, tame the Five Weapons, traverse the Dark Path, enter the Three Clarities, and roam the famed mountains. The Di Elders shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Inner Writ of the Northern Ninefold Numinous Golden Tone**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then enter the land of Xuntaluo, subdue the host of spirits, behead celestial demons, tame the Five Weapons, ascend the Vast Cold, pay homage to the Northern Essence, and roam the famed mountains. The Qiang Elders shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Hidden Register of the Primordial Embrace of Upper Clarity**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then ascend to the land of the Primal Essence and Azure Chaos, subdue the host of spirits, behead celestial demons, tame the Five Weapons, tread the void heavens, ascend to Jade Clarity, and roam the famed mountains. The myriad Perfected shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Inner Writ of the Central Transformation and the Assembly of Perfected Multitudes**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then traverse the land of the Great Harmony and the Treasure of the Boundless Perfected, subdue the host of spirits, behead celestial demons, tame the Five Weapons, enter the Grotto Abyss, ascend the Dark Obscurity, sport in the Northern Primordial, pay homage to the Purple Court, and roam the famed mountains. The Five Elders shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Hidden Writ of Entry into the Six Lands**\n\nBestowed by the Most Exalted Lord of the Azure Lads, this writ comprises one hundred and eighty-five characters. Inscribe with orpiment upon green silk and wear it upon the body; a radiant halo shall emanate from the nape, illuminating the Ten Heavens. One may command thirty-six Jade Lads and thirty-six Jade Maidens, traverse the Five Marchmounts, cross the famed mountains, enter the Six Lands, tread the sources of the rivers, and wherever one goes, the immortals and officials of the Five Directions shall come to bow in reverence, while the border guardians shall welcome and escort. One shall overawe the Six Lands, subdue the Five Weapons, and transform without limit, following one’s will. Descending chariots of flying wheels and the Purple Carriage of the Cinnabar Empyrean shall come to welcome one’s ascent to the Azure Palace of Eastern Florescence.\n\nWhen wearing this writ to traverse the Six Lands, tread the Five Marchmounts, and cross the famed mountains, upon reaching a border, first knock the teeth together thirty-six times, hold the breath for thirty-six cycles, and recite the incantation:\n\n*\"The Jade Perfected wander in circles,\nCloud chariots soar on high.\nThis day is most auspicious,\nDragons take flight, phoenixes soar.\nArrayed in feathered regalia,\nThe Four Paths open wide.\nThe Six Hosts begin their march,\nThe Ten Realms come to welcome.\nImmortal lads bear the banners,\nJade maidens scatter incense.\nThe Five Elders bow in reverence,\nWinged and soaring in formation.\nSun and moon intertwine as sashes,\nDivine immortals come to escort.\nTraversing the myriad lands,\nCircling the four directions,\nThe Four Waterways and Five Marchmounts\nBecome my bridges and beams.\nBy the Emperor’s decree,\nSweep away all inauspiciousness.\nAll divine manifestations\nShall be most propitious.\nA myriad wonders arise,\nThe immortal’s inner cultivation flourishes.\nForeign lands grow bright and clear,\nAscending to the Jade Capital.\"*\n\nUpon completion, draw in the breath and swallow thirty-six times. This is the **Great Invocation of the Most Exalted Lord’s Wandering Might**. Practicing it subdues the Six Lands, tames the myriad spirits, summons the immortals to appear, and enables transformation without limit, ascending to the Great Clarity.\n\n*Recorded in the* **Scripture of the Foreign Lands’ Emanations**.\n\n---\n\n### **The Jade Talisman of the Soaring Numinous Flight**\n\nThe **Script of the Dark Immortals and Feathered Essences**, a writ of spontaneity. Wearing it for seven years enables flight through the void, ascending to the Seven Luminaries.\n\nOn the day of ascent, inscribe it upon the left palm, grasp the Azure Radiance, and take flight. Alternatively, inscribe it upon a nine-inch green silk and wear it on the left; one shall command the Six Jia and the Twelve Spirits, with twelve Jade Maidens attending on the right.\n\n---\n\n### **The Talisman of the Sun Essence of the First Luminary**\n\nInscribe in vermilion upon white paper, face the direction of the current month’s station, and wear it. Cultivate with focused intent for a hundred days, and the Perfected shall descend to your chamber to converse with you.\n\nTo subdue demonic essences, inscribe in azure upon a nine-inch yellow wooden tablet and place it above the current month’s station. The celestial demons shall vanish of themselves, and the myriad spirits shall bind their forms. The **Imperial August Script** must not be recklessly divulged; keep it secret and practice it faithfully, and after ten years, one shall fly as an immortal.\n\n---\n\n### **The Talisman of the Year-Star Essence of the Three Luminaries**\n\nInscribe in black upon green paper, face east, and wear it. Cultivate with focused intent for a hundred days, and the immortals shall arrive at once; the Perfected shall visit your chamber to bestow the elixir of transcendence.\n\nTo subdue the demons of the Azure Emperor, inscribe in white upon a nine-inch green wooden tablet and place it facing east for a hundred days. The celestial demons shall bind their forms, and the myriad spirits shall perish of themselves. The **Imperial August Script** must be kept secret and practiced faithfully; after seven years, one shall fly as an immortal.\n\n**The Talisman of the Azure Emperor for Summoning Spirits and Subduing Demons**\n\nWear this for eight years, and the Emperor shall descend in an eight-chariot procession to welcome your body, ascending to heaven in broad daylight. The secrets of the Nine Heavens must be treasured and kept confidential; cultivate its Way, and the Dao shall descend without fail, immortality shall be attained without exception. Inscribe in black upon a green tablet, nine inches in width and twelve inches in length, and place it facing east within your chamber while cultivating and reciting the scripture.\n\n*From the* **Scripture of the Golden Perfected and Jade Radiance**.\n\n---\n\n**The Black Emperor’s Talisman of Ren and Gui for Communing with Spirits**\n\nInscribe in black upon green silk and wear it on your person. On Ren or Gui days, inscribe in black upon green paper, face north, and ingest one talisman. After three years of Ren and Gui, the Jade Maiden of the Great Mystery shall descend and appear, your body shall commune with spirits, and you shall know all affairs within ten thousand *li* of the northern direction. The immortal officials of the Northern Peak shall present the natural alchemical kitchen. After nine years, the Black Emperor shall descend to your bedchamber, welcoming you with a black mist and a flying chariot to ascend to the Supreme Clarity Palace.\n\n*From the* **Scripture of the Six Jia of the Numinous Flight**.\n\n---\n\n**The Correct Method of the Red Heaven’s Mysterious Yellow for Eliminating the Texts of the Six Heavens**\n\nThe qi of the Mysterious Yellow and Flying Mystery coalesces into jade script. Those who wear it shall unite with the Three Qi in perfection, rectify the Six Heavens, restrain qi, and subdue demons, beheading a thousand evils, wielding awe over the multitude of spirits, entering and exiting water and fire without harm from the myriad calamities.\n\n*From the* **Scripture of the Correct Methods of the Three Heavens**.\n\n---\n\n**The Jade Clarity’s Single Green Wheel for Inspecting Treasures**\n\n**The Hidden Script of Golden Mystery Inscribed by the Dragon Smoke of the Supreme**\n\nThe Nine Mysteries Lord of the Golden Palace of the Later Sage received this from the Linghuang of the High Prime. It was transmitted to the Minister of the Upper Prime, the Azure Youth. Inscribe in yellow upon a green tablet and place it in the southwest to extinguish the great demon king of the Yellow Emperor and his retinue, summoning the immortal officials of the Yellow Emperor from the World of Extended Blessings in the southwest. After nine years, the Eight Emperors and the Perfected Kings of the True Worth shall manifest in your body, bestowing upon you the elixir of flying immortality, refining and transforming your body through seventy-four transmutations.\n\nAlternatively, inscribe in yellow upon green silk and wear it on your person. Travel to the World of Extended Blessings in the southwest, and the myriad spirits shall gird themselves in submission, while the demon kings shall bow their heads in reverence. The Three Primes shall descend in flying chariots of jade wheels to welcome you into the chambers of the Three Primes.\n\n**The Hidden Script of Golden Mystery of the Jade Clarity’s Conch River, Evil Channel, and the Dawn Mandate of the Initial Silence of the Merging Radiance of Heaven**\n\nReceived by the Great Emperor of Fusang from the Perfected King of the Great Empyrean. To practice the Way of divine transcendence, inscribe in yellow upon a dark green tablet and place it in the southeast to extinguish the great demon king of the Luminous Emperor and his retinue, summoning the immortal officials of the Luminous Emperor from the World of Worthy Fields in the southeast. After fifteen years, twenty jade maidens shall be dispatched to serve you, gathering natural spiritual medicines.\n\nAlternatively, inscribe in yellow upon green silk and wear it on your person. Travel to the World of Worthy Fields in the southeast, and the myriad spirits shall gird themselves in the east, while the demon kings shall bow their heads in reverence. You shall ride upon a green cloud and feathered canopy, flying to the Jade Clarity Palace.\n\n---\n\n**The Jade Script of the Northern Emperor for Annihilating Demons and Slaying Ghosts**\n\nReceived from the Supreme Three Heavens, guarded by twelve jade maidens of yellow silk, one named *Spirit-Extinguishing Numinous Strategy*, worn by the Lord of the Supreme Jade Emperor. To slay ghosts on Wu or Ji days, inscribe in white upon green silk, twelve inches in length and three inches and two *fen* in width. On Wu days, place it upon Jia in the east; on Ji days, place it upon Yi. Hold your breath for nine exhalations, knock your left teeth thirty-six times, and recite the incantation:\n\n*\"Within the Yellow Center, the mandate is ordered;\nThe mandate governs the Nine Heavens.\nThe Three Numinous respond to the talisman,\nThe Five Elders verify the immortals.\nHasten the Northern Emperor to restrain\nAnd deliver the demonic bodies.\nThe multitude of evils close their eyes,\nUnable to delay or evade.\nBy the command of the Supreme Emperor,\nPursue and capture without mercy.\nShould any dare to flee,\nSwiftly bind them to Feng Mountain.\nBright as the Emperor’s trust,\nFacing the Jade Dawn.\"*\n\nConclude by drawing in qi nine times and swallowing it. Practice this for nine days, and the demonic ghosts shall bind their forms and appear as shadows before you, submitting to your command. The myriad demons shall be extinguished at their roots, and the multitude of spirits shall lose their essence. Inscribe in white upon green silk and wear it on your person while traveling the world; the ten thousand ghosts shall flee in terror, and a thousand demons shall hide their traces, daring not to offend. After nine years, you shall naturally gain the service of seven jade maidens of pure spirit.\n\n*This talisman is from the* **Hidden Scripture of Jade Clarity**.\n\n---\n\n**The Jade Token Methods of the Upper Clarity Conclude Here**\n\n---\n\n**The White Token Method of the Upper Clarity’s Talismans**\n\n**The Nine Qi Talisman of Tai Shang Jia Yi Entering Wood**\n\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence, and seek to erase the tablets of the Water Emperor, inscribing their names upon the jade registers. In accordance with the scripture, visualize, recite, and invoke. After nine years of practice, you shall be able to inscribe talismans and cast them into mountains, causing mountains to send down clouds and rain. Inscribe upon wood, and though carved, the script shall not fade but grow ever brighter. Carry the talisman and embrace a tree, and your body shall become one with the mountain forests. Bury the talisman in the Eastern Peak, and the Eastern Peak shall guard you with twelve immortal officials. After eighteen years, you shall be able to fly to the Upper Clarity.\n\nRecklessly divulging this Way shall incur punishment by ghostly soldiers, calamity extending to seven generations, and your body shall sink into the river’s source.\n\n---\n\n**The Three Qi Talisman of Tai Shang Bing Ding Entering Fire**\n\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence, erase the tablets of the Water Emperor, and inscribe their names upon the jade registers. In accordance with the scripture, visualize, recite, and invoke. After nine years of practice, you shall be able to inscribe talismans and cast them into forests, causing forests to spontaneously ignite; cast them into water, and water shall produce dragons; cast them into mountains, and mountains shall send down clouds and rain. Bury the talisman in the Southern Peak, and immortal officials shall attend and guard your body. After eighteen years, you shall be able to fly to the Jade Clarity.\n\nRecklessly divulging this Way shall bring calamity upon seven generations, your body shall be consigned to the ghostly officials, and you shall be eternally confined to the earthly prisons, unable to ascend as an immortal.\n\n---\n\n**The Seven Qi Talisman of Tai Shang Geng Xin Entering Metal**\n\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence, erase the tablets of the Water Emperor, and inscribe their names upon the jade registers. In accordance with the scripture, cultivate, recite, and invoke. After nine years of practice, you shall be able to inscribe talismans upon stone, refining stone into gold; inscribe talismans and embrace stone, and the stone shall conceal your form. Bury the talisman in the Western Peak, and immortal officials shall descend to present natural and wondrous treasures.\n\nAfter eighteen years of cultivation, you shall ascend through the void to the Jade Purity. Should you recklessly disclose this Way, divine soldiers shall mete out punishment, and your seven generations shall bear the burden of judgment.\n\n**The Five Qi Talisman of Tai Shang Ren Gui Entering Water**\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence. Follow the original text in cultivation, recitation, and invocation. After nine years of practice, you shall inscribe talismans and cast them into water, whereupon dragons shall halt the flow and still the waves, and entering water shall be as traversing empty space. Bury the talisman in the Northern Peak, and immortal officials shall descend to bestow divine medicines and the formula of deathlessness. After eighteen years, you shall sit or stand at will, vanish and reappear, ride the void in flight, and ascend to the Jade Purity. This Way is lofty and wondrous; it is not transmitted to the untrue. Should you recklessly disclose its sacred writ, your seven generations shall bear the burden of judgment, your body shall be consigned to the ghostly officials, and you shall be eternally bound as a prisoner of the dark, unable to ascend as an immortal.\n\n**The One Qi Talisman of Tai Shang Wu Ji Entering Earth**\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence, erase the tablets of the Water Emperor, and inscribe their names upon the jade registers. In accordance with the scripture, cultivate, recite, and invoke. After nine years of practice, you shall comprehend the languages of the thirty-six nations and perceive the forms and hues of the thirty-six Earth Sovereigns beneath the ten thousand abysses. Inscribe talismans and cast them into earth, and your form shall merge with the soil. Bury the talisman in the Central Peak, and immortal officials shall attend and guard you, bestowing the natural kitchens and the medicine of deathlessness. After eighteen years of practice, you shall traverse the mysterious void in flight and ascend to the Jade Capital. Guard this as the secret of immortals; should you recklessly disclose it, nine generations shall bear the burden of judgment, your body shall endure the three paths of suffering, and you shall be consigned to the dark mountains as a prisoner.\n\n**The Nine Springs Azure Qi Talisman**\nOn the day of the Beginning of Spring or the Spring Equinox at dawn, write in cinnabar upon green paper, face east, and ingest it. In accordance with the scripture, visualize: the Spirit King of the Eastern Sea shall erase my death tablets and inscribe my name in the immortal registers. After reciting the invocation as prescribed, cast the talisman into the abyss of eastward-flowing waters. After eighteen years of practice, the Water Emperor shall inscribe your name in the Jade Purity and send down dragon chariots, enabling you to traverse the great void in flight.\n\n**The Cavernous Origin Crimson Qi Talisman**\nOn the day of the Beginning of Summer or the Summer Solstice at noon, write in cinnabar upon green paper, face south, and ingest it. Follow the text in visualization: the Spirit King of the Southern Sea shall erase my sin tablets and inscribe my name in the immortal registers. After reciting the invocation as prescribed, cast the talisman into the abyss of southward-flowing waters. After eighteen years of practice, the Spirit King shall list your name before the Jade Emperor and send down cloud-dragon cinnabar carriages, enabling you to traverse the great void in flight.\n\n**The Cavernous Abyss White Qi Talisman**\nOn the day of the Beginning of Autumn or the Autumn Equinox at dusk, write in cinnabar upon green paper, face west, and ingest it. Perform the visualization: the Spirit King of the Western Sea shall erase my sin tablets, inscribe my name in the immortal registers, and present it before the Jade Emperor. After reciting the invocation as prescribed, cast the talisman into the abyss of westward-flowing waters. After eighteen years of practice, the Sea Spirits shall welcome and escort you, unrestrained by water or bridges, and send down dragon carriages, enabling you to traverse the great void in flight.\n\n**The Cavernous River Black Qi Talisman**\nOn the day of the Beginning of Winter or the Winter Solstice at midnight, write in cinnabar upon green paper, face north, and ingest it. In accordance with the scripture, visualize: the Spirit King of the Northern Sea shall erase my sin tablets and inscribe my name in the jade registers. After reciting the invocation as prescribed, cast the talisman into the abyss of northward-flowing waters. After eighteen years of practice, you shall command the Water Spirits to assemble the twelve dragons to channel water and summon rain, darkening the bright day, and traverse the empty void in flight.\n\nThese nine talismans derive from the *Scripture of the Nine Crimson Talismans*.\n\n**The Talisman of Tai Shang’s Three Ascents to Fangzhang and the Thunderous Spirit**\nThose who guard the feminine unity and practice the Great Cavern Way shall constantly wear this talisman over the heart, written in cinnabar of any size as desired. It may be worn while sitting or lying down, or placed within bedding. When worn, it repels evil for four inches around the body; when sat upon, it repels evil for three feet. Wearing this talisman grants longevity and deathlessness, enables the command of ghosts and spirits, and ensures that the Great Demon King of the Northern Emperor dares not test you.\n\nThis derives from the *Perfect Scripture of the Great Cavern*.\n\n**The Treasured Writ of Tai Shang**\n\nThe Scripture states: Wear it for eight years, and the Three Ones shall all manifest. Write in cinnabar on plain silk and wear it on the left elbow. The Azure Lad bestowed this upon Juanzi to seal the sacred mountains. This derives from the *Perfect Scripture of the Four Palaces’ Feminine Unity*.\n\n**The True Talisman of the Golden Tiger**\nThe True Talisman of the Golden Tiger commands the spirits of Heaven and Earth, enabling the crushing of a thousand essences and the subjugation of ten thousand ghosts. When worn while advancing, one may ascend to pay homage to the Jade Emperor; when placed by one’s bed, all perfected beings shall visit the chamber. Those who wear this talisman wield authority over Heaven and Earth, rebuke the assembled spirits, ride dragons through the clouds, and hold office as exalted immortals. Once its jade-like resonance resounds, jade blossoms attend at one’s side, golden perfected ones guard as soldiers, a thousand demons lose their sight, and ten thousand ghosts vanish in form. This derives from the *Hidden Writ of the Supreme Eight Guards*.\n\n**The Talisman for Enduring the Great Kalpa, Preserving Life, and Ensuring Longevity**\nThe essence of the Primordial Nine Mysteries, passing through the great yang’s nine conjunctions, when the floodwaters drowned the heavens. Write in blue-green on white silk and wear it upon the head; one shall float upon the clear waves, no calamity able to harm, preserving the body’s longevity. With long wear, one becomes an immortal.\n\n**The Talisman for Enduring the Lesser Kalpa, Preserving Life, and Ensuring Longevity**\nThe True Talisman of the Nine Heavens, passing through the lesser yang’s nine cycles, when water disasters raged and ten thousand calamities arose together. Write in cinnabar on white silk and wear it on the left elbow; one shall not sink in the abyss nor burn in fire, no calamity able to harm, preserving the body’s long life. With long wear, one’s lifespan equals Heaven’s, and one becomes an immortal.\n\n**The Talisman for Enduring the Great Hundred and Six Calamities, Preserving Life, and Ensuring Longevity**\nThe Jade Talisman of the Supreme Sovereign, passing through the great hundred and six calamities. Write in cinnabar on white silk and wear it upon the head; flowing disasters and violent calamities cannot harm, preserving the body’s long life, with a lifespan equal to the Three Luminaries. Wear it for nine years, and one shall ascend to the Great Clarity in broad daylight.\n\n**The Talisman for Enduring the Lesser Hundred and Six Calamities, Preserving Life, and Ensuring Longevity**\nThe Supreme Purple Void Jade Talisman, passing through the lesser hundred and six calamities. Write in yellow on white silk and wear it on the left elbow; a thousand demons and ten thousand essences, epidemics raging and disasters flowing, cannot harm, preserving the body’s long life, with a lifespan equal to Heaven and Earth. Wear it for nine years, and one shall ascend in broad daylight.\n\n**The Talisman for Enduring the Yin-Yang Transition, Preserving Life, and Ensuring Longevity**\nThe Jade Talisman of the Three Heavenly Lads, passing through the transformation of Heaven and Earth, when ten thousand epidemics raged together, water and fire, weapons and illness, a thousand disasters advancing in unison. Write in black on white silk and wear it; one’s lifespan equals Heaven’s years, one’s radiance equals the sun’s light. After nine years of flight, one ascends to the Great Clarity. These five talismans above all derive from the *Supreme Scripture of the Purple Writ*.\n\n**The Yellow Emperor’s Wuji Talisman for Communicating with Spirits**\nWrite in yellow on white silk and wear it on the body. On a Wuji day, write in yellow on white paper and face the Grand Year Star to ingest one piece. After three years, the Jade Maiden of the Yellow Essence shall descend and appear; one’s body shall attain spiritual communication, knowing the affairs of the central ten thousand miles, and the immortal officials of the Central Marchmount shall send forth the natural kitchen. After nine years, the Yellow Emperor shall descend to one’s bedchamber, welcoming one with a flying chariot of yellow mist to ascend to the Supreme Clarity Palace.\n\n**The Vermilion Talisman of the Jiazi Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiazi day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiawu Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiawu day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiachen Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiachen day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiaxu Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiaxu day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiayin Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiayin day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiashen Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiashen day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\nWrite the vermilion talisman script according to the Jiazi day, perform the offering, and wear it on the body. Command spirits and summon the numinous, seal the seas and mountains, wander the Five Marchmounts, with all spirits respectfully welcoming. Command the Six Jia, ascend to Heaven and enter the abyss, divide one’s form and scatter one’s shadow across seventy-four directions. Whatever is wished shall be immediately attained; whatever is faced shall be immediately accomplished. Cultivate this for nine years, and the Three Origins shall descend; one shall ride the void in flight, ascending to the Jade Palace. This derives from the *Scripture of the Numinous Flight of the Six Jia*.\n\n**The Supreme Jade Dawn Banner for Commanding Demons and Spirits**\nWear it to command the Great Demon King of the White Emperor of the West. According to the method, at sunset enter the chamber, recite the Western Melody, and display the banner within the chamber facing west, written in cinnabar on white silk.\n\n**The Hidden Writ of the Supreme Perfected of the Dark Mound**\nSummon the assembled spirits and command the ten thousand essences. Wear it for nine years, and one shall behold the Lords of the Three Origins, welcoming the Sage Lord at the Golden Portal of the Supreme Clarity. Write in cinnabar on white silk. This derives from the *Supreme Scripture of the Pure Melody*.\n\n**The Talisman of the Four Origins and the Vast Expanse of the Great White Star’s Essence**\nTo summon the perfected ones and immortal officials of the Western Marchmount, write in yellow on white paper, face west to ingest it, and meditate with focused intent for a hundred days; the immortal officials shall immediately arrive, and the perfected ones shall visit the chamber, bestowing upon one the true scripture and conversing with one. To command the demons of the White Emperor, write in cinnabar on a nine-inch wooden tablet, face west for a hundred days; the heavenly demons shall bind their forms, and the ten thousand essences shall perish of themselves. The Imperial Sovereign’s Chapter, practiced for seven years, enables transcendence as an immortal and ascension to Heaven in broad daylight. This derives from the *Scripture of the Seven Origins*.\n\n**The Talisman of the White Emperor for Summoning the Numinous, Attracting the Perfected, and Subduing Demons**\nWear it for eight years, and the Emperor shall descend in a dark mist chariot to welcome one’s body, ascending to the Great Clarity. The secret missive of the Nine Heavens—one must treasure and guard it closely. Cultivate its Way, and no Dao shall fail to descend; no immortality shall fail to be achieved.\n\nInscribe in yellow on a white tablet, nine inches in breadth and twelve inches in length, place it facing west within the chamber, and cultivate while reciting the scripture.\n*From the* Scripture of the Golden Perfection and Jade Radiance.\n\n**The Perfected Writ of the Three Heavens**\nWhen worn, one may enter water, and jiao-dragons shall open a path for ten thousand miles. When the great kalpa turns, one may ascend into the mysterious void, serving and escorting the Sagely Honored One in the Palace of Supreme Clarity.\n*From the* Scripture of the Orthodox Dharma of the Three Heavens.\n\n**The Jade Talisman of the Descending Numinous Flight**\nThe essence of the Primordial Beginning, the jade chapter of the feathered mystery—when worn for nine years, one may traverse the void in flight, ascend to the Five Stars, and tread the qi of the ascending mystery. Without this talisman, one may not soar through the empty sky.\nThe recipient must swear an oath with sixty feet of plain silk. On the day of ascetic practice, inscribe it upon the right palm, and one may grasp the plain silk to fly in numinous flight.\nInscribe in cinnabar on a nine-inch white silk and wear it: to the left, the Six Jia and Twelve Spirits shall be commanded; to the right, twelve Jade Maidens shall attend.\n*From the* Supreme Scripture of the Nine Ways of Reversion and Feathered Flight.\n\n**The Jade Scripture of the Lofty Jade Purity, the Soaring Impetus, the Dragon Net, the Celestial Observation, the Numinous Origin, and the Hidden Dawn**\nWorn by the Nine Elder Immortals of the Immortal Capital.\nTo practice the Way of the divine immortals, one must inscribe in red upon a white tablet, place it in the west, to extinguish the Great Demon King of the White Emperor of the West and his retinue, and summon the immortal officials of the West.\nWhen practiced for twelve years, the Seven Sagely Numinous Lords of the Luminous Plain and Golden Spirit shall descend in form to one’s body, dispatching immortal officials to gather the naturally numinous herbs. Further, inscribe in cinnabar on white silk and wear it upon the body; when traveling to the world of the Blessed Hall Continent, the Great Demon King shall gird his sash and bow in reverent welcome, while immortal officials escort one into the Western Marchmount. Then shall luminous clouds and feathered canopies arrive, and after twelve years, one shall fly to the Jade Purity Palace.\n*From the* Scripture of the Hidden Writ of Jade Purity.\n\n**The Jade Writ of the Northern Emperor for Annihilating Demons and Slaying Ghosts**\nReceived from the Supreme Three Heavens, guarded by thirty-six Jade Maidens—one name is the *Mandate of the Nine Heavens over Demons*, worn by the Supreme Numinous Empyrean King.\nTo slay ghosts of the Jia and Yi days, inscribe in cinnabar upon white silk, twelve inches in length and three inches and two fen in breadth. On Jia days, place it upon the west at Geng; on Yi days, at Xin. Hold the breath for seven cycles, knock the teeth thirty-six times, and recite the incantation:\n*\"Riding the heavens, treading the qi, I carry forth the mighty writ. The supreme jade script commands all malevolence; the numinous cold submits, its voice like the celestial bell. I solemnly declare to the Earl of Destiny: inspect and restrain the Northern Feng. First execute the ghostly shades, then sever the demon kings. Great and small shall be obliterated, high and low shall crumble. As the mandate of Heaven commands, cut off the qi of the Fire Palace. The Great One supervises the decree; the Five Elders dispatch the venerable ones. Heaven is clear, earth is bright; the ten thousand fordings open. Whatever the Jia and Yi govern shall submit without fail.\"*\nConclude, then draw in the qi seven times and cease.\nWhen practiced for seven days, the heavenly demons shall bind their forms and appear in vision, submitting before one’s eyes. Ghostly shades shall be extirpated, and the ten thousand essences shall perish of themselves.\nInscribe in cinnabar on white silk and wear it upon the body: one may wander the world, and no demon shall dare approach, nor any ghost presume to interfere. After seven years, one shall naturally gain the service of eight Jade Maidens of the Great Cinnabar.\n*From the* Hidden Scripture of the Divine Wisdom of Supreme Clarity.\n\n**Within the Golden Portal lies the Hidden Jade Name**\nTen jade characters, inscribed in red.\nWhen worn, the Golden Portal shall engrave one’s name upon jade tablets, and the numinous immortals of the Four Waterways and Five Marchmounts shall escort and receive.\nThose who know it shall ascend in flight to the Golden Portal and soar into Supreme Clarity.\n\n**The Supreme Writ of the Jade Register of Supreme Clarity**\nTen jade characters, inscribed in blue-green.\nWhen worn, Supreme Clarity shall inscribe one’s name upon golden tablets, and the immortal officials shall be notified to descend the Five Marchmounts in escort.\nThose who know it shall ascend in flight to Supreme Clarity, their rank equal to the Four Perfected.\n\n**The White Tablet Writ of the Supreme Ultimate**\nTen jade characters, inscribed in blue-green.\nWhen worn, the Supreme Ultimate shall inscribe one’s name upon the tablet writ and register it in the divine府. The Four Poles shall provide escort.\nThose who know it shall ascend in flight to the Palace of the Supreme Ultimate and soar within the Golden Portal.\n\n**The Hidden Writ of the Purple Name of the Square Cauldron and the Mysterious Plain**\nTen jade characters, inscribed in blue-green.\nWhen worn, the Square Cauldron shall inscribe one’s name in mysterious purple. After nine years of flight, divine immortals shall escort and receive, and the Five Marchmounts shall record one’s name.\nThose who know it shall ascend in flight to the Palace of the Square Cauldron.\n\n**The Hidden Writ of the Crimson Name in the Jade Register of the Great Clarity**\nTen jade characters, inscribed in red.\nWhen worn, the Great Clarity shall inscribe one’s crimson name in the jade register. After nine years, one shall commune with spirits and fly, attended by twelve Jade Lads.\nThose who know it shall ascend in flight to the Great Clarity and soar into the Jasper Palace.\n\n**The Hidden Writ of the Golden Name on the Jasper Tablet of the Supreme Simplicity**\nTen jade characters, inscribed in yellow.\nWhen worn, the Supreme Simplicity shall inscribe one’s name upon the jasper tablet. After nine years, one shall attain flight upon clouds and ascend to Heaven in broad daylight.\nThose who know it shall ascend in flight to the Palace of Supreme Simplicity and pay homage to the Three Primordial Lords.\n\n**The Supreme Writ of the Crimson Register of the Southern Culmen**\nTen jade characters, inscribed in red.\nWhen worn, the Southern Culmen shall register one’s name in the crimson register. After nine years, the Three Primordials shall descend and confer the Perfected Writ, enabling ascension to Heaven in broad daylight.\nThose who know it shall ascend in broad daylight and ascend to pay homage to the Primordial Lord of the Supreme Ultimate.\n\n**The Hidden Writ of the Blue-Gold and Red Inscription of the Upper Primordial of the Mysterious Palace**\nTen jade characters, inscribed in blue-green.\nWhen worn, one shall behold the true form of the Upper Primordial. After nine years, it shall descend to one’s chamber and confer the Perfected Writ, enabling one to attain divine immortality.\nThose who know it shall ascend in flight to the Mysterious Palace and soar into Supreme Clarity.\n\n**The Hidden Writ of the Golden Characters on the White Jade of the Cinnabar Terrace of the Mysterious Capital**\nTen jade characters, inscribed in yellow.\nWhen worn, one’s name shall be inscribed upon the Cinnabar Terrace. After nine years, one may traverse the empty sky in flight; with time, one shall attain divine immortality.\nThose who know it shall ascend in broad daylight to the Mysterious Capital.\n\n**The Hidden Writ of the Blue-Green Inscription on the Jade Tablet of the Three Primordials’ Palace**\nTen jade characters, inscribed in blue-green.\nWhen worn, one’s name shall be inscribed upon the jade tablet of the numinous jade. After nine years, the Three Primordials shall descend to one’s chamber and confer the Perfected Writ, enabling flight as a divine immortal.\nThose who know it shall ascend to Heaven in broad daylight and pay homage to the Three Primordial Lords.\n\n**The Hidden Writ of the Recorded Name in the Mysterious Dipper**\nTen jade characters, inscribed in black.\nWhen worn, one’s name shall be inscribed in the Mysterious Dipper. After nine years, divine persons shall descend and confer the Perfected Writ, enabling one to practice as a divine immortal.\n\nThose who know it shall ascend into the Mysterious Dipper and soar to the Palace of Supreme Purity.\n\n**The Hidden Writ of the Vermilion Inscription on the Jade Slips and Purple Registers of the Five Marchmounts**\nTen jade characters, inscribed in blue-green.\nWhen worn, the numinous officials of the Five Marchmounts shall guard one’s body, and the Five Thearchs shall inscribe one’s name upon the slips of the Five Marchmounts. After nine years, one shall ride the void in flight and ascend to the Mysterious Palace.\nThese one hundred and twenty jade characters of the佩文, when worn, allow one to traverse mountains and peaks, where the Ten Realms bow in reverence and the myriad immortals come to pay homage. Those who know it shall ascend to Heaven in broad daylight and soar above the Five Marchmounts.\n\n*—Excerpted from the Scripture of the Seven Sages’ Mysterious Record*\n\n**The White Writs of the Supreme Purity佩符 Concluded**\n\n**The Crimson Writs of the Supreme Purity佩符**\n\n**The Flowing Gold Fire Bell Talisman**\nAll who wear this talisman are destined by former lives to become immortals. When wearing the talisman and moving about, one must constantly visualize a circular radiance above one’s head, illuminating four hundred thousand *li* beyond. After nine years of diligent practice, the perfected spirits shall descend. Inscribe it in vermilion on two feet two inches of purple silk and wear it upon the head.\n\n*—Talisman from the Scripture of the Purple Ascension and Blazing Light*\n\n**The Highest Jade Dawn Banner for Commanding Demons and Spirits**\nWhen worn, it governs the Demon-Spirit Great King of the South, the Red Thearch. Upon entering the chamber at sunset, recite the Southern Melody, display the banner within the chamber, and place it in the south. Inscribe it in black on crimson silk.\n\n*—From the Scripture of the Pure Melody*\n\n**The Talisman of the Red Thearch for Summoning Spirits, Attracting Perfected Beings, and Subduing Demons**\nInscribe in blue-green on a red tablet, nine inches wide and one foot two inches long. Place it facing south within the chamber. Practice and recite scriptures for one hundred days, and one shall converse with divine persons. After three thousand days, the chamber shall naturally generate clouds of crimson mist.\nTo summon perfected beings and celestial immortals, inscribe it according to the method and place the talisman facing east. Cultivate with focused intention for one hundred days, and perfected beings shall descend in form, while immortals shall visit one’s chamber to confer the Dao of divine perfection.\n\n*—From the Scripture of Golden Perfection and Jade Radiance*\n\n**The Talisman of the Upper Prime, the Expansive Moon Essence**\nTo communicate with spirits and summon deities, inscribe in yellow on white paper and ingest it while facing west. Cultivate with focused intention for one hundred days, and divine persons shall descend in form to converse with one.\nTo subdue demons and capture spirits, inscribe in black on a nine-inch red wooden tablet and place it in the northeast. After one hundred days, the Northern Thearch shall capture demons, and the Celestial Prime shall seize spirits, eradicating all malevolent beings. Both within and without shall be purified. This is the imperial writ—practice it in secret. After seven years, one shall become a flying immortal and ascend to Heaven in broad daylight.\n\n**The Talisman of the Five Primes, the Expansive Fire Star Essence**\nTo summon the perfected beings and immortal officials of the Southern Marchmount, inscribe in blue-green on red paper and ingest it while facing south. Cultivate with focused intention for one hundred days, and the immortal officials shall arrive instantly, while perfected beings shall visit one’s chamber to bestow divine mushrooms and sacred writs, conversing with one.\nTo subdue the demons of the Red Thearch, inscribe in black on a nine-inch red wooden tablet and face south for one hundred days. The celestial demons shall be bound in form, and the myriad spirits shall perish of themselves. This is the imperial writ—practice it for seven years, and one shall ascend to Heaven in broad daylight.\n\n*—Talismans from the Scripture of the Seven Primes*\n\n**The Azure Thearch’s Jia-Yi Talisman for Communicating with Spirits**\nInscribe in blue-green on crimson silk and wear it on the body. Additionally, on Jia or Yi days, inscribe in blue-green on crimson paper, face east, and ingest one talisman. After three years of Jia-Yi days, the Jade Maidens of the Azure Waist shall descend and appear. One’s body shall communicate with spirits, knowing all affairs within ten thousand *li* of the east. The immortal officials of the Eastern Marchmount shall deliver the natural kitchens. After nine years, the Azure Thearch shall descend to one’s bedchamber, welcoming one with a chariot of azure mist to ascend to the Palace of Supreme Purity.\n\n*—From the Scripture of the Six Jia Spirit Flights*\n\n**The Primordial Azure Correct Dharma of the Qingwei Heaven for Dispelling the Writs of the Six Heavens**\nThe flying mystery of the Primordial Azure *qi* coalesces into jade writs. When worn, it commands spirits and employs *qi*, its majesty subduing the ten directions. One emerges from the void and enters non-being, opening the myriad Dao.\n\n**The Primordial White Correct Dharma of the Yuyu Heaven for Dispelling the Writs of the Six Heavens**\nThe flying mystery of the Primordial White *qi* coalesces into jade writs. When worn, it rectifies and commands the myriad spirits, its divine majesty extinguishing demons. It repels the Yang Ninth and guards against the exhaustion of years. No calamity shall harm one. One emerges from and enters the void and the mystery, moving as one desires.\n\n*—Talismans from the Scripture of the Three Heavens’ Correct Dharma*\n\n**The Golden Mystery Inner Writ of the Jade Purity, Flourishing and Harmonious, Nurturing the Lush Sands of the Celestial Alignment’s Dawn Concealment**\nBestowed upon the Queen Mother of the West by the Supreme Master of the Northern Culmen.\nTo practice the Dao of immortality, inscribe in blue-green on a purple tablet and place it in the northeast to extinguish the great demon king and his retinue of the Azure Thearch, summoning the immortal officials of the northeast’s Blessed Abode to assemble in the Eternally Peaceful World. After ten years, eighteen immortal youths shall attend and serve one, gathering natural numinous medicines and obtaining the supreme flying mystery of feathered writs.\nAlternatively, inscribe in blue-green on purple silk and wear it on the body. When traveling in the northeast’s Eternally Peaceful World, the myriad spirits shall be bound in sashes, and the demon king shall bow in reverence and welcome one. One shall ride a chariot of purple clouds and feathered canopy to soar to the Palace of Jade Purity.\n\n**The Golden Mystery Inner Writ of the Jade Purity, Azure Empyrean, Empty Song, and the Residual Pearls of the Celestial Totality’s Nine Culminations**\nWorn by the High and Lofty Lord of Jade Purity.\nTo practice the Dao of immortality, inscribe in black on a cinnabar tablet and place it in the south to extinguish the great demon king and his retinue of the Red Thearch, summoning the immortal officials of the south. After eighteen years of practice, the Perfected Lord of Vermilion Radiance and Numinous Scenery shall descend in form to one’s body, commanding immortal officials to gather natural numinous medicines.\nAlternatively, inscribe in black on crimson silk and wear it on the body. When traveling in the southern realm of the Pearlescent City’s World of Forsaken Worthies, the great demon king shall be bound in sashes and bow in reverence to welcome one, while immortal officials shall attend and guard. Upon entering the Southern Marchmount, one shall obtain the Southern Culmen’s sacred writs and summon a canopy of cinnabar clouds. After eighteen years, one shall soar to the Palace of Jade Purity.\n\n*—Talismans from the Scripture of the Jade Purity’s Concealed Writs*\n\n**The Left Spirit-Flight Jade Talisman**\nThe essence of the primordial *qi*’s inception, the writ of plain feathers. When worn for nine years, one shall ride the void in flight and ascend to the Five Stars.\nOn the day of practice, inscribe it upon the sole of the left foot, and one shall be able to tread the void in flight. Inscribe it on nine inches of crimson silk and wear it to command the six Jia and twelve spirits, with twelve Jade Maidens attending before one.\n\n**The Right Talisman from the *Scripture of the Nine Perfections Ascending the Mysterious***\n\n**The Jade Writ of the Northern Thearch’s Primordial Numen for Extinguishing Demons and Slaying Ghosts**\nReceived from the Three Highest Heavens, guarded by thirty-six Primordial Numen Jade Maidens, styled the *Celestial Soldiers’ Pledge*, and worn by the Jade Purity Divine Numinous Sovereign. To slay ghosts of the *geng* and *xin* days, inscribe in black upon cinnabar silk, one foot two inches in length and three inches two *fen* in width. On a *geng* day, place it above *bing* in the south; on a *xin* day, place it above *ding*. Hold the breath for three cycles, knock the left teeth thirty-six times, and intone:\n*\"Heaven opens, earth communicates,\nThe mysterious *qi* shines in clarity.\nSweep away the floating obscurities,\nThe Five Paths gleam resplendent.\nBy the Thearch’s decree,\nAll numina are examined and marshaled.\nThe legions of the Northern Feng,\nIn solemn majesty assume their forms.\nBy the Highest’s command,\nHasten without delay to appear.\nAll demons shall come of themselves,\nGhosts and specters shall be extinguished.\nWind surges, lightning strikes,\nFrom heaven all is pacified.\nAs with this mysterious talisman,\nSubmit and attend the Thearch’s court.\"*\nConclude by drawing in *qi* and swallowing thrice. After three days of practice, ghosts and demons shall bind their forms and reveal their shadows, submitting before one’s eyes. Ten thousand demons shall be subdued by law, and all malevolent spirits shall vanish without trace. Inscribe in black upon cinnabar silk and wear it upon the body while traveling the world—ten thousand ghosts shall flee and hide, and no spirit shall dare to offend. After three years, one shall naturally gain the service of five Great Mysterious Jade Maidens.\n\n*—From the* Scripture of the Jade Purity’s Concealed Writs\n\n**The Crimson Contract Formula for Wearing the Upper Clarity Talismans**\n*(Concluded above)*\n\n**The Black Contract Formula for Wearing the Upper Clarity Talismans**\n\n**The Highest Jade Aurora’s Banner for Commanding Demon Numin**\nThose who wear it shall master the Demon Numin Great King of the Northern Black Thearch. According to the original scripture, enter the chamber on the appointed day, recite the Northern Melody, and display the banner within the chamber, placing it in the north. Inscribe with yellow ink upon black silk.\n\n*—From the* Scripture of the Pure Melody\n\n**The Black Thearch’s Talisman for Summoning Numin, Attracting Perfected Ones, and Seizing Demons**\nInscribe in white upon a black wooden board, nine inches in width and one foot two inches in length. Place it facing north within the chamber. After one hundred days of practice and scripture recitation within the chamber, one shall converse with divine persons. After three years, the chamber shall naturally generate clouds of emerald radiance. To summon Perfected Ones and Heavenly Immortals, inscribe as above and place the talisman facing west. After one hundred days of concentrated meditation, Perfected Ones shall descend in form, and Immortals shall arrive at one’s chamber to transmit the Way of Divine Perfection.\n\n*—From the* Scripture of the Golden Perfection and Jade Radiance\n\n**The White Thearch’s *Geng-Xin* Jade Talisman for Communicating with Numin**\nInscribe in white upon black silk and wear it upon the body. Alternatively, on a *geng* or *xin* day, inscribe in white upon black paper, face west, and consume one piece. After three years, the Great Primordial Jade Maidens of *geng* and *xin* shall descend and appear. The omen-body shall attain numinous communion, perceiving all affairs within ten thousand *li* of the west. The Immortal Officials of the Western Marchmount shall deliver the natural kitchens. After nine years, the White Thearch shall descend to one’s bedchamber, welcoming one with a flying chariot of pristine auroral clouds to ascend to the Palace of Upper Clarity.\n\n*—From the* Scripture of the Numinous Flight of the Six *Jia**\n\n**The Jade Talisman of Numinous Flight**\nThe essence of the primordial *qi*, the writ of ascending mystery and plain feathers. When worn for nine years, one shall ride flying clouds. On the day of practice, inscribe it upon the sole of the right foot, and one shall be able to tread the mysterious void in flight. Inscribe it upon nine inches of black silk and wear it to command the six *Jia* and twelve spirits, with twelve Jade Maidens attending behind.\n\n*—From the* Scripture of the Nine Perfections Ascending the Mysterious\n\n**The Jade Purity’s [Obscured] Talisman of the Heaven of Concealed Brilliance and Hidden Roots**\nThe concealed golden and mysterious writ received by the Nine Heavens’ Perfected Kings. To practice the Way of divine immortality, inscribe in yellow upon a black board and place it in the north to extinguish the Great Demon King of the Northern Marchmount and his retinue, and to summon the Immortal Officials of the north. After fifteen years, the Jade Perfected Lord of the Northern Culmen of Mystery shall arrive to transmit the highest sacred writs and command fifty Immortal Officials. Alternatively, inscribe in yellow upon black silk and wear it while traveling to the pure and tranquil world of *Yudan* in the north. All numina shall gird their sashes, and the Demon King shall bow in reverent welcome. Upon entering the Northern Marchmount, one shall obtain a canopy of black clouds and ascend in flight to the Palace of Jade Purity.\n\n*—From the* Scripture of the Jade Purity’s Concealed Writs\n\n**The Northern Thearch’s Cinnabar Numen Jade Writ for Extinguishing Demons and Slaying Ghosts**\nReceived from the Three Highest Heavens, guarded by sixty-four Vermilion Palace Jade Maidens, styled the *Seizing and Slaying Statute*, and worn by the Highest Demon-Quelling King. To slay ghosts of the *bing* and *ding* days, inscribe in yellow upon black silk, one foot two inches in length and three inches two *fen* in width. On a *bing* day, place it above *ren* in the north; on a *ding* day, place it above *gui*. Hold the breath for five cycles, knock the left teeth thirty-six times, and intone:\n*\"By the Highest’s proclamation,\nAll numina are universally seized.\nThe Earls and Clerks receive the talisman,\nReceiving and enforcing the Jade Purity’s mandate.\nSupervising the Northern Feng,\nBinding and delivering demon names.\nWhat the Thearch requires,\nNo delay in the celestial signs.\nThe August Elders oversee the decree,\nThe Five Immortals lead the troops.\nHeavenly Unity wields the halberd,\nSlaying without cease.\nTen thousand times ten thousand submit to the law,\nA thousand times a thousand are executed in form.\nBy the Seizing Statute’s command,\nNone shall fail to be purified.\"*\nConclude by drawing in *qi* and swallowing five times. After five days of practice, ghosts and demons shall bind their forms and reveal their shadows, submitting before one’s eyes. All malevolent spirits shall vanish without trace, and a thousand essences shall perish of themselves. Inscribe in yellow upon black silk and wear it upon the body while traveling the world—ten thousand demons shall be extinguished, and no spirit shall dare to offend. After five years, one shall naturally gain the service of twelve Yellow Primordial Jade Maidens.\n\n*—From the Upper* Scripture of the Jade Purity’s Concealed Writs\n\nThe Upper Clarity’s combined talismans for wearing comprise one hundred and five diagrams and nine hundred forty-three characters in jade script. The Great Mysterious Left Palace’s Jade Maiden of the Four Poles, in thirty-one independent scriptures, is a treasure among scriptures. The luminous statutes and regulations state: The Upper Perfected’s precious talismans may resolve the omen-body’s karmic entanglements and accumulated transgressions, dispelling trials of wind blades, water, and fire, the knife mountains and fire realms of the twenty-four peaks, and the punishments of the Three Paths and Five Sufferings—bearing stones to fill rivers. Those who wear this talisman shall transcend the Eight Difficulties. All scholars of the highest learning, whose names are inscribed upon the purple tablets and who have not yet fully received the great scriptures, may also singly employ this talisman to resolve karmic roots, avert calamities, extend life, and anticipate divine immortality. On the day of separate transmission, one is permitted to offer two taels of gold and forty feet of purple silk as a pledge to the Nine Heavens, with the oath and purification rites observed as prescribed. The transmission shall then be reverently received.\n\nThis covenant may also collectively transmit all scriptures, serving as a unified oath for them. Though other scriptures each have their own covenants, the *Four Ultimates* governs all, encompassing the myriad traditions.\n\n**Conclusion of the Black Contract of the Shangqing Talismanic Writs for Wearing**\n**The Yellow Contract of the Shangqing Talismanic Writs for Wearing**\n**The Writ of the Upper Prime for Celestial Inspection**\n\nInscribe with azure ink upon nine feet of yellow silk and wear it upon the body. One must journey to the sacred peak of one’s destined life, offer libations to the Celestial Perfected, announce to the Nine Mysteries, and pledge to the Five Numinous Ones before donning it. If the Dao has not descended after nine years, make two copies in accordance with the rites, perform libations to the sacred peak, and then to Heaven. Upon completion, burn them, scattering the ashes into the azure vapors of the sky. Bury one copy at the sacred peak of one’s destined life, nine feet deep—thus announcing above to the Nine Heavens, below to the Five Sacred Peaks and numinous mountains, and in the midst to the myriad spirits, thereby securing eternal life.\n\n**The Writ of the Middle Prime for Inspecting the Immortal Perfected**\nAlso named the *Three Primes’ Chapter of the Supreme Perfected’s Yin-Yang Numinous Register*, it is the hidden script of the Three Heavens and Nine Numinous Ones. Heaven and Earth possess the great reckoning of kalpas; after eight thousand kalpas, this writ appears but once. Three hundred *zhifu* of the Three Primes’ Mystic Terrace and ninety-one jade maidens bear it. Those who wear it shall have all spirits of their form bestowed with the natural title of Jade Immortal.\n\n**The Nine Numinous Hidden Script of the Supreme Perfected’s Three Primes for Inspecting Immortal Qi**\nInscribed upon the Western Sand Square Terrace, it was received by the Yellow Supreme Perfected of the Upper Prime of the Southern Culmen, who assists the celestial qi and inspects immortal souls. Those who wear this writ shall have the Upper Prime’s immortal officials arrive at their court. After a hundred days of secluded meditation, they shall behold the Lord of the Upper Prime, who will bestow upon them the true scriptures, enabling them to naturally ascend and fly to the Shangqing Palace. Without this writ, one may not practice the Dao or summon celestial perfected beings, lest misfortune befall the body.\n\n**The Purple Silk Writ of the Three Primes’ Great Lords for Generating True Qi and Inspecting Immortals**\nThis is the hidden script of the Three Primes’ Terrace. Upon wearing it and entering seclusion to meditate upon the true for nine days, impure qi dissipates, and the true appears of itself. The Three Primes’ Great Lords shall bestow the true scriptures, and after nine years, one shall gain the ability to fly through the air. Without this writ, one may not practice the immortal Dao, summon immortal officials, or avoid misfortune befalling the body.\n\n**The Flying Celestial True Writ of the Supreme Highest’s Generative True Writ for Inspecting Immortal Qi in the Purple Tenuity Palace**\nWhen the great kalpa of Heaven and Earth cycles, this writ appears within the chambers of the Five Sacred Peaks. Those who wear it and enter seclusion to meditate upon the Three Primes for a hundred days, maintaining pure focus without distraction, shall behold true spirits descending to their form. They shall command immortal officials and acquire natural objects, but must carefully avoid the defilements of life and death. Without this writ, one may not practice the immortal Dao or rashly summon celestial perfected beings, lest one’s body perish without attaining immortality.\n\n**The Supreme Mystic Jade Contract of the Three Primes**\nEngraved within the Northern Chamber of the Numinous Capital, its celestial script of jade characters spans a foot in size. Seven hundred *zhifu* and eighty-two jade maidens bear it. After wearing this writ for a hundred days and meditating with purity upon the Three Primes, one shall naturally comprehend the celestial sounds. Without this writ, one may not rashly practice the flying immortal Dao, lest misfortune befall the seven ancestors, and one forfeit the rank of immortality.\n\n**The Flying Celestial Contract of the Purple Tenuity Mystic Palace**\nEngraved upon the Terrace of the Morning Lamp, it illuminates the Nine Heavens above. The Celestial Venerable of Primordial Beginning in the Supreme Clarity’s Upper Palace bestowed it upon the Queen Mother of the West to summon the officials of the Five Sacred Peaks and the numinous immortals of mountains and seas. With a pure heart and tranquil focus, after a hundred days one shall behold the spirits and naturally know the hidden names of the Nine Heavens. Those who wear it shall attract immortal officials. Without this writ, one may not recite the *Supreme Scripture for Dispelling Demons*, lest great misfortune befall the body. Exercise caution.\n\n**The Flying Celestial Middle Writ for Inspecting Immortals**\nEngraved upon the Three Primes’ Terrace, it was transmitted by the Venerable Lord of Myriad Beginnings to the Supreme Highest, for summoning immortals and attracting the true. The recipient must perform rites at the Five Sacred Peaks for a hundred days, meditating with purity until a three-headed spirit descends to their chamber. Without this writ, one may not rashly seek immortality on the eight solar terms, lest misfortune befall the body. Those who wear it shall attain communion with divine perfected beings and be attended by twelve jade lads, who shall transmit their recitations to be heard in the Nine Heavens. Revealing it lightly shall incur the punishment of the seven ancestors, and the Five Sacred Peaks shall dispatch demonic spirits to interrogate the sinful soul.\n\n**The Nine Heavens’ Dragon Script of the Three Primes’ Empty Cavern Jade Contract for Flying Mystery**\nEngraved upon the gates of the Three Passes of the Nine Heavens, it governs the inspection of all celestial perfected beings. Those who recite the Nine Heavens’ Supreme Scripture without possessing this writ shall be punished by the Nine Heavens’ *Censor of Deceit*. Those who wear this writ shall have the Nine Heavens’ Chancellor summon and inspect the celestial primes, commanding immortal officials. After meditating with purity for a year, they shall behold the Nine Heavens’ True King, or a nine-headed figure riding a nine-colored phoenix, descending to their form. Upon seeing this, do not fear—this is the Nine Heavens’ True King who registers the supreme perfected. Simply prostrate facing south and beseech the divine immortals, and one shall naturally receive the Nine Heavens’ scriptures. Without this writ, one may not rashly recite the *Thirty-Nine Chapters of the Great Cavern True Scripture*, lest the nine ancestors be punished and one’s body be censured by Heaven for the crime of deceit.\n\n**The Primordial Beginning’s Empty Cavern Flying Celestial Middle Writ of the Three Primes’ Jade Contract**\nThe Celestial Venerable of Primordial Beginning engraved it upon the Terrace of the Golden Casement. After ten thousand kalpas, it is transmitted but once. Upon beholding this writ, the Four Ultimates shall inscribe one’s name at Eastern Florescence. After wearing it and meditating with purity for three hundred days, without diverting the gaze or allowing the mind to wander, one shall behold the Celestial Venerable of Primordial Beginning. Upon seeing the Celestial Venerable of Primordial Beginning, one’s lifespan shall extend to ten thousand years. Without this writ, one may not enter the famous mountains, traverse the Five Sacred Peaks, or practice the flying immortal Dao. The Five Sacred Peaks shall reject one, and celestial demons shall assail the body, inevitably incurring great misfortune. Before receiving it, first examine one’s virtue and integrity, then wear it to obtain supreme auspiciousness. Do not wear it lightly, lest misfortune befall. Exercise caution.\n\n**The Supreme Perfected’s Golden Tiger Script of the Nine Heavens’ Upper Empty Cavern Hidden Writ**\nThe Nine Heavens’ Parents inscribed it upon the Terrace of the Phoenix’s Birth. Eight hundred *zhifu* bear it. Every nine thousand years, the Nine Heavens open once, and when they do, nine suns simultaneously illuminate the eastern sky. This writ shall then naturally manifest upon the southern window of those who have attained the Dao. If one possesses the mysterious name in the Emperor’s Register, the Four Perfected shall also descend to bestow it upon the body.\n\nHaving obtained this writ, refine the spirit through nine hundred days of concentrated meditation, and one shall behold the Nine Heavens’ Parents. Once the Nine Heavens’ Parents are seen, there shall be no more cycle of death and dissolution. To practice the myriad circuits of the Dao without this writ, invoking the ascent of celestial immortals, will inevitably incur misfortune upon the body, and one’s seven generations of ancestors shall be conscripted into servitude—furthermore, one shall not attain immortality.\n\nThe above is collated from the celestial registers and writs of the *Three Primordials Jade Registers Sutra*.\n\n**The Highest Jade Dawn’s Commanding Demon-Subduing Banner**\nThose who wear it shall govern the Central Yellow Emperor’s Demon-Spirit Great King. According to the original scripture, enter the chamber on the appointed day, face the Year-Star, recite the Central Melody, display the banner within the chamber, and place it in the center. Inscribe it in green upon yellow silk.\nThe above is from the *Scripture of the Subtle Melody*.\n\n**The Supreme Numinous Flying Jade Talisman**\nThe yang qi and yellow essence take flight as feathered script. Wearing it for nine years, one’s face shall radiate golden light; one may vanish while sitting or standing and soar through the Great Void. In practicing the Dao of flying steps, without this talisman, one cannot ascend to the Starry Keel or transcend the Nine Mysteries. The recipient shall pledge twelve feet of yellow brocade to Heaven. On the day of ascetic practice, inscribe the talisman upon the heart, and one shall then exhale qi to form clouds and ride them in flight. Inscribe it upon nine inches of yellow silk and wear it on the left elbow; the Six Jia and Twelve Spirits, along with twelve Jade Maidens of the Numinous Flight, shall attend the body.\nThe above is from the *Supreme Highest Nine Ways of Returning to the Origin and Flying Feather Scripture*.\n\n**The Yellow Emperor’s Talisman for Summoning Spirits, Attracting Perfected Ones, and Subduing Demons**\nInscribe it in vermilion upon a yellow wooden board, nine inches wide and twelve inches long. Place it in the center of the chamber. Engage in scriptural recitation and practice within the chamber for a hundred days, and one shall converse with divine beings. After two years, the chamber shall naturally generate clouds of crimson radiance. To summon Perfected Ones and Heavenly Immortals, inscribe it according to the method, face south with the talisman, and meditate with precision for a hundred days. The Perfected Ones shall descend in form, and immortals shall visit the chamber to transmit the Dao of divine perfection.\nThe above is from the *Scripture of Golden Perfection and Jade Radiance*.\n\n**The Red Emperor’s Bing-Ding Numinous Communion Jade Talisman**\nInscribe it in cinnabar upon yellow silk and wear it on the body. On Bing or Ding days, inscribe it in cinnabar upon yellow paper, face south, and ingest one talisman. After three years, the Jade Maiden of the Bing-Ding Red Jade shall descend and appear; the body shall attain numinous communion, perceiving all affairs within ten thousand *li* of the southern realm. The immortal officials of the Southern Marchmount shall naturally provide traveling kitchens. After nine years, the Red Emperor shall descend to the bedchamber, welcoming the adept with a flying chariot of cinnabar radiance to ascend to the Upper Clarity Palace.\nThe above is from the *Scripture of the Numinous Flight of the Six Jia*.\n\n**The Six Primordials’ Vast-Falling Morning Star Essence Talisman**\nTo summon the Perfected Ones and immortal officials of the Northern Marchmount, inscribe it in white upon black paper, face north, and ingest it. After a hundred days of refining demons, the immortal officials shall arrive at once, and Perfected Ones shall visit the chamber to transmit the elixir of divine immortality and converse with the adept. To subdue the demons of the Black Emperor, inscribe it in yellow upon a nine-inch black wooden board, face north for a hundred days, and the celestial demons shall be bound in form while myriad spirits shall perish of themselves. Practicing the Emperor’s Rites for seven years, one shall attain divine immortality and ascend to Heaven in broad daylight.\nThe above is from the *Scripture of the Seven Primordials*.\n\n**The Jade Clarity’s Floating-Radiance Canopy of the Flowering Heavenly Mystery, the Hidden Writ of the Golden Mystery’s Inner Text**\nThe Three Primordials of the Grand Simplicity received it from the Celestial King of the Primordial Beginning and transmitted it to the Jade Maiden of the Great Harmony. To practice the Dao of divine immortality, inscribe it in purple upon a yellow board and place it in the northwest to extinguish the demonic officials and retinue of the Grand Demon King of the Vast Emperor. It shall summon the immortal officials of the Northwest Realm of Blessed Virtue and the World of Extending Worthies. After twelve years, the Jade Maidens of the Upper Palace shall descend to the adept’s bedchamber to transmit the Dao of divine perfection. Furthermore, inscribe it in purple upon yellow silk and wear it while traveling to the Northwest Realm of Extending Worthies; then, the myriad spirits shall gird themselves in submission, and demon kings shall bow their heads in reverence. One shall ride a flying cloud and feathered canopy to roam the Jade Clarity Palace.\nThe above is from the *Scripture of the Jade Clarity’s Hidden Writ*.\n\n**The Northern Emperor’s Vast Numinous Demon-Slaying Ghost-Killing Jade Writ**\nReceived from the Highest Three Heavens, guarded by twenty-six Jade Maidens of the Great Mystery, it is also called the *Mighty Divine Jade Strategy*, worn by the Demon-Quelling King of Jade Clarity. To slay ghosts of Ren and Gui days, inscribe it in green upon yellow silk, twelve inches long and three inches and two *fen* wide. On Ren days, place it upon the central Wu; on Gui days, place it upon Ji. Hold the breath for twelve cycles, knock the teeth thirty-six times, and recite the incantation:\n*\"Heaven topples, earth surges; the four seasons seize their light. The five phases hasten their reckoning, inspecting and fixing the ten directions. The Celestial Emperor ascends his throne; the August Elder emerges from his chamber. By the command of the Highest, the sound severs without refuge. First execute the ghostly wretches, then sever the multitude of malevolence. A thousand demons, ten thousand trials—none shall not submit and descend. All shall conform to the Jade Writ. The flowing bells of the eight thoroughfares, the vast-falling stars cast in exchange, mountains and peaks collapse and crumble. Obey Heaven and follow the mandate; the Earls and Scribes shall share in the merit.\"*\nConclude by drawing in the breath twelve times and swallowing it. Practicing this for twelve days, the demonic kind shall be extinguished, and the multitude of malevolent spirits shall lose their essence. Inscribe it in green upon yellow silk and wear it while traveling the world; myriad ghosts shall flee of themselves, and a thousand demons shall conceal their traces. After twelve years, one shall naturally gain the service of nine Jade Maidens of the Azure Waist.\nThis talisman is from the *Scripture of the Jade Clarity’s Hidden Writ*.\n\n**Here concludes the Jade Writs and Yellow Pledge Scripts of the Highest Clarity.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清佩符文诀 经名：上清佩符文诀。 撰人不详，约出於唐宋间。 据《宋史·艺文志》着录，原本有五卷，复分作五种。 即《上清佩符文青券诀》、《白券诀》、《绛春诀》、《黑券诀》、《黄券诀》。 今合并为一。 底本出处：《正统道藏》洞玄部玉诀类。 上清佩符文青券诀 九天真书元始检地录 三元玄台玉检紫文，一名九天真书元始检地之录，一名三元虎书，一名飞天上真以告六天万灵之精，制山川，检九地之灵，佩文役使玉女九十人，太平得迎圣君於上清宫。 受者当以黄笔书青缯上，祭之於本命之岳，然后佩身九年。 未升天当又书一通烧之，令灰扬於青烟之霄，又书一通埋之本命之岳，履河源，制地灵，使万神，九年得乘三元之軿，上升三元之宫。 不冒秽入殗，触性天真，轻告宣露，七祖充责，身亡失仙。 右出《三元玉检经》。 凤文赤书符 太上道君谓太极真人曰：子位登太极，领括神宗，虽有金简玉格，而无凤文之章，故不得辄登玉清，上诣三元，今以相告，子勤奉焉。 凤气隐音玉字九十一 佩之者神仙，行之者成真人，奉之者禳患，若能长斋苦行，栖身幽阜，诵咏万徧，则策龙驾虚，上登玉清。 右出《紫凤赤书经》。 高上玉晨命魔灵幡 佩之者主制东方青帝魔灵大王，法依日入室东向，诵青帝曲，施幡於室内，安东方，白书青缯上。 神虎真符 有神虎真符，威馘六天，以制天地神灵，便得摧折千精，佩之则万鬼灭形，众魔不侵。 佩之而进，得以朝玉皇，礼之於寝，则众真诣其房。 神虎上符 佩此符可以经危冒睑，越山跨海，召神制鬼，封赏灵岳，所之所向，千妖伏侧，万灵束形，群仙侍卫，身生异光。 右出《太上八术隐文经》。 青帝碧霞流铃登空步虚上符 东方青帝元洞元明元曜延灵耀元君各九千人、青阳玉童九十人侍文左，东岳太山仙官二千四百人、青腰玉女九十人侍文右，卫佩符者身。 赤帝丹霞流铃登空步虚上符 南方赤帝大洞元生大灵机皇君，各八千人、绛宫玉童八十人侍文左，南岳霍山仙官二千四百人、太丹赤圭玉女八十人侍文右，卫佩符者身。 白帝素震流铃登空步虚上符 西方白帝金城耀元元导太仙君各六千人、耀灵元化玉童六十人侍文左，西岳华山仙官二千四百人、太素玉女六十人侍文右，卫佩符者身。 黑帝绿霞流铃登空步处上符 北方需帝玄洞元阴五耀延灵元华郁单君各五千人，皇机太极玉童五十人待文左，北岳常山仙官二千四百人、太玄玉女五十人侍文右，卫佩符者身。 黄帝苍震流铃登空步虚上符 中央黄帝中耀五阳五阴中皇洞极高皇君各千二百人、皇机执忠玉童十二人侍文左，中岳嵩山仙官二千四百人、黄素玉女十二人侍文右，卫佩符者身。 五帝流铃五符，威制极天之魔，召摄五方神灵，上应五晨豁落七元，下应人身九孔七明，周天竟地，靡有不关，无幽不测，无细不监，存符则光见，掷符则振灵，子若佩之，受师口言。 右五帝符，出《紫度炎光经》上，男以青为地丹书文佩之左，女以黄书帛素佩之右。 玉清郁悦那林昌玉台天九晖大晨隐书金玄内文 凡修神仙之道，当以白书青板上，置东方，灭青帝大魔王官属，招致东方仙官。 行之九年，则青真上圣皇上丈人降形於兆身，役使仙官，取自然灵药。",
      "translated_text": "**The Writs of Jade Talismans for Upper Clarity**\n\n**Title:** *The Writs of Jade Talismans for Upper Clarity*\nAuthor unknown, likely composed between the Tang and Song dynasties. According to the *Song History: Treatise on Arts and Letters*, the original text comprised five scrolls, later divided into five works: *The Writs of the Azure Tallies for Upper Clarity*, *The Writs of the White Tallies*, *The Crimson Spring Writs*, *The Writs of the Black Tallies*, and *The Writs of the Yellow Tallies*. Here, they are presented as one. The base text is from the *Daoist Canon of the Zhengtong Era*, under the Jade Writs section of the Cavern Mystery Division.\n\n---\n\n### **The Writs of the Azure Tallies for Upper Clarity**\n\n**The Primordial Record of the Nine Heavens’ True Writs, Inscribed by the Originator to Examine the Earth**\nThe Three Origins’ Mystic Terrace Jade Tallies and Purple Writs—also called *The Primordial Record of the Nine Heavens’ True Writs, Inscribed by the Originator to Examine the Earth*, or *The Three Origins’ Tiger Writs*, or *The Flying Heavenly Perfected’s Proclamation to the Essences of the Six Heavens and Myriad Spirits*—govern mountains and rivers, inspect the spirits of the Nine Lands, and command ninety Jade Maidens. Through this, one may welcome the Sagely Lord in the Palace of Upper Clarity during the Great Peace. The recipient must transcribe it with a yellow brush upon azure silk and offer it in sacrifice at the sacred peak of their natal destiny. They shall then wear it for nine years. If they have not yet ascended to heaven, they must transcribe another copy, burn it, and scatter the ashes into the azure mist of the clouds. They shall transcribe yet another copy and bury it at the sacred peak of their natal destiny, tread the sources of the rivers, govern the earth’s spirits, and command the myriad gods. After nine years, they will ride the chariot of the Three Origins and ascend to the Palace of the Three Origins. If one defiles it with impurity, offends the celestial perfected, or carelessly reveals its proclamations, their seven generations will bear blame, their body will perish, and they will lose immortality.\n*From the* Scripture of the Three Origins’ Jade Tallies.\n\n---\n\n### **The Vermilion Writs of the Phoenix Script**\n\nThe Supreme Dao Lord addressed the Perfected of the Great Ultimate: \"Though your rank has ascended to the Great Ultimate and you oversee the divine lineage, without the chapters of the Phoenix Script, you may not casually ascend to Jade Clarity or visit the Three Origins. I now impart this to you—diligently uphold it.\"\n\n**The Nine-One Hidden Tones of the Jade Characters of the Phoenix’s Qi**\nThose who wear it become divine immortals; those who practice it attain perfectedhood; those who revere it ward off calamities. If one maintains a perpetual fast, engages in ascetic practice, dwells in secluded heights, and recites it ten thousand times, they will spur dragons to drive the void and ascend to Jade Clarity.\n*From the* Scripture of the Purple Phoenix and Vermilion Writs.\n\n---\n\n### **The Supreme Jade Dawn Banner for Commanding Demon-Spirits**\n\nThose who wear it master the Great Demon-Spirit King of the Eastern Azure Emperor. The method requires entering a chamber at sunset, facing east, reciting the Azure Emperor’s hymn, and displaying the banner within the room, placing it in the east. It is inscribed in white upon azure silk.\n\n---\n\n### **The True Talisman of the Divine Tiger**\n\nThere is the True Talisman of the Divine Tiger, which subdues the Six Heavens and governs the spirits of heaven and earth, enabling the destruction of a thousand essences. When worn, all ghosts vanish, and no demon dares invade. Advancing while wearing it allows one to audience with the Jade Emperor; venerating it in one’s chamber summons the host of perfected to their abode.\n\n---\n\n### **The Supreme Talisman of the Divine Tiger**\n\nWearing this talisman allows one to traverse perilous passes, cross mountains and seas, summon spirits, command ghosts, and bestow seals upon sacred peaks. Wherever one goes, a thousand demons prostrate themselves, ten thousand spirits bind their forms, and a",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1292,
      "start_sentence": 0,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.631288051605225,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "又以白书青缯佩身，行来东方，则致安大堂乡钠善之世界大魔王，束带稽首礼迎，仙官待卫，人东岳则致青云羽盖，九年飞行上清。 右出《玉清隐书经》。 七元豁落镇星精符 欲致中岳真人仙官，以朱书黄纸，向太岁上服之，精思百日，仙官立到，真人诣房，授兆神仙之药，五老真书。 欲制黄帝之魔，以青书黄木九寸板上，安於太岁之上，百日天魔束形，万精自丧。 帝皇之章，行之七年，神仙飞行。 右出《七元经》。 东蒙隐文真书 雌黄书碧缯上，佩身则得游行东方呵罗提之国，制群灵，斩天魔，伏五兵，游名山，胡老扶迎，自知六国之音，与神共言。 南方支音内文 雌黄书碧缯上，佩身则游行伊沙他之国，制群灵，斩天魔，伏五兵，游名山，越老之官扶将送迎，自知六国之音，与神共言。 西混青洞隐元内文 雌黄书碧缯上，佩身则得游入尼维罗绿那之国，制群灵，斩天魔，伏五兵，出玄路，入三清，游名山，氐老扶迎，自知六国之音，与神共言。 北九灵丈金音内文 雌黄书碧缯上，佩身则得游入旬他罗之国，制群灵，斩天魔，伏五兵，登广寒，谒北精，游名山，羌老扶迎，自知六国之音，与神共言。 上清苞元隐箓内文 雌黄书碧缯上，佩身则得上游元精青沌自然之国，制群灵，斩天魔，伏五兵，步空天，升玉清，游名山，万真扶迎，自然知六国之音，与神共言。 中化灵总真众内文 雌黄书碧缯上，佩身则得游涉太和宝真无量之国，制群灵，斩天魔，伏五兵，入洞渊，升玄冥，戏北元，谒紫庭，游名山，则五老扶迎，自然知六国之音、与神共言。 高上入六国内隐之文，授於上相青童君，合有一百八十五字，雌黄书碧缯佩身，项生宝光，映照十天，役使玉童玉女各三十六人，游行五岳，涉诸名山，入六国，履河源，所在群仙五方之官皆来稽首，沿界司迎，威六国，伏五兵，变化无方，随意所从，降致飞轮丹霄紫轩，来迎我上升东华青宫。 佩此文游行六国，履涉五岳，历诸名山，至界首当先叩齿三十六通，闭气三十六息，祝曰： 玉真徘徊，云驾昂昂，是日上吉，龙飞凤翔，列行羽仪，四道开张，六师启导，十界来迎，仙童执旛，玉女散香，五老稽首，翼翼翔翔，日月交带，灵仙扶将，履历诸国，周流四乡，四渎五岳，为我桥梁，帝君使命，扫除不祥，诸神之造，靡不吉良，神奇万异，仙炼内昌，外国洞朗，上造玉京。 毕，引气三十六咽止，此上相出游威神大祝，行之制六国，伏万灵，致仙官，来朝形，变化无方，上升太清。 右出《外国放品经》。 上灵飞玉符 玄仙羽精，自然之章，佩之七年，乘空飞行，上登七元。 登修之日，书左手掌心，即握碧霞而飞行，书青缯九寸佩之，左统六甲十二神，玉女十二人侍右。 一元豁落日精之符 朱书白纸，束向服之，精思百日，真人降房，与兆共言。 欲制魔精，青书黄木板长九寸上，着月建上，天魔自消，万精束形。 帝皇之章，慎勿泄扬，秘而奉修，十年飞仙。 三元豁落岁星精符 以黑书青纸，东向服之，精思百日，仙官立到，真人诣房，赐兆神仙之药。 欲制青帝之魔，以白书青木板长九寸上，安东面百日，天魔束形，万精自丧。 帝皇之章，秘而修行，七年飞仙。",
      "translated_text": "### **The Supreme Talisman of the Divine Tiger** *(continued)*\n\nInscribe in white upon azure silk and wear it upon the body; when traveling eastward, one shall summon the Great Peace of the World of Na Shan, where the Demon King of the Six Heavens will gird his sash, bow in reverence, and offer welcome. The immortals shall attend as guards, and upon entering Mount Tai, one shall be borne aloft by a canopy of azure clouds and, after nine years, ascend to the Upper Clarity.\n\n*Recorded in the* **Hidden Writ of Jade Clarity**.\n\n---\n\n### **The Talisman of the Seven Luminaries and the Star of Pacification**\n\nTo summon the Perfected and immortals of the Central Marchmount, inscribe in vermilion upon yellow paper, face the Year-Star, and wear it. Cultivate with focused intent for a hundred days, and the immortals shall arrive at once; the Perfected shall visit your chamber to bestow the elixir of transcendence and the Five Elders’ sacred writ.\n\nTo subdue the demons of the Yellow Emperor, inscribe in azure upon a nine-inch yellow wooden tablet and place it above the Year-Star. After a hundred days, the celestial demons shall bind their forms, and the myriad spirits shall perish of themselves. The **Imperial August Script**, practiced for seven years, enables flight as an immortal.\n\n*Recorded in the* **Scripture of the Seven Luminaries**.\n\n---\n\n### **The Hidden Writ of the Eastern Mons**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then wander the land of Ahaluoti in the east, subdue the host of spirits, behead celestial demons, tame the Five Weapons, and roam the famed mountains. The Hu Elders shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Inner Writ of the Southern Branch Tone**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then wander the land of Yishata, subdue the host of spirits, behead celestial demons, tame the Five Weapons, and roam the famed mountains. The Yue Elders’ officials shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Inner Writ of the Western Primordial Azure Grotto**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then enter the land of Nivīlu Lüna, subdue the host of spirits, behead celestial demons, tame the Five Weapons, traverse the Dark Path, enter the Three Clarities, and roam the famed mountains. The Di Elders shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Inner Writ of the Northern Ninefold Numinous Golden Tone**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then enter the land of Xuntaluo, subdue the host of spirits, behead celestial demons, tame the Five Weapons, ascend the Vast Cold, pay homage to the Northern Essence, and roam the famed mountains. The Qiang Elders shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Hidden Register of the Primordial Embrace of Upper Clarity**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then ascend to the land of the Primal Essence and Azure Chaos, subdue the host of spirits, behead celestial demons, tame the Five Weapons, tread the void heavens, ascend to Jade Clarity, and roam the famed mountains. The myriad Perfected shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Inner Writ of the Central Transformation and the Assembly of Perfected Multitudes**\n\nInscribe with orpiment upon green silk and wear it upon the body; one may then traverse the land of the Great Harmony and the Treasure of the Boundless Perfected, subdue the host of spirits, behead celestial demons, tame the Five Weapons, enter the Grotto Abyss, ascend the Dark Obscurity, sport in the Northern Primordial, pay homage to the Purple Court, and roam the famed mountains. The Five Elders shall come to escort and welcome, and one shall naturally comprehend the tongues of the Six States, conversing with the gods as equals.\n\n---\n\n### **The Hidden Writ of Entry into the Six Lands**\n\nBestowed by the Most Exalted Lord of the Azure Lads, this writ comprises one hundred and eighty-five characters. Inscribe with orpiment upon green silk and wear it upon the body; a radiant halo shall emanate from the nape, illuminating the Ten Heavens. One may command thirty-six Jade Lads and thirty-six Jade Maidens, traverse the Five Marchmounts, cross the famed mountains, enter the Six Lands, tread the sources of the rivers, and wherever one goes, the immortals and officials of the Five Directions shall come to bow in reverence, while the border guardians shall welcome and escort. One shall overawe the Six Lands, subdue the Five Weapons, and transform without limit, following one’s will. Descending chariots of flying wheels and the Purple Carriage of the Cinnabar Empyrean shall come to welcome one’s ascent to the Azure Palace of Eastern Florescence.\n\nWhen wearing this writ to traverse the Six Lands, tread the Five Marchmounts, and cross the famed mountains, upon reaching a border, first knock the teeth together thirty-six times, hold the breath for thirty-six cycles, and recite the incantation:\n\n*\"The Jade Perfected wander in circles,\nCloud chariots soar on high.\nThis day is most auspicious,\nDragons take flight, phoenixes soar.\nArrayed in feathered regalia,\nThe Four Paths open wide.\nThe Six Hosts begin their march,\nThe Ten Realms come to welcome.\nImmortal lads bear the banners,\nJade maidens scatter incense.\nThe Five Elders bow in reverence,\nWinged and soaring in formation.\nSun and moon intertwine as sashes,\nDivine immortals come to escort.\nTraversing the myriad lands,\nCircling the four directions,\nThe Four Waterways and Five Marchmounts\nBecome my bridges and beams.\nBy the Emperor’s decree,\nSweep away all inauspiciousness.\nAll divine manifestations\nShall be most propitious.\nA myriad wonders arise,\nThe immortal’s inner cultivation flourishes.\nForeign lands grow bright and clear,\nAscending to the Jade Capital.\"*\n\nUpon completion, draw in the breath and swallow thirty-six times. This is the **Great Invocation of the Most Exalted Lord’s Wandering Might**. Practicing it subdues the Six Lands, tames the myriad spirits, summons the immortals to appear, and enables transformation without limit, ascending to the Great Clarity.\n\n*Recorded in the* **Scripture of the Foreign Lands’ Emanations**.\n\n---\n\n### **The Jade Talisman of the Soaring Numinous Flight**\n\nThe **Script of the Dark Immortals and Feathered Essences**, a writ of spontaneity. Wearing it for seven years enables flight through the void, ascending to the Seven Luminaries.\n\nOn the day of ascent, inscribe it upon the left palm, grasp the Azure Radiance, and take flight. Alternatively, inscribe it upon a nine-inch green silk and wear it on the left; one shall command the Six Jia and the Twelve Spirits, with twelve Jade Maidens attending on the right.\n\n---\n\n### **The Talisman of the Sun Essence of the First Luminary**\n\nInscribe in vermilion upon white paper, face the direction of the current month’s station, and wear it. Cultivate with focused intent for a hundred days, and the Perfected shall descend to your chamber to converse with you.\n\nTo subdue demonic essences, inscribe in azure upon a nine-inch yellow wooden tablet and place it above the current month’s station. The celestial demons shall vanish of themselves, and the myriad spirits shall bind their forms. The **Imperial August Script** must not be recklessly divulged; keep it secret and practice it faithfully, and after ten years, one shall fly as an immortal.\n\n---\n\n### **The Talisman of the Year-Star Essence of the Three Luminaries**\n\nInscribe in black upon green paper, face east, and wear it. Cultivate with focused intent for a hundred days, and the immortals shall arrive at once; the Perfected shall visit your chamber to bestow the elixir of transcendence.\n\nTo subdue the demons of the Azure Emperor, inscribe in white upon a nine-inch green wooden tablet and place it facing east for a hundred days. The celestial demons shall bind their forms, and the myriad spirits shall perish of themselves. The **Imperial August Script** must be kept secret and practiced faithfully; after seven years, one shall fly as an immortal.",
      "overlap_context": "vanish, and no demon dares invade. Advancing while wearing it allows one to audience with the Jade Emperor; venerating it in one’s chamber summons the host of perfected to their abode.\n\n---\n\n### **The Supreme Talisman of the Divine Tiger**\n\nWearing this talisman allows one to traverse perilous passes, cross mountains and seas, summon spirits, command ghosts, and bestow seals upon sacred peaks. Wherever one goes, a thousand demons prostrate themselves, ten thousand spirits bind their forms, and a",
      "start_char": 1292,
      "end_char": 2561,
      "start_sentence": 42,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.27403903007507,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右出《七元经》。 青帝招灵致真摄魔之符 佩之八年，帝降八舆之轮，下迎兆身，白日升天。 九天之秘，信当宝密，修行其道，道无不降，仙无不成。 以黑书青板上，令广九寸，长一尺二寸，安室东面，修行诵经。 右出《金真玉光经》。 黑帝壬癸通灵玉符 黑书青缯佩身，又以壬癸日黑书青纸上，北向服一枚，三年壬癸，太玄玉女降见，兆身通灵，知北方万里之事，致北岳仙官送自然之厨，九年黑帝降於寝房，迎以黑霞飞轮，上升上清宫。 右出《灵飞六甲经》。 赤天玄黄正法除六天文 玄黄飞玄之气结成玉文，佩者与三气同真，匡制六天，检气摄魔，馘斩千凶，威御群灵，入出水火，万灾不伤。 右出《三天正法经》。 玉清单绿察宝轮法天 高上龙烟隐书金玄内文 后圣九玄金阙帝君受之於高元灵皇停景君，以传上相青童君。 当以黄书绿板上，置西南方，以灭黄帝大魔王官属，招致西南方延福乡仁静之世界黄帝仙官，九年则八帝值真王仙官降形於兆身，授兆飞仙灵药，七十四变炼化兆身。 又以黄书绿纹上佩身，行之西南延福世界，则万灵束带，魔王稽首礼迎，三元降下飞舆琼轮，迎兆登三元之房也。 玉清贝渭邪渠初默天合晖晨命隐书金玄内文 扶桑大帝受之於太霄真王。 行神仙之道，当以黄笔书苍板上，置东南，以灭昱帝大魔王官属，招致东南元福田用贤世界昱帝仙官，十五年则致玉女二十人给兆驱使，取自然灵药。 又以黄书绿纹上佩身，东南行之用贤世界，则万灵东带，魔王稽首礼迎，得乘绿云羽盖，飞行玉清宫。 北帝洞灵灭魔杀鬼玉文 受之於高上三天，卫以黄素玉女十二人，一名神灭灵策，高上玉帝君所佩。 欲杀戊己日鬼，白书青素上，长一尺二寸，广三寸二分，戊日安东方甲上，己日安乙上，闭气九息，叩左齿三十六通，祝曰： 黄中理命，制命九天，三灵应符，五老校仙，促检北帝，束送魔身，群凶冥目，不得推延，上帝所告，捕追无亲，敢有越逸，急制酆山，明如帝信，上对玉晨。 毕，引气九咽止，行之九日，鬼魔皆束形见影，受事於眼前，万魔灭种，群妖丧精，白书青缯上，佩身游行天下，万鬼伏窜，千妖匿影，不敢干犯，九年自得役使素灵玉女七人。 右符出《玉清隐经》。 上清佩符文青券诀竟 上清佩符文白券诀 太上甲乙入木九气班符 学者服其符以招其神，存其气以降其真，求削水帝之简，上名玉札之篇。 依经存思诵祝，行之九年，则能书符投山，山降云雨，书於木，削之不灭，其文转明，带符抱木，身成山林。 埋符东岳，东岳卫以仙官十二人，一十八年则能飞行上清。 轻泄此道，罚以鬼兵，殃延七祖，身没河源。 太上丙丁入火三气班符 学者服其符以招其神，存其气以降其真，削除水帝之简，上名玉札之篇，依经存思诵祝，行之九年，则能书符投林，林自生火，书符投水，水出蛟龙，投山山降云雨。 埋符南岳，仙官侍卫形身。 一十八年则能飞行玉清。 轻泄此道，殃延七祖，身没鬼官，长闭地狱，不得升仙。 太上庚辛入金七气班符 学者服其符以招其神，存其气以降其真，削除水帝之简，上名玉札之篇。 按经修念诵祝，行之九年，则能书符於石，炼石成金，书符抱石，石隐兆形。 埋符西岳，仙官降致自然神奇异物。",
      "translated_text": "**The Talisman of the Azure Emperor for Summoning Spirits and Subduing Demons**\n\nWear this for eight years, and the Emperor shall descend in an eight-chariot procession to welcome your body, ascending to heaven in broad daylight. The secrets of the Nine Heavens must be treasured and kept confidential; cultivate its Way, and the Dao shall descend without fail, immortality shall be attained without exception. Inscribe in black upon a green tablet, nine inches in width and twelve inches in length, and place it facing east within your chamber while cultivating and reciting the scripture.\n\n*From the* **Scripture of the Golden Perfected and Jade Radiance**.\n\n---\n\n**The Black Emperor’s Talisman of Ren and Gui for Communing with Spirits**\n\nInscribe in black upon green silk and wear it on your person. On Ren or Gui days, inscribe in black upon green paper, face north, and ingest one talisman. After three years of Ren and Gui, the Jade Maiden of the Great Mystery shall descend and appear, your body shall commune with spirits, and you shall know all affairs within ten thousand *li* of the northern direction. The immortal officials of the Northern Peak shall present the natural alchemical kitchen. After nine years, the Black Emperor shall descend to your bedchamber, welcoming you with a black mist and a flying chariot to ascend to the Supreme Clarity Palace.\n\n*From the* **Scripture of the Six Jia of the Numinous Flight**.\n\n---\n\n**The Correct Method of the Red Heaven’s Mysterious Yellow for Eliminating the Texts of the Six Heavens**\n\nThe qi of the Mysterious Yellow and Flying Mystery coalesces into jade script. Those who wear it shall unite with the Three Qi in perfection, rectify the Six Heavens, restrain qi, and subdue demons, beheading a thousand evils, wielding awe over the multitude of spirits, entering and exiting water and fire without harm from the myriad calamities.\n\n*From the* **Scripture of the Correct Methods of the Three Heavens**.\n\n---\n\n**The Jade Clarity’s Single Green Wheel for Inspecting Treasures**\n\n**The Hidden Script of Golden Mystery Inscribed by the Dragon Smoke of the Supreme**\n\nThe Nine Mysteries Lord of the Golden Palace of the Later Sage received this from the Linghuang of the High Prime. It was transmitted to the Minister of the Upper Prime, the Azure Youth. Inscribe in yellow upon a green tablet and place it in the southwest to extinguish the great demon king of the Yellow Emperor and his retinue, summoning the immortal officials of the Yellow Emperor from the World of Extended Blessings in the southwest. After nine years, the Eight Emperors and the Perfected Kings of the True Worth shall manifest in your body, bestowing upon you the elixir of flying immortality, refining and transforming your body through seventy-four transmutations.\n\nAlternatively, inscribe in yellow upon green silk and wear it on your person. Travel to the World of Extended Blessings in the southwest, and the myriad spirits shall gird themselves in submission, while the demon kings shall bow their heads in reverence. The Three Primes shall descend in flying chariots of jade wheels to welcome you into the chambers of the Three Primes.\n\n**The Hidden Script of Golden Mystery of the Jade Clarity’s Conch River, Evil Channel, and the Dawn Mandate of the Initial Silence of the Merging Radiance of Heaven**\n\nReceived by the Great Emperor of Fusang from the Perfected King of the Great Empyrean. To practice the Way of divine transcendence, inscribe in yellow upon a dark green tablet and place it in the southeast to extinguish the great demon king of the Luminous Emperor and his retinue, summoning the immortal officials of the Luminous Emperor from the World of Worthy Fields in the southeast. After fifteen years, twenty jade maidens shall be dispatched to serve you, gathering natural spiritual medicines.\n\nAlternatively, inscribe in yellow upon green silk and wear it on your person. Travel to the World of Worthy Fields in the southeast, and the myriad spirits shall gird themselves in the east, while the demon kings shall bow their heads in reverence. You shall ride upon a green cloud and feathered canopy, flying to the Jade Clarity Palace.\n\n---\n\n**The Jade Script of the Northern Emperor for Annihilating Demons and Slaying Ghosts**\n\nReceived from the Supreme Three Heavens, guarded by twelve jade maidens of yellow silk, one named *Spirit-Extinguishing Numinous Strategy*, worn by the Lord of the Supreme Jade Emperor. To slay ghosts on Wu or Ji days, inscribe in white upon green silk, twelve inches in length and three inches and two *fen* in width. On Wu days, place it upon Jia in the east; on Ji days, place it upon Yi. Hold your breath for nine exhalations, knock your left teeth thirty-six times, and recite the incantation:\n\n*\"Within the Yellow Center, the mandate is ordered;\nThe mandate governs the Nine Heavens.\nThe Three Numinous respond to the talisman,\nThe Five Elders verify the immortals.\nHasten the Northern Emperor to restrain\nAnd deliver the demonic bodies.\nThe multitude of evils close their eyes,\nUnable to delay or evade.\nBy the command of the Supreme Emperor,\nPursue and capture without mercy.\nShould any dare to flee,\nSwiftly bind them to Feng Mountain.\nBright as the Emperor’s trust,\nFacing the Jade Dawn.\"*\n\nConclude by drawing in qi nine times and swallowing it. Practice this for nine days, and the demonic ghosts shall bind their forms and appear as shadows before you, submitting to your command. The myriad demons shall be extinguished at their roots, and the multitude of spirits shall lose their essence. Inscribe in white upon green silk and wear it on your person while traveling the world; the ten thousand ghosts shall flee in terror, and a thousand demons shall hide their traces, daring not to offend. After nine years, you shall naturally gain the service of seven jade maidens of pure spirit.\n\n*This talisman is from the* **Hidden Scripture of Jade Clarity**.\n\n---\n\n**The Jade Token Methods of the Upper Clarity Conclude Here**\n\n---\n\n**The White Token Method of the Upper Clarity’s Talismans**\n\n**The Nine Qi Talisman of Tai Shang Jia Yi Entering Wood**\n\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence, and seek to erase the tablets of the Water Emperor, inscribing their names upon the jade registers. In accordance with the scripture, visualize, recite, and invoke. After nine years of practice, you shall be able to inscribe talismans and cast them into mountains, causing mountains to send down clouds and rain. Inscribe upon wood, and though carved, the script shall not fade but grow ever brighter. Carry the talisman and embrace a tree, and your body shall become one with the mountain forests. Bury the talisman in the Eastern Peak, and the Eastern Peak shall guard you with twelve immortal officials. After eighteen years, you shall be able to fly to the Upper Clarity.\n\nRecklessly divulging this Way shall incur punishment by ghostly soldiers, calamity extending to seven generations, and your body shall sink into the river’s source.\n\n---\n\n**The Three Qi Talisman of Tai Shang Bing Ding Entering Fire**\n\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence, erase the tablets of the Water Emperor, and inscribe their names upon the jade registers. In accordance with the scripture, visualize, recite, and invoke. After nine years of practice, you shall be able to inscribe talismans and cast them into forests, causing forests to spontaneously ignite; cast them into water, and water shall produce dragons; cast them into mountains, and mountains shall send down clouds and rain. Bury the talisman in the Southern Peak, and immortal officials shall attend and guard your body. After eighteen years, you shall be able to fly to the Jade Clarity.\n\nRecklessly divulging this Way shall bring calamity upon seven generations, your body shall be consigned to the ghostly officials, and you shall be eternally confined to the earthly prisons, unable to ascend as an immortal.\n\n---\n\n**The Seven Qi Talisman of Tai Shang Geng Xin Entering Metal**\n\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence, erase the tablets of the Water Emperor, and inscribe their names upon the jade registers. In accordance with the scripture, cultivate, recite, and invoke. After nine years of practice, you shall be able to inscribe talismans upon stone, refining stone into gold; inscribe talismans and embrace stone, and the stone shall conceal your form. Bury the talisman in the Western Peak, and immortal officials shall descend to present natural and wondrous treasures.",
      "overlap_context": " a hundred days, and the immortals shall arrive at once; the Perfected shall visit your chamber to bestow the elixir of transcendence.\n\nTo subdue the demons of the Azure Emperor, inscribe in white upon a nine-inch green wooden tablet and place it facing east for a hundred days. The celestial demons shall bind their forms, and the myriad spirits shall perish of themselves. The **Imperial August Script** must be kept secret and practiced faithfully; after seven years, one shall fly as an immortal.",
      "start_char": 2561,
      "end_char": 3848,
      "start_sentence": 77,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.94036936759949,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "一十八年修行，则能乘空飞升玉清。 轻泄此道，罚以神兵，七祖负考。 太上壬癸入水五气班符 学者服其符以招其神，存其气以降其真。 按本文修念诵祝，行之九年，则能书符投水，水上蛟龙停流止波，入水如空。 埋符北岳，仙官降致神药不死之方。 一十八年坐在立亡，乘虚飞行，上升玉清。 其道高妙，不传非真，轻泄灵文，七祖负考，身没鬼官，长充幽徒，不得上仙。 太上戊己入土一气班符 学者服其符以招其神，存其气以降其真，削除水帝之简，上名玉札之篇。 按经修念诵祝，行之九年，知三十六国之音，知万渊之下三十六土皇形色，书符投土，形与土合。 埋符中岳，仙官侍卫，致自然之厨不死之药。 行之十八年，则能飞行玄空，上升玉京。 秘之神仙，轻泄九祖获考，身负三涂，充责幽山。 太上九源青气班符 立春春分日平旦，朱书青纸，东向服之。 依经存思：东海神王，削我死简，注我仙箓。 依法祝讫，投符东流之渊。 行之十八年，水帝注名玉清，降致龙軿，飞行太空。 太上洞元赤气班符 立夏夏至日正中，朱书青纸，南向服之。 按文存念：南海神王，削我罪简，注我仙箓。 依法祝讫，投符南流之渊。 行之十八年，神王列名於玉皇，降致云龙丹舆，飞行太空。 太上洞渊白气班符 立秋秋分日哺时，朱书青纸，西向服之。 行事存念：西海神王，削我罪简，注我仙箓，列奏玉帝之前。 依法祝讫，投符西流之渊。 行之十八年，海神卫迎，不拘水梁，降致龙舆，飞行太空。 太上洞川黑气班符 立冬冬至日夜半时，朱书青纸，北向服之。 依经存念：北海神王，削我罪简，注我玉篇。 依法祝讫，投符北流之渊。 行之十八年，命召水神，集十二蛟龙运水兴雨，使白日暗冥，飞行空虚。 右此九符出《九赤斑符经》。 太上三举方丈震灵之符 兆守雌一行大洞事者，常带此符於心前，朱书大小随意，常坐卧之，亦可内着褥中，带者令辟方四寸，坐者辟方三尺。 带此符使人长生不死，令人役使鬼神，北帝大魔王不敢试。 右出《大洞真经》。 太上宝章",
      "translated_text": "After eighteen years of cultivation, you shall ascend through the void to the Jade Purity. Should you recklessly disclose this Way, divine soldiers shall mete out punishment, and your seven generations shall bear the burden of judgment.\n\n**The Five Qi Talisman of Tai Shang Ren Gui Entering Water**\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence. Follow the original text in cultivation, recitation, and invocation. After nine years of practice, you shall inscribe talismans and cast them into water, whereupon dragons shall halt the flow and still the waves, and entering water shall be as traversing empty space. Bury the talisman in the Northern Peak, and immortal officials shall descend to bestow divine medicines and the formula of deathlessness. After eighteen years, you shall sit or stand at will, vanish and reappear, ride the void in flight, and ascend to the Jade Purity. This Way is lofty and wondrous; it is not transmitted to the untrue. Should you recklessly disclose its sacred writ, your seven generations shall bear the burden of judgment, your body shall be consigned to the ghostly officials, and you shall be eternally bound as a prisoner of the dark, unable to ascend as an immortal.\n\n**The One Qi Talisman of Tai Shang Wu Ji Entering Earth**\nScholars ingest this talisman to summon its spirit, visualize its qi to descend its perfected essence, erase the tablets of the Water Emperor, and inscribe their names upon the jade registers. In accordance with the scripture, cultivate, recite, and invoke. After nine years of practice, you shall comprehend the languages of the thirty-six nations and perceive the forms and hues of the thirty-six Earth Sovereigns beneath the ten thousand abysses. Inscribe talismans and cast them into earth, and your form shall merge with the soil. Bury the talisman in the Central Peak, and immortal officials shall attend and guard you, bestowing the natural kitchens and the medicine of deathlessness. After eighteen years of practice, you shall traverse the mysterious void in flight and ascend to the Jade Capital. Guard this as the secret of immortals; should you recklessly disclose it, nine generations shall bear the burden of judgment, your body shall endure the three paths of suffering, and you shall be consigned to the dark mountains as a prisoner.\n\n**The Nine Springs Azure Qi Talisman**\nOn the day of the Beginning of Spring or the Spring Equinox at dawn, write in cinnabar upon green paper, face east, and ingest it. In accordance with the scripture, visualize: the Spirit King of the Eastern Sea shall erase my death tablets and inscribe my name in the immortal registers. After reciting the invocation as prescribed, cast the talisman into the abyss of eastward-flowing waters. After eighteen years of practice, the Water Emperor shall inscribe your name in the Jade Purity and send down dragon chariots, enabling you to traverse the great void in flight.\n\n**The Cavernous Origin Crimson Qi Talisman**\nOn the day of the Beginning of Summer or the Summer Solstice at noon, write in cinnabar upon green paper, face south, and ingest it. Follow the text in visualization: the Spirit King of the Southern Sea shall erase my sin tablets and inscribe my name in the immortal registers. After reciting the invocation as prescribed, cast the talisman into the abyss of southward-flowing waters. After eighteen years of practice, the Spirit King shall list your name before the Jade Emperor and send down cloud-dragon cinnabar carriages, enabling you to traverse the great void in flight.\n\n**The Cavernous Abyss White Qi Talisman**\nOn the day of the Beginning of Autumn or the Autumn Equinox at dusk, write in cinnabar upon green paper, face west, and ingest it. Perform the visualization: the Spirit King of the Western Sea shall erase my sin tablets, inscribe my name in the immortal registers, and present it before the Jade Emperor. After reciting the invocation as prescribed, cast the talisman into the abyss of westward-flowing waters. After eighteen years of practice, the Sea Spirits shall welcome and escort you, unrestrained by water or bridges, and send down dragon carriages, enabling you to traverse the great void in flight.\n\n**The Cavernous River Black Qi Talisman**\nOn the day of the Beginning of Winter or the Winter Solstice at midnight, write in cinnabar upon green paper, face north, and ingest it. In accordance with the scripture, visualize: the Spirit King of the Northern Sea shall erase my sin tablets and inscribe my name in the jade registers. After reciting the invocation as prescribed, cast the talisman into the abyss of northward-flowing waters. After eighteen years of practice, you shall command the Water Spirits to assemble the twelve dragons to channel water and summon rain, darkening the bright day, and traverse the empty void in flight.\n\nThese nine talismans derive from the *Scripture of the Nine Crimson Talismans*.\n\n**The Talisman of Tai Shang’s Three Ascents to Fangzhang and the Thunderous Spirit**\nThose who guard the feminine unity and practice the Great Cavern Way shall constantly wear this talisman over the heart, written in cinnabar of any size as desired. It may be worn while sitting or lying down, or placed within bedding. When worn, it repels evil for four inches around the body; when sat upon, it repels evil for three feet. Wearing this talisman grants longevity and deathlessness, enables the command of ghosts and spirits, and ensures that the Great Demon King of the Northern Emperor dares not test you.\n\nThis derives from the *Perfect Scripture of the Great Cavern*.\n\n**The Treasured Writ of Tai Shang**",
      "overlap_context": " its qi to descend its perfected essence, erase the tablets of the Water Emperor, and inscribe their names upon the jade registers. In accordance with the scripture, cultivate, recite, and invoke. After nine years of practice, you shall be able to inscribe talismans upon stone, refining stone into gold; inscribe talismans and embrace stone, and the stone shall conceal your form. Bury the talisman in the Western Peak, and immortal officials shall descend to present natural and wondrous treasures.",
      "start_char": 3848,
      "end_char": 4663,
      "start_sentence": 120,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.319499731063843,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "经云：佩之八年，三一俱见矣。 朱书素，佩之左肘。 青童君授涓子以封名山。 右此出《四宫雌一真经》。 金虎真符 金虎真符以制天地神灵，便得摧斩千精，而降伏万鬼，佩之而进，得以朝玉皇，礼之於寝，则众真诣其房。 佩此符者，威制天地，呵叱群灵，控景驾龙，位司高仙。 琼音既震，则玉华侍侧，金真卫兵，千妖丧眸，万鬼灭形。 右出《太上八卫隐文经》。 大劫度厄保命长存符 元始九玄之精，经大阳九之会，洪水滔天。 当以青书白绢，佩之头上，浮翔清波之上，万灾不能伤，保身长存，久佩神仙。 小劫度厄保命长存符 九天太真符，经小阳九之周，水灾交横，万灾并兴。 当以朱书白绢，佩之左肘，入渊不沉，入火不然，万灾不能害，保身长命，与天同寿，久佩神仙。 大百六度厄保命长存符 上皇玉天符，经大百六之厄，朱书白绢，佩之头上，流灾暴厄所不能伤，保身长命，寿同三光。 佩之九年，白日飞仙，上升太清。 小百六度厄保命长存符 高上紫虚玉符，经小百六之厄，黄书白绢，佩之左肘，千妖万精，疫疠横流，灾所不能伤，保身长命，寿同天地。 佩之九年，白日飞升。 阴阳度厄保命长存符 三天童子玉符，经天地改度，万疠交横，水火兵病，千灾并行，黑书白绢，佩之与天同年，与日同光，九年飞行，上升太清。 右此上五符，并出《紫书上经》。 黄帝戊己通灵玉符 黄书白缯佩身，又以戊己日黄书白纸，向太岁服一枚，三年戊己黄素玉女降见，兆身通灵，知中央万里之事，致中岳仙官送自然之厨。 九年黄帝降於寝房，迎以黄霞飞轮，上升上清宫。 甲子素奏丹符 朱书白缯佩之，以甲子日平旦，朱书白纸，东向服之，愿祝悉目存直甲玉女执符在前。 甲午素奏丹符 朱书白缯佩之，甲午日平旦，朱书白纸，东向服之，愿祝悉目存直甲玉女执符在前。 甲辰素奏丹符 朱书白缯佩之，甲辰日平旦，朱书白纸，东向服之，愿祝悉目存直甲玉女执符在前。 甲戌素奏丹符 朱书白缯佩之，甲戌日平旦，朱书白纸，东向服之，愿祝悉目存直甲玉女执符在前。 甲寅素奏丹符 朱书白缯佩之，甲寅日平旦，朱书白纸，东向服之，愿祝悉目存直甲玉女执符在前。 甲申素奏丹符 朱书白缯佩之，甲申日平旦，朱书白纸，东向服之，愿祝悉目存直甲玉女执符在前。 丹书符文，依甲子日醮受而佩身，命神召灵，摄海封山，游行五岳，万神敬迎，役使六甲，上天入渊，分形散影，七十四方，所愿立得，所向立成。 修之九年，降致三元，乘空飞行，上造琼宫。 右出《灵飞六甲经》。 高上玉晨命魔灵旛 佩之主制西方白帝灵魔大王。 依法日入室，诵西方曲施旛，於室内安西方，朱书白缯。 玄丘太真书隐文 召群灵，制万精，佩之九年，得见三元君，迎圣君於上清金阙。 朱书白缯。 右出《曲素上经》。 四元豁落太白星精符 欲致西岳真人仙官，以黄书白纸，西向服之，精思百日，仙官立到，真人诣房，赐兆真书，与兆共言。 欲制白帝之魔，以朱书白木九寸版上，向西面百日，天魔束形，万精自丧。 帝皇之章，行之七年，神仙度世，白日升天。 右出《七元经》。 白帝招灵致真摄魔之符 佩之八年，帝降玄景绿舆，下迎兆身，上升太清。 九天秘信，兆当宝密，修行其道，道无不降，仙无不成。",
      "translated_text": "The Scripture states: Wear it for eight years, and the Three Ones shall all manifest. Write in cinnabar on plain silk and wear it on the left elbow. The Azure Lad bestowed this upon Juanzi to seal the sacred mountains. This derives from the *Perfect Scripture of the Four Palaces’ Feminine Unity*.\n\n**The True Talisman of the Golden Tiger**\nThe True Talisman of the Golden Tiger commands the spirits of Heaven and Earth, enabling the crushing of a thousand essences and the subjugation of ten thousand ghosts. When worn while advancing, one may ascend to pay homage to the Jade Emperor; when placed by one’s bed, all perfected beings shall visit the chamber. Those who wear this talisman wield authority over Heaven and Earth, rebuke the assembled spirits, ride dragons through the clouds, and hold office as exalted immortals. Once its jade-like resonance resounds, jade blossoms attend at one’s side, golden perfected ones guard as soldiers, a thousand demons lose their sight, and ten thousand ghosts vanish in form. This derives from the *Hidden Writ of the Supreme Eight Guards*.\n\n**The Talisman for Enduring the Great Kalpa, Preserving Life, and Ensuring Longevity**\nThe essence of the Primordial Nine Mysteries, passing through the great yang’s nine conjunctions, when the floodwaters drowned the heavens. Write in blue-green on white silk and wear it upon the head; one shall float upon the clear waves, no calamity able to harm, preserving the body’s longevity. With long wear, one becomes an immortal.\n\n**The Talisman for Enduring the Lesser Kalpa, Preserving Life, and Ensuring Longevity**\nThe True Talisman of the Nine Heavens, passing through the lesser yang’s nine cycles, when water disasters raged and ten thousand calamities arose together. Write in cinnabar on white silk and wear it on the left elbow; one shall not sink in the abyss nor burn in fire, no calamity able to harm, preserving the body’s long life. With long wear, one’s lifespan equals Heaven’s, and one becomes an immortal.\n\n**The Talisman for Enduring the Great Hundred and Six Calamities, Preserving Life, and Ensuring Longevity**\nThe Jade Talisman of the Supreme Sovereign, passing through the great hundred and six calamities. Write in cinnabar on white silk and wear it upon the head; flowing disasters and violent calamities cannot harm, preserving the body’s long life, with a lifespan equal to the Three Luminaries. Wear it for nine years, and one shall ascend to the Great Clarity in broad daylight.\n\n**The Talisman for Enduring the Lesser Hundred and Six Calamities, Preserving Life, and Ensuring Longevity**\nThe Supreme Purple Void Jade Talisman, passing through the lesser hundred and six calamities. Write in yellow on white silk and wear it on the left elbow; a thousand demons and ten thousand essences, epidemics raging and disasters flowing, cannot harm, preserving the body’s long life, with a lifespan equal to Heaven and Earth. Wear it for nine years, and one shall ascend in broad daylight.\n\n**The Talisman for Enduring the Yin-Yang Transition, Preserving Life, and Ensuring Longevity**\nThe Jade Talisman of the Three Heavenly Lads, passing through the transformation of Heaven and Earth, when ten thousand epidemics raged together, water and fire, weapons and illness, a thousand disasters advancing in unison. Write in black on white silk and wear it; one’s lifespan equals Heaven’s years, one’s radiance equals the sun’s light. After nine years of flight, one ascends to the Great Clarity. These five talismans above all derive from the *Supreme Scripture of the Purple Writ*.\n\n**The Yellow Emperor’s Wuji Talisman for Communicating with Spirits**\nWrite in yellow on white silk and wear it on the body. On a Wuji day, write in yellow on white paper and face the Grand Year Star to ingest one piece. After three years, the Jade Maiden of the Yellow Essence shall descend and appear; one’s body shall attain spiritual communication, knowing the affairs of the central ten thousand miles, and the immortal officials of the Central Marchmount shall send forth the natural kitchen. After nine years, the Yellow Emperor shall descend to one’s bedchamber, welcoming one with a flying chariot of yellow mist to ascend to the Supreme Clarity Palace.\n\n**The Vermilion Talisman of the Jiazi Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiazi day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiawu Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiawu day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiachen Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiachen day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiaxu Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiaxu day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiayin Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiayin day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\n**The Vermilion Talisman of the Jiashen Plain Petition**\nWrite in cinnabar on white silk and wear it. On a Jiashen day at dawn, write in cinnabar on white paper, face east to ingest it, and visualize with focused intent the Straight-Armored Jade Maiden holding the talisman before you.\n\nWrite the vermilion talisman script according to the Jiazi day, perform the offering, and wear it on the body. Command spirits and summon the numinous, seal the seas and mountains, wander the Five Marchmounts, with all spirits respectfully welcoming. Command the Six Jia, ascend to Heaven and enter the abyss, divide one’s form and scatter one’s shadow across seventy-four directions. Whatever is wished shall be immediately attained; whatever is faced shall be immediately accomplished. Cultivate this for nine years, and the Three Origins shall descend; one shall ride the void in flight, ascending to the Jade Palace. This derives from the *Scripture of the Numinous Flight of the Six Jia*.\n\n**The Supreme Jade Dawn Banner for Commanding Demons and Spirits**\nWear it to command the Great Demon King of the White Emperor of the West. According to the method, at sunset enter the chamber, recite the Western Melody, and display the banner within the chamber facing west, written in cinnabar on white silk.\n\n**The Hidden Writ of the Supreme Perfected of the Dark Mound**\nSummon the assembled spirits and command the ten thousand essences. Wear it for nine years, and one shall behold the Lords of the Three Origins, welcoming the Sage Lord at the Golden Portal of the Supreme Clarity. Write in cinnabar on white silk. This derives from the *Supreme Scripture of the Pure Melody*.\n\n**The Talisman of the Four Origins and the Vast Expanse of the Great White Star’s Essence**\nTo summon the perfected ones and immortal officials of the Western Marchmount, write in yellow on white paper, face west to ingest it, and meditate with focused intent for a hundred days; the immortal officials shall immediately arrive, and the perfected ones shall visit the chamber, bestowing upon one the true scripture and conversing with one. To command the demons of the White Emperor, write in cinnabar on a nine-inch wooden tablet, face west for a hundred days; the heavenly demons shall bind their forms, and the ten thousand essences shall perish of themselves. The Imperial Sovereign’s Chapter, practiced for seven years, enables transcendence as an immortal and ascension to Heaven in broad daylight. This derives from the *Scripture of the Seven Origins*.\n\n**The Talisman of the White Emperor for Summoning the Numinous, Attracting the Perfected, and Subduing Demons**\nWear it for eight years, and the Emperor shall descend in a dark mist chariot to welcome one’s body, ascending to the Great Clarity. The secret missive of the Nine Heavens—one must treasure and guard it closely. Cultivate its Way, and no Dao shall fail to descend; no immortality shall fail to be achieved.",
      "overlap_context": "itten in cinnabar of any size as desired. It may be worn while sitting or lying down, or placed within bedding. When worn, it repels evil for four inches around the body; when sat upon, it repels evil for three feet. Wearing this talisman grants longevity and deathlessness, enables the command of ghosts and spirits, and ensures that the Great Demon King of the Northern Emperor dares not test you.\n\nThis derives from the *Perfect Scripture of the Great Cavern*.\n\n**The Treasured Writ of Tai Shang**",
      "start_char": 4663,
      "end_char": 5991,
      "start_sentence": 160,
      "end_sentence": 216,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.746793031692505,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "以黄书白板上，令广九寸，长一尺二寸，安室西面，修行诵经。 右出《金真玉光经》。 三天真书 佩者入水，蛟龙开道万里，大劫交则能腾身玄虚，奉翊圣尊於上清宫。 右出《三天正法经》。 下灵飞玉符 元始之精，羽玄玉章，佩之九年，乘空飞行，上登五星，飞步升玄之道气，无此符则不得乘空而行也。 受者素锦六十尺盟誓，登修之日，书右手掌中，即能握素灵飞行。 丹书白素九寸佩之，左统六甲十二神，玉女十二人侍右。 右出《太上回元九道飞行羽经》。 玉清高挑厉冲龙罗天观灵元晨隐书金玄内文 九老仙都所佩。 行神仙之道，当以赤书白板上，置西方，以灭西方白帝大魔王官属，招致西方仙官。 行之十二年，仙官景素灵七圣金灵君降形兆身，役使仙官取自然灵药。 又以朱书白缯佩身，行来西方福堂洲盛行之世界，大魔王束带稽首礼迎，仙官侍卫入西岳，则致素云羽盖，十二年飞行玉清宫。 右出《玉清隐书经》。 北帝寒灵灭魔杀鬼玉文 受之於高上三天，卫以玉女三十六人，一名九天命魔文，高上神霄王所佩之。 欲杀甲乙日鬼，朱书文白素上，长一尺二寸，广三寸二分，甲日置西方庚上，乙日辛上，闭气七息，叩齿三十六通，祝曰： 乘天履气，奉行威章，高上玉文，普摄万凶，寒灵受制，声如天钟，明告伯史，检制北酆，先戮鬼爽，后剪魔王，大小灭踪，高下摧崩，如天之命，绝气火宫，太一监诏，五老役翁，天清地朗，万津开通，甲乙所执，靡不敬从。 毕，引气七咽止。 行之七日，天魔束形见景，受事於眼前，鬼爽灭种，万精自亡。 朱书白素佩身，可游行天下，群妖不试，万鬼不敢干也。 七年自得役使太丹玉女八人。 右出《上清神慧隐书》。 金阙之内有隐书玉名 玉字十，赤书。 佩之者则金阙刻玉简，注仙名，四渎五岳灵仙营卫送迎。 知者飞升金阙，腾景上清。 上清金书玉箓上文 玉字十，青书。 佩之者则上清刻书金简，注名神仙，告下五岳，仙官扶迎。 知者飞升上清，位齐四真。 太极白简文 玉字十，青书。 佩之者太极刻名，书於简文，注於神府，四极营卫。 知者飞升太极宫，腾景金阙之中。 方诸玄素紫名隐文 玉字十，青书。 佩之者方诸刻书玄紫青名，九年飞行，神仙卫迎，五岳记名，知者飞升方诸宫。 太清玉籍绛名隐文 玉字十，赤书。 佩之者太清刻书绛名於玉籍，九年通神飞行，给玉童十二人，知者飞升太清，腾景琼宫。 太素琼简金名隐文 玉字十，黄书。 佩之者太素刻书琼简，九年致飞云白日升天，知者飞升太素之宫，上朝三元君。 南极有丹文紫箓上文 玉字十，赤书。 佩之者则南极注名於紫箓，九年三元下降，授子真书，白日升天。 知者白日飞升，上谒太极元君。 玄宫上元青金赤书隐文 玉字十，青书。 佩之者目见上元真形，九年降兆之房，授兆真书，即得神仙。 知者飞升玄官，腾景上清。 玄都丹台白玉金字隐文 玉字十，黄书。 佩之者刻书丹台之名，九年乘空景而行，久久神仙，知者白日飞升玄都。 三元宫琳札青书隐文 玉字十，青书。 佩之者刻名於琼琳之札，九年三元诣房授兆真文，神仙飞行。 知者白日升天，上拜三元君。 玄斗之中玄名录籍隐文 玉字十，黑书。 佩之者刻书玄斗之名，九年神人下降，授兆真书，行之神仙。",
      "translated_text": "Inscribe in yellow on a white tablet, nine inches in breadth and twelve inches in length, place it facing west within the chamber, and cultivate while reciting the scripture.\n*From the* Scripture of the Golden Perfection and Jade Radiance.\n\n**The Perfected Writ of the Three Heavens**\nWhen worn, one may enter water, and jiao-dragons shall open a path for ten thousand miles. When the great kalpa turns, one may ascend into the mysterious void, serving and escorting the Sagely Honored One in the Palace of Supreme Clarity.\n*From the* Scripture of the Orthodox Dharma of the Three Heavens.\n\n**The Jade Talisman of the Descending Numinous Flight**\nThe essence of the Primordial Beginning, the jade chapter of the feathered mystery—when worn for nine years, one may traverse the void in flight, ascend to the Five Stars, and tread the qi of the ascending mystery. Without this talisman, one may not soar through the empty sky.\nThe recipient must swear an oath with sixty feet of plain silk. On the day of ascetic practice, inscribe it upon the right palm, and one may grasp the plain silk to fly in numinous flight.\nInscribe in cinnabar on a nine-inch white silk and wear it: to the left, the Six Jia and Twelve Spirits shall be commanded; to the right, twelve Jade Maidens shall attend.\n*From the* Supreme Scripture of the Nine Ways of Reversion and Feathered Flight.\n\n**The Jade Scripture of the Lofty Jade Purity, the Soaring Impetus, the Dragon Net, the Celestial Observation, the Numinous Origin, and the Hidden Dawn**\nWorn by the Nine Elder Immortals of the Immortal Capital.\nTo practice the Way of the divine immortals, one must inscribe in red upon a white tablet, place it in the west, to extinguish the Great Demon King of the White Emperor of the West and his retinue, and summon the immortal officials of the West.\nWhen practiced for twelve years, the Seven Sagely Numinous Lords of the Luminous Plain and Golden Spirit shall descend in form to one’s body, dispatching immortal officials to gather the naturally numinous herbs. Further, inscribe in cinnabar on white silk and wear it upon the body; when traveling to the world of the Blessed Hall Continent, the Great Demon King shall gird his sash and bow in reverent welcome, while immortal officials escort one into the Western Marchmount. Then shall luminous clouds and feathered canopies arrive, and after twelve years, one shall fly to the Jade Purity Palace.\n*From the* Scripture of the Hidden Writ of Jade Purity.\n\n**The Jade Writ of the Northern Emperor for Annihilating Demons and Slaying Ghosts**\nReceived from the Supreme Three Heavens, guarded by thirty-six Jade Maidens—one name is the *Mandate of the Nine Heavens over Demons*, worn by the Supreme Numinous Empyrean King.\nTo slay ghosts of the Jia and Yi days, inscribe in cinnabar upon white silk, twelve inches in length and three inches and two fen in breadth. On Jia days, place it upon the west at Geng; on Yi days, at Xin. Hold the breath for seven cycles, knock the teeth thirty-six times, and recite the incantation:\n*\"Riding the heavens, treading the qi, I carry forth the mighty writ. The supreme jade script commands all malevolence; the numinous cold submits, its voice like the celestial bell. I solemnly declare to the Earl of Destiny: inspect and restrain the Northern Feng. First execute the ghostly shades, then sever the demon kings. Great and small shall be obliterated, high and low shall crumble. As the mandate of Heaven commands, cut off the qi of the Fire Palace. The Great One supervises the decree; the Five Elders dispatch the venerable ones. Heaven is clear, earth is bright; the ten thousand fordings open. Whatever the Jia and Yi govern shall submit without fail.\"*\nConclude, then draw in the qi seven times and cease.\nWhen practiced for seven days, the heavenly demons shall bind their forms and appear in vision, submitting before one’s eyes. Ghostly shades shall be extirpated, and the ten thousand essences shall perish of themselves.\nInscribe in cinnabar on white silk and wear it upon the body: one may wander the world, and no demon shall dare approach, nor any ghost presume to interfere. After seven years, one shall naturally gain the service of eight Jade Maidens of the Great Cinnabar.\n*From the* Hidden Scripture of the Divine Wisdom of Supreme Clarity.\n\n**Within the Golden Portal lies the Hidden Jade Name**\nTen jade characters, inscribed in red.\nWhen worn, the Golden Portal shall engrave one’s name upon jade tablets, and the numinous immortals of the Four Waterways and Five Marchmounts shall escort and receive.\nThose who know it shall ascend in flight to the Golden Portal and soar into Supreme Clarity.\n\n**The Supreme Writ of the Jade Register of Supreme Clarity**\nTen jade characters, inscribed in blue-green.\nWhen worn, Supreme Clarity shall inscribe one’s name upon golden tablets, and the immortal officials shall be notified to descend the Five Marchmounts in escort.\nThose who know it shall ascend in flight to Supreme Clarity, their rank equal to the Four Perfected.\n\n**The White Tablet Writ of the Supreme Ultimate**\nTen jade characters, inscribed in blue-green.\nWhen worn, the Supreme Ultimate shall inscribe one’s name upon the tablet writ and register it in the divine府. The Four Poles shall provide escort.\nThose who know it shall ascend in flight to the Palace of the Supreme Ultimate and soar within the Golden Portal.\n\n**The Hidden Writ of the Purple Name of the Square Cauldron and the Mysterious Plain**\nTen jade characters, inscribed in blue-green.\nWhen worn, the Square Cauldron shall inscribe one’s name in mysterious purple. After nine years of flight, divine immortals shall escort and receive, and the Five Marchmounts shall record one’s name.\nThose who know it shall ascend in flight to the Palace of the Square Cauldron.\n\n**The Hidden Writ of the Crimson Name in the Jade Register of the Great Clarity**\nTen jade characters, inscribed in red.\nWhen worn, the Great Clarity shall inscribe one’s crimson name in the jade register. After nine years, one shall commune with spirits and fly, attended by twelve Jade Lads.\nThose who know it shall ascend in flight to the Great Clarity and soar into the Jasper Palace.\n\n**The Hidden Writ of the Golden Name on the Jasper Tablet of the Supreme Simplicity**\nTen jade characters, inscribed in yellow.\nWhen worn, the Supreme Simplicity shall inscribe one’s name upon the jasper tablet. After nine years, one shall attain flight upon clouds and ascend to Heaven in broad daylight.\nThose who know it shall ascend in flight to the Palace of Supreme Simplicity and pay homage to the Three Primordial Lords.\n\n**The Supreme Writ of the Crimson Register of the Southern Culmen**\nTen jade characters, inscribed in red.\nWhen worn, the Southern Culmen shall register one’s name in the crimson register. After nine years, the Three Primordials shall descend and confer the Perfected Writ, enabling ascension to Heaven in broad daylight.\nThose who know it shall ascend in broad daylight and ascend to pay homage to the Primordial Lord of the Supreme Ultimate.\n\n**The Hidden Writ of the Blue-Gold and Red Inscription of the Upper Primordial of the Mysterious Palace**\nTen jade characters, inscribed in blue-green.\nWhen worn, one shall behold the true form of the Upper Primordial. After nine years, it shall descend to one’s chamber and confer the Perfected Writ, enabling one to attain divine immortality.\nThose who know it shall ascend in flight to the Mysterious Palace and soar into Supreme Clarity.\n\n**The Hidden Writ of the Golden Characters on the White Jade of the Cinnabar Terrace of the Mysterious Capital**\nTen jade characters, inscribed in yellow.\nWhen worn, one’s name shall be inscribed upon the Cinnabar Terrace. After nine years, one may traverse the empty sky in flight; with time, one shall attain divine immortality.\nThose who know it shall ascend in broad daylight to the Mysterious Capital.\n\n**The Hidden Writ of the Blue-Green Inscription on the Jade Tablet of the Three Primordials’ Palace**\nTen jade characters, inscribed in blue-green.\nWhen worn, one’s name shall be inscribed upon the jade tablet of the numinous jade. After nine years, the Three Primordials shall descend to one’s chamber and confer the Perfected Writ, enabling flight as a divine immortal.\nThose who know it shall ascend to Heaven in broad daylight and pay homage to the Three Primordial Lords.\n\n**The Hidden Writ of the Recorded Name in the Mysterious Dipper**\nTen jade characters, inscribed in black.\nWhen worn, one’s name shall be inscribed in the Mysterious Dipper. After nine years, divine persons shall descend and confer the Perfected Writ, enabling one to practice as a divine immortal.",
      "overlap_context": "eaven in broad daylight. This derives from the *Scripture of the Seven Origins*.\n\n**The Talisman of the White Emperor for Summoning the Numinous, Attracting the Perfected, and Subduing Demons**\nWear it for eight years, and the Emperor shall descend in a dark mist chariot to welcome one’s body, ascending to the Great Clarity. The secret missive of the Nine Heavens—one must treasure and guard it closely. Cultivate its Way, and no Dao shall fail to descend; no immortality shall fail to be achieved.",
      "start_char": 5991,
      "end_char": 7344,
      "start_sentence": 217,
      "end_sentence": 280,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.06209850311279,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "知者得升玄斗之中，飞行上清之宫。 五岳有丹书琼简紫箓之名 玉字十，青书。 佩之者五岳灵官防卫兆身，五帝刻名於五岳之简，九年乘空飞行，上升玄宫。 此一百二十玉字佩文，游涉山岳，十界稽首，万仙来朝，知者白日升天，飞行五岳。 右出《七圣玄纪经》。 上清佩符文白券诀竟 上清佩符文绛券诀 流金火铃符 佩此符皆宿命应仙，佩符之身出入游行，常当存想己身项上有圆光，映照四十万里之外，九年勤心，真灵下降，以紫缯二尺二寸朱书，佩之头上。 右符出《紫度炎光经》。 高上玉晨命魔灵旛 佩之者主制南方赤帝魔灵大王，依日入室，诵南方曲，施旛於室内，安南方，黑笔书绛缯上。 右出《曲素上经》。 赤帝招灵致真摄魔之符 以青书赤板上，令广九寸，长一尺二寸，安室南面，修行诵经，入室百日，与神人共言，三千日室生自然赤霞之云。 欲致真人天仙，当书如法，着符东面，精思百日，真人降形，仙人诣房，授子神真之道。 右出《金真玉光经》。 上元豁落月精之符 欲通灵致神，黄书白纸，西向服之，精思百日，神人降形，与兆共言。 欲制魔摄精，以黑书赤木板上九寸，施着东北之上，百日北帝捕魔，天元摄精，万妖绝灭。 内外荡清。 帝皇之章，秘而修行，七年飞仙，白日升天。 五元豁落荧惑星精符 欲致南岳真人仙官，以青书赤纸，南向服之，精思百日，仙官立到，真人诣房，赐兆神芝宝文，与兆共言。 欲制赤帝之魔，以黑书赤木九寸板上，向南面百日，天魔束形，万精自丧。 帝皇之章，行之七年，白日升天。 右符出《七元经》。 青帝甲乙通灵玉符 青书绛缯佩身，又以甲乙日青书绛纸上，东向服一枚，三年甲乙，青腰玉女降见，兆身通灵，知东方万里之事，致东岳仙官送自然之厨，九年青帝降於寝房，迎以青霞之轮，上升上清宫。 右出《灵飞六甲经》。 清微天始青正法除六天文 始青飞玄之气结成玉文，佩者制灵使气，威摄十方，出空入无，万道开张。 禹余天元白正法除六天文 元白飞玄之气结成玉文，佩者匡制万灵，威神灭魔，辟却阳九，防过穷年，灾所不伤，出入空玄，适意所行。 右符出《三天正法经》。 玉清冲融育郁敌沙天齐晖晨隐书金玄内文 西王母受之於北极皇上先生。 行神仙之道，当以青书紫板上，置东北方，以灭苍帝大魔王官属，招致东北方福都集永安世界苍帝仙官。 十年则致仙童十八人给兆驱使，取自然灵药，高上飞玄羽章。 又以青笔书紫纹上佩身，行之东北永安世界，则万灵束带，魔王稽首礼迎，得乘紫云羽盖，飞行玉清宫。 玉清碧落空歌余梨天总晨九极隐书金玄内文 玉清高元君所佩。 行神仙之道，当以黑书丹板上，置南方，以灭南方赤帝大魔王官属，招致南方仙官。 行之一十八年，则洞阳丹灵真景君降形於兆身，役使仙官，取自然灵药。 又以黑书绛纹佩身，行之南方宛梨城境弃贤之世界，则大魔王束带稽首礼迎，仙官侍卫，入南岳则得南极宝书，致丹云羽盖，一十八年飞行玉清宫。 右符出《玉清隐书经》。 左灵飞玉符 玄气始生之精素羽之章，佩之九年，乘空飞行，上登五星。 欲修之日，书左足跖心，即能蹑空飞行。 书绛缯九寸佩之，右统六甲十二神，玉女十二人侍前。",
      "translated_text": "Those who know it shall ascend into the Mysterious Dipper and soar to the Palace of Supreme Purity.\n\n**The Hidden Writ of the Vermilion Inscription on the Jade Slips and Purple Registers of the Five Marchmounts**\nTen jade characters, inscribed in blue-green.\nWhen worn, the numinous officials of the Five Marchmounts shall guard one’s body, and the Five Thearchs shall inscribe one’s name upon the slips of the Five Marchmounts. After nine years, one shall ride the void in flight and ascend to the Mysterious Palace.\nThese one hundred and twenty jade characters of the佩文, when worn, allow one to traverse mountains and peaks, where the Ten Realms bow in reverence and the myriad immortals come to pay homage. Those who know it shall ascend to Heaven in broad daylight and soar above the Five Marchmounts.\n\n*—Excerpted from the Scripture of the Seven Sages’ Mysterious Record*\n\n**The White Writs of the Supreme Purity佩符 Concluded**\n\n**The Crimson Writs of the Supreme Purity佩符**\n\n**The Flowing Gold Fire Bell Talisman**\nAll who wear this talisman are destined by former lives to become immortals. When wearing the talisman and moving about, one must constantly visualize a circular radiance above one’s head, illuminating four hundred thousand *li* beyond. After nine years of diligent practice, the perfected spirits shall descend. Inscribe it in vermilion on two feet two inches of purple silk and wear it upon the head.\n\n*—Talisman from the Scripture of the Purple Ascension and Blazing Light*\n\n**The Highest Jade Dawn Banner for Commanding Demons and Spirits**\nWhen worn, it governs the Demon-Spirit Great King of the South, the Red Thearch. Upon entering the chamber at sunset, recite the Southern Melody, display the banner within the chamber, and place it in the south. Inscribe it in black on crimson silk.\n\n*—From the Scripture of the Pure Melody*\n\n**The Talisman of the Red Thearch for Summoning Spirits, Attracting Perfected Beings, and Subduing Demons**\nInscribe in blue-green on a red tablet, nine inches wide and one foot two inches long. Place it facing south within the chamber. Practice and recite scriptures for one hundred days, and one shall converse with divine persons. After three thousand days, the chamber shall naturally generate clouds of crimson mist.\nTo summon perfected beings and celestial immortals, inscribe it according to the method and place the talisman facing east. Cultivate with focused intention for one hundred days, and perfected beings shall descend in form, while immortals shall visit one’s chamber to confer the Dao of divine perfection.\n\n*—From the Scripture of Golden Perfection and Jade Radiance*\n\n**The Talisman of the Upper Prime, the Expansive Moon Essence**\nTo communicate with spirits and summon deities, inscribe in yellow on white paper and ingest it while facing west. Cultivate with focused intention for one hundred days, and divine persons shall descend in form to converse with one.\nTo subdue demons and capture spirits, inscribe in black on a nine-inch red wooden tablet and place it in the northeast. After one hundred days, the Northern Thearch shall capture demons, and the Celestial Prime shall seize spirits, eradicating all malevolent beings. Both within and without shall be purified. This is the imperial writ—practice it in secret. After seven years, one shall become a flying immortal and ascend to Heaven in broad daylight.\n\n**The Talisman of the Five Primes, the Expansive Fire Star Essence**\nTo summon the perfected beings and immortal officials of the Southern Marchmount, inscribe in blue-green on red paper and ingest it while facing south. Cultivate with focused intention for one hundred days, and the immortal officials shall arrive instantly, while perfected beings shall visit one’s chamber to bestow divine mushrooms and sacred writs, conversing with one.\nTo subdue the demons of the Red Thearch, inscribe in black on a nine-inch red wooden tablet and face south for one hundred days. The celestial demons shall be bound in form, and the myriad spirits shall perish of themselves. This is the imperial writ—practice it for seven years, and one shall ascend to Heaven in broad daylight.\n\n*—Talismans from the Scripture of the Seven Primes*\n\n**The Azure Thearch’s Jia-Yi Talisman for Communicating with Spirits**\nInscribe in blue-green on crimson silk and wear it on the body. Additionally, on Jia or Yi days, inscribe in blue-green on crimson paper, face east, and ingest one talisman. After three years of Jia-Yi days, the Jade Maidens of the Azure Waist shall descend and appear. One’s body shall communicate with spirits, knowing all affairs within ten thousand *li* of the east. The immortal officials of the Eastern Marchmount shall deliver the natural kitchens. After nine years, the Azure Thearch shall descend to one’s bedchamber, welcoming one with a chariot of azure mist to ascend to the Palace of Supreme Purity.\n\n*—From the Scripture of the Six Jia Spirit Flights*\n\n**The Primordial Azure Correct Dharma of the Qingwei Heaven for Dispelling the Writs of the Six Heavens**\nThe flying mystery of the Primordial Azure *qi* coalesces into jade writs. When worn, it commands spirits and employs *qi*, its majesty subduing the ten directions. One emerges from the void and enters non-being, opening the myriad Dao.\n\n**The Primordial White Correct Dharma of the Yuyu Heaven for Dispelling the Writs of the Six Heavens**\nThe flying mystery of the Primordial White *qi* coalesces into jade writs. When worn, it rectifies and commands the myriad spirits, its divine majesty extinguishing demons. It repels the Yang Ninth and guards against the exhaustion of years. No calamity shall harm one. One emerges from and enters the void and the mystery, moving as one desires.\n\n*—Talismans from the Scripture of the Three Heavens’ Correct Dharma*\n\n**The Golden Mystery Inner Writ of the Jade Purity, Flourishing and Harmonious, Nurturing the Lush Sands of the Celestial Alignment’s Dawn Concealment**\nBestowed upon the Queen Mother of the West by the Supreme Master of the Northern Culmen.\nTo practice the Dao of immortality, inscribe in blue-green on a purple tablet and place it in the northeast to extinguish the great demon king and his retinue of the Azure Thearch, summoning the immortal officials of the northeast’s Blessed Abode to assemble in the Eternally Peaceful World. After ten years, eighteen immortal youths shall attend and serve one, gathering natural numinous medicines and obtaining the supreme flying mystery of feathered writs.\nAlternatively, inscribe in blue-green on purple silk and wear it on the body. When traveling in the northeast’s Eternally Peaceful World, the myriad spirits shall be bound in sashes, and the demon king shall bow in reverence and welcome one. One shall ride a chariot of purple clouds and feathered canopy to soar to the Palace of Jade Purity.\n\n**The Golden Mystery Inner Writ of the Jade Purity, Azure Empyrean, Empty Song, and the Residual Pearls of the Celestial Totality’s Nine Culminations**\nWorn by the High and Lofty Lord of Jade Purity.\nTo practice the Dao of immortality, inscribe in black on a cinnabar tablet and place it in the south to extinguish the great demon king and his retinue of the Red Thearch, summoning the immortal officials of the south. After eighteen years of practice, the Perfected Lord of Vermilion Radiance and Numinous Scenery shall descend in form to one’s body, commanding immortal officials to gather natural numinous medicines.\nAlternatively, inscribe in black on crimson silk and wear it on the body. When traveling in the southern realm of the Pearlescent City’s World of Forsaken Worthies, the great demon king shall be bound in sashes and bow in reverence to welcome one, while immortal officials shall attend and guard. Upon entering the Southern Marchmount, one shall obtain the Southern Culmen’s sacred writs and summon a canopy of cinnabar clouds. After eighteen years, one shall soar to the Palace of Jade Purity.\n\n*—Talismans from the Scripture of the Jade Purity’s Concealed Writs*\n\n**The Left Spirit-Flight Jade Talisman**\nThe essence of the primordial *qi*’s inception, the writ of plain feathers. When worn for nine years, one shall ride the void in flight and ascend to the Five Stars.\nOn the day of practice, inscribe it upon the sole of the left foot, and one shall be able to tread the void in flight. Inscribe it on nine inches of crimson silk and wear it to command the six Jia and twelve spirits, with twelve Jade Maidens attending before one.",
      "overlap_context": "l descend to one’s chamber and confer the Perfected Writ, enabling flight as a divine immortal.\nThose who know it shall ascend to Heaven in broad daylight and pay homage to the Three Primordial Lords.\n\n**The Hidden Writ of the Recorded Name in the Mysterious Dipper**\nTen jade characters, inscribed in black.\nWhen worn, one’s name shall be inscribed in the Mysterious Dipper. After nine years, divine persons shall descend and confer the Perfected Writ, enabling one to practice as a divine immortal.",
      "start_char": 7344,
      "end_char": 8631,
      "start_sentence": 281,
      "end_sentence": 331,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.789772272109985,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "右符出《九真升玄上经》。 北帝素灵灭魔杀鬼玉文 受之於高上三天，卫以素灵玉女三十六人，名九天兵信，玉清神霄王所佩。 欲杀庚辛日鬼，黑书丹素上，长一尺二寸，广三寸二分，庚日安南方丙上，辛日安丁上，闭气三息，叩左齿三十六通，祝曰： 天开地通，玄气朗清，扫除浮翳，五道焕明，奉帝诏命，检校万灵，北酆所部，威严正形，高上所摄，促无时呈，群魔自到，鬼爽灭精，风发电激，自天肃平，皆如玄符，伏注帝庭。 毕，引气三咽止。 行之三日，鬼魔皆束形见影，受事於眼前，万魔伏法，群凶灭迹也。 黑书丹纹上，佩身游行天下，万鬼窜伏，群灵莫干，三年自得役使太玄玉女五人。 右符出《玉清隐书经》。 上清佩符文绛券诀竟 上清佩符文黑券诀 高上玉晨命魔灵旛 佩之者主制北方黑帝魔灵大王，依本经按日入室，诵北方曲，施旛於室内，安北方，黄笔书黑缯上。 右出《曲素上经》。 黑帝招灵致真摄魔之符 以白书黑木板上，令广九寸，长一尺二寸，安室北面，修行诵经，入室百日，与神人共言，三年室生自然绿霞之云。 欲致真人天仙，当书如上法，着符西面，精思百日，真人降形，仙人诣房，授子神真之道。 右出《金真玉光经》。 白帝庚辛通灵玉符 白书皂缯佩身，又以庚辛之日白书黑纸上，西向服之一枚，三年庚辛太素玉女降见，兆身通灵，知西方万里之事，致西岳仙官送自然之厨，九年白帝降於寝房，迎以素霞飞轮，上升上清宫。 右出《灵飞六甲经》。 灵飞玉符 元气之精升玄羽章，佩之九年，得乘飞云。 登修之日，书右足蹶心，即能蹑玄而飞，书皂缯九寸佩之，左统六甲十二神，玉女十二人侍后。 右出《九真升玄上经》。 玉清□摩亶娄于翳天 杳耀游根隐书金玄内文 九天真王所受，行神仙之道，当以黄书黑板上，置北方，以灭北方大魔王官属，招致北方仙官。 十五年则致北极玄上玉真君，授兆高上宝书，役使仙官五十人。 又以黄书皂纹佩身，行之北方郁单野清净之世界，则万灵束带，魔王稽首礼迎，入北岳则致黑云羽盖，飞行玉清宫。 右出《玉清隐书经》。 北帝丹灵灭魔杀鬼玉文 受之於高上三天，卫以朱宫玉女六十四人，一名摄杀律，高上消魔王所佩。 欲杀丙丁日鬼，当黄书黑素上，长一尺二寸，广三寸二分，丙日安北方壬上，丁日安癸上，闭气五息，叩左齿三十六通，祝曰： 高上告命，普摄万灵，伯吏授符，禀按玉清，检督北酆，束送魔名，上帝所须，无亏时星，皇老监诏，五仙部兵，天一秉钺，斩灭无停，万万伏法，千千戮形，杀律所摄，莫不悉清。 毕，引气五咽止，行之五日，鬼魔皆束形露影，受事於眼前，万凶灭迹，千精自丧。 黄书玄缯佩身，游行天下，万妖灭凶，群灵莫敢干也。 五年自得役使黄素玉女十二人。 右符出《玉清隐书经》上。 上清所佩合符图一百五章，玉文九百四十三字，太玄左宫女青四极，三十一卷独立宝经。 明科律文云：上真宝符，以解兆形宿愆结过，消灭风刀水火之考，刀山火乡二十四岳，三涂五苦负石填河之责，得佩此符，超出八难。 凡有至学之士，名参紫简，未备大经，亦得单御此符，以解宿根，禳厄度命，预期神仙。 别受之日，听得单盟信上金二两，紫纹四十尺，以誓九天，告斋如具，而奉传。",
      "translated_text": "**The Right Talisman from the *Scripture of the Nine Perfections Ascending the Mysterious***\n\n**The Jade Writ of the Northern Thearch’s Primordial Numen for Extinguishing Demons and Slaying Ghosts**\nReceived from the Three Highest Heavens, guarded by thirty-six Primordial Numen Jade Maidens, styled the *Celestial Soldiers’ Pledge*, and worn by the Jade Purity Divine Numinous Sovereign. To slay ghosts of the *geng* and *xin* days, inscribe in black upon cinnabar silk, one foot two inches in length and three inches two *fen* in width. On a *geng* day, place it above *bing* in the south; on a *xin* day, place it above *ding*. Hold the breath for three cycles, knock the left teeth thirty-six times, and intone:\n*\"Heaven opens, earth communicates,\nThe mysterious *qi* shines in clarity.\nSweep away the floating obscurities,\nThe Five Paths gleam resplendent.\nBy the Thearch’s decree,\nAll numina are examined and marshaled.\nThe legions of the Northern Feng,\nIn solemn majesty assume their forms.\nBy the Highest’s command,\nHasten without delay to appear.\nAll demons shall come of themselves,\nGhosts and specters shall be extinguished.\nWind surges, lightning strikes,\nFrom heaven all is pacified.\nAs with this mysterious talisman,\nSubmit and attend the Thearch’s court.\"*\nConclude by drawing in *qi* and swallowing thrice. After three days of practice, ghosts and demons shall bind their forms and reveal their shadows, submitting before one’s eyes. Ten thousand demons shall be subdued by law, and all malevolent spirits shall vanish without trace. Inscribe in black upon cinnabar silk and wear it upon the body while traveling the world—ten thousand ghosts shall flee and hide, and no spirit shall dare to offend. After three years, one shall naturally gain the service of five Great Mysterious Jade Maidens.\n\n*—From the* Scripture of the Jade Purity’s Concealed Writs\n\n**The Crimson Contract Formula for Wearing the Upper Clarity Talismans**\n*(Concluded above)*\n\n**The Black Contract Formula for Wearing the Upper Clarity Talismans**\n\n**The Highest Jade Aurora’s Banner for Commanding Demon Numin**\nThose who wear it shall master the Demon Numin Great King of the Northern Black Thearch. According to the original scripture, enter the chamber on the appointed day, recite the Northern Melody, and display the banner within the chamber, placing it in the north. Inscribe with yellow ink upon black silk.\n\n*—From the* Scripture of the Pure Melody\n\n**The Black Thearch’s Talisman for Summoning Numin, Attracting Perfected Ones, and Seizing Demons**\nInscribe in white upon a black wooden board, nine inches in width and one foot two inches in length. Place it facing north within the chamber. After one hundred days of practice and scripture recitation within the chamber, one shall converse with divine persons. After three years, the chamber shall naturally generate clouds of emerald radiance. To summon Perfected Ones and Heavenly Immortals, inscribe as above and place the talisman facing west. After one hundred days of concentrated meditation, Perfected Ones shall descend in form, and Immortals shall arrive at one’s chamber to transmit the Way of Divine Perfection.\n\n*—From the* Scripture of the Golden Perfection and Jade Radiance\n\n**The White Thearch’s *Geng-Xin* Jade Talisman for Communicating with Numin**\nInscribe in white upon black silk and wear it upon the body. Alternatively, on a *geng* or *xin* day, inscribe in white upon black paper, face west, and consume one piece. After three years, the Great Primordial Jade Maidens of *geng* and *xin* shall descend and appear. The omen-body shall attain numinous communion, perceiving all affairs within ten thousand *li* of the west. The Immortal Officials of the Western Marchmount shall deliver the natural kitchens. After nine years, the White Thearch shall descend to one’s bedchamber, welcoming one with a flying chariot of pristine auroral clouds to ascend to the Palace of Upper Clarity.\n\n*—From the* Scripture of the Numinous Flight of the Six *Jia**\n\n**The Jade Talisman of Numinous Flight**\nThe essence of the primordial *qi*, the writ of ascending mystery and plain feathers. When worn for nine years, one shall ride flying clouds. On the day of practice, inscribe it upon the sole of the right foot, and one shall be able to tread the mysterious void in flight. Inscribe it upon nine inches of black silk and wear it to command the six *Jia* and twelve spirits, with twelve Jade Maidens attending behind.\n\n*—From the* Scripture of the Nine Perfections Ascending the Mysterious\n\n**The Jade Purity’s [Obscured] Talisman of the Heaven of Concealed Brilliance and Hidden Roots**\nThe concealed golden and mysterious writ received by the Nine Heavens’ Perfected Kings. To practice the Way of divine immortality, inscribe in yellow upon a black board and place it in the north to extinguish the Great Demon King of the Northern Marchmount and his retinue, and to summon the Immortal Officials of the north. After fifteen years, the Jade Perfected Lord of the Northern Culmen of Mystery shall arrive to transmit the highest sacred writs and command fifty Immortal Officials. Alternatively, inscribe in yellow upon black silk and wear it while traveling to the pure and tranquil world of *Yudan* in the north. All numina shall gird their sashes, and the Demon King shall bow in reverent welcome. Upon entering the Northern Marchmount, one shall obtain a canopy of black clouds and ascend in flight to the Palace of Jade Purity.\n\n*—From the* Scripture of the Jade Purity’s Concealed Writs\n\n**The Northern Thearch’s Cinnabar Numen Jade Writ for Extinguishing Demons and Slaying Ghosts**\nReceived from the Three Highest Heavens, guarded by sixty-four Vermilion Palace Jade Maidens, styled the *Seizing and Slaying Statute*, and worn by the Highest Demon-Quelling King. To slay ghosts of the *bing* and *ding* days, inscribe in yellow upon black silk, one foot two inches in length and three inches two *fen* in width. On a *bing* day, place it above *ren* in the north; on a *ding* day, place it above *gui*. Hold the breath for five cycles, knock the left teeth thirty-six times, and intone:\n*\"By the Highest’s proclamation,\nAll numina are universally seized.\nThe Earls and Clerks receive the talisman,\nReceiving and enforcing the Jade Purity’s mandate.\nSupervising the Northern Feng,\nBinding and delivering demon names.\nWhat the Thearch requires,\nNo delay in the celestial signs.\nThe August Elders oversee the decree,\nThe Five Immortals lead the troops.\nHeavenly Unity wields the halberd,\nSlaying without cease.\nTen thousand times ten thousand submit to the law,\nA thousand times a thousand are executed in form.\nBy the Seizing Statute’s command,\nNone shall fail to be purified.\"*\nConclude by drawing in *qi* and swallowing five times. After five days of practice, ghosts and demons shall bind their forms and reveal their shadows, submitting before one’s eyes. All malevolent spirits shall vanish without trace, and a thousand essences shall perish of themselves. Inscribe in yellow upon black silk and wear it upon the body while traveling the world—ten thousand demons shall be extinguished, and no spirit shall dare to offend. After five years, one shall naturally gain the service of twelve Yellow Primordial Jade Maidens.\n\n*—From the Upper* Scripture of the Jade Purity’s Concealed Writs\n\nThe Upper Clarity’s combined talismans for wearing comprise one hundred and five diagrams and nine hundred forty-three characters in jade script. The Great Mysterious Left Palace’s Jade Maiden of the Four Poles, in thirty-one independent scriptures, is a treasure among scriptures. The luminous statutes and regulations state: The Upper Perfected’s precious talismans may resolve the omen-body’s karmic entanglements and accumulated transgressions, dispelling trials of wind blades, water, and fire, the knife mountains and fire realms of the twenty-four peaks, and the punishments of the Three Paths and Five Sufferings—bearing stones to fill rivers. Those who wear this talisman shall transcend the Eight Difficulties. All scholars of the highest learning, whose names are inscribed upon the purple tablets and who have not yet fully received the great scriptures, may also singly employ this talisman to resolve karmic roots, avert calamities, extend life, and anticipate divine immortality. On the day of separate transmission, one is permitted to offer two taels of gold and forty feet of purple silk as a pledge to the Nine Heavens, with the oath and purification rites observed as prescribed. The transmission shall then be reverently received.",
      "overlap_context": "de Purity’s Concealed Writs*\n\n**The Left Spirit-Flight Jade Talisman**\nThe essence of the primordial *qi*’s inception, the writ of plain feathers. When worn for nine years, one shall ride the void in flight and ascend to the Five Stars.\nOn the day of practice, inscribe it upon the sole of the left foot, and one shall be able to tread the void in flight. Inscribe it on nine inches of crimson silk and wear it to command the six Jia and twelve spirits, with twelve Jade Maidens attending before one.",
      "start_char": 8631,
      "end_char": 9936,
      "start_sentence": 332,
      "end_sentence": 374,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.45091223716736,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "此盟亦可总度众经，共用以誓也，余经虽各有盟，故四极总统，得包於万宗也。 上清佩符文黑券诀竟 上清佩符文黄券诀 上元检天大箓文 以青笔书九尺黄素上佩身，当诣本命之岳醮天真，告九玄，盟五灵，然后佩焉。 九年道未降，当缮书二通，如法醮岳，更醮天，毕便烧之，余灰扬之青烟之霄，一通埋之本命之岳，令深九尺，所谓上告九天，下告五岳灵山，中告万神，永得长生。 中元检仙真书 一名太真阴阳灵箓三元章，乃三天九灵上微隐文。 天地有大劫之数，经八千劫其文则一见，三元玄台直符三百人，玉女九十一人，佩之者一形之神皆受号自然玉仙也。 郁绝上真三元检仙气九灵隐文 右西沙方台之中书也，南极上元所受黄上真，辅天气，检仙魂。 得佩此文，上元仙官到庭，百日入室思神，得见上元君，授子真书，自然飞行上清宫也。 无此文不得行道召天真，身被殃也。 玄上生真检仙气三元大君紫素文 则三元台中之隐书，佩之入室，思真九日，秽气消，真自见，三元大君授子真书，九年得飞行空中。 无此文不得行仙道，召仙官，身被殃也。 高上太上生真书检仙气紫微宫飞天真文 天地大劫周，其文则见於五岳之室。 得佩之者，入室思三元百日，精念无有异想，则见真神降子形也，能役仙官，取自然之物也，慎履生死之污。 无此文不得行仙道，轻召天真，没身不仙也。 高上玄微玉检三元文 刻书灵都北房之中，天书玉字，字方一丈，直符七百仙人，玉女八十二人。 佩其文百日，精思三元降房，子自然知天中之音。 无此文不得妄行飞仙之道，则被殃七祖充责，失仙之品也。 紫微玄宫飞天检文 刻书晨灯之台，照明九天之上，太清上宫元始天王授西王母，招召五岳山海灵仙之官，精心静念，百日见神，自知九天中隐名，佩者致仙官。 无此文不得诵消魔上经，身被大殃，慎之。 玄上飞天中书检仙之文 刻三元之台，万始先生所出，以传高上人，召仙致真。 受者祭五岳百日，精思一躯三头之神降兆之房，无此文不得八节日妄行求仙之事，身被殃也。 佩之神真通达，给玉童十二人，传说所诵，上闻九天也。 轻泄七祖充责，勅五岳符魔灵考对罪魂。 九天龙书三元空洞玉检飞玄文 刻题九天三关之门，主检诸天真人，诵九天上书，不得备此文者，罚之九天刺奸也。 得佩此文，九天丞相主召检天元，制仙官，精思一年，得见九天真王，或见一人九头，乘九色之凤，降兆形也。 见之勿恐，此九天真王主箓上真也，但南向伏地，乞求神仙，自当得授九天之书也。 无此文不得轻诵三十九章大洞真经，犯之九祖充考，身为天刺其奸罪。 元始玄空飞天中书三元玉检文 元始天王刻书金牖之台，经万劫一传，得见此文，四极即书名於东华，佩之精思三百日，目不他视，心不异想，即见元始天王，见元始天王便寿万年。 学无此文，不得入名山，游五岳，行飞仙之道，五岳不受人，天魔伐身，必被大殃也。 受之先审良端，然后佩焉，以获元吉，勿轻佩也，亦被殃，慎之。 太真金虎书九天上空洞隐文 九天父母书之凤生台，直符八百人，九千年九天一开，九天开则九日俱明於东方，此文则自明於得道之人南轩之上也。 若有玄名帝箓，四真亦降授於兆身。",
      "translated_text": "This covenant may also collectively transmit all scriptures, serving as a unified oath for them. Though other scriptures each have their own covenants, the *Four Ultimates* governs all, encompassing the myriad traditions.\n\n**Conclusion of the Black Contract of the Shangqing Talismanic Writs for Wearing**\n**The Yellow Contract of the Shangqing Talismanic Writs for Wearing**\n**The Writ of the Upper Prime for Celestial Inspection**\n\nInscribe with azure ink upon nine feet of yellow silk and wear it upon the body. One must journey to the sacred peak of one’s destined life, offer libations to the Celestial Perfected, announce to the Nine Mysteries, and pledge to the Five Numinous Ones before donning it. If the Dao has not descended after nine years, make two copies in accordance with the rites, perform libations to the sacred peak, and then to Heaven. Upon completion, burn them, scattering the ashes into the azure vapors of the sky. Bury one copy at the sacred peak of one’s destined life, nine feet deep—thus announcing above to the Nine Heavens, below to the Five Sacred Peaks and numinous mountains, and in the midst to the myriad spirits, thereby securing eternal life.\n\n**The Writ of the Middle Prime for Inspecting the Immortal Perfected**\nAlso named the *Three Primes’ Chapter of the Supreme Perfected’s Yin-Yang Numinous Register*, it is the hidden script of the Three Heavens and Nine Numinous Ones. Heaven and Earth possess the great reckoning of kalpas; after eight thousand kalpas, this writ appears but once. Three hundred *zhifu* of the Three Primes’ Mystic Terrace and ninety-one jade maidens bear it. Those who wear it shall have all spirits of their form bestowed with the natural title of Jade Immortal.\n\n**The Nine Numinous Hidden Script of the Supreme Perfected’s Three Primes for Inspecting Immortal Qi**\nInscribed upon the Western Sand Square Terrace, it was received by the Yellow Supreme Perfected of the Upper Prime of the Southern Culmen, who assists the celestial qi and inspects immortal souls. Those who wear this writ shall have the Upper Prime’s immortal officials arrive at their court. After a hundred days of secluded meditation, they shall behold the Lord of the Upper Prime, who will bestow upon them the true scriptures, enabling them to naturally ascend and fly to the Shangqing Palace. Without this writ, one may not practice the Dao or summon celestial perfected beings, lest misfortune befall the body.\n\n**The Purple Silk Writ of the Three Primes’ Great Lords for Generating True Qi and Inspecting Immortals**\nThis is the hidden script of the Three Primes’ Terrace. Upon wearing it and entering seclusion to meditate upon the true for nine days, impure qi dissipates, and the true appears of itself. The Three Primes’ Great Lords shall bestow the true scriptures, and after nine years, one shall gain the ability to fly through the air. Without this writ, one may not practice the immortal Dao, summon immortal officials, or avoid misfortune befalling the body.\n\n**The Flying Celestial True Writ of the Supreme Highest’s Generative True Writ for Inspecting Immortal Qi in the Purple Tenuity Palace**\nWhen the great kalpa of Heaven and Earth cycles, this writ appears within the chambers of the Five Sacred Peaks. Those who wear it and enter seclusion to meditate upon the Three Primes for a hundred days, maintaining pure focus without distraction, shall behold true spirits descending to their form. They shall command immortal officials and acquire natural objects, but must carefully avoid the defilements of life and death. Without this writ, one may not practice the immortal Dao or rashly summon celestial perfected beings, lest one’s body perish without attaining immortality.\n\n**The Supreme Mystic Jade Contract of the Three Primes**\nEngraved within the Northern Chamber of the Numinous Capital, its celestial script of jade characters spans a foot in size. Seven hundred *zhifu* and eighty-two jade maidens bear it. After wearing this writ for a hundred days and meditating with purity upon the Three Primes, one shall naturally comprehend the celestial sounds. Without this writ, one may not rashly practice the flying immortal Dao, lest misfortune befall the seven ancestors, and one forfeit the rank of immortality.\n\n**The Flying Celestial Contract of the Purple Tenuity Mystic Palace**\nEngraved upon the Terrace of the Morning Lamp, it illuminates the Nine Heavens above. The Celestial Venerable of Primordial Beginning in the Supreme Clarity’s Upper Palace bestowed it upon the Queen Mother of the West to summon the officials of the Five Sacred Peaks and the numinous immortals of mountains and seas. With a pure heart and tranquil focus, after a hundred days one shall behold the spirits and naturally know the hidden names of the Nine Heavens. Those who wear it shall attract immortal officials. Without this writ, one may not recite the *Supreme Scripture for Dispelling Demons*, lest great misfortune befall the body. Exercise caution.\n\n**The Flying Celestial Middle Writ for Inspecting Immortals**\nEngraved upon the Three Primes’ Terrace, it was transmitted by the Venerable Lord of Myriad Beginnings to the Supreme Highest, for summoning immortals and attracting the true. The recipient must perform rites at the Five Sacred Peaks for a hundred days, meditating with purity until a three-headed spirit descends to their chamber. Without this writ, one may not rashly seek immortality on the eight solar terms, lest misfortune befall the body. Those who wear it shall attain communion with divine perfected beings and be attended by twelve jade lads, who shall transmit their recitations to be heard in the Nine Heavens. Revealing it lightly shall incur the punishment of the seven ancestors, and the Five Sacred Peaks shall dispatch demonic spirits to interrogate the sinful soul.\n\n**The Nine Heavens’ Dragon Script of the Three Primes’ Empty Cavern Jade Contract for Flying Mystery**\nEngraved upon the gates of the Three Passes of the Nine Heavens, it governs the inspection of all celestial perfected beings. Those who recite the Nine Heavens’ Supreme Scripture without possessing this writ shall be punished by the Nine Heavens’ *Censor of Deceit*. Those who wear this writ shall have the Nine Heavens’ Chancellor summon and inspect the celestial primes, commanding immortal officials. After meditating with purity for a year, they shall behold the Nine Heavens’ True King, or a nine-headed figure riding a nine-colored phoenix, descending to their form. Upon seeing this, do not fear—this is the Nine Heavens’ True King who registers the supreme perfected. Simply prostrate facing south and beseech the divine immortals, and one shall naturally receive the Nine Heavens’ scriptures. Without this writ, one may not rashly recite the *Thirty-Nine Chapters of the Great Cavern True Scripture*, lest the nine ancestors be punished and one’s body be censured by Heaven for the crime of deceit.\n\n**The Primordial Beginning’s Empty Cavern Flying Celestial Middle Writ of the Three Primes’ Jade Contract**\nThe Celestial Venerable of Primordial Beginning engraved it upon the Terrace of the Golden Casement. After ten thousand kalpas, it is transmitted but once. Upon beholding this writ, the Four Ultimates shall inscribe one’s name at Eastern Florescence. After wearing it and meditating with purity for three hundred days, without diverting the gaze or allowing the mind to wander, one shall behold the Celestial Venerable of Primordial Beginning. Upon seeing the Celestial Venerable of Primordial Beginning, one’s lifespan shall extend to ten thousand years. Without this writ, one may not enter the famous mountains, traverse the Five Sacred Peaks, or practice the flying immortal Dao. The Five Sacred Peaks shall reject one, and celestial demons shall assail the body, inevitably incurring great misfortune. Before receiving it, first examine one’s virtue and integrity, then wear it to obtain supreme auspiciousness. Do not wear it lightly, lest misfortune befall. Exercise caution.\n\n**The Supreme Perfected’s Golden Tiger Script of the Nine Heavens’ Upper Empty Cavern Hidden Writ**\nThe Nine Heavens’ Parents inscribed it upon the Terrace of the Phoenix’s Birth. Eight hundred *zhifu* bear it. Every nine thousand years, the Nine Heavens open once, and when they do, nine suns simultaneously illuminate the eastern sky. This writ shall then naturally manifest upon the southern window of those who have attained the Dao. If one possesses the mysterious name in the Emperor’s Register, the Four Perfected shall also descend to bestow it upon the body.",
      "overlap_context": "arning, whose names are inscribed upon the purple tablets and who have not yet fully received the great scriptures, may also singly employ this talisman to resolve karmic roots, avert calamities, extend life, and anticipate divine immortality. On the day of separate transmission, one is permitted to offer two taels of gold and forty feet of purple silk as a pledge to the Nine Heavens, with the oath and purification rites observed as prescribed. The transmission shall then be reverently received.",
      "start_char": 9937,
      "end_char": 11223,
      "start_sentence": 375,
      "end_sentence": 418,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.480430603027344,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "得有此文，九百日精思定神，克见九天父母也。 得见九天父母，无复死没之期。 无此文轻行万徧之道，招召上仙，身必被殃，七祖充役，又不得仙。 右检天大录文等，并出《三元玉检经》。 高上玉晨命魔灵旛 佩之者主制中央黄帝魔灵大王，依本经按日入室，向太岁诵中央曲，施旛於室内，安中央，青书黄缯上。 右出《曲素上经》。 太灵飞玉符 阳气黄精飞行羽章，佩之九年，面生金光，坐在立亡，飞行太虚。 修飞步之道，无此符则不得仰登星魁，超升九玄。 受者黄锦十二尺盟天，登修之日，书符於心，即能吐气成云，乘云飞行。 书黄缯九寸，佩之左肘，六甲十二神，灵飞玉女十二人侍身。 右出《太上回元九道飞行羽经》。 黄帝招灵致真摄魔之符 朱书黄木板上，令广九寸，长一尺二寸，安室中央，修行诵经，入室百日，与神人共言，二年室生自然赤霞之云。 欲致真人天仙，当书如法，着符南向，精思百日，真人降形，仙人诣房，授子神真之道。 右出《金真玉光经》。 赤帝丙丁通灵玉符 丹书黄缯佩身，又以丙丁日丹书黄纸上，南向服一枚，三年丙丁赤圭玉女降见，兆身通灵，知南方万里之事，致南岳仙官自然行厨，九年赤帝降於寝房，迎以丹霞飞轮，上登上清宫。 右出《灵飞六甲经》。 六元豁落辰星精符 欲致北岳真人仙官，以白书黑纸，向北服之，精鬼百日，仙官立到，真人诣房，授兆神仙之药，与兆共言。 欲制黑帝之魔，以黄书黑木九寸板上，向北面百日，天魔束形，万精自丧。 帝皇之章，行七年神仙飞行，白日升天。 右出《七元经》。 玉清扶刀盖华浮罗天玄景晨平隐书金玄内文 太素三元君受之於元始天王，以传太和玉女。 行神仙之道，当以紫笔书黄板上，置西北方，以灭浩帝大魔王官属，招致西北福德之野延贤世界仙官，十二年则致上宫玉女降兆寝房，授兆神真之道。 又紫笔书黄纹上，佩身行之西北延贤世界，则万灵束带，魔王稽首礼迎，得乘飞云羽盖，游行玉清宫。 右出《玉清隐书经》。 北帝广灵灭魔杀鬼玉文 受之於高上三天，卫以太玄玉女二十六人，一名威神玉策，玉清消魔王所佩。 欲杀壬癸日鬼，当青书黄素上，长一尺二寸，广三寸二分，壬日安中央戊上，癸日安己上，闭气十二息，叩齿三十六通，祝曰： 天摧地激，四时摄光，五行促校，检定十方，天帝浮位，皇老出房，高上所讨，声剪无容，先戮鬼爽，后截群凶，千妖万试，莫不伏降，皆如玉文，流铃八冲，豁落交掷，山岳摧崩，承天顺命，伯史齐功。 毕，引气十二咽止，行之十二日，鬼魔灭种，群妖丧精。 青书黄缯上，佩身游行天下，万鬼自窜，千妖匿影，十二年自得役使青腰玉女九人。 右符出《 玉清隐书经》。 上清佩符文黄券诀竟",
      "translated_text": "Having obtained this writ, refine the spirit through nine hundred days of concentrated meditation, and one shall behold the Nine Heavens’ Parents. Once the Nine Heavens’ Parents are seen, there shall be no more cycle of death and dissolution. To practice the myriad circuits of the Dao without this writ, invoking the ascent of celestial immortals, will inevitably incur misfortune upon the body, and one’s seven generations of ancestors shall be conscripted into servitude—furthermore, one shall not attain immortality.\n\nThe above is collated from the celestial registers and writs of the *Three Primordials Jade Registers Sutra*.\n\n**The Highest Jade Dawn’s Commanding Demon-Subduing Banner**\nThose who wear it shall govern the Central Yellow Emperor’s Demon-Spirit Great King. According to the original scripture, enter the chamber on the appointed day, face the Year-Star, recite the Central Melody, display the banner within the chamber, and place it in the center. Inscribe it in green upon yellow silk.\nThe above is from the *Scripture of the Subtle Melody*.\n\n**The Supreme Numinous Flying Jade Talisman**\nThe yang qi and yellow essence take flight as feathered script. Wearing it for nine years, one’s face shall radiate golden light; one may vanish while sitting or standing and soar through the Great Void. In practicing the Dao of flying steps, without this talisman, one cannot ascend to the Starry Keel or transcend the Nine Mysteries. The recipient shall pledge twelve feet of yellow brocade to Heaven. On the day of ascetic practice, inscribe the talisman upon the heart, and one shall then exhale qi to form clouds and ride them in flight. Inscribe it upon nine inches of yellow silk and wear it on the left elbow; the Six Jia and Twelve Spirits, along with twelve Jade Maidens of the Numinous Flight, shall attend the body.\nThe above is from the *Supreme Highest Nine Ways of Returning to the Origin and Flying Feather Scripture*.\n\n**The Yellow Emperor’s Talisman for Summoning Spirits, Attracting Perfected Ones, and Subduing Demons**\nInscribe it in vermilion upon a yellow wooden board, nine inches wide and twelve inches long. Place it in the center of the chamber. Engage in scriptural recitation and practice within the chamber for a hundred days, and one shall converse with divine beings. After two years, the chamber shall naturally generate clouds of crimson radiance. To summon Perfected Ones and Heavenly Immortals, inscribe it according to the method, face south with the talisman, and meditate with precision for a hundred days. The Perfected Ones shall descend in form, and immortals shall visit the chamber to transmit the Dao of divine perfection.\nThe above is from the *Scripture of Golden Perfection and Jade Radiance*.\n\n**The Red Emperor’s Bing-Ding Numinous Communion Jade Talisman**\nInscribe it in cinnabar upon yellow silk and wear it on the body. On Bing or Ding days, inscribe it in cinnabar upon yellow paper, face south, and ingest one talisman. After three years, the Jade Maiden of the Bing-Ding Red Jade shall descend and appear; the body shall attain numinous communion, perceiving all affairs within ten thousand *li* of the southern realm. The immortal officials of the Southern Marchmount shall naturally provide traveling kitchens. After nine years, the Red Emperor shall descend to the bedchamber, welcoming the adept with a flying chariot of cinnabar radiance to ascend to the Upper Clarity Palace.\nThe above is from the *Scripture of the Numinous Flight of the Six Jia*.\n\n**The Six Primordials’ Vast-Falling Morning Star Essence Talisman**\nTo summon the Perfected Ones and immortal officials of the Northern Marchmount, inscribe it in white upon black paper, face north, and ingest it. After a hundred days of refining demons, the immortal officials shall arrive at once, and Perfected Ones shall visit the chamber to transmit the elixir of divine immortality and converse with the adept. To subdue the demons of the Black Emperor, inscribe it in yellow upon a nine-inch black wooden board, face north for a hundred days, and the celestial demons shall be bound in form while myriad spirits shall perish of themselves. Practicing the Emperor’s Rites for seven years, one shall attain divine immortality and ascend to Heaven in broad daylight.\nThe above is from the *Scripture of the Seven Primordials*.\n\n**The Jade Clarity’s Floating-Radiance Canopy of the Flowering Heavenly Mystery, the Hidden Writ of the Golden Mystery’s Inner Text**\nThe Three Primordials of the Grand Simplicity received it from the Celestial King of the Primordial Beginning and transmitted it to the Jade Maiden of the Great Harmony. To practice the Dao of divine immortality, inscribe it in purple upon a yellow board and place it in the northwest to extinguish the demonic officials and retinue of the Grand Demon King of the Vast Emperor. It shall summon the immortal officials of the Northwest Realm of Blessed Virtue and the World of Extending Worthies. After twelve years, the Jade Maidens of the Upper Palace shall descend to the adept’s bedchamber to transmit the Dao of divine perfection. Furthermore, inscribe it in purple upon yellow silk and wear it while traveling to the Northwest Realm of Extending Worthies; then, the myriad spirits shall gird themselves in submission, and demon kings shall bow their heads in reverence. One shall ride a flying cloud and feathered canopy to roam the Jade Clarity Palace.\nThe above is from the *Scripture of the Jade Clarity’s Hidden Writ*.\n\n**The Northern Emperor’s Vast Numinous Demon-Slaying Ghost-Killing Jade Writ**\nReceived from the Highest Three Heavens, guarded by twenty-six Jade Maidens of the Great Mystery, it is also called the *Mighty Divine Jade Strategy*, worn by the Demon-Quelling King of Jade Clarity. To slay ghosts of Ren and Gui days, inscribe it in green upon yellow silk, twelve inches long and three inches and two *fen* wide. On Ren days, place it upon the central Wu; on Gui days, place it upon Ji. Hold the breath for twelve cycles, knock the teeth thirty-six times, and recite the incantation:\n*\"Heaven topples, earth surges; the four seasons seize their light. The five phases hasten their reckoning, inspecting and fixing the ten directions. The Celestial Emperor ascends his throne; the August Elder emerges from his chamber. By the command of the Highest, the sound severs without refuge. First execute the ghostly wretches, then sever the multitude of malevolence. A thousand demons, ten thousand trials—none shall not submit and descend. All shall conform to the Jade Writ. The flowing bells of the eight thoroughfares, the vast-falling stars cast in exchange, mountains and peaks collapse and crumble. Obey Heaven and follow the mandate; the Earls and Scribes shall share in the merit.\"*\nConclude by drawing in the breath twelve times and swallowing it. Practicing this for twelve days, the demonic kind shall be extinguished, and the multitude of malevolent spirits shall lose their essence. Inscribe it in green upon yellow silk and wear it while traveling the world; myriad ghosts shall flee of themselves, and a thousand demons shall conceal their traces. After twelve years, one shall naturally gain the service of nine Jade Maidens of the Azure Waist.\nThis talisman is from the *Scripture of the Jade Clarity’s Hidden Writ*.\n\n**Here concludes the Jade Writs and Yellow Pledge Scripts of the Highest Clarity.**",
      "overlap_context": "Upper Empty Cavern Hidden Writ**\nThe Nine Heavens’ Parents inscribed it upon the Terrace of the Phoenix’s Birth. Eight hundred *zhifu* bear it. Every nine thousand years, the Nine Heavens open once, and when they do, nine suns simultaneously illuminate the eastern sky. This writ shall then naturally manifest upon the southern window of those who have attained the Dao. If one possesses the mysterious name in the Emperor’s Register, the Four Perfected shall also descend to bestow it upon the body.",
      "start_char": 11223,
      "end_char": 12308,
      "start_sentence": 419,
      "end_sentence": 456,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.84636974334717,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清佩符文诀.txt",
        "category": "玉诀类"
      }
    }
  ]
}