{
  "source_id": "上清高上玉晨凤台曲素上经",
  "source_file": "chunked_daozang\\上清高上玉晨凤台曲素上经.json",
  "total_chunks": 7,
  "total_original_chars": 7023,
  "total_translated_chars": 46372,
  "total_translation_time": 243.0788061618805,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清高上玉晨凤台曲素上经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Highest Jade Dawn Phoenix Terrace Winding Plain Upper Scripture**\n\n**Scripture Title:** *The Supreme Clarity Highest Jade Dawn Phoenix Terrace Winding Plain Upper Scripture*. Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. One scroll. Base text from *The Orthodox Daoist Canon*, Proper Section I.\n\n---\n\n**The Supreme Clarity Highest Jade Dawn Phoenix Terrace Winding Plain Upper Scripture**\n\nThe *Highest Jade Dawn Phoenix Terrace Winding Plain Upper Scripture* arises from the Ninefold Winding Phoenix Terrace of the Mysterious Capital, formed by the natural coalescence of phoenix *qi*. Its jade chambers reside above the Nine Heavens, on the yang side of the Jade Capital, where the void generates the Eight Convergences of Realized *Qi*. Ten turns and nine bends pierce the eight directions, summoning the soaring pinions of the whirlwind above and communing with the numinous spirits of the Eight Simplicities on all sides. It gathers the *qi* of the Nine Origins and the Orthodox Unity to compose verses of sorrow and joy, illuminated upon the Mysterious Terrace. Each character spans a *zhang* in breadth, its text resplendent and radiant, penetrating the Nine Heavens. A flying phoenix clouds the canopy; purple *qi* swirls in obscurity. Scaled creatures and bounding beasts interweave in chaotic motion. Six-maned lions stand guard at the lower gates, while the Five Thearch Jade Immortals wield five-colored banners of life-summoning demonic spirits to command the five directions. On the right, the Jade Maidens of Great Flower Mountain attend; on the left, the Golden Immortals and Jade Lads, three thousand each, serve the perfumed rites of the True One. Sun and moon flank its brilliance; the Seven Origins revolve in numinous harmony. The Three Dawns align in splendor; mysterious light illumines all. Jade groves sway their branches; jade pipes resound through the courtyard. The radiance of the Seven Treasures flows and shines in the Supreme Clarity—this is the domain governed by the Highest Jade Dawn Supreme Lord of the Dao.\n\nThe Elder of the Mysterious Capital inscribed the phoenix-script verses of sorrow and joy in the Realized Writ and transmitted them to the Lord of the Dao. Thus, the myriad perfected beings of the upper heavens and the flying immortals of the Five Marchmounts ascend the Phoenix Terrace on the fifth, fifteenth, and twenty-fifth days of each month to feast, offer incense, and chant the verses of sorrow and joy. Above, they celebrate the divine perfected; below, they lament the mortal multitudes. Their words are subtle and void, jade-bright and penetratingly clear. The Four Perfected bow their heads; the ten thousand immortals chant in harmony. Incense scatters into the empyrean; fragrant smoke drifts through the empty courtyard.\n\nAll who have attained perfected status in the upper palaces, as well as those newly embarking on the path to immortality, must cultivate the *qi* of the Nine Heavens’ Phoenix, study the Realized Writ of the Mysterious Mound, and recite the verses of sorrow and joy. From primordial antiquity, this teaching was transmitted but once in ten thousand kalpas. Now, if a worthy recipient appears, it may be passed down thrice within seven hundred years. Those who obtain its text may ascend to the Supreme Clarity, mount the Ninefold Winding Phoenix Terrace, and pay homage to the Jade Perfected. To recklessly divulge it brings blindness; the seven generations of ancestors shall bear the burden. Guard it well, and one becomes a divine immortal.\n\nWhoever bears the Five Thearchs’ banners of life-summoning demonic spirits from the Mysterious Mound of the Great Perfected Writ may command the void, summon spirits, and subdue demons. Whoever obtains the secret talismans of the Five Phases may call back the wandering *po* and secure the *hun*, preserving the spirit for eternal endurance. Whoever recites the verses of sorrow and joy transcends the Nine Mysteries of the body and roams the Jade Capital in feasting delight. Whoever wears the Winding Plain Phoenix *Qi* shall behold the advent of the Sagely Lord of Great Peace, ascend to the Mysterious Capital, and receive the rank of upper immortal.\n\nThus, the phoenix-script verses of sorrow and joy from the Nine Heavens, along with the Great Perfected Writ of the Mysterious Mound, are formed from the natural *qi* of the Nine Heavens. Their numinous text manifests amid the empty mystery, enduring ninety thousand kalpas before the Elder of the Mysterious Capital received it from the Great Void and transmitted it to the Supreme Lord of the Great Dao. The Lord of the Dao passed it to the Perfected of the Supreme Ultimate, who in turn transmitted it to the Azure Lad of Square Cauldron in the Eastern Sea, instructing him to convey it to Daoists whose jade names are already inscribed—those destined to become divine immortals. After wearing it for twenty years, one may behold the Three Origin Lords and welcome the Sagely Lord at the Golden Gates of the Supreme Clarity. It may be transmitted thrice in seven hundred years, and once every century to no more than two worthy recipients. During the retreat, one must burn a *jin* of fine incense and offer five *liang* of gold. After swearing the golden-blue oath, it replaces the blood-altar covenant.\n\n---\n\n**The Luminous Verses of Sorrow and Joy from the Highest Jade Dawn Winding Plain**\n\n**Eastern Thearch of the Bluegreen**\nGather my natural *qi*, congeal and transform the Purple Phoenix City.\nThe lofty terrace soars beyond the Nine Ridges; its layered heights flourish with flying jade.\nResplendent joy rises above the layered void; its winding turns pierce the Eight Clarities.\nThe Purple Void radiates the cloud palaces; its flowing brilliance veils the Five Numinous.\nFour directions stretch into boundless wilds; the Eight *Qi* revolve in circular clarity.\nThe whirlwind propels the Great Void; the Seven Luminaries turn the celestial scriptures.\nThey arrive as if rootless; they depart with the ebb of transformation.\nWithin the Nine Enclosures’ intersecting paths, the Two Images contend in mutual ascent.\nThe Thearch of Unity secures the Central Origin; the Four Principles do not decline in numinosity.\nSouthward, it gathers the fruits of the Flying Sovereign; northward, it draws from the Broad Cold Court.\nMysterious chambers converge in true communion; void songs arise naturally.\nThe Five Thearchs command the numinous banners; their standards summon the myriad spirits.\nDemons howl from the empty midst; the Dao governs in joy unending.\nThus, the Winding Plain verses arise to celebrate the divine and delight in great peace.\nWith whom shall we covenant? Ten thousand kalpas become a single lifespan.\nRevolving through ninety thousand kalpas, we roam together in the Purple Phoenix chariot.\nThe Purple Phoenix Terrace emerges from the void; its jade towers align with the Supreme Subtlety.\nThe numinous wind pierces the Eight Convergences; the northern window opens the Gate of Heaven.\nAbove, the singing youths forever chant the cycles of rise and fall.\nAt dawn, they ride the light in roaming; at dusk, they return with the light.\nThe Two Luminaries merge as one; they fear losing the radiance of light.\nThe Nine and Five do not abide forever; heaven and earth face collapse and peril.\nThe great kalpa ends in a single cedar; the Hundred and Six ride the revolving fate.\nVast springs surge through the Nine Ridges; great birds soar at heaven’s edge.\nThe myriad creatures drift in endless currents; even the mountains cannot be relied upon.\nWailing and weeping know no bounds—how can one not grieve in one’s heart?\nThe worthy and sagely diligently recite the scriptures, thus riding the light in flight.\nWhen the time comes, they shall be welcomed together at the gates of the Nine Heavens.\nWhen the golden horse’s hour is exhausted, ten thousand plagues surge in chaotic motion.\nOne sees no aspiring immortals—only hears the lament of the dead.\nAlas, these foolish mortals! How piteous their clinging to life!\n\n**Southern Thearch of the Vermilion**\nDispel sorrow at the Nine Mysteries Terrace; gather joy upon the steps of the Great Void.\nIn fellowship with the perfected of the Ten Heavens, summon the Lad of the Eastern Sea with a whistle.\nThe *qi* of the Eight Convergences flows in all directions; the winds of the Towering Terrace intermingle.\nEyes brighten the Western Flower Lodge; the mind harmonizes with the Broad Cold Palace.\n\nThe purple phoenix descends in graceful dance,\nthe Nine Peaks stand desolate and still.\nMy gaze drifts across boundless wilds,\nI look up to behold the kalpa’s towering height.\nClear songs harmonize in palace tones,\nsorrow and joy follow one another.\nTwo paths align in perfect accord,\nprinciples seem opposed yet return to unity.\nTogether we rejoice without end,\nholding fast to beginning and end alike.\nSweetly we drink the nectar of Jade Pool,\ngazing in joy at the soaring Flower Sovereign.\nThe numinous gourd may bring contentment,\nyet it cannot compare to the radiance of sun and moon.\nThe Seven Luminaries stream forth fragrant light—\nhow could such joy ever be forgotten?\n\nYet the great kalpa has its destined end,\nwhen its course meets the dual forces’ collapse.\nThe Dragon Gate severs the River of Heaven,\nthe Three and Five turn against each other.\nThe Crimson Guardian occupies the Eastern Well,\nthe Flower Canopy subdues the morning stars.\nDark radiance dims the Eight Wastes,\nfoul *qi* veils the heavens’ essence.\nThe Three Offices press upon one another,\nthe Five Peaks lose their steadfast power.\nTen thousand plagues surge in chaotic motion,\nthe Northern Thearch marshals his demonic troops.\nEight nets spread beyond the heavens—\neven the Sage Lord cannot purify them.\nThis is the knotting of natural *qi*,\nscaling the layered Ninefold City.\nFrom on high I behold the myriad multitudes,\nsorrow and joy arise from this.\nMystic songs disperse the heart’s cares,\nyet hidden joy turns to weeping.\nAlas for these stubborn mortals,\nclinging to wealth and ensnared by desire!\nJoyfully they await their fate’s arrival,\nheedless of calamity that coils around them.\nThe wise and sagacious turn toward the Dao,\nday and night diligently reciting scriptures.\nThey venerate emptiness and contemplate the Mystery,\nto transcend the limits of mortal years.\nIf one can trace the Dao to its source,\nthe Eight Festivals shall resound with jade names.\nThey shall escape the Nine Calamities,\nand behold for you the Great Peace.\n\n**Western Thearch of the White**\nThe jade phoenix stirs the morning gale,\nthe Purple Terrace gleams in the Jade Grove.\nFlowing light brushes the layered mysteries,\nits towering form pierces the Nine Yin.\nPurple radiance scatters crimson clouds,\nflying mists seek one another.\nThe Seven Treasures adorn jade branches,\nspirit beasts gallop through clouded peaks.\nTen thousand immortals ride the void in song,\ndivine winds carry wondrous tones.\nAbove dwells the Lofty Dawn Master,\nserene and poised in whistle and chant.\nThe Eight Convergences assume their natural forms,\ntheir descent all of fragrant gold.\nJade is chewed through kalpas’ dawn,\njade nectar scatters into the centered heart.\nBright pearls sing the numinous song,\nthe Dharma’s countenance harmonizes with the clear zither.\nJade stanzas reveal the Dao’s ultimate lineage,\nsorrow and joy unbind the human heart.\nThey release me from mortal limits—\nhow profound is this true delight!\nWithout the high immortal’s resonance,\nhow could one share in this feast?\nAt dawn they sport in the Eastern Flower Palace,\nat dusk they wander the Western Flower Hall.\nThey find joy in the Twin Flower Lodges,\nyet never meet with worldly pleasures.\nOnly the strains of the Mystic Singer are heard,\ntheir mournful voices grieving the Heavenly Lad.\nSorrowful echoes flow through the Cold Court,\nlamenting the exhaustion of the world’s fate.\nThe Heavenly Steed leaps across the Nine Rivers,\nthe Raven Mother rides the flying dragon.\nThe Dark Ford lacks a bridge,\nthe dual *qi* remain sundered and unlinked.\nAscend my layered terrace,\nlook up to witness the Nine Calamities.\nFoul *qi* fills the Three Powers,\nthe myriad multitudes bear the brunt of disaster.\nThe Eight Domains are left without a single soul,\ngreat and small mountains alike collapse.\nPity those who never sought learning,\nhearing the scriptures as if deaf and dumb.\nTogether they submit to fate’s course,\nheedless until their destined end.\nAlas, how cruel their appointed time!\nThinking of them, my heart is wounded.\n\n**Northern Thearch of the Black**\nThe purple phoenix soars into the void,\nscaling the layered Ninefold Mystery.\nWhen *qi* coalesces, its shadow appears;\nwhen *qi* scatters, the spirit vanishes.\nDrifting and swaying beyond all bounds,\nheavenly music delights my heart.\nIn harmony with the Eight Convergences’ song,\nI join the ranks of the lofty immortals.\nI summon the perfected of the Ten Heavens,\nfeasting with the drivers of the Nine Phoenixes.\nAbove I ascend the Jade Capital’s gates,\nbelow I sport in the Towering Terrace’s realm.\nFeathered riders urge on jade wheels,\npurple mists support them in the void.\nFrom dawn’s audience to the next morning’s wait,\ntogether we rejoice without end.\nMy gaze drifts with fate’s unfolding,\na hundred million cedars complete one cycle.\nI delight in the heart’s natural ease,\ndispersing the world’s sorrows from my breast.\nWithout the numinous immortal’s essence,\nwho could share in this journey?\nAlas, within the Empty Cavern,\njoy gives rise to sorrow once more.\nAt dawn I ascend the Eastern Meng Peak,\nat dusk I observe the Western Mound.\nI do not see the Mother of the Nine Spirits—\nthe Northern Perfected seek the Dao.\nVastly I inquire of the Great Image’s course,\nwhen suddenly the dual *qi* encircle one another.\nThe Nine Dragons govern the Eastern Well,\nthe Heavenly Steed emerges from the Western Pass.\nThe Northern Thearch unleashes his heavenly troops,\nthe Five Peaks align with the Mystery.\nTen thousand demons are bound in chains,\nthe Five Agents plot in advance.\nWar’s disasters spread across the heavens,\nthe myriad multitudes are already ensnared.\nAbove and below all receive their reckoning,\nswept clean without delay.\nAlas for those in the Five Calamities—\nwhen fate arrives, none are spared.\nI ascend the Eight Convergences’ palace,\njoining my company in the hidden realm.\nSurveying those who pursue the ultimate learning,\ntheir blessed lands support them.\nAbandoning home to seek my Dao,\nthey shall surely transcend their mortal forms.\nDiligently cultivating the supreme scriptures,\nwhen the Dao is attained, they shall await one another.\nCarefree, they observe the Phoenix Terrace—\nhow could this journey not be joyous?\n\n**Central Thearch of the Yellow**\nGreat joy gathers at the Middle Origin,\nthe Middle Origin assembles in the Joyous Court.\nAbove, the *qi* of the Eight Convergences,\nthe purple phoenix is born in graceful dance.\nGolden branches cling to jade roots,\nthe Seven Treasures weave into flowered bells.\nDragons soar beyond the utmost peaks,\nphoenixes’ cries startle ten thousand miles.\nNo miscellaneous guests are seen—\nonly the sounds of wind and clouds.\nPalace tones harmonize of themselves,\ntheir resonance naturally complete.\nMystic songs chant wondrous melodies,\nsorrow and joy weave into scriptures.\nWe seek one another of our own accord—\nwho knows the perfected ones’ numinosity?\nBrocade clouds gird the night’s moon,\npurple radiance veils flying jade.\nThe Three Dawns illuminate the Great Brilliance,\nthe Seven Origins illumine the Five Stars.\nNuminous banners bear majestic light,\nflowing mists shroud the purple clarity.\nI call the Western Flower wondrous,\nyet it cannot compare to the Purple Phoenix City.\nAbove dwell those who loosen their cares,\none glance brings joy for ten thousand years.\nTogether we rejoice through endless kalpas,\nsuddenly aware of heaven and earth’s collapse.\nThe numinous course has its own reckoning,\nits end determined by the Mystery’s freedom.\nComing and going follow fate’s turning—\nwhy should sorrow entangle the living?\nDispersing cares beyond the Eight Wastes,\nthe Great Image does not deviate from truth.\nCarefree in the Joyous Court,\nwho would claim sorrow as kin?\nThe Five Calamities are constant gatherings,\nyet those who suffer are of their own making.\nThough palace tones may not harmonize,\nthe great return finds its own balance.\nThus I compose songs of sorrow and joy,\nto guide those who cultivate the Dao.\nIf one studies the numinous texts,\ntheir wondrous meaning shall naturally shine.\nSimply wear the plain jade stanzas,\nand you shall enter the Ford of No Sorrow.\nRiding the void to ascend the Phoenix Terrace,\ngazing from on high to receive the Tang’s years.\nWhat joy could surpass this?\nWhere lies the space for sorrow?\n\nThe *Highest Jade Dawn Songs of Sorrow and Joy* resound upon the Phoenix Terrace in the void, their numinous texts illuminating the Five Directions, their golden tones soaring and radiant through the Ten Heavens. The Perfected Ones of the Ninefold Jade Capital all inscribe golden tablets with purple brushstrokes, joining their voices in unison to chant the mysterious *Songs of Sorrow and Joy*. Their words plumb profound depths, their wondrous essence penetrating the abyss—none but the highest company of immortals can fathom their verses.\n\nThere is one named Golden Radiance of the Eastern Flower, whose script is inscribed upon the Phoenix Gate; only thus may one behold these texts. Those who receive and wear the *Phoenix Qi Mystic Mound Perfected Writ* and the *Command Banners of Demon Spirits*, reciting the *Songs of Sorrow and Joy*, shall be guarded by the Five Emperors, protected by the heavenly demons, and sponsored for ascension as Transcendent Ones. They shall be welcomed by the Sacred Lord in the Upper Clarity Palace and wander the halls of the Phoenix Terrace.\n\nFor all who receive these texts, on the days of their own fate-star, the Grand Year-Star, the Eight Seasonal Nodes, and the fifth, fifteenth, and twenty-fifth days of each month, they must bathe, purify themselves, and enter the chamber. First, facing east, they recite the Green Emperor’s song to completion and bow in homage to the Jade Perfected. Turning south, they recite the Red Emperor’s song to completion and bow in homage to the Jade Perfected. Turning west, they recite the White Emperor’s song to completion and bow in homage to the Jade Perfected. Turning north, they recite the Black Emperor’s song to completion and bow in homage to the Jade Perfected. [Turning toward the Grand Year-Star, they recite the Yellow Emperor’s song to completion and bow in homage to the Jade Perfected.] After completing the Five Directions, they return to face north, bowing nine times to the Jade Dawn Lord, then raise their gaze and swallow qi nine times before ceasing.\n\nIn this manner, the Five Emperor Banners are displayed in the five directions of the chamber.\n\n**Five Emperor Command Banners of Demon Spirits**\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Eastern Green Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Eastern Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in white upon blue-green silk.*\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Southern Red Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Southern Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in black upon crimson silk.*\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Western White Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Western Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in vermilion upon white silk.*\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Northern Black Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Northern Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in yellow upon black silk.*\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Central Yellow Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Central Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in blue-green upon yellow silk.*\n\nThe above are the *Highest Five Emperor Command Banners of Demon Spirits*, which emerge from the void upon the Phoenix Terrace and are presided over by the Jade Perfected Ones of the Five Emperors. For those whose destiny aligns with the Perfected and immortality, the Eastern Flower shall present these texts to the Five Emperor Demon Kings for their protection and sponsorship. Following the protocols of command, the Five Peaks shall dispatch immortal officials with thousands of chariots and tens of thousands of riders in feathered wheels to welcome them and ascend to the Purple Phoenix Jade Terrace.\n\nThose who wear these texts shall have their names recorded by the Five Emperors, be revered and protected by heavenly demons, welcomed by the administrators of the Ten Realms, and within nine years, receive the descent of the numinous and ascend upon feathered wheels. Men who receive them shall present the texts at lofty peaks, while women shall offer libations to transmit the numinous writ. After ten years, men shall again present the texts, and women shall again offer libations to the *Phoenix Qi Mystic Mound Perfected Writ*, following the same ritual protocols.\n\n**The Jade Stanza Secrets of the Left Perfected of the Great Ultimate**\n*Also named the* Mystic Mound Perfected Writ of the Phoenix Qi of the Nine Heavens\n\nThe Most High transmitted this to the Left Perfected of the Great Ultimate, who passed it to the Great Lord of the Azure Lad of the Square Pond Palace in the Eastern Sea, to be further transmitted to Daoist adepts whose names are inscribed in jade and who are destined to become Perfected Immortals. Those who wear it for twenty years shall behold the Lords of the Three Origins and be welcomed by the Sacred Lord in the Golden Gates of the Upper Clarity. After seven hundred years, it may be transmitted thrice, and only once every hundred years may it be bestowed upon two recipients.\n\nThree days of purification are required, during which ten pounds of incense are burned and one hundred taels of gold are offered. Upon completion of the transmission, the recipient swears a golden-blue oath in place of the blood-altar covenant.\n\n**Jade Stanza Secrets**\nThe *Mystic Mound Perfected Writ* contains hidden texts that summon the host of spirits and command the myriad essences.\n*Inscribed in vermilion upon white silk and worn upon the body.*\n\nForty feet of white silk serve as the contract for blood and fluid, replacing the blood-oath of the jade stanzas. Without purity, purification, or the proper untying of the registers, the transmission is invalid.\nTwelve feet of blue-green silk serve as the contract for immortality, embodying the oath of transmission once every seven hundred years. It must be worn when entering illness, fire, water, mountains, or chambers while bearing the registers.\nThree pairs of golden rings serve as the contract for great transcendence and eternal life, embodying the covenant of unyielding resolve. Without this text, a Daoist cannot behold the Lords of the Three Origins.\nNine taels of incense serve as the contract for communion with the numinous, forming the alliance of luminous spirits. Without it, one cannot summon or command the ghosts of the Six Heavens.\n\nMen receive it facing north, with the master facing south.\nWomen receive it facing south, with the master facing north.\n\nMen undergo the reception for ten years, then perform one purification rite and submit the writ. Women, upon submitting the writ and performing the jiao offering, must summon the master’s oral transmission. During the reception, a jiao offering is held once every ten years. The register incense and fruits are arranged in a secluded chamber, invoking the Most High Transcendent Perfected of Scenic Clouds, the Celestial Venerable, and the official [name] to uphold the precepts. As the transmitting master’s name is recited in the register, no written text is used; instead, the master’s name is sworn upon the blue-green register and incense. The Most High Transcendent Perfected of Scenic Clouds opens the Great Register of Heaven, while the Celestial Venerable bestows it upon the Lords of the Five Peaks. Wearing it averts misfortune, dispels calamity, repels evil, expels malevolence, summons the host of spirits, commands the hundred birds, orders ghosts and spirits, extends life by a hundred thousand years, restores the soul, reverses aging, secures the body, and ensures eternal existence. It is also called the \"Life-Guaranteeing Contract of the Three Heavens.\"\n\nThe Perfected Lord of the Mysterious Mound of Ninefold Heavenly Phoenix Qi, the Ninefold Qi Celestial Venerable, leads ten White-Silk Jade Maidens, who are arrayed within the recipient’s body. The Perfected Writ of the Mysterious Mound of Ninefold Heavenly Phoenix Qi, the Command Banner of Numinous Spirits, is inscribed in continuous script on nine feet of white silk and bestowed to be worn on the body. If one severs ties with worldly residence, the banner is inscribed on five-colored silks corresponding to the five directions. The Command Banner of Numinous Spirits is placed in the five directions to subdue the myriad spirits, govern celestial demons, summon immortal officials, and welcome the Sagely Lord of Great Peace.\n\nAccording to the immortal statutes of the Celestial Venerable of the Mysterious Capital, after three days of purification upon reception and wearing, the pact is sealed with blue-green silk, three pairs of rings, incense, and silk. The transmission is recorded with the year, month, and day under the cyclical signs, swearing to uphold the Daoist laws: no licentiousness, no negligence, no excess, no deceit, no malice, no envy; practicing benevolence, accumulating virtue, preserving the spirit, and commanding the Perfected. Those who wear the register become immortals. After donning the register, this concludes the rite.\n\nAt the initial reception of this text, men submit the writ at their natal peak, notifying the spirits and transmitting the text. After ten years, the submission is repeated as before; three submissions are made in total. For women, the process is the same: one jiao offering after ten years, with three jiao offerings completed in total.\n\nIn the first year of the Yangshuo era, the cyclical year gengyin, on the first day of the ninth month, jiachen, the Perfected of the Western Peak, Master Wang, aged forty-two, born in the seventh month, now receives from the Great Master of the Lofty Dawn, the Azure Lad of the Eastern Sea, the Winding Silk Phoenix Writ and the Mysterious Mound Perfected Writ of the Five Phases’ Upper Talismans of Sorrow and Joy. Respectfully invoking the Five Thearchs, Five Perfected, Five Immortals, Five Peaks, and Five Numinous Spirits, he submits the writ to form his own covenant and attain Perfected-hood, submitting his name to the Eastern Florescence to be recorded as a Celestial Immortal. May he eternally preserve primordial auspiciousness, in accordance with the writ of the Nine Heavens.\n\nFive silver tablets are inscribed in red and placed upon five altars. After the master faces north and completes the invocation to the spirits, the tablets are buried at the Five Peaks. If only one peak is used, they may be buried according to its respective direction.\n\nThe master arranges five altars, faces north, and strikes his teeth thirty-six times in succession, then intones the prayer:\n\n\"To the Nine Mysteries’ Supreme Numen, the Primordial Heavenly Thearch of the Origin; the Jade Immortals of the Five Thearchs; and the Perfected of the Great Palaces of the Numinous Peaks—Wang Jia has undergone the Three Refinements and Nine Trials, his qi and bones now in accord with the Perfected. Reverently following the supremely auspicious covenant-writ of the Nine Heavens, he submits his writ to declare his destiny, burying the tablets upon the numinous mountains. Henceforth, in accordance with the writ’s curves and inflections, he petitions the Demon Kings below to safeguard and advance his Perfected-hood, that he may ascend as a Flying Immortal beneath the feathered canopy, mounting to the Purple Phoenix Palace of Jade Clarity. Should any fail to comply thrice over, in accordance with the statutes of the Great Perfected, their transgression shall be reported for due enforcement.\"\n\nFor female recipients, the rite is performed once every ten years.\n\nFor the first libation and transmission of the writ, it shall take place within a secluded chamber. A single altar is set, facing north, with incense burned and five trays of sweet fruits placed before the altar. The Winding Silk Writ is copied and wrapped in a gossamer silk cloth, then set upon a separate table. The master faces north, the disciple south; the master strikes his teeth thirty-six times and softly intones:\n\n\"To the Lofty Immortal of Scenic Clouds of Grand Clarity and the Celestial Register’s Supreme Elder of the Enduring Heaven—here stands the male Perfected Wang Jia, aged [X] years, born in the [X] month, who reverently receives the Winding Silk’s verses of sorrow and joy, the Five Thearchs’ Mandate-Demon Spirit Banners, the Nine Heavens’ Phoenix Writ of the Mysterious Mound Perfected, and the Five Phases’ Secret Talismans. On this supremely auspicious day, he invokes the qi of the Lofty Morn to descend and illumine his person, beseeching the Five Thearchs, Five Perfected, Five Peaks, and Five Numinous Spirits to inscribe his jade name and submit it to the Five Demon Kings of the Azure Palace, that they may safeguard and advance his Perfected-hood, swiftly attaining immortality to soar through the Grand Clarity and pay homage to the Morn Thearch.\"\n\nAfter three libations, the proceedings shall follow the Mysterious Statutes of the Nine Heavens and the Illuminated Writs of the Grand Perfected. The rite is thus performed thrice in full, after which the libations cease.\n\n**The Supreme Winding Silk and Five Phases’ Secret Talismans**\n*Composed by the Left Immortal Duke of the Supreme Ultimate*\n\nThe Most High addresses the Golden Portal Thearch of Later Saints, saying: When primordial qi divided and judgment was rendered, Heaven and Earth unfolded; yin and yang assumed their positions, the Three and Five took their palaces, the Six Jia were mystically arrayed, and the Five Phases—Metal, Wood, Water, Fire, and Earth—were transformed and born. They govern the Middle Prime, mutually engendering through qi, blending and coalescing into Perfection.\n\nLater students seeking immortality who do not know the source of the Dao labor in vain with meditative visualization, exhausting body and spirit. Their accumulated efforts yield no resonance, and their hope for the Dao fades into obscurity. To seek the origin, one must return to the root; to seek life while losing the root is to attain nothing whole.\n\nThus, I have excerpted and compiled the Jade Writs of the Supreme August, revealing them to you so that you may select the worthy for transmission. These dharma treasures are arcane and not to be spoken lightly; follow the Illuminated Statutes and receive them with reverence.\n\nThe Most High says: The secret writs of the Five Phases came into being with Heaven and Earth, blending and transforming the myriad Perfected and governing the numinous spirits. Without the Five Phases, Heaven’s Three Luminaries would not shine; without the Five Phases, Earth’s mountains and peaks would crumble and collapse; without the Five Phases, the human body would decay and perish. Thus, the Five Phases blend and coalesce, mutually sustaining their generation.\n\nIf one is sincere of heart, one must seek the true names. Having received this method, Heaven and Earth share a common root. Summon the hun-soul and call forth the po-soul to safeguard life and command the spirits. Cultivate this for nine years, and you will ascend to transcendence as an Upper Immortal.\n\nTo receive the Winding Silk oral instructions and study the Dao of the Supreme Perfected, one must know the inner taboo names of the Five Phases’ Father and Mother True Lords. Visualize them to summon the hun-soul and restrain the po-soul. When hun and po endure, the true spirits all return to their palaces, guarding the bodily form, enabling a return to the natural state. Thus, on the appointed day, you may wander in leisure through the Jade Clarity and merge with qi into Perfection.\n\nFor all who cultivate this Dao: On *jia*-*yi* days, enter the chamber, burn incense, and face east to visualize the two true spirits of *jia*-Father and *yi*-Mother. The Father’s taboo name is Qing Ying; he wears the Nine Primordials Azure Jade Mystic Crown, a robe of kingfisher-feather patterns, and holds the Azure Essence Life-Safeguarding Secret Talisman. The Mother’s taboo name is Hao Xian; her hair is coiled in a cascading cloud chignon, she wears a flying azure brocade skirt, and holds the Elixir Radiance Spirit-Transforming Talisman. The two present their talismans to my body. Then, knock the teeth nine times and recite the prayer:\n\n*\"True Lord Father and Mother, transform and engender the Two Numinous Ones. The Three and Five return to Perfection, merging with the Primordial in darkness. Externally, gather the wandering hun-soul; internally, secure the essence of the po-soul. Abide long in the palace, never departing from the original form. Forever with the Three Primes, together safeguard the Jade Clarity.\"*\n\nWhen finished, ingest the talisman, knock the teeth nine more times, and swallow saliva three times to conclude.\n\nCultivate this for nine years, and you will perceive the boundless with penetrating vision, discerning distant texts and foreknowing fortune and misfortune.\n\n**Azure Essence Life-Safeguarding Secret Talisman**: Written in azure on white paper. Men ingest the Life-Safeguarding Talisman first, then the Elixir Radiance Spirit-Transforming Talisman.\n\n**Elixir Radiance Spirit-Transforming Talisman**: Written in vermilion on white paper. Women ingest the Elixir Radiance Talisman first, then the Azure Essence Life-Safeguarding Talisman.\n\n**Yin-Yang Secret Talismans of *Jia-Yi* Two Perfected**: The upper talisman written in azure, the lower in vermilion. Regularly on *jia-yi* days, face east to ingest them, and inscribe them on silk to wear on the body. Practice this for nine years, and you will gain the service of nine Constant Yang Jade Maidens, who ride the void and mount the emptiness, ascending to the Morn in broad daylight.\n\nOn *bing-ding* days, enter the chamber, burn incense, and face south to visualize the two true spirits of *bing*-Father and *ding*-Mother. The Father’s taboo name is Shu Hu; he wears the Vermilion Yang Penetrating Heaven Treasure Crown and a robe of crimson patterns, holding the Vermilion Brightness Body-Safeguarding Everlasting Secret Talisman. The Mother’s taboo name is Na Ling; her hair is coiled in a flying cloud chignon, she wears a cinnabar flying skirt, and holds the Central Plain Yellow Essence Secret Talisman. They come to bestow them upon my body. Then, thrice call the two true spirits’ inner taboo names and recite the prayer:\n\n*\"Yin and yang transform and change; the Two Radiant Ones engender Perfection. The Jade Numinous returns the hun-soul; restrain the po-soul and anchor the spirit. The Three and Five blend and coalesce, never departing from my body. Safeguard the sun and moon, and the Three Radiant Ones unite with the Morn.\"*\n\nWhen finished, ingest the talisman, knock the teeth nine more times, and swallow qi three times to conclude. Cultivate this for eight years, and the true spirits will descend in manifestation, arriving in cloud chariots to welcome you.\n\n**Vermilion Brightness Body-Safeguarding Everlasting Secret Talisman**: Written in vermilion on white paper. Men ingest it first, then the Central Plain Yellow Essence Talisman.\n\n**Central Plain Yellow Essence Talisman**: Written in yellow on white paper. Women ingest it first, then the Vermilion Brightness Body-Safeguarding Everlasting Talisman.\n\n**Secret Talismans of *Bing-Ding* Two Perfected**: The upper talisman written in vermilion, the lower in yellow. Regularly at noon on *bing-ding* days, face south to ingest them, and inscribe them on silk to wear on the body. Practice this for nine years, and you will gain the service of eight Vermilion Jade Maidens, who ride the void and mount the emptiness, ascending to the Morn in broad daylight.\n\nOn *wu-ji* days, enter the chamber, burn incense, and face southwest to visualize the two true spirits of *wu*-Father and *ji*-Mother. The Father’s taboo name is Chang Qing; he wears the Yellow Florescence Three Treasures Mystic Crown and a robe of yellow patterns, holding the Middle Prime Life-Delivering Soul-Safeguarding Secret Talisman. The Mother’s taboo name is Lai Sheng; her hair is coiled in a two-horned cascading cloud chignon, she wears a yellow brocade flying skirt, and holds the Golden Light Spontaneous Secret Talisman. They come to bestow them upon my body. Then, thrice call the two true spirits’ inner taboo names and recite the prayer:\n\n*\"The Middle Prime’s Mystic Record governs and commands the four directions. Transforming and engendering the Five Qi, blending and coalescing in the Thearch’s chamber, restrain the hun-soul and command the po-soul to unite with the form. Long safeguard Heaven and Earth, enduring through kalpas without end.\"*\n\nWhen finished, ingest the talisman, knock the teeth nine more times, and swallow saliva three times to conclude. Cultivate this for twelve years, and you will perceive the eight directions with clarity, your body transforming into golden light to ride the great void of emptiness.\n\n**Middle Prime Life-Delivering Soul-Safeguarding Secret Talisman**: Written in yellow on white paper. Men ingest it first, then the Golden Light Spontaneous Flying Talisman.\n\n**Golden Light Spontaneous Secret Talisman**: Written in white on white paper. Women ingest it first, then the Middle Prime Life-Delivering Soul-Safeguarding Talisman.\n\n**Secret Talismans of *Wu-Ji* Two Perfected**: The upper talisman written in yellow, the lower in white. Regularly at the *pu* hour on *wu-ji* days, face southwest to ingest them, and inscribe them on silk to wear on the body. Practice this for nine years, and you will gain the service of twelve Yellow Silk Jade Maidens, who tread the void and mount the emptiness, flying to the Upper Palace.\n\nOn *geng-sin* days, enter the chamber, burn incense, and face west to visualize the two Perfected of *Geng* Father and *Xin* Mother. The father’s name is **Starter of Brightness**, wearing a Ninefold Primordial Azure-Jade Mystic Crown and a robe of plain feathered splendor, holding the **White Numinous Summoning Spirit Life-Safeguarding Secret Talisman**. The mother’s name is **Virtue-Spirit**, her hair coiled in a soaring-cloud chignon, clad in a plain skirt adorned with flying patterns, holding the **Mystic Yin Life-Form Ascending Transmutation Secret Talisman**. As they come to bestow upon me, I thrice invoke the inner names of the two Perfected and pray:\n\n*\"Golden essence infuses the Mystic,\nCongealing qi into Ninefold Numinosity.\nFlowing Perfected blends with gold,\nIrrigating the dawn-body’s form.\nMay my hun and po\nBe settled in Yellow Tranquility.\nHunger is fed with Threefold Primordial,\nThirst quenched with Jade Essence.\nRiding the void, steering the floating,\nI wander and feast in the Purple Court.\"*\n\nAfter ingesting the talisman, knock the teeth nine times and swallow qi thrice to conclude. Practicing this for six years, one may ride the auroral clouds of dawn, entering and exiting the Purple Chamber.\n\n**White Numinous Summoning Spirit Life-Safeguarding Secret Talisman**: Written in white on white paper. Men ingest it first, then the **Mystic Yin Life-Form Ascending Transmutation Talisman**.\n\n**Mystic Yin Life-Form Ascending Transmutation Secret Talisman**: Written in black on white paper. Women ingest it first, then the **White Numinous Summoning Spirit Life-Safeguarding Talisman**.\n\n**Secret Talismans of *Geng-Xin* Two Perfected**: The upper talisman written in white, the lower in black. Regularly on *geng-sin* days, enter the chamber, face west to ingest them, and inscribe them on silk to wear on the body. Practicing this for nine years, one will gain the service of six White Numinous Jade Maidens, who tread the void and mount the emptiness, flying to the Upper Palace.\n\nOn *ren-gui* days, enter the chamber, burn incense, and face north to visualize the two Perfected of *Ren* Father and *Gui* Mother. The father’s name is **Dawn Numinous**, wearing a Mystic Dawn Crown and a plain black robe, holding the **Penetrating Numinous Longevity Secret Talisman**. The mother’s name is **Dharma-Labor**, her hair coiled in a cascading-cloud chignon, clad in a dark brocade flying skirt, holding the **Flying Immortal Ascending Transmutation Secret Talisman**. As they come to bestow upon me, I thrice invoke the inner names of the two Perfected and pray:\n\n*\"Above lies the Ninefold Primordial,\nTransforming to generate yin and yang.\nThe Five Phases diverge in order,\nDiamond hardness reverses to strength.\nThree Dawns’ Jeweled Luminaries\nAdorn my robes and garments.\nFive hues flow in yellow,\nHeaven’s gates open wide.\nAscending to Jade Purity,\nI enter and exit the Emperor’s Chamber.\"*\n\nAfter ingesting the talisman, knock the teeth nine times and swallow qi nine times to conclude. Practicing this for five years, one will perceive boundlessly, foreknow the auspicious and inauspicious, ride the void and steer the floating, ascending to the auroral clouds of dawn.\n\n**Penetrating Numinous Longevity Secret Talisman**: Written in black on white paper. Men ingest it first, then the **Flying Immortal Ascending Transmutation Talisman**.\n\n**Flying Immortal Ascending Transmutation Secret Talisman**: Written in blue-green on white paper. Women ingest it first, then the **Penetrating Numinous Longevity Talisman**.\n\n**Secret Talismans of *Ren-Gui* Two Perfected**: The upper talisman written in black, the lower in blue-green. Regularly on *ren-gui* days at midnight, face north to ingest them, and inscribe them on silk to wear on the body. Practicing this for nine years, one will gain the service of five Great Mystic Jade Maidens, who ride the void and steer the emptiness, ascending to heaven in broad daylight.\n\nThe Later Saintly Lord of the Golden Watchtower received from the Most High the **Winding Plain Oral Instructions of the Five Phases’ Secret Writings and Precious Formulas**, whereupon the Most High commanded the Left Immortal Duke of the Supreme Ultimate to cast gold into tablets, inscribe the text with purple brush, and conceal it within the Jade Chamber of the Great Possession Palace above the Nine Heavens. The Most High appointed three hundred Western Flower Jade Maidens to guard the sacred writ, their banners adorned with the splendor of the Seven Treasures, streaming the essence of the Five Colors. Golden Perfected and Mystic Radiance intermingle, scattering incense in the Purple Court. Flying auroras billow and swirl, the Eight Assemblies arise in unison, illuminating the Jade Palace with brilliance, resplendent in Jade Purity. Yin and yang, though obstructed, remain unharmed; treading through a hundred kalpas, they ever flourish. They govern the host of wonders, wield authority over the multitude of spirits, summon hun and call po, restoring all gods to wholeness. Their transformations reach the subtlest essence, their wonders embody the Five Phases’ true mystery.\n\nThis sacred writ is profoundly secret and must not be lightly disclosed. It is transmitted only to the worthy. Should a devoted student seek to wear the Five Phases’ secret talismans alone, permission may be granted through a separate covenant. The master and disciple observe a seven-day fast, and the disciple presents fifty feet each of the Five Colors’ silks and five pairs of gold buttons to swear an oath before the Jade Emperor’s Palace. The master then conveys the **Oath of Transmission and Salvation Text**. After receiving the teachings, one must not recklessly enter defiled places or offend the Perfected of the Dao. To lightly disclose celestial writ, allowing others to see or hear it, will cause the Seven Mystic Parents to seal one in the earthly prisons forever. One’s own body will suffer the Ten Torments and Eight Calamities, and ascension to immortality will be utterly impossible. Guard this well and practice accordingly.\n\nThe **Upper Clarity Highest Jade Dawn Phoenix Terrace Facing Plain Upper Scripture** is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清高上玉晨凤台曲素上经 经名：上清高上玉晨凤台曲素上经。 撰人不详，约出於东晋。 是早期上清派重要经典。 一卷。 底本出处：《正统道藏》正一部。 上清高上玉晨凤台曲素上经 高上玉晨凤台曲素上经，玄都九曲陵层凤台，结自然凤气以成。 琼房处於九天之上，玉京之阳，虚生八会交真之气，十折九曲，洞达八方上招扶摇之翮，傍通八素之灵，结九元正一之气，以成忧乐之辞，明於玄台之上。 字方一丈，文蔚焕烂，洞明九天，飞凤云盖，紫气郁冥，游鳞走兽，交错驰横，六领师子，备于下关，五帝玉仙执五色命魔灵幡，以威御五方右侍太华玉女，左卫金仙玉童，各三千人侍真典香。 日月侠映，七元回灵，三晨齐景，玄光洞明，琼林振条，玉籁激庭，七宝华光，流曜上清，即高上玉晨太上道君所治。 玄都丈人以凤文真书忧乐之曲，玄授於道君焉。 如是上天万真及五岳飞仙，悉以月五日、十五日、二十五日，一月三登凤台，晏礼游香，诵咏忧乐之辞也。 上庆神真，下悲兆民，其辞虚微，玉朗洞清，四真稽首，万仙礼音，散香逸霄，流烟虚庭。 凡上宫已成真人，及始学为仙者，莫不备修九天凤气玄丘真书，诵忧乐之曲也。 玄古皆万劫一传，今有其人，七百年中听得三传。 得有其文，飞行上清，登九曲凤台，朝谒玉真也。 轻泄失明，七祖充责，慎则神仙。 凡得佩玄丘太真书五帝命魔灵幡，则能策虚召灵，制魔使神。 得五行秘符，则呼魄固魂，保神长存。 得诵忧乐之辞，超身九玄，游晏玉京。 得佩曲素凤炁，则见太平奉迎圣君，身升玄都，受仙上真也。 如是九天凤文忧乐之曲，玄丘太真〔书〕#1，皆九天自然之气结而成焉。 灵文表异於空玄之中，经九万劫，玄都丈人受之於太空，以传太上大道君，道君传太极真人，真人以传东海方诸青童大君，使传道士宿有玉名，应为神仙人者。 佩之二十年，得见三元君，迎圣君於上清金阙。 七百年三传，百年有可授者，听传二人。 斋中香一斤，上金五两，毕歃金青之誓，以代血坛之约也。 高上玉晨曲素忧乐慧辞 东方青帝 结我自然气，凝化紫凤城。 高台超九岭，陵层茂飞琼。 焕乐重虚上，曲折洞八清。 紫虚曜云宫，流晖翳五灵。 四达无穷野，八气回圆明。 扶摇运太空，七景转天经。 运来若无根，时去随化倾。 九围交度内，二象互相征。 帝一固中元，四纲不颓灵。 南采飞皇实，北引广寒庭。 玄房交真会，虚歌自然生。 五帝命灵幡，麾旗征万精。 魔从空中啸，道治乐未央。 故兴曲素辞，庆神欣太平。 相与契何许，万劫为一龄。 回转九万劫，同游紫凤軿。 空生紫凤台，琼阙参太微。 灵风洞八会，北牖阊阖开。 上有啸歌儿，恒唱运丧衰。 朝则乘景游，暮则附景归。 二景齐一体，怕恐失景晖。 九五不常居，天地有倾危。 大劫终一椿，百六乘运回。 洪泉涌九岭，大鸟翔天垂。 万蠢飘长流，顾山不得依。 号泣无崖际，能不伤人怀。 贤圣勤诵经，故得乘景飞。 至时相奉迎，同会九天扉。 数尽金马辰，万疠交横驰。 不见学仙人，但闻丧尸悲。 嗟此愚夫质，持命痛何哀。 南方赤帝 散忧九玄台，聚乐阶太空。 携契十天真，啸命东海童。 四达八会气，交运阆台风。 目朗西华馆，意合广寒宫。",
      "translated_text": "**The Supreme Clarity Highest Jade Dawn Phoenix Terrace Winding Plain Upper Scripture**\n\n**Scripture Title:** *The Supreme Clarity Highest Jade Dawn Phoenix Terrace Winding Plain Upper Scripture*. Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. One scroll. Base text from *The Orthodox Daoist Canon*, Proper Section I.\n\n---\n\n**The Supreme Clarity Highest Jade Dawn Phoenix Terrace Winding Plain Upper Scripture**\n\nThe *Highest Jade Dawn Phoenix Terrace Winding Plain Upper Scripture* arises from the Ninefold Winding Phoenix Terrace of the Mysterious Capital, formed by the natural coalescence of phoenix *qi*. Its jade chambers reside above the Nine Heavens, on the yang side of the Jade Capital, where the void generates the Eight Convergences of Realized *Qi*. Ten turns and nine bends pierce the eight directions, summoning the soaring pinions of the whirlwind above and communing with the numinous spirits of the Eight Simplicities on all sides. It gathers the *qi* of the Nine Origins and the Orthodox Unity to compose verses of sorrow and joy, illuminated upon the Mysterious Terrace. Each character spans a *zhang* in breadth, its text resplendent and radiant, penetrating the Nine Heavens. A flying phoenix clouds the canopy; purple *qi* swirls in obscurity. Scaled creatures and bounding beasts interweave in chaotic motion. Six-maned lions stand guard at the lower gates, while the Five Thearch Jade Immortals wield five-colored banners of life-summoning demonic spirits to command the five directions. On the right, the Jade Maidens of Great Flower Mountain attend; on the left, the Golden Immortals and Jade Lads, three thousand each, serve the perfumed rites of the True One. Sun and moon flank its brilliance; the Seven Origins revolve in numinous harmony. The Three Dawns align in splendor; mysterious light illumines all. Jade groves sway their branches; jade pipes resound through the courtyard. The radiance of the Seven Treasures flows and shines in the Supreme Clarity—this is the domain governed by the Highest Jade Dawn Supreme Lord of the Dao.\n\nThe Elder of the Mysterious Capital inscribed the phoenix-script verses of sorrow and joy in the Realized Writ and transmitted them to the Lord of the Dao. Thus, the myriad perfected beings of the upper heavens and the flying immortals of the Five Marchmounts ascend the Phoenix Terrace on the fifth, fifteenth, and twenty-fifth days of each month to feast, offer incense, and chant the verses of sorrow and joy. Above, they celebrate the divine perfected; below, they lament the mortal multitudes. Their words are subtle and void, jade-bright and penetratingly clear. The Four Perfected bow their heads; the ten thousand immortals chant in harmony. Incense scatters into the empyrean; fragrant smoke drifts through the empty courtyard.\n\nAll who have attained perfected status in the upper palaces, as well as those newly embarking on the path to immortality, must cultivate the *qi* of the Nine Heavens’ Phoenix, study the Realized Writ of the Mysterious Mound, and recite the verses of sorrow and joy. From primordial antiquity, this teaching was transmitted but once in ten thousand kalpas. Now, if a worthy recipient appears, it may be passed down thrice within seven hundred years. Those who obtain its text may ascend to the Supreme Clarity, mount the Ninefold Winding Phoenix Terrace, and pay homage to the Jade Perfected. To recklessly divulge it brings blindness; the seven generations of ancestors shall bear the burden. Guard it well, and one becomes a divine immortal.\n\nWhoever bears the Five Thearchs’ banners of life-summoning demonic spirits from the Mysterious Mound of the Great Perfected Writ may command the void, summon spirits, and subdue demons. Whoever obtains the secret talismans of the Five Phases may call back the wandering *po* and secure the *hun*, preserving the spirit for eternal endurance. Whoever recites the verses of sorrow and joy transcends the Nine Mysteries of the body and roams the Jade Capital in feasting delight. Whoever wears the Winding Plain Phoenix *Qi* shall behold the advent of the Sagely Lord of Great Peace, ascend to the Mysterious Capital, and receive the rank of upper immortal.\n\nThus, the phoenix-script verses of sorrow and joy from the Nine Heavens, along with the Great Perfected Writ of the Mysterious Mound, are formed from the natural *qi* of the Nine Heavens. Their numinous text manifests amid the empty mystery, enduring ninety thousand kalpas before the Elder of the Mysterious Capital received it from the Great Void and transmitted it to the Supreme Lord of the Great Dao. The Lord of the Dao passed it to the Perfected of the Supreme Ultimate, who in turn transmitted it to the Azure Lad of Square Cauldron in the Eastern Sea, instructing him to convey it to Daoists whose jade names are already inscribed—those destined to become divine immortals. After wearing it for twenty years, one may behold the Three Origin Lords and welcome the Sagely Lord at the Golden Gates of the Supreme Clarity. It may be transmitted thrice in seven hundred years, and once every century to no more than two worthy recipients. During the retreat, one must burn a *jin* of fine incense and offer five *liang* of gold. After swearing the golden-blue oath, it replaces the blood-altar covenant.\n\n---\n\n**The Luminous Verses of Sorrow and Joy from the Highest Jade Dawn Winding Plain**\n\n**Eastern Thearch of the Bluegreen**\nGather my natural *qi*, congeal and transform the Purple Phoenix City.\nThe lofty terrace soars beyond the Nine Ridges; its layered heights flourish with flying jade.\nResplendent joy rises above the layered void; its winding turns pierce the Eight Clarities.\nThe Purple Void radiates the cloud palaces; its flowing brilliance veils the Five Numinous.\nFour directions stretch into boundless wilds; the Eight *Qi* revolve in circular clarity.\nThe whirlwind propels the Great Void; the Seven Luminaries turn the celestial scriptures.\nThey arrive as if rootless; they depart with the ebb of transformation.\nWithin the Nine Enclosures’ intersecting paths, the Two Images contend in mutual ascent.\nThe Thearch of Unity secures the Central Origin; the Four Principles do not decline in numinosity.\nSouthward, it gathers the fruits of the Flying Sovereign; northward, it draws from the Broad Cold Court.\nMysterious chambers converge in true communion; void songs arise naturally.\nThe Five Thearchs command the numinous banners; their standards summon the myriad spirits.\nDemons howl from the empty midst; the Dao governs in joy unending.\nThus, the Winding Plain verses arise to celebrate the divine and delight in great peace.\nWith whom shall we covenant? Ten thousand kalpas become a single lifespan.\nRevolving through ninety thousand kalpas, we roam together in the Purple Phoenix chariot.\nThe Purple Phoenix Terrace emerges from the void; its jade towers align with the Supreme Subtlety.\nThe numinous wind pierces the Eight Convergences; the northern window opens the Gate of Heaven.\nAbove, the singing youths forever chant the cycles of rise and fall.\nAt dawn, they ride the light in roaming; at dusk, they return with the light.\nThe Two Luminaries merge as one; they fear losing the radiance of light.\nThe Nine and Five do not abide forever; heaven and earth face collapse and peril.\nThe great kalpa ends in a single cedar; the Hundred and Six ride the revolving fate.\nVast springs surge through the Nine Ridges; great birds soar at heaven’s edge.\nThe myriad creatures drift in endless currents; even the mountains cannot be relied upon.\nWailing and weeping know no bounds—how can one not grieve in one’s heart?\nThe worthy and sagely diligently recite the scriptures, thus riding the light in flight.\nWhen the time comes, they shall be welcomed together at the gates of the Nine Heavens.\nWhen the golden horse’s hour is exhausted, ten thousand plagues surge in chaotic motion.\nOne sees no aspiring immortals—only hears the lament of the dead.\nAlas, these foolish mortals! How piteous their clinging to life!\n\n**Southern Thearch of the Vermilion**\nDispel sorrow at the Nine Mysteries Terrace; gather joy upon the steps of the Great Void.\nIn fellowship with the perfected of the Ten Heavens, summon the Lad of the Eastern Sea with a whistle.\nThe *qi* of the Eight Convergences flows in all directions; the winds of the Towering Terrace intermingle.\nEyes brighten the Western Flower Lodge; the mind harmonizes with the Broad Cold Palace.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1240,
      "start_sentence": 0,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.011059522628784,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上玉晨凤台曲素上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "婆娑紫凤下，萧条九岭峰。 流眄无穷野，仰观劫仞中。 清歌宫商和，忧乐自相从。 二趣谐一契，理背反还同。 相与乐未央，持始复持终。 甘饮玉池醴，仰欢飞华皇。 灵瓜自可晏，未若日月光。 七曜流芳晖，斯乐岂可忘。 大劫有终运，运交二象倾。 龙门断天河，三五反相征。 赤镇据东井，华盖伏晨星。 玄晖昏八荒，秽气翳天精。 三官相操促，五岳不固灵。 万疠交横驰，北帝勇魔兵。 八网罗天外，圣主不能清。 是结自然气，陵层九重城。 高观愍万兆，忧乐从是生。 玄歌散神衿，蒙欢反涕零。 哀此顽夫辈，吝财贪色萦。 欣欣待命至，不顾祸自婴。 贤智逆方来，晨夜勤诵经。 礼空念玄虚，以度不穷龄。 若能寻道源，八节奏玉名。 将免九难灾，令尔见太平。 西方白帝 琼凤郁晨飙，紫台曜玉林。 流光拂重玄，嵯峨凌九阴。 紫景散朱霞，飞烟互相寻。 七宝振琼条，灵兽骋云岑。 万仙乘空咏，神风扬妙音。 上有高晨师，拱静啸与吟。 八会自然容，虚降皆兰金。 琼嚼弥劫旦，玉浆散冲心。 明珠唱灵歌，法容和清琴。 玉章至道宗，忧乐解人衿。 释我无终龄，良娱乐何深。 自无高仙韵，安能同此饮。 朝戏东华宫，夕游西华堂。 取乐二华馆，不与乐相逢。 但闻玄歌子，悲声伤天童。 哀响流寒庭，抚悼世运穷。 天马踊九河，乌母乘飞龙。 玄津无桥梁，二气隔不通。 登我陵层台，仰观九难中。 秽气弥三灵，万兆负灾冲。 八域无遗民，大小山岳崩。 念此不知学，闻经若痴聋。 相与任运生，鲦欻待命终。 哀哉何期酷，念子伤我匈。 北方黑帝 紫凤乘空发，陵层九玄嵎。 气结则影见，气散则神无。 飘飖有无际，天乐适我娱。 安同八会唱，齐我高仙畴。 摧契十天真，晏我九凤驱。 上登玉京阙，下戏阆风州。 羽骑迅琼轮，紫烟空相扶。 极朝复待旦，偕乐无终休。 流眄任运迁，亿椿始一周。 欢我自然衿，散我怀世忧。 自无玄灵质，谁能同此游。 哀哉空洞内，兴乐复发忧。 朝登东蒙岭，夕观西垄丘。 不见九灵母，北真道相求。 辽问大象度，二炁忽云周。 九龙运东井，天马发西嵎。 北帝放天兵，五岳玄相符。 万魔已束#2带，五行早相谋。 兵灾罗天布，万兆已被拘。 上下皆受会，荡除无稽留。 哀哉五难中，运至无亲疏。 高登八会宫，结我冥中畴。 历观至学者，福地以相扶。 弃家寻我道，克#3得度尔躯。 勤心修至经，道成当相须。 逍遥观凤台，岂不乐哉游。 中央黄帝 大乐会中元，中元聚乐庭。 上有八会气，婆娑紫凤生。 金条附玉根，七宝结华铃。 龙超极岭峰，凤啸骇万里。 不见杂游宾，但闻风云声。 宫商自相和，音响自相成。 玄歌唱妙曲，忧乐结成经。 吾我自相求，谁知真人灵。 锦云带夜月，紫曜翳飞琼。 三晨洞太晖，七元焕五星。 灵幡有威光，流烟蔼紫清。 自谓西华妙，未若紫凤城。 上有解衿人，一面欢万龄。 偕乐无终劫，因觉天地倾。 灵运自有纪，数终自由玄。 去来顺运回，何为忧缠生。 散忧八荒外，大象不圭真。 逍遥欢乐庭，谁与忧为亲。 五难是常会，所伤自有人。 宫商虽不和，大归理自均。 故兴忧乐曲，以度学道身。 若行研灵文，妙义自当鲜。 但佩曲素章，克入无忧津。 乘空登凤台，高观承唐年。 此乐将何乐，知忧在何间。",
      "translated_text": "The purple phoenix descends in graceful dance,\nthe Nine Peaks stand desolate and still.\nMy gaze drifts across boundless wilds,\nI look up to behold the kalpa’s towering height.\nClear songs harmonize in palace tones,\nsorrow and joy follow one another.\nTwo paths align in perfect accord,\nprinciples seem opposed yet return to unity.\nTogether we rejoice without end,\nholding fast to beginning and end alike.\nSweetly we drink the nectar of Jade Pool,\ngazing in joy at the soaring Flower Sovereign.\nThe numinous gourd may bring contentment,\nyet it cannot compare to the radiance of sun and moon.\nThe Seven Luminaries stream forth fragrant light—\nhow could such joy ever be forgotten?\n\nYet the great kalpa has its destined end,\nwhen its course meets the dual forces’ collapse.\nThe Dragon Gate severs the River of Heaven,\nthe Three and Five turn against each other.\nThe Crimson Guardian occupies the Eastern Well,\nthe Flower Canopy subdues the morning stars.\nDark radiance dims the Eight Wastes,\nfoul *qi* veils the heavens’ essence.\nThe Three Offices press upon one another,\nthe Five Peaks lose their steadfast power.\nTen thousand plagues surge in chaotic motion,\nthe Northern Thearch marshals his demonic troops.\nEight nets spread beyond the heavens—\neven the Sage Lord cannot purify them.\nThis is the knotting of natural *qi*,\nscaling the layered Ninefold City.\nFrom on high I behold the myriad multitudes,\nsorrow and joy arise from this.\nMystic songs disperse the heart’s cares,\nyet hidden joy turns to weeping.\nAlas for these stubborn mortals,\nclinging to wealth and ensnared by desire!\nJoyfully they await their fate’s arrival,\nheedless of calamity that coils around them.\nThe wise and sagacious turn toward the Dao,\nday and night diligently reciting scriptures.\nThey venerate emptiness and contemplate the Mystery,\nto transcend the limits of mortal years.\nIf one can trace the Dao to its source,\nthe Eight Festivals shall resound with jade names.\nThey shall escape the Nine Calamities,\nand behold for you the Great Peace.\n\n**Western Thearch of the White**\nThe jade phoenix stirs the morning gale,\nthe Purple Terrace gleams in the Jade Grove.\nFlowing light brushes the layered mysteries,\nits towering form pierces the Nine Yin.\nPurple radiance scatters crimson clouds,\nflying mists seek one another.\nThe Seven Treasures adorn jade branches,\nspirit beasts gallop through clouded peaks.\nTen thousand immortals ride the void in song,\ndivine winds carry wondrous tones.\nAbove dwells the Lofty Dawn Master,\nserene and poised in whistle and chant.\nThe Eight Convergences assume their natural forms,\ntheir descent all of fragrant gold.\nJade is chewed through kalpas’ dawn,\njade nectar scatters into the centered heart.\nBright pearls sing the numinous song,\nthe Dharma’s countenance harmonizes with the clear zither.\nJade stanzas reveal the Dao’s ultimate lineage,\nsorrow and joy unbind the human heart.\nThey release me from mortal limits—\nhow profound is this true delight!\nWithout the high immortal’s resonance,\nhow could one share in this feast?\nAt dawn they sport in the Eastern Flower Palace,\nat dusk they wander the Western Flower Hall.\nThey find joy in the Twin Flower Lodges,\nyet never meet with worldly pleasures.\nOnly the strains of the Mystic Singer are heard,\ntheir mournful voices grieving the Heavenly Lad.\nSorrowful echoes flow through the Cold Court,\nlamenting the exhaustion of the world’s fate.\nThe Heavenly Steed leaps across the Nine Rivers,\nthe Raven Mother rides the flying dragon.\nThe Dark Ford lacks a bridge,\nthe dual *qi* remain sundered and unlinked.\nAscend my layered terrace,\nlook up to witness the Nine Calamities.\nFoul *qi* fills the Three Powers,\nthe myriad multitudes bear the brunt of disaster.\nThe Eight Domains are left without a single soul,\ngreat and small mountains alike collapse.\nPity those who never sought learning,\nhearing the scriptures as if deaf and dumb.\nTogether they submit to fate’s course,\nheedless until their destined end.\nAlas, how cruel their appointed time!\nThinking of them, my heart is wounded.\n\n**Northern Thearch of the Black**\nThe purple phoenix soars into the void,\nscaling the layered Ninefold Mystery.\nWhen *qi* coalesces, its shadow appears;\nwhen *qi* scatters, the spirit vanishes.\nDrifting and swaying beyond all bounds,\nheavenly music delights my heart.\nIn harmony with the Eight Convergences’ song,\nI join the ranks of the lofty immortals.\nI summon the perfected of the Ten Heavens,\nfeasting with the drivers of the Nine Phoenixes.\nAbove I ascend the Jade Capital’s gates,\nbelow I sport in the Towering Terrace’s realm.\nFeathered riders urge on jade wheels,\npurple mists support them in the void.\nFrom dawn’s audience to the next morning’s wait,\ntogether we rejoice without end.\nMy gaze drifts with fate’s unfolding,\na hundred million cedars complete one cycle.\nI delight in the heart’s natural ease,\ndispersing the world’s sorrows from my breast.\nWithout the numinous immortal’s essence,\nwho could share in this journey?\nAlas, within the Empty Cavern,\njoy gives rise to sorrow once more.\nAt dawn I ascend the Eastern Meng Peak,\nat dusk I observe the Western Mound.\nI do not see the Mother of the Nine Spirits—\nthe Northern Perfected seek the Dao.\nVastly I inquire of the Great Image’s course,\nwhen suddenly the dual *qi* encircle one another.\nThe Nine Dragons govern the Eastern Well,\nthe Heavenly Steed emerges from the Western Pass.\nThe Northern Thearch unleashes his heavenly troops,\nthe Five Peaks align with the Mystery.\nTen thousand demons are bound in chains,\nthe Five Agents plot in advance.\nWar’s disasters spread across the heavens,\nthe myriad multitudes are already ensnared.\nAbove and below all receive their reckoning,\nswept clean without delay.\nAlas for those in the Five Calamities—\nwhen fate arrives, none are spared.\nI ascend the Eight Convergences’ palace,\njoining my company in the hidden realm.\nSurveying those who pursue the ultimate learning,\ntheir blessed lands support them.\nAbandoning home to seek my Dao,\nthey shall surely transcend their mortal forms.\nDiligently cultivating the supreme scriptures,\nwhen the Dao is attained, they shall await one another.\nCarefree, they observe the Phoenix Terrace—\nhow could this journey not be joyous?\n\n**Central Thearch of the Yellow**\nGreat joy gathers at the Middle Origin,\nthe Middle Origin assembles in the Joyous Court.\nAbove, the *qi* of the Eight Convergences,\nthe purple phoenix is born in graceful dance.\nGolden branches cling to jade roots,\nthe Seven Treasures weave into flowered bells.\nDragons soar beyond the utmost peaks,\nphoenixes’ cries startle ten thousand miles.\nNo miscellaneous guests are seen—\nonly the sounds of wind and clouds.\nPalace tones harmonize of themselves,\ntheir resonance naturally complete.\nMystic songs chant wondrous melodies,\nsorrow and joy weave into scriptures.\nWe seek one another of our own accord—\nwho knows the perfected ones’ numinosity?\nBrocade clouds gird the night’s moon,\npurple radiance veils flying jade.\nThe Three Dawns illuminate the Great Brilliance,\nthe Seven Origins illumine the Five Stars.\nNuminous banners bear majestic light,\nflowing mists shroud the purple clarity.\nI call the Western Flower wondrous,\nyet it cannot compare to the Purple Phoenix City.\nAbove dwell those who loosen their cares,\none glance brings joy for ten thousand years.\nTogether we rejoice through endless kalpas,\nsuddenly aware of heaven and earth’s collapse.\nThe numinous course has its own reckoning,\nits end determined by the Mystery’s freedom.\nComing and going follow fate’s turning—\nwhy should sorrow entangle the living?\nDispersing cares beyond the Eight Wastes,\nthe Great Image does not deviate from truth.\nCarefree in the Joyous Court,\nwho would claim sorrow as kin?\nThe Five Calamities are constant gatherings,\nyet those who suffer are of their own making.\nThough palace tones may not harmonize,\nthe great return finds its own balance.\nThus I compose songs of sorrow and joy,\nto guide those who cultivate the Dao.\nIf one studies the numinous texts,\ntheir wondrous meaning shall naturally shine.\nSimply wear the plain jade stanzas,\nand you shall enter the Ford of No Sorrow.\nRiding the void to ascend the Phoenix Terrace,\ngazing from on high to receive the Tang’s years.\nWhat joy could surpass this?\nWhere lies the space for sorrow?",
      "overlap_context": "he dead.\nAlas, these foolish mortals! How piteous their clinging to life!\n\n**Southern Thearch of the Vermilion**\nDispel sorrow at the Nine Mysteries Terrace; gather joy upon the steps of the Great Void.\nIn fellowship with the perfected of the Ten Heavens, summon the Lad of the Eastern Sea with a whistle.\nThe *qi* of the Eight Convergences flows in all directions; the winds of the Towering Terrace intermingle.\nEyes brighten the Western Flower Lodge; the mind harmonizes with the Broad Cold Palace.",
      "start_char": 1240,
      "end_char": 2462,
      "start_sentence": 65,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.43928289413452,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上玉晨凤台曲素上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "高上玉晨忧乐之曲，空生凤台之上，灵文明於五方，金音逸朗於十天，玉京九曲上真，皆铸金为简，紫笔书文，齐声合唱玄歌忧乐之曲也。 其辞深赜，妙趣洞渊，自非高上之俦，莫有能究其篇者。 有金名东华，书字凤阙，乃得见此文尔。 得佩凤气玄丘真书命魔灵幡，诵忧乐之曲，则五帝卫真，天魔教护，保举上仙，得奉迎圣君於上清宫，游於凤台之堂也。 凡受此文，每以本命、太岁、八节之日，及每月五日、十五日、二十五日，沐浴清斋入室，先东向诵青帝#4曲毕，礼拜朝玉真； 转南向诵赤帝曲毕，礼拜朝玉真； 转西向诵白帝曲毕，礼拜朝玉真； 转北向诵黑帝曲毕，礼拜朝玉真，〔转向太岁诵黄帝曲毕，礼拜朝玉真〕。 五方都毕，还北向九拜，朝玉晨君，仰咽炁九过止。 如此皆施五帝旛於室五方也。 五帝命魔灵幡 高上玉晨命魔灵幡，主制东方青帝魔灵大王，咸保负某岳先生王甲，体真合仙，俯仰遣东岳仙官羽轮，奉迎甲身上登玉清宫紫凤台，如九天信。 右白书青缯上。 高上玉晨命魔灵幡，主制南方赤帝魔灵大王，咸保负某岳先生王甲，体真合仙，俯仰遣南岳仙官羽轮，奉迎甲身上登玉清宫紫凤台，如九天信。 右黑书绛缯上。 高上玉晨命魔灵幡，主制西方白帝魔灵大王，咸保负某岳先生王甲，体真合仙，俯仰遣西岳仙官羽轮，奉迎甲身上登玉清宫紫凤台，如九天信。 右朱书白缯上。 高上玉晨命魔灵幡，主制北方黑帝魔灵大王，咸保负某岳先生王甲，体真合仙，俯仰遣北岳仙官羽轮，奉迎甲身上登玉清宫紫凤台，如九天信。 右黄书黑缯上。 高上玉晨命魔灵幡，主制中央黄帝魔灵大王，咸保负某岳先生王甲，体真合仙，俯仰遣中岳仙官羽轮，奉迎甲身上登玉清宫紫凤台，如九天信。 右青书黄缯上。 右高上五帝命魔灵幡，虚生凤台之上，五帝玉真所主。 有骨命合仙之人，东华即以此文告五帝魔王保举，即依俯仰之格，遣五岳仙官千乘万骑飞行羽轮，奉迎上登紫凤玉台也。 得佩此文，则五帝记名，天魔敬护，十界司迎，九年则得灵降，乘羽轮上升也。 受之男当投书高峰，女当醮灵度文，如此悉十年来降，男则又投书，女则又醮玄丘太真书凤气，悉同科文。 太极左真人曲素诀辞 一名九天凤炁玄丘太真书 太上授太极左真人，以传东海方诸宫青童大君，使传道士宿有玉名，应为神仙真人者。 佩之二十年，得见三元君，迎圣君於上清金阙。 七百年三传，百年有可授者，听传二人。 斋三日，斋中香十斤，上金百两。 受毕，歃金青誓之，以代血坛之约。 曲素诀辞 右玄丘太真书隐文，召群灵，制万精。 朱书白缯佩身。 白缯四十尺，白绢以保血液之券，白绢以代曲素之歃血，不静不斋不盛解箓。 青二七尺，青以保神仙之券，青以为七百年三传之誓，入疾入火入水入山入室带录。 金镮三双，金镮以保长生大度之券，金镮以为抱心不泄之约，道士无此文，不得见三元君。 香九两，香以保通灵之券，香以为明灵之盟，又无以召摄六天之鬼者也。 男受之北向，师南向。 女受之南向，师北向。",
      "translated_text": "The *Highest Jade Dawn Songs of Sorrow and Joy* resound upon the Phoenix Terrace in the void, their numinous texts illuminating the Five Directions, their golden tones soaring and radiant through the Ten Heavens. The Perfected Ones of the Ninefold Jade Capital all inscribe golden tablets with purple brushstrokes, joining their voices in unison to chant the mysterious *Songs of Sorrow and Joy*. Their words plumb profound depths, their wondrous essence penetrating the abyss—none but the highest company of immortals can fathom their verses.\n\nThere is one named Golden Radiance of the Eastern Flower, whose script is inscribed upon the Phoenix Gate; only thus may one behold these texts. Those who receive and wear the *Phoenix Qi Mystic Mound Perfected Writ* and the *Command Banners of Demon Spirits*, reciting the *Songs of Sorrow and Joy*, shall be guarded by the Five Emperors, protected by the heavenly demons, and sponsored for ascension as Transcendent Ones. They shall be welcomed by the Sacred Lord in the Upper Clarity Palace and wander the halls of the Phoenix Terrace.\n\nFor all who receive these texts, on the days of their own fate-star, the Grand Year-Star, the Eight Seasonal Nodes, and the fifth, fifteenth, and twenty-fifth days of each month, they must bathe, purify themselves, and enter the chamber. First, facing east, they recite the Green Emperor’s song to completion and bow in homage to the Jade Perfected. Turning south, they recite the Red Emperor’s song to completion and bow in homage to the Jade Perfected. Turning west, they recite the White Emperor’s song to completion and bow in homage to the Jade Perfected. Turning north, they recite the Black Emperor’s song to completion and bow in homage to the Jade Perfected. [Turning toward the Grand Year-Star, they recite the Yellow Emperor’s song to completion and bow in homage to the Jade Perfected.] After completing the Five Directions, they return to face north, bowing nine times to the Jade Dawn Lord, then raise their gaze and swallow qi nine times before ceasing.\n\nIn this manner, the Five Emperor Banners are displayed in the five directions of the chamber.\n\n**Five Emperor Command Banners of Demon Spirits**\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Eastern Green Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Eastern Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in white upon blue-green silk.*\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Southern Red Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Southern Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in black upon crimson silk.*\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Western White Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Western Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in vermilion upon white silk.*\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Northern Black Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Northern Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in yellow upon black silk.*\n\n*The Highest Jade Dawn Command Banner of Demon Spirits* governs the Great Demon Spirit King of the Central Yellow Emperor, ensuring the protection of the Master of Such-and-Such Peak, Wang of Such-and-Such Year-Stem, that his body may merge with the Perfected and ascend as an immortal. It commands the immortal officials and feathered chariots of the Central Peak to welcome his person and ascend to the Purple Phoenix Terrace of the Jade Clarity Palace, as sure as the pledge of the Nine Heavens.\n*Inscribed in blue-green upon yellow silk.*\n\nThe above are the *Highest Five Emperor Command Banners of Demon Spirits*, which emerge from the void upon the Phoenix Terrace and are presided over by the Jade Perfected Ones of the Five Emperors. For those whose destiny aligns with the Perfected and immortality, the Eastern Flower shall present these texts to the Five Emperor Demon Kings for their protection and sponsorship. Following the protocols of command, the Five Peaks shall dispatch immortal officials with thousands of chariots and tens of thousands of riders in feathered wheels to welcome them and ascend to the Purple Phoenix Jade Terrace.\n\nThose who wear these texts shall have their names recorded by the Five Emperors, be revered and protected by heavenly demons, welcomed by the administrators of the Ten Realms, and within nine years, receive the descent of the numinous and ascend upon feathered wheels. Men who receive them shall present the texts at lofty peaks, while women shall offer libations to transmit the numinous writ. After ten years, men shall again present the texts, and women shall again offer libations to the *Phoenix Qi Mystic Mound Perfected Writ*, following the same ritual protocols.\n\n**The Jade Stanza Secrets of the Left Perfected of the Great Ultimate**\n*Also named the* Mystic Mound Perfected Writ of the Phoenix Qi of the Nine Heavens\n\nThe Most High transmitted this to the Left Perfected of the Great Ultimate, who passed it to the Great Lord of the Azure Lad of the Square Pond Palace in the Eastern Sea, to be further transmitted to Daoist adepts whose names are inscribed in jade and who are destined to become Perfected Immortals. Those who wear it for twenty years shall behold the Lords of the Three Origins and be welcomed by the Sacred Lord in the Golden Gates of the Upper Clarity. After seven hundred years, it may be transmitted thrice, and only once every hundred years may it be bestowed upon two recipients.\n\nThree days of purification are required, during which ten pounds of incense are burned and one hundred taels of gold are offered. Upon completion of the transmission, the recipient swears a golden-blue oath in place of the blood-altar covenant.\n\n**Jade Stanza Secrets**\nThe *Mystic Mound Perfected Writ* contains hidden texts that summon the host of spirits and command the myriad essences.\n*Inscribed in vermilion upon white silk and worn upon the body.*\n\nForty feet of white silk serve as the contract for blood and fluid, replacing the blood-oath of the jade stanzas. Without purity, purification, or the proper untying of the registers, the transmission is invalid.\nTwelve feet of blue-green silk serve as the contract for immortality, embodying the oath of transmission once every seven hundred years. It must be worn when entering illness, fire, water, mountains, or chambers while bearing the registers.\nThree pairs of golden rings serve as the contract for great transcendence and eternal life, embodying the covenant of unyielding resolve. Without this text, a Daoist cannot behold the Lords of the Three Origins.\nNine taels of incense serve as the contract for communion with the numinous, forming the alliance of luminous spirits. Without it, one cannot summon or command the ghosts of the Six Heavens.\n\nMen receive it facing north, with the master facing south.\nWomen receive it facing south, with the master facing north.",
      "overlap_context": " are of their own making.\nThough palace tones may not harmonize,\nthe great return finds its own balance.\nThus I compose songs of sorrow and joy,\nto guide those who cultivate the Dao.\nIf one studies the numinous texts,\ntheir wondrous meaning shall naturally shine.\nSimply wear the plain jade stanzas,\nand you shall enter the Ford of No Sorrow.\nRiding the void to ascend the Phoenix Terrace,\ngazing from on high to receive the Tang’s years.\nWhat joy could surpass this?\nWhere lies the space for sorrow?",
      "start_char": 2463,
      "end_char": 3671,
      "start_sentence": 167,
      "end_sentence": 207,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.15135955810547,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上玉晨凤台曲素上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "男受之十年，又一斋投书。 女受之投书及醮，当召於师诀。 受时有十年一醮。 录香果，列於一座密室之中，请#5太清高仙景云真人、太上丈人官某甲奉戒。 如授者师名对录口传，不用文於师，青录香誓身师名。 太清高仙景云真人启天大录，太上丈人下授五岳君，佩之却祸除殃，辟恶逐邪，朝众精，从百禽，命鬼物，延年十万，还魂却老，安身长存。 一名三天必生券。 九天凤气玄丘太真君九炁丈人，领白素玉女官十人，布在甲身中。 九天凤气玄丘真书命魔灵幡，连书九尺素缯上，授书佩身。 若绝世上居，则书五方色缯。 书命魔灵幡，置五方也，则制万灵，御天魔，致仙官，奉迎太平圣君也。 玄都丈人仙科，受佩斋三日，以青帛、镮三双，香缯以盟受，传记太岁年月日，誓以奉法，不淫不慢，不溢不欺，不恶不嫉，行仁累德，存神命真，佩录者神仙。 带录后讫此。 男受此文初，仍於本命之岳投书，告灵而度文也。 十年即又投如前，三投如前，三投都毕。 女受即十年，亦一醮、三醮都竟也。 阳朔元年岁在庚寅，九月甲申朔一日甲申，西岳真人王君，年四十二岁，七月生，今从高晨大师东海青童君，奉受曲素凤文玄丘太真书忧乐之曲五行上符，谨开五帝五真五仙、五岳五灵，投书自盟已成真人，奏名东华，定录天仙，永保元吉，如九天之文。 右朱书银板之上，五枚，安五座，置五板，师向北告灵毕，以板埋於五岳也。 若一岳之上，亦可各依其方面而埋之。",
      "translated_text": "Men undergo the reception for ten years, then perform one purification rite and submit the writ. Women, upon submitting the writ and performing the jiao offering, must summon the master’s oral transmission. During the reception, a jiao offering is held once every ten years. The register incense and fruits are arranged in a secluded chamber, invoking the Most High Transcendent Perfected of Scenic Clouds, the Celestial Venerable, and the official [name] to uphold the precepts. As the transmitting master’s name is recited in the register, no written text is used; instead, the master’s name is sworn upon the blue-green register and incense. The Most High Transcendent Perfected of Scenic Clouds opens the Great Register of Heaven, while the Celestial Venerable bestows it upon the Lords of the Five Peaks. Wearing it averts misfortune, dispels calamity, repels evil, expels malevolence, summons the host of spirits, commands the hundred birds, orders ghosts and spirits, extends life by a hundred thousand years, restores the soul, reverses aging, secures the body, and ensures eternal existence. It is also called the \"Life-Guaranteeing Contract of the Three Heavens.\"\n\nThe Perfected Lord of the Mysterious Mound of Ninefold Heavenly Phoenix Qi, the Ninefold Qi Celestial Venerable, leads ten White-Silk Jade Maidens, who are arrayed within the recipient’s body. The Perfected Writ of the Mysterious Mound of Ninefold Heavenly Phoenix Qi, the Command Banner of Numinous Spirits, is inscribed in continuous script on nine feet of white silk and bestowed to be worn on the body. If one severs ties with worldly residence, the banner is inscribed on five-colored silks corresponding to the five directions. The Command Banner of Numinous Spirits is placed in the five directions to subdue the myriad spirits, govern celestial demons, summon immortal officials, and welcome the Sagely Lord of Great Peace.\n\nAccording to the immortal statutes of the Celestial Venerable of the Mysterious Capital, after three days of purification upon reception and wearing, the pact is sealed with blue-green silk, three pairs of rings, incense, and silk. The transmission is recorded with the year, month, and day under the cyclical signs, swearing to uphold the Daoist laws: no licentiousness, no negligence, no excess, no deceit, no malice, no envy; practicing benevolence, accumulating virtue, preserving the spirit, and commanding the Perfected. Those who wear the register become immortals. After donning the register, this concludes the rite.\n\nAt the initial reception of this text, men submit the writ at their natal peak, notifying the spirits and transmitting the text. After ten years, the submission is repeated as before; three submissions are made in total. For women, the process is the same: one jiao offering after ten years, with three jiao offerings completed in total.\n\nIn the first year of the Yangshuo era, the cyclical year gengyin, on the first day of the ninth month, jiachen, the Perfected of the Western Peak, Master Wang, aged forty-two, born in the seventh month, now receives from the Great Master of the Lofty Dawn, the Azure Lad of the Eastern Sea, the Winding Silk Phoenix Writ and the Mysterious Mound Perfected Writ of the Five Phases’ Upper Talismans of Sorrow and Joy. Respectfully invoking the Five Thearchs, Five Perfected, Five Immortals, Five Peaks, and Five Numinous Spirits, he submits the writ to form his own covenant and attain Perfected-hood, submitting his name to the Eastern Florescence to be recorded as a Celestial Immortal. May he eternally preserve primordial auspiciousness, in accordance with the writ of the Nine Heavens.\n\nFive silver tablets are inscribed in red and placed upon five altars. After the master faces north and completes the invocation to the spirits, the tablets are buried at the Five Peaks. If only one peak is used, they may be buried according to its respective direction.",
      "overlap_context": "ings serve as the contract for great transcendence and eternal life, embodying the covenant of unyielding resolve. Without this text, a Daoist cannot behold the Lords of the Three Origins.\nNine taels of incense serve as the contract for communion with the numinous, forming the alliance of luminous spirits. Without it, one cannot summon or command the ghosts of the Six Heavens.\n\nMen receive it facing north, with the master facing south.\nWomen receive it facing south, with the master facing north.",
      "start_char": 3671,
      "end_char": 4252,
      "start_sentence": 208,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.276586532592773,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上玉晨凤台曲素上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "施五座，师北向叩齿三十六通，祝曰： 九玄上灵元始天王、五帝玉仙、灵岳大宫真人，王甲已被三炼九试，气骨合真，谨按上吉九天盟文，投书告命，埋简灵山，自是之后，依俯仰书曲，告下魔王，保举上真飞仙羽盖奉迎甲身，上登玉清紫凤之宫。 三告不承，依大真科文，随违列奏，明按奉行。 女受则十年一醮。 初一醮度文，当於密室之中，施一座，向北烧香，甘果五盘置位前，写曲素文，盛以飞罗之巾，置於别案上。 师北向，弟子南向，师叩齿三十六通，微祝曰： 太清高仙景云真人、终天大录太上丈人，今有男真王甲，年如干岁，某月生，谨受曲素忧乐之辞、五帝命魔灵幡、九天凤文玄丘太真书、五行秘符，谨以上吉之日，奉请高晨之气下映兆身，愿告下五帝五真、五岳五灵，记某甲玉名，上奏青宫五帝魔王，保举合真，早得神仙，飞行上清，谒帝晨。 三醮之后，如九天玄科太真明文。 毕，如此三过，醮则都止。 太上曲素五行秘符 太极左仙公撰",
      "translated_text": "The master arranges five altars, faces north, and strikes his teeth thirty-six times in succession, then intones the prayer:\n\n\"To the Nine Mysteries’ Supreme Numen, the Primordial Heavenly Thearch of the Origin; the Jade Immortals of the Five Thearchs; and the Perfected of the Great Palaces of the Numinous Peaks—Wang Jia has undergone the Three Refinements and Nine Trials, his qi and bones now in accord with the Perfected. Reverently following the supremely auspicious covenant-writ of the Nine Heavens, he submits his writ to declare his destiny, burying the tablets upon the numinous mountains. Henceforth, in accordance with the writ’s curves and inflections, he petitions the Demon Kings below to safeguard and advance his Perfected-hood, that he may ascend as a Flying Immortal beneath the feathered canopy, mounting to the Purple Phoenix Palace of Jade Clarity. Should any fail to comply thrice over, in accordance with the statutes of the Great Perfected, their transgression shall be reported for due enforcement.\"\n\nFor female recipients, the rite is performed once every ten years.\n\nFor the first libation and transmission of the writ, it shall take place within a secluded chamber. A single altar is set, facing north, with incense burned and five trays of sweet fruits placed before the altar. The Winding Silk Writ is copied and wrapped in a gossamer silk cloth, then set upon a separate table. The master faces north, the disciple south; the master strikes his teeth thirty-six times and softly intones:\n\n\"To the Lofty Immortal of Scenic Clouds of Grand Clarity and the Celestial Register’s Supreme Elder of the Enduring Heaven—here stands the male Perfected Wang Jia, aged [X] years, born in the [X] month, who reverently receives the Winding Silk’s verses of sorrow and joy, the Five Thearchs’ Mandate-Demon Spirit Banners, the Nine Heavens’ Phoenix Writ of the Mysterious Mound Perfected, and the Five Phases’ Secret Talismans. On this supremely auspicious day, he invokes the qi of the Lofty Morn to descend and illumine his person, beseeching the Five Thearchs, Five Perfected, Five Peaks, and Five Numinous Spirits to inscribe his jade name and submit it to the Five Demon Kings of the Azure Palace, that they may safeguard and advance his Perfected-hood, swiftly attaining immortality to soar through the Grand Clarity and pay homage to the Morn Thearch.\"\n\nAfter three libations, the proceedings shall follow the Mysterious Statutes of the Nine Heavens and the Illuminated Writs of the Grand Perfected. The rite is thus performed thrice in full, after which the libations cease.\n\n**The Supreme Winding Silk and Five Phases’ Secret Talismans**\n*Composed by the Left Immortal Duke of the Supreme Ultimate*",
      "overlap_context": " own covenant and attain Perfected-hood, submitting his name to the Eastern Florescence to be recorded as a Celestial Immortal. May he eternally preserve primordial auspiciousness, in accordance with the writ of the Nine Heavens.\n\nFive silver tablets are inscribed in red and placed upon five altars. After the master faces north and completes the invocation to the spirits, the tablets are buried at the Five Peaks. If only one peak is used, they may be buried according to its respective direction.",
      "start_char": 4252,
      "end_char": 4646,
      "start_sentence": 227,
      "end_sentence": 237,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.847614765167236,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上玉晨凤台曲素上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "太上告后圣金阙帝君曰：元气分判，天地开张，阴阳贯位，三五戌宫，玄置六甲，化生五行金木水火土，总御中元，以炁相生，混合成真。 后学求仙，不知道源，徒劳存思，损疲形神，积涉无感，望道泯泯。 夫欲寻本，当归其根，失根求生，万不得全。 今故抄集上皇玉文，出以相告，子择贤而传。 其法宝秘，望不在言，可依明科，承而奉焉。 太上曰：五行秘文，与天地同生，混化万真，总御神灵。 天无五行，则三光不明，地无五行，山岳崩倾，人无五行，身则朽零。 故五行混合，相须而生。 若有志心，当寻真名，既受其法，天地同根，呼魂召魄，保命役神，修之九年，刻登上仙。 夫受曲素诀辞，学上真之道，当知五行父母真君内讳，存以招魂，召以制魄，魂魄长存，真神总归宫宅，备守形身，便得反於自然。 如此克日游晏玉清，与炁合真矣。 凡修此道，当以甲乙之日，入室烧香，东向存思甲父、乙母二真之神。 父讳青罂，着九元碧宝玄冠，翠羽章衣，手执青精保命秘符。 母讳浩先，头作颓云之髻，着飞青锦裙，手执化生丹霞灵符。 二人以符玄授我身，便叩齿九通，祝曰： 真君父母，化生二灵，三五反真，与元合冥，外摄游魂，内固魄精，长居宫宅，无离本形，长与三元，同保玉清。 毕，服符，又叩齿九通，咽液三过止。 修此九年，洞观无穷，彻视远文，逆知吉凶。 右青精保命秘符，青书白纸，男先服保命符，后服化生丹霞灵符。 右化生丹霞灵符，朱书白纸，女先服丹霞灵符，后服青精保命符。 右甲乙二真阴阳秘符，青书上符，朱书下符。 常以甲乙日，东向服之，并书素佩身。 行之九年得使常阳玉女九人，乘空驾虚，白日登晨。 丙丁之日，入室烧香，南向存思丙父、丁母二真之神。 父讳枢户，着朱阳通天宝冠，绛章之衣，手执朱明保身长存秘符。 母讳纳灵，头作飞云之髻，衣丹飞裙，手执中原黄精秘符。 来授我身，便三呼二真内讳，祝曰： 阴阳变化，二景生真，玉灵反魂，拘魄镇神，三五混合，无离我身，得保日月，三景齐晨。 毕，服符，又叩齿九通，咽炁三过止。 修此八年，真灵降见，云舆来迎。 右朱明保身长存秘符，朱书白纸，男先服，后服中原黄精符也。 右中原黄精符，黄书白纸，女先服，后服朱明保身长存符。 右丙丁二真秘符，朱书上符，黄书下符，常以丙丁之日正中，南向服之，并素书佩身。 行之九年，得使赤珪玉女八人，乘空驾虚，白日登晨。 以戊己之日，入室烧香，向西南存思戊父、己母二真之神。 父讳长卿，着黄华三宝玄冠，衣黄章单衣，手执中元度命保魂秘符。 母讳来生，头作二角颓云髻，着黄锦飞裙，手执金光自然秘符。 来授我身，便三呼二真内讳，祝曰： 中元玄纪，摄御四方，化生五炁，混合帝房，拘魂御魄，与形合同，长保天地，历劫无穷。 毕，服符，又叩齿九通，咽液三过止。 修此十二年，彻见八方，身化金光，乘虚太空。 右中元度命保魂秘符，黄书白纸，男先服，后服金光自然飞符。 右金光自然秘符，白书白纸，女先服，后服中元度命保魂秘符。 右戊己二真秘符，黄书上符，白书下符。 常以戊己之日脯时，向西南服之，书素佩身。 行之九年，得使黄素玉女十二人，乘空蹑虚，飞行上宫。",
      "translated_text": "The Most High addresses the Golden Portal Thearch of Later Saints, saying: When primordial qi divided and judgment was rendered, Heaven and Earth unfolded; yin and yang assumed their positions, the Three and Five took their palaces, the Six Jia were mystically arrayed, and the Five Phases—Metal, Wood, Water, Fire, and Earth—were transformed and born. They govern the Middle Prime, mutually engendering through qi, blending and coalescing into Perfection.\n\nLater students seeking immortality who do not know the source of the Dao labor in vain with meditative visualization, exhausting body and spirit. Their accumulated efforts yield no resonance, and their hope for the Dao fades into obscurity. To seek the origin, one must return to the root; to seek life while losing the root is to attain nothing whole.\n\nThus, I have excerpted and compiled the Jade Writs of the Supreme August, revealing them to you so that you may select the worthy for transmission. These dharma treasures are arcane and not to be spoken lightly; follow the Illuminated Statutes and receive them with reverence.\n\nThe Most High says: The secret writs of the Five Phases came into being with Heaven and Earth, blending and transforming the myriad Perfected and governing the numinous spirits. Without the Five Phases, Heaven’s Three Luminaries would not shine; without the Five Phases, Earth’s mountains and peaks would crumble and collapse; without the Five Phases, the human body would decay and perish. Thus, the Five Phases blend and coalesce, mutually sustaining their generation.\n\nIf one is sincere of heart, one must seek the true names. Having received this method, Heaven and Earth share a common root. Summon the hun-soul and call forth the po-soul to safeguard life and command the spirits. Cultivate this for nine years, and you will ascend to transcendence as an Upper Immortal.\n\nTo receive the Winding Silk oral instructions and study the Dao of the Supreme Perfected, one must know the inner taboo names of the Five Phases’ Father and Mother True Lords. Visualize them to summon the hun-soul and restrain the po-soul. When hun and po endure, the true spirits all return to their palaces, guarding the bodily form, enabling a return to the natural state. Thus, on the appointed day, you may wander in leisure through the Jade Clarity and merge with qi into Perfection.\n\nFor all who cultivate this Dao: On *jia*-*yi* days, enter the chamber, burn incense, and face east to visualize the two true spirits of *jia*-Father and *yi*-Mother. The Father’s taboo name is Qing Ying; he wears the Nine Primordials Azure Jade Mystic Crown, a robe of kingfisher-feather patterns, and holds the Azure Essence Life-Safeguarding Secret Talisman. The Mother’s taboo name is Hao Xian; her hair is coiled in a cascading cloud chignon, she wears a flying azure brocade skirt, and holds the Elixir Radiance Spirit-Transforming Talisman. The two present their talismans to my body. Then, knock the teeth nine times and recite the prayer:\n\n*\"True Lord Father and Mother, transform and engender the Two Numinous Ones. The Three and Five return to Perfection, merging with the Primordial in darkness. Externally, gather the wandering hun-soul; internally, secure the essence of the po-soul. Abide long in the palace, never departing from the original form. Forever with the Three Primes, together safeguard the Jade Clarity.\"*\n\nWhen finished, ingest the talisman, knock the teeth nine more times, and swallow saliva three times to conclude.\n\nCultivate this for nine years, and you will perceive the boundless with penetrating vision, discerning distant texts and foreknowing fortune and misfortune.\n\n**Azure Essence Life-Safeguarding Secret Talisman**: Written in azure on white paper. Men ingest the Life-Safeguarding Talisman first, then the Elixir Radiance Spirit-Transforming Talisman.\n\n**Elixir Radiance Spirit-Transforming Talisman**: Written in vermilion on white paper. Women ingest the Elixir Radiance Talisman first, then the Azure Essence Life-Safeguarding Talisman.\n\n**Yin-Yang Secret Talismans of *Jia-Yi* Two Perfected**: The upper talisman written in azure, the lower in vermilion. Regularly on *jia-yi* days, face east to ingest them, and inscribe them on silk to wear on the body. Practice this for nine years, and you will gain the service of nine Constant Yang Jade Maidens, who ride the void and mount the emptiness, ascending to the Morn in broad daylight.\n\nOn *bing-ding* days, enter the chamber, burn incense, and face south to visualize the two true spirits of *bing*-Father and *ding*-Mother. The Father’s taboo name is Shu Hu; he wears the Vermilion Yang Penetrating Heaven Treasure Crown and a robe of crimson patterns, holding the Vermilion Brightness Body-Safeguarding Everlasting Secret Talisman. The Mother’s taboo name is Na Ling; her hair is coiled in a flying cloud chignon, she wears a cinnabar flying skirt, and holds the Central Plain Yellow Essence Secret Talisman. They come to bestow them upon my body. Then, thrice call the two true spirits’ inner taboo names and recite the prayer:\n\n*\"Yin and yang transform and change; the Two Radiant Ones engender Perfection. The Jade Numinous returns the hun-soul; restrain the po-soul and anchor the spirit. The Three and Five blend and coalesce, never departing from my body. Safeguard the sun and moon, and the Three Radiant Ones unite with the Morn.\"*\n\nWhen finished, ingest the talisman, knock the teeth nine more times, and swallow qi three times to conclude. Cultivate this for eight years, and the true spirits will descend in manifestation, arriving in cloud chariots to welcome you.\n\n**Vermilion Brightness Body-Safeguarding Everlasting Secret Talisman**: Written in vermilion on white paper. Men ingest it first, then the Central Plain Yellow Essence Talisman.\n\n**Central Plain Yellow Essence Talisman**: Written in yellow on white paper. Women ingest it first, then the Vermilion Brightness Body-Safeguarding Everlasting Talisman.\n\n**Secret Talismans of *Bing-Ding* Two Perfected**: The upper talisman written in vermilion, the lower in yellow. Regularly at noon on *bing-ding* days, face south to ingest them, and inscribe them on silk to wear on the body. Practice this for nine years, and you will gain the service of eight Vermilion Jade Maidens, who ride the void and mount the emptiness, ascending to the Morn in broad daylight.\n\nOn *wu-ji* days, enter the chamber, burn incense, and face southwest to visualize the two true spirits of *wu*-Father and *ji*-Mother. The Father’s taboo name is Chang Qing; he wears the Yellow Florescence Three Treasures Mystic Crown and a robe of yellow patterns, holding the Middle Prime Life-Delivering Soul-Safeguarding Secret Talisman. The Mother’s taboo name is Lai Sheng; her hair is coiled in a two-horned cascading cloud chignon, she wears a yellow brocade flying skirt, and holds the Golden Light Spontaneous Secret Talisman. They come to bestow them upon my body. Then, thrice call the two true spirits’ inner taboo names and recite the prayer:\n\n*\"The Middle Prime’s Mystic Record governs and commands the four directions. Transforming and engendering the Five Qi, blending and coalescing in the Thearch’s chamber, restrain the hun-soul and command the po-soul to unite with the form. Long safeguard Heaven and Earth, enduring through kalpas without end.\"*\n\nWhen finished, ingest the talisman, knock the teeth nine more times, and swallow saliva three times to conclude. Cultivate this for twelve years, and you will perceive the eight directions with clarity, your body transforming into golden light to ride the great void of emptiness.\n\n**Middle Prime Life-Delivering Soul-Safeguarding Secret Talisman**: Written in yellow on white paper. Men ingest it first, then the Golden Light Spontaneous Flying Talisman.\n\n**Golden Light Spontaneous Secret Talisman**: Written in white on white paper. Women ingest it first, then the Middle Prime Life-Delivering Soul-Safeguarding Talisman.\n\n**Secret Talismans of *Wu-Ji* Two Perfected**: The upper talisman written in yellow, the lower in white. Regularly at the *pu* hour on *wu-ji* days, face southwest to ingest them, and inscribe them on silk to wear on the body. Practice this for nine years, and you will gain the service of twelve Yellow Silk Jade Maidens, who tread the void and mount the emptiness, flying to the Upper Palace.",
      "overlap_context": " they may safeguard and advance his Perfected-hood, swiftly attaining immortality to soar through the Grand Clarity and pay homage to the Morn Thearch.\"\n\nAfter three libations, the proceedings shall follow the Mysterious Statutes of the Nine Heavens and the Illuminated Writs of the Grand Perfected. The rite is thus performed thrice in full, after which the libations cease.\n\n**The Supreme Winding Silk and Five Phases’ Secret Talismans**\n*Composed by the Left Immortal Duke of the Supreme Ultimate*",
      "start_char": 4646,
      "end_char": 5918,
      "start_sentence": 238,
      "end_sentence": 283,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.13522028923035,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上玉晨凤台曲素上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "庚辛之日，入室烧香，西向存思庚父、辛母二真之神。 父讳启明，着九元碧宝玄冠，素羽章衣，手执素灵召神保〔命〕#6秘符。 母讳德神，头作飞云之髻，衣素饰飞裙，手执玄阴生形上化秘符。 来授我身，便三呼二真内讳，祝曰： 金精玄注，结炁九灵，流真混金，灌晨身形，使我魂魄，安镇黄宁，饥食三元，渴饮玉精，乘虚驾浮，游晏紫庭。 仍服符毕，又叩齿九通，咽炁三过止。 修此六年，得驾景霄晨，出入紫房。 右素灵召神保命秘符，白书白纸上，男先服，后服玄阴生形上化符。 右玄阴生形上化秘符，墨书白纸上，女先服，后服素灵召神保命秘符。 右庚辛二真秘符。 白书上符，墨书下符。 常以庚辛之日入室，西向服之，书素佩身。 行之九年，得使素灵玉女六人，乘空蹑虚，飞行上宫。 壬癸之日，入室烧香，北向存思壬父、癸母二真之神。 父讳朔灵，着玄晨之冠，皂执单衣，手执通灵长命秘符。 母讳法劳，头作颓云髻，衣玄锦飞裙，手执飞仙腾化秘符。 来授我身，便三呼二真内讳，祝曰： 上有九元，化生阴阳，五行各差，金刚反强，三晨宝曜，冠我衣裳，五色流黄，天关开张，上升玉清，出入帝房。 毕，服符，又叩齿九通，咽炁九过止。 修行五年，洞视无崖，逆知吉凶，乘虚驾浮，上升霄晨。 右通灵长命秘符，墨书白纸，男先服，后服飞仙腾化秘符。 右飞仙腾化秘符，青书白纸，女先服，后服通灵长命秘符。 右壬癸二真秘符，墨书上符，青书下符。 常以壬癸之日夜半，北向服之，并书素佩身。 行之九年，得使太玄玉女五人，乘虚驾空，白日升天。 后圣金阙帝君，奉受太上施用曲素诀辞五行秘书宝诀，即命太极左仙公铸金为简，紫笔书文，秘於九天之上大有之宫玉房之内。 太上以西华玉女三百人，侍卫灵文，幡七宝之华，流五色之精，金真玄映，散香紫庭，飞霞蓊蔼，八会俱生，光曜琼宫，焕赫玉清，阴阳否而不亏，履亿劫而方鲜。 匡络於众妙，威制於群灵，呼魂召魄，万神总还，极微之化，五行之妙真。 其文宝秘，不得轻泄，传非其人。 若有至学，欲单佩五行秘符者，亦听别盟而传。 传法师与弟子告斋七日，弟子赍五色之缯各五十尺、金钮五双，以誓玉帝之宫，师告誓度文。 奉受之后，不得冒淹入秽，触忤道真。 轻泄天文，使人见闻，七玄父母长闭地狱，己身十苦八难，万不得仙，慎而奉行。 上清高上玉晨凤台向素上经竟 #1『书』字原缺，据上下文补。 #2『束』原作『来』。 #3『克』原作『冠』。 #4『帝』原作『华』。 #5『请』字原误作『诸』。 #6『命』字原缺，据下文补。",
      "translated_text": "On *geng-sin* days, enter the chamber, burn incense, and face west to visualize the two Perfected of *Geng* Father and *Xin* Mother. The father’s name is **Starter of Brightness**, wearing a Ninefold Primordial Azure-Jade Mystic Crown and a robe of plain feathered splendor, holding the **White Numinous Summoning Spirit Life-Safeguarding Secret Talisman**. The mother’s name is **Virtue-Spirit**, her hair coiled in a soaring-cloud chignon, clad in a plain skirt adorned with flying patterns, holding the **Mystic Yin Life-Form Ascending Transmutation Secret Talisman**. As they come to bestow upon me, I thrice invoke the inner names of the two Perfected and pray:\n\n*\"Golden essence infuses the Mystic,\nCongealing qi into Ninefold Numinosity.\nFlowing Perfected blends with gold,\nIrrigating the dawn-body’s form.\nMay my hun and po\nBe settled in Yellow Tranquility.\nHunger is fed with Threefold Primordial,\nThirst quenched with Jade Essence.\nRiding the void, steering the floating,\nI wander and feast in the Purple Court.\"*\n\nAfter ingesting the talisman, knock the teeth nine times and swallow qi thrice to conclude. Practicing this for six years, one may ride the auroral clouds of dawn, entering and exiting the Purple Chamber.\n\n**White Numinous Summoning Spirit Life-Safeguarding Secret Talisman**: Written in white on white paper. Men ingest it first, then the **Mystic Yin Life-Form Ascending Transmutation Talisman**.\n\n**Mystic Yin Life-Form Ascending Transmutation Secret Talisman**: Written in black on white paper. Women ingest it first, then the **White Numinous Summoning Spirit Life-Safeguarding Talisman**.\n\n**Secret Talismans of *Geng-Xin* Two Perfected**: The upper talisman written in white, the lower in black. Regularly on *geng-sin* days, enter the chamber, face west to ingest them, and inscribe them on silk to wear on the body. Practicing this for nine years, one will gain the service of six White Numinous Jade Maidens, who tread the void and mount the emptiness, flying to the Upper Palace.\n\nOn *ren-gui* days, enter the chamber, burn incense, and face north to visualize the two Perfected of *Ren* Father and *Gui* Mother. The father’s name is **Dawn Numinous**, wearing a Mystic Dawn Crown and a plain black robe, holding the **Penetrating Numinous Longevity Secret Talisman**. The mother’s name is **Dharma-Labor**, her hair coiled in a cascading-cloud chignon, clad in a dark brocade flying skirt, holding the **Flying Immortal Ascending Transmutation Secret Talisman**. As they come to bestow upon me, I thrice invoke the inner names of the two Perfected and pray:\n\n*\"Above lies the Ninefold Primordial,\nTransforming to generate yin and yang.\nThe Five Phases diverge in order,\nDiamond hardness reverses to strength.\nThree Dawns’ Jeweled Luminaries\nAdorn my robes and garments.\nFive hues flow in yellow,\nHeaven’s gates open wide.\nAscending to Jade Purity,\nI enter and exit the Emperor’s Chamber.\"*\n\nAfter ingesting the talisman, knock the teeth nine times and swallow qi nine times to conclude. Practicing this for five years, one will perceive boundlessly, foreknow the auspicious and inauspicious, ride the void and steer the floating, ascending to the auroral clouds of dawn.\n\n**Penetrating Numinous Longevity Secret Talisman**: Written in black on white paper. Men ingest it first, then the **Flying Immortal Ascending Transmutation Talisman**.\n\n**Flying Immortal Ascending Transmutation Secret Talisman**: Written in blue-green on white paper. Women ingest it first, then the **Penetrating Numinous Longevity Talisman**.\n\n**Secret Talismans of *Ren-Gui* Two Perfected**: The upper talisman written in black, the lower in blue-green. Regularly on *ren-gui* days at midnight, face north to ingest them, and inscribe them on silk to wear on the body. Practicing this for nine years, one will gain the service of five Great Mystic Jade Maidens, who ride the void and steer the emptiness, ascending to heaven in broad daylight.\n\nThe Later Saintly Lord of the Golden Watchtower received from the Most High the **Winding Plain Oral Instructions of the Five Phases’ Secret Writings and Precious Formulas**, whereupon the Most High commanded the Left Immortal Duke of the Supreme Ultimate to cast gold into tablets, inscribe the text with purple brush, and conceal it within the Jade Chamber of the Great Possession Palace above the Nine Heavens. The Most High appointed three hundred Western Flower Jade Maidens to guard the sacred writ, their banners adorned with the splendor of the Seven Treasures, streaming the essence of the Five Colors. Golden Perfected and Mystic Radiance intermingle, scattering incense in the Purple Court. Flying auroras billow and swirl, the Eight Assemblies arise in unison, illuminating the Jade Palace with brilliance, resplendent in Jade Purity. Yin and yang, though obstructed, remain unharmed; treading through a hundred kalpas, they ever flourish. They govern the host of wonders, wield authority over the multitude of spirits, summon hun and call po, restoring all gods to wholeness. Their transformations reach the subtlest essence, their wonders embody the Five Phases’ true mystery.\n\nThis sacred writ is profoundly secret and must not be lightly disclosed. It is transmitted only to the worthy. Should a devoted student seek to wear the Five Phases’ secret talismans alone, permission may be granted through a separate covenant. The master and disciple observe a seven-day fast, and the disciple presents fifty feet each of the Five Colors’ silks and five pairs of gold buttons to swear an oath before the Jade Emperor’s Palace. The master then conveys the **Oath of Transmission and Salvation Text**. After receiving the teachings, one must not recklessly enter defiled places or offend the Perfected of the Dao. To lightly disclose celestial writ, allowing others to see or hear it, will cause the Seven Mystic Parents to seal one in the earthly prisons forever. One’s own body will suffer the Ten Torments and Eight Calamities, and ascension to immortality will be utterly impossible. Guard this well and practice accordingly.\n\nThe **Upper Clarity Highest Jade Dawn Phoenix Terrace Facing Plain Upper Scripture** is now complete.",
      "overlap_context": "on white paper. Women ingest it first, then the Middle Prime Life-Delivering Soul-Safeguarding Talisman.\n\n**Secret Talismans of *Wu-Ji* Two Perfected**: The upper talisman written in yellow, the lower in white. Regularly at the *pu* hour on *wu-ji* days, face southwest to ingest them, and inscribe them on silk to wear on the body. Practice this for nine years, and you will gain the service of twelve Yellow Silk Jade Maidens, who tread the void and mount the emptiness, flying to the Upper Palace.",
      "start_char": 5919,
      "end_char": 6955,
      "start_sentence": 284,
      "end_sentence": 323,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.21768260002136,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高上玉晨凤台曲素上经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}