{
  "source_id": "上清司命茅真君修行指迷诀",
  "source_file": "chunked_daozang\\上清司命茅真君修行指迷诀.json",
  "total_chunks": 2,
  "total_original_chars": 2239,
  "total_translated_chars": 12250,
  "total_translation_time": 62.55048441886902,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\上清司命茅真君修行指迷诀.txt",
    "category": "方法类"
  },
  "full_translation": "**The Supreme Clarity Lord Mao’s Instructions for Resolving Delusions in Cultivation**\n\n*Scripture Title:* *The Supreme Clarity Lord Mao’s Instructions for Resolving Delusions in Cultivation*\n*Author:* Unknown\n*Volume:* One\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Section on Methods of the Divine Empyrean* (Dongshen bu fangfa lei). Collated with excerpts from *The Seven Bamboo Tablets of the Cloudy Satchel* (Yunji qiqian), juan 61.\n\n---\n\n### **Instructions for Superior Practitioners on Refining Qi**\n\nWhen refining qi, lie supine with the body relaxed. Slowly rinse the mouth with sweet spring water and swallow it. Do not hold the breath in the mouth; simply exhale through the mouth and inhale through the nose, ensuring no foul qi enters. Gently contract the nostrils—do not overfill, for extreme fullness makes recovery difficult.\n\nAfter five breaths, exhale once; do not overdo it. Count each breath to ten, then bend the fingers to tally ninety breaths. If fatigued, rest briefly. Four sets of ninety (360 breaths) complete one cycle of focused intent.\n\nVisualize the yellow qi within the spleen, as large as a goose egg, and maintain this awareness. When the mind grows weary, first refine qi for three sets of seven (210 breaths). Refine qi until the abdomen feels evenly full; when full, store the qi without letting it escape. Hold the breath for seventy breaths, avoiding frequent interruptions. The qi should rise naturally, flowing through the four limbs until warmth descends to the feet.\n\nGradually regulate the qi, guiding it back to the stomach, throat, and esophagus, circling the navel once, twice, thrice, four times, then returning to the esophagus. Perform this refinement while lying supine, beginning at sunrise.\n\nRefining qi for seventy breaths, repeated four or five times, will reverse white hair. To refine qi effectively, swiftly perform one set of nine or three sets of nine—four sets of nine complete the practice.\n\nAfter one cycle of refinement, the body will feel no pain. Swiftly refine qi in urgent situations. When first storing qi, hold half a goose egg’s worth in the mouth while sleeping. Swallow a thousand times, constantly producing saliva, and use the mouth’s fluids until they deplete after two days. Then, for ten breaths, relax the body.\n\nWhen relaxing the body, as if shedding clothes, perform three sets of seven (210 breaths) to complete one cycle. Practicing with unbound hair is optimal.\n\n**Another Method:** Begin at the feet, tracing upward along the yin meridians. Follow the path of the urethra into the kidneys, then upward to the throat. Reverse the flow, guiding the qi like the threads of a loom, directing it straight into the throat, then downward into the lower abdomen, nourishing and infusing the feet.\n\nRegularly absorb the five-colored qi, clearly visualizing them in the throat before guiding them downward along the throat meridian. Constantly preserve the Three Origins and Three Circles, embedding them in the kidneys. The kidney circle is encased in blue, which transitions to red, then yellow, and finally white—do not let the eyes wander.\n\nThe Three Circles are the Three Origins: the Mud Pill Palace (brain), the Crimson Palace (heart), and the Cinnabar Field (lower abdomen). The first circle is refining qi without ceasing.\n\nLie flat, close the eyes, shut the mouth, and let the hair loose. Extend both hands, slightly contract the abdomen, and gently contract the nostrils. Before fully exhaling, inhale again, ensuring the abdomen does not follow the breath.\n\nCount ten breaths per finger bend, up to seventy breaths, then swallow. Once more, fill with qi, storing it in the throat meridian, allowing it to flow smoothly. After another seventy breaths, swallow again, guiding the qi from the flanks and lower abdomen upward into the brain.\n\nThe true external flanks are mottled, supporting the hair above. After three sets of seven (210 breaths), ensure the qi does not cross paths. Harmonize and guard the spirit and qi, renewing the body’s vitality and maintaining constant peace.\n\nIf the five viscera lack governance, the body grows emaciated, sinews slacken, bones weaken, and walking becomes laborious. Vitality withers, skin peels, fingers lose color, essence and qi deplete, and vitality wanes—these are the signs.\n\n---\n\n### **The Celestial Elder’s Qi Method for the Ten Heavenly Stems and Twelve Months**\n\n**Jia Day:** When essence reaches the first ten-day period, purge the five viscera. Thirst drives one to drink water and broth; the complexion fades. Urine turns reddish-yellow, and bowel movements become slightly difficult, the stool firm and qi robust. The intestines rumble as if injured. Expel perverse qi without fear. The practice is arduous, the eyes dim. The seasons of spring and autumn, the length of days and months, the waxing and waning of yin and yang—all follow the scriptural patterns.\n\n**Yi Day:** When essence reaches the second ten-day period, grain qi begins to wane, and perverse qi flees. True qi weakens, taking water as its root. Suddenly, one feels disoriented, the will unsettled. Guard it without loss. The Jade Flower of the Flowery Pond serves as the method. Externally, one appears haggard, the body frail, movement difficult.\n\n**Bing Day:** When essence reaches the third ten-day period, essence and qi return to their original state, grain qi untainted. The two qi intermingle, neither settling nor stabilizing. The mind remains tranquil, uninterested in grain. Essence and qi reside within, flourishing and active. The effect of utmost sincerity is evident—strive to fulfill it. Hold firm without loss; one achievement completes the task. The Jade Flower of the Flowery Pond becomes pure and radiant.\n\n**Ding Day:** When the Dao reaches the fourth ten-day period, grain qi departs the body, and essence qi governs alone. Meridian qi weakens, coming and going intermittently. The complexion grows lustrous, daily receiving its former vitality. The heart and will rejoice, fear vanishing. Flesh regenerates daily, blood and qi overflow. Radiance and smoothness align with proper measure. Yin and yang are managed, harmonized, supplemented, and drained. The body becomes moist and glossy.\n\n**Wu Day:** When the Dao reaches the fifth ten-day period, essence qi rests securely, external affairs set aside. The five viscera harmonize, the spirit nurtured within. Lying down brings comfort; the skin renews. Movement and walking proceed smoothly, essence unharmed. Spirit and qi drift, dreams and waking visions appear. External events startle, as if responding to sounds. Calls and shadows manifest; the hair stands firm, the will resolute. The arrival of high essence is confirmed as effective.\n\n**Ji Day:** When the Dao reaches the sixth ten-day period, essence qi flows smoothly, upper and lower harmonized. Hair and skin become lustrous, limbs agile. Walking resumes its former ease; ears and eyes grow sharp. The will is serene, fear gone. Bending the body is effortless; joints move freely. Grain is no longer craved; swallowing qi nourishes the embryo. Wine may be drunk, food eaten, in whatever measure desired, without restriction.\n\n**Geng Day:** When the Dao reaches the seventh ten-day period, essence qi flows unimpeded, serene and settled. The orifices harmonize; the five viscera grow pure and still. Breathing in refined qi, one washes away evil and draws in the upright. Shedding the old and embracing the new, one rests in clarity and purity. Within, the will and qi are ordered; without, one’s appearance daily flourishes. Movement becomes lively, the feet light as if treading upon air. Fond of quietude, one avoids contention with others. The efficacy of supreme essence is recorded in the Daoist canon.\n\n**Xin Day:** When the Dao reaches the eighth ten-day period, qi roams to the eight poles, nourishing and defending the body in fullness. Qi flows smoothly, traversing the branching meridians. Above and below, within and without, all is moistened and harmonious. The five viscera stabilize, ascending to the immortal’s court. Free from craving, one rests in tranquility. The heart and will are at peace, untroubled by alarm. Within, no fear arises; joy fills one’s days. Holding fast without loss, the Dao manifests and spirit is perfected. With such proven efficacy, one transcends the world and attains long life.\n\n**Ren Day:** When the Dao reaches the ninth ten-day period, essence qi fills to abundance, the numinous spirit expands. The timid grow resolute, the weak grow strong. What was diminished is restored; what was impaired is harmonized. Without seeking, it comes of itself; without effort, it finds ease. Radiance and moisture flourish; the voice grows resonant. Sweetness fills the mouth, fragrance the nose. The Jade Pool and Flowery Pond ever abide, unceasing. Such is the work of supreme essence—one may follow the Dao in practice.\n\n**Gui Day:** When the Dao reaches the tenth ten-day period, essence qi arrives in full, the spirit’s path unobstructed. The body grows light and sturdy, flesh and spirit suffused with vitality. The eyes open to all sights, the will and qi soar. Free from desire, the belly and bowels are cleansed. Essence preserved and spirit abiding, virtue and Dao converge in splendor. From the first ingestion of food and drink, one gains enduring longevity. In vigor, one knows not age, dwelling among true immortals. Rising and sinking with the Dao, one attains the numinous.\n\n**The Method of Ingesting Qi:**\nBegin on the day heaven bestows upon humanity—*jiachen* or *geng* days—or on the days when the four seasons are in their prime. Then commence taking the elixir.\n\nAt first, ingest nine full breaths as the measure. Each subsequent day, reduce one meal. By the tenth day, grain is wholly abandoned. All other foods may be set aside at once, for one may live on qi alone.\n\nIn the method of ingesting qi, swallow ten jujubes with ten breaths, using the jujubes as counters to track the amount of qi consumed. When the mouth fills with the Jade Pool’s Flowery Pond, the Sweet Dew and Nectar Spring, saliva flows of itself.\n\nIn the Dao of ingesting qi, qi is the treasure. After one year, the skin and flesh grow full and radiant. After two years, the joints harmonize. After three years, the sinews and bones grow firm and strong. After four years, the marrow fills the bones.\n\nHeaven has four seasons; thus, the ingestion of qi accords with them. After four years, spirit and form commune. When this communion spans years, one becomes as the numinous: unseen in form, unheard in sound, arriving without movement, unknown yet present. This is the unity of form and spirit—such a one is called a *zhenren*. On the same day, one attains long life, sharing the heavens’ numinous power.\n\n**Monthly Ingestion of Qi:**\n- **First month:** Inhale 160 breaths of yang qi at dawn; 200 breaths of yin qi at dusk.\n- **Second month:** Inhale 180 breaths of yang qi at dawn; 180 breaths of yin qi at dusk.\n- **Third month:** Inhale 200 breaths of yang qi at dawn; 160 breaths of yin qi at dusk.\n- **Fourth month:** Inhale 220 breaths of yang qi at dawn; 140 breaths of yin qi at dusk.\n- **Fifth month:** Inhale 240 breaths of yang qi at dawn; 120 breaths of yin qi at dusk.\n- **Sixth month:** Inhale 220 breaths of yang qi at dawn; 140 breaths of yin qi at dusk.\n- **Seventh month:** Inhale 200 breaths of yang qi at dawn; 160 breaths of yin qi at dusk.\n- **Eighth month:** Inhale 180 breaths of yang qi at dawn; 180 breaths of yin qi at dusk.\n- **Ninth month:** Inhale 160 breaths of yang qi at dawn; 200 breaths of yin qi at dusk.\n- **Tenth month:** Inhale 140 breaths of yang qi at dawn; 220 breaths of yin qi at dusk.\n- **Eleventh month:** Inhale 120 breaths of yang qi at dawn; 240 breaths of yin qi at dusk.\n- **Twelfth month:** Inhale 140 breaths of yang qi at dawn; 220 breaths of yin qi at dusk.\n\nYang qi is drawn in through the nose; yin qi is drawn in through the mouth. In these two qi, if one can persist day and night through the twelve months—completing one cycle of heaven and then another—one’s years will match heaven’s. Thus ends the *Instructions for Cultivation to Dispel Delusion* by Lord Mao of the Upper Clarity, Controller of Destinies.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清司命茅真君修行指迷诀 经名：上清司命茅真君修行指迷诀。 不着撰人？ 一卷。 底本出处：《正统道藏》洞神部方法类，参校版本：《云笈七签》，该书春六十一收入部分内容。 上清司命茅真君修行指迷诀 上士修行炼炁诀 炼炁正偃外，徐漱醴泉咽之，莫闭口行炁，口但得吐炁，鼻但得入炁，不欲令恶炁入也。 徐缩鼻，莫大极满，极满难还。 入五息已，一息可吐，莫大极。 一息数之十数，屈指至九十息，疲可殷中，四九三百六十息为一意。 思脾中黄炁，大如鹦子，常念之，意中有疲倦，当先炼炁三七二百一十息。 炼炁还令腹平满，平满藏炁不大令出，闭炁七十息，莫致频击之，炁当随发上，竟流四支，自热下至足脚。 徐调炁，还至胃管喉咽，使绕脐一二三四，即还管矣。 炼炁偃外为之，日出便当坐行之。 炼炁七十息，四五度白发去矣。 夫委炁善炼炁，急击一九、三九於意佳，四九事竟。 炼炁一竟，使人身体不知痛，击卒急处，炼疾也。 夫委炁先在口，口含半鹦子睡，当千咽、常唾，故遣口中津洵持用，待竭二日，十息解体身。 解体身时，如委衣三七二百一十息，一竟，常被发为之佳。 一法：从足起於上，寻除阴脉，上随小便内经肾，寻除至喉，复从上下，炁如机纹，正向喉中，来入浅腹，养注足。 五色炁常取，令分明置喉中，从胡脉下，常存三元三规，成着肾，肾规裹青，青赤表黄，黄已日白，妄见目止。 炼炁三规，即三元也。 即注泥丸、绛宫、丹田是也。 上规一曰炼炁不息。 正偃瞑目，闭口被发，两手张，腹小缩，鼻微缩，还未及，因复取唐还炁，腹不得随也。 十息一屈指，至七十息一咽，复更盛，炁存胡脉中，平平涓泄，复七十息一咽，小胁小腹，炁上入脑。 外真胁斑，驳上承发，三七二百一十息，令炁莫交错，调适守治精神炁新，处形常安。 如五藏无主，形体羸瘦，惫筋缓骨，重难以行步，荣华枯落，皮肤革去，十指无色，精炁虚瘦炁乏，乃信此为候。 天老十干第甲经十二月炁法 第甲日，精至一旬之时。 涤荡五藏，渴饮水浆，颜色脱去，小便赤黄，大便微难，粪而炁刚，肠中雷呜，如有臧伤，逐除邪炁，无或恐惶，行苦艰难，两目芒芒，时节春秋，日月短长，阴阳损益，皆如经章。 第乙日，精至二旬之时。 谷熙始尽，邪炁逃亡，真炁微弱，以水为根，忽然恍恍，志意怅怅，守之无失，华池玉英，以是为法，外起案林，形体瘦弱，难以动行。 第丙日，精至三旬之时，精炁如故，谷炁无滓，两炁交错，莫肯适住，意中恬然，不思谷食，精炁在内，王相用事，至诚之效，努力可副，坚守无失一功成事遂，华池玉英，洁白可喜。 第丁日，道至四旬之时。 谷炁离形，精炁独治，脉炁微弱，乍去乍来，颜色益泽，日受其故，心志悦欣，不复恐惧，肌肉日生，血炁有余，光华滑利，往来应度，经营阴阳，和调补写，身形润泽。 第戊日，道至五旬之时。 精炁安处，外事屏去，五藏和调，精神内养，卧而安席，皮肤改更，动作引步，至精不效，神炁浮游，数见梦寤，外时自惊，若有响应，唤呼光影，髻实志苦，高精所至，信效为佳。 第己日，道至六旬之时。 精炁利安，上下和通，发肤润泽，支体易行，行步伏故，耳目聪明，志意漠然，不复恐惶，屈身利便，机关和良，不念谷食，咽炁益胎，得酒而饮，得食而食，多少自在，无所萦禁。",
      "translated_text": "**The Supreme Clarity Lord Mao’s Instructions for Resolving Delusions in Cultivation**\n\n*Scripture Title:* *The Supreme Clarity Lord Mao’s Instructions for Resolving Delusions in Cultivation*\n*Author:* Unknown\n*Volume:* One\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Section on Methods of the Divine Empyrean* (Dongshen bu fangfa lei). Collated with excerpts from *The Seven Bamboo Tablets of the Cloudy Satchel* (Yunji qiqian), juan 61.\n\n---\n\n### **Instructions for Superior Practitioners on Refining Qi**\n\nWhen refining qi, lie supine with the body relaxed. Slowly rinse the mouth with sweet spring water and swallow it. Do not hold the breath in the mouth; simply exhale through the mouth and inhale through the nose, ensuring no foul qi enters. Gently contract the nostrils—do not overfill, for extreme fullness makes recovery difficult.\n\nAfter five breaths, exhale once; do not overdo it. Count each breath to ten, then bend the fingers to tally ninety breaths. If fatigued, rest briefly. Four sets of ninety (360 breaths) complete one cycle of focused intent.\n\nVisualize the yellow qi within the spleen, as large as a goose egg, and maintain this awareness. When the mind grows weary, first refine qi for three sets of seven (210 breaths). Refine qi until the abdomen feels evenly full; when full, store the qi without letting it escape. Hold the breath for seventy breaths, avoiding frequent interruptions. The qi should rise naturally, flowing through the four limbs until warmth descends to the feet.\n\nGradually regulate the qi, guiding it back to the stomach, throat, and esophagus, circling the navel once, twice, thrice, four times, then returning to the esophagus. Perform this refinement while lying supine, beginning at sunrise.\n\nRefining qi for seventy breaths, repeated four or five times, will reverse white hair. To refine qi effectively, swiftly perform one set of nine or three sets of nine—four sets of nine complete the practice.\n\nAfter one cycle of refinement, the body will feel no pain. Swiftly refine qi in urgent situations. When first storing qi, hold half a goose egg’s worth in the mouth while sleeping. Swallow a thousand times, constantly producing saliva, and use the mouth’s fluids until they deplete after two days. Then, for ten breaths, relax the body.\n\nWhen relaxing the body, as if shedding clothes, perform three sets of seven (210 breaths) to complete one cycle. Practicing with unbound hair is optimal.\n\n**Another Method:** Begin at the feet, tracing upward along the yin meridians. Follow the path of the urethra into the kidneys, then upward to the throat. Reverse the flow, guiding the qi like the threads of a loom, directing it straight into the throat, then downward into the lower abdomen, nourishing and infusing the feet.\n\nRegularly absorb the five-colored qi, clearly visualizing them in the throat before guiding them downward along the throat meridian. Constantly preserve the Three Origins and Three Circles, embedding them in the kidneys. The kidney circle is encased in blue, which transitions to red, then yellow, and finally white—do not let the eyes wander.\n\nThe Three Circles are the Three Origins: the Mud Pill Palace (brain), the Crimson Palace (heart), and the Cinnabar Field (lower abdomen). The first circle is refining qi without ceasing.\n\nLie flat, close the eyes, shut the mouth, and let the hair loose. Extend both hands, slightly contract the abdomen, and gently contract the nostrils. Before fully exhaling, inhale again, ensuring the abdomen does not follow the breath.\n\nCount ten breaths per finger bend, up to seventy breaths, then swallow. Once more, fill with qi, storing it in the throat meridian, allowing it to flow smoothly. After another seventy breaths, swallow again, guiding the qi from the flanks and lower abdomen upward into the brain.\n\nThe true external flanks are mottled, supporting the hair above. After three sets of seven (210 breaths), ensure the qi does not cross paths. Harmonize and guard the spirit and qi, renewing the body’s vitality and maintaining constant peace.\n\nIf the five viscera lack governance, the body grows emaciated, sinews slacken, bones weaken, and walking becomes laborious. Vitality withers, skin peels, fingers lose color, essence and qi deplete, and vitality wanes—these are the signs.\n\n---\n\n### **The Celestial Elder’s Qi Method for the Ten Heavenly Stems and Twelve Months**\n\n**Jia Day:** When essence reaches the first ten-day period, purge the five viscera. Thirst drives one to drink water and broth; the complexion fades. Urine turns reddish-yellow, and bowel movements become slightly difficult, the stool firm and qi robust. The intestines rumble as if injured. Expel perverse qi without fear. The practice is arduous, the eyes dim. The seasons of spring and autumn, the length of days and months, the waxing and waning of yin and yang—all follow the scriptural patterns.\n\n**Yi Day:** When essence reaches the second ten-day period, grain qi begins to wane, and perverse qi flees. True qi weakens, taking water as its root. Suddenly, one feels disoriented, the will unsettled. Guard it without loss. The Jade Flower of the Flowery Pond serves as the method. Externally, one appears haggard, the body frail, movement difficult.\n\n**Bing Day:** When essence reaches the third ten-day period, essence and qi return to their original state, grain qi untainted. The two qi intermingle, neither settling nor stabilizing. The mind remains tranquil, uninterested in grain. Essence and qi reside within, flourishing and active. The effect of utmost sincerity is evident—strive to fulfill it. Hold firm without loss; one achievement completes the task. The Jade Flower of the Flowery Pond becomes pure and radiant.\n\n**Ding Day:** When the Dao reaches the fourth ten-day period, grain qi departs the body, and essence qi governs alone. Meridian qi weakens, coming and going intermittently. The complexion grows lustrous, daily receiving its former vitality. The heart and will rejoice, fear vanishing. Flesh regenerates daily, blood and qi overflow. Radiance and smoothness align with proper measure. Yin and yang are managed, harmonized, supplemented, and drained. The body becomes moist and glossy.\n\n**Wu Day:** When the Dao reaches the fifth ten-day period, essence qi rests securely, external affairs set aside. The five viscera harmonize, the spirit nurtured within. Lying down brings comfort; the skin renews. Movement and walking proceed smoothly, essence unharmed. Spirit and qi drift, dreams and waking visions appear. External events startle, as if responding to sounds. Calls and shadows manifest; the hair stands firm, the will resolute. The arrival of high essence is confirmed as effective.\n\n**Ji Day:** When the Dao reaches the sixth ten-day period, essence qi flows smoothly, upper and lower harmonized. Hair and skin become lustrous, limbs agile. Walking resumes its former ease; ears and eyes grow sharp. The will is serene, fear gone. Bending the body is effortless; joints move freely. Grain is no longer craved; swallowing qi nourishes the embryo. Wine may be drunk, food eaten, in whatever measure desired, without restriction.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1312,
      "start_sentence": 0,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.40468716621399,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上清司命茅真君修行指迷诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "第庚日，道至七旬之时。 精炁如通，漠然安定，孔窍调和，五藏洁静，呼吸精炁，涤邪纳正，去恶远新，安然清诤，内理志炁，外貌日盛，动故踊跃，轻其足经，若好静处，不与人争，至精之效，以为道经。 第辛日，道至八旬之时。 炁游八极，荣卫充盈，调炁便利，往来歧经，上下表裹，润泽和平，五藏皆定，经历仙庭，恬啖无欲，安然而宁，心志安悦，休惕不惊，内无恐惧，欢乐平生，长守无失，道着神成，既有效验，度世长生。 第壬日，道至九旬之时。 精炁充满，灵神开张，懦者而刚，弱者而强，损者复益，废者和良，不行自来，不送自逸，荣华滋润，音声益彰，口中甘味，鼻中芳香，华池玉英，常存不忌，至精所致，道可仕遵。 第癸日，道至十旬之时。 精炁皆到，神道疏通。 轻壮肌肉，充布神明，目尽开览，志炁翱翔，恬恬无欲，荡涤腹肠，精存神在，道德会昌，初服饮食，乃能久长，壮不知老，真仙同乡，与道沉浮，可致神明。 食炁之法：必以天生人之日，谓甲辰庚日也，乃若四时王相日，始饮药。 食熙初，以九口满饮为法，后日臧一餐，十日谷绝矣。 他余物一时睹，皆可食炁。 食炁之法，十咽啖枣十，以枣为筹，为知食炁多少。 若使口中，华池玉英，甘露醴泉，津洵自生，凡食熙之道，炁为宝，一岁至肌肤充荣，二岁至机关和良，三岁至筋骨坚强，四岁至骨髓填塞。 天有四时，故人食炁亦应之。 四岁即神与形通。 通日数有岁，如神明者，不视形见，不听声闻，不行而至，不见知之，此所谓形一神，名日真人矣。 同日长生，与天司灵。 正月朝食阳炁一百六十，暮食阴炁二百。 二月朝食阳炁一百八十，暮食阴炁一百八十。 三月朝食阳炁二百，暮食阴炁一百六十。 四月朝食阳炁二百二十，暮食阴炁一百四十。 五月朝食阳炁二百四十，暮食阴炁一百二十。 六月朝食阳炁二百二十，暮食阴炁一百四十。 七月朝食阳炁二百，暮食阴炁一百六十。 八月朝食阳炁一百八十，暮食阴炁一百八十。 九月朝食阳炁一百六十，暮食阴炁一月朝食阳炁一百四十？ 暮食二十。 十一月朝食阳为一百二十，暮食阴炁二百四十。 十二月朝食阳炁一百四十，暮食阴炁二百二十。 夫阳炁者，鼻取之炁也。 阴炁者，口取之炁也。 、此二炁，十二月中，日日旦暮能不能者，周天一竟又一周天，是则与天同龄矣。 上清司命茅真君修行指迷诀竟",
      "translated_text": "**Geng Day:** When the Dao reaches the seventh ten-day period, essence qi flows unimpeded, serene and settled. The orifices harmonize; the five viscera grow pure and still. Breathing in refined qi, one washes away evil and draws in the upright. Shedding the old and embracing the new, one rests in clarity and purity. Within, the will and qi are ordered; without, one’s appearance daily flourishes. Movement becomes lively, the feet light as if treading upon air. Fond of quietude, one avoids contention with others. The efficacy of supreme essence is recorded in the Daoist canon.\n\n**Xin Day:** When the Dao reaches the eighth ten-day period, qi roams to the eight poles, nourishing and defending the body in fullness. Qi flows smoothly, traversing the branching meridians. Above and below, within and without, all is moistened and harmonious. The five viscera stabilize, ascending to the immortal’s court. Free from craving, one rests in tranquility. The heart and will are at peace, untroubled by alarm. Within, no fear arises; joy fills one’s days. Holding fast without loss, the Dao manifests and spirit is perfected. With such proven efficacy, one transcends the world and attains long life.\n\n**Ren Day:** When the Dao reaches the ninth ten-day period, essence qi fills to abundance, the numinous spirit expands. The timid grow resolute, the weak grow strong. What was diminished is restored; what was impaired is harmonized. Without seeking, it comes of itself; without effort, it finds ease. Radiance and moisture flourish; the voice grows resonant. Sweetness fills the mouth, fragrance the nose. The Jade Pool and Flowery Pond ever abide, unceasing. Such is the work of supreme essence—one may follow the Dao in practice.\n\n**Gui Day:** When the Dao reaches the tenth ten-day period, essence qi arrives in full, the spirit’s path unobstructed. The body grows light and sturdy, flesh and spirit suffused with vitality. The eyes open to all sights, the will and qi soar. Free from desire, the belly and bowels are cleansed. Essence preserved and spirit abiding, virtue and Dao converge in splendor. From the first ingestion of food and drink, one gains enduring longevity. In vigor, one knows not age, dwelling among true immortals. Rising and sinking with the Dao, one attains the numinous.\n\n**The Method of Ingesting Qi:**\nBegin on the day heaven bestows upon humanity—*jiachen* or *geng* days—or on the days when the four seasons are in their prime. Then commence taking the elixir.\n\nAt first, ingest nine full breaths as the measure. Each subsequent day, reduce one meal. By the tenth day, grain is wholly abandoned. All other foods may be set aside at once, for one may live on qi alone.\n\nIn the method of ingesting qi, swallow ten jujubes with ten breaths, using the jujubes as counters to track the amount of qi consumed. When the mouth fills with the Jade Pool’s Flowery Pond, the Sweet Dew and Nectar Spring, saliva flows of itself.\n\nIn the Dao of ingesting qi, qi is the treasure. After one year, the skin and flesh grow full and radiant. After two years, the joints harmonize. After three years, the sinews and bones grow firm and strong. After four years, the marrow fills the bones.\n\nHeaven has four seasons; thus, the ingestion of qi accords with them. After four years, spirit and form commune. When this communion spans years, one becomes as the numinous: unseen in form, unheard in sound, arriving without movement, unknown yet present. This is the unity of form and spirit—such a one is called a *zhenren*. On the same day, one attains long life, sharing the heavens’ numinous power.\n\n**Monthly Ingestion of Qi:**\n- **First month:** Inhale 160 breaths of yang qi at dawn; 200 breaths of yin qi at dusk.\n- **Second month:** Inhale 180 breaths of yang qi at dawn; 180 breaths of yin qi at dusk.\n- **Third month:** Inhale 200 breaths of yang qi at dawn; 160 breaths of yin qi at dusk.\n- **Fourth month:** Inhale 220 breaths of yang qi at dawn; 140 breaths of yin qi at dusk.\n- **Fifth month:** Inhale 240 breaths of yang qi at dawn; 120 breaths of yin qi at dusk.\n- **Sixth month:** Inhale 220 breaths of yang qi at dawn; 140 breaths of yin qi at dusk.\n- **Seventh month:** Inhale 200 breaths of yang qi at dawn; 160 breaths of yin qi at dusk.\n- **Eighth month:** Inhale 180 breaths of yang qi at dawn; 180 breaths of yin qi at dusk.\n- **Ninth month:** Inhale 160 breaths of yang qi at dawn; 200 breaths of yin qi at dusk.\n- **Tenth month:** Inhale 140 breaths of yang qi at dawn; 220 breaths of yin qi at dusk.\n- **Eleventh month:** Inhale 120 breaths of yang qi at dawn; 240 breaths of yin qi at dusk.\n- **Twelfth month:** Inhale 140 breaths of yang qi at dawn; 220 breaths of yin qi at dusk.\n\nYang qi is drawn in through the nose; yin qi is drawn in through the mouth. In these two qi, if one can persist day and night through the twelve months—completing one cycle of heaven and then another—one’s years will match heaven’s. Thus ends the *Instructions for Cultivation to Dispel Delusion* by Lord Mao of the Upper Clarity, Controller of Destinies.",
      "overlap_context": " The arrival of high essence is confirmed as effective.\n\n**Ji Day:** When the Dao reaches the sixth ten-day period, essence qi flows smoothly, upper and lower harmonized. Hair and skin become lustrous, limbs agile. Walking resumes its former ease; ears and eyes grow sharp. The will is serene, fear gone. Bending the body is effortless; joints move freely. Grain is no longer craved; swallowing qi nourishes the embryo. Wine may be drunk, food eaten, in whatever measure desired, without restriction.",
      "start_char": 1313,
      "end_char": 2236,
      "start_sentence": 41,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.14579725265503,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上清司命茅真君修行指迷诀.txt",
        "category": "方法类"
      }
    }
  ]
}