{
  "source_id": "上清丹天三气玉皇六辰飞纲司命大箓",
  "source_file": "chunked_daozang\\上清丹天三气玉皇六辰飞纲司命大箓.json",
  "total_chunks": 2,
  "total_original_chars": 1542,
  "total_translated_chars": 11192,
  "total_translation_time": 54.570706844329834,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\神符类\\上清丹天三气玉皇六辰飞纲司命大箓.txt",
    "category": "神符类"
  },
  "full_translation": "*The Upper Clarity Scripture of the Three Qi of the Cinnabar Heaven, the Jade Emperor’s Six Celestial Stalks, and the Flying Net of the Controller of Destinies*\n\n**Title:** *The Upper Clarity Scripture of the Three Qi of the Cinnabar Heaven, the Jade Emperor’s Six Celestial Stalks, and the Flying Net of the Controller of Destinies*. Author unknown, likely composed between the Tang and Song dynasties. It expounds the method of pacing the Six Stars of the Southern Dipper, accompanied by talismanic diagrams. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, *Section of Divine Talismans* within the *Dongshen* Division.\n\n---\n\nThe Perfected Ones of the Purple Numinosity, resplendent in the Southern Cinnabar, dwell within the crimson chambers of the vaulted heavens. By concentrating the mind on lofty splendor and grasping the cloud-borne tendrils, the radiance of the vermilion essence pervades, and the Southern Dipper shines brilliantly, illuminating the ten thousand heavens. Thereby, the Six Perfected Ones—the Jade Emperor and the Great Dao Lord—are summoned forth. Revolving and ascending the path of the Vermilion Net, they instruct the various Perfected Ones in the arts of opening heaven and sealing earth, calling the sun and drawing the moon, commanding the thousand spirits, and governing the numinous qi that engenders life.\n\nThe Mysterious Writ of the Jade Clarity, when grasped, enables ascent to the celestial stalks. Proclaiming the mandate to the Six Perfected Ones, the Southern Dipper bestows life above, and the Way of life endures forever. One who receives this scripture shall have their name inscribed leaf by leaf among the immortals, capable of sitting in stillness or vanishing at will, treading upon waves or passing through fire, untouched by calamity or misfortune. Practicing its essential Way, they become an immortal king or a divine minister, their form refined and their soul transcended, enduring beyond the kalpas.\n\nInscribed in the Hall of the Cinnabar Heaven’s Phoenix Treasure, they swear oaths with the Upper Perfected Ones. Should they violate the revealed texts or examine the bones and bodies of the dead, they shall enter the Five Paths of Transmigration. The recipient must inscribe the cinnabar script upon a brocade pouch and wear it upon their person, practicing it in accordance with the regulations. Thus, they shall be recorded in the registers of the Eastern Florescence and attend as a guest in the court of the Lord of Dawn.\n\nFor the talismans, use cinnabar on brocade, and red orchid gold. Ascend to the Dark Terrace and pledge sincerity before heaven. Lesser officials and beginning adepts, whose virtue and power remain incomplete, must first be registered in the Yellow Registers of qi-transmission. They shall further swear blood-oaths, cut their hair, maintain perpetual abstinence, refine their essence, and bow their heads to receive transmission.\n\nWhen intending to practice the Way of the Six Celestial Stalks of the Cinnabar Heaven and the method of soaring flight to ascend the stars, first place the *Treading the Void* talisman within both shoes. Thereby, the hundred spirits of the earth—corpses in hiding, impurities, and poisonous essences—will flee far away. Then, the stellar essence descends to earth, and the earth is not defiled by the yellow. The earth gods dissolve their bonds, the ground sinks into emptiness, and the diagram is laid out for ascent. Below, the abyssal depths are penetrated, flowing without obstruction, buoyant without sinking, luminous without darkness. Pacing the stars above, the starlight enters the body, and the body merges with the Dao. The stellar qi is without fixed form, responding to whatever is perceived.\n\nWrite in yellow upon purple paper and place it beneath the feet. All talismans within the scroll, except for the spoken incantations, are to be inscribed in vermilion.\n\nPlace the *Treading the Void, Turning from Earth* talisman beneath the right foot.\nPlace the *Treading the Void, Turning from Earth* talisman beneath the left foot.\n\nWhen aspiring to become a Perfected One, if the bodily vessels are already arrayed but the heart and soul lack refinement, one must visualize the Southern Dipper within the head: one star positioned between the brows, one at the crown, and the remaining stars distributed along the jade pillow and the great vertebra. Day and night, meditate upon them until the stellar rays pierce the spine and the blazing qi arises from the bones, lest the form wither and decay. Further visualize the Six Stars and slowly swallow their essence, thereby ensuring longevity. When lying down, sitting, eating, or bathing, never face south.\n\nAlso, fashion an image of the Six Perfected Lords from cinnabar and suspend it from the left elbow (for women, the right elbow). Invoke blessings or ward off misfortune through it, and when eating or drinking, focus the mind upon it—this is most efficacious.\n\nWhen aspiring to become a Perfected One, one must visualize the Six Stars within the hands, feet, heart, and brain. Over time, the Six Perfected Ones will descend their essence to refine your form, enabling the flight of the spirit to the Jade Clarity. Your form shall resemble that of a Perfected One, clad in brocade and adorned with vermilion stars.\n\nWhen retiring at night, visualize the stars filling the bed-curtains like blazing fire and recite the following invocation:\n*\"Within the cinnabar and dark jade chamber, the light illumines the Gate of Destiny. The Six Perfected Ones of the Supreme Emperor guard the Southern Pavilion. My essence and numinous qi enter and reflect upon the Imperial Terrace. I refine and deliver the nine generations of ancestors, their souls crossing the Vermilion Mound. With purple brush and vermilion script, I open the source of life and the Way. Evil dreams and inauspicious omens are swiftly delivered to the Emperor Lord.\"*\n\n**Talisman of the Crown**\n**Talisman of the Elbow**\n\n**Visualizing the Six Heart-Palaces – Talisman for Sleeping Within the Bed-Curtains**\n\nThe method of studying the Southern Dipper and ascending to the Crimson Capital Tower of Southern Heaven shall be practiced on the sixth day of the sixth month and one’s own birthday, with offerings of fresh and fragrant items. Present what the recipient cherishes most, and upon completing the midday offering, perform the Pace—greatly auspicious.\n\n**Three Qi of the Upper Clarity Crimson Heavens**\n1. First Crimson Heaven: Qi of Liangming\n2. Second Crimson Heaven: Qi of Hongmin\n3. Third Crimson Heaven: Qi of Guangfan\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Most Worthy**\nClad in red embroidered robes, bearing banners. (The banners are red; the same applies hereafter. The jade maidens all wear red embroidered robes, with attire adjusted according to the occasion; the rest follows likewise.)\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Pacing-Soul**\nClad in red embroidered robes, bearing banners.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Treading-Spirit**\nClad in red embroidered robes, bearing axes.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Ascending-Constellation**\nClad in red embroidered robes, bearing jade tablets.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s True Names**\nClad in red embroidered robes, bearing staffs.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Flying Pace**\nClad in red embroidered robes, bearing pennants.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Envoys**\nClad in red embroidered robes, bearing rudders.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Enforcers of Prohibitions**\nClad in red embroidered robes, bearing halberds.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Registrars of Destiny**\nClad in red embroidered robes, bearing wild geese.\n\n**Six Qi of the Southern Dipper**\n1. First of the Southern Dipper: Qi of Hundong Baivei\n2. Second of the Southern Dipper: Qi of Chiyuan Qingwei\n3. Third of the Southern Dipper: Qi of Weihua Jiuyao\n4. Fourth of the Southern Dipper: Qi of Taiwu Gaoshang\n5. Fifth of the Southern Dipper: Qi of Zhizhen Taisu\n6. Sixth of the Southern Dipper: Qi of Gaoshang Yuhuang\n\n**Ministers of the Jade Palace of the Southern Dipper, Later Saints**\nThe Register of the Nine Numinous and Six Perfected of the Golden Watchtower’s Registrar of Destiny and Lord of Longevity\n\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Golden Watchtower’s Registrar of Destiny**\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Midday Registrar of Destiny**\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Midmonth Registrar of Destiny**\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Flying Pace Six Perfected Registrar of Destiny**\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Mysterious Woman Within the Stars**\n\n**Left Contract for Ascending the Southern Dipper and Attaining Longevity**\n\nThe *Mystic Chart of the Golden Watchtower’s Registrar of Destiny, the Most High Jade Emperor of the Upper Clarity and Jade Clarity*, is conferred upon those immortals who pace the Southern Asterism and bear the vermilion lineage. Possessing this scripture, store it separately in a casket and place it before the image of the Southern Dipper; carry it on your person when conducting affairs, or employ it in accordance with your visualized practices. Even without pacing, one who holds this scripture shall attain longevity as an immortal. However, it is not to be transmitted to those of inferior learning.\n\nThe Envoys of the Southern Mound, along with the sixty thousand officers and soldiers of the Three Qi of the Upper Clarity Crimson Heavens, reside within the Zi hour to guard the register and preserve the true. Those without the green bone and the script within the brain shall not hear of it. Obtaining this scripture, one is destined to become a Perfected of the Golden Watchtower; yet it shall not be bestowed upon those who serve the Earthly Offices or covet worldly gains.\n\nWhen transmitting this scripture, the covenant must adhere to the statutes of the Upper Clarity, and the prohibitions must follow the law. Your servant, [Name], of [Age], respectfully presents treasured cloth and approaches the master to request the Great Register of the Crimson Heavens’ Registrar of Destiny, to ascend the Six Stars, rise to the Jade Clarity, and report to the Nine Heavens, enabling the disciple to attain communion with the mysterious and longevity, and to serve for eons as an official of the Registrar of Destiny’s imperial court.\n\n**Here ends the Great Register of the Six Asterisms’ Flying Network, Registrar of Destiny of the Three Qi of the Upper Clarity Crimson Heavens and Jade Emperor.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清丹天三气玉皇六辰飞纲司命大箓 经名：上清丹天三气玉皇六长飞纲司命大箓。 撰人不详，约出於唐宋间。 言飞步南斗六星法术，配以符图。 一卷。 底本出处：《正统道藏》洞神部神符类。 上清丹天三气玉皇六辰飞纲司命大箓 高真紫灵，秀乎南丹，坐穹窿绛阙之房，结想高华，攀维云条，光洞赤精，南斗焕明，炯耀万天，以召六真玉皇大帝道君出，回旋飞登朱纲之道，教诸真人，开天闭地，呼日引月，敕制千灵，司命之真，妙气生灵。 玉清玄书，握之登辰，告命六真，南斗上生，生道永存。 一人授书，叶叶仙名，坐在立亡，履波过火，灾厄不干。 行其要道，为仙王帝卿，形炼魄度，与劫无穷。 刻丹天凤宝之堂，盟诸上真，行尸露文，考骨殃身，入五道门。 受者丹书，锦囊佩之，与身俱行，按规修之，当策名东华，宾侍帝晨。 用丹锦，红兰之金，上升玄台，对天约诚。 下官初真，道德未备，度气黄籍，更当歃血割发，长斋练精，稽颡而传焉。 道欲施行丹天六辰之道，飞腾步星上升之法，先着蹈空之符，安两屦中，地有伏尸秽毒百精，自远逃伏。 然后星精降地，地不污黄，土神解牢，地沦而空，布图以登，下洞渊源，通而不塞，浮而不沈，明而不暗。 步星其上，星光入形，形与道并，星气无常，随所感也。 以黄书紫薄上，以着足下。 卷内符，除声说外，并朱书。 蹈空背土之符，安右足下。 蹈空背土之符，安左足下。 道欲为真，形器已陈，心魂不精，当存南斗在头中，一星安眉间，一星安顶中，余星自玉枕大椎骨布之。 日夜思之，令星芒贯脊膂中，炎炎起骨萎形枯败。 又思六星，徐咽之，令人长生。 卧坐食沐勿南向。 又以丹砂作六真君像，悬左肘，女右肘。 吉凶祝之，饮食临想，大胜。 道欲为真，须思六星在手足中、心中、脑中，久之六真降精，为子练形，飞神玉清。 人形如真人，锦衣赤星。 道欲暮卧，当思星满帐中，如火然，祝曰： 丹玄玉室，光照命门，六真上皇，镇御南轩，我柄妙气，入映帝台，拔炼九祖，朱陵度魂，紫笔赤书，开道生源，恶梦不祥，速付帝君。 顶中符 肘间符",
      "translated_text": "*The Upper Clarity Scripture of the Three Qi of the Cinnabar Heaven, the Jade Emperor’s Six Celestial Stalks, and the Flying Net of the Controller of Destinies*\n\n**Title:** *The Upper Clarity Scripture of the Three Qi of the Cinnabar Heaven, the Jade Emperor’s Six Celestial Stalks, and the Flying Net of the Controller of Destinies*. Author unknown, likely composed between the Tang and Song dynasties. It expounds the method of pacing the Six Stars of the Southern Dipper, accompanied by talismanic diagrams. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, *Section of Divine Talismans* within the *Dongshen* Division.\n\n---\n\nThe Perfected Ones of the Purple Numinosity, resplendent in the Southern Cinnabar, dwell within the crimson chambers of the vaulted heavens. By concentrating the mind on lofty splendor and grasping the cloud-borne tendrils, the radiance of the vermilion essence pervades, and the Southern Dipper shines brilliantly, illuminating the ten thousand heavens. Thereby, the Six Perfected Ones—the Jade Emperor and the Great Dao Lord—are summoned forth. Revolving and ascending the path of the Vermilion Net, they instruct the various Perfected Ones in the arts of opening heaven and sealing earth, calling the sun and drawing the moon, commanding the thousand spirits, and governing the numinous qi that engenders life.\n\nThe Mysterious Writ of the Jade Clarity, when grasped, enables ascent to the celestial stalks. Proclaiming the mandate to the Six Perfected Ones, the Southern Dipper bestows life above, and the Way of life endures forever. One who receives this scripture shall have their name inscribed leaf by leaf among the immortals, capable of sitting in stillness or vanishing at will, treading upon waves or passing through fire, untouched by calamity or misfortune. Practicing its essential Way, they become an immortal king or a divine minister, their form refined and their soul transcended, enduring beyond the kalpas.\n\nInscribed in the Hall of the Cinnabar Heaven’s Phoenix Treasure, they swear oaths with the Upper Perfected Ones. Should they violate the revealed texts or examine the bones and bodies of the dead, they shall enter the Five Paths of Transmigration. The recipient must inscribe the cinnabar script upon a brocade pouch and wear it upon their person, practicing it in accordance with the regulations. Thus, they shall be recorded in the registers of the Eastern Florescence and attend as a guest in the court of the Lord of Dawn.\n\nFor the talismans, use cinnabar on brocade, and red orchid gold. Ascend to the Dark Terrace and pledge sincerity before heaven. Lesser officials and beginning adepts, whose virtue and power remain incomplete, must first be registered in the Yellow Registers of qi-transmission. They shall further swear blood-oaths, cut their hair, maintain perpetual abstinence, refine their essence, and bow their heads to receive transmission.\n\nWhen intending to practice the Way of the Six Celestial Stalks of the Cinnabar Heaven and the method of soaring flight to ascend the stars, first place the *Treading the Void* talisman within both shoes. Thereby, the hundred spirits of the earth—corpses in hiding, impurities, and poisonous essences—will flee far away. Then, the stellar essence descends to earth, and the earth is not defiled by the yellow. The earth gods dissolve their bonds, the ground sinks into emptiness, and the diagram is laid out for ascent. Below, the abyssal depths are penetrated, flowing without obstruction, buoyant without sinking, luminous without darkness. Pacing the stars above, the starlight enters the body, and the body merges with the Dao. The stellar qi is without fixed form, responding to whatever is perceived.\n\nWrite in yellow upon purple paper and place it beneath the feet. All talismans within the scroll, except for the spoken incantations, are to be inscribed in vermilion.\n\nPlace the *Treading the Void, Turning from Earth* talisman beneath the right foot.\nPlace the *Treading the Void, Turning from Earth* talisman beneath the left foot.\n\nWhen aspiring to become a Perfected One, if the bodily vessels are already arrayed but the heart and soul lack refinement, one must visualize the Southern Dipper within the head: one star positioned between the brows, one at the crown, and the remaining stars distributed along the jade pillow and the great vertebra. Day and night, meditate upon them until the stellar rays pierce the spine and the blazing qi arises from the bones, lest the form wither and decay. Further visualize the Six Stars and slowly swallow their essence, thereby ensuring longevity. When lying down, sitting, eating, or bathing, never face south.\n\nAlso, fashion an image of the Six Perfected Lords from cinnabar and suspend it from the left elbow (for women, the right elbow). Invoke blessings or ward off misfortune through it, and when eating or drinking, focus the mind upon it—this is most efficacious.\n\nWhen aspiring to become a Perfected One, one must visualize the Six Stars within the hands, feet, heart, and brain. Over time, the Six Perfected Ones will descend their essence to refine your form, enabling the flight of the spirit to the Jade Clarity. Your form shall resemble that of a Perfected One, clad in brocade and adorned with vermilion stars.\n\nWhen retiring at night, visualize the stars filling the bed-curtains like blazing fire and recite the following invocation:\n*\"Within the cinnabar and dark jade chamber, the light illumines the Gate of Destiny. The Six Perfected Ones of the Supreme Emperor guard the Southern Pavilion. My essence and numinous qi enter and reflect upon the Imperial Terrace. I refine and deliver the nine generations of ancestors, their souls crossing the Vermilion Mound. With purple brush and vermilion script, I open the source of life and the Way. Evil dreams and inauspicious omens are swiftly delivered to the Emperor Lord.\"*\n\n**Talisman of the Crown**\n**Talisman of the Elbow**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 838,
      "start_sentence": 0,
      "end_sentence": 33,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.18592071533203,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\上清丹天三气玉皇六辰飞纲司命大箓.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "存六心府 卧帐中符 道学南斗之法，飞登南天绛都之楼，当以六月六日、本命生日祭之，必新芳。 以人所爱上祭之，以日中祭讫，步之大吉。 上清丹天三气 第一丹天梁明之炁 第二丹天虹敏之炁． 第三丹天光梵之炁． 上清丹天南斗上贤玉女五百人，红绣衣，执幢。 幢红，后同。 玉女并红绣衣，间命取宜装。 余并同。 上清丹天南斗步魂玉女五百人，红绣衣，执幢。 上清丹天南斗履魄玉女五百人，红绣衣，执斧。 上清丹天南斗登辰玉女五百人，红绣衣，执珪。 上清丹天南斗真讳玉女五百人，红绣衣，执节。 上清丹天南斗飞步玉女五百人，红绣衣，执旛。 上清丹天南斗谒者玉女五百人，红绣衣，执柁。 上清丹天南斗司禁玉女五百人，红绣衣，执戟。 上清丹天南斗司命玉女五百人，红绣衣，执雁。 南斗第一混洞白微之气 南斗第二赤元清微之气 南斗第三威华九要之气 南斗第四太无高上之气 南斗第五至真太素之气 南斗第六高上玉皇之气 南斗玉宫后圣之臣，金阙司命长生九灵六真之箓 南斗丹天之符告金阙司命 南斗丹天之符告日中司命 南斗丹天之符告月中司命 南斗丹天之符告飞步六真司命 南斗丹天之符告星中玄女 上升南斗长生左券 上清玉清高上玉皇大帝金阙司命玄图，授诸飞步南辰朱绪之仙人也。 有此书，别致箱，安南斗像前，行事佩之，或取所存行作之。 不步而有此书，长生仙也。 但不授下学之夫尔。 南陵使者，与上清丹天三气吏兵六万人，在子治中，卫箓保真。 其无绿骨文脑，不得闻也。 得此书，应为金阙之真，然不举地官贪世之人。 道欲授书，盟如上清之科，禁如律。 臣某年赍宝布，诣师请丹天司命大箓，飞登六星，上升玉清，告闻九天，使兆通玄长生，亿远司命帝官。 上清丹天三气玉皇六辰飞纲司命大箓竟",
      "translated_text": "**Visualizing the Six Heart-Palaces – Talisman for Sleeping Within the Bed-Curtains**\n\nThe method of studying the Southern Dipper and ascending to the Crimson Capital Tower of Southern Heaven shall be practiced on the sixth day of the sixth month and one’s own birthday, with offerings of fresh and fragrant items. Present what the recipient cherishes most, and upon completing the midday offering, perform the Pace—greatly auspicious.\n\n**Three Qi of the Upper Clarity Crimson Heavens**\n1. First Crimson Heaven: Qi of Liangming\n2. Second Crimson Heaven: Qi of Hongmin\n3. Third Crimson Heaven: Qi of Guangfan\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Most Worthy**\nClad in red embroidered robes, bearing banners. (The banners are red; the same applies hereafter. The jade maidens all wear red embroidered robes, with attire adjusted according to the occasion; the rest follows likewise.)\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Pacing-Soul**\nClad in red embroidered robes, bearing banners.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Treading-Spirit**\nClad in red embroidered robes, bearing axes.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Ascending-Constellation**\nClad in red embroidered robes, bearing jade tablets.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s True Names**\nClad in red embroidered robes, bearing staffs.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Flying Pace**\nClad in red embroidered robes, bearing pennants.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Envoys**\nClad in red embroidered robes, bearing rudders.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Enforcers of Prohibitions**\nClad in red embroidered robes, bearing halberds.\n\n**Five Hundred Jade Maidens of the Upper Clarity Crimson Heavens and the Southern Dipper’s Registrars of Destiny**\nClad in red embroidered robes, bearing wild geese.\n\n**Six Qi of the Southern Dipper**\n1. First of the Southern Dipper: Qi of Hundong Baivei\n2. Second of the Southern Dipper: Qi of Chiyuan Qingwei\n3. Third of the Southern Dipper: Qi of Weihua Jiuyao\n4. Fourth of the Southern Dipper: Qi of Taiwu Gaoshang\n5. Fifth of the Southern Dipper: Qi of Zhizhen Taisu\n6. Sixth of the Southern Dipper: Qi of Gaoshang Yuhuang\n\n**Ministers of the Jade Palace of the Southern Dipper, Later Saints**\nThe Register of the Nine Numinous and Six Perfected of the Golden Watchtower’s Registrar of Destiny and Lord of Longevity\n\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Golden Watchtower’s Registrar of Destiny**\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Midday Registrar of Destiny**\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Midmonth Registrar of Destiny**\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Flying Pace Six Perfected Registrar of Destiny**\n**Talisman of the Crimson Heavens of the Southern Dipper – Petition to the Mysterious Woman Within the Stars**\n\n**Left Contract for Ascending the Southern Dipper and Attaining Longevity**\n\nThe *Mystic Chart of the Golden Watchtower’s Registrar of Destiny, the Most High Jade Emperor of the Upper Clarity and Jade Clarity*, is conferred upon those immortals who pace the Southern Asterism and bear the vermilion lineage. Possessing this scripture, store it separately in a casket and place it before the image of the Southern Dipper; carry it on your person when conducting affairs, or employ it in accordance with your visualized practices. Even without pacing, one who holds this scripture shall attain longevity as an immortal. However, it is not to be transmitted to those of inferior learning.\n\nThe Envoys of the Southern Mound, along with the sixty thousand officers and soldiers of the Three Qi of the Upper Clarity Crimson Heavens, reside within the Zi hour to guard the register and preserve the true. Those without the green bone and the script within the brain shall not hear of it. Obtaining this scripture, one is destined to become a Perfected of the Golden Watchtower; yet it shall not be bestowed upon those who serve the Earthly Offices or covet worldly gains.\n\nWhen transmitting this scripture, the covenant must adhere to the statutes of the Upper Clarity, and the prohibitions must follow the law. Your servant, [Name], of [Age], respectfully presents treasured cloth and approaches the master to request the Great Register of the Crimson Heavens’ Registrar of Destiny, to ascend the Six Stars, rise to the Jade Clarity, and report to the Nine Heavens, enabling the disciple to attain communion with the mysterious and longevity, and to serve for eons as an official of the Registrar of Destiny’s imperial court.\n\n**Here ends the Great Register of the Six Asterisms’ Flying Network, Registrar of Destiny of the Three Qi of the Upper Clarity Crimson Heavens and Jade Emperor.**",
      "overlap_context": "r, the light illumines the Gate of Destiny. The Six Perfected Ones of the Supreme Emperor guard the Southern Pavilion. My essence and numinous qi enter and reflect upon the Imperial Terrace. I refine and deliver the nine generations of ancestors, their souls crossing the Vermilion Mound. With purple brush and vermilion script, I open the source of life and the Way. Evil dreams and inauspicious omens are swiftly delivered to the Emperor Lord.\"*\n\n**Talisman of the Crown**\n**Talisman of the Elbow**",
      "start_char": 838,
      "end_char": 1609,
      "start_sentence": 34,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.384786128997803,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\上清丹天三气玉皇六辰飞纲司命大箓.txt",
        "category": "神符类"
      }
    }
  ]
}