{
  "source_id": "上方大洞真元妙经图",
  "source_file": "chunked_daozang\\上方大洞真元妙经图.json",
  "total_chunks": 4,
  "total_original_chars": 3045,
  "total_translated_chars": 17985,
  "total_translation_time": 91.44422101974487,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元妙经图.txt",
    "category": "灵图类"
  },
  "full_translation": "**The Supreme Cavern’s Wondrous True Origin Scripture Chart**\n\n**Scripture Title:** *The Supreme Cavern’s Wondrous True Origin Scripture Chart*\n**Author:** Unknown (combined with another scripture in the same volume)\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Category of Sacred Charts*\n\n---\n\n**The Supreme Cavern’s Wondrous True Origin Scripture Chart**\n\nIn ancient times, the people of Yao beheld an Immortal Lord and entreated him, saying: \"Yong ventures to inquire—may the Great Cavern’s True Origin be heard?\"\n\nThe Immortal Lord replied: \"You are but a humble man—how could you fathom such matters? Yet I shall recite what I have heard, and you may choose for yourself.\"\n\nHe expounded thus:\n*\"Great\" is akin to the Dao. \"Cavern\" means pervading. The boundless Dao circulates the True One’s primordial yang qi. This qi is inexhaustible, penetrating all things, and thus is the origin of the ten thousand beings. If one can preserve it, the arts of immortality may be mastered.*\n\nThe Immortal Lord continued:\nNow, for Yong’s sake, I shall trust in his sincerity, diligently impart my teachings, and elucidate the essential Dao of all wonders. I shall gather the finest words from the scriptures, expound the teachings of the True Origin, and make them clear to the world. Heaven has bestowed its charts—twelve in number. Let people heed its instruction, that future generations may be awakened.\n\nLike Master Kuang tuning his bells, awaiting a true connoisseur in later times.\n\n**The Chart of the Void and Spontaneity**\nIts beginning has no head, its end no tail; above, it is not constrained, below, it is not obscured. Endless and unnameable, it returns to nothingness—this is called the formless form, the imageless image, the realm of indistinctness. One meets it yet sees not its head; one follows it yet sees not its rear. Holding fast to the ancient Dao, one governs the present being. To know the ancient beginning is called the thread of the Dao.\n\nThat which is said—\"Man models himself on Earth, Earth on Heaven, Heaven on the Dao, and the Dao on spontaneity\"—is none other than the spontaneity of the Void. The scripture states: \"The non-none is called the Dao,\" its meaning profoundly abstruse. It declares that without the Void and spontaneity, man cannot come into being.\n\nThe ode says:\n*Within the Great Void, the body is spontaneity,\nThe Dao gives birth to the One qi, which divides into the ten.*\nThe boundless transformation spans the realm of Heaven and Earth,\nThe Dragon Horse and Tortoise Script convey the true principle.\n\nThese, along with the Heavenly Perfected and August Ones, all inscribe the cloud-seal of the Great Void—how can they be spoken of in the same breath?\n\n**The Chart of the Dao’s Indistinct Wonder**\nThe Dao is a numinous and wondrous thing: void yet sentient, spirit-like yet formless. It eludes pursuit whether one seeks or follows; its hiddenness and manifestation cannot be fathomed. One knows not why it is so, nor why it is not so. It endlessly generates life, and thus is called the Dao.\n\nThe Master of the Valley said: \"I would cease speaking, to behold the Dao’s subtlety.\"\nLaozi said: \"As a thing, the Dao is indistinct, evanescent. Evanescent! Indistinct! Yet within it are images. Indistinct! Evanescent! Yet within it are things. Dark! Obscure! Yet within it is essence. Its essence is most true; within it is sincerity. From ancient times to the present, its name does not depart, that it may survey the beginning of all things.\"\n\nFor all things under Heaven are born of being, and being is born of non-being. Is it the indistinct \"having\" or the evanescent \"non-having\"? To survey is to examine; the beginning is the origin. It speaks of qi emerging from non-being, initiating the transformation of the myriad beings. Among all beings, man is the most noble. If one can cultivate the Dao, one may endure long. Thus, the wonder of the Dao is where the sage holds it in reverence. Hence, the Yellow Emperor crawled on his knees to follow the wind, and Confucius, having heard the Dao at dawn, could die that evening. Herein lies the essence of the indistinct and evanescent.\n\nIn former times, the Perfected Lord cultivated the Dao on Mount Wudang for forty-two years before ascending to the Purple Empyrean, ranked among the immortals and sages. Was it not through the tortoise and serpent swallowing black tin, Heaven and Earth nurturing cinnabar? Meng the Banished Immortal said: \"To bind mercury and congeal lead is to attain immortality.\" Yet people are mired in depravity and fail to grasp the essentials. Seeking celestial immortality while neglecting the Golden Elixir—how can one achieve the wondrous union of form and spirit? Only when form and spirit are both wondrous is the true and mysterious power concealed within.\n\nThus, when the Dao is about to be practiced, diligence is precious. Who does not say: \"Neither near nor far, majestic and resplendent, one ascends the jade hall\"? The *Book of Changes* states: \"Treading the Dao’s level path, the reclusive man’s steadfastness is auspicious.\" Does this not speak of this very truth?\n\n**The Chart of the Supreme Ultimate and Prior Heaven**\nThere is the spirit of the Great Simplicity, the qi of the Great Beginning, the essence of the Great Inception, the form of the Great Simplicity, and the Dao of the Supreme Ultimate. It has no past, no present, no beginning, no end.\n\nThus, the *Book of Changes* says: \"In the *Changes* there is the Supreme Ultimate, which generates the Two Modes. The Two Modes generate the Four Images, the Four Images generate the Eight Trigrams. The Eight Trigrams determine good fortune and misfortune; good fortune and misfortune give rise to great undertakings.\" It speaks of all things possessing the Supreme Ultimate and the Two Modes, the images of the Four Images. When the Four Images and Eight Trigrams are complete yet unmoving, this is called the Supreme Ultimate. The Supreme Ultimate is the great root of Heaven and Earth.\n\nHeaven and Earth divide the Supreme Ultimate; the myriad things divide Heaven and Earth. Man draws from the midst of Heaven and Earth’s true and primordial qi to be born, grow, mature, and nurtured. Observing man, one sees the embodiment of Heaven and Earth. Therefore, the master says: \"When qi reaches its extreme, it transforms; having transformed, it flows freely.\" Is not this flow the Dao? The reversal of the corpse is the movement of the Dao.\n\nThere is a thing formed in chaos, born before Heaven and Earth. Silent! Vast! It stands alone and does not change; it circulates without cease and may be called the Mother of all under Heaven. This Mother is the Dao—how supreme! The greatness of the Dao cannot be surpassed. The Dao has clarity and turbidity, movement and stillness. When one practices the Dao, one gives birth to spirit. If one abandons the great method, one falls into faithlessness.\n\n**The Chart of the Three Modes in Obscure Possession**\nThe first and second yang lines of Qian are called the mode of Kun’s origin, the great transformation where qi congeals and sediment accumulates to form Earth. The third and fourth yang lines are called the mode of man’s origin, the great transformation where the Three Origins nurture spirit, the Nine Qi bind form, yellow and white like a chicken’s egg, Qian and Kun sharing the same pattern. The fifth and upper yang lines are called the mode of Qian’s origin, the great transformation where qi is clear, lofty, and limpid, accumulating yang to form Heaven.\n\nIt speaks of Heaven enveloping Earth, Earth residing within Heaven. That on which Earth relies is the great qi that propels it. The great qi is the movement of time. Though Heaven and Earth are vast, they are still within the transformation of the Dao. The harmonious and primordial qi, through numinous change, becomes man, thus completing the Three Powers. It speaks of the obscure possession of man and things, originating from Qian and Kun. Thus, the sages of old established it, matching the records of the Great Void, benefiting the people in all things.\n\nIf one’s virtue harmonizes with the Two Modes, and one follows this path, is it not excellent? Alas, those who stray—do they not reflect?\n\n**The Chart of Qi’s Movement**\nHow wondrous! Before the primordial chaos was divided, the One Qi concealed the Two Modes. After the Supreme Ultimate was separated, the Three Powers manifested, unfolding the myriad beings. The bodies of man and things are all complete; the sources of their qi and destiny are all continuous. The Brahma qi pervades all, and the ten thousand patterns unfold.\n\nThe Brahma qi is the great and pervasive Brahma qi.\n\n**Of the All-Encompassing**\n\n\"All-encompassing\" signifies the inclusion of the ten thousand existents. Of old, from the Primordial Beginning, the true essence of the Great Brahma was exalted, and the Record of the Crimson Clarity was opened. Heaven and Earth are the above and below of the myriad things; left and right are the pathways of yin and yang. Thus, generation and nurturance are inexhaustible, the array of all beginnings unfolds, and the safety or peril of the moving and the still all proceed from the movement of qi. Even for those who cultivate the Way, can they defy this?\n\nIt is said that the nine orifices and four limbs all communicate with the qi of Heaven. Moreover, the yin and yang of the hands and feet each possess their threefold divisions. The wondrous method is fully recorded in *The Yellow Emperor’s Inner Canon: \"Comprehensive Discourse on Regulating the Spirit in Accordance with the Qi of the Four Seasons\"*, instructing the people on the proper use of medicines and foods—most essential to the Way. Thus, the Classic states: \"Eat in accordance with the seasons, and the hundred bones will be ordered.\" The seasons remain ever thus, and this is indeed the foundation of health and peace.\n\nEach year, the Five Movements and Six Qi govern, with the *Controller of Heaven* and *Controller of Earth*, the *Left Intercalary* and *Right Intercalary*. Beginning from the *jiazi* day before or after Great Cold, the first step of qi is exchanged: the wind of *Jueyin* Wood, which transforms during the *si* and *hai* years as *Controller of Heaven*, the *yin* and *shen* years as *Controller of Earth*, and the *zi*, *wu*, *mao*, *you*, *chen*, *xu*, *chou*, and *wei* years as *Intercalary Qi*. This qi resides in the left bar of the human pulse, as well as in the liver and gallbladder. The liver and gallbladder generate anger, and anger harms the Three Hun. Therefore, the lofty Daoist awakens from the great dream of floating life and refines the yang spirit to endure.\n\nAt the Spring Equinox, the second step of qi is exchanged: the heat of *Shaoyin* Sovereign Fire, which transforms during the *zi* and *wu* years as *Controller of Heaven*, the *mao* and *you* years as *Controller of Earth*, and the *chen*, *xu*, *chou*, *wei*, *yin*, *shen*, *si*, and *hai* years as *Intercalary Qi*. This qi resides in the left inch of the human pulse, as well as in the heart and small intestine. The exterior and interior generate joy, and joy harms the spirit. Only the superior person remains unstained by form, directly beholding the Dao in non-arising.\n\nBy Grain in Ear, the third step of qi is exchanged: the dampness of *Taiyin* Earth (or *Taiyin* Sovereign Origin), which transforms during the *chou* and *wei* years as *Controller of Heaven*, the *chen* and *xu* years as *Controller of Earth*, and the *yin*, *shen*, *si*, *hai*, *zi*, *wu*, *mao*, and *you* years as *Intercalary Qi*. From the first to the third step of qi, Heaven’s qi governs. Some say the blazing of *Shaoyang* Ministerial Fire transforms the qi in the right foot of the human pulse and the Gate of Destiny, as well as in the Triple Burner. The Three generate fear, and fear harms the blood and qi. Those of insight awaken to the naturalness of gathering and dispersal, departing from the forms of things to abide in non-action.\n\nBy Great Heat, the fourth step of qi is exchanged: the dampness of *Shaoyang* Sovereign Origin (or *Taiyin* Earth), which transforms during the *yin* and *shen* years as *Controller of Heaven*, the *si* and *hai* years as *Controller of Earth*, and the *zi*, *wu*, *mao*, *you*, *chen*, *xu*, *chou*, and *wei* years as *Intercalary Qi*. This qi resides in the right bar of the human pulse, as well as in the spleen and stomach. The Three generate thought, and thought harms the body. The resolute immortal perceives sounds and sights as illusory flowers, extinguishing desire to augment wisdom.\n\nAt the Autumn Equinox, the fifth step of qi is exchanged: the dryness of *Yangming* Metal, which transforms during the *mao* and *you* years as *Controller of Heaven*, the *zi* and *wu* years as *Controller of Earth*, and the *chen*, *xu*, *chou*, *wei*, *yin*, *shen*, *si*, and *hai* years as *Intercalary Qi*. This qi resides in the right inch of the human pulse, as well as in the lungs and large intestine. The Three generate sorrow, and sorrow harms the Seven Po. The true person observes worldly affairs as all empty, ever abiding in luminous clarity.\n\nBy Light Snow, the final step of qi is exchanged: the cold of *Taiyang* Water, which transforms during the *chen* and *xu* years as *Controller of Heaven*, the *chou* and *wei* years as *Controller of Earth*, and the *yin*, *shen*, *si*, *hai*, *zi*, *wu*, *mao*, and *you* years as *Intercalary Qi*. This qi resides in the left foot of the human pulse, as well as in the kidneys and bladder. Here, the Three generate terror, and terror harms essence. Only the perfected person accumulates the ten thousand practices in the human realm and records the thousand virtues in Heaven. From the fourth to the final step of qi, Earth’s qi governs.\n\nEach step of qi is exchanged every sixty days. The reckoning of years and days follows the same great principle. Thus, the Dao accords with the Great Cavern, and virtue matches the true source. Profound indeed is the Cavern Real! It unites the spirits of vast generation and transforms the sequence of mighty change. By its categories, forms are received in their time. Moreover, the hundred bones of man are bounded, while the One Qi of the profound is without interruption. Those who advance in the Dao summon the uninterrupted qi to supplement the bounded form. Thus, form is the guest of qi, and qi is the master of form. When form and qi preserve one another, the manifold excellences nourish life.\n\nThere is nothing in the world not prized more than the Dao. Those who follow the transformations of the Dao endure; those who oppose the movement of qi perish. They sigh as the sun and moon hasten onward. If one does not say: \"Is there a time for words? The time does not come again.\" Thus, they regard wealth and honor as dust, contemplate life and death with equanimity, and restrain the mind of man.\n\nThe Dao bestows appearance, Heaven bestows qi, and Earth bestows form. The single cavity of the spirit gate is called the *Celestial Center*. Above the *Celestial Center*, Heaven’s qi governs; below it, Earth’s qi governs. At the division of qi’s intersection, human qi follows. The transmission speaks of the Six Qi: yin, yang, wind, rain, darkness, and brightness. They are divided into the four seasons and ordered as the nodes of the Five Phases.\n\nThe Three Yin signify emptiness; the Three Yang, fullness. Wind is *xun*; rain is *kan*. Darkness is the rest of yin; brightness, the waning of yang. As the almanac states: Each year, the qi of the celestial revolution totals twenty-four. From *Beginning of Spring*, *Awakening of Insects*, and *Pure Brightness* are the seasonal nodes of spring; within them, *Rain Water*, *Spring Equinox*, and *Grain Rain* are the mid-season qi of spring. Next, *Beginning of Summer*, *Grain in Ear*, and *Lesser Heat* are the seasonal nodes of summer; within them, *Lesser Fullness*, *Summer Solstice*, and *Greater Heat* are the mid-season qi of summer. Then, *Beginning of Autumn*, *White Dew*, and *Cold Dew* are the seasonal nodes of autumn; within them, *End of Heat*, *Autumn Equinox*, and *Frost’s Descent* are the mid-season qi of autumn. Finally, *Beginning of Winter*, *Greater Snow*, and *Lesser Cold* are the seasonal nodes of winter; within them, *Lesser Snow*, *Winter Solstice*, and *Greater Cold* are the mid-season qi of winter.\n\nThe earth phase governs the ends of the four seasons, each presiding for eighteen days. The aforementioned qi collectively govern the governance of the four seasons and the five phases. Moreover, the waxing and waning of qi are discerned only by the lofty scholar. To earnestly instruct others in this is to prolong life; to recklessly defy it is to invite calamity. One ought to distance oneself from extremes of cold, heat, warmth, and chill, and earnestly align with the Dao of Heaven to nurture the primordial qi. For this primordial qi is difficult to accumulate yet easy to dissipate—its secret lies within the *Discourse on Regulating the Spirit in Accordance with the Four Qi*.\n\nThus, the sage harmonizes with the movements of qi, as though transcending human emotions to attain longevity. Therefore, the superior scholar integrates and comprehends this principle in the same manner. As the *Rites* states: \"The emotions of humans—joy, anger, sorrow, fear, love, aversion, and desire—these seven arise without being learned.\" Yet if one follows them, one remains ordinary; if one masters them, one becomes sagely.\n\nShould one diligently cultivate the *Great Cavern of Primordial Perfection*, all emotions must be wholly eradicated, for they gnaw at the roots of yin and yang. Thus, one approaches the Dao, transcends the realm of generation and transformation, and ascends to the boundless realm of freedom. Supreme joy is serene and radiant—how could this be neglected?\n\nHere ends the *Illustrated Scripture of the Wondrous Primordial Perfection of the Great Cavern*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上方大洞真元妙经图 经名：上方大洞真元妙经图。 撰人不祥心二经同卷。 底本出处：《正统道藏》洞玄部灵图类。 上方大洞真元妙经图 昔时尧民见仙君而请问焉，曰：雍也敢告，大洞真元，可得闻乎。 仙君对曰：汝鄙夫也，何足以问诸。 然请诵其所闻，而吾子自择焉。 策言：大犹道也。 洞者，通也。 茫茫大道，运真一元阳之气。 其气无穷，无所不通，故为万物之宗。 人能守之； 则神仙可学矣。 仙君可。 复传：今．吾为雍也，特从其信，当· 肆其训，拟明众妙之要道，可萃诸经之善言，言真元之教，明于天下。 天垂其图，十有二焉。 人务其诲，警于来者。",
      "translated_text": "**The Supreme Cavern’s Wondrous True Origin Scripture Chart**\n\n**Scripture Title:** *The Supreme Cavern’s Wondrous True Origin Scripture Chart*\n**Author:** Unknown (combined with another scripture in the same volume)\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Category of Sacred Charts*\n\n---\n\n**The Supreme Cavern’s Wondrous True Origin Scripture Chart**\n\nIn ancient times, the people of Yao beheld an Immortal Lord and entreated him, saying: \"Yong ventures to inquire—may the Great Cavern’s True Origin be heard?\"\n\nThe Immortal Lord replied: \"You are but a humble man—how could you fathom such matters? Yet I shall recite what I have heard, and you may choose for yourself.\"\n\nHe expounded thus:\n*\"Great\" is akin to the Dao. \"Cavern\" means pervading. The boundless Dao circulates the True One’s primordial yang qi. This qi is inexhaustible, penetrating all things, and thus is the origin of the ten thousand beings. If one can preserve it, the arts of immortality may be mastered.*\n\nThe Immortal Lord continued:\nNow, for Yong’s sake, I shall trust in his sincerity, diligently impart my teachings, and elucidate the essential Dao of all wonders. I shall gather the finest words from the scriptures, expound the teachings of the True Origin, and make them clear to the world. Heaven has bestowed its charts—twelve in number. Let people heed its instruction, that future generations may be awakened.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 256,
      "start_sentence": 0,
      "end_sentence": 17,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.388741493225098,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元妙经图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "犹师旷之调锺，俟知音之在后。 虚无自然之图 其始无首，其终无尾，其上不缴，其下不昧，绳绳兮不可名，复归於无物，是谓无状之状，无物之象，是谓惚恍。 迎之不见其首，随之不见其后，执古之道，以御今之有。 能知古始，是谓道纪。 所谓人法地，地法天，天法道，道夫自然者，乃虚无之自然欤。 经云：无无曰道，义极玄玄。 言人非虚无自然，则弗能生也。 颂曰： 太虚无中体自然，道生一气介十焉。 罔极大化乾坤域，龙马龟书正理传。 兹者与夫天真皇人，皆署太虚云篆，诅可同日而语哉。 道妙惚恍之图 夫道也者，神异之物，虚而有情，灵而无象，随迎莫测，隐显莫求，不知所以然，亦不知所以不然，通生无匮，因谓之道。 山谷云：吾欲亡言，观道微妙。 老君曰：道之为物，惟恍惟惚，惚兮恍兮，中有象焉； 恍兮惚兮，中有物焉。 窈兮冥兮，其中有精，其精甚真，其中有信。 自古及今，其名不去，以阅众甫。 盖其天下之物，皆生於有，有生於无。 恍有耶一惚无耶。 阅察也，甫始也。 言无中察气，始化众有，众有之间，惟人为贵，若能修道，可以长久。 是知道妙所在，圣人尊之。 故轩后膝行以顺风，孔父朝闻而夕死。 其惚恍之旨，於斯见矣。 昔者，真君在武当山中进道，凡四十有二年，方升紫霄，位列仙圣。 非乎龟蛇吞黑锡，天地养丹砂。 孟谪仙云：结汞凝铅，能之者仙。 但人皆柢溺於邪，莫达其要，欲求天仙，而姑舍乎金丹，何以致形神俱妙。 若人形神俱妙者，盖真元秘诸。 故道之将行也欤，贵勤矣。 夫孰不云乎，匪迩匪迂，裔裔皇皇，登于瑶堂。 《易》曰：履道坦坦，幽人贞吉，其斯之谓欤。 太极先天之图 粤有太易之神，太始之气，太初之精，太素之形，太极之道。 无古无今，无始无终也。 故易有太极，是生两仪，两仪生四象，四象生八卦，八卦定吉凶，吉凶生大业。 言万物皆有太极两仪，四象之象，四象八卦具而未动，谓之太极。 太极也者，天地之大本耶。 天地分太极，万物分天地。 人资天地真元一气之中，以生成长养。 观乎人，则天地之体见矣。 是故师言：气极则变，既变则通，通犹道耶，尸反者道之动。 盖有物混成，先天地生，寂兮寥兮，独立而不改，周行而不殆，可以为天下母。 母者，道耶，至矣哉。 道之大也，无以尚之。 夫道者，有清有浊，有动有静。 但凡其人行道也欤，则生神矣。 夫或躬废大方，则届于其亡信哉。 三仪冥有之图 乾之初九、九二，则曰坤元之仪，大化也者，气结凝滓，积滞成地。 九三、九四，则日人元之仪，大化也者，三元毓神，九气结形，黄白如鸡子，乾坤同法象。 九五、上九，则曰乾元之仪，大化也者，气清高澄，积阳成天。 言天包地外，地处天中。 且地之所以凭者，为大气鼓之者也。 大气者，时运也。 然天地为巨，犹在道化，冲和元气，神变为人，乃成三才。 言人物冥有，从乾坤中来。 故前圣制之，配太无之纪，利民悉备矣。 若夫其人，德合两仪，由斯迪者，不亦嘉乎。 嗟彼于迂，岂弗尔思。 气运之图 神哉。 混元未判，总一气而隐两仪。 太极既分，显三才而张庶品。 人物之体皆备，气数之源咸绍。 其梵气弥罗，万范开张。 言梵气者，乃大行梵气也。",
      "translated_text": "Like Master Kuang tuning his bells, awaiting a true connoisseur in later times.\n\n**The Chart of the Void and Spontaneity**\nIts beginning has no head, its end no tail; above, it is not constrained, below, it is not obscured. Endless and unnameable, it returns to nothingness—this is called the formless form, the imageless image, the realm of indistinctness. One meets it yet sees not its head; one follows it yet sees not its rear. Holding fast to the ancient Dao, one governs the present being. To know the ancient beginning is called the thread of the Dao.\n\nThat which is said—\"Man models himself on Earth, Earth on Heaven, Heaven on the Dao, and the Dao on spontaneity\"—is none other than the spontaneity of the Void. The scripture states: \"The non-none is called the Dao,\" its meaning profoundly abstruse. It declares that without the Void and spontaneity, man cannot come into being.\n\nThe ode says:\n*Within the Great Void, the body is spontaneity,\nThe Dao gives birth to the One qi, which divides into the ten.*\nThe boundless transformation spans the realm of Heaven and Earth,\nThe Dragon Horse and Tortoise Script convey the true principle.\n\nThese, along with the Heavenly Perfected and August Ones, all inscribe the cloud-seal of the Great Void—how can they be spoken of in the same breath?\n\n**The Chart of the Dao’s Indistinct Wonder**\nThe Dao is a numinous and wondrous thing: void yet sentient, spirit-like yet formless. It eludes pursuit whether one seeks or follows; its hiddenness and manifestation cannot be fathomed. One knows not why it is so, nor why it is not so. It endlessly generates life, and thus is called the Dao.\n\nThe Master of the Valley said: \"I would cease speaking, to behold the Dao’s subtlety.\"\nLaozi said: \"As a thing, the Dao is indistinct, evanescent. Evanescent! Indistinct! Yet within it are images. Indistinct! Evanescent! Yet within it are things. Dark! Obscure! Yet within it is essence. Its essence is most true; within it is sincerity. From ancient times to the present, its name does not depart, that it may survey the beginning of all things.\"\n\nFor all things under Heaven are born of being, and being is born of non-being. Is it the indistinct \"having\" or the evanescent \"non-having\"? To survey is to examine; the beginning is the origin. It speaks of qi emerging from non-being, initiating the transformation of the myriad beings. Among all beings, man is the most noble. If one can cultivate the Dao, one may endure long. Thus, the wonder of the Dao is where the sage holds it in reverence. Hence, the Yellow Emperor crawled on his knees to follow the wind, and Confucius, having heard the Dao at dawn, could die that evening. Herein lies the essence of the indistinct and evanescent.\n\nIn former times, the Perfected Lord cultivated the Dao on Mount Wudang for forty-two years before ascending to the Purple Empyrean, ranked among the immortals and sages. Was it not through the tortoise and serpent swallowing black tin, Heaven and Earth nurturing cinnabar? Meng the Banished Immortal said: \"To bind mercury and congeal lead is to attain immortality.\" Yet people are mired in depravity and fail to grasp the essentials. Seeking celestial immortality while neglecting the Golden Elixir—how can one achieve the wondrous union of form and spirit? Only when form and spirit are both wondrous is the true and mysterious power concealed within.\n\nThus, when the Dao is about to be practiced, diligence is precious. Who does not say: \"Neither near nor far, majestic and resplendent, one ascends the jade hall\"? The *Book of Changes* states: \"Treading the Dao’s level path, the reclusive man’s steadfastness is auspicious.\" Does this not speak of this very truth?\n\n**The Chart of the Supreme Ultimate and Prior Heaven**\nThere is the spirit of the Great Simplicity, the qi of the Great Beginning, the essence of the Great Inception, the form of the Great Simplicity, and the Dao of the Supreme Ultimate. It has no past, no present, no beginning, no end.\n\nThus, the *Book of Changes* says: \"In the *Changes* there is the Supreme Ultimate, which generates the Two Modes. The Two Modes generate the Four Images, the Four Images generate the Eight Trigrams. The Eight Trigrams determine good fortune and misfortune; good fortune and misfortune give rise to great undertakings.\" It speaks of all things possessing the Supreme Ultimate and the Two Modes, the images of the Four Images. When the Four Images and Eight Trigrams are complete yet unmoving, this is called the Supreme Ultimate. The Supreme Ultimate is the great root of Heaven and Earth.\n\nHeaven and Earth divide the Supreme Ultimate; the myriad things divide Heaven and Earth. Man draws from the midst of Heaven and Earth’s true and primordial qi to be born, grow, mature, and nurtured. Observing man, one sees the embodiment of Heaven and Earth. Therefore, the master says: \"When qi reaches its extreme, it transforms; having transformed, it flows freely.\" Is not this flow the Dao? The reversal of the corpse is the movement of the Dao.\n\nThere is a thing formed in chaos, born before Heaven and Earth. Silent! Vast! It stands alone and does not change; it circulates without cease and may be called the Mother of all under Heaven. This Mother is the Dao—how supreme! The greatness of the Dao cannot be surpassed. The Dao has clarity and turbidity, movement and stillness. When one practices the Dao, one gives birth to spirit. If one abandons the great method, one falls into faithlessness.\n\n**The Chart of the Three Modes in Obscure Possession**\nThe first and second yang lines of Qian are called the mode of Kun’s origin, the great transformation where qi congeals and sediment accumulates to form Earth. The third and fourth yang lines are called the mode of man’s origin, the great transformation where the Three Origins nurture spirit, the Nine Qi bind form, yellow and white like a chicken’s egg, Qian and Kun sharing the same pattern. The fifth and upper yang lines are called the mode of Qian’s origin, the great transformation where qi is clear, lofty, and limpid, accumulating yang to form Heaven.\n\nIt speaks of Heaven enveloping Earth, Earth residing within Heaven. That on which Earth relies is the great qi that propels it. The great qi is the movement of time. Though Heaven and Earth are vast, they are still within the transformation of the Dao. The harmonious and primordial qi, through numinous change, becomes man, thus completing the Three Powers. It speaks of the obscure possession of man and things, originating from Qian and Kun. Thus, the sages of old established it, matching the records of the Great Void, benefiting the people in all things.\n\nIf one’s virtue harmonizes with the Two Modes, and one follows this path, is it not excellent? Alas, those who stray—do they not reflect?\n\n**The Chart of Qi’s Movement**\nHow wondrous! Before the primordial chaos was divided, the One Qi concealed the Two Modes. After the Supreme Ultimate was separated, the Three Powers manifested, unfolding the myriad beings. The bodies of man and things are all complete; the sources of their qi and destiny are all continuous. The Brahma qi pervades all, and the ten thousand patterns unfold.\n\nThe Brahma qi is the great and pervasive Brahma qi.",
      "overlap_context": "n thousand beings. If one can preserve it, the arts of immortality may be mastered.*\n\nThe Immortal Lord continued:\nNow, for Yong’s sake, I shall trust in his sincerity, diligently impart my teachings, and elucidate the essential Dao of all wonders. I shall gather the finest words from the scriptures, expound the teachings of the True Origin, and make them clear to the world. Heaven has bestowed its charts—twelve in number. Let people heed its instruction, that future generations may be awakened.",
      "start_char": 256,
      "end_char": 1505,
      "start_sentence": 18,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.8895959854126,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元妙经图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "弥罗者，为包罗万有也。 昔自元始，抗大梵之真，开赤明之纪。 惟天地者，万物之上下也； 左右者，阴阳之道路也。 故生育无穷，布陈兆汇，动植安危，悉由气运。 虽修行人，可能违乎？ 言九窍四肢，皆通于天气。 且手足之阴阳，各有其三焉。 妙法具载《黄帝素问·正纪大论篇》中，示民药食所宜，最为要道。 故经云：食其时，百骸理。 时犹是也，兹固康宁之基矣。 每岁五运，六气所主，司天在泉，左间右间。 肇从大寒前后甲子日，交初步之气，厥阴木之风，化於巳亥二年司天，寅申二年在泉，子午卯酉辰戌丑未八年，为间气。 气在人之左关，及肝与胆，肝胆生怒，怒伤三魂。 是故高道省浮生之大梦，炼阳神以长存。 又於春分，交二步之气，少阴君火热，化於子午二年司天，卯酉二年在泉，辰戌丑未寅申巳亥八年，为间气。 气在人之左寸，及心与小肠，表裹生喜，喜则伤神。 惟上士也，不染着於有相。 即观道於无生。 至小满交三步之气，太阴君本太阴，於丑未二年司天，辰戌二年在泉，寅申巳亥子午卯酉八年，为问气。 自初气终三气，天气主之。 或云少阳相火之炎，化气在人之右尺及命门，与三焦者，三生畏，畏伤血气。 其明达者，觉聚散之自然，离物相以无为。 至大暑，交四步之气，少阳君本少阳，於寅申二年司天，巳亥二年在泉，子午卯酉辰戌丑未八年，为问气。 或云太阴土之湿，化气在人之右关，及脾与胃，而三生思，思伤身体。 有烈仙者，悟见闻以象空华，亡爱欲而增智慧。 至秋分，交五步之气，阳明金之燥，化於卯酉二年司天，子午二年在泉，辰戌丑未寅申巳亥八年，为间气。 气在人之右寸，及肺与大肠，其三生忧，忧伤七魄。 有真人者，观世事以皆空，可恒时而明照。 至小雪，交终之气，太阳水之寒，化於辰戌二年司天，丑未二年在泉，寅申巳亥子午卯酉八年，为间气。 其气在人之左尺，及肾与膀胱，兹者生恐，恐则伤精。 独至人也，积万行於人间，纪千善於天上。 自四气尽终气，地气主之。 但凡一气，皆六十日交之。 其年与日，大理同推。 故道符大洞，德配真源。 玄矣哉，洞真乎。 统广生之神，变巨化之序。 以其丑类，当时受形。 且人之百骸，则有涯者也。 玄之一气，而无间然矣。 诸进道者，召无间之气，补有涯之形。 故形作气之宾，气为形之主。 形气相保，斓善资生。 盖天下莫不贵者，道也。 爰因顺道化者，存逆气运者，亡叹日月逾迈。 若弗云：来有言时乎，时不再娠。 遂尘视富贵，寝观生死，克念人也。 道与之貌，天与之气，地与之形。 形之神阙一穴，名日天中。 天中之上，天气主之。 天中之下，地气主之。 气交之分，人气从之。 传称六气，阴阳风雨晦明也。 分为四时，序为五行之节。 言三阴，虚也，三阳，盈也。 风，巽也，雨，坎也。 晦，阴息也，明，阳消也。 如历书云：每岁周天之气，凡二十有四焉。 自立春、惊垫、清明，春之节气。 内雨水、春分、谷雨，春之中气。 次立夏、芒种、小暑，夏之节气。 内小满、夏至、大暑，夏之中气。 又立秋、白露、寒露，秋之节气。 内处暑、秋分、霜降，秋之中气。 终立冬、大雪、小寒，冬之节气。 内小雪、冬至、大寒，冬之中气。",
      "translated_text": "**Of the All-Encompassing**\n\n\"All-encompassing\" signifies the inclusion of the ten thousand existents. Of old, from the Primordial Beginning, the true essence of the Great Brahma was exalted, and the Record of the Crimson Clarity was opened. Heaven and Earth are the above and below of the myriad things; left and right are the pathways of yin and yang. Thus, generation and nurturance are inexhaustible, the array of all beginnings unfolds, and the safety or peril of the moving and the still all proceed from the movement of qi. Even for those who cultivate the Way, can they defy this?\n\nIt is said that the nine orifices and four limbs all communicate with the qi of Heaven. Moreover, the yin and yang of the hands and feet each possess their threefold divisions. The wondrous method is fully recorded in *The Yellow Emperor’s Inner Canon: \"Comprehensive Discourse on Regulating the Spirit in Accordance with the Qi of the Four Seasons\"*, instructing the people on the proper use of medicines and foods—most essential to the Way. Thus, the Classic states: \"Eat in accordance with the seasons, and the hundred bones will be ordered.\" The seasons remain ever thus, and this is indeed the foundation of health and peace.\n\nEach year, the Five Movements and Six Qi govern, with the *Controller of Heaven* and *Controller of Earth*, the *Left Intercalary* and *Right Intercalary*. Beginning from the *jiazi* day before or after Great Cold, the first step of qi is exchanged: the wind of *Jueyin* Wood, which transforms during the *si* and *hai* years as *Controller of Heaven*, the *yin* and *shen* years as *Controller of Earth*, and the *zi*, *wu*, *mao*, *you*, *chen*, *xu*, *chou*, and *wei* years as *Intercalary Qi*. This qi resides in the left bar of the human pulse, as well as in the liver and gallbladder. The liver and gallbladder generate anger, and anger harms the Three Hun. Therefore, the lofty Daoist awakens from the great dream of floating life and refines the yang spirit to endure.\n\nAt the Spring Equinox, the second step of qi is exchanged: the heat of *Shaoyin* Sovereign Fire, which transforms during the *zi* and *wu* years as *Controller of Heaven*, the *mao* and *you* years as *Controller of Earth*, and the *chen*, *xu*, *chou*, *wei*, *yin*, *shen*, *si*, and *hai* years as *Intercalary Qi*. This qi resides in the left inch of the human pulse, as well as in the heart and small intestine. The exterior and interior generate joy, and joy harms the spirit. Only the superior person remains unstained by form, directly beholding the Dao in non-arising.\n\nBy Grain in Ear, the third step of qi is exchanged: the dampness of *Taiyin* Earth (or *Taiyin* Sovereign Origin), which transforms during the *chou* and *wei* years as *Controller of Heaven*, the *chen* and *xu* years as *Controller of Earth*, and the *yin*, *shen*, *si*, *hai*, *zi*, *wu*, *mao*, and *you* years as *Intercalary Qi*. From the first to the third step of qi, Heaven’s qi governs. Some say the blazing of *Shaoyang* Ministerial Fire transforms the qi in the right foot of the human pulse and the Gate of Destiny, as well as in the Triple Burner. The Three generate fear, and fear harms the blood and qi. Those of insight awaken to the naturalness of gathering and dispersal, departing from the forms of things to abide in non-action.\n\nBy Great Heat, the fourth step of qi is exchanged: the dampness of *Shaoyang* Sovereign Origin (or *Taiyin* Earth), which transforms during the *yin* and *shen* years as *Controller of Heaven*, the *si* and *hai* years as *Controller of Earth*, and the *zi*, *wu*, *mao*, *you*, *chen*, *xu*, *chou*, and *wei* years as *Intercalary Qi*. This qi resides in the right bar of the human pulse, as well as in the spleen and stomach. The Three generate thought, and thought harms the body. The resolute immortal perceives sounds and sights as illusory flowers, extinguishing desire to augment wisdom.\n\nAt the Autumn Equinox, the fifth step of qi is exchanged: the dryness of *Yangming* Metal, which transforms during the *mao* and *you* years as *Controller of Heaven*, the *zi* and *wu* years as *Controller of Earth*, and the *chen*, *xu*, *chou*, *wei*, *yin*, *shen*, *si*, and *hai* years as *Intercalary Qi*. This qi resides in the right inch of the human pulse, as well as in the lungs and large intestine. The Three generate sorrow, and sorrow harms the Seven Po. The true person observes worldly affairs as all empty, ever abiding in luminous clarity.\n\nBy Light Snow, the final step of qi is exchanged: the cold of *Taiyang* Water, which transforms during the *chen* and *xu* years as *Controller of Heaven*, the *chou* and *wei* years as *Controller of Earth*, and the *yin*, *shen*, *si*, *hai*, *zi*, *wu*, *mao*, and *you* years as *Intercalary Qi*. This qi resides in the left foot of the human pulse, as well as in the kidneys and bladder. Here, the Three generate terror, and terror harms essence. Only the perfected person accumulates the ten thousand practices in the human realm and records the thousand virtues in Heaven. From the fourth to the final step of qi, Earth’s qi governs.\n\nEach step of qi is exchanged every sixty days. The reckoning of years and days follows the same great principle. Thus, the Dao accords with the Great Cavern, and virtue matches the true source. Profound indeed is the Cavern Real! It unites the spirits of vast generation and transforms the sequence of mighty change. By its categories, forms are received in their time. Moreover, the hundred bones of man are bounded, while the One Qi of the profound is without interruption. Those who advance in the Dao summon the uninterrupted qi to supplement the bounded form. Thus, form is the guest of qi, and qi is the master of form. When form and qi preserve one another, the manifold excellences nourish life.\n\nThere is nothing in the world not prized more than the Dao. Those who follow the transformations of the Dao endure; those who oppose the movement of qi perish. They sigh as the sun and moon hasten onward. If one does not say: \"Is there a time for words? The time does not come again.\" Thus, they regard wealth and honor as dust, contemplate life and death with equanimity, and restrain the mind of man.\n\nThe Dao bestows appearance, Heaven bestows qi, and Earth bestows form. The single cavity of the spirit gate is called the *Celestial Center*. Above the *Celestial Center*, Heaven’s qi governs; below it, Earth’s qi governs. At the division of qi’s intersection, human qi follows. The transmission speaks of the Six Qi: yin, yang, wind, rain, darkness, and brightness. They are divided into the four seasons and ordered as the nodes of the Five Phases.\n\nThe Three Yin signify emptiness; the Three Yang, fullness. Wind is *xun*; rain is *kan*. Darkness is the rest of yin; brightness, the waning of yang. As the almanac states: Each year, the qi of the celestial revolution totals twenty-four. From *Beginning of Spring*, *Awakening of Insects*, and *Pure Brightness* are the seasonal nodes of spring; within them, *Rain Water*, *Spring Equinox*, and *Grain Rain* are the mid-season qi of spring. Next, *Beginning of Summer*, *Grain in Ear*, and *Lesser Heat* are the seasonal nodes of summer; within them, *Lesser Fullness*, *Summer Solstice*, and *Greater Heat* are the mid-season qi of summer. Then, *Beginning of Autumn*, *White Dew*, and *Cold Dew* are the seasonal nodes of autumn; within them, *End of Heat*, *Autumn Equinox*, and *Frost’s Descent* are the mid-season qi of autumn. Finally, *Beginning of Winter*, *Greater Snow*, and *Lesser Cold* are the seasonal nodes of winter; within them, *Lesser Snow*, *Winter Solstice*, and *Greater Cold* are the mid-season qi of winter.",
      "overlap_context": "t excellent? Alas, those who stray—do they not reflect?\n\n**The Chart of Qi’s Movement**\nHow wondrous! Before the primordial chaos was divided, the One Qi concealed the Two Modes. After the Supreme Ultimate was separated, the Three Powers manifested, unfolding the myriad beings. The bodies of man and things are all complete; the sources of their qi and destiny are all continuous. The Brahma qi pervades all, and the ten thousand patterns unfold.\n\nThe Brahma qi is the great and pervasive Brahma qi.",
      "start_char": 1505,
      "end_char": 2714,
      "start_sentence": 87,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.30885887145996,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元妙经图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "土分四季末，各十有八日主之。 以上诸气，总统四时五行之政。 且气消盈虚，唯高士则之。 诲人恳之则延龄，冒之即妖命。 宜远乎寒热温冻，将恳天道，以养元气。 盖其元气，难积易散，秘诀在四气调神论中。 是以圣人与气运相应，若亡其情而得长久，故上士参合，其理亦然。 礼云：人之情所为，喜怒哀惧爱恶欲七者，弗学而能。 但人从之则凡，做之则圣。 如攸好修习大洞真元，情当悉除，喜这阴阳之蠹。 故几於道，超生化之域，跻逍遥之界。 至乐熙熙，然其可忽诸与。 上方大洞真元妙经图竟",
      "translated_text": "The earth phase governs the ends of the four seasons, each presiding for eighteen days. The aforementioned qi collectively govern the governance of the four seasons and the five phases. Moreover, the waxing and waning of qi are discerned only by the lofty scholar. To earnestly instruct others in this is to prolong life; to recklessly defy it is to invite calamity. One ought to distance oneself from extremes of cold, heat, warmth, and chill, and earnestly align with the Dao of Heaven to nurture the primordial qi. For this primordial qi is difficult to accumulate yet easy to dissipate—its secret lies within the *Discourse on Regulating the Spirit in Accordance with the Four Qi*.\n\nThus, the sage harmonizes with the movements of qi, as though transcending human emotions to attain longevity. Therefore, the superior scholar integrates and comprehends this principle in the same manner. As the *Rites* states: \"The emotions of humans—joy, anger, sorrow, fear, love, aversion, and desire—these seven arise without being learned.\" Yet if one follows them, one remains ordinary; if one masters them, one becomes sagely.\n\nShould one diligently cultivate the *Great Cavern of Primordial Perfection*, all emotions must be wholly eradicated, for they gnaw at the roots of yin and yang. Thus, one approaches the Dao, transcends the realm of generation and transformation, and ascends to the boundless realm of freedom. Supreme joy is serene and radiant—how could this be neglected?\n\nHere ends the *Illustrated Scripture of the Wondrous Primordial Perfection of the Great Cavern*.",
      "overlap_context": "ummer; within them, *Lesser Fullness*, *Summer Solstice*, and *Greater Heat* are the mid-season qi of summer. Then, *Beginning of Autumn*, *White Dew*, and *Cold Dew* are the seasonal nodes of autumn; within them, *End of Heat*, *Autumn Equinox*, and *Frost’s Descent* are the mid-season qi of autumn. Finally, *Beginning of Winter*, *Greater Snow*, and *Lesser Cold* are the seasonal nodes of winter; within them, *Lesser Snow*, *Winter Solstice*, and *Greater Cold* are the mid-season qi of winter.",
      "start_char": 2714,
      "end_char": 2937,
      "start_sentence": 154,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.857024669647217,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元妙经图.txt",
        "category": "灵图类"
      }
    }
  ]
}