{
  "source_id": "上清九真中经内诀",
  "source_file": "chunked_daozang\\上清九真中经内诀.json",
  "total_chunks": 3,
  "total_original_chars": 1889,
  "total_translated_chars": 11842,
  "total_translation_time": 65.6422004699707,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\上清九真中经内诀.txt",
    "category": "众术类"
  },
  "full_translation": "**The Esoteric Inner Instructions of the Central Scripture of the Nine Perfected of Highest Clarity**\n\n*Scripture Title:* *The Esoteric Inner Instructions of the Central Scripture of the Nine Perfected of Highest Clarity*\n*Attributed to:* Red Pine Master (Chisongzi); likely composed during the Northern and Southern Dynasties.\n*Volume:* One.\n*Source of Base Text:* *Daoist Canon of the Zhengtong Era*, *Section of Divine Writings on Miscellaneous Arts* (Dongshenbu, Zhongshu Lei).\n\n---\n\n**The Esoteric Inner Instructions of the Central Scripture of the Nine Perfected of Highest Clarity**\n*Transmitted by:* The Perfected of Great Emptiness, the Supreme Immortal of Mount Nanyue, Red Pine Master\n\n### **Method for Ingesting Cinnabar**\nTake one *jin* of cinnabar and grind it finely without pounding. Mix it thoroughly with three *sheng* of pure bitter wine, then simmer over a gentle flame until it can be formed into pills the size of hemp seeds. Take twice daily. After forty days, the hundred diseases of the abdomen will be entirely cured, and the Three Corpses will be expelled. After one hundred days of ingestion, the skin and flesh will become firm and strong. After one thousand days, the Director of Destinies will remove one’s name from the register of death, ensuring preservation alongside Heaven and Earth, gazing upon the sun and moon as equals. One’s form and countenance will be transformed.\n\nBy ingesting and refining cinnabar, one may sink into the depths or ascend in transformation, attaining long life and enduring vision. White hair will darken anew, and fallen teeth will regrow. One may peer eastward from a wall and see what lies to the west, or gaze into the Yellow Springs below.\n\n**Formula:** Take three *jin* of cinnabar and grind it finely with swift, heavy strokes of silk. Place it in a copper vessel or basin, then soak it in nine *sheng* of pure bitter wine until it becomes a paste. Set it in a high place to dry. Repeat the soaking as before, using three *sheng* of bitter wine for each *jin* of cinnabar. Continuously dry it, and after thirty days, it will turn purple. When it no longer soils the hands and can be drawn out like malt sugar, it may be formed into pills the size of hemp seeds. Take three pills daily, swallowing them at dawn.\n\nBefore ingesting the medicine, observe thirty days of purification and abstinence, bathing in the Five Fragrances. On the first day of ingestion, the Three Worms will descend. After six days, accumulations and ailments beneath the heart, as well as all abdominal afflictions, will be expelled. After sixty days, visions will appear. After one year, white hair will darken, and fallen teeth will regrow. After two years, one’s complexion will resemble that of a fifteen-year-old. A divine being will present a purple tray bearing food, upon which grows purple lingzhi. When asked, one may eat the lingzhi without fear or alarm, remaining composed and at ease. All things will come of their own accord. Even the hundred ghosts may be summoned.\n\nThe first spirit is named *Shang*, the second *Qing*, and the third *Qing*. By calling the names of the myriad things, one may command them: entering water, they become waves; entering metal, they become molten liquid. One may see ten thousand *li* away, perceiving the Five Viscera with clarity. Thus may one become a Perfected, known to all spirits. One may come and go without hindrance, and the Dao will be established and attained. When ingesting the medicine, merely reduce the consumption of wine.\n\nEven an eighty-year-old woman who takes it may bear children. Both men and women may ingest it.\n\nTake it regularly with well-flower water. When preparing the medicine, one must fast and purify oneself. Begin by making the \"medicine mother\" before the Summer Solstice, then prepare the ingestible medicine after the Summer Solstice. Avoid raw fish, wine, dog meat, raw vegetables, the five pungent herbs, and rich or greasy foods. If transmitted to an unworthy person, misfortune will befall their descendants. Only when the right person is found should the medicine be made for them—only then will it enable one to command others.\n\nAnother method: Grind one *jin* of cinnabar into powder, then pound it. Add two *sheng* of pure lacquer and three *sheng* of strong bitter wine. Combine these three ingredients thoroughly, then simmer over a low flame until the mixture can be formed into pills the size of sesame seeds. Take three times daily.\n\nWhen compounding the medicine:\n- In the first month, avoid the *hai* day;\n- In the second month, avoid the *yin* day;\n- In the third month, avoid the *si* day;\n- In the fourth month, avoid the *shen* day;\n- In the fifth and ninth months, return to avoiding the *hai* day.\n\nOne should select days of \"wang\" (prosperity) and \"xiang\" (mutual generation) and avoid the *wei* day. Also avoid days of self-punishment and the four seasons:\n- In spring, avoid *wu-chen* and *ji-si*;\n- In summer, avoid *wu-shen* and *ji-you*;\n- In autumn, avoid *wu-xu* and *ji-hai*;\n- In winter, avoid *wu-yin* and *ji-mao*.\n\nDo not compound or take the medicine on these days. All medicine preparation should be done on auspicious days following celestial timing.\n\n**The Rite of Offering to the Great One (Taiyi)**\nFor those who consume cinnabar, the eight minerals, mica, or pills and powders made from the hundred herbs—seeking to nurture life, pursue the Dao of immortality, and attain transcendence—must first offer sacrifice to the Lord of the Great One. Without this offering, the medicine will not succeed; even if it does, taking it will bring no benefit. It will not enable one to attain immortality, prolong life, or achieve longevity and deathlessness.\n\nThus, when offering to the Great One, the deity descends to oversee, sometimes sending Jade Maidens. With the divine qi bestowed, the medicine will be efficacious upon consumption. One must fast and purify oneself. When forming pills, declare oneself a servant; when preparing the medicine, offer sacrifice before igniting the flame; when making powders, offer sacrifice only after completion. First, arrange all herbs before the seat of the Great One, then perform the offering.\n\nFor the offering to the Great One, use a table; if none is available, a tray will suffice. Face south, and present five cups of wine, five strips of dried meat, and two plates of dates. The amount of wine may vary as one wishes, but the heart must be sincere and the intent whole—only then will the divine spirits descend.\n\nFor a grand offering, use five *dou* of wine, five *jin* of dried meat, two *sheng* of dates, or dried venison. Only use vessels free of dust. Once arranged, burn incense. The host kneels and bows, reverently inviting:\n- The Nine Heavens’ Two Perfected Ones,\n- The Supreme Emperor of the Highest Sovereign,\n- The Nine Heavens’ Three Venerable Lords,\n- The Supreme Perfected One,\n- The Supreme Jade Maiden,\n- The Nine Elders of the Immortals’ Capital,\n- The King of Grand Clarity,\n- The Heavenly Perfected Lord of the Great One,\n- The Earthly Perfected Lord of the Great One,\n- The Jade Youth of the Great One,\n- The Jade Maiden of the Great One,\n- The Yellow and Purple Canopies,\n- The Bright Immortal Second Lord,\n- The Flame-Covered Firelight Messenger,\n\nto descend to the seat. The host kneels, bows, and kowtows, declaring:\n*\"Today, I humbly beseech for so-and-so (one’s name) to be absolved of the myriad sins and transgressions accumulated over seven generations, down to my own person. May disasters be averted and calamities shifted, all misfortunes dissolved, and longevity and enduring vision granted. Now, as I prepare this medicine of various ingredients, I offer it to the Supreme Lord of the Great One. May the Lord of the Great One oversee its consumption beneath the Yellow Palace and Purple Canopy. May the medicine be without flaw or excess, without scattering or dispersing, harmonizing divine qi and aligning with the radiant essence of the Yellow Flower. I reverently present this to the celestial spirits, that the divine medicine may shine brightly. As the enlightened master ignites the flame, may the Jade Maiden attend beside. By the division of Heaven’s qi, may the Great One descend.\"*\n\nThe host, so-and-so, kneels and bows, then offers three libations. Upon completion, the host sends off the spirits, presenting a final cup of wine with earnest devotion. Though the offering is modest, the deities have deigned to attend. May all above and below rejoice, satiated and content. The host and the hundred spirits now turn their chariots to depart. May the descendant so-and-so be shielded and protected, blessed by Heaven and aided by the spirits. May disasters be dispelled, sins absolved, all as spoken. May wealth, honor, and longevity be bestowed, and blessings endure. All who receive this bow in gratitude, and all prayers be fulfilled.\n\n**The Rite of Invoking the Azure Dragon, White Tiger, Vermilion Bird, and Dark Warrior with Talismans**\nInvoke the Lord of the Great Dao and the Great One, the Direct Talisman Messenger, the Talisman-Attending Jade Maiden, and the Perfected Lord within the Dipper. On this *jiazi* day coinciding with Pure Brightness, the male so-and-so (one’s name) receives the talismans for transcending the nine calamities and other protections. Beneath the stellar lodges, with clear wine, dates, dried meat, and fragrant offerings, descend to the seat. May so-and-so, upon wearing these talismans, repel all misfortunes, the five weapons, and the hundred insects, preventing harm. May official disasters be dispelled, all malevolent spirits vanish, and no suffering befall. May fierce beasts and wolves keep their distance, halting at the sight of the talisman and daring not rise. So-and-so kneels and bows.\n\nThe *Jujube-Cake Rite*\n\nTo perform this in a pure, secluded chamber, avoid exposure to the open air. With the Plain Girl, pace in tandem, each taking three steps and nine footprints. The disciple stands at *wu* (south), the master at *zi* (north), each knocking teeth three times. The disciple moves to the right, the master to the left, then both return to their original positions. The Plain Girl remains in place; the master at *zi* moves to *wu*, while the jujube-cake is placed at the center. Clasping hands, they three times receive the Upper Prime’s *qi*.\n\nThe master intones:\n*\"Radiant jujube-cake,\nTaiyi’s surplus grain.\nSteamed nine times in nine days,\nconsumed to refine the golden wheel.\nThe jujube-cake unfolds,\njade-moist with golden nectar.\nAscend as immortals, transcend the world,\nyour rank equal to the Perfected Kings.\"*\n\nThe Plain Girl exhales and says:\n*\"Jujube-cake, jujube-cake,\nthe Dao of Heaven responds.\nI tread the dark net,\nimmortals come to serve.\nConsume it to ascend,\nyour rank equal to Anqi.\"*\n\n**Method for Steaming Sesame with the Plain Girl**\n\nTo brighten the eyes and brows, purify the breath, beautify lips and teeth, and adorn one’s garments, bathe in orchid-scented water. Do not allow pregnant women, those with baleful eyes, or those harboring malice to touch it—if they do, the medicine will fail, and consumption will be in vain.\n\nPerform three *qi*-cycles, circulating and swallowing five times; then seven *qi*-cycles, swallowing seven times; then nine *qi*-cycles, swallowing nine times. Thereafter, nine *qi*-cycles with nine swallows each, continuing until the *qi* flows unimpeded. This aligns with the method for harmonizing the *qi* of celestial dew and yang essence.\n\nMaster Li transmitted this orally; it was not recorded on paper, lest the celestial patterns be divulged. Guard this secret—do not recklessly teach those unworthy, or calamity will befall you, and the Dao of immortality will remain unattainable.\n\nHere ends the *Inner Secrets of the Upper Clarity Scripture of the Nine Perfected*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清九真中经内诀 经名：上清九真中经内诀。 原题赤松子述，似出於南北期。 一卷。 底本出处：《正统道藏》洞神部众术类。 上清九真中经内诀 太虚真人南岳上仙赤松子述 饵丹砂法 以丹砂一斤，熟梼不槌。 淳苦酒三升，合和相得，於微火上煎之，令可丸，服如麻子。 日再服，四十日，腹中百病尽除愈，三尸皆去。 服之百日，肌肤坚强。 服之千日，司命去死籍，与天地相保，日月相望，改形易容。 饵炼丹砂，陆沈变化，长生久视，白发更，齿落更生。 从垣东，见垣西，睹视黄泉。 方用丹砂三斤，梼重绢捷之，盛铜器盆中，以淳苦酒九升，浸之令如泥状，置高处使乾。 浸之如前法，率一斤丹砂，尽三升苦酒，常爆之，三十日当紫色，持不污手，引如饴，可丸矣，大如麻子，日服三丸。 常服平旦吞之。 服药先斋戒三十日，沐浴五香，服之一日、，三虫下。 服之六日，心下积聚诸症，腹中所苦尽去。 服之六十日，则有所见。 服之一年，白发，齿落生。 服之二年，色如十五时，神人持紫案食之，上有紫芝。 问而食芝，无敢惊恐，定心自安，方物自来。 至使百鬼，皆可致。 其一神名上，其二神名曰青，其三神名为情。 乃万物呼名，可致入水为波，入金为汁，视万里外，彻见五藏，可为真人，诸神皆知之，出入无问，道成立致，服药但少饮酒耳。 八十老妪服之，更得有子。 丈夫妇人皆可服。",
      "translated_text": "**The Esoteric Inner Instructions of the Central Scripture of the Nine Perfected of Highest Clarity**\n\n*Scripture Title:* *The Esoteric Inner Instructions of the Central Scripture of the Nine Perfected of Highest Clarity*\n*Attributed to:* Red Pine Master (Chisongzi); likely composed during the Northern and Southern Dynasties.\n*Volume:* One.\n*Source of Base Text:* *Daoist Canon of the Zhengtong Era*, *Section of Divine Writings on Miscellaneous Arts* (Dongshenbu, Zhongshu Lei).\n\n---\n\n**The Esoteric Inner Instructions of the Central Scripture of the Nine Perfected of Highest Clarity**\n*Transmitted by:* The Perfected of Great Emptiness, the Supreme Immortal of Mount Nanyue, Red Pine Master\n\n### **Method for Ingesting Cinnabar**\nTake one *jin* of cinnabar and grind it finely without pounding. Mix it thoroughly with three *sheng* of pure bitter wine, then simmer over a gentle flame until it can be formed into pills the size of hemp seeds. Take twice daily. After forty days, the hundred diseases of the abdomen will be entirely cured, and the Three Corpses will be expelled. After one hundred days of ingestion, the skin and flesh will become firm and strong. After one thousand days, the Director of Destinies will remove one’s name from the register of death, ensuring preservation alongside Heaven and Earth, gazing upon the sun and moon as equals. One’s form and countenance will be transformed.\n\nBy ingesting and refining cinnabar, one may sink into the depths or ascend in transformation, attaining long life and enduring vision. White hair will darken anew, and fallen teeth will regrow. One may peer eastward from a wall and see what lies to the west, or gaze into the Yellow Springs below.\n\n**Formula:** Take three *jin* of cinnabar and grind it finely with swift, heavy strokes of silk. Place it in a copper vessel or basin, then soak it in nine *sheng* of pure bitter wine until it becomes a paste. Set it in a high place to dry. Repeat the soaking as before, using three *sheng* of bitter wine for each *jin* of cinnabar. Continuously dry it, and after thirty days, it will turn purple. When it no longer soils the hands and can be drawn out like malt sugar, it may be formed into pills the size of hemp seeds. Take three pills daily, swallowing them at dawn.\n\nBefore ingesting the medicine, observe thirty days of purification and abstinence, bathing in the Five Fragrances. On the first day of ingestion, the Three Worms will descend. After six days, accumulations and ailments beneath the heart, as well as all abdominal afflictions, will be expelled. After sixty days, visions will appear. After one year, white hair will darken, and fallen teeth will regrow. After two years, one’s complexion will resemble that of a fifteen-year-old. A divine being will present a purple tray bearing food, upon which grows purple lingzhi. When asked, one may eat the lingzhi without fear or alarm, remaining composed and at ease. All things will come of their own accord. Even the hundred ghosts may be summoned.\n\nThe first spirit is named *Shang*, the second *Qing*, and the third *Qing*. By calling the names of the myriad things, one may command them: entering water, they become waves; entering metal, they become molten liquid. One may see ten thousand *li* away, perceiving the Five Viscera with clarity. Thus may one become a Perfected, known to all spirits. One may come and go without hindrance, and the Dao will be established and attained. When ingesting the medicine, merely reduce the consumption of wine.\n\nEven an eighty-year-old woman who takes it may bear children. Both men and women may ingest it.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 546,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.749130487442017,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上清九真中经内诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "常以井华水服之。 欲作药，当斋戒洁清，先夏至作药母，夏至后作服药，禁生鱼、酒及犬肉、生菜、五辛、肥滑。 传非其人，殃及子孙。 得其人乃与之作药，男子为乃能使人矣。 又法 丹砂一斤末，下槌，纯漆二升，淳苦酒三升。 凡三物合相得，微火上煎之，合可丸，丸如麻子。 日三服。 和药，正月忌亥，二月忌寅，三月忌巳，四月忌申，五月、九月还从亥。 可知当取王相日和，并服亦当忌未日，又避自刑日，及忌四时。 春忌戊辰、己巳，夏，忌戊申、己酉，秋忌戊戌、己亥，冬忌戊寅、己卯。 不可合服。 又合药皆以天时明日吉。 醮太一法 诸饵丹砂、八石及云母百草丸散，欲延年养性，求神仙之法，当祭太一君。 不祭者，作药皆不成。 纵成，服之无益，不能使人得仙，不能延年益寿，长生不死。 故言祭太一者，太一下临之，或遣玉女下，神气所加，合药成，服之有验。 皆斋戒，称臣作丸者药，临剂当祭作饵者，临然火乃祭作散者，须成乃祭之，皆先具诸草药，罗列着太一座前问乃祭。 祭太一者用案，无案用盘。 南向，用酒五杯，脯五胸，枣二盘，酒多少随意，俱令心正意尽，乃为神灵所临耳。 僎祭享者，用酒五斗，脯五斤，枣二升，鹿脯亦可用，唯只可用尘当耳。 安置毕，烧香，主人载拜，谨请九天二真人，高皇太上帝君，九天三老君，太上真人，太上玉女，九丈人，九老仙都君，太清仙王，天真太一君，地真太 一君，太一玉童，太一玉女，黄罗紫罗，明仙二郎，华盖火光使者，下临座席。 主人载拜，叩头自传。 今日乞为某甲，除七世以来，下及某身，千罪万过，移灾徙厄，令一切消除，长生久视。 今当合某种杂药，投诸太一上君，太一君，监临共服，黄宫紫盖之下。 愿药无纵无横，无飞无扬，和合神，华精正黄。 谨奉天神，神药盛明。 明师举火，玉女侍傍。 分天之，太一乃临。 主人某甲载拜，因即三上觞。 毕乃送辞，前奠杯酒，仰伸忱慷，所上微薄，蒙君降顾，上下欢乐，醉饱为度，主者百神，回车就路。 曾孙某甲，愿各拥护，蒙天之福，将神之助，消灾解罪，皆当如语，富贵延年，长蒙福祚，诸受载拜，所求皆遇。 醮青龙白虎朱雀玄武诸符法 启大道太一君，直符使者，主符玉女，斗中真人君。 今日甲子加清明，男生某甲，上受飞度九厄等诸符，谨於星宿下，清酒枣脯甘香，降席就坐，当令某甲佩符，辟却凶殃五兵百虫，不得中伤，官灾消憩。 众邪灭亡，不逢疾苦，远辟虫狼，见符止不敢起。 某甲载拜。",
      "translated_text": "Take it regularly with well-flower water. When preparing the medicine, one must fast and purify oneself. Begin by making the \"medicine mother\" before the Summer Solstice, then prepare the ingestible medicine after the Summer Solstice. Avoid raw fish, wine, dog meat, raw vegetables, the five pungent herbs, and rich or greasy foods. If transmitted to an unworthy person, misfortune will befall their descendants. Only when the right person is found should the medicine be made for them—only then will it enable one to command others.\n\nAnother method: Grind one *jin* of cinnabar into powder, then pound it. Add two *sheng* of pure lacquer and three *sheng* of strong bitter wine. Combine these three ingredients thoroughly, then simmer over a low flame until the mixture can be formed into pills the size of sesame seeds. Take three times daily.\n\nWhen compounding the medicine:\n- In the first month, avoid the *hai* day;\n- In the second month, avoid the *yin* day;\n- In the third month, avoid the *si* day;\n- In the fourth month, avoid the *shen* day;\n- In the fifth and ninth months, return to avoiding the *hai* day.\n\nOne should select days of \"wang\" (prosperity) and \"xiang\" (mutual generation) and avoid the *wei* day. Also avoid days of self-punishment and the four seasons:\n- In spring, avoid *wu-chen* and *ji-si*;\n- In summer, avoid *wu-shen* and *ji-you*;\n- In autumn, avoid *wu-xu* and *ji-hai*;\n- In winter, avoid *wu-yin* and *ji-mao*.\n\nDo not compound or take the medicine on these days. All medicine preparation should be done on auspicious days following celestial timing.\n\n**The Rite of Offering to the Great One (Taiyi)**\nFor those who consume cinnabar, the eight minerals, mica, or pills and powders made from the hundred herbs—seeking to nurture life, pursue the Dao of immortality, and attain transcendence—must first offer sacrifice to the Lord of the Great One. Without this offering, the medicine will not succeed; even if it does, taking it will bring no benefit. It will not enable one to attain immortality, prolong life, or achieve longevity and deathlessness.\n\nThus, when offering to the Great One, the deity descends to oversee, sometimes sending Jade Maidens. With the divine qi bestowed, the medicine will be efficacious upon consumption. One must fast and purify oneself. When forming pills, declare oneself a servant; when preparing the medicine, offer sacrifice before igniting the flame; when making powders, offer sacrifice only after completion. First, arrange all herbs before the seat of the Great One, then perform the offering.\n\nFor the offering to the Great One, use a table; if none is available, a tray will suffice. Face south, and present five cups of wine, five strips of dried meat, and two plates of dates. The amount of wine may vary as one wishes, but the heart must be sincere and the intent whole—only then will the divine spirits descend.\n\nFor a grand offering, use five *dou* of wine, five *jin* of dried meat, two *sheng* of dates, or dried venison. Only use vessels free of dust. Once arranged, burn incense. The host kneels and bows, reverently inviting:\n- The Nine Heavens’ Two Perfected Ones,\n- The Supreme Emperor of the Highest Sovereign,\n- The Nine Heavens’ Three Venerable Lords,\n- The Supreme Perfected One,\n- The Supreme Jade Maiden,\n- The Nine Elders of the Immortals’ Capital,\n- The King of Grand Clarity,\n- The Heavenly Perfected Lord of the Great One,\n- The Earthly Perfected Lord of the Great One,\n- The Jade Youth of the Great One,\n- The Jade Maiden of the Great One,\n- The Yellow and Purple Canopies,\n- The Bright Immortal Second Lord,\n- The Flame-Covered Firelight Messenger,\n\nto descend to the seat. The host kneels, bows, and kowtows, declaring:\n*\"Today, I humbly beseech for so-and-so (one’s name) to be absolved of the myriad sins and transgressions accumulated over seven generations, down to my own person. May disasters be averted and calamities shifted, all misfortunes dissolved, and longevity and enduring vision granted. Now, as I prepare this medicine of various ingredients, I offer it to the Supreme Lord of the Great One. May the Lord of the Great One oversee its consumption beneath the Yellow Palace and Purple Canopy. May the medicine be without flaw or excess, without scattering or dispersing, harmonizing divine qi and aligning with the radiant essence of the Yellow Flower. I reverently present this to the celestial spirits, that the divine medicine may shine brightly. As the enlightened master ignites the flame, may the Jade Maiden attend beside. By the division of Heaven’s qi, may the Great One descend.\"*\n\nThe host, so-and-so, kneels and bows, then offers three libations. Upon completion, the host sends off the spirits, presenting a final cup of wine with earnest devotion. Though the offering is modest, the deities have deigned to attend. May all above and below rejoice, satiated and content. The host and the hundred spirits now turn their chariots to depart. May the descendant so-and-so be shielded and protected, blessed by Heaven and aided by the spirits. May disasters be dispelled, sins absolved, all as spoken. May wealth, honor, and longevity be bestowed, and blessings endure. All who receive this bow in gratitude, and all prayers be fulfilled.\n\n**The Rite of Invoking the Azure Dragon, White Tiger, Vermilion Bird, and Dark Warrior with Talismans**\nInvoke the Lord of the Great Dao and the Great One, the Direct Talisman Messenger, the Talisman-Attending Jade Maiden, and the Perfected Lord within the Dipper. On this *jiazi* day coinciding with Pure Brightness, the male so-and-so (one’s name) receives the talismans for transcending the nine calamities and other protections. Beneath the stellar lodges, with clear wine, dates, dried meat, and fragrant offerings, descend to the seat. May so-and-so, upon wearing these talismans, repel all misfortunes, the five weapons, and the hundred insects, preventing harm. May official disasters be dispelled, all malevolent spirits vanish, and no suffering befall. May fierce beasts and wolves keep their distance, halting at the sight of the talisman and daring not rise. So-and-so kneels and bows.",
      "overlap_context": "he myriad things, one may command them: entering water, they become waves; entering metal, they become molten liquid. One may see ten thousand *li* away, perceiving the Five Viscera with clarity. Thus may one become a Perfected, known to all spirits. One may come and go without hindrance, and the Dao will be established and attained. When ingesting the medicine, merely reduce the consumption of wine.\n\nEven an eighty-year-old woman who takes it may bear children. Both men and women may ingest it.",
      "start_char": 546,
      "end_char": 1514,
      "start_sentence": 29,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.73412871360779,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上清九真中经内诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "蒸苣胜法 欲得清净冥室，不欲令唱露，与素女对步，各三步九迹。 弟子在午，师在子，各叩齿三通。 弟子右行，师左行，各相复位。 素女还在，子师居午上，苣胜居中央，两手相叉，三取上元。 师祝日： 苣胜皇皇，太一余粮。 九日九蒸，饵之金璇。 苣胜将开，玉润金浆。 升仙度世，位同仙王。 素女呎日：苣胜苣胜，天道来应。 妾履玄纲，仙人来承。 服之升仙，位同安期。 与素女蒸胡麻法 欲得明眉目，口香洁，好唇齿，整饬衣裳，沐浴兰汤。 不欲令妊身妇女、恶眼怀毒人触之。 触之则药不成矣，徒服之无益也。 行三，运五五咽，七七咽，九九咽。 自此以后，九辄九咽，通而止。 亦匀天坠露阳之同。 先师李君口传，不载之於纸札也。 惧泄天文，故秘之。 勿妄传非其人，殃及汝身，仙道难成也。 上清九真中经内诀竟",
      "translated_text": "The *Jujube-Cake Rite*\n\nTo perform this in a pure, secluded chamber, avoid exposure to the open air. With the Plain Girl, pace in tandem, each taking three steps and nine footprints. The disciple stands at *wu* (south), the master at *zi* (north), each knocking teeth three times. The disciple moves to the right, the master to the left, then both return to their original positions. The Plain Girl remains in place; the master at *zi* moves to *wu*, while the jujube-cake is placed at the center. Clasping hands, they three times receive the Upper Prime’s *qi*.\n\nThe master intones:\n*\"Radiant jujube-cake,\nTaiyi’s surplus grain.\nSteamed nine times in nine days,\nconsumed to refine the golden wheel.\nThe jujube-cake unfolds,\njade-moist with golden nectar.\nAscend as immortals, transcend the world,\nyour rank equal to the Perfected Kings.\"*\n\nThe Plain Girl exhales and says:\n*\"Jujube-cake, jujube-cake,\nthe Dao of Heaven responds.\nI tread the dark net,\nimmortals come to serve.\nConsume it to ascend,\nyour rank equal to Anqi.\"*\n\n**Method for Steaming Sesame with the Plain Girl**\n\nTo brighten the eyes and brows, purify the breath, beautify lips and teeth, and adorn one’s garments, bathe in orchid-scented water. Do not allow pregnant women, those with baleful eyes, or those harboring malice to touch it—if they do, the medicine will fail, and consumption will be in vain.\n\nPerform three *qi*-cycles, circulating and swallowing five times; then seven *qi*-cycles, swallowing seven times; then nine *qi*-cycles, swallowing nine times. Thereafter, nine *qi*-cycles with nine swallows each, continuing until the *qi* flows unimpeded. This aligns with the method for harmonizing the *qi* of celestial dew and yang essence.\n\nMaster Li transmitted this orally; it was not recorded on paper, lest the celestial patterns be divulged. Guard this secret—do not recklessly teach those unworthy, or calamity will befall you, and the Dao of immortality will remain unattainable.\n\nHere ends the *Inner Secrets of the Upper Clarity Scripture of the Nine Perfected*.",
      "overlap_context": "e calamities and other protections. Beneath the stellar lodges, with clear wine, dates, dried meat, and fragrant offerings, descend to the seat. May so-and-so, upon wearing these talismans, repel all misfortunes, the five weapons, and the hundred insects, preventing harm. May official disasters be dispelled, all malevolent spirits vanish, and no suffering befall. May fierce beasts and wolves keep their distance, halting at the sight of the talisman and daring not rise. So-and-so kneels and bows.",
      "start_char": 1515,
      "end_char": 1868,
      "start_sentence": 68,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.158941268920898,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上清九真中经内诀.txt",
        "category": "众术类"
      }
    }
  ]
}