{
  "source_id": "上洞心丹经诀",
  "source_file": "chunked_daozang\\上洞心丹经诀.json",
  "total_chunks": 16,
  "total_original_chars": 16331,
  "total_translated_chars": 93482,
  "total_translation_time": 471.96986961364746,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
    "category": "众术类"
  },
  "full_translation": "The present text emerged during the Tang and Song dynasties, compiled from excerpts of the *Baopuzi Neipian* and *Huangdi Jiuding Shendan Jingjue*, among others, and falsely attributed to the hand of the Primordial Perfected One’s descendant. It comprises three scrolls. The source text is from the *Daoist Canon of the Zhengtong Era*, under the \"Miscellaneous Arts\" category of the *Dongshen* section.\n\n**Upper Scroll of the *Upper Cavern Heart Elixir Manual***\n*Transcribed by the Descendant of the Primordial Perfected One*\n\nThe Immortal Elder said: To seek transcendence, one must grasp the essentials. The essentials lie in treasuring essence, circulating qi, and ingesting the great elixir. Though it is said to circulate qi, there are dozens of methods for doing so, but the crux lies in returning essence to replenish the brain. Though it is said to ingest qi, there are over a hundred techniques for doing so, but the crux lies in embryonic respiration. Though it is said to ingest elixirs, there are over a thousand formulas, but the crux lies in the Golden Fluid Returned Elixir.\n\nThe manual states: The dozens of methods for treasuring essence and circulating qi are not recorded here in full. Their essential principle lies in returning essence to replenish the brain. The method requires practice during the six yang hours after midnight and before noon, or between midnight and the hour of the ox, or when the qi in one’s body is nascent—this is most effective. At such times, enter stillness, and it may be practiced regardless of whether one is walking, standing, sitting, or lying down. One must maintain inner and outer purity, concentrating the qi to achieve the suppleness of an infant. Then, starting from the Jade Hall and the Tail Gate, kindle the fire and circulate qi, passing directly through the Double Pass of the Spine, ascending into the Three Peaks, and reaching the Jade Capital Mountain. With prolonged practice, the brain will naturally become full. The wondrous Way of the Three Ones and Nine Chambers truly lies herein.\n\nThe manual states: There are over a hundred methods for ingesting qi, such as \"Marrying the Azure Mist,\" \"Central Yellow and Mysterious Yellow,\" \"Vast and Flowing Han,\" \"Purple Radiance and Green Sprout,\" \"Revering the Numinous Moon,\" \"Spiritual Brilliance and Respectful Flame,\" \"Nine Manifestations and Five Essences\"—all techniques of qi ingestion, which cannot be easily expounded in detail. Yet embryonic respiration is the essential method among them. At the outset, one must enter stillness during the time of the *Zhen* trigram, or practice regardless of whether walking, standing, sitting, or lying down, but always maintaining inner and outer purity, concentrating the qi to achieve the suppleness of an infant. Then, as if dwelling in the mother’s womb, breathe at the root of the Mysterious Female, continuously and subtly. With prolonged practice, one will achieve 13,500 breaths, each breath entering the embryo. Each of the twelve double-hours and hundred quarters of the day must be harmonized. In lesser attainment, the bones become upright, the sinews supple, the skin smooth as congealed fat, all illnesses are repelled, and one’s years are prolonged without death. In greater attainment, one enters water without drowning, enters fire without burning, sheds the mortal frame and changes the bones, conceals or reveals the form at will, manifests a body beyond the body, and unites with the Dao as a true being. This Way lies within human capacity.\n\nThese two essential manuals summarize the essentials of the inner elixir.\n\nThe manual states: The Immortal Elder said that though there are a thousand formulas for ingesting elixirs, how could a novice comprehend them all? The essential principle lies in the Golden Fluid Returned Elixir. Since ancient times, none who have attained perfection and realized the Dao to become immortals have succeeded without the Golden Fluid Returned Elixir. This Golden Fluid Returned Elixir is an external elixir. The supreme method of the ancient sages involves generating existence from non-existence to create the Golden Fluid Returned Elixir. This was transmitted heart-to-heart by the sages of antiquity, leaving no written record, and remains most secret. It is not something the common or unlearned can know or achieve. The methods of the furnace, crucible, cauldron, and vessel, as well as the techniques for gathering ingredients and advancing the fire, truly cannot be lightly disclosed in speech or writing. Once this elixir is accomplished, one may ascend with their entire household, and their transformations are beyond measure.\n\nThe next method is the Nine Cauldrons’ Flying and Concealing Golden Fluid Returned Elixir. This, too, is transmitted orally by sages and worthies, for how could it be fully expressed in writing? It involves extracting the Mysterious Yellow Essence, preparing the Six-and-One Clay, sealing the earthen crucible, securing the divine furnace, creating the Flower Pool, generating divine water, brewing the Spring Wine, fermenting the Left Flavor, gathering medicinal materials, advancing the fire phases, and all the methods of flying, concealing, and returning the Golden Fluid. This is not something the ignorant or common can achieve.\n\nNow, the Immortal Elder’s treasured *Heart Elixir Formula* from the Jade Peak is recorded in the *Supreme Upper Cavern Scripture of the Immortals* and is a secondary formula for the Golden Fluid Returned Elixir. Its ingredients are the foremost in nature and flavor among the Nine Cauldrons and the finest among the Eight Stones. With proper preparation and refinement, and without admixture, using only this single treasure, after nine cycles of refinement, the Golden Fluid Returned Elixir is achieved. From bone-transformation to ascension, the process is orderly, guiding true immortals to ascend into the Great Clarity. Though distinct in method from the Golden Fluid Returned Elixir generated from non-existence, it converges in effect and function, embodying the wondrous subtlety of the unburdensome supreme Way. Truly, it is a rare immortal formula in the world.\n\nThe Immortal Elder said: The method of transmission requires selecting an auspicious day of flourishing vitality. First, purify oneself through fasting and bathing, establish an altar, and set up a seat for the Supreme One above water in a secluded place. Burn incense and make an offering, declaring the intention to transmit the Way of longevity to so-and-so, along with the elixir scripture and tokens of oath, placing them on the altar. Have the recipient face north and prostrate for one double-hour. If the sky is clear and windless, the transmission may proceed. Drink the blood of a white rooster as an oath, and cast the tokens into the water. Those without immortal bones will never behold the Way of the inner and outer Golden Fluid Returned Elixir. Thus, my master said that in each generation, no more than two or three may receive it. It was also said that within the Eight Directions, how few have seen or known these secret manuals. Few indeed hear of them, and transmission requires a solemn oath. The medicine of longevity and transcendence is most sacred and weighty, not to be exchanged for ten thousand gold, and must be entrusted only to the worthy. If transmitted, it may be passed to one person within a hundred years, with an oath sworn in blood, before the transmission is made.\n\nShould any initiate betray or leak these secrets, Heaven’s Emperor shall punish them, forever barring their ascent upon the Mysterious Path. The Envoys of the Great Mystery Celestial Capital shall strike the oath-breaker with confusion and madness. Ruin and death shall follow, for the Immortal Lords shall cloud their spirit and dull their mind, rendering all their studies vain. The Grand Recorder of the Three Heavens and the Deities of Fate shall erase their allotted years and cut short their lifespan; all their works shall fail, and they shall suffer punishment in the Great Mystery Capital.\n\nThe Immortal Elder said: To compound the divine elixir, one must do so in the depths of mountains and marshes, or in remote wilderness where no one dwells. If working among men, it must be within high walls and thick enclosures, so that neither inside nor outside may witness it—this too is permissible. Companions should number no more than two or three. First, observe a seven-day fast, bathe in the five fragrant waters, and maintain utmost purity. Avoid all contact with the defiled—those in mourning, the newly dead, or households of marriage. Do not come or go among them.\n\nThe Immortal Elder said: To procure the divine medicines, first observe a seven-day fast. Bathe on a *zi* or *chou* day, and purchase them on the day of the ruling stem. Sit in a place of lunar virtue, and do not haggle over price.\n\nThe Mysterious Woman said: The fifth day of the fifth month is most auspicious for compounding the elixir. Begin on the seventh day of the seventh month. The best days are *jiazi*, *dingsi*, and *kai* or *chu* days; *jiashen*, *yisi*, and *yimao* are next. Avoid the following inauspicious days for elixir-making: in spring, *wuchen* and *jisi*; in summer, *dingsi*, *wushen*, *renchen*, and *weiwei*; in autumn, *wuxu*, *xinhai*, and *gengzi*; in winter, *wuyin*, *jiwei*, *guimao*, and *guiyou*. Also avoid the monthly executioner, the seasonal divisions of heaven, the four *meng* and *zhong* months, the *ji* month’s harvest, *renwu*, *bingxu*, *guihai*, *xinsi*, the monthly establishment, and all new and full moons. These are all ill-omened and must not be used to kindle the fire or compound the divine elixir.\n\nTake care not to associate with the vulgar and foolish, nor with those of jealous disposition or loose tongues. Do not let unbelievers in the Dao hear of it, lest the divine elixir fail to form. Once the divine elixir is complete, you shall become a Perfected One—able to ascend to heaven or plunge into the abyss, transforming at will. Your entire household may attain transcendence, not merely yourself.\n\nThe common folk cling to wealth and reject the elixir, placing their faith in herbal medicines. Yet herbs rot when buried, soften when boiled, and char when burned—they cannot even preserve themselves, how then can they preserve man? They may cure illness and replenish *qi*, but death remains inevitable. The essentials of the Returned Elixir’s Way are beyond the ken of ordinary men.\n\nMan, shaped in heaven and earth, is the noblest of beings. Bound to age swiftly and die, yet if well-nurtured, may live. Life is precious; death is to be feared. Thus, the most secret and weighty of Daoist teachings is none other than the method of longevity. And of all methods for longevity, none surpasses the Way of the Divine Elixir. If this Way does not grant long life, then no long life has ever existed.\n\nLife is one’s own greatest boon. In terms of true worth, even a dukedom cannot compare. Weighing its value, even a kingdom’s bounty cannot match a century of life. Thirty thousand days—yet in youth, one knows nothing; in old age, joy loses its savor. Between infancy and senility, scarcely a few decades remain for peace and laughter—eight or nine thousand days at most. Life flashes by like lightning. Of those who reach a hundred years, barely one in ten thousand does so. Even if one attains it, a single day’s sorrow may overshadow all.\n\nThus, the superior person’s first duty is to secure the matter of long life. Once settled, one may act freely—whether to ascend as an immortal or to enjoy the world, matching Peng Zu’s years or Lord Shao’s distant longevity. One may keep a wife and children, hold office, uphold propriety above and below, and not lose the joys of human relations—truly a grand endeavor.\n\nThe human body is easily harmed and difficult to nurture. Countless forces assail it: excessive depletion, violent uprooting, the spirit worn by agitation, *ying* and *wei* consumed by overuse. The body’s vessels are scorched and eroded, harmony is lost. Improper diet, overindulgence in *ying* and *wei*, sleeping in drafts or dampness—these breed illness in the vital organs. Then one entrusts their life to herbal physicians or seeks aid in sacrifices, like digging a well when thirsty on a hilltop, or setting a trap when starving in barren fields. What can herbs repair? What can ghosts and spirits remedy? If life could be extended by herbs, all physicians would live forever. If illness could be cured by sacrifices, no shaman would ever fall sick.\n\nThus, the scriptures say: Long life does not lie in sacrifices or prayers, nor in solemn vows and empty words. The Way of nurturing life lies solely in the divine elixir. To know it is not easy; to practice it is truly difficult. Many who study the Dao advance little and retreat much. Those who begin are many; those who persevere are few. Like a well that never reaches the spring, it remains a forsaken well.\n\nThus, it is not that long life is hard to hear of—once heard, the difficulty lies in practice. Yet the true challenge is not in practicing, but in persisting to the end. Without utmost clarity, one cannot discern it; without utmost diligence, one cannot learn it. If it were easily obtained, Emperor Wu of Han would have succeeded with Lord Shao. If it were easily understood, Liu Xiang would have mastered it from the *Pillow Book*. Thus, the Yellow Emperor ascended Mount Kongtong to seek the Dao; Yu the Great sealed golden tablets in a jade casket. Some achieved merit and ascended; others perfected the Way and departed as immortals. These are the proven methods of the ancients—the Way of long life. Without devoted effort, merely dabbling in peripheral arts is futile.\n\nThe time must not be lost; delay not even a day. Among all worldly pursuits, only long life is truly weighty. Once the divine elixir is complete, it endures with heaven and earth.\n\nThe Immortal Elder said: Those who refine *lingsha* in the world extract mercury from cinnabar and combine it with sulfur in an eight-to-two ratio to form *lingsha*. Even a single transmutation allows the adept to attain spiritual communion—hence its name, *lingsha*.\n\nThe foolish who consume it find all ailments cured. When refined to nine transmutations, it is called the Returned Elixir. Prepared and ingested according to the method, it enables transformation and ascension. Sulfur, being the fire’s essence, merges with the solar qi to generate this elixir. Cinnabar embodies the true color of the south, embodying the sun’s pure essence, containing the supreme spirit of heaven and earth, and ranking as the highest grade among immortal medicines. Within it lies the sulfur’s body and contained mercury; when refined through nine transmutations according to the immortal formula, it becomes true *lingsha*. The adept who consumes it ascends to immortality in days, soaring to the Great Clarity—its merit defies description.\n\n*Upper Cavern Supreme Heart Elixir Secret Formula*\nAccording to the *Materia Medica*, cinnabar is sweet in taste, slightly cold, and non-toxic. It governs the treatment of all diseases of the five viscera and the body, nourishes the spirit, calms the hun and po souls, augments qi, brightens the eyes, unblocks the blood vessels, relieves vexation and fullness, quenches thirst, replenishes essence, beautifies the complexion, expels malevolent spirits and evil ghosts, eliminates acute abdominal pain, toxic qi, scabies, ulcers, and sores. Long-term consumption connects one to the divine, prevents aging, lightens the body, and leads to immortality. When refined into the Returned Elixir or Golden Liquid according to immortal formulas, it kills the Three Corpses and Nine Worms within the abdomen, eradicates all diseases, restores white hair to black, regrows fallen teeth, reverses aging, and extends life without death. The immortal sheds their mortal form and transforms their bones; at noon, their shadow vanishes. Those who first consume it live a hundred years; after three transmutations, three hundred years; after five, five hundred years; after seven, a thousand years. When the ninefold elixir is complete and one’s merit is perfected, they ascend in flight. In ancient times, Li Shaojun lived for several hundred years among men, while Yin Changsheng reached four hundred, traveling with his wife and children across prefectures and commanderies. Of old, over eighty households ascended with their dwellings, and those who ascended in broad daylight are too numerous to record—such proofs have long been evident.\n\nThe Immortal Inquiry states: For all elixir-making and firing, offer a sacrifice beside the furnace. Use five *sheng* of fine white wine, three *jin* each of beef and mutton jerky, three *sheng* of millet rice, three *sheng* of jujubes, one *dou* of pears, thirty hard-boiled chicken eggs, and three carp, each weighing three *jin*. Arrange these on three trays, with two bowls per tray. Bow twice and pray: *\"This humble servant [Name] reverently invokes the Great Dao Lord, Lord Lao, and the Lord of Supreme Harmony. This humble servant, coveting life and delighting in the Dao, refines the divine elixir. May it be granted that the medicine neither flies away nor perishes, that all is subdued by fire, that the elixir becomes excellent, transforming at hand, with gold and silver fully subdued. By consuming the elixir, may I ascend as an immortal, attend the Purple Palace, enjoy boundless longevity, and attain the rank of Perfected One.\"* After offering the wine and bowing twice again, present all red and orange fruits, citrus, and pomelos. Once done, proceed with elixir-making and firing as prescribed.\n\n*Heart Elixir*\nSelect the finest cinnabar, bright red and the size of a small bean, in any quantity. Some say a *jin* and a half, divided by weight, suffices. Boil it with rootless grass—purple-backed duckweed. The amount of grass should match the cinnabar’s weight; decoct it into a thick liquid, enough to soak the cinnabar for fourteen days. Each morning, warm the grass decoction and soak the cinnabar for another fourteen days, keeping it warm throughout. Use only the original decoction, adding no more. When the days are complete, discard the liquid, dry the cinnabar in the sun, and place it into the divine chamber.\n\n*Method for Making the Divine Chamber*\nTake eight good chicken eggs, soak them in vinegar, lightly remove the shell’s membrane, and open a small hole at the top, about the size of a little finger. Gently pour out the yolk and white, wash and dry them thoroughly. Then grind fine Beijing ink into a thick ink solution, pour it into the eggs, and swirl to coat the interior completely. Dry them slightly over a fire until fully black. If not black enough, repeat the ink coating three times for best results—this is the *kunqian* paper method. Select four of the best for holding the medicine; use the rest as lids. With a shoe-maker’s needle, pierce seven evenly spaced holes around each of the four eggs to symbolize the seven orifices of the heart. Coat the four lids with ink as before. Since raw eggshells are white and unsuitable for divine residence, the black ink allows the spirit to dwell securely—hence the name *divine chamber*.\n\nPlace the divine chambers over incense, using fine, true incense to fumigate them. Offer prayers, moving heaven and earth, and bow twice as before. When the chambers are filled with incense smoke, fill them with cinnabar, ensuring they are completely full. Any shortfall weakens the fire’s power. Once filled, apply egg white to the outer rim of the chamber’s opening and the inner rim of the lid. Seal the lid, then secure it with the following medicine.\n\n*Method for the Jade Lung Medicine to Seal the Divine Chamber*\nThe formula states: *\"Beneath the cinnabar’s birth lies white, and atop this white lies a jade halo.\"* This medicine for sealing the divine chamber and the earthen vessel symbolizes the jade halo of cinnabar, akin to the heart’s pericardium. Pound lime into a fine powder, soak it in extremely sour fermented water for seven days, then dry and pound it again into fine powder. Take half a *jin* of purified lime and half a *jin* of raw arsenic, and grind both into fine powder. Mix these two ingredients with alum decoction to seal the chamber. Once sealed, place it into the Five Phases Jade Vessel.\n\n*Method for the Five Phases Jade Vessel*\nThis jade vessel symbolizes the jade halo. Take five *jin* of arsenic, break it into small pieces, and wrap them in paper, silk, or cloth. Add half a *jin* of dead nitre, a small amount of salt, and one *liang* of unrefined nitre.\n\nCombine the three ingredients in strong vinegar, then take the aforementioned silk-wrapped arsenic and suspend it within the vinegar to boil as an embryo. It must be boiled for seven days, requiring approximately five or six bottles of vinegar. After seven days of boiling, remove the arsenic and dry it in the sun. Take two *liang* of dead nitre, which must be subdued with soap beans—each *jin* of nitre requires two *jin* of soap beans, refined over a fierce fire. Add two *liang* of refined cinnabar and two *liang* of blasted cinnabar.\n\nFor the Jade Vessel’s medicine, the total weight is five *jin* and six *liang*. Pound it into fine cinnabar powder. Use a sand crucible of appropriate size to hold the medicine—this is called the Earthen Cauldron. Place one scoop of dark essence stone at the bottom of the cauldron, then layer the four Jade Vessels evenly within. Position the Four Spirit Chambers at the center, and cover them with the Jade Vessel medicine. Once done, fill the remaining space with dark essence stone, seal the cauldron’s mouth with clay, and tightly cover it with a porcelain dish, ensuring no gaps to avoid disrupting the firing process. Bind it with eight strands of iron wire, twisting the excess into knots about two fingers high. Then apply a thin layer of clay, roughly one *fen* thick, to protect the iron wire and porcelain dish.\n\nPlace the assembly into an ash furnace and nurture the fire.\n\n*Method for the Five-Five Celestial Cycle of Fire*\nThe formula states: Take ten months as the measure, symbolizing the gestation of an embryo. The latter five months correspond to the number of Earth. Thus, five times five makes twenty-five, fulfilling the qi of Earth. For the first ten months of firing, use one *liang* and four *qian*. For the next ten months, use one *liang* and six *qian*. For the final five months, use two *liang* and one *qian*. Once the celestial cycle of fire is complete, proceed with the supplementary fire, adjusting only for the shorter months—this follows the celestial cycle of the moon.\n\n*Method for Supplementary Fire*\nPlace a flat-bottomed ash furnace and replace the iron stand, positioning the crucible so its legs are four *cun* high. For the morning fire, use three braziers, each with seven *qian*, totaling two *liang* and one *qian*, with the fire three *cun* below the legs. For the evening fire, use three braziers, each with eight *qian*, totaling two *liang* and four *qian*, with the flying fire level with the iron wire atop the crucible.\n\n*Method for Fire Braziers*\nFashion six iron-wire braziers, divided for morning and evening use. Each brazier should be one *cun* wide and one and a half *cun* long, with a lid. When lighting a new brazier, transfer the fire from the old one, ensuring no residual fire remains. Once the supplementary fire for the shorter months is complete, open the furnace, remove the cinnabar cauldron, cut the iron wire, lift the porcelain dish, and take out the four Spirit Chambers. Saw open the chambers—their bodies will be as hard as porcelain or tile, making sawing difficult. First, carve a hemispherical hollow in a wooden block to hold half of the Spirit Chamber, then place the chamber on it and saw gently back and forth to open it. Remove the cinnabar and bathe it in medicinal water to revive the cinnabar’s fire and restore its original qi.\n\n*Method for Bathing the Cinnabar and Restoring Qi*\nUse one *liang* of dried mountain grape seeds (or four *liang* of fresh, squeezed for juice). Add four *liang* each of petroleum and camphor oil, mixing them evenly into roughly half a bowl of water. Bring the water to a boil, then pour it into the cinnabar—let it boil until the sound ceases, then wait for it to cool before removing the cinnabar for testing.\n\n*Method for Testing the Cinnabar*\nTake one *liang* of red copper and melt it into liquid. Add half a *qian* of the cinnabar to transmute it. Then place a piece of raw nitre the size of a green plum into the molten mixture. If sulfur is present, its fumes will darken the transmuted copper. Use a piece of wall clay to absorb the sulfur fumes, stirring with tongs until the liquid becomes clear as water. Pour it out. If impurities remain, add more raw nitre and wall clay, repeating the process until the liquid is perfectly clear. Pour it out to obtain eight pieces of true-color treasure, requiring no additional matrix. If the cinnabar transmutes thus, its spirit is awakened—this is the Mother of the Nine-Cycled Cinnabar.\n\nThough the cinnabar’s body is now potent, it is still not fit for consumption. It may only serve as a vessel to ascend into the Nine-Cycled Cinnabar. Do not waste the Mother Cinnabar by using it excessively for transmutation, lest it hinder the Nine Cycles.\n\n*Discourse on Testing the Cinnabar*\nAccording to medical texts, copper has the property of mending broken bones. When one ingests copper medicine, it travels directly to the site of the fracture, reinforcing it like lacquered sinew, making the bone as hard as metal or stone. Testing the cinnabar by transmuting copper into treasure reveals the Dao of bone-transformation in immortal formulas. If one refines and consumes it through nine cycles, one’s bones will assuredly transform into cold jade.\n\n*The Supreme Ultimate Realized One Speaks*\nAmong the three hundred and sixty kinds of jade and stone, cinnabar is the foremost treasure. The ancients regarded it as the great medicine for nurturing life, attaining immortality, and achieving longevity. The methods for refining and consuming it are not uniform—some use wine, others vinegar, lacquer, or honey. When properly prepared, all can nurture life and lead to immortality. However, subduing the fire to create liquid gold and cycling it nine times to produce the Returned Cinnabar is the supreme method. This cinnabar can grant one the status of an Earth Immortal, with a lifespan of ten thousand years. To become a Spirit Immortal, one may pay homage to the Golden Mother and the Wood Lord, receive sacred texts, ascend the numinous terrace, and transform one’s bones to become a flying immortal. To become a Heavenly Immortal, one may roam freely among the Purple Canopy and Verdant Terrace, serving as a minister in the Three Pure Realms.\n\nOnly those with the bones of an immortal will encounter this method. Only those of virtue will meet a perfected being. If you encounter it, do not treat it lightly or with disrespect, nor fail to master its oral instructions, lest you waste the furnace and cauldron or incur heavenly punishment, cutting short your journey on the mysterious path. Such misfortune is self-inflicted—who else could be blamed?\n\nThe grasses and trees number thirty-six tens of species, yet yellow essence ranks as the supreme treasure among them. This is also a numinous herb for nurturing life and destiny, attaining longevity and immortality, and becoming a spirit immortal. Examining the natures of the world’s grasses, trees, metals, and stones—all things under heaven—those imbued with yin qi invariably contain toxins and bring death to man. Those imbued with yang qi invariably bestow life.\n\nYellow essence grows on the southern slopes of mountains, receiving the essence of the Great Yang. Hookvine grows on the northern slopes, receiving the essence of the Great Yin’s qi to flourish, and thus swiftly causes death. Its poison can sever the intestines and stomach, for yin toxins are most fearsome. Cinnabar receives the true essence of the Great Yang, the upright qi of fire’s transformation, sharing the same color as the sun and the same function as yellow essence. As the essence of yang, what doubt could there be?\n\nWithin the sun dwells the crow, harboring yin. Within cinnabar dwells mercury, harboring yin. Refined through nine cycles to become golden liquid and returning elixir, it is pure yang. The growth of cinnabar, crowned above by jade radiance and sheltered below by jade groves, reveals its noble place in creation. Thus may its worth be known.\n\n*Upper Scroll of the Upper Cavern Heart Elixir Canon and Oral Instructions*\n*Middle Scroll of the Upper Cavern Heart Elixir Canon and Oral Instructions*\n\nThe Patriarchal Heir of the Supreme Ultimate Perfected One records the words of the Immortal Elder: As the *Cantong Qi* states, \"To plant grain, use millet; to hatch a chick, use its egg. Swallows and sparrows do not give birth to phoenixes, nor do foxes and hares nurse horses.\" These words exhaust the principle. For humans, the Five Phases in sequence give rise to form, while in reversal they perfect the true. Only by examining the qi of yin-yang and the Five Phases does this body come to be. Yet the treasure within the body is the spirit. In heaven, spirit is heat; on earth, it is fire; in humans, it is the heart-spirit. The heart is the ancestor of the Dao, the proper method of immortal cultivation.\n\nNow, taking cinnabar alone and refining it through nine cycles to become golden liquid and returning elixir—this is the very principle. If one awakens to this principle, cultivating the external refinement of the returning elixir and ingesting it according to the method, while internally seeking the mysterious pearl within the Crimson Waters and congealing the returning elixir within the Yellow Court, one causes both inner and outer elixirs to form. Through ninefold transformation, in an instant one merges with the Dao and attains truth. For inner cultivation yields the yin elixir, while outer cultivation yields the yang elixir. When the yin elixir is achieved, life is prolonged; when the yang elixir is achieved, one ascends in flight. Thus, those who cultivate the Dao—those who attain the inner elixir may extend their years, while those who obtain the outer elixir may ascend to heaven. If the inner elixir is complete but the outer elixir does not respond, or if the outer elixir is perfected but the inner elixir remains unmastered, neither can achieve ascension.\n\nWhat I transmit as the Three Ones and Nine Chambers is the essential method of inner cultivation. The golden liquid returning elixir is the ultimate achievement of external refinement. Strive to cultivate it, and success may be yours.\n\nThe disciple then bowed twice to receive the teaching, vowing to keep it secret for life.\n\nThe Immortal Elder said: Those who seek longevity yet fail to obtain the divine elixir of golden liquid merely torment themselves in vain. For breath control, guiding and pulling, exhaling the old and inhaling the new, or ingesting herbal medicines—these may extend life, but death remains inevitable. Only by ingesting the divine elixir can one become a transcendent, traversing the world, enduring as long as heaven and earth, shining as brightly as the sun. One may sit and perceive a thousand miles, command ghosts and spirits, ascend with one’s entire household to the void, fly without wings, ride clouds and mount dragons, ascending and descending the Great Clarity. In the span of a single watch, one may roam the eight extremities, unbound by rivers and seas, unafraid of the hundred poisons.\n\nHerbal medicines may cure illnesses, but they cannot confer longevity. Mineral medicines may extend years and also dispel the hundred evils. Yet herbs, being insubstantial, brittle, and soft, cannot endure long—they rot when boiled, decay when buried, turn to ash when burned, and wither when stored. If they cannot firm themselves, how can they firm others? If they cannot sustain their own life, how can they sustain others?\n\nCinnabar, however, is called a marvelous stone and the supreme medicine. Its fine texture is red and lustrous, its substance firm and enduring. The longer it is refined and stored, the more wondrous its transformations become. It can fly, turn to powder, become refined as snow, transform into true mercury, or become the returning elixir. It resists fire, transmutes water, and when dissolved, does not diminish. Buried, it does not decay. Its numinous marvels and mysteries are beyond description.\n\nYet when rightly applied, it preserves life; when misused, it harms longevity. Some see in the *Materia Medica* that cinnabar is non-toxic and assume it cannot harm. They do not know that mercury, born of cinnabar, is highly poisonous. Thus it is said: mercury is the soul of cinnabar, and mercury emerges from cinnabar. If the derivative is toxic, how could the source be without poison? Those of shallow understanding and narrow vision, failing to consider the far-reaching power of life and destiny, stumble and do not recover. This is why the ancients were deeply cautious, eradicating evil at its root. They first boiled and refined cinnabar before incorporating it into the great elixir. Though paths differ, all aim to subdue fire. Neither days nor human effort should be limited—patience is required, and haste is unwise.\n\nSome see cinnabar as a stone and claim that all stones turn to ash when burned, so why should cinnabar alone remain unchanged? They do not realize that cinnabar, though red, can generate the white substance of mercury—a transformation that serves as proof. Refining cinnabar into golden liquid is like soil mixed with water becoming mud. Beneath mountains where gold is found, cinnabar often abounds. Through ceaseless transformation, it reverts to gold, returning to its original nature—nothing is strange in this.\n\nThus, in the Han dynasty, there was Li Shaojun, a man of several hundred years. His only skill was refining cinnabar into the returning elixir, or transmuting the elixir into gold, fashioning vessels from the gold, using them to hold food, and consuming it to nourish the body. Gradually, his intestines and stomach were permeated, his meridians and protective qi suffused, and by virtue of its firmness and purity, his years were prolonged. Yet when he served Emperor Wu of Han, he did not fully reveal the truth, instead presenting it as sacrificial techniques and heterodox arts. He did not disclose the proper method of the golden liquid returning elixir. Summoned to court, he eventually departed in transformation, and the emperor longed for him.\n\nThus we know that only the method of refining cinnabar and the wonder of the golden liquid returning elixir can make one ageless and deathless—this is the greatest good.\n\nThe Immortal Elder said: This method of refining cinnabar is not only for ingesting to attain longevity. Used to bathe the body, mundane illnesses cannot invade, and the hundred calamities cannot harm. This method originally derives from the Jade Emperor’s secret hidden texts, not something the worldly possess. Without receiving the immortal tally, one can never see it. I leave this written method to enlighten future sages. Whoever obtains it must follow the transmission rites to receive it. Do not lightly disclose my teachings to the unworthy, for if transmitted to the wrong person, the elixir will not form. Even after ten thousand kalpas of cultivating the Dao, one will never succeed.\n\nIt is also said: Do not lightly disclose the received method. On the day of transmission, choose an auspicious day, establish a purification fast, and set up an altar. Master and disciple shall stand before the altar, burning precious incense day and night, presenting offerings and praying to the emperor for the fulfillment of their wish—the recording of the name in the register of longevity medicines.\n\nThe disciple [Name] has from youth cherished the supreme Dao of longevity. Through ten thousand kalpas, I have constantly received the blessings of the Dao. Now, by the grace of the sagely decree, I have been deemed worthy by my merciful master to receive these secret writings. Yet I dare not presume to accept them without first submitting each detail to the August Sovereign. My master has declared before the throne that this disciple [Name] seeks the Dao with unwavering diligence, day and night. Should I now transmit these secret writings, I dare not grant them without first presenting every particular to the August Sovereign.\n\nWith reverent devotion, we shall maintain this practice for seven full days and nights. Then, burning incense, we shall ascend the altar, drink the blood oath, and cast the divided gold ring into flowing water. Only then may the master transmit the divine golden elixir, along with its oral instructions and illustrated manuals—all to be conveyed in accordance with this same ritual. Should the transmission rites not be strictly observed, neither master nor disciple shall achieve success, for these are the secret writings of the Golden Liquid Returned Elixir.\n\nMaster Huxiu addressed Lord Ge the Immortal: \"Your fate is bound to the star of immortality, and your name is recorded to succeed me. Today, I transmit to you the secret of the golden elixir and the methods of cultivating immortality. Follow them faithfully. Should you ever transmit them, choose only those who dwell in mountain seclusion, free from worldly desires. They must swear the blood oath, divide the ring, and establish the altar vow. Never transmit recklessly, for if given to the unworthy, your name shall be stricken from the register of blessings, and calamity shall extend through generations. Guard this well—do not transmit it carelessly. These are the divine elixir’s priceless secrets.\"\n\n**Nine Cycles of the Divine Elixir: Secret Formula**\n\nThe instructions state: For every cycle of the elixir, an offering must be made before the furnace. The method of offering, as previously described, applies uniformly to the preparation of the medicine, the kindling of the fire, and all nine cycles.\n\n**First Cycle Method**\nThe instructions state: For each tael of raw cinnabar, use four taels of pre-fired cinnabar to encase and nurture it. In this first cycle, for every four taels of cinnabar, one *jin* of pre-fired cinnabar must be used as the encasement. When raw cinnabar encounters pre-fired cinnabar, it submits as a cat before a rat or a sheep before a tiger, yielding to the nature of the fire and ceasing all resistance.\n\nSelect three taels of bright red cinnabar, the size of yellow beans, and soak it in *chongshan putao* water for seven days. Each day, replace the water with warm liquid, then dry it in the sun. Prepare a talc box, about the thickness of a three-coin stack, large enough to hold over twenty taels. Make it slightly larger, then fill it to the brim.\n\nFirst, lay a layer of fired cinnabar at the bottom, then add raw cinnabar, arranging them like lotus petals. Cover with another layer of fired cinnabar, then alternate between raw and fired layers. Once filled, top with fired cinnabar, trimming any excess to level with the cinnabar. Seal with the box’s lid, ensuring the cinnabar adheres to it. After sealing, secure it with mud—ancient methods used gypsum, which is harder to open, but mud is easier. Though the pre-fired cinnabar encasement prevents escape, mud is still used. However, following the ancient method with gypsum is preferable, allowing for gradual opening. Bind the box with eight iron wires, twisting the excess into a knot two fingers high. This applies to all nine cycles.\n\n**Furnace Construction for Elixir Cycling**\nConstruct the furnace base from planks, with bamboo skewers forming the frame. Weave a bamboo furnace, straight and cylindrical, about a foot wide, coated with a one-inch layer of mud. The mouth should be nine inches wide, and the height eleven inches. Inside, place an iron stand three inches high, upon which the medicine box rests, covered with ash for heat regulation. This furnace serves all nine cycles, following the same method.\n\n**Fire Regulation for the First Cycle**\nOne tael and four *qian* of fire regulation. No supplemental firing is needed for any of the nine cycles. Each cycle lasts twelve months. Upon completion, extract four taels of cinnabar, discarding the remaining *jin* of encasement. This can be used for transmutation. The elixir of the first cycle is to be ingested according to the prescribed method.\n\n**Method of Ingesting the First-Cycle Elixir**\nGrind one *qian* of pre-fired cinnabar into an extremely fine powder. Mix with half a *ge* of a firstborn son’s milk in a silver dish. Gently simmer in a double boiler until cooked, then add a pinch of white flour to form small pills the size of yellow beans. Place them in a paper steamer suspended over a slow fire, and stir-fry with a silver spoon for one *shi* (two hours), ensuring the paper does not burn. If it chars, replace the paper steamer and continue frying until dry, ensuring thorough heat penetration.\n\nIngest with ginseng decoction at the fifth watch, facing east. Soon after, the body will grow intensely hot and the mouth dry. Prepare nine large vats of water in advance. Immediately sit in one; if the heat persists, move to another vat of cold water. Continue until all nine vats are warmed, waiting until the heat subsides and the body cools. Afterward, the skin will shed entirely, including hair, eyebrows, and beard, which will regrow. The elderly will revert to youth, like a cicada shedding its shell. Each cycle’s elixir, when ingested, yields distinct benefits as described in the scriptures. Those who have cultivated internal elixirs need not use water.\n\nHowever, this method of ingesting the first-cycle elixir must not be undertaken lightly. Only those resolutely devoted to longevity, free from doubt and with a full internal elixir, may proceed. Those of restless temperament or prone to suspicion risk harm. Why? Ordinary people who have not cultivated internal elixirs suffer from depleted brain marrow. Ingesting this elixir may damage their essence, leading to desiccation. If doubt arises, the heart’s fire will ignite, engulfing the body in flames—beyond salvation. Thus, when the nine-cycle elixir is completed, ordinary people who ingest it will dissolve into fresh blood. How can this not be believed? Even this first-cycle elixir demands caution.\n\nAfter ingesting the elixir, one must cultivate the internal elixir, practicing seated meditation to refine both internal and external. When the internal and external elixirs align, the spirit will emerge—all methods are contained herein.\n\n**Secret Method of Cultivating the Internal Elixir**\nThe instructions of the True Person of the Great Ultimate state: The elixir chamber must be pure and clean, with precious incense constantly burning. It should be a secluded room, free from drafts, neither too bright nor too dark, with moderate height. All taboos must be strictly observed, forbidding the presence of impure or inauspicious individuals—those who are elderly, ill, in mourning, postpartum, pregnant, foul-bodied, disabled, or infirm. Monks, Daoists, idlers, women, cats, dogs, and other animals must also be excluded. It is best to prevent outsiders from entering. Select two intelligent, sincere, and upright young boys as attendants, ensuring no one learns of the elixir chamber’s existence. The Dao of immortality values secrecy above all.\n\n**Further Secrets of Cultivating the Internal Elixir**\n\nOne must never speak of the practice of refining the internal or external elixir, nor reveal its methods to others. If杂 persons or those who lack faith learn of this cultivation, or if one discusses it in their presence or allows them to witness it, the Dao of immortality cannot be attained. Once the elixir chamber is prepared, arrange a seat within it—whether a bench, a couch, or a meditation platform—ensuring the knees are level, neither too high nor too low. The pillow should be four fingers in height. The chamber’s humidity and dryness must be balanced, and all must be kept pure and clean. The bedding, clothing, and quilts should be thick and soft, while food, drink, decoctions, tea, and wine must be prepared with care, ensuring purity and moderation. Strictly avoid sexual defilement, excessive drunkenness, overindulgence, hunger, joy, anger, sorrow, or anxious thoughts. All perverse intentions and delusive imaginings must be absent, and the five pungent vegetables, along with foul impurities, should also be avoided. If one violates the taboo of sexual defilement or encounters foul impurities, the elixir will be harmed, and the practitioner’s progress will be hindered—failure will be imminent.\n\nThereafter, sit in joyful stillness each day, free from all attachments, with no wandering thoughts. The inner realm must not be disturbed, nor should external distractions intrude. The heart should be as bright and clear as a mirror, without a speck of dust; as pure and limpid as water, without a trace of sediment. Then, clench the fists as an infant does, press the lips and teeth together, and rest the tongue against the upper palate. Breathe softly and continuously, directing the gaze from the eyes to the nose, and from the nose to the navel. One will feel a thrilling sensation throughout the body’s pores, akin to the bliss of intimate union. This serves as verification.\n\nWhether sitting cross-legged, stretching the legs, standing, walking, or lying down, the ascent and descent of qi remain the same—profound principles reside within these practices. When lying down, one must not sleep, for sleep scatters the qi. If one can remain sleepless day and night, it is most excellent. If not, sleep should be minimized, gradually reducing it over time.\n\nThe practice of fetal breathing should be performed from the *zi* hour (11 PM–1 AM) to the *wu* hour (11 AM–1 PM), never from *wu* to *zi*. The period from *zi* to *wu* is called the Six Yang, during which qi is generated. From *wu* to *zi* is the Six Yin, when qi declines—this is of no benefit to the practitioner.\n\nIn practicing fetal breathing, embrace simplicity and profound stillness: close the nose, shut the eyes, and refrain from exhaling through the mouth, as if dwelling within the womb. Beginners should draw in qi through the nose and mouth, then hold it while silently counting to one hundred and twenty before exhaling through the mouth. The breath should be so subtle that the ears cannot detect its entry or exit, with inhalation exceeding exhalation. A method to test this is to place a goose feather before the nostrils—if the feather remains unmoved during exhalation, the technique is correct. Gradually increase the count of held breaths; with time, one may reach a thousand. Then, the aged will regain youth, the dead may be revived, plagues can be averted, tigers and snakes subdued, water and fire traversed, metal and stone penetrated, hunger and thirst dispelled, and life prolonged to defy death. One may even reverse the flow of water and fire. However, while practicing this method, avoid consuming excessive meat, raw vegetables, or rich, fatty foods, as these strengthen the qi, making it difficult to restrain. Guard against anger, for anger disrupts the qi.\n\nThe efficacy of fetal breathing is thus—this method must be kept secret. It is a teaching passed mouth-to-mouth, not an ordinary worldly text. Do not reveal it to the unworthy; guard it closely.\n\nNext, circulate the essence and qi from the *weilu* (tailbone) through the *jiaji* (spine) into the brain, entering at the *naohui* point (the nineteenth vertebra). The *jiaji* point lies below the twelfth vertebra. The method for replenishing the brain begins by tilting the head back and tightly sealing the third vertebra of the *dazhui* point to prevent qi from passing. First, close the *jiaji* to block the qi. The *dazhui* point is called the Upper Pass, and the *jiaji* point the Middle Pass. Gradually raise the qi until it fills the brain. Once the brain is full, the elixir will naturally descend from the *xuanying* (mysterious throat), its taste sweet and its fragrance pure—at this point, the internal elixir is complete.\n\nWith time, signs will manifest: the body may feel as though seated in a steaming rice pot, unbearably hot, or the limbs and entire body may grow cold as ice, both inside and out, before harmonizing. At this stage, do not be alarmed or fixated—further methods exist, transmitted orally and through direct instruction.\n\nThe method of fetal breathing, combined with the practice of returning wind and merging qi, unites essence with spirit, spirit with qi, and qi with the true. When the divine elixir merges, the elixir will form in a hundred days.\n\nWhen the internal elixir fills the brain, proceed with the method of silently paying homage to the Emperor in the Three-One and Nine Chambers. Upon completion of this merit, a celestial summons will arrive, and the time for ascension will draw near.\n\n**Second Cycle Method**\nThe instructions state: The methods of bathing, preparing the medicine, sealing, and the elixir furnace are the same as in the first cycle; they will not be repeated here. Take one *liang* of cinnabar and four *liang* of first-cycle refined cinnabar, combining them for a total of five *liang* of raw and prepared cinnabar. Use a mica box large enough to hold slightly more than five *liang*, fill it to the brim, seal it, and apply fire. The fire regulation for the second cycle is one *liang* and six *qian*. Each cycle’s firing lasts three hundred and sixty days; this applies to all nine cycles and will not be repeated.\n\nThe second cycle, being an even number, is not consumed. The fourth, sixth, and eighth cycles follow the same principle.\n\n**Third Cycle Method**\nTake one *liang*, one *qian*, and a half of cinnabar, and five *liang* of third-cycle refined cinnabar. Process them according to the method, yielding a total of six *liang* and two *qian* of raw and prepared cinnabar. Use a talc box large enough to hold slightly more than six *liang* and two and a half *qian*, fill it to the brim, and seal it. The fire regulation for the third cycle is two *liang* and one *qian*.\n\nThe divine elixir of the third cycle is consumed as follows: knead it with the milk of a firstborn son and form it into pills the size of black beans. Take them with ginseng decoction, and one may attain a lifespan of three hundred years, project the yang spirit, roam the four seas, commune with divine beings, and have jade maidens attend to them, commanding ghosts and spirits. If used for transmutation, it can refine cinnabar into yang elixir, allowing one to shed the mortal body and exchange bones. It can also transmute mercury.\n\n**Method for the Fourth Cycle**\nTake one *liang* and five *qian* of cinnabar and six *liang* and two and a half *qian* of third-cycle fire-tamed cinnabar, and fill the vessel. The total weight of raw and prepared cinnabar is seven *liang* and seven *qian*. Use a talc box large enough to hold seven *liang* and seven *qian*, fill it to the brim, seal it, and apply fire. The fire regulation for the fourth cycle is two *liang* and eight *qian*. The elixir of the fourth cycle is not for consumption but may be used for transmutation.\n\n**Method for the Fifth Cycle**\nTake one *liang* and nine *qian* of cinnabar and seven *liang* and seven *qian* of fourth-cycle fire-tamed cinnabar, and enclose them. The total weight of raw and prepared cinnabar is nine *liang* and six *qian*. Use a talc box large enough to hold slightly more than nine *liang* and six *qian*, fill it to the brim, seal it, and apply fire. The fire regulation for the fifth cycle is one *liang* and eight *qian*. The divine elixir of the fifth cycle is consumed as follows: knead it with refined butter into pills the size of small beans, and take them with frankincense decoction. One may attain a lifespan of five hundred years, enter water without drowning, enter fire without burning, and achieve perfection of both form and spirit, thereby being ranked among the immortals. If used for transmutation, one *jin* of fire-tamed cinnabar can refine four *liang* of mercury, producing *Qionglin Yushu* (\"Jade Trees of the Celestial Grove\"). This refined mercury may then be divided and used as a vessel to nurture cinnabar, a process called *Yudeng* (\"Jade Equivalent\"). However, it may only be used to refine mercury once or twice; otherwise, the elixir will be damaged.\n\n**Method for the Sixth Cycle**\nTake two *liang* and four *qian* of cinnabar and nine *liang* and six *qian* of fifth-cycle fire-tamed cinnabar, and fill the vessel according to the method. The total weight of raw and prepared cinnabar is twelve *liang*. Use a talc box large enough to hold slightly more than twelve *liang*, fill it to the brim, seal it, and apply fire. The fire regulation for the sixth cycle is two *liang* and eight *qian*. The details of the sixth cycle are as described above.\n\n**Method for the Seventh Cycle**\nTake three *liang* of cinnabar and twelve *liang* of sixth-cycle fire-tamed cinnabar, and fill the vessel. Use a talc box large enough to hold slightly more than fifteen *liang*, fill it to the brim, seal it, and apply fire. The fire regulation for the seventh cycle is two *liang* and one *qian*. Upon reaching the seventh cycle, the elixir is consumed by forming it into pills with fermented wine, the size of *meng* beans, and taking them with costus root decoction. One may attain a lifespan of a thousand years; its efficacies need not be fully enumerated. If copper coins, lead, or tin are placed in the vessel, they will all be transmuted into high-grade silver. If realgar, sulfur, *fenghuang*, *pishi*, or *lingsha* are placed in the vessel, they will be tamed by fire and prevented from volatilizing; they may then be divided and placed in separate vessels for further cycles. If the elixir is formed into pills the size of *meng* beans, it can refine one *liang* of mercury into silver. When added to the Three Yellows, it will transmute them into red gold. However, it should not be used wastefully but only to verify its efficacy.\n\n**Method for the Eighth Cycle**\nTake three *liang* and seven *qian* of cinnabar and fifteen *liang* of seventh-cycle fire-tamed cinnabar, and fill the vessel according to the method. The total weight of raw and prepared cinnabar is eighteen *liang* and seven *qian*. Use a talc box large enough to hold slightly more than eighteen *liang* and seven *qian*, fill it to the brim, seal it, and apply fire. The fire regulation for the eighth cycle is two *liang* and two *qian*. The method for the eighth cycle is the same as above.\n\n**Method for the Ninth Cycle**\nTake four *liang* and six *qian* of cinnabar and eighteen *liang* and seven *qian* of eighth-cycle fire-tamed cinnabar, and fill the vessel according to the method. Use a talc box large enough to hold slightly more than twenty-three *liang* and three *qian*, alternating one portion of raw and one portion of prepared cinnabar, fill it to the brim, seal it, and apply fire. The fire regulation for the ninth cycle is one *liang* and six *qian*. Upon completion of the ninth cycle, the elixir is also called *Zijin Ya* (\"Purple Gold Sprout\"). It is consumed by forming it into pills with *longgao*, the size of millet grains. *Longgao* refers to dew collected from mulberry leaves. Take one pill at a time, immerse it in well water for three days, and then consume it with the first draw of well water.\n\nFor the ninefold transmutation, place the elixir upon the recipient’s life-destiny and the astrological signs of regal ascendancy. According to the scripture, establish an altar, perform the libation rites, and maintain purity through fasting. Position the talismans of the Numinous Treasure at the five directions, the twelve spirit talismans at their respective celestial stems, and the eight numinous talismans at the eight directions. Seal the Gate of Heaven, seal the Door of Earth, pass beneath the canopy of flowers, enter the Yin realm, and seize the celestial heart at the hour of the Celestial Heart. Arrange the nine palaces, with the alchemist attending the furnace at the Central Palace. First inquire whether the day’s cyclical signs align; if so, proceed to exit the palace—this is most auspicious. Once the elixir is completed, consume a grain the size of millet, and ascend as a perfected one. Guard this secret; do not transmit it lightly.\n\nShould someone be on the verge of death, place one grain in their mouth and pour water to swallow it, and they shall revive. If a creature dies in the sixth month and the elixir is placed within its abdomen—whether human or beast—it will not decay through the summer; this is the proof. If the ninefold divine elixir is used to refine and sublimate the Three Yellows, it becomes equivalent to the Yellow Emperor’s Nine Cauldrons of Flying Elixir. The method follows the above: establish an altar in purity, then construct a nine-palace, eight-trigram furnace in the shape of a tortoise, aligning above with celestial patterns and below with terrestrial principles. Place the Three Yellows atop the cinnabar and cover it with the celestial plate. Then apply fire above and water below to sublimate it, sweeping up the dark frost. Consume a grain the size of millet, and purple clouds will arrive instantly, bearing one aloft in flight. For transmutation, a single grain can convert five *liang* of mercury into yellow gold. At this stage, how could one be constrained by worldly profit? It lies in the transformative power of the spoken word.\n\nFor the method of conjoining the Golden Liquid and Returning Elixir, once compounded, consume one *liang* to ascend as an immortal. If one does not yet wish to depart and instead desires to remain in the world as an earthbound immortal, fast for one hundred days and consume half a *liang*; thus, one attains longevity without death, immune to all harms and poisons, able to keep a family, hold office, or pursue desires without restriction. If later one wishes to ascend to heaven, fast and consume the full *liang*, and one shall immediately take flight. For those intending to ascend, one must abstain from grains for a full year before consumption.\n\nIn general, for those who consume divine elixirs and great medicines, following the scriptural prescribed days ensures effortless ascent to heaven. Consuming half the dose grants longevity without death, becoming an earthbound immortal without doubt.\n\nHere ends the *Middle Scroll of the Scripture and Oral Instructions on the Elixir of the Cavernous Heart*.\nHere begins the *Lower Scroll of the Scripture and Oral Instructions on the Elixir of the Cavernous Heart*.\n\nThe Venerable Heir of the Supreme Ultimate Realized One personally transmitted *The Sage Annals of the Yellow Emperor*, which states: In the first year of the Yellow Emperor’s reign, on the first *yin* day of the *yin* month, he fasted at Mount Shou. Fang Ming and Mu Li followed the Yellow Emperor above, where they visited the Great Court Lord at Mount Juci and received from him *The Divine Mushroom Spirit Charts* in twelve scrolls and *The Gold and Silver Formulas* in nineteen sections. The Yellow Emperor then ascended Mount Wangwu, opened the stone casket, and uncovered the jade lid, obtaining the Way of the Nine Cauldrons’ Divine Elixir and the Flying Snow Furnace Fire. On Mount Emei, the Yellow Emperor met the August Person and respectfully sought the Dao of divine transcendence. The August Person said: “Do you not know that Heaven possesses the Dark One, born of the right yang, named Flowing Pearl, the gate of all mysteries? If you obtain and cultivate it, you may attain longevity, ascend the clouds and soar through the skies, and ascend to pay homage to the Jade Emperor.” The Yellow Emperor bowed and received the teaching. On Mount Jing, he cast a golden crucible and compounded the Great Return Divine Elixir of Flowing Pearl, transmitting it to later generations. At Dingshu Pond, he consumed the elixir and ascended. At that time, seventy-two great ministers who had also consumed the elixir ascended with the Yellow Emperor. Previously, the Yellow Emperor, fearing the Way of the Golden Elixir would be lost, entrusted it to his eldest son, commanding him to transmit it to later generations. He admonished that this Way is most weighty and must be transmitted only to the worthy. If entrusted to the unworthy, they bring calamity upon themselves. Later, the eldest son transmitted it to Master Shushan, and from then on, the sagely transmitted to the sagely, the worthy to the worthy, and the benevolent to the benevolent. Those who attained the Dao were beyond count. Heaven’s love for humanity is profound, yet people, if their hearts do not align with the Dao, inherently make success difficult.\n\n**Song of the Internal Elixir of the Supreme**\nThe essence of true lead lies within primordial chaos,\nBorn before Heaven and Earth.\nWhen chaos divided, the four images took form,\nAnd the five phases were established.\nGrasping the root of Heaven and Earth, the embryo of nature and life is founded,\nHarmonizing with the cycles of cold and heat.\nRoaming leisurely in the cinnabar terrace,\nAfter ten months, like a child emerging from the womb,\nOne obtains this mysterious pearl,\nAnd spiritual illumination naturally arrives.\n\n**Excerpts from the External Elixir Scripture of the Supreme**\nThe Great Dao preserves the true; the three grades serve as its rule.\nOne is its measure, rectitude its virtue.\nThus, refining the golden liquid is the divine method.\nSubtle mystery and pure emptiness—none attain the Dao without the golden tally.\nTreading the nine depths and entering the dark,\nAscending and descending through the void,\nOne attains ascent through spiritual illumination.\nThereupon, he transmitted with joy *The Supreme Clarity Eight Talismans Scripture*, *The Supreme Clarity Scripture on Observing Heaven*, *The Nine Capitals Scripture*, *The Divine Elixir Scripture*, *The Golden Liquid Scripture*, and the oral instructions on the eight refinements, nine revolutions, returning elixir, and fire-taming.\n\nIts formula states:\nGolden liquid returning elixir, immortal blossom flowing pearl.\nSoaring high through clouds and mist, ascending to the celestial mounds.\nYellow and red substances, obtained in an instant.\nMale and female scattered pearls, enabling transformation and transcendence,\nSummoning the traveling kitchen.\nDivine persons and jade maidens accompany me in roaming,\nEntering and exiting without question, in harmony with Heaven.\nIts essence congeals like frost, skillfully achieving sinking and floating.\nIf you reverently heed this, you shall surely wander the immortal capital.\nThe oral instructions on the golden liquid are complete herein.\n\nIts essence: cinnabar, mercury, and saltpeter liquid flowing pearls,\nUsed to compound the divine elixir.\nConsuming one *daogui* allows ascent to the celestial palace.\nWhen the elixir is complete and made into gold,\nIt may be used as dining vessels, thereby attaining divine transcendence.\nIf you truly desire divine transcendence,\nFirst consume the returning elixir and golden liquid,\nThereby preserving your spirit, and you shall ascend to Heaven,\nBecoming a perfected person above.\nIf you do not consume the returning elixir and golden liquid,\nYou shall suffer cold, dampness, and wind spirits striking you,\nAnd the Controller of Destinies will be unable to save you.\nThe Dao is thus—how can you not exert yourself?\nYou should wear warm clothing, eat sparingly,\nAdapt to the body, and preserve emptiness.\nIn emptiness and naturalness, even ghosts cannot kill you.\nWhen your years and lifespan reach their end, you shall simply die.\nWhy say this? Because without firmness and spirit, one perishes.\nIt is like the myriad things that grow—not desiring death,\nBut naturally aging, withering, decaying, and dying.\nPeople are the same.\nIf I bring misfortune upon myself,\nDemonic beings test people, fierce beasts harm people,\nSnakes and centipedes sting them.\nFormerly, Zuo Yuanfang, through concentrated meditation at Mount Tianzhu,\nAttracted divine persons, who transmitted to him the *Divine Elixir Immortal Scripture*.\nDuring the great chaos at the end of the Han,\nHe had no leisure to compound the elixir and fled to the lands east of the Yangtze,\nResolving to visit famous mountains to cultivate this Way.\nHe transmitted the *Divine Elixir Scripture* and other texts to his disciple, Immortal Master Ge,\nWho in turn transmitted them to his disciple, Master Zheng.\nMaster Zheng, being poor and unable to purchase ingredients,\nHad his disciple Ge Hong, who served him diligently and assiduously,\nEstablish an altar at Mount Maji and transmit to Hong the elixir scriptures and various oral instructions.\nHe said to Hong: “I received the admonition of my former master, Master Zuo, that one must not reside and compound the divine elixir in small mountains.\nMoreover, in small mountains, there are no true spirits,\nOnly the essences of trees, thousand-year-old creatures, and blood-consuming ghosts.\nThese beings are of perverse qi, not wishing people to cultivate the Dao and perform good deeds,\nBut only desiring to bring calamity upon them.\nEven if a person of purity and refinement uses arts and numbers to protect themselves,\nGhosts and demons may still spoil their medicine.\nNow, when physicians compound fine medicines and good ointments,\nThey still do not wish chickens, dogs, women, or children to see them.\nIf the medicine is seen, its efficacy is lost.\nMoreover, dyed and colored objects, when seen by ill-intentioned eyes, lose their luster.\nHow much more so for the great medicine of divine transcendence and longevity?\nAncient Daoists compounding divine medicines\nInevitably entered famous mountains in uninhabited lands,\nNever stopping in small, ordinary mountains—precisely for this reason.\nFurthermore, according to the immortal scriptures,\nMountains where one may concentrate and compound immortal medicines include:\nMount Tai, Mount Hua, Mount Huo, Mount Dai,\nMount Song, Mount Shaoshi, Mount Taibai, and Mount Zhongnan.\nThese mountains all possess true spirits,\nWithin them reside earthbound immortals,\nAnd they produce *zhi* herbs that can avert great calamities.\nNot only are they suitable for compounding medicines,\nBut if a person of the Dao ascends them,\nThe mountain spirits will surely assist them in attaining good fortune,\nAnd their medicines will certainly be completed.”\n\nGreat mountains possess great spirits; small mountains possess small spirits. Without methods of avoidance, one will inevitably encounter harm. This may manifest as illness, sudden fright, injuries from thorns or blades, hearing strange sounds, encountering anomalies, witnessing apparitions, or seeing great trees topple without wind, or cliffs and boulders crumble without cause. One may become disoriented, run wildly, and fall into ravines, or be harmed by fierce beasts and venomous snakes—thus, one must not enter lightly.\n\nWhen entering mountains, one should choose days of seasonal vigor, when the heavenly stems and earthly branches mutually engender, for these are auspicious. Mount Tai forbids entry in *jia-yi* (甲乙) years and *yin-mao* (寅卯) months; Mount Heng in the south forbids entry in *bing-ding* (丙丁) years and *si-wu* (巳午) months; the Central Peak forbids entry in *wu-ji* (戊己) years and *chen-xu-chou-wei* (辰戌丑未) months; Mount Hua in the west forbids entry in *geng-xin* (庚辛) years and *shen-you* (申酉) months; and Mount Heng in the north forbids entry in *ren-gui* (壬癸) years and *hai-zi* (亥子) months. Wherever one goes among these mountains, if the region belongs to a particular peak’s domain, all such years and months are forbidden.\n\nThe *Lingbao Scripture* states: When entering mountains, one should choose *bao* days, *yi* days, or *zhuan* days—all greatly auspicious. If one enters on *zhi* days or *fa* days, death is certain.\n- *Bao* days are when the heavenly stem engenders the earthly branch, such as *jia-wu* (甲午) or *yi-si* (乙巳).\n- *Yi* days are when the earthly branch engenders the heavenly stem, such as *ren-shen* (壬申) or *gui-you* (癸酉).\n- *Zhi* days are when the earthly branch restricts the heavenly stem, such as *wu-zi* (戊子) or *ji-hai* (己亥).\n- *Fa* days are when the heavenly stem restricts the earthly branch, such as *jia-shen* (甲申) or *yi-you* (乙酉).\n- *Zhuan* days are when the heavenly stem and earthly branch are in harmony, such as *jia-yin* (甲寅) or *yi-mao* (乙卯).\n\nWhen entering famous mountains, one should choose the *jia-zi* day of the opening or removal phase, and hang five-inch strips of five-colored silk on stones—whatever is sought will surely be obtained. Entering famous mountains during the *gui* hour is called the \"Day of Heaven’s Heart,\" and one will certainly attain the Dao and transcend the world.\n\nAuspicious days for entering mountains include *jia-zi*, *jia-wu*, *jia-yin*, *yi-hai*, *yi-mao*, *yi-si*, *bing-xu*, *bing-wu*, and *bing-chen*—all greatly auspicious, ensuring safety and the attainment of the Dao.\n\nDays to avoid in a long month: the 3rd, 11th, 15th, 18th, 24th, 26th, and 30th.\nDays to avoid in a short month: the 1st, 5th, 13th, 16th, and 28th.\nIf one enters mountains on these days, the mountain spirits will test them, and whatever is sought will not be obtained, nor will any endeavor succeed. Not only Daoists must avoid these days—ordinary people entering mountains on such days will meet with misfortune, encountering tigers, wolves, and venomous creatures.\n\nWhen entering mountains, one should know the secret art of the Six *Jia*: recite the incantation, *\"Lin bing dou zhe jie zhen lie qian xing.\"* Silently recite these nine characters, and nothing evil will be unaverted—this is an essential method, not to be neglected.\n\nAdditionally, avoid entering mountains on the following monthly taboo days:\n- First month: *wu* (午) day\n- Second month: *hai* (亥) day\n- Third month: *jia* (甲) day\n- Fourth month: *wu* (戊) day\n- Fifth month: *xu* (戌) day\n- Sixth month: *shen* (申) day\n- Seventh month: *jia-zi* (甲子) day\n- Eighth month: *jia-wu* (甲午) day\n- Ninth month: *yin* (寅) day\n- Tenth month: *chen* (辰) day\n- Eleventh month: *yi* (乙) day\n- Twelfth month: *chou* (丑) day\n\nIn ancient times, when entering mountains to compound the elixir and seek the Dao, one would purify oneself and carry the *Writings of the Three Sovereigns* and the *True Forms of the Five Peaks*. By summoning the mountain spirits and consulting the *Register of Ghosts* to invoke the local deities and mountain marshals, one would learn of the anomalies among trees and stones, and the spirits of mountains and rivers, so they would not dare to test the practitioner. All malevolent entities would naturally flee far away. When the Yellow Emperor journeyed east to Green Mound and met the Master of the Purple Palace, he received the *Writings of the Three Sovereigns*—this was to summon the myriad spirits.\n\nWhen entering mountains to compound the elixir, the method to repel the hundred spirits and ghosts of mountain shrines relies most critically on talismans. The great medicines of immortals also depend on the power of talismans for protection. The art of talismans was transmitted by Laozi to divine beings. That people today use them with little efficacy is due to errors in transmission and copying, as well as a lack of sincere faith, rendering their application futile.\n\nYet while the attainment of longevity fundamentally depends on the elixir rather than talismanic power, talismans cannot be abandoned, for they repel ghosts and evil, aiding the gradual refinement of the elixir.\n\n**Talisman for Summoning the Lord of Lofty Mountains**\nThis talisman, when purified for ten days, summons the Lord of Lofty Mountains to dispel harm from tigers and wolves. The talisman is inscribed in cinnabar on silk, twelve inches in length. While writing, one must not pause to speak. Upon completion, burn incense and, in the purification chamber at night, align with the monthly branch, don new garments, and perform the summoning.\n\nWhen using talismans, place large characters on the left and right before the heart, constantly visualizing their proper form. Summon the *liu jia* attendant talismans and the names of the Jade Maidens, reciting the invocation while gazing upward and envisioning the spirits—each five feet tall, clad as described in the *Scripture of the Six Jia*. This is the mountain-climbing talisman.\n\nWhen Immortal Chen Anshi entered the mountains, he inscribed this talisman on white silk on a *jia-yin* day, faced the Northern Dipper at night, and offered wine and dried meat. Stating his name, he placed the talisman in his collar to repel evil spirits, hundred ghosts, old creatures, tigers, wolves, and venomous insects. When placed on a table, it should face the Northern Dipper.\n\nThis talisman’s strokes differ slightly from the previous one, but its method of use and efficacy remain the same—thus, both are preserved. Inscribe it in cinnabar on silk, wear it on the left arm (right for women), or write it on white silk to wear. It may also be placed at the four corners of one’s dwelling. When moving, have someone retrieve it first.\n\nThis is a great talisman of the gods—do not transmit it carelessly.\n\nThis talisman, too, is for mountain entry, with identical efficacy. It is one of the thirty-nine secret talismans of the *Yellow Court*, repelling hundred ghosts. Wherever one compounds immortal medicines or resides in the deepest recesses of famous mountains, no one must be present.\n\nWherever one keeps traces of livestock, there must be a stream confined by water, within a great stone cavern. If no such cavern exists, one may construct a chamber deep in the forest where no human tracks are found—always near water. Without such a place, do not attempt to compound divine medicines. In great mountains lacking a confined stream, a westward-flowing one will suffice.\n\nOnce a mountain dwelling is secured, inscribe cinnabar on cypress boards, filling them with large talismanic script. Place these above the door, at the four corners and four directions of the dwelling, and along the paths one frequents, every fifty paces, to repel all spirits. This talisman wards off wolves and tigers, and when moving, the boards may be carried to dispel mountain spirits.\n\nMost Dao practitioners dwell in mountains and forests—dens of tigers, wolves, venomous snakes, and spectral creatures. Without deep precautions, harm will befall one’s medicines.\n\nThe talisman for repelling a hundred snakes also serves as a charm against tigers and wolves. These two divine seals are carved from jujube wood, two inches square. After setting up an offering and bowing twice to invoke them, wearing them proves highly effective. This is the seal of the Jade Maiden of the Vermilion Palace, taught by the Yellow-Headed Instructress, which keeps tigers and wolves at bay. It may also be written in cinnabar as a talisman and swallowed before entering mountains to repel such beasts, or used as a seal, as recorded in the *Scripture of the Jade Embryo*.\n\nThis talisman repels ghosts. When compounding medicines, hang it on all four sides to subdue all spirits—greatly efficacious. One version has seven curves at its center; the rest remains the same, though some may be mistaken.\n\nThis mountain-residence talisman, inscribed on cypress boards and placed at the four corners of a door, prevents tigers and wolves from approaching. The three talismans above are all written in cinnabar.\n\nThe *Tun* talisman has one version with a *tun* character at its base.\n\nThis is the *Mountain-Opening Talisman*. Write it in cinnabar on a petition made from thousand-year-old *lei* vine, twelve inches long, and press it onto the great stones of a famous mountain—the mountain gate will open, revealing treasured scriptures, and gold and jade will appear. The thousand-year-old *lei* vine, also called *tianci*, resembles a mouse’s ear and repels ghosts and demons.\n\nWhen constructing a cinnabar chamber deep in the mountains, hang bells at the four corners and place ghost-repelling medicines and talismans on all sides before compounding medicines. Otherwise, spirits will drain the essence of the medicines or alter them—thus, talismans must be used to suppress and ward them off.\n\nThe method for ghost-repelling medicine: combine equal parts luminous cinnabar, realgar, orpiment, musk, aconite, white rice, *ghost’s umbrella*, and *ghost’s arrow*, forming honeyed pills to carry.\n\nOf old, the Yellow Emperor received the *Elixir Scripture* from the Dark Maiden and sought the True Unity from the August Person. Thus it is said: the immortal formula for longevity lies solely in the Golden Elixir; the sole method for preserving form and repelling evil is the True Unity—ancient sages held it in the highest regard.\n\nThe immortal scriptures state: the *Nine-Transformations Golden Elixir Scripture* and the *Guardian Unity Formula* are both concealed within the Five Cities of Kunlun, stored in jade cases bound with gold straps, sealed with purple mushrooms, and stamped with the Central Seal—this is the most sacred and secret method of the highest sages.\n\nIf bodily ailments are not yet cured, the divine elixir not yet completed, one’s lifespan not yet fixed, and myriad evils not yet dispelled, the Way of Guarding Unity must not be unknown. Entering mountains while guarding unity ensures no poisons dare approach, and without need for other methods, all evils depart of their own accord.\n\n**Method for Constructing a Cinnabar Chamber**\nFirst, select a secluded place deep in the mountains, near water and beneath a hanging cliff, where traces of humans and livestock are absent. Apply talismans and seals to the chamber and its courtyard. The chamber should be twelve paces square and fourteen feet high, with a southern-facing door. Ensure a stream flows eastward before the door, with the sun to the east and the moon to the west. Plaster the interior and exterior with fragrant mud, and inscribe the main cinnabar talismans on the four walls.\n\nWithin the chamber, erect the Five Peaks and Three Terraces. Against the western wall, construct a layered altar to arrange medicinal herbs, the *Divine Elixir Scripture*, and its formulas and catalogues. Then, the spirits of living medicines will guard it, and no spirits will dare interfere.\n\n**Method for Protection and Warding When Compounding Elixirs**\nBefore compounding an elixir in the mountains, first secure a dwelling, then summon the mountain spirit to inquire whether it is permissible—only then may one proceed safely, with certainty of success. The method is as follows; these subsequent methods are the talismans used by the Immortal Elder.\n\nFast for ten days, then write on a one-foot yellow silk in cinnabar, amidst mountain grasses, to summon the Lord of the Central Peak. Before compounding the divine elixir, first inquire about the proper procedures using this talismanic script.\n\nOn the day the Old Master compounds the divine elixir, write in cinnabar on an eight-inch white silk, place it in a crimson pouch, and tie it before the heart. One who wishes to ingest the elixir should fast for seven days before consuming it, whereupon they will attain spiritual communication and command spirits—this is called the *Eight-Inch Silk Talisman of the Great Unity*. This talisman, when ingested by one compounding the elixir, opens the heart—do not defile it.\n\nThe *Treasure Scripture of the Divine Elixir of Great Clarity* refines the eight stones, the five luminaries and seven radiances, the treasure of the Dark Palace, controlling the spirits of fire. After nine transformations, it ascends as blossoms to the Great Clarity. Upon completing the incantation, place the talisman in a blue-green brocade pouch and wear it around the neck. This talisman restrains the essence of stones, preventing them from flying away, filling the crucible with mist and frost, and causing the divine blossoms to congeal.\n\nThe *Harm-Repelling Talisman*, written in cinnabar on white paper, three inches wide and four inches long, is cast into the furnace to subdue the essence. One should constantly perceive divine light intensifying, with all spirits arriving and immortals and jade maidens appearing. Then the divine elixir is complete, and no ghosts or demons of heaven and earth can harm it.\n\nThe method states: Those who wish to create the divine elixir, transforming the five stones and producing the five metals, must first pay homage to the Heavenly August Lord of the Dao and receive the five divine talismans—then the five stones and five metals will transform at will, their essences competing to emerge.\n\n**Method for the Talisman of the Green Emperor**\nOn *jia-yi* days, use white cogon grass as a mat, three feet long. Spread a twelve-foot length of green silk over the mat, with two cups of wine and two strips of dried meat. Use the silk as a base, write the talisman in ink, two inches wide and seven inches long, and place it on the mat.\n\nThe incantation states: On an auspicious day and hour, this humble servant [Name] bows twice and reverently receives the Green Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\nHere follows one talisman diagram—any discrepancies in transcription must be carefully examined.\n\n**Method for the Talisman of the Red Emperor**\nOn *bing-ding* days, use white cogon grass as a mat, three feet long. Spread a thirteen-foot length of crimson silk over the mat, with two cups of wine and two strips of dried meat. Write the talisman in cinnabar, two inches wide, and place it on the mat.\n\nThe incantation states: On an auspicious day and hour, this humble servant [Name] bows twice and receives the Red Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and swallows it.\n\n**Method for the Talisman of the Yellow Emperor**\nOn *wu-ji* days, use white cogon grass as a mat, three feet long. Spread an eleven-foot length of yellow silk over the mat, with two cups of wine and two strips of dried meat. Use vermilion as the base and write the talisman in purple, three inches wide and seven inches long, then place it on the mat.\n\nThe incantation states: On an auspicious day and hour, this humble servant [Name] bows twice and receives the Yellow Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\nThe above talismans, though distinct, are not to be placed near one another—each is a separate talisman, and care must be taken in their use.\n\n**Method for the Talisman of the White Emperor**\nOn *geng-xin* days, use white cogon grass as a mat, three feet long. Spread an eleven-foot length of white silk over the mat, with [two cups of wine] and two strips of dried meat. Use green as the base and write the talisman in cinnabar, [two inches wide] and seven inches long, then place it on the mat.\n\nThe incantation states: On an auspicious day and hour, this humble servant [Name] bows twice and receives the White Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\n**Method for the Talisman of the Black Emperor**\nOn *ren-gui* days, use white cogon grass as a mat, three feet long. Spread an eleven-foot length of black silk over the mat, with two cups of wine and two strips of dried meat. Use black as the base and write the talisman in cinnabar, two inches wide and seven inches long, then place it on the mat.\n\nThe incantation states: On an auspicious day and hour...\n\nAt this auspicious day and hour, the humble servant [Name] bows twice and receives the Black Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\nThe preceding five divine talismans of the Emperors, and the subsequent four talismans where each mentions \"Xuan,\" refer to the taboo name used by the immortal elder when receiving them. Write two copies of each: burn and ingest one, and wear the other on the head. These are especially effective for alchemical transformations and should be prepared ten days prior to the desired time of elixir refinement.\n\nThe Great Elixir is the essence of metal and fire, treasured by perfected beings. Those who ingest it attain divine transformation, longevity, and eternal vision, command the hundred spirits, and ascend to the Great Clarity. Yet common folk merely know the titles of elixir scriptures but remain ignorant of the taboos in elixir refinement. Though they obtain the formula, they fail to succeed—this is the reason.\n\nFor those who wish to refine the divine elixir, there are five prohibitions, three taboos, four defeats, and six fears. If violated, the elixir’s essence scatters, its numinous radiance dissipates, its divine light sinks, and its frost-like brilliance is lost. Ingesting it brings no benefit—one cannot be too cautious.\n\nThus, the perfected one inquired about these details. The Dark Master replied:\n\n**The Five Prohibitions:**\n1. When compounding the medicine or kindling the fire, avoid the \"dead days\" of the Five Stones: *ren-chen* in spring, *gui-si* in summer, *bing-xu* in autumn, and *ding-chou* in winter. Using these days causes the stone essence to perish, forming toxic compounds—utterly useless.\n2. When purchasing ingredients or discussing elixir matters, avoid the \"inauspicious birth days\" of the Five Evils: *ren-yin* in spring, *gui-si* in summer, *ren-shen* in autumn, and *gui-hai* in winter. Entering mountains to refine the divine elixir on these days yields no success; spirits offer no protection, and demonic forces ruin the work.\n3. When refining the divine elixir in renowned mountains, avoid the \"injurious and severed days\" of the Five Peaks: *geng-yin* in spring, *gui-wei* in summer, *bing-shen* in autumn, and *ding-chou* in winter. Entering mountains to refine the elixir or gather magical herbs on these days results in spirits recording one’s soul, elixirs spoiling, and illness or bodily harm.\n4. When preparing the crucible, furnace, or sealing the elixir with clay, avoid the \"heaven-opening and earth-splitting days\": *bing-xu* and *bing-chen* in spring; *xin-wei* and *xin-chou* in summer; *ren-chen* and *ren-xu* in autumn; *gui-wei* and *gui-chou* in winter. Refining the elixir on these days causes the chamber to open spontaneously, stone essence to scatter and dissipate, and the elixir’s radiance to fail.\n5. For men refining the elixir, avoid the third day of the seventh month and *jia-yin* in the seventh month. For women refining the elixir, avoid the seventh day of the first month and *geng-shen* in the first month. These four days are when stone essences battle and ghosts assemble. Kindling the fire on these days prevents the elixir’s essence from manifesting, numinous forces from responding, and malevolent spirits from intruding—all leading to calamitous failure.\n\n**The Three Taboos:**\n1. Weeping or grieving while refining the elixir.\n2. Uttering the names of elixir-destroying demons.\n3. Encountering inauspicious defilements such as death, childbirth, or impurity.\nViolating these taboos causes the stone essence to mourn and congeal, the fivefold radiance to dim, and the elixir to become poisonous—ingesting it kills. All who are sorrowful, weeping, or near corpses and defilements must not approach the elixir furnace or related tasks. Additionally, the elixir has slaying demons and malevolent ghosts—one named *Bu-zi* (character unclear), styled *Hunni Xi*. On the day of kindling the fire, avoid speaking these names. If violated, ghostly soldiers intrude, the divine furnace shatters, and the essence scatters.\n\n**The Four Defeats:**\n1. The land lacks elixir *qi*—meaning it is not a numinous site.\n2. Envious or resentful people—meaning those with evil eyes who see the divine medicine bring demonic misfortune.\n3. Unsuitable companions.\n4. The five pungent foods, foul substances, and burning chicken or dog hair.\nThese four defeats are the greatest prohibitions for the Eight Stones—none may be violated.\n\n**The Six Fears:**\n1. On the day of sealing the medicine or kindling the fire, fear encountering wind, rain, or thunder.\n2. While refining the elixir, fear hearing calls for souls.\n3. *(Omitted in text.)*\n4. *(Omitted in text.)*\n5. Fear hearing sounds of lamentation.\n6. Fear encountering blood, filth, or defilement.\nThese six fears are all forbidden for the divine elixir. Hearing or violating them startles the divine essence, disturbs the numinous *qi*, and causes harm.\n\nThe Immortal Inquiry states: To ingest the first elixir, the Flowing Pearl of Nine Cycles, or the Elixir Radiance—on a *jia-zi* day at dawn, face the sun, bow twice, kneel, and ingest a grain the size of millet. Immediately, one becomes an immortal and ascends to the Nine Heavens. Ingesting half a millet grain makes one an earthbound immortal, unburned by fire, undrowned by water, untouched by myriad evils, unharmed by blades, freely transforming, moving without hindrance, commanding ghosts and spirits, and living as long as heaven and earth. To depart this world, ingest another half-grain of millet to ascend to heaven. To deliver a mortal, ingest a grain the size of a small bean to ascend as an immortal that very day. Ingesting half a small bean makes one an earthbound immortal. For beasts, ingesting a grain the size of a large bean causes immediate ascent to heaven. Thus, birds become phoenixes, beasts become unicorns, snakes become dragons, ghosts become spirits, women become jade maidens, and men become immortals.\n\nMix snake fat into four pills, each the size of a crossbow pellet, and bury them at the four corners of one’s dwelling. The house transforms into a red dragon, lifting the entire residence seven thousand feet into the air, turning it to gold and jade, and traveling wherever desired. Burying one pill the size of a chicken’s yolk—whether near or far, within a thousand *li*—penetrates nine springs below, causing all rivers, mountains, and forests within to ascend to heaven.\n\nTake one *jin* of fine, firm yellow earth with tight grain, grind it finely, sift it, and boil it in bubbling water three times. Add one *zhu* of the substance, cook thoroughly, and stir until the water evaporates—it transforms into gold.\n\nThe Immortal Elder said: When various elixirs are completed and consumed, they are often classified by men into three grades—upper, middle, and lower. The superior adept ascends to transcendence in seven days; the lesser adept, after seventy days, attains immortality. The foolish man, consuming it, becomes immortal only after a year. Should one dare to ingest a full *daogui* measure with utmost sincerity, they will briefly die for half a day before reviving, as if awakening from sleep. This is the utmost limit of elixir refinement; one must adhere to the formula, using half a millet grain as the measure.\n\nI have heard that failure in Daoist cultivation arises from eight causes:\nFirst, one may know a single thing and claim it sufficient, toiling over the crucible and flame yet achieving nothing by white-haired old age.\nSecond, though encountering a wondrous formula, one doubts its authenticity, seeking endlessly until death seals the coffin.\nThird, unable to distinguish truth from falsehood and lacking a master’s guidance, the mind remains unsettled, squandering time in vain.\nFourth, relying on one’s own cleverness, one neglects the teachings, boasting of attainment while failing to exhaust the master’s wisdom.\nFifth, true formulas and secret instructions are not easily found; believing them hidden in perilous mountains, one risks life in pursuit.\nSixth, lacking the means to cultivate, pressed by hunger and cold, one gains as if not gaining, knows as if not knowing.\nSeventh, lacking single-minded devotion and no reserves of resources, when a true master appears, one hesitates and does not act.\nEighth, the master one encounters is base and inferior, hoarding shallow knowledge, unwilling to teach fully. Claiming \"the Dao is not in abundance,\" they falsely treasure secrecy, leading disciples to cling to worthless methods like the man waiting by the stump.\n\nThe Immortal Elder said: In compounding elixirs, one should seek the Dao and nurture the true, not covet worldly profit or glory. Those who craft *huangbai* (transmutative gold) will find no favor with the numinous spirits; ghosts will disturb their resolve, bringing misfortune, premature death, and untimely harm. Exercise utmost caution and do not recklessly transmit to the unworthy. Those not of like mind must not be lightly entrusted with these secrets, lest calamity and divine retribution follow.\n\nThe Immortal Scriptures say: Those recorded in the registers of immortality—those who scheme against them die, those who violate them suffer annihilation of their lineage, and those who hate them perish.\n\nHere ends the *Lower Scroll of the Heart-Refining Elixir Canon’s Secret Instructions*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "约出於唐宋。 系抄录《抱朴子内篇》、《黄帝九鼎神丹经诀》等书改编成，假托太极真人嗣孙手述。 三卷。 底本出处：《正统道藏》洞神部众术类。 上洞心丹经诀卷上 太极真人嗣孙手述 仙翁曰：欲求神仙，当得至要。 至要在宝精行气，服食大药。 虽云行气，而行气有数十法，大要在还精补脑。 虽云服气，而服气之法百余事，大要在胎息。 虽云服药，而服药之方千余条，大要在金液还丹。 诀曰：宝精行气数十法，此不具载。 其大要在还精补脑者。 其法须於子后午前六阳之时为之，或子后丑前，或身中肠生之时而为之，善矣。 於此时入靖，或不拘行住坐卧，亦可。 须当内外贞白，专气致柔如婴儿。 然后自玉堂尾问起火行气，直过夹脊双关，上入三山，直至玉京山，久则自然脑满。 三一九室之妙道，实在於斯焉。 诀曰：服气之法百余事，如非姻碧霭，中黄玄黄，沆淦沦汉，紫霞青芽，惧灵望舒，灵晔钦炎，九呈五精，皆服气之法，若此未易详言。 而胎息一法，实为服气之大要。 其法始焉，必用震卦时入靖，或不拘行住坐外，必要内外贞白，专气致柔如婴儿。 然后如子居母腹，呼吸在玄牝之根，绵绵若存。 久久服之，直使一万三千五百息，息息入胎。 一日十二时百刻，刻刻调和。 小则骨正筋柔，肤若凝脂，百病不侵，延年不死。 大则入水不溺，入火不焚，脱胎换骨，隐显变化，身外有身，与道合真，其道在人耳。 此二要诀者，内丹之道要，於斯毕矣。 诀曰：仙翁云服药之方千条，末学岂能周知，其大要在金液还丹者。 今古登真达道而成仙者，未有不由金液还丹，而能成者也。 其金液还丹者，外丹也。 古圣炼法，有无中生有之金液还丹者，上也。 此乃上古圣圣以心传之，不留文字，而至秘者也。 要之非凡俗所可知，非末学所能成。 其炉鳌鼎器，采药进火之法，实未可轻泄於言语文字之问。 斯丹一成，拔宅飞去，变化其可量乎。 其有九鼎飞伏金液还丹者，次也。 此亦圣贤授受，以口传之，岂文字能尽者。 中问取玄黄华，造六一泥，漆土釜，固神炉，作华池，生神水，酿春嘐，酝左味，采药材，进火候，一切飞伏返还金液之法，非至士真人不能炼，岂下愚凡俗之所能获也。 今仙翁玉岌所珍心丹一方，乃太上上洞仙经之所载，金液还丹之次方也。 药材乃九鼎中之第一性味，乃八石中之上等。 制炼有方，转炼无异，不用杂类，止用一珍，九转炼之，而成金液还丹，自换骨而至飞升，井井有条，接引真仙，上入太清，与无中生有之金液还丹，殊途同归，功用不异，实为至道不烦之妙也。 凡世希有之仙方也。 仙翁曰：传受之法，取旺相吉日，先斋戒沐浴，立坛，设太上一座於水上，於无人之地，烧香上白，欲以长生之道，用传某甲，及丹经盟信之物，着案上，置座在此，今欲受道。 向北伏一时之中，若天晴无风，可受之，共饮白鸡血为盟，乃投信物於水中。 万兆无仙骨者，终不见此内外金液还丹之道也。 故吾师云，一代之中，不过二三人得之。 又云，八极之内，将诅几人见知秘诀，难闻得之者少，必盟誓方事相传。 长生神仙之药，神秘至重，万金不传，必授贤者。 若有传者，限百年内得传一人，敌血为盟，而后传之。",
      "translated_text": "The present text emerged during the Tang and Song dynasties, compiled from excerpts of the *Baopuzi Neipian* and *Huangdi Jiuding Shendan Jingjue*, among others, and falsely attributed to the hand of the Primordial Perfected One’s descendant. It comprises three scrolls. The source text is from the *Daoist Canon of the Zhengtong Era*, under the \"Miscellaneous Arts\" category of the *Dongshen* section.\n\n**Upper Scroll of the *Upper Cavern Heart Elixir Manual***\n*Transcribed by the Descendant of the Primordial Perfected One*\n\nThe Immortal Elder said: To seek transcendence, one must grasp the essentials. The essentials lie in treasuring essence, circulating qi, and ingesting the great elixir. Though it is said to circulate qi, there are dozens of methods for doing so, but the crux lies in returning essence to replenish the brain. Though it is said to ingest qi, there are over a hundred techniques for doing so, but the crux lies in embryonic respiration. Though it is said to ingest elixirs, there are over a thousand formulas, but the crux lies in the Golden Fluid Returned Elixir.\n\nThe manual states: The dozens of methods for treasuring essence and circulating qi are not recorded here in full. Their essential principle lies in returning essence to replenish the brain. The method requires practice during the six yang hours after midnight and before noon, or between midnight and the hour of the ox, or when the qi in one’s body is nascent—this is most effective. At such times, enter stillness, and it may be practiced regardless of whether one is walking, standing, sitting, or lying down. One must maintain inner and outer purity, concentrating the qi to achieve the suppleness of an infant. Then, starting from the Jade Hall and the Tail Gate, kindle the fire and circulate qi, passing directly through the Double Pass of the Spine, ascending into the Three Peaks, and reaching the Jade Capital Mountain. With prolonged practice, the brain will naturally become full. The wondrous Way of the Three Ones and Nine Chambers truly lies herein.\n\nThe manual states: There are over a hundred methods for ingesting qi, such as \"Marrying the Azure Mist,\" \"Central Yellow and Mysterious Yellow,\" \"Vast and Flowing Han,\" \"Purple Radiance and Green Sprout,\" \"Revering the Numinous Moon,\" \"Spiritual Brilliance and Respectful Flame,\" \"Nine Manifestations and Five Essences\"—all techniques of qi ingestion, which cannot be easily expounded in detail. Yet embryonic respiration is the essential method among them. At the outset, one must enter stillness during the time of the *Zhen* trigram, or practice regardless of whether walking, standing, sitting, or lying down, but always maintaining inner and outer purity, concentrating the qi to achieve the suppleness of an infant. Then, as if dwelling in the mother’s womb, breathe at the root of the Mysterious Female, continuously and subtly. With prolonged practice, one will achieve 13,500 breaths, each breath entering the embryo. Each of the twelve double-hours and hundred quarters of the day must be harmonized. In lesser attainment, the bones become upright, the sinews supple, the skin smooth as congealed fat, all illnesses are repelled, and one’s years are prolonged without death. In greater attainment, one enters water without drowning, enters fire without burning, sheds the mortal frame and changes the bones, conceals or reveals the form at will, manifests a body beyond the body, and unites with the Dao as a true being. This Way lies within human capacity.\n\nThese two essential manuals summarize the essentials of the inner elixir.\n\nThe manual states: The Immortal Elder said that though there are a thousand formulas for ingesting elixirs, how could a novice comprehend them all? The essential principle lies in the Golden Fluid Returned Elixir. Since ancient times, none who have attained perfection and realized the Dao to become immortals have succeeded without the Golden Fluid Returned Elixir. This Golden Fluid Returned Elixir is an external elixir. The supreme method of the ancient sages involves generating existence from non-existence to create the Golden Fluid Returned Elixir. This was transmitted heart-to-heart by the sages of antiquity, leaving no written record, and remains most secret. It is not something the common or unlearned can know or achieve. The methods of the furnace, crucible, cauldron, and vessel, as well as the techniques for gathering ingredients and advancing the fire, truly cannot be lightly disclosed in speech or writing. Once this elixir is accomplished, one may ascend with their entire household, and their transformations are beyond measure.\n\nThe next method is the Nine Cauldrons’ Flying and Concealing Golden Fluid Returned Elixir. This, too, is transmitted orally by sages and worthies, for how could it be fully expressed in writing? It involves extracting the Mysterious Yellow Essence, preparing the Six-and-One Clay, sealing the earthen crucible, securing the divine furnace, creating the Flower Pool, generating divine water, brewing the Spring Wine, fermenting the Left Flavor, gathering medicinal materials, advancing the fire phases, and all the methods of flying, concealing, and returning the Golden Fluid. This is not something the ignorant or common can achieve.\n\nNow, the Immortal Elder’s treasured *Heart Elixir Formula* from the Jade Peak is recorded in the *Supreme Upper Cavern Scripture of the Immortals* and is a secondary formula for the Golden Fluid Returned Elixir. Its ingredients are the foremost in nature and flavor among the Nine Cauldrons and the finest among the Eight Stones. With proper preparation and refinement, and without admixture, using only this single treasure, after nine cycles of refinement, the Golden Fluid Returned Elixir is achieved. From bone-transformation to ascension, the process is orderly, guiding true immortals to ascend into the Great Clarity. Though distinct in method from the Golden Fluid Returned Elixir generated from non-existence, it converges in effect and function, embodying the wondrous subtlety of the unburdensome supreme Way. Truly, it is a rare immortal formula in the world.\n\nThe Immortal Elder said: The method of transmission requires selecting an auspicious day of flourishing vitality. First, purify oneself through fasting and bathing, establish an altar, and set up a seat for the Supreme One above water in a secluded place. Burn incense and make an offering, declaring the intention to transmit the Way of longevity to so-and-so, along with the elixir scripture and tokens of oath, placing them on the altar. Have the recipient face north and prostrate for one double-hour. If the sky is clear and windless, the transmission may proceed. Drink the blood of a white rooster as an oath, and cast the tokens into the water. Those without immortal bones will never behold the Way of the inner and outer Golden Fluid Returned Elixir. Thus, my master said that in each generation, no more than two or three may receive it. It was also said that within the Eight Directions, how few have seen or known these secret manuals. Few indeed hear of them, and transmission requires a solemn oath. The medicine of longevity and transcendence is most sacred and weighty, not to be exchanged for ten thousand gold, and must be entrusted only to the worthy. If transmitted, it may be passed to one person within a hundred years, with an oath sworn in blood, before the transmission is made.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1233,
      "start_sentence": 0,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.12610411643982,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若於至人违负漏泄，天帝谴谪，永谢玄路。 太玄仙都使盟者心迷意乱。 所倾败死，即仙君使精神昏浊，所学不成。 大司录三天，司命臧算伐年，所作不成，受罚於太玄都。 仙翁曰：欲合神丹，当於深山大泽，或穷里旷野无人之处。 若於人中作之，必於高墙厚壁，令中外不见，亦可也。 结伴不过二三人耳。 先斋七日，沐浴五香，置加精洁，勿经秽污丧死嫁娶之家相往来。 仙翁曰：欲市其神药，必先斋七日，以子丑日沐浴，以执日市之。 当於月德地坐，勿与人争贵贱。 玄女曰：作药以五月五日大良，以用七月七日始，以甲子、丁巳、开除之日为善，甲申、乙巳、乙卯次之。 作药忌日，春戊辰、己巳，夏丁巳、戊申、壬辰、己未，秋戊戌、辛亥、庚子，冬戊寅、己未、癸卯、癸酉，及月杀，及支天季、四孟、仲季月收，壬午、丙戌、癸亥、辛巳、月建、诸朔望，皆凶，不可用以起火，合神药。 慎不得与俗问愚人交通，勿令嫉拓多口舌人，不信道者，闻知之也，神药不成。 神药成，便为真人，上天入渊，变化恍惚，可以举家皆仙，何但一身。 俗人惜财，不合丹药，及信草木之药，且草木药埋之即朽，煮、之即烂，烧之即焦，不能自生，焉能生人。 可以疗病益气，又不免死也。 还丹至道之要，非凡所闻。 夫肖形天壤，人最为贵。 限以速老则死，善养则生，生可惜也，死可畏也。 是以道家至秘而重者，莫过此长生之方也。 若长生之药方法，莫过此神丹之道也。 若此道不长生，则古无长生矣。 夫生之在己，其利实大。 论至贵贱，虽爵为公侯，不足以论，比其轻重，虽赏有封畿，不足以百年之寿。 三万余日，幼弱则未有所知，衰迈则欢乐无味。 童蒙昏耄，除数十年，平和喜笑，八九千日。 扬飞电激。 顾盼以尽，今百年者，万中一焉，假或终之，一辰忧迫扰。 所以上士之务，先营长生事定，可以任意，不期羽化，取乐人间，同彭祖之享年，比少君之遐寿。 可以畜妻子，可以居官秩，无亏上下之节，不失人理之欢，实盛事矣。 人之为体，易伤难养，攻毁之者非一条。 过於克剥，剧乎摇拔，精灵固於焦扰，荣卫消於数用，煎熬形器，克削平和，饮食失宜，荣卫过度，当风卧湿，变起膏育，方托命於草木之医，或投诚於祭祀之助，犹渴穿井於高阜，若饥起阱於石田，草木之药，何所补之，神鬼之力，曷能济之。 若命可以草木延，病可以祭祀除，则医人悉长生，巫师永不病。 故经云，不在祭祀事鬼神，不在誓愿多言语，养生之道，唯在神丹。 知之不易，行之实难。 而学道之人少进多退，竞知者众，克终者鲜。 如井不达泉，终为弃井。 故非长生难闻，若闻道行之为难，非行之难，终之难也。 非至明不能察也，非至勤不能学也。 若易得则汉武遇少君已得之矣，易明则刘向案枕中已明之矣。 故黄帝登崆峒而访道，夏禹封金简於玉函，或功就而上升，或道成而仙去，事昭故实，法茂前修者，长生之法。 若不精加功勤，徒学一切旁门无益。 要当时不可失，不俟终日，生前一切之有为，唯有长生之可重。 神丹一成，与天地相毕。 仙翁曰：世之炼灵砂者，乃用抽出砂中汞，配硫黄，二八而成灵砂。 但至一转者，至士服之，可以通灵，故号灵砂。",
      "translated_text": "Should any initiate betray or leak these secrets, Heaven’s Emperor shall punish them, forever barring their ascent upon the Mysterious Path. The Envoys of the Great Mystery Celestial Capital shall strike the oath-breaker with confusion and madness. Ruin and death shall follow, for the Immortal Lords shall cloud their spirit and dull their mind, rendering all their studies vain. The Grand Recorder of the Three Heavens and the Deities of Fate shall erase their allotted years and cut short their lifespan; all their works shall fail, and they shall suffer punishment in the Great Mystery Capital.\n\nThe Immortal Elder said: To compound the divine elixir, one must do so in the depths of mountains and marshes, or in remote wilderness where no one dwells. If working among men, it must be within high walls and thick enclosures, so that neither inside nor outside may witness it—this too is permissible. Companions should number no more than two or three. First, observe a seven-day fast, bathe in the five fragrant waters, and maintain utmost purity. Avoid all contact with the defiled—those in mourning, the newly dead, or households of marriage. Do not come or go among them.\n\nThe Immortal Elder said: To procure the divine medicines, first observe a seven-day fast. Bathe on a *zi* or *chou* day, and purchase them on the day of the ruling stem. Sit in a place of lunar virtue, and do not haggle over price.\n\nThe Mysterious Woman said: The fifth day of the fifth month is most auspicious for compounding the elixir. Begin on the seventh day of the seventh month. The best days are *jiazi*, *dingsi*, and *kai* or *chu* days; *jiashen*, *yisi*, and *yimao* are next. Avoid the following inauspicious days for elixir-making: in spring, *wuchen* and *jisi*; in summer, *dingsi*, *wushen*, *renchen*, and *weiwei*; in autumn, *wuxu*, *xinhai*, and *gengzi*; in winter, *wuyin*, *jiwei*, *guimao*, and *guiyou*. Also avoid the monthly executioner, the seasonal divisions of heaven, the four *meng* and *zhong* months, the *ji* month’s harvest, *renwu*, *bingxu*, *guihai*, *xinsi*, the monthly establishment, and all new and full moons. These are all ill-omened and must not be used to kindle the fire or compound the divine elixir.\n\nTake care not to associate with the vulgar and foolish, nor with those of jealous disposition or loose tongues. Do not let unbelievers in the Dao hear of it, lest the divine elixir fail to form. Once the divine elixir is complete, you shall become a Perfected One—able to ascend to heaven or plunge into the abyss, transforming at will. Your entire household may attain transcendence, not merely yourself.\n\nThe common folk cling to wealth and reject the elixir, placing their faith in herbal medicines. Yet herbs rot when buried, soften when boiled, and char when burned—they cannot even preserve themselves, how then can they preserve man? They may cure illness and replenish *qi*, but death remains inevitable. The essentials of the Returned Elixir’s Way are beyond the ken of ordinary men.\n\nMan, shaped in heaven and earth, is the noblest of beings. Bound to age swiftly and die, yet if well-nurtured, may live. Life is precious; death is to be feared. Thus, the most secret and weighty of Daoist teachings is none other than the method of longevity. And of all methods for longevity, none surpasses the Way of the Divine Elixir. If this Way does not grant long life, then no long life has ever existed.\n\nLife is one’s own greatest boon. In terms of true worth, even a dukedom cannot compare. Weighing its value, even a kingdom’s bounty cannot match a century of life. Thirty thousand days—yet in youth, one knows nothing; in old age, joy loses its savor. Between infancy and senility, scarcely a few decades remain for peace and laughter—eight or nine thousand days at most. Life flashes by like lightning. Of those who reach a hundred years, barely one in ten thousand does so. Even if one attains it, a single day’s sorrow may overshadow all.\n\nThus, the superior person’s first duty is to secure the matter of long life. Once settled, one may act freely—whether to ascend as an immortal or to enjoy the world, matching Peng Zu’s years or Lord Shao’s distant longevity. One may keep a wife and children, hold office, uphold propriety above and below, and not lose the joys of human relations—truly a grand endeavor.\n\nThe human body is easily harmed and difficult to nurture. Countless forces assail it: excessive depletion, violent uprooting, the spirit worn by agitation, *ying* and *wei* consumed by overuse. The body’s vessels are scorched and eroded, harmony is lost. Improper diet, overindulgence in *ying* and *wei*, sleeping in drafts or dampness—these breed illness in the vital organs. Then one entrusts their life to herbal physicians or seeks aid in sacrifices, like digging a well when thirsty on a hilltop, or setting a trap when starving in barren fields. What can herbs repair? What can ghosts and spirits remedy? If life could be extended by herbs, all physicians would live forever. If illness could be cured by sacrifices, no shaman would ever fall sick.\n\nThus, the scriptures say: Long life does not lie in sacrifices or prayers, nor in solemn vows and empty words. The Way of nurturing life lies solely in the divine elixir. To know it is not easy; to practice it is truly difficult. Many who study the Dao advance little and retreat much. Those who begin are many; those who persevere are few. Like a well that never reaches the spring, it remains a forsaken well.\n\nThus, it is not that long life is hard to hear of—once heard, the difficulty lies in practice. Yet the true challenge is not in practicing, but in persisting to the end. Without utmost clarity, one cannot discern it; without utmost diligence, one cannot learn it. If it were easily obtained, Emperor Wu of Han would have succeeded with Lord Shao. If it were easily understood, Liu Xiang would have mastered it from the *Pillow Book*. Thus, the Yellow Emperor ascended Mount Kongtong to seek the Dao; Yu the Great sealed golden tablets in a jade casket. Some achieved merit and ascended; others perfected the Way and departed as immortals. These are the proven methods of the ancients—the Way of long life. Without devoted effort, merely dabbling in peripheral arts is futile.\n\nThe time must not be lost; delay not even a day. Among all worldly pursuits, only long life is truly weighty. Once the divine elixir is complete, it endures with heaven and earth.\n\nThe Immortal Elder said: Those who refine *lingsha* in the world extract mercury from cinnabar and combine it with sulfur in an eight-to-two ratio to form *lingsha*. Even a single transmutation allows the adept to attain spiritual communion—hence its name, *lingsha*.",
      "overlap_context": "n, no more than two or three may receive it. It was also said that within the Eight Directions, how few have seen or known these secret manuals. Few indeed hear of them, and transmission requires a solemn oath. The medicine of longevity and transcendence is most sacred and weighty, not to be exchanged for ten thousand gold, and must be entrusted only to the worthy. If transmitted, it may be passed to one person within a hundred years, with an oath sworn in blood, before the transmission is made.",
      "start_char": 1233,
      "end_char": 2457,
      "start_sentence": 49,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.03140878677368,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "愚人服之，百病皆愈。 若到九转，号称还丹。 依法炼服，亦能变化飞升。 其硫黄乃火输，与日轮之气相交，而生此丹。 砂者具南方正色，察太阳真精，含天地之至神，列仙药之上品。 盖其内具硫体而含汞，若依仙方，炼之九转，乃真灵砂也。 修炼之士服之，指日升仙，飞升太清，其功莫可言也。 上洞太－心丹秘方 按《本草》丹砂味甘，微寒，无毒，主疗身体五藏百病，养精神，安魂魄，益气明目，通血脉，止烦满消渴，益精，悦泽人面，杀精邪恶鬼，除中恶肠痛，毒气疥痪诸疮，久服通神明，不老轻身神仙。 按仙方炼为还丹金液，服之者腹中三尸九虫死，身中一切诸病，尽皆除愈，发白更黑，齿落更生，返老还童，延年不死，神仙蜕壳换骨，日中影不见。 始服之寿百岁，三转服之寿三百岁，五转服之寿五百岁，七转服之寿千岁，九转丹成，功行圆满，服之飞升。 昔李少君数百岁在人问，阴长生四百岁，挈妻子遨游州郡。 古之如何，候拔宅飞升者八十余家，白日飞升者不可胜纪，是有征验久矣。 仙访曰：凡造药起火，皆炉边施祭，以好白酒五升，牛羊脯各三斤，黄粱米饭三升，大枣三升，梨一斗，熟鸡子三十枚，鲤鱼三头，各重三斤，凡用三案，案皆二碗。 再拜祝曰：小兆臣某，恭诚惟大道君、老君、太和君。 一及小兆臣某，贪生乐道，转炼神丹。 愿祈使某令药不飞不亡，皆使伏火，药已好善，随手变化，黄白悉伏。 服药飞仙，朝於紫宫，命长无极，得至真人。 行酒起，再拜毕，诸赤色果木橘柚皆上之。 讫，然后造药行火如法。 心丹 丹砂上等红明，如茎豆大者，不拘多少。 一云约斤半分两可矣。 用无根草煮之，即紫背浮萍也。 其草多寡，对丹砂分两，同浓煎水，约可浸二七日之多，药水浸丹砂二七日。 每日早温热草木，浸之二七日，皆温之。 止用元煎草水，不用续添，至日数满，僻去水晒乾，装入神室。 作神室法 用好鸡弹八个，醋浸，略去訾皮，顶上微开一小窍，约小指拇大，慢慢倾去黄白，洗争控乾。 然后磨上等京墨，浓磨墨汁，倾入鸡弹中，摇转令上下皆遍，微於火上炙乾，令遍黑。 如不黑，再用黑汁，如前三上之，尤妙。 此即昆箭纸法也。 选四个好者，作装药者。 余作盖。 乃用鞋底针，於四个鸡弹周围，匀针七个针孔，以象心之七窍也。 四个壳盖，亦如前墨汁涂之。 凡鸡弹色白，神不可居。 墨色染黑，故神可安藏，故号神室也。 右将神室於香上，用名香真香熏之。 亦行祷愿，感天动地，祈祝焚香，再拜如前。 香姻满神室中，然后将丹砂装入，直要装满。 稍若不满，则亏火力。 装讫，用鸡子清搽在神室口外，盖口内亦搽之。 盖定后，用后药固之。 四个神室装药，盖合皆如上法。 固神室玉肺药法 诀云：丹砂之生下有白，白状上有白玉宠。 此丹固神室药、种地匮药，皆白者，象丹砂之玉状玉宠也，犹人之心包络也。 石灰捣罗为细末，用极酸浆水，浸七日了，去水晒乾，复捣为细末，取净灰半斤，生毗石半斤，捣罗为细末。 右二味，用白矾煎水调固之。 固讫，然后装入五行玉匮。 五行玉匮法此玉匮象玉宠也 毗石五斤，打作小块，用纸曩绢帛包住。 复用死硝半斤，盐訾小，朴硝壹两。",
      "translated_text": "The foolish who consume it find all ailments cured. When refined to nine transmutations, it is called the Returned Elixir. Prepared and ingested according to the method, it enables transformation and ascension. Sulfur, being the fire’s essence, merges with the solar qi to generate this elixir. Cinnabar embodies the true color of the south, embodying the sun’s pure essence, containing the supreme spirit of heaven and earth, and ranking as the highest grade among immortal medicines. Within it lies the sulfur’s body and contained mercury; when refined through nine transmutations according to the immortal formula, it becomes true *lingsha*. The adept who consumes it ascends to immortality in days, soaring to the Great Clarity—its merit defies description.\n\n*Upper Cavern Supreme Heart Elixir Secret Formula*\nAccording to the *Materia Medica*, cinnabar is sweet in taste, slightly cold, and non-toxic. It governs the treatment of all diseases of the five viscera and the body, nourishes the spirit, calms the hun and po souls, augments qi, brightens the eyes, unblocks the blood vessels, relieves vexation and fullness, quenches thirst, replenishes essence, beautifies the complexion, expels malevolent spirits and evil ghosts, eliminates acute abdominal pain, toxic qi, scabies, ulcers, and sores. Long-term consumption connects one to the divine, prevents aging, lightens the body, and leads to immortality. When refined into the Returned Elixir or Golden Liquid according to immortal formulas, it kills the Three Corpses and Nine Worms within the abdomen, eradicates all diseases, restores white hair to black, regrows fallen teeth, reverses aging, and extends life without death. The immortal sheds their mortal form and transforms their bones; at noon, their shadow vanishes. Those who first consume it live a hundred years; after three transmutations, three hundred years; after five, five hundred years; after seven, a thousand years. When the ninefold elixir is complete and one’s merit is perfected, they ascend in flight. In ancient times, Li Shaojun lived for several hundred years among men, while Yin Changsheng reached four hundred, traveling with his wife and children across prefectures and commanderies. Of old, over eighty households ascended with their dwellings, and those who ascended in broad daylight are too numerous to record—such proofs have long been evident.\n\nThe Immortal Inquiry states: For all elixir-making and firing, offer a sacrifice beside the furnace. Use five *sheng* of fine white wine, three *jin* each of beef and mutton jerky, three *sheng* of millet rice, three *sheng* of jujubes, one *dou* of pears, thirty hard-boiled chicken eggs, and three carp, each weighing three *jin*. Arrange these on three trays, with two bowls per tray. Bow twice and pray: *\"This humble servant [Name] reverently invokes the Great Dao Lord, Lord Lao, and the Lord of Supreme Harmony. This humble servant, coveting life and delighting in the Dao, refines the divine elixir. May it be granted that the medicine neither flies away nor perishes, that all is subdued by fire, that the elixir becomes excellent, transforming at hand, with gold and silver fully subdued. By consuming the elixir, may I ascend as an immortal, attend the Purple Palace, enjoy boundless longevity, and attain the rank of Perfected One.\"* After offering the wine and bowing twice again, present all red and orange fruits, citrus, and pomelos. Once done, proceed with elixir-making and firing as prescribed.\n\n*Heart Elixir*\nSelect the finest cinnabar, bright red and the size of a small bean, in any quantity. Some say a *jin* and a half, divided by weight, suffices. Boil it with rootless grass—purple-backed duckweed. The amount of grass should match the cinnabar’s weight; decoct it into a thick liquid, enough to soak the cinnabar for fourteen days. Each morning, warm the grass decoction and soak the cinnabar for another fourteen days, keeping it warm throughout. Use only the original decoction, adding no more. When the days are complete, discard the liquid, dry the cinnabar in the sun, and place it into the divine chamber.\n\n*Method for Making the Divine Chamber*\nTake eight good chicken eggs, soak them in vinegar, lightly remove the shell’s membrane, and open a small hole at the top, about the size of a little finger. Gently pour out the yolk and white, wash and dry them thoroughly. Then grind fine Beijing ink into a thick ink solution, pour it into the eggs, and swirl to coat the interior completely. Dry them slightly over a fire until fully black. If not black enough, repeat the ink coating three times for best results—this is the *kunqian* paper method. Select four of the best for holding the medicine; use the rest as lids. With a shoe-maker’s needle, pierce seven evenly spaced holes around each of the four eggs to symbolize the seven orifices of the heart. Coat the four lids with ink as before. Since raw eggshells are white and unsuitable for divine residence, the black ink allows the spirit to dwell securely—hence the name *divine chamber*.\n\nPlace the divine chambers over incense, using fine, true incense to fumigate them. Offer prayers, moving heaven and earth, and bow twice as before. When the chambers are filled with incense smoke, fill them with cinnabar, ensuring they are completely full. Any shortfall weakens the fire’s power. Once filled, apply egg white to the outer rim of the chamber’s opening and the inner rim of the lid. Seal the lid, then secure it with the following medicine.\n\n*Method for the Jade Lung Medicine to Seal the Divine Chamber*\nThe formula states: *\"Beneath the cinnabar’s birth lies white, and atop this white lies a jade halo.\"* This medicine for sealing the divine chamber and the earthen vessel symbolizes the jade halo of cinnabar, akin to the heart’s pericardium. Pound lime into a fine powder, soak it in extremely sour fermented water for seven days, then dry and pound it again into fine powder. Take half a *jin* of purified lime and half a *jin* of raw arsenic, and grind both into fine powder. Mix these two ingredients with alum decoction to seal the chamber. Once sealed, place it into the Five Phases Jade Vessel.\n\n*Method for the Five Phases Jade Vessel*\nThis jade vessel symbolizes the jade halo. Take five *jin* of arsenic, break it into small pieces, and wrap them in paper, silk, or cloth. Add half a *jin* of dead nitre, a small amount of salt, and one *liang* of unrefined nitre.",
      "overlap_context": "ort, merely dabbling in peripheral arts is futile.\n\nThe time must not be lost; delay not even a day. Among all worldly pursuits, only long life is truly weighty. Once the divine elixir is complete, it endures with heaven and earth.\n\nThe Immortal Elder said: Those who refine *lingsha* in the world extract mercury from cinnabar and combine it with sulfur in an eight-to-two ratio to form *lingsha*. Even a single transmutation allows the adept to attain spiritual communion—hence its name, *lingsha*.",
      "start_char": 2457,
      "end_char": 3707,
      "start_sentence": 95,
      "end_sentence": 148,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.126195669174194,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "三件和在酽醋内，乃以上件帛包毗石，於醋内悬胎煮之。 须煮七日，其醋约五六瓶方可煮。 七日煮了，取出毗石晒乾。 死硝二两，死硝用皂角伏之，每斤硝石须用皂角二斤，烈火上伏之。 练二两，炮砂二两。 右件玉匮药，通计五斤六两，捣为康砂末，用砂祸一个，大小约可装药者，此名土釜。 下安玄精石一抄於釜底，后装四玉匮，药荐藉匀，安四神室於中，又用玉匮药覆盖。 讫后用玄精石赓满，泥封釜口，瓷碟子紧盖，毋令不满，有妨火候。 用铁线八道扎缚，铁线余者纽成疙疸，约二指高。 复用薄泥，约一分厚，护盖铁线瓷碟。 讫装入灰炉，养火。 五五周天火候法 诀曰：仍以十个月为节，以象胞胎也。 后五个月，土数也。 故五五二十五，足土气也。 一十个月火候，一两四钱。 次十个月火候。 一两六钱。 后五个月火候。 二两一钱。 周天火足，次行补火，止补月小日数，盖此乃月之周天数也。 行补火法 法用平底灰炉中，乃换铁架，阁丹，釜架脚可高四寸。 早火每络七钱，三络计二两一钱，脚高三寸下火。 晚火每络八钱，三络计二两四钱，飞火平於顶上铁线上。 火络法 其法用铁线造络六个，分作早晚用，络形阔一寸，长一寸半，有盖，下新络，起旧络宿火，不可留宿火。 其行补月小日数火足，然后开炉，取出丹釜，剪断铁线，去瓷碟，取出四个神室，锯开其神室，必体硬如瓷瓦难锯。 当於木上，先开一弹窝，可容神室一半，然后放上神室，轻手按住。 缓慢锯齿，来往锯开，取出丹砂，用药水沐浴，苏醒丹火，补其元气。 浴丹补气药水法 用山葡萄子乾者一两，煎水湿者，用四两纽汁用，加入石脑油、樟脑油，各四两重，三件和匀，约水大半碗，开弹倾入水内必滚，尽其滚声住，候冷取出试丹。 试丹法 试丹用赤铜一两，鞘镕成汁，以丹半钱中点化，然后将生硝一块，如青梅大，放入其丹硫内，有硫黄，其气能令点化铜色黑，须再用壁土一块。 入甘祸收硫气，必用钳搅，令如水光净，然后倾出。 如不诤，再加入生硝壁土，如上法，直候如水光净，倾出八个正色之宝，不须加母。 若似此点化，出其丹灵矣。 此为九转丹母也。 丹体虽灵，犹未可服，止可作匮，升入九转丹法，亦不可以多用点物，虚费丹母，有妨九转。 论试丹说 按方书铜之为物，能补人骨损折处。 凡服铜药，直至损折骨上，如铺筋漆坚固，其损骨硬如金石。 令试丹以铜，化成至宝。 其仙方换骨之道欤，若节节升转，九转而服之，当知骨化寒琼必矣。 太极真人说 玉石三百六十种，丹砂为上品第一。 古以为养性命，成神仙，长生之大药也。 仙方炼服之方，非一法制之。 或以酒，或以醋，或以漆，或以蜜，然得法皆可养性命，致长生不死神仙。 要之伏火而为金液，九转而为还丹，比诸方为上法。 此丹欲为地仙，寿千万岁。 欲为神仙，便可朝金母，拜木公，膺图录，登灵台，换骨而飞仙。 欲为天仙，便可逍遥乎郁罗萧台，臣事乎三清之境也。 有仙骨者，方遇此法。 有道德者，方遇至人。 如遇者勿以轻易而侮慢，或不尽其口诀，虚费炉鳌，或招谴谪而身谢玄路。 此乃自贻殃咎，又何咎焉。",
      "translated_text": "Combine the three ingredients in strong vinegar, then take the aforementioned silk-wrapped arsenic and suspend it within the vinegar to boil as an embryo. It must be boiled for seven days, requiring approximately five or six bottles of vinegar. After seven days of boiling, remove the arsenic and dry it in the sun. Take two *liang* of dead nitre, which must be subdued with soap beans—each *jin* of nitre requires two *jin* of soap beans, refined over a fierce fire. Add two *liang* of refined cinnabar and two *liang* of blasted cinnabar.\n\nFor the Jade Vessel’s medicine, the total weight is five *jin* and six *liang*. Pound it into fine cinnabar powder. Use a sand crucible of appropriate size to hold the medicine—this is called the Earthen Cauldron. Place one scoop of dark essence stone at the bottom of the cauldron, then layer the four Jade Vessels evenly within. Position the Four Spirit Chambers at the center, and cover them with the Jade Vessel medicine. Once done, fill the remaining space with dark essence stone, seal the cauldron’s mouth with clay, and tightly cover it with a porcelain dish, ensuring no gaps to avoid disrupting the firing process. Bind it with eight strands of iron wire, twisting the excess into knots about two fingers high. Then apply a thin layer of clay, roughly one *fen* thick, to protect the iron wire and porcelain dish.\n\nPlace the assembly into an ash furnace and nurture the fire.\n\n*Method for the Five-Five Celestial Cycle of Fire*\nThe formula states: Take ten months as the measure, symbolizing the gestation of an embryo. The latter five months correspond to the number of Earth. Thus, five times five makes twenty-five, fulfilling the qi of Earth. For the first ten months of firing, use one *liang* and four *qian*. For the next ten months, use one *liang* and six *qian*. For the final five months, use two *liang* and one *qian*. Once the celestial cycle of fire is complete, proceed with the supplementary fire, adjusting only for the shorter months—this follows the celestial cycle of the moon.\n\n*Method for Supplementary Fire*\nPlace a flat-bottomed ash furnace and replace the iron stand, positioning the crucible so its legs are four *cun* high. For the morning fire, use three braziers, each with seven *qian*, totaling two *liang* and one *qian*, with the fire three *cun* below the legs. For the evening fire, use three braziers, each with eight *qian*, totaling two *liang* and four *qian*, with the flying fire level with the iron wire atop the crucible.\n\n*Method for Fire Braziers*\nFashion six iron-wire braziers, divided for morning and evening use. Each brazier should be one *cun* wide and one and a half *cun* long, with a lid. When lighting a new brazier, transfer the fire from the old one, ensuring no residual fire remains. Once the supplementary fire for the shorter months is complete, open the furnace, remove the cinnabar cauldron, cut the iron wire, lift the porcelain dish, and take out the four Spirit Chambers. Saw open the chambers—their bodies will be as hard as porcelain or tile, making sawing difficult. First, carve a hemispherical hollow in a wooden block to hold half of the Spirit Chamber, then place the chamber on it and saw gently back and forth to open it. Remove the cinnabar and bathe it in medicinal water to revive the cinnabar’s fire and restore its original qi.\n\n*Method for Bathing the Cinnabar and Restoring Qi*\nUse one *liang* of dried mountain grape seeds (or four *liang* of fresh, squeezed for juice). Add four *liang* each of petroleum and camphor oil, mixing them evenly into roughly half a bowl of water. Bring the water to a boil, then pour it into the cinnabar—let it boil until the sound ceases, then wait for it to cool before removing the cinnabar for testing.\n\n*Method for Testing the Cinnabar*\nTake one *liang* of red copper and melt it into liquid. Add half a *qian* of the cinnabar to transmute it. Then place a piece of raw nitre the size of a green plum into the molten mixture. If sulfur is present, its fumes will darken the transmuted copper. Use a piece of wall clay to absorb the sulfur fumes, stirring with tongs until the liquid becomes clear as water. Pour it out. If impurities remain, add more raw nitre and wall clay, repeating the process until the liquid is perfectly clear. Pour it out to obtain eight pieces of true-color treasure, requiring no additional matrix. If the cinnabar transmutes thus, its spirit is awakened—this is the Mother of the Nine-Cycled Cinnabar.\n\nThough the cinnabar’s body is now potent, it is still not fit for consumption. It may only serve as a vessel to ascend into the Nine-Cycled Cinnabar. Do not waste the Mother Cinnabar by using it excessively for transmutation, lest it hinder the Nine Cycles.\n\n*Discourse on Testing the Cinnabar*\nAccording to medical texts, copper has the property of mending broken bones. When one ingests copper medicine, it travels directly to the site of the fracture, reinforcing it like lacquered sinew, making the bone as hard as metal or stone. Testing the cinnabar by transmuting copper into treasure reveals the Dao of bone-transformation in immortal formulas. If one refines and consumes it through nine cycles, one’s bones will assuredly transform into cold jade.\n\n*The Supreme Ultimate Realized One Speaks*\nAmong the three hundred and sixty kinds of jade and stone, cinnabar is the foremost treasure. The ancients regarded it as the great medicine for nurturing life, attaining immortality, and achieving longevity. The methods for refining and consuming it are not uniform—some use wine, others vinegar, lacquer, or honey. When properly prepared, all can nurture life and lead to immortality. However, subduing the fire to create liquid gold and cycling it nine times to produce the Returned Cinnabar is the supreme method. This cinnabar can grant one the status of an Earth Immortal, with a lifespan of ten thousand years. To become a Spirit Immortal, one may pay homage to the Golden Mother and the Wood Lord, receive sacred texts, ascend the numinous terrace, and transform one’s bones to become a flying immortal. To become a Heavenly Immortal, one may roam freely among the Purple Canopy and Verdant Terrace, serving as a minister in the Three Pure Realms.\n\nOnly those with the bones of an immortal will encounter this method. Only those of virtue will meet a perfected being. If you encounter it, do not treat it lightly or with disrespect, nor fail to master its oral instructions, lest you waste the furnace and cauldron or incur heavenly punishment, cutting short your journey on the mysterious path. Such misfortune is self-inflicted—who else could be blamed?",
      "overlap_context": "er. Take half a *jin* of purified lime and half a *jin* of raw arsenic, and grind both into fine powder. Mix these two ingredients with alum decoction to seal the chamber. Once sealed, place it into the Five Phases Jade Vessel.\n\n*Method for the Five Phases Jade Vessel*\nThis jade vessel symbolizes the jade halo. Take five *jin* of arsenic, break it into small pieces, and wrap them in paper, silk, or cloth. Add half a *jin* of dead nitre, a small amount of salt, and one *liang* of unrefined nitre.",
      "start_char": 3707,
      "end_char": 4942,
      "start_sentence": 149,
      "end_sentence": 205,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.93180561065674,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "草木三六十种，而黄精为上品第一。 此亦养性命，致长生不死，神仙之灵草也。 详世之草木金石，万物之性类，凡禀阴气者皆含毒，而能令人死。 凡禀阳气者，皆能令人生。 黄精生於山之南，禀太阳之精。 勾吻生於山之阴，禀太阴之精气而生，故令人速死，毒能致肠胃寸断，阴毒可畏之甚也。 丹砂禀太阳之真精，火输之正气，与太阳同色，与黄精同功用，为阳之精，又何疑。 日中有乌，内舍阴也。 砂中有汞，内舍阴也。 炼之九转，而成金液还丹者，纯阳也。 其丹砂之生，上有玉宠，下有玉林，其为造化之贵重，可知矣。 上洞心丹经诀卷上 上洞心丹经诀卷中",
      "translated_text": "The grasses and trees number thirty-six tens of species, yet yellow essence ranks as the supreme treasure among them. This is also a numinous herb for nurturing life and destiny, attaining longevity and immortality, and becoming a spirit immortal. Examining the natures of the world’s grasses, trees, metals, and stones—all things under heaven—those imbued with yin qi invariably contain toxins and bring death to man. Those imbued with yang qi invariably bestow life.\n\nYellow essence grows on the southern slopes of mountains, receiving the essence of the Great Yang. Hookvine grows on the northern slopes, receiving the essence of the Great Yin’s qi to flourish, and thus swiftly causes death. Its poison can sever the intestines and stomach, for yin toxins are most fearsome. Cinnabar receives the true essence of the Great Yang, the upright qi of fire’s transformation, sharing the same color as the sun and the same function as yellow essence. As the essence of yang, what doubt could there be?\n\nWithin the sun dwells the crow, harboring yin. Within cinnabar dwells mercury, harboring yin. Refined through nine cycles to become golden liquid and returning elixir, it is pure yang. The growth of cinnabar, crowned above by jade radiance and sheltered below by jade groves, reveals its noble place in creation. Thus may its worth be known.\n\n*Upper Scroll of the Upper Cavern Heart Elixir Canon and Oral Instructions*\n*Middle Scroll of the Upper Cavern Heart Elixir Canon and Oral Instructions*",
      "overlap_context": "among the Purple Canopy and Verdant Terrace, serving as a minister in the Three Pure Realms.\n\nOnly those with the bones of an immortal will encounter this method. Only those of virtue will meet a perfected being. If you encounter it, do not treat it lightly or with disrespect, nor fail to master its oral instructions, lest you waste the furnace and cauldron or incur heavenly punishment, cutting short your journey on the mysterious path. Such misfortune is self-inflicted—who else could be blamed?",
      "start_char": 4943,
      "end_char": 5199,
      "start_sentence": 206,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.8443074226379395,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "太极真人嗣孙手述 仙翁曰：《参同契》云：植禾当用粟，覆鸡用其子。 燕雀不生凤，狐兔不乳马。 斯言尽之矣。 夫人五行顺而形生，逆而成真。 察阴阳五行之气，而后有此身。 然身中之宝者，神也。 神之在天为热，在地为火，在人为心神也。 心也为道之祖，修仙之正法也。 今以丹砂一味，九转炼之，为金液还丹者，实此理也。 若悟此理，修行外炼还丹，依方服之，内求玄珠於赤水之中，结还丹於黄庭之内，使内外丹成，九转变化，须臾与道合真，盖内修者阴丹也，外修者阳丹也。 阴丹就而命延，阳丹就而升腾。 故修道之士，有内丹者可以延年，得外丹者可以升天。 内丹成而外丹不应，外丹至而内丹未克，皆未能升举。 吾所以授三一九室者，内修之要也。 还丹金液者，外炼之极也。 勉而修之，可成矣。 弟子即再拜受教，终身秘之。 仙翁曰：凡欲长生，而不得神丹金液，徒自苦耳。 故呼吸导引，吐故纳新，及服草木之药，可得延年，不免於死也。 若服神丹，令人神仙度世，与天地相毕，与日同光，坐见万里，役使鬼神，举家升虚，无翼而飞，乘云驾龙，上下太清，漏刻之问，周游八极，不拘江河，不畏百毒。 按草木之药，可以攻疗疾病，不可以致长生也。 金石之药，可以叉获延年，而亦能兼除百邪也。 夫草药之为物也，虚脆柔软，不堪而久，煮之则烂，埋之则腐，烧之则灰，停之则朽，不能自坚，岂能坚人乎。 不能自生，岂能生人乎。 若丹砂之为物也，是称奇石，最为上药。 细理红润，其质坚固，贞秘积转，逾久灾化逾妙，能飞能粉，能精能雪，能为真汞，能为还丹，能拒火，能化水，消之可以｀不耗，埋之可以不坏，灵异奇秘，我难以称。 然而得要则全生，失法则伤寿。 人见《本草》云丹砂无毒，谓不伤人。 不知水银出於丹砂，而有大毒。 故云水银是丹砂之魂，水银因丹砂而出。 末既有毒，本岂无毒。 浅识狭观，不思远大性命之功，蹉跌不追。 所以古人深惧，除恶务本，叉先煮炼，方入大丹。 殊途同归，皆令伏火，不拘日数，莫限人功，事资於养，不宜急速。 人见丹砂是石，乃言诸石烧之为灰，其丹砂何得独尔不化。 殊不知丹砂色赤，而能生水银之白物，变化之理，颇亦为证。 以丹砂而为金液，犹土得水而成泥涎也。 山之下有金，其上多有丹砂，变转不已，还复成金，归之本质，无可怪也。 故昔汉朝有李少君者，乃数百岁人也。 不闻有它能，唯以丹砂作还丹，或以还丹为金，以金为器，以器盛食，以食资身，渐渍肠胃，沾洽荣卫，藉其坚贞，以驻年寿。 事汉武帝不尽情实，乃以祠电左道之衍奏进，不以还丹金液之正诀上闻，征至卒以化去，武帝思之。 故知惟有丹砂转炼之道，金液还丹之妙，令人不老不死，可谓大善焉。 仙翁曰：此丹砂转炼之道，非独服饵长生，用以浴身，俗疾不能干，众灾莫由害也。 此法本出玉皇秘藏隐文，非俗所有。 自非禀其仙筹者，终不能见。 吾留此诀文，以开后圣。 若得此诀者，必须依传授法受之，不得轻吾告，受非人也，非所受作不成，亦万劫学仙道，永不得成也。 又云：受法不得轻告。 传法日取旺相日，结斋立坛，师与第子并在坛前，日夜烧宝香，奏帝祈请所愿，长生药录名目。",
      "translated_text": "The Patriarchal Heir of the Supreme Ultimate Perfected One records the words of the Immortal Elder: As the *Cantong Qi* states, \"To plant grain, use millet; to hatch a chick, use its egg. Swallows and sparrows do not give birth to phoenixes, nor do foxes and hares nurse horses.\" These words exhaust the principle. For humans, the Five Phases in sequence give rise to form, while in reversal they perfect the true. Only by examining the qi of yin-yang and the Five Phases does this body come to be. Yet the treasure within the body is the spirit. In heaven, spirit is heat; on earth, it is fire; in humans, it is the heart-spirit. The heart is the ancestor of the Dao, the proper method of immortal cultivation.\n\nNow, taking cinnabar alone and refining it through nine cycles to become golden liquid and returning elixir—this is the very principle. If one awakens to this principle, cultivating the external refinement of the returning elixir and ingesting it according to the method, while internally seeking the mysterious pearl within the Crimson Waters and congealing the returning elixir within the Yellow Court, one causes both inner and outer elixirs to form. Through ninefold transformation, in an instant one merges with the Dao and attains truth. For inner cultivation yields the yin elixir, while outer cultivation yields the yang elixir. When the yin elixir is achieved, life is prolonged; when the yang elixir is achieved, one ascends in flight. Thus, those who cultivate the Dao—those who attain the inner elixir may extend their years, while those who obtain the outer elixir may ascend to heaven. If the inner elixir is complete but the outer elixir does not respond, or if the outer elixir is perfected but the inner elixir remains unmastered, neither can achieve ascension.\n\nWhat I transmit as the Three Ones and Nine Chambers is the essential method of inner cultivation. The golden liquid returning elixir is the ultimate achievement of external refinement. Strive to cultivate it, and success may be yours.\n\nThe disciple then bowed twice to receive the teaching, vowing to keep it secret for life.\n\nThe Immortal Elder said: Those who seek longevity yet fail to obtain the divine elixir of golden liquid merely torment themselves in vain. For breath control, guiding and pulling, exhaling the old and inhaling the new, or ingesting herbal medicines—these may extend life, but death remains inevitable. Only by ingesting the divine elixir can one become a transcendent, traversing the world, enduring as long as heaven and earth, shining as brightly as the sun. One may sit and perceive a thousand miles, command ghosts and spirits, ascend with one’s entire household to the void, fly without wings, ride clouds and mount dragons, ascending and descending the Great Clarity. In the span of a single watch, one may roam the eight extremities, unbound by rivers and seas, unafraid of the hundred poisons.\n\nHerbal medicines may cure illnesses, but they cannot confer longevity. Mineral medicines may extend years and also dispel the hundred evils. Yet herbs, being insubstantial, brittle, and soft, cannot endure long—they rot when boiled, decay when buried, turn to ash when burned, and wither when stored. If they cannot firm themselves, how can they firm others? If they cannot sustain their own life, how can they sustain others?\n\nCinnabar, however, is called a marvelous stone and the supreme medicine. Its fine texture is red and lustrous, its substance firm and enduring. The longer it is refined and stored, the more wondrous its transformations become. It can fly, turn to powder, become refined as snow, transform into true mercury, or become the returning elixir. It resists fire, transmutes water, and when dissolved, does not diminish. Buried, it does not decay. Its numinous marvels and mysteries are beyond description.\n\nYet when rightly applied, it preserves life; when misused, it harms longevity. Some see in the *Materia Medica* that cinnabar is non-toxic and assume it cannot harm. They do not know that mercury, born of cinnabar, is highly poisonous. Thus it is said: mercury is the soul of cinnabar, and mercury emerges from cinnabar. If the derivative is toxic, how could the source be without poison? Those of shallow understanding and narrow vision, failing to consider the far-reaching power of life and destiny, stumble and do not recover. This is why the ancients were deeply cautious, eradicating evil at its root. They first boiled and refined cinnabar before incorporating it into the great elixir. Though paths differ, all aim to subdue fire. Neither days nor human effort should be limited—patience is required, and haste is unwise.\n\nSome see cinnabar as a stone and claim that all stones turn to ash when burned, so why should cinnabar alone remain unchanged? They do not realize that cinnabar, though red, can generate the white substance of mercury—a transformation that serves as proof. Refining cinnabar into golden liquid is like soil mixed with water becoming mud. Beneath mountains where gold is found, cinnabar often abounds. Through ceaseless transformation, it reverts to gold, returning to its original nature—nothing is strange in this.\n\nThus, in the Han dynasty, there was Li Shaojun, a man of several hundred years. His only skill was refining cinnabar into the returning elixir, or transmuting the elixir into gold, fashioning vessels from the gold, using them to hold food, and consuming it to nourish the body. Gradually, his intestines and stomach were permeated, his meridians and protective qi suffused, and by virtue of its firmness and purity, his years were prolonged. Yet when he served Emperor Wu of Han, he did not fully reveal the truth, instead presenting it as sacrificial techniques and heterodox arts. He did not disclose the proper method of the golden liquid returning elixir. Summoned to court, he eventually departed in transformation, and the emperor longed for him.\n\nThus we know that only the method of refining cinnabar and the wonder of the golden liquid returning elixir can make one ageless and deathless—this is the greatest good.\n\nThe Immortal Elder said: This method of refining cinnabar is not only for ingesting to attain longevity. Used to bathe the body, mundane illnesses cannot invade, and the hundred calamities cannot harm. This method originally derives from the Jade Emperor’s secret hidden texts, not something the worldly possess. Without receiving the immortal tally, one can never see it. I leave this written method to enlighten future sages. Whoever obtains it must follow the transmission rites to receive it. Do not lightly disclose my teachings to the unworthy, for if transmitted to the wrong person, the elixir will not form. Even after ten thousand kalpas of cultivating the Dao, one will never succeed.\n\nIt is also said: Do not lightly disclose the received method. On the day of transmission, choose an auspicious day, establish a purification fast, and set up an altar. Master and disciple shall stand before the altar, burning precious incense day and night, presenting offerings and praying to the emperor for the fulfillment of their wish—the recording of the name in the register of longevity medicines.",
      "overlap_context": "be?\n\nWithin the sun dwells the crow, harboring yin. Within cinnabar dwells mercury, harboring yin. Refined through nine cycles to become golden liquid and returning elixir, it is pure yang. The growth of cinnabar, crowned above by jade radiance and sheltered below by jade groves, reveals its noble place in creation. Thus may its worth be known.\n\n*Upper Scroll of the Upper Cavern Heart Elixir Canon and Oral Instructions*\n*Middle Scroll of the Upper Cavern Heart Elixir Canon and Oral Instructions*",
      "start_char": 5199,
      "end_char": 6431,
      "start_sentence": 219,
      "end_sentence": 268,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.753912925720215,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "称某少好长生上道，万劫以来，常蒙道福，今得奉恩圣允，蒙师慈念，许受诀文。 某今不敢许纳，一一奏请皇君，师言弟子某求道，日夜无怠。 某欲授某诀文，不敢自许，一一奏请皇君。 如此谨心，满七日夜，然香登坛，饮血为盟，分金环投束流水中，请师传授诸神金丹，若及传口诀图录，皆同此法传授。 若不依传法诸受，师与弟子所造不成，此金液还丹中诀文也。 狐丘先生授葛仙翁曰：命属仙星，名录继我，今故授汝金丹诀等，及修仙法，汝依而用之。 汝若传之，自非次志山岩，不规俗利者，敌血分环，立坛为誓，终不得妄传，传非其人，名削福簿，殃及累代，慎之勿妄传也。 此是神丹万金诀也。 神仙九转秘方 诀曰：凡转丹，皆须於炉前施祭。 其祭法如前，造药、起火、祭法，九转并同。 第一转法 诀曰：其转法，每一两生丹砂，可用四两伏火丹砂匮养之。 此第一转丹砂四两中，必用伏火砂一斤作匮，生丹砂若见伏火砂，如猫见鼠，如羊见虎，随性伏火，不复敢动矣。 朱砂红明，如黄豆大者，三两，重山莆萄水浸七日，每日温热水浸，去水晒乾。 法用滑石作一盒子，如当三钱厚，约可盛二十余两，微加大些子，装满到之。 先装一层熟砂铺底，复以生砂，如我莲我之。 又盖一层熟砂，又一生一熟装之。 装了复用熟砂盖顶，盖顶了然后到去盒子余弦，令与丹砂平。 却用盒子盖盖之，令砂贴盖为妙。 盖讫，用泥封固，古用石膏固则难开，泥固易开故也。 既有伏火砂匮，虽不固亦不飞走，此用泥故也。 然不若依古法，用石膏为妙，缓开之可也。 仍用铁线八道扎缚，余下铁线纽疙疸，二指高。 九转同。 转丹立炉法 用板作炉底，周围签钉竹子作骨。 又用篾织成炉，上下桶直，约一尺阔，泥厚一寸，口阔九寸，身高一尺一寸，内安铁架，其铁架三寸高脚，药盒子坐架上，灰盖行火。 此炉九转皆用，法并同。 一转火候一两四钱 九转皆不用补火，每转十二个月，满开拣出丹砂四两，其一斤丹匮，并不用。 可点化用之，一转灵丹，依法凡剂服饵。 服一转丹法 一转伏火朱砂一钱重，研碎为极细末，用首男乳半合，华销银盏盛其乳汁。 於重汤内缓缓熬熟，微下一訾白缅，打成糊圆，如黄豆大。 将皮纸作一锅子，悬虚於慢火上，银锋子炒一个时辰，不可炒破纸。 如纸焦急换纸锅，又炒令乾。 取火力令乾故也。 服用人参煎汤，五更向束正面立，吞服，约半个时辰不久，浑身热极口乾，当预备九大缸满水，急入水缸中坐。 如又热，别入冷水缸。 若热，又入别水缸内。 如九缸水皆热，直候热定身冻而止。 过日皮肤尽退，须鬓眉发俱脱落复生，老者返少，如蝉蜕壳。 转转服之，各有功效，具如经说。 有内丹者，不须水。 按此服饵一转丹法，若非志慕长生，心无疑虑，内丹脑满，不可轻服。 若浮躁性情，又多疑惑，反致殃害。 何故，若常人不修内丹，脑髓虚耗不满，服此则骨精有损，反致枯燥。 若心疑虑，心火一发，姻焰烧身，不可救矣。 故九转丹成，常人服之，化为鲜血，岂不信哉。 此虽一转之丹，服者不可不慎。 服丹之后，当修内丹法要，打坐内外双修，内丹与外丹相应出神，法皆在此矣。 修内丹法秘诀 太极真人诀曰：丹室须要洁净，常焚宝香，密室无风，不可太明，不可太暗，高低得中，绝禁一切，忌讳不净杂色之人来往，如老病丧孝产孕体臭，四肢不全，笃废等疾，僧道闲人，妇女猫犬，皆是不令外人来入为妙，选直时童子聪明至诚者二人为侍使，又不可令人知有此丹室，仙道贵秘密故也。",
      "translated_text": "The disciple [Name] has from youth cherished the supreme Dao of longevity. Through ten thousand kalpas, I have constantly received the blessings of the Dao. Now, by the grace of the sagely decree, I have been deemed worthy by my merciful master to receive these secret writings. Yet I dare not presume to accept them without first submitting each detail to the August Sovereign. My master has declared before the throne that this disciple [Name] seeks the Dao with unwavering diligence, day and night. Should I now transmit these secret writings, I dare not grant them without first presenting every particular to the August Sovereign.\n\nWith reverent devotion, we shall maintain this practice for seven full days and nights. Then, burning incense, we shall ascend the altar, drink the blood oath, and cast the divided gold ring into flowing water. Only then may the master transmit the divine golden elixir, along with its oral instructions and illustrated manuals—all to be conveyed in accordance with this same ritual. Should the transmission rites not be strictly observed, neither master nor disciple shall achieve success, for these are the secret writings of the Golden Liquid Returned Elixir.\n\nMaster Huxiu addressed Lord Ge the Immortal: \"Your fate is bound to the star of immortality, and your name is recorded to succeed me. Today, I transmit to you the secret of the golden elixir and the methods of cultivating immortality. Follow them faithfully. Should you ever transmit them, choose only those who dwell in mountain seclusion, free from worldly desires. They must swear the blood oath, divide the ring, and establish the altar vow. Never transmit recklessly, for if given to the unworthy, your name shall be stricken from the register of blessings, and calamity shall extend through generations. Guard this well—do not transmit it carelessly. These are the divine elixir’s priceless secrets.\"\n\n**Nine Cycles of the Divine Elixir: Secret Formula**\n\nThe instructions state: For every cycle of the elixir, an offering must be made before the furnace. The method of offering, as previously described, applies uniformly to the preparation of the medicine, the kindling of the fire, and all nine cycles.\n\n**First Cycle Method**\nThe instructions state: For each tael of raw cinnabar, use four taels of pre-fired cinnabar to encase and nurture it. In this first cycle, for every four taels of cinnabar, one *jin* of pre-fired cinnabar must be used as the encasement. When raw cinnabar encounters pre-fired cinnabar, it submits as a cat before a rat or a sheep before a tiger, yielding to the nature of the fire and ceasing all resistance.\n\nSelect three taels of bright red cinnabar, the size of yellow beans, and soak it in *chongshan putao* water for seven days. Each day, replace the water with warm liquid, then dry it in the sun. Prepare a talc box, about the thickness of a three-coin stack, large enough to hold over twenty taels. Make it slightly larger, then fill it to the brim.\n\nFirst, lay a layer of fired cinnabar at the bottom, then add raw cinnabar, arranging them like lotus petals. Cover with another layer of fired cinnabar, then alternate between raw and fired layers. Once filled, top with fired cinnabar, trimming any excess to level with the cinnabar. Seal with the box’s lid, ensuring the cinnabar adheres to it. After sealing, secure it with mud—ancient methods used gypsum, which is harder to open, but mud is easier. Though the pre-fired cinnabar encasement prevents escape, mud is still used. However, following the ancient method with gypsum is preferable, allowing for gradual opening. Bind the box with eight iron wires, twisting the excess into a knot two fingers high. This applies to all nine cycles.\n\n**Furnace Construction for Elixir Cycling**\nConstruct the furnace base from planks, with bamboo skewers forming the frame. Weave a bamboo furnace, straight and cylindrical, about a foot wide, coated with a one-inch layer of mud. The mouth should be nine inches wide, and the height eleven inches. Inside, place an iron stand three inches high, upon which the medicine box rests, covered with ash for heat regulation. This furnace serves all nine cycles, following the same method.\n\n**Fire Regulation for the First Cycle**\nOne tael and four *qian* of fire regulation. No supplemental firing is needed for any of the nine cycles. Each cycle lasts twelve months. Upon completion, extract four taels of cinnabar, discarding the remaining *jin* of encasement. This can be used for transmutation. The elixir of the first cycle is to be ingested according to the prescribed method.\n\n**Method of Ingesting the First-Cycle Elixir**\nGrind one *qian* of pre-fired cinnabar into an extremely fine powder. Mix with half a *ge* of a firstborn son’s milk in a silver dish. Gently simmer in a double boiler until cooked, then add a pinch of white flour to form small pills the size of yellow beans. Place them in a paper steamer suspended over a slow fire, and stir-fry with a silver spoon for one *shi* (two hours), ensuring the paper does not burn. If it chars, replace the paper steamer and continue frying until dry, ensuring thorough heat penetration.\n\nIngest with ginseng decoction at the fifth watch, facing east. Soon after, the body will grow intensely hot and the mouth dry. Prepare nine large vats of water in advance. Immediately sit in one; if the heat persists, move to another vat of cold water. Continue until all nine vats are warmed, waiting until the heat subsides and the body cools. Afterward, the skin will shed entirely, including hair, eyebrows, and beard, which will regrow. The elderly will revert to youth, like a cicada shedding its shell. Each cycle’s elixir, when ingested, yields distinct benefits as described in the scriptures. Those who have cultivated internal elixirs need not use water.\n\nHowever, this method of ingesting the first-cycle elixir must not be undertaken lightly. Only those resolutely devoted to longevity, free from doubt and with a full internal elixir, may proceed. Those of restless temperament or prone to suspicion risk harm. Why? Ordinary people who have not cultivated internal elixirs suffer from depleted brain marrow. Ingesting this elixir may damage their essence, leading to desiccation. If doubt arises, the heart’s fire will ignite, engulfing the body in flames—beyond salvation. Thus, when the nine-cycle elixir is completed, ordinary people who ingest it will dissolve into fresh blood. How can this not be believed? Even this first-cycle elixir demands caution.\n\nAfter ingesting the elixir, one must cultivate the internal elixir, practicing seated meditation to refine both internal and external. When the internal and external elixirs align, the spirit will emerge—all methods are contained herein.\n\n**Secret Method of Cultivating the Internal Elixir**\nThe instructions of the True Person of the Great Ultimate state: The elixir chamber must be pure and clean, with precious incense constantly burning. It should be a secluded room, free from drafts, neither too bright nor too dark, with moderate height. All taboos must be strictly observed, forbidding the presence of impure or inauspicious individuals—those who are elderly, ill, in mourning, postpartum, pregnant, foul-bodied, disabled, or infirm. Monks, Daoists, idlers, women, cats, dogs, and other animals must also be excluded. It is best to prevent outsiders from entering. Select two intelligent, sincere, and upright young boys as attendants, ensuring no one learns of the elixir chamber’s existence. The Dao of immortality values secrecy above all.",
      "overlap_context": "will not form. Even after ten thousand kalpas of cultivating the Dao, one will never succeed.\n\nIt is also said: Do not lightly disclose the received method. On the day of transmission, choose an auspicious day, establish a purification fast, and set up an altar. Master and disciple shall stand before the altar, burning precious incense day and night, presenting offerings and praying to the emperor for the fulfillment of their wish—the recording of the name in the register of longevity medicines.",
      "start_char": 6431,
      "end_char": 7808,
      "start_sentence": 269,
      "end_sentence": 322,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.399810552597046,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "又不可对人言说，现修内外神丹，及其法。 若令杂人及不信之人，知此修行，及对此等杂人说并见，皆不能成仙道也。 修丹室讫，然后设一座，有几，并设一榻座并榻，致令膝平，不令高低，枕高四指，室中燥湿得宜，皆要洁诤，衣服被褥厚软铺陈，及饮食汤药茶酒，烹调得宜，须要洁诤具备，切戒妨色，太醉太饱太饥，喜怒忧思，一切邪精妄想，皆不要有，五辛厌秽，亦宜戒之。 若犯房色及臭秽，皆能伤丹误人，不远柢在目前。 然后每日随意欢喜静坐，须要一丝不挂，万虑俱无，内境不出，外境不入，此心如镜之明净，无一点尘埃。 此心如水之清澄，无一点滓浊。 然后握固如婴儿，唇齿相着，舌拄上愕，呼吸绵绵，以眼视鼻，以鼻视脐，自觉身孔毛问，跃然如快，又如淫欲交感之美，以此验之。 或盘膝，或舒足，或坐或立，或行或卧，皆同升降，妙理具在其问。 卧则不可睡，睡熟则气散。 如能昼夜无睡，极妙。 不能则少睡，渐渐臧睡，可也。 常入胎息之功，当以子时至午时毕，不可以午时至子时。 盖子至午谓之六阳，其气生。 午至子谓之六阴，其气死，无益於人。 运胎息，抱素凝妙，闭鼻合眼，口不嘘吸，如在胞胎中。 初学者鼻口引气而闭之，以心计数一百二十次，方以口吐气，出引气而皆不可令耳闻其气出入之声，常令入多出少。 以鸿毛着鼻上，吐气鸿毛不动为法。 渐学增其计息之数，久则至千数，则老者返少，死者更生，可以辟瘟疫，可以禁蛇虎，可以入水火，可以贯金石，可以辟饥渴，可以延年却死，可以嘘水火为之逆流。 但行此法，不可多食肉生菜肥鲜之物，令人气强，难以闭禁。 惜忿怒，忿怒则气乱。 胎息其验如此，子宜秘之。 口口相传之道，非世之常文，勿示非人，秘之秘之。 又运精气，自尾问夹脊入脑尾间穴，在第十九节。 夹脊节在第十二节下。 补脑法，其初当偃头向后，紧闭大椎穴第三节，不令气过。 先紧闭夹脊，不令气过。 大椎穴名上关，夹脊穴名中关。 后渐渐一起，直入脑满。 脑满之后，丹自玄膺而下，其味甘，其气香，至此则内丹成矣。 久则有征验，或身如坐饭中，热不可胜稍息，或四肢身体内外，玲如寒冰，然后和焉。 至此地分勿惊勿凝，后别有法，妙在心授口传。 入胎息法，就行回风混合法，使精合神，神合气，气合真，混合神丹，百日丹成。 修内丹至脑满，当行三一九室默朝上帝之道，功成诏至，飞升有期矣。 第二转法 诀曰：浸浴法，装药法，封固法，丹炉法，九转并同第一转法，后不复注。 丹砂一两，用第一转伏火丹砂四两，重装之，计生熟砂五两重，用猾石盒子，可容五两有余者，装满到之，封固行火。 第二转火候一两六钱 每转火皆三百六、十日，九转同，后不复注。 右二转阴数不服，四六八转同，后仿此。 第三转法 丹砂一两一钱半重，用第三转伏火丹砂五两重，依法制之，通计生熟砂六两二钱重，用滑石盒子可容六两二钱半有余者，装满到之。 第三转火候二两一钱 右三转神丹服者，亦依前法，首男乳汁糊圆之，如黑豆大，人参汤服之，当寿三百岁，能出阳神，游四海，与神人往来，玉女来侍，役使鬼神。 若以点化能丹阳，换骨脱壳，亦可乾汞。",
      "translated_text": "**Further Secrets of Cultivating the Internal Elixir**\n\nOne must never speak of the practice of refining the internal or external elixir, nor reveal its methods to others. If杂 persons or those who lack faith learn of this cultivation, or if one discusses it in their presence or allows them to witness it, the Dao of immortality cannot be attained. Once the elixir chamber is prepared, arrange a seat within it—whether a bench, a couch, or a meditation platform—ensuring the knees are level, neither too high nor too low. The pillow should be four fingers in height. The chamber’s humidity and dryness must be balanced, and all must be kept pure and clean. The bedding, clothing, and quilts should be thick and soft, while food, drink, decoctions, tea, and wine must be prepared with care, ensuring purity and moderation. Strictly avoid sexual defilement, excessive drunkenness, overindulgence, hunger, joy, anger, sorrow, or anxious thoughts. All perverse intentions and delusive imaginings must be absent, and the five pungent vegetables, along with foul impurities, should also be avoided. If one violates the taboo of sexual defilement or encounters foul impurities, the elixir will be harmed, and the practitioner’s progress will be hindered—failure will be imminent.\n\nThereafter, sit in joyful stillness each day, free from all attachments, with no wandering thoughts. The inner realm must not be disturbed, nor should external distractions intrude. The heart should be as bright and clear as a mirror, without a speck of dust; as pure and limpid as water, without a trace of sediment. Then, clench the fists as an infant does, press the lips and teeth together, and rest the tongue against the upper palate. Breathe softly and continuously, directing the gaze from the eyes to the nose, and from the nose to the navel. One will feel a thrilling sensation throughout the body’s pores, akin to the bliss of intimate union. This serves as verification.\n\nWhether sitting cross-legged, stretching the legs, standing, walking, or lying down, the ascent and descent of qi remain the same—profound principles reside within these practices. When lying down, one must not sleep, for sleep scatters the qi. If one can remain sleepless day and night, it is most excellent. If not, sleep should be minimized, gradually reducing it over time.\n\nThe practice of fetal breathing should be performed from the *zi* hour (11 PM–1 AM) to the *wu* hour (11 AM–1 PM), never from *wu* to *zi*. The period from *zi* to *wu* is called the Six Yang, during which qi is generated. From *wu* to *zi* is the Six Yin, when qi declines—this is of no benefit to the practitioner.\n\nIn practicing fetal breathing, embrace simplicity and profound stillness: close the nose, shut the eyes, and refrain from exhaling through the mouth, as if dwelling within the womb. Beginners should draw in qi through the nose and mouth, then hold it while silently counting to one hundred and twenty before exhaling through the mouth. The breath should be so subtle that the ears cannot detect its entry or exit, with inhalation exceeding exhalation. A method to test this is to place a goose feather before the nostrils—if the feather remains unmoved during exhalation, the technique is correct. Gradually increase the count of held breaths; with time, one may reach a thousand. Then, the aged will regain youth, the dead may be revived, plagues can be averted, tigers and snakes subdued, water and fire traversed, metal and stone penetrated, hunger and thirst dispelled, and life prolonged to defy death. One may even reverse the flow of water and fire. However, while practicing this method, avoid consuming excessive meat, raw vegetables, or rich, fatty foods, as these strengthen the qi, making it difficult to restrain. Guard against anger, for anger disrupts the qi.\n\nThe efficacy of fetal breathing is thus—this method must be kept secret. It is a teaching passed mouth-to-mouth, not an ordinary worldly text. Do not reveal it to the unworthy; guard it closely.\n\nNext, circulate the essence and qi from the *weilu* (tailbone) through the *jiaji* (spine) into the brain, entering at the *naohui* point (the nineteenth vertebra). The *jiaji* point lies below the twelfth vertebra. The method for replenishing the brain begins by tilting the head back and tightly sealing the third vertebra of the *dazhui* point to prevent qi from passing. First, close the *jiaji* to block the qi. The *dazhui* point is called the Upper Pass, and the *jiaji* point the Middle Pass. Gradually raise the qi until it fills the brain. Once the brain is full, the elixir will naturally descend from the *xuanying* (mysterious throat), its taste sweet and its fragrance pure—at this point, the internal elixir is complete.\n\nWith time, signs will manifest: the body may feel as though seated in a steaming rice pot, unbearably hot, or the limbs and entire body may grow cold as ice, both inside and out, before harmonizing. At this stage, do not be alarmed or fixated—further methods exist, transmitted orally and through direct instruction.\n\nThe method of fetal breathing, combined with the practice of returning wind and merging qi, unites essence with spirit, spirit with qi, and qi with the true. When the divine elixir merges, the elixir will form in a hundred days.\n\nWhen the internal elixir fills the brain, proceed with the method of silently paying homage to the Emperor in the Three-One and Nine Chambers. Upon completion of this merit, a celestial summons will arrive, and the time for ascension will draw near.\n\n**Second Cycle Method**\nThe instructions state: The methods of bathing, preparing the medicine, sealing, and the elixir furnace are the same as in the first cycle; they will not be repeated here. Take one *liang* of cinnabar and four *liang* of first-cycle refined cinnabar, combining them for a total of five *liang* of raw and prepared cinnabar. Use a mica box large enough to hold slightly more than five *liang*, fill it to the brim, seal it, and apply fire. The fire regulation for the second cycle is one *liang* and six *qian*. Each cycle’s firing lasts three hundred and sixty days; this applies to all nine cycles and will not be repeated.\n\nThe second cycle, being an even number, is not consumed. The fourth, sixth, and eighth cycles follow the same principle.\n\n**Third Cycle Method**\nTake one *liang*, one *qian*, and a half of cinnabar, and five *liang* of third-cycle refined cinnabar. Process them according to the method, yielding a total of six *liang* and two *qian* of raw and prepared cinnabar. Use a talc box large enough to hold slightly more than six *liang* and two and a half *qian*, fill it to the brim, and seal it. The fire regulation for the third cycle is two *liang* and one *qian*.\n\nThe divine elixir of the third cycle is consumed as follows: knead it with the milk of a firstborn son and form it into pills the size of black beans. Take them with ginseng decoction, and one may attain a lifespan of three hundred years, project the yang spirit, roam the four seas, commune with divine beings, and have jade maidens attend to them, commanding ghosts and spirits. If used for transmutation, it can refine cinnabar into yang elixir, allowing one to shed the mortal body and exchange bones. It can also transmute mercury.",
      "overlap_context": "aboos must be strictly observed, forbidding the presence of impure or inauspicious individuals—those who are elderly, ill, in mourning, postpartum, pregnant, foul-bodied, disabled, or infirm. Monks, Daoists, idlers, women, cats, dogs, and other animals must also be excluded. It is best to prevent outsiders from entering. Select two intelligent, sincere, and upright young boys as attendants, ensuring no one learns of the elixir chamber’s existence. The Dao of immortality values secrecy above all.",
      "start_char": 7808,
      "end_char": 9055,
      "start_sentence": 323,
      "end_sentence": 366,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.77442407608032,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "第四转法 丹砂一两五钱，用第三转伏火丹砂六两二钱半，装之，通计生熟砂七两七钱重，用滑石盒子可容七两七钱者，装满判之，封固行火。 第四转火候二两八钱 右四转不服，亦可点化。 第五转法 丹砂一两九钱重，用四转伏火丹砂七两七钱，匮之，通计生熟砂九两六钱重，用滑石盒子可容九两六钱有余者，装满到之，封固行火。 第五转火候一两八钱 右五转神丹，服之如前法，真酥丸如小豆大，乳香汤下服之，当寿五百岁，入水不溺，入火不焚，形神俱妙，列为仙官。 若以点化伏火丹砂一斤，可浇汞四两，名琼林玉树。 便可分比琼林汞宝作匮，转养朱砂，此名玉等，止可浇汞一二次，不然有损於丹。 第六转法 丹砂二两四钱，用五转伏火丹砂九两六钱，依法装之，通计生熟砂十二两重，用滑石盒子可容十二两有余者，装满对之，封固行火。 第六转火候二两八钱 右六转说如前。 第七转法 丹砂三两，用六转伏火丹砂十二两，装之用滑石盒子可容十五两有余者，装满到之，封固行火。 第七转火候二两一钱 丹至七转，服者用酝酗为丸，如蒙豆大，木香汤服之，寿千岁，功效不必具称。 若以铜钱铅锡入匮中，皆成上色银。 若以雄黄、硫黄、粉霜、毗石、灵砂入匮，随能伏火不走，分置诸匮各转之。 若以糁制蒙豆大，可乾汞一两成银。 投之三黄，即成赤金。 要当不可费用，止可验其功效。 第八转法 丹砂三两七钱，用第七转伏火丹砂十五两，依法装之，通计生熟砂十八两七钱重，用滑石盒子可容十八两七钱有余者，装满判之，封固行火。 第八转火候二两人钱 右第八转法同上。 第九转法 丹砂四两六钱，用八转伏火丹砂十八两七钱，依法装之，用滑石盒子可容二十三两三钱有余者，一生一熟，如法装之，装满判之，封固行火。 第九转火候一两六钱 丹成九转，又名紫金芽，服者以龙膏丸如黍米大。 龙膏者，桑上露水也。 每服一粒。 井泉中沉三日，方服井华一汲水服之。",
      "translated_text": "**Method for the Fourth Cycle**\nTake one *liang* and five *qian* of cinnabar and six *liang* and two and a half *qian* of third-cycle fire-tamed cinnabar, and fill the vessel. The total weight of raw and prepared cinnabar is seven *liang* and seven *qian*. Use a talc box large enough to hold seven *liang* and seven *qian*, fill it to the brim, seal it, and apply fire. The fire regulation for the fourth cycle is two *liang* and eight *qian*. The elixir of the fourth cycle is not for consumption but may be used for transmutation.\n\n**Method for the Fifth Cycle**\nTake one *liang* and nine *qian* of cinnabar and seven *liang* and seven *qian* of fourth-cycle fire-tamed cinnabar, and enclose them. The total weight of raw and prepared cinnabar is nine *liang* and six *qian*. Use a talc box large enough to hold slightly more than nine *liang* and six *qian*, fill it to the brim, seal it, and apply fire. The fire regulation for the fifth cycle is one *liang* and eight *qian*. The divine elixir of the fifth cycle is consumed as follows: knead it with refined butter into pills the size of small beans, and take them with frankincense decoction. One may attain a lifespan of five hundred years, enter water without drowning, enter fire without burning, and achieve perfection of both form and spirit, thereby being ranked among the immortals. If used for transmutation, one *jin* of fire-tamed cinnabar can refine four *liang* of mercury, producing *Qionglin Yushu* (\"Jade Trees of the Celestial Grove\"). This refined mercury may then be divided and used as a vessel to nurture cinnabar, a process called *Yudeng* (\"Jade Equivalent\"). However, it may only be used to refine mercury once or twice; otherwise, the elixir will be damaged.\n\n**Method for the Sixth Cycle**\nTake two *liang* and four *qian* of cinnabar and nine *liang* and six *qian* of fifth-cycle fire-tamed cinnabar, and fill the vessel according to the method. The total weight of raw and prepared cinnabar is twelve *liang*. Use a talc box large enough to hold slightly more than twelve *liang*, fill it to the brim, seal it, and apply fire. The fire regulation for the sixth cycle is two *liang* and eight *qian*. The details of the sixth cycle are as described above.\n\n**Method for the Seventh Cycle**\nTake three *liang* of cinnabar and twelve *liang* of sixth-cycle fire-tamed cinnabar, and fill the vessel. Use a talc box large enough to hold slightly more than fifteen *liang*, fill it to the brim, seal it, and apply fire. The fire regulation for the seventh cycle is two *liang* and one *qian*. Upon reaching the seventh cycle, the elixir is consumed by forming it into pills with fermented wine, the size of *meng* beans, and taking them with costus root decoction. One may attain a lifespan of a thousand years; its efficacies need not be fully enumerated. If copper coins, lead, or tin are placed in the vessel, they will all be transmuted into high-grade silver. If realgar, sulfur, *fenghuang*, *pishi*, or *lingsha* are placed in the vessel, they will be tamed by fire and prevented from volatilizing; they may then be divided and placed in separate vessels for further cycles. If the elixir is formed into pills the size of *meng* beans, it can refine one *liang* of mercury into silver. When added to the Three Yellows, it will transmute them into red gold. However, it should not be used wastefully but only to verify its efficacy.\n\n**Method for the Eighth Cycle**\nTake three *liang* and seven *qian* of cinnabar and fifteen *liang* of seventh-cycle fire-tamed cinnabar, and fill the vessel according to the method. The total weight of raw and prepared cinnabar is eighteen *liang* and seven *qian*. Use a talc box large enough to hold slightly more than eighteen *liang* and seven *qian*, fill it to the brim, seal it, and apply fire. The fire regulation for the eighth cycle is two *liang* and two *qian*. The method for the eighth cycle is the same as above.\n\n**Method for the Ninth Cycle**\nTake four *liang* and six *qian* of cinnabar and eighteen *liang* and seven *qian* of eighth-cycle fire-tamed cinnabar, and fill the vessel according to the method. Use a talc box large enough to hold slightly more than twenty-three *liang* and three *qian*, alternating one portion of raw and one portion of prepared cinnabar, fill it to the brim, seal it, and apply fire. The fire regulation for the ninth cycle is one *liang* and six *qian*. Upon completion of the ninth cycle, the elixir is also called *Zijin Ya* (\"Purple Gold Sprout\"). It is consumed by forming it into pills with *longgao*, the size of millet grains. *Longgao* refers to dew collected from mulberry leaves. Take one pill at a time, immerse it in well water for three days, and then consume it with the first draw of well water.",
      "overlap_context": " is consumed as follows: knead it with the milk of a firstborn son and form it into pills the size of black beans. Take them with ginseng decoction, and one may attain a lifespan of three hundred years, project the yang spirit, roam the four seas, commune with divine beings, and have jade maidens attend to them, commanding ghosts and spirits. If used for transmutation, it can refine cinnabar into yang elixir, allowing one to shed the mortal body and exchange bones. It can also transmute mercury.",
      "start_char": 9056,
      "end_char": 9863,
      "start_sentence": 367,
      "end_sentence": 400,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.818785667419434,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "九转依法，置丹其人生命上，及王相上，依经立坛，醮祭洁清斋戒，置灵宝符於五方，十二神符於辰上，八灵符置八方，掩天门，掩地户，历华盖，入阴中，取天心日天心时，置九宫，合丹者在中宫侍炉，先问日奇合，寻出宫为妙，丹成服黍米，飞升为真人矣。 秘之勿传。 如人欲死，以一粒口中，以水灌下，即活。 六月中死物腹中，不拘人畜，经夏不腐，此乃验也。 若用九转神丹，炼飞三黄，即同黄帝九鼎飞丹。 其法依上立坛洁清，又立九宫八卦龟形炉，上按天文，下按地理，以三黄置在丹砂上，以天盘盖之。 然后上火下水飞之，扫下玄霜，服一黍米，紫云随至，顷刻飞升。 若以点化，一粒乾汞五两成黄金。 至此岂可以俗利拘哉，是在言化耳。 接金液还丹法合成者，依经服一两，便升仙。 若未欲去代且住世为地仙者，斋一百日，服半两，则长生不死，万害百毒不能伤，可以畜妻子，若居官秩，在意所欲无所禁。 若后欲升天者，乃斋戒更服，满一两即便飞升矣。 凡欲升天，即皆断谷一年，方服之也。 又按此法凡服神丹大药，依经日数，即轻举升天，臧半服之，即长生不死，即是地仙无疑也。 上洞心丹经诀卷中竟 上洞心丹经诀卷下",
      "translated_text": "For the ninefold transmutation, place the elixir upon the recipient’s life-destiny and the astrological signs of regal ascendancy. According to the scripture, establish an altar, perform the libation rites, and maintain purity through fasting. Position the talismans of the Numinous Treasure at the five directions, the twelve spirit talismans at their respective celestial stems, and the eight numinous talismans at the eight directions. Seal the Gate of Heaven, seal the Door of Earth, pass beneath the canopy of flowers, enter the Yin realm, and seize the celestial heart at the hour of the Celestial Heart. Arrange the nine palaces, with the alchemist attending the furnace at the Central Palace. First inquire whether the day’s cyclical signs align; if so, proceed to exit the palace—this is most auspicious. Once the elixir is completed, consume a grain the size of millet, and ascend as a perfected one. Guard this secret; do not transmit it lightly.\n\nShould someone be on the verge of death, place one grain in their mouth and pour water to swallow it, and they shall revive. If a creature dies in the sixth month and the elixir is placed within its abdomen—whether human or beast—it will not decay through the summer; this is the proof. If the ninefold divine elixir is used to refine and sublimate the Three Yellows, it becomes equivalent to the Yellow Emperor’s Nine Cauldrons of Flying Elixir. The method follows the above: establish an altar in purity, then construct a nine-palace, eight-trigram furnace in the shape of a tortoise, aligning above with celestial patterns and below with terrestrial principles. Place the Three Yellows atop the cinnabar and cover it with the celestial plate. Then apply fire above and water below to sublimate it, sweeping up the dark frost. Consume a grain the size of millet, and purple clouds will arrive instantly, bearing one aloft in flight. For transmutation, a single grain can convert five *liang* of mercury into yellow gold. At this stage, how could one be constrained by worldly profit? It lies in the transformative power of the spoken word.\n\nFor the method of conjoining the Golden Liquid and Returning Elixir, once compounded, consume one *liang* to ascend as an immortal. If one does not yet wish to depart and instead desires to remain in the world as an earthbound immortal, fast for one hundred days and consume half a *liang*; thus, one attains longevity without death, immune to all harms and poisons, able to keep a family, hold office, or pursue desires without restriction. If later one wishes to ascend to heaven, fast and consume the full *liang*, and one shall immediately take flight. For those intending to ascend, one must abstain from grains for a full year before consumption.\n\nIn general, for those who consume divine elixirs and great medicines, following the scriptural prescribed days ensures effortless ascent to heaven. Consuming half the dose grants longevity without death, becoming an earthbound immortal without doubt.\n\nHere ends the *Middle Scroll of the Scripture and Oral Instructions on the Elixir of the Cavernous Heart*.\nHere begins the *Lower Scroll of the Scripture and Oral Instructions on the Elixir of the Cavernous Heart*.",
      "overlap_context": "tion of prepared cinnabar, fill it to the brim, seal it, and apply fire. The fire regulation for the ninth cycle is one *liang* and six *qian*. Upon completion of the ninth cycle, the elixir is also called *Zijin Ya* (\"Purple Gold Sprout\"). It is consumed by forming it into pills with *longgao*, the size of millet grains. *Longgao* refers to dew collected from mulberry leaves. Take one pill at a time, immerse it in well water for three days, and then consume it with the first draw of well water.",
      "start_char": 9863,
      "end_char": 10335,
      "start_sentence": 401,
      "end_sentence": 416,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.879416227340698,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "太极真人嗣孙手述 《黄帝圣纪经》曰：黄帝元年寅月寅日，斋於首山，方明牧力从黄帝以上，具茨谒大院君，授黄帝以《神芝灵图》十二卷，《金银方》十九首。 黄帝又登王屋山，开石函，发玉岌，得九鼎神丹飞雪炉火之道。 黄帝峨媚山见皇人，礼请神仙之道。 皇人曰：子岂不知，天有玄一，生於右阳，名为流珠，为众妙之门，得而修之，可令子长生，升云飞霄，上朝玉帝。 黄帝拜受，於荆山铸金鼎，修合流珠大还神丹，令传后人，而於鼎湖服而上升，时有大臣七十二人，得丹服之者，亦从黄帝上升。 先是黄帝恐金丹道绝，授於元子，令传后人。 而诚之此道至重，必以授贤者。 苟非其人、自招殃咎。 后元子又传束山子，自此以圣传圣，以贤传贤，以仁传仁，得道者不可胜计。 天之爱人甚矣。 而人自非，心不合道，固难成也。 太上内丹歌 真铅之精、在混沌中，生天地先。 混沌既分，乃成四象，而立五行。 得天地本，立性命胚，符合寒暑，优游丹台，十月满足，如子脱胎，获此玄珠，神明自来。 太上外丹经节 大道守真，三品为则，以一为度，以正为德，故炼金液者神方也。 妙玄清虚，莫不由金符而得道。 履九幽而入冥，上下虚无，因神明而得升。 即授喜《太清八符经》、《太清观天经》、《九都经》、《神丹经》、《金液经》，八炼九转还丹伏火之诀焉。 其方曰：金液还丹，仙华流珠。 高飞云霞，翔登天丘。 黄赤之物，须臾当得。 雄雌纷珠，可以腾变，以致行厨。 灵人玉女，与我俱游，出入无问，与天同符。 其精凝霜，善致沉浮。 汝其震钦，必游仙都。 金液之诀，尽於此矣。 夫水银朱砂，硝液流珠，以作神丹，服一刀圭，飞升天宫。 丹成作金，以为食器，乃得神仙。 汝审欲神仙，先当服还丹金液，乃存其神，即得升天，上为真人。 汝不服还丹金液，当自苦尔，为寒湿风鬼所击，司命不能救也。 道之如此，可不勉哉。 汝善温衣少食，适体守虚，虚无自然，鬼亦不能杀也。 年寿尽终，即自死耳。 何以言之，以其不坚无神故也。 譬犹万物之生，非欲求死，但自老朽枯槁腐死耳。 人亦如此矣。 吾以作祸，则妖魅试人，猛兽伤人，蛇蝗螫之矣。 昔左元放於天柱山中精思，而感神人，授之以金丹仙经。 会汉末大乱，不遑合作，而避地江束，志造名山，以修此道。 乃以神丹经等，授弟子葛仙翁，又以授弟子郑君。 郑君家贫，无以买药。 而葛洪者，郑君之弟子，亲事勤苦，乃於马迹山立坛，授洪丹经并诸口诀。 谓洪日：吾承先师左君之诫，曰诸小山中不可居作神丹也。 且小山之中，无有正神，皆是木之精，千岁老物，血食之鬼，此辈是邪气，不念人修道作福，但欲於祸人也。 夫斋洁之士，虽以术数辟身，而鬼魅或能坏人药也。 今合医家佳药好膏，皆尚不欲令鸡犬及妇人小儿等见之，如药被见者，用便不验。 又染彩物者，遇恶目见之，皆失其色也。 况神仙长生之大药乎。 古之道士合作神药，必入名山无人之地，终不止於小小凡山中，正为此也。 又按仙经，可以精思合於仙药山者，有泰山，华山，霍山，但山，嵩高山，少室，太白，终南等山。 此中皆有正神，其中有地仙，又生芝草，可以辟大难，不但堪合药也，若有道者登之，则此山神必助之为福也，至药必成。",
      "translated_text": "The Venerable Heir of the Supreme Ultimate Realized One personally transmitted *The Sage Annals of the Yellow Emperor*, which states: In the first year of the Yellow Emperor’s reign, on the first *yin* day of the *yin* month, he fasted at Mount Shou. Fang Ming and Mu Li followed the Yellow Emperor above, where they visited the Great Court Lord at Mount Juci and received from him *The Divine Mushroom Spirit Charts* in twelve scrolls and *The Gold and Silver Formulas* in nineteen sections. The Yellow Emperor then ascended Mount Wangwu, opened the stone casket, and uncovered the jade lid, obtaining the Way of the Nine Cauldrons’ Divine Elixir and the Flying Snow Furnace Fire. On Mount Emei, the Yellow Emperor met the August Person and respectfully sought the Dao of divine transcendence. The August Person said: “Do you not know that Heaven possesses the Dark One, born of the right yang, named Flowing Pearl, the gate of all mysteries? If you obtain and cultivate it, you may attain longevity, ascend the clouds and soar through the skies, and ascend to pay homage to the Jade Emperor.” The Yellow Emperor bowed and received the teaching. On Mount Jing, he cast a golden crucible and compounded the Great Return Divine Elixir of Flowing Pearl, transmitting it to later generations. At Dingshu Pond, he consumed the elixir and ascended. At that time, seventy-two great ministers who had also consumed the elixir ascended with the Yellow Emperor. Previously, the Yellow Emperor, fearing the Way of the Golden Elixir would be lost, entrusted it to his eldest son, commanding him to transmit it to later generations. He admonished that this Way is most weighty and must be transmitted only to the worthy. If entrusted to the unworthy, they bring calamity upon themselves. Later, the eldest son transmitted it to Master Shushan, and from then on, the sagely transmitted to the sagely, the worthy to the worthy, and the benevolent to the benevolent. Those who attained the Dao were beyond count. Heaven’s love for humanity is profound, yet people, if their hearts do not align with the Dao, inherently make success difficult.\n\n**Song of the Internal Elixir of the Supreme**\nThe essence of true lead lies within primordial chaos,\nBorn before Heaven and Earth.\nWhen chaos divided, the four images took form,\nAnd the five phases were established.\nGrasping the root of Heaven and Earth, the embryo of nature and life is founded,\nHarmonizing with the cycles of cold and heat.\nRoaming leisurely in the cinnabar terrace,\nAfter ten months, like a child emerging from the womb,\nOne obtains this mysterious pearl,\nAnd spiritual illumination naturally arrives.\n\n**Excerpts from the External Elixir Scripture of the Supreme**\nThe Great Dao preserves the true; the three grades serve as its rule.\nOne is its measure, rectitude its virtue.\nThus, refining the golden liquid is the divine method.\nSubtle mystery and pure emptiness—none attain the Dao without the golden tally.\nTreading the nine depths and entering the dark,\nAscending and descending through the void,\nOne attains ascent through spiritual illumination.\nThereupon, he transmitted with joy *The Supreme Clarity Eight Talismans Scripture*, *The Supreme Clarity Scripture on Observing Heaven*, *The Nine Capitals Scripture*, *The Divine Elixir Scripture*, *The Golden Liquid Scripture*, and the oral instructions on the eight refinements, nine revolutions, returning elixir, and fire-taming.\n\nIts formula states:\nGolden liquid returning elixir, immortal blossom flowing pearl.\nSoaring high through clouds and mist, ascending to the celestial mounds.\nYellow and red substances, obtained in an instant.\nMale and female scattered pearls, enabling transformation and transcendence,\nSummoning the traveling kitchen.\nDivine persons and jade maidens accompany me in roaming,\nEntering and exiting without question, in harmony with Heaven.\nIts essence congeals like frost, skillfully achieving sinking and floating.\nIf you reverently heed this, you shall surely wander the immortal capital.\nThe oral instructions on the golden liquid are complete herein.\n\nIts essence: cinnabar, mercury, and saltpeter liquid flowing pearls,\nUsed to compound the divine elixir.\nConsuming one *daogui* allows ascent to the celestial palace.\nWhen the elixir is complete and made into gold,\nIt may be used as dining vessels, thereby attaining divine transcendence.\nIf you truly desire divine transcendence,\nFirst consume the returning elixir and golden liquid,\nThereby preserving your spirit, and you shall ascend to Heaven,\nBecoming a perfected person above.\nIf you do not consume the returning elixir and golden liquid,\nYou shall suffer cold, dampness, and wind spirits striking you,\nAnd the Controller of Destinies will be unable to save you.\nThe Dao is thus—how can you not exert yourself?\nYou should wear warm clothing, eat sparingly,\nAdapt to the body, and preserve emptiness.\nIn emptiness and naturalness, even ghosts cannot kill you.\nWhen your years and lifespan reach their end, you shall simply die.\nWhy say this? Because without firmness and spirit, one perishes.\nIt is like the myriad things that grow—not desiring death,\nBut naturally aging, withering, decaying, and dying.\nPeople are the same.\nIf I bring misfortune upon myself,\nDemonic beings test people, fierce beasts harm people,\nSnakes and centipedes sting them.\nFormerly, Zuo Yuanfang, through concentrated meditation at Mount Tianzhu,\nAttracted divine persons, who transmitted to him the *Divine Elixir Immortal Scripture*.\nDuring the great chaos at the end of the Han,\nHe had no leisure to compound the elixir and fled to the lands east of the Yangtze,\nResolving to visit famous mountains to cultivate this Way.\nHe transmitted the *Divine Elixir Scripture* and other texts to his disciple, Immortal Master Ge,\nWho in turn transmitted them to his disciple, Master Zheng.\nMaster Zheng, being poor and unable to purchase ingredients,\nHad his disciple Ge Hong, who served him diligently and assiduously,\nEstablish an altar at Mount Maji and transmit to Hong the elixir scriptures and various oral instructions.\nHe said to Hong: “I received the admonition of my former master, Master Zuo, that one must not reside and compound the divine elixir in small mountains.\nMoreover, in small mountains, there are no true spirits,\nOnly the essences of trees, thousand-year-old creatures, and blood-consuming ghosts.\nThese beings are of perverse qi, not wishing people to cultivate the Dao and perform good deeds,\nBut only desiring to bring calamity upon them.\nEven if a person of purity and refinement uses arts and numbers to protect themselves,\nGhosts and demons may still spoil their medicine.\nNow, when physicians compound fine medicines and good ointments,\nThey still do not wish chickens, dogs, women, or children to see them.\nIf the medicine is seen, its efficacy is lost.\nMoreover, dyed and colored objects, when seen by ill-intentioned eyes, lose their luster.\nHow much more so for the great medicine of divine transcendence and longevity?\nAncient Daoists compounding divine medicines\nInevitably entered famous mountains in uninhabited lands,\nNever stopping in small, ordinary mountains—precisely for this reason.\nFurthermore, according to the immortal scriptures,\nMountains where one may concentrate and compound immortal medicines include:\nMount Tai, Mount Hua, Mount Huo, Mount Dai,\nMount Song, Mount Shaoshi, Mount Taibai, and Mount Zhongnan.\nThese mountains all possess true spirits,\nWithin them reside earthbound immortals,\nAnd they produce *zhi* herbs that can avert great calamities.\nNot only are they suitable for compounding medicines,\nBut if a person of the Dao ascends them,\nThe mountain spirits will surely assist them in attaining good fortune,\nAnd their medicines will certainly be completed.”",
      "overlap_context": " a full year before consumption.\n\nIn general, for those who consume divine elixirs and great medicines, following the scriptural prescribed days ensures effortless ascent to heaven. Consuming half the dose grants longevity without death, becoming an earthbound immortal without doubt.\n\nHere ends the *Middle Scroll of the Scripture and Oral Instructions on the Elixir of the Cavernous Heart*.\nHere begins the *Lower Scroll of the Scripture and Oral Instructions on the Elixir of the Cavernous Heart*.",
      "start_char": 10335,
      "end_char": 11587,
      "start_sentence": 417,
      "end_sentence": 470,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.201579332351685,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "凡山大则神大，山小则神小，无防避之道，有必思害也。 或被疾病，或遭惊怖，或患伤刺，或闻异声，或逢变异，或见光景，或大木不风而摧折，或岩石无辜而自堕，或令人迷乱狂走坠落坑谷，或猛兽毒蛇犯伤人，故不可轻入也。 凡入山，当择四时旺相，干支相生之日，吉也。 束岳忌甲乙寅卯岁月入，南岳忌丙丁巳午岁月入，中岳忌戊己辰戌丑未岁月入，西岳忌庚辛申酉岁月入，北岳忌壬癸亥子岁月入。 但所之此山，属其岳之方面者，皆悉禁此岁月也。 《灵宝经》云：入山当以保日及义日、专日，大吉。 若以制日、伐日，必死。 保日者，干支上生下也，如甲午、乙巳是也。 义日者，干支下生上也，如壬申、癸酉是也。 制日者，支干上克下也，如戊子、己亥是也。 伐日者，支干下克上也，如甲申、乙酉是也。 专日者，支干比和也，如甲寅、乙卯是也。 入名山当以甲子开除日，以五色彩缯各五寸，悬石上，所求必得。 入名山亦癸之时，此谓天心日，必得仙道度世也。 入山良日，甲子、甲午、甲寅、乙亥乙卯、乙巳、丙戌、丙午、丙辰，皆大吉，必安隐得道。 大月忌日，初三、十一、十伍、十八、二十四、二十六、三十日。 小月忌日，初一、初五、十三、十六、二十八。 若犯此日入山，既为山神所试，所求不得，所作不成。 岂但道士忌之，凡人此日入山，皆凶，与虎狼毒虫喜相见。 入山宜知六甲秘诀，呎日：临兵斗者皆阵列前行。 凡九字当密呎之，无不辟恶，要道不烦也。 又入山月忌之日，正月午，二月亥，三月甲，四月戊，五月戌，六月申，七月甲子，八月甲午，九月寅，十月辰，十一月乙，十二月丑。 上古入山合丹求道，洁挣，责《三皇文》及《五岳真形图》，所召山神，及按鬼录召里社及山卿泽尉问之，则知木石之怪，山川之精，不敢来试人也。 凡诸邪物，自然远匿。 黄帝束到青丘，见紫府先生，受《三皇文》，劝召万神即此。 凡入山合丹，欲辟山川庙坐百神鬼之法，最以符为切要。 神仙大药，亦资符力而辟卫也。 符法者，老子於神人授之者也。 今人用之而少验者，由於传写多误，又信心不笃，徒施用之。 然凡求长生，制之在药，不由符力，而能致之仙也。 然不可废者，藉其却鬼辟邪，以丹之渐。 入名山责召高山君符 此符斋十日，召高山君使，除虎狼之害。 其符以丹书缯上，一尺二寸长，亦如之。 若书时不得中息而语也。 书毕，烧香，夜於挣室之中，随月建立，着新衣服而召之。 凡用符，以大字着左右心前，怛正思慕其象之宜，旁召六甲直符，并玉女名字，所召之书，仰视面想，思八方之外，存神长五尺，衣服如《 六甲经》 。 此登山符，仙人陈安世入山，甲寅日书白素上，夜向北斗，祭以酒脯，自说姓名，以着衣领中，辟邪精百鬼、老 物虎狼毒虫，带之置案上，面向北斗。 此符一本书点画如此，用法如前同，只点画大同小异，与前不同，其功效一种无别，故两存之。 此符以丹书绢素，各异之，带着肘后，男左女右，亦可以书白素带之，可以着住处四方各一枚。 若移徙，当先令人拔取。 此符大神，勿妄传也。 此符亦是登山，功效不异，是老君黄庭三十九真秘符，辟百鬼，合仙药，和合之处住，必须名山极探之处，无人",
      "translated_text": "Great mountains possess great spirits; small mountains possess small spirits. Without methods of avoidance, one will inevitably encounter harm. This may manifest as illness, sudden fright, injuries from thorns or blades, hearing strange sounds, encountering anomalies, witnessing apparitions, or seeing great trees topple without wind, or cliffs and boulders crumble without cause. One may become disoriented, run wildly, and fall into ravines, or be harmed by fierce beasts and venomous snakes—thus, one must not enter lightly.\n\nWhen entering mountains, one should choose days of seasonal vigor, when the heavenly stems and earthly branches mutually engender, for these are auspicious. Mount Tai forbids entry in *jia-yi* (甲乙) years and *yin-mao* (寅卯) months; Mount Heng in the south forbids entry in *bing-ding* (丙丁) years and *si-wu* (巳午) months; the Central Peak forbids entry in *wu-ji* (戊己) years and *chen-xu-chou-wei* (辰戌丑未) months; Mount Hua in the west forbids entry in *geng-xin* (庚辛) years and *shen-you* (申酉) months; and Mount Heng in the north forbids entry in *ren-gui* (壬癸) years and *hai-zi* (亥子) months. Wherever one goes among these mountains, if the region belongs to a particular peak’s domain, all such years and months are forbidden.\n\nThe *Lingbao Scripture* states: When entering mountains, one should choose *bao* days, *yi* days, or *zhuan* days—all greatly auspicious. If one enters on *zhi* days or *fa* days, death is certain.\n- *Bao* days are when the heavenly stem engenders the earthly branch, such as *jia-wu* (甲午) or *yi-si* (乙巳).\n- *Yi* days are when the earthly branch engenders the heavenly stem, such as *ren-shen* (壬申) or *gui-you* (癸酉).\n- *Zhi* days are when the earthly branch restricts the heavenly stem, such as *wu-zi* (戊子) or *ji-hai* (己亥).\n- *Fa* days are when the heavenly stem restricts the earthly branch, such as *jia-shen* (甲申) or *yi-you* (乙酉).\n- *Zhuan* days are when the heavenly stem and earthly branch are in harmony, such as *jia-yin* (甲寅) or *yi-mao* (乙卯).\n\nWhen entering famous mountains, one should choose the *jia-zi* day of the opening or removal phase, and hang five-inch strips of five-colored silk on stones—whatever is sought will surely be obtained. Entering famous mountains during the *gui* hour is called the \"Day of Heaven’s Heart,\" and one will certainly attain the Dao and transcend the world.\n\nAuspicious days for entering mountains include *jia-zi*, *jia-wu*, *jia-yin*, *yi-hai*, *yi-mao*, *yi-si*, *bing-xu*, *bing-wu*, and *bing-chen*—all greatly auspicious, ensuring safety and the attainment of the Dao.\n\nDays to avoid in a long month: the 3rd, 11th, 15th, 18th, 24th, 26th, and 30th.\nDays to avoid in a short month: the 1st, 5th, 13th, 16th, and 28th.\nIf one enters mountains on these days, the mountain spirits will test them, and whatever is sought will not be obtained, nor will any endeavor succeed. Not only Daoists must avoid these days—ordinary people entering mountains on such days will meet with misfortune, encountering tigers, wolves, and venomous creatures.\n\nWhen entering mountains, one should know the secret art of the Six *Jia*: recite the incantation, *\"Lin bing dou zhe jie zhen lie qian xing.\"* Silently recite these nine characters, and nothing evil will be unaverted—this is an essential method, not to be neglected.\n\nAdditionally, avoid entering mountains on the following monthly taboo days:\n- First month: *wu* (午) day\n- Second month: *hai* (亥) day\n- Third month: *jia* (甲) day\n- Fourth month: *wu* (戊) day\n- Fifth month: *xu* (戌) day\n- Sixth month: *shen* (申) day\n- Seventh month: *jia-zi* (甲子) day\n- Eighth month: *jia-wu* (甲午) day\n- Ninth month: *yin* (寅) day\n- Tenth month: *chen* (辰) day\n- Eleventh month: *yi* (乙) day\n- Twelfth month: *chou* (丑) day\n\nIn ancient times, when entering mountains to compound the elixir and seek the Dao, one would purify oneself and carry the *Writings of the Three Sovereigns* and the *True Forms of the Five Peaks*. By summoning the mountain spirits and consulting the *Register of Ghosts* to invoke the local deities and mountain marshals, one would learn of the anomalies among trees and stones, and the spirits of mountains and rivers, so they would not dare to test the practitioner. All malevolent entities would naturally flee far away. When the Yellow Emperor journeyed east to Green Mound and met the Master of the Purple Palace, he received the *Writings of the Three Sovereigns*—this was to summon the myriad spirits.\n\nWhen entering mountains to compound the elixir, the method to repel the hundred spirits and ghosts of mountain shrines relies most critically on talismans. The great medicines of immortals also depend on the power of talismans for protection. The art of talismans was transmitted by Laozi to divine beings. That people today use them with little efficacy is due to errors in transmission and copying, as well as a lack of sincere faith, rendering their application futile.\n\nYet while the attainment of longevity fundamentally depends on the elixir rather than talismanic power, talismans cannot be abandoned, for they repel ghosts and evil, aiding the gradual refinement of the elixir.\n\n**Talisman for Summoning the Lord of Lofty Mountains**\nThis talisman, when purified for ten days, summons the Lord of Lofty Mountains to dispel harm from tigers and wolves. The talisman is inscribed in cinnabar on silk, twelve inches in length. While writing, one must not pause to speak. Upon completion, burn incense and, in the purification chamber at night, align with the monthly branch, don new garments, and perform the summoning.\n\nWhen using talismans, place large characters on the left and right before the heart, constantly visualizing their proper form. Summon the *liu jia* attendant talismans and the names of the Jade Maidens, reciting the invocation while gazing upward and envisioning the spirits—each five feet tall, clad as described in the *Scripture of the Six Jia*. This is the mountain-climbing talisman.\n\nWhen Immortal Chen Anshi entered the mountains, he inscribed this talisman on white silk on a *jia-yin* day, faced the Northern Dipper at night, and offered wine and dried meat. Stating his name, he placed the talisman in his collar to repel evil spirits, hundred ghosts, old creatures, tigers, wolves, and venomous insects. When placed on a table, it should face the Northern Dipper.\n\nThis talisman’s strokes differ slightly from the previous one, but its method of use and efficacy remain the same—thus, both are preserved. Inscribe it in cinnabar on silk, wear it on the left arm (right for women), or write it on white silk to wear. It may also be placed at the four corners of one’s dwelling. When moving, have someone retrieve it first.\n\nThis is a great talisman of the gods—do not transmit it carelessly.\n\nThis talisman, too, is for mountain entry, with identical efficacy. It is one of the thirty-nine secret talismans of the *Yellow Court*, repelling hundred ghosts. Wherever one compounds immortal medicines or resides in the deepest recesses of famous mountains, no one must be present.",
      "overlap_context": "pound immortal medicines include:\nMount Tai, Mount Hua, Mount Huo, Mount Dai,\nMount Song, Mount Shaoshi, Mount Taibai, and Mount Zhongnan.\nThese mountains all possess true spirits,\nWithin them reside earthbound immortals,\nAnd they produce *zhi* herbs that can avert great calamities.\nNot only are they suitable for compounding medicines,\nBut if a person of the Dao ascends them,\nThe mountain spirits will surely assist them in attaining good fortune,\nAnd their medicines will certainly be completed.”",
      "start_char": 11588,
      "end_char": 12864,
      "start_sentence": 471,
      "end_sentence": 514,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.937572956085205,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "畜行迹，乃有束流水，大石岩室之中。 若无岩石室，可於深林之中无人迹处作室，常须近水，非其处，勿措意作神药，大山无束流水，西流亦得。 此得居山住处安，以丹书柏板上，大文书令，弥满其板，上着门上四方四隅，及所行道之处安之，并五十步，辟诸精也。 此符是去狼虎之符，与前同移徙板，将辟山精用。 按为道者多在山林之问，乃是虎狼毒蛇、精怪魍魉之窟穴也，不深防辟，损害药也。 辟百蛇即及却虎狼符 此二神印，取枣心刻之，方之二寸，毕设祭再拜请，佩之甚有效。 此黄首朱宫玉女简房教导之印，能却虎狼不敢前，此亦可为符朱书，吞之，入山辟虎狼，亦可为印，出《玉胎经》也。 此符却鬼，合药时悬安四面，制诸鬼，大神验。 一本中心有七曲，余并同，不知误者。 此山居符，书之於柏板上，安门四角，虎狼不至。 已上三符，并用朱书。 屯符，有一本下如屯。 此开山符，以千岁虆为奏，长尺二寸，以丹书此符，以印大石名山，山门即开，宝书亦出，金玉皆见。 千岁虆者，天慈也，如鼠耳，却鬼制魅也。 右於深山静处作丹屋，四角悬铃子，并作却鬼药、却鬼符，安四面，然后可合药。 若不然者，鬼神吸其药精 尽，或变却，是以须作符厌禳之。 却鬼药法，以光明砂、雄黄、雌黄、麝香、附子、白米、鬼臼、鬼箭，各二等，蜜丸之带。 昔黄帝受丹经於玄女，访真一於皇人。 故云长生仙方，唯有金丹。 守形却恶，独有真一，古人尤重焉。 仙经曰：九转金丹经守一诀，皆在昆仑五城之内，藏以玉函，克之金扎，封以紫芝，印以中章，此盖上圣宝秘之法也。 身疾未愈，神丹未就，年命未定，众邪未遣，守一之道不可不知也。 入山守一，则百毒不敢近，人不须诸法，百邪自去也。 作丹屋法 先择得探山临水悬岩静处，人畜绝迹，施带符印符室法庭前，其室方十二步，高一一丈四尺，南门着扉，门前使有东流水，东日西月，表裹香泥，泥之 四方，各作主丹符也。 於室中立五岳 三台，西方壁下别立层坛，置诸药草， 及神丹经诀目录，并布於上。 即有生 药使者护之，万灵不能干也。 合和防辟法 凡欲合丹，於山中安堵讫，乃召山神，请问可否，方得安稳施行，万无不成。 其法如左，此后诸法，仙翁持用诸符也。 斋十日，丹书黄素一尺，於山草问，召中岳君主，欲作神丹，先召问其节度以符字。 老子合神丹之日，以朱书白素八寸，盛以绛囊，系心前。 欲服丹者，当迎七日服之，即便通灵役使，此名太一 八寸素符。 此符合丹人服之，令心开，勿污辱之。 太清神丹宝经，凝炼八石，五耀七明，玄官宝镇，检御火灵，九转成华，长升太清。 祝毕，以青锦囊盛符，击於颈上。 此符检制石精，令不飞亡，使姻霜充满，神华凝结。 却害符，以丹书白纸上，广三寸，长四寸，以投炉中，即伏精。 思常见神光加精，诸神来至，仙人玉女来见也。 即神丹成，天地鬼邪不能害也。 法日：夫欲为神丹，五石变化，出五金之法，皆当谒天上皇道君，受五神符，则五石五金，随意而化，争出其精。 青帝符法，甲乙日白茆为藉，长三尺，青缯长一丈二尺，布藉上，酒二杯， 脯二朐，以缯为地，墨书符，广二寸，长七寸，置藉上。",
      "translated_text": "Wherever one keeps traces of livestock, there must be a stream confined by water, within a great stone cavern. If no such cavern exists, one may construct a chamber deep in the forest where no human tracks are found—always near water. Without such a place, do not attempt to compound divine medicines. In great mountains lacking a confined stream, a westward-flowing one will suffice.\n\nOnce a mountain dwelling is secured, inscribe cinnabar on cypress boards, filling them with large talismanic script. Place these above the door, at the four corners and four directions of the dwelling, and along the paths one frequents, every fifty paces, to repel all spirits. This talisman wards off wolves and tigers, and when moving, the boards may be carried to dispel mountain spirits.\n\nMost Dao practitioners dwell in mountains and forests—dens of tigers, wolves, venomous snakes, and spectral creatures. Without deep precautions, harm will befall one’s medicines.\n\nThe talisman for repelling a hundred snakes also serves as a charm against tigers and wolves. These two divine seals are carved from jujube wood, two inches square. After setting up an offering and bowing twice to invoke them, wearing them proves highly effective. This is the seal of the Jade Maiden of the Vermilion Palace, taught by the Yellow-Headed Instructress, which keeps tigers and wolves at bay. It may also be written in cinnabar as a talisman and swallowed before entering mountains to repel such beasts, or used as a seal, as recorded in the *Scripture of the Jade Embryo*.\n\nThis talisman repels ghosts. When compounding medicines, hang it on all four sides to subdue all spirits—greatly efficacious. One version has seven curves at its center; the rest remains the same, though some may be mistaken.\n\nThis mountain-residence talisman, inscribed on cypress boards and placed at the four corners of a door, prevents tigers and wolves from approaching. The three talismans above are all written in cinnabar.\n\nThe *Tun* talisman has one version with a *tun* character at its base.\n\nThis is the *Mountain-Opening Talisman*. Write it in cinnabar on a petition made from thousand-year-old *lei* vine, twelve inches long, and press it onto the great stones of a famous mountain—the mountain gate will open, revealing treasured scriptures, and gold and jade will appear. The thousand-year-old *lei* vine, also called *tianci*, resembles a mouse’s ear and repels ghosts and demons.\n\nWhen constructing a cinnabar chamber deep in the mountains, hang bells at the four corners and place ghost-repelling medicines and talismans on all sides before compounding medicines. Otherwise, spirits will drain the essence of the medicines or alter them—thus, talismans must be used to suppress and ward them off.\n\nThe method for ghost-repelling medicine: combine equal parts luminous cinnabar, realgar, orpiment, musk, aconite, white rice, *ghost’s umbrella*, and *ghost’s arrow*, forming honeyed pills to carry.\n\nOf old, the Yellow Emperor received the *Elixir Scripture* from the Dark Maiden and sought the True Unity from the August Person. Thus it is said: the immortal formula for longevity lies solely in the Golden Elixir; the sole method for preserving form and repelling evil is the True Unity—ancient sages held it in the highest regard.\n\nThe immortal scriptures state: the *Nine-Transformations Golden Elixir Scripture* and the *Guardian Unity Formula* are both concealed within the Five Cities of Kunlun, stored in jade cases bound with gold straps, sealed with purple mushrooms, and stamped with the Central Seal—this is the most sacred and secret method of the highest sages.\n\nIf bodily ailments are not yet cured, the divine elixir not yet completed, one’s lifespan not yet fixed, and myriad evils not yet dispelled, the Way of Guarding Unity must not be unknown. Entering mountains while guarding unity ensures no poisons dare approach, and without need for other methods, all evils depart of their own accord.\n\n**Method for Constructing a Cinnabar Chamber**\nFirst, select a secluded place deep in the mountains, near water and beneath a hanging cliff, where traces of humans and livestock are absent. Apply talismans and seals to the chamber and its courtyard. The chamber should be twelve paces square and fourteen feet high, with a southern-facing door. Ensure a stream flows eastward before the door, with the sun to the east and the moon to the west. Plaster the interior and exterior with fragrant mud, and inscribe the main cinnabar talismans on the four walls.\n\nWithin the chamber, erect the Five Peaks and Three Terraces. Against the western wall, construct a layered altar to arrange medicinal herbs, the *Divine Elixir Scripture*, and its formulas and catalogues. Then, the spirits of living medicines will guard it, and no spirits will dare interfere.\n\n**Method for Protection and Warding When Compounding Elixirs**\nBefore compounding an elixir in the mountains, first secure a dwelling, then summon the mountain spirit to inquire whether it is permissible—only then may one proceed safely, with certainty of success. The method is as follows; these subsequent methods are the talismans used by the Immortal Elder.\n\nFast for ten days, then write on a one-foot yellow silk in cinnabar, amidst mountain grasses, to summon the Lord of the Central Peak. Before compounding the divine elixir, first inquire about the proper procedures using this talismanic script.\n\nOn the day the Old Master compounds the divine elixir, write in cinnabar on an eight-inch white silk, place it in a crimson pouch, and tie it before the heart. One who wishes to ingest the elixir should fast for seven days before consuming it, whereupon they will attain spiritual communication and command spirits—this is called the *Eight-Inch Silk Talisman of the Great Unity*. This talisman, when ingested by one compounding the elixir, opens the heart—do not defile it.\n\nThe *Treasure Scripture of the Divine Elixir of Great Clarity* refines the eight stones, the five luminaries and seven radiances, the treasure of the Dark Palace, controlling the spirits of fire. After nine transformations, it ascends as blossoms to the Great Clarity. Upon completing the incantation, place the talisman in a blue-green brocade pouch and wear it around the neck. This talisman restrains the essence of stones, preventing them from flying away, filling the crucible with mist and frost, and causing the divine blossoms to congeal.\n\nThe *Harm-Repelling Talisman*, written in cinnabar on white paper, three inches wide and four inches long, is cast into the furnace to subdue the essence. One should constantly perceive divine light intensifying, with all spirits arriving and immortals and jade maidens appearing. Then the divine elixir is complete, and no ghosts or demons of heaven and earth can harm it.\n\nThe method states: Those who wish to create the divine elixir, transforming the five stones and producing the five metals, must first pay homage to the Heavenly August Lord of the Dao and receive the five divine talismans—then the five stones and five metals will transform at will, their essences competing to emerge.\n\n**Method for the Talisman of the Green Emperor**\nOn *jia-yi* days, use white cogon grass as a mat, three feet long. Spread a twelve-foot length of green silk over the mat, with two cups of wine and two strips of dried meat. Use the silk as a base, write the talisman in ink, two inches wide and seven inches long, and place it on the mat.",
      "overlap_context": "en), or write it on white silk to wear. It may also be placed at the four corners of one’s dwelling. When moving, have someone retrieve it first.\n\nThis is a great talisman of the gods—do not transmit it carelessly.\n\nThis talisman, too, is for mountain entry, with identical efficacy. It is one of the thirty-nine secret talismans of the *Yellow Court*, repelling hundred ghosts. Wherever one compounds immortal medicines or resides in the deepest recesses of famous mountains, no one must be present.",
      "start_char": 12864,
      "end_char": 14169,
      "start_sentence": 515,
      "end_sentence": 564,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.02865982055664,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "咒曰：吉日良时，小兆臣某再拜，谨受上皇道君青帝神符，因再拜，烧符服之。 此应一个符图，写校差参，须详审之。 赤帝符法，以丙丁日白茅藉，长三尺，绛缯长一丈三尺，布藉上，酒二杯，脯二胸，以丹书符，广二寸，投符藉上。 呎日：吉日良时，小兆臣玄再拜，受上皇道君赤帝神符，因再拜，烧符吞之。 黄帝符法，以戊己日白茆为藉，长三尺，黄缯长一丈一一尺，布席上，酒二杯，脯二朐，朱为地，以紫书符，广三寸，长七寸，投席上。 咒曰：吉日良时，小兆臣玄再拜，受上皇道君黄帝神符，因再拜，烧符服之。 右已上大寥落不相附近，计是一符，复用审之。 白帝符法，以庚辛日白茆为藉， 三尺，白素长一丈亡一尺，布藉上， ，脯二朐，绿为地，以丹书符， ，长七寸，投藉上，睨曰：吉日良时，兆臣玄再拜，受上皇道君白帝神符， 因再拜，烧符服之。 黑帝符法，以壬癸日白茆为藉，长三尺，皂缯长一丈一一尺，布藉上，酒一一杯，脯二胸，黑为地，以丹书符，广二 寸，长七寸，投藉上。 呎日：吉日良",
      "translated_text": "The incantation states: On an auspicious day and hour, this humble servant [Name] bows twice and reverently receives the Green Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\nHere follows one talisman diagram—any discrepancies in transcription must be carefully examined.\n\n**Method for the Talisman of the Red Emperor**\nOn *bing-ding* days, use white cogon grass as a mat, three feet long. Spread a thirteen-foot length of crimson silk over the mat, with two cups of wine and two strips of dried meat. Write the talisman in cinnabar, two inches wide, and place it on the mat.\n\nThe incantation states: On an auspicious day and hour, this humble servant [Name] bows twice and receives the Red Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and swallows it.\n\n**Method for the Talisman of the Yellow Emperor**\nOn *wu-ji* days, use white cogon grass as a mat, three feet long. Spread an eleven-foot length of yellow silk over the mat, with two cups of wine and two strips of dried meat. Use vermilion as the base and write the talisman in purple, three inches wide and seven inches long, then place it on the mat.\n\nThe incantation states: On an auspicious day and hour, this humble servant [Name] bows twice and receives the Yellow Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\nThe above talismans, though distinct, are not to be placed near one another—each is a separate talisman, and care must be taken in their use.\n\n**Method for the Talisman of the White Emperor**\nOn *geng-xin* days, use white cogon grass as a mat, three feet long. Spread an eleven-foot length of white silk over the mat, with [two cups of wine] and two strips of dried meat. Use green as the base and write the talisman in cinnabar, [two inches wide] and seven inches long, then place it on the mat.\n\nThe incantation states: On an auspicious day and hour, this humble servant [Name] bows twice and receives the White Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\n**Method for the Talisman of the Black Emperor**\nOn *ren-gui* days, use white cogon grass as a mat, three feet long. Spread an eleven-foot length of black silk over the mat, with two cups of wine and two strips of dried meat. Use black as the base and write the talisman in cinnabar, two inches wide and seven inches long, then place it on the mat.\n\nThe incantation states: On an auspicious day and hour...",
      "overlap_context": "ly August Lord of the Dao and receive the five divine talismans—then the five stones and five metals will transform at will, their essences competing to emerge.\n\n**Method for the Talisman of the Green Emperor**\nOn *jia-yi* days, use white cogon grass as a mat, three feet long. Spread a twelve-foot length of green silk over the mat, with two cups of wine and two strips of dried meat. Use the silk as a base, write the talisman in ink, two inches wide and seven inches long, and place it on the mat.",
      "start_char": 14169,
      "end_char": 14605,
      "start_sentence": 565,
      "end_sentence": 579,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.813803672790527,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "时，小兆臣玄再拜，受上皇道君黑帝神 符，因再拜，烧符服之。 右按前五帝神符，后四符每云玄者，仙翁受时称之讳也。 并书两通，烧服之，一通头上带之，弥为变化家用於欲丹时前十日作之。 夫大丹者，金火之精华，真人之所珍，是故服之者神仙变化，长生久视，役使百灵，上升太清者也。 俗人徒知其丹经之篇目，而不知合丹之忌讳。 虽得其方，而无成者，此也。 夫神丹欲合者，有五忌三讳，四败六畏也。 若犯之者，丹精飞散，灵华坠落，神光沉迎，霜姻损失，服之无益，不可不慎也。 所以真人请问其目。 玄师答日：五忌，一者合药及发火时，无犯五石死日也。 谓春壬辰，夏癸巳，秋丙戌，冬丁丑。 用之石精死，结合毒药，之无益也。 二者忌市具神药及论说丹事，无用五邪生日。 谓春壬寅，夏癸巳，秋壬申，冬癸亥。 以其日入山合神药，皆无所成，神尽不佑，鬼邪败人。 三者忌合神丹入名山，忌五岳伤绝日。 谓春庚寅，夏癸未，秋丙申，冬丁丑。 以其日入山合药，及采芝草，神灵录人魂魄，丹药损坏，疾病伤身。 四者忌合神丹炉釜及封泥神药，无用天开地破日。 春丙戌、丙辰，夏辛未、辛丑，秋壬辰、壬戌，冬癸未、癸丑。 以此合神丹炉宠釜，则丹室自开，石精散泄飞扬，丹华皆败。 五忌者，合丹男忌七月三日，及七月甲寅日。 女合丹忌正月七日，及正月庚申。 此四日是石精交战合鬼之日，以其日执事起火，则丹精不发，柙灵不感，邪鬼来入，皆为凶败。 此所谓五忌也。 三讳者，一讳合丹之时，泣泪悲伤也，二讳犯丹弒贼名字也，三讳凶衰淹秽死产乳也。 按犯此三讳，则石精哀结，五华不曜，其丹必毒，入口杀人。 凡八石至，己心忧戚泣泪，及临尸凶淹之人，皆不可厕预丹炉等事也。 又丹有弒贼恶鬼，谓所名不□子，字混泥洗，合丹始火之日，慎呼此名字也。 若犯之，则鬼兵来入，神炉破碎，精华散出。 四败，一者地无丹气，谓非神地。 二者见嫉拓之人，谓恶眼人见神药，则致鬼殃也。 三者侣非其友，四者五辛臭物，及烧鸡犬毛也。 按此四败者，八石之所大忌，不可犯之。 六畏者，一初封药之日，及始火之时，畏遇风雨雷霆。 二者合丹之日，畏闻唤魂魄声。 三畏四畏脱开。 五者合丹，畏闻悲哭声也。 六者畏见一切血腥、污秽之事也。 按此六畏者，皆神丹之所禁忌，有闻而犯之，则神精惊，扰灵气损也。 仙访曰：服第一之丹流珠九转，及丹华二丹功能者，以甲子日平旦，向日再拜，长跪服之，如黍粟。 即时神仙，上升九天。 服半黍粟，即为地仙，入火不烧，入水不湿，万恶不中，兵刃不伤，变化自在，出入无问，役使鬼神，寿同天地。 若欲去代，更服半黍粟，即时升天。 欲度俗人，服如小豆，即日升仙。 服半小豆，即为地仙。 及六畜令服，如大豆，即时升天。 故日乌得之为凤。 兽得之为麟，蛇得之为龙，鬼得之为神，女得之为玉女，男得之为仙也。 以蛇脂和为四丸，如弹丸许，埋所居宅处四角，即变为赤龙，举宅升天，去地七千尺，变为金玉，任情所适。 埋一丸如鸡子黄，随所远近方圆千里，下彻九泉，其中所有江河山林，皆悉升天矣。 取黄土坚实细理者一斤，细捣筛，沸汤煮之，三佛，以一铢投中，熟合和煎，令水尽，变成金。",
      "translated_text": "At this auspicious day and hour, the humble servant [Name] bows twice and receives the Black Emperor’s divine talisman from the Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\nThe preceding five divine talismans of the Emperors, and the subsequent four talismans where each mentions \"Xuan,\" refer to the taboo name used by the immortal elder when receiving them. Write two copies of each: burn and ingest one, and wear the other on the head. These are especially effective for alchemical transformations and should be prepared ten days prior to the desired time of elixir refinement.\n\nThe Great Elixir is the essence of metal and fire, treasured by perfected beings. Those who ingest it attain divine transformation, longevity, and eternal vision, command the hundred spirits, and ascend to the Great Clarity. Yet common folk merely know the titles of elixir scriptures but remain ignorant of the taboos in elixir refinement. Though they obtain the formula, they fail to succeed—this is the reason.\n\nFor those who wish to refine the divine elixir, there are five prohibitions, three taboos, four defeats, and six fears. If violated, the elixir’s essence scatters, its numinous radiance dissipates, its divine light sinks, and its frost-like brilliance is lost. Ingesting it brings no benefit—one cannot be too cautious.\n\nThus, the perfected one inquired about these details. The Dark Master replied:\n\n**The Five Prohibitions:**\n1. When compounding the medicine or kindling the fire, avoid the \"dead days\" of the Five Stones: *ren-chen* in spring, *gui-si* in summer, *bing-xu* in autumn, and *ding-chou* in winter. Using these days causes the stone essence to perish, forming toxic compounds—utterly useless.\n2. When purchasing ingredients or discussing elixir matters, avoid the \"inauspicious birth days\" of the Five Evils: *ren-yin* in spring, *gui-si* in summer, *ren-shen* in autumn, and *gui-hai* in winter. Entering mountains to refine the divine elixir on these days yields no success; spirits offer no protection, and demonic forces ruin the work.\n3. When refining the divine elixir in renowned mountains, avoid the \"injurious and severed days\" of the Five Peaks: *geng-yin* in spring, *gui-wei* in summer, *bing-shen* in autumn, and *ding-chou* in winter. Entering mountains to refine the elixir or gather magical herbs on these days results in spirits recording one’s soul, elixirs spoiling, and illness or bodily harm.\n4. When preparing the crucible, furnace, or sealing the elixir with clay, avoid the \"heaven-opening and earth-splitting days\": *bing-xu* and *bing-chen* in spring; *xin-wei* and *xin-chou* in summer; *ren-chen* and *ren-xu* in autumn; *gui-wei* and *gui-chou* in winter. Refining the elixir on these days causes the chamber to open spontaneously, stone essence to scatter and dissipate, and the elixir’s radiance to fail.\n5. For men refining the elixir, avoid the third day of the seventh month and *jia-yin* in the seventh month. For women refining the elixir, avoid the seventh day of the first month and *geng-shen* in the first month. These four days are when stone essences battle and ghosts assemble. Kindling the fire on these days prevents the elixir’s essence from manifesting, numinous forces from responding, and malevolent spirits from intruding—all leading to calamitous failure.\n\n**The Three Taboos:**\n1. Weeping or grieving while refining the elixir.\n2. Uttering the names of elixir-destroying demons.\n3. Encountering inauspicious defilements such as death, childbirth, or impurity.\nViolating these taboos causes the stone essence to mourn and congeal, the fivefold radiance to dim, and the elixir to become poisonous—ingesting it kills. All who are sorrowful, weeping, or near corpses and defilements must not approach the elixir furnace or related tasks. Additionally, the elixir has slaying demons and malevolent ghosts—one named *Bu-zi* (character unclear), styled *Hunni Xi*. On the day of kindling the fire, avoid speaking these names. If violated, ghostly soldiers intrude, the divine furnace shatters, and the essence scatters.\n\n**The Four Defeats:**\n1. The land lacks elixir *qi*—meaning it is not a numinous site.\n2. Envious or resentful people—meaning those with evil eyes who see the divine medicine bring demonic misfortune.\n3. Unsuitable companions.\n4. The five pungent foods, foul substances, and burning chicken or dog hair.\nThese four defeats are the greatest prohibitions for the Eight Stones—none may be violated.\n\n**The Six Fears:**\n1. On the day of sealing the medicine or kindling the fire, fear encountering wind, rain, or thunder.\n2. While refining the elixir, fear hearing calls for souls.\n3. *(Omitted in text.)*\n4. *(Omitted in text.)*\n5. Fear hearing sounds of lamentation.\n6. Fear encountering blood, filth, or defilement.\nThese six fears are all forbidden for the divine elixir. Hearing or violating them startles the divine essence, disturbs the numinous *qi*, and causes harm.\n\nThe Immortal Inquiry states: To ingest the first elixir, the Flowing Pearl of Nine Cycles, or the Elixir Radiance—on a *jia-zi* day at dawn, face the sun, bow twice, kneel, and ingest a grain the size of millet. Immediately, one becomes an immortal and ascends to the Nine Heavens. Ingesting half a millet grain makes one an earthbound immortal, unburned by fire, undrowned by water, untouched by myriad evils, unharmed by blades, freely transforming, moving without hindrance, commanding ghosts and spirits, and living as long as heaven and earth. To depart this world, ingest another half-grain of millet to ascend to heaven. To deliver a mortal, ingest a grain the size of a small bean to ascend as an immortal that very day. Ingesting half a small bean makes one an earthbound immortal. For beasts, ingesting a grain the size of a large bean causes immediate ascent to heaven. Thus, birds become phoenixes, beasts become unicorns, snakes become dragons, ghosts become spirits, women become jade maidens, and men become immortals.\n\nMix snake fat into four pills, each the size of a crossbow pellet, and bury them at the four corners of one’s dwelling. The house transforms into a red dragon, lifting the entire residence seven thousand feet into the air, turning it to gold and jade, and traveling wherever desired. Burying one pill the size of a chicken’s yolk—whether near or far, within a thousand *li*—penetrates nine springs below, causing all rivers, mountains, and forests within to ascend to heaven.\n\nTake one *jin* of fine, firm yellow earth with tight grain, grind it finely, sift it, and boil it in bubbling water three times. Add one *zhu* of the substance, cook thoroughly, and stir until the water evaporates—it transforms into gold.",
      "overlap_context": "e Heavenly August Lord of the Dao. Again bowing twice, he burns the talisman and ingests it.\n\n**Method for the Talisman of the Black Emperor**\nOn *ren-gui* days, use white cogon grass as a mat, three feet long. Spread an eleven-foot length of black silk over the mat, with two cups of wine and two strips of dried meat. Use black as the base and write the talisman in cinnabar, two inches wide and seven inches long, then place it on the mat.\n\nThe incantation states: On an auspicious day and hour...",
      "start_char": 14605,
      "end_char": 15857,
      "start_sentence": 580,
      "end_sentence": 632,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.45938563346863,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "仙翁曰：诸丹成而服者，乃多格人以三品，言上中下。 上士七日登真，下士服之，七十日得仙。 愚人服之，一年乃仙。 若还至诚，便敢顿服刀圭者，皆暂死半日许，乃生，如眠觉状。 此乃睑之至矣，必须依方，以半黍要为度。 伏闻学道不成，所由有八。 一者偶知一事，便言已足，劬劳鼎火，皓首无成。 二者虽遇奇方，谓非实法，求之不已，遂至盖棺。 三者真伪不分，无师取诀，意无一定，消弃光阴。 四者恃所聪明，忽略知法，自言已得，不尽师心。 五者真方秘诀，非易见逢，谓在名山，历险损命。 六者家无修石，饥寒切逼，得如不得，知如不知。 七者性不精专，复无蓄积，明师已次，疑而不行。 八者所遇之师，师素狭劣，惜其浅短，不尽教之。 告云道不在多，矫生宝秘，谓以为实，遂至守株也。 仙翁曰：合丹当求道养真，勿贪俗利荣华，造黄白，至灵祇不佑，鬼忽志，以致不祥，夭横伤年。 深宜慎之，不得妄传非人。 非同志者，不得轻泄之，的有殃谴。 仙经曰：有仙籍者，谋之者死，犯之者灭门，憎之者亡。 上洞心丹经诀卷下竟",
      "translated_text": "The Immortal Elder said: When various elixirs are completed and consumed, they are often classified by men into three grades—upper, middle, and lower. The superior adept ascends to transcendence in seven days; the lesser adept, after seventy days, attains immortality. The foolish man, consuming it, becomes immortal only after a year. Should one dare to ingest a full *daogui* measure with utmost sincerity, they will briefly die for half a day before reviving, as if awakening from sleep. This is the utmost limit of elixir refinement; one must adhere to the formula, using half a millet grain as the measure.\n\nI have heard that failure in Daoist cultivation arises from eight causes:\nFirst, one may know a single thing and claim it sufficient, toiling over the crucible and flame yet achieving nothing by white-haired old age.\nSecond, though encountering a wondrous formula, one doubts its authenticity, seeking endlessly until death seals the coffin.\nThird, unable to distinguish truth from falsehood and lacking a master’s guidance, the mind remains unsettled, squandering time in vain.\nFourth, relying on one’s own cleverness, one neglects the teachings, boasting of attainment while failing to exhaust the master’s wisdom.\nFifth, true formulas and secret instructions are not easily found; believing them hidden in perilous mountains, one risks life in pursuit.\nSixth, lacking the means to cultivate, pressed by hunger and cold, one gains as if not gaining, knows as if not knowing.\nSeventh, lacking single-minded devotion and no reserves of resources, when a true master appears, one hesitates and does not act.\nEighth, the master one encounters is base and inferior, hoarding shallow knowledge, unwilling to teach fully. Claiming \"the Dao is not in abundance,\" they falsely treasure secrecy, leading disciples to cling to worthless methods like the man waiting by the stump.\n\nThe Immortal Elder said: In compounding elixirs, one should seek the Dao and nurture the true, not covet worldly profit or glory. Those who craft *huangbai* (transmutative gold) will find no favor with the numinous spirits; ghosts will disturb their resolve, bringing misfortune, premature death, and untimely harm. Exercise utmost caution and do not recklessly transmit to the unworthy. Those not of like mind must not be lightly entrusted with these secrets, lest calamity and divine retribution follow.\n\nThe Immortal Scriptures say: Those recorded in the registers of immortality—those who scheme against them die, those who violate them suffer annihilation of their lineage, and those who hate them perish.\n\nHere ends the *Lower Scroll of the Heart-Refining Elixir Canon’s Secret Instructions*.",
      "overlap_context": "he air, turning it to gold and jade, and traveling wherever desired. Burying one pill the size of a chicken’s yolk—whether near or far, within a thousand *li*—penetrates nine springs below, causing all rivers, mountains, and forests within to ascend to heaven.\n\nTake one *jin* of fine, firm yellow earth with tight grain, grind it finely, sift it, and boil it in bubbling water three times. Add one *zhu* of the substance, cook thoroughly, and stir until the water evaporates—it transforms into gold.",
      "start_char": 15858,
      "end_char": 16288,
      "start_sentence": 633,
      "end_sentence": 652,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.842697143554688,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\上洞心丹经诀.txt",
        "category": "众术类"
      }
    }
  ]
}