{
  "source_id": "上阳子金丹大要仙派",
  "source_file": "chunked_daozang\\上阳子金丹大要仙派.json",
  "total_chunks": 6,
  "total_original_chars": 3046,
  "total_translated_chars": 19654,
  "total_translation_time": 112.93669533729553,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要仙派.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Lineage of Supreme Yang’s Essential Teachings on the Golden Elixir**\n\n**Scripture Title:** *The Lineage of Supreme Yang’s Essential Teachings on the Golden Elixir*\n**Author:** Chen Zhixu of the Yuan Dynasty\nOriginally an appendix to *The Essential Teachings on the Golden Elixir*, later compiled as a separate fascicle.\n**Source Text:** *Daoist Canon of the Orthodox Unity Edition*, *Tai Xuan* Section.\n\n---\n\n### **The Lineage of Supreme Yang’s Essential Teachings on the Golden Elixir**\n\n#### **The Immortal Lineage**\n**Primordial Laozi of the Supreme Ultimate and Precelestial Realm**\nAt the inception of the Mysterious-Ultimate Heavenly Thearch, the Supreme Ultimate first gave birth to Three: the Mysterious, the Primordial, and the Originator.\nThe Originator *qi* transformed and generated the Primordial Laozi.\nSince then, the Primordial Laozi has ceaselessly descended and regenerated through the Mysterious *qi*.\n\n**The Ten Thousand Dharmas Heavenly Master**\n**Ancient Great Master**\n**Yu Hua Zi**\n**Da Cheng Zi**\n**Guang Cheng Zi**\n**Sui Ying Zi**\n**Chi Jing Zi**\n**Lu Tu Zi**\n**Wu Cheng Zi**\n**Yin Shou Zi**\n**Zhen Xing Zi**\n**Xi Ze Zi**\n**Ancient Yi Master**\n**Jian Keng**\n**Shang Rong**\n\nThough the Primordial Laozi had, age after age, transformed and delivered beings, no trace of his earthly birth had yet manifested. Thus, in the reign of King Yang Jia of the Shang, the eighteenth sovereign, he lodged in the womb of the Mysterious Wondrous Jade Maiden for eighty-one years before being born as [King] Wu Ding.\nIn the *gengchen* year, on the fifteenth day of the second month, at the hour of *mao*, he descended into the world, taking the surname Li.\n\n**Later Sage, Primordial Mysterious and Supreme Laozi**\n**Eastern Florescence, Purple Palace, Assistant Primordial, Establisher of the Ultimate, Great Emperor**\n\n**Perfected Sovereign Zhongli Quan, Opener of Enlightenment and Transmitter of the Dao**\n**Perfected Sovereign Lü Yan, Pure Yang’s Admonishing Transformation and Trusted Protector**\n**Perfected Sovereign Liu Cao, Expander of the Dao and Pure Protector of the Sea Toad**\n**Perfected Sovereign Wang Zhe, Perfect Yang’s Completer of Authenticity and Opener of Transformation**\n**True Lord Ma Yu of Dan Yang, Embracer of Unity and Non-Action**\n**True Lord Tan Chuduan of Chang Zhen, Cloud-Wanderer and Accumulator of Virtue**\n**True Lord Liu Chuxuan of Chang Sheng, Assistant of Transformation and Illuminator of Virtue**\n**True Lord Qiu Chuji of Chang Chun, Expounder of the Dao and Master of Teachings**\n**True Lord Hao Datong of Guang Ning, Penetrator of the Mysteries and Primordial Ancient**\n**True Lord Wang Chuyi of Yu Yang, Embodying Mystery and Broad Deliverer**\n**True Lordess Sun Bu’er of Qing Jing, Profound and Chaste, Follower of Virtue**\n**Perfected Person Song Youdao of Huang Fang, Cloud-Parting and Virtue-Radiating**\n**Perfected Person Li Jue of Tai Xu, Dweller in Emptiness and Twin Jade**\n**Ancestral Master Zhang Mo, Purple Jade Master, styled Junfan**\n**Master Zhao Youqin of Yuan Du**\n**Master Chen Zhixu of Shang Yang**\n\n**Celebration Rite for the Birthdays of the Two Immortals, Zhong and Lü**\n**Order of Service** | **Ritual** | **Purification** | **Incense Procession**\n\nWe reverently observe: the season now being the fourth month, it befits the clear harmony of early summer; the hexagram full with six yang lines delights in the perfect correctness of pure Qian. On this day of the sagely masters’ birth, we express the sincerity of later disciples in their homage. With pure assembly and one voice, we offer incense and flowers in invitation.\n\n**Three Invocations with Incense and Flowers**\n\nWe humbly invite:\n**Primordial Dao Ancestor, Most High Lord Lao, First Perfected Sage of the Three Teachings**\n**Celestial Worthy Wen Shi, Master Yin**\n**Perfected Person Yin of Tai He**\n**Perfected Person Du of Tai Ji**\n**Perfected Person Peng of Tai Qing**\n**Perfected Person Song of Tai Qing**\n**Perfected Person Feng of the Western Peak**\n**Perfected Person Yao of the Dark Continent**\n**Perfected Person Zhou of the Eight Simplicities**\n**Perfected Person Yin of Tai Wei**\n**Perfected Person Wang of the Yellow Court**\n**Immortal Li Xianqing of the Western Peak**\n**Venerable Elder of the River’s Edge**\n**Perfected Person An Qisheng**\n**Perfected Person Ma Mingsheng**\n**Perfected Person Yin Changsheng**\n**Perfected Person Xu Congshi**\n**Perfected Person Wei Boyang**\n**Perfected Person Liu Jinbi**\n**Great Dharma Master of the Three Heavens**\n**Great Dharma Master of the Mysterious Center**\n\n**Perfected Person Wang of Left Mystery**\n**Perfected Person Zhao of Right Mystery**\n**Forebear Ge the Immortal of Supreme Polarity**\n**Grand Scribe of the Nine Provinces, Supreme Immortal**\n**Eleven Perfected Lords of Wu and Huang**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWith solemn reverence we invoke:\n**Ancestral Master, August Emperor of Eastern Florescence, Purple Palace, Auxiliary Primordial, Establisher of the Pole**\n**August Lord Zhongli of Correct Yang, Awakener, Transmitter of the Dao, Bestower of Teachings**\n**August Lord of Pure Yang, Expounder of the Correct, Admonisher, Transformative Protector**\n**August Lord Hai Chan, Enlightened, Vast Dao, Pure Protector**\n**August Lord Chong Yang, Perfect Realization, Opener of Transformation, Auxiliary to the Pole**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWith solemn reverence we invoke:\n**Ancestral Master, Perfected Lord Dan Yang, Embracer of the One, Non-Action, Universal Transformation**\n**Perfected Lord Chang Zhen, Cloud and Water, Congealer of Spirit, Mysterious Quiescence, Reposer of Virtue**\n**Perfected Lord Chang Sheng, Auxiliary to Transformation, Founder of the Mysterious, Illuminator of Virtue**\n**Perfected Lord Chang Chun, Expounder of the Dao, Perfect in Virtue, Divine Transformation, Manifest Responder**\n**Perfected Lord Guang Ning, Penetrator of the Mysterious, Wondrous to the Utmost, Primeval of Antiquity**\n**Perfected Lord Yu Yang, Embodier of the Mysterious, Vast Compassion, Universal Salvation**\n**Perfected Consort Qing Jing, Profound and Steadfast, Mysterious Emptiness, Accordant Transformation, Primordial Sovereign**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWith solemn reverence we invoke:\n**Perfected Person Zi Yang of Tian Tai, Awakened to Reality**\n**Perfected Person Cui Xuan of the Fathomless Forest**\n**Perfected Person Dao Guang of Purple Worthiness**\n**Perfected Person Ni Wan of Emerald Emptiness**\n**Perfected Person Zi Qing of the Southern Sea**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWith solemn reverence we invoke:\n**Ancestral Master, Perfected Person Song of Yellow Chamber, Cloud-Clad**\n**Perfected Person Li of Supreme Emptiness**\n**Perfected Person Zhang of Purple Jade**\n**Initiation Master, Perfected Person Zhao of the Spinal Meridian**\n**Initiation Master, Perfected Person Liu of Valley Clouds**\n**All the Sages and Worthies of Past and Present, Cultivators of Reality, Learners of Immortality, Attainers of the Dao**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWe now extend our entreaty, trusting in your gracious presence, humbly hoping for your lingering stay, that we may offer this devotion in reverence.\n\nOn this auspicious dawn of Pure Yang, we present our foolish sincerity in homage.\n\nThe candle—this single point of numinous radiance—has been abundant through all ages, pervading the ten directions, uniting the hidden and the manifest.\nThe unknowing regard it as mere fire passed on; the knowing declare it the nature of wisdom.\nIt kindles the heart in dark chambers, inspiring awe and turning the light inward;\nIt affirms the path to Heaven’s halls, enabling transcendence from the mundane to the sacred.\n\nWe bow twice and present the longevity candles for the ritual.\n\nThe incense—since the dawn of primordial antiquity, a single branch has emerged; what need awaits the Three Sovereigns or the passage of kalpas to diffuse its fragrance? The ignorant possess noses yet cannot discern; the noble discern fragrance and distinguish scent. Like the sacred master’s pinch of earth, everywhere it is fragrant; by virtue and power it is named, and all receive its benefit.\n\nWe bow twice and present the longevity incense.\n\nThe tea—first plucked as the sparrow’s tongue of early spring, the spear and banner of Grain Rain. Pouring the crab-eye bubbles, white blossoms float upon the bowl’s surface; ladling the Dragon Spring’s water, a transcendent breeze wafts from Penglai. Lu Tong with six bowls communed with immortals; Zhaozhou with one cup fathomed Buddha-nature. It rouses the drowsy, awakens the dull-witted immortal.\n\nWe bow twice and offer the tea.\n\nThe wine—heaven bestows sweet dew, earth wells forth sweet springs. The supreme flavor is *tīgho*, those who drink remain ever sober; the sage’s lees, attained through being yet returning to non-being. One sip drains the Western River, the countenance never ages; three cups penetrate the Great Dao, the dharma-body endures forever.\n\nWe bow twice and present the longevity wine.\n\nThe ritual proceeds.\nRecitation of the *Heart-Imprint Sutra* and the *Thirty Chapters of Merit Sutra*.\nA congratulatory memorial is prepared, to be respectfully presented on bended knee.\n\n**Memorial in Celebration of Ancestral Master Zhongli**\n\nA disciple of the Great Dao, [Name], on the fifteenth day of this month, reverently observes the propitious birth of Ancestral Master Zhongli, the Perfected Yang Emperor. In advance of this day, the fourteenth, I humbly present this memorial in celebration.\n\nTo the right, I prostrate in awe: the Dao is exalted, virtue is noble, gazing up to the teacher of ten thousand generations, whose yin is exhausted and yang is pure. At the auspicious dawn of the transcendent’s longevity, the moon is full in the heavens, auspicious vapors suffuse the mortal realm.\n\nI kowtow twice, reverently reflecting upon Ancestral Master Zhongli, the Perfected Yang Emperor who awakened, transmitted the Dao, and bequeathed teachings—self-originating, prior to heaven and earth. Grasping heaven and earth as the crucible, refining *kan* to return to *li*; seizing the sun and moon as medicinal ingredients, taming dragons and subduing tigers. The Dao transcends the Supreme Ultimate, grace extends to all beings, enduring through kalpas, each person receiving deliverance. Following the transmissions of Pure Yang, Hai Chan, and Chongyang, the successive sages share one heart; since the aid of Dan Yang, Changchun, and Zi Yang, they have been fathers to the multitude. Merits defy praise in words, benevolence rivals the workings of creation.\n\nI, of unrefined bone and unenlightened heart, yet hold true devotion to the Dao. By fortune, I have received the master’s decree: the Mysterious Female is the root of heaven and earth; detailed in the alchemical texts, essence and *qi* are the foundation of yin and yang. The numinous water of the Flowery Pond is called *qian*-metal; the flowing pearls of the earthen crucible are named *mu*-mercury. The two bowstrings unite as one body, gestating for ten months. What is most urgent is the instantaneous application of the wondrous; what is most difficult is maintaining true stillness in response to phenomena. Moreover, the foremost scripture is the supreme treasure, its discourse fraught with peril; the male tiger is merciless, instilling profound fear.\n\nOn this occasion of celebration, I recount these perils and hardships, humbly beseeching compassion and condescension to this lowly one. Grant me refuge in expedient means, that I may enter the chamber free of demons. The immortals’ days and months are long—what need for the felicitations of the mortal realm? When merit and conduct are complete in future years, I shall rely wholly on the master’s refinement.\n\nMay superior and worthy ones all comprehend the supreme Dao; may the deluded and deceived awaken to sincere faith. May rivers of ghee flow, *tīgho* anoint the crown; may earth become jasper, the land be gilded with gold.\n\nI have presumptuously addressed the Perfected Master, trembling in awe.\n\nWith reverence and trepidation, I kowtow and bow twice, humbly submitting this memorial.\n\nYear   Month   Day\nDisciple of the Great Dao, [Name], Memorial in Celebration\n\n**Memorial in Celebration of the Birthday of Ancestral Master Pure Yang**\n\nA disciple of the Great Dao, [Name], on the fourteenth day of this month, reverently observes the auspicious birth of Ancestral Master Pure Yang, the Emperor of Manifest Transformation. I humbly present this memorial in celebration.\n\nTo the right, I prostrate in awe: the season arrives at Pure Yang, the moon first rounds on this night; heaven concentrates primordial *qi*, its course already fulfilled over many years. The cosmos rejoices, immortals and mortals offer felicitations.\n\nI kowtow twice, reverently reflecting upon Ancestral Master Pure Yang, the Emperor who propagated the true and admonished transformation—his Dao towers through the ages, his auspiciousness purifies all spirits. Inwardly observing the heart, outwardly observing the form, he thus attained the mysteries of preserving the body; observing the apertures through being, observing the wondrous through non-being, all converge at the gate of manifold wonders. Drawing from the utmost clarity of the water’s source, he refined the golden elixir to early completion. The green serpent coiled in his sleeve, he crossed Dongting reciting verses; before the Yellow Crane Tower, he concealed himself among city cliffs, playing the flute. In jest, he transformed a maid into an immortal; aspiring to soar southward, he nearly reached Mount Hua. Riding a green ox, he entered grotto-heavens; astride a white deer, he traversed the vast seas. He attained the rank of Perfected Emperor, his merit spanning past and present; he widely transmitted the truth of the Dao and virtue, his lineage spreading south and north.\n\nThough he desired to save the world, people did not recognize him; though I sought him, the karmic conditions were not yet ripe.\n\nI humbly reflect: I was ignorant of the Mysterious Female’s decree, yet by fortune encountered the true master’s initiation. Only then did I realize the Dao is not revealed through words, and only then did I know the matter belongs to mind-to-mind transmission. One must seek the eight taels of *qian*-metal, first clarifying host and guest; then circulate the half-catty of *mu*-mercury, harmonizing yin and yang. Refine them into one mass, maintain it for ten months, silently listening for the dragon’s roar and tiger’s howl, ensuring the water does not dry nor the fire grow cold. To attain cessation here is fraught with fear; in haste and confusion, I forget even to eat.\n\nIf I might receive compassion and obtain a draught of the medicinal spoon, reviving this feeble remnant, I would intimately know the fire’s timing. Though I have nothing to repay, I rely on the love of life.\n\nFortunately, I encounter this flourishing era and rejoice in this auspicious dawn. I dare present my humble sincerity, bowing from afar to the immortal’s majesty. Though I presume the exalted one resides in the celestial bureau of retribution, I imagine he bestows mercy upon this novice. Though I do not presume upon mortal felicitations, I thus pour forth my heartfelt plea. May he secretly assist this mortal frame, that I may early gather the medicinal ingredients. Gathering the supreme treasure of the foremost scripture, may inner and outer be without fault; refining the primordial *qi* of the One Breath, may beginning and end be perfectly good.\n\nWith no demonic obstructions, the mind’s numinosity is revealed.\nThen swiftly commence cultivation—who would not wish this?\nAnd with the body settled in expedient means, tasks are easily accomplished.\n\nNext, may the superior and worthy, all enlightened to the supreme Dao,\ntogether with the previous assembly, present their covenanted petitions and memorials,\nreverently proclaiming before the assembly:\n\nThe Dao disciple [Name], on this fourteenth day of the present month,\nreverently encounters the auspicious birth anniversary of Patriarch Pure Yang Emperor Lord,\nand on the fifteenth day reverently encounters the auspicious birth anniversary of Patriarch Orthodox Yang Emperor Lord.\nRespectfully preparing incense and candles, on this fourteenth day,\na memorial is jointly submitted in celebration—now duly completed.\n\nWe humbly receive the joint covenant-seal of the exalted immortals and host of sages,\ndevoutly offering paper wealth, and earnestly prostrating in gratitude.\nWe pray for protection in Dao-learning, free from demonic interference,\nand for a share in immortal cultivation, beseeching compassionate mercy\nto secretly assist in peril and hardship.\nMay we enter the chamber and perfect our work, the fire’s timing unerring;\nearly shed the mortal coil and transform through spirit, ascending to join the immortal ranks.\n\nNext, may the superior and worthy, all enlightened to the supreme Dao,\nawaken the deluded and deceived, that they may repent and arouse the mind of faith.\n\nAmid rivers of clarified butter and streams of ghee poured upon the crown,\njade-green earth and golden lands spread boundless.\nDaring to offend the master’s solemn dignity, we yet presume to proclaim without end.\n\nTo the right, this memorial is respectfully submitted with bowed head:\nThe Primordial Dao-Ancestor, Most High Lord Lao;\nThe Three Teachings’ Enlightened Perfected Sages and Immortal Masters;\nThe Celestial Worthy of Literary Beginnings, Master Yin—\nas previously invoked, their divine ranks are inscribed without addition or omission.\n\n**Prayer for Sending Forth the Divine**\nThe sentiments just expressed have dared to strain your enlightened hearing;\nwe humbly implore your compassion and broad grace in reception and guidance.\nThough you condescend to descend from the celestial realms to this dusty world,\nyour awe and reverence leave us overwhelmed;\nas you return to wander the Isles of Peng, your lingering affection remains deep.\nNow, at this hour of reverent farewell, we bear the shame of this empty abode.\n\nWe have heard:\nWalking alone, sitting alone, one’s name yet stirs the hearts of emperors;\nunseen, unknown, one’s verses still resound in the ears of ministers.\nHow much can mortal eyes perceive?\nA single grain of golden elixir secures eternal life.\nThis meeting was not without cause—our heart’s plea longs to be voiced;\nthough all the world seeks this Dao, its truth remains elusive.\nTo begin practice swiftly is already too late—who in this world can truly walk this path?\nThis body has already transcended the Three Thousand Realms,\nas of old you bestowed upon Zhang the Painter;\nnow you promise me a journey to the Five Emperors’ realm—\nwe pray you take pity on these mortal bones.\nDo not say the common folk are doomed to thin fate;\ngrant this poor scholar the elixir to transform his frame.\n\nThe Perfected One now roams the Jade Clarity,\nsword resting by the twin rivers’ shore;\nsince the Master’s departure, he should not age—\nhis body dwells in the Great Mystery Heaven.\nComing without shadow, going without trace,\nhe rectifies the celestial registers of immortals;\nhearing not, seeing not,\nhe serves the Jade Emperor and returns to Grand Purity.\n\nOur presumption runs deep—with wholehearted devotion, we bow in farewell.\n\nHere ends the *Golden Elixir Essentials of the Immortal Lineage of Shangyangzi*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上阳子金丹大要仙派 经名：上阳子金丹大要仙派。 元陈致虚撰。 原系《金丹大要》之附录，后分别为一卷。 底本出处：《正统道藏》太玄部。 上阳子金丹大要仙派 仙派 太极先天老子 妙无天帝太极之初出生三，为玄、元、始。 始炁化生先天老子。 自尔以来，先天老子乃以玄炁时时而下生。 万法天师 有古大先生 郁华子 大成子 广成子 随应子 赤精子 录图子 务成子 尹寿子 真行子 锡则子 古邑先生 籛铿 商容 先天老子虽世世化度，而未显诞生之迹。 乃於商十八王阳甲时，寄胎于玄妙玉女身中八十一年，方生武丁。 庚辰岁二月十五卯时降诞，指李为姓也。 后圣玄元太上老子 东华紫府辅元立极大帝",
      "translated_text": "**The Lineage of Supreme Yang’s Essential Teachings on the Golden Elixir**\n\n**Scripture Title:** *The Lineage of Supreme Yang’s Essential Teachings on the Golden Elixir*\n**Author:** Chen Zhixu of the Yuan Dynasty\nOriginally an appendix to *The Essential Teachings on the Golden Elixir*, later compiled as a separate fascicle.\n**Source Text:** *Daoist Canon of the Orthodox Unity Edition*, *Tai Xuan* Section.\n\n---\n\n### **The Lineage of Supreme Yang’s Essential Teachings on the Golden Elixir**\n\n#### **The Immortal Lineage**\n**Primordial Laozi of the Supreme Ultimate and Precelestial Realm**\nAt the inception of the Mysterious-Ultimate Heavenly Thearch, the Supreme Ultimate first gave birth to Three: the Mysterious, the Primordial, and the Originator.\nThe Originator *qi* transformed and generated the Primordial Laozi.\nSince then, the Primordial Laozi has ceaselessly descended and regenerated through the Mysterious *qi*.\n\n**The Ten Thousand Dharmas Heavenly Master**\n**Ancient Great Master**\n**Yu Hua Zi**\n**Da Cheng Zi**\n**Guang Cheng Zi**\n**Sui Ying Zi**\n**Chi Jing Zi**\n**Lu Tu Zi**\n**Wu Cheng Zi**\n**Yin Shou Zi**\n**Zhen Xing Zi**\n**Xi Ze Zi**\n**Ancient Yi Master**\n**Jian Keng**\n**Shang Rong**\n\nThough the Primordial Laozi had, age after age, transformed and delivered beings, no trace of his earthly birth had yet manifested. Thus, in the reign of King Yang Jia of the Shang, the eighteenth sovereign, he lodged in the womb of the Mysterious Wondrous Jade Maiden for eighty-one years before being born as [King] Wu Ding.\nIn the *gengchen* year, on the fifteenth day of the second month, at the hour of *mao*, he descended into the world, taking the surname Li.\n\n**Later Sage, Primordial Mysterious and Supreme Laozi**\n**Eastern Florescence, Purple Palace, Assistant Primordial, Establisher of the Ultimate, Great Emperor**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 326,
      "start_sentence": 0,
      "end_sentence": 30,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.574408054351807,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要仙派.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "正阳开悟传道帝君锺离权 纯阳警化孚佑帝君吕岩 海蟾弘道纯佑帝君刘操 重阳全真开化帝君王哲 丹阳抱一无为真君马钰 长真云水蕴德真君谭处端 长生辅化明德真君刘处玄 长春演道主教真君丘处机 广宁通玄太古真君郝大通 玉阳体玄广度真君王处一 清净渊贞顺德真君孙不二 黄房公披云德光真人宋有道 太虚栖真双玉真人李珏 祖师紫琼子张模字君范 缘督子赵友钦 上阳子陈致虚 锺吕二仙庆诞仪 序班　法事　洒净　行香 恭闻：时维四月，宜首夏之清和； 卦满六阳，喜纯乾之中正。 际圣师诞生之旦，申后人朝贺之诚。 清众同声，香花奉请。 举香花请三声 谨拜请： 先天道祖太上老君三教得道先圣仙师 文始天尊尹先生 太和尹真人 太极杜真人 泰清彭真人 太清宋真人 西岳冯真人 玄洲姚真人 八素周真人 太微尹真人 黄庭王真人 西岳李仙卿 河上公丈人 安期生真人 马明生真人 阴长生真人 徐从事真人 魏伯阳真人 刘金碧真人 三天大法师 玄中大法师",
      "translated_text": "**Perfected Sovereign Zhongli Quan, Opener of Enlightenment and Transmitter of the Dao**\n**Perfected Sovereign Lü Yan, Pure Yang’s Admonishing Transformation and Trusted Protector**\n**Perfected Sovereign Liu Cao, Expander of the Dao and Pure Protector of the Sea Toad**\n**Perfected Sovereign Wang Zhe, Perfect Yang’s Completer of Authenticity and Opener of Transformation**\n**True Lord Ma Yu of Dan Yang, Embracer of Unity and Non-Action**\n**True Lord Tan Chuduan of Chang Zhen, Cloud-Wanderer and Accumulator of Virtue**\n**True Lord Liu Chuxuan of Chang Sheng, Assistant of Transformation and Illuminator of Virtue**\n**True Lord Qiu Chuji of Chang Chun, Expounder of the Dao and Master of Teachings**\n**True Lord Hao Datong of Guang Ning, Penetrator of the Mysteries and Primordial Ancient**\n**True Lord Wang Chuyi of Yu Yang, Embodying Mystery and Broad Deliverer**\n**True Lordess Sun Bu’er of Qing Jing, Profound and Chaste, Follower of Virtue**\n**Perfected Person Song Youdao of Huang Fang, Cloud-Parting and Virtue-Radiating**\n**Perfected Person Li Jue of Tai Xu, Dweller in Emptiness and Twin Jade**\n**Ancestral Master Zhang Mo, Purple Jade Master, styled Junfan**\n**Master Zhao Youqin of Yuan Du**\n**Master Chen Zhixu of Shang Yang**\n\n**Celebration Rite for the Birthdays of the Two Immortals, Zhong and Lü**\n**Order of Service** | **Ritual** | **Purification** | **Incense Procession**\n\nWe reverently observe: the season now being the fourth month, it befits the clear harmony of early summer; the hexagram full with six yang lines delights in the perfect correctness of pure Qian. On this day of the sagely masters’ birth, we express the sincerity of later disciples in their homage. With pure assembly and one voice, we offer incense and flowers in invitation.\n\n**Three Invocations with Incense and Flowers**\n\nWe humbly invite:\n**Primordial Dao Ancestor, Most High Lord Lao, First Perfected Sage of the Three Teachings**\n**Celestial Worthy Wen Shi, Master Yin**\n**Perfected Person Yin of Tai He**\n**Perfected Person Du of Tai Ji**\n**Perfected Person Peng of Tai Qing**\n**Perfected Person Song of Tai Qing**\n**Perfected Person Feng of the Western Peak**\n**Perfected Person Yao of the Dark Continent**\n**Perfected Person Zhou of the Eight Simplicities**\n**Perfected Person Yin of Tai Wei**\n**Perfected Person Wang of the Yellow Court**\n**Immortal Li Xianqing of the Western Peak**\n**Venerable Elder of the River’s Edge**\n**Perfected Person An Qisheng**\n**Perfected Person Ma Mingsheng**\n**Perfected Person Yin Changsheng**\n**Perfected Person Xu Congshi**\n**Perfected Person Wei Boyang**\n**Perfected Person Liu Jinbi**\n**Great Dharma Master of the Three Heavens**\n**Great Dharma Master of the Mysterious Center**",
      "overlap_context": "ed. Thus, in the reign of King Yang Jia of the Shang, the eighteenth sovereign, he lodged in the womb of the Mysterious Wondrous Jade Maiden for eighty-one years before being born as [King] Wu Ding.\nIn the *gengchen* year, on the fifteenth day of the second month, at the hour of *mao*, he descended into the world, taking the surname Li.\n\n**Later Sage, Primordial Mysterious and Supreme Laozi**\n**Eastern Florescence, Purple Palace, Assistant Primordial, Establisher of the Ultimate, Great Emperor**",
      "start_char": 326,
      "end_char": 812,
      "start_sentence": 31,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.365662813186646,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要仙派.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "左玄王真人 右玄赵真人 太极葛仙前 九州都仙太史 吴黄十一位真君 恭望仙慈降临醮座。 谨拜请： 祖师东华紫府辅元立极大帝 锺离正阳开悟传道垂教帝君 纯阳演正警化孚佑帝君 海蟾明悟弘道纯佑帝君 重阳全真开化辅极帝君 恭望仙慈降临醮座。 谨拜请： 祖师丹阳抱一无为普化真君 长真云水凝神玄静蕴德真君 长生辅化宗玄明德真君 长春演道全德神化明应真君 广宁通玄妙极太古真君 玉阳体玄广慈普度真君 清净渊贞玄虚顺化元君 恭望仙慈降临醮座。 谨拜请： 天台悟真紫阳真人 翠玄杳林真人 道光紫贤真人 泥丸翠虚真人 海南紫清真人 恭望仙慈降临醮座。 谨拜请： 祖师黄房公披云宋真人 太虚李真人 紫琼张真人 度师缘督赵真人 度师谷云刘真人 古往今来修真学仙得道一切圣贤 恭望仙慈降临醮座。 向伸启请，谅辱光临，仰冀迂留，纳兹皈敬。 今遇纯阳之瑞旦，庸申朝贺之愚忱。 夫烛者，一点灵光，古今不少，十方世界，幽显皆通。 不知者以为火传，其知者是云性慧。 使暗室萌心而知惧，返照回光； 信天堂有路而可登，超凡入圣。 再拜，上进寿烛。 法事",
      "translated_text": "**Perfected Person Wang of Left Mystery**\n**Perfected Person Zhao of Right Mystery**\n**Forebear Ge the Immortal of Supreme Polarity**\n**Grand Scribe of the Nine Provinces, Supreme Immortal**\n**Eleven Perfected Lords of Wu and Huang**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWith solemn reverence we invoke:\n**Ancestral Master, August Emperor of Eastern Florescence, Purple Palace, Auxiliary Primordial, Establisher of the Pole**\n**August Lord Zhongli of Correct Yang, Awakener, Transmitter of the Dao, Bestower of Teachings**\n**August Lord of Pure Yang, Expounder of the Correct, Admonisher, Transformative Protector**\n**August Lord Hai Chan, Enlightened, Vast Dao, Pure Protector**\n**August Lord Chong Yang, Perfect Realization, Opener of Transformation, Auxiliary to the Pole**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWith solemn reverence we invoke:\n**Ancestral Master, Perfected Lord Dan Yang, Embracer of the One, Non-Action, Universal Transformation**\n**Perfected Lord Chang Zhen, Cloud and Water, Congealer of Spirit, Mysterious Quiescence, Reposer of Virtue**\n**Perfected Lord Chang Sheng, Auxiliary to Transformation, Founder of the Mysterious, Illuminator of Virtue**\n**Perfected Lord Chang Chun, Expounder of the Dao, Perfect in Virtue, Divine Transformation, Manifest Responder**\n**Perfected Lord Guang Ning, Penetrator of the Mysterious, Wondrous to the Utmost, Primeval of Antiquity**\n**Perfected Lord Yu Yang, Embodier of the Mysterious, Vast Compassion, Universal Salvation**\n**Perfected Consort Qing Jing, Profound and Steadfast, Mysterious Emptiness, Accordant Transformation, Primordial Sovereign**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWith solemn reverence we invoke:\n**Perfected Person Zi Yang of Tian Tai, Awakened to Reality**\n**Perfected Person Cui Xuan of the Fathomless Forest**\n**Perfected Person Dao Guang of Purple Worthiness**\n**Perfected Person Ni Wan of Emerald Emptiness**\n**Perfected Person Zi Qing of the Southern Sea**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWith solemn reverence we invoke:\n**Ancestral Master, Perfected Person Song of Yellow Chamber, Cloud-Clad**\n**Perfected Person Li of Supreme Emptiness**\n**Perfected Person Zhang of Purple Jade**\n**Initiation Master, Perfected Person Zhao of the Spinal Meridian**\n**Initiation Master, Perfected Person Liu of Valley Clouds**\n**All the Sages and Worthies of Past and Present, Cultivators of Reality, Learners of Immortality, Attainers of the Dao**\n\nReverently we gaze toward the celestial grace, beseeching descent to the altar-throne.\n\nWe now extend our entreaty, trusting in your gracious presence, humbly hoping for your lingering stay, that we may offer this devotion in reverence.\n\nOn this auspicious dawn of Pure Yang, we present our foolish sincerity in homage.\n\nThe candle—this single point of numinous radiance—has been abundant through all ages, pervading the ten directions, uniting the hidden and the manifest.\nThe unknowing regard it as mere fire passed on; the knowing declare it the nature of wisdom.\nIt kindles the heart in dark chambers, inspiring awe and turning the light inward;\nIt affirms the path to Heaven’s halls, enabling transcendence from the mundane to the sacred.\n\nWe bow twice and present the longevity candles for the ritual.",
      "overlap_context": "ed Person Zhou of the Eight Simplicities**\n**Perfected Person Yin of Tai Wei**\n**Perfected Person Wang of the Yellow Court**\n**Immortal Li Xianqing of the Western Peak**\n**Venerable Elder of the River’s Edge**\n**Perfected Person An Qisheng**\n**Perfected Person Ma Mingsheng**\n**Perfected Person Yin Changsheng**\n**Perfected Person Xu Congshi**\n**Perfected Person Wei Boyang**\n**Perfected Person Liu Jinbi**\n**Great Dharma Master of the Three Heavens**\n**Great Dharma Master of the Mysterious Center**",
      "start_char": 812,
      "end_char": 1348,
      "start_sentence": 76,
      "end_sentence": 120,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.855005025863647,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要仙派.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "夫香者，粤从太古之初，一枝挺出； 奚待三皇之后，几劫流芳。 下愚有鼻而无闻，上士闻香而分臭。 如圣师之捻土，处处苾芬； 以道德而强名，人人受用。 再拜，上进寿香。 夫茶者，先春雀舌，谷雨枪旗。 斟蟹眼汤，白花浮於椀面； 酌龙泉水，仙风引於蓬莱。 卢仝六椀而通仙灵，赵州一瓯而参佛性。 提惺瞌睡汉，发明蒙□仙。 再拜，进茶。 夫酒者，天垂甘露，地涌醴泉。 上味醍醐，饮者常醒而不醉； 圣人糟粕，得之以有而归无。 一口吸西江，容颜不老； 三杯通大道，法体长存。 再拜，上进寿酒。 法事 讽心印经三十品功德经 具有称贺表文，谨当跪奏。 锺离祖师贺表 大道弟子某，今月十五日，恭逢祖师锺离正阳帝君毓瑞之辰，预向今辰十四日，谨奉表称贺者。 右伏以道尊德贵，仰万代之师阴尽阳纯，际高仙之寿旦，月圆天上，瑞蔼人间。 某顿首再拜，恭惟祖师锺离正阳开悟传道垂教帝君，自本自根，先天先地。 把乾坤为鼎器，炼坎还离； 捉乌兔为药材，降龙伏虎。 道超太极，恩溥群生，劫劫长存，人人受度。 由纯阳、海蟾、重阳继授之后，列圣心心； 暨丹阳、长春、紫阳接济以来，为众父父。 功非言辞之可颂，仁与造化之相侔。 某凡骨未灵，真心於道。 幸蒙师旨，玄牝乃天地之根； 详在丹书，精气是阴阳之本。 华池神水，号曰乾金； 土釜流珠，是名木汞。 两弦合体，十月怀胎。 所切者妙用霎时，最难者真静应物。 况首经至宝，言之甚危； 而雄虎寡情，为之深恐。 兹因朝贺，并述危难，仰冀慈悲，俯忴微贱。 与安身於方便，俾入室以无魔。 仙家日月长，又何待尘凡之祝颂； 他年功行满，全依师匠之陶成。 次期上士贤良，俱明至道，迷愚诳诞，悔发信心。 酥酪成河，醍醐灌顶，土皆碧玉，地遍黄金。 干冒师真，不胜战汗。 谨具表称贺以闻。 某诚惧诚抃，顿首稽首，再拜谨言。 年　月　日　大道弟子某贺表 纯阳祖师贺寿表 大道弟子某，今月十四日，恭遇祖师纯阳帝君降诞令辰，谨具表恭伸朝贺者。 右伏以节届纯阳，月先圆於此夜； 天锺元气，行已满於多年。 宇宙腾惧，仙凡称寿。 某顿首再拜，恭惟祖师纯阳演正警化孚佑帝君，道高千古，瑞粹群灵。 内观其心，外观其形，故得全形之奥； 有以观窍，无以观妙，咸归众妙之门。 挹水源之至清，炼金丹而早就。 青蛇袖裹，过洞庭而朗吟； 黄鹤楼前，隐市崖而吹笛。 戏执中而一化仙女，为图南而几到华山。 跨青牛而入洞天，骑白鹿而过沧海。 高证帝君之位，功亘古而亘今； 广传道德之真，派自南而自北。 公欲济世而人不识，我欲求公而缘未谐。 伏念某莫明玄牝之旨归，幸遇真师之盟授。 乃悟道非言显，方知事属心传。 当求八两之乾金，先明宾主； 仍运半斤之木汞，配合阴阳。 炼做一团，守成十月，静听龙吟而虎啸，毋使水乾而火寒。 得止於斯，为之甚恐，忙忙罔措，汲汲忘餐。 倘蒙慈悯，而获饮刀圭； 活此衰残，而熟知火候。 虽无可报，所恃好生。 兹幸际於昌时，且忻逢於瑞旦，敢陈凡悃，遥拜仙丰。 谅尊居天叩之纠司，想垂怜於末学； 虽不假人间之祝颂，因以诉於衷情。 冀阴相於凡躯，俾早收於物药。 采首经之至宝，内外不愆； 炼一气之先天，始终尽善。",
      "translated_text": "The incense—since the dawn of primordial antiquity, a single branch has emerged; what need awaits the Three Sovereigns or the passage of kalpas to diffuse its fragrance? The ignorant possess noses yet cannot discern; the noble discern fragrance and distinguish scent. Like the sacred master’s pinch of earth, everywhere it is fragrant; by virtue and power it is named, and all receive its benefit.\n\nWe bow twice and present the longevity incense.\n\nThe tea—first plucked as the sparrow’s tongue of early spring, the spear and banner of Grain Rain. Pouring the crab-eye bubbles, white blossoms float upon the bowl’s surface; ladling the Dragon Spring’s water, a transcendent breeze wafts from Penglai. Lu Tong with six bowls communed with immortals; Zhaozhou with one cup fathomed Buddha-nature. It rouses the drowsy, awakens the dull-witted immortal.\n\nWe bow twice and offer the tea.\n\nThe wine—heaven bestows sweet dew, earth wells forth sweet springs. The supreme flavor is *tīgho*, those who drink remain ever sober; the sage’s lees, attained through being yet returning to non-being. One sip drains the Western River, the countenance never ages; three cups penetrate the Great Dao, the dharma-body endures forever.\n\nWe bow twice and present the longevity wine.\n\nThe ritual proceeds.\nRecitation of the *Heart-Imprint Sutra* and the *Thirty Chapters of Merit Sutra*.\nA congratulatory memorial is prepared, to be respectfully presented on bended knee.\n\n**Memorial in Celebration of Ancestral Master Zhongli**\n\nA disciple of the Great Dao, [Name], on the fifteenth day of this month, reverently observes the propitious birth of Ancestral Master Zhongli, the Perfected Yang Emperor. In advance of this day, the fourteenth, I humbly present this memorial in celebration.\n\nTo the right, I prostrate in awe: the Dao is exalted, virtue is noble, gazing up to the teacher of ten thousand generations, whose yin is exhausted and yang is pure. At the auspicious dawn of the transcendent’s longevity, the moon is full in the heavens, auspicious vapors suffuse the mortal realm.\n\nI kowtow twice, reverently reflecting upon Ancestral Master Zhongli, the Perfected Yang Emperor who awakened, transmitted the Dao, and bequeathed teachings—self-originating, prior to heaven and earth. Grasping heaven and earth as the crucible, refining *kan* to return to *li*; seizing the sun and moon as medicinal ingredients, taming dragons and subduing tigers. The Dao transcends the Supreme Ultimate, grace extends to all beings, enduring through kalpas, each person receiving deliverance. Following the transmissions of Pure Yang, Hai Chan, and Chongyang, the successive sages share one heart; since the aid of Dan Yang, Changchun, and Zi Yang, they have been fathers to the multitude. Merits defy praise in words, benevolence rivals the workings of creation.\n\nI, of unrefined bone and unenlightened heart, yet hold true devotion to the Dao. By fortune, I have received the master’s decree: the Mysterious Female is the root of heaven and earth; detailed in the alchemical texts, essence and *qi* are the foundation of yin and yang. The numinous water of the Flowery Pond is called *qian*-metal; the flowing pearls of the earthen crucible are named *mu*-mercury. The two bowstrings unite as one body, gestating for ten months. What is most urgent is the instantaneous application of the wondrous; what is most difficult is maintaining true stillness in response to phenomena. Moreover, the foremost scripture is the supreme treasure, its discourse fraught with peril; the male tiger is merciless, instilling profound fear.\n\nOn this occasion of celebration, I recount these perils and hardships, humbly beseeching compassion and condescension to this lowly one. Grant me refuge in expedient means, that I may enter the chamber free of demons. The immortals’ days and months are long—what need for the felicitations of the mortal realm? When merit and conduct are complete in future years, I shall rely wholly on the master’s refinement.\n\nMay superior and worthy ones all comprehend the supreme Dao; may the deluded and deceived awaken to sincere faith. May rivers of ghee flow, *tīgho* anoint the crown; may earth become jasper, the land be gilded with gold.\n\nI have presumptuously addressed the Perfected Master, trembling in awe.\n\nWith reverence and trepidation, I kowtow and bow twice, humbly submitting this memorial.\n\nYear   Month   Day\nDisciple of the Great Dao, [Name], Memorial in Celebration\n\n**Memorial in Celebration of the Birthday of Ancestral Master Pure Yang**\n\nA disciple of the Great Dao, [Name], on the fourteenth day of this month, reverently observes the auspicious birth of Ancestral Master Pure Yang, the Emperor of Manifest Transformation. I humbly present this memorial in celebration.\n\nTo the right, I prostrate in awe: the season arrives at Pure Yang, the moon first rounds on this night; heaven concentrates primordial *qi*, its course already fulfilled over many years. The cosmos rejoices, immortals and mortals offer felicitations.\n\nI kowtow twice, reverently reflecting upon Ancestral Master Pure Yang, the Emperor who propagated the true and admonished transformation—his Dao towers through the ages, his auspiciousness purifies all spirits. Inwardly observing the heart, outwardly observing the form, he thus attained the mysteries of preserving the body; observing the apertures through being, observing the wondrous through non-being, all converge at the gate of manifold wonders. Drawing from the utmost clarity of the water’s source, he refined the golden elixir to early completion. The green serpent coiled in his sleeve, he crossed Dongting reciting verses; before the Yellow Crane Tower, he concealed himself among city cliffs, playing the flute. In jest, he transformed a maid into an immortal; aspiring to soar southward, he nearly reached Mount Hua. Riding a green ox, he entered grotto-heavens; astride a white deer, he traversed the vast seas. He attained the rank of Perfected Emperor, his merit spanning past and present; he widely transmitted the truth of the Dao and virtue, his lineage spreading south and north.\n\nThough he desired to save the world, people did not recognize him; though I sought him, the karmic conditions were not yet ripe.\n\nI humbly reflect: I was ignorant of the Mysterious Female’s decree, yet by fortune encountered the true master’s initiation. Only then did I realize the Dao is not revealed through words, and only then did I know the matter belongs to mind-to-mind transmission. One must seek the eight taels of *qian*-metal, first clarifying host and guest; then circulate the half-catty of *mu*-mercury, harmonizing yin and yang. Refine them into one mass, maintain it for ten months, silently listening for the dragon’s roar and tiger’s howl, ensuring the water does not dry nor the fire grow cold. To attain cessation here is fraught with fear; in haste and confusion, I forget even to eat.\n\nIf I might receive compassion and obtain a draught of the medicinal spoon, reviving this feeble remnant, I would intimately know the fire’s timing. Though I have nothing to repay, I rely on the love of life.\n\nFortunately, I encounter this flourishing era and rejoice in this auspicious dawn. I dare present my humble sincerity, bowing from afar to the immortal’s majesty. Though I presume the exalted one resides in the celestial bureau of retribution, I imagine he bestows mercy upon this novice. Though I do not presume upon mortal felicitations, I thus pour forth my heartfelt plea. May he secretly assist this mortal frame, that I may early gather the medicinal ingredients. Gathering the supreme treasure of the foremost scripture, may inner and outer be without fault; refining the primordial *qi* of the One Breath, may beginning and end be perfectly good.",
      "overlap_context": "y in homage.\n\nThe candle—this single point of numinous radiance—has been abundant through all ages, pervading the ten directions, uniting the hidden and the manifest.\nThe unknowing regard it as mere fire passed on; the knowing declare it the nature of wisdom.\nIt kindles the heart in dark chambers, inspiring awe and turning the light inward;\nIt affirms the path to Heaven’s halls, enabling transcendence from the mundane to the sacred.\n\nWe bow twice and present the longevity candles for the ritual.",
      "start_char": 1348,
      "end_char": 2602,
      "start_sentence": 121,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.370546102523804,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要仙派.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "更无魔障，会见心灵。 便下手以速修，夫谁不愿； 与安身於方便，作事易成。 次期上士贤良，俱明至道。 与前同 具有证盟文疏，恭对敷宣： 大道弟子某，今月十四日， 恭逢祖师纯阳帝君瑞诞令辰，十五日恭逢 祖师正阳帝君瑞诞令辰。 谨备香烛，以今辰十四日，具表同申朝贺，兹已周圆。 仰蒙高仙众圣同赐印盟，虔贡楮财，敬殚皈谢。 祈保学道无魔，修仙有分，仰干慈悯，阴佑危难。 俾入室而功成，不差火候； 早脱胎而神化，高揖仙斑。 次期上士贤良，俱明至道； 迷愚 诳诞，悔发信心。",
      "translated_text": "With no demonic obstructions, the mind’s numinosity is revealed.\nThen swiftly commence cultivation—who would not wish this?\nAnd with the body settled in expedient means, tasks are easily accomplished.\n\nNext, may the superior and worthy, all enlightened to the supreme Dao,\ntogether with the previous assembly, present their covenanted petitions and memorials,\nreverently proclaiming before the assembly:\n\nThe Dao disciple [Name], on this fourteenth day of the present month,\nreverently encounters the auspicious birth anniversary of Patriarch Pure Yang Emperor Lord,\nand on the fifteenth day reverently encounters the auspicious birth anniversary of Patriarch Orthodox Yang Emperor Lord.\nRespectfully preparing incense and candles, on this fourteenth day,\na memorial is jointly submitted in celebration—now duly completed.\n\nWe humbly receive the joint covenant-seal of the exalted immortals and host of sages,\ndevoutly offering paper wealth, and earnestly prostrating in gratitude.\nWe pray for protection in Dao-learning, free from demonic interference,\nand for a share in immortal cultivation, beseeching compassionate mercy\nto secretly assist in peril and hardship.\nMay we enter the chamber and perfect our work, the fire’s timing unerring;\nearly shed the mortal coil and transform through spirit, ascending to join the immortal ranks.\n\nNext, may the superior and worthy, all enlightened to the supreme Dao,\nawaken the deluded and deceived, that they may repent and arouse the mind of faith.",
      "overlap_context": "majesty. Though I presume the exalted one resides in the celestial bureau of retribution, I imagine he bestows mercy upon this novice. Though I do not presume upon mortal felicitations, I thus pour forth my heartfelt plea. May he secretly assist this mortal frame, that I may early gather the medicinal ingredients. Gathering the supreme treasure of the foremost scripture, may inner and outer be without fault; refining the primordial *qi* of the One Breath, may beginning and end be perfectly good.",
      "start_char": 2602,
      "end_char": 2832,
      "start_sentence": 202,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.277089595794678,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要仙派.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "酥酪成河，醍醐灌顶； 土皆碧玉，地遍黄金。 干冒师严，敷宣罔既。 右谨具疏，顿首拜上： 先天道祖太上老君 三教得道先圣仙师 文始天尊尹先生 如前请神位次列写无增减 送神文 向来情悃，冒读聪明，仰冀矜原，广开接引。 屈仙谛而来降於尘寰、凌兢罔措； 返真游而复归於蓬岛，攀恋惟勤。 兹当拜送之期，负此虚居之愧。 伏闻独自行独自坐，姓名还动帝王心：无人会无人知，诗句喧传卿相耳。 凡夫肉眼知多少，金丹一粒定长生。 这回相见不无缘，衷情欲诉； 举世尽皆寻此道，此事难知。 下手速修犹太迟，世间谁是能行者。 此身已出三千界，昔尚赠於张僧； 许我同游五帝乡，今愿怜於凡骨。 莫道凡流空命薄，乞与贫儒换骨丹。 真人已在玉清游，剑横双水岸； 先生去后应难老，身在大罗天。 来无影去无踪，纠司天上神仙籍； 听不闻视不见，臣事玉皇归泰清。 冒渍惟深，一心拜送。 上阳子金丹大要仙派竟",
      "translated_text": "Amid rivers of clarified butter and streams of ghee poured upon the crown,\njade-green earth and golden lands spread boundless.\nDaring to offend the master’s solemn dignity, we yet presume to proclaim without end.\n\nTo the right, this memorial is respectfully submitted with bowed head:\nThe Primordial Dao-Ancestor, Most High Lord Lao;\nThe Three Teachings’ Enlightened Perfected Sages and Immortal Masters;\nThe Celestial Worthy of Literary Beginnings, Master Yin—\nas previously invoked, their divine ranks are inscribed without addition or omission.\n\n**Prayer for Sending Forth the Divine**\nThe sentiments just expressed have dared to strain your enlightened hearing;\nwe humbly implore your compassion and broad grace in reception and guidance.\nThough you condescend to descend from the celestial realms to this dusty world,\nyour awe and reverence leave us overwhelmed;\nas you return to wander the Isles of Peng, your lingering affection remains deep.\nNow, at this hour of reverent farewell, we bear the shame of this empty abode.\n\nWe have heard:\nWalking alone, sitting alone, one’s name yet stirs the hearts of emperors;\nunseen, unknown, one’s verses still resound in the ears of ministers.\nHow much can mortal eyes perceive?\nA single grain of golden elixir secures eternal life.\nThis meeting was not without cause—our heart’s plea longs to be voiced;\nthough all the world seeks this Dao, its truth remains elusive.\nTo begin practice swiftly is already too late—who in this world can truly walk this path?\nThis body has already transcended the Three Thousand Realms,\nas of old you bestowed upon Zhang the Painter;\nnow you promise me a journey to the Five Emperors’ realm—\nwe pray you take pity on these mortal bones.\nDo not say the common folk are doomed to thin fate;\ngrant this poor scholar the elixir to transform his frame.\n\nThe Perfected One now roams the Jade Clarity,\nsword resting by the twin rivers’ shore;\nsince the Master’s departure, he should not age—\nhis body dwells in the Great Mystery Heaven.\nComing without shadow, going without trace,\nhe rectifies the celestial registers of immortals;\nhearing not, seeing not,\nhe serves the Jade Emperor and returns to Grand Purity.\n\nOur presumption runs deep—with wholehearted devotion, we bow in farewell.\n\nHere ends the *Golden Elixir Essentials of the Immortal Lineage of Shangyangzi*.",
      "overlap_context": " protection in Dao-learning, free from demonic interference,\nand for a share in immortal cultivation, beseeching compassionate mercy\nto secretly assist in peril and hardship.\nMay we enter the chamber and perfect our work, the fire’s timing unerring;\nearly shed the mortal coil and transform through spirit, ascending to join the immortal ranks.\n\nNext, may the superior and worthy, all enlightened to the supreme Dao,\nawaken the deluded and deceived, that they may repent and arouse the mind of faith.",
      "start_char": 2832,
      "end_char": 3213,
      "start_sentence": 219,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.493983745574951,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要仙派.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}