{
  "source_id": "东厨司命灯仪",
  "source_file": "chunked_daozang\\东厨司命灯仪.json",
  "total_chunks": 3,
  "total_original_chars": 1791,
  "total_translated_chars": 10477,
  "total_translation_time": 58.073201179504395,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\东厨司命灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Ritual of the Lamp for the Stove Lord of the Eastern Kitchen**\n\n*Sutra Title:* *Ritual of the Lamp for the Stove Lord of the Eastern Kitchen*. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Section of Cavernous Truth*, *Category of Dignified Rites*.\n\n**Ritual of the Lamp for the Stove Lord of the Eastern Kitchen**\nThe ritual proceeds according to form.\n\nToday, incense is burned and lamps are lit to make offerings to the original Stove Lord of the Eastern Kitchen, the Stove Lords of the Five Directions and Five Emperors, the Ladies of the Five Emperor Stove Lords, the Divine Stove of the Celestial Kitchen, the Spirit Stove of the Earthly Kitchen, the thirty-six Stove Lords, the Stove Lords of new and old hearths, the Spirit Mother of Cooking and Washing, the General of Water Transport, and all the majestic spirits of the stove’s taboos.\n\nBy the power of this true incense, universal offerings are made.\n\nIt is heard that Heaven is the lord of all spirits, punishing excess and rewarding virtue; the stove is the master of a household, correcting errors and restraining faults. Since its office is not trivial, reverence for it should be profound. On this auspicious morning, we humbly present our sincerest devotion. Though osmanthus wine has yet to fill the golden goblet, orchid incense is first kindled in the precious tripod. May our prayers ascend without obstruction, and may resonance be achieved.\n\nToday, the officiant [Name] has renovated the distant kitchen and hearth, rebuilding the chimney and renewing all. Fearing offense to the divine overseers, we respectfully offer this rite of pacification and gratitude.\n\nMay our foolish sincerity reach above, and may the sagely intent be secretly moved. Gazing before us, who could fail to see the rites of veneration? Sacrificing as if the spirits were present, we must uphold the utmost sincerity. Having received the petition’s words, we now present the offering of gathered herbs. The assembly takes refuge in devotion, reverently chanting praises.\n\n**Invocation of the Sacred Name.**\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Eastern Blue-green Emperor Jia-Yi, and all the taboo deities of the hearth household.\n\nWe have heard that the Controller of Destiny holds a revered name, entrusted by the Supreme Emperor with the mandate to oversee; the Stove God’s office is weighty, wielding authority over the fortunes of the common people. His transformations are manifold, his words beyond full recounting. In heaven, he serves as the Messenger of the Seven Primes, reporting daily all matters to the imperial court. Each hearth bears a distinct name, while the Five Directions may be called the Five Emperors. Their domains are divided, alternately governing yin and yang. Though good and evil alike depend on cultivation, right and wrong are invariably recorded with impartiality.\n\nToday, the officiant [Name], presuming to summon the sagely presence, respectfully presents fragrant libations. We pray that what is seen and heard shall be faithfully reported—what is written, let it be written; what is erased, let it be erased—so that heavenly grace may abundantly flow.\n\nBowing in reverence, we devoutly chant praises:\n*Azure spirit, apportioned qi, Blue-green Emperor, august deity.\nAbove, you receive the imperial mandate; below, you scrutinize human affairs.\nDeeds are recorded, transgressions noted; merits are rewarded, names memorialized.\nDaily your brush records, ceaselessly your work proceeds.\nReverence brings blessings; recklessness invites misfortune.\nWith bowed head, we offer thanks, praying for peace and tranquility.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Southern Red Emperor Bing-Ding, and all the taboo deities of the hearth household.\n\nWe have heard that the Six Gods revered in the hearth are indeed exalted; none among the people fail to depend on the three daily meals, which are likewise bound to heaven. Yet reflecting on our daily conduct, not all may be deemed upright. Today, the officiant [Name], entangled in worldly customs and bound by the ties of nurture and affection, quietly tends the steamer and pot, ever awaiting the boiling of water and the cooking of fire. Roasting and grilling give rise to foul odors; washing and rinsing scatter grains. Wielding knives and axes without regard for weight, burning grass and firewood without care for defilement. Scales and fur are mistakenly scorched; dung and straw are carelessly cast. Drunken revelry and loud voices, incantations and curses, baring flesh before the hearth, clamor in the kitchen precincts. Such offenses defy summary in a single word, countless sins beyond enumeration.\n\nNow, incense is burned and libations poured, water is offered with flowers. Trembling, we confess our faults; earnestly, we seek extraordinary blessings. We but pray for wealth to span generations, our sacrifices not unworthy of Yin Zifang; may we not incur heavenly wrath, nor vainly seek favor like Wangsun Jia.\n\nBowing in reverence, we devoutly chant praises:\n*Vermilion spirit, true qi, Red Emperor, august deity.\nSeated in the Li position, guardian of the sacred hearth.\nBestowing blessings, averting calamities,\nBinding the Nine Uglies, burning demonic spirits.\nThose who defy us perish; those who revere us thrive.\nWe issue this decree—let all the people obey.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Western White Emperor Geng-Xin, and all the taboo deities of the hearth household.\n\nWe have heard that in summer, offerings to the ancestors begin with the lungs, as detailed in *Lü’s Ordinances*; cinnabar transforms to gold, as recounted in the *Book of Han*. Every household has its hearth—how could one not reverently sacrifice? For the celestial bureaus receive the words reported, and in the human realm, transgressions accumulate into faults. From old to young, none are exempt; from minor to grave, how can offenses be excused?\n\nToday, the officiant [Name], wandering the dusty world, this fleeting fire-dwelling, unaware of taboos, no wonder his face is powdered and rouged; courting disaster, he ever fears scorched heads and blistered brows. Having bathed in vast mercy and received pardon, how dare we forget humble rites to return reverence? Sweeping away all misfortune, we invoke the Five Blessings. With protective divine objects, no malevolent spirits shall assail. Demons of fever pass by our door, never entering our home; bands of evil, though their voices are heard, remain unseen. May the calamities of clanging pots and shrieking axes cease; may the omens of fawning dogs and lurking foxes vanish.\n\nBowing in reverence, we devoutly chant praises:\n*Radiant and mighty spirit, White Emperor, august deity.\nReceiving the imperial mandate, wielding authority over all spirits.\nOverseeing the mortal realm, attending the Nine Pures above.\nSeated in the Dui palace, nurturing all life.\nTransforming evil into good, pardoning sins while preserving grace.\nDispelling myriad disasters, bestowing the mystic wind of virtue.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Northern Black Emperor Ren-Gui, and all the taboo deities of the hearth household.\n\nWe have heard that the people regard food as heaven; without a hearth, how can one cook? The hearth is heaven’s officer, charged with recording merits and misfortunes. By this sacred rite, we respectfully present our offerings.\n\nToday, the officiant [Name], fearing his household’s unease and the accumulation of grievous faults—where even a single good deed is left undone, a single word cannot suffice—has turned inward in reflection, surely able to transform misfortune into fortune. We pray for the sweeping away of ill omens, that we may ever abide in auspiciousness; for the banishment of malevolent spirits, that our years may flourish like the sacred tree.\n\nBowing in reverence, we devoutly chant praises:\n*In the Ren-Gui position, Dark Elder, august deity.\nCelestial spirit, mighty saint; earthly spirit, martial general.\nEver attending at our side, heeding commands and acting.\nA thousand fathoms tall, hands cradling heaven and earth.\nDwelling in rivers and seas, mastering the fire spirits.\nHeed our divine incantation—may we forever preserve purity and peace.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Central Yellow Emperor Wu-Ji, and all the taboo deities of the hearth household.\n\nWe have heard that his office in the human realm is most intimate to the people; his appointment in heaven is an honor bestowed by the Emperor.\n\nDaily he governs destiny—his charge is no light one;\nAs \"Prefect-Lord\" he is called—his title bears true weight.\nHis office oversees the kitchen, his authority holds the center.\n\nNow, this officiant, so-and-so, dwelling between heaven and earth,\nbeneath the radiance of sun and moon,\nunaware and unknowing,\nwhat fear, what refusal could there be?\nDrunk and wanton, stripped bare in reckless abandon,\nwords carelessly invoking spirits, incantations idly drawn,\nfoul odors assailing, tainted hands feeding the fire—\nsuch habits become the daily norm,\nwhile unseen, the spirits record all.\nNo merit, though slender as a hair;\ntransgressions, vast as mountains.\n\nWe humbly pray that the hundred spirits surround and protect,\nthat the ten thousand virtues lend their aid.\nSend forth true qi from the five directions,\nsweeping away demonic afflictions;\nfan auspicious winds through every household,\ntransforming all into waves of grace.\n\nBowing in reverence, we devoutly chant praises:\n*August spirit of the Yellow and the Old,\nEmperor of Wu-Ji.\nDwelling in the central position,\noverseeing the eight directions.\nGoverning the ten thousand forms,\nnone transgress his order.\nRewarding good and punishing evil,\nbestowing blessings beyond measure.\nShould any demonic force arise,\nit shall vanish into the earth.\nGuard and secure this household,\nforever extinguishing calamity.*\n\nThe recitation of scriptures, the proclamation of petitions, and the dedication of merit conclude the Lamp Rite of the Eastern Kitchen Controller of Destiny.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "东厨司命灯仪 经名：东厨司命灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 东厨司命灯仪 法事如式 以今焚香然灯，供养本音东厨司命灶君，五方五帝灶君，五帝灶君夫人，天厨灵灶，地厨神灶，三十六位灶君，新灶、旧灶神君，炊淘神母，运水将军，灶中禁忌一切威灵。 仗此真香，普同供养。 伏闻天为百神之君，祸淫福善； 灶乃一家之主，紏缪绳愆。 眷职掌之非轻，宜敬心之是重。 爰兹谷旦，特展芹诚，桂浆未注於金樽，兰炷先焚於宝鼎。 庶臻□蠁，克遂感通。 以今醮官某人远庖鼎创，曲突咸新，虑犯神司，敬伸安谢。 伏愿愚衷上达，圣意潜孚。 瞻之在前，孰睹尊崇之礼； 祭之如在，当严勤恳之诚。 既矜请命之辞，取效采芹之荐。 法众皈依，虔诚赞咏。 举圣号",
      "translated_text": "**Ritual of the Lamp for the Stove Lord of the Eastern Kitchen**\n\n*Sutra Title:* *Ritual of the Lamp for the Stove Lord of the Eastern Kitchen*. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Section of Cavernous Truth*, *Category of Dignified Rites*.\n\n**Ritual of the Lamp for the Stove Lord of the Eastern Kitchen**\nThe ritual proceeds according to form.\n\nToday, incense is burned and lamps are lit to make offerings to the original Stove Lord of the Eastern Kitchen, the Stove Lords of the Five Directions and Five Emperors, the Ladies of the Five Emperor Stove Lords, the Divine Stove of the Celestial Kitchen, the Spirit Stove of the Earthly Kitchen, the thirty-six Stove Lords, the Stove Lords of new and old hearths, the Spirit Mother of Cooking and Washing, the General of Water Transport, and all the majestic spirits of the stove’s taboos.\n\nBy the power of this true incense, universal offerings are made.\n\nIt is heard that Heaven is the lord of all spirits, punishing excess and rewarding virtue; the stove is the master of a household, correcting errors and restraining faults. Since its office is not trivial, reverence for it should be profound. On this auspicious morning, we humbly present our sincerest devotion. Though osmanthus wine has yet to fill the golden goblet, orchid incense is first kindled in the precious tripod. May our prayers ascend without obstruction, and may resonance be achieved.\n\nToday, the officiant [Name] has renovated the distant kitchen and hearth, rebuilding the chimney and renewing all. Fearing offense to the divine overseers, we respectfully offer this rite of pacification and gratitude.\n\nMay our foolish sincerity reach above, and may the sagely intent be secretly moved. Gazing before us, who could fail to see the rites of veneration? Sacrificing as if the spirits were present, we must uphold the utmost sincerity. Having received the petition’s words, we now present the offering of gathered herbs. The assembly takes refuge in devotion, reverently chanting praises.\n\n**Invocation of the Sacred Name.**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 317,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.607608079910278,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\东厨司命灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "焚香然灯，供养本音东属司命灶君，东方甲乙青帝灶君，灶家一切禁忌之神。 伏闻司命名尊，奉上帝差除之旨； 灶神职重，秉下民倚伏之权。 变化尤多，言辞难尽。 在天为七元之使者，递日奏万事於宸庭。 一灶各立一名，五方或称五帝。 群分部属，迭主阴阳。 虽善善恶恶，均在修为； 然是是非非，必公纪录。 以今醮官某人僭邀圣驾，祗荐香醪。 伏愿见所见，闻所闻，必言人过； 笔则笔，削则削，广沛天恩。 稽首归依，虔诚赞咏： 苍灵分炁，青帝尊神。 上承帝命，下察人伦。 言功录过，赏善奏名。 日日纪笔，时时无停。 敬则降善，妄则降迍。 倾心首谢，愿赐安宁。 焚香然灯，供养本音东厨司命灶君，南方丙丁赤帝灶君，灶家一切禁忌神众。 伏闻记名所祀之六神，实尊乎灶； 人莫不营於三膳，亦系乎天。 然思平日所为，未必今人皆是。 以今醮官某人萦缠世俗，养育爱缘，靖言甑爨以釜灊，每待水烹而火饪。 燔炙致腥膻之冲突，炊淘将米谷以抛违。 拖刀拽斧而岂识重轻，爇草燔柴则宁无秽触。 鳞毛悞爇，粪草故投，酣酒高声，牵神引咒，对灶庭而裸袒，向厨廨以喧呼。 殆难以蔽於一言，不可胜诛之万罪。 今则焚香奠醑，酌水献花，兢兢陈自讼之辞，恳恳觊非常之福。 但愿致富累世，祀不负於阴子方； 毋令获罪上天，媚徒劳於王孙贾。 稽首归依，虔诚赞咏： 丹灵真炁，赤帝尊神。 位居离位，职守鳌庭。 能垂福庆，善遣灾述。 束缚九丑，焚灭妖精。 逆吾者死，敬吾者生。 吾有此令，兆庶宜遵。 焚香然灯，供养本音东厨司命灶君，西方庚辛白帝灶君，灶家一切禁忌之神。 伏闻夏月祭先，肺备详吕令之辞； 丹砂化黄，金具述汉书之志。 家人有灶，人盍谨祠。 盖天曹纳所奏之言，况人世积俟为之咎。 自老及幼而匪一，从微至着以何言。 以今醮官某人遂逯尘寰，区区火宅。 不识忌讳，无怪乎粉态脂容； 自取颠隮，常惧乎焦头烂额。 既沐洪恩而赦宥，敢忘微礼以归崇。 扫荡群凶，向用五福。 有护持之神物，无凌烁之精邪。 行行温魔，过我门而不入我室； 棱棱恶党，闻其语，而未见其人。 绝甑鸣斧叫之灾，杜狗媚狐趋之怪。 稽首归依，虔诚赞咏： 皓灵大圣，白帝尊神。 受符上命，掌握群灵。 职司凡世，上侍九清。 位分兑舍，化育含生。 改恶为善，赦罪留恩。 吹飘万祸，善降玄风。 焚香然灯，供养本音东厨司命灶君，北方壬癸黑帝灶君，灶家一切禁忌神众。 伏闻民以食为天，无灶何从而烹饪； 灶乃天之吏，专司祸福以纪功。 是仗玄科，敬伸安奉。 以今醮官某人恐家人之踖踖，积大过之多多。 片善勿为，一言难尽。 既自回光返照，必能转祸为祥。 伏愿驱扫不祥，俾常臻於吉庆； 遣除凶怪，庶茂衍於椿期。 稽首归依，虔诚赞咏： 壬癸之位，玄老尊神。 天灵大圣，地灵将军。 俱侍左右，听令而行。 身长千丈，手托乾坤。 江海为宅，制御火精。 闻吾神咒，永保清宁。 焚香然灯，供养本音东厨司命灶君，中宫戊己黄帝灶君，灶家一切禁忌神众。 伏闻职在人间，谓亲民而最切； 告膺天上，奉帝命之荣除。",
      "translated_text": "Incense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Eastern Blue-green Emperor Jia-Yi, and all the taboo deities of the hearth household.\n\nWe have heard that the Controller of Destiny holds a revered name, entrusted by the Supreme Emperor with the mandate to oversee; the Stove God’s office is weighty, wielding authority over the fortunes of the common people. His transformations are manifold, his words beyond full recounting. In heaven, he serves as the Messenger of the Seven Primes, reporting daily all matters to the imperial court. Each hearth bears a distinct name, while the Five Directions may be called the Five Emperors. Their domains are divided, alternately governing yin and yang. Though good and evil alike depend on cultivation, right and wrong are invariably recorded with impartiality.\n\nToday, the officiant [Name], presuming to summon the sagely presence, respectfully presents fragrant libations. We pray that what is seen and heard shall be faithfully reported—what is written, let it be written; what is erased, let it be erased—so that heavenly grace may abundantly flow.\n\nBowing in reverence, we devoutly chant praises:\n*Azure spirit, apportioned qi, Blue-green Emperor, august deity.\nAbove, you receive the imperial mandate; below, you scrutinize human affairs.\nDeeds are recorded, transgressions noted; merits are rewarded, names memorialized.\nDaily your brush records, ceaselessly your work proceeds.\nReverence brings blessings; recklessness invites misfortune.\nWith bowed head, we offer thanks, praying for peace and tranquility.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Southern Red Emperor Bing-Ding, and all the taboo deities of the hearth household.\n\nWe have heard that the Six Gods revered in the hearth are indeed exalted; none among the people fail to depend on the three daily meals, which are likewise bound to heaven. Yet reflecting on our daily conduct, not all may be deemed upright. Today, the officiant [Name], entangled in worldly customs and bound by the ties of nurture and affection, quietly tends the steamer and pot, ever awaiting the boiling of water and the cooking of fire. Roasting and grilling give rise to foul odors; washing and rinsing scatter grains. Wielding knives and axes without regard for weight, burning grass and firewood without care for defilement. Scales and fur are mistakenly scorched; dung and straw are carelessly cast. Drunken revelry and loud voices, incantations and curses, baring flesh before the hearth, clamor in the kitchen precincts. Such offenses defy summary in a single word, countless sins beyond enumeration.\n\nNow, incense is burned and libations poured, water is offered with flowers. Trembling, we confess our faults; earnestly, we seek extraordinary blessings. We but pray for wealth to span generations, our sacrifices not unworthy of Yin Zifang; may we not incur heavenly wrath, nor vainly seek favor like Wangsun Jia.\n\nBowing in reverence, we devoutly chant praises:\n*Vermilion spirit, true qi, Red Emperor, august deity.\nSeated in the Li position, guardian of the sacred hearth.\nBestowing blessings, averting calamities,\nBinding the Nine Uglies, burning demonic spirits.\nThose who defy us perish; those who revere us thrive.\nWe issue this decree—let all the people obey.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Western White Emperor Geng-Xin, and all the taboo deities of the hearth household.\n\nWe have heard that in summer, offerings to the ancestors begin with the lungs, as detailed in *Lü’s Ordinances*; cinnabar transforms to gold, as recounted in the *Book of Han*. Every household has its hearth—how could one not reverently sacrifice? For the celestial bureaus receive the words reported, and in the human realm, transgressions accumulate into faults. From old to young, none are exempt; from minor to grave, how can offenses be excused?\n\nToday, the officiant [Name], wandering the dusty world, this fleeting fire-dwelling, unaware of taboos, no wonder his face is powdered and rouged; courting disaster, he ever fears scorched heads and blistered brows. Having bathed in vast mercy and received pardon, how dare we forget humble rites to return reverence? Sweeping away all misfortune, we invoke the Five Blessings. With protective divine objects, no malevolent spirits shall assail. Demons of fever pass by our door, never entering our home; bands of evil, though their voices are heard, remain unseen. May the calamities of clanging pots and shrieking axes cease; may the omens of fawning dogs and lurking foxes vanish.\n\nBowing in reverence, we devoutly chant praises:\n*Radiant and mighty spirit, White Emperor, august deity.\nReceiving the imperial mandate, wielding authority over all spirits.\nOverseeing the mortal realm, attending the Nine Pures above.\nSeated in the Dui palace, nurturing all life.\nTransforming evil into good, pardoning sins while preserving grace.\nDispelling myriad disasters, bestowing the mystic wind of virtue.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Northern Black Emperor Ren-Gui, and all the taboo deities of the hearth household.\n\nWe have heard that the people regard food as heaven; without a hearth, how can one cook? The hearth is heaven’s officer, charged with recording merits and misfortunes. By this sacred rite, we respectfully present our offerings.\n\nToday, the officiant [Name], fearing his household’s unease and the accumulation of grievous faults—where even a single good deed is left undone, a single word cannot suffice—has turned inward in reflection, surely able to transform misfortune into fortune. We pray for the sweeping away of ill omens, that we may ever abide in auspiciousness; for the banishment of malevolent spirits, that our years may flourish like the sacred tree.\n\nBowing in reverence, we devoutly chant praises:\n*In the Ren-Gui position, Dark Elder, august deity.\nCelestial spirit, mighty saint; earthly spirit, martial general.\nEver attending at our side, heeding commands and acting.\nA thousand fathoms tall, hands cradling heaven and earth.\nDwelling in rivers and seas, mastering the fire spirits.\nHeed our divine incantation—may we forever preserve purity and peace.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Central Yellow Emperor Wu-Ji, and all the taboo deities of the hearth household.\n\nWe have heard that his office in the human realm is most intimate to the people; his appointment in heaven is an honor bestowed by the Emperor.",
      "overlap_context": "divine overseers, we respectfully offer this rite of pacification and gratitude.\n\nMay our foolish sincerity reach above, and may the sagely intent be secretly moved. Gazing before us, who could fail to see the rites of veneration? Sacrificing as if the spirits were present, we must uphold the utmost sincerity. Having received the petition’s words, we now present the offering of gathered herbs. The assembly takes refuge in devotion, reverently chanting praises.\n\n**Invocation of the Sacred Name.**",
      "start_char": 317,
      "end_char": 1509,
      "start_sentence": 20,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.80358052253723,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\东厨司命灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "日司命而命，掌非轻； 称府君而君，衔实重。 职司厨内，掌握居中。 以今醮官某人居覆载之间，沐照临之下，不知不识，何虑何辞，醉酣裸体以轻狂，语话牵神而引咒，腥臊熏触，秽手进薪，习为朝夕之常，阴有神明之录。 功无毫发，过若丘山。 伏愿百神拥护，万善资扶。 降真炁於五方，荡除妖厌； 扇祥风於比屋，化作恩波。 稽首归依，虔诚赞咏： 皇灵黄老，戊己帝王。 居其中位，总领八方。 提摄万象，罔越纪纲。 赏善罚恶，赐福非常。 若有妖孽，入地消亡。 保安家舍，永殄灾殃。 讽经　宣疏　回向 东厨司命灯仪竟",
      "translated_text": "Daily he governs destiny—his charge is no light one;\nAs \"Prefect-Lord\" he is called—his title bears true weight.\nHis office oversees the kitchen, his authority holds the center.\n\nNow, this officiant, so-and-so, dwelling between heaven and earth,\nbeneath the radiance of sun and moon,\nunaware and unknowing,\nwhat fear, what refusal could there be?\nDrunk and wanton, stripped bare in reckless abandon,\nwords carelessly invoking spirits, incantations idly drawn,\nfoul odors assailing, tainted hands feeding the fire—\nsuch habits become the daily norm,\nwhile unseen, the spirits record all.\nNo merit, though slender as a hair;\ntransgressions, vast as mountains.\n\nWe humbly pray that the hundred spirits surround and protect,\nthat the ten thousand virtues lend their aid.\nSend forth true qi from the five directions,\nsweeping away demonic afflictions;\nfan auspicious winds through every household,\ntransforming all into waves of grace.\n\nBowing in reverence, we devoutly chant praises:\n*August spirit of the Yellow and the Old,\nEmperor of Wu-Ji.\nDwelling in the central position,\noverseeing the eight directions.\nGoverning the ten thousand forms,\nnone transgress his order.\nRewarding good and punishing evil,\nbestowing blessings beyond measure.\nShould any demonic force arise,\nit shall vanish into the earth.\nGuard and secure this household,\nforever extinguishing calamity.*\n\nThe recitation of scriptures, the proclamation of petitions, and the dedication of merit conclude the Lamp Rite of the Eastern Kitchen Controller of Destiny.",
      "overlap_context": " and earth.\nDwelling in rivers and seas, mastering the fire spirits.\nHeed our divine incantation—may we forever preserve purity and peace.*\n\nIncense is kindled and lamps are lit, in offering to the Original Tone’s Eastern Kitchen Controller of Destiny, the Stove Lord of the Central Yellow Emperor Wu-Ji, and all the taboo deities of the hearth household.\n\nWe have heard that his office in the human realm is most intimate to the people; his appointment in heaven is an honor bestowed by the Emperor.",
      "start_char": 1509,
      "end_char": 1748,
      "start_sentence": 99,
      "end_sentence": 115,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.662012577056885,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\东厨司命灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}