{
  "source_id": "中天紫微星真宝忏",
  "source_file": "chunked_daozang\\中天紫微星真宝忏.json",
  "total_chunks": 2,
  "total_original_chars": 1985,
  "total_translated_chars": 14746,
  "total_translation_time": 73.88176131248474,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\中天紫微星真宝忏.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The True Precious Repentance Ritual to the Star of the Central Heavenly Purple Tenuity**\n\n**Scripture Title:** *The True Precious Repentance Ritual to the Star of the Central Heavenly Purple Tenuity*\n**Volume:** One\n**Source Text:** *Wanli Continuation of the Daoist Canon*\n\n---\n\n**The True Precious Repentance Ritual to the Star of the Central Heavenly Purple Tenuity**\n\nWe prostrate ourselves before the great virtue of Heaven and Earth, which broadly sustains and nurtures all living beings; before the radiant light of the Sun and Moon, which universally illumines the ten thousand phenomena. In all earnest supplication, we humbly beseech your divine observation.\n\nYour servant now kindles true incense, offering sincere devotion and reverent invocation, making offerings to the Supreme Void Sovereign of the Three Realms of the Great Dao, the Star Lord of the Central Heaven—the August Emperor of the Northern Culmen and Purple Tenuity; the Celestial King of the Zhou Dynasty of the Dragon Han Primordial Kalpa, Father of the Dipper; the Great Sage Mahādevī, Mother of the Dipper; the August Star Lord of the Most High Jade Emperor; the Great Emperor of the Northern Culmen and Mysterious Minister; the Imperial Lord of the Sun Palace; the Star Lord of the Moon Mansion; the Star Lords of the Five Directions and Five Virtues; the Star Lords of the Four Qi and Four Luminaries; the Great Sage Star Lord of the Celestial Stem; the Star Lords of the Three Terraces and Canopy; the Star Lords of the Twenty-Eight Constellations; the Star Lords of the Twelve Palaces and Celestial Branches; the Star Lord of one’s natal destiny; the Three Elder Star Lords of Supreme Clarity—Fortune, Prosperity, and Longevity; the Star Lords presiding over the year’s fate and karmic influences; the Star Lords within and beyond the Three Enclosures; the Star Lords of the revolving heavens, the Milky Way, and all celestial luminaries; and the myriad perfected sages of the Three Realms and Ten Directions.\n\nWe reverently implore your vast compassion to witness this act of repentance.\n\nWe have heard: The Supreme Ultimate gave birth to the Two Modes, from which celestial images descended, silently governing the transformations of the cosmos. The lofty firmament arrayed the constellations to radiate brilliance, dividing their splendor across the earth. The heavens revolve through three hundred sixty-five and a quarter degrees, with subtle calculations numbering seventeen thousand five hundred and twenty hidden names. Their movements—whether slow or swift, direct or retrograde—follow the celestial paths, circling through the divisions of the earth.\n\nWe reverently consider the Star Lord, the August Emperor of Purple Tenuity: his jade steps are majestic, his jasper heavens lofty and remote. He presides over creation, holding the pivot of cosmic mechanisms. Seated in authority, he governs the Three Heavens; in his rule, he directs the movements of the Nine Paths. The Seven Governors and Four Qi issue their decrees through spring, summer, autumn, and winter; the Five Dippers and host of stars guard the directions and trigrams of Qian, Kun, Li, and Kan. The natal star of one’s destiny shines brightly; the Three Elders of Fortune, Prosperity, and Longevity radiate luminosity. The Celestial Stem encircles the firmament; the lunar lodges and luminaries illumine the earth. Though silent, their responses are unfailing—where there is resonance, there is communication. Heaven is impartial, yet ever aids those of virtue; the lives of humans are endowed by the firmament above.\n\nWe, your servants, take refuge and reverently perform this precious repentance, bowing our heads to the august numen, gazing toward the Dipper’s pole with devoted hearts.\n\nToday, we offer this on behalf of [Name], from the beginningless past to the present life. Driven by a single deluded thought, the six senses have become entangled; indulging in the three karmic actions without awareness, the ten evils have accumulated. Without repentance and confession, how could we presume upon your grace and forgiveness? Thus, we present these articles in reverent submission, taking refuge and paying homage. We gaze upward to the Purple Tenuity, the sagely pivot of the celestial sphere, and to the host of perfected beings. May blessings be universally bestowed, and compassionate light descend to universally illumine. May the three karmic actions be purified, the six senses cleansed, the five fortunes flourish abundantly, and a thousand auspicious signs converge in harmony.\n\nWe, your servants, look to heaven and long for the sagely presence, our hearts filled with earnest devotion. With utmost sincerity, we bow in reverence.\n\n**Each person reverently and sincerely bows in homage:**\n\nWith a devoted heart, we bow to the August Star Lord of the Most High Jade Emperor;\nTo the Star Lord of the Central Palace of Purple Tenuity, the August Emperor of the Northern Culmen;\nTo the Heavenly August Emperor of the Southern Culmen of the Upper Palace of Purple Tenuity;\nTo the Celestial King of the Zhou Dynasty of the Dragon Han Primordial Kalpa, Father of the Dipper;\nTo the Heavenly Empress of Radiant Purple Light, the Golden August Sage of Sacred Virtue and Vast Illumination, Mother of the Dipper;\nTo the Imperial Lord of the Fiery Brilliance of the Sun Palace;\nTo the August Lord of the Pale Radiance of the Moon Mansion;\nTo the Star Lord of the Wooden Virtue of the East, the Year Star;\nTo the Star Lord of the Fiery Virtue of the South, the Sparkling Deluder;\nTo the Star Lord of the Metallic Virtue of the West, the White Star of Jupiter;\nTo the Star Lord of the Watery Virtue of the North, the Watcher of Dawn;\nTo the Star Lord of the Earthen Virtue of the Center, the Quelling Star;\nTo the Star Lord of the Ascending Node, Rāhu;\nTo the Star Lord of the Descending Node, Ketu;\nTo the Star Lord of the Purple Qi of Hua Yang, the Celestial One;\nTo the Star Lord of the Lunar Comet of Hua Yin, the Moon Mansion.\n\nTo the Star Lord of the Celestial Pivot of the Northern Dipper, the Yang Brightness and Greedy Wolf;\nTo the Star Lord of the Celestial Rotation of the Northern Dipper, the Yin Essence and Mighty Gate;\nTo the Star Lord of the Celestial Mechanism of the Northern Dipper, the True Person and Wealth Preserver;\nTo the Star Lord of the Celestial Balance of the Northern Dipper, the Mysterious Darkness and Literary Brilliance;\nTo the Star Lord of the Celestial Beam of the Northern Dipper, the Cinnabar Prime and Upright Chastity;\nTo the Star Lord of the Opening Yang of the Northern Dipper, the Northern Culmen and Martial Brilliance;\nTo the Star Lord of the Jade Radiance of the Northern Dipper, the Celestial Pass and Breaking Army;\nTo the Star Lord of the Penetrating Brilliance of the Northern Dipper, the Left Auxiliary;\nTo the Star Lord of the Hidden Brilliance of the Northern Dipper, the Right Assistant.\n\nTo the Star Lord of the Celestial Mansion of the Southern Dipper, Controller of Destiny;\nTo the Star Lord of the Celestial Minister of the Southern Dipper, Recorder of Deeds;\nTo the Star Lord of the Celestial Beam of the Southern Dipper, Prolonger of Life;\nTo the Star Lord of the Celestial Union of the Southern Dipper, Increaser of Years;\nTo the Star Lord of the Celestial Pivot of the Southern Dipper, Dispeller of Calamity;\nTo the Star Lord of the Celestial Mechanism of the Southern Dipper, Bestower of Life.\n\nTo the Star Lord of the Eastern Dipper, the Azure Spirit and Prolonger of Life;\nTo the Star Lord of the Eastern Dipper, the Ascending Brilliance and Guardian of Destiny;\nTo the Star Lord of the Eastern Dipper, the Opener of Heaven and Great Protector, Assembler of Blessings;\nTo the Star Lord of the Eastern Dipper, the Great Brilliance and Harmonizer of Yang, Preserver of Harmony;\nTo the Star Lord of the Eastern Dipper, the Ultimate Tail and Supreme Overseer.\n\nTo the Star Lord of the Western Dipper, the White Standard;\nTo the Star Lord of the Western Dipper, the Lofty Prime;\nTo the Star Lord of the Western Dipper, the August Spirit;\nTo the Star Lord of the Western Dipper, the Mighty Authority.\n\nTo the Star Lord of the Central Dipper, the Radiant Spirit and Dispeller of Mortality;\nTo the Star Lord of the Central Dipper, the Revolving Transformer and Supreme Sage;\nTo the Star Lord of the Central Dipper, the Balanced Harmony and Perfect Virtue;\nTo the Star Lord of the Celestial Stem, the Regulator of the Purple Court.\n\nTo the Star Lord of the Upper Terrace, the Void Essence and Opener of Virtue;\nTo the Star Lord of the Middle Terrace, the Prosperous Purity and Controller of Emptiness;\nTo the Star Lord of the Lower Terrace, the Crooked Life and Controller of Prosperity.\n\nTo the Star Lord of the Horn Mansion, the Celestial Gate;\nTo the Star Lord of the Neck Mansion, the Celestial Court;\nTo the Star Lord of the Root Mansion, the Celestial Storehouse;\nTo the Star Lord of the Chamber Mansion, the Celestial Chariot;\nTo the Star Lord of the Heart Mansion, the Celestial King;\nTo the Star Lord of the Tail Mansion, the Celestial Rooster;\nTo the Star Lord of the Winnowing Basket Mansion, the Celestial Ford;\nTo the Star Lord of the Dipper Mansion, the Celestial Temple;\nTo the Star Lord of the Ox Mansion, the Celestial Mechanism;\nTo the Star Lord of the Maiden Mansion, the Celestial Maiden;\nTo the Star Lord of the Emptiness Mansion, the Celestial Minister;\nTo the Star Lord of the Rooftop Mansion, the Celestial Coin;\nTo the Star Lord of the Encampment Mansion, the Celestial Granary;\nTo the Star Lord of the Wall Mansion, the Celestial Market;\nTo the Star Lord of the Straddler Mansion, the Celestial General;\nTo the Star Lord of the Bond Mansion, the Celestial Prison;\nTo the Star Lord of the Stomach Mansion, the Celestial Granary;\nTo the Star Lord of the Pleiades Mansion, the Celestial Eye;\nTo the Star Lord of the Net Mansion, the Celestial Ear;\nTo the Star Lord of the Turtle Beak Mansion, the Celestial Screen;\nTo the Star Lord of the Three Stars Mansion, the Celestial Water;\nTo the Star Lord of the Well Mansion, the Celestial Well;\nTo the Star Lord of the Ghost Mansion, the Celestial Coffer;\nTo the Star Lord of the Willow Mansion, the Celestial Kitchen;\nTo the Star Lord of the Star Mansion, the Celestial Treasury;\nTo the Star Lord of the Spread Mansion, the Celestial Balance;\nTo the Star Lord of the Wings Mansion, the Celestial Capital;\nTo the Star Lord of the Axletree Mansion, the Celestial Stair.\n\nTo the Star Lord of the Balance Mansion, the Celestial Balance;\nTo the Star Lord of the Sea Monster Mansion, the Celestial Abyss;\nTo the Star Lord of the Archer Mansion, the Celestial Bow;\nTo the Star Lord of the Scorpion Mansion, the Celestial Sting;\nTo the Star Lord of the Water Carrier Mansion, the Celestial Vessel;\nTo the Star Lord of the Fishes Mansion, the Celestial Pair;\nTo the Star Lord of the Ram Mansion, the Celestial Horn;\nTo the Star Lord of the Bull Mansion, the Celestial Plow;\nTo the Star Lord of the Twin Mansion, the Celestial Union;\nTo the Star Lord of the Crab Mansion, the Celestial Shelter;\nTo the Star Lord of the Lion Mansion, the Celestial Roar;\nTo the Star Lord of the Maiden Mansion, the Celestial Hand.\n\nTo the Star Lord of the Native Constellation of Birth, the Origin of Destiny;\nTo the Star Lord of Fortune, the Celestial Virtue;\nTo the Star Lord of Prosperity, the Celestial Protection;\nTo the Star Lord of Longevity, the Old Man Star;\nTo the Star Lords of the Flowing Years and Transiting Limits;\nTo the Arrayed Luminaries within the Purple Tenuity Enclosure;\nTo the Arrayed Luminaries within the Supreme Subtlety Enclosure;\nTo the Arrayed Luminaries within the Celestial Market Enclosure;\nTo the Star Lords of the Sixty Celestial Stems of the Jiang, Huai, Yellow, and Han Rivers.\n\nWith reverence, we kneel and bow our heads, prostrating ourselves in repentance.\nWe, the assembly of disciples, wholeheartedly submit our bodies, surrender our spirits, and yield our lives to the august and transcendent sagely Star Lords of the arrayed constellations, the native constellation of destiny, and the true lords who illuminate our lives.\n\nWe humbly beseech your great compassion to bestow vast blessings and universally descend your boundless grace.\nWe have heard that the radiant arrayed sages pay homage to the North Pole’s majesty;\nThe resplendent Seven Stars silently govern the transformations of the central heavens.\nThey respond to all prayers, refusing none.\n\nToday, we repent for so-and-so, from the beginningless past to the present life.\nWhether through body, speech, or mind, we have acted in discord, amassing the three karmic deeds.\nWhether through greed, wrath, or delusion, we have indulged the six emotions.\nWe have committed killing, stealing, sexual misconduct, and lewd speech, falsehoods.\nWe have exposed ourselves beneath the Three Luminaries;\nWe have offended the assembled sages.\nWe have harmed sentient beings, discarded the Five Grains,\nAccumulated the ten heavy obstructions, deepened the three poisonous karmas,\nActed willfully without shame or remorse.\nWhether through seeing or hearing, we have acted on our own;\nWhether through thoughts or intentions, we have instructed others.\nFor these manifold roots of sin, we repent each one.\n\nWe pray that the true stars, perceiving through the Dipper’s pole,\nMay extend their compassionate primordial net,\nPouring forth the boundless rain of grace,\nThe vast and overflowing blessings.\nPity our ignorance, forgive our transgressions.\nTurn the revolving limits toward peace,\nAlign the stars with their proper paths.\nThrough the power of this repentance,\nWe rely upon and receive your mysterious merit,\nBestowing upon all beings the return to the true Dao.\n\nWith single-minded devotion, we bow our heads and give thanks to the supreme, most true Three Treasures.\nWe have heard that the azure heavens, in their unitary motion, manifest the myriad luminaries;\nThe most mysterious Dao bestows the Five Fortunes to benefit all beings.\nWe have now completed the reverent offering of this precious repentance.\n\nWe pray that the myriad heavens may perceive and widely bestow their universal grace;\nThat the arrayed luminaries may descend in their lofty presence, granting great merciful blessings.\nMay the thousand transgressions and ten thousand errors all be swept away;\nMay the three karmic deeds and six senses all receive forgiveness.\nMay fortune enrich the ten thousand beings,\nMay grace extend to the ten directions.\nWe bow our heads and take refuge in the boundless Great Dao.\n\nWith wholehearted devotion, we invoke the name of the Heavenly Worthy who eliminates transgressions and eradicates sins.\nThe Precious Repentance to the True Star of the Central Purple Tenuity is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "中天紫微星真宝忏 经名：中天紫微星真宝忏。 一卷。 底本出处：《万历续道藏》。 中天紫微星真宝忏 伏以乾坤大德，广覆载於群生； 日月光明，普照临於万汇。 凡伸恳祷，仰冀鉴观。 臣谨运真香，虔诚奏启，供养虚皇大道三境至尊，中天星主北极紫微大帝，斗父龙汉祖劫周御国王天尊，斗母摩利支天大圣，高上玉皇尊帝星君，北极玄卿大帝，日宫太阳帝君，月府太阴星君，五方五德星君，四炁四曜星君，天罡大圣星君，三台华盖星君，二十八宿星君，十二宫辰星君，当生本命星君，上清福禄寿三老星君，流年运限照临星君，三垣内外星君，周天列曜河汉星君，三界十方，千真万圣。 恭望洪慈，鉴今忏悔。 臣闻：太极生两仪而垂象，默运化钧； 高穹布列宿以昭明，分辉大地。 周天三百六十五四分之余度，微数万一千五百二十之隐名。 见迟流，伏逆於星躔，循经纬，周旋於分野。 恭惟星主紫微大帝，玉陛森严，瑶天高邈，权舆造化，掌握枢机。 端居总理於三天，统治运行於九道。 七政四炁，施正令於春夏秋冬； 五斗众星，镇方维於乾坤离坎。 本命元辰朗曜，福禄寿老光明。 罡星环指於太空，宿曜照临於大地。 不言善应，有感必通。 天无私亲，常亲辅於有德； 人所禀命，盖命属於上穹。 臣等皈依，恭修宝忏，望皇灵而稽首，仰斗极以倾心。 以今奉为某自从无始，乃至有生。 纵一念以冥行，六根缠结； 恣三业而罔觉，十恶积增。 若不忏陈，曷叨恩宥。 是以列款上陈，皈命朝礼，仰望紫微，至圣璇玑，列真介景，福以均沾，降慈光而普照。 荡除三业，清净六根，俾五福以茂隆，冀千祥而骈集。 臣等瞻天望圣，激切屏营之至，志心朝礼。 人各恭敬　　志心朝礼， 高上玉皇尊星大帝， 紫微中宫星主北极大帝， 紫微上宫南极天皇上帝， 斗父龙汉祖劫周御国王天尊， 斗母紫光金尊圣德巨光天后， 日宫炎光太阳帝君， 月府素曜太阴皇君， 东方木德岁星星君， 南方火德荧星君， 西方金德木白星君， 北方水德伺晨星君， 中央土德镇星星君， 交杴神首罗喉星君， 交中神尾计都星君， 天乙华阳紫炁星君， 太乙华阴月孛星君。 北斗天枢阳明贪狼星君，北斗天璇阴精巨门星君，北斗天机真人禄存星君，北斗天权玄冥文曲星君，北斗天衡丹元廉贞星君，北斗闿阳北极武曲星君，北斗瑶光天关破军星君，北斗洞明左辅星君，北斗隐光右弼星君。 南斗天府司命星君，南斗天相司录星君，南斗天梁延寿星君，南斗天同益算星君，南斗天枢度厄星君，南斗天机上生星君。 东斗苍灵延生星君，东斗陵光护命星君，东斗开天大卫集福星君，东斗大明和阳保和星君，东斗尾极总监星君。 西斗白标星君，西斗高元星君，西斗皇灵星君，西斗巨威星君。 中斗赫灵度世星君，中斗斡化上圣星君，中斗冲和至德星君，天罡节度紫庭星君。 上台虚精开德星君，中台禄淳司空星君，下台曲生司禄星君。 角宿天门星君，亢宿天庭星君，氐宿天府星君，房宿天驷星君，心宿天王星君，尾宿天鸡星君，箕宿天津星君，斗宿天庙星君，牛宿天机星君，女宿天女星君，虚宿天卿星君，危宿天钱星君，室宿天廪星君，壁宿天市星君，奎宿天将星君，娄宿天狱星君，胃宿天仓星君，昴宿天目星君，毕宿天耳星君，觜宿天屏星君，参宿天水星君，井宿天井星君，鬼宿天匮星君，柳宿天厨星君，星宿天库星君，张宿天秤星君，翼宿天都星君，轸宿天阶星君。",
      "translated_text": "**The True Precious Repentance Ritual to the Star of the Central Heavenly Purple Tenuity**\n\n**Scripture Title:** *The True Precious Repentance Ritual to the Star of the Central Heavenly Purple Tenuity*\n**Volume:** One\n**Source Text:** *Wanli Continuation of the Daoist Canon*\n\n---\n\n**The True Precious Repentance Ritual to the Star of the Central Heavenly Purple Tenuity**\n\nWe prostrate ourselves before the great virtue of Heaven and Earth, which broadly sustains and nurtures all living beings; before the radiant light of the Sun and Moon, which universally illumines the ten thousand phenomena. In all earnest supplication, we humbly beseech your divine observation.\n\nYour servant now kindles true incense, offering sincere devotion and reverent invocation, making offerings to the Supreme Void Sovereign of the Three Realms of the Great Dao, the Star Lord of the Central Heaven—the August Emperor of the Northern Culmen and Purple Tenuity; the Celestial King of the Zhou Dynasty of the Dragon Han Primordial Kalpa, Father of the Dipper; the Great Sage Mahādevī, Mother of the Dipper; the August Star Lord of the Most High Jade Emperor; the Great Emperor of the Northern Culmen and Mysterious Minister; the Imperial Lord of the Sun Palace; the Star Lord of the Moon Mansion; the Star Lords of the Five Directions and Five Virtues; the Star Lords of the Four Qi and Four Luminaries; the Great Sage Star Lord of the Celestial Stem; the Star Lords of the Three Terraces and Canopy; the Star Lords of the Twenty-Eight Constellations; the Star Lords of the Twelve Palaces and Celestial Branches; the Star Lord of one’s natal destiny; the Three Elder Star Lords of Supreme Clarity—Fortune, Prosperity, and Longevity; the Star Lords presiding over the year’s fate and karmic influences; the Star Lords within and beyond the Three Enclosures; the Star Lords of the revolving heavens, the Milky Way, and all celestial luminaries; and the myriad perfected sages of the Three Realms and Ten Directions.\n\nWe reverently implore your vast compassion to witness this act of repentance.\n\nWe have heard: The Supreme Ultimate gave birth to the Two Modes, from which celestial images descended, silently governing the transformations of the cosmos. The lofty firmament arrayed the constellations to radiate brilliance, dividing their splendor across the earth. The heavens revolve through three hundred sixty-five and a quarter degrees, with subtle calculations numbering seventeen thousand five hundred and twenty hidden names. Their movements—whether slow or swift, direct or retrograde—follow the celestial paths, circling through the divisions of the earth.\n\nWe reverently consider the Star Lord, the August Emperor of Purple Tenuity: his jade steps are majestic, his jasper heavens lofty and remote. He presides over creation, holding the pivot of cosmic mechanisms. Seated in authority, he governs the Three Heavens; in his rule, he directs the movements of the Nine Paths. The Seven Governors and Four Qi issue their decrees through spring, summer, autumn, and winter; the Five Dippers and host of stars guard the directions and trigrams of Qian, Kun, Li, and Kan. The natal star of one’s destiny shines brightly; the Three Elders of Fortune, Prosperity, and Longevity radiate luminosity. The Celestial Stem encircles the firmament; the lunar lodges and luminaries illumine the earth. Though silent, their responses are unfailing—where there is resonance, there is communication. Heaven is impartial, yet ever aids those of virtue; the lives of humans are endowed by the firmament above.\n\nWe, your servants, take refuge and reverently perform this precious repentance, bowing our heads to the august numen, gazing toward the Dipper’s pole with devoted hearts.\n\nToday, we offer this on behalf of [Name], from the beginningless past to the present life. Driven by a single deluded thought, the six senses have become entangled; indulging in the three karmic actions without awareness, the ten evils have accumulated. Without repentance and confession, how could we presume upon your grace and forgiveness? Thus, we present these articles in reverent submission, taking refuge and paying homage. We gaze upward to the Purple Tenuity, the sagely pivot of the celestial sphere, and to the host of perfected beings. May blessings be universally bestowed, and compassionate light descend to universally illumine. May the three karmic actions be purified, the six senses cleansed, the five fortunes flourish abundantly, and a thousand auspicious signs converge in harmony.\n\nWe, your servants, look to heaven and long for the sagely presence, our hearts filled with earnest devotion. With utmost sincerity, we bow in reverence.\n\n**Each person reverently and sincerely bows in homage:**\n\nWith a devoted heart, we bow to the August Star Lord of the Most High Jade Emperor;\nTo the Star Lord of the Central Palace of Purple Tenuity, the August Emperor of the Northern Culmen;\nTo the Heavenly August Emperor of the Southern Culmen of the Upper Palace of Purple Tenuity;\nTo the Celestial King of the Zhou Dynasty of the Dragon Han Primordial Kalpa, Father of the Dipper;\nTo the Heavenly Empress of Radiant Purple Light, the Golden August Sage of Sacred Virtue and Vast Illumination, Mother of the Dipper;\nTo the Imperial Lord of the Fiery Brilliance of the Sun Palace;\nTo the August Lord of the Pale Radiance of the Moon Mansion;\nTo the Star Lord of the Wooden Virtue of the East, the Year Star;\nTo the Star Lord of the Fiery Virtue of the South, the Sparkling Deluder;\nTo the Star Lord of the Metallic Virtue of the West, the White Star of Jupiter;\nTo the Star Lord of the Watery Virtue of the North, the Watcher of Dawn;\nTo the Star Lord of the Earthen Virtue of the Center, the Quelling Star;\nTo the Star Lord of the Ascending Node, Rāhu;\nTo the Star Lord of the Descending Node, Ketu;\nTo the Star Lord of the Purple Qi of Hua Yang, the Celestial One;\nTo the Star Lord of the Lunar Comet of Hua Yin, the Moon Mansion.\n\nTo the Star Lord of the Celestial Pivot of the Northern Dipper, the Yang Brightness and Greedy Wolf;\nTo the Star Lord of the Celestial Rotation of the Northern Dipper, the Yin Essence and Mighty Gate;\nTo the Star Lord of the Celestial Mechanism of the Northern Dipper, the True Person and Wealth Preserver;\nTo the Star Lord of the Celestial Balance of the Northern Dipper, the Mysterious Darkness and Literary Brilliance;\nTo the Star Lord of the Celestial Beam of the Northern Dipper, the Cinnabar Prime and Upright Chastity;\nTo the Star Lord of the Opening Yang of the Northern Dipper, the Northern Culmen and Martial Brilliance;\nTo the Star Lord of the Jade Radiance of the Northern Dipper, the Celestial Pass and Breaking Army;\nTo the Star Lord of the Penetrating Brilliance of the Northern Dipper, the Left Auxiliary;\nTo the Star Lord of the Hidden Brilliance of the Northern Dipper, the Right Assistant.\n\nTo the Star Lord of the Celestial Mansion of the Southern Dipper, Controller of Destiny;\nTo the Star Lord of the Celestial Minister of the Southern Dipper, Recorder of Deeds;\nTo the Star Lord of the Celestial Beam of the Southern Dipper, Prolonger of Life;\nTo the Star Lord of the Celestial Union of the Southern Dipper, Increaser of Years;\nTo the Star Lord of the Celestial Pivot of the Southern Dipper, Dispeller of Calamity;\nTo the Star Lord of the Celestial Mechanism of the Southern Dipper, Bestower of Life.\n\nTo the Star Lord of the Eastern Dipper, the Azure Spirit and Prolonger of Life;\nTo the Star Lord of the Eastern Dipper, the Ascending Brilliance and Guardian of Destiny;\nTo the Star Lord of the Eastern Dipper, the Opener of Heaven and Great Protector, Assembler of Blessings;\nTo the Star Lord of the Eastern Dipper, the Great Brilliance and Harmonizer of Yang, Preserver of Harmony;\nTo the Star Lord of the Eastern Dipper, the Ultimate Tail and Supreme Overseer.\n\nTo the Star Lord of the Western Dipper, the White Standard;\nTo the Star Lord of the Western Dipper, the Lofty Prime;\nTo the Star Lord of the Western Dipper, the August Spirit;\nTo the Star Lord of the Western Dipper, the Mighty Authority.\n\nTo the Star Lord of the Central Dipper, the Radiant Spirit and Dispeller of Mortality;\nTo the Star Lord of the Central Dipper, the Revolving Transformer and Supreme Sage;\nTo the Star Lord of the Central Dipper, the Balanced Harmony and Perfect Virtue;\nTo the Star Lord of the Celestial Stem, the Regulator of the Purple Court.\n\nTo the Star Lord of the Upper Terrace, the Void Essence and Opener of Virtue;\nTo the Star Lord of the Middle Terrace, the Prosperous Purity and Controller of Emptiness;\nTo the Star Lord of the Lower Terrace, the Crooked Life and Controller of Prosperity.\n\nTo the Star Lord of the Horn Mansion, the Celestial Gate;\nTo the Star Lord of the Neck Mansion, the Celestial Court;\nTo the Star Lord of the Root Mansion, the Celestial Storehouse;\nTo the Star Lord of the Chamber Mansion, the Celestial Chariot;\nTo the Star Lord of the Heart Mansion, the Celestial King;\nTo the Star Lord of the Tail Mansion, the Celestial Rooster;\nTo the Star Lord of the Winnowing Basket Mansion, the Celestial Ford;\nTo the Star Lord of the Dipper Mansion, the Celestial Temple;\nTo the Star Lord of the Ox Mansion, the Celestial Mechanism;\nTo the Star Lord of the Maiden Mansion, the Celestial Maiden;\nTo the Star Lord of the Emptiness Mansion, the Celestial Minister;\nTo the Star Lord of the Rooftop Mansion, the Celestial Coin;\nTo the Star Lord of the Encampment Mansion, the Celestial Granary;\nTo the Star Lord of the Wall Mansion, the Celestial Market;\nTo the Star Lord of the Straddler Mansion, the Celestial General;\nTo the Star Lord of the Bond Mansion, the Celestial Prison;\nTo the Star Lord of the Stomach Mansion, the Celestial Granary;\nTo the Star Lord of the Pleiades Mansion, the Celestial Eye;\nTo the Star Lord of the Net Mansion, the Celestial Ear;\nTo the Star Lord of the Turtle Beak Mansion, the Celestial Screen;\nTo the Star Lord of the Three Stars Mansion, the Celestial Water;\nTo the Star Lord of the Well Mansion, the Celestial Well;\nTo the Star Lord of the Ghost Mansion, the Celestial Coffer;\nTo the Star Lord of the Willow Mansion, the Celestial Kitchen;\nTo the Star Lord of the Star Mansion, the Celestial Treasury;\nTo the Star Lord of the Spread Mansion, the Celestial Balance;\nTo the Star Lord of the Wings Mansion, the Celestial Capital;\nTo the Star Lord of the Axletree Mansion, the Celestial Stair.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1371,
      "start_sentence": 0,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.91741585731506,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\中天紫微星真宝忏.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天秤官辰星君，天竭宫辰星君，人马宫辰星君，磨蜴宫辰星君，宝瓶宫辰星君，双鱼宫辰星君，白羊宫辰星君，金牛宫辰星君，阴阳宫辰星君，巨蟹宫辰星君，狮子宫辰星君，双女官辰星君。 当生本命元辰星君，福星天德星君，禄星天佑星君，寿星老人星君，流年运限照临星君，紫微垣内列曜星君，太微垣内列曜星君，天市垣内列曜星君，六十甲子江淮河汉星君。 礼足　各长跪　皈命忏悔 臣法众等，志心皈身，皈神皈命，玄穹上圣，列宿星君，本命元辰，照临真宰。 恭望大慈，洞垂巨泽，普降洪恩。 臣闻：煌煌列圣，朝拱北极之尊； 灿灿七星，默运中天之化。 有求必应，无祷不从。 以今忏悔某自从无始，以至有生。 或身口意之相违，广营三业。 或贪嗔痴之未所，放纵六情。 杀盗邪淫，绮#1言妄语。 或裸露三光之下。 或触突众圣之前。 损害众生，抛掷五谷，十恶障重，三毒业深，任性所为，不知惭愧。 或见闻而自作或想念以教他。 种种罪根，一一忏悔。 伏愿星真，洞鉴斗极，垂慈元纲，流汗漫之恩法雨沛，汪洋之泽，矜怜愚昧，原宥愆尤。 斡运限以和平，顺星辰於躔度，承斯忏力，仰荷玄功，嘉与群生，咸归正道。 志一心稽首，礼谢无上至真三宝。 伏闻：彼苍者，天运一元而彰众曜； 至玄者，道锡五福以惠群生。 臣等向来拜礼宝忏已在云周。 伏愿诸天洞鉴，广施普博之恩； 列曜高临，大赐慈悲之泽。 千愆万过，咸乞荡除。 三业六根，悉蒙原赦。 福资万有，恩被十方，稽首皈依，无极大道。 志心称念，消愆灭罪天尊。 中天紫微星真宝忏竟 #1此字原缺，疑为『绮』。",
      "translated_text": "To the Star Lord of the Balance Mansion, the Celestial Balance;\nTo the Star Lord of the Sea Monster Mansion, the Celestial Abyss;\nTo the Star Lord of the Archer Mansion, the Celestial Bow;\nTo the Star Lord of the Scorpion Mansion, the Celestial Sting;\nTo the Star Lord of the Water Carrier Mansion, the Celestial Vessel;\nTo the Star Lord of the Fishes Mansion, the Celestial Pair;\nTo the Star Lord of the Ram Mansion, the Celestial Horn;\nTo the Star Lord of the Bull Mansion, the Celestial Plow;\nTo the Star Lord of the Twin Mansion, the Celestial Union;\nTo the Star Lord of the Crab Mansion, the Celestial Shelter;\nTo the Star Lord of the Lion Mansion, the Celestial Roar;\nTo the Star Lord of the Maiden Mansion, the Celestial Hand.\n\nTo the Star Lord of the Native Constellation of Birth, the Origin of Destiny;\nTo the Star Lord of Fortune, the Celestial Virtue;\nTo the Star Lord of Prosperity, the Celestial Protection;\nTo the Star Lord of Longevity, the Old Man Star;\nTo the Star Lords of the Flowing Years and Transiting Limits;\nTo the Arrayed Luminaries within the Purple Tenuity Enclosure;\nTo the Arrayed Luminaries within the Supreme Subtlety Enclosure;\nTo the Arrayed Luminaries within the Celestial Market Enclosure;\nTo the Star Lords of the Sixty Celestial Stems of the Jiang, Huai, Yellow, and Han Rivers.\n\nWith reverence, we kneel and bow our heads, prostrating ourselves in repentance.\nWe, the assembly of disciples, wholeheartedly submit our bodies, surrender our spirits, and yield our lives to the august and transcendent sagely Star Lords of the arrayed constellations, the native constellation of destiny, and the true lords who illuminate our lives.\n\nWe humbly beseech your great compassion to bestow vast blessings and universally descend your boundless grace.\nWe have heard that the radiant arrayed sages pay homage to the North Pole’s majesty;\nThe resplendent Seven Stars silently govern the transformations of the central heavens.\nThey respond to all prayers, refusing none.\n\nToday, we repent for so-and-so, from the beginningless past to the present life.\nWhether through body, speech, or mind, we have acted in discord, amassing the three karmic deeds.\nWhether through greed, wrath, or delusion, we have indulged the six emotions.\nWe have committed killing, stealing, sexual misconduct, and lewd speech, falsehoods.\nWe have exposed ourselves beneath the Three Luminaries;\nWe have offended the assembled sages.\nWe have harmed sentient beings, discarded the Five Grains,\nAccumulated the ten heavy obstructions, deepened the three poisonous karmas,\nActed willfully without shame or remorse.\nWhether through seeing or hearing, we have acted on our own;\nWhether through thoughts or intentions, we have instructed others.\nFor these manifold roots of sin, we repent each one.\n\nWe pray that the true stars, perceiving through the Dipper’s pole,\nMay extend their compassionate primordial net,\nPouring forth the boundless rain of grace,\nThe vast and overflowing blessings.\nPity our ignorance, forgive our transgressions.\nTurn the revolving limits toward peace,\nAlign the stars with their proper paths.\nThrough the power of this repentance,\nWe rely upon and receive your mysterious merit,\nBestowing upon all beings the return to the true Dao.\n\nWith single-minded devotion, we bow our heads and give thanks to the supreme, most true Three Treasures.\nWe have heard that the azure heavens, in their unitary motion, manifest the myriad luminaries;\nThe most mysterious Dao bestows the Five Fortunes to benefit all beings.\nWe have now completed the reverent offering of this precious repentance.\n\nWe pray that the myriad heavens may perceive and widely bestow their universal grace;\nThat the arrayed luminaries may descend in their lofty presence, granting great merciful blessings.\nMay the thousand transgressions and ten thousand errors all be swept away;\nMay the three karmic deeds and six senses all receive forgiveness.\nMay fortune enrich the ten thousand beings,\nMay grace extend to the ten directions.\nWe bow our heads and take refuge in the boundless Great Dao.\n\nWith wholehearted devotion, we invoke the name of the Heavenly Worthy who eliminates transgressions and eradicates sins.\nThe Precious Repentance to the True Star of the Central Purple Tenuity is now complete.",
      "overlap_context": "n;\nTo the Star Lord of the Three Stars Mansion, the Celestial Water;\nTo the Star Lord of the Well Mansion, the Celestial Well;\nTo the Star Lord of the Ghost Mansion, the Celestial Coffer;\nTo the Star Lord of the Willow Mansion, the Celestial Kitchen;\nTo the Star Lord of the Star Mansion, the Celestial Treasury;\nTo the Star Lord of the Spread Mansion, the Celestial Balance;\nTo the Star Lord of the Wings Mansion, the Celestial Capital;\nTo the Star Lord of the Axletree Mansion, the Celestial Stair.",
      "start_char": 1372,
      "end_char": 2003,
      "start_sentence": 55,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.964345455169678,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\中天紫微星真宝忏.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}