{
  "source_id": "丹房须知",
  "source_file": "chunked_daozang\\丹房须知.json",
  "total_chunks": 6,
  "total_original_chars": 4744,
  "total_translated_chars": 27148,
  "total_translation_time": 145.0764775276184,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\丹房须知.txt",
    "category": "众术类"
  },
  "full_translation": "**Essentials for the Alchemical Chamber**\n\n*Title:* *Essentials for the Alchemical Chamber*\n*Author:* Wu Hou of Southern Song, the Recluse of Gaogai Mountain (Ziranzi)\n*Volume:* One\n*Source of Base Text:* *Daoist Canon of the Zhengtong Era*, \"Category of Miscellaneous Arts\" under the *Dongshen* Section\n\n**Essentials for the Alchemical Chamber**\nRecorded by Wu Hou, the Recluse of Gaogai Mountain (Ziranzi)\n\nI have long encountered the Dao of immortals, and though daily cultivation and accumulated merit are essential, none surpass the reliance on the Great Elixir. From ancient times to the present, those who attained the Dao number no fewer than ten thousand. Some, through merit and conduct in this life, encountered perfected beings and received the divine elixir directly. Others, by virtuous causes from past lives, met true instructions, personally cultivated and refined them, and left behind texts to enlighten later generations. These teachings are not bound by mere words but reside in principle, expounded repeatedly and exhaustively. Those who encounter them do so not by chance.\n\nWhen one meets a perfected being, the transmission cannot be withheld. Yet if the recipient is unworthy, the transmission must not be recklessly given. Once the scriptures and instructions exist, all may potentially attain them, regardless of wisdom or folly. Only the perfected—whose conduct aligns with the immortals—upon seeing sacred texts, naturally grasp their principles, like Pao Ding dissecting an ox or Jiu Fang Gao judging a horse: the Dao is present at a glance. This is what is meant by \"cannot but transmit.\"\n\nAs for the unworthy, whose conduct contradicts principle, who fail to comprehend sacred texts and cling to their own views—such are those of whom Laozi spoke: \"If it could be offered, none would fail to offer it to their lord; if it could be presented, none would fail to present it to their kin; if it could be transmitted, none would fail to transmit it to their descendants.\" Even if one wished to transmit it, how could it be done?\n\nFrom youth, I admired the alchemical tortoise, seeking teachers far and wide. Many pointed to spurious texts forged by the Fang lineage since the Qin and Han, leading the blind with blindness, resulting in no small loss. Later in life, I met Master Huainan Wang, who bestowed upon me the *Scripture of Gold and Azure*. Thereafter, I visited famous mountains, witnessed numinous traces firsthand, and verified them against the sages without contradiction, finding them in perfect accord with the Great Dao without doubt.\n\nThus, I compiled the essentials of various schools to serve as a guiding principle—truly profound, clear, and illuminating. Yet fearing that scholars might still not awaken, I further arranged teachings on true lead and true mercury, the Flowery Pond and ablutions, the symbolism of the crucible and furnace, and the sequence of firing times. Wherever the schools differed in their explanations, I traced the underlying principles, and they aligned like tallying tokens. These are called *Essentials*, all derived from the transmissions of the ancients, never mere conjecture.\n\nMay all fellow aspirants find insight upon opening this scroll.\n\nWritten on the Day of the Middle Prime of the *guiwei* year of the Longxing era.\n*Selecting Companions*\n\n*The Record of the Three Alignments* states: Those who cultivate and refine the elixir must first comprehend celestial patterns above and terrestrial principles below, master yin and yang, exhaust the imagery of the hexagrams, and grasp the waxing and waning of seasonal qi, the ascent and descent of hours, the advance and retreat of firing times, and the methods of the crucible and furnace. Only then may they enter the gate of the dragon-tiger symbolic system, recognize the true Way of lead and mercury, and—while inwardly illuminating virtue and outwardly extending benevolence—unite their hearts with the elixir to naturally attain the true realm. Thus, the safeguarding of the returned elixir cannot be grasped in a single morning or evening.\n\nFor elixir refinement, three practitioners of pure emptiness must join in shared aspiration and vow, their sole hope the completion of the elixir. Before commencing, they must first purify themselves through fasting and offer libations to the vault of heaven. One attends to the crucible and furnace, adjusting water and fire. Another regulates yin and yang, altering the hexagrams of creation and transformation, advancing or retreating water and fire in accordance with the seasonal nodes. Each of the three duties must be performed without the slightest error.\n\nMaster Ye states: At midnight, all three must guard the work with reverent prayers. Though each has their assigned task, they must take turns in urgent moments, alternating rest during the night. For the firing process continues day and night without pause, and the hours stretch long like the sun and moon. Should the cultivators grow weary over time, the refinement may be compromised.\n\n**2. Selecting the Site**\n*The Record of the Three Alignments* states: Before commencing refinement, one must first select a site. Choose only land of blessed virtue, where the years and months are auspicious and the ground is pure. Sites such as ancient tombs, temple foundations, abandoned wells, ruined kilns, battlefields, or places defiled by childbirth or impurity must not be used. As Lord Yin of the Dark says: \"Without the proper site, the work cannot proceed.\"\n\n**3. The Elixir Chamber**\n*The Fire Dragon Classic* states: Select the direction of annual vigor. As Sima Ziwei notes: The chamber for elixir refinement should face the direction of the year’s vigor. Choose a quiet room—neither too large nor excessively high. It should be lofty yet not drafty, bright yet not leaky, situated high but sheltered from lowly disturbances. No sounds of roosters, dogs, weeping, flowing water, galloping horses, or places of punishment and execution should reach it. Only mountain forests, Daoist abbeys, or secluded chambers are suitable.\n\n**4. Prohibiting Impurity**\nMaster Qingxia states: The chamber should face east, and no women, Buddhist monks or nuns, chickens, or dogs may enter. Let incense smoke rise without cease. Before entering, one must don fresh clothing and shoes and avoid consuming onions, garlic, or similar foods.\n*The Record of the Three Alignments* states: Within the elixir chamber, incense must never be extinguished. Petition the Perfected Above with offerings of vegetarian fare, maintaining utmost purity and discipline.\n\n**5. The Elixir Well**\n*The Record of the Three Alignments* states: Once the elixir site is secured, seek the elixir well. The well is essential to elixir refinement, for day and night, water and fire are adjusted through it. Since ancient times, immortals who ascended left behind elixir wells to signify their urgency in refinement. Once the well is dug, prevent all impurity. After the water vein stabilizes, purge stagnant sediment, then expose it to the open sky so that starlight and moonlight may illuminate it. Only when the water settles and the earth’s color is reabsorbed may it be drawn. If the water is clear, white, and sweet-tasting, sourced from a yang vein, it is most efficacious for elixir circulation. If the water is turbid with black mud, yellow earth, or red veins, or if it tastes metallic, astringent, or fishy, these indicate mingled water veins, yin-yang stagnation, and unsuitability for refinement.\n*The Fire Dragon Classic* states: Use only fresh water. As Immortal Ge notes: Draw spring water for preparation, never mixing it with other sources. If a clear mountain spring is nearby, sweet water is unnecessary, but it must not be shared with others.\n\n**6. Selecting Earth**\n*The Fire Dragon Classic* states: Immortal Ge says: The vessels for refinement, the earth for altars and furnaces, must all be pure. As Master Sima notes: The earth for the divine chamber cannot be ordinary soil. Seek it in places untrodden by human feet, within mountain caves or rock crevices. Taste it—if not salty or bitter, and if it is yellow, firm, and unlike common soil, it may be used.\n\n**7. Preparing Charcoal**\n*The Fire Dragon Classic* states: Immortal Ge says: Burn hardwood in a clean kiln to make charcoal. Pound it ten thousand times with a pestle, mix with glutinous rice, and form into balls the size of chicken eggs. Dry them in the sun, then preheat in a fierce furnace until glowing red. Weigh them precisely and feed the fire gradually. If one ounce is required per phase, ensure a constant supply day and night. Adjust the quantity as needed.\n\n**8. Adding Water**\n*The Fire Dragon Classic* states: As Master Sima notes: Boil water in new earthenware pots or iron cauldrons, maintaining a temperature akin to the human body. Add it gradually, never cold. As Huang’s *Golden and Azure Classic* states: Do not let the fire grow excessive; maintain proper weight. If the upper water crucible becomes too hot, keep it only warm, never boiling, lest errors arise.\n\n**9. Blending Incense**\nMaster Qingxia states: Combine half a catty of *jiangzhen* incense, five taels of *danshen*, four taels of *suhe* incense, four taels of old wutong root, four taels of white sandalwood, half a catty of *chen* incense, and a small amount of *baijiao* incense. Mix with honey and form into balls the size of marbles. Burn one ball each day.\n\n**10. The Altar Design**\n*The Record of the Three Alignments* states: Beneath the furnace lies an altar, three tiers high, each divided into eight sides with eight gates.\n*Like the Clouds Master* states: One foot south of the altar, bury one catty of raw cinnabar mixed with five inches of silk and vinegar. To the north, bury one catty of lime; to the east, one catty of raw iron; to the west, one catty of silver. Three feet above the medicine crucible, hang an ancient mirror. Before the twenty-eight lunar mansions and five planets, place a pure sword.\n\nBefore the furnace, place a basin of unused well water, replenishing it every seven days. Use a peachwood board, upon which rests an incense burner, positioned in each direction. Day and night, replenish until the fourth cycle, at which point the elixir will commune with the divine spirits. Should demons attempt to intrude, steadfastly guard the heart and recite the following prayer:\n\n*\"With reverence, we invoke the Primordial August Emperor and the Most High Lord Lao: may the workings of Heaven and Earth align, and all demons be kept at bay. Should they touch our sacred medicine, let the Lord of Heaven repel them. To the east, buried iron; to the south, raging fire; to the west, hidden men; to the north, standing Hu barbarians; above, a hanging mirror—all arrayed in accord with the Five Phases. May ghosts and spirits be powerless, the land at peace, and true immortals protect me. May the Dao remain steadfast and pure. Swiftly, swiftly, as decreed by law!\"*\n\n**Thirteen Methods for Gathering Lead**\n*The Fire Dragon Classic* states: The *Zhouyu* has a white beard; the Primordial Lord, silver hair. Untouched by common fire, they are celestial treasures, rarely seen in full. Seek them in pure marshlands—these are the two methods.\n\nThe *Zhouyu* is the White Tiger, its white beard naturally grown. The Primordial Lord is black stone, embraced by silver essence, resembling a beard or hair—called the Old Man’s Whiskers. Unmarred by fire, it is celestial silver. If unavoidable, use pure marshland ore untainted by earth, cast it into the great sea, and gather eight taels.\n\nExplanation: For every fifty taels of silver, refine and extract ten taels of essence for the Golden Flower’s use in a single day. In a crescent moon furnace, stir with a thousand wheels until the surface boils clear. Add two taels of White Tiger, and after a moment, a substance like mica, golden and dazzling, will appear. Scoop it with an iron ladle. When exhausted, add another two taels, repeating until ten taels yield eight taels of essence. This is called the Water Tiger, also known as the Yellow Sprout or Golden Flower.\n\nLord Lao said: *\"From red to black is true cultivation\"*—this is the third method.\n\n*The Record of the Three Alignments* states: When gathering the Yellow Sprout, one must choose a time when Metal flourishes, beginning at the White Dew. This refers to the roundness of Metal and the fullness of the Toad’s light—an auspicious moment for elixir refinement, which must occur in the eighth month.\n\nMaster Xu the Perfected said: *\"Nurture the child in winter, begin in the eighth month, and with nine crucibles, gather the Yellow Sprout. By the tenth month, all depends on the balance of Water and Fire, the harmony of Yin and Yang, to naturally produce the numinous sprout. If Water and Fire are unbalanced, the lead’s foundation will be stolen, corrupting the sprout, rendering it unusable. The qi must also be fully received; if insufficient, the elixir will not submit.\"*\n\n**Diagram for Drawing Forth Mercury**\nMaster Ge the Immortal states:\n\nThe Mercury-Flying Furnace is made of wood, serving as a platform four feet in height. Like the legs of a turtle, it stands over one foot tall to avoid earthly qi. The round crucible holds two *dou* and must not be removed from the fire. The eight-inch platform above the turtle-shaped base is fashioned according to the size of the crucible.\n\nThe *Fire Dragon Classic* states: *\"To fly mercury, place it beneath cinnabar; a small amount of white sand is also acceptable. If using hardwood fire, one day and night suffice—three nights are unnecessary.\"* Any cinnabar residue that fails to fully sublimate should be retained. Cinnabar from the Xi, Gui, or Chen regions, if luminous, may also be called true mercury.\n\nA note adds: *\"Seal the lid of the crucible tightly with mud to prevent leakage. Then, affix a black pipe to the lid, guiding water into a basin above, so that mercury does not escape.\"*\n\nThe *Record of the Uniting of Sameness* states: *\"The Reverted Elixir cannot form without a crucible.\"* Thus, the *Scripture of the Primordial Chaos* says: *\"Kan (Water) rises as the medicine; Qian (Heaven) and Kun (Earth) serve as the crucible. When the four embrace, it is called the Lofty Key.\"* Qian is Metal, and Kan is Earth. As Earth generates Metal, it is termed the Golden Crucible—not that the crucible itself is made of metal, but that it is the chamber of the elixir. When the crucible is fully prepared, the myriad things are born within it. The crucible symbolizes the Central Palace, and the Central Palace pertains to Earth, which generates the myriad things; thus, the crucible is made of Earth.\n\nMaster Yin the Perfected said: *\"One must seek the crucible in the Central Palace.\"* It is known that common clay is fired into a crucible, and for the inner chamber, *ji* (a binding agent) is also used. The length and width are determined at the time of crafting. If too wide, the qi of Water and Fire will not descend; if too narrow, the qi of Water and Fire will not circulate—adjust accordingly.\n\nOnce the crucible is obtained, a furnace must be prepared, for the furnace is the enclosure of the crucible. A crucible without a furnace is like a person without a dwelling or city walls—how can it be settled? Thus, the furnace secures the crucible and contains the fire’s qi.\n\nThe Sima clan records: *\"Master Ge the Immortal received the oral formula and prepared a clay-and-fire crucible. Using porcelain powder from Poyang as white clay, he blended it and pounded it ten thousand times in a mortar to shape the crucible like an egg, twelve inches high. A lid was fitted to hold the ingredients within, then sealed with proper methods. The crucible was lined with mud, and a sturdy earthen basin served as the base to hold the medicine. The crucible was then inserted three-tenths into the basin, and the furnace was separately prepared inside and out. Finally, it was sealed with method-mud and dried before placing the crucible atop.\"*\n\n**Medicinal Mud (Fourteen Ingredients):**\nYellow earth, clamshell powder, lime, red halloysite, and *shi ling*—six ingredients, each one *liang*, ground into powder and mixed with water for use, called Six-One Mud.\n\nA note adds: *\"If mixed with honey instead, it becomes even more tightly sealed and impervious to leakage.\"*\n\n**Uncrossed Furnace**\n**Crossed Furnace**\n\nAfter collating with the authentic original, it was found that only the Crossed Furnace and Cauldron were to be used—precisely what Wei Boyang referred to as *\"the steaming cauldron like a spirit.\"*\n\nMaster Qingxia said: *\"Once the furnace and lower cauldron are constructed according to the pattern, enclose the walls and kindle the fire. First, a furnace sacrifice must be performed: three *jin* of clear wine, twelve jars of dried venison, one incense burner, and twelve portions of seasonal fruit. After the sacrifice, recite the invocation:\n\n*'August Heaven above, Yellow Earth below,\nNurturing the myriad things to flourishing abundance.\nThe sacred pivot holds fast the essential axis,\nThe Emperor secures the cauldron, the Dark Maiden attends the furnace.\nHarmonizing yin and yang to refine the precious elixir,\nThe radiance of the Three and Five subdues all demonic forces.\nO Youth of the Upright Furnace, General of the Guarding Fire,\nSix Jia marshals the troops, Chiyou protects the truth.\nOn this day of such-and-such month, I, disciple So-and-so,\noffer this sincere libation.\nI humbly invoke the Perfected Ones of the Grotto Realms and the Immortals of the Grasses,\ngranting silent aid—do not treat this lightly.'*\n\nBow twice.\n\n**Nurturing for Fifteen Days**\nMaster Ge the Immortal said: *\"Before the supreme medicine is refined, the method of nurturing must first be applied—subtle and profound. The embryo of primordial qi must be nourished to flourishing divinity. If anything is impure, all is lost in an instant; immortality and mortality diverge in a moment. How can one not be cautious?*\n\n*Its method: use hard stone or jade to fashion a pestle and mortar. Grind the two substances, each eight* liang*, to restrain each other within the cauldron. Face east while grinding three thousand times, then gather the powder into a mass, calling it* 'Embryonic Radiance of the Primordial Beginning' *—revealing the form of Heaven and Earth before their emergence. Nurture it with supreme harmony to manifest the hidden workings of the divine.*\n\n*Then place it in an earthen cauldron with a lid, sealed with method-mud. Once the mud is dry, set it in an ash pit and nurture it with civil and martial fire for seven days. When removed, if it appears purple, the process is complete. If the color is insufficient, the firing has been flawed. Prepare another ash pit and nurture it with civil and martial fire for twenty-one days, never leaving it for even a moment. Thus, refining the elixir requires no fewer than three people for nurturing.*\n\n*Afterward, grind it again and place it in the cauldron. First, pack yellow earth firmly at the base, two* cun *and four* fen *thick, symbolizing the twenty-four qi. Set the two substances within and begin the firing.*\n\n**The Central Embryo (Sixteen)**\nMaster Qingxia said: *\"When the medicine lies in the cauldron, it is like a hen brooding an egg, a child in the womb, or fruit on a tree—once the qi is fully received, it ripens naturally. When the medicine enters the central embryo, utmost care must be taken to seal it tightly, lest the true qi leak away.\"*\n\n*It is also said: \"Seal the embryo without leakage, and transformation occurs in an instant.\" The central embryo’s construction is round like Heaven and Earth, rising like Penglai’s isle—closed and minutely sealed, with divine workings within.*\n\n*The* Scripture of the Golden and Azure *states: \"The furnace and cauldron take their form in solid enclosure, intricately restraining one another to ensure no mishap.\" Master Huang the Perfected commented: \"The furnace, cauldron, and divine chamber restrain lead and mercury layer upon layer. Thus, the furnace gathers fire-qi to restrain the embryo, the embryo gathers fire-qi to restrain lead, and lead, receiving fire-qi, restrains mercury. Each restrains the other in turn. Only when the vessel is round and sealed can safety be assured.\"*\n\n**Using Fire (Seventeen)**\nMaster Ruyunzi said: *\"When applying fire, take seven solid stones, burn them until glowing red, then quench them in vinegar and toss them into the medicine chamber. Then take seven branches each of peach and willow from the southeast, burn them in pure fire as incense, and sincerely pray to comfort the hundred spirits, saying:*\n\n*'Disciple So-and-so of the Great Dao humbly invokes the Primordial Emperor, the Most High Lord Lao. Now cultivating the supreme Way, I pray for the descent of the immortal banners and divine officials. May the local earth gods be at peace, inner demons unobstructed, and outer evils unassailing. May the great medicine swiftly form, granting eternal longevity.'*\n\n*Conclude the prayer. After quieting the space, begin the fire at midnight, the hour of* zi*, ensuring no women, chickens, or dogs witness it. At ignition, use five* liang *of charcoal, burn it until glowing red, place it in the furnace, and cover it with ash. Do not neglect this by dawn.*\n\n*The cauldron should resemble a chicken’s egg. The fire should be taken from sunlight; next, nanmu wood fire serves as the common fire, usable for nine years. No other fire may be used—this is called* 'Long Fire of Water and Fire.'*\n\n*A note adds: \"Fire begins at* wu *in the first month, water at* xu *in the first month, both moving in reverse through the six yang phases. The day of* chen *is the starting day for firing the elixir. Greatly avoid days of tidal birth, as well as* jia-xu*,* jia-wu*,* jia-chen*,* jia-yin*, and* jia-zi*.\"*\n\n**Bathing (Eighteen)**\nThe *Elixir Formula* states: *\"Mao and you are for bathing. All schools grind the medicine three thousand times in a mortar—this method is most subtle and wondrous, unattainable except by the perfected.\"*\n\n*An ancient song says:*\n*\"A maiden in blue-green robes,\nA gentleman in plain white silk.\nIf seen, it cannot be used;\nIf used, it cannot be seen.\"*\n\n*The* Cui Gong’s *Mirror of Entering the Medicine* says: *\"Grind the dragon to powder,\nLet the tiger inhale in balance.\"*\n\n*The* Record of the Threefold Concordance *states: \"The gates of* mao *and* you *at the second and eighth months are called the dead qi. The two and a half days before* mao *and after* you *are critical. Elixir masters greatly avoid introducing water or fire at these times.\"*\n\n*Thus it is said: \"This principle is profound and obscure, beyond mortal comprehension—truly divine and sacred. Without understanding this, how can one speak of refining the elixir?\"*\n\n**Fire Timing (Nineteen)**\nThe ancient method prescribes only ten months. Thus Master Qingxia said: *\"Never has it been heard that a human embryo gestates for three years before birth.\"* Some methods take three years, but the principle remains the same—only the application differs.\n\nThe weight of fire is not fixed, for vessels vary in size and medicines in quantity. The key lies in carefully assessing the principles of yin and yang at the time, without the slightest error.\n\nMaster Huang the Perfected, in his commentary on the *Scripture of the Golden and Azure*, most thoroughly revealed the true mechanism of fire timing. Fearing that later students might still treat it lightly, he left this poem:\n\n*\"Things, when unrecognized, are deemed worthless;\nWords of the profound and subtle are met with disdain.\"*\n\nLast night, I leaned on the railing and sighed long,\nFor whom does the autumn moon shine so brightly in vain?\nAlas! The sagely heart of benefiting and saving all is so profoundly efficacious.\nYet those of meager fortune abandon and harm themselves,\nTheir perverse views losing the true and upright.\nHow grievous! How lamentable!\n\n**Opening the Crucible (Twenty)**\nThe *Record of the Uniting of Sameness* states: From the tenth month, one begins, proceeding to the fourth month, which pertains to the yang crucible, rotating left.\nThe annotation says: The crescent, full, waning, and new moons are the four phases of the sun and moon.\nAt dawn, within the dark essence, the bright spirit is born and becomes light—this is the sun’s first quarter.\nAfter the first quarter, the spirit becomes the essence and the essence the function; within the spirit, another spirit arises, and the spirit grows—thus the sun reaches its fullness.\nAt fullness, within the bright spirit, the dark essence is born and becomes darkness—this is the sun’s last quarter.\nAfter the last quarter, the essence becomes the essence and the spirit the function; within the essence, another essence arises, and the essence grows—thus the moon reaches its darkness.\nWithin a single month, spirit and essence alternate and return, never deviating from their measure.\nThe Perfected Huang used the moon to determine the fire timing—this principle is thus made clear.\n\nThe *Record of the Uniting of Sameness* states: From the fifth to the tenth month, it pertains to the yin crucible, rotating right.\nWhen the elixir reaches its most trying moment, one must not for a moment abandon the chamber of medicine, but listen attentively to the dragon’s song.\nBeyond this number of extreme yang, the elixir is without peril.\nBy the tenth month, the sun is complete, yang returns to Kun, and the elixir is accomplished—its color transforms to purple-gold, its radiance resplendent.\nNine revolutions complete the yang; the Five Phases are fully realized.\n\nMaster Ruyunzi said: When opening the crucible, one must fast, bathe, and purify oneself, don the Daoist robe, wear the star crown, face south, kneel to hold the medicine furnace, burn incense to cleanse the body, and pray with utmost sincerity.\nInvoke the Heavenly Worthy of the Great Dao, the Most High Lord Lao, and all the Perfected Lords of the Ten Directions.\nThis humble disciple, so-and-so, having completed the elixir in the crucible, follows the law of Heaven and Earth.\nThe yin winds disperse, the sun’s brilliance blazes forth, the pure yang transforms the body, and the Dragon and Tiger sustain it.\nIt ascends to the Purple Palace, forever departing the red dust.\nWhen opening the crucible to retrieve the medicine, ensure no women, chickens, or dogs witness it.\nThat which flies white upon the crucible is the Purple-Gold Elixir; if red, it is the Dragon-Tiger Elixir.\nThat which encircles the four sides of the crucible is the Great Elixir.\nThe white, fish-scale-like flakes in the center are called the Divine Talisman White Snow.\n\n**Ingestion (Twenty-One)**\nMaster Ruyunzi said: Enclose it in a ball of yellow wax, place it in east-flowing water, and soak for twenty-one days to dispel the fire toxin.\nThen place it in a bamboo tube, wrap it in silk, and steam it within rice for one *fu* period to remove the water toxin.\nFinally, boil it into a decoction and form pills the size of sesame seeds.\nOffer them in sacrifice to the mountain.\n*(The original text is incomplete hereafter.)*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "丹房须知 经名：丹房须知。 南宋吴侯撰。 一卷。 底本出处：《正统道藏》洞神部众街类。 丹房须知 高盖山人自然子吴侯述 予尝遇神仙之道，虽日功行积累，莫不皆凭大丹。 古今得道者，奚啻万人。 或今生功行，感遇至人，亲授灵丹。 或前世善因，得遇真诀，躬自修炼，率留文字，启迪后人，不拘於文而寓於理，反覆晓谕，靡所不至。 若遇之者，亦岂偶然。 经遇至人，不得不传。 遇非其人，不得妄传矣。 既有经诀，则人皆可能，贤愚奚问。 惟至人者行与仙合，得见圣书，自达其理，如庖丁之解牛，九方皋之相马，目击而道存，所谓不得不传。 至於非人，行与理悖，未晓圣书，先执己见，如老子所谓可得而献，则人莫不献其君。 可得而进，则人莫不进其亲。 可得而传，则人莫不传其子孙。 虽欲传之，可得哉。 予幼慕丹鳌，）遍求师承，多指秦汉以来方氏伪成之书，以盲指盲，所丧不少。 及晚遇淮南王先生，授《金碧经》。 遂访名山，一历观灵迹，质诸圣人而不悖，合於大道而无疑。 因集诸家之要，以为指归，可谓深切着明矣。 犹虑学者未悟，复编进真铅真汞，华池沐浴，鼎炉法象，火候次序。 凡诸家互说不同者，推载其理，若合符契，谓之须知，皆出古人之传，曾非臆说。 凡厥同志，开卷斯有得焉。 隆兴癸未中元日书。 择友－",
      "translated_text": "**Essentials for the Alchemical Chamber**\n\n*Title:* *Essentials for the Alchemical Chamber*\n*Author:* Wu Hou of Southern Song, the Recluse of Gaogai Mountain (Ziranzi)\n*Volume:* One\n*Source of Base Text:* *Daoist Canon of the Zhengtong Era*, \"Category of Miscellaneous Arts\" under the *Dongshen* Section\n\n**Essentials for the Alchemical Chamber**\nRecorded by Wu Hou, the Recluse of Gaogai Mountain (Ziranzi)\n\nI have long encountered the Dao of immortals, and though daily cultivation and accumulated merit are essential, none surpass the reliance on the Great Elixir. From ancient times to the present, those who attained the Dao number no fewer than ten thousand. Some, through merit and conduct in this life, encountered perfected beings and received the divine elixir directly. Others, by virtuous causes from past lives, met true instructions, personally cultivated and refined them, and left behind texts to enlighten later generations. These teachings are not bound by mere words but reside in principle, expounded repeatedly and exhaustively. Those who encounter them do so not by chance.\n\nWhen one meets a perfected being, the transmission cannot be withheld. Yet if the recipient is unworthy, the transmission must not be recklessly given. Once the scriptures and instructions exist, all may potentially attain them, regardless of wisdom or folly. Only the perfected—whose conduct aligns with the immortals—upon seeing sacred texts, naturally grasp their principles, like Pao Ding dissecting an ox or Jiu Fang Gao judging a horse: the Dao is present at a glance. This is what is meant by \"cannot but transmit.\"\n\nAs for the unworthy, whose conduct contradicts principle, who fail to comprehend sacred texts and cling to their own views—such are those of whom Laozi spoke: \"If it could be offered, none would fail to offer it to their lord; if it could be presented, none would fail to present it to their kin; if it could be transmitted, none would fail to transmit it to their descendants.\" Even if one wished to transmit it, how could it be done?\n\nFrom youth, I admired the alchemical tortoise, seeking teachers far and wide. Many pointed to spurious texts forged by the Fang lineage since the Qin and Han, leading the blind with blindness, resulting in no small loss. Later in life, I met Master Huainan Wang, who bestowed upon me the *Scripture of Gold and Azure*. Thereafter, I visited famous mountains, witnessed numinous traces firsthand, and verified them against the sages without contradiction, finding them in perfect accord with the Great Dao without doubt.\n\nThus, I compiled the essentials of various schools to serve as a guiding principle—truly profound, clear, and illuminating. Yet fearing that scholars might still not awaken, I further arranged teachings on true lead and true mercury, the Flowery Pond and ablutions, the symbolism of the crucible and furnace, and the sequence of firing times. Wherever the schools differed in their explanations, I traced the underlying principles, and they aligned like tallying tokens. These are called *Essentials*, all derived from the transmissions of the ancients, never mere conjecture.\n\nMay all fellow aspirants find insight upon opening this scroll.\n\nWritten on the Day of the Middle Prime of the *guiwei* year of the Longxing era.\n*Selecting Companions*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 518,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.488354206085205,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹房须知.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "《参同录》曰：修炼之士，须上知天文，下知地理，达阴阳，穷卦象，并节气休旺，日时升降，火候进退，鼎炉法则。 然后会龙虎法象之门，识铅汞至真之道，兼须内明道德，外施惠慈，心与丹合，自达真境。 是知还丹之卫，非一朝一夕可会也。 凡炼丹，须是清虚之士三人，共倡同心结愿，惟望丹成。 将欲下手，先须斋戒，醮谢穹苍。 一人管鼎器，添换水火。 一人轮阴阳，更变造化卦象，进退水火，随其节候。 三人所管，各不得分毫有差。 叶真人云：午夜守卫，三人共虔祷祝，虽然各分所管，逐急须臾更替，夜问递相眠歇。 盖有昼夜不停，日月时刻长，恐修丹之人久远困劣，有误修制。 择地二 《参同录》云：将欲修炼，先须择地，惟选福德之地，年月吉利洁诤之地，方可修炼。 若是古墓寺院之基，废井坏鳌，战争之地，及女子生产秽污之所，皆不可作，阴真君曰：不得地，不可为也。 丹室三 《火龙经》日：选旺方。 司马子微注云：炼丹之室，岁旺之方。 择地为静室，不可太大，不可益高。 高而不疏，明而不漏，处高顺卑，不闻鸡犬之声，哭泣之音，濑水之响，车驰马走，及刑罚决狱之地，唯是山林宫观挣室皆可。 禁秽四 青霞子日：一室东向，勿令女子、僧尼、鸡犬等见入。 香姻长令不绝，欲入室，次得换新履衣服，及勿食葱蒜等。 《参同录》日：丹室之内，长令香不绝。 仰告上真，除是蔬食，务在精严。 丹井五 《参同录》日：虽得丹地，便寻丹井。 井是炼丹之要也。 昼夜添换，水火添换，滴漏唯在於井。 自古神仙上升之后，尽有丹井，以表井为炼丹之急也。 丹井成，勿令秽污，待水脉伏定，须涤去滞滓，然后任露天通，星月照，水既定，土色已收，方可取之。 若得石脚泉清白味甘者，是阳脉之水，运丹最灵。 若青泥黑壤，黄泉赤脉，铁涩腥味，有此之象，并是水脚交杂，阴阳积滞，不任炼丹。 《火龙经》日：须新水。 葛仙翕云； 须取泉以备用，不得杂汲使用。 若近山有泉清诤之水，不须甘水，仍不可杂人用。 取土六 《火龙经》日：葛仙翁云：修炼之器，坛炉之土，并须洁净。 司马氏云：神室之土，不可以凡土为之。 自古无人迹所践之处，山岩孔穴之内，求之，尝其味不咸苦，黄坚与常土异，乃可用也。 造炭七 《火龙经》日：葛仙翁云：墦坚於净窖中为炭木，臼杵之万下，糯米拌和，捣丸如鸡子大，晒乾，烈炉预焚令通红光，称斤两旋旋进火。 若一候用一两者，日一夕常令数足。 添水八 《火龙经》日：司马氏注：用新瓦镊釜等煮水，常如入体，旋旋添之，不得玲添也。 黄氏《金碧经》云：火易勿过度，分两合宜，其上水鼎过火盛，只得温暖，勿令成汤，虑有过失也。 合香九 青霞子日：降真香半斤，丹参五两，苏合香四两，老梧根四两，白檀香四两，沉香半斤，白胶香少许。 右七味，以蜜拌和，九如弹子大，每日只烧一九。 坛式十 《参同录》日：炉下有坛，坛高三层，各分八面，而有八门。 正开八门龙虎丹台 如云子曰：南面去坛一尺，埋生朱一斤，线五寸，醋拌之。 北面埋石灰一斤，束面埋生铁一斤，西面埋白银一斤。 上去药鼎三尺，垂古镜一面，布二十八宿五星灯前，用纯剑一口。",
      "translated_text": "*The Record of the Three Alignments* states: Those who cultivate and refine the elixir must first comprehend celestial patterns above and terrestrial principles below, master yin and yang, exhaust the imagery of the hexagrams, and grasp the waxing and waning of seasonal qi, the ascent and descent of hours, the advance and retreat of firing times, and the methods of the crucible and furnace. Only then may they enter the gate of the dragon-tiger symbolic system, recognize the true Way of lead and mercury, and—while inwardly illuminating virtue and outwardly extending benevolence—unite their hearts with the elixir to naturally attain the true realm. Thus, the safeguarding of the returned elixir cannot be grasped in a single morning or evening.\n\nFor elixir refinement, three practitioners of pure emptiness must join in shared aspiration and vow, their sole hope the completion of the elixir. Before commencing, they must first purify themselves through fasting and offer libations to the vault of heaven. One attends to the crucible and furnace, adjusting water and fire. Another regulates yin and yang, altering the hexagrams of creation and transformation, advancing or retreating water and fire in accordance with the seasonal nodes. Each of the three duties must be performed without the slightest error.\n\nMaster Ye states: At midnight, all three must guard the work with reverent prayers. Though each has their assigned task, they must take turns in urgent moments, alternating rest during the night. For the firing process continues day and night without pause, and the hours stretch long like the sun and moon. Should the cultivators grow weary over time, the refinement may be compromised.\n\n**2. Selecting the Site**\n*The Record of the Three Alignments* states: Before commencing refinement, one must first select a site. Choose only land of blessed virtue, where the years and months are auspicious and the ground is pure. Sites such as ancient tombs, temple foundations, abandoned wells, ruined kilns, battlefields, or places defiled by childbirth or impurity must not be used. As Lord Yin of the Dark says: \"Without the proper site, the work cannot proceed.\"\n\n**3. The Elixir Chamber**\n*The Fire Dragon Classic* states: Select the direction of annual vigor. As Sima Ziwei notes: The chamber for elixir refinement should face the direction of the year’s vigor. Choose a quiet room—neither too large nor excessively high. It should be lofty yet not drafty, bright yet not leaky, situated high but sheltered from lowly disturbances. No sounds of roosters, dogs, weeping, flowing water, galloping horses, or places of punishment and execution should reach it. Only mountain forests, Daoist abbeys, or secluded chambers are suitable.\n\n**4. Prohibiting Impurity**\nMaster Qingxia states: The chamber should face east, and no women, Buddhist monks or nuns, chickens, or dogs may enter. Let incense smoke rise without cease. Before entering, one must don fresh clothing and shoes and avoid consuming onions, garlic, or similar foods.\n*The Record of the Three Alignments* states: Within the elixir chamber, incense must never be extinguished. Petition the Perfected Above with offerings of vegetarian fare, maintaining utmost purity and discipline.\n\n**5. The Elixir Well**\n*The Record of the Three Alignments* states: Once the elixir site is secured, seek the elixir well. The well is essential to elixir refinement, for day and night, water and fire are adjusted through it. Since ancient times, immortals who ascended left behind elixir wells to signify their urgency in refinement. Once the well is dug, prevent all impurity. After the water vein stabilizes, purge stagnant sediment, then expose it to the open sky so that starlight and moonlight may illuminate it. Only when the water settles and the earth’s color is reabsorbed may it be drawn. If the water is clear, white, and sweet-tasting, sourced from a yang vein, it is most efficacious for elixir circulation. If the water is turbid with black mud, yellow earth, or red veins, or if it tastes metallic, astringent, or fishy, these indicate mingled water veins, yin-yang stagnation, and unsuitability for refinement.\n*The Fire Dragon Classic* states: Use only fresh water. As Immortal Ge notes: Draw spring water for preparation, never mixing it with other sources. If a clear mountain spring is nearby, sweet water is unnecessary, but it must not be shared with others.\n\n**6. Selecting Earth**\n*The Fire Dragon Classic* states: Immortal Ge says: The vessels for refinement, the earth for altars and furnaces, must all be pure. As Master Sima notes: The earth for the divine chamber cannot be ordinary soil. Seek it in places untrodden by human feet, within mountain caves or rock crevices. Taste it—if not salty or bitter, and if it is yellow, firm, and unlike common soil, it may be used.\n\n**7. Preparing Charcoal**\n*The Fire Dragon Classic* states: Immortal Ge says: Burn hardwood in a clean kiln to make charcoal. Pound it ten thousand times with a pestle, mix with glutinous rice, and form into balls the size of chicken eggs. Dry them in the sun, then preheat in a fierce furnace until glowing red. Weigh them precisely and feed the fire gradually. If one ounce is required per phase, ensure a constant supply day and night. Adjust the quantity as needed.\n\n**8. Adding Water**\n*The Fire Dragon Classic* states: As Master Sima notes: Boil water in new earthenware pots or iron cauldrons, maintaining a temperature akin to the human body. Add it gradually, never cold. As Huang’s *Golden and Azure Classic* states: Do not let the fire grow excessive; maintain proper weight. If the upper water crucible becomes too hot, keep it only warm, never boiling, lest errors arise.\n\n**9. Blending Incense**\nMaster Qingxia states: Combine half a catty of *jiangzhen* incense, five taels of *danshen*, four taels of *suhe* incense, four taels of old wutong root, four taels of white sandalwood, half a catty of *chen* incense, and a small amount of *baijiao* incense. Mix with honey and form into balls the size of marbles. Burn one ball each day.\n\n**10. The Altar Design**\n*The Record of the Three Alignments* states: Beneath the furnace lies an altar, three tiers high, each divided into eight sides with eight gates.\n*Like the Clouds Master* states: One foot south of the altar, bury one catty of raw cinnabar mixed with five inches of silk and vinegar. To the north, bury one catty of lime; to the east, one catty of raw iron; to the west, one catty of silver. Three feet above the medicine crucible, hang an ancient mirror. Before the twenty-eight lunar mansions and five planets, place a pure sword.",
      "overlap_context": "Pond and ablutions, the symbolism of the crucible and furnace, and the sequence of firing times. Wherever the schools differed in their explanations, I traced the underlying principles, and they aligned like tallying tokens. These are called *Essentials*, all derived from the transmissions of the ancients, never mere conjecture.\n\nMay all fellow aspirants find insight upon opening this scroll.\n\nWritten on the Day of the Middle Prime of the *guiwei* year of the Longxing era.\n*Selecting Companions*",
      "start_char": 518,
      "end_char": 1786,
      "start_sentence": 29,
      "end_sentence": 82,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.3425350189209,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹房须知.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "炉前添不食井水一盆，七日一添。 用桃木版一片，上安香炉，各处置，昼夜添至第四转，其丹通於神明。 恐魔来侵，安心守护，致祈梼之词云：谨启玄元皇帝、太上老君，运合乾坤，众魔莫侵，触吾至药，乾公辟身，东方埋铁，南方烈火，西方藏人，北立胡人，上方悬镜，配合五行，鬼神莫及，土地安宁，真人卫我，至道坚贞。 急急如律令。 采铅十－三法 《火龙经》云：绉虞白髯，元公素发。 不经凡火，天生神物，不能备见。 求之纯泽，是两法也。 绉虞，白虎也，白髯，自然生也。 元公，黑石也，银精抱之，状如髯发也，号日老翁须。 不经火毁，天生银也。 不得已，乃用纯泽不亲者，投之大海，采之八两。 解日：每银五十两，一日炼取金华之用精十两。 偃月炉千轮之，使沸面清，投白虎二两，鞘之须臾，有物状如云母，黄色，晶光夺目，以铁匙取之。 尽，又投二两，如前进十两，得八两争者。 此名水虎，又名黄芽，又名金华。 老君曰：从红入黑是真修，是为三法。 《参同录》日：凡采黄芽，须用金旺之时，以白露为首。 此谓金黑圆时，蟾光盛满，是炼丹之时候，炼时须八月。 许真君日：冬养子，八月下手，以九鼎取黄芽，至十月之内，全在水火停匀，阴阳得所，自然化出灵芽。 若是水火不匀，盗过铅脚，透入灵芽，不堪用也。 亦须受气满足，若气不足，丹亦不伏． 抽汞之图 葛仙翁云；",
      "translated_text": "Before the furnace, place a basin of unused well water, replenishing it every seven days. Use a peachwood board, upon which rests an incense burner, positioned in each direction. Day and night, replenish until the fourth cycle, at which point the elixir will commune with the divine spirits. Should demons attempt to intrude, steadfastly guard the heart and recite the following prayer:\n\n*\"With reverence, we invoke the Primordial August Emperor and the Most High Lord Lao: may the workings of Heaven and Earth align, and all demons be kept at bay. Should they touch our sacred medicine, let the Lord of Heaven repel them. To the east, buried iron; to the south, raging fire; to the west, hidden men; to the north, standing Hu barbarians; above, a hanging mirror—all arrayed in accord with the Five Phases. May ghosts and spirits be powerless, the land at peace, and true immortals protect me. May the Dao remain steadfast and pure. Swiftly, swiftly, as decreed by law!\"*\n\n**Thirteen Methods for Gathering Lead**\n*The Fire Dragon Classic* states: The *Zhouyu* has a white beard; the Primordial Lord, silver hair. Untouched by common fire, they are celestial treasures, rarely seen in full. Seek them in pure marshlands—these are the two methods.\n\nThe *Zhouyu* is the White Tiger, its white beard naturally grown. The Primordial Lord is black stone, embraced by silver essence, resembling a beard or hair—called the Old Man’s Whiskers. Unmarred by fire, it is celestial silver. If unavoidable, use pure marshland ore untainted by earth, cast it into the great sea, and gather eight taels.\n\nExplanation: For every fifty taels of silver, refine and extract ten taels of essence for the Golden Flower’s use in a single day. In a crescent moon furnace, stir with a thousand wheels until the surface boils clear. Add two taels of White Tiger, and after a moment, a substance like mica, golden and dazzling, will appear. Scoop it with an iron ladle. When exhausted, add another two taels, repeating until ten taels yield eight taels of essence. This is called the Water Tiger, also known as the Yellow Sprout or Golden Flower.\n\nLord Lao said: *\"From red to black is true cultivation\"*—this is the third method.\n\n*The Record of the Three Alignments* states: When gathering the Yellow Sprout, one must choose a time when Metal flourishes, beginning at the White Dew. This refers to the roundness of Metal and the fullness of the Toad’s light—an auspicious moment for elixir refinement, which must occur in the eighth month.\n\nMaster Xu the Perfected said: *\"Nurture the child in winter, begin in the eighth month, and with nine crucibles, gather the Yellow Sprout. By the tenth month, all depends on the balance of Water and Fire, the harmony of Yin and Yang, to naturally produce the numinous sprout. If Water and Fire are unbalanced, the lead’s foundation will be stolen, corrupting the sprout, rendering it unusable. The qi must also be fully received; if insufficient, the elixir will not submit.\"*\n\n**Diagram for Drawing Forth Mercury**\nMaster Ge the Immortal states:",
      "overlap_context": "ents* states: Beneath the furnace lies an altar, three tiers high, each divided into eight sides with eight gates.\n*Like the Clouds Master* states: One foot south of the altar, bury one catty of raw cinnabar mixed with five inches of silk and vinegar. To the north, bury one catty of lime; to the east, one catty of raw iron; to the west, one catty of silver. Three feet above the medicine crucible, hang an ancient mirror. Before the twenty-eight lunar mansions and five planets, place a pure sword.",
      "start_char": 1786,
      "end_char": 2331,
      "start_sentence": 83,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.276559114456177,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹房须知.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "飞汞炉木，为床四尺。 如鳌木足，高一尺已上，避地气，碟圆釜，容二斗，勿去火。 八寸床上鳌，依釜大小为之。 《火龙经》云：飞汞於丹砂之下，有少白砂亦佳。 若刚木火之，只可一昼夜，不必三夜也。 丹砂之滓，有飞不尽者，再留之。 砂无出溪桂辰，若光明者，亦可号日真汞也。 注云：鼎上盖密泥，勿令泄熙。 仍於盖上通一黑管，令引水入盖上盆内，庶汞不走失也。 《参同录》日：还丹非鼎器不成。 故《混元经》日：坎高为药，乾坤为鼎。 四者相抱，谓之崇钥。 乾者金也，坎者土也。 谓土生金，故号金鼎。 非用金为之鼎者，丹之室也。 鼎器全备，万物生焉。 鼎象中宫，中宫属土，能生万物，故鼎用土。 阴真君日：须向中宫求鼎器。 明知用凡土烧甍为鼎，至於中胎，亦用洎。 长短宽窄，临时制造。 宽则水火之黑不降，窄则水火之黑不行，更自消停。 既得鼎，须置炉，炉是鼎之届廓也。 鼎若无炉，如人无宅舍城郑也，何以安居。 故炉以安鼎，收藏火黑。 司马氏云：葛仙翁得口诀，予置土火鼎，用鄱阳瓷末为白土，匀之入臼杵万下，为鼎形，如鸡子，高一尺二寸，为盖安物於中，仍固济以法，泥水鼎内，瓦盆坚者作底，容药，乃进鼎三分，入瓦盆中，别以药炉内外了，却以法泥，泥乾安炉上也。 药泥十四 黄土、蚌粉、石灰、赤石脂、食灵，右六味各一两，为末，水调用之，名六一泥。 注云：若以蜜调之，尤紧密不泄。 未济炉 既济炉",
      "translated_text": "The Mercury-Flying Furnace is made of wood, serving as a platform four feet in height. Like the legs of a turtle, it stands over one foot tall to avoid earthly qi. The round crucible holds two *dou* and must not be removed from the fire. The eight-inch platform above the turtle-shaped base is fashioned according to the size of the crucible.\n\nThe *Fire Dragon Classic* states: *\"To fly mercury, place it beneath cinnabar; a small amount of white sand is also acceptable. If using hardwood fire, one day and night suffice—three nights are unnecessary.\"* Any cinnabar residue that fails to fully sublimate should be retained. Cinnabar from the Xi, Gui, or Chen regions, if luminous, may also be called true mercury.\n\nA note adds: *\"Seal the lid of the crucible tightly with mud to prevent leakage. Then, affix a black pipe to the lid, guiding water into a basin above, so that mercury does not escape.\"*\n\nThe *Record of the Uniting of Sameness* states: *\"The Reverted Elixir cannot form without a crucible.\"* Thus, the *Scripture of the Primordial Chaos* says: *\"Kan (Water) rises as the medicine; Qian (Heaven) and Kun (Earth) serve as the crucible. When the four embrace, it is called the Lofty Key.\"* Qian is Metal, and Kan is Earth. As Earth generates Metal, it is termed the Golden Crucible—not that the crucible itself is made of metal, but that it is the chamber of the elixir. When the crucible is fully prepared, the myriad things are born within it. The crucible symbolizes the Central Palace, and the Central Palace pertains to Earth, which generates the myriad things; thus, the crucible is made of Earth.\n\nMaster Yin the Perfected said: *\"One must seek the crucible in the Central Palace.\"* It is known that common clay is fired into a crucible, and for the inner chamber, *ji* (a binding agent) is also used. The length and width are determined at the time of crafting. If too wide, the qi of Water and Fire will not descend; if too narrow, the qi of Water and Fire will not circulate—adjust accordingly.\n\nOnce the crucible is obtained, a furnace must be prepared, for the furnace is the enclosure of the crucible. A crucible without a furnace is like a person without a dwelling or city walls—how can it be settled? Thus, the furnace secures the crucible and contains the fire’s qi.\n\nThe Sima clan records: *\"Master Ge the Immortal received the oral formula and prepared a clay-and-fire crucible. Using porcelain powder from Poyang as white clay, he blended it and pounded it ten thousand times in a mortar to shape the crucible like an egg, twelve inches high. A lid was fitted to hold the ingredients within, then sealed with proper methods. The crucible was lined with mud, and a sturdy earthen basin served as the base to hold the medicine. The crucible was then inserted three-tenths into the basin, and the furnace was separately prepared inside and out. Finally, it was sealed with method-mud and dried before placing the crucible atop.\"*\n\n**Medicinal Mud (Fourteen Ingredients):**\nYellow earth, clamshell powder, lime, red halloysite, and *shi ling*—six ingredients, each one *liang*, ground into powder and mixed with water for use, called Six-One Mud.\n\nA note adds: *\"If mixed with honey instead, it becomes even more tightly sealed and impervious to leakage.\"*\n\n**Uncrossed Furnace**\n**Crossed Furnace**",
      "overlap_context": "ild in winter, begin in the eighth month, and with nine crucibles, gather the Yellow Sprout. By the tenth month, all depends on the balance of Water and Fire, the harmony of Yin and Yang, to naturally produce the numinous sprout. If Water and Fire are unbalanced, the lead’s foundation will be stolen, corrupting the sprout, rendering it unusable. The qi must also be fully received; if insufficient, the elixir will not submit.\"*\n\n**Diagram for Drawing Forth Mercury**\nMaster Ge the Immortal states:",
      "start_char": 2331,
      "end_char": 2904,
      "start_sentence": 107,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.847870588302612,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹房须知.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "后得正本校勘，却只用既济鼎鳌，云魏伯阳所谓蒸釜若神者也。 青霞子曰：依样造炉下鼎讫，束壁下火，先须祭炉。 清酒三斤，鹿脯十二缸，香一炉，时果十二分。 先须祭炉，然后持呎日：皇皇上天，黄黄后土。 生育万物，万物磁茂。 圣舍枢纽，元受宗要。 皇帝固鼎，玄女临炉。 还符阴阳，以成宝饵。 三五神光，邪魔慑伏。 直炉童子，卫火将军，六甲统兵，蚩尤护真。 谨以某月某日，授弟子某甲，献奠之诚。 上请真人洞府草仙，咸宁默运，以奉勿轻。 再拜。 燠养十五 葛仙翁曰：至药未炼，先须燠养之法，至妙且玄。 夫含育元黑，滋茂至神，苟有不真，失之俄顷，仙凡顿异，可不谨哉。 其法坚石或玉石，为乳槌钵，以乳二物各八两，令相制入鼎内，面于束向，研三千遍，讫聚之成块，命日胚晖元始，现天地未兆之形，燠养太和，显至神潜伏之状。 然后入有盖土釜中，法泥。 泥乾，入灰池，文武火燠七日。 玲出之，或紫色，如两数不足，则火候有失。 别作灰池，预作文武火燠之，以备用二十一日，顷刻不可离。 故炼丹非三人不可燠养。 讫再研之，乃入鼎。 鼎中先实黄土为基，厚二寸四分，象二十四黑，安二物於中，乃下火。 中胎十六 青霞子曰：药在鼎中，如鸡抱卵，如子在胎，如果在树，但受黑满足，自然成熟。 药入中胎，切须固密，恐泄漏真黑。 又日：固济胎不泄，变化在须臾。 中胎所制，形圆如天地，收起似蓬壶，闭塞微密，神运其中。 《金碧经》日：炉鳌取象，图固周坚，委曲相制，以使无虞。 黄真君注云：炉鼎神室，铅汞重重相制，故炉敛火黑以制胎，胎敛火黑以制铅，铅得火黑以制汞，递相制伏，须器圆密，方保无虞。 用火十七 如云子日：下火时，用实心石七个，烧令通红，以醋淬之，抛於药房内。 臾取桃柳束南枝，各七茎，净火焚香，精心虔祝，安慰百官。 云：大道弟子某，谨启玄元皇帝太上老君。 今修至道，愿降仙旌灵官，为宗土地安宁，内魔不挠，外恶无侵，速成大药，永保长生。 谨辞。 安静讫，夜半子时起火，勿令女子鸡犬见。 起火时用炭五两，烧令通赤，入炉灰盖之，平旦不可失也。 其鼎当如鸡卵，其火取日之火，次楠木火为世败火，堪用九年，并不得用别火，号日长火水火。 注云：火隔正月起午，水隔正月起戌，并逆行六阳。 辰，烧丹起首日，大忌潮生日，及甲戌、甲午、甲辰、甲寅、甲子。 沐浴十八 丹诀曰：卯酉为沐浴，诸家皆以钵研三千遍，此法至微至妙，非至人不能造也。 压石镇定 古歌云：女子着青衣，郎君披素练。 见之不可用，用之不可见。 《崔公入药镜》云：研龙使如粉，吸虎自相当。 《参同录》云：卯酉二八之门，谓之死黑。 前二日半为卯，后二日半为酉。 丹家大忌，不进水火。 因而语之日：此理幽微，世人莫测，可谓神圣。 若不明此，岂足以语炼丹哉。 火候十九 古法只是十月。 故青霞子云：未尝闻人受胎，年三岁而生者也。 其问或三年者，作用不同，理则、一也。 火之斤两无定，为器有大小，药有群寡，要在临时消详阴阳之理，靡差毫压。 故黄真君解《金碧经》，於火候至为剖露真机。 恐后学犹或轻言，乃留诗日：物因不识翻成贱，言为玄微却被轻。",
      "translated_text": "After collating with the authentic original, it was found that only the Crossed Furnace and Cauldron were to be used—precisely what Wei Boyang referred to as *\"the steaming cauldron like a spirit.\"*\n\nMaster Qingxia said: *\"Once the furnace and lower cauldron are constructed according to the pattern, enclose the walls and kindle the fire. First, a furnace sacrifice must be performed: three *jin* of clear wine, twelve jars of dried venison, one incense burner, and twelve portions of seasonal fruit. After the sacrifice, recite the invocation:\n\n*'August Heaven above, Yellow Earth below,\nNurturing the myriad things to flourishing abundance.\nThe sacred pivot holds fast the essential axis,\nThe Emperor secures the cauldron, the Dark Maiden attends the furnace.\nHarmonizing yin and yang to refine the precious elixir,\nThe radiance of the Three and Five subdues all demonic forces.\nO Youth of the Upright Furnace, General of the Guarding Fire,\nSix Jia marshals the troops, Chiyou protects the truth.\nOn this day of such-and-such month, I, disciple So-and-so,\noffer this sincere libation.\nI humbly invoke the Perfected Ones of the Grotto Realms and the Immortals of the Grasses,\ngranting silent aid—do not treat this lightly.'*\n\nBow twice.\n\n**Nurturing for Fifteen Days**\nMaster Ge the Immortal said: *\"Before the supreme medicine is refined, the method of nurturing must first be applied—subtle and profound. The embryo of primordial qi must be nourished to flourishing divinity. If anything is impure, all is lost in an instant; immortality and mortality diverge in a moment. How can one not be cautious?*\n\n*Its method: use hard stone or jade to fashion a pestle and mortar. Grind the two substances, each eight* liang*, to restrain each other within the cauldron. Face east while grinding three thousand times, then gather the powder into a mass, calling it* 'Embryonic Radiance of the Primordial Beginning' *—revealing the form of Heaven and Earth before their emergence. Nurture it with supreme harmony to manifest the hidden workings of the divine.*\n\n*Then place it in an earthen cauldron with a lid, sealed with method-mud. Once the mud is dry, set it in an ash pit and nurture it with civil and martial fire for seven days. When removed, if it appears purple, the process is complete. If the color is insufficient, the firing has been flawed. Prepare another ash pit and nurture it with civil and martial fire for twenty-one days, never leaving it for even a moment. Thus, refining the elixir requires no fewer than three people for nurturing.*\n\n*Afterward, grind it again and place it in the cauldron. First, pack yellow earth firmly at the base, two* cun *and four* fen *thick, symbolizing the twenty-four qi. Set the two substances within and begin the firing.*\n\n**The Central Embryo (Sixteen)**\nMaster Qingxia said: *\"When the medicine lies in the cauldron, it is like a hen brooding an egg, a child in the womb, or fruit on a tree—once the qi is fully received, it ripens naturally. When the medicine enters the central embryo, utmost care must be taken to seal it tightly, lest the true qi leak away.\"*\n\n*It is also said: \"Seal the embryo without leakage, and transformation occurs in an instant.\" The central embryo’s construction is round like Heaven and Earth, rising like Penglai’s isle—closed and minutely sealed, with divine workings within.*\n\n*The* Scripture of the Golden and Azure *states: \"The furnace and cauldron take their form in solid enclosure, intricately restraining one another to ensure no mishap.\" Master Huang the Perfected commented: \"The furnace, cauldron, and divine chamber restrain lead and mercury layer upon layer. Thus, the furnace gathers fire-qi to restrain the embryo, the embryo gathers fire-qi to restrain lead, and lead, receiving fire-qi, restrains mercury. Each restrains the other in turn. Only when the vessel is round and sealed can safety be assured.\"*\n\n**Using Fire (Seventeen)**\nMaster Ruyunzi said: *\"When applying fire, take seven solid stones, burn them until glowing red, then quench them in vinegar and toss them into the medicine chamber. Then take seven branches each of peach and willow from the southeast, burn them in pure fire as incense, and sincerely pray to comfort the hundred spirits, saying:*\n\n*'Disciple So-and-so of the Great Dao humbly invokes the Primordial Emperor, the Most High Lord Lao. Now cultivating the supreme Way, I pray for the descent of the immortal banners and divine officials. May the local earth gods be at peace, inner demons unobstructed, and outer evils unassailing. May the great medicine swiftly form, granting eternal longevity.'*\n\n*Conclude the prayer. After quieting the space, begin the fire at midnight, the hour of* zi*, ensuring no women, chickens, or dogs witness it. At ignition, use five* liang *of charcoal, burn it until glowing red, place it in the furnace, and cover it with ash. Do not neglect this by dawn.*\n\n*The cauldron should resemble a chicken’s egg. The fire should be taken from sunlight; next, nanmu wood fire serves as the common fire, usable for nine years. No other fire may be used—this is called* 'Long Fire of Water and Fire.'*\n\n*A note adds: \"Fire begins at* wu *in the first month, water at* xu *in the first month, both moving in reverse through the six yang phases. The day of* chen *is the starting day for firing the elixir. Greatly avoid days of tidal birth, as well as* jia-xu*,* jia-wu*,* jia-chen*,* jia-yin*, and* jia-zi*.\"*\n\n**Bathing (Eighteen)**\nThe *Elixir Formula* states: *\"Mao and you are for bathing. All schools grind the medicine three thousand times in a mortar—this method is most subtle and wondrous, unattainable except by the perfected.\"*\n\n*An ancient song says:*\n*\"A maiden in blue-green robes,\nA gentleman in plain white silk.\nIf seen, it cannot be used;\nIf used, it cannot be seen.\"*\n\n*The* Cui Gong’s *Mirror of Entering the Medicine* says: *\"Grind the dragon to powder,\nLet the tiger inhale in balance.\"*\n\n*The* Record of the Threefold Concordance *states: \"The gates of* mao *and* you *at the second and eighth months are called the dead qi. The two and a half days before* mao *and after* you *are critical. Elixir masters greatly avoid introducing water or fire at these times.\"*\n\n*Thus it is said: \"This principle is profound and obscure, beyond mortal comprehension—truly divine and sacred. Without understanding this, how can one speak of refining the elixir?\"*\n\n**Fire Timing (Nineteen)**\nThe ancient method prescribes only ten months. Thus Master Qingxia said: *\"Never has it been heard that a human embryo gestates for three years before birth.\"* Some methods take three years, but the principle remains the same—only the application differs.\n\nThe weight of fire is not fixed, for vessels vary in size and medicines in quantity. The key lies in carefully assessing the principles of yin and yang at the time, without the slightest error.\n\nMaster Huang the Perfected, in his commentary on the *Scripture of the Golden and Azure*, most thoroughly revealed the true mechanism of fire timing. Fearing that later students might still treat it lightly, he left this poem:\n\n*\"Things, when unrecognized, are deemed worthless;\nWords of the profound and subtle are met with disdain.\"*",
      "overlap_context": "urnace was separately prepared inside and out. Finally, it was sealed with method-mud and dried before placing the crucible atop.\"*\n\n**Medicinal Mud (Fourteen Ingredients):**\nYellow earth, clamshell powder, lime, red halloysite, and *shi ling*—six ingredients, each one *liang*, ground into powder and mixed with water for use, called Six-One Mud.\n\nA note adds: *\"If mixed with honey instead, it becomes even more tightly sealed and impervious to leakage.\"*\n\n**Uncrossed Furnace**\n**Crossed Furnace**",
      "start_char": 2904,
      "end_char": 4157,
      "start_sentence": 137,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.92001509666443,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹房须知.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "昨夜托栏几长叹，一输秋月为谁明。 嗟乎，圣人利济之心，如此其功。 缘福薄之人，自弃自暴，邪见失正。 痛哉惜哉。 开炉二十 《参同录》云：从十月起首，至四月属阳鼎，左旋。 注云：弦望晦朔，乃日月四时也。 旦则暗魄中魂生而为明，则日上弦。 上弦之后，魂为体而魄为用，魂中又魂，魂生而日望矣。 望则明魂中魄生而为暗，则日下弦。 下弦之复，魄为体而魂为用，魄中又魄，魄生而月晦矣。 一月之中，魂魄往来，不失其度。 黄真人托月以为火侯，因此可见矣。 《参同录》云：五月至十月属阴鼎，右转。 丹至困极之时，不得暂抛离药室，专听龙吟之声。 过此阳极之数，丹已无忧。 至十月．日全，阳归坤遇，丹成就，色变紫金，光华赫然，九转成阳，五行黑足。 如云子日：开鼎时须斋戒沐浴，各披道衣，顶星冠，面南，跪捧药炉，焚香净身，虔诚祷告，启请大道天尊、太上老君，一切十方上圣真君。 奉道弟子某甲，功成丹鼎，法应乾坤，阴风消散，日华赫明，纯阳变体，龙虎持身，上归紫府，永离红尘。 凡开鼎取药之时，勿令妇人鸡犬见之，所飞鼎上白者紫金丹，赤为龙虎丹，鼎周四面者为大丹，中问白如鱼鳞片者，名神符白雪。 服食二十－ 如云子日：丙黄蜡球子内闭，入东流水，浸三七日，出火毒。 入竹筒内，缅贮於饭中，蒸一伏时，去水毒。 讫煮汁为丸，如胡麻子大，以祭山。 (以下原阙)",
      "translated_text": "Last night, I leaned on the railing and sighed long,\nFor whom does the autumn moon shine so brightly in vain?\nAlas! The sagely heart of benefiting and saving all is so profoundly efficacious.\nYet those of meager fortune abandon and harm themselves,\nTheir perverse views losing the true and upright.\nHow grievous! How lamentable!\n\n**Opening the Crucible (Twenty)**\nThe *Record of the Uniting of Sameness* states: From the tenth month, one begins, proceeding to the fourth month, which pertains to the yang crucible, rotating left.\nThe annotation says: The crescent, full, waning, and new moons are the four phases of the sun and moon.\nAt dawn, within the dark essence, the bright spirit is born and becomes light—this is the sun’s first quarter.\nAfter the first quarter, the spirit becomes the essence and the essence the function; within the spirit, another spirit arises, and the spirit grows—thus the sun reaches its fullness.\nAt fullness, within the bright spirit, the dark essence is born and becomes darkness—this is the sun’s last quarter.\nAfter the last quarter, the essence becomes the essence and the spirit the function; within the essence, another essence arises, and the essence grows—thus the moon reaches its darkness.\nWithin a single month, spirit and essence alternate and return, never deviating from their measure.\nThe Perfected Huang used the moon to determine the fire timing—this principle is thus made clear.\n\nThe *Record of the Uniting of Sameness* states: From the fifth to the tenth month, it pertains to the yin crucible, rotating right.\nWhen the elixir reaches its most trying moment, one must not for a moment abandon the chamber of medicine, but listen attentively to the dragon’s song.\nBeyond this number of extreme yang, the elixir is without peril.\nBy the tenth month, the sun is complete, yang returns to Kun, and the elixir is accomplished—its color transforms to purple-gold, its radiance resplendent.\nNine revolutions complete the yang; the Five Phases are fully realized.\n\nMaster Ruyunzi said: When opening the crucible, one must fast, bathe, and purify oneself, don the Daoist robe, wear the star crown, face south, kneel to hold the medicine furnace, burn incense to cleanse the body, and pray with utmost sincerity.\nInvoke the Heavenly Worthy of the Great Dao, the Most High Lord Lao, and all the Perfected Lords of the Ten Directions.\nThis humble disciple, so-and-so, having completed the elixir in the crucible, follows the law of Heaven and Earth.\nThe yin winds disperse, the sun’s brilliance blazes forth, the pure yang transforms the body, and the Dragon and Tiger sustain it.\nIt ascends to the Purple Palace, forever departing the red dust.\nWhen opening the crucible to retrieve the medicine, ensure no women, chickens, or dogs witness it.\nThat which flies white upon the crucible is the Purple-Gold Elixir; if red, it is the Dragon-Tiger Elixir.\nThat which encircles the four sides of the crucible is the Great Elixir.\nThe white, fish-scale-like flakes in the center are called the Divine Talisman White Snow.\n\n**Ingestion (Twenty-One)**\nMaster Ruyunzi said: Enclose it in a ball of yellow wax, place it in east-flowing water, and soak for twenty-one days to dispel the fire toxin.\nThen place it in a bamboo tube, wrap it in silk, and steam it within rice for one *fu* period to remove the water toxin.\nFinally, boil it into a decoction and form pills the size of sesame seeds.\nOffer them in sacrifice to the mountain.\n*(The original text is incomplete hereafter.)*",
      "overlap_context": "d, for vessels vary in size and medicines in quantity. The key lies in carefully assessing the principles of yin and yang at the time, without the slightest error.\n\nMaster Huang the Perfected, in his commentary on the *Scripture of the Golden and Azure*, most thoroughly revealed the true mechanism of fire timing. Fearing that later students might still treat it lightly, he left this poem:\n\n*\"Things, when unrecognized, are deemed worthless;\nWords of the profound and subtle are met with disdain.\"*",
      "start_char": 4157,
      "end_char": 4715,
      "start_sentence": 197,
      "end_sentence": 221,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.201143503189087,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹房须知.txt",
        "category": "众术类"
      }
    }
  ]
}