{
  "source_id": "丹经极论",
  "source_file": "chunked_daozang\\丹经极论.json",
  "total_chunks": 4,
  "total_original_chars": 3950,
  "total_translated_chars": 20832,
  "total_translation_time": 105.84354662895203,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\丹经极论.txt",
    "category": "方法类"
  },
  "full_translation": "*The Ultimate Treatise on the Elixir Canon*\n\n*The Ultimate Treatise on the Elixir Canon* is a text of uncertain authorship, likely dating to the Southern Song dynasty. It comprises one scroll and is preserved in the *Zhengtong Daoist Canon* under the *Dongzhen* section, Methods category.\n\n**The Ultimate Treatise on the Elixir Canon**\n\nBefore the primordial chaos preceding heaven and earth, true lead existed in its nascent form, having attained the One. Thereafter, heaven and earth gradually emerged, followed by yin and yang, the Five Phases, and the myriad beings. Thus, lead is the parent of heaven and earth and the root of yin and yang. The sages extract the root of heaven and earth—the parents—and take the mother of yin and yang as the mother of the elixir. If one cannot comprehend that which gives birth to heaven, earth, yin, and yang, one has not grasped the Way of the golden liquid returning elixir. To use the Five Metals, Eight Stones, plant ashes, morning dew, frost, snow, ice, or other miscellaneous substances produced *after* heaven and earth and yin and yang as ingredients is surely difficult!\n\nThose of like mind, after long reflection, will awaken to this truth. Unless one cleaves open the primordial chaos to behold the root of heaven and earth, and splits the vast expanse to perceive the mother of yin and yang, one cannot discuss the true Way of the golden liquid returning elixir. Those who attain understanding will grasp this—beware of straying into side paths and crooked byways.\n\nTrue lead is the true qi of the One. The original yang qi of the human body scatters daily, and only by its coagulation can the sacred embryo form. Thus, the sages gather true lead to refine it, causing it to coagulate into cinnabar. Daily, they apply the fire, gradually adding mercury. As mercury increases, the qi of lead dissipates, hence the process of \"withdrawing lead and adding mercury.\" After ten months of practice, when lead is exhausted and mercury dried, it transforms into the golden liquid returning elixir, and the form becomes purely yang!\n\nLead is the fire of heaven and earth, the foundation of the parents yin and yang. The sages gather the root of heaven and earth—the parents—as the foundation of the great medicine, and extract the pure essence of yin and yang as the substance of the great elixir. This is no ordinary alchemical process.\n\nMercury’s nature is to flee, but it coalesces upon encountering lead, for mother and child cling to one another. Before the primordial chaos preceding heaven and earth, true lead attained the One and took form first, gradually giving rise to heaven and earth, yin and yang, the Five Phases, and the myriad beings. Using the pre-heaven yang elixir to refine one’s own yin mercury, one immediately becomes purely yang! Thereafter, refining within the body to produce the golden liquid returning elixir—since the true transformation occurs within—is called the \"inner medicine\" and \"inner elixir.\" Though the natural true fire blazes ceaselessly within the earthen crucible, one must rely on the external furnace, diligently applying the work of increasing, concealing, withdrawing, and adding, operating without error or negligence until completion. Yet the true fires—both inner and outer—undergo boundless transformations, all dependent on the wondrous efficacy of true lead.\n\nThis substance alone can capture mercury, preventing its flight. Though the two medicines—inner and outer—differ in form, their function is one and the same. The reason for inner and outer medicines lies in the fact that the human body receives the refined qi of the heavenly Way at birth and is shaped by the molding of yin and yang. Thus, within the body, essence and qi are fundamental, with spirit born of qi and qi born of essence. Yet these three treasures are all post-heaven qi, products of the utmost yin. For those who cultivate the truth, refining essence, qi, and spirit is paramount. However, since these three are all post-heaven and purely yin, lacking yang, how can they transform into pure yang and transcend heaven and earth?\n\nThus, the ancestral masters said: \"Lone yin cannot generate on its own. One must gather the pre-heaven qi of the One, using true yin and true yang—substances of the same kind in the ratio of two to eight—to capture them within a single moment, refining them into a grain of utmost yang elixir, called true lead.\" Since this transformation occurs externally, it is termed the \"outer medicine.\" Using this yang elixir to capture one’s own yin mercury is like a cat catching a mouse. The yang elixir is the mother qi of heaven and earth, while one’s own mercury is the child qi of heaven and earth. Using the mother qi to subdue the child qi—are they not of the same qi?\n\nIt is also said: Before the primordial chaos preceding heaven and earth, true lead attained the One and gradually gave rise to heaven and earth, yin and yang, the Five Phases, and the myriad beings—this proves that the golden elixir is the pre-heaven qi of the One. Using the pre-heaven yang elixir to refine one’s own yin mercury transforms it into pure yang. Further aided by the fire of yin and yang symbols—advancing, retreating, withdrawing, and adding—after ten months of practice, the form transforms into qi, qi into spirit, and spirit unites with the Dao, becoming formless and unfathomably mutable. Thus, one transcends heaven and earth, standing beyond creation, grasping and molding heaven and earth,\n\nThe One is qi. If one can circulate the true qi of the Great One, harmonizing it with one’s own true qi, embracing the Supreme Harmony, and refining it over time, this becomes the Great Elixir. The Elixir is pure yang, and yang is the Dao of Heaven. Thus, when spirit abandons the Dao and gathers, it takes form; when it scatters, it becomes qi. Those who commune with the Dao are nourished by the Dao through qi.\n\nTo cultivate spirit is to preserve harmony with the Dao of Heaven. When essence and qi mutually sustain one another and are refined over time, this is called \"refining the form with pure yang.\" Fire is yang, and breath is wind. Using wind to blow fire refines the form, and both spirit and form attain subtlety—this is called \"refinement.\" To refine the form with form, one must first concentrate the mind within, allowing true qi to surge in harmony. This is the pure essence of yang qi, circulating without cease, ascending and descending, cycling endlessly, embracing all things—thus it is yang of the Elixir.\n\nHeaven’s qi descends and then ascends; earth’s qi ascends and then descends. The yang essence of heaven crystallizes as the sun, and the yin essence of earth crystallizes as the moon. If one grasps the mechanism of the Dipper’s handle, one naturally revolves the sun and moon, circulating without rest—this is the Dao of refining spirit with pure yang. Those who cultivate the Elixir gather the essence of the sun and moon, unite the numinous qi of yin and yang, and when the cycle of stars is complete and yin and yang are exhausted, they return the merit to the virtue of earth, and spirit and essence are perfected.\n\nThe transformations of the Qian Dao establish the nature and mandate of all things. The Dao of transformation arises from the primordial within nature, yet it must rely on mandate as its body; mandate emerges from the existent within the non-existent, yet it must employ nature as its function. When nature is disturbed by emotions, mandate declines with desire. When mandate is flourishing, spirit is whole and nature thrives; when mandate wanes, nature weakens and spirit dims.\n\nNature is the Dao, spirit, function, stillness, and yin within yang; mandate is life, body, movement, and yang within yin. These two depend on each other—neither can be lacking. Solitary yang cannot stand, and solitary yin cannot form. Only when body and function are both complete does the wondrous Dao emerge.\n\nMaster Lü said: \"Enlightening empty nature without refining the Elixir, even after ten thousand kalpas, the yin spirit will struggle to attain sagehood.\" Master Dou said: \"Seeking awakening through Chan, exhausting words to inquire into realization—seeing nature, how could one know it is like a dream? It is no different from a mad monkey grasping at the moon’s reflection in water. How can one seize the moon’s light and bring it back?\"\n\nYang essence is the essence of the True One, the qi of utmost yang, called Yang Elixir. One’s own true qi belongs to yin and governs the entire body with its hundred bones. When the Yang Elixir arrives from without to subdue one’s yin mercury, the Yang Elixir becomes the master, and one’s mercury becomes the guest. When these two long for each other, they congeal into golden sand, naturally neither flying nor fleeing. Then, with the addition of fire, they are nurtured and tempered into the Golden Elixir of Return.\n\nThus, the Yang Elixir is external and called \"distant\"; one’s own yin mercury is internal and called \"intimate.\" Reversing this intimacy and distance to determine master and guest—this is how the Dao is accomplished! The true Dao nourishes spirit. If one can guard the self at the barrier where qi dies, even the withered bones of seven generations will be infused with life qi. That which gives me life is the Dao; that which animates me is spirit. To guard spirit with the Dao and nourish spirit with the Dao—this is the way.\n\nThe external medicine is the Elixir. In the crucible of creation, the true qi of the One is refined. When the work is complete, success is achieved in half a double-hour. The internal medicine is the Golden Elixir of Return, which requires ten months to complete the spiritual embryo’s gestation.\n\nThough these two medicines operate through the same yin-yang transformations of creation, their methods of applying fire and timing differ greatly. For the external medicine, the fire timing requires the body and mind to remain unmoving, breath to be natural, and spirit and qi to enter their root. If closure is too extreme, it becomes strained; if release is too indulgent, it becomes scattered. Only by maintaining unbroken continuity can spirit naturally congeal and breath naturally settle.\n\nThe work of circulating fire is like cooking a small fish—neither excessive nor insufficient. When the initial qi sprouts, it lies in the \"gathering without gathering.\" It exists yet does not exist—this is nurturing the tender yang with subtle yang. Then, focus attention within the compass, with each breath returning to the root. With intention, stabilize qi, gradually circulating fire in ascent and descent, cycling endlessly. One must not rigidly fixate on stillness, lest it lead to blockage.\n\nThus, the revolutions of yin and yang are the wondrous workings of Qian and Kun, yet few comprehend them. If heaven and earth did not revolve, qi would stagnate, and the myriad things would not arise. If a person does not revolve, qi becomes blocked, and the Elixir cannot be produced. How then could one attain the same longevity as heaven and earth?\n\nA single cycle’s work is completed in nine revolutions. After prolonged firing, one feels a subtle surge of spirit and qi. When the fire timing is complete and clarity resides within, yin and yang separate—then one should withdraw the fire and nurture it for a time. Then, resume firing, gradually refining until extreme emptiness is attained and profound stillness is maintained. Body and mind unite, spirit and qi merge, the hundred bones and nine orifices feel as if bathed, and the twin gates of the spine blaze like fire—only then can one be called pure yang.\n\nThose who cultivate refinement must be fluid in seizing the moment, knowing when to advance and retreat, preserving or relinquishing without loss—they become sages.\n\nFor the internal medicine’s work: The true qi of the One is formless and indistinct. Without the union of the two eights’ yin and yang qi, how could it descend and manifest as the grain-like form of the Elixir? Yet even after ingesting this grain-like Elixir, without the misty warmth of yin-yang fire, how could it transform into the Golden Elixir?\n\nThe true qi of the One, within the crucible of creation, is tempered by true fire. Its light pierces the curtains, and golden radiance fills the chamber. This is the true yin and true yang refining the union of the two qi, producing the grain-like Elixir. When swallowed and carried into the cinnabar field of the abdomen...\n\nWithin, it transmutes the yang soul to dissolve the yin corporeal spirit. At this moment, the singular qi circulates back into the body, descending from the Mud Pill Palace, and one feels the five viscera grow crystalline and cold, golden light suffusing the entire form—success hinges upon this instant.\n\nYet within the body, there remains the work of ten months: applying the methods of withdrawal and addition, guarding against danger and foreseeing peril. This is the time described as *\"the mud-snake in the well dances on the mulberry branch, the moon at the window illumines the plum and pear; in the night’s chaos, the earth crumbles, yet the ten thousand images remain unseen.\"*\n\nHaving obtained this elixir, the scriptures expound at length on the yang elixir. After it has transmuted one’s own yin mercury, one must operate the fire with an empty mind, harmonizing without attachment. The union of yin and yang is governed by breath; breath is directed by spirit-qi, spirit-qi by water and fire, and water and fire by fetal breathing. Flowing ceaselessly, Kan and Li merge, giving birth to the Golden Elixir.\n\nThe mechanism of yin-yang transformation does not rely on initial effort. Once ascended, it descends from the Mud Pill Palace—what is called \"settling below to stabilize the human body’s Mud Pill and Crimson Palace, regulating the five qi and harmonizing the hundred spirits.\" Here, one forgets qi to nourish spirit, continuing downward in a gentle, silent ascent.\n\nThe oral instruction states:\n*\"Concentrate qi to attain suppleness, like an infant free of filth and scattered thoughts. Still the mind and guard the One; external perceptions do not enter, internal perceptions do not depart. All day, remain in primordial chaos, as if within the womb.\nSpirit settles to meet qi, qi harmonizes to unite with spirit. Spirit congeals with qi, and qi clings to spirit to abide.\nIn the realm of profound stillness and great rest, in the boundless expanse of nothingness, the heart is ashen and obscure, like a hen brooding her eggs, like a fish in water. Exhale to the root, inhale to the stem, continuously preserving it—guard the single breath within the womb.\nFurther, withdraw from worldly dust, sever sight and sound, reduce food and drink, and abstain from sleep. Then, in effortless motion, let it move of itself, and in self-moving effortlessness, do not cling to holding or guarding, nor fixate on advancing the fire.\nOver time, nurture the Child Pearl. As the saying goes: 'When the medicine is ripe, no fire-timing is needed; clinging to fire-timing will harm the elixir. Simply preserve it without loss—thirst, fatigue, hunger, and sleep will regulate themselves.'*\n\nAt the moment the elixir forms, one suddenly feels the spine surge upward to the Mud Pill Palace, a trickling sound arising, as if something brushes against the brain from the head. Momentarily, like sparrow eggs, pellets descend in succession through the *Heavy Tower*, cool as ice, sweet as butter, their savor incomparable. Sensing this, one has obtained the Golden Elixir of Return. Slowly swallow it into the cinnabar field without cease.\n\nThe five viscera grow crystalline and cold. With eyes closed, one inwardly observes the organs distinctly, as if illuminated by a candle. Gradually, myriad golden rays suffuse the body. After ten months of work, the Sacred Embryo is complete, and the spirit is refined to emerge from its vessel.\n\n**Emergence of the Spirit**\nSince ancient times, the emergence of the immortal’s spirit has followed no other method—this spirit is the original spirit of one’s own body. When qi is full, the spirit becomes numinous; when the spirit is numinous, it emerges naturally, unlike the methods of visualization.\n\nThe emergence of the yang spirit cannot be seen or known by ghosts and deities. If ghosts and deities can see or know it, it is of the same kind as the yin spirit, not the yang spirit. After three years and a thousand days of work, with cultivation complete and qi full, the spirit whole, one moves freely in and out.\n\nThe body outside the body is the Dharma-body: when gathered, it takes form; when dispersed, it becomes qi. It cannot be conceived or discussed in terms of form. The yin spirit, being formless, cannot divide itself or transform into forms. The yang spirit can manifest as one body or a hundred, each capable of eating and interacting. When reunited, they merge into one—what is called *\"sacred yet unknowable.\"*\n\nThe spirit’s concealment and manifestation are unfathomable, its transformations infinite. A thousand or ten thousand miles away, it arrives in an instant. Past and future events are all foreknown—only then can it be called the yang spirit.\n\nThe yang spirit’s emergence and return both occur through the Heavenly Gate. When the Heavenly Gate first opens, it feels like an axe splitting the brain—do not be startled. Like an infant gazing at the door, guard it in a secluded chamber, and do not emerge lightly. Initially, it circles to the left and right, turning to regard the spirit’s dwelling. When the spirit’s emergence is familiar, whether eyes are open or closed, one sees oneself.\n\nThen, let it come and go in the void. Begin with ten steps, then a hundred, then a thousand, gradually extending farther. When sending it out, immediately recall it. Over time, one may let it roam freely at will.\n\nWhen the spirit emerges, leave one spirit to watch the dwelling and command the guardian deities to protect and ward it. The guardian is the golden-armored deity within the brain. When emerging, entrust it to steady the top of the head, lest false apparitions, assuming names and forms, enter the spirit’s dwelling—do not permit their entry. Upon returning, call one’s own name, and they merge into one. Without three years and nine years of work, how could one reach this stage?\n\n**Verses from *Wuzhen Yipian***\n*\"The ethereal gathers and scatters—this is essence and soul.\nThe wise call it Qian and Kun.\nThe Dao of Change encompasses heaven and earth’s transformations;\nDo not cling to the ten thousand images in words and theories.\"*\n\n**Four Seasons**\n*\"Flowers bloom in four seasons at the four-point pavilion,\nThe wind carries their fragrance, wafting sweetness to all.\nI urge you to gather them in their proper time—\nDo not let the delicate reds scatter heedlessly.\"*\n\n**West River Moon**\n*\"The elixir is the wondrous treasure of the colored body,\nThe Dharma-body is the true heart.\nFrom the beginning, it has been without color or sound—\nOne entity, no need for dual recognition.\nThe ten thousand dharmas are neither nonexistent nor existent;\nNeither existence nor nonexistence—do not seek them.\nAbandon both extremes, abide in the center—\nThis is the supreme path to choosing the Buddha.\"*\n\n**Another Verse**\n*\"Principle has no past or present,\nThis heart—what joy, what anger?\nThe formless is the true form;\nThe colored body is the Dharma-body.\nNo need for half a phrase or a single word—\nIt enlivens a thousand, ten thousand people.\nAh!\nHere is the ultimate destination—\nWhy keep turning over the body?\"*\n\n**Stanzas on Returning the Elixir and Restoring Life**\n\n**Quatrains**\nThe altar rises in three tiers, eleven levels high,\nEight directions harmonize—earth is supreme.\nLord Ding relies wholly on the Yellow Dame’s power,\nNorth and south devour each other, restraining soul and spirit.\n\nGuarding the One within the altar, dust is left behind,\nEach line observed, each line perfected.\nThis heart resembles embers in chaff—\nIn silent sitting, the drip of water-clock is heard.\n\nFirst sprinkle divine water upon the Kun Palace,\nRaise the west, then merge with the east.\nTo know the Dao’s profound and subtle principle,\nThe sun shifts into the moon’s radiance.\n\nThe Gate of Mystery and Darkness—know it well,\nFew grasp it, fewer still begin.\nIf you still doubt the principle of longevity,\nGo ask the mulberry and gaze upon the plum trellis.\n\n**Five-Character Verses**\nHaving received the true immortal’s formula,\nWithin yin refine to utmost yang.\nWhere the earth’s thunder stirs in concealment,\nStars and constellations confer together.\n\nThe Eight Trigrams form the mother,\nThe Three Powers first appear in flourishing.\nNo longer troubled by the bonds of life and death,\nSurely you will perceive heaven and earth enduring.\n\nThe discourse on the Elixir Canon concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "丹经极论 经名：丹经极论。 不署撰人，疑出於南宋。 一卷。 底本出处：《正统道藏》 洞真部方法类。 丹经极论 真铅未有天地混沌之前，铅得一而先形，次则渐生天地，阴阳五行，万物众类。 故铅为天地之父母，阴阳之本元。 盖圣人采天地父母之根，而以阴阳母为丹母，如不能於其问生天地阴阳者，即非金液还丹之道。 若以天地阴阳之后所产五金八石，草木灰汁，晨霜夜露，雪浆冰水，诸杂物类而为者，不亦难乎！ ．同志之士，思之久而自悟，自非凿开混沌，见天地之根，擘破鸿蒙，视阴阳之母，无以议金液还丹之正道。 达者悟之，毋入旁门曲径耳。 真铅即真一之炁也，夫人元阳真炁，逐日走散，元由凝结而成圣胎，故圣人采真铅以制之，使凝结而成砂。 逐日运火，渐渐添汞，汞渐多，铅炁渐散，故抽铅添汞也。 十月功足，铅尽汞乾，化为金液还丹，则形化为纯阳矣！ ．铅是天地之火，父母阴阳之根基。 盖圣人采天地父母之根，而为大药之基； 采阴阳纯粹之精，而为大丹之质，且非常道造作也。 汞性好飞，遇铅乃结，以其子母留恋，未有天地混沌之前，真铅得一先形，以渐生天地阴阳，五行万物也。 以先天地之阳丹，点己之阴汞，立为纯阳矣！ 然后运在一身之内炼成金液还丹，以真造化在内，故曰内药内丹。 虽有自然真火在土釜之中，赫赫长红，亦须凭外炉勤功，增臧抽添，运用无令差戒，以至於殆也。 然内外真火，变化无穷，实藉真铅之妙绝也。 此物偏能擒汞，不使飞走，二药内外虽异，其实一用道也。 所以有内外二药者，人之一身，禀天道秀炁而有生，托阴阳陶铸而成形，故一身之中，以精气为本，神生於炁，炁生於精。 然此三屠，皆后天生一之炁，至阴之物也。 修真之士，无过冶炼精炁神而已，奈何三物俱后天生，纯阴而无阳，安能形化为纯阳，而出於天地之外耶？ 故祖师日：孤阴不能自产，当采先天之一炁，以真阴真阳，二八同类之物，擒在一时辰之内，炼成一粒至阳之丹，号日真铅。 造化在外，故曰外药。 以此阳丹，擒己阴汞，犹猫捕鼠。 阳丹是天地之母炁，己汞乃天地之子炁，以母炁伏子炁，岂非同炁乎？ 又云：未有天地混沌之前，真铅得一，而渐生天地阴阳，五行万物，此证金丹先天一炁也。 以先天阳丹点己阴汞，化为纯阳，更假阴阳符火，进退抽添，十月功足，形化为炁，炁化为神，神与道合而无形，变化不测，故能出乎天地之外，立乎造化之表，提挈天地，陶铸阴阳。 陶铸者，先天一炁之使然也，故日妙绝无过种子。 安可以后天后阴之炁类为内药耶？ 天地未分，形同鸡子，中混沌真一之炁，即炁铅也，故炁铅为天地万汇之先也。 太易太素之前，含灵至妙，未见萌兆； 太极太一之际，有物混成，中真一之精，为天地之祖，万物之始。 一炁既形，两仪斯析，然后有阴阳五行，三才万物众名。 故配乾坤为天地纪纲，运阴阳为造化崇钥，是以乾坤立而阴阳行乎其中矣！ ．金液大丹与造化同途，故以乾坤为鼎器，同其大冷，以坎离为药物，比其化权矣！ 夫神仙抱一之道者，上天所秘也，世人不可得之，乃太一含真之元。 太一者，太极、太渊之源，是虚无炼神之道。",
      "translated_text": "*The Ultimate Treatise on the Elixir Canon*\n\n*The Ultimate Treatise on the Elixir Canon* is a text of uncertain authorship, likely dating to the Southern Song dynasty. It comprises one scroll and is preserved in the *Zhengtong Daoist Canon* under the *Dongzhen* section, Methods category.\n\n**The Ultimate Treatise on the Elixir Canon**\n\nBefore the primordial chaos preceding heaven and earth, true lead existed in its nascent form, having attained the One. Thereafter, heaven and earth gradually emerged, followed by yin and yang, the Five Phases, and the myriad beings. Thus, lead is the parent of heaven and earth and the root of yin and yang. The sages extract the root of heaven and earth—the parents—and take the mother of yin and yang as the mother of the elixir. If one cannot comprehend that which gives birth to heaven, earth, yin, and yang, one has not grasped the Way of the golden liquid returning elixir. To use the Five Metals, Eight Stones, plant ashes, morning dew, frost, snow, ice, or other miscellaneous substances produced *after* heaven and earth and yin and yang as ingredients is surely difficult!\n\nThose of like mind, after long reflection, will awaken to this truth. Unless one cleaves open the primordial chaos to behold the root of heaven and earth, and splits the vast expanse to perceive the mother of yin and yang, one cannot discuss the true Way of the golden liquid returning elixir. Those who attain understanding will grasp this—beware of straying into side paths and crooked byways.\n\nTrue lead is the true qi of the One. The original yang qi of the human body scatters daily, and only by its coagulation can the sacred embryo form. Thus, the sages gather true lead to refine it, causing it to coagulate into cinnabar. Daily, they apply the fire, gradually adding mercury. As mercury increases, the qi of lead dissipates, hence the process of \"withdrawing lead and adding mercury.\" After ten months of practice, when lead is exhausted and mercury dried, it transforms into the golden liquid returning elixir, and the form becomes purely yang!\n\nLead is the fire of heaven and earth, the foundation of the parents yin and yang. The sages gather the root of heaven and earth—the parents—as the foundation of the great medicine, and extract the pure essence of yin and yang as the substance of the great elixir. This is no ordinary alchemical process.\n\nMercury’s nature is to flee, but it coalesces upon encountering lead, for mother and child cling to one another. Before the primordial chaos preceding heaven and earth, true lead attained the One and took form first, gradually giving rise to heaven and earth, yin and yang, the Five Phases, and the myriad beings. Using the pre-heaven yang elixir to refine one’s own yin mercury, one immediately becomes purely yang! Thereafter, refining within the body to produce the golden liquid returning elixir—since the true transformation occurs within—is called the \"inner medicine\" and \"inner elixir.\" Though the natural true fire blazes ceaselessly within the earthen crucible, one must rely on the external furnace, diligently applying the work of increasing, concealing, withdrawing, and adding, operating without error or negligence until completion. Yet the true fires—both inner and outer—undergo boundless transformations, all dependent on the wondrous efficacy of true lead.\n\nThis substance alone can capture mercury, preventing its flight. Though the two medicines—inner and outer—differ in form, their function is one and the same. The reason for inner and outer medicines lies in the fact that the human body receives the refined qi of the heavenly Way at birth and is shaped by the molding of yin and yang. Thus, within the body, essence and qi are fundamental, with spirit born of qi and qi born of essence. Yet these three treasures are all post-heaven qi, products of the utmost yin. For those who cultivate the truth, refining essence, qi, and spirit is paramount. However, since these three are all post-heaven and purely yin, lacking yang, how can they transform into pure yang and transcend heaven and earth?\n\nThus, the ancestral masters said: \"Lone yin cannot generate on its own. One must gather the pre-heaven qi of the One, using true yin and true yang—substances of the same kind in the ratio of two to eight—to capture them within a single moment, refining them into a grain of utmost yang elixir, called true lead.\" Since this transformation occurs externally, it is termed the \"outer medicine.\" Using this yang elixir to capture one’s own yin mercury is like a cat catching a mouse. The yang elixir is the mother qi of heaven and earth, while one’s own mercury is the child qi of heaven and earth. Using the mother qi to subdue the child qi—are they not of the same qi?\n\nIt is also said: Before the primordial chaos preceding heaven and earth, true lead attained the One and gradually gave rise to heaven and earth, yin and yang, the Five Phases, and the myriad beings—this proves that the golden elixir is the pre-heaven qi of the One. Using the pre-heaven yang elixir to refine one’s own yin mercury transforms it into pure yang. Further aided by the fire of yin and yang symbols—advancing, retreating, withdrawing, and adding—after ten months of practice, the form transforms into qi, qi into spirit, and spirit unites with the Dao, becoming formless and unfathomably mutable. Thus, one transcends heaven and earth, standing beyond creation, grasping and molding heaven and earth,",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1209,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.224177360534668,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\丹经极论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "一者炁也，人能行太一真炁，与我真气相济，包含太和，久而炼之，乃为大丹。 丹者，纯阳也，阳者，天道也。 故神舍道聚则成形，散则成炁，故与道相通者，道养炁。 养神者，保和天道也，故日精气相济，久而炼用，是谓纯阳炼形。 火者阳也，息者风也，以风吹火炼形，神形俱妙，故曰炼。 形炼形者，先须存心於内，真炁冲和，乃丹阳炁纯粹之精，运行不息，升沉往还，周而复始，包含万类，故乃丹阳也。 天炁降而复升，地炁升而复降，天之阳晶为日，地之阴晶为月。 若得斗柄之机，自然斡运日月，运行而无休息，乃纯阳炼神之道也。 修丹之士，采日月之精华，合阴阳之灵炁，周星数足，阴阳终尽，归功土德，而神精备矣！ . 乾道变化，各正性命。 夫变化之道，性自元中而有，必藉命为体，命自有中而无，必以性为用； 性因情乱，命逐色衰。 命盛则神全而性昌，命衰则性弱而神昏。 夫性者，道也，神也，用也，静也，阳中之阴也； 命者，生也，体也，动也，阴中之阳也。 斯二者相需，一不可缺，孤阳不立，孤阴不成，体用双全，方为妙道。 吕真人曰：了明空性不修丹，万劫阴灵难入圣。 窦真人曰：参禅尽欲言问悟，见性宁知梦裹，非却似狂猿捞水月，如何捉得月光归。 阳精是真一之精，至阳之气，号曰阳丹。 己之真炁属阴，为一身之主，以百骸。 乃阳丹自外来，以制己之阴汞，即是阳丹反为主，而己汞反为宾矣！ 二物相恋，结为金砂，自然不飞不走，然后加火，养缎成金液还丹也。 故阳丹在外，谓之疏； 己之阴汞在内，谓之亲。 反此亲疏，以定主宾，则道成矣！ 真道养神，若能守我在已死炁之关，令七祖枯骨，皆有生炁。 生我者道，活我者神，将神守之以，道养神，是也。 夫外药者，丹是也，造化炉中，烹炼真一之炁，功夫到时，只在半个时金辰，立得成就。 夫内药者，金液还丹是也，须十个月方能脱胎神圣。 此二药虽运阴阳造化相同，及其用功火候，实相远也。 外药火候 身心不动，呼吸自然，神气入於其根也。 闭极则失於急，纵放则失於荡，惟使其绵绵续续，勿令问断，然后神久自凝，息久自定。 其运火之功也，若烹小鲜，无过不及也。 一炁初萌，在乎不采之采，若存若亡→ 在乎微阳养稚阳，然后注意规中，息息归根，以意定炁，渐渐运火，一升一降，周而复始，不可泥定不运，而反成否塞。 所以阴阳运转，皆乾坤之妙用，罕有人达晓。 使天地不运转，则一气停积，万物不生； 人若不运转，则一气否塞，不产丹药。 岂得与天地同其长久也？ 一终之功，数在九转，进火久之，觉得神炁微冲，火候全，清明在躬，阴阳分，即宜退火温养顷时。 然后复进火，渐至烹炼，致虚极，守静笃，身心合，神炁交，百骸九窍如浴起，夹脊双关似火，然后可谓纯阳矣！ 修炼之士，在临机圆活，知进退，存亡不失，其为圣人也。 内药运功 真一之炁，官然无形，若不得二八阴阳之炁相交，安能降格，兆形黍粒者？ 却得此黍粒之丹，吞饵之后，若不能得阴阳火氤氲，安能变化金液丹哉？ 真一之炁，在造化炉中，被真火缎，光透帘帏，金华满室，乃真阴真阳，炼二炁交合，产成黍粒之丹。 吞入腹内丹田",
      "translated_text": "The One is qi. If one can circulate the true qi of the Great One, harmonizing it with one’s own true qi, embracing the Supreme Harmony, and refining it over time, this becomes the Great Elixir. The Elixir is pure yang, and yang is the Dao of Heaven. Thus, when spirit abandons the Dao and gathers, it takes form; when it scatters, it becomes qi. Those who commune with the Dao are nourished by the Dao through qi.\n\nTo cultivate spirit is to preserve harmony with the Dao of Heaven. When essence and qi mutually sustain one another and are refined over time, this is called \"refining the form with pure yang.\" Fire is yang, and breath is wind. Using wind to blow fire refines the form, and both spirit and form attain subtlety—this is called \"refinement.\" To refine the form with form, one must first concentrate the mind within, allowing true qi to surge in harmony. This is the pure essence of yang qi, circulating without cease, ascending and descending, cycling endlessly, embracing all things—thus it is yang of the Elixir.\n\nHeaven’s qi descends and then ascends; earth’s qi ascends and then descends. The yang essence of heaven crystallizes as the sun, and the yin essence of earth crystallizes as the moon. If one grasps the mechanism of the Dipper’s handle, one naturally revolves the sun and moon, circulating without rest—this is the Dao of refining spirit with pure yang. Those who cultivate the Elixir gather the essence of the sun and moon, unite the numinous qi of yin and yang, and when the cycle of stars is complete and yin and yang are exhausted, they return the merit to the virtue of earth, and spirit and essence are perfected.\n\nThe transformations of the Qian Dao establish the nature and mandate of all things. The Dao of transformation arises from the primordial within nature, yet it must rely on mandate as its body; mandate emerges from the existent within the non-existent, yet it must employ nature as its function. When nature is disturbed by emotions, mandate declines with desire. When mandate is flourishing, spirit is whole and nature thrives; when mandate wanes, nature weakens and spirit dims.\n\nNature is the Dao, spirit, function, stillness, and yin within yang; mandate is life, body, movement, and yang within yin. These two depend on each other—neither can be lacking. Solitary yang cannot stand, and solitary yin cannot form. Only when body and function are both complete does the wondrous Dao emerge.\n\nMaster Lü said: \"Enlightening empty nature without refining the Elixir, even after ten thousand kalpas, the yin spirit will struggle to attain sagehood.\" Master Dou said: \"Seeking awakening through Chan, exhausting words to inquire into realization—seeing nature, how could one know it is like a dream? It is no different from a mad monkey grasping at the moon’s reflection in water. How can one seize the moon’s light and bring it back?\"\n\nYang essence is the essence of the True One, the qi of utmost yang, called Yang Elixir. One’s own true qi belongs to yin and governs the entire body with its hundred bones. When the Yang Elixir arrives from without to subdue one’s yin mercury, the Yang Elixir becomes the master, and one’s mercury becomes the guest. When these two long for each other, they congeal into golden sand, naturally neither flying nor fleeing. Then, with the addition of fire, they are nurtured and tempered into the Golden Elixir of Return.\n\nThus, the Yang Elixir is external and called \"distant\"; one’s own yin mercury is internal and called \"intimate.\" Reversing this intimacy and distance to determine master and guest—this is how the Dao is accomplished! The true Dao nourishes spirit. If one can guard the self at the barrier where qi dies, even the withered bones of seven generations will be infused with life qi. That which gives me life is the Dao; that which animates me is spirit. To guard spirit with the Dao and nourish spirit with the Dao—this is the way.\n\nThe external medicine is the Elixir. In the crucible of creation, the true qi of the One is refined. When the work is complete, success is achieved in half a double-hour. The internal medicine is the Golden Elixir of Return, which requires ten months to complete the spiritual embryo’s gestation.\n\nThough these two medicines operate through the same yin-yang transformations of creation, their methods of applying fire and timing differ greatly. For the external medicine, the fire timing requires the body and mind to remain unmoving, breath to be natural, and spirit and qi to enter their root. If closure is too extreme, it becomes strained; if release is too indulgent, it becomes scattered. Only by maintaining unbroken continuity can spirit naturally congeal and breath naturally settle.\n\nThe work of circulating fire is like cooking a small fish—neither excessive nor insufficient. When the initial qi sprouts, it lies in the \"gathering without gathering.\" It exists yet does not exist—this is nurturing the tender yang with subtle yang. Then, focus attention within the compass, with each breath returning to the root. With intention, stabilize qi, gradually circulating fire in ascent and descent, cycling endlessly. One must not rigidly fixate on stillness, lest it lead to blockage.\n\nThus, the revolutions of yin and yang are the wondrous workings of Qian and Kun, yet few comprehend them. If heaven and earth did not revolve, qi would stagnate, and the myriad things would not arise. If a person does not revolve, qi becomes blocked, and the Elixir cannot be produced. How then could one attain the same longevity as heaven and earth?\n\nA single cycle’s work is completed in nine revolutions. After prolonged firing, one feels a subtle surge of spirit and qi. When the fire timing is complete and clarity resides within, yin and yang separate—then one should withdraw the fire and nurture it for a time. Then, resume firing, gradually refining until extreme emptiness is attained and profound stillness is maintained. Body and mind unite, spirit and qi merge, the hundred bones and nine orifices feel as if bathed, and the twin gates of the spine blaze like fire—only then can one be called pure yang.\n\nThose who cultivate refinement must be fluid in seizing the moment, knowing when to advance and retreat, preserving or relinquishing without loss—they become sages.\n\nFor the internal medicine’s work: The true qi of the One is formless and indistinct. Without the union of the two eights’ yin and yang qi, how could it descend and manifest as the grain-like form of the Elixir? Yet even after ingesting this grain-like Elixir, without the misty warmth of yin-yang fire, how could it transform into the Golden Elixir?\n\nThe true qi of the One, within the crucible of creation, is tempered by true fire. Its light pierces the curtains, and golden radiance fills the chamber. This is the true yin and true yang refining the union of the two qi, producing the grain-like Elixir. When swallowed and carried into the cinnabar field of the abdomen...",
      "overlap_context": "at the golden elixir is the pre-heaven qi of the One. Using the pre-heaven yang elixir to refine one’s own yin mercury transforms it into pure yang. Further aided by the fire of yin and yang symbols—advancing, retreating, withdrawing, and adding—after ten months of practice, the form transforms into qi, qi into spirit, and spirit unites with the Dao, becoming formless and unfathomably mutable. Thus, one transcends heaven and earth, standing beyond creation, grasping and molding heaven and earth,",
      "start_char": 1209,
      "end_char": 2432,
      "start_sentence": 43,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.95934724807739,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\丹经极论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "中，点化阳魂，以消阴魄也。 当斯时，一炁运归身中，由泥丸而下，但之觉五内清冻，金光透体，成功在乎一时之问。 及在内，却有十月之功，运用乎抽添，防危虑险，所谓井底泥蛇舞拓枝，窗问明月照梅梨，夜来混沌撷落地，万象森罗总不知，正此时也。 得此丹经极论阳丹，点己阴汞之后，在乎虚心运火，忘情谐和，运阴阳合乎呼吸，以呼吸用神炁，以神炁用水火，以水火用胎息，绵绵游泳，坎离交合，而生金液也。 运阴阳造化之机，不以初功，既升而由泥丸而下，所谓下镇人身泥丸绛宫，中理五炁，混合百神，则忘炁以养神，仍直下也，轻轻然运默默举。 其诀日： 专炁致柔，能如婴儿除垢整念，静心守一，外想不入，内想不出，终日混沌，如在母腹。 神定以会乎炁，炁和以合乎神，神即炁而凝，炁恋神而住。 於寂然大休歇之场，恍兮无何有之乡，灰心冥冥，如鸡抱卵，似鱼在水，呼至於根，吸至於蒂，绵绵若存，再守胎中之一息也。 更在屏尘绿，绝视听，少饮食，不睡眠，则腾腾任运，任运腾腾，不可着於持守，不可泥於进火。 久久之后，要温养子珠，正谓药熟不须行火候，泥於火候必伤丹，只须保养无亏损，渴饮困眠饥便准。 运丹生成之际，忽觉夹脊上冲泥丸，沥沥有声，从头似有物触上脑，须央如雀卵，颗颗自愕下重楼，如冰酥香甜，甘美之味无比。 觉有此状，乃得金液还丹。 徐徐咽归丹田不绝。 五脏清冻，闭目内观，藏府历历如照烛，渐次有万道金光透体也。 十月功足，圣胎圆成，调神出壳。 出神 自古神仙出神，别无他法，神即我身之元神。 炁足则神灵，神灵则自出，非比存想之法。 阳神之出，鬼神不可得而见，不可得而知。 鬼神可知可见者，则与阴神同类，非阳神也。 三年千日之功，存养既成，炁足神全，出入自由。 身外之身，即法身，聚则成形，散则成炁，不可以形迩拟议。 阴神即无形边，不能分身化形； 阳神可以一身百、十身，各各可以饮食，可以应酬至，合之又复一，所谓圣而不可知之谓。 神隐显莫测，变化无穷，千里万里，须臾即到； 过去未来之事，一一皆先知，方可谓之阳神。 阳神出入，皆由天门，天门初开时，如大斧劈脑，不可惊动，如婴儿顾门，密室圣护，未可轻出。 初出於左右盘旋，回顾神室舍屋，神出熟时，开眼闭眼，我皆自见。 然后使去来在空，始亦须自十步，以至百步，至千步，渐渐放出，放出之际，即收回。 久久之后，方可任意远出。 神出之时，须留一神看舍，及祝斓卫护戒之神。 守之一神是脑中金甲神人，出时当分付与吾托定顶门，恐有假名托象，入我神舍，不可放入。 吾归即呼我姓名，便合为一，非在三载九年之功，安能至此哉！ 悟真遗篇 氤氲聚散本精魂，知者名为乾与坤，易道范围天地化，莫将万象执言论。 四序花开四点亭，风吹香气喷人馨，劝君采取依时节，莫使娇红取次零。 西江月 丹是色身妙宝，法身即是真心，从来无色亦无音，一体不须两认。 万法非无非有，有无亦莫搜寻。 二边俱遣弃中心，选佛斯为上品。 又 一理无今无古，此心何喜何瞋，无相乃为真相，色身即是法身。 不消一句半句，活得千人万人。 咦！ ．这裹便是到头，何须只管翻身。",
      "translated_text": "Within, it transmutes the yang soul to dissolve the yin corporeal spirit. At this moment, the singular qi circulates back into the body, descending from the Mud Pill Palace, and one feels the five viscera grow crystalline and cold, golden light suffusing the entire form—success hinges upon this instant.\n\nYet within the body, there remains the work of ten months: applying the methods of withdrawal and addition, guarding against danger and foreseeing peril. This is the time described as *\"the mud-snake in the well dances on the mulberry branch, the moon at the window illumines the plum and pear; in the night’s chaos, the earth crumbles, yet the ten thousand images remain unseen.\"*\n\nHaving obtained this elixir, the scriptures expound at length on the yang elixir. After it has transmuted one’s own yin mercury, one must operate the fire with an empty mind, harmonizing without attachment. The union of yin and yang is governed by breath; breath is directed by spirit-qi, spirit-qi by water and fire, and water and fire by fetal breathing. Flowing ceaselessly, Kan and Li merge, giving birth to the Golden Elixir.\n\nThe mechanism of yin-yang transformation does not rely on initial effort. Once ascended, it descends from the Mud Pill Palace—what is called \"settling below to stabilize the human body’s Mud Pill and Crimson Palace, regulating the five qi and harmonizing the hundred spirits.\" Here, one forgets qi to nourish spirit, continuing downward in a gentle, silent ascent.\n\nThe oral instruction states:\n*\"Concentrate qi to attain suppleness, like an infant free of filth and scattered thoughts. Still the mind and guard the One; external perceptions do not enter, internal perceptions do not depart. All day, remain in primordial chaos, as if within the womb.\nSpirit settles to meet qi, qi harmonizes to unite with spirit. Spirit congeals with qi, and qi clings to spirit to abide.\nIn the realm of profound stillness and great rest, in the boundless expanse of nothingness, the heart is ashen and obscure, like a hen brooding her eggs, like a fish in water. Exhale to the root, inhale to the stem, continuously preserving it—guard the single breath within the womb.\nFurther, withdraw from worldly dust, sever sight and sound, reduce food and drink, and abstain from sleep. Then, in effortless motion, let it move of itself, and in self-moving effortlessness, do not cling to holding or guarding, nor fixate on advancing the fire.\nOver time, nurture the Child Pearl. As the saying goes: 'When the medicine is ripe, no fire-timing is needed; clinging to fire-timing will harm the elixir. Simply preserve it without loss—thirst, fatigue, hunger, and sleep will regulate themselves.'*\n\nAt the moment the elixir forms, one suddenly feels the spine surge upward to the Mud Pill Palace, a trickling sound arising, as if something brushes against the brain from the head. Momentarily, like sparrow eggs, pellets descend in succession through the *Heavy Tower*, cool as ice, sweet as butter, their savor incomparable. Sensing this, one has obtained the Golden Elixir of Return. Slowly swallow it into the cinnabar field without cease.\n\nThe five viscera grow crystalline and cold. With eyes closed, one inwardly observes the organs distinctly, as if illuminated by a candle. Gradually, myriad golden rays suffuse the body. After ten months of work, the Sacred Embryo is complete, and the spirit is refined to emerge from its vessel.\n\n**Emergence of the Spirit**\nSince ancient times, the emergence of the immortal’s spirit has followed no other method—this spirit is the original spirit of one’s own body. When qi is full, the spirit becomes numinous; when the spirit is numinous, it emerges naturally, unlike the methods of visualization.\n\nThe emergence of the yang spirit cannot be seen or known by ghosts and deities. If ghosts and deities can see or know it, it is of the same kind as the yin spirit, not the yang spirit. After three years and a thousand days of work, with cultivation complete and qi full, the spirit whole, one moves freely in and out.\n\nThe body outside the body is the Dharma-body: when gathered, it takes form; when dispersed, it becomes qi. It cannot be conceived or discussed in terms of form. The yin spirit, being formless, cannot divide itself or transform into forms. The yang spirit can manifest as one body or a hundred, each capable of eating and interacting. When reunited, they merge into one—what is called *\"sacred yet unknowable.\"*\n\nThe spirit’s concealment and manifestation are unfathomable, its transformations infinite. A thousand or ten thousand miles away, it arrives in an instant. Past and future events are all foreknown—only then can it be called the yang spirit.\n\nThe yang spirit’s emergence and return both occur through the Heavenly Gate. When the Heavenly Gate first opens, it feels like an axe splitting the brain—do not be startled. Like an infant gazing at the door, guard it in a secluded chamber, and do not emerge lightly. Initially, it circles to the left and right, turning to regard the spirit’s dwelling. When the spirit’s emergence is familiar, whether eyes are open or closed, one sees oneself.\n\nThen, let it come and go in the void. Begin with ten steps, then a hundred, then a thousand, gradually extending farther. When sending it out, immediately recall it. Over time, one may let it roam freely at will.\n\nWhen the spirit emerges, leave one spirit to watch the dwelling and command the guardian deities to protect and ward it. The guardian is the golden-armored deity within the brain. When emerging, entrust it to steady the top of the head, lest false apparitions, assuming names and forms, enter the spirit’s dwelling—do not permit their entry. Upon returning, call one’s own name, and they merge into one. Without three years and nine years of work, how could one reach this stage?\n\n**Verses from *Wuzhen Yipian***\n*\"The ethereal gathers and scatters—this is essence and soul.\nThe wise call it Qian and Kun.\nThe Dao of Change encompasses heaven and earth’s transformations;\nDo not cling to the ten thousand images in words and theories.\"*\n\n**Four Seasons**\n*\"Flowers bloom in four seasons at the four-point pavilion,\nThe wind carries their fragrance, wafting sweetness to all.\nI urge you to gather them in their proper time—\nDo not let the delicate reds scatter heedlessly.\"*\n\n**West River Moon**\n*\"The elixir is the wondrous treasure of the colored body,\nThe Dharma-body is the true heart.\nFrom the beginning, it has been without color or sound—\nOne entity, no need for dual recognition.\nThe ten thousand dharmas are neither nonexistent nor existent;\nNeither existence nor nonexistence—do not seek them.\nAbandon both extremes, abide in the center—\nThis is the supreme path to choosing the Buddha.\"*\n\n**Another Verse**\n*\"Principle has no past or present,\nThis heart—what joy, what anger?\nThe formless is the true form;\nThe colored body is the Dharma-body.\nNo need for half a phrase or a single word—\nIt enlivens a thousand, ten thousand people.\nAh!\nHere is the ultimate destination—\nWhy keep turning over the body?\"*",
      "overlap_context": " the grain-like form of the Elixir? Yet even after ingesting this grain-like Elixir, without the misty warmth of yin-yang fire, how could it transform into the Golden Elixir?\n\nThe true qi of the One, within the crucible of creation, is tempered by true fire. Its light pierces the curtains, and golden radiance fills the chamber. This is the true yin and true yang refining the union of the two qi, producing the grain-like Elixir. When swallowed and carried into the cinnabar field of the abdomen...",
      "start_char": 2432,
      "end_char": 3680,
      "start_sentence": 90,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.106826305389404,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\丹经极论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "还丹复命遗篇 绝句 坛自三层十一一楼，八方和合土为尊，丁公全藉黄婆力，南北相吞制魄魂。 守一坛中已绝尘，一爻看过一爻成，此心却似糠灰火，静坐时闻滴漏声。 须将神水洒坤宫，先举西来后合束，要知大道希夷理，太阳移在月明中。 玄牝之门切要知，几人下手几人稀，君还不信长生理，但去桑问看梅架。 五言 受得真仙诀，阴中炼至阳，地雷潜 动处，星斗共商量。 八卦看成母，三才 始见昌，不愁生死系，定觉地天长。 丹经极论竟",
      "translated_text": "**Stanzas on Returning the Elixir and Restoring Life**\n\n**Quatrains**\nThe altar rises in three tiers, eleven levels high,\nEight directions harmonize—earth is supreme.\nLord Ding relies wholly on the Yellow Dame’s power,\nNorth and south devour each other, restraining soul and spirit.\n\nGuarding the One within the altar, dust is left behind,\nEach line observed, each line perfected.\nThis heart resembles embers in chaff—\nIn silent sitting, the drip of water-clock is heard.\n\nFirst sprinkle divine water upon the Kun Palace,\nRaise the west, then merge with the east.\nTo know the Dao’s profound and subtle principle,\nThe sun shifts into the moon’s radiance.\n\nThe Gate of Mystery and Darkness—know it well,\nFew grasp it, fewer still begin.\nIf you still doubt the principle of longevity,\nGo ask the mulberry and gaze upon the plum trellis.\n\n**Five-Character Verses**\nHaving received the true immortal’s formula,\nWithin yin refine to utmost yang.\nWhere the earth’s thunder stirs in concealment,\nStars and constellations confer together.\n\nThe Eight Trigrams form the mother,\nThe Three Powers first appear in flourishing.\nNo longer troubled by the bonds of life and death,\nSurely you will perceive heaven and earth enduring.\n\nThe discourse on the Elixir Canon concludes.",
      "overlap_context": "e neither nonexistent nor existent;\nNeither existence nor nonexistence—do not seek them.\nAbandon both extremes, abide in the center—\nThis is the supreme path to choosing the Buddha.\"*\n\n**Another Verse**\n*\"Principle has no past or present,\nThis heart—what joy, what anger?\nThe formless is the true form;\nThe colored body is the Dharma-body.\nNo need for half a phrase or a single word—\nIt enlivens a thousand, ten thousand people.\nAh!\nHere is the ultimate destination—\nWhy keep turning over the body?\"*",
      "start_char": 3681,
      "end_char": 3906,
      "start_sentence": 136,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.5531957149505615,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\丹经极论.txt",
        "category": "方法类"
      }
    }
  ]
}