{
  "source_id": "丹道吕洞宾",
  "source_file": "chunked_daozang\\丹道吕洞宾.json",
  "total_chunks": 34,
  "total_original_chars": 22257,
  "total_translated_chars": 111169,
  "total_translation_time": 587.5219256877899,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\丹道吕洞宾.txt",
    "category": "藏外"
  },
  "full_translation": "The Pure Yang Patriarch of the Lǚ Dòngbīn Alchemical Dao\nAnnotated by Fù Jīnquán of the [Qing] Dynasty\n\nI. *The Yellow Crane Rhapsody*\n\nProfound indeed! The supreme vehicle is that of non-action and non-striving.\nThe Reverted Elixir’s sevenfold return arises only when movement yields to stillness.\n\n[Annotation: The Dao is divided into three vehicles: the initial, the intermediate, and the supreme. Upon reaching the supreme vehicle, there is nothing to be done. From the Three Passes, one reverses course—upon the thunderous departure from the womb, returning once more to the origin of the first year—where sound and scent dissolve entirely, and vastness merges with the Great Void. Should the true face of *qián*-Primordial ever emerge, the Buddhists call this the realization of true suchness, thereby revealing that the initial and intermediate vehicles necessarily involve action.\nThe Reverted Elixir is the elixir that was originally one’s own. *Reversion* signifies returning from without to within, from the other back to the self, a departure that reverts, a loss that is regained. Seven is the complete number of fire; yang’s movement reaches its extreme and turns to stillness, while yin’s stillness reaches its extreme and turns to movement. Movement and stillness propel one another, each serving as the root of the other. The art of elixir refinement lies in seeking the impulse of movement within the depths of stillness. As Master Shào said: “Between one movement and one stillness lies the utmost subtlety of heaven, earth, and humanity.”]\n\nThe superior virtue preserves form through the Dao, for it is the unbroken *qián*-Primordial.\nThe lesser virtue extends life through technique, for it is the *kǎn*-Abyssal already formed.\n\n[Annotation: The *Dao De Jing* states: “Superior virtue does not act as virtue; lesser virtue does not lose virtue.” The immortal teachings say: “Form is preserved through the Dao; life is extended through technique.” One must first possess the technique to connect with life before attaining the Dao to preserve form. The unbroken *qián*-Primordial is the undefiled body of a virgin child. Should one encounter a sagely master, no foundational work of life-connecting is needed—one may proceed directly to the ten-month practice. Yet such an occurrence is rare across kalpas. Should one expend even a single drop of essence, the body becomes leaky.\nFor those in whom the *kǎn*-Abyssal is already formed, one must first undertake the hundred-day practice of refining essence into *qi*, followed by the ten-month gestation.]\n\nThus, the Dao of yin and yang is employed, relying on worldly methods for cultivation.\nThe method of transcending the world imitates the procreation of man and woman, yet it must awaken the celestial mechanism to discharge the celestial mechanism.\n\n[Annotation: The *Book of Changes* states: “The alternation of yin and yang is called the Dao.” *The Rootless Tree* says: “Apart from the Dao of yin and yang, nothing is complete.” This Dao necessarily pairs yin and yang, uniting water and fire. People see those who enter mountains to dwell in stillness, abstaining from marriage and office, and assume this is the way of cultivation. Yet the Dao resides among humanity, not within mountains. The Buddha said: “I cultivated the Way in the five turbid evil worlds and attained the Great Dao.” One seeks to transcend the world through cultivation, yet the method of transcendence is sought within worldly methods. The so-called worldly methods are the everyday affairs of ruler and minister, father and son, husband and wife, elder and younger brothers, and friends. Human procreation gives birth to sons and daughters; the elixir-refiner emulates this. Ancestor Zhāng Sānfēng said: “Following the birth of people, one reverses to birth the elixir.” A single phrase surpasses countless thousands—no more talk of desiccated sitting in quiescent non-action.\nThe *celestial mechanism* is the celestial root. Only by awakening the celestial root can one penetrate and discharge this celestial mechanism.]\n\nTo cultivate both nature and life in tandem, one must rely on the dual application of method and wealth.\n\n[Annotation: Without life, nature cannot stand; without nature, life cannot be complete. Initially, one cultivates life through nature; ultimately, one completes nature through life. From beginning to end, this is merely the full realization of the two characters *nature* and *life*—necessarily cultivated together, never singly. The Ancestor did not say: “Cultivating only nature without life is like adorning a dull chime with black gold; cultivating only life without nature is like a mirror reflecting a face without a precious glass.” He also said: “Cultivating only nature without life is the foremost illness in practice. Cultivating only the ancestral nature without the elixir, the yin spirit of ten thousand kalpas will hardly enter sagehood.” Xiāo Liǎozhēn said: “Cultivating both nature and life is the true transmission—profound, obscure, and mysterious.” People only understand solitary cultivation in stillness; they do not comprehend the wondrous principle of dual cultivation. Departing from yin and yang, turning away from creation, there can be no accomplishment. If one wishes to practice dual cultivation, one must rely on the mutual support of method and wealth. *Method and wealth* refers to resources within the method. *Dual application* means both are employed to their fullest. This is essential from the outset, hence the phrase *must rely*.]\n\nFirst, unite like-minded companions as assistants;\nNext, seek a great household to secure a favorable plan.\n\n[Annotation: Ancestor Zhōnglí said: “Wealth is not difficult to obtain; a companion is hard to find.” The *Cantong Qi* states: “The two sevens gather, assisting the practitioner.” Yíng Chánzǐ said: “Aides of like mind cannot be lacking; three of one heart must carefully support one another.” Tiān Láizǐ said: “To refine the elixir, one must find friends—three of like mind guarding one another. Without companions of the same aspiration, the great medicine will hardly form, and mercury will escape.” The *Essentials of the Golden Elixir* states: “One must select three fellow disciples as aides, mutually dependent.” Xue Daoguang said: “Three of one mind must guard against peril.” The *Song of the Cauldron* says: “Three people of one heart must be employed.” Across thousands of scriptures and ten thousand classics, all speak of three people—never has there been one who practiced alone.\n*Seeking a great household to secure a favorable plan* means that to pursue this endeavor, one must rely on a great household. The common saying goes: “The golden elixir emerges from the wealthy.” Immortal Shí Xìnglín instructed Xue Zǐxián: “Go to a bustling metropolis and rely on someone of influence.” The *Essentials* state: “One must depend on a powerful household for inner support and outer protection.” Zhāng Zǐyáng achieved success only after obtaining Mǎ Dūyùn; Xue Daoguang completed the elixir only after meeting Zhāng Huánwèi.\nFirst unite like-minded companions, then seek the opportune moment—proceeding step by step, one cannot expect sudden success without years of effort.]\n\n】 Yet those who aspire to the supreme Dao must secretly knock upon the Mysterious Pass.\n*[Annotation: When worldly people seek this most authentic Dao, its principles are subtle, its methods secret—rarely heard or known. There exists a mechanism most profound and wondrous; one must secretly inquire of the master and inwardly seal it in the heart.]*\n\nChoose an auspicious site and guard the secrecy of the work; prepare the alchemical chamber and ensure the vessels are properly matched.\n*[Annotation: An \"auspicious site\" is a blessed place; \"guarding secrecy\" means reverently attending to the work with utmost discretion, never daring to reveal it. Ancestor Dānyáng said: \"Select companions, select resources, seek a blessed site.\" Master Shàngyáng said: \"With companions and resources, much external protection—why must one retreat to deep mountains to become immortal?\" Only with such a site may one then establish the alchemical chamber, where all vessels and implements must be properly matched. \"Properly matched\" means harmoniously paired.]*\n\nSetting the furnace and erecting the crucible symbolize inner and outer—two Qian and Kun, heaven and earth. Refining the self and laying the foundation fortify both the personal realm and the state.\n*[Annotation: Method, resources, companions, and site—lacking any one, success is impossible. Only when all four are complete may one set the furnace and erect the crucible. The crucible emulates heaven and earth, hence the metaphors of the Qian furnace and Kun crucible, or inner and outer crucibles. *The True Principle of Heavenly Immortality* states: \"The outer crucible refers to the form of the elixir field; the inner crucible refers to the qi within the elixir field.\" Qian and Kun are called \"two,\" and these two are divided into inner and outer. The Ancestor said: \"Two layers of heaven and earth, four phases of yin and yang.\" Once the crucible is prepared, one proceeds to refine the self and lay the foundation. Without refining the self, the foundation cannot be laid; if the foundation is not laid, refining the self is in vain. Ancient teachings say: \"Cultivation has its stages; refining the self is boundless.\" *Essentials of the Golden Elixir* states: \"Gathering the medicine is easy; refining the self is most difficult.\" One must ensure the spirit is harmonious, the mind ashen, and the will settled. *The True Principle of Heavenly Immortality* says: \"If unity is achieved, the foundation is laid; if unity is not achieved, the foundation cannot be laid.\" The ancients often compared the state to the human body: the heart as ruler, qi as minister, essence as the people. When essence is whole and qi abundant, it is called \"a prosperous state with contented people.\" *Awakening to Reality* says: \"Only when the people are content and the state prosperous may one seek battle; after battle, one may behold the sage.\" \"The people content and the state prosperous\" means the foundation is laid. The body is divided into self and other—how could the crucible and furnace not be inner and outer?]*\n\nAt the critical juncture, face circumstances without attachment, relying on the courage of keen vigor. Generally, temper the furnace and forge the sword, drawing upon the softness and hardness of Metal and Water.\n*[Annotation: At the outset of practice, the crucial moment lies in facing circumstances without attachment. Confronting them yet unstained, one truly transcends worldly passions and forgets self and other. When beginning, all thoughts are emptied, the mind wholly devoted—entirely dependent on this resolute, keen, and courageous qi, may success be possible. *Essentials of the Golden Elixir* states: \"With courage, success comes easily; with indolence, it is hard to achieve.\" The pivot of refining the self with Jade Liquid, the essence of forging the sword with Metal and Water—these are the spiritual roots of heaven and earth, the skeletal framework of yin and yang. Only when tempered to radiant sharpness may one soar as a spirit and walk as a sage. At the time of the third and fifth phases, the divine peak is keen and bright, hardness and softness responding in rhythm. The Ancestor said: \"A flying spirit-sword with two edges—yet the returned elixir falls at the peak’s summit.\" \"Tempering the furnace\" means applying fire gently.]*\n\nIn operation, in withdrawal and addition, when encountering peril, one must bathe;\n\nWhen plucking the zither or tapping bamboo, upon encountering contention, it is fitting to embrace the feminine. *[Note: The celestial gate lies in the hand, the earthly axis moves with the heart—pivoting yin and yang, steering the transformations of creation, wielding the mechanism of heaven and earth’s opening and closing, practicing the method of sun and moon’s union. Withdrawing lead and adding mercury, the curtain’s light shines through; the lead cauldron glows gently as dragon and tiger meet at the Magpie Bridge. At this moment, great peril arises—one must withdraw the fire, halt the talismans, and perform the work of bathing. Bathing means washing the heart and retiring into concealment. *The True Transmission of the Golden Elixir* states: \"Bamboo must be tapped, the zither must be plucked.\" *A Sprig of Flowers* says: \"Amidst the blossoms, I tap bamboo and pluck the zither, my heart serene as water.\" *Essentials* says: \"First tap bamboo to rouse the dead, then pluck the zither to harmonize the sound.\" *Awakening to Reality* says: \"Tap bamboo to summon the tortoise to swallow purple mushrooms, pluck the zither to call the phoenix to drink the elixir pellet.\" Tapping bamboo empties the heart; plucking the zither fills the belly. The classic says: \"Water flows downward and does not contend—this is truly embracing the feminine.\" Laozi says: \"Never strive to be first, but always follow others.\" *Awakening to Reality* says: \"I urge you: in battle, do not underestimate the enemy.\" And again: \"Let them take the lead; I shall be the guest.\" This is the essence of non-contention. Facing Qian and Dui, reversing husband and wife—here lies the meaning of harmony and accord. After a hundred days, the work becomes spiritually responsive, bending and straightening as circumstances demand. After a year, the work matures, and pursuit and absorption become effortless. *[Note: *The Jade Emperor’s Heart Seal Scripture* says: \"When the returning wind blends, a hundred days bring spiritual efficacy.\" *Essentials of the Golden Elixir* says: \"After a hundred days of work, marvelously seizing the celestial cycle, one bends and straightens, responding to things with spiritual agility.\" A year is roughly stated—ten months plus Mao and You. Xue Daoguang says: \"In the first year, bathing guards against peril; in ten months, regulation requires careful moderation.\" *The Song of Gathering Gold* says: \"In ten months, diligently swallow the elixir.\" By this time, the embryo is formed and the fruit ripens—pursuit and absorption follow the heart. This is what is meant by \"three hundred days of fire, ten months of gestation.\" The spirit leaves the body, coming and going at will, erasing the record of death and attaining the rank of immortality—only awaiting the refinement of the spirit to emerge from the shell. Then follows three years of nursing and nine years of wall-facing.]*]*\n\n\"One steals the generative qi within that destructive force to infuse one’s own yin essence within yang. *[Note: The Dao is the mechanism of theft. From the depths of yin, one steals the utmost yang—thus the *Classic of the Hidden Correspondence* says: 'This mechanism of theft—none in the world can see it, none can know it.' This Dao unites water and fire in one palace, employing life and death interchangeably. The generative qi is sought within this destructive qi. Master Shangyang said: 'There is a blade that kills, and a technique that revives.' The *Awakening to Reality* says: 'If one can turn this mechanism of life and death, disaster transforms into fortune in the turn of a palm.' It also says: 'If one understands the mechanism of killing and its reversals, one knows that harm conceals grace.' The Three Powers steal from one another, seizing the mechanism of Heaven and Earth to attain longevity and deathlessness. Now, what I possess is the yin essence within yang. As *Awakening to Reality* states: 'The yin essence within yang is not firm in substance; cultivating this single element only leads to delusion and weakness.' One must obtain the generative qi within that destructive force to infuse it. Thus it is said: 'If only the essence of Kan infuses the cavity of Li, pure Qian can then embrace the flying jade.' Stealing from that to infuse this—how clear this is, yet why do people not ponder it deeply?]*\n\nThe Jade Liquid and Golden Liquid perfect one’s nature and one’s life respectively; the two phases and four phases are half in Kan and half in Li. *[Note: The Jade Liquid perfects nature, the Golden Liquid perfects life. The *Essentials of the Golden Elixir* says: 'The Jade Liquid’s returning elixir is wondrously subtle, relying entirely on the Golden Liquid to refine mortal lead.' It also says: 'Through forging the sword and grafting, one attains eternal spring and longevity of ten thousand years.' It further states: 'The great Dao of the Golden Elixir lies wholly in the communion of spirit. The subtle mechanism of the Jade Liquid has no other wondrous technique.' The six phases of one hour: the first two phases gather the medicine, the latter four phases nurture it. As it is said: 'Two phases to gather the pearl, four phases to refine the spiritual work.' Half in Kan, half in Li—this does not mean dividing the six phases between Kan and Li. Rather, Li is empty while Kan is full; Li is yang within yin, Kan is yin within yang. Thus it is said: 'Take the solid center from the Kan position, infuse it to transform the yin within the Li palace.']*\n\nAt first, one brings nonbeing into being, and already the dragon resides in the tiger’s position; in the end, one flows Wu into Ji, and only then does one know the tiger meets the dragon’s palace. *[Note: The *Token for the Agreement of the Three* says: 'Being and nonbeing interpenetrate; above, the spirit-virtue resides.' Nonbeing is nature, being is life. Bringing nonbeing into being is the initial work of entry, cultivating life through nature. Nature is the Azure Dragon, life is the White Tiger. Exploring the tiger’s den, plucking the tiger’s whiskers, seeking the tiger’s marrow—thus the tiger’s den becomes the dragon’s abode. Ji is yang earth, Wu is yin earth; the two earths form the jade tablet. The *Crane Grove* says: 'Flowing Wu acts as the matchmaker to approach Ji; metal returns to nature, celebrating the bridegroom.' The White Tiger is metal within water; the Azure Dragon is wood within fire. Wood and fire share a palace, metal and water become companions. These two entities contain the Four Images; their union in the mysterious palace coalesces the elixir.']*\n\nLü Dongbin, the Pure Yang Patriarch of the Dao of the Elixir—*Five Chapters*\"\n\nTo discern the maturity of medicinal substances, one must distinguish the clarity or turbidity of the water’s source.\n\n[**Note:** The true work of gathering the medicine hinges on distinguishing maturity. *The Orthodox Principles of Heavenly Immortals* states: \"If the true work is unclear, though one gathers, there is no medicine to gather. If the medicinal *qi* has not yet reached pure yang, though one knows to gather, the medicine will not be gathered. For if it is too tender, the *qi* is insufficient; if too old, the *qi* has already dispersed—neither can form the elixir. The so-called water’s source arises from the Heavenly One’s generation, prizing clarity and purity, not filth and turbidity, and this also depends on the stillness and stability of the mind. An ancient song says: *When intent is settled and spirit at ease, the water’s source is clear; when intent is scattered and spirit confused, the water’s source is turbid.* Discernment must be constant and meticulous, execution precise, allowing no trace of blindness or ignorance.]\n\nThose who refine the self and await the moment must wait for yang to arise in the Red County; those who encounter urgency at the furnace must ensure *gui* stirs within the Divine Continent.\n\n[**Note:** *The Spring at Miluo* says: \"The sevenfold return of the elixir first requires refining the self and awaiting the moment. When the first yang stirs, that is the time. Awaiting the moment means waiting for its arrival. The Red County is like the Red Water. The Dark Pearl of Red Water may be obtained in due time. Thus, when facing the furnace and its conditions, one must await the true moment. Those who encounter urgency act immediately upon arrival, for the moment must not be lost. *Gui* stirring refers to the time of *gui*’s arising. *Awakening to Reality* says, *'When lead encounters *gui* arising, gather it swiftly.'* *The Song of Gathering Gold* states: *'Know when *gui* is born, recognize when *gui* appears—thirty-six hours, two and a half days.'* Yang arises in the Red County, *gui* stirs in the Divine Continent. How can one who seeks the furnace and sets the tripod remain ignorant of this?\"]\n\nWhen one observes the dragon in the field, one must fiercely refine and intensely forge; when one suddenly hears the tiger’s roar emerging from its den, one may invert and reverse the process.\n\n[**Note:** The *Book of Changes* says: *\"Seeing the dragon in the field is beneficial for meeting the great person.\"* This is the second yang line of *Qian*, the perfect time for withdrawal and addition, requiring fierce refining and intense forging. It is not like the first yang line, the hidden dragon, which is too tender, nor the third yang line, which has already formed a substance and is unfit for gathering. *Awakening to Reality* says: *\"The White Tiger of Western Mountain rages wildly; the Azure Dragon of Eastern Sea cannot be withstood. Seize them with both hands and make them fight to the death, transforming into a lump of purple frost.\"* *The Four Hundred Words on the Golden Elixir* states: *\"The dragon comes from the Eastern Sea; the tiger rises from Western Mountain. The two beasts battle fiercely, transforming into the marrow of heaven and earth.\"* Inverting yin and yang, reversing the workings of creation, blowing the *xun* wind, fanning the bellows, from the Great Mysterious Pass, flowing backward to the Heavenly Valley Cavern, golden essence pierces the crown, silver streams surge like the sky, wind stirs in the Mud Pill Palace; the Crimson Palace shines with moonlight, the Magpie Bridge emits auspicious fragrance, sweet dew descends, the hundred vessels return to the origin, the nine passes are thoroughly opened—this is what is meant by *\"When the union of Qian and Kun ceases, a single point falls into the Yellow Court.\"*\n\nThe fire compels the metal to move and exit the Kun furnace, hence the name \"seven returns\"; the metal, refined by fire, returns to the Qian tripod, called the \"nine refinements.\"\n\n[**Note:** The metal is the medicine. *The Kinship of the Three* says: *\"When metal returns to its nature, it may then be called the returned elixir.\"* *The Guide* states: *\"Fire compels metal to move, inverting the natural order.\"* *The True Blind of Chanting the Dao* says: *\"People know fire overcomes metal, but do not know metal truly loves fire. Before metal leaves the ore and departs the furnace, without fierce fire compelling it, it cannot ascend.\"* Thus it is said: the seven returns are cinnabar returning to its origin; the nine refinements are golden liquid returning to its source. Seven is the number of fire; nine is the number of metal. Exiting the Kun furnace, returning to the Qian tripod, one gives and one receives, forming the return and refinement. One is nature, one is emotion, and this is called extracting from Kan to fill Li, returning essence to replenish the brain, illuminating the Li cavity, restoring the robust body of Qian—all refer to this meaning.]\n\nThe \"return\" is the substance Qian lost and has now regained; the \"refinement\" is the true self that departed and has now returned.\n\n[**Note:** The precelestial Qian and Kun transformed into the postcelestial Kan and Li, meaning the middle line of Qian was lost. Now, taking the solid center of the Kan position and using it to transform the yin within the Li palace, what Qian lost is now returned to Qian—I am Qian. From the beginning of the primordial chaos, what was lost has now returned to its original state. Is this not what departed and has now come back?]\n\nLittle do they know that following the natural order gives rise to humans and beings, while reversing it produces immortals and buddhas.\n\n[**Note:** The phrase *\"little do they know\"* means it is easily understood. Laozi said: *\"My Dao is very easy to know, very easy to practice; yet the world cannot know it, cannot practice it.\"* Heaven and earth share the same root with me; the myriad things share the same body with me. Humans are the most spiritually endowed of all beings and grow alongside them. Thus, humans and beings are collectively named. To know the principle of becoming immortals and buddhas is initially no different from the principle of giving rise to humans and beings—only the distinction between following and reversing matters. Following gives rise to the ordinary; reversing produces the sage—this is ancient teaching. Master Tuo Yang’s *Entering the Mirror of Fire* says: *\"Following produces humans; reversing produces the elixir. Grasping this principle, one becomes an immortal.\"* *The Rootless Tree* states: *\"Following makes one ordinary; reversing makes one an immortal—only a reversal in between.\"* *A Single Stroke* says: *\"If you know the origin of your birth, you will understand that creation lies in your hands.\"* Zhang Ziyang said: *\"When the five phases follow the natural order, the common Dao has birth and death; when the five phases reverse, the elixir tripod remains eternally numinous and enduring.\"* *The Complete Methods of the Numinous Treasure* says: *\"When humans first receive the essence and blood of their ordinary parents, they are turbid and chaotic, without form.\"*]\n\nWhen the essence and blood settle, in the first month a gestational sac forms; in the second, the embryo takes shape; in the third, the hun-soul arises; in the fourth, the po-soul is fixed; in the fifth, the five viscera divide; in the sixth, the six bowels open; in the seventh, the seven orifices become clear; in the eighth, the eight luminous scenes are complete; in the ninth, the limbs are fully formed; in the tenth, the qi is whole—then the fetus emerges and is born.\n\nThe Way of the Returned Elixir largely follows this pattern. At the moment one receives the wondrous qi of the numinous father and sagely mother, the nine must harmonize with the ten before the metallic qi begins to arrive. It too is turbid and chaotic, an empty vastness of numinous clarity—no color or depth to rely upon, no form or shadow to depend on. The primordial qi rests in tranquility; the five phases scatter and spread, filling the encompassing expanse, silently congealing and merging. Drifting and roaming in luminous cultivation, it returns to the origin and reverts to emptiness; gathering and condensing in dense support, it conceives and nurtures the true, gives rise to the five viscera, orders the five qi, unites the hundred spirits, and knits the fetal immortal—this is called the yang-spirit.\n\nThough it distinguishes self from other, it is in no way the chamber arts of bedroom alchemy.\n\nShould one cling to the solitary self, how could one grasp the Peng bird’s mechanism for soaring south?\n\nThough the distinction between self and other is already clear—where one steals the life-qi from the other’s midst of slaying to refine the yin essence within one’s own yang—this is further expounded here. While self and other are distinct, the process is upright and luminous, far from base, murky, or obscure. Observe the world: what does not follow the principle of duality? Where there is heaven, there is earth; where there is sun, there is moon; where there is yin, there is yang; where there is male, there is female; where there is self, there is other. Then consider cold and heat, day and night, purity and turbidity, movement and stillness, hardness and softness, husband and wife, female and male—is there anything singular that lacks its counterpart? To deny this is to lose the principle.\n\nThe ancestral masters, in their compassion to deliver the world, feared that people might misconstrue this principle as the chamber arts of bedroom alchemy, the consumption of filth, or the tactics of \"bedroom warfare\"—these are the delusions of hell-bound fools who fail to comprehend the matter of self and other. Thus, they reiterate: though there is a distinction between self and other, it is not that sort of affair.\n\n*Master Zhuang* says: \"In the Northern Darkness there is a fish, and its name is Kun. The Kun’s greatness—no one knows how many thousand *li* it spans. It transforms into a bird, and its name is Peng. The Peng’s greatness—no one knows how many thousand *li* it spans. When this bird stirs, it will migrate to the Southern Darkness.\" The Kun and Peng are metaphors for the vastness of the Dao, transforming into a bird, transmuting qi to ascend. From north to south, from other to self. The self is *li*, the Vermilion Bird of the south, containing within it the Wood-fluid Azure Dragon; the other is *kan*, the Dark Warrior of the north, containing within it the Metal-essence White Tiger.\n\nThe ancestral masters, in their mercy, feared that people would rigidly fixate on heart and kidneys, groping within the confines of their own bodies, and thus fail to understand Master Zhuang’s meaning of \"soaring south.\" *A Single Stroke* says: \"They say destiny lies within this body of mine—who realizes that the solitary self possesses nothing? This wondrous art, this mechanism, fundamentally involves the distinction between self and other; it is not the affair of a solitary self.\"\n\nWithin *kan* resides a speck of black lead, called the primordial—without its kindred, it can never be obtained; within *li* dwell sevenfold vermilion cinnabar-mercuries, yet without the true seed, they vanish in an instant.\n\n[Annotation: The *Cantong Qi* states: \"The *kan*-male is the sun, the *li*-female the moon; the sun bestows virtue, the moon unfurls its light. The moon receives the sun’s transformation, its body unharmed and unwaning.\" The single speck of true yang within *kan* is the black lead, the essence of mysterious water, the primordial true qi. The single speck of water-mercury within *li* is cinnabar, the essence of grand yang, the primordial true fluid. The *Lingbao Bifa* says: \"Heaven-one generates water, and within *kan* lies lead; Earth-two generates fire, and within *li* arises cinnabar.\" Embracing the essence of Heaven-one, it stands as the chief of the five essences—this is black lead. Lead gives birth to silver, lead is silver’s mother; receiving the qi of grand yang, it becomes the foremost among all stones—this is cinnabar. Within cinnabar is born mercury, mercury the child of cinnabar. Hard to obtain is the silver within lead, easy to lose is the mercury within cinnabar. The ancestral masters, in their compassion, pointed out that to seek this speck of black lead, one must search among its kindred. The *Cantong Qi* says: \"Kindred easily yield to effort, without the seed skill avails not.\" Again: \"Attaching to kindred accords with nature, things form readily through refinement.\" Again: \"Kindred follow one another, affairs contrary yield no treasure.\" Again: \"Yin and yang intermingle, seeking their kindred.\" Ancestor Sanfeng said: \"All else apart from this kindred is madness.\" The *Jieyao* states: \"Only with kindred is success easy; lacking the elixir’s wealth, it cannot be achieved.\" The *Wugenshu* says: \"Kindred align, work proceeds well.\" Without kindred, solitary yin cannot generate, and the day of obtaining lead will never come.\n\nThe *li* trigram is yang without and yin within—this is the self. Its sevenfold seven apertures emit the fluids. Ancestor Zhongli said: \"Within the human body, inside and out, all is yin. What is the yang essence, the true seed? It is the primordial true qi—black lead.\" Mercury’s nature is volatile and hard to restrain. The *Cantong Qi* says: \"Ghosts hide, dragons conceal, none know where they abide.\" Yet when a speck of primordial true lead arrives, true mercury naturally abides, no longer flying away. Like a cat pouncing on a mouse, like a hare meeting a hawk, it becomes docile of its own accord.\n\nThus, one borrows Qian and Kun to establish the crucible and furnace, seeking the true qi contained within the Great One, relying on yin and yang as the means to pursue the mysterious pearl stored in the Water Palace.\n\n[Annotation: Qian and Kun possess the names of crucible and furnace; the crucible and furnace bear the designations of medicinal substances. This Way borrows the false to cultivate the true, turning the false into the true. The *Bai Ju Zhang* says: \"Others know not our Way—clearly, the false is made real.\" Borrowing Qian and Kun as metaphors, one forcibly names them crucible and furnace. The *Fuming Pian* says: \"The crucible—originally, there is no crucible.\" It also says: \"This medicine has no furnace, only a crucible; one crucible transforms into ten thousand crucibles.\" Borrowing Qian and Kun as the names for crucible and furnace, one employs the imagery of the *Yi* to clarify the principles of the elixir Way. Yet one must grasp the image and forget the words—one cannot cling to the text or be bound by the symbol.\n\nThe true qi of the primordial Great One cannot be sought without the crucible and furnace; the crucible and furnace cannot manifest their imagery without Qian and Kun. Without understanding yin and yang, there is no way to begin. Thus, yin and yang are truly the means for refining the elixir. The trap is for catching fish; the snare is for capturing hares—such is the method. The mysterious pearl is the elixir. This pearl lies concealed within the Great Abyss of the Northern Culmen. To seek it, one must thoroughly penetrate yin and yang and deeply comprehend the workings of creation. Like the trap for fish or the snare for hares, one may then grasp it, avoiding futility and failure.]\n\nIn fleeting moments, swift as a breath, the broken line of Qian is mended; in an instant’s transformation, the six hollows of Kun are restored. [Note: \"Fleeting moments\" and \"instant’s transformation\" denote the swiftness of the process. This speaks to the ease of returning the elixir. The *Xinyin Jing* states: \"Preserve the void, guard the existent—accomplished in an instant.\" From the first union of yin and yang, the middle line of Qian enters Kun to become Kan; the middle line of Kun enters Qian to become Li. Now, drawing forth the single yin from Li to fill the single yang in Kan, Li is restored to Qian, and Qian’s flaw is no more. Having extracted the one line from Kan to mend Li into Qian’s three unbroken lines, Kun in turn withdraws the two broken lines from Li, returning to its six hollows. The *Guizhi* says: \"From this, the robust form of Qian is transformed—hidden or soaring, all lies within the heart.\"]\n\nAt this point, the heart returns to the chamber of spirit, and one is ranked among the Heavenly Immortals; the elixir descends into the Yellow Court, and a thousand spirits bask in serenity. The August Emperor bestows praise, and heaven and earth stand in awe. [Note: \"At this point\" signifies the attainment of this stage. Here, qi gathers and spirit is whole, the heart settles and spirit congeals, the heart empties and spirit becomes numinous. *Zhuangzi* says: \"Its heavenly guard is complete, its spirit without flaw.\" The *Yinfu Jing* states: \"The spirit that does not act as spirit, breathless yet ever-breathing, is ranked among the heavenly offices as an Upper Perfected.\" Once the fire of the numinous root is kindled and the pearl from the sea’s depths is returned, a single elixir drops into the Yellow Court. At this time, qi coalesces and spirit solidifies, the hun rests and the po is stilled; the entire body harmonizes, and the hundred vessels brim with spring. The Heavenly Lord is at peace, and the myriad spirits obey his command. The August Emperor bestows praise, honoring his valor. Heaven and earth stand in awe, deeming it rare. The *Wuzhen Pian* says: \"Countless divine dragons are utterly astonished.\"]\n\nLü Dongbin, the Pure Yang Patriarch of the Five Chapters, embraced the origin and guarded the One, nurturing it for ten months—spirit took form, and he refined it. Facing the wall, he sat in oblivion, and after nine years, his body transcended form. [Note: The *Jindan Jieyao* states: \"When the nation is prosperous and the people at peace, the Dao is already achieved—then one should face the wall to nurture the original spirit. When the nine transformations are complete, ascend to heaven, and forever become a Heavenly Immortal, enjoying boundless spring.\" After returning the elixir, one proceeds to nurture it. Embracing the original spirit and guarding the true One, the fire of the great celestial cycle must not be interrupted in the slightest. By the time the tenth month’s work is complete, a spirit emerges from the Mud Pill Palace above the crown, and a body exists beyond the body. The Ancestor of the Mud Pill Palace says: \"In the tenth month, the fetal immortal emerges, borne by thunder and lightning as a golden dragon.\" \"Refining the spirit\" means that at every step, one must remain vigilant—this is the work of nursing, requiring three years. Thereafter, one selects an auspicious mountain, a blessed site, an ancient relic, or a numinous altar—where water encircles and mountains pay homage, where qi gathers and wind is stored. Beside the clouds, one constructs a chamber, sits in profound stillness, and forgets form. Form and spirit become wondrous, merging with the true Dao. Water and fire cannot harm, blades and weapons cannot injure. When merit is fulfilled in three thousand deeds and the time of nine years arrives, transformations become effortless, and the eight directions present no barrier. One may then move mountains and overturn seas, traverse earth and reach heaven, aid the world and pacify the people, punish the wicked and eliminate harm. Awaiting the celestial decree’s descent, one ascends in broad daylight, attaining the highest rank of Heavenly Immortals. Equal in grandeur to heaven and earth, in radiance to sun and moon, and in longevity to the cosmos, this is the supreme first vehicle.\n\nThe Great Dao of Heavenly Immortals is the work of true heroes—only the greatest of heroes and most extraordinary of talents may undertake it.\n\nThe inception of this Daoist art appears heterodox yet is fundamentally orthodox; within its firing process from beginning to end, it resembles the deployment of extraordinary military strategy.\n\nAt the outset of its practice, from the very first steps, there lies a wondrous technique for connecting with life and prolonging years. This art is profoundly esoteric—*The Awakening to Reality* states that it begins with deliberate action yet remains unseen by ordinary men. It belongs entirely to proper and orthodox practice, never licentious or absurd. *The Three-Character Formula* says:\n*\"Spoken, it is ugly;\nPracticed, it is marvelous.\nAll despise it,\nEach one mocks it.\"*\nBai Yuchan observes: *\"Reveal it, and people will surely laugh.\"* *The Gourd Song* declares:\n*\"Practiced, it is marvelous;\nSpoken, it is ugly—\nFools laugh till their mouths split.\"*\nThough the words seem absurd and the deeds bizarre, who would not mistake it for heterodoxy?\n\nAs the saying goes:\n*\"The wicked practice orthodoxy, and even orthodoxy becomes wicked;\nThe upright practice heterodoxy, and even heterodoxy becomes upright.\"*\nYet the heart remains pure and undefiled, without the slightest impropriety—only the outward traces may seem suspicious.\n\nAs for the firing process: it begins with field combat and ends with defending the city. There are methods for achieving victory through surprise and images of battle and triumph. *The Rootless Tree* states: *\"Dragon and tiger mount the altar for a single battle.\"* *The Awakening to Reality* says: *\"In application, one must divide left and right armies—let them be the host while I remain the guest.\"* Bai Ziqing remarks: *\"Only after the spiritual battle concludes can one behold the sage.\"* *\"Heroes act in due time, and weapons secure great peace.\"*\n\nLead and mercury lack the Elder of Fire (Bing); east and west remain divided.\nInfant and Maiden lack the Yellow Dame (Huangpo); though close as a foot and a span, they stand apart.\n\n[Annotation: The Elder of Fire is fire. Refining lead and mercury cannot succeed without fire. The Wood-mercury of the east and the Metal-lead of the west are utterly estranged—only with the fire of bing and ding can they be harmonized, so that instead of mutual conquest, they give birth to one another. *The Awakening to Reality* states: *\"Wood’s nature loves Metal’s righteous compliance; Metal’s disposition cherishes Wood’s benevolent kindness. Devouring each other, they grow intimate—only then does the man conceive.\"* *The Emerald Writ* says: *\"Infant Boy and Maiden Girl are sundered as if by the ends of the earth; only by relying on the Yellow Dame to entwine them both.\"* *The Single Branch* says: *\"Moved only when the Yellow Dame beckons, awaiting only when the Maiden opens her lotus.\"* *The Song of Tapping the Hexagrams* says: *\"When the Yellow Dame matches them in perfect union, the moment is flawless, the transmission sealed.\"* *The Mirror for Taking the Medicine* says: *\"Entrust the Yellow Dame to woo the Maiden Girl—lightly, silently, she lifts them together.\"* The Yellow Dame is the deputy marshal of the elixir chamber, utterly indispensable. Without her, though they stand as near as a foot and a span, their affinity is thwarted, their passions discordant, and they remain askew, unable to unite.]\n\nMaster the urgent and the gradual, weigh fortune and misfortune—all rests in the craftsman’s hand, to measure and deliberate.\nDiscern advance and retreat, know when to halt and when to be content—how could the ignorant ever succeed?\n\n**[Annotation: The crux of elixir-refinement lies in the four characters—*gradual, urgent, auspicious, inauspicious*—which demand the most thorough familiarity and deliberation.\nTo *hold the city* is gradual; *field combat* is urgent.\n*Tempering and nurturing* is gradual; *gathering the medicine* is urgent.\n*Vital qi* is auspicious; *lethal qi* is inauspicious.\n*Yang qi* is auspicious; *yin qi* is inauspicious.\n*The Mirror for Taking the Medicine* says: *\"Receive qi auspiciously, guard against its turning inauspicious.\"*\n*The Waking to Reality* says: *\"Hold the city or wage field combat—know fortune and misfortune, and you may fill the crucible with numinous cinnabar.\"*\nOnly when this is deeply understood and practiced with mastery may one be called a *craftsman’s hand*.\n*To measure and deliberate* means to act with precision, never straying from the plumb line.\n*The Rootless Tree* says: *\"The craftsman’s hand, firm at the helm, lets the ocean’s waves churn below.\"*\n*The Single Branch of Flowers* says: *\"Wield the craftsman’s hand to sail upstream—such is the meaning here.\"*\nZhang Quanyi says: *\"Yang fire advances, turning from the left; yin tally retreats, spiraling to the west.\"*\nMaster Qiu Changchun’s *Secret Formula of the Microcosmic Orbit* states: *\"From Zi to Si, the six yang employ nine, thirty-six breaths to gather, take in, and ascend. From Wu to Hai, the six yin employ six, twenty-four breaths to retreat, descend, refine, and simmer.\"*\n*Advance and retreat* are thus *ascent and descent*.\n*The Orthodox Principle of Celestial Immortality* says: *\"When the mechanism of inhalation closes, I turn to Qian, taking ascent as advance. When the mechanism of exhalation opens, I turn to Kun, taking descent as retreat.\"*\nMaster Chongxu says: *\"Advance and retreat are but empty metaphors—truly, no advance or retreat is seen.\"*\nZhang Ziyang says:\n*\"Before refining the returning elixir, refine swiftly;\nOnce refined, know when to halt and be content.\nIf you cling to excess with an insatiable heart,\nYou will not escape ruin and disgrace one day.\"*\nXiao Liaozhen says: *\"Beware—do not proceed with firing recklessly;\nWithout knowing when to halt, you court collapse and peril.\"*\nThis speaks of ceasing the fire once the elixir is formed—a principle of profound subtlety.\nWithout the true master’s direct instruction, even the brightest and wisest may struggle to comprehend it.\nHow could the ignorant ever succeed?]**\n\nRecognize the ebb and flow as the tides of the sea, ever faithful to their time;\nGauge the workings of creation by the waxing and waning of the sun and moon.\n\n[**Note:** The character *xin* (信, \"faithfulness\") is the grand path of all truth and sages. *Zhuangzi* says: *\"There is sentiment, there is faithfulness; there is non-action, there is formlessness.\"* *The Hundred Verses* says: *\"Within this lies true faithfulness—when it arrives, even the lord must be startled.\"* The midnight and noon never err; the tides keep their appointed hours. *The Mirror of Entering the Medicine* says: *\"Heaven responds to the stars, earth responds to the tides.\"* Bai Yuchan says: *\"Beneath the earth, the sea’s tides; above the sky, the moon.\"* *The Essential Instructions* says: *\"When the time comes, await the tide’s sign—when the moon rises in the west.\"* By this, one measures faithfulness, and thus the principle of ebb and flow may be recognized at its source.\n\nThe sun and moon are the two luminaries of yin and yang. When qi issues forth as light, the moon borrows the sun’s radiance to shine. By the sun’s direct or slanted illumination, the moon’s spirit and body wax and wane. From this principle of waxing and waning, one may gauge the mechanism of creation.\n\nOn the third day, the moon emerges in the west—this is the first yang born in the Kan position. On the fifteenth, the moon is full in the east—then the six lines complete the Qian trigram’s primordial origin. [*The True Classic Song* says: *\"On the third day, Zhen emerges in the west; by the winding river, the moon’s brilliance shines.\"* *The Union of the Three* says: *\"On the third day, it emerges bright, Zhen receives the west; on the eighth, Dui receives the south, the upper arc straight as a cord; on the fifteenth, the Qian body is complete, full and flourishing in the east.\"* *The Awakening to Reality* says: *\"On the southwestern path, the moon’s brilliance shines—from here the great medicine is born.\"* The great medicine is the returning first yang. This yang arises within the Kun body, emerging from pure yin. The full moon in the east: Qian contains *jia* and *ren*, Kun contains *yi* and *gui*; *jia*-wood and *geng*-metal face each other and become full. *The Union* says: *\"When the three and five virtues are complete, the Qian body is formed, the six lines revolve in harmony.\"* *The Book of Changes* says: *\"Transforming and moving without constraint, it flows through the six voids.\"* *The Union* says: *\"Flowing through the six lines, it is difficult to perceive.\"* This describes how the two trigrams Qian and Kun revolve through the six trigrams, and how the central lines of Kan and Li revolve through the six lines. Qian and Kun give birth to the six children, each receiving one line from their central lines—thus it is said that without their central lines, they are incomplete.]\n\nSplit open the golden aperture, cleave the primordial chaos, revealing the innermost truths of Laozi and Zhuangzi;\nClarify the bellows and flute, drink the knife’s measure, spilling the heart and liver of Zhang Baiduan.\n\n[**Note:** Unlocking the secret treasury of the golden lock, cleaving open the primordial chaos, one fully exposes the profound mechanisms of the *Daodejing* and *Nanhua*, the innermost truths of Laozi and Zhuangzi. The bellows and flute refer to the crucible. That with a base is the bellows; that without is the flute. The bellows of heaven and flute of earth are like the zither and flute, like the gourd. To drink the knife’s measure, first clarify the bellows and flute. *The Mirror of Entering the Medicine* says: *\"Drink the knife’s measure, glimpse heaven’s art.\"* *The Union* says: *\"Crush it into one pill—nothing is more divine than the knife’s measure.\"* The Perfected Zhang Baiduan, styled Pingshu, composed *The Awakening to Reality*, baring his liver and gall, spilling forth the true teachings.]\n\nThus enlightening the friends who wander amidst mist and clouds, unveiling the hidden secrets of dragon and tiger.\n\n[Annotation: Among those who wander amidst mist and clouds, many possess enlightened talents. Those with the aspiration to cultivate the Dao yet lack the opportunity to receive its methods—by reading this rhapsody, their long-cherished resolve may be fulfilled, and their wisdom awakened. This is not merely an exercise in parallel prose, but a revelation of the true essence of the supreme Dao, an unveiling of the hidden principles of dragon and tiger.]\n\nEach seeks the firing times, early to ingest the millet-pearl.\nIn the Jasper Pool’s mystic gardens, hope stirs for another day.\n\n[Annotation: Those with resolve must each seek their own karmic conditions, practice the secrets of the firing times, and ingest the pearl of millet. The Jasper Pool’s mystic gardens, the three thousand weak waters—none but the flying immortals may reach them. Yet by cultivating in accord with this rhapsody, that hope shall not be difficult to attain. *The Union* says: *\"Mount the white crane, ride the dragon’s scales; roam the Great Void, pay homage to the Immortal Lords. Receive the celestial chart, be named a Perfected One.\"* It also says: *\"When the Great One summons, remove to the Central Continent. With merit complete, ascend on high, receive the register and chart.\"*]\n\nWithout thought, stillness may arise;\nin stillness, qi finds its balance.\nWhen qi is balanced, breath comes to rest;\nwhen breath rests, it naturally returns to the root.\nReturning to the root, one perceives original nature;\nperceiving nature, one begins to be true.\n\n[Those who cannot attain stillness are bound by thoughts. Before one thought subsides, another arises—ten thousand cares surge ceaselessly, without a moment’s respite from youth to old age. How rarely is even a single breath of clarity known? To cultivate stillness, first enter through the cessation of thought. When thoughts are exhausted, passions and desires dissolve, and the heart-mind becomes pure. With the heart-mind purified, qi naturally harmonizes, like fish in a spring pond, like insects in hibernation—steaming and unfolding in boundless subtlety, its qi balanced. Over time, the in-and-out breath stabilizes, returning to its root, and breathing ceases entirely. As the *Perfected One* dwells in the deep abyss, floating and roaming within the compass of the rule, in ceaseless continuity, utterly serene—this is qi returning to the central pole, revolving without end, not truly without breath. When breath returns to the root, stillness settles into quiescence. At the utmost point of quiescence, original nature manifests, and the light of wisdom arises spontaneously. Original nature is the primordial spirit of one’s true destiny. The Buddha said: *\"Seeing nature, one becomes a Buddha—this is called attaining the Dao.\"* Yet there is nothing to attain; attaining nothingness is true attainment.]\n\nThe myriad beings bear no scent;\nbeneath the earth, one hears thunder roar.\nAscending to the summit of Kunlun,\nthe path behind must be kept clear.\n\n[When all conditions are stilled and sounds and scents vanish into boundless obscurity, the moment of returning movement arrives—suddenly, thunder bursts forth from the earth. The *Alchemical Classic* says: *\"Earth’s thunder shakes the mountain’s peak; rain washes the yellow sprout as it emerges from the soil.\"* This is true yang revealing itself, blazing like fire, raging like a scorching wind. The *Yellow Court Classic* says: *\"Within is a true person, crowned in golden cloth, bearing armor and talismans to open the seven gates.\"* This is no branch or leaf—it is the root itself. At this time, the river chariot is set in motion, crossing the Tail Gate, passing the twin barriers of the Spine Pass, ascending the Jade Pillow to reach Kunlun. This is the work of rising behind and descending before—one must keep the path distinct, never hasty or careless.]\n\nDescend the mountain to meet the Magpie Bridge,\nescorting it down to the Yellow Court.\nWithin the court, the *Yi*’s hexagrams unfold—\nfifty-five, perfectly balanced.\n\n[The elixir, descending from the summit of Kunlun, hangs from the upper palate, crosses the Magpie Bridge, passes the Towering Chambers, and is escorted to the Yellow Court, where it comes to rest. The Yellow Court is the divine chamber of the central palace. At this time, wind stirs in the Mud Pill, the moon shines in the Crimson Palace, kidney qi ascends, sweet dew descends, and all is returned to the earthen cauldron—wind calms, waves still, the nation at peace, the people secure. *\"Unfolding the hexagrams of the *Yi* within the court\"* refers to the three hundred eighty-four lines of the hexagrams and the three hundred eighty-four grains of firing time, modeling Qian and Kun, pairing Kan and Li, moving water and fire—all this is the unfolding. The fifty-five: the heavenly number is five, the earthly number is five; the five positions interact and each finds its harmony. The heavenly numbers total twenty-five, the earthly numbers thirty. All the numbers of heaven and earth sum to fifty-five—this is how transformations are accomplished and the spirits are set in motion. *\"Balanced\"* means harmonious alignment, serving as the method for refining the elixir, teaching one to seek its image through heaven and earth.]\n\nQi rolls forth to fill the four great elements;\nsit or lie—watch as you proceed.\n\nThis is the principle of foundation-laying—\nlone yin cannot ascend.\n\n*[The four great elements fill the body,\nall is qi’s repletion, nowhere incomplete.\nIt rolls and unfurls with the times,\nflowing through the four limbs—\nthe four limbs need no explanation.\n\"Sit or lie—watch as you proceed\":\nThe* Jindan Jieyao *says:\n\"Two bodies sit facing, the two luminaries appear before you.\"\nThe* Zhixuan Pian *says:\n\"Together on the bed, build the ladder to heaven\"—\nthis may be done sitting, or lying down as well.\nThis is the principle of foundation-laying:\nknow that lone yin does not generate,\nsolitary yang does not grow.\nIf one cultivates alone in stillness,\nhow can ascent and descent be achieved?]*\n\nNext, forge the spirit-sword—\nthree years to refine the self and succeed.\nThoughts upright, passions forgotten utterly,\nbefore the furnace, the spirit remains unmoved.\n\n*[This sword is not cast of bronze or iron—\nit is the sword of wisdom.\nThe alchemical classics say:\n\"Emerging from being, entering non-being—\nthe three-exhaustion sword;\nthe elixir of immortality—\na single pellet.\"\nThose who refine the elixir\nmust first forge the sword\nbefore they can gather the medicine.\nOnly when the work of refining the self is complete\nmay the elixir be returned.\nRefining the self means:\nupright thoughts present,\nwayward intentions absent,\npassions forgotten, forms transcended,\nstaking one’s life in the effort.\nBefore the furnace, when the work begins,\nthe primordial spirit remains unmoved,\nthe heart wholly devoted—\nthis is the work of refining the self,\nthis is the method of forging the sword.]*\n\nSeek and purchase the vessels of the elixir chamber—\nfive thousand forty-eight springs.\nFirst observe the third night of the month,\nwhen the moth-browed moon first appears in the *geng* direction.\n\n*[The vessels of the elixir chamber\nare not easily obtained.\nThey must be bought with money,\nsought with effort,\nbefore they can be acquired.\nThese vessels must correspond\nto the number of the* Zangzhen Jing*—\nfive thousand forty-eight scrolls.\nOnly this true classic\nreveals, on the third night of each month,\na crescent moth-browed new moon\nin the* geng *direction—\nthis is the radiance of golden essence,\nthe time when the great medicine is about to emerge.\nThe* Qinyuan Chun *says:\n\"The warm lead cauldron,\nlight piercing the curtains.\"\nTo witness the* geng *flower appear,\nturn back to seek the moth-browed moon.\nThus gather true lead—\neach word must be truly transmitted.\n*[The patriarchs, in their compassion,\nhave directly revealed the celestial mechanism.\nThey say: If you wish to see the flower appear in the* geng *direction—\nthough its position lies in the west, the* geng *region—\nyou must in fact seek it within the body,\nand at once behold the moth-browed new moon.\nThe alchemical classics say:\n\"Suddenly glimpsing a moon in the western quarter,\npure yang swiftly runs to report to Zhongli.\"\nWhen the time arrives,\ndo not delay or hesitate—\nmissing the celestial mechanism\nmeans losing this wondrous secret of gathering true lead.\nIt is not easily known,\nnot easily gathered.\nFrom ancient times to the present,\nit has been transmitted mouth to mouth,\nnever lightly bestowed.\nThe pearl in the robe is near at hand,\nyet deluded ones waste their efforts—\nall because they have not met a true teacher\nor received the true transmission.]]*\n\nThe firing times begin on the first day—\none *liang* gradually grows.\nOn the sixteenth, withdraw the yin tally—\ntwo *liang* show no further increase.\n\n*[Fire has its proper timing;\nawait the moment and employ it—\nthe work must begin on the first day.\nThe* Cantong Qi *says:\n\"In the first year, the sprout nourishes.\"\nThe first year is the first day.\n\"One* liang *gradually grows\"—\nfrom the first day, accumulate the lines and grains.\nThe so-called \"eight* liang *of lead,\nhalf a* jin *of mercury\"—\nall are amassed by increments of weight.\nThe sixteenth is after the full moon;\nthe method calls for withdrawing the yin tally.\nNo further weight can be added—\nthis is the time to cease firing and halt the tally,\nwhen the two no longer meet.]*\n\nBathing occurs at the hours of hare and fowl—\nguard against loss, guard against peril and collapse.\nGolden qi naturally steams and suffuses,\nthe body’s sweat dripping profusely.\n\n*[Hare and fowl are* mao *and* you.\n*Mao* is the hare among the twelve earthly branches,\n*you* is the fowl.\nAt this time, punishment and virtue arrive at the gate—\nthe method calls for bathing.\nBathing means washing the heart and cleansing the thoughts.\nThe* Yi *says:\n\"The noble one washes the heart and retires, hidden in secrecy.\"\nThis matter is perilous—\nabove is heaven, below is hell.\nOne must proceed with utmost care,\nguarding against collapse,\nbefore the golden qi can steam and circulate,\nrising and descending,\npervading the four limbs,\nfilling the entire body.\nWarm qi harmonizes,\nand sweat drips abundantly.]*\n\nAfter ten months, the embryo is complete—\nthe crown of the head must release the spirit.\nThen face the wall for nine years—\nascend to the Jade Capital in flight.\n\n*[The* Cantong Qi *says:\n\"After ten months have passed,\nit emerges from the womb.\"\nWhen the ten months’ work is complete,\nthe nurturing is finished.\nThe alchemical classics say:\n\"Three hundred days of firing,\nten months of gestation—\nthe spirit leaves the body,\nnow here, now gone.\"\nAt this time, the ore is exhausted, the gold pure,\nthe entire body is pure yang.\nThe five viscera are regenerated,\nthe hundred bones re-established.\nThe mouth produces numinous fluid,\nblood transforms into white marrow.\nA thunderclap resounds,\ngolden light pierces the earth—\nthe infant emerges from the crown.\nGradually regulate the spirit,\nslowly emerge from the shell.\nPiercing metal and penetrating stone,\nin an instant, ten thousand miles.\nFrom this, a hundred thousand transformed bodies—\nthen proceed to face the wall and nurture emptiness.\nAfter nine years, the work is complete,\nthe celestial decree descends,\nthe body flies to the golden palace—\nthis is what is meant by:\n\"After nine transformations, ascend to heaven,\nforever a celestial immortal, living ten thousand springs.\"]*\n\nThree stages of the work—\nI have clearly explained them to you.\nNow I personally unseal and release them,\ncomposing this book to embody the secret method.\n\n*[The work of refining the elixir has three stages.\nThe first barrier: refining the self and laying the foundation.\nThe middle barrier: refining qi to transform the spirit.\nThe upper barrier: refining the spirit to return to emptiness.\nThese three stages of the work\nhave never been spoken of by anyone in the past.\nNow I have clearly revealed them,\npersonally unsealed and released them,\nelaborating them into a book.\nThose who are determined to pursue this Way\nshould embody and recognize the true secret,\npractice it diligently,\nand naturally enter the sage’s realm,\ntranscending the common herd.]*\n\nTransmitted to the children of true refinement—\na method of gold and jade.\nThe elixir’s true secret is taught by the master—\nit must be discussed with immortals.\n\nHere is the translation:\n\n---\n\nNow, the secret method that has remained unspoken for ten thousand ages is revealed and compiled into this book, transmitted to the children of true refinement. This book is truly a golden and jade-like method, a precious raft for ascending the clouds. Yet, though this is its general outline, it is not easily heard. As for the mystery within the mystery, the subtlety within the subtlety, it must be received through the oral transmission of a true master. As the saying goes, \"The true string must be taught by a true immortal.\" Common people, interpreting texts by their words alone, often err and mislead. Why not seek a master with resolve and spirit? In the end, you will surely encounter one. This is what is meant by *\"You must discuss it carefully with immortals.\"*\n\nThere is yet another wondrous elixir method,\nbut I fear revealing too much would make it seem trivial.\nIt is like plucking the zither and striking the se,\nhusband and wife harmonizing their natures.\n\n*[The profound and subtle mechanisms are not limited to one method. There is another elixir method, uniquely wondrous. Yet I fear revealing it entirely would cause those who hear it to dismiss its marvel. What is this method? It is the method of plucking the zither and striking the se. As the poem says: \"When husband and wife are in harmony, it is like the zither and se played together.\" The zither is not played alone; the se must be struck in unison. In the Way of nature and emotion, harmony comes first, and mutual resonance follows. The *Canticle* says: \"Push emotion to unite with nature, turning and joining together.\" How could the subtlety of the elixir method be easily understood?]*\n\nRosy light illumines the winding waters,\nthe red sun rises over Kunlun.\nVague and indistinct, dim and obscure—\nwithin this, there is true certainty,\nand when certainty arrives, you will surely be startled.\n\n*[Metal and water shine brilliantly, wood and fire blaze red. The golden crow emerges from the sea, the jade hare ascends the sky. The sun rises in the east over Fusang, casting its glow upon the winding waters. The winding waters are the Qujiang River. The *Linjiang Immortal* says: \"Upon Qujiang, the moon’s radiance is pure and bright, and there flies a crow.\" Laozi said: \"Vague and indistinct, yet within it there is form; dim and obscure, yet within it there is essence. Its essence is utterly true, and within it there is certainty.\" Certainty means adherence to the unerring timing. \"When certainty arrives, you will surely be startled\" means that when the moment arrives, the wondrous principle manifests of itself, and the medicine’s emergence is divinely known. This vague indistinctness and dim obscurity describe the scene of obtaining the medicine—when the primordial qi arrives and the Supreme Ultimate begins to take shape.]*\n\nA single drop like a vermilion orange,\nit must be met by quicksilver.\nNo instruments are used at all—\nthe method inverts heaven and earth.\n\n*[At the moment of the returning elixir, a visible form appears—a single drop falls into the Yellow Court, shaped like a vermilion orange or a pellet. Quicksilver is mercury. When the elixir arrives, one must move a drop of true mercury to receive it. Once it arrives, it becomes the master: the husband sings first, the wife follows after, inverting yin and yang, reversing the workings of creation. This is what is called \"two layers of heaven and earth, four aspects of yin and yang.\" The *Three-Character Formula* says: \"The great key lies in inversion: I become the guest, and it becomes the host.\" Instruments refer to the zither and sword. Once the elixir returns to the crucible and the tally is complete, the fire is stilled—no instruments are used, only this wondrous mechanism. Countless learners in the world—how could they number less than ten thousand times ten thousand? Yet who truly knows? Knowing is not difficult; what matters is accumulating abundant merit and performing acts of kindness. Where your resolve lies, heaven will respond, and immortals will surely become your teachers.]*\n\nThe world does not understand the principle,\npracticing the Three Peaks’ sexual arts,\nsome speak of the Three Passes,\nothers enter the furnace and face the moment—\neven mouth-to-mouth,\nfilthy and unbearable to hear.\nAll conditioned methods\nare the people of hell.\n\n*[The world, failing to grasp the profound principle, sees in the elixir scriptures phrases like \"mouth to mouth, aperture to aperture, do not disdain the filth, do not calculate the cost,\" and guesses it refers to the female crucible, practicing the Three Peaks’ sexual arts, the method of nine shallow and one deep. They beautify it with names like \"Pengzu’s bedchamber arts.\" Some speak of the Three Passes—rear upper, front lower—while others engage in inner alchemy with women, facing the furnace and consuming filth, mouth-to-mouth. How vile and unbearable! All such side doors are this filthy and foul. They are all seeds of hell, beyond salvation. True masters are hard to meet, true methods hard to obtain. Those with resolve should diligently accumulate virtue.]*\n\nThere are those who cling stubbornly,\nbelieving dead stillness to be true.\nTheir hair turns yellow, their teeth fall out,\ntheir bodies like magpies, their forms like cranes.\n\n*[Some fools, stubborn and unyielding, cling rigidly to stillness, believing it to be the unshakable truth. They practice bitter austerities, sitting day and night, causing their qi and blood to stagnate. Their bodies become like magpies, their forms like cranes, emaciated as sticks. Even when their hair turns yellow and their teeth fall out, they still do not awaken—how lamentable! The reason for this is that people commonly see Daoist practitioners as unmarried and unofficed, sitting alone in remote mountains, dwelling deep in valleys, empty and desiccated in their stillness, calling it \"cultivating the truth.\" They also see in novels that entering the mountains to cultivate the Dao means becoming an immortal. How could they know that sitting until old age and death is all in vain? Ultimately, this comes from not carefully reading the elixir scriptures. When Zhang Sanfeng met the Fire Dragon Immortal, he was given a secret method and told to leave the mountains quickly to seek karmic conditions. Thus, *A Branch of Flowers* says: \"I was commanded to leave the mountains, to seek companions and find lead.\" The Stone Immortal of Apricot Grove told Xue Zixian: \"Go to the bustling cities and rely on those with power to assist you.\" Since ancient times, true immortals have all emerged from among people, sought from among the wealthy and powerful. The ancients had to leave the mountains, yet people today insist on entering them; the ancients all worked through action, yet people today only speak of non-doing. So many contradictions, running counter to the Dao. Stubbornly clinging to dead stillness, they die without regret. Why not read the *Scripture of Purity and Stillness*, which says: \"Such purity and stillness gradually enter the true Dao; though it is called attaining the Dao, in reality, nothing is attained.\"]*\n\nTo transform sentient beings—this is called attaining the Dao. The text elaborates at length, reaching the utmost purity and stillness, yet suddenly appends a line: \"Those who awaken to this may transmit the sacred Dao.\" Even at such purity and stillness, there is still transmission—why do people remain so unaware? In short, they are accustomed to the common principles of the human world and fail to witness the marvels of sages and spirits; this again hinges on the depth or shallowness of one’s innate capacity.\n\n---\nHe knows not our Dao,\nmistaking the false for true.\nObserve heaven’s great Dao,\ngrasp heaven’s great workings.\n\n[Annotation: All heterodox schools cling rigidly to their own views. How could they know the subtlety of our Dao—borrowing the false to cultivate the true, turning the false into the real? The *Scripture of Unconscious Unison* says: \"Observe heaven’s Dao, grasp heaven’s workings—this is perfection.\" Heaven and earth form one great yin-yang; the human body, one small yin-yang. The heavens have Greater Yin and Greater Yang; the body, Lesser Yin and Lesser Yang—their principles are identical. The scripture states: \"Simply focus the heart on emulating heaven. The movements of heaven and earth, sun and moon, the wondrous functions of Kan and Li in the body, the four cardinal gates of mystery—who truly understands these?\"]\n\n---\nThe moon hangs over the western river,\nrosy clouds touch the southern shores.\nThree days before is the dark of the moon—\npure yin within yang.\n\n[Annotation: \"The moon hangs over the western river\" depicts the white moon atop the mountain, an image of fresh, tender medicinal sprouts. \"Rosy clouds touch the southern shores\" shows the red sun at the pool’s bottom, an image of vanquished yin demons. *Awakening to Reality* says: \"On the southwestern path, the moon’s brilliance shines—great medicine arises from this place.\" The western river is where lead is produced; the southern Li is the source of fire. \"Three days before\" refers to the three days prior to *geng*. The \"dark of the moon\" is the day before the new moon. Thus, \"three days before is the dark\" signifies the moment before the living *zi* hour, the end of *hai*. At this time, the great medicine is about to emerge—what is called \"the appearance of lead’s light three days prior\" occurs precisely at the height of yin.]\n\n---\nThree days after is the new moon—\nyang essence within yin.\nJust as winter solstice arrives,\nharmonious scenes herald a fine spring.\n\n[Annotation: \"Three days after\" refers to the three days following *jia*, when the dark of the moon ends and the new moon begins, the transition from the end of *hai* to the start of *zi*. At this moment, yin reaches its extreme and yang is born, a single yang rising from beneath the ninefold earth—akin to the seasonal winter solstice. The winter solstice is heaven and earth’s true *zi* hour; the \"yang essence\" is the body’s living *zi* hour. When yang returns, the great earth becomes spring, radiant with vibrant light and vitality. The arrival of true yang in the body is like the sun rising over Fusang, its crimson glow suffusing the earth. Three hundred sixty joints, eighty-four thousand pores—all melt into harmony, a sweet, unbounded ease, the whole body bathed in spring.]\n\n---\nThe eighth day is the first quarter,\ninquire at the rabbit’s gate of *mao*.\nThe sixteenth is the beginning of *gou*,\nthe twenty-third is the gate of *you*.\nThrough this, examine the *Yi* hexagrams—\nonly then can you know the true Great Dao.\n\n[Annotation: The new moon’s first quarter occurs on the eighth day of the month; the waning moon’s last quarter, on the twenty-third. *Mao* belongs to the rabbit, *you* to the rooster. These two hours are the gates of punishment and virtue, the moments of bathing—know that bathing at *mao* benefits mercury, while bathing at *you* benefits lead. The third day of the new moon marks the first return of a single yang; after the sixteenth day of the full moon, a single yin begins to *gou*. *The Union* says: \"On the eighth day, *dui* receives *ding*, the first quarter level as a string; on the fifteenth, the *qian* body is complete, fullness in *jia* to the east; on the sixteenth, the mandate shifts, *xun*’s *xin* appears at dawn; *gen* aligns with *bing* to the south, the last quarter on the twenty-third.\" Scholars who study this principle and examine the *Yi* hexagrams will recognize that the Great Dao possesses its own truth—it cannot be falsified.]\n\n---\nA hundred verses in this chapter,\neach word demands careful study.\nThis book is guarded by thunder gods—\nthose who obtain it must not treat it lightly.\n\n[Annotation: This book contains one hundred verses. Within these hundred verses—five hundred characters in all—each is a luminous pearl, every word profoundly subtle. Scholars must seek the text’s meaning, ponder its phrases, and silently grasp its principles. To transcend the ordinary and become a sage, to hold the secret and mysterious mechanism—this is what heaven treasures. This chapter reveals the celestial mechanism in full, and thunder spirits guard this true formula. Readers must not dismiss it as mere casual speech. Revere it—do not neglect!]\n\n**III. The Song of the True Scripture**\n\nThe Song of the True Scripture, the Song of the True Scripture—\nthose who fail to recognize the True Scripture are all possessed by demons.\nEach person seeks meaning in the written word,\nand many chant ceaselessly without end.\n\n[Annotation: *True* is spoken in contrast to *false*. The *True Scripture* is the scripture of cultivating the True. In truth, the True Scripture has no written form—it exists before the primal chaos, before the beginning of the dark and yellow, before the Supreme Ultimate, as the ancestor of primordial qi. All heavenly immortals and buddhas: in their coming, none could enter the world without this scripture; in their going, none could leave the world without it. It is the root-source that gives birth to heaven and earth, to humans and the myriad things. Immortals and buddhas refine it to ascend; ghosts and spirits exist because of it. The sacred assemblies of the numinous altars, the blessed lands of the grotto-heavens—all are shaped by the True Governor of creation. The ten thousand affairs and principles of the world, the forms that arise from nonbeing, the qi that dissolves into being—none do not emerge from it. Great indeed is the True Scripture! It is beyond conception, beyond naming.\n\nThe common person uses it to bear sons and raise daughters, cherishing it as a trifle; the perfected one uses it to extend life and attain the True, treasuring it as sacred. This thing is abundant—whether in foreign lands or China, regardless of wealth or poverty, it fills the earth without exception. It is the blue sky beneath the roof, the living path before one’s eyes. Yet without a true teacher’s guidance, none can know its wondrous use.\n\nPeople, failing to recognize its wondrous use, thus fall entirely into demonic paths—such as swallowing cinnabar and consuming filth, or engaging in sexual arts with women. These are the seeds of hell, deeds that prevent rebirth for ten thousand kalpas. Why do they enter these demonic ranks and suffer such demonic obstructions? Only because they do not recognize the True Scripture.\n\nThere are those who rely on textual exegesis, seeking profound principles solely in words and phrases, probing the trigrams for symbolic meanings, chanting endlessly—yet they remain a thousand miles from the Dao.]\n\nHolding scriptures and incantations, reciting ritual codes,\narranging them on paper in hope of liberation—\nif such means could transcend life and death,\nthen every monk on earth would become a buddha.\n\n[Annotation: Holding incantations and reciting scriptures, following ritual procedures, seeking liberation solely through words and texts—this is to assume the true formula lies on paper. If such practices could free one from the sea of suffering, transcend the ordinary, and enter sagehood, resolving the great matter of life and death, then all beings on earth, and the countless monks who chant scriptures and incantations, would have long since become buddhas. Yet since ancient times, none have attained immortality or buddhahood through mere recitation—thus, the true path must lie elsewhere.]\n\nObtain the True Scripture, and emerge from the vast waves;\nwithout the True Scripture, there is no recourse.\nIf you ask where the True Scripture truly lies—\nin the primordial creation, nothing more.\n\n[Annotation: The above passages allude to the scripture’s name and meaning; only now is its wondrous nature directly revealed. This True Scripture is most difficult to obtain. If one gains it, one may escape the vast waves. People drift in the sea of suffering, tossed by the currents without end. This scripture is the precious raft of the vast waves, the compassionate ferry to the other shore. Without it, there is truly no method—what can one do about these vast waves?\n\nIf one asks where the true and wondrous essence of this scripture lies, it is simply in seeking the primordial creation, the authentic mechanism of the mysterious. Its principle is most subtle, its practice most simple—there is truly nothing more to it.]\n\nTo follow the flow is death, to reverse the course is life—yet often you seek in vain.\nThe True Scripture originally bears not a single word,\nyet it can ferry all beings beyond the Great Veil.\n\nDao of immortals and Dao of humanity differ only in following or reversing;\nthus the *Yi* speaks of \"reversing the reckoning.\"\nTo follow is to generate humans and creatures;\nto reverse is to become immortal or Buddha.\nIt is also said: the Five Phases flowing forward make a fiery pit of the dharma-realm;\nthe Five Phases flowing in reverse bring undying longevity.\nThe human path begins with an initial spark,\nproceeds to a wailing cry at birth,\nthen infancy, childhood, youth, maturity, old age, and death—\nthis is the forward flow of conditioned existence.\nThe immortal path returns from old age to youth,\nthen to the fetal state, to the Supreme Ultimate, to the Ultimateless—\nthis is the reverse flow of unconditioned existence.\nTen thousand volumes of alchemical scriptures speak only of principle.\nHence it is said: \"Because alchemical scriptures lack oral instructions,\nwhere can you form the numinous embryo?\"\nThough reversal may bring life,\nits method is not transmitted,\noften leaving seekers groping in the dark, unable to find it.\nKnow that this scripture is not a scripture of written words,\nbut the tides of the great ocean, where the moon never misses its appointed time.\nAs the *Cantong Qi* says: \"Revolving through the twelve nodes,\nwhen one cycle ends, you must draw near again.\"\nThis scripture alone can deliver all beings,\nascending them to the realm of the Three Pure Ones in the Great Veil.\n\nTo obtain the True Scripture and deliver yourself,\nnothing suffices but the harmony of two like kinds.\nWhether generating heaven, earth, or humanity,\nhow could it depart from the nest of yin-yang transformation?\n\nThe True Scripture’s secrets are not easily heard.\nOut of compassion, the Patriarch speaks plainly to you, ordinary beings:\nif you seek the True Scripture to deliver yourself,\nI now directly point it out to you—\nnothing suffices but the use of like kinds in mutual harmony.\nWho, then, is the counterpart?\nAs the Patriarch does not fail to say:\n\"A broken pot must be mended with iron,\ntattered clothes must be held together with cloth.\nIf a person’s vitality is damaged yet lacks the true golden qi,\nhow could one in ten thousand ever revive?\"\nThe *Wuzhen Pian* says:\n\"A broken bamboo must be mended with bamboo,\nto hatch a chick you must use an egg.\nAll efforts with unlike kinds are wasted labor—\nhow could they compare to true lead uniting with the sacred mechanism?\"\nIt also says:\n\"Tattered clothes must be mended with cloth,\na weakened person must be restored with lead.\"\nThe *Cantong Qi* says:\n\"To prepare the elixir of immortality,\nyou must use substances of the same kind.\"\nAnd again:\n\"Like kinds are easily worked,\nunlike kinds cannot be skillfully employed.\nOnly like kinds follow one another—\nwithout this, the work will not yield treasure.\"\nThus swallows do not hatch phoenixes,\nfoxes and hares do not nurse foals—\nbecause they are not of the same kind.\nSince it is called \"like kinds\" and \"mutual harmony,\"\nthe meaning is clear—what further doubt could there be?\nIf cultivators of the Dao truly seek by means of like kinds,\nthe qi of wondrous transformation will naturally arise.\nThis is how humanity is generated,\nand how heaven, earth, and the myriad things are generated.\nThe *Lingbao Bifa* says:\n\"The Dao-qi resides entirely within the human body,\nable to transform and generate all heavens,\nilluminating the Three Luminaries.\"\nYin and yang are themselves like kinds;\nonly with yin and yang does transformation arise.\nWhen transformation is spoken of as a \"nest,\"\nthere must be an aperture within it.\n\nTo speak of the true scripture is not to indulge in emptiness—\nin the ravines of the Western Riverbed, yellow gold is born.\nFive thousand and forty [days] return to the Yellow Way,\nprecisely matching one volume of the *Great Treasury of Scriptures*.\n\nWhen the days are fulfilled and the qi-cycles align,\nearth responds with tides, heaven responds with stars.\nThe First Patriarch Bodhidharma personally transmitted it,\nthe true, wondrous, and subtle Dharma of the *Lotus Sutra*.\n\nThe lotus is hollow within yet straight without,\nemerging from filth yet unstained.\nThe Buddha said: \"In this world of the five defilements,\nI cultivated and attained the Great Way—\narising from the mire, not from purity.\"\nThe true, wondrous, and subtle Dharma is sought within this.\n\nOn the third day, the *Zhen* trigram emerges with *geng*,\nabove the Winding River, the moon’s radiance gleams bright.\nFlower buds just unfurl, bearing pearls of dew;\nin tiger’s den and dragon’s lair, one probes the turbid and the clear.\n\nWater begets two, the elixir is true—\nwait for three, and it cannot advance.\n*Ren*-water first arrives, *gui* has yet to come:\nswiftly gather it, discerning its rise and fall.\n\nThe golden crucible refines, the jade furnace smelts,\nwith gentle, warming embers, softly glowing.\nThe true scripture pierces the Mysterious Pass in a single shot,\nlike an arrow striking the red center of the target.\n\nThe body grows hot, as if steamed in a basket;\nturning the light inward, it illumines the Central Palace.\nOnce the true scripture is attained, one is drunk as with wine—\nbreath and pulse return to their root, all hundred channels restored.\n\nEssence enters *qi*, *qi* transforms into spirit;\nafter seven days in chaos, the soul returns anew.\nSuch is the true workings of creation’s message—\nhow few in the world dare to speak of it.\n\nAlive within death, dead yet reborn:\nsince ancient times, immortals and buddhas have relied on the true scripture.\nWhoever grasps this work of creation\nshall ferry all beings across the Jambu continent.\n\nAnd it further states:\n*\"Sentient beings descend to sow the seed,\nBy cause in the ground, the fruit is born again;\nThe insentient are of five kinds,\nWithout nature, they too are unborn.\"*\n\nAs in the Dragon Girl offering the pearl,\nthe earth surging with golden lotuses,\nthe earth surging with the jeweled pagoda,\nor the perfection of the Tathāgata’s *māraṇa-guhya* form—\nare these different from what is not different?\nYet today’s monks rarely engage in true cultivation.\nThe patriarchs, in their compassion, have all pointed this out.\n\nIf one can know this true scripture and practice this work of creation,\nthough the Jambu continent be vast, all may at once become immortals and buddhas.\nThe scripture says:\n*\"Were the common folk all to know this,\nthe world’s immortals would flow like water.\"*\n\nThe Great Dao abides first in the Supreme Ultimate,\noriginating before father and mother.\nTo ferry others, one must ferry them with the true scripture—\nif asked what the true scripture is, *gui* is lead.\n\n**[Annotation:**\nBeyond the Supreme Ultimate lies the source of the Great Dao,\nbefore father and mother.\nAs the *Cantong Qi* says: *\"Original essence spreads like clouds,\nborne by qi at the beginning.\"*\nThe patriarchs say: *\"Exhaustively seek the moment of receiving qi at birth.\"*\nBefore birth, it is not like the Buddhists’ discourse on emptiness\nor awakening to the absence of self—\none must awaken to the very inception of the self.\n\nTo ferry others, one must ferry them with the true scripture;\nthere is no other method besides this.\nKnowing this scripture, the crucible, furnace, talismans, and fire\nare all contained within it.\nThe Celestial Root and the Moon Cavern all arise from this.\n\nIf one asks what the true scripture is—\nlead is *gui*, and *gui* is the scripture.\nCompassion, compassion! I would weep,\nweeping for all the aspirants in the world who fall short of their aim.\n\nIn vain they endure hardship, stubbornly sit in meditation,\nfailing to meet the right conditions,\nsuffering a lifetime of toil,\nonly to grow old without achievement—how pitiful!\nRefining the mortal to enter sagehood is the greatest of matters,\nrarely encountered in a lifetime.\n\nMay the worthy and wise of the world\nbroadly sow fields of merit,\ncultivate hidden virtues,\nseek a teacher to reveal the lead within water—\nnaturally, understanding one thing will open a hundred,\nresolving one will settle all,\nand one shall become true.\n**]**\n\n**IV. The Crucible’s Song**\n\n**IV. The Crucible’s Song**\n\nThe crucible is none other than the body of Heaven and Earth,\nthe great elixir is nothing but essence, qi, and spirit.\nIf you can gather and refine them into one,\nyou must employ three like-minded people.\n\nThree people—no other way—\nonly with a true teacher and true oral instructions,\nwho reveals the three-grade elixir of yin and yang,\ncan you then settle the mind and await the bright moon.\n\nAwait the bright moon, yet do not delay:\ngather body and mind to first lay the foundation.\nSplit open the dust-laden heart, cast off the karmic net,\nexpel the five leakages, slay the three corpses.\n\nSlay the three corpses, and the sword is forged;\nrefine the self to attain numinous knowing—then the signs appear.\n\n**IV. The Crucible’s Song (continued)**\n\nWith hardness and softness transformed at will,\nyou drive away demons for ten thousand leagues swift as lightning.\n*[Note: The three corpses are spirits dwelling in the flesh and blood of the human body. They do not wish for human life but thrive on human death. Whenever one acts recklessly in anger or surrenders to lust without restraint, it is these spirits that secretly stoke the fire, stirring chaos to overturn one’s resolve—hence the inevitable regret afterward. These corpses are the greatest hindrance to the Dao. The upper corpse resides in the brain, the middle in the abdomen, and the lower in the kidneys—collectively known as the Three Peng. Those who cultivate the Dao must first slay the three corpses. As *The Wuzhen Pian* states: \"Only when the three corpses are slain can the Dao be attained.\" Yet they cannot be severed by blades of bronze or iron; only the sword of wisdom can seal the leaks. This sword is possessed by all, though few are willing to wield it. Forged by intent and wielded without form, it aids in refining the self until, over time, numinous resonance arises. Able to be firm or yielding, to bend or extend, it transforms at the heart’s command, driving away demons for ten thousand leagues with the speed of lightning.]*\n\nSwift as lightning, the sword gains its numinous power,\nthen hang it in the south to guard the crystal waters.\nShould yin ghosts rise from the north,\na single stroke severs all without mercy.\n*[Note: Only when the sword moves like lightning is it called \"numinous.\" It is hung in the south—the position of *li* (fire). The \"crystal waters\" signify a heart as clear as water. Without this sword’s support, it is impossible to remain unstained by even a speck of dust. Know that this path is like extracting treasure from a den of ghosts, where yin spirits follow at every step. As Master Xiao Liaozhen said: \"When heretical demons suddenly display their might, brandish the Seven-Star Treasure Sword before you. In the very midst of the ghostly den’s battle, seize the luminous pearl and return.\" The phrase \"without mercy\" marks the utmost decisiveness—any hesitation, and the moment is lost. Beware, be vigilant.]*\n\nWithout mercy, abide in constant clarity,\nthe heart’s purity gleaming like a bright mirror.\nWhen the mirror-heart is extinguished, still as empty space,\nonly then can you face the crucible without flaw.\n*[Note: The slightest trace of tender attachment disrupts clarity. To cultivate pure karma, one must sever all private desires, allowing no indulgence, so that the mirror-heart becomes limpid, all thoughts dissolved, equal to empty space. Only then, when facing the crucible before the mirror, can one remain unstained and free of flaws. Otherwise, a single stirring of emotion summons a thousand illusions. At such moments, it all depends on one’s steadfast resolve—then one may tread upon the tiger’s tail without being bitten, and all will proceed smoothly.]*\n\nFree of flaws, the crucible may be set,\nharmonize the cauldron’s vessel without haste.\nIf words fail to connect, they are no true kin—\nonly when dragon rises and tiger thrives can the work begin.\n*[Note: Only when not a speck of dust remains can the crucible and cauldron be established. This cauldron comes from the divine lands of the Red Continent and cannot be obtained without wealth. Even if purchased, it is not immediately usable—one must wait for the appointed days and seasons, then tend to it with meticulous care. It cannot be employed with a rough or impatient mind.]*\n\nTo commune in speech is to become kin,\nyet one must await the thriving of dragon and tiger—\nonly then may the dragon be driven to the tiger,\nand in turn, the tiger seize the dragon.\nIf the moment of their flourishing has not arrived,\ndo not act recklessly, for only in their vigor may the work begin.\n\nOnce the work may begin, observe the return,\nand hew open the aperture of primordial chaos.\nWatch in stillness the tiger’s roar and the dragon’s song,\nand naturally the divine water of the Flowery Pond will arrive.\n\nWhen the divine water arrives, discern its rising and sinking,\nlest the hour pass and your efforts be in vain.\nWhen lead meets the birth of *gui*, hasten to gather it;\nwhen gold nears its fullness, it is no longer fit for intimacy.\n\nIf unfit for intimacy, do not recklessly take—\nearth will split and mountains crumble, and you will lose control.\nHe who knows not when to cease courts peril;\nin midsummer, bitter frost; in deep winter, scorching heat.\n\nIf scorching winter is not encountered,\nguard the Three Treasures within the firm pass.\nThe Great Ultimate naturally generates transformation—\nseize the moment to guide and convey it into the Yellow Palace.\n\nEntering the Yellow Palace, tend it with care.\n\nIn the tenth month, water and nurture—do not miss the moment.\nAt *zi*, advance the Yang fire, tiger and dragon unite;\nat *wu*, retreat the Yin tally, naturally preserve and secure.\n\n[Note: The central divine chamber is called the Yellow Court.\nOnce the elixir enters here, it is called the divine elixir entering the crucible.\n*The Wuzhen Pian* says: \"Send it back to the earthen crucible, firmly sealed.\"\nFrom this point, tend it with watering and nurture,\npracticing the fire times of the great celestial cycle.\nAs before, advance the Yang fire at *zi*,\nretreat the Yin tally at *wu*.\nWhen Yang fire advances, tiger and dragon unite;\nwhen Yin tally retreats, naturally preserve and secure.\nThis marks the boundary between dual cultivation and solitary practice.\nWithout a true teacher, how could one comprehend it?]\n\nPreserve and secure, then briefly part,\nsit upright, forget words, and await the hour.\nLike spokes converging at the hub, cycling without end,\nthree hundred and sixty—do not miss the appointed time.\n\n[Note: In solitary preservation, dragon and tiger briefly separate.\n*The Cantong Qi* says: \"Within, nurture the self,\nabide in stillness and emptiness.\"\nThis is the meaning of sitting upright and forgetting words.\n\"Await the hour\" refers to *The Rootless Tree*:\n\"Once unloaded, it will reopen at a fixed time.\"\n*The Cantong Qi* says: \"Cycle through the twelve nodes,\nwhen one ends, begin anew.\"\nLike spokes converging at the hub, cycling without end,\nbeginning again when finished.\nThree hundred and sixty is the total number of the Qian and Kun hexagrams.\nQian’s number is two hundred and sixteen;\nKun’s number is one hundred and forty-four.\nAt *zi*, thirty-six advances, accumulating one hundred and eighty Yang lines;\nat *wu*, twenty-four retreats, totaling one hundred and twenty Yin tallies.\nThis is Yang lines using nine—four nines make thirty-six;\nYin lines using six—four sixes make twenty-four.\nExcluding *mao* and *you* for bathing, these are the numbers of the celestial cycle,\nthe measured limits of wondrous practice—one must not be ignorant of them.]\n\nDo not miss the appointed time, for it sets the rule.\nTo awaken to the true principle, one must accord with it.\nIf you cling to the movement of lines and images,\nyou may only exhaust the spirit and wear the body thin.\n\n[Note: Do not miss the appointed time—set the fixed limit, unalterable.\nTake it as the rule. To cultivate the wondrous Dao,\nfirst accord with the wondrous mechanism.\nThis true mechanism must be matched precisely—do not cling.\nIf you do not thoroughly awaken to the subtle mystery,\nclinging to the text and fixating on images,\ncounting the clepsydra, weighing the lines,\nthe body will wear thin and the spirit labor in vain,\nall effort wasted to old age.\nThis is all due to failing to awaken to the supreme principle within the mystery,\nfalling into error and confusion,\nmistaking oneself for wisdom—all to no avail in the end.\nKnow this: without a true teacher’s guidance, not one in ten thousand will succeed.]\n\nThe body worn thin, yet the work persists,\nbut the heart’s machinations may not yet be at rest.\nIf thoughts of longing for the true err by a hair’s breadth,\nlead dissolves, mercury scatters, and the elixir will not form.\n\n[Note: \"Persists\" refers to the work of advancing and retreating, of small going and great coming.\nWhen the body is worn thin and old age renders one unfit,\nif one can practice this advancing and retreating,\nnaturally one will grow stronger day by day, with daily results.\nThose who cannot do so are unsettled in mind,\na thousand worries and ten thousand anxieties leaving not a moment’s peace.\nRefining lead and cooking mercury depend entirely on a still heart and a tranquil spirit.\nThe slightest thought or worry is already an error.\n*The Mirror for Compounding the Medicine* says: \"Err by a hair’s breadth, and the elixir will not form.\"\n*The Wuzhen Pian* says: \"A hair’s difference, and the elixir will not be made.\" This is the meaning.]\n\nIf the elixir does not form, reflect on refining the self,\nfor all is lost through failing to grasp the principle within the mystery.\nWhen water dries and fire scorches, adjust and harmonize;\nwhen punishment and virtue arrive at the gate, know when to advance and retreat.\n\n[Note: The elixir’s failure to form is entirely due to the self not being sufficiently refined.\nThe ancients said: \"If the self is not sufficiently refined, dare not return the elixir.\"\nThe work of refining the self is vast indeed!\nIt is said: \"Cultivating immortality has limits; refining the self has none.\"\nThe two words \"refining the self\" are the great key,\nthe great function, the great foundation of elixir cultivation.\nThere has never been one who did not first refine the self and yet could return the elixir.\nThe deluded and ignorant, failing to understand,\nrashly attempt the work of the twelve hours—few do not stumble.\nWater and fire must be balanced, not allowed to dominate.]\n\nFire blazes and turns parched, water overflows and spills—all hinges on harmonizing to the mean.\nWhen punishment and virtue arrive at the gate, they stand at the threshold of life and death.\nThis is the moment of bathing; one must know when to advance and retreat, never transgressing the measure.\n\nKnowing advance and retreat, fear no misfortune—\nwithin the crucible, a single crimson point is refined.\nA child is born, its *qi* of *dui*-metal full,\nthree years of nurturing leave it dull as the deaf and mute.\n\nThe Dao of the elixir first demands knowing advance and retreat, fortune and misfortune.\n\"Advance and retreat\" refer to advancing the fire and retreating the tally.\nReceiving *qi* brings fortune; error brings misfortune.\nIf advance and retreat are clear, never overstepping the rule, fortune comes without misfortune—\na grain of golden elixir glows crimson in the crucible.\nWhen the ten-month gestation is complete, the infant emerges from the crown,\nthe *qi* of *dui*-metal fulfilled—here it must be born.\nThereafter, three years of nursing care differ little from prior nurturing.\nWorldly affairs and mundane attachments are utterly cast off, as if deaf and mute.\n\nSeeming deaf and mute, yet truly joyous—\nin stillness, the spirit is tuned to leave the husk.\nEast, west, south, north—roam freely,\nentering and exiting, riding a white crane.\n\nPeople see him as dull and witless,\ndevoid of lively spirit—how could they know\nhe wears coarse cloth yet holds jade within,\nconcealing priceless treasure?\nIn the realm of nothingness, the boundless sea of extinction—\ntrue joy, who can know it?\nWho attains this may here refine the spirit to depart the shell.\nThus: by morning roaming the Northern Sea, by evening lodging in Cangwu,\ngazing upon the famous mountains within the six directions,\nbeholding the diverse winds of the eight quarters,\nriding a crane through the sky, coming and going at will—\nwhat joy can compare?\n\nRiding the white crane, free of dust,\nthe immortals of the Three Isles gather in assembly.\nThough mulberry fields turn to azure seas,\nmy spirit remains untroubled, poised in the numinous terrace.\n\nThe preceding verse speaks of the Dao perfected and virtue accomplished, lying in wait for the appointed time;\nthis verse tells of the Great One’s summons, moving to dwell in the Central Continent.\nShedding the mortal dust, ascending to the immortal realm.\nThe Three Isles lie in the sea, where immortals gather—\ntheir lifespan spans myriad eons.\nHenceforth, though seas turn to mulberry fields,\nmy numinous terrace remains serene,\nwandering freely in the realm of true light and dharma—boundless and endless!\n\nAccumulating merit and virtue to transcend the mortal world,\nyet still manifesting transformations to guide the deluded masses—\nonly then are a man’s aspirations fulfilled.\n\nThe ranks of immortals vary by the magnitude of merit.\nThus the Yellow Emperor, considering great deeds, descended to the world:\nfirst life as a commoner, next as a minister, then as a sovereign.\nTherefore, in the mortal realm, one accumulates virtue and merit—\nin the celestial realm of purity, building merit is difficult;\nin the turbid world of men, establishing merit is easy.\nNo immortal or buddha lacks compassion,\nwandering the dusty world to save the suffering,\nnow manifesting miracles, now silently aiding,\nguiding the deluded across the sea of transformation.\nAs it is said: only after delivering all beings does one become a buddha.\nThen, with merit accomplished and name fulfilled,\nthe heart of a great man, the aspirations of a heroic man—\nall is resolved in this moment.\nWhat greater virtue or grander achievement could surpass this?\n\nFive: The Song of Gathering Gold\n\nDao, Dao, Dao—no artifice, no subtlety;\nMystery, mystery, mystery—no need for many words.\nUnlocking the gates, unfolding the apertures is not hard.\n\n[Note: The word *Dao* is itself but a forced name.\nIt existed before heaven and earth, and endures after them.\nIt is the stem of the formless, the root of the Supreme Ultimate.\nNo single thing *is* the Dao, yet no single thing *is not* the Dao.\nMost utterly ordinary, utterly without artifice or subtlety.\nThe word *mystery* speaks of a principle profound yet subtle,\nyet the matter itself is utterly simple.\nFifty hundred words cannot exhaust it; half a phrase suffices.\nAncestor Yuchan said: \"Half a word, a single phrase, and mystery is penetrated—\nwhat need for alchemical texts in the tens of thousands?\"\nHe also said: \"The oral instructions contain few words,\nall held within half a phrase.\"\nThough the work of unlocking the gates and unfolding the apertures exists,\nit is, in truth, easy.\nOnly let the heart be steadfast, and nothing is difficult.\nThe *gates* are the Three Passes; the *apertures* are the Mysterious Aperture.\nAs the alchemical classics say: \"When the Mysterious Aperture opens, all apertures open;\nthe Three Passes are penetrated without labor.\"]\n\nDiscern the female and male, keep both swords whole,\nlay the foundation, refine the self, and gather the postnatal.\nThough the postnatal is called impure substance,\nfirst ingest the postnatal, then the prenatal.\n\n[Note: The two swords, female and male, have been with us since birth,\nworn upon the body—not bestowed by any master.\nFew comprehend this principle, and fewer still can wield them.\nWield them to lay the foundation, and the foundation is laid;\nwield them to return the elixir, and the work is accomplished.\n*Laying the foundation* means gathering the prenatal within the postnatal—\nthe art of extending life and prolonging the years.\n*Returning the elixir* means gathering the prenatal within the prenatal—\nthe task of becoming a buddha or attaining immortality.\nThe prenatal arises from the formless; the postnatal emerges from impure substance.\nThe prenatal is without form; the postnatal has substance.\nBoth are but a single *qi*, yet differ in their prenatal and postnatal nature.\n*The Mirror of Ingesting the Medicine* says: \"Prenatal *qi*, postnatal *qi*—\nhe who obtains them is ever as though drunk.\"]\n\nThis wondrous instruction must be transmitted by a master;\nwithout a true teacher, all effort is in vain.\n\nAdvancing the work of *laying the foundation*,\nthe firing times of *zhun* and *meng* require withdrawal and addition.\n**[Note: To study this Dao, one must first thoroughly understand the true instructions.\nThese instructions are not transmitted without a master. Should the foolish and deluded gain but a partial or superficial grasp, they may attempt to practice—yet how could they fathom the profound and subtle principles? Without a true teacher to unfold each step and guide every inch, all effort remains in vain.\nAt the initial barrier, advancing to lay the foundation demands bold and relentless progress—no retreat, only true achievement. The firing times advance and withdraw according to the hexagrams. *Zhun* at dawn, *meng* at dusk, each day encompassing two hexagrams. There is withdrawal and addition: withdrawing lead, adding mercury, all governed by fixed principles. *The Perfect Methods of the Numinous Treasure* states: \"When it is time to withdraw, do not add.\"]**\n\nTo withdraw and add, recognize true lead—\nthirteen, fourteen, fifteen, sixteen, linked in sequence.\nExamine the Yellow Path, know the precise target,\nand also study the *Five Thousand Words*.\n**[Note: The instructions for withdrawal and addition first require identifying true lead without error.\n\"Thirteen, fourteen, fifteen, sixteen\" refers to the principles for selecting the crucible. Crucibles vary in size, strength, speed, and timing; they cannot be treated uniformly, for their use follows a fixed schedule. \"Linked in sequence\" means extending by category, its subtlety lying in examining the Yellow Path and knowing the precise target.\nThe Yellow Path is the course traversed by the sun and moon; the precise target is like an arrow striking dead center, neither deviating from the plumb line nor transgressing the square. Its essential subtlety lies in studying the scriptures. If one cannot study them alone, the observer must study and then explain.]**\n\nThe *Three Hundred Characters of the Yin Talisman* and the *Five Thousand Words of the Dao and Its Virtue* speak of nothing but the wonders of this sutra. Two sevens make the finest. Five thousand and forty-eight align perfectly. To know this is to know the Dao; to practice this is to ascend in flight.\n\nWhen the medicinal sprout is fresh, observe with care—three days before the lead’s radiance appears. As the *gui*-water approaches, swiftly gather it; a hair’s breadth of error, and the elixir will not form.\n\n**[Annotation: The moon whitens the mountain peak. The medicinal sprout is tender and new, this being the sign of the primordial omen—just the time to observe the sutras with care. As true lead nears, three days prior, its essence-light shines early in the southwest *geng* position, revealing a crescent’s trace. As the *Canticle* says: \"In the hidden depths, an image appears; the essence-light manifests.\" At this moment, as *gui*-water approaches, one must urgently apply the work of gathering, lest the slightest deviation occur. A hair’s error, and the elixir will not form. The *Mirror of Entering the Medicine* states: \"A hair’s breadth off, the elixir will not form.\"]**\n\nBefore gathering the medicine, establish the framework. At the time of union, employ the bellows. Use the bellows, drawing it near to your body—heed not the celestial bodies, or your efforts are in vain.\n\n**[Annotation: As the great medicine is about to emerge, the work of gathering may begin. First, before gathering, establish the framework. The framework is that of the bellows. In the union of *kan* and *li*, the bellows must be used. This instrument for gathering medicine is called the handle of the Great Ultimate, the essential tool for entering the chamber and applying the work. The *Mirror of Entering the Medicine* says: \"Above, the magpie bridge; below, the magpie bridge. Heaven responds to the stars, earth to the tides.\" The method of its use is neither far from the person nor distant from the self—just as *qian* and *kun* are heaven and earth, *kan* and *li* are the sun and moon, their bodies paired as yin and yang, their movements circulating water and fire. Failing to model oneself on heaven and earth is to labor in vain, climbing a tree to seek fish, exhausting the spirit to no purpose.]**\n\nKnow when *gui* is born, understand when *gui* appears—thirty *shichen* span two and a half days. Gathering occurs in but a single *shichen*, the six *hou* manifest in only two. [Note: If one truly knows the precise moment when *gui* is born and the direction from which it emerges, within these two and a half days and thirty *shichen*, the true celestial mechanism lies concealed here. This is what is meant by \"gathering has its time, harvesting has its day.\" Yet this gathering takes but a brief moment, confined to a single *shichen*. *The Awakening to Reality* says: \"Within one *shichen* the elixir is complete\"—this is that very moment. Divided into six *hou*, the medicine is obtained in the first two; only in these two does the work become evident.]\n\nThe remaining four *hou* serve other purposes. When the medicine is obtained, do not covet or disorder. Be as one drunk or dazed, speak sparingly, fasten the gates and locks, secure the enclosure. [Note: One *shichen* is divided into six *hou*. Once the medicine is obtained in the first two and returned to the furnace, the remaining four *hou* involve another crucible and other tasks. The first two *hou* constitute the true work of gathering the medicine; the latter four are the supreme secrets of refinement. As the alchemical classics say: \"Two *hou* gather the *mauni*, four *hou* employ divine skill.\" Yet when the medicine is obtained, one must rectify the mind and sincerely intend, being cautious and reverent, without the slightest stirring of covetous desire, lest the state be thrown into chaos. *The Canticle* says: \"The heterodox path is perilous and treacherous, toppling nations and endangering the realm.\" At this time, be as one drunk or dazed, speak even less, and once the elixir enters the Yellow Court, fasten the gates and locks securely. *The Canticle* says: \"Guard and defend with firm resolve, block and sever all perverse influences. The winding chambers connect, to ward against the unforeseen—this is the utmost caution.\"]\n\nChoose your diet carefully, neither too much nor too little, lest you harm the vessel or invite disorder. Reduce sour and salty flavors, partake only of the bland. The Yellow Dame attends with watchful care. [Note: Eat before hunger arises, stop before fullness—this is the secret of the masters of longevity. *The True Principles of Celestial Immortality* also teaches that regulating diet and calming the body are simple matters. \"Choosing your diet carefully\" means abstaining from meat and strong flavors, reducing sour and salty tastes, consuming only pure, sprouted teas and plain rice. The elixir is the supreme treasure of the physical form, difficult to obtain and easy to lose. Cherish it at every moment, lest harm befall it and disorder arise. The Yellow Dame’s attendance must be diligent and attentive; she must observe with care, never slackening, lest the moment be missed—this bears the strictest admonition.]\n\nA single lapse in hunger or satiety undoes all prior work: lead scatters, mercury withers, and the two no longer embrace. The ten-month work demands diligent swallowing; when swallowing diligently, guard against danger. [Note: A single careless breath scatters the lead and withers the mercury, disrupting the harmony of yin and yang, transposing dragon and tiger, so they no longer embrace. This all stems from immoderate hunger or satiety. The great celestial cycle of the middle barrier’s ten-month work must never be interrupted; one must swallow and refine diligently, vigilant at every step. Ancestor Zhongli said: \"In the year’s bathing, guard against danger; in the ten months’ regulation, exercise utmost caution.\"]\n\nOnce you grasp the principle and comprehend the *Song of Illuminating Nature*, do not regard it as something easily attained.\n\nThe perfected transmit it, the unworthy are kept far from it—even ten thousand taels of gold would not be exchanged for it.\n\n[Those who study the Dao must first clarify its principles, then cultivate the work of nature. The Dao’s wonders run deep and abstruse; none awaken to it on their own. Should one encounter a true master and receive verification of this text, awakening to the supreme celestial mechanism, this secret is treasured by Heaven itself, its mysterious law most strict, not easily heard or known. Do not regard it as something easily attained. This song is specially preserved as a ladder to Heaven for later worthies.\n\nThe *Kuan* says: *\"The Heavenly Dao is not partial, yet it is ever transmitted to the worthy.\"*\n\nMaster Ziyang thrice transmitted it to the unworthy and thrice incurred Heaven’s censure—beware, beware!\n\nThose who receive this transmission will forge an indestructible golden body through ten thousand kalpas, ascend with nine generations of ancestors to the immortal realms, and grant their wives and children boundless blessings. What treasure could compare to ten thousand taels of gold? It is but dust—how could it be worthy of exchange?]",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "吕洞宾丹道之纯阳祖师 [清]  傅金铨注 一、黄鹤赋 奥矣！ 最上一乘，乃无作而亦无为。 还丹七返，因有动而方有静。 【注：道分三乘：初乘、中乘、上乘也。 到最上一乘，无所作为。 从三关逆返，至扑地声离胎，再返至元年之初，此时声臭俱泯，廓然太虚。 一旦露出乾元面目，释氏谓之得证实相，于以见初中之必有作为也。 还丹者，丹本我之故物。 还者，自外而还于内，从彼而还于我，去而复返，失而复得之辞也。 七乃火之成数，阳动极而静，阴静极而动，动静相推，互为其根。 炼丹之道，就极静中，寻觅动机。 邵子所谓一动一静之间，天地人之至妙至妙者也。 】 上德以道全其形，斯纯乾之未破； 下德以术延其命，乃撅坎之已成。 【注：《道德经》曰； 上德不德，下德不失德。 仙训曰：形以道全，命以术延，必先有接命之术，乃能得有道，以全其形也。 纯乾未破，是全体未漏之童身。 倘遇圣师，不须用筑基接命之功，直从十月做起。 然此旷劫难有之事，过此或耗精一次，便是有漏之身。 撅坎已成者，必须行百日炼精化气之功，然后十月三也。 】 是以用阴阳之道，即依世法而修。 出世之法，效男女之生，必发天机而作泄天之机。 【注：《易》曰：一阴一阳之谓道。 《无根树》曰：离了阴阳道不全。 斯道必匹配阴阳，交接水火。 世人见入山住静，不婚不宦，便谓此是修道。 岂知道在人间，不在山内。 佛云：我于五浊恶世修行，而得大道。 夫修道欲以出世也。 岂知出世之法，即在此世法中求之。 所谓世法者，君臣、父子、夫妇、兄弟、朋友，日用平常之事也。 人道生男育女，修丹者效之。 三丰祖曰：顺生人，逆生丹。 只一句儿，超了千千万，再休题清静无为枯坐间。 天机者，天根也。 必发天根，乃可透泄此天机也。 】 方其性命以双修，须仗法财而两用。 【注：性无命不立，命无性不全。 始也以性而修命，终焉以命而全性。 始彻终，只是完全此性命二字，必要双修，不可单行。 祖不云乎只修性，不修命，恰似乌金饰顽磬； 只修命，不修性，恰似鉴容无宝镜。 又曰：只修性，不修命，此是修行第一病。 只修祖性不修丹，万劫阴灵难入圣。 萧了真曰：性命双修是的传，冥冥杳杳又玄玄。 世人只解孤修静坐，不悟双修妙理，离了阴阳，背却造化，断无成就。 若欲行双修之事，全仗法财相济。 法财者，法中之财。 两用者，两得其用也。 起手必需，所以有方其须仗之语。 】 先结同心为辅佐，次觅巨室以良图。 【注：钟离祖曰：财不难兮侣却难。 《参同契》曰：两七聚，辅翼人。 莹蟾子曰：辅弼同声不可无，三人同志谨相扶。 天来子曰：要修丹，须结友，同志三人互相守。 若无同志一般人，大药难成金汞走。 《金丹节要》曰：须择同门三友，辅弼相依。 薛道光曰：三人同志谨防危。 《鼎器歌》曰：须用同心三个人。 千经万典，皆曰三人，从未有一人独行者。 觅巨室以良图，谓欲图此事，必依巨室，常言金丹出富豪。 石杏林仙翁授薛紫贤曰：可往通都大邑依有力者为之。 《节要》谓：必依富势一家，以为内助外护。 张紫阳得马都运而后事就，薛道光得张环卫而后丹成。 先结同心，次觅机缘，渐次而求，非历年岁，未可骤得也。",
      "translated_text": "The Pure Yang Patriarch of the Lǚ Dòngbīn Alchemical Dao\nAnnotated by Fù Jīnquán of the [Qing] Dynasty\n\nI. *The Yellow Crane Rhapsody*\n\nProfound indeed! The supreme vehicle is that of non-action and non-striving.\nThe Reverted Elixir’s sevenfold return arises only when movement yields to stillness.\n\n[Annotation: The Dao is divided into three vehicles: the initial, the intermediate, and the supreme. Upon reaching the supreme vehicle, there is nothing to be done. From the Three Passes, one reverses course—upon the thunderous departure from the womb, returning once more to the origin of the first year—where sound and scent dissolve entirely, and vastness merges with the Great Void. Should the true face of *qián*-Primordial ever emerge, the Buddhists call this the realization of true suchness, thereby revealing that the initial and intermediate vehicles necessarily involve action.\nThe Reverted Elixir is the elixir that was originally one’s own. *Reversion* signifies returning from without to within, from the other back to the self, a departure that reverts, a loss that is regained. Seven is the complete number of fire; yang’s movement reaches its extreme and turns to stillness, while yin’s stillness reaches its extreme and turns to movement. Movement and stillness propel one another, each serving as the root of the other. The art of elixir refinement lies in seeking the impulse of movement within the depths of stillness. As Master Shào said: “Between one movement and one stillness lies the utmost subtlety of heaven, earth, and humanity.”]\n\nThe superior virtue preserves form through the Dao, for it is the unbroken *qián*-Primordial.\nThe lesser virtue extends life through technique, for it is the *kǎn*-Abyssal already formed.\n\n[Annotation: The *Dao De Jing* states: “Superior virtue does not act as virtue; lesser virtue does not lose virtue.” The immortal teachings say: “Form is preserved through the Dao; life is extended through technique.” One must first possess the technique to connect with life before attaining the Dao to preserve form. The unbroken *qián*-Primordial is the undefiled body of a virgin child. Should one encounter a sagely master, no foundational work of life-connecting is needed—one may proceed directly to the ten-month practice. Yet such an occurrence is rare across kalpas. Should one expend even a single drop of essence, the body becomes leaky.\nFor those in whom the *kǎn*-Abyssal is already formed, one must first undertake the hundred-day practice of refining essence into *qi*, followed by the ten-month gestation.]\n\nThus, the Dao of yin and yang is employed, relying on worldly methods for cultivation.\nThe method of transcending the world imitates the procreation of man and woman, yet it must awaken the celestial mechanism to discharge the celestial mechanism.\n\n[Annotation: The *Book of Changes* states: “The alternation of yin and yang is called the Dao.” *The Rootless Tree* says: “Apart from the Dao of yin and yang, nothing is complete.” This Dao necessarily pairs yin and yang, uniting water and fire. People see those who enter mountains to dwell in stillness, abstaining from marriage and office, and assume this is the way of cultivation. Yet the Dao resides among humanity, not within mountains. The Buddha said: “I cultivated the Way in the five turbid evil worlds and attained the Great Dao.” One seeks to transcend the world through cultivation, yet the method of transcendence is sought within worldly methods. The so-called worldly methods are the everyday affairs of ruler and minister, father and son, husband and wife, elder and younger brothers, and friends. Human procreation gives birth to sons and daughters; the elixir-refiner emulates this. Ancestor Zhāng Sānfēng said: “Following the birth of people, one reverses to birth the elixir.” A single phrase surpasses countless thousands—no more talk of desiccated sitting in quiescent non-action.\nThe *celestial mechanism* is the celestial root. Only by awakening the celestial root can one penetrate and discharge this celestial mechanism.]\n\nTo cultivate both nature and life in tandem, one must rely on the dual application of method and wealth.\n\n[Annotation: Without life, nature cannot stand; without nature, life cannot be complete. Initially, one cultivates life through nature; ultimately, one completes nature through life. From beginning to end, this is merely the full realization of the two characters *nature* and *life*—necessarily cultivated together, never singly. The Ancestor did not say: “Cultivating only nature without life is like adorning a dull chime with black gold; cultivating only life without nature is like a mirror reflecting a face without a precious glass.” He also said: “Cultivating only nature without life is the foremost illness in practice. Cultivating only the ancestral nature without the elixir, the yin spirit of ten thousand kalpas will hardly enter sagehood.” Xiāo Liǎozhēn said: “Cultivating both nature and life is the true transmission—profound, obscure, and mysterious.” People only understand solitary cultivation in stillness; they do not comprehend the wondrous principle of dual cultivation. Departing from yin and yang, turning away from creation, there can be no accomplishment. If one wishes to practice dual cultivation, one must rely on the mutual support of method and wealth. *Method and wealth* refers to resources within the method. *Dual application* means both are employed to their fullest. This is essential from the outset, hence the phrase *must rely*.]\n\nFirst, unite like-minded companions as assistants;\nNext, seek a great household to secure a favorable plan.\n\n[Annotation: Ancestor Zhōnglí said: “Wealth is not difficult to obtain; a companion is hard to find.” The *Cantong Qi* states: “The two sevens gather, assisting the practitioner.” Yíng Chánzǐ said: “Aides of like mind cannot be lacking; three of one heart must carefully support one another.” Tiān Láizǐ said: “To refine the elixir, one must find friends—three of like mind guarding one another. Without companions of the same aspiration, the great medicine will hardly form, and mercury will escape.” The *Essentials of the Golden Elixir* states: “One must select three fellow disciples as aides, mutually dependent.” Xue Daoguang said: “Three of one mind must guard against peril.” The *Song of the Cauldron* says: “Three people of one heart must be employed.” Across thousands of scriptures and ten thousand classics, all speak of three people—never has there been one who practiced alone.\n*Seeking a great household to secure a favorable plan* means that to pursue this endeavor, one must rely on a great household. The common saying goes: “The golden elixir emerges from the wealthy.” Immortal Shí Xìnglín instructed Xue Zǐxián: “Go to a bustling metropolis and rely on someone of influence.” The *Essentials* state: “One must depend on a powerful household for inner support and outer protection.” Zhāng Zǐyáng achieved success only after obtaining Mǎ Dūyùn; Xue Daoguang completed the elixir only after meeting Zhāng Huánwèi.\nFirst unite like-minded companions, then seek the opportune moment—proceeding step by step, one cannot expect sudden success without years of effort.]",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1323,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.010629415512085,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "】 然欲希至道，须密叩玄关。 【注：世人欲希图此至真之道，其理精微，其法秘密，不容易闻知，有至玄至妙之机关，当密叩于师，而密印于心也。 】 择善地慎事之机密，置丹房器皿之相当。 【注：善地者，福地也，慎事者，敬慎其事，机密而不敢露也。 丹阳祖曰：择侣择财求福地。 上阳子曰：得侣得财多外护，做仙何必到深山。 有此善地，然后置造丹房，一切器皿动用之物，必须相当。 相当者，对待也。 】 安炉立鼎譬内外，两个乾坤，炼己筑基，固彼我一身邦国。 【注：法财侣地，缺一难成。 四者俱全，然后安炉立鼎。 鼎器法天象地，因而有乾炉坤鼎之喻，有内鼎外鼎之称。 《天仙正理》曰：凡言外鼎者，指丹田之形言也； 凡言内鼎者，指丹田中之气言也。 乾坤而曰两个，两个而分内外。 祖有云：两重天地，四个阴阳是也。 鼎器既备，然后行炼己筑基之功。 己不炼，则基不可筑； 筑基不成，是炼己无功也。 古训曰：修仙有程，炼己无限。 《金丹节要》曰：采药容易，炼己最难。 务令性灵神融，心灰意定。 《天仙正理》曰：能合一，则基成； 不能合一，则基不可成。 古人每以邦国喻人之一身，心为君，气为臣，精为民。 精全气足，谓之国富民安。 《悟真篇》曰； 民安国富方求战，战罢方能见圣人。 民安国富，筑基已成也。 一身而分彼我，鼎炉有不内外乎】 紧关对境忘情，凭锐气之勇猛； 大抵煨炉铸剑，借金水之柔刚。 【注：下手行工，紧要关头，在于对境忘情。 对境而不染于境，斯真能淡于人情，忘乎物我。 当其下手之际，万念皆空，一心归命，全凭此刚锐勇猛之气，庶乎有济。 《金丹节要》谓：勇猛易就，怠惰难成。 玉液炼己之枢，金水铸剑之要，乃天地之灵根，阴阳之骨骸，得其淬利光茫，始可飞灵走圣。 时当三五，神峰利爽，刚柔应节。 祖云：一口飞灵剑两角，还丹却在峰头落。 煨炉者，温温行火也。 】 若运用，若抽添，遇险而须当沐浴；",
      "translated_text": "】 Yet those who aspire to the supreme Dao must secretly knock upon the Mysterious Pass.\n*[Annotation: When worldly people seek this most authentic Dao, its principles are subtle, its methods secret—rarely heard or known. There exists a mechanism most profound and wondrous; one must secretly inquire of the master and inwardly seal it in the heart.]*\n\nChoose an auspicious site and guard the secrecy of the work; prepare the alchemical chamber and ensure the vessels are properly matched.\n*[Annotation: An \"auspicious site\" is a blessed place; \"guarding secrecy\" means reverently attending to the work with utmost discretion, never daring to reveal it. Ancestor Dānyáng said: \"Select companions, select resources, seek a blessed site.\" Master Shàngyáng said: \"With companions and resources, much external protection—why must one retreat to deep mountains to become immortal?\" Only with such a site may one then establish the alchemical chamber, where all vessels and implements must be properly matched. \"Properly matched\" means harmoniously paired.]*\n\nSetting the furnace and erecting the crucible symbolize inner and outer—two Qian and Kun, heaven and earth. Refining the self and laying the foundation fortify both the personal realm and the state.\n*[Annotation: Method, resources, companions, and site—lacking any one, success is impossible. Only when all four are complete may one set the furnace and erect the crucible. The crucible emulates heaven and earth, hence the metaphors of the Qian furnace and Kun crucible, or inner and outer crucibles. *The True Principle of Heavenly Immortality* states: \"The outer crucible refers to the form of the elixir field; the inner crucible refers to the qi within the elixir field.\" Qian and Kun are called \"two,\" and these two are divided into inner and outer. The Ancestor said: \"Two layers of heaven and earth, four phases of yin and yang.\" Once the crucible is prepared, one proceeds to refine the self and lay the foundation. Without refining the self, the foundation cannot be laid; if the foundation is not laid, refining the self is in vain. Ancient teachings say: \"Cultivation has its stages; refining the self is boundless.\" *Essentials of the Golden Elixir* states: \"Gathering the medicine is easy; refining the self is most difficult.\" One must ensure the spirit is harmonious, the mind ashen, and the will settled. *The True Principle of Heavenly Immortality* says: \"If unity is achieved, the foundation is laid; if unity is not achieved, the foundation cannot be laid.\" The ancients often compared the state to the human body: the heart as ruler, qi as minister, essence as the people. When essence is whole and qi abundant, it is called \"a prosperous state with contented people.\" *Awakening to Reality* says: \"Only when the people are content and the state prosperous may one seek battle; after battle, one may behold the sage.\" \"The people content and the state prosperous\" means the foundation is laid. The body is divided into self and other—how could the crucible and furnace not be inner and outer?]*\n\nAt the critical juncture, face circumstances without attachment, relying on the courage of keen vigor. Generally, temper the furnace and forge the sword, drawing upon the softness and hardness of Metal and Water.\n*[Annotation: At the outset of practice, the crucial moment lies in facing circumstances without attachment. Confronting them yet unstained, one truly transcends worldly passions and forgets self and other. When beginning, all thoughts are emptied, the mind wholly devoted—entirely dependent on this resolute, keen, and courageous qi, may success be possible. *Essentials of the Golden Elixir* states: \"With courage, success comes easily; with indolence, it is hard to achieve.\" The pivot of refining the self with Jade Liquid, the essence of forging the sword with Metal and Water—these are the spiritual roots of heaven and earth, the skeletal framework of yin and yang. Only when tempered to radiant sharpness may one soar as a spirit and walk as a sage. At the time of the third and fifth phases, the divine peak is keen and bright, hardness and softness responding in rhythm. The Ancestor said: \"A flying spirit-sword with two edges—yet the returned elixir falls at the peak’s summit.\" \"Tempering the furnace\" means applying fire gently.]*\n\nIn operation, in withdrawal and addition, when encountering peril, one must bathe;",
      "overlap_context": "lthy.” Immortal Shí Xìnglín instructed Xue Zǐxián: “Go to a bustling metropolis and rely on someone of influence.” The *Essentials* state: “One must depend on a powerful household for inner support and outer protection.” Zhāng Zǐyáng achieved success only after obtaining Mǎ Dūyùn; Xue Daoguang completed the elixir only after meeting Zhāng Huánwèi.\nFirst unite like-minded companions, then seek the opportune moment—proceeding step by step, one cannot expect sudden success without years of effort.]",
      "start_char": 1323,
      "end_char": 2149,
      "start_sentence": 72,
      "end_sentence": 116,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.764979600906372,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若鼓琴，若敲竹，逢争而便宜守雌。 【注：天关在手，地轴由心，枢纽阴阳，斡旋造化，运乾坤阖辟之机，行日月交并之法，抽铅添汞，帘帷光透，铅鼎温温，龙虎会于鹊桥。 斯时大有危险，当退火停符，行沐浴之工。 沐浴者，洗心退藏之谓也。 《金丹真传》曰：竹要敲，琴要鼓。 《一枝花》曰：俺向花丛中，敲竹鼓琴心似水。 《节要》曰：先敲竹以提死，次鼓琴以和音。 《悟真》曰：敲竹唤龟吞紫芝，鼓琴招凤饮刀圭。 敲竹以虚其心，鼓琴以实其腹。 经曰：水善下而不争，是真能守雌者矣。 老子曰：未尝先人，而尝随人。 《悟真》曰：劝君临阵休轻敌。 又曰：饶他为主我为宾。 只此便是不争，对面的乾兑，倒转的夫妻，得唱随之义矣。 百日功灵，曲直而能应物。 一年功熟，追摄而已由心。 【注：《玉皇心印经》曰：回风混合，百日功灵。 《金丹节要》曰：功成百日，妙夺周天，能曲能直，应物而灵。 一年者，大慨而言之，即十月加卯酉也。 薛道光曰：一年沐浴防危险，十月调和须谨节。 《采金歌》曰：十月功夫要勤咽。 到此胎成果熟，追摄由心。 所谓三百日火，一十月胎，其神离身，忽去忽来，除死录，证仙阶，只待调神出壳。 行三年乳哺、九年面壁之功矣。 】",
      "translated_text": "When plucking the zither or tapping bamboo, upon encountering contention, it is fitting to embrace the feminine. *[Note: The celestial gate lies in the hand, the earthly axis moves with the heart—pivoting yin and yang, steering the transformations of creation, wielding the mechanism of heaven and earth’s opening and closing, practicing the method of sun and moon’s union. Withdrawing lead and adding mercury, the curtain’s light shines through; the lead cauldron glows gently as dragon and tiger meet at the Magpie Bridge. At this moment, great peril arises—one must withdraw the fire, halt the talismans, and perform the work of bathing. Bathing means washing the heart and retiring into concealment. *The True Transmission of the Golden Elixir* states: \"Bamboo must be tapped, the zither must be plucked.\" *A Sprig of Flowers* says: \"Amidst the blossoms, I tap bamboo and pluck the zither, my heart serene as water.\" *Essentials* says: \"First tap bamboo to rouse the dead, then pluck the zither to harmonize the sound.\" *Awakening to Reality* says: \"Tap bamboo to summon the tortoise to swallow purple mushrooms, pluck the zither to call the phoenix to drink the elixir pellet.\" Tapping bamboo empties the heart; plucking the zither fills the belly. The classic says: \"Water flows downward and does not contend—this is truly embracing the feminine.\" Laozi says: \"Never strive to be first, but always follow others.\" *Awakening to Reality* says: \"I urge you: in battle, do not underestimate the enemy.\" And again: \"Let them take the lead; I shall be the guest.\" This is the essence of non-contention. Facing Qian and Dui, reversing husband and wife—here lies the meaning of harmony and accord. After a hundred days, the work becomes spiritually responsive, bending and straightening as circumstances demand. After a year, the work matures, and pursuit and absorption become effortless. *[Note: *The Jade Emperor’s Heart Seal Scripture* says: \"When the returning wind blends, a hundred days bring spiritual efficacy.\" *Essentials of the Golden Elixir* says: \"After a hundred days of work, marvelously seizing the celestial cycle, one bends and straightens, responding to things with spiritual agility.\" A year is roughly stated—ten months plus Mao and You. Xue Daoguang says: \"In the first year, bathing guards against peril; in ten months, regulation requires careful moderation.\" *The Song of Gathering Gold* says: \"In ten months, diligently swallow the elixir.\" By this time, the embryo is formed and the fruit ripens—pursuit and absorption follow the heart. This is what is meant by \"three hundred days of fire, ten months of gestation.\" The spirit leaves the body, coming and going at will, erasing the record of death and attaining the rank of immortality—only awaiting the refinement of the spirit to emerge from the shell. Then follows three years of nursing and nine years of wall-facing.]*]*",
      "overlap_context": "rth, the skeletal framework of yin and yang. Only when tempered to radiant sharpness may one soar as a spirit and walk as a sage. At the time of the third and fifth phases, the divine peak is keen and bright, hardness and softness responding in rhythm. The Ancestor said: \"A flying spirit-sword with two edges—yet the returned elixir falls at the peak’s summit.\" \"Tempering the furnace\" means applying fire gently.]*\n\nIn operation, in withdrawal and addition, when encountering peril, one must bathe;",
      "start_char": 2149,
      "end_char": 2657,
      "start_sentence": 117,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.937100648880005,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "能盗彼杀中之生气，以点我阳里之阴精。 【注：道者，盗机也。 于极阴中盗取至阳，故《阴符经》曰：其盗机也。 天下莫能见，莫能知。 斯道水火同宫，生杀互用。 生气即在此杀气之中求之。 上阳子谓：有杀人刀子，活人手段。 《悟真篇》曰：若能转此生杀机，反掌之间灾变福。 又曰：若会杀机明反覆，始知害里却生恩。 三才相盗，窃天地之机，而长生不死。 夫我乃阳里之阴精。 《悟真》谓：阳里阴精质不刚，独修一物转羸诳。 必须得彼杀中生气以点之。 故曰：但得坎精点离穴，纯乾便可摄飞琼。 盗彼点我，如此明白，人何不细思乎】 玉液金液，一了性而一了命； 二候四候，半在坎而半在离。 【注：玉液了性，金液了命。 《金丹节要》曰：玉液还丹更妙玄，全凭金液炼凡铅。 又因铸剑成栽接，赢得长春寿万年。 又曰：金丹大道，全在神交。 玉液玄机，别无妙术。 一时六候，前二候得药，后四候温养。 所谓二候采牟尼，四候别神功。 半坎半离，非将六候分配坎离。 盖离虚坎实，离为阳中阴，坎为阴中阳。 故曰：取将坎位中心实，点化离宫腹内阴。 】 始也将无人有，已见龙居虎位； 终焉流戊就己，始知虎会龙宫。 【注：《参同契》曰：有无互相入，上有神德居。 无者性也，有者命也。 将无入有，起初入手之功，以性修而命也。 性为青龙，命为白虎，探虎穴，拔虎须，寻虎酥酪，虎穴龙眠矣。 己为阳土，戊为阴土，二土成圭。 《鹤林》曰：流戊作媒将就己，金来归性贺新郎。 白虎，水中金也； 青龙，火中木也。 木火同宫，金水为侣。 二物中含四象，交会玄宫，而丹结矣。 】 吕洞宾丹道之纯阳祖师“五篇”",
      "translated_text": "\"One steals the generative qi within that destructive force to infuse one’s own yin essence within yang. *[Note: The Dao is the mechanism of theft. From the depths of yin, one steals the utmost yang—thus the *Classic of the Hidden Correspondence* says: 'This mechanism of theft—none in the world can see it, none can know it.' This Dao unites water and fire in one palace, employing life and death interchangeably. The generative qi is sought within this destructive qi. Master Shangyang said: 'There is a blade that kills, and a technique that revives.' The *Awakening to Reality* says: 'If one can turn this mechanism of life and death, disaster transforms into fortune in the turn of a palm.' It also says: 'If one understands the mechanism of killing and its reversals, one knows that harm conceals grace.' The Three Powers steal from one another, seizing the mechanism of Heaven and Earth to attain longevity and deathlessness. Now, what I possess is the yin essence within yang. As *Awakening to Reality* states: 'The yin essence within yang is not firm in substance; cultivating this single element only leads to delusion and weakness.' One must obtain the generative qi within that destructive force to infuse it. Thus it is said: 'If only the essence of Kan infuses the cavity of Li, pure Qian can then embrace the flying jade.' Stealing from that to infuse this—how clear this is, yet why do people not ponder it deeply?]*\n\nThe Jade Liquid and Golden Liquid perfect one’s nature and one’s life respectively; the two phases and four phases are half in Kan and half in Li. *[Note: The Jade Liquid perfects nature, the Golden Liquid perfects life. The *Essentials of the Golden Elixir* says: 'The Jade Liquid’s returning elixir is wondrously subtle, relying entirely on the Golden Liquid to refine mortal lead.' It also says: 'Through forging the sword and grafting, one attains eternal spring and longevity of ten thousand years.' It further states: 'The great Dao of the Golden Elixir lies wholly in the communion of spirit. The subtle mechanism of the Jade Liquid has no other wondrous technique.' The six phases of one hour: the first two phases gather the medicine, the latter four phases nurture it. As it is said: 'Two phases to gather the pearl, four phases to refine the spiritual work.' Half in Kan, half in Li—this does not mean dividing the six phases between Kan and Li. Rather, Li is empty while Kan is full; Li is yang within yin, Kan is yin within yang. Thus it is said: 'Take the solid center from the Kan position, infuse it to transform the yin within the Li palace.']*\n\nAt first, one brings nonbeing into being, and already the dragon resides in the tiger’s position; in the end, one flows Wu into Ji, and only then does one know the tiger meets the dragon’s palace. *[Note: The *Token for the Agreement of the Three* says: 'Being and nonbeing interpenetrate; above, the spirit-virtue resides.' Nonbeing is nature, being is life. Bringing nonbeing into being is the initial work of entry, cultivating life through nature. Nature is the Azure Dragon, life is the White Tiger. Exploring the tiger’s den, plucking the tiger’s whiskers, seeking the tiger’s marrow—thus the tiger’s den becomes the dragon’s abode. Ji is yang earth, Wu is yin earth; the two earths form the jade tablet. The *Crane Grove* says: 'Flowing Wu acts as the matchmaker to approach Ji; metal returns to nature, celebrating the bridegroom.' The White Tiger is metal within water; the Azure Dragon is wood within fire. Wood and fire share a palace, metal and water become companions. These two entities contain the Four Images; their union in the mysterious palace coalesces the elixir.']*\n\nLü Dongbin, the Pure Yang Patriarch of the Dao of the Elixir—*Five Chapters*\"",
      "overlap_context": "ing Gold* says: \"In ten months, diligently swallow the elixir.\" By this time, the embryo is formed and the fruit ripens—pursuit and absorption follow the heart. This is what is meant by \"three hundred days of fire, ten months of gestation.\" The spirit leaves the body, coming and going at will, erasing the record of death and attaining the rank of immortality—only awaiting the refinement of the spirit to emerge from the shell. Then follows three years of nursing and nine years of wall-facing.]*]*",
      "start_char": 2658,
      "end_char": 3340,
      "start_sentence": 142,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.66010808944702,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "(2005-12-7 11:01:39) 要知药物之老嫩，在辨水源之清浊。 【注：采药真工，端在分别老嫩。 《天仙正理》曰：真工不明，虽采之而无药可采。 药气未至于纯阳，虽知采之，而药不为之采。 盖嫩则气未足，老则气已散，皆不成丹。 夫所谓水源者，天一之生，贵于清洁，不贵污浊，而亦由于一心之静定。 古歌曰：意定神闲水源清，意乱神昏水源浊。 辨之常审，行之要精，不容丝毫盲昧。 】 炼己待时者，务待阳生于赤县； 遇急临炉者，必须癸动于神州。 【注：《泌园春》曰：七返还丹，在人先须炼己等时。 正一阳初动，此其时矣。 待时者，候其时之来也。 赤县，犹云赤水。 赤水玄珠，依时可得。 盖临炉对境，必候真时。 遇急者，令到即行，时不可失。 癸动者，癸生之候。 《悟真》谓“铅遇癸生须急采”是也。 《采金歌》曰：知癸生，晓癸现，三十时辰两日半。 阳生赤县，癸动神州。 求炉置鼎者，可不知乎】 若观见龙在田，须猛烹而极煅； 忽闻虎啸出窟，可倒转而逆施。 【注：《易》曰：见龙在田，利见大人。 此乾之九二爻，正好抽添，须当猛烹极煅。 非若初九潜龙之太嫩，及九三成质，不堪采取也。 《悟真篇》曰：西山白虎正猖狂，东海青龙不可当。 两手捉来令死斗，化成一块紫金霜。 《金丹四百字》曰：龙从东海来，虎向西山起。 两兽战一场，化作天地髓。 颠倒阴阳，逆施造化，吹巽风，鼓橐龠，自太玄关，逆流至天谷穴，金精贯顶，银流滔天，泥丸风生； 绛宫月明，鹊桥瑞香，甘露下降，百脉归元，九关彻底，所谓“乾坤交媾罢，一点落黄庭”。 】 所谓火逼金行出坤炉，故名七返； 金因火炼归乾鼎，号曰九还。 【注：金即药也。 《参同契》曰：金来归性初，乃得称还丹。 《指南》曰； 火逼金行，颠倒自然。 《唱道真盲》谓； 人知火克金，而不知金实爱火。 金未出矿离炉，非猛火逼之，无由上升。 所以曰：七返，朱砂反本； 九还，金液还原。 七乃火数，九乃金数。 出坤炉，归乾鼎，一施一受，而为返还。 一性一情，而为运用，谓之取坎填离，谓之还精补脑，谓之点离穴，谓之复还乾健体，皆此之义。 】 还者，乾所失而复得之物； 返者，我已去而复来之真。 【注：先天之乾坤，变而为后天之坎离，是乾之中爻，有所失也。 今者取得坎位中心实，点化离宫腹内阴，乾之所失，今复还乾，我即乾也。 自先天混洞之始，失落而去，今者得返我所故有，岂非去而复来乎 】 殊不知，顺则生人生物，逆者成成仙佛。 【注：“殊不知”三字，犹言甚易知也。 老子曰； 吾道甚易知，甚易行； 而天下莫能知，莫能行。 夫天地与我同根，万物与我同体。 人为万物之灵，而与万物并育。 故人物合称。 欲知生仙生佛之理，初不异于生人生物之理，只争顺逆耳。 顺则生凡，逆则成圣，此古训也。 陀阳真人《入火镜》曰：顺则人，逆则丹。 得此理，便成仙。 《无根树》曰：顺为凡，逆为仙，只在中间颠倒颠。 《一笔勾》曰：若知你生身的根由，才晓得造化在手。 张紫阳曰：五行顺兮，常道有生有灭； 五行逆兮，丹鼎常灵常存。 《灵宝毕法》曰：人受凡父母精血之初，溟滓混沌而无形。",
      "translated_text": "To discern the maturity of medicinal substances, one must distinguish the clarity or turbidity of the water’s source.\n\n[**Note:** The true work of gathering the medicine hinges on distinguishing maturity. *The Orthodox Principles of Heavenly Immortals* states: \"If the true work is unclear, though one gathers, there is no medicine to gather. If the medicinal *qi* has not yet reached pure yang, though one knows to gather, the medicine will not be gathered. For if it is too tender, the *qi* is insufficient; if too old, the *qi* has already dispersed—neither can form the elixir. The so-called water’s source arises from the Heavenly One’s generation, prizing clarity and purity, not filth and turbidity, and this also depends on the stillness and stability of the mind. An ancient song says: *When intent is settled and spirit at ease, the water’s source is clear; when intent is scattered and spirit confused, the water’s source is turbid.* Discernment must be constant and meticulous, execution precise, allowing no trace of blindness or ignorance.]\n\nThose who refine the self and await the moment must wait for yang to arise in the Red County; those who encounter urgency at the furnace must ensure *gui* stirs within the Divine Continent.\n\n[**Note:** *The Spring at Miluo* says: \"The sevenfold return of the elixir first requires refining the self and awaiting the moment. When the first yang stirs, that is the time. Awaiting the moment means waiting for its arrival. The Red County is like the Red Water. The Dark Pearl of Red Water may be obtained in due time. Thus, when facing the furnace and its conditions, one must await the true moment. Those who encounter urgency act immediately upon arrival, for the moment must not be lost. *Gui* stirring refers to the time of *gui*’s arising. *Awakening to Reality* says, *'When lead encounters *gui* arising, gather it swiftly.'* *The Song of Gathering Gold* states: *'Know when *gui* is born, recognize when *gui* appears—thirty-six hours, two and a half days.'* Yang arises in the Red County, *gui* stirs in the Divine Continent. How can one who seeks the furnace and sets the tripod remain ignorant of this?\"]\n\nWhen one observes the dragon in the field, one must fiercely refine and intensely forge; when one suddenly hears the tiger’s roar emerging from its den, one may invert and reverse the process.\n\n[**Note:** The *Book of Changes* says: *\"Seeing the dragon in the field is beneficial for meeting the great person.\"* This is the second yang line of *Qian*, the perfect time for withdrawal and addition, requiring fierce refining and intense forging. It is not like the first yang line, the hidden dragon, which is too tender, nor the third yang line, which has already formed a substance and is unfit for gathering. *Awakening to Reality* says: *\"The White Tiger of Western Mountain rages wildly; the Azure Dragon of Eastern Sea cannot be withstood. Seize them with both hands and make them fight to the death, transforming into a lump of purple frost.\"* *The Four Hundred Words on the Golden Elixir* states: *\"The dragon comes from the Eastern Sea; the tiger rises from Western Mountain. The two beasts battle fiercely, transforming into the marrow of heaven and earth.\"* Inverting yin and yang, reversing the workings of creation, blowing the *xun* wind, fanning the bellows, from the Great Mysterious Pass, flowing backward to the Heavenly Valley Cavern, golden essence pierces the crown, silver streams surge like the sky, wind stirs in the Mud Pill Palace; the Crimson Palace shines with moonlight, the Magpie Bridge emits auspicious fragrance, sweet dew descends, the hundred vessels return to the origin, the nine passes are thoroughly opened—this is what is meant by *\"When the union of Qian and Kun ceases, a single point falls into the Yellow Court.\"*\n\nThe fire compels the metal to move and exit the Kun furnace, hence the name \"seven returns\"; the metal, refined by fire, returns to the Qian tripod, called the \"nine refinements.\"\n\n[**Note:** The metal is the medicine. *The Kinship of the Three* says: *\"When metal returns to its nature, it may then be called the returned elixir.\"* *The Guide* states: *\"Fire compels metal to move, inverting the natural order.\"* *The True Blind of Chanting the Dao* says: *\"People know fire overcomes metal, but do not know metal truly loves fire. Before metal leaves the ore and departs the furnace, without fierce fire compelling it, it cannot ascend.\"* Thus it is said: the seven returns are cinnabar returning to its origin; the nine refinements are golden liquid returning to its source. Seven is the number of fire; nine is the number of metal. Exiting the Kun furnace, returning to the Qian tripod, one gives and one receives, forming the return and refinement. One is nature, one is emotion, and this is called extracting from Kan to fill Li, returning essence to replenish the brain, illuminating the Li cavity, restoring the robust body of Qian—all refer to this meaning.]\n\nThe \"return\" is the substance Qian lost and has now regained; the \"refinement\" is the true self that departed and has now returned.\n\n[**Note:** The precelestial Qian and Kun transformed into the postcelestial Kan and Li, meaning the middle line of Qian was lost. Now, taking the solid center of the Kan position and using it to transform the yin within the Li palace, what Qian lost is now returned to Qian—I am Qian. From the beginning of the primordial chaos, what was lost has now returned to its original state. Is this not what departed and has now come back?]\n\nLittle do they know that following the natural order gives rise to humans and beings, while reversing it produces immortals and buddhas.\n\n[**Note:** The phrase *\"little do they know\"* means it is easily understood. Laozi said: *\"My Dao is very easy to know, very easy to practice; yet the world cannot know it, cannot practice it.\"* Heaven and earth share the same root with me; the myriad things share the same body with me. Humans are the most spiritually endowed of all beings and grow alongside them. Thus, humans and beings are collectively named. To know the principle of becoming immortals and buddhas is initially no different from the principle of giving rise to humans and beings—only the distinction between following and reversing matters. Following gives rise to the ordinary; reversing produces the sage—this is ancient teaching. Master Tuo Yang’s *Entering the Mirror of Fire* says: *\"Following produces humans; reversing produces the elixir. Grasping this principle, one becomes an immortal.\"* *The Rootless Tree* states: *\"Following makes one ordinary; reversing makes one an immortal—only a reversal in between.\"* *A Single Stroke* says: *\"If you know the origin of your birth, you will understand that creation lies in your hands.\"* Zhang Ziyang said: *\"When the five phases follow the natural order, the common Dao has birth and death; when the five phases reverse, the elixir tripod remains eternally numinous and enduring.\"* *The Complete Methods of the Numinous Treasure* says: *\"When humans first receive the essence and blood of their ordinary parents, they are turbid and chaotic, without form.\"*]",
      "overlap_context": " earth; the two earths form the jade tablet. The *Crane Grove* says: 'Flowing Wu acts as the matchmaker to approach Ji; metal returns to nature, celebrating the bridegroom.' The White Tiger is metal within water; the Azure Dragon is wood within fire. Wood and fire share a palace, metal and water become companions. These two entities contain the Four Images; their union in the mysterious palace coalesces the elixir.']*\n\nLü Dongbin, the Pure Yang Patriarch of the Dao of the Elixir—*Five Chapters*\"",
      "start_char": 3343,
      "end_char": 4640,
      "start_sentence": 184,
      "end_sentence": 256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.49557113647461,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "精血既安，一月为胞，二月成胎，三月生魂，四月定魄，五月分五脏，六月开六腑，七月明七窍，八月具八景，九月相足，十月气全，脱胎而生。 还丹之道，大率类此。 方其受灵父圣母妙气之初，必九和十合，而金气始来，亦溟滓混沌，洞灵寥廓，无色无渊之可倚，无形无影之可依，元气镇安，五行敷落，弥罗周回，冥然凝合。 泛啸朗营，复元归空，摄聚郁辅，含孕怀真，生五脏，理五气，合百神，结胎婴，号曰阳神。 】 虽分彼我，实非闺丹御女之术；",
      "translated_text": "When the essence and blood settle, in the first month a gestational sac forms; in the second, the embryo takes shape; in the third, the hun-soul arises; in the fourth, the po-soul is fixed; in the fifth, the five viscera divide; in the sixth, the six bowels open; in the seventh, the seven orifices become clear; in the eighth, the eight luminous scenes are complete; in the ninth, the limbs are fully formed; in the tenth, the qi is whole—then the fetus emerges and is born.\n\nThe Way of the Returned Elixir largely follows this pattern. At the moment one receives the wondrous qi of the numinous father and sagely mother, the nine must harmonize with the ten before the metallic qi begins to arrive. It too is turbid and chaotic, an empty vastness of numinous clarity—no color or depth to rely upon, no form or shadow to depend on. The primordial qi rests in tranquility; the five phases scatter and spread, filling the encompassing expanse, silently congealing and merging. Drifting and roaming in luminous cultivation, it returns to the origin and reverts to emptiness; gathering and condensing in dense support, it conceives and nurtures the true, gives rise to the five viscera, orders the five qi, unites the hundred spirits, and knits the fetal immortal—this is called the yang-spirit.\n\nThough it distinguishes self from other, it is in no way the chamber arts of bedroom alchemy.",
      "overlap_context": "tween.\"* *A Single Stroke* says: *\"If you know the origin of your birth, you will understand that creation lies in your hands.\"* Zhang Ziyang said: *\"When the five phases follow the natural order, the common Dao has birth and death; when the five phases reverse, the elixir tripod remains eternally numinous and enduring.\"* *The Complete Methods of the Numinous Treasure* says: *\"When humans first receive the essence and blood of their ordinary parents, they are turbid and chaotic, without form.\"*]",
      "start_char": 4640,
      "end_char": 4855,
      "start_sentence": 257,
      "end_sentence": 262,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.269710302352905,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "若执一己，岂达鹏鸟图南之机。 【注：上文能盗彼杀中之生气，以点我阳里之阴精，已分明彼我矣。 兹复申言之。 虽分彼我，实属正大光明，并非卑污暧昧。 试看天地间，何者非对待之数乎有天便有地，有日便有月，有阴便有阳，有男便有女，有我便有彼。 则凡寒暑昼夜，清浊动静，刚柔夫妇，牝牡雌雄，有独而不配者乎失其理矣。 祖师慈悲度世，恐人错认此理，猜为闺丹食秽，御女采战，此地狱妄人，不知彼我之事者也。 故申言曰：虽有彼我之分，实非此等之事。 《庄子》曰：北溟有鱼，其名为鲲。 鲲之大不知其几千万里也。 化而为鸟，其名为鹏。 鹏之大不知其几千万里也。 是鸟也，海运则将徙于南溟。 以鲲鹏喻道之大，化而为鸟，化气而腾也。 自北而南，由彼至我也。 我为离，为南方朱雀，中含木液青龙； 彼为坎，为北方玄武，中含金精白虎。 祖师垂慈，恐人死执着心肾，在一己身中摸索，便不解庄周图南之文义也。 《一笔勾》曰：只说是命在我身里头，谁晓得一己无有。 此个妙术，此个机关，原有彼我之分，不是一己之事。 】",
      "translated_text": "Should one cling to the solitary self, how could one grasp the Peng bird’s mechanism for soaring south?\n\nThough the distinction between self and other is already clear—where one steals the life-qi from the other’s midst of slaying to refine the yin essence within one’s own yang—this is further expounded here. While self and other are distinct, the process is upright and luminous, far from base, murky, or obscure. Observe the world: what does not follow the principle of duality? Where there is heaven, there is earth; where there is sun, there is moon; where there is yin, there is yang; where there is male, there is female; where there is self, there is other. Then consider cold and heat, day and night, purity and turbidity, movement and stillness, hardness and softness, husband and wife, female and male—is there anything singular that lacks its counterpart? To deny this is to lose the principle.\n\nThe ancestral masters, in their compassion to deliver the world, feared that people might misconstrue this principle as the chamber arts of bedroom alchemy, the consumption of filth, or the tactics of \"bedroom warfare\"—these are the delusions of hell-bound fools who fail to comprehend the matter of self and other. Thus, they reiterate: though there is a distinction between self and other, it is not that sort of affair.\n\n*Master Zhuang* says: \"In the Northern Darkness there is a fish, and its name is Kun. The Kun’s greatness—no one knows how many thousand *li* it spans. It transforms into a bird, and its name is Peng. The Peng’s greatness—no one knows how many thousand *li* it spans. When this bird stirs, it will migrate to the Southern Darkness.\" The Kun and Peng are metaphors for the vastness of the Dao, transforming into a bird, transmuting qi to ascend. From north to south, from other to self. The self is *li*, the Vermilion Bird of the south, containing within it the Wood-fluid Azure Dragon; the other is *kan*, the Dark Warrior of the north, containing within it the Metal-essence White Tiger.\n\nThe ancestral masters, in their mercy, feared that people would rigidly fixate on heart and kidneys, groping within the confines of their own bodies, and thus fail to understand Master Zhuang’s meaning of \"soaring south.\" *A Single Stroke* says: \"They say destiny lies within this body of mine—who realizes that the solitary self possesses nothing? This wondrous art, this mechanism, fundamentally involves the distinction between self and other; it is not the affair of a solitary self.\"",
      "overlap_context": "s scatter and spread, filling the encompassing expanse, silently congealing and merging. Drifting and roaming in luminous cultivation, it returns to the origin and reverts to emptiness; gathering and condensing in dense support, it conceives and nurtures the true, gives rise to the five viscera, orders the five qi, unites the hundred spirits, and knits the fetal immortal—this is called the yang-spirit.\n\nThough it distinguishes self from other, it is in no way the chamber arts of bedroom alchemy.",
      "start_char": 4855,
      "end_char": 5282,
      "start_sentence": 263,
      "end_sentence": 283,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.913296222686768,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "坎中一点黑铅，号曰先天，非同类而终不能得； 离里七般朱汞，无真种而片刻难留。 【注：《参同契》曰：坎男为日，离女为月； 日以施德，月以舒光。 月受日化，体不亏伤。 坎中一点真阳，是为黑铅。 本玄水之精，先天之真气也。 离中一点水汞，是为朱砂。 本太阳之气，先天之真液也。 《灵宝毕法》曰：天一生水，坎中藏铅； 地二生火，离中产砂。 抱天一之精，而为五精之首者，黑铅也。 铅以生银，铅乃银之母，感太阳之气，而为众石之首者，朱砂也。 砂中生汞，汞乃砂之子。 难得者铅中之银，易失者砂中之汞。 祖师慈悲指点，谓欲觅此一点黑铅，当于同类中求之。 《契》曰：同类易施功，非种难为巧。 又曰：以类附自然，物成易陶冶。 又曰：同类者相从，事乖不成宝。 又曰：雌雄错杂，以类相求。 三丰祖曰：除此同类都是狂。 《节要》曰：但有得同类而易成，乏丹财而不成者。 《无根树》曰：类相同，好用功。 苟非同类，则孤阴不生，断无有得铅之日。 离卦外阳而内阴，即我是也。 七般七窍，所出之津液也。 钟离祖曰：人身内外皆属阴，不知何物是阳精真种者，先天真气，黑铅是也。 汞性飞扬难制。 《契》谓：鬼隐龙匿，莫知所存。 得先天真铅一到，则真汞自留，不复飞扬。 如猫伏鼠，如兔逢鹰，自然而驯矣。 】",
      "translated_text": "Within *kan* resides a speck of black lead, called the primordial—without its kindred, it can never be obtained; within *li* dwell sevenfold vermilion cinnabar-mercuries, yet without the true seed, they vanish in an instant.\n\n[Annotation: The *Cantong Qi* states: \"The *kan*-male is the sun, the *li*-female the moon; the sun bestows virtue, the moon unfurls its light. The moon receives the sun’s transformation, its body unharmed and unwaning.\" The single speck of true yang within *kan* is the black lead, the essence of mysterious water, the primordial true qi. The single speck of water-mercury within *li* is cinnabar, the essence of grand yang, the primordial true fluid. The *Lingbao Bifa* says: \"Heaven-one generates water, and within *kan* lies lead; Earth-two generates fire, and within *li* arises cinnabar.\" Embracing the essence of Heaven-one, it stands as the chief of the five essences—this is black lead. Lead gives birth to silver, lead is silver’s mother; receiving the qi of grand yang, it becomes the foremost among all stones—this is cinnabar. Within cinnabar is born mercury, mercury the child of cinnabar. Hard to obtain is the silver within lead, easy to lose is the mercury within cinnabar. The ancestral masters, in their compassion, pointed out that to seek this speck of black lead, one must search among its kindred. The *Cantong Qi* says: \"Kindred easily yield to effort, without the seed skill avails not.\" Again: \"Attaching to kindred accords with nature, things form readily through refinement.\" Again: \"Kindred follow one another, affairs contrary yield no treasure.\" Again: \"Yin and yang intermingle, seeking their kindred.\" Ancestor Sanfeng said: \"All else apart from this kindred is madness.\" The *Jieyao* states: \"Only with kindred is success easy; lacking the elixir’s wealth, it cannot be achieved.\" The *Wugenshu* says: \"Kindred align, work proceeds well.\" Without kindred, solitary yin cannot generate, and the day of obtaining lead will never come.\n\nThe *li* trigram is yang without and yin within—this is the self. Its sevenfold seven apertures emit the fluids. Ancestor Zhongli said: \"Within the human body, inside and out, all is yin. What is the yang essence, the true seed? It is the primordial true qi—black lead.\" Mercury’s nature is volatile and hard to restrain. The *Cantong Qi* says: \"Ghosts hide, dragons conceal, none know where they abide.\" Yet when a speck of primordial true lead arrives, true mercury naturally abides, no longer flying away. Like a cat pouncing on a mouse, like a hare meeting a hawk, it becomes docile of its own accord.",
      "overlap_context": "ite Tiger.\n\nThe ancestral masters, in their mercy, feared that people would rigidly fixate on heart and kidneys, groping within the confines of their own bodies, and thus fail to understand Master Zhuang’s meaning of \"soaring south.\" *A Single Stroke* says: \"They say destiny lies within this body of mine—who realizes that the solitary self possesses nothing? This wondrous art, this mechanism, fundamentally involves the distinction between self and other; it is not the affair of a solitary self.\"",
      "start_char": 5283,
      "end_char": 5797,
      "start_sentence": 284,
      "end_sentence": 315,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.679168939590454,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "是以假乾坤，立炉鼎，觅太乙所含之真气，赖阴阳作筌蹄，求水府所蕴之玄珠。 【注：因乾坤有鼎炉之名，因鼎炉有药物之称。 斯道借假修真，弄假成真。 《百句章》曰：他未知吾道，分明假作真。 借喻乾坤，强名炉鼎。 《复命篇》曰：鼎鼎原无鼎。 又曰：此药无炉只有鼎，一鼎化为千万鼎。 假乾坤为炉鼎之名，借易象明丹道之理。 惟在得象忘言，不可执文泥象。 先天太乙之真气，觅之非炉鼎无从施工； 鼎炉非乾坤无以显象。 不晓阴阳，无从下手。 是阴阳实修丹之筌蹄。 筌以求鱼，蹄以获兔，法则是也，玄珠丹也。 此珠蕴于北极太渊之中，求之者，须洞彻阴阳，深明造化。 有如求鱼之有筌，获兔之有蹄，庶有把捉，不至虚妄无成矣。 】",
      "translated_text": "Thus, one borrows Qian and Kun to establish the crucible and furnace, seeking the true qi contained within the Great One, relying on yin and yang as the means to pursue the mysterious pearl stored in the Water Palace.\n\n[Annotation: Qian and Kun possess the names of crucible and furnace; the crucible and furnace bear the designations of medicinal substances. This Way borrows the false to cultivate the true, turning the false into the true. The *Bai Ju Zhang* says: \"Others know not our Way—clearly, the false is made real.\" Borrowing Qian and Kun as metaphors, one forcibly names them crucible and furnace. The *Fuming Pian* says: \"The crucible—originally, there is no crucible.\" It also says: \"This medicine has no furnace, only a crucible; one crucible transforms into ten thousand crucibles.\" Borrowing Qian and Kun as the names for crucible and furnace, one employs the imagery of the *Yi* to clarify the principles of the elixir Way. Yet one must grasp the image and forget the words—one cannot cling to the text or be bound by the symbol.\n\nThe true qi of the primordial Great One cannot be sought without the crucible and furnace; the crucible and furnace cannot manifest their imagery without Qian and Kun. Without understanding yin and yang, there is no way to begin. Thus, yin and yang are truly the means for refining the elixir. The trap is for catching fish; the snare is for capturing hares—such is the method. The mysterious pearl is the elixir. This pearl lies concealed within the Great Abyss of the Northern Culmen. To seek it, one must thoroughly penetrate yin and yang and deeply comprehend the workings of creation. Like the trap for fish or the snare for hares, one may then grasp it, avoiding futility and failure.]",
      "overlap_context": "fluids. Ancestor Zhongli said: \"Within the human body, inside and out, all is yin. What is the yang essence, the true seed? It is the primordial true qi—black lead.\" Mercury’s nature is volatile and hard to restrain. The *Cantong Qi* says: \"Ghosts hide, dragons conceal, none know where they abide.\" Yet when a speck of primordial true lead arrives, true mercury naturally abides, no longer flying away. Like a cat pouncing on a mouse, like a hare meeting a hawk, it becomes docile of its own accord.",
      "start_char": 5798,
      "end_char": 6095,
      "start_sentence": 316,
      "end_sentence": 332,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.751460075378418,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "趋踹时卒，补我乾之一缺； 俄然间已，返彼坤之六虚。 【注：趋踹须臾，俄然倏忽也。 此言还丹之易。 《心印经》曰：存无守有，顷刻而成。 自阴阳始交，乾之中爻，入于坤而为坎； 坤之中爻，入于乾而为离。 今抽去离中一阴，填入坎中一阳，补离成乾，乾不缺矣。 我既抽却坎中一画补离，而为乾之三连； 彼亦抽去离中两断还坎，而为坤之六虚。 《圭旨》曰：从此变成乾健体，潜藏飞跃尽由心。 】 到此心归神室，位列天仙，丹落黄庭，千灵舒泰。 上帝嘉赞，天地咸惊。 【注：到此，犹言不易至此。 到此气聚神全，心定神凝，心空神灵。 《庄子》曰：其天守全，其神无隙。 《阴符经》谓：不神之神，无息不息，列职天曹，位为上真。 一自灵根火发，海底珠还，一点之丹，落于黄庭。 此时气结神凝，魂安魄定，一身和畅，百脉皆春，天君泰然，万神听令，上帝嘉赞，奖其勇烈。 天地咸惊，以为难得。 《悟真篇》曰：无限神龙尽失惊。 吕洞宾丹道之纯阳祖师“五篇” 抱元守一，温养十月，神有象调神。 面壁坐忘，九载体无形。 【注：《金丹节要》曰：国富民安道已成，更宜面壁养元神。 功成九转朝天去，永做天仙寿万春。 还丹之后，继以温养。 抱元神，守真一，大周天之火，不可丝毫间断。 迨至十月功圆，泥丸顶上，进出一神，身外有身。 泥丸祖谓：十月胎仙出，雷电送金虬。 调神者，谓十步百步，切须照顾。 此乳哺之功，必得三年。 然后再选名山福地，古迹灵坛，水拱山朝，聚气藏风之所。 傍云构室，兀坐忘形，形神俱妙，与道合真，水火无伤，刀兵不害，功满三千，时当九载，变化通灵，八极无碍，可以排山倒海，达地通天，济世安民，诛邪除害。 待天诏下临，白日冲霄，位天仙之上品，与乾坤齐大，日月齐明，寿同天地，为最上第一乘。 天仙大道，此大丈夫之事，非大英雄大豪杰，不能干也。 】",
      "translated_text": "In fleeting moments, swift as a breath, the broken line of Qian is mended; in an instant’s transformation, the six hollows of Kun are restored. [Note: \"Fleeting moments\" and \"instant’s transformation\" denote the swiftness of the process. This speaks to the ease of returning the elixir. The *Xinyin Jing* states: \"Preserve the void, guard the existent—accomplished in an instant.\" From the first union of yin and yang, the middle line of Qian enters Kun to become Kan; the middle line of Kun enters Qian to become Li. Now, drawing forth the single yin from Li to fill the single yang in Kan, Li is restored to Qian, and Qian’s flaw is no more. Having extracted the one line from Kan to mend Li into Qian’s three unbroken lines, Kun in turn withdraws the two broken lines from Li, returning to its six hollows. The *Guizhi* says: \"From this, the robust form of Qian is transformed—hidden or soaring, all lies within the heart.\"]\n\nAt this point, the heart returns to the chamber of spirit, and one is ranked among the Heavenly Immortals; the elixir descends into the Yellow Court, and a thousand spirits bask in serenity. The August Emperor bestows praise, and heaven and earth stand in awe. [Note: \"At this point\" signifies the attainment of this stage. Here, qi gathers and spirit is whole, the heart settles and spirit congeals, the heart empties and spirit becomes numinous. *Zhuangzi* says: \"Its heavenly guard is complete, its spirit without flaw.\" The *Yinfu Jing* states: \"The spirit that does not act as spirit, breathless yet ever-breathing, is ranked among the heavenly offices as an Upper Perfected.\" Once the fire of the numinous root is kindled and the pearl from the sea’s depths is returned, a single elixir drops into the Yellow Court. At this time, qi coalesces and spirit solidifies, the hun rests and the po is stilled; the entire body harmonizes, and the hundred vessels brim with spring. The Heavenly Lord is at peace, and the myriad spirits obey his command. The August Emperor bestows praise, honoring his valor. Heaven and earth stand in awe, deeming it rare. The *Wuzhen Pian* says: \"Countless divine dragons are utterly astonished.\"]\n\nLü Dongbin, the Pure Yang Patriarch of the Five Chapters, embraced the origin and guarded the One, nurturing it for ten months—spirit took form, and he refined it. Facing the wall, he sat in oblivion, and after nine years, his body transcended form. [Note: The *Jindan Jieyao* states: \"When the nation is prosperous and the people at peace, the Dao is already achieved—then one should face the wall to nurture the original spirit. When the nine transformations are complete, ascend to heaven, and forever become a Heavenly Immortal, enjoying boundless spring.\" After returning the elixir, one proceeds to nurture it. Embracing the original spirit and guarding the true One, the fire of the great celestial cycle must not be interrupted in the slightest. By the time the tenth month’s work is complete, a spirit emerges from the Mud Pill Palace above the crown, and a body exists beyond the body. The Ancestor of the Mud Pill Palace says: \"In the tenth month, the fetal immortal emerges, borne by thunder and lightning as a golden dragon.\" \"Refining the spirit\" means that at every step, one must remain vigilant—this is the work of nursing, requiring three years. Thereafter, one selects an auspicious mountain, a blessed site, an ancient relic, or a numinous altar—where water encircles and mountains pay homage, where qi gathers and wind is stored. Beside the clouds, one constructs a chamber, sits in profound stillness, and forgets form. Form and spirit become wondrous, merging with the true Dao. Water and fire cannot harm, blades and weapons cannot injure. When merit is fulfilled in three thousand deeds and the time of nine years arrives, transformations become effortless, and the eight directions present no barrier. One may then move mountains and overturn seas, traverse earth and reach heaven, aid the world and pacify the people, punish the wicked and eliminate harm. Awaiting the celestial decree’s descent, one ascends in broad daylight, attaining the highest rank of Heavenly Immortals. Equal in grandeur to heaven and earth, in radiance to sun and moon, and in longevity to the cosmos, this is the supreme first vehicle.\n\nThe Great Dao of Heavenly Immortals is the work of true heroes—only the greatest of heroes and most extraordinary of talents may undertake it.",
      "overlap_context": "in and yang, there is no way to begin. Thus, yin and yang are truly the means for refining the elixir. The trap is for catching fish; the snare is for capturing hares—such is the method. The mysterious pearl is the elixir. This pearl lies concealed within the Great Abyss of the Northern Culmen. To seek it, one must thoroughly penetrate yin and yang and deeply comprehend the workings of creation. Like the trap for fish or the snare for hares, one may then grasp it, avoiding futility and failure.]",
      "start_char": 6096,
      "end_char": 6866,
      "start_sentence": 333,
      "end_sentence": 370,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.42543387413025,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "斯其道术造端，似行邪而实正； 就中火候始末，如出奇而用兵。 【注：造端之始，下手之初，实有接命延年之妙术。 斯术秘密，《悟真》谓始于有作人难见。 本属正经施为，并非邪淫妄诞。 《三字诀》曰：说着丑，行着妙。 人人憎，个个笑。 白玉蟾曰：说破人须失笑。 《葫芦歌》曰：行着妙，说着丑，惹得愚人笑破口。 语似不经，事同怪诞，有不目为行邪者乎语曰：邪人行正正亦邪，正人行邪邪亦正。 至心清净，毫无苟且。 但行迹似可疑耳。 若夫火候，始而野战，终而守城，有出奇制胜之方，有争战摧锋之象。 《无根树》曰：龙虎登坛战一场。 《悟真篇》曰：用将须分左右军，饶他为主我为宾。 白紫清曰：神通战罢，方能见圣人。 英雄不时，干戈定太平。 】",
      "translated_text": "The inception of this Daoist art appears heterodox yet is fundamentally orthodox; within its firing process from beginning to end, it resembles the deployment of extraordinary military strategy.\n\nAt the outset of its practice, from the very first steps, there lies a wondrous technique for connecting with life and prolonging years. This art is profoundly esoteric—*The Awakening to Reality* states that it begins with deliberate action yet remains unseen by ordinary men. It belongs entirely to proper and orthodox practice, never licentious or absurd. *The Three-Character Formula* says:\n*\"Spoken, it is ugly;\nPracticed, it is marvelous.\nAll despise it,\nEach one mocks it.\"*\nBai Yuchan observes: *\"Reveal it, and people will surely laugh.\"* *The Gourd Song* declares:\n*\"Practiced, it is marvelous;\nSpoken, it is ugly—\nFools laugh till their mouths split.\"*\nThough the words seem absurd and the deeds bizarre, who would not mistake it for heterodoxy?\n\nAs the saying goes:\n*\"The wicked practice orthodoxy, and even orthodoxy becomes wicked;\nThe upright practice heterodoxy, and even heterodoxy becomes upright.\"*\nYet the heart remains pure and undefiled, without the slightest impropriety—only the outward traces may seem suspicious.\n\nAs for the firing process: it begins with field combat and ends with defending the city. There are methods for achieving victory through surprise and images of battle and triumph. *The Rootless Tree* states: *\"Dragon and tiger mount the altar for a single battle.\"* *The Awakening to Reality* says: *\"In application, one must divide left and right armies—let them be the host while I remain the guest.\"* Bai Ziqing remarks: *\"Only after the spiritual battle concludes can one behold the sage.\"* *\"Heroes act in due time, and weapons secure great peace.\"*",
      "overlap_context": " earth and reach heaven, aid the world and pacify the people, punish the wicked and eliminate harm. Awaiting the celestial decree’s descent, one ascends in broad daylight, attaining the highest rank of Heavenly Immortals. Equal in grandeur to heaven and earth, in radiance to sun and moon, and in longevity to the cosmos, this is the supreme first vehicle.\n\nThe Great Dao of Heavenly Immortals is the work of true heroes—only the greatest of heroes and most extraordinary of talents may undertake it.",
      "start_char": 6867,
      "end_char": 7173,
      "start_sentence": 371,
      "end_sentence": 388,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.607648611068726,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "铅与汞，无丙叟，东西间隔； 婴与姹，非黄婆，咫尺参差。 【注：丙叟火也。 炼铅烹汞，非火不为功。 东方之木汞，西方之铅金，两相隔绝。 必得丙丁之火，以融洽之。 然后不相克而相生。 《悟真篇》曰：木性爱金顺义，金情恋木慈仁。 相吞相啖自相亲，始觉男儿有孕。 《翠虚篇》曰：婴儿姹女，隔阻在天涯远，全仗着黄婆在两下缠。 《一枝花》曰：感只感黄婆勾引，候只候少女开莲。 《敲爻歌》曰：黄婆匹配得团圆，时刻无差口付传。 《入药镜》曰：托黄婆，媒姹女，轻轻地，默默举。 黄婆者，丹房之副帅，断断不可少者。 若无黄婆，虽咫尺至近，而姻缘乖舛，情意不符，参差而不可为矣。 】 谙缓急，虑吉凶，在匠手，以斟酌，明进退，知止足，岂愚昧而能为。",
      "translated_text": "Lead and mercury lack the Elder of Fire (Bing); east and west remain divided.\nInfant and Maiden lack the Yellow Dame (Huangpo); though close as a foot and a span, they stand apart.\n\n[Annotation: The Elder of Fire is fire. Refining lead and mercury cannot succeed without fire. The Wood-mercury of the east and the Metal-lead of the west are utterly estranged—only with the fire of bing and ding can they be harmonized, so that instead of mutual conquest, they give birth to one another. *The Awakening to Reality* states: *\"Wood’s nature loves Metal’s righteous compliance; Metal’s disposition cherishes Wood’s benevolent kindness. Devouring each other, they grow intimate—only then does the man conceive.\"* *The Emerald Writ* says: *\"Infant Boy and Maiden Girl are sundered as if by the ends of the earth; only by relying on the Yellow Dame to entwine them both.\"* *The Single Branch* says: *\"Moved only when the Yellow Dame beckons, awaiting only when the Maiden opens her lotus.\"* *The Song of Tapping the Hexagrams* says: *\"When the Yellow Dame matches them in perfect union, the moment is flawless, the transmission sealed.\"* *The Mirror for Taking the Medicine* says: *\"Entrust the Yellow Dame to woo the Maiden Girl—lightly, silently, she lifts them together.\"* The Yellow Dame is the deputy marshal of the elixir chamber, utterly indispensable. Without her, though they stand as near as a foot and a span, their affinity is thwarted, their passions discordant, and they remain askew, unable to unite.]\n\nMaster the urgent and the gradual, weigh fortune and misfortune—all rests in the craftsman’s hand, to measure and deliberate.\nDiscern advance and retreat, know when to halt and when to be content—how could the ignorant ever succeed?",
      "overlap_context": " and ends with defending the city. There are methods for achieving victory through surprise and images of battle and triumph. *The Rootless Tree* states: *\"Dragon and tiger mount the altar for a single battle.\"* *The Awakening to Reality* says: *\"In application, one must divide left and right armies—let them be the host while I remain the guest.\"* Bai Ziqing remarks: *\"Only after the spiritual battle concludes can one behold the sage.\"* *\"Heroes act in due time, and weapons secure great peace.\"*",
      "start_char": 7174,
      "end_char": 7488,
      "start_sentence": 389,
      "end_sentence": 405,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.64717173576355,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "【注：炼丹至要，在于缓、急、吉、凶四字，最宜谙虑周详。 守城是缓，野战是急； 温养是缓，采药是急； 生气是吉，杀气是凶； 阳气是吉，阴气是凶。 《入药镜》曰：受气吉，防成凶。 《悟真篇》曰：守城野战知凶吉，争得灵砂满鼎红。 知之稔，行之熟，方得谓之匠手。 斟酌者，言有分寸，不差绳墨。 《无根树》曰：匠手高强牢把舵，一任洪波海底翻。 《一枝花》曰：施匠手，在逆水上行舡，即此意也。 张全一曰：阳火进来从左转，阴符退去往西旋。 邱长春祖小周天秘诀云：自子至巳，六阳用九，三十六息，采取进升； 自午至亥，六阴用六，二十四息，退降炼烹。 进退即升降。 《天仙正理》曰：当吸机之阖，我则转而至乾，以升为进也； 当呼机之辟，我则转而至坤，以降为退也。 冲虚子曰：进退者亦虚喻耳，其实不见有进退也。 张紫阳曰：未炼还丹须速炼，炼了还须知止足。 若也持盈未已心，不免一朝遭殆辱。 萧了真曰：切忌不须行火候，不知止足必倾危。 此言丹成止火，其理精微。 非得真师指授，虽上智明人，不易通晓。 岂愚昧之夫，所能为乎】",
      "translated_text": "**[Annotation: The crux of elixir-refinement lies in the four characters—*gradual, urgent, auspicious, inauspicious*—which demand the most thorough familiarity and deliberation.\nTo *hold the city* is gradual; *field combat* is urgent.\n*Tempering and nurturing* is gradual; *gathering the medicine* is urgent.\n*Vital qi* is auspicious; *lethal qi* is inauspicious.\n*Yang qi* is auspicious; *yin qi* is inauspicious.\n*The Mirror for Taking the Medicine* says: *\"Receive qi auspiciously, guard against its turning inauspicious.\"*\n*The Waking to Reality* says: *\"Hold the city or wage field combat—know fortune and misfortune, and you may fill the crucible with numinous cinnabar.\"*\nOnly when this is deeply understood and practiced with mastery may one be called a *craftsman’s hand*.\n*To measure and deliberate* means to act with precision, never straying from the plumb line.\n*The Rootless Tree* says: *\"The craftsman’s hand, firm at the helm, lets the ocean’s waves churn below.\"*\n*The Single Branch of Flowers* says: *\"Wield the craftsman’s hand to sail upstream—such is the meaning here.\"*\nZhang Quanyi says: *\"Yang fire advances, turning from the left; yin tally retreats, spiraling to the west.\"*\nMaster Qiu Changchun’s *Secret Formula of the Microcosmic Orbit* states: *\"From Zi to Si, the six yang employ nine, thirty-six breaths to gather, take in, and ascend. From Wu to Hai, the six yin employ six, twenty-four breaths to retreat, descend, refine, and simmer.\"*\n*Advance and retreat* are thus *ascent and descent*.\n*The Orthodox Principle of Celestial Immortality* says: *\"When the mechanism of inhalation closes, I turn to Qian, taking ascent as advance. When the mechanism of exhalation opens, I turn to Kun, taking descent as retreat.\"*\nMaster Chongxu says: *\"Advance and retreat are but empty metaphors—truly, no advance or retreat is seen.\"*\nZhang Ziyang says:\n*\"Before refining the returning elixir, refine swiftly;\nOnce refined, know when to halt and be content.\nIf you cling to excess with an insatiable heart,\nYou will not escape ruin and disgrace one day.\"*\nXiao Liaozhen says: *\"Beware—do not proceed with firing recklessly;\nWithout knowing when to halt, you court collapse and peril.\"*\nThis speaks of ceasing the fire once the elixir is formed—a principle of profound subtlety.\nWithout the true master’s direct instruction, even the brightest and wisest may struggle to comprehend it.\nHow could the ignorant ever succeed?]**",
      "overlap_context": "he lifts them together.\"* The Yellow Dame is the deputy marshal of the elixir chamber, utterly indispensable. Without her, though they stand as near as a foot and a span, their affinity is thwarted, their passions discordant, and they remain askew, unable to unite.]\n\nMaster the urgent and the gradual, weigh fortune and misfortune—all rests in the craftsman’s hand, to measure and deliberate.\nDiscern advance and retreat, know when to halt and when to be content—how could the ignorant ever succeed?",
      "start_char": 7491,
      "end_char": 7922,
      "start_sentence": 406,
      "end_sentence": 429,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.971346378326416,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "认消息，如海潮之有信； 测造化，比日月之盈亏。 【注：信之一字，实千真万圣之总路。 庄子曰：有情有信，无为无形。 《百句章》曰：此中有真信，信至君必惊。 子午不差，潮汐有候。 《入药镜》曰：天应星，地应潮。 白于蟾曰：地下海潮天上月。 《节要》曰：临期潮候，月出庚方。 以此测信，则消息之理，可得而认其源矣。 日月者，阴阳二曜。 气之发而为明者，月借日以生光。 以日之对照偏正，为月之魂魄圆缺。 即此盈亏之理，可测造化之机矣。 三日月出庚，乃一阳生于坎位； 十五月圆甲，则六爻周以乾元。 【《真经歌》曰：初三日，震出庚，曲江上，月华明。 《参同契》曰：三日出为爽，震受庚西方； 八日兑受丁，上弦平如绳； 十五乾体就，盛满甲东方。 《悟真篇》曰：西南路上月华明，大药还从此处生。 大药，即来复之一阳也。 此阳生于坤体，从纯阴中进出。 圆甲者，乾纳甲壬，坤纳乙癸，甲木庚金，对照而圆。 《契》曰：三五德就，乾体乃成，六爻相周。 《易》曰：变动不拘，周流六虚。 《契》曰：周流六爻，难以察睹。 此乾坤二卦之周于六卦，坎离中爻之周于六爻也。 乾坤生六子，各得其中爻一画，故曰非其中爻不备。 】 劈金窍，凿混沌，露老庄之肺腑； 明橐龠，饮刀圭，吐平叔之心肝。 【注：开金锁之秘藏，凿开混沌，已将《道德》、《南华》，老子、庄子，肺腑深机，发露透彻。 橐龠者，鼎器也。 有底曰橐，无底曰龠。 橐天龠地，即琴、笛，即葫芦也。 欲饮刀圭，先明橐龠。 《入药镜》曰：饮刀圭，窥天巧。 《契》曰：粉提以一丸，刀圭最为神。 紫阳真人张百端，字平叔，着《悟真篇》，披肝露胆，吐泄真诠。 】 遂烟霞明悟之友，发龙虎珍藏之秘。",
      "translated_text": "Recognize the ebb and flow as the tides of the sea, ever faithful to their time;\nGauge the workings of creation by the waxing and waning of the sun and moon.\n\n[**Note:** The character *xin* (信, \"faithfulness\") is the grand path of all truth and sages. *Zhuangzi* says: *\"There is sentiment, there is faithfulness; there is non-action, there is formlessness.\"* *The Hundred Verses* says: *\"Within this lies true faithfulness—when it arrives, even the lord must be startled.\"* The midnight and noon never err; the tides keep their appointed hours. *The Mirror of Entering the Medicine* says: *\"Heaven responds to the stars, earth responds to the tides.\"* Bai Yuchan says: *\"Beneath the earth, the sea’s tides; above the sky, the moon.\"* *The Essential Instructions* says: *\"When the time comes, await the tide’s sign—when the moon rises in the west.\"* By this, one measures faithfulness, and thus the principle of ebb and flow may be recognized at its source.\n\nThe sun and moon are the two luminaries of yin and yang. When qi issues forth as light, the moon borrows the sun’s radiance to shine. By the sun’s direct or slanted illumination, the moon’s spirit and body wax and wane. From this principle of waxing and waning, one may gauge the mechanism of creation.\n\nOn the third day, the moon emerges in the west—this is the first yang born in the Kan position. On the fifteenth, the moon is full in the east—then the six lines complete the Qian trigram’s primordial origin. [*The True Classic Song* says: *\"On the third day, Zhen emerges in the west; by the winding river, the moon’s brilliance shines.\"* *The Union of the Three* says: *\"On the third day, it emerges bright, Zhen receives the west; on the eighth, Dui receives the south, the upper arc straight as a cord; on the fifteenth, the Qian body is complete, full and flourishing in the east.\"* *The Awakening to Reality* says: *\"On the southwestern path, the moon’s brilliance shines—from here the great medicine is born.\"* The great medicine is the returning first yang. This yang arises within the Kun body, emerging from pure yin. The full moon in the east: Qian contains *jia* and *ren*, Kun contains *yi* and *gui*; *jia*-wood and *geng*-metal face each other and become full. *The Union* says: *\"When the three and five virtues are complete, the Qian body is formed, the six lines revolve in harmony.\"* *The Book of Changes* says: *\"Transforming and moving without constraint, it flows through the six voids.\"* *The Union* says: *\"Flowing through the six lines, it is difficult to perceive.\"* This describes how the two trigrams Qian and Kun revolve through the six trigrams, and how the central lines of Kan and Li revolve through the six lines. Qian and Kun give birth to the six children, each receiving one line from their central lines—thus it is said that without their central lines, they are incomplete.]\n\nSplit open the golden aperture, cleave the primordial chaos, revealing the innermost truths of Laozi and Zhuangzi;\nClarify the bellows and flute, drink the knife’s measure, spilling the heart and liver of Zhang Baiduan.\n\n[**Note:** Unlocking the secret treasury of the golden lock, cleaving open the primordial chaos, one fully exposes the profound mechanisms of the *Daodejing* and *Nanhua*, the innermost truths of Laozi and Zhuangzi. The bellows and flute refer to the crucible. That with a base is the bellows; that without is the flute. The bellows of heaven and flute of earth are like the zither and flute, like the gourd. To drink the knife’s measure, first clarify the bellows and flute. *The Mirror of Entering the Medicine* says: *\"Drink the knife’s measure, glimpse heaven’s art.\"* *The Union* says: *\"Crush it into one pill—nothing is more divine than the knife’s measure.\"* The Perfected Zhang Baiduan, styled Pingshu, composed *The Awakening to Reality*, baring his liver and gall, spilling forth the true teachings.]\n\nThus enlightening the friends who wander amidst mist and clouds, unveiling the hidden secrets of dragon and tiger.",
      "overlap_context": "know when to halt and be content.\nIf you cling to excess with an insatiable heart,\nYou will not escape ruin and disgrace one day.\"*\nXiao Liaozhen says: *\"Beware—do not proceed with firing recklessly;\nWithout knowing when to halt, you court collapse and peril.\"*\nThis speaks of ceasing the fire once the elixir is formed—a principle of profound subtlety.\nWithout the true master’s direct instruction, even the brightest and wisest may struggle to comprehend it.\nHow could the ignorant ever succeed?]**",
      "start_char": 7923,
      "end_char": 8626,
      "start_sentence": 430,
      "end_sentence": 471,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.750073671340942,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "【注：烟霞之士，不乏明悟之才。 有志修真，无缘得法，读我此赋，足以遂其夙志，开其慧悟。 非徒排偶其文，实乃明至道之真诠，发龙虎秘藏之旨。 】 各寻火候，早饵黍珠，阆苑玄圃，他日有冀。 【注：有志者，各自寻觅因缘，行火候之秘，饵黍米之珠，阆苑玄圃，三千弱水，非飞仙莫到。 能依此赋修持，他日有冀而不难矣。 《契》曰：御白鹤兮驾龙鳞，游太虚兮谒仙君，受天图兮号真人。 又曰：太乙乃召，移居中洲，功满上升，膺箓受图。 】  文章共有 7 页，当前第 3 页  1  2  3  4  5  6  7  下一页 二、百句章",
      "translated_text": "[Annotation: Among those who wander amidst mist and clouds, many possess enlightened talents. Those with the aspiration to cultivate the Dao yet lack the opportunity to receive its methods—by reading this rhapsody, their long-cherished resolve may be fulfilled, and their wisdom awakened. This is not merely an exercise in parallel prose, but a revelation of the true essence of the supreme Dao, an unveiling of the hidden principles of dragon and tiger.]\n\nEach seeks the firing times, early to ingest the millet-pearl.\nIn the Jasper Pool’s mystic gardens, hope stirs for another day.\n\n[Annotation: Those with resolve must each seek their own karmic conditions, practice the secrets of the firing times, and ingest the pearl of millet. The Jasper Pool’s mystic gardens, the three thousand weak waters—none but the flying immortals may reach them. Yet by cultivating in accord with this rhapsody, that hope shall not be difficult to attain. *The Union* says: *\"Mount the white crane, ride the dragon’s scales; roam the Great Void, pay homage to the Immortal Lords. Receive the celestial chart, be named a Perfected One.\"* It also says: *\"When the Great One summons, remove to the Central Continent. With merit complete, ascend on high, receive the register and chart.\"*]",
      "overlap_context": "’s measure, first clarify the bellows and flute. *The Mirror of Entering the Medicine* says: *\"Drink the knife’s measure, glimpse heaven’s art.\"* *The Union* says: *\"Crush it into one pill—nothing is more divine than the knife’s measure.\"* The Perfected Zhang Baiduan, styled Pingshu, composed *The Awakening to Reality*, baring his liver and gall, spilling forth the true teachings.]\n\nThus enlightening the friends who wander amidst mist and clouds, unveiling the hidden secrets of dragon and tiger.",
      "start_char": 8629,
      "end_char": 8908,
      "start_sentence": 472,
      "end_sentence": 482,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.657369613647461,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "无念方能静，静中气自平，气平息乃住，息住自归根，归根见本性，见性始为真。 【注：人之所以不能静者，为有念耳。 一念未止，一念复起，万虑纷纭，无刻不有。 自少至老，几曾得一息清宁。 欲修静者，先从止念入门。 念尽则情欲尽，而寸心清净矣。 心既清净，气自和平，如春沼鱼，如百虫蛰，氤氲开阖，其妙无穷，其气平矣。 久之出入息定，归于其根，呼吸全无。 所谓真人潜深渊，浮游守规中。 混混续续，兀兀腾腾。 此其气归中极，旋转不息，非无息也。 息既归根，则静而定矣。 定极而本性自现，慧光自生。 本性者，本命之元神也。 释曰：见性成佛，是名得道。 实无所得，得无所得，始为真得。 】 万有无一臭，地下听雷鸣，升到昆仑顶，后路要分明。 【注：万缘寂静，声臭泯绝，茫无朕兆之际，来复之机至，忽然雷出地奋。 丹经曰：地雷震动山头雨，洗濯黄芽出土来。 此是真阳透露，形如烈火，状如炎风。 《黄庭经》曰：中有真人巾金巾，负甲持符开七门。 此非枝叶实是根。 此时驾动河车，渡尾闾，过夹脊双关，循玉枕而上昆仑。 此是后上前下之功，须要理路分明，不可含糊造次。 】 下山接鹊桥，送下至黄庭，庭中演易卦，五十五堪均。 【注：丹自昆仑绝顶，垂上腭，过鹊桥，下重楼，送至黄庭而止。 黄庭者，中宫神室也。 其时泥丸风生，绛宫月明，肾气上升，甘露下降，送归土釜，风恬浪静，国泰民安矣。 庭中演易卦者，卦有三百八十四爻，火有三百八十四铢，法乾坤，配坎离，行水火，皆演也。 五十五者，天数五，地数五，五位相得而各有合，天数二十有五，地数三十。 凡天地之数，五十有五。 此所以成变化，而行鬼神也。 均者，配合均匀，堪为炼丹之法则，教人即天地以求其象也。 】 气卷施四大，坐卧看君行。",
      "translated_text": "Without thought, stillness may arise;\nin stillness, qi finds its balance.\nWhen qi is balanced, breath comes to rest;\nwhen breath rests, it naturally returns to the root.\nReturning to the root, one perceives original nature;\nperceiving nature, one begins to be true.\n\n[Those who cannot attain stillness are bound by thoughts. Before one thought subsides, another arises—ten thousand cares surge ceaselessly, without a moment’s respite from youth to old age. How rarely is even a single breath of clarity known? To cultivate stillness, first enter through the cessation of thought. When thoughts are exhausted, passions and desires dissolve, and the heart-mind becomes pure. With the heart-mind purified, qi naturally harmonizes, like fish in a spring pond, like insects in hibernation—steaming and unfolding in boundless subtlety, its qi balanced. Over time, the in-and-out breath stabilizes, returning to its root, and breathing ceases entirely. As the *Perfected One* dwells in the deep abyss, floating and roaming within the compass of the rule, in ceaseless continuity, utterly serene—this is qi returning to the central pole, revolving without end, not truly without breath. When breath returns to the root, stillness settles into quiescence. At the utmost point of quiescence, original nature manifests, and the light of wisdom arises spontaneously. Original nature is the primordial spirit of one’s true destiny. The Buddha said: *\"Seeing nature, one becomes a Buddha—this is called attaining the Dao.\"* Yet there is nothing to attain; attaining nothingness is true attainment.]\n\nThe myriad beings bear no scent;\nbeneath the earth, one hears thunder roar.\nAscending to the summit of Kunlun,\nthe path behind must be kept clear.\n\n[When all conditions are stilled and sounds and scents vanish into boundless obscurity, the moment of returning movement arrives—suddenly, thunder bursts forth from the earth. The *Alchemical Classic* says: *\"Earth’s thunder shakes the mountain’s peak; rain washes the yellow sprout as it emerges from the soil.\"* This is true yang revealing itself, blazing like fire, raging like a scorching wind. The *Yellow Court Classic* says: *\"Within is a true person, crowned in golden cloth, bearing armor and talismans to open the seven gates.\"* This is no branch or leaf—it is the root itself. At this time, the river chariot is set in motion, crossing the Tail Gate, passing the twin barriers of the Spine Pass, ascending the Jade Pillow to reach Kunlun. This is the work of rising behind and descending before—one must keep the path distinct, never hasty or careless.]\n\nDescend the mountain to meet the Magpie Bridge,\nescorting it down to the Yellow Court.\nWithin the court, the *Yi*’s hexagrams unfold—\nfifty-five, perfectly balanced.\n\n[The elixir, descending from the summit of Kunlun, hangs from the upper palate, crosses the Magpie Bridge, passes the Towering Chambers, and is escorted to the Yellow Court, where it comes to rest. The Yellow Court is the divine chamber of the central palace. At this time, wind stirs in the Mud Pill, the moon shines in the Crimson Palace, kidney qi ascends, sweet dew descends, and all is returned to the earthen cauldron—wind calms, waves still, the nation at peace, the people secure. *\"Unfolding the hexagrams of the *Yi* within the court\"* refers to the three hundred eighty-four lines of the hexagrams and the three hundred eighty-four grains of firing time, modeling Qian and Kun, pairing Kan and Li, moving water and fire—all this is the unfolding. The fifty-five: the heavenly number is five, the earthly number is five; the five positions interact and each finds its harmony. The heavenly numbers total twenty-five, the earthly numbers thirty. All the numbers of heaven and earth sum to fifty-five—this is how transformations are accomplished and the spirits are set in motion. *\"Balanced\"* means harmonious alignment, serving as the method for refining the elixir, teaching one to seek its image through heaven and earth.]\n\nQi rolls forth to fill the four great elements;\nsit or lie—watch as you proceed.",
      "overlap_context": " the three thousand weak waters—none but the flying immortals may reach them. Yet by cultivating in accord with this rhapsody, that hope shall not be difficult to attain. *The Union* says: *\"Mount the white crane, ride the dragon’s scales; roam the Great Void, pay homage to the Immortal Lords. Receive the celestial chart, be named a Perfected One.\"* It also says: *\"When the Great One summons, remove to the Central Continent. With merit complete, ascend on high, receive the register and chart.\"*]",
      "start_char": 8909,
      "end_char": 9638,
      "start_sentence": 483,
      "end_sentence": 519,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.304723262786865,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "此是筑基理，孤阴难上升。 【注：四大一身，皆气之充塞，无处不周，卷舒随时，施于四体，四体不言而喻。 坐卧看君行者，《金丹节要》曰：两体对坐，二景现前。 《指玄篇》曰：共床作起上天梯，是坐可行，卧亦可行也。 此是筑基之理，须知孤阴不生，独阳不长。 孤修静坐，何从而得其升降乎 】 更要铸神剑，三年炼己成。 念正情忘极，临炉不动神。 【注：是剑非铜铁铸成，乃智慧剑也。 丹经曰：出有入无三尽剑，长生不死一丸药。 修丹之士，必先炼剑，始能采药。 炼己功成，乃可还丹。 所谓炼己者，正念当前，邪意不起，忘情空色相，拚死下功夫。 临炉下手，元神不动，一心归命，即是炼己之功，即是铸剑之法。 】 觅买丹房器，五千四八春，先看初三夜，蛾眉始见庚。 【注：丹房器皿，殊不易得，须要钱买，须要寻觅，始能得之。 惟此器皿，要合一藏真经五千四十八卷之数。 惟此真经，于每月初三夜，现一弯峨眉新月于庚方，此是金精照耀，大药将产之时。 《沁园春》谓“温温铅鼎，光透帘帷”是也。 要见庚花现，反向峨眉寻，如此采真铅，口口要真传。 【注：祖师慈悲，直指出天机。 言汝等要见庚方之花现，其方位虽属西方庚地，其实反要向身中求之，立见蛾眉新月。 丹经谓：乍睹西方一片月，纯阳疾走报钟离。 时节到来，切勿迟误，错过天机，只此便是采真铅之妙诀，不容易得知，不容易得采。 从古至今，口口相传，不轻授受。 衣中珠子，近在眼前，迷人错用心机，皆不遇真师，不得真传之故也。 】 火候从初一，一两渐渐生，十六退阴符，两两不见增。 【注：火有的候，候其时来而用之，必从初一起功。 《契》曰：元年乃芽滋。 元年即初一也。 一两渐渐生者，从初一起，积累爻珠。 所谓铅八两，汞半斤，皆累铢两而成也。 十六是望后，法当退阴符，无铢两可增，乃罢火不行符之候，两不相见矣。 】 沐浴逢鸡兔，防失防险倾，金气自熏蒸，体上汗淋淋。 【注：兔鸡者，卯酉也。 卯于十二辰为兔，酉于十二辰为鸡。 此时刑德临门，法当沐浴。 沐浴者，洗心涤虑之谓也。 《易》曰：君子以洗心退藏于密，兹事危险。 上是天堂，下是地狱，当寸步操持，防其倾陷，始得金气熏蒸，循环上下，弥漫四体，充遍周身，暖气融和，滋滋汗下。 】 十月胎方就，顶门要出神，还须面壁九，飞升上玉京。 【注：《参同契》曰：弥历十月，脱出其胞，十月功成，温养事毕。 丹经曰：三百日火，一十月胎，其神离身，忽去忽来。 此时矿尽金纯，遍体纯阳，更生五脏，再立百骸。 口生灵液，血化白膏，一声雷震，彻地金光，婴儿从顶出矣。 旋旋调神，慢慢出壳，透金贯石，瞬息万里。 从此百千化身，方行面壁养虚。 九载功成，天诏下临，飞身金阙，所谓“功成九转朝天去，永作天仙寿万春”。 】 三段工夫诀，明明说与君，我今亲手释，成书体诀行。 【注：修丹工夫，共是三段。 初关炼己筑基一段，中关炼气化神一段，上关炼神还虚一段。 此三段工夫，从古无人道及，我今明明说破，亲手释出，敷衍成书，有志斯道者，尚其体认真诀，勤而行之，自能优入圣域，绝类离群矣。 】 传与修真子，金玉之法程，丹诀真师授，须与神仙论。",
      "translated_text": "This is the principle of foundation-laying—\nlone yin cannot ascend.\n\n*[The four great elements fill the body,\nall is qi’s repletion, nowhere incomplete.\nIt rolls and unfurls with the times,\nflowing through the four limbs—\nthe four limbs need no explanation.\n\"Sit or lie—watch as you proceed\":\nThe* Jindan Jieyao *says:\n\"Two bodies sit facing, the two luminaries appear before you.\"\nThe* Zhixuan Pian *says:\n\"Together on the bed, build the ladder to heaven\"—\nthis may be done sitting, or lying down as well.\nThis is the principle of foundation-laying:\nknow that lone yin does not generate,\nsolitary yang does not grow.\nIf one cultivates alone in stillness,\nhow can ascent and descent be achieved?]*\n\nNext, forge the spirit-sword—\nthree years to refine the self and succeed.\nThoughts upright, passions forgotten utterly,\nbefore the furnace, the spirit remains unmoved.\n\n*[This sword is not cast of bronze or iron—\nit is the sword of wisdom.\nThe alchemical classics say:\n\"Emerging from being, entering non-being—\nthe three-exhaustion sword;\nthe elixir of immortality—\na single pellet.\"\nThose who refine the elixir\nmust first forge the sword\nbefore they can gather the medicine.\nOnly when the work of refining the self is complete\nmay the elixir be returned.\nRefining the self means:\nupright thoughts present,\nwayward intentions absent,\npassions forgotten, forms transcended,\nstaking one’s life in the effort.\nBefore the furnace, when the work begins,\nthe primordial spirit remains unmoved,\nthe heart wholly devoted—\nthis is the work of refining the self,\nthis is the method of forging the sword.]*\n\nSeek and purchase the vessels of the elixir chamber—\nfive thousand forty-eight springs.\nFirst observe the third night of the month,\nwhen the moth-browed moon first appears in the *geng* direction.\n\n*[The vessels of the elixir chamber\nare not easily obtained.\nThey must be bought with money,\nsought with effort,\nbefore they can be acquired.\nThese vessels must correspond\nto the number of the* Zangzhen Jing*—\nfive thousand forty-eight scrolls.\nOnly this true classic\nreveals, on the third night of each month,\na crescent moth-browed new moon\nin the* geng *direction—\nthis is the radiance of golden essence,\nthe time when the great medicine is about to emerge.\nThe* Qinyuan Chun *says:\n\"The warm lead cauldron,\nlight piercing the curtains.\"\nTo witness the* geng *flower appear,\nturn back to seek the moth-browed moon.\nThus gather true lead—\neach word must be truly transmitted.\n*[The patriarchs, in their compassion,\nhave directly revealed the celestial mechanism.\nThey say: If you wish to see the flower appear in the* geng *direction—\nthough its position lies in the west, the* geng *region—\nyou must in fact seek it within the body,\nand at once behold the moth-browed new moon.\nThe alchemical classics say:\n\"Suddenly glimpsing a moon in the western quarter,\npure yang swiftly runs to report to Zhongli.\"\nWhen the time arrives,\ndo not delay or hesitate—\nmissing the celestial mechanism\nmeans losing this wondrous secret of gathering true lead.\nIt is not easily known,\nnot easily gathered.\nFrom ancient times to the present,\nit has been transmitted mouth to mouth,\nnever lightly bestowed.\nThe pearl in the robe is near at hand,\nyet deluded ones waste their efforts—\nall because they have not met a true teacher\nor received the true transmission.]]*\n\nThe firing times begin on the first day—\none *liang* gradually grows.\nOn the sixteenth, withdraw the yin tally—\ntwo *liang* show no further increase.\n\n*[Fire has its proper timing;\nawait the moment and employ it—\nthe work must begin on the first day.\nThe* Cantong Qi *says:\n\"In the first year, the sprout nourishes.\"\nThe first year is the first day.\n\"One* liang *gradually grows\"—\nfrom the first day, accumulate the lines and grains.\nThe so-called \"eight* liang *of lead,\nhalf a* jin *of mercury\"—\nall are amassed by increments of weight.\nThe sixteenth is after the full moon;\nthe method calls for withdrawing the yin tally.\nNo further weight can be added—\nthis is the time to cease firing and halt the tally,\nwhen the two no longer meet.]*\n\nBathing occurs at the hours of hare and fowl—\nguard against loss, guard against peril and collapse.\nGolden qi naturally steams and suffuses,\nthe body’s sweat dripping profusely.\n\n*[Hare and fowl are* mao *and* you.\n*Mao* is the hare among the twelve earthly branches,\n*you* is the fowl.\nAt this time, punishment and virtue arrive at the gate—\nthe method calls for bathing.\nBathing means washing the heart and cleansing the thoughts.\nThe* Yi *says:\n\"The noble one washes the heart and retires, hidden in secrecy.\"\nThis matter is perilous—\nabove is heaven, below is hell.\nOne must proceed with utmost care,\nguarding against collapse,\nbefore the golden qi can steam and circulate,\nrising and descending,\npervading the four limbs,\nfilling the entire body.\nWarm qi harmonizes,\nand sweat drips abundantly.]*\n\nAfter ten months, the embryo is complete—\nthe crown of the head must release the spirit.\nThen face the wall for nine years—\nascend to the Jade Capital in flight.\n\n*[The* Cantong Qi *says:\n\"After ten months have passed,\nit emerges from the womb.\"\nWhen the ten months’ work is complete,\nthe nurturing is finished.\nThe alchemical classics say:\n\"Three hundred days of firing,\nten months of gestation—\nthe spirit leaves the body,\nnow here, now gone.\"\nAt this time, the ore is exhausted, the gold pure,\nthe entire body is pure yang.\nThe five viscera are regenerated,\nthe hundred bones re-established.\nThe mouth produces numinous fluid,\nblood transforms into white marrow.\nA thunderclap resounds,\ngolden light pierces the earth—\nthe infant emerges from the crown.\nGradually regulate the spirit,\nslowly emerge from the shell.\nPiercing metal and penetrating stone,\nin an instant, ten thousand miles.\nFrom this, a hundred thousand transformed bodies—\nthen proceed to face the wall and nurture emptiness.\nAfter nine years, the work is complete,\nthe celestial decree descends,\nthe body flies to the golden palace—\nthis is what is meant by:\n\"After nine transformations, ascend to heaven,\nforever a celestial immortal, living ten thousand springs.\"]*\n\nThree stages of the work—\nI have clearly explained them to you.\nNow I personally unseal and release them,\ncomposing this book to embody the secret method.\n\n*[The work of refining the elixir has three stages.\nThe first barrier: refining the self and laying the foundation.\nThe middle barrier: refining qi to transform the spirit.\nThe upper barrier: refining the spirit to return to emptiness.\nThese three stages of the work\nhave never been spoken of by anyone in the past.\nNow I have clearly revealed them,\npersonally unsealed and released them,\nelaborating them into a book.\nThose who are determined to pursue this Way\nshould embody and recognize the true secret,\npractice it diligently,\nand naturally enter the sage’s realm,\ntranscending the common herd.]*\n\nTransmitted to the children of true refinement—\na method of gold and jade.\nThe elixir’s true secret is taught by the master—\nit must be discussed with immortals.",
      "overlap_context": "umber is five; the five positions interact and each finds its harmony. The heavenly numbers total twenty-five, the earthly numbers thirty. All the numbers of heaven and earth sum to fifty-five—this is how transformations are accomplished and the spirits are set in motion. *\"Balanced\"* means harmonious alignment, serving as the method for refining the elixir, teaching one to seek its image through heaven and earth.]\n\nQi rolls forth to fill the four great elements;\nsit or lie—watch as you proceed.",
      "start_char": 9638,
      "end_char": 10968,
      "start_sentence": 520,
      "end_sentence": 578,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.07613182067871,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "【注：今将万古不泄之秘诀，释出成书，传与修真之子。 此书实金玉之法程，登云之宝筏。 虽然，此其大略，实不易闻。 至若玄中之玄，妙中之妙，又在乎真师之口授。 所谓真弦必要真仙授，世人因文解义，动辄错讹，何不求师志在神在，终必遇之。 “须共神仙仔细论”，此之谓也。 】 更有妙丹法，予恐太泄轻，弹琴并鼓瑟，夫妻和性情。 【注：玄妙深机，不止一法，更有丹法，其妙特殊。 但恐泄露太尽，使闻者轻视此妙。 其法为何弹琴鼓瑟之法也。 诗曰：妻子好合，如鼓瑟琴。 琴不独弹，瑟当并鼓。 性情之道，以和为先，合唱随矣。 《契》曰：推情合性，转而相与，丹法之妙，岂易知哉】 霞光照曲水，红日出昆仑，恍恍并惚惚，杳杳与冥冥。 此中真有信，信到君必惊。 【注：金水照耀，木火腾红，金乌出海，玉兔升空，东出扶桑，西映曲水。 曲水者，曲江也。 《泌园春》曰：曲江上，见月华莹净，有个乌飞是也。 老子曰：恍兮惚兮，其中有物； 杳兮冥兮，其中有精。 其精至真，其中有信。 信者，准而不越其时之谓也。 信至君必惊者，时节一到，妙理自彰，药产神知也。 此恍惚杳冥，得药之景，先天气到，太极兆形之际。 】 一点如朱桔，要使水银迎，绝不用器械，颠倒法乾坤。 【注：还丹之际，有形可见，一点落黄庭，状如朱桔，又似弹丸。 水银者汞也。 丹之到来，须运一点真汞以迎之。 至则饶他为主，夫唱于前，妇随于后，颠倒阴阳，逆施造化，所谓两重天地，四个阴阳。 《三字诀》曰：大关键，在颠倒，我反为宾他作主也。 器械者，琴剑也。 丹既归鼎，停符罢火，不用器械，惟此玄妙机关。 举世学人，何啻万万，谁得而知知之不难，要在多积阴功，广行方便。 志之所在，天必应之，自有神仙作汝师矣。 】 世人不知理，三峰采战行，也有说三关，也有入炉临，又以口对口，丑秽不堪听。 一切有为法，俱是地狱人。 【注：世人不达玄理见，丹经有“口对口，窍对窍，莫厌秽，莫计较”之言，便猜为女鼎，行三峰采战，九浅一深之法，美其名曰，彭祖房中术。 又有说三关，后上前下； 更有闺丹御女，临炉食秽，以口对口。 丑秽不堪。 一切旁门，如此秽恶。 要皆地狱种子，无法可救。 真师难遇，真诀难得。 有志者，宜勤积德可也。 】 有等执着者，信死清静真，发黄并齿落，鹊体似鹤形。 【注：有等愚顽，执着不化，死守清静，信杀不疑。 苦修苦炼，昼夜打坐，使气血凝滞，鹊形鹤体，瘦骨如柴，到发黄齿落，犹不自悟，可胜叹息！ 所以然者，世人习见道门，不婚不宦，独坐穷山，深居岩壑，顽空枯坐，谓之修真。 又见诸小说，皆云入山修道，便谓神仙。 是山中修出来的，岂知坐到老死，都属空亡。 究竟还是不细心读丹经之故。 张三丰遇火龙真人，授以秘诀，命其速速出山。 觅遇因缘。 故《一枝花》曰：命我出山，觅侣求铅。 杏林石仙翁授薛紫贤曰：可往通都大邑，依有力者为之。 自古仙真，皆从人类中而得，富势中而求。 古人要出山，今人偏要入山； 古人皆从有作，今人单讲无为。 种种相反，背道而驰。 执杀清静，老死不悔，曷不观《清静经》云：如此清静，渐入真道； 虽名得道，实无所得。",
      "translated_text": "Here is the translation:\n\n---\n\nNow, the secret method that has remained unspoken for ten thousand ages is revealed and compiled into this book, transmitted to the children of true refinement. This book is truly a golden and jade-like method, a precious raft for ascending the clouds. Yet, though this is its general outline, it is not easily heard. As for the mystery within the mystery, the subtlety within the subtlety, it must be received through the oral transmission of a true master. As the saying goes, \"The true string must be taught by a true immortal.\" Common people, interpreting texts by their words alone, often err and mislead. Why not seek a master with resolve and spirit? In the end, you will surely encounter one. This is what is meant by *\"You must discuss it carefully with immortals.\"*\n\nThere is yet another wondrous elixir method,\nbut I fear revealing too much would make it seem trivial.\nIt is like plucking the zither and striking the se,\nhusband and wife harmonizing their natures.\n\n*[The profound and subtle mechanisms are not limited to one method. There is another elixir method, uniquely wondrous. Yet I fear revealing it entirely would cause those who hear it to dismiss its marvel. What is this method? It is the method of plucking the zither and striking the se. As the poem says: \"When husband and wife are in harmony, it is like the zither and se played together.\" The zither is not played alone; the se must be struck in unison. In the Way of nature and emotion, harmony comes first, and mutual resonance follows. The *Canticle* says: \"Push emotion to unite with nature, turning and joining together.\" How could the subtlety of the elixir method be easily understood?]*\n\nRosy light illumines the winding waters,\nthe red sun rises over Kunlun.\nVague and indistinct, dim and obscure—\nwithin this, there is true certainty,\nand when certainty arrives, you will surely be startled.\n\n*[Metal and water shine brilliantly, wood and fire blaze red. The golden crow emerges from the sea, the jade hare ascends the sky. The sun rises in the east over Fusang, casting its glow upon the winding waters. The winding waters are the Qujiang River. The *Linjiang Immortal* says: \"Upon Qujiang, the moon’s radiance is pure and bright, and there flies a crow.\" Laozi said: \"Vague and indistinct, yet within it there is form; dim and obscure, yet within it there is essence. Its essence is utterly true, and within it there is certainty.\" Certainty means adherence to the unerring timing. \"When certainty arrives, you will surely be startled\" means that when the moment arrives, the wondrous principle manifests of itself, and the medicine’s emergence is divinely known. This vague indistinctness and dim obscurity describe the scene of obtaining the medicine—when the primordial qi arrives and the Supreme Ultimate begins to take shape.]*\n\nA single drop like a vermilion orange,\nit must be met by quicksilver.\nNo instruments are used at all—\nthe method inverts heaven and earth.\n\n*[At the moment of the returning elixir, a visible form appears—a single drop falls into the Yellow Court, shaped like a vermilion orange or a pellet. Quicksilver is mercury. When the elixir arrives, one must move a drop of true mercury to receive it. Once it arrives, it becomes the master: the husband sings first, the wife follows after, inverting yin and yang, reversing the workings of creation. This is what is called \"two layers of heaven and earth, four aspects of yin and yang.\" The *Three-Character Formula* says: \"The great key lies in inversion: I become the guest, and it becomes the host.\" Instruments refer to the zither and sword. Once the elixir returns to the crucible and the tally is complete, the fire is stilled—no instruments are used, only this wondrous mechanism. Countless learners in the world—how could they number less than ten thousand times ten thousand? Yet who truly knows? Knowing is not difficult; what matters is accumulating abundant merit and performing acts of kindness. Where your resolve lies, heaven will respond, and immortals will surely become your teachers.]*\n\nThe world does not understand the principle,\npracticing the Three Peaks’ sexual arts,\nsome speak of the Three Passes,\nothers enter the furnace and face the moment—\neven mouth-to-mouth,\nfilthy and unbearable to hear.\nAll conditioned methods\nare the people of hell.\n\n*[The world, failing to grasp the profound principle, sees in the elixir scriptures phrases like \"mouth to mouth, aperture to aperture, do not disdain the filth, do not calculate the cost,\" and guesses it refers to the female crucible, practicing the Three Peaks’ sexual arts, the method of nine shallow and one deep. They beautify it with names like \"Pengzu’s bedchamber arts.\" Some speak of the Three Passes—rear upper, front lower—while others engage in inner alchemy with women, facing the furnace and consuming filth, mouth-to-mouth. How vile and unbearable! All such side doors are this filthy and foul. They are all seeds of hell, beyond salvation. True masters are hard to meet, true methods hard to obtain. Those with resolve should diligently accumulate virtue.]*\n\nThere are those who cling stubbornly,\nbelieving dead stillness to be true.\nTheir hair turns yellow, their teeth fall out,\ntheir bodies like magpies, their forms like cranes.\n\n*[Some fools, stubborn and unyielding, cling rigidly to stillness, believing it to be the unshakable truth. They practice bitter austerities, sitting day and night, causing their qi and blood to stagnate. Their bodies become like magpies, their forms like cranes, emaciated as sticks. Even when their hair turns yellow and their teeth fall out, they still do not awaken—how lamentable! The reason for this is that people commonly see Daoist practitioners as unmarried and unofficed, sitting alone in remote mountains, dwelling deep in valleys, empty and desiccated in their stillness, calling it \"cultivating the truth.\" They also see in novels that entering the mountains to cultivate the Dao means becoming an immortal. How could they know that sitting until old age and death is all in vain? Ultimately, this comes from not carefully reading the elixir scriptures. When Zhang Sanfeng met the Fire Dragon Immortal, he was given a secret method and told to leave the mountains quickly to seek karmic conditions. Thus, *A Branch of Flowers* says: \"I was commanded to leave the mountains, to seek companions and find lead.\" The Stone Immortal of Apricot Grove told Xue Zixian: \"Go to the bustling cities and rely on those with power to assist you.\" Since ancient times, true immortals have all emerged from among people, sought from among the wealthy and powerful. The ancients had to leave the mountains, yet people today insist on entering them; the ancients all worked through action, yet people today only speak of non-doing. So many contradictions, running counter to the Dao. Stubbornly clinging to dead stillness, they die without regret. Why not read the *Scripture of Purity and Stillness*, which says: \"Such purity and stillness gradually enter the true Dao; though it is called attaining the Dao, in reality, nothing is attained.\"]*",
      "overlap_context": "rk\nhave never been spoken of by anyone in the past.\nNow I have clearly revealed them,\npersonally unsealed and released them,\nelaborating them into a book.\nThose who are determined to pursue this Way\nshould embody and recognize the true secret,\npractice it diligently,\nand naturally enter the sage’s realm,\ntranscending the common herd.]*\n\nTransmitted to the children of true refinement—\na method of gold and jade.\nThe elixir’s true secret is taught by the master—\nit must be discussed with immortals.",
      "start_char": 10971,
      "end_char": 12252,
      "start_sentence": 579,
      "end_sentence": 644,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.26762819290161,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "为化众生，是名得道。 其文极力敷衍，至此清静极矣。 乃忽又补一句曰：能悟之者，可传圣道。 清静至此，而尚有传，世人何其不悟也总之，习见人世之常理，不睹圣神之奇事，此又在根器浅深之说也。 】 他未知吾道，分明假作真，观天之大道，执天之大行。 【注：一切旁门，执杀己见。 他岂知吾道借假修真，弄假成真之妙。 《阴符经》曰：观天之道，执天之行，尽矣。 天地一大阴阳，人身一小阴阳。 天上太阴太阳，人身少阴少阳，其理下二。 经曰：只要专心效法天，天地日月之运行，人身坎离之妙用，四正玄关，法天象地，谁得而知之乎 】 月挂西川上，霞临南楚滨，三日前为晦，阳中之纯阴。 【注：月挂西川者，山头月白，药苗新嫩之象。 霞临南楚者，潭底日红，阴怪消灭之象。 《悟真》曰：西南路上月华明，大药还从此处生。 西川产铅之所。 南离发火之原。 三日前者，先庚三日。 晦者朔之前一日也。 此言三日前为晦者，是活子时之前，亥末之候。 此时大药将产，所谓铅光发现三日前，正是极阴之际。 】 三日后为朔，阴中之阳精，亦如逢冬至，和景好阳春。 【注：三日后者，后甲三日，晦尽朔来，亥末子初之候。 此时阴极阳生，一阳起于九地之下，亦如时令之冬至。 冬至者天地之正子时，阳精者人身之活子时。 阳回大地皆春，丽景韶光，满眼生气。 人身真阳之来，如日出扶桑，彻地红光。 骨节三百六十，毛孔八万三千，融和酥畅，遍体皆春。 】 八日是上弦，一问兔卯门，十六方为姤，念三是酉门。 以此参易卦，方知大道真。 【注：新月上弦，每月初八日也； 残月下弦，每月二十三日也。 卯属兔，酉属鸡。 此二时为刑德之门，沐浴之候，当知卯沐浴乃益汞，酉沐浴乃益铅。 朔为初三，一阳始复； 十六望后，一阴始姤。 《契》曰：八日兑受丁，上弦平如绳； 十五乾体就，盛满甲东方； 十六转受统，巽辛见平明； 艮值于丙南，下弦二十三。 学者将此理，参诸易卦，方知大道，自有其真，不可诬也。 】 百句章中字，字字要寻文。 此书雷将守，得者慎勿轻。 【注：此书共一百句。 只此百句章中，计字五百，明珠照眼，字字精微。 学者寻文揣义，句下言中，默会其理。 超凡作圣，秘密玄机。 上天之所宝贵者，是篇泄尽天机，雷神护此真诀，读者慎勿轻视为泛泛之言。 敬之，毋忽！ 】",
      "translated_text": "To transform sentient beings—this is called attaining the Dao. The text elaborates at length, reaching the utmost purity and stillness, yet suddenly appends a line: \"Those who awaken to this may transmit the sacred Dao.\" Even at such purity and stillness, there is still transmission—why do people remain so unaware? In short, they are accustomed to the common principles of the human world and fail to witness the marvels of sages and spirits; this again hinges on the depth or shallowness of one’s innate capacity.\n\n---\nHe knows not our Dao,\nmistaking the false for true.\nObserve heaven’s great Dao,\ngrasp heaven’s great workings.\n\n[Annotation: All heterodox schools cling rigidly to their own views. How could they know the subtlety of our Dao—borrowing the false to cultivate the true, turning the false into the real? The *Scripture of Unconscious Unison* says: \"Observe heaven’s Dao, grasp heaven’s workings—this is perfection.\" Heaven and earth form one great yin-yang; the human body, one small yin-yang. The heavens have Greater Yin and Greater Yang; the body, Lesser Yin and Lesser Yang—their principles are identical. The scripture states: \"Simply focus the heart on emulating heaven. The movements of heaven and earth, sun and moon, the wondrous functions of Kan and Li in the body, the four cardinal gates of mystery—who truly understands these?\"]\n\n---\nThe moon hangs over the western river,\nrosy clouds touch the southern shores.\nThree days before is the dark of the moon—\npure yin within yang.\n\n[Annotation: \"The moon hangs over the western river\" depicts the white moon atop the mountain, an image of fresh, tender medicinal sprouts. \"Rosy clouds touch the southern shores\" shows the red sun at the pool’s bottom, an image of vanquished yin demons. *Awakening to Reality* says: \"On the southwestern path, the moon’s brilliance shines—great medicine arises from this place.\" The western river is where lead is produced; the southern Li is the source of fire. \"Three days before\" refers to the three days prior to *geng*. The \"dark of the moon\" is the day before the new moon. Thus, \"three days before is the dark\" signifies the moment before the living *zi* hour, the end of *hai*. At this time, the great medicine is about to emerge—what is called \"the appearance of lead’s light three days prior\" occurs precisely at the height of yin.]\n\n---\nThree days after is the new moon—\nyang essence within yin.\nJust as winter solstice arrives,\nharmonious scenes herald a fine spring.\n\n[Annotation: \"Three days after\" refers to the three days following *jia*, when the dark of the moon ends and the new moon begins, the transition from the end of *hai* to the start of *zi*. At this moment, yin reaches its extreme and yang is born, a single yang rising from beneath the ninefold earth—akin to the seasonal winter solstice. The winter solstice is heaven and earth’s true *zi* hour; the \"yang essence\" is the body’s living *zi* hour. When yang returns, the great earth becomes spring, radiant with vibrant light and vitality. The arrival of true yang in the body is like the sun rising over Fusang, its crimson glow suffusing the earth. Three hundred sixty joints, eighty-four thousand pores—all melt into harmony, a sweet, unbounded ease, the whole body bathed in spring.]\n\n---\nThe eighth day is the first quarter,\ninquire at the rabbit’s gate of *mao*.\nThe sixteenth is the beginning of *gou*,\nthe twenty-third is the gate of *you*.\nThrough this, examine the *Yi* hexagrams—\nonly then can you know the true Great Dao.\n\n[Annotation: The new moon’s first quarter occurs on the eighth day of the month; the waning moon’s last quarter, on the twenty-third. *Mao* belongs to the rabbit, *you* to the rooster. These two hours are the gates of punishment and virtue, the moments of bathing—know that bathing at *mao* benefits mercury, while bathing at *you* benefits lead. The third day of the new moon marks the first return of a single yang; after the sixteenth day of the full moon, a single yin begins to *gou*. *The Union* says: \"On the eighth day, *dui* receives *ding*, the first quarter level as a string; on the fifteenth, the *qian* body is complete, fullness in *jia* to the east; on the sixteenth, the mandate shifts, *xun*’s *xin* appears at dawn; *gen* aligns with *bing* to the south, the last quarter on the twenty-third.\" Scholars who study this principle and examine the *Yi* hexagrams will recognize that the Great Dao possesses its own truth—it cannot be falsified.]\n\n---\nA hundred verses in this chapter,\neach word demands careful study.\nThis book is guarded by thunder gods—\nthose who obtain it must not treat it lightly.\n\n[Annotation: This book contains one hundred verses. Within these hundred verses—five hundred characters in all—each is a luminous pearl, every word profoundly subtle. Scholars must seek the text’s meaning, ponder its phrases, and silently grasp its principles. To transcend the ordinary and become a sage, to hold the secret and mysterious mechanism—this is what heaven treasures. This chapter reveals the celestial mechanism in full, and thunder spirits guard this true formula. Readers must not dismiss it as mere casual speech. Revere it—do not neglect!]",
      "overlap_context": "wealthy and powerful. The ancients had to leave the mountains, yet people today insist on entering them; the ancients all worked through action, yet people today only speak of non-doing. So many contradictions, running counter to the Dao. Stubbornly clinging to dead stillness, they die without regret. Why not read the *Scripture of Purity and Stillness*, which says: \"Such purity and stillness gradually enter the true Dao; though it is called attaining the Dao, in reality, nothing is attained.\"]*",
      "start_char": 12252,
      "end_char": 13212,
      "start_sentence": 645,
      "end_sentence": 698,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.287148475646973,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "三、真经歌 真经歌，真经歌，不识真经尽着魔，人人纸上寻文义，喃喃不住诵者多。 【注：真者对假而言。 真经者，修真之经也。 真经实无文字，乃混沌之初，玄黄之始，太极之先，元气之祖。 万天仙佛。 其来也，非此经无由入世； 其去也，非此经无由出世。 实生天生地、生人生万物之根源。 仙佛炼此而升，鬼神因此而有。 灵坛圣众，洞天福地，真宰造化。 世间万事万理，自无而有之形，自有而无之气，莫不出之。 大哉真经！ 不可思议，无得而称矣！ 凡夫用以生男育女而妮之，至人用以接命成真而宝之。 此物众多，无论外国中华，不拘富贵贫践，遍大地无不是者。 所谓屋下青天，眼前尽有活路。 但不得真师指示！ 无由知妙用耳。 世人惟不识妙用，故尽入魔道。 如闺丹食秽，采战御女。 此地狱种子，万劫不超生之事，缘何入此魔军，受此魔障为不识真经故耳。 有等依文解义，专在语句中寻觅玄理，八卦中探索爻象，喃喃诵习，其去道皆千万里。 】 持经咒，念法科，排定纸上望超脱，若是这般超生死，遍地释子成佛、罗。 【注：持咒念经，遵行科仪，专在语言文字中求超脱之法，谓真诀在纸。 若是这般做作，便可脱离苦海，超凡入圣，了此生死大事，则大地众生，及诸释子，持咒诵经者，何啻千万，从古不闻有诵经咒而登仙作佛者，可知必有其道矣。 】 得真经，出洪波，不得真经没奈何； 若问真经端的处，先天造化别无多。 【注：上文皆虚指经之名义，至此方直说真经妙处。 言此真经，甚不易得。 若得此真经，则洪波可出。 世人在苦海中，随波逐浪，无有出期。 此经便是洪波宝筏，彼岸慈航。 不得此经，真实无法，其奈此洪波何也。 世人要问此真经的确玄妙之处，只在寻觅先天造化，真正玄机。 其理至微，其事易简，实无多事也。 】",
      "translated_text": "**III. The Song of the True Scripture**\n\nThe Song of the True Scripture, the Song of the True Scripture—\nthose who fail to recognize the True Scripture are all possessed by demons.\nEach person seeks meaning in the written word,\nand many chant ceaselessly without end.\n\n[Annotation: *True* is spoken in contrast to *false*. The *True Scripture* is the scripture of cultivating the True. In truth, the True Scripture has no written form—it exists before the primal chaos, before the beginning of the dark and yellow, before the Supreme Ultimate, as the ancestor of primordial qi. All heavenly immortals and buddhas: in their coming, none could enter the world without this scripture; in their going, none could leave the world without it. It is the root-source that gives birth to heaven and earth, to humans and the myriad things. Immortals and buddhas refine it to ascend; ghosts and spirits exist because of it. The sacred assemblies of the numinous altars, the blessed lands of the grotto-heavens—all are shaped by the True Governor of creation. The ten thousand affairs and principles of the world, the forms that arise from nonbeing, the qi that dissolves into being—none do not emerge from it. Great indeed is the True Scripture! It is beyond conception, beyond naming.\n\nThe common person uses it to bear sons and raise daughters, cherishing it as a trifle; the perfected one uses it to extend life and attain the True, treasuring it as sacred. This thing is abundant—whether in foreign lands or China, regardless of wealth or poverty, it fills the earth without exception. It is the blue sky beneath the roof, the living path before one’s eyes. Yet without a true teacher’s guidance, none can know its wondrous use.\n\nPeople, failing to recognize its wondrous use, thus fall entirely into demonic paths—such as swallowing cinnabar and consuming filth, or engaging in sexual arts with women. These are the seeds of hell, deeds that prevent rebirth for ten thousand kalpas. Why do they enter these demonic ranks and suffer such demonic obstructions? Only because they do not recognize the True Scripture.\n\nThere are those who rely on textual exegesis, seeking profound principles solely in words and phrases, probing the trigrams for symbolic meanings, chanting endlessly—yet they remain a thousand miles from the Dao.]\n\nHolding scriptures and incantations, reciting ritual codes,\narranging them on paper in hope of liberation—\nif such means could transcend life and death,\nthen every monk on earth would become a buddha.\n\n[Annotation: Holding incantations and reciting scriptures, following ritual procedures, seeking liberation solely through words and texts—this is to assume the true formula lies on paper. If such practices could free one from the sea of suffering, transcend the ordinary, and enter sagehood, resolving the great matter of life and death, then all beings on earth, and the countless monks who chant scriptures and incantations, would have long since become buddhas. Yet since ancient times, none have attained immortality or buddhahood through mere recitation—thus, the true path must lie elsewhere.]\n\nObtain the True Scripture, and emerge from the vast waves;\nwithout the True Scripture, there is no recourse.\nIf you ask where the True Scripture truly lies—\nin the primordial creation, nothing more.\n\n[Annotation: The above passages allude to the scripture’s name and meaning; only now is its wondrous nature directly revealed. This True Scripture is most difficult to obtain. If one gains it, one may escape the vast waves. People drift in the sea of suffering, tossed by the currents without end. This scripture is the precious raft of the vast waves, the compassionate ferry to the other shore. Without it, there is truly no method—what can one do about these vast waves?\n\nIf one asks where the true and wondrous essence of this scripture lies, it is simply in seeking the primordial creation, the authentic mechanism of the mysterious. Its principle is most subtle, its practice most simple—there is truly nothing more to it.]",
      "overlap_context": "n these hundred verses—five hundred characters in all—each is a luminous pearl, every word profoundly subtle. Scholars must seek the text’s meaning, ponder its phrases, and silently grasp its principles. To transcend the ordinary and become a sage, to hold the secret and mysterious mechanism—this is what heaven treasures. This chapter reveals the celestial mechanism in full, and thunder spirits guard this true formula. Readers must not dismiss it as mere casual speech. Revere it—do not neglect!]",
      "start_char": 13214,
      "end_char": 13944,
      "start_sentence": 699,
      "end_sentence": 737,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.181957006454468,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "顺去死，逆来活，往往教君寻不着。 真经原来无一字，能度众生出大罗。 【注：仙道人道，只争顺逆，是故易逆数也。 顺则生人生物，逆则成仙成佛。 又曰五行顺行，法界火坑； 五行逆行，不死长生。 人道由最初一点，至哇然一声，而婴，而孩，而童，而少壮，而老死，此有生之顺行也。 仙道返老还童，而胎婴，而太极，而无极，此无生之逆行也。 万卷丹经，只是讲理。 所以曰：只为丹经无口诀，教君何处结灵胎逆虽可活，而其法不传，往往使人无可摸捉，寻觅不着。 须知此经，非有字之经，乃大海之潮汐，月不失期。 《契》所谓“周旋十二节，节尽更须亲”是也。 此经便能超度众生，而升大罗三清之境。 昔者三藏法师，师徒四人，凡十四年，自西天取来。 《悟真篇》曰：白虎首经至宝。 三丰祖《一枝花》曰：爱的首经红铅，千圣万真，非经不度，即此是也。 】 要真经，度自己，除非同类两相和。 生天生地与生人，岂离阴阳造化窝。 【注：真经秘密，不易闻知。 祖师慈悲，言汝凡夫。 欲觅真经自度，今直为汝指陈。 除非用同类，两相和合。 同类为谁所配是也。 祖不云乎“锅破还要铁来补，衣烂必用布为持，人损若无真金气，十死何曾得一活”《悟真》曰：竹破须将竹补宜，抱鸡当用卵为之。 万般非类徒劳力，争似真铅合圣机又曰：衣破必用布补，人衰须假铅全。 《契》曰：欲作服食仙，宜以同类者。 又曰：同类易施工，非种难为巧。 类同者相从，事垂不成宝。 是以燕雀不生凤，狐兔不乳马，非类故也。 既曰同类，又曰两相和，词旨明显，更何疑议学道之士，果能以类相求，妙化之气，自然发生。 生人如此，生天地，生万物亦是如此。 《灵宝毕法》曰：道气皆在人身，能化生诸天，开明三景。 阴阳即同类也，有阴阳然后有造化。 造化而曰窝，必有其窍矣。 】",
      "translated_text": "To follow the flow is death, to reverse the course is life—yet often you seek in vain.\nThe True Scripture originally bears not a single word,\nyet it can ferry all beings beyond the Great Veil.\n\nDao of immortals and Dao of humanity differ only in following or reversing;\nthus the *Yi* speaks of \"reversing the reckoning.\"\nTo follow is to generate humans and creatures;\nto reverse is to become immortal or Buddha.\nIt is also said: the Five Phases flowing forward make a fiery pit of the dharma-realm;\nthe Five Phases flowing in reverse bring undying longevity.\nThe human path begins with an initial spark,\nproceeds to a wailing cry at birth,\nthen infancy, childhood, youth, maturity, old age, and death—\nthis is the forward flow of conditioned existence.\nThe immortal path returns from old age to youth,\nthen to the fetal state, to the Supreme Ultimate, to the Ultimateless—\nthis is the reverse flow of unconditioned existence.\nTen thousand volumes of alchemical scriptures speak only of principle.\nHence it is said: \"Because alchemical scriptures lack oral instructions,\nwhere can you form the numinous embryo?\"\nThough reversal may bring life,\nits method is not transmitted,\noften leaving seekers groping in the dark, unable to find it.\nKnow that this scripture is not a scripture of written words,\nbut the tides of the great ocean, where the moon never misses its appointed time.\nAs the *Cantong Qi* says: \"Revolving through the twelve nodes,\nwhen one cycle ends, you must draw near again.\"\nThis scripture alone can deliver all beings,\nascending them to the realm of the Three Pure Ones in the Great Veil.\n\nTo obtain the True Scripture and deliver yourself,\nnothing suffices but the harmony of two like kinds.\nWhether generating heaven, earth, or humanity,\nhow could it depart from the nest of yin-yang transformation?\n\nThe True Scripture’s secrets are not easily heard.\nOut of compassion, the Patriarch speaks plainly to you, ordinary beings:\nif you seek the True Scripture to deliver yourself,\nI now directly point it out to you—\nnothing suffices but the use of like kinds in mutual harmony.\nWho, then, is the counterpart?\nAs the Patriarch does not fail to say:\n\"A broken pot must be mended with iron,\ntattered clothes must be held together with cloth.\nIf a person’s vitality is damaged yet lacks the true golden qi,\nhow could one in ten thousand ever revive?\"\nThe *Wuzhen Pian* says:\n\"A broken bamboo must be mended with bamboo,\nto hatch a chick you must use an egg.\nAll efforts with unlike kinds are wasted labor—\nhow could they compare to true lead uniting with the sacred mechanism?\"\nIt also says:\n\"Tattered clothes must be mended with cloth,\na weakened person must be restored with lead.\"\nThe *Cantong Qi* says:\n\"To prepare the elixir of immortality,\nyou must use substances of the same kind.\"\nAnd again:\n\"Like kinds are easily worked,\nunlike kinds cannot be skillfully employed.\nOnly like kinds follow one another—\nwithout this, the work will not yield treasure.\"\nThus swallows do not hatch phoenixes,\nfoxes and hares do not nurse foals—\nbecause they are not of the same kind.\nSince it is called \"like kinds\" and \"mutual harmony,\"\nthe meaning is clear—what further doubt could there be?\nIf cultivators of the Dao truly seek by means of like kinds,\nthe qi of wondrous transformation will naturally arise.\nThis is how humanity is generated,\nand how heaven, earth, and the myriad things are generated.\nThe *Lingbao Bifa* says:\n\"The Dao-qi resides entirely within the human body,\nable to transform and generate all heavens,\nilluminating the Three Luminaries.\"\nYin and yang are themselves like kinds;\nonly with yin and yang does transformation arise.\nWhen transformation is spoken of as a \"nest,\"\nthere must be an aperture within it.",
      "overlap_context": "e drift in the sea of suffering, tossed by the currents without end. This scripture is the precious raft of the vast waves, the compassionate ferry to the other shore. Without it, there is truly no method—what can one do about these vast waves?\n\nIf one asks where the true and wondrous essence of this scripture lies, it is simply in seeking the primordial creation, the authentic mechanism of the mysterious. Its principle is most subtle, its practice most simple—there is truly nothing more to it.]",
      "start_char": 13945,
      "end_char": 14669,
      "start_sentence": 738,
      "end_sentence": 773,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.353336572647095,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "说真经，不脱空，西川涧底产黄金，五千四十归黄道，正合一卷《大藏经》。 【注：惟此真经，非如佛法之谈空，乃有凭有据之事。 不曰西方，而曰西川。 曰涧底，流水之源，金之所从出也。 一部《大藏经》，五千四十八卷。 人身亦然，五千四十八日，而黄道始开。 黄道者，日月所行之道也。 不独藏经五千四十八，即如《道德经》五千言，《金刚经》五千言，皆合一藏之数。 】 日满足，气候通，地应潮兮天应星。 初祖达摩亲口授，真玄妙法莲花经。 【注：日数未足，则气候不通。 满足者，谓五千四十八日。 至此而气候始通。 气候不通，则天地隔绝； 气候既通，则天地相应，潮应于地，星应于天。 此天地之理，即道之理。 天地之机，即道之机也。 达摩闻东土有大乘气象，乃自西方渡海而来中国，释氏尊为初祖。 亲口授者，所谓口口相传，不记文，真玄妙者言此口授乃是至真至玄至妙之法也。 莲花经特借喻耳。 莲中通外直，出污泥而不染。 佛言我于五浊恶世，修行而得大道，是从污泥中出，不是从清静中出者。 真玄妙法，在个中求。 】",
      "translated_text": "To speak of the true scripture is not to indulge in emptiness—\nin the ravines of the Western Riverbed, yellow gold is born.\nFive thousand and forty [days] return to the Yellow Way,\nprecisely matching one volume of the *Great Treasury of Scriptures*.\n\nWhen the days are fulfilled and the qi-cycles align,\nearth responds with tides, heaven responds with stars.\nThe First Patriarch Bodhidharma personally transmitted it,\nthe true, wondrous, and subtle Dharma of the *Lotus Sutra*.\n\nThe lotus is hollow within yet straight without,\nemerging from filth yet unstained.\nThe Buddha said: \"In this world of the five defilements,\nI cultivated and attained the Great Way—\narising from the mire, not from purity.\"\nThe true, wondrous, and subtle Dharma is sought within this.",
      "overlap_context": "eans of like kinds,\nthe qi of wondrous transformation will naturally arise.\nThis is how humanity is generated,\nand how heaven, earth, and the myriad things are generated.\nThe *Lingbao Bifa* says:\n\"The Dao-qi resides entirely within the human body,\nable to transform and generate all heavens,\nilluminating the Three Luminaries.\"\nYin and yang are themselves like kinds;\nonly with yin and yang does transformation arise.\nWhen transformation is spoken of as a \"nest,\"\nthere must be an aperture within it.",
      "start_char": 14670,
      "end_char": 15113,
      "start_sentence": 774,
      "end_sentence": 798,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.686982870101929,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "初三日，震出庚，曲江上，月华莹，花蕊初开含珠露，虎穴龙眠探浊清。 【注：初三哉生明，新月始出，在西南庚位，露出一弯蛾眉，此乃阳气初现。 《契》曰：三日出为爽，震受庚西方。 又曰：三日震动，八日兑行。 《悟真篇》曰：西南路上月华明，大药还从此处生。 《泌园春》曰：曲江上，见月华莹净，有个乌飞，皆谓此复卦初萌，长子继体，因母而兆形也。 但此时如芽蘖新萌，花蕊含露，娇嫩之至，所谓初九之潜龙也。 《悟真》曰：二物会时情性合，五行全处虎龙蟠。 欲要龙眠虎穴，先看泾渭浊清。 此时细心探候，以离配坎，以坎填离，入虎穴而眠矣。 】 水生二，药正真，若待其三不可进。 壬水初来癸未来，须当急采定浮沉。 【注：《参同契》曰：临炉定铢两，五分水有余。 二者以为真，金重如本初，其三遂不入，火二与之俱。 所谓水生二者，九二之见龙也。 此时药物真正，恰好临炉。 若待其水之三分，便是有悔之亢龙。 所谓金逢望远，不可进火而用采工。 壬为阳水，癸为阴水，采药者当去癸而取壬； 于癸水将尽，壬水初生，此时药苗新嫩，先天正兆之时，当辨其浮沉而急采之。 浮为阳银，沉为阴铅。 《入药镜》曰：“识浮沉，明主客”是也。 】 金鼎炼，玉炉烹，温温文火暖烘烘。 真经一射玄关透，恰似准箭中红心。 【注：烹炼玉液金精，全借阳炉阴鼎。 金鼎采金之鼎，玉炉烹玉之炉。 陀阳真入《入火镜》曰：阳文火，阴武火，得之者，成道果。 温养之火，惟温温暖气，非比采取之火，猛烹极炼。 真经一到，直射玄关，恰似箭中红心，不差分寸，此言信有准也。 】 遍体热，似笼蒸，回光返照人中宫。 一得真经如酒醉，呼吸百脉尽归根。 【注：泥丸祖曰：其次膀胱如火然，内中两肾如汤煎。 《规中指南》曰：夹脊如车轮，四肢如山石，两肾如汤煎，膀胱如火然。 此还丹证验，干圣一辙。 回光反照，两相内睹，须臾不离，造次在此。 真经一到，则如醉如痴。 《火候篇》曰：终日醺醺如酒醉，悠悠只守洞中春。 《入药镜》曰：先天气，后天气，得之者，常似醉。 元和内运，呼吸皆春，归根复命，返本还原，工夫至此，指日飞腾。 】 精入气，气忽神，混沌七日复还魂。 这般造化真消息，料得世上少人论。 【注：大丹只是精气神三件炼成。 初工炼精化气，筑基之事也。 中节炼气化神，还丹之事也。 末节炼神还虚，归极之事也。 斯道必重开混沌，再入胞胎。 七日天机，还魂摄魄，即此混沌。 七日，便是真消息，真造化。 世人所说尽是世间法，此天上玄机，神霄秘藏，圣智难猜，鬼神不识。 料应世上凡夫，少有得而知之者矣。 】 活中死，死复生，自古仙佛赖真经。 此个造化能收得，度尽阎浮世上人。 【注：祖云拚不得死，求不得生。 古人誓死圜墙，要此刚决敌魔之真志，乃可死中求活耳。 活中死，死复生，乃混沌七日，再开一重草昧之象，非真死也。 邵子曰：恍惚阴阳初变化，氤氲天地乍回旋。 即真经是造化，赖此成仙作佛，更无二道。 今之禅和，参公案，听棒喝，打机锋，空诸爱欲，尽说无生，都是宗门衍象，岂真可以成佛乎别有真矣！ 宗教有云：金钵盂被如来丢入海底。 又云：后来被释迦把断要津。",
      "translated_text": "On the third day, the *Zhen* trigram emerges with *geng*,\nabove the Winding River, the moon’s radiance gleams bright.\nFlower buds just unfurl, bearing pearls of dew;\nin tiger’s den and dragon’s lair, one probes the turbid and the clear.\n\nWater begets two, the elixir is true—\nwait for three, and it cannot advance.\n*Ren*-water first arrives, *gui* has yet to come:\nswiftly gather it, discerning its rise and fall.\n\nThe golden crucible refines, the jade furnace smelts,\nwith gentle, warming embers, softly glowing.\nThe true scripture pierces the Mysterious Pass in a single shot,\nlike an arrow striking the red center of the target.\n\nThe body grows hot, as if steamed in a basket;\nturning the light inward, it illumines the Central Palace.\nOnce the true scripture is attained, one is drunk as with wine—\nbreath and pulse return to their root, all hundred channels restored.\n\nEssence enters *qi*, *qi* transforms into spirit;\nafter seven days in chaos, the soul returns anew.\nSuch is the true workings of creation’s message—\nhow few in the world dare to speak of it.\n\nAlive within death, dead yet reborn:\nsince ancient times, immortals and buddhas have relied on the true scripture.\nWhoever grasps this work of creation\nshall ferry all beings across the Jambu continent.",
      "overlap_context": "ys are fulfilled and the qi-cycles align,\nearth responds with tides, heaven responds with stars.\nThe First Patriarch Bodhidharma personally transmitted it,\nthe true, wondrous, and subtle Dharma of the *Lotus Sutra*.\n\nThe lotus is hollow within yet straight without,\nemerging from filth yet unstained.\nThe Buddha said: \"In this world of the five defilements,\nI cultivated and attained the Great Way—\narising from the mire, not from purity.\"\nThe true, wondrous, and subtle Dharma is sought within this.",
      "start_char": 15114,
      "end_char": 16405,
      "start_sentence": 799,
      "end_sentence": 863,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.089138269424438,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "又曰：有情来下种，因地果还生； 无情又五种，无性亦无生。 曰龙女献珠，曰地涌金莲，曰地涌宝塔，又曰成就如来马阴藏相，异乎不异乎今之释子，少真修矣。 祖师慈悲，并为点出。 若能知此真经，行此造化，阎浮提世界虽大，一时尽成仙佛。 经曰：若教凡辈皆知得，天下神仙似水流。 】 大道端居太极先，本于父母未生前。 度人须要真经度，若问真经癸是铅。 【注：太极之表，大道之源，父母未生之前。 《契》所谓元精云布，因气托初。 祖云“穷取生身受气初”。 未生之前，非如释氏之谈空，悟入无我； 须要悟到有我之初。 度人须要真经度，除此再无别法。 知得此经，则鼎炉符火，尽在其中。 天根月窟，皆从此起。 世人若问真经，铅即是癸，癸即是经，慈悲慈悲，我直欲哭，哭尽世间有志不逮之士。 空打熬，顽打坐，因缘不遇，熬苦一生，到老无成，可哀之甚。 熔凡入圣，至大之事，生世难逢。 愿天下贤俊，广种福田，多行阴骘。 寻师指破水中铅，自然一通百达，一了百当，而成真矣。 】 四、鼎器歌",
      "translated_text": "And it further states:\n*\"Sentient beings descend to sow the seed,\nBy cause in the ground, the fruit is born again;\nThe insentient are of five kinds,\nWithout nature, they too are unborn.\"*\n\nAs in the Dragon Girl offering the pearl,\nthe earth surging with golden lotuses,\nthe earth surging with the jeweled pagoda,\nor the perfection of the Tathāgata’s *māraṇa-guhya* form—\nare these different from what is not different?\nYet today’s monks rarely engage in true cultivation.\nThe patriarchs, in their compassion, have all pointed this out.\n\nIf one can know this true scripture and practice this work of creation,\nthough the Jambu continent be vast, all may at once become immortals and buddhas.\nThe scripture says:\n*\"Were the common folk all to know this,\nthe world’s immortals would flow like water.\"*\n\nThe Great Dao abides first in the Supreme Ultimate,\noriginating before father and mother.\nTo ferry others, one must ferry them with the true scripture—\nif asked what the true scripture is, *gui* is lead.\n\n**[Annotation:**\nBeyond the Supreme Ultimate lies the source of the Great Dao,\nbefore father and mother.\nAs the *Cantong Qi* says: *\"Original essence spreads like clouds,\nborne by qi at the beginning.\"*\nThe patriarchs say: *\"Exhaustively seek the moment of receiving qi at birth.\"*\nBefore birth, it is not like the Buddhists’ discourse on emptiness\nor awakening to the absence of self—\none must awaken to the very inception of the self.\n\nTo ferry others, one must ferry them with the true scripture;\nthere is no other method besides this.\nKnowing this scripture, the crucible, furnace, talismans, and fire\nare all contained within it.\nThe Celestial Root and the Moon Cavern all arise from this.\n\nIf one asks what the true scripture is—\nlead is *gui*, and *gui* is the scripture.\nCompassion, compassion! I would weep,\nweeping for all the aspirants in the world who fall short of their aim.\n\nIn vain they endure hardship, stubbornly sit in meditation,\nfailing to meet the right conditions,\nsuffering a lifetime of toil,\nonly to grow old without achievement—how pitiful!\nRefining the mortal to enter sagehood is the greatest of matters,\nrarely encountered in a lifetime.\n\nMay the worthy and wise of the world\nbroadly sow fields of merit,\ncultivate hidden virtues,\nseek a teacher to reveal the lead within water—\nnaturally, understanding one thing will open a hundred,\nresolving one will settle all,\nand one shall become true.\n**]**\n\n**IV. The Crucible’s Song**",
      "overlap_context": "tained, one is drunk as with wine—\nbreath and pulse return to their root, all hundred channels restored.\n\nEssence enters *qi*, *qi* transforms into spirit;\nafter seven days in chaos, the soul returns anew.\nSuch is the true workings of creation’s message—\nhow few in the world dare to speak of it.\n\nAlive within death, dead yet reborn:\nsince ancient times, immortals and buddhas have relied on the true scripture.\nWhoever grasps this work of creation\nshall ferry all beings across the Jambu continent.",
      "start_char": 16405,
      "end_char": 16826,
      "start_sentence": 864,
      "end_sentence": 887,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.221660614013672,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "鼎器本是乾坤体，大药原来精气神。 若会攒采归一处，须用同心三个人。 【注：修丹必用鼎器，鼎器为何乾坤之体是也。 夫乾坤而曰体，必非覆载之乾坤矣。 《悟真篇》曰：先法乾坤为鼎器，法者效法之也。 言效法天地以为鼎器也。 不有鼎器，何由得此大药大药惟何人身之精气神也。 夫安炉立鼎，会合阴阳。 攒簇火候，非是一人可以独行。 须同心密契，辅弼三人，乃可施工。 薛紫贤曰：三人同志谨防危，此侣伴之必不可无者。 】 三个人，无他说，只要真师真口诀，指破阴阳三品丹，方可存心待明月。 【注：惟此三人，法财相易，共辅真师，入室行工，必先秘授口诀，指破玄关，洞达阴阳，深明造化，将此三品大丹，三段大工，节节明白，毫无滞义。 到下工之际，方可留心待月，见月而测海潮，测潮而定刻漏。 水火同宫，生杀互用，无不契合。 】 待明月，也莫迟，收拾身心且筑基。 劈开尘心抛孽网，驱除五漏斩三尸。 【注：天机一到，时刻无差，急须收拾身心向内，先将基地筑固，使有漏之身不漏。 此下手临炉工夫，莫教迟误真机，有防长生大事。 然欲行工，必先养静，务要绝尽尘思，脱离孽网。 一切不关于心，心清如镜，体净无疵，使五漏不漏，而三尸可斩矣。 五漏者五官也。 目漏于视，耳漏于听，舌漏于味，鼻漏于嗅，心漏于意是也。 】 斩三尸，见铸剑，炼己通灵知应验。",
      "translated_text": "**IV. The Crucible’s Song**\n\nThe crucible is none other than the body of Heaven and Earth,\nthe great elixir is nothing but essence, qi, and spirit.\nIf you can gather and refine them into one,\nyou must employ three like-minded people.\n\nThree people—no other way—\nonly with a true teacher and true oral instructions,\nwho reveals the three-grade elixir of yin and yang,\ncan you then settle the mind and await the bright moon.\n\nAwait the bright moon, yet do not delay:\ngather body and mind to first lay the foundation.\nSplit open the dust-laden heart, cast off the karmic net,\nexpel the five leakages, slay the three corpses.\n\nSlay the three corpses, and the sword is forged;\nrefine the self to attain numinous knowing—then the signs appear.",
      "overlap_context": " to meet the right conditions,\nsuffering a lifetime of toil,\nonly to grow old without achievement—how pitiful!\nRefining the mortal to enter sagehood is the greatest of matters,\nrarely encountered in a lifetime.\n\nMay the worthy and wise of the world\nbroadly sow fields of merit,\ncultivate hidden virtues,\nseek a teacher to reveal the lead within water—\nnaturally, understanding one thing will open a hundred,\nresolving one will settle all,\nand one shall become true.\n**]**\n\n**IV. The Crucible’s Song**",
      "start_char": 16827,
      "end_char": 17400,
      "start_sentence": 888,
      "end_sentence": 914,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.405514478683472,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "刚柔变化任施为，万里驱妖如掣电。 【注：三尸者，人身血肉之神。 不欲人生，而利人死。 凡人愤不顾身，及拚命色欲，遏止不住之际，皆三尸之神，暗暗助火，搬运而颠倒之。 所以过后必悔。 此尸最为道害。 上尸居脑，中尸居腹，下尸居肾，即三彭也。 学道之士，先斩三尸。 《悟真篇》曰：杀尽三尸道可期。 斩之非铜铁之剑所能，必须慧剑，方能使有漏不漏。 此剑人人自有，而不肯用耳。 铸之以意，运之无形，以助炼己之功，久自灵通响应。 能刚能柔，能屈能伸，从心变化，万里驱妖，速如掣电。 】 如掣电，剑方灵，挂向南方护水晶。 若遇北方阴鬼起，一刀两断不容情。 【注：剑如掣电，始号通灵，挂向南方。 南方者，南离之位。 水晶者，心清如水。 非得此剑扶持，断难一尘不染。 须知此道系鬼窟中取宝，阴鬼寸步跟随。 萧了真曰：外道邪魔忽逞威，七星宝剑向前挥，果于鬼窟交锋处，夺得明珠一颗归。 “不容情”三字，决裂之极，稍纵即逝，戒之慎之。 】 不容情，常清静，心中皎洁如明镜。 镜心寂灭若虚空，始得临炉无弊病。 【注：柔情芥带，便不能清静矣。 欲修净业，必绝尽情私，不容其放纵，使镜心澄澈，万虑俱消，与虚空等，临炉对镜，方能不沾滞而无弊病。 不然一情偶动，万境俱非。 此际端在人把持得定，自然履虎尾而不咥人亨矣。 】 无弊病，可安炉，调和鼎器莫心粗。 言语不通非眷属，龙兴虎旺始堪图。 【注：一尘不染，始可安炉立鼎。 此鼎来自赤县神州，非钱不能办到。 纵然买得，不是即刻可用，必待其日数足，时令到，还要细心调和。 非是粗心浮气，可以用得。",
      "translated_text": "**IV. The Crucible’s Song (continued)**\n\nWith hardness and softness transformed at will,\nyou drive away demons for ten thousand leagues swift as lightning.\n*[Note: The three corpses are spirits dwelling in the flesh and blood of the human body. They do not wish for human life but thrive on human death. Whenever one acts recklessly in anger or surrenders to lust without restraint, it is these spirits that secretly stoke the fire, stirring chaos to overturn one’s resolve—hence the inevitable regret afterward. These corpses are the greatest hindrance to the Dao. The upper corpse resides in the brain, the middle in the abdomen, and the lower in the kidneys—collectively known as the Three Peng. Those who cultivate the Dao must first slay the three corpses. As *The Wuzhen Pian* states: \"Only when the three corpses are slain can the Dao be attained.\" Yet they cannot be severed by blades of bronze or iron; only the sword of wisdom can seal the leaks. This sword is possessed by all, though few are willing to wield it. Forged by intent and wielded without form, it aids in refining the self until, over time, numinous resonance arises. Able to be firm or yielding, to bend or extend, it transforms at the heart’s command, driving away demons for ten thousand leagues with the speed of lightning.]*\n\nSwift as lightning, the sword gains its numinous power,\nthen hang it in the south to guard the crystal waters.\nShould yin ghosts rise from the north,\na single stroke severs all without mercy.\n*[Note: Only when the sword moves like lightning is it called \"numinous.\" It is hung in the south—the position of *li* (fire). The \"crystal waters\" signify a heart as clear as water. Without this sword’s support, it is impossible to remain unstained by even a speck of dust. Know that this path is like extracting treasure from a den of ghosts, where yin spirits follow at every step. As Master Xiao Liaozhen said: \"When heretical demons suddenly display their might, brandish the Seven-Star Treasure Sword before you. In the very midst of the ghostly den’s battle, seize the luminous pearl and return.\" The phrase \"without mercy\" marks the utmost decisiveness—any hesitation, and the moment is lost. Beware, be vigilant.]*\n\nWithout mercy, abide in constant clarity,\nthe heart’s purity gleaming like a bright mirror.\nWhen the mirror-heart is extinguished, still as empty space,\nonly then can you face the crucible without flaw.\n*[Note: The slightest trace of tender attachment disrupts clarity. To cultivate pure karma, one must sever all private desires, allowing no indulgence, so that the mirror-heart becomes limpid, all thoughts dissolved, equal to empty space. Only then, when facing the crucible before the mirror, can one remain unstained and free of flaws. Otherwise, a single stirring of emotion summons a thousand illusions. At such moments, it all depends on one’s steadfast resolve—then one may tread upon the tiger’s tail without being bitten, and all will proceed smoothly.]*\n\nFree of flaws, the crucible may be set,\nharmonize the cauldron’s vessel without haste.\nIf words fail to connect, they are no true kin—\nonly when dragon rises and tiger thrives can the work begin.\n*[Note: Only when not a speck of dust remains can the crucible and cauldron be established. This cauldron comes from the divine lands of the Red Continent and cannot be obtained without wealth. Even if purchased, it is not immediately usable—one must wait for the appointed days and seasons, then tend to it with meticulous care. It cannot be employed with a rough or impatient mind.]*",
      "overlap_context": "ree people—no other way—\nonly with a true teacher and true oral instructions,\nwho reveals the three-grade elixir of yin and yang,\ncan you then settle the mind and await the bright moon.\n\nAwait the bright moon, yet do not delay:\ngather body and mind to first lay the foundation.\nSplit open the dust-laden heart, cast off the karmic net,\nexpel the five leakages, slay the three corpses.\n\nSlay the three corpses, and the sword is forged;\nrefine the self to attain numinous knowing—then the signs appear.",
      "start_char": 17400,
      "end_char": 18068,
      "start_sentence": 915,
      "end_sentence": 951,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.961621046066284,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "通语言，作眷属，要待龙虎兴旺，始而驱龙就虎，继而即虎擒龙。 苟非二物兴旺之候，不可妄为，旺则堪图也。 】 始堪图，观复作，凿开混沌鸿蒙窍。 静观虎啸与龙吟，自然华池神水到。 【注：炼丹必待龙兴虎旺，始有来复之机。 《易》曰：复其见天地之心。 邵子谓：冬至子之半，天心无改移。 一阳初动处万物未生时。 此际正是先天太极，杳冥恍惚之际，亦如混沌初开，鸿蒙乍启。 夫此鸿蒙之窍，谁为凿开端在真师传授之的。 龙虎一交，风云际会，凝神入气穴而观之，玄黄立战化作天地之髓，此髓便是神水华池，自然而然，一时都到。 所谓只要神水入华池者此也。 】 神水到，辨浮沉，莫教时过枉劳心。 铅遇癸生须急采，金逢望远不堪亲。 【注：神水者真铅也。 先辨浮沉，次明主客，然后测海潮，听消息。 此时一刻万金，切勿当面错过，致令枉用心机。 采真铅者。 以何为候当癸生之时，急用采工。 此时阴极阳生，如初三之月，渐次生明，至望值金精盛极。 若至望远，则铅已成质，不堪采取矣。 亲者亲近之也。 】 不堪亲，休乱取，地裂山崩难作主。 不知止足必倾危，盛夏严霜冬大暑。 【注：不堪亲者，时已过也。 便当止火，勿行采取之工。 倘胡乱行为，必致炉残鼎败，龙散虎哮，不自主持矣。 须知止火有定则。 经曰：知足不辱，知止不殆。 若也持盈未已，必遭倾覆，而取殆辱矣。 《契》曰； 纤芥不正，悔吝为贼。 隆冬大暑，盛夏雪霜。 天见其怪，山崩地裂。 可不慎与 】 冬大暑，不遭逢，三宝牢关密守中。 太极自然生造化，趁时搬驭人黄宫。 【注：盛夏严霜，隆冬大暑，须要谨慎，切勿遭逢。 三宝者，耳目口。 《契》曰：耳目口三宝，闭塞勿发通，真人潜深渊，浮游守规中。 老子曰：多言数穷，不如守中。 果能守中绝学，抱一无言，太极亟三，自然生出造化。 惟此造化窟中，自然产出大药。 时节一到，大用现前，急备搬腾，猛加抽添，驾动河车，由天谷泥丸，运入黄宫。 黄宫者，中央土釜，即黄庭也。 】 入黄宫，须爱护。",
      "translated_text": "To commune in speech is to become kin,\nyet one must await the thriving of dragon and tiger—\nonly then may the dragon be driven to the tiger,\nand in turn, the tiger seize the dragon.\nIf the moment of their flourishing has not arrived,\ndo not act recklessly, for only in their vigor may the work begin.\n\nOnce the work may begin, observe the return,\nand hew open the aperture of primordial chaos.\nWatch in stillness the tiger’s roar and the dragon’s song,\nand naturally the divine water of the Flowery Pond will arrive.\n\nWhen the divine water arrives, discern its rising and sinking,\nlest the hour pass and your efforts be in vain.\nWhen lead meets the birth of *gui*, hasten to gather it;\nwhen gold nears its fullness, it is no longer fit for intimacy.\n\nIf unfit for intimacy, do not recklessly take—\nearth will split and mountains crumble, and you will lose control.\nHe who knows not when to cease courts peril;\nin midsummer, bitter frost; in deep winter, scorching heat.\n\nIf scorching winter is not encountered,\nguard the Three Treasures within the firm pass.\nThe Great Ultimate naturally generates transformation—\nseize the moment to guide and convey it into the Yellow Palace.\n\nEntering the Yellow Palace, tend it with care.",
      "overlap_context": "aste.\nIf words fail to connect, they are no true kin—\nonly when dragon rises and tiger thrives can the work begin.\n*[Note: Only when not a speck of dust remains can the crucible and cauldron be established. This cauldron comes from the divine lands of the Red Continent and cannot be obtained without wealth. Even if purchased, it is not immediately usable—one must wait for the appointed days and seasons, then tend to it with meticulous care. It cannot be employed with a rough or impatient mind.]*",
      "start_char": 18068,
      "end_char": 18901,
      "start_sentence": 952,
      "end_sentence": 1001,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.334670305252075,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "十月浇淋休失误。 子行阳火虎龙交，午退阴符自保固。 【注：中央神室，谓之黄庭。 丹既入此，谓之神丹入鼎。 《悟真篇》曰：“送归土釜牢封固”是也。 从此浇培，行大周天之火候，依前子进阳火，午退阴符。 阳火进而虎龙交，阴符退则自保固。 此并行独行之分界，不遇真师，何由得解】 自保固，暂相离，端坐忘言更待时，辐辏循环终则始，三百六十莫违期。 【注：独自保固，龙虎分交，暂时离异。 《契》曰：内以养己，安静虚无。 即端坐忘言之义。 更待时者，《无根树》曰：卸了重开有定期。 契曰“周旋十二节，节尽更须亲”。 如辐之辏毂，循环不穷，终则复始。 三百六十者，乾坤一卦之总数也。 乾之数，二百一十有六； 坤之数，百四十有四。 子行三十六，积得阳爻一百八十数； 午行二十四，合得阴符一百二十数，此阳爻用九，四九三十六也； 阴爻用六，四六二十四也。 除卯酉沐浴不在内，此周天之数，为妙用之程限者，不可不知。 】 莫违期，为则例，悟明真理须当契。 若还执着爻象行，只恐劳神形蠹弊。 【注：莫违期，刻定期限，不可移易。 准为则例，欲修妙道，先契妙机。 此个真机，须要契合，切勿执着。 若不悟彻玄微，执文泥象，数刻漏，按爻铢，形弊神劳，到老无成，空自费力。 此皆不悟玄中至理，讹舛谬误，自作聪明，到老无成。 当知此事，非真师指点，万无一是。 】 形蠹弊，往来坚，只恐心机未得闲。 思虑慕真毫发错，铅消汞散不成丹。 【注：往来者，小往大来之功，进退是也。 世人到身形蠹弊，老髦不堪。 若能行此往来之功，自然日见坚强，日有效验。 所以不能行此者，为方寸无定，万虑千愁不得一刻宁止。 夫炼铅烹汞，全在心静神闲。 毫髦思虑，便是差错。 《入药镜》曰：差毫发，不成丹。 《悟真篇》曰：毫发差殊不作丹，此之谓也。 】 不成丹，思炼己，皆因失却玄中理。 水干火燥要调停，刑德临门知进退。 【注：丹之不成，总由炼己不熟。 昔人谓炼己未熟； 不敢还丹。 炼己之功大矣哉。 又曰：修仙有程，炼己无限。 炼己二字，是修丹之大关键，大作用，大本领，断未有不先炼己而可以还丹者。 愚迷不达，欲妄行一时二候之功．鲜不蹶矣。 水火须要均平，不可偏胜。",
      "translated_text": "In the tenth month, water and nurture—do not miss the moment.\nAt *zi*, advance the Yang fire, tiger and dragon unite;\nat *wu*, retreat the Yin tally, naturally preserve and secure.\n\n[Note: The central divine chamber is called the Yellow Court.\nOnce the elixir enters here, it is called the divine elixir entering the crucible.\n*The Wuzhen Pian* says: \"Send it back to the earthen crucible, firmly sealed.\"\nFrom this point, tend it with watering and nurture,\npracticing the fire times of the great celestial cycle.\nAs before, advance the Yang fire at *zi*,\nretreat the Yin tally at *wu*.\nWhen Yang fire advances, tiger and dragon unite;\nwhen Yin tally retreats, naturally preserve and secure.\nThis marks the boundary between dual cultivation and solitary practice.\nWithout a true teacher, how could one comprehend it?]\n\nPreserve and secure, then briefly part,\nsit upright, forget words, and await the hour.\nLike spokes converging at the hub, cycling without end,\nthree hundred and sixty—do not miss the appointed time.\n\n[Note: In solitary preservation, dragon and tiger briefly separate.\n*The Cantong Qi* says: \"Within, nurture the self,\nabide in stillness and emptiness.\"\nThis is the meaning of sitting upright and forgetting words.\n\"Await the hour\" refers to *The Rootless Tree*:\n\"Once unloaded, it will reopen at a fixed time.\"\n*The Cantong Qi* says: \"Cycle through the twelve nodes,\nwhen one ends, begin anew.\"\nLike spokes converging at the hub, cycling without end,\nbeginning again when finished.\nThree hundred and sixty is the total number of the Qian and Kun hexagrams.\nQian’s number is two hundred and sixteen;\nKun’s number is one hundred and forty-four.\nAt *zi*, thirty-six advances, accumulating one hundred and eighty Yang lines;\nat *wu*, twenty-four retreats, totaling one hundred and twenty Yin tallies.\nThis is Yang lines using nine—four nines make thirty-six;\nYin lines using six—four sixes make twenty-four.\nExcluding *mao* and *you* for bathing, these are the numbers of the celestial cycle,\nthe measured limits of wondrous practice—one must not be ignorant of them.]\n\nDo not miss the appointed time, for it sets the rule.\nTo awaken to the true principle, one must accord with it.\nIf you cling to the movement of lines and images,\nyou may only exhaust the spirit and wear the body thin.\n\n[Note: Do not miss the appointed time—set the fixed limit, unalterable.\nTake it as the rule. To cultivate the wondrous Dao,\nfirst accord with the wondrous mechanism.\nThis true mechanism must be matched precisely—do not cling.\nIf you do not thoroughly awaken to the subtle mystery,\nclinging to the text and fixating on images,\ncounting the clepsydra, weighing the lines,\nthe body will wear thin and the spirit labor in vain,\nall effort wasted to old age.\nThis is all due to failing to awaken to the supreme principle within the mystery,\nfalling into error and confusion,\nmistaking oneself for wisdom—all to no avail in the end.\nKnow this: without a true teacher’s guidance, not one in ten thousand will succeed.]\n\nThe body worn thin, yet the work persists,\nbut the heart’s machinations may not yet be at rest.\nIf thoughts of longing for the true err by a hair’s breadth,\nlead dissolves, mercury scatters, and the elixir will not form.\n\n[Note: \"Persists\" refers to the work of advancing and retreating, of small going and great coming.\nWhen the body is worn thin and old age renders one unfit,\nif one can practice this advancing and retreating,\nnaturally one will grow stronger day by day, with daily results.\nThose who cannot do so are unsettled in mind,\na thousand worries and ten thousand anxieties leaving not a moment’s peace.\nRefining lead and cooking mercury depend entirely on a still heart and a tranquil spirit.\nThe slightest thought or worry is already an error.\n*The Mirror for Compounding the Medicine* says: \"Err by a hair’s breadth, and the elixir will not form.\"\n*The Wuzhen Pian* says: \"A hair’s difference, and the elixir will not be made.\" This is the meaning.]\n\nIf the elixir does not form, reflect on refining the self,\nfor all is lost through failing to grasp the principle within the mystery.\nWhen water dries and fire scorches, adjust and harmonize;\nwhen punishment and virtue arrive at the gate, know when to advance and retreat.\n\n[Note: The elixir’s failure to form is entirely due to the self not being sufficiently refined.\nThe ancients said: \"If the self is not sufficiently refined, dare not return the elixir.\"\nThe work of refining the self is vast indeed!\nIt is said: \"Cultivating immortality has limits; refining the self has none.\"\nThe two words \"refining the self\" are the great key,\nthe great function, the great foundation of elixir cultivation.\nThere has never been one who did not first refine the self and yet could return the elixir.\nThe deluded and ignorant, failing to understand,\nrashly attempt the work of the twelve hours—few do not stumble.\nWater and fire must be balanced, not allowed to dominate.]",
      "overlap_context": "longer fit for intimacy.\n\nIf unfit for intimacy, do not recklessly take—\nearth will split and mountains crumble, and you will lose control.\nHe who knows not when to cease courts peril;\nin midsummer, bitter frost; in deep winter, scorching heat.\n\nIf scorching winter is not encountered,\nguard the Three Treasures within the firm pass.\nThe Great Ultimate naturally generates transformation—\nseize the moment to guide and convey it into the Yellow Palace.\n\nEntering the Yellow Palace, tend it with care.",
      "start_char": 18901,
      "end_char": 19811,
      "start_sentence": 1002,
      "end_sentence": 1054,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.82698345184326,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "火炎则燥，水溢则滥，端在调停得中。 刑德临门，临于生杀之门也。 此时为沐浴之候，当知进退，不可违度。 】 知进退，勿忧凶，炼就炉中一点红。 产个婴儿兑气足，三年温养似痴聋。 【注：丹道先要知进知退，知吉知凶。 所谓进退者，进火退符也。 受气则吉，违误则凶。 若进退分明，不越矩度，有吉无凶，一粒金丹，赫然长红于炉中矣。 到得十月胎圆，婴儿出顶，兑金之气满足，至此不得不产也。 此后行三年乳哺之功，与前温养之功不少异。 俗事凡情，丝毫不挂，一似痴聋。 似痴聋，真快乐，静里调神离躯壳。 东西南北任邀游，出入往来乘白鹤。 【人见他痴呆呆蠢，无灵醒气，岂知其被褐怀玉，中藏无价之珍。 无何有之乡，寂灭海之境，真真快乐，谁得而知，谁得到此，便于此中调神出壳。 所谓朝游北海，暮宿苍梧，观六合以内之名山，览八方不同之风气，驾鹤腾空，往来自在，何乐可以比乎】 乘白鹤，脱尘埃，三岛神仙集会来。 一任桑田变沧海，我身无事挂灵台。 【注：前节言道成德就，潜伏待时也； 此节言太乙乃召，移居中洲也。 脱却凡尘，升于仙界。 三岛者，海中有三神山，神仙集会之所，仙寿万亿。 从此任他沧海桑田，我自灵台清寂，逍遥于真光法界中，无有穷极矣！ 积功累德超凡世，依然现化度群迷，那时方遂男儿志。 【仙阶等级，视功之大小。 所以黄帝议大行而降世，一世为民，再世为臣，三世为君。 故来人世积德累功，天上清虚建功难，人间浊恶立功易。 任他一切仙佛，无不慈悲，游行尘世，救苦救难，或现灵异，或暗扶持，指引群迷化度海表，所谓度尽众生，然后成佛。 那时功成名遂，大丈夫心胸，奇男子志愿。 到此一时了却，盛德大业，孰有过于此哉 】",
      "translated_text": "Fire blazes and turns parched, water overflows and spills—all hinges on harmonizing to the mean.\nWhen punishment and virtue arrive at the gate, they stand at the threshold of life and death.\nThis is the moment of bathing; one must know when to advance and retreat, never transgressing the measure.\n\nKnowing advance and retreat, fear no misfortune—\nwithin the crucible, a single crimson point is refined.\nA child is born, its *qi* of *dui*-metal full,\nthree years of nurturing leave it dull as the deaf and mute.\n\nThe Dao of the elixir first demands knowing advance and retreat, fortune and misfortune.\n\"Advance and retreat\" refer to advancing the fire and retreating the tally.\nReceiving *qi* brings fortune; error brings misfortune.\nIf advance and retreat are clear, never overstepping the rule, fortune comes without misfortune—\na grain of golden elixir glows crimson in the crucible.\nWhen the ten-month gestation is complete, the infant emerges from the crown,\nthe *qi* of *dui*-metal fulfilled—here it must be born.\nThereafter, three years of nursing care differ little from prior nurturing.\nWorldly affairs and mundane attachments are utterly cast off, as if deaf and mute.\n\nSeeming deaf and mute, yet truly joyous—\nin stillness, the spirit is tuned to leave the husk.\nEast, west, south, north—roam freely,\nentering and exiting, riding a white crane.\n\nPeople see him as dull and witless,\ndevoid of lively spirit—how could they know\nhe wears coarse cloth yet holds jade within,\nconcealing priceless treasure?\nIn the realm of nothingness, the boundless sea of extinction—\ntrue joy, who can know it?\nWho attains this may here refine the spirit to depart the shell.\nThus: by morning roaming the Northern Sea, by evening lodging in Cangwu,\ngazing upon the famous mountains within the six directions,\nbeholding the diverse winds of the eight quarters,\nriding a crane through the sky, coming and going at will—\nwhat joy can compare?\n\nRiding the white crane, free of dust,\nthe immortals of the Three Isles gather in assembly.\nThough mulberry fields turn to azure seas,\nmy spirit remains untroubled, poised in the numinous terrace.\n\nThe preceding verse speaks of the Dao perfected and virtue accomplished, lying in wait for the appointed time;\nthis verse tells of the Great One’s summons, moving to dwell in the Central Continent.\nShedding the mortal dust, ascending to the immortal realm.\nThe Three Isles lie in the sea, where immortals gather—\ntheir lifespan spans myriad eons.\nHenceforth, though seas turn to mulberry fields,\nmy numinous terrace remains serene,\nwandering freely in the realm of true light and dharma—boundless and endless!\n\nAccumulating merit and virtue to transcend the mortal world,\nyet still manifesting transformations to guide the deluded masses—\nonly then are a man’s aspirations fulfilled.\n\nThe ranks of immortals vary by the magnitude of merit.\nThus the Yellow Emperor, considering great deeds, descended to the world:\nfirst life as a commoner, next as a minister, then as a sovereign.\nTherefore, in the mortal realm, one accumulates virtue and merit—\nin the celestial realm of purity, building merit is difficult;\nin the turbid world of men, establishing merit is easy.\nNo immortal or buddha lacks compassion,\nwandering the dusty world to save the suffering,\nnow manifesting miracles, now silently aiding,\nguiding the deluded across the sea of transformation.\nAs it is said: only after delivering all beings does one become a buddha.\nThen, with merit accomplished and name fulfilled,\nthe heart of a great man, the aspirations of a heroic man—\nall is resolved in this moment.\nWhat greater virtue or grander achievement could surpass this?",
      "overlap_context": "work of refining the self is vast indeed!\nIt is said: \"Cultivating immortality has limits; refining the self has none.\"\nThe two words \"refining the self\" are the great key,\nthe great function, the great foundation of elixir cultivation.\nThere has never been one who did not first refine the self and yet could return the elixir.\nThe deluded and ignorant, failing to understand,\nrashly attempt the work of the twelve hours—few do not stumble.\nWater and fire must be balanced, not allowed to dominate.]",
      "start_char": 19811,
      "end_char": 20532,
      "start_sentence": 1055,
      "end_sentence": 1086,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.201054334640503,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 29,
      "original_text": "五、采金歌 道道道，无巧妙，玄玄玄，无多言，开关展窍也不难。 【注：道之一字，亦是强名。 先于天地而有，后于天地而存。 乃虚无之蒂，太极之根。 无一物是道，无一物非道。 最至平常，绝无巧妙。 玄之一字，理虽幽深，事极简易。 五千言说不穷，半句话便可了。 玉蟾祖曰：一言半句便通玄，何用丹书千万篇。 又曰：口诀无多字，只在半句间。 虽有开关展窍工夫，却也容易。 只要心坚，自无难事。 关者三关也，窍者玄窍也。 丹经曰：“玄窍开时窍窍开，三关通透不须劳”是也。 】 明雌雄，两剑全，筑基炼己采后天。 虽后天名滓质，先服后天后先天。 【注：吾身雌雄二剑，自有生佩于吾身，非假师授，难明此理，鲜有能用之者。 用之筑基而基成，用之还丹而功就。 所谓筑基者，采后天中之先天，接命延年之术也。 还丹者，采先天中之先天，作佛成仙之事也。 先天自虚无中来，后天从滓质而有。 先天无形，后天有体。 均之一气，而先后之不同。 《入药镜》曰：先天气，后天气，得之者，常似醉。 】 此妙诀，要师传，不得真师枉徒然。",
      "translated_text": "Five: The Song of Gathering Gold\n\nDao, Dao, Dao—no artifice, no subtlety;\nMystery, mystery, mystery—no need for many words.\nUnlocking the gates, unfolding the apertures is not hard.\n\n[Note: The word *Dao* is itself but a forced name.\nIt existed before heaven and earth, and endures after them.\nIt is the stem of the formless, the root of the Supreme Ultimate.\nNo single thing *is* the Dao, yet no single thing *is not* the Dao.\nMost utterly ordinary, utterly without artifice or subtlety.\nThe word *mystery* speaks of a principle profound yet subtle,\nyet the matter itself is utterly simple.\nFifty hundred words cannot exhaust it; half a phrase suffices.\nAncestor Yuchan said: \"Half a word, a single phrase, and mystery is penetrated—\nwhat need for alchemical texts in the tens of thousands?\"\nHe also said: \"The oral instructions contain few words,\nall held within half a phrase.\"\nThough the work of unlocking the gates and unfolding the apertures exists,\nit is, in truth, easy.\nOnly let the heart be steadfast, and nothing is difficult.\nThe *gates* are the Three Passes; the *apertures* are the Mysterious Aperture.\nAs the alchemical classics say: \"When the Mysterious Aperture opens, all apertures open;\nthe Three Passes are penetrated without labor.\"]\n\nDiscern the female and male, keep both swords whole,\nlay the foundation, refine the self, and gather the postnatal.\nThough the postnatal is called impure substance,\nfirst ingest the postnatal, then the prenatal.\n\n[Note: The two swords, female and male, have been with us since birth,\nworn upon the body—not bestowed by any master.\nFew comprehend this principle, and fewer still can wield them.\nWield them to lay the foundation, and the foundation is laid;\nwield them to return the elixir, and the work is accomplished.\n*Laying the foundation* means gathering the prenatal within the postnatal—\nthe art of extending life and prolonging the years.\n*Returning the elixir* means gathering the prenatal within the prenatal—\nthe task of becoming a buddha or attaining immortality.\nThe prenatal arises from the formless; the postnatal emerges from impure substance.\nThe prenatal is without form; the postnatal has substance.\nBoth are but a single *qi*, yet differ in their prenatal and postnatal nature.\n*The Mirror of Ingesting the Medicine* says: \"Prenatal *qi*, postnatal *qi*—\nhe who obtains them is ever as though drunk.\"]\n\nThis wondrous instruction must be transmitted by a master;\nwithout a true teacher, all effort is in vain.",
      "overlap_context": "men, establishing merit is easy.\nNo immortal or buddha lacks compassion,\nwandering the dusty world to save the suffering,\nnow manifesting miracles, now silently aiding,\nguiding the deluded across the sea of transformation.\nAs it is said: only after delivering all beings does one become a buddha.\nThen, with merit accomplished and name fulfilled,\nthe heart of a great man, the aspirations of a heroic man—\nall is resolved in this moment.\nWhat greater virtue or grander achievement could surpass this?",
      "start_char": 20533,
      "end_char": 20985,
      "start_sentence": 1087,
      "end_sentence": 1114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.013707637786865,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 30,
      "original_text": "筑基工夫往前进，火候屯蒙要抽添。 【注：欲学此道，先要洞明真诀。 此诀非师不传，愚迷或得一知半解，便想行工，岂知玄理幽深，非得真师，逐节开陈，寸步指点，亦是枉然。 初关进步筑基，便要勇猛直前。 有进无退，即是真功。 火候进退，按爻而行。 朝屯暮蒙，日各两卦。 有抽有添，抽铅添汞，皆有一定之则。 《灵宝毕法》曰：可抽之时不可添。 】 要抽添，认真铅，十三四五六相连。 审黄道，知端的，亦要看经五千言。 【注：抽添之诀，先要认定真铅，不得错误。 十三四五六者，选鼎之则也。 鼎有大小，有强弱，有迟早，不可一概，用之有一定之期。 相连者，连类而及，其妙限在于审黄道、知端的也。 黄道者，日月所行之道； 端的者，如矢之端正中的，不差绳墨，不违矩度也。 其要妙在于看经。 自不能看，探候者看而说之。",
      "translated_text": "Advancing the work of *laying the foundation*,\nthe firing times of *zhun* and *meng* require withdrawal and addition.\n**[Note: To study this Dao, one must first thoroughly understand the true instructions.\nThese instructions are not transmitted without a master. Should the foolish and deluded gain but a partial or superficial grasp, they may attempt to practice—yet how could they fathom the profound and subtle principles? Without a true teacher to unfold each step and guide every inch, all effort remains in vain.\nAt the initial barrier, advancing to lay the foundation demands bold and relentless progress—no retreat, only true achievement. The firing times advance and withdraw according to the hexagrams. *Zhun* at dawn, *meng* at dusk, each day encompassing two hexagrams. There is withdrawal and addition: withdrawing lead, adding mercury, all governed by fixed principles. *The Perfect Methods of the Numinous Treasure* states: \"When it is time to withdraw, do not add.\"]**\n\nTo withdraw and add, recognize true lead—\nthirteen, fourteen, fifteen, sixteen, linked in sequence.\nExamine the Yellow Path, know the precise target,\nand also study the *Five Thousand Words*.\n**[Note: The instructions for withdrawal and addition first require identifying true lead without error.\n\"Thirteen, fourteen, fifteen, sixteen\" refers to the principles for selecting the crucible. Crucibles vary in size, strength, speed, and timing; they cannot be treated uniformly, for their use follows a fixed schedule. \"Linked in sequence\" means extending by category, its subtlety lying in examining the Yellow Path and knowing the precise target.\nThe Yellow Path is the course traversed by the sun and moon; the precise target is like an arrow striking dead center, neither deviating from the plumb line nor transgressing the square. Its essential subtlety lies in studying the scriptures. If one cannot study them alone, the observer must study and then explain.]**",
      "overlap_context": " of becoming a buddha or attaining immortality.\nThe prenatal arises from the formless; the postnatal emerges from impure substance.\nThe prenatal is without form; the postnatal has substance.\nBoth are but a single *qi*, yet differ in their prenatal and postnatal nature.\n*The Mirror of Ingesting the Medicine* says: \"Prenatal *qi*, postnatal *qi*—\nhe who obtains them is ever as though drunk.\"]\n\nThis wondrous instruction must be transmitted by a master;\nwithout a true teacher, all effort is in vain.",
      "start_char": 20985,
      "end_char": 21332,
      "start_sentence": 1115,
      "end_sentence": 1134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.458690166473389,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 31,
      "original_text": "《阴符》三百字，《道德》五千言，无非说此经之妙。 二七为佳。 五千四十八而合当。 知此便是知道，行此便可飞升。 】 药苗新，用心看，铅光发现三日前。 癸水将至须急采，差之毫发不成丹。 【注：山头月白。 药苗新嫩，此是先天兆形，正好用心看经。 真铅将到，三日之前，其精光早耀于西南庚位，现出蛾眉一痕。 《契》曰：潜潭见象，发现精光，此时癸水将到，当急用采工，勿致差殊。 毫发一谬，丹即难成。 《入药镜》曰：差毫发，不成丹。 】 未采药，立匡廓，交合之时用橐龠。 用橐龠，近我身，不看天体枉为作。 【注：大药将产，堪下采工。 先于未采之前，立定匡廓。 匡廓者，即橐龠之匡廓也。 交合坎离，须用橐龠。 此采药之器，谓之太极把柄，入室施工之要具也。 《入药镜》曰：上鹊桥，下鹊桥，天应星，地应潮。 用之之法，远不离人，近就我身，亦如乾坤天地，坎离日月，体配阴阳，运行水火。 不解法天效地，便是枉为妄作，缘木求鱼，空劳神矣。 】",
      "translated_text": "The *Three Hundred Characters of the Yin Talisman* and the *Five Thousand Words of the Dao and Its Virtue* speak of nothing but the wonders of this sutra. Two sevens make the finest. Five thousand and forty-eight align perfectly. To know this is to know the Dao; to practice this is to ascend in flight.\n\nWhen the medicinal sprout is fresh, observe with care—three days before the lead’s radiance appears. As the *gui*-water approaches, swiftly gather it; a hair’s breadth of error, and the elixir will not form.\n\n**[Annotation: The moon whitens the mountain peak. The medicinal sprout is tender and new, this being the sign of the primordial omen—just the time to observe the sutras with care. As true lead nears, three days prior, its essence-light shines early in the southwest *geng* position, revealing a crescent’s trace. As the *Canticle* says: \"In the hidden depths, an image appears; the essence-light manifests.\" At this moment, as *gui*-water approaches, one must urgently apply the work of gathering, lest the slightest deviation occur. A hair’s error, and the elixir will not form. The *Mirror of Entering the Medicine* states: \"A hair’s breadth off, the elixir will not form.\"]**\n\nBefore gathering the medicine, establish the framework. At the time of union, employ the bellows. Use the bellows, drawing it near to your body—heed not the celestial bodies, or your efforts are in vain.\n\n**[Annotation: As the great medicine is about to emerge, the work of gathering may begin. First, before gathering, establish the framework. The framework is that of the bellows. In the union of *kan* and *li*, the bellows must be used. This instrument for gathering medicine is called the handle of the Great Ultimate, the essential tool for entering the chamber and applying the work. The *Mirror of Entering the Medicine* says: \"Above, the magpie bridge; below, the magpie bridge. Heaven responds to the stars, earth to the tides.\" The method of its use is neither far from the person nor distant from the self—just as *qian* and *kun* are heaven and earth, *kan* and *li* are the sun and moon, their bodies paired as yin and yang, their movements circulating water and fire. Failing to model oneself on heaven and earth is to labor in vain, climbing a tree to seek fish, exhausting the spirit to no purpose.]**",
      "overlap_context": "uniformly, for their use follows a fixed schedule. \"Linked in sequence\" means extending by category, its subtlety lying in examining the Yellow Path and knowing the precise target.\nThe Yellow Path is the course traversed by the sun and moon; the precise target is like an arrow striking dead center, neither deviating from the plumb line nor transgressing the square. Its essential subtlety lies in studying the scriptures. If one cannot study them alone, the observer must study and then explain.]**",
      "start_char": 21332,
      "end_char": 21747,
      "start_sentence": 1135,
      "end_sentence": 1159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.962971448898315,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 32,
      "original_text": "知癸生，晓癸现，三十时辰两日半。 采取只在一时辰，六候只于二候见。 【注：果能知癸生之的时，晓癸现之方位，只在两日半之间，三十时辰之内，真正天机，实隐于此。 所谓“采有时，取有日”是也。 然此采取，不多时候，只在一时。 《悟真篇》曰：一时辰内管丹成，即此一时。 分为六候，前二候得药，只此二候，便见工夫。 】 外四候，别有干。 得药之时勿贪乱。 如痴如醉更省言，牢关牢锁牢上圈。 【注：一时分为六候。 前二候既已得药归炉，尚余四候，另有炉鼎，另有事干。 盖前二候，系采药真工； 后四候，乃烹炼至诀。 丹经曰：“二候采牟尼，四候别神工”是也。 但得药之时，切要正心诚意，戒慎恐惧，不可稍起贪爱之心，致乱邦国。 《契》曰：邪道险阻，倾危国家。 此时如醉如痴，更要节省言语，丹入黄庭，牢关牢锁。 《契》曰：守御固密，遏绝奸邪，曲阁相连，以戒不虞，慎之至也。 】 择定饮食莫太过，又恐伤舟又霍乱。 减酸咸，常咬淡，黄婆伏侍用心看。 【注：未饥先食，未饱先止，此养生家之诀。 《天仙正理》亦谓调养口腹，安静气体，易易事耳。 择定饮食者，戒荤腥，绝滋味，减酸咸。 只用精洁芽茶淡饭。 丹乃色身至宝，难得而易失。 刻刻爱护，不可伤之，致霍乱不宁。 黄婆伏侍，切要殷勤，细心探看，不可怠惰，致令失时，最宜叮嘱。 】 一时饥饱失前功，铅散汞枯两不恋。 十月工夫要勤咽，勤咽之时防危险。 【注：一息不谨，则铅散汞枯，阴阳不调，龙虎易位，两不相恋。 此皆饥饱不节之故。 中关十月大周天功夫，刻不可间断，须要勤咽勤炼，寸步防危。 钟离祖曰：一年沐浴防危险，十月调和须谨节。 】 颇得道理明性歌，得之莫作容易看。",
      "translated_text": "Know when *gui* is born, understand when *gui* appears—thirty *shichen* span two and a half days. Gathering occurs in but a single *shichen*, the six *hou* manifest in only two. [Note: If one truly knows the precise moment when *gui* is born and the direction from which it emerges, within these two and a half days and thirty *shichen*, the true celestial mechanism lies concealed here. This is what is meant by \"gathering has its time, harvesting has its day.\" Yet this gathering takes but a brief moment, confined to a single *shichen*. *The Awakening to Reality* says: \"Within one *shichen* the elixir is complete\"—this is that very moment. Divided into six *hou*, the medicine is obtained in the first two; only in these two does the work become evident.]\n\nThe remaining four *hou* serve other purposes. When the medicine is obtained, do not covet or disorder. Be as one drunk or dazed, speak sparingly, fasten the gates and locks, secure the enclosure. [Note: One *shichen* is divided into six *hou*. Once the medicine is obtained in the first two and returned to the furnace, the remaining four *hou* involve another crucible and other tasks. The first two *hou* constitute the true work of gathering the medicine; the latter four are the supreme secrets of refinement. As the alchemical classics say: \"Two *hou* gather the *mauni*, four *hou* employ divine skill.\" Yet when the medicine is obtained, one must rectify the mind and sincerely intend, being cautious and reverent, without the slightest stirring of covetous desire, lest the state be thrown into chaos. *The Canticle* says: \"The heterodox path is perilous and treacherous, toppling nations and endangering the realm.\" At this time, be as one drunk or dazed, speak even less, and once the elixir enters the Yellow Court, fasten the gates and locks securely. *The Canticle* says: \"Guard and defend with firm resolve, block and sever all perverse influences. The winding chambers connect, to ward against the unforeseen—this is the utmost caution.\"]\n\nChoose your diet carefully, neither too much nor too little, lest you harm the vessel or invite disorder. Reduce sour and salty flavors, partake only of the bland. The Yellow Dame attends with watchful care. [Note: Eat before hunger arises, stop before fullness—this is the secret of the masters of longevity. *The True Principles of Celestial Immortality* also teaches that regulating diet and calming the body are simple matters. \"Choosing your diet carefully\" means abstaining from meat and strong flavors, reducing sour and salty tastes, consuming only pure, sprouted teas and plain rice. The elixir is the supreme treasure of the physical form, difficult to obtain and easy to lose. Cherish it at every moment, lest harm befall it and disorder arise. The Yellow Dame’s attendance must be diligent and attentive; she must observe with care, never slackening, lest the moment be missed—this bears the strictest admonition.]\n\nA single lapse in hunger or satiety undoes all prior work: lead scatters, mercury withers, and the two no longer embrace. The ten-month work demands diligent swallowing; when swallowing diligently, guard against danger. [Note: A single careless breath scatters the lead and withers the mercury, disrupting the harmony of yin and yang, transposing dragon and tiger, so they no longer embrace. This all stems from immoderate hunger or satiety. The great celestial cycle of the middle barrier’s ten-month work must never be interrupted; one must swallow and refine diligently, vigilant at every step. Ancestor Zhongli said: \"In the year’s bathing, guard against danger; in the ten months’ regulation, exercise utmost caution.\"]\n\nOnce you grasp the principle and comprehend the *Song of Illuminating Nature*, do not regard it as something easily attained.",
      "overlap_context": " Medicine* says: \"Above, the magpie bridge; below, the magpie bridge. Heaven responds to the stars, earth to the tides.\" The method of its use is neither far from the person nor distant from the self—just as *qian* and *kun* are heaven and earth, *kan* and *li* are the sun and moon, their bodies paired as yin and yang, their movements circulating water and fire. Failing to model oneself on heaven and earth is to labor in vain, climbing a tree to seek fish, exhausting the spirit to no purpose.]**",
      "start_char": 21748,
      "end_char": 22463,
      "start_sentence": 1160,
      "end_sentence": 1198,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.169346809387207,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 33,
      "original_text": "至人传，非人远，万两黄金不肯换。 【注：学道之士，先明道理，次习性功。 道妙渊深，断无自悟。 倘遇真师，取证斯文，得悟无上天机，此诀上天所宝，玄律至严，不易闻知。 莫要看得容易，特留此歌，为后贤作上天梯子。 《契》曰：天道无适莫兮，常传于贤者。 紫阳三传非人，三遭天谴，慎之慎之！ 得此传者，成万劫不坏之金身，九祖超登仙界，妻子咸享无极，何宝可比万两黄金，直尘土耳，宁堪换易耶！ 】",
      "translated_text": "The perfected transmit it, the unworthy are kept far from it—even ten thousand taels of gold would not be exchanged for it.\n\n[Those who study the Dao must first clarify its principles, then cultivate the work of nature. The Dao’s wonders run deep and abstruse; none awaken to it on their own. Should one encounter a true master and receive verification of this text, awakening to the supreme celestial mechanism, this secret is treasured by Heaven itself, its mysterious law most strict, not easily heard or known. Do not regard it as something easily attained. This song is specially preserved as a ladder to Heaven for later worthies.\n\nThe *Kuan* says: *\"The Heavenly Dao is not partial, yet it is ever transmitted to the worthy.\"*\n\nMaster Ziyang thrice transmitted it to the unworthy and thrice incurred Heaven’s censure—beware, beware!\n\nThose who receive this transmission will forge an indestructible golden body through ten thousand kalpas, ascend with nine generations of ancestors to the immortal realms, and grant their wives and children boundless blessings. What treasure could compare to ten thousand taels of gold? It is but dust—how could it be worthy of exchange?]",
      "overlap_context": "on and tiger, so they no longer embrace. This all stems from immoderate hunger or satiety. The great celestial cycle of the middle barrier’s ten-month work must never be interrupted; one must swallow and refine diligently, vigilant at every step. Ancestor Zhongli said: \"In the year’s bathing, guard against danger; in the ten months’ regulation, exercise utmost caution.\"]\n\nOnce you grasp the principle and comprehend the *Song of Illuminating Nature*, do not regard it as something easily attained.",
      "start_char": 22463,
      "end_char": 22657,
      "start_sentence": 1199,
      "end_sentence": 1207,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.177590608596802,
      "metadata": {
        "source_file": "dao\\藏外\\丹道吕洞宾.txt",
        "category": "藏外"
      }
    }
  ]
}