{
  "source_id": "九天三茅司命仙灯仪",
  "source_file": "chunked_daozang\\九天三茅司命仙灯仪.json",
  "total_chunks": 2,
  "total_original_chars": 1781,
  "total_translated_chars": 12852,
  "total_translation_time": 63.068718671798706,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\九天三茅司命仙灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Ritual of the Nine Heavens’ Three Mao Celestial Lanterns for the Controller of Destiny**\n\n**Scripture Title:** *The Ritual of the Nine Heavens’ Three Mao Celestial Lanterns for the Controller of Destiny*. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Ritual of the Nine Heavens’ Three Mao Celestial Lanterns for the Controller of Destiny**\n\nThe ritual proceeds according to form.\n\nWe humbly acknowledge that when the Supreme Ultimate divided its form, it towered resplendent upon the land of Huayang. The perfected immortals revealed their traces, their numinous glory illuminating the famed mountains of Juqu. The golden altar is secluded, yet far-reaching in its communion with the jade grottoes. Layered peaks rise in undulating ranks, their mist-laden verdure shimmering; encircling ridges cradle the sun’s radiance, scattering crimson hues. Rare grasses offer their fragrance, and sacred fungi herald auspicious omens. Tigers roar and dragons chant, exhaling winds and clouds; cranes soar above cinnabar terraces as the immortal chariots return. Here dwells the Perfected Lord, who truly governs destiny, rectifying the merits and transgressions of immortals and mortals, wielding the scales of life and death. Not the slightest detail escapes him, nor the most minute fraction eludes his judgment. He governs the Red City, his register inscribed with the Nine Bestowals; he assists the Azure Peak, his office subordinate to the Three Mao Peaks. His sagely virtue and benevolence shine forth, as he oversees the affairs of Heaven, Earth, and Water. From ancient times to the present, all equally bask in his beneficent grace; near and far alike are bathed in his waves of mercy. In the twelfth month and the third month of spring, celestial lanterns blaze with brilliance; beneath the vast heavens, devotees offer incense with reverent devotion. All who revere him receive his protection and blessing.\n\nToday, in praise of the lanterns, this disciple [Name] has long cherished the true wind and for ages sheltered beneath the Dao’s shade. Gazing in awe at the Three Mao Peaks, he has ever held a heart of reverence; pouring forth his sincerity, he looks upward to repay the grace of life and nurture. On this auspicious day, he begins a pure fast, respectfully arranges the sacred banners, and unfolds the wondrous rites. Jade tablets and sacred scriptures are proclaimed by the feathered transcendents; precious staves and golden standards descend from the celestial thoroughfares. With utmost devotion, he kindles the immortal lanterns before the numinous image of the Nine Heavens’ Three Mao Controller of Destiny Perfected Lord. Their light continues the Three Perfected, their radiance equals the Two Effulgences. The Dao’s purple yang qi harmonizes with the vital harmony of the Crimson Palace.\n\nWe humbly pray that auspicious blossoms may unfurl, inaugurating felicitous omens this day; that the fruits of the Dao may be perfected, and blessings of fortune and longevity be received in this life. May our modest sincerity be met with boundless favor. Bowing our heads in reverence, we offer praise with utmost devotion.\n\nWe, the assembled, with single-minded devotion, take refuge in the Supreme Mystery’s Wondrous Dao, the Void and Sagely Protector, the True and Responsive Perfected Lord, and all the divine immortals and numinous officials.\n\nWe humbly acknowledge that from youth he cultivated exceptional conduct, leaving his father to cultivate the Dao upon the Northern Peak. In a dream, the Perfected descended, and he sought a master to inquire into the Dao in the Western City. He obtained the divine tiger’s chariot and personally attended the soaring wild goose’s sandals. Entrusted with secret talismans and divine registers, he received the oral transmission of alchemical formulas and immortal recipes. Thus, he could summon wind and thunder, command dragons and tigers. His divine radiance reached below, and auspicious mists abided within. By day, he drove forth the ten thousand spirits, compelling ghosts and gods to submit; by night, he roamed the eight directions, soaring through the celestial rivers. His position abides in the Nine Heavens, his office governs the Five Peaks. For forty-two years, his sagely rule oversaw the grand enterprise; with a hundred thousand layers of Dao qi, he sheltered all beings. All who express their heartfelt sincerity are surely bathed in his mysterious grace.\n\nToday, in praise of the lanterns, this disciple [Name], respectfully following the immortal statutes and unfolding the wondrous rites, solemnly arrays the image adorned in feathered and embroidered cloud robes, prepares the ritual of incense, flowers, lanterns, and candles, and with single-minded devotion takes refuge in the Supreme Mystery’s Wondrous Dao, the Void and Sagely Protector, the True and Responsive Perfected Lord, Controller of Destiny of the Eastern Peak.\n\nWe humbly pray that the wondrous Dao may be fully attained, the Void and Sagely One may manifest his presence, the four seasons may harmonize like jade candles, and the nine autumns may rejoice in golden abundance. May the nation flourish with loyal and good ministers, and households abound in filial piety and fraternal duty. May scholars, commoners, artisans, and merchants each attain their heart’s desires; may the noble and base, the worthy and foolish, all enjoy the pleasures of nurturing life according to their lot.\n\nBowing our heads in reverence, we offer praise with utmost devotion.\n\n**Homage to the Void and Sagely Protector Perfected Lord**\n\nVoid and transcendent, remote and luminous, from youth he was devoted to wondrous words. With hair unbound, he wandered the northern peaks, his heart stilled in forests and marshes, his spirit concentrated in seeking immortality. He ascended perilous heights and traversed valleys, arduously seeking the gates of masters. Casting aside his form, he leapt over peaks, offering himself at a myriad fords. When his elixir was complete, he roamed freely, following his natural inclinations. He then sought a radiant master, who bestowed upon him the sacred scriptures. He cut his hair and knelt in prayer, severed his hand and offered his body. Girded with a rope, he rejoiced in himself, unashamed of hunger and cold. His path was only the Dao, his preservation only the true. His sincerity moved the Supreme Emperor, and he was deeply moved by the Supreme Mystery. Today, he respectfully receives his mandate, his position as the Supreme Primordial.\n\nWe, the assembled, with single-minded devotion, take refuge in the Perfected Lord of the Right Prohibition of the Registry of Destinies, the Supreme Dao of Serene Virtue and Wondrous Response, and all the divine immortals and numinous officials.\n\nWe humbly acknowledge that he was endowed with a nature of filial piety and integrity, his honor recorded among the eminent scholars of the Gentlemen’s Bureau. His heart held benevolence and forbearance, and he refined the mysterious merits of the Supreme Dao. He received his mandate first, his office sealed as the Registry of Destinies. He oversees the ascent and descent of earthly transcendents, examines the merits and transgressions of the human world. He governs the famed mountains of the Golden Altar and Juqu, presides over the palaces and terraces of the Grotto-Heavens. His martial majesty is stern and solemn, impartial in rewarding good and punishing evil. The Right Prohibition is pure and bright, meting out retribution in secret for transgressions in the open. If one’s devotion in taking refuge is profound, he will surely bestow abundant nurturance.\n\nToday, in praise of the lanterns, this disciple [Name], respectfully following the immortal statutes and reverently adhering to the wondrous rites, solemnly arrays the image adorned in moonlit cloud robes, prepares the ritual of incense, flowers, lanterns, and candles, and with single-minded devotion takes refuge in the Perfected Lord of the Right Prohibition of the Registry of Destinies, the Supreme Dao of Serene Virtue and Wondrous Response.\n\nWe humbly pray that the Supreme Dao may extend its vast compassion, the Perfected Immortals may witness our goodness, absolving past errors and granting auspicious signs in our daily lives. May the year’s affairs be abundant, bandits and soldiers vanish, the people delight in their occupations, and the nation and households enjoy peace.\n\nBowing our heads in reverence, we offer praise with utmost devotion.\n\n**Homage to the Perfected Lord of Serene Virtue and Wondrous Response**\n\nThe Supreme One issued a mandate, the Heavenly Perfected inscribed their words. The Ji and Wei clans branched into lineages, first forming the primordial descendants. The Mao family of Xianyang dwelled south of the palace gates. Named Jiwei, he received the mandate as a constant immortal. His position was as the Registry of Destinies, and he concurrently governed the earthly immortals. He was charged with protecting those who possessed the Dao, their lifespans and destinies intertwined. Wherever he attended with diligence and reverence, the laws of the four directions were complete. His palaces and terraces spanned the grotto-heavens, foothills, marshes, and river sources.\n\nIt is fitting to govern Danyang and the mountains of Juqu.\nMay you, my lord, exert yourself therein, that all movements and stillness be observed and heard.\n\nWe, your assembled ministers, with devoted hearts offer our lives in homage:\n**Perfected Lord of Subtle Wisdom, Serene Virtue, and Wondrous Response—Three Palaces’ Guardian of Life,**\nand all divine immortals and spirit-officials.\n\nOf old, your noble conduct and deeds brought renown as Governor of Xihe under the Han;\nthrough accumulated merit you attained the Dao, presiding over the immortal mountains of Liangchang in the northern grotto.\nYou hold the authority of the Three Offices to safeguard life, and the statutes to restrain the hundred demons and examine spirits.\nYour name stands out for brilliance, guiding young novices and later disciples;\nyour excellence encompasses purity, instructing the female officials of the Wondrous Numinous Host.\nYou oversee Mount Tai, where in the numinous grottoes the Five Sacred Fungi flourish;\nyou govern the rivers and seas, whence the water sources nourish the hundred grains.\nEvery prayer is answered, no wish remains unfulfilled.\n\nOn this occasion of offering the Lamp of Praise, your disciple [Name] reverently follows the immortal statutes,\ndevoutly adhering to the wondrous model:\narraying the image of crane-feather robes and cloud-crowns,\nand the rites of streams, springs, and aquatic grasses.\nWith devoted heart we offer our lives in homage:\n**Three Palaces’ Guardian of Life, Perfected Lord of Subtle Wisdom, Serene Virtue, and Wondrous Response.**\n\nWe pray that our sincere hearts shine forth and move you, that your serene virtue secretly responds.\nInscribe our names in the immortal registry of the Three Offices’ Guardian of Life,\nand erase the records of enmity from the six grottoes.\nMay rain and sunshine follow their proper order, and malevolent spirits vanish without trace.\nMay sacred fungi and auspicious grasses manifest blessings,\nand wheat, barley, and fine grain yield double harvests.\nLet no pestilence afflict creatures, and let the people raise voices of joy.\n\nWe bow our heads in homage, offering praise with utmost devotion.\n**Perfected Lord of Serene Virtue and Wondrous Response**\n\nYou, my lord, were endowed with innate gifts,\nyour deeds encompassing purity from the outset.\nThough late in returning to the true path, your thoughts penetrated to utmost sincerity.\nYou vanquished the hordes of the Six Heavens, your brilliance marking your name.\nBending to serve the Three Offices, you established your title as Guardian of Life.\nYou oversee Mount Tai, recording the dead and the living.\nYour position is that of an Earth Immortal, the finest of the Nine Palaces.\nYou exhort and teach young novices, guiding them to Daoist attainment;\nyou instruct the female officials, imparting the myriad wondrous numina.\nYou govern the expulsion of the hundred demons, and the statutes to restrain and examine spirits.\nYou inspect the water sources, whence the rivers and seas flow abundantly.\nYou apportion the golden grains, and store the registers of jade nectar.\nYou oversee the planting of dragon fungi and grotto grasses that glow at night.\nIn the northern grotto of Liangchang, you eternally guard the Yin Palace.\n\nAs the libation officials offer their lives in homage, may we attain longevity.\nRecitation of scriptures, proclamation of petitions, transformation of merit, and redirection of blessings.\n**The Rite of the Lamp of the Three Mao Lords of Life, Under the Nine Heavens, is now complete.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "九天三茅司命仙灯仪 经名：九天三茅司命仙灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 九天三茅司命仙灯仪 法事如式 伏以太极分形，秀峙华阳之地； 真仙显迹，灵彰句曲之名山。 閟金坛，远通玉洞。 迭蟑参差而烟凝含翠，重冈枕带而日映分红。 异草荐馨，灵芝表瑞。 虎啸龙吟而风云吐纳，鹤翔丹现而仙驾回还。 爰有真君，实为司命，紏仙凡之功过，掌生死之权衡。 纤细不遗，毫分无失。 治赤城而册编九锡，佐青岳而职隶三峰。 显着圣德仁，总司天地水。 今古均沾於惠泽，迩遐咸沐於恩波。 腊二春三，灿天灯而炯炯； 普天之下，投香信以拳拳。 凡有归崇，悉蒙孚佑。 以今赞灯，弟子某人宿慕真风，久依道荫。 耸瞻三秀，常怀敬奉之心； 倾竭一忱，仰答生成之惠。 维时吉日，辄启清斋，祗肃真斿，敷陈妙范。 琅函玉笈，凭羽士以宣扬； 宝节金幢，想霄衢而下迈。 虔诚点照九天三茅司命真君瑞像仙灯。 明续三真，光齐二景。 道紫阳之妙炁，符绛府之冲和。 伏愿吐露瑞花，肇嘉祥於此日； 圆成道果，膺福寿於今生。 副以微诚，永承巨贶。 稽首皈依，虔诚赞咏。 臣众等志心归命，太玄妙道冲虚圣佑真应真君，一切神仙诸灵官。 伏以幼禀异操，舍父修真於北岳； 梦符真降，求师访道於西城。 获参神虎之軿，躬侍飞凫之舄。 管领秘章神箓，亲传丹诀仙方，故能啸命风雷，御役龙虎。 神光下逮，瑞霭中存。 朝驱万灵，使鬼神而畏伏； 暮游八极，腾霄汉以飞翔。 位宅九天，职司五岳。 圣治四十二载，眷佑丕图； 道炁百千万重，覆护群品。 凡伸情悃，必沐玄恩。 以今赞灯，弟子某人祗按仙科，敷陈妙范，俨羽绣霞衣之像，备香花灯烛之仪，志心归命，东岳上卿司命太玄妙道冲虚圣佑真应真君。 伏愿妙道克臻，冲虚昭格，四序均调於玉烛，九秋庆遂於金穰。 国富忠良，家多孝悌。 士民工贾，各膺遂意之欢； 贵贱贤愚，随分养生之乐。 稽首皈依，虔诚赞咏。 信礼冲虚圣佑真君 虚挺远朗，幽耽妙言。 爰自童蒙，散发北巅。 静心林泽，精思求仙。 登峻履谷，艰寻师门。 掷形绝岳，投驱万津。 丹成率往，肆其天然。 遂造明匠，乃授灵篇。 剪发祝跪，残手截身。 带索自乐，不耻饥寒。 所适惟道，所保以真。 情昭上帝，感激泰玄。 今敬受命，位为太元。 臣众等志心归命，定录右禁至道冲静德佑妙应真君，一切神仙诸灵官。 伏以秉性孝廉，荣注郎官之膴士； 持心仁恕，精修上道之玄功。 受命当先，职封定录。 统地真之升降，察人世之功愆。 治金坛句曲之名山，任宫馆洞台之主宰。 武威严肃，无私而福善祸淫； 右禁清明，有犯而阳行阴报。 傥或归依之笃，必能抚育之隆。 以今赞灯，弟子某人祗按仙科，虔遵妙范，俨月被霞衣之像，备香花灯烛之仪，志心归命，定录右禁至道冲靖德佑妙应真君。 伏愿至道宏慈，真仙鉴善，赦故作悞违之咎，赐起居视履之祥。 岁事丰登，寇兵消弥，人民乐业，家国咸宁。 稽首皈依，虔诚赞咏。 信礼冲靖德佑真君 太上有命，天真书言。 姬胃分宗，初成玄孙。 咸阳茅姓，厥宅南阍。 字曰季伟，受命常仙。 位为定录，兼统地仙。 使保有道，年命相閛。 勤恭所莅，四极法全。 宫馆洞台，麓泽川源。",
      "translated_text": "**The Ritual of the Nine Heavens’ Three Mao Celestial Lanterns for the Controller of Destiny**\n\n**Scripture Title:** *The Ritual of the Nine Heavens’ Three Mao Celestial Lanterns for the Controller of Destiny*. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Ritual of the Nine Heavens’ Three Mao Celestial Lanterns for the Controller of Destiny**\n\nThe ritual proceeds according to form.\n\nWe humbly acknowledge that when the Supreme Ultimate divided its form, it towered resplendent upon the land of Huayang. The perfected immortals revealed their traces, their numinous glory illuminating the famed mountains of Juqu. The golden altar is secluded, yet far-reaching in its communion with the jade grottoes. Layered peaks rise in undulating ranks, their mist-laden verdure shimmering; encircling ridges cradle the sun’s radiance, scattering crimson hues. Rare grasses offer their fragrance, and sacred fungi herald auspicious omens. Tigers roar and dragons chant, exhaling winds and clouds; cranes soar above cinnabar terraces as the immortal chariots return. Here dwells the Perfected Lord, who truly governs destiny, rectifying the merits and transgressions of immortals and mortals, wielding the scales of life and death. Not the slightest detail escapes him, nor the most minute fraction eludes his judgment. He governs the Red City, his register inscribed with the Nine Bestowals; he assists the Azure Peak, his office subordinate to the Three Mao Peaks. His sagely virtue and benevolence shine forth, as he oversees the affairs of Heaven, Earth, and Water. From ancient times to the present, all equally bask in his beneficent grace; near and far alike are bathed in his waves of mercy. In the twelfth month and the third month of spring, celestial lanterns blaze with brilliance; beneath the vast heavens, devotees offer incense with reverent devotion. All who revere him receive his protection and blessing.\n\nToday, in praise of the lanterns, this disciple [Name] has long cherished the true wind and for ages sheltered beneath the Dao’s shade. Gazing in awe at the Three Mao Peaks, he has ever held a heart of reverence; pouring forth his sincerity, he looks upward to repay the grace of life and nurture. On this auspicious day, he begins a pure fast, respectfully arranges the sacred banners, and unfolds the wondrous rites. Jade tablets and sacred scriptures are proclaimed by the feathered transcendents; precious staves and golden standards descend from the celestial thoroughfares. With utmost devotion, he kindles the immortal lanterns before the numinous image of the Nine Heavens’ Three Mao Controller of Destiny Perfected Lord. Their light continues the Three Perfected, their radiance equals the Two Effulgences. The Dao’s purple yang qi harmonizes with the vital harmony of the Crimson Palace.\n\nWe humbly pray that auspicious blossoms may unfurl, inaugurating felicitous omens this day; that the fruits of the Dao may be perfected, and blessings of fortune and longevity be received in this life. May our modest sincerity be met with boundless favor. Bowing our heads in reverence, we offer praise with utmost devotion.\n\nWe, the assembled, with single-minded devotion, take refuge in the Supreme Mystery’s Wondrous Dao, the Void and Sagely Protector, the True and Responsive Perfected Lord, and all the divine immortals and numinous officials.\n\nWe humbly acknowledge that from youth he cultivated exceptional conduct, leaving his father to cultivate the Dao upon the Northern Peak. In a dream, the Perfected descended, and he sought a master to inquire into the Dao in the Western City. He obtained the divine tiger’s chariot and personally attended the soaring wild goose’s sandals. Entrusted with secret talismans and divine registers, he received the oral transmission of alchemical formulas and immortal recipes. Thus, he could summon wind and thunder, command dragons and tigers. His divine radiance reached below, and auspicious mists abided within. By day, he drove forth the ten thousand spirits, compelling ghosts and gods to submit; by night, he roamed the eight directions, soaring through the celestial rivers. His position abides in the Nine Heavens, his office governs the Five Peaks. For forty-two years, his sagely rule oversaw the grand enterprise; with a hundred thousand layers of Dao qi, he sheltered all beings. All who express their heartfelt sincerity are surely bathed in his mysterious grace.\n\nToday, in praise of the lanterns, this disciple [Name], respectfully following the immortal statutes and unfolding the wondrous rites, solemnly arrays the image adorned in feathered and embroidered cloud robes, prepares the ritual of incense, flowers, lanterns, and candles, and with single-minded devotion takes refuge in the Supreme Mystery’s Wondrous Dao, the Void and Sagely Protector, the True and Responsive Perfected Lord, Controller of Destiny of the Eastern Peak.\n\nWe humbly pray that the wondrous Dao may be fully attained, the Void and Sagely One may manifest his presence, the four seasons may harmonize like jade candles, and the nine autumns may rejoice in golden abundance. May the nation flourish with loyal and good ministers, and households abound in filial piety and fraternal duty. May scholars, commoners, artisans, and merchants each attain their heart’s desires; may the noble and base, the worthy and foolish, all enjoy the pleasures of nurturing life according to their lot.\n\nBowing our heads in reverence, we offer praise with utmost devotion.\n\n**Homage to the Void and Sagely Protector Perfected Lord**\n\nVoid and transcendent, remote and luminous, from youth he was devoted to wondrous words. With hair unbound, he wandered the northern peaks, his heart stilled in forests and marshes, his spirit concentrated in seeking immortality. He ascended perilous heights and traversed valleys, arduously seeking the gates of masters. Casting aside his form, he leapt over peaks, offering himself at a myriad fords. When his elixir was complete, he roamed freely, following his natural inclinations. He then sought a radiant master, who bestowed upon him the sacred scriptures. He cut his hair and knelt in prayer, severed his hand and offered his body. Girded with a rope, he rejoiced in himself, unashamed of hunger and cold. His path was only the Dao, his preservation only the true. His sincerity moved the Supreme Emperor, and he was deeply moved by the Supreme Mystery. Today, he respectfully receives his mandate, his position as the Supreme Primordial.\n\nWe, the assembled, with single-minded devotion, take refuge in the Perfected Lord of the Right Prohibition of the Registry of Destinies, the Supreme Dao of Serene Virtue and Wondrous Response, and all the divine immortals and numinous officials.\n\nWe humbly acknowledge that he was endowed with a nature of filial piety and integrity, his honor recorded among the eminent scholars of the Gentlemen’s Bureau. His heart held benevolence and forbearance, and he refined the mysterious merits of the Supreme Dao. He received his mandate first, his office sealed as the Registry of Destinies. He oversees the ascent and descent of earthly transcendents, examines the merits and transgressions of the human world. He governs the famed mountains of the Golden Altar and Juqu, presides over the palaces and terraces of the Grotto-Heavens. His martial majesty is stern and solemn, impartial in rewarding good and punishing evil. The Right Prohibition is pure and bright, meting out retribution in secret for transgressions in the open. If one’s devotion in taking refuge is profound, he will surely bestow abundant nurturance.\n\nToday, in praise of the lanterns, this disciple [Name], respectfully following the immortal statutes and reverently adhering to the wondrous rites, solemnly arrays the image adorned in moonlit cloud robes, prepares the ritual of incense, flowers, lanterns, and candles, and with single-minded devotion takes refuge in the Perfected Lord of the Right Prohibition of the Registry of Destinies, the Supreme Dao of Serene Virtue and Wondrous Response.\n\nWe humbly pray that the Supreme Dao may extend its vast compassion, the Perfected Immortals may witness our goodness, absolving past errors and granting auspicious signs in our daily lives. May the year’s affairs be abundant, bandits and soldiers vanish, the people delight in their occupations, and the nation and households enjoy peace.\n\nBowing our heads in reverence, we offer praise with utmost devotion.\n\n**Homage to the Perfected Lord of Serene Virtue and Wondrous Response**\n\nThe Supreme One issued a mandate, the Heavenly Perfected inscribed their words. The Ji and Wei clans branched into lineages, first forming the primordial descendants. The Mao family of Xianyang dwelled south of the palace gates. Named Jiwei, he received the mandate as a constant immortal. His position was as the Registry of Destinies, and he concurrently governed the earthly immortals. He was charged with protecting those who possessed the Dao, their lifespans and destinies intertwined. Wherever he attended with diligence and reverence, the laws of the four directions were complete. His palaces and terraces spanned the grotto-heavens, foothills, marshes, and river sources.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1242,
      "start_sentence": 0,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.91085863113403,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\九天三茅司命仙灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "宜治丹阳，句曲之山。 君其勉之，动静察闻。 臣众等志心归命，三宫保命微妙冲惠仁佑神应真君，一切神仙诸灵官。 伏以节行显名，任汉室西河之太守； 积功成道，治良常北洞之仙山。 领三官保命之权，法百鬼校精之典。 标名才颖，诱童蒙后学之徒； 挺秀该清，训女官妙灵之众。 总括岱宗，灵洞种植五芝； 职司江海，水源滋生百谷。 有求即应，无愿不从。 以今赞灯，弟子某人祇按仙科，虔依妙范，俨鹤氅云冠之像，列溪泉涧藻之仪，志心归命，三官保命微妙冲惠仁佑神应真君。 伏愿诚心昭格，冲惠潜孚，书三官保命之仙名，削六洞仇雠之罪目。 雨旸顺序，妖怪灭形。 灵芝瑞草以呈祥，麰麦嘉禾而倍稔。 物无疵疠，民有欢声。 稽首归依，虔诚赞咏。 信礼冲惠仁佑真君 惟君禀赋，挺业该清。 须晚返正，思微彻诚。 斩馘六天，才颖标名。 屈司三官，保命建名。 总括岱宗，领死记生。 位为地仙，九宫之英。 劝教童蒙，开道方成。 训诲女官，授诸妙灵。 治祛百鬼，典祟检精。 关察水源，江海流倾。 分掌金谷，藏录玉浆。 监植龙芝，洞草夜光。 良常北洞，永镇阴宫。 醮官归命，愿得长生。 讽经　宣疏　化财　回向 九天三茅司命仙灯仪竟",
      "translated_text": "It is fitting to govern Danyang and the mountains of Juqu.\nMay you, my lord, exert yourself therein, that all movements and stillness be observed and heard.\n\nWe, your assembled ministers, with devoted hearts offer our lives in homage:\n**Perfected Lord of Subtle Wisdom, Serene Virtue, and Wondrous Response—Three Palaces’ Guardian of Life,**\nand all divine immortals and spirit-officials.\n\nOf old, your noble conduct and deeds brought renown as Governor of Xihe under the Han;\nthrough accumulated merit you attained the Dao, presiding over the immortal mountains of Liangchang in the northern grotto.\nYou hold the authority of the Three Offices to safeguard life, and the statutes to restrain the hundred demons and examine spirits.\nYour name stands out for brilliance, guiding young novices and later disciples;\nyour excellence encompasses purity, instructing the female officials of the Wondrous Numinous Host.\nYou oversee Mount Tai, where in the numinous grottoes the Five Sacred Fungi flourish;\nyou govern the rivers and seas, whence the water sources nourish the hundred grains.\nEvery prayer is answered, no wish remains unfulfilled.\n\nOn this occasion of offering the Lamp of Praise, your disciple [Name] reverently follows the immortal statutes,\ndevoutly adhering to the wondrous model:\narraying the image of crane-feather robes and cloud-crowns,\nand the rites of streams, springs, and aquatic grasses.\nWith devoted heart we offer our lives in homage:\n**Three Palaces’ Guardian of Life, Perfected Lord of Subtle Wisdom, Serene Virtue, and Wondrous Response.**\n\nWe pray that our sincere hearts shine forth and move you, that your serene virtue secretly responds.\nInscribe our names in the immortal registry of the Three Offices’ Guardian of Life,\nand erase the records of enmity from the six grottoes.\nMay rain and sunshine follow their proper order, and malevolent spirits vanish without trace.\nMay sacred fungi and auspicious grasses manifest blessings,\nand wheat, barley, and fine grain yield double harvests.\nLet no pestilence afflict creatures, and let the people raise voices of joy.\n\nWe bow our heads in homage, offering praise with utmost devotion.\n**Perfected Lord of Serene Virtue and Wondrous Response**\n\nYou, my lord, were endowed with innate gifts,\nyour deeds encompassing purity from the outset.\nThough late in returning to the true path, your thoughts penetrated to utmost sincerity.\nYou vanquished the hordes of the Six Heavens, your brilliance marking your name.\nBending to serve the Three Offices, you established your title as Guardian of Life.\nYou oversee Mount Tai, recording the dead and the living.\nYour position is that of an Earth Immortal, the finest of the Nine Palaces.\nYou exhort and teach young novices, guiding them to Daoist attainment;\nyou instruct the female officials, imparting the myriad wondrous numina.\nYou govern the expulsion of the hundred demons, and the statutes to restrain and examine spirits.\nYou inspect the water sources, whence the rivers and seas flow abundantly.\nYou apportion the golden grains, and store the registers of jade nectar.\nYou oversee the planting of dragon fungi and grotto grasses that glow at night.\nIn the northern grotto of Liangchang, you eternally guard the Yin Palace.\n\nAs the libation officials offer their lives in homage, may we attain longevity.\nRecitation of scriptures, proclamation of petitions, transformation of merit, and redirection of blessings.\n**The Rite of the Lamp of the Three Mao Lords of Life, Under the Nine Heavens, is now complete.**",
      "overlap_context": " of Xianyang dwelled south of the palace gates. Named Jiwei, he received the mandate as a constant immortal. His position was as the Registry of Destinies, and he concurrently governed the earthly immortals. He was charged with protecting those who possessed the Dao, their lifespans and destinies intertwined. Wherever he attended with diligence and reverence, the laws of the four directions were complete. His palaces and terraces spanned the grotto-heavens, foothills, marshes, and river sources.",
      "start_char": 1242,
      "end_char": 1718,
      "start_sentence": 86,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.157860040664673,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\九天三茅司命仙灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}