{
  "source_id": "九天应元雷声普化天尊玉枢宝经集注",
  "source_file": "chunked_daozang\\九天应元雷声普化天尊玉枢宝经集注.json",
  "total_chunks": 18,
  "total_original_chars": 19157,
  "total_translated_chars": 112431,
  "total_translation_time": 548.7494904994965,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Jade Pivot Precious Scripture of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy: Collected Commentaries**\n\n**Title:** *The Jade Pivot Precious Scripture of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy: Collected Commentaries*\n*Commentary by:* Haiqiong the White Perfected, *Exegesis by:* Patriarch Heavenly Master Zhang Zhenjun, *Exposition by:* Five-Thunder Envoy Heavenly Lord Zhang, *Eulogy by:* Pure Yang Master, Protector Emperor Jun\n*Two fascicles.*\n*Source text:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Jade Instructions* Category.\n\n---\n\n### *The Jade Pivot Precious Scripture of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy: Collected Commentaries, Fascicle One*\n\n**Commentary states:**\nNine is the yang number, the Dao of Heaven. It governs the *Zhen* Palace, hence the saying of the \"Nine Voids\" in the southeast—this is the realm where the Thunder Master enters and departs. Heaven is the supreme, sagely, boundless, and non-acting *qi*. \"Responsive\" means all things receive Heaven’s mandate to be born. \"Primordial\" is the greatest, the chief of all virtues, the first of the four seasons, and the origin of the Five Agents. Thunder is Heaven’s decree, wielding the power of generation and destruction. Its movements are unfathomable, and the myriad spirits obey its commands. \"Sound\" is life—all things sprout upon hearing the thunder’s roar. It is also said that Heaven does not speak but uses thunder as its voice. \"Universal\" encompasses the four directions, the eight wilds, the formless and the formed. \"Transformation\" is the operation of Heaven’s Dao through yin and yang. It is the shift from non-being to being, from being to non-being, the birth and decay of the myriad things. Laozi said: \"I practice non-action, and the people transform of themselves.\" He also said: \"This is the transformation through virtue.\" \"Heavenly Worthy\" is the most exalted and noble title. \"Scripture\" is praise, the propagation of teachings, the elucidation of mysteries. \"Jade\" is the essence of Heaven and Earth, the sun and moon, the congealed splendor of yin-yang and water-fire. It is moistening and warm, precious and noble, imperishable for ten thousand generations. \"Pivot\" is the mechanism, the axle—the origin of life and death. \"Precious\" means revered. \"Scripture\" is the path, the essential road to cultivating perfection and entering the Dao.\n\n**Exegesis states:**\nThis scripture is named for the *Jade Pivot* because it embodies the ebb and flow of Heaven and Earth, the movement and stillness of yin and yang. The primordial number is the *Qian* trigram’s \"use of nine,\" and the Universal Transformation Heavenly Worthy presides above, supreme among the Three Realms and luminous across the Ten Directions.\n\n**Exposition states:**\nThe Heavenly Worthy’s vows are vast, transforming all living beings. His virtue is immeasurable, his mechanism unfathomable. Thus, he employs thunder’s sound for transformation and the jade pivot as the balance. Good and evil, killing and generation—all are governed by the True King of the Nine *Qi*. Therefore, the myriad spirits of the Three Realms and the deities of the Ten Directions all praise the Heavenly Worthy’s primordial transformation.\n\n**Eulogy states:**\nThe primordial *qi* suffuses the Great Void,\nThe Nine Heavens are truly the Nine Heavens’ abode.\nCommanding thunder and dispatching rain, golden talismans take flight,\nReviving creatures and nurturing life, the jade pivot is complete.\nAll sentient beings in the Three Realms attain the Dao,\nNo path in the Ten Directions is impassable.\nGreat is the Universal Transformation, radiant in primordial beginning—\nSun and moon shine equally, this is no falsehood.\n\n---\n\n**At that time, the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy...**\n\n**Commentary states:**\nThe Nine Heavens govern the thirty-six heavens collectively. Originating from the nine *qi* of the southeast, they emerge from the Thunder Gate, thus presiding over the thirty-six thunder commands. They receive the seals of all bureaus, courts, and halls, generating good and destroying evil without regard for human sentiment. The name \"Nine Heavens\" signifies their yang vigor, which does not perish. \"Responsive Primordial\" reveres the primordial beginning of the ancestral kalpa, when the One *Qi* divided into the true forms, and the Jade Clarity True King embodied the responsive primordial essence. Thunder arises from the conjoining of yin and yang *qi*. With the advent of thunder and lightning, the Nine Heavens Thunder Ancestor divided their jurisdiction. These were further subdivided into five attributes, employed by the Divine Empyrean True King to govern the Three Realms. The True King resides in the Divine Empyrean Jade Palace, whose Dao lies in *Xun*. *Xun* is the earth within Heaven, the southeast being the realm of the nine yang *qi*. Congealing into luminous clarity, the Primordial Father and Ancestor transformed into the Divine Empyrean Jade Clarity True King. The Jade Palace lies within the azure empyrean’s Brahma *qi*, two thousand three hundred *li* from the Thunder City. The Thunder City stands eighty-one *zhang* high, with the Jade Pivot Five-Thunder Envoy Court to its left and the Jade Palace Five-Thunder Envoy Court to its right. Heaven has four directions and four corners, divided into the Nine Empyreans. Only this one empyrean dwells within the Brahma *qi*. That which is in the heart is called *shen*, hence the name *Divine Empyrean*—the True King’s seat of governance, the Heavenly Worthy’s capital. Ministers, teachers, envoys, and officials are arrayed in offices, governing Heaven’s calamities and blessings, holding the balance of things, overseeing life and death, inspecting and sealing, managing the keys of generation. From the Heavenly Sovereign above to the Earthly Emperor below, none can issue decrees without thunder. From life and death to withering and flourishing, none can administer governance without thunder. Thunder’s governance and commands are subordinate to the Three Clarities’ Sagely Thunder Ancestor, the Ten Poles’ Supreme Thunder Origin, the August Jade Emperor of the Vast Heaven who issues thunder’s decrees, the Queen of Earth who regulates thunder, and the Northern Culmen Purple Tenuity Great Emperor who wields the Five Thunders.\n\n**The Five Thunders are:**\nHeaven Thunder, Earth Thunder, Water Thunder, Dragon Thunder, and Earth Rites Thunder.\n\n**The Ten Thunders are:**\n1. Jade Pivot Thunder\n2. Divine Empyrean Thunder\n3. Great Cavern Thunder\n4. Immortal Capital Thunder\n5. Northern Culmen Thunder\n6. Grand Unity Thunder\n7. Purple Palace Thunder\n8. Jade Dawn Thunder\n9. Great Empyrean Thunder\n10. Supreme Ultimate Thunder\n\n**The Thirty-Six Thunders are:**\n1. Jade Pivot Thunder\n2. Jade Palace Thunder\n3. Jade Pillar Thunder\n4. Upper Clarity Great Cavern Thunder\n5. Fire Wheel Thunder\n6. Dipper-Infusing Thunder\n7. Wind-Fire Thunder\n8. Flying Swift Thunder\n9. Northern Culmen Thunder\n10. Purple Tenuity Pivot Thunder\n11. Divine Empyrean Thunder\n12. Immortal Capital Thunder\n13. Grand Unity Heaven-Shaking Thunder\n14. Purple Palace Thunder\n15. Iron Armor Thunder\n16. Shaoyang Thunder\n17. Sudden Fire Thunder\n18. Earth Rites Barbarian Thunder\n19. Earth Spirit Roaring Thunder\n20. Three Realms Thunder\n21. Grave-Severing Thunder\n22. Great Might Thunder\n23. Six Waves Thunder\n24. Green Grass Thunder\n25. Eight Trigrams Thunder\n26. Primordial Hawk-Hound Thunder\n27. Whistling Life Wind-Thunder\n28. Fire Cloud Thunder\n29. Yu’s Step Great Unifying Thunder\n30. Supreme Ultimate Thunder\n31. Sword-Fire Thunder\n\n32. Inner Mirror Thunder\n33. Outer Overflow Thunder\n34. Divine Mansion Celestial Pivot Thunder\n35. Great Brahmā Dipper Pivot Thunder\n36. Jade Dawn Thunder\n\nThere are thirty-six thunder spirits of old, once arrayed before the Most High. The thunder methods comprise seventy-two ranks, for the heavens and earth reward good and punish evil, and all things arise through thunder. Though it be the clash of yin and yang, it is also the stirring of divine and human agency—when thunder roars, rain descends.\n\nSound is the benevolent voice of heaven and earth. At the spring equinox, five days later, thunder’s voice arises, audible for a hundred leagues, shaking the nine heavens and stirring the nine earths, startling the four seas and churning the four abysses. The Most High said: “Were I not to emit the sound of yin and yang, my great tone would have no means of summoning. Thus I drum forth with thunder and lightning to call forth qi with sound.”\n\nBefore the Thunder Thearch stand thirty-six thunder drums. Whenever thunder is to be deployed, the Thunder Thearch personally strikes the drum of his own division once, and immediately the thunder lords and thunder spirits unleash their thunderous voices.\n\nThe Vast Transformation Heavenly Worthy was born of the nine sons of the Primordial Heavenly Worthy of Floating Radiance. The Jade Clarity Perfected King transformed and gave rise to the Thunder Voice Vast Transformation Heavenly Worthy. Through kalpas of responsive manifestation, the Heavenly Worthy assumes titles in accord with the times. From the original qi of the Primordial Ancestral Kalpa, the qi divided and became perfected, giving rise to the Jade Clarity Perfected King, sovereign of the nine empyreans. For one month and four celestial markers, he oversees the myriad heavens, roaming the three realms and the nine provinces of the ten thousand lands, rewarding good and recording transgressions—such is the Vast Transformation, most great and most noble.\n\nIn principle: Though the nine heavens are said to be the number of qian, yang and firm, yet not yielding, they are in truth the birthplace of the nine qi. Therein, essence gathers and spirit congeals, forming the transformed body of our Jade Clarity Perfected King.\n\nResponsive Origin: The qi of heaven and earth, the yin and yang of the five phases, flow above and below—there is not a single thing that does not receive the mandate of heaven and obtain the qi of yin and yang by which it is born. Thus it is called Responsive Origin—what doubt could there be?\n\nGreat indeed is thunder! Therefore, the celestial sages and earthly perfected of the three realms and ten directions each have their offices, yet the Jade Clarity Perfected King of the nine heavens governs all their commands.\n\nSound is the function of qi; qi is the command of sound. It clarifies right and wrong, shakes the sprouting and raises the submerged—without the command of thunder, how could life arise?\n\nThe Vast Transformation Heavenly Worthy: Heaven is I, I am heaven. With vast and boundless vows, I transform my body throughout the ten directions. For all sentient beings who turn their hearts toward the Dao, I shall embody them in body—what else is this if not the Vast Transformation of the Heavenly Worthy?\n\nExplanation: At that time, the nine qi took form and coalesced into the nine heavens, above the thirty-six heavens, the ancestral qi of the ten directions and three realms. The reason for employing the number nine is that its qi fundamentally arises from the body of the Three Clarities, and its use of the name of the nine heavens is fitting.\n\nResponsive Origin: It is the principle of heaven as yang and earth as yin. Now, our Heavenly Worthy is born of yang and dwells in heaven, firm and unyielding. Thus all things born of earth without exception heed the command of the Heavenly Worthy, so that each thing attains its proper place. Worldly people do not understand this principle, yet their original essence all derives from the surplus qi of the Heavenly Worthy. The Heavenly Worthy desires that all people become Heavenly Worthies—why would he begrudge his qi and not respond to the wondrous Dao of their original essence?\n\nThunder is of a kind, giving rise to the myriad kinds and arousing the multitude of species. Who does not know that thunder is the clash of yin and yang qi, yet it has its overseers? Why does it sever evil, punish perversity, drive winds, and dispatch rain? The common folk, lacking understanding, how could they recognize the mechanism of life and death of the Primordial Beginning or the wondrous function of the Jade Clarity Perfected King?\n\nSound is command, it is hearing. Without sound, heaven’s thunder and lightning would not move; without sound, earth’s grasses and trees would not sprout; without sound, humans could not distinguish purity from turbidity. Thus sound is the root of the self, the primordial darkness of yin and yang.\n\nHeaven is impartial—sun and moon shed their light. Heaven has virtue—all beings are born. Therefore, our Heavenly Worthy acts on heaven’s behalf to enact the Dao, bestowing virtue upon the three realms, so that the pure become sages and the turbid become worthies. For all sentient and formed beings, he enables them to ascend to the immortal ranks and together complete the one qi.\n\nEulogy:\nNine heavens, nine heavens,\nMysterious, again mysterious.\nSuddenly behind me,\nIn an instant before me.\nRight: Nine Heavens.\n\nThough the two qi divide into yin and yang,\nThe Jade Clarity soars high, transforming the Perfected King.\nAbove heaven, below earth, they harmonize,\nSpreading teachings and dividing forms throughout the ten directions.\nRight: Responsive Origin.\n\nThe rectitude of the two qi,\nThe command of the five phases.\nSevering demons, punishing perversity,\nHeaven and humans respond in echo.\nRight: Thunder.\n\nBroadly proclaiming the Thearch’s virtue to arouse the multitude of beings,\nThe heroic spirits of the three realms incline their ears to listen.\nDo not say that old heaven is silent,\nFor you must know the command is in the thunder’s roar.\nRight: Sound.\n\nThe virtue of cherishing life cannot be measured,\nThe teachings spread through all heavens and the ten directions.\nHigh in Jade Clarity, governing the Thunder Bureau,\nThe myriad spirits in court robes pay homage to the Perfected King.\nRight: Vast Transformation.\n\nWithin the Heaven of Jade Clarity, together with the Heavenly Lords of the ten directions, they gather in the Palace of Jade Void and Ninefold Radiance, the Hall of Lush Mist and Expansive Net, the Chamber of Purple Ultimate and Hidden Depths. They peruse the azure-green jade tablets of the Profound Darkness, examine the books of the Luminous Dawn of the Subtle Cavern, whispering intimately of the profound mystery, with many attendant ministers standing respectfully by.\n\nThe Heavenly Worthy sits in tranquil repose, reciting the cavern scriptures. The Heavenly Lords of the ten directions chant the \"Pacing the Void.\" Jade maidens and immortal sisters scatter flowers in circling dance, then lead one another to wander and play in the Emerald Palace. The host of immortals guides the way, with pennants preceding and iron staves following, dragon banners and simurgh chariots soaring through the vast sky, all assembling at the Seven-Treasured Tiered Terrace of Jade Brahmā.\n\nAnnotation: At that time, the Heavenly Worthy roamed within the Heaven of Jade Clarity, feasting with the Heavenly Lords of the ten directions in the Jade Void Palace, the Purple Ultimate Chamber.\n\nAt that time, the Heavenly Worthy examined the caskets of the Profound Azure Jade, reviewing the records of the Cavernous Subtlety and Luminous Dawn. Those who leaned close in whispered conference were the Heavenly Lords of the ten directions, seated in ordered ranks, sage transmitting to sage, together listening to the subtle and mysterious, the profound and arcane words. At that moment, each Heavenly Lord had his many household ministers standing respectfully by, attending with reverence.\n\nThe Heavenly Worthy sat in serene majesty, reciting the cavern scriptures. The Heavenly Lords, deeply enlightened, rose from their seats one by one, chanting long hymns and pacing the void in praise of the Heavenly Worthy’s teachings. Jade maidens and immortal sisters scattered flowers in circling dance around the Heavenly Worthy’s seat, then entreated the Heavenly Worthy to proceed to the Seven-Treasured Tiered Terrace of the Emerald Palace, desiring that the Heavenly Worthy expound the wondrous Dao. The tiered terrace was the Dragon-Phoenix Seat, with seven levels, each adorned with precious treasures—hence its name, the Seven-Treasured Tiered Terrace.\n\nThe Heavenly Worthy mounted his divine carriage, with white cranes and lions leading the way in solemn procession. Azure dragons and white tigers, the Six Jia and Six Ding spirits, guarded his left and right. The Nine Heavens’ immortal maidens and the Twelve Stream Perfected intoned celestial music. The Heavenly Great Emperors, Divine Lords, Divine Kings, and Supreme Perfected of the Great Ultimate followed in phoenix-scripted chariots and dragon-drawn carriages, traversing the Emerald Palace. Immortal banners and ritual halberds, dragon standards and simurgh chariots soared through the vast sky, assembling at the jeweled terrace.\n\nAnnotation: At that time, roaming the Heaven of Jade Clarity and halting at the jeweled terrace, the Heavenly Worthy grandly expounded the mysterious texts and broadly proclaimed the essential teachings. All the immortals and humans to his left and right opened their hearts to receive his transformation, their merit and practice thereby exalted.\n\nExegesis: At that time, our Heavenly Worthy was within his own celestial abode, where halls and chambers of the Nine Radiance Palace stood arrayed. There, he perused the scriptures and reviewed the canons, desiring to instruct the Heavenly Perfected Lords of the ten directions in the great Dao. Thus, the Heavenly Perfected Lords, robed in virtue and submitting in reverence, knew not how to dance in joy. The Heavenly Worthy, greatly pleased, wished to journey to the outer palaces. The myriad immortals and transcendents, to his left and right, before and behind, with ritual halberds and ordered banners, escorted our Heavenly Worthy to halt his simurgh carriage at the Emerald Palace. The Emerald Palace was the traveling palace of the Heaven of Jade Clarity.\n\nThe Thunder Master, his heart heavy with unspoken petitions, found no means to present them. By good fortune, our Heavenly Worthy ascended the jeweled terrace, raising his golden, radiant ruyi scepter to survey all beings below.\n\nEulogy:\nThus grasping the mysterious, the one aperture of the mysterious opens,\nAnd the ten directions and three realms respond in due time.\nThe jade scriptures are perused with care to preserve the primordial qi,\nThe precious canons are proclaimed anew to nurture the original embryo.\nThe attendant maidens, leaning close, understand in their hearts,\nThe reverent ministers, standing in awe, compose their intent.\nSuddenly, the teachings are expounded, and celestial flowers dance,\nPhoenixes and simurghs soar gracefully above the Seven-Treasured Terrace.\n\nAt that moment, the Thunder Master, Elder Hao, stepped forth from the ranks of immortals, prostrated himself before the Heavenly Worthy, trembling in reverence, and knelt to address the Heavenly Worthy: “Greatly compassionate Heavenly Worthy, greatly sagely Heavenly Worthy, father of all beings, master of the myriad spirits—now, all the heavens enjoy this blessed audience. We have just witnessed the Heavenly Worthy perusing the precious canons and reviewing the jade scriptures, wherein lie boundless secrets beyond enumeration. Yet there is the Jade Firmament Prefecture, which governs the Inner Courts of the thirty-six heavens, the Eastern and Western Flower Terraces, the Mystic Coil Wondrous Chambers, the Four Prefectures and Six Courts, and all their subordinate offices, each with its own bureau and division—altogether, they oversee the Five Thunder Heavens’ descent into the three realms. O Most August Heavenly Worthy, your heart is ever close to the affairs of the multitudes. By what cause or condition might these minor omens be made to submit and serve? We humbly wish to hear your teaching.”\n\nAnnotation: The Thunder Master, Hao Huang, was an elder minister of the Celestial Emperor, a venerable preceptor and esteemed official. The Jade Firmament Prefecture was the Jade Clarity True King’s Court in the Highest Divine Firmament Heaven, residing above the thirty-six heavens. It comprised five halls: the Eastern Hall of Elixir Pearls, the Western Hall of Azure Jade, the Northern Hall of Azure Splendor, the Southern Hall of Concentrated Spirit, and the Central Hall of Longevity. There was also the Great One’s Inner Court, the Han Zhong Bureau, the Eastern and Western Terraces, the Four Offices and Four Divisions, and beyond them, the Great Brahmā Purple Tenuity Chambers and the Immortal Capital Fire-Thunder Halls. All had their jade prefectures, with the Left and Right Mysteries, the Golden Gates’ Chamberlains, the Chief Ministers, Supreme Ministers, Perfected Transcendents, Perfected Lords, Ministers and Attendants of the Celestial Court, Immortal Gentlemen, Jade Gentlemen, Jade Boys and Jade Maidens, Left and Right Commanders, and the various departments of thunder deities—officers, generals, and officials—who together governed the thirty-six heavens.\n\nThe thirty-six heavens were divided as follows:\n**Eastern Eight Heavens:** Highest Dao Tranquility Heaven, Highest Yang Qi Heaven, Highest Cavernous Radiance Heaven, Highest Purple Impulse Heaven, Highest Jade Numinosity Heaven, Highest Clarity and Emptiness Heaven, Highest Subtle Fruit Heaven, Highest Rectified Heart Heaven.\n**Southern Eight Heavens:** Highest Dao Origin Heaven, Highest Great August Heaven, Highest Mystic Impulse Heaven, Highest Ultimate Perfection Heaven, Highest Brahmā Qi Heaven, Highest Imperial Assistant Heaven, Highest Mystic Ancestry Heaven, Highest Sequential Transformation Heaven.\n**Western Eight Heavens:** Highest Left Constellation Heaven, Highest Governance and Transformation Heaven, Highest Talisman Advent Heaven, Highest Preservation and Splendor Heaven, Highest Essence Stabilization Heaven, Highest Azure Splendor Heaven, Highest Scintillating Jade Heaven, Highest Cinnabar Essence Heaven.\n**Northern Eight Heavens:** Highest Peace and Radiance Heaven, Highest Vast Ancestry Heaven, Highest Vast August Heaven, Highest Hopeful Mystery Heaven, Highest Celebratory Abode Heaven, Highest Celestial Tower Heaven, Highest Transformation and Immortality Heaven, Highest Ascending Mystery Heaven.\n**Additional Heavens:** Highest Reverent August Heaven in the Northeast, Highest Spirit Shifting Heaven in the Southeast, Highest Jade Numinosity Heaven in the Southwest, Highest Ascending Ultimate Heaven in the Northwest.\n\nBelow, they oversaw the thirty-six ramparts, with each direction possessing nine yang Brahmā qi, corresponding to the thirty-six qi of the year, each qi ascending in ten-day cycles. Each heaven had its emperor, who governed one qi, and the merits and transgressions of heavenly immortals, spirits, and ghosts were submitted to their respective heavens for judgment. Those with merit were recorded in their heaven’s register, while those with transgressions were imprisoned in their heaven’s celestial dungeon.\n\nAll matters of good and evil are reported by the August Lords of the thirty-six ramparts to the Divine Numinous Jade Treasury for investigation and judgment. Each heaven possesses dragon spirits who summon thunder, giving life or executing death, punishing violence and slaying the wicked—nothing proceeds without their authority.\n\nThe Four Treasuries are: the Nine Numinous Jade Clarity Treasury, the Eastern Ultimate Azure Mystery Treasury, the Nine Heavens Responsive Primordial Treasury, and the Cavernous Abyss Jade Treasury. The Six Institutes are: the Supreme Unity Inner Institute, the Jade Pivot Institute, the Five Thunders Institute, the Dipper Pivot Institute, the Celestial Yang Institute, and the Immortal Capital Fire-Thunder Institute. The various administrative offices include: the Heavenly Department Thunder Bureau, the Penglai Capital Water Bureau, the Supreme Unity Thunder Bureau, the Northern Emperor Thunder Bureau, the Northern Dipper Punitive Expedition Bureau, the Northern Dipper Defense Bureau, the Jade Treasury Nine Thunder Bureaus, and the various subordinate offices and departments.\n\nWhenever the world suffers from scorching yang, untimely winds and rains, reckless warfare, or repeated famines, petitions are submitted to the Jade Treasury, passing through the Jade Pivot, to be widely proclaimed across the celestial divisions. Concurrently, the Three Bureaus judge the merits and transgressions of the generals and soldiers, the ghosts and spirits of the Three Realms, aiding and rescuing the common people. All thunder-related offices, institutes, and treasuries assist the Jade Pivot’s decrees, receiving and executing them accordingly. As for the axes and halberds of thunder, the rewards and punishments, the commendations and executions—all proceed in perfect order, each under its designated office. Some are called concurrent bureaus, mobile bureaus, or inspection offices, all staffed with officials and functionaries.\n\nThus, the Jade Numinous Treasury alone governs the Five Thunders’ descent upon the Three Realms. In principle: the Heavenly Worthy, with jade scriptures and numinous texts, transforms the celestial perfected. The Thunder Masters silently comprehend the Heavenly Worthy’s intent, petitioning for the gates of expedient means. At such times, lord and ministers, though differing in form, share a single heart—nothing but opening the paths to enliven all beings. When reciting scriptures, the gentleman should take the Thunder Master’s heart as his own; thus, his merit will naturally find its return.\n\nExplanation: At that time, our Heavenly Worthy ascended the Treasure Terrace to observe all beings, speaking without words. Just then, the Thunder Master, Radiant Elder, whose duty lies in the Thunder Treasury and who surpasses the celestial perfected, discerned the Heavenly Worthy’s heart with his own and thus addressed him. Our Heavenly Worthy’s virtue and transformation are boundless, the true and primordial having their own origin; his mysterious scriptures and secret registers cannot be enumerated in detail. Therefore, he revealed the governance of the thirty-six heavens’ eastern and western terrace treasuries, institutes, and bureaus—none not unified under the Jade Numinous Treasury. Through the Thunder Master Radiant Elder’s initiative, he brought forth what our Heavenly Worthy had not yet proclaimed.\n\nThe Thunder Master petitioned the Heavenly Worthy: “Your heart is most great and most sagely, encompassing the ten thousand kinds. Though I, your minister, am of humble talent, by what cause or reason may I attend the Jade Celestial Court? I beseech the Heavenly Worthy to clarify my former kalpas, that I may assist in the primordial transformation and the affairs of the Jade Numinous Treasury.” One should hold one’s breath and listen reverently.\n\nEulogy: Suddenly rising to kneel, he respectfully addressed the True Ancestor. All offices, institutes, treasuries, terraces, and pavilions—honor and veneration!\n\nThe Thirty-Six Offices—clouds, thunder, rain, and wind—what spirit is not complete, what sage does not follow? Their duties govern life and death, their affairs determine fortune and misfortune. To hear the supreme teaching, one must reveal the cinnabar heart.\n\nHow benevolent! How benevolent! Thunder Master Radiant Elder.\n\nThe Heavenly Worthy spoke: “Thunder Master Radiant Elder, you and the immortal ministers have stored merit from former lives and accumulated deeds from past existences. Thus, you were promoted to the Jade Treasury and recorded in the Jasper Palace. Now, your meritorious deeds surpass those of former times. Devote yourselves wholly to the Thunder Bureau and entrust your hearts to the Fire Department. Day after day, year after year, as merit accumulates and conduct shines, your nature will clear and your spirit harmonize. You will then attain the rank of High Perfected and ascend the wondrous Dao.\n\nYet consider the ghosts and spirits of the Thunder Department: they toil by day and labor by night, ceaselessly driven. Some endure beatings; in grave cases, they face execution. Like chiseled clouds or carved snow, their tasks never end. Summoning dragons and commanding crows, when one task ceases, another begins. You must heed the causes of their suffering.”\n\nThunder Master Radiant Elder and all the gods and immortals of the heavens pricked up their ears in silence.\n\nThe Heavenly Worthy sat upon the Nine-Phoenix Cinnabar-Radiance Screen, raising a golden luminous ruyi scepter. A pure, cool breeze arose, and resplendent clouds gathered in lush beauty. The Heavenly Worthy remained still for a long while.\n\n*Annotation:* The Thunder Bureau issues commands and executes affairs with the swiftness of wind and fire, allowing no delay. Where blessings descend, there is direction; the sound of thunderclaps follows measure. Whether to bring drought or rain, all must obey the imperial decree. How do the ghosts and spirits of the Thunder Bureau carry out their tasks? These are people who, while dwelling in the dusty world, were disloyal, unfilial, unkind, and unjust; who disrespected the Three Treasures and neglected the Five Constants; who wasted the Five Grains. Thus, after their bodies perish, they are subjected to the Thunder Bureau’s drudgery—this is the retribution for their sins.\n\nHearing the Heavenly Worthy expound the causes of good and evil, Thunder Master Radiant Elder and all the gods and immortals of the heavens listened with ears alert and hearts trembling.\n\nAs the Heavenly Worthy sat, a divine wind arose, pure and cool, while vibrant clouds gathered in splendid beauty. After a long silence, he prepared to address the assembly of immortals once more.\n\n*Exegesis:* Good roots should be planted; evil karma must not arise. Even the Heavenly Perfected accumulate merit and cultivate conduct—how much more should later scholars and gentlemen devote themselves wholeheartedly?\n\n*Exposition:* Thunder Master Radiant Elder shares the same body as heaven and earth, his brightness equal to the sun and moon. Thus, the Heavenly Worthy spoke of his stored merit from former lives and great deeds performed before the primordial beginning. Having long accumulated and refined his essence and qi, he transformed into form and was thus promoted to the Jade Treasury and recorded in the Jasper Palace. Now, he oversees the Bureau of Good and Evil, dispensing transformation and aiding others—his merit is no small matter. His wholehearted devotion to the Fire Department is his true nature. With each passing day and month, his name grows loftier and his conduct more illustrious. By preserving his primordial qi, the words “his nature clears and his spirit harmonizes” are no empty phrase. Thus, he becomes a minister of evidential proof to the Highest Perfected Kings and ascends the ranks of the Great Dao.\n\nThe Heavenly Worthy discussed the two paths of good and evil for the Perfected of the heavens, then recounted how the ghosts and spirits of the Thunder Department toil day and night without rest. “Chiseled clouds” refers to their labor in rushing to the four directions, shaping clouds into formations. “Carved snow” describes their suffering as they brave freezing winds and congealed rain to craft frost-flowers. When they enter the sea to summon dragons or traverse forests to command crows, their tasks shift ceaselessly—east to west, rising and falling without pause. Thus, the causes of good and evil are made clear.\n\nAt that moment, the Heavenly Worthy addressed the Thunder Master: “I attained the rank of Great Transformation Perfected and Highest Perfected because my heart first aligned with this Dao. You, too, must take my merit as your own if you wish to ascend the immortal throne, assist in the transformation of the mysterious scriptures, and accomplish the Dao. Now, listen well.”\n\nAll the Heavenly Thearchs, hearing these words, pricked up their ears in reverent attention. The Heavenly Worthy’s majesty defies description: a divine wind arose, and resplendent clouds shone in pure, lush beauty. The Heavenly Worthy and the Nine Qi merged as one, still and unmoving.\n\n*Eulogy:* The two paths of good and evil are as distinct as echo and shadow. Good becomes Heavenly Perfected; evil becomes demons and specters.\n\nThe Heavenly Worthy said: “In a former kalpa fifteen hundred eons past, my heart first aligned with this Dao, and I attained the rank of Highest Perfected. My intent nurtured this merit, and I gained authority over the Great Transformation. Once, before the Primordial Heavenly Worthy of the Great Ultimate, I vowed with a pure and vast heart: ‘In future worlds, may all sentient beings—heavenly dragons and ghosts—who invoke my name be liberated. If this is not so, may I bear the burden myself.’ Now, purify your hearts, for I shall expound the teaching.”\n\n**Annotation:** \"Heart-sewing this Dao\" means, like cutting cloth to make garments—without stitching, how can it become clothing? Moreover, the single primordial *qi* of Heaven and Earth disperses throughout the vastness of the Six Directions. Humans receive from their parents a single primordial *qi* within their bodies, which is the legacy of their ancestors. If one cultivates it with wisdom, stabilizes the mind in pure observation, gathers the Seven Treasures, and coalesces the Returning Elixir, this is called \"sewing with the heart to complete the Great Dao and attain the rank of Highest Perfected.\" Furthermore, with the *qi* of Heaven and Earth’s transforming purity and the Dao’s merging with the marvel of harmonious emptiness, one ferments vast merit, thereby wielding authority over the Great Transformation, lifting Heaven and Earth, and becoming unfathomable in concealment and manifestation. Before the Primordial Heavenly Worthy of the Great Ultimate in the Great Canopy, the Heavenly Worthy vowed with a vast and pure heart: \"May all sentient beings—heavenly dragons and ghosts—who invoke my name be liberated. If this is not so, may I bear the burden myself.\" This fully reveals the Heavenly Worthy’s universal protection of humans and celestials, and his vast and solemn vow.\n\n**Exegesis:** Having fortunately obtained a human body, one must not let it slip away in vain. One should uphold this Dao, recite this scripture, and daily progress toward merging with the Dao—is this not of great benefit?\n\n**Exposition:** The difficulty of attaining the Dao lies in the challenge of uniting with it. In the beginning of five hundred kalpas past, our Heavenly Worthy’s heart first aligned with this Dao, which is the formation of the Nine *Qi*. Thus, he was called the True King and came to govern the Great Transformation. Once, before the Primordial Heavenly Worthy of the Great Ultimate in the Great Canopy, our Heavenly Worthy, with the untainted truth of the Nine Heavens, made a boundless vow across the Three Realms: \"In future worlds, any being that receives the Nine *Qi* and turns to my transformation by invoking my name shall be able to raise the dead and restore life. If any do not believe and follow, I shall transform the Primordial One *Qi* into the Nine *Qi* to restore their original state.\" The Heavenly Worthy addressed the Heavenly Emperors and Lords, saying: \"Purify your hearts, for I shall now reveal to you the profound mysteries of the Great Dao.\"\n\n**Eulogy:** The Dao is the heart of Heaven and Earth,\nYet the deluded do not seek to understand.\nA torn robe must be mended—\nOne needs a needle honed by water’s patience.\n\nThe Heavenly Worthy said: \"All you heavenly beings, if you wish to hear the Supreme Dao—the Supreme Dao is profoundly subtle, not found elsewhere. Since you wish to hear it, know that ‘no hearing’ is true hearing, and ‘having perception’ is the true Dao. When hearing and perception vanish, only you remain. You are not even ‘you’—how much less the Dao? To ‘hear without hearing’—what Dao is there to discuss?\"\n\n**Annotation:** The Supreme Dao is not found elsewhere but within oneself. If you wish to hear it, understanding your own Dao means there is no need to hear. Thus, it is said: \"No hearing is true hearing; having perception is the true Dao.\" If you hear others speak of yourself, having perception is the true Dao—yet hearing and perception must both dissolve, for they are not the true hearing or seeing. If you claim there is no ‘you,’ yet seek to hear the Dao, you cannot be spoken to about the Dao.\n\n**Exegesis:** The Great Dao is formless, without self or other, beyond existence and non-existence—this is the true Dao. Where is the Dao in the realm of form and action? Those who enter the Dao must plant their feet where there is no ‘no.’\n\n**Eulogy:**\nDao, Dao, Dao, Dao—\nSpeaking of it is laughable.\nHeaven, Earth, I, and all beings—\nOne family, one aperture.\n\nThe Heavenly Worthy said: \"The Dao is entered through sincerity, guarded through silence, and employed through softness. Using sincerity appears foolish; using silence appears inarticulate; using softness appears clumsy. Only thus can one forget form, forget self, and even forget forgetting. Those who enter the Dao know when to stop; those who guard the Dao know caution; those who employ the Dao know subtlety. Knowing subtlety, wisdom’s light arises; knowing caution, sagely wisdom is complete; knowing when to stop, one attains supreme tranquility and peace. Supreme tranquility and peace complete sagely wisdom; sagely wisdom generates wisdom’s light; wisdom’s light unites with the Dao—this is called true forgetting. Only by forgetting yet not forgetting, forgetting what cannot be forgotten, does one attain the Supreme Dao. The Dao pervades Heaven and Earth, yet Heaven and Earth do not know it. Sentient and insentient beings—all are one, without duality.\"\n\n**Annotation:** The Dao is the path by which the Three Realms proceed. To enter it, there must be a way; to guard it, there must be a method; its employment follows principle. The Dao is the name for Heaven and Earth’s non-action—it is humanity’s true constancy. Sincerity is uprightness without deviation, the principle of no falsehood. Thus, only with the sincerity of no falsehood can one enter the Dao of true constancy. Yet the Dao of true constancy is realized through personal awakening, so one must silently comprehend and harmonize the heart before guarding it, and act with ease and unhurriedness before employing it. To enter without guarding is not true entry; to guard without employing is not true guarding. Therefore, employing the true and real appears foolish in silence, harmonious and not forceful—how is this different from clumsiness? Yet this foolishness, inarticulateness, and clumsiness are merely appearances—how could they be truly so? Those who enter, guard, and employ the Dao in this way can not only forget things but also forget the self. When both things and self are forgotten, even the act of forgetting is forgotten. What is meant by forgetting form? The heart remains unmoved, profoundly still, without distinction between self and other. The wise recognize this; the enlightened see it—this is called truth. Entering the Dao, one knows when to stop; guarding the Dao, one knows caution—thus one abides in the Dao without straying. Employing the Dao, one knows subtlety—thus one returns to simplicity and is not misled by vastness. This is the original essence of the Dao’s body, the source from which the wondrous functioning of the single heart arises. Thus, all that is universally penetrating and all-knowing is inherently possessed by one’s original nature, and at this point, it is fully restored within oneself. Tracing its origin, it all stems from knowing when to stop.\"\n\nWhen one knows when to stop, there is stability; with stability, one can attain stillness. Through prolonged stillness and stability, hearing and sight become complete. The celestial radiance illumines within, and the heart is pure in the Dao, merging with the Dao in truth. Yet one does not know what is the Dao and what is the self—only that the Dao is the self, and the self is the Dao, both forgotten in the state where there is nothing left to forget. This is called the supreme Dao.\n\nThe supreme Dao resides within heaven and earth, yet one does not perceive where it dwells. To know the Dao is to recognize that all sentient beings—whether the self or the myriad creatures—and all insentient things—mountains, rivers, grasses, and trees—do not exist beyond the realm of absolute purity and undefiled singularity. Only those who embrace the One as the model for all under heaven understand this.\n\nFor those who cultivate truth and refine the Dao, holding fast to the One without admixture ensures that virtue advances without demonic obstruction, and ascension to the immortal realms will come in time.\n\n**Exposition:** This chapter outlines the foundational principles by which the Jade Pure True Sovereign enters, guards, and embodies the Dao. Devotees of the Great Jade Pivot Teachings who delve deeply into this passage will find true attainment, and the words of the Jade Pure True Sovereign will not have been spoken in vain.\n\n**Commentary:** The Great Dao is wordless; words are not the Dao. Thus, the Heavenly Worthy’s previous discourse on the profound and abstruse supreme Dao could not be fully conveyed. If such teachings were to be expounded, later generations would not be transformed by the Heavenly Worthy’s influence. The Dao has arising and ceasing, yet it is without sight or sound—arising, ceasing, sight, and sound are all created by the heart.\n\nWhen the Heavenly Worthy was born, the nine qi took form, yet what was seen? What was heard? This chapter is the path by which the Heavenly Worthy instructs those who study the Dao and cultivate truth, guiding them in their practice and preservation. It requires aligning one’s sincerity with the sincerity of heaven and earth.\n\nFor sincerity is the One. The Dao generates the One, the One generates the Two, the Two generate the Three, and the Three give rise to the myriad things—all originate from the One of sincerity. One who enters through sincerity, guards through silence, and acts through softness will appear foolish in sincerity, dull in silence, and clumsy in softness. Sincerity, silence, and softness are the substance and function; foolishness, dullness, and clumsiness are the Dao and its mystery. Only thus can one merge indistinguishably with the Dao, forgetting form, forgetting the self, and forgetting even the act of forgetting. This is the reality of the Dao and the wonder of truth.\n\nTo enter, one must know when to stop; to guard, one must know caution; to employ, one must know subtlety. Knowing subtlety, the radiance of the nine qi is complete. Knowing caution, the sageliness of the myriad spirits is fulfilled. Knowing when to stop, the spirits of the Three Primes are at peace. When the spirits are at peace, wisdom is complete; when wisdom is complete, numinous radiance arises; when numinous radiance arises, the original qi of one’s fundamental nature is united. This is called true forgetting—forgetting yet not forgetting, forgetting where there is nothing left to forget. This is the Great Dao of the true One.\n\n**Eulogy:**\nGuard the One, guard the One,\nEmploy caution and silence.\nWithout self, without others,\nYet there is a thief.\nIf you seize it,\nProfound clarity congeals like jade.\n\nThe Heavenly Worthy said: How shall I benefit the world in this age? For the sake of all heavenly beings, I expound this wondrous treasure. Those who awaken to it will ascend to the immortal ranks.\n\nStudents of the Dao, know that there are qi and fate. Wind and earth differ, and thus endowments vary—this is called qi. Wisdom and foolishness differ, and thus purity and turbidity vary—this is called fate. Fate is tied to destiny; qi is tied to heaven. Bound by qi and fate, constrained by heavenly mandate, one cannot attain the true Dao. The foolish can become wise, the turbid can become pure—this is decreed by destiny.\n\nThe foolish remain benighted, the turbid remain dark—this is the influence of wind and earth’s endowment. Heaven and earth move by their mechanism, causing people to remain unaware, which is called spontaneity. If one becomes aware of unawareness, it is still called spontaneity. The wonder of spontaneity lies in knowing, yet its wonder arises from not knowing. Nevertheless, the Dao has never begun to make one foolish or turbid.\n\nAll heavenly beings heard this, and the four assemblies rejoiced.\n\n**Annotation:** Where people are born, if the land is thick and the waters deep, the earth’s qi is cold, and the myriad things mature late. The work of creation is profound, and thus lifespans are long. If the land is thin and the waters shallow, the earth’s qi is hot, and the myriad things mature quickly. The work of creation is slight, and thus lifespans are short. This is the difference in wind and earth, the variation in endowment.\n\nIf one is endowed with pure prenatal qi, one becomes kind, upright, loyal, filial, intelligent, and wise—a lover of immortality and the Dao. If one is endowed with turbid qi, one becomes fierce, wicked, deceitful, cruel, foolish, rebellious, and lacking in humanity and righteousness. This is the difference between wisdom and foolishness, purity and turbidity.\n\nBound by qi and fate, like the blooming of flowers and trees, each has its season, all receiving the qi of heaven and earth. Constrained by heavenly mandate, it is as if a decree imposes shackles. The unvirtuous remain mired in evil destinies and cannot attain the true Dao.\n\nThe foolish can be transformed through the gate of wisdom; the turbid can be transformed through the gate of purity. The foolish remain benighted, the turbid remain dark—this is the natural course, determined by the allocation of wind and earth’s endowment. For heaven and earth give life to and kill the myriad things according to the qi of the four seasons.\n\nThe wise receive the qi of the Five Phases and the essence of yin and yang. By cultivating and refining them, they preserve their lives, enduring as long as heaven and earth, as luminous as the sun and moon. The foolish know only sensual pleasures and flavors, unaware that these harm their lives. Thus, students of the Dao should reflect in silence.\n\n**Exposition:** All things born of heaven receive the power of the Two Qi. Those with more pure qi are refined and virtuous; those with more turbid qi are wicked and depraved. Is this not due to the unevenness of wind and earth and the variation in endowment?\n\n**Commentary:** The unevenness of wind and earth is truly tied to qi and fate.\n\nThus, Our Heavenly Worthy presents this chapter. Why is it placed after the exposition of the Great Dao? Because worldly people, neglecting self-cultivation, recklessly squander their lives. Who among them knows that the light and pure qi forms heaven, while the heavy and turbid qi forms earth? For the human body, the qi of heaven generates essence, fluids, and humors; the qi of earth generates bones, flesh, and sinews. Having received the Two Qi at birth, why then do people differ in lifespan, intelligence, virtue, and folly? Is this not due to the varying thickness of wind and earth, the imbalance of yin and yang?\n\nThe mandate of heaven is like a fetter; the allotment of qi is like an enclosure. It is said that no one can escape heaven’s mandate or transgress the bounds of qi. Only we, the students of the Dao, who revere this scripture, may transcend heaven’s mandate and rise beyond the constraints of qi.\n\nWhen Our Heavenly Worthy finished speaking these words, the assembled ministers, preceptors, and all the Heavenly Emperors, Thunder Masters, and Radiant Elders leapt forth in praise. Even the celestial dragons and spirits, gods and demons, could not contain their joy, dancing with hands and feet.\n\n**Eulogy:**\nThe suitability of wind and earth depends on qi and blood.\nWaters each have their source; beings each have their kalpas.\nThe light and pure return to the mysterious; the heavy and turbid remain impure.\nThe Dao is fundamentally undivided; this heart is like the moon.\n\nThe Heavenly Worthy declared: “What I have spoken is the *Precious Scripture of the Jade Pivot*. In future ages, if any sentient beings hear my name and silently contemplate it, forming this thought—uttering the name of the Nine Heavens’ Responsive Primordial Thunder-Sounding Universal Transformation Heavenly Worthy—whether once, five or seven times, or a hundred or a thousand times—I shall manifest in the ten directions, extend my mind through the Three Realms, and ensure that all who invoke my name attain their desires. Throughout the ten directions and Three Realms, in all heavens and earths, the sun, moon, and stars, mountains, rivers, grasses, and trees, creatures that fly, crawl, or stir—whether sentient or insentient—celestial dragons, spirits, and gods: if any hear sentient beings invoke my name and yet fail to comply, may their heads be severed and their hearts carved out, reduced to fine dust.”\n\n**Annotation:**\nThe *Jade Pivot* is the qi of the Jade Clarity. Jade is the most exalted and noble, thus the Celestial Venerable of Primordial Beginning is called the Jade Clarity; the August Emperor of Heaven is called the Jade Sovereign; the Supreme Dao Lord is called the Jade Dawn; the Supreme Venerable Lord is called the Lofty Jade Emperor. The capital of the Three Clarities is named the Jade Capital; the Divine King of the Divine Empyrean is called the Jade Clarity. Jade is the most noble among treasures. The *pivot* is the hinge of heaven. Thunder is the pivot and mechanism of heaven and earth. The heavenly pivot governs yin; the earthly mechanism governs yang. Though heaven is fundamentally yang, it is called the *pivot*—this is the principle of inversion. Though heaven is yang and earth is yin, heaven generates water as the first of the Five Phases. The Greedy Wolf Star of the Northern Dipper is called the Pivot Star; the Greedy Wolf corresponds to the Celestial Origin, the first of the Seven Governors. Like the Bureau of Military Affairs, it is the pivot and mechanism of the imperial court, overseeing the state’s confidential affairs and wielding the power of life and death. The *Scripture of the Jade Pivot* is the thunder script of the Heavenly Treasury. If there are disobedient people, their hearts must be restrained and their heads severed—all by the command of the Thunder Bureau.\n\n**Exposition:**\nThe Heavenly Worthy’s heart is a heart of cherishing life. Manifesting in the ten directions, he ensures that not a single being is deprived of his grace. If any slander this scripture, the Thunder Bureau will test their heads and carve out their hearts—this is fitting.\n\n**Commentary:**\nIn this chapter, the Heavenly Worthy’s vast vow is made clear. The Heavenly Worthy’s thoughts and lives are boundless, beyond description; thus, he bestows the numinous scripture of the *Jade Pivot* to transform sentient beings. If, after beings are transformed and attain the truth, they invoke my Heavenly Worthy’s name or inscribe my Heavenly Worthy’s talisman, then all things in the world—mountains, rivers, grasses, trees, creatures that fly, crawl, or stir—anything endowed with the Two Qi, shall tremble and listen, daring not the slightest defiance. If any disobey, the Thunder Bureau will not tolerate it, and they shall be shattered into fine dust.\n\n**Eulogy:**\nHeavenly Worthy, Heavenly Worthy,\nYour vow is vast and boundless.\nThose who slander the mysterious scripture\nshall meet harm from the Thunder Bureau.\n\nThe Heavenly Worthy declared: “I am the Nine Heavens’ Chaste and Radiant Great Sage. On the sixth day of each month and on the *xin* days within the ten-day week, I oversee the myriad heavens and wander through the Three Realms. If anyone wishes to study the Dao, aspire to immortality, ascend to the Nine Mysteries, or dispel the Three Calamities, let them command a Zhengyi Daoist or, together with kin and friends, perform rites at a towered temple, in their home, or at a village shrine—offering libations of water and flowers, reciting this scripture. Whether once, three or five times, or even dozens or hundreds of times, they shall attain clarity of spirit, vigor of qi, a broad mind, and a robust body. All their aspirations shall be answered in accord with their resonance.”\n\n**Annotation:**\nThe Heavenly Worthy is titled the Chaste and Radiant Great Sage. *Chaste* means to observe heaven and earth with integrity and to prevail over fortune and misfortune. Thus, the sage emulates the transformations of heaven and earth and models the auspices of fortune and misfortune. The *Book of Changes* states: “The Creative is pure, replete, beneficial, and steadfast.” *Steadfast* corresponds to winter among the four seasons and to the north among the four directions; its command also belongs to the north. Heaven generates water as the first of the Five Phases—this is the ancestral qi of the Jade Clarity. The Heavenly Worthy descends on the sixth day of each month and on *xin* days. The sixth day: six yang descends to generate *qian*; six yin prevails to generate *kun*. The waxing and waning, ascent and descent circulate through the six voids, forming the ultimate Dao. From this arises sagely work; from this emerges numinous illumination. The generative number of heaven and earth is one; the consummate number is six. Heaven and earth attain these to moisten and benefit the world. The *six xin* are the water numbers of heaven, the celestial numbers—hence the name *six xin*. The *xin* number belongs to *qian*, heaven. Heaven generates water—all are the principles of the primordial unity of qi. The *myriad heavens* refer to all heavens from the Great Luo, Pure Tenuity, and Yu-Yu to the Great Red King’s realm. The Heavenly Worthy surveys all heavens without exception, observing the merits and faults of their inhabitants. As for the Three Realms, he wanders through them all, recording the merits and faults of the myriad spirits. If one recites this scripture, all their aspirations shall be answered in accord with their resonance.”\n\nThe Heavenly Worthy declares: “Whether endowed with sentiment or devoid of it, whether possessed of awareness or lacking it—all may attain true realization, thereby propagating the great transformation. Those who perceive their own virtue and power as immeasurable shall find their invocations invariably answered. O followers of the Dao, how can you not strive with diligence?”\n\nThe Exegesis states: On the day the Heavenly Worthy descends to inspect the world, fearing that mortals, unaware, might transgress celestial statutes, his compassion for all living beings extends even to this. Should any aspirant to the Dao and immortality—whether offering libations of water and flowers, whether kin or friend, or a Daoist—recite this scripture but once, they shall be enrolled among the ranks of immortals, their names inscribed in the celestial registers. Even those of lesser wit, should they suddenly awaken sincere devotion and recite this scripture, shall find their hearts expanded and bodies at ease. If filial sons and obedient grandsons purify their minds, cleanse their thoughts, and establish altars to invite the recitation of this scripture, they shall attain transcendence. Thus, whether dispelling the Three Calamities or summoning the Nine Ancestors, all shall achieve their desires, and none shall fail to receive response.\n\nThe Eulogy proclaims:\nSincerity requires no material offering—qi alone suffices to draw near.\nInvoke but once the sacred name, and heaven and earth shall renew like spring.\n\nThe Heavenly Worthy asks: “Within the body dwell the Nine Spirits—why not summon them? The first is Heaven-Born, the second Peerless Radiance, the third Mystic Pearl, the fourth Central Upright, the fifth Child Cinnabar, the sixth Revolving Brilliance, the seventh Cinnabar Prime, the eighth Great Abyss, and the ninth Divine Youth. To invoke them is auspicious. Within the body reside the Three Essences—why not call upon them? The first is Terrace Light, the second Luminous Spirit, and the third Hidden Essence. To summon them is felicitous. When the five centers are vexed and restless, the six pulses chaotic, the four limbs unquiet, and the hundred joints distressed, recite this scripture.”\n\nThe Annotation states: The Nine Spirits are the fundamental deities within the human body. Heaven-Born is the Mystic Female. Peerless Radiance is the Infant Brother. Mystic Pearl is the Valley Spirit. Central Upright is the Muddy Pellet. Child Cinnabar is the spirit of the Numinous Terrace. Revolving Brilliance is the spirit of the Treasured Contract. Cinnabar Prime is the spirit of the heart. Great Abyss is the spirit of the Kidney Palace, the Arrayed Maidens, and the Water Mansion. Divine Youth governs and restrains the spirits of the five viscera. Terrace Light arises when male and female unite in essence, and the embryo first flourishes. Luminous Spirit is the *hun*. Hidden Essence is the *po*. Since one knows these divine spirits dwell within the body, why not call upon them constantly, refining them into a single household? Thus, the path to learning the Dao and aspiring to immortality shall be free of all obstacles. If the five centers are vexed and the six pulses chaotic, reciting this scripture shall pacify all spirits within the body, bringing tranquility and ease.\n\nThe Exposition states: The Three Essences and Nine Spirits are not external entities. They abide in our original home—take care not to let them depart. Ensure they ever attend at your side, paying homage to the perfected and revering the sages, and they shall be readily seen and easily attained. Thus, the Heavenly Worthy, fearing that people know not where the great Dao resides, points to it here.\n\nThe Exegesis states: Heaven possesses the Nine Luminaries, and humans possess the Nine Spirits. Heaven has the Three Terraces, and humans have the Three *Hun*. When the Nine Luminaries of heaven lose their proper measure and the Three Terraces shift their positions, droughts, floods, and dark omens arise. When the Nine Spirits of humans fail to guard their stations and the Three *Hun* wander recklessly, calamities and misfortunes ensue. Should any of these three conditions arise, recite the scripture with utmost sincerity, burn talismans, and the Three *Hun* shall be pacified, the Nine Spirits stilled, the five centers calmed, the six pulses harmonized, the four limbs at peace, and the hundred joints free of affliction.\n\nThe Eulogy proclaims:\nNine Spirits, Nine Spirits—these are my essence.\nCall upon them constantly, and ever preserve long life.\n\nThe Heavenly Worthy declares: “Should anyone suffer from the five phases in adverse configuration, the Nine Luminaries in disarray, their year afflicted by clashes and conflicts, their fate beset by contention, solitary stars and barren constellations, the Blade of Yang and the Edge of the Sword, the Robber of Destruction and the Spirit of Death, the Ghost Gate and the Hook of Entanglement, their official salary ruined, their Horse fallen into emptiness, their actions fraught with peril, their conduct beset by misfortune—let them recite this scripture. Thereby, they may petition the Celestial Official to resolve celestial adversities, the Terrestrial Official to resolve terrestrial adversities, the Aquatic Official to resolve aquatic adversities, the Five Emperors to resolve adversities of the five directions, the Four Sages to resolve adversities of the four seasons, the Southern Asterism to resolve adversities of one’s original destiny, and the Northern Dipper to resolve all adversities.”\n\nThe Annotation states: When one’s five phases are obstructed, the Nine Luminaries lose their proper measure, and one encounters clashes, conflicts, and various baleful stars, all actions and undertakings shall be inauspicious. In severe cases, one may incur celestial reprimands, terrestrial punishments, or even lose one’s life—all governed by the Three Officials, Five Emperors, Four Sages, and Two Dippers. By devoting oneself to this scripture, reciting incantations, burning incense, and presenting talismans, all adversities and calamities may be resolved.\n\nThe Exposition states: Among the Three Realms, humans are the most numinous. Yet if they fail to advance toward the higher path, even when stars and constellations contend and clash, and their conduct is beset by misfortune, they should swiftly devote themselves to the true scripture, and the Three Primes and Five Emperors shall dissolve their transgressions. This chapter instructs people to recognize taboos and seek expiation.\n\nThe Exegesis states: This refers to those whose five phases are inauspicious and whose Nine Luminaries are disturbed. All baleful stars and malevolent spirits are subject to the decrees of our Heavenly Worthy. Should anyone encounter such misfortunes, by reciting this scripture, the Heavenly Worthy shall command the Six Spirits of Destiny in their household to petition the Celestial Official to resolve celestial adversities, the Terrestrial Official to resolve terrestrial adversities, the Aquatic Official to resolve aquatic adversities, the Five Emperors to resolve adversities of the five directions, the Four Sages to resolve adversities of the four seasons, the Southern Asterism to resolve adversities of one’s original destiny, and the Northern Dipper to resolve all adversities. For these Three Officials, Five Emperors, Four Sages, Southern Asterism, and Northern Dipper are also the functionaries of the Heavenly Worthy. Thus, the term “petition” is used to make known the vast jurisdiction of the Heavenly Worthy’s administration.\n\nThe Eulogy proclaims:\nThe terrestrial net and celestial snare cannot be escaped;\nWhen baleful stars descend, how can they be dispelled?\nRecite with sincerity the name of the Heavenly Worthy,\nAnd swiftly burn the jade script and golden talismans.\n\nThe Heavenly Worthy declares: “When one is bedridden with chronic illness, afflicted by grave maladies, their condition lingering unresolved, medical treatments ineffective, the five spirits ungoverned, and the four great elements unrestrained—whether before the Five Emperors and Three Officials, the sun, moon, and stars, the mountains, forests, grasses, and trees, the sacred altars and ancient sites, the city gods and earthly temples, the village wells and kitchen stoves, the monasteries, pagodas, and towers, or within the thirty-six hells of the underworld and the seventy-two bureaus of the nether officials—should any grievances or entanglements arise therefrom, they shall be bound and ensnared.”\n\nOr by the curses and oaths they have invoked, or by the debts and burdens they have failed to repay. Grievances spanning three lifetimes, enmities arising from past kalpas—all such faults and offenses, all such confrontations and contentions, must be confessed and repented. Then recite this scripture.\n\nAnnotation: For chronic and lingering illnesses that confine one to bed, where medicine and prayers prove ineffective, this is because the Three Officials and Five Emperors, Mount Tai and the sacred peaks, the sun, moon, and stars, the city gods and earthly temples, the village wells and kitchen stoves, the sacred altars and ancient sites, the monasteries, pagodas, and towers, the bureaus of the Five Paths, the nether officials of the underworld, and even the spirits of mountains, rivers, grasses, and trees—all may have been inadvertently offended. Or perhaps there are long-standing grievances, debts of wealth or life, curses from others, or broken vows and violated oaths, with enmities and grudges accumulated over countless kalpas. One must repent, openly confess one’s transgressions, recite the scripture and incantations, and burn these talismanic writings to achieve full recovery.\n\nExegesis: This chapter specifically addresses the accumulation of illness and the conflicts arising from taboos. By invoking the name of the Heavenly Worthy, misfortune departs and blessings arrive—why doubt this?\n\nCommentary: When one is afflicted with chronic illness that no worldly medicine can cure, and when malevolent spirits stir trouble—whether through self-inflicted curses, others’ maledictions, accumulated debts, or hidden transgressions—the underworld seeks to investigate and pursue the cause, to apprehend and confront the offender. How else may one be absolved? By reciting the precious scripture and burning the sacred talismans, peace and ease are restored at once.\n\nEulogy:\nYin’s retribution, yang’s transgressions—\nSuch plagues are but their recompense.\nWhen taboos are violated,\nRecite the scripture, pray the talismans.\n\nThe Heavenly Worthy declares: There are celestial talismans, terrestrial talismans, and talismans for each year, month, day, and hour. For every direction and orientation, there are corresponding talismans. Great offenses invoke official talismans, while minor ones provoke verbal disputes, governed by the spirits of the Red Mouth and White Tongue. In all actions and undertakings, in going out and staying in, if one fails to observe taboos and encounters these talismans or verbal spirits, one will be harassed incessantly, day and night tormented, lips and tongue embroiled. Flattery and slander arise, leading to lawsuits and punishments. To escape this, recite this scripture, and the disputes will silently dissipate, the talismans forever stilled.\n\nAnnotation: In this chapter, the Heavenly Worthy speaks of the spirits of official talismans, the Red Mouth, and the White Tongue—these are malevolent stars sent down by the celestial courts. Because worldly people fail to cultivate the true Way, defy public law, and profane thunder and rain, these spirits are dispatched to harass them. If one transgresses, recite this scripture at once and burn the talismans to dissolve the affliction in that very moment.\n\nExegesis: In human conduct, there are rights and wrongs, but one often fails to recognize the signs or grasp the principles. Should one transgress, this scripture can absolve it.\n\nCommentary: The Heavenly Worthy’s vows are vast, and his transformations boundless. This chapter specifically addresses the talismanic spirits, for they are easily offended but difficult to appease. Should an ordinary person provoke them, the Red Mouth and White Tongue seize the opportunity to arise. Why do worldly people not recite the precious scripture and burn the jade talismans in advance, so that such misfortunes vanish of themselves?\n\nEulogy:\nCelestial talismans, terrestrial talismans—\nMortals must not provoke them.\nTo dispel lawsuits and misfortune,\nRecite the scripture, petition thrice with talismans.\n\n*End of the Upper Volume of the Collected Annotations on the Jade Pivot Precious Scripture of the Heavenly Worthy of Universal Transformation Through the Thunder’s Resounding Voice*\n\n*Beginning of the Lower Volume of the Collected Annotations on the Jade Pivot Precious Scripture of the Heavenly Worthy of Universal Transformation Through the Thunder’s Resounding Voice*\n\nThe Heavenly Worthy declares: The Nine Mounds of the Earth Sovereign are governed by one thousand two hundred spirits, including the Earth Lords, Earth Marshals, Earth Lords and Ladies, Earth Children and Grandchildren, and their entire earthly retinue. Among them are the Year Star, the General Star, the Crane Spirit, Venus, the Nine Auspicious Stars, the Sword Blade, the Male and Female Stars, the Metal Spirit, the Fire and Blood Spirits, the Yellow Body, the Life-Striker, the Three Sha, the Seven Sha, the Yellow Banner and Leopard Tail, the Flying Edge and Execution Block—such are the earthly spirits and malevolent stars. Should one undertake construction or divination and inadvertently offend them, illness, misfortune, and even death may follow. But upon reciting this scripture, all spirits rise in response, and there shall be no taboos in heaven, no taboos on earth, no taboos in yin and yang, and no prohibitions whatsoever.\n\nAnnotation: Whenever one undertakes construction or begins a project, one may unwittingly offend these spirits and malevolent stars, bringing immediate calamity. At worst, it leads to death; at best, lawsuits and disputes. How can one not be cautious? By following the rituals, inscribing the talismans, reciting the scripture, and offering prayers, all taboos are lifted.\n\nExegesis: The Heavenly Worthy cherishes all living beings to such an extent. It is said that we live upon the earth and return to the earth in death, yet few realize how profoundly the earth can harm. For the earth prefers stillness and resists disturbance.\n\nCommentary: Heaven covers the earth—who does not know this? Yet our Heavenly Worthy, as the supreme lord of the Nine Heavens, governs the Three Realms. The Nine Mounds’ Sovereign, his spring retinue, and his many malevolent ministers inflict grave harm upon humanity. The Heavenly Worthy employs the jade script and precious talismans to suppress and dispel them, ensuring that all—from the wise to the foolish—may act without taboos.\n\nEulogy:\nAll things arise from earth,\nAnd inadvertent offense brings disaster.\nWere it not for the power of the true scripture of Universal Transformation,\nEverywhere would be heaps of white bones.\n\nThe Heavenly Worthy declares: When worldly men and women marry, they may offend the Salty Pond, the Heavenly Dog, the Three Punishments, the Six Harms, the intersecting angles, the solitary yin and solitary yang, the Heavenly Net and Earthly Snare, leading to difficulties in bearing children and a life of solitude. If one seeks a son, recite this scripture, and the Great Spirit of the Nine Heavens who oversees birth will summon the spirits and command the winds, bringing forth a worthy child. At the time of birth, the Great Unity stands at the door, and the Controller of Destinies waits in the courtyard.\n\nShould grievances, grudges, malevolent spirits, or taboos arise—should ill fortune or calamity strike—causing difficult labor, recite this scripture, and the Nine Heavens’ Guardians of the Chamber will attend, while the Holy Mother silently assists in delivery, ensuring the birth is joyous and the labor free from peril.\n\nFor infants in swaddling, tormented by the fifteen kinds of ghosts under the Sandalwood Spirit-King, afflicted with fright and convulsions, this scripture should be recited.\n\n**Annotation:** In marriage and childbirth, all mortals contend with spirit perils. Unaware of directions, heedless of the Grand Year-Star, they may inadvertently offend—such transgressions bear grave consequences. Hasten to recite the scripture and burn talismans to avert misfortune, and peace and prosperity will follow.\n\n**Exegesis:** Fortune and misfortune stand as two paths, ever intertwined. Should discord or barrenness arise, invoke the Heavenly Worthy’s name but once, and all shall dissolve of itself.\n\n**Exposition:** This chapter binds mortal marriage and progeny to the Heavenly Worthy’s dominion. The begetting, betrothal, and rearing of children are no trifling matters. Yet worldly custom, blind to such truths, stumbles into private miscalculations—errors manifold. Should offense occur, husband north and wife south, children will come only with great difficulty. Recite the precious scripture and burn sacred talismans to dispel it, and naturally husband and wife will harmonize, their descendants flourishing.\n\n**Eulogy:**\nMarriage is the bond of human relations,\nSons and daughters the love of flesh and bone.\nTo make the household thrive in accord,\nRevere the Jade Pivot’s text.\n\nThe Heavenly Worthy declares: Where men dwell, crows and rats deliver omens, serpents and insects sow corruption, bricks and tiles are hurled, chickens startled, dogs provoked, and offerings demanded—even spectral coercion and dream oppression, or worse, theft and debauchery. Should such spirits dare claim a dwelling as their lair, the living will be bewildered. The courtyard and home grow unclean; by night, wailing echoes in the rafters; by day, unseen eyes peer into the chamber. Cattle, horses, dogs, and swine suffer pestilence; calamity clings to kin, disaster befalls livestock. Lewd shrines and heretical altars shelter wicked spirits, while mourners arrive in droves and funeral biers depart in succession. Recite this scripture, and instantly ghostly essences vanish, men and creatures alike find peace.\n\n**Annotation:** Such households, scorning moral principles and the Dao of proper conduct, defy the gods of Heaven and Earth. Their mouths reek of foul meat and rank flesh; their bodies tread paths of lust and slaughter. They flout public law, pursuing only private gain, unleashing venom and violence, indulging every vice. Thus do they provoke the envy of ghosts and the wrath of spirits, summoning malevolent forces. Yet should they repent, confess their faults, recite the scripture, and burn talismans, misfortune will cease, and all will dwell in tranquility.\n\n**Exegesis:** When walls crumble, thieves enter; when karma weighs heavy, ghosts arrive, bringing disaster to livestock and misfortune to household spirits. The Heavenly Worthy, not dismissing even minor transgressions, extends great mercy—recite the scripture often, and calamity will halt.\n\n**Exposition:** When the upright qi is as vast as Heaven, no demon dares encroach. Yet mortals, mismanaging their households, offend the divine intelligence, driving away the Six Spirits, allowing perverse qi to seize the moment. Rat spirits and serpent specters hurl objects and sow chaos; blood-yin strikes without warning, even tainting household members—such perils defy prediction. Or thieves may pilfer goods, shifting things from east to west—all of this kind. Thus do mourners and death-portents run rampant, spirits emboldened to act as they please. Recite the precious scripture and burn jade talismans, and both people and creatures will find peace.\n\n**Eulogy:**\nWhen one does evil, evil arises;\nWhen one acts with virtue, Heaven acts in kind.\nShould mortals face such trials,\nInscribe sacred talismans and recite the precious scripture.\n\nThe Heavenly Worthy says: The Nine Heavens’ Thunder Duke Generals, the Five Directions’ Thunder Duke Generals, the Eight Directions’ Cloud-Thunder Generals, the Five Directions’ Barbarian Thunder Envoys, the Thunder Department’s Marshal Commanders, the Deceptive Illusion Judges—all issue commands swift as wind and fire. Where there are temples to strike, altars to smite, demons to purge, or malevolent forces to banish, they act. In this degenerate age of declining Dharma, many are the shamans and sorcerers; perverse arts spread, and yin forces freely cast their curses.\n\nThus, in the Supreme Clarity, there stands the Celestial Court for Binding Ghosts and Registering the Wicked, the Imperial Chamber for Restraining Demons and Interrogating the Perverse. Those who recite this scripture shall find their prayers answered as swiftly as an echo.\n\n**Annotation:** Among the twenty-one sections of this scripture, all are the words of the Heavenly Worthy, yet only this chapter begins with \"The Heavenly Worthy says.\" This is because it extols the Thunder Duke Generals, Envoys, and Judges, who issue commands and manifest their awe-inspiring virtue in instant response. Thus, it does not speak directly.\n\nThe followers of shamans and sorcerers, devoted to perverse arts, recklessly fabricate demonic words, casting curses to sunder husbands and wives, or employing bewitchments to entice women into illicit unions. When such malevolent sorcerers are encountered, recite the precious scripture and burn the sacred talismans, and the Thunder Bureau shall eradicate them, meting out retribution as swiftly as an echo, so that people may find peace.\n\n**Exegesis:** Heaven and Earth are impartial, aiding only those of virtue. The retribution for good and evil moves as swiftly as shadow and echo. Those who cultivate the Dao, embodying the heart of Heaven and illuminating their own hearts, shall see misfortunes dispelled and blessings and prosperity arrive.\n\n**Commentary:** This chapter is the Heavenly Worthy’s own praise of the Thunder Bureau’s sagacity. For this reason, it slays ghosts, severs evil, summons clouds, and brings rain—all by the Heavenly Worthy’s command, enacted below. Yet in this age, the sacred and the profane are often indistinguishable. Some employ unorthodox arts to corrupt human relations and violate the law. Recite this precious scripture and burn the talismans, and the response shall be as swift as an echo. How can one not revere and fear this?\n\n**Eulogy:**\nThe Thunder Bureau discerns good and evil,\nUprooting evil and rescuing the good,\nEver eradicating perverse arts that bring harm.\nRecite the Jade Pivot often.\n\nThe Heavenly Worthy says:\nHeavenly pestilences, earthly pestilences—twenty-five in all.\nHeavenly gu, earthly gu—twenty-four in all.\nHeavenly consumptive afflictions, earthly consumptive afflictions—thirty-six in all.\nThose who recite this scripture shall find pestilences purified,\ngu poisons dissolved,\nand consumptive afflictions healed.\n\nThere are reasons for these afflictions:\nSome arise from the lingering influence of the long-dead,\nor from the residual qi of corpses,\nor from lawsuits over graves and tomb curses,\nor from the contamination of dead spirits,\nor from the summoning by corpse qi.\nAll such ghosts and spirits—whether moved by sorrow,\nor bound by resentment and entanglement—\ncast their baleful influence like arrows.\nSeizing every opportunity, they strike when least expected.\n\nThus this scripture reaches upward to the Three Heavens and penetrates downward to the Nine Springs. It can summon and deliver the wandering souls, transcend and ferry the ancestral generations, for the Most High dispatches the Great General of the White Chariot and White Horses to oversee the rite.\n\nAnnotation states: All who suffer from pestilences, gu, or consumptive afflictions have brought them upon themselves—so severe that entire households may perish, and six relations be entangled. Yet if one recites the scripture with sincere devotion and burns the talismanic writs, the Thunder Bureau shall dispatch the generals of the White Chariot and White Horses to extricate them, sparing them from this suffering.\n\nExposition states: Pestilences, gu, and healing afflictions have their origins. But if one purifies the heart, maintains personal purity, recites the true scripture, and pays homage to the Heavenly Worthy, one shall not fall prey to this suffering.\n\nExegesis states: Pestilence arises from impure qi, gu from shadowless worms, and consumptive afflictions from hard-to-cure illnesses. Why does the Heavenly Worthy speak of these three? They too have their origins—stemming from lingering connections and contagion, corpse qi and mutual defilement, or tomb lawsuits and spectral summons. Lingering connections are humanity’s great calamity; the world does not know how to perform exorcisms, hence entire families perish. Tomb lawsuits are the governance of the seven ancestral generations’ grievances. Corpse qi arises from ancient coffins in the earth, which transform into tiny insects that may fly into food or fall into vessels; when consumed, they cause gu. When moving residences, one should recite the scripture and burn talismans to eradicate them.\n\nEulogy states: The great suffering of heaven-and-earth’s pestilences, gu, and consumptive afflictions has its causes, yet it is also self-inflicted.\n\nIf one recites the Mysterious Writ, one may rescue the seven ancestral generations, and the White Horse General will act as their protector.\n\nThe Heavenly Worthy states: Should one prepare for a distant journey, bandits and thieves may scheme, and the five weapons bring harm. On land, tigers, wolves, mountain spirits, and venomous creatures sharpen their fangs; on water, dragons and alligators gape their jaws. One may encounter the grievances of wronged souls or the predestined trials of wind and waves. The departed may seize the living to replace the dead. Yet if one surrenders body and heart to this scripture, one shall traverse land and water in peace, and all undertakings shall be auspicious.\n\nAnnotation states: When traveling by land, one may meet bandits or armed conflict, or encounter serpents, tigers, or malevolent mountain spirits. When traveling by water, one may face dragons, turtles, or alligators stirring waves and winds, or lost souls seeking substitutes. One may suffer predestined trials or be cast adrift in distant lands. Always prepare talismans to guard against these perils; they may be burned in water or fire, or one may urgently recite the sacred name to instantly avert all calamities.\n\nExegesis states: In all movements and stillness, one must be cautious and vigilant. If one has long upheld this scripture, how could such misfortunes arise?\n\nExposition states: In all actions and repose, one must be prudent. For fortune and misfortune, clarity and obscurity arise from movement. Thus, in every movement, only one outcome is auspicious—the other three are not. How can one not be careful? Before embarking on a journey, one must first recite the sacred scripture and wear its talismans; then all shall be auspicious.\n\nEulogy states: Travel by land and water is inescapable in this world; ghosts and spirits secretly plot harm. Yet with a single invocation of the Universal Transformation Heavenly Worthy’s name and the wearing of the True King’s Jade Talisman, all shall be well.\n\nThe Heavenly Worthy states: When scorching yang prevails and rain is delayed, prostrate yourself before this scripture, and timely sweet rains shall fall. When excessive yin rages and floods overflow, prostrate yourself before this scripture, and skies shall clear. When the Fire God fans disaster and flames engulf homes, when red rats roam the city and the people suffer from heat, this scripture may be used to exorcise them. When the Sea God loses control and fish and turtles wander recklessly, when floods rise to the heavens and the people drown, this scripture may be used to halt them.\n\nAnnotation states: This chapter reveals the Heavenly Worthy’s deep compassion for all beings. Prolonged drought or excessive rain arise from the disharmony of heaven and earth’s qi, and the people’s karmic burdens remain unresolved. Thus, the Three Realms grow wrathful: floods and landslides occur, the Fire God fans disaster, red rats stir chaos, and the people know no peace. In such times, one should recite this scripture and burn its talismans; then rain and sunshine shall be timely, and the people shall be at peace.\n\nExegesis states: When yin and yang lose their rhythm, as in droughts or floods, it stems from the decrees of the celestial bureaus. For the qi of evil karma does not dissipate, and the true Dao is not revered. The Heavenly Worthy, in turning the wheel of creation, nurtures all beings with a heart of boundless life—how can this not be praised?\n\nExposition states: Clear skies and storms are no small matters. They concern the celestial courts above and the grotto-heavens below, and arise from the disharmony of the two qi. In times of flood or drought, the devout should establish a ritual altar, recite the numinous writ, and burn the jade talismans; then droughts shall yield rain, and rains shall yield sunshine.\n\nEulogy states: Floods and droughts are disasters that shake heaven and earth. Yet with sincere recitation of the scripture, skies shall clear, and sweet rains shall fall.\n\nThe Heavenly Worthy states: Should one wish to avoid the calamities of the three disasters and nine misfortunes, one must prostrate oneself toward the Northern Asterism on a quiet night. Above the Northern Asterism lie the Three Terraces, their stars aligned like paired eyes, stacked in three tiers to cover the Dipper’s bowl—this is called the Celestial Stairway. Whoever beholds them shall be free from imprisonment in life and the sufferings of drowning in death. Within the Dipper resides the August Emperor, two stars as large as chariot wheels. Whoever beholds them shall preserve their form in the world and attain long life as an immortal. Surrendering to this scripture and offering one’s heart to the Northern Culmen shall evoke a response from the unseen.\n\nAnnotation states: The Northern Asterism is the North Star. Among the five asterisms, it is the Emperor’s Seat, ever unmoving while all other stars revolve around it. The Northern Dipper resides at heaven’s center, serving as its pivot, turning the four seasons. All matters of heaven and earth, sun and moon, the five planets, the stellar arrays, the six jia, the twenty-eight lodgings, the host of immortals and perfected beings, and the people of the lower realm—from the Son of Heaven to the common folk—whether concerning longevity, wealth, life, death, fortune, misfortune, or the affairs of the unseen, all fall under the Northern Dipper’s governance. The Most High transmitted to Heavenly Master Zhang the *Northern Dipper Scripture’s Oral Instructions*. In times of peril, one should urgently petition the Northern Dipper, pay homage to the True Lord of one’s life-star, and thereby attain peace and safety. One may also attain the Three Terraces’ life-giving, nurturing, and protective blessings. The Three Terraces consist of six stars: the Upper, Middle, and Lower Terraces. The Celestial Stairway is the path by which the Most High ascends and descends, spanning the second star of the Northern Dipper. The Upper Terrace is *Xu Jing*, the Middle Terrace *Liu Chun*, and the Lower Terrace *Qu Sheng*—these are the stars’ inner names. Knowing the stars’ names dispels all evils and brings all virtues to fulfillment. Beholding their forms ensures freedom from imprisonment in life and all sufferings in death. In a quiet chamber, sit upright and visualize the Three Terraces above your head. Then visualize the qi of your two kidneys rising from your chest to connect with the Three Terraces. After prolonged visualization, tap your teeth fourteen times, exhale gently through your nose, close your mouth, and swallow fully. Then recite the incantation:\n\n*\"Joint by joint, flourishing and glorious,\nI beseech long life.\nGreat Mysterious Three Terraces,\nEver cover my form.\nIn all goings and comings,\nMay the myriad spirits escort my glory.\"*\n\nAfter five years of pacing the stars, the immortal bones naturally form. After seven years, all elixirs become refined. After ten years, one ascends to the Celestial Court. *Swiftly, swiftly, in accordance with the statutes and ordinances.*\n\nOne may kowtow in reverent gaze and worship, and all affairs will come to fruition.\n\nMoreover, the Northern Dipper is the spirit and essence of yin and yang. Its radiance illuminates the nine Dao, its light shades the ten heavens—seven manifest, two concealed. Ordinary people see only the seven stars and not the two honorable imperial stars. These two stars are the *Fuxi* and *Bixie*, the August Morning Lords, the majestic spirits of Heaven’s hun-soul and Earth’s po-soul. The *Fu* star governs Heaven and is called *Chang*. The *Bi* star governs Earth and is called *Kong*. *Kong* is the hun-essence of the nine heavens; *Chang* is the po-spirit of the nine earths. When Heaven rests and Earth is at peace, *Kong* and *Chang* remain hidden. When Heaven is in turmoil and Earth is roused, *Kong* and *Chang* shine brilliantly. They transform the myriad qi, alter yin and yang, and govern the succession of the four seasons—nothing occurs without their agency.\n\nThese two stars are supremely noble, concealed at dawn’s splendor. Even the nine heavens guard their numinous sounds, keeping them from the world. Only those who attain the Dao—lofty immortals and noble perfected beings—may behold them. Those who pursue fame, chase profit, or wallow in the filth of the vulgar world are not illuminated by their starlight and can scarcely glimpse them. In the past, there have been those who mistakenly saw them. If common folk today mistakenly see them, they must not speak of it. To reveal it is to invite the scourge of war and fire, to suddenly take form and suffer in the earth-prisons of hell, and to bring suffering upon their parents in life and death before the Three Officials.\n\nThe method of reverent gazing is as follows: On the third and twenty-seventh nights of each month, without others knowing, secretly go to the central courtyard, burn incense, perform rites, and recite the incantation:\n\n*\"Honorable Imperial Two Stars,\nNuminous spirits of the Northern Culmen,\nMay your servant soon behold you,\nAnd upon seeing, attain long life.\nBoundless fortune and blessing,\nHeaven grants enduring years.\"*\n\nSincerely recite this scripture again and again, and in silence, resonance will arise. With time, you will naturally behold them. Yet you must not reveal the name of the Celestial Pivot star, which lies within the Dipper’s hub, its form opposite the *Breaker of Armies* star. This star is slightly larger and reddish. In each double-hour, it follows the Dipper’s handle to illuminate one of the twelve earthly branches, ceaselessly revolving without pause. As the scripture says: *\"Where the Celestial Pivot points, day and night it ever turns.\"*\n\nThunder’s city is arrayed according to the twelve earthly branches, with twelve gates. When thunder desires to sound, it follows the Celestial Pivot, and the gate toward which it points at that hour is where the sound issues forth. For example, if the Celestial Pivot rests in the *wei* position, pointing toward the *chou* palace, why then does fortune or misfortune arise? The Celestial Pivot is the upright qi—it can give life or take it. Where it points is the life direction, and thus there is life qi. Harnessing it can cure illness, replenish deficiency, calm the spirit, invigorate qi, avert misfortune, dispel calamity, prolong life, and deliver from peril. Where it resides, there is killing qi. Using it can decapitate ghosts, expel demons, suppress violence, restrain brutality, sever poison, and subdue malevolent spirits. Thus, where it points is auspicious; where it resides is inauspicious.\n\nIn principle: The nine luminaries and Three Terraces are the sovereigns of the body and the pivot of the myriad phenomena. Scholars should worship and petition them according to the method, and there will be no lack of response.\n\nAn explanation: The Three Terrace stars are to be revered and exalted. As for the two honorable imperial stars within the Dipper, what are they? They are the hun-soul of Heaven and the po-soul of Earth, the pivot of creation. Yet Daoist practitioners only know the sincerity of worshipping the perfected and paying homage to the Dipper, without understanding the swift path to gazing upon the two honorable imperial stars. There is also the Celestial Pivot star behind the Northern Dipper, which follows the opening of the thunder gates to point to the twelve gates corresponding to the twelve double-hours. The scriptural meaning is clear: where it points is auspicious; where it resides is inauspicious—that is, the thunder gates. Scholars who wish to pay homage to the Dipper and gaze upon the stars will find the method in the annotations. Beholding them ensures longevity and profound fortune.\n\nAn ode:\n*The mysteries of the Dark Gate are said to be profound.\nWhen merit and conduct are complete, one pays homage to the nine luminaries.*\n\nThe Heavenly Worthy said: In this age of decline, the Dao is faint, and people lack virtue. They are disloyal to their sovereigns, unfilial to their parents, disrespectful to their teachers and elders, unkind to their siblings, unfaithful to their spouses, unrighteous to their friends, unawed by Heaven and Earth, unheeding of the gods, irreverent toward the Three Luminaries, and careless with the Five Grains. They possess three bodily and four oral transgressions: using large scales and small measures, killing living beings and harming lives—one hundred for others, a thousand for themselves—engaging in licentiousness, deceit, rebellion, and treachery. From minor to grave, the Three Officials wield their brushes, the Great Unity sends forth documents, and they are handed over to the Bureau of Five Thunders for execution and investigation. First, their spirits are beheaded; then, their forms are examined. Beheading the spirit and executing the hun-soul leaves them in disarray. They become despised, shunned, resented, and hated by others, until their forms are examined and their corpses shattered, leaving them in ruins. They are driven into rolling waters, forced to pull carts, their monthly orifices inspected every ten days, and subjected to repeated torture.\n\nIf one hears this scripture, their sins are immediately erased. Should someone incur the wrath of thunder, their corpse cannot be lifted, and they are not received by water or fire. One should invoke the *Nine Heavens Responding to the Primordial, Thunder’s Voice, Universal Transformation Heavenly Worthy*, and recite this prayer: *\"May the myriad spirits bow their heads and heed my command.\"*\n\nAn annotation: If a person commits an offense, they rightfully deserve execution—how could the Thunder Bureau of the Celestial Court strike them down one by one? Those who now suffer punishment by law, perish by the sword, drown in water, or die in fire—all these are deaths by misfortune. For people begin with minor wrongs and, failing to reform, accumulate them day by day and month by month, until they become grave transgressions. Once their sins are manifest and they still do not repent, the Three Officials and the Great Unity examine and record them, sending documents to the Five Thunders’ Bureau, which first beheads their spirits and hun-souls. When the appointed time arrives, the punishment is carried out, and their dead souls are then subjected to the Thunder Bureau’s driving, beating, and torture.\n\nIf one reforms, turns toward goodness, and surrenders to this scripture, their sins are immediately erased. If a man or woman incurs the wrath of thunder, and their headdress, hair, or beard is not singed, they may appeal to the Heavenly Worthy and seek divine judgment, for the myriad spirits will heed their command.\n\nThe Exposition states: The Three Bonds and Five Constants are principles immutable through the ages—how could one dare defy them with reckless conduct? Grain is the people’s life and the nation’s treasure—how could it not be cherished and protected? In recent times, shallowness prevails: loyalty and filial piety are abandoned, righteousness and benevolence forsaken. Extravagance is exalted while frugality is despised; morality is scorned while deceit is practiced. Such governance invites calamity upon calamity. Why not reflect? The Heavenly Worthy has graciously opened the great path—one should tread and follow it, and all evils shall cease to arise.\n\nThe Exegesis states: Born between Heaven and Earth, humans receive the two qi and embody the Five Constants. Walking the path of benevolence and righteousness, upholding loyalty and filial piety—why then indulge in reckless disregard for life and commit all manner of unprincipled acts? In grave cases, the Thunder Bureau vents its wrath, exposing corpses in the marketplace; in lesser ones, the courts impose punishment upon the body. Thus, goodness may be practiced, but evil must not be committed. The Thunder Bureau drives and enslaves the unrighteous, while those who cultivate virtue are naturally preserved and delivered. Should one invoke the name of the Heavenly Worthy, all spirits will bow and heed their command.\n\nThe Eulogy states:\nLoyalty and filial piety form the foundation,\nYin and yang are my true home.\nTo dissolve all karmic misdeeds,\nOne need not recite the *Nanhua*.\n\nThe Heavenly Worthy declares: The merit of this scripture is inconceivable. In kalpas past, the Divine King of Jade Purity of the Divine Empyrean, the Great Emperor of Long Life, once proclaimed it. Those of noble virtue who transmit this scripture must offer gold and silk as tokens, swearing oaths to Heaven before passing it on.\n\nThe Thunder Master Haoxi, rising from his long prostration, reverently addressed the Heavenly Worthy: Wherever this scripture resides, the Earth Deities and Life Mandates shall guard and protect it, while the Thunder Bureau shall descend to inspect and examine in due time. If a household enshrines this scripture with utmost sincerity, auspicious mist will fill its courtyard, propitious clouds will shade its halls, misfortunes will not arise, and blessings will gather. Upon death, they shall not pass through hell. Why is this so? At death, they are reborn; in life, they return to the good Dao, inheriting the Heavenly Worthy’s power and attaining this spiritual efficacy. Carrying this scripture in daily life, all people will revere them, and ghosts and spirits will stand in awe. When encountering peril, wholeheartedly invoking the name of the Nine Heavens’ Responsive Primordial Thunder Voice Universal Transformation Heavenly Worthy will ensure deliverance from all dangers.\n\nThe Annotation states: The Heavenly Worthy, moved by great compassion, expounded this precious scripture to benefit the heavens above and deliver all beings below. Those of noble virtue who receive it must offer gold and silk as tokens to affirm their sincerity, swearing oaths to the Ten Heavens before transmission. The gold and silk serve only to bind the heart in oath to Heaven—quantity is not the measure. Though the offerings be modest, the covenant is weighty. The Great Sage does not withhold this scripture out of stinginess but fears that people might treat it lightly; thus, He earnestly instructs. The Thunder Master should command the Earth Deities and Life Mandates to guard and protect it everywhere. If one serves the Heavenly Worthy, reciting the scripture’s name with devotion, the divine perfected will descend to their courtyard, and auspicious clouds will swirl. Those who uphold the true teachings in life shall, in death, return to the good Dao. Further, if one transcribes this scripture according to the prescribed talismanic forms, carries it with utmost sincerity, no calamities will arise, and both humans and spirits will revere and stand in awe.\n\nThe Exposition states: The intent of this chapter is to inspire sincere faith without deceit. Later scholars and gentlemen should follow the scripture’s teachings, and they shall not err.\n\nThe Exegesis states: The Thunder Master Haoxi, bowing in reverence to the Heavenly Worthy’s supreme transformation, was overcome with joy. Rising from his long prostration, he again addressed the Heavenly Worthy: From this day forward, those of noble virtue who receive this scripture must pledge their hearts with gold and silk before transmitting its text. Wherever this scripture resides, the Earth Deities and Life Mandates shall guard and protect it, while the Thunder Bureau shall descend to inspect and examine in due time. Those who recite and uphold it shall bring blessings to their households and enable their ancestors to ascend. Those who carry it will be revered by all, feared by ghosts and spirits, and upon encountering danger, invoking the Heavenly Worthy’s name will ensure deliverance. Thus, the merit of this scripture is truly inconceivable.\n\nThe Eulogy states:\nNot gold but a sincere heart is prized,\nFor the beginning adept, external demons assail.\nIf one is willing to swear oaths to Heaven and Earth,\nSwiftly shall you hear the jade tones of the Dao.\n\nThen the Thunder Master Haoxi, before the Heavenly Worthy, spoke this gatha:\nSupreme Jade Purity King,\nRuler of the thirty-six heavens.\nNine Heavens’ Universal Transformation Lord,\nManifesting forms across the ten directions.\nWith unbound hair riding a qilin,\nBarefoot treading layered ice.\nHolding the qi of the Nine Heavens,\nWhistling winds, lashing thunder.\nWith the power of wisdom,\nSubduing all demonic spirits.\nDelivering souls from eternal night,\nBenefiting all beings.\nLike the silver river’s waters,\nA thousand eyes, a thousand moon wheels.\nVowing in future kalpas,\nTo eternally exalt the Heavenly Worthy’s reverence.\n\nWhen the Thunder Master Haoxi finished this gatha,\n\nThe Annotation states: In this chapter, the Thunder Master Haoxi, suddenly enlightened, spoke this gatha to extol even a fraction of the Heavenly Worthy’s great virtue of cherishing life. Its literary grace flows brightly, its language resplendent—its merit and power defy description.\n\nThe Exposition states: The virtue of the Heavenly Worthy is beyond comprehension; thus, the Thunder Master Haoxi likened it to the Silver River. He spoke of the Heavenly Worthy’s primordial qi as supremely pure, noble, sagely, and luminous.\n\nThe Exegesis states: The Thunder Master Haoxi, his heart humbled by the divine efficacy, could find no words of praise sufficient. Thus, he composed this gatha. Our Heavenly Worthy, sovereign of the thirty-six heavens, transforms the vastness of the ten directions. When traversing the heavens, He rides a qilin with unbound indigo hair. When breaking through the Nine Springs, He treads layered ice with bare feet. \"Holding the qi of the Nine Heavens\" refers to the golden radiance of His ruyi scepter. Whistling winds and lashing thunder are the Heavenly Worthy’s commands. Slaying demons, expelling evil, delivering beings, and benefiting humanity—this is the Heavenly Worthy’s work of benefiting all beings. The waters of the Silver River are unseen by mortals, unfathomable in their mystery. \"A thousand eyes, a thousand moon wheels\" means that those who return to the teachings shall feel as though the Heavenly Worthy is ever before them.\n\nVowing with boundless resolve, they shall forever propagate the teachings of the Heavenly Worthy.\n\nPraise:\nWe extol the Heavenly Worthy—truly, this gatha is sincere.\nUniversally transforming without limit, from the primordial kalpas, one qi.\n\nThe Heavenly Worthy declares: This scripture has been transmitted through the world, yet mortals remain unaware. Now, the Nine Heavens’ Responding-to-the-Primordial Palace, which I govern, is served by the Nine Heavens’ Thunder Gate Envoys, assisted by the Recorders of Slanted Records and the Inspectors of Integrity. There are also four bureaus: the first is the Bureau of Surplus Seizures, the second the Bureau of Accumulated Arrests, the third the Bureau of Hidden Grievances, and the fourth the Bureau of Karmic Retribution. Each is overseen by a Grand Minister to manage its affairs. All whom I govern—ministers, masters, and envoys—all praise the primordial transformation.\n\nAnnotation:\nThe Heavenly Worthy speaks of the officials, soldiers, generals, and scribes under His governance, assigning each to their duties of good and evil. Thus, the pivot of life and death lies entirely in the Heavenly Worthy’s commands; the myriad spirits of the Three Realms all obey without exception.\n\nExegesis:\nThis chapter reveals that the Heavenly Worthy assigns each good and evil deed to its respective office, all of which praise and fulfill the primordial transformation.\n\nExposition:\nThis chapter concludes the scripture’s discourse, anticipating that later scholars may not know the offices under the Heavenly Worthy’s governance. Thus, they are listed here. For all prayers and petitions, the officials, officers, generals, and soldiers, upon hearing the Heavenly Worthy’s commands, all praise and fulfill the primordial transformation.\n\nPraise:\nOffices established, duties divided to wield thunder and lightning,\nWind and fire soar, commands resound with clarity.\nRewarding good and punishing evil as swiftly as shadow follows form—\nThe Nine Heavens’ Primordial never bends to mortal whim.\n\nWhen the Heavenly Worthy finished expounding this scripture, a seven-jeweled jade terrace of layered tiers appeared, celestial blossoms scattered in profusion, and fragrant jade incense curled in the air. The Heavenly Sovereigns of the ten directions all proclaimed, \"Excellent indeed!\" The dragon deities, ghostly spirits, thunder officials, and the myriad beings of the Three Realms all rejoiced greatly, faithfully receiving and upholding the teachings.\n\nAnnotation:\nOnce the scripture was expounded, the Heavenly Sovereigns and thunder officials, along with all ghostly spirits, praised it with exultation before departing. All of like mind—devout believers and virtuous people—who encounter this precious scripture should purify their hearts and cleanse their thoughts, reciting the true text with utmost sincerity. Thus, calamities shall not arise, and eternal longevity shall be preserved.\n\nExegesis:\nProclaiming the scripture and praising the transformation, the Three Realms and ten directions all attain their desires. Scholars who encounter this precious scripture and jade talismans should purify their hearts, cleanse their thoughts, offer water and flowers, and recite and inscribe them according to the proper method. Then, no misfortunes shall arise, and all virtues shall converge.\n\nNow, those of noble intent align their hearts with Heaven’s will, purify their own minds, peruse the true text, and compose the mysterious script. How can they not devote themselves wholeheartedly to upholding it, thereby magnifying its transformation?\n\nExposition:\nThis precious scripture and jade talismans could not have been bestowed upon the world to transform sentient beings without the decree of the Three Pure Realms’ supreme境 and the command of the Jade Pure True King. Now, the scripture’s purport has been collated and corrected, its annotations made clear; the jade talismans and golden chapters shine brilliantly. How can those who seek divine aid not purify their hearts and cleanse themselves to study the mysterious script?\n\nThe noble adept, Dao-ling, holds the office of Capital Merit, serving in the Left Academy. Employing his own spirit and primordial qi, he binds them into radiant accomplishment. On this day, the Heavenly Worthy’s virtue of universal transformation is perfected in scripture, arrayed to the left of the sagely and true. Those who recite this scripture must not treat it with irreverence—great offenses invite heavenly punishment, while lesser ones bring misfortune.\n\nPraise:\nThe precious scripture is complete—all proclaim, \"Excellent indeed!\"\nDisasters are dispelled, sins absolved; misfortunes depart, blessings arrive.\nThe *Jade Pivot Precious Scripture of the Nine Heavens’ Responding-to-the-Primordial, Thunder Voice, Universal Transformation Heavenly Worthy*, with Collected Annotations, concludes here.\n\nPerfect and Auspicious Mystic Chapter:\nFrom the outset of reciting the scripture, thought after thought, maintain sincerity.\nA thousand truths bow in attendance; ten thousand sages commune in spirit.\nResponding to the Primordial, merging with the formless,\nThe Nine Heavens issue their decree; the Three Realms comply.\nDispelling disasters, repenting transgressions,\nPraying for blessings, prolonging life.\nWhen merit is complete and conduct fulfilled,\nThe Great Dao bears witness.\n\nTalismans:\nWhenever inscribing a talisman, one should burn incense and arouse profound reverence, reciting with utmost sincerity from the beginning of the main scripture through the three chapters, including the chapter for one’s petition. Then, visualize the Heavenly Worthy’s precious form, recite the Heavenly Sovereign’s divine incantation, and inscribe it. At all times, protect the talisman with yellow paper. When using it, unfold it accordingly. The same applies to all subsequent talismanic texts.\n\nChapter One: Cultivating the Dao to Seek Immortality\nChapter Two: Summoning the Nine Numinous and Three Essences\nOn one’s natal day, observe strict purification rites, recite the scripture, invoke the titles, inscribe the talisman, and burn it.\n\nChapter Three: Resolving the Five Phases’ and Nine Luminaries’ Clashes and Conflicts\nChapter Four: Curing Chronic Illnesses, Curses, and Karmic Entanglements\nChapter Five: Dispelling Gossip and Slander\nChapter Six: Warding Off the Supreme August Spirits’ Calamities and Taboos\nChapter Seven: Praying for Offspring, Protecting Childbirth, and Safeguarding Infants\nChapter Eight: Eliminating Raven Demons and Serpent Afflictions\nChapter Nine: Dispelling Malevolent Spirits, Eradicating Demons, and Destroying Sorcerous Hexes\nChapter Ten: Dissolving Gu Poisons and Liberating Ancestral Spirits\nChapter Eleven: Safe Journeys on Water and Land\nChapter Twelve: Praying for Rain, Seeking Clear Skies, and Averting Water and Fire Disasters\nChapter Thirteen: Worshiping the Stars and Paying Homage to the Dipper\nChapter Fourteen: Hearing the Scripture and Eradicating Sins\nChapter Fifteen: Wearing the Talisman to Accumulate Blessings, Commanding Human Respect, and Instilling Ghostly Fear\n\nContinuation of Marriage Talismans:\nWhenever infants are in swaddling clothes, they may be afflicted by the fifteen kinds of ghosts under the Sandalwood Spirit King, causing frequent convulsions. It is fitting to recite this scripture.\n\nAccording to the *Sutra for Protecting All Children* in the Buddhist Canon, the Sandalwood Spirit King’s fifteen ghostly forms roam the world, terrifying infants and young children with various frightening appearances. Those who sincerely recite the scripture and burn the talisman shall avoid this calamity.\n\nFirst: The Mijiuqia Ghost, shaped like an ox, possessing children and causing their eyes to roll.\nSecond: The Mijiawang Ghost, shaped like a lion, possessing children and causing repeated vomiting.\nThird: The Qiantuo, shaped like the Kumāra Deva, frightening children and making their shoulders twitch.\nFourth: The Aboximoluo, shaped like a wild fox, possessing children and causing foam to issue from their mouths.\n\nFifth: The Muzhijia, shaped like a macaque, possessing children and causing their fists to clench without release.\nSixth: The Mozhijia, shaped like a rākṣasī woman, possessing children and causing them to bite their own tongues.\nSeventh: The Yanmijia, shaped like a horse, possessing children and making them prone to weeping and laughter.\nEighth: The Jiamini, shaped like a woman, possessing children and causing them to delight in women.\nNinth: The Libodi, shaped like a dog, possessing children and manifesting various miscellaneous forms.\nTenth: The Fuduna, shaped like a boar, possessing children and causing them to startle in fright and weep while asleep.\nEleventh: The Mandonanti, shaped like a cat, possessing children and making them prone to weeping and laughter in their sleep.\nTwelfth: The Shejiuni, shaped like a crow, possessing children and causing them to refuse milk.\nThirteenth: The Jianzhaboni, shaped like a chicken, possessing children and causing their throats to become obstructed.\nFourteenth: The Muqumancha, shaped like a black fox, possessing children and afflicting them with seasonal febrile illnesses and dysentery.\nFifteenth: The Lanpo, shaped like a snake, possessing children and causing them to hiccup and cry out repeatedly.\n\nThe *Thunder and Lightning Jade Scripture* encountered by Master Xuanyang is thus in its entirety, and thus it must have its origins. Rather than keeping it secret, he has now resolved to print and disseminate it widely, demonstrating his profound aspiration to benefit others. Though I have not met the man, I have already come to know his heart, and I recognize that he is no ordinary person.\n\nYet the supreme Dao is wordless, and the most profound teachings leave no trace. Their spiritual illumination and clarity depend upon the individual. You have already gained insight through written words, but by extending this effort, you may yet attain understanding beyond them. Far better that others should call you one who clings to mere images and texts—this is my deepest hope for you. Strive onward.\n\nWritten on the fifteenth day of the first lunar month in the *guiyou* year of the Zhishun era, by the thirty-ninth-generation Celestial Master, Taixuanzi.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "九天应元雷声普化天尊玉枢宝经集注 经名：九天应元雷声普化天尊玉枢宝经集注。 海琼白真人注、祖天师张真君解义、五雷使者张天君释、纯阳子孚佑帝君赞。 二卷。 底本出处：《正统道藏》洞真部玉诀类。 九天应元雷声普化天尊玉枢宝经集注上 注曰：九者，阳数也，乃天道也。 主於震宫，故东南有九无之说也，即雷师出入之地也。 天者，至大至圣无极无为之炁也。 应者，无物不承天命而生也。 元者，至大也。 又曰万善之长也，乃四时之首也，五行之先也。 雷者，乃天令也。 掌生生杀杀之权，动静人莫可测万神之奉行也。 声者，生也，万物得雷震声而萌也。 又曰天不言以雷代言也。 普者，上天下地四维八荒无形有形也。 化者，天道阴阳运行则为化。 又自无而有自有而无则为化万物生息则为化。 老子云：我无为而民自化。 又云以德化是也。 天尊者，至大至贵之称也。 说者，赞扬也，阐教也，解隐释奥也。 玉者，天地日月之精华，阴阳水火之结秀也。 润而温，宝而贵，万载之不可朽灭也。 枢者，机也，轴也，乃生杀之始由也。 宝者，珍重也。 经者，径也，乃修真入道之要路也。 义曰：斯经以玉枢而名者，乃天地之消息，阴阳之动静也。 元数乃乾元用九之说，而普化天尊居其上，为三界之尊十方之灵明矣。 释曰：天尊发愿广大，化及群生，其德不可量而机不可测也。 故以雷声代化，玉枢为衡，则善善恶恶杀杀生生皆听於九炁之真王。 所以，三界万灵，十方诸天，莫不皆赞我天尊之元化也。 赞曰：祖炁氤氲满太虚，九天元是九天居。 驱雷役雨飞金篆，活物生人备玉枢。 三界有情同得道，十方无路不通车。 大哉普化明元始，日月齐光信不诬。 尔时九天应元雷声普化天尊， 注曰：九天者，乃统三十六天总司也。 始因东南九炁而生，正出雷门，所以掌三十六雷之令，受诸司府院之印，生善杀恶，不顺人情。 盖以九天之名者，取其阳刚而不泯者之谓也。 应元者，仰惟元始祖劫一炁分真，玉清真王应元之体。 雷者，阴阳二炁结而成雷，既有雷霆，遂分部隶九天雷祖。 因之以剖析为五属，神霄真王用之，以宰御三界。 真王所居神霄玉府，其道在乎巽。 巽者，天　　中之地也，东南乃九阳之炁。 结清朗光，元始父祖，化神霄玉清真王。 玉府在碧霄梵炁之中，去雷城二千三百里。 雷城高八十一丈，左有玉枢五雷使院，右有玉府五雷使院。 天有四方四隅，分为九霄，惟此一霄居於梵炁之中。 在心曰神，故曰神霄，乃真王按治之所。 天尊临莅之都。 卿师使相，列职分司，主天之灾福，持物之权衡，掌物掌人，司生司杀，检押启闭，管钥生成。 上自天皇，下自地帝，非雷霆无以行其令。 大而生死，小而枯荣，非雷霆无以主其政。 雷霆政令，其所隶焉，三清上圣雷霆祖也，十极至尊雷霆本也，昊天玉皇上帝号令雷霆也，后土皇地祇节制雷霆也，北极紫微大帝掌握五雷也。 五雷者，天雷，地雷，水雷，龙雷，社令雷。 又有十雷：一曰玉枢雷，二曰神霄雷，三曰大洞雷，四曰仙都雷，五日北极雷，六曰太乙雷，七曰紫府雷，八曰玉晨雷j 九曰太霄雷，十曰太极雷。 又有三十六雷：一曰玉枢雷，二曰玉府雷，三曰玉柱雷，四曰上清大洞雷，五曰火轮雷，六曰灌斗雷，七曰风火雷，八曰飞捷雷，九曰北极雷，十曰紫微璇枢雷，十一曰神霄雷，十二曰仙都雷，十三曰太乙轰天雷，十四曰紫府雷，十五曰铁甲雷，十六曰邵阳雷，十七曰欻火雷，十八社令蛮雷，十九曰地祇呜雷，二十曰三界雷，二十一曰斩圹雷，二十二曰大威雷，二十三曰六波雷，二十四曰青草雷，二十五曰八卦雷，二十六曰混元鹰犬雷，二十七日啸命风雷，二十八曰火云雷，二十九日禹步大统摄雷，三十曰太极雷，三十一曰剑火雷。",
      "translated_text": "**The Jade Pivot Precious Scripture of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy: Collected Commentaries**\n\n**Title:** *The Jade Pivot Precious Scripture of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy: Collected Commentaries*\n*Commentary by:* Haiqiong the White Perfected, *Exegesis by:* Patriarch Heavenly Master Zhang Zhenjun, *Exposition by:* Five-Thunder Envoy Heavenly Lord Zhang, *Eulogy by:* Pure Yang Master, Protector Emperor Jun\n*Two fascicles.*\n*Source text:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Jade Instructions* Category.\n\n---\n\n### *The Jade Pivot Precious Scripture of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy: Collected Commentaries, Fascicle One*\n\n**Commentary states:**\nNine is the yang number, the Dao of Heaven. It governs the *Zhen* Palace, hence the saying of the \"Nine Voids\" in the southeast—this is the realm where the Thunder Master enters and departs. Heaven is the supreme, sagely, boundless, and non-acting *qi*. \"Responsive\" means all things receive Heaven’s mandate to be born. \"Primordial\" is the greatest, the chief of all virtues, the first of the four seasons, and the origin of the Five Agents. Thunder is Heaven’s decree, wielding the power of generation and destruction. Its movements are unfathomable, and the myriad spirits obey its commands. \"Sound\" is life—all things sprout upon hearing the thunder’s roar. It is also said that Heaven does not speak but uses thunder as its voice. \"Universal\" encompasses the four directions, the eight wilds, the formless and the formed. \"Transformation\" is the operation of Heaven’s Dao through yin and yang. It is the shift from non-being to being, from being to non-being, the birth and decay of the myriad things. Laozi said: \"I practice non-action, and the people transform of themselves.\" He also said: \"This is the transformation through virtue.\" \"Heavenly Worthy\" is the most exalted and noble title. \"Scripture\" is praise, the propagation of teachings, the elucidation of mysteries. \"Jade\" is the essence of Heaven and Earth, the sun and moon, the congealed splendor of yin-yang and water-fire. It is moistening and warm, precious and noble, imperishable for ten thousand generations. \"Pivot\" is the mechanism, the axle—the origin of life and death. \"Precious\" means revered. \"Scripture\" is the path, the essential road to cultivating perfection and entering the Dao.\n\n**Exegesis states:**\nThis scripture is named for the *Jade Pivot* because it embodies the ebb and flow of Heaven and Earth, the movement and stillness of yin and yang. The primordial number is the *Qian* trigram’s \"use of nine,\" and the Universal Transformation Heavenly Worthy presides above, supreme among the Three Realms and luminous across the Ten Directions.\n\n**Exposition states:**\nThe Heavenly Worthy’s vows are vast, transforming all living beings. His virtue is immeasurable, his mechanism unfathomable. Thus, he employs thunder’s sound for transformation and the jade pivot as the balance. Good and evil, killing and generation—all are governed by the True King of the Nine *Qi*. Therefore, the myriad spirits of the Three Realms and the deities of the Ten Directions all praise the Heavenly Worthy’s primordial transformation.\n\n**Eulogy states:**\nThe primordial *qi* suffuses the Great Void,\nThe Nine Heavens are truly the Nine Heavens’ abode.\nCommanding thunder and dispatching rain, golden talismans take flight,\nReviving creatures and nurturing life, the jade pivot is complete.\nAll sentient beings in the Three Realms attain the Dao,\nNo path in the Ten Directions is impassable.\nGreat is the Universal Transformation, radiant in primordial beginning—\nSun and moon shine equally, this is no falsehood.\n\n---\n\n**At that time, the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy...**\n\n**Commentary states:**\nThe Nine Heavens govern the thirty-six heavens collectively. Originating from the nine *qi* of the southeast, they emerge from the Thunder Gate, thus presiding over the thirty-six thunder commands. They receive the seals of all bureaus, courts, and halls, generating good and destroying evil without regard for human sentiment. The name \"Nine Heavens\" signifies their yang vigor, which does not perish. \"Responsive Primordial\" reveres the primordial beginning of the ancestral kalpa, when the One *Qi* divided into the true forms, and the Jade Clarity True King embodied the responsive primordial essence. Thunder arises from the conjoining of yin and yang *qi*. With the advent of thunder and lightning, the Nine Heavens Thunder Ancestor divided their jurisdiction. These were further subdivided into five attributes, employed by the Divine Empyrean True King to govern the Three Realms. The True King resides in the Divine Empyrean Jade Palace, whose Dao lies in *Xun*. *Xun* is the earth within Heaven, the southeast being the realm of the nine yang *qi*. Congealing into luminous clarity, the Primordial Father and Ancestor transformed into the Divine Empyrean Jade Clarity True King. The Jade Palace lies within the azure empyrean’s Brahma *qi*, two thousand three hundred *li* from the Thunder City. The Thunder City stands eighty-one *zhang* high, with the Jade Pivot Five-Thunder Envoy Court to its left and the Jade Palace Five-Thunder Envoy Court to its right. Heaven has four directions and four corners, divided into the Nine Empyreans. Only this one empyrean dwells within the Brahma *qi*. That which is in the heart is called *shen*, hence the name *Divine Empyrean*—the True King’s seat of governance, the Heavenly Worthy’s capital. Ministers, teachers, envoys, and officials are arrayed in offices, governing Heaven’s calamities and blessings, holding the balance of things, overseeing life and death, inspecting and sealing, managing the keys of generation. From the Heavenly Sovereign above to the Earthly Emperor below, none can issue decrees without thunder. From life and death to withering and flourishing, none can administer governance without thunder. Thunder’s governance and commands are subordinate to the Three Clarities’ Sagely Thunder Ancestor, the Ten Poles’ Supreme Thunder Origin, the August Jade Emperor of the Vast Heaven who issues thunder’s decrees, the Queen of Earth who regulates thunder, and the Northern Culmen Purple Tenuity Great Emperor who wields the Five Thunders.\n\n**The Five Thunders are:**\nHeaven Thunder, Earth Thunder, Water Thunder, Dragon Thunder, and Earth Rites Thunder.\n\n**The Ten Thunders are:**\n1. Jade Pivot Thunder\n2. Divine Empyrean Thunder\n3. Great Cavern Thunder\n4. Immortal Capital Thunder\n5. Northern Culmen Thunder\n6. Grand Unity Thunder\n7. Purple Palace Thunder\n8. Jade Dawn Thunder\n9. Great Empyrean Thunder\n10. Supreme Ultimate Thunder\n\n**The Thirty-Six Thunders are:**\n1. Jade Pivot Thunder\n2. Jade Palace Thunder\n3. Jade Pillar Thunder\n4. Upper Clarity Great Cavern Thunder\n5. Fire Wheel Thunder\n6. Dipper-Infusing Thunder\n7. Wind-Fire Thunder\n8. Flying Swift Thunder\n9. Northern Culmen Thunder\n10. Purple Tenuity Pivot Thunder\n11. Divine Empyrean Thunder\n12. Immortal Capital Thunder\n13. Grand Unity Heaven-Shaking Thunder\n14. Purple Palace Thunder\n15. Iron Armor Thunder\n16. Shaoyang Thunder\n17. Sudden Fire Thunder\n18. Earth Rites Barbarian Thunder\n19. Earth Spirit Roaring Thunder\n20. Three Realms Thunder\n21. Grave-Severing Thunder\n22. Great Might Thunder\n23. Six Waves Thunder\n24. Green Grass Thunder\n25. Eight Trigrams Thunder\n26. Primordial Hawk-Hound Thunder\n27. Whistling Life Wind-Thunder\n28. Fire Cloud Thunder\n29. Yu’s Step Great Unifying Thunder\n30. Supreme Ultimate Thunder\n31. Sword-Fire Thunder",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1437,
      "start_sentence": 0,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.73102045059204,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "三十二曰内鉴雷，三十三曰外镒雷，三十四曰神府天枢雷，三十五曰大梵斗枢雷，三十六曰玉晨雷。 有三十六神曩，尝陈之於太上之前。 雷法有七十二阶，天地赏善罚恶发生万物皆雷也。 虽阴阳之激剥，亦由神人之兴动，雷呜则雨降矣。 声者，天地之仁声也。 春分五日，雷乃发声，可闻百里，震九天而动九地，惊四海而翻四溟，太上曰：吾不发阴阳之声，吾之大音无以召，故鼓之以雷霆，以声召气也。 雷帝之前，有雷鼓三十六面。 凡行雷之时，雷帝亲击本部雷鼓一下，即时雷公雷神兴发雷声也。 普化天尊者，自浮黎元始天尊生九子，玉清真王化生雷声普化天尊。 天尊以历劫应化，随时示号。 本元始祖劫一炁分真，乃玉清真王，九霄主宰。 一月四辰监观万天，浮游三界九州万国，赏善录愆，是为普化至大至贵也。 义曰：九天虽曰乾数，阳刚而不柔实乃九炁之生处也。 於是结英聚灵，成我玉清真王之化形也。 应元者，天地一炁，阴阳五行，上布下流，无一物不承天命，而得阴阳之炁以所生也。 故曰应元，又何疑矣。 雷之为雷大矣哉，故三界十方天圣地真各有司焉，惟九天玉清真王总治其令也。 声乃炁之用，炁乃声之令，明是辩非，震萌起垫，非雷之令，何 能生也。 普化天尊者，天即我，我即天，发愿广大，化形十方凡诸众生能皈心向道，我当以身身之，非天尊普化而何？ 释曰：是时九炁成形，结为九天，在三十六天之上，十方三界之祖炁也。 所以用九之故，其炁元本乎三清之体，而用乎九天之名宜矣。 应元者，天阳地阴理之然也。 盖我天尊，生乎阳而居於天，其健而刚也。 所以万物生乎地，莫不皆听命於天尊，使物物各得其宜。 世人不知其故，而本元皆出乎天尊之余炁也。 天尊欲人人皆为天尊者，何故惜其炁而应其本元之妙道也。 雷者，类也，是以出万类而起群品也。 孰不知，雷乃阴阳二炁之激剥，却有所司。 馘恶诛邪驱风役雨者何耶？ 凡俗无知，岂识元始生杀之机玉清真王之妙用也。 声者，令也，听也。 天无声则雷霆不行，地无声则草木不萌，人无声则清浊难明。 所以声为一身之本，乃阴阳之元黑也。 天无私，日月垂明。 天有德，人物俱生。 是故我天尊代天行道，德施三界，使清者为圣，浊者为贤。 凡诸有情有形者，俾跻仙阼，共成一炁。 赞曰：九天九天，玄之又玄。 忽尔我后，焂焉我前。 右九天。 二炁虽分阴与阳，玉清高处化真王。 上天下地能相合，阐教分形遍十方。 右应元。 二炁之正，五行之令。 斩鬼诛邪，天人响应。 右雷。 广宣帝德起群生，三界英灵侧耳听。 莫道老天无一语，须知司令有雷呜。 右声。 好生之德不能量，阐教诸天及十方。 高处玉清治雷府，万神朝服礼真王。 右普化。 在玉清天中，与十方诸天帝君，会於玉虚九光之殿，郁萧弥罗之馆，紫极曲密之房。 阅太幽碧瑶之笈，考洞微明晨之书，交头接耳，细议重玄，诸多陪臣左右踧踖。 天尊宴坐，朗诵洞章。 诸天帝君，长吟步虚。 彩女仙妹，散花旋绕，复相引领，游戏翠宫。 群仙导前，先节后铁，龙旅鸾辖，飘讽太空，并集於玉梵七宝层台。 注曰：在者其时也，天尊游於玉清天中，与十方诸天帝君，宴会於玉虚殿馆紫极之房。",
      "translated_text": "32. Inner Mirror Thunder\n33. Outer Overflow Thunder\n34. Divine Mansion Celestial Pivot Thunder\n35. Great Brahmā Dipper Pivot Thunder\n36. Jade Dawn Thunder\n\nThere are thirty-six thunder spirits of old, once arrayed before the Most High. The thunder methods comprise seventy-two ranks, for the heavens and earth reward good and punish evil, and all things arise through thunder. Though it be the clash of yin and yang, it is also the stirring of divine and human agency—when thunder roars, rain descends.\n\nSound is the benevolent voice of heaven and earth. At the spring equinox, five days later, thunder’s voice arises, audible for a hundred leagues, shaking the nine heavens and stirring the nine earths, startling the four seas and churning the four abysses. The Most High said: “Were I not to emit the sound of yin and yang, my great tone would have no means of summoning. Thus I drum forth with thunder and lightning to call forth qi with sound.”\n\nBefore the Thunder Thearch stand thirty-six thunder drums. Whenever thunder is to be deployed, the Thunder Thearch personally strikes the drum of his own division once, and immediately the thunder lords and thunder spirits unleash their thunderous voices.\n\nThe Vast Transformation Heavenly Worthy was born of the nine sons of the Primordial Heavenly Worthy of Floating Radiance. The Jade Clarity Perfected King transformed and gave rise to the Thunder Voice Vast Transformation Heavenly Worthy. Through kalpas of responsive manifestation, the Heavenly Worthy assumes titles in accord with the times. From the original qi of the Primordial Ancestral Kalpa, the qi divided and became perfected, giving rise to the Jade Clarity Perfected King, sovereign of the nine empyreans. For one month and four celestial markers, he oversees the myriad heavens, roaming the three realms and the nine provinces of the ten thousand lands, rewarding good and recording transgressions—such is the Vast Transformation, most great and most noble.\n\nIn principle: Though the nine heavens are said to be the number of qian, yang and firm, yet not yielding, they are in truth the birthplace of the nine qi. Therein, essence gathers and spirit congeals, forming the transformed body of our Jade Clarity Perfected King.\n\nResponsive Origin: The qi of heaven and earth, the yin and yang of the five phases, flow above and below—there is not a single thing that does not receive the mandate of heaven and obtain the qi of yin and yang by which it is born. Thus it is called Responsive Origin—what doubt could there be?\n\nGreat indeed is thunder! Therefore, the celestial sages and earthly perfected of the three realms and ten directions each have their offices, yet the Jade Clarity Perfected King of the nine heavens governs all their commands.\n\nSound is the function of qi; qi is the command of sound. It clarifies right and wrong, shakes the sprouting and raises the submerged—without the command of thunder, how could life arise?\n\nThe Vast Transformation Heavenly Worthy: Heaven is I, I am heaven. With vast and boundless vows, I transform my body throughout the ten directions. For all sentient beings who turn their hearts toward the Dao, I shall embody them in body—what else is this if not the Vast Transformation of the Heavenly Worthy?\n\nExplanation: At that time, the nine qi took form and coalesced into the nine heavens, above the thirty-six heavens, the ancestral qi of the ten directions and three realms. The reason for employing the number nine is that its qi fundamentally arises from the body of the Three Clarities, and its use of the name of the nine heavens is fitting.\n\nResponsive Origin: It is the principle of heaven as yang and earth as yin. Now, our Heavenly Worthy is born of yang and dwells in heaven, firm and unyielding. Thus all things born of earth without exception heed the command of the Heavenly Worthy, so that each thing attains its proper place. Worldly people do not understand this principle, yet their original essence all derives from the surplus qi of the Heavenly Worthy. The Heavenly Worthy desires that all people become Heavenly Worthies—why would he begrudge his qi and not respond to the wondrous Dao of their original essence?\n\nThunder is of a kind, giving rise to the myriad kinds and arousing the multitude of species. Who does not know that thunder is the clash of yin and yang qi, yet it has its overseers? Why does it sever evil, punish perversity, drive winds, and dispatch rain? The common folk, lacking understanding, how could they recognize the mechanism of life and death of the Primordial Beginning or the wondrous function of the Jade Clarity Perfected King?\n\nSound is command, it is hearing. Without sound, heaven’s thunder and lightning would not move; without sound, earth’s grasses and trees would not sprout; without sound, humans could not distinguish purity from turbidity. Thus sound is the root of the self, the primordial darkness of yin and yang.\n\nHeaven is impartial—sun and moon shed their light. Heaven has virtue—all beings are born. Therefore, our Heavenly Worthy acts on heaven’s behalf to enact the Dao, bestowing virtue upon the three realms, so that the pure become sages and the turbid become worthies. For all sentient and formed beings, he enables them to ascend to the immortal ranks and together complete the one qi.\n\nEulogy:\nNine heavens, nine heavens,\nMysterious, again mysterious.\nSuddenly behind me,\nIn an instant before me.\nRight: Nine Heavens.\n\nThough the two qi divide into yin and yang,\nThe Jade Clarity soars high, transforming the Perfected King.\nAbove heaven, below earth, they harmonize,\nSpreading teachings and dividing forms throughout the ten directions.\nRight: Responsive Origin.\n\nThe rectitude of the two qi,\nThe command of the five phases.\nSevering demons, punishing perversity,\nHeaven and humans respond in echo.\nRight: Thunder.\n\nBroadly proclaiming the Thearch’s virtue to arouse the multitude of beings,\nThe heroic spirits of the three realms incline their ears to listen.\nDo not say that old heaven is silent,\nFor you must know the command is in the thunder’s roar.\nRight: Sound.\n\nThe virtue of cherishing life cannot be measured,\nThe teachings spread through all heavens and the ten directions.\nHigh in Jade Clarity, governing the Thunder Bureau,\nThe myriad spirits in court robes pay homage to the Perfected King.\nRight: Vast Transformation.\n\nWithin the Heaven of Jade Clarity, together with the Heavenly Lords of the ten directions, they gather in the Palace of Jade Void and Ninefold Radiance, the Hall of Lush Mist and Expansive Net, the Chamber of Purple Ultimate and Hidden Depths. They peruse the azure-green jade tablets of the Profound Darkness, examine the books of the Luminous Dawn of the Subtle Cavern, whispering intimately of the profound mystery, with many attendant ministers standing respectfully by.\n\nThe Heavenly Worthy sits in tranquil repose, reciting the cavern scriptures. The Heavenly Lords of the ten directions chant the \"Pacing the Void.\" Jade maidens and immortal sisters scatter flowers in circling dance, then lead one another to wander and play in the Emerald Palace. The host of immortals guides the way, with pennants preceding and iron staves following, dragon banners and simurgh chariots soaring through the vast sky, all assembling at the Seven-Treasured Tiered Terrace of Jade Brahmā.\n\nAnnotation: At that time, the Heavenly Worthy roamed within the Heaven of Jade Clarity, feasting with the Heavenly Lords of the ten directions in the Jade Void Palace, the Purple Ultimate Chamber.",
      "overlap_context": "king Thunder\n14. Purple Palace Thunder\n15. Iron Armor Thunder\n16. Shaoyang Thunder\n17. Sudden Fire Thunder\n18. Earth Rites Barbarian Thunder\n19. Earth Spirit Roaring Thunder\n20. Three Realms Thunder\n21. Grave-Severing Thunder\n22. Great Might Thunder\n23. Six Waves Thunder\n24. Green Grass Thunder\n25. Eight Trigrams Thunder\n26. Primordial Hawk-Hound Thunder\n27. Whistling Life Wind-Thunder\n28. Fire Cloud Thunder\n29. Yu’s Step Great Unifying Thunder\n30. Supreme Ultimate Thunder\n31. Sword-Fire Thunder",
      "start_char": 1437,
      "end_char": 2661,
      "start_sentence": 59,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.39807343482971,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "是时，天尊检观太幽碧瑶之箱，稽考洞微明晨之纪。 交头接耳者，盖诸天帝君列坐有次，圣圣相传，共听微密玄玄之言。 彼时诸天帝君，亦各有众多家臣，左右踧踖，恭馑侍焉。 天尊安然高座，朗诵洞章。 诸天帝君深有所悟，各各起座长吟，步虚赞咏天尊之教。 彩女仙妹，散花盘绕於天尊之座，复请天尊往诣翠宫之七宝层台，欲望天尊大演妙法也。 层台即龙凤之座，有七级，皆珍宝饰之，故名七宝层台。 天尊驾兴，白鹤师子，威仪节仗，引导其前。 青龙白虎，六甲六丁，侍卫左右。 九天仙女，十二溪真，陈奏仙乐。 诸天大帝，神君神王，太极真人，副从凤笔龙舆，经游翠宫。 仙仗节钺，龙旗鸾辂，飘飘太空，集聚宝台。 义曰：是时，游玉清，驻宝台，大阐玄文，广宣要语。 天人左右，皆得开心受化，而功行又崇也。 释曰：是时，我天尊在自居之阙，阙中有九光之殿馆阁房位，阅法考书，欲化十方天真帝君，明其大道。 於是天真帝君被德服膺，不知舞蹈。 天尊大悦，欲游外官，诸天韦仙，左右前后，仗钺排旗，引我天尊驻鸾辂於翠宫。 翠宫者，玉清之行宫也。 雷师心怀奏，疑无由以陈。 幸值我天尊登宝台，手举金光明之如意，俯察万类。 赞曰：故把玄，玄一窍开，十方三界应时来。 琼书细阅存元炁，宝笈重宣养本胎。 侍女交头心自会，陪臣踧踖意能裁。 须突演教天花舞，鸾凤飘飘七宝台。 时有雷师皓翁，於仙众中越班而出，面天尊前，俯颤作礼，勃变长跪，上白天尊言：天尊大慈，天尊大圣，为群生父，为万灵师。 今者诸天，咸此良觌，适见天尊阅宝笈，考琼书，於中秘颐，不可缕计。 唯有玉霄一府所统三十六天内院中司、东西华台、玄绾妙阁、四府六院，及诸有司，各分曹局，所以总司五雷天临三界者也。 天尊至皇，心亲庶政，此等小兆，以何因绿得以趋服，愿告欲闻。 注曰：雷师皓黄，乃帝臣元老，卿师重臣也。 玉霄府，即高上神霄天中玉清真王府，居三十六天之上天中。 有五殿，东曰药珠，西曰碧玉，北曰青华，南曰凝神，中曰长生。 又有太一内院，可韩中司，东西二台，四曹四局，外有大梵紫微之阁，仙都火雷之馆。 皆有玉府，左玄右玄，金阙侍中，仆射上相，真仙真伯，卿监侍宸，仙郎玉郎，玉童玉女，左右司麾，诸部雷神，官君将吏，上统三十六天。 东方八天谓高上道寂天，高上阳岐天，高上洞光天，高上紫冲天，高上玉灵天，高上清虚天，高上微果天，高上正心天。 南方八天； 高上道元天，高上太皇天，高上玄冲天，高上极真天，高上梵炁天，高上辅帝天，高上玄宗天，高上历变天。 西方八天：高上左罡天，高上主化天，高上符临天，高上保华天，高上定精天，高上青华天，高上景琅天，高上丹精天。 北方八天：高上安珲天，高上广宗天，高上浩帝天，高上希玄天，高上庆舍天，高上天娄天，高上变仙天，高上升玄天。 东北方高上敬皇天，东南方高上移神天，西南方高上琼灵天，西北方高上升极天。 下镇三十六垒，每方有九阳梵炁，以应一年三十六炁，每十日一炁上应。 天有一帝，统治一炁，天仙神鬼功过，付与本天校勘。 功者列名本天，过者囚於本天天狱。",
      "translated_text": "At that time, the Heavenly Worthy examined the caskets of the Profound Azure Jade, reviewing the records of the Cavernous Subtlety and Luminous Dawn. Those who leaned close in whispered conference were the Heavenly Lords of the ten directions, seated in ordered ranks, sage transmitting to sage, together listening to the subtle and mysterious, the profound and arcane words. At that moment, each Heavenly Lord had his many household ministers standing respectfully by, attending with reverence.\n\nThe Heavenly Worthy sat in serene majesty, reciting the cavern scriptures. The Heavenly Lords, deeply enlightened, rose from their seats one by one, chanting long hymns and pacing the void in praise of the Heavenly Worthy’s teachings. Jade maidens and immortal sisters scattered flowers in circling dance around the Heavenly Worthy’s seat, then entreated the Heavenly Worthy to proceed to the Seven-Treasured Tiered Terrace of the Emerald Palace, desiring that the Heavenly Worthy expound the wondrous Dao. The tiered terrace was the Dragon-Phoenix Seat, with seven levels, each adorned with precious treasures—hence its name, the Seven-Treasured Tiered Terrace.\n\nThe Heavenly Worthy mounted his divine carriage, with white cranes and lions leading the way in solemn procession. Azure dragons and white tigers, the Six Jia and Six Ding spirits, guarded his left and right. The Nine Heavens’ immortal maidens and the Twelve Stream Perfected intoned celestial music. The Heavenly Great Emperors, Divine Lords, Divine Kings, and Supreme Perfected of the Great Ultimate followed in phoenix-scripted chariots and dragon-drawn carriages, traversing the Emerald Palace. Immortal banners and ritual halberds, dragon standards and simurgh chariots soared through the vast sky, assembling at the jeweled terrace.\n\nAnnotation: At that time, roaming the Heaven of Jade Clarity and halting at the jeweled terrace, the Heavenly Worthy grandly expounded the mysterious texts and broadly proclaimed the essential teachings. All the immortals and humans to his left and right opened their hearts to receive his transformation, their merit and practice thereby exalted.\n\nExegesis: At that time, our Heavenly Worthy was within his own celestial abode, where halls and chambers of the Nine Radiance Palace stood arrayed. There, he perused the scriptures and reviewed the canons, desiring to instruct the Heavenly Perfected Lords of the ten directions in the great Dao. Thus, the Heavenly Perfected Lords, robed in virtue and submitting in reverence, knew not how to dance in joy. The Heavenly Worthy, greatly pleased, wished to journey to the outer palaces. The myriad immortals and transcendents, to his left and right, before and behind, with ritual halberds and ordered banners, escorted our Heavenly Worthy to halt his simurgh carriage at the Emerald Palace. The Emerald Palace was the traveling palace of the Heaven of Jade Clarity.\n\nThe Thunder Master, his heart heavy with unspoken petitions, found no means to present them. By good fortune, our Heavenly Worthy ascended the jeweled terrace, raising his golden, radiant ruyi scepter to survey all beings below.\n\nEulogy:\nThus grasping the mysterious, the one aperture of the mysterious opens,\nAnd the ten directions and three realms respond in due time.\nThe jade scriptures are perused with care to preserve the primordial qi,\nThe precious canons are proclaimed anew to nurture the original embryo.\nThe attendant maidens, leaning close, understand in their hearts,\nThe reverent ministers, standing in awe, compose their intent.\nSuddenly, the teachings are expounded, and celestial flowers dance,\nPhoenixes and simurghs soar gracefully above the Seven-Treasured Terrace.\n\nAt that moment, the Thunder Master, Elder Hao, stepped forth from the ranks of immortals, prostrated himself before the Heavenly Worthy, trembling in reverence, and knelt to address the Heavenly Worthy: “Greatly compassionate Heavenly Worthy, greatly sagely Heavenly Worthy, father of all beings, master of the myriad spirits—now, all the heavens enjoy this blessed audience. We have just witnessed the Heavenly Worthy perusing the precious canons and reviewing the jade scriptures, wherein lie boundless secrets beyond enumeration. Yet there is the Jade Firmament Prefecture, which governs the Inner Courts of the thirty-six heavens, the Eastern and Western Flower Terraces, the Mystic Coil Wondrous Chambers, the Four Prefectures and Six Courts, and all their subordinate offices, each with its own bureau and division—altogether, they oversee the Five Thunder Heavens’ descent into the three realms. O Most August Heavenly Worthy, your heart is ever close to the affairs of the multitudes. By what cause or condition might these minor omens be made to submit and serve? We humbly wish to hear your teaching.”\n\nAnnotation: The Thunder Master, Hao Huang, was an elder minister of the Celestial Emperor, a venerable preceptor and esteemed official. The Jade Firmament Prefecture was the Jade Clarity True King’s Court in the Highest Divine Firmament Heaven, residing above the thirty-six heavens. It comprised five halls: the Eastern Hall of Elixir Pearls, the Western Hall of Azure Jade, the Northern Hall of Azure Splendor, the Southern Hall of Concentrated Spirit, and the Central Hall of Longevity. There was also the Great One’s Inner Court, the Han Zhong Bureau, the Eastern and Western Terraces, the Four Offices and Four Divisions, and beyond them, the Great Brahmā Purple Tenuity Chambers and the Immortal Capital Fire-Thunder Halls. All had their jade prefectures, with the Left and Right Mysteries, the Golden Gates’ Chamberlains, the Chief Ministers, Supreme Ministers, Perfected Transcendents, Perfected Lords, Ministers and Attendants of the Celestial Court, Immortal Gentlemen, Jade Gentlemen, Jade Boys and Jade Maidens, Left and Right Commanders, and the various departments of thunder deities—officers, generals, and officials—who together governed the thirty-six heavens.\n\nThe thirty-six heavens were divided as follows:\n**Eastern Eight Heavens:** Highest Dao Tranquility Heaven, Highest Yang Qi Heaven, Highest Cavernous Radiance Heaven, Highest Purple Impulse Heaven, Highest Jade Numinosity Heaven, Highest Clarity and Emptiness Heaven, Highest Subtle Fruit Heaven, Highest Rectified Heart Heaven.\n**Southern Eight Heavens:** Highest Dao Origin Heaven, Highest Great August Heaven, Highest Mystic Impulse Heaven, Highest Ultimate Perfection Heaven, Highest Brahmā Qi Heaven, Highest Imperial Assistant Heaven, Highest Mystic Ancestry Heaven, Highest Sequential Transformation Heaven.\n**Western Eight Heavens:** Highest Left Constellation Heaven, Highest Governance and Transformation Heaven, Highest Talisman Advent Heaven, Highest Preservation and Splendor Heaven, Highest Essence Stabilization Heaven, Highest Azure Splendor Heaven, Highest Scintillating Jade Heaven, Highest Cinnabar Essence Heaven.\n**Northern Eight Heavens:** Highest Peace and Radiance Heaven, Highest Vast Ancestry Heaven, Highest Vast August Heaven, Highest Hopeful Mystery Heaven, Highest Celebratory Abode Heaven, Highest Celestial Tower Heaven, Highest Transformation and Immortality Heaven, Highest Ascending Mystery Heaven.\n**Additional Heavens:** Highest Reverent August Heaven in the Northeast, Highest Spirit Shifting Heaven in the Southeast, Highest Jade Numinosity Heaven in the Southwest, Highest Ascending Ultimate Heaven in the Northwest.\n\nBelow, they oversaw the thirty-six ramparts, with each direction possessing nine yang Brahmā qi, corresponding to the thirty-six qi of the year, each qi ascending in ten-day cycles. Each heaven had its emperor, who governed one qi, and the merits and transgressions of heavenly immortals, spirits, and ghosts were submitted to their respective heavens for judgment. Those with merit were recorded in their heaven’s register, while those with transgressions were imprisoned in their heaven’s celestial dungeon.",
      "overlap_context": "ircling dance, then lead one another to wander and play in the Emerald Palace. The host of immortals guides the way, with pennants preceding and iron staves following, dragon banners and simurgh chariots soaring through the vast sky, all assembling at the Seven-Treasured Tiered Terrace of Jade Brahmā.\n\nAnnotation: At that time, the Heavenly Worthy roamed within the Heaven of Jade Clarity, feasting with the Heavenly Lords of the ten directions in the Jade Void Palace, the Purple Ultimate Chamber.",
      "start_char": 2661,
      "end_char": 3876,
      "start_sentence": 119,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.19129490852356,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "凡善恶事，三十六垒皇君，奏上神霄玉府而纠察也。 每天各有龙神兴雷，生杀伐暴诛邪，罔不由之。 四府者，九霄玉清府，东极青玄府，九天应元府，洞渊玉府。 六院者，太一内院，玉枢院，五雷院，斗枢院，氏阳院？ 仙都火雷院。 诸有司者，天部霆司，蓬莱都水司，太一雷霆司，北帝雷霆司，北斗征伐司，北斗防卫司，玉府雷霆九司，及诸曹院子司。 凡世间亢阳为雪，风雨不时，干戈妄动，饥馑荐臻，皆请命玉府，经由玉枢，大布分野。 兼判三司将兵三界鬼神功过，匡济黎民，应雷霆诸司院府并佐玉枢之令，禀听施行。 至於雷霆斧钺，庆赏刑威，有条不紊，悉有分司。 或曰兼司、行司、巡察官司，皆设曹局官僚任职。 是以玉霄一府，总司五雷天临三界者也。 义曰：天尊以琼书瑶笈，故化天真。 雷师默会天尊之旨，上请方便之门。 一时君臣体异心同无非，活群生之径路也。 诵经君子至此，当以雷师之心为心，其功有自归矣。 释曰：时我天尊登宝台察群品，似言不语。 适雷师皓翁，职专雷府，班越天真，以己心而识上心，故白之於天尊之前。 我天尊德化无边，真元有自，其玄书秘箓，不可条请。 故启三十六天束西二台府院诸司之政，莫不皆总之於玉霄一府。 其雷师皓翁以此举，而发我天尊之未宣者。 雷师启天尊至大至圣心及万品，臣以微陋之材，以何缘由得待玉宸，愿告天尊，明我前劫，以赞元化并玉霄一府之事，当屏气而恭听之。 赞曰：勃然长跪，上启真宗。 诸司院府台阁，尊崇。",
      "translated_text": "All matters of good and evil are reported by the August Lords of the thirty-six ramparts to the Divine Numinous Jade Treasury for investigation and judgment. Each heaven possesses dragon spirits who summon thunder, giving life or executing death, punishing violence and slaying the wicked—nothing proceeds without their authority.\n\nThe Four Treasuries are: the Nine Numinous Jade Clarity Treasury, the Eastern Ultimate Azure Mystery Treasury, the Nine Heavens Responsive Primordial Treasury, and the Cavernous Abyss Jade Treasury. The Six Institutes are: the Supreme Unity Inner Institute, the Jade Pivot Institute, the Five Thunders Institute, the Dipper Pivot Institute, the Celestial Yang Institute, and the Immortal Capital Fire-Thunder Institute. The various administrative offices include: the Heavenly Department Thunder Bureau, the Penglai Capital Water Bureau, the Supreme Unity Thunder Bureau, the Northern Emperor Thunder Bureau, the Northern Dipper Punitive Expedition Bureau, the Northern Dipper Defense Bureau, the Jade Treasury Nine Thunder Bureaus, and the various subordinate offices and departments.\n\nWhenever the world suffers from scorching yang, untimely winds and rains, reckless warfare, or repeated famines, petitions are submitted to the Jade Treasury, passing through the Jade Pivot, to be widely proclaimed across the celestial divisions. Concurrently, the Three Bureaus judge the merits and transgressions of the generals and soldiers, the ghosts and spirits of the Three Realms, aiding and rescuing the common people. All thunder-related offices, institutes, and treasuries assist the Jade Pivot’s decrees, receiving and executing them accordingly. As for the axes and halberds of thunder, the rewards and punishments, the commendations and executions—all proceed in perfect order, each under its designated office. Some are called concurrent bureaus, mobile bureaus, or inspection offices, all staffed with officials and functionaries.\n\nThus, the Jade Numinous Treasury alone governs the Five Thunders’ descent upon the Three Realms. In principle: the Heavenly Worthy, with jade scriptures and numinous texts, transforms the celestial perfected. The Thunder Masters silently comprehend the Heavenly Worthy’s intent, petitioning for the gates of expedient means. At such times, lord and ministers, though differing in form, share a single heart—nothing but opening the paths to enliven all beings. When reciting scriptures, the gentleman should take the Thunder Master’s heart as his own; thus, his merit will naturally find its return.\n\nExplanation: At that time, our Heavenly Worthy ascended the Treasure Terrace to observe all beings, speaking without words. Just then, the Thunder Master, Radiant Elder, whose duty lies in the Thunder Treasury and who surpasses the celestial perfected, discerned the Heavenly Worthy’s heart with his own and thus addressed him. Our Heavenly Worthy’s virtue and transformation are boundless, the true and primordial having their own origin; his mysterious scriptures and secret registers cannot be enumerated in detail. Therefore, he revealed the governance of the thirty-six heavens’ eastern and western terrace treasuries, institutes, and bureaus—none not unified under the Jade Numinous Treasury. Through the Thunder Master Radiant Elder’s initiative, he brought forth what our Heavenly Worthy had not yet proclaimed.\n\nThe Thunder Master petitioned the Heavenly Worthy: “Your heart is most great and most sagely, encompassing the ten thousand kinds. Though I, your minister, am of humble talent, by what cause or reason may I attend the Jade Celestial Court? I beseech the Heavenly Worthy to clarify my former kalpas, that I may assist in the primordial transformation and the affairs of the Jade Numinous Treasury.” One should hold one’s breath and listen reverently.\n\nEulogy: Suddenly rising to kneel, he respectfully addressed the True Ancestor. All offices, institutes, treasuries, terraces, and pavilions—honor and veneration!",
      "overlap_context": "ey oversaw the thirty-six ramparts, with each direction possessing nine yang Brahmā qi, corresponding to the thirty-six qi of the year, each qi ascending in ten-day cycles. Each heaven had its emperor, who governed one qi, and the merits and transgressions of heavenly immortals, spirits, and ghosts were submitted to their respective heavens for judgment. Those with merit were recorded in their heaven’s register, while those with transgressions were imprisoned in their heaven’s celestial dungeon.",
      "start_char": 3876,
      "end_char": 4459,
      "start_sentence": 161,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.30043601989746,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "三十六所。 云雷雨风。 何神不备何圣不从。 职专生杀，事在吉凶。 欲闻至说，必启丹衷。 仁哉仁哉，雷师皓翁。 天尊言：雷师皓翁，尔等仙卿，储勋夙世，累行昨生，故得玉府登庸，琼宫简录。 今兹勋行，视夙昨多。 尔其悉力雷司，委心火部。 日复日 岁复岁，勋崇行着，性霁神融，克证高真，即阶妙道。 惟是雷部鬼神，昼劳夕役，动有捶楚。 大则考戮。 屑云雕雪，无有已时，檄龙命鸦，此息彼作，彼所因故，尔其耳焉。 雷师皓翁，及诸天诸仙，耸耳而默。 天尊所坐九凤丹霞之扆，手举金光明之如意，琅风清微，绮云郁丽。 天尊寂然良久。 注曰：雷司布令行事，疾如风火，不可留停。 降泽之处有方，震雷之声有数，可旱即旱，可雨即雨，必奉帝勑。 其雷司所行，鬼神何以致也？ 盖此等之人，居尘世之上，不忠不孝，不仁不义，不礼三宝，不修五常，不惜五谷。 所以身没之后，听我雷司之驱役，实此等罪报也。 闻天尊所说善恶因绿，雷师皓翁及诸天诸仙启耳悚惧。 天尊所坐之时，其神风琅琅然而清微，彩云郁郁然而华丽，沉静良久，欲对仙众再演玄文也。 义曰：善根宜种，恶业莫生，天真尚然，累功积行，何况后学君子可不尽心乎。 释曰：雷师皓翁，与天地同体，日月齐明。 是以天尊言储勋夙世有大功，於初始之先行，既累着而得精炁，遂化成形，故得玉府进用琼宫有名矣。 今又掌善司恶，分化济人，其功不少。 所以尽心於火部者，乃雷师皓翁之本情也。 加之日积月增，名高行显，以全元炁，则性霁神融之不虚言也。 以是能与高上真王为明证之臣，遂列大道之阶。 天尊以善 恶两途论诸天真，复引雷部鬼神昼劳夕役周而复始无有休息。 所言屑云； 谓其奔走四方搏云作阵之劳。 雕雪者，其冒冻乘风凝雨作花之苦也。 至於入海檄其龙，走林命其鸦，东作西止，东伏西兴，无有息时，此善恶之因故明矣。 天尊是时语雷师曰：吾得权大化位上真，盖心先缝此道，故得如是也。 尔等欲升仙阼，赞化玄文，以吾之功为功，则道自成矣，尔今听焉。 诸天帝君闻如是说，皆耸耳而敬听也。 天尊之威仪，不可宣说，即有神风绮云清朗郁丽，天尊与九炁复合为一，寂然而不动也。 赞曰：善恶两途，特如影响。 善为天真，恶为魍魉。 天尊言：吾昔於千五百劫，以先心缝此道，遂位上真，意酿此功，遂权大化。 尝於大罗元始天尊前，以清浄心，发广大愿，愿於未来世，一切众生，天龙鬼神，一称吾名，悉使超涣。 如所否者，吾当以身身之。 尔等洗心，为尔宣说。",
      "translated_text": "The Thirty-Six Offices—clouds, thunder, rain, and wind—what spirit is not complete, what sage does not follow? Their duties govern life and death, their affairs determine fortune and misfortune. To hear the supreme teaching, one must reveal the cinnabar heart.\n\nHow benevolent! How benevolent! Thunder Master Radiant Elder.\n\nThe Heavenly Worthy spoke: “Thunder Master Radiant Elder, you and the immortal ministers have stored merit from former lives and accumulated deeds from past existences. Thus, you were promoted to the Jade Treasury and recorded in the Jasper Palace. Now, your meritorious deeds surpass those of former times. Devote yourselves wholly to the Thunder Bureau and entrust your hearts to the Fire Department. Day after day, year after year, as merit accumulates and conduct shines, your nature will clear and your spirit harmonize. You will then attain the rank of High Perfected and ascend the wondrous Dao.\n\nYet consider the ghosts and spirits of the Thunder Department: they toil by day and labor by night, ceaselessly driven. Some endure beatings; in grave cases, they face execution. Like chiseled clouds or carved snow, their tasks never end. Summoning dragons and commanding crows, when one task ceases, another begins. You must heed the causes of their suffering.”\n\nThunder Master Radiant Elder and all the gods and immortals of the heavens pricked up their ears in silence.\n\nThe Heavenly Worthy sat upon the Nine-Phoenix Cinnabar-Radiance Screen, raising a golden luminous ruyi scepter. A pure, cool breeze arose, and resplendent clouds gathered in lush beauty. The Heavenly Worthy remained still for a long while.\n\n*Annotation:* The Thunder Bureau issues commands and executes affairs with the swiftness of wind and fire, allowing no delay. Where blessings descend, there is direction; the sound of thunderclaps follows measure. Whether to bring drought or rain, all must obey the imperial decree. How do the ghosts and spirits of the Thunder Bureau carry out their tasks? These are people who, while dwelling in the dusty world, were disloyal, unfilial, unkind, and unjust; who disrespected the Three Treasures and neglected the Five Constants; who wasted the Five Grains. Thus, after their bodies perish, they are subjected to the Thunder Bureau’s drudgery—this is the retribution for their sins.\n\nHearing the Heavenly Worthy expound the causes of good and evil, Thunder Master Radiant Elder and all the gods and immortals of the heavens listened with ears alert and hearts trembling.\n\nAs the Heavenly Worthy sat, a divine wind arose, pure and cool, while vibrant clouds gathered in splendid beauty. After a long silence, he prepared to address the assembly of immortals once more.\n\n*Exegesis:* Good roots should be planted; evil karma must not arise. Even the Heavenly Perfected accumulate merit and cultivate conduct—how much more should later scholars and gentlemen devote themselves wholeheartedly?\n\n*Exposition:* Thunder Master Radiant Elder shares the same body as heaven and earth, his brightness equal to the sun and moon. Thus, the Heavenly Worthy spoke of his stored merit from former lives and great deeds performed before the primordial beginning. Having long accumulated and refined his essence and qi, he transformed into form and was thus promoted to the Jade Treasury and recorded in the Jasper Palace. Now, he oversees the Bureau of Good and Evil, dispensing transformation and aiding others—his merit is no small matter. His wholehearted devotion to the Fire Department is his true nature. With each passing day and month, his name grows loftier and his conduct more illustrious. By preserving his primordial qi, the words “his nature clears and his spirit harmonizes” are no empty phrase. Thus, he becomes a minister of evidential proof to the Highest Perfected Kings and ascends the ranks of the Great Dao.\n\nThe Heavenly Worthy discussed the two paths of good and evil for the Perfected of the heavens, then recounted how the ghosts and spirits of the Thunder Department toil day and night without rest. “Chiseled clouds” refers to their labor in rushing to the four directions, shaping clouds into formations. “Carved snow” describes their suffering as they brave freezing winds and congealed rain to craft frost-flowers. When they enter the sea to summon dragons or traverse forests to command crows, their tasks shift ceaselessly—east to west, rising and falling without pause. Thus, the causes of good and evil are made clear.\n\nAt that moment, the Heavenly Worthy addressed the Thunder Master: “I attained the rank of Great Transformation Perfected and Highest Perfected because my heart first aligned with this Dao. You, too, must take my merit as your own if you wish to ascend the immortal throne, assist in the transformation of the mysterious scriptures, and accomplish the Dao. Now, listen well.”\n\nAll the Heavenly Thearchs, hearing these words, pricked up their ears in reverent attention. The Heavenly Worthy’s majesty defies description: a divine wind arose, and resplendent clouds shone in pure, lush beauty. The Heavenly Worthy and the Nine Qi merged as one, still and unmoving.\n\n*Eulogy:* The two paths of good and evil are as distinct as echo and shadow. Good becomes Heavenly Perfected; evil becomes demons and specters.\n\nThe Heavenly Worthy said: “In a former kalpa fifteen hundred eons past, my heart first aligned with this Dao, and I attained the rank of Highest Perfected. My intent nurtured this merit, and I gained authority over the Great Transformation. Once, before the Primordial Heavenly Worthy of the Great Ultimate, I vowed with a pure and vast heart: ‘In future worlds, may all sentient beings—heavenly dragons and ghosts—who invoke my name be liberated. If this is not so, may I bear the burden myself.’ Now, purify your hearts, for I shall expound the teaching.”",
      "overlap_context": "en thousand kinds. Though I, your minister, am of humble talent, by what cause or reason may I attend the Jade Celestial Court? I beseech the Heavenly Worthy to clarify my former kalpas, that I may assist in the primordial transformation and the affairs of the Jade Numinous Treasury.” One should hold one’s breath and listen reverently.\n\nEulogy: Suddenly rising to kneel, he respectfully addressed the True Ancestor. All offices, institutes, treasuries, terraces, and pavilions—honor and veneration!",
      "start_char": 4459,
      "end_char": 5435,
      "start_sentence": 184,
      "end_sentence": 230,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.09762668609619,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "注曰：心缝，此道者谓如裁段布帛，若不缝就，焉能为衣。 且天地一点元炁，散遍太虚六合，人禀父母一点元炁在身，即是祖宗之遗体也。 若修之智慧，定观清浄之心，收聚七宝，结成还丹，是谓以心缝合成其大道而位证上真。 又以天地化醇之炁，大道混合冲和之妙，酿成巨功，遂权大化，提挈天地，隐显莫测。 天尊於大罗元始天尊前，发广大愿，愿一切众生，天龙鬼神，一称名者，悉使超涣。 如所否者，天尊当以身身之。 此足见天尊普护人天，发弘誓愿也。 义曰：幸得人身，不可蹉过，当守是道，而诵是经，日就月将，与道合体，非小补哉。 释曰：得道之难，合道之不易也。 我天尊昔於五百劫之初，心先合此道，即九炁之生形也。 故称曰真王，遂掌大化。 我天尊曾向大罗元始天尊前，以九天不维之真，发三界无边之愿，期在未来之世，但受九炁之物，有能归吾化称吾名者，皆能起死 回生。 或不信从者，我当以元始一炁化成九炁，以复其初也。 天尊谓诸天帝君曰：尔等当浄其心，吾今为汝等开大道之密绪也。 赞曰：道乃天地心，愚痴不解寻。 破衣要缝补，须用水磨针。 天尊言：尔诸天人，欲闻至道。 至道深窈，不在其他。 尔既欲闻，无闻者是无闻，有见即是真道，闻见亦泯，惟尔而已。 尔尚非有，何况於道？ 不闻而闻，何道可谈？ 注曰：至道者不在其他，在自己也。 尔既欲闻，若明自己之道，即是不必闻也。 是云无闻者是无闻，有见即是真道。 若闻他人之说自己，有见即是真道，闻见亦泯皆不铃闻见矣。 若谓非有，既不闻道而欲闻，不可与谈道矣。 义曰：大道无形，无我无彼，有无无有，即是真道也。 有为有形，道在何处？ 入道之士，当於无无处着脚。 赞曰：道道道道，说着可笑。 天地我人，一家一窍。 天尊言：道者，以诚而入，以默而守，以柔而用。 用诚似愚，用默似讷，用柔似拙。 夫如是则可与忘形，可与忘我，可与忘忘。 入道者知止，守道者知谨，用道者知微。 能知微则慧光生，能知谨则圣智全，能知止则泰定安。 泰定安则圣智全，圣智全则慧光生，慧光生则与道为一，是名真忘。 惟其忘而不忘，忘无可忘，无可忘者即是至道。 道在天地，天地不知，有情无情，惟一无二。 注曰：道者，乃三界所由之路也。 然入则有由，守必有方，其用固有理也。 盖道乃天地无为之称，即人之真常也。 诚者，端恪不移，无妄之理也。 故惟以无妄之诚，而入於真常之道。 然真常之道，悟者自得，故默识心融而后能守，雍容不迫而后能用。 夫入不能守则非所谓入，守不能用则非所谓守。 故用真实者，如愚而默，雍和而不刚暴，是亦如拙者何异焉。 然其为愚讷拙也，特如之而已亦，岂真愚讷拙哉。 人能入之守之用之，如是者则不特可与忘物，而亦可以忘我，至於物我俱忘，亦忘其所谓忘矣。 何言乎忘形，我者心不之动，湛然常寂，无彼此之间也。 知者识之，明者见之，真之谓也。 入道而知止，守道而知谨，则固循於道而不离。 用道而知微，则能反约，而不惑於远大。 此其道体之本原，在是而一心之妙用所由生也。 则凡所谓无所不通，无所不知，乃本性之所具者，至此亦复全於我矣。 原其所自，则又皆本诸知止。",
      "translated_text": "**Annotation:** \"Heart-sewing this Dao\" means, like cutting cloth to make garments—without stitching, how can it become clothing? Moreover, the single primordial *qi* of Heaven and Earth disperses throughout the vastness of the Six Directions. Humans receive from their parents a single primordial *qi* within their bodies, which is the legacy of their ancestors. If one cultivates it with wisdom, stabilizes the mind in pure observation, gathers the Seven Treasures, and coalesces the Returning Elixir, this is called \"sewing with the heart to complete the Great Dao and attain the rank of Highest Perfected.\" Furthermore, with the *qi* of Heaven and Earth’s transforming purity and the Dao’s merging with the marvel of harmonious emptiness, one ferments vast merit, thereby wielding authority over the Great Transformation, lifting Heaven and Earth, and becoming unfathomable in concealment and manifestation. Before the Primordial Heavenly Worthy of the Great Ultimate in the Great Canopy, the Heavenly Worthy vowed with a vast and pure heart: \"May all sentient beings—heavenly dragons and ghosts—who invoke my name be liberated. If this is not so, may I bear the burden myself.\" This fully reveals the Heavenly Worthy’s universal protection of humans and celestials, and his vast and solemn vow.\n\n**Exegesis:** Having fortunately obtained a human body, one must not let it slip away in vain. One should uphold this Dao, recite this scripture, and daily progress toward merging with the Dao—is this not of great benefit?\n\n**Exposition:** The difficulty of attaining the Dao lies in the challenge of uniting with it. In the beginning of five hundred kalpas past, our Heavenly Worthy’s heart first aligned with this Dao, which is the formation of the Nine *Qi*. Thus, he was called the True King and came to govern the Great Transformation. Once, before the Primordial Heavenly Worthy of the Great Ultimate in the Great Canopy, our Heavenly Worthy, with the untainted truth of the Nine Heavens, made a boundless vow across the Three Realms: \"In future worlds, any being that receives the Nine *Qi* and turns to my transformation by invoking my name shall be able to raise the dead and restore life. If any do not believe and follow, I shall transform the Primordial One *Qi* into the Nine *Qi* to restore their original state.\" The Heavenly Worthy addressed the Heavenly Emperors and Lords, saying: \"Purify your hearts, for I shall now reveal to you the profound mysteries of the Great Dao.\"\n\n**Eulogy:** The Dao is the heart of Heaven and Earth,\nYet the deluded do not seek to understand.\nA torn robe must be mended—\nOne needs a needle honed by water’s patience.\n\nThe Heavenly Worthy said: \"All you heavenly beings, if you wish to hear the Supreme Dao—the Supreme Dao is profoundly subtle, not found elsewhere. Since you wish to hear it, know that ‘no hearing’ is true hearing, and ‘having perception’ is the true Dao. When hearing and perception vanish, only you remain. You are not even ‘you’—how much less the Dao? To ‘hear without hearing’—what Dao is there to discuss?\"\n\n**Annotation:** The Supreme Dao is not found elsewhere but within oneself. If you wish to hear it, understanding your own Dao means there is no need to hear. Thus, it is said: \"No hearing is true hearing; having perception is the true Dao.\" If you hear others speak of yourself, having perception is the true Dao—yet hearing and perception must both dissolve, for they are not the true hearing or seeing. If you claim there is no ‘you,’ yet seek to hear the Dao, you cannot be spoken to about the Dao.\n\n**Exegesis:** The Great Dao is formless, without self or other, beyond existence and non-existence—this is the true Dao. Where is the Dao in the realm of form and action? Those who enter the Dao must plant their feet where there is no ‘no.’\n\n**Eulogy:**\nDao, Dao, Dao, Dao—\nSpeaking of it is laughable.\nHeaven, Earth, I, and all beings—\nOne family, one aperture.\n\nThe Heavenly Worthy said: \"The Dao is entered through sincerity, guarded through silence, and employed through softness. Using sincerity appears foolish; using silence appears inarticulate; using softness appears clumsy. Only thus can one forget form, forget self, and even forget forgetting. Those who enter the Dao know when to stop; those who guard the Dao know caution; those who employ the Dao know subtlety. Knowing subtlety, wisdom’s light arises; knowing caution, sagely wisdom is complete; knowing when to stop, one attains supreme tranquility and peace. Supreme tranquility and peace complete sagely wisdom; sagely wisdom generates wisdom’s light; wisdom’s light unites with the Dao—this is called true forgetting. Only by forgetting yet not forgetting, forgetting what cannot be forgotten, does one attain the Supreme Dao. The Dao pervades Heaven and Earth, yet Heaven and Earth do not know it. Sentient and insentient beings—all are one, without duality.\"\n\n**Annotation:** The Dao is the path by which the Three Realms proceed. To enter it, there must be a way; to guard it, there must be a method; its employment follows principle. The Dao is the name for Heaven and Earth’s non-action—it is humanity’s true constancy. Sincerity is uprightness without deviation, the principle of no falsehood. Thus, only with the sincerity of no falsehood can one enter the Dao of true constancy. Yet the Dao of true constancy is realized through personal awakening, so one must silently comprehend and harmonize the heart before guarding it, and act with ease and unhurriedness before employing it. To enter without guarding is not true entry; to guard without employing is not true guarding. Therefore, employing the true and real appears foolish in silence, harmonious and not forceful—how is this different from clumsiness? Yet this foolishness, inarticulateness, and clumsiness are merely appearances—how could they be truly so? Those who enter, guard, and employ the Dao in this way can not only forget things but also forget the self. When both things and self are forgotten, even the act of forgetting is forgotten. What is meant by forgetting form? The heart remains unmoved, profoundly still, without distinction between self and other. The wise recognize this; the enlightened see it—this is called truth. Entering the Dao, one knows when to stop; guarding the Dao, one knows caution—thus one abides in the Dao without straying. Employing the Dao, one knows subtlety—thus one returns to simplicity and is not misled by vastness. This is the original essence of the Dao’s body, the source from which the wondrous functioning of the single heart arises. Thus, all that is universally penetrating and all-knowing is inherently possessed by one’s original nature, and at this point, it is fully restored within oneself. Tracing its origin, it all stems from knowing when to stop.\"",
      "overlap_context": "red eons past, my heart first aligned with this Dao, and I attained the rank of Highest Perfected. My intent nurtured this merit, and I gained authority over the Great Transformation. Once, before the Primordial Heavenly Worthy of the Great Ultimate, I vowed with a pure and vast heart: ‘In future worlds, may all sentient beings—heavenly dragons and ghosts—who invoke my name be liberated. If this is not so, may I bear the burden myself.’ Now, purify your hearts, for I shall expound the teaching.”",
      "start_char": 5436,
      "end_char": 6677,
      "start_sentence": 231,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.0420024394989,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "知止而后有定，定而后能静。 静定日久，听明日全。 天光内烛心纯乎道，与道合真。 抑不知孰为道，孰为我，但觉其道即我，我即道，彼此相忘於无忘可忘之中，此所谓至道也。 至道在乎天地之间，而反不知其道之所在。 要知道者，则凡有情之物我蠢动，无情之山河草木，岂出於至纯而不杂之外耶？ 其惟抱一为天下式者知此。 凡人修真炼道，惟守一而不杂，则进德无魔，升举有日也。 义曰：此章乃玉清真王入道守道体道之端绪也。 奉玉枢大教之志士，於此再三研穷，自有所得，则玉清真王之语不虚设矣。 释曰：大道无言，有言非道，是故我天尊言前章至道深窈不可得闻也。 若此之论，后人皆不被天尊之化，其道有起有止，无见无闻，起止见闻皆由心造。 昔我天尊九炁生而九炁成，有何见耶？ 有何闻耶？ 此章乃天尊教学道修真之士用功守成之路，必以己诚而合天地之诚也。 盖诚者，一也。 夫道一而生二，二生三，三生万物，莫不自诚一而来者。 人能用诚而入，用默而守，用柔而用。 然后得诚者似愚，得默者似讷，得柔者似拙。 诚默柔为体为用，愚讷拙为道为玄，如是方可与道混然，忘形忘我忘忘，此乃道之实而真之妙也。 入必要知止，守必要知谨，用铃要知微，知微者则九炁之光足矣。 能知馑者，则万灵之圣全矣。 能知止者，则．三元之神安矣。 神安则智必备，智备则灵光生，灵光生则本元之炁合矣。 故名之曰真忘，惟其忘而不忘，忘无可忘者，即是真一之大道也。 赞曰：守一守一，当用馑默。 无我无人，却有一贼。 若还捉住，湛然凝碧。 天尊言：吾今於世，何以利生？ 为诸天人演此妙宝。 得悟之者，俾跻仙阼。 学道之士，信有气数。 夫风土不同，则禀受自异，故谓之气。 智愚不同，财清浊自异，故谓之数。 数系乎命，气系乎天，气数所囿，天命所梏，不得真道。 愚可以智，浊可以清，惟命俾之。 愚昏昏，独冥冥，亦风土禀受之移之。 天地神其机，使人不知，则日自然。 使知其不知，则亦日自然。 自然之妙，虽妙於知，而所以妙，则自乎不知。 然於道射未始，有以愚之浊之。 诸天闻已，四众咸悦。 注曰：凡人生处，若土厚水深，地气多寒，万物晚成，造化之功厚，故多寿也。 若土薄水浅，地气多热，万物速成，造化之功薄，故多夭也。 此风土不同，禀受之异也。 若人禀胎气清者，为人慈善，端正忠孝，智慧聪明，乐仙慕道之人也。 禀气浊者，为人凶恶，邪佞狠毒，愚痴悖逆无道，不仁不义之人也。 智愚不同，清浊之异也。 气数所囿，如花木之开发，亦各有时，皆禀示地之气。 天命所梏，乃天令施於桎梏。 不善之人，长沦恶趣，不得真道也。 愚者，可以智慧门化之。 浊者，可以清浄门化之。 愚者常自昏昏，浊者常自冥冥，此乃自然而然也，皆风土禀受之分配定矣。 盖天地之生杀万物，亦随其四时之气侯也。 若智人，得五行之气，阴阳之精，修之炼之，以保固其身命，便与天地同久日月齐明。 愚人只知声色滋味，而不知反以害其命也。 是以学道之人，当默而思之。 义曰：天之生物，皆得二气之威形，清气多而赞淑，浊气重而奸恶。 岂非风土之不齐，禀受之自异者也。 释曰：夫风土之不齐，实气数之所系也。",
      "translated_text": "When one knows when to stop, there is stability; with stability, one can attain stillness. Through prolonged stillness and stability, hearing and sight become complete. The celestial radiance illumines within, and the heart is pure in the Dao, merging with the Dao in truth. Yet one does not know what is the Dao and what is the self—only that the Dao is the self, and the self is the Dao, both forgotten in the state where there is nothing left to forget. This is called the supreme Dao.\n\nThe supreme Dao resides within heaven and earth, yet one does not perceive where it dwells. To know the Dao is to recognize that all sentient beings—whether the self or the myriad creatures—and all insentient things—mountains, rivers, grasses, and trees—do not exist beyond the realm of absolute purity and undefiled singularity. Only those who embrace the One as the model for all under heaven understand this.\n\nFor those who cultivate truth and refine the Dao, holding fast to the One without admixture ensures that virtue advances without demonic obstruction, and ascension to the immortal realms will come in time.\n\n**Exposition:** This chapter outlines the foundational principles by which the Jade Pure True Sovereign enters, guards, and embodies the Dao. Devotees of the Great Jade Pivot Teachings who delve deeply into this passage will find true attainment, and the words of the Jade Pure True Sovereign will not have been spoken in vain.\n\n**Commentary:** The Great Dao is wordless; words are not the Dao. Thus, the Heavenly Worthy’s previous discourse on the profound and abstruse supreme Dao could not be fully conveyed. If such teachings were to be expounded, later generations would not be transformed by the Heavenly Worthy’s influence. The Dao has arising and ceasing, yet it is without sight or sound—arising, ceasing, sight, and sound are all created by the heart.\n\nWhen the Heavenly Worthy was born, the nine qi took form, yet what was seen? What was heard? This chapter is the path by which the Heavenly Worthy instructs those who study the Dao and cultivate truth, guiding them in their practice and preservation. It requires aligning one’s sincerity with the sincerity of heaven and earth.\n\nFor sincerity is the One. The Dao generates the One, the One generates the Two, the Two generate the Three, and the Three give rise to the myriad things—all originate from the One of sincerity. One who enters through sincerity, guards through silence, and acts through softness will appear foolish in sincerity, dull in silence, and clumsy in softness. Sincerity, silence, and softness are the substance and function; foolishness, dullness, and clumsiness are the Dao and its mystery. Only thus can one merge indistinguishably with the Dao, forgetting form, forgetting the self, and forgetting even the act of forgetting. This is the reality of the Dao and the wonder of truth.\n\nTo enter, one must know when to stop; to guard, one must know caution; to employ, one must know subtlety. Knowing subtlety, the radiance of the nine qi is complete. Knowing caution, the sageliness of the myriad spirits is fulfilled. Knowing when to stop, the spirits of the Three Primes are at peace. When the spirits are at peace, wisdom is complete; when wisdom is complete, numinous radiance arises; when numinous radiance arises, the original qi of one’s fundamental nature is united. This is called true forgetting—forgetting yet not forgetting, forgetting where there is nothing left to forget. This is the Great Dao of the true One.\n\n**Eulogy:**\nGuard the One, guard the One,\nEmploy caution and silence.\nWithout self, without others,\nYet there is a thief.\nIf you seize it,\nProfound clarity congeals like jade.\n\nThe Heavenly Worthy said: How shall I benefit the world in this age? For the sake of all heavenly beings, I expound this wondrous treasure. Those who awaken to it will ascend to the immortal ranks.\n\nStudents of the Dao, know that there are qi and fate. Wind and earth differ, and thus endowments vary—this is called qi. Wisdom and foolishness differ, and thus purity and turbidity vary—this is called fate. Fate is tied to destiny; qi is tied to heaven. Bound by qi and fate, constrained by heavenly mandate, one cannot attain the true Dao. The foolish can become wise, the turbid can become pure—this is decreed by destiny.\n\nThe foolish remain benighted, the turbid remain dark—this is the influence of wind and earth’s endowment. Heaven and earth move by their mechanism, causing people to remain unaware, which is called spontaneity. If one becomes aware of unawareness, it is still called spontaneity. The wonder of spontaneity lies in knowing, yet its wonder arises from not knowing. Nevertheless, the Dao has never begun to make one foolish or turbid.\n\nAll heavenly beings heard this, and the four assemblies rejoiced.\n\n**Annotation:** Where people are born, if the land is thick and the waters deep, the earth’s qi is cold, and the myriad things mature late. The work of creation is profound, and thus lifespans are long. If the land is thin and the waters shallow, the earth’s qi is hot, and the myriad things mature quickly. The work of creation is slight, and thus lifespans are short. This is the difference in wind and earth, the variation in endowment.\n\nIf one is endowed with pure prenatal qi, one becomes kind, upright, loyal, filial, intelligent, and wise—a lover of immortality and the Dao. If one is endowed with turbid qi, one becomes fierce, wicked, deceitful, cruel, foolish, rebellious, and lacking in humanity and righteousness. This is the difference between wisdom and foolishness, purity and turbidity.\n\nBound by qi and fate, like the blooming of flowers and trees, each has its season, all receiving the qi of heaven and earth. Constrained by heavenly mandate, it is as if a decree imposes shackles. The unvirtuous remain mired in evil destinies and cannot attain the true Dao.\n\nThe foolish can be transformed through the gate of wisdom; the turbid can be transformed through the gate of purity. The foolish remain benighted, the turbid remain dark—this is the natural course, determined by the allocation of wind and earth’s endowment. For heaven and earth give life to and kill the myriad things according to the qi of the four seasons.\n\nThe wise receive the qi of the Five Phases and the essence of yin and yang. By cultivating and refining them, they preserve their lives, enduring as long as heaven and earth, as luminous as the sun and moon. The foolish know only sensual pleasures and flavors, unaware that these harm their lives. Thus, students of the Dao should reflect in silence.\n\n**Exposition:** All things born of heaven receive the power of the Two Qi. Those with more pure qi are refined and virtuous; those with more turbid qi are wicked and depraved. Is this not due to the unevenness of wind and earth and the variation in endowment?\n\n**Commentary:** The unevenness of wind and earth is truly tied to qi and fate.",
      "overlap_context": "caution—thus one abides in the Dao without straying. Employing the Dao, one knows subtlety—thus one returns to simplicity and is not misled by vastness. This is the original essence of the Dao’s body, the source from which the wondrous functioning of the single heart arises. Thus, all that is universally penetrating and all-knowing is inherently possessed by one’s original nature, and at this point, it is fully restored within oneself. Tracing its origin, it all stems from knowing when to stop.\"",
      "start_char": 6677,
      "end_char": 7910,
      "start_sentence": 288,
      "end_sentence": 348,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.654266119003296,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "是故，我天尊举此一章。 列大道之后者，何也？ 盖世人失於调养，肆意轻生。 孰不知轻清之气为天，重浊之气为地。 凡为人身，得天气成精成津成液，得地气成骨成肉成筋者也。 既禀二气而生，何故有修短赞愚之分耶？ 岂非风土之厚薄阴阳之偏塞耶？ 盖天之命如梏，气之数如囿，言人人不可逃天命而越气数。 惟我学道之士，能崇此经，则出於天命而拔气数之外也。 我天尊说是言毕，两班卿师使相诸天帝君雷师皓翁，踊跃赞欺，至於天龙鬼神，亦皆不知手舞足蹈之悦也。 赞曰：风土所宜，亦由气血。 水各有源，人皆有劫。 轻清还玄，重浊不白。 道本无二，此心似月。 天尊言：吾今所说，即是玉枢宝经。 若未来世，有诸众生，得闻吾名，但冥心默想，作是念，言九天应元雷声普化天尊，或一声，或五七声，或千百声，吾即化形十方，运心三界，使称名者咸得如意。 十方三界，诸天诸地，日月星辰，山河草木，飞走蠢动，若有知若无知，天龙鬼神，闻诸众生一称吾名，如有不顺者，馘首剖心，化为微尘。 注曰：夫玉枢者，即玉清之气也。 玉为至尊至贵，故元始天尊称玉清，昊天上帝称玉皇，太上道君称玉晨，太上老君称高上玉帝也，三清之都号玉京神霄真王称玉清。 玉者，宝中之尊贵也。 枢者，天之枢纽也。 雷霆者，天地之枢机。 天枢地机，枢阴机阳。 天本阳，曰枢者，乃颠倒之理也。 虽日天阳地阴，盖天一生水也。 北斗贪狼星，号枢星，贫狼配天元乃七政之首也。 如枢密院，亦朝纲之枢机也。 总国之机密政务，掌杀伐之目也。 玉枢之经，乃天府之雷文也。 如有不顺之人，当制心斩首，皆在雷司之主令也。 义曰：天尊以好生之心为心，化形十方，不使一物不被其泽也。 如有毁谤之者，雷司试首刳心宜矣。 释曰：此章，天尊发广大之愿明矣。 天尊念念生生，无文可明，故垂玉枢之灵文，以化众生。 其或众生得化成真之后，一称我天尊之号，篆天尊之符，至於世间山河草木飞走蠢动，但禀二气之物，即当悚尔而听，毋敢少逆。 如不顺者，雷司不容，则碎为微尘也。 赞曰：天尊天尊，发愿广大。 毁谤玄文，雷司有害。 天尊言：吾是九天贞明大圣，每月初六及旬中辛日，监观万天，浮游三界。 若或有人欲学道，欲希仙，欲这九玄，欲释三灾，当命正一道士，或自同亲友於楼观，於家庭，於里社，釂水馈花，课诵此经。 或一过，三五过，乃至数十百过，即得神清气爽，心广体胖。 凡所希求，悉应其感。 注曰：天尊号贞明大圣。 夫贞者，贞观其天地，贞胜其吉凶。 而乃天地变化，圣人效之。 吉凶垂象，圣人则之。 夫易乾元亨利贞。 贞者，四时为冬，四方为北，令亦属北。 天一生水，玉清之祖气也。 天尊每月初六及辛日下降。 初六者，六阳降而生乾，六阴胜而生坤，消息升降，周流六虚，以为道极。 圣功生焉，神明出焉。 盖天地生数一，成数六。 天地得之，润泽济世。 六辛者天之水数天数，当先号六辛。 辛数，乾天也。 天一生水，皆先天一气之义。 万天者，自大罗清微禹余大赤王境之天。 周遍诸天，无不监观其天人功过。 至于三界，无不浮游察录其万灵功过也。 若人诵此经者，凡所希求，悉应其感。",
      "translated_text": "Thus, Our Heavenly Worthy presents this chapter. Why is it placed after the exposition of the Great Dao? Because worldly people, neglecting self-cultivation, recklessly squander their lives. Who among them knows that the light and pure qi forms heaven, while the heavy and turbid qi forms earth? For the human body, the qi of heaven generates essence, fluids, and humors; the qi of earth generates bones, flesh, and sinews. Having received the Two Qi at birth, why then do people differ in lifespan, intelligence, virtue, and folly? Is this not due to the varying thickness of wind and earth, the imbalance of yin and yang?\n\nThe mandate of heaven is like a fetter; the allotment of qi is like an enclosure. It is said that no one can escape heaven’s mandate or transgress the bounds of qi. Only we, the students of the Dao, who revere this scripture, may transcend heaven’s mandate and rise beyond the constraints of qi.\n\nWhen Our Heavenly Worthy finished speaking these words, the assembled ministers, preceptors, and all the Heavenly Emperors, Thunder Masters, and Radiant Elders leapt forth in praise. Even the celestial dragons and spirits, gods and demons, could not contain their joy, dancing with hands and feet.\n\n**Eulogy:**\nThe suitability of wind and earth depends on qi and blood.\nWaters each have their source; beings each have their kalpas.\nThe light and pure return to the mysterious; the heavy and turbid remain impure.\nThe Dao is fundamentally undivided; this heart is like the moon.\n\nThe Heavenly Worthy declared: “What I have spoken is the *Precious Scripture of the Jade Pivot*. In future ages, if any sentient beings hear my name and silently contemplate it, forming this thought—uttering the name of the Nine Heavens’ Responsive Primordial Thunder-Sounding Universal Transformation Heavenly Worthy—whether once, five or seven times, or a hundred or a thousand times—I shall manifest in the ten directions, extend my mind through the Three Realms, and ensure that all who invoke my name attain their desires. Throughout the ten directions and Three Realms, in all heavens and earths, the sun, moon, and stars, mountains, rivers, grasses, and trees, creatures that fly, crawl, or stir—whether sentient or insentient—celestial dragons, spirits, and gods: if any hear sentient beings invoke my name and yet fail to comply, may their heads be severed and their hearts carved out, reduced to fine dust.”\n\n**Annotation:**\nThe *Jade Pivot* is the qi of the Jade Clarity. Jade is the most exalted and noble, thus the Celestial Venerable of Primordial Beginning is called the Jade Clarity; the August Emperor of Heaven is called the Jade Sovereign; the Supreme Dao Lord is called the Jade Dawn; the Supreme Venerable Lord is called the Lofty Jade Emperor. The capital of the Three Clarities is named the Jade Capital; the Divine King of the Divine Empyrean is called the Jade Clarity. Jade is the most noble among treasures. The *pivot* is the hinge of heaven. Thunder is the pivot and mechanism of heaven and earth. The heavenly pivot governs yin; the earthly mechanism governs yang. Though heaven is fundamentally yang, it is called the *pivot*—this is the principle of inversion. Though heaven is yang and earth is yin, heaven generates water as the first of the Five Phases. The Greedy Wolf Star of the Northern Dipper is called the Pivot Star; the Greedy Wolf corresponds to the Celestial Origin, the first of the Seven Governors. Like the Bureau of Military Affairs, it is the pivot and mechanism of the imperial court, overseeing the state’s confidential affairs and wielding the power of life and death. The *Scripture of the Jade Pivot* is the thunder script of the Heavenly Treasury. If there are disobedient people, their hearts must be restrained and their heads severed—all by the command of the Thunder Bureau.\n\n**Exposition:**\nThe Heavenly Worthy’s heart is a heart of cherishing life. Manifesting in the ten directions, he ensures that not a single being is deprived of his grace. If any slander this scripture, the Thunder Bureau will test their heads and carve out their hearts—this is fitting.\n\n**Commentary:**\nIn this chapter, the Heavenly Worthy’s vast vow is made clear. The Heavenly Worthy’s thoughts and lives are boundless, beyond description; thus, he bestows the numinous scripture of the *Jade Pivot* to transform sentient beings. If, after beings are transformed and attain the truth, they invoke my Heavenly Worthy’s name or inscribe my Heavenly Worthy’s talisman, then all things in the world—mountains, rivers, grasses, trees, creatures that fly, crawl, or stir—anything endowed with the Two Qi, shall tremble and listen, daring not the slightest defiance. If any disobey, the Thunder Bureau will not tolerate it, and they shall be shattered into fine dust.\n\n**Eulogy:**\nHeavenly Worthy, Heavenly Worthy,\nYour vow is vast and boundless.\nThose who slander the mysterious scripture\nshall meet harm from the Thunder Bureau.\n\nThe Heavenly Worthy declared: “I am the Nine Heavens’ Chaste and Radiant Great Sage. On the sixth day of each month and on the *xin* days within the ten-day week, I oversee the myriad heavens and wander through the Three Realms. If anyone wishes to study the Dao, aspire to immortality, ascend to the Nine Mysteries, or dispel the Three Calamities, let them command a Zhengyi Daoist or, together with kin and friends, perform rites at a towered temple, in their home, or at a village shrine—offering libations of water and flowers, reciting this scripture. Whether once, three or five times, or even dozens or hundreds of times, they shall attain clarity of spirit, vigor of qi, a broad mind, and a robust body. All their aspirations shall be answered in accord with their resonance.”\n\n**Annotation:**\nThe Heavenly Worthy is titled the Chaste and Radiant Great Sage. *Chaste* means to observe heaven and earth with integrity and to prevail over fortune and misfortune. Thus, the sage emulates the transformations of heaven and earth and models the auspices of fortune and misfortune. The *Book of Changes* states: “The Creative is pure, replete, beneficial, and steadfast.” *Steadfast* corresponds to winter among the four seasons and to the north among the four directions; its command also belongs to the north. Heaven generates water as the first of the Five Phases—this is the ancestral qi of the Jade Clarity. The Heavenly Worthy descends on the sixth day of each month and on *xin* days. The sixth day: six yang descends to generate *qian*; six yin prevails to generate *kun*. The waxing and waning, ascent and descent circulate through the six voids, forming the ultimate Dao. From this arises sagely work; from this emerges numinous illumination. The generative number of heaven and earth is one; the consummate number is six. Heaven and earth attain these to moisten and benefit the world. The *six xin* are the water numbers of heaven, the celestial numbers—hence the name *six xin*. The *xin* number belongs to *qian*, heaven. Heaven generates water—all are the principles of the primordial unity of qi. The *myriad heavens* refer to all heavens from the Great Luo, Pure Tenuity, and Yu-Yu to the Great Red King’s realm. The Heavenly Worthy surveys all heavens without exception, observing the merits and faults of their inhabitants. As for the Three Realms, he wanders through them all, recording the merits and faults of the myriad spirits. If one recites this scripture, all their aspirations shall be answered in accord with their resonance.”",
      "overlap_context": "he sun and moon. The foolish know only sensual pleasures and flavors, unaware that these harm their lives. Thus, students of the Dao should reflect in silence.\n\n**Exposition:** All things born of heaven receive the power of the Two Qi. Those with more pure qi are refined and virtuous; those with more turbid qi are wicked and depraved. Is this not due to the unevenness of wind and earth and the variation in endowment?\n\n**Commentary:** The unevenness of wind and earth is truly tied to qi and fate.",
      "start_char": 7910,
      "end_char": 9138,
      "start_sentence": 349,
      "end_sentence": 409,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.55948829650879,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "义曰：天尊言：有情无情，有知无知，咸得成真，以宣大化。 自见其功德不可称量也人，叩之必应。 奉道之人，可不勉哉。 释曰：天尊降监之日，恐世人不知，误犯天律，夫尊惜群生之念至於如此。 如或学道希仙之士，酌水献花，或亲友，或道士，一诵此经，其得仙班有位，天府标名。 或有一等下愚，忽起诚心，课诵此经，使之心广体胖。 或有孝子顺孙，斋心涤虑，建置坛场，请诵此经，即得超升。 所以释三灾追九玄，皆得如愿，无不感应。 赞曰； 诚不用物，以气相臻。 一称尊号，天地回春。 天尊言：身中九灵，何不召之？ 一曰天生，二曰无英，三曰玄珠，四曰正中，五曰子丹，六曰回回，七曰丹元，八曰太渊，九曰灵童，召之则吉。 身中三精，何不呼之？ 一曰台光，二曰爽灵，三日幽精，呼之则庆。 五心烦懑，六脉抢攘，四肢失宁，百节告急，宜诵此经。 注曰：九灵者，人身中之本神也。 天生者，玄牝也。 无英者，婴兄也。 玄珠者，谷神也，正中者，泥丸。 夫人子丹者，灵台神也。 回回者，贵券神也。 丹元者，心神也。 太渊者，肾宫列女，水府神也。 灵童者，主制五脏神也。 台光者，男女构精，胞胎始荣。 爽灵者，魂也。 幽精者，魄也。 凡为人，既知身中有此神灵，何不时时呼召，炼成一家，则学道希仙无诸阵碍也。 若五心烦懑，六豚抢攘，诵此经则身中诸神咸得以宁，则使人安逸也。 义曰：三精九灵，非外物也。 住我本家，慎勿放出。 当令常侍左右，朝真礼圣，则易见而易得也。 乃天尊恐人不知大道所在，故以此指之也。 释曰：天有九曜，人有九灵。 天有三台，人有三魂。 天之九曜失度，三台迁位，则水旱阴晦。 人之九灵失守，三魂妄行，则灾害生矣。 如有此三者，至心诵经焚符，则三魂安九灵息、五心静六豚和、四肢泰百节无恙也。 赞曰：九灵九灵，是我之精。 时时呼召，永保长生。 天尊言：若或有人五行奇蹇，九曜嵚，年逢刑冲，运值克战，孤辰寡宿，羊刃剑锋，劫煞亡神，鬼门钩绞，禄遭破败，马落空亡，动用凶危，行藏坎，即诵此经。 上请天官解天厄，地官解地厄，水官解水厄，五帝解五方厄，四圣解四时厄，南辰解本命厄，北斗解一切厄。 注曰：凡人五行不通，九曜失度，又值刑冲及诸神煞，动用行藏皆不顺利，大则天谴地责丧身陨命，皆由三官五帝四圣二斗以主之。 归命此经，诵咒焚香告符，则一切厄难，皆能解释。 义曰：三界之中，为人最灵，不知向上一步，政使星辰战克，行止轗轲，急宜归奉真文，则三元五帝以消其罪也。 此章，天尊令人知忌避而欲禳之。 释曰：此言人之五行不利，九曜作挠是也。 所以诸多神杀，皆听我天尊之勑。 如或有人遭此祸患，诵此经，则天尊命本人之家司命六神，上请天官解天厄，地官解地厄，水官解水厄，五帝解五方厄，四圣解四时厄，南辰解本命厄，北斗解一切厄。 盖绿此三官五帝四圣南辰北斗，亦乃天尊之有司也。 故云上请者，欲人知天尊之所司之广设也。 赞曰：地网天罗不可逃，凶星临并若为消。 诚心诵取天尊号，玉篆金符急急烧。 天尊言：沉痾伏枕，症疾压身，积时弗廖，求医罔效，五神无主四大不收。 或是五帝三官之前，日月星辰之前，山林草木之前，灵坛古迹之前，城隍社庙之前，里巷井灶之前，寺观塔楼之前，或地府三十六狱，冥官七十二司，有诸冤枉，至此牵缠。",
      "translated_text": "The Heavenly Worthy declares: “Whether endowed with sentiment or devoid of it, whether possessed of awareness or lacking it—all may attain true realization, thereby propagating the great transformation. Those who perceive their own virtue and power as immeasurable shall find their invocations invariably answered. O followers of the Dao, how can you not strive with diligence?”\n\nThe Exegesis states: On the day the Heavenly Worthy descends to inspect the world, fearing that mortals, unaware, might transgress celestial statutes, his compassion for all living beings extends even to this. Should any aspirant to the Dao and immortality—whether offering libations of water and flowers, whether kin or friend, or a Daoist—recite this scripture but once, they shall be enrolled among the ranks of immortals, their names inscribed in the celestial registers. Even those of lesser wit, should they suddenly awaken sincere devotion and recite this scripture, shall find their hearts expanded and bodies at ease. If filial sons and obedient grandsons purify their minds, cleanse their thoughts, and establish altars to invite the recitation of this scripture, they shall attain transcendence. Thus, whether dispelling the Three Calamities or summoning the Nine Ancestors, all shall achieve their desires, and none shall fail to receive response.\n\nThe Eulogy proclaims:\nSincerity requires no material offering—qi alone suffices to draw near.\nInvoke but once the sacred name, and heaven and earth shall renew like spring.\n\nThe Heavenly Worthy asks: “Within the body dwell the Nine Spirits—why not summon them? The first is Heaven-Born, the second Peerless Radiance, the third Mystic Pearl, the fourth Central Upright, the fifth Child Cinnabar, the sixth Revolving Brilliance, the seventh Cinnabar Prime, the eighth Great Abyss, and the ninth Divine Youth. To invoke them is auspicious. Within the body reside the Three Essences—why not call upon them? The first is Terrace Light, the second Luminous Spirit, and the third Hidden Essence. To summon them is felicitous. When the five centers are vexed and restless, the six pulses chaotic, the four limbs unquiet, and the hundred joints distressed, recite this scripture.”\n\nThe Annotation states: The Nine Spirits are the fundamental deities within the human body. Heaven-Born is the Mystic Female. Peerless Radiance is the Infant Brother. Mystic Pearl is the Valley Spirit. Central Upright is the Muddy Pellet. Child Cinnabar is the spirit of the Numinous Terrace. Revolving Brilliance is the spirit of the Treasured Contract. Cinnabar Prime is the spirit of the heart. Great Abyss is the spirit of the Kidney Palace, the Arrayed Maidens, and the Water Mansion. Divine Youth governs and restrains the spirits of the five viscera. Terrace Light arises when male and female unite in essence, and the embryo first flourishes. Luminous Spirit is the *hun*. Hidden Essence is the *po*. Since one knows these divine spirits dwell within the body, why not call upon them constantly, refining them into a single household? Thus, the path to learning the Dao and aspiring to immortality shall be free of all obstacles. If the five centers are vexed and the six pulses chaotic, reciting this scripture shall pacify all spirits within the body, bringing tranquility and ease.\n\nThe Exposition states: The Three Essences and Nine Spirits are not external entities. They abide in our original home—take care not to let them depart. Ensure they ever attend at your side, paying homage to the perfected and revering the sages, and they shall be readily seen and easily attained. Thus, the Heavenly Worthy, fearing that people know not where the great Dao resides, points to it here.\n\nThe Exegesis states: Heaven possesses the Nine Luminaries, and humans possess the Nine Spirits. Heaven has the Three Terraces, and humans have the Three *Hun*. When the Nine Luminaries of heaven lose their proper measure and the Three Terraces shift their positions, droughts, floods, and dark omens arise. When the Nine Spirits of humans fail to guard their stations and the Three *Hun* wander recklessly, calamities and misfortunes ensue. Should any of these three conditions arise, recite the scripture with utmost sincerity, burn talismans, and the Three *Hun* shall be pacified, the Nine Spirits stilled, the five centers calmed, the six pulses harmonized, the four limbs at peace, and the hundred joints free of affliction.\n\nThe Eulogy proclaims:\nNine Spirits, Nine Spirits—these are my essence.\nCall upon them constantly, and ever preserve long life.\n\nThe Heavenly Worthy declares: “Should anyone suffer from the five phases in adverse configuration, the Nine Luminaries in disarray, their year afflicted by clashes and conflicts, their fate beset by contention, solitary stars and barren constellations, the Blade of Yang and the Edge of the Sword, the Robber of Destruction and the Spirit of Death, the Ghost Gate and the Hook of Entanglement, their official salary ruined, their Horse fallen into emptiness, their actions fraught with peril, their conduct beset by misfortune—let them recite this scripture. Thereby, they may petition the Celestial Official to resolve celestial adversities, the Terrestrial Official to resolve terrestrial adversities, the Aquatic Official to resolve aquatic adversities, the Five Emperors to resolve adversities of the five directions, the Four Sages to resolve adversities of the four seasons, the Southern Asterism to resolve adversities of one’s original destiny, and the Northern Dipper to resolve all adversities.”\n\nThe Annotation states: When one’s five phases are obstructed, the Nine Luminaries lose their proper measure, and one encounters clashes, conflicts, and various baleful stars, all actions and undertakings shall be inauspicious. In severe cases, one may incur celestial reprimands, terrestrial punishments, or even lose one’s life—all governed by the Three Officials, Five Emperors, Four Sages, and Two Dippers. By devoting oneself to this scripture, reciting incantations, burning incense, and presenting talismans, all adversities and calamities may be resolved.\n\nThe Exposition states: Among the Three Realms, humans are the most numinous. Yet if they fail to advance toward the higher path, even when stars and constellations contend and clash, and their conduct is beset by misfortune, they should swiftly devote themselves to the true scripture, and the Three Primes and Five Emperors shall dissolve their transgressions. This chapter instructs people to recognize taboos and seek expiation.\n\nThe Exegesis states: This refers to those whose five phases are inauspicious and whose Nine Luminaries are disturbed. All baleful stars and malevolent spirits are subject to the decrees of our Heavenly Worthy. Should anyone encounter such misfortunes, by reciting this scripture, the Heavenly Worthy shall command the Six Spirits of Destiny in their household to petition the Celestial Official to resolve celestial adversities, the Terrestrial Official to resolve terrestrial adversities, the Aquatic Official to resolve aquatic adversities, the Five Emperors to resolve adversities of the five directions, the Four Sages to resolve adversities of the four seasons, the Southern Asterism to resolve adversities of one’s original destiny, and the Northern Dipper to resolve all adversities. For these Three Officials, Five Emperors, Four Sages, Southern Asterism, and Northern Dipper are also the functionaries of the Heavenly Worthy. Thus, the term “petition” is used to make known the vast jurisdiction of the Heavenly Worthy’s administration.\n\nThe Eulogy proclaims:\nThe terrestrial net and celestial snare cannot be escaped;\nWhen baleful stars descend, how can they be dispelled?\nRecite with sincerity the name of the Heavenly Worthy,\nAnd swiftly burn the jade script and golden talismans.\n\nThe Heavenly Worthy declares: “When one is bedridden with chronic illness, afflicted by grave maladies, their condition lingering unresolved, medical treatments ineffective, the five spirits ungoverned, and the four great elements unrestrained—whether before the Five Emperors and Three Officials, the sun, moon, and stars, the mountains, forests, grasses, and trees, the sacred altars and ancient sites, the city gods and earthly temples, the village wells and kitchen stoves, the monasteries, pagodas, and towers, or within the thirty-six hells of the underworld and the seventy-two bureaus of the nether officials—should any grievances or entanglements arise therefrom, they shall be bound and ensnared.”",
      "overlap_context": "ter—all are the principles of the primordial unity of qi. The *myriad heavens* refer to all heavens from the Great Luo, Pure Tenuity, and Yu-Yu to the Great Red King’s realm. The Heavenly Worthy surveys all heavens without exception, observing the merits and faults of their inhabitants. As for the Three Realms, he wanders through them all, recording the merits and faults of the myriad spirits. If one recites this scripture, all their aspirations shall be answered in accord with their resonance.”",
      "start_char": 9139,
      "end_char": 10454,
      "start_sentence": 410,
      "end_sentence": 465,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.457619428634644,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "或盟诅咒誓之所招，或债垛负偿之所致。 三世结衅，异劫兴仇，埒其咎尤，库其执对，皆当首谢，即诵此经。 注曰：沉痾痼疾，伏枕床蓐，医祷无效，盖三官五帝，泰山岱岳，日月星辰，城隍社庙，里巷井灶，灵坛古迹，寺观塔楼，五道诸司，地府冥官，至於山川草木皆有神祇，故误冒犯。 或夙有冤牵，负财致命，或被人咒诅，或自设誓违盟，累劫以来兴仇结衅，皆当悔过，发露罪尤，请诵经咒焚此篆符，而悉得消愈也。 义曰：此章专言人之积病及禁忌相刑，当称天尊之号，则祸去而福来，何必疑也。 释曰：凡人病染沉痾，痼疾弗瘳，世药无功，阴神作挠，或自咒，或他诅，或积垛，或私愆，则冥府欲问究由，欲追执对，何以赦免？ 即诵宝经焚灵符，即时安逸也。 赞曰：阴谴阳罪，况疠是报。 禁忌犯之，经符是祷。 天尊言：天官符，地官符，年月日时，各有官符。 方隅向背，各有官符。 大则官符，小则口舌，是有赤口白舌之神以主之。 凡诸动作兴举，出入起居，不知避忌。 如遇官符口舌，则使人击聒。 晓夜煎媰，多招唇吻。 面是背非，动致口牙。 盟神诅佛，始於讟议，终於诟诋。 由是狱讼生焉，刑宪存焉。 若欲脱之，即诵此经，遂得口舌潜消，官符永息。 注曰：此章，天尊言诸官符赤口白舌之神者，乃天省下之恶曜也。 盖因世人，不修正道，不畏公法，渎雷亵雨，故遣此神以挠之。 若人犯者，急诵此经，焚诸符篆，即得应时消灭矣。 义曰：人之行藏，各有可否，但自不能识其机而造其理也。 如或犯之，此经能免也。 释曰：天尊发愿广大，施化无方。 此章专言诸官符者，盖此神易犯难释，以致庶人一或干之，则赤口白舌乘势而生也。 而世人何不预诵宝经焚玉篆，则此祸自灭矣。 赞曰：天符地符，人不可触。 欲释讼凶，经篆三告。 九天应元雷声普化天专玉枢宝经集注上竟 九天应元雷声普化天尊玉枢宝经集注下 天尊言：土皇九垒，其司千二百神，土侯土伯，土公土母，土子土孙，土家眷属。 若太岁，若将军，若鹤神，若太白，若九良，若剑锋，若雌雄，若金神，若火血，若身黄，若撞命，若三煞，若七煞，若黄旛豹尾，若飞廉刀砧，如是等土家神煞。 若人兴修卜筑，一或犯之，即致病患，以迄丧亡。 才诵此经，则万神皆起，天无忌，地无忌，阴阳无忌，百无禁忌。 注曰：凡人动作兴工，不无有犯神煞，其祸立至。 大则丧命，小则官非，可不慎欤。 依仪书篆行持，诵经祈祷，则百无所忌也。 义曰：天尊惜群生，至於如斯也。 亦云生亦土，而死亦土。 殊不知土之为害，大尤甚也。 盖土宜静，不宜动之谓也。 释曰：天覆其地，人孰不知。 盖我天尊，为九天之尊，统制三界。 而九垒皇君春属家臣诸多恶煞，害人不轻，天尊用玉文宝篆以、镇禳之，使世间上士下愚凡动作之时，百无禁忌也。 赞曰：万物皆从戊己来，偶然相犯即为灾。 若非普化真文力，处处皆为白骨堆。 天尊言：世人夫妇，其於婚合，或犯咸池，或犯天狗，三刑六害，隔角交加，孤阴寡阳，天罗地网，艰於嗣息，多是孤独。 若欲求男，即诵此经，当有九天监生大神，招神摄风，遂生贤子。 於其生产之时，太一在门，司命在庭。",
      "translated_text": "Or by the curses and oaths they have invoked, or by the debts and burdens they have failed to repay. Grievances spanning three lifetimes, enmities arising from past kalpas—all such faults and offenses, all such confrontations and contentions, must be confessed and repented. Then recite this scripture.\n\nAnnotation: For chronic and lingering illnesses that confine one to bed, where medicine and prayers prove ineffective, this is because the Three Officials and Five Emperors, Mount Tai and the sacred peaks, the sun, moon, and stars, the city gods and earthly temples, the village wells and kitchen stoves, the sacred altars and ancient sites, the monasteries, pagodas, and towers, the bureaus of the Five Paths, the nether officials of the underworld, and even the spirits of mountains, rivers, grasses, and trees—all may have been inadvertently offended. Or perhaps there are long-standing grievances, debts of wealth or life, curses from others, or broken vows and violated oaths, with enmities and grudges accumulated over countless kalpas. One must repent, openly confess one’s transgressions, recite the scripture and incantations, and burn these talismanic writings to achieve full recovery.\n\nExegesis: This chapter specifically addresses the accumulation of illness and the conflicts arising from taboos. By invoking the name of the Heavenly Worthy, misfortune departs and blessings arrive—why doubt this?\n\nCommentary: When one is afflicted with chronic illness that no worldly medicine can cure, and when malevolent spirits stir trouble—whether through self-inflicted curses, others’ maledictions, accumulated debts, or hidden transgressions—the underworld seeks to investigate and pursue the cause, to apprehend and confront the offender. How else may one be absolved? By reciting the precious scripture and burning the sacred talismans, peace and ease are restored at once.\n\nEulogy:\nYin’s retribution, yang’s transgressions—\nSuch plagues are but their recompense.\nWhen taboos are violated,\nRecite the scripture, pray the talismans.\n\nThe Heavenly Worthy declares: There are celestial talismans, terrestrial talismans, and talismans for each year, month, day, and hour. For every direction and orientation, there are corresponding talismans. Great offenses invoke official talismans, while minor ones provoke verbal disputes, governed by the spirits of the Red Mouth and White Tongue. In all actions and undertakings, in going out and staying in, if one fails to observe taboos and encounters these talismans or verbal spirits, one will be harassed incessantly, day and night tormented, lips and tongue embroiled. Flattery and slander arise, leading to lawsuits and punishments. To escape this, recite this scripture, and the disputes will silently dissipate, the talismans forever stilled.\n\nAnnotation: In this chapter, the Heavenly Worthy speaks of the spirits of official talismans, the Red Mouth, and the White Tongue—these are malevolent stars sent down by the celestial courts. Because worldly people fail to cultivate the true Way, defy public law, and profane thunder and rain, these spirits are dispatched to harass them. If one transgresses, recite this scripture at once and burn the talismans to dissolve the affliction in that very moment.\n\nExegesis: In human conduct, there are rights and wrongs, but one often fails to recognize the signs or grasp the principles. Should one transgress, this scripture can absolve it.\n\nCommentary: The Heavenly Worthy’s vows are vast, and his transformations boundless. This chapter specifically addresses the talismanic spirits, for they are easily offended but difficult to appease. Should an ordinary person provoke them, the Red Mouth and White Tongue seize the opportunity to arise. Why do worldly people not recite the precious scripture and burn the jade talismans in advance, so that such misfortunes vanish of themselves?\n\nEulogy:\nCelestial talismans, terrestrial talismans—\nMortals must not provoke them.\nTo dispel lawsuits and misfortune,\nRecite the scripture, petition thrice with talismans.\n\n*End of the Upper Volume of the Collected Annotations on the Jade Pivot Precious Scripture of the Heavenly Worthy of Universal Transformation Through the Thunder’s Resounding Voice*\n\n*Beginning of the Lower Volume of the Collected Annotations on the Jade Pivot Precious Scripture of the Heavenly Worthy of Universal Transformation Through the Thunder’s Resounding Voice*\n\nThe Heavenly Worthy declares: The Nine Mounds of the Earth Sovereign are governed by one thousand two hundred spirits, including the Earth Lords, Earth Marshals, Earth Lords and Ladies, Earth Children and Grandchildren, and their entire earthly retinue. Among them are the Year Star, the General Star, the Crane Spirit, Venus, the Nine Auspicious Stars, the Sword Blade, the Male and Female Stars, the Metal Spirit, the Fire and Blood Spirits, the Yellow Body, the Life-Striker, the Three Sha, the Seven Sha, the Yellow Banner and Leopard Tail, the Flying Edge and Execution Block—such are the earthly spirits and malevolent stars. Should one undertake construction or divination and inadvertently offend them, illness, misfortune, and even death may follow. But upon reciting this scripture, all spirits rise in response, and there shall be no taboos in heaven, no taboos on earth, no taboos in yin and yang, and no prohibitions whatsoever.\n\nAnnotation: Whenever one undertakes construction or begins a project, one may unwittingly offend these spirits and malevolent stars, bringing immediate calamity. At worst, it leads to death; at best, lawsuits and disputes. How can one not be cautious? By following the rituals, inscribing the talismans, reciting the scripture, and offering prayers, all taboos are lifted.\n\nExegesis: The Heavenly Worthy cherishes all living beings to such an extent. It is said that we live upon the earth and return to the earth in death, yet few realize how profoundly the earth can harm. For the earth prefers stillness and resists disturbance.\n\nCommentary: Heaven covers the earth—who does not know this? Yet our Heavenly Worthy, as the supreme lord of the Nine Heavens, governs the Three Realms. The Nine Mounds’ Sovereign, his spring retinue, and his many malevolent ministers inflict grave harm upon humanity. The Heavenly Worthy employs the jade script and precious talismans to suppress and dispel them, ensuring that all—from the wise to the foolish—may act without taboos.\n\nEulogy:\nAll things arise from earth,\nAnd inadvertent offense brings disaster.\nWere it not for the power of the true scripture of Universal Transformation,\nEverywhere would be heaps of white bones.\n\nThe Heavenly Worthy declares: When worldly men and women marry, they may offend the Salty Pond, the Heavenly Dog, the Three Punishments, the Six Harms, the intersecting angles, the solitary yin and solitary yang, the Heavenly Net and Earthly Snare, leading to difficulties in bearing children and a life of solitude. If one seeks a son, recite this scripture, and the Great Spirit of the Nine Heavens who oversees birth will summon the spirits and command the winds, bringing forth a worthy child. At the time of birth, the Great Unity stands at the door, and the Controller of Destinies waits in the courtyard.",
      "overlap_context": "the four great elements unrestrained—whether before the Five Emperors and Three Officials, the sun, moon, and stars, the mountains, forests, grasses, and trees, the sacred altars and ancient sites, the city gods and earthly temples, the village wells and kitchen stoves, the monasteries, pagodas, and towers, or within the thirty-six hells of the underworld and the seventy-two bureaus of the nether officials—should any grievances or entanglements arise therefrom, they shall be bound and ensnared.”",
      "start_char": 10454,
      "end_char": 11705,
      "start_sentence": 466,
      "end_sentence": 515,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.86614727973938,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "或有冤愆，或有鬼魅，或有禁忌，或有凶厄，致令难产。 请诵此经，即得九天卫房，圣母默与抱送，故能临盆有庆，坐草无虞。 凡有婴孩，在於襁褓，为栴檀神王座下一十五种鬼，加诸恼害，因多惊痫，宜诵此经。 注曰：世人婚合产育，皆有神煞。 不知方向，不避太岁，偶尔犯之，其祸不浅。 急宜诵经焚符以禳之，则自安荣也。 义曰：凶吉两途，互相齿之。 如或不谐不育，天尊之号宜一诵之，必自然而释矣。 释曰：此章为人间婚姻子嗣，系於天尊所属。 凡嗣息聘嫁养育，非小事也。 世俗罔知，而窒於勘合之私，其误多矣。 如或犯之，夫北妻南，子息艰得。 宜诵宝经焚灵符以释之，则自然夫妻和睦，子孙昌泰也。 赞曰：夫妇人伦事，儿男骨肉恩。 要令家道睦，归敬玉枢文。 天尊言：若人居止，乌鼠送妖，蛇虫嫁孽，抛砖掷瓦，惊鸡弄狗，邀求祭杞，以至影胁梦逼，及於奸盗。 而敢据其所居，以为巢穴，遂使生人被惑。 庭户不清，夜啸於梁，昼瞰其室，牛马犬豕，亦遭瘟疫。 祸连骨肉，灾及孳生，淫祠祆社，党庇神奸，吊客频仍，丧车迭出。 若诵此经，即使鬼精灭爽，人物咸宁。 注曰：盖此等之家，不崇纲常理道，不畏天地神明。 口味厌秽荤膻，身履邪淫杀道。 不遵公法，惟务私荣。 肆毒逞凶，恣行不善。 是致鬼妬神憎，妖邪竞起。 若能悔过首谢，诵经焚符，即得祸乱不生，人物安宁也。 义曰：壁坏盗入，业重鬼来，致使六畜兴灾，家神不利。 天尊不以小故，亦垂大恩，多诵经文，其祸止矣。 释曰：正气如天，邪魔敢犯。 盖因世人治家不理，干渎神聪，以致六神不居，则邪气乘间而入。 或鼠精蛇魈，抛掷惊弄，血阴无时，甚至染昧家人，其祸不测。 或盗人家财物，移东易西，皆此类也。 致使吊客丧门，挟灵肆志。 即诵宝经焚玉符，则人物俱得以安宁也。 赞曰：自作恶时邪亦作，我行善处即天行。 世人忽有如斯难，宜篆灵符诵宝经。 天尊曰：九天雷公将军，五方雷公将军，八方云雷将军，五方蛮雷使者，雷部总兵使者，莫赚判官，发号施令，疾如风火。 有庙可伐，有坛可击，有妖可除，有祟可遣。 季世末法，多诸巫觋，邪法流行，阴肆魇祷。",
      "translated_text": "Should grievances, grudges, malevolent spirits, or taboos arise—should ill fortune or calamity strike—causing difficult labor, recite this scripture, and the Nine Heavens’ Guardians of the Chamber will attend, while the Holy Mother silently assists in delivery, ensuring the birth is joyous and the labor free from peril.\n\nFor infants in swaddling, tormented by the fifteen kinds of ghosts under the Sandalwood Spirit-King, afflicted with fright and convulsions, this scripture should be recited.\n\n**Annotation:** In marriage and childbirth, all mortals contend with spirit perils. Unaware of directions, heedless of the Grand Year-Star, they may inadvertently offend—such transgressions bear grave consequences. Hasten to recite the scripture and burn talismans to avert misfortune, and peace and prosperity will follow.\n\n**Exegesis:** Fortune and misfortune stand as two paths, ever intertwined. Should discord or barrenness arise, invoke the Heavenly Worthy’s name but once, and all shall dissolve of itself.\n\n**Exposition:** This chapter binds mortal marriage and progeny to the Heavenly Worthy’s dominion. The begetting, betrothal, and rearing of children are no trifling matters. Yet worldly custom, blind to such truths, stumbles into private miscalculations—errors manifold. Should offense occur, husband north and wife south, children will come only with great difficulty. Recite the precious scripture and burn sacred talismans to dispel it, and naturally husband and wife will harmonize, their descendants flourishing.\n\n**Eulogy:**\nMarriage is the bond of human relations,\nSons and daughters the love of flesh and bone.\nTo make the household thrive in accord,\nRevere the Jade Pivot’s text.\n\nThe Heavenly Worthy declares: Where men dwell, crows and rats deliver omens, serpents and insects sow corruption, bricks and tiles are hurled, chickens startled, dogs provoked, and offerings demanded—even spectral coercion and dream oppression, or worse, theft and debauchery. Should such spirits dare claim a dwelling as their lair, the living will be bewildered. The courtyard and home grow unclean; by night, wailing echoes in the rafters; by day, unseen eyes peer into the chamber. Cattle, horses, dogs, and swine suffer pestilence; calamity clings to kin, disaster befalls livestock. Lewd shrines and heretical altars shelter wicked spirits, while mourners arrive in droves and funeral biers depart in succession. Recite this scripture, and instantly ghostly essences vanish, men and creatures alike find peace.\n\n**Annotation:** Such households, scorning moral principles and the Dao of proper conduct, defy the gods of Heaven and Earth. Their mouths reek of foul meat and rank flesh; their bodies tread paths of lust and slaughter. They flout public law, pursuing only private gain, unleashing venom and violence, indulging every vice. Thus do they provoke the envy of ghosts and the wrath of spirits, summoning malevolent forces. Yet should they repent, confess their faults, recite the scripture, and burn talismans, misfortune will cease, and all will dwell in tranquility.\n\n**Exegesis:** When walls crumble, thieves enter; when karma weighs heavy, ghosts arrive, bringing disaster to livestock and misfortune to household spirits. The Heavenly Worthy, not dismissing even minor transgressions, extends great mercy—recite the scripture often, and calamity will halt.\n\n**Exposition:** When the upright qi is as vast as Heaven, no demon dares encroach. Yet mortals, mismanaging their households, offend the divine intelligence, driving away the Six Spirits, allowing perverse qi to seize the moment. Rat spirits and serpent specters hurl objects and sow chaos; blood-yin strikes without warning, even tainting household members—such perils defy prediction. Or thieves may pilfer goods, shifting things from east to west—all of this kind. Thus do mourners and death-portents run rampant, spirits emboldened to act as they please. Recite the precious scripture and burn jade talismans, and both people and creatures will find peace.\n\n**Eulogy:**\nWhen one does evil, evil arises;\nWhen one acts with virtue, Heaven acts in kind.\nShould mortals face such trials,\nInscribe sacred talismans and recite the precious scripture.\n\nThe Heavenly Worthy says: The Nine Heavens’ Thunder Duke Generals, the Five Directions’ Thunder Duke Generals, the Eight Directions’ Cloud-Thunder Generals, the Five Directions’ Barbarian Thunder Envoys, the Thunder Department’s Marshal Commanders, the Deceptive Illusion Judges—all issue commands swift as wind and fire. Where there are temples to strike, altars to smite, demons to purge, or malevolent forces to banish, they act. In this degenerate age of declining Dharma, many are the shamans and sorcerers; perverse arts spread, and yin forces freely cast their curses.",
      "overlap_context": "g, the Three Punishments, the Six Harms, the intersecting angles, the solitary yin and solitary yang, the Heavenly Net and Earthly Snare, leading to difficulties in bearing children and a life of solitude. If one seeks a son, recite this scripture, and the Great Spirit of the Nine Heavens who oversees birth will summon the spirits and command the winds, bringing forth a worthy child. At the time of birth, the Great Unity stands at the door, and the Controller of Destinies waits in the courtyard.",
      "start_char": 11705,
      "end_char": 12561,
      "start_sentence": 516,
      "end_sentence": 554,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.238616228103638,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "是故上清，乃有天延禁鬼录奸之庭，帝由束妖考邪之房。 能诵此经，其应如响。 注曰：经中凡二十一段，皆天尊言，惟此章云天尊曰。 盖称扬雷公将军使者判官，发号施令，应响威德，故不直言也。 巫觋之徒，务行邪术，妄构妖言，魇祷夫妇分离，蛊媚女流苟合。 值此妖巫，诵宝经焚符篆，则雷司剿除，应报如响，人得安宁。 义曰：天地无私，惟德是辅，善恶之报，动如景响。 学道之士，体天心而明己心，则祸患蠲消而福禄臻矣。 释曰：此章，乃天尊自赞雷司之圣也。 如此所以，诛鬼斩邪，兴云降雨，皆我天尊劲下方行，今世道俗难分。 或以不正之术，坏人伦而犯律。 诵此宝经焚符，则立应如响，岂不敬乎畏乎。 赞曰：雷司明善恶，善拔恶，常诛邪法相侵害，惟多诵玉枢。 天尊言：天瘟地瘟，二十五瘟。 天蛊地蛊，二十四蛊。 天瘵地瘵，三十六瘵。 能诵此经，即使瘟清浄，蛊毒消除，劳瘵平复。 亦有其由，或者先亡复连，或者伏尸故气，或者冢讼墓注，或者死魂染惹，或者尸气感招。 凡此鬼神，或悲思，或志恨牵连执证，并绿注射，并音塝射音石。 乘隙伺间，间音谏。 乃得其便。",
      "translated_text": "Thus, in the Supreme Clarity, there stands the Celestial Court for Binding Ghosts and Registering the Wicked, the Imperial Chamber for Restraining Demons and Interrogating the Perverse. Those who recite this scripture shall find their prayers answered as swiftly as an echo.\n\n**Annotation:** Among the twenty-one sections of this scripture, all are the words of the Heavenly Worthy, yet only this chapter begins with \"The Heavenly Worthy says.\" This is because it extols the Thunder Duke Generals, Envoys, and Judges, who issue commands and manifest their awe-inspiring virtue in instant response. Thus, it does not speak directly.\n\nThe followers of shamans and sorcerers, devoted to perverse arts, recklessly fabricate demonic words, casting curses to sunder husbands and wives, or employing bewitchments to entice women into illicit unions. When such malevolent sorcerers are encountered, recite the precious scripture and burn the sacred talismans, and the Thunder Bureau shall eradicate them, meting out retribution as swiftly as an echo, so that people may find peace.\n\n**Exegesis:** Heaven and Earth are impartial, aiding only those of virtue. The retribution for good and evil moves as swiftly as shadow and echo. Those who cultivate the Dao, embodying the heart of Heaven and illuminating their own hearts, shall see misfortunes dispelled and blessings and prosperity arrive.\n\n**Commentary:** This chapter is the Heavenly Worthy’s own praise of the Thunder Bureau’s sagacity. For this reason, it slays ghosts, severs evil, summons clouds, and brings rain—all by the Heavenly Worthy’s command, enacted below. Yet in this age, the sacred and the profane are often indistinguishable. Some employ unorthodox arts to corrupt human relations and violate the law. Recite this precious scripture and burn the talismans, and the response shall be as swift as an echo. How can one not revere and fear this?\n\n**Eulogy:**\nThe Thunder Bureau discerns good and evil,\nUprooting evil and rescuing the good,\nEver eradicating perverse arts that bring harm.\nRecite the Jade Pivot often.\n\nThe Heavenly Worthy says:\nHeavenly pestilences, earthly pestilences—twenty-five in all.\nHeavenly gu, earthly gu—twenty-four in all.\nHeavenly consumptive afflictions, earthly consumptive afflictions—thirty-six in all.\nThose who recite this scripture shall find pestilences purified,\ngu poisons dissolved,\nand consumptive afflictions healed.\n\nThere are reasons for these afflictions:\nSome arise from the lingering influence of the long-dead,\nor from the residual qi of corpses,\nor from lawsuits over graves and tomb curses,\nor from the contamination of dead spirits,\nor from the summoning by corpse qi.\nAll such ghosts and spirits—whether moved by sorrow,\nor bound by resentment and entanglement—\ncast their baleful influence like arrows.\nSeizing every opportunity, they strike when least expected.",
      "overlap_context": " Directions’ Thunder Duke Generals, the Eight Directions’ Cloud-Thunder Generals, the Five Directions’ Barbarian Thunder Envoys, the Thunder Department’s Marshal Commanders, the Deceptive Illusion Judges—all issue commands swift as wind and fire. Where there are temples to strike, altars to smite, demons to purge, or malevolent forces to banish, they act. In this degenerate age of declining Dharma, many are the shamans and sorcerers; perverse arts spread, and yin forces freely cast their curses.",
      "start_char": 12561,
      "end_char": 13015,
      "start_sentence": 555,
      "end_sentence": 575,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.355106353759766,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "故此经者，上通三天，下彻九泉，可以追荐魂爽，超度祖玄，太上遣素车白马大将军以监之。 注曰：凡人息瘟蛊瘵疾者，皆有所致，甚至绝灭一门，牵连六亲。 若能诚心诵经，焚烧符篆，则雷司差素车白马之将以拔之，使人不陷此苦也。 义曰：瘟蛊疗疾，有自来矣。 但能诚心洁己，诵真文，礼天尊，则不罹此苦也。 释曰：瘟乃不正之气，蛊乃无影之虫，瘵乃难愈之疾。 盖此三者，我天尊之言？ 有自来矣。 只缘复连相染，尸气相熏，冢讼相呼之所致也。 复连者，乃人之大厄也，世人不知禳解，故有绝门亡没者也。 冢讼者，七祖冤牵之所政也。 尸气者，地上原有远年棺柩，化成小虫，或飞入饮食之中，或落在器皿之内食之，令人作蛊。 凡人迁居，当诵经焚符，以剿绝之。 赞曰：天地瘟蛊瘵疾大苦，祸有其由，亦人自取。",
      "translated_text": "Thus this scripture reaches upward to the Three Heavens and penetrates downward to the Nine Springs. It can summon and deliver the wandering souls, transcend and ferry the ancestral generations, for the Most High dispatches the Great General of the White Chariot and White Horses to oversee the rite.\n\nAnnotation states: All who suffer from pestilences, gu, or consumptive afflictions have brought them upon themselves—so severe that entire households may perish, and six relations be entangled. Yet if one recites the scripture with sincere devotion and burns the talismanic writs, the Thunder Bureau shall dispatch the generals of the White Chariot and White Horses to extricate them, sparing them from this suffering.\n\nExposition states: Pestilences, gu, and healing afflictions have their origins. But if one purifies the heart, maintains personal purity, recites the true scripture, and pays homage to the Heavenly Worthy, one shall not fall prey to this suffering.\n\nExegesis states: Pestilence arises from impure qi, gu from shadowless worms, and consumptive afflictions from hard-to-cure illnesses. Why does the Heavenly Worthy speak of these three? They too have their origins—stemming from lingering connections and contagion, corpse qi and mutual defilement, or tomb lawsuits and spectral summons. Lingering connections are humanity’s great calamity; the world does not know how to perform exorcisms, hence entire families perish. Tomb lawsuits are the governance of the seven ancestral generations’ grievances. Corpse qi arises from ancient coffins in the earth, which transform into tiny insects that may fly into food or fall into vessels; when consumed, they cause gu. When moving residences, one should recite the scripture and burn talismans to eradicate them.\n\nEulogy states: The great suffering of heaven-and-earth’s pestilences, gu, and consumptive afflictions has its causes, yet it is also self-inflicted.",
      "overlap_context": "solved,\nand consumptive afflictions healed.\n\nThere are reasons for these afflictions:\nSome arise from the lingering influence of the long-dead,\nor from the residual qi of corpses,\nor from lawsuits over graves and tomb curses,\nor from the contamination of dead spirits,\nor from the summoning by corpse qi.\nAll such ghosts and spirits—whether moved by sorrow,\nor bound by resentment and entanglement—\ncast their baleful influence like arrows.\nSeizing every opportunity, they strike when least expected.",
      "start_char": 13015,
      "end_char": 13346,
      "start_sentence": 576,
      "end_sentence": 589,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.199895858764648,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "若诵玄文，可技七祖，白马将军能为作主。 天尊言：若或有人治装远行，贼盗骋奸，五兵加害。 陆行则虎狼魈蜮磨其牙，水行则蛟龙灶鼍张其颐。 或难赖有幽枉之魂，或风涛有劫数之会。 前亡后化，捉生代死，能於此经归命投诚，故得水陆平康，行藏协吉。 注曰：凡人出陆遇贼迎兵，或逢蛇虎恶域山魈。 水行或值蛟龙鼋鼉作浪兴风，滞魄沉魂，求生捉替。 或遭劫会，或飘堕他方。 常预备符篆防之，可水可火化去，亦急诵宝号，立免诸厄也。 义曰：出入动静，宜慎宜馑，若能平昔奉持此经，则此患何由而至也。 释曰：动静行藏，须当慎之。 所以吉凶晦吝生乎动，是故一动只一吉字，其三字皆非美也。 出入可不谨乎。 凡欲远行，必须先诵宝经佩符命，则吉无不利。 赞曰：水陆行藏世不无，鬼神作耗暗潜图。 一称普化天尊号，佩带真王玉篆符。 天尊言：亢阳为虐，雨泽愆期，稽颡此经，应时甘澍。 积阴为厉，雨水浸淫，稽颡此经，应时朗霁。 祝融扇祸，飞火民居，赤鼠游城，惊热黎庶，此经可以禳之。 海若失经，鱼龞妄行，洪水稽天，民生垫溺，此经可以止之。 注曰：此章，天尊爱群生之心切切。 久旱久阴，实天地之气不和，乃人民之业难释。 以致三界震怒，水涝山崩，祝融扇祸，赤鼠兴妖，黎庶不安。 若人遭此岁时，宜诵此经，焚此符篆，晴雨得宜，人民自安也。 义曰：阴阳失律，如旱逞势，莫非出入於天司之令。 盖恶业之气不消，正真之道不崇也。 天尊斡旋造化，以生生之心长养群品，其不可赞欺耶。 释曰：阴晴晦明，非细事也。 上系天庭，下关洞府，亦由二气之不和故也。 凡遇此水旱之时，志士严置道场，诵灵文而焚玉篆，则旱可雨而雨可晴矣。 赞曰：水旱为灾，可关天地。 诚心诵经，晴明甘霈。 天尊言：世人欲免三灾九横之厄，即於静夜稽首北辰。 北辰之上，上有三台，其星并踱，形如双目，迭为三级，以覆斗魁，是名天阶。 若人见之，生前无刑囚之忧，身后不沦没之苦。 斗中复有尊帝，二星大如车输，若人见之，留形住世，长生神仙。 归命此经，投心北极，即有冥感。 斗为天枢，中有天罡，在内则为廉贞，在外则为破军。 雷城十二门，并随天罡之所指。 罡星指丑，其身在未，所指者吉，所在者凶，余位皆然。 若人见之，寿可千岁。 注曰：北辰者，北极星也。 辰星五位，乃帝座星也。 居常不动，而众星皆共之也。 此北斗居天之中，为天之枢纽，斡运四时。 凡天地、日月、五星、列曜、六甲、二十八宿诸仙众真及下元生人，上自天子，下及黎庶，寿禄，贫富、生死、祸福幽冥之事，无不属於北斗之总统也。 太上授以天师张真君北斗经诀，若有危厄，急告北斗，礼诵本命真君，方获安泰。 又得三台生，三台养，三台护也。 三台星有六座，上中下台。 名天阶者，太上升降之道也，其势横亘北斗第二□星。 上台虚精，中台六淳，下台曲生，乃星君内讳。 知星名者，众恶消除，诸善备至。 见星象者，生无刑忧，死无诸苦。 凡於静房端坐，思三台覆头。 次思两肾气从胸出，与三台相连。 久久思毕，啄齿二七，鼻微微出气，闭口满咽而毕。 乃咒曰：节节荣荣，愿乞长生，太玄三台，常覆我形，出入往来，万神携荣。",
      "translated_text": "If one recites the Mysterious Writ, one may rescue the seven ancestral generations, and the White Horse General will act as their protector.\n\nThe Heavenly Worthy states: Should one prepare for a distant journey, bandits and thieves may scheme, and the five weapons bring harm. On land, tigers, wolves, mountain spirits, and venomous creatures sharpen their fangs; on water, dragons and alligators gape their jaws. One may encounter the grievances of wronged souls or the predestined trials of wind and waves. The departed may seize the living to replace the dead. Yet if one surrenders body and heart to this scripture, one shall traverse land and water in peace, and all undertakings shall be auspicious.\n\nAnnotation states: When traveling by land, one may meet bandits or armed conflict, or encounter serpents, tigers, or malevolent mountain spirits. When traveling by water, one may face dragons, turtles, or alligators stirring waves and winds, or lost souls seeking substitutes. One may suffer predestined trials or be cast adrift in distant lands. Always prepare talismans to guard against these perils; they may be burned in water or fire, or one may urgently recite the sacred name to instantly avert all calamities.\n\nExegesis states: In all movements and stillness, one must be cautious and vigilant. If one has long upheld this scripture, how could such misfortunes arise?\n\nExposition states: In all actions and repose, one must be prudent. For fortune and misfortune, clarity and obscurity arise from movement. Thus, in every movement, only one outcome is auspicious—the other three are not. How can one not be careful? Before embarking on a journey, one must first recite the sacred scripture and wear its talismans; then all shall be auspicious.\n\nEulogy states: Travel by land and water is inescapable in this world; ghosts and spirits secretly plot harm. Yet with a single invocation of the Universal Transformation Heavenly Worthy’s name and the wearing of the True King’s Jade Talisman, all shall be well.\n\nThe Heavenly Worthy states: When scorching yang prevails and rain is delayed, prostrate yourself before this scripture, and timely sweet rains shall fall. When excessive yin rages and floods overflow, prostrate yourself before this scripture, and skies shall clear. When the Fire God fans disaster and flames engulf homes, when red rats roam the city and the people suffer from heat, this scripture may be used to exorcise them. When the Sea God loses control and fish and turtles wander recklessly, when floods rise to the heavens and the people drown, this scripture may be used to halt them.\n\nAnnotation states: This chapter reveals the Heavenly Worthy’s deep compassion for all beings. Prolonged drought or excessive rain arise from the disharmony of heaven and earth’s qi, and the people’s karmic burdens remain unresolved. Thus, the Three Realms grow wrathful: floods and landslides occur, the Fire God fans disaster, red rats stir chaos, and the people know no peace. In such times, one should recite this scripture and burn its talismans; then rain and sunshine shall be timely, and the people shall be at peace.\n\nExegesis states: When yin and yang lose their rhythm, as in droughts or floods, it stems from the decrees of the celestial bureaus. For the qi of evil karma does not dissipate, and the true Dao is not revered. The Heavenly Worthy, in turning the wheel of creation, nurtures all beings with a heart of boundless life—how can this not be praised?\n\nExposition states: Clear skies and storms are no small matters. They concern the celestial courts above and the grotto-heavens below, and arise from the disharmony of the two qi. In times of flood or drought, the devout should establish a ritual altar, recite the numinous writ, and burn the jade talismans; then droughts shall yield rain, and rains shall yield sunshine.\n\nEulogy states: Floods and droughts are disasters that shake heaven and earth. Yet with sincere recitation of the scripture, skies shall clear, and sweet rains shall fall.\n\nThe Heavenly Worthy states: Should one wish to avoid the calamities of the three disasters and nine misfortunes, one must prostrate oneself toward the Northern Asterism on a quiet night. Above the Northern Asterism lie the Three Terraces, their stars aligned like paired eyes, stacked in three tiers to cover the Dipper’s bowl—this is called the Celestial Stairway. Whoever beholds them shall be free from imprisonment in life and the sufferings of drowning in death. Within the Dipper resides the August Emperor, two stars as large as chariot wheels. Whoever beholds them shall preserve their form in the world and attain long life as an immortal. Surrendering to this scripture and offering one’s heart to the Northern Culmen shall evoke a response from the unseen.\n\nAnnotation states: The Northern Asterism is the North Star. Among the five asterisms, it is the Emperor’s Seat, ever unmoving while all other stars revolve around it. The Northern Dipper resides at heaven’s center, serving as its pivot, turning the four seasons. All matters of heaven and earth, sun and moon, the five planets, the stellar arrays, the six jia, the twenty-eight lodgings, the host of immortals and perfected beings, and the people of the lower realm—from the Son of Heaven to the common folk—whether concerning longevity, wealth, life, death, fortune, misfortune, or the affairs of the unseen, all fall under the Northern Dipper’s governance. The Most High transmitted to Heavenly Master Zhang the *Northern Dipper Scripture’s Oral Instructions*. In times of peril, one should urgently petition the Northern Dipper, pay homage to the True Lord of one’s life-star, and thereby attain peace and safety. One may also attain the Three Terraces’ life-giving, nurturing, and protective blessings. The Three Terraces consist of six stars: the Upper, Middle, and Lower Terraces. The Celestial Stairway is the path by which the Most High ascends and descends, spanning the second star of the Northern Dipper. The Upper Terrace is *Xu Jing*, the Middle Terrace *Liu Chun*, and the Lower Terrace *Qu Sheng*—these are the stars’ inner names. Knowing the stars’ names dispels all evils and brings all virtues to fulfillment. Beholding their forms ensures freedom from imprisonment in life and all sufferings in death. In a quiet chamber, sit upright and visualize the Three Terraces above your head. Then visualize the qi of your two kidneys rising from your chest to connect with the Three Terraces. After prolonged visualization, tap your teeth fourteen times, exhale gently through your nose, close your mouth, and swallow fully. Then recite the incantation:\n\n*\"Joint by joint, flourishing and glorious,\nI beseech long life.\nGreat Mysterious Three Terraces,\nEver cover my form.\nIn all goings and comings,\nMay the myriad spirits escort my glory.\"*",
      "overlap_context": "milies perish. Tomb lawsuits are the governance of the seven ancestral generations’ grievances. Corpse qi arises from ancient coffins in the earth, which transform into tiny insects that may fly into food or fall into vessels; when consumed, they cause gu. When moving residences, one should recite the scripture and burn talismans to eradicate them.\n\nEulogy states: The great suffering of heaven-and-earth’s pestilences, gu, and consumptive afflictions has its causes, yet it is also self-inflicted.",
      "start_char": 13346,
      "end_char": 14595,
      "start_sentence": 590,
      "end_sentence": 646,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.216472864151,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "步之五年，仙骨自成。 步之七年，合药皆精。 步之十年，上升天庭。 急急如律令。 可叩头瞻仰拜礼，则百事皆遂。 又北斗乃阴阳之精神也。 精曜九道，光荫十天，七现二隐。 世人惟见七星，不见尊帝二星。 此二星即辅弼帝皇太尊晨君，乃天地魂魄之威神。 辅星主天，曰常。 弼星主地，曰空。 空者，九天之魂精。 常者，九地之魄灵。 天休地泰，空常隐藏。 天否地激，空常焕明。 变化万气，改易阴阳，四时代谢，莫不由焉。 二星尊贵，隐伏华晨，九天亦秘其灵音，不行於世。 诸得道高仙贵真，乃得见之。 其营名逐利流俗秽浊之人，星光所不临照，难可得见也。 曩亦有误见之者，今俗人脱有误见者，切不可言，泄则身被兵火，卒形获考地狱，生死父母皆受罪於三官。 瞻礼之法，常以每月初三日、二十七日夜，勿令人知，阴下中庭，烧香礼诵，咒曰：尊帝二星，北极之灵。 愿臣早见，见即长生。 福庆无穷，天与长龄。 诚心更念此经，默有感通，久久自当见也。 亦不可泄其天罡名，在斗枢之内，星形与破军星相对，此星红色稍大，每一时辰，随斗杓照临地支一方位，时时运转，无有停息。 经云：天罡所指，昼夜常轮是也。 雷城按地支有十二门，雷欲发声，却随天罡，其时所指方位之门，乃发声也。 且如天罡坐於未，对指丑宫，何故却有吉凶？ 盖天罡正气，能生能杀，若所指向之处，即是生方，故有生气，取之则可以治病补虚，安神旺气，却祸消灾，延生度厄也。 所在之处，则有杀气，用之可以斩鬼驱邪，夷凶禁暴，馘毒制魔。 故曰所指者吉，所在者凶也。 义曰：九曜三台，乃一身之主宰，为万象之枢机也。 学者当依法而朝奏之，无不应响。 释曰：三台之星，尊之大之。 其斗中二尊帝之星者，何也？ 乃天地之魂魄，造化之枢机也。 夫学道之士，徒知朝真礼斗之诚，而不解瞻仰尊帝二星之捷径也。 又有天罡之星，在北斗之后，随雷门开处，而指雷门十二者，乃十二时。 经旨明言，所指者吉，所在者凶，即是雷门也。 学者欲朝斗瞻星，则法见於注内，见之则人寿永而福厚也。 赞曰：玄门之妙，人言深奥。 功行成时，当朝九曜。 天尊言：世衰道微，人无德行。 不忠君王，不孝父母，不敬师长，不友兄弟，不诚夫妇，不义朋友，不畏天地，不惧神明，不礼三光，不重五谷，身三口四，大秤小斗，杀生害命，人百已千，奸私邪淫，妖诬叛逆。 从微至着，三官鼓笔，太一移文，即付五雷斩勘之司。 先斩其神，后勘其形，斩神诛魂，使之颠倒。 人所鄙贱，人所嫌害，人所怨恶，以至勘形震尸，使之崩裂。 驱其卷水，役其驱车，月窍旬校，复有考掠。 一闻此经，其罪即灭。 若或有人为雷所瞋，其尸不举，水火不受，即称九天应元雷声普化天尊，作是念言，万神稽首，咸听吾命。 注曰：人一有犯，理应诛灭，岂雷司天府一一轰之？ 即今伏法遭刑，刀兵水火，但死於非命者，皆是也。 盖人始以小恶，为之不改，日积月增，遂成大咎。 罪已彰着，又不悔悟，三官太一考核，文移五雷之司，先斩神魂。 伺其时至，然后施行，其死魂却听雷司驱役捶考也。 若人改过迁善，归命此经，其罪即灭。 凡有男女为雷所瞋，冠帻须发不被燎去，亦可归告天尊，取自圣裁，万神皆听其命令也。",
      "translated_text": "After five years of pacing the stars, the immortal bones naturally form. After seven years, all elixirs become refined. After ten years, one ascends to the Celestial Court. *Swiftly, swiftly, in accordance with the statutes and ordinances.*\n\nOne may kowtow in reverent gaze and worship, and all affairs will come to fruition.\n\nMoreover, the Northern Dipper is the spirit and essence of yin and yang. Its radiance illuminates the nine Dao, its light shades the ten heavens—seven manifest, two concealed. Ordinary people see only the seven stars and not the two honorable imperial stars. These two stars are the *Fuxi* and *Bixie*, the August Morning Lords, the majestic spirits of Heaven’s hun-soul and Earth’s po-soul. The *Fu* star governs Heaven and is called *Chang*. The *Bi* star governs Earth and is called *Kong*. *Kong* is the hun-essence of the nine heavens; *Chang* is the po-spirit of the nine earths. When Heaven rests and Earth is at peace, *Kong* and *Chang* remain hidden. When Heaven is in turmoil and Earth is roused, *Kong* and *Chang* shine brilliantly. They transform the myriad qi, alter yin and yang, and govern the succession of the four seasons—nothing occurs without their agency.\n\nThese two stars are supremely noble, concealed at dawn’s splendor. Even the nine heavens guard their numinous sounds, keeping them from the world. Only those who attain the Dao—lofty immortals and noble perfected beings—may behold them. Those who pursue fame, chase profit, or wallow in the filth of the vulgar world are not illuminated by their starlight and can scarcely glimpse them. In the past, there have been those who mistakenly saw them. If common folk today mistakenly see them, they must not speak of it. To reveal it is to invite the scourge of war and fire, to suddenly take form and suffer in the earth-prisons of hell, and to bring suffering upon their parents in life and death before the Three Officials.\n\nThe method of reverent gazing is as follows: On the third and twenty-seventh nights of each month, without others knowing, secretly go to the central courtyard, burn incense, perform rites, and recite the incantation:\n\n*\"Honorable Imperial Two Stars,\nNuminous spirits of the Northern Culmen,\nMay your servant soon behold you,\nAnd upon seeing, attain long life.\nBoundless fortune and blessing,\nHeaven grants enduring years.\"*\n\nSincerely recite this scripture again and again, and in silence, resonance will arise. With time, you will naturally behold them. Yet you must not reveal the name of the Celestial Pivot star, which lies within the Dipper’s hub, its form opposite the *Breaker of Armies* star. This star is slightly larger and reddish. In each double-hour, it follows the Dipper’s handle to illuminate one of the twelve earthly branches, ceaselessly revolving without pause. As the scripture says: *\"Where the Celestial Pivot points, day and night it ever turns.\"*\n\nThunder’s city is arrayed according to the twelve earthly branches, with twelve gates. When thunder desires to sound, it follows the Celestial Pivot, and the gate toward which it points at that hour is where the sound issues forth. For example, if the Celestial Pivot rests in the *wei* position, pointing toward the *chou* palace, why then does fortune or misfortune arise? The Celestial Pivot is the upright qi—it can give life or take it. Where it points is the life direction, and thus there is life qi. Harnessing it can cure illness, replenish deficiency, calm the spirit, invigorate qi, avert misfortune, dispel calamity, prolong life, and deliver from peril. Where it resides, there is killing qi. Using it can decapitate ghosts, expel demons, suppress violence, restrain brutality, sever poison, and subdue malevolent spirits. Thus, where it points is auspicious; where it resides is inauspicious.\n\nIn principle: The nine luminaries and Three Terraces are the sovereigns of the body and the pivot of the myriad phenomena. Scholars should worship and petition them according to the method, and there will be no lack of response.\n\nAn explanation: The Three Terrace stars are to be revered and exalted. As for the two honorable imperial stars within the Dipper, what are they? They are the hun-soul of Heaven and the po-soul of Earth, the pivot of creation. Yet Daoist practitioners only know the sincerity of worshipping the perfected and paying homage to the Dipper, without understanding the swift path to gazing upon the two honorable imperial stars. There is also the Celestial Pivot star behind the Northern Dipper, which follows the opening of the thunder gates to point to the twelve gates corresponding to the twelve double-hours. The scriptural meaning is clear: where it points is auspicious; where it resides is inauspicious—that is, the thunder gates. Scholars who wish to pay homage to the Dipper and gaze upon the stars will find the method in the annotations. Beholding them ensures longevity and profound fortune.\n\nAn ode:\n*The mysteries of the Dark Gate are said to be profound.\nWhen merit and conduct are complete, one pays homage to the nine luminaries.*\n\nThe Heavenly Worthy said: In this age of decline, the Dao is faint, and people lack virtue. They are disloyal to their sovereigns, unfilial to their parents, disrespectful to their teachers and elders, unkind to their siblings, unfaithful to their spouses, unrighteous to their friends, unawed by Heaven and Earth, unheeding of the gods, irreverent toward the Three Luminaries, and careless with the Five Grains. They possess three bodily and four oral transgressions: using large scales and small measures, killing living beings and harming lives—one hundred for others, a thousand for themselves—engaging in licentiousness, deceit, rebellion, and treachery. From minor to grave, the Three Officials wield their brushes, the Great Unity sends forth documents, and they are handed over to the Bureau of Five Thunders for execution and investigation. First, their spirits are beheaded; then, their forms are examined. Beheading the spirit and executing the hun-soul leaves them in disarray. They become despised, shunned, resented, and hated by others, until their forms are examined and their corpses shattered, leaving them in ruins. They are driven into rolling waters, forced to pull carts, their monthly orifices inspected every ten days, and subjected to repeated torture.\n\nIf one hears this scripture, their sins are immediately erased. Should someone incur the wrath of thunder, their corpse cannot be lifted, and they are not received by water or fire. One should invoke the *Nine Heavens Responding to the Primordial, Thunder’s Voice, Universal Transformation Heavenly Worthy*, and recite this prayer: *\"May the myriad spirits bow their heads and heed my command.\"*\n\nAn annotation: If a person commits an offense, they rightfully deserve execution—how could the Thunder Bureau of the Celestial Court strike them down one by one? Those who now suffer punishment by law, perish by the sword, drown in water, or die in fire—all these are deaths by misfortune. For people begin with minor wrongs and, failing to reform, accumulate them day by day and month by month, until they become grave transgressions. Once their sins are manifest and they still do not repent, the Three Officials and the Great Unity examine and record them, sending documents to the Five Thunders’ Bureau, which first beheads their spirits and hun-souls. When the appointed time arrives, the punishment is carried out, and their dead souls are then subjected to the Thunder Bureau’s driving, beating, and torture.\n\nIf one reforms, turns toward goodness, and surrenders to this scripture, their sins are immediately erased. If a man or woman incurs the wrath of thunder, and their headdress, hair, or beard is not singed, they may appeal to the Heavenly Worthy and seek divine judgment, for the myriad spirits will heed their command.",
      "overlap_context": " and visualize the Three Terraces above your head. Then visualize the qi of your two kidneys rising from your chest to connect with the Three Terraces. After prolonged visualization, tap your teeth fourteen times, exhale gently through your nose, close your mouth, and swallow fully. Then recite the incantation:\n\n*\"Joint by joint, flourishing and glorious,\nI beseech long life.\nGreat Mysterious Three Terraces,\nEver cover my form.\nIn all goings and comings,\nMay the myriad spirits escort my glory.\"*",
      "start_char": 14595,
      "end_char": 15839,
      "start_sentence": 647,
      "end_sentence": 703,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.291548013687134,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "义曰：三纲五常，乃万古不易之理，岂容悖逆而妄行耶？ 谷乃民之命国之宝，岂可不珍惜而爱护耶？ 近世浅薄，不忠不孝，不义不仁，崇奢侈而恶清淡，贱道德而习奸诈，政使横祸迭至。 何不思之，天尊幸开大路，宜履之行之，则诸恶不生矣。 释曰：人生天地之间，禀二气备五常，履仁义而守忠孝，何故恣意轻生为诸不道之事？ 大则雷司震怒暴尸於市，小则官府加刑於身，是故善可为而恶不可作也。 雷司以不仁之人驱役，作善之士自当保拔也。 如有称天尊之号者，则万神无有不拱听者也。 赞曰：忠孝当为本，阴阳即我家。 要消诸恶业，不必诵南华。 天尊言：此经功德，不可思议。 往昔劫中，神霄玉清真王长生大帝所曾宣说。 至士授经，皆当剸金置币，盟天以传。 雷师皓翕，长跪拜兴，重白天尊言：是经在处，当令土地司命，随所守护，雷部按临，以时稽审。 若人家有此经，至诚安奉，即得祥烟满庭，庆云荫轩，祸乱不萌，吉福来萃，於其亡没，不经地狱。 所以者何？ 死即往生，生归善道，承天尊力，有此灵通。 出入起居，佩带此经，众人所钦，鬼神所畏。 遇诸险难，一心称名九天应元雷声普化天尊，悉得解脱。 注曰：天尊发大慈悲，说是宝经，上利诸天，下济群品。 至士受经，必用金帛为信，以质其心，告盟十天，然后传付。 其金帛者，但欲质心盟天，岂较多寡。 金帛虽微，盟约实重。 大圣非吝惜而不普及，恐人轻慢，故谆切以谕。 雷师宜令土地司命，在处守护也。 若人侍奉天尊，持诵经号，致感圣真降庭，故祥云缭绕。 生奉真诠，则死归善道。 更能依式篆符，书写此经，至诚佩带，诸难不生，人神敬畏也。 义曰：此章之意，令人诚信不欺。 后学君子，当依经而行，则庶几其不差也。 释曰：雷师皓翁，拱听天尊至化，喜不自胜。 於是长跪，再白天尊曰：自今而后，至士受经，当以金帛盟心，以传其文。 是经在处，宜令土地司命随所守护，雷部按临以时稽审。 如此奉诵，则门庭有庆，宗祖超升。 佩带之者，人所钦敬，鬼神畏服，遇难则称诵天尊之号，悉得解脱。 故此经功德，则不可思议也。 赞曰：不贵黄金贵赤心，初真学道外魔侵。 至诚肯与盟天地，克日教君听玉音。 於是雷师皓翁对天尊前，而说偈曰：无上玉清王，统天三十六。 九天普化君，化形十方界。 披发骑麒麟，赤脚蹑层冰。 手把九天炁，啸风鞭雷霆。 能以智慧力，摄伏诸魔精。 济度长夜魂，利益於众生。 如彼银河水，千眼千月轮。 誓於未来世，永扬天尊敬。 时雷师皓翁说是偈已。 注曰：此章，雷师皓翁顿有所得，故说是偈，以称扬天尊好生大德之万一。 所以文义溜亮，语言华泽，其功德力可胜言哉。 义曰：天尊之德，无可以体，雷师皓翁故以银河喻之。 乃言其天尊之元气，至清至贵，至圣至明者也。 释曰：雷师皓翁心服神通，无以赞欺，遂作此偈。 然我天尊，所统三十六天之尊，化十方世界之广。 游诸天时，披绀发而骑麒麟。 破九泉时，赤其足而蹑层冰。 手把九天炁者，即金光明之如意也。 啸风鞭霆，乃天尊之号令也。 斩鬼除妖，济物利人，此乃天尊利益於众生也。 银河之水，人不可见，不可测之，玄玄也。 千眼千月轮者，使诸有情归教之士，犹如天尊之在目前也。",
      "translated_text": "The Exposition states: The Three Bonds and Five Constants are principles immutable through the ages—how could one dare defy them with reckless conduct? Grain is the people’s life and the nation’s treasure—how could it not be cherished and protected? In recent times, shallowness prevails: loyalty and filial piety are abandoned, righteousness and benevolence forsaken. Extravagance is exalted while frugality is despised; morality is scorned while deceit is practiced. Such governance invites calamity upon calamity. Why not reflect? The Heavenly Worthy has graciously opened the great path—one should tread and follow it, and all evils shall cease to arise.\n\nThe Exegesis states: Born between Heaven and Earth, humans receive the two qi and embody the Five Constants. Walking the path of benevolence and righteousness, upholding loyalty and filial piety—why then indulge in reckless disregard for life and commit all manner of unprincipled acts? In grave cases, the Thunder Bureau vents its wrath, exposing corpses in the marketplace; in lesser ones, the courts impose punishment upon the body. Thus, goodness may be practiced, but evil must not be committed. The Thunder Bureau drives and enslaves the unrighteous, while those who cultivate virtue are naturally preserved and delivered. Should one invoke the name of the Heavenly Worthy, all spirits will bow and heed their command.\n\nThe Eulogy states:\nLoyalty and filial piety form the foundation,\nYin and yang are my true home.\nTo dissolve all karmic misdeeds,\nOne need not recite the *Nanhua*.\n\nThe Heavenly Worthy declares: The merit of this scripture is inconceivable. In kalpas past, the Divine King of Jade Purity of the Divine Empyrean, the Great Emperor of Long Life, once proclaimed it. Those of noble virtue who transmit this scripture must offer gold and silk as tokens, swearing oaths to Heaven before passing it on.\n\nThe Thunder Master Haoxi, rising from his long prostration, reverently addressed the Heavenly Worthy: Wherever this scripture resides, the Earth Deities and Life Mandates shall guard and protect it, while the Thunder Bureau shall descend to inspect and examine in due time. If a household enshrines this scripture with utmost sincerity, auspicious mist will fill its courtyard, propitious clouds will shade its halls, misfortunes will not arise, and blessings will gather. Upon death, they shall not pass through hell. Why is this so? At death, they are reborn; in life, they return to the good Dao, inheriting the Heavenly Worthy’s power and attaining this spiritual efficacy. Carrying this scripture in daily life, all people will revere them, and ghosts and spirits will stand in awe. When encountering peril, wholeheartedly invoking the name of the Nine Heavens’ Responsive Primordial Thunder Voice Universal Transformation Heavenly Worthy will ensure deliverance from all dangers.\n\nThe Annotation states: The Heavenly Worthy, moved by great compassion, expounded this precious scripture to benefit the heavens above and deliver all beings below. Those of noble virtue who receive it must offer gold and silk as tokens to affirm their sincerity, swearing oaths to the Ten Heavens before transmission. The gold and silk serve only to bind the heart in oath to Heaven—quantity is not the measure. Though the offerings be modest, the covenant is weighty. The Great Sage does not withhold this scripture out of stinginess but fears that people might treat it lightly; thus, He earnestly instructs. The Thunder Master should command the Earth Deities and Life Mandates to guard and protect it everywhere. If one serves the Heavenly Worthy, reciting the scripture’s name with devotion, the divine perfected will descend to their courtyard, and auspicious clouds will swirl. Those who uphold the true teachings in life shall, in death, return to the good Dao. Further, if one transcribes this scripture according to the prescribed talismanic forms, carries it with utmost sincerity, no calamities will arise, and both humans and spirits will revere and stand in awe.\n\nThe Exposition states: The intent of this chapter is to inspire sincere faith without deceit. Later scholars and gentlemen should follow the scripture’s teachings, and they shall not err.\n\nThe Exegesis states: The Thunder Master Haoxi, bowing in reverence to the Heavenly Worthy’s supreme transformation, was overcome with joy. Rising from his long prostration, he again addressed the Heavenly Worthy: From this day forward, those of noble virtue who receive this scripture must pledge their hearts with gold and silk before transmitting its text. Wherever this scripture resides, the Earth Deities and Life Mandates shall guard and protect it, while the Thunder Bureau shall descend to inspect and examine in due time. Those who recite and uphold it shall bring blessings to their households and enable their ancestors to ascend. Those who carry it will be revered by all, feared by ghosts and spirits, and upon encountering danger, invoking the Heavenly Worthy’s name will ensure deliverance. Thus, the merit of this scripture is truly inconceivable.\n\nThe Eulogy states:\nNot gold but a sincere heart is prized,\nFor the beginning adept, external demons assail.\nIf one is willing to swear oaths to Heaven and Earth,\nSwiftly shall you hear the jade tones of the Dao.\n\nThen the Thunder Master Haoxi, before the Heavenly Worthy, spoke this gatha:\nSupreme Jade Purity King,\nRuler of the thirty-six heavens.\nNine Heavens’ Universal Transformation Lord,\nManifesting forms across the ten directions.\nWith unbound hair riding a qilin,\nBarefoot treading layered ice.\nHolding the qi of the Nine Heavens,\nWhistling winds, lashing thunder.\nWith the power of wisdom,\nSubduing all demonic spirits.\nDelivering souls from eternal night,\nBenefiting all beings.\nLike the silver river’s waters,\nA thousand eyes, a thousand moon wheels.\nVowing in future kalpas,\nTo eternally exalt the Heavenly Worthy’s reverence.\n\nWhen the Thunder Master Haoxi finished this gatha,\n\nThe Annotation states: In this chapter, the Thunder Master Haoxi, suddenly enlightened, spoke this gatha to extol even a fraction of the Heavenly Worthy’s great virtue of cherishing life. Its literary grace flows brightly, its language resplendent—its merit and power defy description.\n\nThe Exposition states: The virtue of the Heavenly Worthy is beyond comprehension; thus, the Thunder Master Haoxi likened it to the Silver River. He spoke of the Heavenly Worthy’s primordial qi as supremely pure, noble, sagely, and luminous.\n\nThe Exegesis states: The Thunder Master Haoxi, his heart humbled by the divine efficacy, could find no words of praise sufficient. Thus, he composed this gatha. Our Heavenly Worthy, sovereign of the thirty-six heavens, transforms the vastness of the ten directions. When traversing the heavens, He rides a qilin with unbound indigo hair. When breaking through the Nine Springs, He treads layered ice with bare feet. \"Holding the qi of the Nine Heavens\" refers to the golden radiance of His ruyi scepter. Whistling winds and lashing thunder are the Heavenly Worthy’s commands. Slaying demons, expelling evil, delivering beings, and benefiting humanity—this is the Heavenly Worthy’s work of benefiting all beings. The waters of the Silver River are unseen by mortals, unfathomable in their mystery. \"A thousand eyes, a thousand moon wheels\" means that those who return to the teachings shall feel as though the Heavenly Worthy is ever before them.",
      "overlap_context": "pirits and hun-souls. When the appointed time arrives, the punishment is carried out, and their dead souls are then subjected to the Thunder Bureau’s driving, beating, and torture.\n\nIf one reforms, turns toward goodness, and surrenders to this scripture, their sins are immediately erased. If a man or woman incurs the wrath of thunder, and their headdress, hair, or beard is not singed, they may appeal to the Heavenly Worthy and seek divine judgment, for the myriad spirits will heed their command.",
      "start_char": 15840,
      "end_char": 17101,
      "start_sentence": 704,
      "end_sentence": 763,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.258774757385254,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "发愿广大，永阐天尊之教。 赞曰：赞叹天尊，诚哉是偈。 普化无边，祖劫一气。 天尊言：此经传世，世人未知。 吾今所治九天应元府，府有九天雷门使者，以斜录典者、廉访典者佐之。 复有四司：一曰掠剩司，二曰积逮司，三曰幽枉司，四曰报应司，各有大夫以掌其事。 吾之所理，卿师使相咸赞元化。 注曰：天尊自言所治之司官兵将史善恶，各付其职。 所以生杀之枢，皆由天尊之命令，三界万灵，莫不皆奉行也。 义曰：此章天尊自言善恶功业，各有所司，皆赞成元化也。 释曰：此章经问已毕，虑后学之士不知所治之属，所以列言。 凡所祈求，诸司官吏将兵闻吾之号令，咸赞元化也。 赞曰：设司分属掌雷霆，风火飞康号令明。 善赏恶诛如影响，九天元不顺人情。 天尊说是经毕，玉梵七宝层台，天花缤纷，琼香缭绕。 十方诸天帝君，咸称善哉。 天龙鬼神，雷部官众，三界万灵，皆大欢喜，信受奉行。 注曰：说经已矣，诸天帝君、雷部鬼神悉皆赞叹，踊跃而去。 凡我同志，信士善人，得遇宝经，当洗心涤虑，至诚朗诵真文，则祸难不萌，永保长生者也。 义曰：宣经赞化，三界十方皆得如意。 夫学者，得遇宝经玉篆，可斋心涤虑，酌水献花，如法诵之篆之，则诸祸不生，众善骈集也。 今至士体天心而洗己心，阅真文而造玄文，岂可不尽力奉持，以广大其化也哉。 释曰：宝经玉篆，非奉三清上境之勑、玉清真王之令，则不能垂示於世而化诸有情者也。 今经旨校正，注释分明，玉篆金章，灿然烁目。 凡祈请之士，可不斋心洁涤以阅玄文也耶。 至士道龄，职守都功，位居左院，用己神元，结之英成。 天尊普化之德，是日文成，黍列圣真之左。 而诵经者，不可亵渎，大则天诛，小则祸及也。 赞曰：宝经圆满，咸称善哉。 消灾赦罪，祸去视来。 九天应元雷声普化天尊玉枢宝经集注下竟 圆满吉祥灵章 向来诵经，念念存诚。 千真拱听，万圣通灵。 应元合无，普化分形。 九天有命，三界遵行。 消灾谢过，请福延生。 功圆行满，大道证明。 符篆 凡书一篆，当焚香起大敬心，至诚课诵，自正经首至於三章，并所祈本章毕。 然后心存天尊宝相，口诵天皇神咒书之。 常时仍用黄纸贴护篆文，用则展启。 以后符文，一体如之。 学道希仙第一章 召九灵三精第二章 遇本命生辰，严修斋戒，诵经称号，书篆焚。 解五行九曜克战刑冲第三章 沉痾痼疾咒诅冤牵第四章 消口舌唇吻第五章 禳上皇神煞禁忌第六章 求嗣息卫产难保婴孩第七章 灭乌妖蛇孽第八章 遣祟除妖灭邪巫魇祷第九章 消除蛊瘵超度祖玄第十章 水陆行藏第十一章 祷雨祈晴止禳水火第十二章 瞻星礼斗第十三章 闻经灭罪第十四章 佩奉萃福人钦鬼畏第十五章 续婚合章 凡有婴孩在於襁褓，为栴檀神王座下一十五种鬼加诸恼害，因多惊痫，宜诵此经。 谨按《释藏护诸童子经》中载，栴檀神王座下一十五种鬼形，常游行世问，恐怖婴孩及小儿，作诸怖畏之相。 人能诚心诵经焚符，则免此祸也。 第一名弥洲迦鬼，形如牛，着诸小儿，眼睛回转。 第二名弥迦王鬼，形如师子，着诸小儿数数呕吐。 第三名骞陀，形如鸠摩罗天，怖诸小儿，其两肩动。 第四名阿波悉魔罗，形中野狐，着诸小儿，口中沫出。",
      "translated_text": "Vowing with boundless resolve, they shall forever propagate the teachings of the Heavenly Worthy.\n\nPraise:\nWe extol the Heavenly Worthy—truly, this gatha is sincere.\nUniversally transforming without limit, from the primordial kalpas, one qi.\n\nThe Heavenly Worthy declares: This scripture has been transmitted through the world, yet mortals remain unaware. Now, the Nine Heavens’ Responding-to-the-Primordial Palace, which I govern, is served by the Nine Heavens’ Thunder Gate Envoys, assisted by the Recorders of Slanted Records and the Inspectors of Integrity. There are also four bureaus: the first is the Bureau of Surplus Seizures, the second the Bureau of Accumulated Arrests, the third the Bureau of Hidden Grievances, and the fourth the Bureau of Karmic Retribution. Each is overseen by a Grand Minister to manage its affairs. All whom I govern—ministers, masters, and envoys—all praise the primordial transformation.\n\nAnnotation:\nThe Heavenly Worthy speaks of the officials, soldiers, generals, and scribes under His governance, assigning each to their duties of good and evil. Thus, the pivot of life and death lies entirely in the Heavenly Worthy’s commands; the myriad spirits of the Three Realms all obey without exception.\n\nExegesis:\nThis chapter reveals that the Heavenly Worthy assigns each good and evil deed to its respective office, all of which praise and fulfill the primordial transformation.\n\nExposition:\nThis chapter concludes the scripture’s discourse, anticipating that later scholars may not know the offices under the Heavenly Worthy’s governance. Thus, they are listed here. For all prayers and petitions, the officials, officers, generals, and soldiers, upon hearing the Heavenly Worthy’s commands, all praise and fulfill the primordial transformation.\n\nPraise:\nOffices established, duties divided to wield thunder and lightning,\nWind and fire soar, commands resound with clarity.\nRewarding good and punishing evil as swiftly as shadow follows form—\nThe Nine Heavens’ Primordial never bends to mortal whim.\n\nWhen the Heavenly Worthy finished expounding this scripture, a seven-jeweled jade terrace of layered tiers appeared, celestial blossoms scattered in profusion, and fragrant jade incense curled in the air. The Heavenly Sovereigns of the ten directions all proclaimed, \"Excellent indeed!\" The dragon deities, ghostly spirits, thunder officials, and the myriad beings of the Three Realms all rejoiced greatly, faithfully receiving and upholding the teachings.\n\nAnnotation:\nOnce the scripture was expounded, the Heavenly Sovereigns and thunder officials, along with all ghostly spirits, praised it with exultation before departing. All of like mind—devout believers and virtuous people—who encounter this precious scripture should purify their hearts and cleanse their thoughts, reciting the true text with utmost sincerity. Thus, calamities shall not arise, and eternal longevity shall be preserved.\n\nExegesis:\nProclaiming the scripture and praising the transformation, the Three Realms and ten directions all attain their desires. Scholars who encounter this precious scripture and jade talismans should purify their hearts, cleanse their thoughts, offer water and flowers, and recite and inscribe them according to the proper method. Then, no misfortunes shall arise, and all virtues shall converge.\n\nNow, those of noble intent align their hearts with Heaven’s will, purify their own minds, peruse the true text, and compose the mysterious script. How can they not devote themselves wholeheartedly to upholding it, thereby magnifying its transformation?\n\nExposition:\nThis precious scripture and jade talismans could not have been bestowed upon the world to transform sentient beings without the decree of the Three Pure Realms’ supreme境 and the command of the Jade Pure True King. Now, the scripture’s purport has been collated and corrected, its annotations made clear; the jade talismans and golden chapters shine brilliantly. How can those who seek divine aid not purify their hearts and cleanse themselves to study the mysterious script?\n\nThe noble adept, Dao-ling, holds the office of Capital Merit, serving in the Left Academy. Employing his own spirit and primordial qi, he binds them into radiant accomplishment. On this day, the Heavenly Worthy’s virtue of universal transformation is perfected in scripture, arrayed to the left of the sagely and true. Those who recite this scripture must not treat it with irreverence—great offenses invite heavenly punishment, while lesser ones bring misfortune.\n\nPraise:\nThe precious scripture is complete—all proclaim, \"Excellent indeed!\"\nDisasters are dispelled, sins absolved; misfortunes depart, blessings arrive.\nThe *Jade Pivot Precious Scripture of the Nine Heavens’ Responding-to-the-Primordial, Thunder Voice, Universal Transformation Heavenly Worthy*, with Collected Annotations, concludes here.\n\nPerfect and Auspicious Mystic Chapter:\nFrom the outset of reciting the scripture, thought after thought, maintain sincerity.\nA thousand truths bow in attendance; ten thousand sages commune in spirit.\nResponding to the Primordial, merging with the formless,\nThe Nine Heavens issue their decree; the Three Realms comply.\nDispelling disasters, repenting transgressions,\nPraying for blessings, prolonging life.\nWhen merit is complete and conduct fulfilled,\nThe Great Dao bears witness.\n\nTalismans:\nWhenever inscribing a talisman, one should burn incense and arouse profound reverence, reciting with utmost sincerity from the beginning of the main scripture through the three chapters, including the chapter for one’s petition. Then, visualize the Heavenly Worthy’s precious form, recite the Heavenly Sovereign’s divine incantation, and inscribe it. At all times, protect the talisman with yellow paper. When using it, unfold it accordingly. The same applies to all subsequent talismanic texts.\n\nChapter One: Cultivating the Dao to Seek Immortality\nChapter Two: Summoning the Nine Numinous and Three Essences\nOn one’s natal day, observe strict purification rites, recite the scripture, invoke the titles, inscribe the talisman, and burn it.\n\nChapter Three: Resolving the Five Phases’ and Nine Luminaries’ Clashes and Conflicts\nChapter Four: Curing Chronic Illnesses, Curses, and Karmic Entanglements\nChapter Five: Dispelling Gossip and Slander\nChapter Six: Warding Off the Supreme August Spirits’ Calamities and Taboos\nChapter Seven: Praying for Offspring, Protecting Childbirth, and Safeguarding Infants\nChapter Eight: Eliminating Raven Demons and Serpent Afflictions\nChapter Nine: Dispelling Malevolent Spirits, Eradicating Demons, and Destroying Sorcerous Hexes\nChapter Ten: Dissolving Gu Poisons and Liberating Ancestral Spirits\nChapter Eleven: Safe Journeys on Water and Land\nChapter Twelve: Praying for Rain, Seeking Clear Skies, and Averting Water and Fire Disasters\nChapter Thirteen: Worshiping the Stars and Paying Homage to the Dipper\nChapter Fourteen: Hearing the Scripture and Eradicating Sins\nChapter Fifteen: Wearing the Talisman to Accumulate Blessings, Commanding Human Respect, and Instilling Ghostly Fear\n\nContinuation of Marriage Talismans:\nWhenever infants are in swaddling clothes, they may be afflicted by the fifteen kinds of ghosts under the Sandalwood Spirit King, causing frequent convulsions. It is fitting to recite this scripture.\n\nAccording to the *Sutra for Protecting All Children* in the Buddhist Canon, the Sandalwood Spirit King’s fifteen ghostly forms roam the world, terrifying infants and young children with various frightening appearances. Those who sincerely recite the scripture and burn the talisman shall avoid this calamity.\n\nFirst: The Mijiuqia Ghost, shaped like an ox, possessing children and causing their eyes to roll.\nSecond: The Mijiawang Ghost, shaped like a lion, possessing children and causing repeated vomiting.\nThird: The Qiantuo, shaped like the Kumāra Deva, frightening children and making their shoulders twitch.\nFourth: The Aboximoluo, shaped like a wild fox, possessing children and causing foam to issue from their mouths.",
      "overlap_context": "eavens\" refers to the golden radiance of His ruyi scepter. Whistling winds and lashing thunder are the Heavenly Worthy’s commands. Slaying demons, expelling evil, delivering beings, and benefiting humanity—this is the Heavenly Worthy’s work of benefiting all beings. The waters of the Silver River are unseen by mortals, unfathomable in their mystery. \"A thousand eyes, a thousand moon wheels\" means that those who return to the teachings shall feel as though the Heavenly Worthy is ever before them.",
      "start_char": 17101,
      "end_char": 18448,
      "start_sentence": 764,
      "end_sentence": 822,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.56816387176514,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "第五名牟致迦，形如播猴，着诸小儿，把拳不展。 第六名魔致迦，形如罗剎女，着诸小儿，自啮其舌。 第七名阎弥迦，其形如马，着诸小儿，喜啼喜笑。 第八名迦弥尼，形如妇女，着诸小儿，乐着女人。 第九名黎波坁，其形如狗，着诸小儿，现种种杂相。 第十名富多那，其形如猜，着诸小儿，眠中惊怖啼哭。 第十一名曼多难提，形如猫儿，着诸小儿，眠中喜啼喜笑。 第十二名舍究尼，其形如乌，着诸小儿，不肯饮乳。 第十三名犍咤波尼，其形如鸡，着诸小儿，咽喉声塞。 第十四名目佉曼茶，形如黑狐，着诸小儿，时气热病下痢。 第十五名蓝婆，其形如蛇，着诸小儿，数噫数喊。 玄阳子所遇雷霆玉经，本末如是，如是其必有自来矣。 不以自秘，方将梓而广之，其所以与人为善之志甚荐。 予虽未识其为人，固已先识其为心，知其非寻常人也。 虽然至道无言，至言无迹，神而明之，存乎其人，子既有得於言语文字中矣。 推致其功，乃复有得於言语文字外。 无宁使人谓子为泥象执文者，是则予之至望也子其勉之。 至顺癸酉上元日，嗣三十九代天师太玄子书。",
      "translated_text": "Fifth: The Muzhijia, shaped like a macaque, possessing children and causing their fists to clench without release.\nSixth: The Mozhijia, shaped like a rākṣasī woman, possessing children and causing them to bite their own tongues.\nSeventh: The Yanmijia, shaped like a horse, possessing children and making them prone to weeping and laughter.\nEighth: The Jiamini, shaped like a woman, possessing children and causing them to delight in women.\nNinth: The Libodi, shaped like a dog, possessing children and manifesting various miscellaneous forms.\nTenth: The Fuduna, shaped like a boar, possessing children and causing them to startle in fright and weep while asleep.\nEleventh: The Mandonanti, shaped like a cat, possessing children and making them prone to weeping and laughter in their sleep.\nTwelfth: The Shejiuni, shaped like a crow, possessing children and causing them to refuse milk.\nThirteenth: The Jianzhaboni, shaped like a chicken, possessing children and causing their throats to become obstructed.\nFourteenth: The Muqumancha, shaped like a black fox, possessing children and afflicting them with seasonal febrile illnesses and dysentery.\nFifteenth: The Lanpo, shaped like a snake, possessing children and causing them to hiccup and cry out repeatedly.\n\nThe *Thunder and Lightning Jade Scripture* encountered by Master Xuanyang is thus in its entirety, and thus it must have its origins. Rather than keeping it secret, he has now resolved to print and disseminate it widely, demonstrating his profound aspiration to benefit others. Though I have not met the man, I have already come to know his heart, and I recognize that he is no ordinary person.\n\nYet the supreme Dao is wordless, and the most profound teachings leave no trace. Their spiritual illumination and clarity depend upon the individual. You have already gained insight through written words, but by extending this effort, you may yet attain understanding beyond them. Far better that others should call you one who clings to mere images and texts—this is my deepest hope for you. Strive onward.\n\nWritten on the fifteenth day of the first lunar month in the *guiyou* year of the Zhishun era, by the thirty-ninth-generation Celestial Master, Taixuanzi.",
      "overlap_context": "who sincerely recite the scripture and burn the talisman shall avoid this calamity.\n\nFirst: The Mijiuqia Ghost, shaped like an ox, possessing children and causing their eyes to roll.\nSecond: The Mijiawang Ghost, shaped like a lion, possessing children and causing repeated vomiting.\nThird: The Qiantuo, shaped like the Kumāra Deva, frightening children and making their shoulders twitch.\nFourth: The Aboximoluo, shaped like a wild fox, possessing children and causing foam to issue from their mouths.",
      "start_char": 18449,
      "end_char": 18908,
      "start_sentence": 823,
      "end_sentence": 840,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.322937488555908,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\九天应元雷声普化天尊玉枢宝经集注.txt",
        "category": "玉诀类"
      }
    }
  ]
}