{
  "source_id": "九转灵砂大丹",
  "source_file": "chunked_daozang\\九转灵砂大丹.json",
  "total_chunks": 4,
  "total_original_chars": 4376,
  "total_translated_chars": 23514,
  "total_translation_time": 116.77191066741943,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\九转灵砂大丹.txt",
    "category": "众术类"
  },
  "full_translation": "**The Nine-Turned Numinous Cinnabar Grand Elixir**\n\n**Title:** *Nine-Turned Numinous Cinnabar Grand Elixir*. Author unknown, likely composed in the Tang dynasty. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Zhongshu* category.\n\n**Nine-Turned Numinous Cinnabar Grand Elixir**\n\n**Method for Stir-Frying Numinous Cinnabar**\nTake one *jin* of mercury and four *liang* of sulfur. Use a new iron wok, washed clean with water. Prepare a brazier with three small bricks to support the wok. Heat the wok’s base with a small charcoal fire, then rub it with yellow wax to lubricate. Heat an iron spatula and rub it with wax as well. First melt the sulfur into a liquid, then add the mercury. Two people should sit facing each other, gripping the wok’s edges, and stir continuously with the iron spatula. If yellow smoke rises, sprinkle rice vinegar to suppress it, then resume stirring. Once congealed, remove and pound with a willow-wood mallet, or grind in a mill until fine. Return to the wok and stir-fry until it turns the color of green brick. Stir-fry for approximately three *shi* (six hours) until thoroughly cooked and the cinnabar becomes firm. Remove, grind finely, and sift through a sieve—this is called \"Verdant Gold Head Powder.\"\n\n**Method for Constructing the Furnace**\nOn an auspicious *yang* day, use over ten clay bricks to build a furnace, two *chi* high, round above and square below, with a wooden base. The furnace should hold about five *jin* of charcoal. The interior height should be one *chi* and five *cun*, with seven iron rods placed below as a grate. The grate should be five *cun* above the wind door, which is sealed with mud and left to dry before use.\n\n**Method for Casting the Cauldron**\nUse raw iron to forge a Water-Fire Cauldron, with a total height of one *chi* and two *cun*. The Fire Cauldron should be eight *cun* high, with an inner mouth diameter of five *cun* and an outer rim spanning one *chi*. The base of the Fire Cauldron should be five *fen* thick. The Water Cauldron should be four *cun* high, with a base two *fen* thick. Cast the Water-Fire Cauldron in a smelting furnace, ensuring the joint of the inner mouth fits tightly.\n\n**Method for Ascending the Cinnabar**\nFirst, place a large pot with yellow clay and water, then set the Water-Fire Cauldron inside and boil for approximately three *shi*. Remove, wash clean, and dry. Grind ink with rice vinegar and use a brush to coat the interior of the Fire Cauldron and the base of the Water Cauldron. Then, burn *shi hu* (dendrobium) and mugwort leaves to fumigate, dispelling the iron’s *qi*. Once cool, place the cauldron steadily. Gently scoop the previously prepared Verdant Gold Head Powder into the Fire Cauldron, leaving space—about three fingers’ width from the base of the Water Cauldron. Seal the inner mouth with red halloysite mixed with vinegar, place the Water Cauldron on top, and press firmly. Thread iron wire through the upper and lower holes of the Water-Fire Cauldron and bind tightly. Seal the outer joint with Six-*Yi* Salt Mud, one *cun* thick. Fashion a hook from sturdy iron wire, one *chi* and five *cun* long, and attach it to the hole in the Fire Cauldron’s rim. Secure with a hemp rope and suspend the cauldron over the furnace. Arrange five *jin* of hard charcoal blocks inside the furnace, with four *liang* of kindling below. On an auspicious morning, light the fire and fan the wind door. Begin with gentle heat, then increase to strong. If the charcoal softens, add one or two *jin*. Fill the Water Cauldron eight-tenths with warm water, and as it boils, frequently replenish with cool water to prevent overflow. Gradually lower the cauldron closer to the fire until the charcoal is fully consumed—this takes about half a day. After cooling overnight, remove the cauldron, scrape off the mud, and open it. The numinous cinnabar will have ascended to the base of the Water Cauldron; remove and wrap it.\n\n**Method for Steeping the Cinnabar**\nTake one or two *jin* of numinous cinnabar and break it into pieces the size of large soybeans. Sew a long bag from fine, clean hemp cloth. Place the cinnabar inside, tie the bag’s mouth securely, and do not disturb it. Use a large porcelain jar capable of holding five *sheng* of liquid. Burn an unspecified amount of mulberry wood in a clean place to make ash, and let it cool. Measure one *dou* of ash, line the bottom of a sieve with a layer of summer cloth, and place the ash on top. First, pour boiling water to moisten the ash. For every *dou* of ash, use two *dou* of cold water, gradually pouring it into the sieve to leach the liquid. It is better for the liquid to be slightly scant and thick. Pour the liquid into the jar, place it in a brazier, and simmer with charcoal fire. Suspend the bag of cinnabar in the center of the jar—this is called \"suspended gestation.\" Simmer gently until the liquid bubbles like crab eyes, and steep for seven full *fu* days. Bring to a boil two or three more times, then remove and dry in the sun. This is called the \"confinement method.\"\n\n**Method for Making Silver Beads**\nTake approximately twenty *liang* of refined silver and further refine it with black lead ash until completely pure. Place it in a crucible and melt into a liquid. Bundle fresh bamboo tips with leaves into a mat and lay it horizontally in a large porcelain vat. Carefully pour the silver liquid onto the mat, stirring rapidly—the silver will form millet-sized beads. If any are too large, remelt and pour again, selecting only the finest beads.\n\n**First-Turn Primary Elixir Method**\nCast a box from raw iron, or forge one from wrought iron. Each box should hold about twenty *liang* of silver beads. First, mix white kaolin with rice vinegar and coat the inside of the box to a thickness of one *fen*. Let it dry in the sun. Then, take one *jin* of the previously prepared beads and four *liang* of steeped numinous cinnabar, using a ratio of four to one. Layer them like planting lotus seeds until the box is full. Cover with Kunlun paper. If the box’s top is not full, fill it with dry, crushed yellow earth. Seal the inner mouth with red halloysite mixed with vinegar, and bind it crosswise with iron wire. Coat the outside of the box with paper fiber and numinous mud to a thickness of half a finger. Let it dry in the sun, then place it in an ash jar to nurture the fire. Use a small-mouthed jar capable of holding nine *dou* of ash.\n\nFirst, line the bottom of the jar with yellow earth to a thickness of three *cun*. Place a small three-legged iron stand, five *cun* in height, with its legs facing upward. Position the elixir box atop the stand, ensuring it does not tilt, and bury it in paper-money ash. Then, use a larger iron stand to enclose the smaller one, weaving an iron-wire mesh above it to create a grid. This grid should be one finger’s width above the elixir box. Place the fire above the grid, then cover it with five *cun* of ash. Adjust the fire at *mao* and *you* hours, nurturing it for two seven-day periods. The fire grades—two, three, four, five, six, seven, eight—should all use paired measures. Once the time is complete, let it cool thoroughly before opening the box. The cinnabar will resemble newly forged iron in color. Split a piece with a knife; if no red hue remains within, the elixir is ripe. If any redness persists, the fire was unevenly applied—do not disturb it. Reseal and nurture it again for three seven-day periods, increasing the fire slightly beyond the previous intensity. It will surely succeed. Separate the silver beads.\n\nTo refine this cinnabar into treasure, take one *liang* of cinnabar and one *liang* of black lead, and smelt them together in an ash crucible. Each *liang* of cinnabar will yield eight *qian* of pure silver. Treasure it for further transmutation.\n\n**Second Transmutation: True Yang Elixir Method**\nUse sixteen *liang* of the initial true elixir as the matrix. Prepare one *jin* of numinous cinnabar by boiling it in mulberry sap, then take four *liang* of it. Layer it with the elixir matrix in the box, following the lotus-seeding method, in a four-to-one ratio. Seal as before, dry in the sun, and place it atop the three-legged stand in the ash jar. Enclose it as previously described, apply fire, and adjust at *mao* and *you* hours for one seven-day period. The fire grades—two, three, four, five, six, seven, eight—should all use paired measures. Once the time is complete, let it cool, then open the box. The new cinnabar will match the elixir matrix. Separate the new cinnabar and set it aside. Take another four *liang* of the boiled cinnabar, layer it with the matrix as before, seal, and nurture it in the jar. Repeat this four times to obtain one *jin* of new cinnabar. To test its maturity, smelt it with black lead as before; each *liang* of cinnabar will yield eight *qian* of silver. If not smelted, reserve it as a matrix for further transmutations, or use the old matrix as desired.\n\n**Third Transmutation: Absolute True Elixir Method**\nUse sixteen *liang* of the True Yang Elixir as the matrix. Take twelve *liang* of unboiled numinous cinnabar and four *liang* of transparent cinnabar, place them together in a hemp cloth bag, and boil them in a jar of mulberry-ash sap for seven seven-day periods. Once the time is complete, remove and bring to a boil, then dry in the sun. Grind them finely and sift through a silk sieve. Mix with Jade Maiden’s nectar (the sap of the paper mulberry) to form a paste. Press firmly, dry in the sun, and chisel into pieces the size of large soybeans. First, take four *qian* of chalcanthite and one *qian* of sulfur, grind them finely, and stir-fry in a pan until they turn purple. Grind into a fine powder, then dip each piece of cinnabar in matured rice vinegar and roll it in the chalcanthite-sulfur powder—this is called the \"body-adhering medicine.\" Layer it with the elixir matrix in a four-to-one ratio, seal the box, and place it atop the three-legged stand in the ash jar. Enclose as before, apply fire, and adjust at *mao* and *you* hours for two seven-day periods. The fire grades—two, three, four, five, six, seven, eight—should all use paired measures. Once the time is complete, let it cool, then open the box. The cinnabar will again resemble newly forged iron. Separate the mother and child elixirs alike. Repeat this four times to gather one *jin* of new cinnabar. To refine it into treasure, test it as before with the old mother elixir, and use it as desired.\n\n**Fourth Transmutation: Wondrous Numinous Elixir Method**\nTake sixteen *liang* of the Absolute True Elixir and crush it. Clean a porcelain box and spread the crushed cinnabar inside. Add one *liang* of closed-mouth Sichuan peppercorns and three bowls of water to a porcelain vessel, boiling until two bowls remain. Strain thoroughly, then pour in four *liang* of mercury and boil for about one hour. Remove and quickly pour off the pepper-infused water, letting it dry. While the mercury is still hot, pour it into the cinnabar in the box. Seal the box’s opening with vinegar-mixed red halloysite, bind it with iron wire, and reinforce the exterior with paper fiber and numinous mud. Dry in the sun, then place a water-boiling jar beneath the box, filled with five *sheng* of water, its mouth level with the box’s base. Fill the jar seven-tenths with boiling water, place the elixir box atop it, and seal the joint with salt mud. Do not use the three-legged stand. Bury it in the ash jar, enclose it, and nurture for three seven-day periods, adjusting the fire at *mao* and *you* hours with five or six paired measures. Once the time is complete, let the furnace cool, open the box, and observe that the mercury has vanished. Weigh the cinnabar—it will retain its original weight. Do not disturb it; instead, boil another four *liang* of mercury as before and pour it into the cinnabar in the box. Seal the opening, reinforce as before, dry in the sun, and refill the water jar seven-tenths with boiling water. Place the elixir box atop it, seal the joint, and return it to the ash jar. Apply fire as before, adjusting at *mao* and *you* hours for three seven-day periods. Once cooled, open the box to find faint crystalline peaks. Weigh the cinnabar—it will still retain its weight. Repeat this four times, adding a total of one *jin* of mercury. Then, cease further additions. Seal as before, fill the water jar to the brim, place the elixir box atop it, and seal the opening without adding more mercury. Nurture it for five seven-day periods, adjusting the fire at *mao* and *you* hours with four, five, six, seven, or eight paired measures. Once the time is complete, let it cool, open the box, and behold the elixir surging upward like a forest of jade trees. Only then may you harvest the white sprouts—this process of pouring and harvesting is inexhaustible.\n\n**Fifth Transmutation: Water Immortal Elixir Method**\nTake one *jin* of elixir sprouts from the Wondrous Numinous Elixir, ensuring they are pure and free of impurities. Spread them in a clean porcelain box, then pour in half a *jin* of fine mercury pearls directly into the sprouts.\n\nSeal the opening as before, bind it securely, and place a water jar beneath the box, sealing it likewise. Set it in an ash jar without a cover, with fire on all four sides. Nurture it for five seven-day periods, adjusting the fire at *mao* and *you* hours with two, three, four, five, six, seven, or eight paired measures. Once the time is complete, let it cool, open the box, and behold the elixir surging upward like peaks and ridges. Do not disturb it; pour mercury as before and nurture it again in the sealed manner. When the box is full, trim the excess and divide it.\n\nIf you wish to refine it into treasure, boil it with river water and a small amount of frankincense for one seven-day period, then place it in a crucible to melt into a supreme treasure, ready for use. From this point onward, lead smelting is no longer required, for the elixir transforms into treasure of its own essence.\n\n**Sixth Transmutation: Penetrating the Mysterious Elixir Method**\nTake four *liang* of Water Immortal Elixir. Boil it as before with river water and frankincense, then melt it into treasure. Forge a chamber, using three *liang* for the base and one *liang* for the lid. Seal the seams tightly, ensuring it is just large enough to hold the ingredients. Use one *liang* each of refined *cizhu* (female cinnabar) and *xiongwei* (male cinnabar), along with one *liang* each of high-quality yellow and purple *pao* (processed minerals). Grind them finely together and place them in the chamber. Seal the opening with vinegar-mixed red halloysite, then set the chamber in the center of a porcelain box. Spread Water Immortal Elixir sprouts over it, seal the porcelain box’s opening, and bind it securely without external sealing. Place it on a tripod in an ash jar, bury it in ash, and cover it. Apply fire from above, adjusting at *mao* and *you* hours for three seven-day periods, using two, three, four, five, six, seven, or eight paired measures. Once the time is complete, let it cool, open the box, and remove the covering. The chamber and its contents will be uniformly purple-red, like the Three Yellows. Test a small piece of the yellow elixir on silver until it turns pure red. If the top is red but the bottom pale, the elixir is not yet ripe. Only when it is red through to the bottom is it ready for transmutation; reserve some for further refinement.\n\n**Seventh Transmutation: Treasure Spirit Elixir Method**\nTake six *liang* of unboiled cinnabar and two *liang* of raw realgar. Use four *liang* of the previously nurtured Three Yellows, reserving one *liang* for the surface. Grind them together and place them in a porcelain box, leaving one *liang* of elixir to grind finely and spread on top. Seal the opening with vinegar-mixed red halloysite, bind the box with iron wire in a cross pattern, and further secure it with paper fiber and numinous clay. Let it dry in the sun, then place it on a tripod in an ash jar, bury it in ash, and cover it. Apply fire from above for five seven-day periods, adjusting at *mao* and *you* hours with two, three, four, five, six, seven, or eight paired measures. Once the time is complete, add three *jin* of fire on all four sides to refine it. Let it cool, then test it: place five *liang* of mercury in a *jian* bowl, sprinkle one *qian* of elixir powder over it, and apply gentle heat to the mercury. Cover the bowl tightly, seal the opening with vinegar-soaked paper, and wait until the sound ceases. Remove the cover to find the mercury transformed into a purple treasure. Melt it in a crucible to form golden treasure. Reserve some for further refinement; the rest may be used as before.\n\n**Eighth Transmutation: Spirit Treasure Elixir Method**\nTake seven *liang* of Treasure Spirit Elixir, reserving two *liang* to coat the surface. Use five *liang* of cinnabar refined from balanced sulfur and mercury, along with one *liang* each of female and male sulfur pearls. Grind them finely and place them in the box, reserving two *liang* of elixir to grind finely and spread on top. Seal it, let it dry in the sun, and place it on a tripod in an ash jar. Adjust the fire at *mao* and *you* hours for seven seven-day periods, using two, three, four, five, six, seven, or eight paired measures. Once the time is complete, let it cool and open the box to find the elixir fused into a single mass, its purple hue dazzling to the eye and radiant with beauty. It may be used to cultivate golden sprouts or for further transmutation; reserve some for the great elixir.\n\n**Ninth Transmutation: Ascending to Perfection Elixir Method**\nTake sixty *liang* of Spirit Treasure Elixir and thirty *liang* of Two-Eight Cinnabar. Grind them together and mix with donkey’s milk to form a paste. Then take two *jin* of golden sprouts, melt them into treasure, and forge a golden spirit chamber. Fill it completely with the elixir mixture. Seal the opening with vinegar-mixed red halloysite. Cast a copper box slightly larger than the chamber, leaving a finger’s width of space on all sides. Use lead dan and alum, each prepared separately in a vessel with five *jin* of charcoal fire, then grind them into fine powder. Spread this evenly over the chamber to seal it. Next, seal the copper box without external binding and place it in an ash pit.\n\nChoose an auspicious altar site according to the proper directions, and select an auspicious day and hour to begin the firing. Adjust the fire at *mao* and *you* hours for seven seven-day periods, using the same fire measures as before. Once the time is complete, add three *jin* of fire on all four sides to refine it. When the fire has fully subsided, remove the box, discard the copper outer layer, and place the golden sprout elixir chamber in the center of the altar. Dig a pit five *chi* deep and bury it for fifty days. Retrieve it, wrap it in three to five layers of oiled paper, then three to five layers of cloth, and bind it with hemp rope. Suspend it in a well for fifty days until it reaches the bottom. Remove it, grind it into fine powder, and mix it with the natural juice of Solomon’s seal or Jade Maiden’s essence to form pills the size of chicken’s heads. Let them dry, then place them back in the golden chamber, seal the opening, and set it on a tripod in an ash jar. Apply fire for one seven-day period, adjusting at *mao* and *you* hours with two, three, four, five, six, seven, or eight paired measures. Once the time is complete, let it cool and test a pill by dropping it into cold water—the water should roil like boiling liquid. Place one *jin* of mercury in a *jian* bowl, add one pill, and cover the bowl tightly. Seal the opening with vinegar-soaked paper, apply gentle heat to the mercury, and wait until the sound ceases like autumn cicadas. Remove the cover to find the mercury transformed into a superior purple treasure. When melted, its purple luster will dazzle the eyes—this is the sign of elixir completion.\n\nPrepare an offering of the elixir and present it to the Supreme Emperor. Await a response, then take three pills with well water. First, place a water jar nearby, then enter the jar. Have fellow Daoists guard you from outside until the water grows warm, then emerge.\n\nEnter a second water jar, then a third, and you will feel your body grow light and your spirit transformed. The next day, proceed as before. Repeat this three times, through nine jars of water, swallowing nine pills in total. Naturally, your body will radiate light, and you will see cloud chariots descend to welcome you, as if ascending in a carriage of clouds and rosy dawn.\n\n**The Pouring and Drenching Method**\nPrepare a well-fitted ceramic box. Take one *jin* of the initial true elixir, and first use flowing water in a ceramic vessel to bathe it over a slow fire for one hour, allowing it to simmer gently before removing and drying in the sun. Spread it in the box. Then take one *liang* of Sichuan peppercorns—selecting only the tightly closed ones—and place them in a ceramic bottle with three bowls of pure water. Boil down to two bowls, then strain out the dregs. Add four *liang* of mercury, boil again for one hour, then quickly remove the pepper-infused water and wipe the mercury dry with paper. While still hot, pour the mercury into the box with the elixir, cover tightly with Kunlun paper, and fill the remaining space with clay lumps. Seal as before and dry in the sun.\n\nPrepare a water-boiling bottle with an opening that fits snugly against the bottom of the box, filling it with three *sheng* of water. First, pour seven parts of boiling water into the bottle. Seal the rim with a ring of mud, place the box on top, and secure the edges. Set it in an ash jar without a tripod, simply covering it. Nurture with top-fire for three *fu* periods, adjusting the fire at dawn and dusk, using four, five, or six *liang* of fuel as needed. Once the time is complete, let it cool, remove the box, and open it—no mercury should be visible, as it will have fully entered the elixir sand. Weigh it to confirm the original weight, then leave it undisturbed. Seal and drench again as before. Repeat this four times, each time adding seven parts of boiling water to the bottle, placing the box on top while hot for best results.\n\nAfter four repetitions, perform one \"empty nurturing.\" During empty nurturing, fill the water bottle to the brim, seal as before, and place the box on top without covering it. Surround it with fire on all sides, nurturing for five *fu* periods, adjusting the fire at dawn and dusk with four, five, six, seven, or eight *liang* of fuel as needed. Once the time is complete, let it cool, open the box, and carefully remove some sprouts. Test them on charcoal fire—if they melt into perfect pearls without cracking, they are ready. If they scatter or crack, perform another empty nurturing.\n\nTo refine into treasure, do not use lead smelting; instead, melt in a crucible to form the treasure. If further pouring is needed, divide the full box according to the four-to-one ratio and nurture as before. After every four pourings, perform one empty nurturing. Test until it forms treasure, then proceed with further pouring. If the sprouts are too tender, do not drench—nurture again until they form perfect pearls before continuing. Thus is the Great Elixir of Ninefold Transmuted Cinnabar completed.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "九转灵砂大丹 经名：九转灵砂大丹。 未着撰人，似出唐代。 一卷。 底本出处：《正统道藏》洞神部众街类。 九转灵砂大丹 炒灵砂法 用水银一斤　硫黄四两 右用新铁锅一口，用水洗净。 火盆一个，放小砖三块，架起铁锅。 锅底用少炭火逼热，先用黄蜡擦令锅润。 铁铲亦烘热，用蜡擦润。 先下硫黄，熔成汁。 次下水银，两人对坐，钳住锅边，用铁铲不住手炒，如有黄姻起时，即用米醋洒之，姻止再炒。 如结成取下，用柳木槌擂碎，或入碾碾细。 再台上锅炒，令青砖色为度。 约炒三个时辰，炒得熟时，升砂坚固。 如此铲‘出，入碾细罗过起，名青金头末。 造炉法 先择阳日，用土砖十余个，砌炉一座，高二尺，上圆下方，着底用木板。 炉中约盛炭五斤为准，炉内高一尺五寸，下用铁条七根作隔眼，隔下高五寸，作风门，泥之，候乾方用。 铸鼎法 用生铁造水火鼎一付，通高一尺二寸。 火鼎高八寸，内子口径过五寸，边连子口阔一尺。 火鼎底厚五分，水鼎高四寸，水鼎底厚二分。 用大治炉中铁汁，铸造水火鼎，子口缝要合得。 升砂法 先用大锅，内入黄泥并水，就放水火鼎在锅内，煮滚约三个时辰，取出。 再以水洗净，烘乾，用米醋磨墨，以笔蘸墨，涂火鼎内并水鼎底。 再用石斛并艾叶，烧炯熏之，隔铁气，候玲放稳，却将前青金头末，以匙轻挑入火鼎中，令虚不可满，约离水鼎底三指为准。 醋调赤石脂，封子口，坐上水鼎，按实，用铁线串水火鼎上下眼，紧札定。 外子口再用六乙盐泥固济，一寸厚。 用康铁线条作钩，长一尺五寸，火鼎边眼内钩起。 上用麻索一条击定，悬挂於炉上。 炉内先以成块硬炭五斤，排砌於内，下用引火四两，择日早辰起火，以扇去风门口绷之，先文后武。 如炭软加一二斤，水鼎内先下温汤八分，滚时常以玲水抽添，不要滚出。 渐渐放鼎近火，看炉内火尽为度，约有半日。 隔一夜寒炉，取出，铲去土，凿开，其灵砂升於水鼎底，取出包起。 煮砂法 将灵砂一斤，或二斤，凿成大黄豆块。 以净细麻布，缝一长袋。 将碗砂倾入袋中，线札住袋口，不要动，用大磁瓶一个，约盛五升汤者，将桑柴不问多少，於诤处烧灰，放玲，量灰一斗。 箩底先用夏布一层，放上灰，先用滚汤浇湿。 每灰一斗。 用冷水二斗。 旋倾入箩内淋之，宁水少些，汁稠为妙。 取汁倾入瓶中，放在火盆内，用炭火煨滚。 却将前袋中砂，悬挂在瓶内居中，谓之悬胎。 用慢火煨如蟹眼滚，煮七伏时日足。 再滚二三滚，取出晒乾。 谓之困法。 做银珠子法 约用花银二十两，再用黑铅灰池煎过，十分净彻。 入甘锅内，化成汁。 用新竹梢一把，连叶札成篇，横放在大磁缸内，将银汁细倾於篇上，急摆动，其银成粟米细珠。 如大者，再化再倾，拣取细珠用更好。 一转初真丹法 右用生铁铸盒子一个，或熟铁打盒子亦可。 一盒约盛银珠二十两。 先用白善土、米醋，调涂盒子内，一分厚。 日乾，却将前珠子一斤，并煮过灵砂四两。 每用四一之数，如栽莲子法。 层问满合，以昆仑纸盖定。 盒顶不满，用乾碎黄土填实。 用醋调赤石脂，封子口盖住，用铁线十字札定。 合子外用纸筋、灵泥通固，约半指厚。 日乾，入灰缸内养火。 又用小口缸一个，约盛灰九斗者。",
      "translated_text": "**The Nine-Turned Numinous Cinnabar Grand Elixir**\n\n**Title:** *Nine-Turned Numinous Cinnabar Grand Elixir*. Author unknown, likely composed in the Tang dynasty. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Zhongshu* category.\n\n**Nine-Turned Numinous Cinnabar Grand Elixir**\n\n**Method for Stir-Frying Numinous Cinnabar**\nTake one *jin* of mercury and four *liang* of sulfur. Use a new iron wok, washed clean with water. Prepare a brazier with three small bricks to support the wok. Heat the wok’s base with a small charcoal fire, then rub it with yellow wax to lubricate. Heat an iron spatula and rub it with wax as well. First melt the sulfur into a liquid, then add the mercury. Two people should sit facing each other, gripping the wok’s edges, and stir continuously with the iron spatula. If yellow smoke rises, sprinkle rice vinegar to suppress it, then resume stirring. Once congealed, remove and pound with a willow-wood mallet, or grind in a mill until fine. Return to the wok and stir-fry until it turns the color of green brick. Stir-fry for approximately three *shi* (six hours) until thoroughly cooked and the cinnabar becomes firm. Remove, grind finely, and sift through a sieve—this is called \"Verdant Gold Head Powder.\"\n\n**Method for Constructing the Furnace**\nOn an auspicious *yang* day, use over ten clay bricks to build a furnace, two *chi* high, round above and square below, with a wooden base. The furnace should hold about five *jin* of charcoal. The interior height should be one *chi* and five *cun*, with seven iron rods placed below as a grate. The grate should be five *cun* above the wind door, which is sealed with mud and left to dry before use.\n\n**Method for Casting the Cauldron**\nUse raw iron to forge a Water-Fire Cauldron, with a total height of one *chi* and two *cun*. The Fire Cauldron should be eight *cun* high, with an inner mouth diameter of five *cun* and an outer rim spanning one *chi*. The base of the Fire Cauldron should be five *fen* thick. The Water Cauldron should be four *cun* high, with a base two *fen* thick. Cast the Water-Fire Cauldron in a smelting furnace, ensuring the joint of the inner mouth fits tightly.\n\n**Method for Ascending the Cinnabar**\nFirst, place a large pot with yellow clay and water, then set the Water-Fire Cauldron inside and boil for approximately three *shi*. Remove, wash clean, and dry. Grind ink with rice vinegar and use a brush to coat the interior of the Fire Cauldron and the base of the Water Cauldron. Then, burn *shi hu* (dendrobium) and mugwort leaves to fumigate, dispelling the iron’s *qi*. Once cool, place the cauldron steadily. Gently scoop the previously prepared Verdant Gold Head Powder into the Fire Cauldron, leaving space—about three fingers’ width from the base of the Water Cauldron. Seal the inner mouth with red halloysite mixed with vinegar, place the Water Cauldron on top, and press firmly. Thread iron wire through the upper and lower holes of the Water-Fire Cauldron and bind tightly. Seal the outer joint with Six-*Yi* Salt Mud, one *cun* thick. Fashion a hook from sturdy iron wire, one *chi* and five *cun* long, and attach it to the hole in the Fire Cauldron’s rim. Secure with a hemp rope and suspend the cauldron over the furnace. Arrange five *jin* of hard charcoal blocks inside the furnace, with four *liang* of kindling below. On an auspicious morning, light the fire and fan the wind door. Begin with gentle heat, then increase to strong. If the charcoal softens, add one or two *jin*. Fill the Water Cauldron eight-tenths with warm water, and as it boils, frequently replenish with cool water to prevent overflow. Gradually lower the cauldron closer to the fire until the charcoal is fully consumed—this takes about half a day. After cooling overnight, remove the cauldron, scrape off the mud, and open it. The numinous cinnabar will have ascended to the base of the Water Cauldron; remove and wrap it.\n\n**Method for Steeping the Cinnabar**\nTake one or two *jin* of numinous cinnabar and break it into pieces the size of large soybeans. Sew a long bag from fine, clean hemp cloth. Place the cinnabar inside, tie the bag’s mouth securely, and do not disturb it. Use a large porcelain jar capable of holding five *sheng* of liquid. Burn an unspecified amount of mulberry wood in a clean place to make ash, and let it cool. Measure one *dou* of ash, line the bottom of a sieve with a layer of summer cloth, and place the ash on top. First, pour boiling water to moisten the ash. For every *dou* of ash, use two *dou* of cold water, gradually pouring it into the sieve to leach the liquid. It is better for the liquid to be slightly scant and thick. Pour the liquid into the jar, place it in a brazier, and simmer with charcoal fire. Suspend the bag of cinnabar in the center of the jar—this is called \"suspended gestation.\" Simmer gently until the liquid bubbles like crab eyes, and steep for seven full *fu* days. Bring to a boil two or three more times, then remove and dry in the sun. This is called the \"confinement method.\"\n\n**Method for Making Silver Beads**\nTake approximately twenty *liang* of refined silver and further refine it with black lead ash until completely pure. Place it in a crucible and melt into a liquid. Bundle fresh bamboo tips with leaves into a mat and lay it horizontally in a large porcelain vat. Carefully pour the silver liquid onto the mat, stirring rapidly—the silver will form millet-sized beads. If any are too large, remelt and pour again, selecting only the finest beads.\n\n**First-Turn Primary Elixir Method**\nCast a box from raw iron, or forge one from wrought iron. Each box should hold about twenty *liang* of silver beads. First, mix white kaolin with rice vinegar and coat the inside of the box to a thickness of one *fen*. Let it dry in the sun. Then, take one *jin* of the previously prepared beads and four *liang* of steeped numinous cinnabar, using a ratio of four to one. Layer them like planting lotus seeds until the box is full. Cover with Kunlun paper. If the box’s top is not full, fill it with dry, crushed yellow earth. Seal the inner mouth with red halloysite mixed with vinegar, and bind it crosswise with iron wire. Coat the outside of the box with paper fiber and numinous mud to a thickness of half a finger. Let it dry in the sun, then place it in an ash jar to nurture the fire. Use a small-mouthed jar capable of holding nine *dou* of ash.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1264,
      "start_sentence": 0,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.25952196121216,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\九转灵砂大丹.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "用黄土先铺缸底三寸厚，用三脚小铁架一个，高五寸。 三脚仰放向上，将丹合放於三脚上顶住，不要侧动，以纸钱灰埋之。 再用大铁架，罩定其架，圈上以铁线串成隔眼，其隔离丹合一指，隔上放火，再用五寸灰盖火。 卯酉抽添，二七伏时，二三四五六七八，皆是两数。 候日足，冷定取出开合，其砂如新铁色。 将一块用刀劈开，中间无红色，其丹熟。 如有些红色，是换火不匀，不可动。 再固济，依前养三伏时，其火比前火加些，无不成矣。 拣出银珠分开。 如要此砂见宝，用砂一两，黑铅一两，入灰池对煎过，每两砂得真银八钱。 惜之，留转大药。 二转正阳丹法 右用初真丹一十六两，作匮。 依前用桑汁煮过灵砂一斤，先用四两，同丹匮，依前入合，如种莲子法。 四一之数，层问满盒，依前固济。 日乾，入灰缸内三脚上，依前罩定，依前下火，卯酉抽添，一七伏时，二三四五六七八，皆用两数。 日足候玲，取出其新砂，与丹匮一般拣出新砂，包起。 再用煮砂四两，依前入匮中，依前封固，入缸内养之。 如此四次，共得一斤新砂。 如要试丹成熟，依前用黑铅煎之。 每两砂得银八钱。 如不煎用，留作丹匮，转丹药旧匮，任意用之。 三转绝真丹法 右用正阳丹一十六两，作匮。 用不曾煮的灵砂一十二两，同透明辰砂四两，共入麻布袋中，入桑灰汁瓶内，依前煮七伏时。 候日足。 一滚取出，日乾，同入研细罗过，用玉女浆，即楮树汁也，为剂。 按实，晒乾，凿成大黄豆块。 先用胆矾四钱，硫黄一钱，研细同入姚内，炒令紫色，研为细末，却将凿成块砂四两，逐块用熟米醋蘸过去，胆矾、硫黄末中滚之，名贴身药。 与丹匮，依前四一之数，层问满盒，固济，入灰缸内三脚上，依前罩定，依前下火，卯酉抽添，二七伏时，二三四五六七八皆两数。 日足候玲取出，开合，其砂亦如新铁色。 母子一般拣出，如此四次，共收得新砂一斤。 如见宝，依前试之旧母，任意用之。 四转妙灵丹法 右用绝真丹一十六两，槌碎。 用磁合一个，揩净。 将碎砂铺於合内，用闭口川椒一两，诤水三碗。 於磁器中煮至二碗。 去祖乾净，却倾入水银四两，煮滚约一时候，取下急倾去椒汁令乾。 将水银乘热，倾入合内砂中。 醋调赤石脂，封子口，铁线扎定，合外以纸筋、煦泥通固。 日乾，合底下用水汤瓶一个，约盛水五升，瓶口与合底一般恰好。 瓶中先盛滚汤七分，坐上丹，合盐泥固济口缝。 不用三脚。 入缸内，灰埋之罩定，养三伏时，卯酉抽添，五六两数。 日足，寒炉取出，开合看其水银不见。 秤砂有斤两。 不要动再依前煮水银四两，依前浇入合内砂中，封子口扎定，依前固济。 日乾，水瓶内添滚汤七分。 坐上丹合固口缝，入缸内，依前下火，依前抽添，三伏时。 候玲取出开合，微见些峰角，秤砂亦有斤两。 如此四次共浇水银一斤，且住休动，固法如前，水瓶内汤添满坐上合，依前封固子口不浇水银，虚养五伏时，卯酉抽添，四五六七八两数，日足，玲取出，开合，其丹涌起，如琼林玉树，方可采摘白芽子，如此浇采无穷也。 五转水仙丹法 右用妙灵丹内采丹芽一斤，要净，不可犯杂。 铺於净磁合内，好珠汞半斤，就倾入合内芽中。",
      "translated_text": "First, line the bottom of the jar with yellow earth to a thickness of three *cun*. Place a small three-legged iron stand, five *cun* in height, with its legs facing upward. Position the elixir box atop the stand, ensuring it does not tilt, and bury it in paper-money ash. Then, use a larger iron stand to enclose the smaller one, weaving an iron-wire mesh above it to create a grid. This grid should be one finger’s width above the elixir box. Place the fire above the grid, then cover it with five *cun* of ash. Adjust the fire at *mao* and *you* hours, nurturing it for two seven-day periods. The fire grades—two, three, four, five, six, seven, eight—should all use paired measures. Once the time is complete, let it cool thoroughly before opening the box. The cinnabar will resemble newly forged iron in color. Split a piece with a knife; if no red hue remains within, the elixir is ripe. If any redness persists, the fire was unevenly applied—do not disturb it. Reseal and nurture it again for three seven-day periods, increasing the fire slightly beyond the previous intensity. It will surely succeed. Separate the silver beads.\n\nTo refine this cinnabar into treasure, take one *liang* of cinnabar and one *liang* of black lead, and smelt them together in an ash crucible. Each *liang* of cinnabar will yield eight *qian* of pure silver. Treasure it for further transmutation.\n\n**Second Transmutation: True Yang Elixir Method**\nUse sixteen *liang* of the initial true elixir as the matrix. Prepare one *jin* of numinous cinnabar by boiling it in mulberry sap, then take four *liang* of it. Layer it with the elixir matrix in the box, following the lotus-seeding method, in a four-to-one ratio. Seal as before, dry in the sun, and place it atop the three-legged stand in the ash jar. Enclose it as previously described, apply fire, and adjust at *mao* and *you* hours for one seven-day period. The fire grades—two, three, four, five, six, seven, eight—should all use paired measures. Once the time is complete, let it cool, then open the box. The new cinnabar will match the elixir matrix. Separate the new cinnabar and set it aside. Take another four *liang* of the boiled cinnabar, layer it with the matrix as before, seal, and nurture it in the jar. Repeat this four times to obtain one *jin* of new cinnabar. To test its maturity, smelt it with black lead as before; each *liang* of cinnabar will yield eight *qian* of silver. If not smelted, reserve it as a matrix for further transmutations, or use the old matrix as desired.\n\n**Third Transmutation: Absolute True Elixir Method**\nUse sixteen *liang* of the True Yang Elixir as the matrix. Take twelve *liang* of unboiled numinous cinnabar and four *liang* of transparent cinnabar, place them together in a hemp cloth bag, and boil them in a jar of mulberry-ash sap for seven seven-day periods. Once the time is complete, remove and bring to a boil, then dry in the sun. Grind them finely and sift through a silk sieve. Mix with Jade Maiden’s nectar (the sap of the paper mulberry) to form a paste. Press firmly, dry in the sun, and chisel into pieces the size of large soybeans. First, take four *qian* of chalcanthite and one *qian* of sulfur, grind them finely, and stir-fry in a pan until they turn purple. Grind into a fine powder, then dip each piece of cinnabar in matured rice vinegar and roll it in the chalcanthite-sulfur powder—this is called the \"body-adhering medicine.\" Layer it with the elixir matrix in a four-to-one ratio, seal the box, and place it atop the three-legged stand in the ash jar. Enclose as before, apply fire, and adjust at *mao* and *you* hours for two seven-day periods. The fire grades—two, three, four, five, six, seven, eight—should all use paired measures. Once the time is complete, let it cool, then open the box. The cinnabar will again resemble newly forged iron. Separate the mother and child elixirs alike. Repeat this four times to gather one *jin* of new cinnabar. To refine it into treasure, test it as before with the old mother elixir, and use it as desired.\n\n**Fourth Transmutation: Wondrous Numinous Elixir Method**\nTake sixteen *liang* of the Absolute True Elixir and crush it. Clean a porcelain box and spread the crushed cinnabar inside. Add one *liang* of closed-mouth Sichuan peppercorns and three bowls of water to a porcelain vessel, boiling until two bowls remain. Strain thoroughly, then pour in four *liang* of mercury and boil for about one hour. Remove and quickly pour off the pepper-infused water, letting it dry. While the mercury is still hot, pour it into the cinnabar in the box. Seal the box’s opening with vinegar-mixed red halloysite, bind it with iron wire, and reinforce the exterior with paper fiber and numinous mud. Dry in the sun, then place a water-boiling jar beneath the box, filled with five *sheng* of water, its mouth level with the box’s base. Fill the jar seven-tenths with boiling water, place the elixir box atop it, and seal the joint with salt mud. Do not use the three-legged stand. Bury it in the ash jar, enclose it, and nurture for three seven-day periods, adjusting the fire at *mao* and *you* hours with five or six paired measures. Once the time is complete, let the furnace cool, open the box, and observe that the mercury has vanished. Weigh the cinnabar—it will retain its original weight. Do not disturb it; instead, boil another four *liang* of mercury as before and pour it into the cinnabar in the box. Seal the opening, reinforce as before, dry in the sun, and refill the water jar seven-tenths with boiling water. Place the elixir box atop it, seal the joint, and return it to the ash jar. Apply fire as before, adjusting at *mao* and *you* hours for three seven-day periods. Once cooled, open the box to find faint crystalline peaks. Weigh the cinnabar—it will still retain its weight. Repeat this four times, adding a total of one *jin* of mercury. Then, cease further additions. Seal as before, fill the water jar to the brim, place the elixir box atop it, and seal the opening without adding more mercury. Nurture it for five seven-day periods, adjusting the fire at *mao* and *you* hours with four, five, six, seven, or eight paired measures. Once the time is complete, let it cool, open the box, and behold the elixir surging upward like a forest of jade trees. Only then may you harvest the white sprouts—this process of pouring and harvesting is inexhaustible.\n\n**Fifth Transmutation: Water Immortal Elixir Method**\nTake one *jin* of elixir sprouts from the Wondrous Numinous Elixir, ensuring they are pure and free of impurities. Spread them in a clean porcelain box, then pour in half a *jin* of fine mercury pearls directly into the sprouts.",
      "overlap_context": "o of four to one. Layer them like planting lotus seeds until the box is full. Cover with Kunlun paper. If the box’s top is not full, fill it with dry, crushed yellow earth. Seal the inner mouth with red halloysite mixed with vinegar, and bind it crosswise with iron wire. Coat the outside of the box with paper fiber and numinous mud to a thickness of half a finger. Let it dry in the sun, then place it in an ash jar to nurture the fire. Use a small-mouthed jar capable of holding nine *dou* of ash.",
      "start_char": 1264,
      "end_char": 2491,
      "start_sentence": 68,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.30313014984131,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\九转灵砂大丹.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "依前封固子口，扎定，合下用汤瓶，依前封固，入灰缸内，不用罩，其火四方，插养五伏时，四五六七八两数，日足，候玲取出，开合，其丹峰峦涌起，休动，依前再浇水银，依前固养，如满合用剪下分开。 如要成宝，以河水并乳香少许，煮一伏时，入甘锅内，熔成至宝，任用之。 至此不用铅煎，自体成宝矣。 六转通玄丹法 右用水仙丹，取四两。 依前用河水并乳香，煮过，熔成宝，打造室，合三两做底，一两做盖。 口缝弥密，恰好盛叶，雌透雄倭，黄紫炮各一两，皆用精妙者，同研细，装於合内，醋调赤石脂，封子口，放於前磁合内居中。 却将水仙丹芽子铺盖，再固磁合子口，扎定，不用外固。 入灰缸内三脚上，灰埋罩定，隔上放火，卯酉抽添，三七伏时，二三四五六七八皆两数。 日足，候冷取出，开合去铺，盖其室合，与三黄一等紫红。 将黄一小块，试银成庚，通赤为度。 如上面赤下淡，其丹未熟。 如透底赤，方可点化，留转丹药。 七转宝神丹法 右用不煮灵砂六两，生雄黄二两。 用前养过三黄四两，留一两盖面，余一处研匀，入磁合内，留丹一两，亦研细盖面。 以醋调赤石脂，固子口，铁线十字扎定合外再以纸筋、灵泥通固。 日乾，入灰缸内三脚上，灰埋之罩定，隔上放火，五七伏时，卯酉抽添，二三四五六七八两数，候日足，再加火三斤四方插缎。 候冷取出试之，将汞五两入建盏内，以丹末一钱掺之，下用小火逼汞，将却好盏盖定，醋纸封子口，候作声声绝去盏。 其汞成一块紫庚，再入甘锅内，化成金宝。 留转大药，旧匮任用之。 八转神宝丹法 右用宝神丹七两，留二两涂头。 用硫黄汞对升的灵砂五两，雌雄硫珠各一两，并研细入合，留丹二两，亦研细，盖於面上。 固济，日乾，入灰缸内三脚上，卯酉抽添，七七伏时，二三四五六七八两数。 日足，候玲开，合成一块，紫色射目，光彩可爱。 可种金芽，变转任用，留转大药。 九转登真丹法 右用神宝丹六十两，二八灵砂三十两，一处研匀，用乌驴乳汁和为剂。 却摘取金芽二斤，熔成宝，打造金神室合。 恰好盛众丹药在内，令满。 醋调赤石脂，封子口。 复铸一铜合一个，比度大小，恰好入室合居中，四边各宽一指。 右用铅丹、矾石，各另用器盛之，五斤炭火缎过，同研细末，杀埋芽合铺盖要匀。 次固济铜合，不用外固，入灰池。 右择卜坛场，按方位，择日时下火，卯酉抽添，七七伏时，依前火数，日足就，加火三斤，四方插毁。 候玲尽，取合子，去铜合，以黄芽丹合，盛大丹，於坛上掘地，深五尺，埋五十日，取出。 用油纸袅三五重，再以布帛包三五层，诤麻索携坠於井中，五十日至底。 取出为细末，以黄精自然汁，或玉女汁，亦可丸如鸡头子大。 候乾，再入金室合内，封子口，灰缸内三脚上，下火一七伏时，卯酉抽添，二三四五六七八两数，日足。 候玲取出，合试丹一粒，投入玲水中，其水随丹滚如汤。 以汞一斤，入建盏内，投丹一粒，恰好盏盖定，醋纸搭口缝，以小火逼汞，如秋蝉之声声绝，去盏，汞以成上色紫宝，熔之紫晕烁人，乃丹成也。 将丹数供，具奏上帝，候有报应，取丹，井中水吞三粒。 先置水缸，遂入水缸中，烦丹友外护，候水温热即出。",
      "translated_text": "Seal the opening as before, bind it securely, and place a water jar beneath the box, sealing it likewise. Set it in an ash jar without a cover, with fire on all four sides. Nurture it for five seven-day periods, adjusting the fire at *mao* and *you* hours with two, three, four, five, six, seven, or eight paired measures. Once the time is complete, let it cool, open the box, and behold the elixir surging upward like peaks and ridges. Do not disturb it; pour mercury as before and nurture it again in the sealed manner. When the box is full, trim the excess and divide it.\n\nIf you wish to refine it into treasure, boil it with river water and a small amount of frankincense for one seven-day period, then place it in a crucible to melt into a supreme treasure, ready for use. From this point onward, lead smelting is no longer required, for the elixir transforms into treasure of its own essence.\n\n**Sixth Transmutation: Penetrating the Mysterious Elixir Method**\nTake four *liang* of Water Immortal Elixir. Boil it as before with river water and frankincense, then melt it into treasure. Forge a chamber, using three *liang* for the base and one *liang* for the lid. Seal the seams tightly, ensuring it is just large enough to hold the ingredients. Use one *liang* each of refined *cizhu* (female cinnabar) and *xiongwei* (male cinnabar), along with one *liang* each of high-quality yellow and purple *pao* (processed minerals). Grind them finely together and place them in the chamber. Seal the opening with vinegar-mixed red halloysite, then set the chamber in the center of a porcelain box. Spread Water Immortal Elixir sprouts over it, seal the porcelain box’s opening, and bind it securely without external sealing. Place it on a tripod in an ash jar, bury it in ash, and cover it. Apply fire from above, adjusting at *mao* and *you* hours for three seven-day periods, using two, three, four, five, six, seven, or eight paired measures. Once the time is complete, let it cool, open the box, and remove the covering. The chamber and its contents will be uniformly purple-red, like the Three Yellows. Test a small piece of the yellow elixir on silver until it turns pure red. If the top is red but the bottom pale, the elixir is not yet ripe. Only when it is red through to the bottom is it ready for transmutation; reserve some for further refinement.\n\n**Seventh Transmutation: Treasure Spirit Elixir Method**\nTake six *liang* of unboiled cinnabar and two *liang* of raw realgar. Use four *liang* of the previously nurtured Three Yellows, reserving one *liang* for the surface. Grind them together and place them in a porcelain box, leaving one *liang* of elixir to grind finely and spread on top. Seal the opening with vinegar-mixed red halloysite, bind the box with iron wire in a cross pattern, and further secure it with paper fiber and numinous clay. Let it dry in the sun, then place it on a tripod in an ash jar, bury it in ash, and cover it. Apply fire from above for five seven-day periods, adjusting at *mao* and *you* hours with two, three, four, five, six, seven, or eight paired measures. Once the time is complete, add three *jin* of fire on all four sides to refine it. Let it cool, then test it: place five *liang* of mercury in a *jian* bowl, sprinkle one *qian* of elixir powder over it, and apply gentle heat to the mercury. Cover the bowl tightly, seal the opening with vinegar-soaked paper, and wait until the sound ceases. Remove the cover to find the mercury transformed into a purple treasure. Melt it in a crucible to form golden treasure. Reserve some for further refinement; the rest may be used as before.\n\n**Eighth Transmutation: Spirit Treasure Elixir Method**\nTake seven *liang* of Treasure Spirit Elixir, reserving two *liang* to coat the surface. Use five *liang* of cinnabar refined from balanced sulfur and mercury, along with one *liang* each of female and male sulfur pearls. Grind them finely and place them in the box, reserving two *liang* of elixir to grind finely and spread on top. Seal it, let it dry in the sun, and place it on a tripod in an ash jar. Adjust the fire at *mao* and *you* hours for seven seven-day periods, using two, three, four, five, six, seven, or eight paired measures. Once the time is complete, let it cool and open the box to find the elixir fused into a single mass, its purple hue dazzling to the eye and radiant with beauty. It may be used to cultivate golden sprouts or for further transmutation; reserve some for the great elixir.\n\n**Ninth Transmutation: Ascending to Perfection Elixir Method**\nTake sixty *liang* of Spirit Treasure Elixir and thirty *liang* of Two-Eight Cinnabar. Grind them together and mix with donkey’s milk to form a paste. Then take two *jin* of golden sprouts, melt them into treasure, and forge a golden spirit chamber. Fill it completely with the elixir mixture. Seal the opening with vinegar-mixed red halloysite. Cast a copper box slightly larger than the chamber, leaving a finger’s width of space on all sides. Use lead dan and alum, each prepared separately in a vessel with five *jin* of charcoal fire, then grind them into fine powder. Spread this evenly over the chamber to seal it. Next, seal the copper box without external binding and place it in an ash pit.\n\nChoose an auspicious altar site according to the proper directions, and select an auspicious day and hour to begin the firing. Adjust the fire at *mao* and *you* hours for seven seven-day periods, using the same fire measures as before. Once the time is complete, add three *jin* of fire on all four sides to refine it. When the fire has fully subsided, remove the box, discard the copper outer layer, and place the golden sprout elixir chamber in the center of the altar. Dig a pit five *chi* deep and bury it for fifty days. Retrieve it, wrap it in three to five layers of oiled paper, then three to five layers of cloth, and bind it with hemp rope. Suspend it in a well for fifty days until it reaches the bottom. Remove it, grind it into fine powder, and mix it with the natural juice of Solomon’s seal or Jade Maiden’s essence to form pills the size of chicken’s heads. Let them dry, then place them back in the golden chamber, seal the opening, and set it on a tripod in an ash jar. Apply fire for one seven-day period, adjusting at *mao* and *you* hours with two, three, four, five, six, seven, or eight paired measures. Once the time is complete, let it cool and test a pill by dropping it into cold water—the water should roil like boiling liquid. Place one *jin* of mercury in a *jian* bowl, add one pill, and cover the bowl tightly. Seal the opening with vinegar-soaked paper, apply gentle heat to the mercury, and wait until the sound ceases like autumn cicadas. Remove the cover to find the mercury transformed into a superior purple treasure. When melted, its purple luster will dazzle the eyes—this is the sign of elixir completion.\n\nPrepare an offering of the elixir and present it to the Supreme Emperor. Await a response, then take three pills with well water. First, place a water jar nearby, then enter the jar. Have fellow Daoists guard you from outside until the water grows warm, then emerge.",
      "overlap_context": " the time is complete, let it cool, open the box, and behold the elixir surging upward like a forest of jade trees. Only then may you harvest the white sprouts—this process of pouring and harvesting is inexhaustible.\n\n**Fifth Transmutation: Water Immortal Elixir Method**\nTake one *jin* of elixir sprouts from the Wondrous Numinous Elixir, ensuring they are pure and free of impurities. Spread them in a clean porcelain box, then pour in half a *jin* of fine mercury pearls directly into the sprouts.",
      "start_char": 2491,
      "end_char": 3732,
      "start_sentence": 123,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.0780029296875,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\九转灵砂大丹.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "再入第二缸水中，复三缸，便觉身轻神变。 次日准前。 如是三次，九缸水，共吞九粒。 自然身有光明，将见云车下迎，如接侍云升霞车矣。 又浇淋法 用恰好磁合一个，将初真丹一斤，先用长流水於磁器内，慢火煮浴一时，微滚取出，日乾。 铺於盒内，却用川椒一两，多拣闭口者好。 以磁瓶内用诤水三碗，煎至二碗，去租。 却倾入水银四两，再煮一时，急去椒汤，用纸拭乾。 将诤水银乘热，倾入盒内丹中，用昆仑纸盖定。 又用土块填满，依前固济，日乾。 合下用水汤瓶一个，瓶口与合底恰好。 其瓶盛水三升者。 瓶内先下滚汤七分。 瓶口用盥泥一条圈住，将盒坐在盥泥上，涂固口缝。 入灰缸内，不用下三脚，只罩定。 用顶火养三伏时，卯酉抽添，四五六两数。 日足，候玲取出，开盒看时，不见其水银，尽入砂中，秤斤两方有，不要动。 依前再浇固济。 如此四次。 每次添汤瓶七分为准，乘热坐上盒子为妙。 四次后，用虚养一次。 虚养时，水瓶内添汤，满其盒，依前封固，坐在汤瓶上，不用罩，四边插火，养五伏时，卯酉抽添，四五六七八两数。 日足，候玲，取出开盒看，方可摘些芽，放炭火上试熔，看玲成珠，不折方好。 有走折，再虚养一次。 如要成宝，不用铅煎，用甘锅化成宝。 如要转浇，盒满分之，依前四一之数浇养。 每四次，用一虚养。 试看成宝，方可再浇，如芽嫩切不可浇淋。 依前再虚养，务要成珠，方可转浇去。 九转灵砂大丹竟",
      "translated_text": "Enter a second water jar, then a third, and you will feel your body grow light and your spirit transformed. The next day, proceed as before. Repeat this three times, through nine jars of water, swallowing nine pills in total. Naturally, your body will radiate light, and you will see cloud chariots descend to welcome you, as if ascending in a carriage of clouds and rosy dawn.\n\n**The Pouring and Drenching Method**\nPrepare a well-fitted ceramic box. Take one *jin* of the initial true elixir, and first use flowing water in a ceramic vessel to bathe it over a slow fire for one hour, allowing it to simmer gently before removing and drying in the sun. Spread it in the box. Then take one *liang* of Sichuan peppercorns—selecting only the tightly closed ones—and place them in a ceramic bottle with three bowls of pure water. Boil down to two bowls, then strain out the dregs. Add four *liang* of mercury, boil again for one hour, then quickly remove the pepper-infused water and wipe the mercury dry with paper. While still hot, pour the mercury into the box with the elixir, cover tightly with Kunlun paper, and fill the remaining space with clay lumps. Seal as before and dry in the sun.\n\nPrepare a water-boiling bottle with an opening that fits snugly against the bottom of the box, filling it with three *sheng* of water. First, pour seven parts of boiling water into the bottle. Seal the rim with a ring of mud, place the box on top, and secure the edges. Set it in an ash jar without a tripod, simply covering it. Nurture with top-fire for three *fu* periods, adjusting the fire at dawn and dusk, using four, five, or six *liang* of fuel as needed. Once the time is complete, let it cool, remove the box, and open it—no mercury should be visible, as it will have fully entered the elixir sand. Weigh it to confirm the original weight, then leave it undisturbed. Seal and drench again as before. Repeat this four times, each time adding seven parts of boiling water to the bottle, placing the box on top while hot for best results.\n\nAfter four repetitions, perform one \"empty nurturing.\" During empty nurturing, fill the water bottle to the brim, seal as before, and place the box on top without covering it. Surround it with fire on all sides, nurturing for five *fu* periods, adjusting the fire at dawn and dusk with four, five, six, seven, or eight *liang* of fuel as needed. Once the time is complete, let it cool, open the box, and carefully remove some sprouts. Test them on charcoal fire—if they melt into perfect pearls without cracking, they are ready. If they scatter or crack, perform another empty nurturing.\n\nTo refine into treasure, do not use lead smelting; instead, melt in a crucible to form the treasure. If further pouring is needed, divide the full box according to the four-to-one ratio and nurture as before. After every four pourings, perform one empty nurturing. Test until it forms treasure, then proceed with further pouring. If the sprouts are too tender, do not drench—nurture again until they form perfect pearls before continuing. Thus is the Great Elixir of Ninefold Transmuted Cinnabar completed.",
      "overlap_context": "rcury, and wait until the sound ceases like autumn cicadas. Remove the cover to find the mercury transformed into a superior purple treasure. When melted, its purple luster will dazzle the eyes—this is the sign of elixir completion.\n\nPrepare an offering of the elixir and present it to the Supreme Emperor. Await a response, then take three pills with well water. First, place a water jar nearby, then enter the jar. Have fellow Daoists guard you from outside until the water grows warm, then emerge.",
      "start_char": 3732,
      "end_char": 4294,
      "start_sentence": 167,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.131255626678467,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\九转灵砂大丹.txt",
        "category": "众术类"
      }
    }
  ]
}