{
  "source_id": "九还七返龙虎金丹析理真诀",
  "source_file": "chunked_daozang\\九还七返龙虎金丹析理真诀.json",
  "total_chunks": 3,
  "total_original_chars": 3675,
  "total_translated_chars": 20914,
  "total_translation_time": 103.3729453086853,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\九还七返龙虎金丹析理真诀.txt",
    "category": "方法类"
  },
  "full_translation": "*The True Principles of the Nine Returns and Seven Reversions: Dragon-Tiger Golden Elixir*\n\n*Title:* *The True Principles of the Nine Returns and Seven Reversions: Dragon-Tiger Golden Elixir*\n*Author:* Cheng Zhao, styled Shuming, of Wuchang. Likely composed during the Song dynasty. One fascicle.\n*Source:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\nCheng Zhao, styled Shuming of Wuchang, records:\n\nIn my devotion to the Daoist gate, I have long been deeply attentive. Having perused the immortals’ scriptures and the hundred schools of furnace and fire, I have roughly examined them. Through studying the *Record of the Cavernous Origin*, the *Comprehensive Path Scripture*, the *Principles of the Primordial Chaos*, the *Golden and Azure Scripture*, the *Jade Flask, Dragon Embryo, Phoenix Wings*, as well as the *Great One* and *Triple Unification* texts, I have analyzed the firing times and grasped that the golden liquor returning elixir of the nine returns and seven reversions has three forms. The methods of cultivation are indeed manifold, their depths mutually explored and far-reaching. Yet the primordial mechanism is not distant—though scholars number in the tens of thousands, not one has succeeded. All fail because lead and mercury are difficult to distinguish, the yellow sprout remains unrecognized, and from this regretful loss, the primordial origin remains obscure. Thus, I have composed this over the years.\n\nIn the mid-spring of the *renshen* year of the Great Song, I encountered a rustic from the Four Bright Mountains. As I lodged with him, I inquired about the principles of the golden liquor returning elixir. The Daoist replied: \"This matter is both most difficult and most easy—it cannot be lightly questioned.\" I earnestly entreated him again. The Daoist said: \"Some claim golden blossoms to be the yellow sprout, or take ore as true lead—such people will never succeed. The yellow sprout is the marrow of the Five Phases; true lead is the true essence of the Great One. It arises within primordial chaos, emerges from the Great Beginning, is born at the inception of Heaven and Earth, and thus can serve as the mother of all things. The great elixir harmonizes the supremacy of the Five Phases and equals the workings of Heaven and Earth.\"\n\nI bowed again and asked: \"May I dare inquire—how does the golden liquor returning elixir arise?\"\n\nThe Daoist said: \"The golden elixir arises from the Great Beginning. The Great Beginning gives birth to primordial chaos; chaos gives rise to the Two Modes; the Two Modes establish the Three Powers; the Three Powers operate the Eight Trigrams; the Eight Trigrams nourish the Nine Palaces. The Nine Palaces mark the completion of the elixir, and thus the primacy of the Great One. May I ask—what is the name of the Great Beginning, and what substance in the medicine does the master point to?\"\n\nThe Daoist said: \"It is true lead. Lead is the essence of water; water is the body of yin. When yin reaches its extreme, yang is born, transforming the myriad things. Without yang, nothing is born; when yang departs, death follows. To enact transformation, one must first establish yang. The birth of yang occurs in profound obscurity—none know it. As the *Daoist Scripture* says: 'In the profound and obscure, therein lies essence—this essence is most true.' The *Triple Unification* models itself on the *Zhouyi*’s *Fu* hexagram of Earth over Thunder. The great yang is born at *zi*, the eleventh-month hexagram. Thus, the divine workings of Heaven and Earth, wishing to carve and adorn the myriad blossoms and unfold the thousand flowers, receive the yang line at the time of yin’s extremity, borrowing the盛 of great yin to assist the subtle yang’s achievement—this is the meaning of the Great Beginning. Those who do not know that the golden elixir arises from the Great Beginning recklessly ingest metals and minerals, seeking transformation. It is like pouring colored dye on the earth, hoping to dye the forms of flowers and trees.\"\n\nI bowed again and asked: \"What is the substance that the Great Beginning gives birth to in primordial chaos?\"\n\nThe Daoist said: \"Chaos is the appearance of unopened fullness—white without, yellow within, like a chicken’s egg. When yin and yang unite but their essences and qi have not yet merged, it is called chaos. May I further inquire—what is the name of chaos in the medicine, and to what category does it belong? This is the meaning in Master Cui’s *Dragon Embryo Scripture*. When lead and mercury first unite, dragon and tiger first embrace, sun and moon intermingle, yin and yang mutually resonate—thus the elixir is born in chaos. The moon emits its radiance, the sun extends its light; the dragon receives its embryo, the tiger releases its qi. Like gold and jade in slumber, spirit and brightness embrace. Upon awakening, the dragon extends its qi, the tiger spits forth its essence, and the divine chamber adheres without separation. As the *Embracing the Origin Scripture* says: 'Containing the origin and receiving qi, nothing is not fulfilled; obtaining qi and receiving the origin, nothing is not complete.' Consider the things of the world—without containing consciousness, they cannot embrace the origin. Without abandoning consciousness, none attain form and substance. People do not know the root of dragon and tiger, the transformative origin of yin and yang. Recklessly employing metals and minerals to forge the returning elixir is like retreating to seek what lies ahead or chasing the sun to flee one’s shadow. Thus, the True Lord Wei said: 'Entering water to seek chicken and rabbit, climbing mountains to search for fish and dragon—how true!' This is the lament of the *Triple Unification* for later generations who love the Dao, exhaustively seeking teachings and exhausting ancient texts. Sons inherit their fathers’ work; grandsons follow their ancestors’ path—this clarifies the principle of containing the origin and receiving qi. It also says: 'To hatch a chicken, one must use an egg; to grow grain, one must plant grain.' And: 'The simurgh and sparrow do not give birth to phoenixes; foxes and hares do not nurse horses.' This is the meaning. People do not understand the Dao of containing the origin and embracing the embryo. They seek medicine from distant lands, smelting metals and refining minerals. If the great elixir could be completed with the five metals and eight minerals, then the True Lord Wei would not have composed the *Triple Unification*, and Master Cui would not have elucidated the *Great One Diagram*. The *Triple Unification* speaks of the mutual stirring of the two qi, the mutual impelling of the Eight Trigrams, the alternating residence of cold and heat, the opening and closing of yin and yang. If the two qi lose their measure, the myriad things do not flourish; if the Five Phases exceed their norm, the ten thousand spirits lose their order. How could the great elixir tolerate miscellaneous categories to achieve completion? Moreover, the *Great One Diagram* says: 'The Great One roams the Nine Palaces but does not enter the central position.' If one understands the Great One, then the center is water; the central palace is earth. Earth is the ghost of water—thus it detests the central palace and does not enter it.\"\n\nAs the elixir traverses the Eight Trigrams and later enters the central palace, it ripens into refined gold. The generals stationed near the Great One must exhibit the phenomenon of cyclical progression—thus, the Great One is likened to mercury, while the generals represent metals and minerals, clarifying that the great elixir does not employ metallic or mineral substances. Furthermore, when multiple entities share the same palace, they become imprisoned, indicating forbidden practices; this reveals that the Dragon Embryo Elixir does not incorporate miscellaneous categories. Moreover, it is made clear that *zi* and *wu* (midnight and noon) are the qi of transformation, while *mao* and *you* (dawn and dusk) are the qi of cessation—these are all temporal markers of the elixir’s progression.\n\nSomeone asked: What are the Two Modes?\nThe Daoist replied: The Two Modes refer to the division of Heaven and Earth, the separation of forms, with yin and yang each occupying their respective positions—sun in the east, moon in the west, *li* in the south, and *kan* in the north.\n\nAgain, they asked: What manifestation does the presence of the Two Modes produce within the elixir?\nThe Daoist said: The Two Modes within the elixir signify the distinct separation of lead and mercury. Once the Two Modes are established, in the heavens they give rise to the sun, moon, and stars; in the elixir, they become the Three, Five, and One. When the medicine reaches this stage, spiritual transformation is not far off.\n\nThey further inquired: What is the Three, Five, and One?\nThe Daoist replied: One is water, two is fire—together they make three. From these three, the five naturally emerge. This is water, fire, and earth, also called the lead, mercury, and crucible. It is also named the Three Substances as One Body, or the One Substance with Three Forms. Yanluo Zi said: This is the Dao of the Three-in-One, for within the great elixir, only gold, water, and earth are present.\n\nAgain, they asked: How are gold, water, and earth distinguished?\nThe Daoist said: Gold is lead, and lead is true gold and true earth—not the lead of the mundane world, but that which is born within the profound obscurity of the Great Void, the true essence of the Great One, the central line within *kan*. Thus it is said: Heaven attains the One and becomes clear; Earth attains the One and becomes tranquil; humanity attains the One and becomes numinous. If one seeks numinosity in humanity, nothing surpasses the study of the Dao of longevity and immortality. Laozi said: When the child attains the One, all matters are complete. The immortals of ancient times guarded the secrecy of lead’s singular nature, as the ancient song states: *If lead is true, it does not lose its household retainers; if lead is not true, it cannot befriend mercury.* Lead and mercury are of the same family.\n\nThe *Dragon’s Nest Scripture* also states: When a sage receives the mandate, they must possess a heart in harmony with virtue—these are of the same family. Ears, eyes, limbs, and trunk are its harbors; when it descends, ghosts and spirits cannot approach; when it ascends, Heaven and Earth combine their strength. This is to say that lead and mercury are of one family, and the elixir cannot be completed with external miscellaneous substances. The ancient song says: *Though the paths of south and north diverge, in obscurity they are one family.* Yet世人 often mistake gold, silver, lead, and tin for lead, or laugh at silver sprouts, golden butterflies, and golden ants as lead, attempting to refine the elixir—this is like watering rotten wood to seek blossoms or drilling ice to await fire! They do not comprehend the myriad categories, nor recognize their root and branches, and thus, despite countless efforts, achieve nothing.\n\nMoreover, all these substances are inert and lifeless matter—how could they possess spiritual transformation or the power to renew marrow and sinew? Thus, the *Triple Unification* states: *Foxes and hares do not nurse horses; swallows and sparrows do not hatch phoenixes.* This is the meaning. It also says: *Work is easily accomplished with the same kind; skill is difficult with different kinds.* And: *When a hen incubates an egg, the days are fulfilled, and the mother gives birth to the chick after ten months are complete.* One plants grain with millet and hatches a chicken with an egg.\n\nFurthermore, the twelve types of lead in the world are all unsuitable for the great elixir: black lead, red lead, Jiazhou lead, raw lead, grass-joint lead, Longtuo lead, white tin-lead, silver lead, and gold-smelted lead—all are dead, inert substances of the mundane world. Even if forcibly ingested, they pass through the large intestine and descend—how could they constitute the Dao of longevity, enduring vision, and immortality?\n\nThey asked: If mundane lead is unfit for ingestion, where does true lead come from?\nThe Daoist replied: True lead-earth emerges from non-being into being, receiving its form from Heaven and Earth and its substance from the sun and moon. When ruler and minister unite, when father and mother give birth, it begins as a minute speck and grows into a pound of numinous essence, with bones and flesh complete, blood and qi abundant. At the mere sight of mercury, it is immediately subdued. Thus, Qingxia Zi said: *When emotions harmonize, no other medicines are needed; when qi harmonizes, no words are spoken.* This is the meaning.\n\nAgain, they asked: Among the sources of mercury, which is suitable for refinement?\nThe Daoist said: Mercury also has several varieties: natural mercury, white sand mercury, cinnabar mercury. Only cinnabar mercury is used in elixir refinement. Moreover, cinnabar itself has many types: celestial throne cinnabar, divine throne cinnabar, purple numinous cinnabar, luminous cinnabar, commercial cinnabar, iron-veined cinnabar, stream cinnabar, and earth cinnabar. The celestial throne, jade throne, golden throne, and divine throne cinnabars are all naturally returning elixirs, requiring no firing or refinement—ingesting them leads to immortality. The immortals of the heavens, riding cranes and dragons, come to retrieve them, and mundane people cannot perceive them. Luminous and purple numinous cinnabars are suitable for refining the great elixir, while commercial and earth cinnabars are unfit for ingestion and only useful for minor arts.\n\nThey further asked: What is earth?\nThe Daoist replied: Earth is singular in flavor, and its true meaning is profound—it is not the earth of the mundane world. People often mistake sulfur, realgar, orpiment, arsenic, litharge, silver powder, lead yellow flowers, white silver, and yellow gold for earth, attempting to submerge them in water—none of these are suitable. Earth has no fixed form; it arises when qi converges and takes shape when conditions align. Thus, it is born in the four *meng* (first months of seasons), reigns in the four *ji* (last months), ceases in the four *zhong* (middle months), stabilizes the central palace, resides in *bing* and *ding*, and shares qi with water.\n\nShould one take the aforementioned substances as true earth, does its origin share the same blackness as water? True earth is the quintessential essence of the Five Phases. It must be refined through divine union and transformation to generate and nurture, thereby uniting with Heaven and Earth in form, its spiritual transformations boundless. Only then is it fit to serve as the dwelling for the elixir.\n\nThey further asked: When gold, water, and earth combine to form the great elixir, the ingredients are few—how can its power be so vast? And how many days must one tend the crucible before it ripens?\nThe Daoist replied: As the *Cantong Qi* states:\n*\"At first seventy, then three decades,\nThree hundred sixty, well-tempered and even.\"*\nThus, it matures in one full year—this is the cycle of the Great One through the heavens. Without completing this celestial revolution, the great elixir cannot ripen. Master Wei’s discourse on the celestial numbers speaks of a year in the grand scheme, or a single day in the lesser. Thus, year aligns with month, month with day, day with hour. The method of nurturing through the revolving stars takes but a day and night for one full cycle.\n\nMaster Qingxia said:\n*\"The crucible is no metal vessel,\nThe furnace no mere drug stove.\nDeparting from Kan’s depths, it rises;\nMercury dwells within the earth’s embrace.\nSealed tight, the embryo leaks not—\nTransformation occurs in but a moment.\"*\nThus, one need not seek distant crucibles.\n\nAn ancient song says:\n*\"Day by day, it rests in your own dwelling,\nKnowing the white, guarding the black—\nThe numinous manifests!\"*\n\nThey dared ask: What does \"knowing the white, guarding the black\" mean?\nThe Daoist replied: The white is the essence of metal, the black the foundation of water—these two are the great treasures of Heaven and Earth, the purest essences of sun and moon. They symbolize ruler and minister, father and son, husband and wife, woman and man.\n\nThey again asked: Might you deign to outline the initial steps for refining the elixir?\nThe Daoist said: The golden elixir must embrace the primordial, knit the embryo, unfold the flower, and bear the fruit—this is called returning to the root and restoring the origin. As Master Yinluo said: *\"Deep roots and firm stems are the Way of long life and enduring vision.\"* And again: *\"Deep roots yield flourishing flowers and plump fruit; thus the noble one attends to the root, and with the root established, the Dao arises.\"* If one inwardly aligns with the Dao, the golden elixir will naturally arrive, its form and shadow inseparable, its sound and echo in perfect resonance.\n\nThe Daoist continued: It begins with cinnabar, which transforms into mercury, mercury into gold, gold into liquid, and the liquid into the elixir—hence it is called the *Golden Liquid Returned Elixir*. The elixir is of vermilion hue; returning to earth, it reverts to the origin, thus wood returns to its source. As Master Yuanyang said:\n*\"Gold refines into gold, silver into silver—\nWhen has there ever been another divine marvel?\nNaturally subduing fire, it withstands a hundred smeltings without decay,\nEnters water like a paste, fire like gold,\nMelts in the mouth with a sweet fragrance.\nHow could the world’s miscellaneous metals, stones, flowers, or trees\nEver achieve such divine transformation?\"*\n\nThey further asked: What does \"embracing the primordial embryo, unfolding the flower, and bearing the fruit\" entail?\nThe Daoist replied: It is the binding of the dragon’s embryo and the refining of the tiger’s essence. The divine water nurtures the yellow sprout. Since the Three Sovereigns, this has been transmitted mouth-to-mouth, never committed to writing, lest the celestial mechanism be revealed. Those who speak recklessly will sink through three kalpas. My disciple, keep this hidden and do not speak of it.\n\nThey asked again: Grateful for your guidance, I now perceive the fundamental principle. If the materials required are few and the crucible and ingredients easily obtained, may I proceed with the refinement according to the method?\nThe Daoist said: To refine the elixir, three conditions must be met: fortune, virtue, and resolve. Without fortune, it will not succeed. As the *Dragon-Tiger Classic* states: If the elixir, upon ripening, appears as hills, graves, or skeletal forms, it is unfit for ingestion—cast it into the flowing stream and refine anew. This is the sign of lacking fortune. Without virtue, one cannot contain and store the elixir. For instance, Zhao Yuanbo transmitted the elixir formula to the Crown Prince of Yanzhong, who coveted wealth. He used it to forge gold and silver, cast vessels, and refine external medicines. Before the elixir was complete, the prince grew angry and had Yuanbo drowned in a well—this is the consequence of lacking virtue. Without resolve, one cannot endure the hardships of study; even a minor setback breeds great regret. Like the two Xue brothers of Hezhong, who failed to complete the elixir, burned all their alchemical texts and tools in the street, and upon encountering Daoist travelers, drew their swords in furious pursuit, shouting: *\"Begone, you deceitful lot!\"* Soon after, they fell from their horses and died—this, too, is the result of lacking resolve. Though you possess resolve, your fortune and virtue are not yet complete. Seek one of great fortune and broad virtue to undertake this together—only then may it succeed.\n\nThey asked again: Earlier, you said those who speak recklessly will sink through three kalpas. Now you advise seeking others to refine together—does this not violate the divine command?\nThe Daoist replied: Since ancient times, three sharing a single resolve has been the way—this is not reckless speech. The three are gold, water, and earth; more than three constitutes recklessness. Noble one, adhere strictly to my discourse: transcribe, compile, and copy it in order. Follow the sequence of movements, pairings, and timings, and the resonances will manifest. Disseminate it in the world, and those with affinity will encounter it. As for the oral instructions, transmit them mouth-to-mouth, heart-to-heart—do not violate the divine command.\n\nAt the break of dawn, he took his leave, and none knew where he went. I, having received the Daoist’s instructions, recorded them in full to pass on to those who cherish the Dao—pray, do not discard them!\n\n*The True Principles of the Nine Returns, Seven Reversions, Dragon-Tiger Golden Elixir* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "九还七返龙虎金丹析理真诀 经名：九还七返龙虎金丹析理真诀。 题程昭撰，当出於宋代。 一卷。 底本出处：《正统道藏》洞真部方法类。 九还七返龙虎金丹析理真诀 武昌程昭字士明述 余於道门，酷於留意，曾览仙经，至於炉火百家，粗曾披阅，因看《洞元记》、《总途经》、《混元诀》、《金碧经》、《玉壶龙胎凤翅》及《太一》、《参同》等文，分析火候，指掌九还七返金液还丹有三，修用实繁，互达探远，元机非遥，学者万数，成无一焉。 皆为铅汞难分，黄芽罔识，从兹恨失，莫晓宗元。 以此为述，积有岁矣！ 时於大宋壬申中春，遇四明山野客，因留宿，乃问金液还丹之理，道人云：此事至难至易，不可轻问。 余乃再恳之。 道人曰：或说金华为黄芽，将矿侯作真铅，如此之人，万无一成也。 且黄芽者，是五行之筋髓，真铅即太一之真精，生於混沌之中，起自太初之内，生乎天地之始，先能作众物之母。 夫大丹均五行之胜，齐天地之功。 余乃再拜曰：敢问金液还丹，所起如何？ 道人曰：金丹所起，起於太初，太始生混沌，混沌生两仪，两仪立三才，三才运八卦，八卦滋九宫，九宫则丹之终，则太一之始先也。 敢问太始之名，愿乞师指於药中是何物？ 道人曰：是真铅也。 铅是水之精，水是阴之体，阴极则阳生，变化万物也。 无阳不生，阳去即死，将欲变化，故先立阳。 阳之生也，其在杳冥，人莫知。 道经云：杳杳冥冥，其中有精，其精甚真之谓也。 又《参同》拟《周易》是地雷复卦，太阳生於子，为十一月卦，故天地神功，将欲雕镂万卉，发敷千花，故纳阳爻於阴极之时，藉太阴之盛，赞微阳之功，此乃太始之义也。 世人不知金丹从太始，妄服金石，欲求变化者，如灌彩汁於地，欲染花木之形。 又再拜问：太始生混沌者何物？ 道人曰：混沌者，不开盈之貌也。 外白裹黄，犹如鸡子也。 既阴阳而合，精气未交，故日混沌也。 又问曰：未委混沌之名，於药中是何类也？ 是崔真人《龙胎经》中之义也。 铅汞初合，龙虎初亲，日月相交，阴阳相感，故丹生混沌也。 月吐其彩，日舒其光，龙纳其胎，虎泄其气，如金碧之寝寐，神明相抱，觉悟后存，已是龙舒其气，虎吐其精，神室相着，不相离也。 如《抱元经》云：含元受气，物无不济，得气受元，物无不全。 且如世问之物，不含识，则抱元未有舍元识而得成形质者也。 世人不知龙虎之根基，阴阳之化本，妄投金石，拟造还丹，皇为却步而求前，迎日而避影。 故魏真君日入水求鸡兔，登山索鱼龙诚哉！ 是言又《参同》之哀悯后生好道之伦，探访风教，指尽古文。 子继父业，孙踵祖先，此明含元禀气也。 又言覆鸡当用卵，又种禾即生禾。 又云鸾雀不生凤，狐兔不乳马此之谓也。 世人不知含元抱胎之道，远方求药，煎金炼石，若以五金八石得成大丹者，则魏真人不作《参同契》，崔真人不明《太一图》。 《参同》以二气相荡，八卦相推，寒暑迭居，阴阳开阖，二气失度，万物不滋，五行越常，万灵失序。 岂肯大丹容杂类而成乎？ 又如《太一图》云：太一游九宫而不入中位。 若明太一，则水中也j，中官则土也。 土为水鬼，故恶中宫而不入也。",
      "translated_text": "*The True Principles of the Nine Returns and Seven Reversions: Dragon-Tiger Golden Elixir*\n\n*Title:* *The True Principles of the Nine Returns and Seven Reversions: Dragon-Tiger Golden Elixir*\n*Author:* Cheng Zhao, styled Shuming, of Wuchang. Likely composed during the Song dynasty. One fascicle.\n*Source:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\nCheng Zhao, styled Shuming of Wuchang, records:\n\nIn my devotion to the Daoist gate, I have long been deeply attentive. Having perused the immortals’ scriptures and the hundred schools of furnace and fire, I have roughly examined them. Through studying the *Record of the Cavernous Origin*, the *Comprehensive Path Scripture*, the *Principles of the Primordial Chaos*, the *Golden and Azure Scripture*, the *Jade Flask, Dragon Embryo, Phoenix Wings*, as well as the *Great One* and *Triple Unification* texts, I have analyzed the firing times and grasped that the golden liquor returning elixir of the nine returns and seven reversions has three forms. The methods of cultivation are indeed manifold, their depths mutually explored and far-reaching. Yet the primordial mechanism is not distant—though scholars number in the tens of thousands, not one has succeeded. All fail because lead and mercury are difficult to distinguish, the yellow sprout remains unrecognized, and from this regretful loss, the primordial origin remains obscure. Thus, I have composed this over the years.\n\nIn the mid-spring of the *renshen* year of the Great Song, I encountered a rustic from the Four Bright Mountains. As I lodged with him, I inquired about the principles of the golden liquor returning elixir. The Daoist replied: \"This matter is both most difficult and most easy—it cannot be lightly questioned.\" I earnestly entreated him again. The Daoist said: \"Some claim golden blossoms to be the yellow sprout, or take ore as true lead—such people will never succeed. The yellow sprout is the marrow of the Five Phases; true lead is the true essence of the Great One. It arises within primordial chaos, emerges from the Great Beginning, is born at the inception of Heaven and Earth, and thus can serve as the mother of all things. The great elixir harmonizes the supremacy of the Five Phases and equals the workings of Heaven and Earth.\"\n\nI bowed again and asked: \"May I dare inquire—how does the golden liquor returning elixir arise?\"\n\nThe Daoist said: \"The golden elixir arises from the Great Beginning. The Great Beginning gives birth to primordial chaos; chaos gives rise to the Two Modes; the Two Modes establish the Three Powers; the Three Powers operate the Eight Trigrams; the Eight Trigrams nourish the Nine Palaces. The Nine Palaces mark the completion of the elixir, and thus the primacy of the Great One. May I ask—what is the name of the Great Beginning, and what substance in the medicine does the master point to?\"\n\nThe Daoist said: \"It is true lead. Lead is the essence of water; water is the body of yin. When yin reaches its extreme, yang is born, transforming the myriad things. Without yang, nothing is born; when yang departs, death follows. To enact transformation, one must first establish yang. The birth of yang occurs in profound obscurity—none know it. As the *Daoist Scripture* says: 'In the profound and obscure, therein lies essence—this essence is most true.' The *Triple Unification* models itself on the *Zhouyi*’s *Fu* hexagram of Earth over Thunder. The great yang is born at *zi*, the eleventh-month hexagram. Thus, the divine workings of Heaven and Earth, wishing to carve and adorn the myriad blossoms and unfold the thousand flowers, receive the yang line at the time of yin’s extremity, borrowing the盛 of great yin to assist the subtle yang’s achievement—this is the meaning of the Great Beginning. Those who do not know that the golden elixir arises from the Great Beginning recklessly ingest metals and minerals, seeking transformation. It is like pouring colored dye on the earth, hoping to dye the forms of flowers and trees.\"\n\nI bowed again and asked: \"What is the substance that the Great Beginning gives birth to in primordial chaos?\"\n\nThe Daoist said: \"Chaos is the appearance of unopened fullness—white without, yellow within, like a chicken’s egg. When yin and yang unite but their essences and qi have not yet merged, it is called chaos. May I further inquire—what is the name of chaos in the medicine, and to what category does it belong? This is the meaning in Master Cui’s *Dragon Embryo Scripture*. When lead and mercury first unite, dragon and tiger first embrace, sun and moon intermingle, yin and yang mutually resonate—thus the elixir is born in chaos. The moon emits its radiance, the sun extends its light; the dragon receives its embryo, the tiger releases its qi. Like gold and jade in slumber, spirit and brightness embrace. Upon awakening, the dragon extends its qi, the tiger spits forth its essence, and the divine chamber adheres without separation. As the *Embracing the Origin Scripture* says: 'Containing the origin and receiving qi, nothing is not fulfilled; obtaining qi and receiving the origin, nothing is not complete.' Consider the things of the world—without containing consciousness, they cannot embrace the origin. Without abandoning consciousness, none attain form and substance. People do not know the root of dragon and tiger, the transformative origin of yin and yang. Recklessly employing metals and minerals to forge the returning elixir is like retreating to seek what lies ahead or chasing the sun to flee one’s shadow. Thus, the True Lord Wei said: 'Entering water to seek chicken and rabbit, climbing mountains to search for fish and dragon—how true!' This is the lament of the *Triple Unification* for later generations who love the Dao, exhaustively seeking teachings and exhausting ancient texts. Sons inherit their fathers’ work; grandsons follow their ancestors’ path—this clarifies the principle of containing the origin and receiving qi. It also says: 'To hatch a chicken, one must use an egg; to grow grain, one must plant grain.' And: 'The simurgh and sparrow do not give birth to phoenixes; foxes and hares do not nurse horses.' This is the meaning. People do not understand the Dao of containing the origin and embracing the embryo. They seek medicine from distant lands, smelting metals and refining minerals. If the great elixir could be completed with the five metals and eight minerals, then the True Lord Wei would not have composed the *Triple Unification*, and Master Cui would not have elucidated the *Great One Diagram*. The *Triple Unification* speaks of the mutual stirring of the two qi, the mutual impelling of the Eight Trigrams, the alternating residence of cold and heat, the opening and closing of yin and yang. If the two qi lose their measure, the myriad things do not flourish; if the Five Phases exceed their norm, the ten thousand spirits lose their order. How could the great elixir tolerate miscellaneous categories to achieve completion? Moreover, the *Great One Diagram* says: 'The Great One roams the Nine Palaces but does not enter the central position.' If one understands the Great One, then the center is water; the central palace is earth. Earth is the ghost of water—thus it detests the central palace and does not enter it.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1213,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.03908395767212,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\九还七返龙虎金丹析理真诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如丹游八卦，后入中官．’成黄金之熟。 诸将在太一左右为近，必有移历之象，以太一喻汞，诸将喻金石，明大药不用金石药也。 又诸同宫为囚，有不可之事、以知龙胎大丹，不入杂类也。 又明子午为易气，即卯酉为绝气，此乃皆是丹之节符也。 又问曰：何谓为两仪？ 道人曰：两仪者，天地剖判也，分形也，阴阳各有其位，日东月西，离南坎北。 又问曰：未委两仪在药，成何气象？ 道人曰：两仪在药中，是铅汞各相分也。 两仪既定，生在天财日月星，在药则三五一，药之到此，神化非遥。 又问日； 何名是三五一，道人曰：一是水，二是火，乃共三。 凡有三而自怀五也。 此乃是水火土，又名铅汞鼎也。 亦名三物一体，亦名一物三形。 姻萝子曰：三一之道也，大丹之中唯金水土尔。 又问曰：未委金水土如何分别？ 道人曰：金者，铅也，铅者、真金真土也。 且非是世间铅，生於太虚杳冥之内，是太一之真精，坎中之一画也，故曰天得一以清，地得一以宁，人得一以灵。 夫欲灵於人，莫过学长生不死之道也。 老子日子得一，万事毕也。 上代神仙，唯秘铅之一色，故古歌曰：铅若是真，不失家臣，铅若不真，与汞难亲。 分铅之与汞，是一家之物也。 又《龙巢经》云：夫圣人受命，必有同心德尔，是一家之物也。 耳目股肱，其港也，神鬼莫之； 其升也，天地合力。 将喻铅汞是一家之物，非外来杂类可成也。 古歌曰：南北路交差，朦胧是一家。 世人多将金银铅锡，笑银芽、金峡蝶、金蚁为铅·成丹药，可谓灌朽求花，钻冰待火，不明众类者哉！ 亦不识其宗枝，万万千千一无成矣！ ．且前诸物，并是顽物硬死质，岂有神通变化，易髓换筋乎？ 故《参同契》曰：狐兔不乳马，燕雀不生凤。 此之谓也。 又曰：同类易施功，异类难为巧。 又曰：鸡抱卵兮日数足，母生子兮十月全。 植禾当用粟，覆鸡当甩卵也。 且世问十二种铅，皆非大药之用，黑铅、黄丹铅、嘉州铅、生铅、草节铅、陇陀铅、白锡铅、银铅、金烁铅，己上皆是世问死质顽滞之物，纵强服之，皆随大肠而下，岂有长生久视不死之道乎？ 问曰：世问铅既不堪服饵，未委真铅从何而得？ 道人曰：真铅土从无入有，禀天地而成形，托日月而为质。 其君臣合会，父母生育，起参铢之杪，及成斤之灵，骨肉双全，血脉盈满。 汞之一见，则立伏焉1．故青霞子曰：情合无众药，气合无言语。 斯之谓也。 又问曰：汞之所出，何者堪成？ 道人曰：夫汞土亦有数般，故有自然汞，白砂汞，丹砂汞，修丹只用丹砂汞。 且砂之数，种类亦有多般，故有天座砂、神座砂、紫灵砂、光明砂、商砂、铁见砂、溪砂、土砂，其天座、玉座、金座、神座等，皆是自然还丹，不假烧炼二服之成仙。 诸天仙众，驾鹤乘龙，而来取之，世人莫得而见也。 其光明、紫灵砂等，则堪成大药，其商砂、土砂不堪服食，唯修利术则可矣！ ．又问曰：不知土是何物也？ 道人曰：夫土一味，真义极元，亦非世问之土也。 世人多以硫黄、雄黄、雌黄、毗黄、密陀僧、银等、铅黄花、白银、黄金以为其土，将偃於水，皆非其用也。 且土州无正形，遇气则生，得势便成，故生於四孟，王於四季，绝於四仲，镇安中宫，寄生丙丁，与水同气。",
      "translated_text": "As the elixir traverses the Eight Trigrams and later enters the central palace, it ripens into refined gold. The generals stationed near the Great One must exhibit the phenomenon of cyclical progression—thus, the Great One is likened to mercury, while the generals represent metals and minerals, clarifying that the great elixir does not employ metallic or mineral substances. Furthermore, when multiple entities share the same palace, they become imprisoned, indicating forbidden practices; this reveals that the Dragon Embryo Elixir does not incorporate miscellaneous categories. Moreover, it is made clear that *zi* and *wu* (midnight and noon) are the qi of transformation, while *mao* and *you* (dawn and dusk) are the qi of cessation—these are all temporal markers of the elixir’s progression.\n\nSomeone asked: What are the Two Modes?\nThe Daoist replied: The Two Modes refer to the division of Heaven and Earth, the separation of forms, with yin and yang each occupying their respective positions—sun in the east, moon in the west, *li* in the south, and *kan* in the north.\n\nAgain, they asked: What manifestation does the presence of the Two Modes produce within the elixir?\nThe Daoist said: The Two Modes within the elixir signify the distinct separation of lead and mercury. Once the Two Modes are established, in the heavens they give rise to the sun, moon, and stars; in the elixir, they become the Three, Five, and One. When the medicine reaches this stage, spiritual transformation is not far off.\n\nThey further inquired: What is the Three, Five, and One?\nThe Daoist replied: One is water, two is fire—together they make three. From these three, the five naturally emerge. This is water, fire, and earth, also called the lead, mercury, and crucible. It is also named the Three Substances as One Body, or the One Substance with Three Forms. Yanluo Zi said: This is the Dao of the Three-in-One, for within the great elixir, only gold, water, and earth are present.\n\nAgain, they asked: How are gold, water, and earth distinguished?\nThe Daoist said: Gold is lead, and lead is true gold and true earth—not the lead of the mundane world, but that which is born within the profound obscurity of the Great Void, the true essence of the Great One, the central line within *kan*. Thus it is said: Heaven attains the One and becomes clear; Earth attains the One and becomes tranquil; humanity attains the One and becomes numinous. If one seeks numinosity in humanity, nothing surpasses the study of the Dao of longevity and immortality. Laozi said: When the child attains the One, all matters are complete. The immortals of ancient times guarded the secrecy of lead’s singular nature, as the ancient song states: *If lead is true, it does not lose its household retainers; if lead is not true, it cannot befriend mercury.* Lead and mercury are of the same family.\n\nThe *Dragon’s Nest Scripture* also states: When a sage receives the mandate, they must possess a heart in harmony with virtue—these are of the same family. Ears, eyes, limbs, and trunk are its harbors; when it descends, ghosts and spirits cannot approach; when it ascends, Heaven and Earth combine their strength. This is to say that lead and mercury are of one family, and the elixir cannot be completed with external miscellaneous substances. The ancient song says: *Though the paths of south and north diverge, in obscurity they are one family.* Yet世人 often mistake gold, silver, lead, and tin for lead, or laugh at silver sprouts, golden butterflies, and golden ants as lead, attempting to refine the elixir—this is like watering rotten wood to seek blossoms or drilling ice to await fire! They do not comprehend the myriad categories, nor recognize their root and branches, and thus, despite countless efforts, achieve nothing.\n\nMoreover, all these substances are inert and lifeless matter—how could they possess spiritual transformation or the power to renew marrow and sinew? Thus, the *Triple Unification* states: *Foxes and hares do not nurse horses; swallows and sparrows do not hatch phoenixes.* This is the meaning. It also says: *Work is easily accomplished with the same kind; skill is difficult with different kinds.* And: *When a hen incubates an egg, the days are fulfilled, and the mother gives birth to the chick after ten months are complete.* One plants grain with millet and hatches a chicken with an egg.\n\nFurthermore, the twelve types of lead in the world are all unsuitable for the great elixir: black lead, red lead, Jiazhou lead, raw lead, grass-joint lead, Longtuo lead, white tin-lead, silver lead, and gold-smelted lead—all are dead, inert substances of the mundane world. Even if forcibly ingested, they pass through the large intestine and descend—how could they constitute the Dao of longevity, enduring vision, and immortality?\n\nThey asked: If mundane lead is unfit for ingestion, where does true lead come from?\nThe Daoist replied: True lead-earth emerges from non-being into being, receiving its form from Heaven and Earth and its substance from the sun and moon. When ruler and minister unite, when father and mother give birth, it begins as a minute speck and grows into a pound of numinous essence, with bones and flesh complete, blood and qi abundant. At the mere sight of mercury, it is immediately subdued. Thus, Qingxia Zi said: *When emotions harmonize, no other medicines are needed; when qi harmonizes, no words are spoken.* This is the meaning.\n\nAgain, they asked: Among the sources of mercury, which is suitable for refinement?\nThe Daoist said: Mercury also has several varieties: natural mercury, white sand mercury, cinnabar mercury. Only cinnabar mercury is used in elixir refinement. Moreover, cinnabar itself has many types: celestial throne cinnabar, divine throne cinnabar, purple numinous cinnabar, luminous cinnabar, commercial cinnabar, iron-veined cinnabar, stream cinnabar, and earth cinnabar. The celestial throne, jade throne, golden throne, and divine throne cinnabars are all naturally returning elixirs, requiring no firing or refinement—ingesting them leads to immortality. The immortals of the heavens, riding cranes and dragons, come to retrieve them, and mundane people cannot perceive them. Luminous and purple numinous cinnabars are suitable for refining the great elixir, while commercial and earth cinnabars are unfit for ingestion and only useful for minor arts.\n\nThey further asked: What is earth?\nThe Daoist replied: Earth is singular in flavor, and its true meaning is profound—it is not the earth of the mundane world. People often mistake sulfur, realgar, orpiment, arsenic, litharge, silver powder, lead yellow flowers, white silver, and yellow gold for earth, attempting to submerge them in water—none of these are suitable. Earth has no fixed form; it arises when qi converges and takes shape when conditions align. Thus, it is born in the four *meng* (first months of seasons), reigns in the four *ji* (last months), ceases in the four *zhong* (middle months), stabilizes the central palace, resides in *bing* and *ding*, and shares qi with water.",
      "overlap_context": "ure, the myriad things do not flourish; if the Five Phases exceed their norm, the ten thousand spirits lose their order. How could the great elixir tolerate miscellaneous categories to achieve completion? Moreover, the *Great One Diagram* says: 'The Great One roams the Nine Palaces but does not enter the central position.' If one understands the Great One, then the center is water; the central palace is earth. Earth is the ghost of water—thus it detests the central palace and does not enter it.\"",
      "start_char": 1213,
      "end_char": 2432,
      "start_sentence": 47,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.63709473609924,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\九还七返龙虎金丹析理真诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "略将前物为真土，其源还与水同黑乎？ 其真土者，是五行之真精，须假神合达造，变化生育，故得与乾坤合体，神化无穷，则堪与丹为宅也。 又问曰：金水土合成大丹，药味至寡，其功不多，未委几日而熟用鼎器？ 道人曰：《参同》云：初七十，终三旬，三百六十善调匀。 则一载而成也。 此乃太一周天也。 既不会太一周天，无由得大丹成熟也。 魏真人论周天之数，大而论之一年，小而论之一日。 故年与月同，月与日同，日与时同。 时运养周星法，只以一日夜为一周星也。 青霞子曰：鼎鼎非金鼎，炉炉非药炉，离从坎下发，汞在土、中居。 固济胎不泄，变化在须臾则不烦远求鼎器也。 古歌曰：日日只在君家舍，知白守黑，神明着矣！ ．敢问：知白守黑如何？ 道人曰：白者金之精，黑者水之基，此二味天地之大宝，日月之至精。 象君臣父子，夫妇女男。 敢再问修丹起首次序，幸垂指诀？ 道人曰：夫金丹须抱元结胎，敷花实子，返本还元之谓也。 又姻萝子曰：深根固蒂则长生久视之道也。 又曰：根深则花茂子实，故君子务本，本立而道生。 内若契道，金丹自至，无不形影相随，声响相应也。 道人曰：始自於砂，砂变成汞，汞变成金，金变成液，液化丹，故谓之金液还丹。 丹者赤色也，还其土，复还元也，故返木还其源也。 故元阳子日； 金化金兮银化银，何曾别有别圣神。 自然伏火者，百炼不烬，入水中如膏，入火成金，入口而化，其味甘香。 岂将世问杂类金石华木，有如斯神化乎！ ．又问曰：如何是舍元胎，敷花结实？ 道人曰：结龙胎，炼虎精也。 神水育黄芽，自三皇以来，皆口口相传，不留文字，恐泄天机。 妄说者沉沦三劫，吾子晦而勿言。 又问曰：幸所指教，以见宗元。 即入用不多，鼎药易置，欲依法修炼，得否？ 道人曰：夫烧丹者，须三备则可成矣t．三备者，一福二德三志，无福不成。 如《龙虎经》云：丹熟，视之丘陵冢墓，枯骨形象者，彼不堪服食，须弃中流，依法别烧。 此为无福之应也。 无德不能苞贮蕴藏，如赵元伯将丹诀赞燕中太子，太子好货，入造金银，铸鼎器，烧外药，其药未成而太子怒，使沈元伯於井中，斯无德之应。 无志则不能苦学，似有小失则生大悔。 如河中二薛令造丹不成，所有家中道门书策及烧药器具，悉皆焚毁於道路。 逢着道流，乃拔剑苦逐，曰：虚诞之徒，宜去之俄而坠马而死。 斯亦无志也。 吾子虽执其志，福德未圆，宜访巨福广德之人，共成之，则可矣！ 又问曰：上言妄说者沈之三劫，今令访人同修，莫违神诚？ 道人曰：夫三人共志，自古来然，不得妄说也。 故三人者，金水土也，三人已上，则为妄说。 君子一依余论，抄集缮写，次第绿由，运动配合，时候感应，流布世问，有缘自遇，其於口诀，则口口相传，心心相授，勿违神诚。 斯须达曙，即乃告辞，莫知所往。 余承奉道人指诀，一一条录，传诸好道，幸无弃焉！ 九还七返龙虎金丹析理真诀竟",
      "translated_text": "Should one take the aforementioned substances as true earth, does its origin share the same blackness as water? True earth is the quintessential essence of the Five Phases. It must be refined through divine union and transformation to generate and nurture, thereby uniting with Heaven and Earth in form, its spiritual transformations boundless. Only then is it fit to serve as the dwelling for the elixir.\n\nThey further asked: When gold, water, and earth combine to form the great elixir, the ingredients are few—how can its power be so vast? And how many days must one tend the crucible before it ripens?\nThe Daoist replied: As the *Cantong Qi* states:\n*\"At first seventy, then three decades,\nThree hundred sixty, well-tempered and even.\"*\nThus, it matures in one full year—this is the cycle of the Great One through the heavens. Without completing this celestial revolution, the great elixir cannot ripen. Master Wei’s discourse on the celestial numbers speaks of a year in the grand scheme, or a single day in the lesser. Thus, year aligns with month, month with day, day with hour. The method of nurturing through the revolving stars takes but a day and night for one full cycle.\n\nMaster Qingxia said:\n*\"The crucible is no metal vessel,\nThe furnace no mere drug stove.\nDeparting from Kan’s depths, it rises;\nMercury dwells within the earth’s embrace.\nSealed tight, the embryo leaks not—\nTransformation occurs in but a moment.\"*\nThus, one need not seek distant crucibles.\n\nAn ancient song says:\n*\"Day by day, it rests in your own dwelling,\nKnowing the white, guarding the black—\nThe numinous manifests!\"*\n\nThey dared ask: What does \"knowing the white, guarding the black\" mean?\nThe Daoist replied: The white is the essence of metal, the black the foundation of water—these two are the great treasures of Heaven and Earth, the purest essences of sun and moon. They symbolize ruler and minister, father and son, husband and wife, woman and man.\n\nThey again asked: Might you deign to outline the initial steps for refining the elixir?\nThe Daoist said: The golden elixir must embrace the primordial, knit the embryo, unfold the flower, and bear the fruit—this is called returning to the root and restoring the origin. As Master Yinluo said: *\"Deep roots and firm stems are the Way of long life and enduring vision.\"* And again: *\"Deep roots yield flourishing flowers and plump fruit; thus the noble one attends to the root, and with the root established, the Dao arises.\"* If one inwardly aligns with the Dao, the golden elixir will naturally arrive, its form and shadow inseparable, its sound and echo in perfect resonance.\n\nThe Daoist continued: It begins with cinnabar, which transforms into mercury, mercury into gold, gold into liquid, and the liquid into the elixir—hence it is called the *Golden Liquid Returned Elixir*. The elixir is of vermilion hue; returning to earth, it reverts to the origin, thus wood returns to its source. As Master Yuanyang said:\n*\"Gold refines into gold, silver into silver—\nWhen has there ever been another divine marvel?\nNaturally subduing fire, it withstands a hundred smeltings without decay,\nEnters water like a paste, fire like gold,\nMelts in the mouth with a sweet fragrance.\nHow could the world’s miscellaneous metals, stones, flowers, or trees\nEver achieve such divine transformation?\"*\n\nThey further asked: What does \"embracing the primordial embryo, unfolding the flower, and bearing the fruit\" entail?\nThe Daoist replied: It is the binding of the dragon’s embryo and the refining of the tiger’s essence. The divine water nurtures the yellow sprout. Since the Three Sovereigns, this has been transmitted mouth-to-mouth, never committed to writing, lest the celestial mechanism be revealed. Those who speak recklessly will sink through three kalpas. My disciple, keep this hidden and do not speak of it.\n\nThey asked again: Grateful for your guidance, I now perceive the fundamental principle. If the materials required are few and the crucible and ingredients easily obtained, may I proceed with the refinement according to the method?\nThe Daoist said: To refine the elixir, three conditions must be met: fortune, virtue, and resolve. Without fortune, it will not succeed. As the *Dragon-Tiger Classic* states: If the elixir, upon ripening, appears as hills, graves, or skeletal forms, it is unfit for ingestion—cast it into the flowing stream and refine anew. This is the sign of lacking fortune. Without virtue, one cannot contain and store the elixir. For instance, Zhao Yuanbo transmitted the elixir formula to the Crown Prince of Yanzhong, who coveted wealth. He used it to forge gold and silver, cast vessels, and refine external medicines. Before the elixir was complete, the prince grew angry and had Yuanbo drowned in a well—this is the consequence of lacking virtue. Without resolve, one cannot endure the hardships of study; even a minor setback breeds great regret. Like the two Xue brothers of Hezhong, who failed to complete the elixir, burned all their alchemical texts and tools in the street, and upon encountering Daoist travelers, drew their swords in furious pursuit, shouting: *\"Begone, you deceitful lot!\"* Soon after, they fell from their horses and died—this, too, is the result of lacking resolve. Though you possess resolve, your fortune and virtue are not yet complete. Seek one of great fortune and broad virtue to undertake this together—only then may it succeed.\n\nThey asked again: Earlier, you said those who speak recklessly will sink through three kalpas. Now you advise seeking others to refine together—does this not violate the divine command?\nThe Daoist replied: Since ancient times, three sharing a single resolve has been the way—this is not reckless speech. The three are gold, water, and earth; more than three constitutes recklessness. Noble one, adhere strictly to my discourse: transcribe, compile, and copy it in order. Follow the sequence of movements, pairings, and timings, and the resonances will manifest. Disseminate it in the world, and those with affinity will encounter it. As for the oral instructions, transmit them mouth-to-mouth, heart-to-heart—do not violate the divine command.\n\nAt the break of dawn, he took his leave, and none knew where he went. I, having received the Daoist’s instructions, recorded them in full to pass on to those who cherish the Dao—pray, do not discard them!\n\n*The True Principles of the Nine Returns, Seven Reversions, Dragon-Tiger Golden Elixir* concludes.",
      "overlap_context": "gar, orpiment, arsenic, litharge, silver powder, lead yellow flowers, white silver, and yellow gold for earth, attempting to submerge them in water—none of these are suitable. Earth has no fixed form; it arises when qi converges and takes shape when conditions align. Thus, it is born in the four *meng* (first months of seasons), reigns in the four *ji* (last months), ceases in the four *zhong* (middle months), stabilizes the central palace, resides in *bing* and *ding*, and shares qi with water.",
      "start_char": 2432,
      "end_char": 3548,
      "start_sentence": 97,
      "end_sentence": 145,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.69676661491394,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\九还七返龙虎金丹析理真诀.txt",
        "category": "方法类"
      }
    }
  ]
}