{
  "source_id": "九转金丹秘诀",
  "source_file": "chunked_daozang\\九转金丹秘诀.json",
  "total_chunks": 12,
  "total_original_chars": 10811,
  "total_translated_chars": 61749,
  "total_translation_time": 301.1852638721466,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\九转金丹秘诀.txt",
    "category": "藏外"
  },
  "full_translation": "The Master of the Muddy Pellet, Chen Pu, transmits the *Nine Cycles of the Golden Elixir Secret Formula*:\n\nFirst Cycle: Descending Elixir\nSecond Cycle: Union\nThird Cycle: Nurturing Yang\nFourth Cycle: Nurturing Yin\nFifth Cycle: Bone Transformation\nSixth Cycle: Flesh Transformation\nSeventh Cycle: Transformation of the Five Viscera and Six Bowels\nEighth Cycle: Cultivating Fire\nNinth Cycle: Ascension\n\n**First Cycle**\nBeneath the tongue lie four apertures—two connect to the heart, two to the fluids.\nThe work of the first cycle resembles a precious pearl,\nPervading the mountains, rivers, and cosmos with a numinous body.\nBeneath the red lotus leaf lies the elixir cave;\nCrimson water flows, nourishing the nine-pulse pearl.\n\n*Explanation:*\nThe work of the inner elixir begins with the one and is completed in the nine.\nThe one is that from which the myriad things are born.\nHeaven-one generates water, Earth-two generates fire,\nHeaven-three generates wood, Earth-four generates metal,\nHeaven-five generates earth—the sequence of the Five Phases begins with the one.\nThus, the work of the inner elixir also begins with the one,\nAnd through transformation is completed in the nine, for nine is the utmost of yang numbers.\nWhen the number reaches nine, the Dao-fruit is achieved.\nThe \"precious pearl\" refers to the true water of Heaven-one stored in the gallbladder,\nWhere yin and yang harmonize and descend to form the elixir.\nThe initial descent resembles a single dewdrop of luminous pearl.\nThe pearl signifies reverence for the elixir.\nMoreover, the human body is formed through the union of father’s essence and mother’s blood—this is the union of form.\nThe descent of the elixir is achieved through the union of heart-fire and kidney-water—this is the union of qi.\nThus it is said: union of form gives birth to humans; union of qi completes the elixir.\nAfter the elixir descends, the spirit roams beyond the mundane,\nYin and yang attain great harmony;\nOne forgets the body in stillness, and the mountains, rivers, heaven, and earth—\nThe six directions and the myriad things—all reside within this body.\nThis body exists beyond heaven, earth, and the myriad things,\nPerceiving only a single point of radiance within the heart—\nThis is the descent of the elixir.\nThus it is said: the mountains, rivers, and cosmos permeate the numinous body.\nThe \"body\" here refers to the self.\nThe mountains and rivers are contained within this body.\n\nThe \"red lotus\" refers to the tongue.\nThe two apertures connect to the heart, the other two to the fluids.\nWhen a person is ill, the tongue’s fluids dry and true qi dissipates.\nAt the outset of the first cycle, the tongue seals these two apertures,\nPreventing the leakage of true qi and facilitating the flow of divine water.\nThe \"crimson water\" refers to the heart’s fluids.\nAt the beginning of each of the nine cycles, on the ninth day, one inhales nine times,\nEach inhalation consisting of nine breaths.\nNaturally, the fluids flow from beneath the tongue,\nNourishing the five viscera—hence the \"nine-pulse pearl.\"\n\n*To the tune of \"Gazing at the Southern River\"*\nSeal the tongue’s artful skill, connect the gallbladder’s qi.\nThe yellow treasure must be sought within the gallbladder.\nThe spring wind quickens the myriad things,\nHeaven and earth lie beneath my knees, my peers in the Dao,\nAs the hundred vessels flow freely.\nEnacting creation, the left and right fires are drawn forth.\nVast and boundless, they illuminate the cosmos;\nThe bitter smoke ascends, veiling the encircling towers,\nAs husband and wife gradually conspire.\n\n*Explanation:*\nHeaven-one generates qi, called the Central Yellow.\nThis qi is stored in the gallbladder as the root of life and destiny, its flavor bitter.\nThus, the gallbladder’s qi and flavor are also bitter.\nLike the roots of plants and trees, which bear bitter blossoms,\nWe know that without generative qi, the myriad things cannot come to life.\nThe medicine of the inner elixir first seals the apertures beneath the tongue,\nInternally connecting the gallbladder’s generative qi to the throat and tongue,\nWhere a faint bitter taste is perceived—this is the flow of elixir qi.\nThereafter, mercury and water congeal to form the elixir.\nThe generative qi of heaven and earth sprouts in spring;\nThe myriad things receive this generative qi before they can live.\nHumans, too, receive generative qi, stored in the gallbladder.\nBy connecting the gallbladder’s qi, the inner elixir completes the first cycle’s work,\nLike the spring of the four seasons.\nAs the generative qi ascends, a bitter sensation arises,\nYin and yang attain great harmony, and the spirit dwells beyond heaven—\nThen the four seas and the cosmos lie beneath one’s knees.\nA vast qi fills heaven and earth, the hundred vessels flow freely, and the myriad apertures open.\nThis is the descent of the inner elixir.\n\"Enacting creation\" refers to the initial steps.\nFirst, seal the two apertures beneath the tongue to prevent qi from leaking outward.\nThe qi on the left passes through the left Greater Yang into the brain,\nWhile the qi on the right passes through the right Greater Yin into the brain,\nBoth converging in the brain before entering the Muddy Pellet Palace atop the head,\nDescending through the twelve-storied tower of the throat,\nEntering the heart meridian, and transmitting to the elixir center to open the gallbladder’s aperture.\nThis allows the gallbladder’s generative qi to ascend along the heart and gallbladder meridians,\nPassing through the tongue’s apertures, where a bitter taste is perceived—\nThis is the generative qi preparing to descend the elixir.\nThen, sealing the tongue’s apertures, the qi on both sides ascends,\nCreating a surging sensation.\nWhen the gallbladder’s aperture is sealed, the generative qi rises gently,\nAscending the twelve-storied tower of the throat from the tongue’s apertures,\nFilling the mouth with a bitter taste—this is the flow of generative qi.\n\"Husband and wife\" refer to yin and yang:\nThe husband is yang, the wife is yin.\nWhen generative qi flows freely, yin and yang attain great harmony,\nAnd heart and kidney unite—hence \"gradually conspire.\"\n\n*Oral Instructions:*\nAt the outset of practice, first harmonize the five viscera with diet—\nNeither hunger nor satiety, the heart-field calm and free of worries—\nOnly then can one enter the Dao.\nAt the end of the second watch and the beginning of the third,\nWash and rinse, settle the spirit, and enter the chamber.\nBurn incense, sit cross-legged, close the eyes, and concentrate the spirit.\nWait until the breath is even, then curl the tongue backward to seal its root and the two apertures, holding the breath.\nGradually, two streams of qi from the left and right Greater Yang meridians rise from the jaw’s root,\nPassing through the two Greater Yang points before entering the crown of the head,\nWhere the two qi converge and coalesce.\nClose the eyes for a long while, then curl the tongue as before,\nWaiting until the qi reaches the Muddy Pellet Palace before stopping.\nPractice this three times each night.\nAfter several nights or days, the qi will gradually flow from the Muddy Pellet Palace into the brain,\nDescending the twelve-storied tower of the throat,\nPiercing the spine and threading the tailbone,\nThen rising to the heart and penetrating the gallbladder,\nWarming the navel and chest with a gentle, harmonious sensation—\nThis is the true descent.\n\nAfter this, over several nights, you will gradually feel the qi reach the heart, then sense a gentle warmth or the heart’s qi beginning to stir. A warm qi will rise from the heart, passing through the twelve-storied tower of the throat, where a slight bitterness may be perceived. This is the Central Yellow qi emerging from the gallbladder, signifying the great harmony of yin and yang and the imminent descent of the elixir.\n\nFollowing this, at the start of each night’s practice, have someone stand guard outside the door to prevent anyone from entering, or cats and dogs from startling you. After practicing two or three times each night, place a small table before you as you sit. Suddenly, the qi will surge, and you will feel your body gradually expand, your spirit soaring. Gradually, the house, people, mountains, and rivers will all appear within your body. Your hands and feet will seem to vanish. Quickly press your hands upon the table, close your eyes, and in a profound state of awareness, you will perceive a luminous orb at your heart, round as the sun. Suddenly, it will descend into the elixir field—this is the descent of the elixir.\n\nAfter the elixir descends, do not open your eyes immediately. Gradually gather your spirit and settle it. Your limbs will return to their usual state, though they may feel numb or tingling. Wait until you are fully composed before opening your eyes, then drink ginseng broth and sleep. The next morning, take congee to nourish yourself for one or two days. This is the descent of the elixir. Once the elixir has descended, all illnesses will vanish, and no suffering or affliction will remain.\n\n**Second Cycle**\nThe second cycle begins as yang completes and yin coalesces,\nThe radiance of the kidneys and the fluid of the heart unite in ding and ren.\nThe divine pearl, swift as lightning, returns to the Eastern Sea,\nIts sacred light bursting forth to illuminate purple gold.\n\nExplanation:\nAt the start of the second cycle, it is like a woman two months with child—the initial descent of the embryo is the essence of true yang. The spirit is the elixir heart, belonging to fire and categorized as yin, pairing with the southern ding fire. Ding is the yin of fire. The kidneys belong to water and are categorized as yang, pairing with the northern ren water. Ren is the yang of water.\n\nLü says:\nFire is drawn from the marrow of the cinnabar phoenix of the south,\nWater is sought from the essence of the black turtle of the north.\nThus, in the second cycle, yang is nurtured, allowing the radiance of the heart’s fire to stir below. In the third cycle, yin is nurtured, allowing the fluid of the kidney’s water to unite above. True water and true fire ascend and descend in harmony, with ding and ren embracing and nurturing the true elixir to complete the transformation.\n\nWhen the elixir first descends, it is nurtured in the heart, cultivated by true fire to quicken its growth. Once the first cycle is complete, the elixir flows down from the heart’s network and is stored in the elixir field, nurtured by true water—this is the work of the second cycle. After the elixir is stored in the elixir field, sit quietly in an empty room. Suddenly, a radiance will appear, illuminating the womb like a golden orb—this is the light of the moon.\n\n*To the tune of \"Gazing at the Jiangnan\"*\nThe mysterious pearl descends,\nThe elixir chamber lies within the Central Palace.\n\nNine breaths harmonize the ninefold count,\nCrimson waves surge forth in the east of the Great Yang—\nHeart and kidney then commune as one.\nAt sixfold change, six breaths nurture yin’s work.\n\nFire from the Sea Gate ascends to the Emperor’s Seat,\nWater from the lotus calyx aids Ding Gong—\nViolet lightning pierces the translucent.\n\n*Explanation:*\nThe mysterious pearl is the true elixir. At the first turning’s outset, the elixir descends into the heart’s network, thus it is said the elixir chamber lies within the Central Palace—this descent marks the first turning. After the elixir descends, whenever the ninth day arrives, hold the breath for nine breaths as one cycle, reaching nine nines—eighty-one—to complete nine cycles. Hence it is called the ninefold count. When the nine nines’ work is accomplished, true yang’s elixir is full, flowing from the heart’s network into the elixir field, where the elixir is stored in the Water Palace to nurture its yin. The east of the Great Yang symbolizes the Water Palace of the elixir field, the kidney’s water. The elixir’s spirit is stored in the heart to nurture true fire; when the elixir turns and returns to the kidney, it next nurtures true water. With water and fire in harmony, yin and yang unite in great balance—thus it is said heart and kidney commune. When the second turning’s work is complete, it marks the beginning of the third turning. At sixfold encounters, hold the breath, six breaths as one cycle, six sixes—thirty-six—as one round to nurture yin—hence it is called the sixfold breath. The yin work’s Sea Gate is the kidney’s palace of the elixir field. When the true elixir is stored in the elixir field, the count of the elixir’s yang is fulfilled. Each time noon arrives, the spirit from the elixir field, borne by hot qi, ascends to the heart—this is the Emperor’s Seat. The lotus calyx is the tongue; when the inner yin’s count of six sixes is fulfilled, the divine water of the lower Lotus Pool irrigates the heart’s network to nurture the elixir’s qi—thus it is said to aid Ding Gong. Ding is the heart’s fire. Here, true water and true fire accomplish the work of harmony. When yin and yang are in harmony and the true elixir’s qi is full, a divine radiance appears upon the face and eyes. At midnight, sitting in stillness and inwardly observing the viscera, inside and out are clearly seen, the mysterious pearl directly perceived, nurtured within the elixir field—thus it is said to pierce the translucent.\n\n*Oral Instructions:*\nAfter the elixir descends and the first turning is complete, whenever the ninth, nineteenth, or twenty-ninth day arrives, at noon sit quietly in an empty room. Cross the legs, close the eyes, sit upright, and click the teeth nine times. Spirit and qi commune, then hold the breath—each holding counts nine breaths as one cycle. Open the eyes for a long while, then hold the breath again, as before, nine breaths as one cycle. At the first holding, one or two cycles may bring warmth; by the fifth cycle, extreme heat arises. Proceeding to nine cycles, continue until the inner fire’s timing is fulfilled, resonating with heaven and earth, regardless of distance. If, upon entering the ninth breath, warmth stirs in the heart, the four spirits harmonize and flourish, the heart’s spirit stirs, and a stream of hot qi descends to the elixir field—this marks the completion of the second turning. Thereafter, the count of nine breaths is no longer practiced. The third turning...\n\nThe third turning conducts yang into the left palace, where the Mystic Pearl’s fetal hue gradually brightens to crimson. The numinous fire nurtures and divides its forms, while the celestial pipes hasten the work of creation.\n\nExplanation: Upon the completion of the third turning of the elixir, when heaven’s course enters yin, one cultivates the qi of true yin. Once the inner yin’s count is fulfilled, the elixir enters the cinnabar field and flows to the left flank, causing the four limbs to stream with sweat to subdue the corpse-qi. With the third turning accomplished, the three corpse-spirits are no more. The Numinous Pearl is the inner elixir. Thereafter, yang qi abounds, and even urine, mucus, and saliva all assume a pink hue, corresponding to the quality of pure yang. When the elixir’s radiance reveals a luminous pearl—like a wheel of fire—beneath the left flank, the count of the third turning is complete. At each month’s end, stroke the crown with the left hand, draw in breath to stir the elixir-fire until the five viscera grow warm—this is called nurturing the fire to circulate the elixir. From this point, one gradually senses a presence in the cinnabar field; with each inhalation, the elixir stirs, hence the phrase “dividing its forms.” When heaven and earth harmonize, their resonance produces sound—this is the celestial pipes. Before the third turning, the nine orifices are closed and their sounds unheard; after the third turning, the nine orifices become keenly attuned to the celestial pipes’ music, heard day and night without cease.\n\n*To the Tune of \"Wàng Jiāngnán\"*\nThe hair grows fine,\nas the third turning moves yang.\n\nThe fetal hue gradually reddens as yin recedes,\nshifting through the years’ cycles to aid yang’s firmness—\nnurturing fire to foster the central palace.\nThe formed image appears,\nand at the fifth turning, one discerns the subtle and vast.\n\nIts ingress and egress remain slow, its form still small;\nat dawn and dusk, one drinks the jade flask’s nectar,\nwhile celestial pipes play the sheng and huang.\n\n*Explanation:*\nWhen the third turning completes its yang count,\nthe yin tortoise gradually contracts,\nand the intestines and stomach gradually open like an umbrella.\nWithin a month, there are ten movements of both bowels,\ngradually entering earth’s position,\nnearing the attainment of the Dao of no leakage.\nQian hexagram is all yang, symbolizing pure yang.\n\nStroking the crown while drawing in breath,\none inwardly nurtures the fire,\nthe elixir embracing the sacred embryo,\nnearing the formation of its image.\nThe five peaks are not yet complete,\nand at the eighth turning, its form stirs—\nlike a small child of three or four inches.\nThe vision of it is not yet distinct,\nfor yang qi is now full but has not yet nurtured yin.\nThe sacred embryo possesses a hun-soul\nbut has not yet acquired a po-soul.\nThus its ingress and egress remain slow,\nand its form still small.\n\nWhen the sacred embryo takes shape,\nbetween sittings and breaths,\none constantly sees its countenance radiant with light.\nThe sweet dew of the bubbling spring flows forth to drink.\nThe seven orifices grow keen,\nand one hears the music of immortals.\n\n*Oral Instructions:*\nAfter the elixir enters the left flank\nand the work of the third turning is complete,\non the sixth, sixteenth, and twenty-sixth days of each month—\nthe three sixes—\nat midnight, the hour of *zi*,\nwash and rinse, then enter a pure chamber.\nSit upright with legs crossed,\nknock the teeth thirty-six times,\ngather the spirit and settle the qi,\nclose the mouth and draw in breath six times as one cycle.\nRepeat this six times to complete the practice.\n\nOn the third and sixth days of the month,\nperform this three times in the month,\nfulfilling the count by the month’s end.\nAt midnight, the hour of *zi*,\nsit in the pure chamber as before,\neyes closed, legs crossed.\nFirst, use the left hand to stroke the crown,\nand the right hand to stroke the tailbone at the spine’s end,\nturning with the moon for forty-nine cycles.\nWhile stroking, hold the breath firmly until the count is complete,\nthen rest briefly to settle the qi.\nRepeat this three times,\nuntil one feels the qi of heart and kidney\nmeet at the central diaphragm,\ngently stirring the elixir-qi,\nfilling the five viscera.\nWhen the five viscera grow as hot as fire,\nit is the time to circulate the fire.\n\nAt times on the three sixes or the month’s end,\none may suddenly feel the elixir beneath the left flank stir,\nwith a thread of hot qi passing through the cinnabar field\nstraight into the flank,\nits heat like fire,\nshaking for a long while before settling—\nthis completes the work of the fourth turning.\nFrom this point, one no longer practices the count of the heavy heaven.\n\n**Fourth Turning**\nClosing the yang gate’s qi,\nthe nose as heaven’s orifice, the mouth as earth’s orifice.\n\nAt the fourth turning, yin moves into the right pass,\nthe sacred embryo’s numinous work brightens the crimson countenance.\nA halo of light fills the chamber, the spirit unobstructed—\ndrums and music play as one roams and returns.\n\n*Explanation:*\nThe left pertains to yang, the right to yin.\nAfter the fourth turning, the inner elixir resides on the right,\ncorresponding to the count of inner yin.\nFrom this point, inner yin and yang are both full.\nThe third turning nurtures yang,\nand the sacred embryo generates its hun-soul.\nThe fourth turning nurtures yin,\nand the sacred embryo generates its po-soul.\nAt the elixir’s fourth turning,\nthe sacred embryo within possesses both hun and po.\nIts five peaks and spirit\nmirror one’s inner visage—\nthis is the true body of spirit departure.\n\nAfter the fourth turning,\nwith yin and yang qi full,\nsitting upright and holding the breath,\nthe inner spirit-light emerges from the crown.\nLike a bright moon encircling the body,\nthe spirit roams beyond the mundane,\ningress and egress unobstructed.\nSitting in the chamber, one sees the four seas\nand knows fortune and misfortune.\n\n*To the Tune of \"Wàng Jiāngnán\"*\nThe elixir has returned,\nat the fourth turning, yin moves.\nOn the sixth, close and store the yang gate’s qi,\nthe three passes fully open, merging *ding* and *ren*—\nthe tortoise roams, freely rising and sinking.\n\nAt times it emerges,\nunobstructed, piercing others’ hearts.\nPlayfully, the spirit-sage often appears,\na halo of light encircling a thousand *xun*,\nneither cold nor heat assailing.\n\n*Explanation:*\nThe fourth turning nurtures inner yin,\nthe elixir concealed in the right flank.\nThe nose is heaven’s orifice, the mouth earth’s orifice.\nQi exhaled through the nose pertains to yang,\nqi exhaled through the mouth pertains to yin.\nOn the nights of the three sixes,\nclose the nose’s breath,\ncutting off its coming and going.\nYang qi descends inwardly,\nfilling the five viscera—\nthis is using yang to nurture yin.\nClosing the nose’s orifice,\nthe flower pool’s waters brim,\nflowing down to moisten the heart’s network.\nWater and fire inwardly merge,\nheart qi descends,\nkidney qi ascends,\n*ding* and *ren* unite,\nand the sacred embryo’s yin and yang counts are full.\nThe elixir in the right flank\nrises and falls with the qi,\nlike a tortoise in water,\nfreely rising and sinking.\nThe inner elixir’s light\nenvelops my body,\nits form like the moon,\nneither cold nor heat assailing.\nMy heart connects with others’ hearts,\ndiscerning good and evil.\nThe infant emerges and enters,\nplayfully roaming the four seas—\none’s name is recorded in the immortal registers.\n\n*Oral Instructions:*\nFor the nose’s orifice and mouth’s orifice,\nafter the elixir enters the right flank\nand the work of the fourth turning is complete,\non the sixth, sixteenth, and twenty-sixth days of each month,\nat midnight, the hour of *zi*,\nwash and rinse, then enter a quiet chamber.\nSit with eyes closed and legs crossed,\nknock the teeth thirty-six times,\ngather the spirit and settle the qi,\nclose the nose’s breath, utterly still,\nwaiting for the true qi.\nWhen the inner cinnabar field’s qi pierces the tongue’s orifice,\nthe flower pool’s fluids well up, filling the mouth,\nnearly overflowing—\nthen gently swallow them, guiding them to the heart.\nWhen the spirit-water reaches the heart,\nit stirs the spirit-fire,\nthe five viscera grow warm,\nsweat bathes the body,\nand the four limbs feel refreshed—\nthis is one cycle.\nOn the nights of the three origins,\nperform this three times and stop.\nThis is the spirit-water and spirit-fire\nembracing and nurturing the original essence.\n\nAfter this nurturing,\nwhen circulating the three passes,\nthe inner elixir from the flank\nrumbles like thunder.\nA thread of hot qi enters the cinnabar field,\nfirelight shoots from the nose—\nthus the inner elixir returns to the cinnabar field,\ncompleting the fifth turning.\nFrom this point, one no longer practices the method of closing the yang gate.\n\n**Fifth Turning**\nAt the fifth turning, yin and yang complete their transformations,\nthe infant, a foot in length, plays with yang’s essence.\n\nWhen asleep, one roams the four seas; when awake, one knows their place—\ncoming and going without effort, walking at will as one pleases.\n\n**Explanation:**\nAt the fourth turning, one nurtures the inner yin;\nat the third turning, one nurtures the inner yang;\nat the fifth turning, both inner and outer,\nyin and yang reach their full measure.\nThe work of transformation is complete,\nthe sacred embryo’s spiritual powers now unrestrained—\nthus it is said, \"the transformations are complete.\"\nAfter the fifth turning, the inner elixir’s sacred embryo is fully nurtured,\nthe numinous body grows to over a foot in length.\nFrom this point, one absorbs the essence of the sun\nto nourish the outer yang,\nseizing the transformative power of Heaven and Earth.\n\nOrdinary people, having nothing within to nurture,\nlet their spirit scatter without return.\nBy day, their spirit dwells in the heart;\nby night, it leaves the body.\nWhen sleep overtakes them, the spirit has no swift guard—\nthey know neither body nor place,\ndrifting with hun and po,\nentering the dark realms,\ngathering with ghosts.\nIn dreams, they witness the decay of the four great elements,\ntheir spirit following ghosts,\nreceiving rebirth in heaven or hell according to karma—\nall beyond their control,\ntheir spirit unaware of its form,\nadrift on the waves.\n\nThe perfected one who attains the Dao,\nhaving completed the inner elixir,\nunites spirit with body,\nunmoved by external things.\nThus hun and po lie hidden,\nno evil can intrude,\nno cares remain,\nliberation from life and death lies within their grasp.\nExiting and entering spirit, unfathomable in movement—\nhence the alchemical ode says:\n*\"The true person has no dreams.\"*\nThis is its meaning.\n\nThe perfected one who attains the Dao—\ntheir spirit knows no stagnation,\ntheir hun abides within,\nwalking at will without hindrance.\n\n*Gazing at the River South*\nThe pearl from the right,\na purple lightning enters the cinnabar city.\n\nWithin, the infant is nurtured into a crimson elephant,\ntimely encountering the five revolutions to gather yang essence—\nfire arises from water.\nBurning the demonic peaks,\npurple lightning surges, towering and majestic.\nRoaming at will through the vast seas,\nsleeping like a long whale resting on sandy shoals,\nmoving in harmony with the seasons.\n\n*Explanation:*\nWhen the five revolutions are complete and the numbers of yin and yang are fulfilled, the inner elixir’s mysterious pearl suddenly emits a streak of true fire from the right flank into the cinnabar field. Its sound is like thunder, its light like flame—this is the inner yin and yang of the elixir pearl returning to the cinnabar field to fulfill the five revolutions. Within the sacred embryo, the perfected one is accomplished, emerging and entering through the crown gate, over a foot in length. The third revolution nurtures yang, the fourth nurtures yin, and the inner yin and yang are both fulfilled. When the cinnabar field completes the five revolutions, it seizes the creative power of heaven and earth. Gathering the essence of the sun forms the path of external yang cultivation. From inner to outer, the sequence is orderly. Thus, after the five revolutions, within a month, on the days of the three nines, one gathers the essence of the sun and moon to nurture the sacred embryo. The method of practice is to seek fire through water, seek yang through yin—when water and fire are in harmony, yin and yang achieve great balance. Hence it is said: *fire arises from water.* Ordinary people accumulate yin qi below the cinnabar field, calling it the demonic peaks. When the body becomes purely yang, the yin mountains and demonic peaks are incinerated, and the yang palace and divine court are established. Master Lü said: *\"The burning mountain talisman—demons dare not gaze.\"* This is its meaning. Roaming the four seas at will, coming and going as one desires. In sleep, one recognizes the body; upon waking, the spirit moves outward, and the body perceives its original form, like a long whale resting on sandy shoals. After the five revolutions, the work of creation is complete. In virtue, one joins with heaven and earth; in brightness, one joins with the sun and moon. The inner elixir’s creation moves in step with time.\n\n*Oral Instructions:*\nWhen the inner elixir returns to the cinnabar field and the five revolutions are accomplished, the numbers of inner yin and yang are fulfilled. One then gathers the outer yin and yang to complete the great Dao. On the ninth, nineteenth, and twenty-ninth days of each month—the days of the three nines—at high noon, face south, sit cross-legged with eyes closed, and sit facing the sun. Wait until the qi settles and the breath ceases, allowing no movement of qi, so that true yang is not leaked and fills the interior, and the inner true fire communicates. One will feel the entire body suffused with redness, light filling the room. After a moment or two, a stream of true water from the cinnabar field—a cold qi—rises straight to the heart, like a crystal pearl floating above it. Then, closing the eyes and opening the breath, inhale through the nose, drawing in eighty-one breaths, and gather them into the heart. Once the sunlight reaches the heart, one gradually feels the qi stirring at the heart’s center, leaping in the cinnabar field like a fish—this is the great harmony of yin and yang. Stop at eighty-one breaths. Practice this for three years to complete the work. After three years, one no longer gathers the sun’s essence but instead gathers the moon’s radiance.\n\n*Sixth Revolution:*\nThe sun has five colors over three years,\nthe moon has nine rays over one year.\nIn the sixth revolution, the cinnabar field plays with the moon’s radiance,\ntransforming the embryo, the hun and po’s shadows stealthily recede.\nYang cinnabar replaces the bones, yin dissolves the flesh—\nexchanging all for true suchness, flawless as jade.\n\n*Explanation:*\nWhen the elixir reaches the sixth revolution, inner and outer yin and yang are both complete. The sacred embryo is fully formed, and the perfected one becomes one with the inner body. On nights when the moon is full, one gathers the moon’s radiance to accumulate yin—hence it is called *playing with the moon’s radiance.* In the fifth revolution, true yang is complete, and the hun transforms into spirit. In the sixth revolution, true yin is complete, and the po transforms into qi. The hun and po, inner and outer, roam freely in daylight, leaving no shadow, becoming one with the sun’s pure yang. From this point on, ghosts and spirits cannot be seen, yin and yang cannot be fathomed—thus the path of the true immortal is achieved. Hence it is said: *the shadows stealthily recede.* The ordinary person’s impure bones and turbid body, with unclean yin and yang, cannot ascend to attain the Dao. After the perfected one’s elixir is formed in the fourth revolution, by the fifth revolution, one gathers the sun’s essence, congealing it in the cinnabar field to form yang cinnabar. The cinnabar enters the bone marrow, dissolving with sweat—hence it is said: *yang cinnabar replaces the bones.* After the bone replacement, in the sixth revolution, one gathers the moon’s radiance, congealing it in the cinnabar field to form yin powder. After a year of gathering the moon’s radiance, the yin powder transforms internally to nurture the immortal’s flesh. One will notice blood often appearing in the urine—this is the yin dissolving the ordinary flesh, while the immortal’s flesh naturally grows. Hence it is said: *yin dissolves the flesh.* Jade with flaws is not true jade; a person with an ordinary body and turbid bones is not a true person. After the sixth revolution, the ordinary bones are replaced with immortal bones, the ordinary flesh is shed to grow immortal flesh—exchanging all for flawless unity, the immortal is pure.\n\n*Gazing at the River South*\nThe sun’s essence fills,\nthe yin po transforms, leaving no form.\n\nAt each full moon, open the earthly gate,\nthe sacred tortoise drinks the azure jade’s essence—\npure and clean as water once more.\nYang powder glows crimson,\nyin powder bears a faint blue-green hue.\nPowder replaces flesh, powder replaces bone,\nthe mortal womb is wholly exchanged for the sacred embryo’s numen,\nascending swift as a shooting star.\n\n*Explanation:*\nWhen yin and yang’s numbers are complete,\nhun and po unite within and without,\nthe body leaves no shadow or form—\nthis is the Way of ascending as a perfected one.\nAt each sixth revolution, on the full-moon night of the fifteenth,\ncirculate the north’s kidney-water to join the south’s heart-fire,\nenabling the inner and outer water and fire to achieve mutual fulfillment,\nthereby congealing yin powder.\nIn harmony with heaven and earth’s creative transformations,\nit nurtures the sacred embryo’s substance.\nThe *sacred tortoise* is the tortoise within kidney-water.\nMaster Lü says: *\"The sea-tortoise’s child—none recognize it;\nthe mountain-burning talisman—ghosts dare not behold.\"*\nThis refers precisely to it.\nGathering the moon’s radiant essence into the palace of spirit-water,\nthe sacred tortoise drinks it—pure as jade, cold as congealed yin.\nThe powder arises within the northern pole,\nhence it takes the tortoise’s form.\n*Yang powder* is congealed from the sun’s essence,\nthus belonging to yang—its crimson hue likewise mirrors the sun.\n*Yin powder* is congealed from moon radiance,\nthus belonging to yin—its blue-green hue mirrors the moon.\nWhen bones and flesh are wholly exchanged,\nthe embryo’s inner flesh, bones, skin, and muscle all vanish,\ntransforming entirely into immortal substance.\nThe hun transforms to merge with spirit,\nthe po transforms to merge with qi,\nall becoming a single, pure unity.\nForm and spirit both wondrous,\nthey unite with the Dao in truth.\nThose who study the Dao may preserve their spirit,\nbut cannot yet exchange their form.\nBurdened by form, when the spirit departs, the body cannot move.\nThe corpse lends form—bound by form’s burden,\nwhen the spirit departs, the body cannot move;\nthe corpse lends form—one cannot forget the body.\nAfter the sixth revolution of the elixir’s completion,\nthe mortal form is exchanged for immortal substance.\nForm and spirit both wondrous,\nwherever the spirit directs, the body follows,\nascending to the nine heavens,\nswift as clouds, swift as stars.\n\n*Oral Instructions:*\nWhen the elixir completes its sixth revolution,\ngather the moon’s radiance.\nAt each full moon, on the fifteenth night at midnight,\nwash and rinse, then sit facing the moon.\nClose the breath, seal the mouth,\ncut off the incoming and outgoing breath,\nso true qi does not leak outward.\nWithin, true qi fills the six viscera;\nthe kidney’s true yin and the great yang’s essence,\nthe inner and outer true qi,\ngleam like crystal—limpid and luminous.\nAfter one or two moments,\nthe kidney’s true water stirs the heart’s fire,\na thread of the heart-spirit’s fire descends into the cinnabar field,\nlike a wheel of flame set within a lapis lazuli dish.\nThen gently open the eyes,\nrelease the breath through the nose,\nand facing the moon, inhale the moon’s qi into the cinnabar field.\nDraw eighty-one breaths and stop.\nAfter half the inhalations,\nthe moon’s true yin excites the cinnabar field’s true fire,\nwater and fire achieve mutual fulfillment,\nlike boiling water—\nthe four limbs sweat, the hundred vessels flow freely.\nStop at eighty-one breaths.\nPracticing thus for three years completes the work,\nadvancing the achievement to the seventh revolution’s stage.\n\n*The Seventh Revolution*\nAt the seventh revolution, the body flies—four limbs light,\nspirit-light seals the breath, filling the cinnabar city.\nAfter a thousand mornings of grain abstention, fire naturally arises;\nthe Kun-gate opens and closes, bathing the ocean’s whale.\n\n*Explanation:*\nWhen the elixir completes its sixth revolution,\nyin and yang, inner and outer, are both fulfilled.\nMortal bones are exchanged for immortal bones,\nmortal flesh for immortal flesh—\nthe four limbs and hundred bones harbor no mortal substance.\nThe immortal body is light and pure,\nascension comes naturally.\nThe inner elixir refines the spirit-skeleton,\nthus the entire body becomes lighter.\nAt the seventh revolution of the elixir,\nyin and yang, inner and outer, harmonize.\nOne must seal the breath for ten mornings\nto perfect the wondrous Dao’s function.\nWhen the elixir completes its seventh revolution,\nseal the breath for a thousand mornings,\nenabling yin and yang’s great harmony.\nWhen the thousand days’ count is complete,\nspirit and qi unite,\nthe five viscera are renewed,\ninner and outer become pure unity.\nThe elixir’s light shines through the six viscera,\ntrue fire illuminates the five inner organs,\nthe worms in the intestines transform into water.\nFrom this point, the intestines and stomach are replete,\nuntainted by the qi of smoke and fire,\nunfed by smoke and fire’s food.\nHunger is sated with immortal fruits,\nthirst quenched with jade nectar—\nunlike the worldly.\nAfter the inner elixir fully transforms,\nthe yin organ vanishes, leaving only one aperture,\ncalled the *Kun-gate*,\nwhich mirrors yin.\nWhenever the spirit-elixir’s fire blazes,\non the third nine-day period,\nimmerse the body in water,\ncirculate the elixir pearl,\nletting it emerge from the Kun-gate—\ninhale, exhale, play with the water, freely at ease.\nAfter one or two hours,\nreturn the elixir to its cinnabar cave\nto restrain the fire’s intensity.\n\n*Gazing at the River South*\nThe form penetrates the sun,\nat the seventh revolution, soaring at will.\n\nSecluded in the depths of silent cliffs, one sits in meditation,\nbreath still, with no coming or going—qi solidifies and congeals.\nRejecting grains reveals its power,\nfor fire is born of life,\nand returning to the root, qi becomes limpid and clear.\n\nWhen bathing during the ninefold cycles, the Earth-gate opens;\nfrom the moon one gathers fire, from the sun seeks ice—\nthe five viscera are renewed anew.\n\n*Explanation:*\nAfter the seven revolutions, form and spirit both attain subtlety,\nand the inner organs all become vessels of immortality.\nRoaming at midday, the body becomes luminous,\nits hue like red jade,\nsoaring and ascending through space, moving freely at will.\nIn general, one must ensure inner and outer harmony,\nso that the radiance of sun and moon\nconverges in the heart and kidneys, water and fire,\nwith yin and yang in communion, spirit and qi in harmony.\nDeep within mountain valleys, one sits in meditation for hundreds or thousands of days,\nclosing the nostrils to sever the breath,\nso that the harmonious qi congeals and settles.\nThen the inner self is replete,\nno longer consuming the dust of the world,\nthereby realizing the Dao of carefree wandering.\n\nAs for rejecting grains, not eating is a marvelous achievement and wondrous path.\nAfter a thousand days of breath-holding,\nthe spirit-fire blazes within,\nscouring away the qi of grains,\neradicating all thoughts of food.\nReturning to the root and reverting to the origin,\nembracing the One and guarding stillness—\nthus it is said: *Returning, qi becomes limpid and clear.*\nWhenever the spirit-fire causes the five viscera to grow hot,\non the third nine-day period,\nenter the water,\nclarify the true elixir,\nwhich shines like a wheel of fire,\nemerging from the Earth-gate—\nthus it is said: *Opening the Earth-gate.*\nThe moon is a symbol of yin;\nspirit-fire is a thing of utmost yang.\nThe gate is a yin aperture,\nthrough which yang light emerges from the yin cavity of the Earth-gate—\nthus it is said: *From the moon one gathers fire.*\nThe sun is a yang thing;\nthe tongue is a yang aperture,\nthrough which spirit-water flows,\nemerging from the yang cavity of the tongue—\nthus it is said: *From the sun seeks ice.*\nThe fifth revolution changes the bones,\nthe sixth revolution changes the flesh,\nthe seventh revolution changes the five viscera—\nthe five viscera are the five sacred peaks,\nthus it is said: *The five viscera are renewed anew.*\n\n*Oral Instructions:*\nWhen the elixir reaches the seventh revolution,\none should leave the mundane world,\nenter deep mountains or secluded valleys to sit in meditation,\nseal the breath and spirit,\ncutting off the coming and going of breath through mouth and nose.\nLet true yin and true yang merge within the abdomen,\nseizing the creative power of heaven and earth,\nreturning it to the four limbs.\nAfter a thousand days,\nthe five viscera are entirely transformed,\nand the fetal qi becomes a celestial palace.\nOne may feel the aperture at the crown open,\nreleasing black and red qi—\nthis is the dispersal of fetal qi.\nWhen the thousand-day count is complete,\nthe crown aperture closes—\nthis signifies the fetal qi has fully emerged,\nand the seventh revolution is perfected.\nFrom this point onward,\nthe five viscera are solid and replete,\nno longer consuming smoke and fire.\nIf at times the elixir-fire of the viscera blazes,\nenter the water, seal the nostrils,\nand let the elixir-pearl and spirit-fire emerge from the Earth-gate,\nfloating on the water’s surface like a cow playing in yellow mud.\nWait until the spirit-water beneath the tongue flows like a spring,\nthen absorb the elixir-pearl and spirit-fire,\nreturning them to the Earth-gate.\nThis continues until the eighth revolution’s *Earth-sash* is accomplished,\nand with no fire-toxins remaining, one no longer needs to bathe.\n\n*Eighth Revolution*\nAt the eighth revolution, the *Earth-sash* hangs, returning to the origin,\ncirculating fetal breath to nurture the infant.\nWhen fire blazes, scorching the elixir-cave,\nplunge deep into icy springs to play with the red turtle.\n\n*Explanation:*\nThe infant in the mother’s womb,\nwithin the fetal sac, stabilizes its qi,\nunable to expel it—\nthis is the image of spirit-water in its utmost clarity,\nentering without loss.\nIf the infant’s umbilical cord\nis held in its mouth,\nthe breath comes and goes without cease—\nthis is natural fetal breathing,\nthus it suffers no harm.\nAfter the elixir reaches the eighth revolution,\nan umbilical cord-like *Earth-sash* grows from the navel,\nresembling the infant’s form,\nreturning to the original Dao of inception—\nthus it is said: *The Earth-sash hangs, returning to the origin.*\nThe infant obtains the umbilical cord to circulate fetal breath,\nthus suffering no harm;\nthe perfected one obtains the *Earth-sash* to circulate the qi of the celestial cycle,\nthus attaining longevity.\nThe red turtle is the elixir-pearl.\nAfter the eighth revolution,\none refines the true fire within,\neliminating the affliction of heat-toxins.\nWhenever fire blazes,\nclasp the *Earth-sash* in the mouth and hold the breath.\nFrom the ninth to the ninth day,\ntrue water surges from the elixir field like a gushing spring,\nrising to the twelve-storied tower of the *Double Pass*,\nwith the elixir-pearl within the spirit-water,\nlike a turtle playing in the water.\nFrom this point onward,\nthe true fire is free of toxins,\nand the affliction of elixir-heat no longer arises—\nthus it is said: *When fire blazes, scorching the elixir-cave, plunge deep into icy springs to play with the red turtle.*\n\n*Gazing at the River South*\nInner and outer transform,\nthe eighth revolution begins the return to the origin.\nThe *Earth-sash* hangs long, mastering the *Kan-gate*,\ncirculating fetal breath to pierce the *Heavenly Gate*.\nThe Dao of the Great Beginning now abides.\nA pure, unified body,\nblack and red qi ever-spouting—\nwhen elixir-fire blazes, scorching the inner landscape,\nat the surging of icy springs, bathe the monkey-grandson,\nspirit-water and red turtle swallow.\n\n*Explanation:*\nWhen the elixir reaches the eighth revolution,\nthe outer form and inner five viscera\nare entirely transformed.\nThe *Earth-sash* regenerates,\nresembling that of an infant—\nthus it is said: *Returning to the origin.*\nThe *Earth-sash* is the cord below the navel,\nborn from the navel,\nbelonging to the northern *Kan* trigram—\nthus it is said: *The Kan-gate and Heavenly Gate.*\nThe aperture of the *Flowery Pond* and the *Earth-sash* enter the mouth,\ncirculating the breath of the celestial cycle\nto regulate the fire-times—\nthus it is said: *Circulating celestial breath.*\nThe Dao of the Great Beginning\nis the origin of heaven and earth;\nwhen the elixir reaches the eighth revolution,\nit is like the inception of heaven and earth’s creation.\nThe inner elixir is pure yang,\nwithout a trace of yin qi—\nthus it is said: *A pure, unified body.*\nBlack and red are the qi of spirit-fire.\nWhen the elixir reaches the eighth revolution,\nit arises from the heart,\nconstantly entering and exiting through the nose,\never manifesting as black and red qi—\nthus it is said: *Qi ever-spouting.*\nThe affliction of elixir-fire\nis tempered by circulating spirit-water,\nleaving no sign of elixir-heat.\nThe elixir is the heart-pearl,\nthe monkey-grandson of the heart;\nthe red turtle is the fire-spirit.\nThe elixir floats within the water,\nlike a turtle swallowing water—\nthis describes its form.\n\n*Oral Instructions:*\n\nWhen the elixir completes its eighth revolution, the earth-belt arises within the navel, and if elixir-fire still causes heat, with the five viscera parched and dry, close the eyes and sit in repose. Connect the earth-belt beneath the Flowery Pond, allowing the breath to circulate internally, flowing and pervading through the revolving Dao. After closing the breath, the true water of the elixir field gradually increases day by day. By the ninth day, the spirit-water ascends to the Twelve-Storied Tower, and the elixir-pearl conceals itself within the spirit-water, expelling the fire-toxin. Thereafter, no further affliction of dryness arises. At midnight on the ninth night, close the breath and draw the spirit-water from the Mud-Pill Palace, passing through the Spine-Strap back to the elixir field to complete the work.\n\n**Ninth Revolution:**\nWhen the work of nine revolutions is done,\nthe Dao-fruit of carefree wandering is complete.\nWith three thousand merits of conduct,\none becomes an immortal.\nGolden writ and jade tablets proclaim the imperial decree,\nfeet treading auspicious clouds to pay homage in the Nine Heavens.\n\n**Explanation:**\nWhen the elixir completes its ninth revolution, the transformation is perfected, and the Dao-fruit is fully realized. Only after accumulating three thousand merits of external conduct and fulfilling the external fruit can one ascend. Thus, after refining his elixir, Master Xu of Jingyang eradicated the harm of flood dragons before ascending. After refining his elixir, Sun Simiao healed the ailments of ten thousand people before ascending. All must establish merit and achieve renown before ascending. On the day of ascension, celestial music arrives in welcome, with flutes and zithers harmonizing to pass through the Heavenly Gate. According to one’s merits and conduct, one is ranked among the immortals, joining the celestial ranks to endure as long as heaven and earth.\n\n**Internal Elixir Secrets: Nine Revolutions of the Golden Elixir**\n*Composed by Chen Puchong of the Mud-Pill Tradition*\n\n**First Revolution Song:**\nBeneath the tongue lie four apertures,\ntwo linking to the heart, two to the fluids.\nThe work of the first revolution resembles a precious pearl,\npermeating mountains, rivers, and the cosmos with a numinous body.\nBeneath the red lotus leaves lies the elixir-cavern,\ncrimson water flowing through the nine-marked pearl.\n\nThe work of the first revolution resembles a precious pearl.\nThe true water of Heavenly One is stored in the gallbladder,\nwhere yin and yang harmonize and descend as the elixir,\nappearing like a single dewdrop.\nThe work of the inner elixir begins with one and is completed in nine.\nOne is the origin of all things.\nHeavenly One generates water, earthly two generates fire,\nheavenly three generates wood, earthly four generates metal,\nheavenly five generates earth.\nThe sequence of the five phases begins with one,\nthus the work of the inner elixir also begins with one.\nIt is completed in nine revolutions, for nine is the utmost of yang numbers.\nWhen the number reaches nine, the Dao-fruit is achieved.\nThe \"precious pearl\" refers to the true water of Heavenly One stored in the gallbladder,\nwhere yin and yang harmonize and descend as the elixir.\nIts initial descent resembles a single luminous dewdrop.\nThe pearl is cherished as the elixir.\n\n**Permeating mountains, rivers, and the cosmos with a numinous body:**\nThe human body arises from the union of father’s essence and mother’s blood—this is the union of forms.\nThe elixir descends from the union of heart-fire and kidney-water—this is the union of qi.\nWhen the elixir descends, the spirit roams beyond the mundane,\nyin and yang achieve great harmony,\nand one forgets the body entirely.\nHeaven and earth, mountains and rivers,\nthe six directions and the myriad things\nall reside within this body,\nwhile this body exists beyond heaven and earth.\nOne only perceives within a single point of radiance like the sun—\nthis is the descent of the elixir.\nThe human body arises from the union of father’s essence and mother’s blood—this is the union of forms.\nThe descent of the elixir arises from the union of heart-fire and kidney-water—this is the union of qi.\nThus it is said: the union of forms gives birth to humans,\nwhile the union of qi forms the elixir.\nAfter the elixir descends, the spirit roams beyond the mundane,\nyin and yang achieve great harmony,\nand one sits in forgetfulness of the body.\nHeaven and earth, mountains and rivers,\nthe six directions and the myriad things\nall reside within this body,\nwhile this body exists beyond heaven and earth.\nOne only perceives a single point of radiance within the heart—\nthis is the descent of the elixir.\nThus it is said: *permeating mountains, rivers, and the cosmos with a numinous body.*\nThe body encompasses mountains and rivers within itself.\n\n**Beneath the red lotus leaves lies the elixir-cavern:**\nBeneath the tongue lie two apertures,\nthe left connecting to the heart, the right to the gallbladder.\nTrue qi flows to communicate with the spirit.\nThus, when the human body is unwell, the fluids beneath the tongue dry up,\nfor the true qi is depleted.\nAt the outset of the first revolution,\nthe tongue seals these two apertures,\npreventing the true qi from leaking outward\nand enabling the spirit-water to flow.\nThe \"red lotus\" refers to the tongue.\nFrom the two apertures, one connects to the heart, the other to the fluids.\nWhen one is ill, the fluids beneath the tongue dry up, and the true qi is depleted.\nAt the outset of the first revolution, the tongue seals these two apertures,\npreventing the true qi from leaking outward\nand enabling the spirit-water to flow.\n\n**Crimson water flowing through the nine-marked pearl:**\nThe crimson water is the fluid.\nAt the beginning of the nine revolutions,\nevery nine days, perform nine subtle breaths.\nWith each breath, take nine sips,\nnaturally allowing the fluids to flow,\narising from the tongue to irrigate the five viscera—\nthese are the nine marks.\nThe \"crimson water\" is the fluid of the heart.\nAt the beginning of the nine revolutions,\nevery nine days, take nine breaths,\nwith each breath taking nine sips.\nNaturally, the fluids flow from beneath the tongue\nto irrigate the five viscera—\nthus it is called the nine-marked pearl.\n\n**Song of Gazing at the River South:**\nSeal the apertures beneath the tongue to connect with the gallbladder’s qi.\nThe treasure of the Yellow Center must be sought within the gallbladder.\nThe spring wind brings forth the myriad things,\nwhile beneath heaven and earth, it is my companion.\nThe hundred meridians flow naturally.\nIt enacts transformation,\ndrawing the paired fires from left and right.\nVast and billowing, it illuminates the cosmos,\nascending in wispy smoke to encircle the tower,\nas the couple gradually conspire.\n\n**The treasure of the Yellow Center must be sought within the gallbladder:**\nThe qi of Heavenly One is called the Yellow Center.\nThis qi is stored in the gallbladder,\nserving as the root of life and destiny.\nIts flavor is bitter,\njust as the roots and stems of plants and trees are also bitter—\nthus it is known that nothing can grow without the generative qi.\nFor the medicine of the inner elixir,\nfirst seal the two apertures beneath the tongue,\ninternally connecting to the generative qi of the gallbladder.\nWhen a faint bitterness arises between the throat and tongue,\nthe generative qi is flowing.\n\nThen seek the spirit to become the elixir.\nThe qi of Heavenly One is called the Yellow Center.\nThis qi is stored in the gallbladder,\nserving as the root of life and destiny.\nIts flavor is bitter—\nthus the qi and flavor of the human gallbladder are also bitter.\nJust as the roots and blossoms of plants and trees are bitter,\nit is known that nothing can grow without the generative qi.\n\nFor the medicine of the inner elixir,\nfirst seal the two apertures beneath the tongue,\ninternally connecting to the generative qi of the gallbladder.\nWhen a faint bitterness arises between the throat and tongue,\nthe elixir qi is flowing.\nThen the mercury-water congeals to form the elixir.\n\nThe decree of the Spring Lord brings forth the myriad things—\nall things receive the spring qi before they can grow.\nWhen one connects to the qi of the gallbladder,\nthe inner elixir is accomplished.\nThe generative qi of Heaven and Earth sprouts in spring;\nall things receive this generative qi before they can grow.\nHumans, too, receive this generative qi,\nstoring it in the gallbladder.\nWhen one connects to the qi of the gallbladder,\nthe inner elixir achieves the first turning of its work,\nlike the spring of the four seasons.\n\nHeaven and Earth lie beneath my knees,\nas the hundred vessels flow freely.\nThe generative qi ascends,\nand bitterness is sensed in the mouth.\nYin and Yang achieve great harmony,\nand the spirit dwells beyond the heavens—\nthen the four seas and all under heaven lie beneath my knees.\nThe vast qi fills Heaven and Earth,\nthe hundred vessels flow freely,\nand the myriad apertures open wide,\nas the inner elixir descends.\nThe generative qi ascends within,\nand bitterness is sensed—\nYin and Yang achieve great harmony,\nand the spirit dwells beyond the heavens—\nthen the four seas and all under heaven lie beneath my knees.\nThe vast qi fills Heaven and Earth,\nthe hundred vessels flow freely,\nand the myriad apertures open wide,\nas the inner elixir descends.\n\nAt the outset of practice,\nfirst seal the two apertures beneath the tongue,\npreventing the qi from leaking outward.\nThe qi of the left and right apertures rises from within:\nthe left passes through the left Greater Yang to enter the brain,\nwhile the right, together with the left, traverses the brain to reach the crown.\nIn the Mud Pill Palace, they merge as one,\nthen descend the Twelve-Storied Tower,\nentering the Heart Channel and passing into the gallbladder,\nwhere they surge open the gallbladder’s aperture,\ncausing the generative qi within to ascend.\nFollowing the vessels of the heart and gallbladder,\nit pierces the tongue’s aperture,\nand the tongue senses a bitter flavor—\nthis is the generative qi flowing,\nabout to descend the elixir.\n\nAt the outset of practice,\nfirst seal the two apertures beneath the tongue,\npreventing the qi from leaking outward.\nThe qi on the left pierces the left Greater Yang to enter the brain,\nwhile the qi on the right pierces the right Greater Yin to enter the brain.\nLeft and right together traverse the brain,\nentering the crown’s Mud Pill Palace to merge as one,\nthen descend the Twelve-Storied Tower,\npassing through the Heart Channel into the gallbladder,\nwhere they surge open the gallbladder’s aperture.\nThe generative qi within the gallbladder ascends,\nfollowing the vessels of the heart and gallbladder\nto pierce the tongue’s aperture.\nWhen the tongue senses a bitter flavor,\nthis is the generative qi flowing,\nabout to descend the elixir.\n\nVast and billowing, it fills the cosmos;\nwispy smoke ascends to encircle the tower.\nOnce the gallbladder’s aperture opens,\nthe generative qi rises in wisps,\nascending the Twelve-Storied Tower\nto enter the aperture beneath the tongue.\nThe mouth senses bitterness—\nthis is the sign of the generative qi flowing.\nThen, sealing the tongue’s apertures,\nthe qi on left and right ascends,\ncreating a billowing effect.\nOnce the gallbladder’s aperture closes,\nthe generative qi rises in wisps,\nascending the Twelve-Storied Tower\nthrough the aperture beneath the tongue.\nThe mouth senses bitterness—\nthis is the generative qi flowing.\n\nThe couple gradually conspire.\nWhen the generative qi flows freely,\nYin and Yang achieve great harmony,\nand the heart and kidneys unite in congress—\nthus it is said they gradually conspire.\nThe couple represents Yin and Yang:\nthe husband is Yang, the wife is Yin.\nWhen the generative qi flows freely,\nYin and Yang achieve great harmony,\nand the heart and kidneys unite in congress—\nthus it is said they gradually conspire.\n\n**Oral Instructions:**\nAt the outset of practice,\nfirst regulate diet to harmonize the five viscera,\navoiding hunger or overfullness.\nThe field of the heart must be tranquil,\nfree from worry or distraction—\nonly then can one enter the Dao.\n\nAt the outset of practice,\nfirst regulate diet to harmonize the five viscera,\nneither hungry nor overfull.\nThe field of the heart must be tranquil,\nfree from worry or distraction—\nonly then can one enter the Dao.\n\nWhen the second watch ends and the third begins,\nfirst wash and rinse,\nthen enter a quiet chamber to burn incense.\nSit cross-legged, close the eyes, and concentrate the spirit.\nWhen the breath is even,\ncurl the tongue back to seal the two apertures at its root,\ngradually holding the breath.\nSense the two channels of qi in the Greater Yang meridians,\nrising from the roots of the molars\nto pierce the Greater Yang and enter the crown,\nreaching the Mud Pill Palace—\nthis counts as one cycle.\n\nWhen the breath is even,\nfirst curl the tongue back to seal the two apertures at its root,\ngradually holding the breath.\nSense the two channels of qi in the Greater Yang meridians,\nrising from the roots of the molars\nto surge upward, piercing the two Greater Yangs,\nthen entering the crown.\nWhen the two qi merge,\nthis counts as one cycle.\n\nThen open the eyes for a while,\nclose them again to concentrate the spirit,\nand curl the tongue as before,\nwaiting for the qi to reach the Mud Pill Palace before stopping.\nDo this three times each night.\nThen close the eyes for a while,\nagain curling the tongue as before,\nwaiting for the qi to reach the Mud Pill Palace before stopping.\nDo this three times each night.\n\nAfter several nights, or ten days, or half a month,\ngradually sense the qi reaching the Mud Pill Palace,\nthen flowing into the brain,\ndescending the Twelve-Storied Tower,\npassing through the spine to thread the tailbone and rise upward.\nThe true qi enters the heart and pierces the gallbladder,\nwarming the stomach with a gentle heat,\nbringing a subtle sense of harmony and ease—\nthis is the true qi descending.\n\nAfter several nights or days,\ngradually sense the qi reaching the Mud Pill Palace,\nthen flowing into the brain,\ndescending the Twelve-Storied Tower,\npiercing the spine to thread the tailbone and rise forward.\nIt enters the heart and pierces the gallbladder,\nwarming the navel and stomach with a gentle heat,\nbringing a subtle sense of harmony and ease—\nthis is the true descent.\n\nAfter several more nights of practice,\ngradually sense the qi reaching the heart,\nthen a gentle warmth,\nor a faint stirring of qi at the heart’s center.\nA warm qi then rises behind the heart,\npassing the Twelve-Storied Tower\nto enter beneath the tongue.\n\nGradually, a faint bitterness arises in the mouth—this is the Central Yellow qi emerging from the gallbladder. Yin and yang achieve great harmony, and the descent of the elixir is imminent.\n\nAfter several nights, the qi once more reaches the heart, followed by a gentle warmth, or a faint stirring of qi at the heart’s center. A warm qi then rises from the heart, passing the Twelve-Storied Tower, and the mouth senses a slight bitterness. This is the Central Yellow qi emerging from the gallbladder, yin and yang in perfect harmony, and the descent of the elixir is imminent.\n\nBefore each night’s practice, have someone stand guard outside the door to prevent anyone from entering, as well as cats, dogs, or other creatures, lest they startle you unexpectedly. When practicing three times each night, place a low table before you as you sit. During the circulation of qi, you may suddenly feel your body expanding, your spirit soaring, until gradually your dwelling, the cities, the entire world—all seem to lie within you. Above, you feel as vast as the heavens; below, as boundless as the earth. Your hands and feet seem to vanish—then quickly press your hands upon the table, close your eyes, and you will sense a small, radiant orb of light at your heart, round as the sun. Suddenly, it descends—this is the elixir descending.\n\nBefore each night’s practice, station someone outside the door to bar entry to people, cats, dogs, or other creatures, lest they startle you unexpectedly. When practicing two or three times each night, place a low table before you as you sit. Suddenly, the qi surges, and you feel your body expanding, your spirit soaring, until gradually your home, all people, mountains, and rivers seem to lie within you. Your hands and feet seem to vanish—then quickly press your hands upon the table, close your eyes, and you will sense a small, radiant orb of light at your heart, round as the sun. Suddenly, it descends into the Cinnabar Field—this is the descent of the elixir.\n\nAfter the elixir descends, do not open your eyes at once. Gradually gather your spirit, returning it to your limbs. Your hands and feet will feel as they did before, though they may tingle slightly. Remain composed for some time, then open your eyes and drink ginseng broth before sleeping until the next day. Eat congee and rest for a day or two—this completes the descent of the elixir.\n\nOnce the elixir has descended, all illnesses vanish, and no suffering or affliction remains.\n\nAfter the elixir descends, do not open your eyes immediately. Slowly gather your spirit and settle it, allowing your limbs to return to their former state. Your hands and feet may feel numb—wait until you are fully composed, then open your eyes. Drink ginseng broth and sleep. The next morning, eat congee and rest for a day or two—this is the descent of the elixir. Once the elixir has descended, all illnesses vanish, and no suffering or affliction remains.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "泥丸先生陈朴传九转金丹秘诀： 一转降丹，二转交媾，三转养阳，四转养阴，五转换骨， 六转换肉，七转换五脏六腑，八转育火，九转飞升。 第一转　舌下四窍，两窍通心两窍通液。 一转之功似宝珠，山河宇宙透灵躯。 红莲叶下藏丹穴，赤水流通九候珠。 解曰：内丹之功，起于一、而成于九。 一者，万物之所生也。 天一生水，地二生火，天三生木，地四生金，天五生土，五行之序起于一。 故内丹之功亦起于一，转而成于九者，九为阳数之极。 数至于九、则道果成矣。 似宝珠者，言天一真水藏于胆，阴阳和合，降而成丹。 初降之状如露一颗明珠。 珠者、珍敬其丹也。 且人之有身，父精母血交媾而成，此形交也。 丹之所降，心火肾水交媾而成，此气交也。 故曰：形交则生人，气交则成丹。 言其丹降之后，神游方外，阴阳太和； 坐忘其形，天地山河； 六合万物，皆在我身之内。 我身在天地万物之外，只觉心中一点光明。 乃是丹降也。 故曰：山河宇宙透灵躯，躯者、身也。 山河包藏我身之内也。 所谓红莲者，舌是也。 自两窍通心，两窍通液。 人有病者，则舌下津液干而其真气耗。 一转之首以舌闭其两窍，使真气不泄于外，以通其神水也。 所谓赤水者，心之液是也。 九转之首，每遇九日纳息九次。 每一次纳息九口。 自然津液通流自舌下，而生以灌五脏，故曰九候珠也。 望江南　闭舌下巧，通胆气 黄中宝，须向胆中求。 春风令人生万物，乾坤膝下与吾俦，百脉自通流。 施造化，左右火双抽。 浩浩腾腾光宇宙，苦烟烟上霭环楼，夫妇渐相谋。 解曰：天一生气，名曰中黄。 其气藏之于胆，以为性命之根，其味苦。 故人之胆气味亦苦。 如草木之根华其味亦苦，乃知万物非生气不能生也。 内丹之药先闭舌下之窍，内通胆中生气至喉舌之间，微觉味苦，是丹气流通。 然后汞水凝结而成丹也。 天地生气萌之于春，万物得生气，然后能生人之得生气，藏之于胆。 人能通胆之气，然后内丹成就一转之功，如四时之春也。 生气上行其中觉苦，阴阳太和，神居天外则天地四海亦在吾膝下。 浩然之气塞乎天地，百脉通流万窍施张。 内丹降也。 造化言者，其下手之初也。 先闭舌下两窍，不令气泄于外。 其左边之气贯于左太阳而入脑，右边之气贯于右太阴而入脑，左右俱过脑。 而入顶泥丸宫合成一处，下重楼十二环，入心经、传入丹冲开胆窍。 使胆中生气，上行随心胆之脉，贯于舌窍、觉舌有苦味，乃是生气注将欲降丹也。 然后闭定舌窍左右之气上行，故有腾腾之状也。 胆窍即闭，则生气袅袅，上重楼十二环，自舌下之窍而升，满口觉苦乃是生气流通也。 夫妇者阴阳也，夫者阳也，妇者阴也，生气流通则阴阳太和，心肾交媾故曰渐相谋也。 口诀： 行持下手之初，先须饮食以和五脏，不可饥不可饱，心田安静无忧无虑，乃可入道。 凡于二更尽、三更初当洗漱，定神入室，烧香盘膝而坐，闭目存神，候息出入调匀，以舌先倒卷定舌根两窍闭息。 渐觉左右太阳经有两道气大牙根冲上，贯二太阳，次入顶门，觉二气交合结为一次。 却闭眼良久，亦闭目依前卷舌，候至泥丸宫止，如此每夜行三次即止。 行至数夜或数日之间，渐觉泥丸宫次流入脑，下重楼十二环，透夹脊串尾闾，复次前冲心贯胆，脐胸中温温，微觉意思和畅，乃真降也。",
      "translated_text": "The Master of the Muddy Pellet, Chen Pu, transmits the *Nine Cycles of the Golden Elixir Secret Formula*:\n\nFirst Cycle: Descending Elixir\nSecond Cycle: Union\nThird Cycle: Nurturing Yang\nFourth Cycle: Nurturing Yin\nFifth Cycle: Bone Transformation\nSixth Cycle: Flesh Transformation\nSeventh Cycle: Transformation of the Five Viscera and Six Bowels\nEighth Cycle: Cultivating Fire\nNinth Cycle: Ascension\n\n**First Cycle**\nBeneath the tongue lie four apertures—two connect to the heart, two to the fluids.\nThe work of the first cycle resembles a precious pearl,\nPervading the mountains, rivers, and cosmos with a numinous body.\nBeneath the red lotus leaf lies the elixir cave;\nCrimson water flows, nourishing the nine-pulse pearl.\n\n*Explanation:*\nThe work of the inner elixir begins with the one and is completed in the nine.\nThe one is that from which the myriad things are born.\nHeaven-one generates water, Earth-two generates fire,\nHeaven-three generates wood, Earth-four generates metal,\nHeaven-five generates earth—the sequence of the Five Phases begins with the one.\nThus, the work of the inner elixir also begins with the one,\nAnd through transformation is completed in the nine, for nine is the utmost of yang numbers.\nWhen the number reaches nine, the Dao-fruit is achieved.\nThe \"precious pearl\" refers to the true water of Heaven-one stored in the gallbladder,\nWhere yin and yang harmonize and descend to form the elixir.\nThe initial descent resembles a single dewdrop of luminous pearl.\nThe pearl signifies reverence for the elixir.\nMoreover, the human body is formed through the union of father’s essence and mother’s blood—this is the union of form.\nThe descent of the elixir is achieved through the union of heart-fire and kidney-water—this is the union of qi.\nThus it is said: union of form gives birth to humans; union of qi completes the elixir.\nAfter the elixir descends, the spirit roams beyond the mundane,\nYin and yang attain great harmony;\nOne forgets the body in stillness, and the mountains, rivers, heaven, and earth—\nThe six directions and the myriad things—all reside within this body.\nThis body exists beyond heaven, earth, and the myriad things,\nPerceiving only a single point of radiance within the heart—\nThis is the descent of the elixir.\nThus it is said: the mountains, rivers, and cosmos permeate the numinous body.\nThe \"body\" here refers to the self.\nThe mountains and rivers are contained within this body.\n\nThe \"red lotus\" refers to the tongue.\nThe two apertures connect to the heart, the other two to the fluids.\nWhen a person is ill, the tongue’s fluids dry and true qi dissipates.\nAt the outset of the first cycle, the tongue seals these two apertures,\nPreventing the leakage of true qi and facilitating the flow of divine water.\nThe \"crimson water\" refers to the heart’s fluids.\nAt the beginning of each of the nine cycles, on the ninth day, one inhales nine times,\nEach inhalation consisting of nine breaths.\nNaturally, the fluids flow from beneath the tongue,\nNourishing the five viscera—hence the \"nine-pulse pearl.\"\n\n*To the tune of \"Gazing at the Southern River\"*\nSeal the tongue’s artful skill, connect the gallbladder’s qi.\nThe yellow treasure must be sought within the gallbladder.\nThe spring wind quickens the myriad things,\nHeaven and earth lie beneath my knees, my peers in the Dao,\nAs the hundred vessels flow freely.\nEnacting creation, the left and right fires are drawn forth.\nVast and boundless, they illuminate the cosmos;\nThe bitter smoke ascends, veiling the encircling towers,\nAs husband and wife gradually conspire.\n\n*Explanation:*\nHeaven-one generates qi, called the Central Yellow.\nThis qi is stored in the gallbladder as the root of life and destiny, its flavor bitter.\nThus, the gallbladder’s qi and flavor are also bitter.\nLike the roots of plants and trees, which bear bitter blossoms,\nWe know that without generative qi, the myriad things cannot come to life.\nThe medicine of the inner elixir first seals the apertures beneath the tongue,\nInternally connecting the gallbladder’s generative qi to the throat and tongue,\nWhere a faint bitter taste is perceived—this is the flow of elixir qi.\nThereafter, mercury and water congeal to form the elixir.\nThe generative qi of heaven and earth sprouts in spring;\nThe myriad things receive this generative qi before they can live.\nHumans, too, receive generative qi, stored in the gallbladder.\nBy connecting the gallbladder’s qi, the inner elixir completes the first cycle’s work,\nLike the spring of the four seasons.\nAs the generative qi ascends, a bitter sensation arises,\nYin and yang attain great harmony, and the spirit dwells beyond heaven—\nThen the four seas and the cosmos lie beneath one’s knees.\nA vast qi fills heaven and earth, the hundred vessels flow freely, and the myriad apertures open.\nThis is the descent of the inner elixir.\n\"Enacting creation\" refers to the initial steps.\nFirst, seal the two apertures beneath the tongue to prevent qi from leaking outward.\nThe qi on the left passes through the left Greater Yang into the brain,\nWhile the qi on the right passes through the right Greater Yin into the brain,\nBoth converging in the brain before entering the Muddy Pellet Palace atop the head,\nDescending through the twelve-storied tower of the throat,\nEntering the heart meridian, and transmitting to the elixir center to open the gallbladder’s aperture.\nThis allows the gallbladder’s generative qi to ascend along the heart and gallbladder meridians,\nPassing through the tongue’s apertures, where a bitter taste is perceived—\nThis is the generative qi preparing to descend the elixir.\nThen, sealing the tongue’s apertures, the qi on both sides ascends,\nCreating a surging sensation.\nWhen the gallbladder’s aperture is sealed, the generative qi rises gently,\nAscending the twelve-storied tower of the throat from the tongue’s apertures,\nFilling the mouth with a bitter taste—this is the flow of generative qi.\n\"Husband and wife\" refer to yin and yang:\nThe husband is yang, the wife is yin.\nWhen generative qi flows freely, yin and yang attain great harmony,\nAnd heart and kidney unite—hence \"gradually conspire.\"\n\n*Oral Instructions:*\nAt the outset of practice, first harmonize the five viscera with diet—\nNeither hunger nor satiety, the heart-field calm and free of worries—\nOnly then can one enter the Dao.\nAt the end of the second watch and the beginning of the third,\nWash and rinse, settle the spirit, and enter the chamber.\nBurn incense, sit cross-legged, close the eyes, and concentrate the spirit.\nWait until the breath is even, then curl the tongue backward to seal its root and the two apertures, holding the breath.\nGradually, two streams of qi from the left and right Greater Yang meridians rise from the jaw’s root,\nPassing through the two Greater Yang points before entering the crown of the head,\nWhere the two qi converge and coalesce.\nClose the eyes for a long while, then curl the tongue as before,\nWaiting until the qi reaches the Muddy Pellet Palace before stopping.\nPractice this three times each night.\nAfter several nights or days, the qi will gradually flow from the Muddy Pellet Palace into the brain,\nDescending the twelve-storied tower of the throat,\nPiercing the spine and threading the tailbone,\nThen rising to the heart and penetrating the gallbladder,\nWarming the navel and chest with a gentle, harmonious sensation—\nThis is the true descent.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1285,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.29489040374756,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如此后则数夜渐觉气到心，次微觉温温或心头气渐动，却有温气从心而上，过重楼口觉微苦。 是中黄气自胆而出阴阳大和，将有降丹之象。 如此之后，每夜行持之初，令一人在门外，拦人进入及猫狗等，恐忽然相惊。 至每夜行三两次时，于坐前横一几，忽然气冲，觉身体渐大，精神腾腾，渐见屋舍、人物、山河、皆在我身之内。 手足皆不知所在，次急以手按几，闭目大觉，心头微一块光明，团圆如日，忽然坠下丹田，此乃降丹也，丹降之后，未得便开眼，且渐渐收拾精神归定。 四体复旧，或手足觉麻痹，次候定醒，然后开眼，次吃人参汤睡。 至来早吃粥食将养一二日，如丹降也。 丹降之后百病消除，更无疾苦之厄也。 第二转 二转阳成始结阴，肾光心液合丁壬。 神珠奔电归东海，时迸灵光照紫金。 解曰：二转之初，如人怀胎两月，胎之初降乃是真阳之精。 神为丹心，属火，为阴以配南方丁火，丁者火之阴也。 肾属水为阳，以配北方壬水，壬者水之阳也。 吕曰：火取南方丹凤髓，水求北海黑龟精。 故于二转则养阳，使心火之光感于下。 三转则养阴，使肾水之液交于上，真水真火上下以配，丁壬抱养真丹以成造化。 凡丹之初降养于心，育之以真火生其丹也。 一转成功，则丹从心络流下，藏于丹田育以真水，此二转之功也。 丹藏丹田之后，静坐虚室中，忽然时有光明，从胎照见如金团，乃月光而也。 望江南 玄珠降，丹窟在中宫。",
      "translated_text": "After this, over several nights, you will gradually feel the qi reach the heart, then sense a gentle warmth or the heart’s qi beginning to stir. A warm qi will rise from the heart, passing through the twelve-storied tower of the throat, where a slight bitterness may be perceived. This is the Central Yellow qi emerging from the gallbladder, signifying the great harmony of yin and yang and the imminent descent of the elixir.\n\nFollowing this, at the start of each night’s practice, have someone stand guard outside the door to prevent anyone from entering, or cats and dogs from startling you. After practicing two or three times each night, place a small table before you as you sit. Suddenly, the qi will surge, and you will feel your body gradually expand, your spirit soaring. Gradually, the house, people, mountains, and rivers will all appear within your body. Your hands and feet will seem to vanish. Quickly press your hands upon the table, close your eyes, and in a profound state of awareness, you will perceive a luminous orb at your heart, round as the sun. Suddenly, it will descend into the elixir field—this is the descent of the elixir.\n\nAfter the elixir descends, do not open your eyes immediately. Gradually gather your spirit and settle it. Your limbs will return to their usual state, though they may feel numb or tingling. Wait until you are fully composed before opening your eyes, then drink ginseng broth and sleep. The next morning, take congee to nourish yourself for one or two days. This is the descent of the elixir. Once the elixir has descended, all illnesses will vanish, and no suffering or affliction will remain.\n\n**Second Cycle**\nThe second cycle begins as yang completes and yin coalesces,\nThe radiance of the kidneys and the fluid of the heart unite in ding and ren.\nThe divine pearl, swift as lightning, returns to the Eastern Sea,\nIts sacred light bursting forth to illuminate purple gold.\n\nExplanation:\nAt the start of the second cycle, it is like a woman two months with child—the initial descent of the embryo is the essence of true yang. The spirit is the elixir heart, belonging to fire and categorized as yin, pairing with the southern ding fire. Ding is the yin of fire. The kidneys belong to water and are categorized as yang, pairing with the northern ren water. Ren is the yang of water.\n\nLü says:\nFire is drawn from the marrow of the cinnabar phoenix of the south,\nWater is sought from the essence of the black turtle of the north.\nThus, in the second cycle, yang is nurtured, allowing the radiance of the heart’s fire to stir below. In the third cycle, yin is nurtured, allowing the fluid of the kidney’s water to unite above. True water and true fire ascend and descend in harmony, with ding and ren embracing and nurturing the true elixir to complete the transformation.\n\nWhen the elixir first descends, it is nurtured in the heart, cultivated by true fire to quicken its growth. Once the first cycle is complete, the elixir flows down from the heart’s network and is stored in the elixir field, nurtured by true water—this is the work of the second cycle. After the elixir is stored in the elixir field, sit quietly in an empty room. Suddenly, a radiance will appear, illuminating the womb like a golden orb—this is the light of the moon.\n\n*To the tune of \"Gazing at the Jiangnan\"*\nThe mysterious pearl descends,\nThe elixir chamber lies within the Central Palace.",
      "overlap_context": "long while, then curl the tongue as before,\nWaiting until the qi reaches the Muddy Pellet Palace before stopping.\nPractice this three times each night.\nAfter several nights or days, the qi will gradually flow from the Muddy Pellet Palace into the brain,\nDescending the twelve-storied tower of the throat,\nPiercing the spine and threading the tailbone,\nThen rising to the heart and penetrating the gallbladder,\nWarming the navel and chest with a gentle, harmonious sensation—\nThis is the true descent.",
      "start_char": 1285,
      "end_char": 1849,
      "start_sentence": 62,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.211141109466553,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "九侯息调重九数，赤波或迸太阳东，心肾遂交通。 逢六变，重六息阴功。 火自海门朝帝坐，水从莲萼佐丁公，紫电透玲珑。 解曰：玄珠真丹也。 一转之初，丹降于心络中，故云丹窟在中宫，丹降为一转。 丹降之后，凡遇九日，则闭息九侯为一次，至九九八十一为九次。 故曰重九数，九九功成，真阳丹足，自心络流入丹田，丹藏于水府养其阴。 太阳东者海水之府象，丹田肾水也。 丹之神藏于心，以养真火。 丹之转归于肾，次养真水，水火既济，阴阳大和，故曰心肾交通。 二转之功成，其三转之初也。 逢六则闭息，六数为一次，六六三十六为一周。 以养其阴，故曰重六息。 阴功海门，是丹田肾府也。 真丹藏于丹田，丹阳之数以足，每到日中，则神自丹田，热气达之于上，而朝于心。 帝坐心也。 莲萼舌也，六六内阴数足，则下莲池神水浇心络，以养丹气，故曰佐丁公。 丁者，心之火也。 此真水真火，以成既济之功。 阴阳既济，真丹气足时。 有神光出于面目，夜半安坐内视脏腑，表里分明，直见玄珠，养于丹田。 故曰透玲珑。 口诀: 丹降之后，一转了毕，凡遇初九、十九、二十九日，亭午时静坐虚室中。 盘足、瞑目、端坐、叩齿九通。 神交气通，然后闭息，每一闭入九息为一次。 开眼良久再闭息，如前九息为一次。 初闭时一次二次行之渐热，闭五次又极热，用之九次，一向行之直候内之火候，用足与天地相应，不以远近，或前入息至九，心中温热，四神和畅，心神摇动，一道热气下丹田，为二转功成。 自此以后不行九息之数。 第三转",
      "translated_text": "Nine breaths harmonize the ninefold count,\nCrimson waves surge forth in the east of the Great Yang—\nHeart and kidney then commune as one.\nAt sixfold change, six breaths nurture yin’s work.\n\nFire from the Sea Gate ascends to the Emperor’s Seat,\nWater from the lotus calyx aids Ding Gong—\nViolet lightning pierces the translucent.\n\n*Explanation:*\nThe mysterious pearl is the true elixir. At the first turning’s outset, the elixir descends into the heart’s network, thus it is said the elixir chamber lies within the Central Palace—this descent marks the first turning. After the elixir descends, whenever the ninth day arrives, hold the breath for nine breaths as one cycle, reaching nine nines—eighty-one—to complete nine cycles. Hence it is called the ninefold count. When the nine nines’ work is accomplished, true yang’s elixir is full, flowing from the heart’s network into the elixir field, where the elixir is stored in the Water Palace to nurture its yin. The east of the Great Yang symbolizes the Water Palace of the elixir field, the kidney’s water. The elixir’s spirit is stored in the heart to nurture true fire; when the elixir turns and returns to the kidney, it next nurtures true water. With water and fire in harmony, yin and yang unite in great balance—thus it is said heart and kidney commune. When the second turning’s work is complete, it marks the beginning of the third turning. At sixfold encounters, hold the breath, six breaths as one cycle, six sixes—thirty-six—as one round to nurture yin—hence it is called the sixfold breath. The yin work’s Sea Gate is the kidney’s palace of the elixir field. When the true elixir is stored in the elixir field, the count of the elixir’s yang is fulfilled. Each time noon arrives, the spirit from the elixir field, borne by hot qi, ascends to the heart—this is the Emperor’s Seat. The lotus calyx is the tongue; when the inner yin’s count of six sixes is fulfilled, the divine water of the lower Lotus Pool irrigates the heart’s network to nurture the elixir’s qi—thus it is said to aid Ding Gong. Ding is the heart’s fire. Here, true water and true fire accomplish the work of harmony. When yin and yang are in harmony and the true elixir’s qi is full, a divine radiance appears upon the face and eyes. At midnight, sitting in stillness and inwardly observing the viscera, inside and out are clearly seen, the mysterious pearl directly perceived, nurtured within the elixir field—thus it is said to pierce the translucent.\n\n*Oral Instructions:*\nAfter the elixir descends and the first turning is complete, whenever the ninth, nineteenth, or twenty-ninth day arrives, at noon sit quietly in an empty room. Cross the legs, close the eyes, sit upright, and click the teeth nine times. Spirit and qi commune, then hold the breath—each holding counts nine breaths as one cycle. Open the eyes for a long while, then hold the breath again, as before, nine breaths as one cycle. At the first holding, one or two cycles may bring warmth; by the fifth cycle, extreme heat arises. Proceeding to nine cycles, continue until the inner fire’s timing is fulfilled, resonating with heaven and earth, regardless of distance. If, upon entering the ninth breath, warmth stirs in the heart, the four spirits harmonize and flourish, the heart’s spirit stirs, and a stream of hot qi descends to the elixir field—this marks the completion of the second turning. Thereafter, the count of nine breaths is no longer practiced. The third turning...",
      "overlap_context": "ken its growth. Once the first cycle is complete, the elixir flows down from the heart’s network and is stored in the elixir field, nurtured by true water—this is the work of the second cycle. After the elixir is stored in the elixir field, sit quietly in an empty room. Suddenly, a radiance will appear, illuminating the womb like a golden orb—this is the light of the moon.\n\n*To the tune of \"Gazing at the Jiangnan\"*\nThe mysterious pearl descends,\nThe elixir chamber lies within the Central Palace.",
      "start_char": 1849,
      "end_char": 2458,
      "start_sentence": 84,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.32723355293274,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "三转行阳入左宫，玄珠胎色渐鲜红。 神明育火分形象，天籁时催造化功。 解曰：丹成三转，逢天行阴，以养真阴之气，内阴数足，丹入丹田，流于左肋，四体汗流，以制尸气。 三转功成，自此更无三尸魂也。 灵珠、内丹也。 此后阳气充足，凡便及涕唾皆粉红色以应纯阳之质。 及其丹光照见一颗明珠、如火轮之状，在左肋之下，三转数足。 每遇月尽以左手摩顶，入息激动丹火至五脏热为上，谓之育火以运其丹。 此 后丹田中渐觉有物，遇入息则丹动，故云分象也。 天地和则撼激有声，是名天籁。 人之九窍不通不闻其声，三转之后九窍听明天籁之声，昼夜常闻也。 望江南 毛发薄，三转运行阳。",
      "translated_text": "The third turning conducts yang into the left palace, where the Mystic Pearl’s fetal hue gradually brightens to crimson. The numinous fire nurtures and divides its forms, while the celestial pipes hasten the work of creation.\n\nExplanation: Upon the completion of the third turning of the elixir, when heaven’s course enters yin, one cultivates the qi of true yin. Once the inner yin’s count is fulfilled, the elixir enters the cinnabar field and flows to the left flank, causing the four limbs to stream with sweat to subdue the corpse-qi. With the third turning accomplished, the three corpse-spirits are no more. The Numinous Pearl is the inner elixir. Thereafter, yang qi abounds, and even urine, mucus, and saliva all assume a pink hue, corresponding to the quality of pure yang. When the elixir’s radiance reveals a luminous pearl—like a wheel of fire—beneath the left flank, the count of the third turning is complete. At each month’s end, stroke the crown with the left hand, draw in breath to stir the elixir-fire until the five viscera grow warm—this is called nurturing the fire to circulate the elixir. From this point, one gradually senses a presence in the cinnabar field; with each inhalation, the elixir stirs, hence the phrase “dividing its forms.” When heaven and earth harmonize, their resonance produces sound—this is the celestial pipes. Before the third turning, the nine orifices are closed and their sounds unheard; after the third turning, the nine orifices become keenly attuned to the celestial pipes’ music, heard day and night without cease.\n\n*To the Tune of \"Wàng Jiāngnán\"*\nThe hair grows fine,\nas the third turning moves yang.",
      "overlap_context": "warmth; by the fifth cycle, extreme heat arises. Proceeding to nine cycles, continue until the inner fire’s timing is fulfilled, resonating with heaven and earth, regardless of distance. If, upon entering the ninth breath, warmth stirs in the heart, the four spirits harmonize and flourish, the heart’s spirit stirs, and a stream of hot qi descends to the elixir field—this marks the completion of the second turning. Thereafter, the count of nine breaths is no longer practiced. The third turning...",
      "start_char": 2458,
      "end_char": 2736,
      "start_sentence": 114,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.068201780319214,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "胎色渐红阴渐缩，推移岁运助阳刚，育火养中央。 成物象，五转辩微茫。 出入尚迟形上小，晨昏时饮玉壶浆，天籁奏笙簧。 解曰：三转阳数足，故阴龟渐缩，肠胃渐伞，一月之中，大小便共有十次，渐入地之位，将成无漏之道，乾卦皆阳，象纯阳也。 摩顶入息，内育其火，丹抱圣胎，将成形象，五岳未全，八转动其形，如三四寸之小儿。 见之未甚分明，也阳气方足，而未尝育阴。 圣胎有魂，而未尝有魄。 故出入尚迟，形尚小也。 圣胎成像，坐息之间，常见面目光彩。 涌泉甘露之水常出饮之。 七窍聪明，则闻仙乐也。 口诀: 丹入左肋之后，功成三转，凡每月初六、十六、二十六、三六之日，夜半子时，洗漱了入净室中，端坐盘膝，叩齿六通，凝神定气，闭口入息，六次为一候。 如此六遍乃毕。 其月内行至三、六日，则月中三遍，俱足至月尽，夜半子时，依前于净室中，闭目盘足而坐。 先以左手摩顶门，右手摩尾闾骨脊尽头，随月转七七四十九转。 凡摩时紧闭定息至数足，微歇候气定。 再摩如此三次，自觉心肾之气交于中膈，微动丹气，塞于五脏。 觉五脏中，其热如火，乃行火之候也。 或于三六及月尽之时，忽觉丹在左肋之下摇动，微有一道热气，过丹田直入肋下，其热如火，摇动久而后定，乃成四转之功。 自此之后不行重天之数也。 第四转　闭阳户之气，鼻天窍、口地窍 四转行阴入右关，圣胎灵运发朱颜。 圆光满室神无碍，鼓乐嬉游去复还。 解曰：左属阳、右属阴、四转之后，内丹在右。 以应内阴之数，自此内之阴阳俱足。 三转养阳，圣胎生魂。 四转养阴，圣胎生魄。 丹之四转，内之圣胎，魂魄皆就。 其五岳精神，与我内貌则同，此出神之真身也。 四转之后，阴阳气足，正坐闭息，内之神光，从顶门而出。 如一轮明月，罩定身体，神游方外。 出入无碍，坐室见四海，而知吉凶。 望江南 丹已返，四转运行阴。 逢六闭藏阳户气，三关全透合丁壬，龟游任浮沉。 时出入，无碍贯他心。 游戏神通常出面，圆光周匝绕千寻，寒暑不相侵。 解曰：四转养内阴，丹藏于右肋，鼻为天窍，口为地窍。 气之鼻出属阳，气之口出属阴。 三六之夜，闭定鼻息，绝其来去之息，阳气内降，充塞五脏，此以阳养阴也。 闭住鼻窍，则华池水满，下沃心络。 水火内交，心气下降，肾气上腾，丁壬配合，圣胎阴阳数足。 丹在右肋，随气升降，如龟在水，任意浮沉。 内丹光明，罩我之身，其状如月，寒暑不侵。 我心与他人心相通，知其善恶，婴儿出入，游戏四海，名登仙籍也。 口诀： 鼻窍、口窍、其丹入右肋之后，养成四转之功，遇每月初六、十六、二十六、夜半子时，洗漱了入静室，闭目盘足而坐，叩齿三十六通，集神定气，闭定鼻息，湛然不动，直候真气。 内丹田气贯舌窍者，华池津涌满口将欲溢出，然后款款咽之归心。 其神水到心，则激神火，五脏觉热，遍身汗出，四体苏畅为一。 至三元之夜如此行持三遍即止。 此为神水神火抱育元精，抱育之后，或于行持三关，内丹自肋，其声如雷。 一道热气入于丹田，鼻中火光射出，于是内丹复归丹田。 以成五转，自此不行闭阳户之法也。 第五转 五转阴阳造化成，婴儿盈尺弄阳精。",
      "translated_text": "The fetal hue gradually reddens as yin recedes,\nshifting through the years’ cycles to aid yang’s firmness—\nnurturing fire to foster the central palace.\nThe formed image appears,\nand at the fifth turning, one discerns the subtle and vast.\n\nIts ingress and egress remain slow, its form still small;\nat dawn and dusk, one drinks the jade flask’s nectar,\nwhile celestial pipes play the sheng and huang.\n\n*Explanation:*\nWhen the third turning completes its yang count,\nthe yin tortoise gradually contracts,\nand the intestines and stomach gradually open like an umbrella.\nWithin a month, there are ten movements of both bowels,\ngradually entering earth’s position,\nnearing the attainment of the Dao of no leakage.\nQian hexagram is all yang, symbolizing pure yang.\n\nStroking the crown while drawing in breath,\none inwardly nurtures the fire,\nthe elixir embracing the sacred embryo,\nnearing the formation of its image.\nThe five peaks are not yet complete,\nand at the eighth turning, its form stirs—\nlike a small child of three or four inches.\nThe vision of it is not yet distinct,\nfor yang qi is now full but has not yet nurtured yin.\nThe sacred embryo possesses a hun-soul\nbut has not yet acquired a po-soul.\nThus its ingress and egress remain slow,\nand its form still small.\n\nWhen the sacred embryo takes shape,\nbetween sittings and breaths,\none constantly sees its countenance radiant with light.\nThe sweet dew of the bubbling spring flows forth to drink.\nThe seven orifices grow keen,\nand one hears the music of immortals.\n\n*Oral Instructions:*\nAfter the elixir enters the left flank\nand the work of the third turning is complete,\non the sixth, sixteenth, and twenty-sixth days of each month—\nthe three sixes—\nat midnight, the hour of *zi*,\nwash and rinse, then enter a pure chamber.\nSit upright with legs crossed,\nknock the teeth thirty-six times,\ngather the spirit and settle the qi,\nclose the mouth and draw in breath six times as one cycle.\nRepeat this six times to complete the practice.\n\nOn the third and sixth days of the month,\nperform this three times in the month,\nfulfilling the count by the month’s end.\nAt midnight, the hour of *zi*,\nsit in the pure chamber as before,\neyes closed, legs crossed.\nFirst, use the left hand to stroke the crown,\nand the right hand to stroke the tailbone at the spine’s end,\nturning with the moon for forty-nine cycles.\nWhile stroking, hold the breath firmly until the count is complete,\nthen rest briefly to settle the qi.\nRepeat this three times,\nuntil one feels the qi of heart and kidney\nmeet at the central diaphragm,\ngently stirring the elixir-qi,\nfilling the five viscera.\nWhen the five viscera grow as hot as fire,\nit is the time to circulate the fire.\n\nAt times on the three sixes or the month’s end,\none may suddenly feel the elixir beneath the left flank stir,\nwith a thread of hot qi passing through the cinnabar field\nstraight into the flank,\nits heat like fire,\nshaking for a long while before settling—\nthis completes the work of the fourth turning.\nFrom this point, one no longer practices the count of the heavy heaven.\n\n**Fourth Turning**\nClosing the yang gate’s qi,\nthe nose as heaven’s orifice, the mouth as earth’s orifice.\n\nAt the fourth turning, yin moves into the right pass,\nthe sacred embryo’s numinous work brightens the crimson countenance.\nA halo of light fills the chamber, the spirit unobstructed—\ndrums and music play as one roams and returns.\n\n*Explanation:*\nThe left pertains to yang, the right to yin.\nAfter the fourth turning, the inner elixir resides on the right,\ncorresponding to the count of inner yin.\nFrom this point, inner yin and yang are both full.\nThe third turning nurtures yang,\nand the sacred embryo generates its hun-soul.\nThe fourth turning nurtures yin,\nand the sacred embryo generates its po-soul.\nAt the elixir’s fourth turning,\nthe sacred embryo within possesses both hun and po.\nIts five peaks and spirit\nmirror one’s inner visage—\nthis is the true body of spirit departure.\n\nAfter the fourth turning,\nwith yin and yang qi full,\nsitting upright and holding the breath,\nthe inner spirit-light emerges from the crown.\nLike a bright moon encircling the body,\nthe spirit roams beyond the mundane,\ningress and egress unobstructed.\nSitting in the chamber, one sees the four seas\nand knows fortune and misfortune.\n\n*To the Tune of \"Wàng Jiāngnán\"*\nThe elixir has returned,\nat the fourth turning, yin moves.\nOn the sixth, close and store the yang gate’s qi,\nthe three passes fully open, merging *ding* and *ren*—\nthe tortoise roams, freely rising and sinking.\n\nAt times it emerges,\nunobstructed, piercing others’ hearts.\nPlayfully, the spirit-sage often appears,\na halo of light encircling a thousand *xun*,\nneither cold nor heat assailing.\n\n*Explanation:*\nThe fourth turning nurtures inner yin,\nthe elixir concealed in the right flank.\nThe nose is heaven’s orifice, the mouth earth’s orifice.\nQi exhaled through the nose pertains to yang,\nqi exhaled through the mouth pertains to yin.\nOn the nights of the three sixes,\nclose the nose’s breath,\ncutting off its coming and going.\nYang qi descends inwardly,\nfilling the five viscera—\nthis is using yang to nurture yin.\nClosing the nose’s orifice,\nthe flower pool’s waters brim,\nflowing down to moisten the heart’s network.\nWater and fire inwardly merge,\nheart qi descends,\nkidney qi ascends,\n*ding* and *ren* unite,\nand the sacred embryo’s yin and yang counts are full.\nThe elixir in the right flank\nrises and falls with the qi,\nlike a tortoise in water,\nfreely rising and sinking.\nThe inner elixir’s light\nenvelops my body,\nits form like the moon,\nneither cold nor heat assailing.\nMy heart connects with others’ hearts,\ndiscerning good and evil.\nThe infant emerges and enters,\nplayfully roaming the four seas—\none’s name is recorded in the immortal registers.\n\n*Oral Instructions:*\nFor the nose’s orifice and mouth’s orifice,\nafter the elixir enters the right flank\nand the work of the fourth turning is complete,\non the sixth, sixteenth, and twenty-sixth days of each month,\nat midnight, the hour of *zi*,\nwash and rinse, then enter a quiet chamber.\nSit with eyes closed and legs crossed,\nknock the teeth thirty-six times,\ngather the spirit and settle the qi,\nclose the nose’s breath, utterly still,\nwaiting for the true qi.\nWhen the inner cinnabar field’s qi pierces the tongue’s orifice,\nthe flower pool’s fluids well up, filling the mouth,\nnearly overflowing—\nthen gently swallow them, guiding them to the heart.\nWhen the spirit-water reaches the heart,\nit stirs the spirit-fire,\nthe five viscera grow warm,\nsweat bathes the body,\nand the four limbs feel refreshed—\nthis is one cycle.\nOn the nights of the three origins,\nperform this three times and stop.\nThis is the spirit-water and spirit-fire\nembracing and nurturing the original essence.\n\nAfter this nurturing,\nwhen circulating the three passes,\nthe inner elixir from the flank\nrumbles like thunder.\nA thread of hot qi enters the cinnabar field,\nfirelight shoots from the nose—\nthus the inner elixir returns to the cinnabar field,\ncompleting the fifth turning.\nFrom this point, one no longer practices the method of closing the yang gate.\n\n**Fifth Turning**\nAt the fifth turning, yin and yang complete their transformations,\nthe infant, a foot in length, plays with yang’s essence.",
      "overlap_context": "sence in the cinnabar field; with each inhalation, the elixir stirs, hence the phrase “dividing its forms.” When heaven and earth harmonize, their resonance produces sound—this is the celestial pipes. Before the third turning, the nine orifices are closed and their sounds unheard; after the third turning, the nine orifices become keenly attuned to the celestial pipes’ music, heard day and night without cease.\n\n*To the Tune of \"Wàng Jiāngnán\"*\nThe hair grows fine,\nas the third turning moves yang.",
      "start_char": 2736,
      "end_char": 3990,
      "start_sentence": 128,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.403419494628906,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "寐游四海寤知所，去住无为信步行。 解曰：四转养内阴，三转养内阳，五转内外，阴阳数足。 造化之功，已成养就。 圣胎神通自在，故曰造化成也。 五转之后，内丹圣胎养就，灵躯身长尺余，自此采日之精，以养外阳，夺天地造化之功也。 常人内无所养，精神四散而无归着，昼则神在于心，夜则神出于体，及其睡着神无速守，更不知有身，亦不知所在，随魂随魄，入幽趣之中，与鬼同聚，于梦中无一，不见四大物坏，神从鬼往随福受生天堂地狱。 皆不由己乃神，不识其身随波逐浪之形也。 得道真人，内丹成就，神合于身，物不能诱。 是故魂魄潜伏，万邪不干，更无忧虑，出离生死皆由于我。 出神入神纵横莫测。 故丹经颂曰：真人无梦，此之谓也。 得道真人。 神无所滞，魂住在我，信步无碍也。 望江南 珠自右，紫电入丹城。",
      "translated_text": "When asleep, one roams the four seas; when awake, one knows their place—\ncoming and going without effort, walking at will as one pleases.\n\n**Explanation:**\nAt the fourth turning, one nurtures the inner yin;\nat the third turning, one nurtures the inner yang;\nat the fifth turning, both inner and outer,\nyin and yang reach their full measure.\nThe work of transformation is complete,\nthe sacred embryo’s spiritual powers now unrestrained—\nthus it is said, \"the transformations are complete.\"\nAfter the fifth turning, the inner elixir’s sacred embryo is fully nurtured,\nthe numinous body grows to over a foot in length.\nFrom this point, one absorbs the essence of the sun\nto nourish the outer yang,\nseizing the transformative power of Heaven and Earth.\n\nOrdinary people, having nothing within to nurture,\nlet their spirit scatter without return.\nBy day, their spirit dwells in the heart;\nby night, it leaves the body.\nWhen sleep overtakes them, the spirit has no swift guard—\nthey know neither body nor place,\ndrifting with hun and po,\nentering the dark realms,\ngathering with ghosts.\nIn dreams, they witness the decay of the four great elements,\ntheir spirit following ghosts,\nreceiving rebirth in heaven or hell according to karma—\nall beyond their control,\ntheir spirit unaware of its form,\nadrift on the waves.\n\nThe perfected one who attains the Dao,\nhaving completed the inner elixir,\nunites spirit with body,\nunmoved by external things.\nThus hun and po lie hidden,\nno evil can intrude,\nno cares remain,\nliberation from life and death lies within their grasp.\nExiting and entering spirit, unfathomable in movement—\nhence the alchemical ode says:\n*\"The true person has no dreams.\"*\nThis is its meaning.\n\nThe perfected one who attains the Dao—\ntheir spirit knows no stagnation,\ntheir hun abides within,\nwalking at will without hindrance.\n\n*Gazing at the River South*\nThe pearl from the right,\na purple lightning enters the cinnabar city.",
      "overlap_context": "sence.\n\nAfter this nurturing,\nwhen circulating the three passes,\nthe inner elixir from the flank\nrumbles like thunder.\nA thread of hot qi enters the cinnabar field,\nfirelight shoots from the nose—\nthus the inner elixir returns to the cinnabar field,\ncompleting the fifth turning.\nFrom this point, one no longer practices the method of closing the yang gate.\n\n**Fifth Turning**\nAt the fifth turning, yin and yang complete their transformations,\nthe infant, a foot in length, plays with yang’s essence.",
      "start_char": 3991,
      "end_char": 4324,
      "start_sentence": 184,
      "end_sentence": 198,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.53133487701416,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "内养婴儿成赤象，时逢五转采阳精，火自水中生。 烧鬼岳，紫电起峥嵘。 随意嬉游寰海内，寐如砂碛卧长鲸，时序与偕行。 解曰：五转功成，阴阳数足，内丹玄珠，忽自右肋一道真火飞入丹田。 声如鼻光如火，乃是丹珠内阴内阳，皆复丹田以成五转之位也。 圣胎之内，真人成就，出入顶门，长尺余也。 三转养阳四转养阴，内之阴阳皆足。 丹田功成五转，则夺天地造化。 采日之精，以成外阳修行之道。 自内及外、其序之顺也。 故自五转之后，于一月之内逢三九之日，采日月之精，以养圣胎也。 行持之法，以水求火，以阴求阳，水火既济，阴阳大和。 故曰：火自水中生，常人于丹田之下积阴之气，谓之鬼岳。 遍体纯阳，阴山鬼岳烧荡，阳宫神庭建立。 吕先生曰：烧山符子鬼难看。 此之谓也。 随意出神游行四海，去住从己所欲也。 寐识其身，寤之其所运神出，身自观本形，如长鲸卧于砂碛也。 五转之后造化功成。 与天地合德，日月合明，内丹造化与时偕行。 口诀: 内丹复入丹田，五转之功成就。 内之阴阳数足，当采外之阴阳以成大道，凡遇每月初九，十九，二十九，三九之日。 当日正午之时，面南盘膝闭目，对日而坐。 候气定绝鼻息，使气无往来，真阳不泄，充满于内，其内真火交通。 自觉一身上下通红，光明满室，一二刻后渐渐丹田真水一道冷气，一直上贯于心，如水精丸浮在心上。 然后闭目开息，从鼻中吸之，吸气九九八十一口，纳之于心。 其日光到心之后，渐觉心头气动，在丹田如鱼踊跃，乃是阴阳大和，至八十一口而止。 如此行持三年而毕。 三载后不采日精却，采月华也。 第六转　日有五色三年，月有九芒一年 六转丹田弄月华，变胎魂魄影潜赊。 阳砂换骨阴消肉，换尽真如玉不瑕。 解曰：丹至六转，内外阴阳皆成。 圣胎全具，真人与内身一体。 每遇月圆之夜，采月之华，以积其阴，故曰：弄月华也。 五转真阳全，魂化为神。 六转真阴全，魄化为气。 魂魄内外，全日中游，行更无其影，与日纯阳为一。 自此之后，鬼神不可见，阴阳不可测，以成其真仙之道。 故曰影潜赊也。 人之凡胎浊骨，阴阳不洁。 不能上升得道，真人丹成四转之后，至五转采日精，纳丹田结为阳砂。 丹砂内结入于骨髓，随汗而消也。 故曰阳砂换骨。 换骨之后至六转，采月华纳于丹田，结为阴粉。 采月华一年之后，其阴粉内化入于内中、以养仙肌。 但觉大小便常有血随尿出，乃是阴消凡肉，仙肌自生。 故曰阴消肉也。 玉之有瑕不成真玉，人之凡胎浊骨，不成真人。 六转之后换其凡骨亦生仙骨，去其凡肌而生仙肌，换尽无瑕神仙纯一。 望江南 日精满，阴魄化无形。",
      "translated_text": "Within, the infant is nurtured into a crimson elephant,\ntimely encountering the five revolutions to gather yang essence—\nfire arises from water.\nBurning the demonic peaks,\npurple lightning surges, towering and majestic.\nRoaming at will through the vast seas,\nsleeping like a long whale resting on sandy shoals,\nmoving in harmony with the seasons.\n\n*Explanation:*\nWhen the five revolutions are complete and the numbers of yin and yang are fulfilled, the inner elixir’s mysterious pearl suddenly emits a streak of true fire from the right flank into the cinnabar field. Its sound is like thunder, its light like flame—this is the inner yin and yang of the elixir pearl returning to the cinnabar field to fulfill the five revolutions. Within the sacred embryo, the perfected one is accomplished, emerging and entering through the crown gate, over a foot in length. The third revolution nurtures yang, the fourth nurtures yin, and the inner yin and yang are both fulfilled. When the cinnabar field completes the five revolutions, it seizes the creative power of heaven and earth. Gathering the essence of the sun forms the path of external yang cultivation. From inner to outer, the sequence is orderly. Thus, after the five revolutions, within a month, on the days of the three nines, one gathers the essence of the sun and moon to nurture the sacred embryo. The method of practice is to seek fire through water, seek yang through yin—when water and fire are in harmony, yin and yang achieve great balance. Hence it is said: *fire arises from water.* Ordinary people accumulate yin qi below the cinnabar field, calling it the demonic peaks. When the body becomes purely yang, the yin mountains and demonic peaks are incinerated, and the yang palace and divine court are established. Master Lü said: *\"The burning mountain talisman—demons dare not gaze.\"* This is its meaning. Roaming the four seas at will, coming and going as one desires. In sleep, one recognizes the body; upon waking, the spirit moves outward, and the body perceives its original form, like a long whale resting on sandy shoals. After the five revolutions, the work of creation is complete. In virtue, one joins with heaven and earth; in brightness, one joins with the sun and moon. The inner elixir’s creation moves in step with time.\n\n*Oral Instructions:*\nWhen the inner elixir returns to the cinnabar field and the five revolutions are accomplished, the numbers of inner yin and yang are fulfilled. One then gathers the outer yin and yang to complete the great Dao. On the ninth, nineteenth, and twenty-ninth days of each month—the days of the three nines—at high noon, face south, sit cross-legged with eyes closed, and sit facing the sun. Wait until the qi settles and the breath ceases, allowing no movement of qi, so that true yang is not leaked and fills the interior, and the inner true fire communicates. One will feel the entire body suffused with redness, light filling the room. After a moment or two, a stream of true water from the cinnabar field—a cold qi—rises straight to the heart, like a crystal pearl floating above it. Then, closing the eyes and opening the breath, inhale through the nose, drawing in eighty-one breaths, and gather them into the heart. Once the sunlight reaches the heart, one gradually feels the qi stirring at the heart’s center, leaping in the cinnabar field like a fish—this is the great harmony of yin and yang. Stop at eighty-one breaths. Practice this for three years to complete the work. After three years, one no longer gathers the sun’s essence but instead gathers the moon’s radiance.\n\n*Sixth Revolution:*\nThe sun has five colors over three years,\nthe moon has nine rays over one year.\nIn the sixth revolution, the cinnabar field plays with the moon’s radiance,\ntransforming the embryo, the hun and po’s shadows stealthily recede.\nYang cinnabar replaces the bones, yin dissolves the flesh—\nexchanging all for true suchness, flawless as jade.\n\n*Explanation:*\nWhen the elixir reaches the sixth revolution, inner and outer yin and yang are both complete. The sacred embryo is fully formed, and the perfected one becomes one with the inner body. On nights when the moon is full, one gathers the moon’s radiance to accumulate yin—hence it is called *playing with the moon’s radiance.* In the fifth revolution, true yang is complete, and the hun transforms into spirit. In the sixth revolution, true yin is complete, and the po transforms into qi. The hun and po, inner and outer, roam freely in daylight, leaving no shadow, becoming one with the sun’s pure yang. From this point on, ghosts and spirits cannot be seen, yin and yang cannot be fathomed—thus the path of the true immortal is achieved. Hence it is said: *the shadows stealthily recede.* The ordinary person’s impure bones and turbid body, with unclean yin and yang, cannot ascend to attain the Dao. After the perfected one’s elixir is formed in the fourth revolution, by the fifth revolution, one gathers the sun’s essence, congealing it in the cinnabar field to form yang cinnabar. The cinnabar enters the bone marrow, dissolving with sweat—hence it is said: *yang cinnabar replaces the bones.* After the bone replacement, in the sixth revolution, one gathers the moon’s radiance, congealing it in the cinnabar field to form yin powder. After a year of gathering the moon’s radiance, the yin powder transforms internally to nurture the immortal’s flesh. One will notice blood often appearing in the urine—this is the yin dissolving the ordinary flesh, while the immortal’s flesh naturally grows. Hence it is said: *yin dissolves the flesh.* Jade with flaws is not true jade; a person with an ordinary body and turbid bones is not a true person. After the sixth revolution, the ordinary bones are replaced with immortal bones, the ordinary flesh is shed to grow immortal flesh—exchanging all for flawless unity, the immortal is pure.\n\n*Gazing at the River South*\nThe sun’s essence fills,\nthe yin po transforms, leaving no form.",
      "overlap_context": "s.\nThus hun and po lie hidden,\nno evil can intrude,\nno cares remain,\nliberation from life and death lies within their grasp.\nExiting and entering spirit, unfathomable in movement—\nhence the alchemical ode says:\n*\"The true person has no dreams.\"*\nThis is its meaning.\n\nThe perfected one who attains the Dao—\ntheir spirit knows no stagnation,\ntheir hun abides within,\nwalking at will without hindrance.\n\n*Gazing at the River South*\nThe pearl from the right,\na purple lightning enters the cinnabar city.",
      "start_char": 4324,
      "end_char": 5354,
      "start_sentence": 199,
      "end_sentence": 251,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.54827380180359,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "每遇月圆开地户，神龟时饮碧瑶精。 清洁复如水。 阳砂赤，阴粉色微青。 粉换肉兮砂换骨，凡胎换尽圣胎灵，飞举似流星。 解曰：阴阳数全，魂魄内外，体无形影，乃登真人之道。 六转每遇十五月圆之夜，运北方肾水，交南方心火。 使内外水火既济，以结阴粉。 与天地造化流通，以育圣胎之质。 神龟者，肾水中龟也。 吕先生曰：饮海龟儿人不识，烧山符子鬼难看。 乃谓是也。 采月之英华纳于神水之府，其神龟饮之清洁如玉，冰冷如成阴。 粉生于北极之中，故象其龟也。 阳砂者，日精所结，故属于阳，其色赤亦象其日。 阴粉色月华所结，故属于阴。 其色青青者，象于月也。 骨肉换尽，则胎内化肌、骨、皮、肉皆无，尽化仙质。 魂化合神，魄化合气，悉皆清静一体之中。 形神俱妙，与道合真。 学道之士，能全其神，未能换其形。 为形所累，故出神则身不能动。 尸假则形，为形作累故，出神则身不能动，尸假则形不能忘，丹成六转，则换凡形，而成仙质。 形神俱妙，神之所向，体亦随之，上升九霄，如云如星之快也。 口诀: 丹成六转，采月之华，每遇月圆，十五夜半子时，洗漱毕。 对月而坐，闭息合口，绝往来之息，使真气不泄于外。 内之真气充塞于六腑，肾之真阴与太阳之精，内外之真气，莹若水精湛然明朗。 一二刻间肾之真水感动于心火，心神之火一道热气降入丹田，如一火轮，安在琉璃盘内，然后款款开目，放息鼻中，对月吸月之气，纳于丹田。 吸八八六十四口而止。 吸气一半之后，其月华真阴，激动丹田中真火，水火相济，如沸汤之状，四体汗出，百脉苏畅。 至六十四口而止。 如此行持三年了毕，其功入七转之位也。 第七转 七转身飞四体轻，灵光闭息满丹城。 千朝却粒生成火，坤户施张浴海鲸。 解曰：丹成六转，阴阳内外俱足。 凡骨换为仙骨，凡肉换为仙肌，四体百骸并无凡物。 仙体轻清，飞举自然也。 内丹点就神骸，故一身之体为之减也。 丹之七转，使阴阳内外和合。 当闭十朝，以成妙道之用也。 丹成七转，闭息千朝，使阴阳大和，千日数足，神气合会，五脏皆新，内外纯一，丹光明彻于六腑，真火烛开于五内脏，腑谷虫化而为水。 自此肠胃充实，不着烟火之气，不纳烟火之食。 饥餐仙果，渴饮琼浆，与世不类也。 内丹皆化之后，阴茎消尽惟有一窍，名曰：坤户。 以象其阴，每遇神丹火盛，则于三九之日，投身水中运其丹珠，从坤户而出，吸呼弄水游戏自在。 一二时久，复运其丹归于丹穴，以制火之盛也。 望江南 形透日，七转任飞腾。",
      "translated_text": "At each full moon, open the earthly gate,\nthe sacred tortoise drinks the azure jade’s essence—\npure and clean as water once more.\nYang powder glows crimson,\nyin powder bears a faint blue-green hue.\nPowder replaces flesh, powder replaces bone,\nthe mortal womb is wholly exchanged for the sacred embryo’s numen,\nascending swift as a shooting star.\n\n*Explanation:*\nWhen yin and yang’s numbers are complete,\nhun and po unite within and without,\nthe body leaves no shadow or form—\nthis is the Way of ascending as a perfected one.\nAt each sixth revolution, on the full-moon night of the fifteenth,\ncirculate the north’s kidney-water to join the south’s heart-fire,\nenabling the inner and outer water and fire to achieve mutual fulfillment,\nthereby congealing yin powder.\nIn harmony with heaven and earth’s creative transformations,\nit nurtures the sacred embryo’s substance.\nThe *sacred tortoise* is the tortoise within kidney-water.\nMaster Lü says: *\"The sea-tortoise’s child—none recognize it;\nthe mountain-burning talisman—ghosts dare not behold.\"*\nThis refers precisely to it.\nGathering the moon’s radiant essence into the palace of spirit-water,\nthe sacred tortoise drinks it—pure as jade, cold as congealed yin.\nThe powder arises within the northern pole,\nhence it takes the tortoise’s form.\n*Yang powder* is congealed from the sun’s essence,\nthus belonging to yang—its crimson hue likewise mirrors the sun.\n*Yin powder* is congealed from moon radiance,\nthus belonging to yin—its blue-green hue mirrors the moon.\nWhen bones and flesh are wholly exchanged,\nthe embryo’s inner flesh, bones, skin, and muscle all vanish,\ntransforming entirely into immortal substance.\nThe hun transforms to merge with spirit,\nthe po transforms to merge with qi,\nall becoming a single, pure unity.\nForm and spirit both wondrous,\nthey unite with the Dao in truth.\nThose who study the Dao may preserve their spirit,\nbut cannot yet exchange their form.\nBurdened by form, when the spirit departs, the body cannot move.\nThe corpse lends form—bound by form’s burden,\nwhen the spirit departs, the body cannot move;\nthe corpse lends form—one cannot forget the body.\nAfter the sixth revolution of the elixir’s completion,\nthe mortal form is exchanged for immortal substance.\nForm and spirit both wondrous,\nwherever the spirit directs, the body follows,\nascending to the nine heavens,\nswift as clouds, swift as stars.\n\n*Oral Instructions:*\nWhen the elixir completes its sixth revolution,\ngather the moon’s radiance.\nAt each full moon, on the fifteenth night at midnight,\nwash and rinse, then sit facing the moon.\nClose the breath, seal the mouth,\ncut off the incoming and outgoing breath,\nso true qi does not leak outward.\nWithin, true qi fills the six viscera;\nthe kidney’s true yin and the great yang’s essence,\nthe inner and outer true qi,\ngleam like crystal—limpid and luminous.\nAfter one or two moments,\nthe kidney’s true water stirs the heart’s fire,\na thread of the heart-spirit’s fire descends into the cinnabar field,\nlike a wheel of flame set within a lapis lazuli dish.\nThen gently open the eyes,\nrelease the breath through the nose,\nand facing the moon, inhale the moon’s qi into the cinnabar field.\nDraw eighty-one breaths and stop.\nAfter half the inhalations,\nthe moon’s true yin excites the cinnabar field’s true fire,\nwater and fire achieve mutual fulfillment,\nlike boiling water—\nthe four limbs sweat, the hundred vessels flow freely.\nStop at eighty-one breaths.\nPracticing thus for three years completes the work,\nadvancing the achievement to the seventh revolution’s stage.\n\n*The Seventh Revolution*\nAt the seventh revolution, the body flies—four limbs light,\nspirit-light seals the breath, filling the cinnabar city.\nAfter a thousand mornings of grain abstention, fire naturally arises;\nthe Kun-gate opens and closes, bathing the ocean’s whale.\n\n*Explanation:*\nWhen the elixir completes its sixth revolution,\nyin and yang, inner and outer, are both fulfilled.\nMortal bones are exchanged for immortal bones,\nmortal flesh for immortal flesh—\nthe four limbs and hundred bones harbor no mortal substance.\nThe immortal body is light and pure,\nascension comes naturally.\nThe inner elixir refines the spirit-skeleton,\nthus the entire body becomes lighter.\nAt the seventh revolution of the elixir,\nyin and yang, inner and outer, harmonize.\nOne must seal the breath for ten mornings\nto perfect the wondrous Dao’s function.\nWhen the elixir completes its seventh revolution,\nseal the breath for a thousand mornings,\nenabling yin and yang’s great harmony.\nWhen the thousand days’ count is complete,\nspirit and qi unite,\nthe five viscera are renewed,\ninner and outer become pure unity.\nThe elixir’s light shines through the six viscera,\ntrue fire illuminates the five inner organs,\nthe worms in the intestines transform into water.\nFrom this point, the intestines and stomach are replete,\nuntainted by the qi of smoke and fire,\nunfed by smoke and fire’s food.\nHunger is sated with immortal fruits,\nthirst quenched with jade nectar—\nunlike the worldly.\nAfter the inner elixir fully transforms,\nthe yin organ vanishes, leaving only one aperture,\ncalled the *Kun-gate*,\nwhich mirrors yin.\nWhenever the spirit-elixir’s fire blazes,\non the third nine-day period,\nimmerse the body in water,\ncirculate the elixir pearl,\nletting it emerge from the Kun-gate—\ninhale, exhale, play with the water, freely at ease.\nAfter one or two hours,\nreturn the elixir to its cinnabar cave\nto restrain the fire’s intensity.\n\n*Gazing at the River South*\nThe form penetrates the sun,\nat the seventh revolution, soaring at will.",
      "overlap_context": "lving the ordinary flesh, while the immortal’s flesh naturally grows. Hence it is said: *yin dissolves the flesh.* Jade with flaws is not true jade; a person with an ordinary body and turbid bones is not a true person. After the sixth revolution, the ordinary bones are replaced with immortal bones, the ordinary flesh is shed to grow immortal flesh—exchanging all for flawless unity, the immortal is pure.\n\n*Gazing at the River South*\nThe sun’s essence fills,\nthe yin po transforms, leaving no form.",
      "start_char": 5354,
      "end_char": 6347,
      "start_sentence": 252,
      "end_sentence": 300,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.634881496429443,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "幽静深岩图宴坐，息无来往气坚凝。 却粒着其能， 生成火，返本气澄清。 九候浴时开地户，月中取火日求冰，五内换重新。 解曰：七转之后，形神俱妙，内府皆为仙器。 日中游行，身体通明，色如红玉，飞举腾空，纵横任意。 大抵须要内外和顺，使之日月光华。 会于心肾水火，阴阳交通，神气和会。 深入岩谷之中宴坐千百日。 闭鼻息，以绝呼吸之气，冲和凝定。 然后内实，不食尘世之物，以证逍遥之道也。 至于却粒，不食真奇功、奇道也。 闭息千日，神火内发，荡洗谷气，更无食念。 返本还元，抱一守静。 故曰：还返气澄清，凡遇神火五脏发热，则逢三九之日，入于水中，澄其真丹，光明如火轮之状，从地户出。 故曰：开地户月者，阴之象也。 神火至阳之物也，户者阴之窍，通阳光从地户阴穴而出。 故曰：月中取火也。 日者阳物也，舌者阳之窍，通流神水，从舌窍阳穴而出。 故曰：日求冰也。 五转换骨，六转换肉，七转换五脏，五内者五岳也。 故曰：五内换重新也。 口诀: 丹成至七转，当离尘世，入深山之中，或岩谷间宴坐、闭息精神，口鼻绝往来之息。 使真阴真阳交于腹，夺天地造化之功，归于四体。 千日之后，五脏换尽，胎气变为仙府。 但觉顶门窍开，出黑赤之气。 乃是胎气发散，千日数足，顶门窍合。 乃是胎气出尽，七转功满也。 自此之后，五脏结实，不纳烟火。 若有时五脏丹火发，则入水中闭定鼻息，使丹珠神火从地户而出。 浮于水面，如牛弄黄，直候舌下神水如泉，则丹火息吸其丹珠，复入地户。 直至八转地带成就，无火毒则不复浴也。 第八转 八转还元地带垂，周行胎息养婴儿。 有时火发烧丹窟。 深入寒泉弄赤龟。 解曰：婴儿在母腹中，胞胎里定气，不能出之象，神水至清之入，而无所损。 若婴儿脐中有脐带，衔在口中，呼吸之气往来不绝。 此乃自然胎息。 故无损也。 丹成八转之后，换于脐中生一，脐带亦如婴儿之状，还其本始之道，故曰还元地带垂也。 婴儿得脐带行胎息之气，故无所损，真人得地带行周天之气，故能长生也，赤龟丹珠也。 八转之后，内炼真火，使无热毒之患，凡遇火发，即口衔地带闭息，九日至第九日，真水自丹田如涌泉泛涨，直至重楼十二环，丹珠在其神水之中，如龟之戏水。 自此之后，真火无毒，更无丹热之患。 故曰有时火发烧丹窟，深入寒泉弄赤龟。 望江南 内外变，八转始还元。 地带长垂主坎户，周行胎息贯天门。 太始道方存， 纯一体，赤黑气常喷，丹火发时烧内景。 冷泉涌处浴猴孙，神水赤龟吞。 解曰：丹至八转，外之形体，内之五脏，尽底换变。 复生地带，如小儿之状，故曰返本还元也。 地带者脐下之带也。 生于脐中，属北方坎卦，故曰：坎户天门，华池之窍地、带贯于口中。 行周天之息，以调火候，故曰：周天息也。 太始之道，生天地之始，丹成八转，如天地造化之初也。 内丹纯阳也。 无一点阴气，故曰纯一体也。 黑赤者神火之气也。 丹成八转，自心而来，常从鼻中出入。 常见黑赤二气，故曰：气常喷也。 丹火之患，运神水以制之，更无丹火之候。 盖丹者心珠，心家猴孙也。 赤龟火神也，丹浮于水之中，如龟吞水取其状也。 口诀:",
      "translated_text": "Secluded in the depths of silent cliffs, one sits in meditation,\nbreath still, with no coming or going—qi solidifies and congeals.\nRejecting grains reveals its power,\nfor fire is born of life,\nand returning to the root, qi becomes limpid and clear.\n\nWhen bathing during the ninefold cycles, the Earth-gate opens;\nfrom the moon one gathers fire, from the sun seeks ice—\nthe five viscera are renewed anew.\n\n*Explanation:*\nAfter the seven revolutions, form and spirit both attain subtlety,\nand the inner organs all become vessels of immortality.\nRoaming at midday, the body becomes luminous,\nits hue like red jade,\nsoaring and ascending through space, moving freely at will.\nIn general, one must ensure inner and outer harmony,\nso that the radiance of sun and moon\nconverges in the heart and kidneys, water and fire,\nwith yin and yang in communion, spirit and qi in harmony.\nDeep within mountain valleys, one sits in meditation for hundreds or thousands of days,\nclosing the nostrils to sever the breath,\nso that the harmonious qi congeals and settles.\nThen the inner self is replete,\nno longer consuming the dust of the world,\nthereby realizing the Dao of carefree wandering.\n\nAs for rejecting grains, not eating is a marvelous achievement and wondrous path.\nAfter a thousand days of breath-holding,\nthe spirit-fire blazes within,\nscouring away the qi of grains,\neradicating all thoughts of food.\nReturning to the root and reverting to the origin,\nembracing the One and guarding stillness—\nthus it is said: *Returning, qi becomes limpid and clear.*\nWhenever the spirit-fire causes the five viscera to grow hot,\non the third nine-day period,\nenter the water,\nclarify the true elixir,\nwhich shines like a wheel of fire,\nemerging from the Earth-gate—\nthus it is said: *Opening the Earth-gate.*\nThe moon is a symbol of yin;\nspirit-fire is a thing of utmost yang.\nThe gate is a yin aperture,\nthrough which yang light emerges from the yin cavity of the Earth-gate—\nthus it is said: *From the moon one gathers fire.*\nThe sun is a yang thing;\nthe tongue is a yang aperture,\nthrough which spirit-water flows,\nemerging from the yang cavity of the tongue—\nthus it is said: *From the sun seeks ice.*\nThe fifth revolution changes the bones,\nthe sixth revolution changes the flesh,\nthe seventh revolution changes the five viscera—\nthe five viscera are the five sacred peaks,\nthus it is said: *The five viscera are renewed anew.*\n\n*Oral Instructions:*\nWhen the elixir reaches the seventh revolution,\none should leave the mundane world,\nenter deep mountains or secluded valleys to sit in meditation,\nseal the breath and spirit,\ncutting off the coming and going of breath through mouth and nose.\nLet true yin and true yang merge within the abdomen,\nseizing the creative power of heaven and earth,\nreturning it to the four limbs.\nAfter a thousand days,\nthe five viscera are entirely transformed,\nand the fetal qi becomes a celestial palace.\nOne may feel the aperture at the crown open,\nreleasing black and red qi—\nthis is the dispersal of fetal qi.\nWhen the thousand-day count is complete,\nthe crown aperture closes—\nthis signifies the fetal qi has fully emerged,\nand the seventh revolution is perfected.\nFrom this point onward,\nthe five viscera are solid and replete,\nno longer consuming smoke and fire.\nIf at times the elixir-fire of the viscera blazes,\nenter the water, seal the nostrils,\nand let the elixir-pearl and spirit-fire emerge from the Earth-gate,\nfloating on the water’s surface like a cow playing in yellow mud.\nWait until the spirit-water beneath the tongue flows like a spring,\nthen absorb the elixir-pearl and spirit-fire,\nreturning them to the Earth-gate.\nThis continues until the eighth revolution’s *Earth-sash* is accomplished,\nand with no fire-toxins remaining, one no longer needs to bathe.\n\n*Eighth Revolution*\nAt the eighth revolution, the *Earth-sash* hangs, returning to the origin,\ncirculating fetal breath to nurture the infant.\nWhen fire blazes, scorching the elixir-cave,\nplunge deep into icy springs to play with the red turtle.\n\n*Explanation:*\nThe infant in the mother’s womb,\nwithin the fetal sac, stabilizes its qi,\nunable to expel it—\nthis is the image of spirit-water in its utmost clarity,\nentering without loss.\nIf the infant’s umbilical cord\nis held in its mouth,\nthe breath comes and goes without cease—\nthis is natural fetal breathing,\nthus it suffers no harm.\nAfter the elixir reaches the eighth revolution,\nan umbilical cord-like *Earth-sash* grows from the navel,\nresembling the infant’s form,\nreturning to the original Dao of inception—\nthus it is said: *The Earth-sash hangs, returning to the origin.*\nThe infant obtains the umbilical cord to circulate fetal breath,\nthus suffering no harm;\nthe perfected one obtains the *Earth-sash* to circulate the qi of the celestial cycle,\nthus attaining longevity.\nThe red turtle is the elixir-pearl.\nAfter the eighth revolution,\none refines the true fire within,\neliminating the affliction of heat-toxins.\nWhenever fire blazes,\nclasp the *Earth-sash* in the mouth and hold the breath.\nFrom the ninth to the ninth day,\ntrue water surges from the elixir field like a gushing spring,\nrising to the twelve-storied tower of the *Double Pass*,\nwith the elixir-pearl within the spirit-water,\nlike a turtle playing in the water.\nFrom this point onward,\nthe true fire is free of toxins,\nand the affliction of elixir-heat no longer arises—\nthus it is said: *When fire blazes, scorching the elixir-cave, plunge deep into icy springs to play with the red turtle.*\n\n*Gazing at the River South*\nInner and outer transform,\nthe eighth revolution begins the return to the origin.\nThe *Earth-sash* hangs long, mastering the *Kan-gate*,\ncirculating fetal breath to pierce the *Heavenly Gate*.\nThe Dao of the Great Beginning now abides.\nA pure, unified body,\nblack and red qi ever-spouting—\nwhen elixir-fire blazes, scorching the inner landscape,\nat the surging of icy springs, bathe the monkey-grandson,\nspirit-water and red turtle swallow.\n\n*Explanation:*\nWhen the elixir reaches the eighth revolution,\nthe outer form and inner five viscera\nare entirely transformed.\nThe *Earth-sash* regenerates,\nresembling that of an infant—\nthus it is said: *Returning to the origin.*\nThe *Earth-sash* is the cord below the navel,\nborn from the navel,\nbelonging to the northern *Kan* trigram—\nthus it is said: *The Kan-gate and Heavenly Gate.*\nThe aperture of the *Flowery Pond* and the *Earth-sash* enter the mouth,\ncirculating the breath of the celestial cycle\nto regulate the fire-times—\nthus it is said: *Circulating celestial breath.*\nThe Dao of the Great Beginning\nis the origin of heaven and earth;\nwhen the elixir reaches the eighth revolution,\nit is like the inception of heaven and earth’s creation.\nThe inner elixir is pure yang,\nwithout a trace of yin qi—\nthus it is said: *A pure, unified body.*\nBlack and red are the qi of spirit-fire.\nWhen the elixir reaches the eighth revolution,\nit arises from the heart,\nconstantly entering and exiting through the nose,\never manifesting as black and red qi—\nthus it is said: *Qi ever-spouting.*\nThe affliction of elixir-fire\nis tempered by circulating spirit-water,\nleaving no sign of elixir-heat.\nThe elixir is the heart-pearl,\nthe monkey-grandson of the heart;\nthe red turtle is the fire-spirit.\nThe elixir floats within the water,\nlike a turtle swallowing water—\nthis describes its form.\n\n*Oral Instructions:*",
      "overlap_context": "organ vanishes, leaving only one aperture,\ncalled the *Kun-gate*,\nwhich mirrors yin.\nWhenever the spirit-elixir’s fire blazes,\non the third nine-day period,\nimmerse the body in water,\ncirculate the elixir pearl,\nletting it emerge from the Kun-gate—\ninhale, exhale, play with the water, freely at ease.\nAfter one or two hours,\nreturn the elixir to its cinnabar cave\nto restrain the fire’s intensity.\n\n*Gazing at the River South*\nThe form penetrates the sun,\nat the seventh revolution, soaring at will.",
      "start_char": 6347,
      "end_char": 7588,
      "start_sentence": 301,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.87065267562866,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "丹成八转，地带生于脐中，若遇丹火犹发热。 五脏热燥，即闭目宴坐。 以地带接于华池之下，使息气内通流行，周遍运用之道。 自闭息之后，丹田真水日日渐长，至第九日，神水直至重楼十二环，丹珠隐于神水之中，出去火毒。 自此之后更无发燥之患。 至第九夜子时，闭息吸神水从泥丸宫过夹脊复丹田以毕其功也。 第九转　功行毕 九转逍遥道果全，三千功行作神仙。 金书玉简宣皇诏，足蹑祥云谒九天。 解曰：丹成九转，造化成就，道果圆成，更积外行三千，外果圆满，方可飞升。 故许旌阳，丹成之后，除蛟龙之害，然后上升。 孙思邈丹成之后，救万民之疾，然后上升，皆须立功成名方得上升也。 上升之日，天乐来迎，箫韶合奏，以过天关，随功行分职，列为仙班，与天地相为长久也。 内丹诀陈朴冲用撰九转金丹秘诀泥丸先生陈朴传 一转歌、第一转舌下四窍，两窍通心两窍通液。 一转之功似宝珠，山河宇宙透灵躯。 红莲叶下藏丹穴，赤水流通九候珠。 一转之功似宝珠 天一真水，藏之于胆，阴阳和合，降而为丹，状如露珠一颗。 内丹之功，起于一而成于九。 一者，万物之所生也。 天一生水，地二生火，天三生木，地四生金，天五生土。 五行之序起于一，故内丹之功亦起于一。 转而成于九者，九为阳数之极，数至于九，则道果成矣。 似宝珠者，言天一真水藏于胆，阴阳和合，降而成丹。 初降之状如露一颗明珠。 珠者、珍敬其丹也。 山河宇宙透灵躯 人因父精母血交媾而生身，形交也。 丹因心火肾水交媾而丹降，气交也。 丹降之时，神游方外、阴阳太和、至忘其形，天地山河、六合万物、在我身之内、我身在天地之外。 只觉此中，一点光明如日，乃丹降也。 人之有身，父精母血交媾而成，此形交也。 丹之所降，心火肾水交媾而成，此气交也。 故曰：形交则生人，气交则成丹。 言其丹降之后，神游方外，阴阳太和； 坐忘其形，天地山河； 六合万物，皆在我身之内。 我身在天地万物之外，只觉心中一点光明。 乃是丹降也。 故曰：山河宇宙透灵躯，躯者、身也。 山河包藏我身之内也。 红莲叶下藏丹穴 舌下两窍，左通心，右通胆。 真气流注以通神明。 故人身不安，则舌下液干，以其真气耗也。 一转之首，以舌闭其两窍，使真气不泄于外，以通其神水也。 所谓红莲者，舌是也。 自两窍通心，两窍通液。 人有病者，则舌下津液干而其真气耗。 一转之首以舌闭其两窍，使真气不泄于外，以通其神水也。 赤水流通九候殊 赤水液也，九转之首。 每遇九日，细息九次。 每次入口九口，自然津液通流，自舌而生，以灌下藏，乃九候也。 所谓赤水者，心之液是也。 九转之首，每遇九日纳息九次。 每一次纳息九口。 自然津液通流自舌下，而生以灌五脏，故曰九候珠也。 望江南闭舌下窍，通胆气。 黄中宝，须向胆中求。 春风令人生万物，乾坤膝下与吾俦，百脉自通流。 施造化，左右火双抽。 浩浩腾腾光宇宙，苦烟烟上霭环楼，夫妇渐相谋。 中黄宝须向胆中求 天一生气，名曰中黄。 其气藏于胆，以为性命之根元。 其味苦，至如无知花木根蒂之味亦苦，乃知万物非生气不能生也。 内丹之药先闭舌下两窍，内通胆中生气，至喉舌之间，有微微苦味，是生气通流。",
      "translated_text": "When the elixir completes its eighth revolution, the earth-belt arises within the navel, and if elixir-fire still causes heat, with the five viscera parched and dry, close the eyes and sit in repose. Connect the earth-belt beneath the Flowery Pond, allowing the breath to circulate internally, flowing and pervading through the revolving Dao. After closing the breath, the true water of the elixir field gradually increases day by day. By the ninth day, the spirit-water ascends to the Twelve-Storied Tower, and the elixir-pearl conceals itself within the spirit-water, expelling the fire-toxin. Thereafter, no further affliction of dryness arises. At midnight on the ninth night, close the breath and draw the spirit-water from the Mud-Pill Palace, passing through the Spine-Strap back to the elixir field to complete the work.\n\n**Ninth Revolution:**\nWhen the work of nine revolutions is done,\nthe Dao-fruit of carefree wandering is complete.\nWith three thousand merits of conduct,\none becomes an immortal.\nGolden writ and jade tablets proclaim the imperial decree,\nfeet treading auspicious clouds to pay homage in the Nine Heavens.\n\n**Explanation:**\nWhen the elixir completes its ninth revolution, the transformation is perfected, and the Dao-fruit is fully realized. Only after accumulating three thousand merits of external conduct and fulfilling the external fruit can one ascend. Thus, after refining his elixir, Master Xu of Jingyang eradicated the harm of flood dragons before ascending. After refining his elixir, Sun Simiao healed the ailments of ten thousand people before ascending. All must establish merit and achieve renown before ascending. On the day of ascension, celestial music arrives in welcome, with flutes and zithers harmonizing to pass through the Heavenly Gate. According to one’s merits and conduct, one is ranked among the immortals, joining the celestial ranks to endure as long as heaven and earth.\n\n**Internal Elixir Secrets: Nine Revolutions of the Golden Elixir**\n*Composed by Chen Puchong of the Mud-Pill Tradition*\n\n**First Revolution Song:**\nBeneath the tongue lie four apertures,\ntwo linking to the heart, two to the fluids.\nThe work of the first revolution resembles a precious pearl,\npermeating mountains, rivers, and the cosmos with a numinous body.\nBeneath the red lotus leaves lies the elixir-cavern,\ncrimson water flowing through the nine-marked pearl.\n\nThe work of the first revolution resembles a precious pearl.\nThe true water of Heavenly One is stored in the gallbladder,\nwhere yin and yang harmonize and descend as the elixir,\nappearing like a single dewdrop.\nThe work of the inner elixir begins with one and is completed in nine.\nOne is the origin of all things.\nHeavenly One generates water, earthly two generates fire,\nheavenly three generates wood, earthly four generates metal,\nheavenly five generates earth.\nThe sequence of the five phases begins with one,\nthus the work of the inner elixir also begins with one.\nIt is completed in nine revolutions, for nine is the utmost of yang numbers.\nWhen the number reaches nine, the Dao-fruit is achieved.\nThe \"precious pearl\" refers to the true water of Heavenly One stored in the gallbladder,\nwhere yin and yang harmonize and descend as the elixir.\nIts initial descent resembles a single luminous dewdrop.\nThe pearl is cherished as the elixir.\n\n**Permeating mountains, rivers, and the cosmos with a numinous body:**\nThe human body arises from the union of father’s essence and mother’s blood—this is the union of forms.\nThe elixir descends from the union of heart-fire and kidney-water—this is the union of qi.\nWhen the elixir descends, the spirit roams beyond the mundane,\nyin and yang achieve great harmony,\nand one forgets the body entirely.\nHeaven and earth, mountains and rivers,\nthe six directions and the myriad things\nall reside within this body,\nwhile this body exists beyond heaven and earth.\nOne only perceives within a single point of radiance like the sun—\nthis is the descent of the elixir.\nThe human body arises from the union of father’s essence and mother’s blood—this is the union of forms.\nThe descent of the elixir arises from the union of heart-fire and kidney-water—this is the union of qi.\nThus it is said: the union of forms gives birth to humans,\nwhile the union of qi forms the elixir.\nAfter the elixir descends, the spirit roams beyond the mundane,\nyin and yang achieve great harmony,\nand one sits in forgetfulness of the body.\nHeaven and earth, mountains and rivers,\nthe six directions and the myriad things\nall reside within this body,\nwhile this body exists beyond heaven and earth.\nOne only perceives a single point of radiance within the heart—\nthis is the descent of the elixir.\nThus it is said: *permeating mountains, rivers, and the cosmos with a numinous body.*\nThe body encompasses mountains and rivers within itself.\n\n**Beneath the red lotus leaves lies the elixir-cavern:**\nBeneath the tongue lie two apertures,\nthe left connecting to the heart, the right to the gallbladder.\nTrue qi flows to communicate with the spirit.\nThus, when the human body is unwell, the fluids beneath the tongue dry up,\nfor the true qi is depleted.\nAt the outset of the first revolution,\nthe tongue seals these two apertures,\npreventing the true qi from leaking outward\nand enabling the spirit-water to flow.\nThe \"red lotus\" refers to the tongue.\nFrom the two apertures, one connects to the heart, the other to the fluids.\nWhen one is ill, the fluids beneath the tongue dry up, and the true qi is depleted.\nAt the outset of the first revolution, the tongue seals these two apertures,\npreventing the true qi from leaking outward\nand enabling the spirit-water to flow.\n\n**Crimson water flowing through the nine-marked pearl:**\nThe crimson water is the fluid.\nAt the beginning of the nine revolutions,\nevery nine days, perform nine subtle breaths.\nWith each breath, take nine sips,\nnaturally allowing the fluids to flow,\narising from the tongue to irrigate the five viscera—\nthese are the nine marks.\nThe \"crimson water\" is the fluid of the heart.\nAt the beginning of the nine revolutions,\nevery nine days, take nine breaths,\nwith each breath taking nine sips.\nNaturally, the fluids flow from beneath the tongue\nto irrigate the five viscera—\nthus it is called the nine-marked pearl.\n\n**Song of Gazing at the River South:**\nSeal the apertures beneath the tongue to connect with the gallbladder’s qi.\nThe treasure of the Yellow Center must be sought within the gallbladder.\nThe spring wind brings forth the myriad things,\nwhile beneath heaven and earth, it is my companion.\nThe hundred meridians flow naturally.\nIt enacts transformation,\ndrawing the paired fires from left and right.\nVast and billowing, it illuminates the cosmos,\nascending in wispy smoke to encircle the tower,\nas the couple gradually conspire.\n\n**The treasure of the Yellow Center must be sought within the gallbladder:**\nThe qi of Heavenly One is called the Yellow Center.\nThis qi is stored in the gallbladder,\nserving as the root of life and destiny.\nIts flavor is bitter,\njust as the roots and stems of plants and trees are also bitter—\nthus it is known that nothing can grow without the generative qi.\nFor the medicine of the inner elixir,\nfirst seal the two apertures beneath the tongue,\ninternally connecting to the generative qi of the gallbladder.\nWhen a faint bitterness arises between the throat and tongue,\nthe generative qi is flowing.",
      "overlap_context": " reaches the eighth revolution,\nit arises from the heart,\nconstantly entering and exiting through the nose,\never manifesting as black and red qi—\nthus it is said: *Qi ever-spouting.*\nThe affliction of elixir-fire\nis tempered by circulating spirit-water,\nleaving no sign of elixir-heat.\nThe elixir is the heart-pearl,\nthe monkey-grandson of the heart;\nthe red turtle is the fire-spirit.\nThe elixir floats within the water,\nlike a turtle swallowing water—\nthis describes its form.\n\n*Oral Instructions:*",
      "start_char": 7588,
      "end_char": 8892,
      "start_sentence": 368,
      "end_sentence": 436,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.144779205322266,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "然后求神为丹也。 天一生气，名曰中黄。 其气藏之于胆，以为性命之根，其味苦。 故人之胆气味亦苦。 如草木之根华其味亦苦，乃知万物非生气不能生也。 内丹之药先闭舌下之窍，内通胆中生气至喉舌之间，微觉味苦，是丹气流通。 然后汞水凝结而成丹也。 春帝令行生万物 万物得春气方生，人能通胆之气，然后内丹成就。 天地生气萌之于春，万物得生气，然后能生人之得生气，藏之于胆。 人能通胆之气，然后内丹成就一转之功，如四时之春也。 乾坤膝下与吾俦百脉自通流 生气上行，口中觉苦，阴阳太和，神居天外，则天地四海如在吾膝下。 浩然之气塞乎天地，百脉流通，万窍开张，内丹降也。 生气上行其中觉苦，阴阳太和，神居天外则天地四海亦在吾膝下。 浩然之气塞乎天地，百脉通流万窍施张。 内丹降也。 施造化左右火双抽 下手之初，先闭舌下两窍，不令气泄于外。 左右两窍之气自内而上行，左贯左太阳而入脑，右右俱过脑至顶心。 泥丸宫合成一处，下重楼十二环，入心经传入胆，冲开胆窍，使胆中生气上行，随心胆之脉，贯于舌窍，使舌觉有苦味，乃是生气流注将欲降丹也。 造化言者，其下手之初也。 先闭舌下两窍，不令气泄于外。 其左边之气贯于左太阳而入脑，右边之气贯于右太阴而入脑，左右俱过脑。 而入顶泥丸宫合成一处，下重楼十二环，入心经、传入胆冲开胆窍。 使胆中生气，上行随心胆之脉，贯于舌窍、觉舌有苦味，乃是生气注将欲降丹也。 浩气腾腾充宇宙，苦烟袅袅上环楼 胆窍既开，则生气袅袅，上重楼十二环，入于舌窍之下，满口觉苦，乃是生气流通之验也。 然后闭定舌窍左右之气上行，故有腾腾之状也。 胆窍即闭，则生气袅袅，上重楼十二环，自舌下之窍而升，满口觉苦乃是生气流通也。 夫妇渐相谋 生气通流，则阴阳大和，心肾交媾，故曰渐相谋也。 夫妇者阴阳也，夫者阳也，妇者阴也，生气流通则阴阳太和，心肾交媾故曰渐相谋也。 口诀 行持下手之初，先须饮食养和五藏，不可失去饥过饱，心田安静无忧无虑，乃可入道也。 行持下手之初，先须饮食以和五藏，不可饥不可饱，心田安静无忧无虑，乃可入道。 凡于二更尽三更初，先须洗漱，于静室烧香，盘膝坐，闭目存神。 凡于二更尽、三更初当洗漱，定神入室，烧香盘膝而坐，闭目存神。 候息出入，调匀，以舌倒卷塞定舌根两窍，闭息渐次，觉左右太阳经有两道气，从大牙根下贯太阳入顶门，至泥丸宫，即为一次。 候息出入调匀，以舌先倒卷定舌根两窍闭息。 渐觉左右太阳经有两道气大牙根冲上，贯二太阳，次入顶门，觉二气交合，即为一次。 却开眼良久，再闭目存神，依前卷舌，候气至泥丸宫，即止。 如此每夜行三次。 却闭眼良久，亦闭目依前卷舌，候至泥丸宫止，如此每夜行三次即止。 行数夜或旬日或半月，渐觉气到泥丸宫，后流入脑下重楼十二环，过夹脊串尾闾到上，真气入心贯胆，觉胃中温温，微觉意思和畅，乃是真气降也。 行至数夜或数日之间，渐觉泥丸宫次流入脑，下重楼十二环，透夹脊串尾闾，复次前冲心贯胆，脐胃中温温，微觉意思和畅，乃真降也。 如此又行数夜，后渐觉气到心，后微觉温温，或心头气微动动，却有温气后心而上，过重楼入舌下。",
      "translated_text": "Then seek the spirit to become the elixir.\nThe qi of Heavenly One is called the Yellow Center.\nThis qi is stored in the gallbladder,\nserving as the root of life and destiny.\nIts flavor is bitter—\nthus the qi and flavor of the human gallbladder are also bitter.\nJust as the roots and blossoms of plants and trees are bitter,\nit is known that nothing can grow without the generative qi.\n\nFor the medicine of the inner elixir,\nfirst seal the two apertures beneath the tongue,\ninternally connecting to the generative qi of the gallbladder.\nWhen a faint bitterness arises between the throat and tongue,\nthe elixir qi is flowing.\nThen the mercury-water congeals to form the elixir.\n\nThe decree of the Spring Lord brings forth the myriad things—\nall things receive the spring qi before they can grow.\nWhen one connects to the qi of the gallbladder,\nthe inner elixir is accomplished.\nThe generative qi of Heaven and Earth sprouts in spring;\nall things receive this generative qi before they can grow.\nHumans, too, receive this generative qi,\nstoring it in the gallbladder.\nWhen one connects to the qi of the gallbladder,\nthe inner elixir achieves the first turning of its work,\nlike the spring of the four seasons.\n\nHeaven and Earth lie beneath my knees,\nas the hundred vessels flow freely.\nThe generative qi ascends,\nand bitterness is sensed in the mouth.\nYin and Yang achieve great harmony,\nand the spirit dwells beyond the heavens—\nthen the four seas and all under heaven lie beneath my knees.\nThe vast qi fills Heaven and Earth,\nthe hundred vessels flow freely,\nand the myriad apertures open wide,\nas the inner elixir descends.\nThe generative qi ascends within,\nand bitterness is sensed—\nYin and Yang achieve great harmony,\nand the spirit dwells beyond the heavens—\nthen the four seas and all under heaven lie beneath my knees.\nThe vast qi fills Heaven and Earth,\nthe hundred vessels flow freely,\nand the myriad apertures open wide,\nas the inner elixir descends.\n\nAt the outset of practice,\nfirst seal the two apertures beneath the tongue,\npreventing the qi from leaking outward.\nThe qi of the left and right apertures rises from within:\nthe left passes through the left Greater Yang to enter the brain,\nwhile the right, together with the left, traverses the brain to reach the crown.\nIn the Mud Pill Palace, they merge as one,\nthen descend the Twelve-Storied Tower,\nentering the Heart Channel and passing into the gallbladder,\nwhere they surge open the gallbladder’s aperture,\ncausing the generative qi within to ascend.\nFollowing the vessels of the heart and gallbladder,\nit pierces the tongue’s aperture,\nand the tongue senses a bitter flavor—\nthis is the generative qi flowing,\nabout to descend the elixir.\n\nAt the outset of practice,\nfirst seal the two apertures beneath the tongue,\npreventing the qi from leaking outward.\nThe qi on the left pierces the left Greater Yang to enter the brain,\nwhile the qi on the right pierces the right Greater Yin to enter the brain.\nLeft and right together traverse the brain,\nentering the crown’s Mud Pill Palace to merge as one,\nthen descend the Twelve-Storied Tower,\npassing through the Heart Channel into the gallbladder,\nwhere they surge open the gallbladder’s aperture.\nThe generative qi within the gallbladder ascends,\nfollowing the vessels of the heart and gallbladder\nto pierce the tongue’s aperture.\nWhen the tongue senses a bitter flavor,\nthis is the generative qi flowing,\nabout to descend the elixir.\n\nVast and billowing, it fills the cosmos;\nwispy smoke ascends to encircle the tower.\nOnce the gallbladder’s aperture opens,\nthe generative qi rises in wisps,\nascending the Twelve-Storied Tower\nto enter the aperture beneath the tongue.\nThe mouth senses bitterness—\nthis is the sign of the generative qi flowing.\nThen, sealing the tongue’s apertures,\nthe qi on left and right ascends,\ncreating a billowing effect.\nOnce the gallbladder’s aperture closes,\nthe generative qi rises in wisps,\nascending the Twelve-Storied Tower\nthrough the aperture beneath the tongue.\nThe mouth senses bitterness—\nthis is the generative qi flowing.\n\nThe couple gradually conspire.\nWhen the generative qi flows freely,\nYin and Yang achieve great harmony,\nand the heart and kidneys unite in congress—\nthus it is said they gradually conspire.\nThe couple represents Yin and Yang:\nthe husband is Yang, the wife is Yin.\nWhen the generative qi flows freely,\nYin and Yang achieve great harmony,\nand the heart and kidneys unite in congress—\nthus it is said they gradually conspire.\n\n**Oral Instructions:**\nAt the outset of practice,\nfirst regulate diet to harmonize the five viscera,\navoiding hunger or overfullness.\nThe field of the heart must be tranquil,\nfree from worry or distraction—\nonly then can one enter the Dao.\n\nAt the outset of practice,\nfirst regulate diet to harmonize the five viscera,\nneither hungry nor overfull.\nThe field of the heart must be tranquil,\nfree from worry or distraction—\nonly then can one enter the Dao.\n\nWhen the second watch ends and the third begins,\nfirst wash and rinse,\nthen enter a quiet chamber to burn incense.\nSit cross-legged, close the eyes, and concentrate the spirit.\nWhen the breath is even,\ncurl the tongue back to seal the two apertures at its root,\ngradually holding the breath.\nSense the two channels of qi in the Greater Yang meridians,\nrising from the roots of the molars\nto pierce the Greater Yang and enter the crown,\nreaching the Mud Pill Palace—\nthis counts as one cycle.\n\nWhen the breath is even,\nfirst curl the tongue back to seal the two apertures at its root,\ngradually holding the breath.\nSense the two channels of qi in the Greater Yang meridians,\nrising from the roots of the molars\nto surge upward, piercing the two Greater Yangs,\nthen entering the crown.\nWhen the two qi merge,\nthis counts as one cycle.\n\nThen open the eyes for a while,\nclose them again to concentrate the spirit,\nand curl the tongue as before,\nwaiting for the qi to reach the Mud Pill Palace before stopping.\nDo this three times each night.\nThen close the eyes for a while,\nagain curling the tongue as before,\nwaiting for the qi to reach the Mud Pill Palace before stopping.\nDo this three times each night.\n\nAfter several nights, or ten days, or half a month,\ngradually sense the qi reaching the Mud Pill Palace,\nthen flowing into the brain,\ndescending the Twelve-Storied Tower,\npassing through the spine to thread the tailbone and rise upward.\nThe true qi enters the heart and pierces the gallbladder,\nwarming the stomach with a gentle heat,\nbringing a subtle sense of harmony and ease—\nthis is the true qi descending.\n\nAfter several nights or days,\ngradually sense the qi reaching the Mud Pill Palace,\nthen flowing into the brain,\ndescending the Twelve-Storied Tower,\npiercing the spine to thread the tailbone and rise forward.\nIt enters the heart and pierces the gallbladder,\nwarming the navel and stomach with a gentle heat,\nbringing a subtle sense of harmony and ease—\nthis is the true descent.\n\nAfter several more nights of practice,\ngradually sense the qi reaching the heart,\nthen a gentle warmth,\nor a faint stirring of qi at the heart’s center.\nA warm qi then rises behind the heart,\npassing the Twelve-Storied Tower\nto enter beneath the tongue.",
      "overlap_context": " called the Yellow Center.\nThis qi is stored in the gallbladder,\nserving as the root of life and destiny.\nIts flavor is bitter,\njust as the roots and stems of plants and trees are also bitter—\nthus it is known that nothing can grow without the generative qi.\nFor the medicine of the inner elixir,\nfirst seal the two apertures beneath the tongue,\ninternally connecting to the generative qi of the gallbladder.\nWhen a faint bitterness arises between the throat and tongue,\nthe generative qi is flowing.",
      "start_char": 8892,
      "end_char": 10209,
      "start_sentence": 437,
      "end_sentence": 483,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.224546194076538,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "渐觉口中微苦，乃是中黄之气自胆而出，阴阳大和，将有降丹之象也。 如此后则数夜渐觉气到心，次微觉温温或心头气渐动，却有温气从心而上，过重楼口觉微苦。 是中黄气自胆而出阴阳大和，将有降丹之象。 如此之后，每夜行持之初，令一人在门外，以绝入来之人及猫狗等，恐忽然相惊故也。 至每夜行三次时，于坐前横一几，忽行气间，觉身体渐大，精神腾腾，渐见住宅与诸城市天地皆在身内。 一身上觉充天，下觉塞地，手足皆不知所在，乃急以手按几，闭目只觉心头微一块光明，团圆如日，忽然坠落，乃是丹降也。 如此之后，每夜行持之初，令一人在门外，拦人进入及猫狗等，恐忽然相惊。 至每夜行三两次时，于坐前横一几，忽然气冲，觉身体渐大，精神腾腾，渐见屋舍、人物、山河、皆在我身之内。 手足皆不知所在，次急以手按几，闭目大觉，心头微一块光明，团圆如日，忽然坠下丹田，此乃降丹也。 丹降之后，不可便开眼，渐渐收拾精神，却归四体。 手足却复旧，或觉手足微麻。 定省多时，然后开眼，吃人参汤，乃睡至来日。 吃粥食将怠一二日，如丹降毕功也。 丹降之后百病消除，更无疾苦之厄也。 丹降之后，未得便开眼，且渐渐收拾精神归定。 四体复旧，或手足觉麻痹，次候定醒，然后开眼，次吃人参汤睡。 至来早吃粥食将养一二日，如丹降也。 丹降之后百病消除，更无疾苦之厄也。",
      "translated_text": "Gradually, a faint bitterness arises in the mouth—this is the Central Yellow qi emerging from the gallbladder. Yin and yang achieve great harmony, and the descent of the elixir is imminent.\n\nAfter several nights, the qi once more reaches the heart, followed by a gentle warmth, or a faint stirring of qi at the heart’s center. A warm qi then rises from the heart, passing the Twelve-Storied Tower, and the mouth senses a slight bitterness. This is the Central Yellow qi emerging from the gallbladder, yin and yang in perfect harmony, and the descent of the elixir is imminent.\n\nBefore each night’s practice, have someone stand guard outside the door to prevent anyone from entering, as well as cats, dogs, or other creatures, lest they startle you unexpectedly. When practicing three times each night, place a low table before you as you sit. During the circulation of qi, you may suddenly feel your body expanding, your spirit soaring, until gradually your dwelling, the cities, the entire world—all seem to lie within you. Above, you feel as vast as the heavens; below, as boundless as the earth. Your hands and feet seem to vanish—then quickly press your hands upon the table, close your eyes, and you will sense a small, radiant orb of light at your heart, round as the sun. Suddenly, it descends—this is the elixir descending.\n\nBefore each night’s practice, station someone outside the door to bar entry to people, cats, dogs, or other creatures, lest they startle you unexpectedly. When practicing two or three times each night, place a low table before you as you sit. Suddenly, the qi surges, and you feel your body expanding, your spirit soaring, until gradually your home, all people, mountains, and rivers seem to lie within you. Your hands and feet seem to vanish—then quickly press your hands upon the table, close your eyes, and you will sense a small, radiant orb of light at your heart, round as the sun. Suddenly, it descends into the Cinnabar Field—this is the descent of the elixir.\n\nAfter the elixir descends, do not open your eyes at once. Gradually gather your spirit, returning it to your limbs. Your hands and feet will feel as they did before, though they may tingle slightly. Remain composed for some time, then open your eyes and drink ginseng broth before sleeping until the next day. Eat congee and rest for a day or two—this completes the descent of the elixir.\n\nOnce the elixir has descended, all illnesses vanish, and no suffering or affliction remains.\n\nAfter the elixir descends, do not open your eyes immediately. Slowly gather your spirit and settle it, allowing your limbs to return to their former state. Your hands and feet may feel numb—wait until you are fully composed, then open your eyes. Drink ginseng broth and sleep. The next morning, eat congee and rest for a day or two—this is the descent of the elixir. Once the elixir has descended, all illnesses vanish, and no suffering or affliction remains.",
      "overlap_context": "-Storied Tower,\npiercing the spine to thread the tailbone and rise forward.\nIt enters the heart and pierces the gallbladder,\nwarming the navel and stomach with a gentle heat,\nbringing a subtle sense of harmony and ease—\nthis is the true descent.\n\nAfter several more nights of practice,\ngradually sense the qi reaching the heart,\nthen a gentle warmth,\nor a faint stirring of qi at the heart’s center.\nA warm qi then rises behind the heart,\npassing the Twelve-Storied Tower\nto enter beneath the tongue.",
      "start_char": 10209,
      "end_char": 10759,
      "start_sentence": 484,
      "end_sentence": 501,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.925909280776978,
      "metadata": {
        "source_file": "dao\\藏外\\九转金丹秘诀.txt",
        "category": "藏外"
      }
    }
  ]
}