{
  "source_id": "了明篇",
  "source_file": "chunked_daozang\\了明篇.json",
  "total_chunks": 6,
  "total_original_chars": 4619,
  "total_translated_chars": 25942,
  "total_translation_time": 148.5826325416565,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\众术类\\了明篇.txt",
    "category": "众术类"
  },
  "full_translation": "**The Illuminating Treatise**\n\n*The Illuminating Treatise*. Composed by Master Song, compiled by Mao Rixin, originating from the Southern Song dynasty. One fascicle.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Miscellaneous Arts* Category.\n\n**The Illuminating Treatise**\nComposed by Master Song\n\n**Preface to The Illuminating Treatise**\n\nIt has often been said that to be born into this world is no easy matter. Clothed by heaven and treading upon earth, endowed with a spirit surpassing all things—yet most spend their days in the pursuit of fame and profit, chasing falsehoods and losing their true nature. Even unto death, they never hear of the Dao, wasting their lives without the slightest awakening. How lamentable!\n\nYet consider this: even the sage Confucius declared, *\"If one could hear the Dao in the morning, one might die content that evening.\"* If even a sage of Confucius’ stature was so urgent in seeking the Dao, how much more should we?\n\nThe Dao I speak of is the Great Dao. Why? It is impartial, not self-serving; upright, not deviant. It emerges from the undivided state of primordial simplicity, predating the birth of the Three Luminaries. Silent and soundless, formless and beyond perception—yet if one approaches it with reverence, it is not distant from humankind. This is no mere side discipline or heterodox art that deludes the world.\n\nThe Dao, in truth, has no name. People, however, impose many names upon it by attaching it to things. Yet its wondrous essence stands alone, profound and unknowable, beyond the reach of words. By fortune, I encountered Master Song in the region of Yun. He recounted his own experience:\n\n*\"I received oral instructions from the lineage of Zhong and Lü, practicing the work of returning to the root and restoring life, cultivating the Dao of replenishing the brain and refining essence. Through the refinement of the Two Substances, the Great Elixir is formed. With a single dose, yin is exhausted and yang perfected. The Three Fields darken, and a body appears beyond the body. When merit is complete and conduct fulfilled, one sheds the mortal shell and ascends as an immortal.\"*\n\nMaster Song further said: *\"The celestial mechanism is not far—it lies right before our eyes. If one can steadfastly guard the heart and sever all doubt, the Dao will surely be attained.\"*\n\nI here present the songs and verses composed by Master Song, along with thirty poems by Langranzi in harmonious response—words plain yet profound in meaning, lines lucid yet complete in the Dao. With reverence, I received and bowed to receive them. Thus, I compiled them into a single collection, entitled *The Chapter of Clarity*. I dare not treasure it solely within my household, but wish to share it with all. May those gentlemen of discernment not begrudge a careful reading.\n\nRespectfully inscribed on the first day of the tenth month, in the fourth year of the Qiandao era, by Mao Rixin of Sanqu.\n\n---\n\n**The Chapter of Clarity**\n*Composed by Master Song*\n\n**Song of the Encounter with the True**\nIn the yiyou year, the fourth month’s midst,\nI met Lord Zhongli again in broad daylight.\nOral instructions conveyed the wondrous Dao,\nThree thousand days and nights built the merit’s height.\n\nGrateful to the patriarch for the secret transmission,\nNever idly spoken to the unwise in vain.\nSilent cultivation’s deeds are known to Heaven,\nCareless leaks invite the underworld’s disdain.\n\nSeal the Golden Gate, prevent all leakage,\nPierce the Twin Passes to set sun and moon in motion.\nHolding light in silence, return to the Muddy Pellet,\nSpirit and qi ascend to the Celestial Palace’s station.\n\nThe true fire in the crucible blazes fiercely,\nRefining true gold white as snow.\nYin and yang harmonized, the yang spirit appears,\nSeated beyond, its radiance pure and bright.\n\nThe Three Fields darken, essence and spirit whole,\nOne knows their name as an immortal’s role.\nThe work of undying is distinct in kind,\nThe unbreached elixir’s formula sworn not to unwind.\n\nWithin the gourd, immortal scenes unfold,\nThe cavern’s true one ever youthful, untold.\nPurple mists and crimson light fill the chamber,\nWind and thunder, lightning flash before the timber.\n\nOne day, shedding the shell, leaving dust behind,\nLeaping from the mortal cage to ascend on high.\n\n**Song of Dispelling Delusion**\nThe Dao is not far—it dwells in the Muddy Pellet,\nHeed not the idle words of those who prattle.\nThough you peruse ten thousand scrolls of immortal lore,\nClearly they speak but of mercury and lead evermore.\n\nTo keep true essence from leaking away,\nStill the numinous terrace like the bright moon’s ray.\nIf the numinous terrace is not still, the spirit stays dim,\nDay and night, the work must never grow slim.\n\nNever grow slim, but practice with diligence,\nWhen the Three Fields are full, merit is complete in essence.\nWhen merit is complete, the spirit is refined,\nAnd once refined, long life is thine to find.\n\nPractitioners of the true, heed these words,\nGuard well the immortal’s wondrous transmission.\nThe secret celestial mechanism must not be revealed,\nFor leaks bring harm upon your ancestors’ field.\n\nI urge all in the world to rouse their will,\nFor each has the share to become immortal still.\n\n**Thirty Poems in Response to Langranzi on Advancing the Dao**\n\n**I**\nTo learn the Dao, fifty years must be firm,\nThrough nights, sit upright, forsake sleep’s term.\nPierce the Twin Passes to Kunlun’s crest,\nThe nine orifices open, transformation’s behest.\n\nThe jade hare runs to the northern sea,\nThe golden crow flies into the cavern’s sky.\nThe knife’s edge is the elixir of life,\nConsumed, the mortal womb yields to the immortal’s strife.\n\n**II**\nIn quiet night, radiance and spring’s scene,\nPerfect clarity, at ease, the original true within.\n...\n\n**III**\nIn profound darkness, within, observe the stars,\nIn fleeting visions, behold the Master’s form.\nThe golden crucible flames, suspending the crimson sun,\nThe Yellow River surges, drumming the dark ford.\nOnce the precious pearl is refined and work complete,\nA radiant golden light renews atop the crown.\n\n**IV**\nIn stillness sit, refine the mind within the chamber,\nLet not the iron ox wander east or west.\nThe tiger’s roar on the mountain peak—none see,\nThe dragon’s chant beneath the sea—scenes unlike.\nQi ample, the form never ages,\nSpirit whole, the visage returns to youth.\nPity those who covet profit and fame,\nFor in a moment, all turns to emptiness.\n\n**V**\nBefore your eyes, white snow scatters in chaos,\nYellow blossoms transform into purple clouds.\nAtop the crown, mountain springs echo anew,\nIn the ears, celestial music heard each day.\nThe cinnabar field holds the elixir of longevity,\nWho on this body lacks the marks of kalpas past?\nThis truth few in the world comprehend,\nYet how many graves lie beyond the city walls.\n\n**VI**\nDo not envy glory, learn the immortal’s art,\nFor attaining the Dao begins here.\nWithin the crucible, lead births the great medicine,\nIn the furnace, mercury ripens into the sacred embryo.\nYang essence unspilled, the body knows no death,\nTrue breath ever present, the black returns to white.\nBlend with the world, harmonize your light,\nLet others mock as fools and dullards.\n\n**VII**\nOnce the mystery is grasped, all things cease,\nSpring departs and returns, yet none constrain.\nDrink the jade nectar, the form defies age,\nSeize the golden essence, life is unbound.\nMoon’s soul and sun’s spirit ever unite,\nInfant boy and maiden girl in tender union.\nDeep in night, seated where the elixir burns,\nTen thousand bright stars crown the canopy.\n\n**VIII**\nFor ten springs, cultivate qi as it comes,\nBy the master’s guidance, the mystery’s gate attained.\nTake wu and ji as crucible and cauldron,\nDiscerning the cyclical signs of dawn and dusk.\nPrimordial qi fills, the belly full,\nTrue yang stirs, warming the body through.\nGrateful for the master’s transmission of life and death,\nHow could eons repay such grace?\n\n**IX**\nQi enters the cinnabar field, fire arises,\nBetween the brows, lightning’s brilliance glows.\nThe two qi circulate, heaven and earth unite,\nThe three palaces turn, sun and moon traverse.\nRefining the yang spirit, life’s domain expands,\nCultivating the supreme treasure, primordial essence restored.\nThough hair whitens and visage fades,\nConsuming the golden elixir, youth returns.\n\n**X**\nOnce work is done, names inscribed in celestial ranks,\nWho realizes enlightenment was never hard?\nDivine fire ascends, heaven and earth at peace,\nYin and yang harmonize, the valley spirit rests.\nTo restore youth, no common medicine needed,\nTo reverse age, no external elixir sought.\nIn stillness, gaze upon scenes beyond the dust,\nIn the world, none compare to these myriad forms.\n\n**XI**\nDare not speak of heaven’s mechanism to others,\nRefining the false into true, kalpas endure.\nRed mercury, black lead—the alchemical base,\nGolden crow, jade hare—the elixir’s root.\nWork complete, one must return to Peng Isle,\nVirtue perfected, audience with the Emperor sought.\nA thunderclap strikes—gods and ghosts tremble,\nTen thousand rays of rosy light illuminate heaven and earth.\n\n**XII**\nIn secret, cultivate amidst the world’s dust,\nLabor diligently, never idle.\nOften retreat in seclusion,\nNo need to wander into distant mountains.\nGolden grains frequently consumed, bones and marrow firm,\nJade nectar sipped often, the countenance preserved.\nNow I have grasped the elixir of immortality,\nIn the furnace, the nine-times-cycled pill refined.\n\n**XIII**\nThe Dao’s subtlety delves deepest truth,\nTo cultivate the real, resolve must be firm.\nThe Yellow River’s course runs through the celestial path,\nThe vermilion towers melt into a crucible of gold.\nTo advance the fire, no quiet chamber needed,\nTo seek immortality, no secluded woods required.\nWithin the body lies the elixir of longevity,\nHow laughable the fool who seeks it without.\n\n**XIV**\nFree from greed, free from attachment—better than mountain dwelling,\nUnburdened by idle sorrows, the mind at ease.\nHaving met the perfected one, received the oral transmission,\nWhy pore over ten thousand scrolls?\nTime is limited, hastening like an arrow,\nEach year added, one year less remains.\nI urge the world to awaken early,\nThose who neither cultivate nor refine are fools.\n\n**XV**\nThe three fields’ yin exhausted, pure yang restored,\nThe two substances simmered, the true nurtured.\nVirtue profound, gods and ghosts submit,\nThe Dao lofty, its verses astonish.\nDeep in night, seated, observe the divine sword,\nCountless yin demons flee far from the body.\nMercury refined into cinnabar, age undone,\nLifespan aligned with heaven and earth, the visage ever new.\n\n**XVI**\nIn youth, indolent toward scholarly arts,\nTwo decades and more, years idly spent.\nNo intent to chase fame or profit,\nOnly the heart set on ascending the void.\nMeeting the elixir’s measure, the face like jade,\nPassing through golden essence, the visage at ease.\nUnknowing of root, lineage, and ancestors,\nSwallowing saliva, circulating qi—how trivial.\n\n**XVII**\nThe twin passes flank the spine to the mud-pill palace,\nSpirit and qi flow freely, the countenance preserved.\nA myriad acres of gold unfold the cosmos,\nTwo wheels of sun and moon pierce the passes.\nThe river chariot’s conveyance must not halt,\nThe work of advancing fire must not rest.\nRefine your own true great medicine,\nAlready your name emerges beyond the dust.\n\n**XVIII**\nRecognize the profound mystery, abandon delusion,\nWork complete, conduct perfected, attain non-action.\nFrequently swallow jade dew, nourishing form and substance,\nAble to drink celestial nectar, quenching thirst and hunger.\nThe two qi unite, birthing the maiden girl,\nThe five phases match, nurturing the infant boy.\nKnowing the truth of heaven’s mechanism,\nShedding the shell to ascend as immortal is certain.\n\n**XIX**\nTo seek immortality, why search for external elixirs?\nBetter to preserve essence, return qi to its source.\nMarrow full, naturally no aging or death,\nYang pure, surely the visage of youth.\nGolden gate and jade door must be tightly sealed,\nThe crucible’s simmering work must not cease.\nOnce the luminous pearl stirs into motion,\nLightning’s radiance flashes between the brows.\n\n**XX**\nThe great Dao is not difficult—seek with resolve,\nWho would undertake cultivation in youth?\nHuman life’s illusions—what endures?\nWealth and honor—how many autumns gained?\nA century’s span is but a dream,\nPity those who drift with the waves.\nWhen will the craving for wealth and lust cease?\nNot until the bones lie bare.\n\n**XXI**\nFor twenty autumns, I have studied the Dao,\nThe world’s vulgar scenes now appear as straw.\nSimply practice the seven returns, replenishing essence and marrow,\nEver making the Yellow River’s waters flow backward.\nTen thousand volumes of immortal scriptures—what need to read?\nA single gourd of celestial wine—drunk to the full.\n\nOne dawn, with a sweep of the sleeve, I ascend into empty space,\nBeyond the world’s bounds, carefree—what sorrow remains?\n\n**XXI**\nI speak of *Nanhua* yet bear a name,\nWithout a master’s guidance, the Dao is hard to attain.\nStealing the green of sun and moon to link heaven and earth,\nRefining the returning elixir to transcend death and life.\nYin conceals yang’s birth—none understand,\nFrom nothing, something arises—this is true essence.\nThe master teaches me the art of spirit’s departure,\nEyes closed, Penglai lies but a finger’s span away.\n\n**XXII**\nAfter swallowing the Jade Pool’s draught, I gaze toward Pengying,\nTen thousand miles shrink to a single league’s journey.\nWith the medicine complete, I ride clouds to the Jade Emperor’s court,\nMy work done, I mount a crane to bid farewell to the Three Pure Ones.\nOnly in practice is the truth revealed,\nReturning to the primordial to settle the boundless void.\nSuch is the study of immortality—truly worth pursuing,\nThrough a hundred thousand kalpas, eternally flourishing.\n\n**XXIII**\nAll cling to lust and wealth,\nUnwilling to turn their hearts toward the Dao.\nAs the body decays and death nears,\nThey chase fleeting joys, laughing and jesting in doubt.\nOnce qi scatters, how can it be sought again?\nWhen disaster strikes in a day, how can it be averted?\nTo be free of birth and death,\nClearly, creation lies within the spirit’s terrace.\n\n**XXIV**\nTo study immortality, study the Three Maos,\nIdle texts by the thousands—I grow weary of transcribing.\nHow much better to still the mind and refine the inner treasure,\nDeep in the night, the golden crucible where tiger and dragon unite.\nBoiling water and fire without cease,\nTempering cinnabar—how could it ever be set aside?\nAlready a guest of the Ten Isles and Three Mountains,\nSoon I shall sweep my sleeves and leave the dusty nest.\n\n**XXV**\nThe immortals know life without death,\nUnmoved as the years transform.\nAttaining the Dao, they return to heaven’s path,\nWhile the deluded sink into mud and sand.\nThe road to immortality lies before us,\nYet men’s hearts remain like yakshas.\nUnheeding, their lives end in the sea of suffering—\nReflecting, one can only sigh in sorrow.\n\n**XXVI**\nCountless seek the true yet know it not,\nReciting words they cannot put into practice.\nA thousand visions—all in vain,\nWasting effort through the fifth watch of night.\nIf one knows the master of qi’s circulation,\nAnd the root of essence’s movement,\nSuccess will surely bring ascension,\nFor the immortal ledger already bears their name.\n\n**XXVII**\nThough you read all the world’s books,\nNature and life remain untouched.\nHow much better to turn the heart toward the supreme Dao,\nGuarding the elixir furnace deep into the night without weariness.\nWhen the great medicine is refined, return to Peng Island,\nThe numinous cinnabar congealed, enter the great void.\nDo not say immortality is beyond reach—\nOnly because men’s hearts are too stubborn and dull.\n\n**XXVIII**\nEndlessly craving profit and fame,\nAll day indulging in reckless folly.\nHow much better to cultivate merit within,\nRefining the yang spirit to banish doubt and worry.\nDivine water frequently poured to nourish Dao-qi,\nNaturally, the countenance will never decay.\nOne day, summoned to the Jade Pool’s assembly,\nI shall keep company with immortals beyond the world’s bounds.\n\n**XXIX**\nThe Dao resides within—seek it not without,\nCultivation depends entirely on one’s own heart.\nWho recognizes dragon’s essence and tiger’s marrow?\nThe union of *Li* and *Kan*—profound is its principle.\nRefining the medicine relies on heaven’s fire,\nTempering the elixir requires the crucible’s gold.\nFools fail to grasp the mystery’s truth,\nBlindly poring over immortal scriptures—how can they fathom its sound?\n\n**XXX**\nThe *Weilü* unseals the nine palaces’ gates,\nInhaling and exhaling the primordial root of heaven and earth.\nThe wondrous double pass illuminates the *Jiaji*,\nThe two wheels of sun and moon race high.\nYang complete, yin exhausted, the three fields full,\nQi refined into spirit—stored through eons.\nWhen merit and practice are fulfilled, heaven’s decree arrives,\nTo become an immortal of the Ten Isles and Three Mountains.\n\nThirty poems, clear and resonant,\nExposing the Dao’s root in full.\nHeaven’s mechanism revealed to awaken men—\nYet how many fools refuse to study immortality?\n\n**Lyrics**\n*Sumuzhe*\n\n**Qi follows spirit, spirit follows qi,**\nSpirit and qi in mutual pursuit,\nPiercing through to the *Niwan* within.\nEver secure the Golden Gate with steadfast lock,\nSeizing the golden essence—\nIn secret, joy wells deep.\n\nLabor below with unflagging will,\nThrough all twelve hours,\nNever abandon your work.\nYin spent, yang complete—spirit leaves the body,\nWhen merit and practice are fulfilled,\nYour name is inscribed among the immortals’ ranks.\n\n**Chounuer**\nA true person was once but mortal flesh—\nWhat difficulty lies in awakening?\nYet fame and profit, like mountains,\nBar the path to and fro on the immortals’ road.\nGrateful for the master’s guidance on matters of life and death,\nEver ponder it in the heart.\nEver ponder it in the heart,\nThrough all twelve hours, never a moment’s rest.\n\n**Qinyuanchun**\nHasten, hasten to cultivate the Way,\nCherish the priceless treasure within your body.\nTake the golden crow and jade hare,\nRefine them in the crucible,\nFor yin and yang’s alchemy\nNurtures the yang spirit.\nTigers roar, dragons chant—\nWithin the *Dantian*,\nAtop the crown, celestial music sounds without cease.\nIn the *Niwan*,\nWater and fire refine,\nLead and mercury become true.\n\nNight comes—sit upright,\nCalm the heart and spirit,\nBehold the true person’s visage renewed.\nUse the *Heche* to bear the load,\nFilling the *Niu* and *Dou* constellations.\nRadiant light shines pure,\nClearly having ingested the *daogui*.\nWhen merit is complete,\nYou will know your name is listed among the immortals’ ranks,\nAnd all the immortals will invite you.\nAwaiting the Jade Emperor’s summons,\nYou will pay homage to the Three Pure Ones.\n\n**Wulingchun**\nWho understands the sevenfold returning elixir?\nOnce understood, what difficulty remains?\nIn the stillness of night, preserve spirit and turn inward,\nDivine water fills the *Niwan*.\nTransporting golden essence day and night,\nBreath never idle.\nWhen merit and practice are fulfilled, transcend the world,\nYour name and surname listed among the immortals’ ranks.\n\n**Again**\nTiger strides, dragon coils—most wondrous work,\nTheir union lies within the *Dantian*.\nIn the crucible and furnace, fire refines naturally,\nSun and moon’s refinement comes first.\nRecognize *Kan* and *Li* as the alchemy,\nTrue qi must return to its source.\nTurn inward, sit in stillness and clarity,\nThe ninefold refinement forges the elixir.\n\n**Chounuer**\nHow dare the *Heche* pause in its course?\nIt bears into the *Niwan*.\nWater and fire refine,\nA single grain of cinnabar tempers mercury and lead.\nThe great joy of the golden elixir belongs to all—\nOnly require a steadfast heart.\nCease idle words,\nPreserve yang essence, and you are an immortal.\n\n**Again**\nBy the master’s transmission of the *Chaoyuan* principle,\nDay and night, diligent in practice.\nRefining and forging into truth,\nStealing half a catty of yin and yang.\nIn the gourd’s heaven and earth, night never falls,\nFour seasons ever spring.\nWithin the cave, time’s light—\nHow can I speak of it to the world?\n\n**Again**\nIn the night, after midnight, rise and sit robed,\nHeart settled, spirit clear.\nBehold the true person,\nFace like rouge, body like silver.\nIn the crucible, flames blaze fiercely,\nPurple qi surges.\nA single elixir grain is formed—\nSurely you will ascend to the Emperor’s capital.\n\n**Taichangyin**\nThe golden elixir lies only within yourself,\nTrue water and fire refine it to completion.\nHaving met Lord Lü,\nYou recognize the return to the original ancestral source.\nYang complete, yin spent,\nWhere spirit’s light appears,\nRecognize your own true countenance.\nYour name listed among the immortals’ ranks,\nYou have leapt beyond the world’s cage.\n\n**Diangchun**\nThe work of the two qi,\nThe *Heche* bears into Kunlun’s peak.\nWho among the world understands?\nThis is the mystery of the primordial Dao.\nPreserve yang essence,\nThough aged, the body does not age.\nThe three fields full,\nPractice complete,\nSweep your sleeves and wander Peng Isle.\n\nThis work,\nThrough the master’s transmission, you know the primordial ancestor.\nWhat need to discuss *zi* and *wu*,\nTo speak of dragon and tiger?\nIt lies right before your eyes—\nThe luminous path of immortals.\nHasten to cultivate,\nOne day you shall return,\nAnd the ledgers of the underworld will be erased.\n\n**Daolianzi**\nTrue water and fire,\nThanks to the master’s transmission,\nBlack lead and red mercury simmer in the crucible.\nDivine radiance fills the present moment.\nThe cinnabar elixir complete—\nYou are an immortal.\nGolden essence grasped, your lifespan matches Heaven’s.\nAwait the Jade Emperor’s summons when the work is done.\n\n**Linjiangxian**\nWhy speak of *kan* and *li*, dragon and tiger?\nCease talk of fire phases and the celestial cycle.\nYang essence unspent, your spirit becomes whole.\nThe twin passes gleam with a path,\nStraight up to the *Niwan*.\nSecure the golden gate and jade portal,\nRefining the sun’s essence and moon’s marrow?\nWhen the three palaces are full, the body stands firm.\nThe intestinal spirits ascend to the Emperor,\nEternally a celestial immortal.\n\n**Chounuer**\nThe Golden Lord is originally the son of *Qian*,\nDwelling in the *Kun* palace.\nTrue tiger, true dragon,\nDevouring the Three Corpses and Nine Worms.\nCinnabar refined within the *Niwan*,\nResplendent and ever-red,\nIn a single day, the work is done—\nYou shall meet the Three Pure Ones, the Most High.\n\n**Langtaosha**\nI have a zither,\nCarried wherever I sit or walk.\nStringless, yet its sound surpasses the strung.\nWishing to play a tune before others,\nBut no true listener appears.\nIn the stillness of night, its notes resound like thunder,\nStartling gods and ghosts.\nShaking heaven and earth like rolling thunder,\nOnly when the work is complete and I return,\nShall I cast it toward Penglai and Yingzhou.\n\nAgain,\nThe master points to the refining of the golden elixir,\nSecure the golden gate,\nAdvance the fire’s work without idleness.\nTurn inward, settle the mind, and observe the inner landscape—\nLightning flashes between the brows.\nThe wondrous function lies in the *Niwan*,\nEven spirits and ghosts cannot perceive it.\nThe foolish and deluded remain separated by a thousand mountains,\nBut awakening is as easy as turning the hand—\nWhat difficulty is there in transcending the world?\n\nAgain,\nLead and mercury must be replenished,\nThe fire’s work ceaselessly applied.\nWhen the body’s qi is full, yang is restored in full.\nThe infant and the crone are nurtured,\nSitting and sleeping together.\nThe marrow solidifies, the body becomes firm,\nThe three fields are filled.\nConsuming the *daogui* pill, you attain immortality.\nOnly await the completion of the work and the fulfillment of the path,\nTo stride alone toward the court of the origin.\n\n**Tangduoling**\nFerrying across the Yellow River,\nThe golden gate is firmly sealed.\nThe ninefold return requires abundant effort,\nLight piercing the curtains, red as fire.\nGolden coins appear—\nTen thousand blossoms.\nAgainst the current, silver waves surge,\nOverflowing the Ox and Dipper.\nAdvancing the work, time slips by,\nUntil you see the true person—yourself.\nInwardly delighted, laughing heartily.\n\n**Taoyuan Yigu Ren**\nSince the master revealed the celestial mechanism,\nI have understood the myriad volumes of immortal scriptures.\nIf you can return essence to the brain,\nYour countenance will never age.\nTrue lead, true mercury—few know them,\nThe crow and hare refined into treasure.\nWhen the body outside the body is complete,\nThe Jade Emperor’s golden writ shall summon you.\n\n**Xi Huanghua**\nThe great Dao of the celestial mechanism,\nFew attain it.\nCirculating *wu* and *ji*,\nDragon coiling, tiger encircling.\nThis single grain of cinnabar—\nThe mortal world scarcely understands.\nAsk of wood and metal, *kan* and *li* inverted.\nYang complete, yin spent,\nThe form never ages.\nRefining with water and fire,\nNaturally, the furnace glows.\nAwait the completion of the work,\nTo forge the priceless treasure,\nAnd ascend to court the origin—\nThe seven ancestors all liberated.\n\n**Ruanlangui**\nA wheel of bright moon illuminates the three peaks,\nRosy clouds fill the sky.\nClearly, I see my master within,\nA luminous pearl ascending to the upper palace.\nThe elixir refined,\nCrimson in the crucible,\nDiligently apply the work.\nWhen the work is done, you shall surely escape the mortal cage,\nWandering leisurely among the immortal grottoes.\n\n**Wulingchun**\nSevenfold return, yang complete, yin utterly spent,\nEssence and marrow fill the three fields.\nCultivating to non-action, it must become natural—\nWhat need to discuss before or after?\nRecognize the true water and fire of the five phases,\nYou must know their root.\nDeliberately observe the cinnabar within your own elixir,\nWhy seek the elixir outside?\n\nThe *Liaoming* chapter concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "了明篇 经名了明篇。 宋先生述，毛日新编，出於南宋。 一篇。 底本出处：《正统道藏》洞真部众术类。 了明篇 宋先生述 了明篇序 盖尝论之，谓夫人之生斯世也，岂易得尔。 戴天履地，灵於万物，余以奔名竞利，逐伪丧真，至於没齿不能闻道，虚度一生，略不少悟。 诚可叹哉。 殊不思宣尼尚谓：朝闻道夕死可矣，以宣尼之圣犹急於闻道，况我辈乎？ 余今所为道者，乃大道也。 何哉？ 公而不私，正而不邪，出乎大朴之未散，先乎三光之未萌，寂然无声之可听，杳然无象之可观。 苟能敬慕，不远於人，非比乎旁门小法，惑世异端之术也。 盖以道本无名，人因寓物强名甚多，论其妙道之实，卓然惟一，难测难遇，非言可尽。 兹由天幸，因遇宋先生於云之问，专记先生云：吾遇锺吕传授口诀，运归根复命之功，行补脑还精之道，二物烹煎而成大药，刀圭服了阴尽阳全，三田黑足身外见身，功成行满脱壳升仙。 先生又云：天机非远，只在目前。 若能坚心固守，断绝疑惑，道无不成。",
      "translated_text": "**The Illuminating Treatise**\n\n*The Illuminating Treatise*. Composed by Master Song, compiled by Mao Rixin, originating from the Southern Song dynasty. One fascicle.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Miscellaneous Arts* Category.\n\n**The Illuminating Treatise**\nComposed by Master Song\n\n**Preface to The Illuminating Treatise**\n\nIt has often been said that to be born into this world is no easy matter. Clothed by heaven and treading upon earth, endowed with a spirit surpassing all things—yet most spend their days in the pursuit of fame and profit, chasing falsehoods and losing their true nature. Even unto death, they never hear of the Dao, wasting their lives without the slightest awakening. How lamentable!\n\nYet consider this: even the sage Confucius declared, *\"If one could hear the Dao in the morning, one might die content that evening.\"* If even a sage of Confucius’ stature was so urgent in seeking the Dao, how much more should we?\n\nThe Dao I speak of is the Great Dao. Why? It is impartial, not self-serving; upright, not deviant. It emerges from the undivided state of primordial simplicity, predating the birth of the Three Luminaries. Silent and soundless, formless and beyond perception—yet if one approaches it with reverence, it is not distant from humankind. This is no mere side discipline or heterodox art that deludes the world.\n\nThe Dao, in truth, has no name. People, however, impose many names upon it by attaching it to things. Yet its wondrous essence stands alone, profound and unknowable, beyond the reach of words. By fortune, I encountered Master Song in the region of Yun. He recounted his own experience:\n\n*\"I received oral instructions from the lineage of Zhong and Lü, practicing the work of returning to the root and restoring life, cultivating the Dao of replenishing the brain and refining essence. Through the refinement of the Two Substances, the Great Elixir is formed. With a single dose, yin is exhausted and yang perfected. The Three Fields darken, and a body appears beyond the body. When merit is complete and conduct fulfilled, one sheds the mortal shell and ascends as an immortal.\"*\n\nMaster Song further said: *\"The celestial mechanism is not far—it lies right before our eyes. If one can steadfastly guard the heart and sever all doubt, the Dao will surely be attained.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 406,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.30434775352478,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\了明篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "仍出所着歌词与和朗然子诗三十首，言近而指远，句清而道备，余敬而拜授。 遂编成一集，名曰《 了明篇》。 不敢独宝于家，愿得与众共之，惟冀好事君子无惜详观。 时乾道四年十月一日三衢毛日新谨序。 了明篇 宋先生述 遇真歌 乙酉年，四月中，白日再遇锺离公。 口诀亲传玄妙道，三千日夜积成功。 感谢祖师传口诀，等闲不向愚人说。 暗修功行上天知，轻泄漏慢邓都折。 锁金关，无漏泄，开透双关行日月。 含光默默返泥丸，神气相随朝帝阙。 炉中真火赫炎炎，炼得真金白似雪。 阴阳熙足现阳神，坐外神光明皎洁。 三田精黑与神全，自知名姓是神仙。 长生不死工夫别，不漏仙方誓不传。 壶中仙景时时看，洞裹真人极少年。 紫雾红光生卧室，风雷闪电起林前。 一朝脱壳离尘去，跳出凡笼走上天。 解迷歌 道不远，在泥丸，休信闲人乱语言。 看尽仙经千万卷，分明只说汞和铅。 欲要真精无漏泄，须静灵台如朗月。 灵台不静神不清，昼夜工夫休断绝。 休断绝，要勤行，运满三田功自成。 功既成时神炼就，神既炼就可长生。 修真士，听此言，守谨神仙妙诀传。 秘密天机休漏泄，漏泄之时累祖先。 奉劝世人须发志，人人有分作神仙。 和朗然子进道诗三十首 一 学道须坚五十年，终宵端坐莫贪眠。 双关撞过昆仑顶，九窍冲开变化权。 玉兔走来投北海，金乌飞入洞中天。 刀圭便是长生药，服了凡胎定得仙。 二 夜静光华景物春，圆明自在本来真。",
      "translated_text": "I here present the songs and verses composed by Master Song, along with thirty poems by Langranzi in harmonious response—words plain yet profound in meaning, lines lucid yet complete in the Dao. With reverence, I received and bowed to receive them. Thus, I compiled them into a single collection, entitled *The Chapter of Clarity*. I dare not treasure it solely within my household, but wish to share it with all. May those gentlemen of discernment not begrudge a careful reading.\n\nRespectfully inscribed on the first day of the tenth month, in the fourth year of the Qiandao era, by Mao Rixin of Sanqu.\n\n---\n\n**The Chapter of Clarity**\n*Composed by Master Song*\n\n**Song of the Encounter with the True**\nIn the yiyou year, the fourth month’s midst,\nI met Lord Zhongli again in broad daylight.\nOral instructions conveyed the wondrous Dao,\nThree thousand days and nights built the merit’s height.\n\nGrateful to the patriarch for the secret transmission,\nNever idly spoken to the unwise in vain.\nSilent cultivation’s deeds are known to Heaven,\nCareless leaks invite the underworld’s disdain.\n\nSeal the Golden Gate, prevent all leakage,\nPierce the Twin Passes to set sun and moon in motion.\nHolding light in silence, return to the Muddy Pellet,\nSpirit and qi ascend to the Celestial Palace’s station.\n\nThe true fire in the crucible blazes fiercely,\nRefining true gold white as snow.\nYin and yang harmonized, the yang spirit appears,\nSeated beyond, its radiance pure and bright.\n\nThe Three Fields darken, essence and spirit whole,\nOne knows their name as an immortal’s role.\nThe work of undying is distinct in kind,\nThe unbreached elixir’s formula sworn not to unwind.\n\nWithin the gourd, immortal scenes unfold,\nThe cavern’s true one ever youthful, untold.\nPurple mists and crimson light fill the chamber,\nWind and thunder, lightning flash before the timber.\n\nOne day, shedding the shell, leaving dust behind,\nLeaping from the mortal cage to ascend on high.\n\n**Song of Dispelling Delusion**\nThe Dao is not far—it dwells in the Muddy Pellet,\nHeed not the idle words of those who prattle.\nThough you peruse ten thousand scrolls of immortal lore,\nClearly they speak but of mercury and lead evermore.\n\nTo keep true essence from leaking away,\nStill the numinous terrace like the bright moon’s ray.\nIf the numinous terrace is not still, the spirit stays dim,\nDay and night, the work must never grow slim.\n\nNever grow slim, but practice with diligence,\nWhen the Three Fields are full, merit is complete in essence.\nWhen merit is complete, the spirit is refined,\nAnd once refined, long life is thine to find.\n\nPractitioners of the true, heed these words,\nGuard well the immortal’s wondrous transmission.\nThe secret celestial mechanism must not be revealed,\nFor leaks bring harm upon your ancestors’ field.\n\nI urge all in the world to rouse their will,\nFor each has the share to become immortal still.\n\n**Thirty Poems in Response to Langranzi on Advancing the Dao**\n\n**I**\nTo learn the Dao, fifty years must be firm,\nThrough nights, sit upright, forsake sleep’s term.\nPierce the Twin Passes to Kunlun’s crest,\nThe nine orifices open, transformation’s behest.\n\nThe jade hare runs to the northern sea,\nThe golden crow flies into the cavern’s sky.\nThe knife’s edge is the elixir of life,\nConsumed, the mortal womb yields to the immortal’s strife.\n\n**II**\nIn quiet night, radiance and spring’s scene,\nPerfect clarity, at ease, the original true within.\n...",
      "overlap_context": "fining essence. Through the refinement of the Two Substances, the Great Elixir is formed. With a single dose, yin is exhausted and yang perfected. The Three Fields darken, and a body appears beyond the body. When merit is complete and conduct fulfilled, one sheds the mortal shell and ascends as an immortal.\"*\n\nMaster Song further said: *\"The celestial mechanism is not far—it lies right before our eyes. If one can steadfastly guard the heart and sever all doubt, the Dao will surely be attained.\"*",
      "start_char": 406,
      "end_char": 1020,
      "start_sentence": 20,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.194538116455078,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\了明篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "杳冥于内观星斗，恍惚之中见主人。 金鼎炎炎悬赤日，黄河滚滚鼓玄津。 宝珠炼就功成后，灿烂金光顶上新。 三 静坐精思小室中，铁牛莫遣走西东。 山头虎啸人难见，海底龙吟景不同。 气足自然形不老，神全已觉貌如童。 可怜贪利贪名者，一旦无常尽落空。 四 眼前白雪乱纷纷，满目黄花变紫云。 顶上山泉时复响，耳中仙乐日常闻。 丹田自有延年药，身上谁无浩劫纹。 此理世问人少会，可伤城外许多坟。 五 荣华休羡学仙才，得道皆因此处来。 鼎内铅生成大药，炉中汞长结灵胎。 阳精不漏身无死，真息常存黑自回。 混俗和光随分过，任他人笑作痴呆。 六 达了玄元万事休，任他春去又还秋。 饮将玉醴形难老，捉得金精命自由。 月魄日魂常会合，婴儿诧女更调缪。 夜深独坐烧丹处，万点明星帐顶头。 七 运气来来一十春，因师指教得玄门。 便将戊己为炉鼎，已得屯蒙辨晓昏。 元气充准盈腹饱，真阳运动遍身温。 死生感谢先生诀，万劫如何报此恩。 八 气入丹田火自生，眉问灼灼电光明。 循环二气乾坤合，运转三宫日月行。 炼就阳神添寿域，修成至宝复元精。 假饶发白颜衰老，服了金丹也再荣。 九 功成名姓列天官，悟者元来有甚难。 神火升腾天地泰，阴阳和会谷神安。 回颜不用准凡药，返老何须觅外丹。 静坐可观尘外景，世问无比百千般。 十 天机岂敢对人论，炼假成真浩劫存。 红汞黑铅烧药本，金乌玉兔炼丹根。 功成必定归蓬岛，德备还须谒帝合。 霹雳一声神鬼惧，霞光万道照乾坤。 十一 暗地修行隐市尘，工夫忙裹不曾闲。 须资密密频居室，何用区区走入山。 金饭频准坚骨髓，玉浆时饮驻容颜。 我今已得长生诀，炉内烧成九转丹。 十二 道要玄微理最探，修真须是要坚心。 黄河运透充天路，绛阙镕成满鼎金。 进火不须寻静室，求仙何必住幽林。 身中尽有延年药，可笑愚人向外寻。 十三 无贪无爱胜山居，不惹闲愁事绪疏。 得遇至人亲口诀，何须更看万家书。 光阴有限催如箭，一岁还添一岁无。 奉劝世人须早悟，不修不炼是愚夫。 十四 三田阴尽反阳纯，二物烹煎养就真。 德重自然神鬼伏，道高诗句果惊人。 夜深独坐观神剑，无限阴魔远离身。 炼汞成砂应没老，寿同天地貌长新。 十五 小年懒意习文儒，虚度年光二纪余。 无意贪求名与利，有心只待上虚无。 刀圭会饮颜如玉，飞过金晶脸自舒。 不识根源宗与祖，咽津行气馒区区。 十六 双关夹脊上泥丸，神气流通自驻颜。 万顷金钱开宇宙，两轮日月透关山。 河车搬运休停住，进火功夫莫放闲。 炼取自家真大药，已知名姓出尘问。 十七 认取玄玄莫执迷，功成行满达无为。 频吞玉掖滋容质，能饮琼浆济渴饥。 二气相交生诧女，五行匹配长婴儿。 自知达了天机理，脱壳升仙定有期。 十八 求仙何必外寻丹，争似存精返气还。 髓实自然无老死，阳纯必定有童颜。 金关玉户须牢锁，炉鼎烹煎功莫闲。 一颗明珠才运动，光辉闪电两眉问。 十九 大道非难在志求，谁能肯向少年修。 人生幻化何坚固，富贵荣华得几秋。 百岁光阴如一梦，可怜随浪逐波流。 贪财恋色何时彻，不作骷髅未肯休。 二十 学道来来二十秋，眼前俗景见如条。 但行七返添精髓，长使黄河水逆流。 万卷仙经何必看，一壶仙酒醉方休。",
      "translated_text": "**III**\nIn profound darkness, within, observe the stars,\nIn fleeting visions, behold the Master’s form.\nThe golden crucible flames, suspending the crimson sun,\nThe Yellow River surges, drumming the dark ford.\nOnce the precious pearl is refined and work complete,\nA radiant golden light renews atop the crown.\n\n**IV**\nIn stillness sit, refine the mind within the chamber,\nLet not the iron ox wander east or west.\nThe tiger’s roar on the mountain peak—none see,\nThe dragon’s chant beneath the sea—scenes unlike.\nQi ample, the form never ages,\nSpirit whole, the visage returns to youth.\nPity those who covet profit and fame,\nFor in a moment, all turns to emptiness.\n\n**V**\nBefore your eyes, white snow scatters in chaos,\nYellow blossoms transform into purple clouds.\nAtop the crown, mountain springs echo anew,\nIn the ears, celestial music heard each day.\nThe cinnabar field holds the elixir of longevity,\nWho on this body lacks the marks of kalpas past?\nThis truth few in the world comprehend,\nYet how many graves lie beyond the city walls.\n\n**VI**\nDo not envy glory, learn the immortal’s art,\nFor attaining the Dao begins here.\nWithin the crucible, lead births the great medicine,\nIn the furnace, mercury ripens into the sacred embryo.\nYang essence unspilled, the body knows no death,\nTrue breath ever present, the black returns to white.\nBlend with the world, harmonize your light,\nLet others mock as fools and dullards.\n\n**VII**\nOnce the mystery is grasped, all things cease,\nSpring departs and returns, yet none constrain.\nDrink the jade nectar, the form defies age,\nSeize the golden essence, life is unbound.\nMoon’s soul and sun’s spirit ever unite,\nInfant boy and maiden girl in tender union.\nDeep in night, seated where the elixir burns,\nTen thousand bright stars crown the canopy.\n\n**VIII**\nFor ten springs, cultivate qi as it comes,\nBy the master’s guidance, the mystery’s gate attained.\nTake wu and ji as crucible and cauldron,\nDiscerning the cyclical signs of dawn and dusk.\nPrimordial qi fills, the belly full,\nTrue yang stirs, warming the body through.\nGrateful for the master’s transmission of life and death,\nHow could eons repay such grace?\n\n**IX**\nQi enters the cinnabar field, fire arises,\nBetween the brows, lightning’s brilliance glows.\nThe two qi circulate, heaven and earth unite,\nThe three palaces turn, sun and moon traverse.\nRefining the yang spirit, life’s domain expands,\nCultivating the supreme treasure, primordial essence restored.\nThough hair whitens and visage fades,\nConsuming the golden elixir, youth returns.\n\n**X**\nOnce work is done, names inscribed in celestial ranks,\nWho realizes enlightenment was never hard?\nDivine fire ascends, heaven and earth at peace,\nYin and yang harmonize, the valley spirit rests.\nTo restore youth, no common medicine needed,\nTo reverse age, no external elixir sought.\nIn stillness, gaze upon scenes beyond the dust,\nIn the world, none compare to these myriad forms.\n\n**XI**\nDare not speak of heaven’s mechanism to others,\nRefining the false into true, kalpas endure.\nRed mercury, black lead—the alchemical base,\nGolden crow, jade hare—the elixir’s root.\nWork complete, one must return to Peng Isle,\nVirtue perfected, audience with the Emperor sought.\nA thunderclap strikes—gods and ghosts tremble,\nTen thousand rays of rosy light illuminate heaven and earth.\n\n**XII**\nIn secret, cultivate amidst the world’s dust,\nLabor diligently, never idle.\nOften retreat in seclusion,\nNo need to wander into distant mountains.\nGolden grains frequently consumed, bones and marrow firm,\nJade nectar sipped often, the countenance preserved.\nNow I have grasped the elixir of immortality,\nIn the furnace, the nine-times-cycled pill refined.\n\n**XIII**\nThe Dao’s subtlety delves deepest truth,\nTo cultivate the real, resolve must be firm.\nThe Yellow River’s course runs through the celestial path,\nThe vermilion towers melt into a crucible of gold.\nTo advance the fire, no quiet chamber needed,\nTo seek immortality, no secluded woods required.\nWithin the body lies the elixir of longevity,\nHow laughable the fool who seeks it without.\n\n**XIV**\nFree from greed, free from attachment—better than mountain dwelling,\nUnburdened by idle sorrows, the mind at ease.\nHaving met the perfected one, received the oral transmission,\nWhy pore over ten thousand scrolls?\nTime is limited, hastening like an arrow,\nEach year added, one year less remains.\nI urge the world to awaken early,\nThose who neither cultivate nor refine are fools.\n\n**XV**\nThe three fields’ yin exhausted, pure yang restored,\nThe two substances simmered, the true nurtured.\nVirtue profound, gods and ghosts submit,\nThe Dao lofty, its verses astonish.\nDeep in night, seated, observe the divine sword,\nCountless yin demons flee far from the body.\nMercury refined into cinnabar, age undone,\nLifespan aligned with heaven and earth, the visage ever new.\n\n**XVI**\nIn youth, indolent toward scholarly arts,\nTwo decades and more, years idly spent.\nNo intent to chase fame or profit,\nOnly the heart set on ascending the void.\nMeeting the elixir’s measure, the face like jade,\nPassing through golden essence, the visage at ease.\nUnknowing of root, lineage, and ancestors,\nSwallowing saliva, circulating qi—how trivial.\n\n**XVII**\nThe twin passes flank the spine to the mud-pill palace,\nSpirit and qi flow freely, the countenance preserved.\nA myriad acres of gold unfold the cosmos,\nTwo wheels of sun and moon pierce the passes.\nThe river chariot’s conveyance must not halt,\nThe work of advancing fire must not rest.\nRefine your own true great medicine,\nAlready your name emerges beyond the dust.\n\n**XVIII**\nRecognize the profound mystery, abandon delusion,\nWork complete, conduct perfected, attain non-action.\nFrequently swallow jade dew, nourishing form and substance,\nAble to drink celestial nectar, quenching thirst and hunger.\nThe two qi unite, birthing the maiden girl,\nThe five phases match, nurturing the infant boy.\nKnowing the truth of heaven’s mechanism,\nShedding the shell to ascend as immortal is certain.\n\n**XIX**\nTo seek immortality, why search for external elixirs?\nBetter to preserve essence, return qi to its source.\nMarrow full, naturally no aging or death,\nYang pure, surely the visage of youth.\nGolden gate and jade door must be tightly sealed,\nThe crucible’s simmering work must not cease.\nOnce the luminous pearl stirs into motion,\nLightning’s radiance flashes between the brows.\n\n**XX**\nThe great Dao is not difficult—seek with resolve,\nWho would undertake cultivation in youth?\nHuman life’s illusions—what endures?\nWealth and honor—how many autumns gained?\nA century’s span is but a dream,\nPity those who drift with the waves.\nWhen will the craving for wealth and lust cease?\nNot until the bones lie bare.\n\n**XXI**\nFor twenty autumns, I have studied the Dao,\nThe world’s vulgar scenes now appear as straw.\nSimply practice the seven returns, replenishing essence and marrow,\nEver making the Yellow River’s waters flow backward.\nTen thousand volumes of immortal scriptures—what need to read?\nA single gourd of celestial wine—drunk to the full.",
      "overlap_context": "ing the Dao**\n\n**I**\nTo learn the Dao, fifty years must be firm,\nThrough nights, sit upright, forsake sleep’s term.\nPierce the Twin Passes to Kunlun’s crest,\nThe nine orifices open, transformation’s behest.\n\nThe jade hare runs to the northern sea,\nThe golden crow flies into the cavern’s sky.\nThe knife’s edge is the elixir of life,\nConsumed, the mortal womb yields to the immortal’s strife.\n\n**II**\nIn quiet night, radiance and spring’s scene,\nPerfect clarity, at ease, the original true within.\n...",
      "start_char": 1020,
      "end_char": 2397,
      "start_sentence": 58,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.25939607620239,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\了明篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "有朝拂袖腾空去，物外逍遥有甚愁。 二十一 自说南华有姓名，不因师指道难成。 绿偷日月通天地，为炼还丹出死生。 阴裹阳生人不晓，无中生有是真精。 先生教我出神法，闭目蓬莱捻指程。 二十二 华池咽罢看蓬瀛，万里如同一里程。 药就驾云朝玉帝，功成跨鹤谢三清。 直从行处知端的，还向元中定杳冥。 如此学仙真可学，百千万劫镇长荣。 二十三 人人皆恋色和财，不肯回心向道来。 形体衰残将欲死，追欢语笑起疑猜。 一朝气散难寻气，一日灾来怎免灾。 若要无生亦无死，分明造化在灵台。 二十四 学仙须是学三茅，万卷闲文懒意抄。 争似澄心修内物，夜深金鼎虎龙交。 烹煎水火无休歇，缎炼丹砂岂暂抛。 已是十洲三岛客，看看拂袖出尘巢。 二十五 长生不死是仙家，一任年光变岁华。 得道便归天上路，愚迷终是入泥沙。 目前明有神仙路，争奈人心似夜叉。 不觉命终沉苦海，寻思真个可伤嗟。 二十六 无限修真不识真，口中解说不能行。 万般存想空劳力，枉费工夫坐五更。 行气若知行气主，运精还识运精根。 功成定是飞升去，仙簿元来有姓名。 二十七 饶君读尽世问书，性命元来并不於。 争似回心修至道，夜深莫倦守丹炉。 烧成大药归蓬岛，结就灵砂入太虚。 莫道神仙无分做，人心只为太顽愚。 二十八 贪利贪名没了期，终朝恣意乱非为。 争如向己修功行，炼就阳神绝虑疑。 神水频浇添道气，自然容貌不能衰。 一朝得赴瑶池会，相与诸仙世外期。 二十九 道在身中莫外寻，修功全是自家心。 龙精虎髓谁人识，离坎相交道理深。 炼药全凭天上火，烧丹须是鼎中金。 愚人不达玄元理，馒看仙经怎晓音。 三十 尾闲运透九宫门，呼吸玄元天地根。 要妙双关明夹脊，两轮日月斗高奔。 阳全阴尽三田满，炼气成神浩劫存。 功行满时天诏至，十洲三岛作仙人。 三十诗篇和朗然，分明说尽道根源。 天机漏泄令人悟，争奈愚夫不学仙。 词 苏幕遮",
      "translated_text": "One dawn, with a sweep of the sleeve, I ascend into empty space,\nBeyond the world’s bounds, carefree—what sorrow remains?\n\n**XXI**\nI speak of *Nanhua* yet bear a name,\nWithout a master’s guidance, the Dao is hard to attain.\nStealing the green of sun and moon to link heaven and earth,\nRefining the returning elixir to transcend death and life.\nYin conceals yang’s birth—none understand,\nFrom nothing, something arises—this is true essence.\nThe master teaches me the art of spirit’s departure,\nEyes closed, Penglai lies but a finger’s span away.\n\n**XXII**\nAfter swallowing the Jade Pool’s draught, I gaze toward Pengying,\nTen thousand miles shrink to a single league’s journey.\nWith the medicine complete, I ride clouds to the Jade Emperor’s court,\nMy work done, I mount a crane to bid farewell to the Three Pure Ones.\nOnly in practice is the truth revealed,\nReturning to the primordial to settle the boundless void.\nSuch is the study of immortality—truly worth pursuing,\nThrough a hundred thousand kalpas, eternally flourishing.\n\n**XXIII**\nAll cling to lust and wealth,\nUnwilling to turn their hearts toward the Dao.\nAs the body decays and death nears,\nThey chase fleeting joys, laughing and jesting in doubt.\nOnce qi scatters, how can it be sought again?\nWhen disaster strikes in a day, how can it be averted?\nTo be free of birth and death,\nClearly, creation lies within the spirit’s terrace.\n\n**XXIV**\nTo study immortality, study the Three Maos,\nIdle texts by the thousands—I grow weary of transcribing.\nHow much better to still the mind and refine the inner treasure,\nDeep in the night, the golden crucible where tiger and dragon unite.\nBoiling water and fire without cease,\nTempering cinnabar—how could it ever be set aside?\nAlready a guest of the Ten Isles and Three Mountains,\nSoon I shall sweep my sleeves and leave the dusty nest.\n\n**XXV**\nThe immortals know life without death,\nUnmoved as the years transform.\nAttaining the Dao, they return to heaven’s path,\nWhile the deluded sink into mud and sand.\nThe road to immortality lies before us,\nYet men’s hearts remain like yakshas.\nUnheeding, their lives end in the sea of suffering—\nReflecting, one can only sigh in sorrow.\n\n**XXVI**\nCountless seek the true yet know it not,\nReciting words they cannot put into practice.\nA thousand visions—all in vain,\nWasting effort through the fifth watch of night.\nIf one knows the master of qi’s circulation,\nAnd the root of essence’s movement,\nSuccess will surely bring ascension,\nFor the immortal ledger already bears their name.\n\n**XXVII**\nThough you read all the world’s books,\nNature and life remain untouched.\nHow much better to turn the heart toward the supreme Dao,\nGuarding the elixir furnace deep into the night without weariness.\nWhen the great medicine is refined, return to Peng Island,\nThe numinous cinnabar congealed, enter the great void.\nDo not say immortality is beyond reach—\nOnly because men’s hearts are too stubborn and dull.\n\n**XXVIII**\nEndlessly craving profit and fame,\nAll day indulging in reckless folly.\nHow much better to cultivate merit within,\nRefining the yang spirit to banish doubt and worry.\nDivine water frequently poured to nourish Dao-qi,\nNaturally, the countenance will never decay.\nOne day, summoned to the Jade Pool’s assembly,\nI shall keep company with immortals beyond the world’s bounds.\n\n**XXIX**\nThe Dao resides within—seek it not without,\nCultivation depends entirely on one’s own heart.\nWho recognizes dragon’s essence and tiger’s marrow?\nThe union of *Li* and *Kan*—profound is its principle.\nRefining the medicine relies on heaven’s fire,\nTempering the elixir requires the crucible’s gold.\nFools fail to grasp the mystery’s truth,\nBlindly poring over immortal scriptures—how can they fathom its sound?\n\n**XXX**\nThe *Weilü* unseals the nine palaces’ gates,\nInhaling and exhaling the primordial root of heaven and earth.\nThe wondrous double pass illuminates the *Jiaji*,\nThe two wheels of sun and moon race high.\nYang complete, yin exhausted, the three fields full,\nQi refined into spirit—stored through eons.\nWhen merit and practice are fulfilled, heaven’s decree arrives,\nTo become an immortal of the Ten Isles and Three Mountains.\n\nThirty poems, clear and resonant,\nExposing the Dao’s root in full.\nHeaven’s mechanism revealed to awaken men—\nYet how many fools refuse to study immortality?\n\n**Lyrics**\n*Sumuzhe*",
      "overlap_context": "autumns gained?\nA century’s span is but a dream,\nPity those who drift with the waves.\nWhen will the craving for wealth and lust cease?\nNot until the bones lie bare.\n\n**XXI**\nFor twenty autumns, I have studied the Dao,\nThe world’s vulgar scenes now appear as straw.\nSimply practice the seven returns, replenishing essence and marrow,\nEver making the Yellow River’s waters flow backward.\nTen thousand volumes of immortal scriptures—what need to read?\nA single gourd of celestial wine—drunk to the full.",
      "start_char": 2397,
      "end_char": 3218,
      "start_sentence": 150,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.17835807800293,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\了明篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "气随神，神随气，神气相随，透入泥丸裹。 长把金关牢锁闭，捉得金晶，暗地添欢喜。 下辛勤，须发志，十二时中，莫把工夫弃。 阴尽阳全神出体，功行成时，名列神仙位。 丑奴儿 真人本是凡人做，悟者何难。 名利如山，隔断神仙路往还。 谢师指教生死事，长在心问。 长在心问，十二时中不暂闲。 沁园春、 速速修行，惜取身中无价珍。 把金乌玉兔，炉中炼用，阴阳造化，养就阳神。 虎啸龙吟。 丹田裹，顶内时时仙乐声。 泥丸裹，烹煎水火，铅汞成真。 夜来端坐，澄心神，见真人颜貌新。 用河车搬载，充开牛斗星辰。 洁皎光射，分明服了刀圭。 功成后，自知道仙班有姓名，诸仙请。 待玉皇宣至，朝拜三清。 武陵春 七返还丹人怎晓，晓后有何难。 夜静存神向内观，神水满泥丸。 搬运金精无夜昼，呼吸不曾闲。 功行成时出世寰，名姓列仙班。 又 虎逵龙蟠功最妙，交会在丹田。 炉鼎烹煎火自然，日月炼为先。 认取坎离为造化，真气要还源。 向己澄静坐内观，九转炼成丹。 丑奴儿 河车怎敢停留住，搬入泥丸。 水火烹煎，一粒丹砂炼汞铅。 金丹大乐人人有，只要心坚。 休说闲言，不走阳精便是仙。 又 因师传授朝元理，昼夜功勤。 炼缎成真，偷得阴阳共半斤。 壶中天地何曾夜，四季长春。 洞裹光阴，交我如何与世论。 又 夜来子后披衣坐，心定神清。 见个真人，脸似胭脂体似银。 炉中火焰炎炎起，紫气腾腾。 一粒丹成，管取飞升上帝京。 太常引 金丹只在自身中，真水火，炼成功。 因遇吕仙公， 识返本还元祖宗。 阳全阴尽，神光现处。 认得自真容。 名姓列仙官，已跳出乾坤世笼。 点绛唇 二气工夫，河车搬入昆仑脑。 世人谁晓，此是玄元道。 存得阳精，年老身不老。 三田饱，行功都了，拂袖游蓬岛。 又",
      "translated_text": "**Qi follows spirit, spirit follows qi,**\nSpirit and qi in mutual pursuit,\nPiercing through to the *Niwan* within.\nEver secure the Golden Gate with steadfast lock,\nSeizing the golden essence—\nIn secret, joy wells deep.\n\nLabor below with unflagging will,\nThrough all twelve hours,\nNever abandon your work.\nYin spent, yang complete—spirit leaves the body,\nWhen merit and practice are fulfilled,\nYour name is inscribed among the immortals’ ranks.\n\n**Chounuer**\nA true person was once but mortal flesh—\nWhat difficulty lies in awakening?\nYet fame and profit, like mountains,\nBar the path to and fro on the immortals’ road.\nGrateful for the master’s guidance on matters of life and death,\nEver ponder it in the heart.\nEver ponder it in the heart,\nThrough all twelve hours, never a moment’s rest.\n\n**Qinyuanchun**\nHasten, hasten to cultivate the Way,\nCherish the priceless treasure within your body.\nTake the golden crow and jade hare,\nRefine them in the crucible,\nFor yin and yang’s alchemy\nNurtures the yang spirit.\nTigers roar, dragons chant—\nWithin the *Dantian*,\nAtop the crown, celestial music sounds without cease.\nIn the *Niwan*,\nWater and fire refine,\nLead and mercury become true.\n\nNight comes—sit upright,\nCalm the heart and spirit,\nBehold the true person’s visage renewed.\nUse the *Heche* to bear the load,\nFilling the *Niu* and *Dou* constellations.\nRadiant light shines pure,\nClearly having ingested the *daogui*.\nWhen merit is complete,\nYou will know your name is listed among the immortals’ ranks,\nAnd all the immortals will invite you.\nAwaiting the Jade Emperor’s summons,\nYou will pay homage to the Three Pure Ones.\n\n**Wulingchun**\nWho understands the sevenfold returning elixir?\nOnce understood, what difficulty remains?\nIn the stillness of night, preserve spirit and turn inward,\nDivine water fills the *Niwan*.\nTransporting golden essence day and night,\nBreath never idle.\nWhen merit and practice are fulfilled, transcend the world,\nYour name and surname listed among the immortals’ ranks.\n\n**Again**\nTiger strides, dragon coils—most wondrous work,\nTheir union lies within the *Dantian*.\nIn the crucible and furnace, fire refines naturally,\nSun and moon’s refinement comes first.\nRecognize *Kan* and *Li* as the alchemy,\nTrue qi must return to its source.\nTurn inward, sit in stillness and clarity,\nThe ninefold refinement forges the elixir.\n\n**Chounuer**\nHow dare the *Heche* pause in its course?\nIt bears into the *Niwan*.\nWater and fire refine,\nA single grain of cinnabar tempers mercury and lead.\nThe great joy of the golden elixir belongs to all—\nOnly require a steadfast heart.\nCease idle words,\nPreserve yang essence, and you are an immortal.\n\n**Again**\nBy the master’s transmission of the *Chaoyuan* principle,\nDay and night, diligent in practice.\nRefining and forging into truth,\nStealing half a catty of yin and yang.\nIn the gourd’s heaven and earth, night never falls,\nFour seasons ever spring.\nWithin the cave, time’s light—\nHow can I speak of it to the world?\n\n**Again**\nIn the night, after midnight, rise and sit robed,\nHeart settled, spirit clear.\nBehold the true person,\nFace like rouge, body like silver.\nIn the crucible, flames blaze fiercely,\nPurple qi surges.\nA single elixir grain is formed—\nSurely you will ascend to the Emperor’s capital.\n\n**Taichangyin**\nThe golden elixir lies only within yourself,\nTrue water and fire refine it to completion.\nHaving met Lord Lü,\nYou recognize the return to the original ancestral source.\nYang complete, yin spent,\nWhere spirit’s light appears,\nRecognize your own true countenance.\nYour name listed among the immortals’ ranks,\nYou have leapt beyond the world’s cage.\n\n**Diangchun**\nThe work of the two qi,\nThe *Heche* bears into Kunlun’s peak.\nWho among the world understands?\nThis is the mystery of the primordial Dao.\nPreserve yang essence,\nThough aged, the body does not age.\nThe three fields full,\nPractice complete,\nSweep your sleeves and wander Peng Isle.",
      "overlap_context": "earth.\nThe wondrous double pass illuminates the *Jiaji*,\nThe two wheels of sun and moon race high.\nYang complete, yin exhausted, the three fields full,\nQi refined into spirit—stored through eons.\nWhen merit and practice are fulfilled, heaven’s decree arrives,\nTo become an immortal of the Ten Isles and Three Mountains.\n\nThirty poems, clear and resonant,\nExposing the Dao’s root in full.\nHeaven’s mechanism revealed to awaken men—\nYet how many fools refuse to study immortality?\n\n**Lyrics**\n*Sumuzhe*",
      "start_char": 3218,
      "end_char": 3983,
      "start_sentence": 205,
      "end_sentence": 262,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.326622247695923,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\了明篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "这个工夫，因师传授知元祖，论甚子午，说甚龙和虎。 只在目前，明有神仙路。 速修取，有朝归去，消了阴司簿。 捣练子 真水火，谢师传，黑铅红汞鼎中煎。 现神光满目前。 丹砂就，是神仙。 金晶捉住寿同天。 待功成玉帝宣 临江仙 说甚坎离龙共虎，休言火候周天。 阳精不走自神全，双关明有路，直上至泥丸。 牢锁金关并玉户，日魂月魄烹煎？ 三宫都满体牢坚，肠神朝上帝，永劫作天仙。 丑奴儿 金公本是乾家子，住在坤宫。 真虎真龙，吃尽三尸及九虫。 丹砂锻炼泥丸裹，赫赫长红，一日成功，直见三清太上公。 浪淘沙 我有一张琴，随坐随行，无弦胜似有弦声。 欲对人前弹一曲，不遇知音。 夜静响珍轰，神鬼俱惊。 惊天动地若雷鸣，只候功成归去后，擭向蓬瀛。 又 师指炼金丹，牢锁金关，工夫进火莫交闲。 向己澄心观内景，闪电眉问。 妙用在泥丸，神鬼难看。 愚迷不悟隔千山，悟即如同观返掌，出世何难。 又 铅汞要加添，火候频煎，体中气足返阳全。 养就婴儿并姥女，同坐同眠。 髓实自身坚，运满三田。 刀圭服了得神仙，只候功成并行满，独步朝元。 糖多令 搬载波黄河，金关牢闭锁。 运九还须是功多，光透帘帏红似火。 见金钱，万千朵。 逆水涌银波，充开牛斗过。 进工夫蹉跎，见个真人便是我。 暗心欢喜笑呵呵。 桃源忆故人 自从师指天机道，万卷仙经都晓。 若会运精归脑，颜貌长不老。 真铅真汞人知少，乌兔烹煎成宝。 身外有身方了，玉帝金书召。 惜黄花 天机大道，达者稀少。 运戊己，龙蟠更虎绕。 这一颗丹砂，凡世人难晓。 问木金、坎离颠倒。 阳全阴尽，形容不老。 将水火烹煎，自然炉宠。 待行功成就，炼无价宝，去朝元，七祖都了。 阮郎归 一输明月照三峰，彩霞飞满空。 分明见我主人公，明珠透上宫。 丹药炼，鼎中红，频频要用功。 功成定是出凡笼，闲游仙洞中。 武陵春 。 七返阳全阴去尽，精髓满三田。 修到无为必自然，论甚后和先。 认五行真水火，须要识根源。 自己丹取砂着意看，何用外寻丹。 了明篇竟",
      "translated_text": "This work,\nThrough the master’s transmission, you know the primordial ancestor.\nWhat need to discuss *zi* and *wu*,\nTo speak of dragon and tiger?\nIt lies right before your eyes—\nThe luminous path of immortals.\nHasten to cultivate,\nOne day you shall return,\nAnd the ledgers of the underworld will be erased.\n\n**Daolianzi**\nTrue water and fire,\nThanks to the master’s transmission,\nBlack lead and red mercury simmer in the crucible.\nDivine radiance fills the present moment.\nThe cinnabar elixir complete—\nYou are an immortal.\nGolden essence grasped, your lifespan matches Heaven’s.\nAwait the Jade Emperor’s summons when the work is done.\n\n**Linjiangxian**\nWhy speak of *kan* and *li*, dragon and tiger?\nCease talk of fire phases and the celestial cycle.\nYang essence unspent, your spirit becomes whole.\nThe twin passes gleam with a path,\nStraight up to the *Niwan*.\nSecure the golden gate and jade portal,\nRefining the sun’s essence and moon’s marrow?\nWhen the three palaces are full, the body stands firm.\nThe intestinal spirits ascend to the Emperor,\nEternally a celestial immortal.\n\n**Chounuer**\nThe Golden Lord is originally the son of *Qian*,\nDwelling in the *Kun* palace.\nTrue tiger, true dragon,\nDevouring the Three Corpses and Nine Worms.\nCinnabar refined within the *Niwan*,\nResplendent and ever-red,\nIn a single day, the work is done—\nYou shall meet the Three Pure Ones, the Most High.\n\n**Langtaosha**\nI have a zither,\nCarried wherever I sit or walk.\nStringless, yet its sound surpasses the strung.\nWishing to play a tune before others,\nBut no true listener appears.\nIn the stillness of night, its notes resound like thunder,\nStartling gods and ghosts.\nShaking heaven and earth like rolling thunder,\nOnly when the work is complete and I return,\nShall I cast it toward Penglai and Yingzhou.\n\nAgain,\nThe master points to the refining of the golden elixir,\nSecure the golden gate,\nAdvance the fire’s work without idleness.\nTurn inward, settle the mind, and observe the inner landscape—\nLightning flashes between the brows.\nThe wondrous function lies in the *Niwan*,\nEven spirits and ghosts cannot perceive it.\nThe foolish and deluded remain separated by a thousand mountains,\nBut awakening is as easy as turning the hand—\nWhat difficulty is there in transcending the world?\n\nAgain,\nLead and mercury must be replenished,\nThe fire’s work ceaselessly applied.\nWhen the body’s qi is full, yang is restored in full.\nThe infant and the crone are nurtured,\nSitting and sleeping together.\nThe marrow solidifies, the body becomes firm,\nThe three fields are filled.\nConsuming the *daogui* pill, you attain immortality.\nOnly await the completion of the work and the fulfillment of the path,\nTo stride alone toward the court of the origin.\n\n**Tangduoling**\nFerrying across the Yellow River,\nThe golden gate is firmly sealed.\nThe ninefold return requires abundant effort,\nLight piercing the curtains, red as fire.\nGolden coins appear—\nTen thousand blossoms.\nAgainst the current, silver waves surge,\nOverflowing the Ox and Dipper.\nAdvancing the work, time slips by,\nUntil you see the true person—yourself.\nInwardly delighted, laughing heartily.\n\n**Taoyuan Yigu Ren**\nSince the master revealed the celestial mechanism,\nI have understood the myriad volumes of immortal scriptures.\nIf you can return essence to the brain,\nYour countenance will never age.\nTrue lead, true mercury—few know them,\nThe crow and hare refined into treasure.\nWhen the body outside the body is complete,\nThe Jade Emperor’s golden writ shall summon you.\n\n**Xi Huanghua**\nThe great Dao of the celestial mechanism,\nFew attain it.\nCirculating *wu* and *ji*,\nDragon coiling, tiger encircling.\nThis single grain of cinnabar—\nThe mortal world scarcely understands.\nAsk of wood and metal, *kan* and *li* inverted.\nYang complete, yin spent,\nThe form never ages.\nRefining with water and fire,\nNaturally, the furnace glows.\nAwait the completion of the work,\nTo forge the priceless treasure,\nAnd ascend to court the origin—\nThe seven ancestors all liberated.\n\n**Ruanlangui**\nA wheel of bright moon illuminates the three peaks,\nRosy clouds fill the sky.\nClearly, I see my master within,\nA luminous pearl ascending to the upper palace.\nThe elixir refined,\nCrimson in the crucible,\nDiligently apply the work.\nWhen the work is done, you shall surely escape the mortal cage,\nWandering leisurely among the immortal grottoes.\n\n**Wulingchun**\nSevenfold return, yang complete, yin utterly spent,\nEssence and marrow fill the three fields.\nCultivating to non-action, it must become natural—\nWhat need to discuss before or after?\nRecognize the true water and fire of the five phases,\nYou must know their root.\nDeliberately observe the cinnabar within your own elixir,\nWhy seek the elixir outside?\n\nThe *Liaoming* chapter concludes.",
      "overlap_context": " original ancestral source.\nYang complete, yin spent,\nWhere spirit’s light appears,\nRecognize your own true countenance.\nYour name listed among the immortals’ ranks,\nYou have leapt beyond the world’s cage.\n\n**Diangchun**\nThe work of the two qi,\nThe *Heche* bears into Kunlun’s peak.\nWho among the world understands?\nThis is the mystery of the primordial Dao.\nPreserve yang essence,\nThough aged, the body does not age.\nThe three fields full,\nPractice complete,\nSweep your sleeves and wander Peng Isle.",
      "start_char": 3983,
      "end_char": 4860,
      "start_sentence": 263,
      "end_sentence": 326,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.31937026977539,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\了明篇.txt",
        "category": "众术类"
      }
    }
  ]
}