{
  "source_id": "云阜山申仙翁传",
  "source_file": "chunked_daozang\\云阜山申仙翁传.json",
  "total_chunks": 8,
  "total_original_chars": 5129,
  "total_translated_chars": 30064,
  "total_translation_time": 156.8232307434082,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
    "category": "谱箓类"
  },
  "full_translation": "*The Biography of Immortal Master Shen of Yunfu Mountain*\n\n*Scripture Title:* *The Supplemented Biography of Immortal Master Shen of Yunfu Mountain*. Author unknown. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Section of Cave Mysteries*, *Category of Genealogies and Records*.\n\nImmortal Master Shen bore the surname Shen and the given name Taizhi, with the courtesy name Guangxiang.\n\nHis ancestral home was Luoyang, and his lineage descended from Shen Bo of the Zhou dynasty. Thus, the *Book of Poetry* states: *\"The great mountains sent down spirits, giving birth to Fu and Shen.\"* Shen Bo’s virtue was gentle, kind, and upright; he spread prosperity across the four seas and possessed great merit. King Xuan of the Zhou court bestowed upon him a grand chariot and four horses, granting him the southern lands as his domain, where his descendants continued without interruption.\n\nBy the Han dynasty, the illustrious Ancestor Shen emerged, living to over eighty years of age. Emperor Wu, having heard of him, dispatched a comfortable carriage drawn by four horses to welcome him and appointed him Grand Master of the Palace. His later descendants settled in Changsha, many attaining the honor of serving as ministers or chancellors. Those who dispersed and settled in other regions are too numerous to record.\n\nThe ancestral lineage of our forebears flowed and flourished in Shaoling County of Shaozhou—now Liutang Village of Renfeng Township in Shaoyang County of Baoqing Prefecture. They chose their dwelling with care, erecting grand gates and lofty doors. His parents embodied reverence, love, compassion, forbearance, filial piety, and constant kindness.\n\nOne evening, his mother, Lady Yang, dreamed of a divine being descending from the heavens, holding a stalk of purple *zhi* fungus. The spirit crumbled it into pellets, mixed them with water, and had Lady Yang swallow them. She awoke filled with joy and awe. At dawn, she recounted the dream to her clan. Someone remarked, *\"Purple zhi is no ordinary thing—this must be an auspicious omen.\"* Soon after, she conceived.\n\nIn the third year of *Chuigong* during the reign of Empress Wu Zetian of the Tang, in the *dinghai* year of the sexagenary cycle, on the fifth day of the eighth month at the hour of *chen*, he was born. At that moment, divine radiance blazed brilliantly, and auspicious *qi* filled the air. Near and far, people rejoiced, marveling at such joy.\n\nAs the immortal elder grew, his bearing and wisdom were extraordinary. Keen and studious, he mastered the Six Classics, excelled in composition, and strictly guarded against sensual desires, abstaining from meat and fish. Though his family was not wealthy, whenever he saw others in need, he gave generously according to his means. He bore no grudges against those who wronged him.\n\nUpon encountering the scriptures and canons of the Daoist teachings, he grasped their essence at a single glance.\n\nUpon his father’s passing, a divine being guided him to a site, where he buried him at Red Official Mountain to establish the grave, fulfilling his filial duty without the slightest lapse. Before long, he turned his heart away from worldly affairs, preferring seclusion, and grew distant from relatives and friends, yearning instead for the ways of divine transcendents.\n\nOne day, with mind serene and thoughts purified, he journeyed to the Southern Marchmount’s Vermilion Mound Grotto-Heaven. As he trod the jagged cliffs, beneath the shade of trees atop the Peak of Blazing Brightness, he sat upon a rock and sighed: “This place is most refined—why should I not dwell here in verdant solitude?” Suddenly, an old man in a yellow cap and rustic robes, his beard and temples snowy white, strolled leisurely toward his resting spot. The immortal elder rose and bowed in greeting. The old man asked: “Who are you, sighing here?” The immortal elder replied: “I am from Shaoling. Passing through these wondrous peaks, I have grown fond of this tranquil retreat. Yet my destiny is meager, and I cannot stay long—hence my sighs.” The old man said: “Sacred mountains and numinous traces abound everywhere. Why seek afar what lies near? In the land where you dwell, north of Cloud Mountain, atop the summit of Yu Lake, where lotus blooms take root, there is a small yet surpassingly transcendent place—ideal for refining conduct and cultivating the body. The only hindrance is your own lack of resolve.” The immortal elder said: “I humbly seek your instruction.” The old man replied: “I am a Perfected One of the Nine Heavens. Today, I shall transmit to you the essential method.” He reached into his bag and drew forth a scroll, saying: “This is the *Great Achievement of the Golden Elixir and Fire Dragon*—the mechanism for transcending the mortal and entering the sagely. Practice it in secrecy, and you shall attain the Dao. When your way is complete, I shall meet you again in the realm of Great Purity—it will not be too late.” He urged: “Devote yourself to cultivation; do not treat it lightly or grow lax.” Thereupon, the immortal elder prostrated himself in reverent acceptance, filled with awe. In an instant, wind rose and clouds swirled—the old man had already ascended into the mid-heaven. The immortal elder bowed twice more, then departed along the southern mountain path to return home. From that moment, his speech, demeanor, and every movement and stillness differed from before.\n\nHalf a year later, he informed his kinsfolk: “I no longer wish to dwell amid the dust of the world. I intend to seek a secluded place to cultivate body and mind. I bid you all a temporary farewell.” They assented. He then built a thatched hut on Lotus Mountain, erected an alchemical furnace, gathered herbs, and practiced cultivation according to the method. To this day, the alchemical furnace and elixir pool remain on Lotus Mountain. After the elixir was completed, he told the assembly: “Though my elixir is formed, my virtuous deeds are not yet sufficient. I dare not consume it lightly. I shall wear it as I act, using it to aid the state, perform meritorious works, and relieve the people’s burdens. Then, when I enter the Three Realms to serve, I shall do so without shame.” From that time, the immortal elder felt his spirit grow ever clearer and his mind more luminous, penetrating the mysteries of the unseen. He could summon the sun when the sun was called, and bring rain when rain was needed. Concealing or revealing himself at will, he observed worldly affairs as if they lay in his palm. Who did not look up to him in admiration?\n\nIn the twenty-sixth year of the *kaiyuan* era of Emperor Ming of the Tang, the year *wuyin* of the sexagenary cycle, on the sixteenth day of the eighth month, after the morning court, the emperor addressed his ministers: “Last night, I dreamed a divine being told me that north of Cloud Mountain in Hunan, in the land of Shaoling, there is a Daoist of the Shen clan, styled the White Cloud Recluse, who has attained the Dao through alchemical refinement. If we honor him, he may serve as the state preceptor, performing rituals of renewal for the nation to secure blessings and longevity.” The ministers rejoiced and congratulated the emperor, saying: “This is no different from Emperor Gaozong’s dream of Fu Shuo!” Immediately, the Hanlin Academy drafted an edict, and envoys were dispatched to Shaoling to seek him out and deliver the imperial summons. Upon arrival, the prefectural governor appointed officials to accompany the envoys to the cultivation site at Yu Lake on Lotus Mountain, where they indeed found a Daoist of the Shen clan, known as the White Cloud Recluse. By then, his virtue and Dao had reached great heights. He joyfully accepted the summons, not resisting the imperial command, and accompanied the envoys to the capital at Chang’an.\n\nUpon arrival, he was received in audience at the palace. As he discoursed with the emperor, his understanding was profound, grasping ten from one. The emperor called him “Immortal Elder” and bestowed upon him the title *Grand State Preceptor*, decreeing that he reside at the Yuanzhen Abbey to oversee its affairs. He was gifted a thousand-catty golden bell and a hundred-times-refined treasure sword, to perform rituals and prayers for the state. He was granted free access to the imperial court and placed in charge of the Daoist teachings.\n\nOn the night of the Mid-Autumn Festival the following year, the emperor asked the immortal elder: “Can one reach the moon?” The immortal elder replied: “Yes.” Thereupon, together with Master Ye of Serene Heaven and the emperor, they rode the clouds, ascending to the Moon Palace. They saw a plaque inscribed *Mansion of Vast Cold and Pristine Emptiness*. Passing through a great gate, they beheld palaces floating in jade radiance. A chill pervaded the air, dampening their robes and sleeves. The gates were heavily guarded, and they halted at the entrance. After a moment, the immortal elder led them inside, where Emperor Ming beheld a gathering of transcendents and over ten moon maidens in white garments, riding white simurghs, laughing and dancing beneath a great cassia tree. The music was resplendent. Emperor Ming, well-versed in musical theory, listened intently, committing the melodies to memory. In haste, he transcribed the notation, which is the present-day tune:\n\n*Gong liu gong chi / Gong chi si shang / Shang chi shang chi gong / Liu wu liu gong / Liu wu liu chi liu / Gong chi shang chi shang / Si he si shang chi / Shang si shang.*\n\nIn an instant, the immortal elder, Master Ye of Serene Heaven, and the emperor rode the clouds as before, following a whirlwind back to the palace, as if waking from a dream. The next evening, Emperor Ming longed to return, but the immortal elder only smiled and refused. The emperor did not press the matter.\n\nIn the third year of the *tianbao* era, Lady Yang of the imperial harem also entreated the immortal elder to transmit secret scriptures. The following year, on the second day of the second month, the emperor established a precious fast. A paper mat was laid as a mock seat to test him. The immortal elder sat upright, and the mat did not tilt.\n\nThe emperor sighed and said, \"How extraordinary! Truly a person of the divine immortals.\" At that time, the immortal elder left behind a *zhai* offering on the table. The emperor asked, \"What of this *zhai*?\" The elder replied, \"I shall return it to my mother.\" The emperor said, \"The journey is far—when will it arrive?\" The elder answered, \"It will reach her this very evening.\" The emperor did not believe him. Thereupon, he entrusted the *zhai* to the prefect of Shaoling Commandery. Upon arrival, the *zhai* was still warm and fragrant. The prefect immediately memorialized the emperor, and upon examining the date and time, it matched precisely the day the *zhai* had been bestowed. Thus, the emperor and his ministers all revered and believed.\n\nYet the emperor’s affection for Lady Yang was profound. The immortal elder repeatedly entered the inner palace to expound the Dao to him, admonishing, \"You must abstain from sensual desires. Beware the calamity of treacherous ministers who deceive their sovereign, usurp great power, and elevate petty men—while the noble are cast aside.\" However, the emperor neither heeded nor took great care.\n\nOne evening, the golden bell of Yuanzhen Abbey in the capital tolled of its own accord. The officials reported this to the emperor, who summoned the immortal elder and said, \"The divine beings of Mount Hua have foretold that the realm will not know peace, and disaster is imminent. Though this is fated, we may still perform rites of exorcism.\" The following year,果然, the southern barbarians stirred poisonous strife in the south. The immortal elder already knew that the rebellion of An Lushan would gradually take root. He then submitted a memorial to the emperor, begging leave to return to his hometown to perform rituals of exorcism for the state. Yet his longing to return was urgent. The emperor granted his request and presented him with a set of ritual robes made by the imperial consort Chen, who oversaw the preparation of tea and broths and had served the immortal elder for a long time without complaint. The elder said to her, \"You have labored diligently for so long. I have nothing to repay you but this elixir, called *Crimson Snow Pellet*. Take it, and on the day your life ends, consume it. At that time, inform the emperor. After your breath ceases, let your body be placed in the coffin with the lid half-closed, the tomb entrance unsealed. Raise the grave mound high, so your soul may come and go freely, spared the trials of rebirth. After a hundred years, your body will remain uncorrupted. Should a living person’s shadow fall upon you, you will revive, return to the human realm, and become an earthbound immortal.\"\n\nChen received the elixir and thanked the immortal elder, saying, \"If, in the future, I am spared the suffering of rebirth, how could I forget its source?\" Later, when Chen fell gravely ill, she recounted these instructions to the emperor, who followed them all. Her coffin was interred three *li* beyond the palace walls, and her tomb was named *Orchid Prosperity Abbey*. In the seventh year of the *tianbao* era, on the second day of the second month, the emperor ordered the Chancellery and Secretariat to dispatch two eunuchs, Que Ti and Li Zhonggui, to escort the immortal elder’s boat back to Shaoling. At that time, Lady Yang also presented him with a purple robe adorned with gold and pearls. The emperor personally inscribed a plaque for *Yi Tang Abbey* and bestowed it upon the elder, who returned to the mountain to preside over the incense and prayers, bringing fortune to the state and benefit to the people.\n\nUpon returning to the commandery, the elder paid his respects to the prefect and conveyed the emperor’s intentions. He then returned to his hometown at Willow Pond, the site of the present-day Ancestral Foundation Abbey. To the eunuchs, he said, \"The mountain temple is desolate, and I have little to offer you. Here are two elixir pellets. Upon returning to the capital, present them to your kin to alleviate the hardships of worldly toil.\" The envoys received the elixirs, bowed in gratitude, and took their leave. They met with the prefect to obtain travel documents, then set out from the port of Shao River Pond, boarding a boat to cross Dongting Lake and make their winding way back to the capital.\n\nAt the start of their journey, as they passed before the Temple of Great Yu, the two envoys conferred: \"The elixir the immortal elder bestowed must possess divine efficacy. Why wait until we return home to consume it?\" They took water and swallowed the pellets. After a long while, they felt their bodies grow light and their hearts burn with heat. They removed their robes and bathed in the shallow stream beneath the temple. Naturally, their bodies became as light as feathers, capable of soaring into the sky. They said to their attendants, \"Take all our former baggage and return to the capital swiftly. Report these events to our families so all may know.\" The two envoys then vanished into the mountain forests of that place. Occasionally, people saw them coming and going, though none knew their whereabouts. The locals built a temple to honor them, and today, they are known as the Fisher King Wang of Shao River. Some say that after consuming the elixirs and bathing in the water, the fish in that river could no longer be caught by fishermen, and so they were called the *Great King Fishermen*. They befriended Yu the Great and were later collectively revered as the *Three Divine Officials of the Fisher Kings*. They appeared beneath the Yu Hu Mountains in a place called *Cloudy Mist*, where an abbey was built using the emperor’s bestowed plaque.\n\nThus, the teachings were propagated, and blessings were invoked for the state’s longevity and prosperity.\n\nThe imperial court allocated funds and provisions from the local treasury to supply the sacred meals for the multitude of perfected ones. At that time, the immortal elder built an altar upon the surface of the Jizi Pool in the Shao River, performing rites and submitting memorials to sever the incursions of the southern barbarians. To this day, the patterns of the memorial-submitting mat remain visible upon the pool’s surface, unchanged whether the waters rise or fall. Later, when Emperor Minghuang fled to Shu and the crown prince ascended the throne at Lingwu to revive the Great Tang, this was surely the verification of the rites and exorcisms performed through the submitted memorials.\n\nThereafter, the immortal elder inscribed talismans upon water, administered medicinal remedies, and healed the sick. He would occasionally present memorials at the imperial court in Chang’an or attend vegetarian feasts in Luoyang, traveling at dawn and returning by dusk, riding the void and steering the floating clouds. By the eastern riverbank of Shaoling City stood a small stone chamber where the immortal would come and go in seclusion, and in an instant, he would reappear in Luoyang. The local customs, aware of these numinous wonders, still call the place *Luoyang Bay*, a name clearly attested. In the fourteenth year of the Tianbao era, the year *yiwei* (755 CE), on the thirteenth day of the eighth month, the Yang and Er clans gathered for a communal assembly beside the Yitang Abbey. The immortal elder, having accepted their invitation, was met en route by a divine person who presented him with three to five peaches. He carried the peaches to show the assembly, and all marveled in astonishment. When offered the fruit, the elder declined, instead cutting and eating them. In an instant, the faint sounds of celestial hymns resonated through the void, and suddenly, auspicious clouds descended from the summit of Yuhu Peak, accompanied by resplendent immortal music, soaring simurghs and cranes, and fluttering banners. Two crimson-robed figures, adorned with pearls and jade and attended by a retinue, descended obscurely to the abbey. The immortal elder then took leave of the assembly and welcomed the celestial plowmen.\n\nAmong them stood a long millstone over a *zhang* in height, upon which were inscribed vermilion characters in jade script: *\"The Daoist of Shaozhou, Shen Taizhi, having completed the ninefold refinement of the elixir and fulfilled three thousand meritorious deeds, shall now ascend in broad daylight.\"* Gazing upward, one saw multicolored clouds spreading in all directions, with vermilion regalia filling the space before him. The immortal addressed the Daoist assembly, saying: *\"Today, I shed the dust of the mortal world and ascend to the Pure Capital, to endure as long as heaven and earth. Henceforth, should the common folk make entreaties, I shall respond with compassion and grant their prayers. Hereafter, when calamities of fire and tribulation arise, aid one another in secret. Take care to preserve yourselves. The Yitang Abbey shall forever be dedicated to praying for the emperor’s longevity. On the Three Primes, Eight Festivals, Five La Days, and Ten Straight Days, do not neglect the offerings and rites, that the state and its people may receive blessings.\"*\n\nHaving spoken, he ascended into the void. At that time, the immortal visitor was sixty-nine years old. Today, on Yuhu Mountain stands a stone pillar with a flat slab of rock atop it, traditionally known as the *Immortal Elder’s Mounting Platform*. The Daoists of the time drafted a report to the prefecture, and the prefect submitted a memorial to the imperial court. That year, on the thirteenth day of the eighth month, as Emperor Minghuang ascended the throne, he beheld in the distant void an immortal procession riding cranes, their forms arrayed with banners and regalia, flanked by attendants. The emperor and his ministers and officials all gazed in awe. Later that day, the memorial from the prefect of Shaozhou arrived. The chancellors Chen Xilie and Li Linfu presented it to the emperor. Upon reading the memorial, the emperor found that the events described matched precisely what he had witnessed upon the throne—divine immortals manifesting in the heavens. He immediately ordered the prefect of Shaozhou to conduct seasonal sacrifices and rites without negligence.\n\nAs the abbey lay over a hundred *li* from the prefectural seat, making it inconvenient for the prefect and magistrates to pay their respects, another memorial was submitted. The emperor then decreed that an *Kaiyuan Abbey* be established near the city, and on the northern bank of the Shao River, an image of the immortal was to be painted and sculpted for veneration, facilitating worship. A subsequent imperial edict exempted the Shen clan and their relatives within the five degrees of mourning from taxes and corvée. On the day of the immortal elder’s ascension, the gentry and commoners of Qiyang County in Yongzhou saw an immortal riding a white crane through the sky, who descended and left behind a robe at the abbey. They enshrined it and renamed the abbey *White Crane Abbey*, later memorializing the event to the throne.\n\nUpon review, it was found that no other immortals had performed such divine deeds—only Shen Taizhi of Shaozhou had mounted a crane and ascended to heaven in broad daylight. During every ritual assembly at the abbey, the assembled Daoists would reverently carry the robe to the altar and perform the Daoist rites, a tradition preserved through the ages. The immortal elder’s elixir is not to be coveted by those without an immortal’s destiny. As for the mist-veiled mountains and winding paths, they remain the immortal elder’s former retreat, where grottoes and deep caverns, sheer cliffs and towering crags, render entry impossible. Yet the immortal’s traces endure upon the summit’s loftiest peak, accessible only by climbing the verdant slopes. Amidst the mountains, sacred cedars flourish in lush abundance, their years many. The numinous rocks and sacred springs respond unfailingly to prayers.\n\nNow at the mountain gate, the incense and offerings of officials, commoners, scholars, and the masses rise in ceaseless devotion. They pray for the protection of seedlings from blight and for relief from drought, that the land may be nourished and the people prosper—each plea met with swift and unfailing response. White clouds ever veil the cliffs, while boundless fortune steadfastly upholds the nation’s destiny. All under heaven rejoice, and even distant lands erupt in celebration. Thus, this account is recorded to spread its renown, though its benefit be but small.\n\n**Verified Facts of Manifestation**\n\nDuring the Yuanhe era of Emperor Xianzong of the Tang, Xue Zhao served as a constable in the imperial city. While adjudicating a civil dispute, he perverted the law for bribes and was impeached. The Tang legal code was strict, and even a constable’s transgression warranted flogging. Fearing disgrace, Zhao fled beyond the imperial precincts. As dusk fell, he lost his way, wandering in distress, when suddenly an old man appeared. Zhao bowed deeply, pleading with all earnestness for guidance. The elder asked, “What is your name, and why are you here?”\n\nZhao replied, “I am Xue Zhao. Having served corruptly in office, I was impeached and, dreading punishment, fled in haste—only to lose my way.”\n\nZhao then inquired after the elder’s name. “I am the Old Man of Mount Tian,” he answered, “long dwelling in these mountains and versed in the fortunes of men. Since you seek direction, I shall tell you truly how to escape your peril. Not far from here lies a grove of dense woods and towering bamboo. Stay there for now. Should you come upon the Lanchang Palace, conceal yourself within—thus may you evade disaster.”\n\nZhao bowed in gratitude. “If I escape punishment, I shall not forget your kindness and will surely repay this great virtue.”\n\nThe elder replied, “One who defiles his office—what virtue is there to repay?” With that, Zhao took his leave and soon beheld a bamboo grove, within which stood a small pavilion named Lanchang Palace. As the sun dipped low, Zhao’s heart swelled with mingled joy and dread, and he took shelter there.\n\nNear the second watch, the moonlight gleamed bright and clear when suddenly a woman of striking beauty approached. Zhao started in alarm, suspecting her a ghost.\n\n“Are you a ghost or a mortal?” he asked. “How have you come here?”\n\nThe woman answered, “I am no ghost, but Chen, a palace maid who once prepared tea for Emperor Minghuang. At that time, the Daoist adept Shen from Shaoling in Hunan was summoned to court, where the emperor honored him as an immortal elder. He discoursed on the wondrous Dao within the palace, and I, in my service of tea, attended him with utmost sincerity. The immortal elder said to me, ‘Long have you labored in service. As thanks, I offer you this elixir called Crimson Snow Pellet. Swallow it only at the hour of your death. A hundred years hence, should you encounter a living person, you shall return to the mortal realm and attain the rank of earthbound immortal.’”\n\nThe woman then asked, “And who are you? Why have you come here?”\n\nXiao replied, “I am Xue Zhao, a constable of the palace guard. Fearing execution for bending the law, I fled here in exile. Just now, I met an old man who called himself the Old Man of Mount Tian. He directed me here, saying I might escape disaster.”\n\nChen clapped her hands and laughed aloud, “The Old Man of Mount Tian is none other than Immortal Adept Shen! He knew I had dwelt here for a hundred years. Today, the promise of old has truly come to pass—how could this be mere chance?” Zhao suddenly recalled that in his days as a scholar, he had read of such things in Tang chronicles; this encounter was no accident. The two sighed for a long while. Then Chen spoke to Zhao of cloud-like passions and rain-like embraces, and Zhao could not help but yield to the trials of desire’s scroll.\n\nChen said, “Follow me. A short distance from here, a tomb stands wide open. Within, a spacious chamber holds a cinnabar coffin, its lid askew. Inside lies my body.” Chen bade Zhao lift the coffin lid. There he saw a woman with a radiant face, warm to the touch, rising as if from sleep. Her garments were tattered, but her golden hairpins and jade ornaments remained. As dawn broke, Chen instructed Zhao to take the gold and jade to the market, exchanging them for clothing and adornments. Soon after, the two entered Mount Baling and concealed themselves, attaining the rank of earth-traversing immortals.\n\nBy day they ascended in flight, their divine essence long nurtured by magic mushrooms; crimson banners guided them, their immortal destiny fulfilled by frost-peach. Strange indeed! A dream stirred Emperor Minghuang, who sought them out with a cinnabar decree. Glorious! Their fame reached the Most High, who summoned them with jade tones. Once they rode phoenix and dragon; now they harness cranes and mount simurghs. Suddenly leaving the mortal realm, they reverently entered the Dark Capital. Grasping the pivot of creation, they command the thunder’s decree. Prayers for rain are instantly answered; the people’s hardships are always relieved. Their traces appear on the Three Mountains, revealing the Dao as no ordinary way. The elixir refined through nine cycles confirms that their names are no ordinary names.\n\nThis comes only when three thousand deeds are complete, enabling the roc to soar ninety thousand miles. Zhao shines like the sun and moon, stern as frost and ice. His repose brings boundless peace to the world, his blessings vast upon the people. His kindness is broad and selfless; his virtue profound and unchanging. Still and unmoving, his spirit is unknown yet unrecognized, cultivated yet governable and harmonious. The deeper one probes, the more steadfast it seems; the higher one gazes, the loftier it appears. His numinous hemp is unfathomable—glimpsed ahead, then suddenly behind. The transformations of the Dao are measureless; his merit surpasses that of heaven and earth, his virtue resplendent across past and present.\n\nVast above, his spirit shines resplendent. In the former Song dynasty, he received threefold imperial titles of praise; under the Great Yuan, sacred grace repeatedly enhanced his glory. The Dao’s mystery endures—how could it be merely as high as mountains or as distant as rivers? The immortal breeze forever fans, truly as enduring as heaven and earth.\n\nCarefully observing the details of these events, the great cannot be fully recorded, the small cannot be broken down. Examining the transcendent’s wonders, the dead can be revived, the mortal can become immortal. Alas, words fail to fully extol the ineffable!\n\nEmperor Gaozong of the Song dynasty bestowed an imperial title, proclaiming: *\"Exhortation to the Cloud Mound Mountain’s Temple of Benevolence and Kindness in Hengyang County, Hengzhou—Great Immortal of White Clouds.\"*\n\nIn former times, the people of Chu worshipped the Lord of the Clouds, enshrining him in the Longevity Palace, where his dragon-drawn chariot and imperial robes were celebrated in song. Now, upon the mound of Hengyang, there is one who summons auspicious clouds to bring timely rains and dispel drought and pestilence, as recorded in the sacred canons. Recognized among the ranks of immortals, the people revere him and offer devout worship at his temple.\n\nAlas! Could this not be the very radiant spirit of antiquity, soaring afar on the wind? To commend his extraordinary merit, we confer upon him a title of profound virtue, that his benevolent responses may grow ever more manifest, bestowing blessings upon the people.\n\nLet him be specially enfeoffed as *\"Perfected One of Wondrous Stillness.\"*\n\nThe decree is to be reverently obeyed upon receipt. Executed on the twenty-sixth day of the first month, in the twenty-seventh year of the Shaoxing reign.\n\n*Transmission of the Immortal Elder of Cloud Mound Mountain concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "云阜山申仙翁传 经名:云补山申仙翁传.不题撰人.一卷.底本出处:[正统道藏]洞玄部谱录类. 云阜山申仙翁传 仙翁申姓，名泰芝，字广祥。 家世洛阳人，谱系出于周时申伯之裔。 故诗有云维岳降神、生甫及申是也。 申伯之德，柔惠且直，蕃宣四海，有其功德。 朝廷宣王以路车乘马，赐南土而居之，而子孙继承不绝。 迄至于汉，杰出申仙祖翁，年高八十余岁。 武帝有闻，遣安车驷马迎之，封太中大夫。 厥后嗣孙寓长沙，皆仕宦宰相之荣。 及其散徙四方者，不可胜纪。",
      "translated_text": "*The Biography of Immortal Master Shen of Yunfu Mountain*\n\n*Scripture Title:* *The Supplemented Biography of Immortal Master Shen of Yunfu Mountain*. Author unknown. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Section of Cave Mysteries*, *Category of Genealogies and Records*.\n\nImmortal Master Shen bore the surname Shen and the given name Taizhi, with the courtesy name Guangxiang.\n\nHis ancestral home was Luoyang, and his lineage descended from Shen Bo of the Zhou dynasty. Thus, the *Book of Poetry* states: *\"The great mountains sent down spirits, giving birth to Fu and Shen.\"* Shen Bo’s virtue was gentle, kind, and upright; he spread prosperity across the four seas and possessed great merit. King Xuan of the Zhou court bestowed upon him a grand chariot and four horses, granting him the southern lands as his domain, where his descendants continued without interruption.\n\nBy the Han dynasty, the illustrious Ancestor Shen emerged, living to over eighty years of age. Emperor Wu, having heard of him, dispatched a comfortable carriage drawn by four horses to welcome him and appointed him Grand Master of the Palace. His later descendants settled in Changsha, many attaining the honor of serving as ministers or chancellors. Those who dispersed and settled in other regions are too numerous to record.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 218,
      "start_sentence": 0,
      "end_sentence": 11,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.648464918136597,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "惟先祖之宗，流振於邵州邵陵县，今之宝庆府邵阳县仁风乡柳塘村。 卜居，高大门板。 父母以敬爱慈忍孝善於恒心。 一夕，母杨氏夫人梦一神人自空而下，持紫芝一茎，揉碎为丸，与杨氏掬水吞之。 觉而喜惧不已。 及至旦明，以梦告於· 族属。 有曰紫芝非凡矣，必有祥瑞。 因而有妊。 时於唐则天顺圣皇后垂拱三年，岁次丁亥，八月初五日辰时诞生。 是时神光灿烂，瑞气冲盈，远近欢呼，莫不嗟讶，何喜如之。 仙翁既长，器识不凡，敏而好学，六经通晓，善属文，深戒色欲，断荤腥。 其奈家不甚厚，每见因穷，随力赠给。 人有犯而不校，观其玄教经科，一览．备悉。",
      "translated_text": "The ancestral lineage of our forebears flowed and flourished in Shaoling County of Shaozhou—now Liutang Village of Renfeng Township in Shaoyang County of Baoqing Prefecture. They chose their dwelling with care, erecting grand gates and lofty doors. His parents embodied reverence, love, compassion, forbearance, filial piety, and constant kindness.\n\nOne evening, his mother, Lady Yang, dreamed of a divine being descending from the heavens, holding a stalk of purple *zhi* fungus. The spirit crumbled it into pellets, mixed them with water, and had Lady Yang swallow them. She awoke filled with joy and awe. At dawn, she recounted the dream to her clan. Someone remarked, *\"Purple zhi is no ordinary thing—this must be an auspicious omen.\"* Soon after, she conceived.\n\nIn the third year of *Chuigong* during the reign of Empress Wu Zetian of the Tang, in the *dinghai* year of the sexagenary cycle, on the fifth day of the eighth month at the hour of *chen*, he was born. At that moment, divine radiance blazed brilliantly, and auspicious *qi* filled the air. Near and far, people rejoiced, marveling at such joy.\n\nAs the immortal elder grew, his bearing and wisdom were extraordinary. Keen and studious, he mastered the Six Classics, excelled in composition, and strictly guarded against sensual desires, abstaining from meat and fish. Though his family was not wealthy, whenever he saw others in need, he gave generously according to his means. He bore no grudges against those who wronged him.\n\nUpon encountering the scriptures and canons of the Daoist teachings, he grasped their essence at a single glance.",
      "overlap_context": "s as his domain, where his descendants continued without interruption.\n\nBy the Han dynasty, the illustrious Ancestor Shen emerged, living to over eighty years of age. Emperor Wu, having heard of him, dispatched a comfortable carriage drawn by four horses to welcome him and appointed him Grand Master of the Palace. His later descendants settled in Changsha, many attaining the honor of serving as ministers or chancellors. Those who dispersed and settled in other regions are too numerous to record.",
      "start_char": 218,
      "end_char": 470,
      "start_sentence": 12,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.238727569580078,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "及父丧，遇神人指以地，葬於红衙山为之宅兆，尽其孝道，冈．有亏也。 未几，无心於世，好其厦处，疏於亲友之交，慕神仙之事。 ．一日，澄神洗思，访游南岳朱陵洞天，践履巉岩之际，陆彼祝融峰上木阴之下，坐其岩石之上，叹曰：此中甚有佳致，何惜元绿居此。 俄有一老叟黄冠野服，髭鬓皓然，散诞徜徉，来于憩所，仙翕起而揖之。 叟乃问日：子何人也，在此叹息？ 仙翁答曰：吾乃邵陵人也，暂游胜盘，爱此清闲，自恨绿薄，不获久驻，所以叹息。 ．叟复有云：名山灵迹，在在有之，何道在近而求诸远耶？ 子所居之地，幸有云山之北、余胡之巅、莲荷之托，亦有小小超绝去处，可以炼行修身，但患子之无心耳。 仙翕日：愿求指教。 叟日：吾乃九天真人，今授子之要法。 乃探囊取书一帐，日：此即金丹火龙大成之旨，为超凡入圣之机，密而行之，方得成道。 道成之日，吾当邂逅子於大罗之境未晚也。 切宜精修，幸勿轻泄懈息。 於是仙翕俯伏拜受，钦慕不已。 俄顷之问，风飞云起，叟已在半天矣。 仙翁再拜，违南山径归故里。 自是笑谈应对，动息之问，与平昔不同也。 半年之久，又告族属：我今不欲处於尘俗，拟求隐地修养身心，敢以暂别左右。 诸人允诺。 於是就莲荷山盖覆庵寮，立丹鳌，采药物，按法修炼。 今莲荷山有丹鳌、丹池尚存。 丹成之后，告之众日：我丹药虽成，善行未备，不敢轻服，佩而行之，当为助国立功，济民累行，他时入侍三境，诚无愧矣。 仙翁自此转觉神清黑爽，洞达幽冥，曰旸而旸，曰雨而雨，隐显变化，坐观世事如指诸掌。 孰不仰羡？ 至明皇开元二十六年戊寅之岁八月十六，朝罢，帝谓群臣日：朕自昨宵梦一神人告朕云，湖南云山之北，邵陵之地，有申姓道人，号曰白云居士，以炼丹成而悟道。 若礼之，可为国师，必能与国家修禳而获福寿。 群臣喜而称贺于帝：此犹高宗梦传说而无异也。 即劲翰林草韶，遣使奉韶往邵陵寻访而宣诏之。 韶到，郡守委官同奉使於余胡莲荷修炼之所，果有申姓道人称白云居士。 时已道德清高，欣然从诏，不逆上命，即同诏使前赴长安帝都。 到日→ 承宣入殿，与帝谈论，闻一知十。 帝称为仙翁，赐号大国师，劫旨住持元真观事，赐千斤金锺、百炼宝剑，与国焚修祝愿，许其出入禁廷，主领玄教。 次年八月中秋夜，帝谓仙翕曰：月中可以到否？ 仙翁答日：可也。 遂同叶静天师与帝拥从乘云，至于月殿之下，见榜曰广寒清虚之府，过一大门，在玉光中乃飞浮宫殿，常有寒气逼人，湿濡襟袖，见其门兵严卫，止於门下。 少焉，仙翕引进，明皇得见仙众及素娥十余人，衣皓衣，乘白鸾，笑舞於大桂树下。 乐音响亮，明皇素解音律，奖览而意已得传，仓忙抄写曲谱，即今之工六工尺  工尺四上  上尺上尺工  六吾六工  六吾六尺六  工尺上尺上  四合四上尺  上四上之字是也。 顷刻，仙翁、叶静天师与帝依前乘云，随逐旋风，若醉寤而还宫阙。 次夕，明皇意求再往，仙翕但笑而不允，帝亦无咎矣。 天宝三年，明皇宫中杨贵妃亦恳仙翁受传秘录。 次年二月二日，上建宝斋，设纸席伪座而试之，仙翁端坐而席不倾。",
      "translated_text": "Upon his father’s passing, a divine being guided him to a site, where he buried him at Red Official Mountain to establish the grave, fulfilling his filial duty without the slightest lapse. Before long, he turned his heart away from worldly affairs, preferring seclusion, and grew distant from relatives and friends, yearning instead for the ways of divine transcendents.\n\nOne day, with mind serene and thoughts purified, he journeyed to the Southern Marchmount’s Vermilion Mound Grotto-Heaven. As he trod the jagged cliffs, beneath the shade of trees atop the Peak of Blazing Brightness, he sat upon a rock and sighed: “This place is most refined—why should I not dwell here in verdant solitude?” Suddenly, an old man in a yellow cap and rustic robes, his beard and temples snowy white, strolled leisurely toward his resting spot. The immortal elder rose and bowed in greeting. The old man asked: “Who are you, sighing here?” The immortal elder replied: “I am from Shaoling. Passing through these wondrous peaks, I have grown fond of this tranquil retreat. Yet my destiny is meager, and I cannot stay long—hence my sighs.” The old man said: “Sacred mountains and numinous traces abound everywhere. Why seek afar what lies near? In the land where you dwell, north of Cloud Mountain, atop the summit of Yu Lake, where lotus blooms take root, there is a small yet surpassingly transcendent place—ideal for refining conduct and cultivating the body. The only hindrance is your own lack of resolve.” The immortal elder said: “I humbly seek your instruction.” The old man replied: “I am a Perfected One of the Nine Heavens. Today, I shall transmit to you the essential method.” He reached into his bag and drew forth a scroll, saying: “This is the *Great Achievement of the Golden Elixir and Fire Dragon*—the mechanism for transcending the mortal and entering the sagely. Practice it in secrecy, and you shall attain the Dao. When your way is complete, I shall meet you again in the realm of Great Purity—it will not be too late.” He urged: “Devote yourself to cultivation; do not treat it lightly or grow lax.” Thereupon, the immortal elder prostrated himself in reverent acceptance, filled with awe. In an instant, wind rose and clouds swirled—the old man had already ascended into the mid-heaven. The immortal elder bowed twice more, then departed along the southern mountain path to return home. From that moment, his speech, demeanor, and every movement and stillness differed from before.\n\nHalf a year later, he informed his kinsfolk: “I no longer wish to dwell amid the dust of the world. I intend to seek a secluded place to cultivate body and mind. I bid you all a temporary farewell.” They assented. He then built a thatched hut on Lotus Mountain, erected an alchemical furnace, gathered herbs, and practiced cultivation according to the method. To this day, the alchemical furnace and elixir pool remain on Lotus Mountain. After the elixir was completed, he told the assembly: “Though my elixir is formed, my virtuous deeds are not yet sufficient. I dare not consume it lightly. I shall wear it as I act, using it to aid the state, perform meritorious works, and relieve the people’s burdens. Then, when I enter the Three Realms to serve, I shall do so without shame.” From that time, the immortal elder felt his spirit grow ever clearer and his mind more luminous, penetrating the mysteries of the unseen. He could summon the sun when the sun was called, and bring rain when rain was needed. Concealing or revealing himself at will, he observed worldly affairs as if they lay in his palm. Who did not look up to him in admiration?\n\nIn the twenty-sixth year of the *kaiyuan* era of Emperor Ming of the Tang, the year *wuyin* of the sexagenary cycle, on the sixteenth day of the eighth month, after the morning court, the emperor addressed his ministers: “Last night, I dreamed a divine being told me that north of Cloud Mountain in Hunan, in the land of Shaoling, there is a Daoist of the Shen clan, styled the White Cloud Recluse, who has attained the Dao through alchemical refinement. If we honor him, he may serve as the state preceptor, performing rituals of renewal for the nation to secure blessings and longevity.” The ministers rejoiced and congratulated the emperor, saying: “This is no different from Emperor Gaozong’s dream of Fu Shuo!” Immediately, the Hanlin Academy drafted an edict, and envoys were dispatched to Shaoling to seek him out and deliver the imperial summons. Upon arrival, the prefectural governor appointed officials to accompany the envoys to the cultivation site at Yu Lake on Lotus Mountain, where they indeed found a Daoist of the Shen clan, known as the White Cloud Recluse. By then, his virtue and Dao had reached great heights. He joyfully accepted the summons, not resisting the imperial command, and accompanied the envoys to the capital at Chang’an.\n\nUpon arrival, he was received in audience at the palace. As he discoursed with the emperor, his understanding was profound, grasping ten from one. The emperor called him “Immortal Elder” and bestowed upon him the title *Grand State Preceptor*, decreeing that he reside at the Yuanzhen Abbey to oversee its affairs. He was gifted a thousand-catty golden bell and a hundred-times-refined treasure sword, to perform rituals and prayers for the state. He was granted free access to the imperial court and placed in charge of the Daoist teachings.\n\nOn the night of the Mid-Autumn Festival the following year, the emperor asked the immortal elder: “Can one reach the moon?” The immortal elder replied: “Yes.” Thereupon, together with Master Ye of Serene Heaven and the emperor, they rode the clouds, ascending to the Moon Palace. They saw a plaque inscribed *Mansion of Vast Cold and Pristine Emptiness*. Passing through a great gate, they beheld palaces floating in jade radiance. A chill pervaded the air, dampening their robes and sleeves. The gates were heavily guarded, and they halted at the entrance. After a moment, the immortal elder led them inside, where Emperor Ming beheld a gathering of transcendents and over ten moon maidens in white garments, riding white simurghs, laughing and dancing beneath a great cassia tree. The music was resplendent. Emperor Ming, well-versed in musical theory, listened intently, committing the melodies to memory. In haste, he transcribed the notation, which is the present-day tune:\n\n*Gong liu gong chi / Gong chi si shang / Shang chi shang chi gong / Liu wu liu gong / Liu wu liu chi liu / Gong chi shang chi shang / Si he si shang chi / Shang si shang.*\n\nIn an instant, the immortal elder, Master Ye of Serene Heaven, and the emperor rode the clouds as before, following a whirlwind back to the palace, as if waking from a dream. The next evening, Emperor Ming longed to return, but the immortal elder only smiled and refused. The emperor did not press the matter.\n\nIn the third year of the *tianbao* era, Lady Yang of the imperial harem also entreated the immortal elder to transmit secret scriptures. The following year, on the second day of the second month, the emperor established a precious fast. A paper mat was laid as a mock seat to test him. The immortal elder sat upright, and the mat did not tilt.",
      "overlap_context": "y.\n\nAs the immortal elder grew, his bearing and wisdom were extraordinary. Keen and studious, he mastered the Six Classics, excelled in composition, and strictly guarded against sensual desires, abstaining from meat and fish. Though his family was not wealthy, whenever he saw others in need, he gave generously according to his means. He bore no grudges against those who wronged him.\n\nUpon encountering the scriptures and canons of the Daoist teachings, he grasped their essence at a single glance.",
      "start_char": 470,
      "end_char": 1670,
      "start_sentence": 25,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.85648202896118,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "上叹日：异哉，真神仙中人也。 时仙翁乃留余斋在几，帝问曰：留斋何如？ 答日：归以遗母。 帝曰：路程甚远，何时可到？ 答曰：今晚可到。 帝亦未信。 遂附斋与邵陵郡守，到郡，斋尚温芬。 郡守随即具表谢帝，看详日时，果赐斋之日同也。 於是帝与臣僚无不钦信。 惟帝爱慕贵妃之情甚厚，仙翁累入内庭与帝讲解，因进谏日：宜戒色欲，为患防其奸臣蔽主，窃弄大权，小人在位则君子在野。 然帝不见用，亦不甚谨。 一夕，京城元真观金锺不扣自呜，有司奏闻。 帝召仙翕，日：西岳神人报云，国家不宁，祸乱将至。 虽曰有数，亦可修禳。 明年果见南蛮衅毒南方。 仙翁已知有安禄山之变将渐萌矣，仙翁乃上表辞帝，乞归故里，为国按法禳之，奈归心甚切。 帝亦从请，乃劲宫中陈氏制法衣一袭以赠行色。 时陈氏系掌侍茶汤之职，供侍仙翁甚久，未尝惮劳。 仙翁谓陈氏日：日久有劳心勤，无以为谢，有药一丸名绛雪丹，赠汝。 候命终之日，方服此丹，至时可告于帝听。 若气绝之后，以身入棺，但盖半掩，冢门勿塞，可高大其墓坟，令汝魂魄出入自若，不受输回厄难。 百年之时，汝身不坏。 遇生人之黑，令汝死而复生，即还人道，得为地仙矣。 陈氏受丹，称谢仙翁日：妾若他日命终，得免轮回之苦，敢忘所自耳。 其后陈氏病危之时，以前事告帝，皆从所请，安葬陈氏棺柩出禁城三里之外，题其墓曰兰昌宫。 后天宝七年二月二日，帝劫中书门下省遣中官二员雀提、李中贵等护送仙舫还於邵陵。 是时贵妃亦制紫服一领，以金珠装饰而赠之。 御笔亲书劫赐宜唐观额，与仙翁还山主持香火，福国利民。 回郡，参见太守，具述圣意，遂归故里柳塘，即今祖基观是也。 仙翁谓中官日：山门寂寥，殊乏奉待，有丹药二丸赠送，回京见其六亲方可吞服，以释尘劳之难。 来使受丹，叔谢告别，往见太守，请给回文，取路从邵河塘口渡，买舟过洞庭，迤迩可回京国。 初起程，至大禹庙前，二使相与语曰：仙翁赠丹，必有神验，何必到家方服？ 遂取水吞之。 良久，觉身轻心燥热，即解衣浴於庙下浅流之中，自然身轻欲羽，势可腾空。 乃与从者日：一切曩囊尽付汝辈，急速归京，以此事的报家人，各宜知悉。 二使遂隐入彼处山林中。 有时人或见其出入，罔知所在，邦人立庙奉把，今之邵江渔父王是也。 或云二人服丹后浴於水中，其江内之鱼自此之后渔猎之人皆不能获其鱼，因此号为渔父大王，与禹王为友，后总称渔父三位灵官。 见於余胡山下，地名云霖，建观宇以前劫额为用。 於是阐扬教法，与国祝寿降祥。",
      "translated_text": "The emperor sighed and said, \"How extraordinary! Truly a person of the divine immortals.\" At that time, the immortal elder left behind a *zhai* offering on the table. The emperor asked, \"What of this *zhai*?\" The elder replied, \"I shall return it to my mother.\" The emperor said, \"The journey is far—when will it arrive?\" The elder answered, \"It will reach her this very evening.\" The emperor did not believe him. Thereupon, he entrusted the *zhai* to the prefect of Shaoling Commandery. Upon arrival, the *zhai* was still warm and fragrant. The prefect immediately memorialized the emperor, and upon examining the date and time, it matched precisely the day the *zhai* had been bestowed. Thus, the emperor and his ministers all revered and believed.\n\nYet the emperor’s affection for Lady Yang was profound. The immortal elder repeatedly entered the inner palace to expound the Dao to him, admonishing, \"You must abstain from sensual desires. Beware the calamity of treacherous ministers who deceive their sovereign, usurp great power, and elevate petty men—while the noble are cast aside.\" However, the emperor neither heeded nor took great care.\n\nOne evening, the golden bell of Yuanzhen Abbey in the capital tolled of its own accord. The officials reported this to the emperor, who summoned the immortal elder and said, \"The divine beings of Mount Hua have foretold that the realm will not know peace, and disaster is imminent. Though this is fated, we may still perform rites of exorcism.\" The following year,果然, the southern barbarians stirred poisonous strife in the south. The immortal elder already knew that the rebellion of An Lushan would gradually take root. He then submitted a memorial to the emperor, begging leave to return to his hometown to perform rituals of exorcism for the state. Yet his longing to return was urgent. The emperor granted his request and presented him with a set of ritual robes made by the imperial consort Chen, who oversaw the preparation of tea and broths and had served the immortal elder for a long time without complaint. The elder said to her, \"You have labored diligently for so long. I have nothing to repay you but this elixir, called *Crimson Snow Pellet*. Take it, and on the day your life ends, consume it. At that time, inform the emperor. After your breath ceases, let your body be placed in the coffin with the lid half-closed, the tomb entrance unsealed. Raise the grave mound high, so your soul may come and go freely, spared the trials of rebirth. After a hundred years, your body will remain uncorrupted. Should a living person’s shadow fall upon you, you will revive, return to the human realm, and become an earthbound immortal.\"\n\nChen received the elixir and thanked the immortal elder, saying, \"If, in the future, I am spared the suffering of rebirth, how could I forget its source?\" Later, when Chen fell gravely ill, she recounted these instructions to the emperor, who followed them all. Her coffin was interred three *li* beyond the palace walls, and her tomb was named *Orchid Prosperity Abbey*. In the seventh year of the *tianbao* era, on the second day of the second month, the emperor ordered the Chancellery and Secretariat to dispatch two eunuchs, Que Ti and Li Zhonggui, to escort the immortal elder’s boat back to Shaoling. At that time, Lady Yang also presented him with a purple robe adorned with gold and pearls. The emperor personally inscribed a plaque for *Yi Tang Abbey* and bestowed it upon the elder, who returned to the mountain to preside over the incense and prayers, bringing fortune to the state and benefit to the people.\n\nUpon returning to the commandery, the elder paid his respects to the prefect and conveyed the emperor’s intentions. He then returned to his hometown at Willow Pond, the site of the present-day Ancestral Foundation Abbey. To the eunuchs, he said, \"The mountain temple is desolate, and I have little to offer you. Here are two elixir pellets. Upon returning to the capital, present them to your kin to alleviate the hardships of worldly toil.\" The envoys received the elixirs, bowed in gratitude, and took their leave. They met with the prefect to obtain travel documents, then set out from the port of Shao River Pond, boarding a boat to cross Dongting Lake and make their winding way back to the capital.\n\nAt the start of their journey, as they passed before the Temple of Great Yu, the two envoys conferred: \"The elixir the immortal elder bestowed must possess divine efficacy. Why wait until we return home to consume it?\" They took water and swallowed the pellets. After a long while, they felt their bodies grow light and their hearts burn with heat. They removed their robes and bathed in the shallow stream beneath the temple. Naturally, their bodies became as light as feathers, capable of soaring into the sky. They said to their attendants, \"Take all our former baggage and return to the capital swiftly. Report these events to our families so all may know.\" The two envoys then vanished into the mountain forests of that place. Occasionally, people saw them coming and going, though none knew their whereabouts. The locals built a temple to honor them, and today, they are known as the Fisher King Wang of Shao River. Some say that after consuming the elixirs and bathing in the water, the fish in that river could no longer be caught by fishermen, and so they were called the *Great King Fishermen*. They befriended Yu the Great and were later collectively revered as the *Three Divine Officials of the Fisher Kings*. They appeared beneath the Yu Hu Mountains in a place called *Cloudy Mist*, where an abbey was built using the emperor’s bestowed plaque.\n\nThus, the teachings were propagated, and blessings were invoked for the state’s longevity and prosperity.",
      "overlap_context": "waking from a dream. The next evening, Emperor Ming longed to return, but the immortal elder only smiled and refused. The emperor did not press the matter.\n\nIn the third year of the *tianbao* era, Lady Yang of the imperial harem also entreated the immortal elder to transmit secret scriptures. The following year, on the second day of the second month, the emperor established a precious fast. A paper mat was laid as a mock seat to test him. The immortal elder sat upright, and the mat did not tilt.",
      "start_char": 1670,
      "end_char": 2644,
      "start_sentence": 66,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.412693977355957,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "帝劫本州支给钱粮，供真膳众。 彼时仙翁於邵河箕子潭水面建坛，作法拜章，断隔南蛮。 今潭面上有拜章席纹，水长水落，其纹如故。 其后明皇幸蜀，太子即位，灵武中兴大唐，此必拜章修禳之验也。 仙翁由是书符呎水，行药治病。 时复奏事於长安帝庭，或赴洛阳斋会，朝游暮返，策空驾浮。 而邵陵城束河畔有小石室，仙访往来其中隐遁，顷刻又在洛阳矣。 风俗通知灵异，至今号曰洛阳湾，显然可据。 至天宝十四年，岁在乙未，八月十三日，由杨二姓集社，会於宜唐观侧。 仙翁亦承其请，中途遏神人与桃三五颗，因持桃颗见示社人，举皆嗟叹。 献之，长宿不受，遂剖而食之。 须臾之问，彷佛闻太空步虚之声，忽尔余胡峰顶祥云下覆，仙乐响亮，鸾鹤飞腾，旌幢杂还，内朱衣二人，珠翠拥从，隐隐下至观所。 仙爷遂辞杜众，迎礼仙耕。 中有长磨一首丈余，上赤书玉字题日：邵州道士申泰芝，丹成九转，行满三千，今当白日上升。 仰视彩云四布，绛节满前。 仙前嘱之道众曰：吾今脱离尘世，升陆清都，与天地相为长久。 今后凡民有请，吾当感而遂通。 此后必遇劫火患难，但阴相扶持。 各宜保重，所有宜唐观，永远为祝圣人寿。 遇三元、八节、五腊、十直之辰，勿亏醮奉，福国及民。 言讫，腾空而去。 时仙访年已六十九矣。 今余胡山有石柱，上横平石一片，世传此为仙翁上马台。 道士比时结状申州，太守具表闻奏朝廷。 其年八月十三日，明皇登殿之际，遥见虚空有仙仗驾鹤，形仪持幢执节卫列左右。 帝与朝臣庶士咸皆瞻视。 一日，邵州太守表到，丞相陈希烈，李林甫捧表达· 御。 上览所奏，事因帝登殿遥见太空现神仙之仪相符而合。 即劝下邵州守，令四时宜加祭谒，母辄息慢。 本观去州百余里，守令往来礼谒不便，复为闻奏。 次劝守令於近城创立开元观，於邵河之北绘塑仙像崇奉，以便祭祀。 续降劝旨，凡申氏之族，五服之内，并劲兔租税。 仙翁上升之日，永州祁阳县士庶人等见一仙人乘白鹤浮空而来，飞下仙衣一领於道观之所，收之安奉，因易其观名日白鹤观，亦为闻奏。 看详，皆别无神仙事故，惟邵州申泰芝白日跨鹤飞升天也。 其观每遇法会，请众捧衣达坛行道，历世传闻不泯。 仙翁之丹，世无仙分不可觊觎。 至于云山胜盘，犹存仙翁昔日栖真之所，岩穴深邃，峭壁巉岩，不可得进，并存仙迹於峰巅绝顶，攀绿而上，可得见之。 山问灵杉蓊郁，历年多矣。 灵岩圣水，请祷辄应。",
      "translated_text": "The imperial court allocated funds and provisions from the local treasury to supply the sacred meals for the multitude of perfected ones. At that time, the immortal elder built an altar upon the surface of the Jizi Pool in the Shao River, performing rites and submitting memorials to sever the incursions of the southern barbarians. To this day, the patterns of the memorial-submitting mat remain visible upon the pool’s surface, unchanged whether the waters rise or fall. Later, when Emperor Minghuang fled to Shu and the crown prince ascended the throne at Lingwu to revive the Great Tang, this was surely the verification of the rites and exorcisms performed through the submitted memorials.\n\nThereafter, the immortal elder inscribed talismans upon water, administered medicinal remedies, and healed the sick. He would occasionally present memorials at the imperial court in Chang’an or attend vegetarian feasts in Luoyang, traveling at dawn and returning by dusk, riding the void and steering the floating clouds. By the eastern riverbank of Shaoling City stood a small stone chamber where the immortal would come and go in seclusion, and in an instant, he would reappear in Luoyang. The local customs, aware of these numinous wonders, still call the place *Luoyang Bay*, a name clearly attested. In the fourteenth year of the Tianbao era, the year *yiwei* (755 CE), on the thirteenth day of the eighth month, the Yang and Er clans gathered for a communal assembly beside the Yitang Abbey. The immortal elder, having accepted their invitation, was met en route by a divine person who presented him with three to five peaches. He carried the peaches to show the assembly, and all marveled in astonishment. When offered the fruit, the elder declined, instead cutting and eating them. In an instant, the faint sounds of celestial hymns resonated through the void, and suddenly, auspicious clouds descended from the summit of Yuhu Peak, accompanied by resplendent immortal music, soaring simurghs and cranes, and fluttering banners. Two crimson-robed figures, adorned with pearls and jade and attended by a retinue, descended obscurely to the abbey. The immortal elder then took leave of the assembly and welcomed the celestial plowmen.\n\nAmong them stood a long millstone over a *zhang* in height, upon which were inscribed vermilion characters in jade script: *\"The Daoist of Shaozhou, Shen Taizhi, having completed the ninefold refinement of the elixir and fulfilled three thousand meritorious deeds, shall now ascend in broad daylight.\"* Gazing upward, one saw multicolored clouds spreading in all directions, with vermilion regalia filling the space before him. The immortal addressed the Daoist assembly, saying: *\"Today, I shed the dust of the mortal world and ascend to the Pure Capital, to endure as long as heaven and earth. Henceforth, should the common folk make entreaties, I shall respond with compassion and grant their prayers. Hereafter, when calamities of fire and tribulation arise, aid one another in secret. Take care to preserve yourselves. The Yitang Abbey shall forever be dedicated to praying for the emperor’s longevity. On the Three Primes, Eight Festivals, Five La Days, and Ten Straight Days, do not neglect the offerings and rites, that the state and its people may receive blessings.\"*\n\nHaving spoken, he ascended into the void. At that time, the immortal visitor was sixty-nine years old. Today, on Yuhu Mountain stands a stone pillar with a flat slab of rock atop it, traditionally known as the *Immortal Elder’s Mounting Platform*. The Daoists of the time drafted a report to the prefecture, and the prefect submitted a memorial to the imperial court. That year, on the thirteenth day of the eighth month, as Emperor Minghuang ascended the throne, he beheld in the distant void an immortal procession riding cranes, their forms arrayed with banners and regalia, flanked by attendants. The emperor and his ministers and officials all gazed in awe. Later that day, the memorial from the prefect of Shaozhou arrived. The chancellors Chen Xilie and Li Linfu presented it to the emperor. Upon reading the memorial, the emperor found that the events described matched precisely what he had witnessed upon the throne—divine immortals manifesting in the heavens. He immediately ordered the prefect of Shaozhou to conduct seasonal sacrifices and rites without negligence.\n\nAs the abbey lay over a hundred *li* from the prefectural seat, making it inconvenient for the prefect and magistrates to pay their respects, another memorial was submitted. The emperor then decreed that an *Kaiyuan Abbey* be established near the city, and on the northern bank of the Shao River, an image of the immortal was to be painted and sculpted for veneration, facilitating worship. A subsequent imperial edict exempted the Shen clan and their relatives within the five degrees of mourning from taxes and corvée. On the day of the immortal elder’s ascension, the gentry and commoners of Qiyang County in Yongzhou saw an immortal riding a white crane through the sky, who descended and left behind a robe at the abbey. They enshrined it and renamed the abbey *White Crane Abbey*, later memorializing the event to the throne.\n\nUpon review, it was found that no other immortals had performed such divine deeds—only Shen Taizhi of Shaozhou had mounted a crane and ascended to heaven in broad daylight. During every ritual assembly at the abbey, the assembled Daoists would reverently carry the robe to the altar and perform the Daoist rites, a tradition preserved through the ages. The immortal elder’s elixir is not to be coveted by those without an immortal’s destiny. As for the mist-veiled mountains and winding paths, they remain the immortal elder’s former retreat, where grottoes and deep caverns, sheer cliffs and towering crags, render entry impossible. Yet the immortal’s traces endure upon the summit’s loftiest peak, accessible only by climbing the verdant slopes. Amidst the mountains, sacred cedars flourish in lush abundance, their years many. The numinous rocks and sacred springs respond unfailingly to prayers.",
      "overlap_context": "d bathing in the water, the fish in that river could no longer be caught by fishermen, and so they were called the *Great King Fishermen*. They befriended Yu the Great and were later collectively revered as the *Three Divine Officials of the Fisher Kings*. They appeared beneath the Yu Hu Mountains in a place called *Cloudy Mist*, where an abbey was built using the emperor’s bestowed plaque.\n\nThus, the teachings were propagated, and blessings were invoked for the state’s longevity and prosperity.",
      "start_char": 2644,
      "end_char": 3576,
      "start_sentence": 106,
      "end_sentence": 144,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.489896774291992,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "今山门香火，官民士庶，御苗捍旱，泽物利民，影响报应。 白云长锁於岩前，洪福永扶於国祚。 普天称庆，易地腾欢。 谨留行状以广闻，岂小补云尔。 证验事实 唐宪宗元和间，薛昭为禁城捕尉，出理民讼，枉法受赂，被其斜弹。 时。 唐法严明，捕尉犯之，亦须棰楚。 昭惧受辱，遂潜逃出於禁城之外。 天色将暮，迷失路径，彷徨四顾，忽遇一老叟，昭揖之，下、情无任以求指迷。 叟问日：汝何姓氏在此？ 答日：姓薛名昭，居官不清，被其斜弹，恐惧罪责，所以逃此，而迷失道路。 昭复问叟何氏，答日：我是田山叟，久居山林，知人休咎。 既求指迷，吾当以实告汝，可免忧难。 此去不远，有茂林修竹，汝暂住此问。 见兰昌宫者便宜隐此，即可兔难。 昭谢日：若得免罪，亦不忘也，当报大德。 叟日：守官不洁，何望有德报欤？ 昭遂揖别老叟前去，见竹林间果有小亭名兰昌宫。 维时日将颓，昭心快然，喜惧交作，遂柄其亭。 将至二更时，月华皎洁，忽见一女子容貌妖烧，迤逦近前，昭心大惊，疑其是鬼。 昭问日：汝是鬼耶，人耶？ 何由至此？ 女子答曰：妾非鬼也，乃明皇宫中掌茶汤之女陈氏。 时有湖南邵陵申道人在朝，明皇以仙翁称之，诏入禁城，演谈妙道。 妾侍荼汤，无不尽诚。 仙翁与妾言日：久劳供侍，无以为谢，出药一丸名绛雪丹，祝妾候命终之时方可吞服，百年后遇生人，复还人道，当得为地仙。 女子复问日：汝何姓氏？ 绿何至此？",
      "translated_text": "Now at the mountain gate, the incense and offerings of officials, commoners, scholars, and the masses rise in ceaseless devotion. They pray for the protection of seedlings from blight and for relief from drought, that the land may be nourished and the people prosper—each plea met with swift and unfailing response. White clouds ever veil the cliffs, while boundless fortune steadfastly upholds the nation’s destiny. All under heaven rejoice, and even distant lands erupt in celebration. Thus, this account is recorded to spread its renown, though its benefit be but small.\n\n**Verified Facts of Manifestation**\n\nDuring the Yuanhe era of Emperor Xianzong of the Tang, Xue Zhao served as a constable in the imperial city. While adjudicating a civil dispute, he perverted the law for bribes and was impeached. The Tang legal code was strict, and even a constable’s transgression warranted flogging. Fearing disgrace, Zhao fled beyond the imperial precincts. As dusk fell, he lost his way, wandering in distress, when suddenly an old man appeared. Zhao bowed deeply, pleading with all earnestness for guidance. The elder asked, “What is your name, and why are you here?”\n\nZhao replied, “I am Xue Zhao. Having served corruptly in office, I was impeached and, dreading punishment, fled in haste—only to lose my way.”\n\nZhao then inquired after the elder’s name. “I am the Old Man of Mount Tian,” he answered, “long dwelling in these mountains and versed in the fortunes of men. Since you seek direction, I shall tell you truly how to escape your peril. Not far from here lies a grove of dense woods and towering bamboo. Stay there for now. Should you come upon the Lanchang Palace, conceal yourself within—thus may you evade disaster.”\n\nZhao bowed in gratitude. “If I escape punishment, I shall not forget your kindness and will surely repay this great virtue.”\n\nThe elder replied, “One who defiles his office—what virtue is there to repay?” With that, Zhao took his leave and soon beheld a bamboo grove, within which stood a small pavilion named Lanchang Palace. As the sun dipped low, Zhao’s heart swelled with mingled joy and dread, and he took shelter there.\n\nNear the second watch, the moonlight gleamed bright and clear when suddenly a woman of striking beauty approached. Zhao started in alarm, suspecting her a ghost.\n\n“Are you a ghost or a mortal?” he asked. “How have you come here?”\n\nThe woman answered, “I am no ghost, but Chen, a palace maid who once prepared tea for Emperor Minghuang. At that time, the Daoist adept Shen from Shaoling in Hunan was summoned to court, where the emperor honored him as an immortal elder. He discoursed on the wondrous Dao within the palace, and I, in my service of tea, attended him with utmost sincerity. The immortal elder said to me, ‘Long have you labored in service. As thanks, I offer you this elixir called Crimson Snow Pellet. Swallow it only at the hour of your death. A hundred years hence, should you encounter a living person, you shall return to the mortal realm and attain the rank of earthbound immortal.’”\n\nThe woman then asked, “And who are you? Why have you come here?”",
      "overlap_context": "ed by those without an immortal’s destiny. As for the mist-veiled mountains and winding paths, they remain the immortal elder’s former retreat, where grottoes and deep caverns, sheer cliffs and towering crags, render entry impossible. Yet the immortal’s traces endure upon the summit’s loftiest peak, accessible only by climbing the verdant slopes. Amidst the mountains, sacred cedars flourish in lush abundance, their years many. The numinous rocks and sacred springs respond unfailingly to prayers.",
      "start_char": 3576,
      "end_char": 4134,
      "start_sentence": 145,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.986328601837158,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "昭答日：姓薛名昭，为禁城捕尉，枉法惧诛，来窜於此，适遇一老叟称日田山叟，指我来此，可以逃难。 陈氏拍掌大笑日：田山叟即申仙翁也，知妾居此百年矣。 今日果应昔许之事，岂偶然哉？ 昭猛省吾为书生时，尝观唐传有载，亦非偶尔而遇。 二人叹息良久，陈氏乃以云情雨态告昭，昭不免伸谴卷之难，陈氏日：汝可随我往此，咫尺之问有冢门大开，其中广阔，朱棺尚存而其盖参差，中乃妾之身也。 陈氏令昭举其棺盖，果见一女子面目皎然，温暖而起，衣服坏烂，惟存首饰金璧。 至天色渐明，陈氏令昭将金璧斋之于市，制换衣棠，与陈氏装饰。 未几，俱入霸陵山而隐，得为地行仙矣。 白日飞升，知神质久种於芝草； 朱幢接引，谅仙绿适满於冰桃。 异哉，梦感於明皇，寻膺丹诏； 盛矣，声闻於太上，续奉玉音。 蚓尝蹑凤乘龙，可以縿鸾跨鹤。 顿离凡境，敬造玄都。 握造化之枢机，司雷霆之号令。 旱祷辄应，民难必扶。 迹着三山，已见道非常道； 丹成九转，稔知名匪常名。 抑由行满三千，始可鹏搏九万。 昭如日月，凛若冰霜。 息渐寰宇以无疆，福被生民而甚大。 仁博而爱，惠我元私； 妙合而凝，寂然不动。 灵则不知而不识，修而可治而可平。 钻之弥坚，仰之弥高。 神麻莫测，瞻之在前，忽然在后； 道化难量，功优於天上人问，德显於今来古往。 洋洋在上，濯濯厥灵。 前宋加封，徽号三承於褒美； 大元崇杞，圣恩累降以增辉。 道黑常存，奚啻山高而水远？ 仙风永扇，信同地久以天长。 切观事纪之详，大莫能载，小莫能破； 次察真人之妙，魄可使返，凡可使仙。 叹莫难尽赞扬不可思议。",
      "translated_text": "Xiao replied, “I am Xue Zhao, a constable of the palace guard. Fearing execution for bending the law, I fled here in exile. Just now, I met an old man who called himself the Old Man of Mount Tian. He directed me here, saying I might escape disaster.”\n\nChen clapped her hands and laughed aloud, “The Old Man of Mount Tian is none other than Immortal Adept Shen! He knew I had dwelt here for a hundred years. Today, the promise of old has truly come to pass—how could this be mere chance?” Zhao suddenly recalled that in his days as a scholar, he had read of such things in Tang chronicles; this encounter was no accident. The two sighed for a long while. Then Chen spoke to Zhao of cloud-like passions and rain-like embraces, and Zhao could not help but yield to the trials of desire’s scroll.\n\nChen said, “Follow me. A short distance from here, a tomb stands wide open. Within, a spacious chamber holds a cinnabar coffin, its lid askew. Inside lies my body.” Chen bade Zhao lift the coffin lid. There he saw a woman with a radiant face, warm to the touch, rising as if from sleep. Her garments were tattered, but her golden hairpins and jade ornaments remained. As dawn broke, Chen instructed Zhao to take the gold and jade to the market, exchanging them for clothing and adornments. Soon after, the two entered Mount Baling and concealed themselves, attaining the rank of earth-traversing immortals.\n\nBy day they ascended in flight, their divine essence long nurtured by magic mushrooms; crimson banners guided them, their immortal destiny fulfilled by frost-peach. Strange indeed! A dream stirred Emperor Minghuang, who sought them out with a cinnabar decree. Glorious! Their fame reached the Most High, who summoned them with jade tones. Once they rode phoenix and dragon; now they harness cranes and mount simurghs. Suddenly leaving the mortal realm, they reverently entered the Dark Capital. Grasping the pivot of creation, they command the thunder’s decree. Prayers for rain are instantly answered; the people’s hardships are always relieved. Their traces appear on the Three Mountains, revealing the Dao as no ordinary way. The elixir refined through nine cycles confirms that their names are no ordinary names.\n\nThis comes only when three thousand deeds are complete, enabling the roc to soar ninety thousand miles. Zhao shines like the sun and moon, stern as frost and ice. His repose brings boundless peace to the world, his blessings vast upon the people. His kindness is broad and selfless; his virtue profound and unchanging. Still and unmoving, his spirit is unknown yet unrecognized, cultivated yet governable and harmonious. The deeper one probes, the more steadfast it seems; the higher one gazes, the loftier it appears. His numinous hemp is unfathomable—glimpsed ahead, then suddenly behind. The transformations of the Dao are measureless; his merit surpasses that of heaven and earth, his virtue resplendent across past and present.\n\nVast above, his spirit shines resplendent. In the former Song dynasty, he received threefold imperial titles of praise; under the Great Yuan, sacred grace repeatedly enhanced his glory. The Dao’s mystery endures—how could it be merely as high as mountains or as distant as rivers? The immortal breeze forever fans, truly as enduring as heaven and earth.\n\nCarefully observing the details of these events, the great cannot be fully recorded, the small cannot be broken down. Examining the transcendent’s wonders, the dead can be revived, the mortal can become immortal. Alas, words fail to fully extol the ineffable!",
      "overlap_context": " He discoursed on the wondrous Dao within the palace, and I, in my service of tea, attended him with utmost sincerity. The immortal elder said to me, ‘Long have you labored in service. As thanks, I offer you this elixir called Crimson Snow Pellet. Swallow it only at the hour of your death. A hundred years hence, should you encounter a living person, you shall return to the mortal realm and attain the rank of earthbound immortal.’”\n\nThe woman then asked, “And who are you? Why have you come here?”",
      "start_char": 4134,
      "end_char": 4752,
      "start_sentence": 174,
      "end_sentence": 208,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.5615975856781,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "宋高宗皇帝加封拙叫命：劝衡州衡阳县云阜山仁惠庙白云大仙。 昔楚人祀云中君而舍之於寿宫，龙驾帝服见乎歌咏。 今衡阳之阜有能以云气致嘉雨驱旱疠，载在彝典。 称为列仙，邦人德之，揭虔于庙。 呜呼，岂昔之所谓灵皇皇而飕远举者； 聊褒厥异功，锡之冲号，益孚善应，以泽斯民。 可特封妙寂真人。 奉劲如，右牒到奉行。 绍兴二十七年正月二十六日 云阜山申仙翁传竟 #1『时』原作『是』，据文义改。",
      "translated_text": "Emperor Gaozong of the Song dynasty bestowed an imperial title, proclaiming: *\"Exhortation to the Cloud Mound Mountain’s Temple of Benevolence and Kindness in Hengyang County, Hengzhou—Great Immortal of White Clouds.\"*\n\nIn former times, the people of Chu worshipped the Lord of the Clouds, enshrining him in the Longevity Palace, where his dragon-drawn chariot and imperial robes were celebrated in song. Now, upon the mound of Hengyang, there is one who summons auspicious clouds to bring timely rains and dispel drought and pestilence, as recorded in the sacred canons. Recognized among the ranks of immortals, the people revere him and offer devout worship at his temple.\n\nAlas! Could this not be the very radiant spirit of antiquity, soaring afar on the wind? To commend his extraordinary merit, we confer upon him a title of profound virtue, that his benevolent responses may grow ever more manifest, bestowing blessings upon the people.\n\nLet him be specially enfeoffed as *\"Perfected One of Wondrous Stillness.\"*\n\nThe decree is to be reverently obeyed upon receipt. Executed on the twenty-sixth day of the first month, in the twenty-seventh year of the Shaoxing reign.\n\n*Transmission of the Immortal Elder of Cloud Mound Mountain concludes.*",
      "overlap_context": "aise; under the Great Yuan, sacred grace repeatedly enhanced his glory. The Dao’s mystery endures—how could it be merely as high as mountains or as distant as rivers? The immortal breeze forever fans, truly as enduring as heaven and earth.\n\nCarefully observing the details of these events, the great cannot be fully recorded, the small cannot be broken down. Examining the transcendent’s wonders, the dead can be revived, the mortal can become immortal. Alas, words fail to fully extol the ineffable!",
      "start_char": 4752,
      "end_char": 4941,
      "start_sentence": 209,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.629039287567139,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\云阜山申仙翁传.txt",
        "category": "谱箓类"
      }
    }
  ]
}