{
  "source_id": "会仙女志",
  "source_file": "chunked_daozang\\会仙女志.json",
  "total_chunks": 12,
  "total_original_chars": 5471,
  "total_translated_chars": 30678,
  "total_translation_time": 171.53765559196472,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\会仙女志.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface to *Records of Meeting a Celestial Maiden***\n*(By Li Hu of the Ming Dynasty)*\n\nThe Immortal Historian of Xuan Yang once heard tales of the Celestial Maiden in his youth and scoffed, \"These are baseless fabrications.\" He set them aside without inquiry. Later, encountering such accounts in miscellaneous unofficial histories and novels, he sighed, \"These are distortions piled upon distortions. To believe all one reads is worse than having no books at all.\" He shut them away, unread. Yet in the *xin-mao* year of the Jiajing era (1531), when he was but twenty and dwelling alone in the Grotto-Heaven of Xuan Yang, he suddenly met a Celestial Maiden—an encounter most extraordinary. Only then did he believe that what he had heard and seen before was no mere illusion. Thus, he composed twenty-four *Heavenly Questions*, one *Rhapsody on the Celestial Maiden*, and one *Song of the Immortal Historian*, collectively titled *Records of Meeting a Celestial Maiden*. Inscribed on the fifth day of the third month in the *ren-zi* year of Jiajing (1552) by Li Hu, the Immortal Historian of Xuan Yang of Kuaiji.\n\n---\n\n**On the Eclipses of the Sun and Moon**\n\nIn the *xin-mao* year of Jiajing, the Immortal Historian of Xuan Yang, barely twenty, was studying the *Book of Changes* in the secluded depths of the Grotto-Heaven of Xuan Yang. Far removed from worldly ties, he gathered his spirit, embraced the One, and delved into profound contemplation. One night, the sky was crystalline, moonlight streamed through the curtains, an uncommon fragrance filled the chamber, and purple qi billowed like mist. Opening the door to look, he saw a maiden of sixteen or seventeen, her skin soft as cream, her raven tresses cascading, her bearing refined and dignified. Clad in white robes, she moved with unhurried grace, drawing nearer. He quickly shut the door and sat in silent meditation.\n\nMoments later, a knock sounded. The Immortal Historian asked, \"What immortal are you?\"\nThe maiden replied, \"I am a maiden.\"\nHe said, \"Are you a maiden who has eloped in lust, or a demon or ghost in disguise?\"\nShe answered, \"I am a spirit of the Celestial Palace, come from Penglai and Yingzhou. I share a predestined bond with you and wish to serve as your attendant.\"\nHe said, \"A man’s infatuation may yet be excused, but a woman’s infatuation cannot. Had you come before me, you would have been rebuked by Confucius. To elope under cover of night is to be scorned by all. I am betrothed to a daughter of the Chen family but have not yet wed—thus, I too am a maiden. To accept an eloping maiden would bring disgrace upon me in the eyes of the world. Return at once, lest you bring me shame.\"\nShe replied, \"Light-minded youths abandon propriety, flitting among flowers and willows, stealing jade and fragrance, peering through boudoirs, burrowing through walls. Yet you see my beauty and feel no desire—this proves you are no ordinary man. I shall speak with you of the mysteries of the *zi-wu* cavern, reveal the secrets of Heaven and Earth, and expound the essence of yin and yang. Do not mistake me for an eloping ghost or demon. I hope you will receive me as Zhan Qin did, not reject me as the man of Lu did.\"\nHe said, \"If you can discourse on the profound and reveal its secrets, this is what I delight to hear. But I fear you may not be capable.\"\nShe said, \"Will you not at least put me to the test?\"\nThus, he lit a candle, unbolted the door, and invited her to the outer chamber. They sat facing one another, sipping tea as she expounded. Her reasoning was lucid, her principles incisive—surely she was no denizen of the mortal realm. Composing himself, he asked, \"You claim to be a spirit of the Celestial Palace, come from Penglai and Yingzhou—are you then a Celestial Maiden?\"\nShe said, \"Indeed.\"\nHe asked, \"If you are truly a Celestial Maiden, from whence do such beings arise?\"\nShe replied, \"The body of Heaven is light and pure, neither perishing nor arising. The essences of the stars and constellations may be turbid or clear. The turbid fall as stones, while the clear condense into spirits. Thus, they may alight upon birds and beasts, becoming phoenixes or qilin; upon grasses and trees, becoming lingzhi or chun; or upon a mother’s womb, giving birth to sages and worthies. They become wisdom and intelligence; on earth, they are humans, in Heaven, stars. The *Book of Documents* records their riding the *Ji* and *Wei* constellations—this is plainly evident. My origins are thus; who but you could fathom them?\"\nHe asked, \"Since ancient times, how many stars have transformed into humans?\"\nShe said, \"Celestial Maidens sent down to the mortal realm, veiled in dust, are recorded in books—those who foreknew my heart. The Weaving Maiden of the Horn constellation wed Dong Yong in filial devotion. The Immortal Sisters of Shaoshi sought a match with Feng Sheng. The Jiang Fei met Zheng on the riverbank and bestowed her girdle-pendant. At Blue Bridge, Pei met the immortal Xuan Ying. The examples are too many to recount in full.\"\n\nShe said, \"Dong Yong met the Celestial Maiden, who wove to aid his poverty. I, too, am a poor scholar—can you weave?\"\n\nShe replied, \"Yin and yang unite in harmony; like gathers with like, kind with kind. The Weaving Maiden of the Horn constellation was matched with Dong, a farmer. I am versed in letters and know you as a master of literature. Seeking a match by talent, I wish to follow you for life. The Dao, when mastered, brings wealth—no profit compares to its cultivation. Weaving to aid you is not what I have heard of.\"\n\nHe said, \"You are a banished immortal of wondrous power; Heaven’s records must be clear. I pose a question of Heaven—will you answer for me?\"\n\nShe said, \"Very well.\"\n\nThereupon, he rose and asked:\n\nHe asked, \"The Way of the Three Powers encompasses Heaven, Earth, and Humankind. How do the Five Phases conjoin essence to form male and female?\"\n\nShe said, \"In the Great Beginning, there was no origin—only primordial chaos, vast and indistinct. Uncarved and undivided, the Two Modes had not yet separated. Through transformation, the Supreme Polarity emerged from emptiness. Heaven opened at the *zi* position, Earth split at the *chou* palace. Humankind arose in the *yin* hour—thus the Three Powers were united as one. The Five Phases manifested in full, and the myriad things flourished in shared abundance. The diagrams of Zhou and Zhu’s teachings—why do you not believe and follow them?\"\n\nHe asked, \"How many thousands of myriad *li* separate Heaven and Earth? Where do East and West fall short? How can their measures be recorded?\"\n\nShe said, \"Heaven’s height cannot be scaled by steps; its distance from Earth—who could ascend to clarify it? Measuring shadows and gauging light, all is vast and obscure. Though reckoned at over two hundred million, none grasp its truth. The reckoning of the four directions—do not place undue faith in such depths.\"\n\nHe asked, \"Heaven is the white of *mao*; Earth is the yellow of *mao*. Why does Heaven envelop the outer, while Earth conceals the inner?\"\n\nShe said, \"When Heaven opened and Earth split, yellow and white first divided. At the inception of the Great Beginning, the metaphor of *mao* became clear. Heaven, pure, forms the upper canopy; Earth, turbid, bears the lower. Heaven enfolds Earth, yet Heaven congeals below in reverse. If Heaven seems beneath Earth, its turbidity only deepens. The *Gaitian* theory is most profound—its scrutiny must be precise.\"\n\nHe asked, \"Heaven’s body is an upper canopy, light and pure, covering all things. A single *qi* pervades it—why then does the Northwest tilt?\"\n\nShe said, \"A single *qi* ascends, vast and undifferentiated. The Dao of Heaven revolves leftward, swiftly shifting and changing. East, West, South, and North—no former position remains. Gazing upward, all appears azure and boundless. What is West or North? What wanes or waxes? Who can reach its realm to witness the Northwest’s tilt? Human words are untrustworthy—only your own heart can believe.\"\n\nHe asked, \"Heaven’s body is undifferentiated—how could it have fissures or leaks? Daring to inquire of the divine: could one refine stone to mend Heaven?\"\n\nShe said, \"Light and pure, it ascends—one *qi* perfectly fused. Originally without fissure or leak, why await mending labor? Above, though gaps may be mended, no ladder reaches them. Heaven’s position remains unsettled, primordial chaos still swirling. Nüwa refined stone, and the five colors first divided: the East’s Wood mended with blue, the South’s Fire with red, the North’s Water with black, the Center with yellow, and Metal with white—each of the five directions distinct. Thus was the Dao of Heaven mended, a work of imperial majesty.\"\n\nHe asked, \"Heaven’s body is an upper canopy, Earth’s body congeals below. What do the sun and moon rely upon as they revolve and circle endlessly?\"\n\nShe said, \"The sun and moon are the essence of yin and yang. A single *qi* revolves, day and night unceasing. Compare them to the blood and *qi* circulating through the body. Empty and unsupported, they move above and below—must they cling to some solidity, forcing Heaven and Earth to congeal?\"\n\nHe asked, \"Nothing is greater than the sun and moon, celestial images radiating light. What virtue does the moon possess that it dies and revives?\"\n\nShe said, \"The moon’s essence borrows the sun’s light. Radiant above, it is seen from below. Like a silver sphere, each beholds but one side. Hanging in the void, its inverted reflection reveals even the finest detail. The yin essence gleams pure, waxing and waning without harm. Knowing your wide learning, I conceal nothing in my words.\"\n\nHe asked, \"The sun is the essence of yang...\"\n\n\"Why does the crow have three legs? The moon dies and revives—why is the hare said to dwell within its belly?\"\n\nShe replied, \"A human life spans a hundred years—how much time truly remains? Light and shadow flee swiftly, like the hare’s dash or the bird’s flight. These are forced interpretations, mere borrowed tales: the hare pounds, the crow perches. Four legs belong to the even, three to the odd. The moon has no triple burrow—where then should the hare reside?\"\n\nHe asked, \"Yi’s wife, Chang’e, was no different from other mortals. What divine elixir did she steal to flee to the lunar palace?\"\n\nShe said, \"The moon embodies yin essence, while Chang’e possessed yin numen. A celestial image devoid of human presence—such names are but allegory. What divine elixir did she steal? Yi’s wife could ascend. Why resent the frost’s chill? Why begrudge solitary lodging? Such vulgar verses as Shangyin’s—best not to heed them.\"\n\nHe asked, \"The cinnamon tree within the moon—what divine root sustains it? The sacred grove bears fruit—from whence came such fine seed?\"\n\nShe replied, \"Autumn’s cassia unfurls its hues, its literary battles fierce and flourishing. Towering talent soars high, the cassia’s blossoms scaling lofty heights. Like ascending to the celestial court, the ascent is steep and arduous. The toad palace’s cinnamon—its fame is thus renowned. Lingyin’s associations are mere fable, though its cassia seeds exude fragrance. Planted and bearing fruit, their taste is pungent and sweet. Master Xu’s discourse has long dispelled such absurdities.\"\n\nHe asked, \"The moon’s black and white hues intermingle in uneven measure. How do the shadows of mountains and rivers dispel all doubts?\"\n\nShe replied, \"The sun and moon bear the essence of brightness and darkness. Black and white manifest in clarity, reflecting forms and discerning colors. The eye’s pupil is dark, yet the *Yijing* speaks of ‘abundant white.’ Eyes with too much white suffer from dissipation, dizziness, and obstruction. By observing these very eyes, the supreme principle is known. The shadows of mountains and rivers follow no fixed pattern. How could such vulgar delusions shatter widespread confusion?\"\n\nHe asked, \"When the sun and moon eclipse, their brightness wanes and waxes. The *Spring and Autumn Annals* records none of this—why do you not explain it fully?\"\n\nShe replied, \"Heaven has nine paths, with the Yellow Path at their center. Sun and moon share the same degree, yet their alignments differ when they meet. When their paths diverge, the moon darkens; when they converge, the sun is veiled. The sun stands above the moon, but the moon obscures the sun’s radiance. When the moon strays from its usual course, the sun darkens within the lunar palace. The depth of the eclipse varies with the degree of transgression. When an eclipse is predicted but does not occur, the calendar’s calculations are flawed.\"\n\nHe asked, \"In Emperor Yao’s first year, why did ten suns appear? How could Yi shoot them down, leaving only one?\"\n\nShe replied, \"Emperor Yao’s flourishing age—its records are no falsehood.\"\n\nWhen Zi Zhi threw governance into chaos, calamities and portents assailed the land. The sun’s light churned and raged, its ferocity unbearable. Blinding as ten suns, it scorched the crops to nothing. The mandate fell to Yi to rescue the harvest—he shot the suns, their bodies tumbling down. Like a sword halted mid-swing, like the Lu halberd brandished, his arrows flew. The *Huainanzi*’s wild fabrications only sowed doubt.\n\nHe asked, “The stars arrayed across the vast heavens—boundless and measureless—occupy distinct positions in the five directions. What forms do they take, and what names do they bear?”\n\nShe replied, “The essence of the ten thousand images ascends to become the arrayed stars. The flower of primal *qi* has no form, no name. Songs praise their layered brilliance; tales speak of their nocturnal glow. What is the Dipper? What is the Winnowing Basket? What is Emptiness? What is the Three Stars? Gazing at the images and toying with divination, men forcibly assign them names. The eastern star is not truly the Long-Lost Star, nor is the western one truly the Dawn Star. The five directions hold distinct positions, but their names depend on what people call them.”\n\nHe asked, “The Northern Dipper’s seven stars—one line likens them to seven swine. Guan Lu, though clad in commoner’s robes, spoke of them—what did he mean?”\n\nShe replied, “Jiang Taigong’s hooked jade and divine water drew upon the power of water’s virtue. Emperor Gao of Han slew the serpent, claiming it wept on behalf of the gods. What deity dwells in the Northern Dipper? Merely a meal laid beneath the pines—a discarded jar in an abandoned garden, a staff-bearing servant—what could he possibly obtain? These two men fabricated their words, seeking to lend their arts an air of mystery. How could the guilt of Wang’s old mother be absolved in seven days? How could Zhao Yan’s lifespan be extended by weeping?”\n\nHe asked, “The Weaving Maid and the Herdboy—two stars borne in the heavens. When the seventh night arrives, what feeling attends their meeting?”\n\nShe replied, “The forms of the constellations are recorded in detail in the *Songs*. In *Greater East*, the Winnowing Basket and the Dipper coil north and south. The Basket gives rise to winnowing, the Dipper to brewing. Yet even these cannot be trusted—how much less the celebration of the Milky Way’s bridge? The shuttle and the heddle, those two stars’ names are clear. What brocade do they weave? What fields do they till? That man and woman should share affection—such words are even more absurd.”\n\nHe asked, “Zhang Qian rode a raft—how did he ascend to heaven? The Weaving Maid’s loom stone—why is it passed down?”\n\nShe replied, “Zhang Qian was a Han minister, sent as an envoy to the Western Regions. His raft-borne journey through the heavens was a frivolous tale spun by those fond of marvels. The sky holds no immortal maidens—what loom? What weaving? The shuttle and batten are empty—what loom stone could there be? Even the diviner Junping—could he alone recognize it? Zhang Qian’s official biography makes no mention of it. The *Huazhi* and *Bowu* record no such wonders. Such delusions defy reason—do not sink into them.”\n\nHe asked, “From where does thunder arise? What spirit does thunder possess? Why does it strike to kill? Why is it said to administer punishment?”\n\nShe replied, “Thunder lies within the earth before the myriad things are born. Yin and yang clash, colliding to form it. It is like a fire-cannon—its principle is quite clear. Fire strikes within, exploding into sound. Firelight flashes and flickers, dazzling the eyes to conjure spirits. When things are damaged, Heaven has no intent. It stirs the myriad things—how could its power administer punishment?”\n\nHe asked, “When thunder’s fire burns fiercely, axe-chips are left behind. Where are they placed? By what are they governed?”\n\nShe replied, “Thunder and lightning blaze fiercely, their striking force violent. It is like a boiling vessel cast into a well—what was hot turns to solid ice. Thunder is not the earth’s drum—how could one speak of axe-chips? Heaven’s voice is mighty and swift, interwoven with divine transformation. It soars and crackles through the sky, yet near the turbid earth, it sinks and congeals. Thus it becomes dregs, its chip-form indestructible. Like a dragon soaring upward, snow clumps are left behind. Its name lingers stubbornly—hence the backward glance at axe-chips.”\n\nHe asked, “Nothing is more numinous than the dragon—why does it bring rain? Attached to qi and transforming, how can it draw water?”\n\nShe replied, “When yin and yang harmonize and flow, cloud-qi steams and rises. Torrential rains descend, and the dragon follows the clouds. The dragon’s lair lies in rivers and seas—Heaven holds no dragon essence. The divine dragon transforms and soars through the sky. Clouds rise to bring rain—rain is not the dragon’s creation.”\n\nHe asked, “Mountains and rivers give rise to clouds, their qi congealing to form them. What does this reveal about the dragon? How does it produce rain?”\n\nShe replied, “Mountains store qi; rivers accumulate qi. When Heaven and Earth first opened, a single qi presided. Not only mountains and rivers—all clouds and rain arise from it. Rivers hold water, and water is the mother of rain. The dragon’s downward transformation and upward extension—descending to become rain—is the child returning to its mother. Qi accumulates and expands; where there are mountains, there are clouds. Clouds are the wings of rain. The dragon’s downward depression and upward steaming—spreading to become rain—is the husband answering his wife. Qi is stored and expands: mountains naturally rise, and what rises becomes clouds, for clouds follow ascending qi. The dragon’s power draws them forth. Rivers naturally descend, and what descends becomes water, for water follows descending qi. The dragon’s power seethes within. Thus, above and below are not obstructed by intermediate forms, and the Two Modes achieve profound transformation.”\n\nHe asked, “Winter snow falls in six-pointed flakes, while spring snow falls in five—”\n\n“Heaven produces flowering trees—by what means does the Swallow Maiden appear?”\n\nHe replied, “When rain and snow fall thickly, winter’s cold congeals and freezes. In the depths of winter, yin flourishes, and six-pointed flakes form. When spring arrives, five-pointed flakes appear as yang qi gradually arises. Yin and yang shift and transform, altering the six and five. The *Yan Hua Jun Lun* invokes heaven to assert its divinity, but the ‘Swallow Maiden’ is a banished immortal, counterfeit and not true.”\n\nHe asked, “What are the Nine Paths arrayed? What are the names of the Nine Heavens? What governs the Ten Beginnings? What do the Eight Pillars support?”\n\nHe replied, “The heavens have no Nine Paths—only intersecting and jumbled alignments. They are fixed as the Five Colors, and their names are forcibly assigned. The Nine Heavens and Eight Pillars share a common meaning. Wang Yi’s erroneous annotations—what do the Eight Mountains support? The Ten Beginnings are contradictory, arbitrarily linked to the Five Phases. The *Fan Lu* is verbose and incoherent, fragmented and unorthodox.”\n\nHe asked, “Shun’s jade was once presented to the Queen Mother of the West. The Eight Steeds of King Mu of Zhou raced to the feast with his mother. The tripods of the Yellow Emperor at Mount Dinghu transformed his artisans. King Ling’s flying chariot soared as clouds and songs filled Miao Terrace. Emperor Wu of Han’s jade casket and silver bridge traced the arc of *Nishang*. The Eight Lads and Nine Elders of Huainan, the cloud-hounds and celestial roosters—what are these wonders? Are they truly immortals, or are immortals truly emperors and kings?”\n\nHe replied, “The great principle embraces pent-up longing as dragons and clouds gather in assembly. Feasting on nine *hai* of artemisia, cultivating the scriptures through generations—bodies aligned with crimson clouds, jade tablets extending their legacy. The Mysterious Heaven’s pivot turns, music resonating with the celestial harmony. Tasting the marrow of phoenixes, wielding majesty and the *Hong Fan*, commanding the authority of Heaven’s Net. Thus, the First Dragon lashed the stones, and sea spirits came to pay homage. When King Wu sought spring, fire swiftly answered his call. Illusions and transformations align—Heaven’s power remains unfathomable.”\n\nThe *Heavenly Questions* could not confound her, and the Immortal Historian rose once more to speak: “The celestial responses are profoundly abstruse—you truly possess the power to unveil their mysteries, discoursing on the arcane and expounding the subtle. What I have longed to hear, I have now heard. But can you compose the *Rhapsody on the Immortal Maiden*?”\n\nThe Immortal Maiden thereupon took up her brush and wrote:\n\n**Rhapsody on the Immortal Maiden**\n\n“She is the spirit of the {herb}-bound palace, the essence of the starry ranks.\nNurtured by yin and yang to perfect her nature, shaped by transformation to form her being.\nRobed in cloud-garments and draped in rosy brocade, she knows the future and conceals the past.\nShe feasts on stone marrow and drinks jade nectar, her inner radiance containing the subtlest signs.\n\nAt times, she roams the Northern Sea at dawn and lodges in Red Mound by dusk.\nHer crimson countenance mirrors the sun, her cloud-like tresses congeal in autumn’s chill.\nNow she soars beyond the heavens, now she parts the void to emerge from obscurity.\nAlas, our late encounter was ill-fated, like a pearl cast into darkness.\nHer steps advance yet hesitate to retreat; her heart yearns to depart but lingers still.\nFortunate to have the door opened for her, she sits in company, sipping tea while gazing intently.\nLike Dong Ji’s steadfast aid, not the wanton frolics of the Jiang fei.\nHer thoughts seek skill at the northern window, not idle verses on an eastern tower.\n\nYet parting comes easily, reunion is hard; gatherings may scatter.\nShe has no fixed abode, no constant pastimes.\nHer spirit is serene and dignified, her integrity unswerving.\nNever drowned in the chambers of desire, her Dao first ascends the distant shore.\nWith you, she discusses the mysteries of the Zi-Wu caves, surpassing Tang and Song.\nShe reveals the secrets of yin and yang, outshining Qin and Han.\nHer grasp of principle and righteousness grows ever keener, her illumination of culture ever more resplendent.\nHow could she delight in the glow of green reeds, or indulge in the glitter of jeweled pillows?\nShe dispels the gloom of dark mists, like the sun at dawn’s first light.\n\nDo not be stubborn or self-reliant—one must rely on others.\nConsider the noble man who follows the Dao, seeking worthy scholars as plum blossoms seek the multitude.\nLike the waiting maiden, she fears missing her moment, as the *Ge Tan* laments lost time.\nFollowing propriety yet unrecognized, she conceals her brilliance and prays for obscurity.\nHer actions and pauses follow acceptance or rejection; her advances and retreats await twilight or dawn.\nShe humbly offers her lowly self, cherishing hope, yielding to human sentiment and its vicissitudes.\nAshamed that her talents pale beside Tian Sheng’s elixir of radiant hues, or the cloud-dweller’s cold ashes rekindled to smoke.\nNot a fleeting union of human hearts, but Heaven’s will bending to preserve.\nKnow that the mayfly’s evening is short—envy the tortoise and crane’s long years.\nNot all mortals return to yellow earth; I have already attained the primordial.\n\nIn the end, I transcend immortality and shed the mundane—do not catch the fish and forget the trap.\nYet Ge Hong had a wife, the Queen Mother a son-in-law—why do you spurn the clear breeze and wander alone, ascending white clouds in lofty detachment?\nDo not cling to self and regret; why not rely on others to accomplish great deeds?\nThings may stir emotions in unison, yet paths may align while actions diverge.\nAt first, the choice was unclear; now you must grasp its intent.\nIf even you fail to know the joy of being an immortal maiden, how could I fathom the profit of worldly ties?”\n\nThereupon, she paced beneath the dew-laden eaves, melancholy in the glow of Yang’e.\nGrieving for her tangled sorrows, to whom could she entrust them? She poured out her lament to the vast moon in song:\n\n*‘A chance meeting—true feeling absent,*\n*Face to face a thousand li, the moon’s emptiness.*\n*Standing in the wind, a deep sigh—where will it end?’*\n\nBefore the song’s echo faded, the lingering light waned.\nHer expression turned mournful, her gaze lost as if bereft.\nShe sang again:\n\n*‘The bright moon has set, the dew thickens,*\n*Time does not return—where shall I turn?*\n*Yet the appointed hour may come—my heart will not betray.’”*\n\nThe Immortal Historian said, “Excellent! Can you now compose the *Song of the Immortal Historian* in my stead?”\n\nThe Immortal Maiden took up her brush once more and wrote:\n\n**Song of the Immortal Historian**\n\n“My birth fell when wood entered the Dipper, the Eastern Well’s cry guarded the Wall.\nThe Wall governs literature, the Dipper bestows years—my words spread among the people.\nAt three, I could speak and recite poetry; at four, I pointed to characters and knew them all.\nAt five, I crafted lines on emptiness and fullness, pairing green steeds and yellow steeds in wondrous symmetry.\nWhen guests arrived, I composed short verses on the spot—four rhymes required no eight-fold clasping of hands.\nAt nine, I had read the Six Classics in full, reciting them from memory without pause.\nMy bearing was as graceful as an autumn crane, my countenance as fresh as a spring willow.\nIn my village, teachers and elders favored me; at school, I scorned the company of children.\nI dissected distinctions with thread-like precision, striving to cultivate fine grain and uproot weeds.\nMy brush danced with five colors ablaze; leaning on a horse, I would not let a single word falter.\nI sought to bind dragons and serpents with bare hands—wealth and honor were as easy to grasp as mustard seeds.\n\nYet in the literary arena, my gallop ended in a stumble; my mane bristled, my head bowed in defeat.\nReturning home, I burned incense through long nights, too preoccupied to wash the dust from my face.\nI tempered my blade, awaiting the dawn of renewed glory, while foxes and swine trampled, and children howled.\nWas my literary fate doomed by the nine-seven cycle? Or was my destiny afflicted by the Yang-nine calamity?\nI lamented that my brush could not quell chaos, so I sold my fields like the Fu father and son, divining fortunes.\n\nReturning from Baixia, my livelihood was meager—ink smeared on broken inkstones, brooms swept in disarray.\nMy purse was empty, my clothes in tatters, with nothing to mend them but to beg my wife.\nShe said, ‘Long parted, my hairpins and earrings are gone—borrowing from old neighbors yields nothing.’\nMy aged mother, young children—each day I shamefully bought shrimp and lotus roots.\nI longed for whole cloth to warm my mother, but where could I find Wu cotton to thicken your winter clothes?\nHearing this, my face burned with shame; tears welled as I left, my heart rent in two.\nMy sickly frame had no servant to attend me—medicine and meals relied on friends and kin.\nYet I rejoiced that my strength still endured, my temples clouded with age but my will unbroken.\nIn old age, I was summoned by distant lords, white jade and dark gifts from forests and marshes.\nEager to test my schemes, I did not refuse; in scholar’s robes, I bowed and sat in long discourse.\nBefore the green-locked gates, the noon drips echoed; through purple-curtained windows, spring incense wafted.\nAt times, jade tablets bore phoenix scripts; again, silver stationery was etched with tadpole seals.\nIn times of peace, I did not march to Jade Pass—my hands held jade slips and golden brushes.\nMy life’s course was predestined, not forced; my Eastern Well’s literature would surely endure.”\n\nI cast all gains and losses to forgotten words, singing boldly, drunk on a single cup of wine.\n\nWhen the song ended, she stepped forward and bowed, saying: “You and I share a predestined bond—you cannot refuse, nor I depart. I wish to transform into a single wisp of pure wind, enter the body of the Chen family’s son, and serve you with broom and dustpan for life. What say you to this?”\n\nI replied: “Your discourse is profound, your songs and verses exquisite. Yet what you propose now—is it not fantastical and beyond reason?”\n\nShe answered: “Of old, the mother of Fu Jian conceived by the essence of the sun’s lodging, bearing six sons from her split flank. I, with the purity of an untouched maiden, enter the body of another—merely to enhance her beauty, sharpen her wit, and double her years. Why find this strange?”\n\nSuddenly, a pure wind arose on all sides, and she vanished without a trace.\n\nAt dawn, my mother-in-law sent word that her daughter had fallen gravely ill, and in alarm, summoned me for a final farewell. I went to see her and found that in sickness, her features, bearing, and speech were no different from the immortal maiden I had met the night before. My heart harbored doubt, yet I offered comfort and returned, saying all would be well.\n\nA month later, her illness abated. On the fifth day of the first winter month that year, the magistrate arranged our betrothal. The esteemed Prefect Zhang of Jinjiang and my teacher, Master Yin of Hushan in Anfu, learned of the matter and bestowed upon us music, embroidered canopies, a grand procession, and lavish gifts. Following the ancient rite of presenting the wild goose, they personally came to escort the bride home.\n\nAfter our union, her virtue, conduct, and literary arts advanced without cease—all through the aid of the Chen family’s daughter. Her name was Qianjin, styled Xinmei, and she was also called the Fairy of the Nuptial Chamber.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "会仙女志　　　　（明）郦琥着 ○序 玄阳仙史，少闻会仙女事，乃笑曰：“此无稽之谈也。 ” 辄置而不问。 及见稗官小说多载焉，又叹曰：“此以讹传讹。 尽信书，不如天书也。 ”辄掩而不阅。 至嘉靖辛卯，予年弱冠，独处玄阳洞天，忽遇仙女，其事甚奇，始信昔之闻见者，非幻诞也。 遂纪《天问》二十四首、《仙女赋》、《仙史歌》各一首，总名之曰《会仙女志》云。 嘉靖壬子三月五日，会稽玄阳仙史郦琥题。 ◎问日月交蚀 玄阳仙史年甫弱冠，读《易》于玄阳洞天。 幽远深邃，超脱俗缘，敛神抱一，精思钩玄。 嘉靖辛卯□，天光如洗，月色穿帘，异香满室，紫气腾烟。 启户而视，有女郎年可十六七，肤体柔脂，髻垂鬓玄，器度雅饬，举止端严，缟衣素裳，缓步周旋，行将渐近，掩户凝神静坐。 顷刻门叩有声，仙史曰：“子为谁仙？ ”女曰：“予处子也。 ”曰：“子其处子而淫奔者邪？ 抑魑魅而为鬼物也耶？ ”曰：“予乃天府英灵，会自蓬瀛，与子夙缘，愿执栉巾。 ”曰：“士之耽兮，犹可说也。 女之耽兮，不可说也。 子先于吾，必见放于尼父。 暮夜淫奔，终见贱于国人。 予聘陈氏子而未娶，是亦处子也。 以处子而纳淫奔，国人将以贱子者贱我矣。 子速返驾，毋贻贰羞。 ”曰：“轻浮年少，违弃纲常，穿花弄柳，窃玉偷香，挑楼窥觑，钻穴逾墙。 子见予之色而勿慕，知子非凡近而可与言者也。 予将与子谈子午之窟，泄天地之秘，阐阴阳之精，子毋疑予为淫奔鬼物也。 愿子学展禽而见纳，毋学鲁男子而拒深。 ”曰：“子能谈玄论，泄玄秘，此予之所乐闻也，恐吾子之未能。 ”曰：“请子姑试之可乎？ ”予乃秉烛启钥，请就外馆，东西列坐，啜茗细论。 叩其所蕴，义理精明，意其非尘寰中物也，乃敛容启手曰：“子称天府英灵，会自蓬瀛，意者其仙女耶？ ”曰：“然。 ”曰：“子诚仙女矣，仙女果何所自乎？ ”曰：“天体轻清，不灭不生。 星宿精英，有浊有清。 浊殒为石，清殒钟灵。 故钟于禽兽，为凤为麟。 钟于草木，为芝为椿。 钟于母孕，产育贤圣。 为睿智，为聪明，在地为人，在天为星，说乘箕尾，班班可征，吾生有自，微子孰论？ ”曰：“星化为人，自古及今，不知其几，愿悉数焉。 ”曰：“仙女下谪，混凡蒙尘，纪载书中，预识吾心。 角姬织女，孝配董永。 少室仙妹，求配封生。 江妃逢郑，解佩江滨。 蓝桥裴子，道遇玄英。 推余类见，莫能悉陈。 ”",
      "translated_text": "**Preface to *Records of Meeting a Celestial Maiden***\n*(By Li Hu of the Ming Dynasty)*\n\nThe Immortal Historian of Xuan Yang once heard tales of the Celestial Maiden in his youth and scoffed, \"These are baseless fabrications.\" He set them aside without inquiry. Later, encountering such accounts in miscellaneous unofficial histories and novels, he sighed, \"These are distortions piled upon distortions. To believe all one reads is worse than having no books at all.\" He shut them away, unread. Yet in the *xin-mao* year of the Jiajing era (1531), when he was but twenty and dwelling alone in the Grotto-Heaven of Xuan Yang, he suddenly met a Celestial Maiden—an encounter most extraordinary. Only then did he believe that what he had heard and seen before was no mere illusion. Thus, he composed twenty-four *Heavenly Questions*, one *Rhapsody on the Celestial Maiden*, and one *Song of the Immortal Historian*, collectively titled *Records of Meeting a Celestial Maiden*. Inscribed on the fifth day of the third month in the *ren-zi* year of Jiajing (1552) by Li Hu, the Immortal Historian of Xuan Yang of Kuaiji.\n\n---\n\n**On the Eclipses of the Sun and Moon**\n\nIn the *xin-mao* year of Jiajing, the Immortal Historian of Xuan Yang, barely twenty, was studying the *Book of Changes* in the secluded depths of the Grotto-Heaven of Xuan Yang. Far removed from worldly ties, he gathered his spirit, embraced the One, and delved into profound contemplation. One night, the sky was crystalline, moonlight streamed through the curtains, an uncommon fragrance filled the chamber, and purple qi billowed like mist. Opening the door to look, he saw a maiden of sixteen or seventeen, her skin soft as cream, her raven tresses cascading, her bearing refined and dignified. Clad in white robes, she moved with unhurried grace, drawing nearer. He quickly shut the door and sat in silent meditation.\n\nMoments later, a knock sounded. The Immortal Historian asked, \"What immortal are you?\"\nThe maiden replied, \"I am a maiden.\"\nHe said, \"Are you a maiden who has eloped in lust, or a demon or ghost in disguise?\"\nShe answered, \"I am a spirit of the Celestial Palace, come from Penglai and Yingzhou. I share a predestined bond with you and wish to serve as your attendant.\"\nHe said, \"A man’s infatuation may yet be excused, but a woman’s infatuation cannot. Had you come before me, you would have been rebuked by Confucius. To elope under cover of night is to be scorned by all. I am betrothed to a daughter of the Chen family but have not yet wed—thus, I too am a maiden. To accept an eloping maiden would bring disgrace upon me in the eyes of the world. Return at once, lest you bring me shame.\"\nShe replied, \"Light-minded youths abandon propriety, flitting among flowers and willows, stealing jade and fragrance, peering through boudoirs, burrowing through walls. Yet you see my beauty and feel no desire—this proves you are no ordinary man. I shall speak with you of the mysteries of the *zi-wu* cavern, reveal the secrets of Heaven and Earth, and expound the essence of yin and yang. Do not mistake me for an eloping ghost or demon. I hope you will receive me as Zhan Qin did, not reject me as the man of Lu did.\"\nHe said, \"If you can discourse on the profound and reveal its secrets, this is what I delight to hear. But I fear you may not be capable.\"\nShe said, \"Will you not at least put me to the test?\"\nThus, he lit a candle, unbolted the door, and invited her to the outer chamber. They sat facing one another, sipping tea as she expounded. Her reasoning was lucid, her principles incisive—surely she was no denizen of the mortal realm. Composing himself, he asked, \"You claim to be a spirit of the Celestial Palace, come from Penglai and Yingzhou—are you then a Celestial Maiden?\"\nShe said, \"Indeed.\"\nHe asked, \"If you are truly a Celestial Maiden, from whence do such beings arise?\"\nShe replied, \"The body of Heaven is light and pure, neither perishing nor arising. The essences of the stars and constellations may be turbid or clear. The turbid fall as stones, while the clear condense into spirits. Thus, they may alight upon birds and beasts, becoming phoenixes or qilin; upon grasses and trees, becoming lingzhi or chun; or upon a mother’s womb, giving birth to sages and worthies. They become wisdom and intelligence; on earth, they are humans, in Heaven, stars. The *Book of Documents* records their riding the *Ji* and *Wei* constellations—this is plainly evident. My origins are thus; who but you could fathom them?\"\nHe asked, \"Since ancient times, how many stars have transformed into humans?\"\nShe said, \"Celestial Maidens sent down to the mortal realm, veiled in dust, are recorded in books—those who foreknew my heart. The Weaving Maiden of the Horn constellation wed Dong Yong in filial devotion. The Immortal Sisters of Shaoshi sought a match with Feng Sheng. The Jiang Fei met Zheng on the riverbank and bestowed her girdle-pendant. At Blue Bridge, Pei met the immortal Xuan Ying. The examples are too many to recount in full.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 968,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.843329906463623,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "曰：“董遇仙姬，织以济贫。 予亦贫士，子能织乎？ ”曰：“阴阳契合，类聚群分。 角姬织女，量配董农。 予谙文义，知子文雄。 因才求配，终身愿从。 道克为富，利莫尔营。 织以助子，匪予所闻。 ”曰：“子谪仙灵异，天载必明。 予以天问，子盍为我对焉？ ”曰：“诺”。 于是起而问之。 问曰：“三才之道，天地与人。 何五行构精，男女始成？ ” 曰：“太初无始，溟滓鸿蒙。 混沌不凿，两仪未分。 变易而有，太极虚中。 天开子位，地辟丑宫。 人生寅候，三才统同。 五行显布，万物公宏，周朱图旨，子莫信从。 ”",
      "translated_text": "She said, \"Dong Yong met the Celestial Maiden, who wove to aid his poverty. I, too, am a poor scholar—can you weave?\"\n\nShe replied, \"Yin and yang unite in harmony; like gathers with like, kind with kind. The Weaving Maiden of the Horn constellation was matched with Dong, a farmer. I am versed in letters and know you as a master of literature. Seeking a match by talent, I wish to follow you for life. The Dao, when mastered, brings wealth—no profit compares to its cultivation. Weaving to aid you is not what I have heard of.\"\n\nHe said, \"You are a banished immortal of wondrous power; Heaven’s records must be clear. I pose a question of Heaven—will you answer for me?\"\n\nShe said, \"Very well.\"\n\nThereupon, he rose and asked:\n\nHe asked, \"The Way of the Three Powers encompasses Heaven, Earth, and Humankind. How do the Five Phases conjoin essence to form male and female?\"\n\nShe said, \"In the Great Beginning, there was no origin—only primordial chaos, vast and indistinct. Uncarved and undivided, the Two Modes had not yet separated. Through transformation, the Supreme Polarity emerged from emptiness. Heaven opened at the *zi* position, Earth split at the *chou* palace. Humankind arose in the *yin* hour—thus the Three Powers were united as one. The Five Phases manifested in full, and the myriad things flourished in shared abundance. The diagrams of Zhou and Zhu’s teachings—why do you not believe and follow them?\"",
      "overlap_context": " ancient times, how many stars have transformed into humans?\"\nShe said, \"Celestial Maidens sent down to the mortal realm, veiled in dust, are recorded in books—those who foreknew my heart. The Weaving Maiden of the Horn constellation wed Dong Yong in filial devotion. The Immortal Sisters of Shaoshi sought a match with Feng Sheng. The Jiang Fei met Zheng on the riverbank and bestowed her girdle-pendant. At Blue Bridge, Pei met the immortal Xuan Ying. The examples are too many to recount in full.\"",
      "start_char": 968,
      "end_char": 1208,
      "start_sentence": 53,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.038939714431763,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "问曰：“天地相去，几千万里？ 东西何缺？ 数何可纪？ ” 曰：“天之高也，不可阶升，去地之远，孰陟而明？ 测晷度景，渺茫杳冥，二亿余万，莫得其真。 四维步数，子莫信深。 ” 问曰：“天为卯白，地为卯黄。 天何也外？ 地何中藏？ ” 曰：“天开地辟，黄白初分。 肇判太始，卯喻乃明。 天清上盖，地浊下承。 天包乎地，天反下凝。 天疑地下，愈浊匪清。 盖天至论，考核宜精。 ” 问曰：“天体上盖，覆物轻清。 一气贯彻，西北何倾？ ” 曰：“一气上浮，磅礴浑论。 天道左旋，倏忽变更。 东西南北，旧位难仍。 翘首仰视，尽属青晴，何西何北，孰亏孰盈，谁能到景，西北见倾。 人言弗信，子惟信心。 ”女仙会志4问曰：“天体浑论，疑无罅漏。 炼石补天，敢以玄叩。 ”",
      "translated_text": "He asked, \"How many thousands of myriad *li* separate Heaven and Earth? Where do East and West fall short? How can their measures be recorded?\"\n\nShe said, \"Heaven’s height cannot be scaled by steps; its distance from Earth—who could ascend to clarify it? Measuring shadows and gauging light, all is vast and obscure. Though reckoned at over two hundred million, none grasp its truth. The reckoning of the four directions—do not place undue faith in such depths.\"\n\nHe asked, \"Heaven is the white of *mao*; Earth is the yellow of *mao*. Why does Heaven envelop the outer, while Earth conceals the inner?\"\n\nShe said, \"When Heaven opened and Earth split, yellow and white first divided. At the inception of the Great Beginning, the metaphor of *mao* became clear. Heaven, pure, forms the upper canopy; Earth, turbid, bears the lower. Heaven enfolds Earth, yet Heaven congeals below in reverse. If Heaven seems beneath Earth, its turbidity only deepens. The *Gaitian* theory is most profound—its scrutiny must be precise.\"\n\nHe asked, \"Heaven’s body is an upper canopy, light and pure, covering all things. A single *qi* pervades it—why then does the Northwest tilt?\"\n\nShe said, \"A single *qi* ascends, vast and undifferentiated. The Dao of Heaven revolves leftward, swiftly shifting and changing. East, West, South, and North—no former position remains. Gazing upward, all appears azure and boundless. What is West or North? What wanes or waxes? Who can reach its realm to witness the Northwest’s tilt? Human words are untrustworthy—only your own heart can believe.\"\n\nHe asked, \"Heaven’s body is undifferentiated—how could it have fissures or leaks? Daring to inquire of the divine: could one refine stone to mend Heaven?\"",
      "overlap_context": "o origin—only primordial chaos, vast and indistinct. Uncarved and undivided, the Two Modes had not yet separated. Through transformation, the Supreme Polarity emerged from emptiness. Heaven opened at the *zi* position, Earth split at the *chou* palace. Humankind arose in the *yin* hour—thus the Three Powers were united as one. The Five Phases manifested in full, and the myriad things flourished in shared abundance. The diagrams of Zhou and Zhu’s teachings—why do you not believe and follow them?\"",
      "start_char": 1208,
      "end_char": 1529,
      "start_sentence": 75,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.798853635787964,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "曰：“轻清上浮，一气浑融。 原无罅漏，何俟补工？ 上有隙补，无阶可通。 天位未定，溟滓鸿蒙。 女娲炼石，五色始分。 东木青补，南火色红。 北水补黑，黄色补中。 金补白色，五方不同。 补明天道，大哉帝功。 ” 问曰：“天体上盖，地体下凝。 日月何依，旋转周行？ ” 曰：“维日与月，阴阳之精。 一气旋转，画夜无停。 譬之血气，循环一身。 空虚无倚，上下运行。 岂必依附，强天下凝。 ” 问曰：“莫大日月，悬象着明。 月光何德，死而复生？ ” 曰：“维月之魄，假日之光。 着明于上，人自下观。 譬之银丸，各见一方。 凌空倒景，察见毫芒。 阴精皎洁，弦朔无伤。 知子博览，沈言是藏。 ” 问曰：“日维阳精。",
      "translated_text": "She said, \"Light and pure, it ascends—one *qi* perfectly fused. Originally without fissure or leak, why await mending labor? Above, though gaps may be mended, no ladder reaches them. Heaven’s position remains unsettled, primordial chaos still swirling. Nüwa refined stone, and the five colors first divided: the East’s Wood mended with blue, the South’s Fire with red, the North’s Water with black, the Center with yellow, and Metal with white—each of the five directions distinct. Thus was the Dao of Heaven mended, a work of imperial majesty.\"\n\nHe asked, \"Heaven’s body is an upper canopy, Earth’s body congeals below. What do the sun and moon rely upon as they revolve and circle endlessly?\"\n\nShe said, \"The sun and moon are the essence of yin and yang. A single *qi* revolves, day and night unceasing. Compare them to the blood and *qi* circulating through the body. Empty and unsupported, they move above and below—must they cling to some solidity, forcing Heaven and Earth to congeal?\"\n\nHe asked, \"Nothing is greater than the sun and moon, celestial images radiating light. What virtue does the moon possess that it dies and revives?\"\n\nShe said, \"The moon’s essence borrows the sun’s light. Radiant above, it is seen from below. Like a silver sphere, each beholds but one side. Hanging in the void, its inverted reflection reveals even the finest detail. The yin essence gleams pure, waxing and waning without harm. Knowing your wide learning, I conceal nothing in my words.\"\n\nHe asked, \"The sun is the essence of yang...\"",
      "overlap_context": "iated. The Dao of Heaven revolves leftward, swiftly shifting and changing. East, West, South, and North—no former position remains. Gazing upward, all appears azure and boundless. What is West or North? What wanes or waxes? Who can reach its realm to witness the Northwest’s tilt? Human words are untrustworthy—only your own heart can believe.\"\n\nHe asked, \"Heaven’s body is undifferentiated—how could it have fissures or leaks? Daring to inquire of the divine: could one refine stone to mend Heaven?\"",
      "start_char": 1529,
      "end_char": 1826,
      "start_sentence": 105,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.751435279846191,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "乌何三足？ 月死复育，兔何在腹？ ” 曰：“人生百岁，能复几时。 光阴迅速，兔走鸟飞。 附会剿说，兔捣鸟栖。 四足属偶，三足属奇。 月非三窟，顾兔何居。 ” 问曰：“羿妻娥，亦与人同。 窃何灵药，能奔月宫？ ” 曰：“月秉阴精，□娥阴灵。 悬象无人，寓言斯名。 窃何灵药，羿妻能奔。 霜娥何怨，独宿何嗔。 商隐鄙俚，愿子勿听。 ” 问曰：“月中丹桂，灵根何裁？ 灵隐结子，佳种何来？ ” 曰：“秋桂吐色，文战奋扬。 雄才高捷，桂花高攀。 如登天府，峻极维艰。 蟾宫丹桂，拟之名彰。 灵隐附会，桂子芬芳。 栽种结实，其味辛香。 徐子至论，已破荒唐。 ”",
      "translated_text": "\"Why does the crow have three legs? The moon dies and revives—why is the hare said to dwell within its belly?\"\n\nShe replied, \"A human life spans a hundred years—how much time truly remains? Light and shadow flee swiftly, like the hare’s dash or the bird’s flight. These are forced interpretations, mere borrowed tales: the hare pounds, the crow perches. Four legs belong to the even, three to the odd. The moon has no triple burrow—where then should the hare reside?\"\n\nHe asked, \"Yi’s wife, Chang’e, was no different from other mortals. What divine elixir did she steal to flee to the lunar palace?\"\n\nShe said, \"The moon embodies yin essence, while Chang’e possessed yin numen. A celestial image devoid of human presence—such names are but allegory. What divine elixir did she steal? Yi’s wife could ascend. Why resent the frost’s chill? Why begrudge solitary lodging? Such vulgar verses as Shangyin’s—best not to heed them.\"\n\nHe asked, \"The cinnamon tree within the moon—what divine root sustains it? The sacred grove bears fruit—from whence came such fine seed?\"\n\nShe replied, \"Autumn’s cassia unfurls its hues, its literary battles fierce and flourishing. Towering talent soars high, the cassia’s blossoms scaling lofty heights. Like ascending to the celestial court, the ascent is steep and arduous. The toad palace’s cinnamon—its fame is thus renowned. Lingyin’s associations are mere fable, though its cassia seeds exude fragrance. Planted and bearing fruit, their taste is pungent and sweet. Master Xu’s discourse has long dispelled such absurdities.\"",
      "overlap_context": "the sun and moon, celestial images radiating light. What virtue does the moon possess that it dies and revives?\"\n\nShe said, \"The moon’s essence borrows the sun’s light. Radiant above, it is seen from below. Like a silver sphere, each beholds but one side. Hanging in the void, its inverted reflection reveals even the finest detail. The yin essence gleams pure, waxing and waning without harm. Knowing your wide learning, I conceal nothing in my words.\"\n\nHe asked, \"The sun is the essence of yang...\"",
      "start_char": 1826,
      "end_char": 2095,
      "start_sentence": 135,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.1682448387146,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "问曰：“月中黑白，交映参差。 山河之影，何破群疑？ ” 曰：“日月之象，精蕴白黑。 黑白着明，鉴貌辨色。 目鲜黑瞳，易称多白。 多白之睛，耗眩昏塞。 即目观象，至理斯识。 山河之影，未受成式。 假生鄙妄，胡破群惑？ ” 问曰：“日月交蚀，时或晦明。 春秋不载，子盍悉陈？ ” 曰：“天有九道，黄道居中。 日月同度，参差会逢。 参差月晦，会逢日蒙。 日居月上，月蔽日魄。 月越常度，日晦月宫。 随其所犯，浅深不同。 当蚀不蚀，历算未工。 ” 问曰：“帝尧元祀，日何十出？ 羿何能射，独存其一？ ” 曰：“帝尧盛世，载纪不虚。",
      "translated_text": "He asked, \"The moon’s black and white hues intermingle in uneven measure. How do the shadows of mountains and rivers dispel all doubts?\"\n\nShe replied, \"The sun and moon bear the essence of brightness and darkness. Black and white manifest in clarity, reflecting forms and discerning colors. The eye’s pupil is dark, yet the *Yijing* speaks of ‘abundant white.’ Eyes with too much white suffer from dissipation, dizziness, and obstruction. By observing these very eyes, the supreme principle is known. The shadows of mountains and rivers follow no fixed pattern. How could such vulgar delusions shatter widespread confusion?\"\n\nHe asked, \"When the sun and moon eclipse, their brightness wanes and waxes. The *Spring and Autumn Annals* records none of this—why do you not explain it fully?\"\n\nShe replied, \"Heaven has nine paths, with the Yellow Path at their center. Sun and moon share the same degree, yet their alignments differ when they meet. When their paths diverge, the moon darkens; when they converge, the sun is veiled. The sun stands above the moon, but the moon obscures the sun’s radiance. When the moon strays from its usual course, the sun darkens within the lunar palace. The depth of the eclipse varies with the degree of transgression. When an eclipse is predicted but does not occur, the calendar’s calculations are flawed.\"\n\nHe asked, \"In Emperor Yao’s first year, why did ten suns appear? How could Yi shoot them down, leaving only one?\"\n\nShe replied, \"Emperor Yao’s flourishing age—its records are no falsehood.\"",
      "overlap_context": "seed?\"\n\nShe replied, \"Autumn’s cassia unfurls its hues, its literary battles fierce and flourishing. Towering talent soars high, the cassia’s blossoms scaling lofty heights. Like ascending to the celestial court, the ascent is steep and arduous. The toad palace’s cinnamon—its fame is thus renowned. Lingyin’s associations are mere fable, though its cassia seeds exude fragrance. Planted and bearing fruit, their taste is pungent and sweet. Master Xu’s discourse has long dispelled such absurdities.\"",
      "start_char": 2095,
      "end_char": 2353,
      "start_sentence": 164,
      "end_sentence": 189,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.526508331298828,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "子挚乱政，灾异虐余。 日光磨荡，酷烈莫支。 眩如十日，稼杀无遗。 命羿救获，射日躯驰。 如杨剑止，如鲁戈挥。 淮南缪妄，以启群疑。 ” 问曰：“丽空列星，广博无垠。 五方殊位，何象何名？ ” 曰：“万象之精，上为列星。 元气之英，无象无名。 歌称重耀，传闻夜明。 何斗何箕？ 何虚何参？ 观象玩占，强名其名。 东匪长庚，西匪启明。 五方殊位，随人所称。 ” 问曰：“北斗七星，一行七豕。 管辂白衣，言何所指？ ” 曰：“太公钩璜，以神水德。 汉高斩蛇，托言帝泣。 北斗何神，松下铺食。 废园一瓮，杖奴胡得？ 二子设言，欲神其术。 岂王姥之辜，七日当赦。 赵颜之寿，哭而可益。 ”",
      "translated_text": "When Zi Zhi threw governance into chaos, calamities and portents assailed the land. The sun’s light churned and raged, its ferocity unbearable. Blinding as ten suns, it scorched the crops to nothing. The mandate fell to Yi to rescue the harvest—he shot the suns, their bodies tumbling down. Like a sword halted mid-swing, like the Lu halberd brandished, his arrows flew. The *Huainanzi*’s wild fabrications only sowed doubt.\n\nHe asked, “The stars arrayed across the vast heavens—boundless and measureless—occupy distinct positions in the five directions. What forms do they take, and what names do they bear?”\n\nShe replied, “The essence of the ten thousand images ascends to become the arrayed stars. The flower of primal *qi* has no form, no name. Songs praise their layered brilliance; tales speak of their nocturnal glow. What is the Dipper? What is the Winnowing Basket? What is Emptiness? What is the Three Stars? Gazing at the images and toying with divination, men forcibly assign them names. The eastern star is not truly the Long-Lost Star, nor is the western one truly the Dawn Star. The five directions hold distinct positions, but their names depend on what people call them.”\n\nHe asked, “The Northern Dipper’s seven stars—one line likens them to seven swine. Guan Lu, though clad in commoner’s robes, spoke of them—what did he mean?”\n\nShe replied, “Jiang Taigong’s hooked jade and divine water drew upon the power of water’s virtue. Emperor Gao of Han slew the serpent, claiming it wept on behalf of the gods. What deity dwells in the Northern Dipper? Merely a meal laid beneath the pines—a discarded jar in an abandoned garden, a staff-bearing servant—what could he possibly obtain? These two men fabricated their words, seeking to lend their arts an air of mystery. How could the guilt of Wang’s old mother be absolved in seven days? How could Zhao Yan’s lifespan be extended by weeping?”",
      "overlap_context": "sun stands above the moon, but the moon obscures the sun’s radiance. When the moon strays from its usual course, the sun darkens within the lunar palace. The depth of the eclipse varies with the degree of transgression. When an eclipse is predicted but does not occur, the calendar’s calculations are flawed.\"\n\nHe asked, \"In Emperor Yao’s first year, why did ten suns appear? How could Yi shoot them down, leaving only one?\"\n\nShe replied, \"Emperor Yao’s flourishing age—its records are no falsehood.\"",
      "start_char": 2353,
      "end_char": 2631,
      "start_sentence": 190,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.49882984161377,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "问曰：“织女牵牛，天载二星。 时逢七夕，相会何情？ ” 曰：“纪星之状，维《诗》可详。 大东箕斗，南北绕环。 维箕生簸，维斗生浆。 然且不可，况贺河梁。 梭子尼头，二星名彰。 所织何锦，所耘何疆？ 男女通好，言尤妄诞。 ” 问曰：“张骞乘槎，何以升天？ 织女机石，何以相传？ ” 曰：“张骞汉臣，出使西域。 乘槎天游，好事浪述。 天无仙女，何机何织？ 杼柚其空，有何机石？ 卖卜君平，岂能独识？ 张骞本传，并不载入。 《华志》、《博物》，奇事莫及。 幻妄不经，子勿沉溺。 ”",
      "translated_text": "He asked, “The Weaving Maid and the Herdboy—two stars borne in the heavens. When the seventh night arrives, what feeling attends their meeting?”\n\nShe replied, “The forms of the constellations are recorded in detail in the *Songs*. In *Greater East*, the Winnowing Basket and the Dipper coil north and south. The Basket gives rise to winnowing, the Dipper to brewing. Yet even these cannot be trusted—how much less the celebration of the Milky Way’s bridge? The shuttle and the heddle, those two stars’ names are clear. What brocade do they weave? What fields do they till? That man and woman should share affection—such words are even more absurd.”\n\nHe asked, “Zhang Qian rode a raft—how did he ascend to heaven? The Weaving Maid’s loom stone—why is it passed down?”\n\nShe replied, “Zhang Qian was a Han minister, sent as an envoy to the Western Regions. His raft-borne journey through the heavens was a frivolous tale spun by those fond of marvels. The sky holds no immortal maidens—what loom? What weaving? The shuttle and batten are empty—what loom stone could there be? Even the diviner Junping—could he alone recognize it? Zhang Qian’s official biography makes no mention of it. The *Huazhi* and *Bowu* record no such wonders. Such delusions defy reason—do not sink into them.”",
      "overlap_context": "ter drew upon the power of water’s virtue. Emperor Gao of Han slew the serpent, claiming it wept on behalf of the gods. What deity dwells in the Northern Dipper? Merely a meal laid beneath the pines—a discarded jar in an abandoned garden, a staff-bearing servant—what could he possibly obtain? These two men fabricated their words, seeking to lend their arts an air of mystery. How could the guilt of Wang’s old mother be absolved in seven days? How could Zhao Yan’s lifespan be extended by weeping?”",
      "start_char": 2631,
      "end_char": 2862,
      "start_sentence": 220,
      "end_sentence": 242,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.23712706565857,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "问曰：“雷从何起？ 雷有何神？ 何以激杀？ 何以司刑？ ” 曰：“雷在地中，万物未生。 阴阳相搏，冲击而成。 譬之火炮，其理甚明。 火击于内，爆之为声。 火光闪烁，目眩生神。 物遇戕损，天匪有心。 鼓动万物，权岂司刑？ ” 问曰：“雷火焚炽，斧屑遗弃。 何所措设？ 何所秉制？ ” 曰：“雷电猛炽，击触势烈。 如滚器投井，反成坚冰。 雷非地鼓，宁语斧屑。 天声雄迅，神化相夹。 腾灼鸣空，近沉浊。 遂成渣滓，屑形不灭。 如龙升驰，雪块遗结。 其名令滞，反观斧屑。 ” 问曰：“莫灵于龙，何以施雨？ 附气转化，何能吸水？ ” 曰：“阴阳和畅，云气熏蒸。 霖雨下降，龙以从云。 江海龙窟，天无龙精。 神龙变化，在天飞腾。 云腾致雨，雨非龙成。 ” 问曰：“山川兴云，气结而成。 于龙何究，于雨何生？ ” 曰：“山以藏气，川以积气。 天地启辟，一气为主。 非特山川，为云为雨。 有川有水，水者雨母。 龙之俯化仰伸，降而为雨，子还母也。 气积以舒，有山有云，云者雨翼，龙之俯郁仰蒸，遍而为雨，夫应妇也。 气藏以舒，山本上升，升者为云，云从气上。 龙之势引，川本下降，降者为水，水从气下。 龙之势沸，是故上下不阻于间体，两仪遂至于渥化。 ” 问曰：“冬雪六出，五出阳春。",
      "translated_text": "He asked, “From where does thunder arise? What spirit does thunder possess? Why does it strike to kill? Why is it said to administer punishment?”\n\nShe replied, “Thunder lies within the earth before the myriad things are born. Yin and yang clash, colliding to form it. It is like a fire-cannon—its principle is quite clear. Fire strikes within, exploding into sound. Firelight flashes and flickers, dazzling the eyes to conjure spirits. When things are damaged, Heaven has no intent. It stirs the myriad things—how could its power administer punishment?”\n\nHe asked, “When thunder’s fire burns fiercely, axe-chips are left behind. Where are they placed? By what are they governed?”\n\nShe replied, “Thunder and lightning blaze fiercely, their striking force violent. It is like a boiling vessel cast into a well—what was hot turns to solid ice. Thunder is not the earth’s drum—how could one speak of axe-chips? Heaven’s voice is mighty and swift, interwoven with divine transformation. It soars and crackles through the sky, yet near the turbid earth, it sinks and congeals. Thus it becomes dregs, its chip-form indestructible. Like a dragon soaring upward, snow clumps are left behind. Its name lingers stubbornly—hence the backward glance at axe-chips.”\n\nHe asked, “Nothing is more numinous than the dragon—why does it bring rain? Attached to qi and transforming, how can it draw water?”\n\nShe replied, “When yin and yang harmonize and flow, cloud-qi steams and rises. Torrential rains descend, and the dragon follows the clouds. The dragon’s lair lies in rivers and seas—Heaven holds no dragon essence. The divine dragon transforms and soars through the sky. Clouds rise to bring rain—rain is not the dragon’s creation.”\n\nHe asked, “Mountains and rivers give rise to clouds, their qi congealing to form them. What does this reveal about the dragon? How does it produce rain?”\n\nShe replied, “Mountains store qi; rivers accumulate qi. When Heaven and Earth first opened, a single qi presided. Not only mountains and rivers—all clouds and rain arise from it. Rivers hold water, and water is the mother of rain. The dragon’s downward transformation and upward extension—descending to become rain—is the child returning to its mother. Qi accumulates and expands; where there are mountains, there are clouds. Clouds are the wings of rain. The dragon’s downward depression and upward steaming—spreading to become rain—is the husband answering his wife. Qi is stored and expands: mountains naturally rise, and what rises becomes clouds, for clouds follow ascending qi. The dragon’s power draws them forth. Rivers naturally descend, and what descends becomes water, for water follows descending qi. The dragon’s power seethes within. Thus, above and below are not obstructed by intermediate forms, and the Two Modes achieve profound transformation.”\n\nHe asked, “Winter snow falls in six-pointed flakes, while spring snow falls in five—”",
      "overlap_context": "“Zhang Qian was a Han minister, sent as an envoy to the Western Regions. His raft-borne journey through the heavens was a frivolous tale spun by those fond of marvels. The sky holds no immortal maidens—what loom? What weaving? The shuttle and batten are empty—what loom stone could there be? Even the diviner Junping—could he alone recognize it? Zhang Qian’s official biography makes no mention of it. The *Huazhi* and *Bowu* record no such wonders. Such delusions defy reason—do not sink into them.”",
      "start_char": 2862,
      "end_char": 3382,
      "start_sentence": 243,
      "end_sentence": 291,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.888055562973022,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "天产花树，燕女何凭？ ” 曰：“雨雪霏霏，冬寒冱凝。 隆冬阴盛，六出乃成。 逢春五出，阳气渐生。 阴阳推迁，六五变更。 燕华君论，援天自神。 诡女仙谪，赝而匪真。 ” 问曰：“九道何列，九天何名，十端何纪，八柱何承？ ” 曰：“天无九道，交错杂陈。 定为五色，强名其名。 九天八柱，意义相因。 王逸谬注，八山何承？ 十端舛错，穿凿五行。 《繁露》繁冗，支离不经。 ” 问曰：“曾据虞帝之玉，献致西王。 周穆之八骏，驰觞会母。 黄帝之鼎湖，羽化群工。 灵王之飞辇，云歌妙宛。 汉武之玉函银桥，曲写霓裳。 淮南之八童九老，云犬霄鸡。 是何怪也，怪果仙乎，仙果帝王乎？ ”曰：“大旨抱郁，龙云赴会。 茅食九　亥，经修累叶。 体齐红云，玉案业引。 玄天洞枢，乐彻天钧。 味品凤脂，作威洪范，专命乾纲。 故祖龙鞭石，见海鬼之相投。 而武王欲春，致火速以报应。 幻化相齐，天权莫测。 ”",
      "translated_text": "“Heaven produces flowering trees—by what means does the Swallow Maiden appear?”\n\nHe replied, “When rain and snow fall thickly, winter’s cold congeals and freezes. In the depths of winter, yin flourishes, and six-pointed flakes form. When spring arrives, five-pointed flakes appear as yang qi gradually arises. Yin and yang shift and transform, altering the six and five. The *Yan Hua Jun Lun* invokes heaven to assert its divinity, but the ‘Swallow Maiden’ is a banished immortal, counterfeit and not true.”\n\nHe asked, “What are the Nine Paths arrayed? What are the names of the Nine Heavens? What governs the Ten Beginnings? What do the Eight Pillars support?”\n\nHe replied, “The heavens have no Nine Paths—only intersecting and jumbled alignments. They are fixed as the Five Colors, and their names are forcibly assigned. The Nine Heavens and Eight Pillars share a common meaning. Wang Yi’s erroneous annotations—what do the Eight Mountains support? The Ten Beginnings are contradictory, arbitrarily linked to the Five Phases. The *Fan Lu* is verbose and incoherent, fragmented and unorthodox.”\n\nHe asked, “Shun’s jade was once presented to the Queen Mother of the West. The Eight Steeds of King Mu of Zhou raced to the feast with his mother. The tripods of the Yellow Emperor at Mount Dinghu transformed his artisans. King Ling’s flying chariot soared as clouds and songs filled Miao Terrace. Emperor Wu of Han’s jade casket and silver bridge traced the arc of *Nishang*. The Eight Lads and Nine Elders of Huainan, the cloud-hounds and celestial roosters—what are these wonders? Are they truly immortals, or are immortals truly emperors and kings?”\n\nHe replied, “The great principle embraces pent-up longing as dragons and clouds gather in assembly. Feasting on nine *hai* of artemisia, cultivating the scriptures through generations—bodies aligned with crimson clouds, jade tablets extending their legacy. The Mysterious Heaven’s pivot turns, music resonating with the celestial harmony. Tasting the marrow of phoenixes, wielding majesty and the *Hong Fan*, commanding the authority of Heaven’s Net. Thus, the First Dragon lashed the stones, and sea spirits came to pay homage. When King Wu sought spring, fire swiftly answered his call. Illusions and transformations align—Heaven’s power remains unfathomable.”",
      "overlap_context": "nswering his wife. Qi is stored and expands: mountains naturally rise, and what rises becomes clouds, for clouds follow ascending qi. The dragon’s power draws them forth. Rivers naturally descend, and what descends becomes water, for water follows descending qi. The dragon’s power seethes within. Thus, above and below are not obstructed by intermediate forms, and the Two Modes achieve profound transformation.”\n\nHe asked, “Winter snow falls in six-pointed flakes, while spring snow falls in five—”",
      "start_char": 3382,
      "end_char": 3758,
      "start_sentence": 292,
      "end_sentence": 325,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.585146188735962,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "天问不能屈，仙史复起而言曰：“天对玄奥，子真能泄玄秘，谈玄论，予愿乐闻者已闻命矣。 子能赋《仙女赋》乎？ ” 仙女遂援笔而赋之。 赋曰：“维｛艹曳｝府之灵，列宿之英。 资阴阳以成性，资变化以成形。 衣云裳而披霞锦，能知来而藏往。 飧石髓而饮玉液，亦含几而内朗。 若夫朝游北海，暮宿丹丘。 朱颜映日，云鬓凝秋。 忽凌霄而起远，乍排空而出幽。 恨晚遇之不偶，如夜光之暗投。 足方进而将退，心欲去而复留。 幸启扉以列坐，共啜茗而凝眸。 同董姬之相济，岂江妃之嬉游？ 意乞巧于北牖，弗自赋其东楼。 然离易会难，聚或成散。 居无定所，习无常玩。 神思端庄，贞一无乱。 情罔溺于房帷，道先登于畔岸。 与尔谈子午之窟，而轶唐宋。 泄阴阳之秘，而驾秦汉。 搜理义而益精，阐人文而愈焕。 异仰青藜之光辉，岂耽角枕之灿烂？ 起昏昧于阴霾，如太阳之始旦。 尔毋偏拗自恃，得人是资。 顾君子之有道，В梅求其庶士。 同处女之有待，葛覃恐其失时。 循礼不售，韬光祈晦。 随拒纳而行止，候昏明而进退。 委贱躯兮怀望，任人情兮推迁。 惭田生灵丹之蕴彩，陋云客寒灰之起烟。 非人心而苟合，实天意而曲全。 须知蜉蝣之夕，当羡龟鹤之年。 人非尽归于黄土，吾已实得乎先天。 终超仙而脱俗，勿得鱼而忘筌。 若乃葛洪有妻，王母有婿，尔何拂清风而独远，升白云而高致？ 毋徇己以自悔，盍因人而成事？ 物有感而情偕，迹或均而行异。 始未明其取舍，今宜识其旨意。 子尚不知仙女之为乐，予又安知尘缘之为利？ 于是徘徊房露，惆怅阳阿。 惜纡轸其何托，诉浩月而长歌。 歌曰：‘□人遇兮真情阙，对面千里兮虚明月。 临风浩叹兮将焉歇？ ’歌响未终，余景就毕。 凄惨变容，惺惺如失。 又歌曰：‘明月既没兮露欲，时不再兮吾将安依？ 佳期可待兮心弗违。 ’”仙史曰：“善，子复能代我歌《仙史歌》乎？ ”仙女双援笔而歌之。 歌曰：“我生之辰木入斗，鸣啼东井命壁守。 壁为文章斗得岁，许我文章播人口。 三龄能言学诵诗，四龄指字识某某。 五龄琢句对虚实，联青骊黄媲奇偶。 客来当座赋短章，四韵不待八叉手。 九龄六经已毕读，掩卷背诵无制肘。 丰仪翩翩秋天鹤，颜色濯濯春月柳。 乡闾每辱师长爱，学校耻与儿曹友。 支分缕析辩异同，务植佳禾去狼莠。 挥毫直欲五色烂，倚马未肯一字苟。 龙蛇拟将赤手缚，富贵自可拾芥龋文场驰骤竟一蹶，□鬣局促俯其首。 归来焚香长夜坐，盥栉不暇面尘垢。 淬锋砭□□期再荣，狐豕隳突群儿吼。 岂惟文运遭九七，无乃历数厄阳九。 自渐定乱匪铅椠，效卜父子鬻田亩。 白下归来生计拙，涂抹破砚扫敝帚。 囊资空乏衣破裂，无以补缀谋诸妇。 妇言别久簪珥空，借旧乞邻无不有。 高堂姑老儿女幼，日羞鱼虾买黎藕。 思无完帛御姑寒，那得吴绵与君厚。 我闻愧赧双脸赤，洒泪出门心欲剖。 病躯有仆不得将，药食扶持赖亲友。 自喜筋力尚康强，须鬓垂云志未朽。 老逢诸侯远聘征，白壁玄贲林薮。 经纶欲试不强辞，儒服长揖坐谈久。 青锁漏前传午滴，紫幞炉熏散春牖。 时番玉检题鸾凤，复赐银笺篆蚪斗。 清平不向玉关行，手持玉简金揩走。 有生豫定非强求，东井文章决传后。",
      "translated_text": "The *Heavenly Questions* could not confound her, and the Immortal Historian rose once more to speak: “The celestial responses are profoundly abstruse—you truly possess the power to unveil their mysteries, discoursing on the arcane and expounding the subtle. What I have longed to hear, I have now heard. But can you compose the *Rhapsody on the Immortal Maiden*?”\n\nThe Immortal Maiden thereupon took up her brush and wrote:\n\n**Rhapsody on the Immortal Maiden**\n\n“She is the spirit of the {herb}-bound palace, the essence of the starry ranks.\nNurtured by yin and yang to perfect her nature, shaped by transformation to form her being.\nRobed in cloud-garments and draped in rosy brocade, she knows the future and conceals the past.\nShe feasts on stone marrow and drinks jade nectar, her inner radiance containing the subtlest signs.\n\nAt times, she roams the Northern Sea at dawn and lodges in Red Mound by dusk.\nHer crimson countenance mirrors the sun, her cloud-like tresses congeal in autumn’s chill.\nNow she soars beyond the heavens, now she parts the void to emerge from obscurity.\nAlas, our late encounter was ill-fated, like a pearl cast into darkness.\nHer steps advance yet hesitate to retreat; her heart yearns to depart but lingers still.\nFortunate to have the door opened for her, she sits in company, sipping tea while gazing intently.\nLike Dong Ji’s steadfast aid, not the wanton frolics of the Jiang fei.\nHer thoughts seek skill at the northern window, not idle verses on an eastern tower.\n\nYet parting comes easily, reunion is hard; gatherings may scatter.\nShe has no fixed abode, no constant pastimes.\nHer spirit is serene and dignified, her integrity unswerving.\nNever drowned in the chambers of desire, her Dao first ascends the distant shore.\nWith you, she discusses the mysteries of the Zi-Wu caves, surpassing Tang and Song.\nShe reveals the secrets of yin and yang, outshining Qin and Han.\nHer grasp of principle and righteousness grows ever keener, her illumination of culture ever more resplendent.\nHow could she delight in the glow of green reeds, or indulge in the glitter of jeweled pillows?\nShe dispels the gloom of dark mists, like the sun at dawn’s first light.\n\nDo not be stubborn or self-reliant—one must rely on others.\nConsider the noble man who follows the Dao, seeking worthy scholars as plum blossoms seek the multitude.\nLike the waiting maiden, she fears missing her moment, as the *Ge Tan* laments lost time.\nFollowing propriety yet unrecognized, she conceals her brilliance and prays for obscurity.\nHer actions and pauses follow acceptance or rejection; her advances and retreats await twilight or dawn.\nShe humbly offers her lowly self, cherishing hope, yielding to human sentiment and its vicissitudes.\nAshamed that her talents pale beside Tian Sheng’s elixir of radiant hues, or the cloud-dweller’s cold ashes rekindled to smoke.\nNot a fleeting union of human hearts, but Heaven’s will bending to preserve.\nKnow that the mayfly’s evening is short—envy the tortoise and crane’s long years.\nNot all mortals return to yellow earth; I have already attained the primordial.\n\nIn the end, I transcend immortality and shed the mundane—do not catch the fish and forget the trap.\nYet Ge Hong had a wife, the Queen Mother a son-in-law—why do you spurn the clear breeze and wander alone, ascending white clouds in lofty detachment?\nDo not cling to self and regret; why not rely on others to accomplish great deeds?\nThings may stir emotions in unison, yet paths may align while actions diverge.\nAt first, the choice was unclear; now you must grasp its intent.\nIf even you fail to know the joy of being an immortal maiden, how could I fathom the profit of worldly ties?”\n\nThereupon, she paced beneath the dew-laden eaves, melancholy in the glow of Yang’e.\nGrieving for her tangled sorrows, to whom could she entrust them? She poured out her lament to the vast moon in song:\n\n*‘A chance meeting—true feeling absent,*\n*Face to face a thousand li, the moon’s emptiness.*\n*Standing in the wind, a deep sigh—where will it end?’*\n\nBefore the song’s echo faded, the lingering light waned.\nHer expression turned mournful, her gaze lost as if bereft.\nShe sang again:\n\n*‘The bright moon has set, the dew thickens,*\n*Time does not return—where shall I turn?*\n*Yet the appointed hour may come—my heart will not betray.’”*\n\nThe Immortal Historian said, “Excellent! Can you now compose the *Song of the Immortal Historian* in my stead?”\n\nThe Immortal Maiden took up her brush once more and wrote:\n\n**Song of the Immortal Historian**\n\n“My birth fell when wood entered the Dipper, the Eastern Well’s cry guarded the Wall.\nThe Wall governs literature, the Dipper bestows years—my words spread among the people.\nAt three, I could speak and recite poetry; at four, I pointed to characters and knew them all.\nAt five, I crafted lines on emptiness and fullness, pairing green steeds and yellow steeds in wondrous symmetry.\nWhen guests arrived, I composed short verses on the spot—four rhymes required no eight-fold clasping of hands.\nAt nine, I had read the Six Classics in full, reciting them from memory without pause.\nMy bearing was as graceful as an autumn crane, my countenance as fresh as a spring willow.\nIn my village, teachers and elders favored me; at school, I scorned the company of children.\nI dissected distinctions with thread-like precision, striving to cultivate fine grain and uproot weeds.\nMy brush danced with five colors ablaze; leaning on a horse, I would not let a single word falter.\nI sought to bind dragons and serpents with bare hands—wealth and honor were as easy to grasp as mustard seeds.\n\nYet in the literary arena, my gallop ended in a stumble; my mane bristled, my head bowed in defeat.\nReturning home, I burned incense through long nights, too preoccupied to wash the dust from my face.\nI tempered my blade, awaiting the dawn of renewed glory, while foxes and swine trampled, and children howled.\nWas my literary fate doomed by the nine-seven cycle? Or was my destiny afflicted by the Yang-nine calamity?\nI lamented that my brush could not quell chaos, so I sold my fields like the Fu father and son, divining fortunes.\n\nReturning from Baixia, my livelihood was meager—ink smeared on broken inkstones, brooms swept in disarray.\nMy purse was empty, my clothes in tatters, with nothing to mend them but to beg my wife.\nShe said, ‘Long parted, my hairpins and earrings are gone—borrowing from old neighbors yields nothing.’\nMy aged mother, young children—each day I shamefully bought shrimp and lotus roots.\nI longed for whole cloth to warm my mother, but where could I find Wu cotton to thicken your winter clothes?\nHearing this, my face burned with shame; tears welled as I left, my heart rent in two.\nMy sickly frame had no servant to attend me—medicine and meals relied on friends and kin.\nYet I rejoiced that my strength still endured, my temples clouded with age but my will unbroken.\nIn old age, I was summoned by distant lords, white jade and dark gifts from forests and marshes.\nEager to test my schemes, I did not refuse; in scholar’s robes, I bowed and sat in long discourse.\nBefore the green-locked gates, the noon drips echoed; through purple-curtained windows, spring incense wafted.\nAt times, jade tablets bore phoenix scripts; again, silver stationery was etched with tadpole seals.\nIn times of peace, I did not march to Jade Pass—my hands held jade slips and golden brushes.\nMy life’s course was predestined, not forced; my Eastern Well’s literature would surely endure.”",
      "overlap_context": "s through generations—bodies aligned with crimson clouds, jade tablets extending their legacy. The Mysterious Heaven’s pivot turns, music resonating with the celestial harmony. Tasting the marrow of phoenixes, wielding majesty and the *Hong Fan*, commanding the authority of Heaven’s Net. Thus, the First Dragon lashed the stones, and sea spirits came to pay homage. When King Wu sought spring, fire swiftly answered his call. Illusions and transformations align—Heaven’s power remains unfathomable.”",
      "start_char": 3758,
      "end_char": 5001,
      "start_sentence": 326,
      "end_sentence": 405,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.6519455909729,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "尽将得失付忘言，浩歌长醉一尊酒。 ” 歌毕向前而揖曰：“予与尔有夙缘，子勿能却，予勿能离，愿化为清风一袭，入于陈氏子之躯，终身为子执箕帚，子窃以为何如？ ”曰：“子之所谈玄也，子之歌赋善也，今子所论，不亦幻诞而不经耶？ ”曰：“昔□坚之母，感阳宿之精，腹孕六子，剖胁始生。 吾以处子之精，而入处子之身，不过美仪容，益智慧，倍遐龄而已，子何足怪乎？ ”忽见清风四起，遂不知其所往。 翼辰，外母以女染奇疾，惊怖，召予面会永诀。 予省视之，见病中容貌，体态言谈，与夜遇仙女无异。 心窃怪之，惟慰以无恙而回。 逾月病瘳，是年孟冬五日，议昏邑尹。 晋江行吾张公、学师安福湖山尹夫子与闻其事，锡以鼓乐彩帐，舆从厚仪，行古奠雁礼，亲迎于归。 归后，德行文艺，渐进未艾，咸陈氏子内助之力也。 陈氏子名千金，字辛妹，别号房室仙姬。",
      "translated_text": "I cast all gains and losses to forgotten words, singing boldly, drunk on a single cup of wine.\n\nWhen the song ended, she stepped forward and bowed, saying: “You and I share a predestined bond—you cannot refuse, nor I depart. I wish to transform into a single wisp of pure wind, enter the body of the Chen family’s son, and serve you with broom and dustpan for life. What say you to this?”\n\nI replied: “Your discourse is profound, your songs and verses exquisite. Yet what you propose now—is it not fantastical and beyond reason?”\n\nShe answered: “Of old, the mother of Fu Jian conceived by the essence of the sun’s lodging, bearing six sons from her split flank. I, with the purity of an untouched maiden, enter the body of another—merely to enhance her beauty, sharpen her wit, and double her years. Why find this strange?”\n\nSuddenly, a pure wind arose on all sides, and she vanished without a trace.\n\nAt dawn, my mother-in-law sent word that her daughter had fallen gravely ill, and in alarm, summoned me for a final farewell. I went to see her and found that in sickness, her features, bearing, and speech were no different from the immortal maiden I had met the night before. My heart harbored doubt, yet I offered comfort and returned, saying all would be well.\n\nA month later, her illness abated. On the fifth day of the first winter month that year, the magistrate arranged our betrothal. The esteemed Prefect Zhang of Jinjiang and my teacher, Master Yin of Hushan in Anfu, learned of the matter and bestowed upon us music, embroidered canopies, a grand procession, and lavish gifts. Following the ancient rite of presenting the wild goose, they personally came to escort the bride home.\n\nAfter our union, her virtue, conduct, and literary arts advanced without cease—all through the aid of the Chen family’s daughter. Her name was Qianjin, styled Xinmei, and she was also called the Fairy of the Nuptial Chamber.",
      "overlap_context": "Eager to test my schemes, I did not refuse; in scholar’s robes, I bowed and sat in long discourse.\nBefore the green-locked gates, the noon drips echoed; through purple-curtained windows, spring incense wafted.\nAt times, jade tablets bore phoenix scripts; again, silver stationery was etched with tadpole seals.\nIn times of peace, I did not march to Jade Pass—my hands held jade slips and golden brushes.\nMy life’s course was predestined, not forced; my Eastern Well’s literature would surely endure.”",
      "start_char": 5001,
      "end_char": 5348,
      "start_sentence": 406,
      "end_sentence": 419,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.54923963546753,
      "metadata": {
        "source_file": "dao\\藏外\\会仙女志.txt",
        "category": "藏外"
      }
    }
  ]
}