{
  "source_id": "保生要录",
  "source_file": "chunked_daozang\\保生要录.json",
  "total_chunks": 4,
  "total_original_chars": 3750,
  "total_translated_chars": 20178,
  "total_translation_time": 104.82930040359497,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\保生要录.txt",
    "category": "方法类"
  },
  "full_translation": "**Preface to the *Essential Record for Preserving Life***\n\nI have often heard that the pine may endure for a thousand years, while snow cannot hold its form for even a single moment. If one plants a pine in rotten soil, it will surely decay within months; if one stores snow in a shaded mountain, it may remain unmelted for years on end. That which defies its nature becomes brittle though once firm, while that which follows its principle may endure though once fleeting—such is the way of things, and how could human affairs differ?\n\nThus, how could the arts of nurturing and regulating life be neglected?\n\nI have perused the works of earlier scholars on preserving life, yet they are often bound by excessive taboos and overly intricate methods, making practice difficult. For those of high rank, such regimens are even harder to follow. In my youth, I suffered frequent illness and turned my attention to the cultivation of life. After long study, I have compiled this work, which is simple and easy to practice in moments of leisure. First, one must secure the upright *qi*; next, one must harmonize the limbs and body. As for clothing, shelter, medicinal formulas, and the properties of vegetables, fruits, fowl, and fish—what is beneficial is recorded, while what offers no aid is omitted. Where ancient formulas err, I clarify them; where common practices stray, I correct them. Thus, I title this work the *Essential Record for Preserving Life*. Though it may not greatly aid in attaining the Dao, it roughly serves the purpose of safeguarding health. With trepidation, I present it, prostrating in awe.\n\nRespectfully inscribed by Pu Qian’guan.\n\n**Essential Record for Preserving Life**\n\n**By Pu Qian’guan, Gentleman for Consultation**\n\n**Nurturing Spirit and Qi**\nJī Xūyè said: \"To take medicine seeking sweat, one may yet fail to obtain it. But when shameful thoughts arise, sweat flows freely.\" When emotions arise within and manifest without, one knows that joy, anger, sorrow, and delight—none fail to harm the person. Thus, if the heart remains unperturbed, the spirit does not weary; if the spirit does not weary, the *qi* does not scatter; if the *qi* does not scatter, the body is at peace and life is prolonged.\n\n**Regulating the Limbs and Body**\nFor those who cultivate life, the body should engage in light labor, never to the point of exhaustion. Thus, water flows and remains clear; when stagnant, it becomes foul. The one who nurtures life desires the blood and vessels to flow ceaselessly, like water in motion. One should not sit to the point of fatigue nor walk to the point of weariness. Frequent movement, though gentle, is the art of light labor. Therefore, the hands and feet should often bend and stretch; the arms should pull left and right as if drawing a bow, or both hands should press outward as if lifting a stone. One may punch the air with clenched fists, swing the arms lightly left and right or forward and back, turn the head and neck to look left and right, twist the waist and hips, or bow and lift the head. The hands may grasp each other and twist gently as if washing them, or rub the palms together until warm to cover the eyes and massage the face. When idle, one may perform these movements at will, each ten times or so. Practicing them daily ensures a light body, bright eyes, supple joints, smooth blood and *qi*, easy digestion, and no stagnation. If the body feels slightly unwell, performing these movements will resolve it. Old *daoyin* methods are too cumbersome for those of high rank to practice. This method requires no fixed time or count; one may perform it when at leisure, and its effects are swift.\n\nWhen lying down at night, one should rub the limbs, chest, and abdomen with the hands ten times or so—this is called \"dry bathing.\" Sleeping on the side with bent knees strengthens *qi* and vigor. One should spit out turbid saliva but swallow clear fluids. Often pressing the tongue against the upper palate, gathering the clear fluids and swallowing them, moistens the five viscera, gladdens the skin, and grants long life without aging. The *Scripture of the Yellow Court* says: \"The mouth is the Jade Pool, the palace of great harmony; rinsing and swallowing the numinous fluid keeps calamity at bay.\" It also says: \"Close the mouth, curl the tongue to drink the embryonic fluid, and I shall refine and attain transcendence.\" Frequently clicking the teeth strengthens them and wards off evil.\n\nIn spring and summer, one should sleep late and rise early; in autumn, sleep early and rise early; in winter, sleep early and rise late. One should not rise before the cock crows nor sleep after sunrise. In heat, one should remain relaxed; in cold, one should stay warm and enclosed. This accords with the four seasons and is the way to preserve the body and prolong life.\n\n**On Clothing**\nI have heard that the thickness of clothing should suit the season and be moderate. Thus, in summer, one should not wear only thin garments, nor in winter should one dress excessively warm. In intense heat, wearing a single layer, with a light robe and light curtains, or covering the waist, abdomen, and knees with a quilt, is most beneficial. In winter, cotton clothing should not be too thick; when cold, one may add layers gradually. This prevents sudden exposure to cold or heat. Thus, in cold weather, warmth is preserved, and one is not harmed by excess heat; in hot weather, coolness is added, and one is not harmed by cold. If one recklessly removes or adds clothing with the changing temperatures, one will be harmed by cold or heat. In cold, one should dress gradually; in heat, one should remove layers gradually. The area from the waist down to the feet should remain warm, while the chest up to the head should be slightly cool—but not so cool as to chill, nor so warm as to dry. If clothing becomes damp with sweat, change it at once. Do not wear clothes that have just been heated by fire before the heat has dissipated. When cold and heat are balanced and the body and spirit are tranquil, illness does not arise, and life is naturally prolonged.\n\n**On Diet**\nFood and drink nourish the blood and *qi* of the person. Blood nourishes and beautifies the body, while *qi* guards and protects the limbs. The essence becomes marrow and essence; the lesser part becomes flesh and muscle. One should not wait until extreme hunger to eat nor until extreme fullness to stop. One should always eat to a state between hunger and satiety.\n\nThe Daoist of the Green Ox said: \"One should eat only when hungry and drink only when thirsty, never forcing food or drink.\" One should not eat hot food first and then cold, lest the clash of cold and heat cause harm. All food should first be hot, then warm, and only then may one consume a little cold food. Food that is too hot harms the bones; food that is too cold harms the sinews. Though hot, it should not scald the lips; though cold, it should not freeze the teeth. In eating, warm is better than cold, little is better than much, cooked is better than raw, and bland is better than salty.\n\nAfter eating hot food, do not wash the face, lest one lose their complexion and feel as if insects crawl upon it. Washing the hair after a full meal causes head wind. One should not indulge excessively in favored foods, lest it cause harm and illness. Nor should one entirely abandon disliked flavors, lest the viscera and *qi* become unbalanced. For example, avoiding all bitter flavors weakens the heart *qi*, and avoiding all salty flavors weakens the kidney *qi*.\n\nThus, heaven has the five phases, humans have the five viscera, and food has the five flavors. The liver corresponds to wood, the heart to fire, the spleen to earth, the lungs to metal, and the kidneys to water. Sour enters the liver, bitter enters the heart, sweet enters the spleen, acrid enters the lungs, and salty enters the kidneys. Wood generates fire, fire generates earth, earth generates metal, metal generates water, and water generates wood. Wood restrains earth, earth restrains water, water restrains fire, fire restrains metal, and metal restrains wood. Therefore, in each season, one should not overconsume the flavor that dominates or the one that restrains it, as both harm the dominant viscus. One should eat the flavors that generate the dominant phase to assist its *qi*. When the dominant viscus is unharmed and its *qi* is augmented, when diet is moderate and cold and heat are balanced, no illnesses arise, and long life is naturally prolonged.\n\n**On Residence and Dwelling**\n\nThe *Tradition* states: \"Where the earth is thick and the water deep, dwelling there brings no illness.\" Thus, in choosing a place to live, one should seek locations where the earth is thick and the water deep, regardless of direction. The soil should be firm, moist, and yellow; the water should be sweet, pure, and clear. The dwelling one habitually occupies must be tightly sealed, with no crevices allowing wind to enter, for prolonged exposure harms the body.\n\nWind is the *qi* of Heaven and Earth—it can nurture all things yet also injure man. When it first enters the interstices of the skin, it gradually penetrates the flesh, then transmits inward through the channels and collaterals, reaching the viscera and bowels. As its transmission spreads, its harm deepens. Thus, the ancients said: \"Avoid wind as one avoids an arrow.\"\n\nIn sweltering heat, sitting in a room open at both ends readily invites wind, especially in narrow passageways. One must not sleep exposed during intense heat. From the Beginning of Spring to the Beginning of Autumn, one should sleep with the head facing east; from the Beginning of Autumn to the Beginning of Spring, with the head facing west.\n\nA medicinal pillow is superior to one of precious jade, for jade, being excessively cold, harms the brain. If the medicinal properties are too heating, the hot *qi* will rush upward; if too cold, the cold *qi* will injure the brain. Only those that regulate wind and balance cold are appropriate.\n\n**Recipe for the Medicinal Pillow**\nUsed over time, it treats head wind, dizziness, heaviness of the brain, cold-induced pain, dim vision, nasal congestion, and also wards off evil.\n\n- *Manjingzi* (Vitex fruit) – 8 fen\n- *Ganjuhua* (chrysanthemum) – 8 fen\n- *Xixin* (asarum) – 6 fen\n- *Haobaizhi* (angelica) – 6 fen\n- *Baimu* (stemona) – 4 fen\n- *Shaoyao* (peony) – 6 fen\n- *Tongcao* (tetrapanax) – 8 fen\n- *Fangfeng* (saposhnikovia) – 8 fen\n- *Gaoben* (ligusticum) – 6 fen\n- *Lingyangjiao* (antelope horn) – 8 fen\n- *Xijiao* (rhinoceros horn) – 8 fen\n- *Shishangwangpu* (acorus) – 8 fen\n- Black soybeans – 5 *ge* (selected, rinsed in cold water)\n\nGrind the above ingredients finely, sift to remove coarse particles, and mix evenly. Place them in a raw silk pouch. To enhance their efficacy, enclose this pouch in a second bag of green silk, sewing it into a pillow shape. Pack the herbs tightly, then place the pillow in a box of the same shape, allowing the herb-filled pouch to protrude about one and a half *cun* above the box’s rim. When using the pillow, remove the box’s lid; when not in use, replace it to prevent the medicinal *qi* from dissipating. Over time, the herbs will shrink; replenish them or add black soybeans to restore fullness. After three to five months, when the medicinal *qi* wanes, replace the herbs. Within ten days to a month of first use, a slight ringing in the ears may occur—this is the sign of the herbs drawing out wind.\n\n---\n\n**On Medicinal Foods**\n\n**Discerning the Use of Minerals and Metals**\nMinerals and metals possess principles of both benefit and harm. To master the art of nourishing life, one must thoroughly understand the nature of medicinal stones.\n\nLet us pose hypothetical questions to clarify these truths.\n\n**Question:** Minerals and metals do not decay when buried or soften when boiled; they can consolidate *qi* and prolong life. Herbs and plants, however, are prone to decay—how can they have the power to preserve vitality?\n\n**Answer:** Minerals and metals are inherently harsh and dry, lacking moisture. For those in their prime, consuming them brings no benefit; for the weak and infirm, their toxicity emerges. In youth, *qi* is abundant and smooth—abundance can restrain the stone, and smoothness can circulate it, so no harm arises. In old age, the *qi* of the constructive and defensive systems becomes sluggish; sluggishness prevents the stone from circulating, and weakness prevents it from being restrained. Unrestrained, the stone lingers and accumulates, becoming a grave danger. Seeking benefit, one incurs harm—where is the preservation of vitality?\n\n**Question:** Are there cases where the stone’s toxicity manifests even before debility sets in?\n\n**Answer:** When sorrow and worry lodge in the heart and cannot be dispelled, the constructive and defensive *qi* stagnate and fail to circulate. The stone’s potency congeals and does not disperse, giving rise to accumulations and sores. Some who consume minerals rely on their potency to indulge in excess, and as the stone’s force moves, it produces the condition of \"unyielding strength.\" The uninformed regard this as a miraculous effect, but when the essence and fluids wither and scorch, intense heat arises—like adding firewood to a boiling cauldron, few escape unscathed.\n\n**Question:** If minerals and metals are so harmful, why did the Divine Farmer include them in the *Materia Medica*?\n\n**Answer:** For those with extreme cold and deficiency, temporary use is permissible—once the illness is cured, one should stop, and no harm will follow.\n\n**Further Question:** Earlier, it was said that the stone’s potency is harsh, and its toxicity emerges when the viscera weaken. Yet those who are already deficient and take minerals do not seem to suffer harm—why is this?\n\n**Answer:** Initially, the stone’s potency remains dormant, and the body’s extreme cold and deficiency prevent its activation. Thus, during times of profound cold and deficiency, temporary use is acceptable. However, for long-term prevention of illness, herbs and plants are superior.\n\n**Question:** If herbs and plants themselves do not endure, how can they preserve human life?\n\n**Answer:** Consistent use allows their potency to accumulate, and after years of ingestion, great benefits are attained. Remedies for attacking illnesses show their efficacy when the disease is cured; formulas for preserving vitality prove their worth when the body feels at ease. When form and spirit are tranquil, longevity naturally endures.\n\n**Fruit-Based Foods**\n\n**Lotus Seed Powder**\nGoverns: supplementing the center, nourishing the spirit, augmenting *qi* and strength, and eliminating all illnesses. Prolonged use lightens the body and extends years.\n\nSelect lotus seeds in the eighth month when their skins have blackened. Remove the skins and hearts, dry in the sun, grind, and sift into powder. Take in the morning, mixed with wine or white congee. Do not consume with rehmannia.\n\nWhen lotus seeds are tender, eating them raw may disturb *qi*; as powder, they benefit the body.\n\n**Chestnut Powder**\nGoverns: thickening the intestines and stomach, supplementing kidney *qi*.\n\nDry chestnuts in the sun until their skins split naturally. Remove the skins, slice thinly, and dry thoroughly. Grind into powder and consume as with lotus powder.\n\nEating chestnuts raw may breed worms and disturb *qi*; cooked, they may cause bloating. It is best to dry them until half-dry, warm them near the body, and then consume—they are most beneficial.\n\n**Grape Syrup**\nThough a common preparation, it excels in tonic benefits. It governs damp impediment in sinews and bones, augments *qi* and strength, and nourishes the flesh. Long-term consumption lightens the body, prevents aging, and extends years.\n\nWhen grapes ripen, first pour a *dou* each of sheep broth and rice-washing water at the base of the vine. After one night, select the ripest grapes, place them in a new white jar, filling it snugly. Seal tightly for one hundred days, and the syrup will form naturally. Strain and drink—the flavor surpasses rich wine, greatly benefiting the body.\n\n**Pomegranate-Pear Syrup**\nTreats wind-heat, dizziness, oppression, and vexing agitation.\nTake twenty large green pears, ten pomegranates, and three *sheng* of light bamboo sap.\nPound the pomegranates and pears, squeeze out their natural juice, strain, and mix with the bamboo sap. Take five *ge* per dose, three times daily. If the pears are very large, use twenty; if small, thirty.\n\n---\n\n**Grains and Vegetables**\n**Sesame**\nGoverns vacuity and emaciation in the intestines, supplements the five viscera, augments *qi* and strength, promotes muscle growth, sharpens vision, fills the marrow and brain, strengthens sinews and bones, and dispels vacuous heat. Also called *jusheng*.\n\nThe *Four-Ridged* text calls it \"sesame,\" while the *Eight Grains* names it *jusheng*. Tao Hongjing states: \"Among the eight grains, only this is finest.\" Elsewhere, he notes its sweetness and classifies it with rice and beans—this refers specifically to black sesame.\n\nThe *jusheng* in use today has stems and pods resembling hemp, but its leaves are much larger, its taste bitter, and its nature extremely cold. A bitter taste precludes its inclusion among grains, and its cold nature renders it unsuitable for supplementation. Its leaves differ from hemp’s, drooping in shade and rising in sunlight—this must be a distinct plant, not *jusheng* or sesame. Yet common practice persists without recognizing the error.\n\nThe proper variety is black oil-sesame, which is sweet. Pods with four ridges are sesame; those with eight ridges are *jusheng*, precisely matching the *Divine Farmer’s Classic*. The bitter, cold variety should not be used.\n\n---\n\n**Meats**\n**Duanli Sheep**\nWhen men consume it, it depletes *yang*; when women consume it, it severs *yin*. This refers to horned northern sheep.\n\n**Sheep Marrow**\nSupplements vacuity and detriment.\n\n**Sheep Brain**\nConsumption does not benefit the body.\n\n**Venison**\nWarm. Supplements the center, fortifies the five viscera, and augments *qi* and strength.\n\nMaster Huju states: \"Deer are alert and fierce, feeding on fine grasses and dwelling only on hills or near moist valleys. Their suitability for divine offerings stems from their purity.\" They consume nine beneficial grasses: deer’s-tongue, deer’s-medicine, white mugwort, water dropwort, licorice, *shancang*, kudzu leaves and roots, *qitouhao*, and shepherd’s purse. These grasses resolve toxins, treat wind, and counteract mineral drugs. Eating venison while taking *aconite* reduces the latter’s efficacy. Avoid consumption in the fifth month, and keep velvet away from the nose.\n\n**River Deer**\nWarm. Supplements the five viscera. From the eighth to the eleventh month, it surpasses mutton in quality. After the twelfth month, it provokes wind, darkens the complexion, and becomes inedible.\n\n**Eel**\nWarm. Governs the five types of hemorrhoids, kills parasites, and supplements *yang* *qi*. Consuming it three to five times cures all ailments between the waist and kidneys. The five-colored variety also regulates the hundred diseases of the *dai* meridian in women. Mince the flesh, remove the bones, season with the five flavors, stuff into sheep intestines, tie the ends, and roast until cool. Then slice and eat.\n\n**Parrotfish**\nThe yellow female is warm. Governs vacuous thirst, frequent urination, and diarrhea; supplements the five viscera, augments *qi* and strength. The black variety treats wind.\n\n**Soft-Shelled Turtle**\nNeutral, supplementing. Dispels heat and blackness lodged in the joints. Avoid consumption in the fifth and sixth months. One person ground turtle shell into powder and, after contracting yin-dampness during these months, suddenly transformed into small turtles.\n\n**Cuttlefish**\nNeutral, supplementing. Not to be eaten with mushrooms. Best prepared in ghee.\n\nNote: The *du* fish has no sinews; the parrotfish has no marrow—both are often discarded in medicinal and culinary use.\n\n**Magpie**\nNeutral, supplementing.\n\n*The Essential Record of Life Preservation* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "保生要录 经名：保生要录。 五代·蒲虔贯撰。 一卷。 底本出处：《正统道藏》洞神部方法类。 参校版本：《说邻》本。 序 尝闻松有千岁之固，雪无一时之坚。 若植松於腐壤，不期月而必蠹； 藏雪於阴山，虽累年而不消。 违其性则坚者脆，顺其理则促者延，物情既尔，人理岂殊！ 然则，所谓调摄之术者，又可忽乎！ 臣窃览前人所撰保生之书，往往拘忌太多，节目大繁，行者难之。 在於崇贵，尤不易为。 臣少也多病，留心养生，研究即久，编次云就，其术简易，乘闲可行。 先欲固其正气，次欲调其肢体。 至於衣服居处，药饵之方，蔬果禽鱼之性，有益者必录，无补者不书。 古方有误者重明，俗用或乖者必正，目之曰《保生要录》。 虽无裨於闻道，粗有资於卫生，冒昧上献，伏深战灼。 蒲虔贯谨序 保生要录",
      "translated_text": "**Preface to the *Essential Record for Preserving Life***\n\nI have often heard that the pine may endure for a thousand years, while snow cannot hold its form for even a single moment. If one plants a pine in rotten soil, it will surely decay within months; if one stores snow in a shaded mountain, it may remain unmelted for years on end. That which defies its nature becomes brittle though once firm, while that which follows its principle may endure though once fleeting—such is the way of things, and how could human affairs differ?\n\nThus, how could the arts of nurturing and regulating life be neglected?\n\nI have perused the works of earlier scholars on preserving life, yet they are often bound by excessive taboos and overly intricate methods, making practice difficult. For those of high rank, such regimens are even harder to follow. In my youth, I suffered frequent illness and turned my attention to the cultivation of life. After long study, I have compiled this work, which is simple and easy to practice in moments of leisure. First, one must secure the upright *qi*; next, one must harmonize the limbs and body. As for clothing, shelter, medicinal formulas, and the properties of vegetables, fruits, fowl, and fish—what is beneficial is recorded, while what offers no aid is omitted. Where ancient formulas err, I clarify them; where common practices stray, I correct them. Thus, I title this work the *Essential Record for Preserving Life*. Though it may not greatly aid in attaining the Dao, it roughly serves the purpose of safeguarding health. With trepidation, I present it, prostrating in awe.\n\nRespectfully inscribed by Pu Qian’guan.\n\n**Essential Record for Preserving Life**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 325,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.602166891098022,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\保生要录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "司议郎蒲虔贯撰 养神气门 嵇叔夜云：服药求汗，或有弗获。 愧情一集，涣然流离。 明情发於中而形於外，则知喜怒哀乐宁不伤人。 故心不挠者神不疲，神不疲则黑不乱，气不乱则身泰寿延矣。 调肢体门 养生者，形要小劳，无至大疲。 故水流则清，滞则污。 养生之人，欲血脉常行，如水之流。 坐不欲至倦，行不欲至劳，频行不已，然宜稍缓，即是小劳之术也。 故手足欲时其屈伸，两臂欲左挽右挽如挽弓法，或两手双拓如拓石法，或双拳筑空，或手臂左右前后轻摆，或头项左右顾，或腰胯左右转，时俯时仰，或两手相捉，细细捩如洗手法，或两手掌相摩令热，掩目摩面，事闲随意为之，各十数过而已。 每日频行，必身轻、目明、筋节血脉调畅，饮食易消，无所拥滞。 体中小不佳快，为之即解。 旧导引方太烦，崇贵之人不易为也。 今此术不择时节，亦无度数，乘闲便作，而见效且速。 夫人夜卧，欲自以手摩四肢胸腹十数过，名曰乾浴。 卧欲侧而曲膝，益气力。 常时浊唾则吐，清津则咽。 常以舌拄上愕，聚清津而咽之，润五藏，悦肌肤，令人长寿不老。 《黄庭经》曰：口为玉池大和官，嗽咽灵液灾不干。 又日：闭口屈舌食胎津，使我遂炼获飞仙。 频叩齿令齿牢，又辟恶。 夫人春时、暑月，欲得晚眠早起，秋欲早眠早起、冬欲早眠晏起。 早不宜在鹦呜前，晚不宜在日出后。 热时欲舒畅，寒月欲收密。 此合四气之宜，保身益寿之道也。 论衣服门 臣闻衣服厚薄，欲得随时合度。 是以暑月不可全薄，寒时不可极温。 盛热能着单，熟衣外熟帐，或腰腹膝经已来覆被，极宜人。 冬月绵衣莫令甚厚，寒则频添重数，如此则令人不骤寒骤热也。 故寒时而热则臧，臧则不伤於温，热时而寒则加，加则不伤於寒。 寒热若时妄自脱着，则伤於寒热矣。 寒欲渐着，热欲渐脱。 腰腹下至足经欲得常温，胸上至头欲得稍冻。 冻不至冻，温不至燥。 衣为汗湿，即时易之。 黛衣火气未歇，不可便着。 夫寒热平和，形神恬静，疾疹不生，寿年自永。 论饮食门 饮食者，所以资养人之血气。 血则荣华形体，气则卫护四肢。 精华者，为髓、为精，其次者，为肌、为肉。 常时不可待极饥而方食，候极饱而彻僎，常欲如饥中饱，饱中饥。 青牛道士云：人欲先饥而后食，先渴而后饮，不欲强食、强饮故也。 又不欲先进热食而随餐冷物，必玲热相攻而为患。 凡食，先热食，次温食，方可少餐玲食也。 凡食，太热则伤骨，太冷则伤筋； 虽热不得灼唇，虽玲不可冻齿。 凡食，温胜玲，少胜多，熟胜生，淡胜咸。 凡食，热汗出勿洗面，令人失颜色，面上如虫行。 食饱沐发作头风。 凡所好之物，不可偏耽，偏耽则伤而生疾。 所恶之味，不可全弃，全弃则藏黑不均。 如全不食苦则心黑虚，全不食咸则肾黑弱是也。 是以天有五行，人有五藏，食有五味。 故肝法木，心法火，脾法土，肺法金，肾法水。 酸纳肝，苦纳心，甘纳脾，辛纳肺，咸纳肾。 木生火，火生土，土生金，金生水，水生木。 木制土，土制水，水制火，火制金，金制木。 故四时无多食所王并所制之味，皆能伤所王之藏也。 宜食相生之味，助王黑也。 王藏不伤，王气增益，饮食合度，寒温得宜，则诸疾不生，遐龄自永矣。",
      "translated_text": "**By Pu Qian’guan, Gentleman for Consultation**\n\n**Nurturing Spirit and Qi**\nJī Xūyè said: \"To take medicine seeking sweat, one may yet fail to obtain it. But when shameful thoughts arise, sweat flows freely.\" When emotions arise within and manifest without, one knows that joy, anger, sorrow, and delight—none fail to harm the person. Thus, if the heart remains unperturbed, the spirit does not weary; if the spirit does not weary, the *qi* does not scatter; if the *qi* does not scatter, the body is at peace and life is prolonged.\n\n**Regulating the Limbs and Body**\nFor those who cultivate life, the body should engage in light labor, never to the point of exhaustion. Thus, water flows and remains clear; when stagnant, it becomes foul. The one who nurtures life desires the blood and vessels to flow ceaselessly, like water in motion. One should not sit to the point of fatigue nor walk to the point of weariness. Frequent movement, though gentle, is the art of light labor. Therefore, the hands and feet should often bend and stretch; the arms should pull left and right as if drawing a bow, or both hands should press outward as if lifting a stone. One may punch the air with clenched fists, swing the arms lightly left and right or forward and back, turn the head and neck to look left and right, twist the waist and hips, or bow and lift the head. The hands may grasp each other and twist gently as if washing them, or rub the palms together until warm to cover the eyes and massage the face. When idle, one may perform these movements at will, each ten times or so. Practicing them daily ensures a light body, bright eyes, supple joints, smooth blood and *qi*, easy digestion, and no stagnation. If the body feels slightly unwell, performing these movements will resolve it. Old *daoyin* methods are too cumbersome for those of high rank to practice. This method requires no fixed time or count; one may perform it when at leisure, and its effects are swift.\n\nWhen lying down at night, one should rub the limbs, chest, and abdomen with the hands ten times or so—this is called \"dry bathing.\" Sleeping on the side with bent knees strengthens *qi* and vigor. One should spit out turbid saliva but swallow clear fluids. Often pressing the tongue against the upper palate, gathering the clear fluids and swallowing them, moistens the five viscera, gladdens the skin, and grants long life without aging. The *Scripture of the Yellow Court* says: \"The mouth is the Jade Pool, the palace of great harmony; rinsing and swallowing the numinous fluid keeps calamity at bay.\" It also says: \"Close the mouth, curl the tongue to drink the embryonic fluid, and I shall refine and attain transcendence.\" Frequently clicking the teeth strengthens them and wards off evil.\n\nIn spring and summer, one should sleep late and rise early; in autumn, sleep early and rise early; in winter, sleep early and rise late. One should not rise before the cock crows nor sleep after sunrise. In heat, one should remain relaxed; in cold, one should stay warm and enclosed. This accords with the four seasons and is the way to preserve the body and prolong life.\n\n**On Clothing**\nI have heard that the thickness of clothing should suit the season and be moderate. Thus, in summer, one should not wear only thin garments, nor in winter should one dress excessively warm. In intense heat, wearing a single layer, with a light robe and light curtains, or covering the waist, abdomen, and knees with a quilt, is most beneficial. In winter, cotton clothing should not be too thick; when cold, one may add layers gradually. This prevents sudden exposure to cold or heat. Thus, in cold weather, warmth is preserved, and one is not harmed by excess heat; in hot weather, coolness is added, and one is not harmed by cold. If one recklessly removes or adds clothing with the changing temperatures, one will be harmed by cold or heat. In cold, one should dress gradually; in heat, one should remove layers gradually. The area from the waist down to the feet should remain warm, while the chest up to the head should be slightly cool—but not so cool as to chill, nor so warm as to dry. If clothing becomes damp with sweat, change it at once. Do not wear clothes that have just been heated by fire before the heat has dissipated. When cold and heat are balanced and the body and spirit are tranquil, illness does not arise, and life is naturally prolonged.\n\n**On Diet**\nFood and drink nourish the blood and *qi* of the person. Blood nourishes and beautifies the body, while *qi* guards and protects the limbs. The essence becomes marrow and essence; the lesser part becomes flesh and muscle. One should not wait until extreme hunger to eat nor until extreme fullness to stop. One should always eat to a state between hunger and satiety.\n\nThe Daoist of the Green Ox said: \"One should eat only when hungry and drink only when thirsty, never forcing food or drink.\" One should not eat hot food first and then cold, lest the clash of cold and heat cause harm. All food should first be hot, then warm, and only then may one consume a little cold food. Food that is too hot harms the bones; food that is too cold harms the sinews. Though hot, it should not scald the lips; though cold, it should not freeze the teeth. In eating, warm is better than cold, little is better than much, cooked is better than raw, and bland is better than salty.\n\nAfter eating hot food, do not wash the face, lest one lose their complexion and feel as if insects crawl upon it. Washing the hair after a full meal causes head wind. One should not indulge excessively in favored foods, lest it cause harm and illness. Nor should one entirely abandon disliked flavors, lest the viscera and *qi* become unbalanced. For example, avoiding all bitter flavors weakens the heart *qi*, and avoiding all salty flavors weakens the kidney *qi*.\n\nThus, heaven has the five phases, humans have the five viscera, and food has the five flavors. The liver corresponds to wood, the heart to fire, the spleen to earth, the lungs to metal, and the kidneys to water. Sour enters the liver, bitter enters the heart, sweet enters the spleen, acrid enters the lungs, and salty enters the kidneys. Wood generates fire, fire generates earth, earth generates metal, metal generates water, and water generates wood. Wood restrains earth, earth restrains water, water restrains fire, fire restrains metal, and metal restrains wood. Therefore, in each season, one should not overconsume the flavor that dominates or the one that restrains it, as both harm the dominant viscus. One should eat the flavors that generate the dominant phase to assist its *qi*. When the dominant viscus is unharmed and its *qi* is augmented, when diet is moderate and cold and heat are balanced, no illnesses arise, and long life is naturally prolonged.",
      "overlap_context": "getables, fruits, fowl, and fish—what is beneficial is recorded, while what offers no aid is omitted. Where ancient formulas err, I clarify them; where common practices stray, I correct them. Thus, I title this work the *Essential Record for Preserving Life*. Though it may not greatly aid in attaining the Dao, it roughly serves the purpose of safeguarding health. With trepidation, I present it, prostrating in awe.\n\nRespectfully inscribed by Pu Qian’guan.\n\n**Essential Record for Preserving Life**",
      "start_char": 325,
      "end_char": 1569,
      "start_sentence": 21,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.72902250289917,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\保生要录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "论居处门 《传》曰：土厚水深，居之不疾。 故人居处，随其方所，皆欲土厚水深。 土欲坚润而黄，水欲甘美而澄。 常居之室，极令周密，勿有细隙致风气得入，久居善中人。 风者，天地之气也，能生成万物，亦能损人。 初入胜理之问，渐至肌肤之内，内传经脉，达于藏腑。 传变既广，为患则深，故古人云避风如避矢。 盛暑久坐两头通屋，大招风，夹道尤甚。 盛暑不可露卧，凡卧，自立春后至立秋前，欲束其首。 立秋后至立春前，欲西其首。 常枕药枕，胜於宝玉，宝玉大玲伤脑。 其枕、药性大热，则热气冲上； 大玲，又玲气伤脑，唯用理风平冻者，乃为得宜。 药枕方 久枕，治头风，目眩，脑重，玲疼，眼暗，鼻塞，兼辟邪。 蔓刻子八分 甘菊花八分 细辛六分 昊白芷六分 白木四分 芍蓊六分 通草八分 防风八分 叶本六分 羚羊角八分 犀角八分 石上万蒲八分 黑豆五合，拣择，授令冷 右件药细锉，去碎末，相拌令匀，以生绢囊盛之。 欲达其气，次用碧罗袋重盛，缝之如枕样，纳药，直令紧实，置在合子中。 其合形亦如枕，纳药囊，令出合子唇一寸半已来。 欲枕时，揭去合盖，不枕即盖之，使药黑不散，枕之日久，渐样，更入药，以实之，或添黑豆令如初。 三五月后药气歇则换之，初枕旬日或一月，耳中微呜，是药抽风之验。 论药食门 辨服金石 金石之药，有可服不可服之理。 欲究养生之术，须穷药石之由。 今假设问辞，用明至理。 或问曰：夫金石之药，埋之不腐，煮之不烂，用能固气，可以延年。 草木之药，未免腐烂之患，焉有固驻之功？ 答曰：夫金石之药，其性栗悍，而无津液，人之盛壮，服且无益，若及其衰弱，毒则发焉。 夫壮年则气盛而滑利，盛则能制石，滑则能行石，故不发也。 及其衰弱，则荣卫气涩，涩则不能行石，弱则不能制石，石无所制，而行者留积，故为人大患也。 欲益而损，何固驻之有哉。 问曰：亦有未虚而石发者乎？ 答曰：忧患在心而不能宣，则荣卫涩滞而不行，石势结积而不散，随其积聚发诸瘫疮。 又有服石之人，倚石势而纵佚游，石势既行，乃作强中之病。 不晓者，以为奇效，精液焦枯，猛热遂作，洞釜加爨，罕不焦然。 问曰：金石之为害若此，农皇何以标之於本经？ 答曰：太虚积玲之人，不妨暂服，疾愈而止，则无害矣。 又问：前云石势栗悍，藏衰则发。 今先虚而服石者，岂能制其势力乎！ 且未见其有害何也？ 答曰：初服之时，石势永积，又乘虚冷之甚，故不发也。 以此观之，当太虚积冷之时，暂可服饵。 若久长防患，则不如草木之药焉。 又问：草木自不能久，岂能固人哉夕答曰：服之不倦，势力相搂，积年之后，必获大益。 夫攻疗之药，以疾差而见功； 固驻之方，觉体安而是效。 形神既宁，则寿命自永矣。 果类 莲实粉主补中，养神，益气力，除百疾。 久服轻身延年。 取莲实，八月就他皮黑者，去皮、心，曝乾，捣、筛为粉。 早以酒或白粥调之。 不宜与地黄同食。 莲实嫩时，生食动气，为粉益人。 栗子粉，主厚肠胃，补肾气。 取栗子曝乾，令皮自拆，去皮，薄切，又曝令极乾，捣为粉。 如莲粉法食之。 凡食栗子，生食动虫、发气，熟食亦发胀，皆不及曝令半乾，衣中近肌肉暖而食之，其益人。",
      "translated_text": "**On Residence and Dwelling**\n\nThe *Tradition* states: \"Where the earth is thick and the water deep, dwelling there brings no illness.\" Thus, in choosing a place to live, one should seek locations where the earth is thick and the water deep, regardless of direction. The soil should be firm, moist, and yellow; the water should be sweet, pure, and clear. The dwelling one habitually occupies must be tightly sealed, with no crevices allowing wind to enter, for prolonged exposure harms the body.\n\nWind is the *qi* of Heaven and Earth—it can nurture all things yet also injure man. When it first enters the interstices of the skin, it gradually penetrates the flesh, then transmits inward through the channels and collaterals, reaching the viscera and bowels. As its transmission spreads, its harm deepens. Thus, the ancients said: \"Avoid wind as one avoids an arrow.\"\n\nIn sweltering heat, sitting in a room open at both ends readily invites wind, especially in narrow passageways. One must not sleep exposed during intense heat. From the Beginning of Spring to the Beginning of Autumn, one should sleep with the head facing east; from the Beginning of Autumn to the Beginning of Spring, with the head facing west.\n\nA medicinal pillow is superior to one of precious jade, for jade, being excessively cold, harms the brain. If the medicinal properties are too heating, the hot *qi* will rush upward; if too cold, the cold *qi* will injure the brain. Only those that regulate wind and balance cold are appropriate.\n\n**Recipe for the Medicinal Pillow**\nUsed over time, it treats head wind, dizziness, heaviness of the brain, cold-induced pain, dim vision, nasal congestion, and also wards off evil.\n\n- *Manjingzi* (Vitex fruit) – 8 fen\n- *Ganjuhua* (chrysanthemum) – 8 fen\n- *Xixin* (asarum) – 6 fen\n- *Haobaizhi* (angelica) – 6 fen\n- *Baimu* (stemona) – 4 fen\n- *Shaoyao* (peony) – 6 fen\n- *Tongcao* (tetrapanax) – 8 fen\n- *Fangfeng* (saposhnikovia) – 8 fen\n- *Gaoben* (ligusticum) – 6 fen\n- *Lingyangjiao* (antelope horn) – 8 fen\n- *Xijiao* (rhinoceros horn) – 8 fen\n- *Shishangwangpu* (acorus) – 8 fen\n- Black soybeans – 5 *ge* (selected, rinsed in cold water)\n\nGrind the above ingredients finely, sift to remove coarse particles, and mix evenly. Place them in a raw silk pouch. To enhance their efficacy, enclose this pouch in a second bag of green silk, sewing it into a pillow shape. Pack the herbs tightly, then place the pillow in a box of the same shape, allowing the herb-filled pouch to protrude about one and a half *cun* above the box’s rim. When using the pillow, remove the box’s lid; when not in use, replace it to prevent the medicinal *qi* from dissipating. Over time, the herbs will shrink; replenish them or add black soybeans to restore fullness. After three to five months, when the medicinal *qi* wanes, replace the herbs. Within ten days to a month of first use, a slight ringing in the ears may occur—this is the sign of the herbs drawing out wind.\n\n---\n\n**On Medicinal Foods**\n\n**Discerning the Use of Minerals and Metals**\nMinerals and metals possess principles of both benefit and harm. To master the art of nourishing life, one must thoroughly understand the nature of medicinal stones.\n\nLet us pose hypothetical questions to clarify these truths.\n\n**Question:** Minerals and metals do not decay when buried or soften when boiled; they can consolidate *qi* and prolong life. Herbs and plants, however, are prone to decay—how can they have the power to preserve vitality?\n\n**Answer:** Minerals and metals are inherently harsh and dry, lacking moisture. For those in their prime, consuming them brings no benefit; for the weak and infirm, their toxicity emerges. In youth, *qi* is abundant and smooth—abundance can restrain the stone, and smoothness can circulate it, so no harm arises. In old age, the *qi* of the constructive and defensive systems becomes sluggish; sluggishness prevents the stone from circulating, and weakness prevents it from being restrained. Unrestrained, the stone lingers and accumulates, becoming a grave danger. Seeking benefit, one incurs harm—where is the preservation of vitality?\n\n**Question:** Are there cases where the stone’s toxicity manifests even before debility sets in?\n\n**Answer:** When sorrow and worry lodge in the heart and cannot be dispelled, the constructive and defensive *qi* stagnate and fail to circulate. The stone’s potency congeals and does not disperse, giving rise to accumulations and sores. Some who consume minerals rely on their potency to indulge in excess, and as the stone’s force moves, it produces the condition of \"unyielding strength.\" The uninformed regard this as a miraculous effect, but when the essence and fluids wither and scorch, intense heat arises—like adding firewood to a boiling cauldron, few escape unscathed.\n\n**Question:** If minerals and metals are so harmful, why did the Divine Farmer include them in the *Materia Medica*?\n\n**Answer:** For those with extreme cold and deficiency, temporary use is permissible—once the illness is cured, one should stop, and no harm will follow.\n\n**Further Question:** Earlier, it was said that the stone’s potency is harsh, and its toxicity emerges when the viscera weaken. Yet those who are already deficient and take minerals do not seem to suffer harm—why is this?\n\n**Answer:** Initially, the stone’s potency remains dormant, and the body’s extreme cold and deficiency prevent its activation. Thus, during times of profound cold and deficiency, temporary use is acceptable. However, for long-term prevention of illness, herbs and plants are superior.\n\n**Question:** If herbs and plants themselves do not endure, how can they preserve human life?\n\n**Answer:** Consistent use allows their potency to accumulate, and after years of ingestion, great benefits are attained. Remedies for attacking illnesses show their efficacy when the disease is cured; formulas for preserving vitality prove their worth when the body feels at ease. When form and spirit are tranquil, longevity naturally endures.\n\n**Fruit-Based Foods**\n\n**Lotus Seed Powder**\nGoverns: supplementing the center, nourishing the spirit, augmenting *qi* and strength, and eliminating all illnesses. Prolonged use lightens the body and extends years.\n\nSelect lotus seeds in the eighth month when their skins have blackened. Remove the skins and hearts, dry in the sun, grind, and sift into powder. Take in the morning, mixed with wine or white congee. Do not consume with rehmannia.\n\nWhen lotus seeds are tender, eating them raw may disturb *qi*; as powder, they benefit the body.\n\n**Chestnut Powder**\nGoverns: thickening the intestines and stomach, supplementing kidney *qi*.\n\nDry chestnuts in the sun until their skins split naturally. Remove the skins, slice thinly, and dry thoroughly. Grind into powder and consume as with lotus powder.\n\nEating chestnuts raw may breed worms and disturb *qi*; cooked, they may cause bloating. It is best to dry them until half-dry, warm them near the body, and then consume—they are most beneficial.",
      "overlap_context": " earth, earth restrains water, water restrains fire, fire restrains metal, and metal restrains wood. Therefore, in each season, one should not overconsume the flavor that dominates or the one that restrains it, as both harm the dominant viscus. One should eat the flavors that generate the dominant phase to assist its *qi*. When the dominant viscus is unharmed and its *qi* is augmented, when diet is moderate and cold and heat are balanced, no illnesses arise, and long life is naturally prolonged.",
      "start_char": 1570,
      "end_char": 2860,
      "start_sentence": 85,
      "end_sentence": 144,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.69327521324158,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\保生要录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "葡萄作浆，虽是常术，且补益功优。 主筋骨湿痹，益气力肥健。 久服轻身，不老延年。 葡萄熟时，先於根底着羊肉汁、米坩汁各一斗，如是经宿拣熟者摘之，纳新白瓶中令满稍实，密封百日浆，自然成浆，去滓，饮之味过醇酣，甚益人。 榴梨浆治风热，昏闷烦躁。 青梨大者二十颗石榴十颗淡竹沥三升 右捣榴、梨，捩取自然汁，澄滤，拌竹沥。 一服五合，日三服。 梨极大，方用二十颗，小者三十颗。 谷并菜类 胡麻，主肠中虚赢，补五内，益气力，长肌肉，服明目，填髓脑，坚筋骨，去虚热。 一名巨胜。 四棱为胡麻云：八谷巨胜。 陶弘景云：八谷之中，唯此为良。 又云甘，在米豆部，此正是乌麻也。 今时所用巨胜，茎荚虽小类麻，而叶子大极，味苦，其性甚冷。 夫味苦不可入米谷，性冷不可为补益。 其叶又与麻不同，阴暗则低，日烈则起，此当别是一物，非巨胜、胡麻也。 今俗但用，不觉其非。 正当用乌油麻，味甘。 而荚有四棱者为胡麻，八棱者日巨胜，正合《本经》，不当用味苦而冷者也。 肉类 段坜羊，丈夫食之损阳，女人食之绝阴。 北羊中有角者是。 羊髓，补虚损。 脑髓，食不益人。 鹿肉，温。 补中，强五藏，益气力。 壶居士云：鹿性警烈，多食良草，处必山岗，产必润泽。 故可飨神者，以其洁故也。 食良草有九物，鹿葱，鹿药，白蒿，水芹，甘草，山苍，葛叶并根，齐头蒿、荠危。 鹿常食此。 九草，性能解毒，治风，压丹石。 服附子多食鹿肉，附子少力也。 五月忌食之，茸不可近鼻。 獐肉，温。 补五藏。 八月至十一月食胜羊肉，十二月已后动风、发黑，不堪食。 鳗党鱼，性温。 主五痔，杀诸虫，补阳气。 食三五度，腰肾间百病自差。 五色者，兼理妇人带脉百病。 碎切，去骨，以五味调肉，羊肠中系两头，炙之候玲，然后切食。 鹦，雌而黄者性温。 主虚渴、数溺、泄利，补五藏，益气力。 黑者，治风。 圆鱼，平，补。 去骨节问诸壅热黑。 五六月不宜食。 有人以鳖甲作散，五六月问感阴湿黑，忽化为小鳖。 堵无筋，鹦无髓，药食多绌之。 鹊，性平，补。 不宜合菌食之。 酥煎良佳。 保生要录竟",
      "translated_text": "**Grape Syrup**\nThough a common preparation, it excels in tonic benefits. It governs damp impediment in sinews and bones, augments *qi* and strength, and nourishes the flesh. Long-term consumption lightens the body, prevents aging, and extends years.\n\nWhen grapes ripen, first pour a *dou* each of sheep broth and rice-washing water at the base of the vine. After one night, select the ripest grapes, place them in a new white jar, filling it snugly. Seal tightly for one hundred days, and the syrup will form naturally. Strain and drink—the flavor surpasses rich wine, greatly benefiting the body.\n\n**Pomegranate-Pear Syrup**\nTreats wind-heat, dizziness, oppression, and vexing agitation.\nTake twenty large green pears, ten pomegranates, and three *sheng* of light bamboo sap.\nPound the pomegranates and pears, squeeze out their natural juice, strain, and mix with the bamboo sap. Take five *ge* per dose, three times daily. If the pears are very large, use twenty; if small, thirty.\n\n---\n\n**Grains and Vegetables**\n**Sesame**\nGoverns vacuity and emaciation in the intestines, supplements the five viscera, augments *qi* and strength, promotes muscle growth, sharpens vision, fills the marrow and brain, strengthens sinews and bones, and dispels vacuous heat. Also called *jusheng*.\n\nThe *Four-Ridged* text calls it \"sesame,\" while the *Eight Grains* names it *jusheng*. Tao Hongjing states: \"Among the eight grains, only this is finest.\" Elsewhere, he notes its sweetness and classifies it with rice and beans—this refers specifically to black sesame.\n\nThe *jusheng* in use today has stems and pods resembling hemp, but its leaves are much larger, its taste bitter, and its nature extremely cold. A bitter taste precludes its inclusion among grains, and its cold nature renders it unsuitable for supplementation. Its leaves differ from hemp’s, drooping in shade and rising in sunlight—this must be a distinct plant, not *jusheng* or sesame. Yet common practice persists without recognizing the error.\n\nThe proper variety is black oil-sesame, which is sweet. Pods with four ridges are sesame; those with eight ridges are *jusheng*, precisely matching the *Divine Farmer’s Classic*. The bitter, cold variety should not be used.\n\n---\n\n**Meats**\n**Duanli Sheep**\nWhen men consume it, it depletes *yang*; when women consume it, it severs *yin*. This refers to horned northern sheep.\n\n**Sheep Marrow**\nSupplements vacuity and detriment.\n\n**Sheep Brain**\nConsumption does not benefit the body.\n\n**Venison**\nWarm. Supplements the center, fortifies the five viscera, and augments *qi* and strength.\n\nMaster Huju states: \"Deer are alert and fierce, feeding on fine grasses and dwelling only on hills or near moist valleys. Their suitability for divine offerings stems from their purity.\" They consume nine beneficial grasses: deer’s-tongue, deer’s-medicine, white mugwort, water dropwort, licorice, *shancang*, kudzu leaves and roots, *qitouhao*, and shepherd’s purse. These grasses resolve toxins, treat wind, and counteract mineral drugs. Eating venison while taking *aconite* reduces the latter’s efficacy. Avoid consumption in the fifth month, and keep velvet away from the nose.\n\n**River Deer**\nWarm. Supplements the five viscera. From the eighth to the eleventh month, it surpasses mutton in quality. After the twelfth month, it provokes wind, darkens the complexion, and becomes inedible.\n\n**Eel**\nWarm. Governs the five types of hemorrhoids, kills parasites, and supplements *yang* *qi*. Consuming it three to five times cures all ailments between the waist and kidneys. The five-colored variety also regulates the hundred diseases of the *dai* meridian in women. Mince the flesh, remove the bones, season with the five flavors, stuff into sheep intestines, tie the ends, and roast until cool. Then slice and eat.\n\n**Parrotfish**\nThe yellow female is warm. Governs vacuous thirst, frequent urination, and diarrhea; supplements the five viscera, augments *qi* and strength. The black variety treats wind.\n\n**Soft-Shelled Turtle**\nNeutral, supplementing. Dispels heat and blackness lodged in the joints. Avoid consumption in the fifth and sixth months. One person ground turtle shell into powder and, after contracting yin-dampness during these months, suddenly transformed into small turtles.\n\n**Cuttlefish**\nNeutral, supplementing. Not to be eaten with mushrooms. Best prepared in ghee.\n\nNote: The *du* fish has no sinews; the parrotfish has no marrow—both are often discarded in medicinal and culinary use.\n\n**Magpie**\nNeutral, supplementing.\n\n*The Essential Record of Life Preservation* concludes.",
      "overlap_context": "urb *qi*; as powder, they benefit the body.\n\n**Chestnut Powder**\nGoverns: thickening the intestines and stomach, supplementing kidney *qi*.\n\nDry chestnuts in the sun until their skins split naturally. Remove the skins, slice thinly, and dry thoroughly. Grind into powder and consume as with lotus powder.\n\nEating chestnuts raw may breed worms and disturb *qi*; cooked, they may cause bloating. It is best to dry them until half-dry, warm them near the body, and then consume—they are most beneficial.",
      "start_char": 2861,
      "end_char": 3717,
      "start_sentence": 145,
      "end_sentence": 199,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.8048357963562,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\保生要录.txt",
        "category": "方法类"
      }
    }
  ]
}