{
  "source_id": "修真精义杂论",
  "source_file": "chunked_daozang\\修真精义杂论.json",
  "total_chunks": 9,
  "total_original_chars": 9511,
  "total_translated_chars": 54125,
  "total_translation_time": 256.8682219982147,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
    "category": "众术类"
  },
  "full_translation": "**Essential Miscellaneous Discourses on Cultivating Perfection**\n*Title:* *Essential Miscellaneous Discourses on Cultivating Perfection*\n*Author:* Sima Chengzhen of the Tang Dynasty\n*Volume:* One\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Zhongjie* Category\n*Collated Edition:* *Seven Lots from the Cloudy Satchel*, included in Volume 57\n\n**Essential Miscellaneous Discourses on Cultivating Perfection**\n*Recorded by the Master of White Clouds of Tiantai*\n\n### **On Daoist Breathing and Physical Exercises**\nThe limbs and joints fundamentally rely on movement for their function, while the meridians and *qi* of *ying* and *wei* depend on free circulation. Now, in seclusion with no laborious tasks, one must practice *daoyin* to achieve harmony and smoothness. The principle that \"the door hinge does not rot\" is indeed true.\n\nThe blood, *qi*, essence, and spirit of humans serve to nourish life and sustain destiny. The meridians conduct blood and *qi*. Thus, *ying-qi* circulates fluids, strengthens sinews and bones, and benefits the joints and diaphragm; *wei-qi* warms the muscles, fills the skin, nourishes the interstices, and governs opening and closing. Moreover, the floating *qi* that courses through the meridians is *wei-qi*, while the refined *qi* that flows within them is *ying-qi*. Yin and yang follow one another, interior and exterior interconnect, like a ring without end.\n\nThe head is the mansion of essence and clarity;\nThe back is the mansion of the chest;\nThe waist is the mansion of the kidneys;\nThe knees are the mansion of the sinews;\nThe marrow is the mansion of the bones.\nFurthermore, all bones pertain to the eyes, all marrow to the brain, all sinews to the joints, all blood to the heart, and all *qi* to the lungs—this is the daily cycle of the four limbs and eight joints.\n\nThus, the five labors cause harm through prolonged stillness or motion. The *daoyin* of the Five Animals stirs the joints, yet the human body’s upper and lower parts support one another, and the *qi*’s source and flow ascend and descend in order. I have observed that many *daoyin* texts lack sequence, but the method I transmit here has a clear principle.\n\nFor those whose five bodily parts are balanced, follow the standard count. If one area suffers from imbalance or illness, increase the repetitions and apply force there.\n\nGenerally, *daoyin* should be practiced between the *chou* (1–3 a.m.) and *mao* (5–7 a.m.) hours, when the *qi* of heaven is clear and harmonious. First, loosen the hair and comb it thoroughly, reaching the crown 365 times. Let the hair hang loose behind, or loosely tie it into a topknot. Burn incense, face east, sit upright with hands clenched, close the eyes to visualize the spirit, and click the teeth 365 times. Then relax the body, regulate the breath, and proceed in order.\n\nFirst, hold the breath. Interlace the fingers, turn the palms outward, and extend the arms fully, pushing forward for a long while. Then raise the hands, turn the palms upward, and stretch the arms fully. Lower the left hand and forcefully raise the right elbow, pressing the left elbow and arm against the back of the neck while the left hand pulls downward with force. Lean slightly left, open the right armpit, and strain the ribs. Repeat the same on the right side. Then lower the hands to hook the neck, raise both elbows, arch the chest, and tilt the head back, competing the strength of head and hands forward and backward. Next, lower the hands to hook the neck, swing the elbows, and twist the body left and right. Then rest the hands on the knees, exhale slightly to regulate the breath, and repeat the sequence three times.\n\nNext, extend the left hand with palm up and fingers upright, bend the right hand, raise the elbow with palm up and fingers upright, and open the arms and chest as if drawing a bow. Turn the head to the left, applying force to the neck, chest, bosom, arms, and elbows. Repeat three times on each side.\n\nNext, make fists with both hands, thrust the arms forward forcefully, then strain the elbows backward, contracting tightly with effort. Repeat three times forward and backward.\n\nNext, swing the left fist backward with force three times, then downward three times. Repeat with the right.\n\nNext, cross the arms before the chest, grasp the shoulders with the fingers, tilt the head back, arch the chest, and strain the abdomen and waist. Then lower the head, bend the waist, hunch the shoulders, and pull downward with force. Alternate lifting and lowering three times each.\n\nNext, place the wrists beneath the armpits, press the elbows forward, lower the head, and strain the back. Then tilt the head back, strain the chest and bosom, and press the elbows backward. Repeat three times forward and backward.\n\nNext, sit with knees bent, place both hands on the waist, and lean the body backward with force. Shake the body, then sit upright and relax. Repeat three times.\n\nNext, cross the legs and sit. Place the left hand near the body to support the left side, turn the wrist outward with fingers pointing inward, and grasp the left knee with the right hand. Turn the head left, look upward, and strain both arms with force. Repeat three times on each side.\n\nNext, straighten the knees and cross the legs. Interlace the fingers, turn the palms outward, and embrace the knees. Lower the head, strain the waist and back, and open the knees to press them with the arms. Then turn the palms inward, grasp the knees tightly, raise the body, tilt the face upward, stretch the throat and bosom, and apply force backward. Alternate lifting and lowering three times each.\n\nNext, cross the legs and sit. From the knees, extend the legs outward, grasp the toes with the hands, hunch the shoulders, and pull upward with force. Strain the waist and abdomen forward, sway left and right, and when the breath is exhausted, relax. Repeat three times.\n\nNext, grasp the left toes with the left hand, reaching the sole, and the toes with the wrist. Gradually extend the leg, then raise the heel. Place the right hand on the right knee, turn the head left and right, and compete the strength like a bird. Then bend the left leg, cradle the heel with both hands, and raise it high before lowering it. Press the knee with the left hand, grasp the foot with the right, press downward with the left hand, and pull upward with the right. Turn the head to the right rear and strain the shoulders. Repeat three times on each side.\n\nNext, extend both legs fully, lie supine, and support the back with the hands reversed. Bend the right leg and thrust forward with force as if treading, three times on each side.\n\nThen extend the right leg, bend the left leg, and place the left heel upon the right calf. Let the left knee hang downward until nearly touching, then alternate by extending the left and bending the right, three times on each side.\n\nNext, lie supine and reverse the hands to support the back. Raise the left knee, drawing the heel close to the buttocks. Lift the right heel to hook the left knee, then gradually press downward until the left knee nearly touches the ground, three times on each side.\n\nThen bend the left leg outward, grasp the left ankle with the left hand, and support the right knee with the right hand. Turn the head to the right, lower the left knee to nearly touch the ground, extend the foot outward, and pull inward with the hand, straining with force, three times on each side.\n\nNext, spread the knees apart and bring the heels together. Grasp the soles of the feet with both hands, tilt the head back, and lift with all one’s strength. When the breath is exhausted, relax the body, repeating three times.\n\nThen extend the legs and interlock the fingers to hook the insteps. Lie supine and pull backward with force, gradually raising the legs high. Strain the sinews and press the toes, three times on each side.\n\nNext, extend both legs fully, keeping the toes upright. Grasp the toes with both hands, lift the head, and exert force, repeating three times.\n\nThe Daoist exercises complete, sit upright and relax the body. Rub the palms together until warm, then raise them to the forehead, passing upward twenty-seven times.\n\nAfter rubbing the palms, wipe the eyes twenty-seven times. Then press the nose with the middle and ring fingers of both hands, moving up and down fourteen times. Interlace the index and middle fingers to lift the ears upward three to five times, then hook the ears with the tiger’s mouth and rotate the earlobes backward three to five times.\n\nRub the palms until hot, then wipe the face until it feels warm. Massage the neck, chest, and breasts several dozen times. Then massage the arms from the shoulders down to the backs of the hands, moving up and down several dozen times. Interlock the hands and twist them back and forth as if washing, exerting force several dozen times. Finally, massage and press the heart, abdomen, waist, and spleen until finished. Wait until the breath is regulated, then sit calmly and ingest qi according to the method.\n\nThe palm-rubbing, forehead-raising, and face-wiping should be done frequently for the best results. These are not limited to times of qi ingestion. The various Daoist exercises need not all be performed at once to avoid fatigue; do as is convenient. However, they should ultimately proceed from head to foot in sequence to ensure thorough circulation. They may also be done once every three to five days in full. There are also standing and reclining methods, which cannot all be described here; do as one sees fit.\n\n---\n\n**On Talismanic Water**\n\nTalismanic script consists of cloud-seal characters, luminous and divine writing. Its strokes bear resemblance, thus divine qi resides within; its characters have origins, thus cinnabar is used in their application. Water is the essence of primordial qi, the moisture of latent yang, upon which all things with form depend. Thus, water is the mother of qi, and when water is pure, qi is clear. Qi is the root of form, and when qi is harmonious, the body is at peace. Though the body’s constructive and defensive energies have their own internal fluids, the viscera and bowels of the abdomen also rely on external nourishment. Water can unblock the stomach and intestines, replenish fluids and qi, and guide the efficacy of talismans to assist incantations and defenses. Here, I compile methods for talismanic water to prepare for use; one may follow them accordingly.\n\nFor the above talisman, face the monthly branch on a full moon day, burn incense, and write in cinnabar on paper. Hold the water vessel in the left hand and the talisman in the right. Use one *sheng* of water to swallow it, or more or less as desired. Well-flower water is best, though spring water will suffice; take it at dawn. Recite the incantation:\n\n*\"Metal, Wood, Water, Fire, Earth—the qi of the Five Stars, the essence of the Six Jia. The three true celestial foods, ever filling the turbid qi. Yellow Father and Red Child, guard the center without deviation.\"*\n\nRecite this three times, all in one breath. Then knock the teeth three times, click the teeth three times, and spray the water with the talisman held in the mouth. Burn the talisman over the water and place the ashes into it, ensuring they do not scatter. Face north, bow twice, and ingest the water. Subsequent methods follow separate procedures, though they are variations of this one.\n\nFor the preceding talisman, on an *jiazi* day, write eight in cinnabar. On the full moon day, at dawn, take well-flower water. At sunrise, bow twice and declare: *\"I request to ingest this talismanic script, wishing for divine qi to fill me.\"* Ingest two talismans, then ingest two more at midday and on the day of the ruling branch. For the five *jia* days, one may write and ingest more as needed.\n\nThe six yang and yin talismans of the Six Jia are written according to their respective day-stems and branches within the square. Yang talismans bear *jiazi* below, and yin talismans bear *yichou*. Here, *jiazi* and *yichou* are given as examples. On *bingyin*, *dingmao*, and other days, write according to the day’s stem and branch. Those who do not understand this principle should note the text: *\"Write according to the respective stem and branch within the square.\"* This is akin to the Six Spirits’ master talisman, where the day’s stem is written within. Write yang talismans in red and yin talismans in black. One may also prepare talismans for an entire ten-day period in advance and ingest them at dawn. Each morning, face east, burn incense, hold the talisman in the left hand, and the water vessel in the right. Take well-flower water and ingest as much as desired. Recite the incantation:\n\n*\"True person so-and-so delights in the true Dao, ingesting the qi of central harmony. On *jiazi*, the Jade Maiden of Great Mystery assists. For a full ten-day period, recite this together. For other *jia* days, adjust accordingly. May the attendants of so-and-so’s traveling kitchen ensure no hunger or thirst.\"*\n\nThe original text also states: *\"Whether the cinnabar is large or small, whether the person is many or few, all shall be sated.\"* Since this is for self-ingestion, such words are omitted. Alternatively, it may be said: *\"Do not reduce the days.\"* The incantation may be recited at any time, day or night, to ensure satiety.\n\nUpon completion, bow twice, place the talisman in the mouth, and swallow it with water.\n\nDuring the *jiazi* ten-day period, the Jade Maiden of Great Harmony assists.\nDuring the *jiaxu* ten-day period, the Yellow-Silk Jade Maiden Feilian attends.\nDuring the *jiashen* ten-day period, the Great-Silk Jade Maiden Qiongshi attends.\nDuring the *jiawu* ten-day period, the Crimson Palace Jade Maiden Yunling attends.\nDuring the *jiachen* ten-day period, the Essence-Worship Jade Maiden Lingsu attends.\nDuring the *jiayin* ten-day period, the Azure-Waisted Jade Maiden Huijing attends.\n\nThe two talismans above are to be cinnabar-inscribed on the full day and ingested.\nDaoist Zhang Zideng ingested these.\nThe above talisman is to be cinnabar-inscribed on the full day and swallowed.\nDaoist Chen Shuping ingested these and has not eaten for five years.\nThe above ingestion method involves cinnabar-inscribing on the full day and swallowing; Daoist Xu Guang ingested these.\nThe following is the Master Anqi’s grain-cessation talisman: cinnabar-inscribed, three inches in crimson, sealed in a small tube, and struck against the right arm to prevent hunger and strengthen the body. The three talismans below belong to this category.\n\n**Method for Cessation of Grain Through Water Ingestion**\nEach morning, take well-flower water and store it in a vessel as usual. Use another fine vessel, for the water will become turbid over time, and prolonged ingestion of such is not ideal. Prepare it early, allow it to settle, and then take the clear portion to ingest. Face the king, burn incense, hold the water vessel in the left hand and an object in the right. Though the object is unnamed, any will suffice—preferably a segment of green bamboo, intact at both ends, for regular use in knocking. Recite the incantation:\n\n*\"By the grace of the Historian of Destiny and the root of divine beings, may the true red and yellow traverse without error, and may all physicians below guard themselves.\"*\n\nUpon completion, knock the teeth three times, swallow qi three times, and ensure the teeth and qi resonate in unison. Recite this thrice, then drink as much as desired until sated. After this morning ingestion, when hungry, take water and recite the incantation before drinking. Regardless of time, ingesting thrice daily will prevent hunger.\n\nInitially, water ingestion for several tens of days may cause extreme emaciation, dizziness, and weakness in the legs. After this period, gradual improvement occurs. If combined with medicinal substances, one may avoid such depletion. Avoid excessive speech and laughter, as careless movement dissipates essence and qi—these are to be avoided.\n\n**On the Ingestion of Medicinal Substances**\nThe five viscera circulate the qi of construction and defense, while the six bowels rely on the flavors of water and grain. Now, having ingested qi, the viscera’s qi becomes surplus; having ceased grain, the bowels’ flavors become deficient. The *Suwen* states: *\"If grain is not consumed for half a day, qi declines; if for a full day, qi diminishes.\"* Thus, various medicinal substances must substitute for grain, ensuring qi reaches both viscera and bowels to preserve wholeness.\n\nThe clear yang is heaven; the turbid yin is earth.\nThe clear yang emerges from the upper orifices; the turbid yin emerges from the lower orifices.\nThe clear yang activates the interstices; the turbid yin courses through the five viscera.\nThe clear yang fills the four limbs; the turbid yin returns to the six bowels.\nThe clear yang is qi; the turbid yin is flavor.\nFlavor returns to form; form returns to qi; qi returns to essence.\nEssence feeds on qi; form feeds on flavor.\nQi is yang; flavor is yin.\nWhen yin prevails, yang ails; when yang prevails, yin ails.\nThus, yin is for unobstructing, and flavor is for replenishing.\nUnobstructing prevents exhaustion; replenishing prevents emaciation.\n\nNow, with herbs and woods, their natures and flavors suit the viscera and bowels. Thus, the *Anzang Pill* and *Liqi Paste* are prepared. For those previously free of illness, with harmonious viscera and bowels, these pills and pastes may be taken regularly, along with single-ingredient medicines such as poria and sesame. If the viscera are afflicted, adjust the ingredients accordingly. For preexisting phlegm disorders or other ailments, seek separate medical treatment—these are not cured by this method. The Shangqing formulas and medicines should be followed as per their original texts, and those who receive them should adhere to their prescribed ingestion.\n\n**Formula for the Harmonizing and Peaceful Viscera Pill**\n- Poria (2 liang)\n- Cinnamon bark (2 liang)\n- Prepared licorice (2 liang)\n- Ginseng (2 liang)\n- Arborvitae seed (2 liang)\n- Dioscorea (2 liang)\n- Ophiopogon (2 liang)\n- Asparagus (4 liang)\n\nGrind into powder, mix with white honey, and form into pills the size of firmiana seeds. Ingest thirty pills twice daily, taken with medicinal beverages such as pine needles or lycium.\n\n**Formula for the Qi-Moistening and Fluid-Regulating Paste**\n- Asparagus (5 sheng)\n- Solomon’s seal (5 sheng)\n- Rehmannia (5 sheng)\n- Atractylodes (5 sheng)\n\nBoil the above, then combine evenly with:\n- Poria (2 liang)\n- Cinnamon bark (3 liang)\n- Prepared licorice (3 liang)\n- Dioscorea (5 liang)\n- Alisma (5 liang)\n\nGrind all into fine powder using fine silk, add to the decoction, then incorporate:\n- Prepared sesame (3 sheng)\n- Apricot kernel powder (3 sheng)\n- White honey (2 sheng)\n\nStir continuously over a double boiler until it forms a thick paste. Cool, pound several thousand times, and store in a sealed vessel. Remove a small portion to form pills. Each morning, take one pill the size of a plum pit, hold it in the mouth, and swallow gradually, two to three times daily. This medicine is best prepared in the eighth or ninth month and ingested from the third month onward. If reheated and thickened in the second or third month, it will not spoil through summer.\n\n**Formula for Expelling Yin Phlegm and Rheum**\n- Raw licorice (2 liang)\n- Poria (2 liang)\n\nBoil strong tea (5–6 sheng) and decoct the above ingredients to yield 6 sheng. Strain, then ingest 3 sheng warm in one dose. Use an object to stimulate the throat to induce vomiting. After vomiting, ingest another 3 sheng warm, then vigorously induce vomiting again to expel phlegm and drool. Boil 3 sheng of plain tea, add a small amount of fresh ginger and tangerine peel, and sip warm. Lie supine, massage the chest and abdomen downward to the heart and belly, cover with warm clothing, and rest for a long while. Thereafter, avoid sour, salty, and other such foods.\n\n**Formula for Purging Yin and Eliminating Stagnation**\n- Rhubarb (2 liang)\n- White atractylodes (2 liang)\n- Red poria (2 liang)\n- Fresh ginger (2 liang)\n- Areca nut (3 pieces, peeled, sliced, soaked, and simmered)\n- Evodia (quantity not specified)\n- Prepared licorice (quantity not specified)\n- Prepared bitter orange peel (quantity not specified)\n\nGrind the simmered areca nut into powder separately.\n\nGrind the above ingredients, each weighing one liang, into coarse pieces. Boil in five sheng of water until reduced to two sheng. When the decoction is nearly done, add rhubarb and boil for one more bubbling. Strain out the dregs, divide into two portions, and take warm. Add half of the areca nut powder to the first dose. After the time it takes to walk five or six li, take the second dose. The treatment is deemed effective when three or four bouts of smooth purgation occur. If the first dose fails to induce bowel movement, add half a liang of refined mirabilite to the subsequent dose.\n\nAfterward, avoid raw, cold, hard, and slippery foods. Rest and recuperate for over ten days until fully recovered, then proceed to ingest qi-nourishing medicinals.\n\nFor all vomiting and purging therapies, the optimal time is between the third and fifteenth day of the lunar month, preferably on clear and mild days. Avoid such therapies on windy, rainy, or overcast days, as well as after the fifteenth day of the month.\n\n**On Caution and Prohibitions**\nThe nature of qi is such that it is difficult to secure once taken in but easily depleted when expelled. To preserve what is hard to retain, one must guard it diligently; to prevent what is prone to exhaustion, one must cherish it and avoid dissipation.\n\nThe Perfected One said: *\"Those who practice the Dao as if recalling their morning meal shall never fail to attain it. Those who cherish qi as they cherish the skin of their face shall never fail to preserve it whole.\"* He also said: *\"If one cherished qi as if it were the foremost priority of the body, I would seldom see them wither and emaciate.\"*\n\nIn matters of sexual intercourse, speech, and laughter, one must exercise restraint. In movement and vocalization, moderation and gentleness are essential. By being cautious in all such matters, one may avoid harm.\n\nHuman nature is such that the body aligns with Heaven and Earth, its yin-yang and sevenfold qi, skin and bones, marrow and viscera, constructive and defensive qi, breath and movement, all subject to the transformations of cold and heat—none of which do not correspond to the Two Modes and resonate with the Five Phases. Thus, when Heaven and Earth are in disharmony, yin and yang fall into chaos; when the viscera are imbalanced, the signs of the meridians manifest as illness.\n\nIllnesses arising from external causes originate from wind, while those stemming from internal factors are born of qi. As it is said: *\"When the mind is tranquil and the spirit serene, true qi resides within. When essence and spirit are guarded internally, whence can illness arise?\"* Truly, these words hold wisdom.\n\nOne must understand the nature of form and spirit, nurturing and preserving them; one must fear and be cautious of internal and external ailments.\n\n*The Plain Questions* states: *\"Heaven has its celestial markers, Earth its watercourses, and humans their meridians. When Heaven and Earth are harmonious, the watercourses remain calm. In cold, they freeze and congeal; in heat, they boil and overflow. When violent winds arise, the watercourses surge and ripple. If pernicious qi invades, it is like watercourses encountering wind. When the weather is warm and the sun bright, human blood and qi flow smoothly, and defensive qi rises. When the weather is cold and the sky overcast, human blood congeals, and defensive qi sinks. Blood and qi prefer warmth and detest cold; cold causes them to congeal and stagnate, while warmth encourages their movement and dispersal.\"*\n\nWhen the qi of the azure Heaven is clear and tranquil, the will is ordered, and yang qi is secure. Pernicious qi cannot take hold—this is the harmony born of timely accord.\n\nWhen the moon begins to wax, human blood and qi begin to flourish, and defensive qi begins to circulate. When the moon is full, blood and qi are abundant, and muscles are firm. When the moon wanes, muscles weaken, meridians empty, defensive qi departs, and only the form remains. Thus, one must regulate blood and qi in accordance with the seasons.\n\nIf one encounters pernicious qi at such times, the body’s emptiness meets Heaven’s emptiness, and the two voids resonate, penetrating to the bones and injuring the five viscera. Hence, the celestial taboos must not be ignored.\n\nThe Eight Cardinal Directions serve to observe the arrival of the eight winds and pernicious qi. One must avoid the pernicious qi of the Eight Cardinal Directions as one would evade an arrow’s flight—never allow oneself to be afflicted by them. For instance, in the month of the Winter Solstice, if wind comes from the south, it is a thieving wind that causes harm, for it arrives from the direction of pernicious emptiness and thus can sicken a person. Other seasons follow this principle.\n\nYang qi undergoes three transformations each day: at dawn, yang qi begins to rise; at noon, it reaches its peak; by dusk, it wanes, and the pores close. Thus, in the evening, one must withdraw and rest, avoiding strain on the sinews and bones, and exposure to mist and dew. To act contrary to these three periods is to invite bodily debility.\n\nProlonged use of the eyes injures the blood; prolonged exposure to the elements injures qi; prolonged standing injures the bones; prolonged walking injures the sinews; prolonged sitting injures the flesh—these are the Five Taxations.\n\nGrief, sorrow, and excessive thought injure the heart; cold body and cold drinks injure the lungs; anger and qi counterflow that rises without descending injure the liver; immoderate eating and fatigue injure the spleen; prolonged sitting on damp ground, overexertion, or entering water injure the kidneys.\n\nHumans possess five qi: joy, anger, sorrow, worry, and fear.\n- Anger causes qi to rise.\n- Joy causes qi to relax.\n- Sorrow causes qi to dissipate.\n- Fear causes qi to descend.\n- Cold causes qi to gather.\n- Heat causes qi to disperse.\n- Worry causes qi to scatter.\n- Fatigue causes qi to deplete.\n- Thought causes qi to bind.\n\nJoy and anger injure yin; cold and heat injure yang. When joy and anger are unchecked and cold and heat excessive, life is no longer secure.\n\nThe Five Flavors enter the following organs:\n- Bitter enters the heart.\n- Acrid enters the lungs.\n- Sour enters the liver.\n- Sweet enters the spleen.\n- Salty enters the kidneys.\n\nThe generation of yin originates in the Five Flavors. Thus:\n- Excessive sourness causes liver qi to overflow, and lung qi to expire.\n- Excessive saltiness causes bone qi to labor, shortens the breath, and breaks qi.\n- Excessive sweetness causes heart qi to pant and become full, the complexion to darken, and the kidneys to lose balance.\n- Excessive bitterness causes spleen qi to lose moisture, and stomach qi to thicken.\n- Excessive acridity causes sinews and vessels to slacken, and essence and spirit to perish.\n\nTherefore, by harmonizing the Five Flavors with care, bones become upright, sinews supple, qi and blood flow freely, interstices close tightly, and qi and bones become refined. By diligently following the Dao in accordance with its principles, one may long preserve the Mandate of Heaven.\n\nExcessive consumption of salt causes the vessels to congeal and the complexion to alter. Excessive consumption of bitter causes the skin to wither and hair to fall out. Excessive consumption of acridity causes the sinews to contract and the nails to wither.\n\nExcessive consumption of sour causes the flesh to thicken and chap, and the lips to curl back. Excessive consumption of sweet causes the bones to ache and the hair to fall out. These are the harms wrought by the Five Flavors.\n\nThis discourse concerns the Five Flavors in food and drink, yet medicinal properties also possess Five Flavors. When taking pills or powders, one must exercise particular caution.\n\nThose who practice qi absorption should avoid acrid flavors. Why? Because acridity disperses qi, and those with qi disorders must not consume it.\n\n**On the Five Viscera**\nWhen life takes form, it necessarily relies upon the Five Viscera. Though the body may become impaired, the viscera cannot be lacking. As for the nature of spirit, it necessarily derives from the Five Viscera. Though dispositions may differ, qi cannot be depleted.\n\nThus, heaven has Five Stars, whose advance and retreat weave its warp and weft; earth has Five Peaks, which in stillness secure its directions; qi has Five Phases, whose transformations broadly govern its domains; and humans have Five Viscera, which nurture and harbor their essence and spirit.\n\nTherefore:\n- The heart stores the spirit,\n- The lungs store qi,\n- The liver stores blood,\n- The spleen stores flesh,\n- The kidneys store the will.\n\nThe will and intent penetrate inward to connect with the bone marrow, thereby completing the bodily form.\n\nMoreover:\n- The heart is the root of life and the abode of the spirit;\n- The lungs are the root of qi and the abode of the corporeal soul;\n- The liver is the root of toil and exhaustion and the abode of the ethereal soul;\n- The spleen is the root of food and drink and the abode of nourishment;\n- The kidneys are the root of storage and sealing and the abode of essence.\n\nAs for the nine orifices’ functions, the four limbs’ movements, the firmness of bones and flesh, and the circulation of the meridians—none do not originate from the Five Viscera, branching forth into the hundred parts of the body. By harmonizing with cold and heat to prolong harmony and preserving essence and qi to enjoy longevity—\n\nThe heart governs all viscera. When the ruler is enlightened, functions flow smoothly. How can one who possesses a heart fail to comprehend the principles of its spirit?\n\nThe viscera have vital points that must not be overlooked:\n- The liver arises on the left,\n- The lungs arise on the right,\n- The heart governs the exterior,\n- The kidneys occupy the interior,\n- The spleen serves as their messenger,\n- The stomach serves as their marketplace.\n\nThe heart governs sweat, the lungs govern nasal mucus, the liver governs tears, the spleen governs drool, and the kidneys govern spittle—these are the Five Fluids.\n\nThe heart governs belching, the lungs govern coughing, the liver governs speech, the spleen governs laughter, and the kidneys govern sneezing.\n\nHeavenly qi communicates with the lungs, earthly qi with the liver, thunderous qi with the heart, grain qi with the spleen, and rain qi with the kidneys.\n\nEach of the Five Viscera has its corresponding union:\n- The heart unites with the vessels, its luster in the complexion;\n- The lungs unite with the skin, their luster in the body hair;\n- The liver unites with the sinews, its luster in the nails;\n- The spleen unites with the flesh, its luster in the lips;\n- The kidneys unite with the bones, their luster in the hair.\n\nEach of the Five Viscera has its associated bowel. The viscera pertain to yang, the bowels to yin.\n\nThe Five Viscera store essence and spirit without discharging them, thus they become full but cannot be replete. The Six Bowels receive water and grain without retaining them, thus they become replete yet can be full.\n\n- The small intestine is the bowel of the heart,\n- The large intestine is the bowel of the lungs,\n- The gallbladder is the bowel of the liver,\n- The stomach is the bowel of the spleen,\n- The bladder is the bowel of the kidneys.\n\nThe Six Bowels each have their correspondences:\n- The small intestine corresponds to the vessels,\n- The large intestine corresponds to the skin,\n- The gallbladder corresponds to the sinews,\n- The stomach corresponds to the flesh,\n- The Triple Burner and bladder correspond to the interstices and fine body hair.\n\nThe mutual employment of the Twelve Viscera:\n- The heart is the official of the monarch, from which spirit and brightness emanate;\n- The lungs are the official of the minister and mentor, from which governance and regulation emanate;\n- The liver is the official of the general, from which strategy and deliberation emanate;\n- The gallbladder is the official of central integrity, from which decision and judgment emanate;\n- The *danzhong* (chest center) is the official of the minister and envoy, from which joy and happiness emanate;\n- The chest is the gateway of the Upper Burner;\n- The spleen and stomach are the officials of granaries and storehouses, from which the Five Flavors emanate;\n- The large intestine is the official of transmission, from which transformation and change emanate;\n- The small intestine is the official of reception and containment, from which the transformation of substances emanates;\n- The kidneys are the officials of labor and strength, from which skill and ingenuity emanate;\n- The Triple Burner is the official of drainage and dredging, from which the waterways emanate;\n- The bladder is the official of prefectures and commanderies, which stores fluids; when qi transforms, they can be discharged.\n\nNone of these twelve officials may lose their mutual coordination. Thus, when the ruler is enlightened, those below are at peace. Cultivating life in this manner leads to longevity, and one will not perish throughout one’s allotted span. When the ruler is unenlightened, the twelve officials are endangered, the pathways of communication become obstructed and impassable, and the body suffers great harm. Cultivating life in this manner leads to peril.\n\n**On Treating Illness**\nThe efficacy of qi is vast and wondrous. Thus, when heavenly qi descends, cold and heat manifest the changes of the four seasons; when earthly qi ascends, wind and clouds display the variations of the eight directions. Combining the Two Modes (heaven and earth) into one body, they collectively govern the form and qi of the person.\n\nIf one can preserve this within the household, the spirit will be solemnly present; if one can wield it with mastery, its effects will be manifest.\n\nDirecting my mind, employing my qi, adapting to my body, and attacking my illness—where could one not be cured?\n\nThrough practiced absorption in leisure, it becomes easy to preserve. For all those suffering from pain or illness, one may press and treat them accordingly.\n\nWhenever one wishes to treat illness, one may do so after sunrise, when the weather is mild and calm. Face the sun, or if indoors, face toward the sun. Sit upright, close the eyes, clench the fists, and click the teeth nine times. Visualize the sun’s crimson radiance and purple rays, then draw a long breath and swallow it, directing it into the afflicted viscus or bowel. If the illness does not pertain to the viscera or bowels but rather to the limbs, sinews, or bones, one should first direct it into the governing viscus.\n\nHold the breath to its utmost, then draw another. After nine swallows, sense the qi within the viscus, then direct that qi to attack the afflicted area. Hold the breath to its utmost, exhale gently, and once the breath has settled, inhale again to attack. When the afflicted area feels warm and perspiration appears, this is optimal.\n\nIf the affliction lies in the four limbs and can be addressed through *daoyin*, first guide the qi to that area before attacking it. Even for afflictions in the upper body, pressing and kneading may be applied to facilitate the flow of qi.\n\nIf the affliction is in the head, let the hair down and comb the scalp several hundred times. Shake the head left and right dozens of times, then inhale deeply. Once the breath is held, grasp the crown of the head firmly with both hands and pull upward while resisting with the head. Simultaneously, visualize the qi ascending into the brain and bursting forth through the pores of the scalp. When the breath is held to its utmost, release the hands and exhale fully. Repeat this until sweat appears on the neck and the painful area feels eased and unconstrained.\n\nFor afflictions in the viscera or bowels, lie supine and inhale, directing the qi to the afflicted area. After five or six swallows, hold the breath once to attack the affliction, adjusting the method as needed.\n\nIf the illness is a long-standing *shan*-affliction or involves accumulations such as concretions, sores, or stagnations, it cannot be fully cured by qi alone, though some relief may be felt. Combining this with medicinal treatment poses no harm and may enhance efficacy.\n\nThough the qi may disperse through the skin when attacking the afflicted area, it is even better to identify the corresponding acupoint using the *Mingtang Tu* and visualize drawing the illness away.\n\nOnce the acupoint is known, apply the appropriate *lü*-pipe according to the month, pressing it firmly over the point while visualizing the expulsion of the illness. This ensures the mind has a focus and the qi flows to its proper destination.\n\nThe *lü*-pipes are as follows:\n- **Huangzhong** (eleventh month): pipe length nine *cun*, hollow, circumference nine *fen*;\n- **Dalü** (twelfth month): pipe length eight *cun*, hollow, circumference nine *fen*;\n- **Dacou** (first month): pipe length slightly over seven *cun*, hollow, circumference nine *fen*;\n- **Jiazhong** (second month): pipe length slightly over seven *cun*, hollow, circumference nine *fen*;\n- **Guxi** (third month): pipe length slightly over seven *cun*, hollow, circumference nine *fen*;\n- **Zhonglü** (fourth month): pipe length slightly over six *cun*, hollow, circumference nine *fen*;\n- **Ruibin** (fifth month): pipe length slightly over six *cun*, hollow, circumference nine *fen*;\n- **Linzhong** (sixth month): pipe length slightly over six *cun*, hollow, circumference nine *fen*;\n- **Yize** (seventh month): pipe length slightly over five *cun*, hollow, circumference nine *fen*;\n- **Nanlü** (eighth month): pipe length slightly over five *cun*, hollow, circumference nine *fen*;\n- **Wuyi** (ninth month): pipe length slightly over four *cun*, hollow, circumference nine *fen*;\n- **Yingzhong** (tenth month): pipe length slightly over four *cun*, hollow, circumference nine *fen*.\n\nAll pipes are made from bamboo grown on the sunny side of mountains, with round hollows and no branches at the nodes.\n\nIf the hands or arms cannot be raised, the method may still be applied to any afflicted area on the limbs. First, gently massage the afflicted area with one hand for a long while. Then, close the eyes and visualize the five viscera. Swallow saliva three times, click the teeth three times, compose the mind, and softly recite the incantation:\n\n*\"Supreme Four Mysteries, Five Flowers, Six Courts,\nThree Hun, Seven Po, Heaven’s Gate, Earth’s Essence,\nDivine Talismans, Radiant Guardians,\nHeavenly Embryo, Illuminated Above,\nFour Limbs, Hundred Spirits, Nine Joints, Myriad Numina,\nEnrolled in Jade Dawn, Inscribed in Jade City,\nJade Youths Guard Life, Jade Maidens Attend the Body,\nForever Aligned with the Two Luminaries,\nAscending as Immortals to the Upper Clarity,\nAgeless as Sun and Moon,\nTranscending to Join the Great Peace.\nFlowing winds bind stagnations, pestilent ghosts take flight,\nSpecters and tomb-haunters contend,\nDual qi intertwine,\nAssailing my four limbs,\nEncroaching on my flourishing and decline.\nCelestial Soldiers of Mount Tai, Dragon and Tiger display might,\nSlay inauspicious ghosts,\nCrush wind and malevolence,\nExamine hidden litigations,\nConcealed poisons and wrongs,\nRestore me to constancy,\nSharing radiance with Sun and Moon.\nIf I am beset, the Northern Asterism shall seize and destroy,\nUpholding the majesty of the Illuminated Above.\"*\n\nOnce finished, at the time when *shengqi* (vital qi) arises, swallow saliva fourteen times and press the painful area while facing the ruler and reciting:\n\n*\"Left Mystery, Right Mystery, the Two Spirits unite in perfection,\nLeft Yellow, Right Yellow, the Six Flowers align.\nWind and malevolent qi,\nLurk in the four directions.\nJade fluid flows in grace,\nAbove and below, all is harmonized.\nInternally dispatch Water and Fire,\nExternally repel inauspiciousness,\nAttain long life and flight as an immortal,\nThe body ever strong and at ease.\"*\n\nAfter reciting, swallow saliva fourteen times again and press the painful area thirty-one times in quick succession. Practicing this regularly will prevent illness.\n\n*On the Essentials of Treating Illness*\n\nHeaven endows life as *ming* (destiny), which relies upon form and spirit; the harmony of *qi* originates in the viscera and bowels. When form and spirit remain steadfast and unyielding, life is preserved whole and longevity unfolds as one, ever aligned with the pristine and tranquil—*qi* then flourishes in peace, and illness finds no foothold.\n\nYet when examining the inception of the two essences and their nourishment of the countenance, each varies with the four seasons; the foundation of embodied form and established nature seldom adheres perfectly to the rhythms of the Five Constants. Thus, restlessness and distraction multiply, cravings and indulgences accumulate, and illness may take root at the very moment of conception or arise at the dawn of bodily existence.\n\nTherefore, joy, anger, and anxiety—arising from within—give rise to illness; cold, heat, drink, and food—encountered from without—beget disease. As years advance and vigor wanes, one persists in reckless transgressions; the decline of yin and yang becomes intertwined, form and *qi* fall into discord, and manifold afflictions emerge, their signs manifold and varied.\n\nMoreover, for those who practice *qi*-absorption, once grains and meats are forsaken, the body gradually weakens, essence and *qi* remain incomplete, and spirit and soul do not flow freely. Old ailments may thus stir anew, while new afflictions arise from vacuous pathogenic influences. One must discern their origins and carefully attend to their treatment.\n\nHere, I roughly outline the discernible symptoms to guide inquiry with physicians, for the art of *qi*-attack differs from that of medicinal substances. How do the forms of vacuity and repletion arise? When *qi* and blood intermingle, yin and yang incline toward imbalance: *qi* disorders the defensive, blood flows through the channels, and blood and *qi* part ways, one becoming replete, the other vacuous.\n\nWhen blood merges with yin and *qi* with yang, it gives rise to fright and mania; when blood merges with yang and *qi* with yin, it results in *gen zhong* (internal obstruction). When blood merges above and *qi* below, the heart is vexed and prone to anger; when blood merges below and *qi* above, confusion and forgetfulness ensue.\n\nYang vacuity produces external cold, yin vacuity internal heat; yang exuberance yields internal cold, yin exuberance external heat. The pathways of the Five Viscera all emerge from the channels and network vessels, circulating blood and *qi*. When blood and *qi* fall into disharmony, the hundred diseases transform and arise.\n\nWhen *qi* is in excess, abdominal distension and undigested diarrhea follow; the pernicious *qi* of untimely celestial influences, when contracted, harms the Five Viscera. The cold and warmth of water and grains, when affected, harm the Six Bowels. The damp *qi* of earth, when contracted, harms the skin, flesh, sinews, and vessels.\n\nFurthermore, the origin of pathogenic influences may arise from yin or yang. Those born of yang are contracted from wind, rain, cold, and summerheat; those born of yin are contracted from drink and food, dwelling places, the interplay of yin and yang, and joy and anger.\n\nYang pertains to the *qi* of Heaven and governs the exterior; yin pertains to the *qi* of Earth and governs the interior. The Way of yang is repletion, the Way of yin is vacuity. Thus, when one is assailed by thieving wind or vacuous pathogenic influences, yang receives them. Immoderate drink and food, or untimely rising and resting, are received by yin. When yang receives them, they enter the Six Bowels, causing untimely fever and restlessness, with panting and gasping above. When yin receives them, they enter the Five Viscera, leading to fullness, blockage, and closure, with undigested diarrhea below, and over time, intestinal aggregation.\n\nWhen the throat governs the *qi* of Heaven and the pharynx governs the *qi* of Earth, the intestines receive wind-*qi*, while yin receives damp-*qi*. Thus, yin *qi* ascends from the feet to the head, then descends along the arms to the fingertips; yang *qi* ascends from the hands to the head, then descends to the feet.\n\nTherefore, it is said: In yang diseases, ascent reaches its limit before descent begins; in yin diseases, descent reaches its limit before ascent begins. Those harmed by wind are first affected above; those harmed by damp are first affected below.\n\nThe head is the palace of essence and clarity; when the head droops and the gaze sinks deep, essence is about to be lost. The back is the palace of the chest; when the back is hunched and the shoulders slump, the chest is about to fail. The waist is the palace of the kidneys; when one cannot turn or sway, the kidneys are about to weaken. The knees are the palace of the sinews; when one cannot bend or stretch, and walks with a limp, leaning on support, the sinews are about to weaken. The bones are the palace of marrow; when one cannot stand for long, and walking causes trembling, the bones are about to weaken.\n\nIn lung heat disease, the right cheek reddens; in heart heat disease, the forehead reddens first; in liver heat disease, the left cheek reddens; in spleen heat disease, the nose reddens; in kidney heat disease, the chin reddens. Though the disease has yet to manifest, upon seeing its color, one should treat it. Thus it is said: Treat the disease before it arises.\n\nIn lung heat disease, the complexion is white and the body hair withers; in heart heat disease, the complexion is red and the network vessels overflow; in liver heat disease, the complexion is green-blue and the nails wither; in spleen heat disease, the complexion is yellow and the flesh twitches; in kidney heat disease, the complexion is black and the teeth wither.\n\nThe liver governs spring, with the foot *jueyin* and *shaoyang* channels presiding over treatment; its days are *jia* and *yi*. The liver suffers from tension, so one should hastily consume sweet flavors to relax it. It is also said: In liver disease, one desires dispersion, so hastily consume acrid flavors to disperse it; use acrid to supplement and sour to drain. Avoid facing the wind, for the liver loathes wind.\n\nThe heart governs summer, with the hand *shaoyin* and *taiyang* channels presiding over treatment; its days are *bing* and *ding*. The heart suffers from slackness, so one should hastily consume sour flavors to astringe it. It is also said: In heart disease, one desires oppressiveness, so hastily consume salty flavors to oppress it; use salty to supplement and sweet to drain. Avoid warm clothing and hot food, for the heart loathes heat.\n\nThe spleen governs late summer, with the foot *taiyin* and *yangming* channels presiding over treatment; its days are *wu* and *ji*. The spleen suffers from dampness, so one should hastily consume bitter flavors to dry it. It is also said: In spleen disease, one desires relaxation, so hastily consume sweet flavors to relax it; use sweet to supplement and bitter to drain. Avoid warm food, overindulgence, damp ground, and damp clothing, for the spleen loathes dampness.\n\nThe lung governs autumn, with the hand *taiyin* and *yangming* channels presiding over treatment; its days are *geng* and *xin*. The lung suffers from counterflow ascent of *qi*, so one should hastily consume bitter flavors to drain it. It is also said: In lung disease, one desires astringency, so hastily consume sour flavors to astringe it; use sour to supplement and acrid to drain. Avoid cold clothing and cold food, for the lung loathes cold.\n\nThe kidney governs winter, with the foot *shaoyin* and *taiyang* channels presiding over treatment; its days are *ren* and *gui*. The kidney suffers from dryness, so one should hastily consume acrid flavors to moisten it, opening the interstices to facilitate the flow of fluids and *qi*. It is also said: In kidney disease, one desires firmness, so hastily consume bitter flavors to firm it; use bitter to supplement and salty to drain. Keep warm suddenly, avoid hot food and warm clothing, for the kidney loathes dryness.\n\nAcrid flavors course *qi*, so in *qi* disease, avoid acrid;\nBitter flavors course bone, so in bone disease, avoid bitter;\nSweet flavors course flesh, so in flesh disease, avoid sweet;\nSalty flavors course blood, so in blood disease, avoid salty;\nSour flavors course sinews, so in sinew disease, avoid sour.\nThese are called the five prohibitions—do not consume them in excess.\n\nIn lung disease: panting, coughing, counterflow *qi*, pain in the shoulders and back, sweating, *shiyin*, pain in the thighs, knees, calves, and instep;\nIn deficiency: shortness of breath, inability to serve, deafness, and dry throat.\n\nIn heart disease: pain in the chest, fullness in the flanks and ribs, pain below the ribs, pain in the chest, back, shoulders, and scapulae, pain in the inner arms;\nIn deficiency: fullness in the chest and abdomen, pain drawing from the flanks to the waist.\n\nIn liver disease: pain below the flanks drawing to the lower abdomen, causing one to be prone to anger;\nIn deficiency: fear as if someone were about to seize them;\nIn counterflow *qi*: headache, deafness, and swollen cheeks.\n\nIn spleen disease: heaviness of the body, atrophy of the muscles, feet failing to lift, frequent cramps, pain in the soles;\nIn deficiency: abdominal fullness, borborygmus, sloppy diarrhea, and undigested food.\n\nIn kidney disease: abdominal distension, swollen shins, panting, coughing, heaviness of the body, night sweats, and aversion to wind;\nIn deficiency: pain in the chest.\n\nSymptoms of lung wind: profuse sweating, aversion to wind, frequent coughing, shortness of breath, improvement during the day but worsening at dusk. The diagnosis lies above the eyebrows, and its color is white.\n\nSymptoms of heart wind: profuse sweating, aversion to wind, parched lips, and frequent anger. The diagnosis lies in the mouth, and its color is red.\n\nSymptoms of liver wind: profuse sweating, aversion to wind, tendency to sorrow, slight pallor, dry throat, and frequent anger. The diagnosis lies below the eyes, and its color is blue-green.\n\nSymptoms of spleen wind: profuse sweating, aversion to wind, lethargy of the body, reluctance to move the limbs, slight yellowing, and loss of appetite. The diagnosis lies above the nose, and its color is yellow.\n\nSymptoms of kidney wind: profuse sweating, aversion to wind, swollen face, back pain, inability to stand upright, dark complexion, and difficulty with private matters. The diagnosis lies on the cheeks, and its color is black.\n\nSymptoms of stomach wind: profuse sweating in the neck, aversion to wind, inability to swallow food and drink, blockage and obstruction, frequent abdominal fullness, distension when clothing is removed, and diarrhea when cold food is consumed. The diagnosis lies in the body—emaciated with a swollen abdomen.\n\nSymptoms of head wind: profuse sweating on the head and face, aversion to wind; if exposed to wind for a day, illness ensues, with severe headache making it unbearable to go outside. If exposed to wind again on the following day, the illness slightly improves.\n\n*Essential Discourses on Cultivating Perfection: Miscellaneous Treatises* concludes.\n\n*(Annotations indicate textual variants and do not form part of the translation.)*\n\n---\n\nSymptoms of wind in the five viscera: When wind enters the five viscera, the body becomes emaciated, the complexion withers, and the hair falls out. The diagnosis lies in the face—its color is black, and the lips are parched.\n\nSymptoms of wind in the heart: The heart governs the blood vessels. When wind enters the heart, the blood vessels become obstructed, the face turns red, the body feels hot, and there is aversion to fire. Even when drinking cold water, the heat does not dissipate; when lying down, one cannot sleep. The diagnosis lies in the tongue—its color is red, and the tip is curled.\n\nSymptoms of wind in the liver: The liver governs the sinews. When wind enters the liver, the sinews contract, the limbs become stiff, and one cannot bend or extend them. The diagnosis lies in the nails—they turn green and wither.\n\nSymptoms of wind in the spleen: The spleen governs the flesh. When wind enters the spleen, the flesh trembles, the limbs feel heavy, and one cannot walk steadily. The diagnosis lies in the lips—they turn yellow and sag.\n\nSymptoms of wind in the lungs: The lungs govern the skin. When wind enters the lungs, the skin becomes rough, the body hair falls out, and there is aversion to cold. Even when wearing thick clothing, the cold does not dissipate; when lying down, one cannot rest. The diagnosis lies in the body hair—it stands on end and withers.\n\nSymptoms of wind in the kidneys: The kidneys govern the bones. When wind enters the kidneys, the bones become heavy, the lower back and spine ache, and one cannot stand for long. The diagnosis lies in the teeth—they turn black and decay.\n\nThe *Way* of wind is such that it follows the *qi* and transforms. Though its symptoms vary, the method of treatment remains consistent: one must first regulate the *qi* and blood, then expel the wind and harmonize the viscera. If the *qi* is harmonized and the blood is balanced, the wind will naturally disperse. If one merely seeks to drive it away, it will only linger and recur. Thus, the superior physician treats before illness arises, the mediocre physician treats as illness emerges, and the inferior physician treats after illness has taken hold. Those who understand the *Way* of wind will know how to prevent it.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "修真精义杂论 经名：修真精义杂论。 唐·司马承祯撰。 一卷。 底本出处：《正统道藏》洞真部众街类。 参校版本：《云笈七签》，收入该书卷五十七。 修真精义杂论 天台白云子述 导引论 夫肢体关节，本资於动用。 经脉荣卫，在於宣通。 今既闲居，乃无运役事，须导引以致和畅。 户枢不蠹，其义信然。 人之血气精神者，所以养生而周其性命也。 脉经者，所以行血气也。 故荣气者，所以通津血、益筋骨、利关隔也； 卫气者，所以温肌肉、充皮肤、肥胜理、司开闱也。 又浮气之修於经者，为卫气； 其精气之行於经者，为荣气。 阴阳相随，内外相贯，如环之无端也。 又头者，精明之府； 背者。 胸之府； 腰者，肾之府； 膝者，筋之府； 髓者，骨之府。 而又诸骨皆属於目，诸髓皆属於脑，诸筋皆属於节，诸血皆属於心，诸气皆属於肺，此四肢八环之朝夕也。 是知五劳之损，动静所久。 五禽之导，摇动其关，然人之形体，上下相承，气之源流，升降有叔。 尝见诸导引文，多无次第。 今所法者，实有宗旨。 其五体平和者，依常数为之； 若一处有所偏疾者，则於其处加数用力行之。 凡导引，当以丑后卯前天气清和时为之。 先解发，散梳四际，上达顶，三百六十五过，散发於后，或宽作髻亦得。 烧香，面向束，平坐握固，闭目思神，叩齿三百六十五过，乃纵体平气，依次为之。 先闭气，以两手五指交叉，反掌向前，极引臂，拒托之良久，即举手，反掌向上极臂，即低左手，力举右肘，令左肘臂按着后项，左手向下力牵之，仍亚向左，开右腋努胁为之，低右举左亦如之，即低手钩项，举两肘，偃胸，仰头向后，令头与手前后竞力为之，即低手钩项，摆肘捩身，向左向右，即放手两膝上，微吐气通息，又从初为之三度。 次覆伸左手，仰掌坚指，屈右手，举肘仰掌坚指，开臂胸膊如挽弓之势，仍回头向左，使头项、胸臆、臂肘等，用力为之，左右各三度。 次两手作拳，拿臂向前筑，即努肘向后，蹙急做势，用力为之，前后各三度。 次以左手拳向左之后力摆臂三，又向下摆臂三，右如之。 次交两臂於胸前，各以手指攀两肩，仰头偃胸，努腹腰为之，即低头曲腰，耸肩，两手向下，用力攀之，一仰一低，各三度。 次屈两手腕安腋下，促两肘向前，低头努背为之，即仰头努胸臆，促两肘，向后为之，前后各三度。 次帖膝坐，以两手托腰向前，偃身向后，竞力为之。 仍摇动其身，即平坐纵缓，又为之三度。 次交经平坐，左手托左边，肺稍近身，后回腕向外指裹，以右手攀左膝，回头向左仰视，其后努左右臂膊，用力为之，左右各三度。 次坚两膝交两经，以两手交指反掌，向外抱膝，仍低头努腰背，开膝以砾，而臂极膝。 讫即回手掌向裹，急抱膝，耸身仰面，申咽臆，力向后为之，一仰一低各三度。 次交经平坐，从膝向裹申经出外，以手捉脚指，耸肩，向上用力攀，仍努腰腹向前，左右摇之，气极放宽，又为之三度。 次以左手攀左脚指至脚心，脚指至手腕，渐长舒脚，仍举踵向上，却将右手托右膝上，仍转头向左右竞力为鸟之，即屈左脚，以两手共捧其跟，向上高举之即放下，以左手按膝，右手攀脚，左手向下极按，右手回向上极攀之，回头向右之后，努肩膊为之，左右三度。",
      "translated_text": "**Essential Miscellaneous Discourses on Cultivating Perfection**\n*Title:* *Essential Miscellaneous Discourses on Cultivating Perfection*\n*Author:* Sima Chengzhen of the Tang Dynasty\n*Volume:* One\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Zhongjie* Category\n*Collated Edition:* *Seven Lots from the Cloudy Satchel*, included in Volume 57\n\n**Essential Miscellaneous Discourses on Cultivating Perfection**\n*Recorded by the Master of White Clouds of Tiantai*\n\n### **On Daoist Breathing and Physical Exercises**\nThe limbs and joints fundamentally rely on movement for their function, while the meridians and *qi* of *ying* and *wei* depend on free circulation. Now, in seclusion with no laborious tasks, one must practice *daoyin* to achieve harmony and smoothness. The principle that \"the door hinge does not rot\" is indeed true.\n\nThe blood, *qi*, essence, and spirit of humans serve to nourish life and sustain destiny. The meridians conduct blood and *qi*. Thus, *ying-qi* circulates fluids, strengthens sinews and bones, and benefits the joints and diaphragm; *wei-qi* warms the muscles, fills the skin, nourishes the interstices, and governs opening and closing. Moreover, the floating *qi* that courses through the meridians is *wei-qi*, while the refined *qi* that flows within them is *ying-qi*. Yin and yang follow one another, interior and exterior interconnect, like a ring without end.\n\nThe head is the mansion of essence and clarity;\nThe back is the mansion of the chest;\nThe waist is the mansion of the kidneys;\nThe knees are the mansion of the sinews;\nThe marrow is the mansion of the bones.\nFurthermore, all bones pertain to the eyes, all marrow to the brain, all sinews to the joints, all blood to the heart, and all *qi* to the lungs—this is the daily cycle of the four limbs and eight joints.\n\nThus, the five labors cause harm through prolonged stillness or motion. The *daoyin* of the Five Animals stirs the joints, yet the human body’s upper and lower parts support one another, and the *qi*’s source and flow ascend and descend in order. I have observed that many *daoyin* texts lack sequence, but the method I transmit here has a clear principle.\n\nFor those whose five bodily parts are balanced, follow the standard count. If one area suffers from imbalance or illness, increase the repetitions and apply force there.\n\nGenerally, *daoyin* should be practiced between the *chou* (1–3 a.m.) and *mao* (5–7 a.m.) hours, when the *qi* of heaven is clear and harmonious. First, loosen the hair and comb it thoroughly, reaching the crown 365 times. Let the hair hang loose behind, or loosely tie it into a topknot. Burn incense, face east, sit upright with hands clenched, close the eyes to visualize the spirit, and click the teeth 365 times. Then relax the body, regulate the breath, and proceed in order.\n\nFirst, hold the breath. Interlace the fingers, turn the palms outward, and extend the arms fully, pushing forward for a long while. Then raise the hands, turn the palms upward, and stretch the arms fully. Lower the left hand and forcefully raise the right elbow, pressing the left elbow and arm against the back of the neck while the left hand pulls downward with force. Lean slightly left, open the right armpit, and strain the ribs. Repeat the same on the right side. Then lower the hands to hook the neck, raise both elbows, arch the chest, and tilt the head back, competing the strength of head and hands forward and backward. Next, lower the hands to hook the neck, swing the elbows, and twist the body left and right. Then rest the hands on the knees, exhale slightly to regulate the breath, and repeat the sequence three times.\n\nNext, extend the left hand with palm up and fingers upright, bend the right hand, raise the elbow with palm up and fingers upright, and open the arms and chest as if drawing a bow. Turn the head to the left, applying force to the neck, chest, bosom, arms, and elbows. Repeat three times on each side.\n\nNext, make fists with both hands, thrust the arms forward forcefully, then strain the elbows backward, contracting tightly with effort. Repeat three times forward and backward.\n\nNext, swing the left fist backward with force three times, then downward three times. Repeat with the right.\n\nNext, cross the arms before the chest, grasp the shoulders with the fingers, tilt the head back, arch the chest, and strain the abdomen and waist. Then lower the head, bend the waist, hunch the shoulders, and pull downward with force. Alternate lifting and lowering three times each.\n\nNext, place the wrists beneath the armpits, press the elbows forward, lower the head, and strain the back. Then tilt the head back, strain the chest and bosom, and press the elbows backward. Repeat three times forward and backward.\n\nNext, sit with knees bent, place both hands on the waist, and lean the body backward with force. Shake the body, then sit upright and relax. Repeat three times.\n\nNext, cross the legs and sit. Place the left hand near the body to support the left side, turn the wrist outward with fingers pointing inward, and grasp the left knee with the right hand. Turn the head left, look upward, and strain both arms with force. Repeat three times on each side.\n\nNext, straighten the knees and cross the legs. Interlace the fingers, turn the palms outward, and embrace the knees. Lower the head, strain the waist and back, and open the knees to press them with the arms. Then turn the palms inward, grasp the knees tightly, raise the body, tilt the face upward, stretch the throat and bosom, and apply force backward. Alternate lifting and lowering three times each.\n\nNext, cross the legs and sit. From the knees, extend the legs outward, grasp the toes with the hands, hunch the shoulders, and pull upward with force. Strain the waist and abdomen forward, sway left and right, and when the breath is exhausted, relax. Repeat three times.\n\nNext, grasp the left toes with the left hand, reaching the sole, and the toes with the wrist. Gradually extend the leg, then raise the heel. Place the right hand on the right knee, turn the head left and right, and compete the strength like a bird. Then bend the left leg, cradle the heel with both hands, and raise it high before lowering it. Press the knee with the left hand, grasp the foot with the right, press downward with the left hand, and pull upward with the right. Turn the head to the right rear and strain the shoulders. Repeat three times on each side.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1277,
      "start_sentence": 0,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.529372930526733,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "次长舒两脚，偃身向后，反手托肺，屈右脚，向前作势掣踏之，左右三度。 次舒右脚，屈左脚，以踵加右脾上，垂左膝向下，令至将，即舒左屈右为之，左右各三度。 次偃身，反托状，坚左膝，促敛其踵至臀边，举右踵钩取左膝，渐向下按之，令左膝头至林，左右各三度。 次屈左脚向外，以左手下攀脚腕，右手托右膝，回头向右，低左膝着林，以脚向外展，以手向内攀，竞力为之，左右各三度。 次开两膝，合两脚踵，以两手攀脚掌，仰头何上力举之，气极纵体，为之三度。 次舒脚，以两手交指钩曲鳅中，偃身向后力钩之，仍渐高举脚，努经偃指，左右各三度。 次长舒两脚，令并坚指，以两手各攀其指，举头用力，为之三度。 导引毕，平坐纵体，摩两手掌令温，乘额向上三九过。 摩掌后拭目三九过，即以两手中指、无名指按鼻左右上下二七过，摩之。 以食指、中指叉耳向上耸之三五过，便以虎口叉耳，向后修旋耳轮三五过。 摩掌令热，摩拭面上，令温温然，摩颈项、胸臆、两乳数十过，即摩持臂上，至肩下，至手背，上下数十过，即两手互相摄捩回转之，如洗手状，急用力为之数十过，即摩按心腹腰牌等处都毕，待气息调，平坐，服气如法。 其摩掌乘额，拭面目等，寻常数数为之，弥佳。 不唯在服气之时，其诸导引亦不可总为诸法，恐烦劳，任逐便为之。 然终须从首至足，令相承，取通也。 亦可隔三五日一度，具导引之。 又有立卧等法，不能多述，亦各任意为之。 符水论 夫符文者，云篆明章，神灵之书字也。 点画有所象，故神气存焉； 文字有所生，故服用朱焉。 夫水者，元气之津，潜阳之润也，有形之类莫不资焉。 故水为气母，水洁财气清。 气为形本，气和则形泰。 虽身之荣卫，自有内液，而腹之脏腑，亦假外滋。 既可以通腹胃，益津气，又可以导符灵，助祝卫，今撰诸符水之法，以备所用，可按而为之焉。 右符每以向月建，以满日烧香，丹书纸，左手持水器，右手持符，可以水一升吞之，多少任意，如得井华水为良，纵是泉水亦可，旦取之。 祝曰： 金木水火土，五星之气，六甲之精，三真天食，浊气常盈，黄父赤子，守中无倾，三祝之，皆一气。 毕，三叩齿，三琢齿。 以所执符噀水。 仍於水上烧符，灰纳水中。 勿令散也。 北向再拜，服之。 已后条件各别，是一法也。 前符每以甲子日丹书八枚，至满日，平旦取井华水，以日出时再拜，自称云：请服符章，愿令神气充满。 服二枚，次於平定、执日亦各服二枚。 五甲，亦可更书服之耳。 右六甲阴阳符，各随其日支干书内方中也。 阳符下有甲子，阴符下有乙丑字。 此举甲子、乙丑为例耳。 丙寅、丁卯等日，各以其日支干书之，皆不悟此理，即其文曰：各随其支干书方中，亦由六神都匠回符，中书其日干书也，仍以朱书阳符，黑书阴符，亦可预书一旬之符，至其旦取服之。 每平旦东向烧香，左手持符，右手持水器。 取井华水，任服多少。 祝曰：真人某乙好乐真道，服食中和之气，甲子太玄玉女承翼，竟一旬同呼此，他甲放此，给侍某甲行厨所在，当得无令饥渴。 本文兼云：丹无大小，人无多少，皆当得饱，今即自服，故不用此言。 又或日不可减损，祝词则日日无早晚，身无画夜，皆得饱。",
      "translated_text": "Next, extend both legs fully, lie supine, and support the back with the hands reversed. Bend the right leg and thrust forward with force as if treading, three times on each side.\n\nThen extend the right leg, bend the left leg, and place the left heel upon the right calf. Let the left knee hang downward until nearly touching, then alternate by extending the left and bending the right, three times on each side.\n\nNext, lie supine and reverse the hands to support the back. Raise the left knee, drawing the heel close to the buttocks. Lift the right heel to hook the left knee, then gradually press downward until the left knee nearly touches the ground, three times on each side.\n\nThen bend the left leg outward, grasp the left ankle with the left hand, and support the right knee with the right hand. Turn the head to the right, lower the left knee to nearly touch the ground, extend the foot outward, and pull inward with the hand, straining with force, three times on each side.\n\nNext, spread the knees apart and bring the heels together. Grasp the soles of the feet with both hands, tilt the head back, and lift with all one’s strength. When the breath is exhausted, relax the body, repeating three times.\n\nThen extend the legs and interlock the fingers to hook the insteps. Lie supine and pull backward with force, gradually raising the legs high. Strain the sinews and press the toes, three times on each side.\n\nNext, extend both legs fully, keeping the toes upright. Grasp the toes with both hands, lift the head, and exert force, repeating three times.\n\nThe Daoist exercises complete, sit upright and relax the body. Rub the palms together until warm, then raise them to the forehead, passing upward twenty-seven times.\n\nAfter rubbing the palms, wipe the eyes twenty-seven times. Then press the nose with the middle and ring fingers of both hands, moving up and down fourteen times. Interlace the index and middle fingers to lift the ears upward three to five times, then hook the ears with the tiger’s mouth and rotate the earlobes backward three to five times.\n\nRub the palms until hot, then wipe the face until it feels warm. Massage the neck, chest, and breasts several dozen times. Then massage the arms from the shoulders down to the backs of the hands, moving up and down several dozen times. Interlock the hands and twist them back and forth as if washing, exerting force several dozen times. Finally, massage and press the heart, abdomen, waist, and spleen until finished. Wait until the breath is regulated, then sit calmly and ingest qi according to the method.\n\nThe palm-rubbing, forehead-raising, and face-wiping should be done frequently for the best results. These are not limited to times of qi ingestion. The various Daoist exercises need not all be performed at once to avoid fatigue; do as is convenient. However, they should ultimately proceed from head to foot in sequence to ensure thorough circulation. They may also be done once every three to five days in full. There are also standing and reclining methods, which cannot all be described here; do as one sees fit.\n\n---\n\n**On Talismanic Water**\n\nTalismanic script consists of cloud-seal characters, luminous and divine writing. Its strokes bear resemblance, thus divine qi resides within; its characters have origins, thus cinnabar is used in their application. Water is the essence of primordial qi, the moisture of latent yang, upon which all things with form depend. Thus, water is the mother of qi, and when water is pure, qi is clear. Qi is the root of form, and when qi is harmonious, the body is at peace. Though the body’s constructive and defensive energies have their own internal fluids, the viscera and bowels of the abdomen also rely on external nourishment. Water can unblock the stomach and intestines, replenish fluids and qi, and guide the efficacy of talismans to assist incantations and defenses. Here, I compile methods for talismanic water to prepare for use; one may follow them accordingly.\n\nFor the above talisman, face the monthly branch on a full moon day, burn incense, and write in cinnabar on paper. Hold the water vessel in the left hand and the talisman in the right. Use one *sheng* of water to swallow it, or more or less as desired. Well-flower water is best, though spring water will suffice; take it at dawn. Recite the incantation:\n\n*\"Metal, Wood, Water, Fire, Earth—the qi of the Five Stars, the essence of the Six Jia. The three true celestial foods, ever filling the turbid qi. Yellow Father and Red Child, guard the center without deviation.\"*\n\nRecite this three times, all in one breath. Then knock the teeth three times, click the teeth three times, and spray the water with the talisman held in the mouth. Burn the talisman over the water and place the ashes into it, ensuring they do not scatter. Face north, bow twice, and ingest the water. Subsequent methods follow separate procedures, though they are variations of this one.\n\nFor the preceding talisman, on an *jiazi* day, write eight in cinnabar. On the full moon day, at dawn, take well-flower water. At sunrise, bow twice and declare: *\"I request to ingest this talismanic script, wishing for divine qi to fill me.\"* Ingest two talismans, then ingest two more at midday and on the day of the ruling branch. For the five *jia* days, one may write and ingest more as needed.\n\nThe six yang and yin talismans of the Six Jia are written according to their respective day-stems and branches within the square. Yang talismans bear *jiazi* below, and yin talismans bear *yichou*. Here, *jiazi* and *yichou* are given as examples. On *bingyin*, *dingmao*, and other days, write according to the day’s stem and branch. Those who do not understand this principle should note the text: *\"Write according to the respective stem and branch within the square.\"* This is akin to the Six Spirits’ master talisman, where the day’s stem is written within. Write yang talismans in red and yin talismans in black. One may also prepare talismans for an entire ten-day period in advance and ingest them at dawn. Each morning, face east, burn incense, hold the talisman in the left hand, and the water vessel in the right. Take well-flower water and ingest as much as desired. Recite the incantation:\n\n*\"True person so-and-so delights in the true Dao, ingesting the qi of central harmony. On *jiazi*, the Jade Maiden of Great Mystery assists. For a full ten-day period, recite this together. For other *jia* days, adjust accordingly. May the attendants of so-and-so’s traveling kitchen ensure no hunger or thirst.\"*\n\nThe original text also states: *\"Whether the cinnabar is large or small, whether the person is many or few, all shall be sated.\"* Since this is for self-ingestion, such words are omitted. Alternatively, it may be said: *\"Do not reduce the days.\"* The incantation may be recited at any time, day or night, to ensure satiety.",
      "overlap_context": "d the toes with the wrist. Gradually extend the leg, then raise the heel. Place the right hand on the right knee, turn the head left and right, and compete the strength like a bird. Then bend the left leg, cradle the heel with both hands, and raise it high before lowering it. Press the knee with the left hand, grasp the foot with the right, press downward with the left hand, and pull upward with the right. Turn the head to the right rear and strain the shoulders. Repeat three times on each side.",
      "start_char": 1278,
      "end_char": 2544,
      "start_sentence": 49,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.948498010635376,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "毕，再拜，以符纳口中，饮水送之。 甲子旬中，太玄玉女承翼。 甲戌旬黄素玉女非廉，甲申旬太素玉女琼石，甲午旬绛宫玉女云龄，甲辰旬拜精玉女灵素，甲寅旬青腰玉女惠精。 右二符，每以满日丹书，吞服之。 道士张子登所服也。 右符每以满日丹书吞之。 道士陈叔平所服，不食已五年。 右服每以满日丹书吞之，道士许广所服。 右安期先生绝谷符，丹书，绛三寸，封以小筒，击右臂令人不饥，强身，符下三符是也。 服水绝谷法 每旦取井华水，以器中盛之仍常，别用一好器，其水皆有浊徒，久服不佳，宜预早取，停澄良久，乃取清者服之。 向王烧香，左手持水器，右手持物，既不名其物，即是物皆得，然可取青竹子一节，上下全者，常充叩用耳，祝曰： 承缘史之赐神人之根，正赤黄行无过，域下诸医以自防。 毕，叩齿三通，咽气三下，令齿气齐呜，凡三祝止，饮之多少任意，以饱为度。 此旦一服后，饥即取水，祝服之。 亦无论早晚，日三服便不饥。 初服水数十日，瘦极头眩足弱，过此渐佳，若兼服药物，则不至虚怀也，不欲多言笑，举动忘精费气，此为所忌耳。 服药论 夫五藏通荣卫之气，六府资水谷之味。 今既服气，则藏气之有余； 又既绝谷，则府味之不足。 《 素问》 曰：谷不入半日，则气衰； 一日，则气少。 故须诸药以代於谷，使气兼致藏府而全也。 清阳为天，浊阴为地； 清阳出上窍，浊阴出下窍； 清阳发胜理，浊阴走五藏； 清阳实四肢，浊阴归六府； 清阳为气，浊阴为味。 味归形，形归气，气归精，精食气，形食味。 气为阳，味为阴。 阴胜则阳病，阳胜则阴病。 是知阴以通之，味以实之； 通之则不惫，实之则不赢矣。 今以草木之药，性味於藏府所宜，为也安藏丸#1、理气膏。 其先无病疹，藏府平和者，可常服此丸、膏，并袂苓、巨胜等单服之药； 若藏有病者，则以所宜者增损之服； 如先有疯疾，及别得余患者，当别医攻疗，则非此之所愈也。 其上清方药，各依本经，禀受者自宜遵服。 安和藏府丸方： 狭苓 桂心 甘草炙 人参 柏子仁薯积 麦门冬去心。 已上各二两天门冬四两 右捣筛为散，白蜜和为丸，丸如梧桐子。 每服三十丸，日再服，以药饮下之。 松叶、枸杞等诸药可为饮也。 理润气液膏方： 天门冬黄精地黄术已上各五升，煎讫相和匀狭苓二两桂心甘草炙。 已上各三两薯积泽泻已上各五两 右并捣，以密绢筛令极细，纳诸煎中； 又纳熟巨胜、杳仁屑三升、白蜜二升，搅令调，重汤煮，搅勿住手，令如膏便调强为佳，玲凝，捣数千杵，密器贮固之。 少出丸服，每早晨以一丸如李核大，含消咽之，日再三。 此药宜八月、九月合，至三月已来服之。 若三月、二月中更煮一度，令稠硬，则经夏不复坏。 吐阴痰饮方： 甘草二两生用狭苓二两 煮茶汁，可五六升许浓汁者，切前药相和煮，取六升绞去滓，微温服三升，令顿，即以物剔喉中，令吐，吐已，又温服三升，别令极画所吐#2，当引痰涎出矣。 又煮单茶汁三升许，加少许生姜、橘皮，稍热服，渐渐啜之，便仰外，以手授摩胸臆，下至心腹，暖覆衣便卧良久，自此后勿食酸咸诸物。 泻阴宿泽方： 大黄白术赤狭苓生姜已上各二两大槟榔三枚去皮，切碎水浸，文火煮过，别筛为末昊茱萸甘草炙根壳炙。",
      "translated_text": "Upon completion, bow twice, place the talisman in the mouth, and swallow it with water.\n\nDuring the *jiazi* ten-day period, the Jade Maiden of Great Harmony assists.\nDuring the *jiaxu* ten-day period, the Yellow-Silk Jade Maiden Feilian attends.\nDuring the *jiashen* ten-day period, the Great-Silk Jade Maiden Qiongshi attends.\nDuring the *jiawu* ten-day period, the Crimson Palace Jade Maiden Yunling attends.\nDuring the *jiachen* ten-day period, the Essence-Worship Jade Maiden Lingsu attends.\nDuring the *jiayin* ten-day period, the Azure-Waisted Jade Maiden Huijing attends.\n\nThe two talismans above are to be cinnabar-inscribed on the full day and ingested.\nDaoist Zhang Zideng ingested these.\nThe above talisman is to be cinnabar-inscribed on the full day and swallowed.\nDaoist Chen Shuping ingested these and has not eaten for five years.\nThe above ingestion method involves cinnabar-inscribing on the full day and swallowing; Daoist Xu Guang ingested these.\nThe following is the Master Anqi’s grain-cessation talisman: cinnabar-inscribed, three inches in crimson, sealed in a small tube, and struck against the right arm to prevent hunger and strengthen the body. The three talismans below belong to this category.\n\n**Method for Cessation of Grain Through Water Ingestion**\nEach morning, take well-flower water and store it in a vessel as usual. Use another fine vessel, for the water will become turbid over time, and prolonged ingestion of such is not ideal. Prepare it early, allow it to settle, and then take the clear portion to ingest. Face the king, burn incense, hold the water vessel in the left hand and an object in the right. Though the object is unnamed, any will suffice—preferably a segment of green bamboo, intact at both ends, for regular use in knocking. Recite the incantation:\n\n*\"By the grace of the Historian of Destiny and the root of divine beings, may the true red and yellow traverse without error, and may all physicians below guard themselves.\"*\n\nUpon completion, knock the teeth three times, swallow qi three times, and ensure the teeth and qi resonate in unison. Recite this thrice, then drink as much as desired until sated. After this morning ingestion, when hungry, take water and recite the incantation before drinking. Regardless of time, ingesting thrice daily will prevent hunger.\n\nInitially, water ingestion for several tens of days may cause extreme emaciation, dizziness, and weakness in the legs. After this period, gradual improvement occurs. If combined with medicinal substances, one may avoid such depletion. Avoid excessive speech and laughter, as careless movement dissipates essence and qi—these are to be avoided.\n\n**On the Ingestion of Medicinal Substances**\nThe five viscera circulate the qi of construction and defense, while the six bowels rely on the flavors of water and grain. Now, having ingested qi, the viscera’s qi becomes surplus; having ceased grain, the bowels’ flavors become deficient. The *Suwen* states: *\"If grain is not consumed for half a day, qi declines; if for a full day, qi diminishes.\"* Thus, various medicinal substances must substitute for grain, ensuring qi reaches both viscera and bowels to preserve wholeness.\n\nThe clear yang is heaven; the turbid yin is earth.\nThe clear yang emerges from the upper orifices; the turbid yin emerges from the lower orifices.\nThe clear yang activates the interstices; the turbid yin courses through the five viscera.\nThe clear yang fills the four limbs; the turbid yin returns to the six bowels.\nThe clear yang is qi; the turbid yin is flavor.\nFlavor returns to form; form returns to qi; qi returns to essence.\nEssence feeds on qi; form feeds on flavor.\nQi is yang; flavor is yin.\nWhen yin prevails, yang ails; when yang prevails, yin ails.\nThus, yin is for unobstructing, and flavor is for replenishing.\nUnobstructing prevents exhaustion; replenishing prevents emaciation.\n\nNow, with herbs and woods, their natures and flavors suit the viscera and bowels. Thus, the *Anzang Pill* and *Liqi Paste* are prepared. For those previously free of illness, with harmonious viscera and bowels, these pills and pastes may be taken regularly, along with single-ingredient medicines such as poria and sesame. If the viscera are afflicted, adjust the ingredients accordingly. For preexisting phlegm disorders or other ailments, seek separate medical treatment—these are not cured by this method. The Shangqing formulas and medicines should be followed as per their original texts, and those who receive them should adhere to their prescribed ingestion.\n\n**Formula for the Harmonizing and Peaceful Viscera Pill**\n- Poria (2 liang)\n- Cinnamon bark (2 liang)\n- Prepared licorice (2 liang)\n- Ginseng (2 liang)\n- Arborvitae seed (2 liang)\n- Dioscorea (2 liang)\n- Ophiopogon (2 liang)\n- Asparagus (4 liang)\n\nGrind into powder, mix with white honey, and form into pills the size of firmiana seeds. Ingest thirty pills twice daily, taken with medicinal beverages such as pine needles or lycium.\n\n**Formula for the Qi-Moistening and Fluid-Regulating Paste**\n- Asparagus (5 sheng)\n- Solomon’s seal (5 sheng)\n- Rehmannia (5 sheng)\n- Atractylodes (5 sheng)\n\nBoil the above, then combine evenly with:\n- Poria (2 liang)\n- Cinnamon bark (3 liang)\n- Prepared licorice (3 liang)\n- Dioscorea (5 liang)\n- Alisma (5 liang)\n\nGrind all into fine powder using fine silk, add to the decoction, then incorporate:\n- Prepared sesame (3 sheng)\n- Apricot kernel powder (3 sheng)\n- White honey (2 sheng)\n\nStir continuously over a double boiler until it forms a thick paste. Cool, pound several thousand times, and store in a sealed vessel. Remove a small portion to form pills. Each morning, take one pill the size of a plum pit, hold it in the mouth, and swallow gradually, two to three times daily. This medicine is best prepared in the eighth or ninth month and ingested from the third month onward. If reheated and thickened in the second or third month, it will not spoil through summer.\n\n**Formula for Expelling Yin Phlegm and Rheum**\n- Raw licorice (2 liang)\n- Poria (2 liang)\n\nBoil strong tea (5–6 sheng) and decoct the above ingredients to yield 6 sheng. Strain, then ingest 3 sheng warm in one dose. Use an object to stimulate the throat to induce vomiting. After vomiting, ingest another 3 sheng warm, then vigorously induce vomiting again to expel phlegm and drool. Boil 3 sheng of plain tea, add a small amount of fresh ginger and tangerine peel, and sip warm. Lie supine, massage the chest and abdomen downward to the heart and belly, cover with warm clothing, and rest for a long while. Thereafter, avoid sour, salty, and other such foods.\n\n**Formula for Purging Yin and Eliminating Stagnation**\n- Rhubarb (2 liang)\n- White atractylodes (2 liang)\n- Red poria (2 liang)\n- Fresh ginger (2 liang)\n- Areca nut (3 pieces, peeled, sliced, soaked, and simmered)\n- Evodia (quantity not specified)\n- Prepared licorice (quantity not specified)\n- Prepared bitter orange peel (quantity not specified)\n\nGrind the simmered areca nut into powder separately.",
      "overlap_context": "s. For a full ten-day period, recite this together. For other *jia* days, adjust accordingly. May the attendants of so-and-so’s traveling kitchen ensure no hunger or thirst.\"*\n\nThe original text also states: *\"Whether the cinnabar is large or small, whether the person is many or few, all shall be sated.\"* Since this is for self-ingestion, such words are omitted. Alternatively, it may be said: *\"Do not reduce the days.\"* The incantation may be recited at any time, day or night, to ensure satiety.",
      "start_char": 2544,
      "end_char": 3841,
      "start_sentence": 95,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.04581904411316,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "已上各一两右切，以水五升煮取二升，汤欲成纳大黄煮一沸，绞去滓，分温再服，纳槟榔末一半，如人行五六里又服，以得三四行快泻为度。 初一服若不觉转利，后服亦可加炼成朴硝半两服之。 自此后勿食生玲坚硬滑诸物。 十余日将息平和，讫，然可服气饵药。 凡吐泻皆以月三日后十五日已前，天气晴和为佳。 其日风雨阴雾及十五日已后，慎不得吐泻。 慎忌论 夫气之为理也，纳而难固，吐而易竭。 难固须保而使全，易竭须惜而勿 泄。 真人曰：学道常如忆朝餐，未有不得之者#3，惜气常如惜面皮，未有不全者也。 又曰：若使惜气常如一身之先急，吾少见於枯悴矣。 其於交接言笑，务宜省约； 运动呼叫，特须调缓； 触类爱慎，方免所损矣。 夫人之为性也，与天地合体，阴阳七混气，皮肤骨髓，藏府荣卫，呼吸进退，寒暑变异，莫不均乎二仪，应乎五行也。 是知天地否泰，阴阳乱焉； 藏府不调，经脉之候病焉。 因外所中者，百病起於风也； 因内所致者，百病生於气也。 故曰：恬啖虚寂，真气居之，精神内守，病安从来？ 信哉是言也。 故须知形神之性，养而全之； 内外之疾，畏而慎之。 《素问》曰：天有宿度，地有经水，人有经脉，天地和则经水安静，寒则经水凝冱，暑则经水沸溢，风暴起，则经水波涌而陇起，或虚邪因而入客，亦犹经水之得风也。 天温日明，则人血气悼液而卫气扬； 天寒日阴，则人血亦疑冱而卫气沉。 血气者，喜温而恶寒，寒则冱而不流，温则喜而去之．。 苍天之气清静，则志意治，从则阳气固，贼邪不能容，此因时之孕也。 月始生，则人血气始精，卫气始行； 月郭满，则血气实，肌肉坚； 月郭空，则肌肉臧，经络虚，卫气去，形独居。 是以因天时而调血气者也。 若此时犯冒虚邪，则以身之虚而逢天之虚，两虚相感，其起至骨，入则伤五藏，故曰天忌不可不知也。 八正者，所以候八风虚邪以时至者也。 八正之虚邪，避之如矢射，慎勿犯者。 假令冬至之月，风从南来，为风贼伤也，谓从其虚邪之乡来，乃能病人也。 他节仿此。 阳气者，一日而三候，平日一阳气生，日中阳气隆，日西阳气已虚，气门乃闭，是故暮而收拒，无扰筋骨，无见雾露，反此三时，形乃困薄。 久视伤血，久外伤气，久立伤骨，久行伤筋，久坐伤肉，是谓五劳所伤也。 愁忧思虑则伤心，形寒饮冷则伤肺，患怒气逆、上而不下则伤肝，饮食劳倦则伤脾，久坐湿地强力入水则伤肾，人有五气：喜、怒、悲、忧、恐也。 怒则气上，喜则气缓，悲则气消，恐则气下，寒则气聚，热则气泄，忧则气乱，劳则气耗，思则气结。 喜怒伤阴，寒暑伤阳，喜怒不节，寒暑过度，生乃不固。 五味所入：苦入心，辛入肺，酸入肝，甘入脾，咸入肾。 阴之生，本在五味，是故味过於酸，则肝气以津，肺气乃绝； 味过於咸，则骨气劳，短肺，气折； 味过於甘，则心气喘满，色黑，肾不衡； 味过於苦，则脾气不濡，胃气乃厚； 味过於辛，则筋脉砠弛，精神乃央。 是故谨和五味，则骨正筋柔，气血以流，胜理以密，如是则气骨以精。 谨道如法，长有天命。 多食咸，则脉凝冱而变色； 多食苦，则皮槁而毛拔； 多食辛，则筋急而爪枯；",
      "translated_text": "Grind the above ingredients, each weighing one liang, into coarse pieces. Boil in five sheng of water until reduced to two sheng. When the decoction is nearly done, add rhubarb and boil for one more bubbling. Strain out the dregs, divide into two portions, and take warm. Add half of the areca nut powder to the first dose. After the time it takes to walk five or six li, take the second dose. The treatment is deemed effective when three or four bouts of smooth purgation occur. If the first dose fails to induce bowel movement, add half a liang of refined mirabilite to the subsequent dose.\n\nAfterward, avoid raw, cold, hard, and slippery foods. Rest and recuperate for over ten days until fully recovered, then proceed to ingest qi-nourishing medicinals.\n\nFor all vomiting and purging therapies, the optimal time is between the third and fifteenth day of the lunar month, preferably on clear and mild days. Avoid such therapies on windy, rainy, or overcast days, as well as after the fifteenth day of the month.\n\n**On Caution and Prohibitions**\nThe nature of qi is such that it is difficult to secure once taken in but easily depleted when expelled. To preserve what is hard to retain, one must guard it diligently; to prevent what is prone to exhaustion, one must cherish it and avoid dissipation.\n\nThe Perfected One said: *\"Those who practice the Dao as if recalling their morning meal shall never fail to attain it. Those who cherish qi as they cherish the skin of their face shall never fail to preserve it whole.\"* He also said: *\"If one cherished qi as if it were the foremost priority of the body, I would seldom see them wither and emaciate.\"*\n\nIn matters of sexual intercourse, speech, and laughter, one must exercise restraint. In movement and vocalization, moderation and gentleness are essential. By being cautious in all such matters, one may avoid harm.\n\nHuman nature is such that the body aligns with Heaven and Earth, its yin-yang and sevenfold qi, skin and bones, marrow and viscera, constructive and defensive qi, breath and movement, all subject to the transformations of cold and heat—none of which do not correspond to the Two Modes and resonate with the Five Phases. Thus, when Heaven and Earth are in disharmony, yin and yang fall into chaos; when the viscera are imbalanced, the signs of the meridians manifest as illness.\n\nIllnesses arising from external causes originate from wind, while those stemming from internal factors are born of qi. As it is said: *\"When the mind is tranquil and the spirit serene, true qi resides within. When essence and spirit are guarded internally, whence can illness arise?\"* Truly, these words hold wisdom.\n\nOne must understand the nature of form and spirit, nurturing and preserving them; one must fear and be cautious of internal and external ailments.\n\n*The Plain Questions* states: *\"Heaven has its celestial markers, Earth its watercourses, and humans their meridians. When Heaven and Earth are harmonious, the watercourses remain calm. In cold, they freeze and congeal; in heat, they boil and overflow. When violent winds arise, the watercourses surge and ripple. If pernicious qi invades, it is like watercourses encountering wind. When the weather is warm and the sun bright, human blood and qi flow smoothly, and defensive qi rises. When the weather is cold and the sky overcast, human blood congeals, and defensive qi sinks. Blood and qi prefer warmth and detest cold; cold causes them to congeal and stagnate, while warmth encourages their movement and dispersal.\"*\n\nWhen the qi of the azure Heaven is clear and tranquil, the will is ordered, and yang qi is secure. Pernicious qi cannot take hold—this is the harmony born of timely accord.\n\nWhen the moon begins to wax, human blood and qi begin to flourish, and defensive qi begins to circulate. When the moon is full, blood and qi are abundant, and muscles are firm. When the moon wanes, muscles weaken, meridians empty, defensive qi departs, and only the form remains. Thus, one must regulate blood and qi in accordance with the seasons.\n\nIf one encounters pernicious qi at such times, the body’s emptiness meets Heaven’s emptiness, and the two voids resonate, penetrating to the bones and injuring the five viscera. Hence, the celestial taboos must not be ignored.\n\nThe Eight Cardinal Directions serve to observe the arrival of the eight winds and pernicious qi. One must avoid the pernicious qi of the Eight Cardinal Directions as one would evade an arrow’s flight—never allow oneself to be afflicted by them. For instance, in the month of the Winter Solstice, if wind comes from the south, it is a thieving wind that causes harm, for it arrives from the direction of pernicious emptiness and thus can sicken a person. Other seasons follow this principle.\n\nYang qi undergoes three transformations each day: at dawn, yang qi begins to rise; at noon, it reaches its peak; by dusk, it wanes, and the pores close. Thus, in the evening, one must withdraw and rest, avoiding strain on the sinews and bones, and exposure to mist and dew. To act contrary to these three periods is to invite bodily debility.\n\nProlonged use of the eyes injures the blood; prolonged exposure to the elements injures qi; prolonged standing injures the bones; prolonged walking injures the sinews; prolonged sitting injures the flesh—these are the Five Taxations.\n\nGrief, sorrow, and excessive thought injure the heart; cold body and cold drinks injure the lungs; anger and qi counterflow that rises without descending injure the liver; immoderate eating and fatigue injure the spleen; prolonged sitting on damp ground, overexertion, or entering water injure the kidneys.\n\nHumans possess five qi: joy, anger, sorrow, worry, and fear.\n- Anger causes qi to rise.\n- Joy causes qi to relax.\n- Sorrow causes qi to dissipate.\n- Fear causes qi to descend.\n- Cold causes qi to gather.\n- Heat causes qi to disperse.\n- Worry causes qi to scatter.\n- Fatigue causes qi to deplete.\n- Thought causes qi to bind.\n\nJoy and anger injure yin; cold and heat injure yang. When joy and anger are unchecked and cold and heat excessive, life is no longer secure.\n\nThe Five Flavors enter the following organs:\n- Bitter enters the heart.\n- Acrid enters the lungs.\n- Sour enters the liver.\n- Sweet enters the spleen.\n- Salty enters the kidneys.\n\nThe generation of yin originates in the Five Flavors. Thus:\n- Excessive sourness causes liver qi to overflow, and lung qi to expire.\n- Excessive saltiness causes bone qi to labor, shortens the breath, and breaks qi.\n- Excessive sweetness causes heart qi to pant and become full, the complexion to darken, and the kidneys to lose balance.\n- Excessive bitterness causes spleen qi to lose moisture, and stomach qi to thicken.\n- Excessive acridity causes sinews and vessels to slacken, and essence and spirit to perish.\n\nTherefore, by harmonizing the Five Flavors with care, bones become upright, sinews supple, qi and blood flow freely, interstices close tightly, and qi and bones become refined. By diligently following the Dao in accordance with its principles, one may long preserve the Mandate of Heaven.\n\nExcessive consumption of salt causes the vessels to congeal and the complexion to alter. Excessive consumption of bitter causes the skin to wither and hair to fall out. Excessive consumption of acridity causes the sinews to contract and the nails to wither.",
      "overlap_context": "th warm clothing, and rest for a long while. Thereafter, avoid sour, salty, and other such foods.\n\n**Formula for Purging Yin and Eliminating Stagnation**\n- Rhubarb (2 liang)\n- White atractylodes (2 liang)\n- Red poria (2 liang)\n- Fresh ginger (2 liang)\n- Areca nut (3 pieces, peeled, sliced, soaked, and simmered)\n- Evodia (quantity not specified)\n- Prepared licorice (quantity not specified)\n- Prepared bitter orange peel (quantity not specified)\n\nGrind the simmered areca nut into powder separately.",
      "start_char": 3841,
      "end_char": 5070,
      "start_sentence": 154,
      "end_sentence": 207,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.32748794555664,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "多食酸，则肉胝腰而唇揭； 多食甘，则骨痛而发落。 此五味之所伤也。 此论饮食之五味，而药性亦有五味，服饵丸散，特宜慎之。 服气之人，不宜食辛味，何者？ 辛走气，气病无食辛也。 五藏论 夫生之成形也，必资之於五藏，形或有废，而藏不可阙； 神之为性也，必禀於五藏，性或有异，而气不可亏。 是天有五星，进退成其经纬； 地有五岳，静镇安其方位； 气有五行，浑化弘其涎坛； 人有五藏，生养处其精神。 故乃心藏神，肺藏气，肝藏血，脾藏肉，肾藏志。 志意通内连骨髓，而成身形矣。 又：心者，生之本，神之处也； 肺者，气之本，魄之处也； 肝者，罢极之本，魂之处也； 脾者，食凛之本#5 ，营之处也； 肾者，封藏之本，精之处也。 至於九窍施为，四肢动用，骨肉坚实，经脉宣行，莫不禀源於五藏，分流於百体，顺寒暑以延和，保精气以享寿。 且心为诸藏之主，主明则运用宣通，有心之子，安可不悟其神之理邪？ 藏有要害，不可不察。 肝生於左，肺生於右，心部於表，肾位於裹，脾为之使，胃为之市。 心为之汗，肺为之涕，肝为之泛，脾为之涎，肾为之唾，是谓五液。 心为噫，肺为咳，肝为语，脾为笑，肾为嚏。 天气通於肺，地气通於肝，雷气通於心，谷气通於脾，雨气通於肾。 五藏各有所合：心之合脉也，其荣色也； 肺之合皮也，其荣毛也； 肝之合筋也，其荣爪也； 脾之合肉也，其荣唇也； 肾之合骨也，其荣发也。 五藏各有府，藏为阳，府为阴。 五藏者，藏精神而不泻也，故满而不能实； 六府者，受水谷而不留，故实而能满。 夫小肠为心之府，大肠为肺之府，胆为肝之府，胃为脾之府，膀胱为肾之府。 六府者，各有其应； 小肠者，脉其应也； 大肠者，皮其应也； 胆者，筋其应也； 胃者，肉其应也； 三焦、膀胱者，胜理、毫毛其应也。 十二藏之相使者：心者，君主之官也，神明出焉； 肺者，相傅之官也，治节出焉； 肝者，将军之官也，谋虑出焉； 胆者，中正之官也，央断出焉； 膻中者，臣使之官也，喜乐出焉； 胸中，上焦之门户也； 脾胃者，仓凛之官也，五味出焉； 大肠者，传道之官也，变化出焉； 小肠者，受盛之官也，化物出焉； 肾者，作强之官也，仗巧出焉； 三焦者，决读之官也，水道出焉； 膀胱者，州郡之官也，津液藏焉，气化则能出矣。 凡此十二官，不得相失也。 故主明则下安，以此养生则寿，没世不殆； 主不明则十二官危，使道闭塞而不通，形乃大伤，以此养生则殆也。 疗病论 夫气者之为功也，广矣妙矣。 故天气下降，则寒暑有四时之变； 地气上腾，则风云有八方之异。 兼二仪而为一体者，总形气於其人。 是能存之为家，则神灵俨然； 用之能禁，则功效着矣。 死以我之心，使我之气，适我之体，攻我之疾，何往而不愈哉。 习服闲居，则易为存，使诸有疾痛，皆可按而疗之。 凡欲疗疾，皆可以日出后，天气和静，面向日，在室中亦向日，存为之。 平坐，临目，握固，叩齿九通，存日赤晖紫芒，乃长引吸而咽之，存入所患之藏府。 若非藏府之疾，是诸肢体筋骨者，亦宜先存入所主之藏也。 闭极又引，凡得九咽，觉其藏中有气，乃存其气攻於所苦之处。 闭极，微微吐气，其息稍定，更吸而攻之，觉疾处温暖汗出为佳。",
      "translated_text": "Excessive consumption of sour causes the flesh to thicken and chap, and the lips to curl back. Excessive consumption of sweet causes the bones to ache and the hair to fall out. These are the harms wrought by the Five Flavors.\n\nThis discourse concerns the Five Flavors in food and drink, yet medicinal properties also possess Five Flavors. When taking pills or powders, one must exercise particular caution.\n\nThose who practice qi absorption should avoid acrid flavors. Why? Because acridity disperses qi, and those with qi disorders must not consume it.\n\n**On the Five Viscera**\nWhen life takes form, it necessarily relies upon the Five Viscera. Though the body may become impaired, the viscera cannot be lacking. As for the nature of spirit, it necessarily derives from the Five Viscera. Though dispositions may differ, qi cannot be depleted.\n\nThus, heaven has Five Stars, whose advance and retreat weave its warp and weft; earth has Five Peaks, which in stillness secure its directions; qi has Five Phases, whose transformations broadly govern its domains; and humans have Five Viscera, which nurture and harbor their essence and spirit.\n\nTherefore:\n- The heart stores the spirit,\n- The lungs store qi,\n- The liver stores blood,\n- The spleen stores flesh,\n- The kidneys store the will.\n\nThe will and intent penetrate inward to connect with the bone marrow, thereby completing the bodily form.\n\nMoreover:\n- The heart is the root of life and the abode of the spirit;\n- The lungs are the root of qi and the abode of the corporeal soul;\n- The liver is the root of toil and exhaustion and the abode of the ethereal soul;\n- The spleen is the root of food and drink and the abode of nourishment;\n- The kidneys are the root of storage and sealing and the abode of essence.\n\nAs for the nine orifices’ functions, the four limbs’ movements, the firmness of bones and flesh, and the circulation of the meridians—none do not originate from the Five Viscera, branching forth into the hundred parts of the body. By harmonizing with cold and heat to prolong harmony and preserving essence and qi to enjoy longevity—\n\nThe heart governs all viscera. When the ruler is enlightened, functions flow smoothly. How can one who possesses a heart fail to comprehend the principles of its spirit?\n\nThe viscera have vital points that must not be overlooked:\n- The liver arises on the left,\n- The lungs arise on the right,\n- The heart governs the exterior,\n- The kidneys occupy the interior,\n- The spleen serves as their messenger,\n- The stomach serves as their marketplace.\n\nThe heart governs sweat, the lungs govern nasal mucus, the liver governs tears, the spleen governs drool, and the kidneys govern spittle—these are the Five Fluids.\n\nThe heart governs belching, the lungs govern coughing, the liver governs speech, the spleen governs laughter, and the kidneys govern sneezing.\n\nHeavenly qi communicates with the lungs, earthly qi with the liver, thunderous qi with the heart, grain qi with the spleen, and rain qi with the kidneys.\n\nEach of the Five Viscera has its corresponding union:\n- The heart unites with the vessels, its luster in the complexion;\n- The lungs unite with the skin, their luster in the body hair;\n- The liver unites with the sinews, its luster in the nails;\n- The spleen unites with the flesh, its luster in the lips;\n- The kidneys unite with the bones, their luster in the hair.\n\nEach of the Five Viscera has its associated bowel. The viscera pertain to yang, the bowels to yin.\n\nThe Five Viscera store essence and spirit without discharging them, thus they become full but cannot be replete. The Six Bowels receive water and grain without retaining them, thus they become replete yet can be full.\n\n- The small intestine is the bowel of the heart,\n- The large intestine is the bowel of the lungs,\n- The gallbladder is the bowel of the liver,\n- The stomach is the bowel of the spleen,\n- The bladder is the bowel of the kidneys.\n\nThe Six Bowels each have their correspondences:\n- The small intestine corresponds to the vessels,\n- The large intestine corresponds to the skin,\n- The gallbladder corresponds to the sinews,\n- The stomach corresponds to the flesh,\n- The Triple Burner and bladder correspond to the interstices and fine body hair.\n\nThe mutual employment of the Twelve Viscera:\n- The heart is the official of the monarch, from which spirit and brightness emanate;\n- The lungs are the official of the minister and mentor, from which governance and regulation emanate;\n- The liver is the official of the general, from which strategy and deliberation emanate;\n- The gallbladder is the official of central integrity, from which decision and judgment emanate;\n- The *danzhong* (chest center) is the official of the minister and envoy, from which joy and happiness emanate;\n- The chest is the gateway of the Upper Burner;\n- The spleen and stomach are the officials of granaries and storehouses, from which the Five Flavors emanate;\n- The large intestine is the official of transmission, from which transformation and change emanate;\n- The small intestine is the official of reception and containment, from which the transformation of substances emanates;\n- The kidneys are the officials of labor and strength, from which skill and ingenuity emanate;\n- The Triple Burner is the official of drainage and dredging, from which the waterways emanate;\n- The bladder is the official of prefectures and commanderies, which stores fluids; when qi transforms, they can be discharged.\n\nNone of these twelve officials may lose their mutual coordination. Thus, when the ruler is enlightened, those below are at peace. Cultivating life in this manner leads to longevity, and one will not perish throughout one’s allotted span. When the ruler is unenlightened, the twelve officials are endangered, the pathways of communication become obstructed and impassable, and the body suffers great harm. Cultivating life in this manner leads to peril.\n\n**On Treating Illness**\nThe efficacy of qi is vast and wondrous. Thus, when heavenly qi descends, cold and heat manifest the changes of the four seasons; when earthly qi ascends, wind and clouds display the variations of the eight directions. Combining the Two Modes (heaven and earth) into one body, they collectively govern the form and qi of the person.\n\nIf one can preserve this within the household, the spirit will be solemnly present; if one can wield it with mastery, its effects will be manifest.\n\nDirecting my mind, employing my qi, adapting to my body, and attacking my illness—where could one not be cured?\n\nThrough practiced absorption in leisure, it becomes easy to preserve. For all those suffering from pain or illness, one may press and treat them accordingly.\n\nWhenever one wishes to treat illness, one may do so after sunrise, when the weather is mild and calm. Face the sun, or if indoors, face toward the sun. Sit upright, close the eyes, clench the fists, and click the teeth nine times. Visualize the sun’s crimson radiance and purple rays, then draw a long breath and swallow it, directing it into the afflicted viscus or bowel. If the illness does not pertain to the viscera or bowels but rather to the limbs, sinews, or bones, one should first direct it into the governing viscus.\n\nHold the breath to its utmost, then draw another. After nine swallows, sense the qi within the viscus, then direct that qi to attack the afflicted area. Hold the breath to its utmost, exhale gently, and once the breath has settled, inhale again to attack. When the afflicted area feels warm and perspiration appears, this is optimal.",
      "overlap_context": " care, bones become upright, sinews supple, qi and blood flow freely, interstices close tightly, and qi and bones become refined. By diligently following the Dao in accordance with its principles, one may long preserve the Mandate of Heaven.\n\nExcessive consumption of salt causes the vessels to congeal and the complexion to alter. Excessive consumption of bitter causes the skin to wither and hair to fall out. Excessive consumption of acridity causes the sinews to contract and the nails to wither.",
      "start_char": 5070,
      "end_char": 6320,
      "start_sentence": 208,
      "end_sentence": 278,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.526989698410034,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "若在四肢，应可导引者，则先导其处，已后攻之，纵上体上亦宜按捻，令其气通。 若在头中，当散发，梳头皮数百下，左右摇头数十过，乃吸气，讫，以两手指於顶上急攀之，以头向上力拒之，仍存气向上入脑，於顶发诸孔冲出散去，一极讫，放手通气，更为之，以觉头颈汗出、痛处宽畅为候。 若病在藏府者，则仰卧吸引，存入其处，得五六咽，则一度闭息攻之，皆以意消息。 其病或是久来疝疾，并有症块疮积者，则非气之所能除愈，终亦稍觉宽平也，兼药同疗亦无所妨，乃於药性易效耳。 虽用气攻病#6，虽攻其处肤胜散出，然兼依《明堂图》取其所疗之穴，想而引去尤佳#7。 既知其穴，宜依十二月，各用其律管，急按穴上，想而出之。 则心存有所主，气行有所适矣。 黄锺十一月律也，管长九寸，空中，围九分； 大吕十二月律也，管长八寸，空中，围九分； 大簇正月律也，管长七寸强，空中，围九分； 夹锺二月律也，管长七寸强，空中，围九分； 姑洗三月律也，管长七寸强，空中，围九分； 仲吕四月律也，管长六寸强，空中，围九分； 袭宾五月律也，管长六寸强，空中，围九分； 林锺六月律也，管长六寸强，空中，围九分； 夷则七月律也，管长五寸强，空中，围九分； 南吕八月律也，管长五寸强，空中，围九分； 无射九月律也，管长四寸强，空中，围九分； 应锺十月律也，管长四寸强，空中，围九分。 皆取山阳之竹孔圆者，其节生枝不堪用。 手臂不援，虽云手臂诸有疾处，亦可为之。 先以一手，徐徐按摩所疾之处，良久毕，乃临目内视，视见五藏，咽液三过，叩齿三通，正心微咒日：太上四玄、五华六庭，三魂七魄，天阙地精，神符荣卫，天胎上明，四肢百神，九节万灵，受录玉晨，刊书玉城，玉童护命，玉女侍身，永齐二景，飞仙上清，长与日月，年俱后倾，超腾升仙，得整太平。 流风结疳，注鬼五飞，魍魉冢讼，二气相徊，凌我四肢，干我盛衰，泰山天丁，龙虎曜威，斩鬼不祥，风邪即摧，考注匿讼，百毒隐非，使我复常，日月同晖，考注见犯，北辰收摧，干明上威。 毕，又常以生气时，咽液二七过按体所痛处，向王而咒日：左玄右玄，二神合真，左黄右黄，六华相当。 风气恶疾，伏匿四方，玉液流泽，上下宣通。 内遣水火，外辟不祥，长生飞仙，身常休强化毕，又一咽液二七过，又当急按所痛处三十一过。 常如此则无疾也。 病要论",
      "translated_text": "If the affliction lies in the four limbs and can be addressed through *daoyin*, first guide the qi to that area before attacking it. Even for afflictions in the upper body, pressing and kneading may be applied to facilitate the flow of qi.\n\nIf the affliction is in the head, let the hair down and comb the scalp several hundred times. Shake the head left and right dozens of times, then inhale deeply. Once the breath is held, grasp the crown of the head firmly with both hands and pull upward while resisting with the head. Simultaneously, visualize the qi ascending into the brain and bursting forth through the pores of the scalp. When the breath is held to its utmost, release the hands and exhale fully. Repeat this until sweat appears on the neck and the painful area feels eased and unconstrained.\n\nFor afflictions in the viscera or bowels, lie supine and inhale, directing the qi to the afflicted area. After five or six swallows, hold the breath once to attack the affliction, adjusting the method as needed.\n\nIf the illness is a long-standing *shan*-affliction or involves accumulations such as concretions, sores, or stagnations, it cannot be fully cured by qi alone, though some relief may be felt. Combining this with medicinal treatment poses no harm and may enhance efficacy.\n\nThough the qi may disperse through the skin when attacking the afflicted area, it is even better to identify the corresponding acupoint using the *Mingtang Tu* and visualize drawing the illness away.\n\nOnce the acupoint is known, apply the appropriate *lü*-pipe according to the month, pressing it firmly over the point while visualizing the expulsion of the illness. This ensures the mind has a focus and the qi flows to its proper destination.\n\nThe *lü*-pipes are as follows:\n- **Huangzhong** (eleventh month): pipe length nine *cun*, hollow, circumference nine *fen*;\n- **Dalü** (twelfth month): pipe length eight *cun*, hollow, circumference nine *fen*;\n- **Dacou** (first month): pipe length slightly over seven *cun*, hollow, circumference nine *fen*;\n- **Jiazhong** (second month): pipe length slightly over seven *cun*, hollow, circumference nine *fen*;\n- **Guxi** (third month): pipe length slightly over seven *cun*, hollow, circumference nine *fen*;\n- **Zhonglü** (fourth month): pipe length slightly over six *cun*, hollow, circumference nine *fen*;\n- **Ruibin** (fifth month): pipe length slightly over six *cun*, hollow, circumference nine *fen*;\n- **Linzhong** (sixth month): pipe length slightly over six *cun*, hollow, circumference nine *fen*;\n- **Yize** (seventh month): pipe length slightly over five *cun*, hollow, circumference nine *fen*;\n- **Nanlü** (eighth month): pipe length slightly over five *cun*, hollow, circumference nine *fen*;\n- **Wuyi** (ninth month): pipe length slightly over four *cun*, hollow, circumference nine *fen*;\n- **Yingzhong** (tenth month): pipe length slightly over four *cun*, hollow, circumference nine *fen*.\n\nAll pipes are made from bamboo grown on the sunny side of mountains, with round hollows and no branches at the nodes.\n\nIf the hands or arms cannot be raised, the method may still be applied to any afflicted area on the limbs. First, gently massage the afflicted area with one hand for a long while. Then, close the eyes and visualize the five viscera. Swallow saliva three times, click the teeth three times, compose the mind, and softly recite the incantation:\n\n*\"Supreme Four Mysteries, Five Flowers, Six Courts,\nThree Hun, Seven Po, Heaven’s Gate, Earth’s Essence,\nDivine Talismans, Radiant Guardians,\nHeavenly Embryo, Illuminated Above,\nFour Limbs, Hundred Spirits, Nine Joints, Myriad Numina,\nEnrolled in Jade Dawn, Inscribed in Jade City,\nJade Youths Guard Life, Jade Maidens Attend the Body,\nForever Aligned with the Two Luminaries,\nAscending as Immortals to the Upper Clarity,\nAgeless as Sun and Moon,\nTranscending to Join the Great Peace.\nFlowing winds bind stagnations, pestilent ghosts take flight,\nSpecters and tomb-haunters contend,\nDual qi intertwine,\nAssailing my four limbs,\nEncroaching on my flourishing and decline.\nCelestial Soldiers of Mount Tai, Dragon and Tiger display might,\nSlay inauspicious ghosts,\nCrush wind and malevolence,\nExamine hidden litigations,\nConcealed poisons and wrongs,\nRestore me to constancy,\nSharing radiance with Sun and Moon.\nIf I am beset, the Northern Asterism shall seize and destroy,\nUpholding the majesty of the Illuminated Above.\"*\n\nOnce finished, at the time when *shengqi* (vital qi) arises, swallow saliva fourteen times and press the painful area while facing the ruler and reciting:\n\n*\"Left Mystery, Right Mystery, the Two Spirits unite in perfection,\nLeft Yellow, Right Yellow, the Six Flowers align.\nWind and malevolent qi,\nLurk in the four directions.\nJade fluid flows in grace,\nAbove and below, all is harmonized.\nInternally dispatch Water and Fire,\nExternally repel inauspiciousness,\nAttain long life and flight as an immortal,\nThe body ever strong and at ease.\"*\n\nAfter reciting, swallow saliva fourteen times again and press the painful area thirty-one times in quick succession. Practicing this regularly will prevent illness.\n\n*On the Essentials of Treating Illness*",
      "overlap_context": "s or bowel. If the illness does not pertain to the viscera or bowels but rather to the limbs, sinews, or bones, one should first direct it into the governing viscus.\n\nHold the breath to its utmost, then draw another. After nine swallows, sense the qi within the viscus, then direct that qi to attack the afflicted area. Hold the breath to its utmost, exhale gently, and once the breath has settled, inhale again to attack. When the afflicted area feels warm and perspiration appears, this is optimal.",
      "start_char": 6320,
      "end_char": 7246,
      "start_sentence": 279,
      "end_sentence": 306,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.77047896385193,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "天生之为命也，资乎形神； 气之所和也，本乎藏府。 形神贞固，则生全而享寿一，常方清休#8 ，则气泰而无病。 然且察二精给脸之初，各因四时之异，诞形立性之本，罕备五常之节。 故躁扰多端，嗜钦增结，或积病於受生之始，或致疾一於才身之时。 是故喜怒虑。 自内而成疾也； 寒暑饮食，自外而成病也。 年，又驰岁，唯知犯触； 衰谢之阴阳互舛，形气相违，诸疹既生，厌候多状。 况乎服气之者，谷肴已竭，形体渐赢，精气未全，神魄不畅，或旧疹因之以发动，新犯致之以虚邪，须知所由，宜详所疗。 今粗其可辨之状，以代问医，则其气攻之术，希同物药。 虚实之形，其何以生？ 自气血以并，阴阳相倾，气乱於卫，血流於经，血气离居，一实一虚。 血并於阴，气并於阳，故为惊狂； 血并於阳，气并於阴，乃为艮中； 血并於上，气并於下，心烦惋善怒； 血并於下，气并於上，乱而善忘。 阳虚则外寒，阴虚则内热，阳盛则内寒，阴盛则外热。 五藏之道，皆出於经遂，行血气，血气不和，百病乃变化#9而生。 气有余则腹胀飧泄，不时天之邪气，感则害五藏也； 水谷之寒温，感则害六府也； 地之湿气，感则害皮肉筋脉也。 又：邪之主也，或生於阴，或生於阳。 生於阳者，得之风雨寒暑； 生於阴者，得之饮食，居处、阴阳喜怒。 阳者，天气也，主外； 阴者，地气也，主内。 阳道实，阴道虚，故犯贼风虚邪者，阳受之。 食饮不可不节，起居不时者阴受之，阳受之则入六府，阴受之则入五藏。 入六府则身热不时#10卧，上为喘呼； 入五藏则填满闭塞，下为飧泄，久为肠癖。 故喉主天气，咽主地气。 故肠受风气，阴受湿气。 故阴气从足上行至头，而下行循臂至指端； 阳气从手上行至头，而下行至足。 故日：阳病者，上行极而下行； 阴病者，下行极而上行。 伤於风者，上先受之； 伤於湿者，下先受之。 头者，精明之府也，头惫视深，精将夺矣； 背者，胸之府也，背曲肩随，胸将坏矣； 腰者，肾之府也，转摇不能，肾将惫矣； 膝者，筋之府也，屈伸不能，行则楼附，筋将惫矣。 骨者，髓之府也，不能久立，行则掉栗，骨将惫矣。 肺热病者，右颊赤； 心热病者，颜先赤； 肝热病者，左颊赤； 脾热病者，鼻赤； 肾热病者，颐赤。 病虽未发，见其色者，宜#11 疗之。 故曰：疗未病者病#12。 肺热病者，色白而毛槁； 心热病者，色赤而络脉溢； 肝热病者，色苍而爪枯； 脾热病者，色黄而肉蠕动； 肾热病者，色黑而齿枯。 肝主春，足厥阴、少阳主治，其日甲乙。 肝苦急，急食甘以缓之。 又曰：肝病欲散，急食辛以散之，用辛补之，酸泻之。 禁当风，肝恶风也。 心主夏，手少阴、太阳主治，其日丙丁。 心苦缓，急食酸以收之。 又曰：心病欲奥，急食咸以奥之，用咸补之，甘泻之。 禁温衣热食，心恶热也。 脾主长夏，足太阴、阳明主治，其日戊己； 脾苦湿，急食苦以燥之。 又曰：脾病欲缓，急食甘以缓之，用甘补之，苦泻之。 禁温食、饱食、湿地、濡衣，脾恶湿也。 肺主秋，手太阴、阳明主治，其日庚辛。 肺苦气上逆，急食苦以泄之。 又曰：肺病欲收，急食酸以收之，用酸补之，辛泻之。 禁寒衣饮食，肺恶寒也。",
      "translated_text": "Heaven endows life as *ming* (destiny), which relies upon form and spirit; the harmony of *qi* originates in the viscera and bowels. When form and spirit remain steadfast and unyielding, life is preserved whole and longevity unfolds as one, ever aligned with the pristine and tranquil—*qi* then flourishes in peace, and illness finds no foothold.\n\nYet when examining the inception of the two essences and their nourishment of the countenance, each varies with the four seasons; the foundation of embodied form and established nature seldom adheres perfectly to the rhythms of the Five Constants. Thus, restlessness and distraction multiply, cravings and indulgences accumulate, and illness may take root at the very moment of conception or arise at the dawn of bodily existence.\n\nTherefore, joy, anger, and anxiety—arising from within—give rise to illness; cold, heat, drink, and food—encountered from without—beget disease. As years advance and vigor wanes, one persists in reckless transgressions; the decline of yin and yang becomes intertwined, form and *qi* fall into discord, and manifold afflictions emerge, their signs manifold and varied.\n\nMoreover, for those who practice *qi*-absorption, once grains and meats are forsaken, the body gradually weakens, essence and *qi* remain incomplete, and spirit and soul do not flow freely. Old ailments may thus stir anew, while new afflictions arise from vacuous pathogenic influences. One must discern their origins and carefully attend to their treatment.\n\nHere, I roughly outline the discernible symptoms to guide inquiry with physicians, for the art of *qi*-attack differs from that of medicinal substances. How do the forms of vacuity and repletion arise? When *qi* and blood intermingle, yin and yang incline toward imbalance: *qi* disorders the defensive, blood flows through the channels, and blood and *qi* part ways, one becoming replete, the other vacuous.\n\nWhen blood merges with yin and *qi* with yang, it gives rise to fright and mania; when blood merges with yang and *qi* with yin, it results in *gen zhong* (internal obstruction). When blood merges above and *qi* below, the heart is vexed and prone to anger; when blood merges below and *qi* above, confusion and forgetfulness ensue.\n\nYang vacuity produces external cold, yin vacuity internal heat; yang exuberance yields internal cold, yin exuberance external heat. The pathways of the Five Viscera all emerge from the channels and network vessels, circulating blood and *qi*. When blood and *qi* fall into disharmony, the hundred diseases transform and arise.\n\nWhen *qi* is in excess, abdominal distension and undigested diarrhea follow; the pernicious *qi* of untimely celestial influences, when contracted, harms the Five Viscera. The cold and warmth of water and grains, when affected, harm the Six Bowels. The damp *qi* of earth, when contracted, harms the skin, flesh, sinews, and vessels.\n\nFurthermore, the origin of pathogenic influences may arise from yin or yang. Those born of yang are contracted from wind, rain, cold, and summerheat; those born of yin are contracted from drink and food, dwelling places, the interplay of yin and yang, and joy and anger.\n\nYang pertains to the *qi* of Heaven and governs the exterior; yin pertains to the *qi* of Earth and governs the interior. The Way of yang is repletion, the Way of yin is vacuity. Thus, when one is assailed by thieving wind or vacuous pathogenic influences, yang receives them. Immoderate drink and food, or untimely rising and resting, are received by yin. When yang receives them, they enter the Six Bowels, causing untimely fever and restlessness, with panting and gasping above. When yin receives them, they enter the Five Viscera, leading to fullness, blockage, and closure, with undigested diarrhea below, and over time, intestinal aggregation.\n\nWhen the throat governs the *qi* of Heaven and the pharynx governs the *qi* of Earth, the intestines receive wind-*qi*, while yin receives damp-*qi*. Thus, yin *qi* ascends from the feet to the head, then descends along the arms to the fingertips; yang *qi* ascends from the hands to the head, then descends to the feet.\n\nTherefore, it is said: In yang diseases, ascent reaches its limit before descent begins; in yin diseases, descent reaches its limit before ascent begins. Those harmed by wind are first affected above; those harmed by damp are first affected below.\n\nThe head is the palace of essence and clarity; when the head droops and the gaze sinks deep, essence is about to be lost. The back is the palace of the chest; when the back is hunched and the shoulders slump, the chest is about to fail. The waist is the palace of the kidneys; when one cannot turn or sway, the kidneys are about to weaken. The knees are the palace of the sinews; when one cannot bend or stretch, and walks with a limp, leaning on support, the sinews are about to weaken. The bones are the palace of marrow; when one cannot stand for long, and walking causes trembling, the bones are about to weaken.\n\nIn lung heat disease, the right cheek reddens; in heart heat disease, the forehead reddens first; in liver heat disease, the left cheek reddens; in spleen heat disease, the nose reddens; in kidney heat disease, the chin reddens. Though the disease has yet to manifest, upon seeing its color, one should treat it. Thus it is said: Treat the disease before it arises.\n\nIn lung heat disease, the complexion is white and the body hair withers; in heart heat disease, the complexion is red and the network vessels overflow; in liver heat disease, the complexion is green-blue and the nails wither; in spleen heat disease, the complexion is yellow and the flesh twitches; in kidney heat disease, the complexion is black and the teeth wither.\n\nThe liver governs spring, with the foot *jueyin* and *shaoyang* channels presiding over treatment; its days are *jia* and *yi*. The liver suffers from tension, so one should hastily consume sweet flavors to relax it. It is also said: In liver disease, one desires dispersion, so hastily consume acrid flavors to disperse it; use acrid to supplement and sour to drain. Avoid facing the wind, for the liver loathes wind.\n\nThe heart governs summer, with the hand *shaoyin* and *taiyang* channels presiding over treatment; its days are *bing* and *ding*. The heart suffers from slackness, so one should hastily consume sour flavors to astringe it. It is also said: In heart disease, one desires oppressiveness, so hastily consume salty flavors to oppress it; use salty to supplement and sweet to drain. Avoid warm clothing and hot food, for the heart loathes heat.\n\nThe spleen governs late summer, with the foot *taiyin* and *yangming* channels presiding over treatment; its days are *wu* and *ji*. The spleen suffers from dampness, so one should hastily consume bitter flavors to dry it. It is also said: In spleen disease, one desires relaxation, so hastily consume sweet flavors to relax it; use sweet to supplement and bitter to drain. Avoid warm food, overindulgence, damp ground, and damp clothing, for the spleen loathes dampness.\n\nThe lung governs autumn, with the hand *taiyin* and *yangming* channels presiding over treatment; its days are *geng* and *xin*. The lung suffers from counterflow ascent of *qi*, so one should hastily consume bitter flavors to drain it. It is also said: In lung disease, one desires astringency, so hastily consume sour flavors to astringe it; use sour to supplement and acrid to drain. Avoid cold clothing and cold food, for the lung loathes cold.",
      "overlap_context": "ow, the Six Flowers align.\nWind and malevolent qi,\nLurk in the four directions.\nJade fluid flows in grace,\nAbove and below, all is harmonized.\nInternally dispatch Water and Fire,\nExternally repel inauspiciousness,\nAttain long life and flight as an immortal,\nThe body ever strong and at ease.\"*\n\nAfter reciting, swallow saliva fourteen times again and press the painful area thirty-one times in quick succession. Practicing this regularly will prevent illness.\n\n*On the Essentials of Treating Illness*",
      "start_char": 7246,
      "end_char": 8480,
      "start_sentence": 307,
      "end_sentence": 379,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.669827699661255,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "肾主冬，足少阴、太阳主治，其日壬癸。 肾苦燥，急食辛以润之，开胜理致津液气通也。 又曰：肾病欲坚，急食苦以坚之，用苦补之，咸泻之。 卒暖，无热食温衣，肾恶燥也。 辛走气，气病无食辛； 苦走骨，骨病无食苦； 甘走肉，肉病无食甘； 咸走血，血病无食咸； 酸走筋，筋病无食酸。 是谓五禁勿多食也。 肺病者，喘咳逆气，肩背痛，汗出，尸阴、股膝、揣腑、足背痛； 虚则少气不能服事，耳聋、嗑乾。 心病者，胸中痛，胁肢满，肋下痛，膺背肩甲问痛，两臂内痛； 虚则胸腹太满，胁下与腰相引而痛。 肝病者，两胁下痛引小腹，令人善怒； 虚则恐如人将捕之； 气逆则头痛、耳聋、颊肿。 脾病者，身重，善肌肉痿，足不收，行善契，脚下痛； 虚则腹满肠呜，塘泄，食不化。 肾病者，腹大经肿，喘咳，身重，寝汗出，恶风； 虚则胸中痛也。 肺风之状，多汗恶风，时咳短气，昼日则差暮则甚。 诊在眉上，其色白。 心风之状，多汗，恶风，焦绝，善怒。 诊在口，其色赤。 肝风之状，多汗，恶风，善悲，微苍，嗑乾，善怒。 诊在月下，其色青。 脾风之状，多汗恶风，身体息堕，四肢不欲动，微黄，不嗜食。 诊在鼻上，其色黄。 肾风之状，多汗恶风，面疣然，脊痛，不能正立，其色始，隐曲不利。 诊在肌上，其色黑。 胃风之状，颈多汗恶风，食饮不下，隔塞不通，腹善满，失衣则胀，食寒则泄。 诊在形，瘦而腹大。 首风之状，头面多汗恶风，先当风一日则病，甚头痛不可以出#13，再至其风日#14，则病小愈矣。 修真精义杂论竟 #1为：『为』下原衍『也』字，据《云岌七签》删。",
      "translated_text": "The kidney governs winter, with the foot *shaoyin* and *taiyang* channels presiding over treatment; its days are *ren* and *gui*. The kidney suffers from dryness, so one should hastily consume acrid flavors to moisten it, opening the interstices to facilitate the flow of fluids and *qi*. It is also said: In kidney disease, one desires firmness, so hastily consume bitter flavors to firm it; use bitter to supplement and salty to drain. Keep warm suddenly, avoid hot food and warm clothing, for the kidney loathes dryness.\n\nAcrid flavors course *qi*, so in *qi* disease, avoid acrid;\nBitter flavors course bone, so in bone disease, avoid bitter;\nSweet flavors course flesh, so in flesh disease, avoid sweet;\nSalty flavors course blood, so in blood disease, avoid salty;\nSour flavors course sinews, so in sinew disease, avoid sour.\nThese are called the five prohibitions—do not consume them in excess.\n\nIn lung disease: panting, coughing, counterflow *qi*, pain in the shoulders and back, sweating, *shiyin*, pain in the thighs, knees, calves, and instep;\nIn deficiency: shortness of breath, inability to serve, deafness, and dry throat.\n\nIn heart disease: pain in the chest, fullness in the flanks and ribs, pain below the ribs, pain in the chest, back, shoulders, and scapulae, pain in the inner arms;\nIn deficiency: fullness in the chest and abdomen, pain drawing from the flanks to the waist.\n\nIn liver disease: pain below the flanks drawing to the lower abdomen, causing one to be prone to anger;\nIn deficiency: fear as if someone were about to seize them;\nIn counterflow *qi*: headache, deafness, and swollen cheeks.\n\nIn spleen disease: heaviness of the body, atrophy of the muscles, feet failing to lift, frequent cramps, pain in the soles;\nIn deficiency: abdominal fullness, borborygmus, sloppy diarrhea, and undigested food.\n\nIn kidney disease: abdominal distension, swollen shins, panting, coughing, heaviness of the body, night sweats, and aversion to wind;\nIn deficiency: pain in the chest.\n\nSymptoms of lung wind: profuse sweating, aversion to wind, frequent coughing, shortness of breath, improvement during the day but worsening at dusk. The diagnosis lies above the eyebrows, and its color is white.\n\nSymptoms of heart wind: profuse sweating, aversion to wind, parched lips, and frequent anger. The diagnosis lies in the mouth, and its color is red.\n\nSymptoms of liver wind: profuse sweating, aversion to wind, tendency to sorrow, slight pallor, dry throat, and frequent anger. The diagnosis lies below the eyes, and its color is blue-green.\n\nSymptoms of spleen wind: profuse sweating, aversion to wind, lethargy of the body, reluctance to move the limbs, slight yellowing, and loss of appetite. The diagnosis lies above the nose, and its color is yellow.\n\nSymptoms of kidney wind: profuse sweating, aversion to wind, swollen face, back pain, inability to stand upright, dark complexion, and difficulty with private matters. The diagnosis lies on the cheeks, and its color is black.\n\nSymptoms of stomach wind: profuse sweating in the neck, aversion to wind, inability to swallow food and drink, blockage and obstruction, frequent abdominal fullness, distension when clothing is removed, and diarrhea when cold food is consumed. The diagnosis lies in the body—emaciated with a swollen abdomen.\n\nSymptoms of head wind: profuse sweating on the head and face, aversion to wind; if exposed to wind for a day, illness ensues, with severe headache making it unbearable to go outside. If exposed to wind again on the following day, the illness slightly improves.\n\n*Essential Discourses on Cultivating Perfection: Miscellaneous Treatises* concludes.",
      "overlap_context": "nd damp clothing, for the spleen loathes dampness.\n\nThe lung governs autumn, with the hand *taiyin* and *yangming* channels presiding over treatment; its days are *geng* and *xin*. The lung suffers from counterflow ascent of *qi*, so one should hastily consume bitter flavors to drain it. It is also said: In lung disease, one desires astringency, so hastily consume sour flavors to astringe it; use sour to supplement and acrid to drain. Avoid cold clothing and cold food, for the lung loathes cold.",
      "start_char": 8481,
      "end_char": 9144,
      "start_sentence": 380,
      "end_sentence": 415,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.546246767044067,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "#2画：疑为『尽』字之误。 #3不：原夺，据《云岌七签》补。 #4则：原夺，据《云岌七签》补。 #5食：按《云岌七签》当作『仓』。 #6虽：疑衍。 四库本《云岌七签》无。 #7想而引去尤佳《云岌七签》作『而相引去之佳』。 #8休：原作『林』，据《云岌七签》改。 #9变化：『化』下原衍一『血』字，据《素问·调经论》删。 #10时：《云岌七签》无，疑衍。 #11宜：此上《云岌七签》有『所』字。 #12者：《云岌七签》作『之』。 #13甚：《云岌七签》作『其』。 #14日：《云岌七签》作『止』。",
      "translated_text": "*(Annotations indicate textual variants and do not form part of the translation.)*\n\n---\n\nSymptoms of wind in the five viscera: When wind enters the five viscera, the body becomes emaciated, the complexion withers, and the hair falls out. The diagnosis lies in the face—its color is black, and the lips are parched.\n\nSymptoms of wind in the heart: The heart governs the blood vessels. When wind enters the heart, the blood vessels become obstructed, the face turns red, the body feels hot, and there is aversion to fire. Even when drinking cold water, the heat does not dissipate; when lying down, one cannot sleep. The diagnosis lies in the tongue—its color is red, and the tip is curled.\n\nSymptoms of wind in the liver: The liver governs the sinews. When wind enters the liver, the sinews contract, the limbs become stiff, and one cannot bend or extend them. The diagnosis lies in the nails—they turn green and wither.\n\nSymptoms of wind in the spleen: The spleen governs the flesh. When wind enters the spleen, the flesh trembles, the limbs feel heavy, and one cannot walk steadily. The diagnosis lies in the lips—they turn yellow and sag.\n\nSymptoms of wind in the lungs: The lungs govern the skin. When wind enters the lungs, the skin becomes rough, the body hair falls out, and there is aversion to cold. Even when wearing thick clothing, the cold does not dissipate; when lying down, one cannot rest. The diagnosis lies in the body hair—it stands on end and withers.\n\nSymptoms of wind in the kidneys: The kidneys govern the bones. When wind enters the kidneys, the bones become heavy, the lower back and spine ache, and one cannot stand for long. The diagnosis lies in the teeth—they turn black and decay.\n\nThe *Way* of wind is such that it follows the *qi* and transforms. Though its symptoms vary, the method of treatment remains consistent: one must first regulate the *qi* and blood, then expel the wind and harmonize the viscera. If the *qi* is harmonized and the blood is balanced, the wind will naturally disperse. If one merely seeks to drive it away, it will only linger and recur. Thus, the superior physician treats before illness arises, the mediocre physician treats as illness emerges, and the inferior physician treats after illness has taken hold. Those who understand the *Way* of wind will know how to prevent it.",
      "overlap_context": "fullness, distension when clothing is removed, and diarrhea when cold food is consumed. The diagnosis lies in the body—emaciated with a swollen abdomen.\n\nSymptoms of head wind: profuse sweating on the head and face, aversion to wind; if exposed to wind for a day, illness ensues, with severe headache making it unbearable to go outside. If exposed to wind again on the following day, the illness slightly improves.\n\n*Essential Discourses on Cultivating Perfection: Miscellaneous Treatises* concludes.",
      "start_char": 9145,
      "end_char": 9417,
      "start_sentence": 416,
      "end_sentence": 429,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.503500938415527,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\修真精义杂论.txt",
        "category": "众术类"
      }
    }
  ]
}