{
  "source_id": "修炼须知",
  "source_file": "chunked_daozang\\修炼须知.json",
  "total_chunks": 7,
  "total_original_chars": 7973,
  "total_translated_chars": 43558,
  "total_translation_time": 217.2520706653595,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\修炼须知.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Essentials of Cultivation**\n\n**Text Title:** *Essentials of Cultivation and Vigilance*\n**Author:** Chen Zhixu of the Yuan Dynasty\nOriginally part of *Master Shangyang’s Great Essentials of the Golden Elixir* (Volume 4, now Chapters 7–8 in modern editions), later extracted as a standalone volume.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n---\n\n### **Essentials of Cultivation: Fire Regulation and Practice**\n\n**Master Boyang** said:\n*\"The yang-burning mirror draws fire—without the sun, no light is born.\nThe fangzhu vessel gathers dew—without stars or moon, how could water be obtained?\nThe two qi are profound and distant, yet their resonance still communicates.\nHow much more so for the body we inhabit, where all depends on the heart and breast?\"*\n\nYin and yang pair as sun and moon; water and fire serve as their signs of efficacy.\n\nHe also said:\n*\"Nature presides within, establishing the inner citadel;\nEmotion operates without, building walls and outer ramparts.\nWhen the city and ramparts are complete, all beings find peace.\"*\n\n*The Yellow Court Scripture* states:\n*\"Practice the Dao in leisurely solitude, nurturing life and guarding emptiness.\"*\n\n**Master Yuandu** said:\n*\"Those who cultivate the Dao today fail to receive proper transmission and do not comprehend Pengzu’s warning: ‘Without refining the returning elixir, do not enter the mountains.’ Instead, they seek to escape noise for stillness, withdraw from the world, shun society, abandon wives and children, and dwell alone in remote valleys and deep mountains, believing themselves superior. Such people forsake the worldly dharma.\"*\n\n**Master Wuming** said:\n*\"In regulating fire, first establish the water clock to distinguish midnight and noon. Then harmonize yin and yang as the foundation of transformation. Arrange the sixty-four hexagrams within the yin tally, and stir the twenty-four qi with the yang fire. The celestial pivot rests in the hand, the earthly axis takes form in the heart. Gather the seventy-two seasonal nodes at the crucial ford, converging within the crucible; seize the three thousand six hundred breaths of primordial qi, concentrating them within the embryo. Be vigilant in withdrawal and addition, single-minded in operation. Guard against danger, prevent peril, ensuring not a moment’s deviation nor the slightest error. Thus, externally, one harmonizes with the tally of yin and yang; internally, the body of True Unity is born. If the mind is careless in regulation and the seasonal nodes diverge, the maiden of mercury will flee, and the numinous embryo will fail to form.\"*\n\n**Master Yingchan** said:\n*\"At the initial barrier of gathering the medicine, first recognize the time when heavenly water arises. At the middle barrier, know how to harmonize the true breath, circulating it through the six voids. From the Great Mystery Pass, reverse the flow to the Celestial Valley Cavity for union, then descend to the Yellow Chamber and enter the Central Palace.\"*\n\n**Master Shangyang** said:\n*\"Regulating fire means managing both inner and outer fire. Fire is the medicinal fire; the ‘season’ refers to the tally. The tally is the tally of correspondence. When the sage begins the work of elixir refinement, one must know how lead and mercury meet. When the lead of True Unity arrives, move one’s own mercury to welcome it. Once lead and mercury unite, the grain of elixir is obtained and ingested into the Golden Chamber as the elixir’s beginning. In regulating fire, one begins at the *Fu* hexagram at the hour of *zi*. Swiftly advance the yang fire—this is called ‘setting to work’ and ‘waging the wild battle.’ For in the wild battle, dragon and tiger unite, employing three parts martial fire in a short forward movement. In ‘moving the tally,’ at the hour of *wu* when the *Gou* hexagram governs, advance the yin tally, enclosing the yang fire within. Thus, moving the tally is called ‘ceasing work and guarding the city.’ In guarding the city, the inner citadel is already established, so one need only warmly nurture and bathe, preventing subtle decline. This employs seven parts civil fire in a prolonged manner. However, both *Fu* and *Zi* are sought within the human body. One must recognize the origin of one’s own birth to attain it—there is no need to cling rigidly to the text or adhere to symbols.\"*\n\n**Master Ziyang** in *Four Hundred Words on the Golden Elixir* said:\n*\"The fire’s season does not rely on time; the winter solstice is not confined to *zi*.\nScholars should seek this with utmost care.\"*\n\n---\n\n### **New Moons, Full Moons, Quarters, and Dark Moons**\n\n**Master Yuandu** said:\n*\"A single speck of yang essence is hidden within the mountain of form—not in the heart or kidneys, but in the mysterious pass of the single aperture. Scholars who do not understand yin and yang, who do not know the seasons, cannot return. They grope within their own bodies, mistaking the luminous, numinous spirit of consciousness for the real, only to stray further afield.\"*\n\n*The Book of Changes* states:\n*\"Harmonize its brightness with the sun and moon, its sequence with the four seasons.\"*\n\n**Zhu Zhen** in *Commentary on the Book of Changes* said:\n*\"At the dark moon’s dawn, the *kan* moon and *li* sun meet at *ren* and *gui*.\"*\n\n**Master Shangyang** said:\n*\"At the first dawn of each month’s new moon, at the hour of *zi*, the sun and moon unite as a jade disk at *gui*. At dusk, they meet above *Xu* and *Bi*—this illustrates the fire’s initial arising. At this time, pure yin has reached its extreme, and subtle yang is about to be born—this is called the ‘hidden dragon.’ At the third day’s evening, the moon is born at *geng*, where true yang has just begun. *Geng* belongs to the southwest. The *Book of Changes* says: ‘In the southwest, one finds companions and travels with one’s kind.’ The *Triple Concordance Canon* states: ‘When *kun* first transforms into *zhen*, on the third day the moon emerges at *geng*.’ At this time, the medicinal ingredients have just arisen, the water source is utterly clear, undisturbed, in the moment between having qi but no form. The great cultivator, at this very time, must possess a single eye of wisdom to observe and model it—just as the great yin first receives a single yang’s qi, or as *kun*’s lower line exchanges with *qian*’s initial line to become *zhen*, akin to the human body’s pure yin generating a single yang. As my teacher said: ‘The primordial qi of pre-heaven comes from emptiness, infusing mercury and entering the crucible.’ At this time, yang qi first spreads within the crucible, and cinnabar mercury establishes its foundation.\"*\n\n**Master Zixian** said:\n*\"One clear, one turbid—metal and wood are separated at the gate of *wu* and *ji*;\nOne nature, one emotion—yin and yang gather at the door of life and death.\nGather the qi of the two poles before their division, seize the essence of dragon and tiger at their first union, enter the Yellow Chamber, and produce the supreme treasure.\"*\n\nAt the eighth day’s hour of *you*, the moon reaches the center of the sky, level as a taut cord—this is called the *upper quarter*, obtaining half a catty of gold.\n\nThe *Scripture of Dragon and Tiger* states: When *kun* transforms twice to become *dui*, on the eighth day the moon emerges at *ding*, resembling the gradual coagulation of lead and mercury within the crucible into flowing pearls. At this time, the qi of metal and water stabilizes—neither advancing the firing of the furnace nor applying talismanic activation, only bathing and cleansing the heart-mind.\n\nAt fifteen days comes the full moon, when the sun and moon irradiate each other, the three yang within yin are complete and form *qian*, just as the lunar essence receives the solar spirit to become full. This metaphorically describes the robust flourishing of lead and mercury within the crucible, true yang filling to abundance, fire bright and metal flourishing, on the verge of forming the elixir—where the qi of metal and fire solidifies with mercury, and mercury lingers fondly with its mother. At dawn following the full moon, the moon appears in the *xin* direction, *qian* first transforming into *xun*, embodying the Way of yin and yang mutually sustaining each other. Initially, pure yin receives the union of subtle yang to generate the medicine; later, yin envelops yang qi to form the cinnabar. *Xun* then receives and guides the yin talisman, yin qi gradually arising to envelop and secure the yang essence, preventing its dispersal—thus gold and cinnabar settle within the womb, yin containing yang, which is called *returning to the root*. At dawn on the twenty-third day, the moon appears in the *bing* direction, *kun* intersecting the middle line of *qian* to form *gen*, and the medicine within the crucible naturally congeals. At this time, the qi of yin and yang again stabilizes—neither applying the yin talisman nor advancing the fire, only resting, bathing, and purifying thoughts. This is the *lower quarter*, obtaining half a catty of water. Combining the half-catty of gold from the upper quarter and the half-catty of water from the lower quarter yields the full catty’s measure to coagulate the cinnabar elixir. The *Triple Concordance* states: “When the two quarters unite their essence, the bodies of *qian* and *kun* are complete.”\n\nAt dawn on the twenty-eighth day, the moon appears in the *yi* direction; at this time, the qi of yin and yang are both fulfilled, gold and mercury congeal to form the embryo, *kan* and *li* circulate qi within the crucible, coursing through the six voids within the symbolic realm—this metaphorically describes the beginning and end of the golden elixir. By the final day of the lunar cycle, the sun again meets at *ren*, where yin reaches its extreme and yang is about to arise anew.\n\nMaster Shangyang said: Though the divisions within the lunar cycle are clearly delineated, the student of immortality must embody them within the self. The dark moon, new moon, quarters, and full moon all serve as verification within the body—one must not cling to the text and become attached to images. The moon is purely yin; without receiving the sun’s yang qi, how could it wane and then regenerate? Humans are like the moon: in the prime of youth at sixteen, when the primordial chaos has not yet divided, yang is pure and qi is whole, thus their essence is vigorous and on the verge of spilling. Before it spills, this is pure yang, called the *True Person*. Thus Guangchengzi told the Yellow Emperor: “The eyes see nothing, the ears hear nothing, the heart knows nothing—then spirit will guard the form, and the form will attain longevity.” After the first spillage, one yang departs and one yin enters, transforming into *li*. From this point onward, emotions and desires sprout, primordial simplicity scatters, essence and qi daily diminish, diminishing further until yang is exhausted and yin becomes pure. Those who do not know the Way of the golden liquid returning elixir will die once yang is spent and yin is pure. Only the practitioner, understanding the marvel of return, seizes the moment before yang is exhausted to urgently cultivate, swiftly aiding and rescuing the true yang, gathering and guiding the medicinal fire to refine the returning elixir and restore life—just as the great yin receives and reflects the qi of the great yang to restore its brightness.\n\nMaster Yuan Du said: Those who study the *Complete Reality* may receive their teacher’s brief guidance on the path but remain ignorant of the step-by-step procedures; they may know that spirit and qi depend on each other but not how lead and mercury unite; even if they know of the union of lead and mercury, they may not comprehend the fusion of nature and life, rashly attempting to regulate the firing times without knowing how—all such efforts will fail.\n\nMaster Zhenyi said: If the yang fire exceeds its measure, water and drought become unbalanced, and the frozen winter transforms into scorching summer. If the yin talisman loses its rhythm, cold and warmth encroach upon each other, and the height of summer reverses into thick frost. When the golden palace fails to germinate cinnabar and mercury, the crucible spawns insects and worms. In major cases, mountains collapse and the earth splits, the metal tiger and wood dragon boil over; in minor cases, violent rain and whirlwinds arise, the *kan* male and *li* female flee in chaos. From this perspective, even if one recognizes the two substances of lead and mercury, without understanding the firing times or guarding against danger, all is in vain.\n\nMaster Shangyang said: Guarding against danger and preventing loss are the great matters of the golden elixir. Formerly, Master Bai of Purple Clarity, having received transmission from the Mud-Pill Elder, was already sixty-four years old. He hastily gathered the great ingredients for the golden elixir, enduring myriad hardships and toils, and succeeded in uniting lead and mercury, placing them in the crucible to refine. Though naturally intelligent, during the period of nurturing he was careless, failing to guard against danger—unaware, the mercury fled and the lead scattered, beyond recovery. He then composed a poem to dispel his frustration:\n\nEight ounces of sun and moon essence,\nHalf a catty of cloud and mist fragments.\nLight as a goose feather,\nHeavy as a thousand-weight iron.\nWhite as heaven’s snow,\nRed as the blood of the *xingxing*.\nGathered into a jade gourd,\nSecreted away, not to be leaked.\nAt midnight, sudden wind and thunder,\nSmoke and vapor fill the vast expanse.\nSuch flavor and feeling—\nA mute bites his tongue.\nClutching his belly, he laughs,\nLest his heart and brain grow hot.\nHe must mend his fishing rod,\nAnd again cut the autumn bamboo’s joints.\n\nSeeing this, how can one not be cautious? Had Master Bai not been so resolute, how could another mend the fishing rod and cut the bamboo’s joints? Later, he received the *Four Hundred Words on the Golden Elixir* from the Immortal Master of Purple Yang, who instructed him to guard and be vigilant—only then did he attain the Dao.\n\nGuarding against danger and preventing loss is not merely one concern but encompasses several aspects. At the initial stage of gathering the medicine, when the sun and moon joyfully meet and the dragon and tiger are about to unite, during the moment of conflict, the *True Person* already hides in the deep abyss, floating and cautiously guarding within the compass.\n\nAt this moment, one must seal the Three Treasures and focus the mind with single-minded devotion—otherwise, there is risk of losing one’s body and life. Master Purple Yang said: \"The White Tiger’s first scripture is the supreme treasure; the divine water of the Flowery Pond is true gold.\" He also said: \"When gathering in due time, be certain of floating and sinking; when advancing the fire, guard most vigilantly against peril.\" This is the most critical point of the initial barrier—this is the first concern.\n\nDuring the gathering, if yin and yang become disordered and the sun and moon fall out of harmony, though the external fire moves and proceeds, the internal tally remains closed and unresponsive, all effort will be wasted—this is the second concern. If the fire timing errs and the water pearl is unsettled, the source and flow grow turbid, the medicine loses its authenticity, and one labors in vain, gaining nothing but harm—this is the third concern.\n\nOnce the millet pearl enters the crucible, it must be warmed and nurtured, the Heart Monarch protected and supported. Should care be lacking, the fire may transform and the elixir be lost—this is the fourth concern. Some practitioners endure hardships and repeatedly face dangers, their hearts and gallbladders shaken with fear. Even if they have previously obtained the elixir and placed it in the crucible, they must thoroughly expel all distractions, ensuring purity and preventing old anxieties from disturbing the Heart Monarch. This is called \"cleansing thoughts and washing the heart\"—it is the \"bathing.\" Should lingering attachments remain, mercury and lead may flee—this is the fifth concern.\n\nWhen the ten-month gestation is complete and the embryo sheds its shell to change crucibles, if the yang spirit is not firmly preserved and is carelessly released, it may depart and lose its way, becoming homeless and without return—this is the sixth concern. After the elixir is formed, one must further discern truth from falsehood. If merit and conduct are not yet fulfilled, one may suddenly witness manifold marvels and extraordinary phenomena, even perceiving matters of past and future lives as if spirits were manifest—all of which can be clearly known. Such occurrences are demonic obstructions, not true realities. One must not mistake them for the sacred elixir of attainment. These are deceptions and illusions; seeing our Dao nearing completion, they seek to lure us into heterodox paths and disrupt our truth. At this time, one must steadfastly uphold wisdom and preserve the integrity of the true—this is the seventh concern.\n\nThese seven concerns are the greatest matters of vigilance. Should any be neglected, not only will there be no success, but one may even suffer loss. Ancestor True Yang said: \"Having realized the carefree heart of non-action, one must nurture and protect the true. Bathe for a year to guard against danger, lest one sink into delusion and labor in vain.\"\n\nI thus speak of guarding against danger and preventing loss—these are the great matters of the remaining elixir.\n\n**The Punishment and Virtue of Mao and You**\nTrue Man Purple Yang said: \"In the months of the hare and the rooster, at their appointed times, punishment and virtue arrive at the gate—such is the image of the medicine.\" Master Upper Yang said: \"The hare and the rooster are *mao* and *you*.\" Those who study the Dao must understand *mao* and *you*—there is more than one meaning.\n\nThere are the *mao* and *you* of heaven and earth, of a year, of a month, of a day, and of an hour. The *mao* and *you* of heaven and earth: the constellations *Shi*, *Fang*, and *Xin* are *mao*; when the sun’s path aligns with *Fang*, it is the day of the hare. The constellations *Wei*, *Mao*, and *Bi* are *you*; when the sun’s path aligns with *Mao*, it is the day of the rooster.\n\nThe *mao* and *you* of a year: the spring equinox is *mao*, when the time and day are in harmony; the autumn equinox is *you*, the season called Mid-Autumn. The *mao* and *you* of a month: the eighth day is *mao*, when the moon is full at the upper quarter and, at the *you* hour, reaches the center of the sky; the twenty-third day is *you*, when the moon lingers at the lower quarter and, at the *mao* hour, is at the sky’s center.\n\nThe *mao* and *you* of a day: sunrise is *mao*, when all things arise; sunset is *you*, when all sounds cease. The *mao* and *you* of an hour: this is the method of concentration. Concentrating a year into a month, two and a half days become six periods; concentrating a month into a day, one hour is divided into six periods. Thus, the seventy-two periods of a year are concentrated into a single day. Know then that within a year, there is but one day; within a day, but one hour. Great cultivators must discern the *mao* and *you* within the hour and understand the six periods of an hour.\n\nWhen gathering the medicine and extracting lead, only two of the six periods in an hour are used—like employing one part of three. The remaining four periods in an hour have other subtle uses. As for punishment and virtue, they are the two and the eight. The two and the eight are *mao* and *you*. *Mao* and *you* are the positions where yin and yang are evenly divided: yang is virtue, and virtue gives life to all things; yin is punishment, and punishment brings death to all things.\n\nIn the *mao* month, there are four yang and two yin. The yin path is about to depart, and yin governs killing. Thus, in *mao*’s two yin, yin can no longer overcome yang, yet the killing qi has not ceased. At this time, the elm dies—hence, it is punishment. In the *you* month, there are four yin and two yang. The yang path is about to depart, and yang governs generation. Thus, in *you*’s two yang, yang cannot overcome yin, yet the intent of life remains. At this time, the wheat sprouts—hence, it is virtue.\n\nAncestor True Yang inquired: \"All is the turning of the numinous and the obscure; one must focus the mind and preserve the initial heart.\"\n\n**Bathing the Heart and Thoughts**\nThe *Poem of Pointing Out Delusion* says:\n\"The work of bathing lies not elsewhere,\nBut wholly in the nursing mother’s flawless care.\nThe five phases harmonize, yin and yang align,\nTogether they sit, together they walk, as one family.\"\n\nMaster Nameless said: \"When yang qi reaches the center of heaven and earth, yin and yang are evenly balanced, neither cold nor hot but warm—this is the *Tai* hexagram. Without advancing the fire timing, it is called bathing. When yin qi descends to the center of heaven and earth, yin and yang are evenly balanced, neither hot nor cold but cool—this is the *Pi* hexagram. Without advancing the yin tally, it is also called bathing.\"\n\nMaster Upper Yang said: \"In ordinary bathing, when yin and yang are in equilibrium and the qi of lead and mercury are at rest, the two qi naturally unite. At this time, one must not advance the fire nor move the tally, lest the elixir be harmed.\"\n\nHere is the translation:\n\n---\n\nOne should only purify the heart and cleanse the mind to preserve and nurture it—this is called \"bathing.\"\n\nWhat, then, is bathing? For the great cultivator, it means wholly shedding the heart burdened by worldly cares, hardships, attachments, and desires—casting them off with effortless ease, leaving not a single thread of entanglement. The body must become like withered wood, the heart like dead ashes: this is bathing.\n\nMaster Pure Yang said: \"The original nature delights in clarity and stillness; preserve it by taming the monkey-mind.\" Master Dan Yang said: \"Fire arises in water—dismiss the mind’s scenery; flowers bloom in snow—lessen the spring of intent.\" He also said: \"The common person lacks a heart of purity; the Daoist lacks a heart of worldly dust—this is called washing and cleansing.\"\n\nAt this time, the hour approaches *mao* and *you*; the hexagrams are *Pi* and *Tai*; the phase belongs to warmth and coolness; the image is that of *xing* (punishment) and *de* (virtue). Here, one ceases the firing and guards the city—this is called bathing.\n\nThe *Cantong Qi* says:\n*\"Observe with utmost care, examine and adjust cold and warmth.\nCycle through the twelve nodes; when each is complete, attend closely again.\"*\n\nMaster Cui’s *Ruyao Jing* states:\n*\"Receiving qi is auspicious; guard against turning it ominous.\nWhen the fire timing is sufficient, do not harm the elixir.\nHeaven and earth are numinous, yet creation is niggardly.\"*\n\nTrue Man Zi Yang wrote to Bai Ziqing:\n*\"As for the bathing method, compare it to the empty hours of *mao* and *you*.\nYet do not cling to external appearances—take it when the medicine and fire arrive.\"*\n\nAn ancient song says:\n*\"Punishment and virtue together give life and death,\nArriving at the gates of two and eight.\nCinnabar should be bathed; divine water washes the numinous root.\nSeal the mouth to retain gold and mercury; guard the pass to nurture spirit and soul.\nNo need to advance the fire timing—the furnace remains gently warm.\"*\n\nWhen the great cultivator’s work reaches this point, how can one not be cautious!\n\n**The Scales of Life and Death**\nTrue Man Zi Yang said: \"Those who refine the golden liquid and returning elixir must thoroughly understand yin and yang, deeply penetrate the workings of creation, pursue the two qi along the Yellow Path, unite the three natures in the primordial palace, gather the five phases, harmonize the four images, where dragon intones and tiger roars, husband sings and wife follows.\"\n\nMy former teacher said: \"Only when a Daoist adept obtains the truth of inner and outer medicines, masters their dual functions, and aligns with the great workings of creation can they receive the transmission. If there is even a hair’s breadth of deviation, heaven and earth remain far apart.\"\n\nMaster Upper Yang said: \"Life and death are the two things of yin and yang, the two things of dragon and tiger. The dragon, yang within yin, governs life—stirring clouds and summoning rain to nourish the myriad things—yet its inner yin can kill. Like a person whose yang is exhausted and pure yin remains, they die. The tiger, yin within yang, governs death—howling winds and roaring with a constant killing intent—yet its inner yang can give life. Like a person whose yin is exhausted and pure yang remains, they become immortal.\n\nThe two things of yin and yang, when flowing in sequence, form humans; when reversed, they generate the elixir. If they do not become the myriad things or humans, they form the elixir—this is what is meant by life.\n\nWhat, then, does life give life to? Is it not life for heaven and earth, life for humans and the five phases, life for the myriad things? Is it not the possession of great spiritual penetration and wisdom, of vast divine and sacred transformations?\n\nWhat, then, does death kill? Is it not the thief of ignorance and affliction? Is it not the thief of heterodox paths and foolish delusion? Ancestor Jing Yang slew them with the swords of five maidens; Emperor Pure Yang, with the Three Clarities’ sword; the Buddha, with the Vajra King’s precious sword; Master Deshan, with the staff at the gate. Thus it is said: to protect life, one must kill; only when all is slain can one dwell in peace.\n\nAn ancestor said: 'Slaying demons and banishing specters leads to longevity.' *Chi* is stupidity; *mei* is delusion. If one early slays this foolish, dark, and deluded self, one may complete the Way of eternal life. The great cultivator must know that even a hair’s deviation prevents the elixir’s formation—one must thoroughly understand this. If one awakens to the two things of yin-yang and life-death, what worry is there of not attaining immortality?\n\nAs for the explanations of hexagrams, lines, and weights: *zhu* serves as the standard for measurement; *yao* serves as the model for application; *xiang* serves as the image to emulate; *gua* serves as the hanging sign to guide others, establishing a rule for all to follow. *Yao* and *zhu* clarify lightness and weight; *xiang* and *gua* clarify advance and retreat.\n\nAccumulating three hundred eighty-four lines forms sixty-four hexagrams; accumulating three hundred eighty-four *zhu* forms sixteen ounces—one *jin*. When the *jin* is complete and the hexagrams are full, it signifies the elixir’s near completion. The cultivator must strive to know lightness and recognize shallowness, know weight and recognize depth, know difficulty and recognize retreat, know ease and recognize advance—all to master the inner and outer medicines of the golden elixir.\n\nThe *Daode Jing* says: \"Being and non-being give rise to each other; difficulty and ease complete each other.\" It also says: \"Plan for difficulty while it is easy; achieve greatness while it is small.\" And: \"Thus the sage treats things as difficult, and so ultimately encounters no difficulty.\"\n\nTaking *Fu* and *Zhen* as the beginning of gathering medicine, half a *jin* is the measure for entering the medicine. Regarding the saying of \"one hundred lines,\" thirty lines represent the civil and seventy the martial—thus one knows the difficulty of gathering medicine. When the hexagrams are complete and the medicine is formed, the elixir reaches the measure of two eights, one *jin*.\n\nThus the *Huohuo Ji* speaks of two hundred sixteen, the count of *Qian*; eighteen eights make one hundred forty-four, the count of *Kun*. When the numbers of yin and yang are complete, the golden liquid elixir is formed.\n\n**The Seven Matters of Cultivating the Real**\nMaster Upper Yang said: \"The Way must be studied daily; study must be daily refined.\"\n\nLaozi said: \"I am no sage, yet through learning I attained it.\"\nConfucius said: \"In a hamlet of ten households, there must be one as loyal and trustworthy as I, yet none matches my love of learning.\" He also said: \"I never tire of learning, nor weary of teaching.\" And again: \"When a noble person studies the Dao, they come to love others; when a petty person studies the Dao, they become easier to employ.\"\n\nThe *Nanhua Sutra* records:\nNanbo Zikui asked Nü’ou: \"Can the Dao be learned?\"\nNü’ou replied: \"How could it not be? But you are not the right person. Though Bu Liangyi possessed the talent of a sage, he lacked the Dao of a sage; I possess the Dao of a sage, yet lack the talent of a sage. If I were to teach him, might he not become a sage? Otherwise, imparting the Dao of a sage to one with the talent of a sage would be easy indeed.\"\n\nConfucius said: \"Those who know from birth are the highest; those who know through learning come next; those who learn through hardship come after; those who suffer hardship yet do not learn—such people are the lowest.\"\n\nŚākyamuni, upon hearing half a verse, was willing to sacrifice his body. The Yellow Emperor, humbly following the wind and crawling forward on his knees, asked Guangchengzi: \"How should one cultivate the body to attain longevity?\"\n\nTruly, even the greatest sages of antiquity never came to know the Great Dao without learning. Yet people today are often reckless and deluded, unwilling to humble themselves and ask—when will they ever hear of this Dao?\n\nMaster Upper Yang said: \"The Dao may be conveyed in casual conversation, or transmitted through the heart. The relationships of ruler and minister, father and son, elder and younger brother, husband and wife, and friends—these are the unchanging principles of human relations. These may be discussed in conversation, but not transmitted through the heart.\n\nWhat is meant by 'transmission through the heart'? 'Heaven’s mandate is called nature; following nature is called the Dao.' This can be transmitted through the heart, but not in casual conversation. Following nature is what Confucius meant by 'the one thread'; it is what Mencius meant by 'the vitality that arises from accumulating rightness.'\n\nThe principles of human relations, though even a child can be taught them, are entrusted to officials by those who govern states and nations, enduring unchanged for ten thousand generations. Yet as for the Dao of following nature and accumulating rightness, the commentaries of former worthies barely touch upon it. If a worthy or noble person meets a sagely teacher and receives oral instruction without doubt, cultivating the Dao of following nature and accumulating rightness, they may be called a great sage—and only then will they understand that the principles of human relations are contained within it.\n\nAlchemy, cinnabar, sulfur, and mercury—these are the methods of refinement. These may be discussed in conversation, but not transmitted through the heart. What is meant by 'transmission through the heart'? 'Non-action that leaves nothing undone; action that accomplishes all.' This can be transmitted through the heart, but not in casual conversation. The Dao of non-action and action is the Great Dao of the Golden Elixir.\n\nThe methods of refining furnaces, ordinary cinnabar, and mercury—even fools and simple women can practice them, so they may be discussed in conversation. But as for the Dao of primordial true lead and action, even the most advanced adepts, upon receiving oral instruction from a teacher, cannot avoid doubt. If such an adept meets a teacher who points out the Dao of action in the Golden Elixir and diligently cultivates it, they may be called an immortal.\n\nSitting in dull meditation, guarding one’s nature, and observing fasts—these are the methods of seated meditation. These may be discussed in conversation, but not transmitted through the heart. Only the treasury of the true Dharma-eye, the wondrous mind of nirvana, the direct pointing to the human mind, and the Dao of seeing one’s nature and becoming a buddha—these can be transmitted through the heart, but not in casual conversation. The treasury of the true Dharma-eye and the direct pointing to the human mind are the supreme vehicle of the Dao.\n\nThe practices of fasting and seated meditation—even the dullest and most ignorant can discuss them in conversation. But as for the supreme vehicle, even those of sharpest faculties and highest wisdom, upon hearing the words of buddhas and patriarchs and attaining realization, cannot avoid doubt. Thus, at the assembly on Vulture Peak, five thousand left their seats; the Fifth Patriarch did not transmit the Dharma to Shenxiu but to the old man Huineng. This is what is meant by 'transmission through the heart, not in casual conversation.'\n\nWhen Han Xiang attained immortality, Han Yu wrote of 'gathering my bones'—was Han Yu of such dull capacity? When Zhu Xi sought instruction far and wide, Cui Zixu refused to teach him the Dao—was it that Zhu Xi did not desire it? This is to say: the Dao cannot be conveyed in casual conversation; what can be so conveyed is not the Great Dao.\n\nWhen Ge Xianweng was sixty, he finally met a teacher; when Bai Yuchan was sixty, he finally learned what must be known to practice refinement—yet both attained the Dao. This is what is meant by 'the Dao transmitted through the heart.'\n\nMaster Upper Yang said: \"The Dao has three awakenings.\"\n\nConfucius, in his commentary on the *Yijing*, said: \"Draw near and take from the self; draw far and take from things.\" This speaks of the Dao. The great practitioner seeks it in the four: near and far, self and things—right before their eyes, there is a place of awakening.\n\nLaozi’s *Classic of Constant Clarity and Stillness* says: \"Look within at the heart—there is no heart; look without at the form—there is no form; look far at things—there are no things.\" This speaks of the Dao. The great practitioner seeks it in the six: within and without, far, heart, form, and things—right now, there is a place of awakening.\n\nThe buddha-ancestors say: \"Not mind, not buddha, not things.\" This speaks of the Dao. The great practitioner seeks it in the three: mind, buddha, and things—right beneath their feet, there is a place of awakening. These are what is meant by the Dao’s three awakenings.\n\nMoreover, the sagely teachers of the Three Teachings all warn that worldly people seek the Dao in things, taking the Dao as a thing. One must reflect carefully and not pass over this lightly. For the Dao is one thing among the ten thousand things, yet the ten thousand things are one thing within the Great Dao.\n\nThus Laozi said: \"The named is the mother of the ten thousand things.\" And again: \"Abysmal! It seems the ancestor of the ten thousand things.\"\n\nAll these name the Dao through things. Pity the common folk—ever ordinary, unwilling to seek what is above. Some cultivate solitary yin and scant yang, sitting rigid in stillness; some keep fasts, hold precepts, and withdraw from the world to escape dust; some refine cinnabar, lead, silver, and silk in furnace fires. All these are errors, not awakenings. If one can strike the mark beneath the words of this compilation, there must be a singular, extraordinary great awakening.\n\nMaster Shangyang said: The Dao is transmitted in three ways. The highest: scholars and virtuous gentlemen, sparing of speech and fond of goodness, able to renounce wealth and honor, urgent only for their own person—these are called superior persons, fit to receive the Dao. The middle: plain and unadorned, they hear the Dao and believe deeply, able to sever ties of affection, practicing with vigor and perseverance, heedless of right and wrong—these are called middling persons, possessing the aspiration of superior persons, fit to receive the Dao. The lowest: simple and sincere, they delight in goodness and cast off evil, yielding themselves to others, bold in daring action—these are called inferior persons, their aspiration worthy of esteem, fit to receive the Dao. Thus those who attain this Dao are all bold and vigorous in practice, all steadfast in wisdom, all restraining evil and exalting goodness.\n\nThe word \"goodness\" is the ladder and ferry to enter the Dao. Therefore, when the ears of common folk constantly hear goodness, the kidneys do not leak essence; when the mouth constantly speaks goodness, the heart does not lose spirit; when the nose constantly smells goodness, the lungs stabilize the po; when the eyes constantly see goodness, the liver nurtures the hun; when the mind constantly thinks goodness, the spleen and stomach generate qi, and the yellow center flows with principle. Great practitioners—how can they not be good?\n\nMaster Shangyang said: The Dao has three precepts. For those who study the Dao: though their hearts yearn for it, they may flaunt their wealth and rank, unwilling to humble themselves to ask, refusing to take vows—these are called deceitful and cunning, to be precepted against and not transmitted to. Next, those who study the Dao: having heard minor arts of side doors, they engage in empty debate to display dry wisdom—these are called slanderous and deluded, to be precepted against and not transmitted to. Third, those who study the Dao: half in doubt, half in faith, not concerned with life and death, valuing wealth over their own bodies—these do not know fate, to be precepted against and not transmitted to.\n\nMaster Shangyang said: The Dao has three things to cast away. First, though one may be a wise and talented scholar, if fond of discussing the faults of ancients, this is called lacking virtue—it should be cast away. Second, though one may be a good and outstanding person, if fond of slandering and disputing right and wrong, recklessly judging past and present, this is called lacking breadth—it should be cast away. Third, though one may be devoted to the Dao and inclined toward the Buddha, if their words do not match their heart, turning from truth to falsehood, this is called lacking substance—it should be cast away.\n\nMaster Shangyang said: The Dao has four distinctions. What are the four? Wine, sex, wealth, and temper. Common folk, when drinking even a little, become drunk: their usual dignity turns to jest, their usual integrity to flattery, their usual honesty to greed and lewdness, their usual modesty to arrogance. Through wine, they lose virtue and flee their true nature. Like a mountain or marsh hiding many things, ordinarily unnoticed, suddenly wildfire blazes, the mountain reddens and the marsh heats, and a thousand demons and hundred monsters have nowhere to flee. If people do not drink, they do not lose their conduct; if mountains do not burn, demons hide their forms. Great practitioners, abstaining from drink and sitting in stillness, gather essence and harmonize spirit, not disordered by wine—this is the distinction.\n\nIn the world, many are ruined by sensual pleasures. Common folk indulge their passions and desires without restraint, insatiably attached. Like mayflies drawn to lamplight, taking flame for medicine, they rush into the fire, coming and going without cease, attached to the blaze, hurling themselves at the lamp. People are the same: clinging to love and desire, their essence and qi are exhausted, yet their passions are hard to sever. Passion drags spirit away, intention stirs and qi scatters; when spirit and qi are lost, life follows in departure. Sex, though lacking blade or spear, kills more surely than halberd or pike. Great practitioners, seemingly the same yet distinct: in wine shops and brothels, they do not refrain from play, yet they do not take sex as sex, knowing sex yet not sex, finding sex within not-sex, sex without fixed sex—this is the distinction.\n\nWhat is meant by \"not taking sex as sex\"? Like the lotus flower, its fragrance wafting ten miles—though the flower is sex, its scent is sound. Great practitioners do not value its fragrance, do not value its flower; what they value is only its trustworthiness. Trust is like the lotus flower and its scent, which cannot long remain; the lotus seed endures, the seed can settle the heart—thus it is called trust, and so it is valued. Therefore, the Most High said: \"Its essence is most true, within it there is trust\"—this is the meaning.\n\nWhat is meant by \"knowing sex yet not sex\"? Like river water, its clear flow trickling, water ferries the boat to the far shore—yet both boat and water are external things. The patriarchs did not say: \"When the Dao is accomplished, the elixir chamber’s vessels are abandoned and left behind\"? This is the meaning.\n\nWhat is \"finding sex within not-sex\"?\n\nAs in a great drought, dark clouds gather on all sides, and sweet rain suddenly falls—yet in an instant, the sky clears again. If one seeks the rainclouds of before, nothing remains to be seen; only the myriad grains and plants are moistened and quickened to life. The *Vimalakīrti Sutra* says: \"Roaming the four crossroads, benefiting sentient beings; entering the houses of lust, demonstrating the Way of desire.\" This is the meaning.\n\nWhat is meant by \"form having no fixed form\"?\nLike the precious moon, twelve times a year—new moon, full moon, crescent, and waning—within its ceaseless change, there is great constancy. Master Shangyang said: \"When assessing it, on the third day the first sliver appears, and form is greatly settled; on the eighth day, half-full, this is called the first quarter; on the fifteenth, full and bright, its radiance fills all—none among mortals do not gaze upon it. Yet its light, round and then incomplete, does not long endure. If one wishes to see its brilliance again, one must seek anew the waxing crescent, the full moon. Thus the *Book of Changes* says: 'Its virtue joins with heaven and earth, its brightness joins with sun and moon.' It also says: 'Tracing the beginning to the end, one knows the discourse on life and death.'\" This is what is meant by \"no fixed form.\"\n\nAll ordinary people covet wealth insatiably, hoarding without dispersing. Planning for children and grandchildren, they do not comprehend the principle of heaven and earth, sun and moon—waxing and waning, ebb and flow. Like Shi Chong, whose wealth rivaled the state, amassing riches bred resentment; he was executed, his family ruined, and disaster befell Green Pearl. The great practitioner, having obtained wealth, immediately uses it to seek medicine and refine the elixir. Once the elixir is complete, all the rest is dispersed—this is the difference.\n\nAll ordinary people exhaust themselves in petty strife, disturbing body and mind. Fond of litigation, they deceive the poor, seizing what they can, heedless of karmic consequences or the cycle of life and death. Unaware of regret, misfortune, and peril, all arise from this. What they contend for is little; what they lose is much. Like Xiang Yu, peerless hero of his age, who in the end perished at Wu River—his body torn apart, his corpse divided. Later generations saw him as but a hound or hawk for Han. What men contend for is far less than this.\n\nThe qi that the great practitioner contends for is not what others know—it is the primordial True Unity of heaven and earth. Master Shangyang said: \"To cultivate immortality or become a buddha, it is all through this primordial True Unity. Without this qi, no practice can be undertaken, and one cannot attain long life.\" This is the difference.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "修炼须知 经名：修悚须知。 元陈致虚撰。 原系《上阳子金丹大要》第四卷（今本第七至八卷），后分出单行本一卷。 底本出处：《正统道藏》太玄部。 修炼须知 运火行持 伯阳真人曰：阳燧以取火，非日不生光。 方诸非星月，安能得水浆。 二气玄且远，感化尚相通。 何况近存身，切在於心胸。 阴阳配日月，水火为效征。 又曰：性主处内，立置鄞鄂，情主营外，筑垣城郭，城郭完全，人物乃安。 《黄庭经》云：作道优游深独居，扶养性命守虚无。 缘督子曰：今之修道者，不得正传，不悟平叔未炼还丹莫入山之语，唯欲避喧求静，遁世远人，出妻屏子，离尘绝俗，穷谷深山独居孤处，以为自高，如此则弃世间法也。 无名子曰：夫运火者，先定刻漏以分子午，次接阴阳以为化基，搬六十四卦於阴符，鼓二十四气於阳火，天关在手，地轴形心。 回七十二候之要津，攒归鼎内； 夺三千六百之正气，辐辏胎中。 谨戒抽添，精专运用，虑其危，防其险，不使顷刻参差，分毫差忒，故得外接阴阳之符，内生真一之体。 苟或运心不谨，节候差殊，即姹女逃亡，灵胎不结。 莹蟾子曰：采药初关，先识天癸生时，中关则知调和真息，周流六虚。 自太玄关逆流至天谷穴交合，然后下降黄房，入于中宫。 上阳子曰：运火者，运内外之火。 火者，药火也。 候者，符候也。 符者，符合也。 圣人下工炼丹之初，须知铅汞两相逢迎，真一之铅将至，运己汞以迎之，铅汞一合而即得黍粒之丹，饵归黄金室内以为丹头也。 夫运火者，始自复卦子时起首，疾进阳火，谓之下手用工，而进火谓之野战。 〔盖野战〕则龙虎交合，是用三分武火，前行短之谓也。 行符者，午时姤卦用事，则进阴符，包固阳火於内，故行符谓之罢功守城。 夫守城者，以其鄞鄂已立，唯温养沐浴，防微杜渐，是用七分文火，后须长之谓也。 然复与子皆从人身而求，须认自己生身之由，则得之矣，不必执文而泥象也。 紫阳真人《金丹四百字》云：火候不用时，冬至不在子。 学者宜子细求之也。 朔望弦晦 缘督子曰：一点阳精，秘在形山，不在心肾，而在乎玄关一窍。 学者不知阴阳，不知时候，不能还返，止於自身摸索，而认彼昭昭灵灵之识神以为真实，转转差驰。 《易》曰：与日月合其明，与四时合其序。 朱震《易传》云：晦日朔旦，坎月离日会于壬癸。 上阳子曰：每月朔旦子时，日月合璧於癸，薄暮会于勖毕之上，此喻火之初生也。 当此之时，纯阴已极，微阳将生，是谓潜龙。 三日之哺，月生庚上，真阳已肇，庚属西南。 《易》曰：西南得朋，乃与类行。 《参同契》曰：坤初变成震，三日月出庚。 盖是时也，药物才生，水源至清，未曾挠动，有气无质之际。 大修行人急向此时，具一只智慧眼，则而象之，亦如太阴初受一阳之气，亦似坤之下爻〔交〕乾之初爻而为震，乃比人身纯阴而生一阳。 即我师云：先天一气自虚无中来，点汞而入鼎也。 是时鼎内阳气初布，砂汞立基。 紫贤真人曰：一清一浊，金木间隔於戊己之门； 一性一情，阴阳会聚於生杀之户。 采二仪未判之气，夺龙虎始媾之精，入于黄房，产成至宝也。 八日酉时，月到天心，其平如绳，是谓上弦，得金半斤。",
      "translated_text": "**Essentials of Cultivation**\n\n**Text Title:** *Essentials of Cultivation and Vigilance*\n**Author:** Chen Zhixu of the Yuan Dynasty\nOriginally part of *Master Shangyang’s Great Essentials of the Golden Elixir* (Volume 4, now Chapters 7–8 in modern editions), later extracted as a standalone volume.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n---\n\n### **Essentials of Cultivation: Fire Regulation and Practice**\n\n**Master Boyang** said:\n*\"The yang-burning mirror draws fire—without the sun, no light is born.\nThe fangzhu vessel gathers dew—without stars or moon, how could water be obtained?\nThe two qi are profound and distant, yet their resonance still communicates.\nHow much more so for the body we inhabit, where all depends on the heart and breast?\"*\n\nYin and yang pair as sun and moon; water and fire serve as their signs of efficacy.\n\nHe also said:\n*\"Nature presides within, establishing the inner citadel;\nEmotion operates without, building walls and outer ramparts.\nWhen the city and ramparts are complete, all beings find peace.\"*\n\n*The Yellow Court Scripture* states:\n*\"Practice the Dao in leisurely solitude, nurturing life and guarding emptiness.\"*\n\n**Master Yuandu** said:\n*\"Those who cultivate the Dao today fail to receive proper transmission and do not comprehend Pengzu’s warning: ‘Without refining the returning elixir, do not enter the mountains.’ Instead, they seek to escape noise for stillness, withdraw from the world, shun society, abandon wives and children, and dwell alone in remote valleys and deep mountains, believing themselves superior. Such people forsake the worldly dharma.\"*\n\n**Master Wuming** said:\n*\"In regulating fire, first establish the water clock to distinguish midnight and noon. Then harmonize yin and yang as the foundation of transformation. Arrange the sixty-four hexagrams within the yin tally, and stir the twenty-four qi with the yang fire. The celestial pivot rests in the hand, the earthly axis takes form in the heart. Gather the seventy-two seasonal nodes at the crucial ford, converging within the crucible; seize the three thousand six hundred breaths of primordial qi, concentrating them within the embryo. Be vigilant in withdrawal and addition, single-minded in operation. Guard against danger, prevent peril, ensuring not a moment’s deviation nor the slightest error. Thus, externally, one harmonizes with the tally of yin and yang; internally, the body of True Unity is born. If the mind is careless in regulation and the seasonal nodes diverge, the maiden of mercury will flee, and the numinous embryo will fail to form.\"*\n\n**Master Yingchan** said:\n*\"At the initial barrier of gathering the medicine, first recognize the time when heavenly water arises. At the middle barrier, know how to harmonize the true breath, circulating it through the six voids. From the Great Mystery Pass, reverse the flow to the Celestial Valley Cavity for union, then descend to the Yellow Chamber and enter the Central Palace.\"*\n\n**Master Shangyang** said:\n*\"Regulating fire means managing both inner and outer fire. Fire is the medicinal fire; the ‘season’ refers to the tally. The tally is the tally of correspondence. When the sage begins the work of elixir refinement, one must know how lead and mercury meet. When the lead of True Unity arrives, move one’s own mercury to welcome it. Once lead and mercury unite, the grain of elixir is obtained and ingested into the Golden Chamber as the elixir’s beginning. In regulating fire, one begins at the *Fu* hexagram at the hour of *zi*. Swiftly advance the yang fire—this is called ‘setting to work’ and ‘waging the wild battle.’ For in the wild battle, dragon and tiger unite, employing three parts martial fire in a short forward movement. In ‘moving the tally,’ at the hour of *wu* when the *Gou* hexagram governs, advance the yin tally, enclosing the yang fire within. Thus, moving the tally is called ‘ceasing work and guarding the city.’ In guarding the city, the inner citadel is already established, so one need only warmly nurture and bathe, preventing subtle decline. This employs seven parts civil fire in a prolonged manner. However, both *Fu* and *Zi* are sought within the human body. One must recognize the origin of one’s own birth to attain it—there is no need to cling rigidly to the text or adhere to symbols.\"*\n\n**Master Ziyang** in *Four Hundred Words on the Golden Elixir* said:\n*\"The fire’s season does not rely on time; the winter solstice is not confined to *zi*.\nScholars should seek this with utmost care.\"*\n\n---\n\n### **New Moons, Full Moons, Quarters, and Dark Moons**\n\n**Master Yuandu** said:\n*\"A single speck of yang essence is hidden within the mountain of form—not in the heart or kidneys, but in the mysterious pass of the single aperture. Scholars who do not understand yin and yang, who do not know the seasons, cannot return. They grope within their own bodies, mistaking the luminous, numinous spirit of consciousness for the real, only to stray further afield.\"*\n\n*The Book of Changes* states:\n*\"Harmonize its brightness with the sun and moon, its sequence with the four seasons.\"*\n\n**Zhu Zhen** in *Commentary on the Book of Changes* said:\n*\"At the dark moon’s dawn, the *kan* moon and *li* sun meet at *ren* and *gui*.\"*\n\n**Master Shangyang** said:\n*\"At the first dawn of each month’s new moon, at the hour of *zi*, the sun and moon unite as a jade disk at *gui*. At dusk, they meet above *Xu* and *Bi*—this illustrates the fire’s initial arising. At this time, pure yin has reached its extreme, and subtle yang is about to be born—this is called the ‘hidden dragon.’ At the third day’s evening, the moon is born at *geng*, where true yang has just begun. *Geng* belongs to the southwest. The *Book of Changes* says: ‘In the southwest, one finds companions and travels with one’s kind.’ The *Triple Concordance Canon* states: ‘When *kun* first transforms into *zhen*, on the third day the moon emerges at *geng*.’ At this time, the medicinal ingredients have just arisen, the water source is utterly clear, undisturbed, in the moment between having qi but no form. The great cultivator, at this very time, must possess a single eye of wisdom to observe and model it—just as the great yin first receives a single yang’s qi, or as *kun*’s lower line exchanges with *qian*’s initial line to become *zhen*, akin to the human body’s pure yin generating a single yang. As my teacher said: ‘The primordial qi of pre-heaven comes from emptiness, infusing mercury and entering the crucible.’ At this time, yang qi first spreads within the crucible, and cinnabar mercury establishes its foundation.\"*\n\n**Master Zixian** said:\n*\"One clear, one turbid—metal and wood are separated at the gate of *wu* and *ji*;\nOne nature, one emotion—yin and yang gather at the door of life and death.\nGather the qi of the two poles before their division, seize the essence of dragon and tiger at their first union, enter the Yellow Chamber, and produce the supreme treasure.\"*\n\nAt the eighth day’s hour of *you*, the moon reaches the center of the sky, level as a taut cord—this is called the *upper quarter*, obtaining half a catty of gold.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1231,
      "start_sentence": 0,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.44339203834534,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\修炼须知.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "《龙虎经》曰：坤再变成兑，八日月出丁，以像鼎中铅汞，渐结流珠。 是时金水气停，不进肠火，亦无行符，唯沐浴洗心而已。 三五为望，望者日月相射，则阴中三阳已备而成乾，犹月魄得日魂而满。 喻鼎中铅汞壮盛，真阳充满，火明金旺，将欲成器，是金火之气与汞固结，汞与其母两相留恋也。 既望平明，月见辛方，乾初变巽，乃阴阳相承之道。 始焉则纯阴得交微阳而生药，后则阴包阳气而成丹。 巽乃承领阴符，阴气渐生，包固阳精，使无动逸，则金砂落于胞中，阴中含阳，是谓归根也。 二十三日平明，月见丙方，坤交乾之中爻而#1为艮，鼎中物药自然凝结。 是时阴阳之气复停，不行阴符，亦无进火，唯休浴涤虑而已。 是时下弦，得水半斤。 以上弦金半斤，下弦水半斤，两弦合一斤之数，以结丹砂。 《参同契》曰：两、弦合其精，乾坤体乃成。 二十八日平明，月见乙方，此时阴阳之气俱足，金汞结而成胎，坎离运气於鼎中，周流六虚於象内，此喻金丹之始终也。 至于晦日，日复会于壬，则阴极而阳又将生矣。 上阳子曰：句裹虽已分明，而学仙子当体於身。 晦、朔、弦、望，皆取证於身，不可泥文而着象也。 夫月纯阴也，不感日之阳气，安能灭而复生。 人亦似月也，当二八少壮之年，鸿蒙未判，则阳纯而气全，故其精方胜〔而〕欲泄。 其未泄之前，是为纯阳，是号真人。 故广成子谓黄帝曰：目无所见，耳无所闻，心无所知，神将守形，形乃长生。 一泄之后，那去一阳，而交一阴，是变为离。 自此而往，情欲已萌，淳朴已散，精气日损，损之又损，以至於阳尽而阴纯也。 夫惟不知金液还丹之道者，待其阳尽阴纯则死矣。 唯修行之人，知其还返之妙，於其未尽之际，疾早修行，急急接助，扶救真阳，收领药火，以炼还丹而复其命。 亦如太阴领览太阳之气，而复其明也。 防危护失 缘督子曰：学全真者，得师略指门径，而不知逐节事条，知神气相依，而不知铅汞交媾，既知铅汞交媾，而不知性命混合，妄拟火候进退，不知此〔皆〕不成。 真一子曰：阳火过刻，水旱不调，则凝冬变为大暑。 或阴符失节，寒暖相侵，则盛夏反为浓霜。 金宫既砂汞之不萌，一鼎则虫螟之互起。 大则山崩地圯，金虎与木龙沸腾，小则雨暴风飘，坎男共离女奔逸。 以此观之，纵识铅汞二物，不晓火候，不防险危，实徒然耳。 上阳子曰：虑险防危，金丹之大事也。 昔紫清白真人，既得泥丸翁之传，年已六十四矣。 急忙收拾金丹大料，用尽万苦千辛，既得铅汞相合、入鼎烹炼。 以其平日天资#2聪明，当是温养之时，用心不谨，不防其危，不觉汞走铅飞，无可收救，遂作诗以自解其愠。 诗曰：八两日月精，半斤云雾屑。 轻似一鸿毛，重似千秤铁。 白如天上雪，红似猩猩血。 收入玉葫芦，秘之不可泄。 夜半忽风雷，烟气满寥泬。 这般情与味，哑子咬破舌。 捧腹付一笑，无使心脑热。 要整钓鱼竿，再斫秋筠节。 观此可不慎欤？ 若非白真人之坚固，他人安能再整钓竿，而斫筠节乎。 又得紫阳仙师以《金丹四百字》授之，令其关防慎密，后乃成道。 夫虑险防危，不啻一件，自有数说。 其初采药之时，日月欢会，龙虎将交，战争之际，真人已潜於深渊，浮游慎守於规中。",
      "translated_text": "The *Scripture of Dragon and Tiger* states: When *kun* transforms twice to become *dui*, on the eighth day the moon emerges at *ding*, resembling the gradual coagulation of lead and mercury within the crucible into flowing pearls. At this time, the qi of metal and water stabilizes—neither advancing the firing of the furnace nor applying talismanic activation, only bathing and cleansing the heart-mind.\n\nAt fifteen days comes the full moon, when the sun and moon irradiate each other, the three yang within yin are complete and form *qian*, just as the lunar essence receives the solar spirit to become full. This metaphorically describes the robust flourishing of lead and mercury within the crucible, true yang filling to abundance, fire bright and metal flourishing, on the verge of forming the elixir—where the qi of metal and fire solidifies with mercury, and mercury lingers fondly with its mother. At dawn following the full moon, the moon appears in the *xin* direction, *qian* first transforming into *xun*, embodying the Way of yin and yang mutually sustaining each other. Initially, pure yin receives the union of subtle yang to generate the medicine; later, yin envelops yang qi to form the cinnabar. *Xun* then receives and guides the yin talisman, yin qi gradually arising to envelop and secure the yang essence, preventing its dispersal—thus gold and cinnabar settle within the womb, yin containing yang, which is called *returning to the root*. At dawn on the twenty-third day, the moon appears in the *bing* direction, *kun* intersecting the middle line of *qian* to form *gen*, and the medicine within the crucible naturally congeals. At this time, the qi of yin and yang again stabilizes—neither applying the yin talisman nor advancing the fire, only resting, bathing, and purifying thoughts. This is the *lower quarter*, obtaining half a catty of water. Combining the half-catty of gold from the upper quarter and the half-catty of water from the lower quarter yields the full catty’s measure to coagulate the cinnabar elixir. The *Triple Concordance* states: “When the two quarters unite their essence, the bodies of *qian* and *kun* are complete.”\n\nAt dawn on the twenty-eighth day, the moon appears in the *yi* direction; at this time, the qi of yin and yang are both fulfilled, gold and mercury congeal to form the embryo, *kan* and *li* circulate qi within the crucible, coursing through the six voids within the symbolic realm—this metaphorically describes the beginning and end of the golden elixir. By the final day of the lunar cycle, the sun again meets at *ren*, where yin reaches its extreme and yang is about to arise anew.\n\nMaster Shangyang said: Though the divisions within the lunar cycle are clearly delineated, the student of immortality must embody them within the self. The dark moon, new moon, quarters, and full moon all serve as verification within the body—one must not cling to the text and become attached to images. The moon is purely yin; without receiving the sun’s yang qi, how could it wane and then regenerate? Humans are like the moon: in the prime of youth at sixteen, when the primordial chaos has not yet divided, yang is pure and qi is whole, thus their essence is vigorous and on the verge of spilling. Before it spills, this is pure yang, called the *True Person*. Thus Guangchengzi told the Yellow Emperor: “The eyes see nothing, the ears hear nothing, the heart knows nothing—then spirit will guard the form, and the form will attain longevity.” After the first spillage, one yang departs and one yin enters, transforming into *li*. From this point onward, emotions and desires sprout, primordial simplicity scatters, essence and qi daily diminish, diminishing further until yang is exhausted and yin becomes pure. Those who do not know the Way of the golden liquid returning elixir will die once yang is spent and yin is pure. Only the practitioner, understanding the marvel of return, seizes the moment before yang is exhausted to urgently cultivate, swiftly aiding and rescuing the true yang, gathering and guiding the medicinal fire to refine the returning elixir and restore life—just as the great yin receives and reflects the qi of the great yang to restore its brightness.\n\nMaster Yuan Du said: Those who study the *Complete Reality* may receive their teacher’s brief guidance on the path but remain ignorant of the step-by-step procedures; they may know that spirit and qi depend on each other but not how lead and mercury unite; even if they know of the union of lead and mercury, they may not comprehend the fusion of nature and life, rashly attempting to regulate the firing times without knowing how—all such efforts will fail.\n\nMaster Zhenyi said: If the yang fire exceeds its measure, water and drought become unbalanced, and the frozen winter transforms into scorching summer. If the yin talisman loses its rhythm, cold and warmth encroach upon each other, and the height of summer reverses into thick frost. When the golden palace fails to germinate cinnabar and mercury, the crucible spawns insects and worms. In major cases, mountains collapse and the earth splits, the metal tiger and wood dragon boil over; in minor cases, violent rain and whirlwinds arise, the *kan* male and *li* female flee in chaos. From this perspective, even if one recognizes the two substances of lead and mercury, without understanding the firing times or guarding against danger, all is in vain.\n\nMaster Shangyang said: Guarding against danger and preventing loss are the great matters of the golden elixir. Formerly, Master Bai of Purple Clarity, having received transmission from the Mud-Pill Elder, was already sixty-four years old. He hastily gathered the great ingredients for the golden elixir, enduring myriad hardships and toils, and succeeded in uniting lead and mercury, placing them in the crucible to refine. Though naturally intelligent, during the period of nurturing he was careless, failing to guard against danger—unaware, the mercury fled and the lead scattered, beyond recovery. He then composed a poem to dispel his frustration:\n\nEight ounces of sun and moon essence,\nHalf a catty of cloud and mist fragments.\nLight as a goose feather,\nHeavy as a thousand-weight iron.\nWhite as heaven’s snow,\nRed as the blood of the *xingxing*.\nGathered into a jade gourd,\nSecreted away, not to be leaked.\nAt midnight, sudden wind and thunder,\nSmoke and vapor fill the vast expanse.\nSuch flavor and feeling—\nA mute bites his tongue.\nClutching his belly, he laughs,\nLest his heart and brain grow hot.\nHe must mend his fishing rod,\nAnd again cut the autumn bamboo’s joints.\n\nSeeing this, how can one not be cautious? Had Master Bai not been so resolute, how could another mend the fishing rod and cut the bamboo’s joints? Later, he received the *Four Hundred Words on the Golden Elixir* from the Immortal Master of Purple Yang, who instructed him to guard and be vigilant—only then did he attain the Dao.\n\nGuarding against danger and preventing loss is not merely one concern but encompasses several aspects. At the initial stage of gathering the medicine, when the sun and moon joyfully meet and the dragon and tiger are about to unite, during the moment of conflict, the *True Person* already hides in the deep abyss, floating and cautiously guarding within the compass.",
      "overlap_context": ":\n*\"One clear, one turbid—metal and wood are separated at the gate of *wu* and *ji*;\nOne nature, one emotion—yin and yang gather at the door of life and death.\nGather the qi of the two poles before their division, seize the essence of dragon and tiger at their first union, enter the Yellow Chamber, and produce the supreme treasure.\"*\n\nAt the eighth day’s hour of *you*, the moon reaches the center of the sky, level as a taut cord—this is called the *upper quarter*, obtaining half a catty of gold.",
      "start_char": 1231,
      "end_char": 2469,
      "start_sentence": 52,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.566903591156006,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\修炼须知.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "盖是时也，闭塞三宝，唯当专心致志，否则有丧身失命之事。 紫阳翁云：白虎首经至宝，华池神水真金。 又云：依时采取定浮沈，进火须防危甚。 最为初关之紧切，此其一也。 采取之时，若或阴阳错乱，日月乖离，外火虽动而行，内符闭息不应，枉费神功，此其二也。 若火候过差，水珠不定，源流混浊，药物不真，空自劳神，有损无益，此其三也。 既得黍珠入鼎，须要温养，保扶心君，苟或未善，即恐火化丹失，此其四也。 至有学者备历艰难，屡经危险，心胆惊怖，平时在怀得丹，入鼎切宜驱除，务令清净，勿使牵挂旧虑，以乱心君，是谓涤虑洗心，是为沐浴。 偶或留恋，则恐汞铅飞走，此其五也。 及其十月胎完，脱壳换鼎，不能保固阳神，轻纵出去，则一出而迷途，遂失舍而无归，此其六也。 又有丹成之后，且要识真辩伪，若功行未满，眼前忽见灵异多端，奇特百出，以至生生之事，如有神见，皆能明知。 若此等件，是为魔障已至，并非真实，切不可认为已灵丹圣。 兹乃邪伪妖幻，见吾道成，乃欲引入邪宗，以乱吾真。 於斯时也，且须坚固智慧，保养全真，此其七也。 凡此七件，皆防虑之大者也。 有一不防，非但无成，恐致失丧。 正阳祖师曰：已证无为自在心，便须温养保全真。 一年沐浴防危险，免见沈沦更用心。 吾所以云虑险防危，余丹之 大事者也。 卯酉刑德 紫阳真人曰：兔鸡之月及其时，刑德临门药象之。 上阳子曰：兔鸡者，卯酉也。 学道的人，须知卯酉，非止一说。 有天地之卯酉，有一年之卯酉，有一月之卯酉，有一日之卯酉，有一时之卯酉。 天地之卯酉者，氏房心为卯，正躔则房日兔； 胃昴毕为酉，正躔则昴日鸡也。 一年之卯酉者，春分为卯，时日中和； 秋分为酉，序曰中秋。 一月之卯酉者，初八日为卯，月满上弦，酉时月到天心； 二十三日为酉，月留下弦，卯时月在天中。 一日之卯酉者，日出为卯，而万物作； 日入为酉，而万籁息。 一时之卯酉者，盖攒簇之道也。 簇一年於一月，两日半为六候； 簇一月於一日，则一时分六候。 故一年七十二候，簇.於一日也。 是知一年之中，止有一日，一日之内，止在一时。 大修行人，须辩时中卯酉，要知一时六候。 盖采药取铅，一时六候惟用二候，犹三停而用一停。 而一时之中尤余四候，别有妙用。 所谓刑德者，二八也。 盖二八者，卯酉也。 卯酉是阴阳平分之位，阳为德，德则万物生； 阴为刑，刑则万物死。 而卯月乃四阳而二阴，阴道将离，而阴主杀，是以卯之二阴，阴．已不能胜阳，然杀气未绝，至是而榆死，故为刑也。 酉乃四阴而二阳，阳道将离，而阳主发生，是以酉之二阳，阳虽不能胜阴，然生意尚存，至是而麦生，故为德也。 正阳访曰：尽是灵冥转消息，切须专志保初心。 沐浴心虑 《指迷诗》曰：沐浴之功不在它，全凭乳母养无差。 五行和合阴阳顺，同坐同行共一家。 无名子曰：阳气到天地之中，阴阳相半，不寒不热而温，故为泰卦，不进火候，谓之沐浴。 阴气降天地之中，阴阳相半，不热不寒而凉，故为否卦，不进阴符，亦云沐浴也。 上阳子曰：沐俗者，适当阴阳相州铅汞气停，阴阳二气自然交合。 於此时也，不必进火，亦不行符，恐反伤丹。",
      "translated_text": "At this moment, one must seal the Three Treasures and focus the mind with single-minded devotion—otherwise, there is risk of losing one’s body and life. Master Purple Yang said: \"The White Tiger’s first scripture is the supreme treasure; the divine water of the Flowery Pond is true gold.\" He also said: \"When gathering in due time, be certain of floating and sinking; when advancing the fire, guard most vigilantly against peril.\" This is the most critical point of the initial barrier—this is the first concern.\n\nDuring the gathering, if yin and yang become disordered and the sun and moon fall out of harmony, though the external fire moves and proceeds, the internal tally remains closed and unresponsive, all effort will be wasted—this is the second concern. If the fire timing errs and the water pearl is unsettled, the source and flow grow turbid, the medicine loses its authenticity, and one labors in vain, gaining nothing but harm—this is the third concern.\n\nOnce the millet pearl enters the crucible, it must be warmed and nurtured, the Heart Monarch protected and supported. Should care be lacking, the fire may transform and the elixir be lost—this is the fourth concern. Some practitioners endure hardships and repeatedly face dangers, their hearts and gallbladders shaken with fear. Even if they have previously obtained the elixir and placed it in the crucible, they must thoroughly expel all distractions, ensuring purity and preventing old anxieties from disturbing the Heart Monarch. This is called \"cleansing thoughts and washing the heart\"—it is the \"bathing.\" Should lingering attachments remain, mercury and lead may flee—this is the fifth concern.\n\nWhen the ten-month gestation is complete and the embryo sheds its shell to change crucibles, if the yang spirit is not firmly preserved and is carelessly released, it may depart and lose its way, becoming homeless and without return—this is the sixth concern. After the elixir is formed, one must further discern truth from falsehood. If merit and conduct are not yet fulfilled, one may suddenly witness manifold marvels and extraordinary phenomena, even perceiving matters of past and future lives as if spirits were manifest—all of which can be clearly known. Such occurrences are demonic obstructions, not true realities. One must not mistake them for the sacred elixir of attainment. These are deceptions and illusions; seeing our Dao nearing completion, they seek to lure us into heterodox paths and disrupt our truth. At this time, one must steadfastly uphold wisdom and preserve the integrity of the true—this is the seventh concern.\n\nThese seven concerns are the greatest matters of vigilance. Should any be neglected, not only will there be no success, but one may even suffer loss. Ancestor True Yang said: \"Having realized the carefree heart of non-action, one must nurture and protect the true. Bathe for a year to guard against danger, lest one sink into delusion and labor in vain.\"\n\nI thus speak of guarding against danger and preventing loss—these are the great matters of the remaining elixir.\n\n**The Punishment and Virtue of Mao and You**\nTrue Man Purple Yang said: \"In the months of the hare and the rooster, at their appointed times, punishment and virtue arrive at the gate—such is the image of the medicine.\" Master Upper Yang said: \"The hare and the rooster are *mao* and *you*.\" Those who study the Dao must understand *mao* and *you*—there is more than one meaning.\n\nThere are the *mao* and *you* of heaven and earth, of a year, of a month, of a day, and of an hour. The *mao* and *you* of heaven and earth: the constellations *Shi*, *Fang*, and *Xin* are *mao*; when the sun’s path aligns with *Fang*, it is the day of the hare. The constellations *Wei*, *Mao*, and *Bi* are *you*; when the sun’s path aligns with *Mao*, it is the day of the rooster.\n\nThe *mao* and *you* of a year: the spring equinox is *mao*, when the time and day are in harmony; the autumn equinox is *you*, the season called Mid-Autumn. The *mao* and *you* of a month: the eighth day is *mao*, when the moon is full at the upper quarter and, at the *you* hour, reaches the center of the sky; the twenty-third day is *you*, when the moon lingers at the lower quarter and, at the *mao* hour, is at the sky’s center.\n\nThe *mao* and *you* of a day: sunrise is *mao*, when all things arise; sunset is *you*, when all sounds cease. The *mao* and *you* of an hour: this is the method of concentration. Concentrating a year into a month, two and a half days become six periods; concentrating a month into a day, one hour is divided into six periods. Thus, the seventy-two periods of a year are concentrated into a single day. Know then that within a year, there is but one day; within a day, but one hour. Great cultivators must discern the *mao* and *you* within the hour and understand the six periods of an hour.\n\nWhen gathering the medicine and extracting lead, only two of the six periods in an hour are used—like employing one part of three. The remaining four periods in an hour have other subtle uses. As for punishment and virtue, they are the two and the eight. The two and the eight are *mao* and *you*. *Mao* and *you* are the positions where yin and yang are evenly divided: yang is virtue, and virtue gives life to all things; yin is punishment, and punishment brings death to all things.\n\nIn the *mao* month, there are four yang and two yin. The yin path is about to depart, and yin governs killing. Thus, in *mao*’s two yin, yin can no longer overcome yang, yet the killing qi has not ceased. At this time, the elm dies—hence, it is punishment. In the *you* month, there are four yin and two yang. The yang path is about to depart, and yang governs generation. Thus, in *you*’s two yang, yang cannot overcome yin, yet the intent of life remains. At this time, the wheat sprouts—hence, it is virtue.\n\nAncestor True Yang inquired: \"All is the turning of the numinous and the obscure; one must focus the mind and preserve the initial heart.\"\n\n**Bathing the Heart and Thoughts**\nThe *Poem of Pointing Out Delusion* says:\n\"The work of bathing lies not elsewhere,\nBut wholly in the nursing mother’s flawless care.\nThe five phases harmonize, yin and yang align,\nTogether they sit, together they walk, as one family.\"\n\nMaster Nameless said: \"When yang qi reaches the center of heaven and earth, yin and yang are evenly balanced, neither cold nor hot but warm—this is the *Tai* hexagram. Without advancing the fire timing, it is called bathing. When yin qi descends to the center of heaven and earth, yin and yang are evenly balanced, neither hot nor cold but cool—this is the *Pi* hexagram. Without advancing the yin tally, it is also called bathing.\"\n\nMaster Upper Yang said: \"In ordinary bathing, when yin and yang are in equilibrium and the qi of lead and mercury are at rest, the two qi naturally unite. At this time, one must not advance the fire nor move the tally, lest the elixir be harmed.\"",
      "overlap_context": "Golden Elixir* from the Immortal Master of Purple Yang, who instructed him to guard and be vigilant—only then did he attain the Dao.\n\nGuarding against danger and preventing loss is not merely one concern but encompasses several aspects. At the initial stage of gathering the medicine, when the sun and moon joyfully meet and the dragon and tiger are about to unite, during the moment of conflict, the *True Person* already hides in the deep abyss, floating and cautiously guarding within the compass.",
      "start_char": 2469,
      "end_char": 3707,
      "start_sentence": 101,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.86764478683472,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\修炼须知.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "唯宜洗心涤虑，以保养之，故谓之沐浴也。 且何谓沐浴？ 大修行人尽将平时忧愁思虑艰苦之心、执着贪爱之念，翛然脱去，浑无一毫牵挂，直要形如槁木，心若死灰，是谓沐浴也。 纯阳祖师曰：本性好清静，保养心猿定，丹阳祖师曰：水中火发休心景，雪裹花开减意春。 又曰：俗人无清静之心，道人无尘俗之心，是谓洗涤。 其时则近卯酉，其卦则云否泰，其候则属温凉，其象则为刑德。 至此则罢火守城，故谓之沐浴也。 《参同契》曰：候视加谨慎，审察调寒温。 周旋十二节，节尽更须亲。 《崔公入药镜》云：受气吉，防成凶，火候足，莫伤丹，天地灵，造化悭。 紫阳真人与白紫清云：及其沐浴法，卯酉时虚比。 盖不可执泥外象，当於药火到时而取也。 古歌云：刑德同生杀，加临二八门。 丹砂宜沐浴，神水灌灵根。 闭兑留金汞，禁关养魄魂。 不须行火候，炉裹自温温。 大修行人工夫到此，可不慎乎！ 生杀爻铢 紫阳真人曰：夫炼金液还丹者，要须洞晓阴阳，深达造化，追二气於黄道，会三性於元宫，攒簇五行，合和四象，龙吟虎啸，夫唱妇随。 昔我师曰：学道之士，得内外药物之真，两般作用之全，合大造化，方得所传，苟有毫发差殊，未免天地悬隔。 上阳子曰：生杀者，阴阳二物也，龙虎二物也。 龙乃阳中之阴而主生，故兴云致雨，润泽万物，而其中之阴能杀者也。 犹人分阳已尽而纯阴，则死矣。 虎乃阴中之阳而主杀，故呼风哮吼，常有杀心，而其中之阳能生者也。 犹人分阴已尽而纯阳，则仙矣。 夫阴阳二物者，顺则成人，逆则生丹。 故不为万物不为人，则成丹矣，是所谓生也。 且道生又生个什么？ 莫不是生天生地，莫不是生人生五行，莫不是生万物者乎。 莫不是有大灵通智慧，有大神圣变化者乎？ 且道杀又杀个什么？ 莫不是杀那无明烦恼底贼，莫不是杀傍门愚痴底贼？ 旌阳祖师以五童女剑杀之，纯阳帝君以三清剑杀之，佛祖以金刚王宝剑杀之，德山和尚以入门棒杀之。 故云护生须是杀，杀尽始安居。 祖师云：斩魑灭魅了长生。 魑者，痴也。 魅者，昧也。 若人早早杀了这愚痴暗昧底，则可以毕长生之道矣。 大修行人定知毫发差殊，不能成丹，切须洞晓也。 若悟阴阳生杀二物，何忧不仙矣。 至如所谓卦象爻铢之说，铢也者，将准之而定也； 爻也者，将效之而用也； 象也者，将像之而为也。 卦也者，犹挂以示人，使人以此而为则例也。 爻与铢者，明轻重也； 象与卦者，明进退也。 积三百八十四爻而成六十四卦，积三百八十四铢而成一十六两，谓一斤也。 斤足卦满，喻丹之将成也。 修行之人，务在知轻识浅，知重识深，知难识退，知易识进，不过以法金丹内外二药也。 《道德经》云：有无相生，难易相成。 又曰：图难於其易，为大於其细。 又曰：是以圣人犹难之，故终无难也。 犹以复震为采药之初，则半斤为入药之数。 如百爻之谓，以三十爻为文，七十爻为武者，则知采药之难也。 以卦足而药成，则丹足二八一斤之数。 故《火火记》言二百一十六，乃乾之策也； 十八八个足，乃一百四十四，坤之策也。 阴阳之数既足，金液之丹已成也。 修真七事 上阳子曰：道必日学，〔学〕必曰精而已矣。",
      "translated_text": "Here is the translation:\n\n---\n\nOne should only purify the heart and cleanse the mind to preserve and nurture it—this is called \"bathing.\"\n\nWhat, then, is bathing? For the great cultivator, it means wholly shedding the heart burdened by worldly cares, hardships, attachments, and desires—casting them off with effortless ease, leaving not a single thread of entanglement. The body must become like withered wood, the heart like dead ashes: this is bathing.\n\nMaster Pure Yang said: \"The original nature delights in clarity and stillness; preserve it by taming the monkey-mind.\" Master Dan Yang said: \"Fire arises in water—dismiss the mind’s scenery; flowers bloom in snow—lessen the spring of intent.\" He also said: \"The common person lacks a heart of purity; the Daoist lacks a heart of worldly dust—this is called washing and cleansing.\"\n\nAt this time, the hour approaches *mao* and *you*; the hexagrams are *Pi* and *Tai*; the phase belongs to warmth and coolness; the image is that of *xing* (punishment) and *de* (virtue). Here, one ceases the firing and guards the city—this is called bathing.\n\nThe *Cantong Qi* says:\n*\"Observe with utmost care, examine and adjust cold and warmth.\nCycle through the twelve nodes; when each is complete, attend closely again.\"*\n\nMaster Cui’s *Ruyao Jing* states:\n*\"Receiving qi is auspicious; guard against turning it ominous.\nWhen the fire timing is sufficient, do not harm the elixir.\nHeaven and earth are numinous, yet creation is niggardly.\"*\n\nTrue Man Zi Yang wrote to Bai Ziqing:\n*\"As for the bathing method, compare it to the empty hours of *mao* and *you*.\nYet do not cling to external appearances—take it when the medicine and fire arrive.\"*\n\nAn ancient song says:\n*\"Punishment and virtue together give life and death,\nArriving at the gates of two and eight.\nCinnabar should be bathed; divine water washes the numinous root.\nSeal the mouth to retain gold and mercury; guard the pass to nurture spirit and soul.\nNo need to advance the fire timing—the furnace remains gently warm.\"*\n\nWhen the great cultivator’s work reaches this point, how can one not be cautious!\n\n**The Scales of Life and Death**\nTrue Man Zi Yang said: \"Those who refine the golden liquid and returning elixir must thoroughly understand yin and yang, deeply penetrate the workings of creation, pursue the two qi along the Yellow Path, unite the three natures in the primordial palace, gather the five phases, harmonize the four images, where dragon intones and tiger roars, husband sings and wife follows.\"\n\nMy former teacher said: \"Only when a Daoist adept obtains the truth of inner and outer medicines, masters their dual functions, and aligns with the great workings of creation can they receive the transmission. If there is even a hair’s breadth of deviation, heaven and earth remain far apart.\"\n\nMaster Upper Yang said: \"Life and death are the two things of yin and yang, the two things of dragon and tiger. The dragon, yang within yin, governs life—stirring clouds and summoning rain to nourish the myriad things—yet its inner yin can kill. Like a person whose yang is exhausted and pure yin remains, they die. The tiger, yin within yang, governs death—howling winds and roaring with a constant killing intent—yet its inner yang can give life. Like a person whose yin is exhausted and pure yang remains, they become immortal.\n\nThe two things of yin and yang, when flowing in sequence, form humans; when reversed, they generate the elixir. If they do not become the myriad things or humans, they form the elixir—this is what is meant by life.\n\nWhat, then, does life give life to? Is it not life for heaven and earth, life for humans and the five phases, life for the myriad things? Is it not the possession of great spiritual penetration and wisdom, of vast divine and sacred transformations?\n\nWhat, then, does death kill? Is it not the thief of ignorance and affliction? Is it not the thief of heterodox paths and foolish delusion? Ancestor Jing Yang slew them with the swords of five maidens; Emperor Pure Yang, with the Three Clarities’ sword; the Buddha, with the Vajra King’s precious sword; Master Deshan, with the staff at the gate. Thus it is said: to protect life, one must kill; only when all is slain can one dwell in peace.\n\nAn ancestor said: 'Slaying demons and banishing specters leads to longevity.' *Chi* is stupidity; *mei* is delusion. If one early slays this foolish, dark, and deluded self, one may complete the Way of eternal life. The great cultivator must know that even a hair’s deviation prevents the elixir’s formation—one must thoroughly understand this. If one awakens to the two things of yin-yang and life-death, what worry is there of not attaining immortality?\n\nAs for the explanations of hexagrams, lines, and weights: *zhu* serves as the standard for measurement; *yao* serves as the model for application; *xiang* serves as the image to emulate; *gua* serves as the hanging sign to guide others, establishing a rule for all to follow. *Yao* and *zhu* clarify lightness and weight; *xiang* and *gua* clarify advance and retreat.\n\nAccumulating three hundred eighty-four lines forms sixty-four hexagrams; accumulating three hundred eighty-four *zhu* forms sixteen ounces—one *jin*. When the *jin* is complete and the hexagrams are full, it signifies the elixir’s near completion. The cultivator must strive to know lightness and recognize shallowness, know weight and recognize depth, know difficulty and recognize retreat, know ease and recognize advance—all to master the inner and outer medicines of the golden elixir.\n\nThe *Daode Jing* says: \"Being and non-being give rise to each other; difficulty and ease complete each other.\" It also says: \"Plan for difficulty while it is easy; achieve greatness while it is small.\" And: \"Thus the sage treats things as difficult, and so ultimately encounters no difficulty.\"\n\nTaking *Fu* and *Zhen* as the beginning of gathering medicine, half a *jin* is the measure for entering the medicine. Regarding the saying of \"one hundred lines,\" thirty lines represent the civil and seventy the martial—thus one knows the difficulty of gathering medicine. When the hexagrams are complete and the medicine is formed, the elixir reaches the measure of two eights, one *jin*.\n\nThus the *Huohuo Ji* speaks of two hundred sixteen, the count of *Qian*; eighteen eights make one hundred forty-four, the count of *Kun*. When the numbers of yin and yang are complete, the golden liquid elixir is formed.\n\n**The Seven Matters of Cultivating the Real**\nMaster Upper Yang said: \"The Way must be studied daily; study must be daily refined.\"",
      "overlap_context": "ncing the fire timing, it is called bathing. When yin qi descends to the center of heaven and earth, yin and yang are evenly balanced, neither hot nor cold but cool—this is the *Pi* hexagram. Without advancing the yin tally, it is also called bathing.\"\n\nMaster Upper Yang said: \"In ordinary bathing, when yin and yang are in equilibrium and the qi of lead and mercury are at rest, the two qi naturally unite. At this time, one must not advance the fire nor move the tally, lest the elixir be harmed.\"",
      "start_char": 3707,
      "end_char": 4925,
      "start_sentence": 156,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.06699514389038,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\修炼须知.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "老子曰。 吾非圣人，学而得之。 孔子曰：十室之邑，必有忠信如丘者焉，不如丘之好学也。 〔又〕曰：我学不厌，而教不倦也。 〔又〕曰：君子学道则爱人，小人学道则易使也。 《南华经》曰：南伯子葵问乎女偶曰：道可得学耶？ 偶曰：恶〔恶〕可，子非其人也。 夫卜梁倚有圣人之才，而无圣人之道，我有圣人之道，而无圣人之才。 吾欲以教之，庶几其果为圣人乎？ 不然，以圣人之道而告圣人之才，亦易矣。 孔子曰：生而知之者，上也； 学而知之者，次也； 困而学之，又其次也； 困而不学，民斯为下矣。 释迦闻半偈而欲舍身，黄帝顺下风膝行而进，问广成子：治身奈何而可以长久？ 夫古之大，圣，亦未有不学而能知大道者乎？ 今时人也，而多妄诞，不肯下问，何时而得闻斯道也哉。 上阳子曰：道有立谈，道有心授。 君臣也，父子也，兄弟也，夫妇也，朋友也，是纲常之道也。 此可以立谈而非心授也。 所言心授者，天命之谓性，率性之谓道，此可以心授而不可以立谈也。 率性之道，即孔子一贯者也，即孟子集义所生者也。 夫纲常之道，虽童稚亦可训之。 彼有国有邦者，置所司以掌其纲常之道，万世不易者也。 至如率性集义之道，前贤注疏，略不及焉。 若贤人君子遇圣师口授而不惊疑，以集义率性之道而修之，是则谓之大圣也，方知纲常之道在其中矣。 炼丹也，砂硫也，水银也，是修炼之道也。 此可以立谈而非心授也。 所言心授者，无为而不为也，为之而有以为也。 此可以心授而不可以立谈也。 无为有为之道，即金丹大道也。 夫丹炉修炼凡砂水银之道，虽愚夫愚妇亦可炼之，故可立谈。 至如先天真铅有为之道，虽上士至人遇师口授，亦不免疑焉。 若上士至人得师，指示金丹有为之道，勤而修之，是之谓神仙也。 顽坐也，守性也，持斋也，是坐禅之道也。 此可以立谈也，而非心授者。 唯正法眼藏，涅盘妙心，直指人心，见性成佛之道，此可以心授而不可以立谈也。 正法眼藏，直指人心，即最上一乘之道也。 夫持斋坐禅，虽庸人乳子亦可立谈。 至如一乘之道，虽利根上智，於佛祖言下得证，犹不免疑焉。 是以灵山会上，五千退席，五祖佛法不付神秀而与老卢，是谓可以心授而不可以立谈也。 韩湘得仙，而昌黎有收吾骨之句，岂昌黎是下根之器哉。 朱晦庵之遍参，而崔子虚不与以道，岂晦庵之不欲者哉。 是云道不可以立谈，可立谈者非大道也。 葛仙翁六十始遇师，白玉蟾六十始遇修炼须知师，皆成道也。 是为道有心授者也。 上阳子曰：道有三悟。 孔子翼易曰：近取诸身，远取诸物。 是言道也，大修行人从近与远及身与物四者求之，眼下自有悟处。 老君《常清静经》曰：内观其心，心无其心； 外观其形，形无其形； 远观其物，物无其物。 是言道也，大修行人从内外远及心形物六者求之，日下便有悟处。 佛祖云：不是心、不是佛、不是物。 是言道也，大修行人从心佛物三者求之，脚腿下即有悟处。 是之谓道有三悟也。 且以三教圣师，皆晓以世人从物求道，以道为物，须当审思，切勿容易看过了也。 盖道者乃万物之一物也，而物者乃大道之一物也。 故老子云：有名，万物之母。 又云：渊兮似万物之宗。",
      "translated_text": "Laozi said: \"I am no sage, yet through learning I attained it.\"\nConfucius said: \"In a hamlet of ten households, there must be one as loyal and trustworthy as I, yet none matches my love of learning.\" He also said: \"I never tire of learning, nor weary of teaching.\" And again: \"When a noble person studies the Dao, they come to love others; when a petty person studies the Dao, they become easier to employ.\"\n\nThe *Nanhua Sutra* records:\nNanbo Zikui asked Nü’ou: \"Can the Dao be learned?\"\nNü’ou replied: \"How could it not be? But you are not the right person. Though Bu Liangyi possessed the talent of a sage, he lacked the Dao of a sage; I possess the Dao of a sage, yet lack the talent of a sage. If I were to teach him, might he not become a sage? Otherwise, imparting the Dao of a sage to one with the talent of a sage would be easy indeed.\"\n\nConfucius said: \"Those who know from birth are the highest; those who know through learning come next; those who learn through hardship come after; those who suffer hardship yet do not learn—such people are the lowest.\"\n\nŚākyamuni, upon hearing half a verse, was willing to sacrifice his body. The Yellow Emperor, humbly following the wind and crawling forward on his knees, asked Guangchengzi: \"How should one cultivate the body to attain longevity?\"\n\nTruly, even the greatest sages of antiquity never came to know the Great Dao without learning. Yet people today are often reckless and deluded, unwilling to humble themselves and ask—when will they ever hear of this Dao?\n\nMaster Upper Yang said: \"The Dao may be conveyed in casual conversation, or transmitted through the heart. The relationships of ruler and minister, father and son, elder and younger brother, husband and wife, and friends—these are the unchanging principles of human relations. These may be discussed in conversation, but not transmitted through the heart.\n\nWhat is meant by 'transmission through the heart'? 'Heaven’s mandate is called nature; following nature is called the Dao.' This can be transmitted through the heart, but not in casual conversation. Following nature is what Confucius meant by 'the one thread'; it is what Mencius meant by 'the vitality that arises from accumulating rightness.'\n\nThe principles of human relations, though even a child can be taught them, are entrusted to officials by those who govern states and nations, enduring unchanged for ten thousand generations. Yet as for the Dao of following nature and accumulating rightness, the commentaries of former worthies barely touch upon it. If a worthy or noble person meets a sagely teacher and receives oral instruction without doubt, cultivating the Dao of following nature and accumulating rightness, they may be called a great sage—and only then will they understand that the principles of human relations are contained within it.\n\nAlchemy, cinnabar, sulfur, and mercury—these are the methods of refinement. These may be discussed in conversation, but not transmitted through the heart. What is meant by 'transmission through the heart'? 'Non-action that leaves nothing undone; action that accomplishes all.' This can be transmitted through the heart, but not in casual conversation. The Dao of non-action and action is the Great Dao of the Golden Elixir.\n\nThe methods of refining furnaces, ordinary cinnabar, and mercury—even fools and simple women can practice them, so they may be discussed in conversation. But as for the Dao of primordial true lead and action, even the most advanced adepts, upon receiving oral instruction from a teacher, cannot avoid doubt. If such an adept meets a teacher who points out the Dao of action in the Golden Elixir and diligently cultivates it, they may be called an immortal.\n\nSitting in dull meditation, guarding one’s nature, and observing fasts—these are the methods of seated meditation. These may be discussed in conversation, but not transmitted through the heart. Only the treasury of the true Dharma-eye, the wondrous mind of nirvana, the direct pointing to the human mind, and the Dao of seeing one’s nature and becoming a buddha—these can be transmitted through the heart, but not in casual conversation. The treasury of the true Dharma-eye and the direct pointing to the human mind are the supreme vehicle of the Dao.\n\nThe practices of fasting and seated meditation—even the dullest and most ignorant can discuss them in conversation. But as for the supreme vehicle, even those of sharpest faculties and highest wisdom, upon hearing the words of buddhas and patriarchs and attaining realization, cannot avoid doubt. Thus, at the assembly on Vulture Peak, five thousand left their seats; the Fifth Patriarch did not transmit the Dharma to Shenxiu but to the old man Huineng. This is what is meant by 'transmission through the heart, not in casual conversation.'\n\nWhen Han Xiang attained immortality, Han Yu wrote of 'gathering my bones'—was Han Yu of such dull capacity? When Zhu Xi sought instruction far and wide, Cui Zixu refused to teach him the Dao—was it that Zhu Xi did not desire it? This is to say: the Dao cannot be conveyed in casual conversation; what can be so conveyed is not the Great Dao.\n\nWhen Ge Xianweng was sixty, he finally met a teacher; when Bai Yuchan was sixty, he finally learned what must be known to practice refinement—yet both attained the Dao. This is what is meant by 'the Dao transmitted through the heart.'\n\nMaster Upper Yang said: \"The Dao has three awakenings.\"\n\nConfucius, in his commentary on the *Yijing*, said: \"Draw near and take from the self; draw far and take from things.\" This speaks of the Dao. The great practitioner seeks it in the four: near and far, self and things—right before their eyes, there is a place of awakening.\n\nLaozi’s *Classic of Constant Clarity and Stillness* says: \"Look within at the heart—there is no heart; look without at the form—there is no form; look far at things—there are no things.\" This speaks of the Dao. The great practitioner seeks it in the six: within and without, far, heart, form, and things—right now, there is a place of awakening.\n\nThe buddha-ancestors say: \"Not mind, not buddha, not things.\" This speaks of the Dao. The great practitioner seeks it in the three: mind, buddha, and things—right beneath their feet, there is a place of awakening. These are what is meant by the Dao’s three awakenings.\n\nMoreover, the sagely teachers of the Three Teachings all warn that worldly people seek the Dao in things, taking the Dao as a thing. One must reflect carefully and not pass over this lightly. For the Dao is one thing among the ten thousand things, yet the ten thousand things are one thing within the Great Dao.\n\nThus Laozi said: \"The named is the mother of the ten thousand things.\" And again: \"Abysmal! It seems the ancestor of the ten thousand things.\"",
      "overlap_context": "culty of gathering medicine. When the hexagrams are complete and the medicine is formed, the elixir reaches the measure of two eights, one *jin*.\n\nThus the *Huohuo Ji* speaks of two hundred sixteen, the count of *Qian*; eighteen eights make one hundred forty-four, the count of *Kun*. When the numbers of yin and yang are complete, the golden liquid elixir is formed.\n\n**The Seven Matters of Cultivating the Real**\nMaster Upper Yang said: \"The Way must be studied daily; study must be daily refined.\"",
      "start_char": 4925,
      "end_char": 6136,
      "start_sentence": 216,
      "end_sentence": 275,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.708691120147705,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\修炼须知.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "是皆以物而名道也。 悯夫一切常人，唯只寻常，不肯寻上。 或以孤阴寡阳摄养兀坐，或以持斋守戒离俗绝尘，或以凡砂铅银缎炼炉火。 凡此皆误而非悟也。 能於是编言下投机，须有一个奇特之大悟处矣。 上阳子曰：道有三传焉。 上焉者，文人善士寡言好善，能弃富贵，唯急於身，是云上士，宜传道焉。 中焉者，质而不文，闻道笃信，能割恩爱，力行精进，不顾是非，〔是〕曰中士，乃有上士之志，宜传道焉。 下焉者，愚而信实，乐善弃恶，舍己从人，勇於敢为，是云下士，其志可尚，宜传道焉。 故得此道者，莫不勇猛精进，莫不坚固智慧，莫不遏恶扬善。 夫善之一字，乃入道之梯航也。 是以常人耳常闻善，则肾不走精； 口常语善，则心不失神； 鼻常嗅善，则肺能安魄； 眼常视善，则肝能育魂； 意常思善，则脾胃生气，黄中通理。 大修行人，奚可以不善欤！ 上阳子曰：道有三戒。 凡学道者，心虽慕向，而乃骄其富贵，不肯下问，不立盟誓，是谓奸谲，戒而莫与； 次学道者，略闻傍门小法，唯事强辩，以逞乾慧，是为诋眩，戒而莫与； 三学道者，疑信相半，不以生死为忧，重财轻身，是不知命，戒而莫与。 上阳子曰：道有三去焉。 一者虽智人材士，而好论状古人，是谓无德，宜去之也； 二者虽善人胜士，而好诋排是非，妄议今古，是谓不广，宜去之也； 三者虽好道向佛，而口谈心非，背真就伪，是谓无实，宜去之也。 上阳子曰：道有四异。 四者何也？ 酒、色、财、气是也。 一切常人饮少辄醉，平时端庄化为戏谑，平时正直化为谀佞，平时廉洁化为贪淫，平时谦和化为狂傲，因酒丧德，逃失性真。 犹如山薮所藏者多，平时罔觉，忽然野火，山赪薮热，千妖百怪无所逃避。 人若无酒，不失所行； 山若无火，妖怪藏形。 大修行人戒饮静坐，敛精怡神，不为酒乱，此为异耳。 世之声色败人者多，一切常人肆情纵欲，贪着无厌。 如彼蜉蝣以灯光为色，以焰为药，投光赴焰，来往不舍，贪着於焰，趋灯而扑。 人亦如是，着於爱欲，精气以竭而情难割，情牵神失，意动气散，神气既丧，命亦随逝。 色之为物，本无锋刃，而其杀人甚於刀戟。 大修行人似同而异，酒肆淫房，未尝不戏，却乃非色为色，知色不色，不色中色，色无定色，此谓异耳。 云何非色为色？ 如彼莲#3花，香引十里，花却为色，香即为声。 大修行人不贵其香，不贵其花，而所贵者唯贵其信。 信即为莲#4花之与香，不能长留； 莲#5实可久，实能安心，此故云信，是以贵之。 故太上云：其精甚真，其中有信，犹此意也。 何谓知色不色？ 如彼河水，清流涓涓，水以济舟，至于彼岸，其舟与水，悉皆外物。 祖师不云：道成而后，丹房器皿委之而去。 此之谓也。 何为不色中色？",
      "translated_text": "All these name the Dao through things. Pity the common folk—ever ordinary, unwilling to seek what is above. Some cultivate solitary yin and scant yang, sitting rigid in stillness; some keep fasts, hold precepts, and withdraw from the world to escape dust; some refine cinnabar, lead, silver, and silk in furnace fires. All these are errors, not awakenings. If one can strike the mark beneath the words of this compilation, there must be a singular, extraordinary great awakening.\n\nMaster Shangyang said: The Dao is transmitted in three ways. The highest: scholars and virtuous gentlemen, sparing of speech and fond of goodness, able to renounce wealth and honor, urgent only for their own person—these are called superior persons, fit to receive the Dao. The middle: plain and unadorned, they hear the Dao and believe deeply, able to sever ties of affection, practicing with vigor and perseverance, heedless of right and wrong—these are called middling persons, possessing the aspiration of superior persons, fit to receive the Dao. The lowest: simple and sincere, they delight in goodness and cast off evil, yielding themselves to others, bold in daring action—these are called inferior persons, their aspiration worthy of esteem, fit to receive the Dao. Thus those who attain this Dao are all bold and vigorous in practice, all steadfast in wisdom, all restraining evil and exalting goodness.\n\nThe word \"goodness\" is the ladder and ferry to enter the Dao. Therefore, when the ears of common folk constantly hear goodness, the kidneys do not leak essence; when the mouth constantly speaks goodness, the heart does not lose spirit; when the nose constantly smells goodness, the lungs stabilize the po; when the eyes constantly see goodness, the liver nurtures the hun; when the mind constantly thinks goodness, the spleen and stomach generate qi, and the yellow center flows with principle. Great practitioners—how can they not be good?\n\nMaster Shangyang said: The Dao has three precepts. For those who study the Dao: though their hearts yearn for it, they may flaunt their wealth and rank, unwilling to humble themselves to ask, refusing to take vows—these are called deceitful and cunning, to be precepted against and not transmitted to. Next, those who study the Dao: having heard minor arts of side doors, they engage in empty debate to display dry wisdom—these are called slanderous and deluded, to be precepted against and not transmitted to. Third, those who study the Dao: half in doubt, half in faith, not concerned with life and death, valuing wealth over their own bodies—these do not know fate, to be precepted against and not transmitted to.\n\nMaster Shangyang said: The Dao has three things to cast away. First, though one may be a wise and talented scholar, if fond of discussing the faults of ancients, this is called lacking virtue—it should be cast away. Second, though one may be a good and outstanding person, if fond of slandering and disputing right and wrong, recklessly judging past and present, this is called lacking breadth—it should be cast away. Third, though one may be devoted to the Dao and inclined toward the Buddha, if their words do not match their heart, turning from truth to falsehood, this is called lacking substance—it should be cast away.\n\nMaster Shangyang said: The Dao has four distinctions. What are the four? Wine, sex, wealth, and temper. Common folk, when drinking even a little, become drunk: their usual dignity turns to jest, their usual integrity to flattery, their usual honesty to greed and lewdness, their usual modesty to arrogance. Through wine, they lose virtue and flee their true nature. Like a mountain or marsh hiding many things, ordinarily unnoticed, suddenly wildfire blazes, the mountain reddens and the marsh heats, and a thousand demons and hundred monsters have nowhere to flee. If people do not drink, they do not lose their conduct; if mountains do not burn, demons hide their forms. Great practitioners, abstaining from drink and sitting in stillness, gather essence and harmonize spirit, not disordered by wine—this is the distinction.\n\nIn the world, many are ruined by sensual pleasures. Common folk indulge their passions and desires without restraint, insatiably attached. Like mayflies drawn to lamplight, taking flame for medicine, they rush into the fire, coming and going without cease, attached to the blaze, hurling themselves at the lamp. People are the same: clinging to love and desire, their essence and qi are exhausted, yet their passions are hard to sever. Passion drags spirit away, intention stirs and qi scatters; when spirit and qi are lost, life follows in departure. Sex, though lacking blade or spear, kills more surely than halberd or pike. Great practitioners, seemingly the same yet distinct: in wine shops and brothels, they do not refrain from play, yet they do not take sex as sex, knowing sex yet not sex, finding sex within not-sex, sex without fixed sex—this is the distinction.\n\nWhat is meant by \"not taking sex as sex\"? Like the lotus flower, its fragrance wafting ten miles—though the flower is sex, its scent is sound. Great practitioners do not value its fragrance, do not value its flower; what they value is only its trustworthiness. Trust is like the lotus flower and its scent, which cannot long remain; the lotus seed endures, the seed can settle the heart—thus it is called trust, and so it is valued. Therefore, the Most High said: \"Its essence is most true, within it there is trust\"—this is the meaning.\n\nWhat is meant by \"knowing sex yet not sex\"? Like river water, its clear flow trickling, water ferries the boat to the far shore—yet both boat and water are external things. The patriarchs did not say: \"When the Dao is accomplished, the elixir chamber’s vessels are abandoned and left behind\"? This is the meaning.\n\nWhat is \"finding sex within not-sex\"?",
      "overlap_context": "hat is meant by the Dao’s three awakenings.\n\nMoreover, the sagely teachers of the Three Teachings all warn that worldly people seek the Dao in things, taking the Dao as a thing. One must reflect carefully and not pass over this lightly. For the Dao is one thing among the ten thousand things, yet the ten thousand things are one thing within the Great Dao.\n\nThus Laozi said: \"The named is the mother of the ten thousand things.\" And again: \"Abysmal! It seems the ancestor of the ten thousand things.\"",
      "start_char": 6136,
      "end_char": 7188,
      "start_sentence": 276,
      "end_sentence": 324,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.151044607162476,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\修炼须知.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "如彼枯旱，阴云四兴，甘雨骤至，须臾复霁。 若乃求其向来雨云，一无所见，而唯五谷万物蒙润发生。 《维摩经》云：游诸四衢，饶益众生，入诸淫舍，示欲之道。 此之谓也。 色无定色，其义云何？ 如彼宝月，岁十二度，朔望弦晦，无定之中而有大定。 上阳子曰：当评论之，三日生魄，色以大定； 八日半盈，是云上弦； 十五对望，圆明徧满，凡彼人间莫不瞻仰，而其光辉圆而复缺，乃不长在。 若人再欲观其光彩，须别索求生魄弦望，是故《易》曰：与天地合其德，日月合其明。 又曰：原始要终，故知死生之说。 此之谓无定色也。 一切常人贪财无厌，积而不散。 为儿孙计，不悟天地日月盈虚消息之理。 如彼石崇，富敌於国，财聚怨结，身戮家丧，祸及绿珠。 大修行人既得其财，即以求药成丹，丹成而后尽散其余，此为异耳。 一切常人争尽闲气，恼乱身心，好讼欺贫，量可即夺，不顾因果生死，不悟悔吝凶危，皆由此起。 所争者少，所丧者多。 如彼项王，英雄盖世，卒之乌江，身死尸分，后来视之，为汉鹰犬。 人之所争，况不及乎。 大修行人所争之气，非人所知，是先天地真一之气。 上阳子曰：修仙作佛，皆此先天真一之气，若非是气，不系修行，不能长生，此为异耳。 修炼须知竟 #1『而』原作『面』，据文义改。 #2『资』原作『姿』，据文义改。 #3#4#5『莲』原作『连』与『蓬』，据文义改。",
      "translated_text": "As in a great drought, dark clouds gather on all sides, and sweet rain suddenly falls—yet in an instant, the sky clears again. If one seeks the rainclouds of before, nothing remains to be seen; only the myriad grains and plants are moistened and quickened to life. The *Vimalakīrti Sutra* says: \"Roaming the four crossroads, benefiting sentient beings; entering the houses of lust, demonstrating the Way of desire.\" This is the meaning.\n\nWhat is meant by \"form having no fixed form\"?\nLike the precious moon, twelve times a year—new moon, full moon, crescent, and waning—within its ceaseless change, there is great constancy. Master Shangyang said: \"When assessing it, on the third day the first sliver appears, and form is greatly settled; on the eighth day, half-full, this is called the first quarter; on the fifteenth, full and bright, its radiance fills all—none among mortals do not gaze upon it. Yet its light, round and then incomplete, does not long endure. If one wishes to see its brilliance again, one must seek anew the waxing crescent, the full moon. Thus the *Book of Changes* says: 'Its virtue joins with heaven and earth, its brightness joins with sun and moon.' It also says: 'Tracing the beginning to the end, one knows the discourse on life and death.'\" This is what is meant by \"no fixed form.\"\n\nAll ordinary people covet wealth insatiably, hoarding without dispersing. Planning for children and grandchildren, they do not comprehend the principle of heaven and earth, sun and moon—waxing and waning, ebb and flow. Like Shi Chong, whose wealth rivaled the state, amassing riches bred resentment; he was executed, his family ruined, and disaster befell Green Pearl. The great practitioner, having obtained wealth, immediately uses it to seek medicine and refine the elixir. Once the elixir is complete, all the rest is dispersed—this is the difference.\n\nAll ordinary people exhaust themselves in petty strife, disturbing body and mind. Fond of litigation, they deceive the poor, seizing what they can, heedless of karmic consequences or the cycle of life and death. Unaware of regret, misfortune, and peril, all arise from this. What they contend for is little; what they lose is much. Like Xiang Yu, peerless hero of his age, who in the end perished at Wu River—his body torn apart, his corpse divided. Later generations saw him as but a hound or hawk for Han. What men contend for is far less than this.\n\nThe qi that the great practitioner contends for is not what others know—it is the primordial True Unity of heaven and earth. Master Shangyang said: \"To cultivate immortality or become a buddha, it is all through this primordial True Unity. Without this qi, no practice can be undertaken, and one cannot attain long life.\" This is the difference.",
      "overlap_context": " it is called trust, and so it is valued. Therefore, the Most High said: \"Its essence is most true, within it there is trust\"—this is the meaning.\n\nWhat is meant by \"knowing sex yet not sex\"? Like river water, its clear flow trickling, water ferries the boat to the far shore—yet both boat and water are external things. The patriarchs did not say: \"When the Dao is accomplished, the elixir chamber’s vessels are abandoned and left behind\"? This is the meaning.\n\nWhat is \"finding sex within not-sex\"?",
      "start_char": 7188,
      "end_char": 7741,
      "start_sentence": 325,
      "end_sentence": 350,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.447399377822876,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\修炼须知.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}