{
  "source_id": "元辰章醮立成历",
  "source_file": "chunked_daozang\\元辰章醮立成历.json",
  "total_chunks": 14,
  "total_original_chars": 11812,
  "total_translated_chars": 71115,
  "total_translation_time": 349.7798149585724,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Complete Ritual Manual for Yuanchen Offerings and Jiao Ceremonies, Volume One: Altar Diagrams and Methods**\n\n**Yuanchen Altar with Four Gates and Talismans**\nThe talismans for the four gates are to be hung above each respective gate. Construct the altar upon a yellow platform, or establish it in a purified space within the central courtyard. The altar shall be square, measuring twenty-four *chi* on each side. Place an incense burner in each of the five directions, and suspend banners, canopies, and lamps in the corresponding directional colors—seven for each direction, totaling twenty-eight, with an additional seven within each inner direction. The trays marked with numbers one and two are for pouring libations of wine.\n\nProceed in proper sequence, erecting placards and affixing them, with left and right paths distinct to prevent confusion.\n\n**Offering Pledges (Zhangxin)**\n- **Altar-securing pledge money:** 1,200 *wen*\n- **White rice:** 1 *shi* and 2 *dou*\n- **White silk:** 40 *chi*\n- **Weights (for scales):** 120 pieces\n- **Pure oil:** 1 *dou* and 2 *sheng*\n- **Green silk thread:** 120 *chi*\n- **Golden figurine:** 1\n- **Golden rings:** 1 pair\n- **Scribing knife:** 1\n- **Paper:** 100 sheets\n- **Brushes:** 2\n- **Inkstick:** 1\n- **Pure mat:** 1\n- **Cinnabar:** 1 *liang*\n- **Incense:** 1 *jin*\n- **Silver ingot:** 1\n\nThe above sixteen items constitute the ritual pledges for the Celestial Officials’ ceremony, to be prepared by each participant. Only couples born in the same year, sharing the same celestial mansion and heavenly府, may combine their offerings, adjusting quantities according to their means.\n\n**Jiao Ceremony Method**\nFive-directional incense altars.\n\n**Jiao Ceremony Requisites**\n\n- **Incense pouches (if not using old ones):** square-colored kerchiefs\n- **Incense burners:** 5, with lidded boxes\n- **Wine vessels:** 6, with ladles\n- **Five-colored canopies and banners**\n- **Five Emperors’ great banners:** 5 heads\n- **White rice:** 1 large *dou*\n- **Jujubes, chestnuts, and assorted fruits:** 1 *sheng* each; seasonal fresh fruits preferred\n- **Five-colored patterned silks:** quantities corresponding to the directions\n- **Fine wine:** 5 *dou*\n- **Dried white meat:** 3 *jin*, fried until fragrant\n- **Rice cakes and pastries:** 3 varieties each, preferably mixed with honey\n- **Torches:** 16, each 1 *zhang* and 2 *chi* long, bound with three sections of thatch\n- **Left-hand ropes:** 26 *zhang*\n- **Lamps:** 36, with torches\n- **Twenty-eight lunar mansions of the five directions, plus seven central mansions:** 1 additional bowl lamp\n- **Pure mats and bamboo trays:** 13\n- **Ritual mats of white cloth:** 2 bolts\n- **Hand-washing basins and fermented beans:** 5 *sheng* each\n- **Plates for the five directions:** 49 in total\n  - **Within the altar:** 12\n  - **Five Emperors:** 5\n  - **Northern Dipper:** 7\n  - **Three Terraces:** 12\n  - **Seasonal deities:** 24\n- **Cups:** 86 in total\n  - **Inner cups:** 72\n  - **Outer cups:** 14\n\nThe above Jiao ceremony implements and food offerings must be arranged with utmost purity, sweetness, and excellence. All prepared meals must be made after bathing with clean, fragrant water. If any grain-based food is not refined, it should not be included.\n\nOnce the arrangement is complete, proceed to pour the wine:\n1. Begin with the Five Emperors’ plates, starting from the east and circling left.\n2. Next, pour for the Seven Stars, beginning with *Kui* and proceeding toward *Gang*.\n3. Then, pour for the Three Terraces, moving left.\n4. Next, pour for the twelve seasonal deities, starting from *Hai* and *Zi*, circling left to completion.\n5. Finally, pour for the twenty-eight lunar mansions, beginning with *Jiao* in the east and circling left to *Zhen*, completing three rounds of libation.\n\nThen, close your eyes and inwardly visualize the gods and spirits of heaven and earth, all arrayed in solemn assembly, before proceeding.\n\nNext, recite the torch talisman and incantation:\n*\"Your servant humbly invokes the Straight-Command Talisman Generals, the Lords of Jia-Zi, those on duty this year, this month, this day, this hour. So-and-so enters the oratory to present a memorial, severing all demonic influences—slay the evil! Swiftly, swiftly, as in law and decree!\"*\n\nThen, facing the Heavenly Gate, recite the incantation:\n\nThe heavens unfold, the earth expands—ghostly paths perish.\nToday I establish the altar; your servant desires to present a memorial.\nAt the northwest quadrant, the center of *Xu* and *Hai*,\nHere lies the Heavenly Gate, seizing and recording all inauspiciousness.\nSwiftly, swiftly, as in the statutes and decrees of the Most High Lord Lao!\n\nNext, facing the Earthly Portal, recite the incantation:\nVital *qi* flows unobstructed—hundreds of demons and myriad spirits\nDo not share the truth’s nature.\nToday I present a memorial, having established the altar ground.\nAt the southeast quadrant, the center of *Chen* and *Si*,\nHere lies the Earthly Portal, gathering and recording all misfortune.\nSwiftly, swiftly, as in the statutes and decrees of the Most High Lord Lao!\n\nNext, facing the Ghost Gate, recite the incantation:\nYang’s light streams radiant—no demon dares arise.\nNow I desire to present a memorial, first establishing the altar court.\nAt the northeast quadrant, the center of *Chou* and *Yin*,\nHere lies the Ghost Gate, examining ghosts and seizing demonic spirits.\nSwiftly, swiftly, as in the statutes and decrees of the Most High Lord Lao!\n\nNext, the Human Gate incantation:\nEmerging from yin, entering yang—the Most High sends me forth.\nThe five viscera unfold; the great spirits hear this.\nAll hasten to don solemn attire; today I present a memorial.\nAt the southwest quadrant, the center of *Shen* and *Wei*,\nGathering and capturing all ghosts—who dares oppose?\nSwiftly, swiftly, as in the statutes and decrees of the Most High Lord Lao!\n\nNext, enter the altar through the Heavenly Gate, proceeding to the eastern incense table. Offer incense and strike the teeth nine times. Recite:\nThe nine *qi* of the east, the Azure Heaven’s bright star,\nGreat spirits radiate, illuminating the eastern quarter with penetrating light.\nNine gates turn like candles; yang’s light sweeps away filth and miasma.\nThe Luminous Youth attends, guarding my hall.\nSubduing eastern demons, reporting to the Imperial Lord,\nUpholding the true Dao, the vermilion script of jade.\nThe nine heavens’ talismanic command dispatches dragon couriers.\nAll under heaven is pacified; I attain transcendence.\n\nProceed to the southern incense table. Offer incense and strike the teeth three times. Recite:\nThe Cinnabar Heaven of the south, threefold black radiance flowing,\nThe Fire Star revolves like a candle, penetrating the Great Yang.\nAbove dwell the crimson spirits, the Luminous Youths.\nCommanding the fire soldiers, guarding the three palaces,\nSlaying eastern demons, severing demon kings.\nAs the Northern Emperor decrees, the eight winds of fire surge.\nInterlocking bells blaze—who dares disobey?\nThe true Dao flows; I receive supreme merit.\nPreserving heaven’s longevity, enduring through kalpas without end.\n\nProceed to the western incense table. Offer incense and strike the teeth seven times. Recite:\nThe seven *qi* of the west, the White Heaven’s Great White,\nFlowing essence shines brilliantly; the Metal Gate gleams.\nWithin the Great Darkness dwells the White Sovereign, named Imperial Spirit.\nProtecting and pacifying spirits, guarding my form,\nSevering demonic roots, the kingly Dao shines clearly.\nPalaces are ordered; the three luminaries align.\nThe Dao harmonizes with nature; I ascend to the Purple Court.\nThe numinous treasure’s talismanic command universally benefits all beings.\nMerit extends to all; heaven and earth attain peace.\n\nProceed to the northern incense table. Offer incense and strike the teeth five times. Recite:\nThe Mysterious Heaven of the north, five *qi* meandering,\nThe Chronogram Star blazes, illuminating the Supreme Subtlety.\nThe *qi*-spirit’s honored deity, clad in flying dark feathers,\nGuards the five gates, inspecting essences and capturing transgressors.\nWho dares test me? The Falling Star severs and crushes.\nAs the royal talisman proclaims, the eight mights of divine truth,\nDemon gates close; the true Dao shines forth.\nIlluminating my body, the three lights unite in splendor.\nI spur the void and ride the floating; my form ascends in immortal flight.\n\nProceed to the central incense table. Offer incense and strike the teeth twelve times. Recite:\nThe Yellow Center of the center, governing *qi* and unifying all,\nThe Mysterious True Star of the Pole shines forth with flowing radiance.\nNine Heavenly Luminous Youths, twelve in number,\nPrimal *qi* and yang essence flame upward in vermilion smoke.\nPenetrating this dwelling and my body,\nHundreds of demons are cast down; myriad ghosts are slain.\nThe Central Mountain’s divine incantation universally commands.\nThe five spirits pacify; my body ascends as an immortal.\n\nAdditionally, the five directional incantations may be employed as before—equally efficacious for memorial presentations and altar establishments:\n\nThe east’s Luminous One summons the true great spirits,\nClad in azure robes with black sashes, their forms spanning a hundred paces.\nTheir heads reach the heavens, devouring demonic ghosts.\nTheir mouths hold mountains, consuming five hundred at dawn and ten thousand at dusk.\nTen by ten, five by five—they swallow with their own robes.\n\nThe Lord of the Three *Qi* of the Cinnabar Heaven of the south,\nClad in crimson robes, leading the Red Spirit Kings,\nCaptures all ghosts, requiring ten thousand catties of flesh.\nThe Solar Envoys, bearing fire banners, each receive a portion,\nFeasting until blood flows like rivers.\n\nThe Lord of the Seven *Qi* of the White Heaven of the west,\nClad in white, his form ten thousand *zhang* tall,\nHis face wrinkled, wielding a great iron rod.\nFlying through the void, he captures all ghosts,\nDevouring livers and consuming lungs at will.\nI rely on the Great White’s assistance, the awe of numinous might.\n\nThe Black Numinous Lord of the Supreme Subtlety of the north,\nWho loves life and abhors killing,\nThe honored Chronogram Star of the five *qi* aids transformation,\nAttending to blessings and averting misfortune, delivering souls from darkness.\nCountless demons dare not intrude; bound specters are handed to the Imperial Lord.\n\nThe Yellow Emperor of the center, governing the four directions from the central palace,\nThe Mysterious True pays reverence, slaying demon kings.\nThe five stars pacify and guard; the radiance shines upon the realm.\nFive fragrances dispel corpse impurities; noxious *qi* does not arise.\nThe six heavens’ demonic spirits dare not oppose.\nToday, reciting the incantation, the hearts of myriad ghosts tremble.\nTwelve masters of yang’s light illuminate this dwelling and my body, strengthening its essence.\n\nFirst, strike the teeth twenty-four times and activate the censer:\nMost High Mysterious Origin, Five Numinous Lord Lao, Three *Qi* True Spirits,\nUrgent summons to the five true officials within your servant’s body,\nThe Three and Five Merit Officers, the upper and lower great ministers,\nThe Left and Right Dragon-Tiger Lords, the incense-bearing envoys,\nThe message-transmitting Celestial Maidens, the document-holding youths—\nTwenty-four each—and the twelve minor officials of the President of the Secretariat and the Director of Communications.\nHasten to report to the Most High of the Ten Directions, the Mysterious Origin Great Dao of the Three Heavens above.\nYour servants now, with utmost reverence, perform rites for so-and-so to dissolve calamities.\nBurning incense, we humbly announce our wish for the eight directions’ true *qi* to enter our bodies.\n\nThe announcement swiftly ascends, directly presented before the Jade Emperor’s celestial throne.\n\nNext, recite the *Hymn of Welcoming the Divine*:\n\nToday we sacrifice to the Five Emperors,\nOur words ascend to the Mysterious Void.\nBy nature, they reach the numinous spirits,\nInscribed in the endless records of night.\nWe beseech the Primal Gate as our portal,\nEntrusting ourselves to the Lord of the East.\nAll official matters are dissolved,\nEvery illness is wholly dispelled.\n\nRadiant Five Emperors,\nEver steadfast, never faltering.\nThey transform all things,\nEven the crawling and flying take form.\nTheir place is with Heaven and Earth,\nBorn together with the Dao.\nAbiding in height yet not aloof,\nSoaring yet never tilting.\nDwelling in darkness yet not hidden,\nResiding in turbidity yet not sullied.\nHard and soft adapt to custom—\nThus are they called divine.\n\nNow we seek to dispel calamity,\nTo vanquish demonic legions.\nWith pure wine and dried venison,\nWe welcome the Great Luminance.\nThe Five Emperors partake,\nBestowing long life.\nThe Controller of Destiny extends our years,\nInscribing our names anew in the register of life.\n\nMajestic Northern Portal,\nKeeper of the ledger of mortal death—\nToday our words ascend,\nThrough the Mystic Maiden and Dragon Couriers.\nLet our kin remain unharmed,\nWhile the wicked and rebellious are slain.\nMay the sick recover,\nMay the bound be freed.\nTogether with the sages we wander,\nOur names recorded in the Jade Chronicle.\n\nNext, kneel in reverence.\n\nHaving assumed the dharma-position, the Celestial Master’s qi-regulating Libationer declares:\n\nWe, [Name] and company, bow our heads and prostrate ourselves twice, respectfully invoking the Lords of the Nine Qi of the East, the Lord of the Eastern Peak of Mount Tai, the Lord of Mount Dai and Goumang the Green Emperor, and the Lord of Jupiter; the Lords of the Three Qi of the South, the Lord of the Southern Peak of Mount Heng, the Blazing Emperor of Red, and the Lord of Mars; the Lords of the Seven Qi of the West, the Lord of the Western Peak of Mount Hua, Rushou the White Emperor, and the Lord of Venus; the Lords of the Five Qi of the North, the Lord of the Northern Peak of Mount Heng, the Dark and Mysterious Five Emperors, and the Lord of Mercury; the Lords of the Twelve Qi of the Center, the Lord of the Central Peak of Mount Song, the Yellow Emperor Xuanyuan, and the Lord of Saturn. May they deign to descend and attend.\n\nWe invoke the Lords of the Nine Yi of Jia and Yi, the Green Emperor of Yin and Mao who dispels calamity; the Lords of the Eight Man of Bing and Ding, the Red Emperor of Si and Wu who dispels calamity; the Lords of the Six Rong of Geng and Xin, the White Emperor of Shen and You who dispels calamity; the Lords of the Five Di of Ren and Gui, the Black Emperor of Hai and Zi who dispels calamity; the Lords of the Three Qin of Wu and Ji, the Yellow Emperor of Chen, Xu, Chou, and Wei who dispels calamity. May they deign to descend and attend.\n\nWe invoke the Lord of Jupiter of the East, the Lords of the Eastern Constellation and Eastern Dipper, and the Lords who dispel calamity from the Seven Lodges of Jiao, Kang, Di, Fang, Xin, Wei, and Ji; the Lord of Mars of the South, the Lords of the Southern Constellation and Southern Dipper, and the Lords who dispel calamity from the Seven Lodges of Jing, Gui, Liu, Xing, Zhang, Yi, and Zhen; the Lord of Venus of the West, the Lords of the Western Constellation and Western Dipper, and the Lords who dispel calamity from the Seven Lodges of Kui, Lou, Wei, Mao, Bi, Zi, and Shen; the Lord of Mercury of the North, the Lords of the Northern Constellation and Northern Dipper, and the Lords who dispel calamity from the Seven Lodges of Dou, Niu, Nü, Xu, Wei, Shi, and Bi; the Lord of Saturn of the Center, the Lord of the Central Terrace, the Lord of the Central Dipper, and the Lords who dispel calamity from the Seven Lodges of [missing text]. May their merciful radiance deign to descend and attend.\n\nWe, [Name] and company, bow twice and offer fragrant wine.\n\n**First Libation**\nWe invoke the Lords who Dispel Calamity of Heaven, Earth, Sun, and Moon; the Lord who Dispels Calamity of the Controller of Destiny; the Lords who Dispel Calamity of the Four Seasons; the Lord of the Origin-Dispelling Star; the Lords who Dispel the Entangling and Binding Spirits; the Lords who Dispel the Great and Lesser Slaughters; the Lords who Dispel the Punishments of Law and Penal Codes; the Lords of the Great and Lesser Assemblies; the Lords who Dispel the Ominous Origins; the Lords who Repel Slaughter and Calamity of the Four Seasons; the Lords who Govern Destiny of the Five Planets; the Lords who Govern Destiny of the Five Emperors; the Lords who Govern Destiny of the Five Peaks; the Lords who Govern Destiny of the Six Jia; the Lords who Govern Destiny of the Seven Stars; the Lord who Governs Destiny of the Earth Office; the Lord who Governs Destiny of the Central Perfected Earth; the Lord who Oversees Destiny of our Household Elder; the Lord who Governs Destiny of our Household Ancestor; the Lord who Governs Destiny of the Crossroads; the Lord who Governs Destiny of the Current Year; the Lord who Governs Destiny of the Current Month; the Lord who Governs Destiny of the Current Day; the Lord who Governs Destiny of the Present Hour; the Lord who Governs Destiny of our Natal Star; the Lord who Governs Destiny of our Embryo; the Lord who Governs Destiny of our Birth Month; the Lord who Governs Destiny of our Current Age; the Perfected Officers of the Nine Provinces’ Earth Altars, Earth Lords, and Earth Spirits; the Perfected Officers of the Village Domains; the Generals of the Eight Divisions; the Perfected Officers of the Local Earth Gods; and all the Lords of the Spirits. May they descend to their positions and seats. We, [Name] and company, bow twice and offer fragrant wine.\n\n**Second Libation**\nYour servant, [Name], humbly petitions:\n\nThough base and unworthy, of dull and coarse nature, I have been graciously favored by the profound compassion of the Elder Master who bestowed this dharma. On the day I received the precepts, I was led by five guarantors and seven witnesses to ascend and pay homage to the Three Heavenly Venerables, to declare my vows to the Ten Directions, and to form a pact with the myriad spirits. The true and essential words of the Master bound me to assist in the governance of qi by Heaven, to aid the state and sustain life, to rescue the living and deliver the dead, and to serve as a bridge for all beings.\n\nYet the fortunes of the world have withered, and spirits and demons intermingle. The Three Calamities spread unchecked, and plagues, madness, and malevolence arise everywhere. The four hundred and four diseases afflict the people, and countless calamities entwine them, making it difficult to hear or see their suffering. Whenever supplications are made, I dare not ignore or obstruct them, though I am overwhelmed by what I witness.\n\nThus, I respectfully present [Name], an official, man or woman, of [State, County, Village], aged [number] years, whose destiny has been summoned by a hundred misfortunes. Their calamities run deep, for in the year and month of their birth, they were afflicted by the presence of the Demon-Star and the Celestial Net. Numerous taboos converged, and inauspicious disasters befell them. In the year of their current age and their natal star, they are ensnared by the Web of Doom. The branches and stems of their natal star and birth month clash and harm one another, while baleful stars and ominous lodges descend upon them. They may be struck by the Four Slaughters or assailed by the Five Ghosts, afflicted by the Six Harms or wounded by the Seven Injuries. They may be encircled by the Eight Winds or beset by the Nine Calamities. Misfortune follows them, bringing lingering illness, emaciation, and the decline of their strength and vitality, with countless ailments arising. Their soul may take flight, or they may face mortal peril. They may be confined in the ghostly prisons of mountains and springs, or tormented by malevolent spirits and bound by demonic hordes. Each joint and organ is guarded by its own spirit, and when their essence and spirit falter, a hundred misfortunes naturally arise.\n\nWhen Heaven is obstructed, disasters and harms are born. When humans encounter decline and calamity, they too suffer misfortune and woe. Their allotted lifespan may be exhausted, and their fate may wither. They may face the Three Origins’ absolute calamities, or their affairs may be obscured in the Hall of Light. The branches and stems of their year and fate may fall into the desolation of solitude and void, or their fate may coincide with the inauspicious year of the Grand Year-Star. The Nine Palaces and Eight Trigrams may clash and sever one another, or the Five Ghosts and Four Slaughters may seize the opportunity to bring disaster. Their five viscera may be depleted, and the four directions may bring punishment and misfortune. The poisonous qi of the Eight Winds and the ghosts of the Nine Uglies, along with the perverse and malevolent specters of the world’s old qi, may invade their body, congealing in the five viscera, roaming through the marrow, and stirring the seven po. Within, they breed treachery. The fleshly body, dull and foolish, clings to life and fears death, unaware of what merit or virtue might extricate it.\n\nI have heard that the Great Compassion of the Most High loves life and abhors death. Having opened Heaven and spread Earth, nurturing all living beings, it permits repentance for sins of any magnitude, offering deliverance to all, great and small.\n\nIn the time of the Yellow Emperor, people’s lifespans reached their full measure: the longest lived to one hundred and twenty years, the middling to one hundred, and the shortest to eighty. Those who fell short of these three spans were cut down unjustly by Heaven. Now that I have encountered disaster and calamity, I dare, in this time of trial and tribulation, to lay bare my liver and expose my heart.\n\nWith reverence, I present offerings of life-sustaining rice, white silk, five-colored patterned silks of the five directions, counting rods, pure oil, wine and dried meats, incense cakes, sweet fruits, life-extending green threads, golden figurines, golden rings, cinnabar incense, silver ingots, a writing knife, brush, paper, ink, life-delivering banners of the five directions, and pure mats—each item duly prepared—to beseech the dissolution of this calamitous convergence. These instruments for extracting names from the Register of Destined Death are arrayed before the august deities. I humbly pray that the invoked deliverance deities, the Lords of Life’s Span, the Eastern King Father, the Western Queen Mother, the Lords of Records and Constraints, the Directors of Destiny, and all assembled gods may gather in righteous communion, bestow grace, and descend with blessings.\n\nMay the Directors of Destiny and Records ascend to the Nine Heavens, examine my name in the celestial registers, discern the length of my life, and locate the depth of my disasters and calamities. I beseech that my name be stricken from the Black Register of the Right Palace of Heaven’s Bureau, removed from the Death Ledgers of the Three Offices of the Most High, and inscribed anew in the Book of Life.\n\nProstrating again, I offer this fragrant wine.\n\nNext, the second libation:\nIf my lifespan is too short, I beg that its measure be extended.\nIf trees wither and dry, I beg that their sap and luster be restored.\nIf granaries lack grain, I beg that their bushels be replenished.\nIf my allotted span nears its end, I beg for added years to prolong my life.\nIf my life is brief, I beg for its continuation; if disaster looms, I beg for its dissolution.\nIf misfortune threatens, I beg for its eradication; if decline sets in, I beg for its reversal.\nIf calamity approaches, I beg for its deliverance; if ghosts assail, I beg for their capture.\nIf snares entangle, I beg for their unraveling; may misfortune be transformed into fortune.\nMay what is lost be restored, and fleeting moments be prolonged.\nThe Eastern Dipper governs life’s span, the Western Dipper records names,\nThe Northern Dipper averts death, the Southern Dipper bestows life.\n\nIf from my ancestors to this day, lingering entanglements of karmic retribution remain unresolved, I beg that the black records of Heaven’s Bureau be cleared of their harm, and that the earthly spirits and malevolent forces afflicting my descendants be dissolved. May the disasters within my body be eradicated, and my primordial destiny be uplifted.\n\nIf my life is fated to end in the East, I beseech the gods of the Northern Kan trigram and the five divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\nIf my life is fated to end in the South, I beseech the gods of the Eastern Zhen trigram and the nine divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\nIf my life is fated to end in the West, I beseech the Central Lord of Stability and the twelve divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\nIf my life is fated to end in the North, I beseech the gods of the Western Dui trigram and the seven divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\nIf my life is fated to end in the four corners, I beseech the gods of the Southern Li trigram and the three divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\n\nI humbly pray to the Lords of Jupiter, the Eastern Chen, the Eastern Dipper, the Seven Lords of the Horn, Neck, Root, Heart, Tail, and Winnowing Basket constellations, the Lord of Mount Tai of the Eastern Marchmount, the Lords of the Nine Yi, the Lords of Jia and Yi, and the Lords of Yin and Mao: may they dissolve the karmic entanglements recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces within the nine myriad li of the East. May they eradicate the afflictions within my liver, dispel the green disasters, green calamities, green poisons, wood spirits, and wood harms of the East, and protect me during the seventy-two days of the Wood’s flourishing season in the first, second, and third months, that I may pass through this time by your grace.\n\nI humbly pray to the Lords of Mars, the Southern Chen, the Southern Dipper, the Seven Lords of the Well, Ghost, Willow, Star, Spread, Wing, and Axle constellations, the Lord of Mount Heng of the Southern Marchmount, the Lords of the Eight Man, the Lords of Bing and Ding, and the Lords of Si and Wu: may they dissolve the karmic harm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces within the eight myriad li of the South. May they eradicate the afflictions within my heart, dispel the red disasters, red calamities, red ghosts, red poisons, fire spirits, and fire harms of the South, and protect me during the seventy-two days of the Fire’s flourishing season in the fourth, fifth, and sixth months, that I may pass through this time by your grace.\n\nI humbly pray to the Lords of Venus, the Western Chen, the Western Dipper, the Seven Lords of the Straddling, Bond, Stomach, Pleiades, Net, Turtle Beak, and Orion constellations, the Lord of Mount Hua of the Western Marchmount, the Lords of the Six Rong, the Lords of Geng and Xin, and the Lords of Shen and You: may they dissolve the karmic harm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces within the six myriad li of the West. May they eradicate the afflictions within my lungs, dispel the white disasters, white calamities, white afflictions, white poisons, metal spirits, and metal harms of the West, and protect me during the seventy-two days of the Metal’s flourishing season in the seventh, eighth, and ninth months, that I may pass through this time by your grace.\n\nI humbly pray to the Lords of Mercury, the Northern Chen, the Northern Dipper, the Seven Lords of the Dipper, Ox, Girl, Emptiness, Danger, Encampment, and Wall constellations, the Lord of Mount Dai of the Northern Marchmount, the Lords of the Five Di, the Lords of Ren and Gui, and the Lords of Hai and Zi: may they dissolve the karmic harm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces within the five myriad li of the North. May they eradicate the afflictions within my kidneys, dispel the black disasters, black poisons, black harms, black illnesses, water spirits, and water calamities of the North, and protect me during the seventy-two days of the Water’s flourishing season in the tenth, eleventh, and twelfth months, that I may pass through this time by your grace.\n\nI humbly pray to the Lords of Saturn, the Central Dipper, the Lords of the Celestial Pivot, the Seven Lords of the Seven Governors, the Lord of Mount Song of the Central Marchmount, the Lords of the Three Qin, and the Lords of Wu and Ji: may they dissolve the karmic harm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces. May they eradicate the afflictions within my spleen, dispel the yellow disasters, yellow calamities, yellow poisons, earth bandits, and earth ghosts of the Center, and protect me during the seventy-two days of the Earth’s flourishing season in the months of Chen, Xu, Chou, and Wei, and the eighteen days of each of the third, sixth, ninth, and twelfth months, that I may pass through this time without misfortune.\n\nDeep in my distant anxieties, I look up in hope to the august deities, praying for your numinous grace and radiant protection, that I may be spared from calamity and misfortune, and my entire household preserved and sustained. I bow twice again, offering fragrant wine.\n\nNext, the offering of wine:\nMay it further dissolve the penal afflictions I have suffered since the year’s beginning; may it dissolve the penal afflictions of official imprisonment and judicial punishment; may it dissolve the penal afflictions of encountering ghostly perils in travel; may it dissolve the penal afflictions of being examined for transgressing the Dao; may it dissolve the penal afflictions of interrogation by the dead; may it dissolve the afflictions of beatings and blows; may it dissolve the penal afflictions of offending or displeasing ancestral spirits; may it dissolve the afflictions of offending the Ao deities; may it dissolve the penal afflictions of short lifespan; may it dissolve the penal afflictions of exhausted fate; may it dissolve the penal afflictions of the Five Ghosts and Four Killers; may it dissolve the penal afflictions of the Six Harms, Seven Injuries, Eight Difficulties, and Nine Pitfalls; may it dissolve the afflictions of tigers, wolves, venomous insects, snakes, and wasp poisons; may it dissolve the penal afflictions of disasters, weeping, misfortunes, and lingering curses; may it dissolve the penal afflictions of terrified wandering souls; may it dissolve the penal afflictions of blades, weapons, and bloodshed; may it dissolve the penal afflictions of bondage, cangues, and fetters; may it dissolve the afflictions of being trampled by oxen or horses; may it dissolve the penal afflictions of lost wealth and failed ventures; may it dissolve the penal afflictions of Metal, Wood, Water, Fire, and Earth; may it dissolve the penal afflictions of the Five Phases clashing in harm; may it dissolve the penal afflictions of the Year Star in the heavens; may it dissolve the penal afflictions of solitary stars and widow constellations causing obstruction; may it dissolve the penal afflictions of constructed curses, spells, and malevolent prayers; may it dissolve the penal afflictions of deathly curses and interrogations; may it dissolve the penal afflictions of violating laws and defying statutes; may it dissolve the penal afflictions of offending deities, deceiving ghosts, reckless speech, and unfulfilled vows leading to calamity; may it dissolve celestial afflictions; may it dissolve the afflictions of the year, month, day, hour, great and small—may all afflictions be released and dispersed in due time.\n\nI bow twice again, offering this wine of examination. Next, the offering of wine.\n\nWe further invoke the assembly of revered divine immortals, officials, and generals, humbly beseeching that the Dragon Chariots halt their course and the Celestial Hosts rest in tranquil repose upon their seats. We, on behalf of [Name], respectfully present the memorial of the Primordial Hour of Destiny, its words woven into a tapestry of supplication.\n\nFearing that the transmission of our petition may be too vast for instant comprehension, we implore the august deities to linger in gracious attendance, that they may heed our prayer as we prostrate ourselves to present this memorial. To submit the memorial, we knock our teeth nine times, facing east by day and north by night, with doors unsealed.\n\nWe now reverently dispatch the True Officials of the Five Agents within our bodies, the Attendant Clerks of the Office:\n- Two Attendant Clerks of the Upper Immortal and Upper Numinous Bureaus,\n- Two Clerks of the Orthodox Unity Office,\n- Two Clerks of the Office of Healing,\n- Two Clerks of the Left Bureau Envoys,\n- Two Clerks of the Right Bureau Envoys,\n- Two Clerks of the Yin Spirit Adjudicators,\n- Two Clerks of the Yang Spirit Adjudicators,\n- Two Clerks of the Scarlet Talisman Chariot, the Just Wind Riders, and the Post-Horse Memorial Envoys.\n\nThe Direct Attendant Clerks wear the Crown of Heavenly Passage, clad in black, holding unlined robes. The Orthodox Unity Clerks don the Vermilion Yang Turban, crimson unlined robes, and gird themselves with Dragon-Headed Swords. The Petition-Bearing Envoys, arrayed in the Accumulations of Profound Yin, wear the Nine-Virtue Crown, multicolored sashes, unlined robes, Tiger Talismans at their waists, and hold jade tablets in hand.\n\nThe Direct Attendant Clerks stand at the four directions; the Orthodox Unity Clerks stand at the center. The Left Bureau Envoys hold banners before us; the Right Bureau Envoys bear insignia behind us. The Yang Spirit Adjudicators stand to the left; the Yin Spirit Adjudicators stand to the right.\n\nWe now summon:\n- Nine Envoys of the Numinous Might and Reverent Benevolence Bureau,\n- Three Envoys of the Scarlet Blazing Crossbow and Ritual Bureau,\n- Seven Envoys of the Radiant Lunar Treasure and Righteousness Bureau,\n- Five Envoys of the Flourishing Light and Discipline Bureau,\n- Twelve Envoys of the Pivot-Containing Axis and Trust Bureau,\n- Nine Envoys of the Great Spirit Yu Scribes,\n- Eight Envoys of the Vermilion Cinnabar True Scribes,\n- Six Envoys of the Zou Supreme Mystery Scribes,\n- Five Envoys of the Stone Profound Origin Scribes,\n- Three Envoys of the Yellow Loyalty and Rectitude Scribes,\n- Three Attendants of Feng Xiuwei and the Hidden Maiden,\n- Nine Attendants of Zhu Cangyi and the Boundless Void,\n- Seven Envoys of the Youthful Supreme, Standing Numinous, and Pure Orchid,\n- One Attendant of Ding Yu, Zhang Jielian, and the Winged Ones,\n- Five Attendants of Master Lü and Feng Yi,\n- Seven True Persons of the Yang Brightness and Yin Essence, the Profound Darkness and Cinnabar Origin, the Northern Culmen, and the Celestial Pass Direct Talisman and Attendants,\n- Nine Envoys of the Supreme Dawn, the Venerable Transmitters of Mandates bearing insignia,\n- Twenty Envoys of the Supreme Azure and Vermilion Healing Clerks,\n- Twenty-four Envoys of the Three Divisions, the Three Bureaus, and the High Chariot Envoys,\n- Twelve Envoys of the Yin-Yang Grand Overseers,\n- Five Generals of the Qi of the Central Cavalry, the Post-Station Inspectors, and the Pacifying Qi,\n- Two hundred forty Envoys of the Wolf Scribes, Tiger Warriors, Investigators of Treachery, Hook Riders, the Three Officials’ Archers, the Celestial Armored Soldiers, and the Heavenly Might Officers,\n- Two hundred forty Celestial Lads of the Five Directions, Cloudborne Lesser Scribes, and Heaven-Monitoring Lads,\n- One hundred twenty Envoys of the Spirit-Gathering and Spirit-Feeding Scribes,\n- Five Generals of the Transformative Spirit, the Banner of the Celestial Calendar, and the Just Wind, along with the Left and Right Qi-Guiding Cavalry Generals,\n- One hundred twenty Envoys of the Scarlet and Plain Lords and the Yang Radiance Lords,\n- One hundred twenty Envoys of the White and Plain Lords and the Yin Radiance Lords.\n\nAll who emerge must be adorned in solemn attire, their majesty arrayed, standing before, behind, to the left, and right of us, receiving the words from our mouths. They shall distinguish and transmit the memorial, ensuring its passage to the True Officials of this very prefecture, county, township, and hamlet who govern qi, overseeing the inspection and summons of the Earth Gods of the communities and hamlets, the Two Mysteries, Three Origins, Four Beginnings, and all Jiazi Officials of the seventy-two bureaus in the four directions and positions. Through the Three Officials’ summons, may they jointly ascend our petition, presenting it to the Supreme and Boundless Great Dao, the Divine Sovereign of the Dao Within the Dao, the Jade Emperor, the Most High Lord Lao, the Most High Venerable One, the Primordial Supreme Mysterious Elder, the Celestial Masters, the Heir Masters, the Lineage Masters, the Female Masters, the Three Masters, the Gatekeepers, Scribes, and Lesser Clerks of the Masters’ Courts, who attend to the affairs of the memorials.\n\nWe, on behalf of [Name], a male/female official or disciple of this prefecture, county, township, and hamlet, prostrate ourselves to present this memorial, seeking to resolve the Primordial Hour of Destiny, unravel the nets of karmic entanglement, extricate from the cycles of life and death, extend longevity, transform the body, and dissolve calamities. A single memorial, written in connected sheets, lies revealed upon the white altar in the central courtyard of this oratory. May the attending officials deign to bestow their divine attention and governance.\n\nWe bow our heads to the ground, entrusting our faith in this memorial as prescribed by ritual. We open the case and reverently read it aloud for celestial hearing.\n\nNext, we read the memorial, then dispatch it, knocking our teeth twelve times.\n\nWe now solemnly command the Direct Attendants, the Orthodox Unity Clerks, and the Lesser Scribes of the Five Agents within our bodies to array themselves in solemn attire, their caps adorned with hanging tassels, heads crowned with luminous jade, waists girded with Dragon Abyss Swords and multicolored sashes, brushes tucked behind their ears, holding writing boards. They shall promptly take up the Primordial Hour of Destiny, the connected-sheet memorial, and the accompanying documents, ascending to the Three Celestial Courts of the Supreme, and on this very day, proceed to the designated court and palace, presenting the memorial in accordance with its contents, distinguishing matters to be reported to the Most High Lord Lao, the Celestial Masters, the Heir Masters, the Lineage Masters, the Female Masters, the Two Masters, and the various lords, generals, and clerks of the Black Gate.\n\nWe humbly reflect that, though our persons are lowly and our bones base, by the fortune of fate’s convergence, we have been permitted to serve within the registers of governance. Yet our ears and eyes are obstructed, and in dispatching clerks and soldiers, errors may arise, our words disordered. We beseech the Yin-Yang Spirit Adjudicators, the Clerks of the Four Bureaus, the Memorial-Transmitting Scribes, and the Lesser Clerks of Practice to take up Dragon-Headed Writing Knives and long, sharp brushes, correcting omissions, amending errors, and ensuring no missteps cause the attending officials to reprimand or reject our petition.\n\nShould any subordinate officials, malevolent qi spirits, or demonic thieves intercept or sever the memorial’s text, preventing its ascent, seize them and consign them to the local prison, where they shall be punished according to the statutes of the Mysterious Capital. Let our petition proceed directly to the presence of the Supreme Unbounded Great Dao, without delay or obstruction. The Left Lord shall pass through the barriers in sequence, while the Right Clerks shall present the memorial in order, ensuring no omission or leakage, sealing the qi to ascend. We prostrate ourselves, awaiting the report.\n\nNext, we press our foreheads to the earth, visualizing the memorial ascending clearly, until the attending officials and lords have received it in full. Then, we withdraw the memorial.\n\nOnce the rite of offering and the jiao liturgy are concluded, the Merit-Officials and all attending lords who emerged from our bodies shall re-enter through the Gates of Myriad Mysteries—those on the left returning to the left, those on the right to the right—each resuming their palaces, coiling about our bodies and entwining our bones, pervading heaven and earth, safeguarding the hundred meridians, ensuring no misalignment. When summoned forth again, they shall emerge precisely as before.\n\nNext, the hymn of sending forth the deities (not recited during non-jiao rites):\n\n*Swiftly ride the Five Emperors’ chariots,*\n*Softly plow the Seven Lords’ fields.*\n*Radiance streams down to the mat,*\n*Feast and banquet respond to crimson sincerity.*\n*Petitions resound, all-pervading,*\n*From death’s fall to life’s ascent.*\n*The Southern Palace augments our years,*\n*The Northern Dipper records our longevity.*\n*Transgressions and calamities dissolve,*\n*Fortune’s blessings bring eternal peace.*\n*As rites of gratitude conclude,*\n*The gods ascend back to the Great Clarity.*\n\nNext, the libation is dispersed.\n\nNext, the universal reproach text:\n\nNow that the jiao sacrifice is complete and the divine carriages have ascended, may the lingering fragrance of blessings universally bestow their reproachful grace. We summon the disciples’ nine generations of ancestors, their fathers and mothers, and the seven generations of departed kin to partake fully in this offering. Also, the true officials of the Left Altar and Right Millet, the city gods, the local deities, the eight divisions of attendants, the Merit-Officials, clerks, and soldiers, the standard-bearing warriors, the household deities of this dwelling—may all sweetly receive the jiao rites. The Three Generals Guarding the House, the Twelve Divine Generals, the Twenty-Four Warden-Officials, the Gate Sergeants, the Door Commandants, the household-guarding clerks and soldiers, and the Turtle-Spirit Officials—may all feast and drink to satiation. Thereafter, arrayed with us, they shall guard the household, ensuring no disaster crosses the threshold, no plague enters the door, and no demonic spirits or thieving ghosts dare approach. The covenant’s true dharma is not to be taken lightly. Should they faithfully guard and merit promotion for their blessings and aid in goodness, on the three auspicious assembly days, they shall be elevated together with the memorial. They must not slacken, but be disciplined according to the law, as under the Ordinance of the Celestial Master.\n\nNext, invoke the Incense-Official Envoys, the Left and Right Dragon-Tiger Lords, and the various Attending Incense Spirits: on this occasion of setting up the jiao-offering at the original destiny’s site, naturally arise golden liquors and cinnabar-green mushroom blossoms. Let the host of perfected ones and the hundred spirits convene here before the incense burner. May so-and-so’s entire household receive blessings, and may the world be covered in grace.\n\nLet the jade maidens and immortal youths of the ten directions stand guard, transmitting the incense smoke’s memorial, conveying the foregoing words directly to the Most Perfect and Boundless Jade Sovereign of the Highest Dao in his imperial presence.\n\nNext, disperse the assembly with a hymn of praise:\n\nThe Three Luminaries shine most brightly,\nHeaven and Earth remain ever serene.\nHumankind dwells within them,\nFortune and emolument follow fate’s threads.\nPunishment and execution meet their destined junctures,\nSickness and calamity await their appointed years.\nThus do crooked ghosts stealthily approach,\nLurking near blessings and transgressions alike.\nThe wise turn to the Great Dao,\nCultivating sincerity in the Five Fields of Blessing.\nProclaiming this below, may all disperse,\nAnd may lifespans extend long and far.\nMay the seven ancestors all find peace,\nAnd may the imprisoned and stricken alike receive absolution.\nEmerging from the oratory, bow and offer praise,\nThat fragrant virtue may gather before the Emperor.\n\nNext, exit the chamber with this incantation:\nFrom yin to yang, the myriad spirits open the way.\nWith affairs at the passes concluded, now seal the Yellow Chamber.\nLet the jade maidens guarding the oratory\nBrightly prepare the divine palace.\nStanding in attendance to left and right,\nMay the myriad spirits silently settle.\n\nThe *Complete Rites of the Original Destiny’s Petition-Offering* (Upper Scroll) concludes here.\nThe *Complete Rites of the Original Destiny’s Petition-Offering* (Lower Scroll):\nDissolving Disasters of the Original Destiny, Natal Destiny, Womb-Generated Destiny, and Annual Destiny\n\nIt is said: So-and-so’s natal destiny, annual destiny, and the two months of womb-generated destiny all fall upon the *wu*-destiny, where they encounter various inauspicious stellar configurations—celestial executioners, the baleful net of the heavens—whether through self-inflicted harm or mutual affliction. For each, invoke their child-spirits to harmonize and resolve these conflicts, uniting with protective spirits to ensure no further misfortune.\n\nNext, the method of dissolution:\n\n**Stem Sequence:**\nJia, Yi, Bing, Ding, Wu, Ji, Geng, Xin, Ren, Gui.\n\n**Baleful Spirits:**\nGeng, Xin, Ren, Gui, Jia, Yi, Bing, Ding, Wu, Ji.\n\n**Child-Spirits:**\nBing, Ding, Wu, Ji, Geng, Xin, Ren, Gui, Jia, Yi.\n\n**Uniting Spirits:**\nWu, Ji, Geng, Xin, Ren, Gui, Jia, Yi, Bing, Ding.\n\nThe above yin and yang stems are each matched with the twelve earthly branches.\n\n**Branch Sequence:**\nZi, Chou, Yin, Mao, Chen, Si, Wu, Wei, Shen, You, Xu, Hai.\n\n**Baleful Spirits:**\nChen-Xu, Mao, Shen, You, Yin, Hai, Zi, Mao, Wu, Si, Yin, Chou-Wei.\n\n**Child-Spirits:**\nYin, You, Wu, Si, Shen, Chou, Wei, Chen-Xu, You, Zi, Hai, Shen, Mao.\n\n**Uniting Spirits:**\nChou, Zi, Hai, Xu, You, Shen, Wei, Wu, Si, Chen, Mao, Yin.\n\nThe above yin and yang branches, paired with the ten celestial stems, form the Six Jia. When baleful influences are identified, select their child and uniting spirits.\n\nFor example: If the natal destiny is Jia-Zi, the baleful influence lies in Geng-Chen. Invoke the child-spirit Bing-Yin (so-and-so) and the uniting spirit Ji-Chou (so-and-so).\n\n**First:** For the Jia natal destiny, if the baleful influence resides in [X], respectfully invoke the child-spirit [so-and-so], with their attendant officials (number unspecified), to harmonize and resolve the self-inflicted disasters, dissolving all baleful stellar configurations, myriad calamities, and malevolent harms encountered upon the natal destiny. May so-and-so embody the primordial qi of earth, nurturing life and nature.\n\nAlso invoke the uniting spirit [so-and-so], with their attendant officials (number unspecified), to protect the natal destiny and ensure no further misfortune.\n\n**Second:** For so-and-so’s original destiny, if the baleful influence resides in [X], respectfully invoke the child-spirit [so-and-so], with their attendant officials (number unspecified), to harmonize and resolve the self-inflicted harms, following the example of the natal destiny. Dissolve the baleful influences upon the original destiny. May so-and-so contain jade fragrance and exhale jade nectar, preserving the original essence and extending the lifespan to its destined end. Also invoke the uniting spirit [as above] to protect the original destiny and ensure no further misfortune.\n\n**Third:** For the womb month, follow the same example. Dissolve the baleful influences, that the womb month may exhale harmonious qi to nurture the womb’s primordial essence. Also invoke the uniting spirit [as above].\n\n**Fourth:** For the birth month, proceed as above. Dissolve the baleful influences, that the birth month may exhale harmonious qi to nurture the birth’s primordial essence. Also invoke the uniting spirit [as above].\n\n**Fifth:** For the annual destiny, proceed as before. Dissolve the baleful influences, that the annual destiny may exhale primordial qi to sustain the suspended lifespan. Also invoke the uniting spirit [as above].\n\n**Sixth:** For the annual destiny’s original destiny, proceed as above. Dissolve the baleful influences, that the annual destiny’s original destiny may exhale realgar and contain jade fragrance, preserving the annual destiny’s essence and delivering it from perilous calamities. Also invoke the uniting spirit [as above] to protect the annual destiny’s original destiny and ensure no further misfortune.\n\nThe above outlines the dissolution of the natal destiny, womb-generated destiny, and annual destiny. The intricacies within are matters of great skill.\n\nNext, the return of the spirits:\nRespectfully invite so-and-so’s natal destiny spirit [so-and-so], along with the original destiny spirit, womb-month spirit, birth-month spirit, annual destiny spirit, and annual destiny’s original destiny spirit, each to return to so-and-so’s body, serving as guardian spirits to defend the form, adhering to the palaces and chambers, dispelling misfortune and harm, pacifying the spirit and the inner child, preventing any waywardness.\n\nIf residing in illness, also invoke this year’s spirit [so-and-so]. For example, in the year Jia-Zi, invoke Wang Wenqing of Jia-Zi, with eighteen officials arrayed according to the year’s sequence. Request their chariot: Wu or Wei for the Vermilion Bird, or the Dark Warrior’s mount. If the year falls in Hai or Zi, or Chou, let the Dark Warrior mount the Vermilion Bird. Holding acupuncture needles and medicines, mouth containing realgar and exhaling jade fragrance—or said to hold jade fragrance and exhale jade nectar—descend together to so-and-so’s household, entering so-and-so’s body to heal all afflictions. From head to foot, left to right, encircle the body, weaving through the hundred vessels, harmonizing the five viscera, and suddenly dispelling all ailments.\n\nPreserve this year through to the coming one, or said to extend until the next. Dissolve all baleful influences—malign spirits, venomous toxins, calamities, and lingering spectral afflictions—causing them to disperse entirely. Support the frail, carry them through peril, and ensure no harm befalls them.\n\nNext, for so-and-so’s natal year and its associated branch-stem pairing, count forward from the natal spirit to determine the eight spirits governing *dead qi*. Invoke the *living qi* salvation spirits, counting backward from so-and-so’s natal spirit to find the eight spirits governing *living qi*. With a retinue of so many officials, present offerings and submit the ritual petition, ascending to the Celestial Emperor of so-and-so’s palace and the corresponding deities. Identify the Twenty-Eight Constellations under which the natal year falls, along with the names of the Celestial Emperor and his officials. Align the stars and measure the lodges to dissolve misfortune, ascending to the Lord of so-and-so’s Mansion and the Sovereign of the Palace of the Celestial Emperor of that branch. Inscribe the realm of *undying qi*: Jia-Yi as Lesser Yang, Bing-Ding as Greater Yang, Geng-Xin as Lesser Yin, Ren-Gui as Greater Yin, and Wu-Ji as the Central Palace. The palaces are: Hai-Zi as the Northern Palace, Yin-Mao as the Eastern Palace, Si-Wu as the Southern Palace, Shen-You as the Western Palace, and Chen-Xu-Chou-Wei as the Central Palace—all derived from the natal branch-stem. For so-and-so, trade names and transform form, excising the *dead qi* of so-and-so’s sequence of eight spirits. Transfer the name into the register of the living, prolonging life without end.\n\nFor example, one born in the Jia-Zi year has *dead qi* in Xin-Wei. The *living qi* salvation spirit is Ding-Si Cui Juqing, with ten attending officials, ascending to the Primordial Radiance Celestial Emperor of the Upper Prime Palace. Align the stars and measure the lodges to dissolve misfortune, ascending to the Lord of the Non-Birth Mansion, Qi Tong, and inscribing the realm of *undying qi*, specifically the Lesser Yang of the Northern Palace. For so-and-so, trade names and transform form, excising the *dead qi* of Xin-Wei and transferring residence into the register of the living, prolonging life without end. This single example suffices; the rest may be inferred accordingly.\n\nNext, the names of the Six Jia spirits and their attending officials:\n- Jia and Ji, in Zi and Wu: nine officials\n- Yi and Geng, in Chou and Wei: eight officials\n- Bing and Xin, in Yin and Shen: seven officials\n- Ding and Ren, in Mao and You: six officials\n- Wu and Gui, in Chen and Xu: five officials\n- Si and Hai: four officials\n\nThe above branch-stem pairings determine the number of attending officials.\n\nThe names of the Six Jia spirits for each sixty-year cycle and their attending officials are as follows:\n- Jia-Zi: Wang Wenqing, with eighteen officials\n- Yi-Chou: Long Weiqing, with sixteen officials\n- Bing-Yin: Zhang Zhongqing, with fourteen officials\n- Ding-Mao: Sima Qing, with twelve officials\n- Wu-Chen: Ji Chuqing, with ten officials\n- Ji-Si: He Wenchang, with thirteen officials\n- Geng-Wu: Feng Zhongqing, with seventeen officials\n- Xin-Wei: Wang Wenzhang, with fifteen officials\n- Ren-Shen: Hou Boqing, with thirteen officials\n- Gui-You: Sun Zhongfang, with eleven officials\n- Jia-Xu: Zhan Zijiang, with fourteen officials\n- Yi-Hai: Pang Minggong, with twelve officials\n- Bing-Zi: Xing Sunqing, with sixteen officials\n- Ding-Chou: Zhao Ziyu, with fourteen officials\n- Wu-Yin: Yu Ziqing, with twelve officials\n- Ji-Mao: Shi Wenyang, with fifteen officials\n- Geng-Chen: Yin Jiaqing, with thirteen officials\n- Xin-Si: Yang Zhonggong, with eleven officials\n- Ren-Wu: Ma Ziming, with fifteen officials\n- Gui-Wei: Lü Weiming, with thirteen officials\n- Jia-Shen: Hu Wenchang, with sixteen officials\n- Yi-You: Kong Ligong, with fourteen officials\n- Bing-Xu: Che Yuansheng, with twelve officials\n- Ding-Hai: Zhang Tong, with ten officials\n- Wu-Zi: Yue Shiyang, with fourteen officials\n- Ji-Chou: Fan Heqing, with seventeen officials\n- Geng-Yin: Chu Jinqing, with fifteen officials\n- Xin-Mao: Guo Ziliang, with thirteen officials\n- Ren-Chen: Wu Zhiqing, with eleven officials\n- Gui-Si: Shi Gonglai, with nine officials\n- Jia-Wu: Wei Shangqing, with eighteen officials\n- Yi-Wei: Du Zhongchang, with sixteen officials\n- Bing-Shen: Zhu Bozhong, with fourteen officials\n- Ding-You: Zang Wengong, with twelve officials\n- Wu-Xu: Fan Shaoqing, with ten officials\n- Ji-Hai: Deng Duqing, with thirteen officials\n- Geng-Zi: Yang Zhongshu, with seventeen officials\n- Xin-Chou: Lin Weigong, with fifteen officials\n- Ren-Yin: Qiu Mengqing, with thirteen officials\n- Gui-Mao: Su Tajia, with eleven officials\n- Jia-Chen: Meng Feiqing, with fourteen officials\n- Yi-Si: Tang Wenqing, with twelve officials\n- Bing-Wu: Wei Wengong, with sixteen officials\n- Ding-Wei: Shi Shutong, with fourteen officials\n- Wu-Shen: Fan Boyang, with twelve officials\n- Ji-You: Cheng Wenchang, with fifteen officials\n- Geng-Xu: Shi Ziren, with thirteen officials\n- Xin-Hai: Zuo Zixing, with eleven officials\n- Ren-Zi: Su Shangqing, with fifteen officials\n- Gui-Chou: Jiang Hanqing, with thirteen officials\n- Jia-Yin: Ming Wenzhang, with sixteen officials\n- Yi-Mao: Dai Gongyang, with fourteen officials\n- Bing-Chen: Huo Shuying, with twelve officials\n- Ding-Si: Cui Juqing, with ten officials\n- Wu-Wu: Cong Yuanguang, with fourteen officials\n- Ji-Wei: Shi Tongqing, with seventeen officials\n- Geng-Shen: Hua Wenyang, with fifteen officials\n- Xin-You: Bing Yuanyu, with thirteen officials\n- Ren-Xu: Yue Jinqing, with eleven officials\n- Gui-Hai: Zuo Shisong, with nine officials\n\nThe names of the Six Jia spirits for each sixty-year cycle and their attending officials are as above. For each individual, determine the corresponding spirits and protective deities based on their natal year, current age, gestational month, birth month, and natal branch-stem, then invoke them by name.\n\nNext, dispelling disasters according to the Five Tones:\n\nFor a surname whose tone belongs to *Jue* (Wood), its baleful influence lies in the West (Metal). Reverently invoke the sixty-four officials of the *Bing-Ding* Eight Man Lords of the South to resolve the *Jue*-tone palace of this surname and expel the destined calamity of the Western Palace. May the Fire Virtue of the South’s *Yinghuo* Star Lord be entreated to vitalize the *Jue*-tone of the Eastern Palace, averting disaster and summoning fortune, while suppressing the harm of the *Taibai* Star’s white *qi*.\n\nFor a surname whose tone belongs to *Zhi* (Fire), its baleful influence lies in the North (Water). Reverently invoke the one thousand two hundred officials of the *Wu-Ji* Three Qin Lords of the Center to resolve the *Zhi*-tone palace of this surname and dispel the destined calamity of this palace. May the Earth Virtue of the Center’s *Zhen* Star Lord be entreated to vitalize the *Zhi*-tone of the Southern Palace, averting disaster and summoning fortune, while suppressing the harm of the *Chen* Star’s black *qi*.\n\nFor a surname whose tone belongs to *Gong* (Earth), its baleful influence lies in the East (Wood). Reverently invoke the thirty-six officials of the *Geng-Xin* Six Rong Lords of the West to resolve the *Gong*-tone palace of this surname and expel the destined calamity of the Eastern Palace. May the Metal Virtue of the West’s *Taibai* Star Lord be entreated to vitalize the *Gong*-tone of the Central Palace, averting disaster and summoning fortune, while suppressing the harm of the *Suixing* Star’s green *qi*.\n\nFor a surname whose tone belongs to *Shang* (Metal), its baleful influence lies in the South (Fire). Reverently invoke the twenty-five officials of the *Ren-Gui* Five Di Lords of the North to resolve the *Shang*-tone palace of this surname and expel the destined calamity of the Southern Palace. May the Water Virtue of the North’s *Chen* Star Lord be entreated to vitalize the *Shang*-tone of the Western Palace, averting disaster and summoning fortune, while suppressing the harm of the *Yinghuo* Star’s red and black *qi*.\n\nFor a surname whose tone belongs to *Yu* (Water), its baleful influence lies in the Center (Earth). Reverently invoke the eighty-one officials of the *Jia-Yi* Nine Yi Lords of the East to resolve the *Yu*-tone palace of this surname and expel the destined calamity of the Central Palace. May the Wood Virtue of the East’s *Suixing* Star Lord be entreated to vitalize the *Yu*-tone of the Northern Palace, averting disaster and summoning fortune, while suppressing the harm of the *Zhen* Star’s yellow and black *qi*.\n\nNext, dispelling the disasters of the Five Ghosts and the Absolute Fate:\n\nThe *Kan* Ghost Officer resides in *Dui*, and its Absolute Fate lies in *Kun*. May the *Xun* spirit named *Ming Yi*, with four divisions of generals, officers (four thousand each), and soldiers (forty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Li* Ghost Officer resides in *Gen*, and its Absolute Fate lies in *Qian*. May the *Zhen* spirit named *Xuan Ju*, with three divisions of generals, officers (three thousand each), and soldiers (thirty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Zhen* Ghost Officer resides in *Kun*, and its Absolute Fate lies in *Dui*. May the *Li* spirit named *Ming Shang*, with nine divisions of generals, officers (nine thousand each), and soldiers (ninety thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Kun* Ghost Officer resides in *Zhen*, and its Absolute Fate lies in *Kan*. May the *Gen* spirit named *Guo Yi*, with eight divisions of generals, officers (eight thousand each), and soldiers (eighty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Xun* Ghost Officer resides in *Qian*, and its Absolute Fate lies in *Gen*. May the *Kan* spirit named *Ren Wang*, with one division of generals, officers (one thousand each), and soldiers (ten thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Dui* Ghost Officer resides in *Kan*, and its Absolute Fate lies in *Zhen*. May the *Qian* spirit named *Hao Cheng*, with six divisions of generals, officers (six thousand each), and soldiers (sixty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Gen* Ghost Officer resides in *Li*, and its Absolute Fate lies in *Xun*. May the *Kun* spirit named *Jian Chong*, with two divisions of generals, officers (two thousand each), and soldiers (twenty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Qian* Ghost Officer resides in *Xun*, and its Absolute Fate lies in *Li*. May the *Dui* spirit named *Jian Yang*, with seven divisions of generals, officers (seven thousand each), and soldiers (seventy thousand each), be entreated to extend deliverance through this tribulation.\n\nDispel disasters, avert misfortune, pacify the heart and settle the mind, disperse all baleful influences, and resolve the inauspicious palaces of the Absolute Fate and Five Ghosts, causing them to submit and harmonize, thereby extinguishing the *qi* of ghosts.\n\nNext, entering the invocation:\n\nNext, consoling and instructing the Five Viscera in accordance with the Five Phases and the Four Seasons.\n\nThis spring, Wood reigns supreme, and the liver-viscus receives its *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Purple Mansion. The fountain of life flows as a spring, surging with the tides of vital fluids. May the emissaries of the Purple Tenuity Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the two eyes and returns downward to the flanks. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace. Then transmit this to the heart, spleen, lungs, and kidneys, connecting the liver in due succession.\n\nThis summer, Fire reigns supreme, and the heart-viscus receives its *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Flaming Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Crimson Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the lips and mouth and returns downward to the heart’s center. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace. Then transmit this to the spleen, lungs, kidneys, and liver, connecting the heart in due succession.\n\nThis autumn, Metal reigns supreme, and the lung-viscus receives its dark *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Pristine Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Florid Canopy Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the cheeks and jaw and returns downward to the lung’s center. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace. Then transmit this to the kidneys, liver, heart, and spleen, connecting the lungs in due succession.\n\nThis winter, Water reigns supreme, and the kidney-viscus receives its dark *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Mysterious Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Twin Convergence Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the two ears and returns downward to the Jade Sea. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace. Then transmit this to the liver, heart, spleen, and lungs, connecting the kidneys in due succession.\n\nThis late season of the four phases, when Earth reigns supreme, the spleen-viscus receives its *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Earthly Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Jade Hall Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the mouth and returns downward to the spleen’s center. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace.\n\nTransmit this to the late spring, then to the heart, spleen, lungs, kidneys, and liver, connecting them in due succession. For the late summer, transmit to the lungs, kidneys, liver, heart, and spleen, connecting them in due succession. For the late autumn, transmit to the kidneys, liver, heart, spleen, and lungs, connecting them in due succession. For the late winter, transmit to the liver, heart, spleen, lungs, and kidneys, connecting them in due succession.\n\nAnother method: For late autumn and late winter, employ warmth, harmony, and pure concentration. For spring and summer, the terms \"warmth and harmony\" are not required.\n\nNext, invoke the deities of the four seasons:\nIn spring, invoke the Four Departments’ Radiant Lord;\nIn summer, the Supreme Tenuity Jade Flower Lord;\nIn autumn, the Lesser Brilliance Golden Portal Jade Gate Lord;\nIn winter, the Great Obscurity Profound Darkness Lord.\nFor this year’s governing spirit, [name], with attendant officials numbering [count].\nFor this month’s governing spirit, [name], with attendant officials numbering [count].\nFor this day’s governing spirit, [name], with attendant officials numbering [count].\nFor this hour’s governing spirit, [name], with attendant officials numbering [count].\n\nThe yearly governing spirit is the Grand Year Spirit, which is this month’s governing spirit.\nIn years of *jia* and *ji*, the first month is established in *bing-yin*, the second in *ding-mao*, and so on through the twelve months; other years follow this pattern.\nIn years of *yi* and *geng*, the first month is established in *wu-yin*, the second in *ji-mao*.\nIn years of *bing* and *xin*, the first month is established in *geng-yin*.\nIn years of *ding* and *ren*, the first month is established in *ren-yin*.\nIn years of *wu* and *gui*, the first month is established in *jia-yin*.\nBy this method, the six *jia* of the month are known.\n\nThe day’s governing spirit is the day spirit of the preceding petition.\nThe hour’s governing spirit is also determined by the *jia* and *ji* cycle:\nOn *jia* and *ji* days, the first hour begins with *bing-yin*.\nOn *yi* and *geng* days, the first hour begins with *wu-yin*.\nOn *bing* and *xin* days, the first hour begins with *geng-yin*.\nOn *ding* and *ren* days, the first hour begins with *ren-yin*.\nOn *wu* and *gui* days, the first hour begins with *jia-yin*.\nBy this method, the six *jia* of the hour are known.\n\nNext, according to the four seasons, transmit the petition to the Jade Lads and Jade Maidens:\nIn spring, to the Azure Jade Lad and Azure-Sashed Jade Maiden;\nIn summer, to the Vermilion Jade Lad and Vermilion Jade Maiden;\nIn autumn, to the White Jade Lad and White Jade Maiden;\nIn winter, to the Profound Simplicity Great Dawn Jade Lad and Mysterious Mechanism Jade Maiden.\nEnsure it is conveyed upward to receive the profound grace.\n\nNext, proceed to the Supreme [N.] Palace and await the report:\nOn the first day, the Jade Bureau’s Crimson Void Palace;\nOn the second, the Supreme Tenuity Bureau’s Supreme Tenuity Palace;\nOn the third, the Supreme Tenuity Bureau’s Northern Peace Palace;\nOn the fourth, the Capital Rectifier Bureau’s Supreme Clarity Palace;\nOn the fifth, the Orthodox Unity Bureau’s Illuminating Communication Palace;\nOn the sixth, the Profound Unity Bureau’s Upper Clarity Palace;\nOn the seventh, the Supreme Tenuity Bureau’s Lofty Spirit Palace;\nOn the eighth, the Spirit Assembly Bureau’s Purple Tenuity Palace;\nOn the ninth, the Cinnabar Spirit Bureau’s Awaiting Spring Palace;\nOn the tenth, the Supreme Clarity Bureau’s Martial Spirit Palace;\nOn the eleventh, the Three Waters Bureau’s White Maiden Palace;\nOn the twelfth, the Registrar Bureau’s Vast Plain Palace;\nOn the thirteenth, the Pure Uncle Bureau’s Western Clarity Palace;\nOn the fourteenth, the Profound Rectifier Bureau’s Upper Crimson Palace;\nOn the fifteenth, the Central Capital Bureau’s Crooked Peace Palace;\nOn the sixteenth, the Censor Bureau’s Northern Mansion Palace;\nOn the seventeenth, the Surveillance Bureau’s Southern Perfection Palace;\nOn the eighteenth, the Governing Bureau’s Eastern Clarity Palace;\nOn the nineteenth, the Governing Registrar Bureau’s Western Spirit Palace;\nOn the twentieth, the Inspector Bureau’s Controller of Destiny Palace;\nOn the twenty-first, the Supervisor Bureau’s Yang Brilliance Palace;\nOn the twenty-second, the Examiner Bureau’s Great Yang Palace;\nOn the twenty-third, the Palace Bureau’s Lesser Yang Palace;\nOn the twenty-fourth, the Profound Heaven Bureau’s Great Yin Palace;\nOn the twenty-fifth, the Supreme Profundity Bureau’s Lesser Yin Palace;\nOn the twenty-sixth, the Capital Controller Bureau’s Northern Culmen Palace;\nOn the twenty-seventh, the Capital Observer Bureau’s Grand White Palace;\nOn the twenty-eighth, the Directing Envoy Bureau’s Forest Clarity Palace;\nOn the twenty-ninth, the Controller Bureau’s All Yangs Palace;\nOn the thirtieth, the Examiner Bureau’s Radiant Dawn Palace.\n\nThese are the thirty palace bureaus of a single month; the petition day follows this order.\n\nIf the petition is to be presented to the monthly palace, record the following at the end of the scroll:\nIn the first month, the Supreme Void Venerable’s Palace;\nIn the second, the Supreme Profound Elder’s Immortal Capital Palace;\nIn the third and fourth, the Supreme Three Heavens’ Supreme Clarity Palace;\nIn the fifth, the Supreme Dao Spirit Palace (also called the Double Dao Palace);\nIn the sixth and seventh, the Supreme Nine *Qi* Literary Prosperity Palace;\nIn the eighth, the Supreme Heavenly Thearch’s Palace;\nIn the ninth and tenth, the Supreme Great Dao Palace;\nIn the eleventh, the Supreme Attendant Left and Right Supervising Spirit Generals’ Palace;\nIn the twelfth, the Supreme Void Venerable’s Palace (same as the first month).\nIn an intercalary month, the Supreme Golden Simplicity Grand Year Palace.\n\nThe *Yuanchen* Petition and Offering Established Calendar, Scroll the Lower, is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "元辰章醮立成历 卷上 坛图法 元辰章坛四门符 右悬四门上。 於黄坛之上，若中庭净地立坛。 坛方二丈四尺，五方各安香炉，悬当方色幡盖及灯，方各七枚，合二十八，内方方又七枚，其盘中注一二者，是酌酒。 次第明，立榜贴，左右异行，勿令迷谬也。 章信 镇坛信钱一千二百文。 白米一石二斗。 白素四十尺。 等子一百二十枚。 清油一斗二升。 青丝线一百二十尺。 金人一形。 金环一双。 书刀一口。 纸一百张。 笔两管。 墨一梃。 净席一领。 朱一两。 香一斤。 银条脱一枚。 右一十六件，备天官仪信，人各办之。 唯夫妻同年，共属一宿、一天府，得共此，亦从贫富量之。 醮法 五方香案。",
      "translated_text": "**The Complete Ritual Manual for Yuanchen Offerings and Jiao Ceremonies, Volume One: Altar Diagrams and Methods**\n\n**Yuanchen Altar with Four Gates and Talismans**\nThe talismans for the four gates are to be hung above each respective gate. Construct the altar upon a yellow platform, or establish it in a purified space within the central courtyard. The altar shall be square, measuring twenty-four *chi* on each side. Place an incense burner in each of the five directions, and suspend banners, canopies, and lamps in the corresponding directional colors—seven for each direction, totaling twenty-eight, with an additional seven within each inner direction. The trays marked with numbers one and two are for pouring libations of wine.\n\nProceed in proper sequence, erecting placards and affixing them, with left and right paths distinct to prevent confusion.\n\n**Offering Pledges (Zhangxin)**\n- **Altar-securing pledge money:** 1,200 *wen*\n- **White rice:** 1 *shi* and 2 *dou*\n- **White silk:** 40 *chi*\n- **Weights (for scales):** 120 pieces\n- **Pure oil:** 1 *dou* and 2 *sheng*\n- **Green silk thread:** 120 *chi*\n- **Golden figurine:** 1\n- **Golden rings:** 1 pair\n- **Scribing knife:** 1\n- **Paper:** 100 sheets\n- **Brushes:** 2\n- **Inkstick:** 1\n- **Pure mat:** 1\n- **Cinnabar:** 1 *liang*\n- **Incense:** 1 *jin*\n- **Silver ingot:** 1\n\nThe above sixteen items constitute the ritual pledges for the Celestial Officials’ ceremony, to be prepared by each participant. Only couples born in the same year, sharing the same celestial mansion and heavenly府, may combine their offerings, adjusting quantities according to their means.\n\n**Jiao Ceremony Method**\nFive-directional incense altars.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 285,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.3936767578125,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "非旧香贴，须方色巾。 香炉五具。 并奁。 酒樽六。 并杓。 五色伞及幡。 五帝大幡五首。 白米一大斗。 枣栗杂果各一升，时新果子多为佳。 五色纹缯依方数。 好酒五斗。 白脯三斤。 油煎令香。 米钙稞各三种。 蜜和为佳。 纂十六枚，长一丈二尺，三节茅缚。 左绳二十六丈。 灯三十六并纂。 五方二十八宿，中央又七，更一椀灯。 净席箪十三领。 历席白布二疋。 盥豉各五升。 分五方盘四十九面。 坛内十二，五帝五，北斗七，三台一十二，时神二十四。 盏八十六口。 内七十二口，外十四口。 右前件醮具、饮食种种罗列，并令精洁甘美。 所营造饭食，必须清净香汤沐浴，然造作。 稞食自不精者，不须入也。 罗列讫，次酌酒。 先从五帝盘东方起，左回。 次酌七星，先从魁向冈。 次酌三台，左行。 次酌十二时神，从亥子，左回，讫成。 次酌二十八宿，先从东方角宿起，左迥讫至斡，三行酒讫。 次闭目，内思相见天地神祇，一切森林罗列，然后来到。 次勑纂符咒： 臣谨劫直符将军甲子诸君，谁直今岁，谁直今月，谁直今日，谁直今时，某入靖拜章，断绝众精，有邪斩杀。 急急如律令。 次向天门咒曰：",
      "translated_text": "**Jiao Ceremony Requisites**\n\n- **Incense pouches (if not using old ones):** square-colored kerchiefs\n- **Incense burners:** 5, with lidded boxes\n- **Wine vessels:** 6, with ladles\n- **Five-colored canopies and banners**\n- **Five Emperors’ great banners:** 5 heads\n- **White rice:** 1 large *dou*\n- **Jujubes, chestnuts, and assorted fruits:** 1 *sheng* each; seasonal fresh fruits preferred\n- **Five-colored patterned silks:** quantities corresponding to the directions\n- **Fine wine:** 5 *dou*\n- **Dried white meat:** 3 *jin*, fried until fragrant\n- **Rice cakes and pastries:** 3 varieties each, preferably mixed with honey\n- **Torches:** 16, each 1 *zhang* and 2 *chi* long, bound with three sections of thatch\n- **Left-hand ropes:** 26 *zhang*\n- **Lamps:** 36, with torches\n- **Twenty-eight lunar mansions of the five directions, plus seven central mansions:** 1 additional bowl lamp\n- **Pure mats and bamboo trays:** 13\n- **Ritual mats of white cloth:** 2 bolts\n- **Hand-washing basins and fermented beans:** 5 *sheng* each\n- **Plates for the five directions:** 49 in total\n  - **Within the altar:** 12\n  - **Five Emperors:** 5\n  - **Northern Dipper:** 7\n  - **Three Terraces:** 12\n  - **Seasonal deities:** 24\n- **Cups:** 86 in total\n  - **Inner cups:** 72\n  - **Outer cups:** 14\n\nThe above Jiao ceremony implements and food offerings must be arranged with utmost purity, sweetness, and excellence. All prepared meals must be made after bathing with clean, fragrant water. If any grain-based food is not refined, it should not be included.\n\nOnce the arrangement is complete, proceed to pour the wine:\n1. Begin with the Five Emperors’ plates, starting from the east and circling left.\n2. Next, pour for the Seven Stars, beginning with *Kui* and proceeding toward *Gang*.\n3. Then, pour for the Three Terraces, moving left.\n4. Next, pour for the twelve seasonal deities, starting from *Hai* and *Zi*, circling left to completion.\n5. Finally, pour for the twenty-eight lunar mansions, beginning with *Jiao* in the east and circling left to *Zhen*, completing three rounds of libation.\n\nThen, close your eyes and inwardly visualize the gods and spirits of heaven and earth, all arrayed in solemn assembly, before proceeding.\n\nNext, recite the torch talisman and incantation:\n*\"Your servant humbly invokes the Straight-Command Talisman Generals, the Lords of Jia-Zi, those on duty this year, this month, this day, this hour. So-and-so enters the oratory to present a memorial, severing all demonic influences—slay the evil! Swiftly, swiftly, as in law and decree!\"*\n\nThen, facing the Heavenly Gate, recite the incantation:",
      "overlap_context": "1\n- **Paper:** 100 sheets\n- **Brushes:** 2\n- **Inkstick:** 1\n- **Pure mat:** 1\n- **Cinnabar:** 1 *liang*\n- **Incense:** 1 *jin*\n- **Silver ingot:** 1\n\nThe above sixteen items constitute the ritual pledges for the Celestial Officials’ ceremony, to be prepared by each participant. Only couples born in the same year, sharing the same celestial mansion and heavenly府, may combine their offerings, adjusting quantities according to their means.\n\n**Jiao Ceremony Method**\nFive-directional incense altars.",
      "start_char": 285,
      "end_char": 739,
      "start_sentence": 29,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.994542598724365,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天地开张，鬼道相亡。 今日安坛，臣欲奏章。 西北之维，戌亥中央。 天门在此，执录不祥。 急急如太上老君律令。 次向地户咒曰： 生炁流通，百邪万精，不与真同。 今日奏章，乃立坛场。 东南之维，辰巳中央，地户於此，收录凶殃。 急急如太上老君律令。 次向鬼门咒曰： 阳光流明，百邪不生。 今欲奏章，先立坛庭。 东北之维，丑寅中央。 鬼门考鬼，执录邪精。 急急如太上老君律令。 次人门咒曰： 出阴入阳，太上使我。 五内开张，大神闻之。 皆走严装，今日奏章。 西南之维，申未中央。 收摄百鬼，何有敢当。 急急如太上老君律令。 次入坛，从天门入，至东方香案前，上香叩齿九通。 咒曰： 东方九炁，青天明星。 大神焕照，东乡洞映。 九门转烛，阳光扫秽除氛。 开明童子，备卫我轩。 收魔东妖，上对帝君。 奉承正道，赤书玉文。 九天符命，摄龙驿传。 普天安镇，我得飞仙。 次至南方香案前，上香叩齿三通。 咒曰： 南方丹天，三黑流光。 荧星转烛，洞照太阳。 上有赤精，开明灵童。 总御火兵，备守三宫。 斩邪东妖，剪截魔王。 北帝所承，风火八冲。 流铃交焕，敢有不从。 正道流行，我享上功。 保天长存，亿劫无终。 次至西方香案前，上香叩齿七通，咒曰： 西方七炁，素天太白。 流精光耀，金门洞朗。 太冥中有素皇，号曰帝灵。 保神安镇，卫我身形。 断截邪源，王道正明。 宫殿整肃，三景齐并。 道合自然，飞升紫庭。 灵宝符命，普惠万生。 功加一切，天地成宁。 次至北方香案前，上香叩齿五通。 咒曰： 北方玄天，五炁徘徊。 辰星焕烂，光耀太微。 炁灵尊神，飞玄羽衣。 备卫五门，检精捕非。 敢有干试，豁落斩摧。 王符所告，神真八威。 邪门闭塞，正道明开。 映照我身，三光同辉。 策空驾浮，举形仙飞。 次至中央香案前，上香叩齿十二通。 咒曰： 中央黄中，理炁总统。 玄真镇星，吐辉流焕。 九天开光童子，一十二人。 元炁阳精，焰上朱烟。 洞照一宅，及得我身。 百邪摧落，杀鬼万千。 中山神咒，普天使然。 五灵安镇，身飞上仙。 又别五方咒文用之，与前同，拜章立坛，兼用并佳： 东方开明，招真大神。 身着青衣黑帧，身广百步。 头长柱天，至食邪鬼。 口容山岳，朝食五百，暮啖万千。 十十五五，本口衣而吞。 南方丹天三炁君，赤衣赤积，领赤神王。 至捕百鬼，须肉万斤。 太阳使者，系火幡，各课一条，得便分肉，谈食血流津。 西方七炁白天君，衣白衣，身长万丈，面皱厘，手持大铁棒。 空中飞至，捕百鬼，得便夷啖肝食肺。 我世资太白助，司并灵威。 北方黑灵太微君，好生恶杀。 五炁尊辰星助化，卫侍端开福闭祸，拔幽魂。 无量之邪不敢干，收魔束魅付帝君。 中央黄帝，中宫总御四方。 玄真礼敬斩魔王，五星安镇当照匡。 五香荡尸秽不起，六天邪精不敢当，今日诵咒万鬼心。 一十二人主阳光，照此宅观身丁强。 先叩齿二十四通，发炉： 太上玄元五灵老君、三炁正神，急召臣等身中五体真官、三五功曹、上下大夫、左右龙虎君、捧香使者、传言素女、执案童子，各二十四人，尚书仆射通事小吏十二人。 急上关启无上三天玄元大道十方太上，臣等正尔，谨为某乙分解灾厄，烧香启闻，愿得八方正炁入臣等身中。",
      "translated_text": "The heavens unfold, the earth expands—ghostly paths perish.\nToday I establish the altar; your servant desires to present a memorial.\nAt the northwest quadrant, the center of *Xu* and *Hai*,\nHere lies the Heavenly Gate, seizing and recording all inauspiciousness.\nSwiftly, swiftly, as in the statutes and decrees of the Most High Lord Lao!\n\nNext, facing the Earthly Portal, recite the incantation:\nVital *qi* flows unobstructed—hundreds of demons and myriad spirits\nDo not share the truth’s nature.\nToday I present a memorial, having established the altar ground.\nAt the southeast quadrant, the center of *Chen* and *Si*,\nHere lies the Earthly Portal, gathering and recording all misfortune.\nSwiftly, swiftly, as in the statutes and decrees of the Most High Lord Lao!\n\nNext, facing the Ghost Gate, recite the incantation:\nYang’s light streams radiant—no demon dares arise.\nNow I desire to present a memorial, first establishing the altar court.\nAt the northeast quadrant, the center of *Chou* and *Yin*,\nHere lies the Ghost Gate, examining ghosts and seizing demonic spirits.\nSwiftly, swiftly, as in the statutes and decrees of the Most High Lord Lao!\n\nNext, the Human Gate incantation:\nEmerging from yin, entering yang—the Most High sends me forth.\nThe five viscera unfold; the great spirits hear this.\nAll hasten to don solemn attire; today I present a memorial.\nAt the southwest quadrant, the center of *Shen* and *Wei*,\nGathering and capturing all ghosts—who dares oppose?\nSwiftly, swiftly, as in the statutes and decrees of the Most High Lord Lao!\n\nNext, enter the altar through the Heavenly Gate, proceeding to the eastern incense table. Offer incense and strike the teeth nine times. Recite:\nThe nine *qi* of the east, the Azure Heaven’s bright star,\nGreat spirits radiate, illuminating the eastern quarter with penetrating light.\nNine gates turn like candles; yang’s light sweeps away filth and miasma.\nThe Luminous Youth attends, guarding my hall.\nSubduing eastern demons, reporting to the Imperial Lord,\nUpholding the true Dao, the vermilion script of jade.\nThe nine heavens’ talismanic command dispatches dragon couriers.\nAll under heaven is pacified; I attain transcendence.\n\nProceed to the southern incense table. Offer incense and strike the teeth three times. Recite:\nThe Cinnabar Heaven of the south, threefold black radiance flowing,\nThe Fire Star revolves like a candle, penetrating the Great Yang.\nAbove dwell the crimson spirits, the Luminous Youths.\nCommanding the fire soldiers, guarding the three palaces,\nSlaying eastern demons, severing demon kings.\nAs the Northern Emperor decrees, the eight winds of fire surge.\nInterlocking bells blaze—who dares disobey?\nThe true Dao flows; I receive supreme merit.\nPreserving heaven’s longevity, enduring through kalpas without end.\n\nProceed to the western incense table. Offer incense and strike the teeth seven times. Recite:\nThe seven *qi* of the west, the White Heaven’s Great White,\nFlowing essence shines brilliantly; the Metal Gate gleams.\nWithin the Great Darkness dwells the White Sovereign, named Imperial Spirit.\nProtecting and pacifying spirits, guarding my form,\nSevering demonic roots, the kingly Dao shines clearly.\nPalaces are ordered; the three luminaries align.\nThe Dao harmonizes with nature; I ascend to the Purple Court.\nThe numinous treasure’s talismanic command universally benefits all beings.\nMerit extends to all; heaven and earth attain peace.\n\nProceed to the northern incense table. Offer incense and strike the teeth five times. Recite:\nThe Mysterious Heaven of the north, five *qi* meandering,\nThe Chronogram Star blazes, illuminating the Supreme Subtlety.\nThe *qi*-spirit’s honored deity, clad in flying dark feathers,\nGuards the five gates, inspecting essences and capturing transgressors.\nWho dares test me? The Falling Star severs and crushes.\nAs the royal talisman proclaims, the eight mights of divine truth,\nDemon gates close; the true Dao shines forth.\nIlluminating my body, the three lights unite in splendor.\nI spur the void and ride the floating; my form ascends in immortal flight.\n\nProceed to the central incense table. Offer incense and strike the teeth twelve times. Recite:\nThe Yellow Center of the center, governing *qi* and unifying all,\nThe Mysterious True Star of the Pole shines forth with flowing radiance.\nNine Heavenly Luminous Youths, twelve in number,\nPrimal *qi* and yang essence flame upward in vermilion smoke.\nPenetrating this dwelling and my body,\nHundreds of demons are cast down; myriad ghosts are slain.\nThe Central Mountain’s divine incantation universally commands.\nThe five spirits pacify; my body ascends as an immortal.\n\nAdditionally, the five directional incantations may be employed as before—equally efficacious for memorial presentations and altar establishments:\n\nThe east’s Luminous One summons the true great spirits,\nClad in azure robes with black sashes, their forms spanning a hundred paces.\nTheir heads reach the heavens, devouring demonic ghosts.\nTheir mouths hold mountains, consuming five hundred at dawn and ten thousand at dusk.\nTen by ten, five by five—they swallow with their own robes.\n\nThe Lord of the Three *Qi* of the Cinnabar Heaven of the south,\nClad in crimson robes, leading the Red Spirit Kings,\nCaptures all ghosts, requiring ten thousand catties of flesh.\nThe Solar Envoys, bearing fire banners, each receive a portion,\nFeasting until blood flows like rivers.\n\nThe Lord of the Seven *Qi* of the White Heaven of the west,\nClad in white, his form ten thousand *zhang* tall,\nHis face wrinkled, wielding a great iron rod.\nFlying through the void, he captures all ghosts,\nDevouring livers and consuming lungs at will.\nI rely on the Great White’s assistance, the awe of numinous might.\n\nThe Black Numinous Lord of the Supreme Subtlety of the north,\nWho loves life and abhors killing,\nThe honored Chronogram Star of the five *qi* aids transformation,\nAttending to blessings and averting misfortune, delivering souls from darkness.\nCountless demons dare not intrude; bound specters are handed to the Imperial Lord.\n\nThe Yellow Emperor of the center, governing the four directions from the central palace,\nThe Mysterious True pays reverence, slaying demon kings.\nThe five stars pacify and guard; the radiance shines upon the realm.\nFive fragrances dispel corpse impurities; noxious *qi* does not arise.\nThe six heavens’ demonic spirits dare not oppose.\nToday, reciting the incantation, the hearts of myriad ghosts tremble.\nTwelve masters of yang’s light illuminate this dwelling and my body, strengthening its essence.\n\nFirst, strike the teeth twenty-four times and activate the censer:\nMost High Mysterious Origin, Five Numinous Lord Lao, Three *Qi* True Spirits,\nUrgent summons to the five true officials within your servant’s body,\nThe Three and Five Merit Officers, the upper and lower great ministers,\nThe Left and Right Dragon-Tiger Lords, the incense-bearing envoys,\nThe message-transmitting Celestial Maidens, the document-holding youths—\nTwenty-four each—and the twelve minor officials of the President of the Secretariat and the Director of Communications.\nHasten to report to the Most High of the Ten Directions, the Mysterious Origin Great Dao of the Three Heavens above.\nYour servants now, with utmost reverence, perform rites for so-and-so to dissolve calamities.\nBurning incense, we humbly announce our wish for the eight directions’ true *qi* to enter our bodies.",
      "overlap_context": " visualize the gods and spirits of heaven and earth, all arrayed in solemn assembly, before proceeding.\n\nNext, recite the torch talisman and incantation:\n*\"Your servant humbly invokes the Straight-Command Talisman Generals, the Lords of Jia-Zi, those on duty this year, this month, this day, this hour. So-and-so enters the oratory to present a memorial, severing all demonic influences—slay the evil! Swiftly, swiftly, as in law and decree!\"*\n\nThen, facing the Heavenly Gate, recite the incantation:",
      "start_char": 739,
      "end_char": 2023,
      "start_sentence": 69,
      "end_sentence": 165,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.656588554382324,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "所启速达，径御太上玉皇帝几前。 次诵迎神赞 今日祠五帝，口奏归玄虚。 自然通生灵，落落长夜书。 请命元为门，委托东帝夫。 官事悉解散，百病一切除。 晃晃五帝，常安不倾。 能化一切，蝖飞有形。 天地之位，与道俱生。 处高不峻，处飞不倾。 处幽不显，处浊不清。 刚柔随俗，名之曰灵。 今欲消灾，杀鬼魔兵。 清酒鹿脯，归迎太明。 五帝享之，施其长生。 司命益算，更上生名。 堂堂北户，知人死籍。 今日口奏，玄女龙驿。 当留家亲，诛戮恶逆。 病者康宁，系者解释。 与圣俱游，名上玉历。 次长跪",
      "translated_text": "The announcement swiftly ascends, directly presented before the Jade Emperor’s celestial throne.\n\nNext, recite the *Hymn of Welcoming the Divine*:\n\nToday we sacrifice to the Five Emperors,\nOur words ascend to the Mysterious Void.\nBy nature, they reach the numinous spirits,\nInscribed in the endless records of night.\nWe beseech the Primal Gate as our portal,\nEntrusting ourselves to the Lord of the East.\nAll official matters are dissolved,\nEvery illness is wholly dispelled.\n\nRadiant Five Emperors,\nEver steadfast, never faltering.\nThey transform all things,\nEven the crawling and flying take form.\nTheir place is with Heaven and Earth,\nBorn together with the Dao.\nAbiding in height yet not aloof,\nSoaring yet never tilting.\nDwelling in darkness yet not hidden,\nResiding in turbidity yet not sullied.\nHard and soft adapt to custom—\nThus are they called divine.\n\nNow we seek to dispel calamity,\nTo vanquish demonic legions.\nWith pure wine and dried venison,\nWe welcome the Great Luminance.\nThe Five Emperors partake,\nBestowing long life.\nThe Controller of Destiny extends our years,\nInscribing our names anew in the register of life.\n\nMajestic Northern Portal,\nKeeper of the ledger of mortal death—\nToday our words ascend,\nThrough the Mystic Maiden and Dragon Couriers.\nLet our kin remain unharmed,\nWhile the wicked and rebellious are slain.\nMay the sick recover,\nMay the bound be freed.\nTogether with the sages we wander,\nOur names recorded in the Jade Chronicle.\n\nNext, kneel in reverence.",
      "overlap_context": "essage-transmitting Celestial Maidens, the document-holding youths—\nTwenty-four each—and the twelve minor officials of the President of the Secretariat and the Director of Communications.\nHasten to report to the Most High of the Ten Directions, the Mysterious Origin Great Dao of the Three Heavens above.\nYour servants now, with utmost reverence, perform rites for so-and-so to dissolve calamities.\nBurning incense, we humbly announce our wish for the eight directions’ true *qi* to enter our bodies.",
      "start_char": 2023,
      "end_char": 2257,
      "start_sentence": 166,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.047300577163696,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "具法位，系天师其治炁祭酒云：某等稽首再拜，谨奉请东方九炁君、东岳泰山府君、岱宗句芒青帝君、岁星君，南方三炁君、南岳衡山府君、祝融赤帝君、荧惑星君，西方七炁君、西岳华山府君、蓐收白帝君、太白星君，北方五炁君，北岳怛山府君、玄冥五帝君、辰星君，中央十二炁君、中岳嵩山府君、轩辕黄帝君、镇星君，愿赐来临。 奉请东方九夷甲乙君、寅卯青帝解厄神君，南方八蛮丙丁君、巳午赤帝解厄神君，西方六戎庚辛君、申酉白帝解厄神君，北方五狄壬癸君、亥子黑帝解厄神君，中央三秦戊己君、辰戌丑未黄帝解厄神君，愿赐来临。 奉请东方岁星君、东辰东斗君、角亢氏房心尾箕七宿解厄君，南方荧惑星君、南辰南斗君、井鬼柳星张翼轸七宿解厄君，西方太白星君、西辰西斗君、奎娄胃昴毕觜参七宿解厄君，北方辰星君、北辰北斗君、斗牛女虚危室壁七宿解厄君，中央镇星君、中台君、中斗君，□□□□□□□七宿解厄神君等，并愿慈光，特垂降临。 某等再拜，用献芳醪。 初献酒 奉请天上解厄神君、地上解厄神君、日月解厄神君、司命解厄神君、四时解厄神君、解元辰星君、解勾绞神君、解大杀小杀神君、解律邢历刑君、大会小会君、解厌元会元君、却杀厄四时司命君、五星司命君、五帝司命君、五岳司命君、六甲司命君、七星司命命君、土官司命君、中真土公司命君、某家丈人司＇命看、某家宠君司命君、当路司命君、直岁司命君、直月司命君、直日司命君、今诗司命君、某本命司命君、某胎司命君、某生月司命君、某行年司命君、九州社公社令社稷真官、里域真官、八部神将、土地真官、诸神君等，降临位座，某等再拜，用献芳醪。 二献酒 臣某上启：臣以凡陋，天性顽鄙，曲蒙玄慈，所建师老垂恩。 受法之日，引五保七证，上谒三天皇老玄尊，中明十方，下与万灵为契。 师真要言约，当佐天理炁，助国扶命，救生度死，为一切桥梁。 但为俗运凋零，鬼神交会，三灾流行，瘟疫狂邪，无处不有。 四百四病，布流民问，众厄互缠，难可闻见。 凡有归告，不敢抑塞，不胜所见。 谨有某州县乡里官男女生人某，年若干岁，峦召百。 灾厄深重，胎年生月之上，为魁罡所临，众忌互加，凶灾临身。 行年本命之上，并见罗网所缠。 本命支干，生月支干，并相克贼，恶星丑宿临身。 或四杀所加，五鬼所克。 或六害所临，七伤所损。 或八风围绕，九厄回行。 招延不利，致疾病淹笃，颜容消羸，气力衰微，随病云云无数。 或恐魂魄飞扬。 或经睑难。 或随没山泉鬼牢之中。 或被邪魅缠绕，众魔拘执。 宫府百节，各有司守。 精神弗爽，百祸自臻。 天有否剥，灾害因生。 人有衰厄，亦罹灾、殃。 算命穷尽，应有凋零。 或三元绝灾，事没明堂。 或年命支干堕於孤虚没灭之中，年命运值太岁不祥之辰。 或九宫八卦，更相伤绝。 或五鬼四杀，乘隙生灾。 或五藏空虚，四方刑祸。 八风毒气与九丑等鬼，世上故炁奸邪魍魉，自劳冷入人身中，屯结五藏，游行骨髓，扇动七魄，内生奸贼。 肉人顽愚，爱惜身命，贪生畏死，不知修何功德，可以自拔。 伏闻太上大慈，好生恶死，开天张地，养育苍生，罪无轻重，皆许首悔，无大无小，开其解救。",
      "translated_text": "Having assumed the dharma-position, the Celestial Master’s qi-regulating Libationer declares:\n\nWe, [Name] and company, bow our heads and prostrate ourselves twice, respectfully invoking the Lords of the Nine Qi of the East, the Lord of the Eastern Peak of Mount Tai, the Lord of Mount Dai and Goumang the Green Emperor, and the Lord of Jupiter; the Lords of the Three Qi of the South, the Lord of the Southern Peak of Mount Heng, the Blazing Emperor of Red, and the Lord of Mars; the Lords of the Seven Qi of the West, the Lord of the Western Peak of Mount Hua, Rushou the White Emperor, and the Lord of Venus; the Lords of the Five Qi of the North, the Lord of the Northern Peak of Mount Heng, the Dark and Mysterious Five Emperors, and the Lord of Mercury; the Lords of the Twelve Qi of the Center, the Lord of the Central Peak of Mount Song, the Yellow Emperor Xuanyuan, and the Lord of Saturn. May they deign to descend and attend.\n\nWe invoke the Lords of the Nine Yi of Jia and Yi, the Green Emperor of Yin and Mao who dispels calamity; the Lords of the Eight Man of Bing and Ding, the Red Emperor of Si and Wu who dispels calamity; the Lords of the Six Rong of Geng and Xin, the White Emperor of Shen and You who dispels calamity; the Lords of the Five Di of Ren and Gui, the Black Emperor of Hai and Zi who dispels calamity; the Lords of the Three Qin of Wu and Ji, the Yellow Emperor of Chen, Xu, Chou, and Wei who dispels calamity. May they deign to descend and attend.\n\nWe invoke the Lord of Jupiter of the East, the Lords of the Eastern Constellation and Eastern Dipper, and the Lords who dispel calamity from the Seven Lodges of Jiao, Kang, Di, Fang, Xin, Wei, and Ji; the Lord of Mars of the South, the Lords of the Southern Constellation and Southern Dipper, and the Lords who dispel calamity from the Seven Lodges of Jing, Gui, Liu, Xing, Zhang, Yi, and Zhen; the Lord of Venus of the West, the Lords of the Western Constellation and Western Dipper, and the Lords who dispel calamity from the Seven Lodges of Kui, Lou, Wei, Mao, Bi, Zi, and Shen; the Lord of Mercury of the North, the Lords of the Northern Constellation and Northern Dipper, and the Lords who dispel calamity from the Seven Lodges of Dou, Niu, Nü, Xu, Wei, Shi, and Bi; the Lord of Saturn of the Center, the Lord of the Central Terrace, the Lord of the Central Dipper, and the Lords who dispel calamity from the Seven Lodges of [missing text]. May their merciful radiance deign to descend and attend.\n\nWe, [Name] and company, bow twice and offer fragrant wine.\n\n**First Libation**\nWe invoke the Lords who Dispel Calamity of Heaven, Earth, Sun, and Moon; the Lord who Dispels Calamity of the Controller of Destiny; the Lords who Dispel Calamity of the Four Seasons; the Lord of the Origin-Dispelling Star; the Lords who Dispel the Entangling and Binding Spirits; the Lords who Dispel the Great and Lesser Slaughters; the Lords who Dispel the Punishments of Law and Penal Codes; the Lords of the Great and Lesser Assemblies; the Lords who Dispel the Ominous Origins; the Lords who Repel Slaughter and Calamity of the Four Seasons; the Lords who Govern Destiny of the Five Planets; the Lords who Govern Destiny of the Five Emperors; the Lords who Govern Destiny of the Five Peaks; the Lords who Govern Destiny of the Six Jia; the Lords who Govern Destiny of the Seven Stars; the Lord who Governs Destiny of the Earth Office; the Lord who Governs Destiny of the Central Perfected Earth; the Lord who Oversees Destiny of our Household Elder; the Lord who Governs Destiny of our Household Ancestor; the Lord who Governs Destiny of the Crossroads; the Lord who Governs Destiny of the Current Year; the Lord who Governs Destiny of the Current Month; the Lord who Governs Destiny of the Current Day; the Lord who Governs Destiny of the Present Hour; the Lord who Governs Destiny of our Natal Star; the Lord who Governs Destiny of our Embryo; the Lord who Governs Destiny of our Birth Month; the Lord who Governs Destiny of our Current Age; the Perfected Officers of the Nine Provinces’ Earth Altars, Earth Lords, and Earth Spirits; the Perfected Officers of the Village Domains; the Generals of the Eight Divisions; the Perfected Officers of the Local Earth Gods; and all the Lords of the Spirits. May they descend to their positions and seats. We, [Name] and company, bow twice and offer fragrant wine.\n\n**Second Libation**\nYour servant, [Name], humbly petitions:\n\nThough base and unworthy, of dull and coarse nature, I have been graciously favored by the profound compassion of the Elder Master who bestowed this dharma. On the day I received the precepts, I was led by five guarantors and seven witnesses to ascend and pay homage to the Three Heavenly Venerables, to declare my vows to the Ten Directions, and to form a pact with the myriad spirits. The true and essential words of the Master bound me to assist in the governance of qi by Heaven, to aid the state and sustain life, to rescue the living and deliver the dead, and to serve as a bridge for all beings.\n\nYet the fortunes of the world have withered, and spirits and demons intermingle. The Three Calamities spread unchecked, and plagues, madness, and malevolence arise everywhere. The four hundred and four diseases afflict the people, and countless calamities entwine them, making it difficult to hear or see their suffering. Whenever supplications are made, I dare not ignore or obstruct them, though I am overwhelmed by what I witness.\n\nThus, I respectfully present [Name], an official, man or woman, of [State, County, Village], aged [number] years, whose destiny has been summoned by a hundred misfortunes. Their calamities run deep, for in the year and month of their birth, they were afflicted by the presence of the Demon-Star and the Celestial Net. Numerous taboos converged, and inauspicious disasters befell them. In the year of their current age and their natal star, they are ensnared by the Web of Doom. The branches and stems of their natal star and birth month clash and harm one another, while baleful stars and ominous lodges descend upon them. They may be struck by the Four Slaughters or assailed by the Five Ghosts, afflicted by the Six Harms or wounded by the Seven Injuries. They may be encircled by the Eight Winds or beset by the Nine Calamities. Misfortune follows them, bringing lingering illness, emaciation, and the decline of their strength and vitality, with countless ailments arising. Their soul may take flight, or they may face mortal peril. They may be confined in the ghostly prisons of mountains and springs, or tormented by malevolent spirits and bound by demonic hordes. Each joint and organ is guarded by its own spirit, and when their essence and spirit falter, a hundred misfortunes naturally arise.\n\nWhen Heaven is obstructed, disasters and harms are born. When humans encounter decline and calamity, they too suffer misfortune and woe. Their allotted lifespan may be exhausted, and their fate may wither. They may face the Three Origins’ absolute calamities, or their affairs may be obscured in the Hall of Light. The branches and stems of their year and fate may fall into the desolation of solitude and void, or their fate may coincide with the inauspicious year of the Grand Year-Star. The Nine Palaces and Eight Trigrams may clash and sever one another, or the Five Ghosts and Four Slaughters may seize the opportunity to bring disaster. Their five viscera may be depleted, and the four directions may bring punishment and misfortune. The poisonous qi of the Eight Winds and the ghosts of the Nine Uglies, along with the perverse and malevolent specters of the world’s old qi, may invade their body, congealing in the five viscera, roaming through the marrow, and stirring the seven po. Within, they breed treachery. The fleshly body, dull and foolish, clings to life and fears death, unaware of what merit or virtue might extricate it.\n\nI have heard that the Great Compassion of the Most High loves life and abhors death. Having opened Heaven and spread Earth, nurturing all living beings, it permits repentance for sins of any magnitude, offering deliverance to all, great and small.",
      "overlap_context": "he Five Emperors partake,\nBestowing long life.\nThe Controller of Destiny extends our years,\nInscribing our names anew in the register of life.\n\nMajestic Northern Portal,\nKeeper of the ledger of mortal death—\nToday our words ascend,\nThrough the Mystic Maiden and Dragon Couriers.\nLet our kin remain unharmed,\nWhile the wicked and rebellious are slain.\nMay the sick recover,\nMay the bound be freed.\nTogether with the sages we wander,\nOur names recorded in the Jade Chronicle.\n\nNext, kneel in reverence.",
      "start_char": 2257,
      "end_char": 3497,
      "start_sentence": 188,
      "end_sentence": 225,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.24227428436279,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "黄帝之时人民，上寿百二十岁，中寿百岁，下寿八十岁，三期已下，皆被天枉。 某今既遭灾厄，是以敢於考掠之丁，披肝露心。 谨赍命米、白素、五方五色纹缯、算子、清油、酒脯、香饼、甘果、续命青丝、金人、金环、朱香、银条脱、书刀、笔纸墨、五方度命幡、净席等，件别见到，求乞解除厄会。 置拔命簿之具，罗列尊神之前、伏愿所请度厄尊神、算命府君、东王父、西王母、典籍拘注君、司命众神，咸在座中，交酒集义，垂恩降福。 司命司录，上请九天，推寻某乙录籍，知命长短，灾厄探浅所在。 乞上除天曹右宫黑簿，下辍太上三官死籍，更上生名。 某等再拜，用献芳醪。 次献酒 若某寿命不长，乞加其丈尺。 若树木枯槁，乞润其脂泽。 若仓谷乏少，乞加其斗斛。 算命穷尽，乞为加算益寿。 命短乞续，有灾乞消。 有祸乞灭，有衰乞扶。 有厄乞度，有鬼乞收。 罗网乞解，转祸为福。 易亡为存，回停漏刻。 东斗主算，西斗记名，北斗却死，南斗上生。 若某先世以来，有盘结基考于今不散者，乞为上解曾祖天曹考害之黑，下解后死地祇精祟。 愿除某身中灾害，随元拔擢。 若某绝命在东方，愿请北方坎神五部官将，灭鬼除凶，延度厄难。 若某绝命在南方，愿请东方震神九部官将，灭鬼除凶，延度厄难。 若某绝命在西方，愿请中央镇君十二部官将，灭鬼除凶，延度厄难。 若某绝命在北方，愿请西方兑神七部官将，灭鬼除凶、延度厄难。 若某绝命在四维，愿请南方离神三部官将，灭鬼除凶，延度厄难。 伏愿东方岁星君、东辰君、东斗君、角亢氏房心尾箕七宿君、东岳泰山君、九夷君、甲乙君、寅卯君，乞为某上解天曹考结，下解东方九万里中地祇精祟，中除某肝中厄病，消灭东方青凶、青衰、青毒、木神、木害，保护某正月、二月、三月木王相时七十二日，并乞蒙恩过度。 伏愿南方荧惑星君、南辰、南斗君、井鬼柳星张翼斡七宿君，南岳衡山君、八蛮君、丙丁君、巳午君，乞为某上解天曹考害，下解南方八万里中地祇精祟，中除某心中厄病，消灭南方赤灾、赤厄、赤鬼、赤毒、火神、火害，保护某四月、五月、六月火王相时七十二日，并乞蒙恩过度。 伏愿西方太白星君、西辰君、西斗君、奎娄胃昴毕觜参七宿君、西岳华山君、六戎君、庚辛君、申酉君，乞为某上解天曹考害，下解西方六万里中地祇精祟，中除某肺中厄病，消灭西方白灾、白厄、白温、白毒、金神、金害，保护某七月、八月、九月金王相时七十二日，并乞蒙恩过度。 伏愿北方辰星君、北辰君、北斗君、斗牛女虚危室壁七宿君、北岳怛山君、五狄君、壬癸君、亥子君，乞为某上解天曹考害，下解北方五万里中地祇精祟，中除某肾中厄病，消灭北方黑灾、黑毒、黑害、黑病、水神、水厄，保护某十月、十一月、十二月水王相诗七十二日，并乞蒙恩过度。 伏愿中央镇星君、中斗君、靛玑君、□□□□□□□七政君、中岳嵩山君、三秦君、戊己君，乞为某上解天曹考害，下解地祇精祟，中除某脾中病厄，消灭中央黄凶、黄厄、黄灾、黄毒、土贼、土鬼，保护某辰戌丑未之岁，三月、六月、九月、十二月各十八日，四季之时合七十二日，并乞无他。",
      "translated_text": "In the time of the Yellow Emperor, people’s lifespans reached their full measure: the longest lived to one hundred and twenty years, the middling to one hundred, and the shortest to eighty. Those who fell short of these three spans were cut down unjustly by Heaven. Now that I have encountered disaster and calamity, I dare, in this time of trial and tribulation, to lay bare my liver and expose my heart.\n\nWith reverence, I present offerings of life-sustaining rice, white silk, five-colored patterned silks of the five directions, counting rods, pure oil, wine and dried meats, incense cakes, sweet fruits, life-extending green threads, golden figurines, golden rings, cinnabar incense, silver ingots, a writing knife, brush, paper, ink, life-delivering banners of the five directions, and pure mats—each item duly prepared—to beseech the dissolution of this calamitous convergence. These instruments for extracting names from the Register of Destined Death are arrayed before the august deities. I humbly pray that the invoked deliverance deities, the Lords of Life’s Span, the Eastern King Father, the Western Queen Mother, the Lords of Records and Constraints, the Directors of Destiny, and all assembled gods may gather in righteous communion, bestow grace, and descend with blessings.\n\nMay the Directors of Destiny and Records ascend to the Nine Heavens, examine my name in the celestial registers, discern the length of my life, and locate the depth of my disasters and calamities. I beseech that my name be stricken from the Black Register of the Right Palace of Heaven’s Bureau, removed from the Death Ledgers of the Three Offices of the Most High, and inscribed anew in the Book of Life.\n\nProstrating again, I offer this fragrant wine.\n\nNext, the second libation:\nIf my lifespan is too short, I beg that its measure be extended.\nIf trees wither and dry, I beg that their sap and luster be restored.\nIf granaries lack grain, I beg that their bushels be replenished.\nIf my allotted span nears its end, I beg for added years to prolong my life.\nIf my life is brief, I beg for its continuation; if disaster looms, I beg for its dissolution.\nIf misfortune threatens, I beg for its eradication; if decline sets in, I beg for its reversal.\nIf calamity approaches, I beg for its deliverance; if ghosts assail, I beg for their capture.\nIf snares entangle, I beg for their unraveling; may misfortune be transformed into fortune.\nMay what is lost be restored, and fleeting moments be prolonged.\nThe Eastern Dipper governs life’s span, the Western Dipper records names,\nThe Northern Dipper averts death, the Southern Dipper bestows life.\n\nIf from my ancestors to this day, lingering entanglements of karmic retribution remain unresolved, I beg that the black records of Heaven’s Bureau be cleared of their harm, and that the earthly spirits and malevolent forces afflicting my descendants be dissolved. May the disasters within my body be eradicated, and my primordial destiny be uplifted.\n\nIf my life is fated to end in the East, I beseech the gods of the Northern Kan trigram and the five divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\nIf my life is fated to end in the South, I beseech the gods of the Eastern Zhen trigram and the nine divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\nIf my life is fated to end in the West, I beseech the Central Lord of Stability and the twelve divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\nIf my life is fated to end in the North, I beseech the gods of the Western Dui trigram and the seven divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\nIf my life is fated to end in the four corners, I beseech the gods of the Southern Li trigram and the three divisions of their officials to extinguish ghosts, dispel misfortune, and extend my deliverance from calamity.\n\nI humbly pray to the Lords of Jupiter, the Eastern Chen, the Eastern Dipper, the Seven Lords of the Horn, Neck, Root, Heart, Tail, and Winnowing Basket constellations, the Lord of Mount Tai of the Eastern Marchmount, the Lords of the Nine Yi, the Lords of Jia and Yi, and the Lords of Yin and Mao: may they dissolve the karmic entanglements recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces within the nine myriad li of the East. May they eradicate the afflictions within my liver, dispel the green disasters, green calamities, green poisons, wood spirits, and wood harms of the East, and protect me during the seventy-two days of the Wood’s flourishing season in the first, second, and third months, that I may pass through this time by your grace.\n\nI humbly pray to the Lords of Mars, the Southern Chen, the Southern Dipper, the Seven Lords of the Well, Ghost, Willow, Star, Spread, Wing, and Axle constellations, the Lord of Mount Heng of the Southern Marchmount, the Lords of the Eight Man, the Lords of Bing and Ding, and the Lords of Si and Wu: may they dissolve the karmic harm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces within the eight myriad li of the South. May they eradicate the afflictions within my heart, dispel the red disasters, red calamities, red ghosts, red poisons, fire spirits, and fire harms of the South, and protect me during the seventy-two days of the Fire’s flourishing season in the fourth, fifth, and sixth months, that I may pass through this time by your grace.\n\nI humbly pray to the Lords of Venus, the Western Chen, the Western Dipper, the Seven Lords of the Straddling, Bond, Stomach, Pleiades, Net, Turtle Beak, and Orion constellations, the Lord of Mount Hua of the Western Marchmount, the Lords of the Six Rong, the Lords of Geng and Xin, and the Lords of Shen and You: may they dissolve the karmic harm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces within the six myriad li of the West. May they eradicate the afflictions within my lungs, dispel the white disasters, white calamities, white afflictions, white poisons, metal spirits, and metal harms of the West, and protect me during the seventy-two days of the Metal’s flourishing season in the seventh, eighth, and ninth months, that I may pass through this time by your grace.\n\nI humbly pray to the Lords of Mercury, the Northern Chen, the Northern Dipper, the Seven Lords of the Dipper, Ox, Girl, Emptiness, Danger, Encampment, and Wall constellations, the Lord of Mount Dai of the Northern Marchmount, the Lords of the Five Di, the Lords of Ren and Gui, and the Lords of Hai and Zi: may they dissolve the karmic harm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces within the five myriad li of the North. May they eradicate the afflictions within my kidneys, dispel the black disasters, black poisons, black harms, black illnesses, water spirits, and water calamities of the North, and protect me during the seventy-two days of the Water’s flourishing season in the tenth, eleventh, and twelfth months, that I may pass through this time by your grace.\n\nI humbly pray to the Lords of Saturn, the Central Dipper, the Lords of the Celestial Pivot, the Seven Lords of the Seven Governors, the Lord of Mount Song of the Central Marchmount, the Lords of the Three Qin, and the Lords of Wu and Ji: may they dissolve the karmic harm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces. May they eradicate the afflictions within my spleen, dispel the yellow disasters, yellow calamities, yellow poisons, earth bandits, and earth ghosts of the Center, and protect me during the seventy-two days of the Earth’s flourishing season in the months of Chen, Xu, Chou, and Wei, and the eighteen days of each of the third, sixth, ninth, and twelfth months, that I may pass through this time without misfortune.",
      "overlap_context": "de their body, congealing in the five viscera, roaming through the marrow, and stirring the seven po. Within, they breed treachery. The fleshly body, dull and foolish, clings to life and fears death, unaware of what merit or virtue might extricate it.\n\nI have heard that the Great Compassion of the Most High loves life and abhors death. Having opened Heaven and spread Earth, nurturing all living beings, it permits repentance for sins of any magnitude, offering deliverance to all, great and small.",
      "start_char": 3497,
      "end_char": 4712,
      "start_sentence": 226,
      "end_sentence": 255,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.72145891189575,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "某深忧虑远，仰希尊神，灵恩景佑，得免灾厄，合家存济。 某等再拜，用献芳醪。 次献酒 又愿解某年上已来刑厄，愿解县官牢狱刑厄，愿解出入往来逢鬼刑厄，愿解犯道被考邢厄，愿解亡人考逮刑厄，愿解杖拍之厄，愿解相触忤先灵邢厄，愿解犯鳌神之厄，乞解短命刑厄，乞解算尽刑厄，乞解五鬼四杀刑厄，乞解六害七伤八难九坎刑厄，乞解虎狼虫蛇蜂毒之厄，乞解灾害哭泣殃疰刑厄，乞解亡魂惶怖刑厄，乞解刀兵流血刑厄，乞解系缚枷锁刑厄，乞解牛马触踏刑厄，乞解亡财失利刑厄，乞解金木水火土刑厄，乞解五行相害刑厄，乞解天年岁星邢厄，乞解孤辰寡宿妨吹刑厄，乞解建破咒诅厌梼刑厄，乞解死疰被考刑厄，乞解犯法违科邢厄，乞解违神负鬼妄语不赛考至灾厄，乞解天厄，乞解年厄、月厄、日厄、时厄、大厄、小厄，一切厄以时释散。 某等再拜，用献考醪。 次献酒",
      "translated_text": "Deep in my distant anxieties, I look up in hope to the august deities, praying for your numinous grace and radiant protection, that I may be spared from calamity and misfortune, and my entire household preserved and sustained. I bow twice again, offering fragrant wine.\n\nNext, the offering of wine:\nMay it further dissolve the penal afflictions I have suffered since the year’s beginning; may it dissolve the penal afflictions of official imprisonment and judicial punishment; may it dissolve the penal afflictions of encountering ghostly perils in travel; may it dissolve the penal afflictions of being examined for transgressing the Dao; may it dissolve the penal afflictions of interrogation by the dead; may it dissolve the afflictions of beatings and blows; may it dissolve the penal afflictions of offending or displeasing ancestral spirits; may it dissolve the afflictions of offending the Ao deities; may it dissolve the penal afflictions of short lifespan; may it dissolve the penal afflictions of exhausted fate; may it dissolve the penal afflictions of the Five Ghosts and Four Killers; may it dissolve the penal afflictions of the Six Harms, Seven Injuries, Eight Difficulties, and Nine Pitfalls; may it dissolve the afflictions of tigers, wolves, venomous insects, snakes, and wasp poisons; may it dissolve the penal afflictions of disasters, weeping, misfortunes, and lingering curses; may it dissolve the penal afflictions of terrified wandering souls; may it dissolve the penal afflictions of blades, weapons, and bloodshed; may it dissolve the penal afflictions of bondage, cangues, and fetters; may it dissolve the afflictions of being trampled by oxen or horses; may it dissolve the penal afflictions of lost wealth and failed ventures; may it dissolve the penal afflictions of Metal, Wood, Water, Fire, and Earth; may it dissolve the penal afflictions of the Five Phases clashing in harm; may it dissolve the penal afflictions of the Year Star in the heavens; may it dissolve the penal afflictions of solitary stars and widow constellations causing obstruction; may it dissolve the penal afflictions of constructed curses, spells, and malevolent prayers; may it dissolve the penal afflictions of deathly curses and interrogations; may it dissolve the penal afflictions of violating laws and defying statutes; may it dissolve the penal afflictions of offending deities, deceiving ghosts, reckless speech, and unfulfilled vows leading to calamity; may it dissolve celestial afflictions; may it dissolve the afflictions of the year, month, day, hour, great and small—may all afflictions be released and dispersed in due time.\n\nI bow twice again, offering this wine of examination. Next, the offering of wine.",
      "overlap_context": "arm recorded in Heaven’s Bureau and dispel the earthly spirits and malevolent forces. May they eradicate the afflictions within my spleen, dispel the yellow disasters, yellow calamities, yellow poisons, earth bandits, and earth ghosts of the Center, and protect me during the seventy-two days of the Earth’s flourishing season in the months of Chen, Xu, Chou, and Wei, and the eighteen days of each of the third, sixth, ninth, and twelfth months, that I may pass through this time without misfortune.",
      "start_char": 4712,
      "end_char": 5067,
      "start_sentence": 256,
      "end_sentence": 261,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.455698728561401,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "又启众尊神仙官将，伏乞停龙息驾，安隐座席。 某等谨为某推课元辰章表、文辞结博。 恐传言奏事，一时罔能罗观，恩惟尊神，留连宴喜，听臣等为某拜章上闻。 上章法叩齿九通，出官日东夜北必户 谨出臣等身中五体真官功曹吏。 出上仙上灵二官直使功曹官，各二人。 出正一功曹官，各二人。 出治病功曹官，各二人。 出左官使者官，各二人。 出右官使者官，各二人。 出阴神决吏官，各二人。 出阳神决吏官，各二人。 出科车赤符吏、刚风骑置驿马上章吏官，各二人。 出直使功曹，戴通天之冠，衣皂执单衣。 正一功曹，冠朱阳之帻，绛章单衣，腰带龙头之剑。 操持谒簿使者，玄阴之积，戴九德之冠，五色绶命单衣，腰带虎符，齐执玉板。 直使功曹，住立四方。 正一功曹，住立中央。 左官使者，持幢在前。 右官使者，建节在后。 阳神决吏立左，阴神决吏立右。 右请灵威仰仁官使者九人。 出赤熛弩礼官使者三人。 出耀魄宝义官使者七人。 出叶光纪智官使者五人。 出含枢纽信官使者十二人。 出巨神庾吏九人。 出朱丹真吏八人。 出邹上玄吏六人。 出石玄元吏五人。 出黄忠正吏三人。 出冯修未隐娥侍者三人。 出祝苍翳逸寥侍者九人。 出幼太立灵素兰使者七人。 出定羽张结连翅侍者一人。 出吕公子冯夷侍者五人。 出阳明阴精真人、玄冥丹元北极天关直符直事，各七人。 出帝晨上尊传命持节，各九人。 出无上青赤治病功曹官，各二十人。 出三部功曹、三部使者、高车使者，各二十四人。 出阴阳太监吏，各十二人。 出中骑驿候讨平炁将军，各五人。 出狼吏虎贲察奸钩骑、三官仆射、天绉甲卒、天丁力士官，各二百四十人。 出五方童子、云中小吏、监天童子，各二百四十人。 出收神食神吏，各一百二十人。 出化神历旗刚风将军、导炁左右骑将军，各五人。 出延请赤素君、阳光君官将，各一百二十人。 出白素君、阴光君官将，各一百二十人。 出出者，严装显服，正其威仪，住立臣前后左右，咸受臣口中辞语。 分别关启，必令通达此间某州县乡里里中真官注炁，监察考召社里邑君、道上二玄三元四始甲子诸官君、七十二官君，四面方位，三官考召，并明臣等所奏，同心申腾，上启太上无极大道、道中之道神明君玉皇帝、太上老君、太上丈人、元上玄老、天师、嗣师、系师、女师、三师君门下典者、书佐小吏，奉行文书事。 臣等谨为某州县乡里男女官生某拜上，分解宿命元辰，解罗释网，拔度生死，申等益寿，代形解厄。 连纸口启章一通并表状，露在此靖中中庭素案之上，愿上官典者，垂神省理。 某稽颡伏地，资信当章如法。 臣等开函，伏读上闻。 次读章，次送章，叩齿十二通 臣谨重勑身中五体真官直使、正一功曹书佐小吏，皆各严装显服，冠带垂缨，头戴夜光之壁，腰带龙渊之剑、五色之绶，簪笔干持录。 为臣等及时操元辰，连纸口启章并表状，上诣太上三天曹，即日诣某曹某宫，随章进对，随事分别上启太上老君、天师、嗣师、系师、女师、二师君门下生黑诸君将吏：臣等伏自寻省，人微骨贱，运会幸庆，得在治箓。 耳目闭塞，役使吏兵，或有迷误，言词不次。 愿请阴阳神央吏、四部案章从事、传言书佐、习事小吏，持龙头书刀，长毫利笔，即为注正脱字，为益误字为定，无令上官典者有所谴却。",
      "translated_text": "We further invoke the assembly of revered divine immortals, officials, and generals, humbly beseeching that the Dragon Chariots halt their course and the Celestial Hosts rest in tranquil repose upon their seats. We, on behalf of [Name], respectfully present the memorial of the Primordial Hour of Destiny, its words woven into a tapestry of supplication.\n\nFearing that the transmission of our petition may be too vast for instant comprehension, we implore the august deities to linger in gracious attendance, that they may heed our prayer as we prostrate ourselves to present this memorial. To submit the memorial, we knock our teeth nine times, facing east by day and north by night, with doors unsealed.\n\nWe now reverently dispatch the True Officials of the Five Agents within our bodies, the Attendant Clerks of the Office:\n- Two Attendant Clerks of the Upper Immortal and Upper Numinous Bureaus,\n- Two Clerks of the Orthodox Unity Office,\n- Two Clerks of the Office of Healing,\n- Two Clerks of the Left Bureau Envoys,\n- Two Clerks of the Right Bureau Envoys,\n- Two Clerks of the Yin Spirit Adjudicators,\n- Two Clerks of the Yang Spirit Adjudicators,\n- Two Clerks of the Scarlet Talisman Chariot, the Just Wind Riders, and the Post-Horse Memorial Envoys.\n\nThe Direct Attendant Clerks wear the Crown of Heavenly Passage, clad in black, holding unlined robes. The Orthodox Unity Clerks don the Vermilion Yang Turban, crimson unlined robes, and gird themselves with Dragon-Headed Swords. The Petition-Bearing Envoys, arrayed in the Accumulations of Profound Yin, wear the Nine-Virtue Crown, multicolored sashes, unlined robes, Tiger Talismans at their waists, and hold jade tablets in hand.\n\nThe Direct Attendant Clerks stand at the four directions; the Orthodox Unity Clerks stand at the center. The Left Bureau Envoys hold banners before us; the Right Bureau Envoys bear insignia behind us. The Yang Spirit Adjudicators stand to the left; the Yin Spirit Adjudicators stand to the right.\n\nWe now summon:\n- Nine Envoys of the Numinous Might and Reverent Benevolence Bureau,\n- Three Envoys of the Scarlet Blazing Crossbow and Ritual Bureau,\n- Seven Envoys of the Radiant Lunar Treasure and Righteousness Bureau,\n- Five Envoys of the Flourishing Light and Discipline Bureau,\n- Twelve Envoys of the Pivot-Containing Axis and Trust Bureau,\n- Nine Envoys of the Great Spirit Yu Scribes,\n- Eight Envoys of the Vermilion Cinnabar True Scribes,\n- Six Envoys of the Zou Supreme Mystery Scribes,\n- Five Envoys of the Stone Profound Origin Scribes,\n- Three Envoys of the Yellow Loyalty and Rectitude Scribes,\n- Three Attendants of Feng Xiuwei and the Hidden Maiden,\n- Nine Attendants of Zhu Cangyi and the Boundless Void,\n- Seven Envoys of the Youthful Supreme, Standing Numinous, and Pure Orchid,\n- One Attendant of Ding Yu, Zhang Jielian, and the Winged Ones,\n- Five Attendants of Master Lü and Feng Yi,\n- Seven True Persons of the Yang Brightness and Yin Essence, the Profound Darkness and Cinnabar Origin, the Northern Culmen, and the Celestial Pass Direct Talisman and Attendants,\n- Nine Envoys of the Supreme Dawn, the Venerable Transmitters of Mandates bearing insignia,\n- Twenty Envoys of the Supreme Azure and Vermilion Healing Clerks,\n- Twenty-four Envoys of the Three Divisions, the Three Bureaus, and the High Chariot Envoys,\n- Twelve Envoys of the Yin-Yang Grand Overseers,\n- Five Generals of the Qi of the Central Cavalry, the Post-Station Inspectors, and the Pacifying Qi,\n- Two hundred forty Envoys of the Wolf Scribes, Tiger Warriors, Investigators of Treachery, Hook Riders, the Three Officials’ Archers, the Celestial Armored Soldiers, and the Heavenly Might Officers,\n- Two hundred forty Celestial Lads of the Five Directions, Cloudborne Lesser Scribes, and Heaven-Monitoring Lads,\n- One hundred twenty Envoys of the Spirit-Gathering and Spirit-Feeding Scribes,\n- Five Generals of the Transformative Spirit, the Banner of the Celestial Calendar, and the Just Wind, along with the Left and Right Qi-Guiding Cavalry Generals,\n- One hundred twenty Envoys of the Scarlet and Plain Lords and the Yang Radiance Lords,\n- One hundred twenty Envoys of the White and Plain Lords and the Yin Radiance Lords.\n\nAll who emerge must be adorned in solemn attire, their majesty arrayed, standing before, behind, to the left, and right of us, receiving the words from our mouths. They shall distinguish and transmit the memorial, ensuring its passage to the True Officials of this very prefecture, county, township, and hamlet who govern qi, overseeing the inspection and summons of the Earth Gods of the communities and hamlets, the Two Mysteries, Three Origins, Four Beginnings, and all Jiazi Officials of the seventy-two bureaus in the four directions and positions. Through the Three Officials’ summons, may they jointly ascend our petition, presenting it to the Supreme and Boundless Great Dao, the Divine Sovereign of the Dao Within the Dao, the Jade Emperor, the Most High Lord Lao, the Most High Venerable One, the Primordial Supreme Mysterious Elder, the Celestial Masters, the Heir Masters, the Lineage Masters, the Female Masters, the Three Masters, the Gatekeepers, Scribes, and Lesser Clerks of the Masters’ Courts, who attend to the affairs of the memorials.\n\nWe, on behalf of [Name], a male/female official or disciple of this prefecture, county, township, and hamlet, prostrate ourselves to present this memorial, seeking to resolve the Primordial Hour of Destiny, unravel the nets of karmic entanglement, extricate from the cycles of life and death, extend longevity, transform the body, and dissolve calamities. A single memorial, written in connected sheets, lies revealed upon the white altar in the central courtyard of this oratory. May the attending officials deign to bestow their divine attention and governance.\n\nWe bow our heads to the ground, entrusting our faith in this memorial as prescribed by ritual. We open the case and reverently read it aloud for celestial hearing.\n\nNext, we read the memorial, then dispatch it, knocking our teeth twelve times.\n\nWe now solemnly command the Direct Attendants, the Orthodox Unity Clerks, and the Lesser Scribes of the Five Agents within our bodies to array themselves in solemn attire, their caps adorned with hanging tassels, heads crowned with luminous jade, waists girded with Dragon Abyss Swords and multicolored sashes, brushes tucked behind their ears, holding writing boards. They shall promptly take up the Primordial Hour of Destiny, the connected-sheet memorial, and the accompanying documents, ascending to the Three Celestial Courts of the Supreme, and on this very day, proceed to the designated court and palace, presenting the memorial in accordance with its contents, distinguishing matters to be reported to the Most High Lord Lao, the Celestial Masters, the Heir Masters, the Lineage Masters, the Female Masters, the Two Masters, and the various lords, generals, and clerks of the Black Gate.\n\nWe humbly reflect that, though our persons are lowly and our bones base, by the fortune of fate’s convergence, we have been permitted to serve within the registers of governance. Yet our ears and eyes are obstructed, and in dispatching clerks and soldiers, errors may arise, our words disordered. We beseech the Yin-Yang Spirit Adjudicators, the Clerks of the Four Bureaus, the Memorial-Transmitting Scribes, and the Lesser Clerks of Practice to take up Dragon-Headed Writing Knives and long, sharp brushes, correcting omissions, amending errors, and ensuring no missteps cause the attending officials to reprimand or reject our petition.",
      "overlap_context": "urses and interrogations; may it dissolve the penal afflictions of violating laws and defying statutes; may it dissolve the penal afflictions of offending deities, deceiving ghosts, reckless speech, and unfulfilled vows leading to calamity; may it dissolve celestial afflictions; may it dissolve the afflictions of the year, month, day, hour, great and small—may all afflictions be released and dispersed in due time.\n\nI bow twice again, offering this wine of examination. Next, the offering of wine.",
      "start_char": 5067,
      "end_char": 6325,
      "start_sentence": 262,
      "end_sentence": 320,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.258427143096924,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "或有下官故炁鬼贼，断截章文，使不御达者，收付所在禁狱，依玄都科法治罪。 令臣章径诣太上无极太道御前，慎勿稽停。 左君历关，右吏次启，无令遗漏，闭口气升，上伏须告报。 次伏地，存章上分明，见官君达章讫。 次纳官 臣等上章设醮事讫，向所出臣等身中功曹使者、一切诸官君，各从众妙门而入，在左还左，在右还右，各还宫室，缠身绕骨，弥纶天地，经卫百脉，无令错互，须召复出，一如故事。 次送神赞不醮不用念 飘飘五帝辇，萧萧七君耕。 流晖下降席，享宴感丹诚。 启奏咸响彻，落死上长生。 南宫益年算，北斗记延龄。 愆厄皆解散，福报永安宁。 礼谢已将毕，神升归太清。 次散酒 次普责文 醮祭既毕，神驾以升。 福祚余馨，普沾贶责。 召弟子九祖父母、七代亡灵，悉垂飨览。 又石左社、右稷、城隍、里域真官、八部仆从、功曹吏兵、建节力士、所由宅神等，甘飨醮仪。 守宅三将军、十二神将、二十四镇神吏、门丞、户尉、守宅吏兵，并鳌神吏，普同饮飨，醉饱为度。 然后与臣罗列，镇守宅院，使灾不过门，疫不到户，邪精鬼贼，莫敢当向。 盟威正法，事在不轻。 若守镇有功、兴福助善，三会吉日，同章举迁。 不得懈怠，依法弹纠。 一如天师律令。",
      "translated_text": "Should any subordinate officials, malevolent qi spirits, or demonic thieves intercept or sever the memorial’s text, preventing its ascent, seize them and consign them to the local prison, where they shall be punished according to the statutes of the Mysterious Capital. Let our petition proceed directly to the presence of the Supreme Unbounded Great Dao, without delay or obstruction. The Left Lord shall pass through the barriers in sequence, while the Right Clerks shall present the memorial in order, ensuring no omission or leakage, sealing the qi to ascend. We prostrate ourselves, awaiting the report.\n\nNext, we press our foreheads to the earth, visualizing the memorial ascending clearly, until the attending officials and lords have received it in full. Then, we withdraw the memorial.\n\nOnce the rite of offering and the jiao liturgy are concluded, the Merit-Officials and all attending lords who emerged from our bodies shall re-enter through the Gates of Myriad Mysteries—those on the left returning to the left, those on the right to the right—each resuming their palaces, coiling about our bodies and entwining our bones, pervading heaven and earth, safeguarding the hundred meridians, ensuring no misalignment. When summoned forth again, they shall emerge precisely as before.\n\nNext, the hymn of sending forth the deities (not recited during non-jiao rites):\n\n*Swiftly ride the Five Emperors’ chariots,*\n*Softly plow the Seven Lords’ fields.*\n*Radiance streams down to the mat,*\n*Feast and banquet respond to crimson sincerity.*\n*Petitions resound, all-pervading,*\n*From death’s fall to life’s ascent.*\n*The Southern Palace augments our years,*\n*The Northern Dipper records our longevity.*\n*Transgressions and calamities dissolve,*\n*Fortune’s blessings bring eternal peace.*\n*As rites of gratitude conclude,*\n*The gods ascend back to the Great Clarity.*\n\nNext, the libation is dispersed.\n\nNext, the universal reproach text:\n\nNow that the jiao sacrifice is complete and the divine carriages have ascended, may the lingering fragrance of blessings universally bestow their reproachful grace. We summon the disciples’ nine generations of ancestors, their fathers and mothers, and the seven generations of departed kin to partake fully in this offering. Also, the true officials of the Left Altar and Right Millet, the city gods, the local deities, the eight divisions of attendants, the Merit-Officials, clerks, and soldiers, the standard-bearing warriors, the household deities of this dwelling—may all sweetly receive the jiao rites. The Three Generals Guarding the House, the Twelve Divine Generals, the Twenty-Four Warden-Officials, the Gate Sergeants, the Door Commandants, the household-guarding clerks and soldiers, and the Turtle-Spirit Officials—may all feast and drink to satiation. Thereafter, arrayed with us, they shall guard the household, ensuring no disaster crosses the threshold, no plague enters the door, and no demonic spirits or thieving ghosts dare approach. The covenant’s true dharma is not to be taken lightly. Should they faithfully guard and merit promotion for their blessings and aid in goodness, on the three auspicious assembly days, they shall be elevated together with the memorial. They must not slacken, but be disciplined according to the law, as under the Ordinance of the Celestial Master.",
      "overlap_context": "erve within the registers of governance. Yet our ears and eyes are obstructed, and in dispatching clerks and soldiers, errors may arise, our words disordered. We beseech the Yin-Yang Spirit Adjudicators, the Clerks of the Four Bureaus, the Memorial-Transmitting Scribes, and the Lesser Clerks of Practice to take up Dragon-Headed Writing Knives and long, sharp brushes, correcting omissions, amending errors, and ensuring no missteps cause the attending officials to reprimand or reject our petition.",
      "start_char": 6325,
      "end_char": 6822,
      "start_sentence": 321,
      "end_sentence": 345,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.00714874267578,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "次复炉 香官使者、左右龙虎君、侍香诸灵官：当今设醮，元辰之所，自然生金液、丹碧芝英。 众真百灵交会，集此香火炉前。 乞愿某乙，阖家受福，天下蒙恩。 十方仙童玉女侍卫，香烟传奏，向来言启，径达至真无极玉皇上帝御前。 次散座赞 三光甚明曜，天地常湛然。 人生在其中，福禄随运缘。 刑杀有厌会，疾厄期命年。 致使砛砢鬼，潜臻福咎愆。 智者归大道，精诚五福田。 告下皆迸散，寿命与长延。 七祖咸安乐，幽击并蒙原。 出靖稽首赞，流芳会帝前。 次出户咒 出阴入阳，万神开通。 关启事毕，请闭黄房。 守靖玉女，明备神宫。 左右伏立，万神潜宁。 元辰章醮立成历卷上竟 元辰章醮立成历卷下 消本命元辰胎生行年元辰等灾 曰：某本命行年及胎生两月年命于兀辰上，所被见诸厄魁纲天杀，或自相为恶，或自相刑害。 并各请其子神和释分解，合神保护，令得无他。 次推解法 干历：甲、乙、丙、丁、戊、己、庚、辛、壬、癸。 恶神：庚、辛、壬、癸、甲、乙、丙、丁、戊、己。 子神：丙、丁、戊、己、庚、辛、壬、癸、甲、乙。 合神：戊、己、庚、辛、壬、癸、甲、乙、丙、丁。 右件阴阳干各将，配下十二支也。 支历：子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥。 恶神：辰戌、卯、申、酉、寅、亥、子、卯、午、巳、寅、丑未。 子神：寅、酉、午、巳、申、丑、未、辰戌、酉、子、亥、申、卯。 合神：丑、子、亥、戌、酉、申、未、午、巳、辰、卯、寅。 右件阴阳支，配前十干为六甲，知其为恶，取其子合。 假令本命甲子，则恶在庚辰。 成请子神丙寅某乙，合神巳丑某乙。 第一甲本命，某恶在某。 谨请子神某乙，从官若干人，为某和释自相为恶之灾，消却本命上所见诸厄魁纲天杀，众灾恶害，一切解除之。 为某土含元炁，度养性命。 又请合神某乙，从官若干人，为某保护本命，令得无他。 第二某乙元辰，某恶在某。 谨请子神某，从官若干人，为某和释自相为恶，云云具如本命例也。 其中有别启，当依文具之。 消却元辰上，云云。 为某含玉香，吐玉浆，保养元精，延度临终之命。 又请合神，云云。 为某保护元辰，令得无他。 第三胎月，悉如例。 消却，胎月上吐含和气，保养胎元。 又请合神，云云。 第四生月，并如上却，生月上吐含和炁，保养生元。 又请合神，云云。 第五行年，悉如前却，行年上吐含元炁，保度悬命。 又请合神，云云。 第六行年元辰，云云。 如上却，年元辰上吐雄黄、含玉香，保度行年元精涎度临危之厄难。 又请合神，云云。 保护行年元辰某，令得无他。 右消年命胎生元辰，大略如此。 其中巧妙，事由多能。 次还神： 愿请某本命神某乙，如干元辰神，云云。 胎月神，云云。 生月神，云云。 行年神云云。 行年神辰神，云云。 各还某身中，为镇神捍体，依附宫室，除凶去害，怡神赤子，无令越逸。 若居病云，又请今岁神某。 假令甲子岁，即云甲子王文卿，从官十八布随岁次神，请驾某乘午、未驾朱、雀、乘玄武。 岁在亥子，丑驾玄武、乘朱雀。 手持针药，口含雄黄吐玉香，亦云衔玉香吐玉浆。 一合下到某之家，诣某身中，疗治所苦百疾病。 从头至足，从左至右，周身绕体，经纬百脉，调和五内，豁然除差；",
      "translated_text": "Next, invoke the Incense-Official Envoys, the Left and Right Dragon-Tiger Lords, and the various Attending Incense Spirits: on this occasion of setting up the jiao-offering at the original destiny’s site, naturally arise golden liquors and cinnabar-green mushroom blossoms. Let the host of perfected ones and the hundred spirits convene here before the incense burner. May so-and-so’s entire household receive blessings, and may the world be covered in grace.\n\nLet the jade maidens and immortal youths of the ten directions stand guard, transmitting the incense smoke’s memorial, conveying the foregoing words directly to the Most Perfect and Boundless Jade Sovereign of the Highest Dao in his imperial presence.\n\nNext, disperse the assembly with a hymn of praise:\n\nThe Three Luminaries shine most brightly,\nHeaven and Earth remain ever serene.\nHumankind dwells within them,\nFortune and emolument follow fate’s threads.\nPunishment and execution meet their destined junctures,\nSickness and calamity await their appointed years.\nThus do crooked ghosts stealthily approach,\nLurking near blessings and transgressions alike.\nThe wise turn to the Great Dao,\nCultivating sincerity in the Five Fields of Blessing.\nProclaiming this below, may all disperse,\nAnd may lifespans extend long and far.\nMay the seven ancestors all find peace,\nAnd may the imprisoned and stricken alike receive absolution.\nEmerging from the oratory, bow and offer praise,\nThat fragrant virtue may gather before the Emperor.\n\nNext, exit the chamber with this incantation:\nFrom yin to yang, the myriad spirits open the way.\nWith affairs at the passes concluded, now seal the Yellow Chamber.\nLet the jade maidens guarding the oratory\nBrightly prepare the divine palace.\nStanding in attendance to left and right,\nMay the myriad spirits silently settle.\n\nThe *Complete Rites of the Original Destiny’s Petition-Offering* (Upper Scroll) concludes here.\nThe *Complete Rites of the Original Destiny’s Petition-Offering* (Lower Scroll):\nDissolving Disasters of the Original Destiny, Natal Destiny, Womb-Generated Destiny, and Annual Destiny\n\nIt is said: So-and-so’s natal destiny, annual destiny, and the two months of womb-generated destiny all fall upon the *wu*-destiny, where they encounter various inauspicious stellar configurations—celestial executioners, the baleful net of the heavens—whether through self-inflicted harm or mutual affliction. For each, invoke their child-spirits to harmonize and resolve these conflicts, uniting with protective spirits to ensure no further misfortune.\n\nNext, the method of dissolution:\n\n**Stem Sequence:**\nJia, Yi, Bing, Ding, Wu, Ji, Geng, Xin, Ren, Gui.\n\n**Baleful Spirits:**\nGeng, Xin, Ren, Gui, Jia, Yi, Bing, Ding, Wu, Ji.\n\n**Child-Spirits:**\nBing, Ding, Wu, Ji, Geng, Xin, Ren, Gui, Jia, Yi.\n\n**Uniting Spirits:**\nWu, Ji, Geng, Xin, Ren, Gui, Jia, Yi, Bing, Ding.\n\nThe above yin and yang stems are each matched with the twelve earthly branches.\n\n**Branch Sequence:**\nZi, Chou, Yin, Mao, Chen, Si, Wu, Wei, Shen, You, Xu, Hai.\n\n**Baleful Spirits:**\nChen-Xu, Mao, Shen, You, Yin, Hai, Zi, Mao, Wu, Si, Yin, Chou-Wei.\n\n**Child-Spirits:**\nYin, You, Wu, Si, Shen, Chou, Wei, Chen-Xu, You, Zi, Hai, Shen, Mao.\n\n**Uniting Spirits:**\nChou, Zi, Hai, Xu, You, Shen, Wei, Wu, Si, Chen, Mao, Yin.\n\nThe above yin and yang branches, paired with the ten celestial stems, form the Six Jia. When baleful influences are identified, select their child and uniting spirits.\n\nFor example: If the natal destiny is Jia-Zi, the baleful influence lies in Geng-Chen. Invoke the child-spirit Bing-Yin (so-and-so) and the uniting spirit Ji-Chou (so-and-so).\n\n**First:** For the Jia natal destiny, if the baleful influence resides in [X], respectfully invoke the child-spirit [so-and-so], with their attendant officials (number unspecified), to harmonize and resolve the self-inflicted disasters, dissolving all baleful stellar configurations, myriad calamities, and malevolent harms encountered upon the natal destiny. May so-and-so embody the primordial qi of earth, nurturing life and nature.\n\nAlso invoke the uniting spirit [so-and-so], with their attendant officials (number unspecified), to protect the natal destiny and ensure no further misfortune.\n\n**Second:** For so-and-so’s original destiny, if the baleful influence resides in [X], respectfully invoke the child-spirit [so-and-so], with their attendant officials (number unspecified), to harmonize and resolve the self-inflicted harms, following the example of the natal destiny. Dissolve the baleful influences upon the original destiny. May so-and-so contain jade fragrance and exhale jade nectar, preserving the original essence and extending the lifespan to its destined end. Also invoke the uniting spirit [as above] to protect the original destiny and ensure no further misfortune.\n\n**Third:** For the womb month, follow the same example. Dissolve the baleful influences, that the womb month may exhale harmonious qi to nurture the womb’s primordial essence. Also invoke the uniting spirit [as above].\n\n**Fourth:** For the birth month, proceed as above. Dissolve the baleful influences, that the birth month may exhale harmonious qi to nurture the birth’s primordial essence. Also invoke the uniting spirit [as above].\n\n**Fifth:** For the annual destiny, proceed as before. Dissolve the baleful influences, that the annual destiny may exhale primordial qi to sustain the suspended lifespan. Also invoke the uniting spirit [as above].\n\n**Sixth:** For the annual destiny’s original destiny, proceed as above. Dissolve the baleful influences, that the annual destiny’s original destiny may exhale realgar and contain jade fragrance, preserving the annual destiny’s essence and delivering it from perilous calamities. Also invoke the uniting spirit [as above] to protect the annual destiny’s original destiny and ensure no further misfortune.\n\nThe above outlines the dissolution of the natal destiny, womb-generated destiny, and annual destiny. The intricacies within are matters of great skill.\n\nNext, the return of the spirits:\nRespectfully invite so-and-so’s natal destiny spirit [so-and-so], along with the original destiny spirit, womb-month spirit, birth-month spirit, annual destiny spirit, and annual destiny’s original destiny spirit, each to return to so-and-so’s body, serving as guardian spirits to defend the form, adhering to the palaces and chambers, dispelling misfortune and harm, pacifying the spirit and the inner child, preventing any waywardness.\n\nIf residing in illness, also invoke this year’s spirit [so-and-so]. For example, in the year Jia-Zi, invoke Wang Wenqing of Jia-Zi, with eighteen officials arrayed according to the year’s sequence. Request their chariot: Wu or Wei for the Vermilion Bird, or the Dark Warrior’s mount. If the year falls in Hai or Zi, or Chou, let the Dark Warrior mount the Vermilion Bird. Holding acupuncture needles and medicines, mouth containing realgar and exhaling jade fragrance—or said to hold jade fragrance and exhale jade nectar—descend together to so-and-so’s household, entering so-and-so’s body to heal all afflictions. From head to foot, left to right, encircle the body, weaving through the hundred vessels, harmonizing the five viscera, and suddenly dispelling all ailments.",
      "overlap_context": "hall guard the household, ensuring no disaster crosses the threshold, no plague enters the door, and no demonic spirits or thieving ghosts dare approach. The covenant’s true dharma is not to be taken lightly. Should they faithfully guard and merit promotion for their blessings and aid in goodness, on the three auspicious assembly days, they shall be elevated together with the memorial. They must not slacken, but be disciplined according to the law, as under the Ordinance of the Celestial Master.",
      "start_char": 6823,
      "end_char": 8118,
      "start_sentence": 346,
      "end_sentence": 419,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.693424224853516,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "保却今年之中，亦云迄于来岁。 消却凶邪、恶毒、灾祸、鬼疰州切，并令消解，扶衰度厄，皆使无他。 次某本命某匹系，某从本命神顺计得八神为死炁。 愿请生炁救神，某自命命神逆计得八神为生炁。 从官如干人，为某奉斋章、上法信，上诣某天帝某官。 取本命所属二十八宿中天帝及官名。 列星度宿，分解灾厄，上诣某府某君，还取所属夭帝之府君，名勒不死炁之乡，甲乙少阳，丙丁太阳，庚辛少阴； 壬癸太阴，戊己中央。 某宫，亥子北宫，寅卯东宫，巳午南官，申酉西官，辰戌丑未中宫。 皆取本命支干也。 为某贸名易形，削除死炁某，顺八神也。 移名生录之中，延命无穷。 假令甲子生人，死炁辛未，是生炁救神丁已崔巨卿，从官十人，是上诣元明天帝上元宫。 列星度宿，分解灾厄，上诣无生府齐童君，勒不死炁之乡，下勒少阳北宫。 为某贸名易形，削除死炁辛未，移居生录之中，延命无穷。 举此一例，余足知之。 次推六甲神名及从官数 甲、己、子、午九，乙、庚、丑、未八，丙、辛，寅、申七，丁、壬、卯、酉六，戊、癸、辰、戌五，巳、亥四。 右此支干相配即成从官数 甲子王文卿，从官十八人。 乙丑龙委卿，从官十六人。 丙寅张仲卿，从官十四人。 丁卯司马卿，从官十二人。 戊辰季楚卿，从官十人。 己已何文昌，从官十三人。 庚午冯仲卿，从官十七人。 辛未王文章，从官十五人。 壬申侯博卿，从官十三人。 癸酉孙仲房，从官十一人。 甲戌展子江，从官十四人。 乙亥庞明公，从官十二人。 丙子邢孙卿，从官十六人。 丁丑赵子玉，从官十四人。 戊寅虞子卿，从官十二人。 己卯石文阳，从官十五人。 庚辰尹佳卿，从官十三人。 辛巳阳仲公，从官十一人。 壬午马子明，从官十五人。 ＇癸末吕威明，从官十三人。 甲申扈文长，从官十六人。 乙酉孔利公，从官十四人。 丙成#1车元升，从官十二人。 丁亥张通，从官十人。 戊子乐石阳，从官十四人。 己丑范和卿，从官十七人。 庚寅楮进卿，从官十五人。 辛卯郭子良，从官十三人。 壬辰武稚卿，从官十一人。 癸已史公来，从官九人。 甲午卫上卿，从官十八人。 乙人#2杜仲肠，从官十六人。 丙申朱伯众，从官十四人。 丁酉藏文公，从官十二人。 戊戌范少卿，从官十人。 己亥邓都卿，从官十三人。 庚子阳仲叔，从官十七人。 辛丑林卫公，从官十五人。 壬寅丘孟卿，从官十三人。 癸卯苏他家，从官十一人。 甲辰孟非卿，从官十四人。 乙巳唐文卿，从官十二人。 丙午魏文公，从官十六人。 丁未石叔通，从官十四人。 戊申范伯阳，从官十二人。 己酉成文长，从官十五人。 庚戌史子仁，从官十三人。 辛亥左子行，从官十一人。 壬子宿上卿，从官十五人。 癸丑江汉卿，从官十三人。 甲寅明文章，从官十六人。 乙卯戴公阳，从官十四人。 丙辰霍叔英，从官十二人。 丁巳崔巨卿，从官十人。 戊午从元光，从官十四人。 己未时通卿，从官十七人。 庚申华文阳，从官十五人。 辛酉邴元玉，从官十三人。 壬戌乐进卿，从官十一人。 癸亥左石松，从官九人。 右六甲六旬神名、从官人数如前，各从本命、行年、胎月、生月、本命元辰一等支干，配取所恶之神及子神、和释合神保护，依名请之也。",
      "translated_text": "Preserve this year through to the coming one, or said to extend until the next. Dissolve all baleful influences—malign spirits, venomous toxins, calamities, and lingering spectral afflictions—causing them to disperse entirely. Support the frail, carry them through peril, and ensure no harm befalls them.\n\nNext, for so-and-so’s natal year and its associated branch-stem pairing, count forward from the natal spirit to determine the eight spirits governing *dead qi*. Invoke the *living qi* salvation spirits, counting backward from so-and-so’s natal spirit to find the eight spirits governing *living qi*. With a retinue of so many officials, present offerings and submit the ritual petition, ascending to the Celestial Emperor of so-and-so’s palace and the corresponding deities. Identify the Twenty-Eight Constellations under which the natal year falls, along with the names of the Celestial Emperor and his officials. Align the stars and measure the lodges to dissolve misfortune, ascending to the Lord of so-and-so’s Mansion and the Sovereign of the Palace of the Celestial Emperor of that branch. Inscribe the realm of *undying qi*: Jia-Yi as Lesser Yang, Bing-Ding as Greater Yang, Geng-Xin as Lesser Yin, Ren-Gui as Greater Yin, and Wu-Ji as the Central Palace. The palaces are: Hai-Zi as the Northern Palace, Yin-Mao as the Eastern Palace, Si-Wu as the Southern Palace, Shen-You as the Western Palace, and Chen-Xu-Chou-Wei as the Central Palace—all derived from the natal branch-stem. For so-and-so, trade names and transform form, excising the *dead qi* of so-and-so’s sequence of eight spirits. Transfer the name into the register of the living, prolonging life without end.\n\nFor example, one born in the Jia-Zi year has *dead qi* in Xin-Wei. The *living qi* salvation spirit is Ding-Si Cui Juqing, with ten attending officials, ascending to the Primordial Radiance Celestial Emperor of the Upper Prime Palace. Align the stars and measure the lodges to dissolve misfortune, ascending to the Lord of the Non-Birth Mansion, Qi Tong, and inscribing the realm of *undying qi*, specifically the Lesser Yang of the Northern Palace. For so-and-so, trade names and transform form, excising the *dead qi* of Xin-Wei and transferring residence into the register of the living, prolonging life without end. This single example suffices; the rest may be inferred accordingly.\n\nNext, the names of the Six Jia spirits and their attending officials:\n- Jia and Ji, in Zi and Wu: nine officials\n- Yi and Geng, in Chou and Wei: eight officials\n- Bing and Xin, in Yin and Shen: seven officials\n- Ding and Ren, in Mao and You: six officials\n- Wu and Gui, in Chen and Xu: five officials\n- Si and Hai: four officials\n\nThe above branch-stem pairings determine the number of attending officials.\n\nThe names of the Six Jia spirits for each sixty-year cycle and their attending officials are as follows:\n- Jia-Zi: Wang Wenqing, with eighteen officials\n- Yi-Chou: Long Weiqing, with sixteen officials\n- Bing-Yin: Zhang Zhongqing, with fourteen officials\n- Ding-Mao: Sima Qing, with twelve officials\n- Wu-Chen: Ji Chuqing, with ten officials\n- Ji-Si: He Wenchang, with thirteen officials\n- Geng-Wu: Feng Zhongqing, with seventeen officials\n- Xin-Wei: Wang Wenzhang, with fifteen officials\n- Ren-Shen: Hou Boqing, with thirteen officials\n- Gui-You: Sun Zhongfang, with eleven officials\n- Jia-Xu: Zhan Zijiang, with fourteen officials\n- Yi-Hai: Pang Minggong, with twelve officials\n- Bing-Zi: Xing Sunqing, with sixteen officials\n- Ding-Chou: Zhao Ziyu, with fourteen officials\n- Wu-Yin: Yu Ziqing, with twelve officials\n- Ji-Mao: Shi Wenyang, with fifteen officials\n- Geng-Chen: Yin Jiaqing, with thirteen officials\n- Xin-Si: Yang Zhonggong, with eleven officials\n- Ren-Wu: Ma Ziming, with fifteen officials\n- Gui-Wei: Lü Weiming, with thirteen officials\n- Jia-Shen: Hu Wenchang, with sixteen officials\n- Yi-You: Kong Ligong, with fourteen officials\n- Bing-Xu: Che Yuansheng, with twelve officials\n- Ding-Hai: Zhang Tong, with ten officials\n- Wu-Zi: Yue Shiyang, with fourteen officials\n- Ji-Chou: Fan Heqing, with seventeen officials\n- Geng-Yin: Chu Jinqing, with fifteen officials\n- Xin-Mao: Guo Ziliang, with thirteen officials\n- Ren-Chen: Wu Zhiqing, with eleven officials\n- Gui-Si: Shi Gonglai, with nine officials\n- Jia-Wu: Wei Shangqing, with eighteen officials\n- Yi-Wei: Du Zhongchang, with sixteen officials\n- Bing-Shen: Zhu Bozhong, with fourteen officials\n- Ding-You: Zang Wengong, with twelve officials\n- Wu-Xu: Fan Shaoqing, with ten officials\n- Ji-Hai: Deng Duqing, with thirteen officials\n- Geng-Zi: Yang Zhongshu, with seventeen officials\n- Xin-Chou: Lin Weigong, with fifteen officials\n- Ren-Yin: Qiu Mengqing, with thirteen officials\n- Gui-Mao: Su Tajia, with eleven officials\n- Jia-Chen: Meng Feiqing, with fourteen officials\n- Yi-Si: Tang Wenqing, with twelve officials\n- Bing-Wu: Wei Wengong, with sixteen officials\n- Ding-Wei: Shi Shutong, with fourteen officials\n- Wu-Shen: Fan Boyang, with twelve officials\n- Ji-You: Cheng Wenchang, with fifteen officials\n- Geng-Xu: Shi Ziren, with thirteen officials\n- Xin-Hai: Zuo Zixing, with eleven officials\n- Ren-Zi: Su Shangqing, with fifteen officials\n- Gui-Chou: Jiang Hanqing, with thirteen officials\n- Jia-Yin: Ming Wenzhang, with sixteen officials\n- Yi-Mao: Dai Gongyang, with fourteen officials\n- Bing-Chen: Huo Shuying, with twelve officials\n- Ding-Si: Cui Juqing, with ten officials\n- Wu-Wu: Cong Yuanguang, with fourteen officials\n- Ji-Wei: Shi Tongqing, with seventeen officials\n- Geng-Shen: Hua Wenyang, with fifteen officials\n- Xin-You: Bing Yuanyu, with thirteen officials\n- Ren-Xu: Yue Jinqing, with eleven officials\n- Gui-Hai: Zuo Shisong, with nine officials\n\nThe names of the Six Jia spirits for each sixty-year cycle and their attending officials are as above. For each individual, determine the corresponding spirits and protective deities based on their natal year, current age, gestational month, birth month, and natal branch-stem, then invoke them by name.",
      "overlap_context": "r’s mount. If the year falls in Hai or Zi, or Chou, let the Dark Warrior mount the Vermilion Bird. Holding acupuncture needles and medicines, mouth containing realgar and exhaling jade fragrance—or said to hold jade fragrance and exhale jade nectar—descend together to so-and-so’s household, entering so-and-so’s body to heal all afflictions. From head to foot, left to right, encircle the body, weaving through the hundred vessels, harmonizing the five viscera, and suddenly dispelling all ailments.",
      "start_char": 8118,
      "end_char": 9350,
      "start_sentence": 420,
      "end_sentence": 499,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.98363208770752,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "次消五音灾 某姓音属角，恶在西方金。 谨请南方丙丁八蛮君六十四官，为某解角姓之宫，却除西宫定祸。 愿请南方荧惑星君火德，来生东宫角姓之音，禳灾致福，收除太白星白炁之害。 某姓音属征，恶在北方水。 谨请中央戊己三秦君千二百官，为某解征姓之宫，部除此宫定祸。 愿请中央镇星君土德，来生南官征姓之音，禳灾致福，收除辰星黑炁之害。 某姓音属宫，恶在东方木。 谨请西方庚辛六戎君三十六官，为某解宫姓之宫，却除束宫定祸。 愿请西方太白星君金德，来生中宫宫姓之音，禳灾致福，收除岁星青炁之害。 某姓音属商，恶在南方火。 谨请北方壬癸五狄君二十五官，为某解商姓之宫，却除南宫定祸。 愿请北方辰星君水德，来生西宫商姓之音，禳灾致福，收除荧惑星赤黑之害。 某姓音属羽，恶在中央土。 谨请束方甲乙九夷君八十一官，为某解羽姓之宫，却除中宫定祸。 愿请东方岁星君木德，来生北宫羽姓之音，禳灾致福，收除镇星黄黑之害。 次消五鬼绝命灾法 坎鬼吏在兑，绝命在坤，愿请巽神字明一，四部将军将吏各四千人，兵士各四万人，为某延度厄难。 离鬼吏在艮，绝命在乾，愿请震神字玄举，三部将军将吏各三千人，兵士各三万人，为某延度厄难。 震鬼吏在坤，绝命在兑，愿请离神字明上，九部将军将吏各九千人，兵士各九万人，为某延度厄难。 坤鬼吏在震，绝命在坎，愿请艮神字过薏，八部将军将吏各八千人，兵士各八万人，为某延度厄难。 巽鬼吏在乾，绝命在艮，愿请坎神字仁王，一部将军将吏各一千人，兵士各一万人，为某延度厄难。 兑鬼吏在坎，绝命在震，愿请乾神字昊成，六部将军将吏各六千人，兵士各六万人，为某延度厄难。 艮鬼吏在离，绝命在巽，愿请坤神字间冲，二部将军将吏各二千人，兵士各二万人，为某延度厄难。 乾鬼吏在巽，绝命在离，愿请兑神字见阳，十部将军将吏各七千人，兵士各七万人，为某延度厄难。 消灾却祸，安心定志，散除众恶，解释绝命五鬼所忌之宫，使相顺伏，消灭鬼炁。 次入章 次慰喻五藏依四时五行言之",
      "translated_text": "Next, dispelling disasters according to the Five Tones:\n\nFor a surname whose tone belongs to *Jue* (Wood), its baleful influence lies in the West (Metal). Reverently invoke the sixty-four officials of the *Bing-Ding* Eight Man Lords of the South to resolve the *Jue*-tone palace of this surname and expel the destined calamity of the Western Palace. May the Fire Virtue of the South’s *Yinghuo* Star Lord be entreated to vitalize the *Jue*-tone of the Eastern Palace, averting disaster and summoning fortune, while suppressing the harm of the *Taibai* Star’s white *qi*.\n\nFor a surname whose tone belongs to *Zhi* (Fire), its baleful influence lies in the North (Water). Reverently invoke the one thousand two hundred officials of the *Wu-Ji* Three Qin Lords of the Center to resolve the *Zhi*-tone palace of this surname and dispel the destined calamity of this palace. May the Earth Virtue of the Center’s *Zhen* Star Lord be entreated to vitalize the *Zhi*-tone of the Southern Palace, averting disaster and summoning fortune, while suppressing the harm of the *Chen* Star’s black *qi*.\n\nFor a surname whose tone belongs to *Gong* (Earth), its baleful influence lies in the East (Wood). Reverently invoke the thirty-six officials of the *Geng-Xin* Six Rong Lords of the West to resolve the *Gong*-tone palace of this surname and expel the destined calamity of the Eastern Palace. May the Metal Virtue of the West’s *Taibai* Star Lord be entreated to vitalize the *Gong*-tone of the Central Palace, averting disaster and summoning fortune, while suppressing the harm of the *Suixing* Star’s green *qi*.\n\nFor a surname whose tone belongs to *Shang* (Metal), its baleful influence lies in the South (Fire). Reverently invoke the twenty-five officials of the *Ren-Gui* Five Di Lords of the North to resolve the *Shang*-tone palace of this surname and expel the destined calamity of the Southern Palace. May the Water Virtue of the North’s *Chen* Star Lord be entreated to vitalize the *Shang*-tone of the Western Palace, averting disaster and summoning fortune, while suppressing the harm of the *Yinghuo* Star’s red and black *qi*.\n\nFor a surname whose tone belongs to *Yu* (Water), its baleful influence lies in the Center (Earth). Reverently invoke the eighty-one officials of the *Jia-Yi* Nine Yi Lords of the East to resolve the *Yu*-tone palace of this surname and expel the destined calamity of the Central Palace. May the Wood Virtue of the East’s *Suixing* Star Lord be entreated to vitalize the *Yu*-tone of the Northern Palace, averting disaster and summoning fortune, while suppressing the harm of the *Zhen* Star’s yellow and black *qi*.\n\nNext, dispelling the disasters of the Five Ghosts and the Absolute Fate:\n\nThe *Kan* Ghost Officer resides in *Dui*, and its Absolute Fate lies in *Kun*. May the *Xun* spirit named *Ming Yi*, with four divisions of generals, officers (four thousand each), and soldiers (forty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Li* Ghost Officer resides in *Gen*, and its Absolute Fate lies in *Qian*. May the *Zhen* spirit named *Xuan Ju*, with three divisions of generals, officers (three thousand each), and soldiers (thirty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Zhen* Ghost Officer resides in *Kun*, and its Absolute Fate lies in *Dui*. May the *Li* spirit named *Ming Shang*, with nine divisions of generals, officers (nine thousand each), and soldiers (ninety thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Kun* Ghost Officer resides in *Zhen*, and its Absolute Fate lies in *Kan*. May the *Gen* spirit named *Guo Yi*, with eight divisions of generals, officers (eight thousand each), and soldiers (eighty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Xun* Ghost Officer resides in *Qian*, and its Absolute Fate lies in *Gen*. May the *Kan* spirit named *Ren Wang*, with one division of generals, officers (one thousand each), and soldiers (ten thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Dui* Ghost Officer resides in *Kan*, and its Absolute Fate lies in *Zhen*. May the *Qian* spirit named *Hao Cheng*, with six divisions of generals, officers (six thousand each), and soldiers (sixty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Gen* Ghost Officer resides in *Li*, and its Absolute Fate lies in *Xun*. May the *Kun* spirit named *Jian Chong*, with two divisions of generals, officers (two thousand each), and soldiers (twenty thousand each), be entreated to extend deliverance through this tribulation.\n\nThe *Qian* Ghost Officer resides in *Xun*, and its Absolute Fate lies in *Li*. May the *Dui* spirit named *Jian Yang*, with seven divisions of generals, officers (seven thousand each), and soldiers (seventy thousand each), be entreated to extend deliverance through this tribulation.\n\nDispel disasters, avert misfortune, pacify the heart and settle the mind, disperse all baleful influences, and resolve the inauspicious palaces of the Absolute Fate and Five Ghosts, causing them to submit and harmonize, thereby extinguishing the *qi* of ghosts.\n\nNext, entering the invocation:\n\nNext, consoling and instructing the Five Viscera in accordance with the Five Phases and the Four Seasons.",
      "overlap_context": "officials\n- Geng-Shen: Hua Wenyang, with fifteen officials\n- Xin-You: Bing Yuanyu, with thirteen officials\n- Ren-Xu: Yue Jinqing, with eleven officials\n- Gui-Hai: Zuo Shisong, with nine officials\n\nThe names of the Six Jia spirits for each sixty-year cycle and their attending officials are as above. For each individual, determine the corresponding spirits and protective deities based on their natal year, current age, gestational month, birth month, and natal branch-stem, then invoke them by name.",
      "start_char": 9353,
      "end_char": 10197,
      "start_sentence": 500,
      "end_sentence": 527,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.02711009979248,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "今春木玉，肝藏受炁。 生炁循环，嘘吸紫府。 性命泉流，潮液所击。 愿紫微宫使者，温和凝淳。 源本上出两眼，下回手胁。 闭密中房，随节应会，功成道泰。 传以付心、脾、肺、肾肝，以次相连。 今夏火王，心藏受炁。 生炁循环，嘘吸炎府。 性命泉流，潮液所系。 愿绛宫使者，温和凝淳。 源本上出唇口，下回心中。 闭密中房，随节应会，功成道泰。 传以付脾、肺、肾、肝、心，以次相连。 今秋金王，肺藏受黑。 生炁循环，嘘吸素府。 性命泉流，潮液所系。 愿华盖宫使者，温和凝淳。 源本上出颊颐，下回肺中。 闭密中房，随节应会，功成道泰。 传以付肾、肝、心、脾、肺，以次相连。 今冬水王，肾藏受黑。 生炁循环，嘘吸玄府。 性命泉流，潮液所系。 愿双合官使者，温和凝淳。 源本上出两耳，下回玉海。 闭密中房，随节应会，功成道泰。 传以付肝、心、脾、肺、肾，以次相连。 今春夏秋冬季土王，脾藏受炁。 生炁循环，嘘吸土府。 性命泉流，潮液所系。 愿玉堂宫使者，温和凝淳。 源本上出口，下回脾中。 闭密中房，随节应会，功成道泰。",
      "translated_text": "This spring, Wood reigns supreme, and the liver-viscus receives its *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Purple Mansion. The fountain of life flows as a spring, surging with the tides of vital fluids. May the emissaries of the Purple Tenuity Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the two eyes and returns downward to the flanks. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace. Then transmit this to the heart, spleen, lungs, and kidneys, connecting the liver in due succession.\n\nThis summer, Fire reigns supreme, and the heart-viscus receives its *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Flaming Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Crimson Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the lips and mouth and returns downward to the heart’s center. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace. Then transmit this to the spleen, lungs, kidneys, and liver, connecting the heart in due succession.\n\nThis autumn, Metal reigns supreme, and the lung-viscus receives its dark *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Pristine Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Florid Canopy Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the cheeks and jaw and returns downward to the lung’s center. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace. Then transmit this to the kidneys, liver, heart, and spleen, connecting the lungs in due succession.\n\nThis winter, Water reigns supreme, and the kidney-viscus receives its dark *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Mysterious Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Twin Convergence Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the two ears and returns downward to the Jade Sea. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace. Then transmit this to the liver, heart, spleen, and lungs, connecting the kidneys in due succession.\n\nThis late season of the four phases, when Earth reigns supreme, the spleen-viscus receives its *qi*. The generative *qi* circulates in cycles, exhaling and inhaling through the Earthly Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Jade Hall Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the mouth and returns downward to the spleen’s center. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace.",
      "overlap_context": "and soldiers (seventy thousand each), be entreated to extend deliverance through this tribulation.\n\nDispel disasters, avert misfortune, pacify the heart and settle the mind, disperse all baleful influences, and resolve the inauspicious palaces of the Absolute Fate and Five Ghosts, causing them to submit and harmonize, thereby extinguishing the *qi* of ghosts.\n\nNext, entering the invocation:\n\nNext, consoling and instructing the Five Viscera in accordance with the Five Phases and the Four Seasons.",
      "start_char": 10197,
      "end_char": 10629,
      "start_sentence": 528,
      "end_sentence": 561,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.904715299606323,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "传以付季春，付心、脾、肺、肾、肝，以次相连。 季夏付肺、肾、肝、心、脾，以次相连。 季秋付、肾、肝、心、脾、肺，以次相连。 季冬付肝、心、脾、肺、肾，以次相连。 又法季秋季冬，用温和凝淳。 春季夏季，不须温和二字也。 次课四时请 春请四部启明君，夏请太微玉华君，秋请少昊金楼玉门君，冬请大冥幽窈君，今岁直神某，从官如干人。 今月直神某，从官如干人。 今日直神某，从官如干人。 今时直神某，从官如干人。 岁直太岁神，是今月直神。 甲己之岁，正月建丙寅，二月丁卯，以次尽十二月推之，他皆效此。 乙庚之岁，正月建戊寅，二月己卯。 丙辛之岁，正月建庚寅。 丁壬之岁，正月建壬寅，戊癸之岁，正月建甲寅。 依此推之，即知月中六甲也。 今日直神，即上章日神也。 今时直神，还用甲己推之也。 甲己之日，平日一起丙寅。 乙庚之日，平日一起戊寅。 丙辛之日，平旦起庚寅。 丁壬之日，平日一起壬寅。 戊癸之日，平日一起甲寅。 以此推之，即知时中六甲也。 次依四时送章付与玉童玉女 春付与青珪玉童、青腰玉女，夏付与赤璧玉童、赤珪玉女，秋付与素珪玉童、素珪玉女，冬付与玄素太晨玉童、玄机玉女，必使上达，伏受玄恩。 次上诣太上某宫伏须告报 一日建玉曹赤虚宫，二日太素曹太微宫，三日太微曹北平宫，四日都正曹太清宫，五日正一曹通明宫，六日玄一曹上明宫，七日太素曹高灵宫，八日灵集曹紫微宫，九日丹灵曹待春宫，十日太清曹武灵宫，十一日三水曹素女宫，十二日司录曹巨野宫，十三日清叔曹西明宫，十四日玄正曹上绛宫，十五日中都曹曲平宫，十六日司非曹北府宫，十七日司奸曹南真宫，十八日统摄曹东明宫，十九日统录曹西灵宫，二十日监考曹司命宫，二十一日监司曹阳明宫，二十二日典考曹太阳宫，二十三日司宫曹少阳宫，二十四日玄天曹太阴宫，二十五日太玄曹少阴宫，二十六日都司曹北辰宫，二十七日都候曹太白宫，二十八日直使曹林明宫，二十九日司直曹诸阳宫，三十日典考曹启明宫。 右一月之中三十日宫曹，上章日依此用之。 又章头若诣月宫者故录之卷后 正月太上虚无丈人宫，二月太上玄老仙都宫，三月、四月太上三天太清宫，五月太上道灵宫，一云重道宫。 六月、七月太上九炁文昌宫，八月太上天帝宫，九月、十月太上大道宫，十一月太上侍中左右监神诸将军宫，十二月太上虚无丈人宫，与正月同。 闰月太上金单太岁宫。 元辰章醮立成历卷下竟 ＃１『成』当为『戌』字之误。 ＃２『人』当为『未』字之误。",
      "translated_text": "Transmit this to the late spring, then to the heart, spleen, lungs, kidneys, and liver, connecting them in due succession. For the late summer, transmit to the lungs, kidneys, liver, heart, and spleen, connecting them in due succession. For the late autumn, transmit to the kidneys, liver, heart, spleen, and lungs, connecting them in due succession. For the late winter, transmit to the liver, heart, spleen, lungs, and kidneys, connecting them in due succession.\n\nAnother method: For late autumn and late winter, employ warmth, harmony, and pure concentration. For spring and summer, the terms \"warmth and harmony\" are not required.\n\nNext, invoke the deities of the four seasons:\nIn spring, invoke the Four Departments’ Radiant Lord;\nIn summer, the Supreme Tenuity Jade Flower Lord;\nIn autumn, the Lesser Brilliance Golden Portal Jade Gate Lord;\nIn winter, the Great Obscurity Profound Darkness Lord.\nFor this year’s governing spirit, [name], with attendant officials numbering [count].\nFor this month’s governing spirit, [name], with attendant officials numbering [count].\nFor this day’s governing spirit, [name], with attendant officials numbering [count].\nFor this hour’s governing spirit, [name], with attendant officials numbering [count].\n\nThe yearly governing spirit is the Grand Year Spirit, which is this month’s governing spirit.\nIn years of *jia* and *ji*, the first month is established in *bing-yin*, the second in *ding-mao*, and so on through the twelve months; other years follow this pattern.\nIn years of *yi* and *geng*, the first month is established in *wu-yin*, the second in *ji-mao*.\nIn years of *bing* and *xin*, the first month is established in *geng-yin*.\nIn years of *ding* and *ren*, the first month is established in *ren-yin*.\nIn years of *wu* and *gui*, the first month is established in *jia-yin*.\nBy this method, the six *jia* of the month are known.\n\nThe day’s governing spirit is the day spirit of the preceding petition.\nThe hour’s governing spirit is also determined by the *jia* and *ji* cycle:\nOn *jia* and *ji* days, the first hour begins with *bing-yin*.\nOn *yi* and *geng* days, the first hour begins with *wu-yin*.\nOn *bing* and *xin* days, the first hour begins with *geng-yin*.\nOn *ding* and *ren* days, the first hour begins with *ren-yin*.\nOn *wu* and *gui* days, the first hour begins with *jia-yin*.\nBy this method, the six *jia* of the hour are known.\n\nNext, according to the four seasons, transmit the petition to the Jade Lads and Jade Maidens:\nIn spring, to the Azure Jade Lad and Azure-Sashed Jade Maiden;\nIn summer, to the Vermilion Jade Lad and Vermilion Jade Maiden;\nIn autumn, to the White Jade Lad and White Jade Maiden;\nIn winter, to the Profound Simplicity Great Dawn Jade Lad and Mysterious Mechanism Jade Maiden.\nEnsure it is conveyed upward to receive the profound grace.\n\nNext, proceed to the Supreme [N.] Palace and await the report:\nOn the first day, the Jade Bureau’s Crimson Void Palace;\nOn the second, the Supreme Tenuity Bureau’s Supreme Tenuity Palace;\nOn the third, the Supreme Tenuity Bureau’s Northern Peace Palace;\nOn the fourth, the Capital Rectifier Bureau’s Supreme Clarity Palace;\nOn the fifth, the Orthodox Unity Bureau’s Illuminating Communication Palace;\nOn the sixth, the Profound Unity Bureau’s Upper Clarity Palace;\nOn the seventh, the Supreme Tenuity Bureau’s Lofty Spirit Palace;\nOn the eighth, the Spirit Assembly Bureau’s Purple Tenuity Palace;\nOn the ninth, the Cinnabar Spirit Bureau’s Awaiting Spring Palace;\nOn the tenth, the Supreme Clarity Bureau’s Martial Spirit Palace;\nOn the eleventh, the Three Waters Bureau’s White Maiden Palace;\nOn the twelfth, the Registrar Bureau’s Vast Plain Palace;\nOn the thirteenth, the Pure Uncle Bureau’s Western Clarity Palace;\nOn the fourteenth, the Profound Rectifier Bureau’s Upper Crimson Palace;\nOn the fifteenth, the Central Capital Bureau’s Crooked Peace Palace;\nOn the sixteenth, the Censor Bureau’s Northern Mansion Palace;\nOn the seventeenth, the Surveillance Bureau’s Southern Perfection Palace;\nOn the eighteenth, the Governing Bureau’s Eastern Clarity Palace;\nOn the nineteenth, the Governing Registrar Bureau’s Western Spirit Palace;\nOn the twentieth, the Inspector Bureau’s Controller of Destiny Palace;\nOn the twenty-first, the Supervisor Bureau’s Yang Brilliance Palace;\nOn the twenty-second, the Examiner Bureau’s Great Yang Palace;\nOn the twenty-third, the Palace Bureau’s Lesser Yang Palace;\nOn the twenty-fourth, the Profound Heaven Bureau’s Great Yin Palace;\nOn the twenty-fifth, the Supreme Profundity Bureau’s Lesser Yin Palace;\nOn the twenty-sixth, the Capital Controller Bureau’s Northern Culmen Palace;\nOn the twenty-seventh, the Capital Observer Bureau’s Grand White Palace;\nOn the twenty-eighth, the Directing Envoy Bureau’s Forest Clarity Palace;\nOn the twenty-ninth, the Controller Bureau’s All Yangs Palace;\nOn the thirtieth, the Examiner Bureau’s Radiant Dawn Palace.\n\nThese are the thirty palace bureaus of a single month; the petition day follows this order.\n\nIf the petition is to be presented to the monthly palace, record the following at the end of the scroll:\nIn the first month, the Supreme Void Venerable’s Palace;\nIn the second, the Supreme Profound Elder’s Immortal Capital Palace;\nIn the third and fourth, the Supreme Three Heavens’ Supreme Clarity Palace;\nIn the fifth, the Supreme Dao Spirit Palace (also called the Double Dao Palace);\nIn the sixth and seventh, the Supreme Nine *Qi* Literary Prosperity Palace;\nIn the eighth, the Supreme Heavenly Thearch’s Palace;\nIn the ninth and tenth, the Supreme Great Dao Palace;\nIn the eleventh, the Supreme Attendant Left and Right Supervising Spirit Generals’ Palace;\nIn the twelfth, the Supreme Void Venerable’s Palace (same as the first month).\nIn an intercalary month, the Supreme Golden Simplicity Grand Year Palace.\n\nThe *Yuanchen* Petition and Offering Established Calendar, Scroll the Lower, is now complete.",
      "overlap_context": "erative *qi* circulates in cycles, exhaling and inhaling through the Earthly Mansion. The fountain of life flows as a spring, bound to the tides of vital fluids. May the emissaries of the Jade Hall Palace bring warmth, harmony, and pure concentration. Its source emerges upward through the mouth and returns downward to the spleen’s center. Seal the central chamber with utmost secrecy, aligning with the seasons and responding to their rhythms, until merit is accomplished and the Dao attains peace.",
      "start_char": 10629,
      "end_char": 11642,
      "start_sentence": 562,
      "end_sentence": 598,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.39381694793701,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\元辰章醮立成历.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}