{
  "source_id": "内丹诀",
  "source_file": "chunked_daozang\\内丹诀.json",
  "total_chunks": 13,
  "total_original_chars": 9278,
  "total_translated_chars": 53047,
  "total_translation_time": 258.96982192993164,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Chen Master’s Inner Elixir Formula**\n\n**Scripture Title:** *Chen Master’s Inner Elixir Formula*\nAuthor: Chen Pu of the Northern Song Dynasty\nOne fascicle.\nSource of the base text: *Daoist Canon of the Orthodox Tradition*, Taiping Section.\n\n**Preface to Chen Master’s Inner Elixir Formula**\n\nThe Master’s name was Pu, styled Chongyong. He lived during the late Tang and early Five Dynasties period. Amid the chaos of the Five Dynasties, he withdrew from the world and entered Shu, concealing himself in Mount Dafeng of Qingcheng. There, he received the Dao from Master Zhongli and shared the same teacher as Lü Dongbin.\n\nThe Master possessed extraordinary talent and lofty virtue, accumulating years of practice—now unknown to be how many centuries old. At times, he appeared in the world, though his nature was unpredictable, delighting in song and wine.\n\nDuring the *Wuwu* year of the Yuanfeng era (1078), he traveled to the Southern Capital. Zhang Fangping, the Duke of Songcheng, honored his advanced age and transmitted to him the art of *qi*-absorption, extending his lifespan by a twelve-year cycle. The Master lingered in the Southern Capital for no less than half a year. He carried an earthen jar without a bottom, wandering through the markets, few recognizing him. An old rustic from Huainan, however, revered and believed in him, even becoming his disciple.\n\nMoved by the man’s utmost sincerity, the Master bestowed upon him the *Inner Elixir Formula*, which was then recorded.\n\nThe Master’s *Inner Elixir Formula* directly points to the Mysterious Pass, achieving the Dao through nine transformations. Each transformation begins with a brief song, followed by verses set to the tune of *Wang Jiangnan*, so that later learners of the Dao beyond the world may readily understand.\n\nComposed by Chen Pu, styled Chongyong.\n\n**First Transformation Song**\n\n**First Transformation Song**\n\nThe work of the first transformation resembles a precious pearl—\nHeaven’s true water, One,\nconcealed within the gallbladder.\nYin and yang harmonize,\ndescending as the elixir,\nshaped like a single dewdrop.\n\nMountains, rivers, and the cosmos pierce the numinous body.\nMan arises from the father’s essence and mother’s blood,\ntheir union forming the physical frame;\nthe elixir descends when heart-fire and kidney-water unite,\ntheir qi intermingling.\nAs the elixir descends,\nthe spirit roams beyond the mundane,\nyin and yang in perfect harmony,\nso profound as to forget the form.\nHeaven and earth, the four directions, the ten thousand things—\nall lie within this body,\nwhile this body dwells beyond heaven and earth.\nOnly this single point of radiance is perceived,\nbright as the sun—\nthis is the elixir’s descent.\n\nBeneath the red lotus leaf lies the elixir cave—\nbeneath the tongue, two apertures:\nthe left connects to the heart,\nthe right to the gallbladder.\nTrue qi flows through them,\ncommuning with the numinous.\nThus, when the body is unwell,\nthe fluid beneath the tongue dries,\nfor true qi is depleted.\nAt the first transformation’s outset,\nseal the two apertures with the tongue,\npreventing true qi from leaking outward,\nso the numinous water may flow.\nCrimson water courses through nine distinct signs.\nThe crimson water—fluid of the nine transformations’ beginning—\neach ninth day, take nine subtle breaths,\neach breath eight or nine times.\nNaturally, the fluid will flow,\narising from the tongue\nto irrigate the lower storehouse—\nthese are the nine signs.\n\n*To the tune of* **Wang Jiangnan**\nThe Central Yellow Treasure must be sought within the gallbladder...\n\nThe Heavenly One generates qi, called the Central Yellow. This qi is stored in the gallbladder, serving as the root and origin of life and nature. Its flavor is bitter—just as the roots and stems of flowers and trees, though seemingly devoid of sensation, also bear a bitter taste—thus we know that without the generative qi, the myriad things cannot come to life. The medicine of the internal elixir must first seal the two apertures beneath the tongue, inwardly connecting to the generative qi within the gallbladder. When it reaches the space between the throat and tongue, a faint bitterness arises—this is the generative qi flowing freely. Only then may one seek the numinous to form the elixir.\n\nThe Spring Emperor’s decree stirs all things to life; only when the myriad things receive the qi of spring do they flourish. If one can circulate the qi of the gallbladder, the internal elixir will be accomplished. Heaven and Earth lie beneath our knees, and the hundred vessels flow freely. As the generative qi ascends, the mouth perceives bitterness; yang and yin harmonize greatly, and the spirit dwells beyond the heavens. Then the four seas and all under heaven seem as if beneath our knees, the vast qi fills heaven and earth, the hundred vessels course unimpeded, and the myriad apertures open wide—this is the descent of the internal elixir.\n\nTo enact transformation, draw the dual fires from left and right. At the outset of practice, first seal the two apertures beneath the tongue to prevent qi from leaking outward. The qi from the left and right apertures ascends inwardly: the left contributes to the left Greater Yang, entering the right side of the brain; the right passes through the brain to the crown, reaching the Mud Pill Palace, where they merge into one. Descending the twelve-storied tower of the throat, they enter the heart meridian, then pass into the gallbladder, surging open its aperture. The generative qi within the gallbladder ascends, following the heart and gallbladder meridians to penetrate the tongue’s apertures, causing the tongue to taste bitterness—this is the generative qi flowing freely, heralding the descent of the elixir.\n\nThe vast qi soars, filling the cosmos; the bitter mist wafts upward through the twelve-storied tower. Once the gallbladder’s aperture opens, the generative qi rises gently, ascending the twelve-storied tower to enter beneath the tongue, filling the mouth with bitterness—this is the sign of the generative qi flowing freely. Husband and wife gradually conspire together. When the generative qi flows freely, yin and yang harmonize greatly, and heart and kidney unite—thus they gradually conspire.\n\n**Oral Instructions:**\nAt the outset of practice, one must first regulate the five viscera with diet, avoiding hunger or overindulgence. The mind-field must be tranquil, free from worry or sorrow—only then may one enter the Dao. Always at the end of the second watch, the beginning of the third, first wash and rinse, then burn incense in a quiet chamber. Sit cross-legged, close the eyes, and gather the spirit. Wait until the breath is even, then curl the tongue upward to seal the two apertures at its root. Hold the breath, and gradually perceive two channels of qi from the base of the molars, passing through the Greater Yang meridians to the crown, reaching the Mud Pill Palace—this counts as one cycle. Then open the eyes briefly, close them again to gather the spirit, and repeat the tongue-curling. When the qi reaches the Mud Pill Palace, stop. Perform this three times each night. After several nights, or ten days, or half a month, gradually feel the qi reach the Mud Pill Palace, then flow into the brain, descending the twelve-storied tower, passing the spine’s junction, threading the tailbone to ascend, entering the heart and penetrating the gallbladder. A gentle warmth arises in the chest, and the mind feels harmonious and at ease—this is the descent of true qi.\n\nAfter practicing thus for several more nights, gradually feel the qi reach the heart, then a subtle warmth, or a slight stirring of qi at the heart’s center, followed by a warm current. It ascends from the heart, passing the twelve-storied tower to enter beneath the tongue, and the mouth gradually tastes bitterness—this is the Central Yellow’s qi emerging from the gallbladder. Yin and yang harmonize greatly, signaling the imminent descent of the elixir. Thereafter, at the start of each night’s practice, have someone stand outside the door to prevent people, cats, dogs, or other disturbances, lest they suddenly startle you.\n\nWhen performing the three cycles each night, place a small table before you. If, during the circulation of qi, you feel the body gradually expand and the spirit soar, you may perceive your dwelling, the city, and all under heaven as if contained within your body. The body above feels as vast as heaven, below as boundless as earth; hands and feet seem to vanish. Quickly press your hands on the table, close your eyes, and perceive only a luminous orb at the heart’s center, round as the sun. Suddenly it falls—this is the descent of the elixir.\n\nAfter the elixir descends, do not open your eyes immediately. Gradually gather the spirit and return it to the four limbs. Hands and feet resume their usual state, though they may feel slightly numb. Remain composed for some time, then open your eyes and drink ginseng broth before sleeping. The next day, eat congee and rest for one or two days—this completes the descent of the elixir. Once the elixir has descended, the hundred diseases vanish, and no suffering from illness or misfortune remains.\n\n**Song of the Second Transformation:**\nAt the second transformation, yang is completed and yin begins to accumulate. At the outset of the second transformation, it is like a woman two months pregnant—the elixir’s initial descent forms from the essence of the true. After the elixir descends, when the second transformation meets the ninth day, one must nurture yang; when the third transformation meets the sixth day, nurture yin—this is the work of embracing and nourishing.\n\nThe heart’s light and the kidney’s fluid correspond to ding and ren. The heart belongs to fire, which is yin, matching the southern ding fire—ding is the yin of fire. The kidney belongs to water, which is yang, matching the northern ren water—ren is the yang of water. At the second transformation, nurture yang, so the heart’s light stirs below; at the third transformation, nurture yin, so the kidney’s fluid rises above. True water and true fire unite above and below, corresponding to ding and ren, embracing and nourishing the true elixir to accomplish the work of transformation.\n\nThe divine pearl dashes like lightning to the Northern Sea. When the elixir first descends, it is nurtured within the heart’s network, cultivated by true fire to quicken the elixir. Once the first transformation is complete, the true elixir suddenly flows down from the heart’s network, stored in the cinnabar field, and nurtured by true water—this is the work of the second transformation.\n\nFrom time to time, the numinous light illumines the purple depths. After the elixir is stored in the cinnabar field, its qi gradually matures. Suddenly, in a quiet chamber, a divine light shines from the eyes, appearing like a golden orb—this is the elixir’s light.\n\n\"Gazing at the River South\"\nThe mysterious pearl descends as elixir, its cavern in the Central Palace—\nThe mysterious pearl is the true elixir; at the first transformation’s beginning, it is stored in the heart’s network, hence called the Central Palace.\n\nThe nine pulses harmonize with the repeated ninefold count—\nAfter the elixir descends, whenever nine days pass, one closes the breath. Nine pulses form one cycle, and nine cycles of nine—eighty-one breaths—complete the repeated ninefold count.\n\nCrimson waves suddenly surge to the east of the Great Yang—\nWhen the nine-by-nine work is complete, the true elixir’s yang is full. Suddenly, it flows down from the heart into the cinnabar field, stored in the Water Mansion to nourish its yin—this is the eastern sea of Great Yang.\n\nHeart and kidneys first interflow—\nInitially, the elixir descends and is stored in the heart to nurture true fire; at the second transformation, it returns to the Kidney Palace to nurture true water. Thus, yin and yang achieve great harmony and interflow.\n\nEncountering six brings repeated sixfold yin work—\nWhen six arrives, one closes the breath in sixfold counts for one cycle, and six cycles of six—thirty-six breaths—form one round to nourish yin.\n\nFire from the Sea Gate ascends to the Emperor’s Throne—\nThe Sea Gate is the cinnabar field, the Kidney Mansion. When the true elixir is stored within the cinnabar field and the yang count is full, at every noon, the spirit-fire from the cinnabar field rises as hot qi to reach the heart above.\nThe Emperor’s Throne is the heart.\n\nWater from the Lotus Pond aids Lord Ding—\nThe Lotus Pond is the tongue. When the six-by-six yin count is complete, the divine water of the Flower Pool beneath the tongue flows down to irrigate the heart’s network, nourishing the elixir’s qi.\nDing is the fire of the heart.\n\nPurple lightning pierces the intricate depths—\nWhen the true elixir’s qi is full, divine light at times shines from the face and eyes.\nAt midnight, in seated meditation, one inwardly observes the five viscera and six bowels, seeing clearly within and without, directly witnessing the mysterious pearl nurtured in the cinnabar field.\n\nOral Instructions:\nAfter the elixir descends and the first transformation is complete, whenever the ninth, nineteenth, or twenty-ninth day arrives—these three ninefold days—at high noon, in a quiet chamber, close the door, sit upright, cross the legs, close the eyes, and knock the teeth nine times. When spirit is settled and qi harmonized, then close the breath.\nEach closure lasts eight or nine breaths as one cycle, then open the eyes.\nAfter a long while, close the breath again as before, eight or nine breaths per cycle.\nAt first, close once or twice; as practice grows familiar, close four or five times. With further mastery, close nine times.\nContinue thus until the inner fire’s timing is fully ripe, resonating with heaven and earth, regardless of distance.\nSuddenly, upon the ninth closure, warmth arises in the heart, the four limbs feel harmonious and at ease, and the spirit stirs.\nA stream of hot qi flows down into the cinnabar field—this is the inner elixir entering the cinnabar field, marking the completion of the second transformation.\nAfter this, one no longer practices the ninefold breath count.\n\nSong of the Third Transformation:\n\"For the third transformation, move yang to enter the left palace...\"\n\nWith the second transformation’s elixir complete, it is stored within the cinnabar field, awaiting the sixfold movement of yin to nurture the true yin qi. Once the inner yin’s count is fulfilled and flows in harmony with heaven and earth, the true elixir suddenly streams from the cinnabar field into the left flank. The four limbs perspire, expelling the corpse qi, and thus the third transformation’s work is achieved. From this point onward, the three corpse spirits are no more.\n\nThe灵珠’s embryonic hue gradually turns crimson—\nThe *lingzhu* is the inner elixir. Upon the third transformation’s completion, yang qi becomes abundant, and even urine and saliva take on a pinkish tint, reflecting the pure yang essence. When the elixir’s radiance shines within, one perceives a luminous pearl like a wheel of fire beneath the left flank.\n\nThe divine body nurtures fire to manifest form—\nAfter the third transformation, with yang qi now sufficient, at each month’s end, one uses the left hand to stroke the crown while drawing breath to stir the elixir fire, ceasing only when the five viscera grow warm—this is called *nurturing fire* to circulate the elixir. Thereafter, within the cinnabar field, a presence gradually becomes perceptible, moving with each inhalation. Thus it is said: *manifesting form*.\n\nHeavenly music hastens the work of creation—\nThe harmony of heaven resounds above the nine skies, evoking sounds like celestial instruments in unison, called *heavenly music*. The nine orifices of man do not hear it. Yet after the third transformation, with the nine orifices sharpened, the sound of heavenly music is heard day and night.\n\n*Wang Jiang Nan*:\nHair falls as the elixir,\nYang circulates to the left—\nAfter the third transformation, with yang qi abundant, the body’s hair naturally sheds, driven away by the surging yang toxin.\nThe embryo’s hue reddens as yin recedes—\nThe inner elixir’s color deepens to red. With the third transformation’s work complete and inner yang’s count fulfilled, yang prevails, causing the yin turtle to shrink, even the intestines and stomach to contract slightly. Within a month, there are no more than ten instances of bowel movements or urination, and one attains the rank of earth immortal, achieving the Dao of the leakless.\n\nThe passage of years strengthens the firmness of Qian—\nThe hexagram *Qian* consists of six unbroken lines, all pure yang. When the third transformation’s yang count is fulfilled, the body mirrors *Qian*, becoming pure yang.\nNurture fire at the center—\nStroke the crown while drawing breath to cultivate the true fire within.\nManifest form, the five peaks discern subtle radiance—\nWith the third transformation’s elixir formed, though the five peaks are not yet complete, its movements resemble a three- or four-inch infant, not yet fully distinct.\nIts emergence is slow, its form still small—\nThe sacred embryo takes shape, the spirit dwelling within, emerging with form like a newborn. In moments of quiet sitting and breath-holding, it often appears on the face, playing within a square *zhang*. Yet as yang qi is only now sufficient and yin has not been nurtured, the sacred embryo possesses a soul but lacks a corporeal soul, so its emergence is slow and its form still small.\n\nAt dawn and dusk, heavenly music plays the reed pipes—\nWith the seven orifices sharpened, the immortal melody is ever heard.\nOne constantly drinks the jade flask’s nectar—\nThe blossoming pool’s spring, the sweet dew’s water, is ever sipped.\n\nOral Instructions:\nAfter the elixir enters the left flank, the third transformation’s work is complete.\n\nOn the sixth, sixteenth, and twenty-sixth days of each month—these three days—at midnight, after washing and rinsing, enter a quiet chamber. Sit upright with legs crossed, knock the teeth nine times, gather the spirit and settle the qi, then close the eyes and draw breath inward. Six breath-holds constitute one cycle; then open the eyes, rest a while, and close them again to draw six breaths for the second cycle. Proceed thus for six cycles, and the practice is complete. By the twenty-sixth day of the month, three full cycles will have been accomplished. On the last night of the month, at the third watch of midnight, return to the quiet chamber as before, sit with eyes closed and legs crossed. First, use the left hand to rub the crown of the head and the right hand to rub the *weilu* (the base of the spine), turning with the sun seventy-seven times—forty-nine rotations. While rubbing, hold the breath firmly; when the count is complete, rest briefly, then resume when the qi has settled. Repeat this three times, and naturally the qi of heart and kidney will merge at the central diaphragm, stirring the elixir qi to fill the five viscera. Within the five organs, a heat like fire will be felt—this is the sign of nurturing the fire.\n\nAfter this practice, on one of the three six-day nights or at the month’s end, one may suddenly feel the elixir within the left flank stir beneath the ribs, perhaps with a faint sound. A stream of hot qi will traverse the cinnabar field and enter beneath the right flank, its heat like fire, shaking for a long while before settling—this completes the fourth transformation’s work. Thereafter, the repeated sixfold count is no longer observed.\n\n**Song of the Fourth Transformation**\nThe fourth transformation moves yin into the right gate—\nLeft pertains to yang, right to yin; the fourth transformation’s sign is the inner elixir’s left-right correspondence with the inner yin count. From this point, inner yin and yang are both fulfilled.\nThe sacred embryo’s numinous work births the immortal visage—\nThe third transformation nurtures yang, giving the sacred embryo its *hun*; the fourth nurtures yin, giving it its *po*. When the elixir reaches the fourth transformation, the sacred embryo’s *hun* and *po* are both perfected, and the five peaks’ spirits merge with one’s inner form, producing the true body of the emergent spirit.\nA halo of light fills the seat, the spirit unbound—\nAfter the fourth transformation, with yin and yang qi sufficient, sitting in quiet repose, the elixir’s divine radiance emerges from the crown of the head like a full moon encircling the body. The spirit roams within and without, coming and going freely. Seated in the chamber, one may perceive fortune and misfortune a thousand *li* away—this is the accomplishment of wondrous function.\nDancing and playing, it departs and returns at will—\nThe spirit’s comings and goings are unimpeded, following its own inclination.\n\nTo the Tune of *Wang Jiangnan*\n\nThe elixir moves to the right,\nIn the fourth revolution, yin is cultivated.\nThe work of the fourth revolution nurtures inner yin,\nThe elixir rests in the right flank, signifying yin.\n\nWhen the sixth day arrives, close the gate of yang qi—\nThe nose is the heavenly aperture, the passage of qi belonging to yang;\nThe mouth is the earthly aperture, the passage of qi belonging to yin.\nOn the nights of the third and sixth [days], seal the nose’s breath,\nCutting off its coming and going.\nThus yang qi descends within, filling the five viscera—\nThis is using yang to nourish yin.\n\nThe Jade Pass’s spring permeates, uniting *ding* and *ren*.\nSealing the nose’s breath, the Flowery Pond’s waters brim,\nTrickling down the heart’s network.\nWater and fire intermingle within;\nHeart qi descends, kidney qi ascends,\n*Ding* and *ren* unite to nurture the sacred embryo.\n\nThe turtle plays, rising and sinking at will—\nWhen yin and yang’s measures are complete,\nThe embryo in the right flank,\nNow ascending, now descending,\nSways with the qi’s movement,\nLike a turtle in water, drifting and diving as it pleases.\n\nAt times, it comes and goes without hindrance,\nPiercing others’ hearts—\nWhen the sacred embryo’s spirit is sufficient,\nIts comings and goings are unimpeded.\nAt dawn, it roams in the western lands;\nAt dusk, it enters the eastern capital.\nWithout leaving the chamber, one sits and surveys the realm.\nAs for the minds of others,\nOne’s spirit may commune with theirs,\nDiscerning their intentions—\nThis is called \"piercing others’ hearts,\"\nThe penetration of others’ minds.\n\nPlayful, the spirit’s constant emergence from the face—\nWhen the sacred embryo is perfected,\nThe infant comes and goes between the brows,\nRoaming and playing within the four seas,\nManifesting the natural wonder of spiritual power.\n\nA halo of light encircles, spanning a thousand *xun*—\nThe inner elixir’s radiance envelops the body,\nIts form like the moon.\n\nNeither cold nor heat can encroach.\n\n**Oral Instructions**\nAfter the elixir enters the right flank,\nCultivate the work of the fourth revolution.\nWhenever encountering the sixth, sixteenth, or twenty-sixth day of the month,\nAt midnight, the hour of *zi*,\nAfter washing and rinsing,\nEnter a quiet chamber.\nClose the eyes, cross the legs,\nKnock the teeth thirty-six times,\nGather the spirit, settle the qi,\nAnd seal the nose’s breath.\nThough the nose’s breath is sealed,\nDo not force it as in previous days.\nLet there be no breath of coming or going within the nose,\nPerfectly still and unmoving.\nWait until true qi fills within,\nThe elixir’s qi pierces the tongue’s aperture,\nThe Flowery Pond’s fluids well up, filling the mouth,\nNearly overflowing—\nThen gently swallow them, guiding them to the heart.\nWhen the divine water reaches the heart,\nIt stirs the divine fire;\nThe five viscera grow warm,\nThe whole body sweats,\nThe four limbs relax—\nThis is one cycle.\nOn each of the third and sixth nights,\nPerform this three times and then stop.\nThis is the time for divine water and divine fire\nTo bathe and nurture the sacred embryo.\n\nAfter this,\nSuddenly, in the midst of practice,\nThe inner elixir from the right flank\nRumbles like thunder,\nA stream of hot qi flows into the elixir field.\nFirelight shoots from the nose—\nThis is the inner elixir returning to the elixir field,\nCompleting the fifth revolution.\nFrom this point onward,\nNo longer practice sealing the gate of yang breath.\n\n**Song of the Fifth Revolution**\nThe fifth revolution completes the transformations of yin and yang—\nThe third revolution nurtures inner yang,\nThe fourth revolution nurtures inner yin.\nBy the fifth revolution, the measures of inner and outer yin and yang are complete,\nThe work of transformation is done,\nThe sacred embryo is nurtured,\nAnd spiritual power is free.\n\nThe infant, a foot long, plays with solar essence—\nAfter the fifth revolution,\nThe inner elixir’s sacred embryo,\nHaving nurtured its numinous body,\nGrows over a foot in length.\nFrom this point, one absorbs the sun’s essence\nTo nourish outer yang,\nSeizing the transformative power of heaven and earth.\n\nWaking, one roams the four seas; sleeping, one knows one’s place—\nOrdinary people, lacking inner cultivation,\nScatter their spirit and essence,\nWith no place to return.\nBy day, their spirit dwells in the heart;\nBy night, their spirit leaves the body.\nWhen they fall asleep,\nTheir spirit has no guard,\nThey forget their body,\nAnd know not where they are.\nFollowing the *hun* and chasing the *po*,\nThey enter dark realms,\nGathering with ghosts.\nIn dreams, they see all things.\nWhen the four great elements suddenly dissolve,\nTheir spirit follows the ghosts,\nReceiving rebirth according to their fortune.\nHeaven and hell are not of their choosing—\nThis is because their spirit does not recognize its own body,\nDrifting with the waves.\n\nThose who attain the Dao,\nHaving perfected the inner elixir,\nDwell their spirit in the elixir,\nTheir numinous body free.\nBy day, their spirit roams;\nBy night, their spirit settles.\nWhen they sleep,\nTheir spirit sees their body,\nAnd no thing can tempt it.\nThus the *hun* and *po* lie hidden,\nA hundred evils cannot intrude.\nNo more dreams or sleep—\nThey depart from life and death,\nComing and going as they please.\nTheir spirit’s comings and goings are unfathomable,\nThus the elixir classics say, \"The true person has no dreams,\"\nReferring to this.\n\nComing and going, they wander effortlessly.\n\nThe pearl from the right,\nA bolt of lightning enters the cinnabar city.\nAfter four revolutions, the work is complete,\nYin and yang’s numbers fulfilled.\nThe inner elixir’s mystic pearl\nSuddenly from the right flank—\nA stream of true fire\nFlies into the cinnabar field.\nIts sound like thunder,\nIts nose’s light like flame.\nThis is when the pearl’s inner yin and inner yang are both full,\nReturning to the cinnabar field\nTo complete the fifth revolution’s position.\n\nWithin the sacred embryo, the infant grows a foot long,\nThe true person perfected within the holy womb,\nExiting and entering through the crown gate,\nOver a foot in length.\n\nAt times, meeting the ninefold numbers, they gather yang essence.\nThe third revolution nurtures inner yang,\nThe fourth nurtures inner yin.\nThus yin and yang are both full,\nThe elixir returns to the cinnabar field,\nThe work of the fifth revolution complete—\nThey seize heaven and earth’s creative power,\nGathering the sun’s essence to nourish their outer yang.\nThe path of cultivation,\nFrom inner to outer,\nFollows this natural order.\nTherefore, after the fifth revolution,\nWithin a month’s time,\nOn the days of the three nines,\nThey gather the sun’s essence\nTo nourish the sacred embryo.\n\nFire arises within water.\nThe method of practice:\nSeeking fire through water,\nDrawing yang through yin.\nWater and fire in harmony,\nYin and yang in great accord—\nThus fire arises within water.\n\nBurning the Ghost Mountain,\nThe purple palace stands towering.\nOrdinary people accumulate yin qi below the cinnabar field,\nCalled the Ghost Mountain.\nWhen the elixir completes the fifth revolution,\nInner and outer fire ignite,\nBurning away the Ghost Mountain,\nThe entire body pure yang.\nThe yin ghost’s mountain consumed,\nThe yang spirit’s palace established—\nThus the mountain burns, and the ghost’s talisman is no more.\n\nWandering at will through the seas of the world,\nSleeping like a whale on the desert sands,\nMoving in harmony with the seasons.\nAfter the fifth revolution,\nThe work of creation is complete,\nJoining virtue with heaven and earth,\nBright as the sun and moon.\nTransformations flow with time—\nThus they move in harmony with it.\n\nOral Instructions:\nWhen the inner elixir returns to the cinnabar field,\nThe work of the fifth revolution complete,\nThe numbers of inner yin and yang fulfilled,\nThen gather outer yin and yang\nTo perfect the great Dao.\nWhenever encountering the ninth, nineteenth, or twenty-ninth day of the month—\nThe three ninefold days—\nAt high noon,\nFace south, cross your legs,\nClose your eyes, and sit facing the sun.\nWait for the qi to settle,\nClose your nostrils, and halt your breath,\nSo that true yang does not leak,\nFilling the interior.\nThe inner true fire communicates with the outer true fire,\nAnd you will feel your entire body above and below\nGlowing red and radiant.\nAfter sitting for one or two moments,\nGradually, a stream of true water from the cinnabar field,\nA cold qi, rises to penetrate the heart,\nLike a sphere of crystal\nResting above it.\nThen open your eyes and release your breath,\nInhaling the sun’s qi through your nose,\nEighty-one breaths in all,\nDrawing it into the heart.\nOnce the sun’s qi reaches the heart,\nIt clashes with the true water.\nAfter half the breaths,\nYou will gradually feel the qi stir in your heart,\nThe inner elixir in the cinnabar field\nLike a leaping fish—\nThis is the great harmony of yin and yang.\nStop at eighty-one breaths.\nPractice this for three years to complete the work.\nWhen the three-year count is full,\nCease gathering the sun’s essence\nAnd instead gather the moon’s radiance.\n\nThe Sixth Revolution Song:\nAt the sixth revolution, the spirit is whole, playing with the moon’s radiance.\nWhen the elixir reaches the sixth revolution,\nInner and outer yin and yang are both full,\nThe sacred embryo’s spirit complete.\nThe true person and the inner body become one.\nOn every full moon night,\nThey gather the moon’s essence and splendor\nTo accumulate true yin—\nThus they play with the moon’s radiance.\n\nTransforming the embryo, the hun and po’s shadows recede.\nTransforming the embryo:\nThe ordinary womb becomes the sacred womb.\nAt the fifth revolution, true yang is complete,\nThe hun transforms into spirit.\nAt the sixth revolution, true yin is complete,\nThe po transforms into qi.\nWith hun and po within and without,\nThey wander at noon without shadow.\nFrom this point on,\nEven ghosts and spirits cannot see them,\nAnd the yin realm is unfathomable—\nThis is the true immortal’s path,\nThe shadow receding into obscurity.\n\nYang cinnabar replaces the bones, yin dissolves the flesh.\nThe ordinary person’s impure bones,\nYin and yang unclean,\nCannot ascend.\nThe perfected Daoist,\nAfter the elixir completes the fourth revolution,\nBy the fifth revolution,\nGathers the sun’s essence into the cinnabar field,\nCoagulating it into yang cinnabar.\nAfter a year of gathering the sun’s essence,\nThe yang cinnabar within is pure,\nEntering the marrow,\nReplacing the ordinary bones\nAnd generating immortal bones.\nThey will feel at night\nSweat like white cream—\nThis is the ordinary bones dissolving with the sweat.\nStop at eighty-one breaths.\nThus it is said: yang cinnabar replaces the bones.\nAfter the fifth revolution replaces the bones,\nBy the sixth revolution,\nThey gather the moon’s radiance into the cinnabar field,\nCoagulating it into yin powder.\nAfter a year of gathering the moon’s radiance,\nThe yin powder within transforms,\nEntering the flesh,\nReplacing the ordinary flesh\nTo nourish the immortal skin.\nThey will feel in their urine and stool\nPurple blood constantly expelled—\nThis is the ordinary flesh silently dissolving,\nImmortal flesh growing.\nThus it is said: yin dissolves the flesh.\n\nReplaced entirely, like jade freed of flaws.\nJade with flaws\nCannot become true jade.\nPeople with ordinary flesh and impure bones\nCannot become true persons.\nAfter the sixth revolution,\nThey replace their ordinary bones with immortal bones,\nShed their ordinary flesh to grow immortal flesh.\nReplaced entirely, without flaw,\nTheir spirit and clarity become one.\n\n*Looking at the River South*:\nThe sun’s essence full,\nThe yin po transforms, formless.\nAt the sixth revolution, yin and yang’s numbers complete,\nHun and po inwardly transformed,\nThe body formless—\nThus they ascend the true person’s path.\n\nOn every full moon, open the northern door.\nAfter the sixth revolution,\nOn every full moon’s fifteenth night,\nThey circulate northern kidney water to meet southern heart fire,\nSo that inner and outer water and fire harmonize,\nCoagulating yin powder,\nFlowing in accord with heaven and earth’s creative power\nTo nurture the sacred embryo.\n\nThe spirit turtle drinks from the azure jade’s chill.\nThe spirit turtle—\nThe turtle within kidney water.\nThe sea turtle, unknown to others—\nThis is gathering the moon’s essence and splendor\nInto the palace of spirit water,\nWhere the spirit turtle drinks the yin powder.\n\nBorn within the northern sea,\nHow could the form and po remain?\n\nAt noon, no shadow remains.\nYang sand glows crimson; yin powder bears a faint azure hue.\nThe essence of the sun coalesces—this is yang’s radiance;\nThe essence of the moon coalesces—this is yin’s splendor.\nIts crimson hue mirrors the sun;\nIts pale tint mirrors the moon.\nPowder refines the flesh; sand transforms the bones.\nThe mortal embryo is wholly exchanged for the sacred embryo’s numinosity.\nThe hun merges with spirit; the po merges with qi.\nIn purity, they become one—\nForm and spirit both wondrous,\nIn perfect unity with the Dao.\n\nThey ascend like shooting stars.\nFor those who cultivate the Dao,\nIf they preserve their spirit but fail to transform their form,\nThe body becomes a burden:\nWhen the spirit departs, the body remains unmoved;\nWhen the corpse dissolves, the form does not depart.\nAfter six revolutions of the elixir,\nThe mortal form is entirely transmuted into immortal substance—\nForm and spirit both wondrous.\nWhere the spirit directs, the form follows,\nRising through the nine heavens,\nSwift as a star.\n\n**Oral Instructions:**\nWhen the elixir completes six revolutions,\nGather the moon’s radiance.\nOn every full moon’s fifteenth night,\nAt midnight’s zi hour,\nBathe and rinse, then sit facing the moon.\nClose your eyes, cross your legs,\nRegulate your breath through the nose,\nAnd seal your mouth,\nCutting off the flow of breath through mouth and nose,\nSo that true qi does not leak outward.\nWithin, true qi fills the six viscera.\nThe true yin of the kidneys and the essence of the great yin\nAre inwardly and outwardly absorbed,\nAnd yin qi circulates freely.\nYou will feel your entire body gleam like crystal,\nLimpid and luminous.\nAfter a moment or two,\nThe true water of the kidneys stirs the fire of the heart.\nA thread of fiery qi from the heart’s spirit\nDescends into the cinnabar field,\nLike a wheel of flame resting in a lapis lazuli dish.\nThen gently open your eyes, release your breath,\nAnd through your nose, facing the moon,\nDraw in the moon’s qi,\nAbsorbing sixty-four breaths before stopping.\nAfter half the breaths are taken,\nThe moon’s true yin excites the true fire in the cinnabar field.\nWater and fire intermingle,\nLike boiling water—\nThe four limbs sweat,\nThe hundred vessels relax and flow,\nUntil the sixty-fourth breath is complete.\nPractice this for two years,\nAnd the work will be accomplished,\nPreparing you to enter the seventh revolution.\n\n**Song of the Seventh Revolution:**\nAt seven revolutions, the body soars, weightless—\nThe immortal form, light and pure,\nNaturally ascends.\nThe numinous light, breath sealed, fills the elixir’s city.\nThe inner elixir refines form and spirit,\nSo the entire body becomes the city that houses the elixir.\nWhen the elixir reaches seven revolutions,\nInner and outer yin and yang harmonize.\nOne must seal the breath for a thousand mornings\nTo fulfill the wondrous Dao’s work.\nAfter a thousand mornings of fasting, the spirit fire is born.\nWhen the elixir completes seven revolutions,\nAnd the breath is sealed for a thousand days,\nYin and yang achieve great harmony.\nWhen the thousand days are fulfilled,\nSpirit and qi unite,\nThe five viscera are renewed,\nAnd inner and outer become pure and one.\nThe moon’s light shines through the six viscera;\nTrue fire illuminates the five organs.\nThe worms in the viscera and stomach\nAre transformed into water.\nFrom this point, the intestines and stomach are full,\nNo longer taking in the food of smoke and fire.\nHunger is sated with immortal fruits;\nThirst is quenched with jade nectar.\nThe kun gate opens wide to bathe the sea whale.\nAfter the inner elixir is wholly transformed,\nThe yin form dissolves entirely,\nLeaving but one aperture—\nCalled the kun gate,\nSymbolizing yin.\nWhenever the divine elixir’s fire grows strong,\nOn the days of the three nines,\nEnter the water,\nCirculate the elixir pearl,\nAnd let it emerge from the kun gate.\nBreathe, play in the water,\nAnd frolic freely.\nAfter an hour or two,\nReturn the elixir to its chamber,\nNestling it in the elixir cave\nTo regulate the fire’s intensity.\n\n**Looking Over the River South:**\nThe form penetrates the sun—\nAt seven revolutions, it soars at will.\nAfter seven revolutions,\nForm and spirit are both wondrous,\nInner organs and outer form\nAll become vessels of immortality.\nRoaming at noon,\nForm and shadow are luminous,\nThe hue like red jade.\nAscending and soaring through the void,\nMoving freely as they please.\nSecluded in deep cliffs, they sit in meditation,\nBreath without coming or going—\nSpirit congeals.\nThe work of the seventh revolution\nLies in harmonizing inner and outer,\nSo the radiance of the sun and moon without\nMerges with the water and fire of heart and kidneys.\nYin and yang circulate,\nSpirit and qi unite.\nSecluded in mountain valleys,\nThey sit in meditation for a hundred days,\nSealing the breath through the nose\nTo cut off the flow of respiration.\nSpirit and qi surge in harmony,\nCongealing in great stillness.\nThe five viscera are inwardly full,\nNo longer consuming the world’s dust.\nThey realize the Dao of carefree wandering.\nFasting yields wonders,\nAble to generate spirit fire,\nReturning to the origin—qi pure and clear.\nWhen the nine signs appear, bathe and open the earth gate.\nWhenever the spirit fire grows excessive,\nAnd the five viscera burn hot,\nOn the days of the nine,\nEnter the water to bathe the true elixir.\nIt shines like a wheel of fire,\nEmerging from the earth gate—\nThus the earth gate opens.\nDrawing fire from the moon, seeking ice from the sun.\nThe moon symbolizes yin;\nSpirit fire is the utmost yang.\nThe earth gate is yin’s aperture.\nGuiding the yang light,\nIt emerges from the yin cavity of the earth gate—\nThus drawing fire from the moon.\nThe sun symbolizes yang;\nSpirit water is the utmost yin.\nThe tongue’s aperture is yang’s cavity,\nThrough which spirit water flows,\nEmerging from the yang cavity of the tongue—\nThus seeking ice from the sun.\nThe five organs are renewed.\nAt five revolutions, the bones are transformed;\nAt six, the flesh;\nAt seven, the five viscera.\nThe five organs are the five viscera—\nThus the five organs are renewed.\n\n**Oral Instructions:**\nWhen the elixir reaches seven revolutions,\nOne must leave the dusty world behind,\nEntering deep mountains,\nSitting in meditation within cliffs.\nSeal the breath, congeal the spirit,\nCutting off the flow of breath through mouth and nose,\nSo that true yin and true yang merge within the abdomen,\nSeizing the creative power of heaven and earth,\nReturning it to the four limbs.\nAfter a thousand days,\nThe five viscera are wholly transformed,\nAnd the fetal qi becomes immortal organs.\nYou will feel the aperture at the crown open,\nReleasing red and black qi—\nThis is the dispersal of fetal qi.\nWhen the thousand days are fulfilled,\nThe crown’s aperture closes—\nThe fetal qi is exhausted,\nAnd the work of the seventh revolution is complete.\n\nAfter this, the five viscera become solid and no longer accept food cooked over fire and smoke. Should the elixir-fire within the viscera flare up at times, causing fire to issue from the nostrils, one must enter water and seal the breath through the nose. Then the cinnabar pearl and spirit-fire will emerge from the yin gate, floating upon the water’s surface like a cow playing in yellow mire. Only when the divine water beneath the tongue flows like a spring will the elixir-fire naturally subside. Inhale the cinnabar pearl back into the Gate of Earth, and proceed until the eighth revolution, when the Earth Belt is accomplished. With no more fire-toxin, there will be no further need for bathing.\n\n**Song of the Eighth Revolution:**\nThe eighth revolution returns to the hanging Earth Belt,\nAs the infant lies within the mother’s womb, enveloped in the placenta.\nThe settled qi cannot escape and suffers no loss—\nFor the infant’s navel holds an umbilical cord that connects to its mouth,\nAllowing the breath to flow ceaselessly in and out.\nThis is the natural fetal breathing, hence no harm comes to it.\n\nOnce the heart-elixir completes the eighth revolution,\nAn umbilical cord grows again within the navel,\nJust like that of an infant,\nRestoring the original Way of beginnings.\nThus it is called *returning to the hanging Earth Belt.*\n\nCirculating fetal breathing to nourish the infant,\nThe Perfected attains the Earth Belt and moves the qi of the celestial cycle,\nThus achieving longevity.\n\nAt times, fire arises to scorch the elixir-cave—\nPlunge deep into the cool spring to play with the red turtle.\nThe red radiance is the cinnabar pearl.\nAfter the eighth revolution, the inner refinement of true fire\nEliminates the affliction of heat-toxin.\nWhenever fire flares, one must hold the Earth Belt in the mouth,\nSeal the breath for nine days,\nAnd on the ninth day, true water will surge from the cinnabar field\nLike a gushing spring, rising to the Twelve-Storied Tower.\nThe cinnabar pearl will float within this divine water,\nLike a turtle sporting in the waves.\n\nFrom this point onward, true fire holds no toxin,\nAnd the affliction of elixir-heat vanishes.\nThus it is said: *plunge deep into the cool spring to play with the red turtle.*\n\n**Looking Over the River South:**\nWithin and without, all is pervaded—\nOnly at the eighth revolution does one return to the origin.\n\nWhen the elixir reaches the eighth revolution, the external form and the internal five viscera are entirely transformed. The Earth Belt regenerates, resembling the state of an infant—thus it is called *returning to the origin and restoring the primordial*.\n\nThe Earth Belt hangs long, giving birth to the Kan Gate;\nCoursing through the womb-breath, it penetrates the Celestial Gate.\nThe Earth Belt is the umbilical cord, born within the navel and belonging to the northern Kan trigram—hence it is called *giving birth to the Kan Gate*. The Celestial Gate is the aperture of the Flowery Pond; the Earth Belt connects to the mouth, circulating the breath of the celestial cycle to regulate the fire’s timing—thus it is called *coursing through the womb-breath*.\n\nThe Dao of the Great Beginning now abides.\nThe Dao of the Great Beginning is the origin of heaven and earth; when the elixir completes its eighth revolution, it is the inception of heaven and earth’s creation.\n\nA single, pure body—\nWithin and without, it is wholly yang, without a trace of yin qi—hence it is called *a single, pure body*.\n\nBlack and red qi constantly sprays forth—\nBlack and red are the qi of spirit-fire; when the elixir completes its eighth revolution, the breath’s coming and going issues from the nose, ever manifesting as black and red qi—thus it is said *qi constantly sprays forth*.\n\nWhen the elixir-fire flares to scorch the inner realm,\nPlunge deep into the cool spring to bathe the macaque.\nThe affliction of elixir-fire is governed by the movement of spirit-water; thus, no sign of elixir-fire remains. The elixir is the heart-pearl, and the heart resembles a monkey; bathing the elixir in spirit-water, the divine elixir floats and sinks within it—hence it is called *bathing the macaque*.\n\nThe spirit-water swallows the red turtle—\nThe elixir floats within the spirit-water, like a turtle swallowing water, describing its form.\n\n**Oral Instructions:**\nWhen the elixir completes its eighth revolution, the Earth Belt is born within the navel. If elixir-fire flares within and the five viscera grow parched and hot, immediately close the eyes and sit in repose, connecting the Earth Belt beneath the Flowery Pond to allow the breath to circulate internally, practicing the method of the celestial cycle.\n\nAfter closing the breath, the true water of the cinnabar field gradually waxes like the sun and moon. By the ninth day, the spirit-water rises to the Twelve-Storied Tower, and the cinnabar pearl is immersed within it, purging all fire-toxin. Thereafter, no sign of parched heat remains. On the ninth night at the hour of zi, close the breath and draw the spirit-water into the Muddy Pellet, passing through the Spine Bridge, then returning to the cinnabar field to complete the work.\n\nThe power of creation returns to the four limbs. After a thousand days, the five viscera are entirely transformed, and the fetal qi becomes the immortal viscera. One merely senses the aperture at the crown opening, emitting black and red qi—this is the dispersal of fetal qi. When the thousand days are fulfilled, the crown’s aperture closes, the fetal qi is exhausted, and the seventh revolution’s work is complete.\n\nFrom this point onward, the five viscera are firm and solid, no longer receiving grain or fire-cooked food. If at times elixir-fire flares within the five viscera and fire issues from the nostrils, enter water and seal the nasal breath. Then the cinnabar pearl and spirit-fire will emerge from the yin gate, floating upon the water’s surface like an ox playing in the yellow. Wait until the spirit-water beneath the tongue flows like a spring, whereupon the elixir-fire will naturally subside. Draw the cinnabar pearl back into the Kun Gate, and by the eighth revolution, the Earth Belt is perfected. With no fire-toxin remaining, bathing is no longer required.\n\n**Song of the Eighth Revolution:**\nAt the eighth revolution, the Earth Belt hangs down to return to the origin,\nLike an infant within the mother’s womb, enveloped in the fetal sac.\nThe stabilized qi cannot escape and suffers no loss—\nFor the infant’s navel holds the umbilical cord in its mouth,\nThe breath’s coming and going unceasing, this is natural womb-breath, hence no loss.\nWhen the heart-elixir completes its eighth revolution,\nA navel cord regenerates within the navel, resembling the infant’s form,\nRestoring the Dao of the primordial origin—thus it is called *returning to the origin, the Earth Belt hangs down*.\n\nCoursing through the womb-breath to nurture the infant—\nThe perfected one obtains the Earth Belt and circulates the qi of the celestial cycle, thus attaining longevity.\nWhenever fire flares to scorch the elixir-cavern,\nPlunge deep into the cool spring to play with the red turtle.\nThe red radiance is the cinnabar pearl; after the eighth revolution,\nThe inner refinement of true fire eliminates the affliction of heat-toxin.\nWhenever fire flares, hold the Earth Belt in the mouth,\nSeal the breath for nine days, and on the ninth day,\nTrue water will surge from the cinnabar field like a gushing spring,\nRising to the Twelve-Storied Tower, the cinnabar pearl within the spirit-water,\nLike a turtle sporting in the waves.\nFrom this point onward, true fire holds no toxin,\nAnd the affliction of elixir-heat vanishes—\nThus it is said: *plunge deep into the cool spring to play with the red turtle.*\n\n**Looking Over the River South:**\nWithin and without, all is pervaded—\nOnly at the eighth revolution does one return to the origin.\n\nWhen the elixir reaches the eighth revolution, the outer form and the inner five viscera are entirely transformed. The Earth Belt regenerates, resembling the state of an infant—thus it is called *returning to the root and restoring the origin*.\n\nThe Earth Belt hangs long, giving life to the Kan Gate;\nCircling in fetal breathing, it pierces the Heavenly Gate.\nThe Earth Belt is the navel’s cord, born within the navel and belonging to the northern Kan trigram—hence it is called *giving life to the Kan Gate*. The Heavenly Gate is the aperture of the Flowery Pond; the Earth Belt connects to the mouth, circulating the breath of the celestial cycle to regulate the fire’s timing—thus it is called *circling in fetal breathing*.\n\nThe Dao of the Great Beginning now abides.\nThe Dao of the Great Beginning is the origin of heaven and earth; when the elixir completes its eighth revolution, it is the first moment of heaven and earth’s creation.\n\nA single unified body—\nWithin and without, it is purely yang, without a trace of yin qi—hence it is called *a single unified body*.\n\nBlack and red qi constantly sprays forth.\nBlack and red are the qi of spirit-fire; when the elixir completes its eighth revolution, the breath’s coming and going issues from the nose, and one constantly sees black and red qi—thus it is called *qi constantly sprays forth*.\n\nWhen elixir-fire flares to scorch the inner realm,\nPlunge deep into the cool spring to bathe the gibbon.\nThe affliction of elixir-fire is controlled by mobilizing spirit-water, leaving no sign of elixir-fire. The elixir is the heart’s pearl, and the heart resembles a gibbon—bathing the elixir in spirit-water, the divine elixir floats and sinks within the spirit-water—hence it is called *bathe the gibbon*.\n\nThe spirit-water and red turtle swallow.\nThe elixir floats within the spirit-water like a turtle swallowing water—this describes its form.\n\n**Oral Instructions:**\nWhen the elixir completes its eighth revolution, the Earth Belt arises within the navel. If elixir-fire flares internally and the five viscera grow parched and hot, immediately close the eyes and sit in repose, connecting the Earth Belt beneath the Flowery Pond to allow the breath to circulate within, practicing the method of celestial circulation.\n\nAfter closing the breath, the true water of the cinnabar field gradually waxes like the sun and moon. By the ninth day, the spirit-water rises to the Twelve-Storied Tower, and the cinnabar pearl is immersed within the spirit-water, purging all fire-toxin. From this point onward, there is no further sign of parching heat. On the ninth night at the hour of *zi*, close the breath and draw the spirit-water into the Mud Pill Palace, passing through the Spine’s Bridge to return to the cinnabar field, thus completing the work.\n\n**Song of the Nine Revolutions:**\nThe nine revolutions bring carefree attainment of the Dao’s fruit...\n\nNo further practice is required. With three thousand merits and deeds, one becomes a true immortal. When the nine revolutions of the elixir are complete, the three thousand deeds accumulate externally as the elixir achieves full perfection—only then may one ascend. Thus, Xu Jingsun subdued the flood dragons and thereby ascended, and Sun Simiao healed myriad illnesses before he could take flight; both first completed three thousand merits before ascending.\n\nThe Golden Elixir and Jade Tablet proclaim the imperial decree. After three thousand merits are fulfilled, the Jade Emperor bestows a decree, presenting the Golden Elixir to dispel worldly defilements. Once the Golden Elixir enters the abdomen, the Earth Belt falls away of itself, and one ascends to pay homage to the Jade Emperor, their name recorded in the immortal register.\n\nThe crane-drawn cloud chariot departs for the grotto-heavens.\n\n**To the Tune of \"Gazing at the Southern River\"**\nThe elixir completes its nine revolutions,\nPure and unified in the primordial countenance.\nWhen the elixir achieves its nine revolutions, it shares the age of heaven and earth;\npure and unified in the primordial, it is the origin of the Great Dao.\nAfter the elixir is complete, form merges with the Dao,\nand one’s countenance becomes that of the primordial.\nInternally and externally, non-action ever embraces simplicity,\nroaming freely beyond the seas and among men,\nwhile merits and deeds accumulate like mountains.\nThe azure palace’s decree,\nthe Jade Tablet and golden ring bestowed,\nserve as tokens to pay homage to the Heavenly Emperor.\n\nHaving consumed the *daogui*, one rides the feathered chariot—\nthe *daogui* is the Golden Elixir ingested.\nOnce the Golden Elixir enters the abdomen, the Earth Belt falls away,\nclouds arise beneath the feet, and one rides upon feathers as a steed to approach the celestial gates.\nBanners and pennants, flutes and drums pass through the heavenly barriers,\nto join the ranks of immortals in audience before the Emperor.\nHeavenly music welcomes, the *xiaoshao* harmonizes in concert.\n**Here ends the Inner Elixir Formula.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "陈先生内丹诀 经名：陈先生内丹诀。 北宋陈朴撰。 一卷。 底本出处：《正统道藏》 太平部。 陈先生内丹诀序 先生名朴，字冲用，唐末五代初人也。 五代离乱，避世入蜀，隐居青城大面山，受道於锺离先生，与吕洞宾同师也。 先生才质奇伟，德行高妙，积年累功，今不知其几百岁。 或出世间，为性不常，以歌酒为乐。 元丰戊午年间游南都，宋城张方平官保，以其年高，传接气之术，延寿一纪。 盘桓南都，不啻半载。 携一无底土罐，游於市，人少有识之者，淮南野叟敬信尊崇，或师事之。 先生怜其至诚，授以内丹诀，因以记之。 先生内丹之诀，直指玄关，九转成道。 每一转先述短歌，又托意於《望江南》欲后来学方外之道者，易晓也。 陈朴冲用撰 一转歌",
      "translated_text": "**Chen Master’s Inner Elixir Formula**\n\n**Scripture Title:** *Chen Master’s Inner Elixir Formula*\nAuthor: Chen Pu of the Northern Song Dynasty\nOne fascicle.\nSource of the base text: *Daoist Canon of the Orthodox Tradition*, Taiping Section.\n\n**Preface to Chen Master’s Inner Elixir Formula**\n\nThe Master’s name was Pu, styled Chongyong. He lived during the late Tang and early Five Dynasties period. Amid the chaos of the Five Dynasties, he withdrew from the world and entered Shu, concealing himself in Mount Dafeng of Qingcheng. There, he received the Dao from Master Zhongli and shared the same teacher as Lü Dongbin.\n\nThe Master possessed extraordinary talent and lofty virtue, accumulating years of practice—now unknown to be how many centuries old. At times, he appeared in the world, though his nature was unpredictable, delighting in song and wine.\n\nDuring the *Wuwu* year of the Yuanfeng era (1078), he traveled to the Southern Capital. Zhang Fangping, the Duke of Songcheng, honored his advanced age and transmitted to him the art of *qi*-absorption, extending his lifespan by a twelve-year cycle. The Master lingered in the Southern Capital for no less than half a year. He carried an earthen jar without a bottom, wandering through the markets, few recognizing him. An old rustic from Huainan, however, revered and believed in him, even becoming his disciple.\n\nMoved by the man’s utmost sincerity, the Master bestowed upon him the *Inner Elixir Formula*, which was then recorded.\n\nThe Master’s *Inner Elixir Formula* directly points to the Mysterious Pass, achieving the Dao through nine transformations. Each transformation begins with a brief song, followed by verses set to the tune of *Wang Jiangnan*, so that later learners of the Dao beyond the world may readily understand.\n\nComposed by Chen Pu, styled Chongyong.\n\n**First Transformation Song**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 306,
      "start_sentence": 0,
      "end_sentence": 17,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.415965557098389,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "一转之功似宝珠， 天一真水，藏之於胆，阴阳和合，降而为丹，状如露珠一颗。 山河宇宙透灵躯， 人因父精母血，交媾而生身形交也； 丹因心火肾水交媾而丹降，气交也。 丹降之时，神游方外，阴阳太和，至忘其形。 天地山可，六合万物，在我身之内，我身在天地之外，只觉此中一点光明，如日，乃丹降也。 红莲叶下藏丹穴， 舌下两窍，左通心，右通胆，真气流注，以通神明。 故人身不安，则舌下液乾，以其真气耗也。 一转之首，以舌闭其两窍，使真气不泄於外，以通其神水也。 赤水通流九候殊。 赤水液也九转之首，每遇九日，细息九次，每次八口九口，自然津液通流，自舌而生，以灌下藏，乃九侯也。 望江南 中黄宝须向胆中求，",
      "translated_text": "**First Transformation Song**\n\nThe work of the first transformation resembles a precious pearl—\nHeaven’s true water, One,\nconcealed within the gallbladder.\nYin and yang harmonize,\ndescending as the elixir,\nshaped like a single dewdrop.\n\nMountains, rivers, and the cosmos pierce the numinous body.\nMan arises from the father’s essence and mother’s blood,\ntheir union forming the physical frame;\nthe elixir descends when heart-fire and kidney-water unite,\ntheir qi intermingling.\nAs the elixir descends,\nthe spirit roams beyond the mundane,\nyin and yang in perfect harmony,\nso profound as to forget the form.\nHeaven and earth, the four directions, the ten thousand things—\nall lie within this body,\nwhile this body dwells beyond heaven and earth.\nOnly this single point of radiance is perceived,\nbright as the sun—\nthis is the elixir’s descent.\n\nBeneath the red lotus leaf lies the elixir cave—\nbeneath the tongue, two apertures:\nthe left connects to the heart,\nthe right to the gallbladder.\nTrue qi flows through them,\ncommuning with the numinous.\nThus, when the body is unwell,\nthe fluid beneath the tongue dries,\nfor true qi is depleted.\nAt the first transformation’s outset,\nseal the two apertures with the tongue,\npreventing true qi from leaking outward,\nso the numinous water may flow.\nCrimson water courses through nine distinct signs.\nThe crimson water—fluid of the nine transformations’ beginning—\neach ninth day, take nine subtle breaths,\neach breath eight or nine times.\nNaturally, the fluid will flow,\narising from the tongue\nto irrigate the lower storehouse—\nthese are the nine signs.\n\n*To the tune of* **Wang Jiangnan**\nThe Central Yellow Treasure must be sought within the gallbladder...",
      "overlap_context": "isciple.\n\nMoved by the man’s utmost sincerity, the Master bestowed upon him the *Inner Elixir Formula*, which was then recorded.\n\nThe Master’s *Inner Elixir Formula* directly points to the Mysterious Pass, achieving the Dao through nine transformations. Each transformation begins with a brief song, followed by verses set to the tune of *Wang Jiangnan*, so that later learners of the Dao beyond the world may readily understand.\n\nComposed by Chen Pu, styled Chongyong.\n\n**First Transformation Song**",
      "start_char": 306,
      "end_char": 617,
      "start_sentence": 18,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.958190202713013,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天一生气，名曰中黄，其气藏於胆，以为性命之根元。 其味苦，至如无知花木根蒂之味亦苦，乃知万物非生气不能生也。 内丹之药，先闭舌下两窍，内通胆中生气，至喉舌之间，有微微苦味，是生气通流，然后求神为丹也。 春帝令行生万物， 万物得春气方生，人能通胆之气，然后内丹成就。 乾坤膝下与吾俦，百脉自通流。 生气上行，口中觉苦，阳阴大和，神居天外。 则天地四海，如在吾膝下，浩气塞乎天地，百脉流通，万窍开张，内丹降也。 施造化，左右火双抽， 下手之初，先闭舌下两窍，不令气泄於外。 左右两窍之气，自内而上行，左贡左太阳，而入脑右； 右俱过脑，至顶心泥丸宫，合成一处。 下重楼十二环，入心经，传入胆，冲开胆窍，使胆中生气上行，随心胆之脉，贯於舌窍，使舌觉有苦味，乃是生气流注，欲降丹也。 浩气腾腾充宇宙，苦烟袅袅上环楼， 胆窍既开，则生气袅袅，上重楼十二环，入於舌窍之下，满口觉苦，乃是生气流通之验也。 夫妇渐相谋。 生气通流则阴阳大和，心肾交媾，故曰渐相谋也。 口诀 行持下手之初，先须以饮食养和五藏，不可失饥过饱，心田安静，无忧无愁，乃可入道也。 凡於二更尽，三更初，先须洗漱，於静室烧香，盘膝坐，闭目存神。 候息出入匀调，以舌倒卷，塞定舌根两窍，闭息，渐次觉左右太阳经，有两道气从大牙根下，贯太阳，入顶门，至泥丸宫，即为一次。 却开眼，良久再一闭目存神，依前卷舌，候气至泥丸宫，即止。 如此每夜行三次，行数夜，或旬日，或半月，渐觉气到泥丸宫，后流入脑，下重楼十二环，过夹脊，串尾闾到上，入心贯胆，觉胸中温温，微觉意思和畅，乃是真气降也。 如此又行数夜后，渐觉气到心，后微觉温温，或心头气微动，却有温气。 后心而上过重楼，入舌下，渐觉口中微苦，乃是中黄之气，自胆而出，阴阳大和，将有降丹之象也。 如此之后，每夜行持之初，令一人在门外，以绝入来之人及猫狗等，恐忽然相惊故也。 至每夜行三次时，须於坐前横一几，忽行气间，觉身体渐大，精神腾腾，渐见住宅与诸城市天地，皆在身内。 一身上觉充天，下觉塞地，手足皆不知所在，乃急以手按几闭目，只觉心头一块光明，团团如日，忽然坠落，乃是丹降也。 丹降之后，不可便开眼，渐渐收拾精神，却归四体。 手足却复旧，或觉手足微麻，定省多时，然后开眼，吃人参汤，乃睡。 至来日吃粥食，将息一二日，乃丹降毕功也。 丹降之后，百病消除，更无疾厄之苦也。 二转歌 二转阳成始积阴， 二转之初，如人怀胎两月，丹之初降，乃是真之精成而为丹。 丹降之后，二转逢九则须养阳，三转遇六则养阴，以成抱养功也。 心光肾液丁壬， 心属火，火属阴，以配南方丁火，丁者火之阴也。 肾属水，水属阳，以配北方壬水，壬者水之阳也。 二转则养阳，使心之光感於下，三转则养阴，使肾之液交於上。 真水真火，上下交合，以配丁壬，而抱养真丹，以成造化之功也。 神珠奔电归北海， 丹之初降，养於心络，育之以真火，生其丹也。 一转功成，则真丹忽然从心络流下，藏於丹田，育之以真水，此为二转之功也。 时进灵光照紫琛。 丹藏丹田之后，丹气渐成，忽於虚静室中，时有神光从眼而出，忽见如真金之团，乃丹光也。",
      "translated_text": "The Heavenly One generates qi, called the Central Yellow. This qi is stored in the gallbladder, serving as the root and origin of life and nature. Its flavor is bitter—just as the roots and stems of flowers and trees, though seemingly devoid of sensation, also bear a bitter taste—thus we know that without the generative qi, the myriad things cannot come to life. The medicine of the internal elixir must first seal the two apertures beneath the tongue, inwardly connecting to the generative qi within the gallbladder. When it reaches the space between the throat and tongue, a faint bitterness arises—this is the generative qi flowing freely. Only then may one seek the numinous to form the elixir.\n\nThe Spring Emperor’s decree stirs all things to life; only when the myriad things receive the qi of spring do they flourish. If one can circulate the qi of the gallbladder, the internal elixir will be accomplished. Heaven and Earth lie beneath our knees, and the hundred vessels flow freely. As the generative qi ascends, the mouth perceives bitterness; yang and yin harmonize greatly, and the spirit dwells beyond the heavens. Then the four seas and all under heaven seem as if beneath our knees, the vast qi fills heaven and earth, the hundred vessels course unimpeded, and the myriad apertures open wide—this is the descent of the internal elixir.\n\nTo enact transformation, draw the dual fires from left and right. At the outset of practice, first seal the two apertures beneath the tongue to prevent qi from leaking outward. The qi from the left and right apertures ascends inwardly: the left contributes to the left Greater Yang, entering the right side of the brain; the right passes through the brain to the crown, reaching the Mud Pill Palace, where they merge into one. Descending the twelve-storied tower of the throat, they enter the heart meridian, then pass into the gallbladder, surging open its aperture. The generative qi within the gallbladder ascends, following the heart and gallbladder meridians to penetrate the tongue’s apertures, causing the tongue to taste bitterness—this is the generative qi flowing freely, heralding the descent of the elixir.\n\nThe vast qi soars, filling the cosmos; the bitter mist wafts upward through the twelve-storied tower. Once the gallbladder’s aperture opens, the generative qi rises gently, ascending the twelve-storied tower to enter beneath the tongue, filling the mouth with bitterness—this is the sign of the generative qi flowing freely. Husband and wife gradually conspire together. When the generative qi flows freely, yin and yang harmonize greatly, and heart and kidney unite—thus they gradually conspire.\n\n**Oral Instructions:**\nAt the outset of practice, one must first regulate the five viscera with diet, avoiding hunger or overindulgence. The mind-field must be tranquil, free from worry or sorrow—only then may one enter the Dao. Always at the end of the second watch, the beginning of the third, first wash and rinse, then burn incense in a quiet chamber. Sit cross-legged, close the eyes, and gather the spirit. Wait until the breath is even, then curl the tongue upward to seal the two apertures at its root. Hold the breath, and gradually perceive two channels of qi from the base of the molars, passing through the Greater Yang meridians to the crown, reaching the Mud Pill Palace—this counts as one cycle. Then open the eyes briefly, close them again to gather the spirit, and repeat the tongue-curling. When the qi reaches the Mud Pill Palace, stop. Perform this three times each night. After several nights, or ten days, or half a month, gradually feel the qi reach the Mud Pill Palace, then flow into the brain, descending the twelve-storied tower, passing the spine’s junction, threading the tailbone to ascend, entering the heart and penetrating the gallbladder. A gentle warmth arises in the chest, and the mind feels harmonious and at ease—this is the descent of true qi.\n\nAfter practicing thus for several more nights, gradually feel the qi reach the heart, then a subtle warmth, or a slight stirring of qi at the heart’s center, followed by a warm current. It ascends from the heart, passing the twelve-storied tower to enter beneath the tongue, and the mouth gradually tastes bitterness—this is the Central Yellow’s qi emerging from the gallbladder. Yin and yang harmonize greatly, signaling the imminent descent of the elixir. Thereafter, at the start of each night’s practice, have someone stand outside the door to prevent people, cats, dogs, or other disturbances, lest they suddenly startle you.\n\nWhen performing the three cycles each night, place a small table before you. If, during the circulation of qi, you feel the body gradually expand and the spirit soar, you may perceive your dwelling, the city, and all under heaven as if contained within your body. The body above feels as vast as heaven, below as boundless as earth; hands and feet seem to vanish. Quickly press your hands on the table, close your eyes, and perceive only a luminous orb at the heart’s center, round as the sun. Suddenly it falls—this is the descent of the elixir.\n\nAfter the elixir descends, do not open your eyes immediately. Gradually gather the spirit and return it to the four limbs. Hands and feet resume their usual state, though they may feel slightly numb. Remain composed for some time, then open your eyes and drink ginseng broth before sleeping. The next day, eat congee and rest for one or two days—this completes the descent of the elixir. Once the elixir has descended, the hundred diseases vanish, and no suffering from illness or misfortune remains.\n\n**Song of the Second Transformation:**\nAt the second transformation, yang is completed and yin begins to accumulate. At the outset of the second transformation, it is like a woman two months pregnant—the elixir’s initial descent forms from the essence of the true. After the elixir descends, when the second transformation meets the ninth day, one must nurture yang; when the third transformation meets the sixth day, nurture yin—this is the work of embracing and nourishing.\n\nThe heart’s light and the kidney’s fluid correspond to ding and ren. The heart belongs to fire, which is yin, matching the southern ding fire—ding is the yin of fire. The kidney belongs to water, which is yang, matching the northern ren water—ren is the yang of water. At the second transformation, nurture yang, so the heart’s light stirs below; at the third transformation, nurture yin, so the kidney’s fluid rises above. True water and true fire unite above and below, corresponding to ding and ren, embracing and nourishing the true elixir to accomplish the work of transformation.\n\nThe divine pearl dashes like lightning to the Northern Sea. When the elixir first descends, it is nurtured within the heart’s network, cultivated by true fire to quicken the elixir. Once the first transformation is complete, the true elixir suddenly flows down from the heart’s network, stored in the cinnabar field, and nurtured by true water—this is the work of the second transformation.\n\nFrom time to time, the numinous light illumines the purple depths. After the elixir is stored in the cinnabar field, its qi gradually matures. Suddenly, in a quiet chamber, a divine light shines from the eyes, appearing like a golden orb—this is the elixir’s light.",
      "overlap_context": "with the tongue,\npreventing true qi from leaking outward,\nso the numinous water may flow.\nCrimson water courses through nine distinct signs.\nThe crimson water—fluid of the nine transformations’ beginning—\neach ninth day, take nine subtle breaths,\neach breath eight or nine times.\nNaturally, the fluid will flow,\narising from the tongue\nto irrigate the lower storehouse—\nthese are the nine signs.\n\n*To the tune of* **Wang Jiangnan**\nThe Central Yellow Treasure must be sought within the gallbladder...",
      "start_char": 617,
      "end_char": 1920,
      "start_sentence": 33,
      "end_sentence": 78,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.499852418899536,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "望江南 玄珠降丹，窟在中宫， 玄珠真丹也，一转之初，藏於心络，故曰中宫。 九候息调重九数， 丹降之后凡遇九日则闭息，九候为一次，至九九八十一息，为九次，故日重九数。 赤波忽迸太阳东， 九九功成，真丹阳足，忽自心下流入丹田，藏於水府，以养其阴，太阳东海也。 心肾始交通。 初降藏之心，以养真火，二转归之肾宫，以养真水，故阴阳大和，而交通也。 逢六变重，六息阴功， 逢六则闭息六数为一次，至六六三十六息，为一周，以养阴。 火自海门朝帝座， 海门是丹田肾府也，真丹存於丹田内，阳之数已足，每遇日午，则神火自丹田，热气朝於上，达於心。 帝座，心也。 水从莲沼佐丁公， 莲沼，舌也，六六曰阴，数足则舌下华池神水，下浇心络，以养丹气。 丁者，心之火也。 紫电透玲珑。 真丹气足，时有神光出於面目。 半夜宴坐，内观五藏六府，表裹分明，直见玄珠养於丹田。 口诀 丹绛之后，一转了毕，凡遇初九、十九、二十九，三九之日，日正午时，於静室中，闭门端坐，盘膝闭月，叩齿九遍，神定气和，然后闭息。 每一闭八九息，为一次，即开眼。 良久，再闭息如前，八九息为一次。 初闭时，闭一次两次，行之渐熟，闭四五次，又极熟，闭之．九次。 一向行之，直候内之火候周足，与天地相应，不以远近。 忽然入息，至九次，心中温热，四体和畅，心神摇动。 一道热气流下入丹田，此是内丹入丹田，乃为二转功成。 自此而后，不行九息之数也。 三转歌 三转行阳入左宫，",
      "translated_text": "\"Gazing at the River South\"\nThe mysterious pearl descends as elixir, its cavern in the Central Palace—\nThe mysterious pearl is the true elixir; at the first transformation’s beginning, it is stored in the heart’s network, hence called the Central Palace.\n\nThe nine pulses harmonize with the repeated ninefold count—\nAfter the elixir descends, whenever nine days pass, one closes the breath. Nine pulses form one cycle, and nine cycles of nine—eighty-one breaths—complete the repeated ninefold count.\n\nCrimson waves suddenly surge to the east of the Great Yang—\nWhen the nine-by-nine work is complete, the true elixir’s yang is full. Suddenly, it flows down from the heart into the cinnabar field, stored in the Water Mansion to nourish its yin—this is the eastern sea of Great Yang.\n\nHeart and kidneys first interflow—\nInitially, the elixir descends and is stored in the heart to nurture true fire; at the second transformation, it returns to the Kidney Palace to nurture true water. Thus, yin and yang achieve great harmony and interflow.\n\nEncountering six brings repeated sixfold yin work—\nWhen six arrives, one closes the breath in sixfold counts for one cycle, and six cycles of six—thirty-six breaths—form one round to nourish yin.\n\nFire from the Sea Gate ascends to the Emperor’s Throne—\nThe Sea Gate is the cinnabar field, the Kidney Mansion. When the true elixir is stored within the cinnabar field and the yang count is full, at every noon, the spirit-fire from the cinnabar field rises as hot qi to reach the heart above.\nThe Emperor’s Throne is the heart.\n\nWater from the Lotus Pond aids Lord Ding—\nThe Lotus Pond is the tongue. When the six-by-six yin count is complete, the divine water of the Flower Pool beneath the tongue flows down to irrigate the heart’s network, nourishing the elixir’s qi.\nDing is the fire of the heart.\n\nPurple lightning pierces the intricate depths—\nWhen the true elixir’s qi is full, divine light at times shines from the face and eyes.\nAt midnight, in seated meditation, one inwardly observes the five viscera and six bowels, seeing clearly within and without, directly witnessing the mysterious pearl nurtured in the cinnabar field.\n\nOral Instructions:\nAfter the elixir descends and the first transformation is complete, whenever the ninth, nineteenth, or twenty-ninth day arrives—these three ninefold days—at high noon, in a quiet chamber, close the door, sit upright, cross the legs, close the eyes, and knock the teeth nine times. When spirit is settled and qi harmonized, then close the breath.\nEach closure lasts eight or nine breaths as one cycle, then open the eyes.\nAfter a long while, close the breath again as before, eight or nine breaths per cycle.\nAt first, close once or twice; as practice grows familiar, close four or five times. With further mastery, close nine times.\nContinue thus until the inner fire’s timing is fully ripe, resonating with heaven and earth, regardless of distance.\nSuddenly, upon the ninth closure, warmth arises in the heart, the four limbs feel harmonious and at ease, and the spirit stirs.\nA stream of hot qi flows down into the cinnabar field—this is the inner elixir entering the cinnabar field, marking the completion of the second transformation.\nAfter this, one no longer practices the ninefold breath count.\n\nSong of the Third Transformation:\n\"For the third transformation, move yang to enter the left palace...\"",
      "overlap_context": "e to quicken the elixir. Once the first transformation is complete, the true elixir suddenly flows down from the heart’s network, stored in the cinnabar field, and nurtured by true water—this is the work of the second transformation.\n\nFrom time to time, the numinous light illumines the purple depths. After the elixir is stored in the cinnabar field, its qi gradually matures. Suddenly, in a quiet chamber, a divine light shines from the eyes, appearing like a golden orb—this is the elixir’s light.",
      "start_char": 1921,
      "end_char": 2557,
      "start_sentence": 79,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.67780590057373,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "丹成二转，藏於丹田，逢六行阴，以养真阴之气。 内阴数足，与天地流通，其真丹忽自丹田流入左胁之内，四体汗流，以除尸气，而成三转之功。 自此更无三尸魂也。 灵珠胎色渐鲜红， 灵珠，内丹也，丹成三转，阳气充足，凡小便及涕唾皆粉红色，以应纯阳之质。 及其丹光内照，见一颗明珠如火轮之状，在左胁之下也。 神躯育火分形象， 三转之后，阳气已足，每遇月尽，以左手摩顶，入息激动丹火，至五藏热而止，谓之育火，以运其丹。 自此而后，丹田之中，渐觉有物，遇入息则丹动，故曰分形象也。 天籁时催造化功。 天和於九霄之上，感激有声，如天乐合奏，名曰天籁。 人之九窍，不闻其音。 三转之后，九窍聪明，则天籁之声，昼夜常闻也。 望江南 毛发落丹，左运行阳， 三转之后，阳气充足，四体毛发，皆自退落，以其阳毒冲落也。 胎色渐红阴渐小。 内丹色渐红也。 三转功成，内阳数足，阳既盛，故阴龟短缩，至於肠胃，亦自微缩。 一月之中，大小便共无十次，位入地仙，道成无漏。 推移岁运助乾刚， 乾之卦六画，皆纯阳。 三转侯阳数充足，体象乾卦，纯阳也。 育火养中央， 摩顶入息，内育真火。 成物象，五岳辩微芒。 三转丹成形象，虽五岳未全，其出入动转，形若三四寸小儿未甚分明。 出入尚迟形尚小， 圣胎成象，神舍其中，出入有形，如婴孩然。 闲坐闭息之间，常出见於面，日嬉游方丈之内。 然阳气方足，未曾养阴，圣胎有魂而未有魄，故出入尚迟，其形尚小。 晨昏天籁奏笙篁， 七窍聪明，则仙音常闻也。 常饮玉壶浆。 华池涌泉，甘露之水，尝饮之也。 口诀 丹入左胁之后，功成三转。",
      "translated_text": "With the second transformation’s elixir complete, it is stored within the cinnabar field, awaiting the sixfold movement of yin to nurture the true yin qi. Once the inner yin’s count is fulfilled and flows in harmony with heaven and earth, the true elixir suddenly streams from the cinnabar field into the left flank. The four limbs perspire, expelling the corpse qi, and thus the third transformation’s work is achieved. From this point onward, the three corpse spirits are no more.\n\nThe灵珠’s embryonic hue gradually turns crimson—\nThe *lingzhu* is the inner elixir. Upon the third transformation’s completion, yang qi becomes abundant, and even urine and saliva take on a pinkish tint, reflecting the pure yang essence. When the elixir’s radiance shines within, one perceives a luminous pearl like a wheel of fire beneath the left flank.\n\nThe divine body nurtures fire to manifest form—\nAfter the third transformation, with yang qi now sufficient, at each month’s end, one uses the left hand to stroke the crown while drawing breath to stir the elixir fire, ceasing only when the five viscera grow warm—this is called *nurturing fire* to circulate the elixir. Thereafter, within the cinnabar field, a presence gradually becomes perceptible, moving with each inhalation. Thus it is said: *manifesting form*.\n\nHeavenly music hastens the work of creation—\nThe harmony of heaven resounds above the nine skies, evoking sounds like celestial instruments in unison, called *heavenly music*. The nine orifices of man do not hear it. Yet after the third transformation, with the nine orifices sharpened, the sound of heavenly music is heard day and night.\n\n*Wang Jiang Nan*:\nHair falls as the elixir,\nYang circulates to the left—\nAfter the third transformation, with yang qi abundant, the body’s hair naturally sheds, driven away by the surging yang toxin.\nThe embryo’s hue reddens as yin recedes—\nThe inner elixir’s color deepens to red. With the third transformation’s work complete and inner yang’s count fulfilled, yang prevails, causing the yin turtle to shrink, even the intestines and stomach to contract slightly. Within a month, there are no more than ten instances of bowel movements or urination, and one attains the rank of earth immortal, achieving the Dao of the leakless.\n\nThe passage of years strengthens the firmness of Qian—\nThe hexagram *Qian* consists of six unbroken lines, all pure yang. When the third transformation’s yang count is fulfilled, the body mirrors *Qian*, becoming pure yang.\nNurture fire at the center—\nStroke the crown while drawing breath to cultivate the true fire within.\nManifest form, the five peaks discern subtle radiance—\nWith the third transformation’s elixir formed, though the five peaks are not yet complete, its movements resemble a three- or four-inch infant, not yet fully distinct.\nIts emergence is slow, its form still small—\nThe sacred embryo takes shape, the spirit dwelling within, emerging with form like a newborn. In moments of quiet sitting and breath-holding, it often appears on the face, playing within a square *zhang*. Yet as yang qi is only now sufficient and yin has not been nurtured, the sacred embryo possesses a soul but lacks a corporeal soul, so its emergence is slow and its form still small.\n\nAt dawn and dusk, heavenly music plays the reed pipes—\nWith the seven orifices sharpened, the immortal melody is ever heard.\nOne constantly drinks the jade flask’s nectar—\nThe blossoming pool’s spring, the sweet dew’s water, is ever sipped.\n\nOral Instructions:\nAfter the elixir enters the left flank, the third transformation’s work is complete.",
      "overlap_context": "h heaven and earth, regardless of distance.\nSuddenly, upon the ninth closure, warmth arises in the heart, the four limbs feel harmonious and at ease, and the spirit stirs.\nA stream of hot qi flows down into the cinnabar field—this is the inner elixir entering the cinnabar field, marking the completion of the second transformation.\nAfter this, one no longer practices the ninefold breath count.\n\nSong of the Third Transformation:\n\"For the third transformation, move yang to enter the left palace...\"",
      "start_char": 2557,
      "end_char": 3257,
      "start_sentence": 110,
      "end_sentence": 146,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.524484872817993,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "凡遇每月初六、十六、二十六、三之日，夜半子时，洗漱了，入静室中，端坐盘膝，叩齿九通，凝神定气，闭目入息。 凡闭息六次为一遍，开眼，良久再闭目，入息六次为第二遍，如此六遍，乃毕。 於其月内行至二十六，则月中三遍俱足。 至其月尽，夜三更子时，依前於静室中，闭目盘膝坐。 先以左手摩顶门，右手摩尾闾，尾闾乃脊骨尽头，随日转七七四十九转，凡摩时紧闭定息，至数足微歇，候气定再摩。 如此三次，自然觉心肾之气交於中鬲，激动丹气，塞於五内，觉五藏内，其热如火，乃行育火之候也。 凡行持之后，或於三六之夜，或於月尽之时，忽然觉左胁内丹在胁下动摇，或微有声，一道热气横遇丹田，直入右胁之下，其热如火摇动，良久而定，乃成四转之功。 自此而后，不行重六之数。 四转歌 四转行阴入右关， 左属阳，右属阴，四转之候，内丹左右以应其内阴之数，自此内阴阳俱足。 圣胎灵运产仙颜， 三转养阳，圣胎生魂，四转养阴，圣胎生魄。 丹至四转之内，圣胎魂魄皆成就，其五岳精神，与我内形貌一同，乃出神真身。 圆光满座神无碍， 四转之后，阴阳气足，正坐闲息，内丹神光从顶门而出，如一轮明月，罩定身体，神游内外，出入无碍，坐於室中，可知千里之外祸福，此之谓妙用成就也。 鼓舞嬉游去又还。 神出入，自在无碍，随意也。",
      "translated_text": "On the sixth, sixteenth, and twenty-sixth days of each month—these three days—at midnight, after washing and rinsing, enter a quiet chamber. Sit upright with legs crossed, knock the teeth nine times, gather the spirit and settle the qi, then close the eyes and draw breath inward. Six breath-holds constitute one cycle; then open the eyes, rest a while, and close them again to draw six breaths for the second cycle. Proceed thus for six cycles, and the practice is complete. By the twenty-sixth day of the month, three full cycles will have been accomplished. On the last night of the month, at the third watch of midnight, return to the quiet chamber as before, sit with eyes closed and legs crossed. First, use the left hand to rub the crown of the head and the right hand to rub the *weilu* (the base of the spine), turning with the sun seventy-seven times—forty-nine rotations. While rubbing, hold the breath firmly; when the count is complete, rest briefly, then resume when the qi has settled. Repeat this three times, and naturally the qi of heart and kidney will merge at the central diaphragm, stirring the elixir qi to fill the five viscera. Within the five organs, a heat like fire will be felt—this is the sign of nurturing the fire.\n\nAfter this practice, on one of the three six-day nights or at the month’s end, one may suddenly feel the elixir within the left flank stir beneath the ribs, perhaps with a faint sound. A stream of hot qi will traverse the cinnabar field and enter beneath the right flank, its heat like fire, shaking for a long while before settling—this completes the fourth transformation’s work. Thereafter, the repeated sixfold count is no longer observed.\n\n**Song of the Fourth Transformation**\nThe fourth transformation moves yin into the right gate—\nLeft pertains to yang, right to yin; the fourth transformation’s sign is the inner elixir’s left-right correspondence with the inner yin count. From this point, inner yin and yang are both fulfilled.\nThe sacred embryo’s numinous work births the immortal visage—\nThe third transformation nurtures yang, giving the sacred embryo its *hun*; the fourth nurtures yin, giving it its *po*. When the elixir reaches the fourth transformation, the sacred embryo’s *hun* and *po* are both perfected, and the five peaks’ spirits merge with one’s inner form, producing the true body of the emergent spirit.\nA halo of light fills the seat, the spirit unbound—\nAfter the fourth transformation, with yin and yang qi sufficient, sitting in quiet repose, the elixir’s divine radiance emerges from the crown of the head like a full moon encircling the body. The spirit roams within and without, coming and going freely. Seated in the chamber, one may perceive fortune and misfortune a thousand *li* away—this is the accomplishment of wondrous function.\nDancing and playing, it departs and returns at will—\nThe spirit’s comings and goings are unimpeded, following its own inclination.",
      "overlap_context": "fficient and yin has not been nurtured, the sacred embryo possesses a soul but lacks a corporeal soul, so its emergence is slow and its form still small.\n\nAt dawn and dusk, heavenly music plays the reed pipes—\nWith the seven orifices sharpened, the immortal melody is ever heard.\nOne constantly drinks the jade flask’s nectar—\nThe blossoming pool’s spring, the sweet dew’s water, is ever sipped.\n\nOral Instructions:\nAfter the elixir enters the left flank, the third transformation’s work is complete.",
      "start_char": 3257,
      "end_char": 3800,
      "start_sentence": 147,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.069762945175171,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "望江南 丹往右，四转运行阴， 四转之功养其内阴，丹藏右胁，以表阴也。 逢六闭藏阳户气， 鼻为天窍、气之出入属阳，口为地窍，气之出入属阴。 三六之夜，闭定鼻息，绝其来去。 以阳气内降，充塞五藏之内，此以阳养阴也。 玉关泉透合丁壬。 闭住鼻息，则华池水满，淋下心络，水火内交，心气下降，肾气上腾，丁壬配合，以养圣胎。 龟戏任浮沉， 阴阳数足，胎在右胁，或升或降，随气摇动，如龟在水，任意浮沉也。 时出入无碍，贯他心， 圣胎神足，出入无碍，朝游西蜀，暮入束都，不出户庭，坐观海内，至於人之心神，使我之神交之，可以知其人之意，故曰贯他心，乃他心通也。 游戏神通常出面， 圣胎成就，婴儿出入面目之间，游戏四海之内，以表神通妙用之自然也。 圆光周匝遍千寻， 内丹光明，罩我之身，其状如月。 寒暑不相侵。 口诀 丹入右胁之后，养成四转之功。 凡遇每月初六、十六、二十六日，半夜子时，洗漱罢，入静室中，闭目盘膝，叩齿三十六通，集神定气，闭定鼻息。 虽闭鼻息，不得似日前入息，直使鼻内无出入之息，湛然不动。 直候真气内满，丹气贯舌窍，华池津液，涌出满口，将欲溢出，然后款款咽之归心。 其神水到心，则激动神火，五藏觉热，遍身汗出，四体舒畅，为一遍。 每至三六之夜，如此行三遍即止，此为神水神火，抱浴圣胎之候。 自此而后，忽於行持之间，内丹自右胁，其声如雷鸣，一道热气，流入丹田。 鼻中火光射出，乃是内丹归复丹田，以成五转。 自此更不行闭阳户之息也。 五转歌 五转阴阳造化成， 三转养内阳，四转养内阴，至五转内外阴场数足，造化之功已成，养就圣胎，神通自在。 婴儿盈尺弄阳精， 五转之后，内丹圣胎，养就灵躯，身长尺余。 自此采日之精，以养外阳，夺天地造化之功也。 寤游四海寐知所， 常人内无所养，精神四散，无所归着。 昼则神在於心，夜则神出於体，及其睡着，神无所守，更不知有身，亦不知所在，随魂逐魄，入幽趣中，与鬼同聚，常於梦中，无所不见。 至四大忽坏，神随鬼往，随福受生，天堂地狱，皆不由己。 乃因神不自识其身，随波逐浪故也。 得道之人，内丹成就，神舍於丹，灵躯自在，昼则神游，夜则神定，及乎睡着，神见其身，物不能诱。 是故魂魄潜伏，百邪不干，更无梦寐，出离生死，去来由我。 出神纵横莫测，故丹经曰真人无梦，谓此也。 去住无为信步行。 望江南",
      "translated_text": "To the Tune of *Wang Jiangnan*\n\nThe elixir moves to the right,\nIn the fourth revolution, yin is cultivated.\nThe work of the fourth revolution nurtures inner yin,\nThe elixir rests in the right flank, signifying yin.\n\nWhen the sixth day arrives, close the gate of yang qi—\nThe nose is the heavenly aperture, the passage of qi belonging to yang;\nThe mouth is the earthly aperture, the passage of qi belonging to yin.\nOn the nights of the third and sixth [days], seal the nose’s breath,\nCutting off its coming and going.\nThus yang qi descends within, filling the five viscera—\nThis is using yang to nourish yin.\n\nThe Jade Pass’s spring permeates, uniting *ding* and *ren*.\nSealing the nose’s breath, the Flowery Pond’s waters brim,\nTrickling down the heart’s network.\nWater and fire intermingle within;\nHeart qi descends, kidney qi ascends,\n*Ding* and *ren* unite to nurture the sacred embryo.\n\nThe turtle plays, rising and sinking at will—\nWhen yin and yang’s measures are complete,\nThe embryo in the right flank,\nNow ascending, now descending,\nSways with the qi’s movement,\nLike a turtle in water, drifting and diving as it pleases.\n\nAt times, it comes and goes without hindrance,\nPiercing others’ hearts—\nWhen the sacred embryo’s spirit is sufficient,\nIts comings and goings are unimpeded.\nAt dawn, it roams in the western lands;\nAt dusk, it enters the eastern capital.\nWithout leaving the chamber, one sits and surveys the realm.\nAs for the minds of others,\nOne’s spirit may commune with theirs,\nDiscerning their intentions—\nThis is called \"piercing others’ hearts,\"\nThe penetration of others’ minds.\n\nPlayful, the spirit’s constant emergence from the face—\nWhen the sacred embryo is perfected,\nThe infant comes and goes between the brows,\nRoaming and playing within the four seas,\nManifesting the natural wonder of spiritual power.\n\nA halo of light encircles, spanning a thousand *xun*—\nThe inner elixir’s radiance envelops the body,\nIts form like the moon.\n\nNeither cold nor heat can encroach.\n\n**Oral Instructions**\nAfter the elixir enters the right flank,\nCultivate the work of the fourth revolution.\nWhenever encountering the sixth, sixteenth, or twenty-sixth day of the month,\nAt midnight, the hour of *zi*,\nAfter washing and rinsing,\nEnter a quiet chamber.\nClose the eyes, cross the legs,\nKnock the teeth thirty-six times,\nGather the spirit, settle the qi,\nAnd seal the nose’s breath.\nThough the nose’s breath is sealed,\nDo not force it as in previous days.\nLet there be no breath of coming or going within the nose,\nPerfectly still and unmoving.\nWait until true qi fills within,\nThe elixir’s qi pierces the tongue’s aperture,\nThe Flowery Pond’s fluids well up, filling the mouth,\nNearly overflowing—\nThen gently swallow them, guiding them to the heart.\nWhen the divine water reaches the heart,\nIt stirs the divine fire;\nThe five viscera grow warm,\nThe whole body sweats,\nThe four limbs relax—\nThis is one cycle.\nOn each of the third and sixth nights,\nPerform this three times and then stop.\nThis is the time for divine water and divine fire\nTo bathe and nurture the sacred embryo.\n\nAfter this,\nSuddenly, in the midst of practice,\nThe inner elixir from the right flank\nRumbles like thunder,\nA stream of hot qi flows into the elixir field.\nFirelight shoots from the nose—\nThis is the inner elixir returning to the elixir field,\nCompleting the fifth revolution.\nFrom this point onward,\nNo longer practice sealing the gate of yang breath.\n\n**Song of the Fifth Revolution**\nThe fifth revolution completes the transformations of yin and yang—\nThe third revolution nurtures inner yang,\nThe fourth revolution nurtures inner yin.\nBy the fifth revolution, the measures of inner and outer yin and yang are complete,\nThe work of transformation is done,\nThe sacred embryo is nurtured,\nAnd spiritual power is free.\n\nThe infant, a foot long, plays with solar essence—\nAfter the fifth revolution,\nThe inner elixir’s sacred embryo,\nHaving nurtured its numinous body,\nGrows over a foot in length.\nFrom this point, one absorbs the sun’s essence\nTo nourish outer yang,\nSeizing the transformative power of heaven and earth.\n\nWaking, one roams the four seas; sleeping, one knows one’s place—\nOrdinary people, lacking inner cultivation,\nScatter their spirit and essence,\nWith no place to return.\nBy day, their spirit dwells in the heart;\nBy night, their spirit leaves the body.\nWhen they fall asleep,\nTheir spirit has no guard,\nThey forget their body,\nAnd know not where they are.\nFollowing the *hun* and chasing the *po*,\nThey enter dark realms,\nGathering with ghosts.\nIn dreams, they see all things.\nWhen the four great elements suddenly dissolve,\nTheir spirit follows the ghosts,\nReceiving rebirth according to their fortune.\nHeaven and hell are not of their choosing—\nThis is because their spirit does not recognize its own body,\nDrifting with the waves.\n\nThose who attain the Dao,\nHaving perfected the inner elixir,\nDwell their spirit in the elixir,\nTheir numinous body free.\nBy day, their spirit roams;\nBy night, their spirit settles.\nWhen they sleep,\nTheir spirit sees their body,\nAnd no thing can tempt it.\nThus the *hun* and *po* lie hidden,\nA hundred evils cannot intrude.\nNo more dreams or sleep—\nThey depart from life and death,\nComing and going as they please.\nTheir spirit’s comings and goings are unfathomable,\nThus the elixir classics say, \"The true person has no dreams,\"\nReferring to this.\n\nComing and going, they wander effortlessly.",
      "overlap_context": "ransformation, with yin and yang qi sufficient, sitting in quiet repose, the elixir’s divine radiance emerges from the crown of the head like a full moon encircling the body. The spirit roams within and without, coming and going freely. Seated in the chamber, one may perceive fortune and misfortune a thousand *li* away—this is the accomplishment of wondrous function.\nDancing and playing, it departs and returns at will—\nThe spirit’s comings and goings are unimpeded, following its own inclination.",
      "start_char": 3801,
      "end_char": 4796,
      "start_sentence": 165,
      "end_sentence": 208,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.57695722579956,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "珠自右，飞电入丹城， 四转功成，阴阳数足，内丹玄珠，忽自右胁，一道真火，飞入丹田。 其声如雷，鼻光如火，乃是丹珠内阴内阳皆足，复归丹田，以成五转之位也。 内养婴儿盈尺象， 圣胎之内，真人成就，出入顶门，长尺余也。 时逢九数采阳精。 三转养内阳，四转养内阴，故阴阳皆足，丹归丹田，功成五转，则夺天地造北，采日之精以养其外阳，修行之道，自内及外，其序顺也。 故自五转之后，於一月之内，逢三九之日，采日之精，以养圣胎矣！ 火向水中 生行持之法，以水求火，以阴感阳，水火既济，阴阳大和，故曰火向水中生也。 烧鬼岳，紫殿势峥嵘。 常人於丹田下积阴气，谓之鬼岳。 丹成五转，内外火发，烧尽鬼岳，遍体纯阳。 阴鬼山岳，焚烧，阳神宫殿建立，故曰烧山符子鬼难看也。 随意出游寰海内，寐如沙碛卧长鲸，时序与偕行。 五转之后，造化功成，与天地合德，日月齐明，变化与时流通，故曰与偕行也。 口诀 内丹复入丹田，五转之功成就，内之阴阳数足，当采外之阴阳，以成大道。 凡遇每月初九、十九、二十九、三九之日，当正午时，面南盘膝，闭目对日而坐，候气定，闭鼻息，使息无往来，真阳不漏，充满於内。 其内之真火与外之真火交通，自觉一身上下通红明满。 坐一二刻后，渐渐丹田真水一道，冷气上贯於心，如水晶一团，在其心上，然后开眼开息，从鼻中吸日之气，九九八十一口，纳之於心，其日气到心之后，与真水相激，吸气一半之后，渐觉心头气动，内丹在丹田，如鱼涌跃，乃是阴阳大和，至八十一口而止。 如此行持三年而毕，三载数足，不采日精，却采月华也。 六转歌 六转神全弄月华， 丹至六转，内外阴阳皆足，圣胎神全，其真人与内身一体，每遇月圆之夜，采月之英华，以积真阴，故曰弄月华。 变胎魂魄影潜赊， 变胎，谓凡胎成圣胎也。 五转真阳全，魂化为神； 六转真阴全，魄化为气。 魂魄内外，则日中游行，更无其影。 自此之后，鬼神不可见，而阴场不可测，以为真仙之道，影潜赊也。 阳砂换骨阴消肉， 人之凡胎浊骨，阴阳不洁，不能上升。 得道真人，丹成四转之后，至五转，采日精纳於丹田，结为阳砂。 采日一年之后，其阳砂内纯，入於髓中，换其凡骨，内生仙骨。 但觉夜间汗出如白膏，乃是凡骨随汗而消也，至八十一口而止。 如故曰阳砂换骨。 五转换骨之后，至六转，采月华纳於丹田，结为阴粉。 采月华一年之后，其阴粉内化入於肉中，换其凡肉，以养仙肌。 但觉大小便常有紫血随气换下，乃是几肉暗消，仙肌肉生，故曰阴消肉也。 换尽由如玉去瑕 玉之有瑕，不成真玉，人有凡肌浊骨，不成真人。 六转之后，换其几骨而生仙骨，去其凡肌而生仙肌，换尽无瑕，神明纯一也。 望江南 日精满，阴魄化无形， 六转阴阳数全，魂魄内化，形体无形，以登真人之道也。 每遇月圆开北户， 六转之后，每遇月圆十五夜，运北方肾水交南方心火，使内外水火既济，以结阴粉，与天地造化通流，以育圣胎也。 神龟时饮碧瑶泠。 神龟，肾水中龟也。 饮海龟儿人不识，乃是采月之英华纳於神水之府，其神龟饮之阴粉，也。 生於北海之中 形魄岂能停，",
      "translated_text": "The pearl from the right,\nA bolt of lightning enters the cinnabar city.\nAfter four revolutions, the work is complete,\nYin and yang’s numbers fulfilled.\nThe inner elixir’s mystic pearl\nSuddenly from the right flank—\nA stream of true fire\nFlies into the cinnabar field.\nIts sound like thunder,\nIts nose’s light like flame.\nThis is when the pearl’s inner yin and inner yang are both full,\nReturning to the cinnabar field\nTo complete the fifth revolution’s position.\n\nWithin the sacred embryo, the infant grows a foot long,\nThe true person perfected within the holy womb,\nExiting and entering through the crown gate,\nOver a foot in length.\n\nAt times, meeting the ninefold numbers, they gather yang essence.\nThe third revolution nurtures inner yang,\nThe fourth nurtures inner yin.\nThus yin and yang are both full,\nThe elixir returns to the cinnabar field,\nThe work of the fifth revolution complete—\nThey seize heaven and earth’s creative power,\nGathering the sun’s essence to nourish their outer yang.\nThe path of cultivation,\nFrom inner to outer,\nFollows this natural order.\nTherefore, after the fifth revolution,\nWithin a month’s time,\nOn the days of the three nines,\nThey gather the sun’s essence\nTo nourish the sacred embryo.\n\nFire arises within water.\nThe method of practice:\nSeeking fire through water,\nDrawing yang through yin.\nWater and fire in harmony,\nYin and yang in great accord—\nThus fire arises within water.\n\nBurning the Ghost Mountain,\nThe purple palace stands towering.\nOrdinary people accumulate yin qi below the cinnabar field,\nCalled the Ghost Mountain.\nWhen the elixir completes the fifth revolution,\nInner and outer fire ignite,\nBurning away the Ghost Mountain,\nThe entire body pure yang.\nThe yin ghost’s mountain consumed,\nThe yang spirit’s palace established—\nThus the mountain burns, and the ghost’s talisman is no more.\n\nWandering at will through the seas of the world,\nSleeping like a whale on the desert sands,\nMoving in harmony with the seasons.\nAfter the fifth revolution,\nThe work of creation is complete,\nJoining virtue with heaven and earth,\nBright as the sun and moon.\nTransformations flow with time—\nThus they move in harmony with it.\n\nOral Instructions:\nWhen the inner elixir returns to the cinnabar field,\nThe work of the fifth revolution complete,\nThe numbers of inner yin and yang fulfilled,\nThen gather outer yin and yang\nTo perfect the great Dao.\nWhenever encountering the ninth, nineteenth, or twenty-ninth day of the month—\nThe three ninefold days—\nAt high noon,\nFace south, cross your legs,\nClose your eyes, and sit facing the sun.\nWait for the qi to settle,\nClose your nostrils, and halt your breath,\nSo that true yang does not leak,\nFilling the interior.\nThe inner true fire communicates with the outer true fire,\nAnd you will feel your entire body above and below\nGlowing red and radiant.\nAfter sitting for one or two moments,\nGradually, a stream of true water from the cinnabar field,\nA cold qi, rises to penetrate the heart,\nLike a sphere of crystal\nResting above it.\nThen open your eyes and release your breath,\nInhaling the sun’s qi through your nose,\nEighty-one breaths in all,\nDrawing it into the heart.\nOnce the sun’s qi reaches the heart,\nIt clashes with the true water.\nAfter half the breaths,\nYou will gradually feel the qi stir in your heart,\nThe inner elixir in the cinnabar field\nLike a leaping fish—\nThis is the great harmony of yin and yang.\nStop at eighty-one breaths.\nPractice this for three years to complete the work.\nWhen the three-year count is full,\nCease gathering the sun’s essence\nAnd instead gather the moon’s radiance.\n\nThe Sixth Revolution Song:\nAt the sixth revolution, the spirit is whole, playing with the moon’s radiance.\nWhen the elixir reaches the sixth revolution,\nInner and outer yin and yang are both full,\nThe sacred embryo’s spirit complete.\nThe true person and the inner body become one.\nOn every full moon night,\nThey gather the moon’s essence and splendor\nTo accumulate true yin—\nThus they play with the moon’s radiance.\n\nTransforming the embryo, the hun and po’s shadows recede.\nTransforming the embryo:\nThe ordinary womb becomes the sacred womb.\nAt the fifth revolution, true yang is complete,\nThe hun transforms into spirit.\nAt the sixth revolution, true yin is complete,\nThe po transforms into qi.\nWith hun and po within and without,\nThey wander at noon without shadow.\nFrom this point on,\nEven ghosts and spirits cannot see them,\nAnd the yin realm is unfathomable—\nThis is the true immortal’s path,\nThe shadow receding into obscurity.\n\nYang cinnabar replaces the bones, yin dissolves the flesh.\nThe ordinary person’s impure bones,\nYin and yang unclean,\nCannot ascend.\nThe perfected Daoist,\nAfter the elixir completes the fourth revolution,\nBy the fifth revolution,\nGathers the sun’s essence into the cinnabar field,\nCoagulating it into yang cinnabar.\nAfter a year of gathering the sun’s essence,\nThe yang cinnabar within is pure,\nEntering the marrow,\nReplacing the ordinary bones\nAnd generating immortal bones.\nThey will feel at night\nSweat like white cream—\nThis is the ordinary bones dissolving with the sweat.\nStop at eighty-one breaths.\nThus it is said: yang cinnabar replaces the bones.\nAfter the fifth revolution replaces the bones,\nBy the sixth revolution,\nThey gather the moon’s radiance into the cinnabar field,\nCoagulating it into yin powder.\nAfter a year of gathering the moon’s radiance,\nThe yin powder within transforms,\nEntering the flesh,\nReplacing the ordinary flesh\nTo nourish the immortal skin.\nThey will feel in their urine and stool\nPurple blood constantly expelled—\nThis is the ordinary flesh silently dissolving,\nImmortal flesh growing.\nThus it is said: yin dissolves the flesh.\n\nReplaced entirely, like jade freed of flaws.\nJade with flaws\nCannot become true jade.\nPeople with ordinary flesh and impure bones\nCannot become true persons.\nAfter the sixth revolution,\nThey replace their ordinary bones with immortal bones,\nShed their ordinary flesh to grow immortal flesh.\nReplaced entirely, without flaw,\nTheir spirit and clarity become one.\n\n*Looking at the River South*:\nThe sun’s essence full,\nThe yin po transforms, formless.\nAt the sixth revolution, yin and yang’s numbers complete,\nHun and po inwardly transformed,\nThe body formless—\nThus they ascend the true person’s path.\n\nOn every full moon, open the northern door.\nAfter the sixth revolution,\nOn every full moon’s fifteenth night,\nThey circulate northern kidney water to meet southern heart fire,\nSo that inner and outer water and fire harmonize,\nCoagulating yin powder,\nFlowing in accord with heaven and earth’s creative power\nTo nurture the sacred embryo.\n\nThe spirit turtle drinks from the azure jade’s chill.\nThe spirit turtle—\nThe turtle within kidney water.\nThe sea turtle, unknown to others—\nThis is gathering the moon’s essence and splendor\nInto the palace of spirit water,\nWhere the spirit turtle drinks the yin powder.\n\nBorn within the northern sea,\nHow could the form and po remain?",
      "overlap_context": "r,\nTheir numinous body free.\nBy day, their spirit roams;\nBy night, their spirit settles.\nWhen they sleep,\nTheir spirit sees their body,\nAnd no thing can tempt it.\nThus the *hun* and *po* lie hidden,\nA hundred evils cannot intrude.\nNo more dreams or sleep—\nThey depart from life and death,\nComing and going as they please.\nTheir spirit’s comings and goings are unfathomable,\nThus the elixir classics say, \"The true person has no dreams,\"\nReferring to this.\n\nComing and going, they wander effortlessly.",
      "start_char": 4796,
      "end_char": 6086,
      "start_sentence": 209,
      "end_sentence": 261,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.467124223709106,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "日中无影也。 阳砂赤阴粉色微青 日精所结属阳华所结属阴，其色赤象日也； 象月也。 粉换肉肌砂换骨，凡胎换尽圣胎灵， 魂化合神，魄化合气，清净一体之，形神俱妙，与道合一也。 飞举似流星。 学道之士，能全其神，未能换形，则为形所累，故出神则身不动，尸解则，形不去。 丹成六转，换尽凡形而成，仙质，形神俱妙，神之所向，形亦随之，上升九霄，如星之快也。 口诀 丹成六转，当采月华，每遇月圆十五，夜半子时，洗漱毕，对月而坐，闭目盘膝，定气鼻息，合口，令口鼻绝往来之息，使真气不泄於外。 内之真气塞乎六腑，肾之真阴与太阴之精，内外摄受，阴气交通，自觉一身莹如水晶，湛然明朗。 一二刻间，肾之真水感动心火，心神之火，一道热气降入丹田，如一团火轮安在瑠璃盘内。 然后款款开眼放息，从鼻中对月，吸月之气，纳入丹田，吸八八六十四口而止。 吸气一半之后，其月华真阴，激动丹田中真火，水火相交，如沸汤之状，四体汗出，百脉舒畅，至六十四口而止。 如此行持二年，乃毕其功，将入七转之位也。 七转歌 七转飞腾四体轻， 仙体轻清，飞举自然也。 灵光闭息满丹城， 内丹点就形神，故一身之体，为藏丹之城也。 丹至七转，使内外阴阳和会，当须闭息千朝，以成妙道之用。 千朝却粒生神火， 丹成七转，闭息千朝，使阴阳大和，千日数足，神气合会，五藏鼎新，内外纯一。 月光明彻於六府，真火照烛於五内，藏府谷虫，化之为水。 自此肠胃充实，不纳烟火之食，饥餐仙果，渴饮琼浆。 坤户施张浴海鲸， 内丹皆化之后，阴形消尽，唯有一窍，名曰坤户，以象其阴也。 每遇神丹火盛，则於三九之日，投身水中，运其丹珠，从坤户出，呼吸弄水，嬉游自在。 一二时久，复还其丹，纳於丹穴，以制火候之盛也。 望江南 形透日，七转任飞腾， 七转之后，形神俱妙，内腑外形，皆为仙器。 日中游行，形影通明，色如红玉，飞举腾空，纵横任意也。 幽入深岩图宴坐，息无来去使神凝。 七转之功，要在和顺内外，使外之日月英华，合乎心肾之水火，阴阳交通，神气和会。 幽入岩谷之中，宴坐百日，闭定鼻息，以绝呼吸之气，神气冲和，凝然大定，五藏内实，不食尘世之物，证逍遥之道也。 却粒着奇，能生神火，返本气清澄。 闭息千日，神火内发，荡尽谷虫，更无食念。 返本还元，抱一清净，故曰气澄清。 九候浴时开地户， 凡遇神火太过，五藏发热，则逢九之日，入於水中，浴其真丹，光明如火轮之状，从地户中出，故曰开地户也。 月中取火日求冰， 月者阴之象，神火，至阳之物，地户，阴之窍。 引导阳光，从地户阴穴中出，故曰月中取火也。 日者阳之象，神水至阴之物，舌窍者阳之窍，通流神水，从舌窍阳穴而出，故曰日求冰也。 五内换重新。 五转换骨，六转换肉，七转换五藏。 五内者，五藏也，故曰五内换重新也。 口诀 丹至七转，须当远离尘市，入深山之中，岩间宴坐，闭息凝神，口鼻绝往来之息，使真阴真阳交於腹内，夺天地造化之功，归於四体。 千日之后，五藏换尽，胎气变为仙腑。 但觉顶门窍开，出赤黑之气，乃是胎气发散。 千日数足，顶门窍合，乃是胎气出尽，七转功满也。",
      "translated_text": "At noon, no shadow remains.\nYang sand glows crimson; yin powder bears a faint azure hue.\nThe essence of the sun coalesces—this is yang’s radiance;\nThe essence of the moon coalesces—this is yin’s splendor.\nIts crimson hue mirrors the sun;\nIts pale tint mirrors the moon.\nPowder refines the flesh; sand transforms the bones.\nThe mortal embryo is wholly exchanged for the sacred embryo’s numinosity.\nThe hun merges with spirit; the po merges with qi.\nIn purity, they become one—\nForm and spirit both wondrous,\nIn perfect unity with the Dao.\n\nThey ascend like shooting stars.\nFor those who cultivate the Dao,\nIf they preserve their spirit but fail to transform their form,\nThe body becomes a burden:\nWhen the spirit departs, the body remains unmoved;\nWhen the corpse dissolves, the form does not depart.\nAfter six revolutions of the elixir,\nThe mortal form is entirely transmuted into immortal substance—\nForm and spirit both wondrous.\nWhere the spirit directs, the form follows,\nRising through the nine heavens,\nSwift as a star.\n\n**Oral Instructions:**\nWhen the elixir completes six revolutions,\nGather the moon’s radiance.\nOn every full moon’s fifteenth night,\nAt midnight’s zi hour,\nBathe and rinse, then sit facing the moon.\nClose your eyes, cross your legs,\nRegulate your breath through the nose,\nAnd seal your mouth,\nCutting off the flow of breath through mouth and nose,\nSo that true qi does not leak outward.\nWithin, true qi fills the six viscera.\nThe true yin of the kidneys and the essence of the great yin\nAre inwardly and outwardly absorbed,\nAnd yin qi circulates freely.\nYou will feel your entire body gleam like crystal,\nLimpid and luminous.\nAfter a moment or two,\nThe true water of the kidneys stirs the fire of the heart.\nA thread of fiery qi from the heart’s spirit\nDescends into the cinnabar field,\nLike a wheel of flame resting in a lapis lazuli dish.\nThen gently open your eyes, release your breath,\nAnd through your nose, facing the moon,\nDraw in the moon’s qi,\nAbsorbing sixty-four breaths before stopping.\nAfter half the breaths are taken,\nThe moon’s true yin excites the true fire in the cinnabar field.\nWater and fire intermingle,\nLike boiling water—\nThe four limbs sweat,\nThe hundred vessels relax and flow,\nUntil the sixty-fourth breath is complete.\nPractice this for two years,\nAnd the work will be accomplished,\nPreparing you to enter the seventh revolution.\n\n**Song of the Seventh Revolution:**\nAt seven revolutions, the body soars, weightless—\nThe immortal form, light and pure,\nNaturally ascends.\nThe numinous light, breath sealed, fills the elixir’s city.\nThe inner elixir refines form and spirit,\nSo the entire body becomes the city that houses the elixir.\nWhen the elixir reaches seven revolutions,\nInner and outer yin and yang harmonize.\nOne must seal the breath for a thousand mornings\nTo fulfill the wondrous Dao’s work.\nAfter a thousand mornings of fasting, the spirit fire is born.\nWhen the elixir completes seven revolutions,\nAnd the breath is sealed for a thousand days,\nYin and yang achieve great harmony.\nWhen the thousand days are fulfilled,\nSpirit and qi unite,\nThe five viscera are renewed,\nAnd inner and outer become pure and one.\nThe moon’s light shines through the six viscera;\nTrue fire illuminates the five organs.\nThe worms in the viscera and stomach\nAre transformed into water.\nFrom this point, the intestines and stomach are full,\nNo longer taking in the food of smoke and fire.\nHunger is sated with immortal fruits;\nThirst is quenched with jade nectar.\nThe kun gate opens wide to bathe the sea whale.\nAfter the inner elixir is wholly transformed,\nThe yin form dissolves entirely,\nLeaving but one aperture—\nCalled the kun gate,\nSymbolizing yin.\nWhenever the divine elixir’s fire grows strong,\nOn the days of the three nines,\nEnter the water,\nCirculate the elixir pearl,\nAnd let it emerge from the kun gate.\nBreathe, play in the water,\nAnd frolic freely.\nAfter an hour or two,\nReturn the elixir to its chamber,\nNestling it in the elixir cave\nTo regulate the fire’s intensity.\n\n**Looking Over the River South:**\nThe form penetrates the sun—\nAt seven revolutions, it soars at will.\nAfter seven revolutions,\nForm and spirit are both wondrous,\nInner organs and outer form\nAll become vessels of immortality.\nRoaming at noon,\nForm and shadow are luminous,\nThe hue like red jade.\nAscending and soaring through the void,\nMoving freely as they please.\nSecluded in deep cliffs, they sit in meditation,\nBreath without coming or going—\nSpirit congeals.\nThe work of the seventh revolution\nLies in harmonizing inner and outer,\nSo the radiance of the sun and moon without\nMerges with the water and fire of heart and kidneys.\nYin and yang circulate,\nSpirit and qi unite.\nSecluded in mountain valleys,\nThey sit in meditation for a hundred days,\nSealing the breath through the nose\nTo cut off the flow of respiration.\nSpirit and qi surge in harmony,\nCongealing in great stillness.\nThe five viscera are inwardly full,\nNo longer consuming the world’s dust.\nThey realize the Dao of carefree wandering.\nFasting yields wonders,\nAble to generate spirit fire,\nReturning to the origin—qi pure and clear.\nWhen the nine signs appear, bathe and open the earth gate.\nWhenever the spirit fire grows excessive,\nAnd the five viscera burn hot,\nOn the days of the nine,\nEnter the water to bathe the true elixir.\nIt shines like a wheel of fire,\nEmerging from the earth gate—\nThus the earth gate opens.\nDrawing fire from the moon, seeking ice from the sun.\nThe moon symbolizes yin;\nSpirit fire is the utmost yang.\nThe earth gate is yin’s aperture.\nGuiding the yang light,\nIt emerges from the yin cavity of the earth gate—\nThus drawing fire from the moon.\nThe sun symbolizes yang;\nSpirit water is the utmost yin.\nThe tongue’s aperture is yang’s cavity,\nThrough which spirit water flows,\nEmerging from the yang cavity of the tongue—\nThus seeking ice from the sun.\nThe five organs are renewed.\nAt five revolutions, the bones are transformed;\nAt six, the flesh;\nAt seven, the five viscera.\nThe five organs are the five viscera—\nThus the five organs are renewed.\n\n**Oral Instructions:**\nWhen the elixir reaches seven revolutions,\nOne must leave the dusty world behind,\nEntering deep mountains,\nSitting in meditation within cliffs.\nSeal the breath, congeal the spirit,\nCutting off the flow of breath through mouth and nose,\nSo that true yin and true yang merge within the abdomen,\nSeizing the creative power of heaven and earth,\nReturning it to the four limbs.\nAfter a thousand days,\nThe five viscera are wholly transformed,\nAnd the fetal qi becomes immortal organs.\nYou will feel the aperture at the crown open,\nReleasing red and black qi—\nThis is the dispersal of fetal qi.\nWhen the thousand days are fulfilled,\nThe crown’s aperture closes—\nThe fetal qi is exhausted,\nAnd the work of the seventh revolution is complete.",
      "overlap_context": "re,\nSo that inner and outer water and fire harmonize,\nCoagulating yin powder,\nFlowing in accord with heaven and earth’s creative power\nTo nurture the sacred embryo.\n\nThe spirit turtle drinks from the azure jade’s chill.\nThe spirit turtle—\nThe turtle within kidney water.\nThe sea turtle, unknown to others—\nThis is gathering the moon’s essence and splendor\nInto the palace of spirit water,\nWhere the spirit turtle drinks the yin powder.\n\nBorn within the northern sea,\nHow could the form and po remain?",
      "start_char": 6086,
      "end_char": 7393,
      "start_sentence": 262,
      "end_sentence": 315,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.90705180168152,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "自此而后，五藏结实，不纳烟火之食。 若有时五藏丹火内发，鼻窍火出，则入水中闭定鼻息，则丹珠神火从阴户而出，浮於水面，如牛弄黄。 直候舌下神水如泉，则丹火自息，吸其丹珠，复入坤户，直至八转，地带成就，更无火毒，则不须浴也。 八转歌 八转还元地带垂， 婴儿在母腹中胞胎裹，定气不能出而无所损者，盖婴儿脐中有脐带街在口中，呼吸之气，往来不绝，此乃自然胎息，故无损也心丹成八转后，复於脐中生一脐带，亦如婴儿之形，还其本始之道，故曰还元地带垂也。 周行胎息养婴儿， 真人得地带，行周天之气，故能长生。 有时火发烧丹窟，深入泠泉弄赤龟。 赤毫，丹珠也，八转之后，内炼真火，使无热毒之患。 凡遇火发，即口街地带，闭息九日，至第九日，真水自丹田，如涌泉泛涨，直至重楼十二环，丹珠在其神水中，如龟戏水。 自此之后，真火无毒，更无丹热之患，故曰深入泠泉弄赤龟也。 望江南 内外遍，八转始还元，",
      "translated_text": "After this, the five viscera become solid and no longer accept food cooked over fire and smoke. Should the elixir-fire within the viscera flare up at times, causing fire to issue from the nostrils, one must enter water and seal the breath through the nose. Then the cinnabar pearl and spirit-fire will emerge from the yin gate, floating upon the water’s surface like a cow playing in yellow mire. Only when the divine water beneath the tongue flows like a spring will the elixir-fire naturally subside. Inhale the cinnabar pearl back into the Gate of Earth, and proceed until the eighth revolution, when the Earth Belt is accomplished. With no more fire-toxin, there will be no further need for bathing.\n\n**Song of the Eighth Revolution:**\nThe eighth revolution returns to the hanging Earth Belt,\nAs the infant lies within the mother’s womb, enveloped in the placenta.\nThe settled qi cannot escape and suffers no loss—\nFor the infant’s navel holds an umbilical cord that connects to its mouth,\nAllowing the breath to flow ceaselessly in and out.\nThis is the natural fetal breathing, hence no harm comes to it.\n\nOnce the heart-elixir completes the eighth revolution,\nAn umbilical cord grows again within the navel,\nJust like that of an infant,\nRestoring the original Way of beginnings.\nThus it is called *returning to the hanging Earth Belt.*\n\nCirculating fetal breathing to nourish the infant,\nThe Perfected attains the Earth Belt and moves the qi of the celestial cycle,\nThus achieving longevity.\n\nAt times, fire arises to scorch the elixir-cave—\nPlunge deep into the cool spring to play with the red turtle.\nThe red radiance is the cinnabar pearl.\nAfter the eighth revolution, the inner refinement of true fire\nEliminates the affliction of heat-toxin.\nWhenever fire flares, one must hold the Earth Belt in the mouth,\nSeal the breath for nine days,\nAnd on the ninth day, true water will surge from the cinnabar field\nLike a gushing spring, rising to the Twelve-Storied Tower.\nThe cinnabar pearl will float within this divine water,\nLike a turtle sporting in the waves.\n\nFrom this point onward, true fire holds no toxin,\nAnd the affliction of elixir-heat vanishes.\nThus it is said: *plunge deep into the cool spring to play with the red turtle.*\n\n**Looking Over the River South:**\nWithin and without, all is pervaded—\nOnly at the eighth revolution does one return to the origin.",
      "overlap_context": "e,\nSo that true yin and true yang merge within the abdomen,\nSeizing the creative power of heaven and earth,\nReturning it to the four limbs.\nAfter a thousand days,\nThe five viscera are wholly transformed,\nAnd the fetal qi becomes immortal organs.\nYou will feel the aperture at the crown open,\nReleasing red and black qi—\nThis is the dispersal of fetal qi.\nWhen the thousand days are fulfilled,\nThe crown’s aperture closes—\nThe fetal qi is exhausted,\nAnd the work of the seventh revolution is complete.",
      "start_char": 7393,
      "end_char": 7794,
      "start_sentence": 316,
      "end_sentence": 329,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.66568374633789,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "丹至八转，外之形体，内之五藏，尽皆换遍。 复生地带，如同婴儿之状，故曰返本还元也。 地带长垂生坎户，周行胎息贯天门， 地带，脐之带也，生於脐中，属北方坎卦，故曰生坎户也。 天门，华池之窍也，地带贯於口中，行周天之息，以调火侯，故曰周行胎息也。 太始道方存。 太始之道，生天地之始，丹成八转一始，天地造化之初也。 纯一体 内外纯成阳也，无一点阴气，故曰纯一体也。 黑赤气常喷， 黑赤者，神火之气也，丹成八转，息之往来，从鼻中出，常见黑赤之气，故曰气常喷也。 丹火发来烧内境，泠泉深处浴猴狲， 丹火之患，运神水以制之，更无丹火之候。 盖丹者心珠，心象猴也，以神水浴丹，其神丹浮沉於神水之内，故曰浴猴狲也。 神水赤龟吞。 丹浮神水之中，如龟之吞水，取其状也。 口诀 丹成八转，地带生於脐中，若遇丹火内发，五藏燥热，即闭目宴坐，以地带接於华池之下，使息气内通，行周雨运用之道。 自闭息之后，丹田真水日月渐长，至第九日，神水直至重楼十二环，丹珠浸於神水之中，去尽火毒。 自此之后，更无发燥之候，至第九夜子时，闭息吸神水入泥丸，过夹脊，复入丹田，以毕其功也。 造化之功，归於四体。 千日之后，五藏换尽，胎气变为仙腑。 但觉顶门窍开，出赤黑之气，乃是胎气发散。 千日数足，顶门窍合，乃是胎气出尽，七转功满也。 自此而后，五藏结实，不纳烟火之食。 若有时五藏丹火内发，鼻窍火出，则入水中闭定鼻息，则丹珠神火从阴户而出，浮於水面，如牛弄黄。 直候舌下神水如泉，则丹火自息，吸其丹珠，复入坤户，直至八转，地带成就，更无火毒，则不须浴也。 八转歌 八转还元地带垂， 婴儿在母腹中胞胎裹，定气不能出而无所损者，盖婴儿脐中有脐带街在口中，呼吸之气，往来不绝，此乃自然胎息，故无损也心丹成八转后，复於脐中生一脐带，亦如婴儿之形，还其本始之道，故曰还元地带垂也。 周行胎息养婴儿， 真人得地带，行周天之气，故能长生。 有时火发烧丹窟，深入泠泉弄赤龟。 赤毫，丹珠也，八转之后，内炼真火，使无热毒之患。 凡遇火发，即口街地带，闭息九日，至第九日，真水自丹田，如涌泉泛涨，直至重楼十二环，丹珠在其神水中，如龟戏水。 自此之后，真火无毒，更无丹热之患，故曰深入泠泉弄赤龟也。 望江南 内外遍，八转始还元，",
      "translated_text": "When the elixir reaches the eighth revolution, the external form and the internal five viscera are entirely transformed. The Earth Belt regenerates, resembling the state of an infant—thus it is called *returning to the origin and restoring the primordial*.\n\nThe Earth Belt hangs long, giving birth to the Kan Gate;\nCoursing through the womb-breath, it penetrates the Celestial Gate.\nThe Earth Belt is the umbilical cord, born within the navel and belonging to the northern Kan trigram—hence it is called *giving birth to the Kan Gate*. The Celestial Gate is the aperture of the Flowery Pond; the Earth Belt connects to the mouth, circulating the breath of the celestial cycle to regulate the fire’s timing—thus it is called *coursing through the womb-breath*.\n\nThe Dao of the Great Beginning now abides.\nThe Dao of the Great Beginning is the origin of heaven and earth; when the elixir completes its eighth revolution, it is the inception of heaven and earth’s creation.\n\nA single, pure body—\nWithin and without, it is wholly yang, without a trace of yin qi—hence it is called *a single, pure body*.\n\nBlack and red qi constantly sprays forth—\nBlack and red are the qi of spirit-fire; when the elixir completes its eighth revolution, the breath’s coming and going issues from the nose, ever manifesting as black and red qi—thus it is said *qi constantly sprays forth*.\n\nWhen the elixir-fire flares to scorch the inner realm,\nPlunge deep into the cool spring to bathe the macaque.\nThe affliction of elixir-fire is governed by the movement of spirit-water; thus, no sign of elixir-fire remains. The elixir is the heart-pearl, and the heart resembles a monkey; bathing the elixir in spirit-water, the divine elixir floats and sinks within it—hence it is called *bathing the macaque*.\n\nThe spirit-water swallows the red turtle—\nThe elixir floats within the spirit-water, like a turtle swallowing water, describing its form.\n\n**Oral Instructions:**\nWhen the elixir completes its eighth revolution, the Earth Belt is born within the navel. If elixir-fire flares within and the five viscera grow parched and hot, immediately close the eyes and sit in repose, connecting the Earth Belt beneath the Flowery Pond to allow the breath to circulate internally, practicing the method of the celestial cycle.\n\nAfter closing the breath, the true water of the cinnabar field gradually waxes like the sun and moon. By the ninth day, the spirit-water rises to the Twelve-Storied Tower, and the cinnabar pearl is immersed within it, purging all fire-toxin. Thereafter, no sign of parched heat remains. On the ninth night at the hour of zi, close the breath and draw the spirit-water into the Muddy Pellet, passing through the Spine Bridge, then returning to the cinnabar field to complete the work.\n\nThe power of creation returns to the four limbs. After a thousand days, the five viscera are entirely transformed, and the fetal qi becomes the immortal viscera. One merely senses the aperture at the crown opening, emitting black and red qi—this is the dispersal of fetal qi. When the thousand days are fulfilled, the crown’s aperture closes, the fetal qi is exhausted, and the seventh revolution’s work is complete.\n\nFrom this point onward, the five viscera are firm and solid, no longer receiving grain or fire-cooked food. If at times elixir-fire flares within the five viscera and fire issues from the nostrils, enter water and seal the nasal breath. Then the cinnabar pearl and spirit-fire will emerge from the yin gate, floating upon the water’s surface like an ox playing in the yellow. Wait until the spirit-water beneath the tongue flows like a spring, whereupon the elixir-fire will naturally subside. Draw the cinnabar pearl back into the Kun Gate, and by the eighth revolution, the Earth Belt is perfected. With no fire-toxin remaining, bathing is no longer required.\n\n**Song of the Eighth Revolution:**\nAt the eighth revolution, the Earth Belt hangs down to return to the origin,\nLike an infant within the mother’s womb, enveloped in the fetal sac.\nThe stabilized qi cannot escape and suffers no loss—\nFor the infant’s navel holds the umbilical cord in its mouth,\nThe breath’s coming and going unceasing, this is natural womb-breath, hence no loss.\nWhen the heart-elixir completes its eighth revolution,\nA navel cord regenerates within the navel, resembling the infant’s form,\nRestoring the Dao of the primordial origin—thus it is called *returning to the origin, the Earth Belt hangs down*.\n\nCoursing through the womb-breath to nurture the infant—\nThe perfected one obtains the Earth Belt and circulates the qi of the celestial cycle, thus attaining longevity.\nWhenever fire flares to scorch the elixir-cavern,\nPlunge deep into the cool spring to play with the red turtle.\nThe red radiance is the cinnabar pearl; after the eighth revolution,\nThe inner refinement of true fire eliminates the affliction of heat-toxin.\nWhenever fire flares, hold the Earth Belt in the mouth,\nSeal the breath for nine days, and on the ninth day,\nTrue water will surge from the cinnabar field like a gushing spring,\nRising to the Twelve-Storied Tower, the cinnabar pearl within the spirit-water,\nLike a turtle sporting in the waves.\nFrom this point onward, true fire holds no toxin,\nAnd the affliction of elixir-heat vanishes—\nThus it is said: *plunge deep into the cool spring to play with the red turtle.*\n\n**Looking Over the River South:**\nWithin and without, all is pervaded—\nOnly at the eighth revolution does one return to the origin.",
      "overlap_context": "ater will surge from the cinnabar field\nLike a gushing spring, rising to the Twelve-Storied Tower.\nThe cinnabar pearl will float within this divine water,\nLike a turtle sporting in the waves.\n\nFrom this point onward, true fire holds no toxin,\nAnd the affliction of elixir-heat vanishes.\nThus it is said: *plunge deep into the cool spring to play with the red turtle.*\n\n**Looking Over the River South:**\nWithin and without, all is pervaded—\nOnly at the eighth revolution does one return to the origin.",
      "start_char": 7794,
      "end_char": 8766,
      "start_sentence": 330,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.327006578445435,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "丹至八转，外之形体，内之五藏，尽皆换遍。 复生地带，如同婴儿之状，故曰返本还元也。 地带长垂生坎户，周行胎息贯天门， 地带，脐之带也，生於脐中，属北方坎卦，故曰生坎户也。 天门，华池之窍也，地带贯於口中，行周天之息，以调火侯，故曰周行胎息也。 太始道方存。 太始之道，生天地之始，丹成八转一始，天地造化之初也。 纯一体 内外纯成阳也，无一点阴气，故曰纯一体也。 黑赤气常喷， 黑赤者，神火之气也，丹成八转，息之往来，从鼻中出，常见黑赤之气，故曰气常喷也。 丹火发来烧内境，泠泉深处浴猴狲， 丹火之患，运神水以制之，更无丹火之候。 盖丹者心珠，心象猴也，以神水浴丹，其神丹浮沉於神水之内，故曰浴猴狲也。 神水赤龟吞。 丹浮神水之中，如龟之吞水，取其状也。 口诀 丹成八转，地带生於脐中，若遇丹火内发，五藏燥热，即闭目宴坐，以地带接於华池之下，使息气内通，行周雨运用之道。 自闭息之后，丹田真水日月渐长，至第九日，神水直至重楼十二环，丹珠浸於神水之中，去尽火毒。 自此之后，更无发燥之候，至第九夜子时，闭息吸神水入泥丸，过夹脊，复入丹田，以毕其功也。 九转歌 九转逍遥道果全，",
      "translated_text": "When the elixir reaches the eighth revolution, the outer form and the inner five viscera are entirely transformed. The Earth Belt regenerates, resembling the state of an infant—thus it is called *returning to the root and restoring the origin*.\n\nThe Earth Belt hangs long, giving life to the Kan Gate;\nCircling in fetal breathing, it pierces the Heavenly Gate.\nThe Earth Belt is the navel’s cord, born within the navel and belonging to the northern Kan trigram—hence it is called *giving life to the Kan Gate*. The Heavenly Gate is the aperture of the Flowery Pond; the Earth Belt connects to the mouth, circulating the breath of the celestial cycle to regulate the fire’s timing—thus it is called *circling in fetal breathing*.\n\nThe Dao of the Great Beginning now abides.\nThe Dao of the Great Beginning is the origin of heaven and earth; when the elixir completes its eighth revolution, it is the first moment of heaven and earth’s creation.\n\nA single unified body—\nWithin and without, it is purely yang, without a trace of yin qi—hence it is called *a single unified body*.\n\nBlack and red qi constantly sprays forth.\nBlack and red are the qi of spirit-fire; when the elixir completes its eighth revolution, the breath’s coming and going issues from the nose, and one constantly sees black and red qi—thus it is called *qi constantly sprays forth*.\n\nWhen elixir-fire flares to scorch the inner realm,\nPlunge deep into the cool spring to bathe the gibbon.\nThe affliction of elixir-fire is controlled by mobilizing spirit-water, leaving no sign of elixir-fire. The elixir is the heart’s pearl, and the heart resembles a gibbon—bathing the elixir in spirit-water, the divine elixir floats and sinks within the spirit-water—hence it is called *bathe the gibbon*.\n\nThe spirit-water and red turtle swallow.\nThe elixir floats within the spirit-water like a turtle swallowing water—this describes its form.\n\n**Oral Instructions:**\nWhen the elixir completes its eighth revolution, the Earth Belt arises within the navel. If elixir-fire flares internally and the five viscera grow parched and hot, immediately close the eyes and sit in repose, connecting the Earth Belt beneath the Flowery Pond to allow the breath to circulate within, practicing the method of celestial circulation.\n\nAfter closing the breath, the true water of the cinnabar field gradually waxes like the sun and moon. By the ninth day, the spirit-water rises to the Twelve-Storied Tower, and the cinnabar pearl is immersed within the spirit-water, purging all fire-toxin. From this point onward, there is no further sign of parching heat. On the ninth night at the hour of *zi*, close the breath and draw the spirit-water into the Mud Pill Palace, passing through the Spine’s Bridge to return to the cinnabar field, thus completing the work.\n\n**Song of the Nine Revolutions:**\nThe nine revolutions bring carefree attainment of the Dao’s fruit...",
      "overlap_context": "h day,\nTrue water will surge from the cinnabar field like a gushing spring,\nRising to the Twelve-Storied Tower, the cinnabar pearl within the spirit-water,\nLike a turtle sporting in the waves.\nFrom this point onward, true fire holds no toxin,\nAnd the affliction of elixir-heat vanishes—\nThus it is said: *plunge deep into the cool spring to play with the red turtle.*\n\n**Looking Over the River South:**\nWithin and without, all is pervaded—\nOnly at the eighth revolution does one return to the origin.",
      "start_char": 8766,
      "end_char": 9282,
      "start_sentence": 368,
      "end_sentence": 389,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.13702654838562,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "更无运用。 三千功行作真仙， 九转丹成，其内三千行积於外，丹成功满，方得上升。 故许旌阳徐蛟龙之害，乃得上升，孙思邈救万病，乃得飞举，皆三千功成，方上升也。 金丹玉简宣清诏， 三千功成之后，玉皇赐诏，接以金丹，以除尘厌。 金丹入腹，地带自落，上朝玉皇，名在仙籍也。 鹤驾云车赴洞天。 望江南 丹九转，纯一太初颜， 丹成九转，与天地齐年，纯一太初，大道之元也。 丹成之后，形与道合，颜同太初。 内外无为常抱朴，纵横海外与人间，功行积丘山。 青阙诏，玉简赐金环， 赐玉简金环，为符契，以朝天帝也。 饮罢刀圭乘羽驾， 刀圭服金丹也，金丹入腹，地带自落，足下云生，乘羽毛为骑，以赴天阙也。 旌幢箫鼓过天关，朝帝列仙班。 天乐来迎，箫韶合奏。 内丹诀竟",
      "translated_text": "No further practice is required. With three thousand merits and deeds, one becomes a true immortal. When the nine revolutions of the elixir are complete, the three thousand deeds accumulate externally as the elixir achieves full perfection—only then may one ascend. Thus, Xu Jingsun subdued the flood dragons and thereby ascended, and Sun Simiao healed myriad illnesses before he could take flight; both first completed three thousand merits before ascending.\n\nThe Golden Elixir and Jade Tablet proclaim the imperial decree. After three thousand merits are fulfilled, the Jade Emperor bestows a decree, presenting the Golden Elixir to dispel worldly defilements. Once the Golden Elixir enters the abdomen, the Earth Belt falls away of itself, and one ascends to pay homage to the Jade Emperor, their name recorded in the immortal register.\n\nThe crane-drawn cloud chariot departs for the grotto-heavens.\n\n**To the Tune of \"Gazing at the Southern River\"**\nThe elixir completes its nine revolutions,\nPure and unified in the primordial countenance.\nWhen the elixir achieves its nine revolutions, it shares the age of heaven and earth;\npure and unified in the primordial, it is the origin of the Great Dao.\nAfter the elixir is complete, form merges with the Dao,\nand one’s countenance becomes that of the primordial.\nInternally and externally, non-action ever embraces simplicity,\nroaming freely beyond the seas and among men,\nwhile merits and deeds accumulate like mountains.\nThe azure palace’s decree,\nthe Jade Tablet and golden ring bestowed,\nserve as tokens to pay homage to the Heavenly Emperor.\n\nHaving consumed the *daogui*, one rides the feathered chariot—\nthe *daogui* is the Golden Elixir ingested.\nOnce the Golden Elixir enters the abdomen, the Earth Belt falls away,\nclouds arise beneath the feet, and one rides upon feathers as a steed to approach the celestial gates.\nBanners and pennants, flutes and drums pass through the heavenly barriers,\nto join the ranks of immortals in audience before the Emperor.\nHeavenly music welcomes, the *xiaoshao* harmonizes in concert.\n**Here ends the Inner Elixir Formula.**",
      "overlap_context": "t-water rises to the Twelve-Storied Tower, and the cinnabar pearl is immersed within the spirit-water, purging all fire-toxin. From this point onward, there is no further sign of parching heat. On the ninth night at the hour of *zi*, close the breath and draw the spirit-water into the Mud Pill Palace, passing through the Spine’s Bridge to return to the cinnabar field, thus completing the work.\n\n**Song of the Nine Revolutions:**\nThe nine revolutions bring carefree attainment of the Dao’s fruit...",
      "start_char": 9282,
      "end_char": 9632,
      "start_sentence": 390,
      "end_sentence": 409,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.742909908294678,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}