{
  "source_id": "凝阳董真人遇仙记",
  "source_file": "chunked_daozang\\凝阳董真人遇仙记.json",
  "total_chunks": 8,
  "total_original_chars": 6748,
  "total_translated_chars": 38731,
  "total_translation_time": 195.95949459075928,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
    "category": "记传类"
  },
  "full_translation": "**The Record of Master Dong of Ningyang’s Encounter with Immortals**\n*Sutra Title: The Record of Master Dong of Ningyang’s Encounter with Immortals*\n*One fascicle. Originally compiled by Yang Zhaochuang.*\n\n**The Record of Master Dong of Ningyang’s Encounter with Immortals**\nCompiled by Lu Zhaowen\n\nThe Master’s family hailed from Long’an. His original surname was Muhu, though he was commonly known as the Dong clan. His personal name was Shouzhi, courtesy name Kuanfu, and Daoist appellation Ningyangzi. By lineage, he was a Jurchen. His father never held office, and his mother passed early. He married a woman of the Xilie clan, who bore him one son and two daughters. As his ancestors had served in official posts in the Shaanxi region, he settled in the Zhongnan Mountains. In the *gengzi* year of the Dading era, a nighttime decree from the prefecture summoned him for military conscription. Later, he was appointed as a *mouke* (company commander) and transferred to defend Woyang Garrison in Longzhou, where he established his household.\n\nThe Master was of simple and sincere disposition, his bearing majestic. From childhood, he was profoundly filial; in adulthood, he stood apart from worldly customs. Though enlisted in the military, his conduct and deeds surpassed his peers. He yearned for the mystic Dao yet lacked the means to practice it. Moved by his encounters with the Three Divine Immortals—Zhengyang, Chunyang, and Haichan—who discerned his eons of cultivation and repeatedly manifested to guide him, they clarified his past causes, earnestly enlightened him, and even afflicted him with illness to disrupt his official duties, leading to his dismissal from military service. Thus, the Master devoted himself wholeheartedly to the teachings.\n\nThereafter, his ailment did not abate. The Supreme Immortals bestowed upon him the *daogui* (medicinal spoon) and sealed his hidden afflictions. They conferred the Iron Horse Star Seal, commanding him to wield it, and granted him the power of talismanic water and medicine to aid the world. They left poems to exhort him, offered wine to console him, tested his conduct, prodded his shortcomings, descended to his hermitage, or met him upon the road. In broad daylight, they appeared before him with such clarity—never had his encounters with the divine been so intimate.\n\nSince his meeting with the Perfected Ones, the Master abandoned secular life, left home, and built a hermitage to cultivate his resolve. He wandered between Deshun, Qin, and Long, ever awakening to deeper truths. Wherever he lodged, he followed the conditions of his practice, and many came to believe in him. When supplicants sought medicine, it descended; when he healed the sick, they recovered. His words summoned thunder, and his prayers brought rain. He projected his spirit into dreams, manifesting as an emanation body. For all who harbored thoughts—whether good or ill—he knew them in advance. His insights flowed into songs and poems, his utterances astonishing yet free of worldly artifice.\n\nThe Perfected One was born on the twenty-eighth day of the twelfth month in the *gengchen* year of the Zhenglong era. In the *gengzi* year of the Dading era, he was registered in the military rolls. On the first day of the ninth month in the *yimao* year of the Mingchang era, he was dispatched to the southern fortress of Deshun Prefecture. On the eleventh day at the hour of *chen*, as he dined with his company, he suddenly saw a divine being—tall of stature, nearly eight *chi*, his hair bound in two topknots, his complexion deep crimson, his beard and whiskers thick and fine. Clad in a blue robe and straw sandals, he bore a sword and strode to the gate, calling out: *\"I have concealed you within the army, so I have come to receive you. Why do you not depart?\"*\n\nThe Perfected One started in alarm and fell from his bed, losing consciousness at once. The others lifted and supported him. For seven days, he remained in a stupor, his limbs unable to bend or stretch. The fortress commander reported his condition to the headquarters, where officials and physicians examined him and diagnosed paralysis. Thus, he was granted an extended leave and returned to his hometown in Woyang to seek treatment.\n\nOn the third day of the third month in the *bingchen* year of the Cheng’an era, at the hour of *wei*, he again saw the divine being—this time in a white robe—standing at his door. The figure pointed at him and laughed heartily. The Perfected One rose from his outer couch to pay homage, but the being vanished in an instant. He asked his family: *\"That divine being who came—do you recognize him?\"* They replied: *\"We do not.\"* The Perfected One then instructed them: *\"Tonight, sweep and purify the house thoroughly. Perhaps the divine being will descend again to save my life.\"* His family did as he said.\n\nOn the fifteenth day of that month, at midnight, the divine being descended once more. Light filled the room as bright as day, and a strange fragrance permeated the air. Standing before him, the being said: *\"Because you failed to awaken, you fell gravely ill. I have come especially to save you.\"* From his怀中, he took three pellets of elixir and placed them to stabilize his three *hun*; seven doses of medicine to settle his seven *po*. He instructed: *\"Take this to dispel all perverse *qi*. Your body will burn like fire—do not be alarmed.\"* With that, he vanished.\n\nAfter consuming the elixir and medicine, the Perfected One’s illness was indeed cured. On the twenty-seventh day at the hour of *wu*, the divine being reappeared. Overjoyed, the Perfected One bowed in gratitude. The being asked: *\"Do you recognize Zhong?\"* The Perfected One replied: *\"I do. Every temple and abbey has one.\"* The divine being laughed: *\"You only know the bell that is struck, but not whence its sound comes. I am Han Zhongli. For generations, you have cultivated the Dao, yet your merit remains incomplete. I have come to bestow upon you an iron horse—keep it with you always and do not discard it lightly. This year, the *qi* of the times will bring widespread pestilence. I also grant you dharma-water and talismanic medicine to save others. Once your merit is fulfilled, you may burn incense each dawn to summon medicine, and I will descend it to you.\"*\n\nThe Perfected One followed his instructions, and the medicine indeed descended from the void. All who were ill and took it recovered. Whenever he summoned the medicine, the divine being often appeared in the sky, and those who prayed with utmost sincerity also witnessed him.\n\nThe Perfected One, when drawing dharma-water, always drank first before administering it to others. He drank copiously each day, though none could fathom the quantity. Those who encountered him by chance were invariably enlightened by his words.\n\nOn New Year’s Day in the *dingchou* year, he saw a strange figure—a tall man with a sallow face, his hair unkempt, his feet bare, his body covered in matted hair, a hemp rope tied at his waist. He carried his hands on his shoulders, walked with his face upturned, and begged in the marketplace, crying: *\"Alms of a single coin!\"* To those who gave him two, he said: *\"A beggar asks for but one coin—why give two?\"* After receiving the money, he pointed and sighed: *\"You have eyes, yet it took these four words to make me wait a whole day for you.\"* With the coins, he bought meat, wrapped the meat and any remaining money in paper, and carried it to the riverbank. There, he scooped sand with his hands, buried the wrapped meat, and piled the earth into a mound. He planted a branch atop it, hung paper money upon it, and placed dates and pears beside it. Then, sitting with his hands on his shoulders, he waited until a crowd gathered. Pointing, he said: *\"Call for dates and pears! How will you date after this? How will you pear after this?\"* With that, he plunged his hands into the earth, digging up the buried meat, and scattered it forcefully, crying: *\"No dates, no pears—just wait and see!\"*\n\nFor months, he wandered in this manner, and the people called him the *\"Hands-on-Shoulders Master.\"* Whenever he met the Perfected One, they spoke of cultivating the Dao, using every metaphor to urge him toward leaving the household life. The Perfected One grasped his meaning and said: *\"This disciple wishes to follow you.\"* The master replied: *\"You are not yet ready to go. When the time comes, I will take you.\"* The Perfected One asked: *\"May I know your dharma-name?\"* The master said: *\"I am Huangmian Liu.\"* *\"And where are you from?\"* *\"Yincheng in Xiezhou.\"* When asked about his practice, the master demanded paper and wrote:\n\n*\"When the Three Corpses are slain by water,\nGaze westward as it flows to Yangzhou.\nWhen weary, it’s best to withdraw your head.\"*\n\n*\"One word holds spirit,\nOne spirit holds words.\nIf spirit and words are not trusted,\nCan man be so?\"*\n\n*\"Words disregard form,\nOnce spoken, they cannot be recalled.\"*\n\nWhen essence is stabilized, qi is stabilized; when qi is stabilized, spirit abides. When essence, qi, and spirit gather without scattering, this is true daily practice. He also left a verse:\n\n*\"Coming—no cultivation, no form or substance.\nGoing—no cultivation, no form or substance.\nWithin it, seize the pivot of creation’s mechanism;\nOnly when weary is non-action truly possible.\"*\n\nThe Perfected One deeply marveled at his words.\n\nFrom then on, the master departed, and the Perfected One often thought of him. In the eighth month, during the Mid-Autumn Festival, the Perfected One competed with others in archery, drinking and feasting to excess, and his illness flared up again. In the tenth month, an official summons from Longzhou arrived for inspection, but due to his grave condition, he was removed from military records and no longer returned to his former seclusion. That very day, he was carried by litter directly to the White Slope Hermitage. After barely half a year, medical treatments proved ineffective.\n\nOn his birthday in the final month of winter, he reproached himself: *\"I suffer deeply from this illness—have the sages sent this punishment? When will I recover?\"* On the New Year’s Day of the *Chengan* *wuwu* year, he suddenly heard a voice from the void: *\"Having returned to the Dao, how dare you still consume wine and meat? Your illness stems precisely from this.\"* Upon hearing these words, the Perfected One vowed to reform and swore never again to violate the highest precepts.\n\nAt noon on the seventh day, a master appeared—yellow-faced, with a black headscarf and long beard, clad in a hempen robe and straw sandals, carrying a double load on a pole. He asked: *\"What ailment afflicts you?\"* The Perfected One told him of the pain in his waist and knees, rendering him unable to walk. The master asked how long he had suffered, and the Perfected One replied: *\"Nearly half a year.\"* The master said: *\"I will apply acupuncture now. By midnight tonight, you will be cured—otherwise, it will not be so.\"*\n\nHe helped the Perfected One sit, leaning against his knee, then palpated the points and applied the needles: first at *Tianmen*, then *Baihui*, two needles at *Hegu*, and two at *Yongquan*. After needling, the master prepared to leave, but the Perfected One asked his name. He replied: *\"Liu.\"* Though urged to stay the night, the master refused. At midnight, a clap of thunder resounded, and the Perfected One started awake—his waist and knees were limber, the illness as if plucked away.\n\nThat night, heavy snow fell until dawn. Overjoyed, the Perfected One swept the snow and went to a neighboring hermitage, where all were astonished. They knew he had encountered the healing power of a perfected immortal.\n\nOn the fifteenth day of the tenth month in the *Chengan gengshen* year, while residing at a hermitage in Woyang, he suddenly met the divine being from before. The Perfected One quickly knelt before him, and the immortal said: *\"Because you failed to awaken, I first bestowed upon you the Iron Horse. Now, I grant you the Seven-Star Treasure Seal—use it for your cultivation. The seal and horse are primordial objects, the Seven-Star Wisdom Sword. Cultivate according to the method, and I will guide you further. Do not leak this secret—remember, remember!\"*\n\nThe Perfected One bowed in gratitude and looked up, but the immortal had vanished.\n\nOn the seventeenth day of the first month of winter in the *Taihe renxu* year, at the hour of *yin*, he suddenly heard a voice descending from the void, saying: *\"We shall meet at Sanhekou.\"* The Perfected One hurried forward in alarm. Arriving at the southern bank of the ravine at Xuchuan Stream, he saw two divine beings already seated upon a boulder—none other than Immortals Zhong and Lü. The Perfected One knelt before them in reverence. Immortal Zhong said: *\"Your body is thick with filth and grease—why not enter the water and wash it clean?\"* The Perfected One replied: *\"As you command.\"* The immortal then pointed to a great fish in the water and asked: *\"Can you catch it?\"* The Perfected One waded upstream and grappled with it, but the fish eluded him. The immortal next pointed to a large turtle and said: *\"Can you mount its back?\"* The Perfected One strained to climb upon it, but could not. The two immortals clapped their hands and laughed: *\"You cannot even catch a fish or mount a turtle—wait until you have washed away your filth and can seize them. Then I shall guide you further. Now look to the southwest.\"* As he raised his gaze, the two immortals vanished in an instant. He emerged from the water, dressed, and bowed toward the heavens in gratitude before returning to his hermitage. Upon arrival, he felt his entire body suffused with searing heat, which persisted for ten days. Each morning, he bathed in the Three Rivers, and soon he no longer needed to eat. He sensed a profound awakening in his heart and often fell into silent reverence for the immortals.\n\nIn the *guihai* year, though the Perfected One had entered the Dao, his family ties remained. His wife, Lady Xilie, witnessed his extraordinary encounters with the immortals and, moved by devotion, relinquished her attachments so that he might formally take monastic vows under a master. On the night of the fifteenth day of the second month in the *yichou* year, Immortal Zhong descended into his earthen chamber. Divine radiance illuminated the room, bright as daylight. The Perfected One knelt before him, and the immortal instructed: *\"Do not dispense medicine to others, lest you endanger their lives and diminish your own merit. When Lü and I met you at Sanhekou and bade you wash your filth and seize the fish and turtle, did you grasp the meaning?\"* The Perfected One replied: *\"No.\"* The immortal said: *\"The filth and grease are the impurities of the heart; the fish and turtle are your nature and life. In cultivation, one must only eliminate defilement and still the mind. When the spirit-terrace is empty, nature and life will naturally unite. Refine the Golden Elixir, shed the mortal husk, ascend in flight, and roam the celestial palaces—remember this well.\"* He then left a verse on the practice of alchemy:\n\n*\"I urge you to practice alchemy—\nYet it profits not the heart.\nTo save others while neglecting yourself,\nIs to lose sight of your own path.\nThough you may heal, and all call you good,\nIf resentment arises, the debt spans lifetimes.\nSuch alchemy—how can it not grieve?\nPonder deeply, yet the scriptures remain unread.\nI now counsel you:\nAlchemy wearies the spirit.\nIf you disobey, you shall sink forever.\nShun sound and form, let go of right and wrong.\nI urge you again: do not indulge in greed or wrath.\nOne day, this old frame will crumble—\nWhen will you attain liberation?\nCherish your qi, nurture your spirit,\nRoot yourself deeply.\nCorrect your faults, return to truth,\nAnd all past karma shall dissolve.\nAbide in purity and non-action,\nAnd merge with the Dao in reality.\nReceive others’ offerings with a single mind,\nDevoted to the Way.\nIf you do not advance, ten thousand calamities shall befall.\nI now reveal the secret—awaken and remember:\nWhen nature rests and life abides,\nYou shall soar lightly through the heavens.\nIf you do not reform, one mistake is eternal.\nFollow this path in cultivation,\nAnd I shall guide you further.\"*\n\nHe then took a small gourd, poured wine, and offered it to the Perfected One. After drinking, he fell into a profound trance, remaining insensible for seven days before gradually awakening. He saw that the ritual implements in the earthen chamber had turned to ash, and the room was filled with an unceasingly fragrant aroma. From that moment onward, he attained sudden enlightenment.\n\nOn the morning of the Lantern Festival in the *Da’an jisi* year, while in Woyang, he suddenly heard a voice descending from the void: *\"Your karmic affinity lies with De Shun—remember this well.\"* The Perfected One rushed out to pay homage, but saw nothing. On the twenty-fifth day of the second month, he traveled to Shunde to persuade his disciple Lu Ziran to leave the household life. Upon meeting, their words aligned as if by divine accord.\n\nIn the *gengwu* year, De Shun established a hermitage. On the seventh day of the second month of winter, as night deepened, the Perfected One strolled through the front courtyard, gazing at the celestial patterns. Suddenly, two immortals passed by on a cloud of radiant hues. Startled, he changed his robes, lit incense, and saw the Supreme Yang Immortal in a green robe and straw sandals, accompanied by another immortal with a yellow complexion, a fine beard, a black headscarf, and crimson garments. The Supreme Yang supported the other immortal’s right shoulder as they stood beneath a great apricot tree. A glow dazzled his eyes, and a fragrant breeze caressed him. The Perfected One knelt in reverence. The Supreme Yang Immortal said: *\"When you were in Woyang, a man with a hunched shoulder appeared to you. For months, you did not awaken—who did you take him for?\"* The Perfected One replied: *\"At the time, he claimed to be Liu of Huangmian in Jiezhou.\"* The Supreme Yang pointed and laughed: *\"That was none other than Lord Haichan. Later, at Baipo Hermitage, another master sealed a method for you, curing your illness—he, too, was Lord Haichan. In a past life, you were also a cultivator of the Dao. Haichan and I once guided you and bestowed upon you the Daoist name Ningyangzi and the Dharma name Yu Zhen. Today, Haichan and I have returned to clarify your past causes and restore your former titles, adding the name Helao Laoren and the Dharma name Shouzhi. We now teach you the Threefold Unity, the method of inverting water and fire, the art of refining the Golden Elixir and returning the cinnabar, the secret of the Yellow Sprout’s desiccation and mercury’s immobility, and the way of mercury and lead congealing, spirit and qi uniting.\"* He then recited a poem:\n\n*\"Preserve the spirit, nurture the qi, and the body is at peace;\nMercury congeals, lead solidifies, and all is natural.\nTranscending the mundane, entering the sacred, beyond the world—\nWhy fear not becoming a Great Luo Immortal?\"*\n\nHe continued: *\"I once bestowed upon you the Iron Horse and the Seven-Star Treasure Seal, yet you still did not awaken. Now I shall explain: long ago, I transmitted the sword method to Dongbin and bade him cultivate with it. Today, I pass the Iron Horse and Star Seal to you—equal to Dongbin’s.\"*\n\nHe then composed two gnomic verses. The first read:\n\n*\"The Seven-Star Treasure Seal now holds true sway,\nIts radiance once more illumines the boundless realm.\nThe Iron Horse repels evil as a sword might,\nWhile tortoise and serpent coil in mutual embrace.\"*\n\nThe second verse went:\n\n*\"Seven times I have raised you from profoundest folly,\nThough hoary-haired and aged, you surpass the wise.\nShould you tarry and descend to the Yellow Springs,\nThe human form once lost will never be regained.\"*\n\nThe Immortal of Sea-Toad also left a verse:\n\n*\"In former lives, a poor man known as Sea-Toad,\nNow I reveal the causes of past karmic threads.\nHad I not cultivated through kalpas untold,\nWho would repeatedly lift the worthy from their depths?\"*\n\nHe then presented a long five-character poem:\n\n*\"Now I speak of the Great Dao,\nRare are those who walk its ancient Way.\nSecure the mercury gourd well,\nLest it be stolen by thieves unseen.\nIn purity and true non-action,\nNot even a mote of dust disturbs.\nA single speck of black cloud gone,\nThe bright moon shines in crystalline clarity.\nSeal the mouth, guard the tongue,\nSweep clean the six senses.\nThe black turtle of the Northern Sea,\nThe red serpent of the Southern Mountain entwine.\nWithin the grotto, snowflakes drift,\nThe crucible and furnace shape themselves.\nRefine the priceless treasure,\nTogether we shall ascend to Penglai Isle.\"*\n\n*\"This is the secret formula of true cultivation—do not hoard it for yourself alone. You also have several disciples, who were your dharma kin in past lives. Once, on Mount Wannu, you established a hermitage at the Cave of Ascended Perfection, naming it the Congealed Yang Abode, and kept company with Master Tongxuan, Chen Xindao. Now, disciples such as Gushenzi Ma Shanneng follow you in cultivation. The Cave of Ascended Perfection was where the Immortal Zhang Guolao once concealed himself. Master Tongxuan is now known as Bingyangzi Chen Zhihe. I now bestow upon them dharma names and titles. First, have them take vows, then transmit the teachings—only then may they cultivate. Remember this well; be cautious and vigilant.\"*\n\nThe Perfected One bowed in gratitude. Looking up, he saw the two immortals once more ascend upon colored clouds. Reflecting upon the immortals’ words about his past lives, he suddenly attained profound awakening.\n\nIn the year *xinwei*, he traveled to Dezhen Hermitage, where fellow Daoists, hearing rumbling like thunder from within his abdomen, marveled. They requested two quatrains to share with the assembly.\n\nOn the twenty-sixth day of the second lunar month in the *guiyou* year of the Chongqing reign, he journeyed to Woyang with his master-uncle, Master Chen. As dusk fell and yellow dust obscured the sky, they arrived at Liujiang Gorge and suddenly encountered the two immortals—Zhengyang and Haichan—each standing astride a spotted deer. The Perfected One prostrated himself. Zhengyang said: *\"I previously imparted to you the secret formulas of true cultivation, but the events of that night were chaotic, and I feared you did not fully grasp them. Now I remind you again: exhort all men and women to return to the Dao and their original nature. Refine the Great Elixir, nurture the qi of harmonious equilibrium, and employ true Water and true Fire. Let mercury and lead congeal, and through refinement, form the Elixir. If you do not settle the mind and stabilize intention, calm the qi and nourish the spirit, how can you escape the suffering of the turning wheel? Do not stir up waves or kindle the fires of desire. Anger weakens the spirit; wrath scatters the qi. When qi scatters, the person perishes; when the person perishes, they become a lowly ghost—when will their release come?*\n\n*The* Yin Fu Jing *states: ‘Fire is born from wood, and calamity inevitably follows. Treachery arises in the state, and when the time comes, it collapses.’ One who knows this and cultivates is called a sage. When a person gives rise to anger, fire is born, and desire arises. When desire arises, form and shadow vanish, and in darkness, unawares, the body is harmed. Do not indulge the Six Bandits or the Three Corpses. Instead, eradicate the restless steed, sever all entanglements. Lest you doubt: Fire overcomes Metal, Metal overcomes Wood, Wood overcomes Earth, Earth overcomes Water, Water overcomes Fire—this is the law of the Five Phases’ mutual conquest. Yet Metal generates Water, Wood generates Fire—this is the earthly cycle’s natural progression, which entails birth and death. But when Water generates Metal and Fire generates Wood, this is the heavenly cycle’s reversal—how then can there be birth and death? In essence, the key to cultivation lies in nurturing the Metal within Water—this is the method of inverting the Five Phases. Should one meet me even once, for three lifetimes they will not fall into hell. Hereafter, it will be difficult to see me again—remember this well. If you leak celestial secrets or transmit them to the unworthy, misfortune will befall you, and punishment will surely follow. When you encounter one of sincere faith, first have them swear an oath before their ancestors, then you may transmit the teachings.\"*\n\nThe Perfected One bowed in gratitude and asked questions, but the two immortals had already ascended. Looking around, he saw another immortal standing among the pines and rocks of a sheer cliff. Just then, his master-uncle arrived. The Perfected One asked: *\"Did you see the immortal among the rocks?\"* His master-uncle replied: *\"I saw nothing.\"* The Perfected One prayed with utmost devotion and bowed again. Then, indeed, he saw the immortal—clad in a black headscarf and crimson robe—appear among the pines and rocks. His sleeves fluttered in the wind as he strolled away along the winding path. Though the others gazed and bowed, they could not see him.\n\nThe master-uncle then returned to Dezhen. It was the middle of the fourth lunar month. In the *jiayou* year of the Zhenyou reign, the Perfected One traveled from Dezhen to Woyang. He set out on the fifteenth day of the ninth month and arrived in Longzhou on the eighteenth, lodging at the South Gate. Around the *wei* hour, he suddenly saw the immortal Zhengyang standing by the river. Zhengyang asked: *\"Where are you going?\"* The Perfected One hastily bowed and replied: *\"This disciple’s kiln in Woyang has been seized by others. I have come to address this matter.\"* The immortal said: *\"Is the kiln worth money? Is your life worth money? You recognize only the kiln but are blind to true emptiness, clinging to false emptiness. You still do not understand—you are falling into deluded emptiness.\"* The Perfected One asked: *\"What is true emptiness?\"* The immortal replied: *\"True emptiness pervades and fills the void, unstained and unattached, with the singular spirit ever-present.\"* *\"Do you recognize it?\"* The Perfected One said: *\"I do not.\"* The immortal exhaled a breath, and the Perfected One suddenly awakened. In an instant, the immortal vanished.\n\nArriving in Woyang, he was filled with trepidation and dared not speak of the matter he had come to address.\n\nAfter more than a month, he returned to DeShun, where he encountered Daoist friends from Zhen’an, including Zhang Yilang. They asked: *\"What is the meaning of the winter solstice, when the first yang begins to rise?\"* The master composed a verse in response.\n\nIn the year *Dingyou* of the Zhenyou era, Wang Jinqing of DeShun invited the Perfected One to a vegetarian feast. Afterward, he escorted the master back to the hermitage. As dusk fell, Wang prepared to take his leave, but the Perfected One insisted he stay the night. *\"Take my iron horse and place it in the upper chamber,\"* the Perfected One instructed. *\"If you hear thunder, do not be afraid.\"* Wang followed the master’s words precisely.\n\nThat night, as he sat dozing, suddenly a thunderclap shook the entire building, nearly uprooting the pillars. The household cried out in alarm, but Wang remained unmoved. When they lit a lamp to check on him, they saw that the fire had singed his beard and mustache. Only then did his family rouse him, and he slowly regained awareness.\n\nThe next day, the entire household prepared incense and flowers, carried the iron horse on their heads, and returned it to the hermitage. They recounted the events in detail. The Perfected One said: *\"Yesterday, when the thunder struck, you did not awaken—do you understand the reason? There was a malevolent dragon hidden in the sword hanging on your chamber wall. The celestial thunder had come to seize it. If not for my iron horse, the outcome would have been different.\"* Wang returned home and examined the sword, finding the dragon’s traces scorched into the blade, which had burst from its scabbard and fled. Claw marks still remained on the chamber wall. The Perfected One manifested such transformations in response to circumstances, yet none could fathom them.\n\nIn the year *Bingzi*, the Perfected One returned to DeShun from the Luo River. Arriving at Shousheng Abbey, as he walked among the pines behind the hall, he suddenly encountered two immortals: Pure Yang and Hai Chan. They said: *\"Throughout the four seas, I have taken the form of a beggar, exhorting people endlessly, yet none heed me. Their karmic obstructions run deep—bound by greed, jealousy, and harmful deeds. What can be done? What can be done?\"* They recited a verse:\n\n*\"Daily I wander the four seas,\nA beggar in the bustling streets each day.\nExhorting endlessly, yet none heed—\nWasting spirit in vain, blinded by worldly ties.\nI urge you: life and death are grave,\nYet fools persist, bound by karma’s weight.\nUnwilling to cultivate truth, they break heaven’s law,\nDoomed to suffer in Dengdu for ages untold.\"*\n\nAfter reciting, they charged the Perfected One with spreading their teachings to awaken others. Hai Chan added: *\"We observe the deluded masses of the world, accumulating karma in myriad ways, yet scarcely one in ten thousand awakens. You must admonish men and women alike, guiding them toward the good Dao. Cultivate hidden virtue outwardly, and inwardly fortify your spirit. If your true nature remains unobscured by desire, your true heart will naturally align with the Dao of Heaven. This illusory body is but a temporary convergence of the four elements—why cling to it, why cherish it?\"* He then transmitted a verse to the Perfected One:\n\n*\"Listen closely to my teachings,\nI speak to my disciples—do not obscure your true heart.\nIf you fail to repay karmic debts,\nYou’ll enter the wheel of rebirth, your human form lost.\nHair turns gray—do not complain,\nNor cling to this mortal shell.\nAll that is composite must decay.\nIn leisure, refine the elixir’s platform,\nAnd like Pure Yang, follow me to Penglai’s assembly.\"*\n\nThe Perfected One received the teachings, bowed in gratitude, and asked further questions. Suddenly, the two immortals vanished without a trace.\n\nThereafter, he diligently propagated the Daoist teachings, instructing people far and wide. Within a few years, the influence of the Dao flourished, and none failed to believe and follow.\n\nIn the year *Wuyin*, his disciples Lu Ziran and others wished to learn the origins of the *yin* and *horse* (seals and talismans). The master composed a song to explain.\n\nOn the twelfth night of the second lunar month in the year *Renshen* of the Yuanguang era, as the second watch began, the Perfected One sat in meditation when he heard a thunderous crash in the void. Startled, he rose and received a revelation: *\"Your karmic causes now lie in Long Prefecture. This place is no longer where you should focus your heart—heed these words.\"* The Perfected One stepped into the front courtyard to observe, but saw nothing.\n\nIn the year *Guiwei*, Daoist friends from Longzhou invited the master to teach. The Perfected One manifested in response to circumstances, compassionately guiding the people. Those who revered the Dao from all directions listened with awe, and many came to admire him. Over a dozen hermitages were built in the surrounding area, the Daoist influence grew daily, and the lineage expanded greatly.\n\nIn the year *Yiyou* of the Zhengda era, a severe drought had persisted for a long time without rain. The people of Longzhou begged the master to bring rain. Moved by compassion for all living beings, the Perfected One entered deep stillness in the great void—and the rain came of its own accord.\n\nIn the year *Bingxu*, on the Festival of Upholding the Dao, he addressed his disciples: *\"I have repeatedly taught you that the great matter of life and death requires urgent attention—cultivate the Dao and refine your true nature. Yet in the twelve hours of each day, not a single moment do you abide in the Dao. You have accepted offerings from all directions, squandering time in vain. In the future, how will you repay these karmic debts and endure the suffering? Every thought and intention must align with the heart of Heaven. All the virtuous people of the past possessed vast karmic blessings, naturally moving heaven, earth, and the divine. In essence, cultivation requires accumulating merit and virtue, refining the nature to achieve truth. Rest without distraction, unstained by the myriad conditions. Be truly pure, truly steadfast. Spirit and *qi* harmonize and ascend. Nature and life naturally guard one another. The great elixir naturally coalesces. When merit is complete and conduct perfected, you will become a sage. I will guide you to join me as companions—how much longer can this take?\"*\n\nThe disciples, filled with reverence and trepidation, bowed in gratitude and withdrew.\n\nOn the first day of the tenth month in the *dinghai* year, Jie’an was given the name Yanghao. From the twenty-third to the twenty-fifth day, auspicious clouds enveloped the hermitage, thunderclaps resounded several times, and a wondrous fragrance filled the sky—all witnessed and heard by those present. They burned incense and inquired, \"What is the meaning of this?\"\n\nThe Perfected One said, \"The Patriarch has summoned me to a gathering at Penglai. I shall now return. When I first encountered the Supreme Immortal of Zhengyang, he bestowed upon me a seal and a steed, commanding me to cultivate the Dao. Today, I entrust the Iron Steed to Lu Ziran and the Seven-Star Jeweled Seal to Ma Shanneng. The two of you shall establish my teachings and serve as shepherds to the disciples, just as those who received the Dharma from me in the past. You must not treat this lightly or grow negligent.\"\n\nZiran and the others replied, \"We have no merit or conduct to speak of and dare not presume to inherit this burden.\" They declined repeatedly, but when the Perfected One saw they would not accept, his countenance darkened, his gaze piercing the assembly. All were struck with awe and fear.\n\nThe Perfected One said, \"Do you not consider my teaching lineage? How dare you refuse?\" The two, weeping in sorrow, had no choice but to reverently accept.\n\nThe Perfected One then summoned all his disciples and commanded them to bow to Lingyangzi and Gushenzi. Afterward, he called for water to bathe. Once finished, he asked for his robes.\n\nThe Perfected One said, \"There is no need for thick silk or padded garments. Plain, unlined cloth will suffice.\"\n\nThey replied, \"But winter is cold—how can we bear such thin clothing?\"\n\nThe Perfected One said, \"What did I wear when I first came?\" So he donned the simple robe and sat for a long while. Then he called for brush and ink and left three verses:\n\n**First:**\n*A Dharma-boat on land,*\n*I’ve plied its oars for decades.*\n*Now oar and boat cast aside—*\n*My life obeys no heaven.*\n\n**Second:**\n*I possess the art of gathering spirit,*\n*True fire refines cinnabar.*\n*Formless, heartless,*\n*Yet I know the Ancestor Ama.*\n\n**Third:**\n*Mastery of spirit, transformation endless,*\n*Creation knows no bounds.*\n*My life is mine alone—*\n*Heaven and earth cannot contain it.*\n\nAfter reciting the verses, he instructed his disciples, \"After my departure, you should settle near the burial mound.\" As his words ended, at the *wei* hour, he sat upright and passed away.\n\nThis occurred on the twenty-fifth day of the tenth month in the *dinghai* year.\n\nAfter his ascension to immortality, the times were beset by turmoil, and his remains were temporarily interred at Yanghao Hermitage in Dichun Village. Twelve years later, in the *wuxu* year, his disciples Lingyangzi, Lu Ziran, and others lamented the swift passage of time and the ever-receding memory of his voice and countenance. They journeyed from Qin across the Long Mountains to exhume and relocate his remains, personally constructing a tomb and hermitage. As they wandered in reverent contemplation, they beheld upon the northern cliff of the burial mound a propitious herb, its form resembling purple *zhi*, its branches and leaves spreading like a canopy, lush and dense, overshadowing the grave.\n\nThey ordered the tomb opened, and as it was breached, a sound like thunder resounded. When the coffin was lifted, they beheld him—his complexion as in life, his robes around him white as hoarfrost, an extraordinary fragrance filling the air. The inner lining of the coffin was adorned with rare flowers and herbs, as if carved or painted. All present marveled in awe.\n\nThe following day, they bore his remains in procession and reinterred him at the foot of Guishan beneath the Long Mountains. This took place on the thirteenth day of early summer.\n\nThe Perfected One was endowed with an extraordinary nature, his innate wisdom keen. Truly, he was a divine immortal. Having received the oral transmission and personal instruction of the Three Sages, he cast aside the habits of galloping steeds and wielding swords to devote himself to the cultivation of truth and the refinement of conduct. He shed the form of one who flees the dust of the world to undertake the transcendent act of entering sagehood.\n\nWhere once he knew not the boundless void, now his brush produced scripture. Where once he had never studied, now his words formed literature. His aspirations soared beyond ancient and modern, his phrasing subtly attuned to rhythm and rhyme. Even the most learned scholars and literary talents could not surpass him. For his attainment was profound, his cultivation perfected—sages and worthies aided him unbidden, and literary mastery came to him without study. How vastly different he was from those who pilfer from ancient texts!\n\nHis disciples Lingyangzi and others, having long received his direct instruction and witnessed his ways, compiled the master’s posthumous writings—poems, lyrics, songs, and hymns—into four sections, arranged as three volumes: *Upper*, *Middle*, and *Lower*. They titled the collection *Harmonizing with the Light*, and, unwilling to keep it private, had it printed for transmission to the world.\n\nAdditionally, they compiled a separate chronicle of the Perfected One’s life and encounters with immortals, titled *Record of Encountering Immortals*, which nearly captures the origins of his ascension and realization of the Dao, the beginnings and ends of his teachings for the world. With a single glance, all becomes clear.\n\nHere ends *Record of Encountering Immortals: The Ascension of Perfected Dong of Ningyang*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "凝阳董真人遇仙记 经名：凝阳董真人遇仙记。 一卷。 原题样昭闯编慕。 底本出处：《正统道藏》洞真部记传类。 凝阳董真人遇仙记 禄昭闻编纂 真人家世隆安，本姓木虎，俗称董氏，讳守志，字宽甫，号凝阳子，元系女直人也。 父故不仕，母夙丧。 娶女奚烈氏，生一男、二女。 以祖游宦陕右，遂寓居终南山。 大定庚子，府帖夜下，拣阅军徒。 后为谋克，迁陇州沃阳镇防。 因家焉。 真人性资淳朴，气貌恢弘，幼而笃孝，长而异俗。 虽隶戎行动作，云为迥绝流辈。 志慕玄风，而力不及行。 感遇正阳、纯阳、海蟾三神仙，察其累劫修行，迭作问出，明话前因，力加点化，故使抱疾，拂乱其所为有司坐，是为落军籍，真人绿此得专心於教门焉。 自是而后，厥疾弗廖，蒙上仙分之刀圭，及缄其膏盲。 授以铁马星印，而使之执持。 降以符水药力，而俾之济世。 留诗以劝诱之，赐酒以慰谕之。 或历试其所行，或提策其不逮，或下临於庵所，或相逢於道中。 青天白日显然见之，其遇合未有如此之拳拳也。 真人自遇真以来，弃俗出家，结庵下志，往来於德顺、秦陇问。 每每自悟，随寓行缘，信从者众。 请药而药降，疗病而病愈，言雷而雷作，梼雨而雨应。 出神入梦，示现化人。 凡有起心动念者，善恶必先知之。 发於歌颂，见於诗词。 出语惊人，无姻火气也。",
      "translated_text": "**The Record of Master Dong of Ningyang’s Encounter with Immortals**\n*Sutra Title: The Record of Master Dong of Ningyang’s Encounter with Immortals*\n*One fascicle. Originally compiled by Yang Zhaochuang.*\n\n**The Record of Master Dong of Ningyang’s Encounter with Immortals**\nCompiled by Lu Zhaowen\n\nThe Master’s family hailed from Long’an. His original surname was Muhu, though he was commonly known as the Dong clan. His personal name was Shouzhi, courtesy name Kuanfu, and Daoist appellation Ningyangzi. By lineage, he was a Jurchen. His father never held office, and his mother passed early. He married a woman of the Xilie clan, who bore him one son and two daughters. As his ancestors had served in official posts in the Shaanxi region, he settled in the Zhongnan Mountains. In the *gengzi* year of the Dading era, a nighttime decree from the prefecture summoned him for military conscription. Later, he was appointed as a *mouke* (company commander) and transferred to defend Woyang Garrison in Longzhou, where he established his household.\n\nThe Master was of simple and sincere disposition, his bearing majestic. From childhood, he was profoundly filial; in adulthood, he stood apart from worldly customs. Though enlisted in the military, his conduct and deeds surpassed his peers. He yearned for the mystic Dao yet lacked the means to practice it. Moved by his encounters with the Three Divine Immortals—Zhengyang, Chunyang, and Haichan—who discerned his eons of cultivation and repeatedly manifested to guide him, they clarified his past causes, earnestly enlightened him, and even afflicted him with illness to disrupt his official duties, leading to his dismissal from military service. Thus, the Master devoted himself wholeheartedly to the teachings.\n\nThereafter, his ailment did not abate. The Supreme Immortals bestowed upon him the *daogui* (medicinal spoon) and sealed his hidden afflictions. They conferred the Iron Horse Star Seal, commanding him to wield it, and granted him the power of talismanic water and medicine to aid the world. They left poems to exhort him, offered wine to console him, tested his conduct, prodded his shortcomings, descended to his hermitage, or met him upon the road. In broad daylight, they appeared before him with such clarity—never had his encounters with the divine been so intimate.\n\nSince his meeting with the Perfected Ones, the Master abandoned secular life, left home, and built a hermitage to cultivate his resolve. He wandered between Deshun, Qin, and Long, ever awakening to deeper truths. Wherever he lodged, he followed the conditions of his practice, and many came to believe in him. When supplicants sought medicine, it descended; when he healed the sick, they recovered. His words summoned thunder, and his prayers brought rain. He projected his spirit into dreams, manifesting as an emanation body. For all who harbored thoughts—whether good or ill—he knew them in advance. His insights flowed into songs and poems, his utterances astonishing yet free of worldly artifice.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 520,
      "start_sentence": 0,
      "end_sentence": 30,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.84621024131775,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "真人於正隆庚辰年十二月二十八日生，大定庚子隶於军籍，明昌乙卯九月一日出戍於德顺州南寨。 十一日辰时与众会，食问忽见一神人，身长八尺许，顶分二髻，容貌紫赤，髭髯盛美，青袍草履，仗剑造门而呼曰：为汝隐於军中，故来相接，何为不出。 真人惊起，坠於床下，即时昏问，众皆扶翼之。 至七日，稍苏，四肢不能屈伸，本寨千户申至总押所遣官医验，以为瘫痪，遂得长假，还归沃阳本寨求治。 承安丙辰三月三日未时，复见神人衣白袍於门首，指面大笑，真人就外榻瞻礼，忽然不见，因问家人曰：来者神人，识之否。 答曰：不识。 真人谓家人：今夜甚要洒扫精洁，庶几神人再降，救我性命。 家人如其言已。 是月望日，夜半神人复降，光明如昼，异香满室，立於前曰：为汝不省，得此重疾，特来救汝。 即於怀中取丹三粒，俾安三魂，药七锭，俾定七魄。 语之曰：服此荡散一切邪气，通身如火，慎勿惊怖。 言毕，遂失所在。 既服丹药，病果痊愈。 二十七日午时，神人复降，真人喜而拜谢，神人曰：汝识锺否。 真人曰：识，是处宫观皆有之。 神人笑曰：汝只识撞的锺，不知声从何来，吾乃汉锺离也，为汝累世修行，有缺功行，故来赐汝铁马，可随身执持，勿得轻弃。 今岁运气，人多疾疫，吾又赐汝法水、符药，可以救人。 补完功行，汝可每旦焚香请药，吾降药与汝。 真人依其言，药果从空降下，但有疾者服之，必效。 凡请药之际，屡见神人现於空中，至诚祈请之人，亦有见之也。 真人每呎水，必先自饮，然后赐人治病。 日多饮水，莫知其数。 人竟不能晓，有绿遇之者，真人必以词示之。 丁丑年正旦见一异人，身长面黄，髦头胱足，毛连蔽体，麻绳系腰，两手扮肩，仰天而行，丐於市中，口云：只化一钱。 与之两钱者，则云：乞儿本来只化一钱，安用两钱。 既得钱，即指而叹曰：你却有眼，只为四字，教我等候一日。 但所化钱，即以买肉，将肉并余钱包之以纸，宝至河畔，以手拮沙土，遂取所裹肉埋之，复累土如冢，栽柴一枝，挂纸钱於上，取枣、梨献于傍，扮肩而坐，俟观者众至，指云：唤枣、梨，你枣后怎生枣得，梨后怎生梨得。 随以两手插土，至於埋·肉，亟力扬之，口云：枣、梨不得，直待想么。 如此行化数月，时人号扮肩先生。 真人与先生每相会，辄话修真之事，凡百为喻，冀化出家，真人悟其言，遂云：弟子愿随。 先生云：汝未可去，待你去得时，我将你去。 真人问曰：敢问法姓。 先生曰：黄面刘师也。 复问何方人也，先生曰：解州茵城人也。 又问以修行之事，先生索纸而题曰：斩罢三尸水，望向西流到扬州，惫时好抽头。 一言有神，一神有言，神言不信，人不可乎。 言不顾形，出言难追。",
      "translated_text": "The Perfected One was born on the twenty-eighth day of the twelfth month in the *gengchen* year of the Zhenglong era. In the *gengzi* year of the Dading era, he was registered in the military rolls. On the first day of the ninth month in the *yimao* year of the Mingchang era, he was dispatched to the southern fortress of Deshun Prefecture. On the eleventh day at the hour of *chen*, as he dined with his company, he suddenly saw a divine being—tall of stature, nearly eight *chi*, his hair bound in two topknots, his complexion deep crimson, his beard and whiskers thick and fine. Clad in a blue robe and straw sandals, he bore a sword and strode to the gate, calling out: *\"I have concealed you within the army, so I have come to receive you. Why do you not depart?\"*\n\nThe Perfected One started in alarm and fell from his bed, losing consciousness at once. The others lifted and supported him. For seven days, he remained in a stupor, his limbs unable to bend or stretch. The fortress commander reported his condition to the headquarters, where officials and physicians examined him and diagnosed paralysis. Thus, he was granted an extended leave and returned to his hometown in Woyang to seek treatment.\n\nOn the third day of the third month in the *bingchen* year of the Cheng’an era, at the hour of *wei*, he again saw the divine being—this time in a white robe—standing at his door. The figure pointed at him and laughed heartily. The Perfected One rose from his outer couch to pay homage, but the being vanished in an instant. He asked his family: *\"That divine being who came—do you recognize him?\"* They replied: *\"We do not.\"* The Perfected One then instructed them: *\"Tonight, sweep and purify the house thoroughly. Perhaps the divine being will descend again to save my life.\"* His family did as he said.\n\nOn the fifteenth day of that month, at midnight, the divine being descended once more. Light filled the room as bright as day, and a strange fragrance permeated the air. Standing before him, the being said: *\"Because you failed to awaken, you fell gravely ill. I have come especially to save you.\"* From his怀中, he took three pellets of elixir and placed them to stabilize his three *hun*; seven doses of medicine to settle his seven *po*. He instructed: *\"Take this to dispel all perverse *qi*. Your body will burn like fire—do not be alarmed.\"* With that, he vanished.\n\nAfter consuming the elixir and medicine, the Perfected One’s illness was indeed cured. On the twenty-seventh day at the hour of *wu*, the divine being reappeared. Overjoyed, the Perfected One bowed in gratitude. The being asked: *\"Do you recognize Zhong?\"* The Perfected One replied: *\"I do. Every temple and abbey has one.\"* The divine being laughed: *\"You only know the bell that is struck, but not whence its sound comes. I am Han Zhongli. For generations, you have cultivated the Dao, yet your merit remains incomplete. I have come to bestow upon you an iron horse—keep it with you always and do not discard it lightly. This year, the *qi* of the times will bring widespread pestilence. I also grant you dharma-water and talismanic medicine to save others. Once your merit is fulfilled, you may burn incense each dawn to summon medicine, and I will descend it to you.\"*\n\nThe Perfected One followed his instructions, and the medicine indeed descended from the void. All who were ill and took it recovered. Whenever he summoned the medicine, the divine being often appeared in the sky, and those who prayed with utmost sincerity also witnessed him.\n\nThe Perfected One, when drawing dharma-water, always drank first before administering it to others. He drank copiously each day, though none could fathom the quantity. Those who encountered him by chance were invariably enlightened by his words.\n\nOn New Year’s Day in the *dingchou* year, he saw a strange figure—a tall man with a sallow face, his hair unkempt, his feet bare, his body covered in matted hair, a hemp rope tied at his waist. He carried his hands on his shoulders, walked with his face upturned, and begged in the marketplace, crying: *\"Alms of a single coin!\"* To those who gave him two, he said: *\"A beggar asks for but one coin—why give two?\"* After receiving the money, he pointed and sighed: *\"You have eyes, yet it took these four words to make me wait a whole day for you.\"* With the coins, he bought meat, wrapped the meat and any remaining money in paper, and carried it to the riverbank. There, he scooped sand with his hands, buried the wrapped meat, and piled the earth into a mound. He planted a branch atop it, hung paper money upon it, and placed dates and pears beside it. Then, sitting with his hands on his shoulders, he waited until a crowd gathered. Pointing, he said: *\"Call for dates and pears! How will you date after this? How will you pear after this?\"* With that, he plunged his hands into the earth, digging up the buried meat, and scattered it forcefully, crying: *\"No dates, no pears—just wait and see!\"*\n\nFor months, he wandered in this manner, and the people called him the *\"Hands-on-Shoulders Master.\"* Whenever he met the Perfected One, they spoke of cultivating the Dao, using every metaphor to urge him toward leaving the household life. The Perfected One grasped his meaning and said: *\"This disciple wishes to follow you.\"* The master replied: *\"You are not yet ready to go. When the time comes, I will take you.\"* The Perfected One asked: *\"May I know your dharma-name?\"* The master said: *\"I am Huangmian Liu.\"* *\"And where are you from?\"* *\"Yincheng in Xiezhou.\"* When asked about his practice, the master demanded paper and wrote:\n\n*\"When the Three Corpses are slain by water,\nGaze westward as it flows to Yangzhou.\nWhen weary, it’s best to withdraw your head.\"*\n\n*\"One word holds spirit,\nOne spirit holds words.\nIf spirit and words are not trusted,\nCan man be so?\"*\n\n*\"Words disregard form,\nOnce spoken, they cannot be recalled.\"*",
      "overlap_context": "per truths. Wherever he lodged, he followed the conditions of his practice, and many came to believe in him. When supplicants sought medicine, it descended; when he healed the sick, they recovered. His words summoned thunder, and his prayers brought rain. He projected his spirit into dreams, manifesting as an emanation body. For all who harbored thoughts—whether good or ill—he knew them in advance. His insights flowed into songs and poems, his utterances astonishing yet free of worldly artifice.",
      "start_char": 520,
      "end_char": 1554,
      "start_sentence": 31,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.558507680892944,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "精定则气定，气定则神住。 精气神聚而不散，真日用也。 又留‘颂云：来也，无修无形质。 去也，无修无形质。 其中夺取造化机，惫时方可是无为。 真人深异其言。 先生自此别去，真人每怀之。 八月中秋，真人与众习射相角胜负，酒脯过伤，故疾再作。 十月问陇州檄取验，以疾笃方落军籍，不复旧隐。 即日肩舆，径往白坡庵所，甫及半载，医药无效。 季冬生辰，因自责云：予重婴疾苦，是圣贤有谴耶，何时复愈。 承安戊午正旦，忽闻空中言曰：既归道矣，敢食酒肉乎，汝之疾，端由乎此。 真人闻此语，改过自誓，不敢重犯至上。 七日午时有一先生，黄面皂巾长髭，布袍草履，担双而来，问曰：汝所苦何疾。 真人告以腰膝为患，不能行履，复问所患得几时，真人曰：已及半载。 先生曰：即刻缄刺，今夜子时乃愈，不然则否。 遂扶起倚先生膝而坐，遂揣穴施缄，先刺天门，次及百会，二缄在合谷，二缄在涌泉。 缄毕，先生欲辞而去，真人请姓字，答曰：刘。 止先生宿不可，夜既分闻霹雳一声，真人愕然而起，腰膝舒展，病若拈去。 是夜大雪诂旦，真人喜而扫雪，至邻庵，众为惊异，皆知遭遇上真救疗之力也。 承安庚申十月望日，於沃阳住庵，忽遇向者神人，真人急膝跪於前，神人曰：为汝不能省悟，吾先赐汝铁马，今又赐汝七星宝印，可作持修。 印马者，乃先天之物，七星慧剑也。 汝依法修炼，吾复提汝，勿得漏泄，记取记取。 真人拜谢问，神人恍然不见。",
      "translated_text": "When essence is stabilized, qi is stabilized; when qi is stabilized, spirit abides. When essence, qi, and spirit gather without scattering, this is true daily practice. He also left a verse:\n\n*\"Coming—no cultivation, no form or substance.\nGoing—no cultivation, no form or substance.\nWithin it, seize the pivot of creation’s mechanism;\nOnly when weary is non-action truly possible.\"*\n\nThe Perfected One deeply marveled at his words.\n\nFrom then on, the master departed, and the Perfected One often thought of him. In the eighth month, during the Mid-Autumn Festival, the Perfected One competed with others in archery, drinking and feasting to excess, and his illness flared up again. In the tenth month, an official summons from Longzhou arrived for inspection, but due to his grave condition, he was removed from military records and no longer returned to his former seclusion. That very day, he was carried by litter directly to the White Slope Hermitage. After barely half a year, medical treatments proved ineffective.\n\nOn his birthday in the final month of winter, he reproached himself: *\"I suffer deeply from this illness—have the sages sent this punishment? When will I recover?\"* On the New Year’s Day of the *Chengan* *wuwu* year, he suddenly heard a voice from the void: *\"Having returned to the Dao, how dare you still consume wine and meat? Your illness stems precisely from this.\"* Upon hearing these words, the Perfected One vowed to reform and swore never again to violate the highest precepts.\n\nAt noon on the seventh day, a master appeared—yellow-faced, with a black headscarf and long beard, clad in a hempen robe and straw sandals, carrying a double load on a pole. He asked: *\"What ailment afflicts you?\"* The Perfected One told him of the pain in his waist and knees, rendering him unable to walk. The master asked how long he had suffered, and the Perfected One replied: *\"Nearly half a year.\"* The master said: *\"I will apply acupuncture now. By midnight tonight, you will be cured—otherwise, it will not be so.\"*\n\nHe helped the Perfected One sit, leaning against his knee, then palpated the points and applied the needles: first at *Tianmen*, then *Baihui*, two needles at *Hegu*, and two at *Yongquan*. After needling, the master prepared to leave, but the Perfected One asked his name. He replied: *\"Liu.\"* Though urged to stay the night, the master refused. At midnight, a clap of thunder resounded, and the Perfected One started awake—his waist and knees were limber, the illness as if plucked away.\n\nThat night, heavy snow fell until dawn. Overjoyed, the Perfected One swept the snow and went to a neighboring hermitage, where all were astonished. They knew he had encountered the healing power of a perfected immortal.\n\nOn the fifteenth day of the tenth month in the *Chengan gengshen* year, while residing at a hermitage in Woyang, he suddenly met the divine being from before. The Perfected One quickly knelt before him, and the immortal said: *\"Because you failed to awaken, I first bestowed upon you the Iron Horse. Now, I grant you the Seven-Star Treasure Seal—use it for your cultivation. The seal and horse are primordial objects, the Seven-Star Wisdom Sword. Cultivate according to the method, and I will guide you further. Do not leak this secret—remember, remember!\"*\n\nThe Perfected One bowed in gratitude and looked up, but the immortal had vanished.",
      "overlap_context": "ked: *\"May I know your dharma-name?\"* The master said: *\"I am Huangmian Liu.\"* *\"And where are you from?\"* *\"Yincheng in Xiezhou.\"* When asked about his practice, the master demanded paper and wrote:\n\n*\"When the Three Corpses are slain by water,\nGaze westward as it flows to Yangzhou.\nWhen weary, it’s best to withdraw your head.\"*\n\n*\"One word holds spirit,\nOne spirit holds words.\nIf spirit and words are not trusted,\nCan man be so?\"*\n\n*\"Words disregard form,\nOnce spoken, they cannot be recalled.\"*",
      "start_char": 1554,
      "end_char": 2115,
      "start_sentence": 68,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.920667886734009,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "泰和壬戌孟冬十七日寅时，忽闻空中降语云：三河口相会。 真人仓惶趋进，行至虚川涧口岸之南，见二神人已坐盘石，即锺吕二仙也。 真人拜跪於前，锺仙曰：汝身垢腻太多，何不入水中洗涤。 真人曰：唯。 仙又指水中一大鱼曰：汝能捉否。 真人诉流而上搏之，鱼竟不获。 又指一大龟曰：汝能登龟背否。 真人勉力而登，亦不能得。 二仙抚掌笑曰：汝鱼龟俱不能得，待汝洗诤垢腻，捉得鱼龟，吾复提汝，汝望西南观。 及仰视间，二仙恍然不见。 於是，出水穿衣，望空拜谢而归。 既至庵中，觉遍体蒸热，如此弥旬。 每旦沐於三河，顿然不食。 自觉有得於心，常默然感於仙真也。 癸亥年，真人既入道，俗眷犹存室，奚烈氏亲见真人遇仙异迹，遂割爱，始得礼师出家。 乙丑年仲春望日夜，见锺仙降於土室中，神光射人，晃然如昼，长跪於前，仙诲曰：汝毋以药与人，恐侯人性命，损汝功行，吾前与吕仙会於三河，令汝洗垢腻、捉鱼龟，汝悟其旨乎。 真人曰：否。 仙曰：垢腻者，乃心垢也，鱼龟者，乃性命也。 大抵修行，只要除垢、止念，灵台无物，自得性命相守，炼成金丹，脱壳飞升，遨游仙阙，汝切记取。 因留行药吟，其辞曰：劝汝行药兮，於心无益。 贪救他人兮，不觉自己。 纵然医可兮，人皆道好。 若是恨杀兮，难还累世。 似此行药兮，可不痛哉。 子细寻思兮，经纶不识。 吾今劝汝兮，行药劳神。 若不依从兮，永堕沉沦。 莫着声色兮，是非休说。 再劝於子兮，不得贪瞋。 一旦古贩骨兮，何时得彻。 惜气养神兮，固蒂深根。 改过归正兮，旧业皆消。 清净无为兮，与道合真。 受人供养兮，一心办道。 若不进道兮，万祸临身。 吾今诀破兮，省悟记取。 性停命住兮，遨游轻举。 若不改正兮，一失永失。 依此修行兮，吾来提汝。 复取小瓢倾酒赐之，既饮，而冥然不省已，经七日，然后稍醒。 见土室中功德婶，盖所须之物俱为灰烬，满室异香不绝。 自兹厥后，豁然大悟。 大安己巳上元平旦於沃阳，忽闻空中降语云：汝之因绿在於德顺，切记切记。 真人亟出瞻礼，了无所见。 仲春二十五日至顺德，专诱门人卢自然出家，既见与语，若合符契。 庚午年德顺卓庵，仲冬七日，夜色将分，真人纵步前院，仰观乾象，适二仙乘彩云而过。 真人惊惶，易衣焚香，见正阳上仙青袍草履，一仙面黄、髯美、皂巾、绛服，正阳手托一仙右肩，立於大杏树下，霞光射目，香风袭人。 真人拜跪，正阳仙曰：汝在沃阳时，有扮肩先生化汝，数月不省悟，汝以先生为何人也。 真人曰：当时先生云解州苒城黄面刘也。 正阳指而笑曰：即此海蟾公也，后於白坡庵有一先生与汝缄法，令汝病可，亦此海蟾公也。 为汝前生亦是修真之士，吾与海蟾亦曾提挈，赐汝道号日凝阳子，法名遇真。 吾今与海蟾再来，明话前因，复赐旧号，加以和光老人，法名守志。 又教汝三共之道，水火颠倒、炼金液还丹之法，既济黄芽枯、水银不飞走之诀，汞铅凝结、神气相守之道。 即赋诗曰：全神养气得身安，汞结铅凝合自然。 入圣超凡归物外，何愁不做大罗仙。 又曰：吾曾赐汝铁马七星宝印，汝犹未省，吾今为汝言之，吾昔以剑法传洞宾，令其执以修行，今传汝铁马星印，与洞宾一同。",
      "translated_text": "On the seventeenth day of the first month of winter in the *Taihe renxu* year, at the hour of *yin*, he suddenly heard a voice descending from the void, saying: *\"We shall meet at Sanhekou.\"* The Perfected One hurried forward in alarm. Arriving at the southern bank of the ravine at Xuchuan Stream, he saw two divine beings already seated upon a boulder—none other than Immortals Zhong and Lü. The Perfected One knelt before them in reverence. Immortal Zhong said: *\"Your body is thick with filth and grease—why not enter the water and wash it clean?\"* The Perfected One replied: *\"As you command.\"* The immortal then pointed to a great fish in the water and asked: *\"Can you catch it?\"* The Perfected One waded upstream and grappled with it, but the fish eluded him. The immortal next pointed to a large turtle and said: *\"Can you mount its back?\"* The Perfected One strained to climb upon it, but could not. The two immortals clapped their hands and laughed: *\"You cannot even catch a fish or mount a turtle—wait until you have washed away your filth and can seize them. Then I shall guide you further. Now look to the southwest.\"* As he raised his gaze, the two immortals vanished in an instant. He emerged from the water, dressed, and bowed toward the heavens in gratitude before returning to his hermitage. Upon arrival, he felt his entire body suffused with searing heat, which persisted for ten days. Each morning, he bathed in the Three Rivers, and soon he no longer needed to eat. He sensed a profound awakening in his heart and often fell into silent reverence for the immortals.\n\nIn the *guihai* year, though the Perfected One had entered the Dao, his family ties remained. His wife, Lady Xilie, witnessed his extraordinary encounters with the immortals and, moved by devotion, relinquished her attachments so that he might formally take monastic vows under a master. On the night of the fifteenth day of the second month in the *yichou* year, Immortal Zhong descended into his earthen chamber. Divine radiance illuminated the room, bright as daylight. The Perfected One knelt before him, and the immortal instructed: *\"Do not dispense medicine to others, lest you endanger their lives and diminish your own merit. When Lü and I met you at Sanhekou and bade you wash your filth and seize the fish and turtle, did you grasp the meaning?\"* The Perfected One replied: *\"No.\"* The immortal said: *\"The filth and grease are the impurities of the heart; the fish and turtle are your nature and life. In cultivation, one must only eliminate defilement and still the mind. When the spirit-terrace is empty, nature and life will naturally unite. Refine the Golden Elixir, shed the mortal husk, ascend in flight, and roam the celestial palaces—remember this well.\"* He then left a verse on the practice of alchemy:\n\n*\"I urge you to practice alchemy—\nYet it profits not the heart.\nTo save others while neglecting yourself,\nIs to lose sight of your own path.\nThough you may heal, and all call you good,\nIf resentment arises, the debt spans lifetimes.\nSuch alchemy—how can it not grieve?\nPonder deeply, yet the scriptures remain unread.\nI now counsel you:\nAlchemy wearies the spirit.\nIf you disobey, you shall sink forever.\nShun sound and form, let go of right and wrong.\nI urge you again: do not indulge in greed or wrath.\nOne day, this old frame will crumble—\nWhen will you attain liberation?\nCherish your qi, nurture your spirit,\nRoot yourself deeply.\nCorrect your faults, return to truth,\nAnd all past karma shall dissolve.\nAbide in purity and non-action,\nAnd merge with the Dao in reality.\nReceive others’ offerings with a single mind,\nDevoted to the Way.\nIf you do not advance, ten thousand calamities shall befall.\nI now reveal the secret—awaken and remember:\nWhen nature rests and life abides,\nYou shall soar lightly through the heavens.\nIf you do not reform, one mistake is eternal.\nFollow this path in cultivation,\nAnd I shall guide you further.\"*\n\nHe then took a small gourd, poured wine, and offered it to the Perfected One. After drinking, he fell into a profound trance, remaining insensible for seven days before gradually awakening. He saw that the ritual implements in the earthen chamber had turned to ash, and the room was filled with an unceasingly fragrant aroma. From that moment onward, he attained sudden enlightenment.\n\nOn the morning of the Lantern Festival in the *Da’an jisi* year, while in Woyang, he suddenly heard a voice descending from the void: *\"Your karmic affinity lies with De Shun—remember this well.\"* The Perfected One rushed out to pay homage, but saw nothing. On the twenty-fifth day of the second month, he traveled to Shunde to persuade his disciple Lu Ziran to leave the household life. Upon meeting, their words aligned as if by divine accord.\n\nIn the *gengwu* year, De Shun established a hermitage. On the seventh day of the second month of winter, as night deepened, the Perfected One strolled through the front courtyard, gazing at the celestial patterns. Suddenly, two immortals passed by on a cloud of radiant hues. Startled, he changed his robes, lit incense, and saw the Supreme Yang Immortal in a green robe and straw sandals, accompanied by another immortal with a yellow complexion, a fine beard, a black headscarf, and crimson garments. The Supreme Yang supported the other immortal’s right shoulder as they stood beneath a great apricot tree. A glow dazzled his eyes, and a fragrant breeze caressed him. The Perfected One knelt in reverence. The Supreme Yang Immortal said: *\"When you were in Woyang, a man with a hunched shoulder appeared to you. For months, you did not awaken—who did you take him for?\"* The Perfected One replied: *\"At the time, he claimed to be Liu of Huangmian in Jiezhou.\"* The Supreme Yang pointed and laughed: *\"That was none other than Lord Haichan. Later, at Baipo Hermitage, another master sealed a method for you, curing your illness—he, too, was Lord Haichan. In a past life, you were also a cultivator of the Dao. Haichan and I once guided you and bestowed upon you the Daoist name Ningyangzi and the Dharma name Yu Zhen. Today, Haichan and I have returned to clarify your past causes and restore your former titles, adding the name Helao Laoren and the Dharma name Shouzhi. We now teach you the Threefold Unity, the method of inverting water and fire, the art of refining the Golden Elixir and returning the cinnabar, the secret of the Yellow Sprout’s desiccation and mercury’s immobility, and the way of mercury and lead congealing, spirit and qi uniting.\"* He then recited a poem:\n\n*\"Preserve the spirit, nurture the qi, and the body is at peace;\nMercury congeals, lead solidifies, and all is natural.\nTranscending the mundane, entering the sacred, beyond the world—\nWhy fear not becoming a Great Luo Immortal?\"*\n\nHe continued: *\"I once bestowed upon you the Iron Horse and the Seven-Star Treasure Seal, yet you still did not awaken. Now I shall explain: long ago, I transmitted the sword method to Dongbin and bade him cultivate with it. Today, I pass the Iron Horse and Star Seal to you—equal to Dongbin’s.\"*",
      "overlap_context": "eing from before. The Perfected One quickly knelt before him, and the immortal said: *\"Because you failed to awaken, I first bestowed upon you the Iron Horse. Now, I grant you the Seven-Star Treasure Seal—use it for your cultivation. The seal and horse are primordial objects, the Seven-Star Wisdom Sword. Cultivate according to the method, and I will guide you further. Do not leak this secret—remember, remember!\"*\n\nThe Perfected One bowed in gratitude and looked up, but the immortal had vanished.",
      "start_char": 2115,
      "end_char": 3332,
      "start_sentence": 92,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.881091833114624,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "因赋二颂云，其一曰：七星宝印正当权，复显光明照大千。 铁马扶邪能代剑，龟蛇自是两相缠。 其二曰：七番提挈大愚顽，鬓发苍浪老却贤。 若是蹉跎归地府，人身一失永难还。 海蟾仙亦留颂云：前世贫人号海蟾，今来说破旧因绿。 不因累劫修行到，谁肯频频提挈贤。 又以五言长篇赠之曰：吾今说大道，亘古人行少。 要固水银瓢，勿令猥偷了。 清净真无为，纤毫尘不扰。 黑云一点无，湛然明月皎。 闭口牢藏舌，六根尽除扫。 北海黑龟儿，南山赤蛇绕。 洞中雪飘飘，炉鼎自然造。 炼成无价珍，同赴蓬莱岛。 此乃修真秘诀，慎勿独善。 兼汝有数子，亦是前生法眷。 汝曾於弯驽山登真洞集休观建庵，号曰：凝阳，与通玄子陈信道为伴，今谷神子马善能等为汝之门人，同作修持。 登真洞，乃张果老仙隐。 通玄子，即今之冰阳子陈知和也。 今亦付之道号、法名，先令盟誓，而后传法，方可修行，切记切记，慎之戒之。 真人拜谢，仰视二仙，复驾彩云而升空矣。 於是，真人复想二仙提挈前生之言，忽然大省。 辛未年，往德顺遇真庵，道友闻真人腹中，雷呜惊异，请诗二绝，以示道众。 崇庆癸酉仲春二十六日，与师叔陈先生归沃阳，天色昏暝，黄尘障空，至流江峡忽遇二仙，正阳、海蟾也。 各乘花鹿而立，真人拜跪，正阳曰：吾先付汝修真秘诀，当夜事烦，恐汝不明，今复提汝，劝化一切男女，返真归道，可炼大丹，养冲和自然之气，运用真水、真火，汞、铅凝结，烹炼成丹。 若不炼心定意，息气养神，如何得出离输回之苦。 莫起风波，休生姻火。 若瞋则神弱，怒则气散、气散则人亡，人亡则永为下鬼，何时出期。 《阴符经》云：火生於木，祸发必克。 奸生於国，时动必溃。 知之修炼，谓之圣人。 若人发火，火生则姻起，姻起则不见形影，暗中不觉，损坏其身。 不可恣纵六贼三尸，只要剿除暖马，屏去万绿，怕汝不信，火克金，金克木，木克土，土克水，水克火，此是五行相克之法。 又如金生水，木生火，此是地道顺行。 即有生死，只要水生金J火生木，此是天道逆行，岂有生死乎。 大抵修炼庾要，养就水中金，此是五行颠倒法。 若人见吾一面，三世不堕地狱，已后难见吾面，切记切记。 若漏泄天机，流传非人，殃及己身，罪祸必有。 如遇信心之人，先盟誓状，当其祖先，次可传法。 真人拜谢问，二仙已上升矣，真人复四顾，仰见一仙立於峭壁松石问。 适师叔至，真人曰：山问仙人，汝见之乎。 师叔曰：不见。 真人祝以虔恳再拜，果见仙人皂巾、绛袍，现於松石问，风袖翩翩，迤径而去，众虽瞻拜，竟不得见。 师复回德顺，时孟夏中旬也。 贞佑甲戌，真人从德顺往沃阳，九月望日起发，十八日到陇州，宿南关。 未时分，忽见正阳神仙立於河上，问曰：汝今何往。 真人亟拜而答曰：弟子沃阳有土硿所，为人占夺，今故干此。 仙曰：土硿直钱耶，汝性命直钱耶，汝只识得土硿，昧了真空，着了假空，汝还不省，堕落顽空。 真人告曰：何者为真空。 仙曰：真空者，遍塞虚空，不染不着，一灵常在。 问：识否，真人曰：不识。 遂以气一嘘，真人顿然省悟。 须臾，失其所在。 行至沃阳，惶恐．不已，所干之事，更不敢言论。",
      "translated_text": "He then composed two gnomic verses. The first read:\n\n*\"The Seven-Star Treasure Seal now holds true sway,\nIts radiance once more illumines the boundless realm.\nThe Iron Horse repels evil as a sword might,\nWhile tortoise and serpent coil in mutual embrace.\"*\n\nThe second verse went:\n\n*\"Seven times I have raised you from profoundest folly,\nThough hoary-haired and aged, you surpass the wise.\nShould you tarry and descend to the Yellow Springs,\nThe human form once lost will never be regained.\"*\n\nThe Immortal of Sea-Toad also left a verse:\n\n*\"In former lives, a poor man known as Sea-Toad,\nNow I reveal the causes of past karmic threads.\nHad I not cultivated through kalpas untold,\nWho would repeatedly lift the worthy from their depths?\"*\n\nHe then presented a long five-character poem:\n\n*\"Now I speak of the Great Dao,\nRare are those who walk its ancient Way.\nSecure the mercury gourd well,\nLest it be stolen by thieves unseen.\nIn purity and true non-action,\nNot even a mote of dust disturbs.\nA single speck of black cloud gone,\nThe bright moon shines in crystalline clarity.\nSeal the mouth, guard the tongue,\nSweep clean the six senses.\nThe black turtle of the Northern Sea,\nThe red serpent of the Southern Mountain entwine.\nWithin the grotto, snowflakes drift,\nThe crucible and furnace shape themselves.\nRefine the priceless treasure,\nTogether we shall ascend to Penglai Isle.\"*\n\n*\"This is the secret formula of true cultivation—do not hoard it for yourself alone. You also have several disciples, who were your dharma kin in past lives. Once, on Mount Wannu, you established a hermitage at the Cave of Ascended Perfection, naming it the Congealed Yang Abode, and kept company with Master Tongxuan, Chen Xindao. Now, disciples such as Gushenzi Ma Shanneng follow you in cultivation. The Cave of Ascended Perfection was where the Immortal Zhang Guolao once concealed himself. Master Tongxuan is now known as Bingyangzi Chen Zhihe. I now bestow upon them dharma names and titles. First, have them take vows, then transmit the teachings—only then may they cultivate. Remember this well; be cautious and vigilant.\"*\n\nThe Perfected One bowed in gratitude. Looking up, he saw the two immortals once more ascend upon colored clouds. Reflecting upon the immortals’ words about his past lives, he suddenly attained profound awakening.\n\nIn the year *xinwei*, he traveled to Dezhen Hermitage, where fellow Daoists, hearing rumbling like thunder from within his abdomen, marveled. They requested two quatrains to share with the assembly.\n\nOn the twenty-sixth day of the second lunar month in the *guiyou* year of the Chongqing reign, he journeyed to Woyang with his master-uncle, Master Chen. As dusk fell and yellow dust obscured the sky, they arrived at Liujiang Gorge and suddenly encountered the two immortals—Zhengyang and Haichan—each standing astride a spotted deer. The Perfected One prostrated himself. Zhengyang said: *\"I previously imparted to you the secret formulas of true cultivation, but the events of that night were chaotic, and I feared you did not fully grasp them. Now I remind you again: exhort all men and women to return to the Dao and their original nature. Refine the Great Elixir, nurture the qi of harmonious equilibrium, and employ true Water and true Fire. Let mercury and lead congeal, and through refinement, form the Elixir. If you do not settle the mind and stabilize intention, calm the qi and nourish the spirit, how can you escape the suffering of the turning wheel? Do not stir up waves or kindle the fires of desire. Anger weakens the spirit; wrath scatters the qi. When qi scatters, the person perishes; when the person perishes, they become a lowly ghost—when will their release come?*\n\n*The* Yin Fu Jing *states: ‘Fire is born from wood, and calamity inevitably follows. Treachery arises in the state, and when the time comes, it collapses.’ One who knows this and cultivates is called a sage. When a person gives rise to anger, fire is born, and desire arises. When desire arises, form and shadow vanish, and in darkness, unawares, the body is harmed. Do not indulge the Six Bandits or the Three Corpses. Instead, eradicate the restless steed, sever all entanglements. Lest you doubt: Fire overcomes Metal, Metal overcomes Wood, Wood overcomes Earth, Earth overcomes Water, Water overcomes Fire—this is the law of the Five Phases’ mutual conquest. Yet Metal generates Water, Wood generates Fire—this is the earthly cycle’s natural progression, which entails birth and death. But when Water generates Metal and Fire generates Wood, this is the heavenly cycle’s reversal—how then can there be birth and death? In essence, the key to cultivation lies in nurturing the Metal within Water—this is the method of inverting the Five Phases. Should one meet me even once, for three lifetimes they will not fall into hell. Hereafter, it will be difficult to see me again—remember this well. If you leak celestial secrets or transmit them to the unworthy, misfortune will befall you, and punishment will surely follow. When you encounter one of sincere faith, first have them swear an oath before their ancestors, then you may transmit the teachings.\"*\n\nThe Perfected One bowed in gratitude and asked questions, but the two immortals had already ascended. Looking around, he saw another immortal standing among the pines and rocks of a sheer cliff. Just then, his master-uncle arrived. The Perfected One asked: *\"Did you see the immortal among the rocks?\"* His master-uncle replied: *\"I saw nothing.\"* The Perfected One prayed with utmost devotion and bowed again. Then, indeed, he saw the immortal—clad in a black headscarf and crimson robe—appear among the pines and rocks. His sleeves fluttered in the wind as he strolled away along the winding path. Though the others gazed and bowed, they could not see him.\n\nThe master-uncle then returned to Dezhen. It was the middle of the fourth lunar month. In the *jiayou* year of the Zhenyou reign, the Perfected One traveled from Dezhen to Woyang. He set out on the fifteenth day of the ninth month and arrived in Longzhou on the eighteenth, lodging at the South Gate. Around the *wei* hour, he suddenly saw the immortal Zhengyang standing by the river. Zhengyang asked: *\"Where are you going?\"* The Perfected One hastily bowed and replied: *\"This disciple’s kiln in Woyang has been seized by others. I have come to address this matter.\"* The immortal said: *\"Is the kiln worth money? Is your life worth money? You recognize only the kiln but are blind to true emptiness, clinging to false emptiness. You still do not understand—you are falling into deluded emptiness.\"* The Perfected One asked: *\"What is true emptiness?\"* The immortal replied: *\"True emptiness pervades and fills the void, unstained and unattached, with the singular spirit ever-present.\"* *\"Do you recognize it?\"* The Perfected One said: *\"I do not.\"* The immortal exhaled a breath, and the Perfected One suddenly awakened. In an instant, the immortal vanished.\n\nArriving in Woyang, he was filled with trepidation and dared not speak of the matter he had come to address.",
      "overlap_context": "re the qi, and the body is at peace;\nMercury congeals, lead solidifies, and all is natural.\nTranscending the mundane, entering the sacred, beyond the world—\nWhy fear not becoming a Great Luo Immortal?\"*\n\nHe continued: *\"I once bestowed upon you the Iron Horse and the Seven-Star Treasure Seal, yet you still did not awaken. Now I shall explain: long ago, I transmitted the sword method to Dongbin and bade him cultivate with it. Today, I pass the Iron Horse and Star Seal to you—equal to Dongbin’s.\"*",
      "start_char": 3332,
      "end_char": 4543,
      "start_sentence": 148,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.309630393981934,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "至月余，复还德顺，遇真庵道友张」一郎等，问：冬至一阳初生，意旨若何，师以词赠之。 贞佑乙亥，德顺王进卿请真人斋毕，送师至庵，天已昏黑，将欲告归，真人留宿不可，真人曰：汝可将吾铁马归楼上安奉，若闻雷声，勿惊怖。 进卿一依师言。 夜坐昏睡，忽然雷霆震动楼屋，柱础几拔。 满家惊呼，进卿不觉，明灯视之，进卿面上髭须为火所烧，家人呼起稍苏。 翌日，举家具香花、顶铁马，送还庵中，详陈其事，真人曰：昨日雷作，汝呼不省，知其因乎。 汝楼上有一孽龙，隐於楼壁挂刀中，适值天雷收捉，是时非吾铁马。 进卿归而视之，果见龙迹销刃，突鞘而去，楼壁上爪痕尚存。 真人随机显化，人莫识之也。 丙子年，真人自洛水复还德顺？ 抵寿圣观，行至殿后松间，忽遇二仙真纯阳、海蟾。 曰：吾於四海之内，化为贫人，口口劝人不回，皆缘业障深重，铿贪嫉拓，作业越煞，奈何奈何。 吾有词云：日常行游四海，每日街前闹处为乞丐，口口相违化不回，暗损精神，只为凡情昧。 苦劝君生死大，颇奈顽愚，作业贪心煞。 不肯修真，犯天戒，堕落邓都受苦无年代。 词毕，令真人阐化劝绿。 海蟾曰：吾等观见世问迷徒，种种积业，万中无一觉知。 汝但见女男可以劝谕，令入善道，外修阴德，内固精神，若本性不昧於欲界，真心自合於天道，此个幻躯假合四大，何轻何爱。 吾亦传汝词云：子细听吾教诲，说与门生，莫把真心昧。 若是不除堕口债，走入轮回，今世人身改。 鬓发苍，休得怪，莫恋凡胎。 假合终须坏，无事清闲炼丹台，自尔纯阳随我蓬莱会。 真人受教毕，拜谢问，二仙遂失其所在。 於是备云教旨，训及四方，不数年，教风隆盛，无有不归信也。 戊寅年，门人卢自然等愿闻印、马源流，故以歌示之。 元光壬午仲春十二日夜及二鼓，真人静坐问，所闻空中霹雳之声，愕然而起，得降语云：汝之因绿，已在陇地，此处不可留心，汝宜听取。 真人出前院观瞻，了无所见。 癸未年，陇州道友请师教化，真人随机显现，慈悲指人，四方奉道者莫不听然，而仰慕者亦众矣。 周围建庵数十余所，道风日盛，宗门为之广大矣。 正大乙酉，大早久不雨，陇人请师作雨，真人以生灵为心，於是潜静太虚，天雨自至矣。 丙戌年贞元节，谓门人曰：我数四教指汝等生死事大，办道修真，汝等於十二时中，无一时在道，受了十方供养，虚度时光，向前还他口债，受苦如何当得。 但起意动念，须要合於天心，过去一切好人，皆是福绿广大，自能感动天地、神明。 大抵修行，积功累行，炼性成真，休歇无事，万绿不染，真清真诤，神气冲和，性命自然相守，大丹自然凝结，功成行满，圣贤·自然。 接引汝等，共我同伴，能得几时。 众皆忧惧，礼谢而退。",
      "translated_text": "After more than a month, he returned to DeShun, where he encountered Daoist friends from Zhen’an, including Zhang Yilang. They asked: *\"What is the meaning of the winter solstice, when the first yang begins to rise?\"* The master composed a verse in response.\n\nIn the year *Dingyou* of the Zhenyou era, Wang Jinqing of DeShun invited the Perfected One to a vegetarian feast. Afterward, he escorted the master back to the hermitage. As dusk fell, Wang prepared to take his leave, but the Perfected One insisted he stay the night. *\"Take my iron horse and place it in the upper chamber,\"* the Perfected One instructed. *\"If you hear thunder, do not be afraid.\"* Wang followed the master’s words precisely.\n\nThat night, as he sat dozing, suddenly a thunderclap shook the entire building, nearly uprooting the pillars. The household cried out in alarm, but Wang remained unmoved. When they lit a lamp to check on him, they saw that the fire had singed his beard and mustache. Only then did his family rouse him, and he slowly regained awareness.\n\nThe next day, the entire household prepared incense and flowers, carried the iron horse on their heads, and returned it to the hermitage. They recounted the events in detail. The Perfected One said: *\"Yesterday, when the thunder struck, you did not awaken—do you understand the reason? There was a malevolent dragon hidden in the sword hanging on your chamber wall. The celestial thunder had come to seize it. If not for my iron horse, the outcome would have been different.\"* Wang returned home and examined the sword, finding the dragon’s traces scorched into the blade, which had burst from its scabbard and fled. Claw marks still remained on the chamber wall. The Perfected One manifested such transformations in response to circumstances, yet none could fathom them.\n\nIn the year *Bingzi*, the Perfected One returned to DeShun from the Luo River. Arriving at Shousheng Abbey, as he walked among the pines behind the hall, he suddenly encountered two immortals: Pure Yang and Hai Chan. They said: *\"Throughout the four seas, I have taken the form of a beggar, exhorting people endlessly, yet none heed me. Their karmic obstructions run deep—bound by greed, jealousy, and harmful deeds. What can be done? What can be done?\"* They recited a verse:\n\n*\"Daily I wander the four seas,\nA beggar in the bustling streets each day.\nExhorting endlessly, yet none heed—\nWasting spirit in vain, blinded by worldly ties.\nI urge you: life and death are grave,\nYet fools persist, bound by karma’s weight.\nUnwilling to cultivate truth, they break heaven’s law,\nDoomed to suffer in Dengdu for ages untold.\"*\n\nAfter reciting, they charged the Perfected One with spreading their teachings to awaken others. Hai Chan added: *\"We observe the deluded masses of the world, accumulating karma in myriad ways, yet scarcely one in ten thousand awakens. You must admonish men and women alike, guiding them toward the good Dao. Cultivate hidden virtue outwardly, and inwardly fortify your spirit. If your true nature remains unobscured by desire, your true heart will naturally align with the Dao of Heaven. This illusory body is but a temporary convergence of the four elements—why cling to it, why cherish it?\"* He then transmitted a verse to the Perfected One:\n\n*\"Listen closely to my teachings,\nI speak to my disciples—do not obscure your true heart.\nIf you fail to repay karmic debts,\nYou’ll enter the wheel of rebirth, your human form lost.\nHair turns gray—do not complain,\nNor cling to this mortal shell.\nAll that is composite must decay.\nIn leisure, refine the elixir’s platform,\nAnd like Pure Yang, follow me to Penglai’s assembly.\"*\n\nThe Perfected One received the teachings, bowed in gratitude, and asked further questions. Suddenly, the two immortals vanished without a trace.\n\nThereafter, he diligently propagated the Daoist teachings, instructing people far and wide. Within a few years, the influence of the Dao flourished, and none failed to believe and follow.\n\nIn the year *Wuyin*, his disciples Lu Ziran and others wished to learn the origins of the *yin* and *horse* (seals and talismans). The master composed a song to explain.\n\nOn the twelfth night of the second lunar month in the year *Renshen* of the Yuanguang era, as the second watch began, the Perfected One sat in meditation when he heard a thunderous crash in the void. Startled, he rose and received a revelation: *\"Your karmic causes now lie in Long Prefecture. This place is no longer where you should focus your heart—heed these words.\"* The Perfected One stepped into the front courtyard to observe, but saw nothing.\n\nIn the year *Guiwei*, Daoist friends from Longzhou invited the master to teach. The Perfected One manifested in response to circumstances, compassionately guiding the people. Those who revered the Dao from all directions listened with awe, and many came to admire him. Over a dozen hermitages were built in the surrounding area, the Daoist influence grew daily, and the lineage expanded greatly.\n\nIn the year *Yiyou* of the Zhengda era, a severe drought had persisted for a long time without rain. The people of Longzhou begged the master to bring rain. Moved by compassion for all living beings, the Perfected One entered deep stillness in the great void—and the rain came of its own accord.\n\nIn the year *Bingxu*, on the Festival of Upholding the Dao, he addressed his disciples: *\"I have repeatedly taught you that the great matter of life and death requires urgent attention—cultivate the Dao and refine your true nature. Yet in the twelve hours of each day, not a single moment do you abide in the Dao. You have accepted offerings from all directions, squandering time in vain. In the future, how will you repay these karmic debts and endure the suffering? Every thought and intention must align with the heart of Heaven. All the virtuous people of the past possessed vast karmic blessings, naturally moving heaven, earth, and the divine. In essence, cultivation requires accumulating merit and virtue, refining the nature to achieve truth. Rest without distraction, unstained by the myriad conditions. Be truly pure, truly steadfast. Spirit and *qi* harmonize and ascend. Nature and life naturally guard one another. The great elixir naturally coalesces. When merit is complete and conduct perfected, you will become a sage. I will guide you to join me as companions—how much longer can this take?\"*\n\nThe disciples, filled with reverence and trepidation, bowed in gratitude and withdrew.",
      "overlap_context": "ing into deluded emptiness.\"* The Perfected One asked: *\"What is true emptiness?\"* The immortal replied: *\"True emptiness pervades and fills the void, unstained and unattached, with the singular spirit ever-present.\"* *\"Do you recognize it?\"* The Perfected One said: *\"I do not.\"* The immortal exhaled a breath, and the Perfected One suddenly awakened. In an instant, the immortal vanished.\n\nArriving in Woyang, he was filled with trepidation and dared not speak of the matter he had come to address.",
      "start_char": 4543,
      "end_char": 5587,
      "start_sentence": 202,
      "end_sentence": 236,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.957704305648804,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "丁亥十月旦日，揭庵名为养浩。 二十三日至二十五日，祥云覆庵，霹雳数四，异香满空，人悉见闻，焚香请曰：此何故也。 真人曰：祖师邀我赴蓬莱之会，吾将归矣。 我昔遇正阳上仙时，赐我印、马，令我修行，今将铁马付卢自然，七星宝印付马善能，二人与我立教，可为师牧，与我当日传法一同，不得轻泄懈息。 自然等告曰：素无功行，不敢当克。 辞让再四，真人见不受，威形於色，目光射人，众皆惊怖，真人曰：不以我教门为念，辄相违拒。 二人悲泣不获，已而祗受。 真人呼众门人，即令拜灵阳子、谷神子，后遂索水浴，既讫，索衣，真人曰：不须绵绢厚服，但布素单衣即可。 皆曰：冬寒，奈单拾何。 真人曰：我来时着甚来。 遂服单衣，坐而良久，索笔留三颂，其一曰：陆地一法船，举棹数十年。 船棹都撇下，我命不由天。 其二曰：我有聚神法，真火炼丹砂。 无形亦无心，认得祖阿麻。 其三日； 通神变化，造物无穷。 我命由我，天地难笼。 颂毕，嘱门人日； 待我归后，宜附陇下而已。 言讫，正未刻俨然而化矣。 时丁亥十月二十五。",
      "translated_text": "On the first day of the tenth month in the *dinghai* year, Jie’an was given the name Yanghao. From the twenty-third to the twenty-fifth day, auspicious clouds enveloped the hermitage, thunderclaps resounded several times, and a wondrous fragrance filled the sky—all witnessed and heard by those present. They burned incense and inquired, \"What is the meaning of this?\"\n\nThe Perfected One said, \"The Patriarch has summoned me to a gathering at Penglai. I shall now return. When I first encountered the Supreme Immortal of Zhengyang, he bestowed upon me a seal and a steed, commanding me to cultivate the Dao. Today, I entrust the Iron Steed to Lu Ziran and the Seven-Star Jeweled Seal to Ma Shanneng. The two of you shall establish my teachings and serve as shepherds to the disciples, just as those who received the Dharma from me in the past. You must not treat this lightly or grow negligent.\"\n\nZiran and the others replied, \"We have no merit or conduct to speak of and dare not presume to inherit this burden.\" They declined repeatedly, but when the Perfected One saw they would not accept, his countenance darkened, his gaze piercing the assembly. All were struck with awe and fear.\n\nThe Perfected One said, \"Do you not consider my teaching lineage? How dare you refuse?\" The two, weeping in sorrow, had no choice but to reverently accept.\n\nThe Perfected One then summoned all his disciples and commanded them to bow to Lingyangzi and Gushenzi. Afterward, he called for water to bathe. Once finished, he asked for his robes.\n\nThe Perfected One said, \"There is no need for thick silk or padded garments. Plain, unlined cloth will suffice.\"\n\nThey replied, \"But winter is cold—how can we bear such thin clothing?\"\n\nThe Perfected One said, \"What did I wear when I first came?\" So he donned the simple robe and sat for a long while. Then he called for brush and ink and left three verses:\n\n**First:**\n*A Dharma-boat on land,*\n*I’ve plied its oars for decades.*\n*Now oar and boat cast aside—*\n*My life obeys no heaven.*\n\n**Second:**\n*I possess the art of gathering spirit,*\n*True fire refines cinnabar.*\n*Formless, heartless,*\n*Yet I know the Ancestor Ama.*\n\n**Third:**\n*Mastery of spirit, transformation endless,*\n*Creation knows no bounds.*\n*My life is mine alone—*\n*Heaven and earth cannot contain it.*\n\nAfter reciting the verses, he instructed his disciples, \"After my departure, you should settle near the burial mound.\" As his words ended, at the *wei* hour, he sat upright and passed away.\n\nThis occurred on the twenty-fifth day of the tenth month in the *dinghai* year.",
      "overlap_context": "it and virtue, refining the nature to achieve truth. Rest without distraction, unstained by the myriad conditions. Be truly pure, truly steadfast. Spirit and *qi* harmonize and ascend. Nature and life naturally guard one another. The great elixir naturally coalesces. When merit is complete and conduct perfected, you will become a sage. I will guide you to join me as companions—how much longer can this take?\"*\n\nThe disciples, filled with reverence and trepidation, bowed in gratitude and withdrew.",
      "start_char": 5587,
      "end_char": 6005,
      "start_sentence": 237,
      "end_sentence": 257,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.842439651489258,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "登真之后，遭时多故，药葬於低村养浩庵。 越十二载戊戌，门人灵阳子、卢自然等叹日月之如流，痛音容之愈远，遂自秦度陇权为移殡，亲造坟庵，彷徨瞻礼，睹冢之北崖．石上有瑞草一株，状若紫芝，枝叶如盖，蓊密蔓衍，蔽覆坟土。 命众开穴，有声如雷，挽蚓举棺，启而视之，颜貌如生，周身之衣，芒霜如雪，异香喷鼻。 周衣之棺，奇花异草，如刻如画。 众皆赞叹不已。 翌日扶舆挽衬，葬于陇底龟山之下，时首夏十有三日也。 真人资禀不凡，夙性颖悟，真神仙中人也。 既获三圣口传而面命，脱驰马试剑之习，而为修真炼行之归。 离抗尘走俗之形，而为超凡入圣之举。 向也不识之无，今也笔则成书。 向也未尝学问，今也言则成文。 命意高绝於古今，措词暗合於声韵。 虽博学多识，文人才士，有所不逮。 盖其造诣极深，修行极至，圣贤不期而自佑，词章不学而自得。 宜与夫窥陈编以盗窃者，大有径庭矣。 门人灵阳子等亲炙日久，闻见日多，得师流传遗文、诗、词、歌颂总四篇，为上、中、下三卷，目曰：《和光集》，不敢自私，刻梓以传於世。 ·别集真人出处遇真纪年一帐，曰：《遇仙记》，尚庶几真人升仙证道之源流，垂世立教之本末，开卷而瞭然也。 故为之记。 凝阳董真人遇仙记竟",
      "translated_text": "After his ascension to immortality, the times were beset by turmoil, and his remains were temporarily interred at Yanghao Hermitage in Dichun Village. Twelve years later, in the *wuxu* year, his disciples Lingyangzi, Lu Ziran, and others lamented the swift passage of time and the ever-receding memory of his voice and countenance. They journeyed from Qin across the Long Mountains to exhume and relocate his remains, personally constructing a tomb and hermitage. As they wandered in reverent contemplation, they beheld upon the northern cliff of the burial mound a propitious herb, its form resembling purple *zhi*, its branches and leaves spreading like a canopy, lush and dense, overshadowing the grave.\n\nThey ordered the tomb opened, and as it was breached, a sound like thunder resounded. When the coffin was lifted, they beheld him—his complexion as in life, his robes around him white as hoarfrost, an extraordinary fragrance filling the air. The inner lining of the coffin was adorned with rare flowers and herbs, as if carved or painted. All present marveled in awe.\n\nThe following day, they bore his remains in procession and reinterred him at the foot of Guishan beneath the Long Mountains. This took place on the thirteenth day of early summer.\n\nThe Perfected One was endowed with an extraordinary nature, his innate wisdom keen. Truly, he was a divine immortal. Having received the oral transmission and personal instruction of the Three Sages, he cast aside the habits of galloping steeds and wielding swords to devote himself to the cultivation of truth and the refinement of conduct. He shed the form of one who flees the dust of the world to undertake the transcendent act of entering sagehood.\n\nWhere once he knew not the boundless void, now his brush produced scripture. Where once he had never studied, now his words formed literature. His aspirations soared beyond ancient and modern, his phrasing subtly attuned to rhythm and rhyme. Even the most learned scholars and literary talents could not surpass him. For his attainment was profound, his cultivation perfected—sages and worthies aided him unbidden, and literary mastery came to him without study. How vastly different he was from those who pilfer from ancient texts!\n\nHis disciples Lingyangzi and others, having long received his direct instruction and witnessed his ways, compiled the master’s posthumous writings—poems, lyrics, songs, and hymns—into four sections, arranged as three volumes: *Upper*, *Middle*, and *Lower*. They titled the collection *Harmonizing with the Light*, and, unwilling to keep it private, had it printed for transmission to the world.\n\nAdditionally, they compiled a separate chronicle of the Perfected One’s life and encounters with immortals, titled *Record of Encountering Immortals*, which nearly captures the origins of his ascension and realization of the Dao, the beginnings and ends of his teachings for the world. With a single glance, all becomes clear.\n\nHere ends *Record of Encountering Immortals: The Ascension of Perfected Dong of Ningyang*.",
      "overlap_context": "ue fire refines cinnabar.*\n*Formless, heartless,*\n*Yet I know the Ancestor Ama.*\n\n**Third:**\n*Mastery of spirit, transformation endless,*\n*Creation knows no bounds.*\n*My life is mine alone—*\n*Heaven and earth cannot contain it.*\n\nAfter reciting the verses, he instructed his disciples, \"After my departure, you should settle near the burial mound.\" As his words ended, at the *wei* hour, he sat upright and passed away.\n\nThis occurred on the twenty-fifth day of the tenth month in the *dinghai* year.",
      "start_char": 6005,
      "end_char": 6495,
      "start_sentence": 258,
      "end_sentence": 276,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.643242597579956,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\凝阳董真人遇仙记.txt",
        "category": "记传类"
      }
    }
  ]
}