{
  "source_id": "北帝伏魔经法建坛仪",
  "source_file": "chunked_daozang\\北帝伏魔经法建坛仪.json",
  "total_chunks": 8,
  "total_original_chars": 6917,
  "total_translated_chars": 47224,
  "total_translation_time": 258.5206527709961,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Ritual for Establishing the Altar of the Northern Emperor’s Scripture of Subduing Demons**\n\n*Scripture Title:* *Ritual for Establishing the Altar of the Northern Emperor’s Scripture of Subduing Demons*\n*Compiled by:* Lu Zhongling of the Ming Dynasty\n*One fascicle.*\n*Source of Base Text:* *Zhengtong Daoist Canon*, Section *Zheng Yi Bu*\n\n---\n\n**Ritual for Establishing the Altar of the Northern Emperor’s Scripture of Subduing Demons**\n*Compiled by:* Lu Zhongling, Precelestial Great Ultimate Master of the Dao\n\n**Liturgical Proceedings – Preface to the Altar Text**\n\nThe Scripture of Subduing Demons and its ritual methods have been transmitted since antiquity and disseminated to the present age. The scripture was indeed proclaimed by the Supreme Emperor, and the methods were bestowed by the sagely masters. They possess both substance and function: those who practice them subdue and tame demonic forces. They are without superior or origin: those who cultivate them ascend to the ranks of immortals. Their merit surpasses sun and moon; their virtue harmonizes with Heaven and Earth.\n\nThe esoteric talismans and mysterious seals, when employed, are like medicine to the sick. The numinous chapters and precious incantations, when invoked, resemble the echo of a valley transmitting sound, the thunderous commands of the Celestial Soldiers and Thunder Marshals, the obedience of the Marshal Deities and Divine Kings. They gallop through the Three Realms, shake the Ten Directions; their wondrous efficacy is inexhaustible, and praise cannot encompass them.\n\nNow, with a mind attuned to the Mysterious Ultimate and thoughts fixed upon the ritual’s form, we reverently follow the liturgical regulations and proclaim the scripture and its methods. The Eight Trigrams are arrayed in the eight directions to establish the boundary; the Four Spirits are positioned in the four quadrants to guard the altar. The ringing of bells and casting of fire swiftly disseminate sound. They sweep away demonic miasmas, as the Divine Sparrows and Poison Dragons stand in martial array.\n\nThe Golden Lads present memorials; the Jade Maidens convey sincerity. May the causes of those who uphold and recite this scripture silently attain the marvel of spiritual resonance. Before the assembled ritualists, with solemn reverence and sincere hearts, facing the celestial steps, we respectfully chant the sacred titles:\n\n**Northern Ultimate Subduer of Demons, Heavenly Worthy,**\n**Great Sage: Heavenly Worthy of the Flying Celestial Dharma King,**\n**Heavenly Worthy of the Transmitted Precious Scripture.**\n\nWe reverently welcome the Supreme Emperor, having dispelled desire to purify the mind. In initiating the sacred precinct, we must cleanse impurities and wash away defilements. Relying on the cold spring to scatter and sprinkle, we command the divine officers to carry out their duties.\n\nThe *Numinous Chapter for Dispelling Impurities* shall now be solemnly recited.\n\n**Recite:**\n**Heavenly Worthy Who Washes Away Impurities with Divine Water**\n\nThe *Incantation for Purifying Heaven and Earth* is chanted. Standing in attendance within the radiant clarity, we once beheld a single crimson cloud. With minds racing toward the Northern Ultimate, we now gaze upon the triple canopy of the precious parasol.\n\nTo welcome the descent of the Supreme Emperor, we first offer true incense to convey our sincerity. The incense is lit with an incantation; let all join in its proclamation.\n\n**Recite:**\n**Heavenly Worthy of the Talismanic Clouds of Incense.**\n\nThe Heavenly Worthies gather around the precious pearl to hear the Most High expound the Dharma. The Earth Spirits raise the jade platform to protect the Most High as He preaches the scripture. Having faithfully fulfilled their duties in former times, they must not be rashly startled today.\n\nThe *Incantation for Pacifying and Comforting the Spirits* shall now be proclaimed by all.\n\n**Recite:**\n**Heavenly Worthy of Primordial Beginning Who Pacifies and Stabilizes**\n\nThe white chariot and pale horse herald joyous tidings. As the Supreme Emperor descends, crimson standards and rainbow banners must be borne by the myriad spirits in escort. The worthy sages of earth, water, darkness, and yang; the mighty deities of celestial thunder and Mount Feng—upon hearing this universal summons, let all hasten to attend the Dharma assembly.\n\n**Recite the Incantation for Summoning the Hosts:**\n**Heavenly Worthy of the Precious Pearl Who Gathers the Sages.**\n\nThe Primordial Supreme Emperor issues the true talisman and commands its execution. The Primordial Grand Realized One, exalted among the Five Numinous Ones, shines with the radiance of the Great Tenuity, illuminating the eight gates. The Five Elders proclaim their mandate, and no hidden realm remains unheard. Above, He governs the Nine Heavens; at the center, He guards Mount Feng; below, His reach extends to the twelve river sources of rivers and seas.\n\nThe Eight Mighty Divine Incantations, inscribed on jade tablets with numinous writ, summon dragons to bear the waters, gather qi, and condense the mists. They bind demons and dispatch ghosts, leaving none unpunished. Myriad spirits are shattered, and malevolent vapors swept away. The sun, moon, and five planets; the Northern Dipper’s seven origins; the luminous Celestial Emperors—all unite to transmit the decree of the Supreme Mystery. Fire is cast for ten thousand leagues, and might resounds through the Nine Heavens. Proclamations are issued without delay.\n\nAll heavens, all earths, all waters, all mountains; the jade perfected and their legions; the vast spirits of the cosmic depths; the Immortal Kings at their feasts; the Five Emperors with their banners; the Heavenly Soldiers leading the vanguard; the Golden Tigers charging behind; the roaring beasts that rend the sky; the nets guarding the four gates—where called, they arrive instantly; where summoned, they appear at once. The decree is dispatched with the swiftness of wind and fire, and those who answer the summons are conveyed by golden dragons.\n\nI have heard that the Great Emperor of the Purple Tenuity, the Ancestral Master Who Subdues Demons, is revered by the myriad sages and encircled by the host of stars. He governs the earth below and reigns supreme in the heavens above. He holds dominion over yin and yang, comprehending the wondrous truth of neither form nor emptiness. He sustains the cosmos, plumbing the mysteries of what came before and what follows after. Vast and boundless, beyond all naming, His Way is not the ordinary path. He reveals the secret essence of subduing demons and opens the wondrous gate to deliver beings from peril. He annihilates all evil and expands the myriad transformations.\n\nThus, when the world’s sincere devotees yearn for His presence, the immortal chariot rides the qi to descend. The officiant, having swept the ground to prepare the altar, invokes Heaven and beseeches the mandate. Looking up, he implores the transformation of the Dao; bowing down, he begs for compassion. The kingfisher canopy and simurgh banners momentarily depart the golden gates; the phoenix flutes and dragon pipes gradually lower their strains to the human realm. To the left, the Azure Radiance; to the right, the Brilliant Wheel; before, the Beckoning Star; behind, the Dark Warrior. Divine light blazes forth, and fragrant clouds gather thickly. The deities of heaven, earth, water, and land, bearing registers and ledgers; the marshals and generals of Fengdu and the mountain palaces, wielding axes and banners—all arrive amidst swirling auspicious mists and drifting celestial blossoms. Slowly descending upon the clouds, vigorously floating through the void, they bow at the celestial steps to reverently welcome the Sage’s arrival.\n\nFor this ritual, the humblest servant, kneeling with awe and trepidation, bows his head to the ground in reverence. With utmost sincerity, he kindles true incense and respectfully presents his petition:\n\nThe Primordial Celestial Worthy of the Mysterious Origin of the Dao, the Supreme Truth of the Void and Spontaneity;\nThe Jade Dawn Dao Lord of the Upper Clarity Realm, the Numinous Treasure Celestial Worthy;\nThe Supreme Venerable Lord Lao of the Grand Clarity Immortal Realm, the Celestial Worthy of Dao and Virtue;\nThe August Jade Emperor of the Great Lofty Heaven, the Supreme Celestial Worthy of the Vast Sky;\nThe Primordial Celestial Sovereign of the Purple Tenuity and Jade Void, the Supreme August Emperor of the Highest Numinosity;\nThe Celestial August Emperor of the Supreme Culmen, Lord of the Star Palace of the Celestial Hook;\nThe August Empress of Earth, the Holy Mother Who Upholds Heaven and Emulates the Dao, the Earthly Thearch;\nThe Nine Radiance Divine Lords of the Divine Empyrean and Thunderbolt;\nThe Numinous Treasure Celestial Worthies of the Ten Directions and Boundless Realms;\nThe Nine Celestial Nine Qi Divine Lords of Life and Spirit;\nThe Thirty-Two Celestial Emperors Who Deliver Humankind;\nThe Five Elders of the Five Directions, the Heavenly Lords of Brahma Qi;\nThe Azure Lad, Lord of the Eastern Florescence, the Divine Lord of Youth;\nThe Primordial Mother of the Western Numinosity, the Golden Perfected Ancestress;\nThe Perfected Lord of the Ten Celestial Deities and Five Fortunes, the Great Monad;\nThe Celestial Worthies of the Great Lofty Heavens;\nThe Perfected Lord Marshal Tianpeng, Master of the Dharma;\nThe Azure Celestial Thearch, the Perfected Lord Marshal Tianyou, Master of the Dharma;\nThe Cinnabar Celestial Thearch, the Perfected Lord Marshal Yisheng, Master of the Dharma;\nThe Luminous Celestial Thearch, the Perfected Lord Marshal Yousheng, Master of the Dharma;\nThe Mysterious Celestial Thearch, the Perfected Lord of the Central Heaven, the Great Sage;\nThe Nine Radiance Star Lords of the Northern Dipper’s Supreme Dao;\nThe Perfected Lord of the Northern Dipper’s Celestial Gate, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Lesser Minister, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Sovereign Freedom, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Movement, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Universal Illumination, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Compliance, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Pāramitā, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Concealment, King of the Northern Dipper;\nThe Divine Lord of the Supreme Culmen;\nThe Numinous Lord of the Supreme;\nThe Heavenly Lord Xuanzī, Assistant of the Dharma;\nThe Three Heavenly Elders;\nThe Three Realm Elders;\nThe Lords of the Thirty-Six Grotto-Heavens;\nThe Three Primordials and Three Officials, the Great Emperors;\nThe Star Lords of the Imperial Thrones;\nThe Eleven Luminaries Star Lords;\nThe Three Terraces and Canopy Star Lords;\nThe Twenty-Eight Constellations Star Lords;\nThe Star Lords of the Twelve Palaces;\nThe Multitudes of Perfected Beings of the Myriad Stars and Celestial Dipper;\nThe Lord of the Upper Clarity Palace, Who Illuminates the Natal Star of So-and-So;\nThe Host of Illuminating Stars;\nThe Perfected Lord of the Nine Heavens Who Stores Blessings and Determines Destiny;\nThe Celestial Lord of the Grand Court of Heaven, Who Bestows Myriad Fortunes;\nThe Celestial Officials of the Nine Heavens and Nine Empyreans, the Hosts of Court Attendants Who Face the Origin;\nThe Star Lords of the Great Sage of the Fire and Bell;\nThe Perfected of the Ten Poles;\nThe Rulers of the Dark Realm Beneath Mount Fengdu, the Celestial Kingdom of the Nether Abyss;\nThe Water Thearch of the Great Yin;\nThe Seven Star Perfected;\nThe Perfected Lord of the White Horse and Plain Chariot;\nThe Perfected of Wondrous Conduct, Left Attendant;\nThe Perfected of the Mysterious Darkness, Right Attendant;\nThe Lord of Life Qi of the Eastern Dipper;\nThe Lord Who Governs Prohibitions of the Southern Dipper;\nThe Lord of Life Forms of the Western Dipper;\nThe Lord Who Governs Destiny of the Northern Dipper;\nThe Lord Who Records All of the Central Dipper;\nThe Five Masters of the Numinous Treasure;\nThe Perfected of the Three Ministries and Four Assistants;\nThe Two Perfected Sun and Min, Who Subdue Demons and Inaugurate the Teachings;\nThe Heavenly Master Xu Jing, Who Preserves Emptiness and Tranquility, the Recommending Teacher;\nThe Perfected Lord Who Penetrates the Dao with Mystic Understanding;\nThe Lineage Masters, the Great Perfected Lords Ke, Xie, Li, and Guo;\nThe Perfected of the Ancestral Lineage Who Transmit the Dharma and Bestow Blessings, the Masters Who Deliver the Ancestors;\nThe Celestial Immortals, Earthly Immortals, Water Immortals, Flying Immortals;\nThe Divine Immortals of the Three Caverns, Four Supplements, Scriptures, and Registers;\nThe Four Divine Lords Shen, Wei, Ma, and Huang;\nThe Cloud-Assembled Perfected of the Grotto-Heavens and Famous Mountains;\nThe Five Great Celestial Soldiers of the Demon-Subduing Court: Zhang, Bao, Xie, Huang, and Li;\nThe Three Generals Tang, Ge, and Zhou of the Three Primordials;\nThe Ten Heavenly Demon Kings;\nThe Eight Radiance Great Spirits;\nThe Celestial Soldiers and Mighty Ones of the Thirty-Six Grotto-Heavens;\nThe Jade Maidens of the Azure Waist of the Great Mystery;\nThe Jade Maidens of the Night Radiance of the Great Mystery;\nThe Fire-Torch Demon-Quelling Envoys of the Southern Dipper;\nThe Furnace and Chariot Envoys of the Northern Dipper’s Scorching Cauldron;\nThe Flying Dragon and Flying Tiger Riders;\nThe Thunder and Lightning Envoys of the Dark Realm;\nThe Mighty Envoys of Ferocious Beasts and Poisonous Dragons;\nThe Soldiers and Officers of the Perfected Master’s Gate;\nThe Three Qi Great Generals;\nThe Great Generals Who Dispel Evil with Samādhi;\nThe Great Generals Who Soar Across the Five Lakes;\nThe Great Generals of the Three-Five Prohibitive Qi;\nThe Great Generals Yu Yi and Jie Lan;\nThe Great General Who Oversees the Divine Mantras That Subdue Demons for the Northern Thearch;\nThe Great General Who Commands Water;\nThe Great General Who Commands Warmth;\nThe Great General Who Commands Stone;\nThe Great General Who Commands Flying Insects and Dispels Pestilence;\nThe Great General Who Commands Fire;\nThe Great General Who Commands Poison;\nThe Great General Who Commands Blades;\nThe Great General Who Commands Temples;\nThe Great General Who Commands Illness;\nThe Great General Who Commands Ships;\nThe Great General Who Commands Primordial Yang;\nThe Great General Who Commands the Pacification of Heaven;\nThe Great General Who Summons Souls;\nThe Great General Who Prohibits Serpents and Insects;\nThe Great General of Gambling;\nThe Great General Who Breaks Springs;\nThe Great General Who Prohibits Ghosts;\nThe Great General Who Prohibits Illness;\nThe Great General Who Prohibits Tigers and Wolves;\nThe Celestial Soldiers and Might Ones;\nThe Celestial Couriers and Armored Soldiers;\nThe Nine Primordial Demon-Quelling Youths;\nGao Diao and Bei Weng;\nThe Mighty Driver Kui Long;\nThe Six Ding and Eight Messengers;\nThe Divine Kings of the Mighty Swords;\nThe Four-Eyed Elders;\nThe Four Illuminations Merit Officers;\nThe Envoys Who Communicate with the Perfected;\nThe Twenty-Four Spirits Who Devour Demons and Consume Ghosts;\nThe Divine Officers of the Five Thearchs;\nThe Three Heavenly Demon Kings;\nThe Three Demon-Quelling Divine Kings;\nThe Great Spirits Who Capture Ghosts and Protect the Numinous, Who Slay Ghosts;\nThe Thunder Masters, Lightning Masters;\nThe Divine Generals of the Abyssal Caverns;\nThe Three Great Celestial Lords of Thunder: Deng, Xin, and Zhang, Masters of the Altar;\nThe Celestial Immortal Officers and Generals of the Subordinate Bureaus;\nVaiśravaṇa, the Heavenly King of the East;\nVirūḍhaka, the Heavenly King of the South;\nVirūpākṣa, the Heavenly King of the West;\nDhṛtarāṣṭra, the Heavenly King of the North;\nMahābrahmā, the Heavenly King of the Upper Realm;\nThe Holy King Who Transports Offerings of the Lower Realm;\nThe Great Spirits of the Eight Trigrams;\nThe Mighty Spirits of the Eight Directions;\nThe Jade Maidens of Grand Harmony;\nThe Jade Maidens of the Luminous Mirror;\nThe Jade Maidens of the Yellow Simplicity;\nThe Jade Maidens Who Preserve Destiny;\nThe Six Ding Jade Maidens;\nThe Great Spirits of the Right Division of the Azure Music Register;\nThe Jade Maidens of the Northern Dipper’s Various Bureaus Who Extend Lifespan, Continue Destiny, and Deliver from Calamity;\nThe Jade Maidens Who Govern Illness and Dispense Medicines Within the Dipper;\nThe Perfected Who Support the Weak and Dispel Misfortune Within the Dipper;\nThe Divine Kings Who Descend Demons and Seize Demons Within the Dipper;\nThe Youths of the Dipper’s Various Bureaus Who Deliver from Calamity and Increase Lifespan;\nThe Celestial Soldiers and Merit Officers of the Dipper’s Left and Right Celestial Soldiers;\nThe Envoys and Merit Officers of the Dipper’s Left and Right Mighty Ones;\nThe Immortals, Daoists, Perfected, Divine Soldiers, and Officers Within the Dipper;\nThe Yang Officials of the Twenty-Four Treatments;\nThe Yin Officials of the Twenty-Four Treatments;\nThe Officers Beneath Fengdu;\nThe Masters of the Nine Commands;\nThe Demon Kings of the Thirty-Six Grotto-Heavens;\nThe Masters of the Twenty-Four Prisons;\nThe Multitudes of Flying Ghosts of the Mighty North;\nThe Great Spirits of the Wilderness;\nThe Sacred Multitudes of the Five Marchmounts, Four Waterways, Streams, and Ravines;\nThe Civil and Martial Sacred Multitudes of the Earthly Bureaus;\nThe Ninefold Walled True August Emperors of the Earthly Mansion;\nThe Five Yellow Great Emperors of the Celestial Mansion;\nThe Divine Thearchs Who Disseminate Transformation for the Plague Bureau;\nThe Great Envoys Who Bind and Subdue Evil, Who Descend Demons;\nThe Envoys Without Faces;\nThe Four Celestial Generals Who Capture, Bind, Shackle, and Interrogate;\nThe Celestial General Who Universally Manifests and Universally Surveils;\nThe Celestial Generals Who Interrogate, Illuminate, Summon, and Convene;\nThe Great General of the Eternal Sea of the North;\nThe Great General Who Sinks Heaven and Submerges Earth;\nThe Great Spirits of the Black Canopy and Fire Canopy;\nThe Masters of the Prefectures, Counties, and Cities;\nThe Divine Kings of the Nearby Palaces and Temples;\nThe Masters Who Follow the Procession;\nThe Divine Lords of the Altars and Communities;\nThe Orthodox Spirits of the Villages and Domains;\nThe Illuminated Spirits Worshipped in the Home;\nThe Merit Officers and Envoys of the Three Realms and Four Watches;\nThe Divine Officers and Generals Who Pursue and Seize;\nThe Divine Thearchs Who Inspect and Investigate the Void and Its Passages;\nThe Arrayed Perfected of the Four Mansion Altars;\nThe Attending and Guarding Sacred Multitudes.\n\nMay it be reverently hoped that the sagely and divine ones grace this Dharma assembly,\nThat the civil and martial hosts descend upon the scripture altar,\nAwaiting in reverence the radiance of grace,\nTo deign to alight upon this altar ground.\n\nYour servant, though unworthy and foolish,\nPresumes to offer this petition,\nHumbly imagining the Four Saints escorting the imperial procession as one clings to the dragon and phoenix,\nEmerging through the Gate of Heaven.\nRiding cranes and whales,\nThe Five Elders flanking the axle,\nAscending the cloud-paths.\n\nDecrees issue to the celestial, terrestrial, and aquatic immortals’ officers,\nCommanding the mighty spirits of the Scripture Bureau, the Military Bureau, and the Dharma Bureau.\nRelying on the vast and boundless,\nStanding in the whirling and soaring,\nSpring returns with the sound of jars from the casement.\nFanning the towering and majestic,\nManifesting the solemn and awe-inspiring,\nLight illumines the lamp altar.\n\nThe Heavenly Kings’ might pervades the four directions above and below,\nThe Dharma retinue’s rites are strict across the three realms of the unseen and the manifest.\nEach reverently bows and dances,\nAll solemnly cheer in unison,\nGazing upward to the pure radiance.\n\nThe Dharma seat is respectfully established,\nThe precious throne reverently installed,\nAnd humble offerings are presented.\nMay it be hoped that upon the palace hall,\nThe imperial robes shine beyond the nine dragons’ chariot of heaven;\nIn the cup’s clear waves,\nSpring arises as in Jiangnan’s second month.\n\nWith these meager offerings, I humbly present their fragrance,\nPraying the Most Exalted deign to favor this foolish intent.\nBowing deeply again,\nClear tea and herbs are respectfully arranged.\n\nThus, with crimson light and purple mist,\nThe cloud chariot descends to the mortal dust;\nWith green ants and yellow seals,\nThese humble rites are but slightly arrayed before the imperial steps.\nSince they have been graciously noted,\nMay they be granted the honor of partaking.\n\nGazing afar at the three-tiered immortal altar,\nOne beholds the northern pole of heaven;\nWith a single goblet of flowing rosy clouds,\nOne still recalls the banquet of the Western Pool.\nAs the assembled perfected gather,\nPermit these modest rites to be offered again.\nFacing the pure and solemn,\nThe green wine is poured once more.\n\nThus, to harmonize all affairs,\nTo dissolve a thousand sorrows—\nSuch is the saying of the village folk.\nTo unite with nature,\nTo commune with the Great Dao—\nSuch are the words of the banished immortal.\n\nBeholding the pure radiance close at hand upon the scripture altar,\nThese humble flavors are offered again and again in cups and goblets.\nWith wholehearted devotion,\nThe three libations express this sentiment.\n\nYour servant has heard that the three-tiered immortal altar of the Cavernous Mystery and Cavernous Void\nFirst established the soundless and scentless golden gates of the Nine Heavens.\nBefore the distant proclamation of the divine incantations of the wondrous scripture,\nOne first gazes toward the mysterious void to seek command,\nHoping to open the precious casket,\nTo unfold the jade texts,\nAnd to lay bare the words and meanings,\nThat they may be graciously perused.\n\nThe intent of the purification rite is proclaimed.\nThe preceding words have been read in full,\nSurely bathed in celestial grace,\nThey must have reached the sagely ears.\n\nNow, as for the *Wondrous Scripture of the Most High Northern Thearch’s Divine Incantations to Subdue Demons*,\nIt emerges from the *Upper Clarity Wondrous Perfected Scripture*,\nFormed of condensed qi and congealed clouds,\nWeaving through heaven and earth.\nAbove, it is hidden in the Jade Capital and Golden Gates;\nBelow, it is concealed in the grotto-heavens and famous mountains.\nTransmitted during the Dragon Han kalpa,\nPromulgated within the Jambudvīpa realm.\nThe eight-character numinous seal,\nRises from the eight corners to cast its radiance.\nThe ten-scroll mysterious text,\nSubdues the demonic and spectral of the ten heavens.\nIts wondrous meanings are expounded,\nIts mysterious merits recounted.\nThe seven primordial secret formulas protect the state and pacify the people;\nThe six grottoes of the yin palaces slay demons and destroy monsters.\nThe recitation of the wondrous scripture wards off calamity,\nThe divine incantations and talismans complete the design.\nThe golden register ascends the perfected,\nThe jade talisman delivers lives.\nSweeping away a thousand disasters,\nWelcoming a hundred blessings.\nRescuing the six paths,\nAiding the four kinds of life.\nFurthermore, the nine dragons,\nCan summon all treasures.\nThe *Great Register to Ward Off Corpses*,\nWhen worn, lengthens one’s Dao affinity.\nThe hidden seals and cryptic texts,\nWhen cultivated, lead to the attainment of immortal ranks.\nThe divine soldiers protect the state,\nThe wondrous Dharma delivers beings.\n\nSince only those whose bone structure accords with immortality\nMay behold the true text’s revelation,\nNow, gazing upon the towering seat,\nThe empty and cavernous scriptural treasures are expounded.\nAs the incantations are proclaimed,\nOne gradually hears the hidden melody of jade-like tones.\nWhere the numinous scripture is recited,\nOne surely sees the golden and jade forms revealed.\n\nLooking up, I hope for the perfection of the pure;\nLooking down, I pray for compassion toward the earthly.\nMay a special sagely decree be issued,\nTo display the jade-bound compilation.\nThe Jade Lad of the Canonical Bureau,\nUnlocks the three-times-eight golden locks.\nThe incense-bearing youths,\nUnfurl and proclaim the one-zhang purple jade text.\nA thousand, ten thousand layers of Dao qi mysteriously assist,\nThe perfected of forty thousand kalpas rejoice in this encounter.\nThe officers and generals stand guard within and without,\nEvil demons are banished far and near.\n\nMay it be hoped that auspicious vapors rise in lush abundance,\nAnd propitious lights scatter in profusion.\nA single floating crimson cloud,\nDraws near to the celestial countenance.\nA myriad numinous lights gather the ten thousand perfected,\nThe immortal retinue stands in solemn majesty.\n\nThis humble petition is briefly presented,\nHoping for a response through spiritual resonance.\nThe recitation and dedication are complete,\nAll is offered in reverence.\nPresuming upon the celestial might,\nThis servant’s heart is filled with fervent anticipation,\nAwaiting the command.\n\nRespectfully spoken.\nThe Three Bows.\n\nThe Perfected’s primal life-spirit is invoked,\nHands execute the Opening-Closing-Retaining-Sealing Mudra,\nA Dipper constellation is traced—\nthe cap bears the *yi* trigram of the left *si* position.\nA feather fan sweeps the wind,\nBlowing away ashes and embers—\nthe *mao* trigram.\nThe qi of the Eastern Direction engenders and completes the primal life.\nAgain, the left hand wields the fan to expel stale qi,\nAll is made immaculately pure.\n\nThe right hand’s sword inscribes a three-tiered altar,\nThe left hand’s Dipper Seal,\nThree steps of the *ding*-stem *gang* pace,\nAscend the three-tiered altar to perform the rite,\nSummoning the Five Marshals and all their generals.\nProceed to state the matter at hand,\nEntrusting them as in healing illness.\nDeploy the *Celestial Black Register* to subdue malevolent spirits,\nCommand the Heart Marshal to guard and protect the afflicted body.\nExecute the Seizing Mudra and inscribe the prison,\nSeize and press them into confinement,\nEnacting the *Zhen-Gen* method.\n\n“I am a child of the Most High,\nDispatched by the Venerable Lord.\nI wear the sun and moon upon my head,\nBear the Northern Dipper at my waist.\nI command the Celestial Legions of the Qian,\nA million hundred thousand strong,\nArrayed at my left and right.\nBefore me boil the cauldrons of myriad *shuo*,\nBehind me gleam the axes of yellow gold.\nWhen I attend the Most High,\nI suddenly encounter divine generals.\nThey teach me the method to slay demons,\nBestow upon me the formula to decapitate ghosts.\nI bear the *Supreme Simplicity Talisman*,\nTo gather and subdue all inauspicious forces.\nI report to the Heavenly Thearch,\nSummoning the officers and soldiers.\nI wear the floral canopy upon my head,\nTread the *Kui-Gang* beneath my feet.\nWhat spirit dares not flee?\nWhat ghost dares stand before me?\nI bind you without fail,\nPunish your wanton harm.\nThe patient has committed no offense—\nHow dare you assail the worthy and good?\nI contain the upright qi of Heaven and Earth,\nMy incantation shatters the misfortune of wayward ghosts.\nIncant the gods, and gods perish of themselves;\nIncant the ghosts, and ghosts perish of themselves.\nSwiftly, swiftly, in accordance with statute and ordinance!”\n\nIssue the command—\nDispatch the generals:\n\n“Heavenly thunder rumbles in concealment—*si*.\nEarthly thunder roars in tumult—*mao*.\nDragon thunder coils the waters—*chen*.\nWater thunder churns the waves—*zi*.\nEarth Deity’s fire thunder—*mao*.\nThunderbolts crisscross—*yin*.\nThe trigger is sprung,\nSeizing and capturing wayward spirits—*gen*.\nSwiftly, swiftly, in accordance with statute and ordinance!”\n\nNext, visualize the altar’s upper tier:\nCrimson light interweaves in radiant beams,\nPurple qi billows in abundance.\nThe August Sovereign presides over the Three Realms,\nMyriad spirits pay homage at the Primal Origin.\nThe middle tier:\nThe Northern Dipper, Five Stars, Twenty-Eight Constellations,\nSun, moon, and all celestial bodies,\nThe perfected immortals of the scriptures,\nThe stewards of the Dao—all are present.\nThe lower tier:\nThe Fengdu Water Realm, the Five Marchmounts,\nThe Ten Lands, Grotto-Heavens, Blessed Terrains, and sacred mountains—\nTheir divine immortals gather therein.\n\nNext, gaze toward the throne of the Northern Thearch,\nVisualize the primal spirit presenting the petition,\nHoping for the bestowal of celestial radiance to empower the officiant,\nManifesting immediate spiritual resonance.\nRaise the *Primal Life Mudra*,\nVisualize the attendants at left and right,\nEnvision the Northern Thearch as the ancestral master,\nThen visualize the Purple Tenuity Heavenly Palace.\nLight illumines the ten directions,\nThe Four Saints follow the talismans to guard the four quarters,\nEncamping and arraying the formations.\nThe celestial generals of this altar stand to the left,\nThe immortals of the scriptures stand to the right,\nThe celestial immortals of the heavenly realms reside in the northeast,\nThe terrestrial immortals of the earthly realms reside in the southeast,\nThe immortals of the watery palaces reside in the southwest,\nThe deities of the yang realms reside in the northwest,\nThe demon kings of the various heavens, the celestial soldiers and valiant warriors, stand to the left and right.\nAbove are the Four Heavenly Kings,\nBelow are the great deities of the Eight Trigrams.\nFor each direction visualized,\nTwo divine generals are present,\nEach commanding a million celestial soldiers,\nDeploying troops and arraying formations,\nTheir majesty resplendent and awe-inspiring,\nGuarding and protecting the ten directions.\n\nProceeding according to the rite, next issue the summons and commands to the officers and generals to assume their posts:\n\n“Decree: The local Earth Deity and Community Lord,\nThe household deities of this home—Gate Marshal and Door Warden,\nThe Controller of Destiny and Earth Deity,\nThe Dragon Kings of wells and springs,\nThe deities of latrines and the like—\nAll shall obey the scriptural ordinances,\nStanding to the left outside the altar.\n\nDecree: The administrators of the Marchmounts and Moats,\nThe deities of the local soil and sacrificial rites,\nLeading their troops and cavalry—\nAll shall obey the scriptural ordinances,\nStanding to the right outside the altar.\n\nDecree: The luminous spirits of Fengdu who decapitate demons,\nGuan Yu who slays ghosts,\nSang Tong who leads the troops and cavalry—\nAll shall obey the scriptural ordinances,\nProceeding to emit and distribute qi,\nStanding in the *Gen* Palace,\nSolemnly sealing and blocking the paths of ghosts,\nExterminating and annihilating wayward spirits.\n\nDecree: Deng Bowen, the great deity of Thunder’s Origin and Statutes,\nXin Hanchen with his silver fangs,\nZhang Yuanbo, the Fire Thunder Envoy,\nLeading the Thunder Envoys of the Five Directions—\nStand in the *Zhen* Palace,\nInvoking the descent of the Eastern Wood qi,\nSubduing and annihilating the spirits of filth and dust.\n\nDecree: Gou Yichong, the Left Demon-Subduing Envoy,\nBi Ze, the Right Demon-Subduing Envoy,\nLeading their troops—\nStand in the *Xun* Palace,\nSolemnly sweeping away demonic miasmas,\nEradicating demonic trials.\n\nDecree: Zhu Yan of the Fire Rhinoceros Thunder Bureau,\nWu Yuanda, the Southern Culmen Black Yang Envoy,\nLeading their officers and troops—\nStand in the *Li* Palace,\nSolemnly invoking the descent of the Southern Fire qi,\nSubduing and taming the spirits of dead metal.\n\nDecree: Zhao Gongming, Commander of the Heavenly Physicians and Fire Cloud Dragon-Seizing Host,\nSolemnly proceeding to emit and distribute qi,\nStanding in the *Kun* Palace,\nOpening the Gate of Human Prosperity,\nEnsuring the safety of the household.\n\nDecree: Wen Qiong, the Earth Deity’s Marshal,\nYin Jiao, the Earth Controller’s Grand Year—\nTogether leading their troops,\nStanding in the *Dui* Palace,\nInvoking the descent of the Western Metal qi,\nSubduing and annihilating the spirits of rotten wood.\n\nDecree: Xu Xianding, Director of the Heavenly Physicians’ Court,\nLeading his troops and cavalry—\nSolemnly guarding the Celestial Gate,\nReverently receiving the celestial procession,\nTransmitting and proclaiming the incantations and decrees,\nSwiftly conveying the commands.\n\nDecree: Tao Gongji, the Flying Celestial Toxic Thunder Investigator,\nLeading his troops—\nStanding in the *Kan* Palace,\nSolemnly invoking the descent of the Northern Water qi,\nSubduing and annihilating the spirits of scorching fire.\n\nDecree: The Northern Thearch’s Demon-Subduing Incantation, the Grand General and Chief Overseer,\nProclaiming the incantations and decrees,\nSupervising the Dipper’s Mouth—\nSolemnly invoking the descent of the Central Earth qi,\nSubduing and annihilating the spirits of yin waters.\n\nDecree: Xin Hanchen, the Thunder Marshal and Azure Thearch Celestial Lord,\nThe Three Spirits of the Purple Court’s Plain Owl,\nTogether with the Thunder Generals,\nAssembling at the Northern Culmen,\nWithin the Demon-Subduing Rite.\nThe Eight Great Divine Kings of Wind, Thunder, Water, and Fire,\nThe principal and deputy officers and generals,\nThe thirty-six great generals of Tianpeng,\nThe great deities of flying hawks and running hounds,\nThe celestial immortals and generals within and without the Purple Court,\nZhuge Liang’s Iron Seal,\nThe great deities of the Eight Trigrams and Nine Palaces within the rite,\nThe Seventeen Divine Kings,\nThe marshals of the earthly deities,\nWang Qi’s Ten Great Guardians—\nAll lead the troops, cavalry, and officers,\nEach solemnly and single-mindedly\nIntensifying their patrols and vigilance,\nEncircling the scriptural altar.”\n\nStill, to the left of the altar gate, erect a Celestial Prison.\nTo the right of the altar gate, erect an Earthly Prison.\nAll ephemeral, wanton ghosts—those who waste and stagnate,\nthose who slander with red mouths and white tongues,\nthose who cast malevolent glances and poisonous stares,\nlingering corpses and stale qi,\nlost souls near and far,\ndirect talismans and piercing curses,\nghosts of cold temples and wandering sickness,\nplague demons,\ngrievances, vengeful spells, and specters of all kinds—\nevery ghost that defies Heaven, rebels against Earth,\nacts without the Dao, or strays from righteousness—\nseize and deliver them beneath my *kuigang*,\nto suffer death, motionless and inert,\nforbidden to violate my incantation.\nShould any dare breach my divine spell,\nlet their heads shatter and brains burst,\nscattered like fine dust.\nSwiftly, swiftly, as the law commands.\n\nNext, cast down the *Hengtian Black Register* to perform the *Altar-Binding Rite*:\nEast bound, West bound,\nSouth bound, North bound,\nAbove bound to the heavens,\nBelow bound to the earth,\nAt the center, all ghosts and evil spirits bound.\nWith the above, employ the *Grasping the Authority Seal*,\nthe *Zimu Marshal’s Seal*,\nthe *Kun’s Grasping the Authority Seal*,\nand recite the *Altar Incantation*.\nThe Vermilion Bird radiates brilliance,\ndivine might surges within.\nThe Four Mountain Sources stand guard—\nghostly soldiers flee in terror.\nThe divine serpent exhales its breath—\nevil spirits cower in hiding.\nThe Four Luminous Soul Terraces,\njade doors resplendent.\nThe Jade Perfected stands majestic,\nenthroned in the Hall of Light.\nWielding purple auroras in hand,\ncrowned with divine radiance.\nReciting the *Cavern Scripture*,\nthirty-nine chapters in all.\nWithin, the *Exorcising Evil*,\nthe might of dragons and tigers.\nFierce beasts and charging oxen,\nclutching blades and swallowing spears.\nThe *Mountain-Raising Bell* tolls—\nHeaven’s poisonous dragons and divine birds.\nSix-jawed, they spew fire,\ndevouring the kings of ghosts.\nLightning boars and thunderfire,\nseizing stars and streaming bolts.\nFlickering flames, scorching winds,\nmarching against the gale.\nThe *Celestial Bird Array* surrounds me,\nbelching fire for ten thousand miles\nto dispel all misfortune.\nAll spirits open the Way,\nsealing off mountain villages.\nA thousand gods, ten thousand spirits,\nbow their heads in reverence.\nMarshals hold censers,\nburning incense for me.\nWherever I tread,\nall gods receive me.\nCelestial beasts come to guard,\na thousand spirits tremble and submit—\ndare not disturb my qi.\nSwiftly, swiftly, as the law commands.\n\nNow perform the *Altar-Locking Rite*:\nThe Celestial Slayer blazes,\nthe Earthly Slayer stands firm.\nHow dare any evil spirit or ghost hide?\nWith a single inhalation of the *Flying Gang*,\nten thousand ghosts vanish.\nLeft *Kui*, right *Gang*—\ndivine saints seize and lock them,\nallowing no escape.\nCommand: “Divine generals, swiftly lock the altar!”\nI act by the decree of the Northern Emperor.\nSwiftly, swiftly, as the law commands.\n\nPerform the *Altar-Locking Rite*, taking the *Xī Seal* and casting the *Decision*:\nDirect the generals and officers to lock the altar,\nenvisioning the divine presence of the Northern Emperor.\nPetition the Primordial Celestial Sovereign,\nstepping through the Dipper,\nvisualizing the transformation of the divine seat.\n\nI, the ritual master, have heard:\nThe Great Void is boundless, unseen and unheard.\nYet the profound Dao is obscure—\nknock, and it opens; seek, and it responds.\nToday, within this altar,\nsolemnly establish the scriptural rite,\ncirculating it above and below, throughout the four directions.\nLike the Southern Cinnabar Realm,\nencircling a hundred leagues,\nit becomes the Northern Culmen Celestial Palace,\nwhere the Four Qi shine clearly.\nTen thousand spirits tremble and submit,\ndemon kings all pay homage.\nNo land remains unpeaceful.\nAs when the Primordial One dwells within the Pearl,\nor when the Most High ascends the Jade Throne,\ndivine sounds resound,\ngolden words proclaimed.\nTen ranks unfold,\nthe sea of blessings deep and the mountain of longevity firm.\nThe Five Directions stand secure—\nevil gates close, and the true Dao opens.\nSit in equanimity, recite the scripture with utmost sincerity.\nProceed.\nOpen the case, expound the mysteries—Celestial Worthy.\nModulate the voice, recite the scripture,\nand discourse on the *Narrative Chapter*.\n\nWhen reciting to the *Celestial Canopy Mantra*, visualize the host of great immortals, divine kings, generals, and officials arrayed in martial formation, standing in attendance to the left and right, before and behind. After each chapter is recited, summon the Divine Sovereign of the North. Then envision yourself as the Perfected of Primordial Destiny, kneeling to present matters and offer reverent thanks. Again visualize the Divine Sovereign of the North, and proceed to recite the next chapter.\n\nFor the *Seven Primordials Chapter*, when reciting to the *Mantra of Division of Self*, do not raise the voice. In proper visualization, see the Divine Sovereign of the North dispatching troops to seize malevolent spirits, sending generals to capture the demonic gods who bring misfortune and cast them into prison. Envision the spirit as the Celestial Canopy, pacing the Dipper once, and standing upon the □-star. With the left hand, form the Mudra of the Five Generals, then the Mudra of the Household Guardian, pressing the four fingers upon the base of the thumb. The Mudra of Provisional Troops, the Mudra of the Master of the Zi-hour. Press the thumb upon the middle joint of the four fingers. Summon the generals to deploy troops, apprehend the malevolent spirits afflicting the household, and draw the Well Prison to enclose the demon. Visualize the soldiers and generals capturing them within, commanding them to release the patient’s hun-soul and return it to the body. Envision a beam of golden light from the altar piercing directly into the sickroom; the patient’s body follows the light inward, and in accordance with the scripture, spray consecrated water to repel and withdraw the affliction. Alternatively, have someone carry the talisman into the room, strike vinegar-soaked charcoal for fumigation, and sweep clean. Visualize the Heart General guarding and restoring the body to tranquility. Imagine all who come and go as demonic gods and spirit officials. Return to the four altars and resume recitation.\n\nFor the *Chapter of Slaying Demons*, visualize the Divine Sovereign of the North leading the demon kings of all heavens and the spirit officials of the Six Palaces, expounding the Dao in Fengdu to subdue malevolent spirits. In healing illness, also provide talismanic water for the patient to ingest.\n\nFor the *Chapter of Warding Off Calamity*, envision the Perfected of Primordial Destiny presenting a memorial to the Divine Sovereign of the North, who then proclaims the sacred decree to the stellar palaces of the Northern Dipper, beseeching the deliverance of a certain person from disaster. Visualize the inauspicious stars of the afflicted person retreating, while auspicious constellations shine upon them, dispersing misfortune and dissolving calamity. Heavenly immortals deliver the person, demon kings receive the precepts, and ghostly apparitions flee in terror.\n\nFor the *Chapter of the Divine Seal*, envision the seal radiating a myriad zhang of luminous rays, severing and extinguishing all inauspiciousness.\n\nFor the *Chapter of the Golden Register*, visualize the Celestial Worthy of Primordial Beginning descending the True Talisman of Salvation from Suffering, dispatching the Dragon Youth to deliver proclamations to the Three Realms, the Ten Directions, and the palaces of Mount Fengdu, summoning the ancestral hun-souls. Next, envision the Celestial Worthy of Salvation from Suffering, forming the Mudra of the Golden Tablet, and visualize golden light piercing the dark prisons, drawing the souls to the altar. The Daoist assembly then recites scriptures at the ancestral shrine, offering consecrated food, and inviting the souls to be seated. After recitation, present the *Tablet of Longevity*, proclaim the talismanic registers, and dispatch the Dragon Youth and spirit officials to the Southern Bureau of Life Registration. First, burn the offerings of merit; the Dharma Master need not descend from the seat.\n\nFor the *Chapter of the Nine Dragons*, visualize the Divine Sovereign of the North holding the Golden Tablet, summoning the Nine Dragon Kings to reside in the forbidden precincts and the Six Spirits to attend the command. For any recent or past construction that has caused offense, all shall be pardoned and absolved. Rely upon the merit of this scripture to ensure peace and deliverance.\n\n**Chapter of Expelling Corpse-Energy**\nUpon reciting the *Luminous Mirror Register*, visualize white *qi* and auspicious radiance emerging from the sacred register in the heavens, dispelling celestial calamities and dispersing terrestrial misfortunes.\n\n**Eight-Character Chapter**\nWhen reciting the *Taboo of the Dipper*, envision the Divine Sovereign of the North issuing a decree to the Northern Dipper. The Northern Dipper manifests in person to pacify mortals, dissolve disasters, and resolve adversities. Aligning with the stellar paths, it erases names from the ledgers of sin and inscribes them in the registers of rebirth. At each position, perform the visualization: with the left hand forming the Dipper mudra, trace from the forehead to the eyes—this is called *Descending Upon the Eyes*—to resolve grievances, safeguard life, and cultivate the heart and nature. Further envision the divine immortals and spirit officials protecting the living, excising sins, bestowing blessings, and granting the sacred talismans for ingestion.\n\n**Chapter of Divine Soldiers**\nHere, present the offerings of the *jiao* ritual anew. Visualize the assembled perfected beings, both within and without, above and below, receiving the offerings and descending to confer blessings.\n\n**Dedication Text**\nThe humble officiant, [Name], respectfully submits this memorial in profound gratitude, kindling true incense to reverently address the sacred ranks.\n\nI have heard that when the jade scriptures conclude their scrolls, their mysteries resound through the Three Realms; when the tones of the sacred chime fade, the distant chanting of the heavens seems to echo their verses. Truly, these are the profound mysteries of the celestial realm, not the common words of the mundane world. Through them, Heaven and Earth endure eternally, and the sun and moon alternate in their courses. The people rely upon them for prosperity, while ghosts and spirits revere them for their transformative power. The sick who hear them gain longevity in the Eastern Flower Capital; the deceased who hear them ascend in spirit to the Northern Palace. Demons and malevolent forces hear them and shatter their skulls; those who abandon delusion and awaken to them soar with scales and feathers. These are the foundations of life and transformation, upon which all beings in heaven and earth depend. They serve as the torch of wisdom for the benighted and the dharma bridge across the sea of suffering. Their merit is inconceivable, their blessings and virtue boundless.\n\nToday, having recited the ten chapters in full, their harmonies pierce the nine heavens. I humbly envision the scriptures returning to the stellar altar as grace descends from the Golden Gates. May the imperial domain expand and our Dao flourish. May the five winds and ten rains arrive in season, and the people of the four seas enjoy peace and prosperity. May the Three Wretched Paths cease their suffering, never again to fall into the cycles of retribution. May the Ten Grounds awaken compassion, and the torments of purgatory pause, if only briefly. May all living things—moving and still—feel the virtue of creation, and all creatures—soaring and swimming—receive the grace of nurturance. May all sentient beings equally attain the untainted state.\n\nNext, may [Name]’s sins be erased across countless kalpas, and blessings descend in this very moment. May the talismanic waters retain their efficacy, ensuring tranquility, peace, and harmony as before. May the field of the body be blessed, free from afflictions, illnesses, and pains. May official rank and fortune thrive, and stellar influences align auspiciously. May the household enjoy serenity, the elderly find peace, and the young be cherished. May the nine generations ascend, the living be protected in spirit, and the departed be transformed. What disaster shall not be vanquished? What wish shall not be fulfilled? We, your servants, together bathe in the residual grace, and all in the human realm partake of its extraordinary benefits. May this scriptural teaching flow through the ages, and demonic forces be eradicated from the eight wilds.\n\nWith these prayers, I reverently submit them to the shelter of your boundless longevity. For the highest good, I bow my head in devotion and take refuge.\n\nWith sincere hearts, we invoke and praise the Three Supreme Ones, the saints of the ten directions, the Great Dharma Master of the Mystic Realm, and the exalted perfected ones of the *Sutra Altar for Subduing Demons*. Their merit is beyond all measure, their virtue unfathomable.\n\nThus concludes the ritual for establishing the altar of the *Northern Emperor’s Scripture for Subduing Demons*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "北帝伏魔经法建坛仪 经名：北帝伏魔经法建坛仪。 明卢中苓编。 一卷。 底本出处：《正统道藏》正一部。 北帝伏魔经法建坛仪 先天太极法师卢中苓编 法事　　白叙坛文 夫伏魔经法者，教传自古，派演于今。 经实上帝所宣，法乃圣师所授。 有体有用，行之者摄伏邪魔。 无上无宗，修之者进登仙品，功高日月，德合乾坤。 秘篆玄符，用之者如人病之得药。 灵章宝咒，叩之者似谷响之传声，天丁雷吏之挥诃。 元帅神王之禀奉，驰驱三界，震动十方，妙用难穷，赞言莫尽。 今则冥心宸极，注想仪容，遵奉科规，举扬经法。 八卦按八方而结界，四灵列四象以守坛。 流铃掷火而汛音迅。 扫妖氛，神雀毒龙而森罗兵阵。 金童启奏，玉女通诚，愿令持诵之因，默有感通之妙。 见前法众，端恪心诚，首对天墀，恭唫音吟圣号。 北极伏魔天尊， 大圣：飞天法王天尊， 流传宝经天尊。 祇迎上帝，既遣欲而澄心。 肇建灵场，必涤瑕而荡垢。 仗寒泉而散洒，冀将吏以奉行。 解秽灵章，谨当演讽。 举。 神水洗秽天尊 讽净天地咒 侍立通明，曾睹红云之一朵。 驰心北极，聿瞻宝盖之三重。 欲迎上帝之临轩，先假真香而达信。 焚香有咒，众为举扬。 举。 香云结篆天尊。 天尊会宝珠，听至尊之演法。 地神涌玉局，卫太上之说经。 既能效职於昔时，不得妄惊於此日。 安慰神咒，众为举扬。 举。 元始安镇天尊。",
      "translated_text": "**Ritual for Establishing the Altar of the Northern Emperor’s Scripture of Subduing Demons**\n\n*Scripture Title:* *Ritual for Establishing the Altar of the Northern Emperor’s Scripture of Subduing Demons*\n*Compiled by:* Lu Zhongling of the Ming Dynasty\n*One fascicle.*\n*Source of Base Text:* *Zhengtong Daoist Canon*, Section *Zheng Yi Bu*\n\n---\n\n**Ritual for Establishing the Altar of the Northern Emperor’s Scripture of Subduing Demons**\n*Compiled by:* Lu Zhongling, Precelestial Great Ultimate Master of the Dao\n\n**Liturgical Proceedings – Preface to the Altar Text**\n\nThe Scripture of Subduing Demons and its ritual methods have been transmitted since antiquity and disseminated to the present age. The scripture was indeed proclaimed by the Supreme Emperor, and the methods were bestowed by the sagely masters. They possess both substance and function: those who practice them subdue and tame demonic forces. They are without superior or origin: those who cultivate them ascend to the ranks of immortals. Their merit surpasses sun and moon; their virtue harmonizes with Heaven and Earth.\n\nThe esoteric talismans and mysterious seals, when employed, are like medicine to the sick. The numinous chapters and precious incantations, when invoked, resemble the echo of a valley transmitting sound, the thunderous commands of the Celestial Soldiers and Thunder Marshals, the obedience of the Marshal Deities and Divine Kings. They gallop through the Three Realms, shake the Ten Directions; their wondrous efficacy is inexhaustible, and praise cannot encompass them.\n\nNow, with a mind attuned to the Mysterious Ultimate and thoughts fixed upon the ritual’s form, we reverently follow the liturgical regulations and proclaim the scripture and its methods. The Eight Trigrams are arrayed in the eight directions to establish the boundary; the Four Spirits are positioned in the four quadrants to guard the altar. The ringing of bells and casting of fire swiftly disseminate sound. They sweep away demonic miasmas, as the Divine Sparrows and Poison Dragons stand in martial array.\n\nThe Golden Lads present memorials; the Jade Maidens convey sincerity. May the causes of those who uphold and recite this scripture silently attain the marvel of spiritual resonance. Before the assembled ritualists, with solemn reverence and sincere hearts, facing the celestial steps, we respectfully chant the sacred titles:\n\n**Northern Ultimate Subduer of Demons, Heavenly Worthy,**\n**Great Sage: Heavenly Worthy of the Flying Celestial Dharma King,**\n**Heavenly Worthy of the Transmitted Precious Scripture.**\n\nWe reverently welcome the Supreme Emperor, having dispelled desire to purify the mind. In initiating the sacred precinct, we must cleanse impurities and wash away defilements. Relying on the cold spring to scatter and sprinkle, we command the divine officers to carry out their duties.\n\nThe *Numinous Chapter for Dispelling Impurities* shall now be solemnly recited.\n\n**Recite:**\n**Heavenly Worthy Who Washes Away Impurities with Divine Water**\n\nThe *Incantation for Purifying Heaven and Earth* is chanted. Standing in attendance within the radiant clarity, we once beheld a single crimson cloud. With minds racing toward the Northern Ultimate, we now gaze upon the triple canopy of the precious parasol.\n\nTo welcome the descent of the Supreme Emperor, we first offer true incense to convey our sincerity. The incense is lit with an incantation; let all join in its proclamation.\n\n**Recite:**\n**Heavenly Worthy of the Talismanic Clouds of Incense.**\n\nThe Heavenly Worthies gather around the precious pearl to hear the Most High expound the Dharma. The Earth Spirits raise the jade platform to protect the Most High as He preaches the scripture. Having faithfully fulfilled their duties in former times, they must not be rashly startled today.\n\nThe *Incantation for Pacifying and Comforting the Spirits* shall now be proclaimed by all.\n\n**Recite:**\n**Heavenly Worthy of Primordial Beginning Who Pacifies and Stabilizes**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 564,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.062994956970215,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "素车白马欢传。 上帝之下临，绛节霓旌，当假万灵而翊卫。 地水冥阳之贤圣，天雷酆岳之威神，闻此总召咒言，悉愿齐临法会，召集神咒，请为宣扬。 举。 宝珠会圣天尊。 元始上帝，真符敕行。 元始太真，五灵高尊。 太微皓映，洞耀八门。 五老告命，无幽不闻。 上御九天，中镇酆山，下彻川海十二河源。 八威神咒，灵策玉文。 召龙负水，收气聚烟。 束魔送鬼，所诛无蠲。 万精摧落，扫荡妖氛。 日月五星，北斗七元，合明天帝，敕下太玄。 掷火万里，威振九天。 宣布号令，不得迁延。 诸天诸地，诸水诸山。 玉真所部，溟泠大神。 仙王游宴，五帝仗旛。 天丁前驱，金虎后奔。 镢音攫天猛兽，罗备四门。 所呼立到，所召立前。 敕书豁落，风火无停。 摄录应命，金龙驿传。 臣闻紫微大帝，伏魔祖师。 实万圣之所宗，为众星之所拱。 权司下土，御极中天。 主握阴阳，悟不色不空之妙。 纲维宇宙，究孰先孰后之玄。 巍巍荡荡不可名，恢恢广广非常道。 示伏魔之秘旨，开度厄之妙门。 殄灭群凶，恢弘万化。 故凡世秉诚之切仰，仙舆驭炁而临今。 醮官某，扫地为坛，吁天请命。 仰干道化，俯赐矜怜。 翠盖鸾旗，影暂离於金阙。 凤笙龙管，声渐下於人间。 左郁仪，右结璘，前招摇，后玄武。 神光赫奕，香云密罗。 天地水陆之神祇，执箓持籍。 酆都岳府之帅将，仗钺秉旄。 瑞雾霏微，天花飞舞。 冉冉乘云而下，勃勃浮空而来。 拜手天阶，祗迎圣驾。 法事 具位臣某，诚惶诚恐稽首，顿首再拜。 谨爇真香，恭伸奏启：",
      "translated_text": "The white chariot and pale horse herald joyous tidings. As the Supreme Emperor descends, crimson standards and rainbow banners must be borne by the myriad spirits in escort. The worthy sages of earth, water, darkness, and yang; the mighty deities of celestial thunder and Mount Feng—upon hearing this universal summons, let all hasten to attend the Dharma assembly.\n\n**Recite the Incantation for Summoning the Hosts:**\n**Heavenly Worthy of the Precious Pearl Who Gathers the Sages.**\n\nThe Primordial Supreme Emperor issues the true talisman and commands its execution. The Primordial Grand Realized One, exalted among the Five Numinous Ones, shines with the radiance of the Great Tenuity, illuminating the eight gates. The Five Elders proclaim their mandate, and no hidden realm remains unheard. Above, He governs the Nine Heavens; at the center, He guards Mount Feng; below, His reach extends to the twelve river sources of rivers and seas.\n\nThe Eight Mighty Divine Incantations, inscribed on jade tablets with numinous writ, summon dragons to bear the waters, gather qi, and condense the mists. They bind demons and dispatch ghosts, leaving none unpunished. Myriad spirits are shattered, and malevolent vapors swept away. The sun, moon, and five planets; the Northern Dipper’s seven origins; the luminous Celestial Emperors—all unite to transmit the decree of the Supreme Mystery. Fire is cast for ten thousand leagues, and might resounds through the Nine Heavens. Proclamations are issued without delay.\n\nAll heavens, all earths, all waters, all mountains; the jade perfected and their legions; the vast spirits of the cosmic depths; the Immortal Kings at their feasts; the Five Emperors with their banners; the Heavenly Soldiers leading the vanguard; the Golden Tigers charging behind; the roaring beasts that rend the sky; the nets guarding the four gates—where called, they arrive instantly; where summoned, they appear at once. The decree is dispatched with the swiftness of wind and fire, and those who answer the summons are conveyed by golden dragons.\n\nI have heard that the Great Emperor of the Purple Tenuity, the Ancestral Master Who Subdues Demons, is revered by the myriad sages and encircled by the host of stars. He governs the earth below and reigns supreme in the heavens above. He holds dominion over yin and yang, comprehending the wondrous truth of neither form nor emptiness. He sustains the cosmos, plumbing the mysteries of what came before and what follows after. Vast and boundless, beyond all naming, His Way is not the ordinary path. He reveals the secret essence of subduing demons and opens the wondrous gate to deliver beings from peril. He annihilates all evil and expands the myriad transformations.\n\nThus, when the world’s sincere devotees yearn for His presence, the immortal chariot rides the qi to descend. The officiant, having swept the ground to prepare the altar, invokes Heaven and beseeches the mandate. Looking up, he implores the transformation of the Dao; bowing down, he begs for compassion. The kingfisher canopy and simurgh banners momentarily depart the golden gates; the phoenix flutes and dragon pipes gradually lower their strains to the human realm. To the left, the Azure Radiance; to the right, the Brilliant Wheel; before, the Beckoning Star; behind, the Dark Warrior. Divine light blazes forth, and fragrant clouds gather thickly. The deities of heaven, earth, water, and land, bearing registers and ledgers; the marshals and generals of Fengdu and the mountain palaces, wielding axes and banners—all arrive amidst swirling auspicious mists and drifting celestial blossoms. Slowly descending upon the clouds, vigorously floating through the void, they bow at the celestial steps to reverently welcome the Sage’s arrival.\n\nFor this ritual, the humblest servant, kneeling with awe and trepidation, bows his head to the ground in reverence. With utmost sincerity, he kindles true incense and respectfully presents his petition:",
      "overlap_context": "alismanic Clouds of Incense.**\n\nThe Heavenly Worthies gather around the precious pearl to hear the Most High expound the Dharma. The Earth Spirits raise the jade platform to protect the Most High as He preaches the scripture. Having faithfully fulfilled their duties in former times, they must not be rashly startled today.\n\nThe *Incantation for Pacifying and Comforting the Spirits* shall now be proclaimed by all.\n\n**Recite:**\n**Heavenly Worthy of Primordial Beginning Who Pacifies and Stabilizes**",
      "start_char": 564,
      "end_char": 1166,
      "start_sentence": 43,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.086914777755737,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "虚元自然至真妙道元始天尊，上清真境玉晨道君灵宝天尊，太清仙境太上老君道德天尊，无上大罗昊天至尊玉皇上帝，祖师太上紫微玉虚上灵上皇大帝，勾陈星宫南极太微天皇大帝，承天效法护国圣母后土皇地祇，神霄雷霆九晨帝君，十方无极灵宝天尊，九天九炁生神帝君，度人三十二天帝君，五方五老梵炁天君，东华木公青童帝君，西灵金真祖母元君，五福十神太乙真君，大罗诸天上帝，主法天蓬元帅真君，苍天上帝，主法天猷元帅真君，丹天上帝，主法翊圣元帅真君，皓天上帝，主法佑圣真君，玄天上帝，主法中天大圣，北斗九晨上道星君，主法中天大圣，北斗天门王真君，北斗少卿王真君，北斗自在王真君，北斗行处王真君，北斗普照王真君，北斗如意王真君，北斗婆罗王真君，北斗隐必王真君，太微帝君，太上灵君，助法玄滋天君，三天丈人，三界丈人，三十六洞天君，三元三官大帝，诸位帝座星君，十一曜星君，三台华盖星君，二十八宿星君，十二宫分星君，周天星斗群真，上清宫主照某本命星君，照临星众，九天储福定命真君，天曹太皇万福真君，九天九霄天曹，诸司朝元官班圣众，火铃大圣星君，十极真人，北酆脚下洞阴境天国主者，太阴水帝君，七星真人，素车白马真君，左侍妙行真人，右侍玄冥真人，东斗生炁君，南斗司禁君，西斗生形君，北斗司命君，中斗总录君，灵宝五师真君，三省四相真君，伏魔启教孙闵二真人，保举师虚靖天师，玄通悟道真君，宗师柯谢黎郭诸大师君，诸法流芳袭庆祖宗度师真人，天仙，地仙，水仙，飞仙，三洞四辅经箓神仙，谌魏麻黄四仙元君，名山洞府云会仙真，伏魔院张包谢黄李五大天丁，三元唐葛周三将军，十天魔王，八景大神，三十六洞天丁力士，太玄青腰玉女，太玄夜光玉女，南斗火炬煞鬼使者，北斗炎炉科车使者，飞龙飞虎骑吏，阴境飞雷电吏，巨兽毒龙猛吏，师真门下吏兵，三炁大将军，祛邪三昧大将军，高飞五湖大将军，三五禁炁大将军，郁仪结大将军，北帝伏魔神咒总监大将军，敕水大将军，敕温大将军，敕石大将军，敕蜚音差虫大将军，敕火大将军，敕毒大将军，敕刀大将军，敕庙大将军，敕病大将军，敕船大将军，敕元阳大将军，敕平天大将军，敕召魂大将军，敕禁蛇虫大将军，博戏大将军，破泉大将军，禁鬼大将军，禁病大将军，禁虎狼大将军，天丁力士，天驺音邹甲卒，九元煞童，高刁北翁，严驾夔音葵龙，六丁八使，威剑神王，四目老翁，四明功曹，通真使者，吞魔食鬼二十四神，五帝神吏，三天魔王，三煞神王，杀鬼卫灵捕鬼大神，雷师，电师，洞渊神将，主坛雷霆邓辛张三大天君，随司天仙官将，东方毗音皮娄赖叉天王，南方毗留勒叉天王，西方提头博叉天王，北方毗沙门天王，上方大梵天王，下方转输圣王，八卦大神，八方威神，太和玉女，明镜玉女，黄素玉女，保命玉女，六丁玉女，青韶书右部大神，北斗诸部延寿续命度厄玉女，斗中行病典药玉女，斗中扶衰散祸真人，斗中降魔收魔神王，斗中诸部度厄益算童子，斗中左右天丁功曹天兵，斗中左右力士功曹使者，斗中仙人、道士、真人、神兵官吏，二十四治阳官，二十四治阴官，酆都下吏，九令主者，三十六洞魔王，二十四狱主者，北方大力飞天鬼众，旷野大神，五岳四渎溪涧大神圣众，地府诸司文武圣众，土府九垒真皇大帝，天府五黄大帝，瘟司行化神祇，考附缚邪降魔大使，无面目使，捉缚枷考四员天将，普现溥视天将，考照考召天将，北方永海大将军，沉天没地大将军，黑罩火罩大神，府县城惶主者，侧近宫庙王神，随驾主者，众神社令，里域正神，家奉香火明神，三界四直功曹使者，追摄官将神员，虚空过往察访神祇，经坛四府列真，参随侍卫圣众。",
      "translated_text": "The Primordial Celestial Worthy of the Mysterious Origin of the Dao, the Supreme Truth of the Void and Spontaneity;\nThe Jade Dawn Dao Lord of the Upper Clarity Realm, the Numinous Treasure Celestial Worthy;\nThe Supreme Venerable Lord Lao of the Grand Clarity Immortal Realm, the Celestial Worthy of Dao and Virtue;\nThe August Jade Emperor of the Great Lofty Heaven, the Supreme Celestial Worthy of the Vast Sky;\nThe Primordial Celestial Sovereign of the Purple Tenuity and Jade Void, the Supreme August Emperor of the Highest Numinosity;\nThe Celestial August Emperor of the Supreme Culmen, Lord of the Star Palace of the Celestial Hook;\nThe August Empress of Earth, the Holy Mother Who Upholds Heaven and Emulates the Dao, the Earthly Thearch;\nThe Nine Radiance Divine Lords of the Divine Empyrean and Thunderbolt;\nThe Numinous Treasure Celestial Worthies of the Ten Directions and Boundless Realms;\nThe Nine Celestial Nine Qi Divine Lords of Life and Spirit;\nThe Thirty-Two Celestial Emperors Who Deliver Humankind;\nThe Five Elders of the Five Directions, the Heavenly Lords of Brahma Qi;\nThe Azure Lad, Lord of the Eastern Florescence, the Divine Lord of Youth;\nThe Primordial Mother of the Western Numinosity, the Golden Perfected Ancestress;\nThe Perfected Lord of the Ten Celestial Deities and Five Fortunes, the Great Monad;\nThe Celestial Worthies of the Great Lofty Heavens;\nThe Perfected Lord Marshal Tianpeng, Master of the Dharma;\nThe Azure Celestial Thearch, the Perfected Lord Marshal Tianyou, Master of the Dharma;\nThe Cinnabar Celestial Thearch, the Perfected Lord Marshal Yisheng, Master of the Dharma;\nThe Luminous Celestial Thearch, the Perfected Lord Marshal Yousheng, Master of the Dharma;\nThe Mysterious Celestial Thearch, the Perfected Lord of the Central Heaven, the Great Sage;\nThe Nine Radiance Star Lords of the Northern Dipper’s Supreme Dao;\nThe Perfected Lord of the Northern Dipper’s Celestial Gate, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Lesser Minister, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Sovereign Freedom, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Movement, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Universal Illumination, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Compliance, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Pāramitā, King of the Northern Dipper;\nThe Perfected Lord of the Northern Dipper’s Concealment, King of the Northern Dipper;\nThe Divine Lord of the Supreme Culmen;\nThe Numinous Lord of the Supreme;\nThe Heavenly Lord Xuanzī, Assistant of the Dharma;\nThe Three Heavenly Elders;\nThe Three Realm Elders;\nThe Lords of the Thirty-Six Grotto-Heavens;\nThe Three Primordials and Three Officials, the Great Emperors;\nThe Star Lords of the Imperial Thrones;\nThe Eleven Luminaries Star Lords;\nThe Three Terraces and Canopy Star Lords;\nThe Twenty-Eight Constellations Star Lords;\nThe Star Lords of the Twelve Palaces;\nThe Multitudes of Perfected Beings of the Myriad Stars and Celestial Dipper;\nThe Lord of the Upper Clarity Palace, Who Illuminates the Natal Star of So-and-So;\nThe Host of Illuminating Stars;\nThe Perfected Lord of the Nine Heavens Who Stores Blessings and Determines Destiny;\nThe Celestial Lord of the Grand Court of Heaven, Who Bestows Myriad Fortunes;\nThe Celestial Officials of the Nine Heavens and Nine Empyreans, the Hosts of Court Attendants Who Face the Origin;\nThe Star Lords of the Great Sage of the Fire and Bell;\nThe Perfected of the Ten Poles;\nThe Rulers of the Dark Realm Beneath Mount Fengdu, the Celestial Kingdom of the Nether Abyss;\nThe Water Thearch of the Great Yin;\nThe Seven Star Perfected;\nThe Perfected Lord of the White Horse and Plain Chariot;\nThe Perfected of Wondrous Conduct, Left Attendant;\nThe Perfected of the Mysterious Darkness, Right Attendant;\nThe Lord of Life Qi of the Eastern Dipper;\nThe Lord Who Governs Prohibitions of the Southern Dipper;\nThe Lord of Life Forms of the Western Dipper;\nThe Lord Who Governs Destiny of the Northern Dipper;\nThe Lord Who Records All of the Central Dipper;\nThe Five Masters of the Numinous Treasure;\nThe Perfected of the Three Ministries and Four Assistants;\nThe Two Perfected Sun and Min, Who Subdue Demons and Inaugurate the Teachings;\nThe Heavenly Master Xu Jing, Who Preserves Emptiness and Tranquility, the Recommending Teacher;\nThe Perfected Lord Who Penetrates the Dao with Mystic Understanding;\nThe Lineage Masters, the Great Perfected Lords Ke, Xie, Li, and Guo;\nThe Perfected of the Ancestral Lineage Who Transmit the Dharma and Bestow Blessings, the Masters Who Deliver the Ancestors;\nThe Celestial Immortals, Earthly Immortals, Water Immortals, Flying Immortals;\nThe Divine Immortals of the Three Caverns, Four Supplements, Scriptures, and Registers;\nThe Four Divine Lords Shen, Wei, Ma, and Huang;\nThe Cloud-Assembled Perfected of the Grotto-Heavens and Famous Mountains;\nThe Five Great Celestial Soldiers of the Demon-Subduing Court: Zhang, Bao, Xie, Huang, and Li;\nThe Three Generals Tang, Ge, and Zhou of the Three Primordials;\nThe Ten Heavenly Demon Kings;\nThe Eight Radiance Great Spirits;\nThe Celestial Soldiers and Mighty Ones of the Thirty-Six Grotto-Heavens;\nThe Jade Maidens of the Azure Waist of the Great Mystery;\nThe Jade Maidens of the Night Radiance of the Great Mystery;\nThe Fire-Torch Demon-Quelling Envoys of the Southern Dipper;\nThe Furnace and Chariot Envoys of the Northern Dipper’s Scorching Cauldron;\nThe Flying Dragon and Flying Tiger Riders;\nThe Thunder and Lightning Envoys of the Dark Realm;\nThe Mighty Envoys of Ferocious Beasts and Poisonous Dragons;\nThe Soldiers and Officers of the Perfected Master’s Gate;\nThe Three Qi Great Generals;\nThe Great Generals Who Dispel Evil with Samādhi;\nThe Great Generals Who Soar Across the Five Lakes;\nThe Great Generals of the Three-Five Prohibitive Qi;\nThe Great Generals Yu Yi and Jie Lan;\nThe Great General Who Oversees the Divine Mantras That Subdue Demons for the Northern Thearch;\nThe Great General Who Commands Water;\nThe Great General Who Commands Warmth;\nThe Great General Who Commands Stone;\nThe Great General Who Commands Flying Insects and Dispels Pestilence;\nThe Great General Who Commands Fire;\nThe Great General Who Commands Poison;\nThe Great General Who Commands Blades;\nThe Great General Who Commands Temples;\nThe Great General Who Commands Illness;\nThe Great General Who Commands Ships;\nThe Great General Who Commands Primordial Yang;\nThe Great General Who Commands the Pacification of Heaven;\nThe Great General Who Summons Souls;\nThe Great General Who Prohibits Serpents and Insects;\nThe Great General of Gambling;\nThe Great General Who Breaks Springs;\nThe Great General Who Prohibits Ghosts;\nThe Great General Who Prohibits Illness;\nThe Great General Who Prohibits Tigers and Wolves;\nThe Celestial Soldiers and Might Ones;\nThe Celestial Couriers and Armored Soldiers;\nThe Nine Primordial Demon-Quelling Youths;\nGao Diao and Bei Weng;\nThe Mighty Driver Kui Long;\nThe Six Ding and Eight Messengers;\nThe Divine Kings of the Mighty Swords;\nThe Four-Eyed Elders;\nThe Four Illuminations Merit Officers;\nThe Envoys Who Communicate with the Perfected;\nThe Twenty-Four Spirits Who Devour Demons and Consume Ghosts;\nThe Divine Officers of the Five Thearchs;\nThe Three Heavenly Demon Kings;\nThe Three Demon-Quelling Divine Kings;\nThe Great Spirits Who Capture Ghosts and Protect the Numinous, Who Slay Ghosts;\nThe Thunder Masters, Lightning Masters;\nThe Divine Generals of the Abyssal Caverns;\nThe Three Great Celestial Lords of Thunder: Deng, Xin, and Zhang, Masters of the Altar;\nThe Celestial Immortal Officers and Generals of the Subordinate Bureaus;\nVaiśravaṇa, the Heavenly King of the East;\nVirūḍhaka, the Heavenly King of the South;\nVirūpākṣa, the Heavenly King of the West;\nDhṛtarāṣṭra, the Heavenly King of the North;\nMahābrahmā, the Heavenly King of the Upper Realm;\nThe Holy King Who Transports Offerings of the Lower Realm;\nThe Great Spirits of the Eight Trigrams;\nThe Mighty Spirits of the Eight Directions;\nThe Jade Maidens of Grand Harmony;\nThe Jade Maidens of the Luminous Mirror;\nThe Jade Maidens of the Yellow Simplicity;\nThe Jade Maidens Who Preserve Destiny;\nThe Six Ding Jade Maidens;\nThe Great Spirits of the Right Division of the Azure Music Register;\nThe Jade Maidens of the Northern Dipper’s Various Bureaus Who Extend Lifespan, Continue Destiny, and Deliver from Calamity;\nThe Jade Maidens Who Govern Illness and Dispense Medicines Within the Dipper;\nThe Perfected Who Support the Weak and Dispel Misfortune Within the Dipper;\nThe Divine Kings Who Descend Demons and Seize Demons Within the Dipper;\nThe Youths of the Dipper’s Various Bureaus Who Deliver from Calamity and Increase Lifespan;\nThe Celestial Soldiers and Merit Officers of the Dipper’s Left and Right Celestial Soldiers;\nThe Envoys and Merit Officers of the Dipper’s Left and Right Mighty Ones;\nThe Immortals, Daoists, Perfected, Divine Soldiers, and Officers Within the Dipper;\nThe Yang Officials of the Twenty-Four Treatments;\nThe Yin Officials of the Twenty-Four Treatments;\nThe Officers Beneath Fengdu;\nThe Masters of the Nine Commands;\nThe Demon Kings of the Thirty-Six Grotto-Heavens;\nThe Masters of the Twenty-Four Prisons;\nThe Multitudes of Flying Ghosts of the Mighty North;\nThe Great Spirits of the Wilderness;\nThe Sacred Multitudes of the Five Marchmounts, Four Waterways, Streams, and Ravines;\nThe Civil and Martial Sacred Multitudes of the Earthly Bureaus;\nThe Ninefold Walled True August Emperors of the Earthly Mansion;\nThe Five Yellow Great Emperors of the Celestial Mansion;\nThe Divine Thearchs Who Disseminate Transformation for the Plague Bureau;\nThe Great Envoys Who Bind and Subdue Evil, Who Descend Demons;\nThe Envoys Without Faces;\nThe Four Celestial Generals Who Capture, Bind, Shackle, and Interrogate;\nThe Celestial General Who Universally Manifests and Universally Surveils;\nThe Celestial Generals Who Interrogate, Illuminate, Summon, and Convene;\nThe Great General of the Eternal Sea of the North;\nThe Great General Who Sinks Heaven and Submerges Earth;\nThe Great Spirits of the Black Canopy and Fire Canopy;\nThe Masters of the Prefectures, Counties, and Cities;\nThe Divine Kings of the Nearby Palaces and Temples;\nThe Masters Who Follow the Procession;\nThe Divine Lords of the Altars and Communities;\nThe Orthodox Spirits of the Villages and Domains;\nThe Illuminated Spirits Worshipped in the Home;\nThe Merit Officers and Envoys of the Three Realms and Four Watches;\nThe Divine Officers and Generals Who Pursue and Seize;\nThe Divine Thearchs Who Inspect and Investigate the Void and Its Passages;\nThe Arrayed Perfected of the Four Mansion Altars;\nThe Attending and Guarding Sacred Multitudes.",
      "overlap_context": "d generals of Fengdu and the mountain palaces, wielding axes and banners—all arrive amidst swirling auspicious mists and drifting celestial blossoms. Slowly descending upon the clouds, vigorously floating through the void, they bow at the celestial steps to reverently welcome the Sage’s arrival.\n\nFor this ritual, the humblest servant, kneeling with awe and trepidation, bows his head to the ground in reverence. With utmost sincerity, he kindles true incense and respectfully presents his petition:",
      "start_char": 1166,
      "end_char": 2606,
      "start_sentence": 91,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 55.60375356674194,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "恭愿是圣是神临法会，乃文乃武降经坛，拱俟恩光，降临坛所。 臣不揣凡愚，僭伸奏请，伏想攀龙附凤，四圣簇御，以出天门。 驾鹤骑鲸，五老翼辕，而登云路。 敕下天仙地仙水仙之官属，指挥经部兵部法部之威神。 凭浩浩，立飘飘，春回瓮音蓊牖音右。 扇巍巍，显翼翼，光映灯坛。 天王威备於上下四方，法从礼严於冥阳三界。 各恭拜舞，并肃欢呼，仰望清光。 奉安法席，恭安宝座，庸献凡仪。 伏愿殿上衮衣，明下天外九龙之驾； 杯中素涛，起进江南二月之春。 籍音谢薄物以荐馨音欣香，惟至尊俯怜愚意，鞠躬再拜，清茗沦音药陈。 伏以红光紫雾，云舆适下於尘凡； 绿蚁黄封，凡礼少陈於帝陛。 既蒙简在，愿赐歆尝。 缅想粹容，谨陈初献。 伏以仙坛三级，遥瞻北极之天。 流霞一觞，尚想西池之宴。 既众真之胥会，容薄礼之再陈。 恭对清严，重斟绿醑胥上声。 伏以和万事，解千愁，闻之俚音里俗。 合自然，通大道，言自谪仙。 睹清光咫尺於经坛，荐薄味再三於盏斝音假。 一心皈命，三献陈情。 臣闻洞玄洞虚三级之仙坛，肇音兆建无声无臭九天之金阙。 匪遥将宣神咒之妙经，先望玄虚而请命，冀开宝笈，敷演琅书，词意披陈，愿垂省览。 宣斋意。 向来词意，宣读云周，谅沐天恩，必垂睿听。 详夫《太上北帝伏魔神咒妙经》者，出自上清妙真经文，结气凝云，经天纬地。 上閟玉京金阙，下藏洞府名山。 流传於龙汉劫中，宣布於阎浮界内。 八字灵篆，腾八角以垂芒。 十品玄文，制十天之魔魅。 蒇扬妙义，叙演玄功。 七元秘诀而保国安民，六洞阴宫而斩妖戮怪。 说妙经而捍厄，咒神印以成图。 金箓升真，玉符度命。 扫千灾，迎百福。 拯六道，济四生。 更叙九龙，能招众宝。 辟尸大箓，佩之则增长道缘。 秘篆隐文，修之而证登仙品。 神兵护国，妙法度人。 自非骨相合仙，难睹真文出世。 今则瞻巍峨，座演空洞文宝。 咒宣时，渐听琳琅之隐韵。 灵书诵处，定看金玉以露形。 仰冀圆清，俯矜方赤。 特颁睿旨，揭示琼编。 典经玉郎，掣开三八黄金锁。 捧香童子，翻宣一丈紫琼文。 千百重道炁冥扶，四万劫至人欣遇。 将吏戒严於内外，邪妖屏斥拎迩遐。 伏愿佳气郁葱，瑞光散乱。 红云浮一朵，觐咫尺之天颜。 灵光集万真，肃森严之仙仗。 略伸启奏，愿赐感通。 诵念周圆，都伸回向。 干冒天威，下情无任，激切俟命之至。 谨言。 三礼",
      "translated_text": "May it be reverently hoped that the sagely and divine ones grace this Dharma assembly,\nThat the civil and martial hosts descend upon the scripture altar,\nAwaiting in reverence the radiance of grace,\nTo deign to alight upon this altar ground.\n\nYour servant, though unworthy and foolish,\nPresumes to offer this petition,\nHumbly imagining the Four Saints escorting the imperial procession as one clings to the dragon and phoenix,\nEmerging through the Gate of Heaven.\nRiding cranes and whales,\nThe Five Elders flanking the axle,\nAscending the cloud-paths.\n\nDecrees issue to the celestial, terrestrial, and aquatic immortals’ officers,\nCommanding the mighty spirits of the Scripture Bureau, the Military Bureau, and the Dharma Bureau.\nRelying on the vast and boundless,\nStanding in the whirling and soaring,\nSpring returns with the sound of jars from the casement.\nFanning the towering and majestic,\nManifesting the solemn and awe-inspiring,\nLight illumines the lamp altar.\n\nThe Heavenly Kings’ might pervades the four directions above and below,\nThe Dharma retinue’s rites are strict across the three realms of the unseen and the manifest.\nEach reverently bows and dances,\nAll solemnly cheer in unison,\nGazing upward to the pure radiance.\n\nThe Dharma seat is respectfully established,\nThe precious throne reverently installed,\nAnd humble offerings are presented.\nMay it be hoped that upon the palace hall,\nThe imperial robes shine beyond the nine dragons’ chariot of heaven;\nIn the cup’s clear waves,\nSpring arises as in Jiangnan’s second month.\n\nWith these meager offerings, I humbly present their fragrance,\nPraying the Most Exalted deign to favor this foolish intent.\nBowing deeply again,\nClear tea and herbs are respectfully arranged.\n\nThus, with crimson light and purple mist,\nThe cloud chariot descends to the mortal dust;\nWith green ants and yellow seals,\nThese humble rites are but slightly arrayed before the imperial steps.\nSince they have been graciously noted,\nMay they be granted the honor of partaking.\n\nGazing afar at the three-tiered immortal altar,\nOne beholds the northern pole of heaven;\nWith a single goblet of flowing rosy clouds,\nOne still recalls the banquet of the Western Pool.\nAs the assembled perfected gather,\nPermit these modest rites to be offered again.\nFacing the pure and solemn,\nThe green wine is poured once more.\n\nThus, to harmonize all affairs,\nTo dissolve a thousand sorrows—\nSuch is the saying of the village folk.\nTo unite with nature,\nTo commune with the Great Dao—\nSuch are the words of the banished immortal.\n\nBeholding the pure radiance close at hand upon the scripture altar,\nThese humble flavors are offered again and again in cups and goblets.\nWith wholehearted devotion,\nThe three libations express this sentiment.\n\nYour servant has heard that the three-tiered immortal altar of the Cavernous Mystery and Cavernous Void\nFirst established the soundless and scentless golden gates of the Nine Heavens.\nBefore the distant proclamation of the divine incantations of the wondrous scripture,\nOne first gazes toward the mysterious void to seek command,\nHoping to open the precious casket,\nTo unfold the jade texts,\nAnd to lay bare the words and meanings,\nThat they may be graciously perused.\n\nThe intent of the purification rite is proclaimed.\nThe preceding words have been read in full,\nSurely bathed in celestial grace,\nThey must have reached the sagely ears.\n\nNow, as for the *Wondrous Scripture of the Most High Northern Thearch’s Divine Incantations to Subdue Demons*,\nIt emerges from the *Upper Clarity Wondrous Perfected Scripture*,\nFormed of condensed qi and congealed clouds,\nWeaving through heaven and earth.\nAbove, it is hidden in the Jade Capital and Golden Gates;\nBelow, it is concealed in the grotto-heavens and famous mountains.\nTransmitted during the Dragon Han kalpa,\nPromulgated within the Jambudvīpa realm.\nThe eight-character numinous seal,\nRises from the eight corners to cast its radiance.\nThe ten-scroll mysterious text,\nSubdues the demonic and spectral of the ten heavens.\nIts wondrous meanings are expounded,\nIts mysterious merits recounted.\nThe seven primordial secret formulas protect the state and pacify the people;\nThe six grottoes of the yin palaces slay demons and destroy monsters.\nThe recitation of the wondrous scripture wards off calamity,\nThe divine incantations and talismans complete the design.\nThe golden register ascends the perfected,\nThe jade talisman delivers lives.\nSweeping away a thousand disasters,\nWelcoming a hundred blessings.\nRescuing the six paths,\nAiding the four kinds of life.\nFurthermore, the nine dragons,\nCan summon all treasures.\nThe *Great Register to Ward Off Corpses*,\nWhen worn, lengthens one’s Dao affinity.\nThe hidden seals and cryptic texts,\nWhen cultivated, lead to the attainment of immortal ranks.\nThe divine soldiers protect the state,\nThe wondrous Dharma delivers beings.\n\nSince only those whose bone structure accords with immortality\nMay behold the true text’s revelation,\nNow, gazing upon the towering seat,\nThe empty and cavernous scriptural treasures are expounded.\nAs the incantations are proclaimed,\nOne gradually hears the hidden melody of jade-like tones.\nWhere the numinous scripture is recited,\nOne surely sees the golden and jade forms revealed.\n\nLooking up, I hope for the perfection of the pure;\nLooking down, I pray for compassion toward the earthly.\nMay a special sagely decree be issued,\nTo display the jade-bound compilation.\nThe Jade Lad of the Canonical Bureau,\nUnlocks the three-times-eight golden locks.\nThe incense-bearing youths,\nUnfurl and proclaim the one-zhang purple jade text.\nA thousand, ten thousand layers of Dao qi mysteriously assist,\nThe perfected of forty thousand kalpas rejoice in this encounter.\nThe officers and generals stand guard within and without,\nEvil demons are banished far and near.\n\nMay it be hoped that auspicious vapors rise in lush abundance,\nAnd propitious lights scatter in profusion.\nA single floating crimson cloud,\nDraws near to the celestial countenance.\nA myriad numinous lights gather the ten thousand perfected,\nThe immortal retinue stands in solemn majesty.\n\nThis humble petition is briefly presented,\nHoping for a response through spiritual resonance.\nThe recitation and dedication are complete,\nAll is offered in reverence.\nPresuming upon the celestial might,\nThis servant’s heart is filled with fervent anticipation,\nAwaiting the command.\n\nRespectfully spoken.\nThe Three Bows.",
      "overlap_context": " Palaces and Temples;\nThe Masters Who Follow the Procession;\nThe Divine Lords of the Altars and Communities;\nThe Orthodox Spirits of the Villages and Domains;\nThe Illuminated Spirits Worshipped in the Home;\nThe Merit Officers and Envoys of the Three Realms and Four Watches;\nThe Divine Officers and Generals Who Pursue and Seize;\nThe Divine Thearchs Who Inspect and Investigate the Void and Its Passages;\nThe Arrayed Perfected of the Four Mansion Altars;\nThe Attending and Guarding Sacred Multitudes.",
      "start_char": 2606,
      "end_char": 3528,
      "start_sentence": 92,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.36004853248596,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "兆存元命神，两手恰开闭留塞诀，剔斗一座，盖头左巳文。 毛扇拂风，吹散灰烬，卯文。 东方炁生成元命。 又左手扇扇除故气，悉皆清净。 右剑画三级坛，左斗印，丁罡三步，上三级坛作法，召五帅并诸将。 至白事意，嘱付如治病。 下横天黑箓摄崇，指挥心将守护患身。 摄诀画狱，摄至押入，行震艮法。 吾是太上之子，为老君所使。 头戴日月，身佩北斗。 吾有乾灵之兵，百十万众，在吾左右。 前有万硕镬汤，后有黄金钺斧。 吾朝太上，忽逢神将。 教吾杀鬼法，授吾斩鬼方。 上带太素符，收摄诸不祥。 上告天帝，召唤吏兵。 头戴华盖，足蹑魁罡。 何神不走，何鬼敢当。 缚汝必定，治汝横伤。 病人先无罪状，何敢辄犯贤良。 吾含天地之正炁，咒破邪鬼之殃。 咒神神自死，咒鬼鬼自亡。 急急如律令。 下令　　遣将 天雷隐隐。 巳。 地雷轰轰。 卯。 龙雷卷水，辰。 水雷波翻。 子。 社令火雷。 卯。 霹雳交横。 寅。 机缄一发，摄捉邪精。 艮。 急急如律令。 次存坛上一层，红光交射，紫气郁勃。 帝尊临御三界，万灵朝元。 中层，北斗、五星、二十八宿、日月众星，主法高真经中神仙，宰执在焉。 下一层，酆都水国、五岳、十地洞天福地名山神仙，齐集其中。 次瞻望北帝御座，存元神奏启，愿赐天光加被臣，化现立获感通。 元命诀擎起，存左右侍卫，存神为祖师北帝，复存即紫微天宫。 光映十方，四圣随符镇四方，安营布阵。 本坛天将居左，经中神仙居右，天界天仙居东北，地界神仙居东南，水府神仙居西南，阳界神祇居西北，诸天魔王天丁力士居左右。 上有四天王，下有八卦大神。 每存一方，有神将二员，各统天兵百万众，排兵布阵，赫奕威严，镇护十方。 如法存变，次号召指挥将吏署事。 敕当界里社正神，本家门丞户尉，司命土地，井泉龙王，司溷音混等神，各遵经旨，立于坛外之左。 敕岳隍两司主者，守土祀典之神，统领兵骑，各遵经旨，立于坛外之右。 敕酆都馘魔朗灵，关羽斩鬼，桑铜部领兵骑，各遵经旨，行神布炁。 立于艮宫，专一塞断鬼路。 剿子小切灭邪妖。 敕雷首律令大神邓伯温，银牙猛吏辛汉臣，火雷使者张元伯，部领五方蛮雷使者，立于震宫，请降东方木炁，摄灭粪土之精。 敕雷门左伐魔使苟翌冲，右伐魔使毕崱，部领兵级，立于巽宫，专一扫荡妖氛，革除魔试。 敕火犀雷府朱彦，南极乌阳使者吴元达，部领兵吏，立于离宫，专一请降南方火炁，摄伏死金之精。 敕天医火云擒龙都统赵公明，专一行神布炁，立于坤宫，开泰人门，保安家眷。 敕地祇上将温琼，地司太岁殷郊，一合领兵，立于兑宫，请降西方金炁，摄灭腐木之精。 敕天医院总管许仙定，领带兵骑，专一守卫天门，祇迎天仗，传宣咒敕，飞行号令。 敕飞天毒雷紏察陶公济，统领兵级，立于坎宫，专一请降北方水炁，摄灭炎火之精。 敕北帝伏魔神咒总监大将军，宣行咒敕，都监斗口，专一请降中央土气，摄灭阴水之精。 敕雷霆都督青帝天君辛汉臣，紫庭院素枭三神，同雷将会合北极，伏魔法中。 风雷水火八大神王，主副官将，天蓬三十六员大将，飞鹰走犬大神，紫庭内外天仙官将，诸葛武侯铁印，法中八卦九宫大神，十七神王，地祇主将，王杞十大太保，统率三雄七捷将兵骑吏，各各专一，严加巡警，匝绕经坛。",
      "translated_text": "The Perfected’s primal life-spirit is invoked,\nHands execute the Opening-Closing-Retaining-Sealing Mudra,\nA Dipper constellation is traced—\nthe cap bears the *yi* trigram of the left *si* position.\nA feather fan sweeps the wind,\nBlowing away ashes and embers—\nthe *mao* trigram.\nThe qi of the Eastern Direction engenders and completes the primal life.\nAgain, the left hand wields the fan to expel stale qi,\nAll is made immaculately pure.\n\nThe right hand’s sword inscribes a three-tiered altar,\nThe left hand’s Dipper Seal,\nThree steps of the *ding*-stem *gang* pace,\nAscend the three-tiered altar to perform the rite,\nSummoning the Five Marshals and all their generals.\nProceed to state the matter at hand,\nEntrusting them as in healing illness.\nDeploy the *Celestial Black Register* to subdue malevolent spirits,\nCommand the Heart Marshal to guard and protect the afflicted body.\nExecute the Seizing Mudra and inscribe the prison,\nSeize and press them into confinement,\nEnacting the *Zhen-Gen* method.\n\n“I am a child of the Most High,\nDispatched by the Venerable Lord.\nI wear the sun and moon upon my head,\nBear the Northern Dipper at my waist.\nI command the Celestial Legions of the Qian,\nA million hundred thousand strong,\nArrayed at my left and right.\nBefore me boil the cauldrons of myriad *shuo*,\nBehind me gleam the axes of yellow gold.\nWhen I attend the Most High,\nI suddenly encounter divine generals.\nThey teach me the method to slay demons,\nBestow upon me the formula to decapitate ghosts.\nI bear the *Supreme Simplicity Talisman*,\nTo gather and subdue all inauspicious forces.\nI report to the Heavenly Thearch,\nSummoning the officers and soldiers.\nI wear the floral canopy upon my head,\nTread the *Kui-Gang* beneath my feet.\nWhat spirit dares not flee?\nWhat ghost dares stand before me?\nI bind you without fail,\nPunish your wanton harm.\nThe patient has committed no offense—\nHow dare you assail the worthy and good?\nI contain the upright qi of Heaven and Earth,\nMy incantation shatters the misfortune of wayward ghosts.\nIncant the gods, and gods perish of themselves;\nIncant the ghosts, and ghosts perish of themselves.\nSwiftly, swiftly, in accordance with statute and ordinance!”\n\nIssue the command—\nDispatch the generals:\n\n“Heavenly thunder rumbles in concealment—*si*.\nEarthly thunder roars in tumult—*mao*.\nDragon thunder coils the waters—*chen*.\nWater thunder churns the waves—*zi*.\nEarth Deity’s fire thunder—*mao*.\nThunderbolts crisscross—*yin*.\nThe trigger is sprung,\nSeizing and capturing wayward spirits—*gen*.\nSwiftly, swiftly, in accordance with statute and ordinance!”\n\nNext, visualize the altar’s upper tier:\nCrimson light interweaves in radiant beams,\nPurple qi billows in abundance.\nThe August Sovereign presides over the Three Realms,\nMyriad spirits pay homage at the Primal Origin.\nThe middle tier:\nThe Northern Dipper, Five Stars, Twenty-Eight Constellations,\nSun, moon, and all celestial bodies,\nThe perfected immortals of the scriptures,\nThe stewards of the Dao—all are present.\nThe lower tier:\nThe Fengdu Water Realm, the Five Marchmounts,\nThe Ten Lands, Grotto-Heavens, Blessed Terrains, and sacred mountains—\nTheir divine immortals gather therein.\n\nNext, gaze toward the throne of the Northern Thearch,\nVisualize the primal spirit presenting the petition,\nHoping for the bestowal of celestial radiance to empower the officiant,\nManifesting immediate spiritual resonance.\nRaise the *Primal Life Mudra*,\nVisualize the attendants at left and right,\nEnvision the Northern Thearch as the ancestral master,\nThen visualize the Purple Tenuity Heavenly Palace.\nLight illumines the ten directions,\nThe Four Saints follow the talismans to guard the four quarters,\nEncamping and arraying the formations.\nThe celestial generals of this altar stand to the left,\nThe immortals of the scriptures stand to the right,\nThe celestial immortals of the heavenly realms reside in the northeast,\nThe terrestrial immortals of the earthly realms reside in the southeast,\nThe immortals of the watery palaces reside in the southwest,\nThe deities of the yang realms reside in the northwest,\nThe demon kings of the various heavens, the celestial soldiers and valiant warriors, stand to the left and right.\nAbove are the Four Heavenly Kings,\nBelow are the great deities of the Eight Trigrams.\nFor each direction visualized,\nTwo divine generals are present,\nEach commanding a million celestial soldiers,\nDeploying troops and arraying formations,\nTheir majesty resplendent and awe-inspiring,\nGuarding and protecting the ten directions.\n\nProceeding according to the rite, next issue the summons and commands to the officers and generals to assume their posts:\n\n“Decree: The local Earth Deity and Community Lord,\nThe household deities of this home—Gate Marshal and Door Warden,\nThe Controller of Destiny and Earth Deity,\nThe Dragon Kings of wells and springs,\nThe deities of latrines and the like—\nAll shall obey the scriptural ordinances,\nStanding to the left outside the altar.\n\nDecree: The administrators of the Marchmounts and Moats,\nThe deities of the local soil and sacrificial rites,\nLeading their troops and cavalry—\nAll shall obey the scriptural ordinances,\nStanding to the right outside the altar.\n\nDecree: The luminous spirits of Fengdu who decapitate demons,\nGuan Yu who slays ghosts,\nSang Tong who leads the troops and cavalry—\nAll shall obey the scriptural ordinances,\nProceeding to emit and distribute qi,\nStanding in the *Gen* Palace,\nSolemnly sealing and blocking the paths of ghosts,\nExterminating and annihilating wayward spirits.\n\nDecree: Deng Bowen, the great deity of Thunder’s Origin and Statutes,\nXin Hanchen with his silver fangs,\nZhang Yuanbo, the Fire Thunder Envoy,\nLeading the Thunder Envoys of the Five Directions—\nStand in the *Zhen* Palace,\nInvoking the descent of the Eastern Wood qi,\nSubduing and annihilating the spirits of filth and dust.\n\nDecree: Gou Yichong, the Left Demon-Subduing Envoy,\nBi Ze, the Right Demon-Subduing Envoy,\nLeading their troops—\nStand in the *Xun* Palace,\nSolemnly sweeping away demonic miasmas,\nEradicating demonic trials.\n\nDecree: Zhu Yan of the Fire Rhinoceros Thunder Bureau,\nWu Yuanda, the Southern Culmen Black Yang Envoy,\nLeading their officers and troops—\nStand in the *Li* Palace,\nSolemnly invoking the descent of the Southern Fire qi,\nSubduing and taming the spirits of dead metal.\n\nDecree: Zhao Gongming, Commander of the Heavenly Physicians and Fire Cloud Dragon-Seizing Host,\nSolemnly proceeding to emit and distribute qi,\nStanding in the *Kun* Palace,\nOpening the Gate of Human Prosperity,\nEnsuring the safety of the household.\n\nDecree: Wen Qiong, the Earth Deity’s Marshal,\nYin Jiao, the Earth Controller’s Grand Year—\nTogether leading their troops,\nStanding in the *Dui* Palace,\nInvoking the descent of the Western Metal qi,\nSubduing and annihilating the spirits of rotten wood.\n\nDecree: Xu Xianding, Director of the Heavenly Physicians’ Court,\nLeading his troops and cavalry—\nSolemnly guarding the Celestial Gate,\nReverently receiving the celestial procession,\nTransmitting and proclaiming the incantations and decrees,\nSwiftly conveying the commands.\n\nDecree: Tao Gongji, the Flying Celestial Toxic Thunder Investigator,\nLeading his troops—\nStanding in the *Kan* Palace,\nSolemnly invoking the descent of the Northern Water qi,\nSubduing and annihilating the spirits of scorching fire.\n\nDecree: The Northern Thearch’s Demon-Subduing Incantation, the Grand General and Chief Overseer,\nProclaiming the incantations and decrees,\nSupervising the Dipper’s Mouth—\nSolemnly invoking the descent of the Central Earth qi,\nSubduing and annihilating the spirits of yin waters.\n\nDecree: Xin Hanchen, the Thunder Marshal and Azure Thearch Celestial Lord,\nThe Three Spirits of the Purple Court’s Plain Owl,\nTogether with the Thunder Generals,\nAssembling at the Northern Culmen,\nWithin the Demon-Subduing Rite.\nThe Eight Great Divine Kings of Wind, Thunder, Water, and Fire,\nThe principal and deputy officers and generals,\nThe thirty-six great generals of Tianpeng,\nThe great deities of flying hawks and running hounds,\nThe celestial immortals and generals within and without the Purple Court,\nZhuge Liang’s Iron Seal,\nThe great deities of the Eight Trigrams and Nine Palaces within the rite,\nThe Seventeen Divine Kings,\nThe marshals of the earthly deities,\nWang Qi’s Ten Great Guardians—\nAll lead the troops, cavalry, and officers,\nEach solemnly and single-mindedly\nIntensifying their patrols and vigilance,\nEncircling the scriptural altar.”",
      "overlap_context": "single floating crimson cloud,\nDraws near to the celestial countenance.\nA myriad numinous lights gather the ten thousand perfected,\nThe immortal retinue stands in solemn majesty.\n\nThis humble petition is briefly presented,\nHoping for a response through spiritual resonance.\nThe recitation and dedication are complete,\nAll is offered in reverence.\nPresuming upon the celestial might,\nThis servant’s heart is filled with fervent anticipation,\nAwaiting the command.\n\nRespectfully spoken.\nThe Three Bows.",
      "start_char": 3528,
      "end_char": 4828,
      "start_sentence": 153,
      "end_sentence": 216,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.630133867263794,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "仍仰於坛门之左，建天狱一所。 坛门之右，建地狱一所。 应是蜉蝣浪鬼，虚耗钝滞，赤口白舌，雌雄注射，伏尸故气，远近亡魂，直符破射，冷庙行病，疫疠之鬼，冤尤咒诅魍魉魈通，一切违天逆地无道不正之鬼，摄赴吾魁罡之下，受死，无动无作，不得犯吾咒。 如有犯吾神咒者，头破脑裂，碎如微尘。 急急如律令。 再下横天黑箓，作禁坛法 东禁西禁，南禁北禁，上禁连天，下禁连地，中禁百鬼邪精。 以上握权兵诀，子暮都管诀，坤再握权兵诀，印诵坛咒。 朱雀陵光，神威内张。 山源四镇，鬼兵逃亡。 神蛇吐气，邪精伏藏。 魂台四明，琼户玲琅。 玉真巍峨，坐镇明堂。 手挥紫霞，头戴神光。 执咏洞经，三十九章。 中有辟邪，龙虎威冈。 猛兽奔牛，衔刀吞枪。 揭山钟音攫。 天，神雀毒龙。 六颔吐火，啖鬼之王。 电猪雷火，掣星流横。 袅磕驳灼，逆风横行。 天禽罗阵，皆在我傍。 吐火万里，以除不祥。 群情启道，封落山乡。 千神万灵，骈首叩颡。 泽尉捧炉，为我烧香。 所在所经，万神奉迎。 天兽来卫，千精震伏，莫干我气。 急急如律令。 作锁坛法 天煞煌煌，地煞正方。 邪精百鬼，何敢隐藏。 飞罡一吸，万鬼消亡。 左魁右罡，神圣摄锁。 毋令走逸。 喝云：神将疾速锁坛。 吾奉北帝敕，急急如律令。 作锁坛法，取熙抛诀：指挥将吏锁 坛，存北帝神。 启奏元始上帝，步斗 存神变座。 法事臣闻太虚廖廓，视不见，听不闻。 至道杳冥，叩必通，求必应。 以今坛场，肃建经法，流通上下四方。 宛若南丹世界，周回百里。 即为北极天宫，四炁朗清。 万灵振伏，魔王悉皆拱卫。 国土莫不缅平。 如元始在宝珠中。 若太上升玉局座，琼音诞布，金口宣传。 十品敷扬，福海深而寿山固。 五方安镇，邪门闭而正道开。 平坐至心诵经如法。 举。 开函演奥天尊。 调声诵经 叙议品",
      "translated_text": "Still, to the left of the altar gate, erect a Celestial Prison.\nTo the right of the altar gate, erect an Earthly Prison.\nAll ephemeral, wanton ghosts—those who waste and stagnate,\nthose who slander with red mouths and white tongues,\nthose who cast malevolent glances and poisonous stares,\nlingering corpses and stale qi,\nlost souls near and far,\ndirect talismans and piercing curses,\nghosts of cold temples and wandering sickness,\nplague demons,\ngrievances, vengeful spells, and specters of all kinds—\nevery ghost that defies Heaven, rebels against Earth,\nacts without the Dao, or strays from righteousness—\nseize and deliver them beneath my *kuigang*,\nto suffer death, motionless and inert,\nforbidden to violate my incantation.\nShould any dare breach my divine spell,\nlet their heads shatter and brains burst,\nscattered like fine dust.\nSwiftly, swiftly, as the law commands.\n\nNext, cast down the *Hengtian Black Register* to perform the *Altar-Binding Rite*:\nEast bound, West bound,\nSouth bound, North bound,\nAbove bound to the heavens,\nBelow bound to the earth,\nAt the center, all ghosts and evil spirits bound.\nWith the above, employ the *Grasping the Authority Seal*,\nthe *Zimu Marshal’s Seal*,\nthe *Kun’s Grasping the Authority Seal*,\nand recite the *Altar Incantation*.\nThe Vermilion Bird radiates brilliance,\ndivine might surges within.\nThe Four Mountain Sources stand guard—\nghostly soldiers flee in terror.\nThe divine serpent exhales its breath—\nevil spirits cower in hiding.\nThe Four Luminous Soul Terraces,\njade doors resplendent.\nThe Jade Perfected stands majestic,\nenthroned in the Hall of Light.\nWielding purple auroras in hand,\ncrowned with divine radiance.\nReciting the *Cavern Scripture*,\nthirty-nine chapters in all.\nWithin, the *Exorcising Evil*,\nthe might of dragons and tigers.\nFierce beasts and charging oxen,\nclutching blades and swallowing spears.\nThe *Mountain-Raising Bell* tolls—\nHeaven’s poisonous dragons and divine birds.\nSix-jawed, they spew fire,\ndevouring the kings of ghosts.\nLightning boars and thunderfire,\nseizing stars and streaming bolts.\nFlickering flames, scorching winds,\nmarching against the gale.\nThe *Celestial Bird Array* surrounds me,\nbelching fire for ten thousand miles\nto dispel all misfortune.\nAll spirits open the Way,\nsealing off mountain villages.\nA thousand gods, ten thousand spirits,\nbow their heads in reverence.\nMarshals hold censers,\nburning incense for me.\nWherever I tread,\nall gods receive me.\nCelestial beasts come to guard,\na thousand spirits tremble and submit—\ndare not disturb my qi.\nSwiftly, swiftly, as the law commands.\n\nNow perform the *Altar-Locking Rite*:\nThe Celestial Slayer blazes,\nthe Earthly Slayer stands firm.\nHow dare any evil spirit or ghost hide?\nWith a single inhalation of the *Flying Gang*,\nten thousand ghosts vanish.\nLeft *Kui*, right *Gang*—\ndivine saints seize and lock them,\nallowing no escape.\nCommand: “Divine generals, swiftly lock the altar!”\nI act by the decree of the Northern Emperor.\nSwiftly, swiftly, as the law commands.\n\nPerform the *Altar-Locking Rite*, taking the *Xī Seal* and casting the *Decision*:\nDirect the generals and officers to lock the altar,\nenvisioning the divine presence of the Northern Emperor.\nPetition the Primordial Celestial Sovereign,\nstepping through the Dipper,\nvisualizing the transformation of the divine seat.\n\nI, the ritual master, have heard:\nThe Great Void is boundless, unseen and unheard.\nYet the profound Dao is obscure—\nknock, and it opens; seek, and it responds.\nToday, within this altar,\nsolemnly establish the scriptural rite,\ncirculating it above and below, throughout the four directions.\nLike the Southern Cinnabar Realm,\nencircling a hundred leagues,\nit becomes the Northern Culmen Celestial Palace,\nwhere the Four Qi shine clearly.\nTen thousand spirits tremble and submit,\ndemon kings all pay homage.\nNo land remains unpeaceful.\nAs when the Primordial One dwells within the Pearl,\nor when the Most High ascends the Jade Throne,\ndivine sounds resound,\ngolden words proclaimed.\nTen ranks unfold,\nthe sea of blessings deep and the mountain of longevity firm.\nThe Five Directions stand secure—\nevil gates close, and the true Dao opens.\nSit in equanimity, recite the scripture with utmost sincerity.\nProceed.\nOpen the case, expound the mysteries—Celestial Worthy.\nModulate the voice, recite the scripture,\nand discourse on the *Narrative Chapter*.",
      "overlap_context": "t generals of Tianpeng,\nThe great deities of flying hawks and running hounds,\nThe celestial immortals and generals within and without the Purple Court,\nZhuge Liang’s Iron Seal,\nThe great deities of the Eight Trigrams and Nine Palaces within the rite,\nThe Seventeen Divine Kings,\nThe marshals of the earthly deities,\nWang Qi’s Ten Great Guardians—\nAll lead the troops, cavalry, and officers,\nEach solemnly and single-mindedly\nIntensifying their patrols and vigilance,\nEncircling the scriptural altar.”",
      "start_char": 4828,
      "end_char": 5561,
      "start_sentence": 217,
      "end_sentence": 274,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.885069608688354,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "诵至天蓬咒，存想咒中诸大神仙、神王、将吏，排布兵阵，侍列左右前后。 每诵一品毕，出北帝神。 又想为元命真人，跪奏事由，礼谢。 再想北帝神，诵下品经。 七元品 诵至分身咒，不得高声。 如法存想北帝神，出兵捉祟，遣将擒下为祸鬼神入狱。 存神为天蓬，步斗一座，立□星。 以左手握五将诀，再握持家诀，四指掐大指根上。 权兵诀，子总管诀。 大指掐四指节中。 召将出兵，收捉患家为祸邪祟，画井狱入祟。 想兵将摄入其中，勒令放还病人魂魄归身。 想坛金光一道，直射病房，兆身随光入，依经噀水退摄。 或令人将符入房，打醋炭熏扫，想心将护卫息身如故。 想往来人尽为邪鬼神吏，四坛复坐诵经。 戮鬼品 存为北帝领诸天魔王、上下六宫神吏等，在酆都说法，降伏邪鬼。 如治病，又给符水与服。 捍厄品 存元命神奏对北帝，北斗颁告圣旨下星宫斗府，为某人消灾度厄。 存其患人凶星退舍，吉曜照临，祸散消灾，天仙度人，魔王受戒，鬼魅逃形。 神印品 想印中毫光万丈，斩灭不祥。 金箓品 想元始天尊降下救苦真符，差龙童赍告三界十方罗酆岳府等处，摄召祖先魂识。 次存为救苦天尊，握金牌诀，想金光照破幽狱，摄到魂仪前来坛所，道众就家庙咒食讽经，安奉就坐，祝其听宣经法。 诵毕，告长生简，宣符箓牒，差龙童将吏进诣南官注生。 先焚燎功德，法师皆不必下座。 九龙品 存为北帝神，握金牌，召九龙王住居禁享，六神前来听令。 或有新旧修造伤犯，咸皆原赦。 凭此经功，以为安奉解释。",
      "translated_text": "When reciting to the *Celestial Canopy Mantra*, visualize the host of great immortals, divine kings, generals, and officials arrayed in martial formation, standing in attendance to the left and right, before and behind. After each chapter is recited, summon the Divine Sovereign of the North. Then envision yourself as the Perfected of Primordial Destiny, kneeling to present matters and offer reverent thanks. Again visualize the Divine Sovereign of the North, and proceed to recite the next chapter.\n\nFor the *Seven Primordials Chapter*, when reciting to the *Mantra of Division of Self*, do not raise the voice. In proper visualization, see the Divine Sovereign of the North dispatching troops to seize malevolent spirits, sending generals to capture the demonic gods who bring misfortune and cast them into prison. Envision the spirit as the Celestial Canopy, pacing the Dipper once, and standing upon the □-star. With the left hand, form the Mudra of the Five Generals, then the Mudra of the Household Guardian, pressing the four fingers upon the base of the thumb. The Mudra of Provisional Troops, the Mudra of the Master of the Zi-hour. Press the thumb upon the middle joint of the four fingers. Summon the generals to deploy troops, apprehend the malevolent spirits afflicting the household, and draw the Well Prison to enclose the demon. Visualize the soldiers and generals capturing them within, commanding them to release the patient’s hun-soul and return it to the body. Envision a beam of golden light from the altar piercing directly into the sickroom; the patient’s body follows the light inward, and in accordance with the scripture, spray consecrated water to repel and withdraw the affliction. Alternatively, have someone carry the talisman into the room, strike vinegar-soaked charcoal for fumigation, and sweep clean. Visualize the Heart General guarding and restoring the body to tranquility. Imagine all who come and go as demonic gods and spirit officials. Return to the four altars and resume recitation.\n\nFor the *Chapter of Slaying Demons*, visualize the Divine Sovereign of the North leading the demon kings of all heavens and the spirit officials of the Six Palaces, expounding the Dao in Fengdu to subdue malevolent spirits. In healing illness, also provide talismanic water for the patient to ingest.\n\nFor the *Chapter of Warding Off Calamity*, envision the Perfected of Primordial Destiny presenting a memorial to the Divine Sovereign of the North, who then proclaims the sacred decree to the stellar palaces of the Northern Dipper, beseeching the deliverance of a certain person from disaster. Visualize the inauspicious stars of the afflicted person retreating, while auspicious constellations shine upon them, dispersing misfortune and dissolving calamity. Heavenly immortals deliver the person, demon kings receive the precepts, and ghostly apparitions flee in terror.\n\nFor the *Chapter of the Divine Seal*, envision the seal radiating a myriad zhang of luminous rays, severing and extinguishing all inauspiciousness.\n\nFor the *Chapter of the Golden Register*, visualize the Celestial Worthy of Primordial Beginning descending the True Talisman of Salvation from Suffering, dispatching the Dragon Youth to deliver proclamations to the Three Realms, the Ten Directions, and the palaces of Mount Fengdu, summoning the ancestral hun-souls. Next, envision the Celestial Worthy of Salvation from Suffering, forming the Mudra of the Golden Tablet, and visualize golden light piercing the dark prisons, drawing the souls to the altar. The Daoist assembly then recites scriptures at the ancestral shrine, offering consecrated food, and inviting the souls to be seated. After recitation, present the *Tablet of Longevity*, proclaim the talismanic registers, and dispatch the Dragon Youth and spirit officials to the Southern Bureau of Life Registration. First, burn the offerings of merit; the Dharma Master need not descend from the seat.\n\nFor the *Chapter of the Nine Dragons*, visualize the Divine Sovereign of the North holding the Golden Tablet, summoning the Nine Dragon Kings to reside in the forbidden precincts and the Six Spirits to attend the command. For any recent or past construction that has caused offense, all shall be pardoned and absolved. Rely upon the merit of this scripture to ensure peace and deliverance.",
      "overlap_context": "rimordial One dwells within the Pearl,\nor when the Most High ascends the Jade Throne,\ndivine sounds resound,\ngolden words proclaimed.\nTen ranks unfold,\nthe sea of blessings deep and the mountain of longevity firm.\nThe Five Directions stand secure—\nevil gates close, and the true Dao opens.\nSit in equanimity, recite the scripture with utmost sincerity.\nProceed.\nOpen the case, expound the mysteries—Celestial Worthy.\nModulate the voice, recite the scripture,\nand discourse on the *Narrative Chapter*.",
      "start_char": 5561,
      "end_char": 6177,
      "start_sentence": 275,
      "end_sentence": 307,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.096561670303345,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "辟尸品 诵至明镜箓，存白炁祥光於宝箓中天，出天灾，散地祸。 八字品 诵至斗讳处，想北帝颁旨下北斗，北斗亲现，为息人消灾解厄，顺度星躔，削落罪籍，注上生名。 逐位存想，左手斗诀，自额至眼，为之临目，解冤尤，保身命，修心性。 仍想神仙将吏，保护生人，削罪注福，就给灵篆与服。 神兵品 至此再陈醮供，想内外上下众真，受供降福。 回向文 具位臣姓某中谢，重爇真香，恭伸奏谢圣位。 臣闻琼文毕轴，杳冥三界以俱闻，宝磬停音，彷佛诸天之遥唱其经也。 实上天奥义，非下世常辞。 天地以之常存，日月因之迭运。 人民奉之以开泰，鬼神敬之以变通。 病者闻之而寿纪东华，殁者闻之而神迁北府。 妖邪闻之而头破脑裂，舍识开之而鳞港羽翔。 是曰生化依凭，莫不人天仰赖。 为昏卫之慧炬，作苦海之法桥功。 勋不可思议，福德无有限量。 今则诵周十品，韵彻九霄。 伏想经返星坛，恩颁金阙。 上愿皇图广大，我道兴隆。 五风十雨以顺时，四海兆民而乐业。 三途息苦，永不堕於输回。 十地兴慈，少暂停於考掠。 动植感生成之德，飞潜蒙化育之恩。 一切有情，均证无漏。 次冀某罪消亿劫，福降今时。 符水有灵，享安靖和平而如旧。 身田获吉，绝痒痾疾痛以无虞。 马禄旺抉，星运开泰。 一门宁谧，老者安，少者怀。 九祖升迁，存者神，过者化。 何灾不灭，有愿皆符。 臣等共沐余波，人道咸沾殊利。 千古流传於经教，八荒绝灭於鬼妖。 如上祷祈，悉干覆寿。 为上良缘，稽首皈依。 志心称念，太上三尊，十方众圣，玄中大法师，伏魔经坛上圣高真。 无无上真赞叹，不可思议功德。 北帝伏魔经法建坛仪竟",
      "translated_text": "**Chapter of Expelling Corpse-Energy**\nUpon reciting the *Luminous Mirror Register*, visualize white *qi* and auspicious radiance emerging from the sacred register in the heavens, dispelling celestial calamities and dispersing terrestrial misfortunes.\n\n**Eight-Character Chapter**\nWhen reciting the *Taboo of the Dipper*, envision the Divine Sovereign of the North issuing a decree to the Northern Dipper. The Northern Dipper manifests in person to pacify mortals, dissolve disasters, and resolve adversities. Aligning with the stellar paths, it erases names from the ledgers of sin and inscribes them in the registers of rebirth. At each position, perform the visualization: with the left hand forming the Dipper mudra, trace from the forehead to the eyes—this is called *Descending Upon the Eyes*—to resolve grievances, safeguard life, and cultivate the heart and nature. Further envision the divine immortals and spirit officials protecting the living, excising sins, bestowing blessings, and granting the sacred talismans for ingestion.\n\n**Chapter of Divine Soldiers**\nHere, present the offerings of the *jiao* ritual anew. Visualize the assembled perfected beings, both within and without, above and below, receiving the offerings and descending to confer blessings.\n\n**Dedication Text**\nThe humble officiant, [Name], respectfully submits this memorial in profound gratitude, kindling true incense to reverently address the sacred ranks.\n\nI have heard that when the jade scriptures conclude their scrolls, their mysteries resound through the Three Realms; when the tones of the sacred chime fade, the distant chanting of the heavens seems to echo their verses. Truly, these are the profound mysteries of the celestial realm, not the common words of the mundane world. Through them, Heaven and Earth endure eternally, and the sun and moon alternate in their courses. The people rely upon them for prosperity, while ghosts and spirits revere them for their transformative power. The sick who hear them gain longevity in the Eastern Flower Capital; the deceased who hear them ascend in spirit to the Northern Palace. Demons and malevolent forces hear them and shatter their skulls; those who abandon delusion and awaken to them soar with scales and feathers. These are the foundations of life and transformation, upon which all beings in heaven and earth depend. They serve as the torch of wisdom for the benighted and the dharma bridge across the sea of suffering. Their merit is inconceivable, their blessings and virtue boundless.\n\nToday, having recited the ten chapters in full, their harmonies pierce the nine heavens. I humbly envision the scriptures returning to the stellar altar as grace descends from the Golden Gates. May the imperial domain expand and our Dao flourish. May the five winds and ten rains arrive in season, and the people of the four seas enjoy peace and prosperity. May the Three Wretched Paths cease their suffering, never again to fall into the cycles of retribution. May the Ten Grounds awaken compassion, and the torments of purgatory pause, if only briefly. May all living things—moving and still—feel the virtue of creation, and all creatures—soaring and swimming—receive the grace of nurturance. May all sentient beings equally attain the untainted state.\n\nNext, may [Name]’s sins be erased across countless kalpas, and blessings descend in this very moment. May the talismanic waters retain their efficacy, ensuring tranquility, peace, and harmony as before. May the field of the body be blessed, free from afflictions, illnesses, and pains. May official rank and fortune thrive, and stellar influences align auspiciously. May the household enjoy serenity, the elderly find peace, and the young be cherished. May the nine generations ascend, the living be protected in spirit, and the departed be transformed. What disaster shall not be vanquished? What wish shall not be fulfilled? We, your servants, together bathe in the residual grace, and all in the human realm partake of its extraordinary benefits. May this scriptural teaching flow through the ages, and demonic forces be eradicated from the eight wilds.\n\nWith these prayers, I reverently submit them to the shelter of your boundless longevity. For the highest good, I bow my head in devotion and take refuge.\n\nWith sincere hearts, we invoke and praise the Three Supreme Ones, the saints of the ten directions, the Great Dharma Master of the Mystic Realm, and the exalted perfected ones of the *Sutra Altar for Subduing Demons*. Their merit is beyond all measure, their virtue unfathomable.\n\nThus concludes the ritual for establishing the altar of the *Northern Emperor’s Scripture for Subduing Demons*.",
      "overlap_context": "u of Life Registration. First, burn the offerings of merit; the Dharma Master need not descend from the seat.\n\nFor the *Chapter of the Nine Dragons*, visualize the Divine Sovereign of the North holding the Golden Tablet, summoning the Nine Dragon Kings to reside in the forbidden precincts and the Six Spirits to attend the command. For any recent or past construction that has caused offense, all shall be pardoned and absolved. Rely upon the merit of this scripture to ensure peace and deliverance.",
      "start_char": 6178,
      "end_char": 6829,
      "start_sentence": 308,
      "end_sentence": 348,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.795175790786743,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\北帝伏魔经法建坛仪.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}