{
  "source_id": "华阳陶隐居集",
  "source_file": "chunked_daozang\\华阳陶隐居集.json",
  "total_chunks": 18,
  "total_original_chars": 13894,
  "total_translated_chars": 86705,
  "total_translation_time": 466.476181268692,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Collected Works of Tao the Recluse of Huayang**\n*Compiled by Ming Chuanxiao. Two fascicles. Source text from the Zhengtong Daoist Canon, Tai Xuan Section.*\n\n**Fascicle One of the Collected Works of Tao the Recluse of Huayang**\n*Compiled by Fu Xiao, Disciple of the Luminous Terrace*\n*Collated by Chen Nan, Disciple of the Great Cavern*\n*Preface by Jiang Zong*\n\nOf old, Liu Xiang mastered the learning of past and present; Ma Rong beheld the books of all under heaven. Jing Fang discerned the omens of wind and rain; Pei Kai understood the safeguards of yin and yang. Yet Zizheng (Liu Xiang) was undone by oversimplification, and Jichang (Ma Rong) was ruined by arrogance and extravagance. The enlightened lord perished in an instant; Gongju (Pei Kai) barely escaped the ultimate punishment. Few have attained perfection in all things, and rare is the praise for one who sees virtue through to the end.\n\nAs for those of vast virtue and keen intellect—like the four disciplines of Confucius’ school—or those who delved deeply into the classics—like the six arts of Zheng’s lineage—Tao the Master of Danyang embodied them all. He possessed profound knowledge of the purple terraces and green bamboo slips, the cinnabar texts of the emerald ravines, the jade tablets of secret scriptures, and the wondrous scrolls of the jasper altars. Nothing escaped his mastery of their subtleties, nor did he fail to grasp their essential purport. Truly, he was an extraordinary figure of unparalleled talent, a rare man of his generation.\n\nYet his literary works had been lost, and no compilation existed. His disciples gathered what remained, as if encountering a text from Liaodong. Devoted scholars searched diligently, reciting from baskets of texts from Hexi. They entrusted the task of collation to brush and ink, sealing the collection in vermilion silk. It was stored in the Hongdu archives, with a copy preserved in the Yan Pavilion.\n\n---\n\n**Seeking the Mountains: Written at Fifteen**\n\nWeary of how easily worldly passions sway, I took up my staff to seek the mountains. Following hidden paths to reach the peaks, I endured hardships and overcame obstacles. My wandering heart was not yet sated when evening fell at the roots of the clouds. Joyful to find one who attains his will, I forgot my form; having forgotten my form, my spirit abided.\n\nThereupon, I loosened my hair and untied my sash, circling the heights. My mind was vast, my gaze unburdened; my qi flowed freely, my spirit at ease. Though the mysterious is distant, it surely exists. No burden is too great to forget. The harm of the \"wounded horse\" dispelled, the blade of the \"butcher\" reigned supreme. The feelings of things and self, though equal, depend on self-cultivation—this is what I esteem.\n\nAs for those who seek fame on Western Marchmount or chase profit in Shuling, who prize the purity of Chu and Xiang or the pride of Wu and Jiang—who scorn death and value qi, holding name above life—such men stray from truth and obscure the Dao. I cannot approve. Those who don robes and wide sleeves, don caps and formal attire, who linger in courts and halls, strut through palaces and chambers—who serve a hundred kings of the Fu clan, leaving fragrant legacies—though they bear virtue and receive honor, I dare not commend them.\n\nThus, I shut the gates of Jingmen by day and open the thatched door by night. My chamber is overgrown with summer grasses; my path obscured by spring moss. The courtyard is empty, bathed in moonlight; the zither’s notes mingle with the wind’s lament. Evening crows nest under the eaves; twilight beasts vie to approach. At times, I wander near graves or seek distant valleys. Sitting upon flat stones, I gaze over the plains. The sun bears the mantis in shared seclusion; the moon parts the clouds to emerge from the mountains. The wind descends through pines, carrying melodies; springs cascade over rocks, forming patterns. Grasses sway, brushing dew; deer gather in rustling herds. I grasp trailing vines to enter the valley, skirting vast marshes to compare purity. The stone cliffs reflect true hues; I climb osmanthus branches to match their steadfastness. I gather orchids and wear sweet basil, awaiting the spring warbler’s first song. I harbor my thoughts in darkness, waiting for the kind breeze to unfold my emotions.\n\nThen, yielding to my mood, I set forth, following the rocky path to wander afar. My thoughts drift with the pillars of heaven; faint joy arises, yet I seek nothing. Gazing at the winding river’s expanse, I am dazzled by the overlapping peaks. The sun slants through clouds, darkening their hue; the wind passes over water, leaving it serene. It brushes jagged cliffs, stirring whirlpools; where it meets open space, islands form. A lone stone soars, peerless; the bank hangs suspended, as if floating in the sky. Halfway through the green path, my soul wanders, carefree. I grasp the principles of Bohun’s sheer cliffs, ascending a thousand fathoms to rest my spirit.\n\nThereupon, I reach the sheer cliffs and arrive at Pine Gate. Behind lies the open forest; before me, the long source. To the right, mountains stretch endlessly; to the left, the sea rises to meet the heavens. Bamboos drip dew in orderly rows; willows sway gently, welcoming cicadas. Gulls fly in pairs to the water; egrets soar gracefully to the fields. They glide upon the waves, they wheel above the fields—this freedom and joy! Yet I lament that life is not long. I mourn the fleeting span of mushrooms, envy the enduring pine. Though the roc and the quail are different species, they each find their place in carefree wandering. I wish to spread my mat and pour out my grievances, to compose verses at dawn beneath the pines. Arriving at Red City, I rest awhile, meeting the Prince of the Waters to lodge for the night. Gazing up at Peng Juan, I know he is not far—surely long life may yet be attained.\n\nBefore the elm’s light fades, I will seek the mountains to gather lingzhi. I depart to gather lingzhi, entering the deep ravine; I explore its depths, where the path is secluded and winding. The winding path never brightens; the deep ravine never dawns. High pines halt the drifting clouds; low vines repeatedly confuse the crows. The crows, lost in the vines, flutter in disarray; the clouds, stilled upon the pines, threaten to scatter. The drifting clouds wander—where will they settle? The parted crows seek their flock. Alas, where is their flock? Where can they rest? My thoughts drift, unheard; my gaze is exhausted, yet no barrier remains.\n\n---\n\nAfter the Master’s passing, no one compiled his works. In the second year of Zhenming under Emperor Wu of Chen, the imperial decree appointed Minister Jiang Zong to assemble the collection. The Master had departed in the second year of Datong under the Liang; by then, fifty-three years had passed. Many writings had been scattered and lost.\n\nI asked a fisherman about the way ahead, and he pointed me toward Penglai, saying: \"If you truly possess the resolve to seek the mountains, I will lodge you in the Terrace of Immortal Summoning. Approach the Ying waters to unburden your heart, for myriad feelings will surely converge. Though a thousand thoughts may align, none can know where they ascend. Returning to formlessness in stillness, forever transcending the dust of the world.\"\n\n---\n\n**Rhapsody on the Water Immortal**\n\nVast and boundless, the eight seas surge; drifting and still, the nine rivers flow. Waves rise at the center of heaven; waters pour, dividing the earth. They coil around the sun’s cavern at Chang Sang, and to the west, they turn the dragon’s spade at the moon’s curve.\n\nThus it was: Tong Pass stood unblocked, Stone Gate lay open. The Yangtze was guided forth from the Han, the Ji floated into the Huai. The Zhang Canal’s water palace embraced the terraces of mountains and isles—where the radiant sisters E and Ying once wandered, where Qin Gao came and went with his zither. Some soared to the ends of the earth as roving roc, bathing the sun in Xianchi’s pool; others followed clouds to rinse in the golden nectar of the Fen, or chased the rosy dawn to pluck the fruit of the Jianmu Tree. They played with pearls in the courtyard of the Deep-Dweller, or rolled up their mirrors in the chamber of the Silk-Twister. This was true splendor.\n\nYet more wondrous still: where jade cliffs stood free of mist and emerald waters stirred not a ripple, flying carriages bore winged serpents and soaring phoenixes, while wandering plowsmen rode swans. They ascended to court in the Purple Palace, then returned to pay homage in the Azure Mansion. They advanced to wave banners before the Eight Elders, or turned to brush the robes of the Four Lads. They struck the sounding stone in the Cavern of Shade, or unfurled their pride in the Dark Garden. They poured the intoxicating wine of the Cinnabar Cave, or offered delicacies from the Qilin Isle. Master Anqi presented jujubes, the Queen Mother of the West proffered peaches. Brocade banners blazed in the sunlight, feathered robes brushed the clouds.\n\nAnd when autumn waters rose to their height, towering waves crested like mountains, each patrolling its own domain, heeding the royal decree. They chose marvels from the treasury of the River Lord, drew treasures from the Black Dragon’s river. Night-glowing pearls lit the moon, great cowries filled the chariot shafts. This was true magnificence.\n\nConsider then the layered towers of Jasper Mansion and the cloud-woven pavilions of Jade Terrace—where the Yellow Emperor once feasted the hundred spirits. Or the stone canopy of Mount Tu and the emerald curtains of the Heavenly Empress—where Yu the Great gathered his ministers. The Min Mountains coiled in intricate embrace, threading upward through the Well and Net constellations, their peaks draped in celestial brocade, girdled by the Jade Cord. They steeped scalding springs in the Cassia Isle, or churned boiling torrents in the Golden Mound. Sands collapsed, stones tumbled, swift rapids raced in foam. Sheer cliffs sent cascades flying, ten thousand fathoms of suspended torrents. They surged through the gates of Dawn’s Radiance, galloped beyond the Gourd’s Mouth.\n\nYet when the turning of the cosmic net reached its limit, when the nine and six cycles reversed, the Western Han devised its strategies, the Dragon Gate received its mandate. The Zhou of old met the Xia in their final union, the first gathering before the altar of Ma. The vast plains of Pingyin and Julu transformed twice into abysses; the clear waters of the Qing River and Bohai thrice became mulberry fields. Grasping the two poles of heaven and earth, one could only sigh in sorrow—one morning, a myriad ages flowed past in tears.\n\nI have found peace in the toad’s shadow, no longer envying the crane’s years. All are but creatures beneath the pines—how could they compare to the immortals? Alas! Among all living things shaped by creation, none are more numinous than humankind. Why not follow in the footsteps of the Divine Sovereign, enter the wondrous gate as a guest of the Dao? To sink one’s form into endless night, to become dust with ants and mole-crickets—this is folly. Yet there are those of keen insight, heroes who walk alone: they seek the scholar of Meng Valley in his hidden vale, or pursue the currents of Lü Liang in the Stone City. They follow Wu Guang to the Pillar of Grinding Stone, or search for Long Wei in Dongting. They welcome the Nine Transcendents at the Golden Portal, or pay homage to the Three Pure Ones in the Jade Clarity. They renew heaven and earth to make them everlasting, and in the end, wander carefree in eternal life.\n\n*Hymn of Huayang: The Pivot of the Realm*\n\nThe *Yellow River Scroll* bears witness to past records, while the *Annals of Confucius* illuminate ancient names. The celestial order shines resplendent, and the twin golden standards mark the earth’s heroes.\n\nIn essence, form and image dwell in the boundless—life arises from being, yet in being, it returns to emptiness. No craftsman is needed, for the hollow form achieves perfection on its own.\n\nThe bodily stations gather the spirits within the Three Palaces, dividing and harmonizing the Five Conveniences. They greet the wise of night and gaze at the morning essence suspended in dawn’s glow.\n\nA standard pierces the southern peak, where the Mystic Tripod stands tall; the northern ridge stretches like Qin’s unbroken wall. Within and without, the Jade Sand Ford encircles hidden wheel-tracks. Distinctions are drawn:\n\nTo the left, the waters of Willow’s Judgment flow; to the right, the Yang Valley’s streams run deep. The earth cradles the somber hues of the north, while the well’s pure waters gush from Phoenix Gate Spring.\n\nAt the borders, Guo Gan’s poems linger on the banks, and Jiang Ba’s distant traces span the land. At the Crane Temple, echoes may sometimes be heard; in the separate abode, reverence is ever maintained.\n\nCategories align: the dwellings of the heavens are not known to mortals, and the Yue clans do not conceal their migrations. Tree canopies cast fleeting shade, while the stone turtle has never known smoke.\n\nThe fruit groves flourish with lingering crabapples, and the vegetable gardens trail with forgotten mustard greens. Glowing mushrooms may light the night, while field springs ever moisten the dust.\n\nVisitors descend their reins at Tortoise Mountain, and the Azure Radiance Youths unhitch their chariots. They repose in the Lodge of the True, or gather in the Palace of Leisurely Ease.\n\nThe talented and wise take flight, their feathered companions alighting; long whistles summon returning clouds. The zither’s strings play untethered melodies, and empty discourse finds no one to engage.\n\nScholarship is endowed: dwellings stand beneath the level thunder, and stillness abides in the shade of stone. The Way is already embraced with serene intent, and soaring blossoms fill the heart’s flight.\n\nThe work of destiny: the spirit’s crossing is assured, and departure or stay follows what is fitting. What need is there for display? The hidden path knows its own.\n\nThose who forge bonds roam the jeweled blade’s edge, or dwell in seclusion at Huayang. Should it chance to resemble the Seven Origins, they will be upheld.\n\nThe appointed time nears its fulfillment, and the cycle of *hai* has not yet reached its *ding*. Inheriting the Tang’s legacy, they shall attend the sacred court as guests.\n\nThe pledge is carved upon the dark window, and sincerity is revealed at the winding steps’ gate. One looks back with care, lest the grace of recommendation be betrayed.\n\n*Ten Responsibilities of the Hidden Retreat*\nThe Master of the Hidden Retreat, entrusting the general affairs to his disciple Dai Tan, mounts his steed and takes up the tablet to confer upon his former disciple, Lu Jingyou of Wu Commandery, the governance of Lian Stone Village as a dwelling for the reclusive scholar.\n\nThe *Admonitory Text* states:\n\"Oh, you, Jingyou—once I loosed the imperial sash at the palace gates and attended the mat of the questioning hall...\"\n\nThough the world’s paths blur with dust, your heart marks a realm of transcendence. The vision of the Mushroom Fields lingers, unbroken through dawn and dusk. The aspiration of the Hao and Ying rivers deepens with the passing years. Supreme virtue draws neighbors near, as clouds and winds converge in meeting.\n\nSince your arrival, two springs have turned. Then, you doffed your sash at the azure steps and hung your cap at the vermilion gate; hand in hand, we hastened to establish a dwelling upon this ridge. Channels were carved to guide the waters, and stones were shifted to lay the foundation. You scaled cliffs to fell timber, crossed ridges to gather herbs. Your sinews were spent in climbing and building, your dark blood exhausted in haste and labor. Your flesh withered, yet you did not deem exposure a hardship; your spirit stood hollow, yet you heeded not hunger or cold. When the thatched hut stood complete, you endured frost and heat alike. For seven years, the work began and now reaches its end. Today’s peace is your labor’s fruit.\n\nThe noble man does not dwell alone in glory; the humane must share prosperity with all things. Thus, I grant you this village—everlasting Albei Slope. Here, the land of Mount Jin and Lian Stone spans seventy paces, with the ravine’s waters adjoining. May your fine deeds flourish. Forever be a guest of honor in Huayang.\n\nTo this, govern well.\n*(First of the Ten Responsibilities)*\n\nYou, whose nature is devoted and sincere, whose disposition is serene and indifferent. Uprightness is your foundation, steadfastness your resolve. You seek not worldly talent, nor do you lower yourself to common company. Cunning schemes and deceitful plots are not what you desire.\n\nThus, I now charge you to be a Recluse of Tranquil Abode. This may be called establishing a title by virtue, perfectly fulfilling this excellence.\n*(Second of the Ten Responsibilities)*\n\nYou laid the foundations, framed the halls, and secured the boundaries. The main hall and altars are vast and open, the paths to the hermitage clear and solemn. For official and private travel alike, there are places to rest. In the labor of construction and repair, none was not your effort.\n\nThus, I now grant you Four Thunderbolt Flying Pavilions, with side galleries and flanking chambers. Here, you may dwell in peace and quietude, manifesting distant blessings.\n*(Third of the Ten Responsibilities)*\n\nYou serve your superiors with diligence and treat your subordinates with kindness. You have experienced the hardships of farming and the toils of labor. The proper cultivation of crops and the weaving of cloth have ensured ample provisions. Your hands and feet are calloused, yet you have not sought rest. You endure wind and rain, ever pressing on.\n\nThus, I now grant you a servant, named Duo Yiyi? Here, you may pass down the tasks of firewood and water, easing your toil.\n*(Fourth of the Ten Responsibilities)*\n\nYour clan upholds old traditions, and you yourself bear the state’s esteem. Though the Dao is one and unchanging, duties and expectations must be distinguished.\n\nThus, I now grant you an iron-and-copper *ruyi*. With it, you may command and respond to guests and officials, establishing your name in affairs.\n*(Fifth of the Ten Responsibilities)*\n\nYou revere teaching and goodness, adhering to the law without bias. Your vessels and robes serve their purpose, entrusted to practice and refinement.\n\nThus, I now grant you a bamboo staff tipped with tin. With it, you may shake the Three Realms, and the spirits will tremble at its sound.\n*(Sixth of the Ten Responsibilities)*\n\nYou aspire to profound sincerity, your distant thoughts attuned to the numinous wind. Where your heart directs, the mind follows and connects.\n\nThus, I now grant you two incense burners, accompanied by frankincense. With them, you may send purple smoke curling to the celestial halls, summoning the attention of the divine.\n*(Seventh of the Ten Responsibilities)*\n\nYou purify your form and keep your storehouse clean, having set aside rich foods. You proclaim the Dao with pine and cypress, relying on fragrant vinegar.\n\nThus, I now grant you a set of cups and plates. With them, you may hold osmanthus wine in the evening and receive chrysanthemum dew at dawn.\n*(Eighth of the Ten Responsibilities)*\n\nYou revere the classics and scriptures, following models and exemplars. The use of brush and ink lies herein.\n\nThus, I now grant you a large inkstone, with paper and brushes to accompany it. With them, you may compose texts, transcribe words, and receive truths face-to-face.\n*(Ninth of the Ten Responsibilities)*\n\nYour true heart is inwardly steadfast, your pure conduct outwardly manifest. You cleanse and sweep away defilement, your inner and outer bearing as pristine as snow and frost.\n\nThus, I now grant you a snail-shell washing basin, with a hand towel to accompany it. With them, you may enter the hall for morning rites and exit for ablutions.\n*(Tenth of the Ten Responsibilities)*\n\nNow, I grant you these ten things, each aligned with the precedents of history. You may respond with praise and follow these words to govern. Let there be no arrogance or indolence, lest you fall short of this intent.\n\nTaking up my brush to express my thoughts, I dare address you, Recluse.\n\n---\n\n**Edict Asking What the Mountains Hold**\n*Poem in Reply*\n\nWhat does the mountain hold?\nOn its ridges, many white clouds.\nThey bring joy only to oneself—\nNot fit to be plucked and sent to you.\n\n**Inscribed on the Wall of My Dwelling**\n\nYifu was carefree and unrestrained,\nPingshu sat and spoke of emptiness.\nNever mentioning the Zhaoyang Palace,\nSuddenly it became the Xiongnu’s court.\n\n**Sorrow on a Cold Night**\n\nNight clouds arise, night geese take fright.\nTheir mournful cries pierce the night’s sorrow.\nThe empty mountains fill with frost, high mist levels the plain.\nLead-white glow sinks beneath the bed-curtain,\nA lone light—cold moon faint.\nThe cold wind tightens, sorrowful heart breaks.\nTears of grief spent, yet feeling remains.\nWho can bear this resentment?\nThoughts arise—who could endure?\n\n**Ballad of the Hu Pipe**\n\nFrom self-willed flight through the heavens,\nTo the clamor of gain and loss—\nA hundred years, four or five dynasties,\nYet in the end, it is the Lord of Jiachen.\n\n**Emperor Wu of Liang’s Discourse on Calligraphy**\n\nBy imperial decree, the officials of the Central Secretariat were reviewed, and only Zhou Xizanfu was found capable. With a heart as deep as the *Hanxin*’s, he awaits the *Jiazhong* note to exhale his breath.\n\nNow, having mastered the subtleties of the upper form and perfected the principles of the lower, his skill is such that I have often compared Zhong [You] and Wang [Xizhi] to the world, advancing their art ever further. What grieves me is my own dullness, unable to fathom their heights, and I can only sigh in admiration.\n\nPreviously, I received three sheets of divine calligraphy, and now, with these, five in total. Not only does each character seize the eye, but every stroke pierces the heart. Day by day, their strength and grace grow, becoming ever more unmatched. To repay the past years, they are no longer of the same kind. This alone suffices—what need is there to seek further among Zhong and Wang?\n\nMy heart has always revered the present. My admiration and devotion deepen, my joy and delight overflow, and I cannot but share this.\n\nAgain, I was bestowed two scrolls. Upon examining the inscribed titles, all were as Your Majesty’s edict had described. Since they were not openly bestowed, I could only keep them briefly, unable to retain them long. I have already traced one section, but as it is unfinished, I did not send it with this message. The paper scrolls have been used before, and much else is mixed in, leaving nothing further to take. I also request to wait until all is complete before returning them.\n\nMoreover, these writings are in the style of literary pieces. I am now unskilled and must practice further. I only wish for fine calligraphy, like the *Yue Yi Lun* or *Tai Shi Zhen*, to be imitated in copying sutras, preserving the essentials for eternal transmission.\n\n**Emperor Wu of Liang’s Reply**\n\nThe two scrolls I wished to keep a little longer, but it makes no great difference. The paper scrolls are from a book’s binding, and since you needed to see the originals, I sent them. There is nothing particularly worth taking, but I have included them here, and I will need finer calligraphy later.\n\nAs for examples like the *Lun* and *Zhen*, Wang Xizhi’s recent works are not extremely fine, and the *Yue Yi Lun* is somewhat robust and vigorous—perhaps not a true trace. The *Tai Shi Zhen* is slightly more refined and charming, but the brushwork is too delicate, and the style deviates. Both have already been examined by Your Majesty, and beyond these, there is nothing else to send.\n\nAs for the *Yue Yi Lun*, my own heart has long suspected it to be a tracing, yet I dared not speak lightly of it. Now that Your Majesty’s decree confirms it is not genuine, I privately trust that my discernment has not been far off.\n\nRegarding the *Zhen* and *Yin*: praise that exceeds is as weak as drowning, yet your quiet and pure grace has granted me eternal provision. I am deeply moved by your compassion and reward, beyond words to express. Though this writing does not follow the standard examples, its practical use and principle are the same.\n\nYou have inquired about fine regular script, and I have prepared two additional scrolls. Earlier, in the capital, I obtained a scroll of *feibai* calligraphy, said to be one of Wang Xizhi’s finest works. I have never seen another to compare, so I cannot verify it, but its vigor and force are astonishing. I humbly present it here. Though it may not serve your purpose, if it might fill a gap in your collection, I would be honored to offer it to Your Majesty.\n\nIn the past, I saw a catalog of Wang Xizhi’s standard script at Ma Cheng’s residence. Ma said that among Wang’s works—such as his calligraphy for the *Luoshen Fu* and over ten other pieces—all were in the modern style, except for two scrolls of the *Jijiu Pian*, which retained the ancient method, tight and fine yet nearly unrestrained. I recall his words, but those works are now scattered and no longer extant. Ma also said that the notes and colophons attached to scrolls were all imitations meant for reprimanding the various princes and court officials.\n\nRecently, I saw the first three scrolls of a set of letters, which I believe have long been separated. I dared not presume to discuss their authenticity, but I hoped that among these three scrolls, one or two might follow the example of attached colophons. Your Majesty’s decree then unexpectedly granted me the first scroll, and my heart trembles with awe. When I first saw the scroll’s title, which mentioned twenty-three or twenty-four, I rejoiced at its abundance. Now, your gift has reached two hundred and seventy—my astonishment knows no end.\n\nThe imperial treasury is vast as the sea, not to be drawn from with a single bottle. Measuring my own use, I have already received more than enough, both before and after. These five scrolls, great and small, far exceed the humble station of one such as I. Without your extraordinary grace, how could I have dared to hope for such favor?\n\nBy nature, I have always been broadly learned but never precise. Once, troubled by the lack of books to read, I wished to become a scribe. Later, enamored with clerical script, I envied those who held office as keepers of records. I have often said that within the span of a human life, one’s understanding cannot encompass all things. The world is vast, yet men are confined to indulging their five desires—truly, this is a cause for shame and regret. Even if I were to become a ghost of talent, I would still be but a dull immortal. This remains true to this day.\n\nAt first, I intended to turn inward after the *Wuyi* year, but with state affairs so pressing and my heart heavy with silence, I dared not trouble you further with idle matters. Yet in addressing these affairs, I have already become burdensome and presumptuous. I humbly pray that Your Majesty’s sagely compassion will overlook my faults.\n\n---\n\nI have also reviewed your separate letter, which states that such matters should be subtly appreciated. Since this is a worthy endeavor, though it lies outside my usual practice, I venture to offer a few rough observations.\n\nWhen the brush is held slanting, the strokes lack sharpness; when the grip is too loose, the writing becomes weak. Short dots and lifts make the characters swollen, while long ones cause them to drift apart. Hasty strokes make the characters wide; sparse strokes make them sluggish. Constraint lacks vigor, while abandon lacks restraint. Pure bone lacks charm; pure flesh lacks strength. Too little ink makes the writing float and rough; too much makes it clumsy and dull. All these are common faults, and where the brush naturally leads, so follows the principle of nature.\n\nIf the brush’s rise and fall are well-placed, its movements unobstructed, the strokes connected yet distinct, the momentum like a towering peak, the waves and turns measured by the compass and square, the thickness and thinness balanced, the plump and lean harmonized, the bone and force well-matched—then the writing will be graceful and warm, pleasing to the eye, yet sharp and imposing, full of vitality. When it delights both sight and mind, it may be counted among the finest. Though one may recognize the styles of many masters, one must still master their connections.\n\nEven if the Six Scripts are skillfully executed, mastery still comes only through practice.\n\nOne may hold fast upon a single hearing, or recall upon a single glance. From ancient times to the present, such persons are not without precedent. Yet in the final analysis, all mastery comes down to practice. Cheng Miao could transform script because the forms had grown old; Zhang Zhi could excel in calligraphy because of accumulated skill in study. Only when the old is thoroughly known and the accumulation complete may one freely discourse.\n\nIn my youth, I never once completed a full cycle of sixty years, nor did I exhaust the reams of paper—yet now in old age, what more can be said? It would only invite ridicule from contemporaries and derision from later generations. Thus, I have made bold to speak with unrivaled confidence. Upon reading such claims, one’s back grows hot and the true self is obscured—here, the true is indeed burdened. This is merely mastery of a single art, not what I deem a triumphant endeavor. It is but dust upon the heart’s Dao, not what I call desirelessness.\n\nMoreover, in the *Treatise on Calligraphy* presented to Emperor Wu of Liang, there is a miscellaneous section in the first volume. I have carefully annotated and appended it separately, though I fear it may not fully accord with my humble intent. Along with my own copies, I submit them together for consideration. For over ten days now, my thoughts have been fraught with apprehension, leaving no peace in any matter. The delay has grown prolonged, and further postponement is unwarranted. The remaining entries are of no use, save for two pieces by Ji Kang and his peers, which follow the structural conventions of classical texts—though I regret they are not as refined as Guo Pu’s works.\n\nUpon reviewing the volume’s contents, the number of entries is not insignificant. The original directive mentioned only four volumes, but this appears to be a compilation from the Yuanjia era of the Liu-Song, with many later additions and losses. Of Wang Xizhi’s renowned works, only a few survive—*Huangting Jing*, *Exhortation to Ascend the Throne*, *Portrait Eulogies*, and *The Goddess of the Luo River*—I am uncertain whether any others remain.\n\nThe twenty-third volume now contains twelve entries on separate sheets. Of these, only eight are attributed to Wang Xizhi. The *Yue Yi Lun* in cursive script is exceedingly vigorous and sharp, though not overly deliberate, hence some characters are flawed. The *Grand Preceptor’s Admonition* and *Ode to the Great Elegance* are meticulously composed, yet somewhat constrained. These are fine examples of fan inscriptions and screen calligraphy. The remaining five pieces offer little of note. Minister Tao’s single sheet is not bad, though it is not Wang Xizhi’s work, nor is its author known—it appears to be a tracing. The two sheets by the Gentleman of the Yellow Gate and the single sheet of *Zhi Lian Li* are by Wang Xianzhi, also likely tracings. The *Prescription for Treating Malaria with Foxglove Root* is likewise by Wang Xianzhi, another tracing.\n\nThe four items above are not Wang Xizhi’s works.\n\nThe twenty-fourth volume now contains twenty-one entries. Of these, only eleven are attributed to Wang Xizhi. None are particularly close to his style, and many are careless tracings, making further detailed assessment difficult. The first sheet, dated the third year of Huangchu, is a later imitation of Wang Xizhi’s work. The *Miao Xi Epitaph* is by Master Xu. The *Embracing Sorrow and Grief* is by Zhang Cheng. The sheet dated the eleventh day of the fifth month is a tracing of Wang Huan’s *Letter of Reprimand*. The *Longing for the Recluses of Huang and Qi* and the *Entangled Thoughts* are both later imitations, clumsy and crude. One sheet remains unexamined—it is by Wang Xianzhi.\n\nThe *\"Conveniently Changed Month\"* sheet is by Zhang Yi. The *\"Fifteenth Day of the Fifth Month County Notice\"* sheet is also by Wang Min. The *\"Prescription for Treating Drinking\"* sheet is by Xie An. The above ten entries are not Wang Xizhi’s works. Fearing that they may not have been properly distinguished, I now respectfully present the calligraphy of Master Xu and Ren Jing. By comparing them separately, one may discern the styles of Wang Min, Zhang Cheng, Xie An, and Zhang Yi, which are suitable for official use.\n\n**Emperor Wu of Liang’s Response to the Recluse’s Letter**\nHaving reviewed the distinctions among the various calligraphic works, I find your discernment truly refined. However, the differences and similarities, as well as their merits, remain unclear to me.\n\nThe two sheets of *Attending Secretary and Yellow Gate* are by Ren Jing. Observing the characters in the submitted Jing works, they appear closely aligned. The recent two sheets of Jing’s calligraphy display a mixed and facile style, which cannot be Jing’s true hand. One must further assess them by examining brushstrokes, wave-like flourishes, and the essence of various masters. This is not something to be hastily executed on paper; for now, I shall maintain restraint and adhere to moderation.\n\nThe traced works of Xu and Ren are all returned.\n\n**Further Letter from Emperor Wu of Liang on Calligraphy**\nUpon reviewing your previous letter, though brief, its principles are comprehensive. Even with fewer than two hundred characters, it contains ample praise and critique, succinctly encapsulating all. Your written sentiments are profoundly moving, such that even the aged bones of Zhong [Yao] would be honored anew, and the delicate frame of [Wang] Xianzhi would rise from the netherworld. Only [Wang] Xizhi’s reputation can be justly elevated or diminished by such inquiry, revealing the jade-like standards with clarity. Without the sagely discernment of graded evaluation, I fear the trend of blindly following recent fashions will lead to eternal confusion.\n\nSince [Zhang] Zhi is hailed as the sage of cursive script and Zhong [Yao] himself perfected clerical script, your argument aligns with divine insight, a rarity unmatched across the ages. With this principle now clear, those who vainly attempt to mimic the tiger’s form should promptly abandon their brushes, return to antiquity, and embrace authenticity, thereby advancing this flourishing era. Though my humble opinion has been heard, my admiration knows no bounds.\n\nIn recent times, all have revered [Wang] Xianzhi. By the end of the Qi dynasty, his fame and substance had spread throughout the realm. Not only was Zhong [Yao] no longer acknowledged, but even [Wang] Xizhi was similarly neglected. This is not a matter of mere rejection but of the natural fading of influence, limited to a few lineages.\n\nUpon receiving your treatise, I was so overjoyed that I danced and leapt, yet this scarcely expresses my elation. I wish to privately share the traced works with Hongyuan and Sikuang—both are men of equal discernment—who will surely praise and celebrate them, gaining more than half their benefit.\n\nThough I do not know Hongyuan personally, I have corresponded with his nephew Xu through scholarly exchanges, and thus we have met in this way. However, since I am in the palace, I fear he may have already heard of the traced works. The selected characters vary in size and cannot be harmoniously adjusted. Guo’s examination suggests they may still be acceptable, though the brushwork differs significantly. Since this work will be transmitted for a thousand generations, its traces should be made to follow accordingly.\n\nIn my declining years, I have received three sheets from you. Upon carefully examining the characters, I find them robust and meticulous. I surmise that once words express intent, the intent aligns with the words. As the mind guides the intent and the hand unites with the brush, the result is even more worthy of praise. My humble heart trembles with reverence, and my cherished admiration grows ever deeper.\n\nThe prevailing opinion holds that no traces of Zhong [Yao] remain east of the Yangtze, a matter of constant lament. I have long hoped for the restoration of the Central Plains to access the *Taiqiu Stele* for tracing. Your treatise mentions that while authentic works are scarce, they can still be inferred, suggesting some survive. I wonder how many characters remain. Since I cannot personally inspect them, I wish to have a skilled artisan trace and fill in several lines. If I am granted this, it would be an extraordinary blessing.\n\nMoreover, [Wang] Xizhi’s studies of Zhong [Yao] exhibit ingenious structure and meticulous form, surpassing his own spontaneous works. I wonder how many such examples exist. If you could provide the *Huangting Jing*, *Xiang Zan*, and other texts, along with his self-composed works, I would no longer seek them. Instead, I request the finest of his studies of Zhong [Yao], in profound gratitude for your exceptional favor.\n\n**Emperor Wu of Liang’s Reply**\nThere is indeed one scroll of Zhong [Yao]’s calligraphy, traditionally regarded as authentic. However, I believe it is entirely traced, and most are unworthy of discussion. Only two or three lines appear to be traced, faintly capturing Zhong’s style.\n\n[Wang] Xizhi’s studies of Zhong [Yao] that can be verified number around twenty. Beyond these, the smaller characters with shorter strokes mostly follow Zhong’s method. I intend to have them copied and mounted, but it is not yet convenient to send them. Next month, when the task is complete, I will dispatch them.\n\n**On Calligraphic Rivalry**\nBefore [Wang] Xizhi’s time in Wuxing, his calligraphy was not yet fully refined. All his finest works date from his tenure in Kuaiji, roughly the decade of the Yonghe era. After resigning his post and mourning his father, he no longer served in office and scarcely wrote himself, entrusting all to a single individual whose work remains unseen in the world. The relaxed and distinctive pieces are mistakenly called his late works.\n\nAfter [Wang] Xizhi’s death, [Wang] Xianzhi, at seventeen or eighteen, fully imitated this person’s calligraphy, thus achieving a resemblance. Now, by Your Majesty’s decree, this distinction is made clear, sparing [Wang] Xizhi the criticism of having no late works.\n\nUpon reflection, I recently encountered someone who studied Yan [Zhenqing]’s calligraphy so closely that it became indistinguishable. In my own traced copies, though the character forms resemble hawks, the brushwork and energy are lost. I wonder if among the previous scrolls, one or two meticulously executed pieces might be included in the mounting process. If you deign to grant this, I will inquire again by year’s end. Otherwise, I dare not presume upon your generosity.\n\n**Response to Court Gentlemen on the Differences Between Daoist Immortality and Buddhist Dharma**\n\nInitially, a court gentleman of Liang inquired: \"I have privately studied Daoist texts on immortality and often find myself sighing in admiration, forgetting weariness. Yet I admire only their language, not their meaning. Considering that the seven-foot body shares the same origin in the Great Beginning and partakes of the Five Constants, why is it that only immortals ascend to the azure clouds while others decay like metal and stone? You preside over the Gate of the Mysterious Dao and have mastered the teachings of the Immortal Gardens. There must be a way to exhaust this profound question. I humbly request a brief explanation.\"\n\nThe Recluse replied: \"Your inquiry is most excellent, though it surpasses my humble ability to expound. Nevertheless, I shall attempt to explain: If one merely compares the bamboo and paulownia to the willow, their natures differ inherently. This is not the subject of today’s discussion.\"\n\nIf one draws an analogy to the kitchen knife and boiling grain, tracing their functions to cultivation and irrigation, this merely addresses their origins, not the eternal and unchanging essence. Those who attain immortality are fundamentally different. Even within this category, there exist several types; for now, let us discuss their true nature.\n\nAll forms, whether material or spiritual, arise from the union of form and spirit. When form and spirit are conjoined, one is human or being; when they separate, one becomes spirit or ghost. That which is neither separated nor conjoined falls under Buddhist dharma, while that which is both separated and conjoined pertains to the Dao of immortality.\n\nNow, how does one achieve this immortality? It is a matter of refinement, a thorough comprehension of the principles of transformation. When clay is shaped upon the wheel into a vessel, it becomes earth yet differs from earth. Though dry but unburnt, it crumbles when wet; though fired but not fully matured, it remains fragile. Only when fire and force are sufficient does its surface and interior become firm. Rivers and mountains may vanish, yet this form remains indestructible.\n\nSuppose one seeks immortality: with medicinal stones, one refines the form; with essence and spirit, one purifies the soul; with harmonious qi, one washes the substance; with virtuous power, one unbinds its fetters. When all methods converge without obstruction, one may unite to ride clouds and mount dragons, or separate to undergo liberation through apparent death and transformation. Neither united nor separated, one may exist or vanish at will. Thus, each follows their karmic path, cultivating the Dao and advancing in study, gradually ascending without limit until the teachings’ work is complete—yet this differs from the ultimate quiescence of extinction.\n\n*Preface to the \"Secret Essentials of Ascending to Perfection\"*\nFormerly, while among people, I had already compiled and edited two volumes on the practices of the true scriptures, which I then deemed thorough. Recently, dwelling in seclusion and embracing tranquility, I have attained greater reverence and purity. Testing these methods, I found them still lacking. Now, after repeated reflection and refinement, I have achieved coherence within and without, elucidating the principles of true study so that all becomes clear and unimpeded. Every word and phrase carries its purpose: some expound the transition from being to non-being, some reveal the hidden through the manifest, some deduce the origin from its mechanism, some clarify this by referencing that. Without prior immersion in scriptures and precise engagement with Daoist techniques, a cursory reading would be like gazing at the sea. Only through meticulous inquiry into its intricacies can one truly comprehend its essence.\n\nThus, the Dao is complete in seven chapters, its meaning aligned with the highest rank. I have often heard the ancient saying: \"Not knowing is difficult, but acting upon knowledge is the true challenge.\" It is not learning that is difficult, but understanding the learning. I have repeatedly observed those who obtain two or three scrolls, or five or six methods, believing the principle exhausted on paper, then retreat to the mountains to practice, only to grow more confused with time. These have not even entered the gate, let alone approached the inner sanctum. If questioned on specifics, they are at a loss, claiming the scriptures say no more than this and that they merely follow faithfully. Yet I have endeavored to initiate inquiry, to guide and illuminate the path. If one encounters a person of wisdom and humility, they may be moved to seek understanding and discern right from wrong. But those who are foolish and obstinate will dismiss it outright, asking, \"Why debate differences or critique sacred texts?\" Some cling to their own views, while others claim adherence to ancient methods, refusing to engage in discussion or debate. Such cases are not few, and it is truly lamentable.\n\nThe term *jing* (scripture) signifies a path—a constant, unobstructed way. Just as cloth requires both warp and weft to be woven into fabric, if the mechanism is flawed or the shuttle misaligned, how can a coherent pattern emerge? The Perfected Ones established symbols and imparted teachings not for the uninitiated but for those capable of instruction. They often marked the broad avenues while omitting the winding paths, trusting that those with discernment would infer the rest. Even the Five Classics, the philosophers, histories, rhapsodies, and odes—despite generations of commentary—remain debated. How much more so for the profound and wondrous secrets of the esoteric Dao, the extraordinary texts of the transcendent realm? Should one not delve into their hidden depths, exhausting thought and plumbing the obscure?\n\nHaving composed this rough draft, I laid down my brush and sighed: \"If Yuanxuan Ping were here, he would understand the principles I have grasped, which nearly traverse the boundary between heaven and humanity. With whom else could I discuss this?\" I shall entrust it to the mysterious convergence.\n\n*Preface to the \"Compendium of Medicinal Essentials\"*\nIn high antiquity, the Divine Farmer composed the *Materia Medica*, recording three hundred sixty-five substances to correspond with the days of the year. Each day brought forth one herb, each herb governed one ailment, aligning above with celestial patterns, in the middle with human affairs, and below with earthly principles. Harmonizing the five flavors, he crafted decoctions and elixirs to prepare for the four seasons’ changes. This was to establish the root so that the Dao might flourish. In that era, human hearts were simple and desires few. Even minor illnesses were cured with perfect efficacy.\n\nSince then, the world has grown artificial and emotions shallow; cunning and anxiety have multiplied, desires know no bounds, and worries never cease. Thus, pathogenic qi frequently invades, and illnesses grow more severe and painful. Though potent medicines are administered, they fail to cure. Later, Lord Leigong and others expanded the *Materia Medica* and the *Pairs of Medicinals*, broadening their therapeutic applications and multiplying their categories.\n\nAs the world changes and emotions shift, illnesses deepen. Some preemptively prescribe medicines for diseases not yet present, while others use a single herb or a hundred together to cure one ailment—all to expel evil and restore balance, addressing root causes and preventing harm. Yet the three schools’ listed diseases vary in scope: some substances differ but share names, others are identical but named differently; some are cold where they should be hot, or bitter where they should be sweet; their harvesting methods and origins diverge. Such discrepancies make it nearly impossible to rely on them.\n\nIn the time of the Divine Farmer, there was no writing. Only with the Yellow Emperor did records begin. Thus, the *Divine Farmer’s Materia Medica* was categorized into four classics and three schools, with successive additions and omissions—was this not a matter of adapting to the times, taking different paths to the same destination?\n\nHowever, the *Materia Medica* has endured through countless ages. Without masters to transmit it or scholars to annotate and copy it, errors have accumulated, characters and meanings have been lost, and no one has corrected them.\n\nThe efficacy of formulas lies in their application and harmonious blending.\n\n*Preface to the One Hundred and One Formulas of the Handbook of Prescriptions for Emergencies*\nIn the year *gengchen* of the Great Era, the Recluse says: I have dwelt in secluded mountains for nearly a decade. Though I have often cultivated virtue and performed deeds of merit, most have been but temporary measures—nothing that might transmit fragrance to distant descendants! Yet nothing surpasses the act of composition. I have seen Ge Hong’s *Handbook of Prescriptions for Emergencies*, which amply fulfills the aspiration to illuminate even a single corner.\n\nOf all the great afflictions of human life, none is more urgent than illness. To suffer illness without treatment is like fighting fire without water. Those in the imperial entourage may easily find physicians and remedies, but beyond the city walls, they are already difficult to come by. How much more so in remote villages, distant wilderness, deep mountains, or isolated shores—where untimely deaths abound, their number beyond reckoning!\n\nMedical texts abound in volumes, yet their profusion brings little relief. To consult them is to be led astray by confusion. This work of Ge Hong’s is truly of profound benefit, yet it remains incomplete, its excellence not yet fully realized. Thus, I have gathered and supplemented it with one hundred and one additional formulas, distinguishing them in vermilion script as *One Hundred and One Formulas of the Handbook of Prescriptions for Emergencies*. For miscellaneous ailments and simple treatments, this compilation now suffices for most needs.\n\nIn ancient times, Ying Qu composed his *One Hundred and One Poems* to admonish conduct and refine the heart. My compilation here serves to safeguard and support my own person. Moreover, as the Buddhist scriptures say: \"Humans, composed of the Four Great Elements, form a single body, which may suffer one hundred and one illnesses.\" Therefore, it is deeply fitting to reflect on this. From the most learned scholars to the common people, none should fail to copy and study it.\n\nBeyond this compilation, I have also composed five additional volumes of *Proven Formulas*, further discussing the symptoms of various diseases and the adaptive use of medicines—all of which are highly effective treatments, not merely resources for those in seclusion. Even those in grand halls or noble chambers would do well to examine and take heed.\n\nGe Hong’s preface states: \"This may be applied in poor households and rustic dwellings.\" Yet its use is not so limited. Now, if gentlemen of the gentry enjoy leisure and ease, they may peruse these medical texts. But if they are dispatched to distant posts, entrusted with official duties, or stationed in guarded palaces where dawn and dusk are cut off, or bound by military service behind fortified walls—then let them too find value in these pages.\n\nWhen suddenly stricken by illness, one can only clasp hands in helplessness—how much better to delve into one’s satchel, where ready remedies may be found to forge a physician from even the most unskilled. Thus, I have exhaustively discussed symptoms to ensure clarity and prevent confusion. With but a glance at the headings, one may avoid misdiagnosis.\n\n*Preface to the Materia Medica*\nDwelling in reclusion among the peaks and crags of Mount Mao, I turned in my moments of leisure from breath cultivation to the study of arts and techniques. Surveying the properties of herbs in the *Materia Medica*, I saw therein the fullness of the sage’s intent and so composed this discourse. The old accounts all attribute the *Divine Farmer’s Classic* to Shennong, and I affirm their truth.\n\nWhen the Divine Farmer ruled all under Heaven, he drew the Eight Trigrams to bridge the minds of spirits and men, devised plowing and planting to spare the harm of slaughter, and proclaimed medicines to heal the sick and rescue lives cut short—these three Ways have endured through the ages, growing ever more luminous. King Wen and Confucius expounded the *Changes*, subtly illuminating the realms of heaven and humanity. Hou Ji and Yi Yin sowed the hundred grains, their bounty showering all living things. Qi Bo, Huangdi, Peng Zu, and Bian Que spread their teachings, their grace flowing through all that breathes, preserving the lives of three thousand people in every generation—we rely upon them still.\n\nYet before the Yellow Emperor’s time, written records did not survive. The Six Lines pointed the way, and the images of tilling and sowing arose from immediate practice. As for the governing properties of medicines, how could they be transmitted save through direct recognition passed down in unbroken succession? Only with Tongjun and Leigong were these teachings first inscribed on bamboo slips. This work should rank alongside the *Plain Questions*, though later hands have often embellished it. The First Emperor’s burning of medical formulas, divination texts, and arts of prognostication spared it, and so its complete record endured. But when the Han court fled and the Jin rulers fled in turn, texts were scattered and burned—scarcely one in a thousand survived.\n\nHere now survive these four scrolls, being the original canon. The commanderies and counties named therein follow the system of the Later Han, and were likely recorded by [Zhang] Zhongjing, [Hua] Yuanhua, and others. It is also said there exists the *Tongjun’s Record of Gathered Medicines*, which in four scrolls describes the flowers, leaves, forms, and colors of herbs, and discusses their paired applications and mutual necessity. From the Wei and Jin onward, Wu Pu, Li Dangzhi, and others repeatedly revised and expanded it—sometimes to five hundred ninety-five entries, sometimes to four hundred forty-one, or three hundred nineteen. At times the Three Grades were jumbled together, with cold and heat properties confused, plants and minerals undifferentiated, insects and beasts unclassified. Moreover, their indicated treatments often proved inconsistent, and physicians, unable to examine all texts, varied in discernment and depth of understanding.\n\nHere I have gathered and synthesized the various canons, refining and condensing their complexities. Taking the *Shennong’s Materia Medica*’s Three Grades—three hundred sixty-five entries—as the foundation, I have added a supplementary grade of three hundred sixty-five from the *Famous Physicians’ Formulas*, totaling seven hundred thirty kinds. All essentials have been carefully selected, with nothing omitted, and arranged by categories and classes. I have further annotated their seasonal uses, places of origin, and the requirements of Daoist scriptures and arts, compiling this preface and catalogue into seven scrolls. Though this work may not rival the excellence of earlier masters, it stands as one school’s systematic effort.\n\nAfter my passing, may it be bequeathed to those of kindred understanding.\n\n*Collected Works of Tao the Recluse of Huayang, Scroll One* (end)\n*(Note: The character 唯 was originally written as 隹, likely a scribal error; emended here based on context.)*\n\n*Collected Works of Tao the Recluse of Huayang, Scroll Two*\n*Compiled by Zhao Tai’s disciple, Fu Xiao*\n\n**Collated by Chen Tong, Disciple of the Great Cavern**\n*Inscription on the Altar Stele of the Former Residence of Director Xu*\n\nVast and boundless—such is the numinous essence of the cosmos. It transcends all expression in words or images, all records in written traces. Yet if left unspoken, how shall later generations come to know it?\n\nIt embraces and exhales the myriad existences, nurturing the growth of grasses and trees. Its origins lie in profound obscurity, its meaning归于冥昧. As for the division of forms and realms, the distinct natures and functions of things—these may be discussed where matters are bounded by observation and hearing, where principles are exhausted by calculation and knowledge.\n\nWhy are mountains so lofty, seas so vast? Because they possess the capacity to contain. Within the great heavens lie thirty-six lesser heavens, all expanding to dwell within the emptiness of earth. They span the veins of flowing waters, open the gates of wind-swept peaks, and connect the qi of clouds and mists.\n\nThis mountain was originally called Mount Gouqu. Beneath it lies the Eighth Cavern Palace, known as the Heaven of Jintan Huayang. Its circumference measures one hundred fifty *li*, divided into three administrative precincts. During the reign of Emperor Yuan of the Former Han, the Three Mao Lords of Xianyang attained the Dao and came to govern this domain—hence its name, Mount Mao. The full account is detailed in the biographical records.\n\nIn the first year of the Taihe era of the Jin dynasty, Director Xu of Jurong established his residence here, and its traces remain to this day. At the beginning of the Song dynasty, Prince Jing of Changsha built a Daoist abbey at the eastern edge of this site. In the thirteenth year of the Tianjian era of the Liang dynasty, the abbey was repurposed into the Zhuyang Lodge, fulfilling distant omens foretold in earlier prophecies. Later, a fire ravaged the lodge, and a new hermitage was constructed to the west for habitation. In the fourteenth year, the Yugang Study Hall was built separately, emulating the traces of the Mystic Continent. By the seventeenth year, the altar stele was repaired and inscribed, reverently recording the true principles.\n\nThe Perfected One bore the surname Xu, with the personal name Mi, courtesy name Sixuan, and given name Shi. He was originally from Pingyu in Runan. In the second year of the Zhongping era of Emperor Ling of the Later Han, his sixth-generation ancestor, Xu Guang (courtesy name Shaozhang), fled the turmoil caused by the flatterer Xu You and crossed the Yangtze, settling in Jiyang Village of Duxiang County in Jurong, Danyang. Later, he served the Wu kingdom as Superintendent of the Imperial Household, renowned for his discernment and brilliance, with successive generations distinguished in talent and wisdom.\n\nHis grandfather, Xu Shang (courtesy name Yuanfu), possessed literary talent and keen insight, serving as Gentleman of the Interior in Wu. His father, Xu Fu (courtesy name Zhongxian), was of profound and far-reaching character, his demeanor refined and unadorned. He held the posts of Magistrate of Ke County, General of Pacification, Prefect of Xianxia, and Marquis of Xicheng.\n\nDirector Xu was the fifth son of Xu Fu. From childhood, he was known for his intelligence and simplicity. While still a prince, Emperor Jianwen regarded him as a paragon among his peers. He began his career as Erudite of the National University. His mastery of court rituals and Confucian discourse made him a leading authority. Later, he served as Magistrate of Yuyao, where he alleviated the people’s hardships and extended his benevolence to neighboring counties. Recalled to the capital, he became a trusted advisor at the emperor’s side.\n\nAt the end of the Shengping era, he was appointed Director of the Bureau of Military Affairs and Chief Examiner of his home commandery. Externally, he oversaw military regulations; internally, he evaluated the worthy. Distant regions adhered to his discipline, and his hometown emulated his conduct. During the Taihe era, he was promoted to Gentleman Attendant at the Yellow Gates and Cavalier Attendant-in-Ordinary. Adorned in the splendor of court regalia, his duties centered on the cultivation of virtue.\n\nWhen Emperor Jianwen ascended the throne, he honored the elderly and cherished the wise. Had the emperor not passed prematurely, Director Xu would have retired. Instead, he withdrew to his mountain retreat to devote himself to the cultivation of the supreme Dao. Though he wore the court’s sash and cap and engaged in scholarly discourse, his heart soared beyond material forms, his aspirations bound to the gates of rosy clouds. His fourth elder brother had already departed on a distant journey. In the fourth year of the Yonghe era, he too withdrew from the world and never returned.\n\nDirector Xu had long admired the secluded and wondrous, and as the years deepened, he formed a profound spiritual bond with Master Yang. During the Xingning era, the host of Perfected Ones descended upon Master Yang, bestowing upon him the Dragon Script and Cloud Seal. The revelations encompassed the profound and abstruse mysteries of the numinous teachings, which Director Xu diligently studied. As he approached the age of retirement, his devotion to practice grew ever more steadfast.\n\nIn the first year of the Taiyuan era, he departed this world at the age of seventy-two. His sons and nephews buried him in a grand tomb west of the county. The traces of his ascent to the capital of Jingling remain fresh, and the soaring sword’s mark endures.\n\nAccording to the *True Records*, his destiny was predestined, his karmic foundations long established. In the time of King Wu of Zhou, he was the younger brother of Xue, the Grand Minister of the Nine Palaces of Changli. Moreover, the accumulated merits of his ancestors ensured blessings for their descendants, so he was born into this world to fulfill his Dao. The Jade Tablet conferred upon him the rank of Perfected One of Supreme Clarity, with a noble title equivalent to a marquis and a position among the ministers. He governed the affairs of immortals, assisted the sage in shepherding the people.\n\nThe true transmission has not yet been fully revealed to the world, so its details cannot be fully recounted. Master Yang, whose personal name was Xi, is fully documented in the *True Records*.\n\nDirector Xu’s third son, Xu Yufu (courtesy name Daoxiang, given name Pian), was born to his mother, née Tao Wei, who had already passed away and ascended to the Palace of Easy Transitions in the Cavern Heavens. He was of luminous intelligence and purity, surpassing all his contemporaries.\n\nThe commandery recommended him for the post of *shangji*, yet he declined, spurning worldly affairs like chaff and dust to devote himself to the profound Daoist arts. He was none other than the true master of Master Hongjing in the mysteries of the unseen. He dwelt constantly in this residence, repairing and transmitting the scriptures and methods. Master Yang often sought his guidance, and through repeated communion, they attained true resonance.\n\nIn the fifth year of the Taihe era, he passed away here at the age of thirty. The *True Records* state: sixteen years later, he would be destined to ascend as the attendant to the Eastern Flower Youth, the Prime Minister of the Azure Lad. In the Court of the Celestial Dawn, he would receive the scriptures and be appointed as an Immortal Duke of Supreme Clarity, sharing office with Gu Xizi. His rank in the Court of the Celestial Dawn was comparable to that of a palace attendant in the mortal realm.\n\nHis eldest brother, Kui (secular name Zhen), and his second brother, Huya (secular name Lian), both likewise attained the Dao. Kui now has a great-great-grandson, Lingzhen, who resides in the mountains and has urged the establishment of the Hall of Successive Perfected Ones to honor the virtue of their distant ancestor.\n\nOur August Emperor, riding the power of his great vow, descended to this land to nurture the black-haired people and mold the myriad beings. He guided by law and shaped customs, unfolding teachings in accordance with the unfolding of destiny. As Master Yinju had long accumulated the three scriptures and records of the Perfected Ones, dwelling for many years in Huayang, it was fitting that he return to his former residence to maintain and cultivate it. Thus, artisans were summoned to construct this hall of tranquility. In reverence to the celestial standard and to propagate the great Dao, an azure altar was raised in the east and a pure pagoda erected in the west. Between altar and pagoda lies the foundation, where tiles and bricks were laid, and beams were set in place. Purple mists and white vapors coil and swirl, casting their shade like a canopy.\n\nSouth of the residence lies a well, dug by Director Xu himself. South of the well is a great pond, a remnant of Guo Chao’s design. Its source is the spring of Lord Tian, and its path follows the tracks of Jiang Ba. Flanking it is Leiping, and before it stretches Xiabo. To the east, ridges connect in succession, while to the north, a long ridge extends. The willows of Yanggu and the fertile valleys converge at the western edge. Within these four bounds, the land is called Jinling, the \"lung of the earth.\" Director Xu’s dwelling is especially distinguished. Soon, he will harness clouds and rainbows to soar high, driving swift cranes to chase the wind. Gazing upon the vast and boundless waves, he will roll up the distant ancient capital like a scroll.\n\nAs the ancients said: if no deeds are wrought, what legacy remains? Thus, we dare to inscribe this stone in praise, that it may endure for future worthies. The primal axis races with the qi, and the earth’s spirit exhales its numen. By nature, it divides into realms; by perception, it assumes form. Transforming through the eight abodes, its merit permeates the four darknesses. Traces vanish like lightning, bodies abide like deep pools. The revolving regions stand like mountains, and in a single day, the sea’s clouds unfurl. Grasping the wind and swimming the waters, their traces truly rest upon emptiness. Even the hidden craftsmen of stone open caverns to frame their dwellings. With lofty sentiments and radiant presence, they reside in the celestial palaces and earthly abodes. Winding peaks curve like bows, and painted lands float like lungs. Five gates open on all sides, and nine paths encircle them. Long ridges stretch beside the hills, their streams intertwining like braided cords—thus it is called \"Dragon’s Crouch.\" The emperor named it \"Golden Mound.\"\n\nLong ago in the Western Han, the Three Mao Brothers came as guests. By the Eastern Jin, the Two Xus embraced the true Dao, laying foundations, dredging wells, dwelling in seclusion, and communing with spirits. Truly, they were worthy aides to the sage, granted the honor of serving at the Celestial Dawn. Though the ages have passed and names have faded, the scriptures and records fully proclaim their radiant essence, which has not yet dimmed. Yet the refined and the coarse have mingled, and the sacred steps have crumbled. Frost has withered the trees in the courtyard, and weeds have overgrown the once-tended gardens.\n\nWhen the Hall of Huayang was first established, two cycles of twelve years had elapsed. Ever observing the former principles, we now follow the grand path. The emperor declared: \"O Grove, here shall you abide.\" We have cultivated and built it, and now it stands resplendent. The sacred hall resonates with subtle echoes, pouring forth fragrance like a vase of blossoms. Jade palaces and azure tablets gleam with radiant patterns. Jeweled caskets and jade seals are draped with embroidered curtains and silken veils. Orchid lamps blaze brightly, and golden censers waft their incense. The paired teachings of the paulownia and the square mirror are both studied. Together, they testify to the purity of the heart and the impurity of the body. Departing from being and non-being, they embrace both the ornate and the plain. They are named the \"Vacuous August One,\" and their methods are those of true awakening. Medicinal omens manifest in luminous forms, and meditative resonance opens wisdom. Soaring in joy, they grasp the rainbow and tread upon light. They dispel suffering and cast off the mundane, returning to brightness and regaining their hearing. Things speak of their power, yet I see no merit of my own. Through the ages, past and present, the two realms stretch boundlessly. The three illusions deceive, yet the boat and the ravine move of themselves. Responding to destiny as it unfolds, they act without premeditation. Thus, we inscribe this in the tortoise-shell records, that gods and humans may bear witness.\n\nThe Stele of Lord Ge, Left Minister of the Grand Ultimate of Wu\n\nThat which crowns the two principles at their inception and whose name transcends the origins of the myriad things cannot be debated by speech nor fathomed by designation. If it could be described in words, how could metal and stone transmit antiquity? When it flourishes, the sun and moon shine in vain. When it is silent, mortals remain in eternal darkness. Thus, it emerged from the pass, guiding with two scrolls, and ascended, bestowing its five texts. It allowed those who embrace the numinous and hold to consciousness to know that within the unfathomable, there is essence.\n\nFrom that time onward, through successive generations, it has manifested. Cloud-script and dragon-chapters gleam upon the forest peaks. Earthly words and radiant qi flourish in the halls and courtyards. Those who could leave behind models and become the subjects of ballads and chants have continued until this day.\n\nIn the middle ages, Gan Zuo startled the King of Wei, and Xiang Feng displayed his marvels to the Lord of Wu. Yet the talent of Lord Ge was surpassingly brilliant, standing out most prominently. Though he traveled through famous mountains in his time, he often dwelt upon this ridge. This ridge is no cavern-heaven, yet it straddles the central river. To the east, peaks stretch into the sea; to the south, layered peaks pierce the clouds. To the west, the river runs clear; to the north, the outskirts of the city lie near. This is a hidden and manifest realm of mystery, a gateway for emergence and retreat. A stone well, half a fathom deep, is drawn from daily, yet its source remains unfathomable. A three-legged white muntjac, unchanged for a hundred years, embodies a purity that even spirits cannot alter and deities guard and protect. Followers of the hemp-robed lineage of the Historians have successively dwelt here. Later, his descendant Sun Weizu also inherited the residence.\n\nIn later years, Pan Hong of Shanyin (courtesy name Wensheng) resided here. From youth, he embraced the Daoist nature, his will and strength resolute and bright. Previously, he established an abbey in Yuyao, Siming, and the Kingdom of Yue, a hundred li upward, where the paths were overgrown and perilous. Yet his arts and knowledge proved useful, and the sentiments of the people turned toward him.\n\nIn the seventh year of the Tianjian era, the powerful and venerable families of the commandery and counties jointly urged him to remain, not by his own will, but because this mountain stood at the vital crossroads of five counties. Thus, he stayed for fifteen years. Intending to move his retreat to the altar above, he found an old stele already toppled and broken. Pan Hong reflected: if one cherishes the shade of a tree, how much more should one revere its branches? Could the sacred traces left by the immortal sage be allowed to vanish? He therefore erected a new stele in its place, wishing to inscribe his name upon it for eternal transmission. Though his hermitage lay a thousand *li* distant, he entrusted this stone to be carved here.\n\nThe immortal sage was surnamed Ge, personal name Xuan, courtesy name Xiaoxian. A native of Jiyang Village in Danyang’s Juyong County, he originally hailed from Langye but later settled here when his ancestor, the Marquis of Piaoxi of the Later Han, ceded his state to his younger brother. His seventh-generation ancestor, Ai, was that younger brother and inherited the title of Marquis of Piaoxi. His grandfather, Ju, served as Prefect of Anping and Gentleman of the Yellow Gate. His great-uncle, Mi, governed five commanderies, including Yuzhang. His father, Yan, styled Deru, held the posts of Registrar of the Province, Magistrate of Shanyin, Cavalier Attendant-in-Ordinary, and Grand Master of Splendid Happiness. Their lineage teemed with brilliance, its renown filling the annals of history.\n\nFrom childhood, the sage bore extraordinary conduct, surpassing all his peers. His spirit soared with lofty distinction, his essence radiant and transcendent. Though he never studied the classics, he grasped them intuitively; though he heard of Daoist arts but once, he mastered them completely. No conventional norms could restrain him, no ordinary wisdom encompass him. He dwelt beyond the bounds of human sentiment and reason, beyond the reach of words and forms.\n\nIn the early Wu era, Zuo Yuanfang arrived from Luoyang and transmitted to him the Seven Transformations of the White Tiger and the Nine Elixirs of the Furnace and Fire. Thereupon, his five spiritual penetrations became fully realized, and his transformative Dao knew no limits. Though Sun Quan admired and esteemed immortals and marvels, he harbored suspicion and malice within. Those like Yu Fan suffered rebuffs and exile, yet he stood in awe of the immortal sage, constantly seeking his counsel. The sage traversed rivers and mountains, attended by dragon and tiger retinues. He frequented Changshan and Gaizhu, and his comings and goings were especially numerous. The windswept orchids of Tiantai and the fragrant breezes of Lanfeng were his favored haunts. When he returned to the capital, he treated people as playthings, his conduct unpredictable and bold, overturning rivers and mountains at will. Whether casting his shoes into the abyss or commanding stones to rise at his rebuke, none could match his audacity.\n\nAt that time, there was a man adrift upon the sea, tossed by the winds across boundless, surging waves. Suddenly, he came upon a divine isle, where someone entrusted him with a sealed scroll, inscribed: *\"To be delivered to Master Ge the Immortal.\"* He was instructed to return to Wu and present it. From then on, the entire realm revered him as the Immortal Master. Thus, in the *Baopuzi*, it is also written: *\"My ancestor was an immortal.\"* The Master was indeed a descendant of Baopu. Three generations of his forebears were immortals. Common texts and traditions speak of him as having been appointed to the position of Left Immortal Master by the Supreme Polarity. Yet in works like the *Zhen’gao* and the old genealogies of the Ge clan, the accounts do not align. Perhaps the teachings diverged, or the circumstances of the time necessitated such claims—much like a guard bearing a halberd at the palace steps. How could one expect to pluck the sacred peaches thrice, merely to be tasked with summoning spirits and commanding ghosts, unaware that his rank remained but a minor office? Judging by the expedient Dao, there is no need to debate their discrepancies further.\n\nIn the seventh year of the Chiwu era, on the fifteenth day of the eighth month of the jiazi year, at dawn, the Immortal Master ascended to transcendence. He departed never to return, ever accompanied by Guo Shengzi and others. In time, he would be appointed to the Mysterious Capital, granted the celestial rank of a divine office, and serve as one of the Four Auxiliaries, governing and overseeing the affairs of humans and earthly spirits. Gazing back upon his former homeland, how could he not sigh with longing? Turning to later disciples, may he extend the compassion of guidance.\n\nDaring to rely upon the humble standing of his clan, I now recount the legacy of this true immortal. Thus:\n\nThe nine gorges stand severed, the seven stars hang suspended in emptiness. Space is divided to form realms, darkness gathers to construct the heavens. Things flourish in number, transformations arise in form. Life follows the turning of shapes, spirit is entrusted to the transmission of karma. Frost withers the wilds in decline, bamboo and paulownia thrive in emerald hues. Springs and ruins share a common fate, yet Peng and Xian alone return. Life is grasped through affairs, years are sought through learning. Like gold in the cold, like silk on the loom—\n\nThe Immortal Master’s jade scepter gleamed, his hidden brilliance burst forth. He matched the traces of Xiang’s boyhood, his shadow joined that of Xiang Ru. He bathed his essence in the brocade chambers, concentrated his mind upon the dark peaks. Having mastered the tiger’s transformation, he then rode the dragon’s chariot. He exhausted the heights of Tai and Huo, roamed the vastness of Lan’s vault. The azure altar purified itself, the jade waters flowed endlessly. He wandered through fragrant groves to bathe in the Dao, his heart moved with sorrow for the ancients. This towering stele stands to eternally spread his lofty virtue. The orchid winds of his favored haunts have already been engraved upon a grand monument. Yet this land, his former dwelling, remains uncarved with enduring inscriptions. Now, his distant descendants, in reverence of his pure legacy, respectfully seek to inscribe and erect this stele, that his fragrance may be transmitted to future generations.\n\n---\n\n**Petition for Resignation from Office**\n\nI have heard that the winds of Yao soared to the heavens, and Yingyang’s discourse stirred the rivers. The virtue of Han encompassed the earth, and Shangyin’s spirit soared on the breath of lingzhi. I have long dwelt in seclusion, wearing the cap and sash for many years. My service was never for glory, nor my studies for salary. I have always yearned to hang my official cords at the palace gates and till the fields alone, to sit beneath the moon at my valley door, or play the zither amid the clouds. By the grace of the central court, I was granted my wish to retire to the hills and streams. Now, I shall vanish like a shadow in the cassia courtyard, my spirit communing with the pines. Though I depart from the palace gates, my homeland remains in sight. As I coil my words in reflection, tears fall upon the waves.\n\nMy boat and oars have already been left behind; I cannot attend in person. Unable to bear the weight of my longing, I respectfully submit this petition.\n\n---\n\n**Imperial Rescript in Reply**\n\nYou have cast aside worldly burdens and grain, ever aspiring to purity and emptiness. In the tranquility of the mountains, you find joy in your true nature—may you fully realize your noble aspirations. If you have any needs, you may report them at once.\n\nAdditionally, you are granted ten bolts of silk and twenty sticks of wax. A separate gift of fine goods is also bestowed.\n\nMonthly, We grant you five *jin* of superior *fuling* and two *dou* of white honey for your regimen of ingestion.\n\n**Submission of *Zhou’s Records of Mystic Communication***\nYour servant reports: In the latter part of the tenth month, matters concerning the Zhou family arose. As I was then observing purification rites, I could not immediately submit a report. Now, I have respectfully compiled these events into four volumes, which are presented separately. Yet I, enmeshed in the web of doubt like Guo, failed to awaken to belief sooner. In remorse and self-reproach, I fear I have incurred stern censure—all is set forth in detail in the accompanying memorial. Humbly, I pray for leniency in my negligence. Respectfully submitted.\n\n**Imperial Rescript in Reply**\nWe have reviewed your memorial and seen Zhou’s posthumous revelations, which clearly fulfill earlier prophecies. The two or three instances of verification are especially wondrous. The four volumes are now retained here. As for the accompanying memorial, its every word is noted; We can only sigh in admiration.\n\n**“Announcing the Journey”**\nSince the spirit’s inception of old,\nThe green karma has long followed.\nTransformation is not annihilation;\nIn principle, sorrow and joy fade.\nCrown and sword are but empty shadows;\nThe bit and bridle belong to the immortal’s form.\nDeparting this bright chariot’s song,\nYou join the guests of Ying Terrace.\nIf you can tread the tracks left behind,\nI shall guide you to the Dao’s mystic ford.\n\n**“Rhapsody on the Wind of the Cloudborne Immortals”**\nDrifting in distant reaches,\nOne morning it soars over the azure sea, scattering dawn’s rosy clouds,\nTraversing the blue mist to fill the farthest heavens.\nIt surges through Dragon Gate, churning the waters,\nCrosses Cong Pass, whirling snow.\nThus the Han realm stirs in awe,\nThe moon’s chariot startles at its patterns.\nIt floats through the void into light,\nAscends the sky, rides the clouds.\nA single flight spans ten thousand *li*,\nYet scarcely a day passes.\nThis is the wind of Liezi—wind that depends on conditions.\n\nYet there is a wind that embraces the cosmos,\nEnvelops the pillars of heaven,\nCirculates through the eight directions,\nCycles through the four seasons.\n*Qi* stirs the pitch-pipes when the season arrives;\nIts position shifts from *xun* to *li*, from *ji* to *kun*.\nOne sees only the threads of its coming and going,\nNever the beginning or end of its term.\nThis is the wind of Great Emptiness—wind of non-action.\n\n**Stele Inscription for the Changsha Lodge at Mount Mao**\nAll the myriad forms arrayed in the world arise from the nurture of the Two Modes.\nThe hundred teachings flourish without transcending the bounds of the Three Teachings.\nScholars of the court don their ceremonial robes within palace halls;\nThe steadfast and upright raise their banners on the mountain’s edge.\n\nInscription:\nGreat is the Creative! All things depend on it for their beginning.\nKings receive the Mandate, and the Three Powers are ordered.\nOnly the sage moves the divine;\nOnly the divine bestows blessings.\nVirtue resounds in song and bell,\nNames shine in the annals of history.\nBrotherly love and reverence—\nHere, the western lands proclaim them.\nWords follow flourishing deeds,\nTo honor those who came before.\nDare we alter old customs?\nYet we have revised the miscellaneous verses.\nCarved in stone, it shall not perish,\nLeaving fragrance for generations to come.\n\n**Stele Inscription for the Sun Gate Lodge at Mount Taiping**\nThe Sun Gate Lodge takes its name from the dawn’s rays piercing the gorge, opening the crag to draw forth the torch’s light. Formerly, the Eminent Lord Du of Wu Commandery—his renown high in two dynasties, his virtue foremost in the four quarters—spread his teachings far and wide, their influence reaching several commanderies. He expanded his precincts east of Mount Taiping and built his retreat north of Jing Mountain. Finding this place secluded and wondrous, he established his foundation here. Those who dwell here in pursuit of the Dao have passed many years.\n\n**Inscription for the Quilin Lodge at Mount Mao**\nLofty ridges rise without;\nDeep halls gleam within.\nNarrow caves branch to the side;\nWinding springs mirror the distance.\nThose who esteem virtue abide in benevolence,\nSeeking life and nurturing destiny.\nNow heaven, now earth—\nNow ordinary, now sacred.\nRoofs and rafters stand side by side,\nEach claiming to know the Dao.\nTheir teachings vary,\nTheir literary styles soar or plunge.\nYet who compares to Quilin Lodge,\nAlone in its steadfast excellence?\nHere, one conceals one’s traces and veils one’s merits,\nAbiding in this place to grow old together.\n\n**Letter in Reply to the Secretary**\nThe beauty of mountains and rivers has been a shared topic since ancient times. Lofty peaks pierce the clouds; limpid streams reveal their beds. On either shore, stone cliffs glow with intermingled hues. Green forests and emerald bamboo stand complete in all four seasons. At dawn, the mist begins to disperse—monkeys and birds cry in chorus. As the evening sun inclines, fish leap in the depths. Truly, this is the immortals’ realm within the desire realm. Since Xie Lingyun’s time, none have matched its wonders.\n\n**Letter in Reply to Yu Zhong**\nFor some time now, you have perched your transcendent wings on the branches of Jing, gazing at the brocade clouds in the azure sky. Spring’s blossoms have arrived, adorning the grasses and stones with fresh beauty. Your words stir the depths of feeling; your aspirations intertwine with mine. Truly, the discourse of kindred spirits is never empty. Though you remain near the vermilion towers, your heart longs for Mount Tai. How could you merely loosen your hair in the high peaks, or scatter frost in the remote valleys? How admirable indeed!\n\nThis rustic has been fortunate to lodge his form on lofty heights, resting his shadow in the endless woods. Often, I sigh beneath the flowing moon or face the wind with deep emotion. Yet my entanglements remain unresolved, and my appearance betrays the passage of time. Unless one equates life and death as one, who could remain untroubled? The world drifts on—who shares this sentiment? If I should meet a kindred spirit, we might share our sorrows together. Since you have come, Master Yu, how could I not advance? Why wander restlessly, vainly beating the earthen jar? When leisure comes, let us attend to rejuvenation. Would this not be as radiant as in youth, free from shame before the ancients?\n\n**Letter in Reply to Zhao Yingcai**\nYou have built your learning within the realm of scholarship, yet your talent soars beyond its bounds. Unwilling to sweep your gate in search of office, you are too indolent even to refine your skills for advancement. Thus, you remain aloof in your garden lane, at ease in the countryside. This, then, is the so-called “proud guest.” As for this rustic beneath the cliffs—he guards his single-minded resolve. Not that I dare scorn glory or mock the world, but I follow my nature and go straight ahead, preserving my uselessness to gain leisure. Gathering firewood and drawing water bring me abundant joy; cutting pines and boiling herbs—what other tasks occupy me?\n\nYet the heavens and earth are a vast dwelling, and the myriad things share in a single transformation. Life and death, good and evil—how can one fathom them?\n\n**Preface to *The Classic of Physiognomy***\nPhysiognomy reveals the nature and destiny inscribed in one’s form and bones, just as fortune and misfortune are manifest in one’s *qi* and appearance. It is like acting only after thorough deliberation, or responding only after the heart has moved. Inner and outer correspond, yet none know how. Still, wealth and nobility, longevity and early death—each meets its allotted measure. Dong Xian, though barely past twenty, rose above the Three Dukes, his wealth half the nation’s. Yet before thirty, his body was broken, his family ruined.\n\nFeng Tang’s chair wore thin in the bureau halls, Yang Xiong stood like a wall in his lofty chamber—yet both reached hoary age. Some feast on jade viands in their twilight years, yet their rank never rises above clerk or scribe. Some are sharp as spirits in wisdom, yet barely reach their allotted span. Others cannot tell beans from wheat, yet live out their days in ease. This further shows how each attains but a partial measure.\n\n**End of *Collected Works of Tao Hongjing of Huayang*, Scroll Below**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "华阳陶隐居集 经名：华阳陶隐居集。 明传霄编。 二卷。 底本出处：《正统道藏》太玄部。 华阳陶隐居集卷上 昭台弟子傅霄编集 大洞弟子陈楠校勘 江总序 昔刘向通古今之学，马融见天下之书，京房察风雨之占，裴楷晓阴阳之卫。 ．子政伤於简易，季长敝於骄侈。 君明遂不旋踵，公矩才免极诛。 鲜有尽美之边，罕闻克终之誉。 若夫德行博敏，孔空四科，经术探长，郑门六艺，丹阳－陶先生备斯矣。 至知紫台青简，绿峡丹经，玉版秘文，瑶坛怪牒，靡不贯彼精微，婵其旨趣。 盖非常之绝仗，命世之异人焉。 文集缺亡，未有编录。 门人补辑，若逢辽东之本。 好事研搜，如诵河西之筐。 奉劝校之铅墨，缄以缇网。 藏彼鸿都，副在延阁。 寻山志年十五作 倦世情之易挠，乃杖策而寻山。 既沿幽以达峻，实穷阻而备艰。 眇游心其未已，方际夕乎云根，欣夫得志者，忘形。 遗形者，神存。 於是散发解带，盘旋其上。 心容旷眼，气宇条畅。 玄虽远其必存。 累无大而不忘。 害马之弊既去，解牛之刀乃王。 物我之情，虽均因已济，吾之所尚也。 若夫飞声西岳，邀利束陵。 楚湘之洁，昊江之矜。 轻死重气，名贵於身。 迷真晦道，余所弗丞。 袭衣缝掖，端委章甫。 徘徊廊庙，趋翔庭宇。 傅氏百王，流芳世绪。 负德叨荣，吾未敢许。 尔乃，荆门昼掩，蓬户夜开。 室迷夏草，径惑春苔。 庭虚月映，琴响风哀。 夕乌依檐，暮兽争来。 时复历近，垄寻远壑。 坐盘石，望平原。 日负蟑以共隐，月披．云而出山。 风下松而含曲，泉潦石而生、文。 草薇薇以拂露，鹿飒飒而来群。 扪虚萝以入谷，傍洪泽而比清。 照石壁以端色，攀桂枝而齐贞。 亟扈兰而佩蕙，及春鴂之未呜。 且含怀以屏黑，待惠风而舒情。 乃乘兴而遂往，遵岩路以达游。 贮天维而漂思，微悦惚而莫求。 眺回江之森漫，眩迭幛之相稠。 日斜云而色黛，风过水而安流。 触嵚岩而起缴，值阔达而成洲。 石孤耸而独绝，岸悬天而似浮。 绿瞪道其过半，魂眇眇而无忧。 悟伯昏之条岩，蹑千仞而神休。 遂乃浚岩峭，至松门。 背通林，面长源。 右联山而无际，左凭海而齐天。 竹汶法以垂露，柳依依而迎蝉。 鸥双双而赴水，鹭轩轩而归田。 赴水兮泛滥，归田兮翱翔。 此翔滥之足乐，意斯龄之不长。 悼菌媳之危促，羡灵桩兮未央。 ．虽鹏钨之异类，托逍遥乎一方。 愿敷衽以远诉，思松朝而陈辞。 至赤城兮一憩，遇王子而宿之。 仰彭涓兮弗远，必长年兮可期。 及榆光之未暮，将寻山而采芝。 去采芝兮入深涧，探涧幽兮路窈窕。 窈窕路兮终无曙，深涧深兮未曾晓。 高松上兮亟停云，低萝下兮屡迷乌。 乌迷罗兮缤纷，云停松兮欲纷。 纷停云游兮安泊，离乌栖兮索群。 嗟群泊，其无所。 思参差而谁闻，既穷目以无阂。 先生去世后。 久无人编录文集。 至陈武帝贞明二年，劫令侍中尚书令江总，始撰文集。 先生以梁大同二年解驾，至是五十三载矣。 文章颇多散落。 问渔人以前路，指示余以蓬莱。 曰：果尔以寻山之志，馆尔以招仙之台。 就瀛水以通怀，谓万感其已会。 亦千念而必谐，竟莫知其所跻。 反无形於寂寞，长超忽乎尘埃。 水仙赋 森漫八海，肱泊九河。 中天起浪，分地泻波。 束卷长桑日窟，西斡龙筑月阿。",
      "translated_text": "**Collected Works of Tao the Recluse of Huayang**\n*Compiled by Ming Chuanxiao. Two fascicles. Source text from the Zhengtong Daoist Canon, Tai Xuan Section.*\n\n**Fascicle One of the Collected Works of Tao the Recluse of Huayang**\n*Compiled by Fu Xiao, Disciple of the Luminous Terrace*\n*Collated by Chen Nan, Disciple of the Great Cavern*\n*Preface by Jiang Zong*\n\nOf old, Liu Xiang mastered the learning of past and present; Ma Rong beheld the books of all under heaven. Jing Fang discerned the omens of wind and rain; Pei Kai understood the safeguards of yin and yang. Yet Zizheng (Liu Xiang) was undone by oversimplification, and Jichang (Ma Rong) was ruined by arrogance and extravagance. The enlightened lord perished in an instant; Gongju (Pei Kai) barely escaped the ultimate punishment. Few have attained perfection in all things, and rare is the praise for one who sees virtue through to the end.\n\nAs for those of vast virtue and keen intellect—like the four disciplines of Confucius’ school—or those who delved deeply into the classics—like the six arts of Zheng’s lineage—Tao the Master of Danyang embodied them all. He possessed profound knowledge of the purple terraces and green bamboo slips, the cinnabar texts of the emerald ravines, the jade tablets of secret scriptures, and the wondrous scrolls of the jasper altars. Nothing escaped his mastery of their subtleties, nor did he fail to grasp their essential purport. Truly, he was an extraordinary figure of unparalleled talent, a rare man of his generation.\n\nYet his literary works had been lost, and no compilation existed. His disciples gathered what remained, as if encountering a text from Liaodong. Devoted scholars searched diligently, reciting from baskets of texts from Hexi. They entrusted the task of collation to brush and ink, sealing the collection in vermilion silk. It was stored in the Hongdu archives, with a copy preserved in the Yan Pavilion.\n\n---\n\n**Seeking the Mountains: Written at Fifteen**\n\nWeary of how easily worldly passions sway, I took up my staff to seek the mountains. Following hidden paths to reach the peaks, I endured hardships and overcame obstacles. My wandering heart was not yet sated when evening fell at the roots of the clouds. Joyful to find one who attains his will, I forgot my form; having forgotten my form, my spirit abided.\n\nThereupon, I loosened my hair and untied my sash, circling the heights. My mind was vast, my gaze unburdened; my qi flowed freely, my spirit at ease. Though the mysterious is distant, it surely exists. No burden is too great to forget. The harm of the \"wounded horse\" dispelled, the blade of the \"butcher\" reigned supreme. The feelings of things and self, though equal, depend on self-cultivation—this is what I esteem.\n\nAs for those who seek fame on Western Marchmount or chase profit in Shuling, who prize the purity of Chu and Xiang or the pride of Wu and Jiang—who scorn death and value qi, holding name above life—such men stray from truth and obscure the Dao. I cannot approve. Those who don robes and wide sleeves, don caps and formal attire, who linger in courts and halls, strut through palaces and chambers—who serve a hundred kings of the Fu clan, leaving fragrant legacies—though they bear virtue and receive honor, I dare not commend them.\n\nThus, I shut the gates of Jingmen by day and open the thatched door by night. My chamber is overgrown with summer grasses; my path obscured by spring moss. The courtyard is empty, bathed in moonlight; the zither’s notes mingle with the wind’s lament. Evening crows nest under the eaves; twilight beasts vie to approach. At times, I wander near graves or seek distant valleys. Sitting upon flat stones, I gaze over the plains. The sun bears the mantis in shared seclusion; the moon parts the clouds to emerge from the mountains. The wind descends through pines, carrying melodies; springs cascade over rocks, forming patterns. Grasses sway, brushing dew; deer gather in rustling herds. I grasp trailing vines to enter the valley, skirting vast marshes to compare purity. The stone cliffs reflect true hues; I climb osmanthus branches to match their steadfastness. I gather orchids and wear sweet basil, awaiting the spring warbler’s first song. I harbor my thoughts in darkness, waiting for the kind breeze to unfold my emotions.\n\nThen, yielding to my mood, I set forth, following the rocky path to wander afar. My thoughts drift with the pillars of heaven; faint joy arises, yet I seek nothing. Gazing at the winding river’s expanse, I am dazzled by the overlapping peaks. The sun slants through clouds, darkening their hue; the wind passes over water, leaving it serene. It brushes jagged cliffs, stirring whirlpools; where it meets open space, islands form. A lone stone soars, peerless; the bank hangs suspended, as if floating in the sky. Halfway through the green path, my soul wanders, carefree. I grasp the principles of Bohun’s sheer cliffs, ascending a thousand fathoms to rest my spirit.\n\nThereupon, I reach the sheer cliffs and arrive at Pine Gate. Behind lies the open forest; before me, the long source. To the right, mountains stretch endlessly; to the left, the sea rises to meet the heavens. Bamboos drip dew in orderly rows; willows sway gently, welcoming cicadas. Gulls fly in pairs to the water; egrets soar gracefully to the fields. They glide upon the waves, they wheel above the fields—this freedom and joy! Yet I lament that life is not long. I mourn the fleeting span of mushrooms, envy the enduring pine. Though the roc and the quail are different species, they each find their place in carefree wandering. I wish to spread my mat and pour out my grievances, to compose verses at dawn beneath the pines. Arriving at Red City, I rest awhile, meeting the Prince of the Waters to lodge for the night. Gazing up at Peng Juan, I know he is not far—surely long life may yet be attained.\n\nBefore the elm’s light fades, I will seek the mountains to gather lingzhi. I depart to gather lingzhi, entering the deep ravine; I explore its depths, where the path is secluded and winding. The winding path never brightens; the deep ravine never dawns. High pines halt the drifting clouds; low vines repeatedly confuse the crows. The crows, lost in the vines, flutter in disarray; the clouds, stilled upon the pines, threaten to scatter. The drifting clouds wander—where will they settle? The parted crows seek their flock. Alas, where is their flock? Where can they rest? My thoughts drift, unheard; my gaze is exhausted, yet no barrier remains.\n\n---\n\nAfter the Master’s passing, no one compiled his works. In the second year of Zhenming under Emperor Wu of Chen, the imperial decree appointed Minister Jiang Zong to assemble the collection. The Master had departed in the second year of Datong under the Liang; by then, fifty-three years had passed. Many writings had been scattered and lost.\n\nI asked a fisherman about the way ahead, and he pointed me toward Penglai, saying: \"If you truly possess the resolve to seek the mountains, I will lodge you in the Terrace of Immortal Summoning. Approach the Ying waters to unburden your heart, for myriad feelings will surely converge. Though a thousand thoughts may align, none can know where they ascend. Returning to formlessness in stillness, forever transcending the dust of the world.\"\n\n---\n\n**Rhapsody on the Water Immortal**\n\nVast and boundless, the eight seas surge; drifting and still, the nine rivers flow. Waves rise at the center of heaven; waters pour, dividing the earth. They coil around the sun’s cavern at Chang Sang, and to the west, they turn the dragon’s spade at the moon’s curve.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1240,
      "start_sentence": 0,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.01740336418152,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "乃者，潼关不壅，石门已开。 导江出汉，浮济达淮。 漳渠水府，包山洞台。 娥英之所游往，琴冯是焉去来。 或穷发逸鹏，咸池浴日。 随云濯金浆之汾，追霞采建木之实。 弄珠於渊客之庭，卷销乎绞人之室。 此真厦矣。 至於碧岩无雾，绿水不风。 飞轩蚓凤，游耕驾鸿。 上朝紫殿，还觐青宫。 进麾八老，顾拂四童。 批洞阴之磬，张玄圃之傲。 酌丹穴之酣，荐麟洲之肴。 安期奉枣，王母送桃。 锦旌丽日，羽衣拂霄。 又其英矣。 及秋水方至，层涛架山。 各巡封噢，来查王言。 选奇於河侯之府，出宝於骊龙之川。 夜光烛月，洪贝充辕。 亦其瓖矣。 若夫层城瑶馆，缙云琼阁，黄帝所以觞百神池。 涂山石帐，天后翠幕，夏禹所以集群臣也。 岷蟠交错，上贯井络，穹汉碉缯，、横带玉绳。 浸汤泉於桂渚，涌沸壑於金陵。 崩沙转石，惊湍走沫。 绝壁飞流，万丈悬濑。 奔激芒旸之问，驰骛壶口之外。 逮乎游纲运极，九六数翻。 用谋西汉，受事龙门。 少周姒后，初会妈前。 平阴巨鹿，再化为渊； 清河渤海，三成桑田。 抚二仪以恻怆，一辰万兆以流涟。 余自安於蟾晷，缅无羡於鹄年。 皆松下之一物，又奚足以语仙。 嗟乎，循有生之造物，固莫灵於在人。 宁不踵武於象帝，入妙门而自宾。 苟沦形於无晓，与蝼蚁而为尘。 亦有先觉之秀，独往之英。 窥若士於蒙谷，求吕梁於石城。 从务光於砥柱，索龙威於洞庭。 迎九玄於金阙，谒三素於玉清。 更天地而弥固，终逍遥以长生。 华阳颂 枢域",
      "translated_text": "Thus it was: Tong Pass stood unblocked, Stone Gate lay open. The Yangtze was guided forth from the Han, the Ji floated into the Huai. The Zhang Canal’s water palace embraced the terraces of mountains and isles—where the radiant sisters E and Ying once wandered, where Qin Gao came and went with his zither. Some soared to the ends of the earth as roving roc, bathing the sun in Xianchi’s pool; others followed clouds to rinse in the golden nectar of the Fen, or chased the rosy dawn to pluck the fruit of the Jianmu Tree. They played with pearls in the courtyard of the Deep-Dweller, or rolled up their mirrors in the chamber of the Silk-Twister. This was true splendor.\n\nYet more wondrous still: where jade cliffs stood free of mist and emerald waters stirred not a ripple, flying carriages bore winged serpents and soaring phoenixes, while wandering plowsmen rode swans. They ascended to court in the Purple Palace, then returned to pay homage in the Azure Mansion. They advanced to wave banners before the Eight Elders, or turned to brush the robes of the Four Lads. They struck the sounding stone in the Cavern of Shade, or unfurled their pride in the Dark Garden. They poured the intoxicating wine of the Cinnabar Cave, or offered delicacies from the Qilin Isle. Master Anqi presented jujubes, the Queen Mother of the West proffered peaches. Brocade banners blazed in the sunlight, feathered robes brushed the clouds.\n\nAnd when autumn waters rose to their height, towering waves crested like mountains, each patrolling its own domain, heeding the royal decree. They chose marvels from the treasury of the River Lord, drew treasures from the Black Dragon’s river. Night-glowing pearls lit the moon, great cowries filled the chariot shafts. This was true magnificence.\n\nConsider then the layered towers of Jasper Mansion and the cloud-woven pavilions of Jade Terrace—where the Yellow Emperor once feasted the hundred spirits. Or the stone canopy of Mount Tu and the emerald curtains of the Heavenly Empress—where Yu the Great gathered his ministers. The Min Mountains coiled in intricate embrace, threading upward through the Well and Net constellations, their peaks draped in celestial brocade, girdled by the Jade Cord. They steeped scalding springs in the Cassia Isle, or churned boiling torrents in the Golden Mound. Sands collapsed, stones tumbled, swift rapids raced in foam. Sheer cliffs sent cascades flying, ten thousand fathoms of suspended torrents. They surged through the gates of Dawn’s Radiance, galloped beyond the Gourd’s Mouth.\n\nYet when the turning of the cosmic net reached its limit, when the nine and six cycles reversed, the Western Han devised its strategies, the Dragon Gate received its mandate. The Zhou of old met the Xia in their final union, the first gathering before the altar of Ma. The vast plains of Pingyin and Julu transformed twice into abysses; the clear waters of the Qing River and Bohai thrice became mulberry fields. Grasping the two poles of heaven and earth, one could only sigh in sorrow—one morning, a myriad ages flowed past in tears.\n\nI have found peace in the toad’s shadow, no longer envying the crane’s years. All are but creatures beneath the pines—how could they compare to the immortals? Alas! Among all living things shaped by creation, none are more numinous than humankind. Why not follow in the footsteps of the Divine Sovereign, enter the wondrous gate as a guest of the Dao? To sink one’s form into endless night, to become dust with ants and mole-crickets—this is folly. Yet there are those of keen insight, heroes who walk alone: they seek the scholar of Meng Valley in his hidden vale, or pursue the currents of Lü Liang in the Stone City. They follow Wu Guang to the Pillar of Grinding Stone, or search for Long Wei in Dongting. They welcome the Nine Transcendents at the Golden Portal, or pay homage to the Three Pure Ones in the Jade Clarity. They renew heaven and earth to make them everlasting, and in the end, wander carefree in eternal life.\n\n*Hymn of Huayang: The Pivot of the Realm*",
      "overlap_context": "ad feelings will surely converge. Though a thousand thoughts may align, none can know where they ascend. Returning to formlessness in stillness, forever transcending the dust of the world.\"\n\n---\n\n**Rhapsody on the Water Immortal**\n\nVast and boundless, the eight seas surge; drifting and still, the nine rivers flow. Waves rise at the center of heaven; waters pour, dividing the earth. They coil around the sun’s cavern at Chang Sang, and to the west, they turn the dragon’s spade at the moon’s curve.",
      "start_char": 1240,
      "end_char": 1808,
      "start_sentence": 95,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.411600828170776,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "河篇征往册，孔记昭昔名。 丽天序，两金标地英。 质象 宅无乃．生有，在有则还空。 不待匠，虚形自成功。 形位 总神列三府，分除交五便。 迎夜哲，晨精望晓悬。 标贯 南峰秀玄鼎，北岭横秦壁。 表裹玉沙津，周回隐轮迹。 区别 左带柳决水，右浚阳谷川。 土怀北郁色，井洌凤门泉。 边号 郭干诗留岸，姜巴亘远踪，鹤庙或闻响，别宅乃恒恭。 类附 昊居非知地，越家诅隐迁。 树盖徒低荫，石鳌未尝烟。 物轨 果林郁余奈，蔬圃蔓遗辛。 荧芝可烛夜，田泉常渐尘。 游集 降辔龟山客，解驾青华童。 寝宴舍真馆，高会萧闲宫。 才英 清歌翔羽集，长啸归云翻。 子弦有逸调，空谈无与言。 学禀 标舍雷平下，立静连石阴。 上道已冲念，飞华当翰心。 业运 济神既有在，去留从所宜。 何用显，冥途自相知。 挺契 方隅游琼刃，华阳栖隐居。 傥或似，七元乃扶胥。 机萌 号期行当满，亥数未终丁。 唐承世，将宾来圣庭。 诚期 刊石玄窗上，显诚曲阶门。 顾矜录，不负保举恩。 授陆敬游十责文 隐居先生，遣总事弟子戴坦，乘策执简，膝授前学弟子昊郡陆敬游，建连石之邑，为栖静处士。 策文曰： 咨尔敬游，昔我纡绂帝闱，侍质梁席。",
      "translated_text": "The *Yellow River Scroll* bears witness to past records, while the *Annals of Confucius* illuminate ancient names. The celestial order shines resplendent, and the twin golden standards mark the earth’s heroes.\n\nIn essence, form and image dwell in the boundless—life arises from being, yet in being, it returns to emptiness. No craftsman is needed, for the hollow form achieves perfection on its own.\n\nThe bodily stations gather the spirits within the Three Palaces, dividing and harmonizing the Five Conveniences. They greet the wise of night and gaze at the morning essence suspended in dawn’s glow.\n\nA standard pierces the southern peak, where the Mystic Tripod stands tall; the northern ridge stretches like Qin’s unbroken wall. Within and without, the Jade Sand Ford encircles hidden wheel-tracks. Distinctions are drawn:\n\nTo the left, the waters of Willow’s Judgment flow; to the right, the Yang Valley’s streams run deep. The earth cradles the somber hues of the north, while the well’s pure waters gush from Phoenix Gate Spring.\n\nAt the borders, Guo Gan’s poems linger on the banks, and Jiang Ba’s distant traces span the land. At the Crane Temple, echoes may sometimes be heard; in the separate abode, reverence is ever maintained.\n\nCategories align: the dwellings of the heavens are not known to mortals, and the Yue clans do not conceal their migrations. Tree canopies cast fleeting shade, while the stone turtle has never known smoke.\n\nThe fruit groves flourish with lingering crabapples, and the vegetable gardens trail with forgotten mustard greens. Glowing mushrooms may light the night, while field springs ever moisten the dust.\n\nVisitors descend their reins at Tortoise Mountain, and the Azure Radiance Youths unhitch their chariots. They repose in the Lodge of the True, or gather in the Palace of Leisurely Ease.\n\nThe talented and wise take flight, their feathered companions alighting; long whistles summon returning clouds. The zither’s strings play untethered melodies, and empty discourse finds no one to engage.\n\nScholarship is endowed: dwellings stand beneath the level thunder, and stillness abides in the shade of stone. The Way is already embraced with serene intent, and soaring blossoms fill the heart’s flight.\n\nThe work of destiny: the spirit’s crossing is assured, and departure or stay follows what is fitting. What need is there for display? The hidden path knows its own.\n\nThose who forge bonds roam the jeweled blade’s edge, or dwell in seclusion at Huayang. Should it chance to resemble the Seven Origins, they will be upheld.\n\nThe appointed time nears its fulfillment, and the cycle of *hai* has not yet reached its *ding*. Inheriting the Tang’s legacy, they shall attend the sacred court as guests.\n\nThe pledge is carved upon the dark window, and sincerity is revealed at the winding steps’ gate. One looks back with care, lest the grace of recommendation be betrayed.\n\n*Ten Responsibilities of the Hidden Retreat*\nThe Master of the Hidden Retreat, entrusting the general affairs to his disciple Dai Tan, mounts his steed and takes up the tablet to confer upon his former disciple, Lu Jingyou of Wu Commandery, the governance of Lian Stone Village as a dwelling for the reclusive scholar.\n\nThe *Admonitory Text* states:\n\"Oh, you, Jingyou—once I loosed the imperial sash at the palace gates and attended the mat of the questioning hall...\"",
      "overlap_context": " keen insight, heroes who walk alone: they seek the scholar of Meng Valley in his hidden vale, or pursue the currents of Lü Liang in the Stone City. They follow Wu Guang to the Pillar of Grinding Stone, or search for Long Wei in Dongting. They welcome the Nine Transcendents at the Golden Portal, or pay homage to the Three Pure Ones in the Jade Clarity. They renew heaven and earth to make them everlasting, and in the end, wander carefree in eternal life.\n\n*Hymn of Huayang: The Pivot of the Realm*",
      "start_char": 1808,
      "end_char": 2348,
      "start_sentence": 142,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.382577419281006,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "虽边混教涂，而心标逸境。 芝田之想，无忘晓夜。 濠颖之志，岁月以深。 至德有邻，云风相会。 尔之来矣，爰移两春。 於是褫带青墀，挂冠朱阙携手束驱，创居兹岭。 脉润通水，徙石开基。 登崖断干，越垄负卉。 筋力尽於登筑，黑血疲乎趋走。 肌色憔悴，不以暴露为苦。 心魂空嫌，宁顾饥寒之弊。 楝宇既立，载离霜暑。 于时七稔，经始甫讫。 今日之安，尔有勤焉。 君子不独居其荣，仁人必与物同泰。 是用邑尔，长阿北阪。 积金山连石之乡，方七十步涧水属焉。 茂尔嘉业。 永为华阳上宾。 尔其莅之。 右一",
      "translated_text": "Though the world’s paths blur with dust, your heart marks a realm of transcendence. The vision of the Mushroom Fields lingers, unbroken through dawn and dusk. The aspiration of the Hao and Ying rivers deepens with the passing years. Supreme virtue draws neighbors near, as clouds and winds converge in meeting.\n\nSince your arrival, two springs have turned. Then, you doffed your sash at the azure steps and hung your cap at the vermilion gate; hand in hand, we hastened to establish a dwelling upon this ridge. Channels were carved to guide the waters, and stones were shifted to lay the foundation. You scaled cliffs to fell timber, crossed ridges to gather herbs. Your sinews were spent in climbing and building, your dark blood exhausted in haste and labor. Your flesh withered, yet you did not deem exposure a hardship; your spirit stood hollow, yet you heeded not hunger or cold. When the thatched hut stood complete, you endured frost and heat alike. For seven years, the work began and now reaches its end. Today’s peace is your labor’s fruit.\n\nThe noble man does not dwell alone in glory; the humane must share prosperity with all things. Thus, I grant you this village—everlasting Albei Slope. Here, the land of Mount Jin and Lian Stone spans seventy paces, with the ravine’s waters adjoining. May your fine deeds flourish. Forever be a guest of honor in Huayang.\n\nTo this, govern well.\n*(First of the Ten Responsibilities)*",
      "overlap_context": "of recommendation be betrayed.\n\n*Ten Responsibilities of the Hidden Retreat*\nThe Master of the Hidden Retreat, entrusting the general affairs to his disciple Dai Tan, mounts his steed and takes up the tablet to confer upon his former disciple, Lu Jingyou of Wu Commandery, the governance of Lian Stone Village as a dwelling for the reclusive scholar.\n\nThe *Admonitory Text* states:\n\"Oh, you, Jingyou—once I loosed the imperial sash at the palace gates and attended the mat of the questioning hall...\"",
      "start_char": 2348,
      "end_char": 2572,
      "start_sentence": 189,
      "end_sentence": 209,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.052929162979126,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "尔，以专殷为性，恬淡为情。 质直居本，沉重树志。 不邀世才，高谢接俗。 权谋诡谲，非意所欲。 今故责尔，为栖静处士。 可谓因德立号，克终斯美。 右二 尔，基架馆境营获授域。 堂坛宏敞，栖路通严。 官私行止，并有栖憩。 缮筑之劳，莫匪尔力。 今故责尔，四雷飞轩，厢廊侧屋。 可以安身静外，显只遐福。 右三 尔，奉上惟勤，接下以惠。 稼穑艰难，备尝劳苦。 货植之宜，允瞻粮服。 手足胼胝，未获告休。 栉沐风雨，於焉犹切。 今故责尔，苍头一人，厥名多一益？ 可以传代薪水，省息劬剧。 右四 尔，族惟旧绪，身秉邦闻。 道虽一贯，事望宜分。 今故责尔，铜铁如意。 可以麾对宾僚，即名立事。 右五 尔，崇教惟善，法无偏执。 器服表用，爰寄玩习。 今故责尔，竿竹锡杖。 可以振动三界，精祇惮响。 右六 尔，期诚玄契，遐想灵风。 致怀所指，因心则通。 今故责尔，香炉二枚，熏陆副之。 可以腾烟紫阁，招感上司。 右七 尔，澡形洁藏，肴粮既去。 宣道松木，实资芳醋。 今故查尔，杯盘一具。 可以夕抱桂浆，朝承菊露。 右八 尔，敬事经诰，遵尚模楷。 翰墨之用，於是乎在。 今故责尔，大砚一面，纸笔副之。 可以临文写字，对真受言。 右九 尔，真心内固，清行外彰。 涤荡纷秽，表裹雪霜。 今故查尔，蝓石澡灌，手巾自副。 可以登斋朝拜，出入盥漱。 右十 今责尔十事，事准前史。 可对扬嘉策，循言来理。 无或骄惰，以骞斯旨。 援笔申怀，敢告处士。 诏问山中何所有赋诗以答 山中何所有，岭上多白云。 只可自怡悦，不堪持寄君。 题所居壁 夷甫任散诞，平叔坐谈空。 不言昭阳殿，忽作单于宫。 寒夜愁 夜云生，夜鸿惊，凄切嘹唳伤夜情，空山霜满高烟平。 铅华沉照帐，孤明寒月微。 寒风紧，愁心绝，愁泪尽人情。 不胜怨，思来谁能忍。 胡茄篇 自戾飞天历，与夺徒纷纭。 百年四五代，终是甲辰君。 上梁武帝论书敌 奉旨左右中书复稍有能者，唯周喜赞夫，以含心之爹实，俟夹锺吐气。 今既自上体妙为，下理用成。 工，每惟申锺、王一论於天下，进艺方兴。 所恨臣沈朽，不能钻仰高深，自怀叹慕。 前 奉神笔三纸，并今为五。 非但字字注目 ，乃画画抽心。 日觉劲媚，转不可。 以酬昔岁，不复相类。 正此即为、，何复多寻锺王。 臣心本自，敬重今。 弥增爱服，俯仰悦豫，不能不以启。 复蒙给二卷，伏览标帖，皆如圣旨适者楷说。 既不显垂，允少留，不能久停。 已就摹索者一段，未毕，不赴今信。 纸卷先已经有，兼多他杂，无所复取。 亦请俟俱，了日奉送。 兼此诸书，是篇章体。 臣今不辩，复得修习。 唯愿细书，如乐毅论、太师箴例，依仿以写经，传永存冥，题中精要而已。 梁武帝答书 近二卷欲少留，差不为异．纸卷，是出装书，既须见前，所以付耳。 无正可取，备於此，及欲更须细书。 如论箴例，逸少迩无甚极细书，乐毅论乃微厅健，恐非真迹。 太师箴小复方媚，笔力过嫩，书体乖异。 二者已经至鉴，其外便无可付也。 上梁武帝败",
      "translated_text": "You, whose nature is devoted and sincere, whose disposition is serene and indifferent. Uprightness is your foundation, steadfastness your resolve. You seek not worldly talent, nor do you lower yourself to common company. Cunning schemes and deceitful plots are not what you desire.\n\nThus, I now charge you to be a Recluse of Tranquil Abode. This may be called establishing a title by virtue, perfectly fulfilling this excellence.\n*(Second of the Ten Responsibilities)*\n\nYou laid the foundations, framed the halls, and secured the boundaries. The main hall and altars are vast and open, the paths to the hermitage clear and solemn. For official and private travel alike, there are places to rest. In the labor of construction and repair, none was not your effort.\n\nThus, I now grant you Four Thunderbolt Flying Pavilions, with side galleries and flanking chambers. Here, you may dwell in peace and quietude, manifesting distant blessings.\n*(Third of the Ten Responsibilities)*\n\nYou serve your superiors with diligence and treat your subordinates with kindness. You have experienced the hardships of farming and the toils of labor. The proper cultivation of crops and the weaving of cloth have ensured ample provisions. Your hands and feet are calloused, yet you have not sought rest. You endure wind and rain, ever pressing on.\n\nThus, I now grant you a servant, named Duo Yiyi? Here, you may pass down the tasks of firewood and water, easing your toil.\n*(Fourth of the Ten Responsibilities)*\n\nYour clan upholds old traditions, and you yourself bear the state’s esteem. Though the Dao is one and unchanging, duties and expectations must be distinguished.\n\nThus, I now grant you an iron-and-copper *ruyi*. With it, you may command and respond to guests and officials, establishing your name in affairs.\n*(Fifth of the Ten Responsibilities)*\n\nYou revere teaching and goodness, adhering to the law without bias. Your vessels and robes serve their purpose, entrusted to practice and refinement.\n\nThus, I now grant you a bamboo staff tipped with tin. With it, you may shake the Three Realms, and the spirits will tremble at its sound.\n*(Sixth of the Ten Responsibilities)*\n\nYou aspire to profound sincerity, your distant thoughts attuned to the numinous wind. Where your heart directs, the mind follows and connects.\n\nThus, I now grant you two incense burners, accompanied by frankincense. With them, you may send purple smoke curling to the celestial halls, summoning the attention of the divine.\n*(Seventh of the Ten Responsibilities)*\n\nYou purify your form and keep your storehouse clean, having set aside rich foods. You proclaim the Dao with pine and cypress, relying on fragrant vinegar.\n\nThus, I now grant you a set of cups and plates. With them, you may hold osmanthus wine in the evening and receive chrysanthemum dew at dawn.\n*(Eighth of the Ten Responsibilities)*\n\nYou revere the classics and scriptures, following models and exemplars. The use of brush and ink lies herein.\n\nThus, I now grant you a large inkstone, with paper and brushes to accompany it. With them, you may compose texts, transcribe words, and receive truths face-to-face.\n*(Ninth of the Ten Responsibilities)*\n\nYour true heart is inwardly steadfast, your pure conduct outwardly manifest. You cleanse and sweep away defilement, your inner and outer bearing as pristine as snow and frost.\n\nThus, I now grant you a snail-shell washing basin, with a hand towel to accompany it. With them, you may enter the hall for morning rites and exit for ablutions.\n*(Tenth of the Ten Responsibilities)*\n\nNow, I grant you these ten things, each aligned with the precedents of history. You may respond with praise and follow these words to govern. Let there be no arrogance or indolence, lest you fall short of this intent.\n\nTaking up my brush to express my thoughts, I dare address you, Recluse.\n\n---\n\n**Edict Asking What the Mountains Hold**\n*Poem in Reply*\n\nWhat does the mountain hold?\nOn its ridges, many white clouds.\nThey bring joy only to oneself—\nNot fit to be plucked and sent to you.\n\n**Inscribed on the Wall of My Dwelling**\n\nYifu was carefree and unrestrained,\nPingshu sat and spoke of emptiness.\nNever mentioning the Zhaoyang Palace,\nSuddenly it became the Xiongnu’s court.\n\n**Sorrow on a Cold Night**\n\nNight clouds arise, night geese take fright.\nTheir mournful cries pierce the night’s sorrow.\nThe empty mountains fill with frost, high mist levels the plain.\nLead-white glow sinks beneath the bed-curtain,\nA lone light—cold moon faint.\nThe cold wind tightens, sorrowful heart breaks.\nTears of grief spent, yet feeling remains.\nWho can bear this resentment?\nThoughts arise—who could endure?\n\n**Ballad of the Hu Pipe**\n\nFrom self-willed flight through the heavens,\nTo the clamor of gain and loss—\nA hundred years, four or five dynasties,\nYet in the end, it is the Lord of Jiachen.\n\n**Emperor Wu of Liang’s Discourse on Calligraphy**\n\nBy imperial decree, the officials of the Central Secretariat were reviewed, and only Zhou Xizanfu was found capable. With a heart as deep as the *Hanxin*’s, he awaits the *Jiazhong* note to exhale his breath.\n\nNow, having mastered the subtleties of the upper form and perfected the principles of the lower, his skill is such that I have often compared Zhong [You] and Wang [Xizhi] to the world, advancing their art ever further. What grieves me is my own dullness, unable to fathom their heights, and I can only sigh in admiration.\n\nPreviously, I received three sheets of divine calligraphy, and now, with these, five in total. Not only does each character seize the eye, but every stroke pierces the heart. Day by day, their strength and grace grow, becoming ever more unmatched. To repay the past years, they are no longer of the same kind. This alone suffices—what need is there to seek further among Zhong and Wang?\n\nMy heart has always revered the present. My admiration and devotion deepen, my joy and delight overflow, and I cannot but share this.\n\nAgain, I was bestowed two scrolls. Upon examining the inscribed titles, all were as Your Majesty’s edict had described. Since they were not openly bestowed, I could only keep them briefly, unable to retain them long. I have already traced one section, but as it is unfinished, I did not send it with this message. The paper scrolls have been used before, and much else is mixed in, leaving nothing further to take. I also request to wait until all is complete before returning them.\n\nMoreover, these writings are in the style of literary pieces. I am now unskilled and must practice further. I only wish for fine calligraphy, like the *Yue Yi Lun* or *Tai Shi Zhen*, to be imitated in copying sutras, preserving the essentials for eternal transmission.\n\n**Emperor Wu of Liang’s Reply**\n\nThe two scrolls I wished to keep a little longer, but it makes no great difference. The paper scrolls are from a book’s binding, and since you needed to see the originals, I sent them. There is nothing particularly worth taking, but I have included them here, and I will need finer calligraphy later.\n\nAs for examples like the *Lun* and *Zhen*, Wang Xizhi’s recent works are not extremely fine, and the *Yue Yi Lun* is somewhat robust and vigorous—perhaps not a true trace. The *Tai Shi Zhen* is slightly more refined and charming, but the brushwork is too delicate, and the style deviates. Both have already been examined by Your Majesty, and beyond these, there is nothing else to send.",
      "overlap_context": "d frost and heat alike. For seven years, the work began and now reaches its end. Today’s peace is your labor’s fruit.\n\nThe noble man does not dwell alone in glory; the humane must share prosperity with all things. Thus, I grant you this village—everlasting Albei Slope. Here, the land of Mount Jin and Lian Stone spans seventy paces, with the ravine’s waters adjoining. May your fine deeds flourish. Forever be a guest of honor in Huayang.\n\nTo this, govern well.\n*(First of the Ten Responsibilities)*",
      "start_char": 2572,
      "end_char": 3767,
      "start_sentence": 210,
      "end_sentence": 307,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.85689067840576,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "《乐毅论》愚心近甚疑是摹，而不敢轻言，今旨以为非真，窃自信颇涉有悟。 箴吟：赞过为沦弱，许静素段，遂蒙永给，仰铭矜奖，益无以喻。 如此书虽不在法例。 而致用理均。 背问细楷，兼复两骯。 先於都遇得飞白一卷，云是逸少好迹。 臣不尝别见，无以能辩，唯觉势力惊绝，谨以上呈。 於臣非用，脱可充阁，愿仍以奉上。 臣昔於马澄处见逸少正书目录一卷，澄云：右军劝进洛神赋诸书十余首，皆作今体，唯急就篇二卷古法，紧细近脱。 忆此语当是零落，已不复存。 澄又云：帖注出装者，皆拟责诸王及朝士。 臣近见三卷首帖，亦谓已久分。 本不敢议此正复，希於三卷中一两条，更得预出装之例耳。 天旨遂复，顿给先卷，下情益用悚息。 近初见卷题云二十三四，已欣其多，今者赐书第至二百七十，惋讶无已。 天府如海，非一瓶所汲，量用息心，前后都已蒙见，大小五卷於野拙之分，实以过幸。 若非殊恩，岂可鴂望。 愚固本博涉，而不能精。 昔患无书可看，乃愿作主书史。 晚爱隶法，又羡典掌之人。 尝言人生数纪之内，识解不能周流。 天壤区区，唯．充恣五欲。 实可耿愧。 每以为得作才鬼，亦当腔於顽仙，至今犹然。 始欲翻之自，无射以后。 国政方殷，山心歉默，不敢复以虚闲尘触，谨於此题事故，遂成烦黩。 伏愿圣慈，照录诚嫌。 梁武帝答陶隐居谕书 又省别疏云，故当宜微以着赏，此既胜事，虽风训非嫌，云云。 然非所习，聊试略言。 夫运笔邪则无芒角，执手宽则书缓弱。 点擎短则法拥肿，点擎长则法离撕。 画促则字横，画疏则形慢。 拘则乏势，放又少则。 纯骨无媚，纯肉无力。 少黑浮涩，多墨笨钝。 比并皆然，任之所之，自然之理也。 若抑扬得所，趣舍无违，值笔连断，触势峰郁，扬波折节，中规合矩，分问下注，浓纤有方，肥瘦相和，骨力相称。 婉婉暧暧，视之不足，棱棱凛凛，常有生气，适眼合心，便为甲科。 众家可识，亦当复贯串耳。 六文可工，亦当复由习耳。",
      "translated_text": "As for the *Yue Yi Lun*, my own heart has long suspected it to be a tracing, yet I dared not speak lightly of it. Now that Your Majesty’s decree confirms it is not genuine, I privately trust that my discernment has not been far off.\n\nRegarding the *Zhen* and *Yin*: praise that exceeds is as weak as drowning, yet your quiet and pure grace has granted me eternal provision. I am deeply moved by your compassion and reward, beyond words to express. Though this writing does not follow the standard examples, its practical use and principle are the same.\n\nYou have inquired about fine regular script, and I have prepared two additional scrolls. Earlier, in the capital, I obtained a scroll of *feibai* calligraphy, said to be one of Wang Xizhi’s finest works. I have never seen another to compare, so I cannot verify it, but its vigor and force are astonishing. I humbly present it here. Though it may not serve your purpose, if it might fill a gap in your collection, I would be honored to offer it to Your Majesty.\n\nIn the past, I saw a catalog of Wang Xizhi’s standard script at Ma Cheng’s residence. Ma said that among Wang’s works—such as his calligraphy for the *Luoshen Fu* and over ten other pieces—all were in the modern style, except for two scrolls of the *Jijiu Pian*, which retained the ancient method, tight and fine yet nearly unrestrained. I recall his words, but those works are now scattered and no longer extant. Ma also said that the notes and colophons attached to scrolls were all imitations meant for reprimanding the various princes and court officials.\n\nRecently, I saw the first three scrolls of a set of letters, which I believe have long been separated. I dared not presume to discuss their authenticity, but I hoped that among these three scrolls, one or two might follow the example of attached colophons. Your Majesty’s decree then unexpectedly granted me the first scroll, and my heart trembles with awe. When I first saw the scroll’s title, which mentioned twenty-three or twenty-four, I rejoiced at its abundance. Now, your gift has reached two hundred and seventy—my astonishment knows no end.\n\nThe imperial treasury is vast as the sea, not to be drawn from with a single bottle. Measuring my own use, I have already received more than enough, both before and after. These five scrolls, great and small, far exceed the humble station of one such as I. Without your extraordinary grace, how could I have dared to hope for such favor?\n\nBy nature, I have always been broadly learned but never precise. Once, troubled by the lack of books to read, I wished to become a scribe. Later, enamored with clerical script, I envied those who held office as keepers of records. I have often said that within the span of a human life, one’s understanding cannot encompass all things. The world is vast, yet men are confined to indulging their five desires—truly, this is a cause for shame and regret. Even if I were to become a ghost of talent, I would still be but a dull immortal. This remains true to this day.\n\nAt first, I intended to turn inward after the *Wuyi* year, but with state affairs so pressing and my heart heavy with silence, I dared not trouble you further with idle matters. Yet in addressing these affairs, I have already become burdensome and presumptuous. I humbly pray that Your Majesty’s sagely compassion will overlook my faults.\n\n---\n\nI have also reviewed your separate letter, which states that such matters should be subtly appreciated. Since this is a worthy endeavor, though it lies outside my usual practice, I venture to offer a few rough observations.\n\nWhen the brush is held slanting, the strokes lack sharpness; when the grip is too loose, the writing becomes weak. Short dots and lifts make the characters swollen, while long ones cause them to drift apart. Hasty strokes make the characters wide; sparse strokes make them sluggish. Constraint lacks vigor, while abandon lacks restraint. Pure bone lacks charm; pure flesh lacks strength. Too little ink makes the writing float and rough; too much makes it clumsy and dull. All these are common faults, and where the brush naturally leads, so follows the principle of nature.\n\nIf the brush’s rise and fall are well-placed, its movements unobstructed, the strokes connected yet distinct, the momentum like a towering peak, the waves and turns measured by the compass and square, the thickness and thinness balanced, the plump and lean harmonized, the bone and force well-matched—then the writing will be graceful and warm, pleasing to the eye, yet sharp and imposing, full of vitality. When it delights both sight and mind, it may be counted among the finest. Though one may recognize the styles of many masters, one must still master their connections.\n\nEven if the Six Scripts are skillfully executed, mastery still comes only through practice.",
      "overlap_context": "re is nothing particularly worth taking, but I have included them here, and I will need finer calligraphy later.\n\nAs for examples like the *Lun* and *Zhen*, Wang Xizhi’s recent works are not extremely fine, and the *Yue Yi Lun* is somewhat robust and vigorous—perhaps not a true trace. The *Tai Shi Zhen* is slightly more refined and charming, but the brushwork is too delicate, and the style deviates. Both have already been examined by Your Majesty, and beyond these, there is nothing else to send.",
      "start_char": 3767,
      "end_char": 4524,
      "start_sentence": 308,
      "end_sentence": 348,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.13837218284607,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "一闻能持，一见能记。 且古且今，不无其人，大抵为论，终归是习。 程邈所以能变书，体为之旧也。 张芝所以能善书，工学之积也。 既旧既积，方可以肆其谈。 吾少来乃至不尝尽甲子，无论於篇纸，老而言之，亦复何谓，正足见嗤於当今，贻笑於后代。 遂有独冠之言，览之，背热隐真，於是乎累真矣。 此直一艺之工，非吾所谓胜事。 此道心之尘，非吾所谓无欲也。 又上梁武帝论书致 一一卷中有杂边，谨疏注如别，恐未允愚衷，并窃所摹者，亦以上呈。 近十余日，精虑悚悸，无宁涉事。 遂至淹替，不宜复待，填毕余条并非用，唯叔夜威辈二篇，是经书体式追以单郭为恨。 伏按卷上第数，甚为不少。 前旨唯有四卷，此似是宋元嘉中撰集，当由自后多致散失。 逸少有名之迩，不过数首，黄庭劝进，像赞洛神此等，不审犹有存否。 第二十三卷，今见有＋二条在别纸。 按此卷是右军书者，唯有八条。 前乐毅论书，乃极劲利，而非甚用意，故颇有坏字。 太师箴，大雅吟，用意甚至，而更成小拘束。 乃是书扇题屏风好体。 其余五片，无的可称。 臣涛言一纸，此书乃不恶，而非右军，又不识谁边，又似是摹。 给事黄门二纸，治廉沥一纸。 是子敬书，亦似摹迹后又治疟狸骨方一纸。 是子敬书，亦是摹迹。 右四件非右军书 第二十四卷。 今见有二十一条在。 按此卷是右军书者，唯有十一条。 并非甚合迩，兼多漫抹於摹起，难复委曲。 前黄初三年一纸。 是后人学右军缪袭告墓文一纸。 是许先生书。 抱怀忧痛一纸。 是张澄书。 五月十一日一纸。 是摹王环书被涵。 尚想黄绮一纸，遂结滞一纸。 凡二篇并后人所学，甚拙恶。 不复展一纸。 是子敬书。",
      "translated_text": "One may hold fast upon a single hearing, or recall upon a single glance. From ancient times to the present, such persons are not without precedent. Yet in the final analysis, all mastery comes down to practice. Cheng Miao could transform script because the forms had grown old; Zhang Zhi could excel in calligraphy because of accumulated skill in study. Only when the old is thoroughly known and the accumulation complete may one freely discourse.\n\nIn my youth, I never once completed a full cycle of sixty years, nor did I exhaust the reams of paper—yet now in old age, what more can be said? It would only invite ridicule from contemporaries and derision from later generations. Thus, I have made bold to speak with unrivaled confidence. Upon reading such claims, one’s back grows hot and the true self is obscured—here, the true is indeed burdened. This is merely mastery of a single art, not what I deem a triumphant endeavor. It is but dust upon the heart’s Dao, not what I call desirelessness.\n\nMoreover, in the *Treatise on Calligraphy* presented to Emperor Wu of Liang, there is a miscellaneous section in the first volume. I have carefully annotated and appended it separately, though I fear it may not fully accord with my humble intent. Along with my own copies, I submit them together for consideration. For over ten days now, my thoughts have been fraught with apprehension, leaving no peace in any matter. The delay has grown prolonged, and further postponement is unwarranted. The remaining entries are of no use, save for two pieces by Ji Kang and his peers, which follow the structural conventions of classical texts—though I regret they are not as refined as Guo Pu’s works.\n\nUpon reviewing the volume’s contents, the number of entries is not insignificant. The original directive mentioned only four volumes, but this appears to be a compilation from the Yuanjia era of the Liu-Song, with many later additions and losses. Of Wang Xizhi’s renowned works, only a few survive—*Huangting Jing*, *Exhortation to Ascend the Throne*, *Portrait Eulogies*, and *The Goddess of the Luo River*—I am uncertain whether any others remain.\n\nThe twenty-third volume now contains twelve entries on separate sheets. Of these, only eight are attributed to Wang Xizhi. The *Yue Yi Lun* in cursive script is exceedingly vigorous and sharp, though not overly deliberate, hence some characters are flawed. The *Grand Preceptor’s Admonition* and *Ode to the Great Elegance* are meticulously composed, yet somewhat constrained. These are fine examples of fan inscriptions and screen calligraphy. The remaining five pieces offer little of note. Minister Tao’s single sheet is not bad, though it is not Wang Xizhi’s work, nor is its author known—it appears to be a tracing. The two sheets by the Gentleman of the Yellow Gate and the single sheet of *Zhi Lian Li* are by Wang Xianzhi, also likely tracings. The *Prescription for Treating Malaria with Foxglove Root* is likewise by Wang Xianzhi, another tracing.\n\nThe four items above are not Wang Xizhi’s works.\n\nThe twenty-fourth volume now contains twenty-one entries. Of these, only eleven are attributed to Wang Xizhi. None are particularly close to his style, and many are careless tracings, making further detailed assessment difficult. The first sheet, dated the third year of Huangchu, is a later imitation of Wang Xizhi’s work. The *Miao Xi Epitaph* is by Master Xu. The *Embracing Sorrow and Grief* is by Zhang Cheng. The sheet dated the eleventh day of the fifth month is a tracing of Wang Huan’s *Letter of Reprimand*. The *Longing for the Recluses of Huang and Qi* and the *Entangled Thoughts* are both later imitations, clumsy and crude. One sheet remains unexamined—it is by Wang Xianzhi.",
      "overlap_context": "sured by the compass and square, the thickness and thinness balanced, the plump and lean harmonized, the bone and force well-matched—then the writing will be graceful and warm, pleasing to the eye, yet sharp and imposing, full of vitality. When it delights both sight and mind, it may be counted among the finest. Though one may recognize the styles of many masters, one must still master their connections.\n\nEven if the Six Scripts are skillfully executed, mastery still comes only through practice.",
      "start_char": 4524,
      "end_char": 5173,
      "start_sentence": 349,
      "end_sentence": 390,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.163004159927368,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "便复改月」纸。 是张翼书。 五月十五日县白一纸。 亦是王泯书。 治饮方一纸。 是谢安书。 右一十条非右军书伏恐未垂，许以区别。 今谨上许先生书，任静书。 如别比方，即可知王泯、张澄、谢安、张翼书，公家应用。 梁武帝答隐居书 省区别诸书，良有精赏，所异同所可，未知悉可否耳。 给事黄门二纸，为任静书，观所送静书诸字相附。 近二纸静书体解杂便，当非静书。 复当以点画波擎论，极诸家之致，此亦非可仓卒运於毫纸，且保拙守中也。 许任二边并摹者并付反。 又上梁武帝论书致 启伏览书前意，虽止二六而规矩必周，后字不出二百，亦褒贬大备一言以蔽。 便书情顿极，使元常老骨，更蒙荣造。 子敬懦肌，不沉泉夜。 唯逸少得进退其问，则玉科显然可观。 若非圣证品析，恐爱附近习之风，永遂沦迷矣。 伯英既称草圣，元常皇自隶绝。 论旨所谓，殆同机神，实旷世莫继。 斯理既明，诸画虎之徒，当日就报笔反古归真，方弘盛世。 愚管见预闻，喜佩无届。 比世皆尚子敬，敬元末继以齐代，名实脱略海内。 非唯不复知有元常，於逸少亦然。 非排弃所可黜涅而不缁，不过数族。 今奉此论，自舞自蹈，未足逞泄，愿以所摹，窃示。 洪远、思旷此二人，皆是均思者，必当赞仰踊跃，有盈半之益。 臣与洪远虽不相识，从子栩以学往来，故因之有会。 但既在阁，恐或已应闻知力摹者，所采字大小，不堪均调，郭看乃尚可，恐笔意大殊。 此篇方传千载，故宜令迹随矣。 偕老美晚，所奉三纸，伏循字迹，大觉劲密。 窃恐既以言发意，意则应言。 而心随意运，手与笔会，故益得楷称。 下情惧仰，宝奉愈至。 世论咸云：江束无复锺迹，常以叹息。 皆贮望中原廓清太丘之碑，可就摹采。 今论旨云：真边虽少，可得而推，是犹有存者，不审可复几字。 既无出见理冒，愿得工人摹填数行，脱蒙见此，实为过幸。 又逸少学锺，势巧形密，胜於自运。 不审此例，复有几纸。 垂旨以黄庭像赞等诸文，可更有出给，理自运之迹。 今不复希，请学锺妙，仰惟殊恩。 梁武帝答书 锺书乃有一卷，传以为真。 意谓悉是摹学，多不足论，有两三行许似摹，微得锺体。 逸少学锺的可知近有二十许首，此外字细画短，多是锺法。 今欲令人帖采，未便得付，来月有竟者，当遣送也。 论书敌 逸少自昊兴以前，诸书犹为未称，凡厥好边，皆是向会稽时永和十许年中者。 从失郡告灵，不仕以后，略不复自书，皆使此一人世中不能别见。 其缓异呼为末年书。 逸少亡后，子敬年十七八，全仿此人书，故遂成与之相似。 今圣旨标显，足使众识顿悟於逸少无末年之讥。 玩研闻，近有一人学研书，遂不复可别。 臣比郭摹所得，虽鹰写字形，而无复其用笔迹势。 不审前后诸卷，一两条谨密者，可得在出装之例。 复蒙垂给，至年末问，否此泽自天直以启审，非敢必觊。 答朝士访仙佛两法体相书 初，梁诸朝散大夫问日：尝窃观仙书，辄嗟欣忘倦。 徒羡其文，莫测其理。 寻七尺之体，既同禀太始，俱服五常，以何因绿独超青云，而弊金石者乎。 先生领神玄门，学穷仙苑。 必有以竭其川岸。 请略闻雅说。 隐居答日：至哉嘉讯，岂蒙生所辩。 虽然试言之：若直排竹相之匹桐柳者，此本性有殊，非今日所论。",
      "translated_text": "The *\"Conveniently Changed Month\"* sheet is by Zhang Yi. The *\"Fifteenth Day of the Fifth Month County Notice\"* sheet is also by Wang Min. The *\"Prescription for Treating Drinking\"* sheet is by Xie An. The above ten entries are not Wang Xizhi’s works. Fearing that they may not have been properly distinguished, I now respectfully present the calligraphy of Master Xu and Ren Jing. By comparing them separately, one may discern the styles of Wang Min, Zhang Cheng, Xie An, and Zhang Yi, which are suitable for official use.\n\n**Emperor Wu of Liang’s Response to the Recluse’s Letter**\nHaving reviewed the distinctions among the various calligraphic works, I find your discernment truly refined. However, the differences and similarities, as well as their merits, remain unclear to me.\n\nThe two sheets of *Attending Secretary and Yellow Gate* are by Ren Jing. Observing the characters in the submitted Jing works, they appear closely aligned. The recent two sheets of Jing’s calligraphy display a mixed and facile style, which cannot be Jing’s true hand. One must further assess them by examining brushstrokes, wave-like flourishes, and the essence of various masters. This is not something to be hastily executed on paper; for now, I shall maintain restraint and adhere to moderation.\n\nThe traced works of Xu and Ren are all returned.\n\n**Further Letter from Emperor Wu of Liang on Calligraphy**\nUpon reviewing your previous letter, though brief, its principles are comprehensive. Even with fewer than two hundred characters, it contains ample praise and critique, succinctly encapsulating all. Your written sentiments are profoundly moving, such that even the aged bones of Zhong [Yao] would be honored anew, and the delicate frame of [Wang] Xianzhi would rise from the netherworld. Only [Wang] Xizhi’s reputation can be justly elevated or diminished by such inquiry, revealing the jade-like standards with clarity. Without the sagely discernment of graded evaluation, I fear the trend of blindly following recent fashions will lead to eternal confusion.\n\nSince [Zhang] Zhi is hailed as the sage of cursive script and Zhong [Yao] himself perfected clerical script, your argument aligns with divine insight, a rarity unmatched across the ages. With this principle now clear, those who vainly attempt to mimic the tiger’s form should promptly abandon their brushes, return to antiquity, and embrace authenticity, thereby advancing this flourishing era. Though my humble opinion has been heard, my admiration knows no bounds.\n\nIn recent times, all have revered [Wang] Xianzhi. By the end of the Qi dynasty, his fame and substance had spread throughout the realm. Not only was Zhong [Yao] no longer acknowledged, but even [Wang] Xizhi was similarly neglected. This is not a matter of mere rejection but of the natural fading of influence, limited to a few lineages.\n\nUpon receiving your treatise, I was so overjoyed that I danced and leapt, yet this scarcely expresses my elation. I wish to privately share the traced works with Hongyuan and Sikuang—both are men of equal discernment—who will surely praise and celebrate them, gaining more than half their benefit.\n\nThough I do not know Hongyuan personally, I have corresponded with his nephew Xu through scholarly exchanges, and thus we have met in this way. However, since I am in the palace, I fear he may have already heard of the traced works. The selected characters vary in size and cannot be harmoniously adjusted. Guo’s examination suggests they may still be acceptable, though the brushwork differs significantly. Since this work will be transmitted for a thousand generations, its traces should be made to follow accordingly.\n\nIn my declining years, I have received three sheets from you. Upon carefully examining the characters, I find them robust and meticulous. I surmise that once words express intent, the intent aligns with the words. As the mind guides the intent and the hand unites with the brush, the result is even more worthy of praise. My humble heart trembles with reverence, and my cherished admiration grows ever deeper.\n\nThe prevailing opinion holds that no traces of Zhong [Yao] remain east of the Yangtze, a matter of constant lament. I have long hoped for the restoration of the Central Plains to access the *Taiqiu Stele* for tracing. Your treatise mentions that while authentic works are scarce, they can still be inferred, suggesting some survive. I wonder how many characters remain. Since I cannot personally inspect them, I wish to have a skilled artisan trace and fill in several lines. If I am granted this, it would be an extraordinary blessing.\n\nMoreover, [Wang] Xizhi’s studies of Zhong [Yao] exhibit ingenious structure and meticulous form, surpassing his own spontaneous works. I wonder how many such examples exist. If you could provide the *Huangting Jing*, *Xiang Zan*, and other texts, along with his self-composed works, I would no longer seek them. Instead, I request the finest of his studies of Zhong [Yao], in profound gratitude for your exceptional favor.\n\n**Emperor Wu of Liang’s Reply**\nThere is indeed one scroll of Zhong [Yao]’s calligraphy, traditionally regarded as authentic. However, I believe it is entirely traced, and most are unworthy of discussion. Only two or three lines appear to be traced, faintly capturing Zhong’s style.\n\n[Wang] Xizhi’s studies of Zhong [Yao] that can be verified number around twenty. Beyond these, the smaller characters with shorter strokes mostly follow Zhong’s method. I intend to have them copied and mounted, but it is not yet convenient to send them. Next month, when the task is complete, I will dispatch them.\n\n**On Calligraphic Rivalry**\nBefore [Wang] Xizhi’s time in Wuxing, his calligraphy was not yet fully refined. All his finest works date from his tenure in Kuaiji, roughly the decade of the Yonghe era. After resigning his post and mourning his father, he no longer served in office and scarcely wrote himself, entrusting all to a single individual whose work remains unseen in the world. The relaxed and distinctive pieces are mistakenly called his late works.\n\nAfter [Wang] Xizhi’s death, [Wang] Xianzhi, at seventeen or eighteen, fully imitated this person’s calligraphy, thus achieving a resemblance. Now, by Your Majesty’s decree, this distinction is made clear, sparing [Wang] Xizhi the criticism of having no late works.\n\nUpon reflection, I recently encountered someone who studied Yan [Zhenqing]’s calligraphy so closely that it became indistinguishable. In my own traced copies, though the character forms resemble hawks, the brushwork and energy are lost. I wonder if among the previous scrolls, one or two meticulously executed pieces might be included in the mounting process. If you deign to grant this, I will inquire again by year’s end. Otherwise, I dare not presume upon your generosity.\n\n**Response to Court Gentlemen on the Differences Between Daoist Immortality and Buddhist Dharma**\n\nInitially, a court gentleman of Liang inquired: \"I have privately studied Daoist texts on immortality and often find myself sighing in admiration, forgetting weariness. Yet I admire only their language, not their meaning. Considering that the seven-foot body shares the same origin in the Great Beginning and partakes of the Five Constants, why is it that only immortals ascend to the azure clouds while others decay like metal and stone? You preside over the Gate of the Mysterious Dao and have mastered the teachings of the Immortal Gardens. There must be a way to exhaust this profound question. I humbly request a brief explanation.\"\n\nThe Recluse replied: \"Your inquiry is most excellent, though it surpasses my humble ability to expound. Nevertheless, I shall attempt to explain: If one merely compares the bamboo and paulownia to the willow, their natures differ inherently. This is not the subject of today’s discussion.\"",
      "overlap_context": " further detailed assessment difficult. The first sheet, dated the third year of Huangchu, is a later imitation of Wang Xizhi’s work. The *Miao Xi Epitaph* is by Master Xu. The *Embracing Sorrow and Grief* is by Zhang Cheng. The sheet dated the eleventh day of the fifth month is a tracing of Wang Huan’s *Letter of Reprimand*. The *Longing for the Recluses of Huang and Qi* and the *Entangled Thoughts* are both later imitations, clumsy and crude. One sheet remains unexamined—it is by Wang Xianzhi.",
      "start_char": 5173,
      "end_char": 6431,
      "start_sentence": 391,
      "end_sentence": 459,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.014304876327515,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "若引庖刀汤稼从养溉之功者，此又止其所从，终元永固之期。 夫得仙者，并有异乎。 此但斯族复有数种，今且谈其正体。 凡质像所结，不过形神，形神合时，是人是物，形神若离，则是灵是鬼，其非离非合，佛法所摄，亦离亦合，仙道所依。 今问以何能而致此仙，是铸炼之事，极感变之理通也。 当涎坛以为器之时，是土而异於土。 虽燥未烧，遇湿犹坏，烧而未熟，不久尚毁。 火、力既足，表裹坚固。 河山可尽，此形无灭。 假令为仙者，以药石炼其形，以精灵莹其神，以和气濯其质，以善德解其缠。 众法共通，元碍无滞，欲合则乘云驾龙，欲离则尸解化质。 不离不合，则或存或亡。 於是各随所业，修道进学，渐阶无穷，教功令满，亦异竟寂灭矣。 登真隐诀序 昔在人闻，已钞撰真经修事两卷，于时亦厅谓委密。 顷岩居务静，颇得恭洁，试就遵用，犹多阙略。 今更反覆研构，表裹洞洽，预是真学之理，使了然无滞。 一字一句，皆有事旨。 或论有以入无，或据显而知隐，或推机而得宗，或引彼以明此。 自非闲炼经书，精涉道数者，率然览之，犹观海尔。 必须详究委曲，乃当晓其所以。 故道备七篇，义同高品。 尝闻古言，非知之难，其在行之意，谓非学之难，解学难也。 屡见有人得两三卷书，五六条事，谓理尽纸上，便入山修用动积，岁月愈久愈昏。 此是未造门墙。 何由吗其帷席。 试略问厅处，已自茫然，皆答言经说止如此，但谨依存行耳，乃颇复开动端萌，序导津流。 若值智尚许人，脱能欣尔感悟，询访是非。 至於愚迷矜固者，便径道君，何以穿凿异同，评论圣文。 或有自执己见，或云承旧法永无肯发对扬之怀。 此例不少，可为痛心。 夫经之为言，径也，经者，常也，通也。 谓常通而无滞，亦犹布帛之有经矣，必须铨综纬绪仅乃成功。 若机关疏越，杼轴乖谬，安能斐然成文。 真人立象垂训，本不为蒙校设言，故每标通衢，而恒略曲径。 知可教之士，自当观其隅辙。 凡五经子史，爰及赋颂，尚历代注释犹不能辩，瓦玄妙之秘途，绝领之奇篇，而可不探括冲隐，穷思寂昧者乎。 既撰此粗立，乃辍书而叹日：若使愿玄平在此，乃当知我心理所得，几於天人之际往矣，如何孰与言哉。 方将寄之於玄会耳。 药总诀序 上古神农作为本草，凡着三百六十五种，以配一岁。 岁有三百六十五日，日生一草。 草主一病，上应天文，中应人道，下法地理。 调和五味，制成嘐醴。 以备四气为弗服。 欲其本立，道生者也。 当斯之时，人心素朴，嗜欲寡少，设有微疾，服之万全。 自此之后，世伪情浇，智虑日生，驰求无厌，忧患不息。 故邪气数侵。 病转深痛，虽服良药不愈。 其后雷公祠君，更增演本草二家药对，广其主治，繁其类族。 既世改情移，生病日深，或未有此病，而逆设彼药。 或一药以治，或百药共愈一病。 欲以排邪还正，为之原防故也。 而三家所列疾病，互有盈缩，或物异而名同，或物同而名异，或玲热乖违，甘苦背越，采取殊法，出处异所。 若此之流，殆难按据，寻其大归。 神农之时，未有文字，至於黄帝书记乃兴，於是神农本草列为四经三家之说，递有损益，岂非随时适变。 殊途同归者乎。 但本草之书，历代久远，既靡师授，又无注训传写之人，遗误相击，字义残阙，莫之是正。",
      "translated_text": "If one draws an analogy to the kitchen knife and boiling grain, tracing their functions to cultivation and irrigation, this merely addresses their origins, not the eternal and unchanging essence. Those who attain immortality are fundamentally different. Even within this category, there exist several types; for now, let us discuss their true nature.\n\nAll forms, whether material or spiritual, arise from the union of form and spirit. When form and spirit are conjoined, one is human or being; when they separate, one becomes spirit or ghost. That which is neither separated nor conjoined falls under Buddhist dharma, while that which is both separated and conjoined pertains to the Dao of immortality.\n\nNow, how does one achieve this immortality? It is a matter of refinement, a thorough comprehension of the principles of transformation. When clay is shaped upon the wheel into a vessel, it becomes earth yet differs from earth. Though dry but unburnt, it crumbles when wet; though fired but not fully matured, it remains fragile. Only when fire and force are sufficient does its surface and interior become firm. Rivers and mountains may vanish, yet this form remains indestructible.\n\nSuppose one seeks immortality: with medicinal stones, one refines the form; with essence and spirit, one purifies the soul; with harmonious qi, one washes the substance; with virtuous power, one unbinds its fetters. When all methods converge without obstruction, one may unite to ride clouds and mount dragons, or separate to undergo liberation through apparent death and transformation. Neither united nor separated, one may exist or vanish at will. Thus, each follows their karmic path, cultivating the Dao and advancing in study, gradually ascending without limit until the teachings’ work is complete—yet this differs from the ultimate quiescence of extinction.\n\n*Preface to the \"Secret Essentials of Ascending to Perfection\"*\nFormerly, while among people, I had already compiled and edited two volumes on the practices of the true scriptures, which I then deemed thorough. Recently, dwelling in seclusion and embracing tranquility, I have attained greater reverence and purity. Testing these methods, I found them still lacking. Now, after repeated reflection and refinement, I have achieved coherence within and without, elucidating the principles of true study so that all becomes clear and unimpeded. Every word and phrase carries its purpose: some expound the transition from being to non-being, some reveal the hidden through the manifest, some deduce the origin from its mechanism, some clarify this by referencing that. Without prior immersion in scriptures and precise engagement with Daoist techniques, a cursory reading would be like gazing at the sea. Only through meticulous inquiry into its intricacies can one truly comprehend its essence.\n\nThus, the Dao is complete in seven chapters, its meaning aligned with the highest rank. I have often heard the ancient saying: \"Not knowing is difficult, but acting upon knowledge is the true challenge.\" It is not learning that is difficult, but understanding the learning. I have repeatedly observed those who obtain two or three scrolls, or five or six methods, believing the principle exhausted on paper, then retreat to the mountains to practice, only to grow more confused with time. These have not even entered the gate, let alone approached the inner sanctum. If questioned on specifics, they are at a loss, claiming the scriptures say no more than this and that they merely follow faithfully. Yet I have endeavored to initiate inquiry, to guide and illuminate the path. If one encounters a person of wisdom and humility, they may be moved to seek understanding and discern right from wrong. But those who are foolish and obstinate will dismiss it outright, asking, \"Why debate differences or critique sacred texts?\" Some cling to their own views, while others claim adherence to ancient methods, refusing to engage in discussion or debate. Such cases are not few, and it is truly lamentable.\n\nThe term *jing* (scripture) signifies a path—a constant, unobstructed way. Just as cloth requires both warp and weft to be woven into fabric, if the mechanism is flawed or the shuttle misaligned, how can a coherent pattern emerge? The Perfected Ones established symbols and imparted teachings not for the uninitiated but for those capable of instruction. They often marked the broad avenues while omitting the winding paths, trusting that those with discernment would infer the rest. Even the Five Classics, the philosophers, histories, rhapsodies, and odes—despite generations of commentary—remain debated. How much more so for the profound and wondrous secrets of the esoteric Dao, the extraordinary texts of the transcendent realm? Should one not delve into their hidden depths, exhausting thought and plumbing the obscure?\n\nHaving composed this rough draft, I laid down my brush and sighed: \"If Yuanxuan Ping were here, he would understand the principles I have grasped, which nearly traverse the boundary between heaven and humanity. With whom else could I discuss this?\" I shall entrust it to the mysterious convergence.\n\n*Preface to the \"Compendium of Medicinal Essentials\"*\nIn high antiquity, the Divine Farmer composed the *Materia Medica*, recording three hundred sixty-five substances to correspond with the days of the year. Each day brought forth one herb, each herb governed one ailment, aligning above with celestial patterns, in the middle with human affairs, and below with earthly principles. Harmonizing the five flavors, he crafted decoctions and elixirs to prepare for the four seasons’ changes. This was to establish the root so that the Dao might flourish. In that era, human hearts were simple and desires few. Even minor illnesses were cured with perfect efficacy.\n\nSince then, the world has grown artificial and emotions shallow; cunning and anxiety have multiplied, desires know no bounds, and worries never cease. Thus, pathogenic qi frequently invades, and illnesses grow more severe and painful. Though potent medicines are administered, they fail to cure. Later, Lord Leigong and others expanded the *Materia Medica* and the *Pairs of Medicinals*, broadening their therapeutic applications and multiplying their categories.\n\nAs the world changes and emotions shift, illnesses deepen. Some preemptively prescribe medicines for diseases not yet present, while others use a single herb or a hundred together to cure one ailment—all to expel evil and restore balance, addressing root causes and preventing harm. Yet the three schools’ listed diseases vary in scope: some substances differ but share names, others are identical but named differently; some are cold where they should be hot, or bitter where they should be sweet; their harvesting methods and origins diverge. Such discrepancies make it nearly impossible to rely on them.\n\nIn the time of the Divine Farmer, there was no writing. Only with the Yellow Emperor did records begin. Thus, the *Divine Farmer’s Materia Medica* was categorized into four classics and three schools, with successive additions and omissions—was this not a matter of adapting to the times, taking different paths to the same destination?\n\nHowever, the *Materia Medica* has endured through countless ages. Without masters to transmit it or scholars to annotate and copy it, errors have accumulated, characters and meanings have been lost, and no one has corrected them.",
      "overlap_context": "and stone? You preside over the Gate of the Mysterious Dao and have mastered the teachings of the Immortal Gardens. There must be a way to exhaust this profound question. I humbly request a brief explanation.\"\n\nThe Recluse replied: \"Your inquiry is most excellent, though it surpasses my humble ability to expound. Nevertheless, I shall attempt to explain: If one merely compares the bamboo and paulownia to the willow, their natures differ inherently. This is not the subject of today’s discussion.\"",
      "start_char": 6431,
      "end_char": 7680,
      "start_sentence": 460,
      "end_sentence": 518,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.70167875289917,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "方用有验，布舒合和。 肘后百一方序 太岁庚辰，隐居日：余宅身幽岭，迄将十载。 虽每植德施功，多止一时之设，可以传芳远裔者，莫！ 过於撰述。 见葛氏肘后救卒，殊足申一隅之思。 夫生人之所为大患，莫急於疾。 疾而不治，犹救火而不以水也。 今辈掖左右，药师易寻，郊郭之外，已自难值。 死穷村迥野，遥山绝浦，其问枉夭，安可胜言。 方术之书，卷秩徒烦，拯济殊寡。 欲就披览，回惑多端。 抱朴此制，实为深益，然尚阙漏，未尽其善，辄更采集补阙凡一百一首，以朱书甄别为肘后百一方，於杂病单治略为用遍矣。 昔应璩为百一诗，以箴规心行。 今余撰此，盖欲卫辅我躬。 且佛经云：人用四大，成身一大，辄有一百一病。 是故深宜自想，上自通人，下达众庶，莫不各加缮写。 而究括之余，又别撰效验方五卷，且论诸病证候，因药变通，而并是大治，非穷居所资。 若华轩鼎室，亦宜修省耳。 葛氏序云：可以施於贫家野居。 然亦不止如是。 今缙绅君子，若常处闲佚，乃可披於方书，脱从禄外邑，将命遐征。 或宿直禁闱，晨宵隔绝。 或羁束戎阵，城栅严阻。",
      "translated_text": "The efficacy of formulas lies in their application and harmonious blending.\n\n*Preface to the One Hundred and One Formulas of the Handbook of Prescriptions for Emergencies*\nIn the year *gengchen* of the Great Era, the Recluse says: I have dwelt in secluded mountains for nearly a decade. Though I have often cultivated virtue and performed deeds of merit, most have been but temporary measures—nothing that might transmit fragrance to distant descendants! Yet nothing surpasses the act of composition. I have seen Ge Hong’s *Handbook of Prescriptions for Emergencies*, which amply fulfills the aspiration to illuminate even a single corner.\n\nOf all the great afflictions of human life, none is more urgent than illness. To suffer illness without treatment is like fighting fire without water. Those in the imperial entourage may easily find physicians and remedies, but beyond the city walls, they are already difficult to come by. How much more so in remote villages, distant wilderness, deep mountains, or isolated shores—where untimely deaths abound, their number beyond reckoning!\n\nMedical texts abound in volumes, yet their profusion brings little relief. To consult them is to be led astray by confusion. This work of Ge Hong’s is truly of profound benefit, yet it remains incomplete, its excellence not yet fully realized. Thus, I have gathered and supplemented it with one hundred and one additional formulas, distinguishing them in vermilion script as *One Hundred and One Formulas of the Handbook of Prescriptions for Emergencies*. For miscellaneous ailments and simple treatments, this compilation now suffices for most needs.\n\nIn ancient times, Ying Qu composed his *One Hundred and One Poems* to admonish conduct and refine the heart. My compilation here serves to safeguard and support my own person. Moreover, as the Buddhist scriptures say: \"Humans, composed of the Four Great Elements, form a single body, which may suffer one hundred and one illnesses.\" Therefore, it is deeply fitting to reflect on this. From the most learned scholars to the common people, none should fail to copy and study it.\n\nBeyond this compilation, I have also composed five additional volumes of *Proven Formulas*, further discussing the symptoms of various diseases and the adaptive use of medicines—all of which are highly effective treatments, not merely resources for those in seclusion. Even those in grand halls or noble chambers would do well to examine and take heed.\n\nGe Hong’s preface states: \"This may be applied in poor households and rustic dwellings.\" Yet its use is not so limited. Now, if gentlemen of the gentry enjoy leisure and ease, they may peruse these medical texts. But if they are dispatched to distant posts, entrusted with official duties, or stationed in guarded palaces where dawn and dusk are cut off, or bound by military service behind fortified walls—then let them too find value in these pages.",
      "overlap_context": "he Yellow Emperor did records begin. Thus, the *Divine Farmer’s Materia Medica* was categorized into four classics and three schools, with successive additions and omissions—was this not a matter of adapting to the times, taking different paths to the same destination?\n\nHowever, the *Materia Medica* has endured through countless ages. Without masters to transmit it or scholars to annotate and copy it, errors have accumulated, characters and meanings have been lost, and no one has corrected them.",
      "start_char": 7680,
      "end_char": 8113,
      "start_sentence": 519,
      "end_sentence": 542,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.193332195281982,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "忽遇疾仓卒，唯拱手相看，曷若探之囊笋，则可庸坚成医，故备论证候，使晓然不滞。 一披条领，无使过差也。 本草序 隐居在乎茅山岩岭之上，以吐纳余暇，颇游意方技。 览本草药性，以为尽圣人之心，故撰而论之。 旧说皆称神农本经，余以为信然。 昔神农氏之王天下也，画八卦以通鬼神之情，造耕种以省杀生之弊，宣药疗疾以拯夭伤之命，此三道者，历众圣而滋彰。 文王、孔子象象系辞，幽赞人天。 后稷、伊尹播厥百谷，惠被群生。 歧黄彭扁振扬辅导，恩流含气，并岁瑜三千民到，于今赖之。 但轩辕以前，文字未传，如六爻指垂，画象稼穑，即事成迩。 至於药性所主，当以识识相因不尔，何由得闻。 至于桐雷乃着在於编简。 此书应与素问同类，但后人多更修饰之尔。 秦皇所焚医方卜术不预，故犹得全录。 而遭汉献迁徙，晋怀奔进，文籍焚靡。 千不遗一。",
      "translated_text": "When suddenly stricken by illness, one can only clasp hands in helplessness—how much better to delve into one’s satchel, where ready remedies may be found to forge a physician from even the most unskilled. Thus, I have exhaustively discussed symptoms to ensure clarity and prevent confusion. With but a glance at the headings, one may avoid misdiagnosis.\n\n*Preface to the Materia Medica*\nDwelling in reclusion among the peaks and crags of Mount Mao, I turned in my moments of leisure from breath cultivation to the study of arts and techniques. Surveying the properties of herbs in the *Materia Medica*, I saw therein the fullness of the sage’s intent and so composed this discourse. The old accounts all attribute the *Divine Farmer’s Classic* to Shennong, and I affirm their truth.\n\nWhen the Divine Farmer ruled all under Heaven, he drew the Eight Trigrams to bridge the minds of spirits and men, devised plowing and planting to spare the harm of slaughter, and proclaimed medicines to heal the sick and rescue lives cut short—these three Ways have endured through the ages, growing ever more luminous. King Wen and Confucius expounded the *Changes*, subtly illuminating the realms of heaven and humanity. Hou Ji and Yi Yin sowed the hundred grains, their bounty showering all living things. Qi Bo, Huangdi, Peng Zu, and Bian Que spread their teachings, their grace flowing through all that breathes, preserving the lives of three thousand people in every generation—we rely upon them still.\n\nYet before the Yellow Emperor’s time, written records did not survive. The Six Lines pointed the way, and the images of tilling and sowing arose from immediate practice. As for the governing properties of medicines, how could they be transmitted save through direct recognition passed down in unbroken succession? Only with Tongjun and Leigong were these teachings first inscribed on bamboo slips. This work should rank alongside the *Plain Questions*, though later hands have often embellished it. The First Emperor’s burning of medical formulas, divination texts, and arts of prognostication spared it, and so its complete record endured. But when the Han court fled and the Jin rulers fled in turn, texts were scattered and burned—scarcely one in a thousand survived.",
      "overlap_context": "hambers would do well to examine and take heed.\n\nGe Hong’s preface states: \"This may be applied in poor households and rustic dwellings.\" Yet its use is not so limited. Now, if gentlemen of the gentry enjoy leisure and ease, they may peruse these medical texts. But if they are dispatched to distant posts, entrusted with official duties, or stationed in guarded palaces where dawn and dusk are cut off, or bound by military service behind fortified walls—then let them too find value in these pages.",
      "start_char": 8113,
      "end_char": 8456,
      "start_sentence": 543,
      "end_sentence": 559,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.477338314056396,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "今之所存有此四卷、是其本经。 所出郡县，乃后汉时制，疑仲景、元化等所记。 又云有桐君采药录，说其花叶形色药对四卷，论其估使相须。 魏晋已来，昊普李当之等更复损益。 或五百九十五，或四百四十一，或三百一十九，或三品混揉，玲热舛错，草石不分，虫兽无辨。 且所主治互有得失，医家不能备见，则识智有浅深。 今辄苞综诸经，研括烦省，以神农本经三品，合三百六十五为主，又进名医副品亦三有六十五，合七百三十种。 精赢皆取，无复遗落，分别科条，区吵物类。 兼注诏时用，土地所出，及仙经道，术所须，并此序录合为七卷，．虽未足追踵前良，盖亦一家撰制。 吾去世之后，可贻诸知音尔。 华阳陶隐居集卷上竟 #1『 唯』原作『隹』，疑缺误，据上下文义补。 华阳陶隐居集卷下 昭台弟子傅霄编集",
      "translated_text": "Here now survive these four scrolls, being the original canon. The commanderies and counties named therein follow the system of the Later Han, and were likely recorded by [Zhang] Zhongjing, [Hua] Yuanhua, and others. It is also said there exists the *Tongjun’s Record of Gathered Medicines*, which in four scrolls describes the flowers, leaves, forms, and colors of herbs, and discusses their paired applications and mutual necessity. From the Wei and Jin onward, Wu Pu, Li Dangzhi, and others repeatedly revised and expanded it—sometimes to five hundred ninety-five entries, sometimes to four hundred forty-one, or three hundred nineteen. At times the Three Grades were jumbled together, with cold and heat properties confused, plants and minerals undifferentiated, insects and beasts unclassified. Moreover, their indicated treatments often proved inconsistent, and physicians, unable to examine all texts, varied in discernment and depth of understanding.\n\nHere I have gathered and synthesized the various canons, refining and condensing their complexities. Taking the *Shennong’s Materia Medica*’s Three Grades—three hundred sixty-five entries—as the foundation, I have added a supplementary grade of three hundred sixty-five from the *Famous Physicians’ Formulas*, totaling seven hundred thirty kinds. All essentials have been carefully selected, with nothing omitted, and arranged by categories and classes. I have further annotated their seasonal uses, places of origin, and the requirements of Daoist scriptures and arts, compiling this preface and catalogue into seven scrolls. Though this work may not rival the excellence of earlier masters, it stands as one school’s systematic effort.\n\nAfter my passing, may it be bequeathed to those of kindred understanding.\n\n*Collected Works of Tao the Recluse of Huayang, Scroll One* (end)\n*(Note: The character 唯 was originally written as 隹, likely a scribal error; emended here based on context.)*\n\n*Collected Works of Tao the Recluse of Huayang, Scroll Two*\n*Compiled by Zhao Tai’s disciple, Fu Xiao*",
      "overlap_context": "gnition passed down in unbroken succession? Only with Tongjun and Leigong were these teachings first inscribed on bamboo slips. This work should rank alongside the *Plain Questions*, though later hands have often embellished it. The First Emperor’s burning of medical formulas, divination texts, and arts of prognostication spared it, and so its complete record endured. But when the Han court fled and the Jin rulers fled in turn, texts were scattered and burned—scarcely one in a thousand survived.",
      "start_char": 8456,
      "end_char": 8787,
      "start_sentence": 560,
      "end_sentence": 573,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.239047288894653,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "大洞弟子陈桶校勘 许长史旧馆坛碑 悠哉旷矣，宇宙之灵也。 固非言象所传，文迹可记，默然则后之人奚闻乎。 含吐万有，化育草生。 本其所由，义归冥昧。 至於形域区分，性用殊品。 事限观听，理穷数识者，傥或可论。 山之高，海之广，夫何故以其有容焉。 大天之内复有小天三十六所，并拓寓地空。 亘徐水脉。 辟闱风岫，通气云嗽。 此山本号句曲，其下是第八洞宫，名曰：金坛华阳之天。 周回一百五十里，分置三府。 前汉元帝，世有咸阳三茅君得道，来掌此任，故称茅山，具详传记。 至晋太和元年，句容许长史在斯营宅，厥迩犹存。 宋初，长沙景王，就其地之束，起道士精舍。 梁天监十三年，劫贸此精舍立为朱阳馆，将远符先征定详。 火历，於馆西更筑隐居住址。 十四年，别创郁岗斋室，追玄洲之踪。 十七年，乃缮勒碑坛，仰述真轨。 真人姓许，讳穆世，名谧，字思玄，本汝南平舆人。 后汉灵帝中平二年，六世祖光，字少张，避许相谀侠、乃来过江，居丹阳句容都乡之吉阳里。 后仕昊为光禄勋，识宇亮拔，奕叶才明。 祖尚，字元甫。 有文章机见，昊中书郎。 父副，字仲先。 器度淹通，风格清简。 晋刻令，宁朔将军，下那太守，西城侯。 长史，副第五子也。 正生少知，名简文。 在藩为世表之交起家，太学博士。 朝纲礼肆，儒论所宗，出为余姚令，葱恤民隐，惠被邻邑。 征入凯闱，纳言帝侧。 升平末除，护军长史，本郡中正。 外督戎章，内铨茂序。 遐邦肃律，乡采砥行。 太和中，迁给事中散骑常侍，蝉冕辉华，事归尚德。 简文践极方优国老，傥值晏驾。 於焉告退，专静山庐，以修上道。 君虽缙绂朝班，讽议庠塾，而心标象外，志结霞门。 第四兄远游。 永和四年，嘉遁不反，君尚想幽奇，岁月弥斡，恒与杨君深结神明之契。 兴宁中，众真降杨备令，宣喻龙书云篆，会然遍该灵谟奥旨，于兹必究，年涉悬车，遵行愈笃。 太元元年，解驾违世，春秋七十有二。 子侄礼定於县西大墓。 京陵之踪未远，飞剑之郑在焉。 谨按真诰，君挺命所基，绿业已久，乃周武王世九宫上相长里薛公之弟也。 兼许肇遗功复应，垂祉后胤，故乘运托生，因资成道。 玉札所授为上清真人，爵登侯伯，位编卿司。 理仙抚治，佐圣牧民矣。 真传未显於世，莫得具述。 杨君讳羲，事具真诰。 长史第三子，讳玉斧，世名翩字道翔，正生。 母陶威女，先亡已得在洞府易迁宫中。 君清颖莹洁，特绝世伦。",
      "translated_text": "**Collated by Chen Tong, Disciple of the Great Cavern**\n*Inscription on the Altar Stele of the Former Residence of Director Xu*\n\nVast and boundless—such is the numinous essence of the cosmos. It transcends all expression in words or images, all records in written traces. Yet if left unspoken, how shall later generations come to know it?\n\nIt embraces and exhales the myriad existences, nurturing the growth of grasses and trees. Its origins lie in profound obscurity, its meaning归于冥昧. As for the division of forms and realms, the distinct natures and functions of things—these may be discussed where matters are bounded by observation and hearing, where principles are exhausted by calculation and knowledge.\n\nWhy are mountains so lofty, seas so vast? Because they possess the capacity to contain. Within the great heavens lie thirty-six lesser heavens, all expanding to dwell within the emptiness of earth. They span the veins of flowing waters, open the gates of wind-swept peaks, and connect the qi of clouds and mists.\n\nThis mountain was originally called Mount Gouqu. Beneath it lies the Eighth Cavern Palace, known as the Heaven of Jintan Huayang. Its circumference measures one hundred fifty *li*, divided into three administrative precincts. During the reign of Emperor Yuan of the Former Han, the Three Mao Lords of Xianyang attained the Dao and came to govern this domain—hence its name, Mount Mao. The full account is detailed in the biographical records.\n\nIn the first year of the Taihe era of the Jin dynasty, Director Xu of Jurong established his residence here, and its traces remain to this day. At the beginning of the Song dynasty, Prince Jing of Changsha built a Daoist abbey at the eastern edge of this site. In the thirteenth year of the Tianjian era of the Liang dynasty, the abbey was repurposed into the Zhuyang Lodge, fulfilling distant omens foretold in earlier prophecies. Later, a fire ravaged the lodge, and a new hermitage was constructed to the west for habitation. In the fourteenth year, the Yugang Study Hall was built separately, emulating the traces of the Mystic Continent. By the seventeenth year, the altar stele was repaired and inscribed, reverently recording the true principles.\n\nThe Perfected One bore the surname Xu, with the personal name Mi, courtesy name Sixuan, and given name Shi. He was originally from Pingyu in Runan. In the second year of the Zhongping era of Emperor Ling of the Later Han, his sixth-generation ancestor, Xu Guang (courtesy name Shaozhang), fled the turmoil caused by the flatterer Xu You and crossed the Yangtze, settling in Jiyang Village of Duxiang County in Jurong, Danyang. Later, he served the Wu kingdom as Superintendent of the Imperial Household, renowned for his discernment and brilliance, with successive generations distinguished in talent and wisdom.\n\nHis grandfather, Xu Shang (courtesy name Yuanfu), possessed literary talent and keen insight, serving as Gentleman of the Interior in Wu. His father, Xu Fu (courtesy name Zhongxian), was of profound and far-reaching character, his demeanor refined and unadorned. He held the posts of Magistrate of Ke County, General of Pacification, Prefect of Xianxia, and Marquis of Xicheng.\n\nDirector Xu was the fifth son of Xu Fu. From childhood, he was known for his intelligence and simplicity. While still a prince, Emperor Jianwen regarded him as a paragon among his peers. He began his career as Erudite of the National University. His mastery of court rituals and Confucian discourse made him a leading authority. Later, he served as Magistrate of Yuyao, where he alleviated the people’s hardships and extended his benevolence to neighboring counties. Recalled to the capital, he became a trusted advisor at the emperor’s side.\n\nAt the end of the Shengping era, he was appointed Director of the Bureau of Military Affairs and Chief Examiner of his home commandery. Externally, he oversaw military regulations; internally, he evaluated the worthy. Distant regions adhered to his discipline, and his hometown emulated his conduct. During the Taihe era, he was promoted to Gentleman Attendant at the Yellow Gates and Cavalier Attendant-in-Ordinary. Adorned in the splendor of court regalia, his duties centered on the cultivation of virtue.\n\nWhen Emperor Jianwen ascended the throne, he honored the elderly and cherished the wise. Had the emperor not passed prematurely, Director Xu would have retired. Instead, he withdrew to his mountain retreat to devote himself to the cultivation of the supreme Dao. Though he wore the court’s sash and cap and engaged in scholarly discourse, his heart soared beyond material forms, his aspirations bound to the gates of rosy clouds. His fourth elder brother had already departed on a distant journey. In the fourth year of the Yonghe era, he too withdrew from the world and never returned.\n\nDirector Xu had long admired the secluded and wondrous, and as the years deepened, he formed a profound spiritual bond with Master Yang. During the Xingning era, the host of Perfected Ones descended upon Master Yang, bestowing upon him the Dragon Script and Cloud Seal. The revelations encompassed the profound and abstruse mysteries of the numinous teachings, which Director Xu diligently studied. As he approached the age of retirement, his devotion to practice grew ever more steadfast.\n\nIn the first year of the Taiyuan era, he departed this world at the age of seventy-two. His sons and nephews buried him in a grand tomb west of the county. The traces of his ascent to the capital of Jingling remain fresh, and the soaring sword’s mark endures.\n\nAccording to the *True Records*, his destiny was predestined, his karmic foundations long established. In the time of King Wu of Zhou, he was the younger brother of Xue, the Grand Minister of the Nine Palaces of Changli. Moreover, the accumulated merits of his ancestors ensured blessings for their descendants, so he was born into this world to fulfill his Dao. The Jade Tablet conferred upon him the rank of Perfected One of Supreme Clarity, with a noble title equivalent to a marquis and a position among the ministers. He governed the affairs of immortals, assisted the sage in shepherding the people.\n\nThe true transmission has not yet been fully revealed to the world, so its details cannot be fully recounted. Master Yang, whose personal name was Xi, is fully documented in the *True Records*.\n\nDirector Xu’s third son, Xu Yufu (courtesy name Daoxiang, given name Pian), was born to his mother, née Tao Wei, who had already passed away and ascended to the Palace of Easy Transitions in the Cavern Heavens. He was of luminous intelligence and purity, surpassing all his contemporaries.",
      "overlap_context": "and catalogue into seven scrolls. Though this work may not rival the excellence of earlier masters, it stands as one school’s systematic effort.\n\nAfter my passing, may it be bequeathed to those of kindred understanding.\n\n*Collected Works of Tao the Recluse of Huayang, Scroll One* (end)\n*(Note: The character 唯 was originally written as 隹, likely a scribal error; emended here based on context.)*\n\n*Collected Works of Tao the Recluse of Huayang, Scroll Two*\n*Compiled by Zhao Tai’s disciple, Fu Xiao*",
      "start_char": 8787,
      "end_char": 9719,
      "start_sentence": 574,
      "end_sentence": 629,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.62350869178772,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "郡举上计缘不赴，糠枇尘务，研精上业。 即弘景玄中之真师也。 恒居此宅，缮修经法。 杨君数相从就。 亟通真感。 太和五年，於兹告逝，时年三十。 真诰云：后十六年，当度束华为上相青童君之侍。 帝晨受书为上清仙公，与谷希子并职。 帝晨之仕比世侍中。 君长兄揆，世名圳 。 次兄虎牙，世名联，并亦得道。 揆今有玄孙灵真在山，劝立嗣真馆，以褒远祖之德。 皇上乘弘誓本力来君此土，焘育苍祇，范铸草品。 导法裁俗，随绿开教。 以隐居积蕴三真经诰，久栖华阳，宜还旧宅，供养修理。 乃劫工匠，建兹堂靖。 既仰祇帝则，兼阐大猷。 东位青坛，西表素塔。 坛塔之问，通是基址。 埋锟拚瓦，投镭便值。 紫烟白雾，缠徊荫盖。 宅南一井，即长史所穿。 井南大塘，乃郭朝遗制。 源出田公之泉，路通姜巴之轨。 傍枕雷平，前瞰下泊。 束际连岗，北横长垄。 柳沃阳谷，俱会西垂。 四域之内，皆谓之金陵，地肺者也。 长史所居，尤为标胜。 方将驷云虹而高骋，驱奔鹤以追风。 望洪涛之浩汗，卷故都以浸远。 古人有言，匪作奚传，敢刊石颂，永属来贤。 浑枢骛气，方祇吐灵。 依性分境，传识赋形。 化通八寓，功浃四瞑。 巡迹电灭，测体渊停。 旋区岳立，一旦海云舒。 搏风泳水，迹实凭虚。 亦石幽匠，开石架庐。 情高身丽，天府地居。 萦峦已曲，画壤肺浮。 五闱面启，九徐环周。 长阳旁岭，交决比流。 乃称龙伏。 皇谓金丘。 昔在西汉，三茅来宾。 爰暨束晋，二许怀真，裁基浚井，栖道接神。 允膺辅圣，锡兹侍晨。 参差年代，捆缢名氏。 书诰具宣，精晖未弥。 甄梵将沦，沉阶已毁。 拱树霜摧。 修庭草委。 肇馆华阳，岁踱二纪。 永观前猷，聿遵鸿轨。 帝曰林哉，尔焉斯止。 经之营之，轮乎奂矣。 胜殿密响，泻瓶杨芬。 瑶官碧简，绚采垂文。 琼函玉检，绮幕绣巾。 兰釭烈耀，金炉扬熏。 桐相双教，方诸兼学。 并证心清，俱漏身浊。 离有离无，且华且朴。 结号虚皇，荃法正觉。 药征质莹，禅感慧通。 飞行钦悦，扪景带虹。 振苦排郭，还明反聪。 物言是力，我见无功。 纷纭今古，汗漫两仪。 三相幻惑，舟壑自移。 绿来则应，不虑不为。 式题龟录，人天鉴知。 吴太极左官葛仙公之碑 道冠两仪之先，名绝万物之始者。 固言语所不得辩，称谓所莫能荃焉。 可以文字述云，何以金石传古。 其遂休也，则日月空照。 遂默也，则生人长昏。 是故出关导以两卷，将升犒其五文。 令怀灵抱识之士，知杳冥之有精焉。 自时厥后，奕代问出。 云篆龙章之牒，炳发於林岫。 壤辞丽气之旨，藻蔚於庭筵。 其可以垂轨范着谣诵者，迄于兹辰。 昔在中叶，甘左见骇於魏王，象奉擅奇於昊主。 至如葛仙公之才，英俊迈盖，其尤彰彰者矣。 公於时虽历游名岳，多居此岭。 此岭乃非洞府，而跨据中川。 束视则连峰入海，南眺则重蟑切云。 西临江澈，北旁郊邑。 斯潜显之奥区，出处之关津。 半寻石井日汲，莫测其源。 三足白麂，百龄不异。 其质精灵之所弗渝，神祇之所司卫。 麻衣史宗之俦，相继栖托。 后有孙慰祖亦嗣居。 弥岁山阴潘洪，字文盛。 少秉道性，志力刚明。 前住余姚、四明、噢国为立观，直上百里，榛途险绝，既术识有用，为物情所怀。",
      "translated_text": "The commandery recommended him for the post of *shangji*, yet he declined, spurning worldly affairs like chaff and dust to devote himself to the profound Daoist arts. He was none other than the true master of Master Hongjing in the mysteries of the unseen. He dwelt constantly in this residence, repairing and transmitting the scriptures and methods. Master Yang often sought his guidance, and through repeated communion, they attained true resonance.\n\nIn the fifth year of the Taihe era, he passed away here at the age of thirty. The *True Records* state: sixteen years later, he would be destined to ascend as the attendant to the Eastern Flower Youth, the Prime Minister of the Azure Lad. In the Court of the Celestial Dawn, he would receive the scriptures and be appointed as an Immortal Duke of Supreme Clarity, sharing office with Gu Xizi. His rank in the Court of the Celestial Dawn was comparable to that of a palace attendant in the mortal realm.\n\nHis eldest brother, Kui (secular name Zhen), and his second brother, Huya (secular name Lian), both likewise attained the Dao. Kui now has a great-great-grandson, Lingzhen, who resides in the mountains and has urged the establishment of the Hall of Successive Perfected Ones to honor the virtue of their distant ancestor.\n\nOur August Emperor, riding the power of his great vow, descended to this land to nurture the black-haired people and mold the myriad beings. He guided by law and shaped customs, unfolding teachings in accordance with the unfolding of destiny. As Master Yinju had long accumulated the three scriptures and records of the Perfected Ones, dwelling for many years in Huayang, it was fitting that he return to his former residence to maintain and cultivate it. Thus, artisans were summoned to construct this hall of tranquility. In reverence to the celestial standard and to propagate the great Dao, an azure altar was raised in the east and a pure pagoda erected in the west. Between altar and pagoda lies the foundation, where tiles and bricks were laid, and beams were set in place. Purple mists and white vapors coil and swirl, casting their shade like a canopy.\n\nSouth of the residence lies a well, dug by Director Xu himself. South of the well is a great pond, a remnant of Guo Chao’s design. Its source is the spring of Lord Tian, and its path follows the tracks of Jiang Ba. Flanking it is Leiping, and before it stretches Xiabo. To the east, ridges connect in succession, while to the north, a long ridge extends. The willows of Yanggu and the fertile valleys converge at the western edge. Within these four bounds, the land is called Jinling, the \"lung of the earth.\" Director Xu’s dwelling is especially distinguished. Soon, he will harness clouds and rainbows to soar high, driving swift cranes to chase the wind. Gazing upon the vast and boundless waves, he will roll up the distant ancient capital like a scroll.\n\nAs the ancients said: if no deeds are wrought, what legacy remains? Thus, we dare to inscribe this stone in praise, that it may endure for future worthies. The primal axis races with the qi, and the earth’s spirit exhales its numen. By nature, it divides into realms; by perception, it assumes form. Transforming through the eight abodes, its merit permeates the four darknesses. Traces vanish like lightning, bodies abide like deep pools. The revolving regions stand like mountains, and in a single day, the sea’s clouds unfurl. Grasping the wind and swimming the waters, their traces truly rest upon emptiness. Even the hidden craftsmen of stone open caverns to frame their dwellings. With lofty sentiments and radiant presence, they reside in the celestial palaces and earthly abodes. Winding peaks curve like bows, and painted lands float like lungs. Five gates open on all sides, and nine paths encircle them. Long ridges stretch beside the hills, their streams intertwining like braided cords—thus it is called \"Dragon’s Crouch.\" The emperor named it \"Golden Mound.\"\n\nLong ago in the Western Han, the Three Mao Brothers came as guests. By the Eastern Jin, the Two Xus embraced the true Dao, laying foundations, dredging wells, dwelling in seclusion, and communing with spirits. Truly, they were worthy aides to the sage, granted the honor of serving at the Celestial Dawn. Though the ages have passed and names have faded, the scriptures and records fully proclaim their radiant essence, which has not yet dimmed. Yet the refined and the coarse have mingled, and the sacred steps have crumbled. Frost has withered the trees in the courtyard, and weeds have overgrown the once-tended gardens.\n\nWhen the Hall of Huayang was first established, two cycles of twelve years had elapsed. Ever observing the former principles, we now follow the grand path. The emperor declared: \"O Grove, here shall you abide.\" We have cultivated and built it, and now it stands resplendent. The sacred hall resonates with subtle echoes, pouring forth fragrance like a vase of blossoms. Jade palaces and azure tablets gleam with radiant patterns. Jeweled caskets and jade seals are draped with embroidered curtains and silken veils. Orchid lamps blaze brightly, and golden censers waft their incense. The paired teachings of the paulownia and the square mirror are both studied. Together, they testify to the purity of the heart and the impurity of the body. Departing from being and non-being, they embrace both the ornate and the plain. They are named the \"Vacuous August One,\" and their methods are those of true awakening. Medicinal omens manifest in luminous forms, and meditative resonance opens wisdom. Soaring in joy, they grasp the rainbow and tread upon light. They dispel suffering and cast off the mundane, returning to brightness and regaining their hearing. Things speak of their power, yet I see no merit of my own. Through the ages, past and present, the two realms stretch boundlessly. The three illusions deceive, yet the boat and the ravine move of themselves. Responding to destiny as it unfolds, they act without premeditation. Thus, we inscribe this in the tortoise-shell records, that gods and humans may bear witness.\n\nThe Stele of Lord Ge, Left Minister of the Grand Ultimate of Wu\n\nThat which crowns the two principles at their inception and whose name transcends the origins of the myriad things cannot be debated by speech nor fathomed by designation. If it could be described in words, how could metal and stone transmit antiquity? When it flourishes, the sun and moon shine in vain. When it is silent, mortals remain in eternal darkness. Thus, it emerged from the pass, guiding with two scrolls, and ascended, bestowing its five texts. It allowed those who embrace the numinous and hold to consciousness to know that within the unfathomable, there is essence.\n\nFrom that time onward, through successive generations, it has manifested. Cloud-script and dragon-chapters gleam upon the forest peaks. Earthly words and radiant qi flourish in the halls and courtyards. Those who could leave behind models and become the subjects of ballads and chants have continued until this day.\n\nIn the middle ages, Gan Zuo startled the King of Wei, and Xiang Feng displayed his marvels to the Lord of Wu. Yet the talent of Lord Ge was surpassingly brilliant, standing out most prominently. Though he traveled through famous mountains in his time, he often dwelt upon this ridge. This ridge is no cavern-heaven, yet it straddles the central river. To the east, peaks stretch into the sea; to the south, layered peaks pierce the clouds. To the west, the river runs clear; to the north, the outskirts of the city lie near. This is a hidden and manifest realm of mystery, a gateway for emergence and retreat. A stone well, half a fathom deep, is drawn from daily, yet its source remains unfathomable. A three-legged white muntjac, unchanged for a hundred years, embodies a purity that even spirits cannot alter and deities guard and protect. Followers of the hemp-robed lineage of the Historians have successively dwelt here. Later, his descendant Sun Weizu also inherited the residence.\n\nIn later years, Pan Hong of Shanyin (courtesy name Wensheng) resided here. From youth, he embraced the Daoist nature, his will and strength resolute and bright. Previously, he established an abbey in Yuyao, Siming, and the Kingdom of Yue, a hundred li upward, where the paths were overgrown and perilous. Yet his arts and knowledge proved useful, and the sentiments of the people turned toward him.",
      "overlap_context": "ng the people.\n\nThe true transmission has not yet been fully revealed to the world, so its details cannot be fully recounted. Master Yang, whose personal name was Xi, is fully documented in the *True Records*.\n\nDirector Xu’s third son, Xu Yufu (courtesy name Daoxiang, given name Pian), was born to his mother, née Tao Wei, who had already passed away and ascended to the Palace of Easy Transitions in the Cavern Heavens. He was of luminous intelligence and purity, surpassing all his contemporaries.",
      "start_char": 9719,
      "end_char": 10929,
      "start_sentence": 630,
      "end_sentence": 729,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.222975730895996,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "天监七年，郡邑豪旧遂相率舆出制，不由已，以此山在五县冲要，舍而留止。 于兹十有五载，将欲移憩坛上，先有一空碑，久已摧倒。 洪意以为荫其树者，尚爱其枝，死仙公真圣之遗踪，而可遂沦乎。 乃复建新碑於其所，愿勒名迩以永传。 隐居不远千里，寓斯石而镌之。 仙公姓葛，．讳玄，字孝先。 丹阳句容都乡吉阳里人也。 本属琅耶，后汉骠骑僮侯庐让国於弟来居此土。 七代祖艾，即骠骑之弟，袭封僮侯。 祖矩，安平太守，黄门郎。 从祖弥，豫章等五郡太守。 父焉，字德儒。 州主簿山阴令，散骑常侍大尚书。 代载英哲，族冠昊史。 公幼负奇操，超绝伦党。 神挺标峻，精晖卓逸。 坟典不学而知，道术才闻已了。 非复轨仪所范，思识所该。 特以域之情理之外，置之言象之表而已。 昊初，左元放自洛而来，授公白虎七变，炉火九丹，於是五通具足，化道无方。 孙权虽爱赏仙异，而内怀猜害。 翻淡之徒，皆被．挫斥。 敬惮仙公，动相谘禀。 公驰涉川岳，龙虎卫从。 长山盖竹，尤多去来。 天台兰风，是焉游憩。 时还京邑，视人如戏。 诡谲伺傥，纵倒河山。 虽投亮履坠，叱羊石起，篾以加焉。",
      "translated_text": "In the seventh year of the Tianjian era, the powerful and venerable families of the commandery and counties jointly urged him to remain, not by his own will, but because this mountain stood at the vital crossroads of five counties. Thus, he stayed for fifteen years. Intending to move his retreat to the altar above, he found an old stele already toppled and broken. Pan Hong reflected: if one cherishes the shade of a tree, how much more should one revere its branches? Could the sacred traces left by the immortal sage be allowed to vanish? He therefore erected a new stele in its place, wishing to inscribe his name upon it for eternal transmission. Though his hermitage lay a thousand *li* distant, he entrusted this stone to be carved here.\n\nThe immortal sage was surnamed Ge, personal name Xuan, courtesy name Xiaoxian. A native of Jiyang Village in Danyang’s Juyong County, he originally hailed from Langye but later settled here when his ancestor, the Marquis of Piaoxi of the Later Han, ceded his state to his younger brother. His seventh-generation ancestor, Ai, was that younger brother and inherited the title of Marquis of Piaoxi. His grandfather, Ju, served as Prefect of Anping and Gentleman of the Yellow Gate. His great-uncle, Mi, governed five commanderies, including Yuzhang. His father, Yan, styled Deru, held the posts of Registrar of the Province, Magistrate of Shanyin, Cavalier Attendant-in-Ordinary, and Grand Master of Splendid Happiness. Their lineage teemed with brilliance, its renown filling the annals of history.\n\nFrom childhood, the sage bore extraordinary conduct, surpassing all his peers. His spirit soared with lofty distinction, his essence radiant and transcendent. Though he never studied the classics, he grasped them intuitively; though he heard of Daoist arts but once, he mastered them completely. No conventional norms could restrain him, no ordinary wisdom encompass him. He dwelt beyond the bounds of human sentiment and reason, beyond the reach of words and forms.\n\nIn the early Wu era, Zuo Yuanfang arrived from Luoyang and transmitted to him the Seven Transformations of the White Tiger and the Nine Elixirs of the Furnace and Fire. Thereupon, his five spiritual penetrations became fully realized, and his transformative Dao knew no limits. Though Sun Quan admired and esteemed immortals and marvels, he harbored suspicion and malice within. Those like Yu Fan suffered rebuffs and exile, yet he stood in awe of the immortal sage, constantly seeking his counsel. The sage traversed rivers and mountains, attended by dragon and tiger retinues. He frequented Changshan and Gaizhu, and his comings and goings were especially numerous. The windswept orchids of Tiantai and the fragrant breezes of Lanfeng were his favored haunts. When he returned to the capital, he treated people as playthings, his conduct unpredictable and bold, overturning rivers and mountains at will. Whether casting his shoes into the abyss or commanding stones to rise at his rebuke, none could match his audacity.",
      "overlap_context": "storians have successively dwelt here. Later, his descendant Sun Weizu also inherited the residence.\n\nIn later years, Pan Hong of Shanyin (courtesy name Wensheng) resided here. From youth, he embraced the Daoist nature, his will and strength resolute and bright. Previously, he established an abbey in Yuyao, Siming, and the Kingdom of Yue, a hundred li upward, where the paths were overgrown and perilous. Yet his arts and knowledge proved useful, and the sentiments of the people turned toward him.",
      "start_char": 10929,
      "end_char": 11368,
      "start_sentence": 730,
      "end_sentence": 758,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.19549584388733,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "于时有人，漂海随风，眇沸无垠，忽值神岛，见人授书一函，题曰：寄葛仙公。 令归昊达之。 由是举代翕然。 号为仙公。 故抱朴着书亦云：余从祖仙。 公乃抱朴。 三代从祖也。 俗中经传所谈云：已被太极铨授居左仙公之位。 如真诰并葛氏旧谱，则事有未符，恐教迩参差，适时立说，犹如执戟侍陛。 岂谓三摘灵桃，徒见接神役鬼，安知止在散职。 一以权道推之，无所复论其同异矣。 仙公赤乌七年，太岁甲子八月十五日平旦，升仙。 长往不返，恒与郭声子等相随。 久当授任玄都，祇秩天爵，佐命四辅，理察人祇。 瞻望旧乡，能无萦囊之叹。 顾盼后学，庶垂汲引之慈。 敢藉邦族末班，仰述真仙遗则。 云尔九陕厦绝，七度虚悬。 分空置境，聚黑构天。 物滋数后，化起象前。 命随形转，神寄业传。 霜野於衰，竹梧翠微。 泉墟共往，彭羡独归。 生因事摄，年以学祈。 如金在冷，如帛在机。 ．仙公珪警，临郁发颖。 襄童比迹，项孺联影。 濯质绮闱，凝心黛岭。 虎变已据，龙轿遂骋。 竭来台霍，偃赛兰穹。 碧坛自肃，玉水不穷。 巡芳沐道，怀古恻衷。 表兹峻碣，永扇高风。 兰风寓憩，已勒丰碑。 此土旧居，未镌贞玫。 今之远裔，仰慕清尘。 敬思刊树，传芳来叶。 解官表 臣闻，尧风冲天，颖阳振饮河之谈。 汉德括地，商阴峻餐芝之气。 臣栖迟早日，簪带久年。 仕岂留荣，学非待禄。 恒思悬缨象阙，孤耕垄下。 席月涧门，横琴云际。 始奉中恩，得遂丘壑。 今便灭影桂庭，神交松友。 一出束阙，故乡就望。 蜷言兴念，临波泻泪。 臣舟棹已遗，无容躬诣。 不任仰恋之诚，谨奉表以闻。 诏答 卿遣累却粒，尚想清虚。 山中闲静，得性所乐，当善遂嘉志也。 若有所须，便可以闻。 仍赐帛十疋，烛二十挺，又别劲。",
      "translated_text": "At that time, there was a man adrift upon the sea, tossed by the winds across boundless, surging waves. Suddenly, he came upon a divine isle, where someone entrusted him with a sealed scroll, inscribed: *\"To be delivered to Master Ge the Immortal.\"* He was instructed to return to Wu and present it. From then on, the entire realm revered him as the Immortal Master. Thus, in the *Baopuzi*, it is also written: *\"My ancestor was an immortal.\"* The Master was indeed a descendant of Baopu. Three generations of his forebears were immortals. Common texts and traditions speak of him as having been appointed to the position of Left Immortal Master by the Supreme Polarity. Yet in works like the *Zhen’gao* and the old genealogies of the Ge clan, the accounts do not align. Perhaps the teachings diverged, or the circumstances of the time necessitated such claims—much like a guard bearing a halberd at the palace steps. How could one expect to pluck the sacred peaches thrice, merely to be tasked with summoning spirits and commanding ghosts, unaware that his rank remained but a minor office? Judging by the expedient Dao, there is no need to debate their discrepancies further.\n\nIn the seventh year of the Chiwu era, on the fifteenth day of the eighth month of the jiazi year, at dawn, the Immortal Master ascended to transcendence. He departed never to return, ever accompanied by Guo Shengzi and others. In time, he would be appointed to the Mysterious Capital, granted the celestial rank of a divine office, and serve as one of the Four Auxiliaries, governing and overseeing the affairs of humans and earthly spirits. Gazing back upon his former homeland, how could he not sigh with longing? Turning to later disciples, may he extend the compassion of guidance.\n\nDaring to rely upon the humble standing of his clan, I now recount the legacy of this true immortal. Thus:\n\nThe nine gorges stand severed, the seven stars hang suspended in emptiness. Space is divided to form realms, darkness gathers to construct the heavens. Things flourish in number, transformations arise in form. Life follows the turning of shapes, spirit is entrusted to the transmission of karma. Frost withers the wilds in decline, bamboo and paulownia thrive in emerald hues. Springs and ruins share a common fate, yet Peng and Xian alone return. Life is grasped through affairs, years are sought through learning. Like gold in the cold, like silk on the loom—\n\nThe Immortal Master’s jade scepter gleamed, his hidden brilliance burst forth. He matched the traces of Xiang’s boyhood, his shadow joined that of Xiang Ru. He bathed his essence in the brocade chambers, concentrated his mind upon the dark peaks. Having mastered the tiger’s transformation, he then rode the dragon’s chariot. He exhausted the heights of Tai and Huo, roamed the vastness of Lan’s vault. The azure altar purified itself, the jade waters flowed endlessly. He wandered through fragrant groves to bathe in the Dao, his heart moved with sorrow for the ancients. This towering stele stands to eternally spread his lofty virtue. The orchid winds of his favored haunts have already been engraved upon a grand monument. Yet this land, his former dwelling, remains uncarved with enduring inscriptions. Now, his distant descendants, in reverence of his pure legacy, respectfully seek to inscribe and erect this stele, that his fragrance may be transmitted to future generations.\n\n---\n\n**Petition for Resignation from Office**\n\nI have heard that the winds of Yao soared to the heavens, and Yingyang’s discourse stirred the rivers. The virtue of Han encompassed the earth, and Shangyin’s spirit soared on the breath of lingzhi. I have long dwelt in seclusion, wearing the cap and sash for many years. My service was never for glory, nor my studies for salary. I have always yearned to hang my official cords at the palace gates and till the fields alone, to sit beneath the moon at my valley door, or play the zither amid the clouds. By the grace of the central court, I was granted my wish to retire to the hills and streams. Now, I shall vanish like a shadow in the cassia courtyard, my spirit communing with the pines. Though I depart from the palace gates, my homeland remains in sight. As I coil my words in reflection, tears fall upon the waves.\n\nMy boat and oars have already been left behind; I cannot attend in person. Unable to bear the weight of my longing, I respectfully submit this petition.\n\n---\n\n**Imperial Rescript in Reply**\n\nYou have cast aside worldly burdens and grain, ever aspiring to purity and emptiness. In the tranquility of the mountains, you find joy in your true nature—may you fully realize your noble aspirations. If you have any needs, you may report them at once.\n\nAdditionally, you are granted ten bolts of silk and twenty sticks of wax. A separate gift of fine goods is also bestowed.",
      "overlap_context": "ers and mountains, attended by dragon and tiger retinues. He frequented Changshan and Gaizhu, and his comings and goings were especially numerous. The windswept orchids of Tiantai and the fragrant breezes of Lanfeng were his favored haunts. When he returned to the capital, he treated people as playthings, his conduct unpredictable and bold, overturning rivers and mountains at will. Whether casting his shoes into the abyss or commanding stones to rise at his rebuke, none could match his audacity.",
      "start_char": 11368,
      "end_char": 12043,
      "start_sentence": 759,
      "end_sentence": 813,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.713419914245605,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "朕月给上狭苓五斤，白蜜二斗以供服饵。 进周氏冥通记敌 某启去十月将末，忽有周氏事，既在斋禁，无由即得启闻。 今谨编成事迩凡四卷，如别上呈。 但某覆郭疑网，不早信悟。 追自咎悼，分贻刻责，渊文口具陈述。 伏愿，宥以间惰。 谨启。 诏答 省疏并见周，氏遗迩真言，显然符验前诰，二三明白，益为奇特。 四卷今留之，见渊文并具一二，唯增降叹。 告游篇 性灵昔既肇，绿业久相因。 即化非冥灭，在理淡悲欣。 冠剑空衣影，镳辔乃仙身。 去此昭轩倡，结彼瀛台宾。 傥能踵留辙，为子道玄津。 残文 云上之仙风赋 缥缈遥裔，一旦碧海而扬朝霞，凌青烟而溥天际。 出龙门而激水，度葱关以飞雪。 於是汉区动御，月轨惊文。 浮虚入景，登空泛云。 一举万里，曾不浃辰。 此列子有待之风也。 若乃绵括宇宙，苞络天维。 周流八极，回环四时。 气值节而动律，位涉巽而离箕。 徒见去来之绪，莫测终始之期。 此太虚无为之风也。 茅山长沙馆碑 夫万象森罗，不离两仪之育。 百法纷赓，无越三教之境。 梧绂之士，饰礼容於闱合。 耿介之夫，扬旌麾於山裔。 铭日：大哉乾元，万物资始。 皇王受命，三才乃理。 惟圣感神，惟神降祉。 德被歌锺，名昭图史。 友于兄弟，敬惟西宣。 言追茂实，用表遗先。 敢巡旧制，有革杂章。 刊石弗朽，奕代留芳。 太平山日门馆碑 日门馆者，束霞启晖，开岩引烛以为名也。 先是昊郡杜征君，声高两代，德冠四区。 教义宣流，播乎数郡。 拓宇太平之束。 结架菁山之北。 爰以此处幽奇，别就基构。 栖集有道，多历世年。 茅山曲林馆铭 层岭外峙，邃宫内映。 仄穴旁通，萦泉远镜。 尚德依仁，祈生栩命。 且天且地，若凡若圣。 连甍比栋，各谓知道。 参差经术，跌岩辞藻。 孰如曲林，独为劲好。 掩迹韬功，守兹偕老。 答谢中书书 山川之美，古来共谈。 高峰入云，清流见底。 两岸石壁，立色交晖。 青林翠竹，四时俱备。 晓雾将歇。 猿乌乱呜。 夕日欲颓，沈鳞竞跃。 实是欲界之仙都。 自康乐以来，未复有能与其奇者。 答虞仲书 栖玄翮於荆枝，望绮云於青汉者，有日于兹矣。 而春华来被，草石开鲜。 辞动情端，志交拎曲。 信知邻德之谈，无虚往椟。 夫子虽迩缠朱阁，而心期岱岭。 岂但散发乎高岫，以将飞霜於绝谷。 良为钦哉。 野人幸得托形崇阜，息影长林。 每对月流叹，临风斡慨。 徒事累可豁。 而发容难待自。 非齐生死於一致者，能不心热者乎。 举世悠悠，孰云同此。 傥遇知己，相与共忧。 谒来虞公，兹焉可迈。 何为栖栖。 空劳鼓缶。 迨及暇日，有事还童。 不亦皎洁当年，而无忸前修也。 答赵英才书 子架学区中，飞才何外。 不肯扫门觅仕，复懒弹炼求通。 故偃赛园巷，从容郊邑。 昔所谓傲宾者，此其是乎。 岩下鄙人。 守一介之志。 非敢蔑荣嗤俗，自致云霞。 盖任性灵而直往，保无用以得闲。 珑薪井汲，乐有余欢。 切松煮木，此外何务。 然亦以天地楝宇，万物同於一化，死生善恶之能闻。 相经序 相者，盖性命之着乎形骨，吉凶之表乎气貌。 亦犹事究谋而后动，心先动而后应。 表裹相感，莫知所以。 然且富贵寿夭，各值其数。 董贤甫在弱冠，便位过三公，赀半於国，而才出三十，身摧家破。",
      "translated_text": "Monthly, We grant you five *jin* of superior *fuling* and two *dou* of white honey for your regimen of ingestion.\n\n**Submission of *Zhou’s Records of Mystic Communication***\nYour servant reports: In the latter part of the tenth month, matters concerning the Zhou family arose. As I was then observing purification rites, I could not immediately submit a report. Now, I have respectfully compiled these events into four volumes, which are presented separately. Yet I, enmeshed in the web of doubt like Guo, failed to awaken to belief sooner. In remorse and self-reproach, I fear I have incurred stern censure—all is set forth in detail in the accompanying memorial. Humbly, I pray for leniency in my negligence. Respectfully submitted.\n\n**Imperial Rescript in Reply**\nWe have reviewed your memorial and seen Zhou’s posthumous revelations, which clearly fulfill earlier prophecies. The two or three instances of verification are especially wondrous. The four volumes are now retained here. As for the accompanying memorial, its every word is noted; We can only sigh in admiration.\n\n**“Announcing the Journey”**\nSince the spirit’s inception of old,\nThe green karma has long followed.\nTransformation is not annihilation;\nIn principle, sorrow and joy fade.\nCrown and sword are but empty shadows;\nThe bit and bridle belong to the immortal’s form.\nDeparting this bright chariot’s song,\nYou join the guests of Ying Terrace.\nIf you can tread the tracks left behind,\nI shall guide you to the Dao’s mystic ford.\n\n**“Rhapsody on the Wind of the Cloudborne Immortals”**\nDrifting in distant reaches,\nOne morning it soars over the azure sea, scattering dawn’s rosy clouds,\nTraversing the blue mist to fill the farthest heavens.\nIt surges through Dragon Gate, churning the waters,\nCrosses Cong Pass, whirling snow.\nThus the Han realm stirs in awe,\nThe moon’s chariot startles at its patterns.\nIt floats through the void into light,\nAscends the sky, rides the clouds.\nA single flight spans ten thousand *li*,\nYet scarcely a day passes.\nThis is the wind of Liezi—wind that depends on conditions.\n\nYet there is a wind that embraces the cosmos,\nEnvelops the pillars of heaven,\nCirculates through the eight directions,\nCycles through the four seasons.\n*Qi* stirs the pitch-pipes when the season arrives;\nIts position shifts from *xun* to *li*, from *ji* to *kun*.\nOne sees only the threads of its coming and going,\nNever the beginning or end of its term.\nThis is the wind of Great Emptiness—wind of non-action.\n\n**Stele Inscription for the Changsha Lodge at Mount Mao**\nAll the myriad forms arrayed in the world arise from the nurture of the Two Modes.\nThe hundred teachings flourish without transcending the bounds of the Three Teachings.\nScholars of the court don their ceremonial robes within palace halls;\nThe steadfast and upright raise their banners on the mountain’s edge.\n\nInscription:\nGreat is the Creative! All things depend on it for their beginning.\nKings receive the Mandate, and the Three Powers are ordered.\nOnly the sage moves the divine;\nOnly the divine bestows blessings.\nVirtue resounds in song and bell,\nNames shine in the annals of history.\nBrotherly love and reverence—\nHere, the western lands proclaim them.\nWords follow flourishing deeds,\nTo honor those who came before.\nDare we alter old customs?\nYet we have revised the miscellaneous verses.\nCarved in stone, it shall not perish,\nLeaving fragrance for generations to come.\n\n**Stele Inscription for the Sun Gate Lodge at Mount Taiping**\nThe Sun Gate Lodge takes its name from the dawn’s rays piercing the gorge, opening the crag to draw forth the torch’s light. Formerly, the Eminent Lord Du of Wu Commandery—his renown high in two dynasties, his virtue foremost in the four quarters—spread his teachings far and wide, their influence reaching several commanderies. He expanded his precincts east of Mount Taiping and built his retreat north of Jing Mountain. Finding this place secluded and wondrous, he established his foundation here. Those who dwell here in pursuit of the Dao have passed many years.\n\n**Inscription for the Quilin Lodge at Mount Mao**\nLofty ridges rise without;\nDeep halls gleam within.\nNarrow caves branch to the side;\nWinding springs mirror the distance.\nThose who esteem virtue abide in benevolence,\nSeeking life and nurturing destiny.\nNow heaven, now earth—\nNow ordinary, now sacred.\nRoofs and rafters stand side by side,\nEach claiming to know the Dao.\nTheir teachings vary,\nTheir literary styles soar or plunge.\nYet who compares to Quilin Lodge,\nAlone in its steadfast excellence?\nHere, one conceals one’s traces and veils one’s merits,\nAbiding in this place to grow old together.\n\n**Letter in Reply to the Secretary**\nThe beauty of mountains and rivers has been a shared topic since ancient times. Lofty peaks pierce the clouds; limpid streams reveal their beds. On either shore, stone cliffs glow with intermingled hues. Green forests and emerald bamboo stand complete in all four seasons. At dawn, the mist begins to disperse—monkeys and birds cry in chorus. As the evening sun inclines, fish leap in the depths. Truly, this is the immortals’ realm within the desire realm. Since Xie Lingyun’s time, none have matched its wonders.\n\n**Letter in Reply to Yu Zhong**\nFor some time now, you have perched your transcendent wings on the branches of Jing, gazing at the brocade clouds in the azure sky. Spring’s blossoms have arrived, adorning the grasses and stones with fresh beauty. Your words stir the depths of feeling; your aspirations intertwine with mine. Truly, the discourse of kindred spirits is never empty. Though you remain near the vermilion towers, your heart longs for Mount Tai. How could you merely loosen your hair in the high peaks, or scatter frost in the remote valleys? How admirable indeed!\n\nThis rustic has been fortunate to lodge his form on lofty heights, resting his shadow in the endless woods. Often, I sigh beneath the flowing moon or face the wind with deep emotion. Yet my entanglements remain unresolved, and my appearance betrays the passage of time. Unless one equates life and death as one, who could remain untroubled? The world drifts on—who shares this sentiment? If I should meet a kindred spirit, we might share our sorrows together. Since you have come, Master Yu, how could I not advance? Why wander restlessly, vainly beating the earthen jar? When leisure comes, let us attend to rejuvenation. Would this not be as radiant as in youth, free from shame before the ancients?\n\n**Letter in Reply to Zhao Yingcai**\nYou have built your learning within the realm of scholarship, yet your talent soars beyond its bounds. Unwilling to sweep your gate in search of office, you are too indolent even to refine your skills for advancement. Thus, you remain aloof in your garden lane, at ease in the countryside. This, then, is the so-called “proud guest.” As for this rustic beneath the cliffs—he guards his single-minded resolve. Not that I dare scorn glory or mock the world, but I follow my nature and go straight ahead, preserving my uselessness to gain leisure. Gathering firewood and drawing water bring me abundant joy; cutting pines and boiling herbs—what other tasks occupy me?\n\nYet the heavens and earth are a vast dwelling, and the myriad things share in a single transformation. Life and death, good and evil—how can one fathom them?\n\n**Preface to *The Classic of Physiognomy***\nPhysiognomy reveals the nature and destiny inscribed in one’s form and bones, just as fortune and misfortune are manifest in one’s *qi* and appearance. It is like acting only after thorough deliberation, or responding only after the heart has moved. Inner and outer correspond, yet none know how. Still, wealth and nobility, longevity and early death—each meets its allotted measure. Dong Xian, though barely past twenty, rose above the Three Dukes, his wealth half the nation’s. Yet before thirty, his body was broken, his family ruined.",
      "overlap_context": "person. Unable to bear the weight of my longing, I respectfully submit this petition.\n\n---\n\n**Imperial Rescript in Reply**\n\nYou have cast aside worldly burdens and grain, ever aspiring to purity and emptiness. In the tranquility of the mountains, you find joy in your true nature—may you fully realize your noble aspirations. If you have any needs, you may report them at once.\n\nAdditionally, you are granted ten bolts of silk and twenty sticks of wax. A separate gift of fine goods is also bestowed.",
      "start_char": 12043,
      "end_char": 13309,
      "start_sentence": 814,
      "end_sentence": 921,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.274131536483765,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "冯唐椅穿郎署，扬雄壁立高阁，而并至白首。 或垂老玉食，而官不过尉史。 或颖惠若神，仅至龄龄。 或不辩菽麦，更保黄苟。 此又明其偏有得也。 华阳陶隐居集卷下竟",
      "translated_text": "Feng Tang’s chair wore thin in the bureau halls, Yang Xiong stood like a wall in his lofty chamber—yet both reached hoary age. Some feast on jade viands in their twilight years, yet their rank never rises above clerk or scribe. Some are sharp as spirits in wisdom, yet barely reach their allotted span. Others cannot tell beans from wheat, yet live out their days in ease. This further shows how each attains but a partial measure.\n\n**End of *Collected Works of Tao Hongjing of Huayang*, Scroll Below**",
      "overlap_context": "tiny inscribed in one’s form and bones, just as fortune and misfortune are manifest in one’s *qi* and appearance. It is like acting only after thorough deliberation, or responding only after the heart has moved. Inner and outer correspond, yet none know how. Still, wealth and nobility, longevity and early death—each meets its allotted measure. Dong Xian, though barely past twenty, rose above the Three Dukes, his wealth half the nation’s. Yet before thirty, his body was broken, his family ruined.",
      "start_char": 13309,
      "end_char": 13386,
      "start_sentence": 922,
      "end_sentence": 927,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.798170328140259,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\华阳陶隐居集.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}