{
  "source_id": "南岳九真人传",
  "source_file": "chunked_daozang\\南岳九真人传.json",
  "total_chunks": 4,
  "total_original_chars": 2429,
  "total_translated_chars": 16280,
  "total_translation_time": 81.9629590511322,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\谱箓类\\南岳九真人传.txt",
    "category": "谱箓类"
  },
  "full_translation": "**The Transmission of the Nine Perfected of Mount Nanyue**\n\n*Scripture Title:* *The Transmission of the Nine Perfected of Mount Nanyue*\n*Composed by Liao Ni of the Song Dynasty*\n*Two texts bound in one volume.*\n*Source of the base text:* *Zhengtong Daoist Canon*, *Dongxuan Section*, *Registers and Genealogies Category*\n\n**The Transmission of the Nine Perfected of Mount Nanyue**\n*Composed by Liao Huang, Gentleman for Consultation, Cavalier Attendant-in-Ordinary, and Bearer of the Fish-Bag Emblem*\n\nOf the Perfected of Mount Nanyue, nine are renowned by name. Their ascensions occurred between the Jin and Liang dynasties, and their images remain enshrined to this day. Who can fathom the gatherings of the Perfected within the Vermilion Mound Grotto-Heaven, where they attend the True Lord of Life-Infusion, offering their aid to transform misfortune into blessing for the people?\n\nDuring the time when Sun Mian, Vice Director of the Bureau of Military Affairs, governed Changsha, he once dreamed of a Daoist-robed figure approaching him, saying: \"□. An old man surnamed Wang, along with nine companions, had their fields usurped by a neighboring abbey for over a hundred years. Under your jurisdiction, I hope you will take this to heart.\" Sun merely committed the matter to memory, unable to grasp its full meaning. Later, when he was dispatched to offer sacrifices at the mountain, he chanced upon the Nine Immortals’ Stone Altar and saw an old shrine with statues. The central figure was inscribed as \"Perfected Wang Lingyu,\" and his countenance closely resembled that of the figure in Sun’s dream. Recalling the earlier vision, Sun instructed local officials to investigate. A year later, they indeed recovered several parcels of land, clarifying the abbey’s annual usurpation of its yields and restoring them to their rightful management. If not for the Perfected’s numinous manifestation, how could this have been revealed through Sun’s dream and thus redressed? From that time, those in Hunan and Hubei who had engaged in deceit or concealment were often moved to repentance and reform upon hearing of this. Thereafter, pilgrims journeying to the Vermilion Mound feared only that they might fail to pay homage to the assembly of Perfected and beseech their blessings in due time.\n\nLast winter, the Daoist Ouyang Daolong knocked at my door seeking an audience. He said to me: \"For generations, my family has cherished the collection of immortal scriptures. By the time I came of age, more than half had been lost or scattered. Though some scrolls remain, most lack beginnings or endings. Only *The Transmission of the Nine Immortals of Mount Nanyue* survives in its proper sequence. I wish to carve printing blocks for it, alongside previously printed editions of *The Scripture of the Most High on Salvation*, *The Scripture of the Dao and Its Virtue by Laozi*, and *The Scripture of the Nine Dark Realms*, to circulate them together. May those who read them turn toward goodness and distance themselves from transgression—surely they will gain something from it. I humbly request that you, Master, compose a preface of a hundred words or so for its opening.\"\n\nAfter examining his words, I found no trace of falsity or pretense. I promptly retrieved the *Transmission of the Nine Perfected* he mentioned, excising eleven instances of redundant or convoluted passages, correcting thirty-one erroneous characters, and resolving four discrepancies in the dates of their ascensions, taking the old stele as the authoritative source. I then said to Daolong: \"I have heard that only those who trust in the Dao can truly study it; the peril of study is lack of diligence, and the peril of diligence is lack of perseverance. To study diligently and persevere long is to fulfill one’s practice and perfect one’s merit, reaching the farthest shores of attainment. Now, Daolong, you seek to cast off the myriad entanglements of the worldly, acting only to deliver others—truly, you are a person of resolve. You should strive to emulate the luminous conduct of the Perfected. The Nine Perfected began with purpose and saw it through to completion; those who mend their ways and ascend to immortality will find their places in the ranks. Thus, I have composed this preface in accordance with your request.\"\n\n**Perfected Chen**, whose personal name was Xingming, was a native of Yingchuan. In his youth, he wandered among famous mountains, seeking the traces of the Perfected at the Heavenly Pillar Peak of Mount Nanyue. There, he encountered two Perfected, both appearing to be eighteen or nineteen years old. They said to him: \"We have traversed the four seas, delivering those of resolute aspiration. Yet worldly people, though they may cultivate the Dao with temporary dedication, often falter midway and fail to persevere. How then can they ascend in bodily form to the heavens and soar through the celestial thoroughfares? Your accumulated merit is indeed commendable—only do not retreat or falter, and what worry is there that your name will not be inscribed in the golden registers and jade tablets? The bitterness of the past will give way to boundless joy, for suffering has its limit, while joy knows no end. Why is this so?\"\n\nAmidst secluded forests and valleys, dwelling in solitude with birds and beasts as companions, enduring hunger and thirst, toiling through cold and heat, forsaking worldly glory, parting from kin and abandoning love—this may indeed be called suffering. Yet to live as long as heaven and earth, to transform without limit, to ride the void and mount the empty air, to sprout wings at will—this may indeed be called joy. How then could one not strive with diligence in cultivation?\n\nXingming bowed his head and said: \"I shall forever bear in mind these sagely words, dedicating my whole heart to the Dao, never daring to slacken or neglect it.\"\n\nThereupon, the Perfected transmitted to him the Way of the Luminous Mirror and the Mysterious True. After eighteen years of cultivation, the two immortals descended once more to address him: \"Formerly, we bestowed upon you the supreme Dao, and you have indeed practiced it with diligence. Now you shall ascend to the Nine Heavens, roaming and feasting across the Eight Seas—this is the reward of your accumulated merit. Suffering first, joy after: only you have attained this.\"\n\nOn the first day of the third month in the first year of the Taishi reign of the Jin dynasty, he ascended at Yuanyang Palace.\n\nMaster Shi, whose personal name was Cun and who styled himself Master Hufu, studied under Huang Luzi and obtained the *Inner Writings of the Three Sovereigns*, which enabled him to command the protection of tigers and leopards. Dwelling in the stone chamber of the cave gate on the western peak of Mount Heng, he would sometimes ride forth on a white leopard, so that those who admired him rarely gained close access.\n\nIn the first year of the Yongkang reign of the Jin dynasty, on the seventh day of the fourth month, he ascended.\n\nMaster Yin, whose personal name was Daoquan, was a native of Tianshui. On the rear peak of Mount Heng at the Hengyue Abbey, he cultivated the *Dao of the Cavernous Perfection for Returning the Spirit and Penetrating Vision*, and concurrently bore the talismans of the Five Thearchs and the Six Jia spirits for summoning the left and right numinous chariots. A celestial perfected descended and addressed him, saying: \"Those who ascend in broad daylight must first possess the requisite talent before achieving the Way. In former times, Emperor Wu of Han, moved by the Supreme Perfection and Golden Mother, received the *Twelve Numinous Flights of the True Forms of the Five Marchmounts*, yet he only attained the *Dao of Liberating the Corpse*, unable to make both form and bones take flight together. You have received but one of these arts and yet harbor the hope of *ascending through the void*—this is the fruit of your diligent toil and also the lot of your predestined portion.\"\n\nDaoquan replied: \"This humble one’s learning is shallow and unworthy; I beseech you to reveal its essentials.\"\n\nThe celestial perfected said: \"From the talismans of the Five Thearchs and the Six Jia spirits for summoning the left and right numinous flights, down to the *Zhang Scripture of the Primordial Cavern and Radiant Meng*, the matters and items are arranged in twelve successive stages. As for the *True Forms of the Five Marchmounts*, they are charts made by observing the mountains’ orientations and reversals, the sources of their spring fluids, the locations of their hidden metals and treasures, and the courses of their subterranean veins. Moreover, the officials, soldiers, and transcendents who govern talismans, charts, and the bureaus of the immortals are legion. You have obtained the numinous talismans and received the *True Forms of the Arrayed Marchmounts*; by believing in and reverently upholding them, you have achieved resonance and communion. Thus you know that the descendants of *Wenshi* and the clans of *Taihe* have, generation after generation, produced divine transcendents. I shall await you above the Nine Pures within the primordial vastness.\"\n\nWith these words, he departed.\n\nDuring the Jin dynasty, Dao Master Quan resided in the mountains and ascended to the heavens in broad daylight on the ninth day of the first month in the ninth year of the Yongjia era. The Perfected Master Xu, whose personal name was Lingqi, was a man of the Song dynasty. He cultivated the Dao on Mount Nanyue, spending many years traversing its grottoes and ravines, as well as all the mountain valleys, for fifteen years without exception. In his *Record of Mount Heng*, he wrote: \"Heavenly Pillar Peak stands four thousand one hundred *zhang* high, bearing the stele inscriptions of Yu the Great’s flood-control efforts, all in tadpole script. Purple Canopy Peak is often graced by white cranes circling its summit, where divine mushrooms and sacred herbs grow. Beneath it lies a stone chamber, within which an incense burner, mortar and pestle, and alchemical crucible remain intact. Upon Vermilion Brightness Peak stands a jade altar of azure hue, beside which grows a purple pear tree. Though its fruit ripens, none may partake of it.\" His account of the grotto-palaces and marvels was exceedingly detailed, yet it remains unknown what Dao Lingqi cultivated. He could subdue tigers and leopards, command ghosts and spirits, and on the ninth day of the ninth month in the second year of the Yuanhui era of the Qi, he ascended to the heavens in broad daylight from the Upper Clarity Palace.\n\nThe Perfected Master Chen, whose personal name was Huidu, cultivated the Dao and refined elixirs at the Jade Clarity Abbey. From dawn to dusk, he was tested by mountain spirits, and though his three attempts at forging the elixir crucible failed, his resolve only grew more steadfast. When the elixir was finally completed, he ingested it and ascended to the heavens on the thirteenth day of the fifth month in the second year of the Yongming era of the Jin.\n\nThe Perfected Master Zhang, whose personal name was Tanyao, resided at the Summoning Transcendents Abbey, where his concentrated contemplation resonated with the Celestial Perfected. They secretly descended to transmit to him the Dao of Internal Nourishment, the Primal Harmony, and the Silent Audience before the Great Emperor. After practicing it for thirteen years, his spirit roamed the Great Void, where he faced the August Ultimate Great Emperor and was bestowed with the Jade Essence, the Numinous Elixir of Radiant Fusion. Having received and ingested it, his transformations became unfathomable, and his spiritual efficacy knew no bounds. On the thirteenth day of the seventh month in the first year of the Yanxing era of the Qi, he ascended to the heavens.\n\nThe Perfected Master Zhang, whose personal name was Shizhen, was a native of Nanyang. Residing on Mount Nanyue, he encountered immortals who descended to transmit to him the Dao of the Luminous Mirror, instructing him to cultivate it. They said: \"That which illuminates the principles of things is Heaven. That which reflects the forms of things is the mirror. The Dao of Heaven is clarity; the essence of the mirror is brightness. If one can embody Heaven’s clarity and the mirror’s brightness, calming the heart and settling the spirit to achieve inner and outer luminous transparency, then the supreme Dao is attained. But if one inwardly exhausts their intellect and outwardly wearies their form, with a heart uncalm and spirit unclear, they are far from the Dao.\" He had once received this teaching from Master Changsang, who said: \"The essentials of this Dao are secretly guarded by the Celestial Emperor of the Great Tenuity’s Central Heaven. Those who obtain it achieve profound penetration and distant illumination of the Eight Extremities. Among the methods of the Cavern of Perfection, there is the Dao of the Four Regulations, practiced in accordance with the four seasons, which is of the same essence as this.\" The ancients said: \"Empty your chamber, and brightness will arise of itself; settle your heart, and the Dao will come of itself.\" Truly, these words are trustworthy. Shizhen cultivated this for nine years and attained mastery, gaining the ability to see clearly for a thousand *li*, with nothing hidden from his sight. On the thirteenth day of the eleventh month in the third year of the Tianjian era of the Liang, he ascended to the heavens in broad daylight from the Nine Transcendents Abbey.\n\nThe Perfected Master Wang, whose personal name was Lingyu, was a Daoist from Jiujiang who devoted himself earnestly to the Dao. Initially residing on Five Elders Peak, a divine person spoke to him at night, saying: \"One who seeks the Dao but does not dwell in the proper place is like planting the five grains in sand and stone—they cannot come to fruition. Even if one possesses the bones for ascending flight, one must first find a blessed land and numinous site; only then can transformation occur. Though one may accumulate virtue to enrich the land and amass merit to grow wings, if the place is not fitting, demons will corrupt one’s efforts, and the Dao will never be attained.\" Lingyu asked which place would be suitable for dwelling, and was told: \"The upper peaks of Vermilion Mound and the neighboring ridges of Purple Canopy—there one may ascend to the heavens.\" Thereupon, he moved from Mount Lu to reside in the Central Abbey of Mount Nanyue. After twelve years, a host of Perfected Ones descended to welcome him, and on the thirteenth day of the seventh month in the eleventh year of the Tianjian era of the Liang, he ascended from the altar.\n\nThe Perfected Master Deng, whose personal name was Yuzhi, was once a friend of Xu Lingqi and traveled with him through the sacred mountains. During the Yuanhui era of the Song, when Master Xu ascended to the heavens from the Upper Clarity Abbey, Yuzhi lingered among the immortal mountains. After many years, Emperor Wu of the Liang, having heard of his cultivation but lacking the necessary cinnabar and minerals, issued an edict granting him resources and permitted him to establish three abbeys—upper, middle, and lower—on Mount Lushan as places for refinement. A divine person spoke to him, saying: \"Within the grotto-gate lies a land of fortune-summoning and life-prolonging; remember this well and do not forget.\" When his elixir was completed, he returned to reside east of Purple Canopy Peak. On the thirtieth day of the twelfth month in the eleventh year of the Tianjian era of the Liang, eight Perfected Ones descended in a cloud chariot with feathered canopies into his chamber—these were the eight Perfected Ones who had previously attained the Dao and ascended. On that day, they invited Yuzhi to ascend with them from the natural stone altar into the heavens. Later, an imperial decree of the Han dynasty established an abbey there, selecting Daoists to oversee its offerings. By the Xiantong era of the Tang, Zhang Guan, the prefect of Hengzhou, petitioned for the site to be named the Nine Transcendents’ Stone Altar of Purple Canopy Peak, and his request was granted.\n\nHere ends the *Traditions of the Nine Perfected Ones of Mount Nanyue*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "南岳九真人传 经名：南岳九真人传。 宋廖倪撰。 二书同卷。 底本出处：《正统道藏》洞玄部谱录类。 南岳九真人传 奉议郎玫仕骑都尉赐徘鱼袋廖恍撰 南岳真人，名之着者有九。 其升举时代，即晋宋齐梁问，今像设依然。 孰测真人问会朱陵洞天，朝奉注生真君，有所赞辅，与民人转祸为福也。 自本朝枢密使孙沔椅事长沙日，尝梦衣道士服者诣前日□．老叟姓王，朋侪九人，有田产为别观占佃百余年。 在公部下，幸一存意。 沔第默志于心，未能详也。 及奉命祠岳，偶游九仙石坛，睹其老屋塑像，位於中者榜曰王灵舆真人，与向之梦中告语者道貌略同。 沔追忆前事，故委县官推究。 逾年，果得若干土田属邻观岁收地利因而申明，勒还旧管。 自非灵显感通，何缘发於沔梦寐而有所伸矣？ 谅兹时少警湘楚，问涉於欺隐者，往往悔责祈於自新。 自是四方至朱陵者，惟恐谒款群真乞灵后时也。 去年冬，道士欧阳道隆款扉求见，谓余日：道隆私门数世喜藏仙书，及道隆晓人事时，散坠过半。 虽复卷轴存者，悉无首尾，惟《南岳九仙传》次第存焉。 姑欲楼板与前此所印施《太上度人经》、《老子道德经》、《九幽经》兼行於世，使观者迁善远罪，必有得焉师愿为书百余言，冠其篇首。 余审语论由，中非涉浮伪，疾索所谓九真人传者，削其叔说稠迭者十有一处，正其字体谬误者三十有一，又较升举年月不同者四，取旧碑为定。 复语道隆曰：尝闻信道故能学，学患不能勤，勤患不能久。 学而勤，勤而久，行满功成，远到有涯矣。 今道隆欲出俗累万端，非济度於人而不为，真有志之士也。 宜乎勉旋景行，九真人有初有终，补仙者阅位，则副野夫委曲作序云尔。 陈真人，讳兴明，颖川人也。 少游名山，周访真迹於南岳天柱峰，遇二真人，年可十八九，自云：我历行四海，度有志之士，以世人修道暂能专精，中道而废，不能勤久，何由擢形云天，飞冲霄衢矣汝之积功亦可嘉也，第勿退败，何虑不列名于金台玉籍？ 前苦后乐，苦即有极，乐即无穷。 何者？",
      "translated_text": "**The Transmission of the Nine Perfected of Mount Nanyue**\n\n*Scripture Title:* *The Transmission of the Nine Perfected of Mount Nanyue*\n*Composed by Liao Ni of the Song Dynasty*\n*Two texts bound in one volume.*\n*Source of the base text:* *Zhengtong Daoist Canon*, *Dongxuan Section*, *Registers and Genealogies Category*\n\n**The Transmission of the Nine Perfected of Mount Nanyue**\n*Composed by Liao Huang, Gentleman for Consultation, Cavalier Attendant-in-Ordinary, and Bearer of the Fish-Bag Emblem*\n\nOf the Perfected of Mount Nanyue, nine are renowned by name. Their ascensions occurred between the Jin and Liang dynasties, and their images remain enshrined to this day. Who can fathom the gatherings of the Perfected within the Vermilion Mound Grotto-Heaven, where they attend the True Lord of Life-Infusion, offering their aid to transform misfortune into blessing for the people?\n\nDuring the time when Sun Mian, Vice Director of the Bureau of Military Affairs, governed Changsha, he once dreamed of a Daoist-robed figure approaching him, saying: \"□. An old man surnamed Wang, along with nine companions, had their fields usurped by a neighboring abbey for over a hundred years. Under your jurisdiction, I hope you will take this to heart.\" Sun merely committed the matter to memory, unable to grasp its full meaning. Later, when he was dispatched to offer sacrifices at the mountain, he chanced upon the Nine Immortals’ Stone Altar and saw an old shrine with statues. The central figure was inscribed as \"Perfected Wang Lingyu,\" and his countenance closely resembled that of the figure in Sun’s dream. Recalling the earlier vision, Sun instructed local officials to investigate. A year later, they indeed recovered several parcels of land, clarifying the abbey’s annual usurpation of its yields and restoring them to their rightful management. If not for the Perfected’s numinous manifestation, how could this have been revealed through Sun’s dream and thus redressed? From that time, those in Hunan and Hubei who had engaged in deceit or concealment were often moved to repentance and reform upon hearing of this. Thereafter, pilgrims journeying to the Vermilion Mound feared only that they might fail to pay homage to the assembly of Perfected and beseech their blessings in due time.\n\nLast winter, the Daoist Ouyang Daolong knocked at my door seeking an audience. He said to me: \"For generations, my family has cherished the collection of immortal scriptures. By the time I came of age, more than half had been lost or scattered. Though some scrolls remain, most lack beginnings or endings. Only *The Transmission of the Nine Immortals of Mount Nanyue* survives in its proper sequence. I wish to carve printing blocks for it, alongside previously printed editions of *The Scripture of the Most High on Salvation*, *The Scripture of the Dao and Its Virtue by Laozi*, and *The Scripture of the Nine Dark Realms*, to circulate them together. May those who read them turn toward goodness and distance themselves from transgression—surely they will gain something from it. I humbly request that you, Master, compose a preface of a hundred words or so for its opening.\"\n\nAfter examining his words, I found no trace of falsity or pretense. I promptly retrieved the *Transmission of the Nine Perfected* he mentioned, excising eleven instances of redundant or convoluted passages, correcting thirty-one erroneous characters, and resolving four discrepancies in the dates of their ascensions, taking the old stele as the authoritative source. I then said to Daolong: \"I have heard that only those who trust in the Dao can truly study it; the peril of study is lack of diligence, and the peril of diligence is lack of perseverance. To study diligently and persevere long is to fulfill one’s practice and perfect one’s merit, reaching the farthest shores of attainment. Now, Daolong, you seek to cast off the myriad entanglements of the worldly, acting only to deliver others—truly, you are a person of resolve. You should strive to emulate the luminous conduct of the Perfected. The Nine Perfected began with purpose and saw it through to completion; those who mend their ways and ascend to immortality will find their places in the ranks. Thus, I have composed this preface in accordance with your request.\"\n\n**Perfected Chen**, whose personal name was Xingming, was a native of Yingchuan. In his youth, he wandered among famous mountains, seeking the traces of the Perfected at the Heavenly Pillar Peak of Mount Nanyue. There, he encountered two Perfected, both appearing to be eighteen or nineteen years old. They said to him: \"We have traversed the four seas, delivering those of resolute aspiration. Yet worldly people, though they may cultivate the Dao with temporary dedication, often falter midway and fail to persevere. How then can they ascend in bodily form to the heavens and soar through the celestial thoroughfares? Your accumulated merit is indeed commendable—only do not retreat or falter, and what worry is there that your name will not be inscribed in the golden registers and jade tablets? The bitterness of the past will give way to boundless joy, for suffering has its limit, while joy knows no end. Why is this so?\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 787,
      "start_sentence": 0,
      "end_sentence": 30,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.217437744140625,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\南岳九真人传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "林谷幽栖，禽兽为伍，饥渴毕至，寒暑辛勤，割世辞荣，离亲舍爱，可谓苦也。 寿同天地，变化无方，策空乘虚，坐生羽翼，可谓乐也。 得不勉於修励乎，兴明拜首日：永佩圣言，毕志於道，不敢息忽也。 遂授明镜玄真之道。 修之十八年，二仙复降以告之曰：昔我授汝至道，果能勤行，今则登蹑九天，游宴八海，积功之报也。 前苦后乐，惟子得之矣。 以晋太始元年三月一日於元阳宫升举。 施真人，讳存，号胡浮先生。 师黄卢子，得三皇内文驱策虎豹之卫。 居衡岳西峰洞门观石室，或跨白豹而出，爱慕者罕得亲近。",
      "translated_text": "Amidst secluded forests and valleys, dwelling in solitude with birds and beasts as companions, enduring hunger and thirst, toiling through cold and heat, forsaking worldly glory, parting from kin and abandoning love—this may indeed be called suffering. Yet to live as long as heaven and earth, to transform without limit, to ride the void and mount the empty air, to sprout wings at will—this may indeed be called joy. How then could one not strive with diligence in cultivation?\n\nXingming bowed his head and said: \"I shall forever bear in mind these sagely words, dedicating my whole heart to the Dao, never daring to slacken or neglect it.\"\n\nThereupon, the Perfected transmitted to him the Way of the Luminous Mirror and the Mysterious True. After eighteen years of cultivation, the two immortals descended once more to address him: \"Formerly, we bestowed upon you the supreme Dao, and you have indeed practiced it with diligence. Now you shall ascend to the Nine Heavens, roaming and feasting across the Eight Seas—this is the reward of your accumulated merit. Suffering first, joy after: only you have attained this.\"\n\nOn the first day of the third month in the first year of the Taishi reign of the Jin dynasty, he ascended at Yuanyang Palace.\n\nMaster Shi, whose personal name was Cun and who styled himself Master Hufu, studied under Huang Luzi and obtained the *Inner Writings of the Three Sovereigns*, which enabled him to command the protection of tigers and leopards. Dwelling in the stone chamber of the cave gate on the western peak of Mount Heng, he would sometimes ride forth on a white leopard, so that those who admired him rarely gained close access.",
      "overlap_context": "may cultivate the Dao with temporary dedication, often falter midway and fail to persevere. How then can they ascend in bodily form to the heavens and soar through the celestial thoroughfares? Your accumulated merit is indeed commendable—only do not retreat or falter, and what worry is there that your name will not be inscribed in the golden registers and jade tablets? The bitterness of the past will give way to boundless joy, for suffering has its limit, while joy knows no end. Why is this so?\"",
      "start_char": 787,
      "end_char": 1018,
      "start_sentence": 31,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.784000635147095,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\南岳九真人传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "晋永康元年四月七日升举。 尹真人，讳道全，天水人也。 於衡岳观后峰修洞真还‘神彻视之道，兼佩五帝六甲左右灵乘之符。 天真降焉，谓之日：白日升腾者，当有其才而后成其道。 昔汉武帝感太真金母授五岳真形灵飞十二事，才得尸解之道，而不能使形骨俱飞。 汝受#1其一事而有冲举之望，斯乃勤苦所资，亦宿分所值矣。 道全曰：浅学无闻，愿示其要。 天真日：上自五帝六甲左右灵飞之符，洎混洞束蒙之丈，事目次第而有十二。 及五岳真形，取其山之向背，泉液之所出，金宝之所藏，隧脉之所通而为之图也。 况主符图吏兵仙曹，职宰者众矣。 汝得灵符及受列岳真形，能自信奉而获感通，乃知文始之裔，太和之族，世有神仙矣。 与汝期於九清之上，混茫之中。 言讫而去。",
      "translated_text": "In the first year of the Yongkang reign of the Jin dynasty, on the seventh day of the fourth month, he ascended.\n\nMaster Yin, whose personal name was Daoquan, was a native of Tianshui. On the rear peak of Mount Heng at the Hengyue Abbey, he cultivated the *Dao of the Cavernous Perfection for Returning the Spirit and Penetrating Vision*, and concurrently bore the talismans of the Five Thearchs and the Six Jia spirits for summoning the left and right numinous chariots. A celestial perfected descended and addressed him, saying: \"Those who ascend in broad daylight must first possess the requisite talent before achieving the Way. In former times, Emperor Wu of Han, moved by the Supreme Perfection and Golden Mother, received the *Twelve Numinous Flights of the True Forms of the Five Marchmounts*, yet he only attained the *Dao of Liberating the Corpse*, unable to make both form and bones take flight together. You have received but one of these arts and yet harbor the hope of *ascending through the void*—this is the fruit of your diligent toil and also the lot of your predestined portion.\"\n\nDaoquan replied: \"This humble one’s learning is shallow and unworthy; I beseech you to reveal its essentials.\"\n\nThe celestial perfected said: \"From the talismans of the Five Thearchs and the Six Jia spirits for summoning the left and right numinous flights, down to the *Zhang Scripture of the Primordial Cavern and Radiant Meng*, the matters and items are arranged in twelve successive stages. As for the *True Forms of the Five Marchmounts*, they are charts made by observing the mountains’ orientations and reversals, the sources of their spring fluids, the locations of their hidden metals and treasures, and the courses of their subterranean veins. Moreover, the officials, soldiers, and transcendents who govern talismans, charts, and the bureaus of the immortals are legion. You have obtained the numinous talismans and received the *True Forms of the Arrayed Marchmounts*; by believing in and reverently upholding them, you have achieved resonance and communion. Thus you know that the descendants of *Wenshi* and the clans of *Taihe* have, generation after generation, produced divine transcendents. I shall await you above the Nine Pures within the primordial vastness.\"\n\nWith these words, he departed.",
      "overlap_context": "irst year of the Taishi reign of the Jin dynasty, he ascended at Yuanyang Palace.\n\nMaster Shi, whose personal name was Cun and who styled himself Master Hufu, studied under Huang Luzi and obtained the *Inner Writings of the Three Sovereigns*, which enabled him to command the protection of tigers and leopards. Dwelling in the stone chamber of the cave gate on the western peak of Mount Heng, he would sometimes ride forth on a white leopard, so that those who admired him rarely gained close access.",
      "start_char": 1018,
      "end_char": 1321,
      "start_sentence": 41,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.725945234298706,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\南岳九真人传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "道全晋时居山，至永嘉九年正月九日白日升举。 徐真人，讳灵期，宋时人也。 修道於南岳，岁久，遍游岳之岩洞及诸山谷，一十五年，无不周览。 作《衡山记》云：天柱峰高四千一百丈，有夏禹治水碑铭，皆科斗文字。 紫盖峰常有白鹤翔集其顶，而神芝灵草生焉。 又言有石室在其下，香炉、臼杵、丹宠具存。 祝融峰上有碧玉坛，傍生紫梨木，虽子熟，人莫得而食之。 其所记洞府胜异甚详，竟不知灵期所修何道。 能制伏虎豹，役使鬼神，以元徽二年甲寅九月九日於上清宫白日升举。 陈真人，讳慧度。 修道炼丹於玉清观，早暮为山精所试，三结丹炉，其志愈勤。 及丹成，服之。 以晋永明二年五月十三日升举。 张真人，讳昙要。 居招仙观精思，感通天真，密降授其内养元和默朝大帝之道。 行之十三年，神游太空，面朝皇极大帝，赐以琼实琅膏混神合景之液。 受而服之，变化不测，神用无方。 以齐延兴元年七月十三日升举。 张真人，讳始珍，南阳人也。 居南岳，遇神仙降授明镜之道，使其修之。 日：夫照物理者，天也。 照物形者，镜也。 天之道以清，镜之体以明。 人能存天清镜明、澄心静神而内外洞朗，则至道成矣。 若以内役其智，外劳其形，心不澄，神不清者，去道远矣。 吾昔受之於长桑公子云：此道要秘於太微中天帝所，得之能洞达玄通，遐照八极。 夫洞真法中有四规之道，依四时而行之，亦与此同体尔。 古人所谓虚其室则白自生，定其心则道自至。 信哉，言乎。 始珍修之九年而成，洞视千里，无一物可隐。 以梁天监三年十一月十三日於九仙宫白日升举。 王真人，讳灵舆，九江道士也，勤志於道。 初居五老峰，神人夜中谓之日：得道者若非其地，如植五谷於砂石之问，则不能成矣，虽有升飞之骨，当得福地灵墟，尔后可以变化。 虽累德以为土地，积功以为羽翼，苟非其所，魔坏其功，兹道无由成矣。 灵舆问何地可以栖止，日：朱陵之上峰、紫盖之邻岫，可以冲天矣。 遂自庐阜迁居南岳之中宫。 一十二年，群真下迎，以梁天监十一年七月十三日就坛升举。 邓真人，讳郁之。 昔与徐灵期为友，周游灵山。 宋元徽年中，徐君於上清官升天，郁之徘徊仙山。 岁久，梁帝闻其修道而阙丹石之备，诏赐物力，许於岳麓山置上中下三观为修炼之所。 有神人告语日：洞门之中是招福之乡、延生之地，善记勿忘。 丹成，复回居紫盖峰东。 以梁天监十一年壬辰十二月三十日，有八真人乘云车羽盖降于室中，即前得道升举者八真人也，於是日揖郁之就自然石坛同升霄。 汉后有朝旨，为之官字，择道士以主熏奉。 至唐咸通年，衡州刺史张观陈乞赐号紫盖峰九仙石坛，如其所请焉。 南岳九真人传竟 #1『受』原作一授织据文义改。",
      "translated_text": "During the Jin dynasty, Dao Master Quan resided in the mountains and ascended to the heavens in broad daylight on the ninth day of the first month in the ninth year of the Yongjia era. The Perfected Master Xu, whose personal name was Lingqi, was a man of the Song dynasty. He cultivated the Dao on Mount Nanyue, spending many years traversing its grottoes and ravines, as well as all the mountain valleys, for fifteen years without exception. In his *Record of Mount Heng*, he wrote: \"Heavenly Pillar Peak stands four thousand one hundred *zhang* high, bearing the stele inscriptions of Yu the Great’s flood-control efforts, all in tadpole script. Purple Canopy Peak is often graced by white cranes circling its summit, where divine mushrooms and sacred herbs grow. Beneath it lies a stone chamber, within which an incense burner, mortar and pestle, and alchemical crucible remain intact. Upon Vermilion Brightness Peak stands a jade altar of azure hue, beside which grows a purple pear tree. Though its fruit ripens, none may partake of it.\" His account of the grotto-palaces and marvels was exceedingly detailed, yet it remains unknown what Dao Lingqi cultivated. He could subdue tigers and leopards, command ghosts and spirits, and on the ninth day of the ninth month in the second year of the Yuanhui era of the Qi, he ascended to the heavens in broad daylight from the Upper Clarity Palace.\n\nThe Perfected Master Chen, whose personal name was Huidu, cultivated the Dao and refined elixirs at the Jade Clarity Abbey. From dawn to dusk, he was tested by mountain spirits, and though his three attempts at forging the elixir crucible failed, his resolve only grew more steadfast. When the elixir was finally completed, he ingested it and ascended to the heavens on the thirteenth day of the fifth month in the second year of the Yongming era of the Jin.\n\nThe Perfected Master Zhang, whose personal name was Tanyao, resided at the Summoning Transcendents Abbey, where his concentrated contemplation resonated with the Celestial Perfected. They secretly descended to transmit to him the Dao of Internal Nourishment, the Primal Harmony, and the Silent Audience before the Great Emperor. After practicing it for thirteen years, his spirit roamed the Great Void, where he faced the August Ultimate Great Emperor and was bestowed with the Jade Essence, the Numinous Elixir of Radiant Fusion. Having received and ingested it, his transformations became unfathomable, and his spiritual efficacy knew no bounds. On the thirteenth day of the seventh month in the first year of the Yanxing era of the Qi, he ascended to the heavens.\n\nThe Perfected Master Zhang, whose personal name was Shizhen, was a native of Nanyang. Residing on Mount Nanyue, he encountered immortals who descended to transmit to him the Dao of the Luminous Mirror, instructing him to cultivate it. They said: \"That which illuminates the principles of things is Heaven. That which reflects the forms of things is the mirror. The Dao of Heaven is clarity; the essence of the mirror is brightness. If one can embody Heaven’s clarity and the mirror’s brightness, calming the heart and settling the spirit to achieve inner and outer luminous transparency, then the supreme Dao is attained. But if one inwardly exhausts their intellect and outwardly wearies their form, with a heart uncalm and spirit unclear, they are far from the Dao.\" He had once received this teaching from Master Changsang, who said: \"The essentials of this Dao are secretly guarded by the Celestial Emperor of the Great Tenuity’s Central Heaven. Those who obtain it achieve profound penetration and distant illumination of the Eight Extremities. Among the methods of the Cavern of Perfection, there is the Dao of the Four Regulations, practiced in accordance with the four seasons, which is of the same essence as this.\" The ancients said: \"Empty your chamber, and brightness will arise of itself; settle your heart, and the Dao will come of itself.\" Truly, these words are trustworthy. Shizhen cultivated this for nine years and attained mastery, gaining the ability to see clearly for a thousand *li*, with nothing hidden from his sight. On the thirteenth day of the eleventh month in the third year of the Tianjian era of the Liang, he ascended to the heavens in broad daylight from the Nine Transcendents Abbey.\n\nThe Perfected Master Wang, whose personal name was Lingyu, was a Daoist from Jiujiang who devoted himself earnestly to the Dao. Initially residing on Five Elders Peak, a divine person spoke to him at night, saying: \"One who seeks the Dao but does not dwell in the proper place is like planting the five grains in sand and stone—they cannot come to fruition. Even if one possesses the bones for ascending flight, one must first find a blessed land and numinous site; only then can transformation occur. Though one may accumulate virtue to enrich the land and amass merit to grow wings, if the place is not fitting, demons will corrupt one’s efforts, and the Dao will never be attained.\" Lingyu asked which place would be suitable for dwelling, and was told: \"The upper peaks of Vermilion Mound and the neighboring ridges of Purple Canopy—there one may ascend to the heavens.\" Thereupon, he moved from Mount Lu to reside in the Central Abbey of Mount Nanyue. After twelve years, a host of Perfected Ones descended to welcome him, and on the thirteenth day of the seventh month in the eleventh year of the Tianjian era of the Liang, he ascended from the altar.\n\nThe Perfected Master Deng, whose personal name was Yuzhi, was once a friend of Xu Lingqi and traveled with him through the sacred mountains. During the Yuanhui era of the Song, when Master Xu ascended to the heavens from the Upper Clarity Abbey, Yuzhi lingered among the immortal mountains. After many years, Emperor Wu of the Liang, having heard of his cultivation but lacking the necessary cinnabar and minerals, issued an edict granting him resources and permitted him to establish three abbeys—upper, middle, and lower—on Mount Lushan as places for refinement. A divine person spoke to him, saying: \"Within the grotto-gate lies a land of fortune-summoning and life-prolonging; remember this well and do not forget.\" When his elixir was completed, he returned to reside east of Purple Canopy Peak. On the thirtieth day of the twelfth month in the eleventh year of the Tianjian era of the Liang, eight Perfected Ones descended in a cloud chariot with feathered canopies into his chamber—these were the eight Perfected Ones who had previously attained the Dao and ascended. On that day, they invited Yuzhi to ascend with them from the natural stone altar into the heavens. Later, an imperial decree of the Han dynasty established an abbey there, selecting Daoists to oversee its offerings. By the Xiantong era of the Tang, Zhang Guan, the prefect of Hengzhou, petitioned for the site to be named the Nine Transcendents’ Stone Altar of Purple Canopy Peak, and his request was granted.\n\nHere ends the *Traditions of the Nine Perfected Ones of Mount Nanyue*.",
      "overlap_context": "overn talismans, charts, and the bureaus of the immortals are legion. You have obtained the numinous talismans and received the *True Forms of the Arrayed Marchmounts*; by believing in and reverently upholding them, you have achieved resonance and communion. Thus you know that the descendants of *Wenshi* and the clans of *Taihe* have, generation after generation, produced divine transcendents. I shall await you above the Nine Pures within the primordial vastness.\"\n\nWith these words, he departed.",
      "start_char": 1321,
      "end_char": 2376,
      "start_sentence": 54,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.235575437545776,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\南岳九真人传.txt",
        "category": "谱箓类"
      }
    }
  ]
}