{
  "source_id": "古易考原",
  "source_file": "chunked_daozang\\古易考原.json",
  "total_chunks": 16,
  "total_original_chars": 19624,
  "total_translated_chars": 105712,
  "total_translation_time": 501.8792190551758,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**Ancient Investigations into the Origins of the *Yi*: The Title and Authorship**\n\n*Ancient Investigations into the Origins of the Yi* (*Gǔ Yì Kǎo Yuán*). Composed by Méi Zú of the Ming dynasty. Three fascicles. Base text from the *Wanli Continuation of the Daoist Canon*.\n\n**Fascicle One of *Ancient Investigations into the Origins of the Yi*: The Hexagrams of Fuxi**\n\nThe Master said: \"The virtue of the hexagrams is square and knowing; knowing conceals what has passed.\" He also said: \"The *Yi* accords with Heaven and Earth, and thus can encompass the Dao of Heaven and Earth.\" Looking up to observe the patterns of Heaven, looking down to examine the principles of Earth—thus one knows the causes of the hidden and the manifest. Tracing things to their origin and returning to their end, one knows the explanations of life and death. Essence and *qi* become things; wandering souls bring about change—thus one knows the conditions of ghosts and spirits. He further said: \"It is stirred by thunder and lightning, moistened by wind and rain; the sun and moon move in their courses, alternating between cold and heat. The Dao of *Qian* completes the male; the Dao of *Kun* completes the female. *Qian* knows the great beginning; *Kun* brings things to fruition. *Qian* is easy to know; *Kun* is simple in its power.\" All these speak of the *Yi* of Fuxi’s hexagrams. Only because he first created them do we know the hexagrams that conceal within them the principles of all things in Heaven and Earth that have passed. Only then can the *Yi* of milfoil divination be put to use.\n\nThe *Yi* of the Three Dynasties all elucidated the *Yi* of Fuxi’s milfoil divination, employing it for the purpose of divination, yet none reached the *Yi* of the hexagrams. Only the Master alone attained the *Yi* of the hexagrams. Thus, in composing this work, *Investigations into the Origins*, I begin with the *Yi* of Fuxi’s hexagrams, to further the Master’s intent. Later Confucians, not understanding this meaning, claimed that the *Zhou Yi* was a late addition, asking, \"What was the original basis of our ancestors?\" How could such thoughts befit the dignity of their forebears?\n\n**1. The First Creation of the Eight Trigrams**\nThe *Appended Judgments* state: \"In ancient times, when Fuxi ruled all under Heaven, he looked up to observe the patterns of Heaven and looked down to examine the principles of Earth; he observed the markings of birds and beasts and the suitability of the land. Drawing near, he took from his own body; from afar, he took from things. Thereupon, he first created the eight trigrams to communicate the power of the numinous and to categorize the conditions of the myriad things.\"\n\nZú says: Looking up to observe the images of Heaven and creating trigrams—such as *Qian* for Heaven, *Li* for the sun, *Zhen* for thunder, *Xun* for wind, *Kan* for the moon, clouds, and the Dipper’s radiance; looking down to observe the principles of Earth and creating trigrams—such as *Kun* for Earth, *Dui* for marsh, *Gen* for mountain, and *Kan* for water; observing the markings of birds and beasts—such as *Qian* representing the dragon, fine horses, and old horses; *Kun* representing the child and the cow; *Zhen* representing the dragon and the neighing horse; *Xun* representing the kite; *Kan* representing the pig and the horse with a fine back; *Li* representing the ox, pheasant, crab, tiger, and leopard; *Gen* representing the dog and rat; *Dui* representing the sheep; observing the suitability of the land to create trigrams—such as *Qian* representing fruit-bearing trees; *Zhen* representing green grains, bamboo, reeds, crops, reverse growth, and luxuriant freshness; *Xun* representing wood and poplar; *Kan* wood representing hardness, many cores, ridgepoles, thorny thickets, and lush grasses; *Li* wood representing hollow upper parts and withered stalks; *Gen* wood representing hardness and many knots.\n\n\"Drawing near, he took from his own body\"—this does not refer only to the eight bodily parts but includes all eight categories, such as being a ruler or a father. \"From afar, he took from things\"—this does not refer only to clothing, food, utensils, and tools but includes all enumerated things, even to the myriad, such as gardens, jade, metal, cold, ice, greatness, and redness.\n\nFuxi’s classic trigrams number eight, and their variations number sixty-four. Now, it is only said that he \"created the eight trigrams\" because the classic encompasses the variations. Why is it said that the classic encompasses the variations? *Qian* is the classic trigram; if one takes *Qian* as *Qian*, then *Dui-Qian*, *Li-Qian*, *Zhen-Qian*, *Xun-Qian*, *Kan-Qian*, *Gen-Qian*, and *Kun-Qian*—the eight variations of *Qian*—are all encompassed. The same applies to the seven trigrams below *Dui*. Thus, *Qian*, *Gou*, *Dayou*, *Dazhuang*, *Xiaoxu*, *Xu*, *Daxu*, and *Tai* are said to derive from the first creation of *Qian*. *Lǚ*, *Dui*, *Kui*, *Guimei*, *Zhongfu*, *Jie*, *Sun*, and *Lin* derive from the first creation of *Dui*. *Tongren*, *Ge*, *Li*, *Feng*, *Jiaren*, *Jiji*, *Guai*, and *Mingyi* derive from the first creation of *Li*. *Wuwang*, *Sui*, *Shike*, *Zhen*, *Yi*, *Tun*, *Yi*, and *Fu* derive from the first creation of *Zhen*. *Heng*, *Daguo*, *Ding*, *Huan*, *Xun*, *Jing*, *Gu*, and *Sheng* derive from the first creation of *Xun*. *Song*, *Kun*, *Weiji*, *Xie*, *Jie*, *Kan*, *Meng*, and *Shi* derive from the first creation of *Kan*. *Lü*, *Xian*, *Lǚ*, *Xiaoguo*, *Jian*, *Jian*, *Gen*, and *Qian* derive from the first creation of *Gen*. *Pi*, *Cui*, *Jin*, *Yu*, *Guan*, *Bi*, *Bo*, and *Kun* derive from the first creation of *Kun*.\n\nThe sagely mind of Fuxi embraced the images of Heaven and the principles of Earth, the movements of animals and the stillness of plants, the nearness of the body and the distance of things—all were stored within. Only then did he create the eight trigrams to bequeath them to later generations under Heaven. Thus, the wonder of his trigrams encompasses the images and principles of Heaven and Earth, the movements of animals and the stillness of plants, the body and things—all principles are complete therein. They subtly assist the numinous and give rise to divination, communicating the power of the numinous and devising implements to emulate images, taking freely and sufficiently to categorize the conditions of the myriad things.\n\nHan Confucians claimed that he drew the trigrams following the *Hetu*, while Song Confucians claimed that seeing a turtle could suffice to draw the trigrams—all these are baseless conjectures, failing to perceive Fuxi’s essence and not glimpsing the Master’s intent. Those who go to extremes even claim that he first created the eight trigrams of three lines, and that King Wen later doubled them into sixty-four hexagrams. I resolutely reject all such claims, precisely for this reason.\n\nNow, I arrange their diagrams to the left.\n\n*Qian* below, *Qian* above, still named *Qian*.\nZú says: This is the classic trigram *Qian*.\n\n*Qian* below, *Dui* above, named *Guai*.\n*Qian* below, *Li* above, named *Dayou*.\n*Qian* below, *Zhen* above, named *Dazhuang*.\n\n*Qian* below, *Xun* above, named *Xiaochu*.\n*Qian* below, *Kan* above, named *Xu*.\n*Qian* below, *Gen* above, named *Dachu*.\n*Qian* below, *Kun* above, named *Tai*.\nZú says: From *Qian* below to *Tai* are its derivative *Qian* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Qian* trigram. The primary *Qian* trigram is rightly called the beginning, so it is fitting that *Qian* was first created. But why are all its derivative hexagrams also called \"created *Qian*\"? When *Qian* is below, it serves as the master within, with the eight trigrams added above to elucidate *Qian*’s variations—hence they are collectively named \"created *Qian*.\" Yet when *Qian* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Dui* below, *Qian* above, named *Lǚ*.\n*Dui* below, *Dui* above, still named *Dui*.\nZú says: This is the primary *Dui* trigram.\n\n*Dui* below, *Li* above, named *Kuí*.\n*Dui* below, *Zhen* above, named *Guī*.\n*Dui* below, *Xun* above, named *Zhongfu*.\n*Dui* below, *Kan* above, named *Jié*.\n*Dui* below, *Gen* above, named *Sǔn*.\n*Dui* below, *Kun* above, named *Lín*.\nZú says: From *Lǚ* to *Lín* are its derivative *Dui* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Dui* trigram. The primary *Dui* trigram is rightly called the beginning, so it is fitting that *Dui* was first created. But why are all its derivative hexagrams also called \"created *Dui*\"? When *Dui* is below, it serves as the master within, with the eight trigrams added above to elucidate *Dui*’s variations—hence they are collectively named \"created *Dui*.\" Yet when *Dui* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Li* below, *Qian* above, named *Tongren*.\n*Li* below, *Dui* above, named *Gé*.\n*Li* below, *Li* above, still named *Li*.\nZú says: This is the primary *Li* trigram.\n\n*Li* below, *Zhen* above, named *Fēng*.\n*Li* below, *Xun* above, named *Jiaren*.\n*Li* below, *Kan* above, named *Jìjì*.\n*Li* below, *Gen* above, named *Bì*.\n*Li* below, *Kun* above, named *Mingyi*.\nZú says: From *Tongren* to *Mingyi* are its derivative *Li* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Li* trigram. The primary *Li* trigram is rightly called the beginning, so it is fitting that *Li* was first created. But why are all its derivative hexagrams also called \"created *Li*\"? When *Li* is below, it serves as the master within, with the eight trigrams added above to elucidate *Li*’s variations—hence they are collectively named \"created *Li*.\" Yet when *Li* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Xun* below, *Qian* above, named *Gòu*.\n*Xun* below, *Dui* above, named *Daguo*.\n*Xun* below, *Li* above, named *Dǐng*.\n*Xun* below, *Zhen* above, named *Héng*.\n*Xun* below, *Xun* above, still named *Xun*.\nZú says: This is the primary *Xun* trigram.\n\n*Xun* below, *Kan* above, named *Jǐng*.\n*Xun* below, *Gen* above, named *Gǔ*.\n*Xun* below, *Kun* above, named *Shēng*.\nZú says: From *Gòu* to *Shēng* are its derivative *Xun* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Xun* trigram. The primary *Xun* trigram is rightly called the beginning, so it is fitting that *Xun* was first created. But why are all its derivative hexagrams also called \"created *Xun*\"? When *Xun* is below, it serves as the master within, with the eight trigrams added above to elucidate *Xun*’s variations—hence they are collectively named \"created *Xun*.\" Yet when *Xun* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Kan* below, *Qian* above, named *Sòng*.\n*Kan* below, *Dui* above, named *Kùn*.\n*Kan* below, *Li* above, named *Wèijì*.\n*Kan* below, *Zhen* above, named *Xiè*.\n*Kan* below, *Xun* above, named *Huàn*.\n*Kan* below, *Kan* above, still named *Kan*.\nZú says: This is the primary *Kan* trigram.\n\n*Kan* below, *Gen* above, named *Méng*.\n*Kan* below, *Kun* above, named *Shī*.\nZú says: From *Sòng* to *Shī* are its derivative *Kan* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Kan* trigram. The primary *Kan* trigram is rightly called the beginning, so it is fitting that *Kan* was first created. But why are all its derivative hexagrams also called \"created *Kan*\"? When *Kan* is below, it serves as the master within, with the eight trigrams added above to elucidate *Kan*’s variations—hence they are collectively named \"created *Kan*.\" Yet when *Kan* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Gen* below, *Qian* above, named *Dùn*.\n*Gen* below, *Dui* above, named *Xián*.\n*Gen* below, *Li* above, named *Lǚ*.\n*Gen* below, *Zhen* above, named *Xiaoguo*.\n*Gen* below, *Xun* above, named *Jiàn*.\n*Gen* below, *Kan* above, named *Jiǎn*.\n*Gen* below, *Gen* above, still named *Gen*.\nZú says: This is the primary *Gen* trigram.\n\n*Gen* below, *Kun* above, named *Qiān*.\nZú says: From *Dùn* to *Qiān* are its derivative *Gen* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Gen* trigram. The primary *Gen* trigram is rightly called the beginning, so it is fitting that *Gen* was first created. But why are all its derivative hexagrams also called \"created *Gen*\"? When *Gen* is below, it serves as the master within, with the eight trigrams added above to elucidate *Gen*’s variations—hence they are collectively named \"created *Gen*.\" Yet when *Gen* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Kun* below, *Qian* above, named *Pǐ*.\n*Kun* below, *Dui* above, named *Cuì*.\n*Kun* below, *Li* above, named *Jìn*.\n*Kun* below, *Zhen* above, named *Yù*.\n*Kun* below, *Xun* above, named *Guān*.\n*Kun* below, *Kan* above, named *Bǐ*.\n*Kun* below, *Gen* above, named *Bō*.\n*Kun* below, *Kun* above, still named *Kun*.\nZú says: This is the primary *Kun* trigram.\nIt is also said: From *Pǐ* to *Kun* are its derivative *Kun* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Kun* trigram. The primary *Kun* trigram is rightly called the beginning, so it is fitting that *Kun* was first created. But why are all its derivative hexagrams also called \"created *Kun*\"? When *Kun* is below, it serves as the master within, with the eight trigrams added above to elucidate *Kun*’s variations—hence they are collectively named \"created *Kun*.\" Yet when *Kun* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n**Circular Movement of the Eight Trigrams**\nThe *Shuogua* states: \"Heaven and Earth take their positions; mountain and marsh exchange qi; thunder and wind press upon each other; water and fire do not clash.\"\n\nMoreover, it states: \"In counting what has passed, one follows the sequence.\"\n\nZú says: This speaks of Fuxi’s sixty-four hexagrams in their circular movement. Though only the eight trigrams are mentioned, the primary forms are cited to encompass their derivatives. Heaven takes its position in the south, and its eight derivative heavens all take position in the south. Earth takes its position in the north, and its eight derivative earths all take position in the north. Mountain exchanges qi in the northwest, and its eight derivative mountains all exchange qi in the northwest. Marsh exchanges qi in the southeast, and its eight derivative marshes all exchange qi in the southeast. Thunder presses upon in the northeast, and its eight derivative thunders all press upon in the northeast. Wind presses upon in the southwest, and its eight derivative winds all press upon in the southwest. Water does not clash in the west, and its eight derivative waters all do not clash in the west. Fire does not clash in the east, and its eight derivative fires all do not clash in the east. The names of the hexagrams are not specified because the Master invariably spoke in terms of images.\n\nFormer scholars believed this referred solely to the eight trigrams of three lines, but this is incorrect. Why is it said that \"in counting what has passed, one follows the sequence\"? Heaven’s position is in the south; moving left from the south, one passes through heaven, then marsh, then fire, then thunder; moving right from the south, one passes through wind, then water, then mountain, then earth—all proceeding from south to north, from above to below. Thus it is said: the positions of what has already passed are fixed in sequence, following without reversal, as they have been from antiquity to the present.\n\n**Rectangular Arrangement of the Eight Trigrams**\nThe *Shuogua* states: \"The eight trigrams intermingle; in knowing what is to come, one moves in reverse—thus the *Yi* reckons in reverse.\"\n\nIt further states: \"Thunder moves them; wind disperses them; rain moistens them; the sun warms them; *Gen* halts them; *Dui* delights them; *Qian* rules them; *Kun* conceals them.\"\n\nZú says: This speaks of Fuxi’s sixty-four hexagrams in their rectangular arrangement. Though only the eight trigrams are mentioned, the primary forms are again cited to encompass their derivatives. The eight trigrams intermingle, building upon the circular movement of heaven and earth, mountain and marsh, thunder and wind, water and fire, now intersecting one another in a rectangular array.\n\nShao Yaofu believed that the eight trigrams in the preceding passage referred to the three-line trigrams, and that only when they intermingled—each of the eight trigrams being overlaid with another eight—did the sixty-four hexagrams emerge. Thus he took \"intermingling\" to mean \"layering.\" But to conflate intermingling with layering is mistaken. Otherwise, this passage, which speaks of thunder moving things, would pertain solely to the rectangular arrangement of the eight trigrams, with no reference to intermingling. This would imply that the circular movement encompasses the sixty-four hexagrams, while the rectangular arrangement includes only the eight trigrams—a manifestly incoherent claim.\n\nThunder moves things in the middle left; wind disperses things in the middle right. Their eight derivative thunders all move things in the middle left, and their eight derivative winds all disperse things in the middle right. Rain moistens things next to wind; the sun warms things next to thunder. Their eight derivative rains all moisten things next to wind, and their eight derivative suns all warm things next to thunder. *Gen* halts things next to rain; *Dui* delights things next to the sun. Their eight derivative *Gen* all halt things next to rain, and their eight derivative *Dui* all delight things next to the sun. *Qian* rules things, residing in the north; *Kun* conceals things, residing in the south. Their eight derivative *Qian* all rule things in the north, and their eight derivative *Kun* all conceal things in the south.\n\nThough the relative positions of the hexagrams remain the same as in the preceding passage, their order and sequence differ greatly. In the earlier passage, heaven and earth held the first positions; here, *Li* and *Kan* occupy the center, while *Qian* and *Kun* bring up the rear—thus heaven and earth intermingle with water and fire. In the earlier passage, mountain and marsh held the second position; here, *Gen* and *Dui* occupy the third—thus mountain and marsh intermingle with thunder and wind. In the earlier passage, thunder and wind held the second position; here, they occupy the center—thus thunder and wind intermingle with heaven and earth. In the earlier passage, water and fire held the fourth position; here, rain and sun occupy the second—thus water and fire intermingle with mountain and marsh.\n\nExamined in further detail: Heaven is in the south and earth in the north, but now *Qian* is in the north and *Kun* in the south—thus *Qian* and *Kun* intermingle. Marsh is in the southeast and mountain in the northwest, but now *Dui* is next to the north and *Gen* next to the south—thus *Dui* and *Gen* intermingle. Fire is in the east and water in the west, but now the sun is next to the north and rain next to the south—thus *Li* and *Kan* intermingle. Thunder is in the northeast and wind in the southwest, but now thunder moves in the north-center and wind disperses in the south-center—thus *Zhen* and *Xun* intermingle. Proceeding from *Qian* to *Dui*, then *Li*, *Zhen*, *Xun*, *Kan*, *Gen*, and *Kun*—all move from north to south, from below to above. Thus it is said: \"In knowing what is to come, one moves in reverse.\"\n\nBecause the phrase \"the eight trigrams intermingle\" in the preceding passage was too concise to be clear, these eight sentences are listed in detail to elucidate the meaning of rectangular intermingling. Yet former scholars all claimed that in the circular movement, *Qian*, *Dui*, *Li*, and *Zhen* represent \"counting what has passed in sequence,\" while *Kun*, *Gen*, *Kan*, and *Xun* represent \"knowing what is to come in reverse\"—a view that does not hold. For in Fuxi’s sequence of hexagrams, from *Qian* to *Kun*, there was never any such distinction of sequence. The Master’s intent was merely to borrow the circular movement’s sequence and the rectangular arrangement’s reversal to illuminate the *Xici*’s meaning: \"Wisdom conceals what has passed; spirit knows what is to come.\" The diagram is now presented below.\n\n**Fuxi’s Rectangular Diagram of the Sixty-Four Hexagrams**\nZú says: Scholars have kept this secret among the diviners, and only with Chen Xiyi was it transmitted to Shao Yaofu, who first elucidated it. Such claims are profoundly thoughtless. The Master’s words shine as brightly as the sun and stars. Fuxi originally used the hexagrams, while the Master spoke in terms of images to expound upon them—thus without reflection, one cannot grasp their essence. For this reason, the diagram is presented in detail below, so that later generations may know that what the diviners kept secret originated in the Master’s words and is beyond doubt.\n\nAs for those who arrange the three-line trigrams into directional diagrams, this is not Fuxi’s original truth, nor did the Master ever speak of it. Thus, it has now been removed to avoid misleading later generations.\n\nThese two diagrams embody the principle of yin-yang correspondence. The circular form represents yang, the square yin; the circular moves as heaven, the square rests as earth.\n\nZú says: From *Qián* (Heaven) to *Dì-Qián* (Earth-Heaven), the eight trigrams position heaven in the south. From *Kūn* (Earth) to *Dì-Kūn* (Earth-Earth), the eight trigrams position earth in the north. From *Gèn* (Mountain) to *Dì-Gèn* (Earth-Mountain), the eight trigrams convey that mountains channel qi in the northwest. From *Duì* (Marsh) to *Dì-Duì* (Earth-Marsh), the eight trigrams convey that marshes channel qi in the southeast. From *Zhèn* (Thunder) to *Dì-Zhèn* (Earth-Thunder), the eight trigrams convey that thunder clashes in the northeast. From *Xùn* (Wind) to *Dì-Xùn* (Earth-Wind), the eight trigrams convey that wind clashes in the southwest. From *Lí* (Fire) to *Dì-Lí* (Earth-Fire), the eight trigrams convey that fire does not oppose itself in the east. From *Kǎn* (Water) to *Dì-Kǎn* (Earth-Water), the eight trigrams convey that water does not oppose itself in the west.\n\nIn this circular arrangement of the sixty-four hexagrams, all proceed from south to north, from above to below—thus it is called \"sequential.\" The eight hexagrams of *Zhèn* (Thunder) animate beings; the eight of *Xùn* (Wind) disperse them—this is the spring of living things. The eight of *Kǎn* (Rain) moisten beings; the eight of *Lí* (Sun) warm them—this is the summer of growing things. The eight of *Gèn* (Mountain) halt beings; the eight of *Duì* (Marsh) delight them—this is the autumn of harvesting things. The eight of *Qián* (Heaven) govern beings; the eight of *Kūn* (Earth) store them—this is the winter of concealing things.\n\nIn this square arrangement of the sixty-four hexagrams, all proceed from north to south, from below to above—thus it is called \"reversal.\" The *Xiāntiān* (Pre-Heaven) diagrams transmitted by Master Shao originated from this.\n\nAbove, the horizontal diagram is presented first, followed by the circular and square diagrams—thus Fuxi’s hexagrammatic *Yi* may be examined in this way.\n\n*Ancient Yi Textual Origins, Volume One* concludes here.\n\n---\n\nThe *Yi* of Fuxi’s Milfoil Divination\n\nThe Master said: \"The virtue of milfoil is round and spirit-like; through spirit, it knows what is to come.\" He also said: \"It resembles heaven and earth, thus it does not transgress. Its knowledge pervades the myriad things, and its Dao aids the world—thus it does not err. It moves broadly without dissipation, delights in heaven and knows fate—thus it is without sorrow. Content with its place and earnest in benevolence, it can love—thus its spirit is without limit.\"\n\nHe further said: \"Heaven is noble, earth is humble—*Qián* and *Kūn* are thus established. The humble and noble are arrayed—ranks and positions are thus determined. Movement and stillness have constancy—firmness and softness are thus decided. Things gather by kind, beings divide into groups—good and ill fortune thus arise. In heaven, images form; on earth, shapes take form—transformation and change are thus manifest.\" Therefore, firmness and softness grind against each other, and the eight trigrams surge together. All these speak of Fuxi’s *Yi* of milfoil divination.\n\nOnly by possessing the round, spirit-like art of milfoil divination can one seek the principles of heaven, earth, and the myriad things within the hexagrams that conceal the past. Only then can the future’s good and ill fortune, regrets and humiliations be known. Thus, this work of textual origins follows with the *Yi* of Fuxi’s milfoil divination.\n\n**The River Chart (First)**\nThe *Xici* says: \"The Yellow River brought forth the Chart; the Luo River brought forth the Writing—sages took them as models.\" It also says: \"Heaven-one, earth-two; heaven-three, earth-four; heaven-five, earth-six; heaven-seven, earth-eight; heaven-nine, earth-ten. Heaven’s numbers are five, earth’s numbers are five; the five positions interact and each has its union. Heaven’s numbers total twenty-five; earth’s numbers total thirty. Together, heaven and earth’s numbers total fifty-five. This is how transformations are accomplished and the spirits operate.\"\n\nZú says: Sages took the River Chart as the model for generating milfoil divination, just as they took the Luo Writing as the model for turtle-shell divination. Following the preceding statement that \"nothing is greater than milfoil and turtle-shell divination,\" both the River Chart and Luo Writing are thus mentioned. The *Book of Han: Treatise on Pitch Pipes and Calendar* quotes this passage from \"heaven-one\" to \"the spirits operate\" as sixty-four continuous characters. After Bān Gù (Mèngjiān), it is unclear when Gāo Dì placed the twenty characters from \"heaven-one\" to \"earth-ten\" in the later chapter. Now, following the Chéng-Zhū school, the misplaced bamboo slips are corrected. This is what is called the numerical pattern of the River Chart.\n\nA dragon-horse emerged from the Yellow River, its back bearing swirling hair arranged in circular patterns like stars—hence it is called a \"chart,\" and since it emerged from the river, it is called the \"River Chart.\" Generally, the numbers of the world begin with one and are completed by ten—nothing exceeds ten. Adding one to one makes ten; adding ten to one makes two. From this ten arise hundreds, thousands, ten thousands, and all numbers beyond ten.\n\nYet the numbers of the River Chart differ. Heaven-one is one; when heaven-three is added to heaven-one, it becomes four. One obtains one, three obtains three, and three unites with one. When heaven-five is added, it interacts with one and three to form nine. When heaven-seven is added, it interacts with one, three, and five to form sixteen. When heaven-nine is added, it interacts with one, three, five, and seven to form twenty-five. Five is called the proper number of heaven; twenty is called the extended number. Though it is said to extend to twenty, in truth it does not exceed heaven’s five.\n\nEarth-two is two; when earth-four is added to two, it becomes six. Two obtains two, four obtains four, and two unites with four. When earth-six is added, it interacts with two and four to form twelve. When earth-eight is added, it interacts with two, four, and six to form twenty. When earth-ten is added, it interacts with two, four, six, and eight to form thirty.\n\nFive is called the proper number of earth; twenty-five is called the extended number. Though it is said to extend to twenty-five, in truth it does not exceed earth’s five.\n\nThe sum of heaven’s and earth’s numbers is fifty-five. Ten is called the proper number of heaven and earth; forty-five is called the extended number of heaven and earth. Yet the extended number does not exceed ten. Though it does not exceed ten, it extends to fifty-five. Thus, heaven’s numbers, originally odd, transform through yang to become yin; earth’s numbers, originally even, transform through yin to become yang. Through these fifty-five numbers, completion and transformation, contraction and expansion, coming and going—its subtlety is inexhaustible. Through these fifty-five numbers, the Dao flows.\n\nHow could the sage Fuxi fail to take this as the number of the Great Expansion, using it to manipulate milfoil stalks and divine the hexagrams? The method of taking it follows below.\n\n**The Great Expansion, Second Chapter**\nThe number of the Great Expansion is fifty; its use is forty-nine. Divide them into two to symbolize the Two (yin and yang); suspend one to symbolize the Three (heaven, earth, and humanity); count them by fours to symbolize the four seasons; return the remainders to the beginning to symbolize intercalary months. Five years require two intercalations, hence the second counting follows the suspension.\n\nThe commentary states: This continues the preceding discussion, explaining how Fuxi took the numbers of the River Chart to manipulate milfoil stalks and divine the hexagrams. The River Chart’s heavenly numbers, five, extend to twenty-five; its earthly numbers, five, extend to thirty. Yet this still does not exhaust the full extent of the extension. Thus, Fuxi took the River Chart and further expanded its principles to ninety-nine.\n\nThe Great Expansion: one and two make three; two and three make five; three and four make seven; four and five make nine. Combining three, five, seven, and nine yields twenty-four. Then, five and six make eleven, with one residing in the center. Further, six and seven make thirteen; seven and eight make fifteen; eight and nine make seventeen; nine and ten make nineteen. Combining three, five, seven, and nine again yields twenty-four. Together with the tens from eleven, thirteen, fifteen, seventeen, and nineteen—five tens in all—this forms the essential number of the Great Expansion, hence it is said, “The number of the Great Expansion is fifty.” Combining the first twenty-four, the latter twenty-four, and the one in the center totals forty-nine, which is the operational number of the Great Expansion, hence it is said, “its use is forty-nine.” Though it extends to ninety-nine, it does not exceed the range from heaven-one to earth-ten. This is why it serves as the extended number of the River Chart and the ultimate number of the Great Expansion.\n\nThe Master (Confucius) introduced the term “extension” to elucidate the meaning of the River Chart, adding the word “Great” to clarify Fuxi’s principle of taking the River Chart. The sage’s brushwork is like the work of creation—its subtlety is inexhaustible, yet it is simple and easily understood. Is this not truly so?\n\nThe method of manipulating milfoil stalks seeks their changes: some take their words, some their use, some their essence. Though fifty is the Great Expansion of the River Chart, it remains static within change and the essence within use, hence it is set aside and unused. Forty-nine, however, is change within change and use within use, thus it is specifically employed to manipulate milfoil stalks and divine the hexagrams.\n\nCounting from one to the left and right, all are one, three, five, seven, nine—the five heavenly numbers, the pure and unadulterated essence of Qian, free from the impurity of yin’s even numbers. The two sets of twenty-four before and after symbolize the division into two. The one residing in the center symbolizes the suspension of one. The four instances of three, five, seven, and nine symbolize counting by fours. The second set of three, five, seven, and nine symbolizes the second counting. All arise from the natural patterns of heaven’s mechanism, without the slightest interference of human effort or private knowledge.\n\nHere we see the divine craftsmanship of Fuxi’s creation—its marvels surpass what ordinary reason can fathom. The Lianshan and Guicang systems, followed by the Xia, Shang, and Zhou dynasties, all adhered to this method. Though their sequences varied, their principles did not transgress this foundation.\n\nNow, the Jin scholars, drawing on the principles of Laozi and Zhuangzi to interpret the *Book of Changes*, claim: “The forty-nine stalks represent the fifty with one left unused. Leaving one unused symbolizes the Supreme Ultimate.” The Supreme Ultimate is the pivot of creation, the root of transformation, the wondrous union of principle and qi in the myriad things—it is never absent for even a moment. Yet they single out one stalk, cast it aside into an unused box, and relegate it to stillness. This implies that creation and the myriad things sometimes lack a pivot or root, and that principle and qi may at times be separated. Meanwhile, the operations of “suspending two, hanging one, counting by fours, and returning the remainders” are all managed by the forty-nine stalks, while the Supreme Ultimate, the single stalk, idly rests in its box, oblivious to its role in unifying all. Is it not less useful than the forty-nine stalks? Their theory is truly perverse.\n\nThe set-aside stalk and the forty-nine stalks in use are identical in length and size. Yet by casually setting aside one stalk, they arbitrarily transform an instrument into the Dao, alter its form into principle, and exalt it as the Supreme Ultimate, venerating it as divinely subtle beyond compare. How fortunate for it! Meanwhile, the forty-nine stalks in use lose their pivot, sever their root, and toil busily in external operations, unable to rival the set-aside stalk. How profoundly unfortunate for them! This further reveals the absurdity of the Jin scholars’ interpretation of the classic.\n\nMoreover, the River Chart’s extended number is fifty-five. Yet the Great Expansion reduces it by five—how can it still be called the Great Expansion?\n\nZhuo observes: According to the *Book of Han·Treatise on the Five Agents*, Liu Xin states: \"Fu Xi received the River Chart and accordingly drew the Eight Trigrams.\" This refers to that. \"Yu regulated the floodwaters and was granted the Luo Writing, from which he arranged the *Great Plan*.\" This refers to that. Master Shao says: \"The circular represents the stars. Does the reckoning of celestial cycles originate here? The square represents the earth. Do the methods of dividing lands and well-fields derive from this?\" The circular belongs to the numbers of the River Chart. The square belongs to the patterns of the Luo Writing. Thus, Fu Xi and King Wen relied on them to create the *Changes*, while Yu and Ji used them to compose the *Plan*.\n\nMaster Wu says: \"The River Chart emerged when a dragon-horse appeared in the River, its coat bearing spiral markings that formed these ten numbers. The Luo Writing emerged when a divine tortoise appeared in the Luo, its shell’s cracks forming these nine numbers. As the spiral markings resembled the round dots of stars, it was called a *Chart*. As the cracks resembled the vertical and horizontal strokes of writing, it was called a *Writing*. The River Chart’s horse differed from ordinary horses only in that its coat’s spirals formed these ten numbers. The Luo Writing’s tortoise differed from ordinary tortoises only in that its shell’s cracks formed these nine numbers. Even today, horses’ coats bear spirals resembling star-dots, though they do not form these ten numbers. Even today, tortoises’ shells bear cracks resembling written strokes, though they do not form these nine numbers.\"\n\nMaster Zheng says: \"The River produces the Chart, possessing natural images. The Luo produces the Writing, possessing natural patterns.\" Zhuo says: \"Fu Xi used the River Chart to generate the milfoil stalks and the Luo Writing to create the tortoise-shell divination. The principle of the River Chart is precisely the Great Expansion. Here, the Chart is presented to the left. The principle of the Luo Writing remains unclear. Later, during the time of the divine Yu, the Luo also produced a Writing, which Yu used to arrange the *Plan*. In the reign of King Cheng, the Chenbao River Chart was kept in the eastern chamber. Confucius also said: 'The River does not produce the Chart,' pairing it with the phoenix and black crow as auspicious signs of sage-kings. How venerable! Heaven One, Heaven Three, Heaven Five, Heaven Seven, Heaven Nine—these five positions interact and each has its correspondence. The heavenly numbers total twenty-five. These five positions are the five heavenly numbers in five positions, thus interacting and each having correspondence, expanding to twenty-five. Earth Two, Earth Four, Earth Six, Earth Eight, Earth Ten—these five positions interact and each has its correspondence. The earthly numbers total thirty. These five positions are the five earthly numbers in five positions, thus interacting and each having correspondence, expanding to thirty. The total of heavenly and earthly numbers is fifty-five. The heavenly numbers are merely five, yet they expand to twenty combinations, totaling twenty-five—never exceeding the five numbers. The earthly numbers are merely five, yet they expand to twenty-five combinations, totaling thirty—also never exceeding the five numbers. The sum of heavenly and earthly numbers, fifty-five, likewise never exceeds the total of the five positions from Heaven One to Earth Ten, which together form ten numbers. Yet it yields an additional fifty-five numbers, as if the Writing had redundant text. Thus, I call it the River Chart’s extended numbers.\"\n\nZhuo says: \"The Han scholars interpreted 'five positions interacting and each having correspondence' as the interactions and correspondences of One and Six, Two and Seven, Three and Eight, Four and Nine, Five and Ten. If this were so, it should be called *ten positions*, not *five positions*. Moreover, they should have immediately connected this to the total of heavenly and earthly numbers, fifty-five, rather than further dividing them into twenty-five heavenly numbers and thirty earthly numbers. Since they have already divided them, it is clear that the five heavenly positions refer to the five heavenly numbers above, and the five earthly positions refer to the five earthly numbers above. They cannot then be interpreted as ten positions interacting and having correspondence. These are all errors in the Han scholars’ exegesis of the classic, which must not go uncorrected.\n\nEleven tens, thirteen tens, fifteen tens, seventeen tens, nineteen tens—five instances of ten form the essential numbers of the Great Expansion. The preceding and following twenty-four make forty-eight, with one residing in the center. Together, they form forty-nine, the operational numbers of the Great Expansion. Setting aside the essential numbers and using only the operational numbers involves the methods of suspending one, dividing into two, counting four, and repeated manipulation. This further arises from the purity of heavenly (odd) numbers, avoiding the impurity of earthly (even) admixtures. This is why Fu Xi adopted it for the people’s use.\"\n\nZhuo says: \"Confucius praised the subtlety of the River Chart’s numbers, saying: 'This is how transformations are completed and spirits are set in motion.' He also said: 'One who knows the Way of transformation knows where the spiritual acts.' Again: 'The spiritual is without direction.' Again: 'The unfathomable in yin and yang is called the spiritual.' Again: 'Obscurely assisting the numinous brightness to generate the milfoil, weighing heaven and earth to rely on numbers.' Again: 'Communicating the virtue/power of the numinous brightness.' Nowhere did he speak of using it to draw the Eight Trigrams. This was Liu Xin’s delusion, which earlier scholars mistakenly followed. Thus, I have specially created this diagram to elucidate Confucius’ intent. Readers should reflect deeply upon it.\"\n\n**Third: Establishing Trigrams and Generating Lines through Milfoil Divination**\nThe virtue/power of the milfoil is circular and spiritual; seven sevens make it circular. The virtue/power of the trigrams is square and knowing; eight eights make it square. The meaning of the six lines lies in the *Changes*’ capacity to inform: the nine and six (yang and yin lines) alternate in hardness and softness to convey messages to people. The sage uses this to purify the heart, retiring and concealing it in secrecy. With this milfoil divination and six lines, he purifies his heart of worldly concerns, gathering and concealing it in a place of stillness and depth. Fortune and misfortune are shared with the people as common afflictions. The spiritual knows what is to come; knowing conceals what has passed. How could the sage’s heart, unable to forget the people’s afflictions, retire and conceal itself in secrecy? The spiritual power of the milfoil knows fortune and misfortune before they arrive; the knowing of the trigrams conceals the fixed principles of fortune and misfortune. That it does not speak of the lines’ capacity to inform is because this is encompassed by the trigrams’ knowing.\"\n\nThe people seek divination through milfoil to obtain hexagrams, hastening toward fortune and avoiding misfortune. Thus, the sage’s heart is no longer burdened with worry and can retire and conceal itself in secrecy—who else could achieve this? The ancients who embodied perfect clarity, divine martial prowess yet refrained from killing were none other than Fuxi. Therefore, he understood the Dao of Heaven and examined the people’s circumstances, raising forth sacred objects to guide their use. These sacred objects refer to the milfoil. The sage used them in purification rites to spiritually illuminate his virtue. Concentrated refinement is called *zhai* (fasting); dispersed vigilance is called *jie* (abstinence). The sage lodged his spirit in the virtue of the milfoil and his clarity in the virtue of the hexagrams. Without purification rites, he could not summon his own spiritual illumination to spiritually illuminate his virtue.\n\nThus, closing the door is called *Kun*; grasping the milfoil in hand. Opening the door is called *Qian*; dividing the milfoil to cast. One closing and one opening is called *change*. The casting of milfoil undergoes one change, and its endless coming and going is called *penetration*. The varying quantities of milfoil are difficult to fix, so what appears is called *image*. After three changes of the milfoil, the transformation yields odd numbers: seven odd numbers symbolize firmness, eight even numbers symbolize softness, nine symbolizes great firmness, and six symbolizes great softness. The four images take form and are called *vessels*. Deriving form from image, when many are called *objects and vessels*, shaping and employing them is called *method*. Their utility in daily life, universally adopted by the people, is called *spiritual*. The closing and opening, change and penetration, are the milfoil’s circular images, vessels, and methods. That the people universally employ them is the milfoil’s spirituality.\n\nThus, the *Yi* has the Supreme Polarity. *Yi* refers to the casting and arranging of milfoil. The grasping and dividing of milfoil inherently symbolize the opening and closing of doors. When it remains in the box unopened, does it yet contain the four images? The roof ridge stands above while the four sides converge upon it—this is called the *pole*. Forty-nine milfoil stalks, undifferentiated in the box, undergo one change, three changes, nine changes, and eighteen changes, and the *Yi*’s profound transformations are already fully present here. It is like the great ridgepole of a vast hall, incomparable to an ordinary roof beam. Thus it is said: *The Yi has the Supreme Polarity, which generates the Two Modes.* Generation occurs when they are taken from the box. Closing the door is the *Kun* mode; opening the door is the *Qian* mode. The two harmonize in virtue, hence it is said: *This generates the Two Modes.* Now, in the city, two gates are inscribed as *Gate of Modes*. The Two Modes generate the Four Images, which are generated by the casting of milfoil. The Four Images—seven, eight, nine, and six—symbolize firmness, softness, elder, and younger: seven for young firmness, eight for young softness, nine for great firmness, and six for great softness. Distinguishing elder and younger is how they instruct people. Thus it is said: *The Two Modes generate the Four Images; the Four Images generate the Eight Trigrams.* Each of the Four Images governs one aspect, and the Eight Trigrams form their arrangement. If the inner Eight Trigrams are presented, the outer Eight Trigrams need not be mentioned—this is an economy of language. The Eight Trigrams determine fortune and misfortune, and within eighteen changes, the inner and outer Eight Trigrams are complete. Then the diviner presents the hexagram, observes the images, and contemplates the oracle to determine fortune and misfortune. Fortune and misfortune give rise to great undertakings. Once fortune and misfortune are determined, all doubts are resolved, and one advances or retreats accordingly, producing the greatest achievements.\n\nTherefore, no model surpasses Heaven and Earth. This continues the idea that the Two Modes form images: *Qian* emulates Heaven’s constancy, *Kun* emulates Earth’s adaptability—nothing surpasses the four seasons. This continues the idea of one closing and one opening, endless coming and going. The text speaks of arranging them in fours to symbolize the four seasons. No suspended image is more luminous than the sun and moon. This continues the idea that what appears is called *image*. Thus, great firmness becomes the sun, and great softness becomes the moon. No aspiration is loftier than wealth and honor. The previous line speaks of fortune and misfortune; this line continues the idea of great undertakings. With attainable resources and the power to attain them, punishing the guilty and aiding the people, positioning oneself between Heaven and Earth, nurturing the myriad things—what is not a great undertaking? It is especially fitting to consult divination, prepare implements for use, and establish vessels to benefit all under Heaven—nothing surpasses the sage. He employs milfoil to guide the people’s use, establishes hexagram images to create vessels, enabling all under Heaven to esteem divination and emulate great undertakings. Only a sage of perfect clarity, divine martial prowess, and nonviolence can achieve this.\n\nThus it is said: *Nothing is greater than milfoil and tortoise shells for probing the hidden, drawing forth the profound, reaching the distant, and determining the world’s fortune and misfortune, or for accomplishing the world’s ceaseless endeavors.* This extols the spirituality of milfoil and tortoise shells to show that the sage’s benefit to all under Heaven is unparalleled. The following text further elaborates.\n\nTherefore, Heaven produces sacred objects, and the sage takes them as models. Sacred objects include the aforementioned milfoil and tortoise shells. The sage models milfoil on the *River Chart* and tortoise shells on the *Luo Writing*, as described below. Heaven and Earth transform, and the sage emulates them. Transformation is change and penetration; emulating Heaven and Earth involves closing and opening doors, and emulating transformation involves one closing and one opening, endless coming and going. Heaven suspends images to reveal fortune and misfortune, and the sage models them. Suspended images reveal fortune and misfortune, that is, luminous images—this demonstrates to people the divination of fortune and misfortune, ultimately revealing images to determine fortune and misfortune. The *River* yields the *Chart*; the *Luo* yields the *Writing*, and the sage models them. He models the *River Chart* to arrange milfoil and the *Luo Writing* to create tortoise-shell divination. This concludes the earlier statement about Heaven producing sacred objects.\n\nThe commentator says: This chapter focuses on the spirituality of milfoil. Yet milfoil’s spirituality lies in its ability to extract the hexagrams’ square knowledge. The six lines’ capacity to inform is how they reveal fortune and misfortune to people, enabling them to achieve great undertakings. This is its spirituality. Earlier scholars claimed the Supreme Polarity is the Dao, the Two Modes are the first two lines, and the Four Images are the next four lines—these errors all originate from Master Shao. Here, I present his diagrams and explanations to the left.\n\nThe commentator says: The Master spoke of *The Yi has the Supreme Polarity, which generates the Two Modes; the Two Modes generate the Four Images; the Four Images generate the Eight Trigrams*—he never spoke of eight generating sixteen, sixteen generating thirty-two, or thirty-two generating sixty-four.\n\nMaster Shao said: Once the Supreme Polarity divides, the Two Modes are established. When yang ascends to intersect with yin, and yin descends to intersect with yang, the Four Images arise. Yang intersecting with yin and yin intersecting with yang generate the Four Images of Heaven; hard intersecting with soft and soft intersecting with hard generate the Four Images of Earth—thus the Eight Trigrams are completed. Only after the Eight Trigrams intermingle do the myriad things come into being. Therefore, one divides to become two in *Yi*, two divides to become four, four divides to become eight, eight divides to become sixteen, sixteen divides to become thirty-two, and thirty-two divides to become sixty-four—like a root giving rise to a trunk, a trunk to branches, and branches to leaves. The larger the division, the fewer the parts; the finer the division, the more numerous they become. United, they form one; extended, they become ten thousand.\n\nMaster Zhu said: That days have odd and even, and trigrams consist of three lines, all flow forth naturally without contrivance. This is the guiding principle of *Yi* learning, the first meaning upon opening the text. Yet from ancient times to the present, no one has recognized this—until Master Kangjie transmitted the learning of the Primordial Heaven and grasped its explanation, regarding it as the *Yi* of Fuxi. However, from my youth I read this with doubt, and as I matured, my doubts only deepened. I respectfully set forth my uncertainties below.\n\n*Yi* means \"change.\" Earlier scholars said: Between Heaven and Earth, there is only yin and yang. Fuxi drew one unbroken line to represent yang and one broken line to represent yin. Then, from one yang and one yin alternating, he derived the Four Images and the Eight Trigrams, extending to the sixty-four hexagrams—all transformations of the hexagram lines. Beyond this, he further established the changes in milfoil-stalk numbers, hence the name *Yi*. Yet Fuxi himself did not originally have the character *Yi*.\n\nI note: This explanation is far from precise. The *Yi* character here follows the previous chapter’s \"four operations to complete the *Yi*,\" so the subsequent text—\"giving rise to the Four Images, giving rise to the Eight Trigrams, determining fortune and misfortune, generating great undertakings\"—refers specifically to the changes of milfoil stalks. If it also included the changes of hexagram lines, it would conflict with Fuxi’s original creation of the Eight Trigrams’ forms. The details are discussed below under the Two Modes and Four Images.\n\nNot only this: In the lower chapter, \"Qian and Kun are the exhaustion of *Yi*; when Qian and Kun are arrayed, *Yi* is established within them,\" the *Yi* characters all share this meaning. Furthermore, the claim that Fuxi’s time lacked the *Yi* character is incorrect. The *Rites of Zhou* states that the Grand Diviner oversees the methods of the Three *Yi*: the first is *Lianshan*, the *Yi* of Xia; the second is *Guicang*, the *Yi* of Shang; the third is *Zhou Yi*. The Three Dynasties all used *Yi* in their titles, continuing from the Sage Fuxi. Though Xia and Shang had different names, their use of *Yi* did not deviate from the Sage Fuxi. The diviners of old used eight bamboo slips to divine the eight odes, employing the Eight Trigrams to prognosticate fortune and misfortune. The milfoil diviners managed the Three *Yi* to distinguish the names of the nine milfoil divinations. It was not only in the Zhou that the name *Yi* was established. If Fuxi’s time had no writing and thus no *Yi* character, then the Two Modes, Four Images, Qian, Kun, Gen, Xun, Zhen, Li, Kan, Dui, the numbers seven, eight, nine, and six, the division of milfoil stalks, the \"two suspended, one set aside\" method—all would be later additions. If Fuxi and Taihao were merely posthumous titles with no substance, and the hexagram texts were entirely the work of divine sages, then to rely solely on later generations for the name *Yi* would be to diminish the Sage Fuxi to an extreme.\n\nThis misconception arises because Confucius \"made the *Yi*,\" and the character *Yi* was created, leading to such claims. Yet they fail to recognize that when Confucius spoke of \"making the *Yi*,\" he referred to making the *Zhou Yi*, not the Three *Yi*, nor the complete *Yi* of Fuxi. The subsequent text—\"Did he have concerns? Was it about King Wen and Zhou’s affairs?\"—makes his intent quite clear. The details have already been discussed in the preface.\n\nThe Supreme Polarity...\n\nThe *ji* (极) is the ridgepole of a house. *Tai* (太) signifies \"utmost greatness.\" Han Kangbo’s commentary states: \"That which exists begins with the primordial, thus the Supreme Polarity generates the Two Modes.\" The Supreme Polarity is a designation for the primordial; it cannot be named, and so we take the utmost of existence and term it the Supreme Polarity. Kong Yingda’s subcommentary says: \"The Supreme Polarity refers to the time before Heaven and Earth divided, when primordial *qi* was blended as one—this is the Grand Beginning, the Supreme Oneness.\" Thus Laozi says, \"The Dao gives birth to the One,\" and this One is the Supreme Polarity. Further, once the primordial chaos divided, Heaven and Earth emerged, hence \"the Supreme Polarity generates the Two Modes,\" which is what Laozi means by \"the One gives birth to the Two.\" It does not speak of Heaven and Earth but of the Two Modes, referring to their physical forms. Below, they correspond to the Four Images, hence they are called the Two Modes, meaning the two embodied forms.\n\nZhu Xi’s *Original Meaning* states: \"The One invariably generates the Two—this is the natural principle.\" The *Yi* concerns the transformations of yin and yang; the Supreme Polarity is its principle. Zhuo says: Kangbo and Yingda adopted the doctrines of Laozi and Zhuangzi to explain the *Yi*, and their theories are certainly not worth refuting. Yet if we follow their reasoning, the Dao generates Heaven and Earth, Heaven and Earth then generate Metal, Wood, Water, and Fire, and from these the eight trigrams on the milfoil stalks emerge—is this not preposterous? If we adhere to Master Zhu’s explanation, then the transformations of yin and yang, along with the principle underlying them, at the very outset generate the first two lines on the stalks. The first two lines then generate the next four, and these four generate the subsequent eight, without distinguishing between greater and lesser undifferentiated yin and yang. Only when divided into two lines do greater and lesser distinctions emerge, and yin and yang then form the images of the Three Powers. Yet if the first line of yin and yang entirely lacks distinction between greater and lesser, how can the upper line of the eight trigrams fully encompass the Way of Heaven, the Way of Earth, and the Way of Man? This is undoubtedly a matter of no small doubt.\n\n**The Two Modes**\nEarlier scholars say: When the Sage Fuxi drew the trigrams, he first made one unbroken line (⚊) to symbolize yang and one broken line (⚋) to symbolize yin, which later generations named the Two Modes. Zhuo says: Five. Throughout the Ten Wings, whenever Confucius speaks, he only says that Fuxi first created the eight trigrams, never that Fuxi first created the Two Modes. Where in which *Classic* or which *Wing* does it say that Fuxi first made one unbroken line to symbolize yang and one broken line to symbolize yin? In which passage of the *Classic* or which chapter of the *Wings* does this appear? In the horizontal diagram, the eight trigrams branch into sixty-four. The circular and square diagrams are the same. The annotations beneath the trigrams say \"such-and-such trigram below, such-and-such trigram above,\" never stating that the first unbroken and broken lines divide into four, then eight, then sixteen, then thirty-two, and finally sixty-four. The six lines of each trigram are uniform in length, breadth, and spacing. If we now take the first unbroken and broken lines and view the Four Images as requiring division into two segments, the eight trigrams into four, the sixteen into eight, the thirty-two into sixteen, and the sixty-four into thirty-two, then without such division, yang, with its single unbroken line, would bear the weight of the thirty-two lines above, and yin, with its single broken line, would bear the weight of the thirty-two lines above—clearly an incommensurable comparison. If one claims the Two Modes are divinely subtle, that a single line can transform its form to match the number above, then the Sage left no such explicit statement. If we insist this diagram is correct, then the Sage’s horizontal, circular, and square diagrams should all truncate the first line of the sixty-four trigrams. If we still follow the Sage’s original sixty-four-trigram diagrams, then this diagram is not the Sage’s method of drawing.\n\n**The Four Images**\nEarlier scholars added one unbroken or broken line above each of the four combinations of unbroken and broken lines, making four lines in total to symbolize the old and young of yin and yang. Zhuo says: It is correct to call old yin, old yang, young yin, and young yang the Four Images, but it is incorrect to say the Four Images reside above the first line of the eight trigrams and below the three lines. The character *yi* (仪) in \"Two Modes\" follows the *hu* (户, \"door\") from the earlier phrase \"closing and opening doors,\" meaning the two doors match each other. The *xiang* (象, \"image\") in \"Four Images\" follows the *xiang* from the earlier phrase \"what is seen is called an image,\" for only now do images manifest in the lines. Seven symbolizes young yang, eight young yin, nine old yang, and six old yin—hence the Four Images. Confucius says, \"The *Yi* has Four Images to show [the way],\" meaning only now do line images appear to indicate to people gains and losses, movement and stillness, and thus divination for good or ill fortune, regret or remorse. Otherwise, why speak of \"what is seen is called an image,\" and why would the Four Images alone be called \"what is shown\"? If we insist on fixing them in the second position, then *Qian* and *Dui* would precisely correspond to old yang, *Li* and *Zhen* to young yin, *Kun* and *Gen* to old yin, and *Xun* and *Kan* to young yang. In the *Yi* of the Sage Fuxi, the old changes while the young does not, so if we examine the method of seeking trigrams in the *Zuozhuan* across the Three Dynasties, *Qian* should change into *Li* as its derived trigram, *Dui* into *Zhen*, while *Xun* and *Li* alone retain their original trigrams. Why? Because young yin does not change. Thus the original trigrams of *Qian* and *Dui* transform through yielding to the firm, while *Zhen* and *Li* not only retain their original trigrams but also gain derived trigrams, leaving no single *Qian* or *Dui* but only doubled *Zhen* and *Li*. *Kun* should change into *Kan* as its derived trigram, *Gen* into *Xun*, while *Xun* and *Kan* alone retain their original trigrams.\n\nWhy? Because young yang does not change. Thus the original trigrams of *Kun* and *Gen* transform through the firm yielding to the yielding, while *Xun* and *Kan* not only retain their original trigrams but also gain derived trigrams, leaving no single *Kun* or *Gen* but only doubled *Xun* and *Kan*. With *Qian*, *Dui*, *Kun*, and *Gen* lost while *Zhen*, *Li*, *Xun*, and *Kan* doubled, the four images give rise to four trigrams—how then can one speak of them generating the eight trigrams?\n\nEarlier scholars took a single yang line atop another as pure yang, thus symbolizing old yang. A single yang line atop a yin line, with yin mingled within yang, symbolized young yin. A single yin line atop a yang line, with yang mingled within yin, symbolized young yang. Two yin lines atop one another, pure yin, symbolized old yin. This was to evade the difficulty of old changing while young does not. Yet they failed to realize that if a single yang line atop another or a single yin line atop another—pure yin and yang—are specially called \"old,\" then what should one call a hexagram with six pure lines? Would these not become \"supreme old yin\" and \"supreme old yang\"? Such arguments, lacking precision and seeking only momentary satisfaction, are of no value to me.\n\n**The Eight Trigrams**\nThe Master said that Fuxi first created the eight trigrams. In Fuxi’s trigrams, the lower position of *Qian* is yang, yet he never stated: \"The first line of *Qian*’s lower trigram shares a single yang line with *Dui*, *Li*, and *Zhen*.\" Nor did he say: \"The second line of *Qian*’s lower trigram shares a single yang line with *Dui*.\" Likewise, for *Kun*’s lower trigram, he never said: \"The first line of *Kun*’s lower trigram shares a single yin line with *Gen*, *Kan*, and *Xun*,\" nor: \"The second line of *Kun*’s lower trigram shares a single yin line with *Gen*.\" Nor did he ever say: \"Only the third line of *Qian*’s lower trigram attains a complete yang line, distinct from the first and second lines’ truncated forms.\" Nor: \"Only the third line of *Kun*’s lower trigram attains a complete yin line, distinct from the first and second lines’ truncated forms.\" The same applies to the lower trigrams of the other six hexagrams. Thus, the first, second, and third lines—whether long, short, broad, or narrow—are uniform across all, and only then can they be called the eight trigrams. If the first line is shared by four trigrams as two lines, or by two trigrams with varying lengths, breadths, or forms, this cannot be called the eight trigrams. How could this not clearly deviate from the Sage’s method?\n\n**Sixteen Lines**\nEarlier scholars claimed that \"one generates two\" is the natural principle, so each trigram’s top should also add one yin and one yang line, resulting in sixteen lines. Yet the Master never made such a statement. Not only did he never say this, but immediately after discussing the eight trigrams, he followed with words on determining fortune and misfortune. Tracing backward from his words on fortune and misfortune determined by the eight trigrams, one realizes that the four images generate not only the inner eight trigrams but also the outer eight trigrams. Only after the four images generate these inner and outer eight trigrams can one speak of the \"ten changes that complete the hexagrams\"—not merely generating the inner eight trigrams as a minor achievement. Only then can fortune and misfortune be determined. Viewed thus, the fourth, fifth, and top lines of the doubled trigrams are already fully present in the phrase \"the four images generate the eight trigrams.\" Though one might wish to double the eight trigrams to sixteen lines, there is no place to pause in between. Yet Shaozi’s claim that \"eight divides into sixteen\" is a baseless elaboration the Master never uttered—how recklessly unfounded!\n\n**Thirty-Two Lines**\nSince the fourth, fifth, and top lines of the doubled trigrams are fully present in \"the four images generate the eight trigrams,\" the Master never spoke of thirty-two lines. For him to have left such a statement unspoken would be an unwarranted elaboration. Thus, Shaozi’s claim that \"sixteen divides into thirty-two\" is clearly unreliable. Alas! Even if his words did not contradict Fuxi’s method or deviate from the Master’s intent, they would still be tolerable. Yet when examined, his claim that the outer trigrams’ four lines are quadruple the inner trigrams’ three lines—adding the outer eight trigrams’ five lines to the inner trigrams’ three lines to make twenty-four, while the inner trigrams’ three lines are truncated by the outer trigrams’ four and five lines—also corresponds to Fuxi’s horizontal square-circle diagram. In the six-line form, length, shortness, breadth, and narrowness show no difference between inner and outer. When does the doubling occur? When does the truncation happen? And when does the addition align with the three circles? Does this not also contradict Fuxi’s method? The Master’s intent was that both inner and outer eight trigrams arise from the four images, hence his words: \"The eight trigrams determine fortune and misfortune.\" Now, inserting the generation of sixteen and thirty-two lines between the eight trigrams and the determination of fortune and misfortune—absent from the Master’s explicit text and forcibly interpolated—does this not also deviate from his intent? Neither Fuxi’s method nor Confucius’s intent, such claims are decisively unworthy of adherence.\n\n**Sixty-Four Lines**\nThis refers to the top line of the six-line hexagrams, as described in the Song scholars’ diagrams of hexagram generation. Though this single line exists in all sixty-four hexagrams—neither excessive here nor deficient there—if taken as a division of thirty-two lines, it also departs from Fuxi’s method and rebels against the Master’s intent. For in Fuxi’s sixty-four hexagrams, the first, second, third, fourth, fifth, and top lines are all uniform. To claim that the fifth line generates odd and even lines to form the sixth line in sixty-four hexagrams may hold, but from this sixth line downward, the fifth line truncates thirty-two, the fourth line truncates forty-eight, the third line truncates fifty-six, the second line truncates sixty, and the first line truncates sixty-two. Once the earlier scholars’ theory of hexagram generation emerged, it left the five lines below the sixth without proper place, inevitably fragmenting and distorting them. How could this be the Sage’s method or the Great Mean’s intent?\n\nNow, returning to antiquity and rectifying heterodox theories, we may hope to avoid becoming an encumbrance to the Sage. Thus, we re-present the diagrams and explanations below to clarify Fuxi’s original method and the Master’s original intent.\n\n**Fuxi’s Hexagram-Generating Diagram from the *Gu Yi Kao Yuan***\n\nThe *Yi* is the work of six sages. Its origins lie with Fuxi, who first drew the eight trigrams. By appending each of the eight trigrams above the eight, he thereby differentiated them into sixty-four hexagrams.\n\nThree lines form Fuxi’s *qian* trigram. When three additional lines are appended externally—annotated as *qian* below and *qian* above—it remains named *qian*. The other seven trigrams follow the same pattern, constituting the eight primary hexagrams. When *dui* is appended above *qian*, it can neither be named *qian* nor *dui*, and is thus called *guai*. This is one of *qian*’s derivations. *Qian* has eight such derivations, and the other seven trigrams likewise each produce eight, yielding sixty-four derivative hexagrams in total.\n\nThe names of the sixty-four hexagrams were first devised by Fuxi as written characters; their appellations were first voiced by Fuxi as sounds. Over successive eras and sages, none dared alter the brushstrokes, forms, or contemporary pronunciations of Fuxi’s sacred script. Fuxi’s script, like the founding ancestor of a clan whose descendants branch into countless generations without end—\n\nThe sages of Xia and Shang were Yu and Tang; those of Zhou were King Wen, the Duke of Zhou, and Confucius. Through their mutual elucidations, Fuxi’s classic endured across the ages, and the contributions of these five sages were immense. Yet each composed their works based on their own insights, so their books sometimes begin with *gen*, sometimes with *kun*, and sometimes with *qian*. The Duke of Zhou and Confucius, however, fully adhered to the *Zhouyi* and expounded upon it.\n\nFuxi’s *Yi* is simple yet subtly profound, embracing the literary traditions of the Three Dynasties. The classics of the Three Dynasties are vast and mystically profound, mutually illuminating Fuxi’s classic. Fuxi’s classic may be likened to the primal qi of Great Harmony flowing through the four seasons, while the Three Dynasties resemble spring, summer, autumn, and winter, each specializing in its own season.\n\n**The Xia *Yi***\nKongzi said: In ancient times, there was the Lianshan clan. The Xia *Yi* is now called *Lianshan*, likely adopting the *Yi* of the Lianshan clan. An ancient commentary states: *Lianshan* symbolizes clouds rising from mountains in unbroken succession. I find this annotation inappropriate. The original text contains no such wording—how could it speak of \"unbroken succession\"? The *Daxiang* of *Gen* says \"composite mountains,\" yet how can *gen* be said to combine mountains and clouds? *Gen* represents mountains, a symbol established since Fuxi’s time. The Xia *Yi* begins with *gen*, hence it takes the doubled mountain hexagram—*gen* below and *gen* above—still named *gen*, thus called *Lianshan*. Internally there is a mountain, and externally another mountain, connected without end. To add \"rising clouds\" would introduce a separate meaning, deviating from the orthodox interpretation. The *Daxiang*’s \"composite mountains\" aligns with *Lianshan* in principle.\n\nOf the Xia *Yi*, only its name, its book, and its commencement with *gen* remain discernible; the sequence of its sixty-four hexagrams is now entirely unattestable.\n\nZhuo said: The *Yi* states: \"To delve into the profound and probe the hidden, to draw forth the distant and determine the world’s fortune or misfortune, to bring about the world’s undertakings—nothing surpasses milfoil and tortoiseshell.\" The subsequent passage concludes with \"the River brought forth the Diagram, the Luo brought forth the Writing, and the sages took them as models.\" Clearly, Fuxi modeled the diagrams to cast milfoil stalks and the writings to perform tortoiseshell divination.\n\nWhen the divine Yu governed the waters, the Luo again brought forth writings, which Yu employed to arrange the Nine Categories. Thus, the seven milfoil stalks Fuxi modeled for divination appear in the *Jiyi* section on \"Investigating Doubts,\" while the seven tortoiseshells he modeled for oracle-bone divination appear in the same section’s \"Divination and Selection.\" Establishing diviners, he commanded them: \"Rain, clearing, haze, or dawn—divine fivefold.\" Establishing milfoil casters, he commanded them: \"Inquiry and regret—use two for divination.\" Fearing that a single diviner or milfoil caster might err without means of correction, he multiplied their numbers, enabling mutual verification of mistakes. Thus, he appointed three diviners and three milfoil casters as officials, each employing distinct methods. If all three divinations were auspicious, or all inauspicious, that result was adopted. If one was inauspicious and two auspicious, the auspicious result was used; if one was auspicious and two inauspicious, the inauspicious result was used. Hence it is said: \"In divination, follow the word of two.\"\n\nThe *Neizhuan* states: \"Its *zhen* is wind, its *hui* is mountain,\" meaning the inner hexagram is *zhen* and the outer hexagram is *hui*. It also says: \"Eight *zhen* are *zhun*, *hui* are *yu*,\" meaning the original hexagram is *zhen* and the derived hexagram is *hui*. The *Zhouyi* says: \"Favorable for divination,\" \"Unfavorable for divination,\" \"May be divined,\" \"Divining illness,\" and phrases like \"regret vanishes\" or \"its regret then vanishes\"—all derive from this. These are but Fuxi’s methods, later flourishing in the Three Dynasties.\n\n**The Shang *Yi***\nKongzi said: In ancient times, there was the Guicang clan. The Shang *Yi* is now called *Guicang*, likely adopting the *Yi* of the Guicang clan. *Guicang* signifies that the myriad things return to their roots and restore their destinies, all concealed within the earth. *Kun* represents earth, so *guicang* is the Dao of earth.\n\nThus, its text begins with *Kun*. The *Shuogua* states, \"*Kun* conceals them\"—this confirms it. Of the Shang *Yi*, only these two aspects remain discernible: its name and its commencement with *Kun*. The sequence of its sixty-four hexagrams can no longer be verified. However, in the *Liyun*, Confucius tells Ziyou: \"The order of *Kun* and *Qian*...\"—one may infer that its sequence began with *Kun* followed by *Qian*. King Wen, however, deemed *Kun* unfit to precede *Qian*, so he placed *Qian* first and *Kun* second. As for the subsequent hexagram order, further investigation remains elusive. Yet if only the positions of *Kun* and *Qian* were transposed without altering their paired structure, then their binary couplings might still align with the *Zhouyi*, though the precise sequence and proximity could not have been entirely identical.\n\nIn the *Zhouyi*, *Tai*’s sixth line five reads: \"Di Yi marries off his younger sister—auspicious and supremely fortunate.\" *Mingyi*’s sixth line five states: \"Jizi’s *mingyi*—favorable for divination.\" *Guimei*’s sixth line five says: \"Di Yi marries off his younger sister—the lord’s sleeve, unaware of her sister’s sleeve.\" *Gen* and *Jiji*’s ninth line three: \"King Gaozong campaigns against Guifang, conquering it in three years.\" *Weiji*’s ninth line four: \"Zhen is used to campaign against Guifang, rewarded after three years by a great state.\" Former scholars believed these lines were cited because they had once been divined, hence their inclusion.\n\nI, Nu, note: The *Zhouli*’s *Taibu* oversees the three methods of milfoil divination: first, jade milfoil; second, tile milfoil; third, plain milfoil. Their milfoil forms are all \"chou,\" totaling four hundred and twenty, with accompanying odes numbering one thousand two hundred. It also governs the three *Yi* systems: first, *Lianshan*; second, *Guicang*; third, *Zhouyi*. Each system’s primary trigrams number eight, with sixty-four derivative hexagrams. The *Dayi*’s assertion that \"nothing surpasses tortoise and milfoil\" is thus exemplified.\n\nHowever, Fuxi’s hexagram sequence begins with *Qian*, followed by *Dui*, *Li*, *Zhen*, *Xun*, *Kan*, *Gen*, and *Kun*, with its sixty-four hexagrams arranged accordingly. The Xia *Yi* begins with *Gen*, but its sequence is unverifiable. The Shang *Yi* begins with *Kun*, yet its sequence is likewise lost. Whether its hexagrams followed the primary trigrams remains unknown.\n\nThe *Dengren* oversees the three *Yi* systems to distinguish nine divination methods: first, *shigeng*; second, *shixian*; third, *shishi*; fourth, *shimu*; fifth, *shiyi*; sixth, *shihua*; seventh, *shici*; eighth, *shican*; ninth, *shihuan*—each employed to discern fortune and misfortune. For major state affairs, milfoil divination precedes tortoise-shell divination, conducted in early spring. All state matters involve divination.\n\nAll divination methods originate from Fuxi’s primordial milfoil. Round milfoil divination seeks the square hexagrams of knowing; the *Yi*’s hexagrams and lines all adhere to Fuxi’s primordial milfoil. When milfoil emerges from its case and is grasped in hand, it is called \"closing the door.\" Dividing it evenly by hand, suspending the excess, and returning the remainder is called \"opening the door.\" One closing and one opening constitute a *bian*; three *bian* form a line. Nine *bian* achieve a minor completion, casting the inner hexagram. Eighteen *bian* complete the full hexagram, after which the outer hexagram is added. The lines formed by three *bian*—whether seven, eight, nine, or six—are called the four images. If seven or eight are obtained, the inner hexagram is *zhen* and the outer is *hui*; if nine or six are obtained, the original hexagram is *zhen* and the derived hexagram is *hui*. Divination follows the interpretations of two diviners: some results align, some are auspicious, some favor tortoise over milfoil (inner auspicious, outer inauspicious), some oppose both tortoise and milfoil (quiescence auspicious, action inauspicious). Their adherence to the Xia system while following Fuxi’s method is thus evident.\n\nThe *Zhouyi*’s King Wen hexagram sequence and the Duke of Zhou’s hexagram transformations:\nThe first thirty hexagrams of the upper canon, excluding *Qian* and *Li*’s six lines, leave twelve hexagrams. The thirty-four hexagrams of the lower canon, excluding *Zhongfu*, *Xiaoguo*, *Jiji*, and *Weiji*, leave thirty hexagrams, which are inverted to form fifteen hexagrams.\n\nZhuo remarks: Confucius’ *Xiang* commentaries on \"coming and going,\" \"ascending and descending,\" \"advancing and retreating\" all stem from King Wen’s single statement in *Tai* and *Pi*: \"The small departs, the great arrives\" and \"The great departs, the small arrives.\" King Wen adopted Fuxi’s hexagram sequence but rearranged it into binary pairs. Observing these paired hexagrams in inversion, *Tai* has three yang lines inside and three yin lines outside, while *Pi* has three yin lines inside and three yang lines outside. The inner lines, coming from without, are called \"arriving\"; the outer lines, departing from within, are called \"departing.\" Confucius expanded this, stating that when the firm ascends and the yielding descends, the firm lines are indeed above and the yielding below, and vice versa. All these observations arise from comparing paired hexagrams to discern their forms—not by transforming one hexagram into another or altering lines between them. If that were the case, it would mistakenly conflate the young yin and yang (seven and eight) with the old yin and yang (nine and six)—would this not be a grave error?\n\nMoreover, King Wen and Confucius did not discuss \"coming and going\" or \"ascending and descending\" in the eight pure hexagrams or non-inverted pairs, making their original intent abundantly clear. *Tai* states: \"The small departs, the great arrives.\" *Pi* states: \"The great departs, the small arrives.\" These are the first instances of \"coming and going\" in hexagram statements. Confucius further expanded this to include \"ascending and descending,\" \"advancing and retreating,\" all derived from these principles. Yet neither King Wen nor Confucius equated *Tai*’s departing three yin lines with *Pi*’s arriving three yin lines, nor *Tai*’s arriving three yang lines with *Pi*’s departing three yang lines.\n\nViewing the two hexagrams in their inverted opposition, what moves outward is called \"departing,\" while what enters inward is called \"arriving\"—nothing more. If one were to claim that this year’s three yang lines are the same as last year’s three yang lines of the first month, or that this year’s three yin lines are the same as last year’s three yin lines of the seventh month, it would imply that heaven and earth contain only this single *qi*, stored in one place and awaiting its time to emerge or withdraw, with no continuous renewal. Has such a principle ever existed from ancient times to the present?\n\nConsider *Tai* evolving from *Guimei*: the sixth line departs to the fourth position, while the ninth line arrives at the third. Or *Pi* evolving from *Jian*: the ninth line departs to the fourth position, while the sixth line arrives at the third. This interpretation not only imposes the mutability of lines upon the stability of the hexagram’s structure but also subtly alters King Wen’s \"three small\" and \"three great\" by reducing them to a single small and a single great line. How can this align with the concurrent truths of the sacred scriptures?\n\n*Xu* occupies the celestial position with correctness and centrality. The celestial position is the fifth; viewed through its opposition with *Song*, it attains both correctness and centrality. *Song* states: \"The firm arrives and attains the center.\" Viewed through its opposition with *Xu*, it attains correctness and centrality, yet here it attains only centrality, not correctness. Master Zhu said: *Song* arises from *Zhu*, and among the fourteen hexagrams that emerge from *Zhu*, *Song* is the first to transform—its firm line arrives at the second position, while the yielding line advances to the third. Mr. Qiu stated: This is the beginning of hexagram transformation as described in the *Tuan* commentary.\n\nSome mistakenly believe that the central line of *Kan* departs to the fifth position, while the correct and central line arrives at the second, thus attaining centrality. Is this not straightforward and simple? *Sui* states: \"The firm arrives and submits to the yielding; movement brings joy—this is *Sui*.\" The *Benyi* explains: It arises from *Kun*, where the ninth line arrives at the first position, and from *Shihe*, where the ninth line arrives at the fifth. The version derived from *Jiji* combines these two transformations, both embodying the principle of the firm following the yielding. *Gu* states: \"The firm ascends while the yielding descends; compliance and stillness—this is *Gu*.\" Master Xun said: It arises from *Bi*, *Jing*, and *Jiji*, where the firm ascends and the yielding descends—these are all transformed hexagrams.\n\nMaster Zhuo said: Viewing the two hexagrams in opposition, the firm line ascending in *Gu* comes from without, initially descending to the second and third positions, while the yielding line follows the initial firm line, ascending from below. The yielding line at the top descends from above. Earlier scholars further encapsulated this with the six children, claiming that the first line of *Pi* exchanges with the top line of *Sui*, and the first line of *Tai* exchanges with the top line of *Gu*—this is even more erroneous.\n\n*Shihe* states: \"The yielding attains the center and ascends.\" Earlier scholars believed it transforms from *Pi*, with the line ascending from the first to the fifth position—this is incorrect. *Bi* states: \"The yielding arrives and adorns the firm; the firm is divided and ascends to adorn the yielding.\" Some claim it transforms from *Tai*, with *Tai*’s firm lines ascending—this is also incorrect. Master Zhuo said: The division of firm and yielding refers to the separation where the firm ascends to the yielding.\n\nThe hexagram’s text speaks of the yielding line at the fifth position of *Li*, while the subsequent hexagram speaks of the yielding lines at the second and fifth positions—though both attain centrality, the second also attains correctness, making it especially esteemed. *Yu* states: \"The firm comes from without and becomes master within.\" Some claim it transforms from *Zhu* through three changes—this is incorrect. *Daxu* states: \"The firm ascends and esteems worthiness.\" Some claim it transforms from *Dazhuang*, with the fourth line ascending and descending—this is also incorrect. Master Zhuo said: The firm line of *Yu* comes from the top of *Daxu* to become the master within at the first position, while the firm line of *Daxu* ascends from the first position of *Yu* to esteem worthiness—this is understood through opposition and symbolic reflection.\n\nThe lower images:\n*Xian* states: \"The yielding ascends while the firm descends.\" Some claim it transforms from *Pi*—this is incorrect. *Heng* states: \"The firm ascends while the yielding descends.\" Some claim it transforms from *Tai*—this is also incorrect. Master Zhuo said: This interpretation, derived from oppositional reflection, is exceedingly clear.\n\n*Jin* states: \"Compliance and attachment to great brightness; the yielding advances and ascends.\" Some claim it transforms from *Guan*, with the fourth line advancing to the fifth—this is incorrect. *Mingyi*, *Jiaren*, and *Kui* state: \"Joy and attachment to brightness; the yielding advances and ascends.\" Some claim it transforms from *Xun*, with the fourth line advancing to the fifth—this is also incorrect. Master Zhuo said: All four hexagrams contain the *Li* trigram, where the yielding line advances and ascends, while the joyful line retreats and descends. This reflects the sage’s emphasis on brightness. Such interpretations, derived from the opposition of these four hexagrams, are most worthy of deep contemplation.\n\n*Jian* states: \"Favorable in the southwest, where one attains the center by departing. Unfavorable in the northeast, where the Way is exhausted. Favorable to see the great person, as departing brings achievement.\" Some claim the first line of *Zhen* exchanges with the fifth, and the fourth with the third—this is baseless. *Xie* states: \"Favorable in the southwest, where one attains the multitude by departing. Returning brings good fortune, as it attains the center. Having somewhere to go, early good fortune brings achievement.\" Some claim the top line of *Gen* exchanges with the second, and the second with the top—this is equally unfounded. Master Zhuo said: This is also quite clear.\n\n*Sun* states: \"Diminishing below to augment above—its Way ascends.\" Some claim it transforms from *Tai*, with the third line ascending—this is incorrect. *Yi* states: \"Diminishing above to augment below—descending from above.\" Some claim it transforms from *Pi*, with the fourth line descending to the first—this is also incorrect. Master Zhuo said: Diminishing below to augment above is *Sun*; diminishing above to augment below is *Yi*. The two hexagrams are inversions of each other, their words clear and their meanings profound. What connection do they have with transformations from *Tai* or *Pi*?\n\n*Cui* states: \"Gathering. Compliance and joy; the firm is central and responsive—thus gathering.\" *Sheng* states: \"The yielding ascends in due time; compliance and submission, the firm central and responsive—thus great success.\" Master Zhang said: The yielding refers to the sixth line at the fourth position. Master Xu said: The second line of *Xie* ascends to become the fourth line, illustrating Confucius’ statement about the yielding ascending. Yet it speaks only of the fourth line’s single change, while the fifth and top lines are not mentioned as ascending—how can this so distort the scriptures and contradict the sage? If one further insists on interpreting the hexagram through its lines, it would be as absurd as failing to distinguish beans from wheat.\n\nThen why does the scripture not mention \"the yielding descends in due time\"? It is said: Ascending is emphasized, while descending is not belabored.\n\nThe sage thus perfects others’ goodness to such an extent—this aligns with *Mingyi* and *Jiaren*. The *Comprehensive Hexagram Transformation Diagram* represents the Duke of Zhou’s \"use of nine\" and \"use of six.\" Through this, one hexagram can transform into sixty-four. When none of the six lines change, the hexagram’s original lines may only be called \"lines,\" as in the *Yi*’s formation of hexagrams through six lines. The original transformations are limited to seven: original nine, eight, and six—hence the term \"original transformation.\"\n\nKing Wen established the hexagrams, observed their images, and appended judgments below—this is the foundation of *Yi* learning. Earlier scholars also claimed that one hexagram could transform into sixty-four, which is mistaken. Only when the milfoil stalks yield either nine or six does a line acquire the name *yao*, and only then does transformation occur.\n\nWhen one line changes, six hexagrams result, all illustrated below through the two hexagrams *Qian* and *Kun*. The remaining sixty-two hexagrams can be inferred accordingly:\n- Six changes: *Guai* and *Bo*\n- Five changes: *Dayou* and *Bi*\n- Four changes: *Xiaoxu* and *Yu*\n- Three changes: *Lü* and *Qian*\n- Two changes: *Tongren* and *Shi*\n- Initial change: *Gou* and *Fu*\n\nWhen the stalks yield nine, the firm will transform into the yielding; when they yield six, the yielding will transform into the firm—thus the term \"initial transformation,\" referring to the first nine or first six. Take *Qian* and *Kun* as examples:\n- *Qian*’s *Gou* and *Kun*’s *Fu* (initial change)\n- Nine in the second: *Qian*’s *Tongren*; six in the second: *Kun*’s *Shi*\n- Nine in the third: *Qian*’s *Lü*; six in the third: *Kun*’s *Qian*\n- Nine in the fourth: *Qian*’s *Xiaoxu*; six in the fourth: *Kun*’s *Yu*\n- Nine in the fifth: *Qian*’s *Dayou*; six in the fifth: *Kun*’s *Bi*\n- Top nine: *Qian*’s *Guai*; top six: *Kun*’s *Bo*\n\nThe sixty-two remaining hexagrams follow this pattern.\n\nIn the Duke of Zhou’s *Appended Judgments*:\n- When two lines change, fifteen hexagrams result:\n  - Initial and top change: *Daguo* and *Yi*\n  - Initial and fifth change: *Ding* and *Zhun*\n  - Initial and fourth change: *Xun* and *Zhen*\n  - Initial and third change: *Song* and *Mingyi*\n  - Initial and second change: *Dun* and *Lin*\n  - Second and top change: *Ge* and *Meng*\n  - Second and fifth change: *Li* and *Kan*\n  - Second and fourth change: *Jiaren* and *Xie*\n  - Second and third change: *Wuwang* and *Sheng*\n  - Third and top change: *Dui* and *Gen*\n  - Third and fifth change: *Gui* and *Jian*\n  - Third and fourth change: *Zhongfu* and *Xiaoguo*\n  - Fourth and top change: *Xu* and *Jin*\n  - Fourth and fifth change: *Daxu*\n  - Fifth and top change: *Dazhuang* and *Guan*\n\n- When three lines change, twenty hexagrams result:\n  - Initial, second, and top change: *Xian* and *Sun*\n  - Initial, second, and fifth change: *Lü* and *Jie*\n  - Initial, second, and fourth change: *Jian* and *Guimei*\n  - Initial, second, and third change: *Pi* and *Tai*\n  - Initial, third, and top change: *Kun*\n  - Initial, third, and fifth change: *Weiji* and *Jiji*\n  - Initial, third, and fourth change: *Heng* and *Feng*\n  - Initial, fifth, and top change: *Huan* and *Yi*\n  - Initial, fourth, and top change: *Jing* and *Shihe*\n  - Initial, fourth, and fifth change: *Gu* and *Sui*\n  - Second, third, and top change: *Sui* and *Gu*\n  - Second, third, and fifth change: *Shihe* and *Jing*\n  - Second, third, and fourth change: *Yi* and *Huan*\n  - Second, fifth, and top change: *Feng* and *Heng*\n  - Second, fourth, and top change: *Jiji* and *Weiji*\n  - Second, fourth, and fifth change: *Kun*\n  - Third, fifth, and top change: *Guimei* and *Jian*\n  - Third, fourth, and top change: *Jie* and *Lü*\n  - Third, fourth, and fifth change: *Sun* and *Xian*\n  - Fourth, fifth, and top change: *Tai* and *Pi*\n\n- When four lines change, fifteen hexagrams result:\n  - Initial, third, fifth, and top change: *Xiaoguo* and *Sun*\n  - Initial, second, fourth, and top change: *Jian* and *Gui*\n  - Initial, second, fourth, and fifth change: *Gen* and *Dui*\n  - Initial, second, third, and top change: *Cui* and *Xiaoxu*\n  - Initial, second, third, and fifth change: *Jin* and *Xu*\n  - Initial, second, third, and fourth change: *Guan* and *Dazhuang*\n  - Initial, fourth, fifth, and top change: *Sheng* and *Wuwang*\n  - Initial, second, fifth, and top change: *Xie* and *Jiaren*\n  - Initial, third, fourth, and top change: *Kan* and *Li*\n  - Initial, third, fourth, and fifth change: *Meng* and *Ge*\n  - Second, fourth, fifth, and top change: *Mingyi* and *Song*\n  - Second, third, fifth, and top change: *Zhen* and *Xun*\n  - Second, third, fourth, and top change: *Zhun* and *Ding*\n  - Second, third, fourth, and fifth change: *Dun* and *Daguo*\n  - Third, fourth, fifth, and top change: *Lin* and *Dun*\n\n- When five lines change, six hexagrams result:\n  - Initial, third, fourth, fifth, and top change: *Shi* and *Tongren*\n  - Initial, second, fourth, fifth, and top change: *Lü*\n  - Initial, second, third, fifth, and top change: *Yu* and *Xiaoxu*\n  - Initial, second, third, fourth, and top change: *Bi* and *Dayou*\n  - Initial, second, third, fourth, and fifth change: *Bo* and *Guai*\n  - Second, third, fourth, fifth, and top change: *Fu* and *Gou*\n\n- When all six lines change, one hexagram results:\n  - \"Use of nine\": *Qian* transforms into *Kun*\n  - \"Use of six\": *Kun* transforms into *Qian*\n\nThe above, from the Duke of Zhou’s *Appended Judgments*, applies only to the two uses of *Qian* and *Kun*. Master Zhu said: One line changing yields six hexagrams; two lines, fifteen; three lines, twenty; four lines, fifteen; five lines, six; all six lines changing, one—totaling sixty-three, which, including the unchanging original hexagram, makes sixty-four. One hexagram transforms into sixty-four, and sixty-four hexagrams transform into four thousand ninety-six, as in Jiao Gan’s *Forest of Changes*.\n\nWhen one line changes, divination relies on the original hexagram’s changing line. Master Wang said: The original hexagram’s line serves as the \"persistence\" (*zhen*) line, while the changing line serves as the \"regret\" (*hui*) line; both should be considered. When two lines change, divination relies on the original hexagram’s two changing lines, with the upper line as primary. Master Wang said: The first changing line should be taken as *zhen*, and the next changing line as *hui*, interpreted in two stages of fortune’s ebb and flow—proceed accordingly.\n\nWhen three lines change, divination relies on both the original and transformed hexagrams. The *Tuan* judgment takes the original hexagram as *zhen* and the transformed hexagram as *hui*. However, the *Zhongci* cannot be used for divination; instead, the first changing line should be taken as *zhen*, and the latter two as *hui*, interpreted in three stages of fortune’s ebb and flow.\n\nWhen four lines change, divination relies on the transformed hexagram, with the two unchanged lines taking the lower line as primary. When five lines change, divination relies on the transformed hexagram and its single unchanged line. Master Wang said: Both cases are correct—take the first changing line as *zhen* and the later changing lines as *hui*, interpreted in four or five stages of fortune’s ebb and flow.\n\nMaster Xia said: If a line does not change, how can its changing line’s judgment be used? The Duke of Zhou’s line judgments were originally composed for the changes of nine and six; they were not intended for the unchanging seven and eight. If the *Zhouyi* did not employ seven and eight, how could seven and eight usurp the judgments of nine and six? When all six lines change, *Qian* and *Kun* rely on their two uses, while the rest rely on the transformed hexagram.\n\nThe *Tuan* Commentary states: The hexagram judgments all pertain to seven and eight. Since these are unchanging lines, how can they be used to divine change? Only *Qian* and *Kun* may rely on their two uses.\n\nMaster Lü notes: Master Zhu relied on the *Zuozhuan*’s references to \"the eighth line of *Gen*,\" as well as passages on *zhen*, *tun*, *hui*, and *yu*—all employing the term \"eight\"—to support this view. Some commentators argue that the *Zuozhuan* uses the *Xia* and *Shang* versions of the *Yi*, while those explicitly citing the *Zhouyi* clearly state so; however, this cannot be fully verified.\n\n**Hexagram Rulers**\nThe repository of hexagram divination must have a governing line. For the twelve sovereign hexagrams:\n- *Fu* and *Lin* take the first line as ruler;\n- *Lin* and *Dun* take the second line;\n- *Tai* and *Pi* take the third;\n- *Dazhuang* and *Guan* take the fourth;\n- *Guai* and *Bo* take the fifth;\n- *Qian* and *Kun* take the top line.\n\nFor the six doubled trigrams:\n- *Zhen* and *Xun* take the fourth line as ruler;\n- *Kan* and *Li* take the fifth;\n- *Gen* and *Dui* take the top line.\n\nFor the six combined trigrams:\n- *Heng* and *Yi* take the first line as ruler;\n- *Jiji* and *Weiji* take the second;\n- *Xian* and *Sun* take the third.\nFor *Zhen*, *Xun*, *Gen*, and *Dui* in their reversed or opposed forms:\n- *Jie* and *Daguo* take the top line;\n- *Zhongfu* and *Xiaoguo* take the fourth.\nFor combined hexagrams with opposition:\n- *Sui* and *Gu* take the first line;\n- *Jian* and *Guimei* take the third.\nHexagrams containing *Kan* or *Li* take the central line of *Kan* or *Li* as ruler.\n- *Song*, *Kun*, *Jie*, *Huan*, *Meng*, *Shi*, *Tongren*, *Ge*, *Feng*, *Jiaren*, *Bi*, and *Mingyi* all take the second line as ruler;\n- *Xu*, *Jie*, *Tun*, *Jing*, *Jian*, *Bi*, *Dayou*, *Gui*, *Shihe*, *Ding*, *Lü*, and *Jin* all take the fifth.\n\nWhen *Zhen* or *Xun* governs, the fourth line of the original hexagram rules:\n- *Yu* and *Xu* take the fourth line;\n- *Sheng* and *Wuwang* take the first.\n\nWhen *Gen* or *Dui* governs, the third line of the original hexagram rules:\n- *Qian* and *Lü* take the third;\n- *Shi* and *Daxu* take the top.\n\nThe judgment following *Kun*’s hexagram lines takes the top line as ruler.\n- *Mingyi*’s *Nine in the First*: \"The lord speaks.\"\n- *Mingyi* takes the second line as ruler.\n- *Gui*’s *Nine in the Second*: \"Encountering the ruler in a narrow lane.\" *Gui* takes the third line as ruler.\n- *Feng*’s *Nine in the First*: \"Encountering its mate as ruler.\" *Nine in the Fourth*: \"Encountering its ruler.\" *Feng* takes the second line as ruler.\n- *Wuwang*: The firm comes from without to become ruler within. *Wuwang* takes the first line as ruler.\n\nMaster Zhuo said: In the *Spring and Autumn Annals*, events within the state of Lu are recorded as \"internal,\" while those of other states are \"external,\" hence \"we\" refers to Lu. This is because the *Annals* takes Lu as its subject—examples include \"the men of Qi, Song, and Chen attacked us,\" or \"the Qi forces invaded our borders\" and \"buried our lady.\" The *Zhouyi* follows the same principle: whenever \"I\" appears in hexagram or line judgments, it refers to the hexagram’s ruler. The following instances are listed:\n\n- *Meng*: \"The youth seeks me, not I the youth.\" The second line is the hexagram’s ruler, hence \"I.\" The fifth line, *Gen*’s youngest son, is called \"youth.\"\n- *Xiaoxu*: \"Dense clouds, no rain, from our western suburbs.\" The fourth line is the hexagram’s ruler, hence \"our.\"\n- *Guan* *Six in the Third*: \"Observing my life’s advance and retreat.\" The fourth line is the hexagram’s ruler, hence \"my.\" The third line’s movements determine advance and retreat, as *Xun* governs both.\n- *Yi* *Initial Nine*: \"Abandon your sacred tortoise, observe my chewing.\" The top line is the hexagram’s ruler, hence \"my.\" The first line, at the bottom, is unfit for nourishing others. Though it possesses innate wisdom (the tortoise), it remains hidden, yet still gazes upward. The top line, *Yi*’s \"excessive\" position, admires the lower line’s ability to nourish itself without arrogantly forsaking its own needs for others.\n- *Yi* *Nine in the Fifth*: \"Sincere and beneficent heart—ask not, supremely auspicious. Sincere in bestowing virtue upon me.\" The second line is the fifth’s proper correlate. The fifth, at the heart position, speaks of the second’s sincerity in enriching it—its auspiciousness is self-evident. Yet the second not only trusts the fifth but also sincerely bestows virtue upon the first line. The first line is the hexagram’s ruler, hence \"me.\" The second and fifth are distant correlates, hence \"beneficent heart.\" The first line’s firmness is consumed by the second, and their proximity is close, hence \"bestowed virtue.\" *Six in the Second* also speaks of receiving the fifth’s enrichment while gaining the first’s compliance, mirroring this line’s meaning—here, the focus is on the correlate’s relationship, including its adjacent line; there, the focus is on the second’s correlate, including *Six in the Second*’s proximity.\n- *Jing* *Nine in the Third*: \"The well is deep, unused—my heart aches.\" The fifth line is the hexagram’s ruler, hence \"my.\" The third line lies below *Dui*’s mouth, symbolizing a well’s purity left untouched. The fifth line’s heart aches in pity for its unused state.\n- *Yi*’s fifth and third lines share virtue, but the fifth’s upper position lies above *Dui*’s mouth, where people draw from it. The third’s lower position lies below *Dui*’s mouth, unused by others—hence the fifth’s pity.\n- *Ding* *Nine in the Second*: \"The cauldron is full; my mate is ill, unable to approach me—auspicious.\" The fifth line is the hexagram’s ruler, hence \"my.\" This adopts the ruler’s voice: the second line’s virtue is full within, making it my proper correlate, my good match. Unfortunately, it suffers from imbalance, unable to come to me—how could I not visit it? A scholar does not bend the Way to seek an audience with a lord; humbling oneself to honor the worthy brings good fortune.\n- *Lü* *Nine in the Fourth*: \"My heart is not glad.\" The fifth line is the hexagram’s ruler, occupying the heart position, hence \"my.\"\n\nThe fifth line of *Lǚ* resides in the fourth’s position, which is not its proper place—hence its heart is displeased.\n\n- *Zhōng Fú* *Nine in the Second*: \"I possess a fine vessel of rank; I share it with you, that we may dissolve it together.\" The fourth line is the hexagram’s ruler, hence \"I.\" It also uses \"I\" (*wu*), adopting the ruler’s voice: the second line, *Nine in the Fifth*, is firm, strong, centered, and correct, possessing the noble rank of Heaven within itself, above me. The fifth line pities and shares this with you, the second, who should look up to and remain devoted to it. The fourth is adjacent to the fifth, and the second and fifth share the same position—hence this address.\n\n- *Xiǎo Guò* *Six in the Fifth*: \"Dense clouds, no rain, from my western suburbs.\" The fourth line is the hexagram’s ruler, hence \"my.\" *Nine in the Third* obscures the lower trigram *Kǎn* beneath the fifth, resembling clouds densely blocking yet failing to pass—hence no rain. The fourth is the west, lying outside the inner trigram—hence \"suburbs.\" *Nine in the Fourth* does not ascend to join *Six in the Fifth*; how can it hope for the harmony of yin and yang to bring rain?\n\nIn the *Xiāntiān* diagram of sixty-four hexagrams, every two hexagrams mutually form one hexagram, so the middle layer’s thirty-two hexagrams mirror each other left and right, comprising sixteen distinct hexagrams. Within the middle layer’s thirty-two hexagrams, every two hexagrams again mutually form one hexagram, yielding sixteen hexagrams in the inner layer, divided into four identical groups—ultimately four hexagrams.\n\nMaster Hào states: Those who spoke of mutual trigrams in the past merely took four lines from six to form two hexagrams, without grasping the precision of their patterns and images. Now, observing the *Xiāntiān* diagram, the sixteen hexagrams formed by mutual trigrams are each obtained by skipping eight, condensing four into one. Starting from the left: *Qián* and *Guài* proceed through eight hexagrams to *Kuí* and *Guīmèi*, then through another eight to *Jiārén* and *Jìjì*, and yet another eight to *Yí* and *Fù*. Starting from the right: *Shēng* and *Dàguò* proceed through eight hexagrams to *Wèijì* and *Xiè*, then through another eight to *Jiàn* and *Jiǎn*, and yet another eight to *Bō* and *Kūn*. On each side, two hexagrams combine; three sets of two make sixty-four hexagrams, yet mutual trigrams form only sixteen, which further combine into four: *Qián*, *Kūn*, *Jìjì*, and *Wèijì*. The *Zhōu Yì* begins with *Qián* and *Kūn* and ends with *Jìjì* and *Wèijì*—is this not the reason?\n\nMaster Zhū states: In the middle layer, sixteen hexagrams lie on each side. Their lower trigrams, when paired, follow the sequence of *Qián* and *Kūn* through the eight hexagrams. Their upper trigrams complete two cycles of *Qián* and *Kūn* through the eight hexagrams—this can be discerned in the inner layer. The lower trigrams proceed in the order of *Qián*, *Lí*, *Kǎn*, *Kūn*, while the upper trigrams follow *Qián*, *Kǎn*, *Lí*, *Kūn*, with four cycles—this is especially worth contemplating.\n\nZhuó remarks: In the final chapter of the Master’s *Zá Guà*, eight hexagrams are selected from the middle layer: *Dàguò* and *Shēng* for their mutual formation of the inner layer’s *Qián*; *Yí* for its mutual formation of *Kūn*; *Jiàn* and *Jìjì* for their mutual formation of *Wèijì*; and *Guīmèi* and *Wèijì* for their mutual formation of *Jìjì*. *Qián* and *Kūn* are not selected, as they head the text. *Bō* and *Fù* are omitted due to their excess of yin. *Kuí* and *Xiè* are omitted because *Wèijì* and *Guīmèi* are already included. *Jiārén* and *Zòu* are omitted because *Jìjì* and *Jiàn* are already included. Three hexagrams are chosen for *Qián* due to its supremacy, while *Kūn* has only *Yí*; *Jìjì* has only *Guīmèi* and *Wèijì*; and *Wèijì* has only *Jiàn*. Since *Jìjì* and *Wèijì* appear at the end, this reflects the *Zhōu Yì*’s conclusion with *Jìjì* and *Wèijì*. *Kuí* and *Fù* conclude the *Zá Guà*’s sequence, following *Jìjì* and *Wèijì*. The names of the Xià, Shāng, and Zhōu dynasties are mixed yet not disordered; the Master’s naming is likewise mixed yet not disordered.\n\n*Gǔ Yì Kǎo Yuán*, Volume Three, concludes.\nRespectfully printed on an auspicious day of the first lunar month in the *dīngwèi* year of the Wanli reign (1607), under the supervision of Zhang Guoxiang, Celestial Master of Orthodox Unity, Successor of the Teachings, Who Cultivates Sincerity and Propagates the Dao, Grand Realized One of the Hall of Spreading the Mysteries and Vast Teachings, charged with overseeing Daoist affairs throughout the realm.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "古易考原 经名：古易考原。 明代梅鷟撰。 三卷。 底本出处：《万历续道藏》。 古易考原卷之上 伏羲卦画之一 夫子曰：卦之德方以知，知以藏往。 又曰：易与天地准，故能弥纶天地之道。 仰以观于天文，俯以察于地理，是故知幽明之故。 原始反终，故知死生之说。 精气为物，游魂为变，是故知鬼神之情状。 又曰：鼓之以雷霆，润之以风雨，日月运行，一寒一暑。 乾道成男，坤道成女。 乾知大始，坤作成物。 乾以易知，坤以简能。 几此皆言伏羲卦画之《易》也。 惟其先作，方知之卦画而藏天地万物已往之理于其中。 夫然后着策之易可得而用也。 三代之易皆发明伏羲着策之易，以为尚占之用，未有及于卦画之易也。 及于卦画之易者，夫子一人而已。 故吾作《考原》之书，首之以伏羲卦画之易者，益迷夫子之意也。 后儒不知此谊，乃曰《周易》晚添，祖父何其元本，原冠冕之思也哉。 始作八卦第一 下《击辞》曰：古者包羲氏之王天下也，仰则观于天文，俯则察于地法#1； 观乌兽之文与地之宜。 近取诸身”远取诸物，於是始作八卦，以通神明之德，以类万物之情。 鷟曰：仰观象于天而作卦，如乾天、离日、震雷、巽风、坎月、云丰、斗沬之类； 俯观法于地而作卦，如坤地、兑泽、艮山、坎水之类； 观乌兽之文，如乾为龙、为良马、老马，坤为子、母牛，震为龙、为马善呜，巽为鹞，坎为豕、为马美脊，离为牛、为雉、为蟹、为虎豹，艮为狗鼠，兑为羊之类； 观地之宜以作卦，如乾为木果，震为苍食竹、雀苇稼、为反生、为蕃鲜，巽为木、为杨，坎木为坚多心、栋丛棘、羡草，离木为科上稿，艮木为坚多节之类。 近取诸身，不但八体而已，凡八属皆是，如为君、为父之类； 远取诸物，不但服食器用而已，虽计物之数曰万皆是，如为园、玉、金、寒、冰、大、赤之类。 伏羲经卦八，其别六十有四。 今止云作八卦者，举经以该别也。 曷为谓之举经以该别？ 乾为经卦，举一乾，乾之乾，而兑乾、离乾、震乾、巽乾、坎乾、艮乾、坤乾，八别之乾皆该之矣。 兑以下七卦皆然。 故乾、央、大有、大壮、小畜、需、大畜#2、泰，曰始作乾。 履、兑、睽，归妹#3、中孚、节、损、临，曰始作兑。 同人、革、离、丰、家人、既济、贵、明夷，曰始作离。 元妄、随、噬嗑、震、益、屯、颐、复，曰始作震。 娠、大过、鼎、怛、巽、井、蛊、升，曰始作巽。 讼、困、未济、解、泱、坎、蒙、师，曰始作坎。 逐、咸、旅、小过、渐、赛、艮、谦，曰始作艮。 否、萃、晋、豫、观、比、剥、坤，曰始作坤。 羲圣心胸，天象地法，动动植植，近身远物，莫不蟠蓄于中，然后作八卦以垂示天下后世，故其卦之妙，天地象法，动植身物，万理咸备於是，幽赞神明而生着，以通神明之德，制器尚象，随取随足，以类万物之情。 汉儒以为则河图而画卦，宋儒以为见兔亦可以画卦，皆出于臆说，不见伏羲之精，未窥夫子之旨者也。 至其甚者，则有以为止作三画之八卦，文王重为六十四卦。 吾毅然皆以为非是者，正#4以此也。 今列其图于左。 乾下乾上仍名曰乾鷟曰：此经卦之乾也。 乾下兑上名曰夬 乾下离上名曰大有 乾下震上名曰大壮",
      "translated_text": "**Ancient Investigations into the Origins of the *Yi*: The Title and Authorship**\n\n*Ancient Investigations into the Origins of the Yi* (*Gǔ Yì Kǎo Yuán*). Composed by Méi Zú of the Ming dynasty. Three fascicles. Base text from the *Wanli Continuation of the Daoist Canon*.\n\n**Fascicle One of *Ancient Investigations into the Origins of the Yi*: The Hexagrams of Fuxi**\n\nThe Master said: \"The virtue of the hexagrams is square and knowing; knowing conceals what has passed.\" He also said: \"The *Yi* accords with Heaven and Earth, and thus can encompass the Dao of Heaven and Earth.\" Looking up to observe the patterns of Heaven, looking down to examine the principles of Earth—thus one knows the causes of the hidden and the manifest. Tracing things to their origin and returning to their end, one knows the explanations of life and death. Essence and *qi* become things; wandering souls bring about change—thus one knows the conditions of ghosts and spirits. He further said: \"It is stirred by thunder and lightning, moistened by wind and rain; the sun and moon move in their courses, alternating between cold and heat. The Dao of *Qian* completes the male; the Dao of *Kun* completes the female. *Qian* knows the great beginning; *Kun* brings things to fruition. *Qian* is easy to know; *Kun* is simple in its power.\" All these speak of the *Yi* of Fuxi’s hexagrams. Only because he first created them do we know the hexagrams that conceal within them the principles of all things in Heaven and Earth that have passed. Only then can the *Yi* of milfoil divination be put to use.\n\nThe *Yi* of the Three Dynasties all elucidated the *Yi* of Fuxi’s milfoil divination, employing it for the purpose of divination, yet none reached the *Yi* of the hexagrams. Only the Master alone attained the *Yi* of the hexagrams. Thus, in composing this work, *Investigations into the Origins*, I begin with the *Yi* of Fuxi’s hexagrams, to further the Master’s intent. Later Confucians, not understanding this meaning, claimed that the *Zhou Yi* was a late addition, asking, \"What was the original basis of our ancestors?\" How could such thoughts befit the dignity of their forebears?\n\n**1. The First Creation of the Eight Trigrams**\nThe *Appended Judgments* state: \"In ancient times, when Fuxi ruled all under Heaven, he looked up to observe the patterns of Heaven and looked down to examine the principles of Earth; he observed the markings of birds and beasts and the suitability of the land. Drawing near, he took from his own body; from afar, he took from things. Thereupon, he first created the eight trigrams to communicate the power of the numinous and to categorize the conditions of the myriad things.\"\n\nZú says: Looking up to observe the images of Heaven and creating trigrams—such as *Qian* for Heaven, *Li* for the sun, *Zhen* for thunder, *Xun* for wind, *Kan* for the moon, clouds, and the Dipper’s radiance; looking down to observe the principles of Earth and creating trigrams—such as *Kun* for Earth, *Dui* for marsh, *Gen* for mountain, and *Kan* for water; observing the markings of birds and beasts—such as *Qian* representing the dragon, fine horses, and old horses; *Kun* representing the child and the cow; *Zhen* representing the dragon and the neighing horse; *Xun* representing the kite; *Kan* representing the pig and the horse with a fine back; *Li* representing the ox, pheasant, crab, tiger, and leopard; *Gen* representing the dog and rat; *Dui* representing the sheep; observing the suitability of the land to create trigrams—such as *Qian* representing fruit-bearing trees; *Zhen* representing green grains, bamboo, reeds, crops, reverse growth, and luxuriant freshness; *Xun* representing wood and poplar; *Kan* wood representing hardness, many cores, ridgepoles, thorny thickets, and lush grasses; *Li* wood representing hollow upper parts and withered stalks; *Gen* wood representing hardness and many knots.\n\n\"Drawing near, he took from his own body\"—this does not refer only to the eight bodily parts but includes all eight categories, such as being a ruler or a father. \"From afar, he took from things\"—this does not refer only to clothing, food, utensils, and tools but includes all enumerated things, even to the myriad, such as gardens, jade, metal, cold, ice, greatness, and redness.\n\nFuxi’s classic trigrams number eight, and their variations number sixty-four. Now, it is only said that he \"created the eight trigrams\" because the classic encompasses the variations. Why is it said that the classic encompasses the variations? *Qian* is the classic trigram; if one takes *Qian* as *Qian*, then *Dui-Qian*, *Li-Qian*, *Zhen-Qian*, *Xun-Qian*, *Kan-Qian*, *Gen-Qian*, and *Kun-Qian*—the eight variations of *Qian*—are all encompassed. The same applies to the seven trigrams below *Dui*. Thus, *Qian*, *Gou*, *Dayou*, *Dazhuang*, *Xiaoxu*, *Xu*, *Daxu*, and *Tai* are said to derive from the first creation of *Qian*. *Lǚ*, *Dui*, *Kui*, *Guimei*, *Zhongfu*, *Jie*, *Sun*, and *Lin* derive from the first creation of *Dui*. *Tongren*, *Ge*, *Li*, *Feng*, *Jiaren*, *Jiji*, *Guai*, and *Mingyi* derive from the first creation of *Li*. *Wuwang*, *Sui*, *Shike*, *Zhen*, *Yi*, *Tun*, *Yi*, and *Fu* derive from the first creation of *Zhen*. *Heng*, *Daguo*, *Ding*, *Huan*, *Xun*, *Jing*, *Gu*, and *Sheng* derive from the first creation of *Xun*. *Song*, *Kun*, *Weiji*, *Xie*, *Jie*, *Kan*, *Meng*, and *Shi* derive from the first creation of *Kan*. *Lü*, *Xian*, *Lǚ*, *Xiaoguo*, *Jian*, *Jian*, *Gen*, and *Qian* derive from the first creation of *Gen*. *Pi*, *Cui*, *Jin*, *Yu*, *Guan*, *Bi*, *Bo*, and *Kun* derive from the first creation of *Kun*.\n\nThe sagely mind of Fuxi embraced the images of Heaven and the principles of Earth, the movements of animals and the stillness of plants, the nearness of the body and the distance of things—all were stored within. Only then did he create the eight trigrams to bequeath them to later generations under Heaven. Thus, the wonder of his trigrams encompasses the images and principles of Heaven and Earth, the movements of animals and the stillness of plants, the body and things—all principles are complete therein. They subtly assist the numinous and give rise to divination, communicating the power of the numinous and devising implements to emulate images, taking freely and sufficiently to categorize the conditions of the myriad things.\n\nHan Confucians claimed that he drew the trigrams following the *Hetu*, while Song Confucians claimed that seeing a turtle could suffice to draw the trigrams—all these are baseless conjectures, failing to perceive Fuxi’s essence and not glimpsing the Master’s intent. Those who go to extremes even claim that he first created the eight trigrams of three lines, and that King Wen later doubled them into sixty-four hexagrams. I resolutely reject all such claims, precisely for this reason.\n\nNow, I arrange their diagrams to the left.\n\n*Qian* below, *Qian* above, still named *Qian*.\nZú says: This is the classic trigram *Qian*.\n\n*Qian* below, *Dui* above, named *Guai*.\n*Qian* below, *Li* above, named *Dayou*.\n*Qian* below, *Zhen* above, named *Dazhuang*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1241,
      "start_sentence": 0,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.92831826210022,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "乾下巽上名曰小畜 乾下坎上名曰需 乾下艮上名曰大畜 乾下坤上名曰泰鷟曰：自乾卦以下至泰为其别之乾也。 鷟曰：此以上八卦言伏羲始作乾卦也。 经卦之乾谓之始，作乾宜矣。 其别卦而皆谓之作乾何哉？ 乾在下为主于内，加八卦于上以发明乾之别而已，故总名之曰作乾。 而乾在他卦之上则不为主而为他卦之别。 兑下乾上名曰履 兑下兑上仍名曰兑鷟曰：此经卦之兑也。 兑下离上名曰睽 兑下震上名曰妹 兑下巽上名曰中孚 兑下坎上名曰节 兑下艮上名曰损 兑下坤上名曰临鷟曰：自履以下至临为其别之兑也。 鷟曰：此以上八卦言伏羲始作兑卦也。 经卦之兑谓之始作兑宜矣，其别卦而皆谓之作兑何哉？ 兑在下为主于内，加八卦于上以发明兑之别而已，故总名之曰作兑。 而兑在他卦之上则不为主而为他卦之别。 离下乾上名曰同人 离下兑上名曰革 离下离上仍名曰离鷟曰：此经卦之离也。 离下震上名曰丰 离下巽上名曰家人 离下坎上名曰既济 离下艮上名曰贲 离下坤上名曰明夷鷟曰：自同人至明夷为其别之离也。 鷟曰：此以上八卦言伏羲始作离卦也。 经卦之离谓之始作离宜矣，其别卦而皆谓之作离何哉？ 离在下为主于内，加八卦于上以发明离之别而已，故总名之曰作离。 而离在他卦之上则不为主而为他卦之别。 巽下乾上名曰姤 巽下兑上名曰大过 巽下离上名曰鼎 巽下震上名曰怛 巽下巽上仍名曰巽鷟曰：此经卦之巽也。 巽下坎上名曰井 巽下艮上名曰蛊 巽下坤上名曰升鷟曰：自娠以下至升为其别之巽也。 鷟曰：此以上八卦言伏羲始作巽卦也，经卦之巽谓之始作巽宜矣。 其别卦而皆谓之作巽何哉？ 巽在下为主于内，加八卦于上以发明巽之别而已，故总名之曰作巽。 而巽在他卦之上则不为主而为他卦之别。 坎下乾上名曰讼 坎下兑上名曰困 坎下离上名曰未济 坎下震上名曰解 坎下巽上名曰涣 坎下坎上仍名曰坎鷟曰：此经卦之坎也。 坎下艮上名曰蒙 坎下坤上名曰师鷟曰：自讼以下至师为其别之坎也。 鷟曰：此以上八卦言伏羲始作坎卦也。 经卦之坎谓之始作坎宜矣。 其别卦而皆谓之作坎何哉？ 坎在下为主于内，加八卦于上以发明坎之别而已，故总名之曰作坎。 而坎在他卦之上则不为主而为他卦之别。 艮下乾上名曰遁 艮下兑上名曰咸 艮下离上名曰旅 艮下震上名曰小过 艮下巽上名曰渐 艮下坎上名曰蹇 艮下艮上仍名曰艮鷟曰：此经卦之艮也。 艮下坤上名曰谦鷟曰：自运以下至谦为其别之艮也。 鷟曰：此以上八卦言伏羲始作艮卦也。 经卦之艮谓之始作艮宜矣。 其别卦而皆谓之作艮何哉？ 艮在下为主于内，加八卦于上以发明艮之别而已，故总名之曰作艮。 而艮在他卦之上则不为主而为他卦之别。 坤下乾上名曰否 坤下兑上名曰萃 坤下离上名曰晋 坤下震上名曰豫 坤下巽上名曰观 坤下坎上名曰比 坤下艮上名曰剥 坤下坤上仍名曰坤鷟曰：此经卦之坤也。 又曰：自否以下至坤为其别之坤也。 鷟曰：此以上八卦言伏义始作坤卦也。 经卦之坤谓之始作坤宜矣，其别卦而皆谓之作坤何哉？ 坤在下为主于内，加八卦于上以发明坤之别而已，故总名之曰作坤。 而坤在他卦之上则不为主而为他卦之别。 八卦圆运第二 《说卦》曰：天地定位，山泽通气，雷风相薄，水火不相射。",
      "translated_text": "*Qian* below, *Xun* above, named *Xiaochu*.\n*Qian* below, *Kan* above, named *Xu*.\n*Qian* below, *Gen* above, named *Dachu*.\n*Qian* below, *Kun* above, named *Tai*.\nZú says: From *Qian* below to *Tai* are its derivative *Qian* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Qian* trigram. The primary *Qian* trigram is rightly called the beginning, so it is fitting that *Qian* was first created. But why are all its derivative hexagrams also called \"created *Qian*\"? When *Qian* is below, it serves as the master within, with the eight trigrams added above to elucidate *Qian*’s variations—hence they are collectively named \"created *Qian*.\" Yet when *Qian* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Dui* below, *Qian* above, named *Lǚ*.\n*Dui* below, *Dui* above, still named *Dui*.\nZú says: This is the primary *Dui* trigram.\n\n*Dui* below, *Li* above, named *Kuí*.\n*Dui* below, *Zhen* above, named *Guī*.\n*Dui* below, *Xun* above, named *Zhongfu*.\n*Dui* below, *Kan* above, named *Jié*.\n*Dui* below, *Gen* above, named *Sǔn*.\n*Dui* below, *Kun* above, named *Lín*.\nZú says: From *Lǚ* to *Lín* are its derivative *Dui* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Dui* trigram. The primary *Dui* trigram is rightly called the beginning, so it is fitting that *Dui* was first created. But why are all its derivative hexagrams also called \"created *Dui*\"? When *Dui* is below, it serves as the master within, with the eight trigrams added above to elucidate *Dui*’s variations—hence they are collectively named \"created *Dui*.\" Yet when *Dui* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Li* below, *Qian* above, named *Tongren*.\n*Li* below, *Dui* above, named *Gé*.\n*Li* below, *Li* above, still named *Li*.\nZú says: This is the primary *Li* trigram.\n\n*Li* below, *Zhen* above, named *Fēng*.\n*Li* below, *Xun* above, named *Jiaren*.\n*Li* below, *Kan* above, named *Jìjì*.\n*Li* below, *Gen* above, named *Bì*.\n*Li* below, *Kun* above, named *Mingyi*.\nZú says: From *Tongren* to *Mingyi* are its derivative *Li* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Li* trigram. The primary *Li* trigram is rightly called the beginning, so it is fitting that *Li* was first created. But why are all its derivative hexagrams also called \"created *Li*\"? When *Li* is below, it serves as the master within, with the eight trigrams added above to elucidate *Li*’s variations—hence they are collectively named \"created *Li*.\" Yet when *Li* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Xun* below, *Qian* above, named *Gòu*.\n*Xun* below, *Dui* above, named *Daguo*.\n*Xun* below, *Li* above, named *Dǐng*.\n*Xun* below, *Zhen* above, named *Héng*.\n*Xun* below, *Xun* above, still named *Xun*.\nZú says: This is the primary *Xun* trigram.\n\n*Xun* below, *Kan* above, named *Jǐng*.\n*Xun* below, *Gen* above, named *Gǔ*.\n*Xun* below, *Kun* above, named *Shēng*.\nZú says: From *Gòu* to *Shēng* are its derivative *Xun* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Xun* trigram. The primary *Xun* trigram is rightly called the beginning, so it is fitting that *Xun* was first created. But why are all its derivative hexagrams also called \"created *Xun*\"? When *Xun* is below, it serves as the master within, with the eight trigrams added above to elucidate *Xun*’s variations—hence they are collectively named \"created *Xun*.\" Yet when *Xun* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Kan* below, *Qian* above, named *Sòng*.\n*Kan* below, *Dui* above, named *Kùn*.\n*Kan* below, *Li* above, named *Wèijì*.\n*Kan* below, *Zhen* above, named *Xiè*.\n*Kan* below, *Xun* above, named *Huàn*.\n*Kan* below, *Kan* above, still named *Kan*.\nZú says: This is the primary *Kan* trigram.\n\n*Kan* below, *Gen* above, named *Méng*.\n*Kan* below, *Kun* above, named *Shī*.\nZú says: From *Sòng* to *Shī* are its derivative *Kan* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Kan* trigram. The primary *Kan* trigram is rightly called the beginning, so it is fitting that *Kan* was first created. But why are all its derivative hexagrams also called \"created *Kan*\"? When *Kan* is below, it serves as the master within, with the eight trigrams added above to elucidate *Kan*’s variations—hence they are collectively named \"created *Kan*.\" Yet when *Kan* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Gen* below, *Qian* above, named *Dùn*.\n*Gen* below, *Dui* above, named *Xián*.\n*Gen* below, *Li* above, named *Lǚ*.\n*Gen* below, *Zhen* above, named *Xiaoguo*.\n*Gen* below, *Xun* above, named *Jiàn*.\n*Gen* below, *Kan* above, named *Jiǎn*.\n*Gen* below, *Gen* above, still named *Gen*.\nZú says: This is the primary *Gen* trigram.\n\n*Gen* below, *Kun* above, named *Qiān*.\nZú says: From *Dùn* to *Qiān* are its derivative *Gen* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Gen* trigram. The primary *Gen* trigram is rightly called the beginning, so it is fitting that *Gen* was first created. But why are all its derivative hexagrams also called \"created *Gen*\"? When *Gen* is below, it serves as the master within, with the eight trigrams added above to elucidate *Gen*’s variations—hence they are collectively named \"created *Gen*.\" Yet when *Gen* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n*Kun* below, *Qian* above, named *Pǐ*.\n*Kun* below, *Dui* above, named *Cuì*.\n*Kun* below, *Li* above, named *Jìn*.\n*Kun* below, *Zhen* above, named *Yù*.\n*Kun* below, *Xun* above, named *Guān*.\n*Kun* below, *Kan* above, named *Bǐ*.\n*Kun* below, *Gen* above, named *Bō*.\n*Kun* below, *Kun* above, still named *Kun*.\nZú says: This is the primary *Kun* trigram.\nIt is also said: From *Pǐ* to *Kun* are its derivative *Kun* trigrams.\n\nZú says: The above eight hexagrams speak of Fuxi’s initial creation of the *Kun* trigram. The primary *Kun* trigram is rightly called the beginning, so it is fitting that *Kun* was first created. But why are all its derivative hexagrams also called \"created *Kun*\"? When *Kun* is below, it serves as the master within, with the eight trigrams added above to elucidate *Kun*’s variations—hence they are collectively named \"created *Kun*.\" Yet when *Kun* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n**Circular Movement of the Eight Trigrams**\nThe *Shuogua* states: \"Heaven and Earth take their positions; mountain and marsh exchange qi; thunder and wind press upon each other; water and fire do not clash.\"",
      "overlap_context": "er’s intent. Those who go to extremes even claim that he first created the eight trigrams of three lines, and that King Wen later doubled them into sixty-four hexagrams. I resolutely reject all such claims, precisely for this reason.\n\nNow, I arrange their diagrams to the left.\n\n*Qian* below, *Qian* above, still named *Qian*.\nZú says: This is the classic trigram *Qian*.\n\n*Qian* below, *Dui* above, named *Guai*.\n*Qian* below, *Li* above, named *Dayou*.\n*Qian* below, *Zhen* above, named *Dazhuang*.",
      "start_char": 1241,
      "end_char": 2633,
      "start_sentence": 55,
      "end_sentence": 140,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.659661531448364,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "又曰：数往者顺。 鷟曰：此言伏羲六十四卦圆运之图。 止言八卦之象者，皆举经以该别也。 天定位于南，其别八天皆定位於南。 地定位於北，其别八地皆定位於北。 山通气於西北，其别八山皆通气於西北。 泽通气於东南，其别八泽皆通气於东南。 雷相薄於东北，其别八雷皆相薄於东北。 风相薄於西南，其别八风皆相薄於西南。 水不相射於西，其别八水皆不相射於西。 火不相射於东，其别八火皆不相射於东。 不着卦名者，以夫子怛言象故也。 先儒以为单言三画之八卦，非是其所以为数往者顺，何也？ 天位於南，由南而左行则天而泽、而火、而雷，由南而右行则风而水、而山、而地，皆自南而北，自上而下，故日：数已往之定位，顺而不逆，从古及今皆如是也。 八卦方列第三 《说卦》曰：八卦相错，知来者逆，是故易逆数也。 又日：雷以动之，风以散之，雨以润之，日以晅之，艮以止之，兑以说之，乾以君之，坤以藏之。 鷟曰：此言伏羲六十四卦方列之图。 止言八卦者，亦举经以该别也。 八卦相错，承上文天地、山泽、雷风、水火之圆运，令彼此交错而为方列也。 邵尧夫以上文八卦为三画卦至此相错，则八卦之上各加八卦而始为六十四卦，是以相错为相重也。 凡此往彼来谓之错，加增其上谓之重。 以相错即为相重，误矣。 不然，则此言雷以动之，八卦之方列者元相错之文，是圆运者兼及六画卦而方列者仅有三画卦，其不通亦明矣。 雷以动物於中左，风以散物於中右，其别八雷，皆动物於中左，八风皆散物於中右也。 雨以润物於次风，日以暄物於次雷，其别八雨皆润物。 次风八日皆暄物，次雷也。 艮以止物。 次雨兑以说物。 次日，其别八艮皆止物。 次雨八兑皆说物，次日也。 乾以君物，居北。 坤以藏物，居南。 其别八乾皆以君物居北，八坤皆以藏物居南也。 卦位相对，虽与上文同，先后次第大与上文交错矣。 上文天、地居首，此离、坎居中，乾、坤殿后，是天地与水火交错也。 上文山、泽居第二，此艮、兑居第三，是山泽与雷风相交错也#5。 上文雷、风居第二，此居其中，是雷风与天地相交错也。 上文水、火居第四，此雨、日居第#6二，是水火与山泽相交错也。 又分而言之，天南地北。 今乾北坤南是乾与坤相交错也。 泽东南，山西北，今兑次北，艮次南，是兑与艮相交错也。 火东水西。 今日又次北，雨又次南，是离与坎相交错也。 雷东北风西南。 今雷动北中，风散南中，是震与巽相交错也。 由乾而兑、而离、而震、而巽、而坎、而艮、而坤，皆自北而南，自下而上，故日知来者逆也。 因上文八卦相错一句浑成未详，故详列此八句以发明方列相错之义也。 然则先儒皆以圆运之乾、兑、离、震为数往者顺，坤、艮、坎、巽为知来者逆，其说不通。 夫伏羲之卦序，乾至坤八未尝有顺也。 夫子之意，借图运之顺、方列之逆以发明《系辞》知以藏往、神以知来之义耳。 今列其图于左。 伏羲六十四卦方图 鷟曰：儒者言秘于方技家，至陈希夷始传之邵尧夫，始发明之。 斯言殆不思之甚矣。 夫子之言昭如日星，但伏羲原用卦，夫子则言象以发挥，是以不思则不得其精也。 惊故详列其图于左，方使后之人知方技家之所秘者，出于夫子之言而元所疑也。",
      "translated_text": "Moreover, it states: \"In counting what has passed, one follows the sequence.\"\n\nZú says: This speaks of Fuxi’s sixty-four hexagrams in their circular movement. Though only the eight trigrams are mentioned, the primary forms are cited to encompass their derivatives. Heaven takes its position in the south, and its eight derivative heavens all take position in the south. Earth takes its position in the north, and its eight derivative earths all take position in the north. Mountain exchanges qi in the northwest, and its eight derivative mountains all exchange qi in the northwest. Marsh exchanges qi in the southeast, and its eight derivative marshes all exchange qi in the southeast. Thunder presses upon in the northeast, and its eight derivative thunders all press upon in the northeast. Wind presses upon in the southwest, and its eight derivative winds all press upon in the southwest. Water does not clash in the west, and its eight derivative waters all do not clash in the west. Fire does not clash in the east, and its eight derivative fires all do not clash in the east. The names of the hexagrams are not specified because the Master invariably spoke in terms of images.\n\nFormer scholars believed this referred solely to the eight trigrams of three lines, but this is incorrect. Why is it said that \"in counting what has passed, one follows the sequence\"? Heaven’s position is in the south; moving left from the south, one passes through heaven, then marsh, then fire, then thunder; moving right from the south, one passes through wind, then water, then mountain, then earth—all proceeding from south to north, from above to below. Thus it is said: the positions of what has already passed are fixed in sequence, following without reversal, as they have been from antiquity to the present.\n\n**Rectangular Arrangement of the Eight Trigrams**\nThe *Shuogua* states: \"The eight trigrams intermingle; in knowing what is to come, one moves in reverse—thus the *Yi* reckons in reverse.\"\n\nIt further states: \"Thunder moves them; wind disperses them; rain moistens them; the sun warms them; *Gen* halts them; *Dui* delights them; *Qian* rules them; *Kun* conceals them.\"\n\nZú says: This speaks of Fuxi’s sixty-four hexagrams in their rectangular arrangement. Though only the eight trigrams are mentioned, the primary forms are again cited to encompass their derivatives. The eight trigrams intermingle, building upon the circular movement of heaven and earth, mountain and marsh, thunder and wind, water and fire, now intersecting one another in a rectangular array.\n\nShao Yaofu believed that the eight trigrams in the preceding passage referred to the three-line trigrams, and that only when they intermingled—each of the eight trigrams being overlaid with another eight—did the sixty-four hexagrams emerge. Thus he took \"intermingling\" to mean \"layering.\" But to conflate intermingling with layering is mistaken. Otherwise, this passage, which speaks of thunder moving things, would pertain solely to the rectangular arrangement of the eight trigrams, with no reference to intermingling. This would imply that the circular movement encompasses the sixty-four hexagrams, while the rectangular arrangement includes only the eight trigrams—a manifestly incoherent claim.\n\nThunder moves things in the middle left; wind disperses things in the middle right. Their eight derivative thunders all move things in the middle left, and their eight derivative winds all disperse things in the middle right. Rain moistens things next to wind; the sun warms things next to thunder. Their eight derivative rains all moisten things next to wind, and their eight derivative suns all warm things next to thunder. *Gen* halts things next to rain; *Dui* delights things next to the sun. Their eight derivative *Gen* all halt things next to rain, and their eight derivative *Dui* all delight things next to the sun. *Qian* rules things, residing in the north; *Kun* conceals things, residing in the south. Their eight derivative *Qian* all rule things in the north, and their eight derivative *Kun* all conceal things in the south.\n\nThough the relative positions of the hexagrams remain the same as in the preceding passage, their order and sequence differ greatly. In the earlier passage, heaven and earth held the first positions; here, *Li* and *Kan* occupy the center, while *Qian* and *Kun* bring up the rear—thus heaven and earth intermingle with water and fire. In the earlier passage, mountain and marsh held the second position; here, *Gen* and *Dui* occupy the third—thus mountain and marsh intermingle with thunder and wind. In the earlier passage, thunder and wind held the second position; here, they occupy the center—thus thunder and wind intermingle with heaven and earth. In the earlier passage, water and fire held the fourth position; here, rain and sun occupy the second—thus water and fire intermingle with mountain and marsh.\n\nExamined in further detail: Heaven is in the south and earth in the north, but now *Qian* is in the north and *Kun* in the south—thus *Qian* and *Kun* intermingle. Marsh is in the southeast and mountain in the northwest, but now *Dui* is next to the north and *Gen* next to the south—thus *Dui* and *Gen* intermingle. Fire is in the east and water in the west, but now the sun is next to the north and rain next to the south—thus *Li* and *Kan* intermingle. Thunder is in the northeast and wind in the southwest, but now thunder moves in the north-center and wind disperses in the south-center—thus *Zhen* and *Xun* intermingle. Proceeding from *Qian* to *Dui*, then *Li*, *Zhen*, *Xun*, *Kan*, *Gen*, and *Kun*—all move from north to south, from below to above. Thus it is said: \"In knowing what is to come, one moves in reverse.\"\n\nBecause the phrase \"the eight trigrams intermingle\" in the preceding passage was too concise to be clear, these eight sentences are listed in detail to elucidate the meaning of rectangular intermingling. Yet former scholars all claimed that in the circular movement, *Qian*, *Dui*, *Li*, and *Zhen* represent \"counting what has passed in sequence,\" while *Kun*, *Gen*, *Kan*, and *Xun* represent \"knowing what is to come in reverse\"—a view that does not hold. For in Fuxi’s sequence of hexagrams, from *Qian* to *Kun*, there was never any such distinction of sequence. The Master’s intent was merely to borrow the circular movement’s sequence and the rectangular arrangement’s reversal to illuminate the *Xici*’s meaning: \"Wisdom conceals what has passed; spirit knows what is to come.\" The diagram is now presented below.\n\n**Fuxi’s Rectangular Diagram of the Sixty-Four Hexagrams**\nZú says: Scholars have kept this secret among the diviners, and only with Chen Xiyi was it transmitted to Shao Yaofu, who first elucidated it. Such claims are profoundly thoughtless. The Master’s words shine as brightly as the sun and stars. Fuxi originally used the hexagrams, while the Master spoke in terms of images to expound upon them—thus without reflection, one cannot grasp their essence. For this reason, the diagram is presented in detail below, so that later generations may know that what the diviners kept secret originated in the Master’s words and is beyond doubt.",
      "overlap_context": "d *Kun*\"? When *Kun* is below, it serves as the master within, with the eight trigrams added above to elucidate *Kun*’s variations—hence they are collectively named \"created *Kun*.\" Yet when *Kun* is above another trigram, it does not serve as master but becomes a variation of that trigram.\n\n**Circular Movement of the Eight Trigrams**\nThe *Shuogua* states: \"Heaven and Earth take their positions; mountain and marsh exchange qi; thunder and wind press upon each other; water and fire do not clash.\"",
      "start_char": 2633,
      "end_char": 3876,
      "start_sentence": 141,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.84320592880249,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "若夫以三画卦画为方位图者，则非伏羲之本真，而夫子亦初元是言。 今则删之，不以惑后人也。 此二图有阴阳对待之义。 圆为阳，方为阴，圆动为天，方静为地。 鷟曰：自天天至地天、八卦言天定位于南。 自天地至地地，八卦言地定位于北。 天山至地山，八卦言山通气于西北。 天泽至地泽，八卦言泽通气于东南。 天雷至地雷，八卦言雷相薄于东北。 天风至地风，八卦言风相薄于西南。 天火至地火，八卦言火不相射于东。 天水至地水，八卦言水不相射于西。 此六十四卦之圆，皆自南而北，自上而下，故日顺。 雷八卦以动物，风八卦以散物，生物之春也。 雨八卦以润物，日八卦以晅物，长物之夏也。 艮八卦畎止物，兑八卦以说物，收物之秋也。 乾八卦以君物，坤八卦以藏物，藏物之冬也。 此六十四卦之方列，皆自北而南，自下而上，故日逆。 邵子所传先天之图，其原益出于此。 以上首横图，次圆图，次方图，伏义卦画之易可考如此。 古易考原卷上竟 #1此二句《周易本义》作『仰则观象于天，俯则观法于地』。 #2『畜』原作『日』，据《周易本义》改。 #3『妹』原作『昧』，据《周易本义》改。 #4『正』原作『政』，据前后文改。 #5『也』原脱，据前后文补。 #6『第』原脱，据前后文补。 古易考原卷中 伏义着数之易 夫子曰：着之德圆而神，神以知来。 又曰：与天地相似，故不违。 知周万物而道济天下，故．不过。 旁行而不流，乐天知命，故不忧。 安土敦乎仁，故能爱，故神元方。 又曰：天尊地卑，乾坤定矣。 卑高以陈，贵贱位矣。 动静有常，刚柔断矣。 方以类聚，物以群分，吉凶生矣。 在天成象，在地成形，变化见矣。 是故刚柔相摩，八卦相荡。 凡此皆言伏义着数之易也。 惟其有圆神之着数，而求天地万物之理于藏往之卦画。 夫然后未来之吉凶悔吝可得而知也。 故考原之书，次之以伏义着数之易。 河图第一 《系辞》曰：河出图，洛出书，圣人则之。 又曰：天一地二，天三地四，天五地六，天七地八，天九地十。 天数五，地数五，五位相得而各有合。 天数二十有五，地数三十，凡天地之数五十有五。 此所以成变化而行鬼神也。 鷟曰：圣人则河图所以生着，则洛书所以作龟。 因上文言莫大乎着龟，故兼言则洛书也。 《汉书·律历志》引此章天一至行鬼神也，六十四字相连。 班孟坚之后不知何时高逖天一至地十廿字在于后章。 今从程、朱正其错简。 此即所谓河图之数也。 河中龙马出于河，其背上旋毛有此圆圈，如星点然，故日图以其出于河。 故日河出图。 几天下之数起于一，成于十，不过十数而已。 加之以一则为十，有一加之以十则为二，其十由是而百千万亿皆出于十之外者也。 若河图之数则不然焉。 天一为一矣，至天三并天一而为四，一得其一，三得其三，而三与一有合，至天五又与一、三相得而合为九，至天七又与一、三、五相得而合为十六，至天九又与一、三、五、七相得而合为二十有五。 日五者，天数之正。 日二十者，衍出之数。 虽日衍出二十，而其实不出天数五之外也。 地二为二矣，至地四则并二而为六，二得其二，四得其四，而二与四有合。 至地六又与二、四相得而合为十二，至地八又与二、四、六相得而合为二十，至地十又与二、四、六、八相得而合为三十。",
      "translated_text": "As for those who arrange the three-line trigrams into directional diagrams, this is not Fuxi’s original truth, nor did the Master ever speak of it. Thus, it has now been removed to avoid misleading later generations.\n\nThese two diagrams embody the principle of yin-yang correspondence. The circular form represents yang, the square yin; the circular moves as heaven, the square rests as earth.\n\nZú says: From *Qián* (Heaven) to *Dì-Qián* (Earth-Heaven), the eight trigrams position heaven in the south. From *Kūn* (Earth) to *Dì-Kūn* (Earth-Earth), the eight trigrams position earth in the north. From *Gèn* (Mountain) to *Dì-Gèn* (Earth-Mountain), the eight trigrams convey that mountains channel qi in the northwest. From *Duì* (Marsh) to *Dì-Duì* (Earth-Marsh), the eight trigrams convey that marshes channel qi in the southeast. From *Zhèn* (Thunder) to *Dì-Zhèn* (Earth-Thunder), the eight trigrams convey that thunder clashes in the northeast. From *Xùn* (Wind) to *Dì-Xùn* (Earth-Wind), the eight trigrams convey that wind clashes in the southwest. From *Lí* (Fire) to *Dì-Lí* (Earth-Fire), the eight trigrams convey that fire does not oppose itself in the east. From *Kǎn* (Water) to *Dì-Kǎn* (Earth-Water), the eight trigrams convey that water does not oppose itself in the west.\n\nIn this circular arrangement of the sixty-four hexagrams, all proceed from south to north, from above to below—thus it is called \"sequential.\" The eight hexagrams of *Zhèn* (Thunder) animate beings; the eight of *Xùn* (Wind) disperse them—this is the spring of living things. The eight of *Kǎn* (Rain) moisten beings; the eight of *Lí* (Sun) warm them—this is the summer of growing things. The eight of *Gèn* (Mountain) halt beings; the eight of *Duì* (Marsh) delight them—this is the autumn of harvesting things. The eight of *Qián* (Heaven) govern beings; the eight of *Kūn* (Earth) store them—this is the winter of concealing things.\n\nIn this square arrangement of the sixty-four hexagrams, all proceed from north to south, from below to above—thus it is called \"reversal.\" The *Xiāntiān* (Pre-Heaven) diagrams transmitted by Master Shao originated from this.\n\nAbove, the horizontal diagram is presented first, followed by the circular and square diagrams—thus Fuxi’s hexagrammatic *Yi* may be examined in this way.\n\n*Ancient Yi Textual Origins, Volume One* concludes here.\n\n---\n\nThe *Yi* of Fuxi’s Milfoil Divination\n\nThe Master said: \"The virtue of milfoil is round and spirit-like; through spirit, it knows what is to come.\" He also said: \"It resembles heaven and earth, thus it does not transgress. Its knowledge pervades the myriad things, and its Dao aids the world—thus it does not err. It moves broadly without dissipation, delights in heaven and knows fate—thus it is without sorrow. Content with its place and earnest in benevolence, it can love—thus its spirit is without limit.\"\n\nHe further said: \"Heaven is noble, earth is humble—*Qián* and *Kūn* are thus established. The humble and noble are arrayed—ranks and positions are thus determined. Movement and stillness have constancy—firmness and softness are thus decided. Things gather by kind, beings divide into groups—good and ill fortune thus arise. In heaven, images form; on earth, shapes take form—transformation and change are thus manifest.\" Therefore, firmness and softness grind against each other, and the eight trigrams surge together. All these speak of Fuxi’s *Yi* of milfoil divination.\n\nOnly by possessing the round, spirit-like art of milfoil divination can one seek the principles of heaven, earth, and the myriad things within the hexagrams that conceal the past. Only then can the future’s good and ill fortune, regrets and humiliations be known. Thus, this work of textual origins follows with the *Yi* of Fuxi’s milfoil divination.\n\n**The River Chart (First)**\nThe *Xici* says: \"The Yellow River brought forth the Chart; the Luo River brought forth the Writing—sages took them as models.\" It also says: \"Heaven-one, earth-two; heaven-three, earth-four; heaven-five, earth-six; heaven-seven, earth-eight; heaven-nine, earth-ten. Heaven’s numbers are five, earth’s numbers are five; the five positions interact and each has its union. Heaven’s numbers total twenty-five; earth’s numbers total thirty. Together, heaven and earth’s numbers total fifty-five. This is how transformations are accomplished and the spirits operate.\"\n\nZú says: Sages took the River Chart as the model for generating milfoil divination, just as they took the Luo Writing as the model for turtle-shell divination. Following the preceding statement that \"nothing is greater than milfoil and turtle-shell divination,\" both the River Chart and Luo Writing are thus mentioned. The *Book of Han: Treatise on Pitch Pipes and Calendar* quotes this passage from \"heaven-one\" to \"the spirits operate\" as sixty-four continuous characters. After Bān Gù (Mèngjiān), it is unclear when Gāo Dì placed the twenty characters from \"heaven-one\" to \"earth-ten\" in the later chapter. Now, following the Chéng-Zhū school, the misplaced bamboo slips are corrected. This is what is called the numerical pattern of the River Chart.\n\nA dragon-horse emerged from the Yellow River, its back bearing swirling hair arranged in circular patterns like stars—hence it is called a \"chart,\" and since it emerged from the river, it is called the \"River Chart.\" Generally, the numbers of the world begin with one and are completed by ten—nothing exceeds ten. Adding one to one makes ten; adding ten to one makes two. From this ten arise hundreds, thousands, ten thousands, and all numbers beyond ten.\n\nYet the numbers of the River Chart differ. Heaven-one is one; when heaven-three is added to heaven-one, it becomes four. One obtains one, three obtains three, and three unites with one. When heaven-five is added, it interacts with one and three to form nine. When heaven-seven is added, it interacts with one, three, and five to form sixteen. When heaven-nine is added, it interacts with one, three, five, and seven to form twenty-five. Five is called the proper number of heaven; twenty is called the extended number. Though it is said to extend to twenty, in truth it does not exceed heaven’s five.\n\nEarth-two is two; when earth-four is added to two, it becomes six. Two obtains two, four obtains four, and two unites with four. When earth-six is added, it interacts with two and four to form twelve. When earth-eight is added, it interacts with two, four, and six to form twenty. When earth-ten is added, it interacts with two, four, six, and eight to form thirty.",
      "overlap_context": "iyi was it transmitted to Shao Yaofu, who first elucidated it. Such claims are profoundly thoughtless. The Master’s words shine as brightly as the sun and stars. Fuxi originally used the hexagrams, while the Master spoke in terms of images to expound upon them—thus without reflection, one cannot grasp their essence. For this reason, the diagram is presented in detail below, so that later generations may know that what the diviners kept secret originated in the Master’s words and is beyond doubt.",
      "start_char": 3876,
      "end_char": 5167,
      "start_sentence": 198,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.24859929084778,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "日五者，地数之正。 日二十五者，衍出之数。 虽日衍出二十五，而其实不出乎地数五之外也。 总天地之数五十有五。 日十者，天地之正数。 日四十五者，天地衍出之数，而衍出之数实不出乎十数之外。 不出十数之外而衍出五十有五之数，由是天数本奇然阳变而化阴，地数本偶然阴变而化阳，以此五十五数而完成、而变化之屈伸往来，其妙元穷。 以此五十五数而流行也。 伏义圣人安得不则之以为大衍之数，而用以搽着求卦也与？ 则之之法见下文。 大衍第二 大衍之数五十，其用四十有九。 分而为二以象两，挂一以象三，碟之以四以象四时，归奇于初以象闰，五岁再闺，故再劫而后挂。 鷟曰：此承上文而言伏羲则河图之数以蝶着求卦也。 河图天数五，衍为二十有五。 地数五，衍为三十矣。 然犹未尽乎衍之极也。 故伏羲则河图而大衍之则又九十有九焉。 大衍者，一与二为三，二与三为五，三与四为七，四与五为九，合三、五、七、九为二十有四。 由是五与六为十一，而一居其中。 又六与七为十三，七与八为十五，八与九为十七，九与十为十九，再合三、五、七、九又为二十有四，合十一之十，十三之十，十五之十，十七之十，十九之十，凡为十者五，此大衍中之体数也，故日大衍之数五十。 合前之二十有四与后之二十有四，并居中之一，共四十有九，为大衍中之用数，故日其用四十有九。 虽衍为九十有九，亦不出乎天一至地十之外。 此其所以为则河图之衍数而为大衍之极其数也。 夫子说出一衍字以发河图之意，加一大字以发明伏羲则河图之意，圣笔如化工，其妙元穷而简易易知，岂不信哉。 蝶着之法取其变，有取其辞、取其用，有取其体。 五十虽为河图之大衍，然犹为变中之静，用中之体，故置之不用。 四十九者，变中之变，用中之用，故特用之以蝶着求卦也。 从一而左右数之，皆一、三、五、七、九而为天数五，乾之纯粹精而元阴柔偶数之驳杂，且前后二十有四，分二之象也。 一居于中，挂一之象也。 日三、五、七、九有四者，蝶四之象也。 又三、五、七、九有四者，再蝶之象也。 皆出于天机自然之法象，而非一毫人力私知得以营为于其问。 於此见伏羲制作之神，妙有非常情所能窥测者。 连山氏、归藏氏，夏、商、周历代遵而用之。 虽杂其序，於理不越有以也。 夫晋人取老庄宗旨以解大易，乃曰：四十九着者，即五十之虚一不用也。 虚一不用，所以象太极也。 夫太极枢纽，造化根抵，品汇而理气之妙合，本无时而可离者。 今乃独拈一策，屏诸元甩之椟中，退闲於静，则是造化品汇，亦有不叉枢纽根抵之时，而理之与气亦有时而可离，而几二挂一蝶四归奇皆四十九策之所营，太极一策倦勤于椟中，漫不知所统括，反不如四十九策之有用。 其为说也，不亦悖乎？ 夫所置之一策与所用之四十九策，长短大小，彼此如一。 今信手置下一策即便变器而为道，改形而为理，尊称日太极，崇重神妙元与比伦，何其侥幸之至。 而所取用之四十九策失其枢纽，别远根抵，专擅勤劬纷纷用事於外，而不得与所置一策媲美，是何其大不侥幸耶？ 愈见晋人解经之元当。 且河图衍数五十有五。 今大衍之而反少其五，又安得谓之大衍哉。",
      "translated_text": "Five is called the proper number of earth; twenty-five is called the extended number. Though it is said to extend to twenty-five, in truth it does not exceed earth’s five.\n\nThe sum of heaven’s and earth’s numbers is fifty-five. Ten is called the proper number of heaven and earth; forty-five is called the extended number of heaven and earth. Yet the extended number does not exceed ten. Though it does not exceed ten, it extends to fifty-five. Thus, heaven’s numbers, originally odd, transform through yang to become yin; earth’s numbers, originally even, transform through yin to become yang. Through these fifty-five numbers, completion and transformation, contraction and expansion, coming and going—its subtlety is inexhaustible. Through these fifty-five numbers, the Dao flows.\n\nHow could the sage Fuxi fail to take this as the number of the Great Expansion, using it to manipulate milfoil stalks and divine the hexagrams? The method of taking it follows below.\n\n**The Great Expansion, Second Chapter**\nThe number of the Great Expansion is fifty; its use is forty-nine. Divide them into two to symbolize the Two (yin and yang); suspend one to symbolize the Three (heaven, earth, and humanity); count them by fours to symbolize the four seasons; return the remainders to the beginning to symbolize intercalary months. Five years require two intercalations, hence the second counting follows the suspension.\n\nThe commentary states: This continues the preceding discussion, explaining how Fuxi took the numbers of the River Chart to manipulate milfoil stalks and divine the hexagrams. The River Chart’s heavenly numbers, five, extend to twenty-five; its earthly numbers, five, extend to thirty. Yet this still does not exhaust the full extent of the extension. Thus, Fuxi took the River Chart and further expanded its principles to ninety-nine.\n\nThe Great Expansion: one and two make three; two and three make five; three and four make seven; four and five make nine. Combining three, five, seven, and nine yields twenty-four. Then, five and six make eleven, with one residing in the center. Further, six and seven make thirteen; seven and eight make fifteen; eight and nine make seventeen; nine and ten make nineteen. Combining three, five, seven, and nine again yields twenty-four. Together with the tens from eleven, thirteen, fifteen, seventeen, and nineteen—five tens in all—this forms the essential number of the Great Expansion, hence it is said, “The number of the Great Expansion is fifty.” Combining the first twenty-four, the latter twenty-four, and the one in the center totals forty-nine, which is the operational number of the Great Expansion, hence it is said, “its use is forty-nine.” Though it extends to ninety-nine, it does not exceed the range from heaven-one to earth-ten. This is why it serves as the extended number of the River Chart and the ultimate number of the Great Expansion.\n\nThe Master (Confucius) introduced the term “extension” to elucidate the meaning of the River Chart, adding the word “Great” to clarify Fuxi’s principle of taking the River Chart. The sage’s brushwork is like the work of creation—its subtlety is inexhaustible, yet it is simple and easily understood. Is this not truly so?\n\nThe method of manipulating milfoil stalks seeks their changes: some take their words, some their use, some their essence. Though fifty is the Great Expansion of the River Chart, it remains static within change and the essence within use, hence it is set aside and unused. Forty-nine, however, is change within change and use within use, thus it is specifically employed to manipulate milfoil stalks and divine the hexagrams.\n\nCounting from one to the left and right, all are one, three, five, seven, nine—the five heavenly numbers, the pure and unadulterated essence of Qian, free from the impurity of yin’s even numbers. The two sets of twenty-four before and after symbolize the division into two. The one residing in the center symbolizes the suspension of one. The four instances of three, five, seven, and nine symbolize counting by fours. The second set of three, five, seven, and nine symbolizes the second counting. All arise from the natural patterns of heaven’s mechanism, without the slightest interference of human effort or private knowledge.\n\nHere we see the divine craftsmanship of Fuxi’s creation—its marvels surpass what ordinary reason can fathom. The Lianshan and Guicang systems, followed by the Xia, Shang, and Zhou dynasties, all adhered to this method. Though their sequences varied, their principles did not transgress this foundation.\n\nNow, the Jin scholars, drawing on the principles of Laozi and Zhuangzi to interpret the *Book of Changes*, claim: “The forty-nine stalks represent the fifty with one left unused. Leaving one unused symbolizes the Supreme Ultimate.” The Supreme Ultimate is the pivot of creation, the root of transformation, the wondrous union of principle and qi in the myriad things—it is never absent for even a moment. Yet they single out one stalk, cast it aside into an unused box, and relegate it to stillness. This implies that creation and the myriad things sometimes lack a pivot or root, and that principle and qi may at times be separated. Meanwhile, the operations of “suspending two, hanging one, counting by fours, and returning the remainders” are all managed by the forty-nine stalks, while the Supreme Ultimate, the single stalk, idly rests in its box, oblivious to its role in unifying all. Is it not less useful than the forty-nine stalks? Their theory is truly perverse.\n\nThe set-aside stalk and the forty-nine stalks in use are identical in length and size. Yet by casually setting aside one stalk, they arbitrarily transform an instrument into the Dao, alter its form into principle, and exalt it as the Supreme Ultimate, venerating it as divinely subtle beyond compare. How fortunate for it! Meanwhile, the forty-nine stalks in use lose their pivot, sever their root, and toil busily in external operations, unable to rival the set-aside stalk. How profoundly unfortunate for them! This further reveals the absurdity of the Jin scholars’ interpretation of the classic.\n\nMoreover, the River Chart’s extended number is fifty-five. Yet the Great Expansion reduces it by five—how can it still be called the Great Expansion?",
      "overlap_context": "er of heaven; twenty is called the extended number. Though it is said to extend to twenty, in truth it does not exceed heaven’s five.\n\nEarth-two is two; when earth-four is added to two, it becomes six. Two obtains two, four obtains four, and two unites with four. When earth-six is added, it interacts with two and four to form twelve. When earth-eight is added, it interacts with two, four, and six to form twenty. When earth-ten is added, it interacts with two, four, six, and eight to form thirty.",
      "start_char": 5167,
      "end_char": 6388,
      "start_sentence": 265,
      "end_sentence": 311,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.515847206115723,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "鷟按：《汉书·五行志》刘敌曰：伏义受河图，则而画之八卦是也。 禹治洪水，赐洛书，法而陈之洪范是也。 邵子曰：圆者星也。 历纪之数，其肇于此乎？ 方者土也。 画州井地之法，其放于此乎？ 益圆者，河图之数。 方者，洛书之文。 故义、文因之而造易，禹、箕叔之而作范也。 吴先生曰：河图者，河有龙马出，而马皆之旋毛有此十数也。 洛书者，洛有神龟出，而龟甲之坼文有此九数也。 以旋毛如星点之圆圈，故日图。 以坼文如字画之纵横，故日书。 河图之马不异于几马，洛书之龟不异于几龟。 至今马背之毛，其旋有如星点，特其旋元此十数耳。 至今龟背之甲，其坼有如字画，特其坼元此九数耳。 郑氏曰：河出图，有自然之象。 洛出书，有自然之文。 鷟曰：伏羲则河图以生着，则洛书以作龟。 河图之则即大衍是也。 今列图于左。 洛书之则未详。 其后神禹时，洛亦出书，禹因之以叔畴。 成王时，陈宝河图在束序。 夫子又曰：河不出图，与凤乌并言，则为圣王之祯祥也。 尚矣。 天一、天三、天五、天七、天九，五位相得而各有合。 天数二十有五。 □五位者天数五之五位也，故相得而各有合，衍为二十有五。 地二、地四、地六、地八、地十，五位相得而各有合。 地数三十。 □五位者，地数五之五位也。 故相得而各有合，衍为三十。 凡天地之数五十有五。 □天数五而已，衍出二十合为二十五。 然未尝出五数之外。 地数五而已，衍出二十五，合为三十，亦未尝出五数之外。 总天地之数五十有五，又未尝出乎天地之数之外。 不出乎河图天一至地十之五位共为十数之外，而多出五十有五数，有若书衍文然者，吾故日河图衍数。 鷟曰：汉儒释五位相得而各有合为一、六、二、七、三、八、四、九、五、十之相得各有合。 果如是，则当云十位，不当云五位也。 又当急缀之以天地之数五十有五之几者言，不当更分天数二十有五、地数三十也。 今既分而言之，可见天五位承上天数五而言，地五位承上地数五而言，次不可以十位相得而有合矣。 此皆汉儒解经之谬，不可以不之辨也。 十一之十，十三之十，十五之十，十七之十，十九之十，几为十者五，大衍之体数也。 前后二十有四为四十八，一居其中。 通四十有九者，大衍之用数也。 置其体数不用，但用其用数者，有挂一，分二，搽四，再蝶之法。 象又出于天数之纯，元阴偶之驳杂。 伏羲所以取之以前民用也与。 鷟曰：夫子赞河图数之妙曰：此所以成变化而行鬼神。 又曰：知变化之道者，其知神之所为乎？ 又曰：神元方。 又曰：阴阳不测之谓神。 又曰：幽赞于神明而生着，参天两地而倚数。 又曰：通神明之德。 皆未有言则之以画八卦者，乃刘敌之妄而先儒误从之耳。 故特为此图以发明夫子之意，读者宜致思焉。 蝶蓄立卦生爻第三 曹之德圆而神，七七故圆。 卦之德方以知，八八故方。 六爻之义易以贡，九六则刚柔相易以告人。 圣人以此洗心，退藏於密，以此曹卦、六爻洗其忧世之心，敛藏其心於静密之地，吉凶与民同患，神以知来，知以藏往。 圣人之心未能忘民之患，何以能退藏於密哉？ 有曹之神以知吉凶，未至之事有卦之知以藏吉凶一定之理。 不言爻之贡者，统于卦之知可知也。",
      "translated_text": "Zhuo observes: According to the *Book of Han·Treatise on the Five Agents*, Liu Xin states: \"Fu Xi received the River Chart and accordingly drew the Eight Trigrams.\" This refers to that. \"Yu regulated the floodwaters and was granted the Luo Writing, from which he arranged the *Great Plan*.\" This refers to that. Master Shao says: \"The circular represents the stars. Does the reckoning of celestial cycles originate here? The square represents the earth. Do the methods of dividing lands and well-fields derive from this?\" The circular belongs to the numbers of the River Chart. The square belongs to the patterns of the Luo Writing. Thus, Fu Xi and King Wen relied on them to create the *Changes*, while Yu and Ji used them to compose the *Plan*.\n\nMaster Wu says: \"The River Chart emerged when a dragon-horse appeared in the River, its coat bearing spiral markings that formed these ten numbers. The Luo Writing emerged when a divine tortoise appeared in the Luo, its shell’s cracks forming these nine numbers. As the spiral markings resembled the round dots of stars, it was called a *Chart*. As the cracks resembled the vertical and horizontal strokes of writing, it was called a *Writing*. The River Chart’s horse differed from ordinary horses only in that its coat’s spirals formed these ten numbers. The Luo Writing’s tortoise differed from ordinary tortoises only in that its shell’s cracks formed these nine numbers. Even today, horses’ coats bear spirals resembling star-dots, though they do not form these ten numbers. Even today, tortoises’ shells bear cracks resembling written strokes, though they do not form these nine numbers.\"\n\nMaster Zheng says: \"The River produces the Chart, possessing natural images. The Luo produces the Writing, possessing natural patterns.\" Zhuo says: \"Fu Xi used the River Chart to generate the milfoil stalks and the Luo Writing to create the tortoise-shell divination. The principle of the River Chart is precisely the Great Expansion. Here, the Chart is presented to the left. The principle of the Luo Writing remains unclear. Later, during the time of the divine Yu, the Luo also produced a Writing, which Yu used to arrange the *Plan*. In the reign of King Cheng, the Chenbao River Chart was kept in the eastern chamber. Confucius also said: 'The River does not produce the Chart,' pairing it with the phoenix and black crow as auspicious signs of sage-kings. How venerable! Heaven One, Heaven Three, Heaven Five, Heaven Seven, Heaven Nine—these five positions interact and each has its correspondence. The heavenly numbers total twenty-five. These five positions are the five heavenly numbers in five positions, thus interacting and each having correspondence, expanding to twenty-five. Earth Two, Earth Four, Earth Six, Earth Eight, Earth Ten—these five positions interact and each has its correspondence. The earthly numbers total thirty. These five positions are the five earthly numbers in five positions, thus interacting and each having correspondence, expanding to thirty. The total of heavenly and earthly numbers is fifty-five. The heavenly numbers are merely five, yet they expand to twenty combinations, totaling twenty-five—never exceeding the five numbers. The earthly numbers are merely five, yet they expand to twenty-five combinations, totaling thirty—also never exceeding the five numbers. The sum of heavenly and earthly numbers, fifty-five, likewise never exceeds the total of the five positions from Heaven One to Earth Ten, which together form ten numbers. Yet it yields an additional fifty-five numbers, as if the Writing had redundant text. Thus, I call it the River Chart’s extended numbers.\"\n\nZhuo says: \"The Han scholars interpreted 'five positions interacting and each having correspondence' as the interactions and correspondences of One and Six, Two and Seven, Three and Eight, Four and Nine, Five and Ten. If this were so, it should be called *ten positions*, not *five positions*. Moreover, they should have immediately connected this to the total of heavenly and earthly numbers, fifty-five, rather than further dividing them into twenty-five heavenly numbers and thirty earthly numbers. Since they have already divided them, it is clear that the five heavenly positions refer to the five heavenly numbers above, and the five earthly positions refer to the five earthly numbers above. They cannot then be interpreted as ten positions interacting and having correspondence. These are all errors in the Han scholars’ exegesis of the classic, which must not go uncorrected.\n\nEleven tens, thirteen tens, fifteen tens, seventeen tens, nineteen tens—five instances of ten form the essential numbers of the Great Expansion. The preceding and following twenty-four make forty-eight, with one residing in the center. Together, they form forty-nine, the operational numbers of the Great Expansion. Setting aside the essential numbers and using only the operational numbers involves the methods of suspending one, dividing into two, counting four, and repeated manipulation. This further arises from the purity of heavenly (odd) numbers, avoiding the impurity of earthly (even) admixtures. This is why Fu Xi adopted it for the people’s use.\"\n\nZhuo says: \"Confucius praised the subtlety of the River Chart’s numbers, saying: 'This is how transformations are completed and spirits are set in motion.' He also said: 'One who knows the Way of transformation knows where the spiritual acts.' Again: 'The spiritual is without direction.' Again: 'The unfathomable in yin and yang is called the spiritual.' Again: 'Obscurely assisting the numinous brightness to generate the milfoil, weighing heaven and earth to rely on numbers.' Again: 'Communicating the virtue/power of the numinous brightness.' Nowhere did he speak of using it to draw the Eight Trigrams. This was Liu Xin’s delusion, which earlier scholars mistakenly followed. Thus, I have specially created this diagram to elucidate Confucius’ intent. Readers should reflect deeply upon it.\"\n\n**Third: Establishing Trigrams and Generating Lines through Milfoil Divination**\nThe virtue/power of the milfoil is circular and spiritual; seven sevens make it circular. The virtue/power of the trigrams is square and knowing; eight eights make it square. The meaning of the six lines lies in the *Changes*’ capacity to inform: the nine and six (yang and yin lines) alternate in hardness and softness to convey messages to people. The sage uses this to purify the heart, retiring and concealing it in secrecy. With this milfoil divination and six lines, he purifies his heart of worldly concerns, gathering and concealing it in a place of stillness and depth. Fortune and misfortune are shared with the people as common afflictions. The spiritual knows what is to come; knowing conceals what has passed. How could the sage’s heart, unable to forget the people’s afflictions, retire and conceal itself in secrecy? The spiritual power of the milfoil knows fortune and misfortune before they arrive; the knowing of the trigrams conceals the fixed principles of fortune and misfortune. That it does not speak of the lines’ capacity to inform is because this is encompassed by the trigrams’ knowing.\"",
      "overlap_context": ", venerating it as divinely subtle beyond compare. How fortunate for it! Meanwhile, the forty-nine stalks in use lose their pivot, sever their root, and toil busily in external operations, unable to rival the set-aside stalk. How profoundly unfortunate for them! This further reveals the absurdity of the Jin scholars’ interpretation of the classic.\n\nMoreover, the River Chart’s extended number is fifty-five. Yet the Great Expansion reduces it by five—how can it still be called the Great Expansion?",
      "start_char": 6388,
      "end_char": 7634,
      "start_sentence": 312,
      "end_sentence": 377,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.928661584854126,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "使民问筮求卦，趋吉避凶，故圣人心不复忧而得以退藏于密也，其孰能与於此哉。 古之总明截知，神武而不杀者，夫谓伏羲。 是以明於天之道而察於民之故，是兴神物以前民用，神物谓曹，圣人以此斋戒，以神明其德。 夫致精日斋，散斋曰戒。 圣人寓其神于曹之德，寓其明于卦之德，非斋戒则不足以致己#1之神明以神明其德也。 是故阖户谓之坤，握曹在手。 辟户谓之乾，分曹以搽。 一阖一辟谓之变。 搽曹之一变，往来不穷谓之通。 普数多寡难以拘定，见乃谓之象。 三变曹见，变成有奇，以象刚之七偶，以象柔之八重，以象太刚之九交，以象太柔之六曰。 四象形乃谓之器。 因象求形，多曰物器，制而用之谓之法，利用出入，民咸用之谓之神。 阖辟变通者，曹之圆象、器法。 民咸用之者，曹之神。 是故易有太极。 易，搽曹营度之易也。 曹之握分，固象户阖辟矣。 方其在椟而未启，果四象乎？ 屋栋在上而四方橡桶辐辏子栋，是名曰极。 四十九曹混然在椟而一变、三变、九变，十有八变之易森然已具于此，特为大大之屋栋，非寻常屋栋可比，故曰：易有太极，是生两四j'仪。 生是椟中取出而生也。 阖户坤仪，辟户乾仪，两相合德，故曰是生两仪。 今邑中二门题曰：仪门，两仪生，四象生，搽曹所生也。 四象，七、八、九、六所以象刚、柔、老、少，少刚七，少柔八，太刚九，太柔#2六。 分为老少，是为所以示人者。 故曰：两仪生四象，四象生八卦。 四象各专其一，八卦则成列矣。 举内八卦则八卦外不言可知矣，省文也。 八卦定吉凶，十八变内外八卦具矣。 然后占者呈卦，因可观象，玩占以定吉凶。 吉凶生大业。 吉凶既定，元疑趋避，生出极大之事功。 是故法象莫大乎天地，承言两仪成象，谓乾效法，谓坤变通，莫大乎四时。 承言一阖一辟，往来不穷。 所谓蝶之以四，以象四时。 悬象着明莫大乎日月。 承言见乃谓之象。 所以太刚为日，太柔为月，忠不高莫大乎富贵。 上句见吉凶，此句承言大业。 既有可致之资，又有能致之势。 吊民伐罪，位天地，育万物，孰非大业？ 尤宜问筮备物致用，立成器以为天下利，莫大乎圣人。 具曹物以前民用，立卦象而制成物器，使天下得以尚占，象大业以成。 惟聪明截知，神武不杀之圣人能之。 故曰：莫大探颐索隐，钩深致远，以定天下之吉凶，成天下之迭迭者，莫大乎着龟。 极言着龟之神，以见圣人之利天下莫大于此。 下文又申结之。 是故天生神物，圣人则之。 神物兼上文着、龟，则普以河图，则龟以洛书，见下天地变化，圣人效之变化即变通，效天地以闱户、辟户，效变化以一闱一辟，往来不穷。 天垂象见吉凶，圣人象之垂象，即悬象见吉凶，即蓄明象，此以示人吉凶之占，终见象定吉凶。 河出图，洛出书，圣人则之。 则河图以蝶着，则洛书以作龟。 终上文天生神物二句。 鷟曰：此篇专言着之神。 然着之所以神者，以其能取出卦之方知。 六爻之易贡者，以示人而定士口凶之占，使人得以生大业。 此所以神也。 先儒谓太极为道，两仪为初二，画四象为次四画，其失皆原于邵子。 今着其图说于左。 鷟曰：夫子言易有太极，是生两仪，两仪生四象，四象生八卦，未尝言八生十六，十六生三十二，三十二生六十四也。",
      "translated_text": "The people seek divination through milfoil to obtain hexagrams, hastening toward fortune and avoiding misfortune. Thus, the sage’s heart is no longer burdened with worry and can retire and conceal itself in secrecy—who else could achieve this? The ancients who embodied perfect clarity, divine martial prowess yet refrained from killing were none other than Fuxi. Therefore, he understood the Dao of Heaven and examined the people’s circumstances, raising forth sacred objects to guide their use. These sacred objects refer to the milfoil. The sage used them in purification rites to spiritually illuminate his virtue. Concentrated refinement is called *zhai* (fasting); dispersed vigilance is called *jie* (abstinence). The sage lodged his spirit in the virtue of the milfoil and his clarity in the virtue of the hexagrams. Without purification rites, he could not summon his own spiritual illumination to spiritually illuminate his virtue.\n\nThus, closing the door is called *Kun*; grasping the milfoil in hand. Opening the door is called *Qian*; dividing the milfoil to cast. One closing and one opening is called *change*. The casting of milfoil undergoes one change, and its endless coming and going is called *penetration*. The varying quantities of milfoil are difficult to fix, so what appears is called *image*. After three changes of the milfoil, the transformation yields odd numbers: seven odd numbers symbolize firmness, eight even numbers symbolize softness, nine symbolizes great firmness, and six symbolizes great softness. The four images take form and are called *vessels*. Deriving form from image, when many are called *objects and vessels*, shaping and employing them is called *method*. Their utility in daily life, universally adopted by the people, is called *spiritual*. The closing and opening, change and penetration, are the milfoil’s circular images, vessels, and methods. That the people universally employ them is the milfoil’s spirituality.\n\nThus, the *Yi* has the Supreme Polarity. *Yi* refers to the casting and arranging of milfoil. The grasping and dividing of milfoil inherently symbolize the opening and closing of doors. When it remains in the box unopened, does it yet contain the four images? The roof ridge stands above while the four sides converge upon it—this is called the *pole*. Forty-nine milfoil stalks, undifferentiated in the box, undergo one change, three changes, nine changes, and eighteen changes, and the *Yi*’s profound transformations are already fully present here. It is like the great ridgepole of a vast hall, incomparable to an ordinary roof beam. Thus it is said: *The Yi has the Supreme Polarity, which generates the Two Modes.* Generation occurs when they are taken from the box. Closing the door is the *Kun* mode; opening the door is the *Qian* mode. The two harmonize in virtue, hence it is said: *This generates the Two Modes.* Now, in the city, two gates are inscribed as *Gate of Modes*. The Two Modes generate the Four Images, which are generated by the casting of milfoil. The Four Images—seven, eight, nine, and six—symbolize firmness, softness, elder, and younger: seven for young firmness, eight for young softness, nine for great firmness, and six for great softness. Distinguishing elder and younger is how they instruct people. Thus it is said: *The Two Modes generate the Four Images; the Four Images generate the Eight Trigrams.* Each of the Four Images governs one aspect, and the Eight Trigrams form their arrangement. If the inner Eight Trigrams are presented, the outer Eight Trigrams need not be mentioned—this is an economy of language. The Eight Trigrams determine fortune and misfortune, and within eighteen changes, the inner and outer Eight Trigrams are complete. Then the diviner presents the hexagram, observes the images, and contemplates the oracle to determine fortune and misfortune. Fortune and misfortune give rise to great undertakings. Once fortune and misfortune are determined, all doubts are resolved, and one advances or retreats accordingly, producing the greatest achievements.\n\nTherefore, no model surpasses Heaven and Earth. This continues the idea that the Two Modes form images: *Qian* emulates Heaven’s constancy, *Kun* emulates Earth’s adaptability—nothing surpasses the four seasons. This continues the idea of one closing and one opening, endless coming and going. The text speaks of arranging them in fours to symbolize the four seasons. No suspended image is more luminous than the sun and moon. This continues the idea that what appears is called *image*. Thus, great firmness becomes the sun, and great softness becomes the moon. No aspiration is loftier than wealth and honor. The previous line speaks of fortune and misfortune; this line continues the idea of great undertakings. With attainable resources and the power to attain them, punishing the guilty and aiding the people, positioning oneself between Heaven and Earth, nurturing the myriad things—what is not a great undertaking? It is especially fitting to consult divination, prepare implements for use, and establish vessels to benefit all under Heaven—nothing surpasses the sage. He employs milfoil to guide the people’s use, establishes hexagram images to create vessels, enabling all under Heaven to esteem divination and emulate great undertakings. Only a sage of perfect clarity, divine martial prowess, and nonviolence can achieve this.\n\nThus it is said: *Nothing is greater than milfoil and tortoise shells for probing the hidden, drawing forth the profound, reaching the distant, and determining the world’s fortune and misfortune, or for accomplishing the world’s ceaseless endeavors.* This extols the spirituality of milfoil and tortoise shells to show that the sage’s benefit to all under Heaven is unparalleled. The following text further elaborates.\n\nTherefore, Heaven produces sacred objects, and the sage takes them as models. Sacred objects include the aforementioned milfoil and tortoise shells. The sage models milfoil on the *River Chart* and tortoise shells on the *Luo Writing*, as described below. Heaven and Earth transform, and the sage emulates them. Transformation is change and penetration; emulating Heaven and Earth involves closing and opening doors, and emulating transformation involves one closing and one opening, endless coming and going. Heaven suspends images to reveal fortune and misfortune, and the sage models them. Suspended images reveal fortune and misfortune, that is, luminous images—this demonstrates to people the divination of fortune and misfortune, ultimately revealing images to determine fortune and misfortune. The *River* yields the *Chart*; the *Luo* yields the *Writing*, and the sage models them. He models the *River Chart* to arrange milfoil and the *Luo Writing* to create tortoise-shell divination. This concludes the earlier statement about Heaven producing sacred objects.\n\nThe commentator says: This chapter focuses on the spirituality of milfoil. Yet milfoil’s spirituality lies in its ability to extract the hexagrams’ square knowledge. The six lines’ capacity to inform is how they reveal fortune and misfortune to people, enabling them to achieve great undertakings. This is its spirituality. Earlier scholars claimed the Supreme Polarity is the Dao, the Two Modes are the first two lines, and the Four Images are the next four lines—these errors all originate from Master Shao. Here, I present his diagrams and explanations to the left.\n\nThe commentator says: The Master spoke of *The Yi has the Supreme Polarity, which generates the Two Modes; the Two Modes generate the Four Images; the Four Images generate the Eight Trigrams*—he never spoke of eight generating sixteen, sixteen generating thirty-two, or thirty-two generating sixty-four.",
      "overlap_context": "ith the people as common afflictions. The spiritual knows what is to come; knowing conceals what has passed. How could the sage’s heart, unable to forget the people’s afflictions, retire and conceal itself in secrecy? The spiritual power of the milfoil knows fortune and misfortune before they arrive; the knowing of the trigrams conceals the fixed principles of fortune and misfortune. That it does not speak of the lines’ capacity to inform is because this is encompassed by the trigrams’ knowing.\"",
      "start_char": 7634,
      "end_char": 8866,
      "start_sentence": 378,
      "end_sentence": 438,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.756619930267334,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "邵子曰：太极既分，两仪立矣。 阳上交於阴，阴下交於阳而四象生矣。 阳交於阴，阴交於阳而生天之四象； 刚交於柔，柔交於刚而生地之四象，於是八卦成矣。 八卦相错而后万物生焉，是故一分为易二，二分为四，四分为八，八分为十六，十六分为三十二，三十二分为六十四，犹根之有干，干之有枝，枝之有叶，愈大则愈少，愈细则愈繁，合之斯为一，衍之斯为万。 朱子曰：昼之所以有奇偶，卦之所以三画而成，皆是自然流出，不假安排。 此易学之纲领，开卷第一义。 然古今未见有识者，至康节先生始传先天之学而得其说，以为伏羲氏之易也。 然愚自幼而读之，未免有疑，至壮而疑愈深，谨疏其疑於下方。 易 易者，变易也。 先儒曰：天地间阴阳而已。 伏羲画一奇画以象阳，一偶画以象阴。 又自一奇一偶相易而为四象，为八卦，极於六十四卦皆为卦画之变易。 既又为着数之变易，故名之曰易。 伏羲特未有易字也。 鷟按，此说殊未精。 夫子此易字承前章四营而成易之易字，故其下文日生四象，生八卦，定吉凶，生大业。 益专言着策之易耳。 若兼言卦画之易，则与伏羲始作八卦之形皆龃龉。 其详见下两仪、四象。 不特此耳。 下篇乾坤其易之缢，乾坤成列而易立乎其中，数易字皆与此同。 又言伏羲时未有易字者，非是。 《周官》太卜掌三易之法，一日《连山》，夏易也； 二日《归藏》，商易也； 三日《周易》。 三代皆以易称，沿于羲圣。 夏商虽别名，而其易之称则不越于羲圣。 占人掌以八笑占八颂，以八卦占筮之八故，以纸吉凶。 筮人掌三易，以辨九筮之名。 非自周而始定为易字之名也。 若伏羲时元文故元易字，则两仪、四象，乾、坤、艮、巽、震、离、坎、兑，七、八、九、六，蝶着之分，二挂一等，一切皆是后人增加。 若伏羲、太昊俱是遥称、追号，全无一点。 画文字虽作神圣奇伟之书，全赖后人锡子以易字之名，何其少我羲圣之甚一至此哉。 此因夫子作易，者之作字，遂为是言。 殊不知夫子之言，作易乃言，作周易耳。 非言其作三易。 又非言其作伏羲之全易也。 下文日其有忧息乎，当文王与纣之事邪，则其意甚明矣。 其详已见序文。 太极",
      "translated_text": "Master Shao said: Once the Supreme Polarity divides, the Two Modes are established. When yang ascends to intersect with yin, and yin descends to intersect with yang, the Four Images arise. Yang intersecting with yin and yin intersecting with yang generate the Four Images of Heaven; hard intersecting with soft and soft intersecting with hard generate the Four Images of Earth—thus the Eight Trigrams are completed. Only after the Eight Trigrams intermingle do the myriad things come into being. Therefore, one divides to become two in *Yi*, two divides to become four, four divides to become eight, eight divides to become sixteen, sixteen divides to become thirty-two, and thirty-two divides to become sixty-four—like a root giving rise to a trunk, a trunk to branches, and branches to leaves. The larger the division, the fewer the parts; the finer the division, the more numerous they become. United, they form one; extended, they become ten thousand.\n\nMaster Zhu said: That days have odd and even, and trigrams consist of three lines, all flow forth naturally without contrivance. This is the guiding principle of *Yi* learning, the first meaning upon opening the text. Yet from ancient times to the present, no one has recognized this—until Master Kangjie transmitted the learning of the Primordial Heaven and grasped its explanation, regarding it as the *Yi* of Fuxi. However, from my youth I read this with doubt, and as I matured, my doubts only deepened. I respectfully set forth my uncertainties below.\n\n*Yi* means \"change.\" Earlier scholars said: Between Heaven and Earth, there is only yin and yang. Fuxi drew one unbroken line to represent yang and one broken line to represent yin. Then, from one yang and one yin alternating, he derived the Four Images and the Eight Trigrams, extending to the sixty-four hexagrams—all transformations of the hexagram lines. Beyond this, he further established the changes in milfoil-stalk numbers, hence the name *Yi*. Yet Fuxi himself did not originally have the character *Yi*.\n\nI note: This explanation is far from precise. The *Yi* character here follows the previous chapter’s \"four operations to complete the *Yi*,\" so the subsequent text—\"giving rise to the Four Images, giving rise to the Eight Trigrams, determining fortune and misfortune, generating great undertakings\"—refers specifically to the changes of milfoil stalks. If it also included the changes of hexagram lines, it would conflict with Fuxi’s original creation of the Eight Trigrams’ forms. The details are discussed below under the Two Modes and Four Images.\n\nNot only this: In the lower chapter, \"Qian and Kun are the exhaustion of *Yi*; when Qian and Kun are arrayed, *Yi* is established within them,\" the *Yi* characters all share this meaning. Furthermore, the claim that Fuxi’s time lacked the *Yi* character is incorrect. The *Rites of Zhou* states that the Grand Diviner oversees the methods of the Three *Yi*: the first is *Lianshan*, the *Yi* of Xia; the second is *Guicang*, the *Yi* of Shang; the third is *Zhou Yi*. The Three Dynasties all used *Yi* in their titles, continuing from the Sage Fuxi. Though Xia and Shang had different names, their use of *Yi* did not deviate from the Sage Fuxi. The diviners of old used eight bamboo slips to divine the eight odes, employing the Eight Trigrams to prognosticate fortune and misfortune. The milfoil diviners managed the Three *Yi* to distinguish the names of the nine milfoil divinations. It was not only in the Zhou that the name *Yi* was established. If Fuxi’s time had no writing and thus no *Yi* character, then the Two Modes, Four Images, Qian, Kun, Gen, Xun, Zhen, Li, Kan, Dui, the numbers seven, eight, nine, and six, the division of milfoil stalks, the \"two suspended, one set aside\" method—all would be later additions. If Fuxi and Taihao were merely posthumous titles with no substance, and the hexagram texts were entirely the work of divine sages, then to rely solely on later generations for the name *Yi* would be to diminish the Sage Fuxi to an extreme.\n\nThis misconception arises because Confucius \"made the *Yi*,\" and the character *Yi* was created, leading to such claims. Yet they fail to recognize that when Confucius spoke of \"making the *Yi*,\" he referred to making the *Zhou Yi*, not the Three *Yi*, nor the complete *Yi* of Fuxi. The subsequent text—\"Did he have concerns? Was it about King Wen and Zhou’s affairs?\"—makes his intent quite clear. The details have already been discussed in the preface.\n\nThe Supreme Polarity...",
      "overlap_context": "the Dao, the Two Modes are the first two lines, and the Four Images are the next four lines—these errors all originate from Master Shao. Here, I present his diagrams and explanations to the left.\n\nThe commentator says: The Master spoke of *The Yi has the Supreme Polarity, which generates the Two Modes; the Two Modes generate the Four Images; the Four Images generate the Eight Trigrams*—he never spoke of eight generating sixteen, sixteen generating thirty-two, or thirty-two generating sixty-four.",
      "start_char": 8866,
      "end_char": 9699,
      "start_sentence": 439,
      "end_sentence": 480,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.263204336166382,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "极，屋栋也。 太者，至大之谓也。 韩康伯注曰：夫有又始于元，故太极生两仪也。 太极者，元称之称，不可得而名，取有之所极，况之太极者也。 孔颖达疏曰：太极谓天地未分之前，元气混而为一，即是太初、太一也。 故老子曰：道生一，即此太极是也。 又谓混元既分，即有天地，故日太极生两仪，即老子云一生二也。 不言天地而言两仪，指其物体，下与四象相对，故日两仪，谓两体容仪也。 朱子《本义》曰：一每生两，自然之理也。 易者，阴阳之变。 太极者，其理也。 鷟曰：康伯、颖达取老庄宗旨以解易，其说固不足辨已，但依其言，则道生天地，天地又生金、木、水、火，金、木、水、火遂生出简上之八卦矣。 不亦怪哉。 若依朱夫子之说，则阴阳之变，与其所以然之理，劈头即生出简上之初二画，初二画又生出简上之四画，次四画又生出简上之次八画，乃不分大小之混阴阳，次为二画乃分大小之别，阴阳次为三才之象，备然则初画之阴阳全元大小之别，八卦之上画即可以备乎天道、地道、人道也哉，是固不能元疑者也。 两仪 先儒曰：羲圣画卦之时，先作一画奇一以象阳，作一画偶一以象阴，后人名为两仪。 鷟曰：五。 遍诵《十翼》夫子之言，但云伏羲始作八卦，未尝云伏羲始作两仪也。 伏羲始作一画奇以象阳，一画偶以象阴者，出於何经何翼邪？ 出於经何辞，翼何篇邪？ 横图经八卦，其别六十有四。 圆图、方图皆然。 卦下分注日某卦下、某卦上，未尝言初画奇一偶一，分为四，又分为八，又分为十六，又分为#3三十二，又分为六十四也。 卦之六画，长、短、广、狭，彼此如一。 今初以奇一偶一者，而视四象当截为二段，视八卦当截为四段，视十六当截为八段，视三十二当截为十六段，视六十四当截为三十二段。 若不截则阳以奇一负载在上之三十二画，阴以偶一负载在上之三十二画，其不相伦比也明矣。 如言两仪神妙，一画可化形，三十二以配在上之数，则圣人全元此明文。 坚以此图为是，则圣人之横图、方圆图皆当裁截六十四卦之初画。 若犹遵修圣人六十四卦之本图，则此图次非圣人之法画也。 四象 先儒四奇偶一画之上各加一奇一偶。 几为画者，四以象阴阳之老少。 鷟曰：谓老阴、老阳、少阴、少阳为四象者是也，谓四象居八卦初画之上、三画之下者非也。 两仪之仪字承上文阖户辟户之户字而言，二户两仪相#4匹也。 四象之象，承上文见乃谓之象字而言，至此始着见于画。 七以象少阳，八以象少阴，九以象老阳，六以象老阴，故谓四象。 而夫子曰：易有四象，所以示也，以至此始有画象以指示人得失动静而为吉凶悔吝之占，不然何以言见乃谓象，而四象独何以言所以示者哉。 若谓锢于次二之位，则乾、兑正当者阳，高、震适当少阴，坤、艮正当老阴，巽、坎适当少阳。 羲圣之易，老变而少不变，故以《左传》三代搽着求卦之法考之，乾当变为之卦之离，兑当变为之卦之震，惟巽离独得其本卦。 何者？ 少阴不变故也。 是乾、兑本卦因柔推刚而变化，而震、离既得本卦，又得之卦，全元一乾一兑，但有重震、重离也。 坤当变为之卦之坎，艮当变为之卦之巽。 惟巽、坎独得其本卦。",
      "translated_text": "The *ji* (极) is the ridgepole of a house. *Tai* (太) signifies \"utmost greatness.\" Han Kangbo’s commentary states: \"That which exists begins with the primordial, thus the Supreme Polarity generates the Two Modes.\" The Supreme Polarity is a designation for the primordial; it cannot be named, and so we take the utmost of existence and term it the Supreme Polarity. Kong Yingda’s subcommentary says: \"The Supreme Polarity refers to the time before Heaven and Earth divided, when primordial *qi* was blended as one—this is the Grand Beginning, the Supreme Oneness.\" Thus Laozi says, \"The Dao gives birth to the One,\" and this One is the Supreme Polarity. Further, once the primordial chaos divided, Heaven and Earth emerged, hence \"the Supreme Polarity generates the Two Modes,\" which is what Laozi means by \"the One gives birth to the Two.\" It does not speak of Heaven and Earth but of the Two Modes, referring to their physical forms. Below, they correspond to the Four Images, hence they are called the Two Modes, meaning the two embodied forms.\n\nZhu Xi’s *Original Meaning* states: \"The One invariably generates the Two—this is the natural principle.\" The *Yi* concerns the transformations of yin and yang; the Supreme Polarity is its principle. Zhuo says: Kangbo and Yingda adopted the doctrines of Laozi and Zhuangzi to explain the *Yi*, and their theories are certainly not worth refuting. Yet if we follow their reasoning, the Dao generates Heaven and Earth, Heaven and Earth then generate Metal, Wood, Water, and Fire, and from these the eight trigrams on the milfoil stalks emerge—is this not preposterous? If we adhere to Master Zhu’s explanation, then the transformations of yin and yang, along with the principle underlying them, at the very outset generate the first two lines on the stalks. The first two lines then generate the next four, and these four generate the subsequent eight, without distinguishing between greater and lesser undifferentiated yin and yang. Only when divided into two lines do greater and lesser distinctions emerge, and yin and yang then form the images of the Three Powers. Yet if the first line of yin and yang entirely lacks distinction between greater and lesser, how can the upper line of the eight trigrams fully encompass the Way of Heaven, the Way of Earth, and the Way of Man? This is undoubtedly a matter of no small doubt.\n\n**The Two Modes**\nEarlier scholars say: When the Sage Fuxi drew the trigrams, he first made one unbroken line (⚊) to symbolize yang and one broken line (⚋) to symbolize yin, which later generations named the Two Modes. Zhuo says: Five. Throughout the Ten Wings, whenever Confucius speaks, he only says that Fuxi first created the eight trigrams, never that Fuxi first created the Two Modes. Where in which *Classic* or which *Wing* does it say that Fuxi first made one unbroken line to symbolize yang and one broken line to symbolize yin? In which passage of the *Classic* or which chapter of the *Wings* does this appear? In the horizontal diagram, the eight trigrams branch into sixty-four. The circular and square diagrams are the same. The annotations beneath the trigrams say \"such-and-such trigram below, such-and-such trigram above,\" never stating that the first unbroken and broken lines divide into four, then eight, then sixteen, then thirty-two, and finally sixty-four. The six lines of each trigram are uniform in length, breadth, and spacing. If we now take the first unbroken and broken lines and view the Four Images as requiring division into two segments, the eight trigrams into four, the sixteen into eight, the thirty-two into sixteen, and the sixty-four into thirty-two, then without such division, yang, with its single unbroken line, would bear the weight of the thirty-two lines above, and yin, with its single broken line, would bear the weight of the thirty-two lines above—clearly an incommensurable comparison. If one claims the Two Modes are divinely subtle, that a single line can transform its form to match the number above, then the Sage left no such explicit statement. If we insist this diagram is correct, then the Sage’s horizontal, circular, and square diagrams should all truncate the first line of the sixty-four trigrams. If we still follow the Sage’s original sixty-four-trigram diagrams, then this diagram is not the Sage’s method of drawing.\n\n**The Four Images**\nEarlier scholars added one unbroken or broken line above each of the four combinations of unbroken and broken lines, making four lines in total to symbolize the old and young of yin and yang. Zhuo says: It is correct to call old yin, old yang, young yin, and young yang the Four Images, but it is incorrect to say the Four Images reside above the first line of the eight trigrams and below the three lines. The character *yi* (仪) in \"Two Modes\" follows the *hu* (户, \"door\") from the earlier phrase \"closing and opening doors,\" meaning the two doors match each other. The *xiang* (象, \"image\") in \"Four Images\" follows the *xiang* from the earlier phrase \"what is seen is called an image,\" for only now do images manifest in the lines. Seven symbolizes young yang, eight young yin, nine old yang, and six old yin—hence the Four Images. Confucius says, \"The *Yi* has Four Images to show [the way],\" meaning only now do line images appear to indicate to people gains and losses, movement and stillness, and thus divination for good or ill fortune, regret or remorse. Otherwise, why speak of \"what is seen is called an image,\" and why would the Four Images alone be called \"what is shown\"? If we insist on fixing them in the second position, then *Qian* and *Dui* would precisely correspond to old yang, *Li* and *Zhen* to young yin, *Kun* and *Gen* to old yin, and *Xun* and *Kan* to young yang. In the *Yi* of the Sage Fuxi, the old changes while the young does not, so if we examine the method of seeking trigrams in the *Zuozhuan* across the Three Dynasties, *Qian* should change into *Li* as its derived trigram, *Dui* into *Zhen*, while *Xun* and *Li* alone retain their original trigrams. Why? Because young yin does not change. Thus the original trigrams of *Qian* and *Dui* transform through yielding to the firm, while *Zhen* and *Li* not only retain their original trigrams but also gain derived trigrams, leaving no single *Qian* or *Dui* but only doubled *Zhen* and *Li*. *Kun* should change into *Kan* as its derived trigram, *Gen* into *Xun*, while *Xun* and *Kan* alone retain their original trigrams.",
      "overlap_context": "uxi to an extreme.\n\nThis misconception arises because Confucius \"made the *Yi*,\" and the character *Yi* was created, leading to such claims. Yet they fail to recognize that when Confucius spoke of \"making the *Yi*,\" he referred to making the *Zhou Yi*, not the Three *Yi*, nor the complete *Yi* of Fuxi. The subsequent text—\"Did he have concerns? Was it about King Wen and Zhou’s affairs?\"—makes his intent quite clear. The details have already been discussed in the preface.\n\nThe Supreme Polarity...",
      "start_char": 9699,
      "end_char": 10920,
      "start_sentence": 481,
      "end_sentence": 524,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.87702250480652,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "何者？ 少阳不变故也。 是坤、艮本卦因刚推柔而变化，而巽、艮既得本卦，又得之卦，全元一坤一艮，但有重巽、重坎也。 乾、兑、坤、艮四卦亡而震、离、巽、坎四卦重，则是四象生四卦，安得谓生八卦哉。 先儒入以奇上加奇阳之纯，故象老阳。 奇上加偶者，阴杂阳中，故象少阴。 偶上加奇者，阳杂阴中，故象少阳。 偶上加偶，阴之纯，故象老阴。 以逃避老变少不变之难。 殊不知奇上加奇，偶上加偶，阴阳之纯故特称老，则加至于上六画皆纯者何以称之哉。 将自为太上老阴、太上老阳也邪？ 为论不求其精，务以取快于一时，吾无取乎耳。 八卦 夫子言伏羲始作八卦，又伏羲之卦下分注日乾下矣，未尝曰：乾下之初共一奇画，与兑、离、震同。 乾下之二共一奇画，与兑同者也。 坤下矣未尝曰：坤下之初共一偶画，与艮、坎、巽同，坤下之二共一偶画，与艮同也。 又未尝曰：乾下之三始得完全之奇画，方与初、二二画之喊杀者异。 未尝曰：坤下之三始得完全之偶画，方与初、二二画之喊杀者异也。 兑下六卦皆然。 是则初、二、三，三画之长、短、广、狭，彼此如一，然后得谓之八卦。 若初画以四卦共二画，以二卦共长、短、广、狭，彼此不一者，央不可谓之八卦，其非圣人之法画，岂不明哉？ 十六画 先儒以一每生两，自然之理，故每卦之上亦各加一阴一阳而为十六画。 然夫子初元是言也。 不惟元是言，而于八卦之下即继之以定吉凶之语。 因八卦定吉凶之语逆而推之，勋知四象生八卦者，不徒生内八卦而已，外八卦亦是四象所生。 四象既生，此内外之八卦则始谓之十有八变而成卦，非单生内八卦而小成之比，夫然后可以定吉凶也。 以此观之，则重卦四、五、上三画已毕具于四象生八卦一句之中矣。 虽欲加倍于八卦而谓十六画者，中问曾元驻足之地也。 然邵子所谓八分为十六者，诚夫子所不言之长语也，何其元稽之甚哉。 三十二画 重卦之四、五、上三画毕具于四象生八卦之中，故夫子初元三十二画之言。 夫子所不言铃欲言之，岂非长语者乎？ 然则邵子所谓十六分为三十二者，不足信亦明矣。 噫，使其言元背违于伏羲之法，元乖戾于夫子之旨，犹之可也。 今以其言稽之，外卦之四倍于内卦之三者，八外卦之五加于内卦之三者二十四，而内卦之三其喊于外卦之四与五者，亦称是伏羲之横方圆图，六画之形，长、短、广、狭，彼此元异，则倍者何时？ 而削喊者何时？ 而增以奏合三圆哉。 此不亦背违于伏羲之法乎？ 夫子之旨，以内外八卦皆生于四象，故缀之日八卦定吉凶。 今八卦之下，定吉凶之上横入以生十六、生三十二，既非夫子之明文而强生元稽之长语，此不亦乖戾于夫子之旨乎？ 非羲圣之法，非孔圣之旨，断断乎不足从也。 六十四画 此六画卦之上画，宋儒所说生卦之图。 惟此一画，六十四卦各有，在此不为多，在彼不为少。 但以为三十二画所分，则亦非伏羲之法而有叛于夫子之旨矣。 益伏义六十四卦，初二、三、四、五、上六画俱相若也。 今谓五画之上各生奇偶为六画者，六十四则是。 自此六画而下，五画喊杀三十二，乃至四画喊杀四十八，三画喊杀五十六，二画喊杀六十，初画喊杀六十二，则是先儒生卦之说一出，而使自六画以下，五画皆不得其所，不免破削支离，岂得为圣人之法、大中之旨哉。",
      "translated_text": "Why? Because young yang does not change. Thus the original trigrams of *Kun* and *Gen* transform through the firm yielding to the yielding, while *Xun* and *Kan* not only retain their original trigrams but also gain derived trigrams, leaving no single *Kun* or *Gen* but only doubled *Xun* and *Kan*. With *Qian*, *Dui*, *Kun*, and *Gen* lost while *Zhen*, *Li*, *Xun*, and *Kan* doubled, the four images give rise to four trigrams—how then can one speak of them generating the eight trigrams?\n\nEarlier scholars took a single yang line atop another as pure yang, thus symbolizing old yang. A single yang line atop a yin line, with yin mingled within yang, symbolized young yin. A single yin line atop a yang line, with yang mingled within yin, symbolized young yang. Two yin lines atop one another, pure yin, symbolized old yin. This was to evade the difficulty of old changing while young does not. Yet they failed to realize that if a single yang line atop another or a single yin line atop another—pure yin and yang—are specially called \"old,\" then what should one call a hexagram with six pure lines? Would these not become \"supreme old yin\" and \"supreme old yang\"? Such arguments, lacking precision and seeking only momentary satisfaction, are of no value to me.\n\n**The Eight Trigrams**\nThe Master said that Fuxi first created the eight trigrams. In Fuxi’s trigrams, the lower position of *Qian* is yang, yet he never stated: \"The first line of *Qian*’s lower trigram shares a single yang line with *Dui*, *Li*, and *Zhen*.\" Nor did he say: \"The second line of *Qian*’s lower trigram shares a single yang line with *Dui*.\" Likewise, for *Kun*’s lower trigram, he never said: \"The first line of *Kun*’s lower trigram shares a single yin line with *Gen*, *Kan*, and *Xun*,\" nor: \"The second line of *Kun*’s lower trigram shares a single yin line with *Gen*.\" Nor did he ever say: \"Only the third line of *Qian*’s lower trigram attains a complete yang line, distinct from the first and second lines’ truncated forms.\" Nor: \"Only the third line of *Kun*’s lower trigram attains a complete yin line, distinct from the first and second lines’ truncated forms.\" The same applies to the lower trigrams of the other six hexagrams. Thus, the first, second, and third lines—whether long, short, broad, or narrow—are uniform across all, and only then can they be called the eight trigrams. If the first line is shared by four trigrams as two lines, or by two trigrams with varying lengths, breadths, or forms, this cannot be called the eight trigrams. How could this not clearly deviate from the Sage’s method?\n\n**Sixteen Lines**\nEarlier scholars claimed that \"one generates two\" is the natural principle, so each trigram’s top should also add one yin and one yang line, resulting in sixteen lines. Yet the Master never made such a statement. Not only did he never say this, but immediately after discussing the eight trigrams, he followed with words on determining fortune and misfortune. Tracing backward from his words on fortune and misfortune determined by the eight trigrams, one realizes that the four images generate not only the inner eight trigrams but also the outer eight trigrams. Only after the four images generate these inner and outer eight trigrams can one speak of the \"ten changes that complete the hexagrams\"—not merely generating the inner eight trigrams as a minor achievement. Only then can fortune and misfortune be determined. Viewed thus, the fourth, fifth, and top lines of the doubled trigrams are already fully present in the phrase \"the four images generate the eight trigrams.\" Though one might wish to double the eight trigrams to sixteen lines, there is no place to pause in between. Yet Shaozi’s claim that \"eight divides into sixteen\" is a baseless elaboration the Master never uttered—how recklessly unfounded!\n\n**Thirty-Two Lines**\nSince the fourth, fifth, and top lines of the doubled trigrams are fully present in \"the four images generate the eight trigrams,\" the Master never spoke of thirty-two lines. For him to have left such a statement unspoken would be an unwarranted elaboration. Thus, Shaozi’s claim that \"sixteen divides into thirty-two\" is clearly unreliable. Alas! Even if his words did not contradict Fuxi’s method or deviate from the Master’s intent, they would still be tolerable. Yet when examined, his claim that the outer trigrams’ four lines are quadruple the inner trigrams’ three lines—adding the outer eight trigrams’ five lines to the inner trigrams’ three lines to make twenty-four, while the inner trigrams’ three lines are truncated by the outer trigrams’ four and five lines—also corresponds to Fuxi’s horizontal square-circle diagram. In the six-line form, length, shortness, breadth, and narrowness show no difference between inner and outer. When does the doubling occur? When does the truncation happen? And when does the addition align with the three circles? Does this not also contradict Fuxi’s method? The Master’s intent was that both inner and outer eight trigrams arise from the four images, hence his words: \"The eight trigrams determine fortune and misfortune.\" Now, inserting the generation of sixteen and thirty-two lines between the eight trigrams and the determination of fortune and misfortune—absent from the Master’s explicit text and forcibly interpolated—does this not also deviate from his intent? Neither Fuxi’s method nor Confucius’s intent, such claims are decisively unworthy of adherence.\n\n**Sixty-Four Lines**\nThis refers to the top line of the six-line hexagrams, as described in the Song scholars’ diagrams of hexagram generation. Though this single line exists in all sixty-four hexagrams—neither excessive here nor deficient there—if taken as a division of thirty-two lines, it also departs from Fuxi’s method and rebels against the Master’s intent. For in Fuxi’s sixty-four hexagrams, the first, second, third, fourth, fifth, and top lines are all uniform. To claim that the fifth line generates odd and even lines to form the sixth line in sixty-four hexagrams may hold, but from this sixth line downward, the fifth line truncates thirty-two, the fourth line truncates forty-eight, the third line truncates fifty-six, the second line truncates sixty, and the first line truncates sixty-two. Once the earlier scholars’ theory of hexagram generation emerged, it left the five lines below the sixth without proper place, inevitably fragmenting and distorting them. How could this be the Sage’s method or the Great Mean’s intent?",
      "overlap_context": " *Dui* into *Zhen*, while *Xun* and *Li* alone retain their original trigrams. Why? Because young yin does not change. Thus the original trigrams of *Qian* and *Dui* transform through yielding to the firm, while *Zhen* and *Li* not only retain their original trigrams but also gain derived trigrams, leaving no single *Qian* or *Dui* but only doubled *Zhen* and *Li*. *Kun* should change into *Kan* as its derived trigram, *Gen* into *Xun*, while *Xun* and *Kan* alone retain their original trigrams.",
      "start_char": 10920,
      "end_char": 12196,
      "start_sentence": 525,
      "end_sentence": 573,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.77662968635559,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "今皆复古而扶异说，庶不得为圣人之累也，故复载其图说于后，以明伏羲之本法、夫子之本意。 伏羲碟曹生卦图 古易考原卷中竟 #1『己』原作『已』据文义改。 #2『柔』原作『刚』，据文义改。 #3『为』原本脱漏，据前后又补。 #4『仪相』原作『相仪』，据文义改。 #5『九』原为『也』，据文义改。 古易考原卷下 《易》者，六圣人之书也。 其原出于伏羲始画八卦。 八卦之上各加八卦，因而别之为六十四卦。 三画 ,伏羲之乾字也。 外加之以三画，注曰乾下乾上，而仍名曰乾。 余七卦皆然，是为经卦。 八至於乾上加以兑，既不可以乾名，又不可以兑名，名之曰夬 。 此乾别之一也。 乾之别九有八，余七卦之别皆然，是为其别六十有四。 六十四卦之名，伏羲始制之字也。 六十四卦之称，伏义始呼之声也。 世更数代，人更数圣而卒，莫敢有移易羲圣之笔画形体与夫。 当时之称呼声音也，伏羲文字辟犹人家之一祖统宗而散为亿万之子孙元穷者乎。 夏商圣人曰禹、曰汤、周圣人曰文王、曰周公、曰孔子，互相发明，而伏羲之经流行于万古，五圣人之功为．多矣。 但各以趣之所自得者为书，故其书或首艮、或首坤、或首乾，而周公、孔子者，全宗《周易》而发挥之。 伏羲之《易》，简质而微妙元穷，包乎三代之文章者也。 三代之经，宏阔而玄妙元穷，互相发明乎羲经者也。 羲经，其太和元气之流行於四时者乎。 三代其犹春、夏、秋、冬之各专一时者乎。 夏易 孔氏曰：古者有连山氏，今夏易名《连山》，盖用连山氏之易也。 古注曰：连山者，象山之出云，连连不绝也。 愚以为此注未妥。 本文元云字，安得书云连连不绝哉。 《艮》，《大象》曰兼山，艮亦岂可谓山与云相兼而有哉。 盖艮为山，羲皇以来即有此象。 夏易首艮，故取山重卦，艮下艮上仍名艮，故曰连山。 内既有山，外复有山，相连不绝也。 若增以出云则为别意，非复正义矣。 《大象》言兼山，与连山实一揆也。 夏易之可见者独此名、书与首艮二端而已，其六十四卦之序，今皆不可考矣。 鷟曰：《易》云：探颐索隐，钧深致远，以定天下之吉凶，成天下之昼聋者，莫大乎着龟，而下文即终之以河出图、洛出书，圣人则之。 可见羲圣则图以搽着，则书以作龟也。 及神禹治水时，洛复出书，禹用之以叔畴，则以羲圣所则以蝶着者为七，稽疑中之筮，所则以作龟者为七，稽疑中之卜择。 建立卜人，乃命卜曰：雨霁蒙绎，克卜五择。 建立筮人，乃命筮曰：贞悔，占用二。 又恐卜筮比一人或有差错，元由救正，故复多其人数，俾互究其差错，立是人为卜筮之官各三人，人各有一法，所占或皆吉，或皆不吉。 若一不吉二吉则作吉用，一吉二不吉则作不吉用，故曰：占则从二人之言也。 《内传》曰：其贞风也，其悔山也，是以内卦为贞，外卦为悔。 又曰：贞屯悔豫者八，是以本卦为贞，之卦为悔。 《周易》日利贞。 不利贞，可贞。 贞疾之类为悔。 悔亡，其悔乃亡之类，皆沿于此。 盖伏羲之法而三代时出而充荣之云耳。 商易 孔氏曰：古者有归藏氏。 今商易名《归藏》，盖用归藏氏之易也。 归藏者，言万物之归根复命，皆包藏于地也。 坤为地，归藏者，地之道也。",
      "translated_text": "Now, returning to antiquity and rectifying heterodox theories, we may hope to avoid becoming an encumbrance to the Sage. Thus, we re-present the diagrams and explanations below to clarify Fuxi’s original method and the Master’s original intent.\n\n**Fuxi’s Hexagram-Generating Diagram from the *Gu Yi Kao Yuan***\n\nThe *Yi* is the work of six sages. Its origins lie with Fuxi, who first drew the eight trigrams. By appending each of the eight trigrams above the eight, he thereby differentiated them into sixty-four hexagrams.\n\nThree lines form Fuxi’s *qian* trigram. When three additional lines are appended externally—annotated as *qian* below and *qian* above—it remains named *qian*. The other seven trigrams follow the same pattern, constituting the eight primary hexagrams. When *dui* is appended above *qian*, it can neither be named *qian* nor *dui*, and is thus called *guai*. This is one of *qian*’s derivations. *Qian* has eight such derivations, and the other seven trigrams likewise each produce eight, yielding sixty-four derivative hexagrams in total.\n\nThe names of the sixty-four hexagrams were first devised by Fuxi as written characters; their appellations were first voiced by Fuxi as sounds. Over successive eras and sages, none dared alter the brushstrokes, forms, or contemporary pronunciations of Fuxi’s sacred script. Fuxi’s script, like the founding ancestor of a clan whose descendants branch into countless generations without end—\n\nThe sages of Xia and Shang were Yu and Tang; those of Zhou were King Wen, the Duke of Zhou, and Confucius. Through their mutual elucidations, Fuxi’s classic endured across the ages, and the contributions of these five sages were immense. Yet each composed their works based on their own insights, so their books sometimes begin with *gen*, sometimes with *kun*, and sometimes with *qian*. The Duke of Zhou and Confucius, however, fully adhered to the *Zhouyi* and expounded upon it.\n\nFuxi’s *Yi* is simple yet subtly profound, embracing the literary traditions of the Three Dynasties. The classics of the Three Dynasties are vast and mystically profound, mutually illuminating Fuxi’s classic. Fuxi’s classic may be likened to the primal qi of Great Harmony flowing through the four seasons, while the Three Dynasties resemble spring, summer, autumn, and winter, each specializing in its own season.\n\n**The Xia *Yi***\nKongzi said: In ancient times, there was the Lianshan clan. The Xia *Yi* is now called *Lianshan*, likely adopting the *Yi* of the Lianshan clan. An ancient commentary states: *Lianshan* symbolizes clouds rising from mountains in unbroken succession. I find this annotation inappropriate. The original text contains no such wording—how could it speak of \"unbroken succession\"? The *Daxiang* of *Gen* says \"composite mountains,\" yet how can *gen* be said to combine mountains and clouds? *Gen* represents mountains, a symbol established since Fuxi’s time. The Xia *Yi* begins with *gen*, hence it takes the doubled mountain hexagram—*gen* below and *gen* above—still named *gen*, thus called *Lianshan*. Internally there is a mountain, and externally another mountain, connected without end. To add \"rising clouds\" would introduce a separate meaning, deviating from the orthodox interpretation. The *Daxiang*’s \"composite mountains\" aligns with *Lianshan* in principle.\n\nOf the Xia *Yi*, only its name, its book, and its commencement with *gen* remain discernible; the sequence of its sixty-four hexagrams is now entirely unattestable.\n\nZhuo said: The *Yi* states: \"To delve into the profound and probe the hidden, to draw forth the distant and determine the world’s fortune or misfortune, to bring about the world’s undertakings—nothing surpasses milfoil and tortoiseshell.\" The subsequent passage concludes with \"the River brought forth the Diagram, the Luo brought forth the Writing, and the sages took them as models.\" Clearly, Fuxi modeled the diagrams to cast milfoil stalks and the writings to perform tortoiseshell divination.\n\nWhen the divine Yu governed the waters, the Luo again brought forth writings, which Yu employed to arrange the Nine Categories. Thus, the seven milfoil stalks Fuxi modeled for divination appear in the *Jiyi* section on \"Investigating Doubts,\" while the seven tortoiseshells he modeled for oracle-bone divination appear in the same section’s \"Divination and Selection.\" Establishing diviners, he commanded them: \"Rain, clearing, haze, or dawn—divine fivefold.\" Establishing milfoil casters, he commanded them: \"Inquiry and regret—use two for divination.\" Fearing that a single diviner or milfoil caster might err without means of correction, he multiplied their numbers, enabling mutual verification of mistakes. Thus, he appointed three diviners and three milfoil casters as officials, each employing distinct methods. If all three divinations were auspicious, or all inauspicious, that result was adopted. If one was inauspicious and two auspicious, the auspicious result was used; if one was auspicious and two inauspicious, the inauspicious result was used. Hence it is said: \"In divination, follow the word of two.\"\n\nThe *Neizhuan* states: \"Its *zhen* is wind, its *hui* is mountain,\" meaning the inner hexagram is *zhen* and the outer hexagram is *hui*. It also says: \"Eight *zhen* are *zhun*, *hui* are *yu*,\" meaning the original hexagram is *zhen* and the derived hexagram is *hui*. The *Zhouyi* says: \"Favorable for divination,\" \"Unfavorable for divination,\" \"May be divined,\" \"Divining illness,\" and phrases like \"regret vanishes\" or \"its regret then vanishes\"—all derive from this. These are but Fuxi’s methods, later flourishing in the Three Dynasties.\n\n**The Shang *Yi***\nKongzi said: In ancient times, there was the Guicang clan. The Shang *Yi* is now called *Guicang*, likely adopting the *Yi* of the Guicang clan. *Guicang* signifies that the myriad things return to their roots and restore their destinies, all concealed within the earth. *Kun* represents earth, so *guicang* is the Dao of earth.",
      "overlap_context": " sixth line in sixty-four hexagrams may hold, but from this sixth line downward, the fifth line truncates thirty-two, the fourth line truncates forty-eight, the third line truncates fifty-six, the second line truncates sixty, and the first line truncates sixty-two. Once the earlier scholars’ theory of hexagram generation emerged, it left the five lines below the sixth without proper place, inevitably fragmenting and distorting them. How could this be the Sage’s method or the Great Mean’s intent?",
      "start_char": 12196,
      "end_char": 13449,
      "start_sentence": 574,
      "end_sentence": 632,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.600600957870483,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "故其书以坤为首。 《说卦》曰坤以藏之是也。 商易之可见者惟此名、书及首坤之二端而已，其六十四卦之序，今皆不可考矣。 但《礼运》夫子告子游曰：坤乾之等，则想其次序首坤次乾。 文王则以坤不可以首乾，故首乾次坤耳。 以后卦次则复尤从而考也。 然移其坤乾之次而不易其乾坤之耦，则其二二相耦或者亦与周同，而次第远近则不能以尽同，亦未可知也。 《周易》泰六五，帝乙归妹，以祉元吉。 明夷之六五，箕子之明夷，利贞。 归妹六五帝乙归妹，其君之袂，不知其娣之袂。 艮、既济九三高宗伐鬼方，三年克之，未济九四震用伐鬼方，三年有赏于大国。 先儒以为当时曾占得此爻，故举以为言。 驽按：周官太卜掌三兆之法，一曰玉兆，二曰瓦兆，三日原兆。 其经兆之体皆丑，四百有二十，其颂皆千有二百。 掌三易之法，一日连山，二曰归藏，三日周易。 其经卦皆八，其别皆六十有四。 大易所谓莫大乎曹龟者，於兹见矣。 然伏羲卦序首乾、次兑、次离、次震、次巽、次坎、次艮、次坤，而其别六十亦循此经卦八之次。 夏易首艮，而序不可考。 商易首坤，而序亦不可考。 其别之从经与否，悉皆未闻。 等人掌三易以辨九等之名，一日筮更，一一曰筮咸，三日筮式，四日筮目，五日筮易，六日筮化，七曰筮祠，八曰筮参，九日筮环，以辨吉凶。 凡国之大事，先荚而后卜，上春相荚。 凡国事共等。 凡卜筮之法，皆原于伏羲元疑。 以圆神之曹求方知之卦，易贡之爻皆遵于伏羲元疑。 曹之出椟而握在手，谓之阖户。 信手平分，挂碟归奇谓之辟户。 一阖一辟谓之变，三变而成画，九变而小成，射内卦成列，十有八#1变而咸卦，然后外卦重之。 三变所成之画，或七或八，或九或六，谓之四象，所得七八则内卦为贞，外卦为悔，所得九六则本卦为贞，之卦为悔。 占则从二人之言，有大同有吉，有龟从筮逆作内吉，作外凶者，有龟筮共违千人。 用静吉，用作凶者。 同于夏而遵伏羲之法，从可知矣。 周易文王卦序周公卦变 右上经三十卦除乾、离六卦之外，余，为十二卦。 右下经三十四卦，除中孚、小过、既一济、未济四卦之外，其余三十卦皆反一之，为十五卦。 鷟曰：夫子上下《象》言往来上下，一升降进退等，皆因文王於泰、否二卦一言小往大来，大往小来而推拓之也。 一文王取伏羲卦序而杂之，皆二二相一偶，於是因二二相偶之卦体反覆观一之，是泰则三大在内，三小在外，否一则三小在内，三大在外。 在内者，自外而入内，故谓之来。 在外者，自内而出外，故谓之往。 孔子推拓之，言亦如此，意其云刚上而柔下者，刚画诚在上，柔画诚在下，柔上而刚下者亦然。 皆以二偶之卦比并观之而见其有此形体云耳，非谓以彼卦变为此卦，以此爻易为彼爻也。 若果云尔，则是以七、八之少阴、少阳错认为九、六之老阴、老阳也，不亦舛之甚邪？ 且文王、孔子於八纯卦及不反对，不言往来上下，其立言本意昭如矣。 泰，小往大来。 否，大往小来。 卦辞之言往来者始此。 夫子又拓言一上下进退，升降往来者，皆本诸此。 一然文王、孔子亦非以泰往之三阴即一为否来之三阴，泰来之三阳即为否一往之三阳。",
      "translated_text": "Thus, its text begins with *Kun*. The *Shuogua* states, \"*Kun* conceals them\"—this confirms it. Of the Shang *Yi*, only these two aspects remain discernible: its name and its commencement with *Kun*. The sequence of its sixty-four hexagrams can no longer be verified. However, in the *Liyun*, Confucius tells Ziyou: \"The order of *Kun* and *Qian*...\"—one may infer that its sequence began with *Kun* followed by *Qian*. King Wen, however, deemed *Kun* unfit to precede *Qian*, so he placed *Qian* first and *Kun* second. As for the subsequent hexagram order, further investigation remains elusive. Yet if only the positions of *Kun* and *Qian* were transposed without altering their paired structure, then their binary couplings might still align with the *Zhouyi*, though the precise sequence and proximity could not have been entirely identical.\n\nIn the *Zhouyi*, *Tai*’s sixth line five reads: \"Di Yi marries off his younger sister—auspicious and supremely fortunate.\" *Mingyi*’s sixth line five states: \"Jizi’s *mingyi*—favorable for divination.\" *Guimei*’s sixth line five says: \"Di Yi marries off his younger sister—the lord’s sleeve, unaware of her sister’s sleeve.\" *Gen* and *Jiji*’s ninth line three: \"King Gaozong campaigns against Guifang, conquering it in three years.\" *Weiji*’s ninth line four: \"Zhen is used to campaign against Guifang, rewarded after three years by a great state.\" Former scholars believed these lines were cited because they had once been divined, hence their inclusion.\n\nI, Nu, note: The *Zhouli*’s *Taibu* oversees the three methods of milfoil divination: first, jade milfoil; second, tile milfoil; third, plain milfoil. Their milfoil forms are all \"chou,\" totaling four hundred and twenty, with accompanying odes numbering one thousand two hundred. It also governs the three *Yi* systems: first, *Lianshan*; second, *Guicang*; third, *Zhouyi*. Each system’s primary trigrams number eight, with sixty-four derivative hexagrams. The *Dayi*’s assertion that \"nothing surpasses tortoise and milfoil\" is thus exemplified.\n\nHowever, Fuxi’s hexagram sequence begins with *Qian*, followed by *Dui*, *Li*, *Zhen*, *Xun*, *Kan*, *Gen*, and *Kun*, with its sixty-four hexagrams arranged accordingly. The Xia *Yi* begins with *Gen*, but its sequence is unverifiable. The Shang *Yi* begins with *Kun*, yet its sequence is likewise lost. Whether its hexagrams followed the primary trigrams remains unknown.\n\nThe *Dengren* oversees the three *Yi* systems to distinguish nine divination methods: first, *shigeng*; second, *shixian*; third, *shishi*; fourth, *shimu*; fifth, *shiyi*; sixth, *shihua*; seventh, *shici*; eighth, *shican*; ninth, *shihuan*—each employed to discern fortune and misfortune. For major state affairs, milfoil divination precedes tortoise-shell divination, conducted in early spring. All state matters involve divination.\n\nAll divination methods originate from Fuxi’s primordial milfoil. Round milfoil divination seeks the square hexagrams of knowing; the *Yi*’s hexagrams and lines all adhere to Fuxi’s primordial milfoil. When milfoil emerges from its case and is grasped in hand, it is called \"closing the door.\" Dividing it evenly by hand, suspending the excess, and returning the remainder is called \"opening the door.\" One closing and one opening constitute a *bian*; three *bian* form a line. Nine *bian* achieve a minor completion, casting the inner hexagram. Eighteen *bian* complete the full hexagram, after which the outer hexagram is added. The lines formed by three *bian*—whether seven, eight, nine, or six—are called the four images. If seven or eight are obtained, the inner hexagram is *zhen* and the outer is *hui*; if nine or six are obtained, the original hexagram is *zhen* and the derived hexagram is *hui*. Divination follows the interpretations of two diviners: some results align, some are auspicious, some favor tortoise over milfoil (inner auspicious, outer inauspicious), some oppose both tortoise and milfoil (quiescence auspicious, action inauspicious). Their adherence to the Xia system while following Fuxi’s method is thus evident.\n\nThe *Zhouyi*’s King Wen hexagram sequence and the Duke of Zhou’s hexagram transformations:\nThe first thirty hexagrams of the upper canon, excluding *Qian* and *Li*’s six lines, leave twelve hexagrams. The thirty-four hexagrams of the lower canon, excluding *Zhongfu*, *Xiaoguo*, *Jiji*, and *Weiji*, leave thirty hexagrams, which are inverted to form fifteen hexagrams.\n\nZhuo remarks: Confucius’ *Xiang* commentaries on \"coming and going,\" \"ascending and descending,\" \"advancing and retreating\" all stem from King Wen’s single statement in *Tai* and *Pi*: \"The small departs, the great arrives\" and \"The great departs, the small arrives.\" King Wen adopted Fuxi’s hexagram sequence but rearranged it into binary pairs. Observing these paired hexagrams in inversion, *Tai* has three yang lines inside and three yin lines outside, while *Pi* has three yin lines inside and three yang lines outside. The inner lines, coming from without, are called \"arriving\"; the outer lines, departing from within, are called \"departing.\" Confucius expanded this, stating that when the firm ascends and the yielding descends, the firm lines are indeed above and the yielding below, and vice versa. All these observations arise from comparing paired hexagrams to discern their forms—not by transforming one hexagram into another or altering lines between them. If that were the case, it would mistakenly conflate the young yin and yang (seven and eight) with the old yin and yang (nine and six)—would this not be a grave error?\n\nMoreover, King Wen and Confucius did not discuss \"coming and going\" or \"ascending and descending\" in the eight pure hexagrams or non-inverted pairs, making their original intent abundantly clear. *Tai* states: \"The small departs, the great arrives.\" *Pi* states: \"The great departs, the small arrives.\" These are the first instances of \"coming and going\" in hexagram statements. Confucius further expanded this to include \"ascending and descending,\" \"advancing and retreating,\" all derived from these principles. Yet neither King Wen nor Confucius equated *Tai*’s departing three yin lines with *Pi*’s arriving three yin lines, nor *Tai*’s arriving three yang lines with *Pi*’s departing three yang lines.",
      "overlap_context": "ases like \"regret vanishes\" or \"its regret then vanishes\"—all derive from this. These are but Fuxi’s methods, later flourishing in the Three Dynasties.\n\n**The Shang *Yi***\nKongzi said: In ancient times, there was the Guicang clan. The Shang *Yi* is now called *Guicang*, likely adopting the *Yi* of the Guicang clan. *Guicang* signifies that the myriad things return to their roots and restore their destinies, all concealed within the earth. *Kun* represents earth, so *guicang* is the Dao of earth.",
      "start_char": 13449,
      "end_char": 14670,
      "start_sentence": 633,
      "end_sentence": 681,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.761761903762817,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "自二卦之反对观之，出一而往外，故日往，入而来内，故日来一耳。 若言今岁三阳即旧岁正月之三一阳，今岁三阴即旧岁七月之三阴，是天地间止有此气藏在一处，待时而出入，全无新新相继者矣。 自古及今，有此理也乎哉？ 今日泰自归妹来，六往居四，九来居三； 否自渐来，九往居四，六来居三，则不惟以爻之变动解画之安静，而且以四、三之一小一大默改文王之三小三大，其如圣经之偕驰何？ 需，位乎天位以正中也。 天位五也，以讼之反对观之，既得正又居中也。 讼，刚来而得中也。 以需之反对观之，彼得正又居中，此但得中不能得正。 朱子曰：讼卦自逐而来，四阳二阴一自逐来者十四卦。 讼即初变之卦，刚来居二，柔进居三。 丘氏曰：此《彖辞》言卦变之始。 惊则以为坎之中往而居五，则正中来而居二，则得中。 岂不直截而简易哉。 随，刚来而下柔，动而说，随。 《本义》云：自困卦九来居初，又自噬嗑九来居五，而自既济来者兼此二变，皆刚来随柔之义。 蛊，刚上而柔下，巽而止，蛊。 熏氏曰：自贲、井、既济来，皆刚上而柔下，此变卦也非#2。 鷟曰：以二卦反对观之，蛊上之刚自外来，初而下於二、三、上，柔随初刚，自下而上，上之柔自上而下。 先儒又以六子套括之曰：否初与随上相易，泰初与蛊上相易者尤非。 噬嗑，柔得中而上行。 先儒以为自否变，自初上行至五。 非。 贲，柔来而文刚，分刚上而文柔。 以为自、泰变泰之刚往上，非。 鷟曰：刚柔分之，分即分刚上而之柔#3之分。 卦言柔离之五，后卦言柔离之二、五得中而不正，二得中而又得正，故尤以为贵。 元妄，刚自外来而为主於内。 谓自逐三变，非。 大畜，刚上而尚贤。 谓自大壮四变而上下，非。 鷟曰：元妄之刚，自大畜之上外来而为主於内之初，大畜之刚，以元妄之初上而自尊尚贤，以反对而玩象。 下象 咸，柔上刚下。 谓自於否变，非。 恒，刚上柔下。 谓自於泰变，非。 鷟曰：此以反对玩象，甚是明白。 晋，顺而丽乎大明，柔进而上行。 谓自观四进而上行至五，非。 明夷。 家人。 湀，说而丽乎明，柔进而上行。 谓自巽四进而上行至五，非。 鷟曰：四卦皆有离体进而上行，则喜谈之退而下行，则不乐道之圣人之重明也。 如此以四卦反对取义，最宜潜玩。 蹇，利西南，往得中也。 不利束北，其道穷也。 利见大人，往有功也。 谓震初易五，四易三，非。 解，利西南，往得众也。 其来复吉，乃得中也。 有攸往，夙吉，往有功也。 谓艮上易二，艮二易上者，无稽。 鷟曰：此亦甚明。 损，损下益上，其道上行。 谓泰三变上者，非。 益，损上益下，自上下下。 谓否四变初者，非。 鷟曰：损下益上则损，损上益下则益。 二卦颠倒玩象，辞甚明而义甚闳。 谓自泰否来者，何相关涉之有？ 萃，聚也。 顺以说，刚中而应，故聚也。 升，柔以时，升巽而顺，刚中而应，是以大亨。 张氏曰：柔指六四。 徐氏曰：解之六二上而为六四，如此言见夫子之言柔升。 但言四一画而已，五与上皆不言升，何其诡经偕圣至如此者哉。 又以六之之，则以爻而释卦，可谓不辨菽麦矣。 然则经何以不言柔以时降邪？ 曰：升则侈言之，降则不铃言之。",
      "translated_text": "Viewing the two hexagrams in their inverted opposition, what moves outward is called \"departing,\" while what enters inward is called \"arriving\"—nothing more. If one were to claim that this year’s three yang lines are the same as last year’s three yang lines of the first month, or that this year’s three yin lines are the same as last year’s three yin lines of the seventh month, it would imply that heaven and earth contain only this single *qi*, stored in one place and awaiting its time to emerge or withdraw, with no continuous renewal. Has such a principle ever existed from ancient times to the present?\n\nConsider *Tai* evolving from *Guimei*: the sixth line departs to the fourth position, while the ninth line arrives at the third. Or *Pi* evolving from *Jian*: the ninth line departs to the fourth position, while the sixth line arrives at the third. This interpretation not only imposes the mutability of lines upon the stability of the hexagram’s structure but also subtly alters King Wen’s \"three small\" and \"three great\" by reducing them to a single small and a single great line. How can this align with the concurrent truths of the sacred scriptures?\n\n*Xu* occupies the celestial position with correctness and centrality. The celestial position is the fifth; viewed through its opposition with *Song*, it attains both correctness and centrality. *Song* states: \"The firm arrives and attains the center.\" Viewed through its opposition with *Xu*, it attains correctness and centrality, yet here it attains only centrality, not correctness. Master Zhu said: *Song* arises from *Zhu*, and among the fourteen hexagrams that emerge from *Zhu*, *Song* is the first to transform—its firm line arrives at the second position, while the yielding line advances to the third. Mr. Qiu stated: This is the beginning of hexagram transformation as described in the *Tuan* commentary.\n\nSome mistakenly believe that the central line of *Kan* departs to the fifth position, while the correct and central line arrives at the second, thus attaining centrality. Is this not straightforward and simple? *Sui* states: \"The firm arrives and submits to the yielding; movement brings joy—this is *Sui*.\" The *Benyi* explains: It arises from *Kun*, where the ninth line arrives at the first position, and from *Shihe*, where the ninth line arrives at the fifth. The version derived from *Jiji* combines these two transformations, both embodying the principle of the firm following the yielding. *Gu* states: \"The firm ascends while the yielding descends; compliance and stillness—this is *Gu*.\" Master Xun said: It arises from *Bi*, *Jing*, and *Jiji*, where the firm ascends and the yielding descends—these are all transformed hexagrams.\n\nMaster Zhuo said: Viewing the two hexagrams in opposition, the firm line ascending in *Gu* comes from without, initially descending to the second and third positions, while the yielding line follows the initial firm line, ascending from below. The yielding line at the top descends from above. Earlier scholars further encapsulated this with the six children, claiming that the first line of *Pi* exchanges with the top line of *Sui*, and the first line of *Tai* exchanges with the top line of *Gu*—this is even more erroneous.\n\n*Shihe* states: \"The yielding attains the center and ascends.\" Earlier scholars believed it transforms from *Pi*, with the line ascending from the first to the fifth position—this is incorrect. *Bi* states: \"The yielding arrives and adorns the firm; the firm is divided and ascends to adorn the yielding.\" Some claim it transforms from *Tai*, with *Tai*’s firm lines ascending—this is also incorrect. Master Zhuo said: The division of firm and yielding refers to the separation where the firm ascends to the yielding.\n\nThe hexagram’s text speaks of the yielding line at the fifth position of *Li*, while the subsequent hexagram speaks of the yielding lines at the second and fifth positions—though both attain centrality, the second also attains correctness, making it especially esteemed. *Yu* states: \"The firm comes from without and becomes master within.\" Some claim it transforms from *Zhu* through three changes—this is incorrect. *Daxu* states: \"The firm ascends and esteems worthiness.\" Some claim it transforms from *Dazhuang*, with the fourth line ascending and descending—this is also incorrect. Master Zhuo said: The firm line of *Yu* comes from the top of *Daxu* to become the master within at the first position, while the firm line of *Daxu* ascends from the first position of *Yu* to esteem worthiness—this is understood through opposition and symbolic reflection.\n\nThe lower images:\n*Xian* states: \"The yielding ascends while the firm descends.\" Some claim it transforms from *Pi*—this is incorrect. *Heng* states: \"The firm ascends while the yielding descends.\" Some claim it transforms from *Tai*—this is also incorrect. Master Zhuo said: This interpretation, derived from oppositional reflection, is exceedingly clear.\n\n*Jin* states: \"Compliance and attachment to great brightness; the yielding advances and ascends.\" Some claim it transforms from *Guan*, with the fourth line advancing to the fifth—this is incorrect. *Mingyi*, *Jiaren*, and *Kui* state: \"Joy and attachment to brightness; the yielding advances and ascends.\" Some claim it transforms from *Xun*, with the fourth line advancing to the fifth—this is also incorrect. Master Zhuo said: All four hexagrams contain the *Li* trigram, where the yielding line advances and ascends, while the joyful line retreats and descends. This reflects the sage’s emphasis on brightness. Such interpretations, derived from the opposition of these four hexagrams, are most worthy of deep contemplation.\n\n*Jian* states: \"Favorable in the southwest, where one attains the center by departing. Unfavorable in the northeast, where the Way is exhausted. Favorable to see the great person, as departing brings achievement.\" Some claim the first line of *Zhen* exchanges with the fifth, and the fourth with the third—this is baseless. *Xie* states: \"Favorable in the southwest, where one attains the multitude by departing. Returning brings good fortune, as it attains the center. Having somewhere to go, early good fortune brings achievement.\" Some claim the top line of *Gen* exchanges with the second, and the second with the top—this is equally unfounded. Master Zhuo said: This is also quite clear.\n\n*Sun* states: \"Diminishing below to augment above—its Way ascends.\" Some claim it transforms from *Tai*, with the third line ascending—this is incorrect. *Yi* states: \"Diminishing above to augment below—descending from above.\" Some claim it transforms from *Pi*, with the fourth line descending to the first—this is also incorrect. Master Zhuo said: Diminishing below to augment above is *Sun*; diminishing above to augment below is *Yi*. The two hexagrams are inversions of each other, their words clear and their meanings profound. What connection do they have with transformations from *Tai* or *Pi*?\n\n*Cui* states: \"Gathering. Compliance and joy; the firm is central and responsive—thus gathering.\" *Sheng* states: \"The yielding ascends in due time; compliance and submission, the firm central and responsive—thus great success.\" Master Zhang said: The yielding refers to the sixth line at the fourth position. Master Xu said: The second line of *Xie* ascends to become the fourth line, illustrating Confucius’ statement about the yielding ascending. Yet it speaks only of the fourth line’s single change, while the fifth and top lines are not mentioned as ascending—how can this so distort the scriptures and contradict the sage? If one further insists on interpreting the hexagram through its lines, it would be as absurd as failing to distinguish beans from wheat.\n\nThen why does the scripture not mention \"the yielding descends in due time\"? It is said: Ascending is emphasized, while descending is not belabored.",
      "overlap_context": "tes: \"The small departs, the great arrives.\" *Pi* states: \"The great departs, the small arrives.\" These are the first instances of \"coming and going\" in hexagram statements. Confucius further expanded this to include \"ascending and descending,\" \"advancing and retreating,\" all derived from these principles. Yet neither King Wen nor Confucius equated *Tai*’s departing three yin lines with *Pi*’s arriving three yin lines, nor *Tai*’s arriving three yang lines with *Pi*’s departing three yang lines.",
      "start_char": 14670,
      "end_char": 15959,
      "start_sentence": 682,
      "end_sentence": 752,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.96945309638977,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "圣人成人之美益如此。 与明夷、家人同。 总卦变图 乃周公之用九、用六也。 於是一卦可变为六十四。 六画无变 卦之元爻者止可谓之画，故易六画而成卦是也。 元变者止有七，元九，有八，元六，故元变也。 文王设卦观象而系辞于其下者，此也易学。 先儒亦谓一卦可变为六十四卦，误矣。 及其蝶着所得，或九或六，始名日爻，然后有变。 一画变者六卦以下皆以乾坤二卦着明之。 于下其他六十二卦皆可知已。 六变夬剥　五变大有比　四变小畜豫　三变履谦　二变同人师　初变诟复 揲得九者，刚将变柔。 揲得六者，柔将变刚，故言变初。 变者初九、初六也。 姑以乾坤二卦明之。 乾之娠，坤之复是已。 九二，乾之同人。 六二，坤之师。 九三，乾之履。 六三，坤之谦。 九四，乾之小畜。 六四，坤之豫。 九五，乾之大有。 六五，坤之比。 上九，乾之央。 上六，坤之剥。 六十二卦皆放此。 周公《系辞》 二画变者十有五卦。 初上变大过颐　初五变鼎屯　初四变巽震　初三变讼明夷　初二变遁临　二上变革蒙　二五变离坎　二四变家人解　二三变无妄升　三上变兑艮　三五变湀蹇　三四变中孚小过　四上变需晋　四五变大畜　五上变大壮观 三画变者二十卦。 初二上变咸损　初二五变旅节　初二四变渐归妹　初二三变否泰　初三上变困　初三五变未济既济　初三四变泱丰　初五上变怛益　初四上变井噬嗑　初四五变蛊随　二三上变随蛊　二三五变噬嗑井　二三四变益怛　二五上变丰泱　二四上变既济未济　二四五变困　三五上变归妹渐　三四上变节旅　三四五变损咸　四五上变泰否 四画变者十五卦。 初三五上变小过损　初二四上变蹇湀　初二四五变艮兑　初二三上变萃小畜　初二三五变晋需　初二三四变观大壮　初四五上变升无妄　初二五上变解家人　初三四上变坎离　初三四五变蒙革　二四五上变明夷讼　二三五上变震巽　二三四上变屯鼎　二三四五变顿大过　三四五上变临遁 五画变者六卦。 初三四五上变师同人　初二四五上变履　初二三五上变豫小畜　初二三四上变比大有　初二三四五变剥夫　二三四五上变复垢 六画皆变者一卦。 用九乾之坤 用六坤之乾 以上周公《系辞》，止乾坤二用。 朱子曰：卦之一画变者六，二画变者十五，三画变者二十，四画变者十五，五画变者六，六画皆变者一，合之为六十三，并本卦不变者共六十四。 一卦变成六十四，六十四卦变成四千九十六。 焦赣《易林》正如此。 一爻变则占，本卦变爻。 王氏曰：本卦爻为贞之卦爻，为悔，二爻当兼用。 二爻变则占。 本卦二变爻而以上爻为主。 王氏曰：当以初变爻为贞，次变爻一为悔，作两节消息之后。 准比。 三爻变则占本卦及变卦。 《彖辞》以本卦为贞，变卦为悔。 按：《众辞》非可以占变，当以先变爻为贞，后二变爻为悔，作三节消息之。 四爻变则占变卦，二不变爻仍以下爻为主。 五爻变则占变卦，一不变爻。 王氏曰：皆当。 以先变爻为贞，后老变爻为悔，作四节、五节消息之。 夏氏曰：既不变，如何用变底爻辞？ 周公爻辞本为九六之变者，设非为七八之不变者，设周易不用七八，岂有七八而可冒用九六之辞哉。 六爻尽变，乾坤占二用，余占变卦。",
      "translated_text": "The sage thus perfects others’ goodness to such an extent—this aligns with *Mingyi* and *Jiaren*. The *Comprehensive Hexagram Transformation Diagram* represents the Duke of Zhou’s \"use of nine\" and \"use of six.\" Through this, one hexagram can transform into sixty-four. When none of the six lines change, the hexagram’s original lines may only be called \"lines,\" as in the *Yi*’s formation of hexagrams through six lines. The original transformations are limited to seven: original nine, eight, and six—hence the term \"original transformation.\"\n\nKing Wen established the hexagrams, observed their images, and appended judgments below—this is the foundation of *Yi* learning. Earlier scholars also claimed that one hexagram could transform into sixty-four, which is mistaken. Only when the milfoil stalks yield either nine or six does a line acquire the name *yao*, and only then does transformation occur.\n\nWhen one line changes, six hexagrams result, all illustrated below through the two hexagrams *Qian* and *Kun*. The remaining sixty-two hexagrams can be inferred accordingly:\n- Six changes: *Guai* and *Bo*\n- Five changes: *Dayou* and *Bi*\n- Four changes: *Xiaoxu* and *Yu*\n- Three changes: *Lü* and *Qian*\n- Two changes: *Tongren* and *Shi*\n- Initial change: *Gou* and *Fu*\n\nWhen the stalks yield nine, the firm will transform into the yielding; when they yield six, the yielding will transform into the firm—thus the term \"initial transformation,\" referring to the first nine or first six. Take *Qian* and *Kun* as examples:\n- *Qian*’s *Gou* and *Kun*’s *Fu* (initial change)\n- Nine in the second: *Qian*’s *Tongren*; six in the second: *Kun*’s *Shi*\n- Nine in the third: *Qian*’s *Lü*; six in the third: *Kun*’s *Qian*\n- Nine in the fourth: *Qian*’s *Xiaoxu*; six in the fourth: *Kun*’s *Yu*\n- Nine in the fifth: *Qian*’s *Dayou*; six in the fifth: *Kun*’s *Bi*\n- Top nine: *Qian*’s *Guai*; top six: *Kun*’s *Bo*\n\nThe sixty-two remaining hexagrams follow this pattern.\n\nIn the Duke of Zhou’s *Appended Judgments*:\n- When two lines change, fifteen hexagrams result:\n  - Initial and top change: *Daguo* and *Yi*\n  - Initial and fifth change: *Ding* and *Zhun*\n  - Initial and fourth change: *Xun* and *Zhen*\n  - Initial and third change: *Song* and *Mingyi*\n  - Initial and second change: *Dun* and *Lin*\n  - Second and top change: *Ge* and *Meng*\n  - Second and fifth change: *Li* and *Kan*\n  - Second and fourth change: *Jiaren* and *Xie*\n  - Second and third change: *Wuwang* and *Sheng*\n  - Third and top change: *Dui* and *Gen*\n  - Third and fifth change: *Gui* and *Jian*\n  - Third and fourth change: *Zhongfu* and *Xiaoguo*\n  - Fourth and top change: *Xu* and *Jin*\n  - Fourth and fifth change: *Daxu*\n  - Fifth and top change: *Dazhuang* and *Guan*\n\n- When three lines change, twenty hexagrams result:\n  - Initial, second, and top change: *Xian* and *Sun*\n  - Initial, second, and fifth change: *Lü* and *Jie*\n  - Initial, second, and fourth change: *Jian* and *Guimei*\n  - Initial, second, and third change: *Pi* and *Tai*\n  - Initial, third, and top change: *Kun*\n  - Initial, third, and fifth change: *Weiji* and *Jiji*\n  - Initial, third, and fourth change: *Heng* and *Feng*\n  - Initial, fifth, and top change: *Huan* and *Yi*\n  - Initial, fourth, and top change: *Jing* and *Shihe*\n  - Initial, fourth, and fifth change: *Gu* and *Sui*\n  - Second, third, and top change: *Sui* and *Gu*\n  - Second, third, and fifth change: *Shihe* and *Jing*\n  - Second, third, and fourth change: *Yi* and *Huan*\n  - Second, fifth, and top change: *Feng* and *Heng*\n  - Second, fourth, and top change: *Jiji* and *Weiji*\n  - Second, fourth, and fifth change: *Kun*\n  - Third, fifth, and top change: *Guimei* and *Jian*\n  - Third, fourth, and top change: *Jie* and *Lü*\n  - Third, fourth, and fifth change: *Sun* and *Xian*\n  - Fourth, fifth, and top change: *Tai* and *Pi*\n\n- When four lines change, fifteen hexagrams result:\n  - Initial, third, fifth, and top change: *Xiaoguo* and *Sun*\n  - Initial, second, fourth, and top change: *Jian* and *Gui*\n  - Initial, second, fourth, and fifth change: *Gen* and *Dui*\n  - Initial, second, third, and top change: *Cui* and *Xiaoxu*\n  - Initial, second, third, and fifth change: *Jin* and *Xu*\n  - Initial, second, third, and fourth change: *Guan* and *Dazhuang*\n  - Initial, fourth, fifth, and top change: *Sheng* and *Wuwang*\n  - Initial, second, fifth, and top change: *Xie* and *Jiaren*\n  - Initial, third, fourth, and top change: *Kan* and *Li*\n  - Initial, third, fourth, and fifth change: *Meng* and *Ge*\n  - Second, fourth, fifth, and top change: *Mingyi* and *Song*\n  - Second, third, fifth, and top change: *Zhen* and *Xun*\n  - Second, third, fourth, and top change: *Zhun* and *Ding*\n  - Second, third, fourth, and fifth change: *Dun* and *Daguo*\n  - Third, fourth, fifth, and top change: *Lin* and *Dun*\n\n- When five lines change, six hexagrams result:\n  - Initial, third, fourth, fifth, and top change: *Shi* and *Tongren*\n  - Initial, second, fourth, fifth, and top change: *Lü*\n  - Initial, second, third, fifth, and top change: *Yu* and *Xiaoxu*\n  - Initial, second, third, fourth, and top change: *Bi* and *Dayou*\n  - Initial, second, third, fourth, and fifth change: *Bo* and *Guai*\n  - Second, third, fourth, fifth, and top change: *Fu* and *Gou*\n\n- When all six lines change, one hexagram results:\n  - \"Use of nine\": *Qian* transforms into *Kun*\n  - \"Use of six\": *Kun* transforms into *Qian*\n\nThe above, from the Duke of Zhou’s *Appended Judgments*, applies only to the two uses of *Qian* and *Kun*. Master Zhu said: One line changing yields six hexagrams; two lines, fifteen; three lines, twenty; four lines, fifteen; five lines, six; all six lines changing, one—totaling sixty-three, which, including the unchanging original hexagram, makes sixty-four. One hexagram transforms into sixty-four, and sixty-four hexagrams transform into four thousand ninety-six, as in Jiao Gan’s *Forest of Changes*.\n\nWhen one line changes, divination relies on the original hexagram’s changing line. Master Wang said: The original hexagram’s line serves as the \"persistence\" (*zhen*) line, while the changing line serves as the \"regret\" (*hui*) line; both should be considered. When two lines change, divination relies on the original hexagram’s two changing lines, with the upper line as primary. Master Wang said: The first changing line should be taken as *zhen*, and the next changing line as *hui*, interpreted in two stages of fortune’s ebb and flow—proceed accordingly.\n\nWhen three lines change, divination relies on both the original and transformed hexagrams. The *Tuan* judgment takes the original hexagram as *zhen* and the transformed hexagram as *hui*. However, the *Zhongci* cannot be used for divination; instead, the first changing line should be taken as *zhen*, and the latter two as *hui*, interpreted in three stages of fortune’s ebb and flow.\n\nWhen four lines change, divination relies on the transformed hexagram, with the two unchanged lines taking the lower line as primary. When five lines change, divination relies on the transformed hexagram and its single unchanged line. Master Wang said: Both cases are correct—take the first changing line as *zhen* and the later changing lines as *hui*, interpreted in four or five stages of fortune’s ebb and flow.\n\nMaster Xia said: If a line does not change, how can its changing line’s judgment be used? The Duke of Zhou’s line judgments were originally composed for the changes of nine and six; they were not intended for the unchanging seven and eight. If the *Zhouyi* did not employ seven and eight, how could seven and eight usurp the judgments of nine and six? When all six lines change, *Qian* and *Kun* rely on their two uses, while the rest rely on the transformed hexagram.",
      "overlap_context": "ent about the yielding ascending. Yet it speaks only of the fourth line’s single change, while the fifth and top lines are not mentioned as ascending—how can this so distort the scriptures and contradict the sage? If one further insists on interpreting the hexagram through its lines, it would be as absurd as failing to distinguish beans from wheat.\n\nThen why does the scripture not mention \"the yielding descends in due time\"? It is said: Ascending is emphasized, while descending is not belabored.",
      "start_char": 15959,
      "end_char": 17252,
      "start_sentence": 753,
      "end_sentence": 814,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.91222834587097,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "《彖辞》 按：卦辞皆为七八。 不变者设，岂可用之以占变？ 乾坤占二用可也。 膂按：朱子据《左传》艮之八及贞、屯、悔、豫，皆八之之言而然。 《左传》，说者以为用夏、商易，其用周易者则明言周易，然亦不能尽考也。 卦主 占卦之藏，必有主书。 十二辟卦，如复、娠则以初画为主，临、遁则以二画为主，泰、否则以三画为主，大壮、观则以四画为主，央、剥则以五画为主，乾、坤则以上画为主。 六子重卦，如震、巽则以第四画为主，坎、离则以第五画为主，艮、兑则以上画为主。 六子合卦，如恒、益，则以初画为主。 既济、未济则以第二画为主，咸、损则以第三画为主，震、巽、艮、兑之合元反对，如迹、大过以上画为主，中孚、小过以第四画为主。 合有反对，如随、蛊以初画为主，渐、归妹以第三画为主，卦有坎、离者，主坎、离中画。 讼、困、解、涣、蒙、师、同人、革、丰、家人、贲、明夷则皆以二为主，需、节、屯、井、蹇、比、大有、湀、噬嗑、鼎、旅、晋则皆以五为主。 以震、巽为主者，主本卦第四画。 如豫、畜以四为主。 升、元妄，以初为主。 以艮、兑为主者，主本卦第三画。 如谦、履，以三为主。 筮、大畜，以上为主。 坤卦辞后得主坤主上。 明夷初九，主人有言。 明夷主二 湀九二，遇主十巷湀主三。 丰初九，遇其配主，九四遇其主。 丰主二。 元妄，刚自外来而为主於内。 无妄以初为主。 鷟曰：《春秋》之经，内鲁国外列国，故称内为我。 《春秋》以鲁国为主故也，如云齐人、宋人、陈人伐我，面鄙齐人伐我、葬我，小君之类是已。 《周易》亦然。 凡卦辞、爻辞所言我字，皆指卦主而言，今列于后。 蒙，童蒙求我，非我求童蒙。 二为卦主，故称我。 五艮少男，故称童蒙。 小畜，密云不雨，自我西郊。 四为卦主，故称我。 观六三：观我，生进退。 四为卦主，故称我。 观四之动作以为进退，巽为进退。 颐初九：舍尔灵龟，观我朵颐。 九为卦主，故称我。 初处下，不当养人之任。 自为灵，知自养之龟。 然虽下伏而犹上观乎。 上九益羡上之能养其下，而不元舍己以为人之意。 益九五：有孚惠心，勿问元吉，有孚惠我德。 二为五之正应，五当心位，言二孚而益之之心，不问可知其吉也。 然二不但孚于九五，而惠五之心又孚于初九，而惠初九之德。 初为卦主，故称我。 二、五应远，故日惠心。 初刚实为二所食，又相比近，故日惠德。 六二亦言受九五之益，而又得初九之弗违，与此爻辞意正相同，此因言五之所应而并言所应之所比，彼因言二之所应而并言六二之所比。 井九三：井深不食，为我心恻。 五为卦主，故称我。 三在兑口之下，故虽滦治清洁而不为人食之象，故九五之心为之恻然，悯其不见用于世也。 益五三同德，但五上体在兑口之上，人所食者。 三下体在兑口之下，人所不食。 九五所以为之恻然也。 鼎九二：鼎有实，我仇有疾，不我能即，吉。 五为卦主，故称我。 此托为卦主之言，言二之道德实於中，乃我之正应，好匹也。 不幸而有气体失平之疾，不我能就，我岂可以不往见之哉。 士不枉道，求见君能屈己，下贤所以为吉也。 旅九四：我心不快。 五为卦主，当心位，故称我。",
      "translated_text": "The *Tuan* Commentary states: The hexagram judgments all pertain to seven and eight. Since these are unchanging lines, how can they be used to divine change? Only *Qian* and *Kun* may rely on their two uses.\n\nMaster Lü notes: Master Zhu relied on the *Zuozhuan*’s references to \"the eighth line of *Gen*,\" as well as passages on *zhen*, *tun*, *hui*, and *yu*—all employing the term \"eight\"—to support this view. Some commentators argue that the *Zuozhuan* uses the *Xia* and *Shang* versions of the *Yi*, while those explicitly citing the *Zhouyi* clearly state so; however, this cannot be fully verified.\n\n**Hexagram Rulers**\nThe repository of hexagram divination must have a governing line. For the twelve sovereign hexagrams:\n- *Fu* and *Lin* take the first line as ruler;\n- *Lin* and *Dun* take the second line;\n- *Tai* and *Pi* take the third;\n- *Dazhuang* and *Guan* take the fourth;\n- *Guai* and *Bo* take the fifth;\n- *Qian* and *Kun* take the top line.\n\nFor the six doubled trigrams:\n- *Zhen* and *Xun* take the fourth line as ruler;\n- *Kan* and *Li* take the fifth;\n- *Gen* and *Dui* take the top line.\n\nFor the six combined trigrams:\n- *Heng* and *Yi* take the first line as ruler;\n- *Jiji* and *Weiji* take the second;\n- *Xian* and *Sun* take the third.\nFor *Zhen*, *Xun*, *Gen*, and *Dui* in their reversed or opposed forms:\n- *Jie* and *Daguo* take the top line;\n- *Zhongfu* and *Xiaoguo* take the fourth.\nFor combined hexagrams with opposition:\n- *Sui* and *Gu* take the first line;\n- *Jian* and *Guimei* take the third.\nHexagrams containing *Kan* or *Li* take the central line of *Kan* or *Li* as ruler.\n- *Song*, *Kun*, *Jie*, *Huan*, *Meng*, *Shi*, *Tongren*, *Ge*, *Feng*, *Jiaren*, *Bi*, and *Mingyi* all take the second line as ruler;\n- *Xu*, *Jie*, *Tun*, *Jing*, *Jian*, *Bi*, *Dayou*, *Gui*, *Shihe*, *Ding*, *Lü*, and *Jin* all take the fifth.\n\nWhen *Zhen* or *Xun* governs, the fourth line of the original hexagram rules:\n- *Yu* and *Xu* take the fourth line;\n- *Sheng* and *Wuwang* take the first.\n\nWhen *Gen* or *Dui* governs, the third line of the original hexagram rules:\n- *Qian* and *Lü* take the third;\n- *Shi* and *Daxu* take the top.\n\nThe judgment following *Kun*’s hexagram lines takes the top line as ruler.\n- *Mingyi*’s *Nine in the First*: \"The lord speaks.\"\n- *Mingyi* takes the second line as ruler.\n- *Gui*’s *Nine in the Second*: \"Encountering the ruler in a narrow lane.\" *Gui* takes the third line as ruler.\n- *Feng*’s *Nine in the First*: \"Encountering its mate as ruler.\" *Nine in the Fourth*: \"Encountering its ruler.\" *Feng* takes the second line as ruler.\n- *Wuwang*: The firm comes from without to become ruler within. *Wuwang* takes the first line as ruler.\n\nMaster Zhuo said: In the *Spring and Autumn Annals*, events within the state of Lu are recorded as \"internal,\" while those of other states are \"external,\" hence \"we\" refers to Lu. This is because the *Annals* takes Lu as its subject—examples include \"the men of Qi, Song, and Chen attacked us,\" or \"the Qi forces invaded our borders\" and \"buried our lady.\" The *Zhouyi* follows the same principle: whenever \"I\" appears in hexagram or line judgments, it refers to the hexagram’s ruler. The following instances are listed:\n\n- *Meng*: \"The youth seeks me, not I the youth.\" The second line is the hexagram’s ruler, hence \"I.\" The fifth line, *Gen*’s youngest son, is called \"youth.\"\n- *Xiaoxu*: \"Dense clouds, no rain, from our western suburbs.\" The fourth line is the hexagram’s ruler, hence \"our.\"\n- *Guan* *Six in the Third*: \"Observing my life’s advance and retreat.\" The fourth line is the hexagram’s ruler, hence \"my.\" The third line’s movements determine advance and retreat, as *Xun* governs both.\n- *Yi* *Initial Nine*: \"Abandon your sacred tortoise, observe my chewing.\" The top line is the hexagram’s ruler, hence \"my.\" The first line, at the bottom, is unfit for nourishing others. Though it possesses innate wisdom (the tortoise), it remains hidden, yet still gazes upward. The top line, *Yi*’s \"excessive\" position, admires the lower line’s ability to nourish itself without arrogantly forsaking its own needs for others.\n- *Yi* *Nine in the Fifth*: \"Sincere and beneficent heart—ask not, supremely auspicious. Sincere in bestowing virtue upon me.\" The second line is the fifth’s proper correlate. The fifth, at the heart position, speaks of the second’s sincerity in enriching it—its auspiciousness is self-evident. Yet the second not only trusts the fifth but also sincerely bestows virtue upon the first line. The first line is the hexagram’s ruler, hence \"me.\" The second and fifth are distant correlates, hence \"beneficent heart.\" The first line’s firmness is consumed by the second, and their proximity is close, hence \"bestowed virtue.\" *Six in the Second* also speaks of receiving the fifth’s enrichment while gaining the first’s compliance, mirroring this line’s meaning—here, the focus is on the correlate’s relationship, including its adjacent line; there, the focus is on the second’s correlate, including *Six in the Second*’s proximity.\n- *Jing* *Nine in the Third*: \"The well is deep, unused—my heart aches.\" The fifth line is the hexagram’s ruler, hence \"my.\" The third line lies below *Dui*’s mouth, symbolizing a well’s purity left untouched. The fifth line’s heart aches in pity for its unused state.\n- *Yi*’s fifth and third lines share virtue, but the fifth’s upper position lies above *Dui*’s mouth, where people draw from it. The third’s lower position lies below *Dui*’s mouth, unused by others—hence the fifth’s pity.\n- *Ding* *Nine in the Second*: \"The cauldron is full; my mate is ill, unable to approach me—auspicious.\" The fifth line is the hexagram’s ruler, hence \"my.\" This adopts the ruler’s voice: the second line’s virtue is full within, making it my proper correlate, my good match. Unfortunately, it suffers from imbalance, unable to come to me—how could I not visit it? A scholar does not bend the Way to seek an audience with a lord; humbling oneself to honor the worthy brings good fortune.\n- *Lü* *Nine in the Fourth*: \"My heart is not glad.\" The fifth line is the hexagram’s ruler, occupying the heart position, hence \"my.\"",
      "overlap_context": "ges of fortune’s ebb and flow.\n\nMaster Xia said: If a line does not change, how can its changing line’s judgment be used? The Duke of Zhou’s line judgments were originally composed for the changes of nine and six; they were not intended for the unchanging seven and eight. If the *Zhouyi* did not employ seven and eight, how could seven and eight usurp the judgments of nine and six? When all six lines change, *Qian* and *Kun* rely on their two uses, while the rest rely on the transformed hexagram.",
      "start_char": 17253,
      "end_char": 18540,
      "start_sentence": 815,
      "end_sentence": 880,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.20912575721741,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "五旅于四之处，非正位，故心不乐也。 中孚九二：我有好爵，吾与尔靡之。 四为卦主，故称我。 又称吾，托为卦主，谓二、日九五刚健中正，有天之尊爵于己，在我之上，五恤与尔二当向慕系恋之也。 四比五，二、五同位，故告此。 小过六五：密云不雨，自我西郊。 四为卦主，故称我。 九三蔽五坎之下体，象云密塞而不过，故不雨。 四为西，在内卦之外，故日郊。 九四不上合六五，何望阴阳之和而成雨哉。 先天图六十四卦，每二卦互为一卦，故中层三十二卦左右相同，实十六卦。 中层三十二卦，每二卦又互为一卦，故内层共十六卦，四分相同，实四卦。 昊先生曰：自昔言互体者，不过以六画之四画互二卦而已，未详其法象之精也。 今以先天图观之，互体所成十六卦皆隔八而得，缩四而一，图之左边起，乾、夬历八卦而至揆、归妹，又历八卦而至家人、既济，又历八卦而至颐、复。 右边起，娠、大过历八卦而至未济、解，又历八卦而至渐、蹇，又历八卦而至剥、坤。 左右各二卦，三二卦合六十四卦，互体只成十六卦，又合十六卦互体只成四卦，乾、坤、既济、未济也。 《周易》始乾、坤，终既济、未济，以此欤。 朱氏曰：中一层，左右各十六卦，其下体两卦相比，一循乾一坤八之序。 其上体十六卦，两周乾一坤八之序，可玩其内层。 下体乾、离、坎、坤为序，其上体乾、坎、离、坤为序，而四周之尤可玩。 鷟曰：夫子《杂卦》之末章，八卦取中层之大过、娠、央，以其互内层之乾也。 取中层之颐以其互内层之坤也，取中层之渐、既济以其互内层之未济也，取中层之归妹、未济以其互内层之既济也。 不取乾、坤，以首於篇首故也。 不取剥、复，以阴多略之也。 不取湀、解，以取未济，归妹略之也。 不取家人、奏，以取既济、渐略之也。 乾取三卦，坤惟颐、既济，惟归妹、未济，惟渐者，乾尊故也。 既未着于后，《周易》终既未之义也。 央、复殿乎既未之复，夫子《杂卦》之序也。 夏、商、周之称名也，杂而不越。 夫子之称名也，亦杂而不越。 古易考原卷下竟 大明万历三十五年岁次丁未上元吉 旦正一嗣教凝诚志道阐玄弘教大真人堂天下道教事张国祥奉旨校梓 #1『八』原为『人』，据文义改。 #2本句后疑有脱漏。 #3『之柔』当为『柔下』。",
      "translated_text": "The fifth line of *Lǚ* resides in the fourth’s position, which is not its proper place—hence its heart is displeased.\n\n- *Zhōng Fú* *Nine in the Second*: \"I possess a fine vessel of rank; I share it with you, that we may dissolve it together.\" The fourth line is the hexagram’s ruler, hence \"I.\" It also uses \"I\" (*wu*), adopting the ruler’s voice: the second line, *Nine in the Fifth*, is firm, strong, centered, and correct, possessing the noble rank of Heaven within itself, above me. The fifth line pities and shares this with you, the second, who should look up to and remain devoted to it. The fourth is adjacent to the fifth, and the second and fifth share the same position—hence this address.\n\n- *Xiǎo Guò* *Six in the Fifth*: \"Dense clouds, no rain, from my western suburbs.\" The fourth line is the hexagram’s ruler, hence \"my.\" *Nine in the Third* obscures the lower trigram *Kǎn* beneath the fifth, resembling clouds densely blocking yet failing to pass—hence no rain. The fourth is the west, lying outside the inner trigram—hence \"suburbs.\" *Nine in the Fourth* does not ascend to join *Six in the Fifth*; how can it hope for the harmony of yin and yang to bring rain?\n\nIn the *Xiāntiān* diagram of sixty-four hexagrams, every two hexagrams mutually form one hexagram, so the middle layer’s thirty-two hexagrams mirror each other left and right, comprising sixteen distinct hexagrams. Within the middle layer’s thirty-two hexagrams, every two hexagrams again mutually form one hexagram, yielding sixteen hexagrams in the inner layer, divided into four identical groups—ultimately four hexagrams.\n\nMaster Hào states: Those who spoke of mutual trigrams in the past merely took four lines from six to form two hexagrams, without grasping the precision of their patterns and images. Now, observing the *Xiāntiān* diagram, the sixteen hexagrams formed by mutual trigrams are each obtained by skipping eight, condensing four into one. Starting from the left: *Qián* and *Guài* proceed through eight hexagrams to *Kuí* and *Guīmèi*, then through another eight to *Jiārén* and *Jìjì*, and yet another eight to *Yí* and *Fù*. Starting from the right: *Shēng* and *Dàguò* proceed through eight hexagrams to *Wèijì* and *Xiè*, then through another eight to *Jiàn* and *Jiǎn*, and yet another eight to *Bō* and *Kūn*. On each side, two hexagrams combine; three sets of two make sixty-four hexagrams, yet mutual trigrams form only sixteen, which further combine into four: *Qián*, *Kūn*, *Jìjì*, and *Wèijì*. The *Zhōu Yì* begins with *Qián* and *Kūn* and ends with *Jìjì* and *Wèijì*—is this not the reason?\n\nMaster Zhū states: In the middle layer, sixteen hexagrams lie on each side. Their lower trigrams, when paired, follow the sequence of *Qián* and *Kūn* through the eight hexagrams. Their upper trigrams complete two cycles of *Qián* and *Kūn* through the eight hexagrams—this can be discerned in the inner layer. The lower trigrams proceed in the order of *Qián*, *Lí*, *Kǎn*, *Kūn*, while the upper trigrams follow *Qián*, *Kǎn*, *Lí*, *Kūn*, with four cycles—this is especially worth contemplating.\n\nZhuó remarks: In the final chapter of the Master’s *Zá Guà*, eight hexagrams are selected from the middle layer: *Dàguò* and *Shēng* for their mutual formation of the inner layer’s *Qián*; *Yí* for its mutual formation of *Kūn*; *Jiàn* and *Jìjì* for their mutual formation of *Wèijì*; and *Guīmèi* and *Wèijì* for their mutual formation of *Jìjì*. *Qián* and *Kūn* are not selected, as they head the text. *Bō* and *Fù* are omitted due to their excess of yin. *Kuí* and *Xiè* are omitted because *Wèijì* and *Guīmèi* are already included. *Jiārén* and *Zòu* are omitted because *Jìjì* and *Jiàn* are already included. Three hexagrams are chosen for *Qián* due to its supremacy, while *Kūn* has only *Yí*; *Jìjì* has only *Guīmèi* and *Wèijì*; and *Wèijì* has only *Jiàn*. Since *Jìjì* and *Wèijì* appear at the end, this reflects the *Zhōu Yì*’s conclusion with *Jìjì* and *Wèijì*. *Kuí* and *Fù* conclude the *Zá Guà*’s sequence, following *Jìjì* and *Wèijì*. The names of the Xià, Shāng, and Zhōu dynasties are mixed yet not disordered; the Master’s naming is likewise mixed yet not disordered.\n\n*Gǔ Yì Kǎo Yuán*, Volume Three, concludes.\nRespectfully printed on an auspicious day of the first lunar month in the *dīngwèi* year of the Wanli reign (1607), under the supervision of Zhang Guoxiang, Celestial Master of Orthodox Unity, Successor of the Teachings, Who Cultivates Sincerity and Propagates the Dao, Grand Realized One of the Hall of Spreading the Mysteries and Vast Teachings, charged with overseeing Daoist affairs throughout the realm.",
      "overlap_context": "s the hexagram’s ruler, hence \"my.\" This adopts the ruler’s voice: the second line’s virtue is full within, making it my proper correlate, my good match. Unfortunately, it suffers from imbalance, unable to come to me—how could I not visit it? A scholar does not bend the Way to seek an audience with a lord; humbling oneself to honor the worthy brings good fortune.\n- *Lü* *Nine in the Fourth*: \"My heart is not glad.\" The fifth line is the hexagram’s ruler, occupying the heart position, hence \"my.\"",
      "start_char": 18540,
      "end_char": 19448,
      "start_sentence": 881,
      "end_sentence": 917,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.628278732299805,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\古易考原.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}