{
  "source_id": "吕祖师三尼医世说述",
  "source_file": "chunked_daozang\\吕祖师三尼医世说述.json",
  "total_chunks": 29,
  "total_original_chars": 16217,
  "total_translated_chars": 91010,
  "total_translation_time": 476.50223302841187,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface to *The Venerable Lü’s Exposition on the Three Ni’s Healing of the World***\n\nWriting conveys the Dao, and I have long known of this truth in the world. In my youth, I had the fortune to attend Master Dongli in Mount Tongbai. The Master was a celestial being from Qin, over one hundred and ten years of age, surnamed Gao. The Governor of Zhejiang and Fujian, Lord Gao—of the same clan—passed through the mountain on an inspection tour and presented the *Exposition on the Three Ni’s Healing of the World* to the Master. The Master said: “I once saw this in the inner writings of Master Wang Yangming’s *Kuijian*, compiled and published by his disciple Wang Longxi to transmit to the world. It is the great Dao by which Fuxi and the Yellow Emperor governed the world with their own bodies. I have also heard from the immortal Li Niuwan, who dwells in the world, that my disciple Shen Yibing encountered him three times. Once, Yibing inquired of Niuwan about the two characters ‘Three Ni.’ Niuwan replied: ‘This Dao was transmitted from Fuxi and the Yellow Emperor. The Three Great Sages—Confucius, Śākyamuni, and the Green Ni—expounded it to establish their teachings. The followers of each school recorded their own paths of entry, compiling them into a single work, variously called *Exposition*, *Mind-to-Mind Transmission*, *Methods of Practice*, or *Efficacy of Practice*. Now, however, these texts have scattered and been lost.’” This is what I once heard from Master Gao.\n\nIn the *bingwu* year of the Qianlong reign (1786), on the twenty-sixth day of the tenth month, my great master, the Venerable Taixu, departed this world. Two days prior, he entrusted me with a book, instructing me to keep it and not disclose it. At the time, I was still careless and failed to guard it well. A friend took it to Jinning, and it was long borrowed and never returned—it was none other than *The Venerable Lü’s Methods of Practice for the Three Ni’s Healing of the World*. In the *jiyou* year (1789), when the Zhejiang Education Commissioner, Mr. Zhu Shijun, conducted his inspection in Huzhou, I paid my respects at the Right Literature Hall. Only then did I learn that the Commissioner treasured this book and did not show it to others, though he suspected some passages might be missing. Hearing that a complete version was preserved in the Jingai collection, he deemed me trustworthy and sent me to retrieve it, but I returned empty-handed. He then showed me his own copy, hand-copied by a person of the Ming dynasty, with a postscript by the Earl of Chengyi. I intended to transcribe it, but just then, the Commissioner was preparing to inspect another prefecture, and in haste, the matter was left unfinished.\n\nFour years later, during my official travels, I passed through Mount Jizu and visited the immortal Jizu Daozhe in the Dragon Tree Mountain Lodge. The immortal, surnamed Huang and named Shouzhong, was a Yuezhi from the Western Regions who entered China during the Yuan dynasty. He had long resided on Mount Jizu, hence his name. In the sixteenth year of the Shunzhi reign (1659), he journeyed to the capital and sought the Three Great Precepts of the Most High from Precept Master Wang of Kunyang. Initially, he had no name and called himself *Yedapo*, meaning “seeker of the Dao” in Chinese. The Precept Master, seeing that he had dwelt in China for many years, bestowed upon him the Chinese name Huang Shouzhong. To this day, the people of Yunnan call him the True Man Huang. Though he is over five hundred years old, his appearance is that of a man in his sixties—his eyes bright, his voice resonant as a great bell. Few books lay on his desk: aside from the *Buddha’s Dhāraṇī Sutra for Upholding the World*, there was only *The Venerable Lü’s Exposition on the Three Ni’s Healing of the World*, which matched what Dongli had seen and what Taixu had expounded. I begged to borrow it, but he refused, saying, “No. Return home and seek the two virtues of ‘sincerity’ and ‘inquiry.’ What you gather yourself is not yet the time. Wait a while.” I then asked, “I once received *The Venerable Lü’s Methods of Practice for the Three Ni’s Healing of the World* from my great master, the Venerable Taixu, but before I could study it, a friend took it away. What is this book about?” He replied, “I once had it as well. It is an excellent text. You will obtain it again one day.”\n\nI further asked, “Have you ever practiced this teaching?” The Master said, “The time! The time!” I then asked, “If even a sage like Confucius did not use this Dao to heal the world, why is that?” He replied: “The sage establishes the ultimate standard for humanity and practices this Dao for all ages. The Master’s Dao is vast and not confined to a single era. Moreover, when the Zhou dynasty established its capital at Jiao and E, it was divined to last seven hundred years. By the end of the Spring and Autumn period, that span had reached its end. How could this not be the work of divine assistance, sustaining a declining fate and prolonging its mandate? If the Master had used this Dao to save the world, would it not have brought great order?” I said, “If Confucius had applied this Dao to govern the world, would it not have brought great peace?” The Master replied: “In the Spring and Autumn period, the sea of karmic evil was deep, and the cycle of killing was about to begin. Heaven did not yet wish to pacify the world. The qi of wanton destruction leads to depletion; the qi of excess leads to floods; the qi of grievance and oppression causes severe drought; the qi of rebellion and perversity brings warfare. When these chaotic qi linger and do not disperse, the primordial qi becomes obstructed and fails to flow. A sage without official position can nurture the inherent goodness in human hearts but cannot eradicate the accumulated evil in the world. When the Dao of the teacher is established, good people multiply, and this can sustain the world’s fate. As for those who act with unrest, Heaven will gather and destroy them—this is not something that scholars scattered among the people can manage.”\n\nI then asked, “Does this Dao also have its limits?” The Master said: “A skilled physician treats illness by first removing the disease so that the primordial qi may flow. Have you not heard Laozi’s words? ‘The Dao is great, Earth is great, the King is also great.’ The King is also great because within the seas, all living beings—hundreds of millions—turn to him. He holds the power to revolve heaven and turn the earth. When the Dao and power unite, then weapons, punishments, rites, and music can reform old customs and renew them. Power is sufficient to remove illness and establish peace. But with Dao alone and no power, how can one embrace and pacify the violent and the corrupt?”\n\nThe ills of the world are of two kinds: those caused by human action, and those ordained by the turning of Heaven. The ills of human agency arise from the concentration of perverse qi—what is called “the calamity of one’s own making cannot be survived.” Only those who wield power can cure them. The ills of Heaven’s turning may be redressed by harmonious qi—what is called “Heaven’s calamity may yet be remedied.” Only those who embody the Dao can cure them.\n\nYet Heaven’s turning also shifts in response to human affairs. If perverse qi is dispelled before it takes shape, then Heaven’s turning will respond accordingly. When Heaven’s turning flows freely, primordial qi flows freely; when primordial qi flows freely, the great transformation flows freely. Thus the Dao becomes the Great Dao without limit.\n\nWhen those above gather and govern, Heaven and Earth complete their work, leaving nothing in the world unfulfilled. When those below establish and guide others, they bring great benefit to all things. To heal the world with the Dao is not to abandon the Dao because of the world’s flaws.\n\nMoreover, in an age of ascending peace, when the seas and lands are at rest, and a great sage rules from above, the Dao and power unite. Within the realm’s borders, there are no obstinate people or corrupt officials to brew misfortune and obstruct the flow of qi. Then this Dao circulates freely, and even a humble scholar may partake in the work of positioning Heaven and Earth and nurturing the myriad things, contributing unseen and unheard.\n\nAs for the occasional minor calamities in the generation and completion of the Five Phases and the hundred things—if one practices this Dao to remedy them, aligning above with the benevolent ruler’s intent and relieving below the hardships of living beings—will the response not be as swift as an echo answering sound?\n\nSuch were the teachings I received from the Perfected Huang. In the year *guichou*, I traveled to the eastern shore of Lake Dongting and rested at the home of Master Zhu. Zhu was the grandson of my mountain’s elder, the Nine-Returns Master, and was fond of profound learning. He showed me two volumes from his collection: one was a book once treasured by Grand Tutor Wenzheng, also a transcribed copy, though lacking colophons by famous hands. The other was hand-copied by Master Shiyan of Mount Lu in his Dragon Peak Studio, compiled under the title *Hidden Perfection of the Yellow Ancestor*. Its meaning was even clearer, likely the “detailed and excellent edition” praised by the Perfected of Chicken-Foot Mountain.\n\nI begged to borrow and bring them home, though at the time I did not grasp their profound principles and rashly resolved to practice only after mastering the Dao. It was not until the fifth year of Daoguang that I received from my teacher, the Great Void Master, the secret methods for healing the world, and further bathed in the vast and flowing ten thousand words of the written revelation of the Venerable Lü. Only then did the profound principles become clear. I regretted that the transmitted secret methods had been taken by a friend to Jinning and had not yet returned. Fortunately, the Perfected of Chicken-Foot Mountain had said that true attainment must come from within. Thus, I carefully excerpted and recorded the revelations from the sand-writing, and gathered what I had seen and heard, compiling and annotating them. I drew from the teachings of the Confucian and Buddhist traditions, supplementing with scriptural passages. Since I had not yet read the *Sutra of Upholding the World*, I appended seven tentative observations, transcribing them into a single volume. I detailed the origins and transmission of this book to dispel doubts arising from lack of evidence, intending to share it with like-minded seekers.\n\nAfter completing the draft, someone asked: “Is this Dao only practicable for those who aspire to save the world? Could it also be practiced by those acting out of self-interest?” Startled, I rose to my feet and said: “What kind of question is this! Acting with self-interest betrays the Dao—it cannot be practiced. The Venerable Lü once descended to the altar and solemnly warned: ‘In the functioning of the two qi, yang is virtue, yin is punishment. When moved by self-interest, one enters yin. Impartiality and compassion are virtue; perversity and violence are punishment. If one does not hold the heart of benefiting others and saving people, yet seeks to guide the qi of Heaven and Earth with one’s own qi, the qi of punishment will be summoned, leaving no room for escape. Heavenly demons will respond, heavenly spirits will slay, and the disaster will come swiftly—self-inflicted destruction, unforgiven across kalpas, with no chance for regret.’ Such is the clear teaching of the ancestral master.”\n\nTherefore, for those who study the Dao, rectifying the heart is the foremost principle. Let this serve as a mirror for those who would treat this book lightly.\n\nWritten on the full moon of the fourth lunar month in the year *wuzǐ* of the Daoguang era by Min Yide, eleventh-generation successor of the Dragon Gate Orthodox Lineage, with reverence.\n\n**Original Preface**\nIn the beginning of the Great Commencement, the Dao was established in Oneness.\n\nFirm yet unattached, unshakable yet ungrasping. Without duality or division, without inside or outside, still yet not still, moving yet not moving. The manifestation of hardness and softness, strength and compliance, from which arises the utmost hardness, utmost softness, and utmost compliance. The Great Mother of all life, the origin of the Great Dao—this is called the True One.\n\nThe True One is the lively, unconstrained essence of precelestial qi, whose arising cannot be restrained. When it arises, it flows; when it flows, it becomes yang; when it returns, it becomes yin. This flow and return are the beginning of qi. Yang, being pure, ascends; yin, being turbid, descends. This purity and turbidity are the beginning of form.\n\nThus, the True One is the origin of the generation of Heaven and Earth, embodying the ten thousand things yet emptying the ten thousand things—this is the Limitless. Only through nothingness is there no obstruction, and thus utmost spirit and utmost clarity. Only through nothingness is there no entanglement or hindrance, and thus the capacity to contract and extend. Humans and all beings receive its principle of spirit and clarity as their nature, and its qi of contraction and extension as their life. The ten thousand things all reside within nature and life, and nature and life reside within the True One. Beyond nature and life, there is no Dao; beyond nature and life, there is no teaching. The Three Teachings all emerge from the One.\n\nConfucianism fulfills nature to establish life; Buddhism perceives nature to liberate life; Daoism completes nature to restore life. Confucianism penetrates the One; Buddhism returns to the One; Daoism attains the One. Yet at the utmost of their transformative efficacy, none is distant or unattainable, flowing throughout the four great continents without cessation.\n\nThe Dao of Confucianism reaches the point of positioning Heaven and Earth and nourishing the ten thousand things, transforming wherever it passes and spiritually abiding wherever it remains.\n*(Xie’s note: When the precelestial One Qi moves within a “certain place,” that place is inevitably transformed and dissolved. When the precelestial One Qi lies dormant in a place without activation, that place inevitably generates spiritual awareness. Is there truly a “certain place”? In reality, there is no such place! The True One is the precelestial One Qi. Thus, it is said, “Wherever it passes, it transforms; wherever it abides, it spiritualizes”—this single phrase exhausts the entire function of the Golden Elixir.)*\n\nThe Dao of Buddhism reaches the point of non-abiding generosity, where the merit of the four directions and the emptiness above and below is inconceivable. The Dao of Daoism reaches the point where the ten thousand things act without refusal, give life without possessiveness, work without claiming, and accomplish without dwelling. Their fundamental aim is non-action in service to the world—how could they abandon the self to engage with the world?\n\nSince the beginning of life, self and others share this one nature, this one life, and thus this one Dao. Though forms are separate, qi communicates; when qi communicates, nature and life communicate. In the extreme, all that Heaven covers and Earth bears is connected through the single breath of qi. If the Dao is within me, then I am its master. In its beginning, it possesses not a single thing; in its end, it omits not a single thing. Yet in its wondrous operation upon the ten thousand things, it still possesses not a single thing.\n\nWhat Dao is this? It is the Dao of the True One. Perfecting oneself and perfecting things are both matters within the Dao. Only when the ten thousand things each rectify their nature and life is the full measure of the Dao realized. To leave the world and stand alone cannot be called the Dao—this is the origin of the teaching of *healing the world*.\n\nThe root canon of this teaching, the *Book of Healing the World*, possesses golden tablets and jade caskets, concealed within the celestial treasury, rarely seen in the world. This present book also contains expositions on the Confucian, Buddhist, and *healing-the-world* teachings. The Great Master Lü’s senior disciple, the Perfected Ancestor Wang Kunyang, heard from extraordinary persons that “the Confucian texts were destroyed in the Qin, the Buddhist texts in the Jin, and they cannot be seen in the world today.” What circulates in the world are merely the initial principles of the Daoist tradition’s *healing-the-world* practice.\n\nWhen Ancestor Lü dwelled in the world, he received this teaching and expounded upon the meaning of the root canon, transmitting it to his dharma heirs. This is a commentary on the root canon, not the canon’s original text. Thus, its language is plain and easily understood, though it does not yet address the profound and subtle stages of practice within the canon. It merely sets forth the sequential steps for entering the Daoist tradition’s *healing-the-world* practice.\n\nIts essentials, though distinct in method from the Confucian and Buddhist paths, converge in returning to the One. Thus, this book bears the name of the *Three Ni*. After Ancestor Lü ascended to the rank of Golden Immortal, he personally verified it with the Three Ni. These Three Ni, as celestial spirits, proclaimed the great Dao of participating in Heaven and Earth and aiding transformation and nourishment, enabling those with aspiration for this Dao to hear, transmit, and follow it, so that generation after generation may ascend to the realm of benevolence and longevity.\n\nReaders of this book must not treat it lightly! Though this book has been preserved in the world, it is unknown who took it away. When Ancestor Lü descended to the altar, he expounded its meaning in even greater detail, which I have respectfully transcribed here, adding a few words at the beginning.\n\nRespectfully recorded on the first day of the year *jiǎchén* of the Kangxi era by Tao Taiding, ninth-generation successor of the Dragon Gate Orthodox Lineage, at the Dragon Peak Mountain Chamber of Golden Canopy.\n\nWithin the twelve hexagrams, when yang grows, yin diminishes; when yin arrives, yang is complete. Cycling through the twelve earthly branches, each corresponds to its qi, manifesting the imagery of yin and yang’s advance and retreat. The Dao undergoes change and movement; lines shift and interchange to form sixty-four hexagrams. Above and below are not constant; hardness and softness alternate. The sixty-four hexagrams do not exceed these twelve hexagrams. By extending and transforming them, one exhausts their changes. Observing the *Yi* through embodiment, the principles of the world are attained.\n\nDiagram: *The Three Powers as One Qi*.\n\n*Exposition on Healing the World*\n*(Xie’s note: Only upon reaching the level of true fetal breathing and possessing pure and profound nature-work can one practice this *healing-the-world* technique; otherwise, harm may arise. Furthermore, when practicing this method, one must utterly abandon selfishness, or one will surely enter demonic paths. This method is none other than the supreme Golden Elixir Great Dao, the *Celestial Immortal’s Heart Transmission* practice recorded in this book. It should be studied together with the *Celestial Immortal’s Heart Transmission*.)*\n\nLü Zu, the Patriarch, was a descendant in the Daoist lineage of Guan Yinzi under the Supreme Lord (Taishang), and a great-great-grandson in the Dao transmission. Originally of the Tang imperial clan, his surname was Li, personal name Qiong, and courtesy name Boyu. To evade the calamity brought by Empress Wu, he and his wife née Jin concealed themselves in the deep valleys of Mount Song, changing their surname to Lü, with the personal name Yan and courtesy name Dongbin. After his wife’s untimely death, he took the sobriquet *Chunyang*—disciple of Patriarch Zhongli. Emperor Shizu of the Yuan dynasty bestowed upon him the honorific titles *Jinghua Fuyou Dijun*.\n\nThe Three Nis refer to Confucius, the Tathāgata, and Laozi. The *Heart Seal Scripture Collection* states:\n*\"The Green Ni embodies the center,\nZhongni (Confucius) harmonizes the mean,\nMuni (the Buddha) abides in emptiness.\nThe Three Nis teach in succession,\nWenni (Laozi) assists in governance.\nThe Three Nis transmit flawlessly,\nWenni alone is praised.\nExpounding and disseminating education,\nthey nurture the wellspring of transformation.\"*\n\nThis is the primordial decree addressed to Wenni.\n\nThe present scripture further declares:\n*\"The Perfected One of Pure Yang, known by the transformation-name Wenni, holds the office of doctrinal transformation. Thus, he was commanded to propagate the Way of the Three Nis and bestow it upon the world, secretly blessing the people below.\"*\n\nLü Zu’s synthesis of Confucianism, Buddhism, and Daoism in his teachings was mandated by Heaven, which is why his precious invocation also designates him as the Teacher of the Three Teachings.\n\nThe *Exposition on Healing the World* embodies the profound essence of the Three Sages, fostering the growth of all things and ascending to the heights of Heaven. Since the dawn of creation, no Way in the world has surpassed this. Lü Zu expounded it to open boundless kalpas and extend the transformative blessings of nurturance, protection, kindness, and well-being. Though its initial principles belong to the Mystery Gate, they ultimately derive from the foundation of quiescence and stillness. Quiescence and stillness are the common entry points for all three traditions, yet the Daoist school’s methods are comparatively simple and easily understood—hence their selection for instruction. As for fully realizing one’s nature, comprehending destiny, and extending one’s merit to Heaven and Earth, the Three Nis share the same Way, all encompassed herein.\n\nLü Zu committed this to writing and transmitted it to his disciples. Treasured by successive patriarchs, it was preserved in the Dragon Ridge Mountain Chamber on Plum Island—a retreat originally established by the Perfected Master Huang Yin. The site remains, located approximately two *li* from Cloud Nest, on the eastern slope of Golden Canopy Peak. The original preface was composed by the Venerable Master Tao Shian, while the title was bestowed by the Perfected Master Yin. The designation *\"Lü Zu’s Exposition on the Three Nis’ Healing of the World\"* clarifies that this text is Lü Zu’s elucidation of the Three Sages’ original scripture, offered to instruct humanity.\n\n**First Step in Expounding the Teaching: *Great Vigour***\n\n[This exposition employs the imagery of the *Yijing* to elucidate each step of the practice, not merely to expound upon hexagram qi or temporal sequences. (Xie’s note: There is no true beginning—this is merely a pedagogical convenience, taking *Great Vigour* as the first step in expounding the teaching. In truth, there is neither start nor end, but an unbroken cycle.)]\n\n*\"Great Vigour: Auspicious for perseverance\"*: \"Great\" signifies correctness, with inner *qian* and outer *zhen*. *Qian* is Heaven, the head; *zhen* is arousal, thus the practice begins here. *\"The Lord emerges from zhen\"*: The Lord is Taiyi, the true ruler of Unity. *Zhen* and *xun* transform to reveal the \"many white eyes\"—when the gaze is directed toward the brain, it turns upward, hence the whiteness, indicating one should fix attention upon the *qian* palace. *Zhen* is the movement of yang—intention is the issuance of the heart, the stirring of yang qi.]\n\n(Xie’s note: *Qian* is the essence, *zhen* the function; through function, essence is revealed. The thunder of *Tianlei* shakes from below to above, and the Mysterious Pass opens.)\n\nIf one says: First close the eyes, gather the spirit of the eyes, and direct it toward the brain—(Xie’s note: Prolonged focus on the Upper Cinnabar Field unites spirit and qi, engaging the practice of merged oblivion.) [As recorded in *Kuizhong Shu*. The phrase \"If one says\" clarifies this is not part of the original scripture.]\n\nThe original scripture is terse and abstruse, difficult to comprehend. Patriarch Lü expounded its meaning, saying: \"It is thus, it is thus.\" Master Tao’s version omits the phrase \"若曰\" (\"if one says\"), includes \"微以\" (\"subtly with\") in the following line, adds the character \"際\" (\"boundary\") after \"脑\" (\"brain\"), and renders \"一注\" (\"a single focus\") as \"存守\" (\"preserve and guard\"). Patriarch Lü stated: \"To *preserve* is the True One; to *guard* is the True Origin.\" (Xie’s note: The True One cannot be guarded. To *preserve* is the intent of non-action, not *guarding*. The True Origin of the human body is true intention and true breath.) The True One is nature; the True Origin is *qi*. The brain is the Sea of Marrow and the capital of celestial nature—like the Jade Clarity’s sublime realm in the heavens, a realm of utmost purity, dwelling above the stars and moon, the Heaven of Great Nothingness. To know *preservation* and *guarding* is to naturally understand the Dao.\n\nProceeding within the brain, direct the focus upward toward the crown. (Xie’s note: Taking the Mud Pill Palace as the root and the crown as the \"juncture,\" the five senses merge as one, body and mind blend in radiant transformation, engaging the work of emptiness beyond the body. Naturally, the wondrous function of *qi* arises from the formless.) [As recorded in *Kuizhong Shu*. Master Tao’s version renders \"中\" (\"within\") as \"際\" (\"boundary\"), adds \"门上\" (\"above the gate\") in the following line, and changes \"注之\" (\"direct the focus\") to \"一注\" (\"a single focus\"). Patriarch Lü said: \"The brain is the Jade Clarity Palace of the human body, the abode of the Primordial Beginning. The crown is the fontanel, the acupoint *Baihui*, the gathering place of the Three Origins, where the True One of the Three Heavens above is received. Directing the focus upward toward the crown, the True One resonates, the True Origin converges, and one perceives red and yellow star-like specks raining down as verification.\" (Xie’s note: This is what *Tianxian Xinzhuang* calls \"guiding the descent of the Celestial Stem.\") For the True One is formless; what can be perceived is the True Origin. The True Origin is the *qi* born of the True One.]\n\n(Yide’s note: The *Book of Rites* states: \"It originates from the Great One, divides into Heaven and Earth, revolves into yin and yang, transforms into the four seasons, and arrays into ghosts and spirits. Its descent is called *ming*; its office is in Heaven.\" The Great One is the True One, the ruler of Heaven. The head is the Heavenly Gate of the human body, hence one must welcome *qian* at the head. The *Book of Changes* says: \"*Qian*’s origin,\" and \"emerging first among the myriad things\"—*qian* is Heaven and the head. *Yu’s Commentary on the Book of Changes* states: \"*Qian* is nature\"—the nature of Heaven’s mandate. The eyes and heart \"directing the focus\" is what the *Book of Documents* calls \"attending to Heaven’s bright mandate,\" which Master Zhu glossed as \"constantly keeping one’s gaze upon it.\" The Buddhist scriptures say: \"The Great Buddha’s Crown *Sūtra* of Dhāraṇī\"—speaking of wisdom’s light like the sun at the Buddha’s crown. They also say: \"This is the Tathāgata’s invisible crown, the formless mind-Buddha,\" and \"rubbing the crown to awaken\"—speaking of the light of human nature residing in the crown. The methods of world-saving practice in Confucianism and Buddhism, when compared with the scriptural principles here, align perfectly in purpose and form.)\n\n(Xie’s note: The aim of this step is to purify one’s body and mind, attaining the state of \"perfect purity,\" which is what Master Min called \"in purity, one must welcome *qian*.\")\n\nThis is the first step in practice. [As recorded in *Kuizhong Shu*. Master Tao’s version adds the words \"功法\" (\"practice method\") after each step. Patriarch Lü said: \"Method is the rule; practice is its function.\" \"First close the eyes\"—the eyes are the emissaries of the heart’s *qi* and spirit. The *Dharma Record* states: \"The eye spirit in Heaven becomes the two marshals, Gou and Bi.\" In the human body, when moving, it focuses on the two *Yongquan* points; when seated, it focuses on the two kidneys. \"Closing\" means concentration. \"Subtly with\" implies having as if not having. Intention is the command of the heart-spirit; when the command issues, it is executed, like an emperor’s edict. \"Directing upward\" implies piercing through the crown to ascend, thereby focusing on and welcoming the origin of the True One to protect the body and the world.]\n\nThe second step expounds the method.\n\nThe *Guài* hexagram [☵☷ (inner *qián*, outer *duì*). The *Yi Xiang* states: \"*Qián* is spirit, *duì* is communication—communicating *qi* with spirit.\" This draws on the meaning of guiding the *qián* *qi* downward. *Guài* means \"to decide,\" where the firm decides over the yielding; the Dao of the noble person grows while the Dao of the petty person wanes—the petty person refers to *yin*. The *quē* gate descends to communicate with the abdomen, and the abdomen is *yin*; thus, guiding the *qián* *yang* downward dissolves *yin*.\n\n[**Xie’s note:** In terms of internal alchemy, this is the initial practice method of concentrating spirit into the *qi* cavity.]\n\nIt proceeds from *Bǎihuì*, descending to *Quēpén*.\n[**Xie’s note:** The primordial *qi* emerges from emptiness and stillness; when stirred, it communicates, and once communicated, it is guided in accordance with its flow.]\n\n[The *Kuìzhōng* text reads the same. Tao’s version has: \"Continuing from the brain’s border, descending to the chest’s hall.\" *Bǎihuì* is an acupoint located at the crown. *Quēpén* is also an acupoint, situated in the chest. Patriarch Lü said: \"Though intent is not mentioned here, it is implied within.\" \"Descending\" signifies the act of drawing and guiding the primordial origin downward; the meaning of the following passage will make this clear.]\n\n] [**Xie’s note:** The practice of \"turning the light around to reflect inward\" gathers the true primordial origin into *Níwán*, then directly enters the *Zhōnghuáng*—this is the method of \"releasing light to summon the scattered primordial unity\" in the Dao of internal alchemy.]\n\n*Qián*:\n[\"*Yuán* (primordial beginning), *hēng* (free flow), *lì* (beneficial harmony), *zhēn* (upright constancy):\n*Yuánshǐ* (primordial beginning) refers to the *Yì* returning to its initial state, delving into the profound to seek and guide, as all things draw upon this origin.\n*Hēngtōng* (free flow) is the yang penetrating the yin.\nEach aligning its nature and destiny constitutes *lìzhēn* (beneficial constancy).\nThe region above the heart is yang; the abdomen is yin.\nThe chest is the boundary where yang first communicates with yin,\n[**Xie’s note:** This may also refer to the *Jiànggōng* cavity.]\nfrom which the profound mysteries of the world arise—one must not be disturbed by agitation.\n*Qián* conceals *kūn* within, governing movement with stillness, thereby embodying tranquil delight.\nThe virtues of *Qián* are: firmness, strength, centrality, uprightness, purity, essence, and refinement.\n—These seven virtues enable one to awaken to the emptiness of form and phenomena, unattached to even a single thread.]\n\nFrom *Quēpén*, one embodies tranquil delight.\n\n<**Xie’s note:** Entering the chamber of spirit-return, at this moment one washes the heart and bathes in purity. The upper and middle *dantian* merge as one; heart and breath harmonize and fuse, the mysterious aperture fully opens. After a great repose, one abides in profound stillness—illuminating without illumination, the Great Ultimate first appears. The \"Heavenly Immortal’s Heart Transmission\" calls this \"Perfect Clarity,\" utterly untainted by dust.>\n\n[As in *Kuìzhōngshū*. Tao’s version reads: \"Abide in the chamber of the breast, not a single thread attached.\" (Yīdé)\n**Note:** The *Book of Changes* states, \"Clarity and brightness reside in the body,\" <**Xie’s note:** The human heart has merged with the celestial heart.> while the *Heart Sutra* declares, \"The five aggregates are all empty\"—both speak of the same Dao.\nLü Zu said: \"First, guard against impatience; second, guard against confusion; third, guard against recklessness. To recognize this *zhōng* <**Xie’s note:** In the narrow sense, this *zhōng* refers to the inner Mysterious Female, also called the Central Yellow Spirit-Chamber; in the broad sense, it is the 'heart' of Heaven and Earth, the Mysterious Female of creation. Its secret lies in 'non-abiding and non-attachment.'> is to know that originally there is not a single thing. Where is self? Where is other? Where is inside or outside? Radiant and unobstructed, penetrating Heaven and Earth, each and every thing—only when the mechanism moves does it appear. Yet appearance is not the essence of the heart. When it appears, do not examine; when it withdraws, do not pursue—like a floating cloud touching the vast sky, it passes and is gone. What one should welcome is: preserve clarity to the utmost, harmoniously receive the Three and Five.\" For this stage, the *Cantong Qi* calls it \"Supreme Virtue.\" Virtue consists of purity, emptiness, tranquility, and blandness, unstained by even a speck of dust. Whether gain or loss, being or non-being, one does not cling in the slightest—only then is the method attained.]\n\nThis marks the second step in the initial practice.\n\n[Master Lü states: \"At this stage, myriad and tumultuous visions will inevitably arise. (Xie’s note: Alchemical texts refer to this as the *living noon hour*.) Should one linger even slightly or become disturbed, the Celestial Ruler falls ill—this not only brings no benefit but inflicts no small harm. Moreover, the next step will then offer no foothold for progress. How can one not be vigilant!\" (Yide)\n\nI humbly submit: If one can embody the characters *you* (wandering) and *xian* (leisure), their meaning will naturally be grasped, and one’s practice will align with the ancestral teachings.]\n\n(Xie’s note: Though the Qian trigram’s primordial force descends to govern this stage, this is the \"center\" of the human heart. With the ten thousand things teeming and the human heart intricate, tumultuous visions arise, and practitioners are prone to chasing illusions. If even the slightest trace of self-interest intrudes, harm may ensue. Thus, one must remain utterly unencumbered.)\n\nThe third step speaks of *Gou* (Encounter).\n(Xie’s note: The movement returns to true noon, where *Guai* (Decisiveness) passes through *Qian* (Heaven) and reverts to *Gou*—the great work of reversal in the Dao of alchemy is now manifest! Its secret lies solely in \"thought within non-thought.\")\n\n[Internally *Xun* (Wind), externally *Qian* (Heaven).]\n\nThe *Tuan* commentary states: \"Gou (Encounter) means encounter—softness encounters hardness.\" Yin is soft. \"When hardness encounters central correctness, the great Way prevails throughout the world,\" meaning hardness overcomes softness. The fifth line is centrally correct, thus hardness encounters central correctness. Yin begins to arise, so it is fitting to restrain and illuminate. *Gou* and *Fu* (Return) are mutually resonant: in *Fu*, both dragon and serpent lie dormant, while in the feminine sovereign, the ten thousand things flourish—such is the principle of yin and yang mutually concealing one another.\n\nThe *Xiang* commentary states: \"Heaven and Earth encounter one another, and the forms of all things become manifest.\" Thus, all paths open simultaneously. \"Beneath Heaven there is wind\"—no path remains obstructed.\n\nAt this stage, when the movement reaches true noon, the key lies solely in diligent illumination.\n(Xie’s note: At this point in the work, one is prone to scattering or torpor, so one must intensify focused awareness, maintaining an unbroken thread—this is what is meant by \"thought within non-thought.\")\n\n[Kuizhong’s text concurs. The Tao edition adds the words \"thereupon\" at the beginning, and renders the following line as \"all paths open simultaneously.\"\n(Xie’s note: When the primordial spirit is fully awakened, body and world unite, and Heaven, Earth, the ten thousand things, and all people appear within the aperture. This speaks of the flourishing of the central movement of the primordial force—abundant and rich, nothing is lacking. Yet one must remain wary of the sun’s descent after noon and the moon’s waning after fullness, hence the need for restraining illumination. True noon corresponds in the world to the central primordial force, in the body to the heart, and in the stages of practice to the living noon hour—a time when the first trace of yin arises, thus requiring restraint and illumination.)]\n\n*Dun* (Retreat) follows.\n\n[Inner *Gen* (Mountain), outer *Qian* (Heaven). The Image states: \"Heaven beneath has a mountain—*Dun* (Retreat). The noble one distances petty persons, not through aversion but through solemnity.\" The noble one refers to *Qian*; *Qian* is distant and solemn. At *wei* (the eighth Earthly Branch), its position is already remote—remote yet solemn, this is the Way of rectifying the root and purifying the source. With yang rightfully positioned while yin gradually grows, the image of imbalance arises.]\n\nAt *wei*’s zenith, rectify the root and purify the source.\n<Xie’s note: From the *Gou* hexagram to the *Bo* hexagram, what manifests is the world’s karmic landscape from \"the present\" to \"the future.\" In a single moment, it appears within the mysterious aperture. Those of shallow cultivation may perceive only one to several years of worldly fate; those of deep cultivation see ten, a hundred, or a thousand years in an instant. The shallow practitioner’s *qi* encompasses a village or county; the profound, a province, a nation, or even the world entire. By the time of *Kun*, the ten thousand things return to stillness in profusion. This secret holds no other principle—only that the primordial spirit must not be lost. One contracts body and mind into the Central Yellow Ancestral Aperture, merging them into emptiness and chaos. The work of healing the world begins here: with rectified intention, one prevents the scene of cold decline from becoming excessive.>\n\n[Kuizhong’s text is identical. Tao’s edition reads \"若\" (*ruo*, \"if\") for \"已\" (*yi*, \"already\"), and \"便有偏颇\" (\"then imbalance arises\"), for this is where the people forget goodness. When the world has long been at peace, people grow complacent in ease. Complacent in ease, they forget goodness; forgetting goodness, the seeds of evil lie hidden—this is the natural course. One must embody the phrase \"rectify the root and purify the source\" to find a place to begin. My humble opinion: the secret lies in welcoming the One to transform it, not merely in welcoming *Kun*’s primordial force.]\n\n*Pi* (Obstruction) follows.\n\n[Within, *Kun*; without, *Qian*. The *Tuan* says: \"Heaven and Earth do not interact, and the myriad things do not communicate. Within are petty men; without, noble gentlemen.\" Thus, strength without belies hollowness within. \"Greatness departs, smallness arrives\"—this is the time for cultivation and nourishment, for it is the sign of Heaven and Earth’s closure and obstruction.]\n\nOnce entering *shen-zheng*, only cultivation and nourishment remain.\n\n[Kuizhong’s text is identical. Tao’s edition reads below *shen-zheng*: \"Strength without, hollowness within—one must engage in cultivation and nourishment.\" The meaning aligns with this text. For when *shen-zheng* arrives, the cycle stands at the beginning of the lower epoch. At this time, the people, long settled in ease, have made indolence their nature. They know no striving, harbor no foresight, and the prevailing *qi* is frivolous and extravagant, their conduct dominated by ornament. Thus it is called \"strength without.\" Yet the people’s lives are abundant, their *qi* already dispersed, and the hundred products gradually exhausted—thus it is called \"hollowness within.\" Should calamity suddenly strike, they will risk all in desperation, only hastening their ruin. Truly, it is lamentable. (Xie’s note: In a single thought, heaven or hell.) Those who aspire to this Dao must take cultivation and nourishment as their sole task, thereby anticipating peril and preventing it.]\n\n*Guan* follows.\n\n[Inner Kun, outer Xun. The Image states: “Wind moves over the earth—*Guan*. The former kings thereby inspected the regions, observed the people, and established teachings.” *Guan* governs the transformation of the people, and thus must bring forth renewal. With the five positions unchanged, it is called “Great *Guan* above.” Near to the Qian line, it thus welcomes Qian. The Tao edition reads “accomplishing the worthy kalpa,” for within the hexagram of the You hour lie *Jian* and *Mingyi*, marking the hardship of the epoch.]\n\nShould one encounter You-zheng, the secret lies solely in bringing forth renewal. (Xie’s note: Only extinguish the mind of discrimination, not the mind of illumination—let the light of Qian’s primordial origin at the crown merge with the radiance of the eyes and heart, shining downward. This is the method of supplementary practice, detailed in the first step. In sum, it is a matter of “harmony at the center.” If one is already “harmony at the center,” there is no need to add a head upon a head.)\n\n[The *Kuizhong* text concurs; the Tao edition reads beneath “You-zheng”: “the secret lies in welcoming Qian to accomplish the worthy kalpa.” This aligns with the present text. You-zheng marks the middle phase of the lower epoch, where old stains and corrupt customs prevail. One welcomes the *qi* of Qian to sweep them clean, enabling the people to renew themselves. Yet the obstinate and slanderous still seek to arise together—if the people renew themselves, the coming kalpa’s disasters will be transformed from great to small, which is what is meant by the “worthy kalpa.” How vastly different from the devastation of war and fire! Lü Zu surely harbored profound intent here. What is the worthy kalpa? It is famine, pestilence, epidemics, and deluges.]\n\n*Bo* follows.\n\n[Within *Kun*, without *Gen*—this is the hexagram *Shu* (Decay). The *Qian Zao Du* states: “The Yin, in its injurious course, corresponds to the ninth month’s season, when yang *qi* wanes and recedes, yet Yin ultimately cannot exhaust Yang.” (Xie’s note: The crux lies in the phrase “cannot exhaust Yang,” for it is through this that *Bo* (Decay) passes through *Kun* (Earth) to return to the hexagram *Fu* (Return) at the correct *zi* hour—thus the great work of reversal in the Dao of the Elixir is once more revealed!) “The petty man cannot overpower the noble man.” It is called *Bo* (Decay), meaning only that stability is lost.\n\nThe *Tuan* says: “Unfavorable to proceed; the petty man waxes.”]\n\n*Kun*\n[All six lines are Yin—this is the hexagram of *Hai*. Its virtue is yielding compliance and steadfast integrity; its *qi* is extinguished in *gui*, the image of utter darkness, where Yang is wholly consumed. Hence the oracle: “Tread on frost, and solid ice will come.”\n\n*Shu* and *Hai* form *Bo* and *Kun*, yet here it is said: “The method lies in *Zhun* (Difficulty) and *Meng* (Ignorance), awaiting *Fu* (Return).” Setting aside the hexagram of the present time, it speaks instead of “acting in accord with the moment’s use,” meaning that at this time, one must only rest and nurture. For *Shu* and *Hai* correspond to the lower extremity of the body and the lower epoch of the lower cycle—whether within or without, all must rest and nurture.]\n\n(Xie’s note: The secret lies in spirit and breath interdependent, spirit and *qi* united, spirit returning to the belly of *Kun*—a great rest, yet not torpor, not Yang sinking into Yin, not Yang buried in Yin, but the image of primordial chaos. In the Dao of the Elixir, torpor must be strictly avoided at this stage.)\n\nWhen the cycle reaches *Shu* and *Hai*, the method lies solely in *Zhun* and *Meng*, awaiting *Fu*.\n\n[The *Kuizhong* manuscript agrees. The *Tao* edition renders the latter phrase as “merely *Zhun* and *Meng*.” Its meaning differs not from this text. *Zhun* and *Meng* are the images of all things in dark obscurity, to be nurtured only in anticipation of their return. *Zhun* is inner *Zhen* (Thunder) and outer *Kan* (Water): movement encountering peril, its karmic course beset by hardship—thus *Zhun* benefits from steadfast integrity. *Meng* is inner *Kan* and outer *Gen* (Mountain): *Kan*’s wisdom and *Gen*’s stillness, the numinous nature obstructed, its mechanisms and apertures unopened—thus *Meng* nurtures correctness. In the great epoch’s *Shu* and *Hai*, all things rest; in the lesser epoch’s *Shu* and *Hai*, nurturing the primordial *qi* is likewise precious. Ancestor Lü said: “Tracing the cause of this condition, it arises entirely from loss of illumination and loss of cultivation.” This speaks to the lesser epoch’s potential for redress in advance.\n\n(Yide’s note: The *Book of Changes* states, “The Way of all increase moves in accord with the time”; the *Book of Documents* says, “The Dao has ascent and descent, governance transforms with custom”—this is Confucianism’s view of adversity and prosperity in the cosmic epochs as a means to heal the world. The *Avataṃsaka Sūtra* declares, “Pure and luminous, it illumines the world; with unimpeded vows, it abides through all kalpas, ever diligently benefiting all beings”; the *Śūraṅgama Sūtra* says, “Through kalpas as numerous as the Ganges’ sands, it saves the world and brings all to peace”—this is Buddhism’s traversal of epochs without measure as a means to heal the world.)]\n\nThis is the third step in the initial practice.\n\n[Note: The preceding text originally included the line *\"Lüzu states: ‘In examining the cause of this, it is entirely due to the loss of illumination and cultivation.’\"* (seventeen characters). As no other passages in the preceding or following text are attributed to Lüzu, this was likely added later when the book was presented to Lüzu, and the copyist mistakenly incorporated it into the main text. It has now been moved to the preceding annotation.]\n\nPrivately considering this work: the first two steps, from the crown to the chest, speak of the body without reference to the world. In the third step, the division into six periods reflects that when the practice reaches the *wu* (Noon) position, it pertains to the heart—ruler of the body and ruler of the world. From *wei* (1–3 PM) onward, it pertains to the abdomen and to Jambudvīpa. As worldly affairs differ, so too do the methods of redress; thus, each period is analyzed separately to clarify the application suited to the epoch. The function of these six periods concerns the work of learning and inquiry: one must enrich the Dao and its methods in times of non-application. From *wu*, *wei*, *shen*, *you*, *xu*, to *hai* (Noon to Midnight), each welcomes and aligns with the infusion of *Qian* (Heaven). *Qian* is the sovereign. Only after mastering the learning of redressing the world in accord with the time can one bear the weight of this world; only after harmonizing the primordial and aiding transformation can one ascend to rectify the sovereign’s heart.\n\nTo engage in the work of benefiting the people, one must first take the enlightenment of the ruler as the primary task.\n\n**[Fourth Step of Exposition]**\n*Return* [☳ *Zhen* within, ☷ *Kun* without. *Zhen* is cultivation, introspection, and the attainment of fortune; *Kun* is virtue harmonizing without bound. The *Tuan* states: “*Fu* (Return) is smooth; the firm returns in movement and proceeds with compliance. Beneficial to have somewhere to go—this is the growth of the firm.” The yang returns to its origin and accords with the celestial movement; the yin complies with it, revealing the convergence of clarity and goodness.]\nThereupon, the flower blooms to reveal the Buddha—self-created auspicious convergence. For ten thousand years, this is the fourth step of commencement.\n\n**[Textual Variants and Annotations]**\nIn the *Kuizhong* manuscript, the *Tao* edition reads “既乃” (*thereupon*) instead of “已而” (*thereafter*), with two additional lines: “别有妙用，不外忠贞” (*There is a wondrous function, none other than loyalty and steadfastness*). Below “自造庆会” (*self-created auspicious convergence*), it includes “得致” (*attains*).\n*Flower* refers to the flower of the heart-Buddha, a metaphor for the ruler. *Blooming* signifies the opening of the heart to reveal sincerity—within, there is no rigid self or obstinate intent; one follows the moment to guide and enlighten, rectifying what is amiss through awakening, as if a red furnace melting snow with divine efficacy.\n“None other than loyalty and steadfastness” means that loyalty and steadfastness unify all in one virtue, fostering mutual trust between above and below without need for words or texts—hence “self-created,” the penetration of sincerity. Loyalty ensures inner and outer consistency; steadfastness ensures diligence day and night. Thus, one can fill the air with solemn harmony. Ruler and minister alike exist within this single *qi*; the former embodies virtue, the latter the people. The four seas and all living beings unknowingly receive its blessings.\nAs Ancestor Lü said: “Only those who know how to welcome the One and the primordial can achieve this.”\n**[Citations]**\nThe *Book of Documents* states: “Harmonizing yin and yang, reverently illuminating Heaven and Earth.”\nThe *Śūraṅgama Sūtra* states: “In great bodhi, one attains thorough penetration, awakening to the Tathāgata and exhausting the Buddha’s realm.”\nThe *Dhāraṇī of Upholding the World* states: “Benefiting and bringing peace to all sentient beings.”\nAll share this same function.\n\n**[Fifth Step of Exposition]**\n\nAt this stage [☱☶ (Inner Duì, Outer Kūn). Duì represents joy, Kūn compliance—thus, no disjunction. *Yuan heng li zhen*. The *Tuan* states: “Joyful and compliant, firm in the center and responsive.”—“Joyful and compliant” is the origin of primordial unity; “firm in the center and responsive” is the wondrously congealed virtue, great penetration through correctness.]\n\nAt this moment, merit attains seamless continuity; every action and measure aligns without deliberation, for the two *qi* have merged as one, will and spirit undivided—this is the divine verification of wondrous congealment. This is the fifth step in practice. **[Xie’s note: Floating within the compass of regulation, fetal breathing nurtures the true, Qian and Kun merge as one.]**\n\n**[Collation Notes]**\nThe *Kuizhong* manuscript and Tao edition are identical; the *Wenzheng Zang* edition contains minor variations.\nAncestor Lü said: “At this step, one must increasingly forget self and other, allowing the upright *qi* of Qian and Kun to billow like mist, vast as heaven and earth—only then does this verification arise. Should discordant tendencies occasionally appear, one must welcome the human *yuan* to harmonize them, double the welcome to Qian *yuan* to renew them, and Kūn *yuan* to soften them. With quiescent embodiment of the true One, all unifies naturally: the ruler becomes sagely, ministers virtuous, above and below share a single *qi*, and merit never slackens. The attainment of grand harmony is but days away.” **[Yide’s note]**\nAs the *Book of Documents* states: “All share a single virtue.”\nThe *Vajracchedikā Sūtra* states: “Because it lacks merit and virtue, the Tathāgata speaks of abundant merit and virtue.”\nAll are of this same Dao. **[Xie’s note: In the human body, the human *yuan* is the true yang of fetal breathing, the harmonized *qi* of heart and kidney. Qian *yuan* is the divine fire at Baihui; Kūn *yuan* is the primordial *qi* of the sea bottom at Yongquan, the fire of Kun. When these three merge as one, returning to primordial chaos, and one embodies them in quiescence, the “true” that governs these three “appears”—hence, the true One.]**\n\n**[Sixth Step of Exposition]**\n**Peace [☰☶ (Inner Qian, Outer Kūn).**\nThe *Tuan* states: “Heaven and Earth unite, and the myriad things communicate; above and below unite, and their wills align.”\nThe *Xiang* states: “The lord thereby completes the Dao of Heaven and Earth, assists the proper timing of Heaven and Earth, and thereby guides the people.”\nYin assists yang, Kun receives Qian’s mandate—this is the image of all undertakings flourishing, the four seas at peace.]\n\nAt this stage of merit, the court radiates harmony, all officials display brilliance, and the people’s concerns are fully known to the ruler.\n\nThen proceed to further welcome the true One—***(Xie’s note: In terms of the human body, this is \"gathering the medicine.\")***—its radiance descending to illuminate all directions. Next, welcome the primal power of Kun to nurture it—***(Xie’s note: Nurturing the true with embryonic breathing.)***—and the primal power of Qian to unify it—***(Xie’s note: Sealing and securing with the fire of spirit.)*** ***Xie’s note: Earthly *qi* ascends, heavenly *qi* descends, merging in the Central Yellow.*** Thus, the products of the earth proliferate, and the people’s conduct becomes pure and docile. This is the sixth step of practice. ***Xie’s note: When Heaven and humanity unite as one, the true One of Wuji appears, and the Great Ultimate spontaneously generates and transforms itself. My embryonic breathing intertwines and yearns with the *qi* of Heaven and Earth, circulating in misty transformation. The hundred vessels and myriad apertures flow in ceaseless motion—this is what is meant by *\"The Dao gives birth to the One, the One gives birth to the Two, the Two give birth to the Three, and the Three give birth to the myriad things.\"* In terms of the world’s fortunes, this brings great peace under Heaven, pure and upright customs among the people, abundant resources, and the upper and lower classes communicating as one *qi*.*** (The character 驯 should read 良.)\n\n[The *Kuizhong* manuscript and Tao’s edition are identical here; the *Wenzheng Zang* edition contains additional text that is not fully transcribed. (Yide’s note)]\n\nAs the *Book of Rites* states: “Virtue is the essence of human nature, reaching to Heaven above and coiling through Earth below, moving through yin and yang and penetrating the realm of ghosts and spirits.” When its efficacy reaches this point, Heaven and Earth align, the four seasons proceed in due order, the *Gen* trigram radiates virtue, and the five grains flourish. The *Book of Songs* says: “Truly, this noble one has achieved great completion”—this is the unity of the inner and outer Way.\n\nThe *Vajracchedikā Sūtra* states: “The Buddha declared that what is not the body is called the great body, for it contains the great thousand worlds within a single grain.” The *Amitābha Sūtra* says: “In the land of Amitābha Buddha, sentient beings know no suffering but only receive every joy; hence it is called *Ultimate Bliss*.” All these speak of the Dao residing in the individual while its effects extend to all beings—this is the boundless pattern of bestowing and granting.\n\nThe world-saving Way of the Confucian and Buddhist traditions is likewise encompassed within this text. As Master Lü said: “This is the ultimate achievement in governing the world, the highest capacity of the sage—yet it does not depend on anything external. The six directions and nine provinces are all contained within the womb of *Kun*; breath can connect them.” [Xie’s note: This refers to the breathing of Heaven-and-human unity, the great embryonic respiration of their harmonious union. However, one must not fixate on the *Kun*-womb as merely the physical abdomen.]\n\nAll people can cultivate this; the key lies in unwavering resolve and the strict avoidance of acting on private cleverness.\n\nHe also said: “Heaven and Earth have no mind of their own; they entrust their mind to humanity. Thus, when people act, their actions must bear fruit.” And further: “Know that the fortunes of the world rise and fall through upper, middle, and lower phases, just as a person passes through youth, prime, and old age. No one wishes to remain forever old, so how could Heaven and Earth not desire to remain forever in their upper and middle states? The perfected one embodies this truth and thus leaves this teaching for those of resolute aspiration. Yet there is a principle most profound, which has never been fully revealed throughout the ages.\n\nLong ago, I first heard this teaching and privately awaited its fulfillment. Only after attaining the Dao in full completion did I realize that my earlier efforts had been insufficient. Now, I can only transmit this teaching [the phrase “transmit this” indicates that these are not the original words of the scripture but the Master’s exposition for the benefit of others] to those who will follow in its footsteps. You, my disciples, should not press for exhaustive inquiry [given the vastness of this scripture’s Way, even immortals do not hear its entirety; how could ordinary people demand to scrutinize its secret records? The Master’s compassion allows us to hear this transmission—is this not a blessing earned over three lifetimes?].\n\nNow, I will explain in detail the foundational means by which this can be achieved [clearly, the earlier portion of the scripture contains further practices of cultivation; the following describes the essential basis for attainment]. Thus he said:\n\n*The Kinship of the Three* and *The Awakening to Reality* suffice to perfect destiny; *The True Words of the Dao-Chanting* suffices to perfect nature; *The Jade Scripture of the Great Cavern* suffices to transform the mundane; *The Three Nīla’s World-Saving* suffices to verify fruition. Yet among these, *The Kinship* and *Awakening* contain many hidden secrets and are easily misinterpreted, leading one astray.\n\n*The Jade Scripture of the Great Cavern* is concise yet comprehensive in its principles, transforming the *qi*-nature with extraordinary efficacy. When supplemented by *The True Words of the Dao-Chanting* to refine the mind, the Three Treasures become pure and refined. Then, one may study *The Kinship* and *Awakening* to perfect destiny, and *The World-Saving* to verify fruition.\n\nAs for verifying fruition—what practice could surpass that expounded in *The Three Nīla’s World-Saving*? Alas!\n\nA wronged village woman may halt the rains for three years—such is the power of misfortune, and so too is the power of fortune. I have personally witnessed this confirmed in the \"Three Nīla\" texts, all attesting: so it is, so it is.\n\nThe \"Three Nīla\" further state: \"One whose cultivation of nature is imperfect will find verification impure; one whose cultivation of destiny is imperfect will find attainment unstable; one whose *qi*-nature remains unrefined will find efficacy unspiritual. Only when the Three Treasures are fully perfected and one returns to the primordial can the practice be entrusted to others.\"\n\nThis is the most profound of profound principles—one I had never heard before. Now, you may awaken to it. Otherwise, how careless are the two great forces in their self-governance! How negligent are the myriad sages in their shared reverence! Is this not the greatest enigma since the dawn of life?\n\nFrom this day forward, seize the years, months, and days of this life. Practice diligently without slack, perfecting this mortal form to verify fruition—is this not fitting?\n\nYet to cure illness, one must know its source. Without knowing the source, how can one begin? The two great forces are without mind or desire. Yet they cherish life, and where life proliferates, scarcity follows.\n\nIn medicine, there is the method of supplementing the child when the mother is ailing, and the mother when the child is ailing. To preserve the ultimate and renew the people—this is one method. To cherish the people and repel calamity—this is another.\n\nOnly in this *World-Saving* practice does there exist a cyclical remedy, infinitely efficacious, costing not a coin, expending not a thread of effort, achieved through stillness. Its merit is perfected, and one ascends. Compared to the three thousand merits and eight hundred deeds that require human effort, is it not better to rely on a single thought, freely wielding mastery with a method neither cumbersome nor complex? To squander years in vain—is this not delusion?\n\nThe time is now, the time is now—do not wait!\" —This was expounded in the third year of Daoguang.\n\nMoreover, it is said: \"When the two great *Primordials* are restored, all things flourish and humankind is good. When humankind is good, all things flourish; when all things flourish, humankind is good. Is this not the prosperity of the age?\n\n<*Xie’s further note*: The two great *Primordials* refer to the *Primordials* of *Qian* and *Kun*. In the human body, one who attains the *Primordial of Qian* experiences the arising of yang in *nature*—this is the opening of the *Mysterious Pass of Nature*, also called the *Upper Mysterious Pass*. One who attains the *Primordial of Kun* experiences the arising of yang in *destiny*—this is the opening of the *Mysterious Pass of Destiny*, also called the *Lower Mysterious Pass*. In truth, there is only *one* \"Mysterious Aperture,\" yet its manifestation varies according to each person’s capacity, cultivation, and circumstances. When the *Mysterious Aperture* is fully opened, *nature* and *destiny* unite, the two *Primordials* merge as one, self and other dissolve, and the *True One* appears. Abiding in the *One*, the *One* spontaneously transforms and generates life—this is what is meant by \"when the *One* aperture opens, all apertures open.\"\n\nThe method of *World-Saving* consists in but eight characters: *\"Emptiness, stillness, merging, transformation—no thought within thought.\"* The crux lies in *\"no thought within thought,\"* which is to say, *\"When the will is undivided, it congeals into spirit,\"* or again, *\"The thought is the True One.\"* First, release to the utmost; then, gather to the utmost. From the radiance of release, turn inward to introspection. The utmost of gathering is nothing more than the *Great Void*; the utmost of release is nothing more than the *Great Void*. Release is not truly release; gathering is not truly gathering.>\n\nDoes this not embody the principle of mutual healing? Why then hesitate?\n\nIn ancient times, on Mount Guye (pronounced *Yi*), the divine person surnamed Xu, named Jing, styled Ziyou, established the healing of the two *Primordials* during the reigns of Yao and Shun. As a result, the floodwaters were pacified, and the Miao people submitted—is this not clear proof? (This is also recorded in the *Dialogues of Ge and Lu*.)\n\nEven more remarkable is the *Dhāraṇī of Upholding the World* preached by the Buddha, personally transmitted to the elder Miaoyue in the kingdom of Jiao Mi. To this day, the Western Regions continue to benefit from its blessings, as attested in the Buddhist scriptures (also cited in Peng Chimu’s *Random Notes on the Buddhist Canon*).\n\nHow can the merit and virtue of such deeds be measured?\n\nThe lineage of our school has seen only the Seven Masters of the Northern Tradition attain the fruit of immortality through this Dao. Yet it is a path open to all. Formerly, without the august decree of the Jade-Pure Divine Mother, it was kept secret and never dared to be revealed. Now, however, having received Her sacred mandate, proclamations have descended through the Three Heavens, universally enjoining the Three Realms to permit its transmission and reception, without distinction of male or female. The Three Heavens and Three Realms shall guard and protect day and night; those who sincerely uphold it shall receive response upon invocation, and no demonic forces shall dare to interfere. Truly, this is an encounter unparalleled since the dawn of creation—a supreme fortune for the workings of fate, and a boundless blessing for countless generations to come.\n\nYet it is essential that there be those who lead by personal example. The remaining secrets hinge upon attaining union with the True One as their foundation, while all cultivation begins with the practice of *embryonic respiration*. I know this Dao shall not remain forever hidden, and thus in former times I descended to expound and record these teachings, which have been preserved in the Dragon Ridge Mountain Chamber of this very mountain. Now, I reveal them fully and without reservation. You who receive these words must reverently adhere to them, taking care never to harbor even the slightest expectation of immediate results—for the principle is thus, and the Dao is thus.\n\nSuch was the instruction of Ancestor Lü. Those who are devoted to this Dao, upon reading this text, will surely awaken to what they have not yet awakened, embodying and practicing it with diligence. May the Three Nuns silently bear witness.\n\nThis compilation (*Yide*) gathers the surviving instructions of Ancestor Lü and elucidates the original intent of this text. The remainder is largely drawn from the *Inner Collection of the Orthodox Tradition of Heavenly Immortals* compiled and edited by Minister Jiang Yuanting. In his postscript, the Minister writes: “I have heard that on Mount Wuhua in Yunnan, there is a *Scripture on the Ancestral Master’s Healing of the World*, which appears to align with the profound meanings set forth in the *Inner Collection*. Though I have sought it extensively, it remains unobtained. If found, I intend to place it at the head of the *Inner Collection*, for it must contain essential mysteries. Its absence from the *Daoist Canon* is a grievous omission.”\n\n(*Yide*) privately surmises that what the Minister heard may refer to the version from Mount Jizu, though his account seems based on hearsay, hence the mention of such a scripture. However, upon examining the original preface by Master Tao, it is clear that the secrets are not part of the scriptural text, and the title *Ancestor Lü’s Healing of the World* is also erroneous. This note is made in anticipation of further verification.\n\n(*Yide*) respectfully records.\n\n+++ **Postscript to *Master Lü’s Three Nis’ Formula for Healing the World***\n\nThe block-printed edition in my case originally contained no hexagram diagrams. The manuscript copy I obtained from the Zhu family, however, includes hexagrams preceding each step. Some suspect these were later additions by Daoist practitioners. I maintain that the manuscript has circulated for generations and should not be altered; thus, I have annotated the hexagram meanings while preserving them.\n\nOthers have questioned: “The world’s afflictions are manifold, and the art of healing it admits many methods—averting drought and flood, dispelling pestilence, suppressing warfare, eradicating disease, rescuing from fire and drowning, and warding off great disasters. Such tasks demand vast spiritual potency and mighty dharmic power, the deployment of talismans and mantras, responses as boundless as the needs themselves. Yet this text proposes a single method to cure all ills—is this not overly simplistic? Or does the full work contain all methods, which you have not yet seen?”\n\nI replied: “What you describe are *techniques*; this text speaks of the *Dao*. I am certain it does not discuss techniques. Those who grasp the profound Dao disdain illusions like striking stones to summon chess pieces. Those who wield divine mechanisms scorn tricks like waving fans to reverse wind or pouring wine to summon rain. Could the great Dao of the sages ever be adulterated with mere arts? It is true I have not seen the complete text; but I do not believe the full work contains such techniques. The versions I have seen differ in wording, and rumors vary still. Who is to say some eccentric has not surreptitiously inserted talismans and incantations from other texts, leading readers to mistake them for the original? Error begets error, flowing into the realm of occult arts, deceiving and deluding. Such corruptions should be burned.”\n\nThey pressed: “Yet disasters are manifold—can one doctrine truly address them all? Or must we resign ourselves to inaction?”\n\nI answered: “You do not understand the Dao and are fixated on techniques. Techniques are small; the Dao is vast—beyond your comprehension. All worldly afflictions arise from the excesses of the Five Phases’ *qi*. Within our own bodies resides the upright *qi* of the Five Phases, corresponding to the five directions. By diagnosing the source of affliction and attacking the affected direction, we harmonize the world’s *qi* with our own. Internally, we perceive no self; externally, no others. Excess is reduced; deficiency is replenished. Stagnation is dispersed; rigidity is transformed. Reversal is corrected. Though diseases are innumerable and healing arts inexhaustible, the regulation of *qi*—its waxing and waning—must be tailored to each condition. When a person is ill, we mobilize the yin-yang transformations of our own body. When the world is ill, we likewise regulate it through our body’s yin-yang. Swift yet effortless—how wondrous! Yet this is not something ordinary people can achieve. It is the primordial *qi* of *Qian* and *Kun*, the True Unity. By reverently preserving it, response follows as echo to sound. Moreover, when the great Dao prevails, why wait for calamity to act? Why merely patch imbalance and salvage ruin? Those who grasp this principle will not be misled by talismans, incantations, or numerological arts.”\n\n**Dated:** The fourth month of the *wùzǐ* year of the Daoguang reign (1828), **Min Yide**, eleventh-generation successor of the Longmen Orthodox Lineage, respectfully inscribed at Ganlu Garden in Jinling.\n\n**Transmitted by:** Master Taixu Shen Yibing\n**Recompiled and annotated by:** Disciple Min Yide\n\n**The Three Nis:** Confucius (Zhongni), Śākyamuni (Muni), and the Green Ni (Qingni).\n**The World:** Here, the term encompasses both the macrocosm and the microcosm of the body, signifying the healing of the world through the self.\n\nMaster Lü’s earlier *Three Nis’ Discourse on Healing the World* was once in my possession, and I annotated it. However, the *Formula* was incomplete. The *Formula* volume was obtained from Elder Taixu, who stated that the *power* resides in the divine holding of the Jade Scripture, while the *formula* begins with the *Mystic Store Mantra*. The text was later taken by a friend, and forty years passed before I recovered it. I have now recompiled and personally annotated it, adding invocations to clarify its application. Thus, the *Formula* and *Power* are now complete. Not for private gain, I humbly share this with fellow practitioners.\n\n---\n\n**Mystic Store Mantra**\n\nCloud-seal of the Great Void,\nAt the dawn of kalpas,\nNow distant, now near,\nNow sunken, now floating.\nWandering the Five Directions,\nBeyond a *zhang*’s span.\n\n**Annotation to the Formula:** The master’s instruction to compile the *Mystic Store* is to guide practitioners in directing their minds to the origin of things. Before our forms took shape, we were of one body with the Great Void—like cloud-seals at the kalpa’s beginning, drifting near and far, floating and sinking across the Five Directions, yet never beyond the *zhang*-square of the celestial heart. Upon embodying form, we initially retain our true primordial *qi*. Later, as external things entangle us and the discriminating mind takes control, we forget to return. Over time, habitual defilements accumulate, leaving us no leisure even to seek healing—how then could we practice this formula? Thus, I urge those who aspire to this path to first investigate things and extend knowledge, sincerely rectifying their intentions. Only with sincere intention can one study this. Before holding the scripture, recite this mantra to renew mind and eye, returning to our origin. This prevents the discriminating mind from gaining foothold, securing the original destiny and calming the heart. Once settled, the true primordial *qi* is restored. Only then can the cloud-seal pervade the Great Void—proof of movement arising from supreme stillness. Yet this movement is spontaneous, drifting near and far, floating and sinking, unsettled. As a thing, it is utterly empty, utterly numinous, now hidden, now manifest. Once the Five Directions reveal their signs and the Great Void bears cloud-seals, images may be derived and texts composed. Though additions and omissions may occur, the *zhang*-square of the celestial heart remains unfathomable—this is the principle of movement without departing from the ultimate. It is like saying: our heart never strays from the square inch.\n\nThe square inch is the heart. The human heart is called the \"square inch,\" while the celestial heart is called the \"square *zhang*.\"\n\nThe Heavenly Perfected One respectfully examines the Daoist canon: in heaven, this is the Heavenly Perfected One; in humans, it is the original destiny and primordial spirit. Taking up the brush to inscribe, one unfolds the *Dongzhang*—the *Dongzhang* being the Jade Scripture, the text that generates heaven, earth, and all beings. The Perfected One, as the primordial truth, thus embodies and unfolds the scripture. In human terms, this is the enlightened spirit of prior awakening. Before signs manifest, the spirit first awakens—this is the true purport of the Jade Scripture, from which scholars must not deviate.\n\nNext, inscribe the numinous talismans. These are the words of the *Dongzhang*, which the Perfected One divides and writes, each character becoming a talisman. The Primordial Beginning descends, and the true scripture spreads forth. This Primordial Beginning is the celestial spirit of the Primordial Dharma King, the essence of the Three Powers’ true unity. The \"true scripture\" below refers to the sacred teachings born of the Three Powers, the sagely instructions flowing with the times—these are the scriptures of the Three Teachings. Luminous yet existent, obscure yet nonexistent: all are born and transformed by the true unity, manifesting as wondrous being and wondrous nonbeing, two yet one. Thus, all is encompassed by this character.\n\nIllness may heal itself, and worldly toil and drowning can be rescued. Worldly afflictions arise half from human affairs and half from adverse fate, so they cannot be cured by medicine alone. Worldly toil stems half from habitual defilement and half from innate *qi*-endowment, so it cannot be sustained by authority or favor. Only by embracing the One, refining and transforming, can illness heal itself and drowning be rescued. Those who aspire to renew themselves and others must diligently embody and practice this.\n\nBoth the hidden and the manifest depend on it, and thus one ascends to the Pure Capital. The hidden is the way of earth, the obscure; the manifest is the virtue of heaven, the luminous. The human body encompasses both—this is the body and heart. Only those who know the bright yet guard the dark, know the male yet guard the female, may use it without bias, so that both hidden and manifest are upheld. The Pure Capital is the celestial abode of the Three Pure Ones. \"Ascend\" means to level. By following the One and drawing the One, refining and transforming, one naturally levels and attains the Pure Capital. This reveals the wondrous function of the true unity: the character in the previous line directly connects to the character here.\n\nThis is the Treasure of Primordial Destiny, impervious to eons of erosion. If one constantly recites it, one’s generation will become a companion to heaven. Here, \"generation\" refers specifically to the individual. The Treasure of Primordial Destiny is the single stroke within *Kan*, rising from the sea bottom, piercing the tailbone, threading the spine to reach the brain, transforming into the royal infant, suspended at the celestial cover bone. When it circulates to the Central Palace and *qi* converges, it forms a full moon, and the heart reveals the cinnabar-red characters of the Celestial Stem—ultimately, the gathering of the central generative *qi*. In heaven, this is the Star of Stability, towering above the sun and moon, the essence of earth ascending to form its image. As *qi*, it is supremely centered and upright, at once utterly firm and utterly benevolent. The *Daoist Canon* states: where it infuses, transformation occurs; where it stabilizes, rectification follows. Its light revolves with the Dipper, its heart never straying from the ultimate. This means its heart is steadfast, like the pivot of a millstone. Thus, the Central Palace remains perpetually settled. In our generation’s healing of the world, when the heart’s affairs align with stability, the Stem’s *qi* naturally descends. Therefore, the physical form must be upright, like standing atop a mountain peak, gazing into the vast emptiness. For stability is like the sun, ascending to the celestial verge, requiring no human effort to radiate its light throughout the body. Only when body and heart are empty and still will the countenance shine. If one practices thus, the body becomes like fine silk or a valley, transparent within and without—this arises only when the Central Palace reaches the extreme of emptiness and stillness. Moreover, one must not cling to the luminous but also heed the obscure. Once the body attains purity and harmony, viewing it as if innate, the heart remains unmoved—this is attaining purity and harmony without attachment to form. Further, if one can forget even this provisional method, one enters perfect realization. Yet if one forgets even this expedient, one falls into the naturalistic heterodoxy, either scattered or torpid. This is why the ancients relied on the Treasure of Primordial Destiny. For the Treasure of Destiny is the true unity of one’s body; using the One to stabilize, the heart becomes settled. Now, in embodying Lüzu’s use of the Jade Scripture to harmonize the heart, its purport is even more profound, its function even more subtle. My teacher employed it to assist the Treasure of Destiny, ascending to welcome and descending to infuse, the entire being empty and numinous—its efficacy is especially divine. For the Jade Scripture is the essence of the Three Powers’ true unity, and the Treasure of Destiny is the heaven-bestowed true unity. When the One draws the One, being and nonbeing mutually dissolve and transform—how could the world not be governed? Yet only those of utmost sincerity and unceasing effort can achieve this. Thus it is said: \"If one constantly recites it, one’s generation will become a companion to heaven.\" Such is the ancient sages’ admonition. This means that though the Jade Scripture is numinous, it is even more crucial that recitation never cease.\n\n**Jade Scripture**\n\n*Luo san lan bo, dai qia tai li, tang yun tui ru, lian guang ling du.*\n*Yu luo shu miao, yu fu chao san, zhao sheng tian heng, zhi shi ming qian.*\n*Ting pan bao ji you xuan wo cheng, sha fu yan ming, gui hui he zi.*\n*Cun le xian le, bai fen tian gou, tu cheng yuan ping, mi jie zhang sheng.*\n*Zhang jie lu miao, lai meng long deng, ning xie quan xin, di ni tuo lai.*\n*Namo jue fa, cheng jin you yan, ri yue xing dou, yao xi ming qi.*\n*Fang yuan de qiu, shou zhen gu ling, shou tian di jing.*\n\nHere follows the translation:\n\n---\n\nCareful examination reveals that the Jade Scripture’s text concludes at *\"yao xi ming qi\"* (耀息命炁), while the subsequent passages enumerate the names of later patriarchs across the three great teachings of Confucianism, Buddhism, and Daoism—these are not part of the original scripture.\n\nThe scriptural text emerged at the dawn of the kalpa, before heaven, earth, or beings existed. It first manifested as clouds and mist filling the void, known as the *Mysterious Seal Script* (玄篆). The Primordial Sovereign (先天皇人) arose to embody it, tracing its forms and transcribing them into written characters—though without punctuation (句讀) to divide them.\n\nAs the text circulated through the ages and reached the Middle Antiquity, celestial spirits refined it into *Cloud Seal Script* (云篆) and *Tadpole Script* (蝌蚪), assembling it into coherent chapters. Later, the Divine Mother of Profound Truth (谌母) descended to orally transmit it to Patriarch Xu of Jingyang (旌阳许祖). Not only were the forms rendered with greater precision, but the sounds were also clarified in full.\n\nThe Patriarch wished to transcribe it into the standard script of the age but feared that the ignorant might introduce errors. Thus, he composed a four-character verse incorporating the meanings of the Elixir Way (丹道), ensuring no mistakes would arise—though this was not the original intent of the primordial scripture’s meaning. This four-character Jade Scripture, then, resembles Zhou Xingsi’s *Thousand-Character Classic* or the modern compilation of the *Lanting Calligraphy Model*: its essence lies in rhythm and structure.\n\nIn the past, I lamented the difficulty of comprehension and thus provided annotations, though they risked becoming empty verbal explanations. Fortunately, the phonetic readings mostly adhere to the original. However, for the characters *\"namo\"* (南無), I render them separately as *\"nang mo\"* (曩謨). For the character *\"gou\"* (垢) in *\"bai fen tian gou\"* (百奋天垢), I pronounce it as *\"hou\"* (后), with a distinct understanding that does not align with this oral tradition.\n\nUpon reviewing the *Medical and Worldly Achievement Formulae* (医世功诀), I found no annotations, only preserved phonetic readings as recorded. It warns against commentary, stating that prolonged recitation will naturally lead to realization. The original transmission’s profound teachings (玄训) are of utmost subtlety—meant to be grasped intuitively, not conveyed through words.\n\nIn the Daoist tradition, it is said: *\"Sincere recitation for one year makes one a human immortal; for two years, an earthly immortal; for three years, a celestial immortal. Even the least diligent, if they recite daily without interruption, may attain liberation through simulated death (尸解) and ascend the Way.\"* Could this be deception? The only danger lies in lapses in practice.\n\n---\n\nThe power of the *Jade Sutra*—how could it be fathomed? Now, I record its proven efficacy as transmitted by my teacher, offering it to the world. I only wish that learners enter its gate through the pure cultivation of a tranquil and empty heart.\n\nWhen regulated to the point where the chest is clear and still, the celestial realm attains perfect stability. When regulated to the point where the abdomen is open and at ease, the world’s households prosper. When regulated to the point where the four limbs flow freely, the four barbarian lands find peace. Thus, when the body is harmonized, the self is at peace; when the self is at peace, the world is governed. Its effects are swift as an echo—once the sutra is penetrated, it becomes the transformative power of the sage’s gate. This is no mere discourse on subtleties or mysteries, but a grounded and practical study of the Dao.\n\nThis is the supreme principle by which humanity stands as the third alongside heaven and earth. What doubt or fear could we harbor, that we would willingly abandon it? Yet, fearing that learners may not awaken, I have also compiled the proven formulae of past efficacy into an incantation, so that recitation may yield shared results. It is not like digging once to find a spring—if one person achieves tenfold, another a hundredfold, and another a thousandfold, even the dull-witted will surely attain clarity.\n\nWhat follows is the incantation, not the sutra’s text. Yet the formulae are contained below—study them carefully and practice them, not merely reciting with the mouth.\n\n**Incantation (Appended to the Sutra)**\n*\"I/We now recite...\"*\nThis phrase directly follows the sutra’s text. The use of *I* (我) and *we* (吾) rather than *your servant* (臣) is not arbitrary. According to the *Canon of All Daoist Traditions*, the human body is a microcosm of heaven and earth. Just as heaven and earth have their spirits, so does the human body, and the spirit of the human body resonates with that of heaven and earth. The invocation of *I* and *we* here follows the esoteric conventions of ritualists, used to bind the Dipper’s stars—not employed casually.\n\nBy this mystical law: on yang days, recite *I* (我) and bind it to the Nine Stars of the Greedy Wolf Dipper; on yin days, recite *we* (吾) and bind it to the Nine Stars of the Great Dipper. The method involves tracing one star per stroke, and those who understand the intent will recite *I* on yang days and *we* on yin days—this, too, has its verifications.\n\nThe human heart has seven apertures, supported by the waist and kidneys, forming nine in the \"lesser heart\"—this proves the heart’s unity with the Dipper. The precept warns against self-deception: one must heed the luminous mandate, for the formulae’s truth lies solely in its absence of falsehood.\n\n**Follow the teachings and practice accordingly.**\nWhat follows is all derived from verified practice, yielding real effects. Learners must earnestly embody and enact them, not merely recite with the mouth.\n\n**Guard the Three Powers as an egg.**\nThis means regarding heaven and earth as a chicken’s egg, with the human world as its yolk—what we guard. This phrase still resides within the state before joy, anger, sorrow, or delight arise.\n\n**The world transforms into a court of fortune.**\nHere, *world* encompasses both the self and the external realm. *Court* refers to the \"court of the Jade Sutra’s gaze,\" where the egg-guarding practice’s effects manifest fully—heaven and earth yield their tangible results.\n\n**Baneful stars retreat; auspicious radiance descends.**\nThese two lines echo *The Great Learning*: *\"Fortune graces the house, virtue graces the body; the heart expands, the body is at ease—thus the noble person must make their intent sincere.\"*\n\n**All heavens bestow blessings; wealth, rank, trust, and kinship flourish.**\nThese two lines embody the Dao of aligning one’s virtue with heaven and earth, one’s brightness with the sun and moon, one’s order with the four seasons, and one’s fortune with spirits and deities—acting prior to heaven without transgression. *Wealth and rank* derive from Buddhist scriptures, signifying prosperity and honor. *Trust* establishes, *kinship* humbles—nurturing life while rectifying virtue.\n\n**Observe heaven and grasp its constancy; renew the self to renew the people.**\n*Observing heaven* means witnessing its ceaseless sincerity. *Grasping heaven* means holding to its singularity as the source of all things. *Renewing the self to renew the people* is the tangible effect of personal cultivation on the populace.\n\n**Neither existence nor non-existence is established; both human and dharma are forgotten.**\n**Perfect emptiness, perfect stillness; perfect uprightness, perfect strength; perfect harmony, perfect peace; perfect awakening, perfect purity.**\nThese six lines describe governance through non-action, encapsulating the true state of one’s being—just as the sutra’s text arises from the self and the world. Only those who constantly dwell in the \"court of the gaze\" abide at its center and awaken to this perfection. For beginners, attempting to grasp it with the intellect is delusion—no accomplishment will follow. Yet one must know, preserve, and uphold this to develop steadfast power, enabling efficacy and ensuring future results.\n\nThus, some disciples, fearing learners might mistake intellectual understanding for realization, requested these six lines be removed—but I refused. Let all understand: the first line is the essential formula for entering the nature of heaven; the second, the profound insight for advancing in spiritual practice; the remaining four, the esoteric teachings against attachment or partiality. True attainment encompasses the six directions, the entire dharma-realm, without bias—this is the meaning of heaven’s covering, earth’s bearing, the sun and moon’s illumination, frost and dew’s descent, and the radiance of the Dao’s *qi* pervading all, sentient and insentient. The practice guards against stagnation or leakage—these are all vital formulae. How could they be excised? Learners must fully embody and enact them, without negligence or omission.\n\n**Together uphold the teachings, repaying the Four Graces.**\nAll the above pertains to what inherently resides within our nature. Heaven and earth have me; parents gave me life; rulers and teachers instructed me; the sun and moon illuminate me. This means possessing all that is needed to fulfill my duties—and more. Thus, I dare not take it lightly, recording and presenting these formulae to the utmost, wishing to jointly uphold the teachings and strive to repay the Four Graces.\n\n**Perfect great awakening in the world; primal, prosperous, harmonious, and steadfast.**\nHere, *world* refers to the individual. To perfect others, one must first perfect oneself. The work of self-perfection lies in *awakening*, and its achievements are encompassed by the four virtues: *primal, prosperous, harmonious, and steadfast*.\n\nWhat follows is the incantation—its ritual prohibitions and annotations dare not be profaned.\n\nOm, Jvalan (two syllables combined) Svāhā.\nThis incantation is the *One-Syllable Crown Wheel King Mantra* spoken by the Buddha’s Crown. Scholars who uphold it should recite it thrice while standing with three prostrations; practitioners need only maintain it in their own conduct.\n\nI observe that the entire corpus of these formulae begins with the absence of a single thought. Proceeding thus, the mind becomes clear and the qi harmonized, attaining a state where the whole body is pervaded by harmony—whereby both this life and the world are benefited. The key lies in constancy.\n\nYet even a single moment of clarity and harmony yields a moment of true virtue. Though no effect may be immediately apparent, the effect is inherently present. Scholars must guard against the desire for hasty results, lest they fall into the karmic snares of consciousness. For the human mind is most numinous yet most demonic; once ensnared, perceptions become chaotic, and severance proves interminable—hence the need for vigilance.\n\nScholars should begin by quieting the mind and settling the qi, thereby allowing the true *Primordial Qi* to arise. This *Primordial Qi* emerges naturally when the breath is stilled; if the breath remains unsettled, the true *Primordial Qi* will not manifest. There is no other method—only the absence of a single thought allows the mind to attain stillness, whereupon the breath naturally ceases.\n\nTo mistakenly employ forced cessation is to pursue the opposite path, causing the breath to become labored instead. This must be avoided. The so-called \"absence of a single thought\" does not mean utter vacuity, but rather the exclusion of extraneous thoughts—it is the Dao of perfect sincerity without interruption.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "吕祖师三尼医世说述 龙门第八戒子黄守中题　龙门第九代戒子陶太辑 第十一代闵一得谨疏　第十二代沈阳一恭校 序 文所以载道也，余闻世间是文久矣。 忆自弱冠时，得侍东篱老师于桐柏山。 师秦天人，年已百有十余岁，姓高氏。 浙闽总制高公，盖师同宗也，巡边过山，以三尼医世说师。 师曰：“吾曾见于王阳明先生篑中书之内编，其门人王龙溪刻以传世者，是羲黄以身治世之大道也； 又尝闻诸驻世神仙李泥丸，吾门下沈一炳，曾三遇之，一炳尝以‘三尼’两字，叩于泥丸，泥丸曰：‘此道传自羲黄，仲尼牟尼青尼三大圣人，阐以立教，三家之徒各述其入门之径，集成一编，或曰说述，或曰心传，或曰功诀，或曰功用’。 今散轶矣，”余昔闻于高师者如此。 至乾隆丙午岁，十月二十六日，吾大师太虚翁是日离世，于先两日授书一册，嘱收勿泄。 其时尚达，不务慎守，友人携赴晋宁，久借不归，乃即吕祖三尼医世功诀也。 岁己酉，浙督学朱石君先生按临湖州，进谒于右文馆。 始知先生有是书珍藏，不以示人，颇疑有脱简。 闻金盖藏本完善，以余为诚实可信，嘱往索取，不得而返。 乃示余所藏之本，系明代人手录，有诚意伯跋。 余拟录之，适先生整装将按他郡，匆匆不果。 越四载宦游，过鸡足山，访住世神仙鸡足道者于龙树山房。 仙姓黄名守中，西域月支人，元时进中国，久休鸡足，故有是号。 顺治十六年入京师，求授太上三大戒于昆阳王律师，初无名字，自号野怛婆，华言求道士也。 律师以其身休中国有年，因命以华姓名，曰黄守中，迄今滇人咸以黄真人呼之，年已五百有余岁，而貌若六十许人，又眸炯炯，声若洪钟。 案头无多书，《佛说持世陀罗尼经》外，唯《三尼医世说述》，核即东篱所见，太虚申说者。 乞，勿与，请录之。 笑曰：“毋，子归而求之“诚、访”二美，得自集者，今非其时，姑待之”。 余因问曰：“某昔得有吕祖三尼医世功诀，为某大师太虚翁所授，未及体阅，为友携去，此书如何？ ”曰：“余向亦有之，善册也，他日亦必得者”。 叙问曰：“先生尝行是说乎”。 先生曰：“时哉，时哉！ ”又问曰：“圣如孔子，不以斯道医世，何也？ ”曰：“圣人立人之极，行斯道于万世者也，夫子之道大，不在一时也。 且郏鄂定鼎，卜年七百，春秋之季，其数已终，安知非参赞之神功？ 维持衰运，延续乃命于乎？ ”曰：“夫子若以斯道济世，当时应大治矣”。 曰：“春秋之时，孽海甚深，杀运将启，天故未欲平治天下也，凡暴殄之气足以致虚耗； 淫之气以致水涝，冤抑之气致亢旱； 悖逆之气足以致兵刃。 乖气久布而入不散，则元气隔阂而不通，无位之圣人能培人心固有之善，而不能锄人世已稔之恶。 师道立，则善人多，则可以维持世运。 其自作不靖者，天将聚而歼之，非群布之士所得而治也。 ”曰：“然则斯道，亦有穷乎？ ”曰：“良医攻疾，必去其疾，而后元气可通，子不闻老子之言乎，道大、地大、王亦大”。 王亦大者，薄海内外，百万亿生灵之所归，有旋乾转坤之权也。 道与权合，则兵刑礼乐，革旧俗而新之，权足以去其疾而奠安之也。 有道而无权，岂能于凶人败类而亦安之怀之也哉。",
      "translated_text": "**Preface to *The Venerable Lü’s Exposition on the Three Ni’s Healing of the World***\n\nWriting conveys the Dao, and I have long known of this truth in the world. In my youth, I had the fortune to attend Master Dongli in Mount Tongbai. The Master was a celestial being from Qin, over one hundred and ten years of age, surnamed Gao. The Governor of Zhejiang and Fujian, Lord Gao—of the same clan—passed through the mountain on an inspection tour and presented the *Exposition on the Three Ni’s Healing of the World* to the Master. The Master said: “I once saw this in the inner writings of Master Wang Yangming’s *Kuijian*, compiled and published by his disciple Wang Longxi to transmit to the world. It is the great Dao by which Fuxi and the Yellow Emperor governed the world with their own bodies. I have also heard from the immortal Li Niuwan, who dwells in the world, that my disciple Shen Yibing encountered him three times. Once, Yibing inquired of Niuwan about the two characters ‘Three Ni.’ Niuwan replied: ‘This Dao was transmitted from Fuxi and the Yellow Emperor. The Three Great Sages—Confucius, Śākyamuni, and the Green Ni—expounded it to establish their teachings. The followers of each school recorded their own paths of entry, compiling them into a single work, variously called *Exposition*, *Mind-to-Mind Transmission*, *Methods of Practice*, or *Efficacy of Practice*. Now, however, these texts have scattered and been lost.’” This is what I once heard from Master Gao.\n\nIn the *bingwu* year of the Qianlong reign (1786), on the twenty-sixth day of the tenth month, my great master, the Venerable Taixu, departed this world. Two days prior, he entrusted me with a book, instructing me to keep it and not disclose it. At the time, I was still careless and failed to guard it well. A friend took it to Jinning, and it was long borrowed and never returned—it was none other than *The Venerable Lü’s Methods of Practice for the Three Ni’s Healing of the World*. In the *jiyou* year (1789), when the Zhejiang Education Commissioner, Mr. Zhu Shijun, conducted his inspection in Huzhou, I paid my respects at the Right Literature Hall. Only then did I learn that the Commissioner treasured this book and did not show it to others, though he suspected some passages might be missing. Hearing that a complete version was preserved in the Jingai collection, he deemed me trustworthy and sent me to retrieve it, but I returned empty-handed. He then showed me his own copy, hand-copied by a person of the Ming dynasty, with a postscript by the Earl of Chengyi. I intended to transcribe it, but just then, the Commissioner was preparing to inspect another prefecture, and in haste, the matter was left unfinished.\n\nFour years later, during my official travels, I passed through Mount Jizu and visited the immortal Jizu Daozhe in the Dragon Tree Mountain Lodge. The immortal, surnamed Huang and named Shouzhong, was a Yuezhi from the Western Regions who entered China during the Yuan dynasty. He had long resided on Mount Jizu, hence his name. In the sixteenth year of the Shunzhi reign (1659), he journeyed to the capital and sought the Three Great Precepts of the Most High from Precept Master Wang of Kunyang. Initially, he had no name and called himself *Yedapo*, meaning “seeker of the Dao” in Chinese. The Precept Master, seeing that he had dwelt in China for many years, bestowed upon him the Chinese name Huang Shouzhong. To this day, the people of Yunnan call him the True Man Huang. Though he is over five hundred years old, his appearance is that of a man in his sixties—his eyes bright, his voice resonant as a great bell. Few books lay on his desk: aside from the *Buddha’s Dhāraṇī Sutra for Upholding the World*, there was only *The Venerable Lü’s Exposition on the Three Ni’s Healing of the World*, which matched what Dongli had seen and what Taixu had expounded. I begged to borrow it, but he refused, saying, “No. Return home and seek the two virtues of ‘sincerity’ and ‘inquiry.’ What you gather yourself is not yet the time. Wait a while.” I then asked, “I once received *The Venerable Lü’s Methods of Practice for the Three Ni’s Healing of the World* from my great master, the Venerable Taixu, but before I could study it, a friend took it away. What is this book about?” He replied, “I once had it as well. It is an excellent text. You will obtain it again one day.”\n\nI further asked, “Have you ever practiced this teaching?” The Master said, “The time! The time!” I then asked, “If even a sage like Confucius did not use this Dao to heal the world, why is that?” He replied: “The sage establishes the ultimate standard for humanity and practices this Dao for all ages. The Master’s Dao is vast and not confined to a single era. Moreover, when the Zhou dynasty established its capital at Jiao and E, it was divined to last seven hundred years. By the end of the Spring and Autumn period, that span had reached its end. How could this not be the work of divine assistance, sustaining a declining fate and prolonging its mandate? If the Master had used this Dao to save the world, would it not have brought great order?” I said, “If Confucius had applied this Dao to govern the world, would it not have brought great peace?” The Master replied: “In the Spring and Autumn period, the sea of karmic evil was deep, and the cycle of killing was about to begin. Heaven did not yet wish to pacify the world. The qi of wanton destruction leads to depletion; the qi of excess leads to floods; the qi of grievance and oppression causes severe drought; the qi of rebellion and perversity brings warfare. When these chaotic qi linger and do not disperse, the primordial qi becomes obstructed and fails to flow. A sage without official position can nurture the inherent goodness in human hearts but cannot eradicate the accumulated evil in the world. When the Dao of the teacher is established, good people multiply, and this can sustain the world’s fate. As for those who act with unrest, Heaven will gather and destroy them—this is not something that scholars scattered among the people can manage.”\n\nI then asked, “Does this Dao also have its limits?” The Master said: “A skilled physician treats illness by first removing the disease so that the primordial qi may flow. Have you not heard Laozi’s words? ‘The Dao is great, Earth is great, the King is also great.’ The King is also great because within the seas, all living beings—hundreds of millions—turn to him. He holds the power to revolve heaven and turn the earth. When the Dao and power unite, then weapons, punishments, rites, and music can reform old customs and renew them. Power is sufficient to remove illness and establish peace. But with Dao alone and no power, how can one embrace and pacify the violent and the corrupt?”",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 1238,
      "start_sentence": 0,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.00714731216431,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "世之为病有二：曰人为之病，曰天运之病。 人运之病，戾气所钟，所谓‘自作之孽不可活’，惟有权者能医之。 天运之病，协气可追，所谓‘天作孽犹可为’也，惟有道者能医之。 然而天运亦转移于人事，消戾气于未萌之先，则天运亦应之。 天运通，则元气通，元气通，则大化通，斯道乃大道而不穷也。 在上之群之，则天地成天，于物一无所遗，在下之君之，则立人达人，于物亦大有所济。 以道医世，不因世废道也。 况当升平之世，海宇又安，上有大圣人以为之主，道与权合，版图之内，无有顽民污吏，酿灾厄以梗塞气机。 则此道流通，虽一介之士，亦有位天地育万物之能事，得襄赞于不见不闻之中矣。 若五行百物之生成，偶有编灾小劫，行此道以补之，上合仁主之心，下济生灵之厄，有不如响音斯应者乎！ ”余之受教于黄真人者如此。 至岁癸丑，游洞庭之东山，休于朱氏。 朱为吾山前辈九还翁孙，好玄学。 出示藏本二册，其一为文正中堂珍藏之书，亦属誊本，而无名人手跋。 其一为吾山石奄律师手录于龙峤山房，辑题于隐真黄祖者，文义更为明畅，殆鸡足真人所称详善本也。 因乞携归，其时未闻个中玄理，妄期道成而后行之。 迟至道光五年，蒙吾太虚翁洵呈昔授医世功诀，又沐吕祖临沙，洋洋万言，玄理乃明。 始悔师传功诀，为友携赴晋宁，迄今未归。 幸有鸡足真人，谓必自得。 爰详节录沙示，又采闻见，集而注之。 儒释二家之说，则分引经义以补之，以未读《持世经》故，爰附管窥七则，抄成一册，详述得详书颠末，以祛无征之惑，将以公诸同志。 稿既成，或有见而问曰：“是道，惟存心济世者可行之，若私心用事之，亦可行乎？ ”余悚然起立曰：“是何言欤！ 挟私则背道，必不可行，吕祖尝降坛，诚告曰，‘二气之用，阳为德，阴为刑，动于私，即入于阴。 中正慈祥则为德，邪忒凶暴则为刑，苟非利物济人心之心，而欲以吾气引动乾坤之气，则刑气所召，间不容发，天魔应之，天神弑之，其祸甚速，自取灭亡，历劫不赦，悔不可追，’祖师明训如此。 ”故学道者，正心为第一义，识此，以为玩亵是书者鉴焉。 时道光戊子年孟夏望日嗣龙门正宗第十一代闵一得谨序。 原序 太始之初，道立于一。",
      "translated_text": "The ills of the world are of two kinds: those caused by human action, and those ordained by the turning of Heaven. The ills of human agency arise from the concentration of perverse qi—what is called “the calamity of one’s own making cannot be survived.” Only those who wield power can cure them. The ills of Heaven’s turning may be redressed by harmonious qi—what is called “Heaven’s calamity may yet be remedied.” Only those who embody the Dao can cure them.\n\nYet Heaven’s turning also shifts in response to human affairs. If perverse qi is dispelled before it takes shape, then Heaven’s turning will respond accordingly. When Heaven’s turning flows freely, primordial qi flows freely; when primordial qi flows freely, the great transformation flows freely. Thus the Dao becomes the Great Dao without limit.\n\nWhen those above gather and govern, Heaven and Earth complete their work, leaving nothing in the world unfulfilled. When those below establish and guide others, they bring great benefit to all things. To heal the world with the Dao is not to abandon the Dao because of the world’s flaws.\n\nMoreover, in an age of ascending peace, when the seas and lands are at rest, and a great sage rules from above, the Dao and power unite. Within the realm’s borders, there are no obstinate people or corrupt officials to brew misfortune and obstruct the flow of qi. Then this Dao circulates freely, and even a humble scholar may partake in the work of positioning Heaven and Earth and nurturing the myriad things, contributing unseen and unheard.\n\nAs for the occasional minor calamities in the generation and completion of the Five Phases and the hundred things—if one practices this Dao to remedy them, aligning above with the benevolent ruler’s intent and relieving below the hardships of living beings—will the response not be as swift as an echo answering sound?\n\nSuch were the teachings I received from the Perfected Huang. In the year *guichou*, I traveled to the eastern shore of Lake Dongting and rested at the home of Master Zhu. Zhu was the grandson of my mountain’s elder, the Nine-Returns Master, and was fond of profound learning. He showed me two volumes from his collection: one was a book once treasured by Grand Tutor Wenzheng, also a transcribed copy, though lacking colophons by famous hands. The other was hand-copied by Master Shiyan of Mount Lu in his Dragon Peak Studio, compiled under the title *Hidden Perfection of the Yellow Ancestor*. Its meaning was even clearer, likely the “detailed and excellent edition” praised by the Perfected of Chicken-Foot Mountain.\n\nI begged to borrow and bring them home, though at the time I did not grasp their profound principles and rashly resolved to practice only after mastering the Dao. It was not until the fifth year of Daoguang that I received from my teacher, the Great Void Master, the secret methods for healing the world, and further bathed in the vast and flowing ten thousand words of the written revelation of the Venerable Lü. Only then did the profound principles become clear. I regretted that the transmitted secret methods had been taken by a friend to Jinning and had not yet returned. Fortunately, the Perfected of Chicken-Foot Mountain had said that true attainment must come from within. Thus, I carefully excerpted and recorded the revelations from the sand-writing, and gathered what I had seen and heard, compiling and annotating them. I drew from the teachings of the Confucian and Buddhist traditions, supplementing with scriptural passages. Since I had not yet read the *Sutra of Upholding the World*, I appended seven tentative observations, transcribing them into a single volume. I detailed the origins and transmission of this book to dispel doubts arising from lack of evidence, intending to share it with like-minded seekers.\n\nAfter completing the draft, someone asked: “Is this Dao only practicable for those who aspire to save the world? Could it also be practiced by those acting out of self-interest?” Startled, I rose to my feet and said: “What kind of question is this! Acting with self-interest betrays the Dao—it cannot be practiced. The Venerable Lü once descended to the altar and solemnly warned: ‘In the functioning of the two qi, yang is virtue, yin is punishment. When moved by self-interest, one enters yin. Impartiality and compassion are virtue; perversity and violence are punishment. If one does not hold the heart of benefiting others and saving people, yet seeks to guide the qi of Heaven and Earth with one’s own qi, the qi of punishment will be summoned, leaving no room for escape. Heavenly demons will respond, heavenly spirits will slay, and the disaster will come swiftly—self-inflicted destruction, unforgiven across kalpas, with no chance for regret.’ Such is the clear teaching of the ancestral master.”\n\nTherefore, for those who study the Dao, rectifying the heart is the foremost principle. Let this serve as a mirror for those who would treat this book lightly.\n\nWritten on the full moon of the fourth lunar month in the year *wuzǐ* of the Daoguang era by Min Yide, eleventh-generation successor of the Dragon Gate Orthodox Lineage, with reverence.\n\n**Original Preface**\nIn the beginning of the Great Commencement, the Dao was established in Oneness.",
      "overlap_context": "rd Laozi’s words? ‘The Dao is great, Earth is great, the King is also great.’ The King is also great because within the seas, all living beings—hundreds of millions—turn to him. He holds the power to revolve heaven and turn the earth. When the Dao and power unite, then weapons, punishments, rites, and music can reform old customs and renew them. Power is sufficient to remove illness and establish peace. But with Dao alone and no power, how can one embrace and pacify the violent and the corrupt?”",
      "start_char": 1238,
      "end_char": 2101,
      "start_sentence": 45,
      "end_sentence": 73,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.49241805076599,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "确不可拔，而无所倚； 坚不可破，而无所住。 无贰无间，无内无外，静而无静，动而无动。 刚柔健顺之示判，而为至刚至柔至顺之所由出。 大生之母，大道之原，是曰真一。 真一者，先天之精活泼泼地，其发不可遏。 发则通，通则为阳，其复则为阴，通复是气之始。 阳清则升，阴浊则降，清浊为形之始。 故真一为生天生地之始，体万有而空万有，无极是也。 惟无，故无隔阂，故极灵极明； 惟无，故无挂无碍，故能屈能伸。 人物得其灵明之理而为性，得其屈伸之气而为命。 万物皆在性命之中，性命皆在真一之中。 性命之外无道，性命之外无教，三教同出于一也。 儒尽性以立命； 释见性而度命； 道成性以复命。 儒贯一，释皈一，道得一。 而其功化之极，则皆无远勿届，流行于四大部洲而无所底止。 儒家之道，至于位天地育万物，所过者化，所存者神； 〈谢按：先天一炁运动于“某处”，则某处必被改变、融化。 先天一炁伏于某处不用，则某处必生灵觉之神。 有“某处”否？ 实无某处也！ 真一者，先天一炁也。 故曰“所过者化，所存者神”，斯一言刮尽金丹全部作用。 〉释家之道，至于无住相布施，四维上下虚空福德，不可思量； 道家之道，至于万物作而不辞，生而不恃，为而不有，功成而不居。 其宗旨，皆无为而济世，岂舍己而从事于世哉！ 有生一来，人我同此一性，同此一命，即同此一道。 形隔而气通，气通则性命通，极之天之所覆，地之所载，皆一气呼吸之所通。 道在我，则我为宰。 其始，一物不有； 其终，一物不遗。 而其妙万物也，仍一物不有。 斯道也，何道也？ 真一之道也。 成己成物，皆道中之事。 万物各正性命，而后道之量于是乎全，遗世独立，不可以言道，此医世之说所由来也。 医世之说，其本经全书，自有金简玉函，藏在天府，世不概见。 此书全部，尚有儒释医世说述。 太律师昆阳王祖闻诸异人云：“儒毁于秦，释毁于晋，世不可得而见矣。 ”世所流传者，特道宗医世入手之则。 盖吕祖驻世时，得闻是说，阐述本经之义，授之法嗣，乃本经注疏，不是经文，故其文平近易晓，而于经中玄微功候，尚未述及。 第就道宗医世入手次第叙起焉耳！ 其大要与儒释两门，虽殊途，而同归于一，故此书有三尼之名，且经吕祖升证金仙后，尝亲印证于三尼者。 是三尼在天之灵，宣说参天地，赞化育之大道。 俾有志斯道者，闻而传之，踵而行之，世世可登仁寿之域也。 读是书者，慎毋亵视焉！ 是书，本书世有藏本，不知谁氏携去，蒙吕祖降坛，宣示辞意尤详，爰敬录之，牟数言于首。 时康熙甲辰旦日，嗣龙门正宗第九代陶太定谨叙于金盖之龙峤山房。 下十二卦，阳长则阴消，阴来则阳全，循环十二支中，各应其气，以着阴阳进退之象。 道有变动，爻位互易而成六十四，上下无常，刚柔相易。 六十四卦，不出此十二卦中，推迁以尽其变，随体察易，天下之理得矣。 图如下： 三才一气之图。 医世说述 ＜谢按：需达真胎息之层次，且性功纯厚，方可以行此医世功诀，否则，恐有弊患。 又，行此功法，切戒私心，否则必入魔道，此功亦即无上金丹大道，即本书所载之天仙心传功夫，宜与《天仙心传》一起参看。",
      "translated_text": "Firm yet unattached, unshakable yet ungrasping. Without duality or division, without inside or outside, still yet not still, moving yet not moving. The manifestation of hardness and softness, strength and compliance, from which arises the utmost hardness, utmost softness, and utmost compliance. The Great Mother of all life, the origin of the Great Dao—this is called the True One.\n\nThe True One is the lively, unconstrained essence of precelestial qi, whose arising cannot be restrained. When it arises, it flows; when it flows, it becomes yang; when it returns, it becomes yin. This flow and return are the beginning of qi. Yang, being pure, ascends; yin, being turbid, descends. This purity and turbidity are the beginning of form.\n\nThus, the True One is the origin of the generation of Heaven and Earth, embodying the ten thousand things yet emptying the ten thousand things—this is the Limitless. Only through nothingness is there no obstruction, and thus utmost spirit and utmost clarity. Only through nothingness is there no entanglement or hindrance, and thus the capacity to contract and extend. Humans and all beings receive its principle of spirit and clarity as their nature, and its qi of contraction and extension as their life. The ten thousand things all reside within nature and life, and nature and life reside within the True One. Beyond nature and life, there is no Dao; beyond nature and life, there is no teaching. The Three Teachings all emerge from the One.\n\nConfucianism fulfills nature to establish life; Buddhism perceives nature to liberate life; Daoism completes nature to restore life. Confucianism penetrates the One; Buddhism returns to the One; Daoism attains the One. Yet at the utmost of their transformative efficacy, none is distant or unattainable, flowing throughout the four great continents without cessation.\n\nThe Dao of Confucianism reaches the point of positioning Heaven and Earth and nourishing the ten thousand things, transforming wherever it passes and spiritually abiding wherever it remains.\n*(Xie’s note: When the precelestial One Qi moves within a “certain place,” that place is inevitably transformed and dissolved. When the precelestial One Qi lies dormant in a place without activation, that place inevitably generates spiritual awareness. Is there truly a “certain place”? In reality, there is no such place! The True One is the precelestial One Qi. Thus, it is said, “Wherever it passes, it transforms; wherever it abides, it spiritualizes”—this single phrase exhausts the entire function of the Golden Elixir.)*\n\nThe Dao of Buddhism reaches the point of non-abiding generosity, where the merit of the four directions and the emptiness above and below is inconceivable. The Dao of Daoism reaches the point where the ten thousand things act without refusal, give life without possessiveness, work without claiming, and accomplish without dwelling. Their fundamental aim is non-action in service to the world—how could they abandon the self to engage with the world?\n\nSince the beginning of life, self and others share this one nature, this one life, and thus this one Dao. Though forms are separate, qi communicates; when qi communicates, nature and life communicate. In the extreme, all that Heaven covers and Earth bears is connected through the single breath of qi. If the Dao is within me, then I am its master. In its beginning, it possesses not a single thing; in its end, it omits not a single thing. Yet in its wondrous operation upon the ten thousand things, it still possesses not a single thing.\n\nWhat Dao is this? It is the Dao of the True One. Perfecting oneself and perfecting things are both matters within the Dao. Only when the ten thousand things each rectify their nature and life is the full measure of the Dao realized. To leave the world and stand alone cannot be called the Dao—this is the origin of the teaching of *healing the world*.\n\nThe root canon of this teaching, the *Book of Healing the World*, possesses golden tablets and jade caskets, concealed within the celestial treasury, rarely seen in the world. This present book also contains expositions on the Confucian, Buddhist, and *healing-the-world* teachings. The Great Master Lü’s senior disciple, the Perfected Ancestor Wang Kunyang, heard from extraordinary persons that “the Confucian texts were destroyed in the Qin, the Buddhist texts in the Jin, and they cannot be seen in the world today.” What circulates in the world are merely the initial principles of the Daoist tradition’s *healing-the-world* practice.\n\nWhen Ancestor Lü dwelled in the world, he received this teaching and expounded upon the meaning of the root canon, transmitting it to his dharma heirs. This is a commentary on the root canon, not the canon’s original text. Thus, its language is plain and easily understood, though it does not yet address the profound and subtle stages of practice within the canon. It merely sets forth the sequential steps for entering the Daoist tradition’s *healing-the-world* practice.\n\nIts essentials, though distinct in method from the Confucian and Buddhist paths, converge in returning to the One. Thus, this book bears the name of the *Three Ni*. After Ancestor Lü ascended to the rank of Golden Immortal, he personally verified it with the Three Ni. These Three Ni, as celestial spirits, proclaimed the great Dao of participating in Heaven and Earth and aiding transformation and nourishment, enabling those with aspiration for this Dao to hear, transmit, and follow it, so that generation after generation may ascend to the realm of benevolence and longevity.\n\nReaders of this book must not treat it lightly! Though this book has been preserved in the world, it is unknown who took it away. When Ancestor Lü descended to the altar, he expounded its meaning in even greater detail, which I have respectfully transcribed here, adding a few words at the beginning.\n\nRespectfully recorded on the first day of the year *jiǎchén* of the Kangxi era by Tao Taiding, ninth-generation successor of the Dragon Gate Orthodox Lineage, at the Dragon Peak Mountain Chamber of Golden Canopy.\n\nWithin the twelve hexagrams, when yang grows, yin diminishes; when yin arrives, yang is complete. Cycling through the twelve earthly branches, each corresponds to its qi, manifesting the imagery of yin and yang’s advance and retreat. The Dao undergoes change and movement; lines shift and interchange to form sixty-four hexagrams. Above and below are not constant; hardness and softness alternate. The sixty-four hexagrams do not exceed these twelve hexagrams. By extending and transforming them, one exhausts their changes. Observing the *Yi* through embodiment, the principles of the world are attained.\n\nDiagram: *The Three Powers as One Qi*.\n\n*Exposition on Healing the World*\n*(Xie’s note: Only upon reaching the level of true fetal breathing and possessing pure and profound nature-work can one practice this *healing-the-world* technique; otherwise, harm may arise. Furthermore, when practicing this method, one must utterly abandon selfishness, or one will surely enter demonic paths. This method is none other than the supreme Golden Elixir Great Dao, the *Celestial Immortal’s Heart Transmission* practice recorded in this book. It should be studied together with the *Celestial Immortal’s Heart Transmission*.)*",
      "overlap_context": "ch is the clear teaching of the ancestral master.”\n\nTherefore, for those who study the Dao, rectifying the heart is the foremost principle. Let this serve as a mirror for those who would treat this book lightly.\n\nWritten on the full moon of the fourth lunar month in the year *wuzǐ* of the Daoguang era by Min Yide, eleventh-generation successor of the Dragon Gate Orthodox Lineage, with reverence.\n\n**Original Preface**\nIn the beginning of the Great Commencement, the Dao was established in Oneness.",
      "start_char": 2101,
      "end_char": 3327,
      "start_sentence": 74,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.4371383190155,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "＞ 吕祖师为太上门下关尹子嗣道曾孙，本唐宗室，姓李，名琼，字伯玉。 避武后之祸，偕夫人金氏隐于嵩山深谷，改姓吕，名曰岩，字洞宾。 夫人殃，因号纯阳——钟离祖师弟子。 元世宗敕封警化孚佑帝君。 三尼者，孔子、如来、老子也。 《心印集经》曰：“青尼致中，仲尼时中，牟尼空中。 三尼师师，文尼翼司。 三尼克传，文尼斯赞。 宏敷教育，裨生化之源”。 此元始诰文尼之文。 本经又言：“纯阳真人，化号文尼，职司铎化，故诏以三尼之道，敷锡于世，阴骘下民。 ”——吕祖师之统儒释道以宣教，天所命也，是以宝诰亦称为三教之师。 《医世说》，乃三圣之精蕴，发育万物，峻极于天。 开辟以来，天下之道无有大于此者。 吕祖述之，以开无量劫，怀保惠康之化。 所言入手之则，虽属玄门，实不外始基于定静。 定静乃三家同入之门，惟道宗功法较为简而易晓，故拈以示人。 至于尽性知命而功及于天地，则三尼同道悉该于此焉。 吕祖笔之于书，以授门下，历代祖师宝之，藏于梅岛之龙峤山房——地为黄隐真律师别业，仿址犹存，地离云巢二里许，金盖之东麓也。 是书原序为陶律师石庵着，其标题盖出自隐真律师。 曰“吕祖师三尼医世说述”者，正以明是书尚有三圣本经，吕祖述其意以教人云尔。 第一步说法 大壮",
      "translated_text": "Lü Zu, the Patriarch, was a descendant in the Daoist lineage of Guan Yinzi under the Supreme Lord (Taishang), and a great-great-grandson in the Dao transmission. Originally of the Tang imperial clan, his surname was Li, personal name Qiong, and courtesy name Boyu. To evade the calamity brought by Empress Wu, he and his wife née Jin concealed themselves in the deep valleys of Mount Song, changing their surname to Lü, with the personal name Yan and courtesy name Dongbin. After his wife’s untimely death, he took the sobriquet *Chunyang*—disciple of Patriarch Zhongli. Emperor Shizu of the Yuan dynasty bestowed upon him the honorific titles *Jinghua Fuyou Dijun*.\n\nThe Three Nis refer to Confucius, the Tathāgata, and Laozi. The *Heart Seal Scripture Collection* states:\n*\"The Green Ni embodies the center,\nZhongni (Confucius) harmonizes the mean,\nMuni (the Buddha) abides in emptiness.\nThe Three Nis teach in succession,\nWenni (Laozi) assists in governance.\nThe Three Nis transmit flawlessly,\nWenni alone is praised.\nExpounding and disseminating education,\nthey nurture the wellspring of transformation.\"*\n\nThis is the primordial decree addressed to Wenni.\n\nThe present scripture further declares:\n*\"The Perfected One of Pure Yang, known by the transformation-name Wenni, holds the office of doctrinal transformation. Thus, he was commanded to propagate the Way of the Three Nis and bestow it upon the world, secretly blessing the people below.\"*\n\nLü Zu’s synthesis of Confucianism, Buddhism, and Daoism in his teachings was mandated by Heaven, which is why his precious invocation also designates him as the Teacher of the Three Teachings.\n\nThe *Exposition on Healing the World* embodies the profound essence of the Three Sages, fostering the growth of all things and ascending to the heights of Heaven. Since the dawn of creation, no Way in the world has surpassed this. Lü Zu expounded it to open boundless kalpas and extend the transformative blessings of nurturance, protection, kindness, and well-being. Though its initial principles belong to the Mystery Gate, they ultimately derive from the foundation of quiescence and stillness. Quiescence and stillness are the common entry points for all three traditions, yet the Daoist school’s methods are comparatively simple and easily understood—hence their selection for instruction. As for fully realizing one’s nature, comprehending destiny, and extending one’s merit to Heaven and Earth, the Three Nis share the same Way, all encompassed herein.\n\nLü Zu committed this to writing and transmitted it to his disciples. Treasured by successive patriarchs, it was preserved in the Dragon Ridge Mountain Chamber on Plum Island—a retreat originally established by the Perfected Master Huang Yin. The site remains, located approximately two *li* from Cloud Nest, on the eastern slope of Golden Canopy Peak. The original preface was composed by the Venerable Master Tao Shian, while the title was bestowed by the Perfected Master Yin. The designation *\"Lü Zu’s Exposition on the Three Nis’ Healing of the World\"* clarifies that this text is Lü Zu’s elucidation of the Three Sages’ original scripture, offered to instruct humanity.\n\n**First Step in Expounding the Teaching: *Great Vigour***",
      "overlap_context": "l of true fetal breathing and possessing pure and profound nature-work can one practice this *healing-the-world* technique; otherwise, harm may arise. Furthermore, when practicing this method, one must utterly abandon selfishness, or one will surely enter demonic paths. This method is none other than the supreme Golden Elixir Great Dao, the *Celestial Immortal’s Heart Transmission* practice recorded in this book. It should be studied together with the *Celestial Immortal’s Heart Transmission*.)*",
      "start_char": 3327,
      "end_char": 3850,
      "start_sentence": 133,
      "end_sentence": 156,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.27557373046875,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "[　本易象以明各步功法，非尽以卦气时序言也。 〈谢按：非真有开头，为便起言说法，故以大壮为一步说法，实无始无终。 循环无端。 〉“大壮利贞”：大者，正也，内乾外震。 乾为天、为首，震起也，故功起于此。 “帝出乎震”：帝，太乙也，即真一之宰也。 震巽特变为多白眼：目注脑则向上，故多白，谓当注视乾宫也。 震，阳之动也——意者心之所发，阳气之动也]　〈谢按：乾为体，震为用，由用而见体，天雷震动，由下而上玄关开也。 〉 若曰：法先闭目，意敛目神，向脑一注＜谢按：久视上丹田，神炁合一，行混忘之功＞ [　篑中书同。 “若曰”者，明非本经。",
      "translated_text": "[This exposition employs the imagery of the *Yijing* to elucidate each step of the practice, not merely to expound upon hexagram qi or temporal sequences. (Xie’s note: There is no true beginning—this is merely a pedagogical convenience, taking *Great Vigour* as the first step in expounding the teaching. In truth, there is neither start nor end, but an unbroken cycle.)]\n\n*\"Great Vigour: Auspicious for perseverance\"*: \"Great\" signifies correctness, with inner *qian* and outer *zhen*. *Qian* is Heaven, the head; *zhen* is arousal, thus the practice begins here. *\"The Lord emerges from zhen\"*: The Lord is Taiyi, the true ruler of Unity. *Zhen* and *xun* transform to reveal the \"many white eyes\"—when the gaze is directed toward the brain, it turns upward, hence the whiteness, indicating one should fix attention upon the *qian* palace. *Zhen* is the movement of yang—intention is the issuance of the heart, the stirring of yang qi.]\n\n(Xie’s note: *Qian* is the essence, *zhen* the function; through function, essence is revealed. The thunder of *Tianlei* shakes from below to above, and the Mysterious Pass opens.)\n\nIf one says: First close the eyes, gather the spirit of the eyes, and direct it toward the brain—(Xie’s note: Prolonged focus on the Upper Cinnabar Field unites spirit and qi, engaging the practice of merged oblivion.) [As recorded in *Kuizhong Shu*. The phrase \"If one says\" clarifies this is not part of the original scripture.]",
      "overlap_context": "ang Yin. The site remains, located approximately two *li* from Cloud Nest, on the eastern slope of Golden Canopy Peak. The original preface was composed by the Venerable Master Tao Shian, while the title was bestowed by the Perfected Master Yin. The designation *\"Lü Zu’s Exposition on the Three Nis’ Healing of the World\"* clarifies that this text is Lü Zu’s elucidation of the Three Sages’ original scripture, offered to instruct humanity.\n\n**First Step in Expounding the Teaching: *Great Vigour***",
      "start_char": 3851,
      "end_char": 4116,
      "start_sentence": 157,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.666594982147217,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "盖本经简奥难晓，吕祖述其意，若曰如是如是也。 陶律师本无“若曰”两字，次句有“微以”两字，末句“脑”字下有“际”字，“一注”作“存守”。 吕祖曰：“存者真一，守者真元。 〈谢按：真一不可守，存者乃不用之意，非守也。 人身之真元者，真意真息也，〉真一是性，真元是气。 脑为髓海，又为天性都会府，犹天上之有玉清胜境——其境至清，高居星月之上，乃太无之天。 能知存守，自能明道。 ”] 继于脑中，向顶注之。 ＜谢按：以泥丸为根，以顶门为“连接处”，五官浑同，身心混照浑化，而行身外虚空一着工夫，自然而然，一炁妙用自虚无中来＞ [　篑中书同。 陶本“中”作“际”，下句有“门上”两字，“注之”作“一注”。 吕祖曰：“脑为人身玉清宫，元始所居。 顶曰囟门，穴名百会，乃三元聚会之所，上接三天真一。 向顶注之，真一感通，真元汇注，得见红黄星点若雨洒下为验。 ”〈谢按：即《天仙心传》中所谓“缘引天罡下降”。 〉盖真一无形，所可见者真元。 真元者，真一所生之气也。 (　一得)　按：《礼》曰：“本于太乙，分而为天地，转而为阴阳，变而为四时，列而为鬼神，其降曰命，其官于天也。 ”太乙即真一，天之宰也。 首为人身之天阙，故迎乾必于首。 《易》曰“乾元”，曰“首出庶物”——乾为天为首也。 《虞氏易义》：“乾为性”。 ——天命之性也。 心目“注之”，即《尚书》所谓“顾提天之明命”朱子曰“常目在之也”。 《内典》曰“大佛顶首陀罗尼”——言慧光如日在佛顶也。 又曰“斯是如来无见顶相，无为心佛”，又曰“摩顶令其开悟”——言人之性光皆在顶也。 儒释二家医世功法，以经义参之，与此书宗旨重规叠矩矣。 ]　〈谢按：此一步之目的，乃使我心身清净，而至“圆清”之境，即闵氏所言“事清必迎乾”也。 〉 此为下手第一步 [　篑中书同。 陶本每步此句有“功法”二字。 吕祖曰：“法，法则也； 功，功用也。 ”“法先闭目”者，目为我心使气神。 《法录》“目神在天，即为苟毕二帅”。 其在人身，行则注于两涌泉，坐则注于两腰肾。 闭也者，凝字之义也。 曰“微以”者，有以若无之义。 意为心神之号令，令出乃行，犹人君之有诰敕也。 曰“上注”者，有透顶而上之义。 所以注迎真一之元，以护身世也。 ] 第二步说法",
      "translated_text": "The original scripture is terse and abstruse, difficult to comprehend. Patriarch Lü expounded its meaning, saying: \"It is thus, it is thus.\" Master Tao’s version omits the phrase \"若曰\" (\"if one says\"), includes \"微以\" (\"subtly with\") in the following line, adds the character \"際\" (\"boundary\") after \"脑\" (\"brain\"), and renders \"一注\" (\"a single focus\") as \"存守\" (\"preserve and guard\"). Patriarch Lü stated: \"To *preserve* is the True One; to *guard* is the True Origin.\" (Xie’s note: The True One cannot be guarded. To *preserve* is the intent of non-action, not *guarding*. The True Origin of the human body is true intention and true breath.) The True One is nature; the True Origin is *qi*. The brain is the Sea of Marrow and the capital of celestial nature—like the Jade Clarity’s sublime realm in the heavens, a realm of utmost purity, dwelling above the stars and moon, the Heaven of Great Nothingness. To know *preservation* and *guarding* is to naturally understand the Dao.\n\nProceeding within the brain, direct the focus upward toward the crown. (Xie’s note: Taking the Mud Pill Palace as the root and the crown as the \"juncture,\" the five senses merge as one, body and mind blend in radiant transformation, engaging the work of emptiness beyond the body. Naturally, the wondrous function of *qi* arises from the formless.) [As recorded in *Kuizhong Shu*. Master Tao’s version renders \"中\" (\"within\") as \"際\" (\"boundary\"), adds \"门上\" (\"above the gate\") in the following line, and changes \"注之\" (\"direct the focus\") to \"一注\" (\"a single focus\"). Patriarch Lü said: \"The brain is the Jade Clarity Palace of the human body, the abode of the Primordial Beginning. The crown is the fontanel, the acupoint *Baihui*, the gathering place of the Three Origins, where the True One of the Three Heavens above is received. Directing the focus upward toward the crown, the True One resonates, the True Origin converges, and one perceives red and yellow star-like specks raining down as verification.\" (Xie’s note: This is what *Tianxian Xinzhuang* calls \"guiding the descent of the Celestial Stem.\") For the True One is formless; what can be perceived is the True Origin. The True Origin is the *qi* born of the True One.]\n\n(Yide’s note: The *Book of Rites* states: \"It originates from the Great One, divides into Heaven and Earth, revolves into yin and yang, transforms into the four seasons, and arrays into ghosts and spirits. Its descent is called *ming*; its office is in Heaven.\" The Great One is the True One, the ruler of Heaven. The head is the Heavenly Gate of the human body, hence one must welcome *qian* at the head. The *Book of Changes* says: \"*Qian*’s origin,\" and \"emerging first among the myriad things\"—*qian* is Heaven and the head. *Yu’s Commentary on the Book of Changes* states: \"*Qian* is nature\"—the nature of Heaven’s mandate. The eyes and heart \"directing the focus\" is what the *Book of Documents* calls \"attending to Heaven’s bright mandate,\" which Master Zhu glossed as \"constantly keeping one’s gaze upon it.\" The Buddhist scriptures say: \"The Great Buddha’s Crown *Sūtra* of Dhāraṇī\"—speaking of wisdom’s light like the sun at the Buddha’s crown. They also say: \"This is the Tathāgata’s invisible crown, the formless mind-Buddha,\" and \"rubbing the crown to awaken\"—speaking of the light of human nature residing in the crown. The methods of world-saving practice in Confucianism and Buddhism, when compared with the scriptural principles here, align perfectly in purpose and form.)\n\n(Xie’s note: The aim of this step is to purify one’s body and mind, attaining the state of \"perfect purity,\" which is what Master Min called \"in purity, one must welcome *qian*.\")\n\nThis is the first step in practice. [As recorded in *Kuizhong Shu*. Master Tao’s version adds the words \"功法\" (\"practice method\") after each step. Patriarch Lü said: \"Method is the rule; practice is its function.\" \"First close the eyes\"—the eyes are the emissaries of the heart’s *qi* and spirit. The *Dharma Record* states: \"The eye spirit in Heaven becomes the two marshals, Gou and Bi.\" In the human body, when moving, it focuses on the two *Yongquan* points; when seated, it focuses on the two kidneys. \"Closing\" means concentration. \"Subtly with\" implies having as if not having. Intention is the command of the heart-spirit; when the command issues, it is executed, like an emperor’s edict. \"Directing upward\" implies piercing through the crown to ascend, thereby focusing on and welcoming the origin of the True One to protect the body and the world.]\n\nThe second step expounds the method.",
      "overlap_context": " *Qian* is the essence, *zhen* the function; through function, essence is revealed. The thunder of *Tianlei* shakes from below to above, and the Mysterious Pass opens.)\n\nIf one says: First close the eyes, gather the spirit of the eyes, and direct it toward the brain—(Xie’s note: Prolonged focus on the Upper Cinnabar Field unites spirit and qi, engaging the practice of merged oblivion.) [As recorded in *Kuizhong Shu*. The phrase \"If one says\" clarifies this is not part of the original scripture.]",
      "start_char": 4116,
      "end_char": 5031,
      "start_sentence": 169,
      "end_sentence": 213,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.939029693603516,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "夬 [　内乾外兑。 《逸象》：“乾为神，兑为通，与神通气也。 ——引乾炁下通之义也。 夬，决也，刚决柔也，君子道长，小人道消——小人谓阴。 阙门下通于腹，腹为阴，引乾阳下注，以决阴也。 ]　〈谢按：以丹道而言，乃是凝神入炁穴初步功法。 〉 乃自百会，下游阙盆。 ＜谢按：先天一炁，自虚无中来，寂然不动，感而遂通，通则顺之而引。 ＞ [　篑中书同。 陶本作“继于脑际，向下胸堂。 ”百会，穴名，其穴在顶门。 阙盆，亦穴名，其穴在胸。 吕祖曰：“此不言意，意在其中。 ”，曰“下”者，引一引元并下之义，味下句自可见。",
      "translated_text": "The *Guài* hexagram [☵☷ (inner *qián*, outer *duì*). The *Yi Xiang* states: \"*Qián* is spirit, *duì* is communication—communicating *qi* with spirit.\" This draws on the meaning of guiding the *qián* *qi* downward. *Guài* means \"to decide,\" where the firm decides over the yielding; the Dao of the noble person grows while the Dao of the petty person wanes—the petty person refers to *yin*. The *quē* gate descends to communicate with the abdomen, and the abdomen is *yin*; thus, guiding the *qián* *yang* downward dissolves *yin*.\n\n[**Xie’s note:** In terms of internal alchemy, this is the initial practice method of concentrating spirit into the *qi* cavity.]\n\nIt proceeds from *Bǎihuì*, descending to *Quēpén*.\n[**Xie’s note:** The primordial *qi* emerges from emptiness and stillness; when stirred, it communicates, and once communicated, it is guided in accordance with its flow.]\n\n[The *Kuìzhōng* text reads the same. Tao’s version has: \"Continuing from the brain’s border, descending to the chest’s hall.\" *Bǎihuì* is an acupoint located at the crown. *Quēpén* is also an acupoint, situated in the chest. Patriarch Lü said: \"Though intent is not mentioned here, it is implied within.\" \"Descending\" signifies the act of drawing and guiding the primordial origin downward; the meaning of the following passage will make this clear.]",
      "overlap_context": " human body, when moving, it focuses on the two *Yongquan* points; when seated, it focuses on the two kidneys. \"Closing\" means concentration. \"Subtly with\" implies having as if not having. Intention is the command of the heart-spirit; when the command issues, it is executed, like an emperor’s edict. \"Directing upward\" implies piercing through the crown to ascend, thereby focusing on and welcoming the origin of the True One to protect the body and the world.]\n\nThe second step expounds the method.",
      "start_char": 5032,
      "end_char": 5286,
      "start_sentence": 214,
      "end_sentence": 230,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.167505025863647,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "]　＜谢按：回光返照，采真元归入泥丸，而直入中黄，即丹道中之“放光引致世散元一”之法。 ＞ 乾 [　元亨利贞：元始，亨通，利和，贞正。 元始，谓易生复初，探赜索引，万物资始。 亨通，以阳通阴。 各正性命为利贞。 心以上为阳，腹为阴。 胸乃阳始通阴之界，＜谢按：亦可指绛宫一窍＞，天下之赜将由之而起，不可憧扰。 乾有伏坤，驭动以静，乃为体得闲趣。 体乾之德：刚健中正纯粹精。 ——此七德者，所由觉空色相，一丝不挂也。 ] 游夫阙盆，体得闲趣。",
      "translated_text": "] [**Xie’s note:** The practice of \"turning the light around to reflect inward\" gathers the true primordial origin into *Níwán*, then directly enters the *Zhōnghuáng*—this is the method of \"releasing light to summon the scattered primordial unity\" in the Dao of internal alchemy.]\n\n*Qián*:\n[\"*Yuán* (primordial beginning), *hēng* (free flow), *lì* (beneficial harmony), *zhēn* (upright constancy):\n*Yuánshǐ* (primordial beginning) refers to the *Yì* returning to its initial state, delving into the profound to seek and guide, as all things draw upon this origin.\n*Hēngtōng* (free flow) is the yang penetrating the yin.\nEach aligning its nature and destiny constitutes *lìzhēn* (beneficial constancy).\nThe region above the heart is yang; the abdomen is yin.\nThe chest is the boundary where yang first communicates with yin,\n[**Xie’s note:** This may also refer to the *Jiànggōng* cavity.]\nfrom which the profound mysteries of the world arise—one must not be disturbed by agitation.\n*Qián* conceals *kūn* within, governing movement with stillness, thereby embodying tranquil delight.\nThe virtues of *Qián* are: firmness, strength, centrality, uprightness, purity, essence, and refinement.\n—These seven virtues enable one to awaken to the emptiness of form and phenomena, unattached to even a single thread.]\n\nFrom *Quēpén*, one embodies tranquil delight.",
      "overlap_context": "ated, it is guided in accordance with its flow.]\n\n[The *Kuìzhōng* text reads the same. Tao’s version has: \"Continuing from the brain’s border, descending to the chest’s hall.\" *Bǎihuì* is an acupoint located at the crown. *Quēpén* is also an acupoint, situated in the chest. Patriarch Lü said: \"Though intent is not mentioned here, it is implied within.\" \"Descending\" signifies the act of drawing and guiding the primordial origin downward; the meaning of the following passage will make this clear.]",
      "start_char": 5286,
      "end_char": 5506,
      "start_sentence": 231,
      "end_sentence": 244,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.282268524169922,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "＜谢按：入归神室，此时洗心沐浴，上中二田合而为一，心息和融，玄窍大开。 大休歇一场，湛然而寂，不照而照，太极初现，“天仙心传”称此为“圆清”，浑然无尘。 ＞ [　篑中书同。 陶本作“用守胸堂，一丝不挂。 ”(　一得)　按：《易》曰“清明在躬”，〈谢按：人心已与天心合一也。 〉《心经》曰“五蕴皆空”，盖同是道也。 吕祖曰：“第一戒毋率躁，第二戒毋昏迷，第三戒毋莽荡。 要识此中，＜谢按：从狭义而言，此“中”是为内玄牝，又称中黄神室，从广义而言，乃天地之“心”，造化之玄牝也，其诀在于“无住无执”＞，本无一物，有何人我，有何内外，光明磊落，彻天彻地，物物件件，机动乃现。 现非心体也。 现而勿察，隐而勿追，如浮云之点太空，过而已矣。 所当迎者，清存十分，和迎三五”。 盖此一步，《参同》谓之“上德”。 德以清虚恬淡，一尘不染。 得失有无，不稍粘滞，乃为得法。 ]",
      "translated_text": "<**Xie’s note:** Entering the chamber of spirit-return, at this moment one washes the heart and bathes in purity. The upper and middle *dantian* merge as one; heart and breath harmonize and fuse, the mysterious aperture fully opens. After a great repose, one abides in profound stillness—illuminating without illumination, the Great Ultimate first appears. The \"Heavenly Immortal’s Heart Transmission\" calls this \"Perfect Clarity,\" utterly untainted by dust.>\n\n[As in *Kuìzhōngshū*. Tao’s version reads: \"Abide in the chamber of the breast, not a single thread attached.\" (Yīdé)\n**Note:** The *Book of Changes* states, \"Clarity and brightness reside in the body,\" <**Xie’s note:** The human heart has merged with the celestial heart.> while the *Heart Sutra* declares, \"The five aggregates are all empty\"—both speak of the same Dao.\nLü Zu said: \"First, guard against impatience; second, guard against confusion; third, guard against recklessness. To recognize this *zhōng* <**Xie’s note:** In the narrow sense, this *zhōng* refers to the inner Mysterious Female, also called the Central Yellow Spirit-Chamber; in the broad sense, it is the 'heart' of Heaven and Earth, the Mysterious Female of creation. Its secret lies in 'non-abiding and non-attachment.'> is to know that originally there is not a single thing. Where is self? Where is other? Where is inside or outside? Radiant and unobstructed, penetrating Heaven and Earth, each and every thing—only when the mechanism moves does it appear. Yet appearance is not the essence of the heart. When it appears, do not examine; when it withdraws, do not pursue—like a floating cloud touching the vast sky, it passes and is gone. What one should welcome is: preserve clarity to the utmost, harmoniously receive the Three and Five.\" For this stage, the *Cantong Qi* calls it \"Supreme Virtue.\" Virtue consists of purity, emptiness, tranquility, and blandness, unstained by even a speck of dust. Whether gain or loss, being or non-being, one does not cling in the slightest—only then is the method attained.]",
      "overlap_context": "o refer to the *Jiànggōng* cavity.]\nfrom which the profound mysteries of the world arise—one must not be disturbed by agitation.\n*Qián* conceals *kūn* within, governing movement with stillness, thereby embodying tranquil delight.\nThe virtues of *Qián* are: firmness, strength, centrality, uprightness, purity, essence, and refinement.\n—These seven virtues enable one to awaken to the emptiness of form and phenomena, unattached to even a single thread.]\n\nFrom *Quēpén*, one embodies tranquil delight.",
      "start_char": 5506,
      "end_char": 5877,
      "start_sentence": 245,
      "end_sentence": 260,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.997917652130127,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "此为下手第二步。 [　吕祖曰：“此步中必现有纷纭景象，〈谢按：丹书谓此为活午时。 〉若稍滞稍扰，天君有病，不惟无益，为害非细。 而于下步便无下手处矣，可不戒哉！ ”(　一得)　窃谓：能体游字、闲字，意义自得，行合祖训焉。 ]　〈谢按：虽得乾元降此而制之，但此乃人心之“中”，万物芸芸，人心复杂，故现有纷纭景象，行者易逐幻境。 如此时微杂私意，则恐有弊病。 故需一丝不挂，〉 第三步说法 姤〈谢按； 运返正午，夬通过乾而返为姤，丹道之返还伟功见矣！ 其诀惟在“念中无念”。 〉 [　内巽外乾。",
      "translated_text": "This marks the second step in the initial practice.\n\n[Master Lü states: \"At this stage, myriad and tumultuous visions will inevitably arise. (Xie’s note: Alchemical texts refer to this as the *living noon hour*.) Should one linger even slightly or become disturbed, the Celestial Ruler falls ill—this not only brings no benefit but inflicts no small harm. Moreover, the next step will then offer no foothold for progress. How can one not be vigilant!\" (Yide)\n\nI humbly submit: If one can embody the characters *you* (wandering) and *xian* (leisure), their meaning will naturally be grasped, and one’s practice will align with the ancestral teachings.]\n\n(Xie’s note: Though the Qian trigram’s primordial force descends to govern this stage, this is the \"center\" of the human heart. With the ten thousand things teeming and the human heart intricate, tumultuous visions arise, and practitioners are prone to chasing illusions. If even the slightest trace of self-interest intrudes, harm may ensue. Thus, one must remain utterly unencumbered.)\n\nThe third step speaks of *Gou* (Encounter).\n(Xie’s note: The movement returns to true noon, where *Guai* (Decisiveness) passes through *Qian* (Heaven) and reverts to *Gou*—the great work of reversal in the Dao of alchemy is now manifest! Its secret lies solely in \"thought within non-thought.\")\n\n[Internally *Xun* (Wind), externally *Qian* (Heaven).]",
      "overlap_context": "ppears, do not examine; when it withdraws, do not pursue—like a floating cloud touching the vast sky, it passes and is gone. What one should welcome is: preserve clarity to the utmost, harmoniously receive the Three and Five.\" For this stage, the *Cantong Qi* calls it \"Supreme Virtue.\" Virtue consists of purity, emptiness, tranquility, and blandness, unstained by even a speck of dust. Whether gain or loss, being or non-being, one does not cling in the slightest—only then is the method attained.]",
      "start_char": 5878,
      "end_char": 6128,
      "start_sentence": 261,
      "end_sentence": 274,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.8171775341033936,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "彖曰：“姤，遇也，柔遇刚也。 ”阴为柔。 “刚遇中正，天下大行”，谓以刚克柔。 五中正，故刚遇中正。 阴始生，故宜勒照。 姤与复旁通，复则龙蛇俱蛰，女后则万物发扬——阴阳相伏之理。 象曰：“天地相遇品物咸章”。 故为万路齐开。 “天下有风”，无路不通也] 运值正午，诀惟勤照。 〈谢按：功致此，易入散乱和昏沉，故加意凝照，一线到底，不可间断，所谓念中无念也〉 [　篑中书同。 陶本首句上有“已而”两字，下句作“万路齐开”。 ＜谢按：元神大觉，身世合一，天地万物人民皆在窍中显现＞，言此中元运旺，既庶且富，无物不备，有日中则昃、月盈则阙之惧，故当有勒照作用。 正午，于世为中元，于身中为心，于功候为活午时，乃一阴初生之候，宜勒照也。 ] 遁",
      "translated_text": "The *Tuan* commentary states: \"Gou (Encounter) means encounter—softness encounters hardness.\" Yin is soft. \"When hardness encounters central correctness, the great Way prevails throughout the world,\" meaning hardness overcomes softness. The fifth line is centrally correct, thus hardness encounters central correctness. Yin begins to arise, so it is fitting to restrain and illuminate. *Gou* and *Fu* (Return) are mutually resonant: in *Fu*, both dragon and serpent lie dormant, while in the feminine sovereign, the ten thousand things flourish—such is the principle of yin and yang mutually concealing one another.\n\nThe *Xiang* commentary states: \"Heaven and Earth encounter one another, and the forms of all things become manifest.\" Thus, all paths open simultaneously. \"Beneath Heaven there is wind\"—no path remains obstructed.\n\nAt this stage, when the movement reaches true noon, the key lies solely in diligent illumination.\n(Xie’s note: At this point in the work, one is prone to scattering or torpor, so one must intensify focused awareness, maintaining an unbroken thread—this is what is meant by \"thought within non-thought.\")\n\n[Kuizhong’s text concurs. The Tao edition adds the words \"thereupon\" at the beginning, and renders the following line as \"all paths open simultaneously.\"\n(Xie’s note: When the primordial spirit is fully awakened, body and world unite, and Heaven, Earth, the ten thousand things, and all people appear within the aperture. This speaks of the flourishing of the central movement of the primordial force—abundant and rich, nothing is lacking. Yet one must remain wary of the sun’s descent after noon and the moon’s waning after fullness, hence the need for restraining illumination. True noon corresponds in the world to the central primordial force, in the body to the heart, and in the stages of practice to the living noon hour—a time when the first trace of yin arises, thus requiring restraint and illumination.)]\n\n*Dun* (Retreat) follows.",
      "overlap_context": " are prone to chasing illusions. If even the slightest trace of self-interest intrudes, harm may ensue. Thus, one must remain utterly unencumbered.)\n\nThe third step speaks of *Gou* (Encounter).\n(Xie’s note: The movement returns to true noon, where *Guai* (Decisiveness) passes through *Qian* (Heaven) and reverts to *Gou*—the great work of reversal in the Dao of alchemy is now manifest! Its secret lies solely in \"thought within non-thought.\")\n\n[Internally *Xun* (Wind), externally *Qian* (Heaven).]",
      "start_char": 6128,
      "end_char": 6446,
      "start_sentence": 275,
      "end_sentence": 291,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.72628927230835,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "[　内艮外乾。 象曰：“天下有山，遁。 君子以远小人，不恶而严。 ”君子谓乾，乾为远为严。 未于首，其位已远，远而严，正本清源之道。 刚当位而阴渐长，故有偏颇之象。 ] 已值未正，正本清源。 ＜谢按：从姤卦至剥卦所显现者，乃是从“现在”至“未来”之世运景象，一时之内，现于玄窍之中，功修浅者，只可显现一年至几年之世运，功修深者，十年百年千年现于一刻之中。 功修浅者，其炁涵括一乡一县。 深者，远及一省一国乃至天下。 至坤则万物芸芸皆归入静，此段诀无他，惟在元神不失，缩身心人世于中黄祖窍，虚无而混沌之，医世即从此段工夫开始，以正意维持，不使寒衰之景太过也＞ [　篑中书同。 陶本“已”作“若”，下句作“便有偏颇”，盖民忘善之所致也。 世泰已久，则民惟逸是安。 逸是安，则忘善，忘善则恶机已伏，自然之势也。 宜体“正本清源”句入，乃有下手处。 鄙意：诀则迎一以化之，不惟迎坤元而已。 ] 否",
      "translated_text": "[Inner *Gen* (Mountain), outer *Qian* (Heaven). The Image states: \"Heaven beneath has a mountain—*Dun* (Retreat). The noble one distances petty persons, not through aversion but through solemnity.\" The noble one refers to *Qian*; *Qian* is distant and solemn. At *wei* (the eighth Earthly Branch), its position is already remote—remote yet solemn, this is the Way of rectifying the root and purifying the source. With yang rightfully positioned while yin gradually grows, the image of imbalance arises.]\n\nAt *wei*’s zenith, rectify the root and purify the source.\n<Xie’s note: From the *Gou* hexagram to the *Bo* hexagram, what manifests is the world’s karmic landscape from \"the present\" to \"the future.\" In a single moment, it appears within the mysterious aperture. Those of shallow cultivation may perceive only one to several years of worldly fate; those of deep cultivation see ten, a hundred, or a thousand years in an instant. The shallow practitioner’s *qi* encompasses a village or county; the profound, a province, a nation, or even the world entire. By the time of *Kun*, the ten thousand things return to stillness in profusion. This secret holds no other principle—only that the primordial spirit must not be lost. One contracts body and mind into the Central Yellow Ancestral Aperture, merging them into emptiness and chaos. The work of healing the world begins here: with rectified intention, one prevents the scene of cold decline from becoming excessive.>\n\n[Kuizhong’s text is identical. Tao’s edition reads \"若\" (*ruo*, \"if\") for \"已\" (*yi*, \"already\"), and \"便有偏颇\" (\"then imbalance arises\"), for this is where the people forget goodness. When the world has long been at peace, people grow complacent in ease. Complacent in ease, they forget goodness; forgetting goodness, the seeds of evil lie hidden—this is the natural course. One must embody the phrase \"rectify the root and purify the source\" to find a place to begin. My humble opinion: the secret lies in welcoming the One to transform it, not merely in welcoming *Kun*’s primordial force.]\n\n*Pi* (Obstruction) follows.",
      "overlap_context": "flourishing of the central movement of the primordial force—abundant and rich, nothing is lacking. Yet one must remain wary of the sun’s descent after noon and the moon’s waning after fullness, hence the need for restraining illumination. True noon corresponds in the world to the central primordial force, in the body to the heart, and in the stages of practice to the living noon hour—a time when the first trace of yin arises, thus requiring restraint and illumination.)]\n\n*Dun* (Retreat) follows.",
      "start_char": 6447,
      "end_char": 6839,
      "start_sentence": 292,
      "end_sentence": 311,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.806166172027588,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "[　内坤外乾。 彖曰：“天地不交而万物不通。 内小人而外君子。 ”故外强中干。 “大往小来”，故当植培，此天地闭塞之候。 ] 一入申正，植培而已。 [　篑中书同。 陶本“申正”下作“外强中干，须事植培。 ”意义与此书同。 盖值申正，运当下元之初，其时人民，燕安成性，罔知奋勉，无有远虑，风气浮华，举止文胜，故曰“外强”。 惟民生厚，其气已离，百产亦渐耗竭，故曰“中干”。 一旦劫临，挺而走险，适以速毙，诚可哀也〈谢按：一念之间，天堂地狱〉。 志斯道者，诀惟植培为事，所以思患预防也。 ] 观",
      "translated_text": "[Within, *Kun*; without, *Qian*. The *Tuan* says: \"Heaven and Earth do not interact, and the myriad things do not communicate. Within are petty men; without, noble gentlemen.\" Thus, strength without belies hollowness within. \"Greatness departs, smallness arrives\"—this is the time for cultivation and nourishment, for it is the sign of Heaven and Earth’s closure and obstruction.]\n\nOnce entering *shen-zheng*, only cultivation and nourishment remain.\n\n[Kuizhong’s text is identical. Tao’s edition reads below *shen-zheng*: \"Strength without, hollowness within—one must engage in cultivation and nourishment.\" The meaning aligns with this text. For when *shen-zheng* arrives, the cycle stands at the beginning of the lower epoch. At this time, the people, long settled in ease, have made indolence their nature. They know no striving, harbor no foresight, and the prevailing *qi* is frivolous and extravagant, their conduct dominated by ornament. Thus it is called \"strength without.\" Yet the people’s lives are abundant, their *qi* already dispersed, and the hundred products gradually exhausted—thus it is called \"hollowness within.\" Should calamity suddenly strike, they will risk all in desperation, only hastening their ruin. Truly, it is lamentable. (Xie’s note: In a single thought, heaven or hell.) Those who aspire to this Dao must take cultivation and nourishment as their sole task, thereby anticipating peril and preventing it.]\n\n*Guan* follows.",
      "overlap_context": "alance arises\"), for this is where the people forget goodness. When the world has long been at peace, people grow complacent in ease. Complacent in ease, they forget goodness; forgetting goodness, the seeds of evil lie hidden—this is the natural course. One must embody the phrase \"rectify the root and purify the source\" to find a place to begin. My humble opinion: the secret lies in welcoming the One to transform it, not merely in welcoming *Kun*’s primordial force.]\n\n*Pi* (Obstruction) follows.",
      "start_char": 6840,
      "end_char": 7087,
      "start_sentence": 312,
      "end_sentence": 327,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.408042430877686,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "[　内坤外巽。 象曰：“风行地上，观。 先王以省方观民设教。 ”观主化民，故当致新。 五位未变，为“大观在上”。 近乾爻，故迎乾。 陶本曰“成贤劫”者，酉时卦中有蹇有明夷，值运之艰也。 ] 若值酉正，诀惟致新。 ＜谢按：只灭识心，不灭照心，以顶门乾元之光合心目神光下照，此乃加行功诀。 其法见第一步。 总之一个“中和”，如本就“中和”，则不必头上安头＞ [　篑中书同，陶本“酉正”下作“诀惟迎乾，以成贤劫。 ”义与此书相表里。 酉正者，下元之中运也，旧染污俗，迎乾气以廓清之，使民自新也。 顽谗犹欲并生，使民自新，则劫运之来，化大成小，所谓贤劫是也。 较诸兵火相乘，不已相去多多乎！ 吕祖盖有深意存焉。 贤劫者何？ 饥馑疫疠昏垫是也。 ] 剥",
      "translated_text": "[Inner Kun, outer Xun. The Image states: “Wind moves over the earth—*Guan*. The former kings thereby inspected the regions, observed the people, and established teachings.” *Guan* governs the transformation of the people, and thus must bring forth renewal. With the five positions unchanged, it is called “Great *Guan* above.” Near to the Qian line, it thus welcomes Qian. The Tao edition reads “accomplishing the worthy kalpa,” for within the hexagram of the You hour lie *Jian* and *Mingyi*, marking the hardship of the epoch.]\n\nShould one encounter You-zheng, the secret lies solely in bringing forth renewal. (Xie’s note: Only extinguish the mind of discrimination, not the mind of illumination—let the light of Qian’s primordial origin at the crown merge with the radiance of the eyes and heart, shining downward. This is the method of supplementary practice, detailed in the first step. In sum, it is a matter of “harmony at the center.” If one is already “harmony at the center,” there is no need to add a head upon a head.)\n\n[The *Kuizhong* text concurs; the Tao edition reads beneath “You-zheng”: “the secret lies in welcoming Qian to accomplish the worthy kalpa.” This aligns with the present text. You-zheng marks the middle phase of the lower epoch, where old stains and corrupt customs prevail. One welcomes the *qi* of Qian to sweep them clean, enabling the people to renew themselves. Yet the obstinate and slanderous still seek to arise together—if the people renew themselves, the coming kalpa’s disasters will be transformed from great to small, which is what is meant by the “worthy kalpa.” How vastly different from the devastation of war and fire! Lü Zu surely harbored profound intent here. What is the worthy kalpa? It is famine, pestilence, epidemics, and deluges.]\n\n*Bo* follows.",
      "overlap_context": " called \"strength without.\" Yet the people’s lives are abundant, their *qi* already dispersed, and the hundred products gradually exhausted—thus it is called \"hollowness within.\" Should calamity suddenly strike, they will risk all in desperation, only hastening their ruin. Truly, it is lamentable. (Xie’s note: In a single thought, heaven or hell.) Those who aspire to this Dao must take cultivation and nourishment as their sole task, thereby anticipating peril and preventing it.]\n\n*Guan* follows.",
      "start_char": 7088,
      "end_char": 7405,
      "start_sentence": 328,
      "end_sentence": 349,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.601287126541138,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "[　内坤外艮。 此戍卦也。 乾凿度曰：“夫阴，伤害为行当九月之候，阳气衰消而阴终不能尽阳，〈谢按：关键在此“不能尽阳”一句，所以而后能由剥通过坤，而运还复卦正子，丹道之还返伟功又见矣！ 〉小人不能决君子也。 ”谓之剥，言不安而已。 彖曰：不利有攸往，小人长也。 ”] 坤 [　六爻皆阴。 此亥卦也。 卦德为柔顺利贞，卦气为灭藏于癸，极晦之象，阳尽灭也。 故有“履霜坚冰至”之占。 戍亥为剥为坤，此曰“法惟屯蒙，以俟复”者。 舍值时之卦，而言“因时之用”，谓此时惟当息养。 盖戍亥于身为下极，于世为下元下运，言内言外，皆当息养也。 ]　＜谢按：诀为神息相依，神炁合一，神归坤腹，大休息一场，但非昏沉，非阳沉入阴，非阳埋入阴，乃混沌之象，于丹道而言，此时切忌昏沉。 ＞ 运至戍亥，法惟屯蒙以俟复。",
      "translated_text": "[Within *Kun*, without *Gen*—this is the hexagram *Shu* (Decay). The *Qian Zao Du* states: “The Yin, in its injurious course, corresponds to the ninth month’s season, when yang *qi* wanes and recedes, yet Yin ultimately cannot exhaust Yang.” (Xie’s note: The crux lies in the phrase “cannot exhaust Yang,” for it is through this that *Bo* (Decay) passes through *Kun* (Earth) to return to the hexagram *Fu* (Return) at the correct *zi* hour—thus the great work of reversal in the Dao of the Elixir is once more revealed!) “The petty man cannot overpower the noble man.” It is called *Bo* (Decay), meaning only that stability is lost.\n\nThe *Tuan* says: “Unfavorable to proceed; the petty man waxes.”]\n\n*Kun*\n[All six lines are Yin—this is the hexagram of *Hai*. Its virtue is yielding compliance and steadfast integrity; its *qi* is extinguished in *gui*, the image of utter darkness, where Yang is wholly consumed. Hence the oracle: “Tread on frost, and solid ice will come.”\n\n*Shu* and *Hai* form *Bo* and *Kun*, yet here it is said: “The method lies in *Zhun* (Difficulty) and *Meng* (Ignorance), awaiting *Fu* (Return).” Setting aside the hexagram of the present time, it speaks instead of “acting in accord with the moment’s use,” meaning that at this time, one must only rest and nurture. For *Shu* and *Hai* correspond to the lower extremity of the body and the lower epoch of the lower cycle—whether within or without, all must rest and nurture.]\n\n(Xie’s note: The secret lies in spirit and breath interdependent, spirit and *qi* united, spirit returning to the belly of *Kun*—a great rest, yet not torpor, not Yang sinking into Yin, not Yang buried in Yin, but the image of primordial chaos. In the Dao of the Elixir, torpor must be strictly avoided at this stage.)\n\nWhen the cycle reaches *Shu* and *Hai*, the method lies solely in *Zhun* and *Meng*, awaiting *Fu*.",
      "overlap_context": "il. One welcomes the *qi* of Qian to sweep them clean, enabling the people to renew themselves. Yet the obstinate and slanderous still seek to arise together—if the people renew themselves, the coming kalpa’s disasters will be transformed from great to small, which is what is meant by the “worthy kalpa.” How vastly different from the devastation of war and fire! Lü Zu surely harbored profound intent here. What is the worthy kalpa? It is famine, pestilence, epidemics, and deluges.]\n\n*Bo* follows.",
      "start_char": 7406,
      "end_char": 7750,
      "start_sentence": 350,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.598518133163452,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "[　篑中书同。 陶本下句作“屯蒙而已。 ”意义与是书无异。 屯蒙者，万物冥昧之象，养之以俟其复而已。 屯，内震外坎，动而遇险，劫运多艰，故屯利居贞。 蒙，内坎外艮，坎智艮止，性灵窒塞，机窍未开，故蒙以养正。 大元运之戍亥，万物皆息，小元运之戍亥，亦贵息养元气。 吕祖曰：“究其致此之由，总因失照失培之故。 ”言小元运之可挽于前也。 (　一得)　按：《易》曰“凡益之道，与时偕行”，《书》曰“道有升降，政由俗革”，此儒教之视否泰元运而医世也。 《华严经》曰“清净光明，遍照世间，以无碍愿，住一切劫，常勤利益一切众生”，《楞严经》曰“于恒沙劫中，救世悉安宁”，此释教之历元量无运而医世也。 ] 此为下手第三步",
      "translated_text": "[The *Kuizhong* manuscript agrees. The *Tao* edition renders the latter phrase as “merely *Zhun* and *Meng*.” Its meaning differs not from this text. *Zhun* and *Meng* are the images of all things in dark obscurity, to be nurtured only in anticipation of their return. *Zhun* is inner *Zhen* (Thunder) and outer *Kan* (Water): movement encountering peril, its karmic course beset by hardship—thus *Zhun* benefits from steadfast integrity. *Meng* is inner *Kan* and outer *Gen* (Mountain): *Kan*’s wisdom and *Gen*’s stillness, the numinous nature obstructed, its mechanisms and apertures unopened—thus *Meng* nurtures correctness. In the great epoch’s *Shu* and *Hai*, all things rest; in the lesser epoch’s *Shu* and *Hai*, nurturing the primordial *qi* is likewise precious. Ancestor Lü said: “Tracing the cause of this condition, it arises entirely from loss of illumination and loss of cultivation.” This speaks to the lesser epoch’s potential for redress in advance.\n\n(Yide’s note: The *Book of Changes* states, “The Way of all increase moves in accord with the time”; the *Book of Documents* says, “The Dao has ascent and descent, governance transforms with custom”—this is Confucianism’s view of adversity and prosperity in the cosmic epochs as a means to heal the world. The *Avataṃsaka Sūtra* declares, “Pure and luminous, it illumines the world; with unimpeded vows, it abides through all kalpas, ever diligently benefiting all beings”; the *Śūraṅgama Sūtra* says, “Through kalpas as numerous as the Ganges’ sands, it saves the world and brings all to peace”—this is Buddhism’s traversal of epochs without measure as a means to heal the world.)]\n\nThis is the third step in the initial practice.",
      "overlap_context": "epoch of the lower cycle—whether within or without, all must rest and nurture.]\n\n(Xie’s note: The secret lies in spirit and breath interdependent, spirit and *qi* united, spirit returning to the belly of *Kun*—a great rest, yet not torpor, not Yang sinking into Yin, not Yang buried in Yin, but the image of primordial chaos. In the Dao of the Elixir, torpor must be strictly avoided at this stage.)\n\nWhen the cycle reaches *Shu* and *Hai*, the method lies solely in *Zhun* and *Meng*, awaiting *Fu*.",
      "start_char": 7752,
      "end_char": 8050,
      "start_sentence": 368,
      "end_sentence": 380,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.69784951210022,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "[　篑中书此句上有“吕祖曰究其致此之由，总因失照失培之故”十七字。 按前后文均无吕祖曰字样，当是后人以此书质诸吕祖，录者误入正文耳！ 今采入前注。 窃按是书，二步以上自顶至胸，言身不言世。 三步中分言六时者，功用至午位则为心，乃一身之宰，一世之宰； 至未以下则为腹，为阎浮提。 世事不同，补救之法亦不同，故逐时分析言之，以明随运之用。 此六时之用，皆学问之事，谓当裕道法于未用之时，午未申酉戌亥，皆迎一迎乾之所贯注，乾，君也。 盖有随时医世之学术，而后可以任斯世之重； 能调元赞化，而后可以上格君心。",
      "translated_text": "[Note: The preceding text originally included the line *\"Lüzu states: ‘In examining the cause of this, it is entirely due to the loss of illumination and cultivation.’\"* (seventeen characters). As no other passages in the preceding or following text are attributed to Lüzu, this was likely added later when the book was presented to Lüzu, and the copyist mistakenly incorporated it into the main text. It has now been moved to the preceding annotation.]\n\nPrivately considering this work: the first two steps, from the crown to the chest, speak of the body without reference to the world. In the third step, the division into six periods reflects that when the practice reaches the *wu* (Noon) position, it pertains to the heart—ruler of the body and ruler of the world. From *wei* (1–3 PM) onward, it pertains to the abdomen and to Jambudvīpa. As worldly affairs differ, so too do the methods of redress; thus, each period is analyzed separately to clarify the application suited to the epoch. The function of these six periods concerns the work of learning and inquiry: one must enrich the Dao and its methods in times of non-application. From *wu*, *wei*, *shen*, *you*, *xu*, to *hai* (Noon to Midnight), each welcomes and aligns with the infusion of *Qian* (Heaven). *Qian* is the sovereign. Only after mastering the learning of redressing the world in accord with the time can one bear the weight of this world; only after harmonizing the primordial and aiding transformation can one ascend to rectify the sovereign’s heart.",
      "overlap_context": "dversity and prosperity in the cosmic epochs as a means to heal the world. The *Avataṃsaka Sūtra* declares, “Pure and luminous, it illumines the world; with unimpeded vows, it abides through all kalpas, ever diligently benefiting all beings”; the *Śūraṅgama Sūtra* says, “Through kalpas as numerous as the Ganges’ sands, it saves the world and brings all to peace”—this is Buddhism’s traversal of epochs without measure as a means to heal the world.)]\n\nThis is the third step in the initial practice.",
      "start_char": 8051,
      "end_char": 8294,
      "start_sentence": 381,
      "end_sentence": 390,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.59966254234314,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "欲从事于泽民，必先以致君为主也。 〈谢按：此指性功何等之重要！ 〉 第四步说法 复 [　内震外坤。 震，修省致福，坤，德合无疆，彖曰：“复亨，刚反动而以顺行，利有攸往，刚长也。 ”阳来返初，而应天行，阴顺之，明良之际会也。 ] 已而华开见佛，自造庆会，於（音乌）万斯年，此为下手第四步。 〈谢按：真阳初生，乾坤妙合，三田合一，一炁自虚无中来，太极全体乃现。 〉 [　篑中书同，陶本“已而”作“既乃”，下有“别有妙用，不外忠贞”二句，“自造庆会”下有“得致”两字。 华，心华佛，喻君也。 开者，开心见诚之义，中无意必固我，随机导引，格非启沃，大有红炉点雪之神。 “不外忠贞”者，言忠贞则咸有一德，上下交孚，不待语言文字，故曰“自造”——诚之通也。 忠则表里如一，贞则夙夜匪懈，是以能充满其肃肃雍雍之气。 而君臣皆在一气之中，为上为德也； 天下亦皆在一气之中，为下为民也，海隅苍生阴受其福而不知矣。 吕祖曰：“惟知迎一与元者能之。 ”(　一得)　按：《书》曰“燮理阴阳，寅亮天地”，《楞严经》曰“于大菩提，善得通达，觉通如来，尽佛境界”，《持世陀罗尼经》曰“利益安乐，一切有情”，同此功用也。 ] 第五步说法",
      "translated_text": "To engage in the work of benefiting the people, one must first take the enlightenment of the ruler as the primary task.\n\n**[Fourth Step of Exposition]**\n*Return* [☳ *Zhen* within, ☷ *Kun* without. *Zhen* is cultivation, introspection, and the attainment of fortune; *Kun* is virtue harmonizing without bound. The *Tuan* states: “*Fu* (Return) is smooth; the firm returns in movement and proceeds with compliance. Beneficial to have somewhere to go—this is the growth of the firm.” The yang returns to its origin and accords with the celestial movement; the yin complies with it, revealing the convergence of clarity and goodness.]\nThereupon, the flower blooms to reveal the Buddha—self-created auspicious convergence. For ten thousand years, this is the fourth step of commencement.\n\n**[Textual Variants and Annotations]**\nIn the *Kuizhong* manuscript, the *Tao* edition reads “既乃” (*thereupon*) instead of “已而” (*thereafter*), with two additional lines: “别有妙用，不外忠贞” (*There is a wondrous function, none other than loyalty and steadfastness*). Below “自造庆会” (*self-created auspicious convergence*), it includes “得致” (*attains*).\n*Flower* refers to the flower of the heart-Buddha, a metaphor for the ruler. *Blooming* signifies the opening of the heart to reveal sincerity—within, there is no rigid self or obstinate intent; one follows the moment to guide and enlighten, rectifying what is amiss through awakening, as if a red furnace melting snow with divine efficacy.\n“None other than loyalty and steadfastness” means that loyalty and steadfastness unify all in one virtue, fostering mutual trust between above and below without need for words or texts—hence “self-created,” the penetration of sincerity. Loyalty ensures inner and outer consistency; steadfastness ensures diligence day and night. Thus, one can fill the air with solemn harmony. Ruler and minister alike exist within this single *qi*; the former embodies virtue, the latter the people. The four seas and all living beings unknowingly receive its blessings.\nAs Ancestor Lü said: “Only those who know how to welcome the One and the primordial can achieve this.”\n**[Citations]**\nThe *Book of Documents* states: “Harmonizing yin and yang, reverently illuminating Heaven and Earth.”\nThe *Śūraṅgama Sūtra* states: “In great bodhi, one attains thorough penetration, awakening to the Tathāgata and exhausting the Buddha’s realm.”\nThe *Dhāraṇī of Upholding the World* states: “Benefiting and bringing peace to all sentient beings.”\nAll share this same function.\n\n**[Fifth Step of Exposition]**",
      "overlap_context": "oncerns the work of learning and inquiry: one must enrich the Dao and its methods in times of non-application. From *wu*, *wei*, *shen*, *you*, *xu*, to *hai* (Noon to Midnight), each welcomes and aligns with the infusion of *Qian* (Heaven). *Qian* is the sovereign. Only after mastering the learning of redressing the world in accord with the time can one bear the weight of this world; only after harmonizing the primordial and aiding transformation can one ascend to rectify the sovereign’s heart.",
      "start_char": 8294,
      "end_char": 8801,
      "start_sentence": 391,
      "end_sentence": 413,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.06177830696106,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "临 [　内兑外坤。 兑悦坤顺，故无间。 元亨利贞。 彖曰：“悦而顺，刚中而应。 ”——“悦而顺”，混一之原； “刚中而应”，妙凝之德、大亨以正也。 ] 于斯时也，功造无间，一举一措，不谋自合，盖已两气混一，志神不二，是妙凝之神验。 此为下手第五步＜谢按：浮游规中，胎息养真，乾坤混一＞。 [　篑中书、陶本同，文正藏本有小异。 吕祖曰：“行到此步，益宜人我两忘，任此乾坤正气氲如氤如，有弥天盖地气象，乃得此验。 偶或现有戾机，必当迎人元以通之，倍迎乾元以新之，坤元以和之，寂体真一以一之，自然君圣臣良，上下一气，功行不怠。 造致雍熙，计日可待。 ”(　一得)　按：《书》曰“咸有一德”，《金刚经》曰“以福德无，故如来说福德多”，皆是道也。 ]　＜谢按：就人身而言，人元者，心肾二炁和合之胎息真阳也。 乾元者，百会神火也，坤元者，涌泉海底元炁坤火也。 三者混一，入归混沌，寂而体之，主宰此三者之“真”方“现”，故曰真一＞ 第六步说法 泰 [　内乾外坤。 彖曰：“天地交而万物通也，上下交而其志同也。 ”象曰：“后以财成天地之道，辅相天地之宜，以左右民。 ”以阴辅阳，坤承乾命，庶绩咸熙，四海升平之象也。 ] 功到此际，朝宁雍熙，百工亮采，而民隐君悉。",
      "translated_text": "At this stage [☱☶ (Inner Duì, Outer Kūn). Duì represents joy, Kūn compliance—thus, no disjunction. *Yuan heng li zhen*. The *Tuan* states: “Joyful and compliant, firm in the center and responsive.”—“Joyful and compliant” is the origin of primordial unity; “firm in the center and responsive” is the wondrously congealed virtue, great penetration through correctness.]\n\nAt this moment, merit attains seamless continuity; every action and measure aligns without deliberation, for the two *qi* have merged as one, will and spirit undivided—this is the divine verification of wondrous congealment. This is the fifth step in practice. **[Xie’s note: Floating within the compass of regulation, fetal breathing nurtures the true, Qian and Kun merge as one.]**\n\n**[Collation Notes]**\nThe *Kuizhong* manuscript and Tao edition are identical; the *Wenzheng Zang* edition contains minor variations.\nAncestor Lü said: “At this step, one must increasingly forget self and other, allowing the upright *qi* of Qian and Kun to billow like mist, vast as heaven and earth—only then does this verification arise. Should discordant tendencies occasionally appear, one must welcome the human *yuan* to harmonize them, double the welcome to Qian *yuan* to renew them, and Kūn *yuan* to soften them. With quiescent embodiment of the true One, all unifies naturally: the ruler becomes sagely, ministers virtuous, above and below share a single *qi*, and merit never slackens. The attainment of grand harmony is but days away.” **[Yide’s note]**\nAs the *Book of Documents* states: “All share a single virtue.”\nThe *Vajracchedikā Sūtra* states: “Because it lacks merit and virtue, the Tathāgata speaks of abundant merit and virtue.”\nAll are of this same Dao. **[Xie’s note: In the human body, the human *yuan* is the true yang of fetal breathing, the harmonized *qi* of heart and kidney. Qian *yuan* is the divine fire at Baihui; Kūn *yuan* is the primordial *qi* of the sea bottom at Yongquan, the fire of Kun. When these three merge as one, returning to primordial chaos, and one embodies them in quiescence, the “true” that governs these three “appears”—hence, the true One.]**\n\n**[Sixth Step of Exposition]**\n**Peace [☰☶ (Inner Qian, Outer Kūn).**\nThe *Tuan* states: “Heaven and Earth unite, and the myriad things communicate; above and below unite, and their wills align.”\nThe *Xiang* states: “The lord thereby completes the Dao of Heaven and Earth, assists the proper timing of Heaven and Earth, and thereby guides the people.”\nYin assists yang, Kun receives Qian’s mandate—this is the image of all undertakings flourishing, the four seas at peace.]\n\nAt this stage of merit, the court radiates harmony, all officials display brilliance, and the people’s concerns are fully known to the ruler.",
      "overlap_context": "those who know how to welcome the One and the primordial can achieve this.”\n**[Citations]**\nThe *Book of Documents* states: “Harmonizing yin and yang, reverently illuminating Heaven and Earth.”\nThe *Śūraṅgama Sūtra* states: “In great bodhi, one attains thorough penetration, awakening to the Tathāgata and exhausting the Buddha’s realm.”\nThe *Dhāraṇī of Upholding the World* states: “Benefiting and bringing peace to all sentient beings.”\nAll share this same function.\n\n**[Fifth Step of Exposition]**",
      "start_char": 8802,
      "end_char": 9332,
      "start_sentence": 414,
      "end_sentence": 439,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.571336269378662,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "从而加迎真一，〈谢按：就人身而言，此为采药也〉下照万方。 继迎坤元以抚之，〈谢按：以胎息养真〉乾元以一之。 〈谢按：以神火封固〉＜谢按：地炁上升，天炁下降，和合于中黄。 ＞物产繁衍，民行淳驯。 此为下手第六步。 ＜谢按：天人合一，无极真一乃现，而太极自造自化，我之胎息与天地二炁和合相纽相恋，氤氲运化，百脉万窍周流，所谓“道生一，一生二，二生三，三生万物”也。 于世运而言，则天下太平，民风淳正，物产丰富，上层与下层交通一炁。 ＞(　驯当作良)",
      "translated_text": "Then proceed to further welcome the true One—***(Xie’s note: In terms of the human body, this is \"gathering the medicine.\")***—its radiance descending to illuminate all directions. Next, welcome the primal power of Kun to nurture it—***(Xie’s note: Nurturing the true with embryonic breathing.)***—and the primal power of Qian to unify it—***(Xie’s note: Sealing and securing with the fire of spirit.)*** ***Xie’s note: Earthly *qi* ascends, heavenly *qi* descends, merging in the Central Yellow.*** Thus, the products of the earth proliferate, and the people’s conduct becomes pure and docile. This is the sixth step of practice. ***Xie’s note: When Heaven and humanity unite as one, the true One of Wuji appears, and the Great Ultimate spontaneously generates and transforms itself. My embryonic breathing intertwines and yearns with the *qi* of Heaven and Earth, circulating in misty transformation. The hundred vessels and myriad apertures flow in ceaseless motion—this is what is meant by *\"The Dao gives birth to the One, the One gives birth to the Two, the Two give birth to the Three, and the Three give birth to the myriad things.\"* In terms of the world’s fortunes, this brings great peace under Heaven, pure and upright customs among the people, abundant resources, and the upper and lower classes communicating as one *qi*.*** (The character 驯 should read 良.)",
      "overlap_context": "d the myriad things communicate; above and below unite, and their wills align.”\nThe *Xiang* states: “The lord thereby completes the Dao of Heaven and Earth, assists the proper timing of Heaven and Earth, and thereby guides the people.”\nYin assists yang, Kun receives Qian’s mandate—this is the image of all undertakings flourishing, the four seas at peace.]\n\nAt this stage of merit, the court radiates harmony, all officials display brilliance, and the people’s concerns are fully known to the ruler.",
      "start_char": 9332,
      "end_char": 9549,
      "start_sentence": 440,
      "end_sentence": 447,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.2788002490997314,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "[　篑中书、陶本同，文正藏本句繁不悉载。 (　一得)　按：《礼》曰：“德者，性之端也，极乎天而蟠乎地，行乎阴阳而通乎鬼神。 ”功用至此，天地顺而四时当，艮有德而五谷昌。 诗曰：“允矣君子，展也大成。 ”——合外内之道也。 《金刚经》曰：“佛说非身，是名大身，纳大千于一粟也。 ”《弥陀经》曰：“阿弥陀佛国，众生无有众苦，但受诸乐，是故名为极乐。 ”皆道在一身，效在众生，申锡无疆之轨也。 儒释二家医世之道，亦该于此书矣！ 吕祖曰：“此抚世之极功，圣人之能事，然非有待于外。 六合九州，不出坤腹，呼吸可通＜谢按：天人合一之呼吸，天人和合之大胎息。 但不可执着于色身上之坤腹。 ＞尽人能学，惟在志坚，切戒私智用事耳！ ”又曰：“天地无心，寄心于人，人故能行，行必有成。 ”又曰：“要知世运之有上中下，犹人之有少壮老。 人无不愿常少壮，天地岂有不愿常上中哉！ 至人体之，故垂是说以俟志士。 然有至玄玄理，终古未经道破。 余昔早闻是说而窃有待，及既道成且圆，甫知昔既未事，今亦惟能述此说(　曰“述此”，说明非本经原文，祖师述其说以示人也。 )　以俟后之踵行者。 妆曹姑勿穷诘(　详语意，此经之道甚大，仙真且不得尽闻，凡人不当穷诘秘录。 祖师慈悲，吾辈得闻说述，岂非三生之幸乎？ )　今姑为汝曹详述其能致之本(　可见全经上半部尚有修为功夫，下文乃述其能致之本)　。 乃曰：“《参同契》、《悟真篇》足以圆命，《唱道真言》足以圆性，《大洞玉经》足以化凡，《三尼医世》足以证果。 无如《参》《悟》两书，中多隐秘，易入歧途。 《大洞玉经》，经义简该，藉化气质，功用极神，加之《唱道真言》，仗以炼心，则三宝淳粹，然后参以《参》、《悟》以圆命，《医世》以证果。 证果，计行以证者——行有巨于《三尼医世说》乎？ 呜呼！",
      "translated_text": "[The *Kuizhong* manuscript and Tao’s edition are identical here; the *Wenzheng Zang* edition contains additional text that is not fully transcribed. (Yide’s note)]\n\nAs the *Book of Rites* states: “Virtue is the essence of human nature, reaching to Heaven above and coiling through Earth below, moving through yin and yang and penetrating the realm of ghosts and spirits.” When its efficacy reaches this point, Heaven and Earth align, the four seasons proceed in due order, the *Gen* trigram radiates virtue, and the five grains flourish. The *Book of Songs* says: “Truly, this noble one has achieved great completion”—this is the unity of the inner and outer Way.\n\nThe *Vajracchedikā Sūtra* states: “The Buddha declared that what is not the body is called the great body, for it contains the great thousand worlds within a single grain.” The *Amitābha Sūtra* says: “In the land of Amitābha Buddha, sentient beings know no suffering but only receive every joy; hence it is called *Ultimate Bliss*.” All these speak of the Dao residing in the individual while its effects extend to all beings—this is the boundless pattern of bestowing and granting.\n\nThe world-saving Way of the Confucian and Buddhist traditions is likewise encompassed within this text. As Master Lü said: “This is the ultimate achievement in governing the world, the highest capacity of the sage—yet it does not depend on anything external. The six directions and nine provinces are all contained within the womb of *Kun*; breath can connect them.” [Xie’s note: This refers to the breathing of Heaven-and-human unity, the great embryonic respiration of their harmonious union. However, one must not fixate on the *Kun*-womb as merely the physical abdomen.]\n\nAll people can cultivate this; the key lies in unwavering resolve and the strict avoidance of acting on private cleverness.\n\nHe also said: “Heaven and Earth have no mind of their own; they entrust their mind to humanity. Thus, when people act, their actions must bear fruit.” And further: “Know that the fortunes of the world rise and fall through upper, middle, and lower phases, just as a person passes through youth, prime, and old age. No one wishes to remain forever old, so how could Heaven and Earth not desire to remain forever in their upper and middle states? The perfected one embodies this truth and thus leaves this teaching for those of resolute aspiration. Yet there is a principle most profound, which has never been fully revealed throughout the ages.\n\nLong ago, I first heard this teaching and privately awaited its fulfillment. Only after attaining the Dao in full completion did I realize that my earlier efforts had been insufficient. Now, I can only transmit this teaching [the phrase “transmit this” indicates that these are not the original words of the scripture but the Master’s exposition for the benefit of others] to those who will follow in its footsteps. You, my disciples, should not press for exhaustive inquiry [given the vastness of this scripture’s Way, even immortals do not hear its entirety; how could ordinary people demand to scrutinize its secret records? The Master’s compassion allows us to hear this transmission—is this not a blessing earned over three lifetimes?].\n\nNow, I will explain in detail the foundational means by which this can be achieved [clearly, the earlier portion of the scripture contains further practices of cultivation; the following describes the essential basis for attainment]. Thus he said:\n\n*The Kinship of the Three* and *The Awakening to Reality* suffice to perfect destiny; *The True Words of the Dao-Chanting* suffices to perfect nature; *The Jade Scripture of the Great Cavern* suffices to transform the mundane; *The Three Nīla’s World-Saving* suffices to verify fruition. Yet among these, *The Kinship* and *Awakening* contain many hidden secrets and are easily misinterpreted, leading one astray.\n\n*The Jade Scripture of the Great Cavern* is concise yet comprehensive in its principles, transforming the *qi*-nature with extraordinary efficacy. When supplemented by *The True Words of the Dao-Chanting* to refine the mind, the Three Treasures become pure and refined. Then, one may study *The Kinship* and *Awakening* to perfect destiny, and *The World-Saving* to verify fruition.\n\nAs for verifying fruition—what practice could surpass that expounded in *The Three Nīla’s World-Saving*? Alas!",
      "overlap_context": "lating in misty transformation. The hundred vessels and myriad apertures flow in ceaseless motion—this is what is meant by *\"The Dao gives birth to the One, the One gives birth to the Two, the Two give birth to the Three, and the Three give birth to the myriad things.\"* In terms of the world’s fortunes, this brings great peace under Heaven, pure and upright customs among the people, abundant resources, and the upper and lower classes communicating as one *qi*.*** (The character 驯 should read 良.)",
      "start_char": 9550,
      "end_char": 10276,
      "start_sentence": 448,
      "end_sentence": 475,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.801130056381226,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "匹妇衔冤，三年不雨，凶乃尔，吉亦然也。 余尝亲印诸“三尼”，咸云如是如是。 “三尼”又曰‘性功不圆者验不淳，命功不圆者致不坚，气质不圣者用不神； 三宝尽圆返夫先天者，行之藉诸人。 ’此即至玄玄理，吾昔未之闻也，汝曹今可悟矣。 否则两大自谋何其疏，万圣同寅何其懈，岂非有生以来一大疑团哉？ 汝曹今而后趁此生年月日，时时力行勿怠，尽此报身而证果，不亦宜乎？ 然治病要知源，病源不知如何下手？ 两大，无心无欲者。 然而好生，生多则乏。 医有子病补母，母病补子。 若夫保极而新民，一法也； 爱民而悍灾，一法也。 惟此医世，乃有循环补剂，用用无穷，不费一钱，不劳丝力，坐而致之，功圆上升。 与其从事三千功八百行须藉人力，不若行凭一念，操纵自由而诀又不繁，乃反空度岁月，不亦惑乎？ 时哉时哉，幸毋待焉”。 ——此道光三年分所示者。",
      "translated_text": "A wronged village woman may halt the rains for three years—such is the power of misfortune, and so too is the power of fortune. I have personally witnessed this confirmed in the \"Three Nīla\" texts, all attesting: so it is, so it is.\n\nThe \"Three Nīla\" further state: \"One whose cultivation of nature is imperfect will find verification impure; one whose cultivation of destiny is imperfect will find attainment unstable; one whose *qi*-nature remains unrefined will find efficacy unspiritual. Only when the Three Treasures are fully perfected and one returns to the primordial can the practice be entrusted to others.\"\n\nThis is the most profound of profound principles—one I had never heard before. Now, you may awaken to it. Otherwise, how careless are the two great forces in their self-governance! How negligent are the myriad sages in their shared reverence! Is this not the greatest enigma since the dawn of life?\n\nFrom this day forward, seize the years, months, and days of this life. Practice diligently without slack, perfecting this mortal form to verify fruition—is this not fitting?\n\nYet to cure illness, one must know its source. Without knowing the source, how can one begin? The two great forces are without mind or desire. Yet they cherish life, and where life proliferates, scarcity follows.\n\nIn medicine, there is the method of supplementing the child when the mother is ailing, and the mother when the child is ailing. To preserve the ultimate and renew the people—this is one method. To cherish the people and repel calamity—this is another.\n\nOnly in this *World-Saving* practice does there exist a cyclical remedy, infinitely efficacious, costing not a coin, expending not a thread of effort, achieved through stillness. Its merit is perfected, and one ascends. Compared to the three thousand merits and eight hundred deeds that require human effort, is it not better to rely on a single thought, freely wielding mastery with a method neither cumbersome nor complex? To squander years in vain—is this not delusion?\n\nThe time is now, the time is now—do not wait!\" —This was expounded in the third year of Daoguang.",
      "overlap_context": "ray.\n\n*The Jade Scripture of the Great Cavern* is concise yet comprehensive in its principles, transforming the *qi*-nature with extraordinary efficacy. When supplemented by *The True Words of the Dao-Chanting* to refine the mind, the Three Treasures become pure and refined. Then, one may study *The Kinship* and *Awakening* to perfect destiny, and *The World-Saving* to verify fruition.\n\nAs for verifying fruition—what practice could surpass that expounded in *The Three Nīla’s World-Saving*? Alas!",
      "start_char": 10276,
      "end_char": 10619,
      "start_sentence": 476,
      "end_sentence": 492,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.931596517562866,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "又曰：“两大元复，则物产茂，生人良。 人良则物茂，物茂则人良，人良物茂，非世泰乎？ ＜谢又按：两大元者，即乾元坤元之谓也。 于人身而言，得乾元者，性阳生，即性玄关开也，又称上玄关； 坤元者，命阳生，命玄关开也，又称下玄关，其实只有“一”个“玄窍”，实是随各人根器功力环境不同而显现各异也，真到玄窍大开，则性命合一，两元混一，物我两忘，真一乃现，循“一”以持，则“一”自化化生生，所谓“一”窍开，万窍俱开也。 医世之功诀，只“虚寂混化，念中无念”八字而已，其诀又重在“念中无念”，所谓“用志不分，乃凝于神”也，又所谓“真一其念”也，先放之极处，再收之极。 由放光而致返光内省。 收之极处亦不过一太虚，放之极处亦不过一太虚。 放而非放，收而非收。 ＞非有互相医治之义乎？ 又何观望乎哉！ 昔姑射(　音弋)　山神人姓许名晶字子由，创医两大于尧舜时，而洪水平，苗民臣服，非明征欤(　葛陆问答亦载此)　？ 其尤着者，佛说《持世陀罗尼经》，亲授妙月长者于骄弥国，迄今西域受其赐，见诸内典(　彭尺木佛藏随笔亦引)　。 厥功厥德，可胜量哉？",
      "translated_text": "Moreover, it is said: \"When the two great *Primordials* are restored, all things flourish and humankind is good. When humankind is good, all things flourish; when all things flourish, humankind is good. Is this not the prosperity of the age?\n\n<*Xie’s further note*: The two great *Primordials* refer to the *Primordials* of *Qian* and *Kun*. In the human body, one who attains the *Primordial of Qian* experiences the arising of yang in *nature*—this is the opening of the *Mysterious Pass of Nature*, also called the *Upper Mysterious Pass*. One who attains the *Primordial of Kun* experiences the arising of yang in *destiny*—this is the opening of the *Mysterious Pass of Destiny*, also called the *Lower Mysterious Pass*. In truth, there is only *one* \"Mysterious Aperture,\" yet its manifestation varies according to each person’s capacity, cultivation, and circumstances. When the *Mysterious Aperture* is fully opened, *nature* and *destiny* unite, the two *Primordials* merge as one, self and other dissolve, and the *True One* appears. Abiding in the *One*, the *One* spontaneously transforms and generates life—this is what is meant by \"when the *One* aperture opens, all apertures open.\"\n\nThe method of *World-Saving* consists in but eight characters: *\"Emptiness, stillness, merging, transformation—no thought within thought.\"* The crux lies in *\"no thought within thought,\"* which is to say, *\"When the will is undivided, it congeals into spirit,\"* or again, *\"The thought is the True One.\"* First, release to the utmost; then, gather to the utmost. From the radiance of release, turn inward to introspection. The utmost of gathering is nothing more than the *Great Void*; the utmost of release is nothing more than the *Great Void*. Release is not truly release; gathering is not truly gathering.>\n\nDoes this not embody the principle of mutual healing? Why then hesitate?\n\nIn ancient times, on Mount Guye (pronounced *Yi*), the divine person surnamed Xu, named Jing, styled Ziyou, established the healing of the two *Primordials* during the reigns of Yao and Shun. As a result, the floodwaters were pacified, and the Miao people submitted—is this not clear proof? (This is also recorded in the *Dialogues of Ge and Lu*.)\n\nEven more remarkable is the *Dhāraṇī of Upholding the World* preached by the Buddha, personally transmitted to the elder Miaoyue in the kingdom of Jiao Mi. To this day, the Western Regions continue to benefit from its blessings, as attested in the Buddhist scriptures (also cited in Peng Chimu’s *Random Notes on the Buddhist Canon*).\n\nHow can the merit and virtue of such deeds be measured?",
      "overlap_context": ", infinitely efficacious, costing not a coin, expending not a thread of effort, achieved through stillness. Its merit is perfected, and one ascends. Compared to the three thousand merits and eight hundred deeds that require human effort, is it not better to rely on a single thought, freely wielding mastery with a method neither cumbersome nor complex? To squander years in vain—is this not delusion?\n\nThe time is now, the time is now—do not wait!\" —This was expounded in the third year of Daoguang.",
      "start_char": 10621,
      "end_char": 11072,
      "start_sentence": 493,
      "end_sentence": 506,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.671441078186035,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "吾宗以此道证果仙者，惟北派七子。 然而尽人可学也。 以昔未奉玉清神母懿旨，秘不敢泄，今则统沐懿旨，诰下三天，普敕三界，准行授受，无分男女。 三天三界，昼夜巡护，授持善信，有感斯应，魔无干犯。 洵是开辟以来未有之遭逢，造化幸甚，亿万世世幸甚。 然贵有以身率者。 余诀则以得合真一为本，而功用总自胎息一节始。 余知道不终隐，故昔降说述存于兹山之龙峤山房也。 今更彻底宣示未泄，汝曹应共凛遵，慎毋稍存期效念——今更无验自验，理如是也，道如是也。 ” 吕祖之训如此，有志斯道者，阅是书，必能发所未发，身体而力行之。 三尼且默鉴之。 此(　一得)　采集吕祖遗训，疏解是书之本意。 其余强半采诸蒋元庭待郎纂刻吕祖《天仙正宗》内集。 待郎有跋，谓：“闻云南五华山藏有《祖师医世说经》，似合内集所示玄义。 历访未得，得则拟以冠诸内集，盖必有要妙存是经中，《道藏》未采，缺典也。 ”(　一得)　窃以待郎所闻，或即鸡足山本，得之传闻，故有是经云云耳！ 盖以陶律师原序核之，诀非经文，而谓《吕祖医世》亦误也。 识此以俟考，(　一得)　谨识。 ]",
      "translated_text": "The lineage of our school has seen only the Seven Masters of the Northern Tradition attain the fruit of immortality through this Dao. Yet it is a path open to all. Formerly, without the august decree of the Jade-Pure Divine Mother, it was kept secret and never dared to be revealed. Now, however, having received Her sacred mandate, proclamations have descended through the Three Heavens, universally enjoining the Three Realms to permit its transmission and reception, without distinction of male or female. The Three Heavens and Three Realms shall guard and protect day and night; those who sincerely uphold it shall receive response upon invocation, and no demonic forces shall dare to interfere. Truly, this is an encounter unparalleled since the dawn of creation—a supreme fortune for the workings of fate, and a boundless blessing for countless generations to come.\n\nYet it is essential that there be those who lead by personal example. The remaining secrets hinge upon attaining union with the True One as their foundation, while all cultivation begins with the practice of *embryonic respiration*. I know this Dao shall not remain forever hidden, and thus in former times I descended to expound and record these teachings, which have been preserved in the Dragon Ridge Mountain Chamber of this very mountain. Now, I reveal them fully and without reservation. You who receive these words must reverently adhere to them, taking care never to harbor even the slightest expectation of immediate results—for the principle is thus, and the Dao is thus.\n\nSuch was the instruction of Ancestor Lü. Those who are devoted to this Dao, upon reading this text, will surely awaken to what they have not yet awakened, embodying and practicing it with diligence. May the Three Nuns silently bear witness.\n\nThis compilation (*Yide*) gathers the surviving instructions of Ancestor Lü and elucidates the original intent of this text. The remainder is largely drawn from the *Inner Collection of the Orthodox Tradition of Heavenly Immortals* compiled and edited by Minister Jiang Yuanting. In his postscript, the Minister writes: “I have heard that on Mount Wuhua in Yunnan, there is a *Scripture on the Ancestral Master’s Healing of the World*, which appears to align with the profound meanings set forth in the *Inner Collection*. Though I have sought it extensively, it remains unobtained. If found, I intend to place it at the head of the *Inner Collection*, for it must contain essential mysteries. Its absence from the *Daoist Canon* is a grievous omission.”\n\n(*Yide*) privately surmises that what the Minister heard may refer to the version from Mount Jizu, though his account seems based on hearsay, hence the mention of such a scripture. However, upon examining the original preface by Master Tao, it is clear that the secrets are not part of the scriptural text, and the title *Ancestor Lü’s Healing of the World* is also erroneous. This note is made in anticipation of further verification.\n\n(*Yide*) respectfully records.",
      "overlap_context": "the Miao people submitted—is this not clear proof? (This is also recorded in the *Dialogues of Ge and Lu*.)\n\nEven more remarkable is the *Dhāraṇī of Upholding the World* preached by the Buddha, personally transmitted to the elder Miaoyue in the kingdom of Jiao Mi. To this day, the Western Regions continue to benefit from its blessings, as attested in the Buddhist scriptures (also cited in Peng Chimu’s *Random Notes on the Buddhist Canon*).\n\nHow can the merit and virtue of such deeds be measured?",
      "start_char": 11072,
      "end_char": 11519,
      "start_sentence": 507,
      "end_sentence": 526,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.730029344558716,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "+++ 吕祖师三尼医世功诀 跋 箧中书刻本，原无卦画，余所得朱氏抄本，各步前有卦象，或疑是后之学道者所拟。 余谓抄本传世已久，不可删，故疏解卦义而存之。 或又疑而问曰：“世之为病多端，医世之事亦多术，如禳旱涝，消沴禄，厌兵燹，除疾痰，救焚拯溺，捍大灾大患，皆当有大神通，大法力，施符持咒，分应而不穷。 今是书以一法而欲治众病，若是其疏乎，抑全书中诸法皆备，而子未见乎？ ”予应之曰：“子之所言术也，此书中所言道也，吾知此书必不言术。 明玄学者，不屑为触石斗棋之幻； 握神机者，不屑为羽扇反风，杯酒巽雨之事。 曾谓圣人之大道，而可杂以技术乎？ 谓吾未见全书，信也； 谓吾未见全书中之法术，吾不信也。 是书所见异词，所传闻又异词，安知不有好奇之士，窃取他书符咒之说，附入此书？ 见者迷以为是书之本文，讹以传讹，流于方技，作伪欺人，勿为所惑，勿为所愚，焚之可也”。 曰：“然，则灾患多端，执一说可尽之乎，抑将束手而听之乎。 ”曰：“子未知道而好言术，术小而道大，非子所知也。 凡世间之病，皆五行偏胜之气，吾人一身之中，具五行之正气，应五方分野，察其受病之源，攻其受病之方，合人世之气于一身，内不见我，外不见人，过者损之，不及者益之，郁者散之，顽者化之，逆者顺之，病不可悉数，医道亦不可殚述，消息盈虚，各视其症而理之。 人或有病，以吾身之阴阳运化之。 世或有病，亦以吾身之阴阳调摄之。 不疾而速，神乎神乎！ 然而非人所能为也，乾元也，坤元也，真一也，迎而存之，乃如响斯应耳。 况大道之行，何待患至而后为之，补偏救敝哉！ 知斯理者可不为符咒术数之所惑矣。 ”道光戊子孟夏浙湖金盖山人嗣龙门正宗第十一代闵一得谨跋于金陵之甘露园。 太虚大师沈一炳授　门弟闵一得重述并注 三尼者，仲尼，牟尼，青尼也。 世，世界也。 按此世字，兼身而言，乃是即身以医世也。 吕祖旧有三尼医世说述刻本，余曾得而疏之，而功诀未备，功诀一册，得自太虚翁，翁谓功惟神持玉经，而诀自玄蕴咒入手云云。 中为友人携去，岁越四十春秋，始得重事。 乃为重述而手注之，后更以祝词以示我功用。 如是，诀功乃备。 不取自私，谨以公布诸同学云。 玄蕴咒 云篆太虚，浩劫之初，乍遐乍迩，或沈或浮。 五方徘徊，一丈之余。 谨按功诀，师命辑从玄蕴开张者，欲学者游心于物之初也。 夫我未寓形，原与太虚同体，如云篆于浩劫之初，遐迩浮沉于五方，不出乎一丈天心之外。 及至寓形成物，初尚未失真元，迨后外物交错，识神用事，莫知自返，久之习染疴尘，将且求医之不暇，更何能从事此诀？ 吾故愿志此者，首格物致知，以诚已意。 已意一诚，乃可学此。 每于持经之先，体诵此咒，以新心目，而返吾初。 使彼识神，无从驻足，本命乃安，心乃泰定。 既安且定，真元乃复，此云篆方得遍罗太虚，是得静极而动之明证。 然其动出无心，遐迩浮沉，徘徊未定。 其为物也，至虚至灵，忽隐忽现。 惟五方既现端倪，太虚已有云篆，自可演象成文。 总蕴有增损于其间，究莫漓天心之方丈，是又动不移极之至理。 犹言吾心，不离方寸是也。",
      "translated_text": "+++ **Postscript to *Master Lü’s Three Nis’ Formula for Healing the World***\n\nThe block-printed edition in my case originally contained no hexagram diagrams. The manuscript copy I obtained from the Zhu family, however, includes hexagrams preceding each step. Some suspect these were later additions by Daoist practitioners. I maintain that the manuscript has circulated for generations and should not be altered; thus, I have annotated the hexagram meanings while preserving them.\n\nOthers have questioned: “The world’s afflictions are manifold, and the art of healing it admits many methods—averting drought and flood, dispelling pestilence, suppressing warfare, eradicating disease, rescuing from fire and drowning, and warding off great disasters. Such tasks demand vast spiritual potency and mighty dharmic power, the deployment of talismans and mantras, responses as boundless as the needs themselves. Yet this text proposes a single method to cure all ills—is this not overly simplistic? Or does the full work contain all methods, which you have not yet seen?”\n\nI replied: “What you describe are *techniques*; this text speaks of the *Dao*. I am certain it does not discuss techniques. Those who grasp the profound Dao disdain illusions like striking stones to summon chess pieces. Those who wield divine mechanisms scorn tricks like waving fans to reverse wind or pouring wine to summon rain. Could the great Dao of the sages ever be adulterated with mere arts? It is true I have not seen the complete text; but I do not believe the full work contains such techniques. The versions I have seen differ in wording, and rumors vary still. Who is to say some eccentric has not surreptitiously inserted talismans and incantations from other texts, leading readers to mistake them for the original? Error begets error, flowing into the realm of occult arts, deceiving and deluding. Such corruptions should be burned.”\n\nThey pressed: “Yet disasters are manifold—can one doctrine truly address them all? Or must we resign ourselves to inaction?”\n\nI answered: “You do not understand the Dao and are fixated on techniques. Techniques are small; the Dao is vast—beyond your comprehension. All worldly afflictions arise from the excesses of the Five Phases’ *qi*. Within our own bodies resides the upright *qi* of the Five Phases, corresponding to the five directions. By diagnosing the source of affliction and attacking the affected direction, we harmonize the world’s *qi* with our own. Internally, we perceive no self; externally, no others. Excess is reduced; deficiency is replenished. Stagnation is dispersed; rigidity is transformed. Reversal is corrected. Though diseases are innumerable and healing arts inexhaustible, the regulation of *qi*—its waxing and waning—must be tailored to each condition. When a person is ill, we mobilize the yin-yang transformations of our own body. When the world is ill, we likewise regulate it through our body’s yin-yang. Swift yet effortless—how wondrous! Yet this is not something ordinary people can achieve. It is the primordial *qi* of *Qian* and *Kun*, the True Unity. By reverently preserving it, response follows as echo to sound. Moreover, when the great Dao prevails, why wait for calamity to act? Why merely patch imbalance and salvage ruin? Those who grasp this principle will not be misled by talismans, incantations, or numerological arts.”\n\n**Dated:** The fourth month of the *wùzǐ* year of the Daoguang reign (1828), **Min Yide**, eleventh-generation successor of the Longmen Orthodox Lineage, respectfully inscribed at Ganlu Garden in Jinling.\n\n**Transmitted by:** Master Taixu Shen Yibing\n**Recompiled and annotated by:** Disciple Min Yide\n\n**The Three Nis:** Confucius (Zhongni), Śākyamuni (Muni), and the Green Ni (Qingni).\n**The World:** Here, the term encompasses both the macrocosm and the microcosm of the body, signifying the healing of the world through the self.\n\nMaster Lü’s earlier *Three Nis’ Discourse on Healing the World* was once in my possession, and I annotated it. However, the *Formula* was incomplete. The *Formula* volume was obtained from Elder Taixu, who stated that the *power* resides in the divine holding of the Jade Scripture, while the *formula* begins with the *Mystic Store Mantra*. The text was later taken by a friend, and forty years passed before I recovered it. I have now recompiled and personally annotated it, adding invocations to clarify its application. Thus, the *Formula* and *Power* are now complete. Not for private gain, I humbly share this with fellow practitioners.\n\n---\n\n**Mystic Store Mantra**\n\nCloud-seal of the Great Void,\nAt the dawn of kalpas,\nNow distant, now near,\nNow sunken, now floating.\nWandering the Five Directions,\nBeyond a *zhang*’s span.\n\n**Annotation to the Formula:** The master’s instruction to compile the *Mystic Store* is to guide practitioners in directing their minds to the origin of things. Before our forms took shape, we were of one body with the Great Void—like cloud-seals at the kalpa’s beginning, drifting near and far, floating and sinking across the Five Directions, yet never beyond the *zhang*-square of the celestial heart. Upon embodying form, we initially retain our true primordial *qi*. Later, as external things entangle us and the discriminating mind takes control, we forget to return. Over time, habitual defilements accumulate, leaving us no leisure even to seek healing—how then could we practice this formula? Thus, I urge those who aspire to this path to first investigate things and extend knowledge, sincerely rectifying their intentions. Only with sincere intention can one study this. Before holding the scripture, recite this mantra to renew mind and eye, returning to our origin. This prevents the discriminating mind from gaining foothold, securing the original destiny and calming the heart. Once settled, the true primordial *qi* is restored. Only then can the cloud-seal pervade the Great Void—proof of movement arising from supreme stillness. Yet this movement is spontaneous, drifting near and far, floating and sinking, unsettled. As a thing, it is utterly empty, utterly numinous, now hidden, now manifest. Once the Five Directions reveal their signs and the Great Void bears cloud-seals, images may be derived and texts composed. Though additions and omissions may occur, the *zhang*-square of the celestial heart remains unfathomable—this is the principle of movement without departing from the ultimate. It is like saying: our heart never strays from the square inch.",
      "overlap_context": "Canon* is a grievous omission.”\n\n(*Yide*) privately surmises that what the Minister heard may refer to the version from Mount Jizu, though his account seems based on hearsay, hence the mention of such a scripture. However, upon examining the original preface by Master Tao, it is clear that the secrets are not part of the scriptural text, and the title *Ancestor Lü’s Healing of the World* is also erroneous. This note is made in anticipation of further verification.\n\n(*Yide*) respectfully records.",
      "start_char": 11523,
      "end_char": 12758,
      "start_sentence": 527,
      "end_sentence": 576,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.13133668899536,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "方寸，心也。 人心曰方寸，天心曰方丈云。 天真皇人 谨按道典，在天曰天真皇人，在人曰本命元神。 按笔乃书，以演洞章 洞章，即玉经，按为生天生地生人物把之文。 皇人，乃先天之真，故能体演成经。 以人而言，乃为先觉之灵。 朕兆未现，灵先觉焉，此玉经正旨，学者毋或背焉。 次书灵符 按即洞章之文，皇人剖而书之，乃为一字一符。 元始下降，真文诞敷 谨按此元始，乃即元始法王在天之灵，三才真一之精是也。 下句真文，乃为三才所生之圣，乘时流演之圣训，三教经书是也。 昭昭其有，冥冥其无 言皆真一所生所化，无非妙有妙无之隐现，二而一者也，故统以其字该之。 疴能自痊，尘劳溺可扶 按世疴，半由人事，斗由运戾，故不可以药力致痊。 若世尘劳，半由习染，半由气禀，故不可以威惠维持。 惟应迎一，以镕以化。 庶几疴能自痊，尘劳溺可扶。 有志自新新民者，务勉诚体以行之。 幽明皆有赖，由是升清都 幽乃地道，冥冥是也。 明乃天德，昭昭是也。 人之一身，兼而有之，身心是也。 惟明知白守黑，知雄守雌者，庶克所用无偏，而幽明咸赖焉。 清都者，三清圣人所居之天都也。 升者，平也。 人知循一引一，以镕以化，自克平证清都。 盖言真一之妙用，进体下句是字，直接此句是字，可见矣。 是为元命宝，穷劫不消磨。 人能常持诵，世与天为徒 按此世字，专贴一身而言。 元命宝，即是坎中一画，升由海底，后穿尾闾，透脊达脑，化成王倪，悬于天灵盖骨，运到中宫炁合，便成满月，而心现红黄丹书字曰天罡，究属中央生炁所聚结。 在天曰镇星，高出日月之上，乃是地球精华，上腾成象。 其为炁也，极中极正，而又至刚至仁。 《道典》曰：所注则化，所镇则正。 而光随斗转，心不移极。 盖言其心中镇定，若磨盘之心。 故其中宫，常得泰定。 吾辈医世，心事迎镇，罡气自随下注，故宜色身端正，如立山巅，四顾空廓。 盖镇如日，上丽天际，不假人存，自得光注全身。 惟当虚寂身心，而容光必照。 人能如是行持，自造身若纱谷，内外通透，此非中宫虚寂之极，不之现也。 尤贵不住昭昭，兼听冥冥。 一旦身造清和，视若故有，心不稍动，是为身造清和，不滞色相。 再能加造忘忘，乃入圆证矣。 然或并此假法亦忘，则又堕入自然外道，不散漫，即昏沉。 此古哲必假元命命宝之由。 盖以命宝，乃是吾身真一，用一以镇，心乃泰定。 余今于是体吕祖之假玉经以调心，其旨更玄，其用更微。 我师用以辅相命宝，上迎下注，全体虚灵，尤为神效也。 盖以玉经，乃是三才真一之精，而命宝又为天赋真一，即一引一，有无互溶而互化，世有不治乎哉。 然惟至诚无息者能之，故曰人能常持诵，世与天为徒，古哲之垂戒如此。 是言玉经虽灵，尤贵持诵之无或间耳。 玉　　经 罗三蓝波，逮洽台离，堂运推入，连广灵都。 郁罗殊邈〈音穆〉，育弗超散，兆生天横，滞始冥骞。 庭盼苞己〈音几，上声〉猷玄握称〈乎声〉，沙福烟明，桂会和子。 存乐贤勒，百奋天垢，土成垣平，弥结章生。 章结陆渺，莱蒙龙登，狞〈音能〉獬〈音械〉筌信，帝你驮来。 南无珏法，乘津幽延，日月星斗，耀息命炁。 防元德丘，寿贞固灵，寿天地晶。",
      "translated_text": "The square inch is the heart. The human heart is called the \"square inch,\" while the celestial heart is called the \"square *zhang*.\"\n\nThe Heavenly Perfected One respectfully examines the Daoist canon: in heaven, this is the Heavenly Perfected One; in humans, it is the original destiny and primordial spirit. Taking up the brush to inscribe, one unfolds the *Dongzhang*—the *Dongzhang* being the Jade Scripture, the text that generates heaven, earth, and all beings. The Perfected One, as the primordial truth, thus embodies and unfolds the scripture. In human terms, this is the enlightened spirit of prior awakening. Before signs manifest, the spirit first awakens—this is the true purport of the Jade Scripture, from which scholars must not deviate.\n\nNext, inscribe the numinous talismans. These are the words of the *Dongzhang*, which the Perfected One divides and writes, each character becoming a talisman. The Primordial Beginning descends, and the true scripture spreads forth. This Primordial Beginning is the celestial spirit of the Primordial Dharma King, the essence of the Three Powers’ true unity. The \"true scripture\" below refers to the sacred teachings born of the Three Powers, the sagely instructions flowing with the times—these are the scriptures of the Three Teachings. Luminous yet existent, obscure yet nonexistent: all are born and transformed by the true unity, manifesting as wondrous being and wondrous nonbeing, two yet one. Thus, all is encompassed by this character.\n\nIllness may heal itself, and worldly toil and drowning can be rescued. Worldly afflictions arise half from human affairs and half from adverse fate, so they cannot be cured by medicine alone. Worldly toil stems half from habitual defilement and half from innate *qi*-endowment, so it cannot be sustained by authority or favor. Only by embracing the One, refining and transforming, can illness heal itself and drowning be rescued. Those who aspire to renew themselves and others must diligently embody and practice this.\n\nBoth the hidden and the manifest depend on it, and thus one ascends to the Pure Capital. The hidden is the way of earth, the obscure; the manifest is the virtue of heaven, the luminous. The human body encompasses both—this is the body and heart. Only those who know the bright yet guard the dark, know the male yet guard the female, may use it without bias, so that both hidden and manifest are upheld. The Pure Capital is the celestial abode of the Three Pure Ones. \"Ascend\" means to level. By following the One and drawing the One, refining and transforming, one naturally levels and attains the Pure Capital. This reveals the wondrous function of the true unity: the character in the previous line directly connects to the character here.\n\nThis is the Treasure of Primordial Destiny, impervious to eons of erosion. If one constantly recites it, one’s generation will become a companion to heaven. Here, \"generation\" refers specifically to the individual. The Treasure of Primordial Destiny is the single stroke within *Kan*, rising from the sea bottom, piercing the tailbone, threading the spine to reach the brain, transforming into the royal infant, suspended at the celestial cover bone. When it circulates to the Central Palace and *qi* converges, it forms a full moon, and the heart reveals the cinnabar-red characters of the Celestial Stem—ultimately, the gathering of the central generative *qi*. In heaven, this is the Star of Stability, towering above the sun and moon, the essence of earth ascending to form its image. As *qi*, it is supremely centered and upright, at once utterly firm and utterly benevolent. The *Daoist Canon* states: where it infuses, transformation occurs; where it stabilizes, rectification follows. Its light revolves with the Dipper, its heart never straying from the ultimate. This means its heart is steadfast, like the pivot of a millstone. Thus, the Central Palace remains perpetually settled. In our generation’s healing of the world, when the heart’s affairs align with stability, the Stem’s *qi* naturally descends. Therefore, the physical form must be upright, like standing atop a mountain peak, gazing into the vast emptiness. For stability is like the sun, ascending to the celestial verge, requiring no human effort to radiate its light throughout the body. Only when body and heart are empty and still will the countenance shine. If one practices thus, the body becomes like fine silk or a valley, transparent within and without—this arises only when the Central Palace reaches the extreme of emptiness and stillness. Moreover, one must not cling to the luminous but also heed the obscure. Once the body attains purity and harmony, viewing it as if innate, the heart remains unmoved—this is attaining purity and harmony without attachment to form. Further, if one can forget even this provisional method, one enters perfect realization. Yet if one forgets even this expedient, one falls into the naturalistic heterodoxy, either scattered or torpid. This is why the ancients relied on the Treasure of Primordial Destiny. For the Treasure of Destiny is the true unity of one’s body; using the One to stabilize, the heart becomes settled. Now, in embodying Lüzu’s use of the Jade Scripture to harmonize the heart, its purport is even more profound, its function even more subtle. My teacher employed it to assist the Treasure of Destiny, ascending to welcome and descending to infuse, the entire being empty and numinous—its efficacy is especially divine. For the Jade Scripture is the essence of the Three Powers’ true unity, and the Treasure of Destiny is the heaven-bestowed true unity. When the One draws the One, being and nonbeing mutually dissolve and transform—how could the world not be governed? Yet only those of utmost sincerity and unceasing effort can achieve this. Thus it is said: \"If one constantly recites it, one’s generation will become a companion to heaven.\" Such is the ancient sages’ admonition. This means that though the Jade Scripture is numinous, it is even more crucial that recitation never cease.\n\n**Jade Scripture**\n\n*Luo san lan bo, dai qia tai li, tang yun tui ru, lian guang ling du.*\n*Yu luo shu miao, yu fu chao san, zhao sheng tian heng, zhi shi ming qian.*\n*Ting pan bao ji you xuan wo cheng, sha fu yan ming, gui hui he zi.*\n*Cun le xian le, bai fen tian gou, tu cheng yuan ping, mi jie zhang sheng.*\n*Zhang jie lu miao, lai meng long deng, ning xie quan xin, di ni tuo lai.*\n*Namo jue fa, cheng jin you yan, ri yue xing dou, yao xi ming qi.*\n*Fang yuan de qiu, shou zhen gu ling, shou tian di jing.*",
      "overlap_context": "us, drifting near and far, floating and sinking, unsettled. As a thing, it is utterly empty, utterly numinous, now hidden, now manifest. Once the Five Directions reveal their signs and the Great Void bears cloud-seals, images may be derived and texts composed. Though additions and omissions may occur, the *zhang*-square of the celestial heart remains unfathomable—this is the principle of movement without departing from the ultimate. It is like saying: our heart never strays from the square inch.",
      "start_char": 12758,
      "end_char": 14040,
      "start_sentence": 577,
      "end_sentence": 640,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.99451231956482,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "谨按：玉经经文，止至耀息命炁，其下文，乃言儒释道三大宗教之所同祖，后代宗师之名，非经文也。 经文出自浩劫之初，尚无天地人物，既现如云如霞，遍满虚空，是名玄篆。 先天皇人，起而体之，按形摹写，集而成文，然无句读〈音豆〉可分。 第流存世，及至中古，天神相之，为云篆，为蝌蚪，退集成章。 再后谌母下临，口授旌阳许祖，不惟形体较准，音亦得详悉。 祖欲易以世楷，复虑世人愚鲁，不无遗误，乃以丹道意义，构成四言，便无遗误而已，非以先天经义如是焉。 故此四言玉经，亦犹周氏之集《千字文》，今人之集《兰亭契帖》，重在体韵焉耳。 余昔自叹解悟之难，为之注释空堕言诠。 所幸音韵，无多违背。 惟于南无二字，另音曩谟。 又于百奋天垢“垢”字，另音后字，别有体会，未符此诀。 兹阅医世功诀，并无注释，中有音韵，所存如录，且戒注释，但久持诵，自得会悟。 原传玄训其义至精，只可意会，不可言传。 玄门所谓，诚诵一年成人仙，二年成地仙，三年成天仙，最下日持不间，亦得尸解上道云云。 岂欺我哉？ 特恐持之或间耳！",
      "translated_text": "Here follows the translation:\n\n---\n\nCareful examination reveals that the Jade Scripture’s text concludes at *\"yao xi ming qi\"* (耀息命炁), while the subsequent passages enumerate the names of later patriarchs across the three great teachings of Confucianism, Buddhism, and Daoism—these are not part of the original scripture.\n\nThe scriptural text emerged at the dawn of the kalpa, before heaven, earth, or beings existed. It first manifested as clouds and mist filling the void, known as the *Mysterious Seal Script* (玄篆). The Primordial Sovereign (先天皇人) arose to embody it, tracing its forms and transcribing them into written characters—though without punctuation (句讀) to divide them.\n\nAs the text circulated through the ages and reached the Middle Antiquity, celestial spirits refined it into *Cloud Seal Script* (云篆) and *Tadpole Script* (蝌蚪), assembling it into coherent chapters. Later, the Divine Mother of Profound Truth (谌母) descended to orally transmit it to Patriarch Xu of Jingyang (旌阳许祖). Not only were the forms rendered with greater precision, but the sounds were also clarified in full.\n\nThe Patriarch wished to transcribe it into the standard script of the age but feared that the ignorant might introduce errors. Thus, he composed a four-character verse incorporating the meanings of the Elixir Way (丹道), ensuring no mistakes would arise—though this was not the original intent of the primordial scripture’s meaning. This four-character Jade Scripture, then, resembles Zhou Xingsi’s *Thousand-Character Classic* or the modern compilation of the *Lanting Calligraphy Model*: its essence lies in rhythm and structure.\n\nIn the past, I lamented the difficulty of comprehension and thus provided annotations, though they risked becoming empty verbal explanations. Fortunately, the phonetic readings mostly adhere to the original. However, for the characters *\"namo\"* (南無), I render them separately as *\"nang mo\"* (曩謨). For the character *\"gou\"* (垢) in *\"bai fen tian gou\"* (百奋天垢), I pronounce it as *\"hou\"* (后), with a distinct understanding that does not align with this oral tradition.\n\nUpon reviewing the *Medical and Worldly Achievement Formulae* (医世功诀), I found no annotations, only preserved phonetic readings as recorded. It warns against commentary, stating that prolonged recitation will naturally lead to realization. The original transmission’s profound teachings (玄训) are of utmost subtlety—meant to be grasped intuitively, not conveyed through words.\n\nIn the Daoist tradition, it is said: *\"Sincere recitation for one year makes one a human immortal; for two years, an earthly immortal; for three years, a celestial immortal. Even the least diligent, if they recite daily without interruption, may attain liberation through simulated death (尸解) and ascend the Way.\"* Could this be deception? The only danger lies in lapses in practice.\n\n---",
      "overlap_context": "pture**\n\n*Luo san lan bo, dai qia tai li, tang yun tui ru, lian guang ling du.*\n*Yu luo shu miao, yu fu chao san, zhao sheng tian heng, zhi shi ming qian.*\n*Ting pan bao ji you xuan wo cheng, sha fu yan ming, gui hui he zi.*\n*Cun le xian le, bai fen tian gou, tu cheng yuan ping, mi jie zhang sheng.*\n*Zhang jie lu miao, lai meng long deng, ning xie quan xin, di ni tuo lai.*\n*Namo jue fa, cheng jin you yan, ri yue xing dou, yao xi ming qi.*\n*Fang yuan de qiu, shou zhen gu ling, shou tian di jing.*",
      "start_char": 14042,
      "end_char": 14473,
      "start_sentence": 641,
      "end_sentence": 656,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.856335163116455,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "玉经经力，其可思议乎？ 余今以师传实效，录述于世，惟愿学者纯以调心虚寂入门。 调至胸怀清静，而天都泰定； 调至坤腹通泰，而闾阎富庶； 调至四肢通畅，而四夷安靖。 如是体调而身安，身安而世治，功效捷如响，一经参破，即圣门赞育化功。 并非说妙谈玄，乃是脚踏实地道学。 此人之得与天地并立为三之至理，吾辈有何疑惧，而甘暴弃乎？ 尤恐学者不悟，更将在昔已效功诀，述为祝词，俾持诵之，以同臻实效。 第非一掘得泉，果能人一己百，人十己千，虽愚必明矣。 下文云云，乃是祝词，非经文也。 然功诀具在下文，宜细体行，毋仅口诵。 祝词咒附 我〈吾〉今持诵 此句紧接经文而来，谨按曰吾曰我，而不曰臣，非妄也。 考《诸道》典，人身一小天地，天地有一神，人身亦有之，人身之神灵，天地之神乃应。 盖引吾字，我字，系法家用以结斗讳，非泛泛而称者。 按此玄律，阳日念我字，结以贪斗九星； 阴日念吾字，结以魁斗九星。 法以一笔一星，人知会意以持，阳日念我，阴日念吾而已。 亦自应验者。 人心有七窍，辅以腰肾，小心而成九，是证心与斗一。 盖戒念毋自欺，一当顾諟明命，以示诀惟无妄焉耳。 依教奉行 可见下文所言，皆由实证功夫，以发实用，学者当诚体行，毋仅口诵是嘱。 三才卵守 言视天地如鸡卵，而人世乃在鸡卵黄，我得而守之耳。 此句尚混于喜怒哀乐未发之中也。 世化福庭 按此世字，乃兼身世而言。 庭，即玉经庭盼苞已之庭，此卵守之功用，天地悉皆归之实效也。 耗星退散，福曜照临 此两句，即《大学》所云：“福润屋，德润身，心广体胖，故君子必诚其意。 ” 诸天眷佑，财位信亲 此两句，乃与天地合其德，与日月合其明，四时合其序，鬼神合其吉凶，先天而弗违之道也。 财位，出《内典》，即富贵福泽之意。 信则立，亲则逊，厚其生而正其德也。 观天执天，自新新民 观天者，观其至诚之无息也。 执天者，执其为物之不二也。 自新新民者，本身征民之实效也。 有无不立，人法双忘，圆虚圆寂，圆正圆刚，圆和圆泰，圆觉圆清 此六句，无为而治也，苞存在己之切实真象，犹经文之出于身世，惟常庭盼者，得宅乎中，而觉此圆也。 若初学，先以意识识之，则妄矣，此诀必无成就。 然必知此存此持，始有定力，而功用始足，后效始实。 故门人有恐学者，误以识识，请削此六句，而未许也。 请共喻之。 况此则上一句，乃性天入手之要诀； 次句，又为性功进步之卓识； 以下四句，乃戒有住有所之玄训。 盖有遍六合，尽法界，无或偏倚为得法，是即天之所覆，地之所载，日月所照，霜露所附，有情无情，均被灵光道炁之义。 而所用功，保无泥漏之弊，乃皆全部至要功诀，何可削乎？ 学者宜悉体行，毋忽毋漏。 共扶宗教，不负四恩 按上所事，尽是吾身性分中具有之物。 天地有我，父母生我，君师教我，日月照我，盖谓具有是物，足完我事，而有余也。 故不敢自负，述注功诀，以呈以最，愿为共扶宗教，勉报四恩云。 成大觉世，元亨利贞 按此世字，乃帖一身而言。 盖言成物必先成己，成己功业，不外觉字，而所成业，不外元利亨贞四字云。 下文所述，乃是咒词，律戒注释，不敢渎也。",
      "translated_text": "The power of the *Jade Sutra*—how could it be fathomed? Now, I record its proven efficacy as transmitted by my teacher, offering it to the world. I only wish that learners enter its gate through the pure cultivation of a tranquil and empty heart.\n\nWhen regulated to the point where the chest is clear and still, the celestial realm attains perfect stability. When regulated to the point where the abdomen is open and at ease, the world’s households prosper. When regulated to the point where the four limbs flow freely, the four barbarian lands find peace. Thus, when the body is harmonized, the self is at peace; when the self is at peace, the world is governed. Its effects are swift as an echo—once the sutra is penetrated, it becomes the transformative power of the sage’s gate. This is no mere discourse on subtleties or mysteries, but a grounded and practical study of the Dao.\n\nThis is the supreme principle by which humanity stands as the third alongside heaven and earth. What doubt or fear could we harbor, that we would willingly abandon it? Yet, fearing that learners may not awaken, I have also compiled the proven formulae of past efficacy into an incantation, so that recitation may yield shared results. It is not like digging once to find a spring—if one person achieves tenfold, another a hundredfold, and another a thousandfold, even the dull-witted will surely attain clarity.\n\nWhat follows is the incantation, not the sutra’s text. Yet the formulae are contained below—study them carefully and practice them, not merely reciting with the mouth.\n\n**Incantation (Appended to the Sutra)**\n*\"I/We now recite...\"*\nThis phrase directly follows the sutra’s text. The use of *I* (我) and *we* (吾) rather than *your servant* (臣) is not arbitrary. According to the *Canon of All Daoist Traditions*, the human body is a microcosm of heaven and earth. Just as heaven and earth have their spirits, so does the human body, and the spirit of the human body resonates with that of heaven and earth. The invocation of *I* and *we* here follows the esoteric conventions of ritualists, used to bind the Dipper’s stars—not employed casually.\n\nBy this mystical law: on yang days, recite *I* (我) and bind it to the Nine Stars of the Greedy Wolf Dipper; on yin days, recite *we* (吾) and bind it to the Nine Stars of the Great Dipper. The method involves tracing one star per stroke, and those who understand the intent will recite *I* on yang days and *we* on yin days—this, too, has its verifications.\n\nThe human heart has seven apertures, supported by the waist and kidneys, forming nine in the \"lesser heart\"—this proves the heart’s unity with the Dipper. The precept warns against self-deception: one must heed the luminous mandate, for the formulae’s truth lies solely in its absence of falsehood.\n\n**Follow the teachings and practice accordingly.**\nWhat follows is all derived from verified practice, yielding real effects. Learners must earnestly embody and enact them, not merely recite with the mouth.\n\n**Guard the Three Powers as an egg.**\nThis means regarding heaven and earth as a chicken’s egg, with the human world as its yolk—what we guard. This phrase still resides within the state before joy, anger, sorrow, or delight arise.\n\n**The world transforms into a court of fortune.**\nHere, *world* encompasses both the self and the external realm. *Court* refers to the \"court of the Jade Sutra’s gaze,\" where the egg-guarding practice’s effects manifest fully—heaven and earth yield their tangible results.\n\n**Baneful stars retreat; auspicious radiance descends.**\nThese two lines echo *The Great Learning*: *\"Fortune graces the house, virtue graces the body; the heart expands, the body is at ease—thus the noble person must make their intent sincere.\"*\n\n**All heavens bestow blessings; wealth, rank, trust, and kinship flourish.**\nThese two lines embody the Dao of aligning one’s virtue with heaven and earth, one’s brightness with the sun and moon, one’s order with the four seasons, and one’s fortune with spirits and deities—acting prior to heaven without transgression. *Wealth and rank* derive from Buddhist scriptures, signifying prosperity and honor. *Trust* establishes, *kinship* humbles—nurturing life while rectifying virtue.\n\n**Observe heaven and grasp its constancy; renew the self to renew the people.**\n*Observing heaven* means witnessing its ceaseless sincerity. *Grasping heaven* means holding to its singularity as the source of all things. *Renewing the self to renew the people* is the tangible effect of personal cultivation on the populace.\n\n**Neither existence nor non-existence is established; both human and dharma are forgotten.**\n**Perfect emptiness, perfect stillness; perfect uprightness, perfect strength; perfect harmony, perfect peace; perfect awakening, perfect purity.**\nThese six lines describe governance through non-action, encapsulating the true state of one’s being—just as the sutra’s text arises from the self and the world. Only those who constantly dwell in the \"court of the gaze\" abide at its center and awaken to this perfection. For beginners, attempting to grasp it with the intellect is delusion—no accomplishment will follow. Yet one must know, preserve, and uphold this to develop steadfast power, enabling efficacy and ensuring future results.\n\nThus, some disciples, fearing learners might mistake intellectual understanding for realization, requested these six lines be removed—but I refused. Let all understand: the first line is the essential formula for entering the nature of heaven; the second, the profound insight for advancing in spiritual practice; the remaining four, the esoteric teachings against attachment or partiality. True attainment encompasses the six directions, the entire dharma-realm, without bias—this is the meaning of heaven’s covering, earth’s bearing, the sun and moon’s illumination, frost and dew’s descent, and the radiance of the Dao’s *qi* pervading all, sentient and insentient. The practice guards against stagnation or leakage—these are all vital formulae. How could they be excised? Learners must fully embody and enact them, without negligence or omission.\n\n**Together uphold the teachings, repaying the Four Graces.**\nAll the above pertains to what inherently resides within our nature. Heaven and earth have me; parents gave me life; rulers and teachers instructed me; the sun and moon illuminate me. This means possessing all that is needed to fulfill my duties—and more. Thus, I dare not take it lightly, recording and presenting these formulae to the utmost, wishing to jointly uphold the teachings and strive to repay the Four Graces.\n\n**Perfect great awakening in the world; primal, prosperous, harmonious, and steadfast.**\nHere, *world* refers to the individual. To perfect others, one must first perfect oneself. The work of self-perfection lies in *awakening*, and its achievements are encompassed by the four virtues: *primal, prosperous, harmonious, and steadfast*.\n\nWhat follows is the incantation—its ritual prohibitions and annotations dare not be profaned.",
      "overlap_context": "’s profound teachings (玄训) are of utmost subtlety—meant to be grasped intuitively, not conveyed through words.\n\nIn the Daoist tradition, it is said: *\"Sincere recitation for one year makes one a human immortal; for two years, an earthly immortal; for three years, a celestial immortal. Even the least diligent, if they recite daily without interruption, may attain liberation through simulated death (尸解) and ascend the Way.\"* Could this be deception? The only danger lies in lapses in practice.\n\n---",
      "start_char": 14473,
      "end_char": 15769,
      "start_sentence": 657,
      "end_sentence": 718,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.952747106552124,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "唵，嘈隆（二合）娑诃 按此咒词，乃是佛顶所说一字顶轮王真言，学者持之，三遍三顶立，而行者但自行持而已。 余按全部功诀，总从一念不生入手，行致心清气调，遍体充和地位，则即身世并益，第以恒久为妙。 然能一刻清和，有一刻实德，虽不见效，而效自有焉。 学者切戒有欲速之念，诚恐堕入意识业。 盖人心识，最灵而最魔，一入彀中，闻见纷纭，断不胜断，不可不戒。 学者但自息心静气入手，自得真一元炁发生。 盖此真一元炁，乃自呼吸气静而出，呼吸未静，真一不生也。 然此无他诀，惟有一念不生，则心自静极而呼吸自无矣。 若误用闭字法，是又南辕北辙，息必反促，不可不戒。 夫所谓一念不生者，非竟无念，乃是不杂他念之谓，盖实至诚无息之道也。",
      "translated_text": "Om, Jvalan (two syllables combined) Svāhā.\nThis incantation is the *One-Syllable Crown Wheel King Mantra* spoken by the Buddha’s Crown. Scholars who uphold it should recite it thrice while standing with three prostrations; practitioners need only maintain it in their own conduct.\n\nI observe that the entire corpus of these formulae begins with the absence of a single thought. Proceeding thus, the mind becomes clear and the qi harmonized, attaining a state where the whole body is pervaded by harmony—whereby both this life and the world are benefited. The key lies in constancy.\n\nYet even a single moment of clarity and harmony yields a moment of true virtue. Though no effect may be immediately apparent, the effect is inherently present. Scholars must guard against the desire for hasty results, lest they fall into the karmic snares of consciousness. For the human mind is most numinous yet most demonic; once ensnared, perceptions become chaotic, and severance proves interminable—hence the need for vigilance.\n\nScholars should begin by quieting the mind and settling the qi, thereby allowing the true *Primordial Qi* to arise. This *Primordial Qi* emerges naturally when the breath is stilled; if the breath remains unsettled, the true *Primordial Qi* will not manifest. There is no other method—only the absence of a single thought allows the mind to attain stillness, whereupon the breath naturally ceases.\n\nTo mistakenly employ forced cessation is to pursue the opposite path, causing the breath to become labored instead. This must be avoided. The so-called \"absence of a single thought\" does not mean utter vacuity, but rather the exclusion of extraneous thoughts—it is the Dao of perfect sincerity without interruption.",
      "overlap_context": "to jointly uphold the teachings and strive to repay the Four Graces.\n\n**Perfect great awakening in the world; primal, prosperous, harmonious, and steadfast.**\nHere, *world* refers to the individual. To perfect others, one must first perfect oneself. The work of self-perfection lies in *awakening*, and its achievements are encompassed by the four virtues: *primal, prosperous, harmonious, and steadfast*.\n\nWhat follows is the incantation—its ritual prohibitions and annotations dare not be profaned.",
      "start_char": 15771,
      "end_char": 16073,
      "start_sentence": 719,
      "end_sentence": 729,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.000603914260864,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖师三尼医世说述.txt",
        "category": "藏外"
      }
    }
  ]
}