{
  "source_id": "吕纯阳真人沁园春丹词批注",
  "source_file": "chunked_daozang\\吕纯阳真人沁园春丹词批注.json",
  "total_chunks": 4,
  "total_original_chars": 3541,
  "total_translated_chars": 19552,
  "total_translation_time": 102.6702663898468,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\吕纯阳真人沁园春丹词批注.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Lü Chunyang the Perfected One’s \"Spring in the Garden of Qin\" Elixir Lyric with Annotations**\n\n**Scripture Title:** *Lü Chunyang the Perfected One’s \"Spring in the Garden of Qin\" Elixir Lyric*, originally annotated by Yu Gong of the Yuan Dynasty. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Jade Instructions* Category.\n\n**Annotations by Linwu Shanren Quanyangzi**\n\n**Sevenfold Return Elixir:**\nSeven is the number of fire. The method of elixir refinement first involves the red entering the black to generate the medicine. Once the medicine is obtained, fire is then applied to refine the black into the red, thus forming the elixir—hence the name *Sevenfold Return Elixir*. This does not refer to the seven hours from *yin* to *shen*. As Zhang Ziyang’s *Awakening to Reality* states:\n*\"The Metal Duke was originally the Eastern House’s son,\nSent to the Western neighbor to lodge and grow.\nOnce recognized and called home to be nurtured,\nHe is matched with the maiden to form kinship.\"*\nThis is the meaning here.\n\nFor the practitioner, one must first refine the self and await the proper time. The *Li Sao·Far Roaming* says:\n*\"Let not the soul be disturbed, for it will naturally align;\nThe single qi, most numinous, abides in the midnight hour.\nAbide in emptiness to await it—do nothing before it,\nThis is what it means to refine the self and await the time.\"*\nThe key lies in withdrawing the gaze and returning the hearing, remaining still and unmoving, concentrating the spirit in the Great Void, without a single stray thought. After a moment, the spirit enters the qi, and qi unites with spirit, so that the true breath naturally settles, and numinous clarity naturally arrives—this takes but a brief instant. As Shao Kangjie’s *Primordial Chant* says:\n*\"If asked of the Primordial, a single word is absent,\nOnly in the Posterior does effort become necessary.\"*\nThe elixir method is likewise: seeking the medicine in the Primordial is non-action, while applying fire in the Posterior is action. They cannot be treated as one and the same.\n\n**At the first stirring of the true yang,**\nAs Bai Ziqing’s *Pearl and Jade Collection·Song of the Elixir Marrow* states:\n*\"To refine the elixir, one need not seek the winter solstice,\nFor within the body, a single yang naturally arises.\"*\nHow then do I know when the single yang stirs within the body? It is when, in the snap of a finger, the *xun* gate suddenly opens, and the heart feels a moment of vagueness—that is the time. At this moment, I rouse it with the bellows and forge it with fierce fire, so that true lead emerges from *kan*, and the river chariot does not dare to pause even briefly. It is transported to the summit of Kunlun Peak, where the Return Elixir may then be formed. As Shao Kangjie’s *Vague and Elusive Chant* says:\n*\"Vague and elusive, yin and yang first transform,\nBound and compressed, heaven and earth begin to revolve.\nWithin, a fleeting fine scene appears—\nHow can effort be put into words?\"*\nWithout penetrating insight into the transformations of yin and yang, who could know this?\n\n**As the midnight water-clock endures,**\nMidnight refers to the *zi* hour. The *Zhouyi Cantong Qi* states:\n*\"Embracing the primal in *xu* and *wei*, sowing essence at *zi*,\"*\nand also:\n*\"Between the dark and new moons, the tally moves in accord.\"*\nThis refers to the time before midnight on the fifteenth day of the lunar month, the interval between the dark and new moons. If applied to a single day, then every night before the *zi* hour is the interval between the dark and new moons—it is not restricted to the midnight of the fifteenth day. As the *Awakening to Reality* says:\n*\"The sun and moon meet once every thirty days,\nExchanging time for days, the divine work is made clear.\"*\nThe *water-clock* refers to the dripping clepsydra. There are internal and external clepsydras: the internal is the breath’s exhalation and inhalation. As Xue Zixian’s *Restoration of Life* says:\n*\"This heart is like a fire in chaff,\nIn silent sitting, the sound of the dripping clepsydra is heard.\"*\nThe external is the night watch clepsydra. Some may question the *Awakening to Reality*’s statement:\n*\"One must know that great reclusion dwells in the marketplace,\nDo not seek solitude in the deep mountains,\"*\nnot realizing that in the deep mountains, lamps and clepsydras are hard to come by. Others may ask: Chen Niju’s *Green Void* says:\n*\"If you say the clepsydra is unreliable,\nYou will not grasp the mysterious mechanism, and the medicine will not form,\"*\nyet it also says:\n*\"By day, observe the gnomon; by night, watch the clepsydra—\nThis is a grave error.\"*\nWhy do these statements contradict each other? The answer is: at the beginning of cultivation, when skill is not yet refined, one may err in timing, so an external clepsydra is set as a standard. But when skill is perfected and the elixir field is seeded, essence arises at the proper time, and when the time comes, the spirit knows—even in sleep, one awakens without needing a call. Why then rely on a clepsydra? *Enduring* means its drops follow one another without interruption. Sought within the body, the true breath should be continuous and unbroken, no different from the ceaseless flow of clepsydra water.\n\n**The lead cauldron glows warmly, its light piercing the curtains.**\nLead is the medicine; the cauldron is the lower elixir field. As the *zi* hour approaches, yang qi subtly stirs below—hence the warmth. The *curtains* are the eyes. Lowering the gaze has the appearance of drawn curtains, hence the term. When the elixir field holds the medicine and yang qi rises, it penetrates the space between the brows, producing light. This is like a candle in a room: the light shines through the window, but the brightness is not from the window—it is from the candle. Some, upon suddenly witnessing this scene, may be startled into delight, taking it as something marvelous. But if the heart stirs and the spirit scatters, how can one hope to complete the elixir? Is success not then far off?\n\n**The workings of creation race onward,**\nThis refers to the initial moment before *kun* returns to *fu*. At that time, a single strike of the jade bell opens the twin caves of the Jade Grotto. As the *Restoration of Life* says:\n*\"From both sides they ascend together, sharing a single pound.\"*\n**Tiger and dragon unite in mating,**\nThe *Cantong Qi* states:\n*\"The dragon calls to the tiger, the tiger inhales the dragon’s essence,\nBoth feed upon each other, mutually devouring.\"*\nIn making the elixir, the key is for heart and breath to depend on each other, so that spirit congeals and qi gathers, uniting in mating to form the medicine. As Chen Chaoyuan’s *Book of Jade Mushrooms* says:\n*\"If the mysterious and yellow remain two and do not unite,\nHow can yang fly up from beneath *kan*?\"*\n\nThus, only when yin and yang unite in mating and the elixir forms within the cinnabar field may the firing process begin.\n\n**The firing work follows the constellations Ox, Dipper, Rooftop.**\nOx, Dipper, and Rooftop mark the directional positions of the firing process within the body. This means the firing work begins at *zi* and culminates at *yin*, just as heaven’s creatures take form in the womb at *zi* and emerge at *yin*. The *Cantong Qi* states:\n*\"It begins in the northeast, in the region of Winnowing Basket and Dipper,\nThen turns rightward, the wheel revolving to sprout the germ.\"*\nThe *Cui Xu Pian* says:\n*\"There is a path where mother and child part at birth—\nIts wonder lies in Tail, Winnowing Basket, Ox, and Maiden,\"*\nechoing the same principle. Some interpret Ox, Dipper, and Rooftop as the struggle of *dou* and *wei*, citing the *Wu Zhen Pian*:\n*\"Grasp with both hands and force them to fight to the death,\"*\nto elucidate the point—another valid reading.\n\n**By Qujiang’s banks, the moon’s radiance gleams bright,**\nThe *Cui Xu Pian* says:\n*\"On the southwest path, the moon’s radiance shines—\nThe great elixir is born from this place.\nRecall the ancient verse:\n*By Qujiang’s banks, the magpie bridge spans the sky.*\"*\nAncient immortals identified the nine coils and twelve bends of the small intestine as Qujiang; later adepts also applied the term to the space between nose and mouth. Both interpretations hold. Yet the *Cui Xu* further clarifies its meaning through the southwest path—truly profound and illuminating. The southwest corresponds to *kun*, the abdomen. When the elixir forms in the cinnabar field, intestinal *qi* ascends, illuminating the eyes with light. Thus, from the eyes to the navel, the entire path shimmers with an empty, luminous whiteness like the moon’s radiance.\n\n**A crow takes flight.**\nWhen a crow takes flight, it signifies the union of heaven and earth within the body, the merging of *kan* and *li*, as the two *qi* intertwine and condense into a single dewdrop that alights in the cinnabar field. Chen Xiyi’s *Zhi Xuan Pian* says:\n*\"A crow flies into the osmanthus palace.\"*\nThe *Cui Xu Pian* states:\n*\"The red lotus holds the elixir—\nDewdrops congeal into jade,\nDripping drop by drop into the flowery pond.\"*\nThe *Zhu Yu Ji*’s *Huan Yuan Pian* says:\n*\"One who grasps this truth\nWill see a single drop fall into the Yellow Court.\"*\nBai Ziqing’s verse reads:\n*\"Now I see through it—\nThe golden crow flies into the toad’s cavern.\"*\nAll express this same meaning.\n\n**Then, of one’s own accord, one drinks the *daogui*.**\nMedical texts speak of the *fangcun bi* and the *daogui*. The *daogui* refers to the merest speck at the tip of a knife’s edge. Some interpret the knife as metal and the *gui* as the union of two earths—an overly elaborate reading, not the ultimate teaching. \"Drinking of one’s own accord\" means traversing the three palaces before descending into the mouth, aligning with the *Wu Zhen Pian*:\n*\"Shedding the embryo to enter the mouth, the body attains sagehood.\"*\nSome doubt: if the embryo has already been shed, why return to the mouth? They mistakenly believe the elixir comes from without, swallowing external substances—far from the Dao. Does not the *Cui Xu Pian* say:\n*\"Gather and refine it, though but for a moment—\nA single breath, faint yet boundless, passes through the three barriers.\nThe *qi* flows endlessly through the three barriers,\nA white pulse ascending to the mud-pill palace.\nAbove the mud-pill palace stands the purple-gold crucible,\nWithin it, a lump of purple gold—\nTransformed into jade nectar, it flows into the mouth,\nFragrant, sweet, and refreshing across the tongue.\"*\nCould this come from outside oneself? Who would believe that the *wu* is nurtured from nothing?\n\nThe Great Way of the Golden Elixir is most simple and most easy, giving rise to being from non-being and nurturing the infant within. Such things as nasal mucus, saliva, essence, fluids, *qi*, and blood may serve only as auxiliary aids or stepping stones—they are not the substance of the elixir. Scholars, confined by their narrow views, often cling to preconceived notions and refuse to study the elixir texts further. Even when a true adept seeks to enlighten them, who would believe it?\n\nThe *Cui Xu Pian* says:\n*\"A strange thing makes men laugh and turn their heads—\nNow even the male *wu* can conceive an embryo.\nOne’s own essence and blood conjoin of themselves,\nWithin the body, husband and wife are wondrous indeed!\"*\nFor \"husband and wife\" are but alternate names for *yin* and *yang*—there is no true husband or wife. Yet some stubbornly adhere to the saying \"mending bamboo with bamboo,\" believing in \"supplementing man with man,\" and thus fix their minds on the perverse practices of the Three Peaks. How can they then trust that the Golden Elixir is the Dao of pure non-action, truly giving rise to being from non-being?\n\n**Discerning the clarity and turbidity of the water’s source:**\nThe distinction between clear and turbid has been discussed before. One view holds that heaven is clear and earth turbid by nature; another, that drawing the clear and discarding the turbid is even more profound. Today, regarding the clarity and turbidity of the water’s source, let us examine the term \"water source\" itself. As \"heaven’s one gives rise to water,\" its position lies in the north, where all waters converge—hence it is called the water source. The *Cui Xu Pian* says: *\"Hasten to gather the hundred vessels and return them to the source,\"* referring precisely to this. That which is above is called clear; that which is below, turbid. At first, above and below intermingle, blending into one. Over time, they gradually settle and gradually clarify, until supreme joy arises within.\n\nLiu Haichan’s *Returning Gold* says: *\"When the water stills, it congeals into amber.\"* As for the theory of retaining the clear and discarding the turbid, that is another matter. In my commentary on the *Cantong Qi*, I have already explained in detail that the bodily form becomes like ashes or dust, resembling the fine dust on a bright window—here I shall not repeat it.\n\n**Wood and metal separated by a barrier:**\nWithin the human body, there is one thing divided into two: that which floats is wood, and that which sinks is metal. One lies in the east, the other in the west—hence they are said to be separated by a barrier. If one grasps the mechanism of the Dipper’s handle and employs the *qian* trigram to make them circulate above and below like the flowing of the Celestial River, then the nature of wood will love metal, and the essence of metal will long for wood, and *xing* and *de* will unite without separation.\n\nSome claim that when the two eyes’ light converges at the center, wood and metal are no longer separated—this is one interpretation. Yet when examined against the *Cantong Qi* and *Wuzhen Pian*, the meaning of \"wood and metal separated by a barrier\" lies within, not without. Without a teacher’s guidance, how could one ever know?\n\nThe *Wuzhen Pian* says:\n*\"Though your wisdom surpasses Yan and Min,\nWithout meeting a true adept, do not force your guesses.\"*\nFor the elixir texts often employ metaphors to clarify principles or establish symbols to convey meaning. Their terms and concepts differ, and when scholars read them abruptly, they are often left bewildered, like one gazing at the ocean.\n\nTake the five phases, for example: sometimes they speak of metal and wood, sometimes metal and earth, sometimes water and fire, sometimes metal and fire, sometimes metal and water, sometimes wood and fire, sometimes water and earth. This leaves one’s mind and eyes dazzled—truly not easy to comprehend.\n\n**The essential subtleties of the Dao:**\nThe essentials of the elixir Way are two: *jiaogou* (union) and *jinhuo* (advancing the fire). Though they follow a sequence, they are in truth a single effort. Xiao Zixu’s *Great Compendium of the Golden Elixir* says: *\"The work within the moment is wondrously subtle.\"* Profound indeed! Subtle indeed! The heavenly mechanism runs deep and far.\n\nThe \"heavenly mechanism\" refers to the moment when *zi*-yang first stirs at midnight. As the heavenly mechanism approaches, if one can rouse their own mechanism to respond, then heaven and human unite in activation, inner and outer align, and the elixir coalesces. Though it is said that any of the twelve hours’ junctions may serve, the ancient immortals invariably used the moment when *zi*-yang first stirs at midnight, for at that time the great yang is precisely in the north, and the qi in the human body reaches the *Weilü* Pass—thus resonating with heaven and earth. This is what is meant by \"stealing from heaven and earth, seizing the workings of creation,\" and only at this time is it so. By the *chou* hour, the great yang has already shifted, and the qi in the human body has passed the *Weilü* Pass. By the *yin* hour, the great yang has emerged from the earth, and the qi in the human body has passed the *Shentang*. Neither may be used. *The Jade Mushroom Scripture* states: \"In refining the elixir, one must kindle the fire in accord with the *zi*-hour yang qi; only then is the fire complete. If kindled at any other time, the fire is imperfect.\" These words exhaust the matter.\n\nTo begin practice is already too late. \"To begin\" refers to the moment of refinement, when one gathers the spirit of the entire body into the *Tiangu* Cavity and does not let it stray—this is not a matter of literal grasping. Some may cling to the phrase \"to begin,\" taking it to align with the *Awakening to Reality*’s line, \"Seize with both hands and force them into mortal combat.\" Thus they strain with clenched fists, or cover their ears and nose, or rub their waist and abdomen, or press their thumbs into their palms, or press their middle fingers against their navel—is this not labor in vain? \"To begin practice is already too late\" speaks to the swift passage of time and the urgency of timely cultivation.\n\nThe path to Penglai relies on the fulfillment of three thousand deeds before one may stride upon the clouds and return. \"Three thousand deeds\" refers to nine years of three thousand days. Within these three thousand days, one must accumulate merit and deeds, never straying from the Dao for even a moment in the twelve hours. Liu Xugu’s *Returning Elixir Chapters* says: \"Great work nears completion in three thousand days; wondrous practice knows no lack in the twelve hours.\" The elixir method: the embryo forms in an instant, the work proves efficacious in a hundred days, the embryo rounds in a year, and the deeds fulfill in nine years—all proceed by degrees. There is no principle by which one may meet a master today and become an immortal tomorrow.\n\nKnow that in one year there is small attainment, and in nine years a great transformation: first the qi is refined, then the blood, then the vessels, then the flesh, then the marrow, then the sinews, then the bones, then the hair, then the form. After nine years and nine transformations, yin qi is fully refined into pure yang, and only then may one leave the world behind, transcend the mortal realm, and ascend as an immortal. Zeng Zhiyou’s *Collected Biographies of Immortals* records Chen Chaoyuan’s admonition to the world: \"Those who do good deeds will surely enjoy blessings; those who accumulate hidden virtue will see their descendants flourish. To cherish heaven’s gifts, not indulge in theft or deceit, and not destroy the true teaching—these are good deeds. To save the dying, aid the suffering, rush to others’ distress, and never harbor hidden malice—these are hidden virtues. Without good deeds or hidden virtue, the paths of evil will find entry everywhere.\" Chaoyuan’s words were meant for the common folk—how much more do they apply to those who study immortality?\n\nIn general, to cultivate the Dao of immortality, one must first cultivate the human Dao. If the human Dao is not cultivated, the Dao of immortality remains distant. Have you not seen the *Awakening to Reality*’s words: \"The great medicine is cultivated with ease or difficulty—it depends on me, or on heaven\"? Without accumulating deeds and bestowing hidden virtue, obstacles and demons will arise at every turn. How can scholars take the saying \"my life is in my own hands\" as an excuse and not treat the accumulation of merit as urgent?\n\nAlas! When three thousand deeds are fulfilled, one becomes an immortal of the Great Veil. When eight hundred deeds are fulfilled, one becomes a guest of the Great Veil. Let our fellowship strive together.\n\n**Commentary on Lü Chunyang’s True Person’s \"Spring in the Garden of Qin\" Elixir Verse Concluded**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "吕纯阳真人沁园春丹词注解 经名：吕纯阳真人沁园春丹词元俞攻撰。 注解。 一卷。 底本出处：《正统道藏》洞真部玉诀类。 吕纯阳真人沁园春丹词注解 林屋山人全阳子注解 七返还丹， 七，火数也，炼丹之法，其先以红投黑而生药，既有药，然后进火炼黑入红而成丹，故日七返还丹。 即非自寅至申之七时也。 张紫阳《悟真篇》云：金公本是束家子，送在西邻寄体生，认得唤来归舍养，配将妮女作亲情。 是此义也。 在人先须炼己待时。 《离骚·远游篇》云：毋滑而魂兮彼将自然，一气孔神兮於中夜，存虚以待之兮无为之先，即炼己待时之谓也。 要在收视返听，寂然不动，凝神於太虚，无一毫杂想。 少焉神入气中，气与神合，则真息自定，神明自来，不过片饷问耳。 邵康节《先天吟》云：若问先天一字无，后天方要着功夫。 丹法亦然，探药於先天则无为，进火於后天则有为。 不可以一律齐也。 正一阳初动， 白紫清《珠玉集·丹髓歌》云：炼丹不用寻冬至，身中自有一阳生。 然吾何以知身中之一阳生也？ 盖弹指声中巽门豁开，而心觉恍惚之时是也。 吾於此时鼓之以豪钥，缎之以猛火，则真铅出坎，而河车不敢暂留停，运入昆仑峰顶，乃可以为还丹。 邵康节《恍惚吟》云：恍惚阴阳初变化，捆缢天地乍回旋，中问些子好光景，安得功夫入语言。 非洞晓阴阳造化，畴克知此。 中宵漏永， 中宵，即半夜子时也。 《周易参同契》云：含元虚危，播精於子，是也。 又云：晦朔之间合符行，中谓三十日半夜子时之前，介乎晦朔之间也。 若蹙之於一日，则每夜子时之前即晦朔之问，初不拘於三十日之半夜也。 《悟真篇》云：日月三旬一遇逢，以时易日法神功，其说明矣。 漏者，滴漏也。 滴漏有内有外，在内乃气之出入息也，薛紫贤《复命篇》云：此心却似糠灰火，静坐时闻滴漏声是也。 在外即更漏也。 或疑《悟真篇》有须知大隐居朝市，休向深山守静孤之说，殊不知在深山则难得灯与漏也。 或又疑日：陈泥九《翠虚篇》云：若言刻漏无凭信，不会玄机药未成。 而又云：日视土圭，夜瞻刻漏，谬之甚矣。 何其说之自相戾也？ 日：修炼之初，功夫未纯熟，恐或差违，故叉外立刻漏以为时侯之准则，若至於功夫纯熟，丹田有种，则精生有时，时至神知，虽当寝寐，有不待吹醒而亦自觉悟，又何叉刻漏为哉。 漏永者，言其点点相　续而无问断也。 在吾身求之，则真息绵绵勿令间断，如漏水之相续无异也。 温温铅鼎光透帘帷。 铅即药也，鼎谓下丹田也。 子时将至，而阳气潜萌於其下，所以温温也。 帘帷者，眼也。 垂眼下视，有垂帘之象，故日帘帷。 丹田有药而阳气上升，透於两眉之间，是以有光。 譬之，室中有烛，烛光映於窗牖而明，盖非窗牖之明，乃烛之明也。 或者乍见此景，而惊讶失喜，以为奇异，则心动而神散矣。 欲望成丹，不亦远乎？ 造化争驰， 造化争驰，谓坤之未复之初也。 其时琼钟一扣，玉洞双开，《复命篇》谓：两畔同升共一斤是也。 虎龙交媾， 《参同契》云：龙呼於虎，虎吸龙精，两相饮食j俱相吞并。 作丹之时，要在心息相依，然后神凝气聚，交媾而为药。 陈朝元《玉芝书》云：玄黄若二也无交媾，争得阳从坎下飞。",
      "translated_text": "**Lü Chunyang the Perfected One’s \"Spring in the Garden of Qin\" Elixir Lyric with Annotations**\n\n**Scripture Title:** *Lü Chunyang the Perfected One’s \"Spring in the Garden of Qin\" Elixir Lyric*, originally annotated by Yu Gong of the Yuan Dynasty. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Jade Instructions* Category.\n\n**Annotations by Linwu Shanren Quanyangzi**\n\n**Sevenfold Return Elixir:**\nSeven is the number of fire. The method of elixir refinement first involves the red entering the black to generate the medicine. Once the medicine is obtained, fire is then applied to refine the black into the red, thus forming the elixir—hence the name *Sevenfold Return Elixir*. This does not refer to the seven hours from *yin* to *shen*. As Zhang Ziyang’s *Awakening to Reality* states:\n*\"The Metal Duke was originally the Eastern House’s son,\nSent to the Western neighbor to lodge and grow.\nOnce recognized and called home to be nurtured,\nHe is matched with the maiden to form kinship.\"*\nThis is the meaning here.\n\nFor the practitioner, one must first refine the self and await the proper time. The *Li Sao·Far Roaming* says:\n*\"Let not the soul be disturbed, for it will naturally align;\nThe single qi, most numinous, abides in the midnight hour.\nAbide in emptiness to await it—do nothing before it,\nThis is what it means to refine the self and await the time.\"*\nThe key lies in withdrawing the gaze and returning the hearing, remaining still and unmoving, concentrating the spirit in the Great Void, without a single stray thought. After a moment, the spirit enters the qi, and qi unites with spirit, so that the true breath naturally settles, and numinous clarity naturally arrives—this takes but a brief instant. As Shao Kangjie’s *Primordial Chant* says:\n*\"If asked of the Primordial, a single word is absent,\nOnly in the Posterior does effort become necessary.\"*\nThe elixir method is likewise: seeking the medicine in the Primordial is non-action, while applying fire in the Posterior is action. They cannot be treated as one and the same.\n\n**At the first stirring of the true yang,**\nAs Bai Ziqing’s *Pearl and Jade Collection·Song of the Elixir Marrow* states:\n*\"To refine the elixir, one need not seek the winter solstice,\nFor within the body, a single yang naturally arises.\"*\nHow then do I know when the single yang stirs within the body? It is when, in the snap of a finger, the *xun* gate suddenly opens, and the heart feels a moment of vagueness—that is the time. At this moment, I rouse it with the bellows and forge it with fierce fire, so that true lead emerges from *kan*, and the river chariot does not dare to pause even briefly. It is transported to the summit of Kunlun Peak, where the Return Elixir may then be formed. As Shao Kangjie’s *Vague and Elusive Chant* says:\n*\"Vague and elusive, yin and yang first transform,\nBound and compressed, heaven and earth begin to revolve.\nWithin, a fleeting fine scene appears—\nHow can effort be put into words?\"*\nWithout penetrating insight into the transformations of yin and yang, who could know this?\n\n**As the midnight water-clock endures,**\nMidnight refers to the *zi* hour. The *Zhouyi Cantong Qi* states:\n*\"Embracing the primal in *xu* and *wei*, sowing essence at *zi*,\"*\nand also:\n*\"Between the dark and new moons, the tally moves in accord.\"*\nThis refers to the time before midnight on the fifteenth day of the lunar month, the interval between the dark and new moons. If applied to a single day, then every night before the *zi* hour is the interval between the dark and new moons—it is not restricted to the midnight of the fifteenth day. As the *Awakening to Reality* says:\n*\"The sun and moon meet once every thirty days,\nExchanging time for days, the divine work is made clear.\"*\nThe *water-clock* refers to the dripping clepsydra. There are internal and external clepsydras: the internal is the breath’s exhalation and inhalation. As Xue Zixian’s *Restoration of Life* says:\n*\"This heart is like a fire in chaff,\nIn silent sitting, the sound of the dripping clepsydra is heard.\"*\nThe external is the night watch clepsydra. Some may question the *Awakening to Reality*’s statement:\n*\"One must know that great reclusion dwells in the marketplace,\nDo not seek solitude in the deep mountains,\"*\nnot realizing that in the deep mountains, lamps and clepsydras are hard to come by. Others may ask: Chen Niju’s *Green Void* says:\n*\"If you say the clepsydra is unreliable,\nYou will not grasp the mysterious mechanism, and the medicine will not form,\"*\nyet it also says:\n*\"By day, observe the gnomon; by night, watch the clepsydra—\nThis is a grave error.\"*\nWhy do these statements contradict each other? The answer is: at the beginning of cultivation, when skill is not yet refined, one may err in timing, so an external clepsydra is set as a standard. But when skill is perfected and the elixir field is seeded, essence arises at the proper time, and when the time comes, the spirit knows—even in sleep, one awakens without needing a call. Why then rely on a clepsydra? *Enduring* means its drops follow one another without interruption. Sought within the body, the true breath should be continuous and unbroken, no different from the ceaseless flow of clepsydra water.\n\n**The lead cauldron glows warmly, its light piercing the curtains.**\nLead is the medicine; the cauldron is the lower elixir field. As the *zi* hour approaches, yang qi subtly stirs below—hence the warmth. The *curtains* are the eyes. Lowering the gaze has the appearance of drawn curtains, hence the term. When the elixir field holds the medicine and yang qi rises, it penetrates the space between the brows, producing light. This is like a candle in a room: the light shines through the window, but the brightness is not from the window—it is from the candle. Some, upon suddenly witnessing this scene, may be startled into delight, taking it as something marvelous. But if the heart stirs and the spirit scatters, how can one hope to complete the elixir? Is success not then far off?\n\n**The workings of creation race onward,**\nThis refers to the initial moment before *kun* returns to *fu*. At that time, a single strike of the jade bell opens the twin caves of the Jade Grotto. As the *Restoration of Life* says:\n*\"From both sides they ascend together, sharing a single pound.\"*\n**Tiger and dragon unite in mating,**\nThe *Cantong Qi* states:\n*\"The dragon calls to the tiger, the tiger inhales the dragon’s essence,\nBoth feed upon each other, mutually devouring.\"*\nIn making the elixir, the key is for heart and breath to depend on each other, so that spirit congeals and qi gathers, uniting in mating to form the medicine. As Chen Chaoyuan’s *Book of Jade Mushrooms* says:\n*\"If the mysterious and yellow remain two and do not unite,\nHow can yang fly up from beneath *kan*?\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1265,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.335917949676514,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\吕纯阳真人沁园春丹词批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故叉阴阳交媾，丹田有药，乃可以进火也。 进火功夫牛斗危。 牛、斗、危，乃身中火候之方位。 谓进火功夫自子而发端，至寅而搬运，如天之生物，胚胎於子，至寅而出也。 《参同契》云：始於束北箕斗之乡，旋而右转，呕轮吐萌。 《翠虚篇》云：有一子母分胎路，妙在尾箕斗牛女，与此同旨。 或以牛斗危为犹斗危，而引用《悟真篇》两手捉来令死斗之语，以发明之，是亦一说也。 曲江上见月华莹争， 《翠虚篇》云：西南路上月华明，大药还从此处生，记得古人诗一句，曲江之上鹊桥横。 古仙本以小肠有九盘十二曲，是为曲江，后人复以鼻口之问为曲江，二说俱通。 而《翠虚》又以西南路上发明其说，可谓深切着明矣。 盖西南属坤，坤为腹，药生於丹田之时，肠气上达，丽於目而有光，故自目至脐一路，皆虚白晃耀如月华之明也。 有个乌飞。 有个乌飞者，身中之天地交，坎离合，二气捆缢结成一滴露珠，而飞落丹田中也。 陈希夷《指玄篇》云：有个乌飞入桂官。 《翠虚篇》云：红莲含药，露珠凝碧，飞落华池滴滴。 《珠玉集·还源篇》云：人能明此理，一点落黄庭。 白紫清词云：而今识破金乌飞入蟾窟，皆此义也。 当时自饮刀圭， 医书言方寸匕，又言刀圭。 刀圭者，刀头圭角些子而已，或以刀为金，圭为二土交合，此乃求奇之说，非至论也。 自饮云者，遍历三官降而入口，与《悟真篇》谓：脱胎入口身通圣，其义一也。 或疑既脱胎何为复入口，遂以为丹自外来，从而吞咽外物，去道远矣。 《翠虚篇》不云乎：探之炼之未片饷，一气眇眇通三关，三关来往气无穷，一道白脉朝泥九，泥九之上紫金鼎，鼎中一块紫金团，化为玉浆流入口，香甜清爽遍舌端。 是岂自身外而来者耶？ 又谁信无中养就兄。",
      "translated_text": "Thus, only when yin and yang unite in mating and the elixir forms within the cinnabar field may the firing process begin.\n\n**The firing work follows the constellations Ox, Dipper, Rooftop.**\nOx, Dipper, and Rooftop mark the directional positions of the firing process within the body. This means the firing work begins at *zi* and culminates at *yin*, just as heaven’s creatures take form in the womb at *zi* and emerge at *yin*. The *Cantong Qi* states:\n*\"It begins in the northeast, in the region of Winnowing Basket and Dipper,\nThen turns rightward, the wheel revolving to sprout the germ.\"*\nThe *Cui Xu Pian* says:\n*\"There is a path where mother and child part at birth—\nIts wonder lies in Tail, Winnowing Basket, Ox, and Maiden,\"*\nechoing the same principle. Some interpret Ox, Dipper, and Rooftop as the struggle of *dou* and *wei*, citing the *Wu Zhen Pian*:\n*\"Grasp with both hands and force them to fight to the death,\"*\nto elucidate the point—another valid reading.\n\n**By Qujiang’s banks, the moon’s radiance gleams bright,**\nThe *Cui Xu Pian* says:\n*\"On the southwest path, the moon’s radiance shines—\nThe great elixir is born from this place.\nRecall the ancient verse:\n*By Qujiang’s banks, the magpie bridge spans the sky.*\"*\nAncient immortals identified the nine coils and twelve bends of the small intestine as Qujiang; later adepts also applied the term to the space between nose and mouth. Both interpretations hold. Yet the *Cui Xu* further clarifies its meaning through the southwest path—truly profound and illuminating. The southwest corresponds to *kun*, the abdomen. When the elixir forms in the cinnabar field, intestinal *qi* ascends, illuminating the eyes with light. Thus, from the eyes to the navel, the entire path shimmers with an empty, luminous whiteness like the moon’s radiance.\n\n**A crow takes flight.**\nWhen a crow takes flight, it signifies the union of heaven and earth within the body, the merging of *kan* and *li*, as the two *qi* intertwine and condense into a single dewdrop that alights in the cinnabar field. Chen Xiyi’s *Zhi Xuan Pian* says:\n*\"A crow flies into the osmanthus palace.\"*\nThe *Cui Xu Pian* states:\n*\"The red lotus holds the elixir—\nDewdrops congeal into jade,\nDripping drop by drop into the flowery pond.\"*\nThe *Zhu Yu Ji*’s *Huan Yuan Pian* says:\n*\"One who grasps this truth\nWill see a single drop fall into the Yellow Court.\"*\nBai Ziqing’s verse reads:\n*\"Now I see through it—\nThe golden crow flies into the toad’s cavern.\"*\nAll express this same meaning.\n\n**Then, of one’s own accord, one drinks the *daogui*.**\nMedical texts speak of the *fangcun bi* and the *daogui*. The *daogui* refers to the merest speck at the tip of a knife’s edge. Some interpret the knife as metal and the *gui* as the union of two earths—an overly elaborate reading, not the ultimate teaching. \"Drinking of one’s own accord\" means traversing the three palaces before descending into the mouth, aligning with the *Wu Zhen Pian*:\n*\"Shedding the embryo to enter the mouth, the body attains sagehood.\"*\nSome doubt: if the embryo has already been shed, why return to the mouth? They mistakenly believe the elixir comes from without, swallowing external substances—far from the Dao. Does not the *Cui Xu Pian* say:\n*\"Gather and refine it, though but for a moment—\nA single breath, faint yet boundless, passes through the three barriers.\nThe *qi* flows endlessly through the three barriers,\nA white pulse ascending to the mud-pill palace.\nAbove the mud-pill palace stands the purple-gold crucible,\nWithin it, a lump of purple gold—\nTransformed into jade nectar, it flows into the mouth,\nFragrant, sweet, and refreshing across the tongue.\"*\nCould this come from outside oneself? Who would believe that the *wu* is nurtured from nothing?",
      "overlap_context": "d.\"*\n**Tiger and dragon unite in mating,**\nThe *Cantong Qi* states:\n*\"The dragon calls to the tiger, the tiger inhales the dragon’s essence,\nBoth feed upon each other, mutually devouring.\"*\nIn making the elixir, the key is for heart and breath to depend on each other, so that spirit congeals and qi gathers, uniting in mating to form the medicine. As Chen Chaoyuan’s *Book of Jade Mushrooms* says:\n*\"If the mysterious and yellow remain two and do not unite,\nHow can yang fly up from beneath *kan*?\"*",
      "start_char": 1265,
      "end_char": 1959,
      "start_sentence": 58,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.651060581207275,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\吕纯阳真人沁园春丹词批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "金丹大道，至简至易，於无中生有，养就婴儿。 如涕唾精津气血液之类，止可接助玖为阶梯，非丹质也。 学者局於管见，往往以先入之说为主，更不肯参究丹书，虽有道者欲与开发，孰为之信。 《翠虚篇》云：怪事教人笑瓮回，男兄今也会怀胎，自家精血自交结，身裹夫妻是妙哉。 盖夫妇即阴阳之异名，非真有所谓夫妇也。 或者偏执竹破竹补之说，遂谓以人补人，而专意於三峰邪卫，又安信金丹乃清李无为之道，而果於无中生有哉。 辩水源清浊， 清浊之说盖尝辩之矣。 一日天清地浊禀生成，一日取清拾浊更玄玄。 今日水源清浊，则请就水源两字辫之。 盖天一生水，其位居北，以入水同归於此，故谓之水源。 《翠虚篇》云：促将百脉尽归源，盖谓此也。 在上日清，在下日浊，始者上下相交，混而为一，久之则渐渐订渐渐清清，则至乐生於其中矣。 刘海蟾《还金篇》谓：水澄凝琥珀是也。 乃若留清去浊之说，则自是一义，愚注《参同契》於形体为灰土、状若明窗尘下，已详言之，兹不复赘。 木金问隔。 人身有一物分而为二，其浮者为木，沉者为金，一束一西，故谓之问隔。 若得斗柄之机，干运使之上下循环，如天河之流转，则木性爱金，金情恋木，而刑德并会不间隔矣。 彼有以两目交光於中央，为金木不问隔，此亦一说。 然以《参同契》、《悟真篇》考之则所谓金木问隔者，其义盖在内而不在外也。 不因师指此事争知， 《悟真篇》云：饶君聪慧过颜闵，不遇真人莫强猜。 盖丹经所陈，或假物以明理，或设象以寓意，名义不同，学者卒然读之，莫不有望洋之欺。 且以五行言之，或日金木，或日金土，或日水火，或日金火，或日金水，或日木火，或日水土，使人心目俱眩，诚不易知也。 道要玄微，丹道之要有二：日交媾，日进，火。 虽有先后次序，要皆一片功夫。 萧紫虚《金丹大成集》谓：刻裹功夫妙更奇是也。 玄哉微哉。 天机深远。",
      "translated_text": "The Great Way of the Golden Elixir is most simple and most easy, giving rise to being from non-being and nurturing the infant within. Such things as nasal mucus, saliva, essence, fluids, *qi*, and blood may serve only as auxiliary aids or stepping stones—they are not the substance of the elixir. Scholars, confined by their narrow views, often cling to preconceived notions and refuse to study the elixir texts further. Even when a true adept seeks to enlighten them, who would believe it?\n\nThe *Cui Xu Pian* says:\n*\"A strange thing makes men laugh and turn their heads—\nNow even the male *wu* can conceive an embryo.\nOne’s own essence and blood conjoin of themselves,\nWithin the body, husband and wife are wondrous indeed!\"*\nFor \"husband and wife\" are but alternate names for *yin* and *yang*—there is no true husband or wife. Yet some stubbornly adhere to the saying \"mending bamboo with bamboo,\" believing in \"supplementing man with man,\" and thus fix their minds on the perverse practices of the Three Peaks. How can they then trust that the Golden Elixir is the Dao of pure non-action, truly giving rise to being from non-being?\n\n**Discerning the clarity and turbidity of the water’s source:**\nThe distinction between clear and turbid has been discussed before. One view holds that heaven is clear and earth turbid by nature; another, that drawing the clear and discarding the turbid is even more profound. Today, regarding the clarity and turbidity of the water’s source, let us examine the term \"water source\" itself. As \"heaven’s one gives rise to water,\" its position lies in the north, where all waters converge—hence it is called the water source. The *Cui Xu Pian* says: *\"Hasten to gather the hundred vessels and return them to the source,\"* referring precisely to this. That which is above is called clear; that which is below, turbid. At first, above and below intermingle, blending into one. Over time, they gradually settle and gradually clarify, until supreme joy arises within.\n\nLiu Haichan’s *Returning Gold* says: *\"When the water stills, it congeals into amber.\"* As for the theory of retaining the clear and discarding the turbid, that is another matter. In my commentary on the *Cantong Qi*, I have already explained in detail that the bodily form becomes like ashes or dust, resembling the fine dust on a bright window—here I shall not repeat it.\n\n**Wood and metal separated by a barrier:**\nWithin the human body, there is one thing divided into two: that which floats is wood, and that which sinks is metal. One lies in the east, the other in the west—hence they are said to be separated by a barrier. If one grasps the mechanism of the Dipper’s handle and employs the *qian* trigram to make them circulate above and below like the flowing of the Celestial River, then the nature of wood will love metal, and the essence of metal will long for wood, and *xing* and *de* will unite without separation.\n\nSome claim that when the two eyes’ light converges at the center, wood and metal are no longer separated—this is one interpretation. Yet when examined against the *Cantong Qi* and *Wuzhen Pian*, the meaning of \"wood and metal separated by a barrier\" lies within, not without. Without a teacher’s guidance, how could one ever know?\n\nThe *Wuzhen Pian* says:\n*\"Though your wisdom surpasses Yan and Min,\nWithout meeting a true adept, do not force your guesses.\"*\nFor the elixir texts often employ metaphors to clarify principles or establish symbols to convey meaning. Their terms and concepts differ, and when scholars read them abruptly, they are often left bewildered, like one gazing at the ocean.\n\nTake the five phases, for example: sometimes they speak of metal and wood, sometimes metal and earth, sometimes water and fire, sometimes metal and fire, sometimes metal and water, sometimes wood and fire, sometimes water and earth. This leaves one’s mind and eyes dazzled—truly not easy to comprehend.\n\n**The essential subtleties of the Dao:**\nThe essentials of the elixir Way are two: *jiaogou* (union) and *jinhuo* (advancing the fire). Though they follow a sequence, they are in truth a single effort. Xiao Zixu’s *Great Compendium of the Golden Elixir* says: *\"The work within the moment is wondrously subtle.\"* Profound indeed! Subtle indeed! The heavenly mechanism runs deep and far.",
      "overlap_context": " it, though but for a moment—\nA single breath, faint yet boundless, passes through the three barriers.\nThe *qi* flows endlessly through the three barriers,\nA white pulse ascending to the mud-pill palace.\nAbove the mud-pill palace stands the purple-gold crucible,\nWithin it, a lump of purple gold—\nTransformed into jade nectar, it flows into the mouth,\nFragrant, sweet, and refreshing across the tongue.\"*\nCould this come from outside oneself? Who would believe that the *wu* is nurtured from nothing?",
      "start_char": 1960,
      "end_char": 2712,
      "start_sentence": 84,
      "end_sentence": 112,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.575218439102173,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\吕纯阳真人沁园春丹词批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "天机，谓半夜子阳初动之时也。 天机将至，人能动吾之机以应之，则天人合发，内外相符结而为丹矣。 虽日一日十二时，几相交处亦皆可为，而古仙叉用半夜子阳初动之时者，其时太阳正在北方，而人身气到尾闲关，盖与天地相应，所谓盗天地、夺造化，唯此时为然。 乃若丑时，则太阳已偏，人身之气已过尾闲矣。 寅时则太阳已出地，人身之气已过肾堂矣。 皆不可用也。 《玉芝书》云：凡炼丹，随子时阳气而起火，其火方然，余外别时起火，其火不全。 斯言尽之矣。 下手速修犹太迟， 下手，谓烹炼之时，握一身之神归於天谷穴中，而不可纵放，非真有所执也。 或泥、下手两字正合《悟真篇》两手捉来令死斗之说，於是努力提拳，或掩耳鼻，或摩腰腹，或以大指拾掌心，或以中指抵脐轮，不亦劳乎？ 速修犹太迟，谓光阴迅速。 而贵乎及时修炼也。 蓬莱路仗三千行满，独步云归。 三千行满，谓九年三千日也。 三千日内，务要积功累行，十二时中不可须臾离道。 刘虚谷《还丹篇》云：大功欲就三千日，妙用无亏十二时是也。 丹法：片饷结胎，百日而功灵，周年而胎圆，九年而行满，皆有程度，次无今日遇师，明日便能成仙之理。 当知一年而小成，九年而大变，始而易气，次而易血，次而易脉，次而易肉，次而易髓，次而易筋，次而易骨，次而易发，次而易形，积九年而阅九变，炼尽阴气变成纯阳，然后可以遗世独立，羽化而登仙也。 曾至游《集仙传》载：陈朝元戒世云，为善事者必享福报，集阴德者子孙荣昌，不珍天物，不肆盗侄，不毁正教，善事也。 救死扶伤，急人患难，无纵隐贼，阴德也。 不作善事，不积阴德，则恶道无所不入矣。 朝元此言，盖为俗人设也，况学仙者乎？ 大抵欲修仙道，先修人道，人道不修，则仙道远矣。 又岂不见《悟真篇》云：大药修之有易难也？ 知由我也，由天。 若非积行施阴德，动有韦魔作障绿，学者诅可以我命在我之说自诿，而不务功行为急哉？ 呜呼，功满三千，大罗为仙，行满八百，大罗为客。 吾党其勉诸。 吕纯阳真人沁园春丹词注解竟",
      "translated_text": "The \"heavenly mechanism\" refers to the moment when *zi*-yang first stirs at midnight. As the heavenly mechanism approaches, if one can rouse their own mechanism to respond, then heaven and human unite in activation, inner and outer align, and the elixir coalesces. Though it is said that any of the twelve hours’ junctions may serve, the ancient immortals invariably used the moment when *zi*-yang first stirs at midnight, for at that time the great yang is precisely in the north, and the qi in the human body reaches the *Weilü* Pass—thus resonating with heaven and earth. This is what is meant by \"stealing from heaven and earth, seizing the workings of creation,\" and only at this time is it so. By the *chou* hour, the great yang has already shifted, and the qi in the human body has passed the *Weilü* Pass. By the *yin* hour, the great yang has emerged from the earth, and the qi in the human body has passed the *Shentang*. Neither may be used. *The Jade Mushroom Scripture* states: \"In refining the elixir, one must kindle the fire in accord with the *zi*-hour yang qi; only then is the fire complete. If kindled at any other time, the fire is imperfect.\" These words exhaust the matter.\n\nTo begin practice is already too late. \"To begin\" refers to the moment of refinement, when one gathers the spirit of the entire body into the *Tiangu* Cavity and does not let it stray—this is not a matter of literal grasping. Some may cling to the phrase \"to begin,\" taking it to align with the *Awakening to Reality*’s line, \"Seize with both hands and force them into mortal combat.\" Thus they strain with clenched fists, or cover their ears and nose, or rub their waist and abdomen, or press their thumbs into their palms, or press their middle fingers against their navel—is this not labor in vain? \"To begin practice is already too late\" speaks to the swift passage of time and the urgency of timely cultivation.\n\nThe path to Penglai relies on the fulfillment of three thousand deeds before one may stride upon the clouds and return. \"Three thousand deeds\" refers to nine years of three thousand days. Within these three thousand days, one must accumulate merit and deeds, never straying from the Dao for even a moment in the twelve hours. Liu Xugu’s *Returning Elixir Chapters* says: \"Great work nears completion in three thousand days; wondrous practice knows no lack in the twelve hours.\" The elixir method: the embryo forms in an instant, the work proves efficacious in a hundred days, the embryo rounds in a year, and the deeds fulfill in nine years—all proceed by degrees. There is no principle by which one may meet a master today and become an immortal tomorrow.\n\nKnow that in one year there is small attainment, and in nine years a great transformation: first the qi is refined, then the blood, then the vessels, then the flesh, then the marrow, then the sinews, then the bones, then the hair, then the form. After nine years and nine transformations, yin qi is fully refined into pure yang, and only then may one leave the world behind, transcend the mortal realm, and ascend as an immortal. Zeng Zhiyou’s *Collected Biographies of Immortals* records Chen Chaoyuan’s admonition to the world: \"Those who do good deeds will surely enjoy blessings; those who accumulate hidden virtue will see their descendants flourish. To cherish heaven’s gifts, not indulge in theft or deceit, and not destroy the true teaching—these are good deeds. To save the dying, aid the suffering, rush to others’ distress, and never harbor hidden malice—these are hidden virtues. Without good deeds or hidden virtue, the paths of evil will find entry everywhere.\" Chaoyuan’s words were meant for the common folk—how much more do they apply to those who study immortality?\n\nIn general, to cultivate the Dao of immortality, one must first cultivate the human Dao. If the human Dao is not cultivated, the Dao of immortality remains distant. Have you not seen the *Awakening to Reality*’s words: \"The great medicine is cultivated with ease or difficulty—it depends on me, or on heaven\"? Without accumulating deeds and bestowing hidden virtue, obstacles and demons will arise at every turn. How can scholars take the saying \"my life is in my own hands\" as an excuse and not treat the accumulation of merit as urgent?\n\nAlas! When three thousand deeds are fulfilled, one becomes an immortal of the Great Veil. When eight hundred deeds are fulfilled, one becomes a guest of the Great Veil. Let our fellowship strive together.\n\n**Commentary on Lü Chunyang’s True Person’s \"Spring in the Garden of Qin\" Elixir Verse Concluded**",
      "overlap_context": " wood and fire, sometimes water and earth. This leaves one’s mind and eyes dazzled—truly not easy to comprehend.\n\n**The essential subtleties of the Dao:**\nThe essentials of the elixir Way are two: *jiaogou* (union) and *jinhuo* (advancing the fire). Though they follow a sequence, they are in truth a single effort. Xiao Zixu’s *Great Compendium of the Golden Elixir* says: *\"The work within the moment is wondrously subtle.\"* Profound indeed! Subtle indeed! The heavenly mechanism runs deep and far.",
      "start_char": 2713,
      "end_char": 3522,
      "start_sentence": 113,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.10806941986084,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\吕纯阳真人沁园春丹词批注.txt",
        "category": "玉诀类"
      }
    }
  ]
}