{
  "source_id": "周易参同契释疑",
  "source_file": "chunked_daozang\\周易参同契释疑.json",
  "total_chunks": 11,
  "total_original_chars": 9751,
  "total_translated_chars": 52125,
  "total_translation_time": 271.4515390396118,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Explication of Doubts in the *Zhouyi Cantong Qi***\n\n**Title:** *Explication of Doubts in the *Zhouyi Cantong Qi***\n**Author:** Attributed to Quanyangzi Yu Yan of the Línwū Mountain\n**Volume:** One\n**Source Text:** From the *Daoist Canon of the Orthodox Tradition*, *Tai Xuan* Section\n**Collated Edition:** *Complete Library in Four Treasuries*, *Wenyuan Pavilion* edition, *Daoist Works* subsection (hereafter referred to as the *Siku* edition)\n\n---\n\n### **Preface to *Explication of Doubts in the *Zhouyi Cantong Qi*** #1**\n**By Quanyangzi Yu Yan of the Línwū Mountain**\n\nThe world transmits the *Zhouyi Cantong Qi* in three chapters—upper, middle, and lower. When read together, its words appear disordered, and it cannot originally be divided into sections. Peng Zhenyi thus provided annotations, incorporating Wei Gong’s *Postscript* and dividing the text into ninety chapters to correspond to the nine transformations of the fire-phase. Additionally, he appended the *Song of the Cauldron and Vessel* to align with the attainment of the True Lead’s singularity.\n\nElders have noted that the language and rhymes of this work are archaic and profoundly refined, making it difficult to comprehend. Superficial readers, in their ignorance, recklessly alter the text, resulting in even more errors than in other books. Peng’s division into chapters and explication of meanings truly aids the authentic classic. However, in following erroneous interpretations or extracting isolated passages, the overarching principles may be clarified, yet the ancient text becomes fragmented. For instance, phrases such as *\"The Changes unify the heart of Heaven—how could one not be cautious?\"*—which should logically connect to the following text—are arbitrarily severed as the concluding line of a chapter in Peng’s edition, disrupting coherence. Such missteps in Peng’s annotations stem from later shallow scholars’ reckless revisions.\n\nFurthermore, there are misplaced passages. For example, the chapter *\"Like the midwinter node\"* should not appear beneath *\"Examine carefully and avoid error,\"* nor should the chapter *\"Like an egg\"* be placed under *\"Each dwells in solitude.\"* Chen Baoyi once relocated the *\"Like the midwinter node\"* chapter before *\"The child turns to the right,\"* but this was still incorrect. Zheng Xuyi’s collation, though claimed to be meticulous, also contains errors. For instance, *\"Mutually engaging at the center\"* (where metal and water conjoin, neighboring the ghostly) should not have been altered—yet Zheng changed *\"center\"* to *\"noon,\"* *\"water\"* to *\"wood,\"* and *\"ghost\"* to *\"immortal,\"* straying far from the original meaning. Nevertheless, his corrections—such as *\"dark dawn\"* to *\"dim dawn,\"* *\"drum below\"* to *\"smelting,\"* and *\"powder\"* to *\"ingest\"*—were reasonable.\n\nI have collated various editions, all derived from the careful revisions of earlier scholars, yet significant errors persist. For example, *\"The three and five unite in Danger-One, all converging in One Place\"* refers to the qi of the three constellations—Fang (six), Zhang (two), and Mao (seven)—gathering in the northern quadrant of *Danger-One*, coalescing into a single locus. Older editions mistakenly render *\"Danger-One\"* as *\"one\"* and *\"converge in One\"* as *\"converge in two,\"* not only distorting Wei Gong’s intent but also defying logic. This error arose from the misreading of *\"Danger-One\"* as *\"one,\"* leading to the false assumption of redundancy and subsequent miscorrection.\n\nAs for *\"supplementing omissions and filling gaps,\"* these are Wei Gong’s own words in his preface. The *\"supplementing of omissions\"* refers to the *Song of the Cauldron and Vessel*. Fearing that the main text might still contain lacunae, Wei Gong composed this piece to fill them. For instance, the principles of *\"martial at the head and tail, civil in the center,\"* *\"nourishing the brain,\"* and *\"ascending the mysterious\"* are not explicitly stated in the main text but are expounded in this song.\n\nUpon examining several lines in his preface, I find his name subtly embedded within them. The opening line also highlights the four characters *\"Cantong Qi,\"* confirming that this chapter is Wei Gong’s own preface. In Peng’s annotated edition, however, this preface is placed *after* the *Song of the Cauldron and Vessel*. Peng, finding the *Song*’s language and logic fragmented and its verses disjointed—unable to be divided into chapters—relocated the preface to the end of the three main chapters, partitioning it into ninety sections to correspond to the *\"nine yangs.\"* He relegated the *Song* to the rear, aligning it with the *\"one water,\"* thus initiating the error of inversion.\n\nThe *\"Five Mutual Resemblances\"* are not five but three. The *\"Three Mutual Resemblances\"* refer to the mutual resonance of yin-yang transformations in the *Great Changes*, the *Yellow and Lao*, and the *Furnace Fire*. As stated: *\"The three Ways emerge from one, all following the same path,\"* and *\"Three threads arrayed, branches and stems intertwined, sharing one origin under different names, all issuing from a single gate.\"* Additionally, there is a *Eulogy Preface*, sometimes called the *Postscript* or attributed to Wei Gong’s eulogy of later scholars, though its origin remains uncertain; thus, it is collectively termed the *Eulogy Preface*. Zhu Xi of the Huian School meticulously analyzed its content and concluded it was a commentary’s *Postscript*, now lost, leaving only the preface. Modern annotators have all followed Zhu Xi’s interpretation, omitting it from their editions. However, since older editions include it, it cannot be discarded. I have thus appended it to the end of this volume, unwilling to abandon the old.\n\nAlas! From Wei Gong’s time to the present spans over a thousand years. As antiquity recedes, transmission errors multiply. When a discerning scholar laments the long-obscured ancient text and endeavors to excise falsehoods and clarify truth, the multitude inevitably gapes in astonishment, denouncing and mocking their presumption. Thus, they choose silence, never daring to take up the brush and assume responsibility for this work. Yet, what of future generations? This is why Zheng Xuyi so deeply cherished this book.\n\nThis humble latecomer to learning was fortunate to encounter an enlightened teacher and receive the authentic transmission of this Dao. Having also obtained a fine edition of this text, I tested its principles in practice and lectured upon them until I gained rough mastery. After a full year, the book was completed. Yet, fearing my explanations might remain incomplete or my words insufficiently detailed, I revised it three or four times. Still concerned that later generations would have no means to reconcile discrepancies, I collated the Shu edition, Yue edition, Ji edition, and various versions from Qiantang, cross-referencing them to establish a definitive text.\n\nAs for the remaining inconsistencies and irregularities, Zhu Xi’s *Textual Investigations* already addresses them, so I shall not belabor the point here.\n\nWritten on the day when the Five Planets conjoined in Chou and the golden essence filled the crucible, by Quanyinzi, the Purple Court Recluse of Linwu Grotto-Heaven.\n\n*Preface to the* Clarifying Doubts on the *Zhouyi Cantong Qi*\n*(Omitted from the Siku edition. The preface has been collated primarily against the* Daoist Canon Essentials *edition. Note: \"Drumming and forging\" in the* Daoist Canon Essentials *appears as \"drumming and striking.\" The character \"in the preface\" was originally missing and has been restored from the* Daoist Canon Essentials *edition.)*\n\n*Clarifying Doubts on the* Zhouyi Cantong Qi\n*By Yuyan, the Hermit of Linwu Mountain, Quanyinzi*\n\n**Clarifying Doubts on the *Zhouyi Cantong Qi*: First Chapter**\n\nThe term *kuangguo* 匡郭—one edition writes 匡 as 垣, while Chen Baoyi’s annotated version emends it to 围郭 to avoid taboo—refers to the alignment of the wheel-hub and axle in the cultivation of the Elixir: just as the axle must be centered within the hub, so too must the heart be rectified in practice. The axle lies within the hub, piercing through it, while the spokes lie outside, converging upon it. One edition mistakenly writes 轴 as 辐.\n\nThe \"four trigrams of the Female and Male\" summarize the preceding lines on Qian and Kun as the gate and door, Kan and Li as the enclosing frame. These four trigrams represent the crucible and the medicinal ingredients, while the sixty trigrams that follow denote the firing times. As the middle chapter states, \"The four are a primordial chaos,\" which likewise refers back to the lines on Qian’s firmness, Kun’s yielding, Kan and Li as the foremost. Later, it speaks of the \"application of the sixty trigrams,\" spreading them out like a chariot, thus completing the sixty-four trigrams. All sixty-four trigrams serve the purpose of our Dao of the Elixir—this is why the text is called the *Zhouyi Cantong Qi*. One edition mistakenly takes the \"four trigrams of the Female and Male\" as Zhen, Dui, Xun, and Gen, which is incorrect.\n\nThe phrase \"like the key to a lock\" is rendered as \"mutual\" in Ningshenzi Chen Huizhen’s annotated edition. It means that, just as a charioteer holds the reins and bit, adhering to the guiding rope, the compass, and the carpenter’s square, following the wheel tracks while remaining centered to control what lies outside, so too does the practitioner, seated within the chariot, govern the horse’s advance and retreat, aligning with the rules and measures. This echoes the middle chapter’s \"the dragon and horse are harnessed,\" where the enlightened ruler masters the times. An older edition mistakenly writes \"like the charioteer holding the reins and bit, with the guiding rope\" as \"like the craftsman holding the reins and bit, with the guiding rope and carpenter’s square.\" This error was perpetuated by earlier commentators, who took it to mean \"like the craftsman’s use of the guiding rope, compass, and square, or the charioteer’s use of the reins, bit, and wheel tracks,\" which is incorrect.\n\n\"Combining to make sixty\" refers to the daily use of two trigrams, which over thirty days of a month combine to form sixty trigrams. One edition mistakenly writes \"combining to make sixty-four.\" \"Proceeding in sequence\" is rendered as \"proceeding as\" in one edition.\n\nFrom *Ji* and *Wei* to *mei*-dawn refers to the passage below on \"from the dark of the moon to the dawn of the new moon.\" One edition mistakenly writes *mei* as *hui*. Here, *Ji* and *Wei* denote the dark of the moon, while *mei*-dawn signifies the new moon. To interpret it as \"from *Ji* and *Wei* to the dawn of the dark moon\" would be to say \"from the dark of the moon to the dawn of the dark moon,\" which grossly distorts the meaning.\n\n\"Spring and summer rely on the inner body, from *zi* to *chen* and *si*; autumn and winter apply to external use, from *wu* to *xu* and *hai*.\" This refers to the pairing of two trigrams: the first, belonging to spring and summer, spans from *zi* to *si*, as yang ascends from below; the second, belonging to autumn and winter, spans from *wu* to *hai*, as yin descends from above. If taken as a single trigram, it would have only six lines, and when matched with the twelve hours, exactly half would be missing. Thus, the daily practice of two trigrams must be understood as referring to both together.\n\n\"Attaining its sequence\"—one edition writes 序 as 理. \"Transformation occurs within\"—Zhu Xi’s annotated edition writes 变化 as 升降. One edition writes \"ascending and descending, transforming within it.\"\n\n\"Enveloping\" alludes to a passage in *Wenzi*’s *Tongxuan Zhenjing*. An older edition mistakenly writes 包裹 as 包囊.\n\n\"Using the formless to shape the formed\" refers to the *zhi* of creation, not the *zhi* of control. The Great Elixir’s method creates something from nothing, hence \"using the formless to shape the formed.\" Some interpret this as the *zhi* of control, taking \"formless\" as spirit, mercury, or Li, and \"formed\" as qi, lead, or Kan. While this is one possible reading, it is not Master Wei’s original intent.\n\nI have repeatedly examined this matter and found that later scholars, misled by the *Longhu Jing*’s line \"the formless and the formed mutually control each other, the Vermilion Bird flames in the void,\" failed to consider the broader context and mistakenly applied the *zhi* of creation to the *zhi* of control. Similarly, the middle chapter states: \"The firm and the yielding are distinct, not intermingling,\" meaning they do not encroach upon one another. It continues: \"The Five Phases guard their boundaries, neither recklessly expanding nor contracting.\" This differs from the later chapter’s meaning of the firm and yielding being separate.\n\nSome, clinging to the *Longhu Jing*’s line \"the firm and yielding contend, not intermingling, which is not the fault of fire, but the blame lies with earth,\" have also misapplied this to the meaning of the firm and yielding being separate. Modern scholars commonly claim that Wei Boyang composed the *Cantong Qi* based on the *Longhu Jing*, and thus must defer to its interpretations. Yet they do not realize that the *Longhu Jing* merely paraphrases the *Cantong Qi* and was actually written after Master Wei’s work.\n\nZhu Xi of Huian remarked: \"Later scholars, seeing that Wei Boyang’s transmission mentions the *Longhu Shangjing*, fabricated this text, largely modeling it after the *Cantong Qi* but introducing errors.\" I once hesitated to accept Zhu Xi’s view, but upon repeated reflection and cross-examination with the *Cantong Qi*, I came to see the *Longhu Jing*’s inconsistencies and realized it truly is a paraphrase of the *Cantong Qi*.\n\nMaster Wei’s *Cantong Qi* borrows the hexagrams of the *Zhouyi* to elucidate the secrets of Elixir-making, not to expand upon the *Longhu Jing*. Had he intended to expand upon the *Longhu Jing*, the text would have been called the *Longhu Cantong Qi*, not the *Zhouyi Cantong Qi*. Nevertheless, the *Longhu Jing* remains a fine work, which is why Cai Jitong admired its lines, such as: \"The Primordial Lord first refines mercury, the divine chamber containing the cavernous void.\"\n\nMoreover, it states: \"The essential principle of the natural is first to preserve, then to let perish.\" This is indeed a profound insight, though it is not a text from before Master Wei’s time. Where it reads \"the vessels and implements are empty,\" the Li Baosu annotated edition has \"all.\" As evidence, one version has \"evidence\" (征) written as \"proof\" (证), which is acceptable, while another has \"should\" (当) instead of \"correspond\" (相当), which is incorrect. Where it reads \"from beginning to end,\" one version has \"from end to beginning\" (终始), which is also incorrect. Where it reads \"all receive from the Central Palace,\" one version has \"in\" (在) instead of \"receive\" (禀), and another has \"the Central Palace receives\" (中宫所禀), both of which are incorrect. Where it reads \"at this time\" (之时), one version has \"at this juncture\" (际). Where it reads \"governing the Yellow and transforming,\" one version has \"transforming the Yellow and enveloping\" (化黄包).\n\nFor \"鄞鄂,\" Zhu Xi’s *Textual Variants* renders it as \"根鄂,\" where \"鄂\" means \"calyx.\" As the *Book of Songs* says: \"The calyx does not...\"—this is the same \"鄂\" character. Some versions write it as \"垠堮,\" \"圻堮,\" or \"釿锷,\" all of which are incorrect. Where it reads \"entitled the Primordial Sovereign\" (称元皇), one version has \"should be entitled\" (当). Where it reads \"the first year\" (元年), one version has \"the first qi\" (元炁). Where it reads \"then the sprout flourishes\" (乃芽滋), one version has \"then the sprout arises\" (芽乃生), and another has \"then the bud flourishes\" (乃牙滋).\n\nRegarding the line \"The *Fu* hexagram establishes the initial,\" some suspected it repeated the \"establishes the initial\" in the *Guan Ju* and thus changed \"initial\" (初) to \"sprout\" (萌). Zhu Xi noted that this was a reckless alteration by those ignorant of ancient rhyme. Similarly, in the line \"the nine and six also correspond\" (九六亦相当), some suspected it repeated \"hard and soft correspond\" (刚柔相当) and changed \"correspond\" (当) to \"respond\" (应), which is also incorrect.\n\nThe line \"sun and moon have no dual brightness\" means that when the sun rises, the moon sets, and when the moon rises, the sun sets, alternating their illumination day and night. One version replaces \"no\" (无) with \"qi\" (炁), which is incorrect. In ancient times, \"无\" was used for \"no,\" as in the *Yi*’s \"no delusion\" (无妄) and \"no blame\" (无咎). Another version has \"brilliant and forming a pair\" (焕炳而成双).\n\nWhere it reads \"the rabbit spits forth its light,\" one version has \"the rabbit’s essence spits forth radiant light\" (兔魄吐精光), and another has \"the rabbit’s essence spits forth its light\" (兔魄吐生光). Where it reads \"the East loses its brightness\" (东方丧其明), an old version has \"the Northeast loses its brightness\" (东北丧其明), likely following the *Yi*’s phrase \"the Northeast loses its companion\" (东北丧朋) and perpetuating the error through habit. However, the *Kun* hexagram states: \"In the Southwest, it gains companions; in the Northeast, it loses companions.\" This refers to the *Kun* position in the Southwest, where *Dui* (West), *Li* (South), and *Xun* (Southeast) are all yin hexagrams; yin following yin is called \"gaining companions.\" In the Northeast, *Zhen*, *Gen*, *Kan*, and *Qian* are all yang hexagrams, hence \"losing companions.\" Yet Master Wei’s line, \"On the thirtieth day of *Kun*-yi, the East loses its brightness,\" refers to the morning of the thirtieth day when the Great Yin sets in the eastern *yi* position—it does not employ the *Kun* hexagram’s \"Northeast loses companions.\" How is this clarified?\n\nThe Western regions *geng* and *xin*, the Southern regions *bing* and *ding*, and the Eastern regions *jia* and *yi* are the six nodes within a month where the Great Yin appears at dusk and sets at dawn—what Wang Baoyi called the \"three shifts of the moon.\" On the third day, the moon appears at dusk in the West at *geng* and sets at dawn on the sixteenth in the West at *xin*; on the eighth day, it appears at dusk in the South at *ding* and sets at dawn on the twenty-third in the South at *bing*; on the fifteenth day, it appears at dusk in the East at *jia* and sets at dawn on the thirtieth in the East at *yi*. The principle is thus clear. How could *yi* be the Northeast? Since ancient times, *jia* and *yi* have both been placed in the East, not the Northeast. If *yi* were the Northeast, then when the *Qian* trigram aligns with it, why not call it \"abundant and full in *jia* Northeast\"? *Jia*, being closer to the Northeast, is not called the Northeast, so how much less could *yi*, which precedes *jia* and is closer to the Southeast, be the Northeast? Its non-Northeastern position is evident.\n\nThe line \"the nine and six also correspond\" was explained earlier under the *Fu* hexagram’s \"establishes the initial.\" The phrase \"the images of the *Yi* perish and conceal\" refers to the night of the thirtieth day, when the images of the sun and moon both sink in the North. One version has \"yang qi\" (阳炁) instead of \"images of the *Yi*\" (《易》象), which is incorrect. The line \"like the midwinter node, it illuminates the blind after birth\" was misplaced in the *Postscript* in the old edition. Chen Baoyi moved it to before \"turning right,\" but both arrangements are incorrect. This passage rhymes with two \"injured\" (伤) characters and, when connected to the earlier \"the images of the *Yi* perish and conceal,\" also rhymes with two \"conceal\" (藏) characters. Ancient writers often used repeated rhymes, but later scholars, not understanding this, recklessly altered the text, disrupting its coherence. Examples include the repeated \"establishes the initial\" in the *Guan Ju* and the *Fu* hexagram, and the repeated \"correspond\" in \"hard and soft correspond\" and \"the nine and six also correspond.\" How could one hastily alter the correct text due to repeated rhymes?\n\nWhere it reads \"merchants and travelers\" (商旅), one version has \"merchants\" (贾). Where it reads \"vast and expansive\" (浩广), one version has \"vast and boundless\" (浩旷). Where it reads \"subtle and hard to perceive\" (眇难睹), one version has \"hard to behold\" (难觌). Where it reads \"signs and evidence\" (符征), one version has \"signs and proof\" (符证). Where it reads \"seasonal ordinances\" (节令), one version has \"timely ordinances\" (时令). Where it reads \"examined within the human heart\" (中稽於人心), one version has \"examined within human emotions\" (中稽於人情). Where it reads \"following the hexagram’s changes\" (依卦变), one version has \"following the hexagram’s nodes\" (循卦节). Where it reads \"following the *Xiang* commentary\" (循《象》辞), one version has \"relying on the *Tuan*\" (因《彖》) instead of \"following the *Xiang*,\" which is incorrect.\n\nThe lines \"When *Qian* and *Kun* are employed, Heaven and Earth are then ordered\" seem to quote the *Qian* hexagram’s \"When the yang of *Qian* is employed, the world is ordered,\" but given the earlier line \"Kan and Li are the two functions of *Qian* and *Kun*,\" this refers to Kan and Li as the functions of *Qian* and *Kun*, not the \"employing nine\" or \"employing six.\" Just as the earlier \"the East loses its brightness\" does not use the *Kun* hexagram’s \"Northeast loses companions,\" Master Wei’s composition of this text largely employs borrowing and need not be rigidly adhered to.\n\nThe line \"Can one not be cautious?\" (可不慎乎) has one version that reads \"Can one fail to be cautious?\" (可得不慎乎), which is incorrect. Where it reads \"the Dipper’s handle\" (魁杓), one version has \"handle\" (柄) instead of \"ladle\" (杓). \"誃离\" means \"separation,\" with one version writing it as \"移离\" and another as \"坎离.\"\n\nHere follows the translation:\n\n---\n\nSome versions render \"仰俯\" as \"俯仰.\" Master Zhu stated that it should read \"仰俯,\" as this follows the *xu* rhyme, and we adopt this reading. In one version, \"統錄\" appears as \"總錄.\" Where it reads \"日含五行精,\" one version has \"合\" instead of \"含,\" which is incorrect. \"诘过贻主\" appears in one version as \"结过移主.\" For \"辰极处正,\" one version has \"受\" instead of \"处,\" and another has \"政\" instead of \"正.\" \"布政\" appears in one version as \"政德.\" \"终修\" is rendered in one version as \"终循\" and in another as \"中美.\" Where it reads \"以掩蔽,\" one version has \"已\" instead of \"以.\"\n\n\"有无亦相须\" refers to the mutual dependence of water and fire, the two *qi*, in completing the transformations of creation. Some versions render \"有无\" as \"金炁\" or \"吟炁,\" both of which are incorrect. \"进退分布\" appears in one version as \"退而分布,\" which is incorrect. \"采之类白\" is rendered in one version as \"望之类白\" and in another as \"摇之类白.\" \"白裹\" appears in one version as \"包裹.\" \"相扶\" is rendered in one version as \"相拘.\" \"相连\" appears in one version as \"相通.\"\n\n\"This is not the method of storing within the five viscera\" (是非歷藏法) means that this Dao is not the method of visualizing and storing within the five viscera. If one takes the words \"是非\" to mean \"right and wrong,\" one has misunderstood. \"次日辰\" appears in one version as \"以日辰,\" which is incorrect. \"累土\" appears in one version as \"周回.\" \"而意悦\" is rendered in one version as \"意悦喜.\"\n\n\"Straddling fire, one is not scorched; entering water, one is not drenched.\" This describes the dharma-body after the Dao is accomplished. If one were to cast the fleshly body into water or fire, how could one escape being scorched or drenched? \"移居\" appears in one version as \"移名,\" which is incorrect. \"功滿\" appears in one version as \"功成,\" which is incorrect.\n\n\"偃月\" (reclining moon): given that the text below reads \"汞日\" (mercury-sun), \"偃\" is likely a corruption of \"鉛\" (lead), a transmission error of sound. Where it reads \"作鼎爐,\" an older version has \"作法,\" which is incorrect. \"艮亦八\" appears in one version as \"亦如之.\" \"亏明\" appears in one version as \"亏伤.\"\n\n\"Gold’s essence derives from the sun’s radiance; at dawn of the new moon, it receives the solar tally.\" This means that the moon’s light is born from the sun, and at the dawn of each new moon, it conjoins with the sun. For gold and fire are none other than the sun and moon. An older version has \"月\" instead of \"日,\" which is incorrect. If one were to think that gold’s essence derives from the moon, it would be as if the sun and moon themselves derived from the moon—what principle could justify this?\n\n\"數稱五\" appears in one version as \"號稱五.\" \"含育\" appears in one version as \"貪欲.\" \"伫息\" refers to the conjoining of concentrated stillness and the breath, the two merging as one, like the union of husband and wife. One version has \"思\" instead of \"息,\" and another has \"恩,\" both of which are incorrect. \"執平\" appears in one version as \"氣平.\"\n\n\"Earth wanders through the four seasons, guarding its boundaries and fixing its rules.\" In all versions, this line appears below \"longevity is attained,\" but in Zheng Xu’s version, it appears below \"fundamental nature shares a common origin.\" \"Gold takes cinnabar as its master, harmonizing with mercury.\" This directly points to the transformations of ordinary cinnabar and ordinary mercury, using them as metaphors for the transformations in the elixir method. It is not a matter of borrowing one external thing to compare with one internal thing, nor of setting them in opposition.\n\n\"以黍\" appears in one version as \"以粟,\" which is incorrect. \"其卵\" appears in one version as \"其子,\" which is incorrect. \"泥汞\" appears in one version as \"泥澒.\" \"炼飞\" appears in one version as \"炼治\" and in another as \"炼持.\" \"鼓铸\" appears in one version as \"鼓下,\" which is incorrect. \"杂性不同类\" appears in one version as \"杂性不同种.\"\n\n\"Those who rely on luck never meet success; only the sage knows this.\" These ten characters are absent in Master Zhu’s version. \"生狐疑\" appears in one version as \"坐狐疑.\" \"始畫八卦，效法天地\" appears in one version as \"始畫八卦象，效法天地圖\" and in another as \"畫八卦，效天圖,\" both of which are incorrect. \"循而.\"\n\nOne version reads \"structural formation\" instead of \"one version.\"\n\n\"庶圣\" refers to the sage without rank—Confucius is such a one. One version reads \"the sage and,\" which is incorrect.\n\n\"三君\" appears in one version as \"three sages.\" \"令可法\" appears in one version as \"诚可法.\"\n\n\"为世定此书\" means that the Great Dao of the Golden Elixir is formless and traceless, leaving nothing for later generations to emulate. Thus, this *Cantong qi* was established for the world. This aligns in meaning with the middle section’s \"定录斯文.\"\n\nAn old version reads \"为世定诗书,\" which is incorrect. \"窃为\" appears in one version as \"窃待.\" \"辄思虑\" appears in one version as \"缀斯愚,\" which is incorrect.\n\n\"金计有十五，水数亦如之\" refers to the earlier chapter’s \"上弦兑数八，下弦艮亦八.\" For the upper quarter, metal weighs half a catty; for the lower quarter, water weighs half a catty. When the two quarters are combined, they form the number of days in a month—thirty—though this differs from the meaning of \"metal within water.\"\n\nOne version reads \"金数十有五\" instead of \"金计有十五.\"\n\n\"其土遂不入，二者与之俱，三物相含受，变化状若神.\" These three things are metal, water, and earth. When metal and water combine with earth, they become one, hence \"three things mutually containing and receiving.\" If fire were added, it would become five things.\n\nSome interpret the three things as metal, fire, and wood, and the two things as water and fire, but this is overly convoluted and not the profound teaching. One version reads \"其三\" instead of \"其土\"; another reads \"火二\" or \"水二\" instead of \"二者,\" both of which are incorrect.\n\n\"捣治\" appears in one version as \"铸冶.\" \"致坚完\" appears in one version as \"致坚完\" (with \"致\" unchanged).\n\n\"炎火张於下，龙虎声正勤\" shares the same meaning as the later passage: \"升熬於甑山兮，炎火张设下；白虎倡导前兮，苍龙和於后.\" An old version reads \"昼夜\" instead of \"龙虎,\" which is incorrect.\n\n\"始文使可修\" appears in one version as \"始初文可修.\" \"亲观\" appears in one version as \"相亲\" and another as \"须亲.\"\n\n\"服之\" appears in one version as \"粉提,\" another as \"粉捏,\" and another as \"提粉,\" all of which are incorrect. \"一丸\" appears in one version as \"一元\" and another as \"一粒,\" both incorrect.\n\n\"刀圭\" refers merely to the tip of a knife’s edge, indicating its small quantity. While one might cleverly interpret \"刀\" as metal and \"圭\" as two earths, this is not Master Wei’s original intent.\n\n\"较约\" appears in one version as \"简约.\" \"光明\" appears in one version as \"光荣,\" which is incorrect. \"薄蚀\" appears in one version as \"激薄.\" \"显龙虎\" appears in one version as \"题龙虎.\" \"嘉黄芽\" appears in one version as \"加黄芽.\"\n\n---\n\n**Middle Section: Resolving Doubts**\n\n\"偕以造化\" appears in one version as \"须以造化\" and another as \"始以造化.\" \"元基\" appears in one version as \"玄基\" and another as \"元模.\"\n\n\"六十卦用，张布为舆\" appears in one version as \"六十卦周,\" which is incorrect. \"不邪\" appears in one version as \"不陂.\" \"倾危国家\" appears in one version as \"家国倾危.\"\n\n\"卦日\" appears in one version as \"卦月.\" \"六十卦用，各自有日\" appears in one version as \"余六十卦,\" which is incorrect.\n\n\"在义设刑\" appears in an old version as \"立义设刑.\" \"日辰\" appears in one version as \"日夜.\" \"用心\" appears in one version as \"逆贼\" and another as \"迸散.\"\n\n\"己口\" appears in one version as \"鼎口.\" \"之来\" appears in one version as \"之中.\" \"刚柔断矣，不相涉入\" was previously explained in the upper section under \"以无制有.\"\n\n\"晦朔之问，合符行中，至始於东北箕、斗之乡.\" The interval between the last day of the lunar month and the first is the time after *hai* and before *zi*, when the sun and moon conceal themselves. The region of *Ji* and *Dou* lies after *gen* and before *yin*, where the sun and moon begin their revolution. This metaphorically illustrates the subtlety of the elixir method, which follows the same path as heaven, earth, the sun, and the moon.\n\nSome directly take the time after *gen* and before *yin* as the interval between the last and first days of the lunar month, considering it the moment when the first yang arises and the medicine is gathered. This interpretation is far off the mark.\n\n\"旋而右转，呕轮吐萌\" describes the yang fire rotating from the waist, passing through *Dou* and *Ji*, and ascending to the *Xuan Guan*, where its radiance shines beyond the curtains. One version reads \"左旋\" instead of \"旋而右转.\"\n\n\"昴毕之上，震出为征\" refers to the moon’s initial appearance in the west, resembling the trigram *Zhen*, symbolizing the fire timing within the body. If one interprets the moon’s rising position according to the *Xiantian* eight trigrams, *Zhen* in the *Xiantian* arrangement is not in the west, nor is the fire timing’s *Zhen* in the west. Failing to grasp its true meaning, one merely sees contradictions in the text.\n\n\"和平\" appears in one version as \"初和.\"\n\nIts governing principle—one version reads \"yin\" instead of \"its.\"\n\n\"Six-five *Kun* bearing\" refers to the thirty days of the sixth lunar month, not the sixth line of the *Kun* hexagram. The yang numbers have reached their end, and upon completion, they begin anew. Following nature and aligning with essence, they turn and interact.\n\nAll versions place this under \"the compass and square of the Dao,\" except for Master Zhu’s edition, which places it under \"the world as a category of the mother,\" which is incorrect.\n\n\"Circulating through the six lines\"—one version reads \"chapter\" instead of \"circulate,\" which is incorrect.\n\n\"Difficult to\"—one version reads \"can\" instead of \"difficult to.\"\n\n\"Flourishing and manifest\"—one version reads \"prosperous\" instead of \"manifest.\"\n\n\"Generating radiance\"—one version reads \"correct\" instead of \"generating,\" which is incorrect.\n\n\"Gradually advancing\"—one version reads \"reposing\" instead of \"gradually.\"\n\n\"Completing *Tai*\"—one version reads \"bearing\" instead of \"completing.\"\n\n\"Moving and\"—one version reads \"shifting\" instead of \"and.\"\n\n\"*Yu* pods\"—one version reads \"leaves\" instead of \"pods,\" which is incorrect.\n\n\"Shaking and searching\"—one version reads \"capital\" instead of \"searching.\"\n\n\"The yang ends at *Si*, centered and interacting.\" This refers to the fourth month, which corresponds to *Si*, with the pitch matching *Zhong Lü*. Master Xiashan Zi Zhan Gu’s annotated edition reads \"Zhong Lü\" instead of \"centered,\" while one version reads \"noon\" instead of \"centered,\" which is incorrect. Noon corresponds to *Ruibin*.\n\n\"Is\"—one version reads \"presides\" instead of \"is.\"\n\n\"Wandering the world and departing from position\"—one version reads \"retreating from worldly position,\" which is incorrect.\n\n\"Its essence\"—one version reads \"true\" instead of \"its.\"\n\n\"The yin extends while the yang withdraws, damaging names and reputations.\" This refers to the seventh month, which corresponds to *Shen*, with the pitch matching *Yize*. \"Extends\" means *Shen*, and \"damages\" means *Yi*. An older edition reads \"the yang perishes,\" while another reads \"the yang vanishes,\" both of which are incorrect.\n\n\"Diminishing and vanishing\"—one version reads \"ceasing\" instead of \"vanishing,\" which is incorrect.\n\n\"Utmost spirit\"—one version reads \"its\" instead of \"utmost,\" and another reads \"*Kun*\" instead of \"spirit.\"\n\n\"Decline and flourishing\"—one version reads \"alternating\" instead of \"decline,\" which is incorrect.\n\n\"Bearing and receiving\"—one version reads \"mercury\" instead of \"bearing.\"\n\n\"A thousand autumns\"—one version reads \"years\" instead of \"autumns.\"\n\n\"One absence\"—one version reads \"primordial\" instead of \"absence,\" which is incorrect.\n\n\"Flowing and spreading\"—one version reads \"clouds\" instead of \"flowing.\"\n\n\"Resembling a chicken’s egg, its flesh smooth as maltose.\" An older edition misplaced this passage, likely doubting its repetitive rhyme and arbitrarily relocating it. It has now been corrected.\n\n\"Resembling\"—one version reads \"form\" instead of \"resembling.\"\n\n\"Mutually supporting\"—one version reads \"corresponding\" instead of \"supporting.\"\n\n\"Thus complete\"—one version reads \"together\" instead of \"complete.\"\n\n\"Smooth as maltose\"—an older edition reads \"lead\" instead of \"maltose,\" which Master Zhu corrected to \"maltose.\"\n\n\"Newly forged blade\"—this was explained in the previous section.\n\n\"Constantly as\"—one version reads \"firmly constructed,\" another \"completely built,\" and another \"walled.\"\n\n\"At this time, essence aligns with *Qian* and *Kun*.\" One version reads: \"At the beginning, originating from *Qian* and *Kun*.\"\n\n\"Restraining leads to water settling, water as the first of the Five Phases.\" One version reads: \"leads to water settling fire, the beginning of the Five Phases.\"\n\n\"The Dao has no form or image\"—an older edition reads \"of\" instead of \"no,\" for in ancient script, the character for \"absence\" was written similarly to \"of,\" and in cursive, they resemble each other, leading to the error.\n\n\"Image\"—one version reads \"form.\"\n\n\"The true One is difficult to depict\"—one version reads \"its\" instead of \"One.\"\n\n\"Utmost mystery\"—one version reads \"profound and,\" which is incorrect.\n\n\"The three treasures of ears, eyes, and mouth\"—one version reads \"the treasures of ears, eyes, and self,\" which is incorrect.\n\n\"Manifesting and spreading\"—one version reads \"pervading\" instead of \"spreading.\"\n\n\"Observing and surveying\"—one version reads \"listening\" instead of \"surveying.\"\n\n\"Overturning the primordial chaos\"—one version reads \"following the primordial.\"\n\n\"Thought after thought\"—an older edition reads \"thoughtless.\"\n\n\"Verification shifts naturally\"—an older edition reads \"verification is difficult to shift,\" which is incorrect.\n\n\"Gradually and\"—one version reads \"with gradual.\"\n\n\"Penetrating the boundless\"—one version reads \"moistening\" instead of \"penetrating,\" which is incorrect.\n\n\"Within the valley\"—one version reads \"central palace,\" another \"guest within,\" both incorrect.\n\n\"Leaning on a staff\"—one version reads \"holding a staff.\"\n\n\"Submerging in water\"—one version reads \"casting into\" instead of \"submerging.\"\n\n\"Harvesting millet\"—one version reads \"obtaining\" instead of \"harvesting.\"\n\n\"No visible achievement\"—one version reads \"no\" instead of \"not.\"\n\n\"Utmost simplicity\"—one version reads \"affairs\" instead of \"utmost,\" which is incorrect, likely due to the similarity between the cursive forms of \"utmost\" and \"affairs.\"\n\n\"Thus they interlock and swallow, chewing and devouring one another.\" An older edition, including Peng Zhenyi’s annotation and Liu Yongnian’s *Shaoxing Inquiry* version, placed this under \"the compassionate mother nurtures, the filial child repays.\" Master Zhu noted: \"Now examining these two lines, they properly belong under 'all greedily contend,' where four lines follow in sequence, their meaning connected. They should not be here.\" This chapter uses the analogy of mother and child, where \"thus they interlock and swallow\" reflects the meaning of the compassionate crow feeding its parent, and thus belongs here. It has now been restored according to the older edition.\n\n\"Three and five become one\"—this refers to the earlier section where the *Zi* and *Wu* numbers combine as three, and the *Wu* and *Ji* numbers are called five, differing from the *Wuzhen Pian*’s \"three-five-one.\"\n\n\"Become\"—one version reads \"and,\" which is incorrect.\n\n\"*Zi* turns to the right\"—this means the tiger is born within water.\n\n\"*Wu* rotates to the east\"—this means the dragon emerges from within fire.\n\n\"*Zi* and *Wu*\"—these are water and fire.\n\n\"*Zi* turns to the right\"—where metal and water unite, turning right toward *Zi*.\n\n\"*Wu* rotates to the east\"—where wood and fire are companions, rotating east toward *Wu*.\n\nThe Dao of heaven turns left while revolving right; the Dao of returning elixir is identical to the heavenly Dao. If one says: \"*Zi* turns right and advances to *You*, *Wu* rotates east and advances to *Mao*,\" this would be a rightward rotation and leftward turn, contrary to the heavenly Dao.\n\n\"Rotates to the east\"—one version reads \"left\" instead of \"east.\"\n\n\"Host and guest\"—one version reads \"settled\" instead of \"guest.\"\n\n\"Greedily contending\"—one version reads \"convenient\" instead of \"contending,\" another \"flourishing,\" both incorrect.\n\n\"Each attains its nature\"—one version reads \"has\" instead of \"attains,\" and \"achievement\" instead of \"nature.\"\n\n\"As if examining\"—one version reads \"having\" instead of \"examining.\"\n\n\"Attaining the correct Dao\"—one version reads \"attaining as the accomplished Dao.\"\n\n\"The father presides over bestowing\"—one version reads \"generates\" instead of \"presides,\" which is incorrect.\n\n\"The female phoenix\"—one version reads \"fat\" instead of \"female.\"\n\n\"The Dao of transformation\"—one version reads \"achievement\" instead of \"Dao,\" another \"essence,\" both incorrect.\n\n\"At the inception of receiving *qi*\"—one version reads \"primordial\" instead of \"of.\"\n\n\"Daily transformation, monthly change\"—this adopts Zhuangzi’s phrasing. One version reads \"daily reception, monthly change,\" which is incorrect.\n\nMoreover, doubting that \"daily reception, monthly change\" obstructs coherence, one version alters it to \"monthly reception, daily change\"—this, too, is incorrect.\n\n\"The nature of water flows freely\"—one version reads \"harmonious and fused\" instead of \"flows freely.\"\n\n\"Wood and fire as companions\"—this refers to the dragon emerging from within fire, where the east (three) and south (two) together form five.\n\n\"Where metal and water converge\"—this refers to the tiger being born toward water, where the north (one) and west (four) jointly complete it.\n\nZhang Ziyang states: \"The Four Symbols do not depart from the Two Bodies.\" This precisely captures the meaning.\n\nSome employ the precelestial *Li* and *Kan* to supplement the postcelestial *Zhen* and *Dui* in expounding this idea, yet this not only strays from Master Wei’s original intent but also inverts the great process of inner transformation.\n\nOne version reads \"metal and wood\" instead of \"metal and water,\" and \"water and fire\" instead of \"wood and fire\"—a grave error indeed.\n\n\"Arranged as\"—one version reads \"joined\" instead of \"arranged,\" another \"drawn.\"\n\n\"Heart red as the female\"—one version omits these four characters.\n\n\"The five phases begin with *zi*\"—one version omits these four characters, another substitutes \"*ju*\" for \"*zi*.\"\n\n\"Establishing the weft\"—one version reads \"position\" instead of \"weft.\"\n\n\"*Xu* and *Wei*\"—one version reads \"embracing the true.\"\n\n\"Grasping fire\"—one version reads \"descending to sit.\"\n\n\"Harmonizing and blending\"—one version reads \"grasping fire.\"\n\n\"Indulging vain hopes\"—one version reads \"hoping for some expectation.\"\n\n\"With □\"—one version reads \"□\" as \"□.\"\n\n---\n\n**Clarifying Doubts in the Lower Chapter**\n\nOnly the sages and worthies of old, embracing the mysterious and holding fast to the true, deeply pitied later generations—those who love the Dao—who, following peripheral trends, traced and illustrated ancient texts, compiling them into diagrams and books to enlighten posterity. Yet they revealed only branches and leaves, concealing the root and trunk.\n\nThis means that the ancient sages, having attained this Dao and embraced the mysterious while holding fast to the true, further pitied later generations of Dao-seekers who failed to grasp its teachings. Thus, they followed peripheral trends, citing antiquity to validate the present, compiling diagrams and books to instruct them. Yet they dared not expose it too directly, so they resorted to designations like \"five metals\" and \"eight stones\" to elucidate it.\n\nThe phrase \"compiling diagrams and books, designating them as various stones\" refers to the ancient sages’ method, not to later generations of Dao-seekers. In this chapter, Peng Zhenyi and Chen Baoyi both misunderstood the meaning, while only Master Zhu’s commentary grasped its essence.\n\n\"The Three Origins\"—one version reads \"light\" instead of \"origin,\" which is incorrect.\n\n\"Essence overflows\"—one version reads \"fluids\" instead of \"essence,\" which is incorrect.\n\"Transforming form\"—one version reads \"transform\" as \"change.\"\n\"Reversing and distorting the texts\" means repeatedly altering and confusing the words so as not to reveal them too directly.\nOne version reads \"distort\" as \"conceal,\" which is incorrect.\n\"Transmitted through the ages\"—one version reads \"transmit\" as \"raise.\"\n\"Not serving in office\"—one version reads \"serving\" as \"thus.\"\n\"Thus creating chaotic words\"—one version reads \"creating\" as \"not,\" which is incorrect.\n\"The Mysterious Channel\"—one version reads \"channel\" as \"distant.\"\n\"Retreating from behind\"—an old version reads \"behind\" as \"alter,\" which is incorrect.\n\n\"When the Pass Spear rises and falls,\nThe celestial cycle hastens its course.\"\n\nThe two characters \"celestial cycle\" in old versions were written as \"celestial qi.\" Master Zhu suspected that \"celestial qi\" lacked coherent meaning and thus emended it to \"harmful qi,\" which is also incorrect. The character \"harm\" resembles \"cycle,\" and \"qi\" is quite similar to \"heaven.\"\n\n\"The Yangtze and Yellow Rivers never run dry,\nTheir waters flow ceaselessly into the sea.\"\n\nAn old version reads \"into\" as \"none,\" which is incorrect. The error of \"none\" for \"into\" has already been explained in detail under the middle section’s \"The Dao has no form or image.\"\nOne version reads \"Yellow River\" as \"Huai River.\"\n\"Ending and returning to the beginning\"—one version reads \"returning to end and begin,\" another reads \"returning to renew the beginning.\"\n\"Spread out\"—one version reads \"out\" as \"set up.\"\n\"White Tiger\"—one version reads \"Tiger\" as \"alum,\" which is incorrect.\n\"Azure Dragon\"—one version reads \"Dragon\" as \"fluid,\" which is incorrect.\n\"Pressing to halt\"—one version reads \"halt\" as \"proceed.\"\n\"Dragon’s scales, armor, and mane\"—one version reads \"Dragon\" as \"fish\" and \"armor\" as \"familiar,\" which is incorrect.\n\"Interconnected\"—one version reads \"interconnected\" as \"jumbled.\"\n\"Guarding one another\"—one version reads \"one another\" as \"and.\"\n\"House Six\"—one version reads \"Six\" as \"Seven,\" which is incorrect.\n\"True Yang\"—one version reads \"Yang\" as \"Yin,\" which is incorrect.\n\n\"When Three and Five converge with One,\nAll gather and return to one place.\"\n\nThis refers to the qi of House Six, Pleiades Seven, and Spread Two combining with the North’s Danger One, all converging and returning to a single locus. Within this lies profound transformation: Spread (south) and Danger (north) represent the moon, while House (east) and Pleiades (west) represent the sun. Danger One combined with House Six forms the generative and completive numbers of water. Spread Two combined with Pleiades Seven forms the generative and completive numbers of fire. House Six in the east and Spread Two in the south—wood and fire as companions—combine Six and Two to make Eight. Pleiades Seven in the west and Danger One in the north—metal and water in union—combine Seven and One to make Eight, corresponding to the weight of two eights (one catty). This is what is meant by \"originating from but two things.\"\n\nOne version reads \"converge with One\" as \"converge as One,\" another as \"converge with it and One,\" both of which are incorrect. Another version reads \"one place\" as \"two places,\" which is also incorrect. One must recognize that when Master Wei composed this work, no phrase failed to align with the transformations of creation. If it were instead: \"When Three and Five converge with One, all gather and return to two places,\" what transformation would remain? Moreover, the notion of \"two places\" is particularly egregious. Even if it truly referred to two places, it should say \"divide,\" not \"gather.\" Since it speaks of \"gathering,\" it should say \"one place,\" not \"two places.\"\n\n\"Taking the beginning\"—Zhan Xiashan’s annotation reads \"beginning takes.\"\n\"Red permeates both surface and interior\"—one version reads \"red and black penetrate surface and interior.\"\n\"Millet grain\"—one version reads \"millet\" as \"rice,\" which is incorrect.\n\"As mountain and marsh qi awaits\"—one version reads \"mountain and marsh qi steams together,\" which is incorrect.\n\"For ten thousand generations\"—one version reads \"generations\" as \"eras.\"\n\"And can be examined\"—one version reads \"and\" as \"from.\"\n\"Heart and spirit\"—one version reads \"heart\" as \"soul.\"\n\"Suddenly self-awakened\"—one version reads \"suddenly\" as \"abruptly.\"\n\"Receiving the illustrated records\"—one version reads \"receiving the records of heaven,\" which is incorrect.\n\n**Clarifying Doubts in the \"Tripod Vessel Song\"**\n\n\"Diameter: one fen\"—an old version reads \"diameter\" as \"ten.\"\n\"Length: one foot two inches\"—one version reads \"one foot two inches\" as \"two feet,\" which is incorrect.\n\"Belly aligned with the navel\"—Master Zhu notes: \"Aligned\" here is the ancient form of \"navel.\"\nOne version reads \"belly three navels,\" which is incorrect.\n\"Head and tail martial, center civil\"—this refers to the dark and new moons as head and tail, and the full moon as the center. Head and tail are thus one locus, and the center is also one locus. If one claims that *si* (the sixth Earthly Branch) is the yang *zi* (first Earthly Branch) tail, *wu* (seventh Earthly Branch) is the yin *hai* (twelfth Earthly Branch) head, and *si* and *wu* in both directions form the center, then there would be two heads, two tails, and two centers.\n\nAnother interpretation: when advancing yang fire, *zi*, *chou*, and *yin* (first, second, and third Earthly Branches) are the head, *chen* and *si* (fifth and sixth) are the tail; when retreating yin tally, *wu*, *wei*, and *shen* (seventh, eighth, and ninth) are the head, *xu* and *hai* (eleventh and twelfth) are the tail; the central palace is the center—thus two heads, two tails, and one center. Neither interpretation is stable.\n\n\"Two Sevens gather\"—one version reads \"gather\" as \"orifices,\" which is incorrect.\n\"Gazing at the brain’s texture\"—one version reads \"gazing\" as \"looking up,\" another as \"gallbladder,\" both of which are incorrect.\n\nThe \"three correlations\" refer to the mutual resemblance of the transformations of yin and yang in the *Great Ease* (*Yi*), the Yellow and the Old (Huang-Lao), and furnace alchemy. Ever since Peng Zhenyi depicted the five phases with wood as three, fire as two, earth as five, metal as four, and water as one—forming a diagram of five positions in mutual resonance—later generations have all followed Peng’s interpretation, mistakenly believing it to be Master Wei’s original text and conflating it with the theory of the five phases’ correlations. This error has persisted to this day without challenge, for none have considered what Master Wei truly meant by \"correlation.\" Moreover, the *Yi*’s phrase \"five positions in mutual resonance\" refers to the generative and completive numbers of the five phases. Peng’s system uses only the generative numbers—how can this be called \"five positions in mutual resonance\"? Some argue that wood (three) and fire (two) form one five, metal (four) and water (one) form another five, with central earth (five) completing the three fives, which might still be termed \"three fives in correlation.\" Yet to speak of the five phases’ correlation in this way is untenable: water has its own number (one), fire its own (two), while metal, wood, and earth each differ—where is the correlation? One version reads \"mutually resembling,\" which is somewhat plausible, though still not as clear as \"three correlations.\" Examining the subsequent text, we find: \"The three Ways emerge from one, all following the same path,\" and again: \"Arrayed as three strands, their branches and stems intertwine. Though named differently, they issue from a single gate.\" Here, the meaning of \"three correlations\" is unmistakably evident.\n\nThe \"crude man of Kuai\" is Master Wei’s self-reference. Though Wei was from Shangyu in Kuaiji, he did not call himself \"Kuaiji\" but \"Kuai\" to avoid revealing his native place. Had he written \"Kuaiji\" directly, it would have been a later alteration, not his original wording. \"Clinging to plainness and simplicity\"—one version reads \"embracing simplicity and plainness.\" \"Disdaining power and glory\" means he refused to covet authority or honor. The character *le* (\"joy\") should be read in the departing tone. One version mistakenly writes *huan* (\"delight\") for *quan* (\"power\"). \"Profit and fame\"—one version writes *ling* (\"command\") for *li* (\"profit\"). \"Living in tranquil seclusion\"—one version reads \"a distant traveler in quiet repose.\" \"Observing his inclinations\"—one version writes *zhi* (\"purpose\") for *suo* (\"that which\"). \"Common discourse\"—one version writes *lun* (\"discourse\") for *lun* (\"ethics\"). \"Disseminating transformation\"—one version writes *shen* (\"spirit\") for *shi* (\"to enact\"). \"Returning to the root\"—one version mistakenly writes *yu* (\"foolish\") for *gen* (\"root\"). \"My heart\"—one version writes *xing* (\"form\") for *xin* (\"heart\"). \"Eight minerals\"—one version writes *wu* (\"five\") for *ba* (\"eight\"). \"Perfecting things\"—one version writes *gong* (\"achievement\") for *wu* (\"things\"). \"Abandoning the times to avoid harm, taking refuge in hills and mountains, wandering the vast expanse, dwelling among ghosts, until each bears the other’s burden in stability and long life\"—these sixteen phrases encapsulate the three characters of Wei Boyang’s name. \"Each bears the other’s burden\" refers to: *wei* (委) and *gui* (鬼) combining to form *Wei* (魏); *ren* (人) and *bai* (白) combining to form *Bo* (伯); and *fu* (阝) and *yi* (易) combining to form *Yang* (阳). One version mistakenly writes *xian* (\"immortal\") for *gui* (\"ghost\") and *e* (\"distress\") for *fu* (\"mound\"); another alters \"each bears the other’s burden, stability and long life\" to \"the fortunate bear one another, hidden and long-lived\"; yet another reads \"the fortunate bear one another’s burden, stable and long-lived.\" All are incorrect. Another version writes \"east, west, south, north\" for \"east, west, south, slanting\"; and \"flood, drought, and warfare\" for \"flood and drought separated.\" The *Collected Works* edition emends *lu huo* (炉火) to *lu huo* (炉火). The character *bai* (白) was originally written as *zi* (自), corrected here per the *Siku* edition. \"Eulogy: Resolving Doubts.\" \"Establishing governance\"—one version reads \"holding the ultimate pole.\"\n\nThe phrase \"rice and salt\" here follows the *Records of the Grand Historian: Treatise on the Celestial Offices*. \"Rice and salt divided\" is akin to saying \"black and white clearly distinguished.\" One version mistakenly writes *kan* (坎, Water) and *li* (离, Fire) for \"rice and salt.\" Another alters *yi* (易, Changes) to *jing* (经, Classic). In \"establishing commentary,\" one version incorrectly substitutes *fa* (法, method) for *zhu* (注, commentary). For \"for this,\" one version replaces *ci* (此, this) with *wu* (吾, I).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "周易参同契释疑 经名：周易参同契释疑。 原题全阳子俞琰述。 一卷。 底本出处：《正统道藏》太玄部。 参校版本：文渊阁四库全书本子部道家类（简称四库本）。 周易参同契释疑序#1 林屋山人全阳子俞琰述 世传《周易参同契》上、中、下三篇，合而观之，其辞错乱，本不可以分章也。 彭真一因为解注，遂并魏公《后序》，分为九十章，以应火候之九转； 外余《鼎器歌》一篇，以应真铅之得一。 前辈谓此书词韵皆古，奥雅难通，读者浅闻，妄辄更改，故比他书尤多舛误。 彭公为之分章解义，诚可谓佐佑真经矣。 然承误注释，或取断章，大义虽明，而古文阙裂。 如《易》统天心，可不慎乎之类，皆合与下文连属，而彭本乃截为上章，不成文理意者。 彭义亦为近世浅学妄更，所以若是。 兼又有错简，如象彼仲冬节一章，不当在审而不误之下； 类如鸡子一章，不当在各自独居之下。 陈抱一尝以象彼仲冬节一章移於子当右转之前，亦未为得。 郑虚一所校，自谓详备，而亦有错处，如中而相干，金水合处，与鬼为邻之类，盖不当改，而郑乃改中为午，水为木，鬼为仙，去本义远矣。 然晦爽定为昧爽，鼓下定为鼓铸#2粉提定为服之，厥亦当理。 愚尝合诸本参订之，虽皆出於先正数君子雠校，而其间更有大段舛误，如三五并危一兮，都集归一所，盖谓房六、张二、昴七三方之气并在北方危一，都会集而归於一处也。 旧本乃以危一作为一，归一作归二，非惟失魏公本旨，於理亦自不通。 此无他，盖因危一讹作为一，遂疑其重复而误改之耳。 至若补塞遗脱等语，即魏公自序也。 所谓补塞遗脱，乃指《鼎器歌》也。 魏公恐篇中所述尚有遗脱，故复作此以补塞之，如首尾武，中间文，赡理脑，定升玄之说，篇中皆不曾显言，而此歌遂陈之也。 尝详其序中#3数句，以姓名檃括於其间：首初一句，又拈出参同契者四字，盖此章为魏公自序明矣。 按彭公注本，此序置在《鼎器歌》后。 彭公以《鼎器歌》辞理勾连、字句零碎、分章不得，遂移此序附於三篇之末，分为九十章，以应阳九之数； 退《鼎器歌》独存於后，以应水一之数，此倒置之失，实自彭公始也。 五相类即非五相类，乃三相类也。 三相类者，《大易》、黄老、炉火三者之阴阳造化互相似也。 所谓三道由一，俱出径路。 又日罗列三条，枝茎相连，同出异名，皆由一门是也。 外有《赞序》一篇，或云后序，或云魏公赞后人，莫知所从，遂总名之日《赞序》。 晦庵朱子详其文意，以为注之《后序》，注亡而序存耳。 近世注释者，皆祖朱子此说，因而削去不录。 然旧本既载，不容不存。 愚今并书之以附于卷末，盖不欲弃其旧也。 呜呼，由魏公至于今千有余岁，去古日益远，传讹日益众，或有识者悼古文之久翳，而为之剔伪辩真，众必愕眙非诋，而笑其僭妄。 於是，宁结舌不语，而终莫敢着笔，为是书任其责。 虽然，其如后人何？ 此郑虚一所以甚为是书惜也。",
      "translated_text": "**Explication of Doubts in the *Zhouyi Cantong Qi***\n\n**Title:** *Explication of Doubts in the *Zhouyi Cantong Qi***\n**Author:** Attributed to Quanyangzi Yu Yan of the Línwū Mountain\n**Volume:** One\n**Source Text:** From the *Daoist Canon of the Orthodox Tradition*, *Tai Xuan* Section\n**Collated Edition:** *Complete Library in Four Treasuries*, *Wenyuan Pavilion* edition, *Daoist Works* subsection (hereafter referred to as the *Siku* edition)\n\n---\n\n### **Preface to *Explication of Doubts in the *Zhouyi Cantong Qi*** #1**\n**By Quanyangzi Yu Yan of the Línwū Mountain**\n\nThe world transmits the *Zhouyi Cantong Qi* in three chapters—upper, middle, and lower. When read together, its words appear disordered, and it cannot originally be divided into sections. Peng Zhenyi thus provided annotations, incorporating Wei Gong’s *Postscript* and dividing the text into ninety chapters to correspond to the nine transformations of the fire-phase. Additionally, he appended the *Song of the Cauldron and Vessel* to align with the attainment of the True Lead’s singularity.\n\nElders have noted that the language and rhymes of this work are archaic and profoundly refined, making it difficult to comprehend. Superficial readers, in their ignorance, recklessly alter the text, resulting in even more errors than in other books. Peng’s division into chapters and explication of meanings truly aids the authentic classic. However, in following erroneous interpretations or extracting isolated passages, the overarching principles may be clarified, yet the ancient text becomes fragmented. For instance, phrases such as *\"The Changes unify the heart of Heaven—how could one not be cautious?\"*—which should logically connect to the following text—are arbitrarily severed as the concluding line of a chapter in Peng’s edition, disrupting coherence. Such missteps in Peng’s annotations stem from later shallow scholars’ reckless revisions.\n\nFurthermore, there are misplaced passages. For example, the chapter *\"Like the midwinter node\"* should not appear beneath *\"Examine carefully and avoid error,\"* nor should the chapter *\"Like an egg\"* be placed under *\"Each dwells in solitude.\"* Chen Baoyi once relocated the *\"Like the midwinter node\"* chapter before *\"The child turns to the right,\"* but this was still incorrect. Zheng Xuyi’s collation, though claimed to be meticulous, also contains errors. For instance, *\"Mutually engaging at the center\"* (where metal and water conjoin, neighboring the ghostly) should not have been altered—yet Zheng changed *\"center\"* to *\"noon,\"* *\"water\"* to *\"wood,\"* and *\"ghost\"* to *\"immortal,\"* straying far from the original meaning. Nevertheless, his corrections—such as *\"dark dawn\"* to *\"dim dawn,\"* *\"drum below\"* to *\"smelting,\"* and *\"powder\"* to *\"ingest\"*—were reasonable.\n\nI have collated various editions, all derived from the careful revisions of earlier scholars, yet significant errors persist. For example, *\"The three and five unite in Danger-One, all converging in One Place\"* refers to the qi of the three constellations—Fang (six), Zhang (two), and Mao (seven)—gathering in the northern quadrant of *Danger-One*, coalescing into a single locus. Older editions mistakenly render *\"Danger-One\"* as *\"one\"* and *\"converge in One\"* as *\"converge in two,\"* not only distorting Wei Gong’s intent but also defying logic. This error arose from the misreading of *\"Danger-One\"* as *\"one,\"* leading to the false assumption of redundancy and subsequent miscorrection.\n\nAs for *\"supplementing omissions and filling gaps,\"* these are Wei Gong’s own words in his preface. The *\"supplementing of omissions\"* refers to the *Song of the Cauldron and Vessel*. Fearing that the main text might still contain lacunae, Wei Gong composed this piece to fill them. For instance, the principles of *\"martial at the head and tail, civil in the center,\"* *\"nourishing the brain,\"* and *\"ascending the mysterious\"* are not explicitly stated in the main text but are expounded in this song.\n\nUpon examining several lines in his preface, I find his name subtly embedded within them. The opening line also highlights the four characters *\"Cantong Qi,\"* confirming that this chapter is Wei Gong’s own preface. In Peng’s annotated edition, however, this preface is placed *after* the *Song of the Cauldron and Vessel*. Peng, finding the *Song*’s language and logic fragmented and its verses disjointed—unable to be divided into chapters—relocated the preface to the end of the three main chapters, partitioning it into ninety sections to correspond to the *\"nine yangs.\"* He relegated the *Song* to the rear, aligning it with the *\"one water,\"* thus initiating the error of inversion.\n\nThe *\"Five Mutual Resemblances\"* are not five but three. The *\"Three Mutual Resemblances\"* refer to the mutual resonance of yin-yang transformations in the *Great Changes*, the *Yellow and Lao*, and the *Furnace Fire*. As stated: *\"The three Ways emerge from one, all following the same path,\"* and *\"Three threads arrayed, branches and stems intertwined, sharing one origin under different names, all issuing from a single gate.\"* Additionally, there is a *Eulogy Preface*, sometimes called the *Postscript* or attributed to Wei Gong’s eulogy of later scholars, though its origin remains uncertain; thus, it is collectively termed the *Eulogy Preface*. Zhu Xi of the Huian School meticulously analyzed its content and concluded it was a commentary’s *Postscript*, now lost, leaving only the preface. Modern annotators have all followed Zhu Xi’s interpretation, omitting it from their editions. However, since older editions include it, it cannot be discarded. I have thus appended it to the end of this volume, unwilling to abandon the old.\n\nAlas! From Wei Gong’s time to the present spans over a thousand years. As antiquity recedes, transmission errors multiply. When a discerning scholar laments the long-obscured ancient text and endeavors to excise falsehoods and clarify truth, the multitude inevitably gapes in astonishment, denouncing and mocking their presumption. Thus, they choose silence, never daring to take up the brush and assume responsibility for this work. Yet, what of future generations? This is why Zheng Xuyi so deeply cherished this book.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1126,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.658767461776733,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "愚区区晚学，幸遇明师获承斯道之正传，兼得是书之善本，历试以还，讲明粗熟，期年而书成，深恐推之未尽，言之未详，改窜凡更三四药，又恐后人无以折衷，遂合蜀本、越本、吉本及钱唐诸家之本，互相锣校以为定本。 其诸参错不齐，则有朱子《考异》一书在，兹不复赘云。 时五星聚丑之年，金精满鼎之日，林屋洞天紫庭真逸全阳子书。 #1『周易参同契释疑序』，四库本无之。 其序文参校另以《道藏精华》本为主，特此说明。 #2『鼓铸』，《道藏精华》本作『鼓接』。 #3『序中』，原脱，据《道藏精华》本补。 周易参同契释疑 林屋山人全阳子俞琰述",
      "translated_text": "This humble latecomer to learning was fortunate to encounter an enlightened teacher and receive the authentic transmission of this Dao. Having also obtained a fine edition of this text, I tested its principles in practice and lectured upon them until I gained rough mastery. After a full year, the book was completed. Yet, fearing my explanations might remain incomplete or my words insufficiently detailed, I revised it three or four times. Still concerned that later generations would have no means to reconcile discrepancies, I collated the Shu edition, Yue edition, Ji edition, and various versions from Qiantang, cross-referencing them to establish a definitive text.\n\nAs for the remaining inconsistencies and irregularities, Zhu Xi’s *Textual Investigations* already addresses them, so I shall not belabor the point here.\n\nWritten on the day when the Five Planets conjoined in Chou and the golden essence filled the crucible, by Quanyinzi, the Purple Court Recluse of Linwu Grotto-Heaven.\n\n*Preface to the* Clarifying Doubts on the *Zhouyi Cantong Qi*\n*(Omitted from the Siku edition. The preface has been collated primarily against the* Daoist Canon Essentials *edition. Note: \"Drumming and forging\" in the* Daoist Canon Essentials *appears as \"drumming and striking.\" The character \"in the preface\" was originally missing and has been restored from the* Daoist Canon Essentials *edition.)*\n\n*Clarifying Doubts on the* Zhouyi Cantong Qi\n*By Yuyan, the Hermit of Linwu Mountain, Quanyinzi*",
      "overlap_context": "s time to the present spans over a thousand years. As antiquity recedes, transmission errors multiply. When a discerning scholar laments the long-obscured ancient text and endeavors to excise falsehoods and clarify truth, the multitude inevitably gapes in astonishment, denouncing and mocking their presumption. Thus, they choose silence, never daring to take up the brush and assume responsibility for this work. Yet, what of future generations? This is why Zheng Xuyi so deeply cherished this book.",
      "start_char": 1126,
      "end_char": 1391,
      "start_sentence": 44,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.082842588424683,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "上篇释疑 匡郭，一本匡作垣，陈抱一注本改为围郭，避讳也。 运毂正轴，谓修丹当正其心，犹运毂当正其轴也。 轴在毂内，以贯於毂。 辐则又在毂之外，以辏於毂者也。 一本轴作辐，非是。 牝牡四卦，盖缴上文乾坤门户、坎离匡郭之句总言之也。 此四卦，乃鼎器、药物。 后言六十卦，乃火候也。 如中篇谓四者浑沌，亦是缴上文乾刚坤柔、坎离冠首之句。 后又日六十卦用，张布为舆，恰成六十四卦。 六十四卦皆为吾丹道之用，此所以为《周易参同契》也。 一本以牝牡四卦为震、兑、巽、艮，非是。 以为祟钥。 凝神子陈会真注本以作互。 犹御者之执衔辔，有准绳，正规矩，随轨辙，处中以制外。 谓如御者处於车中，而能制御马之进退，以合乎规绳也。 盖与中篇龙马就驾，明君御时意同。 旧本犹御者之执衔辔，有准绳，作犹工御者执衔辔，准绳墨。 非是。 前辈乃承误注释，以为犹工者之於绳墨规矩、御者之於衔辔轨辙，误矣。 兼并为六十，谓日用两卦，一月三十日兼并为六十卦也。 一本作兼并为六十四，非是。 用之依次序，一本依作如。 《既》、《未》至昧爽。 即下文晦至朔旦之谓也。 一本昧作晦，非是。 盖《既》、《未》即月晦，昧爽即月朔。 若以为《既》、《未》至晦爽则犹言晦至晦爽，於文义大谬矣。 春夏据内体，从子到辰巳； 秋冬当外用，自午讫戌亥。 盖以两卦并言，前一卦属春夏，自子至巳，阳自下而升也。 后一卦属秋冬，自午至亥，阴自上而降也。 若只以一卦言，则一卦止有六爻； 以十二时配之，恰欠其半。 毕竟日用两卦直事，须当以两卦并言。 得其序，一本序作理。 变化於中，晦庵朱子注本变化作升降。 一本作升降变化於其中。 包裹。 盖用文子《通玄真经》语。 旧本作包囊，非是。 以无制有，乃是制造之制，非制御之制也。 大丹之法於无中造出有来，故曰以无制有。 如作制御之制发明，而以无为神，为汞，为离； 以有为气，为铅，为坎，此亦是一说，然非魏公本旨。 愚尝反覆考之，盖因《龙虎经》有所谓有无相制，朱雀炎空。 於是，后#4人更不究上下文之义，竟以制造之制作制御之制说了。 又如中篇谓：刚柔断矣，不相涉入。 言刚柔不相侵逾也。 故继之日：五行守界，不妄盈缩。 却与后章刚柔离分之义不同。 或又泥乎《龙虎经》有所谓刚柔抗衡，不相涉入，非火之咎，谴责於土之说，亦未免以刚柔离分之义说了。 今人相传皆谓魏伯阳因《龙虎经》而作《参同契》，故不得不祖《龙虎经》之说。 殊不知《龙虎经》乃是檃括《参同契》之语，实出於魏公之后。 晦庵朱子云：后人见魏伯阳传有《龙虎上经》一句，遂伪作此经，大皆是体《参同契》而为之。 其间盖有说错了处。 愚向者未得其说，亦弗敢便以朱子此论为然，后来反覆玩味，以《参同契》相对互考其说，乃觉《龙虎经》之破绽旁出，而真是檃括《参同契》之语也。 盖魏公之作《参同契》，乃是假借《同易》爻象发明作丹之秘，非推广《龙虎经》之说。 若果推广《龙虎经》之说，则当日《龙虎参同契》，不得谓之《周易参同契》也。 然而《龙虎经》亦是好文字，是故蔡季通探喜其言，如曰：元君始炼汞，神室含洞虚。",
      "translated_text": "**Clarifying Doubts on the *Zhouyi Cantong Qi*: First Chapter**\n\nThe term *kuangguo* 匡郭—one edition writes 匡 as 垣, while Chen Baoyi’s annotated version emends it to 围郭 to avoid taboo—refers to the alignment of the wheel-hub and axle in the cultivation of the Elixir: just as the axle must be centered within the hub, so too must the heart be rectified in practice. The axle lies within the hub, piercing through it, while the spokes lie outside, converging upon it. One edition mistakenly writes 轴 as 辐.\n\nThe \"four trigrams of the Female and Male\" summarize the preceding lines on Qian and Kun as the gate and door, Kan and Li as the enclosing frame. These four trigrams represent the crucible and the medicinal ingredients, while the sixty trigrams that follow denote the firing times. As the middle chapter states, \"The four are a primordial chaos,\" which likewise refers back to the lines on Qian’s firmness, Kun’s yielding, Kan and Li as the foremost. Later, it speaks of the \"application of the sixty trigrams,\" spreading them out like a chariot, thus completing the sixty-four trigrams. All sixty-four trigrams serve the purpose of our Dao of the Elixir—this is why the text is called the *Zhouyi Cantong Qi*. One edition mistakenly takes the \"four trigrams of the Female and Male\" as Zhen, Dui, Xun, and Gen, which is incorrect.\n\nThe phrase \"like the key to a lock\" is rendered as \"mutual\" in Ningshenzi Chen Huizhen’s annotated edition. It means that, just as a charioteer holds the reins and bit, adhering to the guiding rope, the compass, and the carpenter’s square, following the wheel tracks while remaining centered to control what lies outside, so too does the practitioner, seated within the chariot, govern the horse’s advance and retreat, aligning with the rules and measures. This echoes the middle chapter’s \"the dragon and horse are harnessed,\" where the enlightened ruler masters the times. An older edition mistakenly writes \"like the charioteer holding the reins and bit, with the guiding rope\" as \"like the craftsman holding the reins and bit, with the guiding rope and carpenter’s square.\" This error was perpetuated by earlier commentators, who took it to mean \"like the craftsman’s use of the guiding rope, compass, and square, or the charioteer’s use of the reins, bit, and wheel tracks,\" which is incorrect.\n\n\"Combining to make sixty\" refers to the daily use of two trigrams, which over thirty days of a month combine to form sixty trigrams. One edition mistakenly writes \"combining to make sixty-four.\" \"Proceeding in sequence\" is rendered as \"proceeding as\" in one edition.\n\nFrom *Ji* and *Wei* to *mei*-dawn refers to the passage below on \"from the dark of the moon to the dawn of the new moon.\" One edition mistakenly writes *mei* as *hui*. Here, *Ji* and *Wei* denote the dark of the moon, while *mei*-dawn signifies the new moon. To interpret it as \"from *Ji* and *Wei* to the dawn of the dark moon\" would be to say \"from the dark of the moon to the dawn of the dark moon,\" which grossly distorts the meaning.\n\n\"Spring and summer rely on the inner body, from *zi* to *chen* and *si*; autumn and winter apply to external use, from *wu* to *xu* and *hai*.\" This refers to the pairing of two trigrams: the first, belonging to spring and summer, spans from *zi* to *si*, as yang ascends from below; the second, belonging to autumn and winter, spans from *wu* to *hai*, as yin descends from above. If taken as a single trigram, it would have only six lines, and when matched with the twelve hours, exactly half would be missing. Thus, the daily practice of two trigrams must be understood as referring to both together.\n\n\"Attaining its sequence\"—one edition writes 序 as 理. \"Transformation occurs within\"—Zhu Xi’s annotated edition writes 变化 as 升降. One edition writes \"ascending and descending, transforming within it.\"\n\n\"Enveloping\" alludes to a passage in *Wenzi*’s *Tongxuan Zhenjing*. An older edition mistakenly writes 包裹 as 包囊.\n\n\"Using the formless to shape the formed\" refers to the *zhi* of creation, not the *zhi* of control. The Great Elixir’s method creates something from nothing, hence \"using the formless to shape the formed.\" Some interpret this as the *zhi* of control, taking \"formless\" as spirit, mercury, or Li, and \"formed\" as qi, lead, or Kan. While this is one possible reading, it is not Master Wei’s original intent.\n\nI have repeatedly examined this matter and found that later scholars, misled by the *Longhu Jing*’s line \"the formless and the formed mutually control each other, the Vermilion Bird flames in the void,\" failed to consider the broader context and mistakenly applied the *zhi* of creation to the *zhi* of control. Similarly, the middle chapter states: \"The firm and the yielding are distinct, not intermingling,\" meaning they do not encroach upon one another. It continues: \"The Five Phases guard their boundaries, neither recklessly expanding nor contracting.\" This differs from the later chapter’s meaning of the firm and yielding being separate.\n\nSome, clinging to the *Longhu Jing*’s line \"the firm and yielding contend, not intermingling, which is not the fault of fire, but the blame lies with earth,\" have also misapplied this to the meaning of the firm and yielding being separate. Modern scholars commonly claim that Wei Boyang composed the *Cantong Qi* based on the *Longhu Jing*, and thus must defer to its interpretations. Yet they do not realize that the *Longhu Jing* merely paraphrases the *Cantong Qi* and was actually written after Master Wei’s work.\n\nZhu Xi of Huian remarked: \"Later scholars, seeing that Wei Boyang’s transmission mentions the *Longhu Shangjing*, fabricated this text, largely modeling it after the *Cantong Qi* but introducing errors.\" I once hesitated to accept Zhu Xi’s view, but upon repeated reflection and cross-examination with the *Cantong Qi*, I came to see the *Longhu Jing*’s inconsistencies and realized it truly is a paraphrase of the *Cantong Qi*.\n\nMaster Wei’s *Cantong Qi* borrows the hexagrams of the *Zhouyi* to elucidate the secrets of Elixir-making, not to expand upon the *Longhu Jing*. Had he intended to expand upon the *Longhu Jing*, the text would have been called the *Longhu Cantong Qi*, not the *Zhouyi Cantong Qi*. Nevertheless, the *Longhu Jing* remains a fine work, which is why Cai Jitong admired its lines, such as: \"The Primordial Lord first refines mercury, the divine chamber containing the cavernous void.\"",
      "overlap_context": "\n*Preface to the* Clarifying Doubts on the *Zhouyi Cantong Qi*\n*(Omitted from the Siku edition. The preface has been collated primarily against the* Daoist Canon Essentials *edition. Note: \"Drumming and forging\" in the* Daoist Canon Essentials *appears as \"drumming and striking.\" The character \"in the preface\" was originally missing and has been restored from the* Daoist Canon Essentials *edition.)*\n\n*Clarifying Doubts on the* Zhouyi Cantong Qi\n*By Yuyan, the Hermit of Linwu Mountain, Quanyinzi*",
      "start_char": 1391,
      "end_char": 2636,
      "start_sentence": 53,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.59479999542236,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "又曰：自然之要，先存后亡。 诚为至论。 但不是魏公以前之书耳。 器用者空，李抱素注本者作皆。 为征，一本征作证。 相当，一本当作合，非是。 始终，一本作终始，非是。 皆禀中宫，一本禀作在，一本作中宫所禀，非是。 之时，一本时作际。 统黄化，一本作化黄包。 鄞鄂，朱子《考异》作根鄂，鄂即萼也。 《诗》云：鄂不□□#5，是此鄂字。 或作垠堮，或作圻堮，或作釿锷，皆非是。 称元皇，一本称作当。 元年，一本年作炁。 乃芽滋，一本作芽乃生。 一本作乃牙滋。 复卦建始初，或疑与《关睢》建始初重复，遂改初为萌。 朱子谓此乃不谓古韵者妄改之也。 又如下文九六亦相当，或疑与刚柔相当重复，而改当为应。 皆非是。 日月无双明，谓日出则月没，月出则日没，昼夜递照#6迭为出没也。 一本无作炁，非是。 盖古先无字皆作无，如《易》所谓无妄、无咎，皆此无字。 一本作焕炳而成双。 兔者吐生光，一本作兔魄吐精光，一本作兔魄吐生光。 东方丧其明，旧本作东北丧其明，盖因《易》有束北丧朋之语，遂相承其误，习之而弗察也。 按《坤》卦云：西南得朋，东北丧朋。 盖谓坤位西南，西有兑，南有离、巽，皆阴卦也； 以阴从阴，故云得朋。 若东北，则震、艮、坎、乾皆阳卦也，故云丧朋。 今魏公谓：坤乙三十日，东方丧其明。 盖言三十日之晨，太阴没於东方乙位，即非用《坤》卦东北丧朋之说。 何以明之？ 盖西方庚辛、南方丙丁、东方甲乙，乃一月六节内太阴昏见晨没之地，王保义所谓月有三移是也。 今夫月之三日昏见于西方庚，至十六则晨没于西方辛； 八日昏见于南方丁，至二十三则晨没于南方丙； 十五日昏见于东方甲，至三十则晨没于东方乙，其理盖晓然矣。 岂得乙为东北耶？ 自古甲之与乙俱列于东方，即不在东北。 今以乙为东北，则乾体就之时，曷不谓之盛满甲东北耶？ 甲近东北且不谓之东北，何况乙在甲之前而又近东南？ 其非东北也明矣。 九六亦相当，上文《复》卦建始初下已释之。 《易》象索灭藏，谓三十日之夜，日月之象俱沉於北方也。 一本《易》象作阳炁，非是。 象彼仲冬节至以晓后生盲。 旧本错於《后序》，陈抱一移置子当右转之前，皆非是。 按此章凡押两伤字，并上文《易》象索灭藏连之，则又押两藏字。 盖古人多用重韵，后人不晓，往往妄乱迁改，遂使文意不连属。 如上文《关雎》建始初与《复》卦建始初。 又如刚柔相当与九六亦相当，皆重韵也。 岂可遽以重韵而害其正文哉？ 商旅，一本商作贾。 浩广，一本广作旷。 眇难睹，一本睹作觌。 符征，一本征作证。 节令，一本节作时。 中稽於人心，一本心作情。 依卦变，一本作循卦节。 循《象》辞，一本循作因、彖作象，非是。 乾坤用施行，天地然后治。 一本治作理，一本作天下然后治。 此二句似乎引用《乾》卦乾元用九天下治之文，然按上文坎离者乾坤二用，则是坎离为乾坤之用，非谓用九、用六也。 如上文东方丧其明，亦非用《坤》卦东北丧朋之义。 盖魏公之为是书，大率皆是假借，正不必牵泥也。 可不慎乎，一本作可得不慎乎，非是。 魁杓，一本杓作柄。 誃离，即别离也。 一本作移离，一本作坎离。",
      "translated_text": "Moreover, it states: \"The essential principle of the natural is first to preserve, then to let perish.\" This is indeed a profound insight, though it is not a text from before Master Wei’s time. Where it reads \"the vessels and implements are empty,\" the Li Baosu annotated edition has \"all.\" As evidence, one version has \"evidence\" (征) written as \"proof\" (证), which is acceptable, while another has \"should\" (当) instead of \"correspond\" (相当), which is incorrect. Where it reads \"from beginning to end,\" one version has \"from end to beginning\" (终始), which is also incorrect. Where it reads \"all receive from the Central Palace,\" one version has \"in\" (在) instead of \"receive\" (禀), and another has \"the Central Palace receives\" (中宫所禀), both of which are incorrect. Where it reads \"at this time\" (之时), one version has \"at this juncture\" (际). Where it reads \"governing the Yellow and transforming,\" one version has \"transforming the Yellow and enveloping\" (化黄包).\n\nFor \"鄞鄂,\" Zhu Xi’s *Textual Variants* renders it as \"根鄂,\" where \"鄂\" means \"calyx.\" As the *Book of Songs* says: \"The calyx does not...\"—this is the same \"鄂\" character. Some versions write it as \"垠堮,\" \"圻堮,\" or \"釿锷,\" all of which are incorrect. Where it reads \"entitled the Primordial Sovereign\" (称元皇), one version has \"should be entitled\" (当). Where it reads \"the first year\" (元年), one version has \"the first qi\" (元炁). Where it reads \"then the sprout flourishes\" (乃芽滋), one version has \"then the sprout arises\" (芽乃生), and another has \"then the bud flourishes\" (乃牙滋).\n\nRegarding the line \"The *Fu* hexagram establishes the initial,\" some suspected it repeated the \"establishes the initial\" in the *Guan Ju* and thus changed \"initial\" (初) to \"sprout\" (萌). Zhu Xi noted that this was a reckless alteration by those ignorant of ancient rhyme. Similarly, in the line \"the nine and six also correspond\" (九六亦相当), some suspected it repeated \"hard and soft correspond\" (刚柔相当) and changed \"correspond\" (当) to \"respond\" (应), which is also incorrect.\n\nThe line \"sun and moon have no dual brightness\" means that when the sun rises, the moon sets, and when the moon rises, the sun sets, alternating their illumination day and night. One version replaces \"no\" (无) with \"qi\" (炁), which is incorrect. In ancient times, \"无\" was used for \"no,\" as in the *Yi*’s \"no delusion\" (无妄) and \"no blame\" (无咎). Another version has \"brilliant and forming a pair\" (焕炳而成双).\n\nWhere it reads \"the rabbit spits forth its light,\" one version has \"the rabbit’s essence spits forth radiant light\" (兔魄吐精光), and another has \"the rabbit’s essence spits forth its light\" (兔魄吐生光). Where it reads \"the East loses its brightness\" (东方丧其明), an old version has \"the Northeast loses its brightness\" (东北丧其明), likely following the *Yi*’s phrase \"the Northeast loses its companion\" (东北丧朋) and perpetuating the error through habit. However, the *Kun* hexagram states: \"In the Southwest, it gains companions; in the Northeast, it loses companions.\" This refers to the *Kun* position in the Southwest, where *Dui* (West), *Li* (South), and *Xun* (Southeast) are all yin hexagrams; yin following yin is called \"gaining companions.\" In the Northeast, *Zhen*, *Gen*, *Kan*, and *Qian* are all yang hexagrams, hence \"losing companions.\" Yet Master Wei’s line, \"On the thirtieth day of *Kun*-yi, the East loses its brightness,\" refers to the morning of the thirtieth day when the Great Yin sets in the eastern *yi* position—it does not employ the *Kun* hexagram’s \"Northeast loses companions.\" How is this clarified?\n\nThe Western regions *geng* and *xin*, the Southern regions *bing* and *ding*, and the Eastern regions *jia* and *yi* are the six nodes within a month where the Great Yin appears at dusk and sets at dawn—what Wang Baoyi called the \"three shifts of the moon.\" On the third day, the moon appears at dusk in the West at *geng* and sets at dawn on the sixteenth in the West at *xin*; on the eighth day, it appears at dusk in the South at *ding* and sets at dawn on the twenty-third in the South at *bing*; on the fifteenth day, it appears at dusk in the East at *jia* and sets at dawn on the thirtieth in the East at *yi*. The principle is thus clear. How could *yi* be the Northeast? Since ancient times, *jia* and *yi* have both been placed in the East, not the Northeast. If *yi* were the Northeast, then when the *Qian* trigram aligns with it, why not call it \"abundant and full in *jia* Northeast\"? *Jia*, being closer to the Northeast, is not called the Northeast, so how much less could *yi*, which precedes *jia* and is closer to the Southeast, be the Northeast? Its non-Northeastern position is evident.\n\nThe line \"the nine and six also correspond\" was explained earlier under the *Fu* hexagram’s \"establishes the initial.\" The phrase \"the images of the *Yi* perish and conceal\" refers to the night of the thirtieth day, when the images of the sun and moon both sink in the North. One version has \"yang qi\" (阳炁) instead of \"images of the *Yi*\" (《易》象), which is incorrect. The line \"like the midwinter node, it illuminates the blind after birth\" was misplaced in the *Postscript* in the old edition. Chen Baoyi moved it to before \"turning right,\" but both arrangements are incorrect. This passage rhymes with two \"injured\" (伤) characters and, when connected to the earlier \"the images of the *Yi* perish and conceal,\" also rhymes with two \"conceal\" (藏) characters. Ancient writers often used repeated rhymes, but later scholars, not understanding this, recklessly altered the text, disrupting its coherence. Examples include the repeated \"establishes the initial\" in the *Guan Ju* and the *Fu* hexagram, and the repeated \"correspond\" in \"hard and soft correspond\" and \"the nine and six also correspond.\" How could one hastily alter the correct text due to repeated rhymes?\n\nWhere it reads \"merchants and travelers\" (商旅), one version has \"merchants\" (贾). Where it reads \"vast and expansive\" (浩广), one version has \"vast and boundless\" (浩旷). Where it reads \"subtle and hard to perceive\" (眇难睹), one version has \"hard to behold\" (难觌). Where it reads \"signs and evidence\" (符征), one version has \"signs and proof\" (符证). Where it reads \"seasonal ordinances\" (节令), one version has \"timely ordinances\" (时令). Where it reads \"examined within the human heart\" (中稽於人心), one version has \"examined within human emotions\" (中稽於人情). Where it reads \"following the hexagram’s changes\" (依卦变), one version has \"following the hexagram’s nodes\" (循卦节). Where it reads \"following the *Xiang* commentary\" (循《象》辞), one version has \"relying on the *Tuan*\" (因《彖》) instead of \"following the *Xiang*,\" which is incorrect.\n\nThe lines \"When *Qian* and *Kun* are employed, Heaven and Earth are then ordered\" seem to quote the *Qian* hexagram’s \"When the yang of *Qian* is employed, the world is ordered,\" but given the earlier line \"Kan and Li are the two functions of *Qian* and *Kun*,\" this refers to Kan and Li as the functions of *Qian* and *Kun*, not the \"employing nine\" or \"employing six.\" Just as the earlier \"the East loses its brightness\" does not use the *Kun* hexagram’s \"Northeast loses companions,\" Master Wei’s composition of this text largely employs borrowing and need not be rigidly adhered to.\n\nThe line \"Can one not be cautious?\" (可不慎乎) has one version that reads \"Can one fail to be cautious?\" (可得不慎乎), which is incorrect. Where it reads \"the Dipper’s handle\" (魁杓), one version has \"handle\" (柄) instead of \"ladle\" (杓). \"誃离\" means \"separation,\" with one version writing it as \"移离\" and another as \"坎离.\"",
      "overlap_context": " the *Cantong Qi*.\n\nMaster Wei’s *Cantong Qi* borrows the hexagrams of the *Zhouyi* to elucidate the secrets of Elixir-making, not to expand upon the *Longhu Jing*. Had he intended to expand upon the *Longhu Jing*, the text would have been called the *Longhu Cantong Qi*, not the *Zhouyi Cantong Qi*. Nevertheless, the *Longhu Jing* remains a fine work, which is why Cai Jitong admired its lines, such as: \"The Primordial Lord first refines mercury, the divine chamber containing the cavernous void.\"",
      "start_char": 2636,
      "end_char": 3929,
      "start_sentence": 114,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.47566318511963,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "仰俯，他本皆作俯仰。 朱子谓：当作仰俯，乃吁韵，今从之。 统录，一本统作总。 日含五行精，一本含作合，非是。 诘过贻主，一本作结过移主。 辰极处正，一本处作受#7，一本正作政。 布政，一本作政德。 终修，一本修作循，一本作中美#8。 以掩蔽，一本以作已。 有无亦相须，谓水火二气相资而成造化也。 有无，或作金炁，或作吟炁，皆非是。 进退分布，一本进退作退而，非是。 采之类白，一本采作望，一本作摇。 白#9裹，一本作包裹。 相扶，一本扶作拘。 相连，一本连作通。 是非历藏法，谓此道非历五脏存思之法也。 若以是非两字作是是非非之义，则误矣。 次日辰，一本次作以，非是。 累土，一本作周回。 而意悦，一本作意悦喜。 跨火不焦，入水不濡。 道成之后，法身则然。 若以血肉之躯投界水火，则岂特焦濡而已哉？ 移居，一本居作名，非是。 功满，一本满作成，非是。 偃月，按下文曰汞日，则偃疑作铅，音声相传之讹耳。 作鼎炉，旧本作作法，非是。 艮亦八，一本作亦如之。 亏明，一本明作伤。 金本从日生，朔旦受日符。 谓月之光从日而生，每月朔旦与日相合也。 盖金火即日月也。 旧本日作月，非是。 若以为金本从月生，则犹日月本从月生。 此何义理？ 数称五，一本数作号。 含育，一本作贪欲。 伫息，谓凝伫呼吸之息，二者合而为一，如夫妇之交合也。 一本息作思，一本作恩，皆非是。 执平，一本执作气。 土游於四季，守界定规矩。 诸本皆在寿命得长久之下，惟郑虚一本却在本性共宗祖之下。 金以砂为主，禀和於水银。 即是直指凡砂、凡汞之造化，以譬喻丹法之造化，却非假借外一物以比并内一物，相对而言也。 以黍，一本黍作粟，非是。 其卵，一本卵作子，非是。 泥汞，一本汞作澒。 炼飞，一本飞作治，一本作持。 鼓铸，一本铸作下，非是。 杂性不同类，一本类作种。 侥幸讫不遇，圣人独知之。 朱子本无此十字。 生狐疑，一本生作坐。 始画八卦，效法天地。 一本作：始画八卦象，效法天地图。 一本作：画八卦，效天图。 皆非是。 循而。",
      "translated_text": "Here follows the translation:\n\n---\n\nSome versions render \"仰俯\" as \"俯仰.\" Master Zhu stated that it should read \"仰俯,\" as this follows the *xu* rhyme, and we adopt this reading. In one version, \"統錄\" appears as \"總錄.\" Where it reads \"日含五行精,\" one version has \"合\" instead of \"含,\" which is incorrect. \"诘过贻主\" appears in one version as \"结过移主.\" For \"辰极处正,\" one version has \"受\" instead of \"处,\" and another has \"政\" instead of \"正.\" \"布政\" appears in one version as \"政德.\" \"终修\" is rendered in one version as \"终循\" and in another as \"中美.\" Where it reads \"以掩蔽,\" one version has \"已\" instead of \"以.\"\n\n\"有无亦相须\" refers to the mutual dependence of water and fire, the two *qi*, in completing the transformations of creation. Some versions render \"有无\" as \"金炁\" or \"吟炁,\" both of which are incorrect. \"进退分布\" appears in one version as \"退而分布,\" which is incorrect. \"采之类白\" is rendered in one version as \"望之类白\" and in another as \"摇之类白.\" \"白裹\" appears in one version as \"包裹.\" \"相扶\" is rendered in one version as \"相拘.\" \"相连\" appears in one version as \"相通.\"\n\n\"This is not the method of storing within the five viscera\" (是非歷藏法) means that this Dao is not the method of visualizing and storing within the five viscera. If one takes the words \"是非\" to mean \"right and wrong,\" one has misunderstood. \"次日辰\" appears in one version as \"以日辰,\" which is incorrect. \"累土\" appears in one version as \"周回.\" \"而意悦\" is rendered in one version as \"意悦喜.\"\n\n\"Straddling fire, one is not scorched; entering water, one is not drenched.\" This describes the dharma-body after the Dao is accomplished. If one were to cast the fleshly body into water or fire, how could one escape being scorched or drenched? \"移居\" appears in one version as \"移名,\" which is incorrect. \"功滿\" appears in one version as \"功成,\" which is incorrect.\n\n\"偃月\" (reclining moon): given that the text below reads \"汞日\" (mercury-sun), \"偃\" is likely a corruption of \"鉛\" (lead), a transmission error of sound. Where it reads \"作鼎爐,\" an older version has \"作法,\" which is incorrect. \"艮亦八\" appears in one version as \"亦如之.\" \"亏明\" appears in one version as \"亏伤.\"\n\n\"Gold’s essence derives from the sun’s radiance; at dawn of the new moon, it receives the solar tally.\" This means that the moon’s light is born from the sun, and at the dawn of each new moon, it conjoins with the sun. For gold and fire are none other than the sun and moon. An older version has \"月\" instead of \"日,\" which is incorrect. If one were to think that gold’s essence derives from the moon, it would be as if the sun and moon themselves derived from the moon—what principle could justify this?\n\n\"數稱五\" appears in one version as \"號稱五.\" \"含育\" appears in one version as \"貪欲.\" \"伫息\" refers to the conjoining of concentrated stillness and the breath, the two merging as one, like the union of husband and wife. One version has \"思\" instead of \"息,\" and another has \"恩,\" both of which are incorrect. \"執平\" appears in one version as \"氣平.\"\n\n\"Earth wanders through the four seasons, guarding its boundaries and fixing its rules.\" In all versions, this line appears below \"longevity is attained,\" but in Zheng Xu’s version, it appears below \"fundamental nature shares a common origin.\" \"Gold takes cinnabar as its master, harmonizing with mercury.\" This directly points to the transformations of ordinary cinnabar and ordinary mercury, using them as metaphors for the transformations in the elixir method. It is not a matter of borrowing one external thing to compare with one internal thing, nor of setting them in opposition.\n\n\"以黍\" appears in one version as \"以粟,\" which is incorrect. \"其卵\" appears in one version as \"其子,\" which is incorrect. \"泥汞\" appears in one version as \"泥澒.\" \"炼飞\" appears in one version as \"炼治\" and in another as \"炼持.\" \"鼓铸\" appears in one version as \"鼓下,\" which is incorrect. \"杂性不同类\" appears in one version as \"杂性不同种.\"\n\n\"Those who rely on luck never meet success; only the sage knows this.\" These ten characters are absent in Master Zhu’s version. \"生狐疑\" appears in one version as \"坐狐疑.\" \"始畫八卦，效法天地\" appears in one version as \"始畫八卦象，效法天地圖\" and in another as \"畫八卦，效天圖,\" both of which are incorrect. \"循而.\"",
      "overlap_context": " East loses its brightness\" does not use the *Kun* hexagram’s \"Northeast loses companions,\" Master Wei’s composition of this text largely employs borrowing and need not be rigidly adhered to.\n\nThe line \"Can one not be cautious?\" (可不慎乎) has one version that reads \"Can one fail to be cautious?\" (可得不慎乎), which is incorrect. Where it reads \"the Dipper’s handle\" (魁杓), one version has \"handle\" (柄) instead of \"ladle\" (杓). \"誃离\" means \"separation,\" with one version writing it as \"移离\" and another as \"坎离.\"",
      "start_char": 3930,
      "end_char": 4841,
      "start_sentence": 184,
      "end_sentence": 242,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.5027756690979,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "一本作结体。 庶圣，谓无位之圣人也，孔子是已。 一本作圣者与，非是。 三君，一本君作圣。 令可法，一本令作诚。 为世定此书，谓金丹大道无形无兆，无以使后人取法，故定此《参同契》 一书于世。 与中篇定录斯文义同。 旧本作为世定诗书，非是。 窃为，一本为作待。 辄思虑，一本作缀斯愚，非是。 金计有十五，水数亦如之。 即前章所谓上弦兑数八，下弦艮亦八也。 盖上弦金半斤，下弦水半斤，以两弦相合而观之，则成一月三十日之数，却与水中金之义不同。 一本金计有十五作金数十有五。 其土遂不入，二者与之俱，三物相含受，变化状若神。 此三物即是金、水、土三件。 金、水二者与土合而为一，故曰三物相含受。 若又添水火言，则成五物矣。 或以三物为金、火、木，以二者为水、火，冗杂殆甚，非至论也。 一本其土作其三； 二者作火二，又作水二，皆非是。 捣治，一本作铸冶。 致坚完，一本致作致。 炎火张於下，龙虎声正勤。 与下篇升熬於甑山兮，炎火张设下； 白虎倡导前兮，苍龙和於后，实同一义。 旧本龙虎作昼夜，非是。 始文使可修，一本作始初文可修。 亲观，一本作相亲，一本作须亲。 服之，一本作粉提，一本作粉捏，一本作提粉，皆非是。 一丸，一本丸作元，一本作粒，皆非是。 刀圭，即是刀头圭角些子而已，言其不多也。 若以刀为金，圭为二土，巧则巧矣，然非魏公之本旨也。 较约，一本较作简。 光明，一本明作荣，非是。 薄蚀，一本作激薄。 显龙虎，一本显作题。 嘉黄芽，一本嘉作加。 #4『后』，原作『复』，据四库本改。 #5『韩』，原作『韩』，据四库本改。 #6『递照』，四库本作『递照』。 #7『受』，原脱，据四库本补。 #8『作中美』，原脱，据四库本补。 #9『白』，原作『日』，据四库本补。 中篇释疑 偕以造化，一本偕作须，一本作始。 元基，一本作玄基，一本作元模。 六十卦用，张布为舆。 一本用作周，非是。 不邪，一本邪作陂。 倾危国家，一本作家国倾危。 卦日，一本日作月。 六十卦用，各自有日。 一本六十卦用作余六十卦，非是。 在义设刑，旧本在作立。 日辰，一本辰作夜。 用心，一本作逆贼，一本作迸散。 己口，一本己作鼎。 之来，一本来作中。 刚柔断矣，不相涉入。 上篇以无制有下已释之。 晦朔之问，合符行中，至始於东北箕、斗之乡。 盖晦朔之问，乃是亥后子前，日月於此而隐藏； 箕、斗之乡，乃是艮后寅前，日月自此而旋起。 以比喻丹法之妙与天地日月同途也。 或者径以艮后寅前为晦朔之问，为一阳生采药之候，则相去远矣。 旋而右转，呕轮吐萌。 谓阳火自腰问旋斗历箕，上至玄关，则光耀透于帘帷之外也。 一本旋而作左旋。 昴毕之上，震出为征。 盖谓月初生见於西方，其象如震，以喻身中火候也。 若以月出方位论先天八卦方位，则先天之震不在西，火候之震亦不在西。 既不识其落处，徒见其说之相戾耳。 和平，一本和作初。",
      "translated_text": "One version reads \"structural formation\" instead of \"one version.\"\n\n\"庶圣\" refers to the sage without rank—Confucius is such a one. One version reads \"the sage and,\" which is incorrect.\n\n\"三君\" appears in one version as \"three sages.\" \"令可法\" appears in one version as \"诚可法.\"\n\n\"为世定此书\" means that the Great Dao of the Golden Elixir is formless and traceless, leaving nothing for later generations to emulate. Thus, this *Cantong qi* was established for the world. This aligns in meaning with the middle section’s \"定录斯文.\"\n\nAn old version reads \"为世定诗书,\" which is incorrect. \"窃为\" appears in one version as \"窃待.\" \"辄思虑\" appears in one version as \"缀斯愚,\" which is incorrect.\n\n\"金计有十五，水数亦如之\" refers to the earlier chapter’s \"上弦兑数八，下弦艮亦八.\" For the upper quarter, metal weighs half a catty; for the lower quarter, water weighs half a catty. When the two quarters are combined, they form the number of days in a month—thirty—though this differs from the meaning of \"metal within water.\"\n\nOne version reads \"金数十有五\" instead of \"金计有十五.\"\n\n\"其土遂不入，二者与之俱，三物相含受，变化状若神.\" These three things are metal, water, and earth. When metal and water combine with earth, they become one, hence \"three things mutually containing and receiving.\" If fire were added, it would become five things.\n\nSome interpret the three things as metal, fire, and wood, and the two things as water and fire, but this is overly convoluted and not the profound teaching. One version reads \"其三\" instead of \"其土\"; another reads \"火二\" or \"水二\" instead of \"二者,\" both of which are incorrect.\n\n\"捣治\" appears in one version as \"铸冶.\" \"致坚完\" appears in one version as \"致坚完\" (with \"致\" unchanged).\n\n\"炎火张於下，龙虎声正勤\" shares the same meaning as the later passage: \"升熬於甑山兮，炎火张设下；白虎倡导前兮，苍龙和於后.\" An old version reads \"昼夜\" instead of \"龙虎,\" which is incorrect.\n\n\"始文使可修\" appears in one version as \"始初文可修.\" \"亲观\" appears in one version as \"相亲\" and another as \"须亲.\"\n\n\"服之\" appears in one version as \"粉提,\" another as \"粉捏,\" and another as \"提粉,\" all of which are incorrect. \"一丸\" appears in one version as \"一元\" and another as \"一粒,\" both incorrect.\n\n\"刀圭\" refers merely to the tip of a knife’s edge, indicating its small quantity. While one might cleverly interpret \"刀\" as metal and \"圭\" as two earths, this is not Master Wei’s original intent.\n\n\"较约\" appears in one version as \"简约.\" \"光明\" appears in one version as \"光荣,\" which is incorrect. \"薄蚀\" appears in one version as \"激薄.\" \"显龙虎\" appears in one version as \"题龙虎.\" \"嘉黄芽\" appears in one version as \"加黄芽.\"\n\n---\n\n**Middle Section: Resolving Doubts**\n\n\"偕以造化\" appears in one version as \"须以造化\" and another as \"始以造化.\" \"元基\" appears in one version as \"玄基\" and another as \"元模.\"\n\n\"六十卦用，张布为舆\" appears in one version as \"六十卦周,\" which is incorrect. \"不邪\" appears in one version as \"不陂.\" \"倾危国家\" appears in one version as \"家国倾危.\"\n\n\"卦日\" appears in one version as \"卦月.\" \"六十卦用，各自有日\" appears in one version as \"余六十卦,\" which is incorrect.\n\n\"在义设刑\" appears in an old version as \"立义设刑.\" \"日辰\" appears in one version as \"日夜.\" \"用心\" appears in one version as \"逆贼\" and another as \"迸散.\"\n\n\"己口\" appears in one version as \"鼎口.\" \"之来\" appears in one version as \"之中.\" \"刚柔断矣，不相涉入\" was previously explained in the upper section under \"以无制有.\"\n\n\"晦朔之问，合符行中，至始於东北箕、斗之乡.\" The interval between the last day of the lunar month and the first is the time after *hai* and before *zi*, when the sun and moon conceal themselves. The region of *Ji* and *Dou* lies after *gen* and before *yin*, where the sun and moon begin their revolution. This metaphorically illustrates the subtlety of the elixir method, which follows the same path as heaven, earth, the sun, and the moon.\n\nSome directly take the time after *gen* and before *yin* as the interval between the last and first days of the lunar month, considering it the moment when the first yang arises and the medicine is gathered. This interpretation is far off the mark.\n\n\"旋而右转，呕轮吐萌\" describes the yang fire rotating from the waist, passing through *Dou* and *Ji*, and ascending to the *Xuan Guan*, where its radiance shines beyond the curtains. One version reads \"左旋\" instead of \"旋而右转.\"\n\n\"昴毕之上，震出为征\" refers to the moon’s initial appearance in the west, resembling the trigram *Zhen*, symbolizing the fire timing within the body. If one interprets the moon’s rising position according to the *Xiantian* eight trigrams, *Zhen* in the *Xiantian* arrangement is not in the west, nor is the fire timing’s *Zhen* in the west. Failing to grasp its true meaning, one merely sees contradictions in the text.\n\n\"和平\" appears in one version as \"初和.\"",
      "overlap_context": "which is incorrect. \"泥汞\" appears in one version as \"泥澒.\" \"炼飞\" appears in one version as \"炼治\" and in another as \"炼持.\" \"鼓铸\" appears in one version as \"鼓下,\" which is incorrect. \"杂性不同类\" appears in one version as \"杂性不同种.\"\n\n\"Those who rely on luck never meet success; only the sage knows this.\" These ten characters are absent in Master Zhu’s version. \"生狐疑\" appears in one version as \"坐狐疑.\" \"始畫八卦，效法天地\" appears in one version as \"始畫八卦象，效法天地圖\" and in another as \"畫八卦，效天圖,\" both of which are incorrect. \"循而.\"",
      "start_char": 4841,
      "end_char": 6091,
      "start_sentence": 243,
      "end_sentence": 316,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.681843996047974,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "其统，一本其作阴。 六五坤承，谓六五三十日，却非谓《坤》卦六五爻也。 阳数已讫，讫则复起。 推情合性，转而相与。 诸本皆在为道规矩之下，惟朱子本在世为类母之下，非是。 周流六爻，一本流作章，非是。 难以，一本以作可。 滋彰，一本彰作亨。 生光，一本生作正，非是。 渐进，一本渐作寝。 成泰，一本成作承。 运而，一本而作移。 榆荚，一本荚作叶，非是。 振索，一本索作京。 阳终於巳，中而相干。 谓四月属巳，律应中吕也。 霞山子詹谷注本中而作中吕，一本中作午，非是。 午为蕤宾。 为，一本#10作主。 游世去位，一本作遁去世位，非是。 其精，一本其作真。 阴伸阳屈，毁伤姓名。 谓七月属申，律应夷则也。 伸即申也，伤即夷也。 旧本毁伤作没阳，一本作没扬，皆非是。 消灭，一本灭作息，非是。 至神，一本至作其，一本神作坤。 衰盛，一本衰作更，非是。 承御，一本承作汞。 千秋，一本秋作载。 一无，一本无作元，非是。 流布，一本流作云。 类如鸡子至肉滑若饴。 旧本差在后，盖疑其重韵，而妄掇之也。 今移正之。 类如，一本类作状。 相扶，一本扶作符。 乃具，一本具作俱。 若饴，旧本饴作铅，朱子本改正作饴。 新锷，上篇已释之。 恒为，一本作筑固，一本作筑完，一本作筑垣。 于斯之时，情合乾坤。 一本作：爰初之时，由乎乾坤。 拘则水定，水五行初。 一本作：则水定火，五行之初。 道无形象，旧本无作之，盖古者无字是此无字，之与无草写则相似，故误作之字也。 一本象作状。 真一难图，一本一作其。 至悬，一本作玄且，非是。 耳目口三宝，一本作耳目己之宝，非是。 发扬，一本扬作通。 视览，一本览作听。 倾鸿蒙，一本作顺以鸿。 念念，旧本作无念。 证验自推移，旧本作证难以推移，非是。 寖以，一本作以浸。 洞无极，一本洞作润，非是。 谷中，一本作中宫，一本作客中，皆非是。 任杖，一本作拄杖。 没水，一本没作投。 获黍，一本获作获。 不见功，一本不作无。 至约，一本至作事，非是。 盖草书至事之相似也。 遂相衔咽，咀嚼相吞。 旧本彭真一注及绍兴问刘永年本皆在慈母育养，孝子报恩之下。 朱子谓：今按二句自属下文俱相贪并之下，四句相承，语意连属，不当在此。 愚按此章以母子之情为喻，盖所谓遂相衔咽如慈乌反哺之义，正当在此。 今依旧本移正之。 三五为一，即上篇子午数合三，戊己数称五是也。 盖与《悟真篇》三五一不同。 一本为作与，非是。 子当右转，谓虎向水中生也。 午乃东旋，谓龙从火裹出也。 子午，即水火也。 子当右转者，金水合处，盖从右转至於子也。 午乃东旋者，木火为侣，乃自东旋至於午也。 天道左旋右转，还丹之道与天道一同。 若日：子从右转而加酉，午从东旋而加卯。 则是右旋左转与天道背驰矣。 东旋，一本东作左。 主客，一本客作定。 贪并，一本并作便，一本作荣，皆非是。 各得其性，一本得作有，性作功。 如审，一本审作有。 得成正道，一本作得为成道。 父主禀与，一本主作生，非是。 牝鸡，一本牝作肥。 施化之道，一本道作功，一本作精，非是。 受气之初，一本之作元。 日改月化，盖用庄子语。 一本作日受月化，非是。",
      "translated_text": "Its governing principle—one version reads \"yin\" instead of \"its.\"\n\n\"Six-five *Kun* bearing\" refers to the thirty days of the sixth lunar month, not the sixth line of the *Kun* hexagram. The yang numbers have reached their end, and upon completion, they begin anew. Following nature and aligning with essence, they turn and interact.\n\nAll versions place this under \"the compass and square of the Dao,\" except for Master Zhu’s edition, which places it under \"the world as a category of the mother,\" which is incorrect.\n\n\"Circulating through the six lines\"—one version reads \"chapter\" instead of \"circulate,\" which is incorrect.\n\n\"Difficult to\"—one version reads \"can\" instead of \"difficult to.\"\n\n\"Flourishing and manifest\"—one version reads \"prosperous\" instead of \"manifest.\"\n\n\"Generating radiance\"—one version reads \"correct\" instead of \"generating,\" which is incorrect.\n\n\"Gradually advancing\"—one version reads \"reposing\" instead of \"gradually.\"\n\n\"Completing *Tai*\"—one version reads \"bearing\" instead of \"completing.\"\n\n\"Moving and\"—one version reads \"shifting\" instead of \"and.\"\n\n\"*Yu* pods\"—one version reads \"leaves\" instead of \"pods,\" which is incorrect.\n\n\"Shaking and searching\"—one version reads \"capital\" instead of \"searching.\"\n\n\"The yang ends at *Si*, centered and interacting.\" This refers to the fourth month, which corresponds to *Si*, with the pitch matching *Zhong Lü*. Master Xiashan Zi Zhan Gu’s annotated edition reads \"Zhong Lü\" instead of \"centered,\" while one version reads \"noon\" instead of \"centered,\" which is incorrect. Noon corresponds to *Ruibin*.\n\n\"Is\"—one version reads \"presides\" instead of \"is.\"\n\n\"Wandering the world and departing from position\"—one version reads \"retreating from worldly position,\" which is incorrect.\n\n\"Its essence\"—one version reads \"true\" instead of \"its.\"\n\n\"The yin extends while the yang withdraws, damaging names and reputations.\" This refers to the seventh month, which corresponds to *Shen*, with the pitch matching *Yize*. \"Extends\" means *Shen*, and \"damages\" means *Yi*. An older edition reads \"the yang perishes,\" while another reads \"the yang vanishes,\" both of which are incorrect.\n\n\"Diminishing and vanishing\"—one version reads \"ceasing\" instead of \"vanishing,\" which is incorrect.\n\n\"Utmost spirit\"—one version reads \"its\" instead of \"utmost,\" and another reads \"*Kun*\" instead of \"spirit.\"\n\n\"Decline and flourishing\"—one version reads \"alternating\" instead of \"decline,\" which is incorrect.\n\n\"Bearing and receiving\"—one version reads \"mercury\" instead of \"bearing.\"\n\n\"A thousand autumns\"—one version reads \"years\" instead of \"autumns.\"\n\n\"One absence\"—one version reads \"primordial\" instead of \"absence,\" which is incorrect.\n\n\"Flowing and spreading\"—one version reads \"clouds\" instead of \"flowing.\"\n\n\"Resembling a chicken’s egg, its flesh smooth as maltose.\" An older edition misplaced this passage, likely doubting its repetitive rhyme and arbitrarily relocating it. It has now been corrected.\n\n\"Resembling\"—one version reads \"form\" instead of \"resembling.\"\n\n\"Mutually supporting\"—one version reads \"corresponding\" instead of \"supporting.\"\n\n\"Thus complete\"—one version reads \"together\" instead of \"complete.\"\n\n\"Smooth as maltose\"—an older edition reads \"lead\" instead of \"maltose,\" which Master Zhu corrected to \"maltose.\"\n\n\"Newly forged blade\"—this was explained in the previous section.\n\n\"Constantly as\"—one version reads \"firmly constructed,\" another \"completely built,\" and another \"walled.\"\n\n\"At this time, essence aligns with *Qian* and *Kun*.\" One version reads: \"At the beginning, originating from *Qian* and *Kun*.\"\n\n\"Restraining leads to water settling, water as the first of the Five Phases.\" One version reads: \"leads to water settling fire, the beginning of the Five Phases.\"\n\n\"The Dao has no form or image\"—an older edition reads \"of\" instead of \"no,\" for in ancient script, the character for \"absence\" was written similarly to \"of,\" and in cursive, they resemble each other, leading to the error.\n\n\"Image\"—one version reads \"form.\"\n\n\"The true One is difficult to depict\"—one version reads \"its\" instead of \"One.\"\n\n\"Utmost mystery\"—one version reads \"profound and,\" which is incorrect.\n\n\"The three treasures of ears, eyes, and mouth\"—one version reads \"the treasures of ears, eyes, and self,\" which is incorrect.\n\n\"Manifesting and spreading\"—one version reads \"pervading\" instead of \"spreading.\"\n\n\"Observing and surveying\"—one version reads \"listening\" instead of \"surveying.\"\n\n\"Overturning the primordial chaos\"—one version reads \"following the primordial.\"\n\n\"Thought after thought\"—an older edition reads \"thoughtless.\"\n\n\"Verification shifts naturally\"—an older edition reads \"verification is difficult to shift,\" which is incorrect.\n\n\"Gradually and\"—one version reads \"with gradual.\"\n\n\"Penetrating the boundless\"—one version reads \"moistening\" instead of \"penetrating,\" which is incorrect.\n\n\"Within the valley\"—one version reads \"central palace,\" another \"guest within,\" both incorrect.\n\n\"Leaning on a staff\"—one version reads \"holding a staff.\"\n\n\"Submerging in water\"—one version reads \"casting into\" instead of \"submerging.\"\n\n\"Harvesting millet\"—one version reads \"obtaining\" instead of \"harvesting.\"\n\n\"No visible achievement\"—one version reads \"no\" instead of \"not.\"\n\n\"Utmost simplicity\"—one version reads \"affairs\" instead of \"utmost,\" which is incorrect, likely due to the similarity between the cursive forms of \"utmost\" and \"affairs.\"\n\n\"Thus they interlock and swallow, chewing and devouring one another.\" An older edition, including Peng Zhenyi’s annotation and Liu Yongnian’s *Shaoxing Inquiry* version, placed this under \"the compassionate mother nurtures, the filial child repays.\" Master Zhu noted: \"Now examining these two lines, they properly belong under 'all greedily contend,' where four lines follow in sequence, their meaning connected. They should not be here.\" This chapter uses the analogy of mother and child, where \"thus they interlock and swallow\" reflects the meaning of the compassionate crow feeding its parent, and thus belongs here. It has now been restored according to the older edition.\n\n\"Three and five become one\"—this refers to the earlier section where the *Zi* and *Wu* numbers combine as three, and the *Wu* and *Ji* numbers are called five, differing from the *Wuzhen Pian*’s \"three-five-one.\"\n\n\"Become\"—one version reads \"and,\" which is incorrect.\n\n\"*Zi* turns to the right\"—this means the tiger is born within water.\n\n\"*Wu* rotates to the east\"—this means the dragon emerges from within fire.\n\n\"*Zi* and *Wu*\"—these are water and fire.\n\n\"*Zi* turns to the right\"—where metal and water unite, turning right toward *Zi*.\n\n\"*Wu* rotates to the east\"—where wood and fire are companions, rotating east toward *Wu*.\n\nThe Dao of heaven turns left while revolving right; the Dao of returning elixir is identical to the heavenly Dao. If one says: \"*Zi* turns right and advances to *You*, *Wu* rotates east and advances to *Mao*,\" this would be a rightward rotation and leftward turn, contrary to the heavenly Dao.\n\n\"Rotates to the east\"—one version reads \"left\" instead of \"east.\"\n\n\"Host and guest\"—one version reads \"settled\" instead of \"guest.\"\n\n\"Greedily contending\"—one version reads \"convenient\" instead of \"contending,\" another \"flourishing,\" both incorrect.\n\n\"Each attains its nature\"—one version reads \"has\" instead of \"attains,\" and \"achievement\" instead of \"nature.\"\n\n\"As if examining\"—one version reads \"having\" instead of \"examining.\"\n\n\"Attaining the correct Dao\"—one version reads \"attaining as the accomplished Dao.\"\n\n\"The father presides over bestowing\"—one version reads \"generates\" instead of \"presides,\" which is incorrect.\n\n\"The female phoenix\"—one version reads \"fat\" instead of \"female.\"\n\n\"The Dao of transformation\"—one version reads \"achievement\" instead of \"Dao,\" another \"essence,\" both incorrect.\n\n\"At the inception of receiving *qi*\"—one version reads \"primordial\" instead of \"of.\"\n\n\"Daily transformation, monthly change\"—this adopts Zhuangzi’s phrasing. One version reads \"daily reception, monthly change,\" which is incorrect.",
      "overlap_context": "urtains. One version reads \"左旋\" instead of \"旋而右转.\"\n\n\"昴毕之上，震出为征\" refers to the moon’s initial appearance in the west, resembling the trigram *Zhen*, symbolizing the fire timing within the body. If one interprets the moon’s rising position according to the *Xiantian* eight trigrams, *Zhen* in the *Xiantian* arrangement is not in the west, nor is the fire timing’s *Zhen* in the west. Failing to grasp its true meaning, one merely sees contradictions in the text.\n\n\"和平\" appears in one version as \"初和.\"",
      "start_char": 6092,
      "end_char": 7473,
      "start_sentence": 317,
      "end_sentence": 408,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.7421178817749,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "又疑日受月化碍理，遂改为月受日化，亦非是。 水性周章，一本水性作和融。 木火为侣，谓龙从火裹出，东三、南二同成五也。 金水合处，谓虎向水中生，北一、西四共成之也。 张紫阳谓：四象不离二体。 正是此意。 或用先天离、坎#11 加於后天震、兑以发明此说，不惟失魏公本旨，盖与身中造化大段相反。 一本金水作金木，木火作水火，谬之甚矣。 列为，一本列作合，一本作引。 心赤为女，一本脱此四字。 子五行始，一本脱此四字，一本子作居。 建纬，一本纬作位。 虚危，一本作抱真。 执火，一本作降坐。 调合，一本作执火。 妄有所冀，一本作冀有所望。 以□#12 ，一本□作□#13 。 #10『本』，据其文义例补。 #11『坎』，四库本误作『次』。 #12『以□』，原作『以□』，据四库本改。 #13『□作□』，『□』字原作『□』，据四库本改； 『□』字四库本作『兰』。 下篇释疑 惟昔圣贤，怀玄抱真，至忧悯后生，好道之伦，随傍风采，指画古文，着为图籍，开示后昆，露见枝条，隐藏本根。 盖谓古之圣贤既得此道以怀玄抱真，复忧悯后生好道之士不得其说，遂为之随傍风采，援古证今，着为图籍，以开示之。 又不敢直直敷露，於是，托号五金、八石而发明之也。 所谓着为图籍，托号诸石，乃指古之圣贤如此，非谓后生好道之人如此也。 此章彭真一、陈抱一皆体认错了，惟朱子注独得其旨。 三元，一本元作光．，非是。 ．",
      "translated_text": "Moreover, doubting that \"daily reception, monthly change\" obstructs coherence, one version alters it to \"monthly reception, daily change\"—this, too, is incorrect.\n\n\"The nature of water flows freely\"—one version reads \"harmonious and fused\" instead of \"flows freely.\"\n\n\"Wood and fire as companions\"—this refers to the dragon emerging from within fire, where the east (three) and south (two) together form five.\n\n\"Where metal and water converge\"—this refers to the tiger being born toward water, where the north (one) and west (four) jointly complete it.\n\nZhang Ziyang states: \"The Four Symbols do not depart from the Two Bodies.\" This precisely captures the meaning.\n\nSome employ the precelestial *Li* and *Kan* to supplement the postcelestial *Zhen* and *Dui* in expounding this idea, yet this not only strays from Master Wei’s original intent but also inverts the great process of inner transformation.\n\nOne version reads \"metal and wood\" instead of \"metal and water,\" and \"water and fire\" instead of \"wood and fire\"—a grave error indeed.\n\n\"Arranged as\"—one version reads \"joined\" instead of \"arranged,\" another \"drawn.\"\n\n\"Heart red as the female\"—one version omits these four characters.\n\n\"The five phases begin with *zi*\"—one version omits these four characters, another substitutes \"*ju*\" for \"*zi*.\"\n\n\"Establishing the weft\"—one version reads \"position\" instead of \"weft.\"\n\n\"*Xu* and *Wei*\"—one version reads \"embracing the true.\"\n\n\"Grasping fire\"—one version reads \"descending to sit.\"\n\n\"Harmonizing and blending\"—one version reads \"grasping fire.\"\n\n\"Indulging vain hopes\"—one version reads \"hoping for some expectation.\"\n\n\"With □\"—one version reads \"□\" as \"□.\"\n\n---\n\n**Clarifying Doubts in the Lower Chapter**\n\nOnly the sages and worthies of old, embracing the mysterious and holding fast to the true, deeply pitied later generations—those who love the Dao—who, following peripheral trends, traced and illustrated ancient texts, compiling them into diagrams and books to enlighten posterity. Yet they revealed only branches and leaves, concealing the root and trunk.\n\nThis means that the ancient sages, having attained this Dao and embraced the mysterious while holding fast to the true, further pitied later generations of Dao-seekers who failed to grasp its teachings. Thus, they followed peripheral trends, citing antiquity to validate the present, compiling diagrams and books to instruct them. Yet they dared not expose it too directly, so they resorted to designations like \"five metals\" and \"eight stones\" to elucidate it.\n\nThe phrase \"compiling diagrams and books, designating them as various stones\" refers to the ancient sages’ method, not to later generations of Dao-seekers. In this chapter, Peng Zhenyi and Chen Baoyi both misunderstood the meaning, while only Master Zhu’s commentary grasped its essence.\n\n\"The Three Origins\"—one version reads \"light\" instead of \"origin,\" which is incorrect.",
      "overlap_context": "ver bestowing\"—one version reads \"generates\" instead of \"presides,\" which is incorrect.\n\n\"The female phoenix\"—one version reads \"fat\" instead of \"female.\"\n\n\"The Dao of transformation\"—one version reads \"achievement\" instead of \"Dao,\" another \"essence,\" both incorrect.\n\n\"At the inception of receiving *qi*\"—one version reads \"primordial\" instead of \"of.\"\n\n\"Daily transformation, monthly change\"—this adopts Zhuangzi’s phrasing. One version reads \"daily reception, monthly change,\" which is incorrect.",
      "start_char": 7473,
      "end_char": 8086,
      "start_sentence": 409,
      "end_sentence": 438,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.578555583953857,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "精溢，一本作津液，非是。 化形，一本化作变。 覆谬众文，谓反覆谬乱其文，而不敢径直漏泄也。 一本谬作冒，非是。 传世，一本传作举。 不仕，一本仕作遂。 故为乱辞，一本为作非，非是。 玄沟，一本沟作远。 退自后，旧本后作改，非是。 关枪有低昂兮，周天遂奔走。 周天两字，旧本皆作周炁，朱子疑周炁无义理，遂改为害炁，亦非是。 害字与周字盖相似，炁字与天字颇相近也。 江河无枯竭兮，水流注於海。 旧本无作之，非是。 之无之误，中篇道无形象下已详释之。 一本河作淮。 终复始，一本作复终始，一本作复更始。 张於，一本於作设。 白虎，一本虎作矾，非是。 苍龙，一本龙作液，非是。 压止，一本止作之。 龙鳞甲鬣，一本龙作鱼，甲作狎，非是。 接连，一本作杂沓。 自相守，一本自作而。 房六，一本六作七，非是。 正阳，一本阳作阴，非是。 三五并危一兮，都集归一所。 盖谓房六、昴七、张二三方之气并北方危一，都会集而归於一处也。 中间极有造化，盖南北张危，月也； 东西房昴，日也。 危一合房六，则为水之生成数。 张二合昂七，则为火之生成数。 房六在东，张二在南，木火为侣，六与二合而成八。 昂七在西，危一在北，金水合处，七与一合而成八，应二八一斤之数。 所谓本之但二物者，此也。 一本并危一作并为一，又一本作之与一，皆非是。 一本一所作二所，亦非是。 当知魏公之作是书，无语不合造化。 若以为：三五之与一兮，都集归二所。 则造化何有哉？ 又况二所之说，尤其大谬。 纵使果谓之二所，则当言分，不当言集。 既谓之集，则当言一所，不当言二所也。 取甫，詹霞山注本作甫取。 赤色通表裹，一本作赤黑达表裹。 黍米，一本黍作稻，非是。 若山泽气需兮，一本作山泽气相烝兮，非是。 亿世，一本世作代。 而可考，一本而作自。 心灵，一本心作魂。 忽自悟，一本忽作乍。 受图录，一本作录天图，非是。 鼎器歌释疑 径一分，旧本径作十#14。 长尺二，一本尺二作二尺，非是。 腹齐正，朱子云：按齐即古脐字。 一本作腹三齐，非是。 首尾武，中间文。 盖谓晦朔为首尾，月望为中问也。 首尾即是一处，中间亦即是一处。 若言巳为阳子尾，午为阴亥首，巳、午两向为中问，则是两个首尾、两个中间矣。 一说：以进阳火，则子、丑、寅为首，辰、巳为尾； 退阴符，则午、未、申为首，戌、亥为尾； 中宫为中间，则是两首两尾一中问。 其说皆未稳。 两七聚，一本聚作窍，非是。 赡理脑，一本赡作瞻，一本作胆，皆非是。 #14『十』，原脱，据四库本补。 序释疑",
      "translated_text": "\"Essence overflows\"—one version reads \"fluids\" instead of \"essence,\" which is incorrect.\n\"Transforming form\"—one version reads \"transform\" as \"change.\"\n\"Reversing and distorting the texts\" means repeatedly altering and confusing the words so as not to reveal them too directly.\nOne version reads \"distort\" as \"conceal,\" which is incorrect.\n\"Transmitted through the ages\"—one version reads \"transmit\" as \"raise.\"\n\"Not serving in office\"—one version reads \"serving\" as \"thus.\"\n\"Thus creating chaotic words\"—one version reads \"creating\" as \"not,\" which is incorrect.\n\"The Mysterious Channel\"—one version reads \"channel\" as \"distant.\"\n\"Retreating from behind\"—an old version reads \"behind\" as \"alter,\" which is incorrect.\n\n\"When the Pass Spear rises and falls,\nThe celestial cycle hastens its course.\"\n\nThe two characters \"celestial cycle\" in old versions were written as \"celestial qi.\" Master Zhu suspected that \"celestial qi\" lacked coherent meaning and thus emended it to \"harmful qi,\" which is also incorrect. The character \"harm\" resembles \"cycle,\" and \"qi\" is quite similar to \"heaven.\"\n\n\"The Yangtze and Yellow Rivers never run dry,\nTheir waters flow ceaselessly into the sea.\"\n\nAn old version reads \"into\" as \"none,\" which is incorrect. The error of \"none\" for \"into\" has already been explained in detail under the middle section’s \"The Dao has no form or image.\"\nOne version reads \"Yellow River\" as \"Huai River.\"\n\"Ending and returning to the beginning\"—one version reads \"returning to end and begin,\" another reads \"returning to renew the beginning.\"\n\"Spread out\"—one version reads \"out\" as \"set up.\"\n\"White Tiger\"—one version reads \"Tiger\" as \"alum,\" which is incorrect.\n\"Azure Dragon\"—one version reads \"Dragon\" as \"fluid,\" which is incorrect.\n\"Pressing to halt\"—one version reads \"halt\" as \"proceed.\"\n\"Dragon’s scales, armor, and mane\"—one version reads \"Dragon\" as \"fish\" and \"armor\" as \"familiar,\" which is incorrect.\n\"Interconnected\"—one version reads \"interconnected\" as \"jumbled.\"\n\"Guarding one another\"—one version reads \"one another\" as \"and.\"\n\"House Six\"—one version reads \"Six\" as \"Seven,\" which is incorrect.\n\"True Yang\"—one version reads \"Yang\" as \"Yin,\" which is incorrect.\n\n\"When Three and Five converge with One,\nAll gather and return to one place.\"\n\nThis refers to the qi of House Six, Pleiades Seven, and Spread Two combining with the North’s Danger One, all converging and returning to a single locus. Within this lies profound transformation: Spread (south) and Danger (north) represent the moon, while House (east) and Pleiades (west) represent the sun. Danger One combined with House Six forms the generative and completive numbers of water. Spread Two combined with Pleiades Seven forms the generative and completive numbers of fire. House Six in the east and Spread Two in the south—wood and fire as companions—combine Six and Two to make Eight. Pleiades Seven in the west and Danger One in the north—metal and water in union—combine Seven and One to make Eight, corresponding to the weight of two eights (one catty). This is what is meant by \"originating from but two things.\"\n\nOne version reads \"converge with One\" as \"converge as One,\" another as \"converge with it and One,\" both of which are incorrect. Another version reads \"one place\" as \"two places,\" which is also incorrect. One must recognize that when Master Wei composed this work, no phrase failed to align with the transformations of creation. If it were instead: \"When Three and Five converge with One, all gather and return to two places,\" what transformation would remain? Moreover, the notion of \"two places\" is particularly egregious. Even if it truly referred to two places, it should say \"divide,\" not \"gather.\" Since it speaks of \"gathering,\" it should say \"one place,\" not \"two places.\"\n\n\"Taking the beginning\"—Zhan Xiashan’s annotation reads \"beginning takes.\"\n\"Red permeates both surface and interior\"—one version reads \"red and black penetrate surface and interior.\"\n\"Millet grain\"—one version reads \"millet\" as \"rice,\" which is incorrect.\n\"As mountain and marsh qi awaits\"—one version reads \"mountain and marsh qi steams together,\" which is incorrect.\n\"For ten thousand generations\"—one version reads \"generations\" as \"eras.\"\n\"And can be examined\"—one version reads \"and\" as \"from.\"\n\"Heart and spirit\"—one version reads \"heart\" as \"soul.\"\n\"Suddenly self-awakened\"—one version reads \"suddenly\" as \"abruptly.\"\n\"Receiving the illustrated records\"—one version reads \"receiving the records of heaven,\" which is incorrect.\n\n**Clarifying Doubts in the \"Tripod Vessel Song\"**\n\n\"Diameter: one fen\"—an old version reads \"diameter\" as \"ten.\"\n\"Length: one foot two inches\"—one version reads \"one foot two inches\" as \"two feet,\" which is incorrect.\n\"Belly aligned with the navel\"—Master Zhu notes: \"Aligned\" here is the ancient form of \"navel.\"\nOne version reads \"belly three navels,\" which is incorrect.\n\"Head and tail martial, center civil\"—this refers to the dark and new moons as head and tail, and the full moon as the center. Head and tail are thus one locus, and the center is also one locus. If one claims that *si* (the sixth Earthly Branch) is the yang *zi* (first Earthly Branch) tail, *wu* (seventh Earthly Branch) is the yin *hai* (twelfth Earthly Branch) head, and *si* and *wu* in both directions form the center, then there would be two heads, two tails, and two centers.\n\nAnother interpretation: when advancing yang fire, *zi*, *chou*, and *yin* (first, second, and third Earthly Branches) are the head, *chen* and *si* (fifth and sixth) are the tail; when retreating yin tally, *wu*, *wei*, and *shen* (seventh, eighth, and ninth) are the head, *xu* and *hai* (eleventh and twelfth) are the tail; the central palace is the center—thus two heads, two tails, and one center. Neither interpretation is stable.\n\n\"Two Sevens gather\"—one version reads \"gather\" as \"orifices,\" which is incorrect.\n\"Gazing at the brain’s texture\"—one version reads \"gazing\" as \"looking up,\" another as \"gallbladder,\" both of which are incorrect.",
      "overlap_context": "y dared not expose it too directly, so they resorted to designations like \"five metals\" and \"eight stones\" to elucidate it.\n\nThe phrase \"compiling diagrams and books, designating them as various stones\" refers to the ancient sages’ method, not to later generations of Dao-seekers. In this chapter, Peng Zhenyi and Chen Baoyi both misunderstood the meaning, while only Master Zhu’s commentary grasped its essence.\n\n\"The Three Origins\"—one version reads \"light\" instead of \"origin,\" which is incorrect.",
      "start_char": 8086,
      "end_char": 9179,
      "start_sentence": 439,
      "end_sentence": 507,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.483118295669556,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "三相类，谓大《易》、黄老、炉火#15三者之阴阳造化互相似也。 自彭真一以木三、火二、土五、金四、水一画为五位相得而各有合之图，故后人皆祖彭氏此说，竟以为魏公本文而并作五行之相类说了。 沿袭至今，无有辩之者，皆不思魏公所言相类者果为何事，况《易》所谓五位相得而各有合，盖合五行之生成数。 今彭氏止用生数，乌得谓之五位相得而各有合。 或以为木三、火二为一五，金四、水一为一五，与中央土五，共成三五，则犹可谓之三五相类。 今言五行之相类，则水自一数，火自二数，金、木、土之数各各不同，安取其为相类哉？ 一本作互相类似，亦可取，终不若三相类之说为甚明也。 盖详其下文，有曰：三道由一，俱出径路。 又日：罗列三条，枝茎相连。 同出异名，皆由一门。 其为三相类，居然可见矣。 郐国鄙夫，魏公自谓也。 魏公乃会稽上虞人，今不曰会稽，而曰郐国者，不欲显言其本贯也。 若直谓之会稽，则是后人改之之辞，非魏公本文也。 挟怀朴素，一本作怀朴抱素。 不乐权荣，谓不肯爱乐权势荣耀也。 乐字，当作去声。 一本权作欢，非是。 利名，一本利作令。 宴然闲居，一本作远客燕间。 察其所趣，一本所作旨。 共伦，一本伦作论。 施化，一本施作神。 归根，一本根作愚，非是。 我心，一本心作形。 八石，一本八作五。 成物，一本物作功。 委时去害，依托丘山，循游寥廓，与鬼为邻，至各相乘负，安稳长生。 十六句，乃是檃括魏伯阳三字。 各相乘负者，如委鬼相乘负为魏，人白#16相乘负为伯，阝易相乘负为阳是也。 一本鬼作仙，阨作厄； 各相乘负，安稳长生，作吉人相乘，安隐长生。 又一本作吉人相乘负，安稳可长生。 皆非是。 又一本东西南倾作东西南北； 水早隔并作水旱兵革。 #15『炉火』，原作『炉火』，据四库本改。 #16『白』，原作『自』，据四库本改。 赞序释疑 立政，一本作御极。",
      "translated_text": "The \"three correlations\" refer to the mutual resemblance of the transformations of yin and yang in the *Great Ease* (*Yi*), the Yellow and the Old (Huang-Lao), and furnace alchemy. Ever since Peng Zhenyi depicted the five phases with wood as three, fire as two, earth as five, metal as four, and water as one—forming a diagram of five positions in mutual resonance—later generations have all followed Peng’s interpretation, mistakenly believing it to be Master Wei’s original text and conflating it with the theory of the five phases’ correlations. This error has persisted to this day without challenge, for none have considered what Master Wei truly meant by \"correlation.\" Moreover, the *Yi*’s phrase \"five positions in mutual resonance\" refers to the generative and completive numbers of the five phases. Peng’s system uses only the generative numbers—how can this be called \"five positions in mutual resonance\"? Some argue that wood (three) and fire (two) form one five, metal (four) and water (one) form another five, with central earth (five) completing the three fives, which might still be termed \"three fives in correlation.\" Yet to speak of the five phases’ correlation in this way is untenable: water has its own number (one), fire its own (two), while metal, wood, and earth each differ—where is the correlation? One version reads \"mutually resembling,\" which is somewhat plausible, though still not as clear as \"three correlations.\" Examining the subsequent text, we find: \"The three Ways emerge from one, all following the same path,\" and again: \"Arrayed as three strands, their branches and stems intertwine. Though named differently, they issue from a single gate.\" Here, the meaning of \"three correlations\" is unmistakably evident.\n\nThe \"crude man of Kuai\" is Master Wei’s self-reference. Though Wei was from Shangyu in Kuaiji, he did not call himself \"Kuaiji\" but \"Kuai\" to avoid revealing his native place. Had he written \"Kuaiji\" directly, it would have been a later alteration, not his original wording. \"Clinging to plainness and simplicity\"—one version reads \"embracing simplicity and plainness.\" \"Disdaining power and glory\" means he refused to covet authority or honor. The character *le* (\"joy\") should be read in the departing tone. One version mistakenly writes *huan* (\"delight\") for *quan* (\"power\"). \"Profit and fame\"—one version writes *ling* (\"command\") for *li* (\"profit\"). \"Living in tranquil seclusion\"—one version reads \"a distant traveler in quiet repose.\" \"Observing his inclinations\"—one version writes *zhi* (\"purpose\") for *suo* (\"that which\"). \"Common discourse\"—one version writes *lun* (\"discourse\") for *lun* (\"ethics\"). \"Disseminating transformation\"—one version writes *shen* (\"spirit\") for *shi* (\"to enact\"). \"Returning to the root\"—one version mistakenly writes *yu* (\"foolish\") for *gen* (\"root\"). \"My heart\"—one version writes *xing* (\"form\") for *xin* (\"heart\"). \"Eight minerals\"—one version writes *wu* (\"five\") for *ba* (\"eight\"). \"Perfecting things\"—one version writes *gong* (\"achievement\") for *wu* (\"things\"). \"Abandoning the times to avoid harm, taking refuge in hills and mountains, wandering the vast expanse, dwelling among ghosts, until each bears the other’s burden in stability and long life\"—these sixteen phrases encapsulate the three characters of Wei Boyang’s name. \"Each bears the other’s burden\" refers to: *wei* (委) and *gui* (鬼) combining to form *Wei* (魏); *ren* (人) and *bai* (白) combining to form *Bo* (伯); and *fu* (阝) and *yi* (易) combining to form *Yang* (阳). One version mistakenly writes *xian* (\"immortal\") for *gui* (\"ghost\") and *e* (\"distress\") for *fu* (\"mound\"); another alters \"each bears the other’s burden, stability and long life\" to \"the fortunate bear one another, hidden and long-lived\"; yet another reads \"the fortunate bear one another’s burden, stable and long-lived.\" All are incorrect. Another version writes \"east, west, south, north\" for \"east, west, south, slanting\"; and \"flood, drought, and warfare\" for \"flood and drought separated.\" The *Collected Works* edition emends *lu huo* (炉火) to *lu huo* (炉火). The character *bai* (白) was originally written as *zi* (自), corrected here per the *Siku* edition. \"Eulogy: Resolving Doubts.\" \"Establishing governance\"—one version reads \"holding the ultimate pole.\"",
      "overlap_context": "fifth and sixth) are the tail; when retreating yin tally, *wu*, *wei*, and *shen* (seventh, eighth, and ninth) are the head, *xu* and *hai* (eleventh and twelfth) are the tail; the central palace is the center—thus two heads, two tails, and one center. Neither interpretation is stable.\n\n\"Two Sevens gather\"—one version reads \"gather\" as \"orifices,\" which is incorrect.\n\"Gazing at the brain’s texture\"—one version reads \"gazing\" as \"looking up,\" another as \"gallbladder,\" both of which are incorrect.",
      "start_char": 9179,
      "end_char": 9961,
      "start_sentence": 508,
      "end_sentence": 547,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.185685634613037,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "米盐，盖用《史记．天官书》语。 米盐分判，犹言黑白分明也。 一本米盐作坎离，非是。 以易，一本易作经。 立注，一本注作法，非是。 为此，一本此作吾。",
      "translated_text": "The phrase \"rice and salt\" here follows the *Records of the Grand Historian: Treatise on the Celestial Offices*. \"Rice and salt divided\" is akin to saying \"black and white clearly distinguished.\" One version mistakenly writes *kan* (坎, Water) and *li* (离, Fire) for \"rice and salt.\" Another alters *yi* (易, Changes) to *jing* (经, Classic). In \"establishing commentary,\" one version incorrectly substitutes *fa* (法, method) for *zhu* (注, commentary). For \"for this,\" one version replaces *ci* (此, this) with *wu* (吾, I).",
      "overlap_context": "rtunate bear one another’s burden, stable and long-lived.\" All are incorrect. Another version writes \"east, west, south, north\" for \"east, west, south, slanting\"; and \"flood, drought, and warfare\" for \"flood and drought separated.\" The *Collected Works* edition emends *lu huo* (炉火) to *lu huo* (炉火). The character *bai* (白) was originally written as *zi* (自), corrected here per the *Siku* edition. \"Eulogy: Resolving Doubts.\" \"Establishing governance\"—one version reads \"holding the ultimate pole.\"",
      "start_char": 9962,
      "end_char": 10042,
      "start_sentence": 548,
      "end_sentence": 553,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.4653687477111816,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契释疑.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}