{
  "source_id": "周易参同契注（储华谷）",
  "source_file": "chunked_daozang\\周易参同契注（储华谷）.json",
  "total_chunks": 21,
  "total_original_chars": 18721,
  "total_translated_chars": 93371,
  "total_translation_time": 479.87487387657166,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The *Zhouyi Cantong Qi* (The Seal of the Unity of the Three, in Accordance with the *Book of Changes*)**\n\n**Title:** *Zhouyi Cantong Qi*\n**Commentary attributed to:** Chu Huagu\n**Author’s era:** Unknown\n**Three fascicles.**\n**Base text source:** *Daoist Canon of the Orthodox Tradition* (*Zhengtong Daozang*), *Tai Xuan* Section.\n**Collated with:** The *Wenyuan Ge Siku Quanshu* edition, under the Daoist works in the *Zibu* category, containing Zhu Xi’s *Zhouyi Cantong Qi Kaoyi* (hereafter *Kaoyi* edition).\n\n---\n\n### *Zhouyi Cantong Qi*, Fascicle One\n**Commentary by Chu Huagu**\n\n**Qian and Kun** are the gates and doors of the *Changes*, the father and mother of all hexagrams.\n**Kan and Li** form their frame and axle, turning the wheel upon its true axis.\n\nThe *Changes* is the union of Qian and Kun, their ebb and flow, opening and closing—hence the term \"gates and doors.\"\nThrough their interweaving, the sixty-four hexagrams arise—hence the term \"father and mother.\"\nKan is concealed within Kun, Li within Qian—hence the term \"frame.\"\nKan and Li dwell at the center of Qian and Kun; the movement of their central lines is like an axle turning the wheel.\n\nThe four hexagrams of the female and male serve as the bolt and key.\nThey cover and enshroud the Dao of yin and yang, just as a charioteer holds the reins and bit, follows the plumb line and inked cord, traces the wheel tracks, and governs the exterior from the center.\nQian, Kun, Kan, and Li are the female and male of creation; the central lines of the myriad beings manifest the subtle workings of Qian and Kun—hence the phrase: \"governing the exterior from the center.\"\nThe above discusses the medicinal substances.\n\nNumbers are recorded in the pitch-pipes and calendars; the lunar phases consist of five and six.\nThe warp and weft obey the sun’s command.\nCombined, they make sixty; hardness and softness have their outer and inner.\nAt dawn on the new moon, *Zhun* (Hexagram 3) presides over affairs; by dusk, *Meng* (Hexagram 4) receives its turn.\nDay and night each govern one hexagram, employed in due sequence.\nFrom *Ji Ji* (Hexagram 63) to *Wei Ji* (Hexagram 64), until the end of the month’s twilight, the cycle concludes and begins anew.\nThe lunar phases consist of five and six, totaling thirty days; two hexagrams govern each day, corresponding to the sixty hexagrams.\nTwo hexagrams comprise twelve lines: six yang lines and six yin lines.\nAligning the twelve hours with the twelve pitches of the pitch-pipes, the twelve months of the calendar, and the twelve years of the cycle.\nBeginning with *Zhun* and *Meng* and ending with *Ji Ji* and *Wei Ji*, the sequence revolves without end.\nThis chapter discusses the firing times in terms of a single month.\n\nThe celestial stems serve as the measure; movement and stillness have their early and late.\nSpring and summer rely on the inner body, from *Zi* (midnight) to *Chen* and *Si* (morning).\nAutumn and winter employ the outer function, from *Wu* (noon) to *Xu* and *Hai* (evening).\nRewards and punishments correspond to spring and autumn; darkness and light follow cold and heat.\nThe line statements embody benevolence and righteousness, expressing joy and anger in accord with the seasons.\nThus aligned with the four seasons, the Five Phases attain their proper order.\nThe twelve hours correspond to the twelve monthly qi; from *Zi* to *Chen* and *Si*, and from *Wu* to *Xu* and *Hai*, the solstices of yin and yang are determined.\nRewards and punishments correspond to spring and autumn; the line statements embody benevolence and righteousness, establishing the equinoxes of punishment and virtue.\nThis chapter discusses the firing times in terms of a single day.\n\nHeaven and Earth establish their positions, and the *Changes* operates within them.\nHeaven and Earth are Qian and Kun.\n\"Establish their positions\" refers to arranging the positions of yin and yang in harmony.\nThe *Changes* refers to Kan and Li.\nKan and Li are the two functions of Qian and Kun.\nThe two functions have no fixed line positions; they circulate through the six voids.\nTheir comings and goings are unfixed; their ascent and descent lack constancy.\nObscure and hidden, they sink and rise within.\nThey envelop the myriad things, serving as the guiding principles of the Dao.\nThe sun and moon constitute the *Changes*—hence the phrase, \"the *Changes* refers to Kan and Li.\"\nThe central lines of Kan and Li are the subtle workings of Qian and Kun, advancing and retreating, ascending and descending among the six lines.\nThus, the transformations of the central lines serve as the guiding principles of the Dao.\nKan and Li alone receive the central qi of Qian and Kun; humans are born receiving the center of Heaven and Earth.\nThis chapter discusses the essence of Kan and Li in terms of their central lines.\n\nThe formless governs the formed; the utility of vessels lies in their emptiness.\nThus, in tracing waxing and waning, Kan and Li vanish.\nVessels are useful because of their emptiness; thus, the void of Li can receive the fullness of Kan.\nThe void of Li is the formless; the fullness of Kan is the formed.\nThe yin line at the center of Li transforms into the central stroke of Kan, becoming pure Qian and losing the forms of Kan and Li—hence the phrase, \"Kan and Li vanish.\"\nThis all demonstrates the subtle workings of the central lines, clarifying the meaning of \"the *Changes* operates within them.\"\nThis chapter discusses the functions of Kan and Li in terms of their intercourse.\n\nWords are not idly crafted; theories do not arise in vain.\nThey draw upon evidence and manifest effects, verifying the numinous through measurement.\nExtending categories and structuring characters, the principles are proven.\nKan is the essence of the moon, *wu* (earth); Li is the light of the sun, *ji* (earth).\nThe sun and moon constitute the *Changes*, hardness and softness in balance.\nEarth flourishes in the four seasons, weaving the beginning and end.\nGreen, red, white, and black each reside in their respective directions.\nAll receive their mandate from the central palace, the work of *wu* and *ji*.\nKan and Li can thus unite the sun and moon; their harmony arises because Kan contains *wu* and Li contains *ji*.\n*Wu* and *ji* are the center.\nThis also clarifies the ascent and descent within the center, governing the exterior from the center, and the meaning of \"the *Changes* operates within them.\"\nThis chapter further discusses the essence of the medicinal substances.\n\nThe *Changes* is imagery.\nNo image is more luminous than the sun and moon.\nExhausting the numinous to know transformation: when yang departs, yin arrives.\nLike spokes converging at the hub, the wheel turns; going out and coming in, they roll and unfold.\nWhen the time arrives at dawn on the new moon, *Zhen* (Hexagram 51) comes to receive the tally.\nAt this moment, Heaven and Earth conceive their essence; the sun and moon mutually embrace.\nThe male yang scatters its dark essence; the female yin transforms the yellow womb.\nChaos intermingles and joins; the root and foundation are planted.\nThey nurture and cultivate the budding sprout, concentrating spirit to form the body.\nAll things tread forth from this; none among the teeming creatures do not arise from it.\nObserving the image of the sun and moon conjoined as one, one grasps the Dao of Kan and Li’s intercourse.\nObserving the hexagram *Zhen* coming to receive the tally, one perceives the mechanism of the solitary yang’s return.\nKan, the male, is the male yang, concealing the lines of Qian within; it bestows its celestial dark qi upon Li.\nLi, the female, is the female yin, transforming its central line into the yellow body of Kun to become Qian.\nThis chapter discusses the firing process and the union of impurities.\n\nThus, when Confucius extolled the primordial vastness, the virtue of Qian and Kun pervaded the void. He traced antiquity to the Primordial Sovereign, and in the *Guan Ju* established the beginning. The qi of cap and marriage intertwined, and in the first year the sprout burgeoned.\n\nSun and moon conjoin as jade disks—this is the celestial and terrestrial intermingling of essence. Humans and the myriad things all arise from the celestial and terrestrial intermingling of essence. In the *Book of Changes*, Confucius elucidated the Dao of male and female essence-conception and the transformation of the myriad things; in the *Book of Songs*, he ordered the primacy of human relations, beginning with husband and wife, to clarify the principle of yin and yang seeking one another. This chapter speaks of the medicinal substances.\n\nThe sage is not born in vain; he observes above to discern the celestial tally. The celestial tally has advance and retreat, bending and extending to accord with the seasons. Observing the Dao of Heaven and grasping the movements of Heaven, he clarifies how the firing times of the *Yi* hexagrams align with the celestial tally’s advance and retreat. The next chapter will discuss this in detail.\n\nThus, the *Book of Changes* embodies the mind of Heaven, and the hexagram *Fu* establishes the first sprouting. The eldest son inherits the father’s body, and through the mother founds the omen and foundation. The waxing and waning respond to the pitch-pipes’ ascent and descent, anchored in the pivot of the Dipper. On the third day, it emerges from clarity, *Zhen* receiving *geng* in the west. On the eighth day, *Dui* receives *ding*, the first quarter level as a taut cord. On the fifteenth, the Qian body is complete, fullness reaching *jia* in the east. The toad recedes and the hare’s spirit, sun and moon’s qi doubly bright. The toad’s eye marks the hexagram’s node; the hare spews forth its radiance. *Fu* reveals the mind of Heaven—this is the winter solstice, where nothing is more secret than the solitary yang. From this solitary yang follow six yins and six yangs, waxing and waning in alternation, responding to the twelve pitch-pipes; stretching and contracting, ascending and descending, they accord with the Dipper’s pivot and rotation. Kun’s initial line transforms into *Zhen*, thus it is said to rely on the mother. This explanation derives from Fuxi’s primordial hexagrams. This chapter discusses the timing of the yang fire.\n\nWhen the seventh and eighth lines are exhausted, they bend and descend low. On the sixteenth, the mandate shifts, *Xun* and *xin* appear in level brightness. *Gen* stands straight in the south at *bing*; the last quarter is the twenty-third. On the thirtieth day, *Kun* and *yi* in the northeast lose their companions. When the nodal limit is reached, they mutually succeed one another, and the succeeding body once more generates the dragon. This chapter discusses the timing of the yin tally.\n\n*Ren* and *gui* pair with *jia* and *yi*, Qian and Kun encompassing beginning and end. Seven and eight sum to fifteen; nine and six likewise correspond. These four combine to make thirty, and the yang qi seeks extinction and concealment. The eight trigrams array the luminaries, their movements never straying from the center. *Ren* and *jia* pair with Qian; *yi* and *gui* pair with Kun. Seven, eight, nine, and six are the completion numbers of the Five Phases in the *Luoshu*, each yielding fifteen, corresponding to the fifteen days when three yang lines belong to Qian and the fifteen days when three yin lines belong to Kun, together forming thirty days. The sun and moon meet once, ending and then beginning anew. \"The eight trigrams array the luminaries, their movements never straying from the center\" means the eight directions array the twenty-eight lodges, the Dipper revolves at the center of Heaven, and the division of the fire tally’s yin and yang must not be violated. The \"center\" refers to the two solstices. This chapter discusses the *na jia* firing times.\n\nThe subtle essence of the Dao is too minute to observe; one infers and measures it by tallying evidence. Abiding, one observes its images, approximating its forms. Setting up gnomons as standards, one determines auspice or inauspice by divining the omens. Issuing commands in accord with the seasons, one must not miss the moment when the lines move. Above, one examines the patterns of the *Hetu*; below, one orders the flows of earthly forms. In the middle, one investigates human sentiments, unifying and considering the Three Powers. In movement, one follows the hexagram’s nodes; in stillness, one relies on the *Xiang*’s words. Qian and Kun put their use into practice, and only then is the world governed. How could one not be cautious?\n\nThe Dao of Heaven is profound and distant, difficult to glimpse; one perceives it through the images of the *Yi*. Erecting gnomons to divine the omens is simply to avoid missing the moment when the lines move. Speaking of the single yang’s timing, one must not lose the moment of its activation, consuming its season—only then can Kan and Li unite in gestation, forming the pure body of Qian. The Northern Dipper’s pivot governs transformation, advancing and retreating, extending and contracting—this is the luminous manifestation of Heaven’s Dao in images. The tides respond to the moon, waxing and waning in concert—this is the evident display of Earth’s Dao in flowing forms. This is called \"closing the passes,\" when merchants and travelers cease their journeys, and human sentiments align with the seasons and accord with Heaven. In movement and stillness alike, one follows the Dao of the *Yi*, all to illuminate the subtlety of not missing the moment when the lines move.\n\nThis chapter broadly discusses the *yin fu* and *yang huo*; the next chapter focuses solely on the timing of the single yang. The inception of governance lies in the initial stirring of yang at *zi*, the moment when Kan and Li unite in gestation. \"Controlling the subtle and minute\" means closing the passes and halting travel, the sovereign ceasing to inspect the realm, sealing the gates and shutting the doors, so as not to harm the growth of tender yang. Naturally, the yang of *zi* advances to form *Tai*, following the Dipper’s handle to determine dawn and dusk—thus it is called \"the guiding cord of transformation,\" referring to the Dipper.\n\nThis chapter discusses the single yang; the next chapter will address the method of advancing the fire.\n\nWhen the lines stir within, fortune or misfortune arises without. The five planets move in harmony or discord, responding to the seasons and stirring in resonance. When the four and seven fall into disorder, they deviate in elevation and depression. The *Wenchang* oversees the records, while the *Taifu* are held accountable. The hundred officials and their bureaus each govern their respective domains. The fire’s timing and the lines’ movements operate within, while numinous transformations and celestial images manifest without. If one acts too early or too late, the five planets move erratically, disrupting the order of the twenty-eight lodges.\n\nThis chapter describes the consequences of losing the proper fire timing in this way.\n\nIt is said: \"Harmonize the essence of the Five Phases; the moon receives the regulation of the six pitches. Five times six make thirty degrees, and when the degrees are complete, they begin anew.\" From beginning to end, one traces the threads of survival and demise. Within a single day, *Zhen* and *Xun* alternate in succession, cycling endlessly.\n\nThis chapter describes the proper adherence to the fire timing in this way.\n\nIf the ruler is arrogant and indulgent, a single moment of fullness may violate the Dao. If a minister is deceitful and sycophantic, his conduct will not follow the proper path.\n\nThe waxing and waning of the crescent and full moon bring misfortune through discordant changes. Those who enforce the law with criticism and reproach bring blame upon their lord by exposing faults. When hardness and softness lose their proper Way, and movement and stillness miss their proper timing—this chapter describes how improper union in gestation leads to such consequences.\n\nWhen the pole star receives its correct alignment, it moves with ease and entrusts matters to those below. The Hall of Light enacts governance, and the state suffers no harmful ways. Within, one nurtures the self through tranquil emptiness and non-being. The primordial root draws forth clarity, illuminating the inner form and body. Seal the opening of *dui*, and fortify the numinous root. The Three Luminaries sink into obscurity, warming and nourishing the child-pearl. Though unseen to the eye, it is near and easily sought. The yellow center gradually permeates the principles, and moisture reaches the skin. Begin with rectitude, and end with cultivation; when the trunk stands firm, the branches may be grasped. By not losing the proper timing, one governs through non-action, and naturally the Three Luminaries sink into obscurity. What is within manifests without, thus moisture reaches the skin.\n\nFrom the erratic and orderly movements of the five planets onward, all illustrate how the inner stirring of hexagram images gives rise to fortune and misfortune externally. This chapter describes how proper union in gestation leads to such outcomes.\n\nThe first is concealment—none in the world know of it. The highest virtue acts through non-action, not seeking through scrutiny. The lesser virtue acts, and its function never ceases. When the upper is sealed, it is called \"having\"; when the lower is sealed, it is called \"not having.\" The \"not having\" serves the \"having,\" where the divine virtue resides above. These two apertures follow a method: metal and water also depend on each other. Know the white, guard the black, and the numinous clarity will come of itself. The white is the essence of metal; the black is the foundation of water. Water is the pivot of the Dao, and its number is called \"one.\" It is the beginning of yin and yang, containing the yellow sprout within the mysterious. It is the master of the five metals, the river chariot of the north. Thus lead is black without but holds golden radiance within. Cloaked in coarse cloth yet bearing jade, outwardly a madman. Metal is the mother of water; the mother conceals the child’s embryo. Water is the child of metal; the child shelters within the mother’s womb. The perfected person is most subtle—seeming to exist, yet not; now sinking, now floating, like a great abyss. Withdrawing, they disperse and guard their respective domains.\n\nThe number of water is one, concealing the yang within metal—this is the silver within black lead, a truth rarely known, for one is the supreme virtue of Kan. Kan is the supreme virtue, the realm of \"having\"; Li is the lesser virtue, the realm of \"non-being.\" Li employs contraction and receptivity, existing ceaselessly like a continuous thread, thus its function never ceases, for it serves the supreme. Li-mercury requires yang-metal to transform, just as metal requires Li-fire to bestow its essence; hence they are said to be mutually dependent. Knowing that gold resides within water, guard the water and the gold will come of itself, for the mother conceals the child’s embryo. The number of water is one, and its color is black; thus it is called \"guarding the black,\" for the meaning of \"illuminating the one\" lies in concealment. This chapter speaks of the method and measure for seeking the medicine.\n\nBeheld, it resembles whiteness; refined, it becomes vermilion. When tempered, it forms the protective exterior, with purity dwelling within the white. Round or square, a mere inch in diameter, they merge and constrain one another. Born before heaven and earth, majestic and revered. Surrounding it are walls and gates, resembling Penglai’s isles. Encircled and sealed, its four paths are intricately arranged. Guarded with utmost secrecy, its gates bar all wickedness. Curved pavilions connect, ever vigilant against the unforeseen. Here, thought may cease, and sorrow finds no place. The numinous black fills the chamber, none can detain it. Those who guard it prosper; those who lose it perish. In movement and stillness, rest and activity, it ever accompanies the adept. This chapter speaks of the sacred embryo’s formation, emphasizing its nurturance and protection.\n\nThis is not the method of the hidden viscera; inner vision must have its focus. Treading the steps of the Dipper’s lodges, the six Jia follow the days and hours. The yin path suppresses nine with one, its turbid chaos disturbing the mysterious womb. Ingesting the black, the intestines rumble; exhaling the upright, inhaling external evil. Day and night without repose, the bowels never cease their murmuring. The body grows weary, the spirit dazed, as if in stupor. The hundred vessels boil and surge, unable to attain serene clarity. Circling, one erects altars and halls, offering morning and evening sacrifices. Ghostly forms appear, dreams stir with emotion. The heart rejoices, the mind delights, believing longevity assured. Yet suddenly, life is cut short, the body left to rot and decay. Every action runs counter, perverse and contrary to the pivot of the Dao. The methods are myriad, thousands upon tens of thousands. Advancing and retreating, they defy the Yellow and the Old, twisting and turning against the Nine Capitals.\n\nThe meaning of these words is plain and easily understood; no annotations are provided, and this shall serve as the standard hereafter. The wise will grasp their intent, suddenly perceiving the path’s origin. Practice diligently, day and night without rest. After three years of ingestion, one becomes light and roams afar. Entering fire, they are not scorched; entering water, they are not drenched. They can manifest or vanish at will, ever joyful and free from care. When the Dao is perfected and virtue accomplished, they remain concealed in the dust of the world. Then the Great One summons them, relocating them to the Central Isles. When merit is complete, they ascend, receiving the register and the chart. This chapter speaks of the attainment of the Dao.\n\nThe *Fire Record* is not written in vain; it expounds the *Yi* to clarify these truths. The crescent moon method employs the crucible and furnace, with the White Tiger as the pivot of refinement. Mercury is called the flowing pearl, accompanied by the Azure Dragon. Raising the east to meet the west, the hun and po naturally constrain one another. The upper crescent is Dui, numbered eight; the lower crescent is the same. When the essences of both crescents unite, the body of Qian and Kun is formed. Two eights correspond to one catty; the Dao of the *Yi* stands firm and unshaken. Metal and water dwell together, thus Kan’s moon and the White Tiger serve as the pivot of refinement. Wood and fire share the same position, thus the flowing pearl is accompanied by the Azure Dragon. Raising the east to meet the west means Li receiving Kan, returning to the pure body of Qian. From the new moon, eight days bring the upper crescent; from the full moon, eight days bring the lower crescent. Thus it is said that two eights correspond to one catty, the sign for the medicine. This chapter discusses the medicine in terms of the four images.\n\nWhen metal enters fierce fire, its color does not fade nor its luster diminish. Since the beginning of creation, the sun and moon have never lost their brightness, nor has metal forfeited its weight; the sun and moon retain their usual forms. Metal is born from the moon, receiving the sun’s mandate at the new moon. Metal returns to its mother, and at the moon’s wane, they envelop one another. Concealing its frame, it sinks into the profound void. When metal regains its original nature, its majestic radiance illuminates the crucible. The gold within Kan is the medicine of true yang; refined in Li’s fire, it remains indestructible through the ages. This is likened to the moon’s metal essence receiving the fire of the great yang, its brilliance enduring as ever. The preceding chapter broadly discusses the four images; this chapter focuses solely on metal as the true medicine.\n\nThe numbers of zi and wu combine to make three; wu and ji are called five. When three and five harmonize, the eight minerals form the essential framework. Breathing nurtures their union, awaiting the surge that makes them husband and wife. Yellow earth is the father of metal; the flowing pearl is the mother of water. Water’s ghost is earth, which subdues water’s uprising. The Vermilion Bird is the essence of fire, maintaining balance to determine victory or defeat. If water prevails, fire is extinguished, and both perish, returning to the fertile earth. When the three natures unite, their original nature shares a common ancestor. Zi-water is one, wu-fire is two, wu-ji is five, combining to form the eight minerals. Kan and Li, husband and wife, possess the image of breathing and nurturing union. The three natures of metal, water, and fire return\n\nWhen ice and snow meet warm broth, they dissolve into the Great Mystery.\nGold takes cinnabar as its master, harmonizing with mercury.\nTransformation arises from their authenticity; beginning and end follow one another.\nTo become an immortal through ingestion, one must use substances of the same kind.\nPlant millet with millet; hatch a chicken with its own egg.\nSupporting nature with its kind, things form as easily as clay is shaped.\nCan fish eyes be pearls? Can fleabane become a casket?\nLike follows like; discordant matters cannot yield treasure.\nThus, swallows and sparrows do not birth phoenixes; foxes and hares do not nurse horses.\nWater does not flow upward in flames; fire does not moisten downward in motion.\n\nThe world abounds with scholars, lofty and gifted with fine talent.\nYet, by chance, they fail to meet their destined path, wasting fire and squandering wealth.\nClinging to texts and following words, they recklessly impose their own interpretations.\nThreads unravel without cause; measures and standards lose their grasp.\nThey smelt chalcanthite, mica, and alum-magnetite,\nburn sulfur with camphorwood, and refine mercury with mud.\nThey smelt the five-stone bronze beneath the bellows, taking it as their pivot.\nYet, with natures of different kinds, how could they willingly unite in one body?\nA thousand attempts lead to ten thousand failures; what they seek to transmute turns to folly.\nFrom youth to white-haired age, doubt arises midway.\nTurning from the Dao, they cling to delusion; stepping from the right path, they enter crooked trails.\nPeering through a tube, their vision is narrow—how can they gauge what lies ahead?\n\nHuman nature possesses it: within separation, true yin is not true yang, and cannot transform.\nHow could disparate kinds merge with metal and stone? These are all external things.\nAs for the utmost sages, none surpass Fu Xi, who drew the Eight Trigrams and the Map of the Young Heavens.\nKing Wen, ancestor of emperors, structured the body and expounded the line texts.\nConfucius, the near-sage hero, composed the *Ten Wings* to aid them.\nThese three lords were raised by Heaven, rising in succession to govern their times.\nThough their excellence followed steps, their merits and virtues did not differ.\nTheir creations built upon one another, weighing and measuring with care.\nThe tangible is easy to estimate; the formless is hard to plan.\nTheir deeds set models for emulation, establishing classics for the world.\nWithout innate foresight, they awakened through their teachers.\nBright as one who parts the curtains and ascends the high terrace,\nthe *Fire Records* of six hundred chapters share the same aim.\nThough the texts speak with solemnity, the world does not ponder deeply.\nTracing the source and flow, the hidden and manifest originally dwell together.\n\nI humbly speak for the worthy—how dare I treat these writings lightly?\nHolding my tongue, I wish to remain silent, yet cutting off the Dao invites punishment.\nPouring my thoughts onto bamboo and silk, I fear leaking Heaven’s tally.\nHesitant, I sigh, gazing up and down, stitching together this foolishness.\n\nRefinement has its methods and standards; I cannot bear to lay them all bare.\nI briefly outline the essentials; the branches and twigs will be seen in due course.\n\nThe three sages—Fuxi, King Wen, and Confucius—reveal that this Dao emerges from the *Yi*’s images, the *Hetu* (River Chart), and the *Luoshu* (Luo Writing). Zhen aligns with the eight, Xun with the three, Li with the seven, Kan with the one and six, Qian in reverse with the four, Dui in reverse with the four, Kun and Gen with one forward and one reverse, together forming the imperial fifteen. Master Wei declared that Heaven bestowed the *Hetu* upon Fuxi, who then arranged it according to the numbers of the *Luoshu*, giving rise to the precelestial eight trigrams. When the precelestial trigrams are overlaid upon the *Hetu*, the medicinal substances and fire phases become brilliantly apparent. This is how the sages perceived the Dao and grasped the mechanism of creation and transformation.\n\nWhen Qian unites with Li, it is called the yang crucible, with Li dwelling in Qian. When Kun unites with Kan, it is called the yin tripod, with Kan dwelling in Kun. When Zhen meets Li, the dragon emerges from within the fire. When Dui meets Kan, the tiger is born from within the water. These two entities embody the principle of the child producing the mother. As for the moon’s phases—waning in Zhen and waxing in Qian, waning in Xun and setting in Kun—this further reveals the subtleties of the fire phases at the solstices and equinoxes.\n\nThe Way of Heaven is vast; only the images of the *Yi* suffice to illuminate it. The Dao of the *Yi* is profound; only the sages suffice to expound it. This Dao was inaugurated by the three lords of antiquity and later elucidated by Master Wei—truly, it arises from the *Hetu*.\n\nUse metal as the embankment, and water enters with ease. The number of metal is fifteen, and the number of water is the same. When tending the furnace to set the weights, let water exceed by five parts. These two are deemed authentic: let the metal’s weight return to its origin. The third does not enter, but fire accompanies it as two. The three substances contain and receive one another, their transformations appearing divine.\n\nBeneath lies the great yang’s darkness, awaiting its moment in silence. First it liquefies, then congeals—this is called the Yellow Chariot. As the years and months draw to a close, nature is undone, and lifespan is harmed. The body becomes ash and dust, resembling the dust on a bright window. When metal and water dwell together, raising the metal draws the water in. Metal is nine, water is six—together they make fifteen. Of these fifteen parts, water claims six, leaving five parts in excess. Metal and water are the true medicine, hence they are called \"the two deemed authentic.\" The nature of wood relies on the essence of metal to form the medicine; the child is concealed within the mother’s womb, so water follows metal inward. Fire is ignited below, and transformation arises. Water, metal, and fire—these three substances are rooted in nature. Wood is governed by metal, metal is drawn by water, and metal is refined by fire. Wood has no role here, so it is said that \"the third does not enter,\" referring to these three.\n\nYang reaches its extreme and thus liquefies first; yin arises and thus congeals later. It is called the Yellow Chariot because \"heaven is dark, earth is yellow,\" and Kun is earth, the great chariot. At this stage of refinement, yang reaches its limit and yin is born, as Qian gradually transforms into Kun. When the Kun’s way is exhausted, the dragon battles in the dark and yellow, and the body becomes ash and dust—this is the first true manifestation. This passage speaks of yang reaching its limit and yin arising.\n\nCombine and harmonize the refining and blending, then hasten into the gate of crimson. Securely seal their juncture, ensuring it is complete and firm. Let the blazing fire rise from below, its roar ceaseless day and night. Begin with the civil to make it workable, and end with the martial to display it. Observe and tend with utmost care, scrutinizing the adjustments of cold and warmth. Circulate through the twelve nodes, and when each node is complete, examine it closely again. When qi is depleted and life nears its end, cease the work lest the hun and po perish. The color shifts to purple, and suddenly the elixir of return is formed. Grind it into a single pellet, and the spatula’s touch is most divine.\n\nThe four images unite to seal Dui and close the gate—thoughtless and effortless—to secure the juncture. As yin is stripped away and yang is born, Kun transforms into Qian. Qian is the great crimson, hence it is said to hasten into the gate of crimson. \"Begin with the civil to make it workable\" refers to refining the elixir and advancing the fire. Fire cannot be rushed; first, use the civil fire to temper it, ensuring hardness and softness do not resist each other. Once it is workable, advance the fire—this is the initial gentle warmth. At first, ignite the fire to conceive it, called \"wild battle.\" In the middle, nurture it with civil fire, called \"irrigation.\" In the end, use fierce fire to complete it, called \"boiling and simmering\"—this describes the stages of advancing the fire.\n\nThe color shifts to purple, and suddenly the elixir of return is formed. Purple represents Qian, the image of great crimson, the six in the third of *Yi* (Increase), and the top line of Zhen. In the end, it becomes firm. Firmness is Qian, as Zhen transforms into *Qian*.\n\nThe *Yi*’s line statement reads: \"Inform the duke with a jade tablet.\" *Yi* (Increase), being pure Qian, thus bears the image of the tablet. Qian is metal, is jade, hence it is called the \"knife-jade.\" Kan and Li unite through the two earths of Wu and Ji to form the body of Qian, which is why the character for \"tablet\" (*gui*) is composed of two earths. When the fire-phase is complete, Kun transforms into Qian, passing through the Three Palaces to rest the dead *po* and *hun*—this is the second true image.\n\nThis chapter speaks of yin at its extreme giving rise to yang, expounding the numbers of the Five Phases with concision and without excess. It takes water to stimulate fire, suddenly extinguishing radiance. The sun and moon press upon each other, ever lingering between darkness and new moon. When water flourishes, Kan encroaches upon yang; when fire wanes, Li’s day grows dim. Yin and yang devour each other, their mutual arousal the natural Way.\n\nThis discussion follows the previous chapter’s depiction of the body as ashes and dust, its vital force nearly severed—like the sun and moon pressing upon each other, obscuring their radiance, for Kan-water overcomes Li-fire. Names are given to settle essence; words are chosen to express nature. When metal returns to the origin of nature, it may be called the Elixir of Return. I dare not speak emptily, but emulate the sages’ writings. Ancient records speak of Dragon and Tiger; the Yellow Emperor praised Golden Flower. Huainan refined Autumn Stone; Wang Yang added Yellow Sprout. The worthy can uphold and practice this; the unworthy must not partake. The Way of past and present is one; in conversation, we disclose our plans. Scholars, exert yourselves further, and ponder deeply. The essential words are utterly plain, shining clearly without deceiving me.\n\nMetal’s essence, being utmost yang, returns to water’s nature of utmost yin—this is what is meant by \"returning to its root,\" and thus serving it. Essence is rooted in nature; when nature reverts to its root, it is called the Elixir of Return. This aligns with the middle section’s principle of harmonizing essence with nature. This chapter describes the congealing of the Elixir of Return.\n\n*Cantong Qi*, Scroll One, concludes.\n\nVariants:\n- \"更亲观\" (*Geng Qin Guan*) appears as \"更须亲\" (*Geng Xu Qin*) in the *Kaoyi*.\n- \"气索\" (*Qi Suo*) appears as \"黑索\" (*Hei Suo*) in the *Kaoyi*.\n- \"光明\" (*Guang Ming*) appears as \"光荣\" (*Guang Rong*) in the *Kaoyi*.\n- \"相啖食\" (*Xiang Dan Shi*) appears as \"相饮食\" (*Xiang Yin Shi*) in the *Kaoyi*.\n- \"金花\" (*Jin Hua*) appears as \"金华\" (*Jin Hua*) in the *Kaoyi*.\n\n---\n\n*The Cantong Qi*, Scroll Two\nCommentary by Chu Huagu\n\nThe firmness of Qian and the softness of Kun unite and embrace.\nYang bestows, yin receives—male and female depend on each other.\nThrough this, creation unfolds, and essence and qi expand.\nKan and Li crown the head, their radiance spreading forth.\nMysterious and profound, beyond depiction,\nThe sage measures and orders the foundational mysteries.\nThe four merge into chaos, entering directly into emptiness.\nThe sixty hexagrams cycle, woven into a chariot’s frame.\nDragon and horse are harnessed—an enlightened ruler guides the times.\nHarmony follows, the path smooth and true.\nDeviant ways are perilous, toppling nations and homes.\n\nQian and Kun, male and female—these are the medicinal substances.\n\"Yang bestows, yin receives\" means Kan governs bestowal, imparting its yang to Li;\nLi governs reception, needing yang from Kan—this is what is meant by \"uniting and embracing.\"\n\"Through this, creation unfolds, and essence and qi expand\" means that knowing the way of Kan and Li’s union,\none must also employ the six yang of creation as the fire-timing to enable the dissemination of essence.\n\"Kan and Li crown the head\" means the head is the Dao, and the medicine is the primordial qi.\nPrimordial qi is the first flourishing of the three mysteries of the primordial beginning—hence it is called \"profound darkness\" and \"mysterious foundation.\"\n\"Entering directly into emptiness\" means the four images converge, precisely to fulfill the emptiness of Li’s palace.\n\nFollowing the sixty hexagrams’ fire-timing through the celestial cycle,\nif one does not lose the proper moment, there will be harmony without peril.\n\"Dragon and horse are harnessed\" means Zhen is the dragon, Qian the horse—\nfrom the first yang to the sixth yang, the time for firing arrives.\n\nFrom \"Kan and Li crown the head\" to \"ordering the mysterious foundation\" speaks of the medicinal substances.\n\"The four merge into chaos, entering directly into emptiness\" refers to their intercourse.\nFrom \"The sixty hexagrams cycle\" onward speaks of the fire-timing.\n\nScholars advancing the fire are like enlightened rulers guiding the times,\nthus the analogy of emperors, kings, sovereigns, and lords.\nRevering the celestial Dao, assisting yin and yang,\nthey align the three luminaries to bring great peace.\nIn grand application, emperors employ it; in personal cultivation, scholars do.\nThe noble one abides in his chamber; if his words are virtuous,\nthey resonate a thousand *li* away.\nThis refers to the lord of ten thousand chariots, dwelling in the nine-fold chamber,\nissuing decrees in accord with yin and yang’s rhythms.\nStore the vessel, await the time—do not transgress the hexagrams’ months.\n\n*Zhun* uses *zi* and *shen*; *Meng* employs *yin* and *xu*.\nThe remaining sixty hexagrams each have their own days.\nI briefly present the two images, though I cannot exhaust their details.\nEstablish righteousness, enact punishments—apply benevolence, bestow virtue.\nThose who oppose it meet misfortune; those who follow it meet fortune.\nFollow the calendar’s decrees, be sincere and focused.\nCarefully observe the days and hours, scrutinize the waxing and waning.\nIn broad terms of lunar phases, the winter solstice is the hexagram *Fu*;\nin detailed terms of qi-timing, the winter solstice is *Zhong Fu*.\nThe hexagram’s line statements begin here—its meaning is profound.\n\n*Wu wu wu geng geng geng*\n*Zi xu shen chen yin zi*\nFor *Zhun*, the first line *gengzi* marks the winter solstice’s first yang;\nthe sixth line *wuxu* marks the vernal equinox’s bathing.\n\n*Bing bing bing wu wu wu*\n*Yin zi xu wu chen yin*\nFor *Meng*, the first line *wuyin* marks the summer solstice’s first yin;\nthe sixth line *bingxu* marks the autumnal equinox’s bathing.\n\nThe above uses two hexagrams as examples to fix the two solstices and two equinoxes.\nThus the following text states: \"The two solstices alter their measures, deviating and twisting;\nthe two equinoxes align horizontally and vertically, not erring by a moment’s leak.\"\nWith *Zhun* and *Meng*, the two solstices and two equinoxes are determined,\nand the subtleties of yang fire and yin tally are fully realized.\nThe slightest misalignment brings regret and harm.\n\"The two solstices alter their measures, deviating and twisting.\"\n\nIn the depths of winter, scorching heat arises; in the height of summer, frost and snow descend.\nThe two equinoxes align horizontally and vertically, not erring by a moment’s leak.\nWhen wind and rain fail to follow their seasons, floods and droughts contend;\nlocusts surge like boiling water, mountains collapse and the earth splits.\nHeaven displays its portents, strange omens proliferate.\nThe filial son’s devoted heart moves the August Ultimate.\nNear at hand, it arises from one’s own speech; far off, it flows into distant lands.\nSome bring calamity, some bring fortune;\nsome usher in great peace, some incite war and strife.\nThese four outcomes arise from the heart’s intentions.\n\nThe two solstices divide the phases of yang fire and yin tally;\nthe two equinoxes fix the mechanisms of generation, destruction, and bathing.\nThe slightest deviation—where yang encroaches or yin oversteps—gives rise to regret and harm.\nWhen rulers fail to model themselves on Heaven and Earth, aligning with yin and yang, disasters and anomalies emerge.\nWhether refining the self or governing the world, the principle is one and the same.\n\nThis passage speaks of the consequences when the patterns of the two hexagrams are not followed.\nMovement and stillness have their constancy; one adheres to the plumb line.\nThe four seasons proceed in due order, harmonizing with qi.\nHard and soft are decisively distinguished, never trespassing upon one another.\nThe Five Phases guard their boundaries, neither recklessly expanding nor contracting.\nThe *Changes* circulate in ceaseless flow, bending and stretching, reversing and returning.\nThe two solstices and two equinoxes stand sharply distinct, never encroaching upon one another;\nmovement and stillness do not miss their appointed times.\nAnticipating Heaven, Heaven does not oppose; following Heaven, one accords with its seasons.\n\nThis passage speaks of the consequences when the patterns of the two hexagrams are followed.\nBetween the dark of the moon and its first crescent, tally marks align at the center.\nIn primordial chaos, the undifferentiated, the female and male follow one another.\nEssences moisten and nourish, transformations flow and circulate.\nThe numinous spirits of Heaven and Earth cannot be measured.\nEmploy them to secure the self, conceal the form and hide away.\n\nIt begins in the northeast, the region of *Ji* and *Dou*.\nTurning rightward, it spews forth the wheel and spits out the sprout.\nHidden depths reveal their images, scattering and emitting radiant essence.\n\nThe following chapter discusses the precelestial trigrams in relation to the monthly waxing and waning of the firing times, so this chapter first traces the moon’s generation of brightness. From the union of the sun and moon, their mutual embrace and support, the hidden form nurtures the *po*-soul in the dark of the moon and its first crescent, then gradually brightens from the northeast. Above *Xu* and *Bi*, *Zhen* emerges as the omen. Yang *qi* initiates its inception, the first nine as the \"hidden dragon.\" Yang is established in threes, yin flows through eights. Thus, on the third day, *Zhen* stirs; on the eighth day, *Dui* moves. The second nine appears as the dragon, harmonious and luminous. When the virtues of three and five are perfected, the body of *Qian* is complete. The third nine watches in evening vigilance, the divine tally waning and fracturing. Flourishing and decline gradually transform, ultimately returning to their origin. Such is the firing time of yang.\n\n*Xun* inherits its lineage, seizing the opportunity to maintain control. The fourth nine leaps or retreats, the Way perilous in advance or withdrawal. *Gen* governs progression and cessation, unable to be polished or removed. On the twenty-third day, one guards the appointed time of the crescent moon. The fifth nine soars as the dragon, the celestial position bringing joy. The sixth five, *Kun* in submission, binds and concludes the beginning and end. It nurtures the multitude of offspring, becoming the mother of all kinds. The yang numbers are exhausted, and upon exhaustion, they arise anew. Following nature and uniting with essence, they turn and join together. The ninth yang, the \"exalted dragon,\" wages virtue in the wilds. Employing the nine, they flutter and become the compass and square of the Dao. Such is the firing time of the yin tally.\n\nFollowing the pivot of the celestial sphere, ascending and descending, rising and falling, the six lines circulate in revolution—difficult to perceive. Thus, they have no fixed position, forming the ancestral foundation of the *Yi*. This discusses the firing times of the preceding chapter, aligning the six lines of the *Yi* trigrams with the revolving pivot’s ascent and descent. Therefore, having no fixed position reveals that the movement of a single yang line is not confined to the winter solstice, midnight, or the dawn of the new moon—it merely borrows these to illustrate brightness.\n\nThe dawn of the new moon is *Fu*, where yang *qi* first flows. Entering and exiting without haste, it establishes the marker of subtle firmness. When the Yellow Bell tunes to *Zi*, omens flourish and manifest. Spreading warmth and softness, the common people thrive in constancy. The *Lin* furnace applies its branches, opening the path of true radiance. The light gradually advances, the days lengthening. The Great Regulator of *Chou* adjusts the balance of high and low. Gazing upward, it completes *Tai*, where firm and yielding descend together. Yin and yang intertwine, the small departing and the great arriving. The spokes converge at *Yin*, moving in accord with the seasons. Progressing through *Da Zhuang*, it commands the gate of *Mao*. Elm pods fall, returning to their root. Punishment and virtue alternate, day and night begin to divide. In *Guai*, yin retreats while yang ascends. Washing and cleansing feathers and wings, it shakes off the dust of slumber. *Qian*’s vigor shines brightly, broadly covering the four neighbors. Yang culminates at *Si*, where the *Zhong Lü* interact. *Shen* begins its lineage, treading frost first. The cold spring at the well’s bottom, *Wu* as the guest of *Luo*. The guest submits to yin, yin becomes the host. *Zhu* departs from its position, gathering its essence. Cherishing virtue and awaiting the time, it rests in obscurity. *Pi* blocks and does not flow, what sprouts cannot grow. Yin extends while yang is slandered, yang’s name erased. *Guan* measures its authority, examining the conditions of mid-autumn. Nurturing the young and tender, the old and withered revive. Shepherd’s purse and wheat sprout, emerging beneath the cover. *Bo* rots the limbs, dissolving its form. When the transforming *qi* is exhausted, the utmost spirit is lost. When the Dao is exhausted, it returns to the origin of *Kun*. Constantly following earth’s principles, it receives Heaven and spreads its decrees.\n\nThe twelve months’ firing times, in their cyclical revelation, elucidate the meanings of the *Zhun* and *Meng* trigrams. The *Na Jia* diagram generates brightness in the northeast at the *Yin* position. Thus, speaking of the new moon’s first day, *Fu* arises at dawn, making it clear that the single yang is not confined to the *Zi* month or *Zi* hour. The preceding chapters all discuss firing times.\n\nThe profound and distant mysteries interconnect across barriers. Responding to measures and nurturing seeds, they are the origin of yin and yang. Vast and indistinct, none know their beginning. Those who lose the path first become followers; those who grasp it later become rulers. No level ground remains without slope—such is the Dao’s nature. Change and transformation alternate in盛衰, waxing and waning mutually dependent. Ending with *Kun* and beginning with *Fu*, it follows like a linked ring. Emperors and kings who inherit and govern, abiding by this principle, endure for a thousand generations. Yin and yang revolve and cycle, mutually rooting one another. Emperors and kings who grasp this Dao and receive Heaven to govern all things thus endure for millennia, expanding its application.\n\nThe emperor’s body serves as the master of the three ultimates, rectifying the five affairs to harmonize Heaven and Earth, following yin and yang to wield the handle of life and death. Thus, they enjoy long reigns, the people at peace and the state prosperous, the royal ultimate established to receive the five blessings. The Yellow Emperor ascended by this principle, embodying both essence and function. Otherwise, arrogance and excess lead to fullness, the royal ultimate unestablished. Flood and drought contend, the moon’s phases wax and wane, winter heat and summer snow—none may attain longevity.\n\nFrom the Son of Heaven to the common people, those who grasp this prosper; those who lose it perish. Thus, the following chapter discusses the scholar’s application, while this chapter addresses the emperor’s use.\n\nTo nurture one’s nature, extend life, and delay the appointed time, one must deliberate on what follows and consider what precedes. The body one receives is fundamentally empty. Primordial essence spreads like clouds, relying on *qi* to establish its beginning. Yin and yang serve as measures, the dwelling of *hun* and *po*. The yang spirit is the sun’s *hun*, the yin spirit the moon’s *po*. *Hun* and *po* mutually serve as dwellings. Nature resides within, establishing boundaries and banks. Emotion operates externally, constructing walls and outer fortifications. When the city walls are complete, people and things find peace. At this time, emotion harmonizes with *Qian* and *Kun*. *Qian* moves directly, *qi* spreading and essence flowing. *Kun* is still and receptive, serving as the Dao’s dwelling. The firm advances and retreats, the yielding transforms and nourishes. Nine returns, seven reverses, eight returns, six resides.\n\nThe man is white, the woman red—metal and fire restrain each other.\nThus water settles fire, the inception of the Five Phases.\nSupreme goodness resembles water, pure and without flaw.\nThe Dao’s form and image—True Unity is hard to depict.\nTransforming and dispersing, each dwells in solitude.\nBefore a person is born, only True Unity exists.\nFrom nothing to being, transformation flourishes to form the body,\nwhich shelters *hun* and *po* to take residence.\n\nThe sun’s *hun* is fundamentally yang spirit; the moon’s *po* is fundamentally yin spirit.\nThe Chamber’s sun-hare reverses within the moon;\nthe Net’s moon-crow reverses within the sun.\nThe middle lines of *Kan* and *Li* are likewise—each serves as the other’s dwelling.\nNature is *hun*; emotion is *po*.\nWhen nature gains emotion as its guardian, it does not lose its origin.\n\nThe *Kan* man obtains the *Qian* line, moving to bestow essence;\nthe *Li* woman obtains the *Kun* line, empty and receptive.\nNaturally, nine fires and seven metals return to the origin and revert to the root;\neight woods and six waters return to the source and reside in the spring.\nThis is the Four Images discussed through the Luo River’s completed numbers.\nMetal is white, fire red—hence the sun’s red and white.\nMetal is the true yang within *Kan* man; fire is the true yin within *Li* woman—\nthese are the two functions of metal and fire.\nAbove speaks of the Four Images—seven, eight, nine, and six—\nwhile below mentions only metal, water, and fire,\nwhich shares the same meaning as the mutual containment of the Three Substances.\n\nThe Four Images unite as one body—this is True Unity,\nwhose image cannot be bathed or described.\nWhen dispersed, the Five Phases each attain one direction’s flourishing.\n\nThis chapter speaks of the scholar’s practice.\nIt is like a chicken’s egg, black and white supporting each other.\nA single inch in length and breadth serves as the beginning.\nThe four limbs and five viscera, sinews and bones, are thus complete.\nAfter ten months pass, it emerges from its womb.\nIts bones are weak enough to bend; its flesh is smooth as lead.\n\nThis discusses the previous chapter’s Daoist form and image.\nA yang burning-mirror gathers fire—without the sun, it does not produce light.\nA *fangzhu* vessel does not rely on stars or moon—\nhow could it obtain water or broth?\nThe two *qi* are profound and distant, yet their transformations still communicate.\nHow much more so for what is near and stored within the body,\nintimately present in the heart and chest?\n\nYin and yang pair with the sun and moon; water and fire serve as their effects.\nUsing objects to interact with the sun and moon,\none can still obtain water and fire.\nHow much more so for a person possessing true yin and true yang,\nwho models the sun and moon to conceive *Kan* and *Li*—what difficulty could there be?\n\nThe three treasures of ear, eye, and mouth—\nfirmly seal them, do not let them open or communicate.\nThe Perfected One lurks in the deep abyss,\nfloating and roaming while guarding the compass’s center.\nTurning and curving to survey, opening and closing all harmonize.\nThey serve as the axle and linchpin for oneself—\nmovement and stillness never exhaust.\n\n*Li*’s *qi* internally defends; *Kan* does not employ hearing.\n*Dui* unites without speech, few words follow the Primordial Vastness.\nOnce these three are secured as key mechanisms,\nrelax the body and dwell in an empty chamber.\nEntrust your will to emptiness and nothingness,\ntaking absence of thought as the constant.\nProof is difficult to shift—focus the mind without distraction.\nIn sleep, spirit embraces spirit; upon waking, observe presence and absence.\nThe complexion gradually moistens,\nthe bones and joints grow ever stronger.\nExpelling the host of yin demons,\nonly then is true yang established.\n\nIf cultivation never ceases,\nthen dark clouds will disperse like rain.\nDrizzling like spring’s moisture,\ntrickling like melting ice.\nFrom the head it flows down to the feet,\nultimately ascending again.\nComing and going, it penetrates the boundless,\npermeating the body’s interior.\nReversion is the Dao’s verification; weakness is virtue’s handle.\nWeed out long-standing filth,\nand the subtle is harmoniously regulated.\nThe turbid is the path to clarity;\nprolonged darkness leads to illumination.\n\nOnce the sacred embryo is formed, it is tightly sealed and firmly closed.\nGuard it with non-action, hold it without obscurity—\nnaturally, these functions arise:\nfrom darkness to light, from turbidity to clarity,\nfrom the *Kun* body gradually transforming into pure *Qian*.\n\nThe previous chapter spoke of the sacred embryo’s image;\nthis chapter speaks of the method of nurturing it.\n\nWorldly people favor petty safeguards,\nnot examining the Dao’s depth or shallowness.\nThey abandon the correct path to follow deviant trails,\nseeking speed but finding the gate blocked.\nLike the blind refusing a staff,\nor the deaf listening to palace music.\nThey cast nets in water to catch pheasants and hares,\nor climb mountains to seek fish and dragons.\nThey plant wheat hoping to harvest millet,\nor use a compass to seek a square.\nExhausting their strength and laboring their spirit,\nthroughout the year they see no success.\n\nIf you wish to know the method of ingesting and refining:\nthe affair is simple and not burdensome.\nIts meaning is clear and requires no further explanation.\n\nThe sun’s flowing pearl constantly seeks to leave.\nSuddenly obtaining golden radiance, it turns and relies upon it.\nTransforming into white liquid, it congeals into utmost hardness.\nThe golden radiance first initiates—\nafter a brief moment, it dissolves and transforms into water,\nlike horse’s teeth arranged in rows.\nYang then goes to harmonize—nature and emotion naturally unite.\nPressing upon the timely yin,\nit is restrained and confined within the gate.\nThe compassionate mother nurtures; the filial son repays kindness.\nThe stern father issues commands; the strict teacher instructs descendants.\nThe Five Phases vie for supremacy, relying on each other to generate.\n\nFire’s nature melts metal; metal chops down wood’s flourishing.\nThe Three, Five, and One—these are heaven and earth’s utmost essences.\nThey can be transmitted orally but are difficult to convey in writing.\n\nThe flowing pearl is the mercury within *Li*—\nits nature is to blaze upward and flee.\nYang metal then carries water to restrain it,\nwondrously uniting and congealing.\nThe golden radiance first initiates—\nafter a brief moment, it transforms into water:\nonce metal and fire unite, fire can melt metal into water,\nhence the later statement that fire’s nature melts metal.\n\n“Yang then goes to harmonize—nature and emotion naturally unite”\nmeans that yang’s emotion and yin’s nature find their kindred,\nnaturally blending so that *qi* returns to the original sea.\nThe leak is eternally sealed—thus it is said to press upon the timely yin.\nFire does not blaze upward; all thoughts vanish, cutting off the ghostly path—\nhence it is said to be restrained and confined within the gate.\n\nYang metal restrains wood to prevent it from generating fire;\nif fire arises and disaster erupts, it will surely be overcome—\nhence the later statement that metal chops down wood’s flourishing.\n\n*Li* obtains the *Kun* line as the mother’s way,\nresiding in the south to govern summer, taking nurturance as its duty—\nthus it is called the compassionate mother nurturing.\n*Kan* obtains the *Qian* line as the father’s way,\nresiding in the north to govern winter, taking severity as its essence,\nusing harm as kindness—thus it is called the stern father.\n\nThe annotation on \"Three Fives and One\" follows below.\n\nThis chapter speaks of the creative transformations of *Kan* and *Li* in union.\nThe *zi* hour turns rightward, while *wu* revolves eastward.\n*Mao* and *you* stand as boundaries, establishing the two names.\nThe dragon calls to the tiger; the tiger inhales the dragon’s essence.\nBoth feed upon each other, each coveting the other’s glory.\nThus they swallow and chew, devouring one another.\nWhen *Yinghuo* guards the west and *Taibai* traverses the heavens,\nwherever the killing *qi* descends, what can stand unshaken?\nThe foxhound guards the rat; the crow and sparrow fear the goshawk.\nEach has its function—how dare they make a sound?\n\n*Zi* turns rightward to align with *you*; *wu* revolves eastward to align with *mao*.\nWhen *you* occupies the *wu* position, it is precisely the short-day *Mao* star,\nmarking the mid-winter moment of the first yang.\nAt this time, union may be achieved.\nThe two names refer to the dragon and tiger.\nTheir mutual swallowing and merging form the image of union.\nAt first, they covet each other; in the midst, they contend;\nin the end, they devour—progressing from shallow to deep,\nnaturally uniting as one, *Kan* and *Li* in conjugal harmony.\n\nWhen *Yinghuo* guards the west and *Taibai* traverses the heavens,\n*wu* aligns with *you*, and the great fire descends upon *wu*—\nprecisely the long-day *Huo* star, marking the mid-summer moment of the first yin.\nYin governs the withering and killing; all things retreat and withdraw.\nAt this time, the yin tally stills the fire.\nThe adept understands the mechanism of *zi* and *wu*—one yin, one yang—\ncommanding the metal tiger to restrain the wood dragon,\npreventing it from taking flight, like the dog guarding the rat,\nlike the crow fearing the hawk—each fulfilling its function.\n\nThis chapter reveals the subtle principle of yang fire and yin tally.\nWithout grasping its truth, one speaks in vain,\nexhausting family wealth, leaving wife and children hungry and poor.\nFrom ancient times to now, countless have pursued this path,\nyet few have met with success, and rarer still are those who achieve it.\nSeeking famous medicines far and wide only strays from the Dao.\nIf one truly encounters it and perceives its beginnings,\ncomparing like to like and measuring things from start to finish,\nthen the Way may be attained.\n\nThe Five Phases restrain one another, each in turn becoming father and mother.\nThe mother contains the nourishing fluid, the father governs bestowal and endowment.\nEssence congeals and form flows—metal and stone do not decay.\nWith careful focus and no leakage, one may attain the Way of completion.\nErect a pole and see its shadow; call into the valley and hear its echo—\nhow can this not be numinous? It is the supreme image of Heaven and Earth.\n\nYet if one takes a mere inch of *yege* or a single ounce of *badou*,\nswallowing brings instant collapse, leaving one unable to turn or lift.\nAt such a moment, even if King Wen were casting milfoil stalks,\nConfucius interpreting omens, Bian Que wielding his needles,\nor Wu Xian beating his drum—\nhow could they revive the fallen or restore them to swift movement?\n\nThe Five Phases restraining one another means:\nwhen metal encounters water, metal weakens;\nwhen wood encounters fire, wood is overcome.\n\"Each in turn becoming father and mother\" refers to:\nwood originally giving birth to fire, and fire then gestating wood;\nmetal originally giving birth to water, and water then nurturing metal.\n\nThe mother contains the nourishing fluid, the father governs bestowal and endowment—\nthis shows yang endowing and yin receiving.\nThe Maiden by the River is numinous and most divine.\nWhen she obtains fire, she takes flight, leaving no trace of dust.\nGhosts conceal themselves, dragons hide—none know where they abide.\nShould one wish to restrain her, the Yellow Sprout becomes the root.\n\n*Li* is the Maiden, positioned in the *wu* wilds,\nbelonging to the Zhou division of the Three Rivers—hence \"Maiden by the River.\"\nIs the naming and fixing of images done carelessly?\nWhen the fire of *Li* is born, calamity arises and restraint is broken—\nthis illustrates how human nature, when stirred,\nif not aligned with the proper, scatters and loses its original truth,\nso that \"entering and exiting, none know its direction.\"\nLike mercury within cinnabar—when exposed to fire, it flees without a trace.\n\nWhether drawing near from the body or far from things,\nthe principle is one and the same.\nThis aligns with the chapter on \"The Flowing Pearl of Great Yang.\"\nThe Flowing Pearl is the Maiden, the fire within *Li*.\nThe Yellow Sprout is Golden Flower, the metal within *Kan*.\n\nThis chapter speaks of medicinal substances.\nThings devoid of yin and yang defy Heaven and contravene the Origin.\nA hen hatching alone—her chicks will not be whole.\nWhy is this so?\nThe union was not complete; the Three and Five did not merge;\nhard and soft remained apart.\nThe essence of transformation is the natural process of Heaven and Earth—\nlike fire rising when stirred, like water flowing downward to moisten.\nIt is not some mastered method that compels this, only to change it later.\n\nObserve the mating of male and female in their union—\nhard and soft intertwine, inseparable.\nWhen the proper timing aligns, it is not through craft or artifice that they are governed.\nWhen a boy is born, he lies prone; when a girl is born, she lies supine—\nendowed in the womb, receiving qi from the primal beginning.\nThis is not merely visible at birth;\neven in death, they replicate it.\nIt is not that parents teach them to do so—\nthe pattern was set at the moment of union, determined from the very start.\n\nTo say that solitary yin cannot complete, or solitary yang cannot complete,\nis also natural.\nThe union of *Kan* and *Li* likewise arises naturally,\nnot through human effort forcing it to be so.\n*Kan* as the male is the moon; *Li* as the female is the sun.\nThe sun bestows virtue; the moon unfurls its light.\nThe moon receives the sun’s transformation, its body unharmed.\nIf yang loses its bond, yin encroaches upon its brightness.\nAt the dark and new moons, they press close, enveloping one another.\nYang’s form diminishes; yin’s encroachment brings calamity.\n\nMale and female depend on one another, inhaling and exhaling to nourish.\nMale and female unite in congress, seeking their kind.\nMetal transforms into water, water’s nature circulating freely.\nFire transforms into earth, blocking water’s flow.\nThus the male moves and bestows outwardly; the female is still and stores within.\nIf overflowing exceeds the proper measure, she becomes constrained.\nThe *po* restrains the *hun*, preventing excess and extravagance.\nNeither cold nor hot, advancing and retreating in timely accord—\neach attains harmony, both emitting confirming signs.\n\nWith the sun and moon, male and female, yin and yang—\nthe image of their union is made clear.\nLosing their bond results in obscuration and eclipse.\n\"Metal transforms into water, water’s nature circulating freely\" means:\nwater born within metal seeks to overcome the fire of *Li*,\nbut the fire of *Li* generates earth, which in turn overcomes water,\ncausing water to submit and remain still.\n\n\"Male moves and bestows outwardly; female is still and stores within\"—\nthis shares the same meaning as yang endowing and yin receiving.\n\"The *po* restrains the *hun*\"—emotion guards nature, metal restrains wood.\n\"Not permitting excess and extravagance\"—nature is not transformed by emotion.\n\"Neither cold nor hot, advancing and retreating in timely accord\"—\nnot losing the solar terms of yin and yang’s division,\nadvancing fire and ceasing tally all align with proper measure,\nthus each emits confirming signs.\n\nCinnabar, the essence of wood, unites with metal to merge.\nWhere metal and water combine, wood and fire become companions.\nThe four intermingle in chaos, arrayed as dragon and tiger.\nThe dragon’s yang number is odd; the tiger’s yin number is even.\nThe liver, green, is the father; the lungs, white, are the mother.\nThe kidneys, black, are the child; the spleen, yellow, is the ancestor.\nThree things form one household, all returning to *wu* and *ji*.\n\nThe four images unite and return to *wu* and *ji*—see previous notes.\nThe above all discuss union.\nHard and soft alternate in ascent, traversing the divisions in turn.\nThe dragon in the west, the tiger in the east—\nestablishing the weft at *mao* and *you*.\nPunishment and virtue converge, meeting in joy.\nPunishment governs submission and killing; virtue governs generation and ascent.\n\nIn the second month, the elm withers as *yin* approaches *mao*.\nIn the eighth month, wheat sprouts as Heaven’s *yang* occupies *you*.\nNorth at *zi*, south at *wu*—each serves as the other’s guiding principle.\nThe numbers nine and one cycle endlessly, beginning anew.\nEmbracing the primal in *xu* and *wei*, scattering essence at *zi*.\nWhen yang grows, yin diminishes; when yin diminishes, yang grows—\nhard and soft alternate in ascent.\nThe twenty-eight constellations govern the twelve earthly branches,\ntraversing the twelve celestial divisions—this is \"traversing the divisions in turn.\"\n\nThe dragon’s position is east yet faces west; the tiger’s position is west yet faces east—\n*mao* and *you* intersect, hence \"the dragon in the west, the tiger in the east.\"\nThe *Dragon-Tiger Classic* states: \"North and south form the warp,\"\nthus we know *mao* and *you* form the weft—hence \"establishing the weft at *mao* and *you*.\"\n*Mao* is virtue, governing generation;\n*you* is punishment, governing killing.\n*Mao* and *you* intersect—within generation lies killing, within killing lies generation.\nThus in the second month, the elm falls as *xin* in *xu* approaches *yi*...\n\nIn the eighth month, wheat sprouts—*chen* holds *yi* as *xin* approaches *xin*.\n\nSince *mao* now resides in *you*,\nnaturally *zi* lies in the south and *wu* in the north—\nhence \"the south of *zi*, the north of *wu*,\" each serving as the other’s guiding principle.\nThis is what the *Dragon-Tiger Classic* calls \"Wings Spread, Flying Void-Danger.\"\n\nOnly Master Zhang Ziyang deeply grasped this meaning,\nthus his poem on the fifteenth night of the eighth month,\nplaying beneath the toad’s radiance—\nprecisely when the metal essence stands in full vigor.\n\nMoreover, the fifteenth of the eighth month marks mid-autumn,\nwhen the midnight star *Xu* governs the season’s center.\nAt the hour when *Xu* and *Wei* lodge in the sky,\nthey align with the position of *Zhang*’s stars—\n*zi* south and *wu* north,\nthe dragon west and the tiger east,\npunishment and virtue converging,\nheaven and earth overturned,\nmetal and water brimming,\nthe elixir body in pure yang.\n\nThe numbers nine and one complete and begin anew:\n*Kan*’s one joins *Li*’s nine,\nthen nine returns to join one,\neach ending where the other begins.\n\nFollowing this, \"containing primal *Xu-Wei*, sowing essence in *zi*\"—\nthe *wu* fire receives conception in *zi*,\nfor *wu* is placed upon *zi*,\nhence \"containing primal *Xu-Wei*.\"\nThe *Kan* water scatters the pure essence of the central line into *Li*,\nas *zi* is placed upon *wu*—\nhence \"sowing essence in *zi*.\"\n\nThis passage speaks of the elixir body in pure yang.\n\n*Guan guan* cry the ospreys,\non the river’s isle.\nLovely and refined the maiden—\nthe noble man’s fine match.\n\nThe male does not dwell alone,\nnor does the female reside in solitude.\nThe Dark Warrior—tortoise and serpent—\ncoil and intertwine in mutual support.\nThus it is made clear: yin and yang,\nin the end, must depend on one another.\n\nWere two women to share a chamber,\ntheir beauty as sisters,\nthough Su Qin were to mediate,\nZhang Yi to broker the match,\ntheir eloquence sharp as blades,\ntheir words sweet and persuasive,\ntheir hearts laid bare in perfect harmony,\nurging them to wed—\nyet with hair grown brittle and teeth decayed,\nthey would never truly know one another.\n\nIf the ingredients are not of the same kind,\ntheir names and categories disparate,\ntheir measures mismatched,\ntheir principles lost—\nthough the Yellow Emperor himself tend the furnace,\nthe Great One descend to his seat,\nthe Eight Lords invoke and refine,\nHuainan grasp the flame,\npavilions raised and altars exalted,\nsteps and terraces of jade,\nunicorn jerky and phoenix cured meat offered,\nregisters held in long obeisance,\nprayers and petitions to the gods,\npleas to the mournful dead,\nbathing and fasting in purification,\nall in hope of some result—\nit would be no different than mending a cauldron with glue,\nor smearing a wound with bronze,\nadding ice to frost,\nor curing heat with boiling water.\nFlying turtles and dancing serpents\nwould only appear more perverse.\n\nThis speaks of yin relying on yang,\nreiterating the opening meaning of *Guan Ju*:\nthe union of male and female.\n\n*Thus concludes the middle scroll of the* Zhouyi Cantong Qi. *(The character* 喻 *was originally* 论*, emended here according to the sense of the text.)*\n\nHere follows the translation:\n\nOnly the sages and worthies of old\nembraced the mysterious and held fast to the true.\nThey ingested and refined the Nine Cauldrons, concealed in reclusion,\ncontained essence and nurtured spirit,\ncommuned with virtue through the Three Origins.\nEssence and fluid converged in the textures,\nsinews and bones grew firm.\nAll perverse influences were dispelled,\nand the upright qi endured ever after.\nThrough long and patient accumulation,\nthey transformed their forms and ascended as immortals.\n\nMoved by compassion for later generations,\nthose who loved the Dao,\nthey followed the winds of influence,\ntraced and sketched the ancient texts,\ncomposed them into illustrated works,\nand revealed them to posterity.\nYet they exposed only the branches,\nconcealing the root.\nThey entrusted them to various stones,\nveiled them beneath layers of texts.\nScholars who obtained them\nhoarded them in secrecy all their lives.\nSons inherited their fathers’ work,\ngrandsons followed their ancestors’ path.\nTransmitted through generations in confusion,\nnone ever gained true insight.\nThus officials failed in their careers,\nfarmers neglected their plowing,\nmerchants abandoned their goods,\nand men of resolve fell into poverty.\n\nI grieve deeply for this,\nand so set down these writings in order.\nThe words are concise and easy to ponder,\nthe matters few and free of clutter.\nI lay out their principles in sequence,\nsubstantial and verifiable to behold.\nWeights and measures are precise,\neach following in due succession.\n\nThus I compose these disordered verses,\nopening the gates through their apertures.\nLet the wise examine and reflect,\nand weigh them with their own understanding.\n\nThe Nine Cauldrons are cauldrons of metal.\nIn the *Luoshu*, nine is the completed number of metal,\nand nine is the yang number of Qian-metal.\nThe cauldron is the chamber of metal.\n\nThis chapter first speaks of the medicine.\nNo model is greater than Heaven and Earth—\ntheir mutual boundary spans tens of thousands of miles.\nWhen the River Drum approaches the Stellar Enclosure,\nthe people are all seized with terror.\nThe shadow’s reckless advance and retreat\nbring nine years of calamity.\nThe August Emperor, beholding the portents of Ruin,\nthe king retreats and reforms himself.\nThe key has its rises and falls,\nand the black harm flees in haste.\nWhen the Yangzi and Huai run dry,\ntheir waters pour into the sea.\n\nThe female and male of Heaven and Earth\nrevolve between *zi* and *wu*.\n*Yin* and *shen* are the ancestors of yin and yang,\nissuing and entering, returning to their beginning.\nFollowing the Dipper’s handle in its sweep,\ngrasping the balance to fix the primal order.\n\nThe cauldron and the vessel\nmodel Qian and Kun.\nThe mutual boundary is the division of yin and yang,\nlike the place where cauldron and vessel join and meet.\nIt speaks of the separation between metal and wood,\nas distant as Heaven and Earth—\nhow many tens of thousands of miles apart?\nOnly the Dao can bring them together.\n\nWhen the River Drum approaches the Stellar Enclosure,\nfire presses upon the metal position, threatening metal.\nThis means *li* should reside below,\nyet instead it rises above.\nThe nature of *li* is to flame upward,\nwater and fire unbalanced,\nunable to embrace the Qian-metal within *kan*,\nviolating the principle of the dragon’s descent and the tiger’s ascent.\nLosing the key,\nhard and soft resist each other,\nfailing to interpenetrate.\nThe true medicine scatters in all directions—\nhence the people are seized with terror.\nThe people symbolize the medicinal substances.\n\nThe *Wuzhen Pian* says:\n“The tiger is called the cliff’s head, the dragon the sea.”\nThe fire lies below, the metal above.\nThe preceding section states:\n“The blazing fire spreads below,”\nand again:\n“Below, there is no Great Yang.”\nThe method’s highs and lows are clearly evident.\n\nWhen the shadow recklessly advances or retreats,\nthe shadow marks the timing of advancing and withdrawing fire.\nIf the rhythm is lost—\nadvancing when it should not,\nretreating when it should not—\nthen nine years of water bring calamity.\nThis is like the solstices altering their degrees,\nthe equinoxes shifting their alignments,\ncausing floods and droughts to contend,\nmountains to collapse and the earth to split.\n\nThe sovereign, recognizing these errors and correcting them, aligns the lows and highs of the pivotal mechanism. The five *qi* follow their proper sequence, and the pernicious, rebellious *qi* flee far away. The waters of the Yangtze and Huai naturally flow to pay homage to the sea, and the medicinal substances return to their origin.\n\nThe Heaven and Earth’s female and male—lingering between *zi* and *wu*—are the true yin of *kan*-man and the true yang of *li*-woman. The *yin* and *yang* ancestors of *yin* and *shen* refer to the *yin* tally and *yang* fire originating in *yin* and *shen*. In the *Na Jia* diagram, the moon emerges from *zhen*-*geng*, where the first yang line stirs and the *yang* fire originates; the moon wanes in *xun*-*xin*, where the first yin line transforms and the *yin* tally originates. In the *Prior Heaven* trigrams, *zhen* occupies the *yin* position and *xun* the *shen* position, thus establishing the two solstices. Hence, *yin* and *shen* are the ancestors of *yin* and *yang*. The moon emerges from *yin* and enters *shen*, entering and then re-emerging—thus its rising and setting complete the cycle. Following the turning of the Dipper’s handle, the *Na Jia* fire phases are determined, hence it is said: “grasping the balance to fix the primordial纪.”\n\nThe *Yuan* Star Lord and *Ji* Star Lord are star names within the Dipper. When the *River Drum* approaches the *Star Ji*, the people are seized with terror—this speaks of failing to adhere to the method’s measures, causing the medicinal substances to scatter. When the shadow recklessly advances or retreats, nine years bring calamity—this speaks of not following the fire phases, causing water to lose its nature. The pivotal mechanism has lows and highs—this speaks of correcting errors, aligning with the method’s measures, causing pernicious *qi* to flee and disasters to dissipate. The Yangtze and Huai’s drying up, their waters flowing into the sea—this speaks of adhering to the method’s measures, following the fire phases, and the medicinal substances returning to their origin. *Zi* and *wu* refer to the medicinal substances; *yin* and *shen* refer to the fire phases. Following the Dipper’s turning, *yin* and *shen* determine the morning and evening of *pi* and *tai*. This should be carefully pondered.\n\nThis chapter elaborates on the method’s measures for intercourse and concludes with the fire phases.\n\nRising and toasting upon the *Fan* Mountain—\nthe blazing fire spreads below.\nThe White Tiger leads the way—\nthe Azure Fluid harmonizes behind.\nThe Vermilion Bird soars and plays,\nits flying radiance displaying five hues.\nSuddenly, it encounters a net cast—\npressed down, it cannot rise.\nIts wailing cries are mournful,\nlike an infant longing for its mother.\nOverturned and plunged into boiling water,\nits feathers and wings are crushed and broken.\nBefore half the clepsydra’s mark has passed,\nthe dragon’s scales stir restlessly.\nFive-colored images dazzle,\ntransforming without constant master.\nThe cauldron seethes and surges,\nviolently surging without cease.\nJumbled and layered in piles,\nlike interlocking canine teeth.\nIts form like midwinter ice,\nrailing-like stalactites sprout.\nTowering and tangled,\ncrossing and propping one another.\n\nWhen yin and yang find their match,\nthey settle in tranquil mutual embrace.\nThe Green Dragon dwells in *Fang*-six—\nspring blossoms in *zhen*-east-*mao*.\nThe White Tiger resides in *Xu*-seven—\nautumn’s awns in *dui*-west-*you*.\nThe Vermilion Bird is in *Zhang*-two—\ntrue yin in *li*-south-*wu*.\nAll three come to pay homage,\ntheir families forming a chorus of kinship.\nOriginally but two substances—\nin the end, they become three and five.\nThree, five, and one together—\nall gather in one place.\n\nRefine them according to the above method,\nand the days’ count also follows accordingly.\nThe White Tiger and Azure Fluid are metal and wood. The Vermilion Bird, receiving wood, generates fire—its nature is to fly and flee. Metal, having overcome wood, further restrains it with water, so the Vermilion Bird, as if caught in a net, cannot take flight. The *li* fire, unable to generate, returns to *zhen* wood—hence the dragon’s scales shimmer in five colors. *Zhen* is the dragon, *li* is radiance.\n\nCanine teeth, winter ice, railings, and stalactites—all are true images. The Green Dragon, White Tiger, and Vermilion Bird correspond to the earlier White Tiger, Azure Fluid, and Vermilion Bird, reiterating their significance. *Fang*-six, *Xu*-seven, and *Zhang*-two are likewise reiterated. Fire is born of wood, water of metal—by mentioning these three, the Five Phases are encompassed. *Fang*-six, *Xu*-seven, and *Zhang*-two sum to three and five—these are the medicinal substances. The fire phases also take three, five, and fifteen as the count for *yang* fire, hence it is said: “the days’ count also follows accordingly.” The Dragon and Tiger, originally two substances, with fire become three and five. Together with water’s one, they form the Four Images, all converging in *wu* and *ji* to merge as one.\n\nWhenever fire phases are discussed earlier, medicinal intercourse invariably follows. Whenever medicinal intercourse is discussed earlier, fire phases invariably follow. This should be carefully examined.\n\nThis chapter describes the images of intercourse.\n\nFirst white, then yellow—\nred permeates inside and out.\nNamed the First Cauldron,\nits grains like great millet.\nThis is nature’s doing,\nnot some devious path.\nMountains and marshes’ *qi* steam,\ngiving rise to clouds and rain.\nDried mud becomes dust—\nextinguished fire turns to earth.\nLike the *nie* dye turning yellow,\nor indigo forming green silk.\nHides boiled into glue,\nor *gou* fermenting into wine.\nKindred substances easily work upon one another—\nunrelated kinds are difficult to craft.\nOnly this wondrous art,\nexamined and verified, speaks no falsehood.\nTransmitted to a hundred million generations hence,\nit shines clearly and can be studied.\nBright as the starry Han,\ndeep as the sea’s source.\nPonder it until thoroughly familiar,\nrepeatedly turning it over.\nAfter a thousand cycles, it gathers in brilliance—\nafter ten thousand repetitions, it becomes visible.\nThe divine may reveal it to one,\nor the soul suddenly awaken.\nProbe its beginnings, seek its threads—\nyou will surely find its gate.\nThe Dao of Heaven favors none—\nit is always transmitted to the worthy.\n\nThe fire within *li* is originally white; receiving lead, it turns yellow. When the fire is sufficient and the elixir is formed, it changes to red—then the color shifts further to purple. Red permeating inside and out embodies *qian* as great red. The millet-pearl takes form, named the First Cauldron—this is the completion of the elixir path. The sages’ and worthies’ words all follow methodical order.\n\nThis chapter describes the image of the elixir’s completion when the fire is sufficient.\n\nThe *Five Phases’ Mutual Generation* and the *Cantong Qi* expound broadly but do not achieve purity. Minute details remain unaddressed, leaving gaps and approximations.\n\nHere now is the translation, continuing the established conventions:\n\n---\n\nI have therefore compiled and recorded anew, filling gaps and omissions, refining what is profound and obscure, linking threads to ensure coherence, aligning intent and purpose without deviation. Thus I compose this work, naming it *The Five Phases’ Mutual Generation*, wherein the nature and essence of the great *Yi* are fully revealed.\n\nThe Five Positions harmonize, each with its proper union:\n*Yi* floats as stone, *ding* patterns with civil fire, *ji* governs matter, *xin* embodies worldly silver, *gui* is true lead—three woods, two fires, five earths, four metals, one water.\n*Jia* sinks as stone, *bing* blazes with martial fire, *wu* refines the medicine, *geng* embodies worldly gold, *ren* is true mercury.\nThis is the *Luoshu*’s primordial numbering.\n\nThe great *Yi*’s nature and essence each adhere to their measure. The teachings of the Yellow Emperor and Laozi, when examined, may be applied. The work of furnace and fire has true foundation: the Three Ways emerge from One, all following the same path. The learning of the Yellow Emperor and Laozi arises from the great *Yi*; the discourse on furnace and fire is grounded in the Yellow Emperor and Laozi. These three all derive from the *Yi*, each addressing nature and essence alone.\n\nBranches, stems, blossoms, leaves—fruit hangs in abundance. Yet the root remains primary, unchanging in its original state. What is spoken in sincerity is precise and without error. It is like the tree that in spring sends forth stems and branches, by summer opens blossoms and spreads leaves, and by autumn bears fruit—yet the source of its growth lies in the root. Thus it is said: the root remains primary, unchanging in its original state. This means it does not lose its inherent nature.\n\nFrom the flourishing of *Tai* to the purity of *Qian*, the root lies in the *Fu* hexagram, founded at the winter solstice. The wondrous work of return and reversal arises from the single yang of midnight. What the sages and perfected ones kept secret—scholars know only the function of the single yang, yet *Lin*, *Tai*, *Zhuang*, and *Guai* transform naturally, without need of human effort. Thus I single out the image of the midwinter season to reveal it.\n\nThis passage connects to what follows, likening the root to the winter solstice. Thus it says: “Like the midwinter season, bamboo and trees are all broken and harmed.” For the stems and branches of spring become the blossoms and leaves of summer, and the blossoms and leaves of summer become the fruit of autumn—all arising from the midwinter’s breaking and harming. The primordial flourishing lies hidden in the root, receiving its generation at the first return of the single yang.\n\nLike the midwinter season, bamboo and trees are all broken and harmed.\nAssisting yang, merchants and travelers halt; the lord deeply conceals himself.\nFollowing the season’s rhythm, mouths close and words cease.\nThe Dao of Heaven is vast and boundless; the Great Mystery has no form.\nThe empty and still cannot be seen; their boundaries dissolve and vanish.\nPursuing error leads only to ruin; speech returns to self-defeat.\nDistinguish and clarify these Four Images to enlighten later generations of the blind.\n\nHere the winter solstice reveals the mechanism of the single yang. “Assisting yang, merchants and travelers halt; the lord deeply conceals himself” corresponds to the *Fu* hexagram’s “merchants do not travel, the lord does not inspect the regions.” Scholars who fail to grasp the essentials must have this restated—how deep is the author’s concern for later ages! “Distinguish and clarify these Four Images”: lead and mercury both reside in *ren* and *gui*. *Ren* is *li* within *qian*; *gui* is *kan* within *kun*—how profound!\n\nThese two passages focus entirely on the single-yang fire timing.\n\nA rustic from the borderlands, a withered scholar from a secluded valley,\nclinging to simplicity, disdaining glory and honor,\ndwelling in obscurity, heedless of reputation,\nholding fast to tranquility, hoping for peace in his time.\nAt ease in reclusion, he composed this text,\nchanting the great *Yi*, the words of the Three Sages.\nExamining its purport, he found a single thread running through all.\nPlain and clear, it needs no annotation.\nIts purpose is to follow principle and radiate the spirit,\nso that transformation flows freely and the Four Seas know peace.\nSet forth as a calendar, it may be followed for ten thousand generations.\nArranged to guide governance, it may be practiced without burden.\nApplied to nurture nature, it accords with the Yellow Emperor and Laozi’s spontaneity.\nThose who embody virtue deeply return to the root and revert to the origin.\nIt lies near in my heart, not apart from my own body.\nEmbracing the One without release, one may endure forever.\nPaired with ingestion, yin and yang are arrayed.\nRefined cinnabar from Wudu is selected; the Eight Stones are discarded.\nWhen use is precise and success assured, the world treasures it.\nThree paths are laid out, their branches and stems interconnected.\nThough names differ, all emerge from a single gate.\nNot merely piling up lines, this text achieves harmony.\nIt holds true substance; its rough outlines are worth observing.\nIf I were to expound falsely, I would only incur redundancy.\nThus I name it *Cantong Qi*, revealing its subtleties in brief.\nFew words convey great meaning; descendants should heed it.\n\nFollowing the principle of the *Luoshu*, one may cause transformation to flow freely and the Four Seas to know peace. When set forth, it may serve to regulate the calendar and clarify the seasons. When the Five Phases are properly ordered, it may be used to establish the pole and govern the state—this is the emperor’s tool. When applied to nurture nature, it is the return to the root, the embrace of the One for enduring life—this is the scholar’s tool.\n\nAbandoning the times to avoid harm, one takes refuge in the mountains.\nRoaming the vast expanse, one dwells beside ghosts.\nTransforming the body to become immortal, one merges into silence.\nOnce in a hundred generations, one wanders among men,\ndisplaying feathered wings, soaring east, west, south, and north.\nWhen Tang faced adversity, drought and flood divided the land.\nBranches and leaves withered and yellowed, losing their flourishing splendor.\nThe virtuous carry one another’s burdens—secure and stable, they may attain long life.\n\nThis is Wei Boyang’s four-character cipher, as noted earlier.\n\n**Song of the Cauldron and Vessel**\n*Kun* is the cauldron, concealing *kan*;\n*Qian* is the vessel, concealing *li*.\nSeparate, they are *qian* and *kun*; united, they form cauldron and vessel.\nRound three-five, one inch in measure.\n“Round three-five, one inch in measure”: when yin and yang unite, three and five return to one. This is what Peng the Perfected meant by “the coherence of principle and phrasing.” “Round” refers to the union of *qian* and *kun*.\nMouth four-eight.\nThe “mouth” is the Gate of the Mysterious Female. In its entry and exit, transformations manifest the Four Images and Eight Trigrams. The cauldron holds metal and water; the vessel holds wood and fire.\n\nThe *kun*-cauldron holds the Three Male [trigrams],\nThe *qian*-vessel holds the Three Female [trigrams].\nTwo-inch lips—\nYin and yang qi divide at their boundary, the so-called “mutual channel.”\nTwelve inches in length, evenly thick and thin.\nThe cauldron embodies six yang [lines], the vessel six yin [lines],\nCorresponding to the twelve earthly branches, where yin and yang are balanced.\nThe above discusses the union of cauldron and vessel, where medicinal substances are complete.\n\nThe belly aligns at three—\nHeaven has its belly-alignment, the celestial center (as seen in the *Astronomical Treatise* of the *Jin [Dynasty History]*).\nEarth and humanity likewise possess a center, the gate of the Three Powers’ conception.\nIn heaven and earth, it is the root of heaven and earth;\nIn humanity, it is the moisture of the Mysterious Female.\n\nSit and let warmth descend—\nYin above, yang rushing below.\nThis is the method of advancing fire, enabling water and fire to achieve harmony.\n\nThe cauldron emerges from *kun*, as yin;\nThe vessel emerges from *qian*, as yang—\nThe so-called “one upper and lower crucible.”\nThis discusses the method of refining and tempering.\n\nHead and tail in strength, the middle in civility—\nThe rhythm of advancing fire.\nThis discusses the fire-times of the celestial circuit.\n\nBeginning with seventy, ending at three decades.\nTwo hundred and six, well-tempered and balanced.\nYin’s fire is white; the yellow sprout is lead.\nThe fire of yin essence is inherently white; upon encountering lead, the sprout becomes yellow.\n\nTwo sevens’ apertures, assisting and aiding humanity—\nThe White Tiger’s seven-numbered cauldron,\nThe Azure Dragon’s seven-starred vessel,\nEach possessing seven apertures.\nWhen the two sevens unite, they assist and aid in forming the sacred embryo.\n\nGaze upon the brain’s principles, stabilize the ascent of the mysterious—\nOnce the embryo is formed, it ascends into the upper palace for nurturance.\nThis discusses the manifestation of the sacred embryo.\n\nThe child resides at the center, secure and preserved.\nComing and going in roaming, yet never leaving the gate.\nAbundant and fully grown, emotions and principles pure.\nReturning to the One, reverting to the original source.\nUpon completing one cycle, the toil is great.\nGuard it closely, never grow confused or dull.\nThe path is distant, again profound and obscure.\nShould one attain this, they will comprehend *qian* and *kun*.\nWith the *daogui* applied, the hun and po are purified.\nThose who delight in the Dao seek its root.\nExamine the Five Phases, determine the precise weights.\nContemplate deeply—no need for further discourse.\nGuard it in seclusion, do not transmit the text.\nThis discusses the preservation of the sacred embryo.\n\nAscend on a white crane, ride the dragon’s scales.\nRoam the Great Void, pay homage to the Immortal Lords.\nReceive the celestial chart, be titled Perfected One.\nThis discusses the embryo’s liberation and spiritual transformation.\n\nIn praise:\n\nQian serves as the abode of Li, Kun as the enclosure of Kan.\nTrue yin resides in Li, true yang dwells in Kan.\nLi receives the wife of *ji*, Kan receives the husband of *wu*.\nSun and moon form a jade bi-disc, with *wu* and *ji* as the pivot.\nThe guest floats, the host sinks—control the existent through the nonexistent.\nMedicine and matter: the two eights of the *Hetu*.\nThe Five Thieves govern the fire, the *Huangji* follows the *Luoshu*.\nModeling the images of Fu Xi’s *Yi*, align the hexagrams and select the tally.\nMaster Wei, true teacher, awakened my dull ignorance.\nWith a hundred bows and prostrations, you stand as the eternal exemplar.\nThrough thirty generations above and below, the fire-times are transmitted only by mouth.\nThose who faithfully receive and practice this shall forever be immortals of Yaochi.\n\n*This concludes the third scroll of the* Zhouyi Cantong Qi. *The character* 「炁」 *here is written as* 「气」 *in the* Kaoyi *edition.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "周易参同契 经名：周易参同契。 原题储华谷注。 作者生活年代不详。 三卷。 底本出处：《正统道藏》太玄部。 参校版本：文渊阁四库全书本子部道家类所载朱熹《周易参同契考异》（简称《考异》本）。 周易参同契卷上#1 储华谷注 乾、坤者，《易》之门户，众卦之父母。 坎离匡郭，运毂正轴。 《易》者，乾、坤之合体，往来阖辟，故曰门户； 交错而生六十四卦，故曰父母； 坎藏於坤，离藏於乾，故曰匡郭。 坎离宅乾坤之中－，中爻之运犹轴之运毂也。 牝牡四卦，以为崇钥。 覆冒阴阳之道，犹工御者，执衔辔，准绳墨，随轨辙，处中以制外。 以乾、坤、坎、离为牝牡造化，万有中爻为乾、坤妙用，故曰：处中以制外。 已上言药物。 数在律历纪，月节有五六，经纬奉曰使。 兼并为六十，刚柔有表裹。 朔旦《屯》直事，至莫《蒙》当受。 昼夜各一卦，用之如次序。 《既》、《未》至晦爽，终则复更始。 月节五六三十曰，两卦直一曰，以配六十卦。 两卦十二爻，六爻属阳，六爻属阴。 按十二时合律之十二声，历之十二月，纪之十二年。 始《屯》、《蒙》而终《既》、《未》，周而复始。 此章以一月论火候。 曰辰为期度，动静有早晚。 春夏据内体，从子到辰巳。 秋冬当外用，自午讫戌亥。 赏罚应春秋，昏明顺寒暑。 爻辞有仁义，随时发喜怒。 如是应四时，五行得其序。 十二时以应十二月气候，从子至辰巳，自午讫戌亥，定二至阴阳也。 赏罚应春秋，爻辞有仁义，定二分刑德也。 此章以一曰论火候。 天地设位，而《易》行乎其中矣。 天地者，乾坤也。 设位者，列阴阳配合之位也。 《易》谓坎离。 坎离者，乾坤二用。 二用无爻位，周流行六虚。 往来既不定，上下亦无常。 幽港沦匿，升降於中。 包囊万物，为道纪纲。 曰月为易，故曰《易》谓坎离。 坎离中爻，乃乾坤之妙用，进退升降於六爻，故中爻变化，为道纪纲。 坎离独得乾坤之中气，人受天地之中以生也。 此章以中爻论坎离之体。 以无制有，器用者空。 故推消息，坎离没亡。 器以空为用，故离虚能受坎实。 离虚为无，坎实为有，离中之阴爻化为坎之中画，变成纯乾，失其坎离之体，故曰坎离没亡。 此皆中爻妙用，以明《易》行乎其中之义。 此章以交娠论坎、离之用。 言不苟造，论不虚生。 引验见效，校度#2神明。 推类结字、原理为征。 坎戊月精，离己曰光。 曰月为易，刚柔相当。 土旺四季，罗络始终。 青赤白黑，各居一方。 皆禀中宫，戊己之功。 坎离所以能交曰月，所以能合者，以坎中有戊，离中有己也。 戊己者，中也。 亦明升降於中，处中制外，《易》行其中之义。 此章兼言药物之体。 《易》者，象也。 悬象着明莫大乎曰月穷神以知化，阳往则阴来。 辐辏而轮转，出入更卷舒。 时至#3朔旦，震来受符。 当斯之时，天地娠#4其精，曰月相撢持。 雄阳播玄施，雌阴化黄包。 混沌相交接，权舆树根基。 经营养鄞鄂，凝神以成躯。 众夫蹈以出，蚊动莫不由。 观曰月合璧之象，而得坎、离交娠之道。 观震来受符之卦，而见一阳来复之机。 坎男为雄阳，中藏乾画，施其天玄之气於离。 离女为雌阴，化其中爻，坤黄之体而成乾。 此章论进火交垢。",
      "translated_text": "**The *Zhouyi Cantong Qi* (The Seal of the Unity of the Three, in Accordance with the *Book of Changes*)**\n\n**Title:** *Zhouyi Cantong Qi*\n**Commentary attributed to:** Chu Huagu\n**Author’s era:** Unknown\n**Three fascicles.**\n**Base text source:** *Daoist Canon of the Orthodox Tradition* (*Zhengtong Daozang*), *Tai Xuan* Section.\n**Collated with:** The *Wenyuan Ge Siku Quanshu* edition, under the Daoist works in the *Zibu* category, containing Zhu Xi’s *Zhouyi Cantong Qi Kaoyi* (hereafter *Kaoyi* edition).\n\n---\n\n### *Zhouyi Cantong Qi*, Fascicle One\n**Commentary by Chu Huagu**\n\n**Qian and Kun** are the gates and doors of the *Changes*, the father and mother of all hexagrams.\n**Kan and Li** form their frame and axle, turning the wheel upon its true axis.\n\nThe *Changes* is the union of Qian and Kun, their ebb and flow, opening and closing—hence the term \"gates and doors.\"\nThrough their interweaving, the sixty-four hexagrams arise—hence the term \"father and mother.\"\nKan is concealed within Kun, Li within Qian—hence the term \"frame.\"\nKan and Li dwell at the center of Qian and Kun; the movement of their central lines is like an axle turning the wheel.\n\nThe four hexagrams of the female and male serve as the bolt and key.\nThey cover and enshroud the Dao of yin and yang, just as a charioteer holds the reins and bit, follows the plumb line and inked cord, traces the wheel tracks, and governs the exterior from the center.\nQian, Kun, Kan, and Li are the female and male of creation; the central lines of the myriad beings manifest the subtle workings of Qian and Kun—hence the phrase: \"governing the exterior from the center.\"\nThe above discusses the medicinal substances.\n\nNumbers are recorded in the pitch-pipes and calendars; the lunar phases consist of five and six.\nThe warp and weft obey the sun’s command.\nCombined, they make sixty; hardness and softness have their outer and inner.\nAt dawn on the new moon, *Zhun* (Hexagram 3) presides over affairs; by dusk, *Meng* (Hexagram 4) receives its turn.\nDay and night each govern one hexagram, employed in due sequence.\nFrom *Ji Ji* (Hexagram 63) to *Wei Ji* (Hexagram 64), until the end of the month’s twilight, the cycle concludes and begins anew.\nThe lunar phases consist of five and six, totaling thirty days; two hexagrams govern each day, corresponding to the sixty hexagrams.\nTwo hexagrams comprise twelve lines: six yang lines and six yin lines.\nAligning the twelve hours with the twelve pitches of the pitch-pipes, the twelve months of the calendar, and the twelve years of the cycle.\nBeginning with *Zhun* and *Meng* and ending with *Ji Ji* and *Wei Ji*, the sequence revolves without end.\nThis chapter discusses the firing times in terms of a single month.\n\nThe celestial stems serve as the measure; movement and stillness have their early and late.\nSpring and summer rely on the inner body, from *Zi* (midnight) to *Chen* and *Si* (morning).\nAutumn and winter employ the outer function, from *Wu* (noon) to *Xu* and *Hai* (evening).\nRewards and punishments correspond to spring and autumn; darkness and light follow cold and heat.\nThe line statements embody benevolence and righteousness, expressing joy and anger in accord with the seasons.\nThus aligned with the four seasons, the Five Phases attain their proper order.\nThe twelve hours correspond to the twelve monthly qi; from *Zi* to *Chen* and *Si*, and from *Wu* to *Xu* and *Hai*, the solstices of yin and yang are determined.\nRewards and punishments correspond to spring and autumn; the line statements embody benevolence and righteousness, establishing the equinoxes of punishment and virtue.\nThis chapter discusses the firing times in terms of a single day.\n\nHeaven and Earth establish their positions, and the *Changes* operates within them.\nHeaven and Earth are Qian and Kun.\n\"Establish their positions\" refers to arranging the positions of yin and yang in harmony.\nThe *Changes* refers to Kan and Li.\nKan and Li are the two functions of Qian and Kun.\nThe two functions have no fixed line positions; they circulate through the six voids.\nTheir comings and goings are unfixed; their ascent and descent lack constancy.\nObscure and hidden, they sink and rise within.\nThey envelop the myriad things, serving as the guiding principles of the Dao.\nThe sun and moon constitute the *Changes*—hence the phrase, \"the *Changes* refers to Kan and Li.\"\nThe central lines of Kan and Li are the subtle workings of Qian and Kun, advancing and retreating, ascending and descending among the six lines.\nThus, the transformations of the central lines serve as the guiding principles of the Dao.\nKan and Li alone receive the central qi of Qian and Kun; humans are born receiving the center of Heaven and Earth.\nThis chapter discusses the essence of Kan and Li in terms of their central lines.\n\nThe formless governs the formed; the utility of vessels lies in their emptiness.\nThus, in tracing waxing and waning, Kan and Li vanish.\nVessels are useful because of their emptiness; thus, the void of Li can receive the fullness of Kan.\nThe void of Li is the formless; the fullness of Kan is the formed.\nThe yin line at the center of Li transforms into the central stroke of Kan, becoming pure Qian and losing the forms of Kan and Li—hence the phrase, \"Kan and Li vanish.\"\nThis all demonstrates the subtle workings of the central lines, clarifying the meaning of \"the *Changes* operates within them.\"\nThis chapter discusses the functions of Kan and Li in terms of their intercourse.\n\nWords are not idly crafted; theories do not arise in vain.\nThey draw upon evidence and manifest effects, verifying the numinous through measurement.\nExtending categories and structuring characters, the principles are proven.\nKan is the essence of the moon, *wu* (earth); Li is the light of the sun, *ji* (earth).\nThe sun and moon constitute the *Changes*, hardness and softness in balance.\nEarth flourishes in the four seasons, weaving the beginning and end.\nGreen, red, white, and black each reside in their respective directions.\nAll receive their mandate from the central palace, the work of *wu* and *ji*.\nKan and Li can thus unite the sun and moon; their harmony arises because Kan contains *wu* and Li contains *ji*.\n*Wu* and *ji* are the center.\nThis also clarifies the ascent and descent within the center, governing the exterior from the center, and the meaning of \"the *Changes* operates within them.\"\nThis chapter further discusses the essence of the medicinal substances.\n\nThe *Changes* is imagery.\nNo image is more luminous than the sun and moon.\nExhausting the numinous to know transformation: when yang departs, yin arrives.\nLike spokes converging at the hub, the wheel turns; going out and coming in, they roll and unfold.\nWhen the time arrives at dawn on the new moon, *Zhen* (Hexagram 51) comes to receive the tally.\nAt this moment, Heaven and Earth conceive their essence; the sun and moon mutually embrace.\nThe male yang scatters its dark essence; the female yin transforms the yellow womb.\nChaos intermingles and joins; the root and foundation are planted.\nThey nurture and cultivate the budding sprout, concentrating spirit to form the body.\nAll things tread forth from this; none among the teeming creatures do not arise from it.\nObserving the image of the sun and moon conjoined as one, one grasps the Dao of Kan and Li’s intercourse.\nObserving the hexagram *Zhen* coming to receive the tally, one perceives the mechanism of the solitary yang’s return.\nKan, the male, is the male yang, concealing the lines of Qian within; it bestows its celestial dark qi upon Li.\nLi, the female, is the female yin, transforming its central line into the yellow body of Kun to become Qian.\nThis chapter discusses the firing process and the union of impurities.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1281,
      "start_sentence": 0,
      "end_sentence": 82,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.1800651550293,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "於是，仲尼赞洪蒙，乾坤德洞虚。 稽古称元皇，《关睢》建始初。 冠婚气相纽，元年乃芽滋#5。 曰月合璧，天地娠精也。 人与万物，皆天地娠精而生。 仲尼於《易》，发明男女娠精、万物化生之道，於《诗》则序正夫妇人伦之首，以明阴阳相求之义。 此章言药物。 圣人不虚生，上观显天符。 天符有进退，屈信#6以应时。 观天之道，执天之行，明《易》卦火侯上合天符之进退也。 下章详论之。 故《易》统天心，《复》卦建始萌。 长子继父体，因母立兆基。 消息应钟律#7升降据斗枢。 三曰出於爽#8，震受庚西方。 八曰兑受丁，上弦平如绳。 ．十五乾体就，盛满甲束方。 蟾赊与兔魄，曰月气#9双明。 蟾蛛眼卦节，兔者吐生光。 《复》见天地之心，是为冬至，侯莫秘於一阳也。 自一阳而后六阴六阳，一消一息，应十二钟律； 讪伸升降，应斗枢转旋。 坤初变震，故曰因母。 此说出伏羲先天卦。 此章论阳火之候。 七八道已讫，屈折低下降。 十六转受统，巽辛见平明。 艮直於丙南，下弦二十三。 坤乙三十曰，束北丧其朋#10。 节尽相禅与，继体复生龙。 此章论阴符之候。 壬癸配甲乙，乾坤括始终。 七八数十五，九六亦相应。 四者合三十，阳气索灭藏。 八卦列布曜，运移不失中。 壬、甲配乾，乙、癸配坤。 七、八、九、六，乃洛书五行之成数，皆得十．五，应十五曰三爻属乾，十五曰三爻属坤，合怯十曰。 曰月一会，终而复始。 八卦列布曜，运移不失中者，谓八方布二十八宿，斗运中天，火符阴阳之分不可违也。 中谓二至也。 此章论纳甲火侯。 玄精眇难观，推度幼#11符证。 居则观其象，准拟其形容。 立表以为范，占候定吉凶。 发号顺时令，勿失爻动时。 上察河图文，下序地形流。 中稽於人情，参同考三才。 动则循卦节，静则因《象》辞。 乾坤用施行，天下然后治。 可不慎乎？ ·",
      "translated_text": "Thus, when Confucius extolled the primordial vastness, the virtue of Qian and Kun pervaded the void. He traced antiquity to the Primordial Sovereign, and in the *Guan Ju* established the beginning. The qi of cap and marriage intertwined, and in the first year the sprout burgeoned.\n\nSun and moon conjoin as jade disks—this is the celestial and terrestrial intermingling of essence. Humans and the myriad things all arise from the celestial and terrestrial intermingling of essence. In the *Book of Changes*, Confucius elucidated the Dao of male and female essence-conception and the transformation of the myriad things; in the *Book of Songs*, he ordered the primacy of human relations, beginning with husband and wife, to clarify the principle of yin and yang seeking one another. This chapter speaks of the medicinal substances.\n\nThe sage is not born in vain; he observes above to discern the celestial tally. The celestial tally has advance and retreat, bending and extending to accord with the seasons. Observing the Dao of Heaven and grasping the movements of Heaven, he clarifies how the firing times of the *Yi* hexagrams align with the celestial tally’s advance and retreat. The next chapter will discuss this in detail.\n\nThus, the *Book of Changes* embodies the mind of Heaven, and the hexagram *Fu* establishes the first sprouting. The eldest son inherits the father’s body, and through the mother founds the omen and foundation. The waxing and waning respond to the pitch-pipes’ ascent and descent, anchored in the pivot of the Dipper. On the third day, it emerges from clarity, *Zhen* receiving *geng* in the west. On the eighth day, *Dui* receives *ding*, the first quarter level as a taut cord. On the fifteenth, the Qian body is complete, fullness reaching *jia* in the east. The toad recedes and the hare’s spirit, sun and moon’s qi doubly bright. The toad’s eye marks the hexagram’s node; the hare spews forth its radiance. *Fu* reveals the mind of Heaven—this is the winter solstice, where nothing is more secret than the solitary yang. From this solitary yang follow six yins and six yangs, waxing and waning in alternation, responding to the twelve pitch-pipes; stretching and contracting, ascending and descending, they accord with the Dipper’s pivot and rotation. Kun’s initial line transforms into *Zhen*, thus it is said to rely on the mother. This explanation derives from Fuxi’s primordial hexagrams. This chapter discusses the timing of the yang fire.\n\nWhen the seventh and eighth lines are exhausted, they bend and descend low. On the sixteenth, the mandate shifts, *Xun* and *xin* appear in level brightness. *Gen* stands straight in the south at *bing*; the last quarter is the twenty-third. On the thirtieth day, *Kun* and *yi* in the northeast lose their companions. When the nodal limit is reached, they mutually succeed one another, and the succeeding body once more generates the dragon. This chapter discusses the timing of the yin tally.\n\n*Ren* and *gui* pair with *jia* and *yi*, Qian and Kun encompassing beginning and end. Seven and eight sum to fifteen; nine and six likewise correspond. These four combine to make thirty, and the yang qi seeks extinction and concealment. The eight trigrams array the luminaries, their movements never straying from the center. *Ren* and *jia* pair with Qian; *yi* and *gui* pair with Kun. Seven, eight, nine, and six are the completion numbers of the Five Phases in the *Luoshu*, each yielding fifteen, corresponding to the fifteen days when three yang lines belong to Qian and the fifteen days when three yin lines belong to Kun, together forming thirty days. The sun and moon meet once, ending and then beginning anew. \"The eight trigrams array the luminaries, their movements never straying from the center\" means the eight directions array the twenty-eight lodges, the Dipper revolves at the center of Heaven, and the division of the fire tally’s yin and yang must not be violated. The \"center\" refers to the two solstices. This chapter discusses the *na jia* firing times.\n\nThe subtle essence of the Dao is too minute to observe; one infers and measures it by tallying evidence. Abiding, one observes its images, approximating its forms. Setting up gnomons as standards, one determines auspice or inauspice by divining the omens. Issuing commands in accord with the seasons, one must not miss the moment when the lines move. Above, one examines the patterns of the *Hetu*; below, one orders the flows of earthly forms. In the middle, one investigates human sentiments, unifying and considering the Three Powers. In movement, one follows the hexagram’s nodes; in stillness, one relies on the *Xiang*’s words. Qian and Kun put their use into practice, and only then is the world governed. How could one not be cautious?",
      "overlap_context": "mage of the sun and moon conjoined as one, one grasps the Dao of Kan and Li’s intercourse.\nObserving the hexagram *Zhen* coming to receive the tally, one perceives the mechanism of the solitary yang’s return.\nKan, the male, is the male yang, concealing the lines of Qian within; it bestows its celestial dark qi upon Li.\nLi, the female, is the female yin, transforming its central line into the yellow body of Kun to become Qian.\nThis chapter discusses the firing process and the union of impurities.",
      "start_char": 1282,
      "end_char": 2031,
      "start_sentence": 83,
      "end_sentence": 133,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.14909315109253,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天道深远而难窥，因《易》象以见之。 立表占侯，正欲勿失爻#12动时而已。 言一阳之候，不可失动其机，食其时，斯可以交娠坎离，而成纯乾之体。 夫斗极运化，进退屈伸，此天道示象之昭昭者也。 潮候应月，相与亏盈，此#13地道流形之显着者也。 是曰闭关，商旅不行，人情之顺时合天者也。 动静一循《易》道，皆以发明不失爻动之时之妙。 此章总论阴符阳火， 下章独明一阳之侯。 御政之首，管括微密#14，阅舒布宝。 要道魁柄，统化纲纽。 御政之首，乃子阳初动，交娠坎离之时。 管括微密，乃闭关不行，后不省方，塞兑闭门，不伤稚阳之长。 自然子阳进而成泰，随斗柄以定晨昏，故曰统化纲纽，谓斗也。 此章论一阳。 下章论进火法度。 爻象内动，吉凶外起。 五纬错顺，应时感动。 四七乖戾，侈离俯仰。 文昌总录，请责台辅。 百官有司，各典所部。 火侯爻象运於内，神化景象形於外，先时不及时，则五纬错行，乖戾#15二十八宿之次。 此章言失火侯之正如此。 曰合五行精，月受六律纪。 五六三十度，度竟复更始。 原始要终，存亡之绪。 一曰之问，震、巽迭运，终而复始。 ， 此章言循火候之正如此。 或君骄佚，一几满违道。 或臣邪佞，行不顺轨。",
      "translated_text": "The Dao of Heaven is profound and distant, difficult to glimpse; one perceives it through the images of the *Yi*. Erecting gnomons to divine the omens is simply to avoid missing the moment when the lines move. Speaking of the single yang’s timing, one must not lose the moment of its activation, consuming its season—only then can Kan and Li unite in gestation, forming the pure body of Qian. The Northern Dipper’s pivot governs transformation, advancing and retreating, extending and contracting—this is the luminous manifestation of Heaven’s Dao in images. The tides respond to the moon, waxing and waning in concert—this is the evident display of Earth’s Dao in flowing forms. This is called \"closing the passes,\" when merchants and travelers cease their journeys, and human sentiments align with the seasons and accord with Heaven. In movement and stillness alike, one follows the Dao of the *Yi*, all to illuminate the subtlety of not missing the moment when the lines move.\n\nThis chapter broadly discusses the *yin fu* and *yang huo*; the next chapter focuses solely on the timing of the single yang. The inception of governance lies in the initial stirring of yang at *zi*, the moment when Kan and Li unite in gestation. \"Controlling the subtle and minute\" means closing the passes and halting travel, the sovereign ceasing to inspect the realm, sealing the gates and shutting the doors, so as not to harm the growth of tender yang. Naturally, the yang of *zi* advances to form *Tai*, following the Dipper’s handle to determine dawn and dusk—thus it is called \"the guiding cord of transformation,\" referring to the Dipper.\n\nThis chapter discusses the single yang; the next chapter will address the method of advancing the fire.\n\nWhen the lines stir within, fortune or misfortune arises without. The five planets move in harmony or discord, responding to the seasons and stirring in resonance. When the four and seven fall into disorder, they deviate in elevation and depression. The *Wenchang* oversees the records, while the *Taifu* are held accountable. The hundred officials and their bureaus each govern their respective domains. The fire’s timing and the lines’ movements operate within, while numinous transformations and celestial images manifest without. If one acts too early or too late, the five planets move erratically, disrupting the order of the twenty-eight lodges.\n\nThis chapter describes the consequences of losing the proper fire timing in this way.\n\nIt is said: \"Harmonize the essence of the Five Phases; the moon receives the regulation of the six pitches. Five times six make thirty degrees, and when the degrees are complete, they begin anew.\" From beginning to end, one traces the threads of survival and demise. Within a single day, *Zhen* and *Xun* alternate in succession, cycling endlessly.\n\nThis chapter describes the proper adherence to the fire timing in this way.\n\nIf the ruler is arrogant and indulgent, a single moment of fullness may violate the Dao. If a minister is deceitful and sycophantic, his conduct will not follow the proper path.",
      "overlap_context": "g the omens. Issuing commands in accord with the seasons, one must not miss the moment when the lines move. Above, one examines the patterns of the *Hetu*; below, one orders the flows of earthly forms. In the middle, one investigates human sentiments, unifying and considering the Three Powers. In movement, one follows the hexagram’s nodes; in stillness, one relies on the *Xiang*’s words. Qian and Kun put their use into practice, and only then is the world governed. How could one not be cautious?",
      "start_char": 2031,
      "end_char": 2545,
      "start_sentence": 134,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.72913122177124,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "弦望盈缩，乖变凶咎。 执法刺讥，诂过贻主#16。 刚柔失其道，动静失其时。 此章言交娠不合法度则如此。 辰极受正，优游任下。 明堂布政，国无害道。 内以养己，安静虚无。 元本引明#17，内照形躯。 闭塞其兑，筑固灵株。 三光陆沉，温养子珠。 视之不见，近而易求。 黄中渐通理，润泽达肌肤。 初正则终修，干立末可持。 不失其时，无为而治，自然三光陆沉，有诸内则形诸．外，故润泽达肌肤也。 自五纬错顺而下，皆明爻象内动，吉凶外起。 此章言交诟合法度则如此。 一者以掩蔽，世人莫知之。 上德无为，不以察求。 下德为之，其用不休。 上闭则称有，下闭则称无。 无者以奉上，上有神德居。 此两孔穴法，金黑亦相须。 知白守黑，神明自来。 白者金精，黑者水基。 水者道枢，其数名一#18。 阴阳之始，玄含黄芽。 五金之主，北方河车。 故铅#19外黑，内怀金华。 被褐怀玉，外为狂夫。 金为水母，母隐子胎。 水者金子，子藏母胞。 真人至妙，若有若无。 彷佛#20大渊，乍沉乍浮。 退而分布，各守境隅。",
      "translated_text": "The waxing and waning of the crescent and full moon bring misfortune through discordant changes. Those who enforce the law with criticism and reproach bring blame upon their lord by exposing faults. When hardness and softness lose their proper Way, and movement and stillness miss their proper timing—this chapter describes how improper union in gestation leads to such consequences.\n\nWhen the pole star receives its correct alignment, it moves with ease and entrusts matters to those below. The Hall of Light enacts governance, and the state suffers no harmful ways. Within, one nurtures the self through tranquil emptiness and non-being. The primordial root draws forth clarity, illuminating the inner form and body. Seal the opening of *dui*, and fortify the numinous root. The Three Luminaries sink into obscurity, warming and nourishing the child-pearl. Though unseen to the eye, it is near and easily sought. The yellow center gradually permeates the principles, and moisture reaches the skin. Begin with rectitude, and end with cultivation; when the trunk stands firm, the branches may be grasped. By not losing the proper timing, one governs through non-action, and naturally the Three Luminaries sink into obscurity. What is within manifests without, thus moisture reaches the skin.\n\nFrom the erratic and orderly movements of the five planets onward, all illustrate how the inner stirring of hexagram images gives rise to fortune and misfortune externally. This chapter describes how proper union in gestation leads to such outcomes.\n\nThe first is concealment—none in the world know of it. The highest virtue acts through non-action, not seeking through scrutiny. The lesser virtue acts, and its function never ceases. When the upper is sealed, it is called \"having\"; when the lower is sealed, it is called \"not having.\" The \"not having\" serves the \"having,\" where the divine virtue resides above. These two apertures follow a method: metal and water also depend on each other. Know the white, guard the black, and the numinous clarity will come of itself. The white is the essence of metal; the black is the foundation of water. Water is the pivot of the Dao, and its number is called \"one.\" It is the beginning of yin and yang, containing the yellow sprout within the mysterious. It is the master of the five metals, the river chariot of the north. Thus lead is black without but holds golden radiance within. Cloaked in coarse cloth yet bearing jade, outwardly a madman. Metal is the mother of water; the mother conceals the child’s embryo. Water is the child of metal; the child shelters within the mother’s womb. The perfected person is most subtle—seeming to exist, yet not; now sinking, now floating, like a great abyss. Withdrawing, they disperse and guard their respective domains.",
      "overlap_context": "es. Five times six make thirty degrees, and when the degrees are complete, they begin anew.\" From beginning to end, one traces the threads of survival and demise. Within a single day, *Zhen* and *Xun* alternate in succession, cycling endlessly.\n\nThis chapter describes the proper adherence to the fire timing in this way.\n\nIf the ruler is arrogant and indulgent, a single moment of fullness may violate the Dao. If a minister is deceitful and sycophantic, his conduct will not follow the proper path.",
      "start_char": 2545,
      "end_char": 2971,
      "start_sentence": 165,
      "end_sentence": 198,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.49581003189087,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "水数一而藏阳金，乃黑铅中之白银，世罕知之一即上德之坎也。 坎为上德，为有； 离为下德，为无。 离以翕受为用，绵绵若存，故其用不休，所以奉上也。 离汞须阳金而变化，金亦须离火而施精，故曰相须。 知水中有金，守其水则金自至，母隐子胎故也。 水数一而色黑，故曰守黑，明一者掩蔽之义。 此章言探药法度。 望之类白，造之则朱。 炼为表卫，白裹贞居。 方圆径寸，混而相拘。 先天地生，巍巍尊高。 旁有垣阙，状似蓬壶。 环匝#21关闭、四通踟局。 守御密固，关绝奸邪。 曲阁相通，以戒不虞。 可以无思，难以愁劳。 神黑满室，莫之能留。 守之者昌，失之者亡。 动静休息，常与人俱。 此章言圣胎成象，贵在护养。 是非历藏法，内视有所思。 履行步斗宿，六甲以曰辰。 阴道厌九一，浊乱弄玄胞。 食黑呜肠胃，吐正吸外邪#22。 昼夜不卧寐，肠呜#23未尝休。 身体以疲倦，恍惚状若痴。 百脉鼎沸驰，不得清澄居。 周回立坛宇，朝暮#24敬祭祠。 鬼物见形象，梦寐感慨之。 心欢而意悦#25，自谓必延期。 遽以夭命#26死，腐露其形骸。 举措辄有违，悖逆失枢机。 诸卫甚众多，千条有万余。 前却违黄老，曲折戾九都。 凡辞旨易晓，并不注，后准此。 明者省厥旨，旷然知所由。 勤而行之，夙夜不休。 服食三载，轻举远游。 入火不焦，入水不濡。 能存能亡，长乐无忧。 道成德就，潜伏埃时。 太乙乃召，移居中洲q功满上升，膺录受图。 此章言#27成道之事。 《火记》不虚作，演《易》以明之。 偃月法鼎炉，白虎为熬枢。 汞曰为流珠，青龙与之俱。 举东以合西，魂魄自相拘。 上弦兑数八、下弦亦如之。 两弦合其精，乾坤体乃成。 二八应一斤，《易》道正不倾。 金水同居，故坎月与白虎为熬#28枢； 木火同位，故流珠则青龙与俱。 举东合西者，以离受坎，复归纯乾之体。 ．自朔八曰而上弦，自望八曰而下弦，故曰二八应一斤，药之候也。 此章以四象论药物。 金入於猛火，色不夺精光。 自开辟以来，曰月不亏明，金不失其重，曰月形如常。 金本从月生，朔旦受曰符。 金反归其母，月晦曰相包。 隐藏其匡郭，沉沦於洞虚·。 金复其故性，威光鼎乃熹#29。 坎中金为真阳之药，入离火炼之，亘古不坏。 谕月之金精，受太阳符火，光明如常也。 上章总论四象。 此章独言金为真药。 子午数合三，戊己号称五。 三五既和谐，八石正纲纪。 呼吸相含育#30，伫恩#31涌为夫妇。 黄土金之父，流珠水之母。 水以土为鬼，土镇#32水不起。 朱雀为火精，执平调胜负。 水盛火消灭，俱死归厚土。 三性既会合#33，本性共宗祖。 子水一，午火二，戊己五，合为八石。 坎离、夫妇，有呼吸含育之象。 金、水、火三性归土，乃．合而为一。 本性共宗祖者，同出於一，复归於一也。 此章言交姤。 巨胜尚延年，还丹可入口。 金性不败朽，故为万物宝。 术士服食之，寿命得长久。 土游於四季，守界定规矩#34。 金砂入五内，雾散若风雨。 黑需#35达四肢，颜色悦泽好。 发白更生黑，齿落出旧所。 老翁复丁壮，老曰妪成诧女。 改形免世厄，号之曰真人。 此章言真阳之药，其劫如此。 胡粉投火中，色坏还为铅。",
      "translated_text": "The number of water is one, concealing the yang within metal—this is the silver within black lead, a truth rarely known, for one is the supreme virtue of Kan. Kan is the supreme virtue, the realm of \"having\"; Li is the lesser virtue, the realm of \"non-being.\" Li employs contraction and receptivity, existing ceaselessly like a continuous thread, thus its function never ceases, for it serves the supreme. Li-mercury requires yang-metal to transform, just as metal requires Li-fire to bestow its essence; hence they are said to be mutually dependent. Knowing that gold resides within water, guard the water and the gold will come of itself, for the mother conceals the child’s embryo. The number of water is one, and its color is black; thus it is called \"guarding the black,\" for the meaning of \"illuminating the one\" lies in concealment. This chapter speaks of the method and measure for seeking the medicine.\n\nBeheld, it resembles whiteness; refined, it becomes vermilion. When tempered, it forms the protective exterior, with purity dwelling within the white. Round or square, a mere inch in diameter, they merge and constrain one another. Born before heaven and earth, majestic and revered. Surrounding it are walls and gates, resembling Penglai’s isles. Encircled and sealed, its four paths are intricately arranged. Guarded with utmost secrecy, its gates bar all wickedness. Curved pavilions connect, ever vigilant against the unforeseen. Here, thought may cease, and sorrow finds no place. The numinous black fills the chamber, none can detain it. Those who guard it prosper; those who lose it perish. In movement and stillness, rest and activity, it ever accompanies the adept. This chapter speaks of the sacred embryo’s formation, emphasizing its nurturance and protection.\n\nThis is not the method of the hidden viscera; inner vision must have its focus. Treading the steps of the Dipper’s lodges, the six Jia follow the days and hours. The yin path suppresses nine with one, its turbid chaos disturbing the mysterious womb. Ingesting the black, the intestines rumble; exhaling the upright, inhaling external evil. Day and night without repose, the bowels never cease their murmuring. The body grows weary, the spirit dazed, as if in stupor. The hundred vessels boil and surge, unable to attain serene clarity. Circling, one erects altars and halls, offering morning and evening sacrifices. Ghostly forms appear, dreams stir with emotion. The heart rejoices, the mind delights, believing longevity assured. Yet suddenly, life is cut short, the body left to rot and decay. Every action runs counter, perverse and contrary to the pivot of the Dao. The methods are myriad, thousands upon tens of thousands. Advancing and retreating, they defy the Yellow and the Old, twisting and turning against the Nine Capitals.\n\nThe meaning of these words is plain and easily understood; no annotations are provided, and this shall serve as the standard hereafter. The wise will grasp their intent, suddenly perceiving the path’s origin. Practice diligently, day and night without rest. After three years of ingestion, one becomes light and roams afar. Entering fire, they are not scorched; entering water, they are not drenched. They can manifest or vanish at will, ever joyful and free from care. When the Dao is perfected and virtue accomplished, they remain concealed in the dust of the world. Then the Great One summons them, relocating them to the Central Isles. When merit is complete, they ascend, receiving the register and the chart. This chapter speaks of the attainment of the Dao.\n\nThe *Fire Record* is not written in vain; it expounds the *Yi* to clarify these truths. The crescent moon method employs the crucible and furnace, with the White Tiger as the pivot of refinement. Mercury is called the flowing pearl, accompanied by the Azure Dragon. Raising the east to meet the west, the hun and po naturally constrain one another. The upper crescent is Dui, numbered eight; the lower crescent is the same. When the essences of both crescents unite, the body of Qian and Kun is formed. Two eights correspond to one catty; the Dao of the *Yi* stands firm and unshaken. Metal and water dwell together, thus Kan’s moon and the White Tiger serve as the pivot of refinement. Wood and fire share the same position, thus the flowing pearl is accompanied by the Azure Dragon. Raising the east to meet the west means Li receiving Kan, returning to the pure body of Qian. From the new moon, eight days bring the upper crescent; from the full moon, eight days bring the lower crescent. Thus it is said that two eights correspond to one catty, the sign for the medicine. This chapter discusses the medicine in terms of the four images.\n\nWhen metal enters fierce fire, its color does not fade nor its luster diminish. Since the beginning of creation, the sun and moon have never lost their brightness, nor has metal forfeited its weight; the sun and moon retain their usual forms. Metal is born from the moon, receiving the sun’s mandate at the new moon. Metal returns to its mother, and at the moon’s wane, they envelop one another. Concealing its frame, it sinks into the profound void. When metal regains its original nature, its majestic radiance illuminates the crucible. The gold within Kan is the medicine of true yang; refined in Li’s fire, it remains indestructible through the ages. This is likened to the moon’s metal essence receiving the fire of the great yang, its brilliance enduring as ever. The preceding chapter broadly discusses the four images; this chapter focuses solely on metal as the true medicine.\n\nThe numbers of zi and wu combine to make three; wu and ji are called five. When three and five harmonize, the eight minerals form the essential framework. Breathing nurtures their union, awaiting the surge that makes them husband and wife. Yellow earth is the father of metal; the flowing pearl is the mother of water. Water’s ghost is earth, which subdues water’s uprising. The Vermilion Bird is the essence of fire, maintaining balance to determine victory or defeat. If water prevails, fire is extinguished, and both perish, returning to the fertile earth. When the three natures unite, their original nature shares a common ancestor. Zi-water is one, wu-fire is two, wu-ji is five, combining to form the eight minerals. Kan and Li, husband and wife, possess the image of breathing and nurturing union. The three natures of metal, water, and fire return",
      "overlap_context": "e master of the five metals, the river chariot of the north. Thus lead is black without but holds golden radiance within. Cloaked in coarse cloth yet bearing jade, outwardly a madman. Metal is the mother of water; the mother conceals the child’s embryo. Water is the child of metal; the child shelters within the mother’s womb. The perfected person is most subtle—seeming to exist, yet not; now sinking, now floating, like a great abyss. Withdrawing, they disperse and guard their respective domains.",
      "start_char": 2972,
      "end_char": 4242,
      "start_sentence": 199,
      "end_sentence": 288,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.966777563095093,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "冰雪得温汤，解释成太玄。 金以砂为主，禀和於水银。 变化由其真，终始自相因。 欲作服食仙，宜以同类者。 植禾当以黍，覆鸡用其子。 以类辅自然，物成易陶冷。 鱼目岂为珠，蓬蒿不成椟。 类同者相从，事乖不成宝。 是以燕雀不生凤，狐兔不乳马，水流不炎上，火动不润下。 世间多学士，高妙负良才。 邂逅不遭值#36，耗火亡货财。 据按依文说，妄以意为之。 端绪无因绿，度量失操持。 梼治搜石胆，云母及矾磁#37。 硫黄烧豫章，泥汞相炼持#38。 鼓下五石铜，以之为辅枢。 襟性#39不同种，安肯合体居？ 千举必万败，欲点反成痴。 秆年至白首，中道生狐疑。 背道守迷路，出正入邪蹊。 管窥不广见，难以揆方来。 人性具，离中真阴非真阳，不能变化。 样类岂能相入金石，皆外物尔。 若夫至圣，不过伏羲，画八卦，幼天图。 文王帝之宗，结体演爻辞。 夫子庶圣雄，《十翼》以辅之。 三君天所挺，迭兴更御时。 优劣有步骤，功德不相殊。 制作有所踵，推度审分铢。 有形易忖量，无兆难虑谋。 作事令可法，为世定诗书。 素无前识资，因师觉悟之。 皓若寨帷帐，瞋目登高台。 《火记》六百篇，所趣等不殊。 文字郑重说，世人不熟思。 寻度其源流，幽明本共居。 窃为#40贤者谈，曷敢轻为书。 结舌欲不语，绝道获罪诛。 写情寄竹帛，恐泄天之符。 犹豫增叹息”倪仰#41缀斯愚。 陶冶有法度，未忍悉陈敷。 略述其纲纪，枝条见扶练。",
      "translated_text": "When ice and snow meet warm broth, they dissolve into the Great Mystery.\nGold takes cinnabar as its master, harmonizing with mercury.\nTransformation arises from their authenticity; beginning and end follow one another.\nTo become an immortal through ingestion, one must use substances of the same kind.\nPlant millet with millet; hatch a chicken with its own egg.\nSupporting nature with its kind, things form as easily as clay is shaped.\nCan fish eyes be pearls? Can fleabane become a casket?\nLike follows like; discordant matters cannot yield treasure.\nThus, swallows and sparrows do not birth phoenixes; foxes and hares do not nurse horses.\nWater does not flow upward in flames; fire does not moisten downward in motion.\n\nThe world abounds with scholars, lofty and gifted with fine talent.\nYet, by chance, they fail to meet their destined path, wasting fire and squandering wealth.\nClinging to texts and following words, they recklessly impose their own interpretations.\nThreads unravel without cause; measures and standards lose their grasp.\nThey smelt chalcanthite, mica, and alum-magnetite,\nburn sulfur with camphorwood, and refine mercury with mud.\nThey smelt the five-stone bronze beneath the bellows, taking it as their pivot.\nYet, with natures of different kinds, how could they willingly unite in one body?\nA thousand attempts lead to ten thousand failures; what they seek to transmute turns to folly.\nFrom youth to white-haired age, doubt arises midway.\nTurning from the Dao, they cling to delusion; stepping from the right path, they enter crooked trails.\nPeering through a tube, their vision is narrow—how can they gauge what lies ahead?\n\nHuman nature possesses it: within separation, true yin is not true yang, and cannot transform.\nHow could disparate kinds merge with metal and stone? These are all external things.\nAs for the utmost sages, none surpass Fu Xi, who drew the Eight Trigrams and the Map of the Young Heavens.\nKing Wen, ancestor of emperors, structured the body and expounded the line texts.\nConfucius, the near-sage hero, composed the *Ten Wings* to aid them.\nThese three lords were raised by Heaven, rising in succession to govern their times.\nThough their excellence followed steps, their merits and virtues did not differ.\nTheir creations built upon one another, weighing and measuring with care.\nThe tangible is easy to estimate; the formless is hard to plan.\nTheir deeds set models for emulation, establishing classics for the world.\nWithout innate foresight, they awakened through their teachers.\nBright as one who parts the curtains and ascends the high terrace,\nthe *Fire Records* of six hundred chapters share the same aim.\nThough the texts speak with solemnity, the world does not ponder deeply.\nTracing the source and flow, the hidden and manifest originally dwell together.\n\nI humbly speak for the worthy—how dare I treat these writings lightly?\nHolding my tongue, I wish to remain silent, yet cutting off the Dao invites punishment.\nPouring my thoughts onto bamboo and silk, I fear leaking Heaven’s tally.\nHesitant, I sigh, gazing up and down, stitching together this foolishness.\n\nRefinement has its methods and standards; I cannot bear to lay them all bare.\nI briefly outline the essentials; the branches and twigs will be seen in due course.",
      "overlap_context": " water’s uprising. The Vermilion Bird is the essence of fire, maintaining balance to determine victory or defeat. If water prevails, fire is extinguished, and both perish, returning to the fertile earth. When the three natures unite, their original nature shares a common ancestor. Zi-water is one, wu-fire is two, wu-ji is five, combining to form the eight minerals. Kan and Li, husband and wife, possess the image of breathing and nurturing union. The three natures of metal, water, and fire return",
      "start_char": 4242,
      "end_char": 4801,
      "start_sentence": 289,
      "end_sentence": 330,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.39021325111389,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "举伏羲、文王、仲尼三圣，明此道之出於《易》象河图、洛书也。 震顺八数巽顺三数离顺七数坎顺一六数乾逆四数兑逆四数坤艮一顺一逆合皇极十五数魏先生谓天以河图授伏羲，伏羲错之以洛书之数，是为先天八卦。 以先天卦加河图，则药物火候昭然可见。 此圣人之所以见道，而达造化之机也。 夫以乾合离，是谓阳炉离宅於乾也； 以坤合坎，是谓阴鼎坎宅於坤也。 震与离会，龙从火裹出也。 兑与坎会，虎向水中生也。 亦二物总因儿产母之旨也。 至於月（缺）震而满乾，喊巽而没坤，此又分至火候之妙也。 天道浩荡，非《易》象不足以明之。 《易》道精微，非圣人不足以发之。 是道也，三君启之於前，魏君明之於后，信乎其出於河图矣。 以金为堤防，水入乃优游。 金数十有五，水数亦如之。 临炉定铢两，五分水有余。 二者以为真，金重如本初。 其三遂不入，火二与之俱。 三物相含受，变化状若神。 下有太阳黑，伏需须臾问。 先液而后凝，号曰黄舆焉。 岁月将欲讫，毁性伤寿年。 形体为灰土，状若明窗尘。 金水同居，举金则水入矣。 金九、水六，共十五数。 十五分中，水得六数，五分有余也。 金、水二者为真药，故曰二者以为真也。 夫木性资金情以为药，子藏母胞，故水随金入，发火於下，变化生焉。 水、金、火三物本者，性也。 制木以金，致金以水，炼金以火，木无所事，故言三物而不及木，其三遂不入也。 阳极故先液，阴生故后凝。 号曰黄舆者，天玄地黄，坤为地，为大舆故也。 修炼至此，阳极阴生，乾渐变坤也。 坤道穷极，龙战玄黄，形体为灰土，此第一真景象也。 此章言阳极阴生。 梼治并合之，驰入赤色门。 固塞其际会，务令致完坚。 炎火张於下，昼夜声正勤。 始文使可修，终竟武乃陈。 候视加谨慎，审察调寒温。 周旋十二节，节尽更亲观#42。 气索#43命将绝，休死亡魄魂。 色转更为紫，赫然成还丹。 粉提以一丸，刀圭最为神。 四象以合塞兑闭门，无思无为，以固际之。 及阴剥阳生，自坤化乾，乾为大赤，故曰驰入赤色门。 始文使可修者，为修丹进火是也。 火不可以遽进，始以文火调之，使刚柔不抗行，度其可修则进火，发火初温微是也。 始则发火以娠之，名曰野战； 中则文火以养之，名曰灌溉； 终则烈火以成之，名曰烹煎； 言进火之节也。 色转更为紫，赫然成还丹者，紫为乾，大赤之象，《益》之六三震之上爻也。 其究为健。 健，乾也，震变而为《乾》也。",
      "translated_text": "The three sages—Fuxi, King Wen, and Confucius—reveal that this Dao emerges from the *Yi*’s images, the *Hetu* (River Chart), and the *Luoshu* (Luo Writing). Zhen aligns with the eight, Xun with the three, Li with the seven, Kan with the one and six, Qian in reverse with the four, Dui in reverse with the four, Kun and Gen with one forward and one reverse, together forming the imperial fifteen. Master Wei declared that Heaven bestowed the *Hetu* upon Fuxi, who then arranged it according to the numbers of the *Luoshu*, giving rise to the precelestial eight trigrams. When the precelestial trigrams are overlaid upon the *Hetu*, the medicinal substances and fire phases become brilliantly apparent. This is how the sages perceived the Dao and grasped the mechanism of creation and transformation.\n\nWhen Qian unites with Li, it is called the yang crucible, with Li dwelling in Qian. When Kun unites with Kan, it is called the yin tripod, with Kan dwelling in Kun. When Zhen meets Li, the dragon emerges from within the fire. When Dui meets Kan, the tiger is born from within the water. These two entities embody the principle of the child producing the mother. As for the moon’s phases—waning in Zhen and waxing in Qian, waning in Xun and setting in Kun—this further reveals the subtleties of the fire phases at the solstices and equinoxes.\n\nThe Way of Heaven is vast; only the images of the *Yi* suffice to illuminate it. The Dao of the *Yi* is profound; only the sages suffice to expound it. This Dao was inaugurated by the three lords of antiquity and later elucidated by Master Wei—truly, it arises from the *Hetu*.\n\nUse metal as the embankment, and water enters with ease. The number of metal is fifteen, and the number of water is the same. When tending the furnace to set the weights, let water exceed by five parts. These two are deemed authentic: let the metal’s weight return to its origin. The third does not enter, but fire accompanies it as two. The three substances contain and receive one another, their transformations appearing divine.\n\nBeneath lies the great yang’s darkness, awaiting its moment in silence. First it liquefies, then congeals—this is called the Yellow Chariot. As the years and months draw to a close, nature is undone, and lifespan is harmed. The body becomes ash and dust, resembling the dust on a bright window. When metal and water dwell together, raising the metal draws the water in. Metal is nine, water is six—together they make fifteen. Of these fifteen parts, water claims six, leaving five parts in excess. Metal and water are the true medicine, hence they are called \"the two deemed authentic.\" The nature of wood relies on the essence of metal to form the medicine; the child is concealed within the mother’s womb, so water follows metal inward. Fire is ignited below, and transformation arises. Water, metal, and fire—these three substances are rooted in nature. Wood is governed by metal, metal is drawn by water, and metal is refined by fire. Wood has no role here, so it is said that \"the third does not enter,\" referring to these three.\n\nYang reaches its extreme and thus liquefies first; yin arises and thus congeals later. It is called the Yellow Chariot because \"heaven is dark, earth is yellow,\" and Kun is earth, the great chariot. At this stage of refinement, yang reaches its limit and yin is born, as Qian gradually transforms into Kun. When the Kun’s way is exhausted, the dragon battles in the dark and yellow, and the body becomes ash and dust—this is the first true manifestation. This passage speaks of yang reaching its limit and yin arising.\n\nCombine and harmonize the refining and blending, then hasten into the gate of crimson. Securely seal their juncture, ensuring it is complete and firm. Let the blazing fire rise from below, its roar ceaseless day and night. Begin with the civil to make it workable, and end with the martial to display it. Observe and tend with utmost care, scrutinizing the adjustments of cold and warmth. Circulate through the twelve nodes, and when each node is complete, examine it closely again. When qi is depleted and life nears its end, cease the work lest the hun and po perish. The color shifts to purple, and suddenly the elixir of return is formed. Grind it into a single pellet, and the spatula’s touch is most divine.\n\nThe four images unite to seal Dui and close the gate—thoughtless and effortless—to secure the juncture. As yin is stripped away and yang is born, Kun transforms into Qian. Qian is the great crimson, hence it is said to hasten into the gate of crimson. \"Begin with the civil to make it workable\" refers to refining the elixir and advancing the fire. Fire cannot be rushed; first, use the civil fire to temper it, ensuring hardness and softness do not resist each other. Once it is workable, advance the fire—this is the initial gentle warmth. At first, ignite the fire to conceive it, called \"wild battle.\" In the middle, nurture it with civil fire, called \"irrigation.\" In the end, use fierce fire to complete it, called \"boiling and simmering\"—this describes the stages of advancing the fire.\n\nThe color shifts to purple, and suddenly the elixir of return is formed. Purple represents Qian, the image of great crimson, the six in the third of *Yi* (Increase), and the top line of Zhen. In the end, it becomes firm. Firmness is Qian, as Zhen transforms into *Qian*.",
      "overlap_context": "t originally dwell together.\n\nI humbly speak for the worthy—how dare I treat these writings lightly?\nHolding my tongue, I wish to remain silent, yet cutting off the Dao invites punishment.\nPouring my thoughts onto bamboo and silk, I fear leaking Heaven’s tally.\nHesitant, I sigh, gazing up and down, stitching together this foolishness.\n\nRefinement has its methods and standards; I cannot bear to lay them all bare.\nI briefly outline the essentials; the branches and twigs will be seen in due course.",
      "start_char": 4802,
      "end_char": 5751,
      "start_sentence": 331,
      "end_sentence": 385,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.270868062973022,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "其爻辞有曰：告公用圭。 《益》，纯乾，乃有圭象。 乾为金，为玉，故曰刀圭也。 夫坎离因戊己二土而合，乃成乾体，故圭字从二土也。 火候已足，坤化为乾，更历三官，休死亡魄魂，此第二真景象也。 此章言阴极阳生 推演五行数，较约而不烦。 举水以激火，奄然灭光明#44。 曰月相激薄，常在晦朔问。 水盛坎侵阳，火衰离昼昏。 阴阳相啖食#45，交感道自然。 此论前章形体为灰土，熙索命将绝，如曰月相激薄，掩其光明，坎水胜离火故也。 名者以定情，字者绿性言。 金来归性初，乃得称还丹。 吾不敢虚说，仿效圣人文。 古记题龙虎，黄帝美金花#46。 淮南炼秋石，王阳加黄芽。 贤者能持行，不肖母与俱。 古今道由一，对谈吐所谋。 学者加勉力，留念深思惟。 至要言甚露，昭昭不我欺。 金情至阳归於水性之至阴，所谓复归其根，还以事之也。 情根於性，性反其根，故曰还丹。 与中篇推情合性同义。 此章言结成还丹。 周易参同契卷上竟 #1因未得其他版本以参校，故暂以朱熹《周易参同契考异》四库本（后文简称《考异》本）校勘其经文。 除底本外，储华谷《周易参同契注》尚有《道藏举要》本。 ＃2『校度』，《考异》本作『技度』。 ＃3『时至』，《考异》本作『晦至』。 ＃4『妮』，《考异》本作『媾』。 ＃5『乃芽滋』，《考异》本作『乃牙滋』。 ＃6『屈信』，《考异》本作州讪信』。 ＃7『钟律』，《考异》本作『锺律』。 ＃8『於爽』，《考异》本作『为爽』。 ＃9『气』，《考异》本作『无』。 ＃10『丧其朋』，《考异》本作『丧其明』。 ＃11『幼』，《考异》本作『效』。 ＃12『爻』，据其文义例补。 ＃13『此』，据其文义例补。 ＃14『微密』，《考异》本作『密微』。 ＃15『戾』，据其文义例补。 ＃16『壮阁过贻主』，《考异》本作『结过移主』。 ＃17『引明』，《考异》本作『隐明』。 ＃18『其数名一』，《考异》本作『其散各一』。 ＃19『铅』，《考异》本作『铋』。 ＃20『彷佛』，《考异》本作『仿佛』。 ＃21『环匝』，原作『环市』，据《考异》本改。 ＃22『外邪』，《考异》本作『新邪』。 ＃23『肠鸣』，《考异》本作『晦朔』。 ＃24『朝暮』，原作『朝莫』，据《考异》本改。 ＃25『心欢而意悦』，《考异》本作『心惧意喜悦』。 ＃26『夭命』，原作『天命』，据《考异》本改。 ＃27『章言』，据其文义例补。 ＃28『熬』，据其文义例补。 ＃29『熹』，《考异》本作『嬉』。 ＃30『呼吸相含育』，《考异》本作『噱吸相贪欲』。 ＃31『伫恩』，《考异》本作『伫思』。 ＃32『镇』，《考异》本作『填』。 ＃33『会合』，《考异》本作『合会』。 ＃34『规矩』，原作『规矩』，据《考异》本改。 ＃35『黑需』，《考异》本作『重黑』。 ＃36『遭值』，《考异》本作『遭植』。 ＃37『矾磁』，《考异》本作『誉磁』。 ＃38『炼持』，《考异》本作『炼治』。 ＃39『禅性』，《考异》本作『杂性』。 ＃40『为』，《考异》本作『待』。 ＃41『倪仰』，《考异》本作『俯仰』。",
      "translated_text": "The *Yi*’s line statement reads: \"Inform the duke with a jade tablet.\" *Yi* (Increase), being pure Qian, thus bears the image of the tablet. Qian is metal, is jade, hence it is called the \"knife-jade.\" Kan and Li unite through the two earths of Wu and Ji to form the body of Qian, which is why the character for \"tablet\" (*gui*) is composed of two earths. When the fire-phase is complete, Kun transforms into Qian, passing through the Three Palaces to rest the dead *po* and *hun*—this is the second true image.\n\nThis chapter speaks of yin at its extreme giving rise to yang, expounding the numbers of the Five Phases with concision and without excess. It takes water to stimulate fire, suddenly extinguishing radiance. The sun and moon press upon each other, ever lingering between darkness and new moon. When water flourishes, Kan encroaches upon yang; when fire wanes, Li’s day grows dim. Yin and yang devour each other, their mutual arousal the natural Way.\n\nThis discussion follows the previous chapter’s depiction of the body as ashes and dust, its vital force nearly severed—like the sun and moon pressing upon each other, obscuring their radiance, for Kan-water overcomes Li-fire. Names are given to settle essence; words are chosen to express nature. When metal returns to the origin of nature, it may be called the Elixir of Return. I dare not speak emptily, but emulate the sages’ writings. Ancient records speak of Dragon and Tiger; the Yellow Emperor praised Golden Flower. Huainan refined Autumn Stone; Wang Yang added Yellow Sprout. The worthy can uphold and practice this; the unworthy must not partake. The Way of past and present is one; in conversation, we disclose our plans. Scholars, exert yourselves further, and ponder deeply. The essential words are utterly plain, shining clearly without deceiving me.\n\nMetal’s essence, being utmost yang, returns to water’s nature of utmost yin—this is what is meant by \"returning to its root,\" and thus serving it. Essence is rooted in nature; when nature reverts to its root, it is called the Elixir of Return. This aligns with the middle section’s principle of harmonizing essence with nature. This chapter describes the congealing of the Elixir of Return.\n\n*Cantong Qi*, Scroll One, concludes.",
      "overlap_context": "re to conceive it, called \"wild battle.\" In the middle, nurture it with civil fire, called \"irrigation.\" In the end, use fierce fire to complete it, called \"boiling and simmering\"—this describes the stages of advancing the fire.\n\nThe color shifts to purple, and suddenly the elixir of return is formed. Purple represents Qian, the image of great crimson, the six in the third of *Yi* (Increase), and the top line of Zhen. In the end, it becomes firm. Firmness is Qian, as Zhen transforms into *Qian*.",
      "start_char": 5751,
      "end_char": 7098,
      "start_sentence": 386,
      "end_sentence": 453,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.789725542068481,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "＃42『更亲观』，《考异》本作『更须亲』。 ＃43『气索』，《考异》本作『黑索』。 ＃44『光明』，《考异》本作『光荣』。 ＃45『相啖食』，《考异》本作『相饮食』。 ＃46『金花』，《考异》本作『金华』。 周易参同契卷中 储华谷注 乾刚坤柔，配合相包。 阳禀阴受，雌雄相须。 须以造化，精气乃舒。 坎离冠首，光耀垂敷。 玄冥难测，不可画图。 圣人揆度，参序玄基。 四者混沌，径入虚无。 六十卦周，张布为舆。 龙马就驾，明君御时。 和则随从，路平不邪。 邪道险阻，倾危国家。 乾坤、雌雄，是为药物。 阳禀阴受者，坎主禀与，施其阳於离； 离主翕受，须其阳於坎，是谓配合相包也。 须以造化，精气乃舒者，知坎、离交娠之道，又须造化之六阳以为火候，乃能使之播精也。 坎离冠首者，元首为道，言药乃玄气也。 玄气者，玄元始三熙之初熙也，故日玄冥，又日玄基。 径入虚无者，言四象会合，正欲实离官之虚无也。 按六十卦行周天火，不失其时则和平而无险阻矣。 龙马就驾者，震为龙，乾为马，一阳至六阳，行火之时也。 自坎离冠首至参序玄基以上言药物也。 四者混沌，径入虚无，言交垢也。 六十卦周.以下言火候也。 学士进火，犹明君御时，故以皇上、王者、帝王、人君为喻#1。 奉若天道，辅相阴阳，使三光合度，以致太平。 大其用则帝王以之，善其身则学士以之。 君子居其室，出其言善#2则千里之外应之。 谓万乘之主，处九重之室，发号施令#3顺阴阳节。 藏器埃时#4勿违卦月#5。 《屯》以子申，《蒙》用寅戌。 余六十卦，各自有日。 聊陈两象，未能究悉。 立义设刑，当仁施德。 逆之者凶，顺之者吉。 按历法令，至诚专密。 谨候日辰，审察消息。 以月节总论，则冬至为《复》卦； 以#6气候详论，则冬至为《中孚》。 爻辞首之，其旨深矣。 戊戊戊庚庚庚 子戌申辰寅子 如《屯》卦，则初爻庚子为冬至一阳至； 六四见戊申，为春分沐浴。 丙丙丙戊戊戊 寅子戌午辰寅 如《蒙》卦，则初爻戊寅为夏至一阴至； 六四见丙戌，为秋分沐浴。 右以两卦为例，定二分二至也。 故下文云二至改度，乖错委曲； 二分纵横，不应漏刻。 如《屯》、《蒙》两卦，则二分、二至定矣，阳火、阴符之妙尽矣。 纤芥不正，悔吝为贼。 二至改度，乖错委曲。",
      "translated_text": "Variants:\n- \"更亲观\" (*Geng Qin Guan*) appears as \"更须亲\" (*Geng Xu Qin*) in the *Kaoyi*.\n- \"气索\" (*Qi Suo*) appears as \"黑索\" (*Hei Suo*) in the *Kaoyi*.\n- \"光明\" (*Guang Ming*) appears as \"光荣\" (*Guang Rong*) in the *Kaoyi*.\n- \"相啖食\" (*Xiang Dan Shi*) appears as \"相饮食\" (*Xiang Yin Shi*) in the *Kaoyi*.\n- \"金花\" (*Jin Hua*) appears as \"金华\" (*Jin Hua*) in the *Kaoyi*.\n\n---\n\n*The Cantong Qi*, Scroll Two\nCommentary by Chu Huagu\n\nThe firmness of Qian and the softness of Kun unite and embrace.\nYang bestows, yin receives—male and female depend on each other.\nThrough this, creation unfolds, and essence and qi expand.\nKan and Li crown the head, their radiance spreading forth.\nMysterious and profound, beyond depiction,\nThe sage measures and orders the foundational mysteries.\nThe four merge into chaos, entering directly into emptiness.\nThe sixty hexagrams cycle, woven into a chariot’s frame.\nDragon and horse are harnessed—an enlightened ruler guides the times.\nHarmony follows, the path smooth and true.\nDeviant ways are perilous, toppling nations and homes.\n\nQian and Kun, male and female—these are the medicinal substances.\n\"Yang bestows, yin receives\" means Kan governs bestowal, imparting its yang to Li;\nLi governs reception, needing yang from Kan—this is what is meant by \"uniting and embracing.\"\n\"Through this, creation unfolds, and essence and qi expand\" means that knowing the way of Kan and Li’s union,\none must also employ the six yang of creation as the fire-timing to enable the dissemination of essence.\n\"Kan and Li crown the head\" means the head is the Dao, and the medicine is the primordial qi.\nPrimordial qi is the first flourishing of the three mysteries of the primordial beginning—hence it is called \"profound darkness\" and \"mysterious foundation.\"\n\"Entering directly into emptiness\" means the four images converge, precisely to fulfill the emptiness of Li’s palace.\n\nFollowing the sixty hexagrams’ fire-timing through the celestial cycle,\nif one does not lose the proper moment, there will be harmony without peril.\n\"Dragon and horse are harnessed\" means Zhen is the dragon, Qian the horse—\nfrom the first yang to the sixth yang, the time for firing arrives.\n\nFrom \"Kan and Li crown the head\" to \"ordering the mysterious foundation\" speaks of the medicinal substances.\n\"The four merge into chaos, entering directly into emptiness\" refers to their intercourse.\nFrom \"The sixty hexagrams cycle\" onward speaks of the fire-timing.\n\nScholars advancing the fire are like enlightened rulers guiding the times,\nthus the analogy of emperors, kings, sovereigns, and lords.\nRevering the celestial Dao, assisting yin and yang,\nthey align the three luminaries to bring great peace.\nIn grand application, emperors employ it; in personal cultivation, scholars do.\nThe noble one abides in his chamber; if his words are virtuous,\nthey resonate a thousand *li* away.\nThis refers to the lord of ten thousand chariots, dwelling in the nine-fold chamber,\nissuing decrees in accord with yin and yang’s rhythms.\nStore the vessel, await the time—do not transgress the hexagrams’ months.\n\n*Zhun* uses *zi* and *shen*; *Meng* employs *yin* and *xu*.\nThe remaining sixty hexagrams each have their own days.\nI briefly present the two images, though I cannot exhaust their details.\nEstablish righteousness, enact punishments—apply benevolence, bestow virtue.\nThose who oppose it meet misfortune; those who follow it meet fortune.\nFollow the calendar’s decrees, be sincere and focused.\nCarefully observe the days and hours, scrutinize the waxing and waning.\nIn broad terms of lunar phases, the winter solstice is the hexagram *Fu*;\nin detailed terms of qi-timing, the winter solstice is *Zhong Fu*.\nThe hexagram’s line statements begin here—its meaning is profound.\n\n*Wu wu wu geng geng geng*\n*Zi xu shen chen yin zi*\nFor *Zhun*, the first line *gengzi* marks the winter solstice’s first yang;\nthe sixth line *wuxu* marks the vernal equinox’s bathing.\n\n*Bing bing bing wu wu wu*\n*Yin zi xu wu chen yin*\nFor *Meng*, the first line *wuyin* marks the summer solstice’s first yin;\nthe sixth line *bingxu* marks the autumnal equinox’s bathing.\n\nThe above uses two hexagrams as examples to fix the two solstices and two equinoxes.\nThus the following text states: \"The two solstices alter their measures, deviating and twisting;\nthe two equinoxes align horizontally and vertically, not erring by a moment’s leak.\"\nWith *Zhun* and *Meng*, the two solstices and two equinoxes are determined,\nand the subtleties of yang fire and yin tally are fully realized.\nThe slightest misalignment brings regret and harm.\n\"The two solstices alter their measures, deviating and twisting.\"",
      "overlap_context": "sential words are utterly plain, shining clearly without deceiving me.\n\nMetal’s essence, being utmost yang, returns to water’s nature of utmost yin—this is what is meant by \"returning to its root,\" and thus serving it. Essence is rooted in nature; when nature reverts to its root, it is called the Elixir of Return. This aligns with the middle section’s principle of harmonizing essence with nature. This chapter describes the congealing of the Elixir of Return.\n\n*Cantong Qi*, Scroll One, concludes.",
      "start_char": 7099,
      "end_char": 8030,
      "start_sentence": 454,
      "end_sentence": 513,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.275527477264404,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "隆冬大暑，盛夏霜雪。 二分纵横，不应漏刻。 风雨不节，水旱相伐。 蝗虫涌沸，山崩地裂。 天见其怪，旱异旁出。 孝子用心，感动皇极。 近起己口，远流殊域。 或以致祸，或以致福。 或以太平，或造兵革。 四者之来，由乎胸臆。 二至以分阳火、阴符之候，二分以定生杀、沐浴之机。 毫发差殊，阳．1几阴僭，悔吝生矣。 王者不能法天地，顺阴阳，灾异生矣。 以之修身，以之治天下，其致一也。 此章言不循二卦之候如此。 动静有常，奉其绳墨。 四时顺宜，与气相得。 刚柔断矣，不相涉入。 五行守界#7不妄盈缩。 《易》行周流，屈伸反覆。 二至、二分，截然不相侵越，动静不失其时，先天而天不违，后天而奉天时也。 此章言循二卦之候如此。 晦朔之问，合符行中。 浑沌鸿蒙，牝牡相从。 滋液润泽，施化流通。 天地神灵，不可度量。 利用安身，隐形而藏。 始乎东北，箕斗之乡。 旋而右转，呕轮吐萌。 潜潭见象，散发#8精光。",
      "translated_text": "In the depths of winter, scorching heat arises; in the height of summer, frost and snow descend.\nThe two equinoxes align horizontally and vertically, not erring by a moment’s leak.\nWhen wind and rain fail to follow their seasons, floods and droughts contend;\nlocusts surge like boiling water, mountains collapse and the earth splits.\nHeaven displays its portents, strange omens proliferate.\nThe filial son’s devoted heart moves the August Ultimate.\nNear at hand, it arises from one’s own speech; far off, it flows into distant lands.\nSome bring calamity, some bring fortune;\nsome usher in great peace, some incite war and strife.\nThese four outcomes arise from the heart’s intentions.\n\nThe two solstices divide the phases of yang fire and yin tally;\nthe two equinoxes fix the mechanisms of generation, destruction, and bathing.\nThe slightest deviation—where yang encroaches or yin oversteps—gives rise to regret and harm.\nWhen rulers fail to model themselves on Heaven and Earth, aligning with yin and yang, disasters and anomalies emerge.\nWhether refining the self or governing the world, the principle is one and the same.\n\nThis passage speaks of the consequences when the patterns of the two hexagrams are not followed.\nMovement and stillness have their constancy; one adheres to the plumb line.\nThe four seasons proceed in due order, harmonizing with qi.\nHard and soft are decisively distinguished, never trespassing upon one another.\nThe Five Phases guard their boundaries, neither recklessly expanding nor contracting.\nThe *Changes* circulate in ceaseless flow, bending and stretching, reversing and returning.\nThe two solstices and two equinoxes stand sharply distinct, never encroaching upon one another;\nmovement and stillness do not miss their appointed times.\nAnticipating Heaven, Heaven does not oppose; following Heaven, one accords with its seasons.\n\nThis passage speaks of the consequences when the patterns of the two hexagrams are followed.\nBetween the dark of the moon and its first crescent, tally marks align at the center.\nIn primordial chaos, the undifferentiated, the female and male follow one another.\nEssences moisten and nourish, transformations flow and circulate.\nThe numinous spirits of Heaven and Earth cannot be measured.\nEmploy them to secure the self, conceal the form and hide away.\n\nIt begins in the northeast, the region of *Ji* and *Dou*.\nTurning rightward, it spews forth the wheel and spits out the sprout.\nHidden depths reveal their images, scattering and emitting radiant essence.",
      "overlap_context": "ams as examples to fix the two solstices and two equinoxes.\nThus the following text states: \"The two solstices alter their measures, deviating and twisting;\nthe two equinoxes align horizontally and vertically, not erring by a moment’s leak.\"\nWith *Zhun* and *Meng*, the two solstices and two equinoxes are determined,\nand the subtleties of yang fire and yin tally are fully realized.\nThe slightest misalignment brings regret and harm.\n\"The two solstices alter their measures, deviating and twisting.\"",
      "start_char": 8030,
      "end_char": 8415,
      "start_sentence": 514,
      "end_sentence": 543,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.602805376052856,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "下章以先天卦按月出没论火候，故此章先推月之所以生明，由合璧撢持，隐形养魄於晦朔，然后自东北而渐生明也。 勖毕之上， 震出为征。 阳气#9造端，初九潜龙。 阳以三立，阴以八通。 故三日 #10震动，八日 兑行。 九二见龙，和平有明。 三五德就， 乾体乃成。 九三夕惕，亏折神符。 盛衰渐革，终还其初。 此阳火候也。 巽继其统，因际操持。 九四或跃，进退道危。 艮主#11进止，不得瑜除。 二十三日，典守弦期。 九五飞龙，天位加喜。 六五 坤承，结括终始。 蕴养众子，世为类母。 阳数已讫，讫则复起。 推情合性，转而相与。 上九亢龙，战德於野。 用九翩翩，为道规矩#12。 此阴符候也。 循据纵玑，升降上下。 周流六爻，难可察睹#13。 故无常位，为《易》宗祖。 此论上章火候，按《易》卦六爻应环玑升降也。 故无常位，可以见一阳爻动非冬至，非子时，非朔旦，特借是明之尔。 朔旦为 《复》，阳炁始通。 出入无疾，立表微刚。 黄锺建子，兆乃滋彰。 播施柔暖，黎烝#14得常。 《临》炉施条，开路正光。 光耀寝进，日以益长。 丑之大吕，结正低昂。 仰以成 《泰》，刚#15柔并降。 阴阳交接，小往大来。 辐凌於寅，运而趋时。 惭历 《大壮》，使列#16卯门。 榆荚堕落，还归本根。 刑德相负，昼夜始分。 《夬》阴以退，阳升而前。 洗濯羽翮，振索宿尘。 《乾》健盛明，广被四邻。 阳终於巳，仲吕相干。 《娠》始纪绪，履霜最先。 井底寒泉，午为萝宾。 宾服於阴，阴为主人。 《逐》去世位，收敛其精。 怀德埃时#17，栖迟昧冥。 《否》塞#18不通，萌者不生。 阴伸阳讪，没阳姓名。 《观》其权量，察仲秋情。 任畜微稚，老枯复荣。 荠麦芽蘗#19，因冒以生。 《剥》烂支体，消灭其形。 化炁既竭，亡失至神。 道穷则返，归乎 《坤》元。 恒顺地理，承天布宣。 十二月火候反覆发明《屯》、《蒙》二卦之义。 纳甲图生明於东北寅位，故以朔日一言之，《复》起朔旦，知一阳之不在子月、子时明矣。 以上数章并言火侯。 玄幽远眇#20，隔阂相连。 应度育种，阴阳之原。 寥廓恍惚，莫知其端。 先迷失轨，＇后为主君。 无平不陂，道之自然。 变易更盛，消息相因。 终《坤》始《复》，如循连环。 帝王承御，千载#21常存。 阴阳运转，复垢循环，互为其根。 帝王得其道而承天御物，故能千载常存，大其用也。 夫帝王身为三极之主，正五事以格天地之和，顺阴阳以御生杀之柄，故能享国长久，民安国富，皇极建而膺五福也。 黄帝以之而升举，体用兼明也。 否则骄佚亢满，皇极不建，水旱相伐，弦望盈缩，冬暑夏雪，亦罔或克寿矣。 自天子达庶人，得之者昌，失之者亡，故下章继言学士之用。 此章言帝王之用。 将欲养性，延命却期。 审思后末，当虑其先。 人所禀躯，体本一无。 元精云布，因炁#22托初。 阴阳为度，魂魄所居。 阳神日魂，阴神月魄。 魂之与魄，互为室宅。 性主处内，立置鄞鄂。 情主营外，筑垣城郭。 城郭完全，人物乃安。 于斯之时，情合乾坤。 乾动而直，气布精流。 坤静而翕，为道舍庐。 刚施而，退，柔化以滋。 九还七返#23，八归六居。",
      "translated_text": "The following chapter discusses the precelestial trigrams in relation to the monthly waxing and waning of the firing times, so this chapter first traces the moon’s generation of brightness. From the union of the sun and moon, their mutual embrace and support, the hidden form nurtures the *po*-soul in the dark of the moon and its first crescent, then gradually brightens from the northeast. Above *Xu* and *Bi*, *Zhen* emerges as the omen. Yang *qi* initiates its inception, the first nine as the \"hidden dragon.\" Yang is established in threes, yin flows through eights. Thus, on the third day, *Zhen* stirs; on the eighth day, *Dui* moves. The second nine appears as the dragon, harmonious and luminous. When the virtues of three and five are perfected, the body of *Qian* is complete. The third nine watches in evening vigilance, the divine tally waning and fracturing. Flourishing and decline gradually transform, ultimately returning to their origin. Such is the firing time of yang.\n\n*Xun* inherits its lineage, seizing the opportunity to maintain control. The fourth nine leaps or retreats, the Way perilous in advance or withdrawal. *Gen* governs progression and cessation, unable to be polished or removed. On the twenty-third day, one guards the appointed time of the crescent moon. The fifth nine soars as the dragon, the celestial position bringing joy. The sixth five, *Kun* in submission, binds and concludes the beginning and end. It nurtures the multitude of offspring, becoming the mother of all kinds. The yang numbers are exhausted, and upon exhaustion, they arise anew. Following nature and uniting with essence, they turn and join together. The ninth yang, the \"exalted dragon,\" wages virtue in the wilds. Employing the nine, they flutter and become the compass and square of the Dao. Such is the firing time of the yin tally.\n\nFollowing the pivot of the celestial sphere, ascending and descending, rising and falling, the six lines circulate in revolution—difficult to perceive. Thus, they have no fixed position, forming the ancestral foundation of the *Yi*. This discusses the firing times of the preceding chapter, aligning the six lines of the *Yi* trigrams with the revolving pivot’s ascent and descent. Therefore, having no fixed position reveals that the movement of a single yang line is not confined to the winter solstice, midnight, or the dawn of the new moon—it merely borrows these to illustrate brightness.\n\nThe dawn of the new moon is *Fu*, where yang *qi* first flows. Entering and exiting without haste, it establishes the marker of subtle firmness. When the Yellow Bell tunes to *Zi*, omens flourish and manifest. Spreading warmth and softness, the common people thrive in constancy. The *Lin* furnace applies its branches, opening the path of true radiance. The light gradually advances, the days lengthening. The Great Regulator of *Chou* adjusts the balance of high and low. Gazing upward, it completes *Tai*, where firm and yielding descend together. Yin and yang intertwine, the small departing and the great arriving. The spokes converge at *Yin*, moving in accord with the seasons. Progressing through *Da Zhuang*, it commands the gate of *Mao*. Elm pods fall, returning to their root. Punishment and virtue alternate, day and night begin to divide. In *Guai*, yin retreats while yang ascends. Washing and cleansing feathers and wings, it shakes off the dust of slumber. *Qian*’s vigor shines brightly, broadly covering the four neighbors. Yang culminates at *Si*, where the *Zhong Lü* interact. *Shen* begins its lineage, treading frost first. The cold spring at the well’s bottom, *Wu* as the guest of *Luo*. The guest submits to yin, yin becomes the host. *Zhu* departs from its position, gathering its essence. Cherishing virtue and awaiting the time, it rests in obscurity. *Pi* blocks and does not flow, what sprouts cannot grow. Yin extends while yang is slandered, yang’s name erased. *Guan* measures its authority, examining the conditions of mid-autumn. Nurturing the young and tender, the old and withered revive. Shepherd’s purse and wheat sprout, emerging beneath the cover. *Bo* rots the limbs, dissolving its form. When the transforming *qi* is exhausted, the utmost spirit is lost. When the Dao is exhausted, it returns to the origin of *Kun*. Constantly following earth’s principles, it receives Heaven and spreads its decrees.\n\nThe twelve months’ firing times, in their cyclical revelation, elucidate the meanings of the *Zhun* and *Meng* trigrams. The *Na Jia* diagram generates brightness in the northeast at the *Yin* position. Thus, speaking of the new moon’s first day, *Fu* arises at dawn, making it clear that the single yang is not confined to the *Zi* month or *Zi* hour. The preceding chapters all discuss firing times.\n\nThe profound and distant mysteries interconnect across barriers. Responding to measures and nurturing seeds, they are the origin of yin and yang. Vast and indistinct, none know their beginning. Those who lose the path first become followers; those who grasp it later become rulers. No level ground remains without slope—such is the Dao’s nature. Change and transformation alternate in盛衰, waxing and waning mutually dependent. Ending with *Kun* and beginning with *Fu*, it follows like a linked ring. Emperors and kings who inherit and govern, abiding by this principle, endure for a thousand generations. Yin and yang revolve and cycle, mutually rooting one another. Emperors and kings who grasp this Dao and receive Heaven to govern all things thus endure for millennia, expanding its application.\n\nThe emperor’s body serves as the master of the three ultimates, rectifying the five affairs to harmonize Heaven and Earth, following yin and yang to wield the handle of life and death. Thus, they enjoy long reigns, the people at peace and the state prosperous, the royal ultimate established to receive the five blessings. The Yellow Emperor ascended by this principle, embodying both essence and function. Otherwise, arrogance and excess lead to fullness, the royal ultimate unestablished. Flood and drought contend, the moon’s phases wax and wane, winter heat and summer snow—none may attain longevity.\n\nFrom the Son of Heaven to the common people, those who grasp this prosper; those who lose it perish. Thus, the following chapter discusses the scholar’s application, while this chapter addresses the emperor’s use.\n\nTo nurture one’s nature, extend life, and delay the appointed time, one must deliberate on what follows and consider what precedes. The body one receives is fundamentally empty. Primordial essence spreads like clouds, relying on *qi* to establish its beginning. Yin and yang serve as measures, the dwelling of *hun* and *po*. The yang spirit is the sun’s *hun*, the yin spirit the moon’s *po*. *Hun* and *po* mutually serve as dwellings. Nature resides within, establishing boundaries and banks. Emotion operates externally, constructing walls and outer fortifications. When the city walls are complete, people and things find peace. At this time, emotion harmonizes with *Qian* and *Kun*. *Qian* moves directly, *qi* spreading and essence flowing. *Kun* is still and receptive, serving as the Dao’s dwelling. The firm advances and retreats, the yielding transforms and nourishes. Nine returns, seven reverses, eight returns, six resides.",
      "overlap_context": " align at the center.\nIn primordial chaos, the undifferentiated, the female and male follow one another.\nEssences moisten and nourish, transformations flow and circulate.\nThe numinous spirits of Heaven and Earth cannot be measured.\nEmploy them to secure the self, conceal the form and hide away.\n\nIt begins in the northeast, the region of *Ji* and *Dou*.\nTurning rightward, it spews forth the wheel and spits out the sprout.\nHidden depths reveal their images, scattering and emitting radiant essence.",
      "start_char": 8416,
      "end_char": 9689,
      "start_sentence": 544,
      "end_sentence": 634,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.44982671737671,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "男白女赤，金火相拘。 则水定火，五行之初。 上善若水，清而无瑕。 道之形象，真一难图。 变而分布，各自独居。 人之未生，一真而已。 自无而有，变熙以成形体，托形以居魂魄。 日魂本阳神，月魄本阴神。 房日兔反在月中，毕月乌反在日中，坎、离之中爻亦然，互为室宅也。 性为魂，情为魄，性得情以守卫，则不失其初矣。 坎男得乾画，动而施精； 离女得坤画，虚而翕受； 自然九火、七金还元返本，八木、六水归根居源，此以洛书成数论四象也。 金白火赤，故日赤白。 金乃坎男中真阳，火乃离女中真阴，此金、火之二用。 上言七、八、九、六四象，下止言金、水、火者，与三物相含受同义。 四象合体，是为真一，其象不可浴状； 散则五行各得一方之熙而已。 此章言学士之用。 类如鸡子，黑白相扶#24。 纵横一寸，以为始初。 四肢五脏，筋骨乃具。 弥历十月，脱出其胞。 骨弱可卷，肉滑若铅#25。 此论上章道之形象。 阳燧以取火，非日不生光。 方诸非星月，安能得水浆。 二炁#26玄且远，感化尚相通。 何况近存身，切在於心胸。 阴阳配日月，水火为效征。 以物感日月，尚可致水火，况人具真阴、真阳，法日月以娠坎离，何难之有？ 耳目口三宝，固塞勿发通。 真人潜深渊，浮游守规中。 旋曲以豚览，开阖皆合同。 为己之轴辖，动静不竭穷。 离气内营卫，坎乃不用聪。 兑合不以谈，希言顺鸿蒙。 三者既关键，缓体处空房。 委志归虚无，无念以为常。 证难以推移，心专不纵横。 寝寐神相抱，觉寤候存亡。 颜容浸#27以润，骨节益坚强。 辟却众阴邪，然后立正阳。 修之不辍休，庶黑云雨行。 淫淫若春泽，液液象解冰。 从头流达足，究竟复上升。 往来洞无极，怫怫被容中。 反者道之验，弱者德之柄。 芸锄#28宿污秽，细微得调畅。 浊者清之路，昏久则昭明。 圣胎已结，周密固闭，守之以无为．'持之以不昧，自然有此功用，自昏而明，由浊而清，从坤体而渐变纯乾也。 前章言圣胎之象。 此章言保养之法。 世人好小卫，不审道浅深。 弃正从邪径，欲速关不通。 犹盲不任仗，聋者听宫商。 投水#29捕雉兔，登山索鱼龙。 植麦欲获黍，运规以求方。 竭力劳精神，终年无见功。 欲知服食法，事约而不烦。 义明不叉释。 太阳流珠，常欲去人。 卒得金华，转而相因。 化为白液，凝而至坚。 金华先倡，有顷之问，解化为水，马齿阑干。 阳乃往和，情性自然。 迫促时阴，拘畜禁门。 慈母养育，孝子报恩。 严父施令，教劲#30子孙。 五行错王，相据以生。 火性销金，金伐木荣。 三五与一，天地至精。 可以口诀，难以书传。 流珠乃离中之汞，性本炎上而飞走，阳金则挟水以制之，妙合而凝矣。 金华先倡，有顷之间，化而为水者，金火既合，火能销金而为水，故下文云火性销金也。 阳乃往和，情性自然者，谓阳情阴性得其类，自然混合，则炁归元海。 漏永息长，故日迫促时阴也。 火不炎上，凡念泯息使鬼道不通，故曰拘畜禁门也。 阳金制木使不得生火，火生祸发必克矣，故下文云金伐木荣也。 离得坤画为母道，居南司夏，以长养为事，故曰慈母养育。 坎得乾画为父道，居北司冬而严凝，以杀为主，以害为恩，故云严父。",
      "translated_text": "The man is white, the woman red—metal and fire restrain each other.\nThus water settles fire, the inception of the Five Phases.\nSupreme goodness resembles water, pure and without flaw.\nThe Dao’s form and image—True Unity is hard to depict.\nTransforming and dispersing, each dwells in solitude.\nBefore a person is born, only True Unity exists.\nFrom nothing to being, transformation flourishes to form the body,\nwhich shelters *hun* and *po* to take residence.\n\nThe sun’s *hun* is fundamentally yang spirit; the moon’s *po* is fundamentally yin spirit.\nThe Chamber’s sun-hare reverses within the moon;\nthe Net’s moon-crow reverses within the sun.\nThe middle lines of *Kan* and *Li* are likewise—each serves as the other’s dwelling.\nNature is *hun*; emotion is *po*.\nWhen nature gains emotion as its guardian, it does not lose its origin.\n\nThe *Kan* man obtains the *Qian* line, moving to bestow essence;\nthe *Li* woman obtains the *Kun* line, empty and receptive.\nNaturally, nine fires and seven metals return to the origin and revert to the root;\neight woods and six waters return to the source and reside in the spring.\nThis is the Four Images discussed through the Luo River’s completed numbers.\nMetal is white, fire red—hence the sun’s red and white.\nMetal is the true yang within *Kan* man; fire is the true yin within *Li* woman—\nthese are the two functions of metal and fire.\nAbove speaks of the Four Images—seven, eight, nine, and six—\nwhile below mentions only metal, water, and fire,\nwhich shares the same meaning as the mutual containment of the Three Substances.\n\nThe Four Images unite as one body—this is True Unity,\nwhose image cannot be bathed or described.\nWhen dispersed, the Five Phases each attain one direction’s flourishing.\n\nThis chapter speaks of the scholar’s practice.\nIt is like a chicken’s egg, black and white supporting each other.\nA single inch in length and breadth serves as the beginning.\nThe four limbs and five viscera, sinews and bones, are thus complete.\nAfter ten months pass, it emerges from its womb.\nIts bones are weak enough to bend; its flesh is smooth as lead.\n\nThis discusses the previous chapter’s Daoist form and image.\nA yang burning-mirror gathers fire—without the sun, it does not produce light.\nA *fangzhu* vessel does not rely on stars or moon—\nhow could it obtain water or broth?\nThe two *qi* are profound and distant, yet their transformations still communicate.\nHow much more so for what is near and stored within the body,\nintimately present in the heart and chest?\n\nYin and yang pair with the sun and moon; water and fire serve as their effects.\nUsing objects to interact with the sun and moon,\none can still obtain water and fire.\nHow much more so for a person possessing true yin and true yang,\nwho models the sun and moon to conceive *Kan* and *Li*—what difficulty could there be?\n\nThe three treasures of ear, eye, and mouth—\nfirmly seal them, do not let them open or communicate.\nThe Perfected One lurks in the deep abyss,\nfloating and roaming while guarding the compass’s center.\nTurning and curving to survey, opening and closing all harmonize.\nThey serve as the axle and linchpin for oneself—\nmovement and stillness never exhaust.\n\n*Li*’s *qi* internally defends; *Kan* does not employ hearing.\n*Dui* unites without speech, few words follow the Primordial Vastness.\nOnce these three are secured as key mechanisms,\nrelax the body and dwell in an empty chamber.\nEntrust your will to emptiness and nothingness,\ntaking absence of thought as the constant.\nProof is difficult to shift—focus the mind without distraction.\nIn sleep, spirit embraces spirit; upon waking, observe presence and absence.\nThe complexion gradually moistens,\nthe bones and joints grow ever stronger.\nExpelling the host of yin demons,\nonly then is true yang established.\n\nIf cultivation never ceases,\nthen dark clouds will disperse like rain.\nDrizzling like spring’s moisture,\ntrickling like melting ice.\nFrom the head it flows down to the feet,\nultimately ascending again.\nComing and going, it penetrates the boundless,\npermeating the body’s interior.\nReversion is the Dao’s verification; weakness is virtue’s handle.\nWeed out long-standing filth,\nand the subtle is harmoniously regulated.\nThe turbid is the path to clarity;\nprolonged darkness leads to illumination.\n\nOnce the sacred embryo is formed, it is tightly sealed and firmly closed.\nGuard it with non-action, hold it without obscurity—\nnaturally, these functions arise:\nfrom darkness to light, from turbidity to clarity,\nfrom the *Kun* body gradually transforming into pure *Qian*.\n\nThe previous chapter spoke of the sacred embryo’s image;\nthis chapter speaks of the method of nurturing it.\n\nWorldly people favor petty safeguards,\nnot examining the Dao’s depth or shallowness.\nThey abandon the correct path to follow deviant trails,\nseeking speed but finding the gate blocked.\nLike the blind refusing a staff,\nor the deaf listening to palace music.\nThey cast nets in water to catch pheasants and hares,\nor climb mountains to seek fish and dragons.\nThey plant wheat hoping to harvest millet,\nor use a compass to seek a square.\nExhausting their strength and laboring their spirit,\nthroughout the year they see no success.\n\nIf you wish to know the method of ingesting and refining:\nthe affair is simple and not burdensome.\nIts meaning is clear and requires no further explanation.\n\nThe sun’s flowing pearl constantly seeks to leave.\nSuddenly obtaining golden radiance, it turns and relies upon it.\nTransforming into white liquid, it congeals into utmost hardness.\nThe golden radiance first initiates—\nafter a brief moment, it dissolves and transforms into water,\nlike horse’s teeth arranged in rows.\nYang then goes to harmonize—nature and emotion naturally unite.\nPressing upon the timely yin,\nit is restrained and confined within the gate.\nThe compassionate mother nurtures; the filial son repays kindness.\nThe stern father issues commands; the strict teacher instructs descendants.\nThe Five Phases vie for supremacy, relying on each other to generate.\n\nFire’s nature melts metal; metal chops down wood’s flourishing.\nThe Three, Five, and One—these are heaven and earth’s utmost essences.\nThey can be transmitted orally but are difficult to convey in writing.\n\nThe flowing pearl is the mercury within *Li*—\nits nature is to blaze upward and flee.\nYang metal then carries water to restrain it,\nwondrously uniting and congealing.\nThe golden radiance first initiates—\nafter a brief moment, it transforms into water:\nonce metal and fire unite, fire can melt metal into water,\nhence the later statement that fire’s nature melts metal.\n\n“Yang then goes to harmonize—nature and emotion naturally unite”\nmeans that yang’s emotion and yin’s nature find their kindred,\nnaturally blending so that *qi* returns to the original sea.\nThe leak is eternally sealed—thus it is said to press upon the timely yin.\nFire does not blaze upward; all thoughts vanish, cutting off the ghostly path—\nhence it is said to be restrained and confined within the gate.\n\nYang metal restrains wood to prevent it from generating fire;\nif fire arises and disaster erupts, it will surely be overcome—\nhence the later statement that metal chops down wood’s flourishing.\n\n*Li* obtains the *Kun* line as the mother’s way,\nresiding in the south to govern summer, taking nurturance as its duty—\nthus it is called the compassionate mother nurturing.\n*Kan* obtains the *Qian* line as the father’s way,\nresiding in the north to govern winter, taking severity as its essence,\nusing harm as kindness—thus it is called the stern father.",
      "overlap_context": "Nature resides within, establishing boundaries and banks. Emotion operates externally, constructing walls and outer fortifications. When the city walls are complete, people and things find peace. At this time, emotion harmonizes with *Qian* and *Kun*. *Qian* moves directly, *qi* spreading and essence flowing. *Kun* is still and receptive, serving as the Dao’s dwelling. The firm advances and retreats, the yielding transforms and nourishes. Nine returns, seven reverses, eight returns, six resides.",
      "start_char": 9689,
      "end_char": 10943,
      "start_sentence": 635,
      "end_sentence": 715,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.24855351448059,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "三五与一见后注。 此章言坎离交姤之造化。 子当右转，午乃东旋。 卯酉界隔，主定二名。 龙呼於虎，虎吸龙精。 两相饮食，俱相贪荣#31。 遂相#32 □咽#33咀嚼相吞。 荧惑守西，太白经天。 杀炁所临，何有不倾。 狸犬守鼠，乌雀畏鹯。 各有其功，何敢有声。 子右转而加酉，午东旋而加卯。 酉临午位，正日短星昴，以殷仲冬一阳之时也。 当此之时，可以交姤。 二名，谓龙虎也。 相吞相 ，乃交姤景象。 始则相贪，中则相 ，终则相吞，工夫自浅而深，自然合璧，坎离交姤矣。 荧惑守西，太白经天者，午加西酉，大火临午，正日永星火，以正仲夏一阴之时也。 阴主肃杀，万物退敛，当此之时阴符息火，学士知子、午一阴一阳之机，使金虎擒制木龙，不得飞走，如犬守鼠，如乌畏鸥，各有其功也。 此章言阳火阴符之妙旨。 不得其理，难为妄言。 竭殚家产，妻子饥贫。 自古及今，好者亿人。 讫不谐遇，希有能成。 广求名药，与道乖殊。 如审遭逢，睹其端绪。 以类相况，揆物终始。",
      "translated_text": "The annotation on \"Three Fives and One\" follows below.\n\nThis chapter speaks of the creative transformations of *Kan* and *Li* in union.\nThe *zi* hour turns rightward, while *wu* revolves eastward.\n*Mao* and *you* stand as boundaries, establishing the two names.\nThe dragon calls to the tiger; the tiger inhales the dragon’s essence.\nBoth feed upon each other, each coveting the other’s glory.\nThus they swallow and chew, devouring one another.\nWhen *Yinghuo* guards the west and *Taibai* traverses the heavens,\nwherever the killing *qi* descends, what can stand unshaken?\nThe foxhound guards the rat; the crow and sparrow fear the goshawk.\nEach has its function—how dare they make a sound?\n\n*Zi* turns rightward to align with *you*; *wu* revolves eastward to align with *mao*.\nWhen *you* occupies the *wu* position, it is precisely the short-day *Mao* star,\nmarking the mid-winter moment of the first yang.\nAt this time, union may be achieved.\nThe two names refer to the dragon and tiger.\nTheir mutual swallowing and merging form the image of union.\nAt first, they covet each other; in the midst, they contend;\nin the end, they devour—progressing from shallow to deep,\nnaturally uniting as one, *Kan* and *Li* in conjugal harmony.\n\nWhen *Yinghuo* guards the west and *Taibai* traverses the heavens,\n*wu* aligns with *you*, and the great fire descends upon *wu*—\nprecisely the long-day *Huo* star, marking the mid-summer moment of the first yin.\nYin governs the withering and killing; all things retreat and withdraw.\nAt this time, the yin tally stills the fire.\nThe adept understands the mechanism of *zi* and *wu*—one yin, one yang—\ncommanding the metal tiger to restrain the wood dragon,\npreventing it from taking flight, like the dog guarding the rat,\nlike the crow fearing the hawk—each fulfilling its function.\n\nThis chapter reveals the subtle principle of yang fire and yin tally.\nWithout grasping its truth, one speaks in vain,\nexhausting family wealth, leaving wife and children hungry and poor.\nFrom ancient times to now, countless have pursued this path,\nyet few have met with success, and rarer still are those who achieve it.\nSeeking famous medicines far and wide only strays from the Dao.\nIf one truly encounters it and perceives its beginnings,\ncomparing like to like and measuring things from start to finish,\nthen the Way may be attained.",
      "overlap_context": "ating fire;\nif fire arises and disaster erupts, it will surely be overcome—\nhence the later statement that metal chops down wood’s flourishing.\n\n*Li* obtains the *Kun* line as the mother’s way,\nresiding in the south to govern summer, taking nurturance as its duty—\nthus it is called the compassionate mother nurturing.\n*Kan* obtains the *Qian* line as the father’s way,\nresiding in the north to govern winter, taking severity as its essence,\nusing harm as kindness—thus it is called the stern father.",
      "start_char": 10943,
      "end_char": 11352,
      "start_sentence": 716,
      "end_sentence": 742,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.14546823501587,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "五行相克，更为父母。 母含滋液，父主禀与。 凝精流形，金石不朽。 审专不泄，得为成道。 立竿见影，呼谷传响。 岂不灵哉，天地至象。 若以野葛一寸、巴豆一两，入喉辄僵，不得倪仰。 当此之时，虽周文揲蓍，孔丘占象，扁鹊操针，巫咸扣鼓，安能令苏#34，复起驰走？ 五行相克，谓金见水则金衰，木见火则木克。 更为父母者，木本生火，火乃孕木； 金本生水，水乃胞金是也。 母含滋液，父主禀与，见阳禀阴受注。 河上女，灵而最神。 得火则飞，不见埃尘。 鬼隐龙匿，莫知所存。 将欲制之，黄芽为根。 离为女，位在午野，属周分三河，故日河上女。 立名定象，岂苟乎哉？ 离火生则祸发铃克，谕人之性动，不以正则散乱失其本真，所谓出入莫知其乡也。 如朱砂中有汞，见火则飞走无踪矣。 近取诸身，远取诸物，其理一也。 此与太阳流珠一章同义。 流珠，即女，离中火是 也。 黄芽，即金华，坎中金是也。 此章言药物。 物无阴阳，违天背元#35。 牝鸡#36自卵，其雏不全。 夫何故乎？ 配合未连，三五不交，刚柔离分。 施化之精，天地自然。 犹火动而炎上，水流而润下。 非有师道#37，使其然者复改。 观夫雌雄，交垢#38之时； 刚柔相结，而不可解； 得其节符，非有工巧，以制御之。 若男生而伏，女偃其躯； 禀乎胞胎，受炁元初； 非徒生时，着而见之； 及其死也； 及其死也； 亦复效之。 此非父母，教令其然，本在交姤，制定始先。 言独阴不成亦出自然，独阳不成。 坎离之合，亦出自然，非人力强使之然也。 坎男为月，离女为日。 日以施德，月以舒光。 月受日化，体不亏伤。 阳失其契，阴侵其明。 晦朔薄蚀，奄冒相包。 阳消其形，阴陵生灾#39。 男女相须，含吐以滋。 雄雌交#40。 以类相求。 金化为水，水性周章。 火化为土，水不得行。 故男动外施，女静#41内藏。 溢度过节，为女所拘。 魄以检魂，不得淫奢。 不寒不暑，进退合时。 各得其和，俱吐证符。 以日月、男女、雌雄明配合之象，失其符则为薄蚀也。 金化为水，水性同章者，金中生水，欲克离火，然离火生土．又克水，使水降伏不动也。 男动外施，女动内藏者，与阳禀阴受同义。 魄以检魂，情卫性，金制木也。 不得淫奢者，性不化情也。 不寒不暑，进退合时者，不失阴阳分至之候，进火息符，皆合节度，故各吐证符。 丹砂木精，得金乃并。 金水合处，木火为侣。 四者混沌，列为龙虎。 龙阳数奇，虎阴数偶。 肝青为父，肺白为母。 肾黑为子，脾黄为祖。 三物一家，都归戊已。 四象合而归戊己，见前注。 已上并论交姤。 刚柔迭兴，更历分部。 龙西虎东，建纬卯酉。 刑德并会，相见欢喜。 刑主伏杀，德主生起。 二月榆死，□临於卯。 八月麦生，天呈据酉。 子南午北，互为纲纪。 九一之数，终则复始。 含元虚危，播精於子。 阳长则阴消，阴消则阳长，刚柔迭兴也。 二十八宿主十二辰，遍历十二 分野，更历分部也。 龙位东而临西，虎位西而临东，卯酉相加，故日龙西虎东也。 《龙虎经》云：南北为经，则知卯酉为纬矣。 故日建纬卯酉。 卯为德，主生； 酉为刑，主杀； 卯酉相加，生中有杀，杀中有生。 故二月检落，戌中辛临乙也；",
      "translated_text": "The Five Phases restrain one another, each in turn becoming father and mother.\nThe mother contains the nourishing fluid, the father governs bestowal and endowment.\nEssence congeals and form flows—metal and stone do not decay.\nWith careful focus and no leakage, one may attain the Way of completion.\nErect a pole and see its shadow; call into the valley and hear its echo—\nhow can this not be numinous? It is the supreme image of Heaven and Earth.\n\nYet if one takes a mere inch of *yege* or a single ounce of *badou*,\nswallowing brings instant collapse, leaving one unable to turn or lift.\nAt such a moment, even if King Wen were casting milfoil stalks,\nConfucius interpreting omens, Bian Que wielding his needles,\nor Wu Xian beating his drum—\nhow could they revive the fallen or restore them to swift movement?\n\nThe Five Phases restraining one another means:\nwhen metal encounters water, metal weakens;\nwhen wood encounters fire, wood is overcome.\n\"Each in turn becoming father and mother\" refers to:\nwood originally giving birth to fire, and fire then gestating wood;\nmetal originally giving birth to water, and water then nurturing metal.\n\nThe mother contains the nourishing fluid, the father governs bestowal and endowment—\nthis shows yang endowing and yin receiving.\nThe Maiden by the River is numinous and most divine.\nWhen she obtains fire, she takes flight, leaving no trace of dust.\nGhosts conceal themselves, dragons hide—none know where they abide.\nShould one wish to restrain her, the Yellow Sprout becomes the root.\n\n*Li* is the Maiden, positioned in the *wu* wilds,\nbelonging to the Zhou division of the Three Rivers—hence \"Maiden by the River.\"\nIs the naming and fixing of images done carelessly?\nWhen the fire of *Li* is born, calamity arises and restraint is broken—\nthis illustrates how human nature, when stirred,\nif not aligned with the proper, scatters and loses its original truth,\nso that \"entering and exiting, none know its direction.\"\nLike mercury within cinnabar—when exposed to fire, it flees without a trace.\n\nWhether drawing near from the body or far from things,\nthe principle is one and the same.\nThis aligns with the chapter on \"The Flowing Pearl of Great Yang.\"\nThe Flowing Pearl is the Maiden, the fire within *Li*.\nThe Yellow Sprout is Golden Flower, the metal within *Kan*.\n\nThis chapter speaks of medicinal substances.\nThings devoid of yin and yang defy Heaven and contravene the Origin.\nA hen hatching alone—her chicks will not be whole.\nWhy is this so?\nThe union was not complete; the Three and Five did not merge;\nhard and soft remained apart.\nThe essence of transformation is the natural process of Heaven and Earth—\nlike fire rising when stirred, like water flowing downward to moisten.\nIt is not some mastered method that compels this, only to change it later.\n\nObserve the mating of male and female in their union—\nhard and soft intertwine, inseparable.\nWhen the proper timing aligns, it is not through craft or artifice that they are governed.\nWhen a boy is born, he lies prone; when a girl is born, she lies supine—\nendowed in the womb, receiving qi from the primal beginning.\nThis is not merely visible at birth;\neven in death, they replicate it.\nIt is not that parents teach them to do so—\nthe pattern was set at the moment of union, determined from the very start.\n\nTo say that solitary yin cannot complete, or solitary yang cannot complete,\nis also natural.\nThe union of *Kan* and *Li* likewise arises naturally,\nnot through human effort forcing it to be so.\n*Kan* as the male is the moon; *Li* as the female is the sun.\nThe sun bestows virtue; the moon unfurls its light.\nThe moon receives the sun’s transformation, its body unharmed.\nIf yang loses its bond, yin encroaches upon its brightness.\nAt the dark and new moons, they press close, enveloping one another.\nYang’s form diminishes; yin’s encroachment brings calamity.\n\nMale and female depend on one another, inhaling and exhaling to nourish.\nMale and female unite in congress, seeking their kind.\nMetal transforms into water, water’s nature circulating freely.\nFire transforms into earth, blocking water’s flow.\nThus the male moves and bestows outwardly; the female is still and stores within.\nIf overflowing exceeds the proper measure, she becomes constrained.\nThe *po* restrains the *hun*, preventing excess and extravagance.\nNeither cold nor hot, advancing and retreating in timely accord—\neach attains harmony, both emitting confirming signs.\n\nWith the sun and moon, male and female, yin and yang—\nthe image of their union is made clear.\nLosing their bond results in obscuration and eclipse.\n\"Metal transforms into water, water’s nature circulating freely\" means:\nwater born within metal seeks to overcome the fire of *Li*,\nbut the fire of *Li* generates earth, which in turn overcomes water,\ncausing water to submit and remain still.\n\n\"Male moves and bestows outwardly; female is still and stores within\"—\nthis shares the same meaning as yang endowing and yin receiving.\n\"The *po* restrains the *hun*\"—emotion guards nature, metal restrains wood.\n\"Not permitting excess and extravagance\"—nature is not transformed by emotion.\n\"Neither cold nor hot, advancing and retreating in timely accord\"—\nnot losing the solar terms of yin and yang’s division,\nadvancing fire and ceasing tally all align with proper measure,\nthus each emits confirming signs.\n\nCinnabar, the essence of wood, unites with metal to merge.\nWhere metal and water combine, wood and fire become companions.\nThe four intermingle in chaos, arrayed as dragon and tiger.\nThe dragon’s yang number is odd; the tiger’s yin number is even.\nThe liver, green, is the father; the lungs, white, are the mother.\nThe kidneys, black, are the child; the spleen, yellow, is the ancestor.\nThree things form one household, all returning to *wu* and *ji*.\n\nThe four images unite and return to *wu* and *ji*—see previous notes.\nThe above all discuss union.\nHard and soft alternate in ascent, traversing the divisions in turn.\nThe dragon in the west, the tiger in the east—\nestablishing the weft at *mao* and *you*.\nPunishment and virtue converge, meeting in joy.\nPunishment governs submission and killing; virtue governs generation and ascent.\n\nIn the second month, the elm withers as *yin* approaches *mao*.\nIn the eighth month, wheat sprouts as Heaven’s *yang* occupies *you*.\nNorth at *zi*, south at *wu*—each serves as the other’s guiding principle.\nThe numbers nine and one cycle endlessly, beginning anew.\nEmbracing the primal in *xu* and *wei*, scattering essence at *zi*.\nWhen yang grows, yin diminishes; when yin diminishes, yang grows—\nhard and soft alternate in ascent.\nThe twenty-eight constellations govern the twelve earthly branches,\ntraversing the twelve celestial divisions—this is \"traversing the divisions in turn.\"\n\nThe dragon’s position is east yet faces west; the tiger’s position is west yet faces east—\n*mao* and *you* intersect, hence \"the dragon in the west, the tiger in the east.\"\nThe *Dragon-Tiger Classic* states: \"North and south form the warp,\"\nthus we know *mao* and *you* form the weft—hence \"establishing the weft at *mao* and *you*.\"\n*Mao* is virtue, governing generation;\n*you* is punishment, governing killing.\n*Mao* and *you* intersect—within generation lies killing, within killing lies generation.\nThus in the second month, the elm falls as *xin* in *xu* approaches *yi*...",
      "overlap_context": "iple of yang fire and yin tally.\nWithout grasping its truth, one speaks in vain,\nexhausting family wealth, leaving wife and children hungry and poor.\nFrom ancient times to now, countless have pursued this path,\nyet few have met with success, and rarer still are those who achieve it.\nSeeking famous medicines far and wide only strays from the Dao.\nIf one truly encounters it and perceives its beginnings,\ncomparing like to like and measuring things from start to finish,\nthen the Way may be attained.",
      "start_char": 11352,
      "end_char": 12610,
      "start_sentence": 743,
      "end_sentence": 837,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.62874674797058,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "八月麦生，辰中乙临辛也。 卯既在酉，自然子在南，午在北，故日子南午北，互为纲纪。 《龙虎经》所谓张翼飞虚危是也。 惟张紫阳深明此义，故有八月十五玩蟾辉，正是金精壮盛时之诗。 且八月十五仲秋之中，乃宵中星虚，以殷仲秋之时； 夜半虚危之宿，正当星张之位，子南午北，龙西虎东，刑德并会，天地反覆，金水盛满，药体纯乾之时也。 九一之数，终而复始，坎一加离九，九复加一，相为终始。 继之日含元虚危，播精於子者，午火受胎於子，以午加子，故日含元虚危也。 坎水播施中爻纯粹之精於离，以子加午，故日播精於子也。 此章言药体纯乾。 关关雎鸠，在河之洲。 窈窕淑女，君子好逑。",
      "translated_text": "In the eighth month, wheat sprouts—*chen* holds *yi* as *xin* approaches *xin*.\n\nSince *mao* now resides in *you*,\nnaturally *zi* lies in the south and *wu* in the north—\nhence \"the south of *zi*, the north of *wu*,\" each serving as the other’s guiding principle.\nThis is what the *Dragon-Tiger Classic* calls \"Wings Spread, Flying Void-Danger.\"\n\nOnly Master Zhang Ziyang deeply grasped this meaning,\nthus his poem on the fifteenth night of the eighth month,\nplaying beneath the toad’s radiance—\nprecisely when the metal essence stands in full vigor.\n\nMoreover, the fifteenth of the eighth month marks mid-autumn,\nwhen the midnight star *Xu* governs the season’s center.\nAt the hour when *Xu* and *Wei* lodge in the sky,\nthey align with the position of *Zhang*’s stars—\n*zi* south and *wu* north,\nthe dragon west and the tiger east,\npunishment and virtue converging,\nheaven and earth overturned,\nmetal and water brimming,\nthe elixir body in pure yang.\n\nThe numbers nine and one complete and begin anew:\n*Kan*’s one joins *Li*’s nine,\nthen nine returns to join one,\neach ending where the other begins.\n\nFollowing this, \"containing primal *Xu-Wei*, sowing essence in *zi*\"—\nthe *wu* fire receives conception in *zi*,\nfor *wu* is placed upon *zi*,\nhence \"containing primal *Xu-Wei*.\"\nThe *Kan* water scatters the pure essence of the central line into *Li*,\nas *zi* is placed upon *wu*—\nhence \"sowing essence in *zi*.\"\n\nThis passage speaks of the elixir body in pure yang.\n\n*Guan guan* cry the ospreys,\non the river’s isle.\nLovely and refined the maiden—\nthe noble man’s fine match.",
      "overlap_context": " faces east—\n*mao* and *you* intersect, hence \"the dragon in the west, the tiger in the east.\"\nThe *Dragon-Tiger Classic* states: \"North and south form the warp,\"\nthus we know *mao* and *you* form the weft—hence \"establishing the weft at *mao* and *you*.\"\n*Mao* is virtue, governing generation;\n*you* is punishment, governing killing.\n*Mao* and *you* intersect—within generation lies killing, within killing lies generation.\nThus in the second month, the elm falls as *xin* in *xu* approaches *yi*...",
      "start_char": 12610,
      "end_char": 12883,
      "start_sentence": 838,
      "end_sentence": 849,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.859955787658691,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "雄不独处，雌不孤居。 玄武龟蛇，蟠蚪#42相扶。 以明牝牡，毕竟相须#43。 假使二女共室，颜色甚妹。 令苏秦通言，张仪结媒。 发辩#44利舌，奋舒美辞。 推心调谐，使为夫妻。 弊发腐齿，终不相知。 若药物非种，名类不同。 分剂参差，失其纪纲。 虽黄帝临炉，太乙#45降坐，八公梼炼，淮南执火，立宇崇坛，玉为阶陛，麟脯凤腊，把籍长跪，祝章#46神祇，请哀诸鬼，沐浴斋戒，冀有所望，亦犹和胶补釜，以钢#47涂疮，去玲加冰，除热用汤，飞龟舞蛇，愈见乖张。 言阴叉资阳，重发《关维》建始初之义。 周易参同契卷中竟 #1『喻』，原作『论』，据其文义改。 #2『善』，原脱，据《考异》本补。 #3『施令』，《考异》本作『出令』。 #4『埃时』，《考异》本作『俟时』。 #5『卦月』，《考异》本作『卦日』。 #6『以』，据上文义例补。 #7『守界』，《考异》本作『守戒』。 #8『散发』，《考异》本作『发散』。 #9『阳气』，《考异》本作『阳黑』。 #10『 』，原脱，据（考异》本补。 #11『艮主』，原作『艮止』，据《考异》本改。 #12『规矩』，原作『规矩』，据《考异》本改。 后文凡『规』字径改为『规』字。 #13『难可察睹』，《考异》本作『难得察睹』。 #14『黎黑』，《考异》本作『黎蒸』。 #15『刚』，原作『副』，据《考异》本改。 #16『使列』，《考异》本作『侠列』。 #17『埃时』，《考异》本作『俟时』。 #18『塞』，《考异》本作『闭』。 #19『芽药』，《考异》本作『牙药』。 #10『玄幽远眇』，《考异》本作『玄远幽渺』。 #21『千载』，《考异》本作『千秋』。 #22『因黑』，《考异》本作『因气』。 #23『七返』，《考异》本作『七反』。 #24『相扶』，《考异》本作『相符』。 #25『铅』，《考异》本作『铋』。 #26『黑』，《考异》本作『气』。 #27『浸』，《考异》本作『丧』。 #28『芸锄』，《考异》本作『耘锄』。 #29『投水』，《考异》本作『没水』。 #30『教勃』，《考异》本作『教饬』。 #31『贪荣』，《考异》本作『贪便』。 #32『遂相』，《考异》本作『逐相」。 #33『喷咽』，《考异》本作『衔咽』。 后文底本『喃』字，《考异》本仍作『衔』。 #34『令苏』，《考异》本作『令苏』。 #35『背元』，《考异》本作『背原』。 #36『牝鸡』，《考异》本作『肥鸡」。 #37『师道』，《考异》本作『师导』。 #39『阴陵生灾』，《考异》本『陵』字作『凌』，『生灾』作『灾生』。 #40『交换』，《考异》本作『交杂』。 #41『女静』，原作『女动』，据《考异》本改。 后文底本仍作『女动』者，不复改动。 #42『蟠蚪』，《考异》本作『盘纠』。 #43『相须』，《考异》本作『相胥』。 #44『发辩』，《考异》本作『发辨』。 #45『太乙』，《考异》本作『太一』。 #46『祝章』，《考异》本作『梼祝』。 #47『以钢』，《考异》本作『以茵』。 周易参同契卷下 储华谷注",
      "translated_text": "The male does not dwell alone,\nnor does the female reside in solitude.\nThe Dark Warrior—tortoise and serpent—\ncoil and intertwine in mutual support.\nThus it is made clear: yin and yang,\nin the end, must depend on one another.\n\nWere two women to share a chamber,\ntheir beauty as sisters,\nthough Su Qin were to mediate,\nZhang Yi to broker the match,\ntheir eloquence sharp as blades,\ntheir words sweet and persuasive,\ntheir hearts laid bare in perfect harmony,\nurging them to wed—\nyet with hair grown brittle and teeth decayed,\nthey would never truly know one another.\n\nIf the ingredients are not of the same kind,\ntheir names and categories disparate,\ntheir measures mismatched,\ntheir principles lost—\nthough the Yellow Emperor himself tend the furnace,\nthe Great One descend to his seat,\nthe Eight Lords invoke and refine,\nHuainan grasp the flame,\npavilions raised and altars exalted,\nsteps and terraces of jade,\nunicorn jerky and phoenix cured meat offered,\nregisters held in long obeisance,\nprayers and petitions to the gods,\npleas to the mournful dead,\nbathing and fasting in purification,\nall in hope of some result—\nit would be no different than mending a cauldron with glue,\nor smearing a wound with bronze,\nadding ice to frost,\nor curing heat with boiling water.\nFlying turtles and dancing serpents\nwould only appear more perverse.\n\nThis speaks of yin relying on yang,\nreiterating the opening meaning of *Guan Ju*:\nthe union of male and female.\n\n*Thus concludes the middle scroll of the* Zhouyi Cantong Qi. *(The character* 喻 *was originally* 论*, emended here according to the sense of the text.)*",
      "overlap_context": "here the other begins.\n\nFollowing this, \"containing primal *Xu-Wei*, sowing essence in *zi*\"—\nthe *wu* fire receives conception in *zi*,\nfor *wu* is placed upon *zi*,\nhence \"containing primal *Xu-Wei*.\"\nThe *Kan* water scatters the pure essence of the central line into *Li*,\nas *zi* is placed upon *wu*—\nhence \"sowing essence in *zi*.\"\n\nThis passage speaks of the elixir body in pure yang.\n\n*Guan guan* cry the ospreys,\non the river’s isle.\nLovely and refined the maiden—\nthe noble man’s fine match.",
      "start_char": 12883,
      "end_char": 14225,
      "start_sentence": 850,
      "end_sentence": 913,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.34975266456604,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "惟昔圣贤，怀玄抱真。 服炼九鼎隐沦。 含精养神，通德三元。 精液凑理，筋骨致坚。 众邪辟除，正气#1长存。 累积长久，变形而仙。 忧悯后生，好道之伦。 随傍风采，指画古文。 着为图籍，开示后昆。 露见枝条，隐藏本根。 托号诸石，覆冒众文。 学者得之，韫匮#2终身。 子继父业，孙踵祖先。 传世迷惑，竟无见闻。 遂使宦者不遂，农夫失芸#3，商人弃货，志士家贫。 吾甚伤之，定录斯文。 字约易思，事省不烦。 披列其条。 实核可观。 分两有数，因而相循。 故为乱辞思，孔窍其门。 智者审思．以意参焉。 九鼎者，金鼎也。 九在洛书成数为金，九为乾金阳数。 鼎者，金之室也。 此章首言药。 法象莫大乎天地兮，互沟#4数万里。 河鼓临星纪兮，人民皆惊骇。 晷景妄前却兮，九年被凶咎。 皇上览阮之兮，王者退自改。 关键有低昂兮，害黑遂奔走。 江淮之枯竭兮，水流注於海。 天地之雌雄兮，徘徊子与午。 寅申阴阳祖兮，出入复终始。 循斗而招摇兮，执衡定元纪#5。 鼎之与器，法象乾坤。 互沟者，阴阳界限，如鼎器交互相接之所，言金木问隔如天地相去何止数万里之远，所以使之合者道也。 河鼓临星纪者，火临金位而逼金也。 谓离当居下，而反居上，离性炎上，水火未济，不能翕受坎中乾金，违龙低虎昂之旨，失其关键，故刚柔抗行，不相涉入，使真药奔散四出，故日人民皆惊骇。 人民，谕药物也。 《悟真篇》虎称岩头龙称海，底火在下金在上也。 前篇云炎火张於下，又日下有太阳无，其法度高下显然可见矣。 晷景妄前却者，晷景乃进火退火时刻也。 若进退失节，不当前而妄前，不当却而妄却，则九年之水为凶咎矣。 此即二至改度，二分纵横，则水旱相伐，山崩地裂是也。",
      "translated_text": "Here follows the translation:\n\nOnly the sages and worthies of old\nembraced the mysterious and held fast to the true.\nThey ingested and refined the Nine Cauldrons, concealed in reclusion,\ncontained essence and nurtured spirit,\ncommuned with virtue through the Three Origins.\nEssence and fluid converged in the textures,\nsinews and bones grew firm.\nAll perverse influences were dispelled,\nand the upright qi endured ever after.\nThrough long and patient accumulation,\nthey transformed their forms and ascended as immortals.\n\nMoved by compassion for later generations,\nthose who loved the Dao,\nthey followed the winds of influence,\ntraced and sketched the ancient texts,\ncomposed them into illustrated works,\nand revealed them to posterity.\nYet they exposed only the branches,\nconcealing the root.\nThey entrusted them to various stones,\nveiled them beneath layers of texts.\nScholars who obtained them\nhoarded them in secrecy all their lives.\nSons inherited their fathers’ work,\ngrandsons followed their ancestors’ path.\nTransmitted through generations in confusion,\nnone ever gained true insight.\nThus officials failed in their careers,\nfarmers neglected their plowing,\nmerchants abandoned their goods,\nand men of resolve fell into poverty.\n\nI grieve deeply for this,\nand so set down these writings in order.\nThe words are concise and easy to ponder,\nthe matters few and free of clutter.\nI lay out their principles in sequence,\nsubstantial and verifiable to behold.\nWeights and measures are precise,\neach following in due succession.\n\nThus I compose these disordered verses,\nopening the gates through their apertures.\nLet the wise examine and reflect,\nand weigh them with their own understanding.\n\nThe Nine Cauldrons are cauldrons of metal.\nIn the *Luoshu*, nine is the completed number of metal,\nand nine is the yang number of Qian-metal.\nThe cauldron is the chamber of metal.\n\nThis chapter first speaks of the medicine.\nNo model is greater than Heaven and Earth—\ntheir mutual boundary spans tens of thousands of miles.\nWhen the River Drum approaches the Stellar Enclosure,\nthe people are all seized with terror.\nThe shadow’s reckless advance and retreat\nbring nine years of calamity.\nThe August Emperor, beholding the portents of Ruin,\nthe king retreats and reforms himself.\nThe key has its rises and falls,\nand the black harm flees in haste.\nWhen the Yangzi and Huai run dry,\ntheir waters pour into the sea.\n\nThe female and male of Heaven and Earth\nrevolve between *zi* and *wu*.\n*Yin* and *shen* are the ancestors of yin and yang,\nissuing and entering, returning to their beginning.\nFollowing the Dipper’s handle in its sweep,\ngrasping the balance to fix the primal order.\n\nThe cauldron and the vessel\nmodel Qian and Kun.\nThe mutual boundary is the division of yin and yang,\nlike the place where cauldron and vessel join and meet.\nIt speaks of the separation between metal and wood,\nas distant as Heaven and Earth—\nhow many tens of thousands of miles apart?\nOnly the Dao can bring them together.\n\nWhen the River Drum approaches the Stellar Enclosure,\nfire presses upon the metal position, threatening metal.\nThis means *li* should reside below,\nyet instead it rises above.\nThe nature of *li* is to flame upward,\nwater and fire unbalanced,\nunable to embrace the Qian-metal within *kan*,\nviolating the principle of the dragon’s descent and the tiger’s ascent.\nLosing the key,\nhard and soft resist each other,\nfailing to interpenetrate.\nThe true medicine scatters in all directions—\nhence the people are seized with terror.\nThe people symbolize the medicinal substances.\n\nThe *Wuzhen Pian* says:\n“The tiger is called the cliff’s head, the dragon the sea.”\nThe fire lies below, the metal above.\nThe preceding section states:\n“The blazing fire spreads below,”\nand again:\n“Below, there is no Great Yang.”\nThe method’s highs and lows are clearly evident.\n\nWhen the shadow recklessly advances or retreats,\nthe shadow marks the timing of advancing and withdrawing fire.\nIf the rhythm is lost—\nadvancing when it should not,\nretreating when it should not—\nthen nine years of water bring calamity.\nThis is like the solstices altering their degrees,\nthe equinoxes shifting their alignments,\ncausing floods and droughts to contend,\nmountains to collapse and the earth to split.",
      "overlap_context": " of some result—\nit would be no different than mending a cauldron with glue,\nor smearing a wound with bronze,\nadding ice to frost,\nor curing heat with boiling water.\nFlying turtles and dancing serpents\nwould only appear more perverse.\n\nThis speaks of yin relying on yang,\nreiterating the opening meaning of *Guan Ju*:\nthe union of male and female.\n\n*Thus concludes the middle scroll of the* Zhouyi Cantong Qi. *(The character* 喻 *was originally* 论*, emended here according to the sense of the text.)*",
      "start_char": 14225,
      "end_char": 14899,
      "start_sentence": 914,
      "end_sentence": 958,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.50577974319458,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "王者知其失而改正之，合关键之低昂，五熙顺序，贼害乖戾之熙奔走远去，江淮之水自然朝宗于海，药物归元矣。 天地之雌雄，徘徊子与午者，坎男离女之真阴真阳也。 寅申阴阳祖者，谓阴符阳火祖於寅、申也。 纳甲图月出震庚，阳爻初动，阳火祖之； 月喊巽辛，阴爻初变，阴符祖之。 先天卦震居寅位，巽在申位，所以定二至，故寅申为阴阳祖也。 月出寅而入申，入而复出，故日出入复终始。 循斗极运转，以定纳甲火候，故日执衡定元纪。 元星君、纪星君，斗中星名也。 夫河鼓临星纪，人民皆惊骇，言不合法度，药物散失也。 晷景妄前却，九年被凶咎，言不循火候，水失其性也。 关键有低昂，言改正其失，允合法度，害熙奔走，灾沙消也。 江淮之枯竭，水流注於海，言合法度，循火候，而药物归元也。 子午言药物，寅申言火侯，循斗以用寅申之否泰朝昏也。 宜详味之。 此章详论交娠法度，末论火候。 升熬於饭山兮，炎火张设下。 白虎倡导前兮，苍液和於后。 朱乌翱翔戏兮，飞扬色五采。 遭遇罗网施兮，压之不得举。 嗷嗷声甚悲兮，如婴儿慕母。 颠倒就汤擭兮，摧折伤毛羽。 漏刻未过半兮，龙鳞狎猎起。 五色象炫耀兮，变化无常主。 橘橘鼎沸驰兮，暴涌不休止。 杂沓重迭累兮，犬牙相错拒。 形如仲冬冰兮，阑干吐锺乳。 崔鬼以杂厕兮，交积#6相支拄#7。 ｀阴阳得其配兮，淡泊自相守。 青龙处房六兮，春华震东卯。 白虎在勖七兮，秋芒兑西酉。 朱雀在张二兮，正阴#8离南午。 三者俱来朝兮，家属为亲倡。 本之但二物兮，末乃为三五。 三五并与一兮，都集归一所#9。 治之如上科兮，日数亦取甫。 白虎、苍液，金木也。 朱雀得木则生火，其性飞走； 金既克木，金又挟水以制之，故朱雀如遇网罗，不得飞举。 离火既不得生，复归震木，故龙鳞五色熔耀，震为龙，离为文明也。 犬牙、冬冰、阑干、锺乳，皆真景象。 青龙、白虎、朱雀应前白虎、苍液、朱雀三物，重发其义。 房六、易七、张二亦然。 火生於木，水生於金，举三物则五行在其中矣。 房六、勖七、张二总数三五，此药物也。 言火候亦取三五十五为阳火之数，故日数亦取甫。 龙虎本二物，得火成三五，并水之一为四象，皆归戊己，而混一矣。 凡言火候於前者，铃继言药物交垢。 几言药物交诟於前者，铃继之以火侯。 宜详审之。 此章言交诟景象。 先白而后黄兮，赤色通表裹。 名日第一鼎兮，食如大黍米。 自然之所为兮，非有邪伪道。 山泽气相蒸兮，兴云而为雨。 泥竭乃成尘兮，火灭自为土。 若蘗染为黄兮，似蓝成绿组。 皮革煮为胶兮，够蘗化为酒。 同类易施功兮，非种难为巧。 惟斯之妙术兮，审谛不诳语。 传於亿代后兮，昭然而可考。 焕若星经汉兮，禺如水宗海。 思之务令熟兮，反覆豚上下。 千周集彬彬兮，万遍将可睹。 神明或告人兮，魂灵忽自悟。 探端索其绪兮，必得其门户。 天道无适莫兮，常传与贤者。 离中阴火本白，得铅则黄； 火足丹成，则变为赤色，即色转更为紫也。 赤色通表裹，·乃乾为大赤之义。 黍珠成象，名第一鼎，丹道圆成也。 圣贤立言，皆有法度次序。 此章言火足丹成之象。 五相类 《参同契》者，敷陈梗盘，不得#10纯一，纤微未备，缺略彷佛．。",
      "translated_text": "The sovereign, recognizing these errors and correcting them, aligns the lows and highs of the pivotal mechanism. The five *qi* follow their proper sequence, and the pernicious, rebellious *qi* flee far away. The waters of the Yangtze and Huai naturally flow to pay homage to the sea, and the medicinal substances return to their origin.\n\nThe Heaven and Earth’s female and male—lingering between *zi* and *wu*—are the true yin of *kan*-man and the true yang of *li*-woman. The *yin* and *yang* ancestors of *yin* and *shen* refer to the *yin* tally and *yang* fire originating in *yin* and *shen*. In the *Na Jia* diagram, the moon emerges from *zhen*-*geng*, where the first yang line stirs and the *yang* fire originates; the moon wanes in *xun*-*xin*, where the first yin line transforms and the *yin* tally originates. In the *Prior Heaven* trigrams, *zhen* occupies the *yin* position and *xun* the *shen* position, thus establishing the two solstices. Hence, *yin* and *shen* are the ancestors of *yin* and *yang*. The moon emerges from *yin* and enters *shen*, entering and then re-emerging—thus its rising and setting complete the cycle. Following the turning of the Dipper’s handle, the *Na Jia* fire phases are determined, hence it is said: “grasping the balance to fix the primordial纪.”\n\nThe *Yuan* Star Lord and *Ji* Star Lord are star names within the Dipper. When the *River Drum* approaches the *Star Ji*, the people are seized with terror—this speaks of failing to adhere to the method’s measures, causing the medicinal substances to scatter. When the shadow recklessly advances or retreats, nine years bring calamity—this speaks of not following the fire phases, causing water to lose its nature. The pivotal mechanism has lows and highs—this speaks of correcting errors, aligning with the method’s measures, causing pernicious *qi* to flee and disasters to dissipate. The Yangtze and Huai’s drying up, their waters flowing into the sea—this speaks of adhering to the method’s measures, following the fire phases, and the medicinal substances returning to their origin. *Zi* and *wu* refer to the medicinal substances; *yin* and *shen* refer to the fire phases. Following the Dipper’s turning, *yin* and *shen* determine the morning and evening of *pi* and *tai*. This should be carefully pondered.\n\nThis chapter elaborates on the method’s measures for intercourse and concludes with the fire phases.\n\nRising and toasting upon the *Fan* Mountain—\nthe blazing fire spreads below.\nThe White Tiger leads the way—\nthe Azure Fluid harmonizes behind.\nThe Vermilion Bird soars and plays,\nits flying radiance displaying five hues.\nSuddenly, it encounters a net cast—\npressed down, it cannot rise.\nIts wailing cries are mournful,\nlike an infant longing for its mother.\nOverturned and plunged into boiling water,\nits feathers and wings are crushed and broken.\nBefore half the clepsydra’s mark has passed,\nthe dragon’s scales stir restlessly.\nFive-colored images dazzle,\ntransforming without constant master.\nThe cauldron seethes and surges,\nviolently surging without cease.\nJumbled and layered in piles,\nlike interlocking canine teeth.\nIts form like midwinter ice,\nrailing-like stalactites sprout.\nTowering and tangled,\ncrossing and propping one another.\n\nWhen yin and yang find their match,\nthey settle in tranquil mutual embrace.\nThe Green Dragon dwells in *Fang*-six—\nspring blossoms in *zhen*-east-*mao*.\nThe White Tiger resides in *Xu*-seven—\nautumn’s awns in *dui*-west-*you*.\nThe Vermilion Bird is in *Zhang*-two—\ntrue yin in *li*-south-*wu*.\nAll three come to pay homage,\ntheir families forming a chorus of kinship.\nOriginally but two substances—\nin the end, they become three and five.\nThree, five, and one together—\nall gather in one place.\n\nRefine them according to the above method,\nand the days’ count also follows accordingly.\nThe White Tiger and Azure Fluid are metal and wood. The Vermilion Bird, receiving wood, generates fire—its nature is to fly and flee. Metal, having overcome wood, further restrains it with water, so the Vermilion Bird, as if caught in a net, cannot take flight. The *li* fire, unable to generate, returns to *zhen* wood—hence the dragon’s scales shimmer in five colors. *Zhen* is the dragon, *li* is radiance.\n\nCanine teeth, winter ice, railings, and stalactites—all are true images. The Green Dragon, White Tiger, and Vermilion Bird correspond to the earlier White Tiger, Azure Fluid, and Vermilion Bird, reiterating their significance. *Fang*-six, *Xu*-seven, and *Zhang*-two are likewise reiterated. Fire is born of wood, water of metal—by mentioning these three, the Five Phases are encompassed. *Fang*-six, *Xu*-seven, and *Zhang*-two sum to three and five—these are the medicinal substances. The fire phases also take three, five, and fifteen as the count for *yang* fire, hence it is said: “the days’ count also follows accordingly.” The Dragon and Tiger, originally two substances, with fire become three and five. Together with water’s one, they form the Four Images, all converging in *wu* and *ji* to merge as one.\n\nWhenever fire phases are discussed earlier, medicinal intercourse invariably follows. Whenever medicinal intercourse is discussed earlier, fire phases invariably follow. This should be carefully examined.\n\nThis chapter describes the images of intercourse.\n\nFirst white, then yellow—\nred permeates inside and out.\nNamed the First Cauldron,\nits grains like great millet.\nThis is nature’s doing,\nnot some devious path.\nMountains and marshes’ *qi* steam,\ngiving rise to clouds and rain.\nDried mud becomes dust—\nextinguished fire turns to earth.\nLike the *nie* dye turning yellow,\nor indigo forming green silk.\nHides boiled into glue,\nor *gou* fermenting into wine.\nKindred substances easily work upon one another—\nunrelated kinds are difficult to craft.\nOnly this wondrous art,\nexamined and verified, speaks no falsehood.\nTransmitted to a hundred million generations hence,\nit shines clearly and can be studied.\nBright as the starry Han,\ndeep as the sea’s source.\nPonder it until thoroughly familiar,\nrepeatedly turning it over.\nAfter a thousand cycles, it gathers in brilliance—\nafter ten thousand repetitions, it becomes visible.\nThe divine may reveal it to one,\nor the soul suddenly awaken.\nProbe its beginnings, seek its threads—\nyou will surely find its gate.\nThe Dao of Heaven favors none—\nit is always transmitted to the worthy.\n\nThe fire within *li* is originally white; receiving lead, it turns yellow. When the fire is sufficient and the elixir is formed, it changes to red—then the color shifts further to purple. Red permeating inside and out embodies *qian* as great red. The millet-pearl takes form, named the First Cauldron—this is the completion of the elixir path. The sages’ and worthies’ words all follow methodical order.\n\nThis chapter describes the image of the elixir’s completion when the fire is sufficient.\n\nThe *Five Phases’ Mutual Generation* and the *Cantong Qi* expound broadly but do not achieve purity. Minute details remain unaddressed, leaving gaps and approximations.",
      "overlap_context": "n:\n“Below, there is no Great Yang.”\nThe method’s highs and lows are clearly evident.\n\nWhen the shadow recklessly advances or retreats,\nthe shadow marks the timing of advancing and withdrawing fire.\nIf the rhythm is lost—\nadvancing when it should not,\nretreating when it should not—\nthen nine years of water bring calamity.\nThis is like the solstices altering their degrees,\nthe equinoxes shifting their alignments,\ncausing floods and droughts to contend,\nmountains to collapse and the earth to split.",
      "start_char": 14899,
      "end_char": 16148,
      "start_sentence": 959,
      "end_sentence": 1033,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.09460520744324,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "今更撰录，补塞遗脱，润色幽深，钩援相逮，旨意等齐，所趣不悖。 故复作此，命《五相类》，则大《易》之情性尽矣。 五位相得而各有合。 乙浮石丁文火己物辛世银癸真铅三木二火五土四金一水甲沉石丙武火戊药庚世金壬真汞 此洛书先天数也。 大《易》情性，各如其度。 黄老用究，较而可御。 炉火之事，真有所据：三道由一，俱出径路。 黄老之学．出於大《易》，炉火之说据於黄老，三者同出於《易》，皆论情性而已。 枝茎华叶，果实垂布。 正在根株，不失其素。 诚心所言，审而不误。 譬如果木自春而抽茎发枝，至夏而开花布叶，至秋而结果成实，要其发生之源，在於根株，故日正在根株，不失其素。 谓不失其本然之性也。 由交泰壮而至纯乾，其根株正在《复》卦，冬至基之。 还返妙用，无出一阳子时。 圣真所秘，学士但知一阳之用，则《临》、《泰》、《壮》、《夬》自然变化，非假人力，故独以象彼仲冬节一章，表而出之。 此章勾接下文之义，以根株喻冬至，故日：象彼仲冬节，竹木皆摧伤。 谓由春之枝茎而为夏之华叶，由夏之华叶而为秋之果实，皆出於冬月之摧伤。 元熙港藏於根株，受发生於一阳初复之时也。 象彼仲冬节，竹木皆摧伤。 佐阳诂商旅，人君深自藏。 象时顺节令，闭口不用谈。 天道甚浩旷，太玄无形容。 虚寂不可睹，匡郭以消亡。 谬误勿事绪#12，言还自败伤。 别叔#13斯四象，以晓后生盲。 此以冬至发明一阳之机也。 佐阳诂商旅，人君深自藏，即《复》卦之商旅不行，后不省方。 学士不得其纲领，复表而出之，其忧后世也深矣哉。 别叔斯四象，铅汞皆在壬癸。 壬乃乾中之离，癸乃坤中之坎，有旨哉。 此二章专言一阳火候。 刽国#14鄙夫，幽谷朽生。 挟怀朴素，不乐惧荣#15。 栖迟僻陋，忽略令名。 执守恬淡，希时安平。 燕然闲居#16，乃撰斯文。 歌吟#17大《易》，三圣遗言。 察其所趣#18，一统共论。 易晓不注。 务在顺理，宣耀精神。 神化流通，四海和平。 表以为历，万世可循。 序以御政，行之不烦。 引内养性，黄老自然。 含德之厚，归根返元。 近在我心，不离己身。 抱一母舍，可以长存。 配以服食，雌雄设陈。 挺除武都，八石弃捐。 审用成功，世俗所珍。 罗列三条，枝茎相连。 同出异名，皆由一门。 非徒累句，谐偶斯文。 殆有其真，砾略可观。 使余敷伪，却被赘愆。 命《参同契》，微览其端。 辞寡意大，后嗣宜遵。 顺此洛书之理，可使神化流通，四海和平。 表而出之，则可以治历明时。 叔正五行，则可以建极御政，帝王之用也。 引而养性，则归根返元，抱一长存，学士之用也。 委时去害，依托丘山。 循游寥廓，与鬼为邻。 化形而仙，沦寂无声。 百世一下，遨游人问。 陈敷羽翩，东西南倾。 汤遭厄际，水旱隔并。 柯叶萎黄，失其华荣。 吉人相乘负，安稳可长生。 此魏伯阳造四字隐语，见前叔。 鼎器歌 坤为鼎，藏坎； 乾为器，藏离。 分则为乾、坤，合则为鼎器。 圆三五，寸一分。 圆三五，寸一分者，阴阳合则三五归一也。 彭真人所谓辞理钧连也。 圆者，乾、坤会合也。 口四八， 口者，玄牝之门。 出入变化，具四象八卦。 鼎具金水，器具木火。",
      "translated_text": "Here now is the translation, continuing the established conventions:\n\n---\n\nI have therefore compiled and recorded anew, filling gaps and omissions, refining what is profound and obscure, linking threads to ensure coherence, aligning intent and purpose without deviation. Thus I compose this work, naming it *The Five Phases’ Mutual Generation*, wherein the nature and essence of the great *Yi* are fully revealed.\n\nThe Five Positions harmonize, each with its proper union:\n*Yi* floats as stone, *ding* patterns with civil fire, *ji* governs matter, *xin* embodies worldly silver, *gui* is true lead—three woods, two fires, five earths, four metals, one water.\n*Jia* sinks as stone, *bing* blazes with martial fire, *wu* refines the medicine, *geng* embodies worldly gold, *ren* is true mercury.\nThis is the *Luoshu*’s primordial numbering.\n\nThe great *Yi*’s nature and essence each adhere to their measure. The teachings of the Yellow Emperor and Laozi, when examined, may be applied. The work of furnace and fire has true foundation: the Three Ways emerge from One, all following the same path. The learning of the Yellow Emperor and Laozi arises from the great *Yi*; the discourse on furnace and fire is grounded in the Yellow Emperor and Laozi. These three all derive from the *Yi*, each addressing nature and essence alone.\n\nBranches, stems, blossoms, leaves—fruit hangs in abundance. Yet the root remains primary, unchanging in its original state. What is spoken in sincerity is precise and without error. It is like the tree that in spring sends forth stems and branches, by summer opens blossoms and spreads leaves, and by autumn bears fruit—yet the source of its growth lies in the root. Thus it is said: the root remains primary, unchanging in its original state. This means it does not lose its inherent nature.\n\nFrom the flourishing of *Tai* to the purity of *Qian*, the root lies in the *Fu* hexagram, founded at the winter solstice. The wondrous work of return and reversal arises from the single yang of midnight. What the sages and perfected ones kept secret—scholars know only the function of the single yang, yet *Lin*, *Tai*, *Zhuang*, and *Guai* transform naturally, without need of human effort. Thus I single out the image of the midwinter season to reveal it.\n\nThis passage connects to what follows, likening the root to the winter solstice. Thus it says: “Like the midwinter season, bamboo and trees are all broken and harmed.” For the stems and branches of spring become the blossoms and leaves of summer, and the blossoms and leaves of summer become the fruit of autumn—all arising from the midwinter’s breaking and harming. The primordial flourishing lies hidden in the root, receiving its generation at the first return of the single yang.\n\nLike the midwinter season, bamboo and trees are all broken and harmed.\nAssisting yang, merchants and travelers halt; the lord deeply conceals himself.\nFollowing the season’s rhythm, mouths close and words cease.\nThe Dao of Heaven is vast and boundless; the Great Mystery has no form.\nThe empty and still cannot be seen; their boundaries dissolve and vanish.\nPursuing error leads only to ruin; speech returns to self-defeat.\nDistinguish and clarify these Four Images to enlighten later generations of the blind.\n\nHere the winter solstice reveals the mechanism of the single yang. “Assisting yang, merchants and travelers halt; the lord deeply conceals himself” corresponds to the *Fu* hexagram’s “merchants do not travel, the lord does not inspect the regions.” Scholars who fail to grasp the essentials must have this restated—how deep is the author’s concern for later ages! “Distinguish and clarify these Four Images”: lead and mercury both reside in *ren* and *gui*. *Ren* is *li* within *qian*; *gui* is *kan* within *kun*—how profound!\n\nThese two passages focus entirely on the single-yang fire timing.\n\nA rustic from the borderlands, a withered scholar from a secluded valley,\nclinging to simplicity, disdaining glory and honor,\ndwelling in obscurity, heedless of reputation,\nholding fast to tranquility, hoping for peace in his time.\nAt ease in reclusion, he composed this text,\nchanting the great *Yi*, the words of the Three Sages.\nExamining its purport, he found a single thread running through all.\nPlain and clear, it needs no annotation.\nIts purpose is to follow principle and radiate the spirit,\nso that transformation flows freely and the Four Seas know peace.\nSet forth as a calendar, it may be followed for ten thousand generations.\nArranged to guide governance, it may be practiced without burden.\nApplied to nurture nature, it accords with the Yellow Emperor and Laozi’s spontaneity.\nThose who embody virtue deeply return to the root and revert to the origin.\nIt lies near in my heart, not apart from my own body.\nEmbracing the One without release, one may endure forever.\nPaired with ingestion, yin and yang are arrayed.\nRefined cinnabar from Wudu is selected; the Eight Stones are discarded.\nWhen use is precise and success assured, the world treasures it.\nThree paths are laid out, their branches and stems interconnected.\nThough names differ, all emerge from a single gate.\nNot merely piling up lines, this text achieves harmony.\nIt holds true substance; its rough outlines are worth observing.\nIf I were to expound falsely, I would only incur redundancy.\nThus I name it *Cantong Qi*, revealing its subtleties in brief.\nFew words convey great meaning; descendants should heed it.\n\nFollowing the principle of the *Luoshu*, one may cause transformation to flow freely and the Four Seas to know peace. When set forth, it may serve to regulate the calendar and clarify the seasons. When the Five Phases are properly ordered, it may be used to establish the pole and govern the state—this is the emperor’s tool. When applied to nurture nature, it is the return to the root, the embrace of the One for enduring life—this is the scholar’s tool.\n\nAbandoning the times to avoid harm, one takes refuge in the mountains.\nRoaming the vast expanse, one dwells beside ghosts.\nTransforming the body to become immortal, one merges into silence.\nOnce in a hundred generations, one wanders among men,\ndisplaying feathered wings, soaring east, west, south, and north.\nWhen Tang faced adversity, drought and flood divided the land.\nBranches and leaves withered and yellowed, losing their flourishing splendor.\nThe virtuous carry one another’s burdens—secure and stable, they may attain long life.\n\nThis is Wei Boyang’s four-character cipher, as noted earlier.\n\n**Song of the Cauldron and Vessel**\n*Kun* is the cauldron, concealing *kan*;\n*Qian* is the vessel, concealing *li*.\nSeparate, they are *qian* and *kun*; united, they form cauldron and vessel.\nRound three-five, one inch in measure.\n“Round three-five, one inch in measure”: when yin and yang unite, three and five return to one. This is what Peng the Perfected meant by “the coherence of principle and phrasing.” “Round” refers to the union of *qian* and *kun*.\nMouth four-eight.\nThe “mouth” is the Gate of the Mysterious Female. In its entry and exit, transformations manifest the Four Images and Eight Trigrams. The cauldron holds metal and water; the vessel holds wood and fire.",
      "overlap_context": "ifts further to purple. Red permeating inside and out embodies *qian* as great red. The millet-pearl takes form, named the First Cauldron—this is the completion of the elixir path. The sages’ and worthies’ words all follow methodical order.\n\nThis chapter describes the image of the elixir’s completion when the fire is sufficient.\n\nThe *Five Phases’ Mutual Generation* and the *Cantong Qi* expound broadly but do not achieve purity. Minute details remain unaddressed, leaving gaps and approximations.",
      "start_char": 16148,
      "end_char": 17418,
      "start_sentence": 1034,
      "end_sentence": 1117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.96223545074463,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "坤鼎具三男，乾器具三女。 两寸唇。 阴阳二气界分，所谓互沟也。 长尺二#19，厚薄匀。 鼎六阳，器六阴，应十二辰，阴阳均平也。 已上论鼎器交合，药物具足。 腹齐三， 天有腹齐，天之中·见晋《天文志》。 地与人皆有中，乃三才交娠之门户。 在天地为天地之根，在人为玄牝之润。 坐垂温。 阴在上，阳下奔。 此进火法度，使水火既济也。 鼎出一於坤，为阴； 器出於乾，为阳，所谓一上下釜也。 此论探炼法度。 首尾武，中问文。 进火之节。 此论周天火候。 始七十，终三旬。 二百六，善调均。 阴一火白，黄芽铅。 阴精之火本白，见铅而生芽乃黄 两七窍，辅翼人。 白虎七数之鼎，青龙七宿之器，各具一七窍。 两七会合，辅翼而成圣胎也 瞻理脑，定升玄。 胎成则升入上官而就安养。 此论圣胎成象。 子处中，得安存。 来去游，不出门。 富成大，情理纯#20。 却归一，还本源#21。 至一周，甚辛勤。 密防护，莫迷昏。 途路远，复幽玄#22。 若达此，会乾坤。 刀圭沾，诤魄魂#23。 乐道者，寻其根。 审五行，定铢分。 谛思之，不须论。 深藏守，莫传文。 此论保养圣胎。 御白鹤兮，驾龙鳞。 游太虚兮，谒仙君。 受天图兮，号真人。 此论脱胎神化。 赞曰",
      "translated_text": "The *kun*-cauldron holds the Three Male [trigrams],\nThe *qian*-vessel holds the Three Female [trigrams].\nTwo-inch lips—\nYin and yang qi divide at their boundary, the so-called “mutual channel.”\nTwelve inches in length, evenly thick and thin.\nThe cauldron embodies six yang [lines], the vessel six yin [lines],\nCorresponding to the twelve earthly branches, where yin and yang are balanced.\nThe above discusses the union of cauldron and vessel, where medicinal substances are complete.\n\nThe belly aligns at three—\nHeaven has its belly-alignment, the celestial center (as seen in the *Astronomical Treatise* of the *Jin [Dynasty History]*).\nEarth and humanity likewise possess a center, the gate of the Three Powers’ conception.\nIn heaven and earth, it is the root of heaven and earth;\nIn humanity, it is the moisture of the Mysterious Female.\n\nSit and let warmth descend—\nYin above, yang rushing below.\nThis is the method of advancing fire, enabling water and fire to achieve harmony.\n\nThe cauldron emerges from *kun*, as yin;\nThe vessel emerges from *qian*, as yang—\nThe so-called “one upper and lower crucible.”\nThis discusses the method of refining and tempering.\n\nHead and tail in strength, the middle in civility—\nThe rhythm of advancing fire.\nThis discusses the fire-times of the celestial circuit.\n\nBeginning with seventy, ending at three decades.\nTwo hundred and six, well-tempered and balanced.\nYin’s fire is white; the yellow sprout is lead.\nThe fire of yin essence is inherently white; upon encountering lead, the sprout becomes yellow.\n\nTwo sevens’ apertures, assisting and aiding humanity—\nThe White Tiger’s seven-numbered cauldron,\nThe Azure Dragon’s seven-starred vessel,\nEach possessing seven apertures.\nWhen the two sevens unite, they assist and aid in forming the sacred embryo.\n\nGaze upon the brain’s principles, stabilize the ascent of the mysterious—\nOnce the embryo is formed, it ascends into the upper palace for nurturance.\nThis discusses the manifestation of the sacred embryo.\n\nThe child resides at the center, secure and preserved.\nComing and going in roaming, yet never leaving the gate.\nAbundant and fully grown, emotions and principles pure.\nReturning to the One, reverting to the original source.\nUpon completing one cycle, the toil is great.\nGuard it closely, never grow confused or dull.\nThe path is distant, again profound and obscure.\nShould one attain this, they will comprehend *qian* and *kun*.\nWith the *daogui* applied, the hun and po are purified.\nThose who delight in the Dao seek its root.\nExamine the Five Phases, determine the precise weights.\nContemplate deeply—no need for further discourse.\nGuard it in seclusion, do not transmit the text.\nThis discusses the preservation of the sacred embryo.\n\nAscend on a white crane, ride the dragon’s scales.\nRoam the Great Void, pay homage to the Immortal Lords.\nReceive the celestial chart, be titled Perfected One.\nThis discusses the embryo’s liberation and spiritual transformation.\n\nIn praise:",
      "overlap_context": " and vessel.\nRound three-five, one inch in measure.\n“Round three-five, one inch in measure”: when yin and yang unite, three and five return to one. This is what Peng the Perfected meant by “the coherence of principle and phrasing.” “Round” refers to the union of *qian* and *kun*.\nMouth four-eight.\nThe “mouth” is the Gate of the Mysterious Female. In its entry and exit, transformations manifest the Four Images and Eight Trigrams. The cauldron holds metal and water; the vessel holds wood and fire.",
      "start_char": 17418,
      "end_char": 17974,
      "start_sentence": 1118,
      "end_sentence": 1165,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.474929094314575,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "乾为离宅，坤为坎郛。 真阴离处，真阳坎居。 离纳已妇，坎纳戊夫。 日月合璧，戊己为枢。 宾浮主沉，制有以无。 药之与物，二八河图。 五贼运火，皇极洛书。 法象羲《易》，按爻摘符。 魏君真师，觉我顽愚。 百拜稽首，千古范模。 上下三十世，火候惟口传。 信受奉行者，永为瑶池仙。 周易参同契卷下竟 #1『正炁』，《考异》本作『正气』。 #2『 匮』，《考异》本作『 椟』。 #3『失芸』，《考异》本作『失耘』。 #4『互沟』，《考异》本作『玄沟』。 #5『元纪』，原作『无纪』，据《考异》本改。 #6『交积』，《考异》本作『兼积』。 #7『支拄』，《考异》本作『支柱』。 #8『正阴』，《考异》本作『正阳』。 #9『一所』，《考异》本作『二所』。 #10『不得』，《考异》本作『不能』。 #11『彷佛』，《考异》本作『髻实』。 #12『勿事绪』，《考异》本作『失事绪』。 #13『别叔』，《考异》本作『别序』。 #14『刽国』，《考异》本作『都国』。 #15『权荣』，《考异》本作『权荣』。 #16『燕然闲居』，《考异》本作『远客燕问』。 #17『歌吟』，《考异》本作『歌叔』 #18『所趣』,（考异）本作『旨趣』。 #19『长尺二』，《考异》本作『长二尺』。 #20『情理纯』，《考异》本作『性情纯』． #21『本源』，《考异》本作『本原』。 #22『复幽玄』，《考异》本『复』一作『极』。 #23『刀圭沾，诤魄魂』：《考异》本缺此六字。",
      "translated_text": "Qian serves as the abode of Li, Kun as the enclosure of Kan.\nTrue yin resides in Li, true yang dwells in Kan.\nLi receives the wife of *ji*, Kan receives the husband of *wu*.\nSun and moon form a jade bi-disc, with *wu* and *ji* as the pivot.\nThe guest floats, the host sinks—control the existent through the nonexistent.\nMedicine and matter: the two eights of the *Hetu*.\nThe Five Thieves govern the fire, the *Huangji* follows the *Luoshu*.\nModeling the images of Fu Xi’s *Yi*, align the hexagrams and select the tally.\nMaster Wei, true teacher, awakened my dull ignorance.\nWith a hundred bows and prostrations, you stand as the eternal exemplar.\nThrough thirty generations above and below, the fire-times are transmitted only by mouth.\nThose who faithfully receive and practice this shall forever be immortals of Yaochi.\n\n*This concludes the third scroll of the* Zhouyi Cantong Qi. *The character* 「炁」 *here is written as* 「气」 *in the* Kaoyi *edition.*",
      "overlap_context": "fied.\nThose who delight in the Dao seek its root.\nExamine the Five Phases, determine the precise weights.\nContemplate deeply—no need for further discourse.\nGuard it in seclusion, do not transmit the text.\nThis discusses the preservation of the sacred embryo.\n\nAscend on a white crane, ride the dragon’s scales.\nRoam the Great Void, pay homage to the Immortal Lords.\nReceive the celestial chart, be titled Perfected One.\nThis discusses the embryo’s liberation and spiritual transformation.\n\nIn praise:",
      "start_char": 17974,
      "end_char": 18646,
      "start_sentence": 1166,
      "end_sentence": 1201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.305003881454468,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契注（储华谷）.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}