{
  "source_id": "周易参同契考异",
  "source_file": "chunked_daozang\\周易参同契考异.json",
  "total_chunks": 13,
  "total_original_chars": 13116,
  "total_translated_chars": 91632,
  "total_translation_time": 475.0101056098938,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\周易参同契考异.txt",
    "category": "藏外"
  },
  "full_translation": "The Imperial *Complete Library of the Four Treasuries*\nSection: Masters, Volume 14\n*Investigation of Discrepancies in the Zhouyi Cantong Qi*\nDaoist Category\nPreface\n\nWe, your ministers, respectfully note: *Investigation of Discrepancies in the Zhouyi Cantong Qi*, one fascicle, was compiled by Master Zhu of the Song dynasty. Chen Zhensun’s *Book Records with Annotations and Synopses* states that Master Zhu, finding the *Cantong Qi*’s diction and rhymes archaic and elegant, difficult to comprehend, and often recklessly altered by readers of shallow learning—with more errors than in other texts—thus collated various editions and mutually corrected them. Master Zhu himself cautioned that all discrepancies were preserved for reference and verification, hence the title *Investigation of Discrepancies*. Upon examination, however, the text explicitly notes variants in only two instances: for the character *治* in “Only when all under heaven is so can it be *governed*,” which is glossed as “or written as *principle* (理)”; and for *熺* in “the radiant cauldron,” which is noted as originally written *僖*. Other conjectural emendations—such as *修* suspected to be *循*, *六五* suspected to be *廿六*, *铅* suspected to be *饴*, and *与* suspected to be *为*—amount to no more than six or seven instances where Master Zhu himself made corrections. The remainder of the work, with annotations appended to each section elucidating the text, follows the form of commentary rather than exhaustive textual emendation. Thus, the title *Investigation of Discrepancies* does not fully reflect its content.\n\nAt the end of the work, the compiler signs as “Daoist Zou Xu of Kongtong.” As Zou was originally from the state of Zhu, which later lost its city and became the surname Zhu, this is a borrowed name. The *Rites of Zheng*’s commentary notes that *防* should be written as *熹*, and the *Collected Rhymes* states that both *熹* and *防* are pronounced *xū* in the *qí* tone. The adoption of this name likely alludes to the elixir of the cinnabar heart—a teaching beyond the purview of Confucian scholars—hence the veiled language.\n\nExamining Master Zhu’s recorded dialogues, his discussions on the *Cantong Qi* are quite thorough. His *Chronological Biography* also records that in the third year of the Qingyuan era, when Cai Yuanding was to be exiled to Daozhou, he lodged with Master Zhu at Hanquan Retreat, where they discussed the *Cantong Qi* late into the night. In his collected writings, there is a letter to Cai Jitong stating: “The *Cantong Qi* has no gaps, nor does it require mental effort; I merely hope one day to become Liu An’s chickens and dogs.” Such words suggest that, amid the hardships of the era, he had no choice but to take refuge in the rhetoric of immortals—an intent akin to Han Yu’s visit to the monk Dadian while exiled to Chaozhou.\n\nHuang Ruijie’s supplementary notes observe that Master Zhu and his disciples harbored the intention of “casting off the world,” capturing his true sentiment. Huang Zhen’s *Daily Excerpts* remarks: “The *Cantong Qi* was written by Wei Boyang of Shangyu. Its teachings derive from immortals and are not to be trusted. Cai Jitong, a scholar of broad learning yet not without flaws, once devoted himself to this text. Master Zhu, associating with him, thus edited and corrected the work, which has since circulated widely. Yet if one seeks its meaning, it is entirely absent.” While his critique is sound, he fails to grasp the intent to “take refuge under a guise.”\n\nRespectfully submitted after collation in the ninth month of the forty-sixth year of the Qianlong reign.\nGeneral Compilers:\nMinister Ji Yun\nMinister Lu Xixiong\nMinister Sun Shiyi\n\n**Chief Collators:**\n**Minister** Lu Feichi\n\n*Imperially Commissioned Complete Library of the Four Treasuries*\n*Investigation of Discrepancies in the Zhouyi Cantong Qi*\nBy **Zhu Xi** of the **Song Dynasty**\n\n**Preface to the Exegesis by Peng Xiao of the Five Dynasties:**\nWei Boyang of Guiji in Shangyu was a man who cultivated the Dao in seclusion, nurturing his will in emptiness and nonbeing. His literary prowess was vast, and he was versed in apocrypha and prognostication. Having fully grasped the mysteries of the ancient *Dragon-Tiger Classic*, he then condensed the *Zhouyi* to compose the *Cantong Qi* in three chapters, later adding a supplementary chapter to fill omissions. Much of its content employs allegory, borrowing events to obscurely reveal profound truths. It was secretly transmitted to Xu, an Attendant Officer of Qingzhou—Xu being his surname—who annotated it. During the reign of Emperor Huan, Boyang further transmitted it to his fellow townsman, Chunyu Shutong, whereupon it spread throughout the world.\n\n*Cantong* means \"correspondence\" or \"union\"; *qi* means \"agreement.\" It signifies that the work’s principles correspond and align with those of the *Zhouyi*. The text metaphorically employs the relationship between ruler and minister to elucidate inner and outer, narrates the hexagrams *Li* and *Kan* to directly indicate mercury and lead, and establishes the *Qian* and *Kun* hexagrams as the foundation of the cauldron. It clarifies the beginning and end through the analogy of parents and guardians, unites them as husband and wife to constrain their intercourse, compares them to male and female to manifest generation, and analyzes them through yin and yang to guide their cyclical transformations. It demonstrates the waxing and waning of the moon through obscurity and visibility, coordinates ascent and descent with the hexagrams and lines, follows the handle of the Dipper to circulate the stars, divides time by dawn and dusk, and illuminates the hours through the water clock. Without exception, it discusses all these matters by drawing upon the imagery of the *Yi*. Hence, it is called *Zhouyi Cantong Qi*.\n\n**Appendix:** The annotated editions of the *Cantong Qi* number nineteen works in thirty-one fascicles, as listed in Zheng Qiao’s *Yiwen Lue* of Jiaji. Peng Xiao’s edition is the most widely transmitted, though he divided its three chapters into ninety sections to correspond with the yang number nine, and appended a *Song of the Cauldron* to match the water number one. Such arrangements are mere imitations of the *Heshang Gong*’s division of the *Daodejing* into eighty-one chapters, yet in truth, they are not so. Mr. Bao remarked that Peng’s edition, altered by shallow scholars of recent times, contains errors, omissions, and redundancies in both the Palace copies and those circulated among the people, making it impossible to determine the correct version. Master Zhu, in his collation and emendation, relied on this edition as his basis, and thus we dare not further append other interpretations.\n\n**Appendix—Master Zhu’s Remarks:**\nThe *Cantong Qi* was not originally intended to elucidate the *Yi*. It merely borrowed the method of \"inserting the heavenly stems\" to convey the timing of advancing and retreating in cultivation. In the past, I wished to study it but could not obtain its transmission, nor find a starting point, so I dared not lightly discuss it. However, the method of \"inserting the heavenly stems\" it describes is the same as the divination technique of Jing Fang, as seen in the *Fire Pearl Forest*. What it refers to as *jia*, *yi*, *bing*, *ding*, *geng*, and *xin* pertains to the moon’s appearance and disappearance at dusk and dawn, not to the division of the six hexagrams’ directions.\n\nThough this was not devised to elucidate the *Yi*, the *Yi* encompasses all things. If its teachings form a coherent system that can be extended and applied, they do no harm to the *Yi*. Boyang’s *Cantong Qi* may share some origins with the learning of [Chen] Tuan. The *Xiantian Tu* corresponds with the system of pitch standards, and Cai Jitong claimed it aligns with the *Cantong Qi*. Observing it through the diagram: between *Kun* and *Fu* lies obscurity; *Zhen* represents the third day, when the first yang arises; the eighth day is *Dui*, when the moon’s upper edge is full; the fifteenth day is *Qian*, when the moon is full; the eighteenth day is *Xun*, when the first yin arises; the twenty-third day is *Gen*, when the moon’s lower edge wanes. *Kan* and *Li* represent the sun and moon, hence they are not used in the *Cantong Qi*. The remainder pertains to the firing times.\n\nShao Yong elucidated the *Xiantian Tu*, which was transmitted from Chen Tuan, who in turn received it from another source. This is the technique of the fangshi, employed in cultivation—precisely what the *Cantong Qi* describes.\n\nThe *Cantong Qi*’s literary quality is excellent, likely composed by one of the finest writers of the Later Han. Its diction is based on ancient texts, incomprehensible to modern readers, which has led to many misinterpretations. Numerous versions exist, one of which states:\n*\"After a thousand cycles, resplendent and flourishing,\nTen thousand repetitions will reveal the numinous.\nIt may enlighten others, or the spirit may suddenly awaken on its own.\"*\nReciting it over time, the essential meaning and key instructions will naturally become clear.\n\n**Liu of Xuqi** remarked: \"Among ancient texts, only the *Cantong Qi* resembles pre-Qin prose.\"\n\n**Upper Chapter:**\n*Qian* and *Kun* are the gate and door of the *Yi*, the parents of all hexagrams.\n\nQian and Kun, when spoken of in terms of the cosmos, mean that Qian as Heaven is above and Kun as Earth is below, and the transformations of yin and yang, the beginnings and endings of the myriad things, all occur between them. When spoken of in terms of the human body, Qian as yang is above and Kun as yin is below, and the yin and yang of the entire body, the transformations of the myriad things, their beginnings and endings, all occur between them. This is why Qian and Kun are called the gate and door of the *Yi*, the parents of all hexagrams. All discussions of the *Yi* refer to the transformations of yin and yang, which in the human body are what is called the Golden Elixir and the Great Medicine. Thus, are Qian and Kun not the crucible and furnace? Kan and Li serve as the enclosing frame, turning the hub and aligning the axle.\n\nQian and Kun are positioned above and below, while Kan and Li ascend and descend between them—this is what is meant by the *Yi*. In the arrangement of the precelestial positions, Qian is south, Kun is north, Li is east, and Kan is west. Thus, their configuration resembles the shape of a walled enclosure, and their ascent and descent are like an axle piercing the hub to turn the wheel—one descends as the other ascends. The hub is the center of the wheel, solid on the outside to hold the spokes and hollow within to receive the axle. The axle is the horizontal wood beneath the cart, its two ends passing through the hubs to receive the linchpins.\n\nThe four trigrams of union—Zhen, Dui, Xun, and Gen—serve as the bellows and its pipe. The \"four trigrams of union\" refer to the paired trigrams Zhen and Dui, Xun and Gen. The bellows and its pipe are like the mechanism of the *na jia* method. Qian represents the full moon, Kun the new moon, while Kan and Li ascend and descend between them. Zhen governs the waxing light, Dui the culmination of brightness; Xun governs the waxing darkness, and Gen the culmination of obscurity—like the bellows, which has its rhythms of tension and release.\n\n**Appendix (Zhu Xi’s remark):**\nMaster Shao said: \"Qian and Kun establish the positions of above and below; Kan and Li arrange the gates of left and right.\" The *Cantong Qi* begins by laying out the hexagram positions—all following the same principle.\n\nThe Way of covering and enveloping yin and yang is like a skilled charioteer holding the reins and bit, guided by the marking line and carpenter’s square, following the tracks to maintain the center and regulate the external. The numbers are recorded in the pitch pipes and calendrical systems.\n\nThis speaks of how the human mind can govern yin and yang, turning the hub and axle to form the Elixir. The \"reins and bit\" refer to what directs yin and yang; the \"marking line and carpenter’s square\" refer to the firing times; the \"tracks\" indicate the pathways of ascent and descent; \"center\" refers to the mind; \"external\" refers to qi; and \"numbers\" refer to the firing times of the sixty hexagrams described below.\n\nThe lunar nodes have five or six divisions; following the sun’s path, they combine to form sixty. Hard and soft have inner and outer aspects. The moon takes five days as one node, six nodes as one cycle, and combining day and night makes sixty, corresponding to the sixty hexagrams. Day is hard, night is soft; hard is inner, soft is outer. Among the sixty-four hexagrams, Qian, Kun, Kan, and Li are used as the furnace, crucible, and medicine, leaving sixty hexagrams to serve as the firing times.\n\nAt dawn on the new moon, *Zhun* governs the affairs of the day; by dusk, *Ge* takes its place. Day and night each correspond to one hexagram, used in sequence. This is the general rule for the sixty hexagrams—a full cycle completes in one month, reflecting the early and late timing of daily practice.\n\nBefore the end of the dark moon and the break of dawn, the cycle begins anew. The celestial stems and branches serve as the measure; movement and stillness have their early and late phases. \"Before the end\" refers to the hexagram of the dark moon—morning is *Ji Ji*, evening is *Wei Ji*. \"Break of dawn\" refers to the time when light is born.\n\nIn spring and summer, rely on the inner body, proceeding from *zi* to *chen* and *si*; in autumn and winter, employ the outer use, starting from *wu* and ending at *xu* and *hai*. Spring and summer correspond to morning, autumn and winter to evening. The \"inner body\" refers to the preceding hexagram, the \"outer use\" to the following hexagram. This is also a general rule for the sixty hexagrams. The latter chapter states: *Zhun* uses *zi* and *shen*, *Ge* uses *yin* and *xu*—this fully expounds the *na jia* method. Generally, the four times of *zi*, *wu*, *mao*, and *you* are used in a single day.\n\nRewards and punishments correspond to spring and autumn; dawn and dusk follow the sequence of cold and heat. The line statements embody benevolence and righteousness, manifesting joy and anger in accord with the seasons. Thus, they respond to the four seasons and five phases, maintaining their proper order.\n\nThis speaks of how morning and evening practice differ, though the details are not fully explained.\n\nHeaven and Earth take their positions, and the *Yi* operates within them. Heaven and Earth are Qian and Kun; \"take their positions\" refers to the arrangement of yin and yang in their paired positions. The *Yi* refers to Kan and Li—Kan and Li are the two functions of Qian and Kun.\n\nThis quotes the *Yi* to explain the functions of Qian, Kun, Kan, and Li, clarifying that Qian is above and Kun below, Li descends and Kan ascends. The \"two functions\" refer to Qian’s \"use of nine\" and Kun’s \"use of six\"—nine is old yang, six is old yin.\n\nThe two functions have no fixed line positions; they circulate through the six voids. Their coming and going are not fixed; neither above nor below is constant. They hide and conceal, ascending and descending within, enveloping the myriad things as the guiding principles of the Dao. By means of the formless, they regulate the formed; the vessel’s function lies in its emptiness. Thus, the waxing and waning of Kan and Li vanish without trace.\n\nThe two hexagrams Qian and Kun each have six lines, with nine and six in fixed positions. Only the \"use of nine\" and \"use of six\" have no fixed positions, yet the nine and six of the six lines are precisely these nine and six, circulating and ascending/descending. In the *na jia* method, Qian corresponds to *jia* and *ren*, Kun to *yi* and *gui*, Zhen to *geng*, Xun to *xin*, Gen to *bing*, and Dui to *ding*—all have fixed positions. Only Kan corresponds to *wu* and Li to *ji*, which have no fixed positions, for the yin and yang of the six trigrams are the circulation and ascent/descent of the middle lines of Kan and Li. Thus, the formless here governs the formed there; the vessel has form, yet its function lies in the emptiness of its form. This aligns with Laozi’s words: \"Kneading clay to make a vessel, it is where there is nothing that the vessel’s use resides.\" \"Waxing and waning\" refer to the waxing from Kun through Zhen and Dui to its culmination in Qian, and the waning from Qian through Xun and Gen to its culmination in Kun. \"Vanishing without trace\" means having no position. The later chapter’s passage on the \"use of nine\" fluttering as the ancestral hexagram of the *Yi* expresses the same idea.\n\n**Appendix (Zhu Xi’s remark):**\nSomeone asked: \"Is the *Cantong Qi* truly the *Dragon-Tiger Upper Classic*?\"\nZhu Xi replied: \"No. Later people, seeing that Master Boyang’s transmission included the phrase *Dragon-Tiger Upper Classic*, fabricated this text. Generally, it is a patchwork of phrases from the *Cantong Qi*, though some parts are mistaken. For example, the 'two functions' refer to the 'use of nine' and 'use of six'—nine and six are also Kan and Li. The 'six voids' are the first, second, third, fourth, fifth, and top line positions of Qian and Kun. It says that although the two functions have no fixed line positions, they constantly circulate through the six lines of Qian and Kun, just as a person’s essence and qi circulate throughout the body without fixed location. The *Dragon-Tiger Classic*, however, mistakenly speaks of 'void and danger,' forcing an interpretation where none fits.\"\n\n**Appendix (Note by Peng):**\nPeng believed that Master Wei obtained the ancient text of the *Dragon-Tiger Classic* and composed the *Cantong Qi*. Zhu Xi considered the *Classic* a later forgery. Now, examining the *Cantong Qi*, it contains passages from an ancient text recording the Dragon and Tiger, which likely once existed. For instance, the *Fire Record*’s text may not be the same as the version transmitted today. Bao suggested that this may be comparable to the *Three Tombs* and the *Fox-Head Classic*—whether this is true remains uncertain.\n\n**Appendix (Further Note):**\n\nThe *Ancient Text of the Dragon-Tiger Upper Classic of the Golden and Azure* is somewhat simpler than the *Cantong Qi*, yet its phrasing and arrangement do not differ greatly from the *Qi*, and indeed appear more refined. Its closing line—*\"The Fire Record is not falsely composed\"*—also echoes the *Qi*. Thus, might the *Fire Record* itself be the source of the *Cantong Qi*?\n\nIts words are not carelessly crafted, its theories not idly born; it cites evidence, demonstrates effects, measures by celestial patterns, and infers from divine illumination. It takes the formation of characters as proof: Kan (坎) as the moon’s essence (戊), Li (離) as the sun’s light (己); the union of sun and moon becomes the *Yi*. Hard and soft correspond, earth reigns over the four seasons, and the web of beginning and end—green, red, white, and black—each occupies its quadrant, all receiving the power of the central palace’s 戊 and 己.\n\nThis explains the method of character formation to clarify the union of Kan’s moon and Li’s sun into the *Yi*. For Kan’s 戊 and Li’s 己 both reside in the central palace of earth, and the four directions and four phases all derive their qi from it.\n\nThe *Yi* is imagery; no image is more luminous than the sun and moon. To fathom the divine and know transformation: when yang departs, yin arrives; like spokes converging at the hub, the wheel turns, alternating between emergence and withdrawal.\n\nThis broadly conveys the meaning of the *Yi* as the sun and moon. Below, it elaborates on the method and the fire-phase of a single month.\n\nFrom the dark of the moon to the dawn of the new moon, Zhen (震) arrives to receive the tally. At this moment, heaven and earth unite their essence, sun and moon clasp and hold; the male yang scatters its mystery, the female yin transforms into a yellow embrace. Chaos intermingles, the root of power is planted, the foundation laid. Nurturing the bud, the calyx forms; spirit congeals into form. All things tread forth, wriggling into motion—none does not arise from this. Confucius praised the primal chaos, the virtue of Qian and Kun filling the void. Tracing antiquity, the *Yuanhuang* is invoked; the *Guanju* establishes the beginning. At the first marriage, qi intertwines; the first year sprouts forth. The sage does not act in vain—gazing above, he observes the manifest celestial tally. The tally advances and retreats, bends and extends, responding to the seasons.\n\nThe method of this text divides a month into six segments, each assigned to one of the six hexagrams: Zhen (1), Dui (2), Qian (3), Xun (4), Gen (5), and Kun (6). Each segment spans five days. Thus, at the dawn of the new moon, Zhen begins its work, marking the initial union of sun and moon’s yin and yang. Here, the practice of refinement is applied, just as the sage’s composition of the Six Classics all had a point of origin. This is the essential passage of the entire work, and *\"the male yang scatters its mystery, the female yin transforms into a yellow embrace\"* is the crucial point of this segment; all else serves to clarify this.\n\nThus, the *Yi* governs the heart of heaven. The hexagram Fu (復) establishes the beginning, the eldest son succeeds the father’s body, relying on the mother to lay the foundation. Waning and waxing respond to the bell and pitch pipe; ascent and descent follow the pivot of the Dipper.\n\nThis further divides the month into twelve segments, ordered as Fu (復), Lin (臨), Tai (泰), Da Zhuang (大壯), Guai (夬), Qian (乾), Gou (姤), Dun (遁), Pi (否), Guan (觀), Bo (剝), and Kun (坤), with each segment spanning two and a half days. Fu corresponds to the first of the previous six segments, Zhen. The eldest son is Zhen, the father Qian, the mother Kun. A later passage states: *\"At the dawn of the new moon, it is Fu.\"*\n\nOn the third day, brightness emerges; Zhen receives 庚 in the west. On the eighth day, Dui receives 丁 in the upper reaches, its surface level as a stretched cord. On the fifteenth day, Qian’s body is full and abundant, 甲 in the east.\n\nThe third day marks the midpoint of the first segment, when the moon begins to brighten. It first receives a single yang’s light, faintly visible at dusk in the west, at 庚. The eighth day marks the midpoint of the second segment, when the moon’s surface levels. It receives two yang’s light, visible at dusk in the south, at 丁. The fifteenth day marks the midpoint of the third segment, the full moon. It fully receives the sun’s light, abundant and bright, visible at dusk in the east, at 甲.\n\nThe toad and the hare’s spirit—sun and moon, unmatched in brilliance. The toad gazes upon the hexagram’s segments; the hare spits forth light. This describes the full moon’s evening, when the moon fully receives the sun’s light, borrowing the toad for sight and the hare for emission.\n\nAt seven and eight, the Dao is complete; bending and lowering, it descends. On the sixteenth, it receives governance from Xun (巽) at 辛, appearing at dawn’s clarity. Gen (艮) stands upright at 丙 in the south; on the twenty-third, Kun (坤) at 乙. On the thirtieth day, in the northeast, its light is lost. The segments exhaust and succeed one another; the body revives. Dragon’s 壬 and 癸 pair with 甲 and 乙; Qian and Kun encompass beginning and end.\n\nSeven and eight refer to the fifteenth day. The sixteenth day marks the beginning of the fourth segment, when the first yin arises as Xun, forming the moon’s spirit, setting at dawn in the west at 辛. The twenty-third day marks the midpoint of the fifth segment, when the middle yin arises as Gen, descending to set at dawn in the south at 丙. The thirtieth day marks the end of the sixth segment, when all three yang transform and the light is spent, its body hidden in the northeast—borrowing the character *peng* (朋) for *ming* (明). The six segments of the month are complete, passing to the next month. The eldest son succeeds the father, Zhen revives; 壬 pairs with 甲, 癸 with 乙, all belonging to Qian and Kun, encompassing the ten days’ beginning and end—from the dark of the moon to the dawn of the new moon, this is the fire-phase of a single month.\n\n**Appendix (Zhu Xi’s Note):**\nIn a single breath, there are the phases of dark, new moon, first quarter, full moon, and last quarter. The phase of ascent is when qi, having reached its peak, begins to descend; the phase of descent is when qi, having reached its nadir, begins to rise. The full moon is when qi is full—the sun sinks below, and the moon is round above. Between the dark and new moon, the sun and moon conjoin above. This is what is meant by *\"raising water to extinguish fire\"* and *\"metal returning to its nature at the beginning.\"*\n\nSeven and eight make fifteen; nine and six also correspond. Four of these make thirty—when yang qi is exhausted and hidden, its store is spent.\n\nThe eight trigrams are arrayed, the luminaries shift, never losing the central mystery. Subtle and elusive, difficult to behold, one infers, measures, and verifies by effect. Residing in observation, one examines its images, models its forms, sets up markers as standards. Divining and fixing fortune, issuing commands in accord with the seasons, one does not miss the moment when lines move. Above, one examines the patterns of the *River Chart*; below, one orders the earth’s topography. In the center, one investigates human nature, harmonizing and examining the Three Powers. In motion, one follows the hexagram’s segments; at rest, one relies on the hexagram’s judgment. When Qian and Kun are employed, the world is governed.\n\nThis refers to the line *\"When Qian is employed, the world is governed\"*—above, *\"Qian and Kun are employed\"* means *\"employing nine\"* and *\"employing six.\"* *\"Governed\"* may be written as *\"ordered\"* to avoid Tang taboo. From here to *\"the state suffers no harm to the Dao\"* is all metaphor for state governance.\n\nHow can one not be cautious? At the helm of governance, one must grasp the subtle and profound, open and close, distribute the precious essentials of the Dao. The handle of the Dipper commands transformation; the net’s knot is the lines’ movement within. Fortune and misfortune arise externally. The five planets move erratically, responding to the seasons. When the four and seven are discordant, excess and separation arise; bowing and raising, Wen and Chang record it all. The censors and ministers, the hundred officials and their bureaus, each oversee their domains. Daily, they harmonize the five phases’ essence; monthly, they receive the six pitch pipes’ measure. Five and six make thirty degrees; when the degrees are complete, the cycle begins anew. Tracing beginning to end, one preserves the thread of survival and extinction.\n\nIf the ruler is arrogant and indulgent, overbearing and contrary to the Dao; if ministers are treacherous and flattering, acting outside proper bounds—then the waxing and waning of the tally will deviate, bringing misfortune. Enforcing the law, admonishing and criticizing, binding faults, shifting the ruler’s fate—only when the pole star receives its proper alignment can one leisurely entrust matters to subordinates. The Bright Hall distributes governance, and the state suffers no harm to the Dao.\n\nThese are all metaphorical expressions, yet within them lie points worthy of careful reflection. Internally, one cultivates the self through tranquility, emptiness, and non-being, returning to the primordial root. The inner light illumines the body; the orifices are sealed and fortified, the spirit-root stabilized. The Three Luminaries sink into obscurity, and the warming nurture of the \"child-pearl\" begins. Though unseen to the eye, it is near and easily sought. The Yellow Center gradually opens, its principle moistening and permeating to reach the skin. At first, one rectifies the foundation; in the end, one refines the branches. Yet if one clings to a single method, it obscures the world, and none will comprehend.\n\nThis is spoken of internal matters, and in the classics, it is most essential. The phrase \"the Three Luminaries sink into obscurity, warming and nurturing the child-pearl\" is the most essential of the essential. The earlier metaphors of \"governing at the outset,\" \"the handle of the Great Dipper,\" and \"the guiding net\" all refer precisely to this. \"First rectifying the foundation\" speaks of the beginning; \"refining the branches in the end\" speaks of the conclusion. \"Clinging to a single method\" refers to the obscurity at the inception, where the Way remains unmanifest.\n\nThe highest virtue acts without striving, not seeking through scrutiny; the lower virtue acts, and its function never ceases. When the upper is sealed, it is called \"having\"; when the lower is sealed, it is called \"non-being.\" \"Non-being\" serves \"having\"; above, the numinous virtue resides within these two apertures. The method follows the metal qi, and they mutually depend.\n\nWhat follows grows increasingly difficult to comprehend; here, I briefly interpret it according to my understanding. The \"highest virtue\" is what the earlier text calls the \"feminine yin transforming the Yellow,\" enveloping the Three Luminaries’ sinking into obscurity, and what the later text calls \"mercury as the flowing pearl,\" the \"Azure Dragon accompanying it\"—the \"flowing pearl, mother of water,\" precisely what thought cannot reach. The \"lower virtue\" is what the earlier text calls the \"masculine yang disseminating the Mysterious,\" warming and nurturing the \"child-pearl,\" and what the later text calls the \"White Tiger as the pivot of refinement,\" the \"Yellow Earth, father of metal\"—precisely where intention and effort are applied. When sealed, both lose their proper place.\n\nThe lower cannot be without \"non-being,\" which serves the upper. The \"numinous virtue\" refers to the subtle and wondrous. The *Dragon and Tiger Classic* states: \"Above, the Azure Dragon resides in the metal qi,\" meaning the masculine yang and the White Tiger. Generally, when yang descends, yin naturally ascends—this is what the \"apertures\" refer to. The *Song of the Cauldron* says: \"Yin above, yang below rushing\"—this, too, is a most essential statement.\n\n\"Knowing the white, guarding the black,\" the spirit and brightness come of themselves. The white is the essence of metal; the black is the foundation of water. Water is the pivot of the Dao; when dispersed, each is singular. The white refers to mercury; the black, to lead. \"Essence of metal\" speaks of its birth from lead; \"foundation of water\" speaks of its ability to generate water. White and black are each singular, yet water is the pivot of the Dao—this is what the \"numinous virtue\" refers to.\n\nThe beginning of yin and yang contains the Mysterious and the Yellow, the master of the Five Metals—the Northern River Chariot. The Mysterious and the Yellow contain earth within water, still yet intentional. The Northern River Chariot is black and generates water. According to the later text, this refers precisely to lead.\n\nThus, lead is black externally but harbors golden splendor within—\"clothed in coarse cloth, yet holding jade.\" Lead is what the earlier text calls the \"metal qi.\" Metal is the mother of water; the mother conceals the child in her womb. Water is the child of metal; the child hides in the mother’s embryo. This is the meaning of \"knowing the white, guarding the black.\"\n\nThe Perfected One’s subtlety is as if present, as if absent, faintly resembling the great abyss—now sinking, now floating. Retreating, they disperse and each guards their domain. This is what is called \"warming and nurturing the child-pearl.\"\n\nGazing from afar, it appears snow-white; approaching, it is cinnabar-red. Chains form its outer defense; white within, the true essence resides. Square and round, a cun in diameter, they blend and restrain each other. Born before heaven and earth, majestic and lofty, it is encircled by walls and watchtowers, resembling Penglai. Enclosed and sealed, the four directions connect. Hesitating, guarding, tightly secured, it blocks all wickedness. Curved corridors communicate, ever vigilant against the unexpected.\n\nThe \"cun in diameter\" is what is called the \"child-pearl.\" The \"walls and watchtowers\" may refer to what the later text calls \"the emotions governing the external, constantly forming city walls and watchtowers\"—though the exact meaning remains unclear.\n\nOne may be without thought, yet cannot be without care and toil. When the qi fills the hall, none can retain it. Those who guard it prosper; those who lose it perish. In movement and stillness, rest and activity, it is ever with the person. Whether in right or wrong, one practices the method of internal vision: contemplating, treading the steps of the Dipper and the lunar lodges, the Six Jia, the hours and days, the yin path suppressing the Nine Ones. Guarding against turbid chaos, preventing the Mysterious Embryo from harm, one ingests qi, causing the intestines to rumble. Exhaling the stale, inhaling the fresh, day and night without sleep, from dusk to dawn without rest, the body grows weary and dazed, as if mad. The hundred vessels boil like a cauldron, racing without clarity. Dwelling in a circular enclosure, one erects an altar, worshipping and sacrificing to spirits morning and evening. Seeing forms and images in dreams, the heart stirs with emotion, joy, and delight—one believes longevity is assured, yet suddenly meets an early death, the body decaying and exposed. Every action violates the proper order, losing the pivot of the mechanism. Such arts are myriad, numbering thousands or tens of thousands. Advancing and retreating, they deviate from the Yellow and the Old, twisting and turning, rebelling against the Nine Capitals.\n\nThis speaks of how this Way differs from all other minor methods and cannot be explained in detail. The wise will reflect on this, suddenly understanding the path. Diligently practicing day and night without rest, after three years of ingesting and refining, one becomes light and travels afar—entering fire without burning, entering water without drowning. One can preserve or abandon life, ever joyful and without sorrow. The Dao is accomplished, virtue perfected; one conceals oneself, awaiting the time. The Great One summons, and one moves to the Central Land. When merit is complete, one ascends, receiving the register and the Fire Record. The teachings are not false, as the *Yi*’s evolution makes clear.\n\nThe crescent-moon method: the cauldron and furnace. The White Tiger is the pivot of refinement; the Sun-Mercury is the flowing pearl. The Azure Dragon accompanies it. Raising the East to join the West, the hun and po naturally restrain each other. The upper trigram is *dui*, number eight; the lower trigram is the same.\n\nThe \"crescent moon\" likely refers to the shape: round below, deficient above, resembling an inverted crescent. The White Tiger is lead, fire, qi, the West, the po, and yang—acting as the pivot of refinement, speaking of the downward rush that brings steaming moisture upward. Mercury is the essence of the sun; the Azure Dragon is water, the East, the hun, and yin. The upper trigram is yang; the lower trigram is yin.\n\n[Master Zhu appended: The terms *kan*, *li*, water, fire, dragon, tiger, cinnabar, mercury, and the like are merely interchangeable names—ultimately, they refer only to essence and qi. Essence is water, *kan*, the dragon, and mercury; qi is fire, *li*, the tiger, and lead. The method uses spirit to move essence and qi, binding them to form the elixir. Yang qi, initially below, first becomes water; refined by fire, it congeals into the elixir. This explanation is most unusual.]\n\nWhen the two trigrams unite their essence, the body of *qian* and *kun* is complete. Two eights correspond to one jin; the Way of the *Yi* is perfectly balanced. Eight days form *dui*, the upper trigram; advancing another eight days completes the body of *qian*. Twenty-two days form *gen*, the lower trigram; retreating another eight days completes the body of *kun*. One version notes: \"A *zhu* has three hundred eighty-four, corresponding to the number of the hexagrams—this is the number of *zhu* in one *jin*.\" Beginning at *zhen*, rising to *qian* to reach fullness, passing through *xun* to wane, and ending at *kun* to exhaustion.\n\nWhen gold enters fierce fire, its color remains unaltered; since the dawn of creation, the sun and moon have never waned in brightness, just as gold never loses its weight. The sun and moon retain their constant form, for gold is born of the moon. At the new moon, it receives the sun’s emblem; when gold returns to its mother, at the dark of the moon, they enfold each other, concealing their frame. Sunken into the cavernous void, gold regains its original nature, its majestic radiance blazing within the crucible.\n\nGold is lead. When it returns to its mother and regains its original nature, it is gathered and stored, no longer in use. The sun does not shine, and the moon is pure *kun* trigram. The character *熺* originally meant \"blazing\"; in the *Hou Han* texts, it is often used. The numbers of *zi* and *wu* combine to form three; *wu* and *ji* are called the five threes. When the five threes harmonize, the eight minerals serve as the proper framework. Inhalation and exhalation desire each other, awaiting union as husband and wife. Yellow earth is the father of metal, flowing pearl the mother of water. Water treats earth as its ghost; earth fills water, preventing it from rising. The Vermilion Bird is the essence of fire, maintaining balance to determine victory or defeat. When water prevails, fire is extinguished; when both perish, they return to the thick earth. Once the three natures unite, they guard their original essence and share a common ancestor.\n\n*Zi* (water) is one, *wu* (fire) is two; their numbers combine to form three. *Wu* and *ji* (earth) are five; three fives combine to make eight, symbolizing the eight minerals. Yet in truth, there are only two things—water and fire—with earth as the master. Earth pertains to the spleen, which governs intention, meaning one uses intention to direct fire downward and water upward, so they breathe in harmony. Gold is fire; the Vermilion Bird likely refers to the heart, which governs intention. This \"fire\" differs from the \"roasting\" (*熬*) mentioned earlier—it is another kind of fire. \"Maintaining balance\" means holding the scales, governing summer. The intent of this text is largely to use fire to boil water and water to extinguish fire, echoing the earlier idea of the moon receiving the sun’s light and returning to its mother.\n\nSesame prolongs life; the returning elixir can be ingested. Gold’s nature does not decay, making it the treasure of all things. When alchemists consume it, their lifespans lengthen. Earth travels through the four seasons, guarding its boundaries and establishing rules. When golden sand enters the five viscera, mist scatters like wind and rain. Steaming heavily, it reaches the four limbs; the complexion becomes radiant, white hair regrows black, fallen teeth re-emerge, and the old man regains his youth, the aged woman transforms into a maiden. Changing form to escape worldly calamity, one is called a True Person.\n\nThis refers to the inner elixir; the method of ingestion remains unclear, as discussed in later chapters. It enters the Crimson Gate below.\n\nWhen lead powder is cast into fire, its color is ruined and reverts to lead. Ice and snow melt in warm water, dissolving into the Great Mystery. Gold takes cinnabar as its master, harmonizing with mercury; transformations arise from their true nature, beginning and ending with themselves. All use the analogy of like transforming like.\n\nTo refine an elixir for immortality, one must use like substances: plant grain with grain, cover chickens with their own eggs, and rely on the natural to assist the natural. Things will easily take form. Fish eyes are not pearls; fleabane does not become sandalwood. Like follows like; disparate things cannot form treasures. Thus, swallows do not give birth to phoenixes, foxes and rabbits do not nurse horses, water does not flow upward to blaze, nor does fire move downward to moisten.\n\nAgain, it is shown that unlike things cannot succeed; this is repeatedly clarified.\n\nMany scholars in the world possess lofty talent, yet by chance, they do not encounter proper methods. They waste their efforts, squander their wealth, and rely on textual interpretations, arbitrarily imposing their own ideas. Without foundation, their measurements and handling go awry. They pound and refine orpiment, mica, arsenolite, magnetite, sulfur, and mercury, burning camphorwood and mud to smelt them. They add the five minerals, copper, and other substances as aids, but their natures differ, and they refuse to unite. A thousand attempts lead to ten thousand failures; seeking immortality, they instead become foolish. Even in old age, with white hair, they remain doubtful midway, abandoning the Dao to cling to delusion, straying from the correct path into depravity. Peering through a tube, their narrow vision makes it difficult to gauge the future.\n\nThis refers to those who pursue the outer elixir; if the medicines are not of like kind, they cannot form treasures.\n\nAs for the utmost sages: Fu Xi drew the eight trigrams, modeling the celestial patterns; King Wen of Zhou, the emperor’s ancestor, structured the hexagrams and composed the line statements; and Confucius, the most eminent of sages, added the Ten Wings to assist them. These three rulers, raised by Heaven, succeeded one another in governing their times. Though their steps varied in excellence, their virtues did not differ. Their creations built upon one another; they measured and weighed, carefully distinguishing the smallest details. What had form was easy to manage; what lacked form was difficult to grasp. They acted so their deeds could serve as models, establishing the *Book of Poetry* and *Book of Documents* for the world. These works contained no prior knowledge but relied on teachers to awaken understanding—like lifting the curtains to gaze from a high tower.\n\nThe three sages succeeded one another, and their achievements had varying degrees of excellence. Fu Xi modeled Heaven, King Wen followed Fu Xi, and Confucius followed King Wen. What had form was easy to regulate; what lacked form was hard to attain. This passage explains that one awakens to this principle through a teacher. The meaning of the lines on the *Book of Poetry* and *Book of Documents* remains unclear.\n\nThe *Fire Records* comprise six hundred chapters, all pursuing the same goal. The text is earnest, yet people do not ponder deeply to trace its origins. The hidden and the manifest originally dwell together. I await the worthy to discuss this; how dare I lightly commit it to writing? Holding my tongue, I wish to remain silent, but cutting off the Dao would incur punishment. Pouring out my feelings onto bamboo and silk, I fear revealing Heaven’s signs. Hesitating, I sigh, looking up and down, and compile these foolish words. There are methods for refining, but I dare not fully expound them. I merely outline the framework and reveal the branches.\n\nThe *Fire Records* of six hundred chapters may be an ancient text now lost.\n\nUsing gold as a dike, water and fire remain at ease. Gold’s number is fifteen, and water’s number is the same. When the furnace is prepared, the weights and measures are fixed: five parts water, with two parts remaining as the true essence. Gold’s weight returns to its original state; the three parts do not enter the water but accompany the two. The three substances contain and receive each other, transforming as if by magic. Below, the *qi* of the Great Yang steams and rises. After a moment, it first liquefies, then congeals, called the Yellow Chariot.\n\nThis describes the first transformation of the elixir. Gold and water appear together; some versions say \"fire\" instead of \"water.\" According to the following text, the three substances should be \"fire.\" Yet it also mentions \"below, the *qi* of the Great Yang,\" suggesting only two substances. Perhaps it should read \"eight\" instead of \"three,\" and \"two\" instead of \"three.\" This refers to gold and water, both numbered fifteen, with water divided into five parts, only two of which are used—six parts of fifteen. The three parts are nine parts of fifteen. Water (or fire) is two, corresponding to the two above; the three substances below align with them. However, the absence of fire’s weight above and the mention of \"Great Yang\" below cast doubt. The mutual containment of the two substances refers to the union of *yin* and *yang*, *kan* and *li*. The error of \"three substances\" is evident.\n\nWhen years and months near their end, nature is harmed, and lifespan is cut short. The body becomes ashes and dust, like dust on a bright window—this is the second transformation.\n\nThe grinding, refining, and blending are swiftly introduced into the Crimson Gate, where its borders are firmly sealed to prevent any leakage. Vigilance must be maintained to ensure its integrity, while blazing fire is kindled below, burning day and night with unwavering diligence. Begin with the civil and conclude with the martial; then, observe and inspect with utmost care, adjusting warmth and coolness with meticulous attention. Circulate through the twelve joints, exhausting each in turn, for one must personally attend to the *qi* when life’s breath is on the verge of severance. When the *po* and *hun* fade and the color shifts, it transforms into a radiant purple—thus is the Returned Elixir formed. Taking a single pellet, the size of a knife’s tip, is most potent. This is the third transformation.\n\nThe grinding, refining, and blending here serve a distinct purpose. The Crimson Gate refers to the mouth. When saliva congeals into ash-like earth, the principle must be self-evident—spit it out, refine it, then swallow it again. The blazing fire is the so-called Great Yang *qi*. The phrase \"sound is diligent\" is echoed in later passages, describing a mournful wail like an infant longing for its mother. The character for \"cultivate\" may be a scribal error for \"follow.\" The *qi* seeking life’s end reprises the earlier theme of fire extinguished and metal restored. The terms \"powdered cinnabar\" and \"knife’s tip\" remain unclear.\n\nExpounding upon the Five Phases’ numerology is concise yet unburdensome. Water is used to stimulate fire, which suddenly extinguishes its brilliance. The sun and moon contend, their radiance enduring only in the interplay of darkness and new moon. When water waxes, *kan* encroaches upon *yang*; when fire wanes, *li* dims the day. *Yin* and *yang* consume one another, their mutual transformation following the Dao’s natural course. The name is fixed by essence, while the term arises from inherent nature. Only when metal returns to its original nature can it be called the Returned Elixir. This elucidates the meaning behind the name \"Returned Elixir,\" which arises from fire’s extinction and metal’s restoration.\n\nI dare not speak idly but emulate the sages’ ancient texts. The *Dragon-Tiger Classic* praises the Yellow Emperor’s Golden Flower; the *Huainanzi* refines autumn stone; Wang Yang adds yellow sprouts. The worthy may practice this, while the unworthy must not partake. From ancient times to the present, the Dao has been a singular discourse. Scholars, exert yourselves, ponder deeply, and grasp the essentials. The words are plain and luminous, never deceiving.\n\n**Middle Section**\n\n*Qian* is firm, *kun* is yielding; their union and containment arise from *yang* endowing and *yin* receiving. Male and female depend on one another, and through their interaction, essence and *qi* unfold. *Kan* and *li* crown the head, their radiance cascading—mysterious and profound, beyond depiction. The sage measures and arranges, grounding the four in the primordial chaos, entering the formless. The sixty-four hexagrams spread like a chariot’s canopy, harnessed to the dragon-horse. The enlightened ruler steers the times, and harmony follows, the path smooth and unerring. The deviant way is perilous, steep, and treacherous, endangering the state.\n\nThis mirrors the opening chapter of the preceding section.\n\nWhen the noble one dwells in his chamber and speaks with virtue, his words resonate a thousand *li* away—such is the lord of ten thousand chariots, issuing decrees from his nine-tiered palace. His commands align with *yin* and *yang*, storing instruments until the proper time, never transgressing the hexagrams. *Zhun* governs the hours of *zi* and *shen*, while *meng* governs *yin* and *xu*. The remaining sixty hexagrams each have their appointed days. Here, two images are presented, though their full intricacies remain unexplored. Establishing principles and enacting punishments, bestowing virtue upon the benevolent, and dooming the rebellious to misfortune—these follow the calendar’s decrees. Sincerity and precision are paramount; observe the celestial stems and branches, scrutinizing their waxing and waning. Even the slightest deviation invites regret and harm. At the solstices, the degrees shift; errors accumulate, and distortions arise. In the depths of winter, scorching heat; in the height of summer, hail and snow. At the equinoxes, imbalance reigns—timekeeping falters, wind and rain arrive unseasonably, drought and flood contend, locusts surge like boiling water, mountains crumble, and the earth splits. Heaven displays its omens, and strange portents emerge. The filial son’s devotion stirs the August Ultimate, its effects rippling near and far, even to distant lands. These may bring calamity or fortune, usher in peace or war—all stem from the heart’s movements.\n\nMaintain constancy in action and stillness, adhering to the plumb line. Harmonize with the four seasons and the *qi* to discern firmness and yielding. They do not intermingle; the Five Phases observe their boundaries, neither overfilling nor depleting. The *Yi*’s cycles flow—bending and extending, reversing and returning.\n\nThis mirrors the preceding section’s discussion of *zhun* and *meng*, their inner and outer applications intertwined. *Qian* governs *jia* and *ren*; *kun* governs *yi* and *gui*; *zhen* governs *geng* and *xin*; *kan* governs *wu*; *li* governs *ji*; *gen* governs *bing*; *dui* governs *ding*.\n\nThe method of doubling the hexagrams: *Qian*’s lower three lines govern *jiazi*, *jiayin*, and *jiachen*, while the upper three govern *renwu*, *renshen*, and *renxu*. *Kun*’s lower three lines govern *yimao*, *yichou*, and *yihai*, while the upper three govern *guisi*, *guichou*, and *guiyou*. *Zhen*’s lower three lines govern *gengzi*, *gengyin*, and *gengchen*, while the upper three govern *gengwu*, *gengshen*, and *gengxu*. *Xun*’s lower three lines govern *xinchou*, *xinhai*, and *xinyou*, while the upper three govern *xinwei*, *xinmao*, and *xinsi*. *Kan*’s lower three lines govern *wuchen*, *wuyin*, and *wuzi*, while the upper three govern *wuxu*, *wushen*, and *wuwu*. *Li*’s lower three lines govern *jichou*, *jihai*, and *jiyou*, while the upper three govern *jisi*, *jiwei*, and *jimao*. *Gen*’s lower three lines govern *bingchen*, *bingwu*, and *bingshen*, while the upper three govern *bingxu*, *bingzi*, and *bingyin*. *Dui*’s lower three lines govern *dingmao*, *dingchou*, and *dinghai*, while the upper three govern *dingyou*, *dingwei*, and *dingsi*. The inner body spans from *zi* to *chen* and *si*, while the outer application ranges from *wu* to *xu* and *hai*. Thus, at dawn during *zhun*, the *jiazi* line of the initial nine corresponds to the *zi* hour, and the *wushen* line of the six in the fourth place corresponds to the *mao* hour. At dusk during *meng*, the *wuyin* line of the initial six corresponds to the *wu* hour, and the *wuxu* line of the six in the fourth place corresponds to the *you* hour. The remaining sixty hexagrams follow this method. This reiterates the fire-times within a single day.\n\nBetween the dark and new moons, the signs align, and the primordial chaos flows. The female and male unite, their essences blending, moistening and nourishing, their transformations circulating. Heaven and earth’s spirits defy measurement. Utilize this to stabilize the body, conceal the form, and preserve the origin.\n\nIn the northeast, near the Dipper and *Ji* constellations, the wheel turns rightward, spewing forth sprouts. Hidden in the depths, images emerge, and radiant essence scatters. Above *Bi* and *Mao*, *zhen* stirs, heralding the inception of *yang* *qi*. The initial nine, the Hidden Dragon, establishes *yang* with three and *yin* with eight, thus connecting them. On the third day, *zhen* moves; on the eighth, *dui* acts. The nine in the second place, the Visible Dragon, embodies harmony and clarity, its virtues perfected. The *qian* body is complete. The nine in the third place, vigilant at dusk, waxes and wanes, its spirit tallying the ebb and flow, gradually transforming until it returns to its origin. *Xun* continues the lineage, firmly grasping its borders. The nine in the fourth place, leaping or retreating, treads a perilous path. *Gen* governs advance and retreat, forbidding transgression of the appointed time. On the twenty-third day, it holds to its allotted period. The nine in the fifth place, the Flying Dragon, ascends to heaven’s throne, its joy unmatched. The six in the fifth place, *kun*’s embrace, binds the beginning and end, nurturing all beings as the eternal mother. When *yang*’s numbers are exhausted, they recommence, emotions aligning with nature, turning to unite. The nine in the top place, the Exalted Dragon, battles in the wilds. The *yong* of nine, soaring as the Dao’s compass, follows the celestial sphere’s revolutions, ascending and descending, circulating without end. The six lines defy easy scrutiny, for they lack fixed positions—such is the *Yi*’s ancestral origin.\n\nThis again describes the fire-times within a lunar month, using the *qian* hexagram’s six lines to illustrate *yang* *qi*’s waxing and waning. The Dipper and *Ji* refer to the northeast, while *Bi* and *Mao* denote due west—borrowing heaven’s directions to describe earth’s, not implying heaven’s northeast or west. The \"six in the fifth place\" may be a scribal error for \"twenty-six,\" as *kun* governs from the twenty-sixth day onward. The following passage on the *yong* of nine mirrors the earlier discussion of *qian* and *kun*’s dual applications.\n\nAt the new moon’s dawn, *Fu* arises—*yang* *qi* first flows, entering and exiting without hindrance. Erect the gnomon: subtle yet firm, the Yellow Bell establishes *zi*, its omen flourishing and manifest. Scattering warmth, it nurtures the tender and steams the masses, attaining constancy. Tending the furnace, it unfurls branches and opens paths, its radiance pure, growing ever brighter with each passing day. At *chou*, the Great Regulator coalesces, its pitch rising and falling to form *Tai*. Hard and soft flourish together, *yin* and *yang* unite—what was small departs, what is great arrives, converging at *yin* to advance with the season. Gradually traversing *Dazhuang*, it flanks the *mao* gate; elm pods fall, returning to their root. Punishment and virtue contend, day and night first divide.\n\nAt *Guai*, *yin* retreats as *yang* ascends, washing and cleansing feathers and wings, shaking off the dust of old lodgings. *Qian*’s vigor, resplendent and vast, spreads to the four neighbors, *yang* culminating at the center of *si*. *Gou* begins its thread, treading frost—the first wellspring’s chill. At *wu*, *Ruibin* serves *yin*, for *yin* is now host. *Dun* withdraws from its position, gathering its essence, cherishing virtue, awaiting the hour. It lingers in repose.\n\nAt *Pi*, closure and obstruction: what sprouts does not grow. *Yin* extends, *yang* contracts, *yang*’s name and form vanish. Observing its measures, weighing mid-autumn’s mood, it bears the young, the tender, the old, the withered—all revive. Shepherd’s purse and wheat sprout anew, shrouded in life’s mantle.\n\nAt *Bo*, limbs rot, form dissolves, *qi* transforms and depletes, spirit’s path exhausted—it returns to *Kun*’s origin. Ever compliant with earth’s principle, it receives heaven’s decree, spreading afar, profound and distant, yet linked across barriers. It nurtures all, the source of *yin* and *yang*, boundless and indistinct, its beginning unknowable. First lost, then guiding; later, the sovereign. No level ground remains uninclined—such is the Dao’s natural flux, its ceaseless alternation of waxing and waning, mutually engendering. *Kun* ends, *Fu* begins, like tracing an endless ring. Emperors and kings inherit and govern for millennia—this is how the twelve hexagrams finely divide a month’s *huohou*, and likewise a year’s.\n\nA month’s method: two and a half days per hexagram. *Fu* is *Zhen*’s *Kun*; *Lin* is *Dui*’s *Kun*; *Tai* is *Qian*’s *Kun*; *Dazhuang* is *Qian*’s *Zhen*; *Guai* is *Qian*’s *Dui*; *Qian* is *Qian*’s *Qian*; *Gou* is *Qian*’s *Xun*; *Dun* is *Qian*’s *Gen*; *Pi* is *Qian*’s *Kun*; *Guan* is *Kun*’s *Xun*; *Bo* is *Kun*’s *Gen*; *Kun* is *Kun*’s *Kun*. *Lin* is *Fu*’s *Zhen*; *Dazhuang* is *Fu*’s *Dui*; *Qian* is *Fu*’s *Qian*; *Dun* is *Fu*’s *Xun*; *Guan* is *Fu*’s *Gen*; *Kun* is *Kun*’s *Kun*. The principles of extrapolation employ hexagram names, pitch names, and celestial stems—*fucou* is *Taicu*, *xialie* is *Jiazhong*, *xizhuo* is *Guxi*, *zhong* is *Zhonglü*, *moshu* is *Linshen*, *shen* is *shen*, *renxu* is *Nanlü*, *ge* is *hai*, *ying* is *Yingzhong*. Most are metaphorical allusions, not to be scrutinized deeply.\n\nThe phrase \"later the sovereign\" should read \"after studying the *Yi*, one attains sovereignty\"—the error has persisted long.\n\nTo cultivate nature, prolong life, and forestall aging, one must first reflect on origins. The body one inherits is originally undifferentiated, its primordial essence dispersed, borne by *qi*, its measure set by *yin* and *yang*. Here dwell *hun* and *po*: *yang* spirit is the sun’s *hun*, *yin* spirit the moon’s *po*. *Hun* and *po* serve as each other’s abodes. Nature presides within, establishing boundaries; emotion operates without, building walls and ramparts. When walls and ramparts are whole, beings find peace.\n\nAt this time, emotion aligns with *Qian* and *Kun*: *Qian* moves and straightens, *qi* spreads, essence flows; *Kun* is still and receptive, the Dao’s dwelling. The firm retreats, the soft transforms and nourishes. Nine returns, seven reverses, eight reverts, six resides—male is white, female red. Metal and fire restrain each other, then water settles. Fire is the first of the Five Phases, the highest good like water, clear and flawless—the Dao’s form, the True One, hard to depict. Changing and dispersing, each dwells alone, like a chicken’s egg: black and white conjoined, an inch in diameter, the beginning. Limbs, five viscera, sinews, and bones take shape, enduring ten months before emerging from the womb—bones pliable as silk, flesh smooth as lead.\n\nThis mirrors the earlier \"Knowing the White\" and \"Pivot of the Yellow Cart,\" speaking of human birth as the union of *yin* and *yang*. Now, to forge the elixir, one proceeds likewise. All references to the Dao are veiled names for the elixir. \"Lead\" may be a corruption of \"maltose,\" a phonetic error.\n\nThe solar mirror gathers fire—without the sun, no light is born. The moon’s vessel yields no water without stars. These two *qi*, though distant, still resonate—how much more so when near, dwelling close to heart and chest? *Yin* and *yang* pair with sun and moon; water and fire serve as proof.\n\nThe three treasures—eyes, ears, mouth—must be firmly sealed, not vented. The true person lurks in the deep abyss, floating and roaming, guarding the compass’s center, circling and bending to survey. Opening and closing align, the axle and linchpin their own. Movement and stillness never cease; *li* *qi* internally guards and protects. *Kan* is not used for hearing, *dui* does not speak—few words accord with the primordial chaos. These three are the key. Relax the body, dwell in an empty chamber, entrust your will to emptiness, make non-thought your constant. Proof is unshakable; the heart, undistracted, does not stray. In sleep, spirit embraces spirit; upon waking, it awaits presence or absence. The countenance gradually moistens, bones and joints grow ever stronger. Repelling the host of *yin* demons, one then establishes true *yang*, cultivating it without cease. The bedchamber’s *qi* becomes clouds and rain, flowing gently like spring’s moisture, trickling like melting ice—from head to feet, then back upward, ascending and descending through the boundless cavern. Flourishing within, this is the Dao’s verification. Weakness is virtue’s handle. Weed and hoe old impurities, even the minute, to attain harmony. The turbid’s path: long obscured, then bright.\n\nThis passage concerns the work of nurturing the root—especially vital.\n\nThose who favor petty arts do not discern the Dao’s depth, abandoning the true for the deviant. Seeking speed, they block their path, like the blind without a staff, the deaf hearing music, diving for pheasants and hares, climbing mountains for fish and dragons, planting wheat to harvest millet, or using a compass to seek squares. Exhausting spirit and strength, they see no results year after year.\n\nTo know the method of ingesting the elixir: it is simple, not cumbersome. The sun’s flowing pearl ever seeks to leave; suddenly, golden blossoms arise, transforming and intermingling to become a white liquid, congealing into hardness. The golden blossom first initiates; in a moment, it dissolves into the Water Horse’s teeth, wilted and dry. *Yang* then proceeds to harmonize nature and emotion, naturally pressing forward. *Yin* constrains and binds, like a kind mother nurturing, a filial son repaying kindness, a stern father issuing commands to discipline descendants. The Five Phases clash and prevail, relying on each other to generate fire. Fire’s nature melts metal; metal chops wood. The three, five, and one—heaven and earth’s purest essence—can be transmitted orally but not in writing.\n\nYou should turn right at *wu*, then rotate east at *mao* and *you*, where boundaries divide. The host stabilizes two names: the dragon calls to the tiger, the tiger inhales the dragon’s essence. Both drink and eat, mutually coveting, chasing and biting, swallowing each other. Mars guards the west, Venus traverses the sky—where killing *qi* descends, what does not topple? Foxes and dogs guard the pass; birds and sparrows fear the goshawk. Each has its function—how dare they make a sound?\n\nWithout grasping the principle, idle talk is futile. Exhausting family wealth, leaving wife and children destitute—from ancient times to now, countless have pursued this, yet few succeed. Broadly seeking fame, delighting in what contradicts the Dao—if you truly encounter it, observe its threads, compare and measure things from beginning to end. The Five Phases overcome each other, alternating as father and mother. The mother contains nourishing fluids; the father bestows essence, congealing form. Metal and stone do not decay. Focused and undivided, not leaking—this is the way to achieve the Dao.\n\nThose who study petty arts labor without result; those who attain this method find it simple, not cumbersome. The following, from \"The Sun’s Flowing Pearl\" onward, mirrors the earlier \"Knowing the White,\" \"Pivot of the Yellow Cart,\" and other chapters. The Five Phases engender each other—this is the kindness of mother and child.\n\nFire and Metal overcome each other—this is the stern command of the father. The \"Three and Five\" refers to Fire, Metal, Wood, and the Five, all receiving the qi of Earth. Another interpretation holds that the \"Three and Five\" are the Zi, Wu, Wu, and Si of the earlier chapter. Yet another view remains unclear, or suggests that \"as\" should read \"with\" in the following passage, aligning with the \"Three and Five\" below—while \"east\" should be \"left.\" This speaks of the fixed positions of yin and yang.\n\nThe six lines on Dragon and Tiger express the kindness of mother and child. From \"Mars and Venus\" onward, the eight lines describe the stern command of the father. Those who fail to grasp the principle and broadly seek the elixir of fame pursue external alchemy. Comparing and measuring things, as in the earlier chapter, the Eight Stones serve as the fundamental standard.\n\nSetting up a pole casts a shadow; calling into a valley echoes a response—how can this not be efficacious? Yet the supreme images of Heaven and Earth, if treated carelessly—like a single *ye* herb or a liang of croton entering the throat—will cause one to stiffen, unable to bend or straighten. At such a time, even if King Wen cast yarrow stalks, Confucius interpreted omens, Bian Que wielded needles, or Wu Xian beat drums, how could they revive the fallen or restore the dead to swift movement?\n\nBy the riverside, the radiant maiden is most divine: when she obtains fire, she flies away, leaving no dust or trace. Dragons and demons hide, their whereabouts unknown. To restrain her, yellow sprouts serve as the root. No thing lacks yin and yang; to defy Heaven and oppose the source is like a fat hen hatching her chicks—why are they not whole? Because the union is incomplete: the Three and Five do not meet, hardness and softness remain apart, and the essence of transformation scatters. The natural order of Heaven and Earth—fire rising and flaming upward, water flowing and moistening downward—requires no teacher to guide it. The origin and governance of things cannot be altered.\n\nWhen male and female unite, hardness and softness bind inseparably, attaining their proper rhythm without need for craft or control. Just as a boy is born prone and a girl supine, so too do they receive qi from the womb and placenta—not merely at birth, but even in death, they mirror this pattern. This is not taught by parents; it is determined at the moment of union. Kan (the male) is the Moon, Li (the female) the Sun. The Sun bestows virtue; the Moon spreads its light. The Moon receives the Sun’s transformation, its body unharmed. If yang loses its bond, yin encroaches upon its brightness; at conjunction and new moon, they press close, enveloping one another. Yang’s form wanes; yin’s encroachment brings calamity.\n\nMale and female depend on each other, inhaling and exhaling to nourish; male and female intermingle, seeking one another. When Metal transforms into Water, Water’s nature circulates restlessly. When Fire transforms into Earth, Water cannot flow. Thus, the male moves outward, the female remains within. If overflowing exceeds measure, the female restrains him; the po checks the hun, preventing excess. Neither cold nor heat, advancing and retreating in harmony—each attains balance, both emitting confirming signs.\n\nThe analogy of poison’s power to kill and yellow sprouts’ power to restrain the radiant maiden illustrates external alchemy, here referring to cinnabar. Yet its precise meaning remains unclear. The passage beginning \"No thing lacks yin and yang\" clarifies the principles of things: for this method, the union of yin and yang is fundamental.\n\nCinnabar is the essence of Wood, and when it obtains Metal, they merge. Where Metal and Water unite, Wood and Fire become companions. These four, in primordial chaos, array as Dragon and Tiger: the Dragon is yang, odd in number; the Tiger is yin, even in number. The Liver, green, is the father; the Lungs, white, the mother; the Kidneys, black, the child; the Spleen, yellow, the ancestor. Three things form a family, all converging in Wu and Si. Hardness and softness alternate, traversing their divisions. The Dragon lies west, the Tiger east; the warp is established at Mao and You. Punishment and virtue guard each other, meeting in joy. Punishment subdues killing; virtue governs generation. In the second month, the elm dies when the Demon Star nears Zi and Mao; in the eighth month, wheat sprouts when the Celestial Stem stands at You. Zi is south, Wu is north—they serve as the fundamental standard. The numbers nine and one cycle endlessly, beginning anew. Embracing the original and holding to the true, they sow essence in the child.\n\n*\"Guan guan go the ospreys, on the isle in the river. The modest, retiring, virtuous young lady: for our prince a good mate she.\"* The male does not dwell alone; the female does not live in solitude. The Dark Warrior, tortoise and snake coiled together, illustrate the mutual dependence of male and female. If two women share a chamber, their beauty exquisite, even if Su Qin speaks persuasively, Zhang Yi arranges the match, their hair unbound and tongues eloquent, their words sweet and hearts in harmony—urging them to wed—their hair will rot and teeth decay before they know each other. If herbs and minerals are not of the same kind, their names and categories differ, their proportions misaligned, their standards lost—even if the Yellow Emperor tends the furnace, the Great One descends to sit, the Eight Lords pound and grind, Huainan holds the fire and erects the hall, the altar is raised with jade steps, unicorn jerky and phoenix腊 are offered, registers are held and prayers kneeling recited, spirits and gods entreated, ghosts implored, with bathing and fasting—all in vain hope—it is like applying glue to a cauldron to heal a wound, adding ice to remove cold, or using hot water to fly tortoises and dance snakes: the result is only greater disorder.\n\n\"Cinnabar is the essence of Wood, and when it obtains Metal, they merge\" echoes the earlier chapter’s \"radiant maiden and yellow sprouts.\" The two chapters on the red heart and yellow spleen are absent in some versions; it is unclear which is correct. The lines on Dragon and Tiger, Zi and Wu intersecting in their positions, and the passage beginning *\"Guan guan\"* further clarify that herbs and minerals not of the same kind are like two women.\n\n---\n\n**Later Chapter**\n\nOnly the sages and worthies of old embraced the mysterious and held to the true, ingesting the nine-times-cycled elixir. Their traces transformed, dragons and fishes concealed; they contained essence and nurtured spirit, penetrating virtue’s three origins. Essence and fluids converged in their principles, sinews and bones became firm. All evil was repelled; vital qi remained constant. Through long accumulation, they changed form and became immortals.\n\nGrieving for later generations who love the Dao, they followed the winds and gathered traces, inscribing ancient texts and creating diagrams to reveal the branches and leaves while concealing the root. They entrusted names to various stones, veiling the workings of internal yin and yang. Scholars who obtained these texts stored them in caskets, passing them down through generations. Sons followed fathers, grandsons succeeded ancestors—yet through the ages, confusion reigned, and none perceived the truth. Thus, officials failed in their duties, farmers neglected their fields, merchants abandoned their goods, and scholars impoverished their families. I lament this deeply.\n\nThis record is concise, its principles simple, its affairs unburdensome. Its clauses are laid out, its facts verifiable, its weights and measures precise. Following one another, they form a tangled web of words, their gates and apertures obscure. The wise will ponder deeply and compare them with intent.\n\nThe immortals of old wrote books to instruct others but did not speak plainly of their methods, instead using the names of stones to signify the internal workings of yin and yang. Thus, many scholars lost the thread. This book is written to be brief and easily understood, yet I still fear its secrets may leak. Therefore, I have filled it with misleading and disordered words, obscuring its gates and apertures. The following songs distill the book’s essential meaning.\n\n*(Note: The appended disordered words resemble the \"Luan\" section of the* Li Sao. *See below.)*\n\nNo image is greater than Heaven and Earth;\nThe mysterious gully spans ten thousand li.\nThe Drum Star nears the Starry Sequence—\nThe people all tremble in fear.\nShadows recklessly advance and retreat;\nNine years of misfortune befall.\nThe August Emperor gazes upon it—\nThe king retreats and reforms himself.\nThe key has its highs and lows;\nHarmful qi flees in haste.\nThe rivers and Huai run dry—\nWaters flow into the sea.\n\nThis passage speaks of the calamity of floods overflowing. If the king can reform himself, harmful qi will cease, and water and earth will be balanced. The \"mysterious gully\" refers to the Celestial River; \"Drum Star\" is a star’s name; \"Starry Sequence\" is the position of *chou*. Its meaning remains unclear. \"Nine years\" refers to the Great Flood. \"Key has its highs and lows\" signifies the ascent and descent of yin and yang. \"Harmful qi\" is the qi of disaster, illustrated through the analogy of the human body—also representing the unbalanced interaction of water and fire.\n\n*(Appended: Zhu Xi says, \"The 'mysterious gully' and 'harmful qi' likely refer to matters within the human body, serving as metaphorical language. The *Biography of Wang Mang* states, 'The harmful qi is about to be exhausted.' The above text describes the disaster of floods, and if the king reforms, harmful qi departs, and the floods subside. 'Harm' was mistakenly written as *zhou*, then further corrupted to *gu*; later scholars erroneously altered it to 'essence' and added the word 'increase,' both incorrect. However, the character *zhou* reveals its origin as 'harm,' for their seal and ancient scripts are similar.)*\n\nHeaven and Earth as female and male,\nWander between *zi* and *wu*, *yin* and *shen*.\nYin and yang’s origin,\nEnters and exits, completes its beginning and end.\nFollowing the Dipper’s handle in its sweep,\nGrasping the balance to fix the primal order.\nAscending and roasting on Mount Zeng,\nThe blazing fire spreads below.\nThe White Tiger leads the way,\nThe Azure Fluid harmonizes behind.\n\n*(Appended: Zhu Xi says, \"Tiger was once written as *yu*, once as *fan*. All three are borrowed names. The next line speaks of 'azure fluid,' so if this is *yu* or *fan*, and the preceding text mentions 'magnet' (*yu ci*), then *yu* is appropriate. Yet the following line mentions the 'Vermilion Bird' and lists the names and positions of the Three Beasts, so this should be 'Tiger,' and 'fluid' should be 'Dragon.' 'Leads the way' corresponds to the earlier 'roasting pivot,' while 'harmonizes behind' seems to refer to sentient beings. Thus, using Dragon and Tiger is fitting. This passage describes refining water with fire, then restraining fire with water, uniting Metal and Water to return to the original state.\")*\n\nThe Vermilion Bird soars and plays,\nIts feathers gleam with five hues.\nEncountering nets and snares spread,\nIt is pressed down, unable to rise.\nIts wails are mournful,\nLike an infant longing for its mother.\nOverturned into the boiling cauldron,\nIts feathers and plumage are crushed and broken.\nBefore half a *ke* has passed,\nDragon scales stir in restless motion.\nFive-colored forms dazzle,\nTransforming without constancy.\nThe bubbling cauldron boils fiercely,\nSurging violently without cease.\nLayered and piled in disarray,\nLike interlocking dog’s teeth.\nIts form resembles midwinter ice,\nWith stalactites jutting forth.\nTowering and jumbled together,\nThey accumulate and prop each other up.\nWhen yin and yang find their match,\nThey settle in tranquil harmony.\nThe Azure Dragon dwells in House Six,\nSpring blossoms in the east at *mao*.\nThe White Tiger resides in *You* Seven,\nAutumn’s edge in the west at *you*.\nThe Vermilion Bird in *Zhang* Two,\nThe true yang of *Li* in the south at *wu*.\nWhen all three come to court,\nTheir kin become companions.\nOriginally two things,\nIn the end, they become three and five.\nThree and five unite with one,\nAll gathering at the second place of governance.\nAs described above,\nThe days are counted, first white, then yellow,\nWith red permeating inside and out.\nThis is called the First Cauldron,\nIts nourishment like grains of millet.\n\nThis again summarizes the method of returning the elixir, distilling its essence. *Zi* and *wu* signify *qian* and *kun*; *yin* and *shen* signify *kan* and *li*. \"Ascending and roasting\" refers to the \"roasting pivot\" and steaming. The White Tiger is Metal; the Azure Dragon is Water; the Vermilion Bird is Fire. Metal generates Water, and Water extinguishes Fire to form the elixir—its form is thus. The earlier \"first fluid, then congealing\" and \"horse’s teeth in disarray\" describe this. The \"mournful wails\" correspond to the earlier \"day and night, the sound ever earnest.\" When yin and yang find their match and settle in tranquil harmony, it means \"each guards its domain, dwelling alone.\" *House* is among the seven eastern lodges, with six as its degree. *You* Seven and *Zhang* Two—these two things are yin and yang. Three and five are Fire, Metal, and Wood, all receiving the qi of Earth. \"Unite with one\" and \"gather at the second place\" require careful interpretation of the text, though the meaning of \"first white\" and \"all\" remains unclear.\n\nWhat nature does,\nIs free from deceit or falsehood.\nThe qi of mountains and marshes steams,\nRising as clouds to become rain.\nWhen mud dries, it turns to dust;\nWhen fire dies, it becomes earth.\nLike the yellow dye from *nie*,\nOr indigo making green,\nBoiling hides to make glue,\nOr fermenting yeast to brew wine—\nThough their transformations differ,\nWithout the proper method, skill is in vain.\n\n*(This illustrates the above principles.)*\n\nOnly this wondrous art,\nIs precise and free from deception.\nPassed down to countless generations,\nIt shines clearly for posterity,\nRadiant as the starry Han,\nLuminous as the sea’s source.\nPonder it thoroughly,\nReview it again and again, a thousand times over.\nBrilliant and resplendent,\nAfter ten thousand repetitions, it becomes visible.\nThe divine may reveal it to you,\nOr your spirit may suddenly awaken.\nSeek its threads and origins,\nAnd you will find its gate and door.\nThe Dao of Heaven is impartial,\nYet it is always transmitted to the worthy.\n\nThis passage clarifies the book’s intent: if scholars read it a thousand times, ten thousand times, they will naturally understand, as if the divine had instructed them. Dong Yu said, \"Read a book a thousand times, and its meaning will become clear.\" He also said, \"Ponder it, ponder it again, and ponder it further. If you still do not grasp it, ghosts and spirits will teach you—not by their power, but by the extremity of your spirit. This is no idle talk.\"\n\nThe Five Mutual Reflections:\n*(This text has five chapters: one, the* Cantong Qi*; two, the* Taiyi*; three, the* Xiangbi*; four, the* Kuiguo*; five, the* Weishi*.)*\n\nThe *Cantong Qi* presents an outline,\nYet it is not entirely complete, with omissions and gaps.\nNow I have compiled and supplemented it,\nFilling its lacunae, refining its profundities,\nDrawing connections to ensure coherence,\nAligning its intent and equalizing its aims,\nSo that its purpose remains unobstructed.\nThus, I have composed this *Five Mutual Reflections*,\nIn which the nature and emotions of the *Taiyi* are fully expressed.\nThe nature and emotions of the *Taiyi* each follow their measure.\nThe Yellow Emperor and Laozi explored and compared them,\nAnd the art of furnace and fire has true basis.\nThe Three Ways emerge from the One,\nTheir paths, branches, flowers, leaves, and fruits\nAll depend on the root.\nDo not lose your original sincerity.\nWhat I have spoken is careful and without error.\n\nThe image of midwinter,\nWhen bamboo and trees are broken and harmed,\nAssists yang in interrogating *shang*.\nThe traveler and the lord deeply conceal themselves,\nFollowing the season’s rhythm.\nSeal your lips, do not speak of the Dao of Heaven—\nIt is vast and boundless,\nToo profound for form or description,\nEmpty and still, beyond perception.\nIts framework fades away,\nPreventing errors and lost threads.\nSpeak separately of these Four Images\nTo enlighten later generations who are blind.\n\nThis describes the time between the dark and new moons,\nWhen chaos and the primordial mist take form and hide.\nThe *Taiyi* is without form,\nThe highest good like water,\nThe true unity difficult to depict.\nThe Four Images remain unclear.\n\nThe rustic from Kuai, a humble man of secluded valleys,\n【*Zhu Xi notes: \"Wei Junshi of Shangyu—should read 'Fang Ji' or perhaps 'Wei Kui' in the dialect; the text writes 'Kuai'\"*】\nClasped simplicity and plainness, untouched by fleeting glory.\nDwelling in obscurity, he disregarded fame,\nHolding fast to tranquility, indifferent to worldly ease.\nA wanderer in distant lands, at leisure in the halls of Yan,\nHe composed this text, chanting the *Great Ease*—\nThe three sages’ bequeathed words.\nExamining its hidden purport, he saw all things united in one principle,\nStriving to align with reason, to illumine the spirit,\nThat its numinous transformation might flow freely,\nBringing peace to the four seas.\nHe set it forth as a model for ten thousand generations to follow,\nA guide for governance, effortless in practice.\n\nInwardly cultivating nature,\nHe embraced the natural Way of the Yellow Emperor and Laozi,\nHolding profound virtue within.\nReturning to the root, reverting to the origin—\nIt lies near in the heart, inseparable from the self.\nEmbracing the One, never forsaking it,\nOne may endure forever.\nPaired with dietary arts—\nThe male and female principles arrayed,\nThe eight minerals of Wudu refined and cast aside—\nDiscern their use, and success is achieved.\nWhat the world treasures, he laid out in three branches,\nStems and twigs intertwined,\nAll emerging from a single gate under different names.\n\nNot merely ornate phrases in harmonious pairs,\nThis text holds its truth—\nGrit and gravel may be observed,\nWhile I, in spreading falsehoods, am burdened with excess faults.\nThe *Cantong Qi*’s subtle threads I barely glimpse,\nIts words few, its meaning vast.\nLater descendants should heed and entrust themselves to the times,\nAvoiding harm, relying on the mountains,\nRoaming the boundless expanse,\nNeighbors to spirits,\nTransforming their forms to become immortals,\nMerging with silence, soundless.\nOnce in a hundred generations, they descend to wander among men,\nDisplaying their feathered wings,\nEast and west, south and north, they incline—\nTang met with calamity,\nWater and drought divided,\nBranches and leaves withered and yellowed,\nLosing their flourishing splendor.\nThe fortunate ride in comfort,\nSecure and steadfast, they may attain long life.\n\n**Song of the Cauldron**\nRound, three by five *cun*, its mouth one *fen* wide,\nFour *liang* and eight *qian* in weight, its rim two *chi* long,\nEven in thickness.\nIts belly threefold aligned, seated and suspended,\nEver warm.\n\n**Variations and Annotations**\nTwo *chi* is sometimes written as one *chi* and two *cun*; Peng Xiao interprets it as two *chi*. The \"three alignments\" are sometimes written as \"alignments three.\" *Qi* (齐) here denotes the *navel*.\n\nYin above, yang below—rushing forth:\nThese two lines are the essential method.\n\nHead and tail martial, the center civil;\nYin fire, white and yellow sprouts;\nLead and mercury, the seven apertures as aids;\nThe human gallbladder governs the brain, settling the ascent.\nThe *Xuanzi* abides in the center, secure and preserved.\nComing and going, roaming yet never leaving the gate,\nGradually the great nature is perfected,\nThe temperament pure, returning to the One,\nRestoring the original source.\nOne cycle is most arduous—\nGuard closely, guard against confusion,\nLest the path grow distant and the mystery profound.\nShould one attain this, the joy of Heaven and Earth in the Dao—\nSeek its root, examine the Five Phases,\nWeigh each *zhū* and *fēn* with care,\nReflect deeply—no need for further discourse.\nConceal it, preserve it, do not transmit it.\nMount the white crane, ride the scaled dragon,\nRoam the Great Void, pay homage to the Immortal Lords,\nReceive the celestial charts, be named a Perfected One.\n\n**Colophon and Postface to the *Zhouyi Cantong Qi* with Textual Variants**\n\nThe *Cantong Qi* is coarse in diction yet vast in Dao; its words subtle, its warnings profound. It arrays the Five Emperors to establish enterprise and matches the Three Sovereigns to institute governance. Though lord and minister differ in rank, above and below lack fixed order, yet in ordering governance, great peace is not attained. The methods of ingesting elixirs cannot confer long life; learning to nurture nature does not extend years. Yet in dissecting yin and yang, harmonizing their weights, the waxing and waning of the sun and moon, the images of the Eight Trigrams, the transformations of male and female, the movements of hard and soft, the divisions of activity and stillness—all are judged by the classics, their intent robust. Thus, it sets forth a method to transmit to later worthies. Only those who fathom the great image may attain long life, strengthen the self, and benefit the body. Those who pursue this Dao must apply their minds with gravity.\n\nThis appears to be a postface appended to the commentary, composed by a later hand. The original commentary is lost, and only the preface remains. \"Setting forth a method\" (*lì fǎ*) was likely a scribal error for \"setting forth a commentary\" (*lì zhù*).\n\n**Appended Note by Master Zhu [Xi]**\nSome say this is the postface; others, that it is Wei Jun’s eulogy. The style and meaning suggest it is a postface to the commentary. Peng Xiao’s preface states: \"Wei Jun secretly showed it to Xu, the Attendant of Qingzhou, who annotated it.\" Xu’s given name was Lü, and he provided the commentary. This may be Xu’s own words, for his commentary no longer survives.\n\n**Right: *Zhouyi Cantong Qi* by Wei Boyang**\nWei Jun was a man of the Later Han. The title of his work likely imitates the style of apocryphal texts. Its diction and rhymes are archaic and elegant, difficult to comprehend. Superficial readers rashly alter it, so it contains more errors than other books. Here, I have collated various editions and corrected them against one another. Many passages remain obscure and cannot be fully resolved; I have recorded what I know as a definitive version, preserving all variants for further comparison.\n\n—Zou Fang of Kongtong Daoist Abbey\n\n**Appended Note**\nThe name \"Zou Fang\" was borrowed by Master Zhu as a pseudonym. *Zou* was originally the state of Zhu in the Spring and Autumn period. In the *Record of Music*, \"Heaven and Earth *xié* in harmony,\" Zheng’s commentary reads: \"*Xié* should be *xī*.\"\n\n**Appended Note by Master Zhu [Xi]**\nExamining the *Wei Shu*, it begins with the four trigrams Qian, Kun, Kan, and Li as the bellows and key, then proceeds to the sixty hexagrams of Zhun and Meng to illustrate the early and late stages of daily practice. Next, it discusses the six hexagrams of Na Jia to show the advance and retreat of daily practice, followed by the twelve sovereign hexagrams, which divide the six Na Jia hexagrams into two, detailing the monthly nodes internally while encompassing the yearly work externally. Such is its use of the *Yi* as a framework—nothing more. It never addresses the three hundred eighty-four lines.\n\nThe fire-phase methods transmitted today take the three hundred eighty-four lines as the count of one celestial cycle, with each line governing one day. Since the lines exceed the days, four hexagrams and twenty-four lines are removed, awaiting the arrival of the twenty-four qi to gradually add them. This no longer accords with the natural harmony of the system. Moreover, the lines used each day—whether yin or yang—lack order, and it is unclear how the practice distinguishes them. Furthermore, within a single day, the count already completes three hundred sixty, yet the addition of one qi corresponds to only one line. The imbalance in weight and measure is evident. The twenty-four additions and subtractions proceed by minute increments or abrupt reductions, lacking the cyclical rhythm of advance and retreat. This is likely a later invention, not the original intent of Wei Jun.\n\nI suspect the crux of this book lies in the two trigrams Kan and Li. If one grasps their essential principles, the timing of the practice—though not explicitly stated by Wei Jun—can be inferred. As long as the periods of early and late, advance and retreat are not lost, one may proceed without rigid adherence to old interpretations. Thus, I have deduced the method of *fang* numbers, which, though not mentioned by Wei Jun, offers a coherent system. The method of line counts, though also unaddressed, may yet hold some rationale.\n\nThe moon is divided into twelve hexagrams, each governing two and a half days. Each hexagram’s lines govern the *fang* of its own hexagram. From the hexagram Guan in the eighth month to the hexagram Tai in the first month, yang employs twenty-eight *fang* of youthful yang, while yin employs twenty-four *fang* of mature yin. From the hexagram Dazhuang in the fourth month to the hexagram Pi in the seventh month, yang employs thirty-six *fang* of mature yang, while yin employs twenty-two *fang* of youthful yin. Yang is the intent in motion; yin is the release into stillness. One line suffices as one opening and closing of qi. The twelve hexagrams of rest constitute one day’s work; the twelve hexagrams’ cycle constitutes one year’s movement. The process repeats endlessly, without excess or deficiency. The numbers are illustrated in a diagram, which I intended to discuss with Ji Tong but never sent before his death.\n\n**Appended Note**\nAmong Master Zhu’s earlier works that established his scholarly reputation, he never lightly attached himself to the followers of the sages. He considered the *Manyi Yi* to be by Dai Shiyu and the *Guanziming Yi* to be a forgery by Ruan Kan, so rigorously did he uphold authenticity. Yet regarding the *Cantong Qi*, he offered no skeptical remarks. His interpretation of the *Yi* drew heavily from Shaozi, and he acknowledged that Shaozi’s insights derived from Xi Yi, whose lineage traced back to the *Cantong Qi*. Thus, he deferred to its authority.\n\nHe once remarked: \"I see it clearly in my mind’s eye, but I lack a starting point.\" And again: \"Now I grasp the outline, but I have yet to master the materials, the cavities, the openings.\" In the ding-si year of the Qingyuan era, Ji Tong was assigned to Daozhou. On the eve of his departure, he stayed at Hanquan, where they revised the *Cantong Qi* together through the night without sleep. Alas! Such was the bond between teacher and disciple, unshaken even in hardship, yet so devoted were they to this text. His resolve to transcend the worldly was unmistakable.\n\nThe following year, Ji Tong passed away. Later, he discovered the method of *fang* numbers and regretted not being able to discuss it with Ji Tong. Two years later, the Master himself died.\n\nThus, from the very beginning of their master-disciple relationship, the *Cantong Qi* and the *Yinfu Jing* were held in accord with the sages—this is indeed trustworthy. Therefore, when compiling his work, he placed them after the *Taiji* and *Xiantian* diagrams; how could there be any discrepancy? The *Zhouyi Cantong Qi Kaoyi*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "钦定四库全书　　　　　子部十四 周易参同契考异　　　　道家 提要 【臣】等谨案周易参同契考异一卷宋朱子撰考陈振孙书录解题称朱子以参同契词韵皆古奥雅难通读者浅闻妄輙更改比他书尤多舛误因合诸本更相雠正朱子自防亦称凡诸同异悉存之以备考订故以考异为名今按书中注明同异者惟天下然后治之治字云或作理威光鼎乃熺之熺字云本作僖参证他本者不过二处又如修字疑作循六五疑作廿六铅字疑作饴与字疑作为之朱子所自校者亦祗六七处其余每节之下随文诠释实皆笺注之体不尽订正文字乃以考异为名未喻其防防末自署空同道士邹防盖以邹本邾国其后去邑而为朱故以寓姓礼记郑氏注谓防当作熹又集韵熹虚其切防亦虚其切故以寓名殆以防心丹诀非儒者之本务故托诸廋词欤考朱子语录论参同契诸条颇为详尽年谱亦载有庆元三年蔡元定将编管道州与朱子防宿寒泉精舍夜论参同契一事文集又有答蔡季通书曰参同契更无缝隙亦无心思量但望他日为刘安之鸡犬耳 云云盖遭逢世难不得已而托诸神仙殆与韩愈谪潮州时邀大颠同游之意相故黄瑞节附录谓其师弟子有脱屣世外之意深得其情黄震日抄乃曰参同契者上虞人魏伯阳作其说出于神仙不足凭近世蔡季通学博而不免于尝留意此书而晦庵与之游因为校正其书颇行于世而求其义则绝无之云云其持论固正然未喻有托而逃之意也 乾隆四十六年九月恭校上 总纂官【臣】纪昀【臣】陆锡熊【臣】孙士毅",
      "translated_text": "The Imperial *Complete Library of the Four Treasuries*\nSection: Masters, Volume 14\n*Investigation of Discrepancies in the Zhouyi Cantong Qi*\nDaoist Category\nPreface\n\nWe, your ministers, respectfully note: *Investigation of Discrepancies in the Zhouyi Cantong Qi*, one fascicle, was compiled by Master Zhu of the Song dynasty. Chen Zhensun’s *Book Records with Annotations and Synopses* states that Master Zhu, finding the *Cantong Qi*’s diction and rhymes archaic and elegant, difficult to comprehend, and often recklessly altered by readers of shallow learning—with more errors than in other texts—thus collated various editions and mutually corrected them. Master Zhu himself cautioned that all discrepancies were preserved for reference and verification, hence the title *Investigation of Discrepancies*. Upon examination, however, the text explicitly notes variants in only two instances: for the character *治* in “Only when all under heaven is so can it be *governed*,” which is glossed as “or written as *principle* (理)”; and for *熺* in “the radiant cauldron,” which is noted as originally written *僖*. Other conjectural emendations—such as *修* suspected to be *循*, *六五* suspected to be *廿六*, *铅* suspected to be *饴*, and *与* suspected to be *为*—amount to no more than six or seven instances where Master Zhu himself made corrections. The remainder of the work, with annotations appended to each section elucidating the text, follows the form of commentary rather than exhaustive textual emendation. Thus, the title *Investigation of Discrepancies* does not fully reflect its content.\n\nAt the end of the work, the compiler signs as “Daoist Zou Xu of Kongtong.” As Zou was originally from the state of Zhu, which later lost its city and became the surname Zhu, this is a borrowed name. The *Rites of Zheng*’s commentary notes that *防* should be written as *熹*, and the *Collected Rhymes* states that both *熹* and *防* are pronounced *xū* in the *qí* tone. The adoption of this name likely alludes to the elixir of the cinnabar heart—a teaching beyond the purview of Confucian scholars—hence the veiled language.\n\nExamining Master Zhu’s recorded dialogues, his discussions on the *Cantong Qi* are quite thorough. His *Chronological Biography* also records that in the third year of the Qingyuan era, when Cai Yuanding was to be exiled to Daozhou, he lodged with Master Zhu at Hanquan Retreat, where they discussed the *Cantong Qi* late into the night. In his collected writings, there is a letter to Cai Jitong stating: “The *Cantong Qi* has no gaps, nor does it require mental effort; I merely hope one day to become Liu An’s chickens and dogs.” Such words suggest that, amid the hardships of the era, he had no choice but to take refuge in the rhetoric of immortals—an intent akin to Han Yu’s visit to the monk Dadian while exiled to Chaozhou.\n\nHuang Ruijie’s supplementary notes observe that Master Zhu and his disciples harbored the intention of “casting off the world,” capturing his true sentiment. Huang Zhen’s *Daily Excerpts* remarks: “The *Cantong Qi* was written by Wei Boyang of Shangyu. Its teachings derive from immortals and are not to be trusted. Cai Jitong, a scholar of broad learning yet not without flaws, once devoted himself to this text. Master Zhu, associating with him, thus edited and corrected the work, which has since circulated widely. Yet if one seeks its meaning, it is entirely absent.” While his critique is sound, he fails to grasp the intent to “take refuge under a guise.”\n\nRespectfully submitted after collation in the ninth month of the forty-sixth year of the Qianlong reign.\nGeneral Compilers:\nMinister Ji Yun\nMinister Lu Xixiong\nMinister Sun Shiyi",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 566,
      "start_sentence": 0,
      "end_sentence": 6,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.591949939727783,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "总　校　官【臣】陆　费　墀 钦定四库全书 周易参同契考异 宋　朱子　撰 五代彭晓解义序曰魏伯阳防稽上虞人修真潜默养志虚无博赡文词通诸纬候得古人龙虎经尽获妙防乃约周易撰参同契三篇复作补塞遗脱一篇所述多以寓言借事显异文密示青州徐从事徐乃名而注之桓帝时公复传授与同郡淳于叔通遂行于世参杂也 同通也 契合也 谓与周易理通而义合也 其书假借君臣以彰内外叙其离坎直指汞列以乾坤奠量鼎器明之父母保以始终合以夫妻拘其交媾譬诸男女显以滋生析以阴阳导之反复示之晦朔通以降腾配以卦爻形于变化随之斗柄取以周星分以晨昏昭诸刻漏莫不托易象而论之故明周易参同契云 附按参同契注本凡一十九部三十一卷其目载夹漈郑氏艺文略彭晓本最传然分三卷为九十章以应阳九之数歌鼎器一篇以应水一之数其傅防如此盖效河上公分老子为上经下经八十一章而其实非也鲍氏云彭本为近世浅学妄更秘馆所藏民间所录差误衍脱莫知适从朱子考辨正文引证依据其本始定今不敢又赘附诸说云 附朱子曰参同契本不为明易姑借此纳甲之法以寓其行持进退之候异时每欲学之而不得其传无下手处不敢轻议然其所言纳甲之法则今所传京房占法见于火珠林者是其遗法所云甲乙丙丁庚辛者乃以月之昏旦出没言之非以分六卦之方也 此虽非为明易而设然易中无所不有苟其言自成一家可推而通则亦无害于易伯阳参同契恐希夷之学有些自其源流　先天图与纳音相应蔡季通言与参同契合以图观之坤复之间为晦震为初三一阳生八日为兑月上十五日为干十八日为防一阴生二十三日为艮月下坎离为日月故不用参同以坎离为药余者以为火候　邵子发明先天图图传自希夷希夷又自有所传盖方士技术用以修炼参同契所言是也 参同契文章极好盖后汉之能文者为之其用字皆根据古书非今人所能解以故皆为人妄解世间本子极多其中有云千周灿彬彬兮万遍将可睹神明或告人兮魂灵忽自悟言诵之久则文义要诀自见　须溪刘氏曰古书惟参同契似先秦文 上篇 乾坤者易之门户众卦之父母",
      "translated_text": "**Chief Collators:**\n**Minister** Lu Feichi\n\n*Imperially Commissioned Complete Library of the Four Treasuries*\n*Investigation of Discrepancies in the Zhouyi Cantong Qi*\nBy **Zhu Xi** of the **Song Dynasty**\n\n**Preface to the Exegesis by Peng Xiao of the Five Dynasties:**\nWei Boyang of Guiji in Shangyu was a man who cultivated the Dao in seclusion, nurturing his will in emptiness and nonbeing. His literary prowess was vast, and he was versed in apocrypha and prognostication. Having fully grasped the mysteries of the ancient *Dragon-Tiger Classic*, he then condensed the *Zhouyi* to compose the *Cantong Qi* in three chapters, later adding a supplementary chapter to fill omissions. Much of its content employs allegory, borrowing events to obscurely reveal profound truths. It was secretly transmitted to Xu, an Attendant Officer of Qingzhou—Xu being his surname—who annotated it. During the reign of Emperor Huan, Boyang further transmitted it to his fellow townsman, Chunyu Shutong, whereupon it spread throughout the world.\n\n*Cantong* means \"correspondence\" or \"union\"; *qi* means \"agreement.\" It signifies that the work’s principles correspond and align with those of the *Zhouyi*. The text metaphorically employs the relationship between ruler and minister to elucidate inner and outer, narrates the hexagrams *Li* and *Kan* to directly indicate mercury and lead, and establishes the *Qian* and *Kun* hexagrams as the foundation of the cauldron. It clarifies the beginning and end through the analogy of parents and guardians, unites them as husband and wife to constrain their intercourse, compares them to male and female to manifest generation, and analyzes them through yin and yang to guide their cyclical transformations. It demonstrates the waxing and waning of the moon through obscurity and visibility, coordinates ascent and descent with the hexagrams and lines, follows the handle of the Dipper to circulate the stars, divides time by dawn and dusk, and illuminates the hours through the water clock. Without exception, it discusses all these matters by drawing upon the imagery of the *Yi*. Hence, it is called *Zhouyi Cantong Qi*.\n\n**Appendix:** The annotated editions of the *Cantong Qi* number nineteen works in thirty-one fascicles, as listed in Zheng Qiao’s *Yiwen Lue* of Jiaji. Peng Xiao’s edition is the most widely transmitted, though he divided its three chapters into ninety sections to correspond with the yang number nine, and appended a *Song of the Cauldron* to match the water number one. Such arrangements are mere imitations of the *Heshang Gong*’s division of the *Daodejing* into eighty-one chapters, yet in truth, they are not so. Mr. Bao remarked that Peng’s edition, altered by shallow scholars of recent times, contains errors, omissions, and redundancies in both the Palace copies and those circulated among the people, making it impossible to determine the correct version. Master Zhu, in his collation and emendation, relied on this edition as his basis, and thus we dare not further append other interpretations.\n\n**Appendix—Master Zhu’s Remarks:**\nThe *Cantong Qi* was not originally intended to elucidate the *Yi*. It merely borrowed the method of \"inserting the heavenly stems\" to convey the timing of advancing and retreating in cultivation. In the past, I wished to study it but could not obtain its transmission, nor find a starting point, so I dared not lightly discuss it. However, the method of \"inserting the heavenly stems\" it describes is the same as the divination technique of Jing Fang, as seen in the *Fire Pearl Forest*. What it refers to as *jia*, *yi*, *bing*, *ding*, *geng*, and *xin* pertains to the moon’s appearance and disappearance at dusk and dawn, not to the division of the six hexagrams’ directions.\n\nThough this was not devised to elucidate the *Yi*, the *Yi* encompasses all things. If its teachings form a coherent system that can be extended and applied, they do no harm to the *Yi*. Boyang’s *Cantong Qi* may share some origins with the learning of [Chen] Tuan. The *Xiantian Tu* corresponds with the system of pitch standards, and Cai Jitong claimed it aligns with the *Cantong Qi*. Observing it through the diagram: between *Kun* and *Fu* lies obscurity; *Zhen* represents the third day, when the first yang arises; the eighth day is *Dui*, when the moon’s upper edge is full; the fifteenth day is *Qian*, when the moon is full; the eighteenth day is *Xun*, when the first yin arises; the twenty-third day is *Gen*, when the moon’s lower edge wanes. *Kan* and *Li* represent the sun and moon, hence they are not used in the *Cantong Qi*. The remainder pertains to the firing times.\n\nShao Yong elucidated the *Xiantian Tu*, which was transmitted from Chen Tuan, who in turn received it from another source. This is the technique of the fangshi, employed in cultivation—precisely what the *Cantong Qi* describes.\n\nThe *Cantong Qi*’s literary quality is excellent, likely composed by one of the finest writers of the Later Han. Its diction is based on ancient texts, incomprehensible to modern readers, which has led to many misinterpretations. Numerous versions exist, one of which states:\n*\"After a thousand cycles, resplendent and flourishing,\nTen thousand repetitions will reveal the numinous.\nIt may enlighten others, or the spirit may suddenly awaken on its own.\"*\nReciting it over time, the essential meaning and key instructions will naturally become clear.\n\n**Liu of Xuqi** remarked: \"Among ancient texts, only the *Cantong Qi* resembles pre-Qin prose.\"\n\n**Upper Chapter:**\n*Qian* and *Kun* are the gate and door of the *Yi*, the parents of all hexagrams.",
      "overlap_context": "road learning yet not without flaws, once devoted himself to this text. Master Zhu, associating with him, thus edited and corrected the work, which has since circulated widely. Yet if one seeks its meaning, it is entirely absent.” While his critique is sound, he fails to grasp the intent to “take refuge under a guise.”\n\nRespectfully submitted after collation in the ninth month of the forty-sixth year of the Qianlong reign.\nGeneral Compilers:\nMinister Ji Yun\nMinister Lu Xixiong\nMinister Sun Shiyi",
      "start_char": 566,
      "end_char": 1382,
      "start_sentence": 7,
      "end_sentence": 21,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.004793882369995,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "乾坤以宇内言之则干天在上坤地在下而阴阳变化万物终始皆在其间以人身言之则干阳在上坤阴在下而一身之阴阳万物变化终始皆在其间此乾坤所以为易之门户众卦之父母也凡言易者皆指阴阳变化而言在人则所谓金丹大药者也然则乾坤其炉鼎欤 坎离匡郭运毂正轴 乾坤位乎上下而坎离升降于其间所谓易也先天之位干南坤北离东坎西是也故其象如垣郭之形其升降则如车轴之贯毂以运轮一下而一上也毂车轮之心外实而持辐内空以受轴者也轴车下横木两头贯毂而受辖者也 牝牡四卦以为槖钥 牝牡谓配合之四卦震兑防艮是也槖鞴囊钥其管也盖纳甲之法干为望坤为晦而坎离升降于其间震为生明而兑为上防为生魄而艮为下如鼓鞴之有缓急也 附朱子曰邵子云乾坤定上下之位坎离列左右之门参同契首卦位铺排都只一般 覆冒阴阳之道犹工御者执衔辔准绳墨随轨辙处中以制外数在律历纪 此言人心能统阴阳运毂轴以成丹也衔辔谓所以使阴阳者绳墨谓火候轨辙指其升降之所由中谓心外谓气数即下文六十卦之火候也 月节有五六经纬奉日使兼并为六十刚柔有表里月以五日为一节六节为一周兼昼夜为六十以配六十卦昼刚夜柔刚里柔表盖六十四卦除乾坤坎离为炉灶丹药所用以为火侯者止六十卦也 朔旦屯直事至暮当受昼夜各一卦用之如次序此六十卦之凡例一月而一周盖逐日用功时刻之早晚也 既未至晦爽终则复更始日辰为期度动静有早晚既未谓晦日之卦朝既济莫未济也爽谓生明之时 春夏据内体从子到辰巳秋冬当外用自午讫戌亥春夏为朝秋冬为莫内体谓前卦外用谓后卦此亦六十卦之凡例后篇屯以子申用寅戌乃以纳甲之法尽发之大率一日所用子午夘酉四时而已 赏罚应春秋昏明顺寒暑爻辞有仁义随时发喜怒如是应四时五行得其序 此言朝暮用功有不同之处未详其说 天地设位而易行乎其中矣天地者乾坤也设位者列阴阳配合之位也易谓坎离坎离者乾坤二用 此引易而释之以明乾坤坎离之用言干上而坤下离降而坎升也乾坤二用谓干用九坤用六九老阳六老阴也 二用无爻位周流行六虚往来既不定上下亦无常幽潜沦匿升降于中包囊万物为道纪纲以无制有器用者空故推消息坎离没亡 乾坤二卦六爻九六各有定位唯用九用六无定位而六爻之九六即此九六之周流升降也纳甲之法干纳甲壬坤纳乙癸震纳庚防纳辛艮纳丙兑纳丁皆有定位而坎纳戊离纳已无定位盖六卦之阴阳即坎离中爻之周流升降也故以此之无制彼之有知器有形而其用乃在其形之空处盖用老子所谓挻埴以为器当其无有器之用之语也消息谓自坤之息历震兑而极于干自干而消历防艮而极于坤也没亡谓无位也后章用九翩翩为易宗祖一节亦是此意也 附朱子曰或问参同本是龙虎上经果否曰不然盖是后人见伯阳传有龙虎上经一句遂伪作此经大槩皆是括参同之语而为之也其间有说错了处如二用云者用九用六九六亦坎离也六虚者即乾坤之初二三四五上六爻位也言二用虽无爻位而常周流乎乾坤六爻之间犹人之精气上下周流乎一身而无定所也龙虎经却错说作虚危去盖讨头不见牵合一字来说 附按彭氏以为魏公得古文龙虎经而撰参同契朱子以为经乃后人伪作今考参同契中有古文记龙虎之文往往古有其文如火记之特恐非今所传者耳鲍氏云此乃三坟书狐首经之比未可知也",
      "translated_text": "Qian and Kun, when spoken of in terms of the cosmos, mean that Qian as Heaven is above and Kun as Earth is below, and the transformations of yin and yang, the beginnings and endings of the myriad things, all occur between them. When spoken of in terms of the human body, Qian as yang is above and Kun as yin is below, and the yin and yang of the entire body, the transformations of the myriad things, their beginnings and endings, all occur between them. This is why Qian and Kun are called the gate and door of the *Yi*, the parents of all hexagrams. All discussions of the *Yi* refer to the transformations of yin and yang, which in the human body are what is called the Golden Elixir and the Great Medicine. Thus, are Qian and Kun not the crucible and furnace? Kan and Li serve as the enclosing frame, turning the hub and aligning the axle.\n\nQian and Kun are positioned above and below, while Kan and Li ascend and descend between them—this is what is meant by the *Yi*. In the arrangement of the precelestial positions, Qian is south, Kun is north, Li is east, and Kan is west. Thus, their configuration resembles the shape of a walled enclosure, and their ascent and descent are like an axle piercing the hub to turn the wheel—one descends as the other ascends. The hub is the center of the wheel, solid on the outside to hold the spokes and hollow within to receive the axle. The axle is the horizontal wood beneath the cart, its two ends passing through the hubs to receive the linchpins.\n\nThe four trigrams of union—Zhen, Dui, Xun, and Gen—serve as the bellows and its pipe. The \"four trigrams of union\" refer to the paired trigrams Zhen and Dui, Xun and Gen. The bellows and its pipe are like the mechanism of the *na jia* method. Qian represents the full moon, Kun the new moon, while Kan and Li ascend and descend between them. Zhen governs the waxing light, Dui the culmination of brightness; Xun governs the waxing darkness, and Gen the culmination of obscurity—like the bellows, which has its rhythms of tension and release.\n\n**Appendix (Zhu Xi’s remark):**\nMaster Shao said: \"Qian and Kun establish the positions of above and below; Kan and Li arrange the gates of left and right.\" The *Cantong Qi* begins by laying out the hexagram positions—all following the same principle.\n\nThe Way of covering and enveloping yin and yang is like a skilled charioteer holding the reins and bit, guided by the marking line and carpenter’s square, following the tracks to maintain the center and regulate the external. The numbers are recorded in the pitch pipes and calendrical systems.\n\nThis speaks of how the human mind can govern yin and yang, turning the hub and axle to form the Elixir. The \"reins and bit\" refer to what directs yin and yang; the \"marking line and carpenter’s square\" refer to the firing times; the \"tracks\" indicate the pathways of ascent and descent; \"center\" refers to the mind; \"external\" refers to qi; and \"numbers\" refer to the firing times of the sixty hexagrams described below.\n\nThe lunar nodes have five or six divisions; following the sun’s path, they combine to form sixty. Hard and soft have inner and outer aspects. The moon takes five days as one node, six nodes as one cycle, and combining day and night makes sixty, corresponding to the sixty hexagrams. Day is hard, night is soft; hard is inner, soft is outer. Among the sixty-four hexagrams, Qian, Kun, Kan, and Li are used as the furnace, crucible, and medicine, leaving sixty hexagrams to serve as the firing times.\n\nAt dawn on the new moon, *Zhun* governs the affairs of the day; by dusk, *Ge* takes its place. Day and night each correspond to one hexagram, used in sequence. This is the general rule for the sixty hexagrams—a full cycle completes in one month, reflecting the early and late timing of daily practice.\n\nBefore the end of the dark moon and the break of dawn, the cycle begins anew. The celestial stems and branches serve as the measure; movement and stillness have their early and late phases. \"Before the end\" refers to the hexagram of the dark moon—morning is *Ji Ji*, evening is *Wei Ji*. \"Break of dawn\" refers to the time when light is born.\n\nIn spring and summer, rely on the inner body, proceeding from *zi* to *chen* and *si*; in autumn and winter, employ the outer use, starting from *wu* and ending at *xu* and *hai*. Spring and summer correspond to morning, autumn and winter to evening. The \"inner body\" refers to the preceding hexagram, the \"outer use\" to the following hexagram. This is also a general rule for the sixty hexagrams. The latter chapter states: *Zhun* uses *zi* and *shen*, *Ge* uses *yin* and *xu*—this fully expounds the *na jia* method. Generally, the four times of *zi*, *wu*, *mao*, and *you* are used in a single day.\n\nRewards and punishments correspond to spring and autumn; dawn and dusk follow the sequence of cold and heat. The line statements embody benevolence and righteousness, manifesting joy and anger in accord with the seasons. Thus, they respond to the four seasons and five phases, maintaining their proper order.\n\nThis speaks of how morning and evening practice differ, though the details are not fully explained.\n\nHeaven and Earth take their positions, and the *Yi* operates within them. Heaven and Earth are Qian and Kun; \"take their positions\" refers to the arrangement of yin and yang in their paired positions. The *Yi* refers to Kan and Li—Kan and Li are the two functions of Qian and Kun.\n\nThis quotes the *Yi* to explain the functions of Qian, Kun, Kan, and Li, clarifying that Qian is above and Kun below, Li descends and Kan ascends. The \"two functions\" refer to Qian’s \"use of nine\" and Kun’s \"use of six\"—nine is old yang, six is old yin.\n\nThe two functions have no fixed line positions; they circulate through the six voids. Their coming and going are not fixed; neither above nor below is constant. They hide and conceal, ascending and descending within, enveloping the myriad things as the guiding principles of the Dao. By means of the formless, they regulate the formed; the vessel’s function lies in its emptiness. Thus, the waxing and waning of Kan and Li vanish without trace.\n\nThe two hexagrams Qian and Kun each have six lines, with nine and six in fixed positions. Only the \"use of nine\" and \"use of six\" have no fixed positions, yet the nine and six of the six lines are precisely these nine and six, circulating and ascending/descending. In the *na jia* method, Qian corresponds to *jia* and *ren*, Kun to *yi* and *gui*, Zhen to *geng*, Xun to *xin*, Gen to *bing*, and Dui to *ding*—all have fixed positions. Only Kan corresponds to *wu* and Li to *ji*, which have no fixed positions, for the yin and yang of the six trigrams are the circulation and ascent/descent of the middle lines of Kan and Li. Thus, the formless here governs the formed there; the vessel has form, yet its function lies in the emptiness of its form. This aligns with Laozi’s words: \"Kneading clay to make a vessel, it is where there is nothing that the vessel’s use resides.\" \"Waxing and waning\" refer to the waxing from Kun through Zhen and Dui to its culmination in Qian, and the waning from Qian through Xun and Gen to its culmination in Kun. \"Vanishing without trace\" means having no position. The later chapter’s passage on the \"use of nine\" fluttering as the ancestral hexagram of the *Yi* expresses the same idea.\n\n**Appendix (Zhu Xi’s remark):**\nSomeone asked: \"Is the *Cantong Qi* truly the *Dragon-Tiger Upper Classic*?\"\nZhu Xi replied: \"No. Later people, seeing that Master Boyang’s transmission included the phrase *Dragon-Tiger Upper Classic*, fabricated this text. Generally, it is a patchwork of phrases from the *Cantong Qi*, though some parts are mistaken. For example, the 'two functions' refer to the 'use of nine' and 'use of six'—nine and six are also Kan and Li. The 'six voids' are the first, second, third, fourth, fifth, and top line positions of Qian and Kun. It says that although the two functions have no fixed line positions, they constantly circulate through the six lines of Qian and Kun, just as a person’s essence and qi circulate throughout the body without fixed location. The *Dragon-Tiger Classic*, however, mistakenly speaks of 'void and danger,' forcing an interpretation where none fits.\"\n\n**Appendix (Note by Peng):**\nPeng believed that Master Wei obtained the ancient text of the *Dragon-Tiger Classic* and composed the *Cantong Qi*. Zhu Xi considered the *Classic* a later forgery. Now, examining the *Cantong Qi*, it contains passages from an ancient text recording the Dragon and Tiger, which likely once existed. For instance, the *Fire Record*’s text may not be the same as the version transmitted today. Bao suggested that this may be comparable to the *Three Tombs* and the *Fox-Head Classic*—whether this is true remains uncertain.",
      "overlap_context": "xist, one of which states:\n*\"After a thousand cycles, resplendent and flourishing,\nTen thousand repetitions will reveal the numinous.\nIt may enlighten others, or the spirit may suddenly awaken on its own.\"*\nReciting it over time, the essential meaning and key instructions will naturally become clear.\n\n**Liu of Xuqi** remarked: \"Among ancient texts, only the *Cantong Qi* resembles pre-Qin prose.\"\n\n**Upper Chapter:**\n*Qian* and *Kun* are the gate and door of the *Yi*, the parents of all hexagrams.",
      "start_char": 1382,
      "end_char": 2668,
      "start_sentence": 22,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.261133909225464,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "附又按金碧古文龙虎上经差简于参同契然其语次布置与契不甚相远而加整焉末云火记不虚作亦契中语也然则火记又参同之所出欤 言不苟造论不虚生引验见效校度神明推结字原理为征坎戊月精离已日光日月为易刚柔相当土王四季罗络始终青赤白黑各居一方皆禀中宫戊己之功 此以造字之法明坎月离日之合而为易也盖坎戊离已皆居中宫土位而四方四行皆禀其气 易者象也悬象着明莫大乎日月穷神以知化阳往则阴来辐凑而轮转出入更卷舒 此总明日月为易之意下乃详言其法与一月之火候 晦至朔旦震来受符当斯之时天地媾其精日月相撢持雄阳播施雌阴化黄包混沌相交接权舆树根基经营养鄞鄂凝神以成躯众夫蹈以出蠕动莫不由于是仲尼赞洪蒙乾坤德洞虚稽古称元皇关睢建始初冠婚气相纽元年乃牙滋圣人不虚生上观显天符天符有进退诎信以应时 此书之法以一月为六节分属六卦震一兑二干三防四艮五坤六每五日为一节故言朔旦则震始用事而为日月阴阳交感之初于是加修炼之功如圣人之作六经皆有所托始也此实一篇之要言而雄阳播施雌阴化黄包又一节之要处他皆以明此耳 故易统天心复卦建始萌长子继父体因母立兆基消息应钟律升降据斗枢 此又以一月为十二节以复临泰壮夬干姤遁否观剥坤为序每二日半为一节复即前六节震卦之内体也长子震也父干也母坤也下章云朔旦为复 三日出为爽震受庚西方八日兑受丁上平如绳十五干体就盛满甲东方 三日第一节之中月生明之时也盖始受一阳之光而昏见于西方庚地也八日第二节之中月上之时盖受二阳之光而昏见于南方丁地也十五日第三节之中月既望之时全受日光盛满而昏见于东方之甲地也 蟾蜍与兔魄日月无双明蟾蜍视卦节兔者吐生光此言望夕之月全受日光而借蟾为瞻借兔为吐也 七八道已讫屈折低下降十六转受统防辛见平明艮直于丙南下二十三坤乙三十日东北丧其明节尽相禅与继体复生龙壬癸配甲乙乾坤括始终 七八谓十五日也十六日谓第四节之始也始生下一阴为防而成魄以平旦而没于西方辛地也二十三日第五节之中复生中一阴为艮而下以平旦而没于南方丙地也三十日第六节之终全变三阳而光尽体伏于东北借易朋字作明字也一月六节既尽而禅于后月长子继父复生震卦壬配甲癸配乙皆属乾坤括十日之始终自晦至朔旦至此一月之火候也 附朱子曰一息之间便有晦朔望上者气之方息自上而下也下者气之方消自下而上也望者气之盈也日沉于下而月圆于上也晦朔之间日月之合乎上所谓举水以灭火金来归性初之是也 七八数十五九六亦相应四者合三十阳气索灭藏索尽也 八卦列布曜运移不失中精眇难觌推度效符证居则观其象准拟其形容立表以为范占候定吉凶发号顺时令勿失爻动时上察河图文下序地形流中稽于人情参同考三才动则循卦节静则因彖辞乾坤用施行天下然后治 此用乾坤用九天下治也之语上言乾坤用即用九用六也治或作理盖避唐讳此下至国无害道皆以国政为喻 可不慎乎御政之首管括密微闿舒布宝要道魁柄统化纲纽爻象内动吉凶外起五纬错顺应时感动四七乖戾侈离俯仰文昌总录诘责台辅百官有司各典所部日合五行精月受六律纪五六三十度度竟复更始原始要终存亡之绪或君骄佚亢满违道或臣邪佞行不顺轨望盈缩乖变凶咎执法刺讥结过移主辰极受正优游任下明堂布政国无害道",
      "translated_text": "**Appendix (Further Note):**\n\nThe *Ancient Text of the Dragon-Tiger Upper Classic of the Golden and Azure* is somewhat simpler than the *Cantong Qi*, yet its phrasing and arrangement do not differ greatly from the *Qi*, and indeed appear more refined. Its closing line—*\"The Fire Record is not falsely composed\"*—also echoes the *Qi*. Thus, might the *Fire Record* itself be the source of the *Cantong Qi*?\n\nIts words are not carelessly crafted, its theories not idly born; it cites evidence, demonstrates effects, measures by celestial patterns, and infers from divine illumination. It takes the formation of characters as proof: Kan (坎) as the moon’s essence (戊), Li (離) as the sun’s light (己); the union of sun and moon becomes the *Yi*. Hard and soft correspond, earth reigns over the four seasons, and the web of beginning and end—green, red, white, and black—each occupies its quadrant, all receiving the power of the central palace’s 戊 and 己.\n\nThis explains the method of character formation to clarify the union of Kan’s moon and Li’s sun into the *Yi*. For Kan’s 戊 and Li’s 己 both reside in the central palace of earth, and the four directions and four phases all derive their qi from it.\n\nThe *Yi* is imagery; no image is more luminous than the sun and moon. To fathom the divine and know transformation: when yang departs, yin arrives; like spokes converging at the hub, the wheel turns, alternating between emergence and withdrawal.\n\nThis broadly conveys the meaning of the *Yi* as the sun and moon. Below, it elaborates on the method and the fire-phase of a single month.\n\nFrom the dark of the moon to the dawn of the new moon, Zhen (震) arrives to receive the tally. At this moment, heaven and earth unite their essence, sun and moon clasp and hold; the male yang scatters its mystery, the female yin transforms into a yellow embrace. Chaos intermingles, the root of power is planted, the foundation laid. Nurturing the bud, the calyx forms; spirit congeals into form. All things tread forth, wriggling into motion—none does not arise from this. Confucius praised the primal chaos, the virtue of Qian and Kun filling the void. Tracing antiquity, the *Yuanhuang* is invoked; the *Guanju* establishes the beginning. At the first marriage, qi intertwines; the first year sprouts forth. The sage does not act in vain—gazing above, he observes the manifest celestial tally. The tally advances and retreats, bends and extends, responding to the seasons.\n\nThe method of this text divides a month into six segments, each assigned to one of the six hexagrams: Zhen (1), Dui (2), Qian (3), Xun (4), Gen (5), and Kun (6). Each segment spans five days. Thus, at the dawn of the new moon, Zhen begins its work, marking the initial union of sun and moon’s yin and yang. Here, the practice of refinement is applied, just as the sage’s composition of the Six Classics all had a point of origin. This is the essential passage of the entire work, and *\"the male yang scatters its mystery, the female yin transforms into a yellow embrace\"* is the crucial point of this segment; all else serves to clarify this.\n\nThus, the *Yi* governs the heart of heaven. The hexagram Fu (復) establishes the beginning, the eldest son succeeds the father’s body, relying on the mother to lay the foundation. Waning and waxing respond to the bell and pitch pipe; ascent and descent follow the pivot of the Dipper.\n\nThis further divides the month into twelve segments, ordered as Fu (復), Lin (臨), Tai (泰), Da Zhuang (大壯), Guai (夬), Qian (乾), Gou (姤), Dun (遁), Pi (否), Guan (觀), Bo (剝), and Kun (坤), with each segment spanning two and a half days. Fu corresponds to the first of the previous six segments, Zhen. The eldest son is Zhen, the father Qian, the mother Kun. A later passage states: *\"At the dawn of the new moon, it is Fu.\"*\n\nOn the third day, brightness emerges; Zhen receives 庚 in the west. On the eighth day, Dui receives 丁 in the upper reaches, its surface level as a stretched cord. On the fifteenth day, Qian’s body is full and abundant, 甲 in the east.\n\nThe third day marks the midpoint of the first segment, when the moon begins to brighten. It first receives a single yang’s light, faintly visible at dusk in the west, at 庚. The eighth day marks the midpoint of the second segment, when the moon’s surface levels. It receives two yang’s light, visible at dusk in the south, at 丁. The fifteenth day marks the midpoint of the third segment, the full moon. It fully receives the sun’s light, abundant and bright, visible at dusk in the east, at 甲.\n\nThe toad and the hare’s spirit—sun and moon, unmatched in brilliance. The toad gazes upon the hexagram’s segments; the hare spits forth light. This describes the full moon’s evening, when the moon fully receives the sun’s light, borrowing the toad for sight and the hare for emission.\n\nAt seven and eight, the Dao is complete; bending and lowering, it descends. On the sixteenth, it receives governance from Xun (巽) at 辛, appearing at dawn’s clarity. Gen (艮) stands upright at 丙 in the south; on the twenty-third, Kun (坤) at 乙. On the thirtieth day, in the northeast, its light is lost. The segments exhaust and succeed one another; the body revives. Dragon’s 壬 and 癸 pair with 甲 and 乙; Qian and Kun encompass beginning and end.\n\nSeven and eight refer to the fifteenth day. The sixteenth day marks the beginning of the fourth segment, when the first yin arises as Xun, forming the moon’s spirit, setting at dawn in the west at 辛. The twenty-third day marks the midpoint of the fifth segment, when the middle yin arises as Gen, descending to set at dawn in the south at 丙. The thirtieth day marks the end of the sixth segment, when all three yang transform and the light is spent, its body hidden in the northeast—borrowing the character *peng* (朋) for *ming* (明). The six segments of the month are complete, passing to the next month. The eldest son succeeds the father, Zhen revives; 壬 pairs with 甲, 癸 with 乙, all belonging to Qian and Kun, encompassing the ten days’ beginning and end—from the dark of the moon to the dawn of the new moon, this is the fire-phase of a single month.\n\n**Appendix (Zhu Xi’s Note):**\nIn a single breath, there are the phases of dark, new moon, first quarter, full moon, and last quarter. The phase of ascent is when qi, having reached its peak, begins to descend; the phase of descent is when qi, having reached its nadir, begins to rise. The full moon is when qi is full—the sun sinks below, and the moon is round above. Between the dark and new moon, the sun and moon conjoin above. This is what is meant by *\"raising water to extinguish fire\"* and *\"metal returning to its nature at the beginning.\"*\n\nSeven and eight make fifteen; nine and six also correspond. Four of these make thirty—when yang qi is exhausted and hidden, its store is spent.\n\nThe eight trigrams are arrayed, the luminaries shift, never losing the central mystery. Subtle and elusive, difficult to behold, one infers, measures, and verifies by effect. Residing in observation, one examines its images, models its forms, sets up markers as standards. Divining and fixing fortune, issuing commands in accord with the seasons, one does not miss the moment when lines move. Above, one examines the patterns of the *River Chart*; below, one orders the earth’s topography. In the center, one investigates human nature, harmonizing and examining the Three Powers. In motion, one follows the hexagram’s segments; at rest, one relies on the hexagram’s judgment. When Qian and Kun are employed, the world is governed.\n\nThis refers to the line *\"When Qian is employed, the world is governed\"*—above, *\"Qian and Kun are employed\"* means *\"employing nine\"* and *\"employing six.\"* *\"Governed\"* may be written as *\"ordered\"* to avoid Tang taboo. From here to *\"the state suffers no harm to the Dao\"* is all metaphor for state governance.\n\nHow can one not be cautious? At the helm of governance, one must grasp the subtle and profound, open and close, distribute the precious essentials of the Dao. The handle of the Dipper commands transformation; the net’s knot is the lines’ movement within. Fortune and misfortune arise externally. The five planets move erratically, responding to the seasons. When the four and seven are discordant, excess and separation arise; bowing and raising, Wen and Chang record it all. The censors and ministers, the hundred officials and their bureaus, each oversee their domains. Daily, they harmonize the five phases’ essence; monthly, they receive the six pitch pipes’ measure. Five and six make thirty degrees; when the degrees are complete, the cycle begins anew. Tracing beginning to end, one preserves the thread of survival and extinction.\n\nIf the ruler is arrogant and indulgent, overbearing and contrary to the Dao; if ministers are treacherous and flattering, acting outside proper bounds—then the waxing and waning of the tally will deviate, bringing misfortune. Enforcing the law, admonishing and criticizing, binding faults, shifting the ruler’s fate—only when the pole star receives its proper alignment can one leisurely entrust matters to subordinates. The Bright Hall distributes governance, and the state suffers no harm to the Dao.",
      "overlap_context": "ter Wei obtained the ancient text of the *Dragon-Tiger Classic* and composed the *Cantong Qi*. Zhu Xi considered the *Classic* a later forgery. Now, examining the *Cantong Qi*, it contains passages from an ancient text recording the Dragon and Tiger, which likely once existed. For instance, the *Fire Record*’s text may not be the same as the version transmitted today. Bao suggested that this may be comparable to the *Three Tombs* and the *Fox-Head Classic*—whether this is true remains uncertain.",
      "start_char": 2668,
      "end_char": 3976,
      "start_sentence": 42,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.08458685874939,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "此皆取譬之言然其间亦有可详味者 内以养已安静虚无元本明内照形躯闭塞其兑筑固灵株三光陆沉温养子珠视之不见近而易求黄中渐通理润泽达肌肤初正则终修干立末可持一者以掩蔽世人莫知之 此乃以内事言之于经中最为要切而三光陆沉温养子珠之一言又要切之要切者前所譬御政之首魁柄纲纽正谓此也初正干立原始而言也终修末持要终而言也一者以掩蔽言其造端之处而不章者也 上德无为不以察求下德为之其用不休上闭则称有下闭则称无无者以奉上上有神德居此两孔穴法金气亦相胥 此下渐难通晓今略以意解之上德即上文所谓雌阴化黄包三光陆沉下文所谓汞白为流珠青龙与之俱所谓流珠水之母者正思虑所不及也下德即上文所谓雄阳播施温养子珠下文所谓白虎为熬枢黄土金之父者正着意用力处也闭则皆失其所宜矣下不可无故无者以奉上神德谓微妙处龙虎经作上有青龙居金气即谓雄阳白虎也大率阳既下即阴自上矣所谓孔穴者此也鼎器歌云阴在上阳下奔此亦至要之言 知白守黑神明自来白者金精黑者水基水者道枢其散各一 白谓汞黑为铅金精言其生于铅水基能生水也白黑各一而水为道枢所谓神德者也 阴阳之始含黄牙五金之主北方河车 含黄牙水中有土静而有意也北方河车黑而生水也以下文考之正谓铅耳 故铅外黑内懐金华被褐懐玉外为狂夫 铅即上文所谓金气 金为水母母子胎水者金子子藏母胞 此即上文知白守黑之义 真人至妙若有若无仿佛大渊乍沈乍浮退而分布各守境隅 此所谓温养子珠者也 望之白造之则朱链为表卫白里贞居方圆径寸混而相拘先天地生巍巍尊高旁有垣阙状似蓬壶环匝关闭四通踟蹰守御密固阏绝奸邪曲阁相通以戒不虞 径寸即所谓子珠者垣阙疑即下文所谓情主营外恒为城阙者耶皆未详其何说 可以无思难以愁劳神气满堂莫之能留守之者昌失之者亡动静休息常与人俱是非历藏法内视有所思履行步斗宿六甲以日辰阴道厌九一浊乱防胞食炁鸣肠胃吐正吸新邪昼夜不卧寐晦朔未尝休身体以疲倦恍惚状若痴百脉鼎沸驰不得清澄居周回立坛宇朝暮敬祭祠鬼物见形象梦寐感慨之心欢意喜悦自谓必延期遽以夭命死腐露其形骸举措輙有违悖逆失枢机诸术甚众多千条有万余前却违黄老曲折戾九都 言此道与诸旁门小法之不同不能详解 明者省厥防旷然知所由勤而行之夙夜不休服食三载轻举远游入火不焦入水不濡能存能亡长乐无忧道成德就潜伏俟时太乙乃召移居中洲功满上升膺箓受图火记不虚作演易以明之偃月法鼎炉白虎为熬枢汞日为流珠青龙与之俱举东以合西魂魄自相拘上兑数八下亦如之 偃月疑前下圆后上缺状如偃月也白虎铅也火也气也西也魄也阳也为熬枢言下奔而致蒸润上行也汞日精也青龙水也东也魂也阴也上阳也下阴也 【附朱子曰坎离水火龙虎铭汞之属只是互换其名其实只是精气二者而已精水也坎也龙也汞也气火也离也虎也铅也其法以神运精气结而为丹阳气在下初成水以火炼之则凝成丹其说甚异】 两合其精乾坤体乃成二八应一斤易道正不倾八日为兑上又进八日乃成干体二十二日为艮下又退八日乃成坤体一本注云铢有三百八十四亦应爻之数盖一斤之铢数也自震而起至干而满历防而消至坤而尽",
      "translated_text": "These are all metaphorical expressions, yet within them lie points worthy of careful reflection. Internally, one cultivates the self through tranquility, emptiness, and non-being, returning to the primordial root. The inner light illumines the body; the orifices are sealed and fortified, the spirit-root stabilized. The Three Luminaries sink into obscurity, and the warming nurture of the \"child-pearl\" begins. Though unseen to the eye, it is near and easily sought. The Yellow Center gradually opens, its principle moistening and permeating to reach the skin. At first, one rectifies the foundation; in the end, one refines the branches. Yet if one clings to a single method, it obscures the world, and none will comprehend.\n\nThis is spoken of internal matters, and in the classics, it is most essential. The phrase \"the Three Luminaries sink into obscurity, warming and nurturing the child-pearl\" is the most essential of the essential. The earlier metaphors of \"governing at the outset,\" \"the handle of the Great Dipper,\" and \"the guiding net\" all refer precisely to this. \"First rectifying the foundation\" speaks of the beginning; \"refining the branches in the end\" speaks of the conclusion. \"Clinging to a single method\" refers to the obscurity at the inception, where the Way remains unmanifest.\n\nThe highest virtue acts without striving, not seeking through scrutiny; the lower virtue acts, and its function never ceases. When the upper is sealed, it is called \"having\"; when the lower is sealed, it is called \"non-being.\" \"Non-being\" serves \"having\"; above, the numinous virtue resides within these two apertures. The method follows the metal qi, and they mutually depend.\n\nWhat follows grows increasingly difficult to comprehend; here, I briefly interpret it according to my understanding. The \"highest virtue\" is what the earlier text calls the \"feminine yin transforming the Yellow,\" enveloping the Three Luminaries’ sinking into obscurity, and what the later text calls \"mercury as the flowing pearl,\" the \"Azure Dragon accompanying it\"—the \"flowing pearl, mother of water,\" precisely what thought cannot reach. The \"lower virtue\" is what the earlier text calls the \"masculine yang disseminating the Mysterious,\" warming and nurturing the \"child-pearl,\" and what the later text calls the \"White Tiger as the pivot of refinement,\" the \"Yellow Earth, father of metal\"—precisely where intention and effort are applied. When sealed, both lose their proper place.\n\nThe lower cannot be without \"non-being,\" which serves the upper. The \"numinous virtue\" refers to the subtle and wondrous. The *Dragon and Tiger Classic* states: \"Above, the Azure Dragon resides in the metal qi,\" meaning the masculine yang and the White Tiger. Generally, when yang descends, yin naturally ascends—this is what the \"apertures\" refer to. The *Song of the Cauldron* says: \"Yin above, yang below rushing\"—this, too, is a most essential statement.\n\n\"Knowing the white, guarding the black,\" the spirit and brightness come of themselves. The white is the essence of metal; the black is the foundation of water. Water is the pivot of the Dao; when dispersed, each is singular. The white refers to mercury; the black, to lead. \"Essence of metal\" speaks of its birth from lead; \"foundation of water\" speaks of its ability to generate water. White and black are each singular, yet water is the pivot of the Dao—this is what the \"numinous virtue\" refers to.\n\nThe beginning of yin and yang contains the Mysterious and the Yellow, the master of the Five Metals—the Northern River Chariot. The Mysterious and the Yellow contain earth within water, still yet intentional. The Northern River Chariot is black and generates water. According to the later text, this refers precisely to lead.\n\nThus, lead is black externally but harbors golden splendor within—\"clothed in coarse cloth, yet holding jade.\" Lead is what the earlier text calls the \"metal qi.\" Metal is the mother of water; the mother conceals the child in her womb. Water is the child of metal; the child hides in the mother’s embryo. This is the meaning of \"knowing the white, guarding the black.\"\n\nThe Perfected One’s subtlety is as if present, as if absent, faintly resembling the great abyss—now sinking, now floating. Retreating, they disperse and each guards their domain. This is what is called \"warming and nurturing the child-pearl.\"\n\nGazing from afar, it appears snow-white; approaching, it is cinnabar-red. Chains form its outer defense; white within, the true essence resides. Square and round, a cun in diameter, they blend and restrain each other. Born before heaven and earth, majestic and lofty, it is encircled by walls and watchtowers, resembling Penglai. Enclosed and sealed, the four directions connect. Hesitating, guarding, tightly secured, it blocks all wickedness. Curved corridors communicate, ever vigilant against the unexpected.\n\nThe \"cun in diameter\" is what is called the \"child-pearl.\" The \"walls and watchtowers\" may refer to what the later text calls \"the emotions governing the external, constantly forming city walls and watchtowers\"—though the exact meaning remains unclear.\n\nOne may be without thought, yet cannot be without care and toil. When the qi fills the hall, none can retain it. Those who guard it prosper; those who lose it perish. In movement and stillness, rest and activity, it is ever with the person. Whether in right or wrong, one practices the method of internal vision: contemplating, treading the steps of the Dipper and the lunar lodges, the Six Jia, the hours and days, the yin path suppressing the Nine Ones. Guarding against turbid chaos, preventing the Mysterious Embryo from harm, one ingests qi, causing the intestines to rumble. Exhaling the stale, inhaling the fresh, day and night without sleep, from dusk to dawn without rest, the body grows weary and dazed, as if mad. The hundred vessels boil like a cauldron, racing without clarity. Dwelling in a circular enclosure, one erects an altar, worshipping and sacrificing to spirits morning and evening. Seeing forms and images in dreams, the heart stirs with emotion, joy, and delight—one believes longevity is assured, yet suddenly meets an early death, the body decaying and exposed. Every action violates the proper order, losing the pivot of the mechanism. Such arts are myriad, numbering thousands or tens of thousands. Advancing and retreating, they deviate from the Yellow and the Old, twisting and turning, rebelling against the Nine Capitals.\n\nThis speaks of how this Way differs from all other minor methods and cannot be explained in detail. The wise will reflect on this, suddenly understanding the path. Diligently practicing day and night without rest, after three years of ingesting and refining, one becomes light and travels afar—entering fire without burning, entering water without drowning. One can preserve or abandon life, ever joyful and without sorrow. The Dao is accomplished, virtue perfected; one conceals oneself, awaiting the time. The Great One summons, and one moves to the Central Land. When merit is complete, one ascends, receiving the register and the Fire Record. The teachings are not false, as the *Yi*’s evolution makes clear.\n\nThe crescent-moon method: the cauldron and furnace. The White Tiger is the pivot of refinement; the Sun-Mercury is the flowing pearl. The Azure Dragon accompanies it. Raising the East to join the West, the hun and po naturally restrain each other. The upper trigram is *dui*, number eight; the lower trigram is the same.\n\nThe \"crescent moon\" likely refers to the shape: round below, deficient above, resembling an inverted crescent. The White Tiger is lead, fire, qi, the West, the po, and yang—acting as the pivot of refinement, speaking of the downward rush that brings steaming moisture upward. Mercury is the essence of the sun; the Azure Dragon is water, the East, the hun, and yin. The upper trigram is yang; the lower trigram is yin.\n\n[Master Zhu appended: The terms *kan*, *li*, water, fire, dragon, tiger, cinnabar, mercury, and the like are merely interchangeable names—ultimately, they refer only to essence and qi. Essence is water, *kan*, the dragon, and mercury; qi is fire, *li*, the tiger, and lead. The method uses spirit to move essence and qi, binding them to form the elixir. Yang qi, initially below, first becomes water; refined by fire, it congeals into the elixir. This explanation is most unusual.]\n\nWhen the two trigrams unite their essence, the body of *qian* and *kun* is complete. Two eights correspond to one jin; the Way of the *Yi* is perfectly balanced. Eight days form *dui*, the upper trigram; advancing another eight days completes the body of *qian*. Twenty-two days form *gen*, the lower trigram; retreating another eight days completes the body of *kun*. One version notes: \"A *zhu* has three hundred eighty-four, corresponding to the number of the hexagrams—this is the number of *zhu* in one *jin*.\" Beginning at *zhen*, rising to *qian* to reach fullness, passing through *xun* to wane, and ending at *kun* to exhaustion.",
      "overlap_context": " the ruler is arrogant and indulgent, overbearing and contrary to the Dao; if ministers are treacherous and flattering, acting outside proper bounds—then the waxing and waning of the tally will deviate, bringing misfortune. Enforcing the law, admonishing and criticizing, binding faults, shifting the ruler’s fate—only when the pole star receives its proper alignment can one leisurely entrust matters to subordinates. The Bright Hall distributes governance, and the state suffers no harm to the Dao.",
      "start_char": 3976,
      "end_char": 5249,
      "start_sentence": 61,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.4204797744751,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "金入于猛火色不夺精光自开辟以来日月不亏明金不失其重日月形如常金本从月生朔旦受日符金反归其母月晦日相包藏其匡郭沉沦于洞虚金复其故性威光鼎乃熺 金即铅也金归其母复其故性谓敛藏不用日不照月纯坤卦也熺字本作喜一本作僖今按皆无理案说文熺炎也后汉多用此字 子午数合三戊已号称五三五既和谐八石正纲纪嘑吸相贪欲伫思为夫妇黄土金之父流珠水之母水以土为鬼土填水不起朱雀为火精执平调胜负水胜火消灭俱死归厚土三性既合防本性共宗祖 子水一午火二数合三也戊己土其数五三五合而为八八石象也然其实但水火二物而以土为主耳土属脾脾主意谓以意使火下而水上相呼吸也金即火也朱雀疑指心而言又意之主也此火字与前章熬字意不同别是一火也执平谓执衡司夏也此书之意大抵为以火烹水以水灭火亦如前章月受日光反归其母之意也 巨胜尚延年还丹可入口金性不败朽故为万物宝术士服食之寿命得长久土游于四季守界定规矩金砂入五内雾散若风雨重烝达四肢颜色悦泽好发白更生黑齿落出旧所老翁复丁壮耆妪成姹女改形免世厄号之曰真人 此言内丹而言入口未详其防余见后章驰入赤色门下 胡粉投火中色坏还为氷雪得温汤解释成太金以砂为主禀和于水银变化由其真终始自相因此皆以同相变为譬也 欲作服食仙宜以同者植禾当以粟覆鸡用其子以辅自然物成易陶冶鱼目岂为珠蓬蒿不成槚同者相从事乖不成宝是以燕雀不生凤狐兔不乳马水流不炎上火动不润下 又以异不能相成反覆明之 世间多学士高妙负良才邂逅不遭植耗火亡货财据按依文说妄以意为之端绪无因缘度量失操持捣治羌石胆云母及礜磁硫黄烧豫章泥汞相炼治鼔下五石铜以之为辅枢杂性不同种安肯合体居千举必万败欲反成痴穉年至白首中道生狐疑背道守迷路出正入邪蹊管窥不广见难以揆方来 此言为外丹者药非同不能成宝 若夫至圣不过伏羲画八卦效天图文王帝之宗结体演爻辞夫子庶圣雄十翼以辅之三君天所挺迭兴更御时优劣有步骤功德不相殊制作有所踵推度审分铢有形易忖量无兆难虑谋作事令可法为世定诗书素无前识资因师觉悟之皓若褰帷帐瞠目登高台言三圣迭兴事有优劣盖伏羲法天文王踵羲夫子踵文有形者易制无形者难及也因自言因师以悟此理也诗书两句未详 火记六百篇所趣等不殊文字郑重说世人不熟思寻度其源流幽明本共居窃待贤者谈曷敢轻为书结舌欲不语绝道获罪诛写情寄竹帛恐泄天之符犹豫増叹息俯仰缀斯愚陶冶有法度未忍悉陈敷略述其纪纲枝条见扶疎 火记六百篇盖古书今亡未可知 以金为堤防水火仍优游金数十有五水数亦如之临炉定铢两五分水有余二者以为真金重如本初其三遂不入水二与之俱三物相含受变化状若神下有太阳炁伏烝须防间先液而后凝号曰黄舆焉 此言丹之第一变也金水并见上入一作火据下文三物即当作火然又云下有太阳炁则似只是二物恐当作八而三亦当作二耳此是金水数皆十五而五分其水只用其二盖十五之六也其三则十五之九也水二一作火二与上水火下三物相应但上无火之铢两下又有太阳字则又未必然也二物相含受即阴阳坎离之交三物之误甚明 岁月将欲讫毁性伤寿年形体为灰土状若明窗尘此是第二变也",
      "translated_text": "When gold enters fierce fire, its color remains unaltered; since the dawn of creation, the sun and moon have never waned in brightness, just as gold never loses its weight. The sun and moon retain their constant form, for gold is born of the moon. At the new moon, it receives the sun’s emblem; when gold returns to its mother, at the dark of the moon, they enfold each other, concealing their frame. Sunken into the cavernous void, gold regains its original nature, its majestic radiance blazing within the crucible.\n\nGold is lead. When it returns to its mother and regains its original nature, it is gathered and stored, no longer in use. The sun does not shine, and the moon is pure *kun* trigram. The character *熺* originally meant \"blazing\"; in the *Hou Han* texts, it is often used. The numbers of *zi* and *wu* combine to form three; *wu* and *ji* are called the five threes. When the five threes harmonize, the eight minerals serve as the proper framework. Inhalation and exhalation desire each other, awaiting union as husband and wife. Yellow earth is the father of metal, flowing pearl the mother of water. Water treats earth as its ghost; earth fills water, preventing it from rising. The Vermilion Bird is the essence of fire, maintaining balance to determine victory or defeat. When water prevails, fire is extinguished; when both perish, they return to the thick earth. Once the three natures unite, they guard their original essence and share a common ancestor.\n\n*Zi* (water) is one, *wu* (fire) is two; their numbers combine to form three. *Wu* and *ji* (earth) are five; three fives combine to make eight, symbolizing the eight minerals. Yet in truth, there are only two things—water and fire—with earth as the master. Earth pertains to the spleen, which governs intention, meaning one uses intention to direct fire downward and water upward, so they breathe in harmony. Gold is fire; the Vermilion Bird likely refers to the heart, which governs intention. This \"fire\" differs from the \"roasting\" (*熬*) mentioned earlier—it is another kind of fire. \"Maintaining balance\" means holding the scales, governing summer. The intent of this text is largely to use fire to boil water and water to extinguish fire, echoing the earlier idea of the moon receiving the sun’s light and returning to its mother.\n\nSesame prolongs life; the returning elixir can be ingested. Gold’s nature does not decay, making it the treasure of all things. When alchemists consume it, their lifespans lengthen. Earth travels through the four seasons, guarding its boundaries and establishing rules. When golden sand enters the five viscera, mist scatters like wind and rain. Steaming heavily, it reaches the four limbs; the complexion becomes radiant, white hair regrows black, fallen teeth re-emerge, and the old man regains his youth, the aged woman transforms into a maiden. Changing form to escape worldly calamity, one is called a True Person.\n\nThis refers to the inner elixir; the method of ingestion remains unclear, as discussed in later chapters. It enters the Crimson Gate below.\n\nWhen lead powder is cast into fire, its color is ruined and reverts to lead. Ice and snow melt in warm water, dissolving into the Great Mystery. Gold takes cinnabar as its master, harmonizing with mercury; transformations arise from their true nature, beginning and ending with themselves. All use the analogy of like transforming like.\n\nTo refine an elixir for immortality, one must use like substances: plant grain with grain, cover chickens with their own eggs, and rely on the natural to assist the natural. Things will easily take form. Fish eyes are not pearls; fleabane does not become sandalwood. Like follows like; disparate things cannot form treasures. Thus, swallows do not give birth to phoenixes, foxes and rabbits do not nurse horses, water does not flow upward to blaze, nor does fire move downward to moisten.\n\nAgain, it is shown that unlike things cannot succeed; this is repeatedly clarified.\n\nMany scholars in the world possess lofty talent, yet by chance, they do not encounter proper methods. They waste their efforts, squander their wealth, and rely on textual interpretations, arbitrarily imposing their own ideas. Without foundation, their measurements and handling go awry. They pound and refine orpiment, mica, arsenolite, magnetite, sulfur, and mercury, burning camphorwood and mud to smelt them. They add the five minerals, copper, and other substances as aids, but their natures differ, and they refuse to unite. A thousand attempts lead to ten thousand failures; seeking immortality, they instead become foolish. Even in old age, with white hair, they remain doubtful midway, abandoning the Dao to cling to delusion, straying from the correct path into depravity. Peering through a tube, their narrow vision makes it difficult to gauge the future.\n\nThis refers to those who pursue the outer elixir; if the medicines are not of like kind, they cannot form treasures.\n\nAs for the utmost sages: Fu Xi drew the eight trigrams, modeling the celestial patterns; King Wen of Zhou, the emperor’s ancestor, structured the hexagrams and composed the line statements; and Confucius, the most eminent of sages, added the Ten Wings to assist them. These three rulers, raised by Heaven, succeeded one another in governing their times. Though their steps varied in excellence, their virtues did not differ. Their creations built upon one another; they measured and weighed, carefully distinguishing the smallest details. What had form was easy to manage; what lacked form was difficult to grasp. They acted so their deeds could serve as models, establishing the *Book of Poetry* and *Book of Documents* for the world. These works contained no prior knowledge but relied on teachers to awaken understanding—like lifting the curtains to gaze from a high tower.\n\nThe three sages succeeded one another, and their achievements had varying degrees of excellence. Fu Xi modeled Heaven, King Wen followed Fu Xi, and Confucius followed King Wen. What had form was easy to regulate; what lacked form was hard to attain. This passage explains that one awakens to this principle through a teacher. The meaning of the lines on the *Book of Poetry* and *Book of Documents* remains unclear.\n\nThe *Fire Records* comprise six hundred chapters, all pursuing the same goal. The text is earnest, yet people do not ponder deeply to trace its origins. The hidden and the manifest originally dwell together. I await the worthy to discuss this; how dare I lightly commit it to writing? Holding my tongue, I wish to remain silent, but cutting off the Dao would incur punishment. Pouring out my feelings onto bamboo and silk, I fear revealing Heaven’s signs. Hesitating, I sigh, looking up and down, and compile these foolish words. There are methods for refining, but I dare not fully expound them. I merely outline the framework and reveal the branches.\n\nThe *Fire Records* of six hundred chapters may be an ancient text now lost.\n\nUsing gold as a dike, water and fire remain at ease. Gold’s number is fifteen, and water’s number is the same. When the furnace is prepared, the weights and measures are fixed: five parts water, with two parts remaining as the true essence. Gold’s weight returns to its original state; the three parts do not enter the water but accompany the two. The three substances contain and receive each other, transforming as if by magic. Below, the *qi* of the Great Yang steams and rises. After a moment, it first liquefies, then congeals, called the Yellow Chariot.\n\nThis describes the first transformation of the elixir. Gold and water appear together; some versions say \"fire\" instead of \"water.\" According to the following text, the three substances should be \"fire.\" Yet it also mentions \"below, the *qi* of the Great Yang,\" suggesting only two substances. Perhaps it should read \"eight\" instead of \"three,\" and \"two\" instead of \"three.\" This refers to gold and water, both numbered fifteen, with water divided into five parts, only two of which are used—six parts of fifteen. The three parts are nine parts of fifteen. Water (or fire) is two, corresponding to the two above; the three substances below align with them. However, the absence of fire’s weight above and the mention of \"Great Yang\" below cast doubt. The mutual containment of the two substances refers to the union of *yin* and *yang*, *kan* and *li*. The error of \"three substances\" is evident.\n\nWhen years and months near their end, nature is harmed, and lifespan is cut short. The body becomes ashes and dust, like dust on a bright window—this is the second transformation.",
      "overlap_context": " is perfectly balanced. Eight days form *dui*, the upper trigram; advancing another eight days completes the body of *qian*. Twenty-two days form *gen*, the lower trigram; retreating another eight days completes the body of *kun*. One version notes: \"A *zhu* has three hundred eighty-four, corresponding to the number of the hexagrams—this is the number of *zhu* in one *jin*.\" Beginning at *zhen*, rising to *qian* to reach fullness, passing through *xun* to wane, and ending at *kun* to exhaustion.",
      "start_char": 5249,
      "end_char": 6506,
      "start_sentence": 84,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.24277424812317,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "捣治并合之驰入赤色门固塞其际防务令致完坚炎火张于下昼夜声正勤始文使可修终竟武乃陈候视加谨慎审察调寒温周旋十二节节尽更须亲炁索命将绝休死亡魄魂色转更为紫赫然成还丹粉提以一丸刀圭最为神 此第三变也捣治并合此当别有所作用赤色门谓口也液凝灰土理须自见盖吐出而链治之复吞纳也炎火即所谓太阳炁声正勤后章亦言嗷嗷声正悲如婴儿慕母是也修疑作循字唐人两事多互见气索命绝又是前章火灭金复之意粉提刀圭未详 推演五行数较约而不烦举水以激火奄然灭光荣日月相激薄常存晦朔间水盛坎侵阳火衰离昼昏阴阳相饮食交感道自然名者以定情字者缘性言金来归性初乃得称还丹 此解上文还丹得名之义因火灭而金复也 吾不敢虚说放效圣人文古记题龙虎黄帝美金华淮南链秋石王阳加黄牙贤者能持行不肖母与俱古今道由一对谈吐所谋学者加勉力留念深思惟至要言甚露昭昭不我欺 中篇 干刚坤柔配合相包阳禀阴受雄雌相须须以造化精气乃舒坎离冠首光耀垂敷难测不可画图圣人揆度参序基四者混沌径入虚无六十卦周张布为舆龙马就驾明君御时和则随从路平不邪邪道险阻倾危国家 此与上篇首章相表里 君子居其室出其言善则千里之外应之谓万乘之主处九重之室发号出令顺阴阳节藏器俟时勿违卦日屯以子申用寅戌余六十卦各自有日聊陈两象未能究悉立义设刑当仁施德逆之者凶顺之者吉按历法令至诚专密谨候日辰审察消息纤芥不正悔吝为贼二至改度乖错委曲隆冬大暑盛夏霰雪二分纵横不应漏刻风雨不节水旱相伐蝗虫涌沸山崩地裂天见其怪群异旁出孝子用心感动皇极近起已口远流殊域或以招祸或以致福或兴太平或造兵革四者之来由乎 胸臆动静有常奉其绳墨四时顺宜与气相得刚柔断矣 不相涉入五行守戒不妄盈缩易行周流屈伸反覆 此与上篇论屯朝暮内体外用相表里盖干纳甲壬坤纳乙癸震庚防辛坎戊离己艮丙兑丁也 重卦之法干下三爻纳甲子寅辰上三爻纳壬午申戌坤下三爻纳乙未巳卯上三爻纳癸丑亥酉震下三爻纳庚子寅辰上三爻纳庚午申戌防下三爻纳辛丑亥酉上三爻纳辛未己卯坎下三爻纳戊寅辰午上三爻纳戊申戌子离下三爻纳己夘丑亥上三爻纳己酉未巳艮下三爻纳丙辰午申上三爻纳丙戌子寅兑下三爻纳丁己夘丑上三爻纳丁亥酉未而内体从子至辰巳外用从午讫戌亥故朝屯则初九庚子之爻当子时六四戊申之爻当夘时暮则初六戊寅之爻当午时六四戊戌之爻当酉时余六十卦各以此法推之此再言一日之火候也 晦朔之间合符行中浑沌鸿蒙牝牡相从滋液润泽施化流通天地神灵不可度量利用安身形而藏始乎 东北箕斗之乡旋而右转呕轮吐萌潜潭见象发散精光毕昴之上震出为征阳炁造端初九潜龙阳以三立阴以八通故三日震动八日兑行九二见龙和平有明三五德就干体乃成九三夕惕亏折神符盛衰渐革终还其初防继其统固际操持九四或跃进退道危艮主进止不得逾时二十三日典守期九五飞龙天位加喜六五坤承结括终始蕴养众子世为母阳数已讫讫则复起推情合性转而相与上九亢龙战德于野用九翩翩为道规矩循据璇玑升降上下周流六爻难得察睹故无常位为易宗祖 此再以纳甲言一月之火候也又以干六爻纳于其间以明阳气之消息箕斗但言东北毕但言正西借天之四方以言地之四方耳非谓天之东北西方也六五恐是廿六字廿音入即二十字二十六日以后坤卦用事也用九以下与上篇乾坤二用处相表里",
      "translated_text": "The grinding, refining, and blending are swiftly introduced into the Crimson Gate, where its borders are firmly sealed to prevent any leakage. Vigilance must be maintained to ensure its integrity, while blazing fire is kindled below, burning day and night with unwavering diligence. Begin with the civil and conclude with the martial; then, observe and inspect with utmost care, adjusting warmth and coolness with meticulous attention. Circulate through the twelve joints, exhausting each in turn, for one must personally attend to the *qi* when life’s breath is on the verge of severance. When the *po* and *hun* fade and the color shifts, it transforms into a radiant purple—thus is the Returned Elixir formed. Taking a single pellet, the size of a knife’s tip, is most potent. This is the third transformation.\n\nThe grinding, refining, and blending here serve a distinct purpose. The Crimson Gate refers to the mouth. When saliva congeals into ash-like earth, the principle must be self-evident—spit it out, refine it, then swallow it again. The blazing fire is the so-called Great Yang *qi*. The phrase \"sound is diligent\" is echoed in later passages, describing a mournful wail like an infant longing for its mother. The character for \"cultivate\" may be a scribal error for \"follow.\" The *qi* seeking life’s end reprises the earlier theme of fire extinguished and metal restored. The terms \"powdered cinnabar\" and \"knife’s tip\" remain unclear.\n\nExpounding upon the Five Phases’ numerology is concise yet unburdensome. Water is used to stimulate fire, which suddenly extinguishes its brilliance. The sun and moon contend, their radiance enduring only in the interplay of darkness and new moon. When water waxes, *kan* encroaches upon *yang*; when fire wanes, *li* dims the day. *Yin* and *yang* consume one another, their mutual transformation following the Dao’s natural course. The name is fixed by essence, while the term arises from inherent nature. Only when metal returns to its original nature can it be called the Returned Elixir. This elucidates the meaning behind the name \"Returned Elixir,\" which arises from fire’s extinction and metal’s restoration.\n\nI dare not speak idly but emulate the sages’ ancient texts. The *Dragon-Tiger Classic* praises the Yellow Emperor’s Golden Flower; the *Huainanzi* refines autumn stone; Wang Yang adds yellow sprouts. The worthy may practice this, while the unworthy must not partake. From ancient times to the present, the Dao has been a singular discourse. Scholars, exert yourselves, ponder deeply, and grasp the essentials. The words are plain and luminous, never deceiving.\n\n**Middle Section**\n\n*Qian* is firm, *kun* is yielding; their union and containment arise from *yang* endowing and *yin* receiving. Male and female depend on one another, and through their interaction, essence and *qi* unfold. *Kan* and *li* crown the head, their radiance cascading—mysterious and profound, beyond depiction. The sage measures and arranges, grounding the four in the primordial chaos, entering the formless. The sixty-four hexagrams spread like a chariot’s canopy, harnessed to the dragon-horse. The enlightened ruler steers the times, and harmony follows, the path smooth and unerring. The deviant way is perilous, steep, and treacherous, endangering the state.\n\nThis mirrors the opening chapter of the preceding section.\n\nWhen the noble one dwells in his chamber and speaks with virtue, his words resonate a thousand *li* away—such is the lord of ten thousand chariots, issuing decrees from his nine-tiered palace. His commands align with *yin* and *yang*, storing instruments until the proper time, never transgressing the hexagrams. *Zhun* governs the hours of *zi* and *shen*, while *meng* governs *yin* and *xu*. The remaining sixty hexagrams each have their appointed days. Here, two images are presented, though their full intricacies remain unexplored. Establishing principles and enacting punishments, bestowing virtue upon the benevolent, and dooming the rebellious to misfortune—these follow the calendar’s decrees. Sincerity and precision are paramount; observe the celestial stems and branches, scrutinizing their waxing and waning. Even the slightest deviation invites regret and harm. At the solstices, the degrees shift; errors accumulate, and distortions arise. In the depths of winter, scorching heat; in the height of summer, hail and snow. At the equinoxes, imbalance reigns—timekeeping falters, wind and rain arrive unseasonably, drought and flood contend, locusts surge like boiling water, mountains crumble, and the earth splits. Heaven displays its omens, and strange portents emerge. The filial son’s devotion stirs the August Ultimate, its effects rippling near and far, even to distant lands. These may bring calamity or fortune, usher in peace or war—all stem from the heart’s movements.\n\nMaintain constancy in action and stillness, adhering to the plumb line. Harmonize with the four seasons and the *qi* to discern firmness and yielding. They do not intermingle; the Five Phases observe their boundaries, neither overfilling nor depleting. The *Yi*’s cycles flow—bending and extending, reversing and returning.\n\nThis mirrors the preceding section’s discussion of *zhun* and *meng*, their inner and outer applications intertwined. *Qian* governs *jia* and *ren*; *kun* governs *yi* and *gui*; *zhen* governs *geng* and *xin*; *kan* governs *wu*; *li* governs *ji*; *gen* governs *bing*; *dui* governs *ding*.\n\nThe method of doubling the hexagrams: *Qian*’s lower three lines govern *jiazi*, *jiayin*, and *jiachen*, while the upper three govern *renwu*, *renshen*, and *renxu*. *Kun*’s lower three lines govern *yimao*, *yichou*, and *yihai*, while the upper three govern *guisi*, *guichou*, and *guiyou*. *Zhen*’s lower three lines govern *gengzi*, *gengyin*, and *gengchen*, while the upper three govern *gengwu*, *gengshen*, and *gengxu*. *Xun*’s lower three lines govern *xinchou*, *xinhai*, and *xinyou*, while the upper three govern *xinwei*, *xinmao*, and *xinsi*. *Kan*’s lower three lines govern *wuchen*, *wuyin*, and *wuzi*, while the upper three govern *wuxu*, *wushen*, and *wuwu*. *Li*’s lower three lines govern *jichou*, *jihai*, and *jiyou*, while the upper three govern *jisi*, *jiwei*, and *jimao*. *Gen*’s lower three lines govern *bingchen*, *bingwu*, and *bingshen*, while the upper three govern *bingxu*, *bingzi*, and *bingyin*. *Dui*’s lower three lines govern *dingmao*, *dingchou*, and *dinghai*, while the upper three govern *dingyou*, *dingwei*, and *dingsi*. The inner body spans from *zi* to *chen* and *si*, while the outer application ranges from *wu* to *xu* and *hai*. Thus, at dawn during *zhun*, the *jiazi* line of the initial nine corresponds to the *zi* hour, and the *wushen* line of the six in the fourth place corresponds to the *mao* hour. At dusk during *meng*, the *wuyin* line of the initial six corresponds to the *wu* hour, and the *wuxu* line of the six in the fourth place corresponds to the *you* hour. The remaining sixty hexagrams follow this method. This reiterates the fire-times within a single day.\n\nBetween the dark and new moons, the signs align, and the primordial chaos flows. The female and male unite, their essences blending, moistening and nourishing, their transformations circulating. Heaven and earth’s spirits defy measurement. Utilize this to stabilize the body, conceal the form, and preserve the origin.\n\nIn the northeast, near the Dipper and *Ji* constellations, the wheel turns rightward, spewing forth sprouts. Hidden in the depths, images emerge, and radiant essence scatters. Above *Bi* and *Mao*, *zhen* stirs, heralding the inception of *yang* *qi*. The initial nine, the Hidden Dragon, establishes *yang* with three and *yin* with eight, thus connecting them. On the third day, *zhen* moves; on the eighth, *dui* acts. The nine in the second place, the Visible Dragon, embodies harmony and clarity, its virtues perfected. The *qian* body is complete. The nine in the third place, vigilant at dusk, waxes and wanes, its spirit tallying the ebb and flow, gradually transforming until it returns to its origin. *Xun* continues the lineage, firmly grasping its borders. The nine in the fourth place, leaping or retreating, treads a perilous path. *Gen* governs advance and retreat, forbidding transgression of the appointed time. On the twenty-third day, it holds to its allotted period. The nine in the fifth place, the Flying Dragon, ascends to heaven’s throne, its joy unmatched. The six in the fifth place, *kun*’s embrace, binds the beginning and end, nurturing all beings as the eternal mother. When *yang*’s numbers are exhausted, they recommence, emotions aligning with nature, turning to unite. The nine in the top place, the Exalted Dragon, battles in the wilds. The *yong* of nine, soaring as the Dao’s compass, follows the celestial sphere’s revolutions, ascending and descending, circulating without end. The six lines defy easy scrutiny, for they lack fixed positions—such is the *Yi*’s ancestral origin.\n\nThis again describes the fire-times within a lunar month, using the *qian* hexagram’s six lines to illustrate *yang* *qi*’s waxing and waning. The Dipper and *Ji* refer to the northeast, while *Bi* and *Mao* denote due west—borrowing heaven’s directions to describe earth’s, not implying heaven’s northeast or west. The \"six in the fifth place\" may be a scribal error for \"twenty-six,\" as *kun* governs from the twenty-sixth day onward. The following passage on the *yong* of nine mirrors the earlier discussion of *qian* and *kun*’s dual applications.",
      "overlap_context": "wo, corresponding to the two above; the three substances below align with them. However, the absence of fire’s weight above and the mention of \"Great Yang\" below cast doubt. The mutual containment of the two substances refers to the union of *yin* and *yang*, *kan* and *li*. The error of \"three substances\" is evident.\n\nWhen years and months near their end, nature is harmed, and lifespan is cut short. The body becomes ashes and dust, like dust on a bright window—this is the second transformation.",
      "start_char": 6506,
      "end_char": 7826,
      "start_sentence": 101,
      "end_sentence": 116,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 50.50046753883362,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "朔旦为复阳气始通出入无疾立表微刚黄钟建子兆乃滋彰播施柔暖黎蒸得常临炉施条开路正光光耀寖进日以益长丑之大吕结正低昂仰以成泰刚柔并隆阴阳交接小往大来辐凑于寅运而趋时渐历大壮侠列卯门榆荚堕落还归本根刑德相负昼夜始分夬阴以退阳升而前洗濯羽翮振索宿尘干健盛明广被四邻阳终于已中而相干姤始纪绪履霜最先井底寒泉午为蕤宾宾服于阴阴为主人遁去世位收敛其精懐德俟时栖迟昩否闭不通萌者不生阴伸阳诎没阳姓名观其权量察仲秋情任蓄微稚老枯复荣荠麦牙蘖因冒以生剥烂支体消灭其形化炁既竭亡失至神道穷则反归乎 坤元恒顺地理承天布宣远幽渺隔阂相连应度育种阴阳之原寥廓恍惚莫知其端先迷失轨后为主君无平不陂道之自然变易更盛消息相因终坤始复如循连环帝王承御千秋常存此以十二卦细分一月之火候亦通一岁之火候也 一月之法二日半为一卦复为震之坤临为兑之坤泰为干之坤大壮为干之震夬为干之兑干为干之干姤为干之防遁为干之艮否为干之坤观为坤之防剥为坤之艮坤为坤之坤临为复震大壮为复兑干为复干遁为复防观为复艮坤为坤其推演之例以卦名律名辰名三者而言辐凑即太簇侠列即夹钟洗濯即姑洗中即中吕昩即林伸即申任蓄即南阂即亥应即应钟大率傅防假托不足深究也 后为主君盖亦读易而后得主为句其误久矣 将欲养性延命却期审思后末当虑其先人所禀躯体本一无元精云布因气托初阴阳为度魂魄所居阳神日魂阴神月魄魂之与魄互为室宅性主处内立置鄞鄂情主营外筑垣城郭城郭完全人物乃安于斯之时情合乾坤干动而直气布精流坤静而翕为道舍庐刚施而退柔化以滋九还七反八归六居男白女赤金火相拘则水定火五行之初上善若水清而无瑕道之形象真一难图变而分布各自独居如鸡子黑白相符纵横一寸以为始初四肢五藏筋骨乃具弥历十月脱出其胞骨弱可卷肉滑若铅 此与上篇知白相表里言人之始生亦以阴阳交合而成今欲为丹亦由是也凡言道者皆丹之托名铅疑是饴字以似而误也 阳燧以取火非日不生光方诸非星月安能得水浆二气且远感化尚相通何况近存身切在于心胸阴阳配日月水火为效征耳 目口三宝固塞勿发通真人潜深渊浮游守规中旋曲以视览开阖皆合同为己之轴辖动静不竭穷离气内营卫坎乃不用聪兑合不以谈希言顺鸿蒙三者既关键缓体处空房委志归虚无无念以为常证难以推移心专不纵横寝寐神相抱觉悟候存亡颜容寖以润骨节益坚强辟却众阴邪然后立正阳修之不辍休庶气云雨行淫淫若春泽液液象解氷从头流达足究竟复上升往来洞无极怫怫被容中反者道之验弱者德之柄耘锄宿污细微得调畅浊者清之路昏久则昭明 此一节乃涵养本原工夫尤为要切 【附朱子曰离气内营卫尝见前辈读内为纳其说是也】 世人好小术不审道浅深弃正从邪径欲速阏不通犹盲者不任杖聋者听宫商没水捕雉兔登山索鱼龙植麦欲获黍运规以求方竭力劳精神终年无见功欲知服食法事约而不烦太阳流珠常欲去人卒得金华转而相因化为白液凝而至坚金华先倡有顷之间解化为水马齿阑干阳乃往和情性自然迫促时阴拘畜禁门慈母育养孝子报恩严父施令教饬子孙五行错王相据以生火性销金金伐木荣三五与一天地至精可以口诀难以书传子当右转午乃东旋夘酉界隔主定二名龙呼于虎虎吸龙精两相饮食俱相贪便逐相衔咽咀嚼相吞荧惑守西太白经天杀气所临何有不倾狸犬守防鸟雀畏鹯各有其功何敢有声不得其理难为妄言竭殚家产妻子饥贫自古及今好者亿人讫不谐遇希有能成广求名乐与道乖殊如审遭逢睹其端绪以相况揆物终始五行相克更为父母母含滋液父主禀与凝精流形金石不朽审专不泄得为成道言学小术者劳而无功得此法者约而不烦太阳以下与前篇知白熬枢黄舆等章相表里五行相生母子之恩也",
      "translated_text": "At the new moon’s dawn, *Fu* arises—*yang* *qi* first flows, entering and exiting without hindrance. Erect the gnomon: subtle yet firm, the Yellow Bell establishes *zi*, its omen flourishing and manifest. Scattering warmth, it nurtures the tender and steams the masses, attaining constancy. Tending the furnace, it unfurls branches and opens paths, its radiance pure, growing ever brighter with each passing day. At *chou*, the Great Regulator coalesces, its pitch rising and falling to form *Tai*. Hard and soft flourish together, *yin* and *yang* unite—what was small departs, what is great arrives, converging at *yin* to advance with the season. Gradually traversing *Dazhuang*, it flanks the *mao* gate; elm pods fall, returning to their root. Punishment and virtue contend, day and night first divide.\n\nAt *Guai*, *yin* retreats as *yang* ascends, washing and cleansing feathers and wings, shaking off the dust of old lodgings. *Qian*’s vigor, resplendent and vast, spreads to the four neighbors, *yang* culminating at the center of *si*. *Gou* begins its thread, treading frost—the first wellspring’s chill. At *wu*, *Ruibin* serves *yin*, for *yin* is now host. *Dun* withdraws from its position, gathering its essence, cherishing virtue, awaiting the hour. It lingers in repose.\n\nAt *Pi*, closure and obstruction: what sprouts does not grow. *Yin* extends, *yang* contracts, *yang*’s name and form vanish. Observing its measures, weighing mid-autumn’s mood, it bears the young, the tender, the old, the withered—all revive. Shepherd’s purse and wheat sprout anew, shrouded in life’s mantle.\n\nAt *Bo*, limbs rot, form dissolves, *qi* transforms and depletes, spirit’s path exhausted—it returns to *Kun*’s origin. Ever compliant with earth’s principle, it receives heaven’s decree, spreading afar, profound and distant, yet linked across barriers. It nurtures all, the source of *yin* and *yang*, boundless and indistinct, its beginning unknowable. First lost, then guiding; later, the sovereign. No level ground remains uninclined—such is the Dao’s natural flux, its ceaseless alternation of waxing and waning, mutually engendering. *Kun* ends, *Fu* begins, like tracing an endless ring. Emperors and kings inherit and govern for millennia—this is how the twelve hexagrams finely divide a month’s *huohou*, and likewise a year’s.\n\nA month’s method: two and a half days per hexagram. *Fu* is *Zhen*’s *Kun*; *Lin* is *Dui*’s *Kun*; *Tai* is *Qian*’s *Kun*; *Dazhuang* is *Qian*’s *Zhen*; *Guai* is *Qian*’s *Dui*; *Qian* is *Qian*’s *Qian*; *Gou* is *Qian*’s *Xun*; *Dun* is *Qian*’s *Gen*; *Pi* is *Qian*’s *Kun*; *Guan* is *Kun*’s *Xun*; *Bo* is *Kun*’s *Gen*; *Kun* is *Kun*’s *Kun*. *Lin* is *Fu*’s *Zhen*; *Dazhuang* is *Fu*’s *Dui*; *Qian* is *Fu*’s *Qian*; *Dun* is *Fu*’s *Xun*; *Guan* is *Fu*’s *Gen*; *Kun* is *Kun*’s *Kun*. The principles of extrapolation employ hexagram names, pitch names, and celestial stems—*fucou* is *Taicu*, *xialie* is *Jiazhong*, *xizhuo* is *Guxi*, *zhong* is *Zhonglü*, *moshu* is *Linshen*, *shen* is *shen*, *renxu* is *Nanlü*, *ge* is *hai*, *ying* is *Yingzhong*. Most are metaphorical allusions, not to be scrutinized deeply.\n\nThe phrase \"later the sovereign\" should read \"after studying the *Yi*, one attains sovereignty\"—the error has persisted long.\n\nTo cultivate nature, prolong life, and forestall aging, one must first reflect on origins. The body one inherits is originally undifferentiated, its primordial essence dispersed, borne by *qi*, its measure set by *yin* and *yang*. Here dwell *hun* and *po*: *yang* spirit is the sun’s *hun*, *yin* spirit the moon’s *po*. *Hun* and *po* serve as each other’s abodes. Nature presides within, establishing boundaries; emotion operates without, building walls and ramparts. When walls and ramparts are whole, beings find peace.\n\nAt this time, emotion aligns with *Qian* and *Kun*: *Qian* moves and straightens, *qi* spreads, essence flows; *Kun* is still and receptive, the Dao’s dwelling. The firm retreats, the soft transforms and nourishes. Nine returns, seven reverses, eight reverts, six resides—male is white, female red. Metal and fire restrain each other, then water settles. Fire is the first of the Five Phases, the highest good like water, clear and flawless—the Dao’s form, the True One, hard to depict. Changing and dispersing, each dwells alone, like a chicken’s egg: black and white conjoined, an inch in diameter, the beginning. Limbs, five viscera, sinews, and bones take shape, enduring ten months before emerging from the womb—bones pliable as silk, flesh smooth as lead.\n\nThis mirrors the earlier \"Knowing the White\" and \"Pivot of the Yellow Cart,\" speaking of human birth as the union of *yin* and *yang*. Now, to forge the elixir, one proceeds likewise. All references to the Dao are veiled names for the elixir. \"Lead\" may be a corruption of \"maltose,\" a phonetic error.\n\nThe solar mirror gathers fire—without the sun, no light is born. The moon’s vessel yields no water without stars. These two *qi*, though distant, still resonate—how much more so when near, dwelling close to heart and chest? *Yin* and *yang* pair with sun and moon; water and fire serve as proof.\n\nThe three treasures—eyes, ears, mouth—must be firmly sealed, not vented. The true person lurks in the deep abyss, floating and roaming, guarding the compass’s center, circling and bending to survey. Opening and closing align, the axle and linchpin their own. Movement and stillness never cease; *li* *qi* internally guards and protects. *Kan* is not used for hearing, *dui* does not speak—few words accord with the primordial chaos. These three are the key. Relax the body, dwell in an empty chamber, entrust your will to emptiness, make non-thought your constant. Proof is unshakable; the heart, undistracted, does not stray. In sleep, spirit embraces spirit; upon waking, it awaits presence or absence. The countenance gradually moistens, bones and joints grow ever stronger. Repelling the host of *yin* demons, one then establishes true *yang*, cultivating it without cease. The bedchamber’s *qi* becomes clouds and rain, flowing gently like spring’s moisture, trickling like melting ice—from head to feet, then back upward, ascending and descending through the boundless cavern. Flourishing within, this is the Dao’s verification. Weakness is virtue’s handle. Weed and hoe old impurities, even the minute, to attain harmony. The turbid’s path: long obscured, then bright.\n\nThis passage concerns the work of nurturing the root—especially vital.\n\nThose who favor petty arts do not discern the Dao’s depth, abandoning the true for the deviant. Seeking speed, they block their path, like the blind without a staff, the deaf hearing music, diving for pheasants and hares, climbing mountains for fish and dragons, planting wheat to harvest millet, or using a compass to seek squares. Exhausting spirit and strength, they see no results year after year.\n\nTo know the method of ingesting the elixir: it is simple, not cumbersome. The sun’s flowing pearl ever seeks to leave; suddenly, golden blossoms arise, transforming and intermingling to become a white liquid, congealing into hardness. The golden blossom first initiates; in a moment, it dissolves into the Water Horse’s teeth, wilted and dry. *Yang* then proceeds to harmonize nature and emotion, naturally pressing forward. *Yin* constrains and binds, like a kind mother nurturing, a filial son repaying kindness, a stern father issuing commands to discipline descendants. The Five Phases clash and prevail, relying on each other to generate fire. Fire’s nature melts metal; metal chops wood. The three, five, and one—heaven and earth’s purest essence—can be transmitted orally but not in writing.\n\nYou should turn right at *wu*, then rotate east at *mao* and *you*, where boundaries divide. The host stabilizes two names: the dragon calls to the tiger, the tiger inhales the dragon’s essence. Both drink and eat, mutually coveting, chasing and biting, swallowing each other. Mars guards the west, Venus traverses the sky—where killing *qi* descends, what does not topple? Foxes and dogs guard the pass; birds and sparrows fear the goshawk. Each has its function—how dare they make a sound?\n\nWithout grasping the principle, idle talk is futile. Exhausting family wealth, leaving wife and children destitute—from ancient times to now, countless have pursued this, yet few succeed. Broadly seeking fame, delighting in what contradicts the Dao—if you truly encounter it, observe its threads, compare and measure things from beginning to end. The Five Phases overcome each other, alternating as father and mother. The mother contains nourishing fluids; the father bestows essence, congealing form. Metal and stone do not decay. Focused and undivided, not leaking—this is the way to achieve the Dao.\n\nThose who study petty arts labor without result; those who attain this method find it simple, not cumbersome. The following, from \"The Sun’s Flowing Pearl\" onward, mirrors the earlier \"Knowing the White,\" \"Pivot of the Yellow Cart,\" and other chapters. The Five Phases engender each other—this is the kindness of mother and child.",
      "overlap_context": "onth, using the *qian* hexagram’s six lines to illustrate *yang* *qi*’s waxing and waning. The Dipper and *Ji* refer to the northeast, while *Bi* and *Mao* denote due west—borrowing heaven’s directions to describe earth’s, not implying heaven’s northeast or west. The \"six in the fifth place\" may be a scribal error for \"twenty-six,\" as *kun* governs from the twenty-sixth day onward. The following passage on the *yong* of nine mirrors the earlier discussion of *qian* and *kun*’s dual applications.",
      "start_char": 7826,
      "end_char": 9273,
      "start_sentence": 117,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.97962212562561,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "火金相克严父之令也 三五谓火金木五皆禀土气也 一说谓三五即前篇子午戊巳也 一未详所指或曰与当作为下篇三五并与一亦放此东疑当作左此言阴阳定位也 龙虎六句母子之恩也 荧惑大白以下八句严父之令也 不得其理广求名药为外丹者也 以相况如前篇言八石正纲纪之也 立竿见影呼谷传响岂不灵哉 天地至象若以野一寸巴豆一两入喉辄僵不得俛仰当此之时虽周文揲蓍孔丘占象扁鹊操针巫咸叩鼓安能令苏复起驰走河上姹女灵而最神得火则飞不见埃尘鬼龙匿莫知所存将欲制之黄牙为根物无阴阳违天背原肥鸡自卵其雏不全夫何故乎 配合未连三五不交刚柔离分施化之精天地自然犹火动而炎上水流而润下非有师导使其然者资始统政不可复改观夫雌雄交媾之时刚柔相结而不可解得其节符非有工巧以制御之若男生而伏女偃其躯禀乎 胞胎受气元初非徒生时着而见之及其死也 亦复效之此非父母教令其然本在交媾定制始先坎男为月离女为日日以施德月以舒光月受日化体不亏伤阳失其契阴侵其明朔晦薄蚀奄冒相包阳消其形阴凌灾生男女相须含吐以滋雄雌交杂以相求金化为水水性周章火化为土水不得行故男动外施女静内藏溢度过节为女所拘魄以捡魂不得淫奢不寒不暑进退合时各得其和俱吐证符 以毒药能杀人为黄牙能制姹女之譬外丹即谓丹砂此未详何所指也物无阴阳以下皆物理明为此法者当阴阳交合为本也 丹砂木精得金乃并金水合处木火为侣四者混沌列为龙虎龙阳数奇虎阴数偶肝青为父肺白为母肾黑为子脾黄为祖三物一家都归戊巳刚柔迭兴更历分部龙西虎东建纬卯酉刑德并防相见欢喜刑主伏杀德主生起二月榆死魁临子夘八月麦生天罡据酉子南午北互为纲纪九一之数终则复始含元抱真播精于子关关睢鸠在河之洲窈窕淑女君子好逑雄不独处雌不孤居武龟蛇盘虬相扶以明牝牡毕竟相胥假使二女共室颜色甚姝令苏秦通言张仪结媒发辨利舌奋舒美辞推心调谐使为夫妻弊发腐齿终不相知若药物非种名不同分剂参差失其纪纲虽黄帝临炉太一降坐八公捣链淮南执火立宇崇坛玉为阶陛麟脯凤腊把籍长跪祷祝神祗请哀诸鬼沐浴斋戒冀有所望亦犹和胶脯釜以茵涂疮去冷加氷除用汤飞龟舞蛇愈见乖张 丹砂木精得金乃并即上章姹女黄牙之意心赤脾黄二章诸本无之未详孰是龙虎子午交错方位关关以下又以二女明药物之非种 下篇 惟昔圣贤懐抱真服链九鼎化迹沦含精养神通德三元精液凑理筋骨致坚众邪辟除正气常存累积长久变形而仙忧悯后生好道之伦随傍风采指画古文着为图籍开示后昆露见枝条藏本根托号诸石覆冒众文学者得之韫椟终身子继父业孙踵祖先传世迷惑竟无见闻遂使宦者不遂农夫失耘商人弃货志士家贫吾甚伤之定录斯文字约易思事省不烦披列其条实核可观分两有数因而相循故为乱辞孔窍其门智者审思以意参马 言昔之仙者着书示人而不明言其事托名诸石为身内阴阳之号故学者多失其指今着此书省约易晓仍恐漏泄故多谬乱之辞而孔窍其门也其下歌辞又撮一书大指云 【附按乱辞如离骚之乱曰也下文可见】 法象莫大乎天地兮沟数万里河鼓临星纪兮人民皆惊骇晷景妄前却兮九年被凶咎皇上览视之兮王者退自改关键有低昂兮害炁遂奔走江淮之枯竭兮水流注于海",
      "translated_text": "Fire and Metal overcome each other—this is the stern command of the father. The \"Three and Five\" refers to Fire, Metal, Wood, and the Five, all receiving the qi of Earth. Another interpretation holds that the \"Three and Five\" are the Zi, Wu, Wu, and Si of the earlier chapter. Yet another view remains unclear, or suggests that \"as\" should read \"with\" in the following passage, aligning with the \"Three and Five\" below—while \"east\" should be \"left.\" This speaks of the fixed positions of yin and yang.\n\nThe six lines on Dragon and Tiger express the kindness of mother and child. From \"Mars and Venus\" onward, the eight lines describe the stern command of the father. Those who fail to grasp the principle and broadly seek the elixir of fame pursue external alchemy. Comparing and measuring things, as in the earlier chapter, the Eight Stones serve as the fundamental standard.\n\nSetting up a pole casts a shadow; calling into a valley echoes a response—how can this not be efficacious? Yet the supreme images of Heaven and Earth, if treated carelessly—like a single *ye* herb or a liang of croton entering the throat—will cause one to stiffen, unable to bend or straighten. At such a time, even if King Wen cast yarrow stalks, Confucius interpreted omens, Bian Que wielded needles, or Wu Xian beat drums, how could they revive the fallen or restore the dead to swift movement?\n\nBy the riverside, the radiant maiden is most divine: when she obtains fire, she flies away, leaving no dust or trace. Dragons and demons hide, their whereabouts unknown. To restrain her, yellow sprouts serve as the root. No thing lacks yin and yang; to defy Heaven and oppose the source is like a fat hen hatching her chicks—why are they not whole? Because the union is incomplete: the Three and Five do not meet, hardness and softness remain apart, and the essence of transformation scatters. The natural order of Heaven and Earth—fire rising and flaming upward, water flowing and moistening downward—requires no teacher to guide it. The origin and governance of things cannot be altered.\n\nWhen male and female unite, hardness and softness bind inseparably, attaining their proper rhythm without need for craft or control. Just as a boy is born prone and a girl supine, so too do they receive qi from the womb and placenta—not merely at birth, but even in death, they mirror this pattern. This is not taught by parents; it is determined at the moment of union. Kan (the male) is the Moon, Li (the female) the Sun. The Sun bestows virtue; the Moon spreads its light. The Moon receives the Sun’s transformation, its body unharmed. If yang loses its bond, yin encroaches upon its brightness; at conjunction and new moon, they press close, enveloping one another. Yang’s form wanes; yin’s encroachment brings calamity.\n\nMale and female depend on each other, inhaling and exhaling to nourish; male and female intermingle, seeking one another. When Metal transforms into Water, Water’s nature circulates restlessly. When Fire transforms into Earth, Water cannot flow. Thus, the male moves outward, the female remains within. If overflowing exceeds measure, the female restrains him; the po checks the hun, preventing excess. Neither cold nor heat, advancing and retreating in harmony—each attains balance, both emitting confirming signs.\n\nThe analogy of poison’s power to kill and yellow sprouts’ power to restrain the radiant maiden illustrates external alchemy, here referring to cinnabar. Yet its precise meaning remains unclear. The passage beginning \"No thing lacks yin and yang\" clarifies the principles of things: for this method, the union of yin and yang is fundamental.\n\nCinnabar is the essence of Wood, and when it obtains Metal, they merge. Where Metal and Water unite, Wood and Fire become companions. These four, in primordial chaos, array as Dragon and Tiger: the Dragon is yang, odd in number; the Tiger is yin, even in number. The Liver, green, is the father; the Lungs, white, the mother; the Kidneys, black, the child; the Spleen, yellow, the ancestor. Three things form a family, all converging in Wu and Si. Hardness and softness alternate, traversing their divisions. The Dragon lies west, the Tiger east; the warp is established at Mao and You. Punishment and virtue guard each other, meeting in joy. Punishment subdues killing; virtue governs generation. In the second month, the elm dies when the Demon Star nears Zi and Mao; in the eighth month, wheat sprouts when the Celestial Stem stands at You. Zi is south, Wu is north—they serve as the fundamental standard. The numbers nine and one cycle endlessly, beginning anew. Embracing the original and holding to the true, they sow essence in the child.\n\n*\"Guan guan go the ospreys, on the isle in the river. The modest, retiring, virtuous young lady: for our prince a good mate she.\"* The male does not dwell alone; the female does not live in solitude. The Dark Warrior, tortoise and snake coiled together, illustrate the mutual dependence of male and female. If two women share a chamber, their beauty exquisite, even if Su Qin speaks persuasively, Zhang Yi arranges the match, their hair unbound and tongues eloquent, their words sweet and hearts in harmony—urging them to wed—their hair will rot and teeth decay before they know each other. If herbs and minerals are not of the same kind, their names and categories differ, their proportions misaligned, their standards lost—even if the Yellow Emperor tends the furnace, the Great One descends to sit, the Eight Lords pound and grind, Huainan holds the fire and erects the hall, the altar is raised with jade steps, unicorn jerky and phoenix腊 are offered, registers are held and prayers kneeling recited, spirits and gods entreated, ghosts implored, with bathing and fasting—all in vain hope—it is like applying glue to a cauldron to heal a wound, adding ice to remove cold, or using hot water to fly tortoises and dance snakes: the result is only greater disorder.\n\n\"Cinnabar is the essence of Wood, and when it obtains Metal, they merge\" echoes the earlier chapter’s \"radiant maiden and yellow sprouts.\" The two chapters on the red heart and yellow spleen are absent in some versions; it is unclear which is correct. The lines on Dragon and Tiger, Zi and Wu intersecting in their positions, and the passage beginning *\"Guan guan\"* further clarify that herbs and minerals not of the same kind are like two women.\n\n---\n\n**Later Chapter**\n\nOnly the sages and worthies of old embraced the mysterious and held to the true, ingesting the nine-times-cycled elixir. Their traces transformed, dragons and fishes concealed; they contained essence and nurtured spirit, penetrating virtue’s three origins. Essence and fluids converged in their principles, sinews and bones became firm. All evil was repelled; vital qi remained constant. Through long accumulation, they changed form and became immortals.\n\nGrieving for later generations who love the Dao, they followed the winds and gathered traces, inscribing ancient texts and creating diagrams to reveal the branches and leaves while concealing the root. They entrusted names to various stones, veiling the workings of internal yin and yang. Scholars who obtained these texts stored them in caskets, passing them down through generations. Sons followed fathers, grandsons succeeded ancestors—yet through the ages, confusion reigned, and none perceived the truth. Thus, officials failed in their duties, farmers neglected their fields, merchants abandoned their goods, and scholars impoverished their families. I lament this deeply.\n\nThis record is concise, its principles simple, its affairs unburdensome. Its clauses are laid out, its facts verifiable, its weights and measures precise. Following one another, they form a tangled web of words, their gates and apertures obscure. The wise will ponder deeply and compare them with intent.\n\nThe immortals of old wrote books to instruct others but did not speak plainly of their methods, instead using the names of stones to signify the internal workings of yin and yang. Thus, many scholars lost the thread. This book is written to be brief and easily understood, yet I still fear its secrets may leak. Therefore, I have filled it with misleading and disordered words, obscuring its gates and apertures. The following songs distill the book’s essential meaning.\n\n*(Note: The appended disordered words resemble the \"Luan\" section of the* Li Sao. *See below.)*\n\nNo image is greater than Heaven and Earth;\nThe mysterious gully spans ten thousand li.\nThe Drum Star nears the Starry Sequence—\nThe people all tremble in fear.\nShadows recklessly advance and retreat;\nNine years of misfortune befall.\nThe August Emperor gazes upon it—\nThe king retreats and reforms himself.\nThe key has its highs and lows;\nHarmful qi flees in haste.\nThe rivers and Huai run dry—\nWaters flow into the sea.",
      "overlap_context": "ins nourishing fluids; the father bestows essence, congealing form. Metal and stone do not decay. Focused and undivided, not leaking—this is the way to achieve the Dao.\n\nThose who study petty arts labor without result; those who attain this method find it simple, not cumbersome. The following, from \"The Sun’s Flowing Pearl\" onward, mirrors the earlier \"Knowing the White,\" \"Pivot of the Yellow Cart,\" and other chapters. The Five Phases engender each other—this is the kindness of mother and child.",
      "start_char": 9273,
      "end_char": 10518,
      "start_sentence": 128,
      "end_sentence": 148,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.32967567443848,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "此一节言水溢之咎王者能自改则害气息而水土平矣沟盖谓天汉河鼓星名星纪丑位未详其说九年谓洪水关键低昂谓阴阳升降也害气灾害之气以人身取譬而言亦为水火不既济之象 【附朱子曰沟害气恐未是说人身内事方是设譬之辞　王莽传曰害气将究矣盖上文说洪水为灾而王者能改故害气去而洪水平也害讹作周又讹作固后人遂妄改为精而増而字皆非是然因周字可见其为害字盖篆文皆相似也】 天地之雌雄兮徘徊子与午寅申阴阳祖兮出入复终始循斗而招摇兮执衡定元纪升熬于甑山兮炎火张设下白虎倡导前兮苍液和于后 【附朱子曰虎一作礜一作矾按三字皆假名但下句云苍液即此合作礜与矾而前有礜磁之文即作礜为得然下句又云朱乌及再列三兽之名位则此当为虎而液亦当为龙矣倡导前即前所谓熬枢下文云和于后即此似皆指有情之物作龙虎为当也此一节又是以火烹水以水防火金水相合复还本初之意】 朱鸟翱翔戏兮飞色五采遭遇网罗施兮压止不得举嗷嗷声甚悲兮如婴儿慕母颠倒就汤镬兮摧折伤毛羽漏刻未过半兮龙鳞狎猎起五色象炫耀兮变化无常主潏潏鼎沸驰兮暴涌不休止杂沓重叠累兮犬牙相错拒形如仲冬氷兮阑干吐钟乳崔嵬以杂厕兮兼积相支柱阴阳得其配兮淡泊自相守青龙处房六兮春华震东夘白虎在七兮秋芒兑西酉朱雀在张二兮正阳离南午三者俱来朝兮家属为亲侣本之但二物兮末乃为三五三五并与一兮都集归二所治之如上科兮日数亦取甫先白而后黄兮赤色通表里名曰第一鼎兮食如大黍米 此复总言还丹之法撮其精要子午谓乾坤寅申谓坎离升熬即所谓熬枢伏蒸者白虎金青龙水朱雀火以金生水水而灭火以成丹其形如此前所谓先液后凝马齿阑干是也嗷嗷声正悲亦前所谓昼夜声正勤者阴阳得配淡泊相守即所谓各守境隅各自独居者房东方七宿之中六其度数也七张二放此二物谓阴阳三五谓火金木皆禀土气也并与一详其文意与似当作为二所取甫皆未详其文义 自然之所为兮非有邪伪道山泽气相烝兮兴云而为雨泥竭乃成尘兮火灭自为土若蘗染为黄兮似蓝成绿组皮革煮为胶兮麴糵化为酒同易施功兮非种难为巧 譬上事 惟斯之妙术兮审谛不诳语传于亿代后兮昭然而可考焕若星经汉兮炳如水宗海思之务令熟兮反复视上下千周灿彬彬兮万徧将可睹神明或告人兮魂灵忽自悟探端索其绪兮必得其门户天道无适莫兮常传与贤者 言其书指着明学者但能读千周万徧则当自晓悟如神明告之也董遇云读书千徧其义自见又曰思之思之又重思之思之不通鬼神将教之非鬼神之力也精神之极也非妄语也 五相 【此篇五章一参同二太易三象彼四郐国五委时】 参同契者敷陈梗槩不能纯一纤微未备缺略仿髴今更撰录补塞遗脱润色幽深钩援相逮防意等齐所趣不悖故复作此命五相则太易之情性尽矣太易情性各如其度黄老用究较而可御炉火之事真有所据三道由一俱出径路枝茎华叶果实垂布正在根株不失其素诚心所言审而不误象彼仲冬节竹木皆摧伤佐阳诘商旅人君深自藏象时顺节令闭口不用谈天道甚浩旷太无形容虚寂不可睹匡郭以消亡谬误失事绪言还自败伤别序斯四象以晓后生盲 此言晦朔之间浑沌鸿蒙形而藏之时也太无形容上善若水真一难图之象也四象未详",
      "translated_text": "This passage speaks of the calamity of floods overflowing. If the king can reform himself, harmful qi will cease, and water and earth will be balanced. The \"mysterious gully\" refers to the Celestial River; \"Drum Star\" is a star’s name; \"Starry Sequence\" is the position of *chou*. Its meaning remains unclear. \"Nine years\" refers to the Great Flood. \"Key has its highs and lows\" signifies the ascent and descent of yin and yang. \"Harmful qi\" is the qi of disaster, illustrated through the analogy of the human body—also representing the unbalanced interaction of water and fire.\n\n*(Appended: Zhu Xi says, \"The 'mysterious gully' and 'harmful qi' likely refer to matters within the human body, serving as metaphorical language. The *Biography of Wang Mang* states, 'The harmful qi is about to be exhausted.' The above text describes the disaster of floods, and if the king reforms, harmful qi departs, and the floods subside. 'Harm' was mistakenly written as *zhou*, then further corrupted to *gu*; later scholars erroneously altered it to 'essence' and added the word 'increase,' both incorrect. However, the character *zhou* reveals its origin as 'harm,' for their seal and ancient scripts are similar.)*\n\nHeaven and Earth as female and male,\nWander between *zi* and *wu*, *yin* and *shen*.\nYin and yang’s origin,\nEnters and exits, completes its beginning and end.\nFollowing the Dipper’s handle in its sweep,\nGrasping the balance to fix the primal order.\nAscending and roasting on Mount Zeng,\nThe blazing fire spreads below.\nThe White Tiger leads the way,\nThe Azure Fluid harmonizes behind.\n\n*(Appended: Zhu Xi says, \"Tiger was once written as *yu*, once as *fan*. All three are borrowed names. The next line speaks of 'azure fluid,' so if this is *yu* or *fan*, and the preceding text mentions 'magnet' (*yu ci*), then *yu* is appropriate. Yet the following line mentions the 'Vermilion Bird' and lists the names and positions of the Three Beasts, so this should be 'Tiger,' and 'fluid' should be 'Dragon.' 'Leads the way' corresponds to the earlier 'roasting pivot,' while 'harmonizes behind' seems to refer to sentient beings. Thus, using Dragon and Tiger is fitting. This passage describes refining water with fire, then restraining fire with water, uniting Metal and Water to return to the original state.\")*\n\nThe Vermilion Bird soars and plays,\nIts feathers gleam with five hues.\nEncountering nets and snares spread,\nIt is pressed down, unable to rise.\nIts wails are mournful,\nLike an infant longing for its mother.\nOverturned into the boiling cauldron,\nIts feathers and plumage are crushed and broken.\nBefore half a *ke* has passed,\nDragon scales stir in restless motion.\nFive-colored forms dazzle,\nTransforming without constancy.\nThe bubbling cauldron boils fiercely,\nSurging violently without cease.\nLayered and piled in disarray,\nLike interlocking dog’s teeth.\nIts form resembles midwinter ice,\nWith stalactites jutting forth.\nTowering and jumbled together,\nThey accumulate and prop each other up.\nWhen yin and yang find their match,\nThey settle in tranquil harmony.\nThe Azure Dragon dwells in House Six,\nSpring blossoms in the east at *mao*.\nThe White Tiger resides in *You* Seven,\nAutumn’s edge in the west at *you*.\nThe Vermilion Bird in *Zhang* Two,\nThe true yang of *Li* in the south at *wu*.\nWhen all three come to court,\nTheir kin become companions.\nOriginally two things,\nIn the end, they become three and five.\nThree and five unite with one,\nAll gathering at the second place of governance.\nAs described above,\nThe days are counted, first white, then yellow,\nWith red permeating inside and out.\nThis is called the First Cauldron,\nIts nourishment like grains of millet.\n\nThis again summarizes the method of returning the elixir, distilling its essence. *Zi* and *wu* signify *qian* and *kun*; *yin* and *shen* signify *kan* and *li*. \"Ascending and roasting\" refers to the \"roasting pivot\" and steaming. The White Tiger is Metal; the Azure Dragon is Water; the Vermilion Bird is Fire. Metal generates Water, and Water extinguishes Fire to form the elixir—its form is thus. The earlier \"first fluid, then congealing\" and \"horse’s teeth in disarray\" describe this. The \"mournful wails\" correspond to the earlier \"day and night, the sound ever earnest.\" When yin and yang find their match and settle in tranquil harmony, it means \"each guards its domain, dwelling alone.\" *House* is among the seven eastern lodges, with six as its degree. *You* Seven and *Zhang* Two—these two things are yin and yang. Three and five are Fire, Metal, and Wood, all receiving the qi of Earth. \"Unite with one\" and \"gather at the second place\" require careful interpretation of the text, though the meaning of \"first white\" and \"all\" remains unclear.\n\nWhat nature does,\nIs free from deceit or falsehood.\nThe qi of mountains and marshes steams,\nRising as clouds to become rain.\nWhen mud dries, it turns to dust;\nWhen fire dies, it becomes earth.\nLike the yellow dye from *nie*,\nOr indigo making green,\nBoiling hides to make glue,\nOr fermenting yeast to brew wine—\nThough their transformations differ,\nWithout the proper method, skill is in vain.\n\n*(This illustrates the above principles.)*\n\nOnly this wondrous art,\nIs precise and free from deception.\nPassed down to countless generations,\nIt shines clearly for posterity,\nRadiant as the starry Han,\nLuminous as the sea’s source.\nPonder it thoroughly,\nReview it again and again, a thousand times over.\nBrilliant and resplendent,\nAfter ten thousand repetitions, it becomes visible.\nThe divine may reveal it to you,\nOr your spirit may suddenly awaken.\nSeek its threads and origins,\nAnd you will find its gate and door.\nThe Dao of Heaven is impartial,\nYet it is always transmitted to the worthy.\n\nThis passage clarifies the book’s intent: if scholars read it a thousand times, ten thousand times, they will naturally understand, as if the divine had instructed them. Dong Yu said, \"Read a book a thousand times, and its meaning will become clear.\" He also said, \"Ponder it, ponder it again, and ponder it further. If you still do not grasp it, ghosts and spirits will teach you—not by their power, but by the extremity of your spirit. This is no idle talk.\"\n\nThe Five Mutual Reflections:\n*(This text has five chapters: one, the* Cantong Qi*; two, the* Taiyi*; three, the* Xiangbi*; four, the* Kuiguo*; five, the* Weishi*.)*\n\nThe *Cantong Qi* presents an outline,\nYet it is not entirely complete, with omissions and gaps.\nNow I have compiled and supplemented it,\nFilling its lacunae, refining its profundities,\nDrawing connections to ensure coherence,\nAligning its intent and equalizing its aims,\nSo that its purpose remains unobstructed.\nThus, I have composed this *Five Mutual Reflections*,\nIn which the nature and emotions of the *Taiyi* are fully expressed.\nThe nature and emotions of the *Taiyi* each follow their measure.\nThe Yellow Emperor and Laozi explored and compared them,\nAnd the art of furnace and fire has true basis.\nThe Three Ways emerge from the One,\nTheir paths, branches, flowers, leaves, and fruits\nAll depend on the root.\nDo not lose your original sincerity.\nWhat I have spoken is careful and without error.\n\nThe image of midwinter,\nWhen bamboo and trees are broken and harmed,\nAssists yang in interrogating *shang*.\nThe traveler and the lord deeply conceal themselves,\nFollowing the season’s rhythm.\nSeal your lips, do not speak of the Dao of Heaven—\nIt is vast and boundless,\nToo profound for form or description,\nEmpty and still, beyond perception.\nIts framework fades away,\nPreventing errors and lost threads.\nSpeak separately of these Four Images\nTo enlighten later generations who are blind.\n\nThis describes the time between the dark and new moons,\nWhen chaos and the primordial mist take form and hide.\nThe *Taiyi* is without form,\nThe highest good like water,\nThe true unity difficult to depict.\nThe Four Images remain unclear.",
      "overlap_context": "nded disordered words resemble the \"Luan\" section of the* Li Sao. *See below.)*\n\nNo image is greater than Heaven and Earth;\nThe mysterious gully spans ten thousand li.\nThe Drum Star nears the Starry Sequence—\nThe people all tremble in fear.\nShadows recklessly advance and retreat;\nNine years of misfortune befall.\nThe August Emperor gazes upon it—\nThe king retreats and reforms himself.\nThe key has its highs and lows;\nHarmful qi flees in haste.\nThe rivers and Huai run dry—\nWaters flow into the sea.",
      "start_char": 10518,
      "end_char": 11767,
      "start_sentence": 149,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.40176820755005,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "郐国鄙夫幽谷朽生 【附朱子曰魏君实上虞人当作防稽或是魏语作郐】 挟懐朴素不落权荣栖迟僻陋忽略令名执守恬淡希时安平远客燕间乃撰斯文歌叙大易三圣遗言察其防趣一统共伦务在顺理宣耀精神神化流通四海和平表以为历万世可循序以御政行之不烦引内养性黄老自然含德之厚归根返元近在我心不离已身抱一母舍可以长存配以服食雄雌设陈挺除武都八石弃捐审用成功世俗所珍罗列三条枝茎相连同出异名皆由一门非徒累句谐偶斯文殆有其真砾硌可观使余敷伪却被赘愆命参同契微览其端辞寡意大后嗣宜遵委时去害依托丘山循游寥廓与鬼为邻化形而仙沦寂无声百世一下遨游人间陈敷羽翮东西南倾汤遭厄际水旱隔并柯叶萎黄失其华荣吉人相乘负安稳可长生 鼎器歌 圆三五寸一分口四八两寸唇长二尺厚薄匀腹三齐坐垂温",
      "translated_text": "The rustic from Kuai, a humble man of secluded valleys,\n【*Zhu Xi notes: \"Wei Junshi of Shangyu—should read 'Fang Ji' or perhaps 'Wei Kui' in the dialect; the text writes 'Kuai'\"*】\nClasped simplicity and plainness, untouched by fleeting glory.\nDwelling in obscurity, he disregarded fame,\nHolding fast to tranquility, indifferent to worldly ease.\nA wanderer in distant lands, at leisure in the halls of Yan,\nHe composed this text, chanting the *Great Ease*—\nThe three sages’ bequeathed words.\nExamining its hidden purport, he saw all things united in one principle,\nStriving to align with reason, to illumine the spirit,\nThat its numinous transformation might flow freely,\nBringing peace to the four seas.\nHe set it forth as a model for ten thousand generations to follow,\nA guide for governance, effortless in practice.\n\nInwardly cultivating nature,\nHe embraced the natural Way of the Yellow Emperor and Laozi,\nHolding profound virtue within.\nReturning to the root, reverting to the origin—\nIt lies near in the heart, inseparable from the self.\nEmbracing the One, never forsaking it,\nOne may endure forever.\nPaired with dietary arts—\nThe male and female principles arrayed,\nThe eight minerals of Wudu refined and cast aside—\nDiscern their use, and success is achieved.\nWhat the world treasures, he laid out in three branches,\nStems and twigs intertwined,\nAll emerging from a single gate under different names.\n\nNot merely ornate phrases in harmonious pairs,\nThis text holds its truth—\nGrit and gravel may be observed,\nWhile I, in spreading falsehoods, am burdened with excess faults.\nThe *Cantong Qi*’s subtle threads I barely glimpse,\nIts words few, its meaning vast.\nLater descendants should heed and entrust themselves to the times,\nAvoiding harm, relying on the mountains,\nRoaming the boundless expanse,\nNeighbors to spirits,\nTransforming their forms to become immortals,\nMerging with silence, soundless.\nOnce in a hundred generations, they descend to wander among men,\nDisplaying their feathered wings,\nEast and west, south and north, they incline—\nTang met with calamity,\nWater and drought divided,\nBranches and leaves withered and yellowed,\nLosing their flourishing splendor.\nThe fortunate ride in comfort,\nSecure and steadfast, they may attain long life.\n\n**Song of the Cauldron**\nRound, three by five *cun*, its mouth one *fen* wide,\nFour *liang* and eight *qian* in weight, its rim two *chi* long,\nEven in thickness.\nIts belly threefold aligned, seated and suspended,\nEver warm.",
      "overlap_context": "e Dao of Heaven—\nIt is vast and boundless,\nToo profound for form or description,\nEmpty and still, beyond perception.\nIts framework fades away,\nPreventing errors and lost threads.\nSpeak separately of these Four Images\nTo enlighten later generations who are blind.\n\nThis describes the time between the dark and new moons,\nWhen chaos and the primordial mist take form and hide.\nThe *Taiyi* is without form,\nThe highest good like water,\nThe true unity difficult to depict.\nThe Four Images remain unclear.",
      "start_char": 11767,
      "end_char": 12098,
      "start_sentence": 163,
      "end_sentence": 167,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.975913047790527,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "二尺或作尺二彭晓解作二尺三齐一作齐三按齐即脐字 阴在上阳下奔 此二句是要法 首尾武中间文阴火白黄芽铅两七窍辅翼人胆理脑定升子处中得安存来去游不出门渐成大性情纯却归一还本原至一周甚辛勤密防防莫迷昏途路远极幽若达此防乾坤乐道者寻其根审五行定铢分谛思之不须论深藏守莫传文御白鹤兮驾龙鳞游太虚兮谒仙君录天图兮号真人 周易参同契考异 赞序 参同契者词陋而道大言微而防深列五帝以建业配三皇而立政若君臣差殊上下无准序以为政不至太平服食其法未能长生学以养性又不延年至于剖析阴阳合其铢两日月望八卦成象男女施化刚柔动静米盐分判以经为证用意健矣故为立法以传后贤惟晓大象必得长生强已益身为此道者重加意焉此似注序后人所作今注亡而序存耳立法即立注字转写误耳 附朱子曰或云后序或云魏君赞词其文意乃是注之后序彭晓序云魏君密示青州徐从事令笺注徐名而注之恐此是徐君语也其注则不复存矣 右周易参同契魏伯阳所作魏君后汉人篇题盖放纬书之目词韵皆古奥雅难通读者浅闻妄辄更改故比他书尤多舛误今合诸本更相雠正其间尚多疑晦未能尽祛姑据所知写成定本其诸同异因悉存之以备参订云空同道士邹防 附按邹防二字朱子借之托名也邹本春秋邾子之国乐记天地防合郑氏注云防当作熹 附朱子曰按魏书首言乾坤坎离四卦槖钥之外其次即言屯六十卦以见一日用功之早晚又次即言纳甲六卦以见一日用功之进退又次即言十二辟卦以分纳甲六卦而两之盖内以详理月节而外以兼统岁功其所取于易以为说者如是而已初未尝及夫三百八十四爻也 今世所传火候之法乃以三百八十四爻为一周天之数以一爻直一日而爻多日少则不免去其四卦二十四爻以俟二十四气之至而渐加焉 已非出于自然吻合之度矣 且当日所用之爻或阴或阳亦无次第不知功夫有何分别又况一日之间已周三百六十之数而其一气所加仅得一爻多少重轻不相权准又此二十四者进増微渐退减暴疾无复往来循环之势恐亦后人以意为之未必魏君之本指也 逆意此书大要在于坎离二字若于此处得其纲领则功夫之节度魏君所不言者自可以意为之但使不失其早晚之期进退之节便可用功不必一一拘旧说故今推得防数一法似亦整齐其与爻数之法虽皆魏君所不言然此为粗有理也 盖月以十二卦分之卦得二日有半各以本卦之爻行本卦之防自八月观卦以后至正月泰卦阳用少二十八防阴用老二十四防自四月大壮以后至七月否卦阳用老三十六防阴用少二十二防阳即注意流行阴即放于寂一爻已足即一开辟之气其休息之十二卦周即为一日之功十二卦周即为一岁之运反覆循环无有余欠其数已具图欲与季通讲之未及写寄而季通死矣 附按朱子于昔所着书成家者未尝随声附影轻附于圣人之徒如麻衣易以为戴师愈所作关子明易以为阮伪作其重于传信如此独于参同契无一语疑似且其解易得于邵子为多而其言曰邵子得于希夷希夷源流自参同契是以从上处之也 尝曰眼中见得了了如此但无下手处又曰今始识头绪未得其作料孔穴庆元丁已季通编置道州将别留宿寒泉相与订正参同契终夕不寐呜呼是师是弟子处忧患不乱如此而独于参同拳拳焉 脱屣世外之意决矣 明年季通卒又得所谓防数之法恨不得与季通讲之又二年而先生卒矣",
      "translated_text": "**Variations and Annotations**\nTwo *chi* is sometimes written as one *chi* and two *cun*; Peng Xiao interprets it as two *chi*. The \"three alignments\" are sometimes written as \"alignments three.\" *Qi* (齐) here denotes the *navel*.\n\nYin above, yang below—rushing forth:\nThese two lines are the essential method.\n\nHead and tail martial, the center civil;\nYin fire, white and yellow sprouts;\nLead and mercury, the seven apertures as aids;\nThe human gallbladder governs the brain, settling the ascent.\nThe *Xuanzi* abides in the center, secure and preserved.\nComing and going, roaming yet never leaving the gate,\nGradually the great nature is perfected,\nThe temperament pure, returning to the One,\nRestoring the original source.\nOne cycle is most arduous—\nGuard closely, guard against confusion,\nLest the path grow distant and the mystery profound.\nShould one attain this, the joy of Heaven and Earth in the Dao—\nSeek its root, examine the Five Phases,\nWeigh each *zhū* and *fēn* with care,\nReflect deeply—no need for further discourse.\nConceal it, preserve it, do not transmit it.\nMount the white crane, ride the scaled dragon,\nRoam the Great Void, pay homage to the Immortal Lords,\nReceive the celestial charts, be named a Perfected One.\n\n**Colophon and Postface to the *Zhouyi Cantong Qi* with Textual Variants**\n\nThe *Cantong Qi* is coarse in diction yet vast in Dao; its words subtle, its warnings profound. It arrays the Five Emperors to establish enterprise and matches the Three Sovereigns to institute governance. Though lord and minister differ in rank, above and below lack fixed order, yet in ordering governance, great peace is not attained. The methods of ingesting elixirs cannot confer long life; learning to nurture nature does not extend years. Yet in dissecting yin and yang, harmonizing their weights, the waxing and waning of the sun and moon, the images of the Eight Trigrams, the transformations of male and female, the movements of hard and soft, the divisions of activity and stillness—all are judged by the classics, their intent robust. Thus, it sets forth a method to transmit to later worthies. Only those who fathom the great image may attain long life, strengthen the self, and benefit the body. Those who pursue this Dao must apply their minds with gravity.\n\nThis appears to be a postface appended to the commentary, composed by a later hand. The original commentary is lost, and only the preface remains. \"Setting forth a method\" (*lì fǎ*) was likely a scribal error for \"setting forth a commentary\" (*lì zhù*).\n\n**Appended Note by Master Zhu [Xi]**\nSome say this is the postface; others, that it is Wei Jun’s eulogy. The style and meaning suggest it is a postface to the commentary. Peng Xiao’s preface states: \"Wei Jun secretly showed it to Xu, the Attendant of Qingzhou, who annotated it.\" Xu’s given name was Lü, and he provided the commentary. This may be Xu’s own words, for his commentary no longer survives.\n\n**Right: *Zhouyi Cantong Qi* by Wei Boyang**\nWei Jun was a man of the Later Han. The title of his work likely imitates the style of apocryphal texts. Its diction and rhymes are archaic and elegant, difficult to comprehend. Superficial readers rashly alter it, so it contains more errors than other books. Here, I have collated various editions and corrected them against one another. Many passages remain obscure and cannot be fully resolved; I have recorded what I know as a definitive version, preserving all variants for further comparison.\n\n—Zou Fang of Kongtong Daoist Abbey\n\n**Appended Note**\nThe name \"Zou Fang\" was borrowed by Master Zhu as a pseudonym. *Zou* was originally the state of Zhu in the Spring and Autumn period. In the *Record of Music*, \"Heaven and Earth *xié* in harmony,\" Zheng’s commentary reads: \"*Xié* should be *xī*.\"\n\n**Appended Note by Master Zhu [Xi]**\nExamining the *Wei Shu*, it begins with the four trigrams Qian, Kun, Kan, and Li as the bellows and key, then proceeds to the sixty hexagrams of Zhun and Meng to illustrate the early and late stages of daily practice. Next, it discusses the six hexagrams of Na Jia to show the advance and retreat of daily practice, followed by the twelve sovereign hexagrams, which divide the six Na Jia hexagrams into two, detailing the monthly nodes internally while encompassing the yearly work externally. Such is its use of the *Yi* as a framework—nothing more. It never addresses the three hundred eighty-four lines.\n\nThe fire-phase methods transmitted today take the three hundred eighty-four lines as the count of one celestial cycle, with each line governing one day. Since the lines exceed the days, four hexagrams and twenty-four lines are removed, awaiting the arrival of the twenty-four qi to gradually add them. This no longer accords with the natural harmony of the system. Moreover, the lines used each day—whether yin or yang—lack order, and it is unclear how the practice distinguishes them. Furthermore, within a single day, the count already completes three hundred sixty, yet the addition of one qi corresponds to only one line. The imbalance in weight and measure is evident. The twenty-four additions and subtractions proceed by minute increments or abrupt reductions, lacking the cyclical rhythm of advance and retreat. This is likely a later invention, not the original intent of Wei Jun.\n\nI suspect the crux of this book lies in the two trigrams Kan and Li. If one grasps their essential principles, the timing of the practice—though not explicitly stated by Wei Jun—can be inferred. As long as the periods of early and late, advance and retreat are not lost, one may proceed without rigid adherence to old interpretations. Thus, I have deduced the method of *fang* numbers, which, though not mentioned by Wei Jun, offers a coherent system. The method of line counts, though also unaddressed, may yet hold some rationale.\n\nThe moon is divided into twelve hexagrams, each governing two and a half days. Each hexagram’s lines govern the *fang* of its own hexagram. From the hexagram Guan in the eighth month to the hexagram Tai in the first month, yang employs twenty-eight *fang* of youthful yang, while yin employs twenty-four *fang* of mature yin. From the hexagram Dazhuang in the fourth month to the hexagram Pi in the seventh month, yang employs thirty-six *fang* of mature yang, while yin employs twenty-two *fang* of youthful yin. Yang is the intent in motion; yin is the release into stillness. One line suffices as one opening and closing of qi. The twelve hexagrams of rest constitute one day’s work; the twelve hexagrams’ cycle constitutes one year’s movement. The process repeats endlessly, without excess or deficiency. The numbers are illustrated in a diagram, which I intended to discuss with Ji Tong but never sent before his death.\n\n**Appended Note**\nAmong Master Zhu’s earlier works that established his scholarly reputation, he never lightly attached himself to the followers of the sages. He considered the *Manyi Yi* to be by Dai Shiyu and the *Guanziming Yi* to be a forgery by Ruan Kan, so rigorously did he uphold authenticity. Yet regarding the *Cantong Qi*, he offered no skeptical remarks. His interpretation of the *Yi* drew heavily from Shaozi, and he acknowledged that Shaozi’s insights derived from Xi Yi, whose lineage traced back to the *Cantong Qi*. Thus, he deferred to its authority.\n\nHe once remarked: \"I see it clearly in my mind’s eye, but I lack a starting point.\" And again: \"Now I grasp the outline, but I have yet to master the materials, the cavities, the openings.\" In the ding-si year of the Qingyuan era, Ji Tong was assigned to Daozhou. On the eve of his departure, he stayed at Hanquan, where they revised the *Cantong Qi* together through the night without sleep. Alas! Such was the bond between teacher and disciple, unshaken even in hardship, yet so devoted were they to this text. His resolve to transcend the worldly was unmistakable.\n\nThe following year, Ji Tong passed away. Later, he discovered the method of *fang* numbers and regretted not being able to discuss it with Ji Tong. Two years later, the Master himself died.",
      "overlap_context": "ir feathered wings,\nEast and west, south and north, they incline—\nTang met with calamity,\nWater and drought divided,\nBranches and leaves withered and yellowed,\nLosing their flourishing splendor.\nThe fortunate ride in comfort,\nSecure and steadfast, they may attain long life.\n\n**Song of the Cauldron**\nRound, three by five *cun*, its mouth one *fen* wide,\nFour *liang* and eight *qian* in weight, its rim two *chi* long,\nEven in thickness.\nIts belly threefold aligned, seated and suspended,\nEver warm.",
      "start_char": 12098,
      "end_char": 13362,
      "start_sentence": 168,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.5097599029541,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "然则参同阴符二书自其师弟子始而二书不戾于圣人可信故成书以之列太极先天之后岂有二乎 哉 周易参同契考异",
      "translated_text": "Thus, from the very beginning of their master-disciple relationship, the *Cantong Qi* and the *Yinfu Jing* were held in accord with the sages—this is indeed trustworthy. Therefore, when compiling his work, he placed them after the *Taiji* and *Xiantian* diagrams; how could there be any discrepancy? The *Zhouyi Cantong Qi Kaoyi*.",
      "overlap_context": "zhou. On the eve of his departure, he stayed at Hanquan, where they revised the *Cantong Qi* together through the night without sleep. Alas! Such was the bond between teacher and disciple, unshaken even in hardship, yet so devoted were they to this text. His resolve to transcend the worldly was unmistakable.\n\nThe following year, Ji Tong passed away. Later, he discovered the method of *fang* numbers and regretted not being able to discuss it with Ji Tong. Two years later, the Master himself died.",
      "start_char": 13362,
      "end_char": 13414,
      "start_sentence": 188,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.7071805000305176,
      "metadata": {
        "source_file": "dao\\藏外\\周易参同契考异.txt",
        "category": "藏外"
      }
    }
  ]
}