{
  "source_id": "周易参同契鼎器歌明镜图",
  "source_file": "chunked_daozang\\周易参同契鼎器歌明镜图.json",
  "total_chunks": 7,
  "total_original_chars": 4192,
  "total_translated_chars": 21612,
  "total_translation_time": 112.17398357391357,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\周易参同契鼎器歌明镜图.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "*The Zhouyi Cantong Qi Dingqi Ge Mingjing Tu*\n\n**Title:** *The Zhouyi Cantong Qi Dingqi Ge Mingjing Tu* (*Illustrated Mirror of the Tripod Vessel Ode from the Zhouyi Cantong Qi*). Originally annotated by Peng Xiao of Later Shu. One fascicle.\n\n**Source Text:** *Daoist Canon of the Orthodox Tradition* (*Zhengtong Daozang*), *Great Mystery Section* (*Taixuan bu*).\n\n**Collated Editions:**\n1. *Complete Library of the Four Treasuries* (*Siku Quanshu*), *Wenyuan Pavilion* edition, *Daoist Works* section (hereafter *Siku* edition).\n2. *Complete Collection of Daoist Scriptures*, *Compendium of the True Principles of the Golden Elixir* edition.\n\n---\n\n*The Zhouyi Cantong Qi Dingqi Ge Mingjing Tu*\nAnnotated by Peng Xiao, Gentleman for Court Audiences and Acting Vice Director of the Bureau of Sacrifices in the Ministry of Rites, Bearer of the Purple Gold Fish Tally\n\n**Ode of the Tripod Vessel**\n\nXiao divided the *Cantong Qi* into ninety chapters, corresponding to the \"nine yang\" number, including four supplementary sections titled *Supplementing Omissions and Rectifying Errors*. The *Ode of the Tripod Vessel*, originally placed before the *Supplement*, is preserved here separately—its phrases interlinked, its lines fragmented—to correspond to the \"one water\" number.\n\n**The Ode:**\n\nThree and five, round,\nThe tripod’s circumference: one foot five inches; its hollow center: five inches.\nZhang Sui’s annotation states: This is called the *Taiyi Furnace Method*.\nRound as heaven, square as earth,\nIts form like a floating gourd, or the shape of the human body.\nThree tiers, symbolizing the Three Elixir Fields.\nThus, the Three Luminaries, Five Phases, Four Images, and Eight Trigrams are all contained within.\nOne inch one fen thick.\n\nThe mouth measures four by eight,\nIts inverted opening like a golden cauldron’s pot,\nThe outer lip upturned and folded,\nCircumference approximately three feet two inches,\nThe bright center spanning one foot across.\nA two-inch lip.\nThe upright rim encircling,\nTwo inches high.\nLength one foot two,\nThe tripod’s full height: one foot two inches,\nWater enters eight inches from the top.\nThickness even,\nThe entire body one inch one *fen* thick, uniformly so.\nThe belly aligned,\nThe tripod’s body—top, middle, and bottom—straight and equal.\nSuspended to retain warmth,\nThe tripod hangs within the furnace, not touching the ground—this is the *Suspended Womb Tripod*.\nYin above,\nThe upper water tripod moistens below.\nYang rushes upward,\nThe lower fire ascends to blaze above.\nHead and tail martial,\n*Si* and *Wu* mark the boundary of yin and yang:\n*Si* is the yang rat’s tail, *Wu* the yin boar’s head—thus the fire is martial.\nThe center civil,\nBetween *Si* and *Wu*, yin and yang advance and retreat,\nEach attaining the mean—thus the fire is civil.\nBeginning with seventy, ending with three decades,\nTwo hundred and six, well-tempered and even.\nSeventy, three decades, and two hundred sixty,\nTogether totaling three hundred sixty days,\nCorresponding to the great number of the celestial revolution.\nWithin this, carefully temper and harmonize the fire,\nLest the great reckoning of heaven and earth be lost.\nMaster Wei sought to pair and complete the verse,\nThus dividing it as such.\nYin fire white,\nWhen fire meets yin, it is said to be white.\nMetal and water find their use, hence much white and little red transform into *Yellow Sprout Lead*.\nThe Yellow Sprout arises from lead,\nLead is the mother of the sprout.\nTwo sevens gather, aiding and sheltering the adept.\nThe two sevens—\nAs stated in a later section: *\"The Azure Dragon dwells in the sixth chamber of the House, the White Tiger in the seventh of the Ease,\"* and in the lower scroll’s eighty-second chapter.\nThis signifies the qi of the Azure Dragon’s seven lodges and the White Tiger’s seven lodges,\nConverging to nurture the divine embryo,\nAiding and sheltering to give birth to the *True Person of Numinous Mercury*.\nThe tripod vessel establishes the Three Powers,\nThe central palace is the human—\nThus the middle section states: *\"The True Person lurks in the deep abyss, floating and roaming within the compass,\"* as in the middle scroll’s sixty-sixth chapter.\nNourish the brain, stabilize the ascent of the mysterious.\n\nThe Child dwells in the center, secure and preserved.\nThe Golden Mother of the Spirit Chamber nurtures and rears the True Child of Mercury.\nAs stated in an earlier section: *\"Warmly nourish the Child-Pearl,\"* in the twentieth chapter of the upper scroll.\n\nComing and going in roaming, never leaving the vessel.\nGradually growing great, nature and essence pure.\nThe Maiden and the Infant, sheltered and nurtured by the Mother,\nBecome the barrier and the strike—\nThe tripod vessel firm and steadfast.\nThe Original Path cannot escape,\nOnly within the vessel does it ascend and descend, swim and drift.\nAs the days and months revolve in cycles,\nIt gradually refines into pure essence.\n\nReturning to the One, restoring the original source.\nAt first, the Water Mother serves as the foundation of the elixir;\nThe Water Mother then gives birth to its Mercury,\nThus it is called returning to the One and restoring the origin.\n\nCherish and revere as lord and minister.\nAfter a full cycle, the labor is arduous.\nGuard closely, never grow confused or dull.\nA year’s toil is strenuous—\nAttend carefully to protection,\nLest negligence arise.\n\nThe path is distant, again profound and mysterious.\nIf you attain this, you will comprehend Heaven and Earth.\nThe Dao of the elixir is subtle and obscure, its purport deep and far-reaching.\nIf one can fathom it,\nIt is as if Heaven and Earth lie in the palm,\nThe sun and moon rest in the heart—\nNothing is beyond reach.\n\nWhen the *daogui* is imbibed, the hun and po grow tranquil.\nThe Golden Elixir of Returned Cinnabar:\nWhen the *daogui* permeates the five viscera,\nThe spirit refines the qi to clarity,\nThe hun is at peace, the po is still.\nThe mortal bones are transformed,\nBecoming those of the True Person.\n\nThose who attain longevity are the worthy children of the *hao-sheng* virtue.\nSeek out the root of the divine medicine and cultivate it,\nNever err by employing杂 miscellaneous substances.\n\nExamine the Five Phases and determine the precise weights.\nIn refining the Returned Cinnabar,\nThe root of fire revolves with the clepsydra’s marks,\nMoving in mutual exchange.\nFirst investigate the nature and essence of yin and yang,\nScrutinize the Five Phases,\nAnd distinguish the weights in fractions—\nOnly then will there be attainment.\n\nThus Immortal Cao said:\n*\"The Golden Elixir connects with the divine immortals,\nIts practice is present everywhere,\nYet it is bound as a thing.\"*\n\nThe white-haired are not spared,\nFor the immortals cherish it.\n\nKnow the true Lead and Mercury—\nOne Water and one Stone.\nThe Central Palace first serves as the master,\nWater and fire are bound as a thing.\n\nThe two substances become husband and wife,\nHusband and wife pair and match.\nA hundred marks reach the qi of *li*,\nCinnabar emerges from this.\n\nThus we know the Golden Elixir of Returned Cinnabar\nIs not apart from yin and yang, the Five Phases,\nThe true Lead and true Mercury.\nWhen they harmonize to form the medicine,\nThere is no other path.\n\nPonder this deeply, no need for further discourse.\nGuard it in concealment, do not transmit the text.\n\nLet those who would refine their essence and delve deeply into thought not speak of it lightly. Seal it within the heart, for if recklessly transmitted in writing, one will surely incur heavenly punishment. Mounting the white crane, riding the scaled dragon, roaming the Great Void, and paying homage to the Immortal Lords—receiving the celestial charts, one is titled a Perfected. After the elixir is accomplished, merits fulfilled and virtue abundant, one receives the register and charts, attains the rank of Perfected, and verifies the proofs of the Dao—is this not so?\n\nIn the *Eulogy and Preface*, Zhu Xi of Huian remarked... (This may be the words of Attendant Xu.) The *Cantong Qi* conceals its words yet embodies the great Dao, speaks subtly yet holds profound meaning. It arrays the Five Thearchs to establish enterprise and aligns with the Three Sovereigns to govern. If ruler and minister are disordered, above and below lack standard; if governance follows such sequence, great peace will not be achieved. Exotic methods of ingestion cannot confer longevity, nor can learning to nurture nature extend years. Yet when yin and yang are dissected and their weights harmonized, when the crescent and full moons, the eight trigrams form images, when male and female act, hardness and softness move and still, when grains and salts are distinguished—using the classics as evidence—its intent is resolute.\n\nThus it establishes laws to transmit to later worthies, elucidating the great image to attain longevity. Those who follow our Dao must attend to this earnestly. The disciples described by Master Wei are all metaphorical expressions: ruler and minister, father and son interchange; male and female, husband and wife alternate—this is the sequence of divine medicine receiving qi and undergoing transformation. If hierarchy is unstable and ruler and minister lose order, the foundation of the great elixir collapses and cannot stand.\n\nMoreover, within the four chapters of the *True Contract*, only the gate of supreme medicine is expounded, revealing the ancestral lineage of Lead and Mercury. There are no separate methods of ingestion nor various arts of nurturing nature, lest people stray from the true path. Therefore, it reiterates the intent of cultivating the elixir: without exception, it relies on yin and yang, sun and moon, movement and stillness, hardness and softness, division and judgment, Kan and Li, harmony and union, male and female—following the eight trigrams, dividing the two crescents, the fire tally of zi and wu, the dawn and dusk of pi and tai, merging south with north, uniting east with west. They mutually receive qi, intermingle their essences, and thus form the Returned Elixir.\n\nAll who share this aspiration must attend to it earnestly. Wei Boyang condensed the *Zhouyi* to compose the *Cantong Qi*, illuminating the secrets of elixir cultivation. Thus he pointed to the root of medicinal substances beginning with the same kind and demonstrated the advance and retreat of the fire tally ultimately requiring mutual restraint. His exposition is thorough and meticulous, so that his instruction to later generations is urgent and essential. If scholars of the world read it with sincere hearts and study it deeply, they will surely perceive its subtleties and understand its meaning.\n\nYet this work was composed in the Han era, its diction profound and elegant, replete with ancient rhythms. Later readers, possessing but shallow knowledge, recklessly altered its text. By the end of the Five Dynasties, Peng Xiao divided it into chapters and provided interpretive explanations, which may indeed be called a true aid to the classic. However, his annotations perpetuated errors, sometimes extracting passages out of context—such as Zhu Xi’s remark, *“Thus the* Zhouyi *governs the heart of Heaven, and how could it not be steadfast?”*—which properly belongs to the following chapter. Though the great meaning is clarified, the ancient text remains fragmented in intent. Peng’s *Explanations* were also later tampered with by shallow scholars of recent times, leading to such confusion.\n\nNow, the versions preserved in the imperial archives and those transcribed among the people abound in discrepancies, omissions, and redundancies, leaving no authoritative recension. Recently, Master Zhu Xi, concealing his name, undertook a collation, examining and rectifying the text with reasoned evidence, thereby restoring much of its authenticity—a version worthy of reliance. Yet no reliable edition of the *Chapter Divisions and Explanations* exists. The recension by Zheng Huan of Lin’an, though claimed to be thorough, contains numerous errors. When compared to the original text, it often diverges; when measured against other versions, its coherence falters.\n\nIn my humble post, burdened with official duties, I have, in moments of respite, taken up this work and read it, finding it increasingly compelling. Thus, I have collated multiple editions, establishing a definitive text. For the main body, I largely follow Zhu Xi’s original. For the *Comprehensive True Explanations*, I broadly adopt Zheng’s version. Where most editions agree, I defer to the majority. In cases where the *Cantong Qi* text and the *Explanations* diverge—such as the *Qi* stating, *“Combined, they form sixty,”* while the *Explanations* read, *“Combined, they form the sixty-four hexagrams”*; or the *Qi* declaring, *“Then water stabilizes fire,”* while the *Explanations* say, *“Restraint then stabilizes water”*—I preserve both, allowing them to stand side by side. Though this may not be perfect, it at least clarifies the essential meaning of the elixir classic.\n\nAccording to Peng’s preface, Wei Boyang composed the *Cantong Qi* after obtaining the *Ancient Text of the Dragon-Tiger Classic*. Today, this book exists, yet it lacks the archaic profundity of the *True Cantong Qi*. Some speculate it may be akin to the *Three Tombs* texts or the *Fox-Head Classic*, though this remains uncertain. Nevertheless, the text itself predates the Five Dynasties. After his *Explanations*, Peng further wrote the *Illuminating Mirror Diagrams and Secrets*, intending to unlock the gates of the *True Cantong Qi*. Here, I place the classic at the beginning of this volume, followed by its secrets, uniting them into a single work. May those of discernment examine it carefully.\n\nNow, carved into blocks and circulated, it is shared with fellow seekers to together verify the supreme Dao.\n\nOn the fifth day of the eleventh month in the cyclical year *wuchen* of the first year of the Jiading reign (1108), coinciding with the winter solstice, Bao Huanzi Zhongqi, *Tongzhilang* and Magistrate of Jianyang County in Jianning Prefecture, concurrently overseeing agricultural affairs, respectfully inscribed this.\n\n**Illuminating Mirror Diagrams**\n\nHaving completed the chapter divisions and explanations of the *Illuminating Mirror Diagrams*, I humbly observe: the *True Cantong Qi* speaks in subtle terms of the profound Dao, its text expansive and its principles abstruse. Though its three scrolls are interconnected from beginning to end, and the cyclical rise of the Five Phases is clearly expounded by the perfected ones, I fear that the dull-witted among later learners may struggle to comprehend it. Thus, I have once again distilled the *True Cantong Qi* and composed the *Illuminating Mirror Diagrams and Secrets*, arranging eight cycles to correspond with movement and stillness, clarifying the two images to determine yin and yang. The profound mysteries of the *True Cantong Qi* may then be grasped at a single glance.\n\n**The Secret States:**\nThe workings of creation lie hidden, their traces unfathomable;\nThe true secret, clustered here, guides the uninitiated.\nThree scrolls conceal their mysteries within eight cycles,\nWhile the myriad phenomena unfold within a single mirror.\nThe *Li* maiden rides the dragon as the Wood groom,\nThe *Kan* man mounts the tiger as the Metal anvil.\nThose who cherish the Dao should study it with precision—\nMaster it, and the path to longevity lies open.\n\nThe supreme Dao is subtle and profound, wondrous yet abstruse;\nTo refine the elixir, first recognize the heart of the Great Return.\nThe solar line, yin and even, births true mercury;\nThe lunar trigram, yang and odd, yields pure metal.\nThe woman conceives cinnabar, the man gestates snow—\nIn the north, Mars conceals *bing*, while *ren* is contained within.\nThe two poles point to the ancestral lead and gold—\nDo not seek them haphazardly among the myriad forms.\n\n**The Solar Image and the Qi of Fire**\nThe sun is yang, yet within yang lies yin—\nLike cinnabar containing true mercury.\nWhen yang is excessive and yin deficient, it cannot radiate its spirit,\nThus it is called the \"female fire,\" for yang harbors yin within.\nWithin the sun dwells the crow; its trigram belongs to the south,\nAnd it is the *Li* maiden.\n\n**The Lunar Image**\nThe moon is yin, yet within yin lies yang—\nLike lead containing true silver.\nWhen yin is excessive and yang deficient, it cannot nourish its essence,\nThus it is called the \"male metal,\" for yin harbors yang within.\nWithin the moon dwells the hare; its trigram belongs to the north,\nAnd it is the *Kan* man.\n\n**The First Cycle: The Essence of Metal and Qi**\nThe Four Images and Eight Trigrams form the gates of heaven and earth,\nWith humanity arrayed among the eight directions, mutually engaged.\n\n**The Second Cycle**\nThe path of ghosts and spirits, the twenty-eight constellations—\nIlluminating the celestial revolutions and the fire numbers, beginning with *tianyi*.\n\n**The Third Cycle**\nThe thirty phases of waxing and waning—\nUniting the monthly fire numbers, corresponding to the sixty-four hexagrams in mutual application.\n\n**The Fourth Cycle**\nFifty black dots, fifty black-and-white dots—\nThe numbers of yin tally and yang fire in a hundred notches, corresponding to the celestial tally’s movement and stillness.\n\n**The Fifth Cycle**\nThe twelve hexagrams—\nClarifying the monthly progression and retreat of line images, the rise and fall of dragon and tiger.\n\n**The Sixth Cycle**\nThe twelve earthly branches—\nThe fire times of ascent and descent, drilling and merging, revolving the celestial tally.\n\n**The Seventh Cycle**\nDisplaying the fire numbers of the celestial revolution—\nConverging the four seasons to correspond with the inner images.\n\n**The Eighth Cycle**\nArranging yin and yang, the Five Phases, and the myriad phenomena within the crucible—\nAssisting the metal and water, dragon and tiger, the *Li* maiden and *Kan* man in their union,\nTogether generating true cinnabar and true mercury, thus completing the Reverted Elixir.\n\n**On the *Cantong Qi*:**\n*Can* means \"to intermingle\"; *tong*, \"to penetrate\"; *qi*, \"to unite.\"\nIt signifies that its principles align and its meanings converge with those of all elixir scriptures.\nIn refining the Golden Liquor Reverted Elixir, one must first seek the primordial root of heaven and earth;\nNext, investigate the images of yin and yang’s division;\nUnderstand that water and fire, though mutually destructive, become husband and wife;\nRecognize that metal and water, though mutually generative, reverse to become mother and child.\nThus, when the male embodies the female form, lead yields cinnabar;\nWhen the female merges with the male shape, cinnabar births mercury.\nThe sun is yang, and within the sun dwells the crow—yang contains yin.\nThe moon is yin, and within the moon dwells the hare—yin contains yang.\nThese are the true images manifest by heaven and earth; those who comprehend them may be called true yin and yang.\nThere is also the Dao of yin and yang’s inversion, the principle of water and fire’s mutual necessity, and the path of creation and generation.\nOnce the path is known, one must grasp its root—\nThe root is the primordial root of heaven and earth.\nHaving obtained the root, one must grasp its image—\nThe image is that of yin and yang’s division.\nHaving obtained the image, one must follow movement and stillness.\nHaving followed movement and stillness, one must know its numbers.\nHaving known its numbers, one must adhere to the clepsydra.\nHaving adhered to the clepsydra, one must clarify advance and retreat.\nHaving clarified advance and retreat, one must distinguish dragon and tiger.\nHaving distinguished dragon and tiger, the boundaries of south and north are set,\nThe forms of metal and wood unite,\nAnd the Dao of the Great Elixir is accomplished.\n\nThere are further inner and outer symbolic methods, inner and outer water and fire;\nThere are altars and furnaces, crucibles and chambers;\nThere are embryos and wombs, line images and hexagrams;\nThere are the fire times of water and fire, the rules of extraction and addition;\nThere are the molds of casting and pouring, the forms of separation and union—\nAll these must be fully prepared; none may be lacking.\nThe aspirant must further cast aside sensory pleasures, abandon cravings,\nRenounce fame and profit, retreat to sacred mountains,\nSever mundane ties, befriend immortals,\nAnd cultivate in seclusion, ceaselessly day and night—\nOnly then may success be hoped for.\nWithout such dedication, one’s efforts will be in vain.\nThus, the Perfected Lord of Yin states: \"Do not shrink from gains and losses; with single-minded devotion, refine the Reverted Elixir—only then may one harbor such hopes.\"\n\nIn the tenth year of the Guangzheng reign of the Later Shu (947), in the cyclical year *dingwei*, on the eighth day of the ninth month, Peng Xiao of Feihe Mountain, the True One of Unity, composed this preface.\n\n**The *Cantong Qi*’s \"Song of the Crucible\" and the *Illuminating Mirror Diagrams* conclude here.**\n\n[Annotations and textual variants from the original are not translated as they are editorial notes rather than part of the main text.]\n\n---\n\nThe crucible’s body, in its entirety,\nCycles through ten-day intervals—fire talismans align.\nWhen the moment arrives, the flame refines,\nFor those who grasp the art, the Way unfolds.\n\nYet if one’s nature is not attuned,\nOr the mind’s threads entangled,\nHow can the golden elder and mercury unite in gestation?\nNorth and south, lead and gold—ancestral roots of yang and yin—\nMust converge in fire, their essences compressed,\nTheir spirits poured forth, their hopes fulfilled.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "周易参同契鼎器歌明镜图 经名：周易参同契鼎器歌明镜图。 原题后蜀彭晓注。 一卷。 底本出处：《正统道藏》太玄部。 参校版本：一、文渊阁四库全书本子部道家类（简称四库本）。 二、道书全集金丹正理大全本。 周易参同契鼎器歌明镜图 朝散郎守尚书祠部员外郎赐紫金鱼袋彭晓注 鼎器歌 晓所分《参同契》，并《补塞遗脱》四篇，为九十章，以应阳九之数。 外余《歌鼎器》一篇，本在《补遗》之前，谓其辞理钧连，字句零碎，独存于此，以应水一之数。 歌日： 圆三五， 鼎周圆一尺五寸，中虚五寸。 又张随注云：此名太一炉法。 圆象天，方象地，状若蓬壶，亦如人之身形。 三层，象三丹田也。 故三光、五行、四象、八卦尽在其中矣。 寸一分。 厚一寸一分。",
      "translated_text": "*The Zhouyi Cantong Qi Dingqi Ge Mingjing Tu*\n\n**Title:** *The Zhouyi Cantong Qi Dingqi Ge Mingjing Tu* (*Illustrated Mirror of the Tripod Vessel Ode from the Zhouyi Cantong Qi*). Originally annotated by Peng Xiao of Later Shu. One fascicle.\n\n**Source Text:** *Daoist Canon of the Orthodox Tradition* (*Zhengtong Daozang*), *Great Mystery Section* (*Taixuan bu*).\n\n**Collated Editions:**\n1. *Complete Library of the Four Treasuries* (*Siku Quanshu*), *Wenyuan Pavilion* edition, *Daoist Works* section (hereafter *Siku* edition).\n2. *Complete Collection of Daoist Scriptures*, *Compendium of the True Principles of the Golden Elixir* edition.\n\n---\n\n*The Zhouyi Cantong Qi Dingqi Ge Mingjing Tu*\nAnnotated by Peng Xiao, Gentleman for Court Audiences and Acting Vice Director of the Bureau of Sacrifices in the Ministry of Rites, Bearer of the Purple Gold Fish Tally\n\n**Ode of the Tripod Vessel**\n\nXiao divided the *Cantong Qi* into ninety chapters, corresponding to the \"nine yang\" number, including four supplementary sections titled *Supplementing Omissions and Rectifying Errors*. The *Ode of the Tripod Vessel*, originally placed before the *Supplement*, is preserved here separately—its phrases interlinked, its lines fragmented—to correspond to the \"one water\" number.\n\n**The Ode:**\n\nThree and five, round,\nThe tripod’s circumference: one foot five inches; its hollow center: five inches.\nZhang Sui’s annotation states: This is called the *Taiyi Furnace Method*.\nRound as heaven, square as earth,\nIts form like a floating gourd, or the shape of the human body.\nThree tiers, symbolizing the Three Elixir Fields.\nThus, the Three Luminaries, Five Phases, Four Images, and Eight Trigrams are all contained within.\nOne inch one fen thick.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 318,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.82255220413208,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契鼎器歌明镜图.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "口四八， 口偃开如金#1之锅釜，外唇仰折，周围约三尺二寸，明心横有一尺。 两寸唇。 立唇环匝#2高二寸。 长尺二， 鼎通身长一尺二寸，上水入鼎八寸。 厚薄匀#3。 通身厚一寸一分，令均匀也。 腹齐#4二， 鼎身#5腹底通直，令上、中、下等。 坐垂温。 鼎悬於电中，不着地，悬胎鼎是也。 阴在上， 上水鼎以润下。 阳下奔。 下运火以炎上。 首尾武，巳、午是阴阳界分，巳为阳子尾，午为阴亥首，故火武也。 中问文。 巳、午两向中问，阴阳进退，各得其中，故火文也。 始七十，终三旬。 二百六，善调匀。 七十、三旬#6、二百六十，都合三百六十日，应周天大数也。 於其问细意调匀符火#7，不令失天地之大数。 魏公欲谐偶成文，故分而言之也。 阴火白， 火数遇#8阴，云火#9白是也。 金水得用，故多白少赤化 黄芽铅。 黄芽生於铅，铅是芽母也。 两七聚，辅翼人。 两七者#10，后篇云：青龙处房六兮，白虎在易七兮，下卷八＋二章内云。 喻青龙七宿之气与白虎七宿之气，合聚神胎，辅翼而生灵汞真人也。 绿鼎器立三才，中官为人，故中篇云：真人潜深渊，浮游守规中是也。 中卷六十六章内云。 赡理脑，定升玄。",
      "translated_text": "The mouth measures four by eight,\nIts inverted opening like a golden cauldron’s pot,\nThe outer lip upturned and folded,\nCircumference approximately three feet two inches,\nThe bright center spanning one foot across.\nA two-inch lip.\nThe upright rim encircling,\nTwo inches high.\nLength one foot two,\nThe tripod’s full height: one foot two inches,\nWater enters eight inches from the top.\nThickness even,\nThe entire body one inch one *fen* thick, uniformly so.\nThe belly aligned,\nThe tripod’s body—top, middle, and bottom—straight and equal.\nSuspended to retain warmth,\nThe tripod hangs within the furnace, not touching the ground—this is the *Suspended Womb Tripod*.\nYin above,\nThe upper water tripod moistens below.\nYang rushes upward,\nThe lower fire ascends to blaze above.\nHead and tail martial,\n*Si* and *Wu* mark the boundary of yin and yang:\n*Si* is the yang rat’s tail, *Wu* the yin boar’s head—thus the fire is martial.\nThe center civil,\nBetween *Si* and *Wu*, yin and yang advance and retreat,\nEach attaining the mean—thus the fire is civil.\nBeginning with seventy, ending with three decades,\nTwo hundred and six, well-tempered and even.\nSeventy, three decades, and two hundred sixty,\nTogether totaling three hundred sixty days,\nCorresponding to the great number of the celestial revolution.\nWithin this, carefully temper and harmonize the fire,\nLest the great reckoning of heaven and earth be lost.\nMaster Wei sought to pair and complete the verse,\nThus dividing it as such.\nYin fire white,\nWhen fire meets yin, it is said to be white.\nMetal and water find their use, hence much white and little red transform into *Yellow Sprout Lead*.\nThe Yellow Sprout arises from lead,\nLead is the mother of the sprout.\nTwo sevens gather, aiding and sheltering the adept.\nThe two sevens—\nAs stated in a later section: *\"The Azure Dragon dwells in the sixth chamber of the House, the White Tiger in the seventh of the Ease,\"* and in the lower scroll’s eighty-second chapter.\nThis signifies the qi of the Azure Dragon’s seven lodges and the White Tiger’s seven lodges,\nConverging to nurture the divine embryo,\nAiding and sheltering to give birth to the *True Person of Numinous Mercury*.\nThe tripod vessel establishes the Three Powers,\nThe central palace is the human—\nThus the middle section states: *\"The True Person lurks in the deep abyss, floating and roaming within the compass,\"* as in the middle scroll’s sixty-sixth chapter.\nNourish the brain, stabilize the ascent of the mysterious.",
      "overlap_context": "rrespond to the \"one water\" number.\n\n**The Ode:**\n\nThree and five, round,\nThe tripod’s circumference: one foot five inches; its hollow center: five inches.\nZhang Sui’s annotation states: This is called the *Taiyi Furnace Method*.\nRound as heaven, square as earth,\nIts form like a floating gourd, or the shape of the human body.\nThree tiers, symbolizing the Three Elixir Fields.\nThus, the Three Luminaries, Five Phases, Four Images, and Eight Trigrams are all contained within.\nOne inch one fen thick.",
      "start_char": 319,
      "end_char": 852,
      "start_sentence": 21,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.45386815071106,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契鼎器歌明镜图.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "子处中，得安存。 神室金母，养育水银真子也。 前篇云：温养子珠是也。 上卷二十章内云。 来去游，不出门。 渐成大，情性纯。 妮女婴兄，得母安养，又为关挞，鼎器坚牢，元路逃逸，只在器内上下游泳，日月数周，渐成纯质。 却归一，还本原。 始以水母为丹基，水，母复生其水银，故谓之归一还元也。 善爱敬，如君臣。 至一周，甚辛勤。 密防护，莫迷昏。 周年辛勤，细意防护，元致懈怠也。 途路远，复幽玄。 若达此，会乾坤。 丹道幽微，旨趣深远，若能了达，可谓乾坤入掌，日月在心，无所不至也。 刀圭沾，静魄魂。 金液还丹，刀圭沾五内，即神炼气清，魂安魄静，更易#11凡骨，变为真人。 得长生令好生之子，寻究神药根源 而修之勿致误用杂类也。 审五行定铢分。 凡修还丹火之根源环刻漏，行互用，先究阴阳之情性，审察五行，析别分铢方有所获也。 故曹真人日：金液通神仙行处处有系为物。 素非#12仙人惜。 要识真铅汞，一水与一石。 中官先为主，水火系#13为物。 二物为夫妇，夫妇相配匹。 百刻达离气，丹砂从此出。 则知金液还丹，非阴阳五行．真铅真汞，合和成药，则余无别径也。 谛思之，不须论。 深藏守，莫传文。",
      "translated_text": "The Child dwells in the center, secure and preserved.\nThe Golden Mother of the Spirit Chamber nurtures and rears the True Child of Mercury.\nAs stated in an earlier section: *\"Warmly nourish the Child-Pearl,\"* in the twentieth chapter of the upper scroll.\n\nComing and going in roaming, never leaving the vessel.\nGradually growing great, nature and essence pure.\nThe Maiden and the Infant, sheltered and nurtured by the Mother,\nBecome the barrier and the strike—\nThe tripod vessel firm and steadfast.\nThe Original Path cannot escape,\nOnly within the vessel does it ascend and descend, swim and drift.\nAs the days and months revolve in cycles,\nIt gradually refines into pure essence.\n\nReturning to the One, restoring the original source.\nAt first, the Water Mother serves as the foundation of the elixir;\nThe Water Mother then gives birth to its Mercury,\nThus it is called returning to the One and restoring the origin.\n\nCherish and revere as lord and minister.\nAfter a full cycle, the labor is arduous.\nGuard closely, never grow confused or dull.\nA year’s toil is strenuous—\nAttend carefully to protection,\nLest negligence arise.\n\nThe path is distant, again profound and mysterious.\nIf you attain this, you will comprehend Heaven and Earth.\nThe Dao of the elixir is subtle and obscure, its purport deep and far-reaching.\nIf one can fathom it,\nIt is as if Heaven and Earth lie in the palm,\nThe sun and moon rest in the heart—\nNothing is beyond reach.\n\nWhen the *daogui* is imbibed, the hun and po grow tranquil.\nThe Golden Elixir of Returned Cinnabar:\nWhen the *daogui* permeates the five viscera,\nThe spirit refines the qi to clarity,\nThe hun is at peace, the po is still.\nThe mortal bones are transformed,\nBecoming those of the True Person.\n\nThose who attain longevity are the worthy children of the *hao-sheng* virtue.\nSeek out the root of the divine medicine and cultivate it,\nNever err by employing杂 miscellaneous substances.\n\nExamine the Five Phases and determine the precise weights.\nIn refining the Returned Cinnabar,\nThe root of fire revolves with the clepsydra’s marks,\nMoving in mutual exchange.\nFirst investigate the nature and essence of yin and yang,\nScrutinize the Five Phases,\nAnd distinguish the weights in fractions—\nOnly then will there be attainment.\n\nThus Immortal Cao said:\n*\"The Golden Elixir connects with the divine immortals,\nIts practice is present everywhere,\nYet it is bound as a thing.\"*\n\nThe white-haired are not spared,\nFor the immortals cherish it.\n\nKnow the true Lead and Mercury—\nOne Water and one Stone.\nThe Central Palace first serves as the master,\nWater and fire are bound as a thing.\n\nThe two substances become husband and wife,\nHusband and wife pair and match.\nA hundred marks reach the qi of *li*,\nCinnabar emerges from this.\n\nThus we know the Golden Elixir of Returned Cinnabar\nIs not apart from yin and yang, the Five Phases,\nThe true Lead and true Mercury.\nWhen they harmonize to form the medicine,\nThere is no other path.\n\nPonder this deeply, no need for further discourse.\nGuard it in concealment, do not transmit the text.",
      "overlap_context": "he qi of the Azure Dragon’s seven lodges and the White Tiger’s seven lodges,\nConverging to nurture the divine embryo,\nAiding and sheltering to give birth to the *True Person of Numinous Mercury*.\nThe tripod vessel establishes the Three Powers,\nThe central palace is the human—\nThus the middle section states: *\"The True Person lurks in the deep abyss, floating and roaming within the compass,\"* as in the middle scroll’s sixty-sixth chapter.\nNourish the brain, stabilize the ascent of the mysterious.",
      "start_char": 852,
      "end_char": 1360,
      "start_sentence": 56,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.792848587036133,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契鼎器歌明镜图.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "使研精覃思，勿轻易论之。 缄藏于心，若妄以书传，必遭天谴。 御白鹤兮#14，驾龙鳞。 游太虚兮，谒仙君。 录天图兮，号真人。 丹成之后，功满德充，膺箓受图，位居真人，证诸道验，不其然乎。 赞序#15 朱晦庵云…恐此是徐从事之语。 《参同契》者，辞隐而道大，言微而旨深，列五帝以建业，配三皇而立政。 若君臣差殊，上下无准； 序以为政，不至太平； 服食奇法，未能长生； 学以养性，又不延年。 至于剖析阴阳，合其铢两，日月弦望，八卦成象，男女施行，刚柔动静，米盐分判，以经为证，用意健矣。 故为立法以传后贤，推晓大象必得长生，为吾道者重加意焉。 魏公所述子，皆是假借为辞。 君臣父子而互为，男女夫妻而更作，乃神药受气，变化之次序也。 苟尊卑无常，君臣失序，则大丹之基，倾而莫立。 且四篇《真契》中，只陈至药门户，启发铅汞宗祖，并无服食别法又无养性诸术，恐人迷惑正道，故於此重叙修丹之意，莫不以阴阳、日月、动静、刚柔、分判、坎离、和合、男女 循诸八卦，分以二弦，子午火符，晨昏否泰，以南混北，举东合西， 而互为受气，交媾精粹，而成还丹者也。 凡吾同志，宜加意焉。 魏伯阳约《周易》而作《参同契》，以明修丹之诀，故指药物之根基始於同类，示火符之进退终要相拘。 梗筑敷陈，纤微备着，所以启迪后人者，切且至矣。 世之学者，诚心熟读，定见精求义自晓。",
      "translated_text": "Let those who would refine their essence and delve deeply into thought not speak of it lightly. Seal it within the heart, for if recklessly transmitted in writing, one will surely incur heavenly punishment. Mounting the white crane, riding the scaled dragon, roaming the Great Void, and paying homage to the Immortal Lords—receiving the celestial charts, one is titled a Perfected. After the elixir is accomplished, merits fulfilled and virtue abundant, one receives the register and charts, attains the rank of Perfected, and verifies the proofs of the Dao—is this not so?\n\nIn the *Eulogy and Preface*, Zhu Xi of Huian remarked... (This may be the words of Attendant Xu.) The *Cantong Qi* conceals its words yet embodies the great Dao, speaks subtly yet holds profound meaning. It arrays the Five Thearchs to establish enterprise and aligns with the Three Sovereigns to govern. If ruler and minister are disordered, above and below lack standard; if governance follows such sequence, great peace will not be achieved. Exotic methods of ingestion cannot confer longevity, nor can learning to nurture nature extend years. Yet when yin and yang are dissected and their weights harmonized, when the crescent and full moons, the eight trigrams form images, when male and female act, hardness and softness move and still, when grains and salts are distinguished—using the classics as evidence—its intent is resolute.\n\nThus it establishes laws to transmit to later worthies, elucidating the great image to attain longevity. Those who follow our Dao must attend to this earnestly. The disciples described by Master Wei are all metaphorical expressions: ruler and minister, father and son interchange; male and female, husband and wife alternate—this is the sequence of divine medicine receiving qi and undergoing transformation. If hierarchy is unstable and ruler and minister lose order, the foundation of the great elixir collapses and cannot stand.\n\nMoreover, within the four chapters of the *True Contract*, only the gate of supreme medicine is expounded, revealing the ancestral lineage of Lead and Mercury. There are no separate methods of ingestion nor various arts of nurturing nature, lest people stray from the true path. Therefore, it reiterates the intent of cultivating the elixir: without exception, it relies on yin and yang, sun and moon, movement and stillness, hardness and softness, division and judgment, Kan and Li, harmony and union, male and female—following the eight trigrams, dividing the two crescents, the fire tally of zi and wu, the dawn and dusk of pi and tai, merging south with north, uniting east with west. They mutually receive qi, intermingle their essences, and thus form the Returned Elixir.\n\nAll who share this aspiration must attend to it earnestly. Wei Boyang condensed the *Zhouyi* to compose the *Cantong Qi*, illuminating the secrets of elixir cultivation. Thus he pointed to the root of medicinal substances beginning with the same kind and demonstrated the advance and retreat of the fire tally ultimately requiring mutual restraint. His exposition is thorough and meticulous, so that his instruction to later generations is urgent and essential. If scholars of the world read it with sincere hearts and study it deeply, they will surely perceive its subtleties and understand its meaning.",
      "overlap_context": "s as the master,\nWater and fire are bound as a thing.\n\nThe two substances become husband and wife,\nHusband and wife pair and match.\nA hundred marks reach the qi of *li*,\nCinnabar emerges from this.\n\nThus we know the Golden Elixir of Returned Cinnabar\nIs not apart from yin and yang, the Five Phases,\nThe true Lead and true Mercury.\nWhen they harmonize to form the medicine,\nThere is no other path.\n\nPonder this deeply, no need for further discourse.\nGuard it in concealment, do not transmit the text.",
      "start_char": 1361,
      "end_char": 1933,
      "start_sentence": 87,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.981684684753418,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契鼎器歌明镜图.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "然惟是此书，作於汉世，词意奥雅，类多古韵，其后读者浅闻，妄辄更改。 至五代末，彭晓为之分章义解，诚可谓佐佑真经矣。 然承误注释，或取断章，朱晦庵谓：故《易》统天心及得不坚乎。 皆合属下章之类。 大义虽明，而古文阙裂意者。 彭《义》亦为近世浅学妄更，所以若是。 今自秘馆所藏，民问所录，差误衍脱，莫知适从。 近者晦庵朱先生，尝隐名而为之雠定，考辨正文，引证有理，颇得其真，可以依据。 独《分章义解》，绝无善本。 临安郑焕所校，自谓详备，而尤多舛误。 其视经语，每有不合； 较之他本，则文意稍连。 愚之试邑，适当繁剧，公余得暇，尝取其书而读之，日觉有味，因合众本，为之校定。 其於正文，多从晦庵之旧。 而《通真义解》大略从郑本。 其於众本多同者，亦自从众。 其问《契》文与《义》说，不相附类，若《契》云：兼并为六十。 而《义》云：兼并为六十四卦也。 若《契》云则水定火。 而《义》云拘则水定之类。 则亦两存而互见。 虽不可谓之尽善，然於丹经大意，亦略昭明矣。 谨按彭序以谓：魏公得《古文龙虎经》而撰《参同契》。 今所在有此书，而反不若《真契》之古奥。 或者以谓此，乃今之《三坟》书、《狐首经》之比，是未可知也。 然而，其经固已出於五代之前矣。 彭《义》之后，复撰《明镜图诀》，欲以启《真契》之户牖。 今於篇首，冠以其经，而后附以其诀，庶可通为一书。 识者得以审识焉。 锓版而行，以与同志，共证至道。",
      "translated_text": "Yet this work was composed in the Han era, its diction profound and elegant, replete with ancient rhythms. Later readers, possessing but shallow knowledge, recklessly altered its text. By the end of the Five Dynasties, Peng Xiao divided it into chapters and provided interpretive explanations, which may indeed be called a true aid to the classic. However, his annotations perpetuated errors, sometimes extracting passages out of context—such as Zhu Xi’s remark, *“Thus the* Zhouyi *governs the heart of Heaven, and how could it not be steadfast?”*—which properly belongs to the following chapter. Though the great meaning is clarified, the ancient text remains fragmented in intent. Peng’s *Explanations* were also later tampered with by shallow scholars of recent times, leading to such confusion.\n\nNow, the versions preserved in the imperial archives and those transcribed among the people abound in discrepancies, omissions, and redundancies, leaving no authoritative recension. Recently, Master Zhu Xi, concealing his name, undertook a collation, examining and rectifying the text with reasoned evidence, thereby restoring much of its authenticity—a version worthy of reliance. Yet no reliable edition of the *Chapter Divisions and Explanations* exists. The recension by Zheng Huan of Lin’an, though claimed to be thorough, contains numerous errors. When compared to the original text, it often diverges; when measured against other versions, its coherence falters.\n\nIn my humble post, burdened with official duties, I have, in moments of respite, taken up this work and read it, finding it increasingly compelling. Thus, I have collated multiple editions, establishing a definitive text. For the main body, I largely follow Zhu Xi’s original. For the *Comprehensive True Explanations*, I broadly adopt Zheng’s version. Where most editions agree, I defer to the majority. In cases where the *Cantong Qi* text and the *Explanations* diverge—such as the *Qi* stating, *“Combined, they form sixty,”* while the *Explanations* read, *“Combined, they form the sixty-four hexagrams”*; or the *Qi* declaring, *“Then water stabilizes fire,”* while the *Explanations* say, *“Restraint then stabilizes water”*—I preserve both, allowing them to stand side by side. Though this may not be perfect, it at least clarifies the essential meaning of the elixir classic.\n\nAccording to Peng’s preface, Wei Boyang composed the *Cantong Qi* after obtaining the *Ancient Text of the Dragon-Tiger Classic*. Today, this book exists, yet it lacks the archaic profundity of the *True Cantong Qi*. Some speculate it may be akin to the *Three Tombs* texts or the *Fox-Head Classic*, though this remains uncertain. Nevertheless, the text itself predates the Five Dynasties. After his *Explanations*, Peng further wrote the *Illuminating Mirror Diagrams and Secrets*, intending to unlock the gates of the *True Cantong Qi*. Here, I place the classic at the beginning of this volume, followed by its secrets, uniting them into a single work. May those of discernment examine it carefully.\n\nNow, carved into blocks and circulated, it is shared with fellow seekers to together verify the supreme Dao.",
      "overlap_context": "the *Cantong Qi*, illuminating the secrets of elixir cultivation. Thus he pointed to the root of medicinal substances beginning with the same kind and demonstrated the advance and retreat of the fire tally ultimately requiring mutual restraint. His exposition is thorough and meticulous, so that his instruction to later generations is urgent and essential. If scholars of the world read it with sincere hearts and study it deeply, they will surely perceive its subtleties and understand its meaning.",
      "start_char": 1933,
      "end_char": 2501,
      "start_sentence": 112,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.091726064682007,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契鼎器歌明镜图.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "嘉定元年戊辰十一月五日，辛丑冬至，通直郎知建宁府建阳县主管，劝农公事借诽鲍澣之仲棋谨书。 明镜图 晓所分章解义毕，窃谓：《真契》言微道密，文泛理探。 既三卷之首尾钩牵#16； 而五行之上下轮起，在至人之铺舒甚显，恐末学之愚昧难明，是敢复约《真契》，着成《明镜图诀》一篇，列八环而符动静，明二象以定阴阳，《真契》幽邃，一览而更无遗矣。 诀曰 造化潜施迹莫穷，簇成真诀指童蒙。 三篇秘列八环内，万象门开一镜中。 离女驾龙为木婿，坎男乘虎作金筑#17。 同人好道宜精究，究得长生路便通。 至道希夷妙且探，烧丹先认大还心。 日爻阴偶生真汞，月卦阳奇产正金。 女妊#18朱砂男孕雪，北#19藏荧惑丙含壬。 两端指的铅金祖#20，莫向诸般取次寻。 日象火气魂月象 日者阳也#21，阳内含阴，象砂中有真汞也。 阳元阴，则不能自耀其魂，故名日雌火，乃阳中含阴也。 日中有乌，卦属南方，为离女也。 ． 月者阴也#22，阴内含阳，象铅中有真银也。 阴元阳，则不能自营其魄，故名日雄金，乃阴中含阳也。 月中有兔，卦属北方，为坎男也。 金气魄第一环· 四象八卦，天地门户，人列八维而互用也。 第二环 门鬼路，二十八宿者，明周天行度火数，起天一兀也。 第三环三十圆缺之象者，合一月火数，应六十卦互用也。 第四环 五十点黑，五十黑白，乃阴符阳火百刻之数，应天符动静也。 第五环 十二卦者，明逐月爻象进退，龙虎起伏也。 第六环 十二辰者，火候升降钻合，运天符也。 第七环 显周天之火#23数，蹙#24合四时，以应内象也。 第八环 列阴阳、五行、万象入鼎中，辅助金水龙虎，离女坎男交媾，共生真砂真汞，而成还丹也。 《参同契》者：参，杂也； 同，通也； 契，合也。 谓与诸丹经理通而义台也。 凡修金液还丹，先寻天地混元之根； 次究阴阳分擘之象； 明水火相克，复为夫妻； 认金水相生，反为母子。 故有男兼女体，则铅内产砂； 女混男形，则砂内生汞。 日者阳也，日中有乌，阳含阴也。 月者阴也，月中有兔，阴含阳也。 此天地显垂真象，今达者则之，可谓真阴阳也。 复有阴阳反覆之道，水火相须之理，造化生成之径。 既知其径，须取其根。 根者，则天地混元之根也。 既得其根，须取其象。 象者，则阴阳分擘之象也？ 既得其象，须循动静。 既循动静，须知其数。 既知其数，须依刻漏。 既依刻漏，须明进退。 既明进退，须分龙虎。 既分龙虎，则南北之界定矣。 金木之形合矣。 大丹之道成矣。 复有内外法象，内外水火； 有坛宠焉，有鼎室焉； 有胞胎焉，有爻象焉； 有水火之候焉，有抽添之则焉； 有铸泻#25之模范，有离合之形体，此皆头头俱备，阙一不可。 志士又须撒声色，去嗜欲，弃名利，投灵山，绝常交，结仙友，隐密潜修，昼夜元息，方可希望#26。 或不如是，则虚劳动耳。 故阴真#27君日：莫辞得失一志而修还丹，乃可冀也。 时孟蜀广政十年，岁次下未九月八日，昌利化飞鹤山真一子彭晓序。 周易参同契鼎器歌明镜图竟 #1『金』，四库本作『今』。 #2『匝』，原作『市』，据四库本改。 #3『匀』，四库本作『均』。 #4『齐』，四库本作『脐』。",
      "translated_text": "On the fifth day of the eleventh month in the cyclical year *wuchen* of the first year of the Jiading reign (1108), coinciding with the winter solstice, Bao Huanzi Zhongqi, *Tongzhilang* and Magistrate of Jianyang County in Jianning Prefecture, concurrently overseeing agricultural affairs, respectfully inscribed this.\n\n**Illuminating Mirror Diagrams**\n\nHaving completed the chapter divisions and explanations of the *Illuminating Mirror Diagrams*, I humbly observe: the *True Cantong Qi* speaks in subtle terms of the profound Dao, its text expansive and its principles abstruse. Though its three scrolls are interconnected from beginning to end, and the cyclical rise of the Five Phases is clearly expounded by the perfected ones, I fear that the dull-witted among later learners may struggle to comprehend it. Thus, I have once again distilled the *True Cantong Qi* and composed the *Illuminating Mirror Diagrams and Secrets*, arranging eight cycles to correspond with movement and stillness, clarifying the two images to determine yin and yang. The profound mysteries of the *True Cantong Qi* may then be grasped at a single glance.\n\n**The Secret States:**\nThe workings of creation lie hidden, their traces unfathomable;\nThe true secret, clustered here, guides the uninitiated.\nThree scrolls conceal their mysteries within eight cycles,\nWhile the myriad phenomena unfold within a single mirror.\nThe *Li* maiden rides the dragon as the Wood groom,\nThe *Kan* man mounts the tiger as the Metal anvil.\nThose who cherish the Dao should study it with precision—\nMaster it, and the path to longevity lies open.\n\nThe supreme Dao is subtle and profound, wondrous yet abstruse;\nTo refine the elixir, first recognize the heart of the Great Return.\nThe solar line, yin and even, births true mercury;\nThe lunar trigram, yang and odd, yields pure metal.\nThe woman conceives cinnabar, the man gestates snow—\nIn the north, Mars conceals *bing*, while *ren* is contained within.\nThe two poles point to the ancestral lead and gold—\nDo not seek them haphazardly among the myriad forms.\n\n**The Solar Image and the Qi of Fire**\nThe sun is yang, yet within yang lies yin—\nLike cinnabar containing true mercury.\nWhen yang is excessive and yin deficient, it cannot radiate its spirit,\nThus it is called the \"female fire,\" for yang harbors yin within.\nWithin the sun dwells the crow; its trigram belongs to the south,\nAnd it is the *Li* maiden.\n\n**The Lunar Image**\nThe moon is yin, yet within yin lies yang—\nLike lead containing true silver.\nWhen yin is excessive and yang deficient, it cannot nourish its essence,\nThus it is called the \"male metal,\" for yin harbors yang within.\nWithin the moon dwells the hare; its trigram belongs to the north,\nAnd it is the *Kan* man.\n\n**The First Cycle: The Essence of Metal and Qi**\nThe Four Images and Eight Trigrams form the gates of heaven and earth,\nWith humanity arrayed among the eight directions, mutually engaged.\n\n**The Second Cycle**\nThe path of ghosts and spirits, the twenty-eight constellations—\nIlluminating the celestial revolutions and the fire numbers, beginning with *tianyi*.\n\n**The Third Cycle**\nThe thirty phases of waxing and waning—\nUniting the monthly fire numbers, corresponding to the sixty-four hexagrams in mutual application.\n\n**The Fourth Cycle**\nFifty black dots, fifty black-and-white dots—\nThe numbers of yin tally and yang fire in a hundred notches, corresponding to the celestial tally’s movement and stillness.\n\n**The Fifth Cycle**\nThe twelve hexagrams—\nClarifying the monthly progression and retreat of line images, the rise and fall of dragon and tiger.\n\n**The Sixth Cycle**\nThe twelve earthly branches—\nThe fire times of ascent and descent, drilling and merging, revolving the celestial tally.\n\n**The Seventh Cycle**\nDisplaying the fire numbers of the celestial revolution—\nConverging the four seasons to correspond with the inner images.\n\n**The Eighth Cycle**\nArranging yin and yang, the Five Phases, and the myriad phenomena within the crucible—\nAssisting the metal and water, dragon and tiger, the *Li* maiden and *Kan* man in their union,\nTogether generating true cinnabar and true mercury, thus completing the Reverted Elixir.\n\n**On the *Cantong Qi*:**\n*Can* means \"to intermingle\"; *tong*, \"to penetrate\"; *qi*, \"to unite.\"\nIt signifies that its principles align and its meanings converge with those of all elixir scriptures.\nIn refining the Golden Liquor Reverted Elixir, one must first seek the primordial root of heaven and earth;\nNext, investigate the images of yin and yang’s division;\nUnderstand that water and fire, though mutually destructive, become husband and wife;\nRecognize that metal and water, though mutually generative, reverse to become mother and child.\nThus, when the male embodies the female form, lead yields cinnabar;\nWhen the female merges with the male shape, cinnabar births mercury.\nThe sun is yang, and within the sun dwells the crow—yang contains yin.\nThe moon is yin, and within the moon dwells the hare—yin contains yang.\nThese are the true images manifest by heaven and earth; those who comprehend them may be called true yin and yang.\nThere is also the Dao of yin and yang’s inversion, the principle of water and fire’s mutual necessity, and the path of creation and generation.\nOnce the path is known, one must grasp its root—\nThe root is the primordial root of heaven and earth.\nHaving obtained the root, one must grasp its image—\nThe image is that of yin and yang’s division.\nHaving obtained the image, one must follow movement and stillness.\nHaving followed movement and stillness, one must know its numbers.\nHaving known its numbers, one must adhere to the clepsydra.\nHaving adhered to the clepsydra, one must clarify advance and retreat.\nHaving clarified advance and retreat, one must distinguish dragon and tiger.\nHaving distinguished dragon and tiger, the boundaries of south and north are set,\nThe forms of metal and wood unite,\nAnd the Dao of the Great Elixir is accomplished.\n\nThere are further inner and outer symbolic methods, inner and outer water and fire;\nThere are altars and furnaces, crucibles and chambers;\nThere are embryos and wombs, line images and hexagrams;\nThere are the fire times of water and fire, the rules of extraction and addition;\nThere are the molds of casting and pouring, the forms of separation and union—\nAll these must be fully prepared; none may be lacking.\nThe aspirant must further cast aside sensory pleasures, abandon cravings,\nRenounce fame and profit, retreat to sacred mountains,\nSever mundane ties, befriend immortals,\nAnd cultivate in seclusion, ceaselessly day and night—\nOnly then may success be hoped for.\nWithout such dedication, one’s efforts will be in vain.\nThus, the Perfected Lord of Yin states: \"Do not shrink from gains and losses; with single-minded devotion, refine the Reverted Elixir—only then may one harbor such hopes.\"\n\nIn the tenth year of the Guangzheng reign of the Later Shu (947), in the cyclical year *dingwei*, on the eighth day of the ninth month, Peng Xiao of Feihe Mountain, the True One of Unity, composed this preface.\n\n**The *Cantong Qi*’s \"Song of the Crucible\" and the *Illuminating Mirror Diagrams* conclude here.**",
      "overlap_context": "remains uncertain. Nevertheless, the text itself predates the Five Dynasties. After his *Explanations*, Peng further wrote the *Illuminating Mirror Diagrams and Secrets*, intending to unlock the gates of the *True Cantong Qi*. Here, I place the classic at the beginning of this volume, followed by its secrets, uniting them into a single work. May those of discernment examine it carefully.\n\nNow, carved into blocks and circulated, it is shared with fellow seekers to together verify the supreme Dao.",
      "start_char": 2501,
      "end_char": 3813,
      "start_sentence": 142,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.45454978942871,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契鼎器歌明镜图.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "#5『鼎身』，四库本作『鼎通身』。 #6『旬』，原作『十』，据四库本改。 #7『符火』，四库本作『火符』。 #8『遇』，原作『偶』，据四库本改。 #9『火』，原作『太』，据四库本改。 #10『者』，四库本作『十』。 #11『易』，据四库本补。 #12『素非』，四库本『素』字作『数』。 #13『系』，『四库本作『繁』。 #14『兮』，四库本缺。 #15底本之赞序、鲍仲棋序，分列八环及彭晓后序，四库本皆无之。 #16『钩牵』，四库本作『钩连』。 #17『金翁』，四库本作『金公』。 #18『妊』，四库本作『妊』。 #19『北』，四库本作『地』。 #20『铅金祖』，四库本作『真铅汞』。 #21『阳也』，据四库本补。 #22『阴也』，据四库本补。 #23『火』，原作【大』，据《金丹正理大全》本改。 #24『蹙』，《金丹正理大全》本作『簇』。 #25『泻』，《金丹正理大全》本作『写』。 #26『希望』，《金丹正理大全》本作『期望』。 #27『阴真君』，原作『阴君』，据《金丹正理大全》本改。",
      "translated_text": "[Annotations and textual variants from the original are not translated as they are editorial notes rather than part of the main text.]\n\n---\n\nThe crucible’s body, in its entirety,\nCycles through ten-day intervals—fire talismans align.\nWhen the moment arrives, the flame refines,\nFor those who grasp the art, the Way unfolds.\n\nYet if one’s nature is not attuned,\nOr the mind’s threads entangled,\nHow can the golden elder and mercury unite in gestation?\nNorth and south, lead and gold—ancestral roots of yang and yin—\nMust converge in fire, their essences compressed,\nTheir spirits poured forth, their hopes fulfilled.",
      "overlap_context": "ill be in vain.\nThus, the Perfected Lord of Yin states: \"Do not shrink from gains and losses; with single-minded devotion, refine the Reverted Elixir—only then may one harbor such hopes.\"\n\nIn the tenth year of the Guangzheng reign of the Later Shu (947), in the cyclical year *dingwei*, on the eighth day of the ninth month, Peng Xiao of Feihe Mountain, the True One of Unity, composed this preface.\n\n**The *Cantong Qi*’s \"Song of the Crucible\" and the *Illuminating Mirror Diagrams* conclude here.**",
      "start_char": 3814,
      "end_char": 4305,
      "start_sentence": 219,
      "end_sentence": 241,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.576754093170166,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\周易参同契鼎器歌明镜图.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}