{
  "source_id": "唐嵩高山启母庙碑铭",
  "source_file": "chunked_daozang\\唐嵩高山启母庙碑铭.json",
  "total_chunks": 3,
  "total_original_chars": 2957,
  "total_translated_chars": 17915,
  "total_translation_time": 97.91647458076477,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\唐嵩高山启母庙碑铭.txt",
    "category": "记传类"
  },
  "full_translation": "**Inscription on the Stele of the Qimu Temple at Mount Songgao in the Tang Dynasty**\n\n*Composed by Cui Rong, Gentleman for Court Service and Academician of the Hongwen Pavilion*\n\nI have heard that the generation and completion of Heaven and Earth follow the principle of spontaneity, which is called the Dao; the interplay of yin and yang, whose workings are unfathomable, is called the divine. Thus, when things resonate by kind, and affairs transform through correspondence, the celestial pillar may tilt and the Three Luminaries flee northward; the earthly chariot may fracture, and the hundred rivers rush eastward. The Yellow River submerged Yuejun, turning its towns into fish; the waters engulfed Liyang, transforming its officials into turtles. Inquiring after traces in the Gorge of Women, one finds only desolation in wind and rain; seeking past events at the Spring of the Aunt, one hears the bright strains of zither and song. Fullness and emptiness are never fixed; union and dispersal are ever constant.\n\nWho can fathom how Laozi, though aged, was moved by emotion and suddenly became human? Or how Jia Yi, though eloquent, gazed up and down, discerning only the causes of the hidden and manifest, tracing origins to ends, yet never exhausting the discourse on life and death? To gain the Dao and lose it—this is the inevitable pattern; to emerge from the mechanism and return to it—this is the unceasing principle. He who understands transformation—does he not know the workings of the divine?\n\nI have carefully examined the Qimu Temple: it is dedicated to the mother of Xia Hou Qi. During the Han Dynasty, to avoid the taboo of Emperor Jing’s name, the character *qi* (启) was replaced with *kai* (开), and later generations transmitted it as *Kaimu* (开母). Yet Gu Yewang’s *Records of Geography* and Lu Yuanming’s *Annals of Mount Songgao* failed to observe this taboo, instead regarding her as a woman of Yangdi, an account so unorthodox that a single reading offers no merit.\n\nConsider the jade dipper and the moving stars—Li Mu’s dwelling lay near the North Pole; the golden terrace and stone chamber—Wang Mu’s abode stood in the Western Mountains. Qi becomes mother, and all things sprout; the sun becomes mother, and its radiance illuminates all; the earth becomes mother, and above and below harmonize; the sovereign becomes mother, and the state achieves completion. Thus, Huaxu trod near and the Fuxi clan was conceived; Nü Deng perceived the divine, and the Yan dynasty arose; stars streamed over Hua Isle, and the White Emperor was born; the moon pierced the dark chamber, and the Black Essence descended.\n\nHow illustrious was the Xia dynasty! How reverent was Mount Kun! I wed at the hour of the earth’s division; the woman married at the land of Tai Sang. Searching the *Imperial Annals* for marvels and gleaning wonders from the *Guicang*, I bound reeds to dispel ignorance and found enlightenment, while Han Zi extolled virtue that never perished. The brush of Han ministers flowed like rivers and seas, recording her illustrious name; the single word of the Qin minister was worth a thousand gold, praising her auspicious response.\n\nSongs of the southern lands tell only of Hou Yu’s verses; the stone of the north finally revealed the omen of Sheng Yu. Thus, Guo Pu spoke of the Qimu Stone west of Yangcheng, and Li Tong of the Qimu Shrine south of Mount Song. The words of Suichao were verified, and the promises of *Huainanzi* proved unerring.\n\nOf old, on the banks of the Luanshui, a mother transformed into an empty mulberry; by the waters of Tun, a boy was born from split bamboo. The rainbow of the beauty was named *lalian*; the moon of the immortal woman became a toad. Jingwei carried twigs to avenge her grievance; the corpse of the woman turned to grass and became alluring. The mountains collapsed on the Shu Road, and the terrace awaited a wife who never returned; the stone stood in Wuchang, and the pavilion watched for a husband who never came.\n\nIn matters of birth and succession, none among the masses surpasses the emperors and kings; in matters of change and transformation, none among the common folk is renowned for such marvels. How splendid! Yet words fail to describe it.\n\nThe Great Tang cast off the old and embraced the new, arising with the mandate and continuing Heaven’s work. Grasping the primal force of Qian, it shaped all things, and the realm knew spring; cleaving the chaos to forge a domain, it left nothing beyond its bounds. The Heavenly Emperor received the calendar, his reign harmonizing with the pivot of time. Golden tablets and jade slabs recorded the achievements of Wen and Wu; thoroughfares and temples inherited the glorious deeds of ancestors. Clad in robes, he became the supreme sovereign, facing north in solemn dignity; bearing the auspicious tortoise, he received the feudal lords, turning southward in majesty.\n\nThe Zhou state flourished, its Dao harmonizing with Cheng and Kang; the Han house stood grand, its culture resonating with Wen and Jing. From the eastern shores to the western reaches, distant lands were pacified and near ones were awed. For three years, the seas remained calm; for months on end, clouds lingered undispersed. Heavenly omens descended; earthly portents ascended. The numinous phoenix, adorned with five patterns, came to the parks and gardens in due season; the divine dragon, marked with the eight trigrams, played in the ponds and marshes at dawn and dusk.\n\nWhat need was there for the courtesies of bowing and yielding? This was the true meaning of music—transforming customs and mores. The Controller of Fortune increased wealth, and households and states abounded; the Controller of Lifespans extended years, and subjects and people were spared early death. The enlightened king, ever mindful of three fears, never neglected caution; the Son of Heaven, surrounded by four neighbors, could not fully employ their harmonious counsel.\n\nHouseholds thrived in their occupations, heeding only the crowing of neighboring roosters; people lived in harmony, becoming like deer in the wild. Prognostications were inscribed, and the *Hetu* was presented—forty-six events were made manifest; how could one desire more? He ascended Mount Tai and performed the feng sacrifice on Liangfu—seventy-two seals were recognizable; what could surpass this?\n\nMoreover, to exhaust the divine and sagely, to perfect virtue and power, to nurture the primordial qi, and to inaugurate the Great Beginning—this was how the Heavenly Sovereign responded to Heaven. To honor the land and manifest the divine, to mount six feathers and ascend, to traverse the nine provinces and descend—this was how the Human Sovereign followed humanity. To create writing and teach hunting and fishing, to harmonize the five planets and regulate the four seasons, to ascend the nine heavens and categorize the myriad things—this was how the Sovereign Fuxi established human laws. To devote himself to cultivation and embrace change, to taste herbs to save the multitudes, to gather goods and exchange them across the realm—this was how the Sovereign Shennong promoted human benefit. To beat the Kui drum and raise the dragon banner, to receive the talisman from the Dark Maiden of Heaven and the Dipper from the Yellow Spirit—this was how the Sovereign Xuanyuan eradicated human harm.\n\nEqualizing measures and standardizing weights, rectifying capitals and cities—summoning autumn’s mandate under the Metal Heaven, apportioning auspicious offices through the Phoenix’s cycles—this was how Emperor Haoshi established the human standard.\n\nPurifying sacrifices and honoring the spirits, treading the seasons to emulate Heaven, nurturing wealth to employ Earth—this was how Emperor Zhuanxu instituted human teachings.\n\nAutumn riding horses, spring riding dragons, aligning with the Three Luminaries to balance Heaven’s Dao, establishing the Five Norms to order human affairs—this was how Emperor Xinshi governed humanity.\n\nRadiant as the sun, obscure as the shade, with no one knowing his name, the people asking, “What power has the emperor over us?”—this was how Emperor Yao illuminated sovereign virtue.\n\nHearing one good deed, elevating eight talents, the emperor’s song stirring the stars to brilliance, Heaven’s melody moving the tracks of birds and beasts—this was how Emperor Shun displayed the sovereign’s merit.\n\nThe Three Sequences are the greatness of the Dao, the Five Phases the origin of life. The Three Sovereigns modeled them to array the world, the Five Emperors followed them to bring order. The Dao arose through the Three, virtue stood through the Five—who but the utmost sage of the world could master both?\n\nYet even then, though blessed, they did not rest, diminishing further and further, issuing bright edicts, proclaiming virtuous decrees, revering Heaven and valuing humanity, inspecting the regions and conducting imperial tours. They summoned the stars in their courses, trailed the tips of clouds, called the Wind Earl to clear the dust, commanded the mountain spirits to guard the fields. Racing to Luoyi, galloping to Xiangcheng, Heaven turned and Earth wandered, clouds gathered and mists vanished. When King Mu of Zhou came to roam Mount Tai, he first visited the dwelling of Xia Qi; when Emperor Wu of Han performed rites at Songgao, he inquired after the stone of Sì Kāi.\n\nOne sees only that the cinnabar and azure of the years have grown ancient, frost and dew have eroded the passing years. The sagely heart stirs, and words arise to renovate. This mountain is the outer square of ancient script, this land the central realm of the new capital. The inscribed altar winds sinuously, obliquely dividing the Terrace of the Jade Maidens; stele towers and gate-turrets stand in mutual gaze, facing the shrine of the Stone Men.\n\nGolden grasses grow in five colors, cowrie trees bear triple blossoms. Purple clouds merge in the ravines, white mists swirl upon the peaks. Consulting the *Forest of Changes*, one confirms this is where the divine abide; seeking the *Divine Strategies*, one finds awe-inspiring numen undiminished.\n\nThus, the emperor commanded his officials to seize the moment, leveraging heights and lowlands, examining the remnants of crumbling foundations, surveying the sun and stars to assess the ruins of collapsed structures. The *Zhou Officials* set the plumb lines, the master craftsmen wielded their axes—with divine skill and wondrous motion, they preserved the mold of creation. Crimson blossoms outshone the sun, flying terraces soared between the mountains; iron chains braved the wind, winding galleries perched at the treetops. Immortals dwelled in the rafters, divine maidens leaned from the windows. The eaves were inlaid with tortoiseshell, the roofs covered with glass tiles. Vermilion jade paved the paths, yellow gold formed the gates and towers.\n\nThe mountains resembled white banks, the trees like green streams. Delicacies and herbs adorned the front courts, fresh hay lined the rear paths. Orchids’ fragrance flanked the waters, serving as ablution’s resource; bamboo brooms faced the wind, naturally warding off the harshness of dust and clamor. The Terrace of Dreams and Clouds and Rain—Song Yu gazed and was first startled; the Chu Jade Mountain—Qu Yuan wrote and nearly wearied.\n\nThe eaves of the Longevity Palace remained undisturbed, the symbolic figures stood even more solemn. Frost-silk trailed gracefully, lotus-patterned brocade draped loosely. Mandarin-duck mattresses, kingfisher quilts, white-feather fans, green-silk slippers. Jade orioles hung from their belts, seeming to move yet still; gold sparrows adorned their hairpins, neither long nor short.\n\nIn their dwellings, dim and dusky, yin closed and yang opened. In their attire, resplendent and luminous, clouds and dawn mingled in radiance. Tripods and platters held unicorn fetuses and phoenix eggs, black orchids burned fragrantly. Their feasts offered wood honey and golden paste, jade nectar and crystal wine.\n\nAt such times, the Five Peaks were united, the Nine Chiefs questioned, the Great Yin selected, the Dark Pass commanded. Feng Yi beat the drums, Nü Wa sang clearly. On the left, the Azure Dragon blew the curtain; on the right, the White Tiger strummed the zither. Golden immortals brushed the seats, jade maidens burned incense. With solemn rustling, the Heavenly Maidens brought wind and rain; in swirling snow and mist, divine ladies descended with frost and snow.\n\nPeacocks flew and phoenixes danced—Yong Yu sought joy; chariots met and silks were spread—Zhi Qiong attended the banquet. Ma Gu embraced the Dao, transforming the sea to come and roam; Shi Fu admired the wind, filling the river ford to descend and pay homage. The Luo Consort was graceful, the Jiang Consort ethereal. The Dark Maiden used the bright moon as her pearl, the Plain Maiden piled clouds into her hair. The True Mother of the Nine Heavens, the Ladies of the Eight Poles—all gathered here.\n\nClad in azure mist-garments and kingfisher-feather robes, the spirits coiled and lingered. Chariots turned with the wind, horses raced like lightning—glimpsed in an instant, then gone from sight.\n\nLong ago, at the foot of Mount Jiyin, the essence of Yao’s mother descended; by the bend of the Xiang River, the echo of Shun’s consort remained. Though the altar of Sui may still exist, one hears only the name of its divided blessings; though the halls may not have decayed, who can distinguish the place of the *An Song*? Yet who knew that this land of the Three Immortals’ blessed realm, this shrine revered by the hundred clans, nestled within the imperial capital’s domain, aligned with the sagely movements of the world? Sacrificial animals, jades, and silks could harmonize qi and unite with the spirits; young women and grandsons could unfold texts and engage in discourse. Reverently upholding the imperial decree, they displayed the grand spectacle. Though the people of Zhou composed poems extolling the beauty of their queens, and the ministers of Wei presented rhapsodies, they ultimately paled before the craft of the divine maidens.\n\nThus, I dare to inscribe this eulogy:\n\nThe Nine Provinces’ terrain is perilous,\nThe Five Peaks stand at Heaven’s center.\nDragons’ caves and grottoes,\nSun and moon’s immortal palaces.\nStoring and releasing clouds and mist,\nShaking and stirring thunder and wind.\nPipes and songs draw near,\nBells and drums echo afar.\n\nLong ago, under the mother of Gaoxin,\nHongquan’s spring had not yet been sealed.\nThe drowning people below,\nFlooded the Central Kingdom.\nHow glorious was Great Yu,\nManifesting Heaven’s true virtue!\nDragons’ designs branched forth,\nConch scripts were carved in haste.\nAdorning his robes, he tamed the seas,\nSurveying the lands to the south.\nReturning past Jieshi,\nHe descended again at Tai Sang.\n\nI took a wife with propriety, and our capital flourished.\nFor eight years I turned away, for four I let matters lie fallow.\nThen ascending Wanwei, I halted the work on the axle-pin.\nMy household, mistakenly setting forth, found the bear’s den already stirring.\nThe Dao of Heaven is dark and hidden, life’s course tangled and rough.\nYet transformation shifts, and numinous spirits find their abode.\nIn the palace of the Mysterious Consort, on the terrace of the Divine Maidens,\nAll things commune in resonance, and essences come and go.\nThe shrine on Mount Wu stands, the temple on the Han River opens.\nAncient altars endure through the years, while halls and roofs crumble with time.\n\nHow august is Great Tang, how radiant its divine sageliness!\nResponding to the chart and receiving the mandate, it embodies the origin and occupies the center.\nResplendent was Gaozu, for Heaven had decreed its charge.\nIllustrious was Taizong, whose glory reached its zenith here.\nSuccessive brilliance and repeated blessings, the martial line inherits culture.\nBearing the imperial regalia, it transforms; draped in robes, it rules.\nThe Three Spirits harmonize in sweetness, the Six Qi blend in mist.\nFish and turtles all submit, phoenixes and hounds call to one another.\nDistant envoys seek audience, foreign lands receive the calendar.\nTransformation extends through sincerity, and the great simplicity’s winds shift.\nHeaven ordains the hundred rites—people harmonize, the myriad joys arise.\nThe Fen River may be traversed, but Kunlun’s peaks remain remote.\nThe old tales of Suiren, the former dwellings of Xia Qi—\nTheir great virtue never fades, their fine renown lives on in the bamboo annals.\nThe Zhou king turned his chariot, the Han emperor returned his carriage.\nEver mindful of descending to inspect, their sacrifices remained as before.\nForestry officials oversaw the timber, craftsmen repaired the halls.\nRainbows spanned the plum-wood beams, dragons coiled round the cassia pillars.\nGrasses overgrew the courtyards, waters encircled the hall’s steps.\nThe stone chambers were peerless, the pavilions and palaces stood in support.\nPearl curtains rolled open like caves, the jade throne held purity within.\nGold and kingfisher gleamed, silk and valleys shimmered lightly.\nForms seemed to stir, attendants and guards appeared to come to life.\nSomething lingered in the glow, while prayers and invocations fell silent.\n\nThe Emperor’s daughter by the Xiang River, the Celestial Granddaughter by the Han’s banks—\nFlitting and floating, hesitating and lingering.\nThe Divine Maiden plays with pearls, the Numinous Consort opens jade.\nSuddenly they come, suddenly they go, swift as shooting stars or lightning’s flash.\nHow magnificent, how splendid—may the spirits heed this!\nWisdom and clarity are entrusted to them, and glorious blessings never deceive.\n\nThe lady established the hall, the young woman inscribed the words.\nMajestic is the imperial house, its foundations ten thousand times ten thousand.\nHere ends the brick inscription of Tang’s Songgao Mountain Qimu Temple.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "唐嵩高山启母庙碑铭 经名：唐嵩高山启母庙砖铭。 唐崔融撰。 一篇。 底本出处：《正统道藏》洞神部记传类。 唐嵩高山启母庙碑铭并序 登仕郎崇文馆直学士臣崔融奉劲撰 臣闻天地生成，其法自然之谓道，阴阳鼓舞，其功不测之谓神。 然则物或类感，事因通变，乾栋倾而三光北驰，坤舆缺而百川东泻，河沦越隽，有郡邑之为鱼，水陷历阳，有吏人之化鳌。 访遗踪於女峡，风雨萧条，征往事於姑泉，弦歌响亮。 盈虚靡定，合散焉常。 不知谁子既老氏之多情，忽然为人，宁贾生之足辩，仰观俯察，裁识幽明之故，原始反终，未穷死生之说。 得於道而失於道，义有必然，出於机而入於机，理无或废。 知变化者，其知神之所为乎？ 臣谨按启母庙者，盖夏后启之母也，汉避景帝讳，启之字日开，厥后相传，或为开母。 而顾野王《舆地志》、卢元明《嵩高纪》并不寻避讳之旨，以为阳翟妇人，事不经见，一讽无所取。 粤若玉斗游玑，李母之居邻北极，金台石室，王母之宅在西山。 气为母则群物以萌，日为母则容光必照，坤为母则上下交泰，后为母则邦家有成。 故华胥履迩而雄氏孕，女登感神而炎运作，星流华渚而白帝生，月贯幽房而黑精降。 明明有夏，穆穆盒山，予娶於度土之辰，女婚於台桑之地，搜奇帝纪，摭异归藏，束生发蒙而有迷，韩子称贤而不朽，汉臣之笔墨泉海，陈其令名，秦相之一字千金，叔其嘉应。 士歌南国，徒闻候禹之词，石破北方，终见生余之兆，则郭璞所谓阳城西启母石，李彤所谓嵩山南启母祠，随巢之说有征，鸿烈之言无爽者矣。 昔者鸾川之上，母变空桑，豚水之滨，男生破竹，美人之虹名蜡炼，仙妇之月作蟾蛛，精卫衔木而偿冤，女尸化草而成媚，山崩蜀道，台候妇而无归，石立武昌，亭望夫而不及。 论乎诞载，群下莫尊於帝王，语乎迁易，凡百无闻於感致，美矣哉，不可得而称也。 大唐革去故，鼎取新，与运而生，继天而作，握乾元而造物，海内知春，辟混沌而为家，域中无外。 天皇膺历，数顺枢歌，金匮玉板，服文武之能事，衢室庙堂，承祖宗之茂烈，垂衣裳而作元后，端拱北辰，负龄辰而朝诸侯，向明南面，周邦赫赫，其道洽於成康，汉室巍巍，其化锺於文景，束渐西被，远安迩肃，海三年而无波，云连月而不散。 天瑞降，地符升，灵凤五文，岁时来苑囿，神龙八卦，昏旦游池沼。 礼云乎哉，无取於周旋揖让，乐之谓也，必在於移风易俗。 司禄益富，家国於是乎有余，司命益年，臣人於是乎不天。 明王三惧，未尝遗戒慎之心，天子四邻，莫能展弼谐之用。 家安其业，但听於邻鸡。 人得其和，遂同於野鹿。 表谶记，奏河图，四十六事之着明，曷云尚也，登太山，禅梁甫，七十二封之可识，何以加乎。 且夫穷圣神，备道德，滋萌元气，开辟太初，斯乃天皇氏之所以应乎天也。 依土地，明神灵，驾六羽而上腾，度九州而下济，斯乃人皇氏之所以顺乎人也。 造书契，教畋渔，合五纬而节四时，登九天而类万物，斯乃牺皇氏之所以制人法也。 务播殖，该变通，尝药以救兆人，聚货而交天下，斯乃农皇氏之所以兴人利也。 振夔鼓，载龙旗，天则玄女授符，帝则黄神降斗，期乃轩辕氏之所以除人害也。",
      "translated_text": "**Inscription on the Stele of the Qimu Temple at Mount Songgao in the Tang Dynasty**\n\n*Composed by Cui Rong, Gentleman for Court Service and Academician of the Hongwen Pavilion*\n\nI have heard that the generation and completion of Heaven and Earth follow the principle of spontaneity, which is called the Dao; the interplay of yin and yang, whose workings are unfathomable, is called the divine. Thus, when things resonate by kind, and affairs transform through correspondence, the celestial pillar may tilt and the Three Luminaries flee northward; the earthly chariot may fracture, and the hundred rivers rush eastward. The Yellow River submerged Yuejun, turning its towns into fish; the waters engulfed Liyang, transforming its officials into turtles. Inquiring after traces in the Gorge of Women, one finds only desolation in wind and rain; seeking past events at the Spring of the Aunt, one hears the bright strains of zither and song. Fullness and emptiness are never fixed; union and dispersal are ever constant.\n\nWho can fathom how Laozi, though aged, was moved by emotion and suddenly became human? Or how Jia Yi, though eloquent, gazed up and down, discerning only the causes of the hidden and manifest, tracing origins to ends, yet never exhausting the discourse on life and death? To gain the Dao and lose it—this is the inevitable pattern; to emerge from the mechanism and return to it—this is the unceasing principle. He who understands transformation—does he not know the workings of the divine?\n\nI have carefully examined the Qimu Temple: it is dedicated to the mother of Xia Hou Qi. During the Han Dynasty, to avoid the taboo of Emperor Jing’s name, the character *qi* (启) was replaced with *kai* (开), and later generations transmitted it as *Kaimu* (开母). Yet Gu Yewang’s *Records of Geography* and Lu Yuanming’s *Annals of Mount Songgao* failed to observe this taboo, instead regarding her as a woman of Yangdi, an account so unorthodox that a single reading offers no merit.\n\nConsider the jade dipper and the moving stars—Li Mu’s dwelling lay near the North Pole; the golden terrace and stone chamber—Wang Mu’s abode stood in the Western Mountains. Qi becomes mother, and all things sprout; the sun becomes mother, and its radiance illuminates all; the earth becomes mother, and above and below harmonize; the sovereign becomes mother, and the state achieves completion. Thus, Huaxu trod near and the Fuxi clan was conceived; Nü Deng perceived the divine, and the Yan dynasty arose; stars streamed over Hua Isle, and the White Emperor was born; the moon pierced the dark chamber, and the Black Essence descended.\n\nHow illustrious was the Xia dynasty! How reverent was Mount Kun! I wed at the hour of the earth’s division; the woman married at the land of Tai Sang. Searching the *Imperial Annals* for marvels and gleaning wonders from the *Guicang*, I bound reeds to dispel ignorance and found enlightenment, while Han Zi extolled virtue that never perished. The brush of Han ministers flowed like rivers and seas, recording her illustrious name; the single word of the Qin minister was worth a thousand gold, praising her auspicious response.\n\nSongs of the southern lands tell only of Hou Yu’s verses; the stone of the north finally revealed the omen of Sheng Yu. Thus, Guo Pu spoke of the Qimu Stone west of Yangcheng, and Li Tong of the Qimu Shrine south of Mount Song. The words of Suichao were verified, and the promises of *Huainanzi* proved unerring.\n\nOf old, on the banks of the Luanshui, a mother transformed into an empty mulberry; by the waters of Tun, a boy was born from split bamboo. The rainbow of the beauty was named *lalian*; the moon of the immortal woman became a toad. Jingwei carried twigs to avenge her grievance; the corpse of the woman turned to grass and became alluring. The mountains collapsed on the Shu Road, and the terrace awaited a wife who never returned; the stone stood in Wuchang, and the pavilion watched for a husband who never came.\n\nIn matters of birth and succession, none among the masses surpasses the emperors and kings; in matters of change and transformation, none among the common folk is renowned for such marvels. How splendid! Yet words fail to describe it.\n\nThe Great Tang cast off the old and embraced the new, arising with the mandate and continuing Heaven’s work. Grasping the primal force of Qian, it shaped all things, and the realm knew spring; cleaving the chaos to forge a domain, it left nothing beyond its bounds. The Heavenly Emperor received the calendar, his reign harmonizing with the pivot of time. Golden tablets and jade slabs recorded the achievements of Wen and Wu; thoroughfares and temples inherited the glorious deeds of ancestors. Clad in robes, he became the supreme sovereign, facing north in solemn dignity; bearing the auspicious tortoise, he received the feudal lords, turning southward in majesty.\n\nThe Zhou state flourished, its Dao harmonizing with Cheng and Kang; the Han house stood grand, its culture resonating with Wen and Jing. From the eastern shores to the western reaches, distant lands were pacified and near ones were awed. For three years, the seas remained calm; for months on end, clouds lingered undispersed. Heavenly omens descended; earthly portents ascended. The numinous phoenix, adorned with five patterns, came to the parks and gardens in due season; the divine dragon, marked with the eight trigrams, played in the ponds and marshes at dawn and dusk.\n\nWhat need was there for the courtesies of bowing and yielding? This was the true meaning of music—transforming customs and mores. The Controller of Fortune increased wealth, and households and states abounded; the Controller of Lifespans extended years, and subjects and people were spared early death. The enlightened king, ever mindful of three fears, never neglected caution; the Son of Heaven, surrounded by four neighbors, could not fully employ their harmonious counsel.\n\nHouseholds thrived in their occupations, heeding only the crowing of neighboring roosters; people lived in harmony, becoming like deer in the wild. Prognostications were inscribed, and the *Hetu* was presented—forty-six events were made manifest; how could one desire more? He ascended Mount Tai and performed the feng sacrifice on Liangfu—seventy-two seals were recognizable; what could surpass this?\n\nMoreover, to exhaust the divine and sagely, to perfect virtue and power, to nurture the primordial qi, and to inaugurate the Great Beginning—this was how the Heavenly Sovereign responded to Heaven. To honor the land and manifest the divine, to mount six feathers and ascend, to traverse the nine provinces and descend—this was how the Human Sovereign followed humanity. To create writing and teach hunting and fishing, to harmonize the five planets and regulate the four seasons, to ascend the nine heavens and categorize the myriad things—this was how the Sovereign Fuxi established human laws. To devote himself to cultivation and embrace change, to taste herbs to save the multitudes, to gather goods and exchange them across the realm—this was how the Sovereign Shennong promoted human benefit. To beat the Kui drum and raise the dragon banner, to receive the talisman from the Dark Maiden of Heaven and the Dipper from the Yellow Spirit—this was how the Sovereign Xuanyuan eradicated human harm.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1226,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.933249950408936,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\唐嵩高山启母庙碑铭.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "均度量，正都邑．’总秋令於金天，分瑞官於凤纪，斯乃帝昊氏之所以为人极也。 洁祭祀，义鬼神，履时以象天，养财以任地，斯乃帝顼氏之所以为人教也。 秋乘马，春乘龙，顺三辰而天道平，建五正而人事理，斯乃帝辛氏之所以为人政也。 明如日，晦如阴，人无识其名，帝何力於我，斯乃帝尧氏之所以昭君德也。 闻一善，举八才，帝唱动而烂星云，天歌发而迹乌兽，斯乃帝舜氏之所以章后功也。 夫三统者，道之大，五行者，生之宗，三皇法之而列，五帝则之而序，道以三兴，德以五立，非天下之至圣，孰能兼於此乎。 而犹虽休勿休，．损之又损，下明诏，发德音，尊天而重人，省方而巡狩，举星毕，曳云梢，召风伯以清尘，命山灵而护野，驰洛邑，骛襄城，天回而地游，云合而雾杳，周穆王来游太室，先征夏启之居； 汉武帝有事嵩高，即访姒开之石。 徒观其丹青岁古，霜露年侵，圣情有蜷，兴言改茸，其山则古文之外方，其地则新邑之中土，铭坛逦迤，斜分玉女之台，碑阙相望，近对石人之庙。 金草生而五色，贝树长而三花，紫云合杳於溪涧，白雾氛氲於岩岭，考之易林，信惟神明所伏，求之遁甲，固以威灵肃然。 夫其命有司乘务隙，因高背下，察隐磷之余基，审日观星，揆摧残之落构，周官置臬，郢匠挥斤，异态神行，全模造化，红葩夺日，飞累榭於山问，锜缀冲风，架回廊於木末，仙人在栋，神女临窗，周施玳瑁之橡，褊覆瑁璃之瓦，赤玉为阶道，黄金作门阙。 山如白岸，树似青溪，羞蕴藻於前庭，藉生刍於后径，兰香夹水，居然洗沐之资，竹帚临风，自隔嚣尘之惨，梦台云雨，宋玉对而先惊，楚璧山）ll ，屈原书而几倦。 寿官檐兮不扰，象设安兮逾肃，霜罗曳曳，蕾买锦披披，鸳鸯褥兮翡翠祷，白羽扇兮青丝履，垂玉鸾之佩，若往而若还，戴金雀之钗，不长而不短。 其居处也，暧暧昧昧，阴闭阳开； 其被服也，煌煌荧荧，霞驳云蔚。 鼎俎则麟胎凤卵，黑蕙然莫，饵膳则木蜜金膏，玉浆琼酒。 当是时也，合五岳，讯九魁，选太阴，命玄关，冯夷呜鼓，女娲清歌，左苍龙兮吹帘，右白虎兮维瑟，金真拂座，玉女焚香，肃肃习习天媛来风雨，雾雪霏霏，神姬下霜雪。 孔雀飞而仪凤舞，弄玉邀欢，饼车合而罗绮陈，智琼陪宴，麻姑服道，变海水而来游，识妇希风，填河津而下谒，洛妃绰约，江妃绵眇，玄女以明月为珠，素女以积云作髻，九天真母，八极夫人，毕集於兹矣。 青霞衣兮翠云裘，灵连蜷兮既留，车回风兮马飞电，视倏忽兮无见。 昔者，济阴山下降尧母之精灵，湘川水曲留舜妃之响像，随坛或在，徒闻分福之名，栋宇不修，谁辩安歌之处，岂知夫三仙福地，百姓尊祠，挟王者之都畿，当圣人之顺动，牺牲玉帛，可以洽气和神，幼妇外孙，可以披文相质，虔奉纶旨，式陈壮观，虽周人作诗，自得后妃之美，而魏臣献赋，终惭神女之工。 敢作铭日： 九州地险，五岳天中。 蛟龙洞穴，日月仙宫。 蓄泄云雾，震荡雷风。 笙歌近接，钟鼓遥通。 昔在妈帝，鸿泉未塞。 昏垫下人，泛滥中国。 於铄大禹，显允天德。 龙画旁分，螺书褊刻。 佩文壮海，省土南方。 还从碣石，更下台桑。",
      "translated_text": "Equalizing measures and standardizing weights, rectifying capitals and cities—summoning autumn’s mandate under the Metal Heaven, apportioning auspicious offices through the Phoenix’s cycles—this was how Emperor Haoshi established the human standard.\n\nPurifying sacrifices and honoring the spirits, treading the seasons to emulate Heaven, nurturing wealth to employ Earth—this was how Emperor Zhuanxu instituted human teachings.\n\nAutumn riding horses, spring riding dragons, aligning with the Three Luminaries to balance Heaven’s Dao, establishing the Five Norms to order human affairs—this was how Emperor Xinshi governed humanity.\n\nRadiant as the sun, obscure as the shade, with no one knowing his name, the people asking, “What power has the emperor over us?”—this was how Emperor Yao illuminated sovereign virtue.\n\nHearing one good deed, elevating eight talents, the emperor’s song stirring the stars to brilliance, Heaven’s melody moving the tracks of birds and beasts—this was how Emperor Shun displayed the sovereign’s merit.\n\nThe Three Sequences are the greatness of the Dao, the Five Phases the origin of life. The Three Sovereigns modeled them to array the world, the Five Emperors followed them to bring order. The Dao arose through the Three, virtue stood through the Five—who but the utmost sage of the world could master both?\n\nYet even then, though blessed, they did not rest, diminishing further and further, issuing bright edicts, proclaiming virtuous decrees, revering Heaven and valuing humanity, inspecting the regions and conducting imperial tours. They summoned the stars in their courses, trailed the tips of clouds, called the Wind Earl to clear the dust, commanded the mountain spirits to guard the fields. Racing to Luoyi, galloping to Xiangcheng, Heaven turned and Earth wandered, clouds gathered and mists vanished. When King Mu of Zhou came to roam Mount Tai, he first visited the dwelling of Xia Qi; when Emperor Wu of Han performed rites at Songgao, he inquired after the stone of Sì Kāi.\n\nOne sees only that the cinnabar and azure of the years have grown ancient, frost and dew have eroded the passing years. The sagely heart stirs, and words arise to renovate. This mountain is the outer square of ancient script, this land the central realm of the new capital. The inscribed altar winds sinuously, obliquely dividing the Terrace of the Jade Maidens; stele towers and gate-turrets stand in mutual gaze, facing the shrine of the Stone Men.\n\nGolden grasses grow in five colors, cowrie trees bear triple blossoms. Purple clouds merge in the ravines, white mists swirl upon the peaks. Consulting the *Forest of Changes*, one confirms this is where the divine abide; seeking the *Divine Strategies*, one finds awe-inspiring numen undiminished.\n\nThus, the emperor commanded his officials to seize the moment, leveraging heights and lowlands, examining the remnants of crumbling foundations, surveying the sun and stars to assess the ruins of collapsed structures. The *Zhou Officials* set the plumb lines, the master craftsmen wielded their axes—with divine skill and wondrous motion, they preserved the mold of creation. Crimson blossoms outshone the sun, flying terraces soared between the mountains; iron chains braved the wind, winding galleries perched at the treetops. Immortals dwelled in the rafters, divine maidens leaned from the windows. The eaves were inlaid with tortoiseshell, the roofs covered with glass tiles. Vermilion jade paved the paths, yellow gold formed the gates and towers.\n\nThe mountains resembled white banks, the trees like green streams. Delicacies and herbs adorned the front courts, fresh hay lined the rear paths. Orchids’ fragrance flanked the waters, serving as ablution’s resource; bamboo brooms faced the wind, naturally warding off the harshness of dust and clamor. The Terrace of Dreams and Clouds and Rain—Song Yu gazed and was first startled; the Chu Jade Mountain—Qu Yuan wrote and nearly wearied.\n\nThe eaves of the Longevity Palace remained undisturbed, the symbolic figures stood even more solemn. Frost-silk trailed gracefully, lotus-patterned brocade draped loosely. Mandarin-duck mattresses, kingfisher quilts, white-feather fans, green-silk slippers. Jade orioles hung from their belts, seeming to move yet still; gold sparrows adorned their hairpins, neither long nor short.\n\nIn their dwellings, dim and dusky, yin closed and yang opened. In their attire, resplendent and luminous, clouds and dawn mingled in radiance. Tripods and platters held unicorn fetuses and phoenix eggs, black orchids burned fragrantly. Their feasts offered wood honey and golden paste, jade nectar and crystal wine.\n\nAt such times, the Five Peaks were united, the Nine Chiefs questioned, the Great Yin selected, the Dark Pass commanded. Feng Yi beat the drums, Nü Wa sang clearly. On the left, the Azure Dragon blew the curtain; on the right, the White Tiger strummed the zither. Golden immortals brushed the seats, jade maidens burned incense. With solemn rustling, the Heavenly Maidens brought wind and rain; in swirling snow and mist, divine ladies descended with frost and snow.\n\nPeacocks flew and phoenixes danced—Yong Yu sought joy; chariots met and silks were spread—Zhi Qiong attended the banquet. Ma Gu embraced the Dao, transforming the sea to come and roam; Shi Fu admired the wind, filling the river ford to descend and pay homage. The Luo Consort was graceful, the Jiang Consort ethereal. The Dark Maiden used the bright moon as her pearl, the Plain Maiden piled clouds into her hair. The True Mother of the Nine Heavens, the Ladies of the Eight Poles—all gathered here.\n\nClad in azure mist-garments and kingfisher-feather robes, the spirits coiled and lingered. Chariots turned with the wind, horses raced like lightning—glimpsed in an instant, then gone from sight.\n\nLong ago, at the foot of Mount Jiyin, the essence of Yao’s mother descended; by the bend of the Xiang River, the echo of Shun’s consort remained. Though the altar of Sui may still exist, one hears only the name of its divided blessings; though the halls may not have decayed, who can distinguish the place of the *An Song*? Yet who knew that this land of the Three Immortals’ blessed realm, this shrine revered by the hundred clans, nestled within the imperial capital’s domain, aligned with the sagely movements of the world? Sacrificial animals, jades, and silks could harmonize qi and unite with the spirits; young women and grandsons could unfold texts and engage in discourse. Reverently upholding the imperial decree, they displayed the grand spectacle. Though the people of Zhou composed poems extolling the beauty of their queens, and the ministers of Wei presented rhapsodies, they ultimately paled before the craft of the divine maidens.\n\nThus, I dare to inscribe this eulogy:\n\nThe Nine Provinces’ terrain is perilous,\nThe Five Peaks stand at Heaven’s center.\nDragons’ caves and grottoes,\nSun and moon’s immortal palaces.\nStoring and releasing clouds and mist,\nShaking and stirring thunder and wind.\nPipes and songs draw near,\nBells and drums echo afar.\n\nLong ago, under the mother of Gaoxin,\nHongquan’s spring had not yet been sealed.\nThe drowning people below,\nFlooded the Central Kingdom.\nHow glorious was Great Yu,\nManifesting Heaven’s true virtue!\nDragons’ designs branched forth,\nConch scripts were carved in haste.\nAdorning his robes, he tamed the seas,\nSurveying the lands to the south.\nReturning past Jieshi,\nHe descended again at Tai Sang.",
      "overlap_context": "eavens and categorize the myriad things—this was how the Sovereign Fuxi established human laws. To devote himself to cultivation and embrace change, to taste herbs to save the multitudes, to gather goods and exchange them across the realm—this was how the Sovereign Shennong promoted human benefit. To beat the Kui drum and raise the dragon banner, to receive the talisman from the Dark Maiden of Heaven and the Dipper from the Yellow Spirit—this was how the Sovereign Xuanyuan eradicated human harm.",
      "start_char": 1226,
      "end_char": 2432,
      "start_sentence": 37,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.94229745864868,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\唐嵩高山启母庙碑铭.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "予娶有礼，我都攸昌。 八年不顾，四载惟荒。 宛委既登，辑辕伫凿。 家室误往，熊熊方作。 天道幽秘，生涯扎错。 其化则迁，其灵是托。 玄妃之馆，仙女之台。 物类通感，精魂去来。 巫山庙立，汉水祠开。 遗坛岁古，栋宇年摧。 皇矣大唐，丽哉神圣。 应图受线，体元居正。 赫赫高祖，天有成命。 明明太宗，於兹为盛。 重光累洽，下武嗣文。 负宸而化，垂衣以君。 三灵肝蜜，六气氤氲。 鱼鳌咸若，鹦犬相闻。 重译请命，殊邻禀朔。 化及中孚，风移大朴。 天秩百礼－’人和万乐。 汾水可游，昆山何邈。 随巢旧说，夏启遗居。 盛德不泯，嘉声在诸。 周王转跸，汉帝回舆。 聿怀降鉴，其杞如．初。 虞衡掌木，班捶茸宇。 虹亘梅梁，龙盘桂柱。 草积庭援，水周堂麻。 石室罕俦，轩官为辅。 珠帘洞卷，玉座含清。 金翠的砾，罗谷轻明。 仪形若动，侍卫疑生。 依烯有物，徽祝无声。 帝子湘川，天孙汉曲。 翩绵缥缈，踌躇蹲躅。 神女弄珠，灵妃启玉。 倏来忽往，星繁电烛。 壮矣丽矣，神之听之。 聪明是属，景福无欺。 夫人立馆，幼妇镌辞。 巍巍皇室，万万余基。 唐嵩高山启母庙砖铭竟",
      "translated_text": "I took a wife with propriety, and our capital flourished.\nFor eight years I turned away, for four I let matters lie fallow.\nThen ascending Wanwei, I halted the work on the axle-pin.\nMy household, mistakenly setting forth, found the bear’s den already stirring.\nThe Dao of Heaven is dark and hidden, life’s course tangled and rough.\nYet transformation shifts, and numinous spirits find their abode.\nIn the palace of the Mysterious Consort, on the terrace of the Divine Maidens,\nAll things commune in resonance, and essences come and go.\nThe shrine on Mount Wu stands, the temple on the Han River opens.\nAncient altars endure through the years, while halls and roofs crumble with time.\n\nHow august is Great Tang, how radiant its divine sageliness!\nResponding to the chart and receiving the mandate, it embodies the origin and occupies the center.\nResplendent was Gaozu, for Heaven had decreed its charge.\nIllustrious was Taizong, whose glory reached its zenith here.\nSuccessive brilliance and repeated blessings, the martial line inherits culture.\nBearing the imperial regalia, it transforms; draped in robes, it rules.\nThe Three Spirits harmonize in sweetness, the Six Qi blend in mist.\nFish and turtles all submit, phoenixes and hounds call to one another.\nDistant envoys seek audience, foreign lands receive the calendar.\nTransformation extends through sincerity, and the great simplicity’s winds shift.\nHeaven ordains the hundred rites—people harmonize, the myriad joys arise.\nThe Fen River may be traversed, but Kunlun’s peaks remain remote.\nThe old tales of Suiren, the former dwellings of Xia Qi—\nTheir great virtue never fades, their fine renown lives on in the bamboo annals.\nThe Zhou king turned his chariot, the Han emperor returned his carriage.\nEver mindful of descending to inspect, their sacrifices remained as before.\nForestry officials oversaw the timber, craftsmen repaired the halls.\nRainbows spanned the plum-wood beams, dragons coiled round the cassia pillars.\nGrasses overgrew the courtyards, waters encircled the hall’s steps.\nThe stone chambers were peerless, the pavilions and palaces stood in support.\nPearl curtains rolled open like caves, the jade throne held purity within.\nGold and kingfisher gleamed, silk and valleys shimmered lightly.\nForms seemed to stir, attendants and guards appeared to come to life.\nSomething lingered in the glow, while prayers and invocations fell silent.\n\nThe Emperor’s daughter by the Xiang River, the Celestial Granddaughter by the Han’s banks—\nFlitting and floating, hesitating and lingering.\nThe Divine Maiden plays with pearls, the Numinous Consort opens jade.\nSuddenly they come, suddenly they go, swift as shooting stars or lightning’s flash.\nHow magnificent, how splendid—may the spirits heed this!\nWisdom and clarity are entrusted to them, and glorious blessings never deceive.\n\nThe lady established the hall, the young woman inscribed the words.\nMajestic is the imperial house, its foundations ten thousand times ten thousand.\nHere ends the brick inscription of Tang’s Songgao Mountain Qimu Temple.",
      "overlap_context": "s and mist,\nShaking and stirring thunder and wind.\nPipes and songs draw near,\nBells and drums echo afar.\n\nLong ago, under the mother of Gaoxin,\nHongquan’s spring had not yet been sealed.\nThe drowning people below,\nFlooded the Central Kingdom.\nHow glorious was Great Yu,\nManifesting Heaven’s true virtue!\nDragons’ designs branched forth,\nConch scripts were carved in haste.\nAdorning his robes, he tamed the seas,\nSurveying the lands to the south.\nReturning past Jieshi,\nHe descended again at Tai Sang.",
      "start_char": 2432,
      "end_char": 2868,
      "start_sentence": 68,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.040927171707153,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\唐嵩高山启母庙碑铭.txt",
        "category": "记传类"
      }
    }
  ]
}