{
  "source_id": "唐王屋山中岩台正一先生庙碣",
  "source_file": "chunked_daozang\\唐王屋山中岩台正一先生庙碣.json",
  "total_chunks": 3,
  "total_original_chars": 2025,
  "total_translated_chars": 13348,
  "total_translation_time": 69.2483868598938,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\唐王屋山中岩台正一先生庙碣.txt",
    "category": "记传类"
  },
  "full_translation": "**Stele Inscription for Master Zhengyi of Zhongyan Terrace on Wangwu Mountain of the Tang Dynasty**\n\n*Title:* Stele Inscription for Master Zhengyi of Zhongyan Terrace on Wangwu Mountain of the Tang Dynasty\n*Author:* Wei Qian of the Tang Dynasty\n*Source:* *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section under the *Dongshen* Department\n\n**Stele Inscription for Master Zhengyi of Zhongyan Terrace on Wangwu Mountain of the Tang Dynasty**\n*Composed by Wei Yantan, Recorder of the Left Guard of the Imperial Insignia*\n\nThe so-called \"immortals of the ranks\" in antiquity grasped the Great Completion to govern the natural, roamed the boundless to attain deathlessness, traversed the myriad wonders to ascend to the Great Origin. Their traces emerged from the Mysterious Origin, were perfected by the Celestial Master, and fully expounded in the Simplicity and Tranquility, detailed in the *Zhenbai*.\n\nThose who attained the Dao of *Zhenbai* ascended daily into the Mystery; the Mystery was transmitted to the Embodiment of the Mystery. Since the Three Perfected dwelled in heaven, the multitude of teachings lacked a master. The handle of the Dao’s governance must fall to someone.\n\nDid Heaven appoint Perfected Master Sima as its wooden clapper? If not, how could the numinous tally of the Mystery so swiftly align? The revered master’s clan bore the surname Sima, dwelling for generations in Wen and Jin of Pengcheng. Descended from the royal house of Wang, he was the grandson of the attendant to the military governor of Chen, and the son of Ren Zui, the two successive prefects of Xiang and Hua in our imperial dynasty.\n\nThe illustrious lineage of the Yellow Emperor and Elijah spans generations—this is called a noble succession. When loyal worthies emerge in succession, extraordinary individuals must arise. Thus, Master Zi’a’s kindness and wisdom, like that of Xu the Perfected in his descent, and his early cultivation of compassion, akin to Lord Mao’s ascent to the Dao, were not without cause.\n\nThe master’s religious name was *Daoyin*, his courtesy name *Ziwei*, and his Dharma name *Dao Yin*. Born speaking, he understood the Dao in childhood. Heaven bestowed upon him an extraordinary countenance and the true nature of an immortal—this was the great essence of age and vigor. Drawing it forth, it became the inner learning of Yang and Xu; silently preserving it, he purified his conduct, elevated his virtue, and his understanding penetrated the subtlest mysteries. His thoughts entered the utmost emptiness, and critics said his unseen wings could not be bent to worldly ends.\n\nAt twenty-one, he first donned the hempen cap and robe to enter the Dao, becoming a disciple of Master *Tixuan*, a recluse of the Central Marchmount. The revered master’s spirit was concentrated and his use serene; his emotions were sifted and affairs discarded. His integrity was unassailable, his diligence tireless. Master *Tixuan* thus regarded him with profound esteem.\n\nOne day, he transmitted to our revered master the *Golden Root Upper Scripture*, the *Secret Records of the Three Caverns*, the deeds of Xu the Perfected, and the subtle principles of Master Tao. With lofty comprehension and unique attainment, the master’s emptiness merged with the great penetration. He elucidated the true Dao, moving in and out of the profound mysteries.\n\nOnce, he dreamed of a phoenix and crow bearing a seal, placing it upon his Dharma table. The inscription read: *\"Conferred upon you as the Perfected of the Upper Clarity of Eastern Florescence.\"* Thereafter, he treasured his longevity, refined his conduct, listened to the *qi*, and rested in the heels. After seven days, he transcended external things; after three months, he forgot his form; after a year, he roamed in non-being.\n\nMoreover, he chiseled paths to conceal his hidden traces—not to respond to things; he sang wildly to cultivate his inner practice—not to teach others; he displayed wondrous arts to dazzle the foolish—not to preserve the true.\n\nHe reclined in lowly positions to conceal his bearing—not to transcend the world. Thus, the Venerable Master devoted himself to propagating the Dao without hindering its function, ever excelling in salvation without settling in one place. He entered the imperial court to pay homage to the sagely sovereign, where the nine-fold gates received him with the reverence due to Guangcheng; he emerged to respond to the worthy of the age, as the assembled lords vied to seek his counsel. Therefore, his conduct knew no bounds, his deeds left no trace; he received with emptiness to achieve all obliquely, illumined widely to animate the ten thousand things.\n\nAt times, external omens stirred his movements; at others, inner discipline sealed his gates. Sometimes he dwelt in seclusion, secretly consorting with the host of Perfected; sometimes he ascended in darkness, stealthily traversing the upper realms—such was his unfathomable depth. Later, he wandered Mount Juqu, pacing the heavens of Huayang; he roosted in the paulownia and wutong groves, entering the cavern of Lingxu. He sought the great Mount Huo, gathering the fruit of the Golden Vase; he ascended Mount Heng, peering into the mysteries of Stone Rub. There, mountain spirits offered herbs, Heavenly Perfected bestowed scriptures, fierce beasts guarded the gates, and wild birds circled his seat—such wonders defy full recounting.\n\nIn the twelfth year of the Kaiyuan era, the Son of Heaven, in his enlightened court, sought to commune with the myriad spirits. He set forth his carriage upon the Fen River, summoning the Four Masters, and thus invited the Venerable Master into the inner palace to receive the scriptures and methods of the Upper Clarity. Moreover, he established the Yangtai Abbey on Mount Wangwu as his residence. The Master, deeming Wangwu the heaven of Xiaoyou, the palace of the assembled Perfected, a place of secluded majesty where gods and spirits gathered in splendor, thought: *\"If the Dao is to be practiced, where could it not thrive?\"* With a turn of flight and a step taken, he resolved to make it his final abode.\n\nFurther, at the northwest height of the abbey, where the terrain reached its utmost extremity, he discovered the Central Rock Terrace. Above, it aligned with the Great Altar; below, it encircled the great mound. Mighty trees embraced it in a ring, while the murmuring streams of the Luo and the central valleys resounded. There, he nurtured dragons in the great ravines and reared cranes upon the central peaks. He burned the myriad incenses of the Golden Grotto and inhaled the fresh *qi* of the Stone Window—thus did he pass his days.\n\nEarlier, while dwelling in seclusion, he had transcribed and compiled Daoist texts, producing the *Hidden Instructions for Ascending Perfection*. Yet many methods of cultivation therein remained fragmentary. The Venerable Master thus composed the *Secret Essentials of Cultivating Perfection* in twelve scrolls, which circulated in the world. As for his acts—unfolding the morning’s mysteries to present petitions, pacing the nocturnal altar to send forth memorials, averting the hidden might of the Three Officials, dispelling stale *qi* from the hundred ghosts—all served to exalt the imperial standard, dispelling the threats of war, flood, and drought; all purified the mortal realm, eradicating the scourges of mediocrity and pestilence. Such were the fruits of the Venerable Master’s power.\n\nHaving embraced the One and guarded stillness, he detailed the return of the Dao to its root; having refined his essence and reverted to the origin, he perfected the defense of riding the wind and treading *qi*. Thus could he roam at ease through creation, preserving the great harmony; observing transformations, he kept his heart in perfect equilibrium; governing yin and yang, he expanded his spirit into vastness. How could he, like the two primal forces, be bound to their turbid substance, or like the ten thousand transformations, be confined by their profusion and lose his pure spirit?\n\nIn the year *yihai*, on the eighteenth day of the sixth month, he turned to his attendants and said: *\"I have received my appointment in the Dark Capital and may no longer remain.\"* Thereupon, he arranged his seals and prepared as if for a distant journey. As dusk fell, a crimson cloud coiled about him, brushing the earth as it approached. The sound of flutes rang clear, and he ascended into the void. All who witnessed it were astonished, certain he had attained transcendence. Rushing to his chamber, they found only his discarded form.\n\nTwenty-one days later, his disciples gathered to mourn him upon the Pine Terrace in the northwest. They posthumously conferred upon him the title of Grand Master for Closing Court with Silver and Azure, bestowing the posthumous name *Zhenyi* (\"True Unity\"). They also erected a stele of his own composition to honor his legacy.\n\nHis disciples said: *\"In this life, the Venerable Master had lived five hundred cycles of sixty years. His body was ever like a frost-laden pine, his heart like a bright mirror. He dwelt beyond sorrow and joy, lived without craving or desire. When he resided on Mount Song, pines sprouted upon the rear mound; when he moved to Terrace Ridge, a spring gushed from the eastern wall.\"*\n\nWhen he dwelt in reclusion upon Mount Nanyue, black cranes blanketed the wilds; when he sat in forgetfulness upon this mountain, colored clouds filled his chamber. As for his lofty bearing and transcendent conduct, he closely resembled the Hua-yang Immortal; his sudden awakening to the great revival far equaled the embrace of simplicity. His skill in instruction and guidance he ever took as his own duty. Yet as for his nature and the Heavenly Dao, these could not be heard.\n\nRightly did he gallop through the wondrous gate and wield his blade within the true sovereign’s realm, surpassing profound virtue to share the world’s cares, proclaiming the ultimate principle to shield against the multitudes of falsehood. When he soared to the heights of ten thousand fathoms and roamed the four voids, those who congealed ice found their patterns aligned, and those who chased shadows found their hearts subdued. Alas! Was he not one of those ancients who ascended to heaven, wandered through mist, and never died?\n\nSima Gang, Registrar of Baoding County in Hedong Commandery and the Master’s nephew in spirit, savored the flavor of his secret teachings and wandered within the pure chamber. He defended the Daoist gate from insult and yearned for immortal affairs with upturned feet. Thus he expanded the old sleeping quarters and constructed a new temple, declaring that the numinous immortals were not false, and that his reverent offering had found its proper dwelling.\n\nYet when they erected the spirit tablet and performed the ancestral rites, they saw only the upturned eaves. The linked lotus towers and the towering pines stood emerald in the distance; ethereal echoes responded to the void. A halo of light illuminated the night—truly a divine marvel.\n\nNow, those who attained the Dao in former times possessed wisdom as deep as rivers and seas, yet our Master was present everywhere. Their virtue stood as high as hills and mounds, yet our Master’s could not be measured. Thus he ascended to the Isles of the Blessed and left his fragrance in the annals of history. How could those who entered his gate capture his essence or embellish his glory?\n\nIn truth, the erection of a shrine manifests the way of the numinous, and the carving of stone initiates the propagation of the teaching. We cherish the legacy of the Master’s homeland and emulate the precedents of those who inscribed his deeds. As for the marvels of his writings, they are gathered in his collected works; the subtleties of his spiritual responses are preserved in his esoteric biography.\n\nThus I compose this eulogy:\n\nOf the Great Primal’s chaos,\nThe upper realms stretch boundless.\nThe subtle and the responsive,\nThe soaring and the entrusted.\nThe Dao—how profound and mysterious!\nWho could fathom or measure it?\nWithout a true artisan,\nWho could craft its system?\n\nO mighty true artisan,\nBorn to ride the turning of the ages,\nSurpassing all that endures,\nConcealed in namelessness.\nFirst to emerge from the dark retreat,\nThe Dao’s re-enactment complete.\nAdorning the great image,\nRefining the essence of the mysterious.\n\nWhat is this essence?\nThe ability to cultivate the wondrous body.\nWhat is this great image?\nThe ability to diligently illuminate all.\nGuiding later scholars,\nEmbellishing and bequeathing his teaching.\nThe lost find their way home,\nThe dawn’s light is universally reflected.\nFollowing the Dao within,\nThus attaining the great Dao.\nUltimately abiding in its profundity,\nSuddenly vanishing into nothingness.\nThe seven realms shine resplendent,\nThe hundred spirits hasten to serve.\nLife depends on fate,\nHow long can this body endure?\nYet day by day, without waiting,\nHe inscribed his name among the immortals.\nSucceeding the steps of Zhenbai,\nEqual to Ming of Zhichuan.\nWhere did he untie his jade seal?\nFor how many years did his banner stand aloft?\nBeneath the numinous temple,\nWe gaze emptily upon the grotto-heaven.\n\nHere ends the stele inscription for the Temple of Master Kui of the Central Rock of Mount Wangwu, Orthodox Unity.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "唐王屋山中岩台正一先生庙碣 经名：唐王屋山中岩奎正一先生庙碣。 唐卫阡撰。 一篇。 底本出处：《正统道藏》洞神部记传类。 唐王屋山中岩台正一先生庙碣 左威卫录事参军卫研谈 古之所谓列仙者，执大全以御于自然，游无参以至于不死，旁午众妙而登夫大元，盖着自玄元，成於天师，备诸简寂，而详乎贞白。 得贞白之道者日升玄，升玄以授于体玄，自三真在天，群学无主，主道之柄，必将有人。 天以司马真人为木铎欤？ 不然，玄标灵符，适骏若是。 尊师族司马氏，世居温晋彭城，王权之后，随亲侍都督晨之孙，皇代襄滑二长史仁最之子。 夫轩冤奕世，是谓令绪，忠贤继出，必生异人。 故子阿推惠，许真於降迹，初成行慈，茅君所以升道，抑有由也。 宗师讳承祯，字子微，法号道隐。 生而能言，幼而知道，天锡奇表，神仙正性，老壮大旨也。 引而伸之，杨许内学也，默而存之。 洁其行，耸其德，识穷精微。 思入虚极，议者谓冥冥之翮，不可屈而致，年二十一，始服巾褐入道，师体玄先生，先生中岳之隐几者也。 尊师神凝用简，情汰事落，其秉操不可渎，其执勤不知倦，体玄乃洗然异之。 他日以《金根上经》、《三洞秘录》、许真行事、陶公微旨、尽授于我尊师。 高悟独得，虚融大通，发挥道真，出入玄奥。 尝梦有凤乌衔玺，置于法案，刻曰授君东华上清真人，由是宝其寿，神其行，听於气，息於踵，则七日而外物，三月而遗形，一年而游於无有矣。 且凿逐而遁其隐迹，非应物也，狂歌而游其内修，非教人也； 吐腾奇术而眩愚，非保真也；",
      "translated_text": "**Stele Inscription for Master Zhengyi of Zhongyan Terrace on Wangwu Mountain of the Tang Dynasty**\n\n*Title:* Stele Inscription for Master Zhengyi of Zhongyan Terrace on Wangwu Mountain of the Tang Dynasty\n*Author:* Wei Qian of the Tang Dynasty\n*Source:* *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section under the *Dongshen* Department\n\n**Stele Inscription for Master Zhengyi of Zhongyan Terrace on Wangwu Mountain of the Tang Dynasty**\n*Composed by Wei Yantan, Recorder of the Left Guard of the Imperial Insignia*\n\nThe so-called \"immortals of the ranks\" in antiquity grasped the Great Completion to govern the natural, roamed the boundless to attain deathlessness, traversed the myriad wonders to ascend to the Great Origin. Their traces emerged from the Mysterious Origin, were perfected by the Celestial Master, and fully expounded in the Simplicity and Tranquility, detailed in the *Zhenbai*.\n\nThose who attained the Dao of *Zhenbai* ascended daily into the Mystery; the Mystery was transmitted to the Embodiment of the Mystery. Since the Three Perfected dwelled in heaven, the multitude of teachings lacked a master. The handle of the Dao’s governance must fall to someone.\n\nDid Heaven appoint Perfected Master Sima as its wooden clapper? If not, how could the numinous tally of the Mystery so swiftly align? The revered master’s clan bore the surname Sima, dwelling for generations in Wen and Jin of Pengcheng. Descended from the royal house of Wang, he was the grandson of the attendant to the military governor of Chen, and the son of Ren Zui, the two successive prefects of Xiang and Hua in our imperial dynasty.\n\nThe illustrious lineage of the Yellow Emperor and Elijah spans generations—this is called a noble succession. When loyal worthies emerge in succession, extraordinary individuals must arise. Thus, Master Zi’a’s kindness and wisdom, like that of Xu the Perfected in his descent, and his early cultivation of compassion, akin to Lord Mao’s ascent to the Dao, were not without cause.\n\nThe master’s religious name was *Daoyin*, his courtesy name *Ziwei*, and his Dharma name *Dao Yin*. Born speaking, he understood the Dao in childhood. Heaven bestowed upon him an extraordinary countenance and the true nature of an immortal—this was the great essence of age and vigor. Drawing it forth, it became the inner learning of Yang and Xu; silently preserving it, he purified his conduct, elevated his virtue, and his understanding penetrated the subtlest mysteries. His thoughts entered the utmost emptiness, and critics said his unseen wings could not be bent to worldly ends.\n\nAt twenty-one, he first donned the hempen cap and robe to enter the Dao, becoming a disciple of Master *Tixuan*, a recluse of the Central Marchmount. The revered master’s spirit was concentrated and his use serene; his emotions were sifted and affairs discarded. His integrity was unassailable, his diligence tireless. Master *Tixuan* thus regarded him with profound esteem.\n\nOne day, he transmitted to our revered master the *Golden Root Upper Scripture*, the *Secret Records of the Three Caverns*, the deeds of Xu the Perfected, and the subtle principles of Master Tao. With lofty comprehension and unique attainment, the master’s emptiness merged with the great penetration. He elucidated the true Dao, moving in and out of the profound mysteries.\n\nOnce, he dreamed of a phoenix and crow bearing a seal, placing it upon his Dharma table. The inscription read: *\"Conferred upon you as the Perfected of the Upper Clarity of Eastern Florescence.\"* Thereafter, he treasured his longevity, refined his conduct, listened to the *qi*, and rested in the heels. After seven days, he transcended external things; after three months, he forgot his form; after a year, he roamed in non-being.\n\nMoreover, he chiseled paths to conceal his hidden traces—not to respond to things; he sang wildly to cultivate his inner practice—not to teach others; he displayed wondrous arts to dazzle the foolish—not to preserve the true.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 611,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.471022605895996,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\唐王屋山中岩台正一先生庙碣.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "偃仰下位其容身，非高世也。 尊师是以务弘道不滞其用，方善救不宁其居，入觐圣上，九重肃广成之谒，出应时贤，群公交予训之请，故行而无边，事而无传，虚受以曲成，广照以吹万。 或外符能鼓其动，或内挞善闭其关，或燕处而潜偶群真，或冥升而密行上界，斯则不可测已。 而后游句曲，步华阳之天，栖桐梧，入灵墟之洞； 寻大霍，采金瓶之实； 登衡山，窥石摩之秘，皆山鬼贡药，天真授经，猛兽护门，野禽绕座，若此又不可备论也。 开元十二年，天子修明庭之撰，思接万灵，动汾水之驾，奖邀四子，乃征尊师入内殿，受上清经法，仍於王屋山置阳台观以居之。 师以王屋小有之天，总真之府，景气幽钦，神祇会昌，蚓吾道苟行，奚适不可，翻飞投足，遂有终焉之志。 更於观之乾维高丘之午，穷极绝界，得中岩台，上直大坛，下缭大阜，巨木圆抱，呜溪中洛，每养龙大谷，相鹤中峰，燎金洞之众香，吸石窗之鲜气，有日矣。 初，隐居抄撰道书，为《登真隐诀》，其存修之道，率多阙文，尊师乃着《修真秘旨》十二篇，见行於世。 至如发晨蕴以陈呎，步宵坛以飞章，回冥威於三官，走故气於百鬼，一以皇极增峻，息金革水旱之虞，一以人寰载清，无流庸疵疠之做，亦尊师之力也。 抱一守寂，反道归根之详既洎，炼景回元，乘飕蹈气之卫又备，可以逶迤造物，保合大均，观变化而冲和其心，抚阴阳而寥廓其纸，岂两仪之细而同其浊质，万化之杂而拘其清神哉！ ．岁乙亥，夏六月十八日，顾谓近侍日：吾已受职玄都，不复得住。 遂部署封检，将若远适。 迨昏，有赤云缭绕，摩地而来，箫声泠然，乘空而去，众咸惊．骇，谓必上升。 遽套户而入，已蜕形矣。 越二十一日，群弟子相与痉杖乌於西北之松台，制赠银青光禄大夫，缢日贞一，并上自制碑，申宠章也。 门人日：尊师之生也，五百世甲子矣，常见体如寒松，心若明鉴，居绝忧喜，生无嗜欲。 昔住嵩蟑，则后阜松生； 及移台岭，则束壁泉涌；",
      "translated_text": "He reclined in lowly positions to conceal his bearing—not to transcend the world. Thus, the Venerable Master devoted himself to propagating the Dao without hindering its function, ever excelling in salvation without settling in one place. He entered the imperial court to pay homage to the sagely sovereign, where the nine-fold gates received him with the reverence due to Guangcheng; he emerged to respond to the worthy of the age, as the assembled lords vied to seek his counsel. Therefore, his conduct knew no bounds, his deeds left no trace; he received with emptiness to achieve all obliquely, illumined widely to animate the ten thousand things.\n\nAt times, external omens stirred his movements; at others, inner discipline sealed his gates. Sometimes he dwelt in seclusion, secretly consorting with the host of Perfected; sometimes he ascended in darkness, stealthily traversing the upper realms—such was his unfathomable depth. Later, he wandered Mount Juqu, pacing the heavens of Huayang; he roosted in the paulownia and wutong groves, entering the cavern of Lingxu. He sought the great Mount Huo, gathering the fruit of the Golden Vase; he ascended Mount Heng, peering into the mysteries of Stone Rub. There, mountain spirits offered herbs, Heavenly Perfected bestowed scriptures, fierce beasts guarded the gates, and wild birds circled his seat—such wonders defy full recounting.\n\nIn the twelfth year of the Kaiyuan era, the Son of Heaven, in his enlightened court, sought to commune with the myriad spirits. He set forth his carriage upon the Fen River, summoning the Four Masters, and thus invited the Venerable Master into the inner palace to receive the scriptures and methods of the Upper Clarity. Moreover, he established the Yangtai Abbey on Mount Wangwu as his residence. The Master, deeming Wangwu the heaven of Xiaoyou, the palace of the assembled Perfected, a place of secluded majesty where gods and spirits gathered in splendor, thought: *\"If the Dao is to be practiced, where could it not thrive?\"* With a turn of flight and a step taken, he resolved to make it his final abode.\n\nFurther, at the northwest height of the abbey, where the terrain reached its utmost extremity, he discovered the Central Rock Terrace. Above, it aligned with the Great Altar; below, it encircled the great mound. Mighty trees embraced it in a ring, while the murmuring streams of the Luo and the central valleys resounded. There, he nurtured dragons in the great ravines and reared cranes upon the central peaks. He burned the myriad incenses of the Golden Grotto and inhaled the fresh *qi* of the Stone Window—thus did he pass his days.\n\nEarlier, while dwelling in seclusion, he had transcribed and compiled Daoist texts, producing the *Hidden Instructions for Ascending Perfection*. Yet many methods of cultivation therein remained fragmentary. The Venerable Master thus composed the *Secret Essentials of Cultivating Perfection* in twelve scrolls, which circulated in the world. As for his acts—unfolding the morning’s mysteries to present petitions, pacing the nocturnal altar to send forth memorials, averting the hidden might of the Three Officials, dispelling stale *qi* from the hundred ghosts—all served to exalt the imperial standard, dispelling the threats of war, flood, and drought; all purified the mortal realm, eradicating the scourges of mediocrity and pestilence. Such were the fruits of the Venerable Master’s power.\n\nHaving embraced the One and guarded stillness, he detailed the return of the Dao to its root; having refined his essence and reverted to the origin, he perfected the defense of riding the wind and treading *qi*. Thus could he roam at ease through creation, preserving the great harmony; observing transformations, he kept his heart in perfect equilibrium; governing yin and yang, he expanded his spirit into vastness. How could he, like the two primal forces, be bound to their turbid substance, or like the ten thousand transformations, be confined by their profusion and lose his pure spirit?\n\nIn the year *yihai*, on the eighteenth day of the sixth month, he turned to his attendants and said: *\"I have received my appointment in the Dark Capital and may no longer remain.\"* Thereupon, he arranged his seals and prepared as if for a distant journey. As dusk fell, a crimson cloud coiled about him, brushing the earth as it approached. The sound of flutes rang clear, and he ascended into the void. All who witnessed it were astonished, certain he had attained transcendence. Rushing to his chamber, they found only his discarded form.\n\nTwenty-one days later, his disciples gathered to mourn him upon the Pine Terrace in the northwest. They posthumously conferred upon him the title of Grand Master for Closing Court with Silver and Azure, bestowing the posthumous name *Zhenyi* (\"True Unity\"). They also erected a stele of his own composition to honor his legacy.\n\nHis disciples said: *\"In this life, the Venerable Master had lived five hundred cycles of sixty years. His body was ever like a frost-laden pine, his heart like a bright mirror. He dwelt beyond sorrow and joy, lived without craving or desire. When he resided on Mount Song, pines sprouted upon the rear mound; when he moved to Terrace Ridge, a spring gushed from the eastern wall.\"*",
      "overlap_context": "per Clarity of Eastern Florescence.\"* Thereafter, he treasured his longevity, refined his conduct, listened to the *qi*, and rested in the heels. After seven days, he transcended external things; after three months, he forgot his form; after a year, he roamed in non-being.\n\nMoreover, he chiseled paths to conceal his hidden traces—not to respond to things; he sang wildly to cultivate his inner practice—not to teach others; he displayed wondrous arts to dazzle the foolish—not to preserve the true.",
      "start_char": 611,
      "end_char": 1368,
      "start_sentence": 25,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.934287786483765,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\唐王屋山中岩台正一先生庙碣.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "幽居於南岳，则玄鹤蔽野； 坐忘於兹山，则彩云满室，若乃高姿逸轨，近类华阳，俄闻伟苏，远齐抱朴，其善诲善诱，则常以为己任，若性与天道，亦不可得而闻。 宜其驰辕於妙门，游刃於真宰，迈玄德而同世恤，宣至理而障群伪，及挥斥万仞，翱翔四空，凝冰者理顺，捕影者心伏，戏，岂古登天游雾而不死者夫。 河东郡宝鼎县主簿司马纲，师之犹子也，餐味密训，倘佯精庐，御侮道门，翘足仙事，乃恢张遗寝，制造新庙，将谓灵仙不妄，且以虔奉有所考室也。 侈而太之立主也，尸而祝之，徒见反宇。 连· 莲高松杳翠，灵响虚应，圆光夜烛，亦神异也。 会惟昔之得道者，智有如江如海惟深也，我师则无不在，德有如丘如陵其高也，我师则不可，升故塞于瀛县，馨于图史，岂游其门者能象其边而缀其美乎？ 诚以立祠者表灵之道，刻石者弘教之端，思存乎阜乡之遗风，景行乎写平之故事，若述作之奇伟，见于萃集，感应之幽微，存乎内传云尔。 乃作颂日： 大元混茫，上境辽廓。 冲用斯应，翰飞是托。 道其深微，人孰营度。 不有真匠，畴能系作。 伟哉真匠，乘运挺生。 超乎长存，隐乎无名。 玄退首出，' 道再演成。 润色大象，猜那之精。 至精伊何，能修体妙。 大象伊何，能勤广照。 周麾后学，缘饰垂教。 弱丧知归，晞光胥效。 从道於中，以克大道。 终处其厚，奄荒无有。 七域昭贲，百灵奔走。 夫生在命，此身能久。 且日无待，着名别仙。 嗣武贞白，齐明稚川。 解玉何地，迥旌几年。 灵庙之下，空瞻洞天。 唐王屋山中岩奎正一先生庙碣竟",
      "translated_text": "When he dwelt in reclusion upon Mount Nanyue, black cranes blanketed the wilds; when he sat in forgetfulness upon this mountain, colored clouds filled his chamber. As for his lofty bearing and transcendent conduct, he closely resembled the Hua-yang Immortal; his sudden awakening to the great revival far equaled the embrace of simplicity. His skill in instruction and guidance he ever took as his own duty. Yet as for his nature and the Heavenly Dao, these could not be heard.\n\nRightly did he gallop through the wondrous gate and wield his blade within the true sovereign’s realm, surpassing profound virtue to share the world’s cares, proclaiming the ultimate principle to shield against the multitudes of falsehood. When he soared to the heights of ten thousand fathoms and roamed the four voids, those who congealed ice found their patterns aligned, and those who chased shadows found their hearts subdued. Alas! Was he not one of those ancients who ascended to heaven, wandered through mist, and never died?\n\nSima Gang, Registrar of Baoding County in Hedong Commandery and the Master’s nephew in spirit, savored the flavor of his secret teachings and wandered within the pure chamber. He defended the Daoist gate from insult and yearned for immortal affairs with upturned feet. Thus he expanded the old sleeping quarters and constructed a new temple, declaring that the numinous immortals were not false, and that his reverent offering had found its proper dwelling.\n\nYet when they erected the spirit tablet and performed the ancestral rites, they saw only the upturned eaves. The linked lotus towers and the towering pines stood emerald in the distance; ethereal echoes responded to the void. A halo of light illuminated the night—truly a divine marvel.\n\nNow, those who attained the Dao in former times possessed wisdom as deep as rivers and seas, yet our Master was present everywhere. Their virtue stood as high as hills and mounds, yet our Master’s could not be measured. Thus he ascended to the Isles of the Blessed and left his fragrance in the annals of history. How could those who entered his gate capture his essence or embellish his glory?\n\nIn truth, the erection of a shrine manifests the way of the numinous, and the carving of stone initiates the propagation of the teaching. We cherish the legacy of the Master’s homeland and emulate the precedents of those who inscribed his deeds. As for the marvels of his writings, they are gathered in his collected works; the subtleties of his spiritual responses are preserved in his esoteric biography.\n\nThus I compose this eulogy:\n\nOf the Great Primal’s chaos,\nThe upper realms stretch boundless.\nThe subtle and the responsive,\nThe soaring and the entrusted.\nThe Dao—how profound and mysterious!\nWho could fathom or measure it?\nWithout a true artisan,\nWho could craft its system?\n\nO mighty true artisan,\nBorn to ride the turning of the ages,\nSurpassing all that endures,\nConcealed in namelessness.\nFirst to emerge from the dark retreat,\nThe Dao’s re-enactment complete.\nAdorning the great image,\nRefining the essence of the mysterious.\n\nWhat is this essence?\nThe ability to cultivate the wondrous body.\nWhat is this great image?\nThe ability to diligently illuminate all.\nGuiding later scholars,\nEmbellishing and bequeathing his teaching.\nThe lost find their way home,\nThe dawn’s light is universally reflected.\nFollowing the Dao within,\nThus attaining the great Dao.\nUltimately abiding in its profundity,\nSuddenly vanishing into nothingness.\nThe seven realms shine resplendent,\nThe hundred spirits hasten to serve.\nLife depends on fate,\nHow long can this body endure?\nYet day by day, without waiting,\nHe inscribed his name among the immortals.\nSucceeding the steps of Zhenbai,\nEqual to Ming of Zhichuan.\nWhere did he untie his jade seal?\nFor how many years did his banner stand aloft?\nBeneath the numinous temple,\nWe gaze emptily upon the grotto-heaven.\n\nHere ends the stele inscription for the Temple of Master Kui of the Central Rock of Mount Wangwu, Orthodox Unity.",
      "overlap_context": "g the posthumous name *Zhenyi* (\"True Unity\"). They also erected a stele of his own composition to honor his legacy.\n\nHis disciples said: *\"In this life, the Venerable Master had lived five hundred cycles of sixty years. His body was ever like a frost-laden pine, his heart like a bright mirror. He dwelt beyond sorrow and joy, lived without craving or desire. When he resided on Mount Song, pines sprouted upon the rear mound; when he moved to Terrace Ridge, a spring gushed from the eastern wall.\"*",
      "start_char": 1368,
      "end_char": 1972,
      "start_sentence": 45,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.843076467514038,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\唐王屋山中岩台正一先生庙碣.txt",
        "category": "记传类"
      }
    }
  ]
}