{
  "source_id": "四圣真君灵签",
  "source_file": "chunked_daozang\\四圣真君灵签.json",
  "total_chunks": 23,
  "total_original_chars": 18012,
  "total_translated_chars": 99971,
  "total_translation_time": 532.5330469608307,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Divine Lots of the Four Sage Perfected Lords**\n\n*Scripture Title:* *Divine Lots of the Four Sage Perfected Lords*\n*Author:* Unknown\n*Volume:* One\n*Source Text:* *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n**Divine Lots of the Four Sage Perfected Lords**\n**Celestial Admonitions for the World**\n\nTo seek glory through deceit is to gain no renown.\nWealth amassed through exploitation brings calamity upon descendants.\nCultivate virtue with mindfulness, and fortune and blessings shall descend.\nCurb desires, diminish self-interest, and your destiny shall endure.\n\nDo not deceive in darkness, nor betray the Three Luminaries.\nBe upright and selfless, with a loyal and sincere heart.\nHeaven and Earth bestow blessings; the gods stand guard beside you.\nProlong life and transcend hardship—prosperity shall surely come.\nIf you heed my words, all afflictions shall vanish like the sea.\n\nWhen praying, first state your native place and name, then declare:\n*\"For [such-and-such a matter], I humbly invoke the Perfected Lords—*\n*Marshal Tianpeng the Great, Vice-Marshal Tianyu,*\n*Lord Xusheng the Protector of Virtue, and Lord Zhenwu the Spiritually Responsive—*\n*along with the gods of Heaven and Earth, who witness all things.*\n*I now cast this lot: may good or ill be revealed,*\n*fortune or misfortune be foretold, life or death be decided—*\n*let the judgment be without doubt.\"*\n\n---\n\n**First Lot** □□ *Lower-Lower* **Uphold the Old**\n\nFrom dawn to dusk, toil without rest,\nSeeing only gold, not the man.\nThough hoarded wealth may rot,\nIn time, even blossoms turn to dust.\n\nThe soaring dragon transforms when the hour is right—\nToday, its ascent is fulfilled.\nPlans and wealth-seeking bring great fortune;\nSeeking office and promotion leave no doubt.\n\nThe fierce general storms the palace gates—\nHow dare petty schemes stir conflict?\nYou must pay homage at the golden gate,\nWhere lords above and below stand in harmony.\n\n**Sacred Intent:**\nChasing profit at dawn, abandoning truth for delusion.\nWhat is amassed cannot be dispersed—retribution follows slander.\nHold fast to the ordinary; do not scheme.\nDo not stir litigation; marriages shall prosper.\nThe sick recover slowly; travel faces obstacles.\nActions fall short—no path lies ahead.\nAuspicious in autumn, inauspicious in spring and winter.\nSelling goods is favorable.\nLitigation brings no trouble; buying and selling yields no profit,\nOr if slight gains come, they cost great effort.\nFor those under fifty, illness lingers but does not last.\nThe young should recover early; lying abed longer is no harm.\nAffected by earth, but smallpox is no threat.\nSudden illness—if young, sweat comes in seven days, and life is secure.\nMarriage brings discord; if the husband enters the wife’s home, misfortune follows.\nSeeking livestock or servants brings ill fortune.\nStudying medicine or crafts is inauspicious; lost items are hard to recover.\nWhether early or late, reunion is delayed and difficult.\nBorrowed items are mostly not returned, or only a few.\n\nRelocation brings misfortune; only guarding the old homestead is fitting.\nHousehold members are afflicted by earth, with taboos unsettling peace.\nCultivate blessings to protect them—childbirth should be swift; delay makes official promotion difficult, though greatly auspicious.\nSell goods promptly when selling; documents remain unsigned, and delay prevents completion.\nThose entrusted prove deceitful.\nBuy goods promptly when buying; plans and actions come to fruition.\nObstacles arise; farming yields no harvest.\nMeet noble persons at once—delay brings no success.\nAcupuncture and moxibustion require choosing an auspicious day.\nCherishing flowers, yet rain falls; loving the moon, dark clouds arise.\nAt the feast, no matter seems settled, yet quarrels still contend.\n\n[Missing characters] Second: Greatly Auspicious. Action and use bring advancement.\nSeek shelter early to secure profit—\nDiligently follow ancient methods, never overstepping time.\nReforming what is corrupt is people’s constant wish;\nWhen deeds align with the heart, great rewards are enjoyed.\nThe tiger leaves the great forest, stirring the crowd—\nThough people see it, they remain anxious and doubtful.\nThough it harbors no intent to harm,\nIt still causes false alarms and suspicious affairs.\nHow can mountain dwellers host clamorous guests?\nBetter to cultivate the mind and refine oneself.\nAmid all things, remain patient;\nBurning with effort in alchemy is but vain labor.\n\nThe Sage’s intent declares:\nFollow rules and norms, establish oneself by the Dao.\nFrom long stillness comes the thought of movement—\nEver diligent and earnest.\nRelocation is auspicious; plans proceed as the heart desires.\nMarriage brings harmony; the ill recover lightly.\nAll matters flow smoothly; litigation brings joy.\nAdhering to the Sage’s lot,\nAll desires prosper and flourish.\n\nDivining marriage is auspicious.\nAcquiring goods is of little value; selling goods is favorable.\nMoving residence is auspicious.\nLitigation brings no trouble; household and family are at peace.\nSeeking office brings delayed promotion, yet rank is assured.\nIllness should be treated swiftly.\nPerforming blessings is fitting—\nFor the elderly, recovery is difficult;\nFor the young, outcomes vary between good and ill.\n\nMedication meets obstruction; pox sores remain unstable.\nFor distant travel, fewer companions bring good fortune.\nThe traveler arrives—if not, returns within two months.\nLost items lie within the home; seek them early, for delay brings no sight.\nHousehold members meet good fortune.\n\nAfter long absence, the traveler appears—within a day or two, news arrives.\nSelling goods or matters should be done promptly; delay brings difficulty.\nPregnancy struggles to bear; a daughter is born.\nPerforming blessings—\nThe child is born now.\nSeeking a physician or entering school is auspicious.\nEntrusting matters to two people brings good fortune.\nTrade is auspicious.\nDocuments meet obstruction, yet fortune prevails.\nBorrowing from three people is auspicious.\nPurchasing livestock, fields, or homes brings swift profit.\nJoyful reunion with kindred spirits—withered willows bloom halfway.\nPursuing good fortune ahead, the heart’s desires are fulfilled in later days.\n\n**Third: Moderate Fortune – From Adversity Comes Prosperity**\nExhausting diligence in hope of success,\nOnly to be met with sorrow and bitter countenance.\nWorry not for the vain depletion of treasures—\nWhy toil in vain without holding to the mean?\n\nFrom adversity now comes prosperity;\nThe dragon’s blade, polished, sheds its old dust.\nSay not that self-restraint holds no other hope—\nEven in seclusion, wealth is gained.\n\nIn office, slanderers arise,\nYet promotion follows in time.\nBest to stay home, uphold the Dao,\nAnd naturally, heroes appear within the household.\n\nThe Sage’s intent declares:\nThe times run contrary, unable to hold to constancy.\nDiligence exhausted, one suffers calamity instead.\nLost items invite misfortune; actions turn ill.\nIn all matters, plan early and act in secret.\nGreat losses of wealth—best to maintain the norm.\n\nDivining purchases—fields, homes, livestock, or servants prove difficult.\nSee goods and buy swiftly; to haggle further brings no profit.\nIllness affects young and old.\nIf untimely, first ill, then good.\n\nHousehold spirits are restless; marriage harms the husband.\nEfforts fail; farming is laborious.\nNo harvest—hold to the old; selling goods is favorable.\nLitigation is troublesome; plans and actions falter.\nOld foundations are sound; new ventures are difficult.\nLost livestock or servants are hard to recover.\nChildbirth is difficult; mother and child face peril.\nPerforming blessings may yield a son.\nEntrusting matters to others brings no success—only obstruction.\nDocuments bring no benefit; wealth is lost.\nRelocation is inauspicious.\nBorrowing brings no trade; commerce is unfavorable.\nHolding to the old brings good fortune; change invites danger.\nThe tripod lacks a leg—cooking must adapt to the times.\n\n**Fourth: Moderate Fortune – Cautious Restraint**\nSay not that minor illness is but a fleeting worry—\nTime and tide wait for none.\nIf one plans early within the Dao,\nPerhaps peril may yet yield safety.\n\nLaboring heart and strength to succeed,\nOnly to see the blossoms scattered by a gust of wind.\nYet if the Eastern Lord lends a gentle hand,\nAnother branch blooms in the distance.\n\nWind spurs lightning, thunder serves as messenger;\nDrought breeds demons in the waters where dragons twist.\nIf one can avoid neither,\nTiming and harmony suffice for excellence.\n\nThe Sage’s intent declares:\nBe cautious in small matters, hold to oneself, and serve the spirits wholeheartedly.\nFulfill old vows early to avoid calamity.\nLitigation is unfavorable; do not divine marriage.\nTravel should be halted; the road is fraught with delay.\nWealth is modest; illness may yet be spared.\nAll aligns with the Dao—first dark, then bright.\n\nDivining illness—vows bring first ill, then good.\nProlonged affliction is no concern, but the elderly face difficulty.\nPox sores require blessings; childbirth demands swift action—first ill, then good.\nTrade is modest; meet people promptly—two or three crops should be harvested early, or none at all.\nSpeak of goods quickly; marriage is inauspicious.\nAdopting or moving into a home is ill-fated.\nTravel stirs the heart, but the body remains—\nThe traveler arrives in two or three days.\nIf not, delay brings good fortune in litigation.\nSpending to buy livestock brings swift success; delay brings difficulty.\nSeeking office or promotion—rank comes late, and desires are unmet.\nPurchasing goods, fields, or homes should be done quickly; delay brings failure.\nLost items appear at once; if delayed by a day, they vanish.\nMatters should be settled swiftly; delay brings change.\nHousehold and family face misfortune.\nPerforming blessings brings peace.\nEntrusting matters to others is favorable.\nNoble aid comes late and fails.\nTrade is difficult; commerce should be swift.\nRelocation is ill-fated.\nBorrowing should be done promptly, though others may interfere.\nDocuments appear at once; delay brings failure.\nSeeking physicians or studies is difficult with delay.\nDwelling in peace yet fearing danger,\nDeep emotions bring separation.\nBefore good fruit can be sought,\nFirst, one must suffer the loss of a branch.\n\n**Fifth: Moderate Fortune – Beneficial Action**\nWith good intent, plan and scheme together—\nProfit flows endlessly to meet your desires.\nDo not forget good deeds in this pursuit,\nLest the withered vessel drift in the waves.\n\nThe sailing ship meets favorable winds without doubt;\nCrossing the river is timely.\nThe Great Wall of ten thousand li is within reach—\nPlans succeed as hoped, matters proceed as scheduled.\n\nTwo merchants seeking profit—\nBest to set out and leave their homeland.\nIn three, five, or seven days, they reach Chang’an,\nWhere goods are traded—do not linger in the market.\n\nThe Sage’s intent declares:\nTrade is most favorable; unite in purpose and plan.\nFor the elderly and ill, peril is like a lone boat.\nMarriage is harmonious; plans and hopes may be pursued.\nIllness wavers, yet without resolution, there is no worry.\nThe traveler arrives soon; litigation brings no detention.\nSilkworms and fields bring good fortune; the household thrives in ease.\n\nDivining wealth—buying, selling, and acquiring goods is favorable, though partnerships are inauspicious.\nLitigation brings no trouble; marriage is auspicious.\nFarming yields harvest; travel is fortunate.\nThe traveler arrives soon or late; seeking office or promotion benefits illness.\nThose in their thirties and forties face no harm;\nThose above forty should act swiftly and perform blessings.\nPox sores are stable; the elderly may die.\nPurchasing fields, homes, livestock, or servants is auspicious.\nThe household—old in peril, young at peace.\nEntrusting matters to others brings swift good fortune.\nRelocation is greatly auspicious.\nLost items appear after delay; plans and actions should be swift—\nDelay brings no success within two or three days.\n\nChildbirth—on even-numbered days brings peace and good fortune.\nSelling goods—profit lies in swift sale; trade and commerce are auspicious.\nWritten contracts and transactions will not succeed.\nFor cart-making, the hub must be shaped with skill, relying on a master craftsman’s hand.\nLayered mountains form brocade; fallen flowers bloom again.\n\nHexagram Six: \"Great Auspiciousness in Mind\" – Beneficial for Action and Use\nTo seek a foundation in letters and plans,\nWhy doubt or devise schemes?\nSimply maintain a heart upright and just—\nNaturally, transactions yield profit and surplus.\n\nMandarin ducks, parted, fly in two directions;\nSchemes and wealth-seeking remain unfulfilled for now.\nBetter to hold fast to the old—no need for change;\nAdvance or retreat, hesitation lingers still.\n\nDwelling in peace is best within the village;\nShould you wish to relocate, no cause for concern.\nEven in solitude, all remains well;\nProfit and loss in wealth cannot be matched.\n\nThe Sage’s Intent declares:\nIn all literary and legal matters, no loss.\nIn all schemes and plans, all affairs are peaceful and auspicious.\nFor kinship and harmony, contracts and deeds proceed smoothly.\nIn litigation, justice prevails; illness does not turn grave.\nIn action and change of heart, ten thousand things succeed without fail.\n\nDivining wealth—seek modest gains; when meeting others, patience is key.\nWealth is not lacking; purchasing goods is auspicious.\nSelling goods is auspicious.\nIn troubling matters, caution; litigation is favorable.\nFarming yields a meager harvest; travel should be swift.\nThe traveler arrives soon; illness and old age pose no harm.\nFor the young, improvement comes in two or three days;\nProlonged delay brings difficulty.\n\nThe pox subsides peacefully; marriage is auspicious. Harmony enters the household, all is propitious; the home and family remain at peace. Transactions conclude smoothly, though delay may hinder success. Purchasing land, dwellings, or servants is greatly auspicious. Plans and undertakings face initial difficulty, then ease. Childbirth is peaceful; bearing a son brings noble fortune. Seeking office or promotion brings great advantage. Relocation is auspicious; entrusting matters to others follows the pattern of initial difficulty then ease. Documents bear the vigor of *qi*—propitious. When fish transform into dragons, the time of change arrives; cease speaking of ceaseless rains.\n\nAzure clouds reappear in joy; a single thunderclap heralds the rains.\n\n---\n\n**Hexagram Seven: \"Auspicious Rain\" – Two Auspicious Omens in Motion**\n*When talent and spirit ascend to knock upon the heavens,*\n*Deep illness vanishes at once—divine merit is shown.*\n*Whether young or old, all receive the blessings of this rain;*\n*Its application is like tilling soil in a year of abundance.*\n\nWithered trees meet spring and bloom with color;\nSuddenly, branches flourish, sprouting new shoots.\nLet no one cut them for firewood—\nWait until spring deepens, and they blossom again.\n\nTravel east to Zhejiang for trade;\nIn Jiangxi, they speak of new tea.\nDo not go east for business—\nBuying tea there is like embroidering flowers upon brocade.\n\nThe Sage’s Intent declares:\nWithin, one’s essence is concentrated, making resonance easy to attain.\nThough beset by worries, what need is there for excessive concern?\nThe sick gradually recover; chronic ailments also fade.\nFortune comes as heavenly aid, yet follows human cultivation.\nYoung and old are safe and auspicious; litigation does not detain.\nPlans and endeavors hold promise; planting and weaving yield full harvests.\n\nDivining wealth—three or four parts are attainable. Purchasing goods is like *Gouchen* (a celestial sign); selling goods is slow. Litigation is auspicious; relocation is auspicious. Resolving matters is auspicious; entrusting others follows the pattern of delayed success. In trade, lost items are hard to recover. Travel is auspicious; the traveler arrives in one or two days. Illness in the old or young poses no harm—praying to heaven is auspicious. The pox subsides peacefully; buying livestock, land, dwellings, or servants is auspicious. Marriage is auspicious; plans and undertakings succeed. Small-minded people may interfere, but losing wealth is auspicious. The home and family remain at peace; trade prospers.\n\nChildbirth is harmonious; seeking office is auspicious.\nThough one has not yet reached the rank of minister,\nThe blue clouds spread in pursuit.\nSpring’s boundless beauty\nShines upon the Jade Pool.\n\n---\n\n**Hexagram Eight: \"Adversity and Obstruction\" – Clinging to the Old**\nA foundation of hardship wearies those who sustain it;\nEndless toil in base affairs blinds one to opportunity.\nLivestock suffer losses—minor setbacks—\nYet greater worries arise among the household.\n\nSeeing a fishing boat struggle upstream,\nIt docks here, lingering in hesitation.\nOnce the first rapids are passed, one might think the worst is over—\nBut ahead lie even more treacherous shoals.\n\nMatters of the heart are hard to pursue;\nIf you proceed, fortune will diminish.\nThis is where wealth is lost on the road,\nWhere surging waves engulf the bright pearl.\n\nThe Sage’s Intent declares:\nOne possesses ancestral legacy yet fails to preserve it.\nGreed knows no bounds; one exhausts schemes in vain.\nLivestock perish, bringing sorrow to the household.\nPlans come to naught; the sick recover slowly.\nLitigation is lost; all actions court peril.\nOne should cling to the old and not seek change.\n\nDivining wealth—trade yields meager returns. Purchasing goods is steady, but endeavors fail. Litigation has a clear outcome; relocation is auspicious. Selling goods is slow; farming depends on timing. Travel is inauspicious; the traveler arrives in two or three days. If they do not, wealth is lost. The old face misfortune in illness; the young endure prolonged hardship without harm. The pox is slow to heal; trade is unprofitable. First marriages face no obstacles, but remarriage is ill-advised. Seeking heirs is inauspicious; litigation is difficult at first, then eases. Purchasing land, dwellings, servants, or livestock is inauspicious; plans and undertakings are uncertain. Trade is unpropitious. Lost items are hard to recover; the household suffers misfortune. Childbirth is difficult; entrusting matters to others is unlikely to succeed. Seeking office or promotion is slow.\n\nWhen treasures transform with the times,\nWhy do matters not return?\nFingers point to the setting sun—\nA lone boat refuses to rest.\n\n---\n\n**Hexagram Nine: \"Receiving Blessings\" – Transcending the Mundane**\nLonging to leave the old and embrace the new,\nOne encounters flourishing fortune, and aspirations expand.\nHome and family are at peace, free from other concerns;\nHiding one’s light and biding time, one emerges from the dust.\n\nOrchids in spring’s splendor are fragrant and lovely;\nChrysanthemums in autumn’s bloom are even finer.\nHeaven and earth each follow their own inclinations—\nUnbound by restraint, they open in succession.\n\nHow to address matters of two minds?\nOne must follow fate with reverence and pass through cautiously.\nYet the time of opportunity is not far off—\nThough not grand, it is worthy of praise.\n\nThe Sage’s Intent declares:\nAfter adversity comes prosperity; aspirations will unfold.\nThe long-established home is peaceful; one transcends the mundane.\nAll actions and plans succeed without fail.\nClinging to the old brings mediocrity; nearly achieved goals may collapse.\nTrade proceeds without obstruction; fields and silkworms are fully prepared.\nChanges and actions will surely bring satisfaction.\n\nDivining wealth—change brings auspiciousness. Purchasing and selling goods are auspicious; relocation is auspicious. Litigation is auspicious. Most matters see partial success; farming yields two- or threefold. First marriages are auspicious; remarriage is mediocre. Seeking heirs is auspicious. Travel is auspicious; the traveler arrives in two or three days. The old face difficulty in illness; the young endure prolonged hardship, which is also difficult. The pox resolves with blessings; litigation is auspicious. Purchasing land, dwellings, servants, or livestock is auspicious. Plans and undertakings should proceed swiftly. Lost items should be sought immediately; delay makes recovery unlikely.\n\nSeeking official position or promotion—unattainable. Household and family members are at peace; do not speak of borrowing. Childbirth proceeds smoothly; documents bring delayed auspiciousness. Transactions are slow to conclude; entrusting others with matters may fail. Venturing into trade is greatly auspicious.\n\nFor months on end, rain falls frequently,\nOnly at dusk does the sky begin to clear.\nRaising one’s gaze to the heavens above,\nThe dim moon gradually grows bright.\n\n□□  Tenth  Supreme  Auspicious\n\nAuspicious repute overflows with boundless blessings,\nThe household brims with joy and felicity.\nFrom whence comes the phoenix’s auspicious sign?\nVirtue’s glory shines, bringing prosperity for generations.\n\nWhether on level ground or mountain peaks,\nAll the boundless springtime beauty is claimed.\nHaving gathered the essence of a hundred flowers into honey,\nFor whom does one toil, and for whom is it sweet?\n\nThe imperial proclamation calls for worthy talents, courage and harmony aligned,\nJust as spring’s hues are fitting to enter the gate.\nAttaining office will ultimately lead to prominence,\nYet nothing compares to the stability of family wealth.\n\nThe Sage’s intent declares:\nThe Dao of the noble flourishes, the way of the petty wanes.\nSeeking fame finds fulfillment, distinction in the imperial court.\nA noble child is born, bringing future abundance.\nSubmitting memorials and strategies, one takes the lead in divination.\nFor the common person, such aspirations remain unattainable.\nVaguely adhering to the old ways,\nOne narrowly avoids calamity and misfortune.\n\nDivining wealth—nobles prosper, while petty persons are present.\nSmall-scale acquisitions are auspicious.\nSell goods promptly; relocation is auspicious. Litigation is auspicious.\nFarming depends on timing; mediocre transactions may succeed, but delay brings failure.\nHousehold and family members are at peace; travel is auspicious.\nPetty persons cling to the old; the traveler arrives in one or two days.\nIllness afflicts both young and old with difficulty; the pox fares likewise.\nMarriage—nobles and prominent persons find initial unions auspicious; remarriage is auspicious. Entering a household to seek heirs is auspicious.\nPetty persons find small-scale trade auspicious.\nPurchasing land, dwellings, servants, or livestock—nobles find it auspicious, petty persons struggle.\nDocuments bring auspiciousness to nobles, but misfortune to petty persons.\nPlans and undertakings—nobles achieve prominence, while petty persons see no gain.\nNobles give birth to the noble; petty persons face separation.\nBorrowing—nobles find it auspicious, petty persons gain nothing.\nLost items should be sought gradually. Relocation is auspicious.\nSeeking medical treatment or education is auspicious. Entrusting others with matters is auspicious, but petty persons meet with failure.\nSeeking official position, promotion, or appointment is auspicious.\nIn affairs, it is best to rest the mind and settle the body, which will gradually improve.\n\nLike fading blossoms that remain as before,\nTheir colors now full and abundant.\n\n□□  Eleventh  Supreme  Diligence in Action\n\nDo not let footprints linger long in dust and obscurity;\nFortunately, a true scholar is a treasure at the feast.\nUpholding integrity need not mean perpetual seclusion—\nAwait the moment when grinding and polishing open the ford.\n\nThe prisoner leaves jail, disputes are settled,\nThen one buys sweet melons to ascend the tavern.\nBy chance, an old friend is met, and they drink together,\nThe wine bill is paid, and they toast one another again.\n\nWhy rush matters when setting out?\nEven hurrying to Chang’an takes three days.\nBetter to stay home and heed the news,\nFor affairs must be witnessed firsthand to bring glory.\n\nThe Sage’s intent declares:\nTalents and skills long buried in dust,\nThe time approaches when the path will open,\nBringing success and fulfillment to plans.\nMost fitting to pursue aspirations,\nYet impossible to linger.\n\nMarriage remains steady, lawsuits incur no loss.\nClinging to the old is unwise—lest one face humiliation.\nRegarding wealth: for scholars in trade, full profit awaits;\nLight goods are easy to acquire, and sales proceed smoothly.\nMoving residence is inauspicious.\nLawsuits turn favorable, yet all matters meet obstruction.\nTravelers arrive in two or three days—if not, trust the news.\nJourneys prove auspicious.\nThe sick recover in three to five days without harm;\nProlonged illness may require a vow, but pox brings good fortune.\nMarriage is favorable, and seeking wealth through marriage succeeds.\nLawsuits should be settled amicably.\nPurchases—be it property, servants, livestock, or textiles—face delays but will conclude.\nChildbirth yields a noble son, safe and sound.\nAll matters should be hastened, for delay invites trouble.\nRelying on others brings good fortune; household and family remain at peace.\nDocuments bear an auspicious aura; transactions should be swift—delay risks failure.\nRelocation and commerce prosper.\nSeeking medicine or official promotion brings success.\nBorrowing should be done quickly, for others may interfere.\nWhat one desires will surely come to pass—\nIf only someone could know!\nWhen the dragon soars, the ravine appears;\nThe timely rain falls just as it should.\n\n[Missing characters] Twelfth: Lowest of the Low—Foul Conduct Obscures Clarity\n\nFoul conduct deceives the heart, betraying Heaven’s gaze;\nGhosts and spirits ever watch one’s hidden ways.\nIf arrogance could summon fortune’s grace,\nNo good would walk the earth in human form.\n\nWillow catkins swirl on the wind, lost without trace—\nLike King Xiang’s dream, fleeting as a breath.\nIn the quiet of night, beneath the moon’s pale glow,\nThey drift and scatter, entangling the fragrant groves.\n\nOne may laugh at the traveler’s tale:\nYesterday he was poor—today, rich with coin.\nYet without diligence, nothing is gained;\nKnow this: only later comes fulfillment.\n\nThe Sage’s Intent declares:\nDeceit within and without—ghosts and spirits offer no protection.\nIn all affairs and movements, one must fear misfortune and blame.\nWhether plotting or acting, all endeavors prove difficult to achieve.\nAtoning for transgressions and seeking forgiveness may yet avert calamity.\nBefore any action comes to fruition, it is best to maintain the status quo.\nThough this slip is deemed greatly auspicious, all matters go awry.\n\nFor wealth: buying, selling, and stocking goods is favorable; selling brings profit.\nFor litigation: auspicious. For relocation: inauspicious.\nOn days marked by the fourth, twenty-sixth, forty-eighth, or thirty-fourth,\nundertaking journeys invites disaster.\nTravelers will arrive in two or three days; if not, they are detained by matters abroad.\nFor illness, whether young or old: afflicted by earth spirits or unfulfilled vows,\nor one who has left the ancestral line and resides elsewhere—first seek aid from the household,\nfulfill new vows swiftly, for delay endangers recovery.\nFor pox: ominous; preserving life brings good fortune.\nFor marriage: entering the groom’s home is greatly inauspicious.\nFor advancement or promotion: aspirations remain unfulfilled.\nFor purchasing land, homes, or livestock: inauspicious.\nAll schemes, plans, and undertakings prove unfavorable.\nFor childbirth: difficult. Household and family are unsettled—seek blessings for peace.\nRelying on others for matters brings no success; people are hard to find.\nSuccess turns to adversity; anxiety weighs heavily on the heart.\nThe trials of the Nai River are not yet passed—pray for blessings to avert misfortune.\n\n□□ Thirteenth: Middling—Perseverance in the Old Ways\n\nA steadfast nature, reverent and diligent, never slighting the gods;\nIn dealings with others, one remains fair and just.\nHow can one provoke resentment and reproach?\nBetter to withdraw the heart and preserve what is already achieved.\n\nFlowers bloom and bear fruit, meeting their timely season,\nRelying on the workings of spring’s transformative power.\nAll hopes and plans come to fruition,\nAnd the dream of returning home in brocade robes may yet be realized.\n\nAffairs endure, and so too does intent—\nYet amid them, a single moment stands strongest.\nAct in accord with the times, without negligence,\nAnd return home in brocade to pay homage to father and mother.\n\nThe Sage’s Intent declares:\nOne’s nature is reverent and faithful, never slighting the gods.\nConduct is upright and just, never deceiving others.\nWhen others harbor resentment, it rebounds upon oneself.\nHow much better to seek stillness and preserve one’s true nature?\nDo not pursue new schemes—maintain the old, and renewal will follow.\n\nFor wealth: ordinary transactions and stocking goods are inauspicious; expenditures bring no good.\nFor litigation: inauspicious. For farming: observe the seasons.\nFor travel: unfavorable. Travelers have not yet arrived.\nFor illness, regardless of age: prolonged suffering requires patience;\nIn urgent cases, recovery is difficult—pray for blessings and protection.\n\nThe pox likewise follows this pattern.\nFor marriage and entering a household: mediocre prospects for heirs.\nLost items will reappear with patience.\nPurchasing fields, houses, servants, or livestock should be delayed in completion.\nSeeking office or promotion brings honorable status; the household is at peace.\nPlans and undertakings come to fruition—proceed with patience, not haste.\nChildbirth requires calm; difficulties will pass.\nBorrowed items will not be repaid.\nLearning medicine or crafts demands patience.\nMoving is unfavorable; documents will be delayed.\nBusy yet unsettled in heart, tilling the fields with little strength.\nWait for the right time—then use it.\nWhen clouds disperse, the moon is reborn.\n\n[Missing character] Fourteenth: Most Inauspicious\nRestlessness\nRight and wrong blur in clamorous strife; lawsuits drag on without cease.\nWealth scatters, people part, and hardships multiply.\nPreserve yourself, avoid harm, and reduce blame.\nDragons and snakes intermingle, difficult to restrain;\nThe scales of wind and cloud have yet to transform.\nOne day, riding clouds to return to the Northern Sea,\nOnly then will the dragon’s true form appear.\n\nHearing the road is perilous makes the journey seem hard—\nYet you say it is hard, but it is not.\nBetter to set out, cross the waters,\nAnd return home to find all settled and safe.\n\nThe Sage’s Intent declares:\nEntangled in right and wrong, contending in litigation.\nPeople part, wealth scatters, losses are hard to recover.\nDo not covet action—preserve your wholeness.\nTravel is unfavorable; marriage has no affinity.\nThe sick have not recovered—pray to Heaven.\nAbide by constancy and duty to avoid misfortune.\n\nFor business: stocking goods is inauspicious; selling is favorable.\nLitigation brings no trouble; the sick will lose wealth—\nAppease the earth and perform blessings for protection.\nFarming yields no harvest.\nTravelers will arrive soon; journeys are unfavorable—beware of disaster.\nLost items are hard to find and will not be seen.\nTransactions are unfavorable.\nMarriage is unfavorable; purchasing fields, houses, servants, or livestock is inauspicious.\nDocuments lack qi alignment; borrowed items will not be repaid.\nThe household and its members are restless.\nSeeking office or promotion will not succeed.\nMoving is unfavorable; relying on others for matters is inauspicious.\nChildbirth endangers mother or child—neither is favorable.\n\nAnxious as if accused of wrongdoing,\nBewildered, the right path is lost.\nA fine lady draws water from the well,\nBut the basket and pipe return empty.\n\n[Missing character] Fifteenth: Most Auspicious\nUpholding Integrity, the Year’s Virtue\nMatters should be settled in accord with Heaven’s design—\nDo not heed the diviner’s or shaman’s disputes.\nFollow the great Dao with rectitude,\nAnd your household will naturally shine with radiance.\n\nThe moon, full tonight, departs the sea’s edge;\nPeople gaze in admiration at the beauty of spring.\nWhere its pure light gleams, the stars retreat—\nThe nobleman’s schemes secure office.\n\nLast year, you dwelled here in leisure;\nToday, you return as if to an old friend.\nIt is good to seek wealth and abide in fortune—\nThough petty men have been driven away by the wicked.\n\nThe Sage’s Intent declares:\nA heart that accumulates goodness, though long obstructed, will not be denied.\nSeeking gods or divination is reckless and vain.\nUphold integrity and constancy—do not weary of hardship.\nGreat vessels are late in completion; the time will come when all aligns.\nIn pursuit and planning, all affairs will prosper.\nThe sick will recover—do not seek external illusions.\n\nFor wealth: business is auspicious; selling goods is favorable.\nFarming yields a late, modest harvest.\nPurchasing fields, houses, servants, or livestock is auspicious after delay.\nTravel should wait for an auspicious day at the solar term;\nTravelers will arrive on the 1st, 8th, 15th, or 23rd.\nRelying on others for matters is difficult at first, then easy.\nIllness is from cold damage—regardless of age, recovery comes after the solar term.\n\nFor pox and sores, preserve blessings and maintain stability—if consulted by a woman, the prognosis is poor.\nMarriage will be delayed or disrupted; a second marriage may bring discord. Seeking heirs will be auspicious after delay.\nLitigation is favorable; lost items will be found at the solar term, though no news arrives beforehand.\nPlans and accomplishments will succeed if timed to the solar term, though later gains will be modest.\nRelocation is auspicious after delay; documents will arrive late.\nSeeking office or promotion will be finalized and complete at the solar term.\nChildbirth on the solar term will bring a noble son.\nHousehold and family remain stable; borrowed items will be returned late with minor issues.\nJade and stone remain indistinct—anxiety deepens into doubt.\nAhead lies the great Dao’s thoroughfare, yet blossoms bloom on withered branches.\n\n◇◇　Hexagram Sixteen　Most Inauspicious　Hold to One’s Role\nTreading perilous heights, one meets starving tigers;\nCrossing waters by boat, one drowns in raging waves.\nHold to your role and remain at ease—disaster may yet pass.\nRepay kindness and toil with gratitude.\nOil lamps flicker and dim, barely lit before fading.\nLong wicks burn out in vain effort—\nBetter to withdraw early and return home.\nIn seeking wealth, know the true essence;\nOnce grasped, great fortune follows.\nThree days of high prices, then none—\nAll returns to earth with a single thunderclap.\n\nThe Sage’s Intent:\nAbandoning roots for branches, indulging in greed and excess,\nOne meets tigers on land, sinks with boats at sea.\nBetter to uphold the old and repay kindness—\nMoss withers beneath the heavens, long illness gradually eases.\nNothing fares well; forgetting brings added sorrow.\nRecognize faults and amend them—\nThen may one pass through spring and autumn safely.\n\nFor wealth: solo business ventures are inauspicious; purchasing goods is unfavorable, but selling is auspicious.\nLitigation will resolve without incident, though disputes may follow completed transactions.\nTravel is inauspicious; travelers will arrive soon—if delayed one or two days, misfortune or ominous events may occur.\nRelocation is unfavorable; the elderly may suffer prolonged illness, while the young should cultivate virtue to avoid misfortune and seek ancestral protection.\nMarriage brings discord upon entering the household; protect the household and family from misfortune.\nRelying on others for matters will fail; livestock will not appear, and news will be hard to find, with disputes arising.\nChildbirth is difficult—protection is needed.\nSeeking office or promotion will not succeed.\nTo find fortune, cross towering mountains—\nYet returning home may bring sorrow.\nMoonlight shines on a moored boat,\nBut who knows the chill and desolation?\n\n◇◇　Hexagram Seventeen　Most Inauspicious　Await the Time and Turn to Goodness\nWorry, danger, and calamity arise from whence?\nPlans repeatedly fail, bringing further financial loss.\nThe young need not fear prolonged stagnation,\nBut the elderly must guard against sorrow’s onset.\nPast triumphs now turn to loss;\nToday’s fears prove unfounded.\nIf one encounters a noble’s aid and support,\nA thousand-year withered tree may sprout new branches.\n\nThis matter presses like the wind—\nA day or two may shift with the west or east.\nIf delayed three days, sorrow arrives;\nAct at once when the time is right.\n\nThe Sage’s Intent:\nBuilding in the four directions offends the Earth’s domain.\nAvoid disaster and peril—prolonged recovery follows.\nThe elderly and ill should not linger;\nChildren face no immediate danger.\nSwiftly perform exorcisms and offerings—\nThen may one recover in due order.\nPlans and marriages will succeed after delay.\nAll affairs falter—better to accept rise and fall.\n\nFor business: immediate profit is possible; purchasing goods or food is highly auspicious, and selling is favorable.\nCrops will sprout but not flower; travel is inauspicious.\nTravelers abroad for many days will arrive late with obstacles.\nIllness in the young or old offends the earth—seek the departed swiftly; the elderly may not recover.\nPox and sores will resolve late—consult the seventy-two seasonal markers.\nLost items are hard to find; documents will not proceed.\nFirst marriages succeed after delay; second marriages bring misfortune upon entering the household.\nSeeking heirs is auspicious after delay; borrowed items will be few; trade is unfavorable.\nLitigation is favorable; purchasing fields, houses, or servants is inauspicious.\nRelocation is unfavorable; plans and accomplishments will not succeed.\nChildbirth should proceed swiftly—delay risks protection.\nRelying on others for matters will succeed; seeking office or promotion is favorable.\nMeeting nobles is auspicious; acupuncture and moxibustion are better delayed, though still beneficial.\nDark clouds gather thickly—\nSeeking rank has not yet borne fruit.\nBuilding in the four directions offends the earth—\nPerform blessings to ensure peace.\n\n◇◇　Hexagram Eighteen　Moderately Auspicious　Follow Circumstances\nThe time calls for gathering and storing—act in accord with circumstances, seek nothing beyond.\nThe elderly and long-ill require protection;\nAffairs in late winter and early spring will proceed smoothly.\nYou have nurtured them through long months,\nYet opening the cage, their intent remains unseen.\nPerhaps they linger by an autumn river—\nWhere to find them amid moonlit reeds?\n\nHold to your role and remain at ease—affairs will proceed well.\nIn seeking wealth, profits will repay your efforts.\nIn moderation and goodness, you will find much joy;\nA single day’s abundance arrives just in time.\n\nThe Sage’s Intent:\nPlans and hopes are suited to spring and summer;\nIn autumn and winter, all endeavors should cease.\nPray for the recovery of the elderly and ill;\nOn the road, avoid delay.\nFor all plans and hopes,\nSpring and summer are the time to seek.\nIn autumn and winter, if pursued,\nAll affairs will come to naught.\nThe elderly tend toward illness—\nPrayers and offerings should be made.\nLong journeys require protection—\nThen may one avoid delay.\nAct in accord with the time;\nPray for blessings to avert sorrow.\n\nFor goods and wealth: spring and summer are auspicious; sell goods as circumstances allow.\nFarming will yield a harvest; litigation in spring and summer resolves without incident, but autumn and winter are unfavorable.\nProlonged illness is lighter in spring and summer; in autumn and winter, the elderly face difficulty, while the young fare lightly.\nPerform blessings and fulfill good vows.\nPox and sores are auspicious in spring and summer, inauspicious in autumn and winter.\nTravel may proceed at once; travelers will arrive in three days in spring and summer, but face obstacles in autumn and winter.\nMarriage brings discord upon entering the household; seeking heirs is auspicious in the first half of the year, inauspicious in the latter half, with potential disaster.\nDocuments are unfavorable; trade is unfavorable.\nPurchasing fields, houses, or servants is inauspicious; lost items are hard to find.\nHouseholds face misfortune; borrowed items are available in the first half of the year, but not in the latter.\nRelying on others for matters is auspicious in the first half of the year, inauspicious in the latter.\nRelocation is auspicious in spring and summer.\nChildbirth will bring a noble son; autumn and winter births pose no harm.\nPlans and accomplishments will succeed; sell goods promptly, and purchase goods in spring.\n\nFrom this point onward, fortune constantly smiles; the household prospers and receives protection.\nAt the year’s end, favorable encounters arise—only then may grand plans succeed.\n\n◇◇ 19 ◇◇ Most Auspicious ◇◇ Fine Wood Meets Spring\n\nA hundred blessings stir as earth meets spring’s return,\nWarm breaths revive, all things assume their freshest mien.\nShould fortune align with this season’s radiant scene,\nBehold the long-delayed dawn of fragrant days unfold.\n\nClouds drift and rain descends in spring’s deep embrace;\nAll schemes and wealth-seeking find their heart’s desire.\nDisputes with officials yield just outcomes fair,\nWhile noble ones seek joy and blessings in their wake.\n\nHeed not the clamor of others’ praise or blame—\nThough gains may come, they lack true strength or height.\nPursue fresh ventures for profit’s sure delight;\nThe days ahead shall shine with boundless, bright success.\n\nThe Sage’s intent declares:\nCast off the old and welcome the new; life flourishes in vibrant growth.\nPlans come to fruition; promotions and fame are secured.\nTravelers journey smoothly; lawsuits incur no penalty.\nShould autumn or winter bring delay, all matters stall in hesitation.\nSpring and summer divinations prove auspicious; undertakings flow unhindered.\nPregnant women remain at ease, free from distress or fright.\n\nFor wealth: trade and sell in spring and summer; purchasing goods in spring is favorable.\nThe twelfth month is also good; other months are not advised.\nSelling goods may be slow; lawsuits resolve without incident.\nFor farming: spring planting yields modest autumn harvests.\nBorrowed items are available in spring; other months prove useless.\nTravel is auspicious; for travelers, spring divinations favor departure—other months delay action.\nIllness in the young or old finds relief in spring, summer, or the tenth month; other months bring slow recovery.\nDocuments fare well in the first, second, and tenth months; other months delay progress.\nFirst marriages are auspicious; remarriage is inauspicious. Seek heirs swiftly.\nHouseholds and family members remain at peace; spring and the tenth month are favorable—other months are unsuitable.\nPlans and accomplishments thrive in the first and tenth months, bringing financial fortune; other months bring dissatisfaction.\nRelying on others for matters is auspicious in spring and the tenth month; other months prove useless.\nChildbirth in spring yields a noble son; autumn and winter births are inauspicious.\n\nEndless snow envelops all,\nYet tender willows meet spring’s call.\nAll schemes unfold in such a way—\nGold’s luster gleams with radiant sway.\n\n◇◇ 20 ◇◇ Most Inauspicious ◇◇ Peril and Void\n\nIn haste, one seeks the gods with forced sincerity,\nYet such devotion fails to move the divine.\nFacing peril, one fears no safety can be found;\nAll hopes dissolve—success remains beyond reach.\n\nA boat without oars drifts helplessly,\nSwept by currents toward the boundless sea.\nAlas, how many souls are led astray,\nWandering east and west in vain pursuit.\n\nThose who act find their affairs unfulfilled;\nOnce achieved, they swiftly turn away.\nIf you seek this fate, all proves inauspicious—\nOnly through divination may peace be secured.\n\nThe Sage’s intent declares:\nHuman hearts grow lax, defiling the sacred with impurity.\nPeril and danger loom; illness lingers in hesitation.\nPlans falter; marriages fail to form.\nOnly through reverent offerings may protection be secured.\nLawsuits end in defeat; trade brings sorrow.\nTo seek fortune in travel, swiftly appeal to the heavens above.\n\nFor wealth: purchasing few goods is auspicious; sell promptly when possible.\nLawsuits face obstruction; marriages prove favorable.\nMost matters conclude, but avoid planting crops.\nIllness stems from disrespect to household deities—obstacles weigh heavily.\nOffer prayers for blessings; prolonged suffering may ease, turning from grave to mild.\nBeware of further affliction. Travel is inauspicious; travelers have not yet arrived.\nPurchasing fields, houses, or servants may succeed, but gains will not endure—all proves unfavorable.\nLost items are hard to recover; relying on others brings no result.\nDocuments lack substance; households and family members know no peace.\nBorrowed items are unavailable; seeking office or promotion meets no success with superiors.\n\nFor fields and homes: spring planting brings light autumn yields.\nBorrowed items are available in spring; other months prove useless.\nTravel is auspicious; for travelers, spring divinations favor departure—other months delay action.\nIllness in the young or old finds relief in spring, summer, or the tenth month; other months bring slow recovery.\nDocuments fare well in the first, second, and tenth months; other months delay progress.\nFirst marriages are auspicious; remarriage is inauspicious. Seek heirs swiftly.\nHouseholds and family members remain at peace; spring and the tenth month are favorable—other months are unsuitable.\nPlans and accomplishments thrive in the first and tenth months, bringing financial fortune; other months bring dissatisfaction.\nRelying on others for matters is auspicious in spring and the tenth month; other months prove useless.\nChildbirth in spring yields a noble son; autumn and winter births are inauspicious.\n\n◇◇ 21 ◇◇ Most Inauspicious ◇◇ Stagnation and Delay\n\nFine jade and bright pearls are not easily won—\nTheir blessings align with past merits long sown.\nTo grasp the truth of fate’s rise and fall,\nOne frets in vain, graying before their time.\n\nA fish transforms into a roc, riding ocean waves,\nAs yin and yang harmonize in times of peace.\nEven common folk may harbor lofty dreams—\nA thunderous roar from flat ground stirs all anew.\n\nThe present scene is fraught with hardship’s weight;\nEach day, one seeks to shed the old for change.\nTrade and wealth slip ever out of reach—\nYet in your heart, let no despair take root.\n\nThe Sage’s intent declares:\nAccumulated virtue brings blessings to the household.\nAccumulated vice invites calamity to the door.\nAll follows nature’s course—why sink into despair?\nHeirs are hard to secure; all undertakings falter.\nBegin nothing new; guard your heart and wait.\n\nFor wealth: trading old goods is favorable; selling proves inauspicious.\nFarming yields blossoms but no fruit.\nTravel is inauspicious; travelers arrive ill.\nFor illness, young or old, the next day or two may bring relief—delay brings difficulty. The same holds for pox.\nMarriages are auspicious; seeking heirs is inauspicious.\nTrade is hard to conclude; lawsuits prove favorable.\nPurchasing fields, houses, servants, or livestock is inauspicious. Lost items are hard to recover.\nPlans and accomplishments prove inauspicious.\nChildbirth is difficult; borrowed items are unavailable.\nLearning crafts is inauspicious; seeking office or rank meets no success.\nRelocation is inauspicious; relying on others for matters brings no result.\nDocuments remain unresolved.\n\nA moon veiled by dark clouds drifts,\nNo distant paths lie ahead.\nWealth brings loss; misfortune lingers—\nIllness yet finds no cure.\n\n◇◇ 22 ◇◇ Greatly Auspicious ◇◇ Later Fortune\n\nOne refines their craft with diligence, mastering knowledge deep,\nTheir nature as clear as still waters, profound and bright.\nLong cherished treasures hold boundless worth—\nOnly when sold does their true value shine.\n\nA phoenix takes flight from the forest,\nSpreading its wings to soar above all birds.\nOne day, it ascends to the imperial court,\nAdmired and renowned in every land.\n\nSpur the horse on the long road ahead,\nReaching the capital in a day or two.\nIn the imperial city, a carefree guest—\nEarly arrival secures office, fate’s design.\n\nThe Sage’s intent declares:\nThrough steadfast study, one’s talents remain unrecognized—\nLong mired in hardship, plans fail to unfold.\nYet when the time comes, old paths lead to renewal,\nLike withered wood blooming anew.\nNo need for distant worries—all matters shall succeed.\nLawsuits bring peace; all actions align with desire.\nPlans come to fruition; all endeavors prosper.\n\nFor wealth: trade and sales yield modest gains in the present.\nPurchasing goods brings light profit; selling may be slow.\n\nThe traveler arrives; lawsuits are auspicious. Journeys are unfavorable—illness for the elderly and young, though grave conditions pose no harm. Smallpox and sores remain stable. Farming yields blossoms but no fruit; marriage and seeking heirs are inauspicious. Purchasing fields, estates, servants, or livestock is favorable; household and family remain at peace. Plans and accomplishments fare better if delayed. Lost items will be found after a long time; borrowing brings delayed fortune. Trade prospers; relocation is better postponed. Childbirth yields a son, auspicious and bright. Seeking medical treatment or education fares better later; pursuing office or promotion brings distant great fortune. Documents and correspondence are most favorable if delayed; transactions should be swift, as delay brings misfortune.\n\nAt first, change meets resistance, but light emerges as the Dao aligns and flows. Official documents, imperial posts, and stipends reach fulfillment, bringing joy and abundant years.\n\n□□ Twenty-Third: *Moderate Balance* – *The Image of Temporal Obstruction*\nThings remain, yet people change—let go of attachments,\nLest grievances and lawsuits turn to mutual provocation.\nThough the heart shines bright as a mirror,\nHow can one endure when fortune’s hour has not yet come?\n\nPeach trees planted fill the eastern courtyard,\nTheir blossoms battered by rain and wind.\nOnce hoped for fruit to savor,\nNow all that remains is emptiness.\n\nHow wondrous the immortal’s art—\nIf you pursue it, you’ll transcend the world.\nWhen the Dao’s fruit ripens and the elixir is refined,\nThe golden gate opens at the appointed time.\n\nThe Sage’s intent declares:\nThe hour is obstructed, the fate adverse—\nMany troubles, many disputes,\nAll exhaust the heart and mind,\nYet who pities your woes?\nHold fast to the old and await the turning of the times.\nFirst misfortune, then fortune;\nPlans and hopes are delayed.\nSeeking marriage brings distant success;\nLitigants face no danger.\nIn all matters, proceed with patience—\nWhy harbor doubts?\n\nFor wealth: the later the trade, the greater the profit. Purchasing goods is favorable; selling may be slow but ultimately good. In all affairs, remain still and steady. Journeys are safe; the traveler has not yet arrived. Hesitation without action brings obstruction; lawsuits are best settled through mediation. Illness in the elderly—colds and lingering ailments—pose no grave threat; smallpox and sores bring good fortune. Purchasing fields, estates, or servants is auspicious if delayed; household and family remain at peace. Lost items are hard to recover; plans and accomplishments face initial difficulty but later ease. Relocation is favorable; seeking office or rank brings eventual great fortune. Documents and correspondence face delay but later succeed; borrowing is possible, though entrusting others fares better later.\n\nLonging for the bright moon,\nIt waxes full, then wanes again.\nIntentions may bloom like spring,\nYet in the end, all warmth fades.\n\n□□ Twenty-Fourth: *Supreme* – *Receiving Blessings and Fortune*\nA person of wealth and power, favored by auspicious spirits,\nAll actions proceed as the heart desires, naturally trusted.\nBoldly venture into the tiger’s den,\nAnd in time, you shall inherit the dragon’s pearl.\n\nThe bright moon hangs in the sky, illuminating all,\nIts radiance dispelling every darkness.\nAll plans flourish; the household thrives—\nThis is the time for glory and prosperity.\n\nIf you speak of this matter, it must be praised,\nYet entrusting it to others leads astray.\nHasten to cultivate the heart and retreat to the mountains,\nTo escape the world’s entanglements, tangled as hemp.\n\nThe Sage’s intent declares:\nBy nature bold and proud,\nYou favor lofty heights.\nDivine spirits aid your cause;\nProfit and integrity are upheld.\nYour conduct commands respect;\nLawsuits bring no toil.\nA noble son is born,\nAnd all things flow abundantly.\nThe sick recover swiftly;\nHopes are soon fulfilled.\nPlans come to fruition;\nPromotions and advancements rise.\n\nFor wealth: merchants of rank and title gain full advantage; common folk should avoid purchasing goods, though selling may be slow. In marriage, entering the household brings one of stern and impatient temperament, difficult to approach at first, but later ensuring long-term fortune. Documents and correspondence are auspicious; journeys bring wealth and honor. For common folk, no advantage; the traveler has not yet arrived. Illness in the elderly and young brings pain but slow recovery without harm. Borrowing is unlikely; plans and accomplishments face initial difficulty but later ease. Lost items are hard to recover; transactions succeed well. Trade ventures prosper; seeking office or promotion brings great fortune. Entrusting others with tasks faces initial difficulty but later ease.\n\n□□ Twenty-Fifth: *Most Inauspicious* – *No Disaster Unmet*\nFortune meets misfortune; blessings are scarce—\nFlee and hide, do not act lightly.\nMerchants and traders should adhere to the old ways;\nWatch for schemes that show only promise.\n\nHopes for success fall short of your desires;\nThe path to high office grows ever distant.\nRemaining patient and steadfast is the true fortune—\nIn time, glory will surely appear.\n\nOne day, your affairs may seem praiseworthy,\nBut in the long run, they lead to wealth and splendor.\nSome fail, some succeed—how many things are so?\nThough the melon may be large, it remains sweet or bitter.\n\nThe Sage’s intent declares:\nThe hour is adverse, fate obstructed—\nBest to retreat and hide.\nForced efforts bring no lasting labor.\nJourneys risk bandits; the elderly toil in vain.\nFarming yields no harvest; marriages bring endless chatter.\nHold fast to the old; do not cling to ambitions.\n\nFor wealth: trade when goods are available, but selling is slow. Farming yields shoots but no harvest; the sick do not recover; smallpox brings misfortune. Journeys are unfavorable; the traveler arrives. Trade ventures fail; relocation is inauspicious. Marriages face much talk but no success; lawsuits are unlucky. Transactions are difficult and unstable. Purchasing fields, estates, servants, or livestock is only favorable if they are your original property—otherwise, no benefit. Plans and accomplishments are unfavorable and, if achieved, short-lived. Lost items are hard to recover; borrowing brings little success.\n\nChildbirth is difficult to preserve, yet no harm comes; entrusting matters to others brings completion. Households and family members find little peace; documents and omens do not proceed smoothly. Seeking office or promotion leads to appointments of short duration.\n\n[Missing characters] Twenty-Sixth: Moderation\nImpartial and Selfless\n\nHeaven-sent disasters and clashing calamities arise by fate’s decree;\nIn vain one holds sincere devotion to move the heavens above.\nGood fruits and karmic conditions are silently ordained—\nNo room for private desires to ensure safety.\n\nDwelling in peace brings prosperity and increasing wealth;\nClouds gather in the sky, the earth quakes with thunder.\nRank and position ascend to glorious heights;\nHonor, wealth, and nobility enter the gate.\n\nAbiding in the Dao, one dimly perceives great wealth;\nOpportune actions need not be doubted.\nIf divining official matters within this,\nOne may not reach the prefecture but will surely attain the court.\n\nThe Sage’s intent declares:\nHeaven’s disasters come in many forms—endure them without falsehood.\nThe divine and upright admit no flattery.\nSmallpox requires no medicine; evil does not heed shamans.\nLawsuits should be pursued; early schemes are hard to contrive.\nPlans should not be acted upon; marriages are not yet favorable.\nBetter to hold fast to the old, lest one suffer petty troubles.\n\nDivining wealth: No profit in acquiring goods; selling is slow.\nFarming yields half a harvest; marriages bring in-laws, but seeking heirs is inauspicious.\nIllness afflicts the Northern Dipper; vows and good wishes for young and old\nlinger for many days before relief. In cold conditions, recovery comes after eighteen days of sweating;\nthe elderly may die at the edge of survival.\nJourneys are unfavorable; the traveler arrives.\nRelocation is inauspicious; lawsuits are unlucky.\n\nFavorable for purchasing fields and houses, and for population growth; unfavorable for livestock. Documents are auspicious, but success may not be achieved. Households and family members are unsettled; plans and undertakings remain unrealized. Learning arts and crafts is inauspicious; seeking office or promotion in rank is unattainable. Lost items are difficult to find; childbirth is fraught with difficulty. Relying on others brings no benefit; transactions are hard to conclude. The body becomes a wanderer of Penglai, a lone boat shunning distant voyages. Wealth and nobility are predestined by heaven, yet windless waves turn treacherous.\n\n**Hexagram Twenty-Seven: Utmost Adversity (向善)**\nWith nets spread and snares set, intent fixed,\none drives and schemes across the Central Plains.\nKnowing only self-interest, demanding bribes,\nwho could foresee that words would bring disaster to the door?\nHouseholds are restless, the master uneasy—\nall due to ancestral misfortunes bringing calamity.\nBest to perform blessings and seek exorcism,\nand thank the household gods for their service.\nThough affairs seem peaceful, wealth comes slowly;\ncrossing rivers and mountains yields meager profit.\nOnly after long effort will true gain appear—\neven then, excess is unnecessary.\n\n**The Sage’s Intent:**\nHuman hearts are perilous; things rest uneasy in their cages.\nKnowing only harm, how can one preserve the old?\nAll affairs are inauspicious; do not evade misfortune.\nFor now, seek respite; honor good deeds.\nThe sick grow worse; lawsuits yield no success.\nIn all matters, patience brings resolution.\n\n**Divining Wealth:**\nBuying and selling should be swift; acquiring goods is favorable, and selling is smooth. Farming yields nothing; neither high nor low ground is profitable. Lawsuits are auspicious; journeys are favorable. The traveler arrives within one or two days; if not, the elderly and young may fall ill. Vows to the Northern Dipper and good wishes are auspicious; smallpox subsides. Early remarriage, entering a household, or seeking heirs is highly auspicious. Childbirth yields a son; a daughter brings false alarms. Commerce is favorable; buying fields, houses, or livestock incurs loss without benefit. Plans and undertakings should proceed without hesitation; seeking office or promotion should be swift. Relocation is auspicious; documents arrive promptly. Relying on others brings quick success; lost items remain unseen. Households and family members are at peace.\n\nWheels turn with heavy loads;\nmeeting oxen risks financial loss.\nWorries have not yet passed,\nwhen mourning garments arrive again.\n\n**Hexagram Twenty-Eight: Moderate Stability (谨守)**\nDisasters and sorrows stir, yet no harm befalls—\nstrengthen your defenses and act with goodness.\nDo not seek long-term plans from relatives;\nschemes and cunning are but ordinary.\nNoble patrons offer new assistance;\nofficial troubles and gossip leave the household.\nThe sick recover health;\nhopes and quests for wealth transform entirely.\nEntrusting others with your affairs,\nturn back early to gaze upon your homeland.\nBest to safeguard yourself—\ngreed will surely invite disaster.\n\n**The Sage’s Intent:**\nMinor misfortunes gradually clear, not yet harming others.\nBe vigilant early; do not procrastinate.\nLawsuits are lost; the sick sink deeper.\nMarriages are half-successful; aspirations turn to dust.\nOnly by honoring blessings does one gain renewal.\n\n**Divining Wealth:**\nBuying and selling should conclude early and fairly; farming yields no harvest. Journeys are inauspicious; the traveler has not arrived. Relocation is unfavorable; the sick should take medicine. Performing good deeds is auspicious; lawsuits are favorable. Marriage, entering a household, or seeking heirs is auspicious, though a wife may not live to old age. Buying fields, houses, or livestock is inauspicious; selling goods should be prompt. Commerce is unfavorable; documents should be handled early. Borrowing leads to loss; transactions are difficult to conclude. Relying on others is inauspicious. Households and family members should pray for protection.\n\nBeneath the bridge, water flows away;\nfrom the stove, smoke curls long.\nPreserve well-being by performing blessings—\nexorcisms avert calamity.\n\n**Hexagram Twenty-Nine: Supreme Prosperity (亨通得财)**\nHidden traces shift and transform;\ngrace and favor descend from ancestral masters.\nOne day, fortune is grasped and power held—\nblessings flow endlessly, elevating generations.\nWhen yin and yang align, affairs prosper;\nlike one walking beneath the moon.\nLute and zither harmonize, the household thrives—\nglory, wealth, and nobility arise daily.\n\nTen years of study beneath the window,\nthe imperial examination summons the worthy.\nSwift as the wind, two days’ journey—\na third day’s travel, and recognition fades.\n\n**The Sage’s Intent:**\nLong misfortune turns to fortune; long stagnation gradually opens.\nReceiving favor from above, power is firmly held.\nLitigation succeeds; plans and ventures strike true.\nMarriages bring benefit; joy abounds.\nThe sick recover slowly; transactions proceed smoothly.\nDo not cling to the old, lest sorrow linger.\n\n**Divining Wealth:**\nBuying and selling yields three to five parts profit;\nacquiring goods is helpful, and selling is prompt.\nFarming is auspicious; journeys should be swift.\nThe traveler arrives; commerce is profitable.\nThe sick, young and old, recover slowly; lawsuits are inauspicious.\nMarriage is auspicious; relocation should be swift and favorable.\nBorrowing should be prompt and successful; households and family members are at peace.\nPlans and undertakings gain noble assistance; seeking office or promotion receives support from superiors for appointment.\nLost items are quickly found; documents carry auspicious signs.\nChildbirth yields a noble son; if a daughter, she is a Venus, auspicious.\nTransactions conclude swiftly with profit; relying on others meets noble patrons.\nDigging a well in the right location taps into earthly springs, bringing good fortune.\n\nA jade stained by heaven’s blue,\nthe fields of Lan glow with new vitality.\nMeeting in court or countryside,\nsoon crossing the river together.\n\n**Hexagram Thirty: [Fragment Incomplete]**\n\n**Hexagram Thirty: Most Inauspicious (Void and Doomed)**\n\nLitigation drags on, aspirations unfulfilled;\nwasted wealth and labor, vain and fruitless strife.\nPlan early for virtuous deeds to cultivate distant blessings—\nlest delay bring suffering and weariness to others.\n\nFlowers in full bloom meet night-long rain;\nthe moon at its brightest is veiled by clouds.\nRemember: peach and plum must not mock one another—\nthe day clouds part will come in time.\n\nKnow this: affairs within demand caution,\nyet on this day, clouds part to reveal good fortune.\nIf you divine for three or four days hence,\nswift preparation will ensure success.\n\n**The Sage’s Counsel:**\nLitigation entangled, lost causes drain wealth.\nPursue goodness to avert misfortune and calamity.\nPlans and hopes come to naught; marriages fail.\nAll undertakings are ill-advised; merchants return empty-handed.\nMovement or action invites disaster and peril.\nThe ill recover slowly, with sorrow likely.\n\nFor wealth: trade swiftly—delay brings no profit,\nand goods purchased may spoil.\nFarming should not begin too early.\nMarriage into a household is unfavorable; seeking heirs brings no luck.\nRelocation is ill-advised; travel risks bandits—divine again another day.\nThis hexagram offers little use.\n\nTravelers have not arrived; trade is unprofitable.\nMany voices offer counsel, but ventures fail.\nRelying on others yields no success; documents lack auspicious signs.\nLitigation finds no resolution—seek harmony.\nThe ill should fulfill vows swiftly.\nDo good to avert household misfortune; official matters conclude quickly.\n\nPurchasing land, homes, servants, or livestock is unfavorable.\nDisentangling from affairs brings relief, but plans fail.\nBorrowing is uncertain; the household should perform virtuous deeds.\nPregnancy requires good works for protection; seeking medical or artistic skills is unwise.\nSelling goods is unprofitable; seeking office or promotion, even if achieved, brings no advantage.\nAll matters are inauspicious.\n\nTwo ox tails cross ahead—entanglements breed strife.\nWhen shall distress be lifted? Only when the rat appears will peace return.\n\n[Missing characters] Hexagram Thirty-One: Great Auspice, Uprightness\n\nServing the public, upholding the law without shirking toil,\nFrom this, one’s qi and character soar high.\nNaturally, conduct and retreat align with Heaven’s principle—\nHow could the slightest flaw corrupt one’s steadfast integrity?\n\nHeart’s affairs surge restlessly, never at ease;\nScarcely settled, unease returns again.\nAll undertakings remain unfulfilled,\nLike the bright moon veiled behind clouds.\n\nThis matter is middling—difficult to accomplish;\nEven when achieved, it brings no satisfaction.\nIf divining official matters, they shall ultimately dissolve;\nFor merchants seeking profit, gains will be slight.\n\nThe Sage’s intent declares: Uprightness accords with principle, eschewing crookedness.\nIn litigation, one gains the multitude—Heaven’s blessing extends afar.\nThough minor distress may arise,\nHow could it mar one’s flawless virtue?\n\nAction brings harmonious fortune,\nEver advancing toward prosperity.\nIn all dealings, one enjoys smooth passage,\nAnd joy is met with greater glory.\n\nDivining one’s own wealth:\nOriginally three or five parts remain.\nInvest in goods—selling brings swift release.\nFarming yields harvest; litigation finds no trouble; travel is auspicious.\nThe traveler has not arrived but sends word; lost items will not be found.\nHousehold and family are at peace.\nIn marriage, heed not others’ words—benefit and good fortune lie ahead.\nRemarriage brings illness.\nSeeking heirs benefits the old and young alike; no harm to fields, homes, servants, or livestock.\nA minor loss is certain, yet success follows.\nIn divination, matters achieve authority and good fortune.\nPregnancy bears a noble son; trade requires effort but prospers.\nRelying on others meets obstruction, but later proves advantageous.\nMoving brings no benefit—staying put is auspicious.\nSeeking medicine or engaging in trade brings great fortune.\nBorrowed items are swiftly returned, though a minor loss follows.\nSeeking office or promotion meets obstruction, but later proves auspicious.\n\nThe room of peril now becomes a nest of change—\nThe osprey and roc transform.\nThe roc soars a hundred thousand li,\nYet soon encounters the azure sky.\n\n[Missing characters] Hexagram Thirty-Two: Supreme, Unworried in the Year’s Cold\n\nWiping tears, sighing often for distant news long sunk,\nIn vain, one consults ancient divination for glad tidings.\nDo not let strange dreams breed needless worry—\nThe pine and cypress, steadfast in their resolve, hold true within.\n\nThe stars encroach upon the moon—beware of trouble ahead,\nMinor ailments bring misfortune, heralding calamity.\nYet if one knows and calls out halfway,\nPreemptive offerings to heaven may avert disaster.\n\nSettling down yet planning to leave the neighborhood,\nTrade and ventures lie far away.\nRelying on Buddha and gods brings fortune—\nSeek the temple halls and shrines for success.\n\nThe Sage’s intent declares:\nLong a wanderer at the edge of the sky,\nKinfolk sigh in sorrow.\nThough thoughts pour out in vain,\nOne finds peace and joy alone.\nPlans align with fortune,\nLivestock thrives.\nMarriages harmonize,\nLawsuits bring praise.\nFirst inauspicious, then auspicious—\nAll affairs proceed without error.\nThe ill need not worry,\nFortune and longevity extend far.\n\nOn wealth: trade yields two or three parts profit,\nGoods bought are fine, goods sold are fine.\nFarming brings harvest,\nLawsuits are auspicious,\nIllness spares none—old and young grow grave.\nThe young should do good deeds—\nMarriage remains unobstructed,\nEntering a household to seek heirs may not succeed.\nThe household suffers minor losses,\nUnrest calls for virtuous protection.\nBuying fields or homes brings minor losses first, then success.\nPlans and actions face small setbacks at first,\nNo harm in borrowing,\nSeeking medicine or craft brings good fortune.\nPregnancy proceeds smoothly and auspiciously,\nLost documents or items will be found,\nMoving brings good fortune.\nSeeking office or promotion meets success—trade flourishes.\n\nA lone leaf skims the misty waves,\nThe boat sails with the current.\nWealth comes from afar,\nAll undertakings prosper in due course.\n\n---\n\nHexagram Thirty-Three: Great Auspice—Bearing Blessings Beyond the Dust\n\nLush clouds and mist renew the scene,\nThe courtyard thrives, joyful as spring.\nContentment brings the blessing of heirs,\nMerchants chance upon rare treasures.\n\nThe newly sharpened dragon sword gleams sharp,\nIts mighty qi surges, unmatched by the ox.\nNow held in hand,\nEven heroes appear ordinary.\n\nConsulting at dawn brings fortune,\nSeeking after meals yields no favor.\nAll matters follow this truth—\nFame spreads across the four seas, winning praise.\n\nThe Sage’s intent declares:\nVirtue flourishes, blessings abound,\nAuspicious and kind.\nPlans may not prosper,\nSchemes may not favor.\nMarriages harmonize,\nMerchants thrive in numbers.\nPregnancy bears a noble son—\nDo not move.\nDisasters do not arise,\nInner and outer realms are harmonious.\nAll affairs proceed as wished,\nJoy and fortune abound.\n\nOn wealth: a small investment brings great satisfaction,\nGoods bought are fine, goods sold are fine.\nFarming should be delayed,\nLawsuits are auspicious.\nMoving brings great fortune.\nIllness afflicts old and young—\nLight in spring, grave in autumn and winter.\nGood deeds help,\nThe stars are unfavorable.\nMarriage should proceed swiftly—delay brings failure.\nThe household and its members are safe,\nLost items in the capital will be found among kin.\n\nTrade delayed brings profit,\nBuying fields or homes succeeds later.\nDocuments take time to finalize,\nPregnancy bears a son—smooth and greatly auspicious.\nPlans and actions should proceed swiftly—\nDelay brings no benefit.\nPatience serves well in matters,\nSeeking medicine or craft—haste fails, delay succeeds.\nRelying on others brings fortune later,\nSelling goods later yields greater profit.\n\nMist thickens like layered cloth,\nWine overflows the brimming cup.\nLong-held commands soon depart,\nRipe fruit heralds blossoming flowers.\n\n---\n\nHexagram Thirty-Four: Supreme Auspice—Joyful Renewal\n\nBuilding a home or burying the dead meets auspicious spirits—\nProceed with construction without hesitation.\nMerchants and traders see their plans succeed,\nNo need to scheme—good news arrives.\n\nThe ailing dragon brings rain beneath the rainbow,\nIllness bodes ill for one’s affairs.\nTransformation and ascent will come in time—\nFor now, maintain the old and await brighter days.\n\nKnow that some matters are best done in a day,\nLet not a single day pass in vain.\nIf a task is ill-timed and inauspicious,\nThe noble one’s efforts are wasted.\n\nThe Sage’s intent declares:\nRenewing the old, forging the new,\nMoving graves and tombs.\nAuspicious months and years align,\nFavorable stars descend.\nMerchants find joy in profit,\nMarriages fulfill desires,\nPlans succeed without effort,\nLawsuits bring hope,\nAll undertakings satisfy the heart.\nEverlasting prosperity is assured.\n\nOn wealth: light trade should proceed swiftly,\nGoods bought are fine, goods sold take time.\nFarming should be hastened for early harvest.\nTrade flourishes,\nTravel should be swift,\nTravelers arrive in a day or two—no delay.\nThe household and its members face misfortune.\nTrade should proceed swiftly—delay brings failure,\nMarriage should proceed swiftly—delay brings hardship.\nLawsuits bring no trouble,\nBuying fields or homes succeeds later.\nPlans and actions should proceed swiftly—\nDelay brings difficulty.\nSeeking medicine or craft brings stability,\nDocuments should be handled swiftly and auspiciously.\nSeeking office or promotion succeeds,\nMoving brings good fortune.\nLost items are hard to find,\nRelying on others meets noble assistance.\n\nDo not move.\nGradually, one reaches the shore,\nAll matters align with the heart.\nWhat brings joy to one’s heart,\nFalls like flowers, then blooms anew.\n\n---\n\nHexagram Thirty-Five: Moderate—Seek Not, Move Not\n\nThe local spirits and malevolent forces forbid construction,\nPreserve the old—do not seek elsewhere.\nDisturbing tombs and earth is especially fearful—\nHastening to honor the gods brings great blessing.\n\nThe crane cries in the heavens, its qi piercing the sky,\nNine thousand li shrink to a hand’s breadth.\nOfficial rank and wealth ascend daily,\nPeaceful living brings joy through the seasons.\n\nEach departure leaves more behind,\nYet seeking again brings even greater harmony.\nIf this hexagram appears between the twentieth and thirtieth,\nKnow that wealth will fill the mountains and rivers.\n\nThe Sage’s intent declares:\nUndertaking construction or digging soil,\nEvil forces occupy the direction.\nUnintended actions are unwise—\nPreserving the old is best.\nBurials are especially forbidden,\nLest they bring ruin.\nIf minor transgressions occur,\nPrayers and offerings restore peace.\nPublic and private affairs suffer,\nBeware of disaster.\nHastening to do good\nBrings fortune.\n\nOn wealth: trade and buying goods are fine,\nSell goods promptly.\nPublic matters are auspicious—\nMaintain the old for the 31st, 4th, or 10th.\nUndertakings and travel are inauspicious,\nTravelers do not arrive, delayed by obstacles abroad.\nEntering a household to seek heirs brings misfortune.\n\nFor illnesses affecting the old and young: if one offends earth deities or tomb spirits, the condition may become severe—ritual expiation is advised. For pox and sores, consult the seventy-two seasonal indicators.\n\nPlans and undertakings meet with misfortune; transactions are difficult to conclude. Medical careers fail to prosper; matters of release prove arduous. Lost items are hard to recover; expected news does not arrive. Relocation is inauspicious, with petty persons deceiving and manipulating. Legal disputes are unfavorable. Disasters arise, bringing harm to fields, dwellings, and household members—no benefit is gained. Commerce fares poorly; seeking office or promotion proves fruitless.\n\nWhere does the melody drift?\nThose parted are the closest kin.\nOne side bathed in solitary yang—\nOnly then are tears stemmed.\n\n□□  Thirty-Sixth: Utterly Inauspicious—Follow the Old\n\nRoutine leads to confusion, carelessness invites ruin;\nOnce defenses fail, chaos reigns unchecked.\nWealth scatters—seeking blessings anew,\nWhy not have spared harm from the start?\n\nFish leap through peach-blossom waves in the third month,\nOnly then does the dragon’s form delight.\nSeeking office and emolument finds certainty,\nAll affairs free of worry—new fortune arrives.\n\nBy chance, in drought years, low fields are sown,\nIf waters come, the rice remains incomplete.\nHearing rumors of locusts and calamity,\nFalse alarms subside—wholeness is restored.\n\nThe Sage’s intent declares:\nFailing to uphold the law, ever prone to negligence—\nFire and theft strike once, and all collapses.\nThough remorse comes, it is too late,\nOnly vain sighs remain.\nTravel brings loss; marriage should not be sought.\nIllness and litigation bring manifold trials—\nBetter to perform good deeds.\nThe gods and sages exhort: difficult to secure commerce.\nOn wealth: buying and selling hastily leads to loss,\nAcquiring goods is unfavorable; selling goods is auspicious.\nPlanting seedlings fares poorly; scattered seeds yield but two or three parts.\nTravel risks bandits and fire—unlucky.\nThe traveler arrives, or if not, faces obstruction.\nIllness is cold damage; sweating comes on the seventh or eighth day.\nBeyond that, recovery is difficult—\nAppease the household deities, ancestors, and earth gods;\nTaking medicine brings improvement.\nMarriage is inauspicious; transactions fail, with others causing ruin.\nLegal disputes lose merit; offerings are spoiled by others.\n\nRelocation is inauspicious; disengagement brings misfortune.\nPlans and accomplishments turn ill.\nChildbirth harms mother and child—guard well-being.\nFields and dwellings near rivers are unfavorable; documents bring no advantage.\nRelying on others for affairs, acquiring or selling goods—all are inauspicious.\nVexation and haste fill the heart, toiling dreams dissolve like mist.\nOnly when the funeral rites pass beyond the threshold may disaster be averted.\n\n**Hexagram Thirty-Seven: Utterly Inauspicious – Abide in Stillness**\nFortune has roots as misfortune has a womb—\nAll summoned by man’s own hand.\nA heart set on ill invites calamity;\nEven with luck, the body may survive, yet wealth is lost.\nHow to cross waters without a boat?\nWaves and billows rise in towering fury.\nNeither advance nor retreat yields escape—\nFollow not this path in all your comings and goings.\nA lifetime spent wandering as a traveler,\nWhat trade or profit ever thrives?\nIf buying food with a knife, act swiftly—\nKnow that haste brings advantage, east or west.\n\nThe Sage declares:\nA life steeped in harm—\nFortune scant, misfortune manifold.\nNow beset by sudden woe,\nWhat recourse remains?\nPlans fall short; kin stand divided.\nLitigation loses merit; commerce grinds to ruin.\nBest to keep to the old—\nWhy chase restless waves?\n\n**On Wealth:**\nBuying and selling fare poorly;\nAcquiring goods brings hindrance, but selling brings fortune.\nFarming is unfavorable.\nIllness is inauspicious—cold damage, sores, and boils—\nYet protection and prayer may bring deliverance.\nTravel is ill-advised.\nChildbirth is difficult—pray for blessings and safeguarding.\nRelocation is inauspicious; borrowed items are lost.\nCommerce leads to loss; litigation fails.\nDocuments bring no advantage; buying fields, dwellings, or servants invites loss and misfortune.\nSeeking office or promotion goes unfulfilled.\n\nWhere do thorns arise?\nThe beloved’s trust slowly fades.\nThe lute’s broken strings fall silent—\nThe household grows ever more desolate.\n\n**Hexagram Thirty-Eight: Middling Fortune – Beset by Hardship**\nIllness lingers, pitiably frail—\nPhysicians and shamans waste efforts to preserve life.\nSincere pleas and vows prove vain—\nWhy not quietly reflect and answer Heaven’s call?\n\nThe red sun pierces the clouds,\nIlluminating all, even the hidden—\nThe multitudes turn their gaze.\nThe nobleman advances, his path bright,\nHis household prosperous and at peace.\n\nWhen buying, prices soar—\nSell at a bargain, do not hesitate.\nThough profit is meager,\nWandering here is but wasted effort.\n\nThe Sage declares:\nDisaster clings like a web—\nWho could foresee its source?\nUnfulfilled vows endanger safety;\nPhysicians and shamans spin tales, squandering coin.\nHasten to cultivate virtue\nTo appease Heaven above.\nFirst sorrow, then joy;\nFirst hardship, then ease.\nPerform good deeds—\nThe gods will grant protection.\n\n**Divination on Wealth:**\nDo not purchase goods; selling them is favorable. Farming yields little. Illness in old age is inauspicious—heavenly vows and curses linger, celestial signs are adverse, and illness worsens. Travel brings misfortune, though a traveler may arrive. Childbirth is difficult; lawsuits are inauspicious and protracted. Marriage is unfavorable; relocation is ill-advised. Buying land, homes, or servants is unpropitious—perform good deeds for the household. Seeking medical or artistic skills is unprofitable; lost items are hard to recover. Pursuing office or promotion is unfavorable—hasten to resolve matters, for success is unlikely. Borrowing brings initial difficulty, then ease; entrusting others follows the same pattern.\n\nEight blades remain unfinished,\nDark arrows strike the unseen.\nHarm to others returns to oneself—\nFortune departs, misfortune invades.\n\n**[Missing character] Thirty-Ninth: Neutral – Guard Against Humiliation**\nSpeak not of heroes untouched by misfortune—\nGrand ambitions meet disgrace, hard to endure.\nTurn back, amend faults—no shame in correction;\nSeek the open path, inquire wisely.\n\nSuddenly lost in deep mountains,\nBetter to return, free of doubt.\nAdvance or retreat, travel—all bring misfortune;\nBeware hidden deceit and loss.\n\nThough goods arrive late, their prospects are bright—\nBest to maintain the old and observe the bold.\nWhen a leader emerges, fortune turns auspicious,\nAnd wealth later flows like a blade.\n\n**The Sage’s Intent:**\nThe strong and lawless\nLightly bully the good and kind.\nVicious debts are hard to seize—\nSuffering disgrace, one is cast aside.\nYet amend faults once,\nAnd misfortune vanishes, no more to return.\nFirst ill, then good—\nAll depends on timely action.\nThis lot is not auspicious;\nHasten to fulfill old vows.\n\n**Divination on Wealth:**\nBuying, selling, and trading goods are favorable; selling is auspicious. Farming yields nothing. Travel is unfavorable; travelers face obstacles. Entrusting others brings no success; the ill should seek protection. Marriage is inauspicious; childbirth requires safeguarding. Plans and actions should be altered—even success is unfavorable. Lawsuits should be settled amicably; buying old homes or servants is unpropitious. Documents are unfavorable; relocation is ill-advised. Seeking medical or artistic skills is unprofitable. Pursuing office or promotion succeeds if one entrusts others again. Borrowing is unfavorable; lost items, if sought quickly, may not be found.\n\nFading blossoms gradually revive,\nThe broken moon regains its round.\nAmend faults, and gods and men will praise—\nReunion ensures completion.\n\n**[Missing character] Fortieth: Neutral – Later Auspicious**\nA heart harboring malice, lacking kindness,\nIn life and death, filial impiety spreads.\nYet turn toward the Dao, reform the old—\nA foundation endures, heirs thrive in the household.\n\nThe swan soars to the heavens, naturally,\nBut before its time arrives, misfortune strikes.\nThis day, ascension brings freedom—\nSoaring straight to the clouds of the nine skies.\n\nHearing news, the truth is praiseworthy;\nApproach the gate, and splendor awaits.\nIf you entrust others, it ends inauspiciously—\nEmpty words tangle worldly affairs like hemp.\n\n**The Sage’s Intent:**\nA lifetime of malice,\nDisharmony with kin.\nTransforming life and death,\nTurn toward this heart.\nSwear to heaven, repent to earth,\nReform the old, renew the new.\n\nIllness gradually lessens; plans and ventures succeed.\nFor marriage or lawsuits, peace is ultimately achieved.\nShift from ill to good—\nJoy fills the household.\n\n**Divination on Wealth:**\nDelay brings profit; purchasing goods is good, selling is good. Farming faces initial difficulty, then ease. Marriage is inauspicious. The ill recover slowly—vows may cause seven days of cold, then sweat; if delayed, perform good deeds. Household and family are at peace; relocation is auspicious. Lost items, if sought urgently, remain at home. Documents are delayed; trade is favorable. Borrowing brings delayed profit; entrusting others is urgent and auspicious. Transactions succeed with delay and profit; childbirth is auspicious after delay.\n\nMeeting or not—first guard against obstruction and disaster.\nReturn to the true Dao,\nAnd avoid losing segmental wealth.\n\n**[Missing character] Forty-First: Neutral – Caution, Do Not Act**\nThe traveler’s road stretches endlessly, ancient inns lie desolate—\nOpening one’s eyes only invites separation.\nBest to maintain the old, passing days in peace,\nTo preserve contentment and steady fortune.\n\nFalling blossoms, flowing water—both heartless,\nThe household is troubled, the master uneasy.\nWomen and children face illness and hardship—\nHasten to pray to the gods of prosperity.\n\nThough treasures emerge from the sea,\nBoarding a foreign ship is a vain journey.\nArriving, one knows not where to go—\nReturning empty-handed, bare as before.\n\nThe Sage’s Intent declares: Journeys and schemes bring harm to oneself and loss of wealth. It is best to maintain the old and preserve yourself from disaster. Public matters are settled, but illness lingers long. Do not break ground, lest sorrow arise. Strange dreams unsettle the heart, and all affairs falter. In matters of wealth, if there is no old stock, guard what goods you have. Farming yields meager harvests. Illness spares neither old nor young—mostly inauspicious, rarely favorable. Pray to the Dipper Star. Marriage is inauspicious; lawsuits should be settled amicably. Travel brings minor losses to oneself; the traveler arrives. Fields, dwellings, and household members face misfortune in the head and limbs; documents bring no success. Borrowing fails; lost items are hard to recover. Childbirth requires protection; buying or selling goods is unfavorable. Entrusting others with tasks—maintain the old; transactions are difficult to complete. Joy turns to sorrow; fortune reverses to pity. In all dealings, guard against loss—disputes and calamities will not cease.\n\n**[Missing character] Forty-Second: Great Auspice – Awakening**\nLong dullness stirs, as if waking from drunkenness,\nSuddenly thoughts of change arise, though not yet to their source.\nIce melts, snow scatters, and the gentle breeze arrives—\nThe sunken rise in secret, the withered flourish anew.\nFish leap from the water, playing amidst the waves,\nLeaping and gliding—do not take this lightly.\nFortune comes with ease, all matters flow smoothly,\nEven in peril, victory surpasses the past.\nDo not boast of martial prowess or extraordinary feats,\nFor in battle, few know true success or failure.\nEven in victory, there is loss—\nBetter to avoid conflict and find peace.\n\nThe Sage’s Intent declares: Long stagnation is like drunkenness, yet many encounters follow. The sunken will not remain trapped; thunder rumbles slowly, ice melts, snow scatters, and the gentle breeze arrives of itself. All affairs proceed as wished, and suppressed paths unfold. Illness and disputes turn to fortune—you will be free from worry. All schemes are greatly auspicious; do not hesitate. In matters of wealth, trade at the start of spring brings profit; other months are less favorable. Storing goods is good; all affairs are auspicious. Farming yields a harvest. Travel should be swift, lest it fail; the traveler arrives in two or three days. Marriage is auspicious, though difficult at first, it becomes easy later. Relocation is favorable. Illness in the old or young recovers quickly in spring, but slowly in other months. Entrusting others with tasks—act swiftly; resolving matters—act swiftly. Household and family are at peace; seeking office or promotion is auspicious. From drunken stupor to awakening, long hardship gradually gives way to smoothness. When the worst is past, fortune arrives—new shoots emerge from the earth.\n\n**[Missing character] Forty-Third: Neutral – Aligning with Heaven**\nLife’s toil rarely sees seventy,\nYin and yang’s excesses—seek a physician swiftly.\nHeaven’s decree on lifespan is predetermined,\nNot for mortal dust to know lightly.\nThe sun rises over Fusang, illuminating ten thousand miles—\nNobles rejoice, and all flows smoothly.\nSeeking wealth and schemes follows the heart’s desire;\nAsking for office—surely one will gain a name.\nSince ancient times, the talented and ambitious stand tall,\nYet in their midst, affairs do not align.\nNot a single flaw in their schemes—\nIn an instant, fame shines upon the great assembly.\n\nThe Sage’s Intent declares: The old grieve; the young have no doubt. Perform good deeds and blessings to preserve peace. Public matters proceed steadily; schemes are delayed. Actions are ordinary—do not devise clever tricks. In matters of wealth, lightly stored goods are good; selling goods is good. Farming yields a meager harvest. Travel is safe for the young but perilous for the old; the traveler arrives. Relocation is swiftly auspicious. Illness in the old is grave, but in the young, if one repays heavenly debts and fulfills good vows early, there is no harm—pox marks will be sharp. Transactions should be swift. First marriages are inauspicious; remarriage is swiftly auspicious. Lawsuits should be settled quickly; documents take time to complete. Fields, dwellings, household members, heads, and limbs are all unfavorable; borrowing money is not excessive. Schemes and tasks should be completed swiftly. Childbirth is stable—pray for protection and good fortune. Trade brings swift profit; in households, the old are in danger, the young are safe. Entrusting others with tasks is auspicious; seeking office or promotion succeeds in winter. Resolving matters should be swift—delay brings difficulty. Lost items are hard to find.\nThe sun sets behind the western mountains,\nIts color fading like dusk.\nCounting the sorrows,\nSchemes dissolve into vain sorrow.\n\n**[Missing character] Forty-Fourth: Supreme Auspice – Harmonizing with Heaven**\nMisfortune and fortune alternate by natural principle,\nAligning with the village’s resolve and Heaven’s will.\nDisasters and decline are fated—now the ice melts,\nDescending blessings and exorcising abundance strengthen the resolve.\nDark clouds veil the moon, dim and obscure,\nThe household’s affairs are unclear.\nIt is best to maintain the old for good fortune—\nWait until the clouds part, and all matters will flow smoothly.\nToday’s divination holds this meaning:\nSwift come, swift go—east or west.\nThough wealth is not abundant,\nIts clear light shines full before the eyes.\n\nThe Sage’s Intent declares: A person of integrity, whether poor or prosperous, remains constant. Unaffected by misfortune, how could lingering calamity remain? Conduct and retreat flow smoothly; blessings descend and exorcise. The virtuous are aided by Heaven, gaining fortune and prosperity. Disasters gradually recede; reputation spreads. All undertakings are auspicious—preserve peace forever. In matters of wealth, there is a third portion; storing goods is good, selling goods is good—all auspicious. Farming yields a good harvest. Illness in the old or young—wounds heal in seven or eight days; recovery is slow. Transactions succeed; travel is auspicious; the traveler has not yet arrived. Household and family are at peace; marriage should be swift—delay makes it difficult to complete. Buying fields, dwellings, household members, heads, or limbs should be swift—delay is difficult but beneficial. Documents are auspicious; schemes and tasks should be swift—delay requires effort. Seeking medical skills brings profit; seeking office or promotion should be swift. Childbirth is auspicious; lawsuits are auspicious.\nOnce clad in coarse cloth,\nToday adorned in crimson.\nShedding the dust of the world,\nAncestral jade gleams with light.\n\n**[Missing character] Forty-Fifth: Great Auspice – Yielding and Extending**\nWind arises from causes—how could it form in an instant?\nHow can divination seek good tidings?\nTrade and commerce, no matter how far,\nThe obscured will rise first, the yielding will extend.\nWind and thunder stir, shaking heaven and earth,\nAll things sprout—from here, they grow.\nThe noble’s schemes all come to fruition,\nThe commoner’s household welcomes prosperity.\n\nHere the divination yields good fortune—\nin its midst, seeking affairs meets timely success.\nThough petty men come to harass and clamor,\nthe great Dao’s body remains auspiciously flourishing.\n\nThe Sage’s intent declares:\nDivining kinship brings profit, with long-standing qi and destined affinity.\nIn trade and scheming, wealth flows unceasingly.\nLawsuits prevail; the ill recover slowly.\nAll movement aligns with good fortune—\nthe household is secure, travelers prosper,\nand family reunites in full moon’s glow.\n\nDivining wealth: five or six parts favorable.\nPurchasing goods is auspicious; selling goods is auspicious.\nPlanting late brings good harvest; marriage is greatly fortunate.\nTravel is favorable; travelers return late.\nLawsuits are auspicious; fields, households, and livestock mature slowly.\nShedding burdens is fortunate; schemes and tasks fall short of desire.\nChildbirth is auspicious; seeking office or promotion fails to advance.\nBorrowing money yields three parts; after selling goods, prices fall.\nAll movement is auspicious.\n\nTo discern the road ahead,\npetition with proper documents.\nWorries and dangers turn to good omens—\nthroughout the day, all naturally resolves.\n\n**[Missing character] Forty-Sixth: Moderate – Easy Release with Wealth**\nMountains and rivers stretch far, enduring hardships—\nknow that gathering and parting are but a turn of the hand.\nNear ventures seem profitable, yet how can they last?\nDeep autumn, early winter bring contentment.\n\nA flying serpent in dreams portends doubt—\nguard against thieves deceiving the household.\nOnly by shedding the old does fortune come;\nadvance and retreat now meet no timely hour.\n\nSeeking wealth—how fare my affairs?\nHolding goods, divining wealth, yields greater profit.\nRelease your cares and depart for long—\nnaturally, jade is polished by others.\n\nThe Sage’s intent declares:\nTrade ventures far, greed knows no bounds.\nWealth gathers and scatters—\nseldom is ten-tenths gained.\nHopes lie in autumn and winter;\nspring and summer bring no words of promise.\nAll schemes and fortunes follow this pattern.\nThe ill recover slowly; lawsuits linger.\nFor peace and prosperity,\ngive thanks to Heaven.\n\nDivining wealth: commerce wearies the mind, but purchasing goods is good.\nAutumn and winter are auspicious; selling goods is swift.\nFarming is incomplete; marriage is inauspicious.\nTravel in autumn is favorable; travelers arrive.\nLawsuits are difficult; borrowing in autumn and winter is auspicious.\nIllness afflicts young and old—\nin spring and summer, recovery comes;\nin autumn, healing is slow.\nMuch misfortune—good deeds are advised.\nIllness in autumn and winter recovers late.\nBuying fields, households, or livestock—\nautumn and winter are auspicious; spring and summer, inauspicious.\nSchemes and tasks—\nautumn and winter are auspicious; spring and summer, not.\nHouseholds and family—\nautumn and winter are auspicious.\nCommerce, documents, childbirth—\nall are auspicious in autumn and winter.\nSeeking office or promotion—\nautumn and winter are auspicious.\nRelying on others for tasks is difficult;\nshedding burdens is inauspicious in the first half of the year,\nauspicious in the latter half.\nTrade is auspicious in autumn and winter;\nother months are unfavorable.\n\nGrain ripens—now is the time to act,\nwith intent fixed on the cloud ladder.\nAll schemes and hopes are well-timed—\nclouds part, the moon shines bright.\n\n**[Missing character] Forty-Seventh: Great Auspice**\nInnately holding pure sincerity, your conduct reaches the divine—\nin due time, good fortune arrives.\nIf schemes stray from the straight path,\nthey will not err from the true Dao.\n\nDense clouds without rain darken the sky’s edge—\nyet this portends doubt, not obstruction.\nBeware of petty men harming you;\ndarkness veils the household—guard against affairs.\n\nSeeking wealth, you desire unimpeded flow,\nyet talent moves west, then east again.\nThough three or five parts are substantial,\nmatters may yet end in one stroke of emptiness.\n\nThe Sage’s intent declares:\nGood deeds bring fortune; evil accumulates misfortune.\nEven when walking the right path,\nblessings need not be sought.\nLawsuits settle peacefully; divining kin brings no worry.\nAll schemes succeed; journeys harbor doubt.\nAll affairs proceed as wished, without delay.\n\nDivining wealth: upright commerce yields no profit;\ndevious paths flourish greatly.\nPurchasing goods is good; selling goods is good.\nFarming reaps great harvest; lawsuits are inauspicious.\nIllness afflicts young and old—\nobstacles from earth spirits require prayers for protection, but no harm.\nMarriage is auspicious; all matters are fortunate.\nTravel is auspicious; travelers arrive in three days.\n\nErecting a new grave unsettles—\nsending letters strains the heart.\nSeveral times you’ve faced perilous waves;\ntoday, you meet a confidant.\n\n**[Missing character] Forty-Eighth: Moderate – Yin and Yang**\nYin and yang pair not in vain—\nstrive to seek the divine, accumulating good affinity.\nMoment by moment, who knows to follow great righteousness?\nBetter to safeguard wealth and ensure security.\n\nA newly sharpened sword gleams brighter—\nits east-west radiance surpasses the ordinary.\nFrom the past, roots already exist;\npolished and enhanced, its fame spreads.\n\nDesiring lifelong wealth and harmony,\nwho knew good fortune would bring many demons?\nBetter to maintain the old—peaceful dwelling is auspicious.\nNaturally, you possess soaring aspirations.\n\nThe Sage’s intent declares:\nSeeking schemes brings great fortune, with destined affinity.\nYet if plotting, affairs may falter.\nPreserve resources well; do not trifle with public matters.\nDivining households requires caution.\nThe ill are unharmed; travelers are delayed.\n\nDivining wealth: commerce yields little.\nPurchasing goods is good; selling goods is good.\nSeeking medical skills or official rank fails.\nLawsuits are inauspicious—losing wealth is no harm.\nThe ill recover through good vows.\nTravel is unfavorable; travelers have not arrived.\nLost items will reappear; marriage is late but greatly auspicious.\nFarming yields meager harvest.\n\nDivining affairs: expect many obstacles.\nSeeking rank or divination—outcomes are hard to measure.\nTo divine stability, maintaining the old brings peace—\nnaturally, glory and official position flourish.\n\nGathering four to form a woman—\nbeware, affairs may fail.\nEarly gardens secure provisions—\nthe household avoids disaster and misfortune.\n\n**[Missing character] Forty-Ninth: Supreme – Breaking Star**\nWho can distinguish jade within stone,\nor pan for gold hidden in sand?\nProsperity and decline depend on timing—\nwhy cling to empty aspirations?\n\nA flock of crows gathers noisily—how strange!\nBeware of slander from yin persons.\nOnly in retreat can you gain;\notherwise, affairs breed doubt.\n\nSeeking matters in delay—delay is fitting.\nThrough long and enduring time, doubt not.\n\nWealth and goods long held are hard to keep—\nholding them demands true vigilance.\nThe Sage’s intent declares:\nOne who trusts in talent yet fails to reach their aim—\nwith steadfast resolve, what cannot be achieved?\n\nThe sick shall recover on their own;\ndisputes will not long linger.\nPlans advance, fortunes rise—\nseizing opportunity brings honor.\nAll affairs flow smoothly,\nheroic spirit unbroken.\n\nDivining wealth: trade delayed yields four or five parts.\nFarming rewards labor with harvest.\nLost items soon appear;\nmarriages should be swiftly sealed—auspicious.\nVows for the ill bring recovery—\nthe young fare well, the old less so.\nSelling goods delayed brings profit;\nhaste yields none.\nPublic disputes best settled in peace;\ntravelers soon return, the household thrives.\nAll matters prosper.\n\nThe household’s renown grows,\ndocuments stand firm.\nDesires are fulfilled—\nyet casting lines in the sea brings alarm.\n\nThe divination of the Four Sage Perfected Lords concludes.\n*(Note: \"魉魑\" absent in the original text, supplied from context.)*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "四圣真君灵签 经名：四圣真君灵签。 撰人不详。 一卷。 底本出处：《正统道藏》正一部。 四圣真君灵签 降灵劝世格言 矫妄求荣，名誉不扬。 克剥致富，子孙受殃。 行思布德，福禄来翔，寡欲薄私，专命尔长。 毋欺暗室，毋昧三光。 正直无私，赤心忠良。 天地介祉，神明卫旁。 延生度厄。 必济时康。 我言能依，百病消洋。 凡祷之时，先念乡贯某处，某人为某事上启，天蓬大元帅真君，天猷副元帅真君，诩圣保德真君，真武灵应真君，天地神祇，万物皆知。 吾今卜课，善恶扶持，凶应凶兆，吉应吉期，判断生死，决定无疑。 □□　第一签　下下　守旧 晓来昏去苦营营，只见金资不见人。 纵使畜藏为朽腐，直须将久花为尘。 飞龙变化喜逢时，此日升腾果遂期。 谋望求财多吉庆，求官进位更无疑。 猛烈将军斩上阙，岂容小意动干戈。 直须拜谒金门下，上下王侯气色和。 圣意云：逐利哀一晨，弃真就妄。 积不能散，反报其谤。 且守其常，不宜谋望。 公讼莫兴，婚姻必旺。 病者迟痿，出行阻障。 动作不及，无门可向。 占秋吉，春冬不吉。 脱货吉。 公讼无事，买卖出入无利，纵有轻微，见人费力。 病五十以下，难久淹。 年少宜早得，在床迟无妨。 犯土，瘟疮不妨。 暴病，少者七日得汗，大命吉。 婚相克，夫入舍凶。 占头疋人口凶。 求医学艺业不吉，走失。 早晚见迟难。 寻借物多无少。",
      "translated_text": "**Divine Lots of the Four Sage Perfected Lords**\n\n*Scripture Title:* *Divine Lots of the Four Sage Perfected Lords*\n*Author:* Unknown\n*Volume:* One\n*Source Text:* *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n**Divine Lots of the Four Sage Perfected Lords**\n**Celestial Admonitions for the World**\n\nTo seek glory through deceit is to gain no renown.\nWealth amassed through exploitation brings calamity upon descendants.\nCultivate virtue with mindfulness, and fortune and blessings shall descend.\nCurb desires, diminish self-interest, and your destiny shall endure.\n\nDo not deceive in darkness, nor betray the Three Luminaries.\nBe upright and selfless, with a loyal and sincere heart.\nHeaven and Earth bestow blessings; the gods stand guard beside you.\nProlong life and transcend hardship—prosperity shall surely come.\nIf you heed my words, all afflictions shall vanish like the sea.\n\nWhen praying, first state your native place and name, then declare:\n*\"For [such-and-such a matter], I humbly invoke the Perfected Lords—*\n*Marshal Tianpeng the Great, Vice-Marshal Tianyu,*\n*Lord Xusheng the Protector of Virtue, and Lord Zhenwu the Spiritually Responsive—*\n*along with the gods of Heaven and Earth, who witness all things.*\n*I now cast this lot: may good or ill be revealed,*\n*fortune or misfortune be foretold, life or death be decided—*\n*let the judgment be without doubt.\"*\n\n---\n\n**First Lot** □□ *Lower-Lower* **Uphold the Old**\n\nFrom dawn to dusk, toil without rest,\nSeeing only gold, not the man.\nThough hoarded wealth may rot,\nIn time, even blossoms turn to dust.\n\nThe soaring dragon transforms when the hour is right—\nToday, its ascent is fulfilled.\nPlans and wealth-seeking bring great fortune;\nSeeking office and promotion leave no doubt.\n\nThe fierce general storms the palace gates—\nHow dare petty schemes stir conflict?\nYou must pay homage at the golden gate,\nWhere lords above and below stand in harmony.\n\n**Sacred Intent:**\nChasing profit at dawn, abandoning truth for delusion.\nWhat is amassed cannot be dispersed—retribution follows slander.\nHold fast to the ordinary; do not scheme.\nDo not stir litigation; marriages shall prosper.\nThe sick recover slowly; travel faces obstacles.\nActions fall short—no path lies ahead.\nAuspicious in autumn, inauspicious in spring and winter.\nSelling goods is favorable.\nLitigation brings no trouble; buying and selling yields no profit,\nOr if slight gains come, they cost great effort.\nFor those under fifty, illness lingers but does not last.\nThe young should recover early; lying abed longer is no harm.\nAffected by earth, but smallpox is no threat.\nSudden illness—if young, sweat comes in seven days, and life is secure.\nMarriage brings discord; if the husband enters the wife’s home, misfortune follows.\nSeeking livestock or servants brings ill fortune.\nStudying medicine or crafts is inauspicious; lost items are hard to recover.\nWhether early or late, reunion is delayed and difficult.\nBorrowed items are mostly not returned, or only a few.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 565,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.038389444351196,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "有迁移凶，只宜守旧家宅。 人口有土，并禁忌不宁。 修福保之，生产宜快，迟难求官升职，大吉。 脱货便脱，文书未定，迟不成。 托人虚诳。 买货便买，谋事成事。 有阻，种田无收。 见贵人便见，迟不济。 针灸选好日吉。 惜花还值雨，爱月黑云生。 筵前无一事，犹若是非争。 □□　第二　大吉　动用取进 早觅安身保利宜，精依古法莫逾时。 革除所弊人常愿，果协心怀享大提。 虎出大林须动众，众人见了却忧疑。 虽然未解伤人意，亦主虚惊事可疑。 山居岂有喧哗客，只好修心办已高。 万事於中且宁耐，用心烧炼只徒劳。 圣意云：循规守矩，如法立身。 久静思动，常切精勤。 迁移吉利，谋运从心。 结亲和合，病者从轻，百事畅怀，公讼欣欣。 圣签之守，所欲利亨。 占婚姻吉。 置货财轻，脱货吉。 移居吉。 公讼无事，家宅人口平安，求官迟升职名分。 宜快病。 宜作福，老者难，少者或好或恶。",
      "translated_text": "Relocation brings misfortune; only guarding the old homestead is fitting.\nHousehold members are afflicted by earth, with taboos unsettling peace.\nCultivate blessings to protect them—childbirth should be swift; delay makes official promotion difficult, though greatly auspicious.\nSell goods promptly when selling; documents remain unsigned, and delay prevents completion.\nThose entrusted prove deceitful.\nBuy goods promptly when buying; plans and actions come to fruition.\nObstacles arise; farming yields no harvest.\nMeet noble persons at once—delay brings no success.\nAcupuncture and moxibustion require choosing an auspicious day.\nCherishing flowers, yet rain falls; loving the moon, dark clouds arise.\nAt the feast, no matter seems settled, yet quarrels still contend.\n\n[Missing characters] Second: Greatly Auspicious. Action and use bring advancement.\nSeek shelter early to secure profit—\nDiligently follow ancient methods, never overstepping time.\nReforming what is corrupt is people’s constant wish;\nWhen deeds align with the heart, great rewards are enjoyed.\nThe tiger leaves the great forest, stirring the crowd—\nThough people see it, they remain anxious and doubtful.\nThough it harbors no intent to harm,\nIt still causes false alarms and suspicious affairs.\nHow can mountain dwellers host clamorous guests?\nBetter to cultivate the mind and refine oneself.\nAmid all things, remain patient;\nBurning with effort in alchemy is but vain labor.\n\nThe Sage’s intent declares:\nFollow rules and norms, establish oneself by the Dao.\nFrom long stillness comes the thought of movement—\nEver diligent and earnest.\nRelocation is auspicious; plans proceed as the heart desires.\nMarriage brings harmony; the ill recover lightly.\nAll matters flow smoothly; litigation brings joy.\nAdhering to the Sage’s lot,\nAll desires prosper and flourish.\n\nDivining marriage is auspicious.\nAcquiring goods is of little value; selling goods is favorable.\nMoving residence is auspicious.\nLitigation brings no trouble; household and family are at peace.\nSeeking office brings delayed promotion, yet rank is assured.\nIllness should be treated swiftly.\nPerforming blessings is fitting—\nFor the elderly, recovery is difficult;\nFor the young, outcomes vary between good and ill.",
      "overlap_context": "e young should recover early; lying abed longer is no harm.\nAffected by earth, but smallpox is no threat.\nSudden illness—if young, sweat comes in seven days, and life is secure.\nMarriage brings discord; if the husband enters the wife’s home, misfortune follows.\nSeeking livestock or servants brings ill fortune.\nStudying medicine or crafts is inauspicious; lost items are hard to recover.\nWhether early or late, reunion is delayed and difficult.\nBorrowed items are mostly not returned, or only a few.",
      "start_char": 565,
      "end_char": 943,
      "start_sentence": 43,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.91939902305603,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "服药有阻，痘疮不稳。 出行远宜少人吉。 行人至，如不到两月方归。 失物在宅内，宜早寻，迟不见。 人口失吉。 久后见行人，不到一二日有信。 脱货、脱事便脱，后迟，孕难生，生女。 修福　　日下生。 求医入学吉。 托人用事二人方吉。 交易吉。 文书有阻，吉。 借物三人吉。 买头疋，田宅，快利。 有缘重欢庆，枯杨半树开。 向前求吉事，晚日称心怀。 □□　第三　中平　否极泰来 用尽殷勤望有功，反为怜怨惨愁容。 须愁宝货多虚耗，何苦区区不守中。 否极从今喜泰来，龙泉磨拂旧尘埃。 莫言守已无他望，闭户深居也获财。 居官必有人谗佞，得职终须后职高。 只好在家安守道，自然家内遇英豪。 圣意云：时运大谬，不能守常。 殷勤用尽，反受其殃。 失物招祸，动作不良。 凡事求用，早计潜藏。 大主损财，宜守其常。 占买物，田宅，人口、头疋难。 见货快买，再去添价，不卖有利，病老少。 若不应时，先凶后吉。 宅神不宁，婚姻克夫。 费力不成，种田费力。 无收守旧，脱货好。 公讼事难，谋事成事难。 旧基业好，新难去。 失人口头疋，难寻。 产孕生分娩难。 子母凶，宜作福生男。 托人用事不济，有阻。 文书不济，损财。 迁移不利。 借物无交易，兴贩不利。 守旧还逢吉，更张劳见危。 鼎身亏一足，烹饪但随时。 □□　第四　中平　谨守 莫言小疾沸须忧，日月适巡不易留。 能向道中图早计，庶几危厄获全收。 劳心费力欲成功，待得花开一阵风。 须得东君轻借力，望中别有一枝红。 风催闪电雷为使，水中绞龙旱有妖。 二物若能俱不避，依时顺节足为高。 圣意云：谨微守己，一心事神。 旧愿早还，免受其殃。 公讼不利，莫占婚姻。 出行宜止，在路迈巡。 财货平平，病者纵免。 凡合天道，先暗后明。 占病，有道愿先凶后吉。 久淹不妨，年老难。 痘疮宜保福，产难宜快，先凶后吉。 买卖微，见人宜快，有二三种田早收，迟无。 说货快，婚姻不吉。 入舍过房凶，出行心动，身不动，行人二三日至。 如不至，迟公讼吉。 破财买头疋快成，迟难。 求官升职，名分迟，不遂。 买物田宅宜快，迟不成。 走失，目下见； 如迟一日，不见。 成事勾当宜快，迟更变，家宅人口不利。 保福安，托人用事宜。 贵人迟，不成。 交易难成，兴贩宜快。 迁移凶，借物便借，有人组。 文书目下见，迟不成。 求医学业，迟难。 安居且虑危，深情有别离。 未能求善果。 先仿预损枝。 □□　第五　中平　利益动用 好将心意共图谋，利益源源合所求。 休向此中忘善果，保全衰朽浪中舟。 行船风顺去无疑，利涉江津正遇时。 万里长城知可到，所谋遂意事如期。 二人商贾求财利，便好登途离本地。 三五七朝到长安，货物交关莫守市。 圣意云：最宜交易，同心共谋。 若占老病，危厄孤舟，婚姻叶吉，谋望可求。 疾者进退，不解无忧，行人即至，讼不拘留。 田蚕吉利，家道优游。 占财，买卖置货好，合伴不吉。 公讼无事，婚姻吉。 种田有收，出行吉。 行人早晚至，求官升职，利病。 三五十以用无妨，四十以上进退宜快，保福。 痘疮平稳，老者主死。 买田宅、人口、头疋吉。 家宅老危少安，托人用事快吉。 迁移大吉。 走失迟见，谋事成事，三二日宜快干，迟不济。",
      "translated_text": "Medication meets obstruction; pox sores remain unstable.\nFor distant travel, fewer companions bring good fortune.\nThe traveler arrives—if not, returns within two months.\nLost items lie within the home; seek them early, for delay brings no sight.\nHousehold members meet good fortune.\n\nAfter long absence, the traveler appears—within a day or two, news arrives.\nSelling goods or matters should be done promptly; delay brings difficulty.\nPregnancy struggles to bear; a daughter is born.\nPerforming blessings—\nThe child is born now.\nSeeking a physician or entering school is auspicious.\nEntrusting matters to two people brings good fortune.\nTrade is auspicious.\nDocuments meet obstruction, yet fortune prevails.\nBorrowing from three people is auspicious.\nPurchasing livestock, fields, or homes brings swift profit.\nJoyful reunion with kindred spirits—withered willows bloom halfway.\nPursuing good fortune ahead, the heart’s desires are fulfilled in later days.\n\n**Third: Moderate Fortune – From Adversity Comes Prosperity**\nExhausting diligence in hope of success,\nOnly to be met with sorrow and bitter countenance.\nWorry not for the vain depletion of treasures—\nWhy toil in vain without holding to the mean?\n\nFrom adversity now comes prosperity;\nThe dragon’s blade, polished, sheds its old dust.\nSay not that self-restraint holds no other hope—\nEven in seclusion, wealth is gained.\n\nIn office, slanderers arise,\nYet promotion follows in time.\nBest to stay home, uphold the Dao,\nAnd naturally, heroes appear within the household.\n\nThe Sage’s intent declares:\nThe times run contrary, unable to hold to constancy.\nDiligence exhausted, one suffers calamity instead.\nLost items invite misfortune; actions turn ill.\nIn all matters, plan early and act in secret.\nGreat losses of wealth—best to maintain the norm.\n\nDivining purchases—fields, homes, livestock, or servants prove difficult.\nSee goods and buy swiftly; to haggle further brings no profit.\nIllness affects young and old.\nIf untimely, first ill, then good.\n\nHousehold spirits are restless; marriage harms the husband.\nEfforts fail; farming is laborious.\nNo harvest—hold to the old; selling goods is favorable.\nLitigation is troublesome; plans and actions falter.\nOld foundations are sound; new ventures are difficult.\nLost livestock or servants are hard to recover.\nChildbirth is difficult; mother and child face peril.\nPerforming blessings may yield a son.\nEntrusting matters to others brings no success—only obstruction.\nDocuments bring no benefit; wealth is lost.\nRelocation is inauspicious.\nBorrowing brings no trade; commerce is unfavorable.\nHolding to the old brings good fortune; change invites danger.\nThe tripod lacks a leg—cooking must adapt to the times.\n\n**Fourth: Moderate Fortune – Cautious Restraint**\nSay not that minor illness is but a fleeting worry—\nTime and tide wait for none.\nIf one plans early within the Dao,\nPerhaps peril may yet yield safety.\n\nLaboring heart and strength to succeed,\nOnly to see the blossoms scattered by a gust of wind.\nYet if the Eastern Lord lends a gentle hand,\nAnother branch blooms in the distance.\n\nWind spurs lightning, thunder serves as messenger;\nDrought breeds demons in the waters where dragons twist.\nIf one can avoid neither,\nTiming and harmony suffice for excellence.\n\nThe Sage’s intent declares:\nBe cautious in small matters, hold to oneself, and serve the spirits wholeheartedly.\nFulfill old vows early to avoid calamity.\nLitigation is unfavorable; do not divine marriage.\nTravel should be halted; the road is fraught with delay.\nWealth is modest; illness may yet be spared.\nAll aligns with the Dao—first dark, then bright.\n\nDivining illness—vows bring first ill, then good.\nProlonged affliction is no concern, but the elderly face difficulty.\nPox sores require blessings; childbirth demands swift action—first ill, then good.\nTrade is modest; meet people promptly—two or three crops should be harvested early, or none at all.\nSpeak of goods quickly; marriage is inauspicious.\nAdopting or moving into a home is ill-fated.\nTravel stirs the heart, but the body remains—\nThe traveler arrives in two or three days.\nIf not, delay brings good fortune in litigation.\nSpending to buy livestock brings swift success; delay brings difficulty.\nSeeking office or promotion—rank comes late, and desires are unmet.\nPurchasing goods, fields, or homes should be done quickly; delay brings failure.\nLost items appear at once; if delayed by a day, they vanish.\nMatters should be settled swiftly; delay brings change.\nHousehold and family face misfortune.\nPerforming blessings brings peace.\nEntrusting matters to others is favorable.\nNoble aid comes late and fails.\nTrade is difficult; commerce should be swift.\nRelocation is ill-fated.\nBorrowing should be done promptly, though others may interfere.\nDocuments appear at once; delay brings failure.\nSeeking physicians or studies is difficult with delay.\nDwelling in peace yet fearing danger,\nDeep emotions bring separation.\nBefore good fruit can be sought,\nFirst, one must suffer the loss of a branch.\n\n**Fifth: Moderate Fortune – Beneficial Action**\nWith good intent, plan and scheme together—\nProfit flows endlessly to meet your desires.\nDo not forget good deeds in this pursuit,\nLest the withered vessel drift in the waves.\n\nThe sailing ship meets favorable winds without doubt;\nCrossing the river is timely.\nThe Great Wall of ten thousand li is within reach—\nPlans succeed as hoped, matters proceed as scheduled.\n\nTwo merchants seeking profit—\nBest to set out and leave their homeland.\nIn three, five, or seven days, they reach Chang’an,\nWhere goods are traded—do not linger in the market.\n\nThe Sage’s intent declares:\nTrade is most favorable; unite in purpose and plan.\nFor the elderly and ill, peril is like a lone boat.\nMarriage is harmonious; plans and hopes may be pursued.\nIllness wavers, yet without resolution, there is no worry.\nThe traveler arrives soon; litigation brings no detention.\nSilkworms and fields bring good fortune; the household thrives in ease.\n\nDivining wealth—buying, selling, and acquiring goods is favorable, though partnerships are inauspicious.\nLitigation brings no trouble; marriage is auspicious.\nFarming yields harvest; travel is fortunate.\nThe traveler arrives soon or late; seeking office or promotion benefits illness.\nThose in their thirties and forties face no harm;\nThose above forty should act swiftly and perform blessings.\nPox sores are stable; the elderly may die.\nPurchasing fields, homes, livestock, or servants is auspicious.\nThe household—old in peril, young at peace.\nEntrusting matters to others brings swift good fortune.\nRelocation is greatly auspicious.\nLost items appear after delay; plans and actions should be swift—\nDelay brings no success within two or three days.",
      "overlap_context": "litigation brings joy.\nAdhering to the Sage’s lot,\nAll desires prosper and flourish.\n\nDivining marriage is auspicious.\nAcquiring goods is of little value; selling goods is favorable.\nMoving residence is auspicious.\nLitigation brings no trouble; household and family are at peace.\nSeeking office brings delayed promotion, yet rank is assured.\nIllness should be treated swiftly.\nPerforming blessings is fitting—\nFor the elderly, recovery is difficult;\nFor the young, outcomes vary between good and ill.",
      "start_char": 943,
      "end_char": 2237,
      "start_sentence": 72,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.0349018573761,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "产孕，双日得平安吉。 脱货，有利便脱，兴贩吉。 文书交易不成。 輀作本成軏用，须凭巧匠裁。 重山成锦绣，花落又重开。 □□　第六　大吉存心卦利益动用 欲求文墨作基图，何用怀疑设计谟。 但要存心公且正，自然交易利赢余。 鸳鸯阻隔两分飞，谋望求财未得时。 守旧却宜休改革，如今进退尚迟疑。 安居正好村注内，若欲迁移不为虑。 若逢孤势也安然，利益变财那可对。 圣意云：凡动文墨，公讼无失。 凡在谋望，百事安吉。 问亲和合，契书进入。 公讼得理，疾病不卒。 动作徙心，万无一失。 占财求轻微，见谒耐心。 财不少，买货吉。 脱货吉。 烦事小心，公讼吉。 种田薄收，出行宜快。 行人即至，病老不妨。 少者三二日好，久淹难。",
      "translated_text": "Childbirth—on even-numbered days brings peace and good fortune.\nSelling goods—profit lies in swift sale; trade and commerce are auspicious.\nWritten contracts and transactions will not succeed.\nFor cart-making, the hub must be shaped with skill, relying on a master craftsman’s hand.\nLayered mountains form brocade; fallen flowers bloom again.\n\nHexagram Six: \"Great Auspiciousness in Mind\" – Beneficial for Action and Use\nTo seek a foundation in letters and plans,\nWhy doubt or devise schemes?\nSimply maintain a heart upright and just—\nNaturally, transactions yield profit and surplus.\n\nMandarin ducks, parted, fly in two directions;\nSchemes and wealth-seeking remain unfulfilled for now.\nBetter to hold fast to the old—no need for change;\nAdvance or retreat, hesitation lingers still.\n\nDwelling in peace is best within the village;\nShould you wish to relocate, no cause for concern.\nEven in solitude, all remains well;\nProfit and loss in wealth cannot be matched.\n\nThe Sage’s Intent declares:\nIn all literary and legal matters, no loss.\nIn all schemes and plans, all affairs are peaceful and auspicious.\nFor kinship and harmony, contracts and deeds proceed smoothly.\nIn litigation, justice prevails; illness does not turn grave.\nIn action and change of heart, ten thousand things succeed without fail.\n\nDivining wealth—seek modest gains; when meeting others, patience is key.\nWealth is not lacking; purchasing goods is auspicious.\nSelling goods is auspicious.\nIn troubling matters, caution; litigation is favorable.\nFarming yields a meager harvest; travel should be swift.\nThe traveler arrives soon; illness and old age pose no harm.\nFor the young, improvement comes in two or three days;\nProlonged delay brings difficulty.",
      "overlap_context": "ce or promotion benefits illness.\nThose in their thirties and forties face no harm;\nThose above forty should act swiftly and perform blessings.\nPox sores are stable; the elderly may die.\nPurchasing fields, homes, livestock, or servants is auspicious.\nThe household—old in peril, young at peace.\nEntrusting matters to others brings swift good fortune.\nRelocation is greatly auspicious.\nLost items appear after delay; plans and actions should be swift—\nDelay brings no success within two or three days.",
      "start_char": 2237,
      "end_char": 2549,
      "start_sentence": 173,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.731913089752197,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "痘疮平息，婚姻好。 和谐入舍俱吉利，家宅人口平安。 交易便成，迟难成。 买田宅人口大吉。 谋事成事，先难后易。 产平息，生男贵吉。 求官升职，大利。 迁移吉利，托人用事先难后易，文书有气相，吉利。 鱼化龙时变，休言霖雨开。 碧云重见喜，霖雨一声雷。 □□　第七　上上　佳泽卦二奇动用 才发精神叩上穹，沉痾顿瘥有神功。 非论长幼沾佳泽，运用如耕遇岁丰。 枯木逢春色欲华，顿然枝盛长萌芽。 时人莫得为柴斫，若待春深又吐花。 正去浙东求买卖，江西便说有新茶。 涮东买卖且休去，买得茶来锦上花。 圣意云：内秉精专，感格易求。 虽处忧捺，奚用多忧。 病者渐痒，宿疾亦廖。 福自天佑，从人所修。 长幼安吉，讼不拘留。 营谋有望，耕布全收。 占财，有三四分，置货勾陈，脱货迟，公讼吉，移居吉，脱事吉，托人用事，迟成。 交易走失，难寻，出行吉，行人一二日至，病老少无妨，宜祷上苍吉。 痘疮平息吉，买头疋、田宅、人口吉，婚姻吉，谋事成事。 勾当有小人无妨，破财吉。 家宅人口平安，兴贩言。 产平和，求官吉。 未达公卿位，青云可布随。 春光无限好，映日照瑶池。 □□　第八　下下　否赛守旧 艰难基址倦扶持，役役贵污不见机。 畜产损伤为小失，更於人口致忧疑。 因见渔舟上逆滩，渔舟泊此且盘桓。 前滩过了由闲事，更有后滩过更难。 心中用事意难为，汝若为之吉自亏。 正是失财行道处，波澜汕涌没明珠。 圣意云：素有祖业，不自守持。 贪心无厌，徒役机关。 镃产致损，家眷伤悲。 所谋莫望，病者瘥迟。 讼者失理，动涉迍危。 但宜守旧，莫外思惟。 占财，买卖轻微，置货财稳求事不成，公讼有主张，移居吉。 脱货迟，种田看时节。 出行凶，行人二三日至。 如不至，财有失。 灾病老凶，少淹滞不妨。 痘疮难迟瘥，交易不利。 婚姻初婚无坊，重婚不中。 求嗣凶，讼先难后易。 买田宅、人口、头疋凶，谋事勾当准，兴贩不吉。 失物难寻，人口灾晦不吉。 产孕艰难，托人用事难成，求官升职名分迟。 财宝逢时变，如何事不归。 手指斜阳日，孤舟未肯休。 □□　第九　上上　享福出尘 久思去故与维新，恰遇亨嘉志豁伸。 人宅泰然无别虑，韬光晦述出埃尘。 兰芳春景香堪爱，菊吐秋香又更佳。 乾坤各自为情意，不解束风次第开。 两头事意问如何，只好随缘恐惧过。 且守时来不多久，虽然不大也摩呵。 圣意云：否极泰来，将伸其志。 久宅安乐，出尘拔萃。 所作所谋，为无不遂。 守旧平平，几成自坠。 交易无阻，田蚤周备，更改动用，必获如意。 占求财，更改则吉。 置货吉，脱货吉，移居吉，公讼吉。 诸事少成，种田三二收。 婚姻初婚吉，重婚平平，求嗣吉。 出行吉，行人二三日至。 病老者难，少者久淹，亦难。 痘疮析福吉，公讼吉，置田宅人口头疋吉。 利谋事，成事宜快勾当。 有失物便寻，迟不见。",
      "translated_text": "The pox subsides peacefully; marriage is auspicious. Harmony enters the household, all is propitious; the home and family remain at peace. Transactions conclude smoothly, though delay may hinder success. Purchasing land, dwellings, or servants is greatly auspicious. Plans and undertakings face initial difficulty, then ease. Childbirth is peaceful; bearing a son brings noble fortune. Seeking office or promotion brings great advantage. Relocation is auspicious; entrusting matters to others follows the pattern of initial difficulty then ease. Documents bear the vigor of *qi*—propitious. When fish transform into dragons, the time of change arrives; cease speaking of ceaseless rains.\n\nAzure clouds reappear in joy; a single thunderclap heralds the rains.\n\n---\n\n**Hexagram Seven: \"Auspicious Rain\" – Two Auspicious Omens in Motion**\n*When talent and spirit ascend to knock upon the heavens,*\n*Deep illness vanishes at once—divine merit is shown.*\n*Whether young or old, all receive the blessings of this rain;*\n*Its application is like tilling soil in a year of abundance.*\n\nWithered trees meet spring and bloom with color;\nSuddenly, branches flourish, sprouting new shoots.\nLet no one cut them for firewood—\nWait until spring deepens, and they blossom again.\n\nTravel east to Zhejiang for trade;\nIn Jiangxi, they speak of new tea.\nDo not go east for business—\nBuying tea there is like embroidering flowers upon brocade.\n\nThe Sage’s Intent declares:\nWithin, one’s essence is concentrated, making resonance easy to attain.\nThough beset by worries, what need is there for excessive concern?\nThe sick gradually recover; chronic ailments also fade.\nFortune comes as heavenly aid, yet follows human cultivation.\nYoung and old are safe and auspicious; litigation does not detain.\nPlans and endeavors hold promise; planting and weaving yield full harvests.\n\nDivining wealth—three or four parts are attainable. Purchasing goods is like *Gouchen* (a celestial sign); selling goods is slow. Litigation is auspicious; relocation is auspicious. Resolving matters is auspicious; entrusting others follows the pattern of delayed success. In trade, lost items are hard to recover. Travel is auspicious; the traveler arrives in one or two days. Illness in the old or young poses no harm—praying to heaven is auspicious. The pox subsides peacefully; buying livestock, land, dwellings, or servants is auspicious. Marriage is auspicious; plans and undertakings succeed. Small-minded people may interfere, but losing wealth is auspicious. The home and family remain at peace; trade prospers.\n\nChildbirth is harmonious; seeking office is auspicious.\nThough one has not yet reached the rank of minister,\nThe blue clouds spread in pursuit.\nSpring’s boundless beauty\nShines upon the Jade Pool.\n\n---\n\n**Hexagram Eight: \"Adversity and Obstruction\" – Clinging to the Old**\nA foundation of hardship wearies those who sustain it;\nEndless toil in base affairs blinds one to opportunity.\nLivestock suffer losses—minor setbacks—\nYet greater worries arise among the household.\n\nSeeing a fishing boat struggle upstream,\nIt docks here, lingering in hesitation.\nOnce the first rapids are passed, one might think the worst is over—\nBut ahead lie even more treacherous shoals.\n\nMatters of the heart are hard to pursue;\nIf you proceed, fortune will diminish.\nThis is where wealth is lost on the road,\nWhere surging waves engulf the bright pearl.\n\nThe Sage’s Intent declares:\nOne possesses ancestral legacy yet fails to preserve it.\nGreed knows no bounds; one exhausts schemes in vain.\nLivestock perish, bringing sorrow to the household.\nPlans come to naught; the sick recover slowly.\nLitigation is lost; all actions court peril.\nOne should cling to the old and not seek change.\n\nDivining wealth—trade yields meager returns. Purchasing goods is steady, but endeavors fail. Litigation has a clear outcome; relocation is auspicious. Selling goods is slow; farming depends on timing. Travel is inauspicious; the traveler arrives in two or three days. If they do not, wealth is lost. The old face misfortune in illness; the young endure prolonged hardship without harm. The pox is slow to heal; trade is unprofitable. First marriages face no obstacles, but remarriage is ill-advised. Seeking heirs is inauspicious; litigation is difficult at first, then eases. Purchasing land, dwellings, servants, or livestock is inauspicious; plans and undertakings are uncertain. Trade is unpropitious. Lost items are hard to recover; the household suffers misfortune. Childbirth is difficult; entrusting matters to others is unlikely to succeed. Seeking office or promotion is slow.\n\nWhen treasures transform with the times,\nWhy do matters not return?\nFingers point to the setting sun—\nA lone boat refuses to rest.\n\n---\n\n**Hexagram Nine: \"Receiving Blessings\" – Transcending the Mundane**\nLonging to leave the old and embrace the new,\nOne encounters flourishing fortune, and aspirations expand.\nHome and family are at peace, free from other concerns;\nHiding one’s light and biding time, one emerges from the dust.\n\nOrchids in spring’s splendor are fragrant and lovely;\nChrysanthemums in autumn’s bloom are even finer.\nHeaven and earth each follow their own inclinations—\nUnbound by restraint, they open in succession.\n\nHow to address matters of two minds?\nOne must follow fate with reverence and pass through cautiously.\nYet the time of opportunity is not far off—\nThough not grand, it is worthy of praise.\n\nThe Sage’s Intent declares:\nAfter adversity comes prosperity; aspirations will unfold.\nThe long-established home is peaceful; one transcends the mundane.\nAll actions and plans succeed without fail.\nClinging to the old brings mediocrity; nearly achieved goals may collapse.\nTrade proceeds without obstruction; fields and silkworms are fully prepared.\nChanges and actions will surely bring satisfaction.\n\nDivining wealth—change brings auspiciousness. Purchasing and selling goods are auspicious; relocation is auspicious. Litigation is auspicious. Most matters see partial success; farming yields two- or threefold. First marriages are auspicious; remarriage is mediocre. Seeking heirs is auspicious. Travel is auspicious; the traveler arrives in two or three days. The old face difficulty in illness; the young endure prolonged hardship, which is also difficult. The pox resolves with blessings; litigation is auspicious. Purchasing land, dwellings, servants, or livestock is auspicious. Plans and undertakings should proceed swiftly. Lost items should be sought immediately; delay makes recovery unlikely.",
      "overlap_context": "rave.\nIn action and change of heart, ten thousand things succeed without fail.\n\nDivining wealth—seek modest gains; when meeting others, patience is key.\nWealth is not lacking; purchasing goods is auspicious.\nSelling goods is auspicious.\nIn troubling matters, caution; litigation is favorable.\nFarming yields a meager harvest; travel should be swift.\nThe traveler arrives soon; illness and old age pose no harm.\nFor the young, improvement comes in two or three days;\nProlonged delay brings difficulty.",
      "start_char": 2549,
      "end_char": 3718,
      "start_sentence": 197,
      "end_sentence": 274,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.95240378379822,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "求官升职，不达。 家宅人口平安，借物休言。 产孕平稳，文书迟吉。 交易迟不成，托人用事恐不成，兴贩大吉。 累月多逢雨，光华始晚晴，举头天上看，昏月渐分明。 □□　第十　上上　吉祥 美誉洋洋袭吉祥，门庭嘉庆喜非常。 凤凰呈瑞何由致，德行光荣世代昌。 不论平地与山尖，无限春光总被沽。 探得百华成蜜后，为谁辛苦为谁甜。 黄榜招贤胆气谐，正宜春色入门来。 得官终是为官显，不若家问稳得财。 圣意云：君子道长，小人道消。 求名得遂，显达皇朝。 孕生贵子，后庆丰饶，投书献策，栖占先标，常人所占，未可图超。 依稀守旧，幸免灾妖。 占财，君子贵，人有小人，轻微置货吉。 脱货便脱，移居吉，公讼吉。 种田看时节，平平交易便成，迟不济。 家宅人口平安，出行吉。 小人守旧，行人一二日至。 病老少艰难，痘疮亦然。 婚姻，君子贵人初，重婚吉，入舍求嗣吉。 小平兴贩吉，买田宅、人口、头疋，君子吉，小人难。 文书贵人吉，小人不利。 谋事成事，君子罐显，小人元用产，君子生贵，小人主离，借物，君子吉，小人无用。 失物慢慢寻，迁移吉，求医学业吉，托人用事吉，小人不济，求官升职除授吉。 做事好寝心，安身日渐。 荣残花如旧，色前朵足丰盈。 □□　第十一　上上　勤持动用 莫伤踪迹久尘沦，幸有真儒席上珍。 守节不应常遁晦，伫看砥砺喜通津。 囚人出狱争讼了，却买甜瓜上酒楼。 偶见故人同畅饮，酒钱还了又相酬。 去时事意何能速，若奔长安三日程。 不若在家听消息，事须自己见光荣。 圣意云：怀才抱艺，久困尘埃。 时将得路，亨达有谋。 最宜图望，不可能徊。",
      "translated_text": "Seeking official position or promotion—unattainable. Household and family members are at peace; do not speak of borrowing. Childbirth proceeds smoothly; documents bring delayed auspiciousness. Transactions are slow to conclude; entrusting others with matters may fail. Venturing into trade is greatly auspicious.\n\nFor months on end, rain falls frequently,\nOnly at dusk does the sky begin to clear.\nRaising one’s gaze to the heavens above,\nThe dim moon gradually grows bright.\n\n□□  Tenth  Supreme  Auspicious\n\nAuspicious repute overflows with boundless blessings,\nThe household brims with joy and felicity.\nFrom whence comes the phoenix’s auspicious sign?\nVirtue’s glory shines, bringing prosperity for generations.\n\nWhether on level ground or mountain peaks,\nAll the boundless springtime beauty is claimed.\nHaving gathered the essence of a hundred flowers into honey,\nFor whom does one toil, and for whom is it sweet?\n\nThe imperial proclamation calls for worthy talents, courage and harmony aligned,\nJust as spring’s hues are fitting to enter the gate.\nAttaining office will ultimately lead to prominence,\nYet nothing compares to the stability of family wealth.\n\nThe Sage’s intent declares:\nThe Dao of the noble flourishes, the way of the petty wanes.\nSeeking fame finds fulfillment, distinction in the imperial court.\nA noble child is born, bringing future abundance.\nSubmitting memorials and strategies, one takes the lead in divination.\nFor the common person, such aspirations remain unattainable.\nVaguely adhering to the old ways,\nOne narrowly avoids calamity and misfortune.\n\nDivining wealth—nobles prosper, while petty persons are present.\nSmall-scale acquisitions are auspicious.\nSell goods promptly; relocation is auspicious. Litigation is auspicious.\nFarming depends on timing; mediocre transactions may succeed, but delay brings failure.\nHousehold and family members are at peace; travel is auspicious.\nPetty persons cling to the old; the traveler arrives in one or two days.\nIllness afflicts both young and old with difficulty; the pox fares likewise.\nMarriage—nobles and prominent persons find initial unions auspicious; remarriage is auspicious. Entering a household to seek heirs is auspicious.\nPetty persons find small-scale trade auspicious.\nPurchasing land, dwellings, servants, or livestock—nobles find it auspicious, petty persons struggle.\nDocuments bring auspiciousness to nobles, but misfortune to petty persons.\nPlans and undertakings—nobles achieve prominence, while petty persons see no gain.\nNobles give birth to the noble; petty persons face separation.\nBorrowing—nobles find it auspicious, petty persons gain nothing.\nLost items should be sought gradually. Relocation is auspicious.\nSeeking medical treatment or education is auspicious. Entrusting others with matters is auspicious, but petty persons meet with failure.\nSeeking official position, promotion, or appointment is auspicious.\nIn affairs, it is best to rest the mind and settle the body, which will gradually improve.\n\nLike fading blossoms that remain as before,\nTheir colors now full and abundant.\n\n□□  Eleventh  Supreme  Diligence in Action\n\nDo not let footprints linger long in dust and obscurity;\nFortunately, a true scholar is a treasure at the feast.\nUpholding integrity need not mean perpetual seclusion—\nAwait the moment when grinding and polishing open the ford.\n\nThe prisoner leaves jail, disputes are settled,\nThen one buys sweet melons to ascend the tavern.\nBy chance, an old friend is met, and they drink together,\nThe wine bill is paid, and they toast one another again.\n\nWhy rush matters when setting out?\nEven hurrying to Chang’an takes three days.\nBetter to stay home and heed the news,\nFor affairs must be witnessed firsthand to bring glory.\n\nThe Sage’s intent declares:\nTalents and skills long buried in dust,\nThe time approaches when the path will open,\nBringing success and fulfillment to plans.\nMost fitting to pursue aspirations,\nYet impossible to linger.",
      "overlap_context": "reefold. First marriages are auspicious; remarriage is mediocre. Seeking heirs is auspicious. Travel is auspicious; the traveler arrives in two or three days. The old face difficulty in illness; the young endure prolonged hardship, which is also difficult. The pox resolves with blessings; litigation is auspicious. Purchasing land, dwellings, servants, or livestock is auspicious. Plans and undertakings should proceed swiftly. Lost items should be sought immediately; delay makes recovery unlikely.",
      "start_char": 3718,
      "end_char": 4396,
      "start_sentence": 275,
      "end_sentence": 313,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.33570957183838,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "婚姻平稳，公讼无失。 不宜守旧，恐有卑摧。 占财，儒士买卖有十分，置货财轻，脱货好脱，移居不吉。 公讼吉，诸事阻节。 行人三二日至，如不至，有实信，出行吉利。 病者差三五日不妨，久淹有善愿，痘疮吉。 婚姻吉，入舍求财吉。 公讼宜和，买物、田宅、人口、头疋有阻准成。 产孕生贵子平稳，诸事成事宜快，迟难勾当。 托人向前吉，家宅人口平安。 文书有气相，交易宜快迟不成。 迁移、兴贩吉。 求医、求官升职名分吉。 借物宜快有人破。 自有必中意，何人若得知。 龙飞方见涧，霖雨正当时。 □□　第十二　下下　污行不明 污行欺心昧彼苍，鬼神常切守行藏。 若教慢易能缴福，不向人间别善良。 杨花风卷无消息，恰似襄王一梦中。 夜静月明风细处，空飘零落惹芳丛。 可知笑杀人问客，昨见他贫却有钱。 若不用心终不得，须知已后得周全。",
      "translated_text": "Marriage remains steady, lawsuits incur no loss.\nClinging to the old is unwise—lest one face humiliation.\nRegarding wealth: for scholars in trade, full profit awaits;\nLight goods are easy to acquire, and sales proceed smoothly.\nMoving residence is inauspicious.\nLawsuits turn favorable, yet all matters meet obstruction.\nTravelers arrive in two or three days—if not, trust the news.\nJourneys prove auspicious.\nThe sick recover in three to five days without harm;\nProlonged illness may require a vow, but pox brings good fortune.\nMarriage is favorable, and seeking wealth through marriage succeeds.\nLawsuits should be settled amicably.\nPurchases—be it property, servants, livestock, or textiles—face delays but will conclude.\nChildbirth yields a noble son, safe and sound.\nAll matters should be hastened, for delay invites trouble.\nRelying on others brings good fortune; household and family remain at peace.\nDocuments bear an auspicious aura; transactions should be swift—delay risks failure.\nRelocation and commerce prosper.\nSeeking medicine or official promotion brings success.\nBorrowing should be done quickly, for others may interfere.\nWhat one desires will surely come to pass—\nIf only someone could know!\nWhen the dragon soars, the ravine appears;\nThe timely rain falls just as it should.\n\n[Missing characters] Twelfth: Lowest of the Low—Foul Conduct Obscures Clarity\n\nFoul conduct deceives the heart, betraying Heaven’s gaze;\nGhosts and spirits ever watch one’s hidden ways.\nIf arrogance could summon fortune’s grace,\nNo good would walk the earth in human form.\n\nWillow catkins swirl on the wind, lost without trace—\nLike King Xiang’s dream, fleeting as a breath.\nIn the quiet of night, beneath the moon’s pale glow,\nThey drift and scatter, entangling the fragrant groves.\n\nOne may laugh at the traveler’s tale:\nYesterday he was poor—today, rich with coin.\nYet without diligence, nothing is gained;\nKnow this: only later comes fulfillment.",
      "overlap_context": "e, an old friend is met, and they drink together,\nThe wine bill is paid, and they toast one another again.\n\nWhy rush matters when setting out?\nEven hurrying to Chang’an takes three days.\nBetter to stay home and heed the news,\nFor affairs must be witnessed firsthand to bring glory.\n\nThe Sage’s intent declares:\nTalents and skills long buried in dust,\nThe time approaches when the path will open,\nBringing success and fulfillment to plans.\nMost fitting to pursue aspirations,\nYet impossible to linger.",
      "start_char": 4396,
      "end_char": 4755,
      "start_sentence": 314,
      "end_sentence": 336,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.290485382080078,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "圣意云：内外倾欺，鬼神不佑。 凡事动作，必惧凶咎。 若谋若为，举难成就。 消谴谢过，庶禳容咎。 举动未遂，且宜守旧。 此签大吉，百事皆谬。 占财，买卖置货吉，脱货好有财。 公讼吉，移居不吉。 帮四、二十六、四十八、三十四，用事出行主有灾。 行人三二日到，如不至，在外有事。 病老少，犯土并咒愿，出宗在外，有家先求之，新愿早还，迟难保。 痘疮凶，保息吉。 婚姻入舍大凶。 求达升职名分不达。 买田宅人口头疋不吉，谋事成事勾当俱不利。 产孕难，家宅人口不宁，宜保福。 托人为事不济，人物难寻。 通达翻为厄，忧疑亦紧怀。 奈河迍未过，析福免凶灾。 □□　第十三　中平　坚勤守旧 立性恭勤不慢神，与人交易自均平。 如何动得冤怜报，孰若收心且守成。 花开结子喜逢时，赖得春工造化机。 求望所谋皆遂意，衣锦还乡事可期。 事意长时时意长，中问一段最高强。 依时可用无心慢，衣锦还乡拜父娘。 圣意云：素怀敬信，不慢於神。 行止公正，不欺於人。 人将归怨，反累其身。 何如求静，且守其真。 不宜谋望，守旧惟新。 占财，平置货不吉，动用不吉。 公讼不吉，种田看时节。 出行不利，行人未至。 病不问老少，久淹宁公耐时，急难脱，析福保佑。",
      "translated_text": "The Sage’s Intent declares:\nDeceit within and without—ghosts and spirits offer no protection.\nIn all affairs and movements, one must fear misfortune and blame.\nWhether plotting or acting, all endeavors prove difficult to achieve.\nAtoning for transgressions and seeking forgiveness may yet avert calamity.\nBefore any action comes to fruition, it is best to maintain the status quo.\nThough this slip is deemed greatly auspicious, all matters go awry.\n\nFor wealth: buying, selling, and stocking goods is favorable; selling brings profit.\nFor litigation: auspicious. For relocation: inauspicious.\nOn days marked by the fourth, twenty-sixth, forty-eighth, or thirty-fourth,\nundertaking journeys invites disaster.\nTravelers will arrive in two or three days; if not, they are detained by matters abroad.\nFor illness, whether young or old: afflicted by earth spirits or unfulfilled vows,\nor one who has left the ancestral line and resides elsewhere—first seek aid from the household,\nfulfill new vows swiftly, for delay endangers recovery.\nFor pox: ominous; preserving life brings good fortune.\nFor marriage: entering the groom’s home is greatly inauspicious.\nFor advancement or promotion: aspirations remain unfulfilled.\nFor purchasing land, homes, or livestock: inauspicious.\nAll schemes, plans, and undertakings prove unfavorable.\nFor childbirth: difficult. Household and family are unsettled—seek blessings for peace.\nRelying on others for matters brings no success; people are hard to find.\nSuccess turns to adversity; anxiety weighs heavily on the heart.\nThe trials of the Nai River are not yet passed—pray for blessings to avert misfortune.\n\n□□ Thirteenth: Middling—Perseverance in the Old Ways\n\nA steadfast nature, reverent and diligent, never slighting the gods;\nIn dealings with others, one remains fair and just.\nHow can one provoke resentment and reproach?\nBetter to withdraw the heart and preserve what is already achieved.\n\nFlowers bloom and bear fruit, meeting their timely season,\nRelying on the workings of spring’s transformative power.\nAll hopes and plans come to fruition,\nAnd the dream of returning home in brocade robes may yet be realized.\n\nAffairs endure, and so too does intent—\nYet amid them, a single moment stands strongest.\nAct in accord with the times, without negligence,\nAnd return home in brocade to pay homage to father and mother.\n\nThe Sage’s Intent declares:\nOne’s nature is reverent and faithful, never slighting the gods.\nConduct is upright and just, never deceiving others.\nWhen others harbor resentment, it rebounds upon oneself.\nHow much better to seek stillness and preserve one’s true nature?\nDo not pursue new schemes—maintain the old, and renewal will follow.\n\nFor wealth: ordinary transactions and stocking goods are inauspicious; expenditures bring no good.\nFor litigation: inauspicious. For farming: observe the seasons.\nFor travel: unfavorable. Travelers have not yet arrived.\nFor illness, regardless of age: prolonged suffering requires patience;\nIn urgent cases, recovery is difficult—pray for blessings and protection.",
      "overlap_context": "irits ever watch one’s hidden ways.\nIf arrogance could summon fortune’s grace,\nNo good would walk the earth in human form.\n\nWillow catkins swirl on the wind, lost without trace—\nLike King Xiang’s dream, fleeting as a breath.\nIn the quiet of night, beneath the moon’s pale glow,\nThey drift and scatter, entangling the fragrant groves.\n\nOne may laugh at the traveler’s tale:\nYesterday he was poor—today, rich with coin.\nYet without diligence, nothing is gained;\nKnow this: only later comes fulfillment.",
      "start_char": 4756,
      "end_char": 5264,
      "start_sentence": 337,
      "end_sentence": 371,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.796913623809814,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "痘疮亦然。 婚姻入舍，求嗣平平。 走失耐心后见。 买田宅、人口、头疋，宜迟成。 求官升职有名分，家宅平安，谋事成事，勾当耐心，亦不宜快。 产孕安心平难，借物不济。 求医学艺耐心，迁移不利文书迟见。 碌碌心无定，耕田力上轻。 待时方可用，云散月重生。 □□　第十四　下下　不宁 是非无别闹啾啾，诉讼殷恋不慢休。 财散人离多坎坷，全身远害省责求。 龙蛇混杂卒难禁，未得风云变化鳞。 一日腾云归北海，那时方得现龙身。 闻知路险去为难，你道为难却不难。 便好登途涉水去，周回事已得平安。 圣意云：是非交结，论讼争先。 人离财散，损失难蠲，莫贪动作，庶保其全，远行不利，婚姻无缘。 病者未瘥，祈祷苍天。 守常安分，可兔灾迍。 占买卖，置货不吉，脱货好。 公讼无事，病者破财，犯土修福保佑。 种田未收。 行人便至，出行不利，恐有灾。 失物难寻不见，交易不利。 婚姻不利，买田宅人口头疋不利。 文书不气相，借物不济。 家宅人口不宁，求官升职未达。 迁移不利，托人用事不利。 产孕子母或有或亡不利。 忧若为言非，昏昏路正迷。 佳人井吊水，篮管是空归。 □□　第十五　上上　守节岁德 事宜素定合天机，休听师巫说是非。 遵正不依他大道，自然门户发光辉。 月满今宵离海边，时人感仰丽春天。 清光烁处群星退，君子营谋便得官。 去年曾在此闲居，今日因来作故闲。 便好求财居福禄，亚人已被恶人驱。 圣意云：人心积善，久滞未通。 求神问卜，妄冒尤空。 坚正守节，莫厌迍蒙。 大器晚成，时当过逢。 进取谋运，所事亨通。 病者自瘥，莫外是空。 占财，买卖吉，脱货吉。 种田迟薄收，买田宅人口头疋迟吉利。 出行待签日交节，行人初一、初八、十五、二十三至。 托人用事先难后易。 病伤寒，不问老少迟痉交节令。",
      "translated_text": "The pox likewise follows this pattern.\nFor marriage and entering a household: mediocre prospects for heirs.\nLost items will reappear with patience.\nPurchasing fields, houses, servants, or livestock should be delayed in completion.\nSeeking office or promotion brings honorable status; the household is at peace.\nPlans and undertakings come to fruition—proceed with patience, not haste.\nChildbirth requires calm; difficulties will pass.\nBorrowed items will not be repaid.\nLearning medicine or crafts demands patience.\nMoving is unfavorable; documents will be delayed.\nBusy yet unsettled in heart, tilling the fields with little strength.\nWait for the right time—then use it.\nWhen clouds disperse, the moon is reborn.\n\n[Missing character] Fourteenth: Most Inauspicious\nRestlessness\nRight and wrong blur in clamorous strife; lawsuits drag on without cease.\nWealth scatters, people part, and hardships multiply.\nPreserve yourself, avoid harm, and reduce blame.\nDragons and snakes intermingle, difficult to restrain;\nThe scales of wind and cloud have yet to transform.\nOne day, riding clouds to return to the Northern Sea,\nOnly then will the dragon’s true form appear.\n\nHearing the road is perilous makes the journey seem hard—\nYet you say it is hard, but it is not.\nBetter to set out, cross the waters,\nAnd return home to find all settled and safe.\n\nThe Sage’s Intent declares:\nEntangled in right and wrong, contending in litigation.\nPeople part, wealth scatters, losses are hard to recover.\nDo not covet action—preserve your wholeness.\nTravel is unfavorable; marriage has no affinity.\nThe sick have not recovered—pray to Heaven.\nAbide by constancy and duty to avoid misfortune.\n\nFor business: stocking goods is inauspicious; selling is favorable.\nLitigation brings no trouble; the sick will lose wealth—\nAppease the earth and perform blessings for protection.\nFarming yields no harvest.\nTravelers will arrive soon; journeys are unfavorable—beware of disaster.\nLost items are hard to find and will not be seen.\nTransactions are unfavorable.\nMarriage is unfavorable; purchasing fields, houses, servants, or livestock is inauspicious.\nDocuments lack qi alignment; borrowed items will not be repaid.\nThe household and its members are restless.\nSeeking office or promotion will not succeed.\nMoving is unfavorable; relying on others for matters is inauspicious.\nChildbirth endangers mother or child—neither is favorable.\n\nAnxious as if accused of wrongdoing,\nBewildered, the right path is lost.\nA fine lady draws water from the well,\nBut the basket and pipe return empty.\n\n[Missing character] Fifteenth: Most Auspicious\nUpholding Integrity, the Year’s Virtue\nMatters should be settled in accord with Heaven’s design—\nDo not heed the diviner’s or shaman’s disputes.\nFollow the great Dao with rectitude,\nAnd your household will naturally shine with radiance.\n\nThe moon, full tonight, departs the sea’s edge;\nPeople gaze in admiration at the beauty of spring.\nWhere its pure light gleams, the stars retreat—\nThe nobleman’s schemes secure office.\n\nLast year, you dwelled here in leisure;\nToday, you return as if to an old friend.\nIt is good to seek wealth and abide in fortune—\nThough petty men have been driven away by the wicked.\n\nThe Sage’s Intent declares:\nA heart that accumulates goodness, though long obstructed, will not be denied.\nSeeking gods or divination is reckless and vain.\nUphold integrity and constancy—do not weary of hardship.\nGreat vessels are late in completion; the time will come when all aligns.\nIn pursuit and planning, all affairs will prosper.\nThe sick will recover—do not seek external illusions.\n\nFor wealth: business is auspicious; selling goods is favorable.\nFarming yields a late, modest harvest.\nPurchasing fields, houses, servants, or livestock is auspicious after delay.\nTravel should wait for an auspicious day at the solar term;\nTravelers will arrive on the 1st, 8th, 15th, or 23rd.\nRelying on others for matters is difficult at first, then easy.\nIllness is from cold damage—regardless of age, recovery comes after the solar term.",
      "overlap_context": "How much better to seek stillness and preserve one’s true nature?\nDo not pursue new schemes—maintain the old, and renewal will follow.\n\nFor wealth: ordinary transactions and stocking goods are inauspicious; expenditures bring no good.\nFor litigation: inauspicious. For farming: observe the seasons.\nFor travel: unfavorable. Travelers have not yet arrived.\nFor illness, regardless of age: prolonged suffering requires patience;\nIn urgent cases, recovery is difficult—pray for blessings and protection.",
      "start_char": 5264,
      "end_char": 6009,
      "start_sentence": 372,
      "end_sentence": 421,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.182422399520874,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "痘疮宜保福平稳，阴人占病不好。 婚姻迟有人破，重婚入舍，求嗣迟吉。 公讼吉，走失交节见，不见有信。 谋事成事撞节日成，迟有少无多。 迁移迟利，文书迟有。 求官升职除授了，交节完备。 产孕交节日，生贵子。 家宅人口平稳，借物迟有些小。 玉石未分明，忧心更转疑。 前逢通大道，花发应残枝。 □□　第十六　下下　守分 履危陆险逢饥虎，涉水行舟溺怒涛。 守分安闲灾可度，且於恩德报劬劳。 油烛点灯灯易灭，才挑得起又衰微。 长心挑尽空劳力，何似抽身早去归。 求财所用知真趣，识得之时大有财。 三日价高无四日，依然平地一声雷。 圣意云：忘本逐末，酷恣贪求，陆行遇虎，水泛沉舟。 且宜守旧，报得有休，苔谢上穹，久病渐痒。 百事不宜，忘得添忧。 知过必改，得度春秋。 占财，买卖独行凶，置货不好，脱货吉。 公讼无事，交易成后口舌。 出行凶，行人便至，若一二日不到，主有凶不祥之事。 迁移不利，老者久淹，少者宜修善，保无事求祖先。 婚姻入舍不利，家宅人口宜保佑凶。 托人用事不成，生物不见，知信也难寻，有口舌。 产孕难，宜保佑。 求官升职名分不达。 欲吉过重山，家乡转可悲。 横舟相对月，凄惨有谁知。 □□　第十七　下下　待时向善 忧危灾厄所从来，谋事迪遭更破财。 稚弱不忧成久滞，耆年惟恐起悲哀。 当初得意翻成失，今日忧危事不危。 若遇贵人相举援，千年枯木再生枝。 此事为时急似风，一朝两日任西东。 若行三日愁来到，立便行时方可从。 圣意云：四隅造作，伤犯土府。 勿罹灾危，久而未苏，不宜老病，小口无虞。 速当禳谢，次第而苏。 求谋迟遂，婚姻徐徐。 百事赠蹬，莫若荣枯。 占买卖，目下有利，买货吃物大吉，脱货好。 田种苗而不秀，出行凶。 行人在外多日，到迟有阻。 病老少，犯土速求先亡，老者难保。 疸疮迟，可求七十二候。 走失离寻，文书不遂。 初婚迟成，重婚凶入舍。 求嗣迟吉，借物少有，兴贩不利。 占讼吉，买田宅人口俱不利。 迁移不利，谋事成事不济。 产孕宜快，迟难保佑。 托人用事成，求官升职。 见贵人吉，针灸宜迟亦好。 叆叆乌云起，求名未得名。 四隅伤土禁，作福保安宁。 □□　第十八　中平　随缘 时当挚敛最宜收，运用随缘莫外求。 老病久痾宜保庇，事於梅腊得优游。 养汝原来岁月深，开笼不见意况沉。 想应只在秋江上，明月芦花何处寻。 守分安闲事可宜，求财利益报君知。 於中平善君多喜，一日丰盈正及时。 圣意云：谋望宜春夏，秋冬事总休。 祈求延老病，在路兔迟留。 凡事谋望，春夏可求。 秋冬如用，事事总休。 老者向病，祷祝宜修。 久行祈佑，庶兔迟留。 事宜时用，祈福免忧。 占财货，春夏吉，脱货随分。 种田有收，公讼春夏无事，秋冬不利。 病久淹，春夏轻，秋冬老者难，少者轻。 宜求福，有善愿。 痘疮春夏吉，秋冬不利。 出行便动，行人春夏三日至秋冬有阻。 婚姻入舍，求嗣上半年吉，下半年不利，有灾。 文书不利，兴贩不利。 买田宅、人口不利，失物难寻。 家宅不利，借物上半年有，下半年无。 托人用事，上半年吉，下半年不利。 迁移春夏吉。 产生贵子，秋冬生无妨。 谋事成事，脱货便脱，置货春吉。",
      "translated_text": "For pox and sores, preserve blessings and maintain stability—if consulted by a woman, the prognosis is poor.\nMarriage will be delayed or disrupted; a second marriage may bring discord. Seeking heirs will be auspicious after delay.\nLitigation is favorable; lost items will be found at the solar term, though no news arrives beforehand.\nPlans and accomplishments will succeed if timed to the solar term, though later gains will be modest.\nRelocation is auspicious after delay; documents will arrive late.\nSeeking office or promotion will be finalized and complete at the solar term.\nChildbirth on the solar term will bring a noble son.\nHousehold and family remain stable; borrowed items will be returned late with minor issues.\nJade and stone remain indistinct—anxiety deepens into doubt.\nAhead lies the great Dao’s thoroughfare, yet blossoms bloom on withered branches.\n\n◇◇　Hexagram Sixteen　Most Inauspicious　Hold to One’s Role\nTreading perilous heights, one meets starving tigers;\nCrossing waters by boat, one drowns in raging waves.\nHold to your role and remain at ease—disaster may yet pass.\nRepay kindness and toil with gratitude.\nOil lamps flicker and dim, barely lit before fading.\nLong wicks burn out in vain effort—\nBetter to withdraw early and return home.\nIn seeking wealth, know the true essence;\nOnce grasped, great fortune follows.\nThree days of high prices, then none—\nAll returns to earth with a single thunderclap.\n\nThe Sage’s Intent:\nAbandoning roots for branches, indulging in greed and excess,\nOne meets tigers on land, sinks with boats at sea.\nBetter to uphold the old and repay kindness—\nMoss withers beneath the heavens, long illness gradually eases.\nNothing fares well; forgetting brings added sorrow.\nRecognize faults and amend them—\nThen may one pass through spring and autumn safely.\n\nFor wealth: solo business ventures are inauspicious; purchasing goods is unfavorable, but selling is auspicious.\nLitigation will resolve without incident, though disputes may follow completed transactions.\nTravel is inauspicious; travelers will arrive soon—if delayed one or two days, misfortune or ominous events may occur.\nRelocation is unfavorable; the elderly may suffer prolonged illness, while the young should cultivate virtue to avoid misfortune and seek ancestral protection.\nMarriage brings discord upon entering the household; protect the household and family from misfortune.\nRelying on others for matters will fail; livestock will not appear, and news will be hard to find, with disputes arising.\nChildbirth is difficult—protection is needed.\nSeeking office or promotion will not succeed.\nTo find fortune, cross towering mountains—\nYet returning home may bring sorrow.\nMoonlight shines on a moored boat,\nBut who knows the chill and desolation?\n\n◇◇　Hexagram Seventeen　Most Inauspicious　Await the Time and Turn to Goodness\nWorry, danger, and calamity arise from whence?\nPlans repeatedly fail, bringing further financial loss.\nThe young need not fear prolonged stagnation,\nBut the elderly must guard against sorrow’s onset.\nPast triumphs now turn to loss;\nToday’s fears prove unfounded.\nIf one encounters a noble’s aid and support,\nA thousand-year withered tree may sprout new branches.\n\nThis matter presses like the wind—\nA day or two may shift with the west or east.\nIf delayed three days, sorrow arrives;\nAct at once when the time is right.\n\nThe Sage’s Intent:\nBuilding in the four directions offends the Earth’s domain.\nAvoid disaster and peril—prolonged recovery follows.\nThe elderly and ill should not linger;\nChildren face no immediate danger.\nSwiftly perform exorcisms and offerings—\nThen may one recover in due order.\nPlans and marriages will succeed after delay.\nAll affairs falter—better to accept rise and fall.\n\nFor business: immediate profit is possible; purchasing goods or food is highly auspicious, and selling is favorable.\nCrops will sprout but not flower; travel is inauspicious.\nTravelers abroad for many days will arrive late with obstacles.\nIllness in the young or old offends the earth—seek the departed swiftly; the elderly may not recover.\nPox and sores will resolve late—consult the seventy-two seasonal markers.\nLost items are hard to find; documents will not proceed.\nFirst marriages succeed after delay; second marriages bring misfortune upon entering the household.\nSeeking heirs is auspicious after delay; borrowed items will be few; trade is unfavorable.\nLitigation is favorable; purchasing fields, houses, or servants is inauspicious.\nRelocation is unfavorable; plans and accomplishments will not succeed.\nChildbirth should proceed swiftly—delay risks protection.\nRelying on others for matters will succeed; seeking office or promotion is favorable.\nMeeting nobles is auspicious; acupuncture and moxibustion are better delayed, though still beneficial.\nDark clouds gather thickly—\nSeeking rank has not yet borne fruit.\nBuilding in the four directions offends the earth—\nPerform blessings to ensure peace.\n\n◇◇　Hexagram Eighteen　Moderately Auspicious　Follow Circumstances\nThe time calls for gathering and storing—act in accord with circumstances, seek nothing beyond.\nThe elderly and long-ill require protection;\nAffairs in late winter and early spring will proceed smoothly.\nYou have nurtured them through long months,\nYet opening the cage, their intent remains unseen.\nPerhaps they linger by an autumn river—\nWhere to find them amid moonlit reeds?\n\nHold to your role and remain at ease—affairs will proceed well.\nIn seeking wealth, profits will repay your efforts.\nIn moderation and goodness, you will find much joy;\nA single day’s abundance arrives just in time.\n\nThe Sage’s Intent:\nPlans and hopes are suited to spring and summer;\nIn autumn and winter, all endeavors should cease.\nPray for the recovery of the elderly and ill;\nOn the road, avoid delay.\nFor all plans and hopes,\nSpring and summer are the time to seek.\nIn autumn and winter, if pursued,\nAll affairs will come to naught.\nThe elderly tend toward illness—\nPrayers and offerings should be made.\nLong journeys require protection—\nThen may one avoid delay.\nAct in accord with the time;\nPray for blessings to avert sorrow.\n\nFor goods and wealth: spring and summer are auspicious; sell goods as circumstances allow.\nFarming will yield a harvest; litigation in spring and summer resolves without incident, but autumn and winter are unfavorable.\nProlonged illness is lighter in spring and summer; in autumn and winter, the elderly face difficulty, while the young fare lightly.\nPerform blessings and fulfill good vows.\nPox and sores are auspicious in spring and summer, inauspicious in autumn and winter.\nTravel may proceed at once; travelers will arrive in three days in spring and summer, but face obstacles in autumn and winter.\nMarriage brings discord upon entering the household; seeking heirs is auspicious in the first half of the year, inauspicious in the latter half, with potential disaster.\nDocuments are unfavorable; trade is unfavorable.\nPurchasing fields, houses, or servants is inauspicious; lost items are hard to find.\nHouseholds face misfortune; borrowed items are available in the first half of the year, but not in the latter.\nRelying on others for matters is auspicious in the first half of the year, inauspicious in the latter.\nRelocation is auspicious in spring and summer.\nChildbirth will bring a noble son; autumn and winter births pose no harm.\nPlans and accomplishments will succeed; sell goods promptly, and purchase goods in spring.",
      "overlap_context": "er.\nThe sick will recover—do not seek external illusions.\n\nFor wealth: business is auspicious; selling goods is favorable.\nFarming yields a late, modest harvest.\nPurchasing fields, houses, servants, or livestock is auspicious after delay.\nTravel should wait for an auspicious day at the solar term;\nTravelers will arrive on the 1st, 8th, 15th, or 23rd.\nRelying on others for matters is difficult at first, then easy.\nIllness is from cold damage—regardless of age, recovery comes after the solar term.",
      "start_char": 6009,
      "end_char": 7302,
      "start_sentence": 422,
      "end_sentence": 507,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.13039493560791,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "自此常逢吉，家丰应保扶。 腊时好遇得，方可得良图。 □□　第十九　上上　良木逢春 百昌生土正逢春，暖律潜回态度新。 若也运为当此景，好看久垫奋芳辰。 云行雨施正春深，谋望求财总遂心。 争讼见官多得理，贵人喜庆自相寻。 休听人来讼短长，虽然得也不高强。 别行佳贶为宜利，有日光阴大吉昌。 圣意云：除旧而新，生理向荣。 谋望有就，求选成名，行人通达，公讼无刑，秋冬若阻，百事沉吟。 春夏占吉，用事亨通。 孕妇平稳，不阻忧惊。 占财，贸卖春夏间，有置货春吉，十二月好，余月不用。 脱货迟，公讼无事。 种田，春种秋收轻微。 借物春有，余月无用，出行吉，行人春占，起身余月，迟不动。 病老少，春夏十月吉，余月迟难。 文书正、二月、十月吉，余月迟。 婚姻初婚吉，重婚不利，求嗣宜快。 家宅人口平安，春十月吉，余月不中。 谋事成事，正、十月有财气，余月不称意。 托人用事，春、十月吉，余月无用。 产孕春生贵子，秋冬不利。 重重霖雪裹，嫩柳遇春时。 谋望皆如此，黄金色有辉。 □□　第二十　下下　危难空亡 逐急求神强秉诚，此诚那解格神明。 临危只恐危难保，望事应知事不成。 有舟无楫难撑载，更被漂流向海中。 嗟叹世人应不得，误人如此走西东。 有人用事事难成，事已成时便去程。 汝若求之终不吉，求之占得则安宁。 圣意云：人心怠慢，淫污渎神。 占危厄险，占病沉吟。 谋事难就，婚姻难成。 独宜崇福，保庇其就。 公讼失理，交易伤情，欲行求吉，速达上穹。 占财，少置货吉，脱货便脱。 公讼阻滞，婚姻吉。 诸事成，种田休种。 病冒渎家神，有阻隔沉重，宜析福，久淹未安，先重后轻，防再添病，出行不利，行人未至。 买田宅、人口成，也不长久，不利。 走失难寻，托人无事。 文书透空，家宅人口不宁。 借物无，求官升职，见贵人不就巧。 □□　第二十一　下下　守旧淹滞 美玉明珠不易求，盖因承庆合前修。 能知寿天真消息，碌碌怀忧空白头。 馄化为鹏海浪翻，阴阳交泰太平间。 庶人蓦有凌云志，平地雷声振垫还。 眼前光景事艰难，每日寻思改旧颜。 买卖求财财已远，用之心下莫心寒。 圣意云：积善有庆，吉庆门庭。 积恶致祸，祸及门庭。 理合自然，何必沉沦。 嗣续难存，行藏不吉。 百事莫建，且守君心。 占财，买卖旧货好，脱不利。 种田秀，向不实。 出行不利，行人至病。 不问老少，目下一二日好，如迟难，疸疮亦然。 婚姻吉，求嗣不利。 交易难成，公讼吉。 买田宅、人口、头疋不利，失物难寻，谋事成事不吉。 生产难，借物不利，学艺不利，求官名分未达。 迁移不利，托人用事不利，文书未遂。 明月暗云浮，前程莫远途。 求财多损失，灾病未能苏。 □□　第二十二　大吉　后吉 行艺惇修学问精，性从澄水自渊明。 久怀至宝宁无价，得价方知价不轻。 凤凰飞出林间去，展翅飞来伏众禽。 一旦身荣朝上阙，四方钦羡尽闻名。 跨马长途紧着鞭，一朝两日便朝天。 京华作个逍遥客，早到为官信有缘。 圣意云：素勤学识，时运未亨。 久淹困危，谋运未能。 时将旧达，枯木向荣。 何须远虑，万事皆成。 公讼利泰，所作称心。 求谋遂意，出入咸亨。 占财，买卖时下便见些小，置货财轻，脱货迟。",
      "translated_text": "From this point onward, fortune constantly smiles; the household prospers and receives protection.\nAt the year’s end, favorable encounters arise—only then may grand plans succeed.\n\n◇◇ 19 ◇◇ Most Auspicious ◇◇ Fine Wood Meets Spring\n\nA hundred blessings stir as earth meets spring’s return,\nWarm breaths revive, all things assume their freshest mien.\nShould fortune align with this season’s radiant scene,\nBehold the long-delayed dawn of fragrant days unfold.\n\nClouds drift and rain descends in spring’s deep embrace;\nAll schemes and wealth-seeking find their heart’s desire.\nDisputes with officials yield just outcomes fair,\nWhile noble ones seek joy and blessings in their wake.\n\nHeed not the clamor of others’ praise or blame—\nThough gains may come, they lack true strength or height.\nPursue fresh ventures for profit’s sure delight;\nThe days ahead shall shine with boundless, bright success.\n\nThe Sage’s intent declares:\nCast off the old and welcome the new; life flourishes in vibrant growth.\nPlans come to fruition; promotions and fame are secured.\nTravelers journey smoothly; lawsuits incur no penalty.\nShould autumn or winter bring delay, all matters stall in hesitation.\nSpring and summer divinations prove auspicious; undertakings flow unhindered.\nPregnant women remain at ease, free from distress or fright.\n\nFor wealth: trade and sell in spring and summer; purchasing goods in spring is favorable.\nThe twelfth month is also good; other months are not advised.\nSelling goods may be slow; lawsuits resolve without incident.\nFor farming: spring planting yields modest autumn harvests.\nBorrowed items are available in spring; other months prove useless.\nTravel is auspicious; for travelers, spring divinations favor departure—other months delay action.\nIllness in the young or old finds relief in spring, summer, or the tenth month; other months bring slow recovery.\nDocuments fare well in the first, second, and tenth months; other months delay progress.\nFirst marriages are auspicious; remarriage is inauspicious. Seek heirs swiftly.\nHouseholds and family members remain at peace; spring and the tenth month are favorable—other months are unsuitable.\nPlans and accomplishments thrive in the first and tenth months, bringing financial fortune; other months bring dissatisfaction.\nRelying on others for matters is auspicious in spring and the tenth month; other months prove useless.\nChildbirth in spring yields a noble son; autumn and winter births are inauspicious.\n\nEndless snow envelops all,\nYet tender willows meet spring’s call.\nAll schemes unfold in such a way—\nGold’s luster gleams with radiant sway.\n\n◇◇ 20 ◇◇ Most Inauspicious ◇◇ Peril and Void\n\nIn haste, one seeks the gods with forced sincerity,\nYet such devotion fails to move the divine.\nFacing peril, one fears no safety can be found;\nAll hopes dissolve—success remains beyond reach.\n\nA boat without oars drifts helplessly,\nSwept by currents toward the boundless sea.\nAlas, how many souls are led astray,\nWandering east and west in vain pursuit.\n\nThose who act find their affairs unfulfilled;\nOnce achieved, they swiftly turn away.\nIf you seek this fate, all proves inauspicious—\nOnly through divination may peace be secured.\n\nThe Sage’s intent declares:\nHuman hearts grow lax, defiling the sacred with impurity.\nPeril and danger loom; illness lingers in hesitation.\nPlans falter; marriages fail to form.\nOnly through reverent offerings may protection be secured.\nLawsuits end in defeat; trade brings sorrow.\nTo seek fortune in travel, swiftly appeal to the heavens above.\n\nFor wealth: purchasing few goods is auspicious; sell promptly when possible.\nLawsuits face obstruction; marriages prove favorable.\nMost matters conclude, but avoid planting crops.\nIllness stems from disrespect to household deities—obstacles weigh heavily.\nOffer prayers for blessings; prolonged suffering may ease, turning from grave to mild.\nBeware of further affliction. Travel is inauspicious; travelers have not yet arrived.\nPurchasing fields, houses, or servants may succeed, but gains will not endure—all proves unfavorable.\nLost items are hard to recover; relying on others brings no result.\nDocuments lack substance; households and family members know no peace.\nBorrowed items are unavailable; seeking office or promotion meets no success with superiors.\n\nFor fields and homes: spring planting brings light autumn yields.\nBorrowed items are available in spring; other months prove useless.\nTravel is auspicious; for travelers, spring divinations favor departure—other months delay action.\nIllness in the young or old finds relief in spring, summer, or the tenth month; other months bring slow recovery.\nDocuments fare well in the first, second, and tenth months; other months delay progress.\nFirst marriages are auspicious; remarriage is inauspicious. Seek heirs swiftly.\nHouseholds and family members remain at peace; spring and the tenth month are favorable—other months are unsuitable.\nPlans and accomplishments thrive in the first and tenth months, bringing financial fortune; other months bring dissatisfaction.\nRelying on others for matters is auspicious in spring and the tenth month; other months prove useless.\nChildbirth in spring yields a noble son; autumn and winter births are inauspicious.\n\n◇◇ 21 ◇◇ Most Inauspicious ◇◇ Stagnation and Delay\n\nFine jade and bright pearls are not easily won—\nTheir blessings align with past merits long sown.\nTo grasp the truth of fate’s rise and fall,\nOne frets in vain, graying before their time.\n\nA fish transforms into a roc, riding ocean waves,\nAs yin and yang harmonize in times of peace.\nEven common folk may harbor lofty dreams—\nA thunderous roar from flat ground stirs all anew.\n\nThe present scene is fraught with hardship’s weight;\nEach day, one seeks to shed the old for change.\nTrade and wealth slip ever out of reach—\nYet in your heart, let no despair take root.\n\nThe Sage’s intent declares:\nAccumulated virtue brings blessings to the household.\nAccumulated vice invites calamity to the door.\nAll follows nature’s course—why sink into despair?\nHeirs are hard to secure; all undertakings falter.\nBegin nothing new; guard your heart and wait.\n\nFor wealth: trading old goods is favorable; selling proves inauspicious.\nFarming yields blossoms but no fruit.\nTravel is inauspicious; travelers arrive ill.\nFor illness, young or old, the next day or two may bring relief—delay brings difficulty. The same holds for pox.\nMarriages are auspicious; seeking heirs is inauspicious.\nTrade is hard to conclude; lawsuits prove favorable.\nPurchasing fields, houses, servants, or livestock is inauspicious. Lost items are hard to recover.\nPlans and accomplishments prove inauspicious.\nChildbirth is difficult; borrowed items are unavailable.\nLearning crafts is inauspicious; seeking office or rank meets no success.\nRelocation is inauspicious; relying on others for matters brings no result.\nDocuments remain unresolved.\n\nA moon veiled by dark clouds drifts,\nNo distant paths lie ahead.\nWealth brings loss; misfortune lingers—\nIllness yet finds no cure.\n\n◇◇ 22 ◇◇ Greatly Auspicious ◇◇ Later Fortune\n\nOne refines their craft with diligence, mastering knowledge deep,\nTheir nature as clear as still waters, profound and bright.\nLong cherished treasures hold boundless worth—\nOnly when sold does their true value shine.\n\nA phoenix takes flight from the forest,\nSpreading its wings to soar above all birds.\nOne day, it ascends to the imperial court,\nAdmired and renowned in every land.\n\nSpur the horse on the long road ahead,\nReaching the capital in a day or two.\nIn the imperial city, a carefree guest—\nEarly arrival secures office, fate’s design.\n\nThe Sage’s intent declares:\nThrough steadfast study, one’s talents remain unrecognized—\nLong mired in hardship, plans fail to unfold.\nYet when the time comes, old paths lead to renewal,\nLike withered wood blooming anew.\nNo need for distant worries—all matters shall succeed.\nLawsuits bring peace; all actions align with desire.\nPlans come to fruition; all endeavors prosper.\n\nFor wealth: trade and sales yield modest gains in the present.\nPurchasing goods brings light profit; selling may be slow.",
      "overlap_context": " fields, houses, or servants is inauspicious; lost items are hard to find.\nHouseholds face misfortune; borrowed items are available in the first half of the year, but not in the latter.\nRelying on others for matters is auspicious in the first half of the year, inauspicious in the latter.\nRelocation is auspicious in spring and summer.\nChildbirth will bring a noble son; autumn and winter births pose no harm.\nPlans and accomplishments will succeed; sell goods promptly, and purchase goods in spring.",
      "start_char": 7303,
      "end_char": 8638,
      "start_sentence": 508,
      "end_sentence": 590,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.37914752960205,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "行人至，公讼吉。 出行不利，病老幼，沉重不妨，疸疮平稳，种田秀而不实，婚姻求嗣不利。 买田宅、人口、头疋宜，逢家宅人口平安。 谋事成事，宜迟后方吉。 失物迟久后见，借物迟吉。 兴贩吉，迁移迟好。 产孕生男好，聪明吉。 求医学业迟好，求官升职远大吉利。 文书十分气象迟亦好，交易宜快迟不利。 改革初逢变，光浮道合通。 文书策驿禄，得达庆年丰。 □□　第二十三　中平　时阻之象 物是人非莫系怀，恐成冤讼反相催。 虽然心地明如镜，争奈时迍福未来。 种得桃株满院东，花开遭雨又遭风。 当初指望收桃吃，等到如今只是空。 神仙妙用事何如，汝若为之绝世奇。 道果圆成丹炼就，金门升入正当时。 圣意云：时迍运骞，多是多非，尽劳心力，谁念忧疫。 切宜守旧，且待於时。 先凶后吉，谋望稽迟。 求婚远遂，讼者无危。 百事宽制，何用忧疑。 占财，买卖越迟利高，置货好，脱贷应迟好。 诸事守静稳，出行平，行人未至。 心动身不动有阻，公讼宜劝和无事。 病老伤寒不访，久淹沉重，痘疮保福。 买田宅，人口宜迟吉，家宅人口平安。 失物难寻，谋事成事先难后易。 迁移吉，求官名分未达大吉。 文书未遂迟后成，借物便有，托人宜迟。 有意望明月，团圆还又缺。 用意又芳菲，终身宜热绝。 □□　第二十四　上上　利益受福 人豪财旺吉神扶，动作从心自有孚。 慷慨直须探虎穴，继承当见获龙珠。 明月当空处处辉，朗然照耀破昏迷。 所谋显达家门吉，此去荣华正及时。 若言此事又须嘉，事托他人路已差。 早早修心向山去，免遭世事乱如麻。 圣意云：值性刚豪，好向隆高。 神明协赞，利益持操。 行藏众伏，论讼无劳。 孕生贵子，万种滔滔。 病者即愈，望言不遥。 求谋成就，迁职升高。 占财，买卖名爵之家有十分，常人无置货，拳用脱货迟。 婚姻入舍，主一人性急心硬，一时难开口，后成长远吉。 文书吉，出行官富吉。 平人不利，行人未至。 病老幼受痛瘥迟无事。 借物无，谋事成事，先难后易。 走失难寻，交易成就好。 兴贩向前吉利，求官升职名分利。 托人用事，先难后易。 □□　第二十五　下下　无灾不宜 运值凶灾福未饶，遁逃形迹莫轻佻。 行商坐贾宜循旧，好看机谋只秀苗。 求成未遂如君意，欲望青云路转赊。 守宁心旧方是吉，他时必定见荣华。 一朝事意实堪夸，久后为之必富华。 有败有成多少事，瓜虽大也苦甜瓜。 圣意云，时迍命赛，身宜潜逃。 从教勉强，不务坚劳。 出行遇盗，老者徒劳。 耕种失望，婚姻叨叨。 只宜守旧，莫怀持操。 占财，买卖值货不用脱货迟。 种田有苗无收，病者不安，疸疮凶。 出行不利，行人至。 兴贩不济，迁移不利。 婚姻口多不成，公讼不吉。 交易难成不稳。 买田宅，人口、头疋是本身旧基业利，如不是无益。 谋事成事不利，成也不久。 失物难寻，借物有成无多。",
      "translated_text": "The traveler arrives; lawsuits are auspicious. Journeys are unfavorable—illness for the elderly and young, though grave conditions pose no harm. Smallpox and sores remain stable. Farming yields blossoms but no fruit; marriage and seeking heirs are inauspicious. Purchasing fields, estates, servants, or livestock is favorable; household and family remain at peace. Plans and accomplishments fare better if delayed. Lost items will be found after a long time; borrowing brings delayed fortune. Trade prospers; relocation is better postponed. Childbirth yields a son, auspicious and bright. Seeking medical treatment or education fares better later; pursuing office or promotion brings distant great fortune. Documents and correspondence are most favorable if delayed; transactions should be swift, as delay brings misfortune.\n\nAt first, change meets resistance, but light emerges as the Dao aligns and flows. Official documents, imperial posts, and stipends reach fulfillment, bringing joy and abundant years.\n\n□□ Twenty-Third: *Moderate Balance* – *The Image of Temporal Obstruction*\nThings remain, yet people change—let go of attachments,\nLest grievances and lawsuits turn to mutual provocation.\nThough the heart shines bright as a mirror,\nHow can one endure when fortune’s hour has not yet come?\n\nPeach trees planted fill the eastern courtyard,\nTheir blossoms battered by rain and wind.\nOnce hoped for fruit to savor,\nNow all that remains is emptiness.\n\nHow wondrous the immortal’s art—\nIf you pursue it, you’ll transcend the world.\nWhen the Dao’s fruit ripens and the elixir is refined,\nThe golden gate opens at the appointed time.\n\nThe Sage’s intent declares:\nThe hour is obstructed, the fate adverse—\nMany troubles, many disputes,\nAll exhaust the heart and mind,\nYet who pities your woes?\nHold fast to the old and await the turning of the times.\nFirst misfortune, then fortune;\nPlans and hopes are delayed.\nSeeking marriage brings distant success;\nLitigants face no danger.\nIn all matters, proceed with patience—\nWhy harbor doubts?\n\nFor wealth: the later the trade, the greater the profit. Purchasing goods is favorable; selling may be slow but ultimately good. In all affairs, remain still and steady. Journeys are safe; the traveler has not yet arrived. Hesitation without action brings obstruction; lawsuits are best settled through mediation. Illness in the elderly—colds and lingering ailments—pose no grave threat; smallpox and sores bring good fortune. Purchasing fields, estates, or servants is auspicious if delayed; household and family remain at peace. Lost items are hard to recover; plans and accomplishments face initial difficulty but later ease. Relocation is favorable; seeking office or rank brings eventual great fortune. Documents and correspondence face delay but later succeed; borrowing is possible, though entrusting others fares better later.\n\nLonging for the bright moon,\nIt waxes full, then wanes again.\nIntentions may bloom like spring,\nYet in the end, all warmth fades.\n\n□□ Twenty-Fourth: *Supreme* – *Receiving Blessings and Fortune*\nA person of wealth and power, favored by auspicious spirits,\nAll actions proceed as the heart desires, naturally trusted.\nBoldly venture into the tiger’s den,\nAnd in time, you shall inherit the dragon’s pearl.\n\nThe bright moon hangs in the sky, illuminating all,\nIts radiance dispelling every darkness.\nAll plans flourish; the household thrives—\nThis is the time for glory and prosperity.\n\nIf you speak of this matter, it must be praised,\nYet entrusting it to others leads astray.\nHasten to cultivate the heart and retreat to the mountains,\nTo escape the world’s entanglements, tangled as hemp.\n\nThe Sage’s intent declares:\nBy nature bold and proud,\nYou favor lofty heights.\nDivine spirits aid your cause;\nProfit and integrity are upheld.\nYour conduct commands respect;\nLawsuits bring no toil.\nA noble son is born,\nAnd all things flow abundantly.\nThe sick recover swiftly;\nHopes are soon fulfilled.\nPlans come to fruition;\nPromotions and advancements rise.\n\nFor wealth: merchants of rank and title gain full advantage; common folk should avoid purchasing goods, though selling may be slow. In marriage, entering the household brings one of stern and impatient temperament, difficult to approach at first, but later ensuring long-term fortune. Documents and correspondence are auspicious; journeys bring wealth and honor. For common folk, no advantage; the traveler has not yet arrived. Illness in the elderly and young brings pain but slow recovery without harm. Borrowing is unlikely; plans and accomplishments face initial difficulty but later ease. Lost items are hard to recover; transactions succeed well. Trade ventures prosper; seeking office or promotion brings great fortune. Entrusting others with tasks faces initial difficulty but later ease.\n\n□□ Twenty-Fifth: *Most Inauspicious* – *No Disaster Unmet*\nFortune meets misfortune; blessings are scarce—\nFlee and hide, do not act lightly.\nMerchants and traders should adhere to the old ways;\nWatch for schemes that show only promise.\n\nHopes for success fall short of your desires;\nThe path to high office grows ever distant.\nRemaining patient and steadfast is the true fortune—\nIn time, glory will surely appear.\n\nOne day, your affairs may seem praiseworthy,\nBut in the long run, they lead to wealth and splendor.\nSome fail, some succeed—how many things are so?\nThough the melon may be large, it remains sweet or bitter.\n\nThe Sage’s intent declares:\nThe hour is adverse, fate obstructed—\nBest to retreat and hide.\nForced efforts bring no lasting labor.\nJourneys risk bandits; the elderly toil in vain.\nFarming yields no harvest; marriages bring endless chatter.\nHold fast to the old; do not cling to ambitions.\n\nFor wealth: trade when goods are available, but selling is slow. Farming yields shoots but no harvest; the sick do not recover; smallpox brings misfortune. Journeys are unfavorable; the traveler arrives. Trade ventures fail; relocation is inauspicious. Marriages face much talk but no success; lawsuits are unlucky. Transactions are difficult and unstable. Purchasing fields, estates, servants, or livestock is only favorable if they are your original property—otherwise, no benefit. Plans and accomplishments are unfavorable and, if achieved, short-lived. Lost items are hard to recover; borrowing brings little success.",
      "overlap_context": ".\n\nThe Sage’s intent declares:\nThrough steadfast study, one’s talents remain unrecognized—\nLong mired in hardship, plans fail to unfold.\nYet when the time comes, old paths lead to renewal,\nLike withered wood blooming anew.\nNo need for distant worries—all matters shall succeed.\nLawsuits bring peace; all actions align with desire.\nPlans come to fruition; all endeavors prosper.\n\nFor wealth: trade and sales yield modest gains in the present.\nPurchasing goods brings light profit; selling may be slow.",
      "start_char": 8638,
      "end_char": 9798,
      "start_sentence": 591,
      "end_sentence": 666,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.745842695236206,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "产孕难存不妨，托人用事完备。 家宅人口少安，文书气象不遂。 求官升职，除授不久长。 □□　第二十六　中平　公正无私 天灾胶戾数当然，徒秉精诚格上天。 善果业缘应默定，不容私意保安全。 安居旺相进钱财，天上生云地震雷。 禄位迁高光显达，荣华富贵入门来。 守道依稀大有财，便宜动用不须猜。 若於此内占官事，不到州时也到台。 圣意云：天灾种种，忍受无虚。 神明正直，岂有阿谀。 痘不须药，邪不信巫。 公讼宜达，早固难谋。 谋为莫动，婚姻未如。 且宜守旧，庶兔区区。 占财，无利置货不好，脱货迟。 种田半收，婚姻入舍求嗣不吉。 病犯北斗，并善愿老少，多日难脱，值寒十八日得汗，老者死边过。 出行不利，行人至。 迁移不利，公讼不吉。",
      "translated_text": "Childbirth is difficult to preserve, yet no harm comes; entrusting matters to others brings completion. Households and family members find little peace; documents and omens do not proceed smoothly. Seeking office or promotion leads to appointments of short duration.\n\n[Missing characters] Twenty-Sixth: Moderation\nImpartial and Selfless\n\nHeaven-sent disasters and clashing calamities arise by fate’s decree;\nIn vain one holds sincere devotion to move the heavens above.\nGood fruits and karmic conditions are silently ordained—\nNo room for private desires to ensure safety.\n\nDwelling in peace brings prosperity and increasing wealth;\nClouds gather in the sky, the earth quakes with thunder.\nRank and position ascend to glorious heights;\nHonor, wealth, and nobility enter the gate.\n\nAbiding in the Dao, one dimly perceives great wealth;\nOpportune actions need not be doubted.\nIf divining official matters within this,\nOne may not reach the prefecture but will surely attain the court.\n\nThe Sage’s intent declares:\nHeaven’s disasters come in many forms—endure them without falsehood.\nThe divine and upright admit no flattery.\nSmallpox requires no medicine; evil does not heed shamans.\nLawsuits should be pursued; early schemes are hard to contrive.\nPlans should not be acted upon; marriages are not yet favorable.\nBetter to hold fast to the old, lest one suffer petty troubles.\n\nDivining wealth: No profit in acquiring goods; selling is slow.\nFarming yields half a harvest; marriages bring in-laws, but seeking heirs is inauspicious.\nIllness afflicts the Northern Dipper; vows and good wishes for young and old\nlinger for many days before relief. In cold conditions, recovery comes after eighteen days of sweating;\nthe elderly may die at the edge of survival.\nJourneys are unfavorable; the traveler arrives.\nRelocation is inauspicious; lawsuits are unlucky.",
      "overlap_context": "cover; smallpox brings misfortune. Journeys are unfavorable; the traveler arrives. Trade ventures fail; relocation is inauspicious. Marriages face much talk but no success; lawsuits are unlucky. Transactions are difficult and unstable. Purchasing fields, estates, servants, or livestock is only favorable if they are your original property—otherwise, no benefit. Plans and accomplishments are unfavorable and, if achieved, short-lived. Lost items are hard to recover; borrowing brings little success.",
      "start_char": 9798,
      "end_char": 10116,
      "start_sentence": 667,
      "end_sentence": 687,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.925968647003174,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "宜和买田宅，人口，头疋不利，文书吉，恐不遂。 家宅人口不宁，谋事成事未遂。 学艺业不利，求官升职名分未遂。 走失难寻不见，产孕艰难，托人不济，交易难成，借物全无。 体作蓬莱客，孤舟忌远行。 富贵天上定，无风恶浪生。 □□　第二十七　下下　向善 设网张罗意气专，纵横驱策遍中原。 只知利己责污出，岂料言旋祸及门。 家宅惶惶主不宁，盖缘先祖作灾迍。 且宜作福求禳度，更谢家门伏侍神。 事虽平善见财迟，远涉江山利少微。 久见十方真有利，更多多也不须提。 圣意云：人心巘崄，物在宁笼。 只知被害，安能守旧。 百事不吉，莫避其凶。 目前须暇，善事宜崇，病者致重，论讼无功。 凡事宁耐，守之则通。 占财，买卖宜快，置货好，脱货好。 种田无，高低不利。 公讼吉，出行吉。 行人一二到，如不到迟病老少，宜告斗并善愿吉，疸疮平。 初重婚入舍求嗣大吉，产孕生男，女虚惊。 兴贩吉，买田宅人口头疋有损无益。 谋事成事休踌蹰便成，求官升职名分宜快。 迁移吉，文书便至，托人用事快成，走失不见，家宅人口平安。 户开重轮载，逢牛忌损财。 忧危犹未出，孝服又重来。 □□　第二十八　中平　谨守 灾哀萌动事无伤，更与堤防作善良。 莫向亲姻求久计，图谋机巧也寻常。 贵人接引喜逢新，官灾口舌离门庭。 病人此去身安健，谋望求财尽变更。 托人去干心中事，早早回头望故乡。 只好保安於自己，贵心必定见灾殃。 圣意云：小灾渐明，未致伤人，谨微宜早，莫慢因循。 公讼失理，病者沉沦。 婚姻中一，图望成尘。 独宜崇福，善获惟新。 占财，买卖宜早收平，种田无收。 出行不利，行人未至。 迁移不利，病宜服药。 作善事吉，公讼吉。 婚姻入舍求嗣吉，克妻不到头。 买田宅人口头疋不利，脱货便脱，兴贩不利。 文书早干，借物透空。 交易难成，托人用事不利。 家宅人口，祈福保佑。 桥下水流去，炉中烟袅长。 保扶宜作福，禳告免灾殃。 □□　第二十九　上上　亨通得财 踪迹沉埋辄变通，霈恩嘉贶籍师宗。 一朝获福当权握，余庆源源世代隆。 阴阳道合事通亨，还如人在月中行。 琴瑟调和门户吉，荣华富贵日自生。 十年窗下读诗书，黄榜招贤信息催。 马快如风行二日，若行三日不相知。 圣意云：久凶向吉，久闭渐通。 承恩在上，权握雄雄。 诉讼得理，谋运得中。 婚姻利益，喜气重重，病者迟痒，交易自从。 不宜守旧，恐惨愁容。 占财，买卖忙有三五分； 置货帮用，脱货便脱。 种田便种吉，出行宜快。 行人至，兴贩吉利。 病老少迟瘥，公讼不吉。 婚姻吉，迁移宜快吉。 借物宜快便有，家宅人口平安。 谋事成事贵人助力，求官升职得贵人主张除授。 走失便见，文书有气象吉。 产孕生贵子，若女是金星吉。 交易快成有利息，托人用事遇贵人。 穿井定方位得地泉吉利。 碧玉先天染，蓝田气象新。 相逢在朝野，不久过江来。 □□",
      "translated_text": "Favorable for purchasing fields and houses, and for population growth; unfavorable for livestock. Documents are auspicious, but success may not be achieved. Households and family members are unsettled; plans and undertakings remain unrealized. Learning arts and crafts is inauspicious; seeking office or promotion in rank is unattainable. Lost items are difficult to find; childbirth is fraught with difficulty. Relying on others brings no benefit; transactions are hard to conclude. The body becomes a wanderer of Penglai, a lone boat shunning distant voyages. Wealth and nobility are predestined by heaven, yet windless waves turn treacherous.\n\n**Hexagram Twenty-Seven: Utmost Adversity (向善)**\nWith nets spread and snares set, intent fixed,\none drives and schemes across the Central Plains.\nKnowing only self-interest, demanding bribes,\nwho could foresee that words would bring disaster to the door?\nHouseholds are restless, the master uneasy—\nall due to ancestral misfortunes bringing calamity.\nBest to perform blessings and seek exorcism,\nand thank the household gods for their service.\nThough affairs seem peaceful, wealth comes slowly;\ncrossing rivers and mountains yields meager profit.\nOnly after long effort will true gain appear—\neven then, excess is unnecessary.\n\n**The Sage’s Intent:**\nHuman hearts are perilous; things rest uneasy in their cages.\nKnowing only harm, how can one preserve the old?\nAll affairs are inauspicious; do not evade misfortune.\nFor now, seek respite; honor good deeds.\nThe sick grow worse; lawsuits yield no success.\nIn all matters, patience brings resolution.\n\n**Divining Wealth:**\nBuying and selling should be swift; acquiring goods is favorable, and selling is smooth. Farming yields nothing; neither high nor low ground is profitable. Lawsuits are auspicious; journeys are favorable. The traveler arrives within one or two days; if not, the elderly and young may fall ill. Vows to the Northern Dipper and good wishes are auspicious; smallpox subsides. Early remarriage, entering a household, or seeking heirs is highly auspicious. Childbirth yields a son; a daughter brings false alarms. Commerce is favorable; buying fields, houses, or livestock incurs loss without benefit. Plans and undertakings should proceed without hesitation; seeking office or promotion should be swift. Relocation is auspicious; documents arrive promptly. Relying on others brings quick success; lost items remain unseen. Households and family members are at peace.\n\nWheels turn with heavy loads;\nmeeting oxen risks financial loss.\nWorries have not yet passed,\nwhen mourning garments arrive again.\n\n**Hexagram Twenty-Eight: Moderate Stability (谨守)**\nDisasters and sorrows stir, yet no harm befalls—\nstrengthen your defenses and act with goodness.\nDo not seek long-term plans from relatives;\nschemes and cunning are but ordinary.\nNoble patrons offer new assistance;\nofficial troubles and gossip leave the household.\nThe sick recover health;\nhopes and quests for wealth transform entirely.\nEntrusting others with your affairs,\nturn back early to gaze upon your homeland.\nBest to safeguard yourself—\ngreed will surely invite disaster.\n\n**The Sage’s Intent:**\nMinor misfortunes gradually clear, not yet harming others.\nBe vigilant early; do not procrastinate.\nLawsuits are lost; the sick sink deeper.\nMarriages are half-successful; aspirations turn to dust.\nOnly by honoring blessings does one gain renewal.\n\n**Divining Wealth:**\nBuying and selling should conclude early and fairly; farming yields no harvest. Journeys are inauspicious; the traveler has not arrived. Relocation is unfavorable; the sick should take medicine. Performing good deeds is auspicious; lawsuits are favorable. Marriage, entering a household, or seeking heirs is auspicious, though a wife may not live to old age. Buying fields, houses, or livestock is inauspicious; selling goods should be prompt. Commerce is unfavorable; documents should be handled early. Borrowing leads to loss; transactions are difficult to conclude. Relying on others is inauspicious. Households and family members should pray for protection.\n\nBeneath the bridge, water flows away;\nfrom the stove, smoke curls long.\nPreserve well-being by performing blessings—\nexorcisms avert calamity.\n\n**Hexagram Twenty-Nine: Supreme Prosperity (亨通得财)**\nHidden traces shift and transform;\ngrace and favor descend from ancestral masters.\nOne day, fortune is grasped and power held—\nblessings flow endlessly, elevating generations.\nWhen yin and yang align, affairs prosper;\nlike one walking beneath the moon.\nLute and zither harmonize, the household thrives—\nglory, wealth, and nobility arise daily.\n\nTen years of study beneath the window,\nthe imperial examination summons the worthy.\nSwift as the wind, two days’ journey—\na third day’s travel, and recognition fades.\n\n**The Sage’s Intent:**\nLong misfortune turns to fortune; long stagnation gradually opens.\nReceiving favor from above, power is firmly held.\nLitigation succeeds; plans and ventures strike true.\nMarriages bring benefit; joy abounds.\nThe sick recover slowly; transactions proceed smoothly.\nDo not cling to the old, lest sorrow linger.\n\n**Divining Wealth:**\nBuying and selling yields three to five parts profit;\nacquiring goods is helpful, and selling is prompt.\nFarming is auspicious; journeys should be swift.\nThe traveler arrives; commerce is profitable.\nThe sick, young and old, recover slowly; lawsuits are inauspicious.\nMarriage is auspicious; relocation should be swift and favorable.\nBorrowing should be prompt and successful; households and family members are at peace.\nPlans and undertakings gain noble assistance; seeking office or promotion receives support from superiors for appointment.\nLost items are quickly found; documents carry auspicious signs.\nChildbirth yields a noble son; if a daughter, she is a Venus, auspicious.\nTransactions conclude swiftly with profit; relying on others meets noble patrons.\nDigging a well in the right location taps into earthly springs, bringing good fortune.\n\nA jade stained by heaven’s blue,\nthe fields of Lan glow with new vitality.\nMeeting in court or countryside,\nsoon crossing the river together.\n\n**Hexagram Thirty: [Fragment Incomplete]**",
      "overlap_context": "ffer petty troubles.\n\nDivining wealth: No profit in acquiring goods; selling is slow.\nFarming yields half a harvest; marriages bring in-laws, but seeking heirs is inauspicious.\nIllness afflicts the Northern Dipper; vows and good wishes for young and old\nlinger for many days before relief. In cold conditions, recovery comes after eighteen days of sweating;\nthe elderly may die at the edge of survival.\nJourneys are unfavorable; the traveler arrives.\nRelocation is inauspicious; lawsuits are unlucky.",
      "start_char": 10116,
      "end_char": 11291,
      "start_sentence": 688,
      "end_sentence": 764,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.569252252578735,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "第三十　下下　空亡 狱讼缠绵志未伸，伤财劳力谩嚚嚚。 善缘早计崇遐福，莫待迁延苦累人。 花正吐时连夜雨，月当明处被云遮。 记言桃李休相笑，一日云开自有时。 可知此内事须防，此日云阴见吉祥。 汝若占知三四日，便能速疾预才良。 圣意云：缠绵狱讼，失致伤财。 更宜作善，兔致凶灾。 谋望不就，婚姻失倍。 百事不宜，商贾空回，移徙动作，必致灾危。 病者迟滞，恐有悲哀。 占财，买卖宜快，迟不济置货吃物用。 种田不宜早。 婚姻入舍，求嗣不利，迁移不利，出行不利，逢盗贼别日再占。 此卦少可用，行人未至交易，口多有人主张兴贩不利。 托人用事难成，文书无气象。 公讼无事宜和，病者有愿宜早还。 作善事免於人口灾，官府成事快。 买田宅、人口、头疋不利。 脱事便脱，谋成事不利。 借物不定准，家宅人口宜作善事。 产孕作善事保，求医艺不利。 买卖脱货不利，求官升职，成也不利。 诸事不吉。",
      "translated_text": "**Hexagram Thirty: Most Inauspicious (Void and Doomed)**\n\nLitigation drags on, aspirations unfulfilled;\nwasted wealth and labor, vain and fruitless strife.\nPlan early for virtuous deeds to cultivate distant blessings—\nlest delay bring suffering and weariness to others.\n\nFlowers in full bloom meet night-long rain;\nthe moon at its brightest is veiled by clouds.\nRemember: peach and plum must not mock one another—\nthe day clouds part will come in time.\n\nKnow this: affairs within demand caution,\nyet on this day, clouds part to reveal good fortune.\nIf you divine for three or four days hence,\nswift preparation will ensure success.\n\n**The Sage’s Counsel:**\nLitigation entangled, lost causes drain wealth.\nPursue goodness to avert misfortune and calamity.\nPlans and hopes come to naught; marriages fail.\nAll undertakings are ill-advised; merchants return empty-handed.\nMovement or action invites disaster and peril.\nThe ill recover slowly, with sorrow likely.\n\nFor wealth: trade swiftly—delay brings no profit,\nand goods purchased may spoil.\nFarming should not begin too early.\nMarriage into a household is unfavorable; seeking heirs brings no luck.\nRelocation is ill-advised; travel risks bandits—divine again another day.\nThis hexagram offers little use.\n\nTravelers have not arrived; trade is unprofitable.\nMany voices offer counsel, but ventures fail.\nRelying on others yields no success; documents lack auspicious signs.\nLitigation finds no resolution—seek harmony.\nThe ill should fulfill vows swiftly.\nDo good to avert household misfortune; official matters conclude quickly.\n\nPurchasing land, homes, servants, or livestock is unfavorable.\nDisentangling from affairs brings relief, but plans fail.\nBorrowing is uncertain; the household should perform virtuous deeds.\nPregnancy requires good works for protection; seeking medical or artistic skills is unwise.\nSelling goods is unprofitable; seeking office or promotion, even if achieved, brings no advantage.\nAll matters are inauspicious.",
      "overlap_context": "tment.\nLost items are quickly found; documents carry auspicious signs.\nChildbirth yields a noble son; if a daughter, she is a Venus, auspicious.\nTransactions conclude swiftly with profit; relying on others meets noble patrons.\nDigging a well in the right location taps into earthly springs, bringing good fortune.\n\nA jade stained by heaven’s blue,\nthe fields of Lan glow with new vitality.\nMeeting in court or countryside,\nsoon crossing the river together.\n\n**Hexagram Thirty: [Fragment Incomplete]**",
      "start_char": 11291,
      "end_char": 11677,
      "start_sentence": 765,
      "end_sentence": 789,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.261087894439697,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "前有二牛尾，交加事有争。 何时方免厄，见鼠始安宁。 □□　第三十一　大吉　正直 奉公执法不辞劳，从此洋洋气格高。 自是行藏合天理，岂容纤羽坏持操。 心事冲冲常不乐，待得方安又不安。 所作施为全未遂，恰如明月在云间。 此事中平难得成，事已成时难称心。 若占官事终须没，商贾求财利益轻。 圣意云：正直合理，不务敞斜。 公讼得众，天福延遐。 纵有小厄，岂动疵瑕。 动为合吉，常赴亨嘉。 出入通泰，乐更荣华。 占自己钱。 本有三五分，置货用，脱货便脱，种田有收，公讼无事，出行吉。 行人未至有信，失物不见。 家宅人口平安，婚姻莫信人言有益吉，再婚有疾。 求嗣利病老少，不妨田宅人口头疋主，有必一小损失成吉，课事成事得权吉。 孕生贵子交易用力成好，托人用事有阻后利，迁移守旧吉。 求医兴贩大吉。 借物快有，后有小失。 求官升职有阻后吉。 才是忧危室，鸥鹏有变成，鹏飞十万里，不久遇苍天。 □□　第三十二　上上　岁寒无忧 拭泪频嗟远信沉，谩劳古卜觅佳音， 莫将怪梦成忧虑，松相坚贞自有心。",
      "translated_text": "Two ox tails cross ahead—entanglements breed strife.\nWhen shall distress be lifted? Only when the rat appears will peace return.\n\n[Missing characters] Hexagram Thirty-One: Great Auspice, Uprightness\n\nServing the public, upholding the law without shirking toil,\nFrom this, one’s qi and character soar high.\nNaturally, conduct and retreat align with Heaven’s principle—\nHow could the slightest flaw corrupt one’s steadfast integrity?\n\nHeart’s affairs surge restlessly, never at ease;\nScarcely settled, unease returns again.\nAll undertakings remain unfulfilled,\nLike the bright moon veiled behind clouds.\n\nThis matter is middling—difficult to accomplish;\nEven when achieved, it brings no satisfaction.\nIf divining official matters, they shall ultimately dissolve;\nFor merchants seeking profit, gains will be slight.\n\nThe Sage’s intent declares: Uprightness accords with principle, eschewing crookedness.\nIn litigation, one gains the multitude—Heaven’s blessing extends afar.\nThough minor distress may arise,\nHow could it mar one’s flawless virtue?\n\nAction brings harmonious fortune,\nEver advancing toward prosperity.\nIn all dealings, one enjoys smooth passage,\nAnd joy is met with greater glory.\n\nDivining one’s own wealth:\nOriginally three or five parts remain.\nInvest in goods—selling brings swift release.\nFarming yields harvest; litigation finds no trouble; travel is auspicious.\nThe traveler has not arrived but sends word; lost items will not be found.\nHousehold and family are at peace.\nIn marriage, heed not others’ words—benefit and good fortune lie ahead.\nRemarriage brings illness.\nSeeking heirs benefits the old and young alike; no harm to fields, homes, servants, or livestock.\nA minor loss is certain, yet success follows.\nIn divination, matters achieve authority and good fortune.\nPregnancy bears a noble son; trade requires effort but prospers.\nRelying on others meets obstruction, but later proves advantageous.\nMoving brings no benefit—staying put is auspicious.\nSeeking medicine or engaging in trade brings great fortune.\nBorrowed items are swiftly returned, though a minor loss follows.\nSeeking office or promotion meets obstruction, but later proves auspicious.\n\nThe room of peril now becomes a nest of change—\nThe osprey and roc transform.\nThe roc soars a hundred thousand li,\nYet soon encounters the azure sky.\n\n[Missing characters] Hexagram Thirty-Two: Supreme, Unworried in the Year’s Cold\n\nWiping tears, sighing often for distant news long sunk,\nIn vain, one consults ancient divination for glad tidings.\nDo not let strange dreams breed needless worry—\nThe pine and cypress, steadfast in their resolve, hold true within.",
      "overlap_context": " vows swiftly.\nDo good to avert household misfortune; official matters conclude quickly.\n\nPurchasing land, homes, servants, or livestock is unfavorable.\nDisentangling from affairs brings relief, but plans fail.\nBorrowing is uncertain; the household should perform virtuous deeds.\nPregnancy requires good works for protection; seeking medical or artistic skills is unwise.\nSelling goods is unprofitable; seeking office or promotion, even if achieved, brings no advantage.\nAll matters are inauspicious.",
      "start_char": 11678,
      "end_char": 12131,
      "start_sentence": 790,
      "end_sentence": 816,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.676150560379028,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "众星侵月事须防，小口灾临主祸殃。 若也知之能喊半，预先作福谢穹苍。 安居欲别去门坊，买卖占求在远方。 托佛靠神方可吉，事须社庙及神堂。 圣意云：久客天涯，戚属伤嗟。 徒倾思念，人自安嘉。 谋猷叶吉，畜产有嘉。 婚姻和合，公讼堪夸。 先凶后吉，百事无差。 病者无虑，福寿延遐。 占财，买卖有三二分，置货好，脱货好。 种田有收，公讼吉，无事病，老少沉重。 少者宜作善事，不妨婚姻，入舍求嗣好恐不成。 家宅人口有小失，不宁宜作善保。 买田宅人口有小失后成。 谋事成事向前有小失，无妨借物，无多求医艺业吉利。 孕平稳吉，文书利失物寻见，迁移吉利。 求官升职得除兴贩吉利。 烟波一叶舟，行船遇顺流。 资财从远得，出入好经求。 □□　第三十三　大吉　承庆出尘 蓊郁云烟气象新，门庭叶吉喜如春。 怀耽定获承家庆，商贾须逢异宝珍。 新磨龙剑快锋铓，劲气冲牛孰敢当。 况又提持今在手，英雄猛烈陪寻常。 早朝占得方为吉，饭后求之必不嘉。 万事只宜如此句，名扬四海有人夸。 圣意云：德盛崇福，吉祥恺悌。 谋为不吉，为谋不利。 婚姻和合，行商济济。 孕生贵子，不宜迁移。 灾祸不生，内外和美。 凡事称意，有吉有喜。 占财，轻本大称意，置货好，脱货好。 种田宜迟，公讼吉。 迁移大吉。 病老少，春轻秋冬沉重，有善事，星辰不顺。 婚姻宜快迟不成。 家宅人口平安，走失京中寻有自家繁。 兴贩迟有利，买田宅人口迟成吉。 文书迟成，孕生男稳大吉。 谋事成事勾当向前，宜快成迟不利。 脱事忍耐好求医业，快不济迟好。 托人用事迟吉，脱货越迟有利。 空布重之雾，樽迭满泛尼。 重令将久去，果熟应生花。 □□　第三十四　上上　佳音革故 立宅安坟值吉神，便宜兴建莫沉吟。 行商坐贾求谋遂，事不须谋得好音。 病龙行雨值虹霓，有疾占身事不宜。 变化升腾须有日，且宜守旧待明时。 可知一日事宜为，一日之过不要图。 事若不宜知不吉，枉教君子费工大。 圣意云：革故鼎新，迁坟葬茔。 年月叶吉，吉曜加临。 更宜商贾，利益快心。 婚姻遂意，无谋自成，公讼有望，所作称心。 百事快怀，永保元亨。 占财，轻买卖宜快，置货好，脱货迟。 宜快种田，宜早有收。 兴贩大吉，出行宜快，行人一二日到，不至迟，家宅人口不利。 交易宜快迟不济，婚姻宜快迟费力。 公讼无事，买田宅人口宜迟不济。 谋事成事勾当宜快，迟难成。 求医业稳，文书宜快吉。 求官升职，迁移吉利。 失物难寻，托人用事有贵人吉。 移居不移。 相逢渐有涯，额事称心怀。 人称心上事，花落又重开。 □□　第三十五　中平　莫求莫动 方隅神杀不堪修，旧业安然莫外求。 冢墓动土尤可畏，急於崇福获洪休。 鹤呜霄汉气冲天，九万程途咫尺间。 官禄日升财禄进，安居吉庆度时光。 一回去了一回多，又再求之色更和。 二十中间占得此，定知财物满山河。 圣意云：兴工动土，恶杀临方。 不意用宜，守旧为强，葬埋更忌，恐致灭亡。 先若少犯，祈谢安康。 公私不利，虑有灾殃。 急於崇善，可获吉祥。 占财，买卖置货好，脱货便脱。 公事吉，守旧三十一、第四、第十，用事出行不利，行人不至在外有阻。 入舍求嗣不利。",
      "translated_text": "The stars encroach upon the moon—beware of trouble ahead,\nMinor ailments bring misfortune, heralding calamity.\nYet if one knows and calls out halfway,\nPreemptive offerings to heaven may avert disaster.\n\nSettling down yet planning to leave the neighborhood,\nTrade and ventures lie far away.\nRelying on Buddha and gods brings fortune—\nSeek the temple halls and shrines for success.\n\nThe Sage’s intent declares:\nLong a wanderer at the edge of the sky,\nKinfolk sigh in sorrow.\nThough thoughts pour out in vain,\nOne finds peace and joy alone.\nPlans align with fortune,\nLivestock thrives.\nMarriages harmonize,\nLawsuits bring praise.\nFirst inauspicious, then auspicious—\nAll affairs proceed without error.\nThe ill need not worry,\nFortune and longevity extend far.\n\nOn wealth: trade yields two or three parts profit,\nGoods bought are fine, goods sold are fine.\nFarming brings harvest,\nLawsuits are auspicious,\nIllness spares none—old and young grow grave.\nThe young should do good deeds—\nMarriage remains unobstructed,\nEntering a household to seek heirs may not succeed.\nThe household suffers minor losses,\nUnrest calls for virtuous protection.\nBuying fields or homes brings minor losses first, then success.\nPlans and actions face small setbacks at first,\nNo harm in borrowing,\nSeeking medicine or craft brings good fortune.\nPregnancy proceeds smoothly and auspiciously,\nLost documents or items will be found,\nMoving brings good fortune.\nSeeking office or promotion meets success—trade flourishes.\n\nA lone leaf skims the misty waves,\nThe boat sails with the current.\nWealth comes from afar,\nAll undertakings prosper in due course.\n\n---\n\nHexagram Thirty-Three: Great Auspice—Bearing Blessings Beyond the Dust\n\nLush clouds and mist renew the scene,\nThe courtyard thrives, joyful as spring.\nContentment brings the blessing of heirs,\nMerchants chance upon rare treasures.\n\nThe newly sharpened dragon sword gleams sharp,\nIts mighty qi surges, unmatched by the ox.\nNow held in hand,\nEven heroes appear ordinary.\n\nConsulting at dawn brings fortune,\nSeeking after meals yields no favor.\nAll matters follow this truth—\nFame spreads across the four seas, winning praise.\n\nThe Sage’s intent declares:\nVirtue flourishes, blessings abound,\nAuspicious and kind.\nPlans may not prosper,\nSchemes may not favor.\nMarriages harmonize,\nMerchants thrive in numbers.\nPregnancy bears a noble son—\nDo not move.\nDisasters do not arise,\nInner and outer realms are harmonious.\nAll affairs proceed as wished,\nJoy and fortune abound.\n\nOn wealth: a small investment brings great satisfaction,\nGoods bought are fine, goods sold are fine.\nFarming should be delayed,\nLawsuits are auspicious.\nMoving brings great fortune.\nIllness afflicts old and young—\nLight in spring, grave in autumn and winter.\nGood deeds help,\nThe stars are unfavorable.\nMarriage should proceed swiftly—delay brings failure.\nThe household and its members are safe,\nLost items in the capital will be found among kin.\n\nTrade delayed brings profit,\nBuying fields or homes succeeds later.\nDocuments take time to finalize,\nPregnancy bears a son—smooth and greatly auspicious.\nPlans and actions should proceed swiftly—\nDelay brings no benefit.\nPatience serves well in matters,\nSeeking medicine or craft—haste fails, delay succeeds.\nRelying on others brings fortune later,\nSelling goods later yields greater profit.\n\nMist thickens like layered cloth,\nWine overflows the brimming cup.\nLong-held commands soon depart,\nRipe fruit heralds blossoming flowers.\n\n---\n\nHexagram Thirty-Four: Supreme Auspice—Joyful Renewal\n\nBuilding a home or burying the dead meets auspicious spirits—\nProceed with construction without hesitation.\nMerchants and traders see their plans succeed,\nNo need to scheme—good news arrives.\n\nThe ailing dragon brings rain beneath the rainbow,\nIllness bodes ill for one’s affairs.\nTransformation and ascent will come in time—\nFor now, maintain the old and await brighter days.\n\nKnow that some matters are best done in a day,\nLet not a single day pass in vain.\nIf a task is ill-timed and inauspicious,\nThe noble one’s efforts are wasted.\n\nThe Sage’s intent declares:\nRenewing the old, forging the new,\nMoving graves and tombs.\nAuspicious months and years align,\nFavorable stars descend.\nMerchants find joy in profit,\nMarriages fulfill desires,\nPlans succeed without effort,\nLawsuits bring hope,\nAll undertakings satisfy the heart.\nEverlasting prosperity is assured.\n\nOn wealth: light trade should proceed swiftly,\nGoods bought are fine, goods sold take time.\nFarming should be hastened for early harvest.\nTrade flourishes,\nTravel should be swift,\nTravelers arrive in a day or two—no delay.\nThe household and its members face misfortune.\nTrade should proceed swiftly—delay brings failure,\nMarriage should proceed swiftly—delay brings hardship.\nLawsuits bring no trouble,\nBuying fields or homes succeeds later.\nPlans and actions should proceed swiftly—\nDelay brings difficulty.\nSeeking medicine or craft brings stability,\nDocuments should be handled swiftly and auspiciously.\nSeeking office or promotion succeeds,\nMoving brings good fortune.\nLost items are hard to find,\nRelying on others meets noble assistance.\n\nDo not move.\nGradually, one reaches the shore,\nAll matters align with the heart.\nWhat brings joy to one’s heart,\nFalls like flowers, then blooms anew.\n\n---\n\nHexagram Thirty-Five: Moderate—Seek Not, Move Not\n\nThe local spirits and malevolent forces forbid construction,\nPreserve the old—do not seek elsewhere.\nDisturbing tombs and earth is especially fearful—\nHastening to honor the gods brings great blessing.\n\nThe crane cries in the heavens, its qi piercing the sky,\nNine thousand li shrink to a hand’s breadth.\nOfficial rank and wealth ascend daily,\nPeaceful living brings joy through the seasons.\n\nEach departure leaves more behind,\nYet seeking again brings even greater harmony.\nIf this hexagram appears between the twentieth and thirtieth,\nKnow that wealth will fill the mountains and rivers.\n\nThe Sage’s intent declares:\nUndertaking construction or digging soil,\nEvil forces occupy the direction.\nUnintended actions are unwise—\nPreserving the old is best.\nBurials are especially forbidden,\nLest they bring ruin.\nIf minor transgressions occur,\nPrayers and offerings restore peace.\nPublic and private affairs suffer,\nBeware of disaster.\nHastening to do good\nBrings fortune.\n\nOn wealth: trade and buying goods are fine,\nSell goods promptly.\nPublic matters are auspicious—\nMaintain the old for the 31st, 4th, or 10th.\nUndertakings and travel are inauspicious,\nTravelers do not arrive, delayed by obstacles abroad.\nEntering a household to seek heirs brings misfortune.",
      "overlap_context": "uction, but later proves auspicious.\n\nThe room of peril now becomes a nest of change—\nThe osprey and roc transform.\nThe roc soars a hundred thousand li,\nYet soon encounters the azure sky.\n\n[Missing characters] Hexagram Thirty-Two: Supreme, Unworried in the Year’s Cold\n\nWiping tears, sighing often for distant news long sunk,\nIn vain, one consults ancient divination for glad tidings.\nDo not let strange dreams breed needless worry—\nThe pine and cypress, steadfast in their resolve, hold true within.",
      "start_char": 12132,
      "end_char": 13437,
      "start_sentence": 817,
      "end_sentence": 901,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.3679461479187,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "病老少，犯土并墓神，沉重宜禳谢，痘疮求七十二候。 谋事成事不利，交易难成。 求医业不成，脱事难。 失物难寻，知信不见。 迁移不利，有小人欺弄。 公讼不利。 有灾，田宅人口有损无益。 兴贩不利，求官升职名分不利。 何处排歌声，分飞是至亲。 一边一阳照，方免泪如倾。 □□　第三十六下下从旧 碌碌就迷每慢藏，一朝无计护猖狂。 资财散尽重求福，何不当初莫损伤。 鱼翻桃浪当三月，此时方喜变龙身。 求官得禄须为定，百事无忧吉庆新。 偶逢旱岁种低田，水若来时稻不完。 见说虫蝗消息事，虚惊已退得完全。 圣意云：不自守法，常切息慢。 火盗一至，所威倾散。 虽悔莫及，徒然嗟叹。 出行有失，婚姻不求。 病讼多难，好作善事。 神明吁赞，难保兴贩。 占财，买卖宜就巧忙折本，置货不好，脱货吉。 种田秧不济，散种有三二分。 出行达盗火不吉，行人至，如不至有阻。 病伤寒，七八日得汗，过日难，宜求家堂祖先土地，吃药好。 婚姻不利，交易不成，有人破。 公讼失理，供物有人破。",
      "translated_text": "For illnesses affecting the old and young: if one offends earth deities or tomb spirits, the condition may become severe—ritual expiation is advised. For pox and sores, consult the seventy-two seasonal indicators.\n\nPlans and undertakings meet with misfortune; transactions are difficult to conclude. Medical careers fail to prosper; matters of release prove arduous. Lost items are hard to recover; expected news does not arrive. Relocation is inauspicious, with petty persons deceiving and manipulating. Legal disputes are unfavorable. Disasters arise, bringing harm to fields, dwellings, and household members—no benefit is gained. Commerce fares poorly; seeking office or promotion proves fruitless.\n\nWhere does the melody drift?\nThose parted are the closest kin.\nOne side bathed in solitary yang—\nOnly then are tears stemmed.\n\n□□  Thirty-Sixth: Utterly Inauspicious—Follow the Old\n\nRoutine leads to confusion, carelessness invites ruin;\nOnce defenses fail, chaos reigns unchecked.\nWealth scatters—seeking blessings anew,\nWhy not have spared harm from the start?\n\nFish leap through peach-blossom waves in the third month,\nOnly then does the dragon’s form delight.\nSeeking office and emolument finds certainty,\nAll affairs free of worry—new fortune arrives.\n\nBy chance, in drought years, low fields are sown,\nIf waters come, the rice remains incomplete.\nHearing rumors of locusts and calamity,\nFalse alarms subside—wholeness is restored.\n\nThe Sage’s intent declares:\nFailing to uphold the law, ever prone to negligence—\nFire and theft strike once, and all collapses.\nThough remorse comes, it is too late,\nOnly vain sighs remain.\nTravel brings loss; marriage should not be sought.\nIllness and litigation bring manifold trials—\nBetter to perform good deeds.\nThe gods and sages exhort: difficult to secure commerce.\nOn wealth: buying and selling hastily leads to loss,\nAcquiring goods is unfavorable; selling goods is auspicious.\nPlanting seedlings fares poorly; scattered seeds yield but two or three parts.\nTravel risks bandits and fire—unlucky.\nThe traveler arrives, or if not, faces obstruction.\nIllness is cold damage; sweating comes on the seventh or eighth day.\nBeyond that, recovery is difficult—\nAppease the household deities, ancestors, and earth gods;\nTaking medicine brings improvement.\nMarriage is inauspicious; transactions fail, with others causing ruin.\nLegal disputes lose merit; offerings are spoiled by others.",
      "overlap_context": " are especially forbidden,\nLest they bring ruin.\nIf minor transgressions occur,\nPrayers and offerings restore peace.\nPublic and private affairs suffer,\nBeware of disaster.\nHastening to do good\nBrings fortune.\n\nOn wealth: trade and buying goods are fine,\nSell goods promptly.\nPublic matters are auspicious—\nMaintain the old for the 31st, 4th, or 10th.\nUndertakings and travel are inauspicious,\nTravelers do not arrive, delayed by obstacles abroad.\nEntering a household to seek heirs brings misfortune.",
      "start_char": 13437,
      "end_char": 13864,
      "start_sentence": 902,
      "end_sentence": 930,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.362492561340332,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "迁移不利，脱事不利。 谋事成事凶。 产子母有损，宜保福。 田宅人江不利，文书不利。 托人用事，置货脱货，俱不利。 惆怅事忙忙，劳心梦一场。 丧事方出户，浪过免灾殃。 □□　第三十七　下下　守静 福有基兮祸有胎，惟人所召得从来。 操心不善罹凶变，多幸全身也损财。 渡水无船岂可过，波涛凶浪势嵬峨。 出入不依如此句，进之不得退无他。 平生为客走途中，买卖求财那件通。 食物用刀君可买，须知宜利急西东。 圣意云：平生毒害，福少祸多。 今罹凶横，我将奈何。 所谋不及，问亲不和。 公讼失理，兴贩不磨。 最宜守旧，何必波波。 占财，买卖不济，置货掣用，脱货吉。 种田不利。 病者不吉，伤寒、疮疸，保佑有救。 出行不利。 产难，祈福保佑。 迁移不利，借物无。 兴贩折本，公讼不利。 文书不利，买田宅人口主损失凶。 求官升职不遂。 何处生荆棘，佳人信渐疏。 断弦声韵绝，家宅更仿虚。 □□#1　第三十八　中平　因穷 疾病厌厌谩可怜，医巫徒费保安全。 齐心恳告俱成妄，何不潜思答上天。 红日当天照破云，无幽不烛众人倾。 君子进身须显达，荣华家宅又安宁。 买物之时物价高，便宜出卖莫叨叨。 虽然才利无多子，枉费工夫走一遭。 圣意云：灾祸缠绵，岂料其源。 净愿不还，难保安全。 医巫造说，浪费其钱。 速宜崇善，以苔上天。 先忧后喜，先难后易。 可以作福，神能保庇。",
      "translated_text": "Relocation is inauspicious; disengagement brings misfortune.\nPlans and accomplishments turn ill.\nChildbirth harms mother and child—guard well-being.\nFields and dwellings near rivers are unfavorable; documents bring no advantage.\nRelying on others for affairs, acquiring or selling goods—all are inauspicious.\nVexation and haste fill the heart, toiling dreams dissolve like mist.\nOnly when the funeral rites pass beyond the threshold may disaster be averted.\n\n**Hexagram Thirty-Seven: Utterly Inauspicious – Abide in Stillness**\nFortune has roots as misfortune has a womb—\nAll summoned by man’s own hand.\nA heart set on ill invites calamity;\nEven with luck, the body may survive, yet wealth is lost.\nHow to cross waters without a boat?\nWaves and billows rise in towering fury.\nNeither advance nor retreat yields escape—\nFollow not this path in all your comings and goings.\nA lifetime spent wandering as a traveler,\nWhat trade or profit ever thrives?\nIf buying food with a knife, act swiftly—\nKnow that haste brings advantage, east or west.\n\nThe Sage declares:\nA life steeped in harm—\nFortune scant, misfortune manifold.\nNow beset by sudden woe,\nWhat recourse remains?\nPlans fall short; kin stand divided.\nLitigation loses merit; commerce grinds to ruin.\nBest to keep to the old—\nWhy chase restless waves?\n\n**On Wealth:**\nBuying and selling fare poorly;\nAcquiring goods brings hindrance, but selling brings fortune.\nFarming is unfavorable.\nIllness is inauspicious—cold damage, sores, and boils—\nYet protection and prayer may bring deliverance.\nTravel is ill-advised.\nChildbirth is difficult—pray for blessings and safeguarding.\nRelocation is inauspicious; borrowed items are lost.\nCommerce leads to loss; litigation fails.\nDocuments bring no advantage; buying fields, dwellings, or servants invites loss and misfortune.\nSeeking office or promotion goes unfulfilled.\n\nWhere do thorns arise?\nThe beloved’s trust slowly fades.\nThe lute’s broken strings fall silent—\nThe household grows ever more desolate.\n\n**Hexagram Thirty-Eight: Middling Fortune – Beset by Hardship**\nIllness lingers, pitiably frail—\nPhysicians and shamans waste efforts to preserve life.\nSincere pleas and vows prove vain—\nWhy not quietly reflect and answer Heaven’s call?\n\nThe red sun pierces the clouds,\nIlluminating all, even the hidden—\nThe multitudes turn their gaze.\nThe nobleman advances, his path bright,\nHis household prosperous and at peace.\n\nWhen buying, prices soar—\nSell at a bargain, do not hesitate.\nThough profit is meager,\nWandering here is but wasted effort.\n\nThe Sage declares:\nDisaster clings like a web—\nWho could foresee its source?\nUnfulfilled vows endanger safety;\nPhysicians and shamans spin tales, squandering coin.\nHasten to cultivate virtue\nTo appease Heaven above.\nFirst sorrow, then joy;\nFirst hardship, then ease.\nPerform good deeds—\nThe gods will grant protection.",
      "overlap_context": "\nPlanting seedlings fares poorly; scattered seeds yield but two or three parts.\nTravel risks bandits and fire—unlucky.\nThe traveler arrives, or if not, faces obstruction.\nIllness is cold damage; sweating comes on the seventh or eighth day.\nBeyond that, recovery is difficult—\nAppease the household deities, ancestors, and earth gods;\nTaking medicine brings improvement.\nMarriage is inauspicious; transactions fail, with others causing ruin.\nLegal disputes lose merit; offerings are spoiled by others.",
      "start_char": 13864,
      "end_char": 14451,
      "start_sentence": 931,
      "end_sentence": 973,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.72566819190979,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "占财，置货莫买，脱货好。 种田少收。 病老不吉，有天愿咒诅，星辰不顺，添病不好。 出行不利，行人至。 产孕难，公讼不吉缠绵。 婚姻不利，迁移不利。 买田宅人口不利，家宅人口宜作善事。 求医艺不利，失物难寻不见。 求官升职不利，宜快脱事不济。 借物先难后易，托人用事先难后易。 八刀犹未了，暗箭射阴人。 伤人还及己，福去祸来侵。 □□　第三十九　中平　防辱 莫说英雄祸不侵，壮志遭辱恐难禁。 回头改过非为过，坦道经求好访寻。 忽入深山去路迷，不如归去致狐疑。 进退出行俱不利，切须防损暗中欺。 货物虽迟气色高，且宜守旧阅英豪。 有人领袖方为吉，及后钱财旺似刀。 圣意云：每盗强梁，轻欺良善。 恶债难擒，遭辱被遣。 一且改过，祸灭祸荐。 先凶后吉，皆由方便。 此签非吉，速达旧愿。 占财，买卖置货吉，脱货吉。 种田无收。 出行不利，行人有阻。 托人用事不济，病者不吉宜保佑。 婚姻不吉，产宜保佑。 谋事成事宜更改，成也不利。 公讼宜和，买旧宅人口不利。 文书不利，迁移不利。 求医艺不利。 求官升职，托人再抚人成。 借物不利，失物宜快迟不见。 残花枝渐发，月缺再重圆。 改过神人赞，相逢事必完。 □□　第四十　中平　后吉 中怀毒害少慈人，幽显将恢不孝刊。 能向道心知革故，镃基有继在门庭。 鸿鹄摩天只自然，未逢时至致灾迍。 此日升腾还自在，翱翔直上九霄云。 闻知事已实堪夸，此去登门必见华。 汝若托人终不吉，空言世事乱如麻。 圣意云：平生毒害，不和六亲。 既化幽显，能向此心。 誓天悔地，革故鼎新。 占病渐减，谋运得通。 若婚与讼，终就和平。 移凶就吉，庆吉门庭。 占财，宜迟有利，置货好，脱货好。 种田先难后易，婚姻不吉。 病者少，有愿伤寒七日得汗，如迟宜作福。 家宅人口平安，迁移吉。 走失急寻，久远只在家内。 文书迟，兴贩吉。 借物迟利，托人用事上紧吉。 交易迟成利，产孕迟吉。 有无相逢否，先防迍塞灾。 回心归正道，免损段头财。 □□　第四十一　中平　谨守莫动 客路茫茫古驿荒，不堪开眼致参商。 只宜守旧朝昏度，庶保怡怡禄有常。 落花流水两无情，家宅忧疑主不宁。 小口阴人招疾厄，切须急祷旺中神。 虽然宝出海中者，便下番舟走一遭。 到了不知何处去，依然空手赤身回。",
      "translated_text": "**Divination on Wealth:**\nDo not purchase goods; selling them is favorable. Farming yields little. Illness in old age is inauspicious—heavenly vows and curses linger, celestial signs are adverse, and illness worsens. Travel brings misfortune, though a traveler may arrive. Childbirth is difficult; lawsuits are inauspicious and protracted. Marriage is unfavorable; relocation is ill-advised. Buying land, homes, or servants is unpropitious—perform good deeds for the household. Seeking medical or artistic skills is unprofitable; lost items are hard to recover. Pursuing office or promotion is unfavorable—hasten to resolve matters, for success is unlikely. Borrowing brings initial difficulty, then ease; entrusting others follows the same pattern.\n\nEight blades remain unfinished,\nDark arrows strike the unseen.\nHarm to others returns to oneself—\nFortune departs, misfortune invades.\n\n**[Missing character] Thirty-Ninth: Neutral – Guard Against Humiliation**\nSpeak not of heroes untouched by misfortune—\nGrand ambitions meet disgrace, hard to endure.\nTurn back, amend faults—no shame in correction;\nSeek the open path, inquire wisely.\n\nSuddenly lost in deep mountains,\nBetter to return, free of doubt.\nAdvance or retreat, travel—all bring misfortune;\nBeware hidden deceit and loss.\n\nThough goods arrive late, their prospects are bright—\nBest to maintain the old and observe the bold.\nWhen a leader emerges, fortune turns auspicious,\nAnd wealth later flows like a blade.\n\n**The Sage’s Intent:**\nThe strong and lawless\nLightly bully the good and kind.\nVicious debts are hard to seize—\nSuffering disgrace, one is cast aside.\nYet amend faults once,\nAnd misfortune vanishes, no more to return.\nFirst ill, then good—\nAll depends on timely action.\nThis lot is not auspicious;\nHasten to fulfill old vows.\n\n**Divination on Wealth:**\nBuying, selling, and trading goods are favorable; selling is auspicious. Farming yields nothing. Travel is unfavorable; travelers face obstacles. Entrusting others brings no success; the ill should seek protection. Marriage is inauspicious; childbirth requires safeguarding. Plans and actions should be altered—even success is unfavorable. Lawsuits should be settled amicably; buying old homes or servants is unpropitious. Documents are unfavorable; relocation is ill-advised. Seeking medical or artistic skills is unprofitable. Pursuing office or promotion succeeds if one entrusts others again. Borrowing is unfavorable; lost items, if sought quickly, may not be found.\n\nFading blossoms gradually revive,\nThe broken moon regains its round.\nAmend faults, and gods and men will praise—\nReunion ensures completion.\n\n**[Missing character] Fortieth: Neutral – Later Auspicious**\nA heart harboring malice, lacking kindness,\nIn life and death, filial impiety spreads.\nYet turn toward the Dao, reform the old—\nA foundation endures, heirs thrive in the household.\n\nThe swan soars to the heavens, naturally,\nBut before its time arrives, misfortune strikes.\nThis day, ascension brings freedom—\nSoaring straight to the clouds of the nine skies.\n\nHearing news, the truth is praiseworthy;\nApproach the gate, and splendor awaits.\nIf you entrust others, it ends inauspiciously—\nEmpty words tangle worldly affairs like hemp.\n\n**The Sage’s Intent:**\nA lifetime of malice,\nDisharmony with kin.\nTransforming life and death,\nTurn toward this heart.\nSwear to heaven, repent to earth,\nReform the old, renew the new.\n\nIllness gradually lessens; plans and ventures succeed.\nFor marriage or lawsuits, peace is ultimately achieved.\nShift from ill to good—\nJoy fills the household.\n\n**Divination on Wealth:**\nDelay brings profit; purchasing goods is good, selling is good. Farming faces initial difficulty, then ease. Marriage is inauspicious. The ill recover slowly—vows may cause seven days of cold, then sweat; if delayed, perform good deeds. Household and family are at peace; relocation is auspicious. Lost items, if sought urgently, remain at home. Documents are delayed; trade is favorable. Borrowing brings delayed profit; entrusting others is urgent and auspicious. Transactions succeed with delay and profit; childbirth is auspicious after delay.\n\nMeeting or not—first guard against obstruction and disaster.\nReturn to the true Dao,\nAnd avoid losing segmental wealth.\n\n**[Missing character] Forty-First: Neutral – Caution, Do Not Act**\nThe traveler’s road stretches endlessly, ancient inns lie desolate—\nOpening one’s eyes only invites separation.\nBest to maintain the old, passing days in peace,\nTo preserve contentment and steady fortune.\n\nFalling blossoms, flowing water—both heartless,\nThe household is troubled, the master uneasy.\nWomen and children face illness and hardship—\nHasten to pray to the gods of prosperity.\n\nThough treasures emerge from the sea,\nBoarding a foreign ship is a vain journey.\nArriving, one knows not where to go—\nReturning empty-handed, bare as before.",
      "overlap_context": "his path bright,\nHis household prosperous and at peace.\n\nWhen buying, prices soar—\nSell at a bargain, do not hesitate.\nThough profit is meager,\nWandering here is but wasted effort.\n\nThe Sage declares:\nDisaster clings like a web—\nWho could foresee its source?\nUnfulfilled vows endanger safety;\nPhysicians and shamans spin tales, squandering coin.\nHasten to cultivate virtue\nTo appease Heaven above.\nFirst sorrow, then joy;\nFirst hardship, then ease.\nPerform good deeds—\nThe gods will grant protection.",
      "start_char": 14452,
      "end_char": 15403,
      "start_sentence": 974,
      "end_sentence": 1040,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.35262107849121,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "圣意云：出行谋望，害己损财。 且宜守旧，保尔无灾。 公事和了，疾病久怀。 不宜动土，恐有悲哀。 常惊怪梦，百事低回。 占财，无旧有货好守。 种田薄收。 病不问老少，多凶少吉。 宜告斗，婚姻不吉，公讼宜和。 出行自己有小失，行人至。 田宅、人口，头疋不利，文书不济。 借物不成，失物难寻。 产孕求保，买货脱货不利。 托人用事宜守旧，交易难成。 见喜变为忧，占身反作怜。 出入防损失，灾讼未能休。 □□　第四十二　大吉　欲醒 久钝思磨醉欲醒，顿思更变未原情。 冰消雪散和风至，垫者潜升枯者荣。 游鱼出水戏波间，跳跃优游莫等闲。 喜遇泰来通万事，更於险难胜於前。 兵势休言出世奇，阵中成败少人知。 战胜中间还有损，争如不战自相如。 圣意云：久淹如醉，多能频遇。 垫不久闭，雷声徐徐，冰消雪散，和风自至。 百事如意，综迹伸舒。 病讼宜福，保尔无虞。 所谋大吉，不可踌蹰。 占财，买卖春首有财，余月不中，置货好，诸事吉。 种田收。 出行宜快，恐去不成，行人三二日至。 婚姻吉，先难后易。 迁移吉利。 病老少，春瘥快，余月迟。 托人用事宜快，脱事宜快。 家宅人口平安，求官升职吉利。 昏昏醉欲醒，久困渐通亨。 否极时逢泰，勾萌尽发生。 □□　第四十三　中平　应天 役役人生七十稀，阴阳淫疾速求医。 天曹修短皆前定，不与尘几取次知。 日出扶桑万里明，贵人喜庆自通亨。 求财谋望从心意，若问求官定得名。 自古人才志气高，於中有事不交爻。 机关不漏一些子，顷刻成名耀大曹。 圣意云：老者悲伤，少者无疑。 宜作善福，庶保怡怡。 公事平稳，谋望稽迟。 动作平平，莫特巧机。 占财，轻置货好，脱货好。 种田薄收，出行少者安，老者危，行人至。 迁移快吉。 病老者重少者，有天曹并善愿早还无妨，痘疮主尖。 交易宜快。 初婚不吉，重婚宜快吉。 公讼宜快和，文书迟成。 田宅、人口、头足俱不利，借钱· 无多。 谋事成事宜快成。 产孕平稳，宜保佑吉。 兴贩快利，家宅人口老者危少者安。 托人用事吉，求官升职冬分成。 脱事宜快迟难，走失难寻。 西山日渐落，无色似黄昏。 屈指伤悲处，图谋空断魂。 □□　第四十四　上上　合天 否泰相仍理自然，合乡刚毅合苍天。 灾衰有命今冰释，降福禳秾志愈坚。 乌云遮月暗朦胧，暗昧门庭事未中。 只宜守旧方为吉，直待云开万事通。 今日来占此意中，速来速去您西东。 虽然财物无多子，照耀清光满眼红。 圣意云：为人公正，穷达如常。 不介凶次，岂不余殃，行藏通泰，降福禳禳。 吉人天相，获福吉昌。 灾害渐退，声誉扬扬。 所为吋吉，永保安康。 占财，有三分，置货好，脱货好各吉。 种田好收。 病老少，伤七八日得汗迟瘥。 交易成，出行吉，行人未至。 家宅人口平安，婚姻宜快迟难成。 买田宅人口头疋，宜快迟难成有益。 文书吉利，谋事成事宜快迟费力。 求医艺利，求官升职宜快。 产孕吉，公讼吉。 当年挂布衣，今日却坡绯。 脱去尘几吉，祖玉见光辉。 □□　第四十五　大吉　屈伸 风有因缘岂暂成，那堪占卜觅佳音。 经求负贩情无外，晦者斯先屈者伸。 风雷鼓舞播乾坤，万物萌芽自此伸。 君子求谋皆遂意，庶人人口进家门。",
      "translated_text": "The Sage’s Intent declares: Journeys and schemes bring harm to oneself and loss of wealth. It is best to maintain the old and preserve yourself from disaster. Public matters are settled, but illness lingers long. Do not break ground, lest sorrow arise. Strange dreams unsettle the heart, and all affairs falter. In matters of wealth, if there is no old stock, guard what goods you have. Farming yields meager harvests. Illness spares neither old nor young—mostly inauspicious, rarely favorable. Pray to the Dipper Star. Marriage is inauspicious; lawsuits should be settled amicably. Travel brings minor losses to oneself; the traveler arrives. Fields, dwellings, and household members face misfortune in the head and limbs; documents bring no success. Borrowing fails; lost items are hard to recover. Childbirth requires protection; buying or selling goods is unfavorable. Entrusting others with tasks—maintain the old; transactions are difficult to complete. Joy turns to sorrow; fortune reverses to pity. In all dealings, guard against loss—disputes and calamities will not cease.\n\n**[Missing character] Forty-Second: Great Auspice – Awakening**\nLong dullness stirs, as if waking from drunkenness,\nSuddenly thoughts of change arise, though not yet to their source.\nIce melts, snow scatters, and the gentle breeze arrives—\nThe sunken rise in secret, the withered flourish anew.\nFish leap from the water, playing amidst the waves,\nLeaping and gliding—do not take this lightly.\nFortune comes with ease, all matters flow smoothly,\nEven in peril, victory surpasses the past.\nDo not boast of martial prowess or extraordinary feats,\nFor in battle, few know true success or failure.\nEven in victory, there is loss—\nBetter to avoid conflict and find peace.\n\nThe Sage’s Intent declares: Long stagnation is like drunkenness, yet many encounters follow. The sunken will not remain trapped; thunder rumbles slowly, ice melts, snow scatters, and the gentle breeze arrives of itself. All affairs proceed as wished, and suppressed paths unfold. Illness and disputes turn to fortune—you will be free from worry. All schemes are greatly auspicious; do not hesitate. In matters of wealth, trade at the start of spring brings profit; other months are less favorable. Storing goods is good; all affairs are auspicious. Farming yields a harvest. Travel should be swift, lest it fail; the traveler arrives in two or three days. Marriage is auspicious, though difficult at first, it becomes easy later. Relocation is favorable. Illness in the old or young recovers quickly in spring, but slowly in other months. Entrusting others with tasks—act swiftly; resolving matters—act swiftly. Household and family are at peace; seeking office or promotion is auspicious. From drunken stupor to awakening, long hardship gradually gives way to smoothness. When the worst is past, fortune arrives—new shoots emerge from the earth.\n\n**[Missing character] Forty-Third: Neutral – Aligning with Heaven**\nLife’s toil rarely sees seventy,\nYin and yang’s excesses—seek a physician swiftly.\nHeaven’s decree on lifespan is predetermined,\nNot for mortal dust to know lightly.\nThe sun rises over Fusang, illuminating ten thousand miles—\nNobles rejoice, and all flows smoothly.\nSeeking wealth and schemes follows the heart’s desire;\nAsking for office—surely one will gain a name.\nSince ancient times, the talented and ambitious stand tall,\nYet in their midst, affairs do not align.\nNot a single flaw in their schemes—\nIn an instant, fame shines upon the great assembly.\n\nThe Sage’s Intent declares: The old grieve; the young have no doubt. Perform good deeds and blessings to preserve peace. Public matters proceed steadily; schemes are delayed. Actions are ordinary—do not devise clever tricks. In matters of wealth, lightly stored goods are good; selling goods is good. Farming yields a meager harvest. Travel is safe for the young but perilous for the old; the traveler arrives. Relocation is swiftly auspicious. Illness in the old is grave, but in the young, if one repays heavenly debts and fulfills good vows early, there is no harm—pox marks will be sharp. Transactions should be swift. First marriages are inauspicious; remarriage is swiftly auspicious. Lawsuits should be settled quickly; documents take time to complete. Fields, dwellings, household members, heads, and limbs are all unfavorable; borrowing money is not excessive. Schemes and tasks should be completed swiftly. Childbirth is stable—pray for protection and good fortune. Trade brings swift profit; in households, the old are in danger, the young are safe. Entrusting others with tasks is auspicious; seeking office or promotion succeeds in winter. Resolving matters should be swift—delay brings difficulty. Lost items are hard to find.\nThe sun sets behind the western mountains,\nIts color fading like dusk.\nCounting the sorrows,\nSchemes dissolve into vain sorrow.\n\n**[Missing character] Forty-Fourth: Supreme Auspice – Harmonizing with Heaven**\nMisfortune and fortune alternate by natural principle,\nAligning with the village’s resolve and Heaven’s will.\nDisasters and decline are fated—now the ice melts,\nDescending blessings and exorcising abundance strengthen the resolve.\nDark clouds veil the moon, dim and obscure,\nThe household’s affairs are unclear.\nIt is best to maintain the old for good fortune—\nWait until the clouds part, and all matters will flow smoothly.\nToday’s divination holds this meaning:\nSwift come, swift go—east or west.\nThough wealth is not abundant,\nIts clear light shines full before the eyes.\n\nThe Sage’s Intent declares: A person of integrity, whether poor or prosperous, remains constant. Unaffected by misfortune, how could lingering calamity remain? Conduct and retreat flow smoothly; blessings descend and exorcise. The virtuous are aided by Heaven, gaining fortune and prosperity. Disasters gradually recede; reputation spreads. All undertakings are auspicious—preserve peace forever. In matters of wealth, there is a third portion; storing goods is good, selling goods is good—all auspicious. Farming yields a good harvest. Illness in the old or young—wounds heal in seven or eight days; recovery is slow. Transactions succeed; travel is auspicious; the traveler has not yet arrived. Household and family are at peace; marriage should be swift—delay makes it difficult to complete. Buying fields, dwellings, household members, heads, or limbs should be swift—delay is difficult but beneficial. Documents are auspicious; schemes and tasks should be swift—delay requires effort. Seeking medical skills brings profit; seeking office or promotion should be swift. Childbirth is auspicious; lawsuits are auspicious.\nOnce clad in coarse cloth,\nToday adorned in crimson.\nShedding the dust of the world,\nAncestral jade gleams with light.\n\n**[Missing character] Forty-Fifth: Great Auspice – Yielding and Extending**\nWind arises from causes—how could it form in an instant?\nHow can divination seek good tidings?\nTrade and commerce, no matter how far,\nThe obscured will rise first, the yielding will extend.\nWind and thunder stir, shaking heaven and earth,\nAll things sprout—from here, they grow.\nThe noble’s schemes all come to fruition,\nThe commoner’s household welcomes prosperity.",
      "overlap_context": "nt inns lie desolate—\nOpening one’s eyes only invites separation.\nBest to maintain the old, passing days in peace,\nTo preserve contentment and steady fortune.\n\nFalling blossoms, flowing water—both heartless,\nThe household is troubled, the master uneasy.\nWomen and children face illness and hardship—\nHasten to pray to the gods of prosperity.\n\nThough treasures emerge from the sea,\nBoarding a foreign ship is a vain journey.\nArriving, one knows not where to go—\nReturning empty-handed, bare as before.",
      "start_char": 15404,
      "end_char": 16721,
      "start_sentence": 1041,
      "end_sentence": 1132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.16225337982178,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "此意占之得吉祥，於中求事见时亨。 虽然小辈来侵闹，大道身躯自吉昌。 圣意云：占亲利益，夙气寅缘。 经求谋望，财物绵绵。 公讼得理，病者迟痿，动为合吉，家宅安全，行人通泰，人月团圆。 占财，有五六分，置货吉，脱货吉。 迟种田吉，婚姻大利，出行利，行人迟，公讼吉，田宅、人口、头疋迟成。 脱事吉利，谋事成事不称意。 产孕吉利，求官升职名分不达。 借钱有三分，脱货后无价，动用吉。 欲识前途事，文书正好求。 忧危成吉兆，终日自然休。 □□　第四十六　中平　易脱有财 山川悠远历艰难，聚散须知反掌间。 近涉争知经久利，秋深冬首称心颜。 螣蛇入梦主忧疑，防慎家门有贼欺。 将来革故方为吉，进退如今未遇时。 求财於我事如何，守货占财守利多。 大放心怀长久去，自然瑛玉有人磨。 圣意云：经求涉远，贪心无厌。 财物聚散，少得十全。 秋冬有望，春夏休言。 一切谋运，事亦如然。 病者自痒，讼者留连。 若求安泰，宜谢苍天。 占财，买卖劳心置货好，秋冬吉，脱货快。 种田不完全，婚不吉。 出行秋吉利，行人至。 公讼难，借物秋冬吉。 病老少，春夏得，秋方瘥，多凶宜善事，秋冬病瘥迟。 买田宅、人口、头疋，秋冬吉，春夏凶。 谋事成事，秋冬吉，春夏不吉。 家宅人口，秋冬吉。 兴贩、文书、产孕，秋冬俱吉。 求官升职，秋冬吉。 托人用事难成，脱事上半年不利，下半年吉。 交易秋冬吉，余月不中。 禾粒方好去，用意望云梯。 谋望皆好用，云开月正辉。 □□　第四十七　大吉 素秉精诚格至神，行藏时获吉来临。 图谋若也瑜邪径，不误从前道合真。 密云无雨天边暗，却主忧疑亦不坊。 更慎小人来害己，家门暗昧事须防。 求财意欲一亨通，争奈才人西复东。 三五中间虽实有，事当并定一遭空。 圣意云：好善获吉，积恶就凶。 纵当正道，福不须求。 公讼泰定，占亲无忧。 所谋皆就，出路忧疑。 百事遂意，无有迟留。 占财，买卖正道无利，邪道大旺，置货好，脱货好。 种田大收，公讼不吉。 病老少，有阻犯土，并祈福保佑不妨。 婚姻吉利，诸事吉利。 出行吉，行人三日至。 见立未安坟，传书用破心，几回遭险浪，今日遇知音。 □□　第四十八　中平　阴阳 阴阳匹偶不徒然，勉强求神积善缘。 念念孰知遵大义，好於财物保安全。 宝剑新磨益见光，东西照耀倍寻常。 从前自有根基在，润色增明声播扬。 欲望平生富益和，怎知好事却多魔。 只宜守旧安居吉，自有凌云志气多。 圣意云：求谋大吉，缘法夙契。 若有机谋，事恐难济。 资财善保，公事莫易。 若占家宅，且须谨忌。 病者不妨，行者迟滞。 占财，买卖少有，置货好，脱货好。 求医业名分不成。 公讼不吉，破财不妨。 病者善愿无妨。 出行不中，行人未至。 失物后见，婚姻迟晚大吉。 种田薄收。 占事须防多阻滞，求名问卜事难量。 要卜守旧多安稳，自有荣华禄位昌。 聚四发成女，须忧事不中。 早园能备禄，家眷免灾凶。 □□　第四十九　上上　破星 石中有玉谁能别，沙裹藏金不易淘。 穷达在时须有得，何须怀抱只徒劳。 群鸦集噪可为奇，防慎阴人口舌危。 退步之时方可得，不然事绪主忧疑。 迟中求事可须迟，长久光阴事莫疑。",
      "translated_text": "Here the divination yields good fortune—\nin its midst, seeking affairs meets timely success.\nThough petty men come to harass and clamor,\nthe great Dao’s body remains auspiciously flourishing.\n\nThe Sage’s intent declares:\nDivining kinship brings profit, with long-standing qi and destined affinity.\nIn trade and scheming, wealth flows unceasingly.\nLawsuits prevail; the ill recover slowly.\nAll movement aligns with good fortune—\nthe household is secure, travelers prosper,\nand family reunites in full moon’s glow.\n\nDivining wealth: five or six parts favorable.\nPurchasing goods is auspicious; selling goods is auspicious.\nPlanting late brings good harvest; marriage is greatly fortunate.\nTravel is favorable; travelers return late.\nLawsuits are auspicious; fields, households, and livestock mature slowly.\nShedding burdens is fortunate; schemes and tasks fall short of desire.\nChildbirth is auspicious; seeking office or promotion fails to advance.\nBorrowing money yields three parts; after selling goods, prices fall.\nAll movement is auspicious.\n\nTo discern the road ahead,\npetition with proper documents.\nWorries and dangers turn to good omens—\nthroughout the day, all naturally resolves.\n\n**[Missing character] Forty-Sixth: Moderate – Easy Release with Wealth**\nMountains and rivers stretch far, enduring hardships—\nknow that gathering and parting are but a turn of the hand.\nNear ventures seem profitable, yet how can they last?\nDeep autumn, early winter bring contentment.\n\nA flying serpent in dreams portends doubt—\nguard against thieves deceiving the household.\nOnly by shedding the old does fortune come;\nadvance and retreat now meet no timely hour.\n\nSeeking wealth—how fare my affairs?\nHolding goods, divining wealth, yields greater profit.\nRelease your cares and depart for long—\nnaturally, jade is polished by others.\n\nThe Sage’s intent declares:\nTrade ventures far, greed knows no bounds.\nWealth gathers and scatters—\nseldom is ten-tenths gained.\nHopes lie in autumn and winter;\nspring and summer bring no words of promise.\nAll schemes and fortunes follow this pattern.\nThe ill recover slowly; lawsuits linger.\nFor peace and prosperity,\ngive thanks to Heaven.\n\nDivining wealth: commerce wearies the mind, but purchasing goods is good.\nAutumn and winter are auspicious; selling goods is swift.\nFarming is incomplete; marriage is inauspicious.\nTravel in autumn is favorable; travelers arrive.\nLawsuits are difficult; borrowing in autumn and winter is auspicious.\nIllness afflicts young and old—\nin spring and summer, recovery comes;\nin autumn, healing is slow.\nMuch misfortune—good deeds are advised.\nIllness in autumn and winter recovers late.\nBuying fields, households, or livestock—\nautumn and winter are auspicious; spring and summer, inauspicious.\nSchemes and tasks—\nautumn and winter are auspicious; spring and summer, not.\nHouseholds and family—\nautumn and winter are auspicious.\nCommerce, documents, childbirth—\nall are auspicious in autumn and winter.\nSeeking office or promotion—\nautumn and winter are auspicious.\nRelying on others for tasks is difficult;\nshedding burdens is inauspicious in the first half of the year,\nauspicious in the latter half.\nTrade is auspicious in autumn and winter;\nother months are unfavorable.\n\nGrain ripens—now is the time to act,\nwith intent fixed on the cloud ladder.\nAll schemes and hopes are well-timed—\nclouds part, the moon shines bright.\n\n**[Missing character] Forty-Seventh: Great Auspice**\nInnately holding pure sincerity, your conduct reaches the divine—\nin due time, good fortune arrives.\nIf schemes stray from the straight path,\nthey will not err from the true Dao.\n\nDense clouds without rain darken the sky’s edge—\nyet this portends doubt, not obstruction.\nBeware of petty men harming you;\ndarkness veils the household—guard against affairs.\n\nSeeking wealth, you desire unimpeded flow,\nyet talent moves west, then east again.\nThough three or five parts are substantial,\nmatters may yet end in one stroke of emptiness.\n\nThe Sage’s intent declares:\nGood deeds bring fortune; evil accumulates misfortune.\nEven when walking the right path,\nblessings need not be sought.\nLawsuits settle peacefully; divining kin brings no worry.\nAll schemes succeed; journeys harbor doubt.\nAll affairs proceed as wished, without delay.\n\nDivining wealth: upright commerce yields no profit;\ndevious paths flourish greatly.\nPurchasing goods is good; selling goods is good.\nFarming reaps great harvest; lawsuits are inauspicious.\nIllness afflicts young and old—\nobstacles from earth spirits require prayers for protection, but no harm.\nMarriage is auspicious; all matters are fortunate.\nTravel is auspicious; travelers arrive in three days.\n\nErecting a new grave unsettles—\nsending letters strains the heart.\nSeveral times you’ve faced perilous waves;\ntoday, you meet a confidant.\n\n**[Missing character] Forty-Eighth: Moderate – Yin and Yang**\nYin and yang pair not in vain—\nstrive to seek the divine, accumulating good affinity.\nMoment by moment, who knows to follow great righteousness?\nBetter to safeguard wealth and ensure security.\n\nA newly sharpened sword gleams brighter—\nits east-west radiance surpasses the ordinary.\nFrom the past, roots already exist;\npolished and enhanced, its fame spreads.\n\nDesiring lifelong wealth and harmony,\nwho knew good fortune would bring many demons?\nBetter to maintain the old—peaceful dwelling is auspicious.\nNaturally, you possess soaring aspirations.\n\nThe Sage’s intent declares:\nSeeking schemes brings great fortune, with destined affinity.\nYet if plotting, affairs may falter.\nPreserve resources well; do not trifle with public matters.\nDivining households requires caution.\nThe ill are unharmed; travelers are delayed.\n\nDivining wealth: commerce yields little.\nPurchasing goods is good; selling goods is good.\nSeeking medical skills or official rank fails.\nLawsuits are inauspicious—losing wealth is no harm.\nThe ill recover through good vows.\nTravel is unfavorable; travelers have not arrived.\nLost items will reappear; marriage is late but greatly auspicious.\nFarming yields meager harvest.\n\nDivining affairs: expect many obstacles.\nSeeking rank or divination—outcomes are hard to measure.\nTo divine stability, maintaining the old brings peace—\nnaturally, glory and official position flourish.\n\nGathering four to form a woman—\nbeware, affairs may fail.\nEarly gardens secure provisions—\nthe household avoids disaster and misfortune.\n\n**[Missing character] Forty-Ninth: Supreme – Breaking Star**\nWho can distinguish jade within stone,\nor pan for gold hidden in sand?\nProsperity and decline depend on timing—\nwhy cling to empty aspirations?\n\nA flock of crows gathers noisily—how strange!\nBeware of slander from yin persons.\nOnly in retreat can you gain;\notherwise, affairs breed doubt.\n\nSeeking matters in delay—delay is fitting.\nThrough long and enduring time, doubt not.",
      "overlap_context": "the dust of the world,\nAncestral jade gleams with light.\n\n**[Missing character] Forty-Fifth: Great Auspice – Yielding and Extending**\nWind arises from causes—how could it form in an instant?\nHow can divination seek good tidings?\nTrade and commerce, no matter how far,\nThe obscured will rise first, the yielding will extend.\nWind and thunder stir, shaking heaven and earth,\nAll things sprout—from here, they grow.\nThe noble’s schemes all come to fruition,\nThe commoner’s household welcomes prosperity.",
      "start_char": 16722,
      "end_char": 18046,
      "start_sentence": 1133,
      "end_sentence": 1218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.59027314186096,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "财货久长难可守，守之事意实提携。 圣意云：自负才能，未遂其至。 操持坚固，何须不济。 病者自瘥，讼不久滞。 谋运向前，进取得贵。 百事皆通，英风不坠。 占财，买卖迟有四五分。 种田宜劳力有收。 失物便见，婚姻宜快成吉。 病有愿便还，少者好老者不中。 脱货宜迟有利，忙无利不中。 公讼宜和无事，行人便至，家居吉。 诸事吉。 门望渐声高，文书得坚牢。 称心方可得，入海钓鱼惊。 四圣真君灵签竟 ＃１『魉魑』底本无，据上下文补。",
      "translated_text": "Wealth and goods long held are hard to keep—\nholding them demands true vigilance.\nThe Sage’s intent declares:\nOne who trusts in talent yet fails to reach their aim—\nwith steadfast resolve, what cannot be achieved?\n\nThe sick shall recover on their own;\ndisputes will not long linger.\nPlans advance, fortunes rise—\nseizing opportunity brings honor.\nAll affairs flow smoothly,\nheroic spirit unbroken.\n\nDivining wealth: trade delayed yields four or five parts.\nFarming rewards labor with harvest.\nLost items soon appear;\nmarriages should be swiftly sealed—auspicious.\nVows for the ill bring recovery—\nthe young fare well, the old less so.\nSelling goods delayed brings profit;\nhaste yields none.\nPublic disputes best settled in peace;\ntravelers soon return, the household thrives.\nAll matters prosper.\n\nThe household’s renown grows,\ndocuments stand firm.\nDesires are fulfilled—\nyet casting lines in the sea brings alarm.\n\nThe divination of the Four Sage Perfected Lords concludes.\n*(Note: \"魉魑\" absent in the original text, supplied from context.)*",
      "overlap_context": "cure provisions—\nthe household avoids disaster and misfortune.\n\n**[Missing character] Forty-Ninth: Supreme – Breaking Star**\nWho can distinguish jade within stone,\nor pan for gold hidden in sand?\nProsperity and decline depend on timing—\nwhy cling to empty aspirations?\n\nA flock of crows gathers noisily—how strange!\nBeware of slander from yin persons.\nOnly in retreat can you gain;\notherwise, affairs breed doubt.\n\nSeeking matters in delay—delay is fitting.\nThrough long and enduring time, doubt not.",
      "start_char": 18047,
      "end_char": 18259,
      "start_sentence": 1219,
      "end_sentence": 1235,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.0014097690582275,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\四圣真君灵签.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}