{
  "source_id": "四气摄生图",
  "source_file": "chunked_daozang\\四气摄生图.json",
  "total_chunks": 14,
  "total_original_chars": 10517,
  "total_translated_chars": 60760,
  "total_translation_time": 312.6745502948761,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
    "category": "灵图类"
  },
  "full_translation": "**The Four Qi Life-Nurturing Chart**\n\n**Scripture Title:** *The Four Qi Life-Nurturing Chart* (also known as *The Four Seasons Life-Nurturing Chart*). Author unknown. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Lingtu* Category.\n\n**Preface to the Four Qi Life-Nurturing Chart**\n\nThose who govern a state take nourishing the people as their foundation; those who cultivate the self take treating illness as their priority. Between heaven and earth, none is more noble than humankind. Thus, among the *Hongfan*’s Five Blessings, the first is longevity—even august Heaven deems it the greatest of all fortunes.\n\nHumans rely on primordial *qi* to assume form, receiving *yin* and *yang* *qi* from heaven and earth alike. The Yangtze, Yellow, Huai, and Ji Rivers; the Five Peaks and Nine Provinces; grasses, trees, and celestial bodies—all things, when compared and categorized, are abodes of the numinous, each governed by its own principle. Preserve them, and they exist; abandon them, and they vanish. Preserve them, and life endures; abandon them, and death follows.\n\nThe *Huangting* states: “The mouth is the heavenly gate of the spirit’s mechanism; the feet are the earthly gate of life’s portal; the hands are the human gate, grasping prosperity and decline.” Heaven and earth contain the numinous, yet all rests within human grasp. If the body is so precious, how can life be taken lightly?\n\nThe *Qi Jue* further declares: “My life is in my hands, not in Heaven’s.” Those who misuse it perish; those who master it endure. It also says: “When essence is refined, clarity arises; when spirit is refined, numinosity arises; when *qi* is refined, purity arises; when the primordial is refined, mystery arises.” Through *qi*, one declines; through *qi*, one flourishes; through *qi*, one perishes; through *qi*, one is born. There has never been form without *qi*, nor *qi* without form. Form and *qi* depend on each other, and their completeness lies in cultivation.\n\n*Laozi* says: “The gate of the Mysterious Female is the root of heaven and earth. Subtly, it seems to exist; its use is inexhaustible.” The human mouth and nose are the doors and windows through which the numinous enters and exits. The spirit relies on form, form relies on *qi*, and *qi* relies on blood. Blood and *qi* follow each other like fish in water. When water is turbid, fish grow weary; when *qi* is obstructed, illness arises. Thus, *qi* must be kept clear, blood must circulate, and with unceasing flow, rest and diet aligned with the seasons, the five viscera remain harmonious—how then could illness arise?\n\nIf even one viscus loses its harmony, the Triple Burner is assailed by evil, primordial *qi* fails to nourish, and a host of ailments arise together. Confucius said: “Irregular rest and diet, immoderate desires, and excessive labor or leisure—these, along with illness, will destroy you.”\n\nMoreover, when spring winds arrive, grasses and trees burst forth in bud, yet the grain stored in bitter cold does not sprout. When autumn’s frost and rain descend, grasses and trees wither, yet those sheltered by cover remain unharmed. If even the nature of grasses and trees is thus, how much more so the five viscera and six bowels of the human body—do they not depend on cultivation?\n\nYet the world’s people, unable to practice cultivation, perish one after another, mistaking death for the end of life, attributing illness and debility to the decline of sinews, and believing the union of heaven and earth to be inevitable, never trusting that longevity can be preserved.\n\nHeaven nourishes humans with the Five *Qi*; earth nourishes humans with the Five Flavors. Those who drink the Five *Qi* return to heaven; those who consume the Five Flavors return to earth. Most illnesses arise from improper diet, and the harm of diet surpasses even that of sensual indulgence. Sensual pleasures can be abstained from for years, but diet cannot be abandoned for a single day. Though it offers great benefit, it also brings great harm—like water that both floats and capsizes a boat.\n\nNurturing life through the four seasons depends on moderation. The *Baosheng Rong* states: “Sour flavors harm the sinews; excessive acridity injures the upright *qi*; sweet things do not benefit the flesh; excessive bitterness harms the will; excessive alcohol shortens life—one must not indulge in partiality or craving. Overthinking harms the nature; joy and anger injure the spirit. When the nature is harmed, life is endangered; when the spirit is injured, life is encroached upon. Nurture the nature to preserve *qi*; guard the spirit to calm the mind. If one exhausts the mind in pursuit of things, wearies the body externally, and drains the essence internally, a multitude of evils will arise—how then can longevity be attained?”\n\nThe spirit follows *qi*, and *qi* depends on flavor. When flavors are harmonious, primordial *qi* is clear; when primordial *qi* is clear, the spirit is bright; when the spirit is bright, there is no illness. Thus, the body should be kept in constant, moderate motion, and food should be kept in moderation. Do not overtax labor, nor let hunger become extreme.\n\nFrom the Spring Equinox to the Summer Solstice, consume fewer dairy and sweet foods, as they conflict with raw and cooked dishes. From the Summer Solstice to the Autumn Equinox, eat fewer baked and fried foods, as they conflict with melons. Though illness may not arise immediately, it will eventually manifest as various acute conditions—this is the principle of returning to the root.\n\nExcessive clothing and thick bedding weaken the body, leading to wind-cold illnesses. Beautiful, alluring concubines lead to depletion and emaciation. Overindulgence in rich flavors, forced eating when sated, and excessive drinking lead to hernial and obstructive illnesses.\n\nThe Way of nurturing life: avoid prolonged walking, sitting, listening, or gazing; do not force eating or drinking. Worry, sorrow, hunger, and thirst—let daily pursuits be ceaselessly moderate. Thus it is said: “Flowing water does not stagnate; a door hinge does not rot—because they are in constant motion.”\n\nTo guide and pull *qi*, one need not perform phoenix flights or monkey leaps, tiger crouches or ape bounds. Simply stretch the four limbs, move the nine orifices, and let blood and *qi* circulate, ascending and descending in free flow. The *Zhenqi Ming* states: “To eliminate illness, guiding and pulling come first. When meridians are unobstructed, joints are at ease.” Sometimes, like drawing a bow to shoot a hawk, bend the body sideways in a curve; sometimes, arch the spine like a half-moon toad. Interlace fingers behind the head, rotating left and right; stretch the limbs fully, letting *qi* flow from the fingertips. Swing the four limbs, grasp and expand the Three Passes. Rub until warm and red, and do the same for the *Qihai*. Thus, with proper nurturing, one’s years may equal those of the tortoise and crane; with reckless indulgence, one’s life may be as brief as the clam or mayfly.\n\nFrom youth, I admired the Daoist gate and dwelled in simplicity, exploring the profound subtleties of the *Huangting* and plumbing the mysteries of the *Five Thousand Characters*. Now, I have gathered medical texts, collected secret methods, and recorded the taboos and practices of the four seasons for a year’s cultivation, placing them by my seat.\n\nHere follows the *Four Seasons Nurturing Life Chart*.\n\n**Four Seasons Nurturing Life Chart**\n\n**Spring: The Liver Reigns**\nThe liver belongs to the Wood of the East, governed by the Azure Emperor Spirit, its form like the Green Dragon, its likeness like a hanging gourd. The liver is called *gan* (trunk), for its shape resembles branches and stems—hence the name. It weighs four *jin* and four *liang*, situated below the heart, with seven lobes: three on the left, four on the right. The liver is the mother of the heart and the child of the kidneys.\n\nBeneath the liver dwell the Three Hun—Souls: *Shuangling* (Luminous Clarity), *Taiguang* (Womb Light), and *Youjing* (Hidden Essence). At nightfall and in ordinary times, knock the teeth thirty-six times to summon the liver spirit and the spirits of the Three Hun. The eyes are its palace: the left eye is *jia*, symbolizing the sun and belonging to *yang*; the right eye is *yi*, symbolizing the moon and belonging to *yin*. When the liver releases fluid, it becomes tears; if kidney *qi* invades the liver, one weeps excessively. The gallbladder is its paired *fu*-organ, attached to the liver beneath its short lobe.\n\nThe *Huangting Jing* states:\n*The liver’s qi surges, clear and long,\nArraying the six fu to birth the Three Lights.\nHeart’s essence and intent focus inward, unwavering,\nAbove uniting with the Triple Burner, below with Jade Nectar.*\n\nIts sound is *jiao*, its nature benevolence, its flavor sour, its odor rank. If heart *qi* invades the liver, one loathes rank odors. Its creature is the scaled; all scaled beings belong to the East. The liver spirit delights in benevolence and compassion—grief and lamentation arise from the liver. When the liver spirit is joyful, illness does not arise; when it hears sorrow, tears flow—tears issue from the liver.\n\nIn the three months of spring, Wood flourishes: Heaven and Earth’s *qi* quickens, and the myriad things flourish. To pacify its spirit, one should bestow kindness upon all creatures, let mercy extend to all beings, neither drain rivers nor marshes nor empty ponds, so as to nurture sprouts and cease harm and killing. Thus one harmonizes with the Great Clarity, aligning with Heaven and Earth’s generative *qi*. Sleep early and rise early, thereby attaining the Dao. If one opposes this, the hair and bones will not flourish; Metal *qi* will overcome Wood, and manifold illnesses will arise. Such afflictions are difficult to cure, becoming the scourge of spring and summer.\n\nThe liver spirit is named *Longyan*, styled *Hanning*. The liver’s form is green in color, its shape resembling a suspended gourd, and its spirit like a dragon.\n\nThe liver connects to the interstices above and governs the eyes—when the liver is in excess, the eyes turn red. It also governs the sinews: when the sinews are tense, the liver is deficient. When the skin is withered, the liver is hot. When the flesh and bones bear speckles, it is liver wind. When the complexion is green, the liver is in excess. When one craves sour flavors, the liver is insufficient. When the hair is withered, the liver is injured. If lung evil invades the liver, one laughs excessively. When the hands and feet sweat profusely, the liver is free of illness. If liver *qi* rebels, there is headache, ringing in the ears, drowsiness, slight pain in the lower abdomen, and blurred vision with floating specks.\n\nFor men over fifty, kidney *qi* declines and no longer responds to the liver, which is why the eyes dim. If care is improper, the eyes redden and itch. When the liver is assailed by yin evil, one dreams of gardens, bamboo groves, or verdant landscapes, or of being near water, seeing dragons, snakes, birds, and beasts running in alarm. This may be dispelled with the *xu* breath.\n\nAt dawn, knock the teeth nine times, draw in pure *qi* through the nose, and gently exhale *xu* thirty-six times to treat all liver vexations and heat.\n\n**Spring Taboos and Observances:**\n- **First Month:** Do not eat raw scallions, knotweed seeds, garlic, leopard cat, or leopard meat. Eating chives fortifies the viscera.\n  - **Day 1:** Observe the *Xushou* Fast.\n  - **Day 4:** Do not kill living beings.\n  - **Day 7:** The Triple Assembly Day—observe the *Yanshen* Fast.\n  - **Day 8:** Auspicious for bathing.\n- **Second Month:** Do not eat knotweed seeds, parrot eggs, or rabbit meat.\n  - **Day 8:** Observe the *Fangchun* Fast.\n  - **Day 9:** Do not eat fish.\n  - **Mao Day in the first decade:** Auspicious for bathing.\n  - **Day 15:** Observe the fast for the birthday of the Most High Lord Lao.\n- **Third Month:** Do not eat mallow or the spleens of any livestock.\n  - **Day 3:** Observe the *Dangxie* Fast; do not eat any of the five viscera or the hearts of herbs.\n  - **Day 6:** Auspicious for bathing.\n\nWhen traveling in spring, do not drink from deep springs or flowing water. Wait for the sound of thunder before changing sleeping quarters.\n\nDuring the seventy-two days of spring, reduce sour flavors and increase sweet flavors to assist the spleen spirit.\n\n**Liver Ailments:**\nWhen the liver is diseased, the eyes redden, and growths, nebulae, or films appear, obscuring vision. The *Waima Sanzi* powder is recommended:\n- *Shengma* (8 *fen*)\n- *Huangqin* (8 *fen*)\n- *Shanzhi* (7 *fen*)\n- *Huanggua* (7 *fen*)\n- *Wangmingzi* (10 *fen*)\n- *Cheqianzi* (10 *fen*)\n- *Ganjiang* (10 *fen*)\n- *Difuzi* (10 *fen*)\n- *Longdan* (5 *fen*)\n- *Chongweizi* (5 *fen*)\n\nRoast the ingredients, grind into powder, and administer.\n\nTake on an empty stomach, mixed with three *qianbi* of water, once daily.\n\n**The Yellow Emperor’s Remedy for the Five Taxations and Seven Injuries in Men:**\nWhen yang declines and withers, the scrotum develops sores; there is pain in the lower back and spine, with inability to bend or stretch; the sinews and vessels become numb and cold; sometimes there is feverish itching, sometimes swelling that makes walking difficult; wind-induced eruptions appear; distant vision blurs; coughing and counterflow qi arise; the body becomes emaciated and sallow; qi surges to cause umbilical pain; the bladder tightens and spasms; blood appears in the urine; the penis and testicles ache, or there is dribbling, staining the undergarments red or yellow; or there are nightmares and fright; dry mouth and stiff tongue—all these stem from the seven injuries, leading to taxation and exhaustion. This remedy governs such conditions, proving most efficacious and wondrous.\n\n**Modifications:**\n- For indigestion, increase *fuling* by one-third.\n- For ear afflictions, increase *changpu* by one-third.\n- For heat and thirst, increase *kulou* by one-third.\n- For bodily itching due to dampness, increase *shanzhuyu* by one-third.\n- For impotence, increase *tusizi* by one-third.\n- For lumbar pain, increase *niuxi* by one-third.\n- For blurred vision, increase *xixin* by one-third.\n- For sores, increase *xuduan* by one-third.\n- For impotence, increase *bajitian* by one-third.\n- For wind evil, increase *fangfeng* by one-third.\n- For damp itching of the genitals, increase *shanyao* by one-third.\n- For wind itching, increase *tianxiong* by one-third.\n- For shortness of breath, increase *shejiangzi* by one-third.\n- For lack of strength, increase *baiziren* by one-third.\n- For fright and restlessness, increase *yuanzhi* by one-third.\n- For bodily skin pain, increase *shihu* by one-third.\n- For unbearable intestinal pain, increase *duzhong* by one-third.\n- For impotence, increase *roucong* by one-third.\n\n**Ingredients:**\nEighteen ingredients, each in the amount of four *fen*. Roast, then grind into powder, and form into honeyed pills the size of *wutong* seeds. Begin by taking three pills, gradually increasing the dosage as tolerated. Alternatively, the powder may be mixed with porridge, taking one *fangcunbi* three times daily. Effects will be felt in seven days, recovery in ten, and full restoration of bodily qi in thirty. Long-term use preserves youthfulness.\n\n**The Heart Governs in Summer.**\n\nThe heart belongs to the south, to the element of fire, and is the spirit of the Vermilion Emperor. Its form resembles the Vermilion Bird, its image like an inverted lotus. The heart is *fine*—whatever is subtle and minute, it receives and infuses without fail, transforming water into blood. It weighs twelve taels and contains seven apertures and three hairs. Those of superior wisdom have hearts with luminous cavities—seven apertures. Those of middling wisdom have hearts where qi flows—five apertures. Those of lesser wisdom have qi that is bright yet obstructed, their hearts devoid of apertures, lacking wisdom and prone to deceit.\n\nThe heart is the child of the liver and the mother of the spleen. The tongue is its palace gate, its orifice connected to the ears. The left ear corresponds to *bing*, the right to *ding*. Its fluid is sweat; when kidney qi invades the heart, sweating becomes profuse. Its flavor is bitter—all the bitterness of human sorrow and regret arises from the heart. The small intestine is the heart’s mansion, paired with it.\n\nThe *Yellow Court Classic* states:\n*\"The heart’s palace holds a lotus in bloom,\nBeneath dwells the youthful Dan Yuan’s home.\nIt governs the harmony of cold and heat, the balance of nourishment and defense,\nAdorned in cinnabar brocade, draped in jade gauze.\"*\n\nIts sound is *zhi*, its scent scorched—when people speak of \"heart-fire,\" it is this. Such is the decree of heaven. Its nature is propriety, its emotion joy, its creature winged—all feathered beings belong to the south. Its spirit is restless and unsteady; human impatience and rashness arise from the heart.\n\nDuring the three months of summer, fire reigns, and the ten thousand things ripen. To pacify the heart’s spirit, one must embrace loyalty and fulfill filial piety, uphold righteousness and cultivate benevolence, stabilize its fire, quell its fervor, clarify the heart, harmonize the spirit, abstain from excess in sound and sensuality, and moderate rich flavors. Thus may one dwell in lofty clarity, gaze into the distance, and afterward align with the mean, attuning to the qi of heaven and earth. Rise early, do not weary of the sun, follow the true yang to dispel summer heat—otherwise, the kidney’s store will vie for dominance, and water and fire will clash.\n\nThe heart’s spirit is named *Dan Yuan*, styled *Guardian of the Numinous*. The heart’s form is crimson, its image like a lotus, its spirit like the Vermilion Bird. It pairs with the small intestine, governs the blood and vessels, and rules the tongue. When the tongue cannot discern taste, the heart is deficient. When blood surges, the heart is startled. When forgetfulness is frequent, the spirit has departed the heart. When sorrow is abundant, the heart is wounded. When speech is heavy with melancholy, the heart is disordered. When the complexion is green-black, the heart is frozen. When bitter flavors are craved, the heart is insufficient. When the countenance is ruddy, the heart is free of illness.\n\nIf the heart is afflicted, the mouth becomes dry, the tongue stiff, the throat sore, and sores appear in the mouth. The heart pairs with the small intestine, governs the blood and vessels, and also rules the tongue—thus those struck by wind often suffer from heart-related tongue stiffness. When the heart is diseased, cold arrives untimely, the ethereal and corporeal souls are unsettled, urine is often red, the lips change color, strength wanes, speech and laughter are untimely, and dreams feature furnaces, cold objects, red garments, naked figures, blood and light, wolves and dogs in pursuit, or the self in peril, encountering weapons and armor. To treat this, use the *he* exhalation.\n\nAt dawn, sit upright, click the teeth nine times, inhale pure qi through the nose once, and exhale gently with *he* thirty-six times—overwork harms the heart!\n\n**Summer Taboos and Observances:**\n- **Fourth Month:** Consume shepherd’s purse with crucian carp as a broth to stimulate the appetite and replenish. The fourth day is auspicious for bathing. On the eighth day, commence the summer retreat; do not cut any grasses or trees, and avoid eating *hui* fish and garlic.\n- **Fifth Month:** Do not eat leeks; consume barley, apricots, and dates, all of which are beneficial. Reduce salty flavors to calm the heart. The first day is auspicious for bathing. On the fifth day, observe the *Continuing Life Retreat*; do not eat raw vegetables. For three days before and after the summer solstice, sleep separately—this month, yin and yang contend, blood and qi scatter; avoid seeing blood or filth. After the summer solstice, do not eat crow, river deer, or sheep’s trotters.\n- **Sixth Month:** On the sixth day, observe the *Clearing Summer Heat Retreat*; do not eat mallow, and avoid digging earth. The ninth day is auspicious for bathing.\n- **Three Fu Days:** [Text incomplete]\n\nTake the *Kidney Decoction*. For the seventy-two days of summer, reduce bitter flavors and increase pungent flavors to assist lung qi.\n\nIf the heart is afflicted, one will dream of red furnaces and raging fires, suffer forgetfulness and frequent fright—take the *Five Ginsengs Pill*:\n- *Xuanshen* (7 fen)\n- *Danshen* (7 fen)\n- *Kushen* (7 fen)\n- *Qin jiao* (7 fen)\n- *Shashen* (5 fen)\n- *Renshen* (5 fen)\n- Dried ginger (5 fen)\n\nGrind the ingredients into powder after roasting, refine with honey into pills the size of *wutong* seeds. Take thirty pills with water decocted before meals.\n\nTo supplement kidney qi, take the *Kidney Decoction Pill*:\n- One sheep kidney (remove fat and membrane; pig kidney may substitute)\n- *Fuling*\n- *Shaoyao*\n- *Xuanshen*\n- Fresh ginger\n- *Dihuang* (each 4 *zhu*)\n- *Renshen*\n- *Gancao*\n- *Zexie*\n- *Wuweizi*\n- *Fangfeng*\n- *Cangzhu*\n- *Danggui*\n- *Huangqi* (each 3 fen)\n- *Gui* (2 *zhu*)\n- *Digupi*\n- *Cishi* (each 5 *zhu*)\n\nPound into a boiled powder. First, slice one kidney into four or five pieces, then decoct with one *ge* of rice, a piece of ginger, and one stalk of scallion in three bowls of water until two bowls of liquid remain. Remove the kidney and rice, add the medicinal powder, and decoct until one and a half cups remain. Divide into two doses. Take on an empty stomach, then eat porridge cooked with rice and kidney.\n\nThe Yellow Emperor asked: *\"What medicine should one take during the three months of summer?\"*\nThe Woman replied: *\"Take the *Poria and Kidney-Supplementing Pill*, which treats internal depletion in men, inability to eat, absentmindedness, forgetfulness, sorrow, joy, and anger without restraint, bodily swelling, dark yellow urine, painful dribbling of essence, cold pain in the bladder, thirst, abdominal distension and fullness—all symptoms of the Seven Damages. This formula is appropriate.\"*\n\n- For indigestion, double the *fuling*\n- For lumbar pain, double the *duzhong*\n- For wind afflictions, add one fen of *fuzi*\n- For damp itching, add one-third more *shanzhuyu*\n- For wandering wind in the abdomen, add one-third more *mudanpi*\n- For water qi, add one-third more *zexie*\n- For pallor, add one-third more *gui*\n- For head wind, double the *shanyao*\n- In autumn and winter, add half more *dried dihuang*\n- For blurred vision, add one-third more *xixin*\n- For yin damp itching, add one fen of *shihu*\n- For bodily weakness and jaundice, double the *roucongrong*\n- For generalized pain, double the fresh ginger (4 *liang*)\n\nOf these thirteen ingredients, roast and grind all except *gui* into powder, then refine with honey into pills the size of *wutong* seeds. Take seven pills initially, then twice daily. Abstain from sexual activity and avoid cold, raw fish, and the like.\n\nThe lung governs in autumn. The lung pertains to the Metal of the West, presided over by the White Emperor Spirit, its form resembling a white beast, its image like a suspended sounding stone. It serves as the canopy of the five viscera.\n\nThe lung is so named for its *xiao* (效), meaning its qi is constrained and pent-up. It weighs three jin and three liang, with six lobes and two ears, totaling eight lobes. The lung is the child of the spleen and the mother of the kidney.\n\nBeneath the lung reside the seven *po* souls, like infants, named Corpse Dog, Crouching Arrow, Sparrow Yin, Swallowing Thief, Non-Poison, Expelling Filth, and Foul Lung. At midnight and dawn, knock the teeth thirty-six times, intone the name of the lung spirit and the seven *po* souls to pacify the spirits of the five viscera. The nose is its palace: the left nostril is *geng*, the right *xin*. In qi, it manifests as cough; in fluid, as nasal mucus. Above, its qi ascends to the brain’s gate; below, it descends to the spleen. Thus, all qi belongs to the lung.\n\nProlonged exposure harms the lung, for the lung is the root of breath and the palace of transmission. When kidney evil invades the lung, copious nasal mucus results. The large intestine is the lung’s mansion, sharing its glory with the lung. When hair and body hair wither and fall, it signifies lung decline.\n\n*The Yellow Court Classic* states:\n*The lung’s palace resembles a flowery canopy,\nBeneath it, a youth sits in jade towers.\nThe child of the seven primals governs qi’s regulation,\nExternally corresponding to the Central Peak, the nose’s aligned position.*\n\nIts sound is *shang*, its flavor pungent, its odor rank. When heart evil enters the lung, one loathes rank odors. Its nature is righteousness, its emotion anger, its secretion spittle—lung taxation yields excess spittle.\n\nIn autumn’s three months, Metal reigns, governing execution; the myriad things wither and diminish. To pacify the *po* and preserve form, one must embrace benevolence and nurture all beings, bestowing kindness and restraining countenance. As yin and yang divide form, the myriad things are reaped and slain. Sparrows sleep, owls rise; after the autumnal equinox, executions must leave no guilt unpunished. Thus, one follows the injury of yin qi to strengthen the lung’s firmness. Following this, evil qi does not invade; opposing it, the five viscera fall into discord.\n\nThe lung spirit is named Haohua, styled Xucheng. The lung’s appearance is white, its image a suspended sounding stone, its spirit like a white beast. The lung pairs with the large intestine, its external form manifesting in the nose—lung wind causes nasal congestion. A withered complexion signifies lung dryness; nasal itching, lung worms. Excessive fear indicates the *po* has departed the lung. Black and white spots on the body signify minor lung affliction; frequent vocalizations, lung strength. Intolerance of cold signifies lung decay; a preference for pungent flavors, lung insufficiency. Large intestine constipation signifies lung congestion. A fresh, white complexion signifies a healthy lung.\n\nWhen the lung is diseased, coughing, rising qi, facial swelling, excessive sleep, facial sores, yellow-white complexion, nasal cold, brain pain, chest and back fullness and pain, limb vexation, skin itching, throat constriction, and dreams of silk and brocade, gold and jade, beautiful women, armored attire, banners, flowers, clouds, cranes, sun, moon, and nobility may occur. To dispel these, use swallowing: at dawn, knock the teeth nine times, gently inhale clear qi through the nose, and swallow lightly thirty-six times to expel the lung’s heat and all evil qi—excess also harms.\n\n**Days to avoid in autumn:** bathing, fasting, and purification rituals.\n**In the seventh month:** do not consume ginger or raw honey.\n\nOn the fifth day, bathing is auspicious. On the seventh day, being the Triple Assembly Day, perform the Autumn-Welcoming Purification Ritual. On the first day of the eighth month, perform the Evil-Dispelling Purification Ritual. On the fourth day, strictly avoid purchasing footwear or items that attach to the feet, and do not consume parrot meat. On the twenty-first day, bathing is auspicious. On the ninth day of the ninth month, do not move or disturb forest mats; perform the Longevity-Extending Purification Ritual. During the seventy-two days of autumn, reduce pungent flavors and increase sour flavors to assist the liver.\n\n**Daily Regimen:**\nHair should be frequently combed, teeth frequently knocked, saliva frequently swallowed, qi frequently clarified, feet vigorously walked, hands often placed on the face, ears frequently pressed, and eyes frequently rubbed—this is the method of cultivating the Kunlun to attain immortality.\n\n**For lung disease manifesting as skin sores, scabies, consumption, rising qi, coughing, or thickened, dry nasal mucus and saliva, take the Wind-Dispersing Powder:**\n- Ginseng (ren shen)\n- Salvia (dan shen), each one *fen*\n- Ledebouriella (fang feng)\n- Processed aconite (tian xiong, prepared)\n- Notopterygium (qiang huo)\n- Gentiana (qin jiao)\n- Cornelian cherry (shan zhu yu), each eight *fen*\n- Glehnia (sha shen), five *fen*\n- Tiger bone (hu gu, roasted), each ten *fen*\n- Dioscorea (shan yao), ten *fen*\n- Gastrodia (tian ma), twelve *fen*\n\nThe above eleven ingredients are simmered, pounded into powder, and taken by mixing five *qianbi* with liquid before meals; they may also be formed into pills. The Yellow Emperor asked: \"What about the three months of autumn?\" The woman replied: \"To tonify the kidneys, take the Poria and Aconite Pill, which governs kidney deficiency with cold, internal damage to the five viscera, and the sufferings of wind-cold deficiency. It causes the body and limbs to itch with dampness, the feet to lose their step, unawareness of oneself, loss of taste in food, blurred vision, generalized stiffness, lumbar and spinal pain, inability to eat, daily emaciation, heart palpitations, coughing with counterflow qi, inability to turn over, and the need for support when rising. Acupuncture and moxibustion offer little relief. Alternatively, one may have been exposed to wind while riding, failed to protect oneself, eaten irregularly, overexerted, or suffered from dry mouth, spontaneous drooling, nightmares with involuntary seminal emission, dripping bloody urine, damp itching of the genitals, or fright-like palpitations with unilateral tension in the lower abdomen, aching limbs, wheezing breath, floating swelling of the body and limbs, qi surging into the chest and rib-sides. When physicians fail to recognize this and treat it recklessly, this formula governs it.\"\n\n**Poria and Aconite Pill:**\n- Poria (fu ling)\n- Ledebouriella (fang feng)\n- Asarum (xi xin)\n- Dioscorea (shan yao)\n- Alisma (ze xie)\n- Aconite (fu zi)\n- Aster (zi wan)\n- Angelica pubescens (du huo)\n- Peony (shao yao)\n- Salvia (dan shen)\n- Sophora flavescens (ku shen)\n- Cinnamon bark (gui xin)\n- Dried ginger (gan jiang)\n- Achyranthes (niu xi)\n- Cornelian cherry (shan zhu yu)\n- Astragalus (huang qi), each three *liang*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds. Take seven pills before meals, twice daily.\n\n**The Kidneys Govern Winter**\nThe kidney viscera belong to the north, the water phase, and the Black Emperor spirit. Their form resembles a deer with two heads, like a round stone. The kidneys’ function is to distribute water and qi, irrigating the entire body like the roots of a tree. There are left and right kidneys, also called the Gate of Life. They are the palace of generative qi and the abode of dying qi. Guard them and they endure; use them and they deplete. They weigh one *jin* and one *liang*, positioned opposite the navel and attached to the lumbar spine. The kidneys are the mother of the liver and the child of the lungs. The ears are their palace.\n\nHeaven gives birth to me, flowing qi transforming—this is called essence. The coming and going of essence-qi is called spirit. Spirit is the kidneys’ repository of intelligence and emotion. The left kidney is *ren*, the right kidney *gui*. In qi, they correspond to *chui*; in fluids, to saliva; in form, to bone. Prolonged standing harms the bones, thus damaging the kidneys. The kidneys pair with bone and correspond to the teeth. Tooth pain indicates kidney damage. They govern the upper burner, nourish the middle burner, and defend the lower burner. When kidney evil enters, there is excessive spittle. The bladder is their palace. Their glory is the hair.\n\nThe *Yellow Court Classic* states: \"The kidney department’s palace is the dark gate, round. Within dwells a youth named Supreme Mystery. He governs the six palaces and the source of the nine fluids. Externally, he responds to the two ears and the hundred fluid channels.\" Their sound is *yu*, their flavor salty, their odor putrid. When heart evil enters the kidneys, one loathes putrid things. Their creature is the armored—all shelled beings belong to water, hence called armored.\n\nIn the three months of winter, the qi of heaven and earth closes, and the myriad things lie hidden. Moreover, on the winter solstice, yin and yang contend, and all life is stirred. The noble person fasts, retreats, covers the body, moderates desires, halts music and sex, awaiting the settling of yin and yang. Rising at dawn and retiring at dusk aligns with the sun’s light. Do not contend with the qi of yin and yang, then preserve life, harmonize with the Great Purity, and follow yin and yang. To oppose them injures the internal yin qi, causing kidney viscera to become deficient and disordered. At night, knock the teeth, and at dawn perform thirty-six knocks, calling the spirit’s name to pacify the water viscera.\n\nThe kidney spirit is named Dark Obscurity, styled Nurturing Infant. The kidneys’ appearance is black, their form like a round stone, their spirit like a white deer with two heads. The kidneys pair with bone above and govern the teeth. Tooth pain indicates kidney damage. They also govern the ears; deafness indicates kidney deficiency. Bone pain indicates kidney depletion. Frequent gum bleeding indicates kidney cold. Tooth decay indicates kidney wind. Ear pain indicates kidney congestion. Frequent yawning indicates kidney evil. Inability to straighten the waist indicates kidney freezing. A yellow complexion indicates kidney decline. When kidney evil enters, there is frequent groaning. A purple, radiant complexion indicates healthy kidneys. When the kidneys are diseased, there is pain and cold in the lumbar region, knees, and bladder, dripping urine, a black complexion, scorched teeth, heaviness of the body, panting, coughing, night sweats, tinnitus, qi obstruction, inability to eat, and dreams of entering dark places, seeing women, monks, nuns, turtles, soft-shelled turtles, galloping horses, spears, banners, oneself wearing armor and traveling together, or sailing boats or riding horses. Blowing can dispel these.\n\nAt dawn, knock the teeth nine times, draw in clear qi through the nose, and lightly blow thirty-six times to expel all kidney evils; excessive blowing also harms.\n\n**Winter Taboos and Days for Bathing and Fasting**\n- **Tenth month:** On the first day, bathing is auspicious; perform the Merit-Completion Fast. On the fifth day, perform the Three Assemblies Fast; do not administer punishments. On the eleventh day, do not bathe—this is a major taboo day for immortals.\n- **Eleventh month:** Perform the Fortune-Initiation Fast. On the sixteenth day, bathing is auspicious; do not eat mallow.\n- **Twelfth month:** Do not eat soft-shelled turtle or beef. On the winter solstice, perform the Hundred Blessings Fast. On the fifteenth day, bathing is auspicious. On the twenty-eighth day, perform the New Year-Welcoming Fast. On the last day of the month, bathe, burn incense, repent wrongdoing, and contemplate goodness.\n\nIn the twelfth month of winter, reduce salty flavors and increase bitter flavors to assist the heart viscera. When the kidneys are diseased, there is frequent urination, lumbar and hip pain, and dreams of intercourse with ghosts. Take the **Eight-Ingredient Pill**:\n\n- Poria (fu ling)\n- Alisma (ze xie)\n- Moutan (mu dan pi), each three *fen*\n- Cinnamon bark (gui xin)\n- Aconite (fu zi), each two *fen*\n- Fresh rehmannia (sheng di huang), eight *fen*\n- Cornelian cherry (shan zhu yu)\n- Dioscorea (shan yao), each four *fen*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds.\n\nTake thirty pills with wine on an empty stomach; avoid raw radishes.\n\nThe Yellow Emperor asked: \"What is suitable for the three months of winter?\"\nThe Woman replied: \"The **Life-Guarding Poria Pill** governs the five taxations and seven injuries in men, dim and blurred vision with wind-induced tearing, head wind and stiff nape preventing turning, distention and fullness in the heart and abdomen extending upward to the chest and ribs and downward to the waist and back, piercing pain throughout the exterior and interior, panting with inability to eat or drink, coughing with counterflow, withered yellow complexion and eyes, dripping urination, impotence and failure to rise when needed, lack of vigor in the moment, swollen feet and abdominal pain, vexing heat in the five centers, floating swelling of the body and back, night sweats, cramping or slackening of the four limbs, startling dreams and waking in terror, shortness of breath, dry mouth and tongue, symptoms resembling wasting-thirst, sudden joy or anger, sorrow and weeping—this formula governs them.\n\n- Poria (fu ling)\n- Dioscorea (shan yao)\n- Cinnamon bark (rou gui)\n- Fresh cornelian cherry (sheng shan zhu yu)\n- Morinda (ba ji)\n- Dried ginger (gan jiang)\n- White atractylodes (bai zhu)\n- Achyranthes (niu xi)\n- Cuscuta (tu si zi), each one *liang*\n- Asarum (xi xin)\n- Ledebouriella (fang feng)\n- Alisma (ze xie)\n- Biota seed (bai zi ren)\n- Moutan (mu dan pi), each half a *liang*\n- Aconite (fu zi), one and a half *liang*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds. Take seven pills before meals, twice daily.\n\n**The Spleen Viscera Reigns in the Four Seasons**\nThe spleen viscera belongs to the central earth, reigning in the four seasons. It is the spirit of the Yellow Emperor, shaped like a phoenix, the *qi* of *kun*, the essence of earth, resembling an overturned basin.\n\nThe spleen (*pi*) means \"to assist\" (*pi*), aiding the stomach *qi*. Located three *cun* below the heart, it weighs one *jin* and three *liang*, three *cun* wide and five *cun* long. The spleen is the child of the heart and the mother of the lungs. Externally, it connects to the space between the eyebrows, governing planning and discernment—all intentions and judgments arise from the spleen. The mouth is its palace. Its spirit is prone to jealousy, which originates in the spleen. The spleen has no fixed form, as it governs earthly *yin*. Jealousy likewise has no standard; women are often jealous because they receive *yin qi*.\n\nEating soft, well-cooked food is the wondrous Dao for the whole body. The spleen, like a mill, transforms food; undigested food means the spleen is not turning. Hard foods are difficult to digest. If one goes out immediately after eating, the spleen tilts, and tilting prevents digestion, leading to the harm of retained food. For those who labor physically, this may be tolerable, but for those over fifty or those who live in leisure, it becomes a self-inflicted affliction.\n\nWhen the spleen *qi* is harmonious, the mouth knows the five flavors; when the spleen *qi* is diseased, the lips turn black, the mouth becomes dry, one loses the desire to eat, and the five flavors are unrecognizable. The *Huangting Jing* states: \"The spleen, one *chi* long, covers the Great Granary; the Central Palace is governed by the Venerable Lord.\"\n\nIts sound is *gong*, its nature is trust, its flavor is sweet, and its odor is fragrant. If heart evil enters the spleen, one cannot detect fragrance. Its creature is the naked one, governing swallowing. The spleen arises in the central palace, resides in the left cheek, and governs the lips and mouth. The mouth corresponds to *wu*, the tongue to *ji*, uniting with flesh and flourishing in the lips.\n\nIf the viscera are not regulated, the spleen is harmed; if the spleen is not regulated, the substance is harmed. When both substance and spirit are damaged, it injures a person with wind-stroke, causing drooling and stiff tongue—this is the spleen *qi* receiving evil. On the eighteenth day from the end of each season, reduce thoughts and set aside worries, humble oneself to aid others, avoid contending for profit, refrain from hidden malice, do not compete with things, and do not rely on self-strength. Be tranquil, harmonious, clear, and empty, following the virtue of the spirit, and thus preserve life. Going against this causes the spleen and kidneys to receive evil, as earth and wood overcome each other.\n\n**The Spirit of the Spleen**\nThe spirit of the spleen is named Changzai, styled Huntíng. The spleen’s form is yellow, resembling an overturned basin, and its spirit is like a phoenix. The spleen and stomach together form a *fu*, residing in the left rib, lodging in two palaces and six *qi* ribs, reigning in the four seasons, transforming the raw into the cooked.\n\nUndigested food means the spleen is not turning. Overeating indicates spleen vacuity. Disregarding food means the spleen contains undigested food. Inability to eat means the spleen is blocked. A lack of complexion indicates spleen vacuity. Craving sweet foods indicates spleen insufficiency. Excessive confusion indicates the spleen’s discernment is unsettled. Those with wind or lung disease who eat excessively have spleen vacuity. Lustrous, white, and smooth flesh indicates the spleen is free of disease.\n\nThe spleen’s sound governs *gong*, the chief of the five notes, corresponding to the *huangzhong* pitch. When the spleen hears music, it grinds. The spleen is the root of original *qi*. *Gong* resides in the Great Alabaster, its color is yellow, and it is heavy. Earth reigns in the sixth month and is also lodged in the four seasons. Symptoms include bodily heaviness, weakness, loss of appetite, a creeping sensation like wandering wind over the body, self-oppression in the heart, and a withered yellow complexion. Dreams of moving earth, being in wild graves, or seeing Daoists within city walls, accompanied by children, can be dispelled by calling out.\n\nAt dawn, click the teeth six times, gently inhale clear *qi* through the nose, and exhale thirty times to dispel the spleen’s stagnation—excessive exhalation also harms.\n\n**The Six Qi Method**\nFor upper heat, *he* the heart fire; for dim eyes, *xu* cures itself. For lung cold, *yan* is effective; for ear disease, *chui* the heart. For the spleen and stomach, constantly *hu* and *xi*; for triple burner stagnation, *xi*. In the mountains without medicine, this is the good physician.\n\n*Xu*, *he*, *yan*, *chui*, *hu*, and *xi*—these six sounds dispel all diseases of the five viscera. Though many medical texts are erroneous, after examining cultivation and nourishment classics and thoroughly investigating their principles, these six sounds are now established. If the viscera and bowels have disease, simply calm the mind, stabilize the intention, visualize the *qi*, and gently exhale *xu* or *he*—evil *qi* will naturally dissipate. The statement that thirty repetitions are the limit, with excess causing harm, is a general guideline without fixed standard. When the tongue and throat feel clear and cool, the disease has passed.\n\nWhen the spleen is diseased, *qi* surges upward to the heart, and the four limbs become vacuous and swollen. The **Chebule Pill** is suitable:\n\n- Chebule peel (he li le pi), seven *fen*\n- Dioscorea (shan yao)\n- Moutan (mu dan pi)\n- Alisma (ze xie)\n- Cornelian cherry (shan zhu yu)\n- Poria (fu ling)\n- Long pepper (bi ba)\n- Peony (shao yao), each eight *fen*\n- Dried ginger (gan jiang), five *fen*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds.\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds. Take thirty pills on an empty stomach with jujube decoction.\n\n**Gallbladder Viscus**\nThe gallbladder is the essence of Metal and the *qi* of Water; its color is green. Its spirit-form resembles the tortoise and serpent, and its shape is like a suspended gourd, attached beneath the short lobe of the liver. The gallbladder (*dan*) is so named for *daring* (*gan*), signifying that one’s *qi* is bold and resolute. It weighs three *liang* and three *zhu*, serving as the liver’s *fu*-viscus. Though the gallbladder is not counted among the five viscera, it is classified among the six *fu*-bowels. Yet since the gallbladder below also receives the *qi* of Water and shares the same path as the Kan Palace, it cannot be treated as one of the six *fu*-bowels—thus it is separately established as the gallbladder viscus.\n\nA person’s courage and decisiveness arise from the gallbladder viscus. It is paired with the bladder and governs the hair. *The Yellow Court Classic* states: *\"It commands all strength and seizes the tiger’s troops; externally, it corresponds to the pupils of the eyes and the bridge of the nose. Brain and hair support each other, both radiant—this is how the gallbladder section resembles the five viscera.\"*\n\nMoreover, the gallbladder resides in the Kan Palace, enabling one to admire goodness, discern evil, sever deceit, and halt flattery, desiring to walk the straight Dao. The gallbladder governs Metal, and Metal governs killing—hence it abounds with the *qi* of courage and slaughter. When all things are killed, sorrow arises. Since sorrowful *qi* is Metal born of Water, this is why the eyes shed tears.\n\nThe heart governs Fire, and the gallbladder belongs to Water. Fire is extinguished by Water, and Water is boiled by Fire—when Yin and Yang contend at the gate, Water prevails over Fire, and the eyes produce *xiang*-tears, which issue from the gallbladder. The gallbladder’s Water governs the pupils of the eyes, receiving the essence of Wood; the two combine in men.\n\nWhen the eyes dim at fifty, it is because kidney-*qi* has declined and gallbladder essence has waned—one may supplement the kidneys. The gallbladder is the liver’s senior; to pacify its spirit, one must cease anger and strife, practice benevolence, and uphold righteousness—only then can life be preserved whole.\n\n**Gallbladder Spirit**\nName: *Longyao* (Dragon Radiance)\nStyle: *Weiming* (Majestic Brightness)\n\nThe gallbladder’s form is green in color, its shape like a suspended gourd, and its spirit resembles the tortoise and serpent. It is paired with the bladder and governs the hair above. When the hair withers, it is due to gallbladder depletion.\n\n**Gallbladder Disorders**\nWhen the gallbladder is diseased, one sighs deeply, the mouth becomes dry, and the heart feels unsettled, as if pursued by others—this is *qing* (prostration). When the gallbladder is replete, it is harmed by Heat; Heat causes the spirit to lose its anchor, and one rises and wanders without stability. When the gallbladder is vacuous, it is harmed by Cold; Cold induces fear, dizziness, and an inability to venture out alone.\n\nWhen the fingernails are dry, the gallbladder is deficient. When one feels no fear, the gallbladder is vast and replete. When tears flow without cause, the gallbladder is vacuous. When one craves bitter foods, the gallbladder is insufficient. When the hair is parched, it is gallbladder Wind. When the hair withers, it is gallbladder Heat. When the complexion is green and lustrous, the gallbladder is free of disease. When one dreams of fighting with others or coupling with ghosts, the gallbladder is debilitated.\n\nTo treat gallbladder disorders, use the *xi* exhalation to expel them. At dawn, click the teeth nine times, draw in pure *qi* through the nose, and gently exhale *xi* thirty times to dispel gallbladder disease—excess will cause harm.\n\nThe Three Corpses are named Peng Ju, Peng Zhi, and Peng Jiao. Each night, call their names seven times in succession. Suddenly, one will feel a void chill, and sleep will not come easily. The Corpses will then dissolve in form and wander, no longer able to dwell within the human body.\n\nMoreover, one’s body may thereby mirror the state, and the spirit of the heart will naturally reign as sovereign. As the *Classic* says: “If the lord and king can guard it, the myriad things will transform of themselves.” How then could the Three Corpses do aught against me? Thus, with the body at peace, family and state may be preserved; with the heart settled, life and nature may be preserved whole.\n\nIf one indulges in wine and lust, craves rank and meat, the Corpses will undergo a thousand changes and ten thousand transformations, following desire to return. All manner of infirmities will arise of themselves, and one will grow distant from the Dao and its sentiments.\n\n---\n\n**Postscript**\n\nMan observes the qi of yin and yang to form the four great elements of the body. The body is to the self as a state is to the realm: the chest and face correspond to the palace halls, the four limbs to the suburbs and outskirts. The spirit is like the ruler, the blood like the ministers, and the qi like the common folk. If the ruler can transform and reach the common folk, the realm will be at peace; if the body can harmonize blood and qi, the four limbs will flow freely.\n\nThus, the sage tends to the body before illness arises, cherishing an indestructible lifespan. He follows his nature, expanding and contracting, advancing and retreating as the times demand. Serene and refining the spirit, he acts with reverent caution—this is the foundation.\n\nAs the *Classic* says: “If man does not fear majesty, great majesty will come.” If one lacks awe in nurturing life, the heart will grow disordered and difficult to govern, the form restless and unsettled, the spirit scattered and qi dimmed, the will adrift and the mind wayward.\n\nLaozi said: “He who is skilled in nurturing life walks on land without meeting rhinoceros or tiger, enters battle without donning armor or wielding weapons”—this illustrates reverent caution. He also said: “The five tones deafen the ears; the five flavors dull the mouth.” Thus, one should abide in serenity.\n\nThe methods of nurturing life are manifold: burning incense and opening scriptures, pacing the void and treading the Dipper, donning tall caps and short robes, consuming cypress and pine, refining mercury and firing elixirs, crafting herbal pills and powders. Though the paths are myriad and cannot all be exhausted, they converge as one, and a hundred thoughts unite in purpose. If one’s devotion is sincere and long-standing, and one’s reverence deepens over the years, will the True Lord not take notice and act in secret?\n\nAs the *Book* says: “Heaven observes with clarity, blessing the good and calamitizing the licentious.” Thus, heaven and earth endure forever, and sages and worthies never perish.\n\nLife is the great virtue of heaven and earth; death is their bitter poison. Therefore, brush away the dust from your robes, cast off the bitter poison, still the five viscera, circulate the Three Origins, and open the wondrous scripture of the Yellow Court. Peruse the secret formulas of the Purple Chamber, and thereafter one may preserve or abandon, conceal or reveal, transcend the bounds of transformation, and enter the land of the Great Desert. Without thought, one may see clearly; without wings, one may soar. Play in the halls of radiant clouds, discourse in the chambers of azure mists—longevity may then be hoped for.\n\nAs the *Classic* says: “Laozi cultivated himself for one thousand two hundred years, yet his form never declined.” It also says: “When the spirit guards the form, one may attain long life.” The Way of long life is not transmitted to the unworthy. Those who lightly divulge it incur calamity, while those who faithfully heed the celestial offices have their names recorded in the registers of immortals. Blessings and misfortunes extend to the nine ancestors; rise and fall rest with the individual—how could the foolish and common be made to see and hear all?\n\nSince the time of Fuxi and the Yellow Emperor, the methods of long life of Guangcheng, Red Pine, Lingwei, and Anqi have been clearly known—why then do men remain deluded and fail to return? Some merge with the primordial and natural, their bodies uniting with transformation, their wisdom encompassing the myriad things, their Dao second only to the Three Clarities—these are the august and mysterious perfected ones. Others accumulate merit over countless kalpas, their virtue spreading like dust and sand, their spiritual transformations boundless, soaring and roaming freely—such were Du Chong and Yin Gui. Dwelling in mountains to nurture qi, free of desire and action, guarding the Dao and preserving essence, their hearts as clear as the azure vault—such were Xu You and Chao Fu. Some are recorded in distant bamboo and silk, while others are heard of nearby. The foolish are like the blind and deaf; the wise attain both honor and nobility.\n\nThough Tao Hongjing’s books filled his belly, what did he gain in the end? Though he fasted until his belly was empty, what did he attain? Though his marvelous deeds surpassed his age, what use were they? Though he understood the celestial patterns, what did he truly know?\n\nLaozi said: “Gold and jade fill the hall—who can guard them? Wealth and nobility breed arrogance, inviting one’s own downfall.” Why not instead refine the finest essence of the numinous terrace and enter the great gate of emptiness and nonbeing? Though heaven and earth crumble, I remain whole; though the myriad forms turn to dust, I endure.\n\nAccumulated goodness brings surplus blessings, preserving the great harmony; accumulated evil destroys the self—what regret can there be? Thus, the Dao does not fail man; it is man who fails the Dao. Can the teachings left by sages and worthies be taken lightly?\n\nMoreover, dwelling in this fleeting world, burdened by a thousand cares and vain adornments, one need not abandon grain or retreat to the mountains, abruptly forsaking the dusty world. Simply nurture life in accord with the seasons, gradually curbing arrogance and extravagance. Do not crave or indulge in the five flavors or the five tones. Know the serenity of the natural, and you will attain the wondrous Way of long life.\n\nHeaven governs yang and movement; earth governs yin and stillness. Though heaven moves, the Northern Asterism does not shift; though earth is still, the eastern currents never cease. Thus, stillness is the heart of heaven, and movement is the qi of earth. When the heart is still and qi moves, the Dao is without fail accomplished, and illness has no means to arise.\n\nThose who study the Dao should broadly practice hidden virtue: with a compassionate heart, save others; value the Dao and disdain wealth; do not begrudge gold and jade; relieve the poor and destitute—this is called the field of blessings. Silently nurture qi, serenely harmonize the spirit, act with goodness and humility, do not deceive or cheat, think little and speak little, desire little and worry little. Do not believe in omens or heresies, do not kill living beings, do not engage in hidden malice, do not crave the five pungent foods, do not share clothing or towels with others, do not contend over right and wrong, do not face north when relieving yourself, do not gaze long at the Three Luminaries. On *liu-jia* days, do not eat scaled creatures; on the last and first days of the lunar month, reflect on cultivating good deeds; on *jia-zi* and *geng-shen* days, sit in quietude in a separate chamber.\n\nDo not sleep in an empty hall with high, open spaces, for not only are wind and mist difficult to guard against, but it also causes the hun and po souls to become disoriented. Do not lie supine when sleeping, nor use a pillow that is too high; do not keep a lamp burning where you sleep. When walking at night, one must beat the \"Heavenly Drum.\" On the eight solar term days, do not issue stern commands, and on the Autumn Equinox, one must especially purify the heart. The divine beings praise thus:\n\n*If you wish to ascend to heaven, be cautious on the Autumn Equinox,\nLet no matter, great or small, go unheard.\nSeeking immortality through sin is truly difficult,\nKnowing this, the heart of the Dao learner grows cold.*\n\nIf sleep is restless and the heart is startled and fearful, this means the seven *po* souls are about to scatter and the five spirits are contending, with illness and misfortune soon to strike. One must be vigilant in protection: sit upright morning and evening, click the teeth thirty-six times, and recite the incantation:\n\n*Supreme Emperor of the Nine Heavens, Eight Spirits of the Four Gates,\nSeven Chambers and Three Mysteries, Three Pure Ones and Nine Essences,\nGreat Unity and Peach Prosperity, ascend to the Three Clarities,\nPetition the Imperial Lord, summon the Yellow Tranquility to command,\nSwiftly call back the seven po souls, verify them in the divine court.\nIf there is any inauspiciousness, the seven corpse ghosts and soldiers,\nSimply invoke the Twin Perfected Ones, refine the form with flowing candles.\nGreat Spirits of the Grand Tenuity, slay and expel evil essences.\nWhen the three spirits are harmonious and gentle, the blood corpse will sink and vanish,\nThe spirits will return to their abodes, all obstacles will turn to good fortune,\nGranting me immortality as a divine transcendent, preserving my lifespan through the kalpas.*\n\n**Cautions of the Divine Farmer:**\nDo not consume millet and mallow together, as it causes *zheng* and *pi* illnesses.\n\n**Cautions of the Divine Farmer (continued):**\n\nDo not consume soybeans with pork, as it causes *yong*-qi illness. Green beans with grasshoppers or carp produce emaciation. Dried meat exposed to summer sun breeds worm-borne diseases. Wheat flour with dog meat causes malignant sores and triggers wind afflictions. Excessive red adzuki beans make one gaunt. Sweet porridge with cocklebur produces *zheng*-qi. Any wine or broth that casts no shadow when held aloft is lethal. Overnight mallow sprouts, when eaten, induce five types of *liu*-*pi* illnesses. Mallow with carp or grasshoppers harms the body. Mustard with rabbit meat causes malignant diseases. Lettuce with yogurt breeds tapeworms. Raw scallions with honey endanger life. Scallions with parrot eggs, pheasant, or white dog meat induce madness and *zheng*-*pi*. Chives with beef produce emaciation. Wild lettuce with honey causes hemorrhoids. Excessive magnolia flowers induce phlegm and drowsiness. Most raw fruits, when eaten in quantity, trigger chronic ailments. Plums with honey and water generate phlegm. Entering water after eating peaches causes *lin* illness. Any fruit stored for days, when consumed, revives old maladies. Fruits that sink in water must not be eaten, as they cause external *pi* illnesses.\n\nIn matters of nurturing life, avoid consuming creatures corresponding to your parents’ or your own birth signs, lest your lifespan be shortened. Do not eat meat from animals that died of themselves, as it harms vitality. Meat with cow’s milk breeds intestinal worms. Donkey or horse meat with pork causes cholera. Any organ or flesh resembling water-washed, dust-repellent tissue is highly toxic and must not be eaten. Horse meat with cocklebur or millet harms the body. Mutton with raw leeks or yogurt is injurious. Do not consume food where drifting bees have alighted, as it is poisonous. Meat carved with mulberry branches breeds malignant worm diseases. Sheep’s liver with raw pepper ruptures the heart and liver. Pig’s liver with leeks causes deep abscesses. Rabbit meat with ginger induces cholera. Pork or beef with yogurt produces *qi*-*pi*. Parrot meat with turtle harms the body.\n\nOn *ren* and *zi* days, avoid killing any black creatures. On *bing-wu* days, do not eat parrot or similar meats, lest you suffer fire-related calamities. On *geng-shen* and *jia-zi* days, observe abstinence, offering only heartfelt sacrifices to ghosts and gods—no other food. Any meat that remains unreddened when cooked or roasted is harmful. After recovering from acute illness, avoid all meat; until fully restored, refrain from cooked chives and the like.\n\n**Self-Massage Method:**\nPress the left hand with the right, the right with the left, upward and downward, forward and backward. Glaring fiercely, clench the teeth, rub the hands until warm, then massage the heels. Pull the ears, twist the waist, shake both shoulders, and reverse the hands’ motion. Next, tug the feet, stretch upward and downward, repeating the sequence seventy to eighty times. Proceed gently, visualizing the Great Harmonious *qi* descending from the void into the crown like clouds entering mountains—penetrating skin, flesh, abdomen, and limbs, moistening the five viscera. When the belly rumbles, focus the mind inward, dismissing external distractions. The primordial *qi* will then reach the *qi*-sea, soon flowing to the *yongquan* points. Perform one to three cycles daily to strengthen vitality, sharpen hearing and sight, dispel all illnesses, and prolong life without limit. After ten million cycles, transcendence is near.\n\n**The Four Qi Nurturing Life Diagram concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "四气摄生图 经名：四气摄生图。 又名《四季摄生图》。 不着撰人。 一卷。 底本出处：《正统道藏》洞神部灵图类。 四气摄生图序 夫理国者以养人为本，修身者以治病为先，覆载之问唯人为贵。 是以《洪范》五福其一日寿，皇天犹以为景福之最。 人因元气，假以成形，受气阴阳，皆禀天地。 江河淮济，五岳九州，草木星辰，触象比类，皆神明所居，各有所主，存之即有，废之即无，存之即生，废之即死。 《黄庭》云：口为天关精神机，足为地关生命扉，手为人关把盛衰。 天地含灵，皆在人之掌握，身贵若此，命岂轻哉？ 又《气诀》云：我命在我，不在於天。 昧用者夭，善用者延。 又云：精极乃明，神极乃灵，气极乃清，元极乃冥。 因气而衰，因气而荣，因气而灭，因气而生。 未有有气而无形者，未有．有形而无气者，形气相须，全在修养。 《老子》云：玄牝之门，天地之根。 绵绵若存，用之不勤。 人之口鼻，皆神明出入之户牖也。 神所依者形，形所依者气，气所依者血。 血气相随，如鱼在水。 水浊鱼疲，气拥则病生。 是知气欲得清，血欲得运，运息流转，寝食顺时，五藏恬和，疾从何起？ 若一藏乖摄，三焦受邪，元气不荣，众疾俱作。 仲尼云：寝食不时，嗜欲不节，劳逸过度，病共杀之。 且春风束来，草木甲拆，而积凛之粟不萌； 秋天雨霜，草木零落，而覆盖之草木不伤。 草木性犹如此，何尸人之五藏六府，岂不由修养耶？ 世人罔能修行，相次姐谢，以姐谢为命尽，以病疝为筋衰，谓天地之合然，不信长生之可保。 天养人以五气，地养人以五味。 饮五气者归天，食五味者归地。 所谓百病横生多因饮食，饮食之患过於声色。 声色可以绝之逾年，饮食不可废之一日，为益不少，为患亦多，如水浮舟亦能覆舟。 四时摄生盖由节臧。 《保生镕》云：酸味损於筋，辛多伤正气，甘物不益肉，苦多伤其志，酝多促人寿，不得偏唬嗜。 思虑损人性，喜怒伤於神，性损即害生，神伤则侵命，养性以全气，保神以安心，若役虑劳神，竭心殉物，体疲於外，精丧於中，众邪竞生，安得延驻？ 神随气，气依味。 味顺即元气清，元气清则神爽，神爽则无疾。 是以体欲常劳，食欲常少。 劳勿过极，少勿太虚。 凡春分后夏至前，少食糖酪之物，生绘相妨。 夏至后秋分前，少食饼跃之物，与瓜相妨，当时不必病生，却后终作诸暴，斯乃从本者也。 重衣厚褥，体不堪虚，以致风寒之疾； 美丽艳姬，以致虚损之形； 品味醉饱，厌饮强餐，以致疝结之疾。 养性之道，勿久行、久坐、久听、久视，不强食，不强饮。 忧思愁衰，饥餐渴饮，日夕所营不住为妙。 故日：流水不腐，户枢不蠹，以其动而不息也。 闲欲导引，即不必鸾飞凤举，猴掷虎蹲，但展四肢，动摇九窍，令其血脉流转，上下宣通。 《真气铭》曰：凡欲去疾，导引为先。 经脉不拥，关节不烦。 或如射雕，侧身弯环； 或曲腰脊，如蟾半圆。 交指脑后，左旋右旋； 径展手足，气出指端。 摆掣四肢，捉扩三关。 热摩赤泽，气海亦然。 是以摄养有方，则寿同龟鹤； 若恣情放逸，则命比蚌蟒。 因幼慕道门，栖心澹薄，究《黄庭》之妙旨，穷五千之玄言。 今则采攘方书，搜罗秘诀，四季避忌，一年修行，录之座隅。",
      "translated_text": "**The Four Qi Life-Nurturing Chart**\n\n**Scripture Title:** *The Four Qi Life-Nurturing Chart* (also known as *The Four Seasons Life-Nurturing Chart*). Author unknown. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Lingtu* Category.\n\n**Preface to the Four Qi Life-Nurturing Chart**\n\nThose who govern a state take nourishing the people as their foundation; those who cultivate the self take treating illness as their priority. Between heaven and earth, none is more noble than humankind. Thus, among the *Hongfan*’s Five Blessings, the first is longevity—even august Heaven deems it the greatest of all fortunes.\n\nHumans rely on primordial *qi* to assume form, receiving *yin* and *yang* *qi* from heaven and earth alike. The Yangtze, Yellow, Huai, and Ji Rivers; the Five Peaks and Nine Provinces; grasses, trees, and celestial bodies—all things, when compared and categorized, are abodes of the numinous, each governed by its own principle. Preserve them, and they exist; abandon them, and they vanish. Preserve them, and life endures; abandon them, and death follows.\n\nThe *Huangting* states: “The mouth is the heavenly gate of the spirit’s mechanism; the feet are the earthly gate of life’s portal; the hands are the human gate, grasping prosperity and decline.” Heaven and earth contain the numinous, yet all rests within human grasp. If the body is so precious, how can life be taken lightly?\n\nThe *Qi Jue* further declares: “My life is in my hands, not in Heaven’s.” Those who misuse it perish; those who master it endure. It also says: “When essence is refined, clarity arises; when spirit is refined, numinosity arises; when *qi* is refined, purity arises; when the primordial is refined, mystery arises.” Through *qi*, one declines; through *qi*, one flourishes; through *qi*, one perishes; through *qi*, one is born. There has never been form without *qi*, nor *qi* without form. Form and *qi* depend on each other, and their completeness lies in cultivation.\n\n*Laozi* says: “The gate of the Mysterious Female is the root of heaven and earth. Subtly, it seems to exist; its use is inexhaustible.” The human mouth and nose are the doors and windows through which the numinous enters and exits. The spirit relies on form, form relies on *qi*, and *qi* relies on blood. Blood and *qi* follow each other like fish in water. When water is turbid, fish grow weary; when *qi* is obstructed, illness arises. Thus, *qi* must be kept clear, blood must circulate, and with unceasing flow, rest and diet aligned with the seasons, the five viscera remain harmonious—how then could illness arise?\n\nIf even one viscus loses its harmony, the Triple Burner is assailed by evil, primordial *qi* fails to nourish, and a host of ailments arise together. Confucius said: “Irregular rest and diet, immoderate desires, and excessive labor or leisure—these, along with illness, will destroy you.”\n\nMoreover, when spring winds arrive, grasses and trees burst forth in bud, yet the grain stored in bitter cold does not sprout. When autumn’s frost and rain descend, grasses and trees wither, yet those sheltered by cover remain unharmed. If even the nature of grasses and trees is thus, how much more so the five viscera and six bowels of the human body—do they not depend on cultivation?\n\nYet the world’s people, unable to practice cultivation, perish one after another, mistaking death for the end of life, attributing illness and debility to the decline of sinews, and believing the union of heaven and earth to be inevitable, never trusting that longevity can be preserved.\n\nHeaven nourishes humans with the Five *Qi*; earth nourishes humans with the Five Flavors. Those who drink the Five *Qi* return to heaven; those who consume the Five Flavors return to earth. Most illnesses arise from improper diet, and the harm of diet surpasses even that of sensual indulgence. Sensual pleasures can be abstained from for years, but diet cannot be abandoned for a single day. Though it offers great benefit, it also brings great harm—like water that both floats and capsizes a boat.\n\nNurturing life through the four seasons depends on moderation. The *Baosheng Rong* states: “Sour flavors harm the sinews; excessive acridity injures the upright *qi*; sweet things do not benefit the flesh; excessive bitterness harms the will; excessive alcohol shortens life—one must not indulge in partiality or craving. Overthinking harms the nature; joy and anger injure the spirit. When the nature is harmed, life is endangered; when the spirit is injured, life is encroached upon. Nurture the nature to preserve *qi*; guard the spirit to calm the mind. If one exhausts the mind in pursuit of things, wearies the body externally, and drains the essence internally, a multitude of evils will arise—how then can longevity be attained?”\n\nThe spirit follows *qi*, and *qi* depends on flavor. When flavors are harmonious, primordial *qi* is clear; when primordial *qi* is clear, the spirit is bright; when the spirit is bright, there is no illness. Thus, the body should be kept in constant, moderate motion, and food should be kept in moderation. Do not overtax labor, nor let hunger become extreme.\n\nFrom the Spring Equinox to the Summer Solstice, consume fewer dairy and sweet foods, as they conflict with raw and cooked dishes. From the Summer Solstice to the Autumn Equinox, eat fewer baked and fried foods, as they conflict with melons. Though illness may not arise immediately, it will eventually manifest as various acute conditions—this is the principle of returning to the root.\n\nExcessive clothing and thick bedding weaken the body, leading to wind-cold illnesses. Beautiful, alluring concubines lead to depletion and emaciation. Overindulgence in rich flavors, forced eating when sated, and excessive drinking lead to hernial and obstructive illnesses.\n\nThe Way of nurturing life: avoid prolonged walking, sitting, listening, or gazing; do not force eating or drinking. Worry, sorrow, hunger, and thirst—let daily pursuits be ceaselessly moderate. Thus it is said: “Flowing water does not stagnate; a door hinge does not rot—because they are in constant motion.”\n\nTo guide and pull *qi*, one need not perform phoenix flights or monkey leaps, tiger crouches or ape bounds. Simply stretch the four limbs, move the nine orifices, and let blood and *qi* circulate, ascending and descending in free flow. The *Zhenqi Ming* states: “To eliminate illness, guiding and pulling come first. When meridians are unobstructed, joints are at ease.” Sometimes, like drawing a bow to shoot a hawk, bend the body sideways in a curve; sometimes, arch the spine like a half-moon toad. Interlace fingers behind the head, rotating left and right; stretch the limbs fully, letting *qi* flow from the fingertips. Swing the four limbs, grasp and expand the Three Passes. Rub until warm and red, and do the same for the *Qihai*. Thus, with proper nurturing, one’s years may equal those of the tortoise and crane; with reckless indulgence, one’s life may be as brief as the clam or mayfly.\n\nFrom youth, I admired the Daoist gate and dwelled in simplicity, exploring the profound subtleties of the *Huangting* and plumbing the mysteries of the *Five Thousand Characters*. Now, I have gathered medical texts, collected secret methods, and recorded the taboos and practices of the four seasons for a year’s cultivation, placing them by my seat.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1229,
      "start_sentence": 0,
      "end_sentence": 62,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.1208221912384,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "日可观览，号为《四季摄生图》云尔。 四季摄生图 肝脏春王 肝属东方木，为青帝神，形如青龙，象如悬瓠。 肝者，干也，状如枝干，故谓之肝。 重四斤四两，在心下，有七叶，左三叶，右四叶。 肝为心母，为肾子。 肝下有三魂，名爽灵、胎光、幽精。 夜外及平日一叩齿三十六通，呼肝神及三魂神也。 目为之宫，左月为甲，象日，属阳； 右目为乙，象月。 属阴。 肝放液为汨，肾邪入肝则多相。 胆为之腑。 胆合於肝，在肝短叶下。 《黄庭经》云：肝气郁勃清且长，罗列六腑生三光。 心精意专内不倾，上合三焦下玉浆。 其声角，其性仁，其味酸，其臭膻。 心邪入肝，则恶膻物。 其虫鳞，凡有鳞之类皆属束方也。 肝神好行仁惠，伤闵盖发於肝也。 肝神喜悦病不生，肝闻悲伤则有，出於肝也。 春之三月，木王，天地气生，万物荣茂，欲安其神者，当泽被群刍，恩沾庶类，无竭川泽，无洒陂池，以安萌芽，以止伤杀，则合乎太清，以顺天地化生之气，夜卧早起，而合乎道。 若逆之则毛骨不荣，金气相克，众疾生矣。 有疾而难治，为春夏之患耳。",
      "translated_text": "Here follows the *Four Seasons Nurturing Life Chart*.\n\n**Four Seasons Nurturing Life Chart**\n\n**Spring: The Liver Reigns**\nThe liver belongs to the Wood of the East, governed by the Azure Emperor Spirit, its form like the Green Dragon, its likeness like a hanging gourd. The liver is called *gan* (trunk), for its shape resembles branches and stems—hence the name. It weighs four *jin* and four *liang*, situated below the heart, with seven lobes: three on the left, four on the right. The liver is the mother of the heart and the child of the kidneys.\n\nBeneath the liver dwell the Three Hun—Souls: *Shuangling* (Luminous Clarity), *Taiguang* (Womb Light), and *Youjing* (Hidden Essence). At nightfall and in ordinary times, knock the teeth thirty-six times to summon the liver spirit and the spirits of the Three Hun. The eyes are its palace: the left eye is *jia*, symbolizing the sun and belonging to *yang*; the right eye is *yi*, symbolizing the moon and belonging to *yin*. When the liver releases fluid, it becomes tears; if kidney *qi* invades the liver, one weeps excessively. The gallbladder is its paired *fu*-organ, attached to the liver beneath its short lobe.\n\nThe *Huangting Jing* states:\n*The liver’s qi surges, clear and long,\nArraying the six fu to birth the Three Lights.\nHeart’s essence and intent focus inward, unwavering,\nAbove uniting with the Triple Burner, below with Jade Nectar.*\n\nIts sound is *jiao*, its nature benevolence, its flavor sour, its odor rank. If heart *qi* invades the liver, one loathes rank odors. Its creature is the scaled; all scaled beings belong to the East. The liver spirit delights in benevolence and compassion—grief and lamentation arise from the liver. When the liver spirit is joyful, illness does not arise; when it hears sorrow, tears flow—tears issue from the liver.\n\nIn the three months of spring, Wood flourishes: Heaven and Earth’s *qi* quickens, and the myriad things flourish. To pacify its spirit, one should bestow kindness upon all creatures, let mercy extend to all beings, neither drain rivers nor marshes nor empty ponds, so as to nurture sprouts and cease harm and killing. Thus one harmonizes with the Great Clarity, aligning with Heaven and Earth’s generative *qi*. Sleep early and rise early, thereby attaining the Dao. If one opposes this, the hair and bones will not flourish; Metal *qi* will overcome Wood, and manifold illnesses will arise. Such afflictions are difficult to cure, becoming the scourge of spring and summer.",
      "overlap_context": "proper nurturing, one’s years may equal those of the tortoise and crane; with reckless indulgence, one’s life may be as brief as the clam or mayfly.\n\nFrom youth, I admired the Daoist gate and dwelled in simplicity, exploring the profound subtleties of the *Huangting* and plumbing the mysteries of the *Five Thousand Characters*. Now, I have gathered medical texts, collected secret methods, and recorded the taboos and practices of the four seasons for a year’s cultivation, placing them by my seat.",
      "start_char": 1229,
      "end_char": 1656,
      "start_sentence": 63,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.079905033111572,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "肝神名龙字含明 肝之状，其色青，其象如悬匏，其神如龙。 肝合於腠上，主於目，肝盛目赤。 又主於筋，筋急者，肝亏也。 皮枯者，肝热也。 肌骨斑点者，肝风也。 面色青者，肝盛也。 好食酸味者，肝不足也。 毛发枯者，肝伤也。 肺邪入肝则多笑。 手足多汗，肝无疾也。 肝气逆则头痛，耳呜，惛惛多睡，小腹微痛，视物不明，飞蝇上下。 凡丈夫五十已上，肾气衰减，不应於肝，所以眼暗。 将摄若乖，则眼赤目痒。 肝被阴邪侵则梦见林园竹木，或见着青，或在水边，见龙蛇禽兽奔走趁惊怕，可用嘘以去之。 平旦叩齿九通，以鼻引清气，轻嘘三十六遍，以治肝之一切烦热。 春忌及沐浴修斋日 正月，勿食生葱、寥子、蒜、狸、豹等肉。 食韭补益脏腑。 一日修续寿斋。 四日，勿杀生。 七日，是三会日，修延神斋。 八日，沐浴吉。 二月，勿食寥子、鹦子、兔肉。 八日，修芳春斋。 九日，勿食鱼。 上旬卯日，沐浴吉。 十五日，修太上老君生日斋。 三月，勿食葵及诸畜脾。 三日，修荡邪斋，勿食一切五藏及百草心。 六日，沐浴吉。 凡春行道路，勿饮深泉流水，候雷声而别寝。 春七十二日，省酸味增甘味，以助脾神。 肝有病，即目赤，眼中生弩肉、晕膜，视物不明，宜服外麻散子： 升麻黄苓各八分山栀黄瓜各七分央明子车前子乾姜地肤子各十分龙胆充蔚子各五分 右熬，捣为散。",
      "translated_text": "The liver spirit is named *Longyan*, styled *Hanning*. The liver’s form is green in color, its shape resembling a suspended gourd, and its spirit like a dragon.\n\nThe liver connects to the interstices above and governs the eyes—when the liver is in excess, the eyes turn red. It also governs the sinews: when the sinews are tense, the liver is deficient. When the skin is withered, the liver is hot. When the flesh and bones bear speckles, it is liver wind. When the complexion is green, the liver is in excess. When one craves sour flavors, the liver is insufficient. When the hair is withered, the liver is injured. If lung evil invades the liver, one laughs excessively. When the hands and feet sweat profusely, the liver is free of illness. If liver *qi* rebels, there is headache, ringing in the ears, drowsiness, slight pain in the lower abdomen, and blurred vision with floating specks.\n\nFor men over fifty, kidney *qi* declines and no longer responds to the liver, which is why the eyes dim. If care is improper, the eyes redden and itch. When the liver is assailed by yin evil, one dreams of gardens, bamboo groves, or verdant landscapes, or of being near water, seeing dragons, snakes, birds, and beasts running in alarm. This may be dispelled with the *xu* breath.\n\nAt dawn, knock the teeth nine times, draw in pure *qi* through the nose, and gently exhale *xu* thirty-six times to treat all liver vexations and heat.\n\n**Spring Taboos and Observances:**\n- **First Month:** Do not eat raw scallions, knotweed seeds, garlic, leopard cat, or leopard meat. Eating chives fortifies the viscera.\n  - **Day 1:** Observe the *Xushou* Fast.\n  - **Day 4:** Do not kill living beings.\n  - **Day 7:** The Triple Assembly Day—observe the *Yanshen* Fast.\n  - **Day 8:** Auspicious for bathing.\n- **Second Month:** Do not eat knotweed seeds, parrot eggs, or rabbit meat.\n  - **Day 8:** Observe the *Fangchun* Fast.\n  - **Day 9:** Do not eat fish.\n  - **Mao Day in the first decade:** Auspicious for bathing.\n  - **Day 15:** Observe the fast for the birthday of the Most High Lord Lao.\n- **Third Month:** Do not eat mallow or the spleens of any livestock.\n  - **Day 3:** Observe the *Dangxie* Fast; do not eat any of the five viscera or the hearts of herbs.\n  - **Day 6:** Auspicious for bathing.\n\nWhen traveling in spring, do not drink from deep springs or flowing water. Wait for the sound of thunder before changing sleeping quarters.\n\nDuring the seventy-two days of spring, reduce sour flavors and increase sweet flavors to assist the spleen spirit.\n\n**Liver Ailments:**\nWhen the liver is diseased, the eyes redden, and growths, nebulae, or films appear, obscuring vision. The *Waima Sanzi* powder is recommended:\n- *Shengma* (8 *fen*)\n- *Huangqin* (8 *fen*)\n- *Shanzhi* (7 *fen*)\n- *Huanggua* (7 *fen*)\n- *Wangmingzi* (10 *fen*)\n- *Cheqianzi* (10 *fen*)\n- *Ganjiang* (10 *fen*)\n- *Difuzi* (10 *fen*)\n- *Longdan* (5 *fen*)\n- *Chongweizi* (5 *fen*)\n\nRoast the ingredients, grind into powder, and administer.",
      "overlap_context": "eatures, let mercy extend to all beings, neither drain rivers nor marshes nor empty ponds, so as to nurture sprouts and cease harm and killing. Thus one harmonizes with the Great Clarity, aligning with Heaven and Earth’s generative *qi*. Sleep early and rise early, thereby attaining the Dao. If one opposes this, the hair and bones will not flourish; Metal *qi* will overcome Wood, and manifold illnesses will arise. Such afflictions are difficult to cure, becoming the scourge of spring and summer.",
      "start_char": 1657,
      "end_char": 2197,
      "start_sentence": 88,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.794495105743408,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "空心饮，调三钱匕日服。 黄帝治男子五劳七伤。 阴衰消缩，囊下生疮，腰背疼痛，不得悦仰，筋脉痹玲，或时热痒，或时浮肿，难以行步，因风相出，远视茫茫，咳逆上气，身体痿黄，气冲脐痛，膀胱急挛，小便出血，茎痛核痛、或复淋沥、污衣赤黄，或梦俱惊，口乾舌强，皆犯七伤，洎成劳伤，此药主之，极验神妙。 狭苓若食不消三分加一分莒蒲若患耳三分加一分苦篓若热渴加一分山茱萸若身痒湿加一分兔丝子若阴萎加一分牛膝若腰痛加一分细辛若目视茫茫加一分续断若有疮加一分巴戟天若阴萎加一分防风若风邪加一分山药若阴湿痒加一分天雄若风痒加一分蛇将子若少气加一分柏子仁气力不足加一分远志惊恐不安加一分石斛身皮痛加一分杜仲若肠绝痛加一分徒蓉若阴痿加一分 右件，一十八味，各四分，熬捣为末，炼蜜丸如梧桐子大。 先服食三丸，少加为度。 亦可作散粥，和方寸匕，日三服，七日知效，十日愈，三十日体气平复。 长服令人不老而少。 心脏夏王",
      "translated_text": "Take on an empty stomach, mixed with three *qianbi* of water, once daily.\n\n**The Yellow Emperor’s Remedy for the Five Taxations and Seven Injuries in Men:**\nWhen yang declines and withers, the scrotum develops sores; there is pain in the lower back and spine, with inability to bend or stretch; the sinews and vessels become numb and cold; sometimes there is feverish itching, sometimes swelling that makes walking difficult; wind-induced eruptions appear; distant vision blurs; coughing and counterflow qi arise; the body becomes emaciated and sallow; qi surges to cause umbilical pain; the bladder tightens and spasms; blood appears in the urine; the penis and testicles ache, or there is dribbling, staining the undergarments red or yellow; or there are nightmares and fright; dry mouth and stiff tongue—all these stem from the seven injuries, leading to taxation and exhaustion. This remedy governs such conditions, proving most efficacious and wondrous.\n\n**Modifications:**\n- For indigestion, increase *fuling* by one-third.\n- For ear afflictions, increase *changpu* by one-third.\n- For heat and thirst, increase *kulou* by one-third.\n- For bodily itching due to dampness, increase *shanzhuyu* by one-third.\n- For impotence, increase *tusizi* by one-third.\n- For lumbar pain, increase *niuxi* by one-third.\n- For blurred vision, increase *xixin* by one-third.\n- For sores, increase *xuduan* by one-third.\n- For impotence, increase *bajitian* by one-third.\n- For wind evil, increase *fangfeng* by one-third.\n- For damp itching of the genitals, increase *shanyao* by one-third.\n- For wind itching, increase *tianxiong* by one-third.\n- For shortness of breath, increase *shejiangzi* by one-third.\n- For lack of strength, increase *baiziren* by one-third.\n- For fright and restlessness, increase *yuanzhi* by one-third.\n- For bodily skin pain, increase *shihu* by one-third.\n- For unbearable intestinal pain, increase *duzhong* by one-third.\n- For impotence, increase *roucong* by one-third.\n\n**Ingredients:**\nEighteen ingredients, each in the amount of four *fen*. Roast, then grind into powder, and form into honeyed pills the size of *wutong* seeds. Begin by taking three pills, gradually increasing the dosage as tolerated. Alternatively, the powder may be mixed with porridge, taking one *fangcunbi* three times daily. Effects will be felt in seven days, recovery in ten, and full restoration of bodily qi in thirty. Long-term use preserves youthfulness.\n\n**The Heart Governs in Summer.**",
      "overlap_context": " sweet flavors to assist the spleen spirit.\n\n**Liver Ailments:**\nWhen the liver is diseased, the eyes redden, and growths, nebulae, or films appear, obscuring vision. The *Waima Sanzi* powder is recommended:\n- *Shengma* (8 *fen*)\n- *Huangqin* (8 *fen*)\n- *Shanzhi* (7 *fen*)\n- *Huanggua* (7 *fen*)\n- *Wangmingzi* (10 *fen*)\n- *Cheqianzi* (10 *fen*)\n- *Ganjiang* (10 *fen*)\n- *Difuzi* (10 *fen*)\n- *Longdan* (5 *fen*)\n- *Chongweizi* (5 *fen*)\n\nRoast the ingredients, grind into powder, and administer.",
      "start_char": 2197,
      "end_char": 2594,
      "start_sentence": 124,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.678811073303223,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "心属南方火，为赤帝神，形如朱雀，象如倒悬芙蓉。 心者，纤也，所纳纤微无不贯注，变水为血。 重十二两，中有七孔、三毛。 上智之人心穴通明，心有七孔。 中智之人心穴通气，五孔。 下智之人气明，俱不通，心乃无孔，无智慧而多狡诈。 心为肝子，为脾母。 舌为之官阙，窍通耳。 左耳为丙，右耳为丁。 於液为汗，肾邪入心则多汗。 其味苦，人之伤恨自知苦皆发於心也。 小肠为心之府，与心合。 《黄庭经》云：心部之宫莲含花，下有童子丹元家。 主适寒热荣卫和，丹锦诽裳披玉罗。 其声征，其臭焦，人有不畅之事，多云心焦。 盖天使然也。 其性礼，其情乐，其虫羽，凡有羽之类皆属南方也。 其神躁而无准，人之暴急乃发於心也。 夏之三月火王，万物化实，欲安其神者则含忠履孝，辅义安仁，定其火，息其炽，澄其心，和其神，止声色，薄滋味，可以居高明，可以远眺望，后合乎中和，以顺天地之气，早外起，无厌於日，顺於正阳，以消暑气，之则肾藏争分，水火相克　　也。 心神名丹元字守灵 心之状其色赤，其象如莲华，其神如朱雀。 心合小肠，主其血脉，主於舌。 舌不知味，心亏也。 血拥者，心惊也。 多忘者，神离心也。 多悲者，心伤也。 忧重语者，心乱也。 面色青黑者，心冰也。 好食苦者，心不足也。 容色赤者，心无疾也。 心有病则口乾舌强，喉中痛，口中生疮。 心合於小肠，主血脉，亦主於舌，故人之中风者，多心舌涩，主於心也。 心有疾，则寒不时，魂神不安，小便多赤，层口色变，气力不足，言笑不时，梦见炉火冷之物，赤衣及裸形人见血光，及狼犬相逐，忽身居危险，见兵甲之类，用呵以治之。 平旦端坐，叩齿九通，以鼻引清气一，轻呵三十六遍，治心之劳多则损！ 夏忌及沐浴修斋日 四月，食专菜和鲫鱼作羹，开胃口，补益。 四日沐浴，吉。 八日，修启夏斋，勿伐一切草木，勿食辉鱼及蒜。 五月，勿食韭，宜食大麦、杏、蕾，皆益，臧咸味，以安心。 一日，沐浴吉。 五日，修续命斋，勿食生菜。 夏至前后三日，各别寝，是月阴阳争，血气散，勿见血污之物。 夏至后勿食乌、獐肉及羊脚。 六月六日，修清暑斋，勿食葵，忌起土。 九日，沐浴吉。 三伏日；",
      "translated_text": "The heart belongs to the south, to the element of fire, and is the spirit of the Vermilion Emperor. Its form resembles the Vermilion Bird, its image like an inverted lotus. The heart is *fine*—whatever is subtle and minute, it receives and infuses without fail, transforming water into blood. It weighs twelve taels and contains seven apertures and three hairs. Those of superior wisdom have hearts with luminous cavities—seven apertures. Those of middling wisdom have hearts where qi flows—five apertures. Those of lesser wisdom have qi that is bright yet obstructed, their hearts devoid of apertures, lacking wisdom and prone to deceit.\n\nThe heart is the child of the liver and the mother of the spleen. The tongue is its palace gate, its orifice connected to the ears. The left ear corresponds to *bing*, the right to *ding*. Its fluid is sweat; when kidney qi invades the heart, sweating becomes profuse. Its flavor is bitter—all the bitterness of human sorrow and regret arises from the heart. The small intestine is the heart’s mansion, paired with it.\n\nThe *Yellow Court Classic* states:\n*\"The heart’s palace holds a lotus in bloom,\nBeneath dwells the youthful Dan Yuan’s home.\nIt governs the harmony of cold and heat, the balance of nourishment and defense,\nAdorned in cinnabar brocade, draped in jade gauze.\"*\n\nIts sound is *zhi*, its scent scorched—when people speak of \"heart-fire,\" it is this. Such is the decree of heaven. Its nature is propriety, its emotion joy, its creature winged—all feathered beings belong to the south. Its spirit is restless and unsteady; human impatience and rashness arise from the heart.\n\nDuring the three months of summer, fire reigns, and the ten thousand things ripen. To pacify the heart’s spirit, one must embrace loyalty and fulfill filial piety, uphold righteousness and cultivate benevolence, stabilize its fire, quell its fervor, clarify the heart, harmonize the spirit, abstain from excess in sound and sensuality, and moderate rich flavors. Thus may one dwell in lofty clarity, gaze into the distance, and afterward align with the mean, attuning to the qi of heaven and earth. Rise early, do not weary of the sun, follow the true yang to dispel summer heat—otherwise, the kidney’s store will vie for dominance, and water and fire will clash.\n\nThe heart’s spirit is named *Dan Yuan*, styled *Guardian of the Numinous*. The heart’s form is crimson, its image like a lotus, its spirit like the Vermilion Bird. It pairs with the small intestine, governs the blood and vessels, and rules the tongue. When the tongue cannot discern taste, the heart is deficient. When blood surges, the heart is startled. When forgetfulness is frequent, the spirit has departed the heart. When sorrow is abundant, the heart is wounded. When speech is heavy with melancholy, the heart is disordered. When the complexion is green-black, the heart is frozen. When bitter flavors are craved, the heart is insufficient. When the countenance is ruddy, the heart is free of illness.\n\nIf the heart is afflicted, the mouth becomes dry, the tongue stiff, the throat sore, and sores appear in the mouth. The heart pairs with the small intestine, governs the blood and vessels, and also rules the tongue—thus those struck by wind often suffer from heart-related tongue stiffness. When the heart is diseased, cold arrives untimely, the ethereal and corporeal souls are unsettled, urine is often red, the lips change color, strength wanes, speech and laughter are untimely, and dreams feature furnaces, cold objects, red garments, naked figures, blood and light, wolves and dogs in pursuit, or the self in peril, encountering weapons and armor. To treat this, use the *he* exhalation.\n\nAt dawn, sit upright, click the teeth nine times, inhale pure qi through the nose once, and exhale gently with *he* thirty-six times—overwork harms the heart!\n\n**Summer Taboos and Observances:**\n- **Fourth Month:** Consume shepherd’s purse with crucian carp as a broth to stimulate the appetite and replenish. The fourth day is auspicious for bathing. On the eighth day, commence the summer retreat; do not cut any grasses or trees, and avoid eating *hui* fish and garlic.\n- **Fifth Month:** Do not eat leeks; consume barley, apricots, and dates, all of which are beneficial. Reduce salty flavors to calm the heart. The first day is auspicious for bathing. On the fifth day, observe the *Continuing Life Retreat*; do not eat raw vegetables. For three days before and after the summer solstice, sleep separately—this month, yin and yang contend, blood and qi scatter; avoid seeing blood or filth. After the summer solstice, do not eat crow, river deer, or sheep’s trotters.\n- **Sixth Month:** On the sixth day, observe the *Clearing Summer Heat Retreat*; do not eat mallow, and avoid digging earth. The ninth day is auspicious for bathing.\n- **Three Fu Days:** [Text incomplete]",
      "overlap_context": "**Ingredients:**\nEighteen ingredients, each in the amount of four *fen*. Roast, then grind into powder, and form into honeyed pills the size of *wutong* seeds. Begin by taking three pills, gradually increasing the dosage as tolerated. Alternatively, the powder may be mixed with porridge, taking one *fangcunbi* three times daily. Effects will be felt in seven days, recovery in ten, and full restoration of bodily qi in thirty. Long-term use preserves youthfulness.\n\n**The Heart Governs in Summer.**",
      "start_char": 2594,
      "end_char": 3448,
      "start_sentence": 133,
      "end_sentence": 178,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.354082107543945,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "服肾沥汤。 夏七十二日，省苦味，增辛味，以助肺气。 心有病，即梦见丹炉炎火之类，健忘多惊，宜服五参丸方： 玄参 丹参苦参 秦荒各七分 沙参 人参乾姜各五分 右熬，捣为散，炼蜜为丸，如梧桐子大。 食上煎水下三十丸。 补肾气肾沥汤丸： 羊肾一个，去脂膜，猜肾亦得 狭苓 芍药 玄参 生姜 地黄各四铢 人参 甘草 泽泻 五味子 防风 苍芍 当归 黄耆各三分 桂二铢地骨皮磁石各五铢 右捣作煮散； 先用肾一个，作四五片，以米一合，姜一块，惫伯一茎，以水三碗煎取汁两碗，去肾、米，下药，煎取一盏半，分作两服。 空心服后，以米、肾煮粥食之。 黄帝曰：夏三月，服何药？ 女曰：以补肾袂苓丸，能治男子内虚工，不能饮食，忽忽健忘，悲忧不乐，喜怒无限，身肢浮肿，小便赤黄，精淋沥痛绞，膀胱玲疼，口渴饮水，心腹胀满，皆犯七伤，宜饵此方。 狭苓食不消加一倍 杜仲腰痛加一倍 附子有风加一分 山茱萸湿痒三分加一分 牡丹皮腹中游风三分加一泽泻水气三分加一分栓！ 颜色不足三分加一分山药头风加一倍乾地黄秋冬加半细辛目视茫茫三分加一分石斛阴湿痒一分加一分徒蓉体痿黄加一倍生姜四两身体疼加一倍右一十三味，除桂外余并一一熬捣为末，炼蜜丸如梧桐子大。 先服食七丸，日再服。 禁房事及玲堵鱼等。",
      "translated_text": "Take the *Kidney Decoction*. For the seventy-two days of summer, reduce bitter flavors and increase pungent flavors to assist lung qi.\n\nIf the heart is afflicted, one will dream of red furnaces and raging fires, suffer forgetfulness and frequent fright—take the *Five Ginsengs Pill*:\n- *Xuanshen* (7 fen)\n- *Danshen* (7 fen)\n- *Kushen* (7 fen)\n- *Qin jiao* (7 fen)\n- *Shashen* (5 fen)\n- *Renshen* (5 fen)\n- Dried ginger (5 fen)\n\nGrind the ingredients into powder after roasting, refine with honey into pills the size of *wutong* seeds. Take thirty pills with water decocted before meals.\n\nTo supplement kidney qi, take the *Kidney Decoction Pill*:\n- One sheep kidney (remove fat and membrane; pig kidney may substitute)\n- *Fuling*\n- *Shaoyao*\n- *Xuanshen*\n- Fresh ginger\n- *Dihuang* (each 4 *zhu*)\n- *Renshen*\n- *Gancao*\n- *Zexie*\n- *Wuweizi*\n- *Fangfeng*\n- *Cangzhu*\n- *Danggui*\n- *Huangqi* (each 3 fen)\n- *Gui* (2 *zhu*)\n- *Digupi*\n- *Cishi* (each 5 *zhu*)\n\nPound into a boiled powder. First, slice one kidney into four or five pieces, then decoct with one *ge* of rice, a piece of ginger, and one stalk of scallion in three bowls of water until two bowls of liquid remain. Remove the kidney and rice, add the medicinal powder, and decoct until one and a half cups remain. Divide into two doses. Take on an empty stomach, then eat porridge cooked with rice and kidney.\n\nThe Yellow Emperor asked: *\"What medicine should one take during the three months of summer?\"*\nThe Woman replied: *\"Take the *Poria and Kidney-Supplementing Pill*, which treats internal depletion in men, inability to eat, absentmindedness, forgetfulness, sorrow, joy, and anger without restraint, bodily swelling, dark yellow urine, painful dribbling of essence, cold pain in the bladder, thirst, abdominal distension and fullness—all symptoms of the Seven Damages. This formula is appropriate.\"*\n\n- For indigestion, double the *fuling*\n- For lumbar pain, double the *duzhong*\n- For wind afflictions, add one fen of *fuzi*\n- For damp itching, add one-third more *shanzhuyu*\n- For wandering wind in the abdomen, add one-third more *mudanpi*\n- For water qi, add one-third more *zexie*\n- For pallor, add one-third more *gui*\n- For head wind, double the *shanyao*\n- In autumn and winter, add half more *dried dihuang*\n- For blurred vision, add one-third more *xixin*\n- For yin damp itching, add one fen of *shihu*\n- For bodily weakness and jaundice, double the *roucongrong*\n- For generalized pain, double the fresh ginger (4 *liang*)\n\nOf these thirteen ingredients, roast and grind all except *gui* into powder, then refine with honey into pills the size of *wutong* seeds. Take seven pills initially, then twice daily. Abstain from sexual activity and avoid cold, raw fish, and the like.",
      "overlap_context": "serve the *Continuing Life Retreat*; do not eat raw vegetables. For three days before and after the summer solstice, sleep separately—this month, yin and yang contend, blood and qi scatter; avoid seeing blood or filth. After the summer solstice, do not eat crow, river deer, or sheep’s trotters.\n- **Sixth Month:** On the sixth day, observe the *Clearing Summer Heat Retreat*; do not eat mallow, and avoid digging earth. The ninth day is auspicious for bathing.\n- **Three Fu Days:** [Text incomplete]",
      "start_char": 3448,
      "end_char": 3980,
      "start_sentence": 179,
      "end_sentence": 195,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.70057725906372,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "肺脏秋王 肺属西方金，为白帝神，形如白兽，象如悬磬，为五藏之华盖。 肺者，效也，言其气效郁。 重三斤三两，六叶两耳，共八叶。 肺为脾子，为肾母。 肺下有七魄，如婴儿，名尸狗、伏矢、雀阴、吞贼、非毒、除秽、臭肺。 夜外时及平旦叩齿三十六通，呼肺神名及七魄名，以安五藏神，鼻为之宫，左孔为庚，右孔为辛，在气为咳，在液为涕，上通气至脑户，下通气至脾中，是以诸气属肺。 久外伤肺，肺为呼吸之根源，为传送之宫阙，肾邪入肺则多涕。 大肠为肺之府，与肺合其荣。 毛发也枯落者，肺衰也。 《黄庭经》云：肺部之宫似华盖，下有童子坐玉阙。 七元之子主调气，外应中岳鼻齐位。 其声商，其味辛，其臭腥。 心邪入肺，则恶腥物。 其性义，其情怒，其津唾，肺劳则多唾。 秋之三月，金王，主杀，万物枯损。 欲安其魄而存其形者，当含仁育物。 施恩敛容，阴阳分形，万物收杀，雀卧鹦起，待秋分定后，斩杀必当无留有罪，乃顺阴气所伤而长肺之刚，顺之则邪气不侵，逆之则五脏乖矣。 肺神名皓华字虚成 肺之状其色白，其象悬磬，其神如白兽。 肺合大肠，外形於鼻，肺有风则鼻塞。 面色枯者，肺乾也。 鼻痒者，肺有虫也。 多怖者，魄离肺也。 身上生黑白点者，肺微也。 多声气者，肺强也。 不耐寒者，肺败也。 好食辛者，肺不足也。 大肠秘者，肺壅也。 颜色鲜白者，肺无病也。 肺有疾，即多嗽，上气，面浮肿，多睡，面生疮，面生黄白，鼻寒脑疼，胸背满痛，四肢烦闷，皮上痒，喉中噎，梦见缯帛金玉美女，自身甲衣，见幡花云鹤，日月贵人，可用咽以去之，平旦叩齿九通，微以鼻引清气，轻咽三十六遍，以去肺之热，并一切邪气，过多亦损。 秋忌及沐浴修斋日 七月，勿食姜、生蜜。",
      "translated_text": "The lung governs in autumn. The lung pertains to the Metal of the West, presided over by the White Emperor Spirit, its form resembling a white beast, its image like a suspended sounding stone. It serves as the canopy of the five viscera.\n\nThe lung is so named for its *xiao* (效), meaning its qi is constrained and pent-up. It weighs three jin and three liang, with six lobes and two ears, totaling eight lobes. The lung is the child of the spleen and the mother of the kidney.\n\nBeneath the lung reside the seven *po* souls, like infants, named Corpse Dog, Crouching Arrow, Sparrow Yin, Swallowing Thief, Non-Poison, Expelling Filth, and Foul Lung. At midnight and dawn, knock the teeth thirty-six times, intone the name of the lung spirit and the seven *po* souls to pacify the spirits of the five viscera. The nose is its palace: the left nostril is *geng*, the right *xin*. In qi, it manifests as cough; in fluid, as nasal mucus. Above, its qi ascends to the brain’s gate; below, it descends to the spleen. Thus, all qi belongs to the lung.\n\nProlonged exposure harms the lung, for the lung is the root of breath and the palace of transmission. When kidney evil invades the lung, copious nasal mucus results. The large intestine is the lung’s mansion, sharing its glory with the lung. When hair and body hair wither and fall, it signifies lung decline.\n\n*The Yellow Court Classic* states:\n*The lung’s palace resembles a flowery canopy,\nBeneath it, a youth sits in jade towers.\nThe child of the seven primals governs qi’s regulation,\nExternally corresponding to the Central Peak, the nose’s aligned position.*\n\nIts sound is *shang*, its flavor pungent, its odor rank. When heart evil enters the lung, one loathes rank odors. Its nature is righteousness, its emotion anger, its secretion spittle—lung taxation yields excess spittle.\n\nIn autumn’s three months, Metal reigns, governing execution; the myriad things wither and diminish. To pacify the *po* and preserve form, one must embrace benevolence and nurture all beings, bestowing kindness and restraining countenance. As yin and yang divide form, the myriad things are reaped and slain. Sparrows sleep, owls rise; after the autumnal equinox, executions must leave no guilt unpunished. Thus, one follows the injury of yin qi to strengthen the lung’s firmness. Following this, evil qi does not invade; opposing it, the five viscera fall into discord.\n\nThe lung spirit is named Haohua, styled Xucheng. The lung’s appearance is white, its image a suspended sounding stone, its spirit like a white beast. The lung pairs with the large intestine, its external form manifesting in the nose—lung wind causes nasal congestion. A withered complexion signifies lung dryness; nasal itching, lung worms. Excessive fear indicates the *po* has departed the lung. Black and white spots on the body signify minor lung affliction; frequent vocalizations, lung strength. Intolerance of cold signifies lung decay; a preference for pungent flavors, lung insufficiency. Large intestine constipation signifies lung congestion. A fresh, white complexion signifies a healthy lung.\n\nWhen the lung is diseased, coughing, rising qi, facial swelling, excessive sleep, facial sores, yellow-white complexion, nasal cold, brain pain, chest and back fullness and pain, limb vexation, skin itching, throat constriction, and dreams of silk and brocade, gold and jade, beautiful women, armored attire, banners, flowers, clouds, cranes, sun, moon, and nobility may occur. To dispel these, use swallowing: at dawn, knock the teeth nine times, gently inhale clear qi through the nose, and swallow lightly thirty-six times to expel the lung’s heat and all evil qi—excess also harms.\n\n**Days to avoid in autumn:** bathing, fasting, and purification rituals.\n**In the seventh month:** do not consume ginger or raw honey.",
      "overlap_context": "dd half more *dried dihuang*\n- For blurred vision, add one-third more *xixin*\n- For yin damp itching, add one fen of *shihu*\n- For bodily weakness and jaundice, double the *roucongrong*\n- For generalized pain, double the fresh ginger (4 *liang*)\n\nOf these thirteen ingredients, roast and grind all except *gui* into powder, then refine with honey into pills the size of *wutong* seeds. Take seven pills initially, then twice daily. Abstain from sexual activity and avoid cold, raw fish, and the like.",
      "start_char": 3981,
      "end_char": 4669,
      "start_sentence": 196,
      "end_sentence": 228,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.081634044647217,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "五日，沐浴吉。 七日，是三会日，修迎秋斋。 八月一日，修逐邪斋。 四日，切忌市鞋履附足之物，勿食鹦肉。 二十一日，沐浴吉。 九月九日，勿起动林席，修延算斋。 秋七十二日，省食辛味，增酸味，以助肝脏。 起居法 发欲多梳，齿欲多叩，津欲常咽，气欲常清，脚欲强行，手欲在面，耳欲常按，眼欲数摩，所谓子欲不死修昆仑之法也。 肺有病即皮肤生疮、及疥痨、上气、咳嗽、涕唾稠枯，宜服排风散子： 人参丹参各分防风天雄炮羌活秦荒山茱萸各八分沙参五分 虎骨炙各十分山药十分天麻十二分",
      "translated_text": "On the fifth day, bathing is auspicious. On the seventh day, being the Triple Assembly Day, perform the Autumn-Welcoming Purification Ritual. On the first day of the eighth month, perform the Evil-Dispelling Purification Ritual. On the fourth day, strictly avoid purchasing footwear or items that attach to the feet, and do not consume parrot meat. On the twenty-first day, bathing is auspicious. On the ninth day of the ninth month, do not move or disturb forest mats; perform the Longevity-Extending Purification Ritual. During the seventy-two days of autumn, reduce pungent flavors and increase sour flavors to assist the liver.\n\n**Daily Regimen:**\nHair should be frequently combed, teeth frequently knocked, saliva frequently swallowed, qi frequently clarified, feet vigorously walked, hands often placed on the face, ears frequently pressed, and eyes frequently rubbed—this is the method of cultivating the Kunlun to attain immortality.\n\n**For lung disease manifesting as skin sores, scabies, consumption, rising qi, coughing, or thickened, dry nasal mucus and saliva, take the Wind-Dispersing Powder:**\n- Ginseng (ren shen)\n- Salvia (dan shen), each one *fen*\n- Ledebouriella (fang feng)\n- Processed aconite (tian xiong, prepared)\n- Notopterygium (qiang huo)\n- Gentiana (qin jiao)\n- Cornelian cherry (shan zhu yu), each eight *fen*\n- Glehnia (sha shen), five *fen*\n- Tiger bone (hu gu, roasted), each ten *fen*\n- Dioscorea (shan yao), ten *fen*\n- Gastrodia (tian ma), twelve *fen*",
      "overlap_context": "iction, and dreams of silk and brocade, gold and jade, beautiful women, armored attire, banners, flowers, clouds, cranes, sun, moon, and nobility may occur. To dispel these, use swallowing: at dawn, knock the teeth nine times, gently inhale clear qi through the nose, and swallow lightly thirty-six times to expel the lung’s heat and all evil qi—excess also harms.\n\n**Days to avoid in autumn:** bathing, fasting, and purification rituals.\n**In the seventh month:** do not consume ginger or raw honey.",
      "start_char": 4669,
      "end_char": 4905,
      "start_sentence": 229,
      "end_sentence": 240,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.38086748123169,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "右一十一味，熬捣为散。 食上饮汁调五钱匕，服丸亦得。 黄帝曰：秋三月如何？ 女曰：以补肾狭苓丸，主肾虚玲，五脏内伤，风寒虚玲所苦，令人身肢湿痒，足行失度，不自省觉，饮食失味，目视茫茫，遍身拘急，腰脊疼痛，不能饮食，日日赢瘦，心喟咳逆上气，转侧不得，起则须人扶策，针灸治疗小折，或乘马触风，不自将护，饮食不节，用力过度，或口乾燃，流涎自出，或复恶梦精便自出，尿血滴沥，阴下湿痒，或如惊悸，小腹偏急，四肢酸疼，气息嘘吸，身肢浮肿，冲人胸胁，遇医不识，妄欲治之，此方主之。 狭苓防风白木细辛山药泽泻附子紫苑独活芍药丹参苦参桂心乾姜牛膝山茱萸黄耆各三两 右熬捣为散，炼蜜丸如梧桐子大。 先食七丸，日再服。 肾脏冬王 肾藏属北方水，为黑帝神，形如鹿，两头，象圆石。 肾之分也，主分水气，灌注一身，如树之有根，有左右肾，亦谓之命门，生气之府，死气之庐，守之则存，用之则竭。 重一斤一两，对脐附腰脊。 肾为肝母，为肺子。 耳为之宫。 天之生我，流气而变，谓之精。 精气往来，谓之神。 神者，肾之藏其情智。 左肾为壬，右肾为癸。 在气为吹，在液为唾，在形为骨，久立伤骨。 乃损肾也。 肾合乎骨，应在齿，齿痛者，肾伤也。 经於上焦，荣於中焦，卫於下焦。 肾邪自入则多唾，膀胱为之府。 其荣，发也。 《黄庭经》云：肾部之官玄阙圆，中有童子名上玄。 主诸六府九液源，外应两耳百液津。 其声羽，其味酗，其臭腐。 心邪入肾则恶腐物。 其虫介，凡有甲之类皆属於水，故日介也。 冬之三月，乾坤气闭，万物伏藏。 且冬至之日阴阳争，诸生荡，君子斋戒，处必掩身，节嗜欲，止声色，以待阴阳之所定，昏卧寅起以顺日光，无竞阴阳气，然后全其生，合乎太清，顺乎阴阳，逆之则阴气内伤，肾藏虚乱也。 夜卧叩齿及平旦三十六通，呼神名以安水藏也。 肾神名玄冥字育婴 肾之状其色黑，其象如圆石，其神如白鹿，两头。 肾合於骨上，主於齿。 齿痛者，肾伤也。 又主於耳，耳聋者肾虚也。 骨痛者，肾亏也。 齿多龃者，肾寒也。 齿齲者，肾风也。 耳痛，肾壅也。 多欠者，肾邪也。 腰不伸者，肾冰也。 面色黄者，肾衰也。 肾邪自入则多呻吟，容色紫光者，肾无病也。 肾有病，腰膝连膀胱痛玲，小便余沥，面色黑而齿焦，体重，喘咳盗汗，耳呜隔气，食不下，梦见入暗处，见妇人、僧尼、龟鳖、驰马、枪旗，自身着甲，共往同行，或泛舟，或走马，可用吹以去之。 平旦叩齿九通，以鼻引清气，轻吹三十六遍，以去肾之一切邪气，过多亦损。 冬忌及沐浴修斋日 十月一日，沐浴吉，修成福斋。 五日，修三会斋，勿行责罚。 十一日，勿沐浴，仙家大忌日。 十一月，修启福斋。 十六日，沐浴吉，勿食葵。 十二月，勿食鳖、牛肉、腊日修百福斋。 十五日，沐浴吉。 二十八日，修迎新斋。 至晦日沐浴，焚香悔过思善。 冬十二月，省喊味，增苦味，以助心脏。 肾有病即多小便．腰胯疼痛，梦与鬼交，宜服八味丸方： 狭苓泽泻牡丹皮各三分桂心附子各二分生乾地黄八分山茱萸山药各四分 右熬捣为散，炼蜜丸如梧桐子大。",
      "translated_text": "The above eleven ingredients are simmered, pounded into powder, and taken by mixing five *qianbi* with liquid before meals; they may also be formed into pills. The Yellow Emperor asked: \"What about the three months of autumn?\" The woman replied: \"To tonify the kidneys, take the Poria and Aconite Pill, which governs kidney deficiency with cold, internal damage to the five viscera, and the sufferings of wind-cold deficiency. It causes the body and limbs to itch with dampness, the feet to lose their step, unawareness of oneself, loss of taste in food, blurred vision, generalized stiffness, lumbar and spinal pain, inability to eat, daily emaciation, heart palpitations, coughing with counterflow qi, inability to turn over, and the need for support when rising. Acupuncture and moxibustion offer little relief. Alternatively, one may have been exposed to wind while riding, failed to protect oneself, eaten irregularly, overexerted, or suffered from dry mouth, spontaneous drooling, nightmares with involuntary seminal emission, dripping bloody urine, damp itching of the genitals, or fright-like palpitations with unilateral tension in the lower abdomen, aching limbs, wheezing breath, floating swelling of the body and limbs, qi surging into the chest and rib-sides. When physicians fail to recognize this and treat it recklessly, this formula governs it.\"\n\n**Poria and Aconite Pill:**\n- Poria (fu ling)\n- Ledebouriella (fang feng)\n- Asarum (xi xin)\n- Dioscorea (shan yao)\n- Alisma (ze xie)\n- Aconite (fu zi)\n- Aster (zi wan)\n- Angelica pubescens (du huo)\n- Peony (shao yao)\n- Salvia (dan shen)\n- Sophora flavescens (ku shen)\n- Cinnamon bark (gui xin)\n- Dried ginger (gan jiang)\n- Achyranthes (niu xi)\n- Cornelian cherry (shan zhu yu)\n- Astragalus (huang qi), each three *liang*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds. Take seven pills before meals, twice daily.\n\n**The Kidneys Govern Winter**\nThe kidney viscera belong to the north, the water phase, and the Black Emperor spirit. Their form resembles a deer with two heads, like a round stone. The kidneys’ function is to distribute water and qi, irrigating the entire body like the roots of a tree. There are left and right kidneys, also called the Gate of Life. They are the palace of generative qi and the abode of dying qi. Guard them and they endure; use them and they deplete. They weigh one *jin* and one *liang*, positioned opposite the navel and attached to the lumbar spine. The kidneys are the mother of the liver and the child of the lungs. The ears are their palace.\n\nHeaven gives birth to me, flowing qi transforming—this is called essence. The coming and going of essence-qi is called spirit. Spirit is the kidneys’ repository of intelligence and emotion. The left kidney is *ren*, the right kidney *gui*. In qi, they correspond to *chui*; in fluids, to saliva; in form, to bone. Prolonged standing harms the bones, thus damaging the kidneys. The kidneys pair with bone and correspond to the teeth. Tooth pain indicates kidney damage. They govern the upper burner, nourish the middle burner, and defend the lower burner. When kidney evil enters, there is excessive spittle. The bladder is their palace. Their glory is the hair.\n\nThe *Yellow Court Classic* states: \"The kidney department’s palace is the dark gate, round. Within dwells a youth named Supreme Mystery. He governs the six palaces and the source of the nine fluids. Externally, he responds to the two ears and the hundred fluid channels.\" Their sound is *yu*, their flavor salty, their odor putrid. When heart evil enters the kidneys, one loathes putrid things. Their creature is the armored—all shelled beings belong to water, hence called armored.\n\nIn the three months of winter, the qi of heaven and earth closes, and the myriad things lie hidden. Moreover, on the winter solstice, yin and yang contend, and all life is stirred. The noble person fasts, retreats, covers the body, moderates desires, halts music and sex, awaiting the settling of yin and yang. Rising at dawn and retiring at dusk aligns with the sun’s light. Do not contend with the qi of yin and yang, then preserve life, harmonize with the Great Purity, and follow yin and yang. To oppose them injures the internal yin qi, causing kidney viscera to become deficient and disordered. At night, knock the teeth, and at dawn perform thirty-six knocks, calling the spirit’s name to pacify the water viscera.\n\nThe kidney spirit is named Dark Obscurity, styled Nurturing Infant. The kidneys’ appearance is black, their form like a round stone, their spirit like a white deer with two heads. The kidneys pair with bone above and govern the teeth. Tooth pain indicates kidney damage. They also govern the ears; deafness indicates kidney deficiency. Bone pain indicates kidney depletion. Frequent gum bleeding indicates kidney cold. Tooth decay indicates kidney wind. Ear pain indicates kidney congestion. Frequent yawning indicates kidney evil. Inability to straighten the waist indicates kidney freezing. A yellow complexion indicates kidney decline. When kidney evil enters, there is frequent groaning. A purple, radiant complexion indicates healthy kidneys. When the kidneys are diseased, there is pain and cold in the lumbar region, knees, and bladder, dripping urine, a black complexion, scorched teeth, heaviness of the body, panting, coughing, night sweats, tinnitus, qi obstruction, inability to eat, and dreams of entering dark places, seeing women, monks, nuns, turtles, soft-shelled turtles, galloping horses, spears, banners, oneself wearing armor and traveling together, or sailing boats or riding horses. Blowing can dispel these.\n\nAt dawn, knock the teeth nine times, draw in clear qi through the nose, and lightly blow thirty-six times to expel all kidney evils; excessive blowing also harms.\n\n**Winter Taboos and Days for Bathing and Fasting**\n- **Tenth month:** On the first day, bathing is auspicious; perform the Merit-Completion Fast. On the fifth day, perform the Three Assemblies Fast; do not administer punishments. On the eleventh day, do not bathe—this is a major taboo day for immortals.\n- **Eleventh month:** Perform the Fortune-Initiation Fast. On the sixteenth day, bathing is auspicious; do not eat mallow.\n- **Twelfth month:** Do not eat soft-shelled turtle or beef. On the winter solstice, perform the Hundred Blessings Fast. On the fifteenth day, bathing is auspicious. On the twenty-eighth day, perform the New Year-Welcoming Fast. On the last day of the month, bathe, burn incense, repent wrongdoing, and contemplate goodness.\n\nIn the twelfth month of winter, reduce salty flavors and increase bitter flavors to assist the heart viscera. When the kidneys are diseased, there is frequent urination, lumbar and hip pain, and dreams of intercourse with ghosts. Take the **Eight-Ingredient Pill**:\n\n- Poria (fu ling)\n- Alisma (ze xie)\n- Moutan (mu dan pi), each three *fen*\n- Cinnamon bark (gui xin)\n- Aconite (fu zi), each two *fen*\n- Fresh rehmannia (sheng di huang), eight *fen*\n- Cornelian cherry (shan zhu yu)\n- Dioscorea (shan yao), each four *fen*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds.",
      "overlap_context": "s, scabies, consumption, rising qi, coughing, or thickened, dry nasal mucus and saliva, take the Wind-Dispersing Powder:**\n- Ginseng (ren shen)\n- Salvia (dan shen), each one *fen*\n- Ledebouriella (fang feng)\n- Processed aconite (tian xiong, prepared)\n- Notopterygium (qiang huo)\n- Gentiana (qin jiao)\n- Cornelian cherry (shan zhu yu), each eight *fen*\n- Glehnia (sha shen), five *fen*\n- Tiger bone (hu gu, roasted), each ten *fen*\n- Dioscorea (shan yao), ten *fen*\n- Gastrodia (tian ma), twelve *fen*",
      "start_char": 4905,
      "end_char": 6130,
      "start_sentence": 241,
      "end_sentence": 300,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.00032567977905,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "每空心酒下三十丸，忌生萝卜。 黄帝曰：冬三月，宜以如何？ 女曰：以护命狭苓丸，主男子五劳七伤，两目茫茫污得风相出，头风项强，不得回转，心腹胀满，上连胸胁，下引腰背，表裹彻痛，喘息不得饮食，咳逆，面目痿黄，小便淋沥，阴痿不起，临事不兴，足肿腹痛，五心烦热，身背浮肿，盗汗流出，四肢拘拿，或缓或急，梦寤惊恐，呼吸短气，口乾舌燥，状如消渴，急急喜怒，悲愁呜咽，此方主之。 狭苓山药肉桂生山茱萸巴戟乾姜白术牛膝兔丝子各一两细辛防风泽泻柏子仁牡丹皮各半两附子一两半 右件药并熬捣为散，炼蜜为丸如梧桐子大。 先食服七丸，日再服。 脾脏王四季 脾脏属中央土，王四季，为黄帝神，形如凤凰，坤之气，土之精，象如覆盆。 脾者，裨也，裨助胃气。 在心下三寸，重一斤三两，阔三寸，长五寸。 脾为心子，为肺母。 外通眉阙，能制谋，意辩皆脾也。 口为之宫。 其神多，嫉妒盖起於脾也。 脾无定形，主土阴也。 妒亦无准，妇人多妒，乃受阴气也。 若食熟软之物，则全身之妙道也。 脾如磨之转化食，食不消是脾不转也，坚硬之物乃难化也。 若食讫便外，脾则侧，侧则不化食，乃为宿食之患。 若劳形之人犹可，若年过五十或闲乐之人，故自攘其患也。 脾气通和则口知五味，脾气有病则唇黑口乾，不思食，不知五味。 《黄庭经》云：脾长一尺掩太仓，中部老君治明堂。 其声宫，其性信，其味甘，其臭香。 心邪入脾，则不闻香气。 其虫裸，主於吞。 脾生於中宫，脾居左脸，主於层口，口为戊，舌为己，合於肉，荣於层。 藏不调即伤於脾，脾不调则伤质，质神俱损则伤人之中风，口涎舌硬，乃为脾气受邪也。 当四季月末十八日，少思屏虑，屈己济人，不为利争，不为阴贼，不与物竞，不以自强，恬和清虚，顺神之德，而后全其生，逆之则脾肾受邪，土木相克也。 脾神名常在字魂庭 脾之状其色黄，其状如覆盆，其神如凤。 脾与胃合为府，居左胁，寄二宫，六气肋，王於四季，转化其生而入於熟也。 食不消者，脾不转也。 多食者，脾虚也。 不顾食者，脾中有不化食也。 食不下者，脾塞也。 面无颜色者，脾虚之也。 好食甘物者，脾不足也。 多惑者，脾识不安也。 有风及肺疾者，食多乃脾虚也。 肌肉鲜白滑者，脾无疾也。 脾声主宫，官为五音之长，律应黄锺，脾闻乐则磨。 脾是元气之本。 宫居太阿，色黄体重。 土王六月，亦寄四季，有身沉力弱不欲食，身上习习如游风，心中自闷而色痿黄，梦见动土、或在野圹，及见道士身居城垒，童儿共行，可用呼以去之。 平旦叩齿六通，微以鼻引清气，呼三十遍，以去脾之壅滞，过多亦损。 六气法 上热呵心火，眼昏嘘自治，肺寒咽即效，耳病着心吹，脾胃常呼吸，三焦滞处嘻，山中无药物，见此是良医。 嘘、呵、咽、吹、呼、嘻，此六字去五藏诸疾。 比者方书亦多乖错，今寻讨修养经书，究穷义理，此六字定矣。 若脏腑有疾，但澄心定意，想气存思，微微嘘呵，邪气自然消散，所言止三十遍过多亦损者，此大约言之，亦无准定。 稍觉舌关清玲，则疾已过矣。 脾有病即气满冲心，四肢虚肿，宜服诃梨勒丸方： 诃梨勒皮七分山药牡丹皮泽泻山茱萸狭苓华拨芍蓊各八分乾姜五分",
      "translated_text": "Take thirty pills with wine on an empty stomach; avoid raw radishes.\n\nThe Yellow Emperor asked: \"What is suitable for the three months of winter?\"\nThe Woman replied: \"The **Life-Guarding Poria Pill** governs the five taxations and seven injuries in men, dim and blurred vision with wind-induced tearing, head wind and stiff nape preventing turning, distention and fullness in the heart and abdomen extending upward to the chest and ribs and downward to the waist and back, piercing pain throughout the exterior and interior, panting with inability to eat or drink, coughing with counterflow, withered yellow complexion and eyes, dripping urination, impotence and failure to rise when needed, lack of vigor in the moment, swollen feet and abdominal pain, vexing heat in the five centers, floating swelling of the body and back, night sweats, cramping or slackening of the four limbs, startling dreams and waking in terror, shortness of breath, dry mouth and tongue, symptoms resembling wasting-thirst, sudden joy or anger, sorrow and weeping—this formula governs them.\n\n- Poria (fu ling)\n- Dioscorea (shan yao)\n- Cinnamon bark (rou gui)\n- Fresh cornelian cherry (sheng shan zhu yu)\n- Morinda (ba ji)\n- Dried ginger (gan jiang)\n- White atractylodes (bai zhu)\n- Achyranthes (niu xi)\n- Cuscuta (tu si zi), each one *liang*\n- Asarum (xi xin)\n- Ledebouriella (fang feng)\n- Alisma (ze xie)\n- Biota seed (bai zi ren)\n- Moutan (mu dan pi), each half a *liang*\n- Aconite (fu zi), one and a half *liang*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds. Take seven pills before meals, twice daily.\n\n**The Spleen Viscera Reigns in the Four Seasons**\nThe spleen viscera belongs to the central earth, reigning in the four seasons. It is the spirit of the Yellow Emperor, shaped like a phoenix, the *qi* of *kun*, the essence of earth, resembling an overturned basin.\n\nThe spleen (*pi*) means \"to assist\" (*pi*), aiding the stomach *qi*. Located three *cun* below the heart, it weighs one *jin* and three *liang*, three *cun* wide and five *cun* long. The spleen is the child of the heart and the mother of the lungs. Externally, it connects to the space between the eyebrows, governing planning and discernment—all intentions and judgments arise from the spleen. The mouth is its palace. Its spirit is prone to jealousy, which originates in the spleen. The spleen has no fixed form, as it governs earthly *yin*. Jealousy likewise has no standard; women are often jealous because they receive *yin qi*.\n\nEating soft, well-cooked food is the wondrous Dao for the whole body. The spleen, like a mill, transforms food; undigested food means the spleen is not turning. Hard foods are difficult to digest. If one goes out immediately after eating, the spleen tilts, and tilting prevents digestion, leading to the harm of retained food. For those who labor physically, this may be tolerable, but for those over fifty or those who live in leisure, it becomes a self-inflicted affliction.\n\nWhen the spleen *qi* is harmonious, the mouth knows the five flavors; when the spleen *qi* is diseased, the lips turn black, the mouth becomes dry, one loses the desire to eat, and the five flavors are unrecognizable. The *Huangting Jing* states: \"The spleen, one *chi* long, covers the Great Granary; the Central Palace is governed by the Venerable Lord.\"\n\nIts sound is *gong*, its nature is trust, its flavor is sweet, and its odor is fragrant. If heart evil enters the spleen, one cannot detect fragrance. Its creature is the naked one, governing swallowing. The spleen arises in the central palace, resides in the left cheek, and governs the lips and mouth. The mouth corresponds to *wu*, the tongue to *ji*, uniting with flesh and flourishing in the lips.\n\nIf the viscera are not regulated, the spleen is harmed; if the spleen is not regulated, the substance is harmed. When both substance and spirit are damaged, it injures a person with wind-stroke, causing drooling and stiff tongue—this is the spleen *qi* receiving evil. On the eighteenth day from the end of each season, reduce thoughts and set aside worries, humble oneself to aid others, avoid contending for profit, refrain from hidden malice, do not compete with things, and do not rely on self-strength. Be tranquil, harmonious, clear, and empty, following the virtue of the spirit, and thus preserve life. Going against this causes the spleen and kidneys to receive evil, as earth and wood overcome each other.\n\n**The Spirit of the Spleen**\nThe spirit of the spleen is named Changzai, styled Huntíng. The spleen’s form is yellow, resembling an overturned basin, and its spirit is like a phoenix. The spleen and stomach together form a *fu*, residing in the left rib, lodging in two palaces and six *qi* ribs, reigning in the four seasons, transforming the raw into the cooked.\n\nUndigested food means the spleen is not turning. Overeating indicates spleen vacuity. Disregarding food means the spleen contains undigested food. Inability to eat means the spleen is blocked. A lack of complexion indicates spleen vacuity. Craving sweet foods indicates spleen insufficiency. Excessive confusion indicates the spleen’s discernment is unsettled. Those with wind or lung disease who eat excessively have spleen vacuity. Lustrous, white, and smooth flesh indicates the spleen is free of disease.\n\nThe spleen’s sound governs *gong*, the chief of the five notes, corresponding to the *huangzhong* pitch. When the spleen hears music, it grinds. The spleen is the root of original *qi*. *Gong* resides in the Great Alabaster, its color is yellow, and it is heavy. Earth reigns in the sixth month and is also lodged in the four seasons. Symptoms include bodily heaviness, weakness, loss of appetite, a creeping sensation like wandering wind over the body, self-oppression in the heart, and a withered yellow complexion. Dreams of moving earth, being in wild graves, or seeing Daoists within city walls, accompanied by children, can be dispelled by calling out.\n\nAt dawn, click the teeth six times, gently inhale clear *qi* through the nose, and exhale thirty times to dispel the spleen’s stagnation—excessive exhalation also harms.\n\n**The Six Qi Method**\nFor upper heat, *he* the heart fire; for dim eyes, *xu* cures itself. For lung cold, *yan* is effective; for ear disease, *chui* the heart. For the spleen and stomach, constantly *hu* and *xi*; for triple burner stagnation, *xi*. In the mountains without medicine, this is the good physician.\n\n*Xu*, *he*, *yan*, *chui*, *hu*, and *xi*—these six sounds dispel all diseases of the five viscera. Though many medical texts are erroneous, after examining cultivation and nourishment classics and thoroughly investigating their principles, these six sounds are now established. If the viscera and bowels have disease, simply calm the mind, stabilize the intention, visualize the *qi*, and gently exhale *xu* or *he*—evil *qi* will naturally dissipate. The statement that thirty repetitions are the limit, with excess causing harm, is a general guideline without fixed standard. When the tongue and throat feel clear and cool, the disease has passed.\n\nWhen the spleen is diseased, *qi* surges upward to the heart, and the four limbs become vacuous and swollen. The **Chebule Pill** is suitable:\n\n- Chebule peel (he li le pi), seven *fen*\n- Dioscorea (shan yao)\n- Moutan (mu dan pi)\n- Alisma (ze xie)\n- Cornelian cherry (shan zhu yu)\n- Poria (fu ling)\n- Long pepper (bi ba)\n- Peony (shao yao), each eight *fen*\n- Dried ginger (gan jiang), five *fen*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds.",
      "overlap_context": "d, there is frequent urination, lumbar and hip pain, and dreams of intercourse with ghosts. Take the **Eight-Ingredient Pill**:\n\n- Poria (fu ling)\n- Alisma (ze xie)\n- Moutan (mu dan pi), each three *fen*\n- Cinnamon bark (gui xin)\n- Aconite (fu zi), each two *fen*\n- Fresh rehmannia (sheng di huang), eight *fen*\n- Cornelian cherry (shan zhu yu)\n- Dioscorea (shan yao), each four *fen*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds.",
      "start_char": 6130,
      "end_char": 7386,
      "start_sentence": 301,
      "end_sentence": 353,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.9733452796936,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "右熬捣为末，炼蜜丸如梧桐子大。 空心枣汤下三十丸。 胆脏 胆者金之精，水之气，其色青，其神形如龟蛇，象如悬瓠，附着肝短叶下。 胆者，敢也，言人赡气果敢。 重三两三铢，为肝之腑。 若据胆则不在五脏之数，归於六腑，绿胆下亦受水气，与坎宫同道，又不可用六腑，故别立胆脏。 人之勇央者，盖发於胆脏也。 合於膀胱，亦主於毛发。 《黄庭经》云：主诸气力摄虎兵，外应眼瞳鼻柱问。 脑发相扶与俱鲜，胆部与五脏相类也。 且胆寄於坎宫，使人慕善知邪，绝奸止佞，欲行直道。 胆主於金，金主於杀，故多勇杀之气。 万物杀者则悲，故人悲者金生於水，是以目有汨也。 心主火，胆属水，火得水而灭，水得火而煎，阴阳交争户，水胜於火，目有相也，相出於胆。 胆水主目瞳，受木精，二合男子。 五十目暗者，肾气衰，胆精喊而可补其肾。 长於肝，欲安其神，当息忿争，行仁辅义，后乃全其生也。 胆神名龙耀字威明 胆之状其色青，其象如悬瓠，其神如毫蛇。 胆合於膀胱，上主毛发。 发枯者，胆损也。 胆有病大息，口乾，心中澹澹，似被人补逐者，倾也。 胆实则伤热，热则精神不守，起外无定； 胆虚则伤寒，寒则或畏，头眩不敢独外。 爪甲乾者，胆亏也。 无惧者，胆洪实也。 无故相出者，胆虚也。 好食苦物者，胆不足也。 发燥者，胆风也。 毛炼者，胆热也。 颜色青光者，胆无病也。 梦见与人斗争鬼交者，胆衰也。 胆有病用嘻以去之。 平旦叩齿九通，以鼻引清气，轻嘻三十遍，以去胆之病，过多则损也。",
      "translated_text": "The above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds. Take thirty pills on an empty stomach with jujube decoction.\n\n**Gallbladder Viscus**\nThe gallbladder is the essence of Metal and the *qi* of Water; its color is green. Its spirit-form resembles the tortoise and serpent, and its shape is like a suspended gourd, attached beneath the short lobe of the liver. The gallbladder (*dan*) is so named for *daring* (*gan*), signifying that one’s *qi* is bold and resolute. It weighs three *liang* and three *zhu*, serving as the liver’s *fu*-viscus. Though the gallbladder is not counted among the five viscera, it is classified among the six *fu*-bowels. Yet since the gallbladder below also receives the *qi* of Water and shares the same path as the Kan Palace, it cannot be treated as one of the six *fu*-bowels—thus it is separately established as the gallbladder viscus.\n\nA person’s courage and decisiveness arise from the gallbladder viscus. It is paired with the bladder and governs the hair. *The Yellow Court Classic* states: *\"It commands all strength and seizes the tiger’s troops; externally, it corresponds to the pupils of the eyes and the bridge of the nose. Brain and hair support each other, both radiant—this is how the gallbladder section resembles the five viscera.\"*\n\nMoreover, the gallbladder resides in the Kan Palace, enabling one to admire goodness, discern evil, sever deceit, and halt flattery, desiring to walk the straight Dao. The gallbladder governs Metal, and Metal governs killing—hence it abounds with the *qi* of courage and slaughter. When all things are killed, sorrow arises. Since sorrowful *qi* is Metal born of Water, this is why the eyes shed tears.\n\nThe heart governs Fire, and the gallbladder belongs to Water. Fire is extinguished by Water, and Water is boiled by Fire—when Yin and Yang contend at the gate, Water prevails over Fire, and the eyes produce *xiang*-tears, which issue from the gallbladder. The gallbladder’s Water governs the pupils of the eyes, receiving the essence of Wood; the two combine in men.\n\nWhen the eyes dim at fifty, it is because kidney-*qi* has declined and gallbladder essence has waned—one may supplement the kidneys. The gallbladder is the liver’s senior; to pacify its spirit, one must cease anger and strife, practice benevolence, and uphold righteousness—only then can life be preserved whole.\n\n**Gallbladder Spirit**\nName: *Longyao* (Dragon Radiance)\nStyle: *Weiming* (Majestic Brightness)\n\nThe gallbladder’s form is green in color, its shape like a suspended gourd, and its spirit resembles the tortoise and serpent. It is paired with the bladder and governs the hair above. When the hair withers, it is due to gallbladder depletion.\n\n**Gallbladder Disorders**\nWhen the gallbladder is diseased, one sighs deeply, the mouth becomes dry, and the heart feels unsettled, as if pursued by others—this is *qing* (prostration). When the gallbladder is replete, it is harmed by Heat; Heat causes the spirit to lose its anchor, and one rises and wanders without stability. When the gallbladder is vacuous, it is harmed by Cold; Cold induces fear, dizziness, and an inability to venture out alone.\n\nWhen the fingernails are dry, the gallbladder is deficient. When one feels no fear, the gallbladder is vast and replete. When tears flow without cause, the gallbladder is vacuous. When one craves bitter foods, the gallbladder is insufficient. When the hair is parched, it is gallbladder Wind. When the hair withers, it is gallbladder Heat. When the complexion is green and lustrous, the gallbladder is free of disease. When one dreams of fighting with others or coupling with ghosts, the gallbladder is debilitated.\n\nTo treat gallbladder disorders, use the *xi* exhalation to expel them. At dawn, click the teeth nine times, draw in pure *qi* through the nose, and gently exhale *xi* thirty times to dispel gallbladder disease—excess will cause harm.",
      "overlap_context": "een is diseased, *qi* surges upward to the heart, and the four limbs become vacuous and swollen. The **Chebule Pill** is suitable:\n\n- Chebule peel (he li le pi), seven *fen*\n- Dioscorea (shan yao)\n- Moutan (mu dan pi)\n- Alisma (ze xie)\n- Cornelian cherry (shan zhu yu)\n- Poria (fu ling)\n- Long pepper (bi ba)\n- Peony (shao yao), each eight *fen*\n- Dried ginger (gan jiang), five *fen*\n\nThe above ingredients are simmered, pounded into powder, and formed into honeyed pills the size of firmiana seeds.",
      "start_char": 7386,
      "end_char": 7984,
      "start_sentence": 354,
      "end_sentence": 388,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.383875370025635,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "三尸名 彭居、彭质、彭娇，每夜呼其名七‘苏．遍，卓然虚冷，饵然不寝，尸亦港形而孕游，无得再宅於人身也。 又能以身谕国，心神自然王也。 经曰：候王能守之，万物将自化。 则三尸其如予何？ 是以身安而家国可保，心定而性命可全也。 若淫於酒色，嗜於腥荤，乃千变万化，随欲而归，诸息自生，乃於道情而疏矣。 后序 人察阴阳之气，以成四大之形。 一身之中一国之象，胸脸位同宫室，四肢亦类郊炯。 神犹君也，血犹臣也，气犹百姓也。 君能化及百姓，而天下晏然； 身能血气调和，则四肢宣畅。 是以圣人治未病之身，宝不泯之寿，任情舒卷，屈迩随时，恬淡炼神，举措畏慎，为本也。 经曰：人不畏威，大威至矣。 摄生若无畏，则心乱而难理也，形躁而！ 个不宁，神散而气昏，志荡而意逸。 老子曰：善摄生者，陆行不过兕虎，入军不州了被甲兵，乃喻畏慎也。 又云：五音令人耳聋，五味令人口爽，宜在恬淡也。 摄生之法亦甚多途、则有焚香开经、步虚蹑斗、危冠短褐、茹柏餐松、炼汞烧丹、草木丸散、千岐万路，不可遍穷，殊途同归，百虑一致，若丹恳久着，虔诚岁深，真君可知，为之潜运乎？ 书曰：天监孔明，福善祸淫也。 是以覆载长存，圣贤不灭。 生者，天地之大德也。 死者，天地之荼毒也。 所以拂尘衣，去荼毒，静五脏，运三元，开黄庭之妙经。 览紫房之秘诀，然后能存能亡，能晦能光，出化人之表，入太漠之乡，无心而朗鉴，无翼而翱翔，嬉明霞之馆，谠碧云之堂，长生可冀也。 经云：老子修身千二百岁，吾形未尝衰。 又云：神将守形，乃可长生。 长生之道，非贤不传。 轻泄者获戾乎？ 天官信听者，记名於仙籍。 殃庆逮於九祖，升沉止於一形，岂使世之愚凡悉闻悉见！ 自羲轩已来，广成、赤松、令威、安期长生之法晓然，何迷而难返？ 亦有混沌自然，体合变化，智周万物，道亚三清，即高玄皇人之流也。 又有功成累劫，德被尘沙，神化无方，飞腾自在，即杜冲、尹轨是也。 山居养气，无欲无为，守道守精，心澄碧落，即许由、巢父是也。 远则名书竹帛，近即所在传闻。 愚昧者如瞽如聋，智识者且荣且贵。 陶隐居之书史满腹，毕而何有？ 长斋腹空，毕而何归？ 奇功绝代，毕而何用？ 乾象通神，毕而何知？ 老子云：金玉满堂，莫之能守？ 富贵而骄，自遗其咎！ 何不分灵台之毫末，入虚无之大门，天地坏而我全，万象尘而己在。 积善余庆，保合大和； 积恶灭身，而自伤何悔！ 斯乃道不负人，人能负道也。 圣贤留教，岂可轻耶？ 且身居浮世，万累劳华，不必绝粒居山，顿舍尘俗，但能顺时摄养，渐臧骄奢，五味五声勿唬勿嗜，知其恬淡自然，得长生之妙道也。 天主阳而动，地主阴而静。 天动也而北辰不移，地静也而束流不息。 故静者天之心也，动者地之气也。 心静气动则道无不成也，疾无由生矣。 学道者欲得广行阴德，慈心救人，重道轻财，不吝金玉，救人穷乏，谓之福田也。 默然养气，恬和冲神，以善以谦，勿欺勿诈，少思少语，少欲少愁，勿信妖讹，勿杀生命，勿行阴贼，勿嗜五辛，勿与人传衣巾，勿与人争曲直，勿向北秽污，勿久视三光。 六甲日勿食鳞虫，晦朔日思修善事，甲子庚申日别室静坐。",
      "translated_text": "The Three Corpses are named Peng Ju, Peng Zhi, and Peng Jiao. Each night, call their names seven times in succession. Suddenly, one will feel a void chill, and sleep will not come easily. The Corpses will then dissolve in form and wander, no longer able to dwell within the human body.\n\nMoreover, one’s body may thereby mirror the state, and the spirit of the heart will naturally reign as sovereign. As the *Classic* says: “If the lord and king can guard it, the myriad things will transform of themselves.” How then could the Three Corpses do aught against me? Thus, with the body at peace, family and state may be preserved; with the heart settled, life and nature may be preserved whole.\n\nIf one indulges in wine and lust, craves rank and meat, the Corpses will undergo a thousand changes and ten thousand transformations, following desire to return. All manner of infirmities will arise of themselves, and one will grow distant from the Dao and its sentiments.\n\n---\n\n**Postscript**\n\nMan observes the qi of yin and yang to form the four great elements of the body. The body is to the self as a state is to the realm: the chest and face correspond to the palace halls, the four limbs to the suburbs and outskirts. The spirit is like the ruler, the blood like the ministers, and the qi like the common folk. If the ruler can transform and reach the common folk, the realm will be at peace; if the body can harmonize blood and qi, the four limbs will flow freely.\n\nThus, the sage tends to the body before illness arises, cherishing an indestructible lifespan. He follows his nature, expanding and contracting, advancing and retreating as the times demand. Serene and refining the spirit, he acts with reverent caution—this is the foundation.\n\nAs the *Classic* says: “If man does not fear majesty, great majesty will come.” If one lacks awe in nurturing life, the heart will grow disordered and difficult to govern, the form restless and unsettled, the spirit scattered and qi dimmed, the will adrift and the mind wayward.\n\nLaozi said: “He who is skilled in nurturing life walks on land without meeting rhinoceros or tiger, enters battle without donning armor or wielding weapons”—this illustrates reverent caution. He also said: “The five tones deafen the ears; the five flavors dull the mouth.” Thus, one should abide in serenity.\n\nThe methods of nurturing life are manifold: burning incense and opening scriptures, pacing the void and treading the Dipper, donning tall caps and short robes, consuming cypress and pine, refining mercury and firing elixirs, crafting herbal pills and powders. Though the paths are myriad and cannot all be exhausted, they converge as one, and a hundred thoughts unite in purpose. If one’s devotion is sincere and long-standing, and one’s reverence deepens over the years, will the True Lord not take notice and act in secret?\n\nAs the *Book* says: “Heaven observes with clarity, blessing the good and calamitizing the licentious.” Thus, heaven and earth endure forever, and sages and worthies never perish.\n\nLife is the great virtue of heaven and earth; death is their bitter poison. Therefore, brush away the dust from your robes, cast off the bitter poison, still the five viscera, circulate the Three Origins, and open the wondrous scripture of the Yellow Court. Peruse the secret formulas of the Purple Chamber, and thereafter one may preserve or abandon, conceal or reveal, transcend the bounds of transformation, and enter the land of the Great Desert. Without thought, one may see clearly; without wings, one may soar. Play in the halls of radiant clouds, discourse in the chambers of azure mists—longevity may then be hoped for.\n\nAs the *Classic* says: “Laozi cultivated himself for one thousand two hundred years, yet his form never declined.” It also says: “When the spirit guards the form, one may attain long life.” The Way of long life is not transmitted to the unworthy. Those who lightly divulge it incur calamity, while those who faithfully heed the celestial offices have their names recorded in the registers of immortals. Blessings and misfortunes extend to the nine ancestors; rise and fall rest with the individual—how could the foolish and common be made to see and hear all?\n\nSince the time of Fuxi and the Yellow Emperor, the methods of long life of Guangcheng, Red Pine, Lingwei, and Anqi have been clearly known—why then do men remain deluded and fail to return? Some merge with the primordial and natural, their bodies uniting with transformation, their wisdom encompassing the myriad things, their Dao second only to the Three Clarities—these are the august and mysterious perfected ones. Others accumulate merit over countless kalpas, their virtue spreading like dust and sand, their spiritual transformations boundless, soaring and roaming freely—such were Du Chong and Yin Gui. Dwelling in mountains to nurture qi, free of desire and action, guarding the Dao and preserving essence, their hearts as clear as the azure vault—such were Xu You and Chao Fu. Some are recorded in distant bamboo and silk, while others are heard of nearby. The foolish are like the blind and deaf; the wise attain both honor and nobility.\n\nThough Tao Hongjing’s books filled his belly, what did he gain in the end? Though he fasted until his belly was empty, what did he attain? Though his marvelous deeds surpassed his age, what use were they? Though he understood the celestial patterns, what did he truly know?\n\nLaozi said: “Gold and jade fill the hall—who can guard them? Wealth and nobility breed arrogance, inviting one’s own downfall.” Why not instead refine the finest essence of the numinous terrace and enter the great gate of emptiness and nonbeing? Though heaven and earth crumble, I remain whole; though the myriad forms turn to dust, I endure.\n\nAccumulated goodness brings surplus blessings, preserving the great harmony; accumulated evil destroys the self—what regret can there be? Thus, the Dao does not fail man; it is man who fails the Dao. Can the teachings left by sages and worthies be taken lightly?\n\nMoreover, dwelling in this fleeting world, burdened by a thousand cares and vain adornments, one need not abandon grain or retreat to the mountains, abruptly forsaking the dusty world. Simply nurture life in accord with the seasons, gradually curbing arrogance and extravagance. Do not crave or indulge in the five flavors or the five tones. Know the serenity of the natural, and you will attain the wondrous Way of long life.\n\nHeaven governs yang and movement; earth governs yin and stillness. Though heaven moves, the Northern Asterism does not shift; though earth is still, the eastern currents never cease. Thus, stillness is the heart of heaven, and movement is the qi of earth. When the heart is still and qi moves, the Dao is without fail accomplished, and illness has no means to arise.\n\nThose who study the Dao should broadly practice hidden virtue: with a compassionate heart, save others; value the Dao and disdain wealth; do not begrudge gold and jade; relieve the poor and destitute—this is called the field of blessings. Silently nurture qi, serenely harmonize the spirit, act with goodness and humility, do not deceive or cheat, think little and speak little, desire little and worry little. Do not believe in omens or heresies, do not kill living beings, do not engage in hidden malice, do not crave the five pungent foods, do not share clothing or towels with others, do not contend over right and wrong, do not face north when relieving yourself, do not gaze long at the Three Luminaries. On *liu-jia* days, do not eat scaled creatures; on the last and first days of the lunar month, reflect on cultivating good deeds; on *jia-zi* and *geng-shen* days, sit in quietude in a separate chamber.",
      "overlap_context": "e hair is parched, it is gallbladder Wind. When the hair withers, it is gallbladder Heat. When the complexion is green and lustrous, the gallbladder is free of disease. When one dreams of fighting with others or coupling with ghosts, the gallbladder is debilitated.\n\nTo treat gallbladder disorders, use the *xi* exhalation to expel them. At dawn, click the teeth nine times, draw in pure *qi* through the nose, and gently exhale *xi* thirty times to dispel gallbladder disease—excess will cause harm.",
      "start_char": 7986,
      "end_char": 9215,
      "start_sentence": 389,
      "end_sentence": 445,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.65246891975403,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "寝外处不欲虚堂高敞，匪唯风雾难防，亦令魂魄恍惚。 卧不欲仰，枕不欲高，寝处不欲停灯。 夜行须呜天鼓。 八节日勿行威令，秋分日尤须斋心。 神人赞云：子欲升天慎秋分，事无大小皆上闻。 以罪求仙诚甚难，知此学道为心寒。 若眠梦不安，心中惊悸，此是七魄欲散，五神执争，疾祸将侵，必须慎护，晓夕端坐，叩齿三十六遍，咒曰： 九天上帝，四门八灵，七房三玄，三素九精，太一桃康，上诣三清，请告帝君，摄命黄宁，速召七魄，校实神庭，若有不祥，七尸鬼兵，但呼双真，流烛炼形，太微大神，斩伐邪精，三神和柔，血尸沉零，神归绝宅，触向利贞，使我神仙，永保劫龄。 神农忌慎法 黍米和葵同食，作症癖疾。",
      "translated_text": "Do not sleep in an empty hall with high, open spaces, for not only are wind and mist difficult to guard against, but it also causes the hun and po souls to become disoriented. Do not lie supine when sleeping, nor use a pillow that is too high; do not keep a lamp burning where you sleep. When walking at night, one must beat the \"Heavenly Drum.\" On the eight solar term days, do not issue stern commands, and on the Autumn Equinox, one must especially purify the heart. The divine beings praise thus:\n\n*If you wish to ascend to heaven, be cautious on the Autumn Equinox,\nLet no matter, great or small, go unheard.\nSeeking immortality through sin is truly difficult,\nKnowing this, the heart of the Dao learner grows cold.*\n\nIf sleep is restless and the heart is startled and fearful, this means the seven *po* souls are about to scatter and the five spirits are contending, with illness and misfortune soon to strike. One must be vigilant in protection: sit upright morning and evening, click the teeth thirty-six times, and recite the incantation:\n\n*Supreme Emperor of the Nine Heavens, Eight Spirits of the Four Gates,\nSeven Chambers and Three Mysteries, Three Pure Ones and Nine Essences,\nGreat Unity and Peach Prosperity, ascend to the Three Clarities,\nPetition the Imperial Lord, summon the Yellow Tranquility to command,\nSwiftly call back the seven po souls, verify them in the divine court.\nIf there is any inauspiciousness, the seven corpse ghosts and soldiers,\nSimply invoke the Twin Perfected Ones, refine the form with flowing candles.\nGreat Spirits of the Grand Tenuity, slay and expel evil essences.\nWhen the three spirits are harmonious and gentle, the blood corpse will sink and vanish,\nThe spirits will return to their abodes, all obstacles will turn to good fortune,\nGranting me immortality as a divine transcendent, preserving my lifespan through the kalpas.*\n\n**Cautions of the Divine Farmer:**\nDo not consume millet and mallow together, as it causes *zheng* and *pi* illnesses.",
      "overlap_context": " not believe in omens or heresies, do not kill living beings, do not engage in hidden malice, do not crave the five pungent foods, do not share clothing or towels with others, do not contend over right and wrong, do not face north when relieving yourself, do not gaze long at the Three Luminaries. On *liu-jia* days, do not eat scaled creatures; on the last and first days of the lunar month, reflect on cultivating good deeds; on *jia-zi* and *geng-shen* days, sit in quietude in a separate chamber.",
      "start_char": 9215,
      "end_char": 9500,
      "start_sentence": 446,
      "end_sentence": 455,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.076135158538818,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "大豆与猜肉同食，作壅气疾。 青豆与蚱及鲤鱼同食，成瘦疾。 经夏曝中乾脯，令发虫疾。 祷麦缅与堵肉同食，成恶疾疮兼动风。 赤小豆多食，令人枯瘦。 甜粥与苍耳同食，成症气。 诸酒浆临上不见影者，杀人。 经宿葵，食之发五种瘤癖疾。 葵和鲤鱼蚱，食之害人。 芥和兔肉同食，成恶疾。 白苣和酪同食、成寸白虫。 生葱和蜜同食，害人生。 葱与鹦子、雉肉同食，兼白犬肉，作癫邪疾。 发症癖。 韭和牛肉食，发瘦疾。 野苣勿与蜜同食，作痔疾。 仅花不宜多食，发痰饶睡。 凡果子生食，多发宿疾。 李子与蜜同食，和水多成痰。 桃食了入水，成淋疾。 诸生果子停多日，食之皆发宿疾。 放入水沉者，不可食，成外癖疾。 夫摄生之事，忌食父母及己身本命之物，令人寿不永也。 诸肉自死者不可食，损害人生。 肉与牛乳同食，成苗虫。 驴马肉与猪肉同食，发霍乱。 诸藏及胴如水洗之状，不染尘土，有大毒，不可食。 马肉共苍耳、仓米同食，害人。 羊肉与生绘及酪同食，皆有所伤害。 诸饮食上有游蜂停住者，皆有毒，勿食之。 ，诸色肉不得用桑拓枝刻，食之成恶虫病。 羊肝不得· 入生椒同食，破人心肝。 猜肝不得与绘同食，作审疽。 兔肉与生姜同食，作霍乱。 猜、牛肉共酪同食，作气癖。 鹦肉与鳖伺食，害人。 壬，子日忌杀一切黑色生命物。 丙午日不得食鹦等肉，虑被火烧厄。 庚申、甲子日宜斋戒，心祭祀鬼神，余物不得。 食。 若诸色肉煮炙赤色不变者，皆害人。 新热疾差，忌食一切肉，但疾病未平复，忌食煮韭等。 自按摩法 以手左拓右拓，上拓下拓，前拓后拓，瞋目叩齿，摩手热摩跟，拔耳捩腰，震动双作，只作反手为之，然复掣足，仰展覆展，都数约至七八十而止。 徐徐作之，仍想空中太和气渐下入顶，如云入山，入皮入肉，入腹入四肢，五脏皆受其润，则觉腹中有声，意专存思，勿念外绿，则元气达於气海，须臾自达於涌泉，但日引一通至三通，令人力健，耳目聪明，百疾皆去，无限年月长存不忘，得满千万通去仙不远矣。 四气摄生图竟",
      "translated_text": "**Cautions of the Divine Farmer (continued):**\n\nDo not consume soybeans with pork, as it causes *yong*-qi illness. Green beans with grasshoppers or carp produce emaciation. Dried meat exposed to summer sun breeds worm-borne diseases. Wheat flour with dog meat causes malignant sores and triggers wind afflictions. Excessive red adzuki beans make one gaunt. Sweet porridge with cocklebur produces *zheng*-qi. Any wine or broth that casts no shadow when held aloft is lethal. Overnight mallow sprouts, when eaten, induce five types of *liu*-*pi* illnesses. Mallow with carp or grasshoppers harms the body. Mustard with rabbit meat causes malignant diseases. Lettuce with yogurt breeds tapeworms. Raw scallions with honey endanger life. Scallions with parrot eggs, pheasant, or white dog meat induce madness and *zheng*-*pi*. Chives with beef produce emaciation. Wild lettuce with honey causes hemorrhoids. Excessive magnolia flowers induce phlegm and drowsiness. Most raw fruits, when eaten in quantity, trigger chronic ailments. Plums with honey and water generate phlegm. Entering water after eating peaches causes *lin* illness. Any fruit stored for days, when consumed, revives old maladies. Fruits that sink in water must not be eaten, as they cause external *pi* illnesses.\n\nIn matters of nurturing life, avoid consuming creatures corresponding to your parents’ or your own birth signs, lest your lifespan be shortened. Do not eat meat from animals that died of themselves, as it harms vitality. Meat with cow’s milk breeds intestinal worms. Donkey or horse meat with pork causes cholera. Any organ or flesh resembling water-washed, dust-repellent tissue is highly toxic and must not be eaten. Horse meat with cocklebur or millet harms the body. Mutton with raw leeks or yogurt is injurious. Do not consume food where drifting bees have alighted, as it is poisonous. Meat carved with mulberry branches breeds malignant worm diseases. Sheep’s liver with raw pepper ruptures the heart and liver. Pig’s liver with leeks causes deep abscesses. Rabbit meat with ginger induces cholera. Pork or beef with yogurt produces *qi*-*pi*. Parrot meat with turtle harms the body.\n\nOn *ren* and *zi* days, avoid killing any black creatures. On *bing-wu* days, do not eat parrot or similar meats, lest you suffer fire-related calamities. On *geng-shen* and *jia-zi* days, observe abstinence, offering only heartfelt sacrifices to ghosts and gods—no other food. Any meat that remains unreddened when cooked or roasted is harmful. After recovering from acute illness, avoid all meat; until fully restored, refrain from cooked chives and the like.\n\n**Self-Massage Method:**\nPress the left hand with the right, the right with the left, upward and downward, forward and backward. Glaring fiercely, clench the teeth, rub the hands until warm, then massage the heels. Pull the ears, twist the waist, shake both shoulders, and reverse the hands’ motion. Next, tug the feet, stretch upward and downward, repeating the sequence seventy to eighty times. Proceed gently, visualizing the Great Harmonious *qi* descending from the void into the crown like clouds entering mountains—penetrating skin, flesh, abdomen, and limbs, moistening the five viscera. When the belly rumbles, focus the mind inward, dismissing external distractions. The primordial *qi* will then reach the *qi*-sea, soon flowing to the *yongquan* points. Perform one to three cycles daily to strengthen vitality, sharpen hearing and sight, dispel all illnesses, and prolong life without limit. After ten million cycles, transcendence is near.\n\n**The Four Qi Nurturing Life Diagram concludes.**",
      "overlap_context": "ected Ones, refine the form with flowing candles.\nGreat Spirits of the Grand Tenuity, slay and expel evil essences.\nWhen the three spirits are harmonious and gentle, the blood corpse will sink and vanish,\nThe spirits will return to their abodes, all obstacles will turn to good fortune,\nGranting me immortality as a divine transcendent, preserving my lifespan through the kalpas.*\n\n**Cautions of the Divine Farmer:**\nDo not consume millet and mallow together, as it causes *zheng* and *pi* illnesses.",
      "start_char": 9500,
      "end_char": 10289,
      "start_sentence": 456,
      "end_sentence": 501,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.397205591201782,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\四气摄生图.txt",
        "category": "灵图类"
      }
    }
  ]
}