{
  "source_id": "四明洞天丹山图咏集",
  "source_file": "chunked_daozang\\四明洞天丹山图咏集.json",
  "total_chunks": 17,
  "total_original_chars": 13395,
  "total_translated_chars": 77776,
  "total_translation_time": 445.3326461315155,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
    "category": "记传类"
  },
  "full_translation": "**The *Yong Collection of Dan Mountain in Siming Grotto-Heaven***\n\n**Scripture Title:** *Yong Collection of the Illustrated Dan Mountain in Siming Grotto-Heaven*. Compiled by Zeng Jian and Wei Su of the Yuan dynasty. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongxuan* section, *Jizhuan* category.\n\n**Preface to the *Yong Collection of the Illustrated Dan Mountain in Siming Grotto-Heaven***\nBy Canghai Yishi, Zeng Jian of Linchuan\n\nSiming Mountain lies upon the Eastern Sea. The mountain has four apertures that pierce through, their light illuminating the heavens. When the skies clear after rain, they appear like windows or doors. The locals call them \"Stone Windows,\" and thus the mountain takes its name. During the Tang, a prefectural seat was established at present-day Yuyao, and the commandery was named *Ming* after the mountain. In the Song, the old seat of Qingyuan was changed, and a county was established. In the present dynasty, the prefecture was elevated, and the mountain fell under Yuyao, a hundred *li* south of the seat.\n\nThe illustrations are carved at the temples and abbeys at the mountain’s foot. The first is the *Illustration of Yuanjian Abbey*; the second, the *Illustration of Tangqian Abbey*—together, they are called Siming Mountain. Mu Xuanxu said: \"Among the thirty-six grotto-heavens under heaven, Siming ranks ninth, its title being *Dan Mountain and Crimson Waters*.\" Upon examination: the mountain connects with Dalan Mountain, its terrain coiling and binding, extending three hundred and eighty *li* in circumference, with two hundred and eighty peaks rising two hundred and ten *zhang*. Perpetual clouds and mist shroud its midst, unbroken for twenty *li*. This stretch is called *Guoyun*; to the south, *Yunnan*; to the north, *Yunbei*. Thirty *li* along the ridges stands a peak called *Santai Mountain*, with *Pingfeng*, *Shiwu*, and *Yungen*. Between *Shiwu* and *Yungen* hangs a waterfall like a suspended river, called *Chanyuan Cave*.\n\nBeside *Santai* lies *Longshu*. In the Later Han, Liu Gang of Xiapi, then magistrate of Shangyu, resigned his post and, with his wife Fan Yunqiao, dwelled in *Chanyuan Cave*. From White Lord, they obtained the arts of immortality. Above it flows *Xiyao Stream*, where they refined their studies. Upon completion, they gathered with friends atop Dalan Mountain, climbed a towering cedar, and with a single wave of his hand, Liu summoned his wife. Together, they ascended as immortals, leaving behind only their forms below, which transformed into recumbent tigers. Later generations named the mountain in their honor. A pavilion, *Fan Pavilion*, was built, where the recluse Kong You of the Liang later resided. Once, he saw several hundred *hu* of coins in the valley; when woodcutters scrambled to take them, they turned to rubble. A deer, struck by an arrow, fled to Kong, who healed and reared it. When cured, it departed. Thus, a *Deer Pavilion* was built beside the shrine.\n\nDuring the Yongding era of the Chen, a certain Fang Yi built an abbey, repurposing the old shrine, hence called *Keyu Abbey*. In the eleventh year of Tianbao of the Tang, envoys were sent to offer prayers at the shrine, but the path was deemed too perilous. Daoist monks and the scholar Li Jian relocated it outside *Chanyuan Cave*, near the You River post. In the Song, Wu Jun Zhenyang of Longhu Mountain’s Erhua Abbey, styled *Master Undisturbed*, studied under the Celestial Master Zhang Yujing. Traveling here, he took residence. Emperor Huizong summoned him to the *Ningshen Hall* to register his name, but he declined. In the sixth year of Zhenghe, the court expanded the abbey, constructing the *Jade Emperor Hall*, and inscribed its plaque: *Grotto-Heaven of Dan Mountain and Crimson Waters*. Liu Gang was enfeoffed as *Ascended Mystery Illustrious Perfected Lord*; Fan Shi, as *Ascended Perfected Wondrous Transformation Primordial Lady*. *Master Undisturbed* was appointed *Danlin Gentleman*. Logging was forbidden, and taxes were remitted.\n\nPrime Minister Zhang of Gaozong’s court knew his disciple Kong Rong and, on his recommendation, petitioned for *Master Undisturbed* to be named a Perfected. The court permitted the annual ordination of one Daoist, transmitted in order of seniority. In the first year of Jiaxi, Emperor Lizong offered sacrifices at the *Longrui Abbey* in Kuaiji. Upon completion, golden dragons and jade tablets were interred here. Now, Master Mao Yongzhen of the *Sanhua* lineage presides over it.\n\nThe mountain’s trees are called *qingling*, their fruit sweet but inedible when split. Its beasts are called *ju* monkeys. During the Xiantong era of the Tang, Xie Yichen retired here. Lu Guimeng and Pi Rixiu often visited, each composing nine poems, which they took as their themes.\n\nLu You of the Song recorded: \"Twice I sailed the sea on official business, departing from Qingyuan’s waters, skirting Yuyao, and ascending four times in all. Gazing west, the distant peaks appeared as faint as wisps of cloud, piercing the very edge of heaven. The helmsman pointed and told me: ‘That is Great Orchid Mountain.’ Upon reaching the capital, I happened to meet Master Xue Yifu, who had just come from the abode of Master Mao the Venerable. He showed me two scrolls, and through them I glimpsed the mountain’s wondrous beauty—longing to wander its heights and depths, to roam with a few carefree scholars, to sit in Deer Pavilion, to drink from the murmuring stream, to call the *ju* monkeys, and thus to wash away the dust of worldly toil and the press of official duties. In the past, as my boat passed by, I could only gaze in longing and sigh. Nowadays, scholars and officials are drowned in the pursuit of profit and advancement. The highest cannot emulate Liu Wang, who cast off his sandals and cap to wander free; the next cannot match Pi and Lu, who forgot all rank in their shared verses. Is it any wonder that those who stand above the world are met with scorn and spit, while men call this place a Grotto-Heaven? I have therefore set down its origins in full, that those who aspire to transcend the mundane may find something to contemplate.\"\n\n*Eulogies and Illustrations of the Red Mountain of the Four Brightnesses’ Grotto-Heaven*\nCollected by Mu Xuanxu of the Tang\nAnnotated by He Zhizhang of the Tang\n\nThe Four Brightnesses’ name is Heaven of Crimson Waters,\nIts numinous traces and sacred marks are of heaven’s own making.\nTwo hundred and eighty peaks stand linked,\nAnd within their caves and halls dwell many immortals.\n\nAccording to the *Records*, this mountain has seventy peaks on each of its four sides, totaling two hundred and eighty, arrayed like a screen. Its eastern face rises like startled waves, seventy towering peaks lined in misty ranks. A single stream flows into Gouzhang, and two immortals’ virtue shines in this nurturing land. The two immortals are Dong An and Bao Quan. Quan possessed the conduct of a sage, and An the merit of filial devotion. The *Records* state that these earthbound immortals both emerged in the Later Han. When the First Emperor’s divine general, Wang Yin, drove mountains to dam the sea, he drowned in the flood. Buried beneath the waters without filling the gap, he gave his name to Yin River, which remains to this day. The Four Brightnesses’ other name is Gouzhang, and its river is called Yin River, which flows into the great ocean.\n\nBefore Great Thunder Mountain lies the Quiet Water Grotto,\nWhere Xie Tiao once dwelt, reading and chanting sutras.\nThus it was named Great Compassion, and linked to Compassion Creek,\nFor all its springs and waterways share a single source.\n\nGreat Thunder Mountain was once home to many birds and beasts, and hunters often defiled its grottoes. Later, immortals summoned a great thunderstorm to block their way, and the mountain took its name from this event. In the Jin and Han dynasties, many worthies and adepts of the Dao concealed themselves here. Within lies the Golden Hawk Grotto. Several peaks resemble lotus petals, their forms touching the Pear Isle Grotto. A clear spring flows down to a small stream, sustaining several hundred households in their livelihoods. Nearby stands Hibiscus Peak, close to Pear Isle Grotto. In the Jin dynasty, Xing Zisun of the Gong clan entered this mountain and saw ripe pears by the path. He ate two or three and felt full. When he returned to look again, the place had vanished. Thus it was named Pear Isle.\n\nFlanking peaks rise steeply, their forms jagged and towering, with a stone casket at the summit holding immortal honey. Below lies a dragon pool, its depths plunging a hundred fathoms, and a stone chamber hidden deep within, its secrets securely sealed.\n\nThis is Honey Rock Peak, where atop the stone casket rests the immortal honey. Once, celestial omens stirred here, and below, the dragon pool became a site for both public and private prayers. Further down lies another pool, named Stone Essence. Within its waters stands a stone chamber, storing the esoteric scriptures of immortals. In the time of Yu the Great, the reclusive scholar Wang Zhen personally opened it and marveled at its wonders.\n\nTo the southwest, the mountain resembles a charging ox, its ridges burning in succession like linked hooks. Seventy peaks, great and small, stand in count, while the mountain’s base splits into two branches, connecting to Yuezhou. At its foot lie the counties of Yuyao and Shangyu, part of Zhaozhou, where both land and water routes converge.\n\nHidden Peak crouches like a parrot in repose, its secluded ridges soaring in a hundred varied forms. Among its peaks—three here, five there—immortals wander daily. To the southwest, the mountains take on strange shapes, with three or five extraordinary peaks emerging and vanishing amid the mist.\n\nIn the Han dynasty, Zhang Heng once paused here, cutting timber to fashion his staff. The leftover planks, three or five heaps, gleamed with the hue of purple gold, their resonance and luster truly divine. Four carved lions guard the corners, enduring through eons without decay. Thickets of bamboo grow by the streamside, while medicinal herbs and immortal fruits flourish in abundance.\n\nHere, Zhang Ziping of the Han once felled trees. The remaining planks, three or five piles, shimmered like purple gold, perpetually veiled in clouds and mist. Long ago, Zhang Chong saw these planks, took a five-inch piece, and presented it to the governor of Kuaiji. When carved into a butterfly, the wood soared into the heavens.\n\nAmidst the emerald cliffs, sheer stone walls rise thousands of feet, obstructing clouds. Within grow wondrous fruits that sate hunger, and streams that channel the pulse of the sea. When the Jin immortal Ge Xuan arrived at this mountain, he saw fish in the stream, six or seven feet long. As he struck one with his staff, the mountain spirit appeared, warning: *\"Do not harm it—the stream flows to the great ocean, and these fish often come from the sea.\"*\n\nIn the Wei dynasty, a man named Yang Dezhu once encountered mountain immortals by the roadside. Two immortals, holding fire and seeking a golden blade, carved images and inscribed words, giving rise to this tradition.\n\nYang Dezhu wandered this mountain when suddenly he encountered an old man, who said, *\"Go forward and you will see two immortals holding fire and seeking a blade. Observe closely.\"* Dezhu indeed saw them, and explained: *\"The two fires form the character 'flame' (炎), and seeking the golden blade completes 'arrive' (到). Thus, this is called 'Han carving' (刻汉).\"*\n\nTo the mountain’s south, its peaks stand like driven sheep, seventy ridges arrayed in formation. In the Han dynasty, Liu and Ruan lost their way for seven days—by the time they returned, six generations of their descendants had perished. There were two men, Liu and Ruan, who went together to gather herbs. After seven days at the immortals’ abode, they came back, only to learn three hundred years had passed. Returning home, they beheld their seventh-generation descendants.\n\nWithin lies a great pond of several *mu*, where cave-dwelling immortal serpents often exhale *qi*. It transforms into clouds and rain, forming towers and terraces, its waters flowing into several streams like the Dan Creek. As the waters carry forth immortal herbs, the elders have long called it Herb Creek (*Xun Han*).\n\nThe White Cliff’s waterfall cascades like flying silk, all merging into the Purple Creek in boundless flow. Amidst stands a mountain shaped like an overturned basin, its tangled woods and riotous blossoms a tangle of chaos. Two peaks, named Great and Lesser Obscurity, shroud the sun in gloom, veiled by light mists. Woodcutters say that Ying Ze once roamed here, where stone beds stretch for *zhang*, graced by auspicious clouds.\n\nIn the Song dynasty, Ying Ze entered the mountain and suddenly found himself in a realm of surpassing beauty. When he returned, it had vanished—only darkness remained, and he dared not linger. Thus, the peaks were named Great and Lesser Obscurity. The Purple Creek is the White Water viewed from nearby.\n\nAmong its immortal beasts is the rhinoceros. Fan Yan once captured one, and its hide became a robe. When worn, it rendered the wearer invisible, concealing form and leaving no trace. In the Liang dynasty, Fan Yan came to this mountain and saw several rhinoceroses. He slew one, flayed its hide to make a robe, and when he donned it, his form vanished—no one could see him. Thus, it was called the Cloak of Concealment.\n\nThe mountain’s northern face winds like a slithering serpent, its perilous ridges layered without end or shore.\n\nThe seventy peaks here are numerous and grand, their ridges resembling eight interwoven nets of kidneys. To the north lies the entrance to Spirit Mountain, its form like a ceremonial screen, its layered ridges mirroring the slithering serpent’s motion. Two mountains surge forth like opposing ranks, parting to draw forth a long ravine that divides like a towering wall. Embracing Child Mountain’s summit is a level stone chamber, where springs flow sweet as nectar, concealing immortals within. Zheng Hong once explored the *Classic of Mountains and Seas*, which lists this spring by name. Called the Sacred Water, its taste is smooth and sweet; those who drink it attain longevity.\n\nTwo mountains stand face to face, their center cleft by a ravine whose waters diverge in four directions—now commonly called Great and Lesser Brightness. In the Song dynasty, Zheng Hong sought this spring’s course and drank from it; within the stone chamber, he beheld a sacred image. In recent times, no divine immortals have been heard of near its borders.\n\nWithin the Four Brightness Mountains lies a crouching tiger, its body formed of verdant stone, its ancestor. Carved with seven apertures, it exhales auspicious clouds, each cavity capable of summoning wind and rain. The heart of Four Brightness Mountain is named Crouching Tiger Mountain, where red stones and catalpa trees stand, each bearing seven apertures, all dwelling places of dragon spirits. As the *Classic of Mountains and Seas* states: \"A mountain without apertures cannot be a famous mountain.\"\n\nA stone vault stores books, a granary holds grain for washing—its taste is rich and sweet. A single twisted tree, two hundred feet long, shines with light that illuminates the mountain’s peak at night. Mei Fu once lodged in this vault and saw its books, countless in number. It is said that during the Qi dynasty, a woodcutter named He Xin encountered a granary of salt. Taking a small portion home to his mother, they found its taste sweet. Within days, her white hair turned black again, her complexion as youthful as a child’s. When he returned to retrieve more, the granary had vanished. He also saw a twisted tree, over twenty *zhang* in length, lying across the mountain’s belly, perpetually emitting a radiant glow visible to all.\n\nBound to the west by Gouzhang and Yu’s Grotto, to the south it connects with Tiantai, threading through the earth’s bones. To the north, it cradles the emerald expanse, cherishing its source—where earthly saints and heavenly immortals appear and vanish. These mark the four boundaries of Four Brightness Mountain.\n\nIts expanse winds broadly across eight hundred *li*, its ancient numinous wonders too many to record. Mei Fu became an immortal dwelling on this mountain, while Magistrate Liu Gang and his wife, Lady Fan, attained the Dao here. During the reign of King Jing of Zhou, the righteous man Yi Chang wandered this mountain and was the first to ascend as an immortal. Later, Mei Fu also journeyed here and dreamed one night in a chamber that a man told him: \"During the Zhou, Yi Chang transformed in this mountain’s chamber; his bones are hidden in the Heavenly Well.\" The next morning, he indeed found them in the Heavenly Well—though not yet decayed—and buried them.\n\nDuring the Later Han, Liu Gang, styled Bojing, served as Magistrate of Shangyu. He and his wife, Lady Fan Yunqiao, resided on Four Brightness Mountain and both attained the Way. One day, they ascended Great Orchid Mound’s hill and, climbing a towering tree, soared into the sky.\n\n**Eulogy for Magistrate Liu of Shangyu in Wu**\nThe Magistrate, styled Bojing, named Gang, was a native of Xia’na. He first dwelled on Four Brightness Mountain, later becoming Magistrate of Shangyu. He studied the Dao under Master Bai, and after years of cultivation, his Way was perfected. He invited his kin and friends to gather, and after the feast, he climbed a great cedar tree, over ten *zhang* above the ground. Raising his hand in farewell, he suddenly flew into the clouds and departed. His wife, Lady Fan, also possessed the Dao’s protection, and together they ascended to heaven. Today, White Water Abbey stands as their legacy. These events are recorded in the *Biographies of Divine Immortals* by Ge Zhichuan and the stele of White Water Abbey.\n\n**Eulogy:**\nHow many celestial beings dwell in this dust?\nBound by ears and eyes, they mistake falsehood for truth.\nYet Magistrate Liu ascended to heaven as if visiting a neighbor—\nLike water poured into water, kindred spirits naturally unite.\n\n**Eulogy for Master Kong of the Song**\nThe Master’s given name was You, his style lost to history, a great-grandson of Kong Jingkang. His conduct was so virtuous it moved the gods, and he secluded himself on Four Brightness Mountain in Kuaiji. Once, he saw several hundred *hu* of coins in a mountain valley, indistinguishable from tiles and stones. Woodcutters scrambled to take them, but in their hands, the coins turned to sand and pebbles. A deer, struck by an arrow, once fled to him; he nursed its wound until it healed, then released it.\n\nGovernor Wang Sengqian sought to appoint him as his chief clerk, but the Master could not be swayed.\n\nMaster’s son Daohui was on close terms with Du Jingqi. From youth, he cultivated lofty conduct and carried on his family’s legacy. He secluded himself on South Mountain and never once gazed toward the capital. When the Prince of Yuzhang of the Qi summoned him to serve as West Section Clerk, he did not go.\n\nThe village elders revered and admired him. Daohui’s nephew Zong, his elder brother’s son, was likewise of upright character. When he suffered from cold and hunger and could not obtain clothing or food, the county magistrate Qiu Zhongfu recommended him for the post of Gentleman-in-Attendance to the Prince of Jingling, yet he too refused to go.\n\nThis is recorded in the *Praise for the \"Biographies of Recluses\"* in the *History of the Southern Dynasties*:\nGreedy men chase profit,\nsome even die clutching jade.\nYet he remained unmoved,\ntreating it as mere tile and stone.\nThe pure breeze nurtured his nature;\nhis nephew’s keen discernment followed.\nA single family’s unsullied integrity—\nhis ancestor’s virtue passed down.\n\n**Inscription for Four Brightness Mountain**\nComposed by Wei Su of Linchuan, Serving Gentleman for Rendering Literary Texts, Gentleman for Court Writings, Concurrently Compiler of the Bureau of National History\n\nSeventy *li* south of Yuyao rise two hundred and eighty peaks, bound to the east by Juzhang, touching Tiantai to the south, and embracing Cuiqie to the north. The central peak is the highest, its summit bearing four caverns like open doors and windows, channeling the light of sun and moon—hence the name Four Brightness Grotto-Heaven. Perpetually veiled in clouds, when the First Emperor of Qin ordered his minister Wang Yin to drive mountains and dam the sea, the myriad spirits, wearied by labor, fled into this land, whence it was also called Ghost-Hiding Mountain.\n\nDuring the Han, Liu Gang, styled Bojing, a native of Xia’na, served as magistrate of Shangyu. Later, he dwelled in these mountains and, following the White Lord, attained the ranks of the immortals.\n\nOne day, bidding farewell to kin and friends, he ascended Great Orchid Mound, grasped a towering tree, and soared into the heavens. His wife, Lady Fan, followed him, leaving her sandals beneath the tree, which transformed into a tiger. Word of this reached the court, and a shrine was erected on the site, where spring and autumn sacrifices were offered.\n\nDuring the Song, the recluse Kong You saw several hundred *hu* of coins scattered among the valleys, indistinguishable from pebbles and tiles. Woodcutters scrambled to gather them, only for the coins to crumble into sand and gravel. A deer, struck by an arrow, came to Kong You for refuge; he sheltered it, and once its wound healed, it departed.\n\nIn the third year of the Tianbao era of the Tang, Emperor Xuanzong, deeming the shrine of Master Liu too perilous and remote, commanded the Daoist priest Cui Jie and the scholar Li Jian to rebuild it twenty *li* downslope at the site where Master Liu had cultivated the Dao. In the late Song, the eminent scholar Xie Yichen retired here. Lu Guimeng and Pi Rixiu both visited, composing nine poems each in mutual exchange.\n\nDuring the Zhenghe era of the Song, Emperor Huizong inscribed a plaque reading: *Cinnabar Mountain and Vermilion Waters Grotto-Heaven*. He ordered the construction of a Jade Emperor Hall, employing the methods of Daoist adepts, and cast golden dragons and jade tablets, which remain to this day. The supervision of the temple’s rituals has been passed down through successive generations. In the present dynasty, as part of the state’s veneration of sacred mountains, offerings of incense and silk have been bestowed here as well. Yet the halls have fallen into disrepair, and none have taken heed.\n\nOriginally affiliated with the Three Flowers Abbey of Mount Longhu, the temple was later established in Guangxin. Mao Yongzhen, who succeeded to its care, expanded its buildings, making them worthy of a dwelling for immortals. His disciple, Wu Guohong of Linchuan, requested an inscription in seal script to be carved into the mountain stone. The inscription reads:\n\n*Amidst the peaks of Yue’s mountains,*\n*Stone grottoes gleam like latticework.*\n*When heaven wills rain,*\n*Floating clouds shroud the heights.*\n*The Perfected One ascended, leaving wooden sandals behind;*\n*An ancient cavern murmurs with flowing water.*\n*White cranes circle and wheel,*\n*Or alight beneath canopies.*\n*Jade lads pluck green tangerines—*\n*Whoever eats them shall never die.*\n\nThis inscription was composed by me, Su, to serve as a testament for a thousand years.\n\n---\n\n*Record of White Water Abbey*\n\nDuring the Zhizhi era, I was studying at Mount Longhu when I shared lodgings with Master Zhu Zhenyi of my hometown. His disciple, Mao Yongzhen, attended him closely—reticent, refined, and unassuming. When he withdrew, he would visit me, and we spoke at leisure with ease. Later, he retreated into the mountains of Yuyao, and his voice faded into the distance, beyond hearing.\n\nTwenty-eight years later, his disciple Wu Guohong came to the capital to request an inscription for their abode on Four Brightness Mountain. Only then did I inquire after Master Mao’s well-being. I wrote the inscription as requested. Another twelve years passed, and Master Zhu’s disciple, Xue Yishi, brought forth the engraved mountain map, asking me to supplement what had been omitted. Thus, forty years have passed since I last saw Master Mao.\n\nThough I now draw a salary from the imperial ranks and am mired in worldly affairs, I hear that he drifts aloft in seclusion along the solitary shores of the sea, his mind and thoughts serene, seeking nothing beyond the slightest trace from the world. I can only admire him.\n\nThe matters I have recorded include: Magistrate Liu Gang of Shangyu and his wife attaining transcendence; the recluse Kong You transforming coins and healing the wounded deer; Emperor Xuanzong of the Tang relocating the shrine; Lu Guimeng and Pi Rixiu exchanging poems; Emperor Huizong of the Song inscribing the *Grotto-Heaven* plaque, constructing the Jade Emperor Hall, and casting golden dragons and jade tablets.\n\nAs for the sights at the old shrine, they include Ascension Mountain, Ascension Tree, Southern Cloud, Northern Cloud, and Passing Cloud. The *Gazetteer of Kuaiji* states that Xie Yichen retired at Nanlei; today, there is a Great Thunder Peak, which was not depicted in the earlier map.\n\nThe map includes Three Terraces Peak, Cloudroot Stone House, Dragon’s Whiskers, Washing Medicine Stream, and Murmuring Grotto. The *Gazetteer of Four Brightness Prefecture* records: \"One hundred and thirty *li* to the northeast, the peaks surge into two hundred and eighty, with thirty-six peaks at the center, each direction having its gate. From Yuyao, this is called Western Four Brightness\"—these details I had not previously recorded.\n\nDuring the Song, Wu Zhenyang, a disciple of the Celestial Master Zhang of Empty Tranquility, studied at the Three Flowers Abbey of Mount Longhu under the name *Master of Simplicity*. Emperor Huizong summoned him as Gentleman of the Vermilion Forest and Registrar of the Hall of Concentrated Spirit, but he declined. Liu Gang was enfeoffed as *Perfected Lord of Ascended Mystery and Illuminated Righteousness*, and his consort, Lady Fan, as *Perfected Lady of Ascended Mystery and Wondrous Transformation*. Chancellor Zhang, Duke of Wei, befriended Wu’s disciple Zhu Kongrong and petitioned for his enfeoffment as a Perfected One. Kongrong’s descendants have since passed down the lineage through successive generations—these details I had also not previously recorded.\n\nMaster Mao constructed the Pavilion of Clear Radiance beneath a waterfall and built the Stone Field Mountain Lodge for his repose, which he did after I had composed the inscription. His poetic compositions remain in the mountains. Before Lu Guimeng and Pi Rixiu, there were Meng Dongye and Liu Wenfang of the Tang; in the Song, there were Xie Shihou and others; and in the present dynasty, Huang Wenxian and others. Master Mao intends to carve and transmit these works as well.\n\nAccording to the *Gazetteer of Kuaiji*, the site is commonly called the White Water Palace, though it is also referred to as the White Water Abbey Stele. Since \"palace\" (祠宇) and \"abbey\" (观) are redundant in meaning, it should now be properly termed the White Abbey.\n\nI obtained *Preserving Yue* by the provincial graduate Xu Mianzhi of Panyu, which records the calamities that befell Yue—utter devastation—while the mountains of Siming remained untouched by the winds of war. There, Master Mao wandered freely, savoring his meals and sleeping in peace. Truly, this was the fabled Peach Blossom Spring of old. Thus, I have composed this account to accompany the inscription, and both shall be engraved.\n\nThe Master’s courtesy name was Shanqing; Master Xue’s was Maohong. Those who succeeded them in later years were Pan Wenxin, Sheng Yuanpu, and Xu Yonghe.\n\nOn the first day of the dingwei month in the third year of the Zhizheng reign (1362), this was recorded by Wei Su, Grand Master for Thorough Counsel, Participant in the Deliberation of Government Affairs, Co-Director of the Imperial Academy, and Commissioner for the Review of Memorials from the Four Quarters, of Linchuan.\n\n---\n\n**Preface to the Poems of Stone Field Mountain Lodge**\n\nA hundred li south of Yuyao Prefecture lies Siming Mountain, where the Daoist realm of the Cinnabar Mountain and Vermilion Waters Grotto Heaven is said to reside. The Former Han magistrate of Shangyu, Liu Gang, once cultivated and ascended to immortality here. The abbey is called the Abbey of Sacrificial Halls, while the adjacent dwelling is named Stone Field Mountain Lodge—built by Master Mao Yongzhen.\n\nInitially, the thirty-third-generation Celestial Master Zhang Tian Shi of the Vacuous Tranquility lineage transmitted his arts to Wu Zhenren of the Three Flowers Institute at the Supreme Clarity Palace. Ruan inherited this transmission and dwelled upon this mountain. When Emperor Huizong of Song heard of his virtue, he summoned him, but Ruan declined. Instead, the emperor expanded his residence, which became the abbey. Thus, the abbey traces its origins to the Three Flowers Institute, and the Three Flowers Institute, in turn, regarded the abbey as its ancestral hall.\n\nDuring the reign of our Benevolent Emperor, when the realm was at peace, the two great patriarchs of the Mystical Teachings, Zhang and Wu, served consecutively at court. At the Three Flowers Institute was Master Zhenyi, Zhu Ben, who was renowned among ministers and nobles for his erudition and literary grace. Master Mao became his disciple, and the Master held him in deep affection, while the two patriarchs particularly esteemed him. By imperial decree, he was entrusted with the administration of the Abbey of Sacrificial Halls.\n\nAt the time, the abbey had fallen into disrepair. Since Master Mao took charge, all that was ruined has been restored, and all that was dilapidated has been renovated. Nearly forty years have passed, yet his diligence remains unwavering, as if it were but a single day. Such is the order he has brought to this place.\n\nIn his leisure hours, he would retreat to his mountain chamber, where he would burn incense and sit in tranquil repose, allowing no external concerns to burden his mind. Surrounding him were towering cliffs and sheer precipices, with cascading springs and waterfalls spraying and intersecting, their force like a suspended river. Below lay jagged rocks, ridges stretching in every direction, fields and furrows of myriad forms—all composed of stone. There grew calamus, *he che* (fleeceflower root), lingzhi mushrooms, and cocklebur, which could be gathered as needed. The crops of rice, millet, and sorghum barely yielded a tenth or a fifth of their potential. Thus, the place was named \"Stony Fields.\"\n\nXue Jun, styled Yifu, who had also studied under Master Zhenyi, lived in seclusion on White House Mountain. The mountain lay near the Supreme Clarity Abbey, and upon visiting Stony Fields, he delighted in its secluded beauty and was the first to compose a poem about it. Traveling to the capital, he spoke to the literati and officials, saying: \"Stony Fields is a place of surpassing beauty, and Master Mao is a man of true worth. I, too, shall grow old there.\" Thereupon, each composed a poem, and several dozen were collected. They were presented to my uncle, Master Guan, who expounded on the Daoist principle of \"knowing the male but keeping to the female.\" Only those who grasp this transmission can attain emptiness and embrace simplicity, forsaking the splendor of prosperity and luxury to find contentment in solitude and rustic remoteness, thereby preserving their spirit, nurturing their authenticity, and safeguarding their person—thus enriching the Dao. Master Mao is nearly such a man.\n\nIn times of peace, people exhaust their energy and wit in pursuit of fertile, expansive lands, erecting grand and magnificent structures—such was the way of the world. Compared to Stony Fields, the difference is as vast as that between heaven and earth. Yet after a decade of war, the once-wealthiest regions of Yangzhou and Henan, which had surpassed all others, were ravaged and stripped bare. Where once lay eastern paths and western lanes now stretched only wild grass and smoke. Where once stood warm halls and heated chambers now lay crumbling walls and shattered foundations. Could one even hope to find a place resembling the mountain chamber of Stony Fields? Herein lies the wisdom of Master Mao. This is how one recognizes those who have truly inherited their master’s teachings.\n\nRespectfully, I have written this preface and, through Master Xue, present it here.\n\nComposed on the first day of the tenth lunar month in the winter of the twenty-first year of the Zhizheng era by Lu Jian of Linchuan.\n\n**Poem by Tang Worthy: \"Seeing Off Daoist Master Xiao Returning to Siming Mountain\" by Meng Jiao of Dongye**\n\nLeisurely as a solitary crane’s heart,\nVast as the age of a towering pine.\nEmerging beyond the myriad things,\nHe dwells high on Siming’s peak.\nA thousand fathoms of sheer, aligned peaks,\nA hundred-foot cascade of plunging springs.\n\n**Poems on Siming Mountain**\n\n**\"Feeding on Red Snow\"**\nRed snow serves as my meal,\nWhite clouds as my fields.\nIn silence, I shun worldly speech,\nMy numinous traces often tread the heavens.\n\n---\n\n**\"Wandering the Four Windows\"**\n*By Liu Wenfang (Changqing)*\n\nSiming’s peaks are wondrous rare,\nSince ancient times, famed for climbers’ tread.\nAzure cliffs stand skyward-pressed,\nOverhanging stones like roofs o’erhead.\nLatticed windows open wide,\nFour vistas clear in light outspread.\nThe Winnowing Basket spans the southern wilds,\nThe Dipper hangs above the eaves to north.\nSun and moon dwell east and west,\nAt dawn and dusk they rise and set.\nI come to wander here,\nMy pride half-wrapped in cloth’s embrace.\nWhite clouds, without fixed intent,\nDrift idly with my solitude.\nFacing this, I cast off worldly bonds,\nInstantly forget both glory and disgrace.\nI laugh aloud—the earth is vast,\nA fairy breeze stirs jade at my waist.\n\n---\n\n**\"Nine Songs\"**\n*By Lu Luwang (Guimeng)*\n\n**Stone Window**\nWhere may one see the Stone Window?\nA thousand fathoms high, it leans on empty sky.\nGathering mists obscure its jade-green lattice,\nFading glow stirs its patterned tracery.\nThe mountains seem to array their rounded charms,\nThe palace nears the square Cauldron’s side.\nOnly the Three Peaks’ recluses,\nFrom time to time, come here to collate their hidden texts.\n\n**Passing Clouds**\nI visit a stretch of cloud,\nWhere mist runs deep and paths barely part.\nThe whistling terrace shifts with the sun,\nThe woodcutter’s axe carries on the wind.\nAt dawn, my robes are soaked through,\nThe cold sobers wine’s warmth.\nHow many times has my longing for home stilled,\nOnly to glimpse Su Jun in my hair’s reflection.\n\n**Southern Clouds**\nSouth of the clouds lies yet another stream,\nWhere cinnabar gravel bears no trace of mud.\nHerbs are sold by Ba merchants,\nBranches teem with Yue crows’ cries.\nAt night, the moon rises before midnight,\nAs autumn nears, I ask if the mists deceive.\nIf I could dwell in these mountain hues,\nI’d pluck lingzhi and ferns with my own hands.\n\n**Northern Clouds**\nNorth of the clouds, near Yang Creek,\nDwellings cling to ravines in a chain.\nAltars stand beneath the stars,\nPavilions brush the green-tinged heights.\nHalf the distant peaks are veiled in rain,\nThree ancient wells hold lingering smoke.\nIf a path to Golden Court exists,\nIt must lead to the Left Spirit’s realm.\n\n**Deer Pavilion**\nBeneath the Deer Pavilion’s crags,\nI often lead white deer past.\nFine grass invites long slumber,\nFragrant springs beckon deep draughts.\nBy sound, I find the moonlit dell,\nBy path, I reach the mist-wreathed vines.\nSoon, I’ll drink the golden elixir,\nAnd ride aloft to the Crimson River.\n\n**Fan Pavilion**\nWhen was this ancient pavilion built?\nIts master, they say, soared with the sun.\nTo this day, mountain recluses tell\nHow he sometimes rides a jade unicorn home.\nMilk-like sap drips from tender pines,\nLingzhi platforms rise from subtle stone.\nLeaning on the rail, my gaze strains far—\nNo sign of feathered robes in flight.\n\n**Chanyuan Grotto**\nA flying waterfall pours from cloud-roots,\nIts murmuring voice eternal.\nLike twin flutes blown in harmony,\nOr a zither played at sunset’s glow.\nIt churns dragon-spittle through inverted caves,\nSplashes crane’s robes through pines it pierces.\nWho will play its moonlit tune?\nSurely one who chants the Upper Clarity’s hymns.\n\n**Green Lattice Fruit**\nThe mountain’s fruit is called Green Lattice,\nGrowing in ordered ranks around the ridge.\nIts outer form rivals green jade’s hardness,\nIts inner savor vies with jasper’s bloom.\nWoodcutters’ children gather fallen ones,\nTapping the grove to startle roosting crows.\nSurely immortal officials guard it,\nOffering it now and then to the Celestial City.\n\n**Juhou (Macaque)**\nWhy is it called Juhou?\nFirst enfeoffed here in Siming’s bounds.\nThey drink with linked arms,\nNever uttering heart-rending cries.\nWild vines trail their slender tassels,\nCold springs grind jade’s purity.\nAmid the grove, wandering officials—\nWho among them will become a lord?\n\n---\n\n**\"Stone Window’s Skin\"**\n*By Jiaorizi (Biaomei, courtesy name Xiuru)*\n\nThe window opens by the Dao’s own will,\nRevealing distant azure cliffs.\nMoss weaves patterns like damask,\nClouds drift as if through gauze.\nWithin the lattice, the moon spills empty light,\nAt the sill, no rosy glow lingers.\nI wonder where it leads—\nIt must connect to the Jade Maiden’s home.\n\n---\n\n**\"Passing Clouds\"**\nA powdered grotto stretches twenty leagues,\nWhere recluses tread its heart.\nFor a moment, deer tracks vanish,\nA single step parts human voices.\nWith my staff, I part the mist’s green,\nWith my sleeve, I brush the faint glow.\nLong have I wandered without circling back—\nI fear I’ve entered the Celestial City.\n\n---\n\n**\"Southern Clouds\"**\nSouth of the clouds, a river flows,\nNo crows alight before the peaks.\nVillage gardens bloom with red peonies,\nHouseholds draw from white springs.\nChildren all seem ancient,\nMarriages like those of immortals.\nTogether, they form true official households,\nNever taxed on their stone fields.\n\n---\n\n**\"Northern Clouds\"**\nNorth of the clouds, the day is dim,\nI wonder if I’ve turned my back on the Star of Longevity.\nDogs know the scent of herbs,\nPeople trace lingzhi’s form.\nResting in the wild, beneath pine canopies,\nDrunk, I write on lotus-leaf stone screens.\nIf I burn incense and dwell here,\nI should gain entry to Golden Court.\n\n---\n\n**\"Deer Pavilion\"**\nDeer grass thrives here,\nSo I pass through white clouds’ eaves.\nI wait long by blossoms for the doe,\nLead dust slowly through bamboo.\nFor hours, I drink from jade streams,\nAll day, I savor golden lingzhi.\nLiving beneath the Stone Window,\nI become an immortal unawares.\n\n---\n\n**\"Fan Pavilion\"**\nThe master became one of the ranked immortals,\nHis pavilion alone remains.\nStone grottoes echo with human barks,\nPine winds startle sleeping deer.\nThe well’s fragrance is the great elixir,\nThe crane’s call is an empty tale.\nI’d buy this place to hide again,\nBut cloud-capped peaks demand no coin.\n\n---\n\n**\"Chanyuan Grotto\"**\nWater flows from a ten-thousand-fathom source,\nAll day it cascades in murmuring streams.\nIt shatters a full moon’s disc,\nMelts half the sky’s expanse.\nIts sound rouses the valley’s breath,\nIts force whirls clouds to drink.\nI imagine a late autumn night,\nWhen all the ancient immortals gather by its flow.\n\n---\n\n**\"Green Lattice Fruit\"**\nMountain winds ripen this wondrous fruit,\nNightly offered to true immortals.\nIts taste rivals cloud-fat’s richness,\nIts shape like jade brains, round.\nWild cranes gather where it’s plucked,\nHalf its fall lands in numinous springs.\nIt must share the Peach Blossom’s lineage,\nBlooming without reckoning years.\n\n---\n\n**\"Juhou\"**\nHow enviable is Juhou’s realm,\nWith jade-green cliffs in countless folds.\nMist-wreathed vines serve as seals and sashes,\nHoneyed fruits are its domain’s bounty.\nThe masses send the Monkey Lord to ferry them,\nFruit is commanded to serve the young.\nIf you, too, do not die,\nYou should ascend to the Dark Mystery’s school.\n\n---\n\n**\"Song of the Waterfall\"**\n*By Xie Shihou (Jingchu)*\n\nA flying spring leaps green cliffs,\nTowering thousands of fathoms high.\nIt rushes down from the heavens,\nSeeming as broad as bolted silk.\nA winding ridge parts the verdant woods,\nIts roar reaches me first.\nBeside it stands a giant stone,\nSmooth and hollow, fit for repose.\nVulgar men never come here,\nBut we have come to savor its sight.\nWe must wait for autumn’s clarity,\nThen climb the vines to draw near.\n\n---\n\n**\"Wandering Siming\"**\n*By Sun Jihe (Yingshi)*\n\nAll my life, I’ve cherished distant longings,\nStroking my sword, I wander far.\nNow, I cast off the world’s clamor,\nMy heart conspires with cliffs and ravines.\n\n**Wandering Far and Wide**\n\nI bound my travels to sail the azure sea,\nSouthward, I marveled at the crimson isles of Danqiu;\nWestward, I climbed Min and E, letting forth a long whistle,\nNorthward, I gazed toward Guan and Long with sorrow.\n\nKang and Lu pulled at my returning reins,\nWu Gorge coiled my drifting boat.\nSword Pavilion stood most perilous and grand,\nDragon Gate even more wondrous and secluded.\nThough my journeys were not yet sated,\nI had gathered a glimpse of their finest scenes.\n\nOf late, I lie by Bamboo Lake,\nMy clear dreams ever lingering in ease.\nMy homeland is the Four Bright Mountains,\nIts name famed across the Nine Provinces.\nWhen I step out, it seems ever before my eyes,\nYet each time I wish to go, my desire goes unfulfilled.\nWorldly affairs are truly perverse,\nDoes the mountain spirit bear me ill will?\nThe nearer I draw, the more it seems to mock,\nIn my old age, I reproach myself in vain.\nNow, in the height of fragrant spring,\nI meet kindred hearts and find good company.\nFortunately, provisions are easily gathered,\nAnd with swift steps, I pursue my longing.\n\nAt midnight, the rain’s sound ceases,\nBy dawn, the clearing skies float bright.\nThe heavens stretch vast and gleaming,\nThe wind’s breath gentle and mild.\nWith a slender staff, I grasp my bamboo sedan,\nIn rustic garb and light fur.\nFrom afar, I point toward the forest’s edge,\nJoyfully listening to the flowing springs.\n\nI test my clogs on Green Mist Ridge,\nRest by White Water’s melancholy shore.\nFlying rapids roar with rushing streams,\nStrange pines sway with whistling winds.\nAlas, ascending Goat’s Brow,\nI pant as if feeding a tiger’s head.\nI cling to rocks to guard against the year’s end,\nBearing firewood, I sing of the Dao’s circuit.\n\nA hundred turns, yet each glance brings delight,\nA thousand leagues stretch before my eyes.\nHow the peaks and ridges intertwine,\nTheir veins and sinews entwined.\nThe Creator’s artistry fuses and shapes,\nDivine craftsmanship carves and searches.\nA long wind stirs the twilight sea,\nMighty waves toss Yingzhou Isle.\nMinisterial turtles emerge, bearing their burdens,\nWandering dragons coil in sinuous paths.\nWhales and roc birds frolic and surge,\nFish and insects teem in dense throngs.\nA myriad wonders rise and fall,\nA thousand sails pass and linger.\nSome lie flat as a table,\nOthers tower like a crown or cap.\nSome stand arrayed like swords and halberds,\nOthers are carved like spears and pikes.\nSome dance like phoenixes,\nOthers gallop like post horses.\nSome play like cunning glances,\nOthers grapple like jade and marble.\nSolemnly, they seem to open a grand hall,\nWhere jade and silk greet the feudal lords.\nMajestically, they gather at Qiyang,\nA great encirclement in full pursuit.\nFierce battles rage near Changping,\nStalwart defenses hold Honggou’s divide.\nThe open plains array chariots and cavalry,\nThe central camp stands firm with drum and song.\n\nThe vastness of creation stretches boundless,\nIts transformations endure through endless time.\nStartled, I gaze but cannot speak,\nHow could mere form ever compare?\nA sacred tree, forty spans in girth,\nIts coiled roots aged for thousands of autumns.\nThough its old trunk withers, it does not die,\nNew verdure flourishes in emerald hues.\nThe wind’s chariot surely comes and goes,\nWill the mulberry fields soon prove the tale?\nThe legends of its traces are well attested,\nBut how could one lightly ascend to such heights?\n\nSoutheastward, I traverse lofty ridges,\nOn either side, level fields unfold.\nVillages scatter dogs and chickens,\nHamlets send forth sheep and cattle.\nOfficials collect firewood and charcoal,\nSpring labors urge hoes to toil.\nThe soil is rich, with little sand or stone,\nThe air is cold, and wheat does not sway.\nWild paths flank peach and plum trees,\nDense shade opens to pines and cypress.\nHere, one could escape the world—\nWhy seek further refuge by boat?\n\nTwin cliffs descend in sheer walls,\nSeparate peaks vie for sunlight.\nWho says the two monasteries are not sublime?\nHow could I turn back midway?\nWith my staff, I scale perilous heights,\nSnowy Abyss still bars the way.\nMorning clouds hang thick and still,\nDaytime winds whistle and howl.\nI cross winding steps over a square bridge,\nVast halls connect to soaring towers.\nPearls and jades interlace with embroidered patterns,\nGold and azure gleam on vermilion eaves.\nThe bell tolls for a thousand fingers,\nThe wooden clappers sound with a hundred lamps.\nTruly, this is a heavenly abode,\nUntouched by mortal cares.\n\nAll around, beauty abounds,\nI wander and explore to my heart’s content.\nDistant peaks echo in resplendent hues,\nThe brocade mirror’s waves shimmer and flow.\nTwo streams rush with lively murmurs,\nA thousand fathoms cascade in sparkling falls.\nDeep cataracts mark their radiant paths,\nHidden pools cradle rainbows.\nLooking down, I shudder with vertigo,\nBending to scoop water, its clarity refreshes.\nValley grasses pile high and low,\nRock flowers bloom in wild profusion.\nOn the cliffs, agile gibbons dart,\nDeer call as they feast on lingzhi.\nThe long day resounds with orioles’ songs,\nMisty shadows echo the cuckoo’s cry.\nTall bamboos play the pipes and zither,\nFine streams murmur with jade-like tones.\nThe magpie’s chatter brings joy,\nThe turtledove’s call forebodes rain.\nWhere shall I share my alms bowl?\nFor now, I offer tea in a simple cup.\n\nThe old monk delights in conversation,\nA man of renown, he welcomes my visit.\nAt ease, I lodge in his mountain chamber,\nSleepless, I listen to the night watch’s tally.\n\nI recall when I was ten thousand leagues away,\nNow I reach this corner of the heavens.\nAscending, I behold the world’s vastness,\nRevering the years’ passage.\nHonor and disgrace are but snail horns,\nGatherings and partings like sea gulls.\nThe dust’s harness binds me,\nThe arena of fame pits me against rivals.\nI heed not the gibbons’ and cranes’ laments,\nYet I shame the springs and stones.\nMy heart’s desire is at last fulfilled,\nWhile the world’s chariot still outpaces me.\nI learn from Zhi and Xu’s refined tastes,\nMy extraordinary path is not like Ruan’s or Liu’s.\nHow timely, like the pheasant on the mountain beam,\nHow joyful, like the minnows in Zhuangzi’s stream.\nI briefly follow Xinggong’s rhapsody,\nI do not wish to be imprisoned like Liuzi.\nCome, my learned friend,\nPlay for me the *shang* mode’s melody.\n\n---\n\n**Ode to the Ascending Immortal Tree**\n*By Liu Fan*\n\nThis cicada-shed tree ascends to immortality,\nIn its prime, it already pierced the heavens.\nIts jade-like bones half-withered, yet still lustrous,\nIts ancient bark newly grown, ever fresh.\nPeaches of immortality ripen every three thousand years,\nBronze guardians polish it for five hundred more.\nThe crane has not returned, the mountain lies still—\nWho lingers to ask of its origins?\n\n---\n\n**Ode to the Green Lingzhi**\n*By Shi Xi*\n\nRecalling its recent return from the imperial court,\nUnspent joy lingers as the tortoiseshell banquet unfolds.\nDrunken, I cast the green spores upon fragrant earth,\nLeaving them for the immortals to plant at their leisure.\n\n---\n\n**Visiting Master Hunpu, the Venerable Hao**\n\nIn what year did you hide in the Four Bright Mountains,\nCutting all ties with the world?\nThe sagely lord leaves his seat vacant,\nYet you refuse to enter the city.\nWind and thunder rise from the earth,\nPalaces form by heaven’s will.\nGladly, your bamboo sedan rides steady—\nWhy fear the coming of white hair?\n\n---\n\n**Inscribed While Traveling the Four Bright Mountains: Dan Mountain**\n*By Tang Jingshi*\n\nThe Four Bright Mountains gleam, chilling the nine skies,\nFairy gardens where immortals daily come and go.\nWaterfalls plunge from the Silver River’s distant flow,\nCave gates remain sealed in idle white clouds.\nDeep cliffs nurture auspicious trees with golden veins,\nLofty peaks bear sacred fungi with iron-hued spots.\nCountless relics lie unrecognized—\nFallen blossoms drift on murmuring streams.\n\n---\n\n**Traveling Dan Mountain**\n*By Sun Yuanshi*\n\nThe Four Bright Mountains rank ninth among cave heavens,\nThe mighty spirit cleaved stone to open windows and doors.\n\nClutching vines and tracing wheel-ruts, undaunted by toil,\nI journey with Master Kun, a friend beyond years.\nAncient moss guards the stones where gray tigers repose,\nA flying waterfall hangs from cliffs where jade dragons roar.\n\nSuddenly, man and scene alike transcend,\nDrunk, we sing and beat jars, heedless of rank.\nI know well the heavens within the gourd—\nNot all who drink are truly lost in wine.\n\nWandering beneath the moon, I linger, forgetful of return,\nWorldly affairs like floating clouds—what are they after all?\n\n---\n\n**Another Poem**\n*By Sun Gengkuan*\n\nWith guests, I explore the depths of wonders,\nTogether we ascend Whitewater Mountain.\nSilver waves churn as the moon descends,\nAzure cliffs lean against the cold sky.\nGathering herbs, we thread through clouded ravines,\nPlaying weiqi, we sit upon a stone altar.\nForgetting the late hour of return,\nI pluck orchids to fasten at my belt.\n\n---\n\n**Another Poem**\n*By Feng Xia Yin*\n\nFor ages, the caves of Dan Mountain,\nToday, at last, I wander through.\nWaterfalls, high and cold, crash like driven snow,\nAncient cliffs, in twilight, seem autumn’s hue.\nTamed tigers follow immortals away,\nA lofty hall preserves their lingering forms.\nI regret my return too swift—\nI’ve yet to seek its hidden depths.\n\n---\n\n**Ode to the Waterfall**\n*By Guo Baiyun*\n\nAll day I watch, never weary,\nMy spirit cleansed, my bones feel immortal.\nA night’s rain swells its roar,\nA hundred cliffs’ springs surge in might.\nTurning stones, thunder shakes the ravine,\nFrom sheer cliffs, a sword points to heaven.\nEnamored of wonders, I forget my age,\nStill longing to climb the perilous peak.\n\n---\n\n**Another Poem**\n*By Zhao Danshan*\n\nJade dragons roar, and mountains part,\nRaging torrents surge, churning cliffs.\nA whirlwind could become flying rain,\nTogether we hear ten thousand gorges roar like spring thunder.\n\n---\n\n**Another Poem**\n*By Zhao Zhuyi*\n\nThe cold spring flies, its first sound like the Zhe River’s tide.\nBeneath pines, though rainless, clouds remain moist,\nOn stone treasures, though clear, snow lingers unmelted.\nA white silk banner hangs from sheer cliffs,\nA rainbow of a thousand feet spans layered skies.\nDan Mountain is itself an immortal’s abode—\nThe Weak River’s flow comes not from afar.\n\n---\n\n**Another Poem**\n*By Monk Leiyuan Yuanqiu*\n\nMy eyes fill with flying bright snow,\nOn Dan Mountain, a white rainbow appears.\nHeaven’s mechanism hangs, never exhausted,\nEarth’s axis rolls, boundless.\nRippling, it sinks like cold jade,\nScattered, it drifts on the dawn wind.\nIf asked where it alights—\nIt must reach the Dragon Palace.\n\n---\n\n**Inscribed on Dan Mountain, Presented to Recluse Shitian**\n*By Huang Jinqing of the Yuan Dynasty*\n\nBeyond Shitian’s history, Dan Mountain dwells,\nSuch streams and peaks matched with such a man.\nLong has lofty verse lacked Pi Rixiu’s touch,\nYet the pure wind returns, as in Xie’s dust-free days.\nBefore his gate, flying waterfalls ever churn snow,\nAt his cave’s mouth, delicate flowers briefly hold spring.\nOld, I return from the capital to seek seclusion—\nWhen may I hold my zither and daily draw near?\n\n---\n\n**Inscribed on the Waterfall**\n*By Liu Dexuan*\n\nThe Whitewater Immortal once rode a crane—\nIn what year did he shed his bones upon this mountain?\nTransformed into a jade ribbon, it hangs a thousand feet,\nThe Silver River overturned, falling from midair.\nAt dawn, the crane’s dream lingers in the moonlit canopy,\nAt night, the merfolk tug at the crystal palace.\nA visitor from Tiantai finds his poem unfinished,\nHis thoughts of return bound by jade towers and paired gates.\n\n---\n\n**Another Poem**\n\nFrom mid-heaven, the waterfall descends upon the jade terrace,\nA white silk banner hangs—how strange!\nThe Weaving Maid casts her loom, unable to gather it,\nChang’e cuts the water, skillfully tailoring its form.\nIts light connects twin gates, stirring the starry river,\nIts roar carries a thousand mountains’ wind and rain.\nBefore the shrine and cave, I gaze, unsatisfied—\nAgain, I follow the bright moon past Tiantai.\n\n---\n\n**Seeing Off Mao Shitian to Reside at Whitewater Palace**\n*By Zhang Boyu*\n\nGirding his sword, he dwells on Dan Mountain,\nHis sleeves like wings, riding the wind.\nThe empty altar remains desolate,\nThe flying waterfall cascades in murmurs.\nMeager offerings make a poor host,\nThe mountain’s depths leave no gate closed.\nAtop the thousand-fathom peak of Great Orchid,\nOne day, he shall meet Liu and Fan.\n\n---\n\n**Inscribed on Whitewater Palace**\n\nTwo immortals rein in their steeds upon the azure void,\nTheir ancient fame flows on, their traces yet unclear.\nThe Whitewater Master transmits the Jia and Yi,\nA green lamp keeps me through the Gengshen night.\nFrom cloud-rooted cliffs, the waterfall falls, ever mistaking rain,\nAt the cave’s mouth, flowers bloom, naturally embracing spring.\nTurning back, the human realm is but dust—\nBest to bind straw sandals and make Dao my neighbor.\n\n---\n\n**Another Poem**\n*By Zhao Junzhang*\n\nOnce with woodcutters, I returned from gathering herbs,\nFrom afar, on cinnabar cliffs, white clouds piled.\nThrough a hundred thousand kalpas, the immortal’s wind endures,\nFrom thirty-six streams, spring waters come.\nJade halls, in their time, permit carefree laughter,\nMy staff, dampened, ascends towering peaks.\nThe cave’s gate, deeply sealed, unknown to all—\nIt must have opened after Liu and Fan’s departure.\n\n---\n\n**Another Poem**\n*By Gao Zecheng of the Ming Dynasty*\n\nIn the Four Bright Mountains, after spring rain,\nBeneath the Three Terraces Peak, I seek an immortal’s abode.\nClouds part, emerald jade floats beside golden palaces,\nThe wind stills, the Silver River descends from the Jade Void.\nAt night, the secluded cave glows as cinnabar transforms cranes,\nBy day, the clear stream rests as otters watch fish.\nI entrust you to ask after Liu and Fan’s news—\nA blue bird from the west would bear a letter well.\n\n*(Note: The \"Liu and Fan\" refers to legends of two immortals who once played tricks—Liu spat water to form fish, Fan spat water to form otters.)*\n\n---\n\n**Another Poem**\n\nDan Mountain’s wonders coil, unmatched under heaven,\nLayered streams and towering peaks—few travelers tread.\n\nThe millennia-old shrine nears the celestial vault,\nA hundred-foot cascading spring sways in the evening glow.\nJade lads play their flutes, their light lingering at the door,\nImmortal maidens pay homage to the True—clouds clothe their robes.\nI arrive, stay two nights, stirred by clamor and reflection,\nWhen shall this restless world cease its scheming?\n\n---\n\n**Another Poem**\n*By Monk Baiyun, self-styled Ziyue*\n\nI hear the Stone Fields delight in wonders,\nBeneath the Pavilion of Clear Radiance, I often forget to return.\nAre there none with flying pendants who ascend the cinnabar summit?\nYet auspicious clouds at times shield the verdant peaks.\nSpring rain graces the peach blossoms with fragrance, soft and lingering,\nAutumn winds caress the jade trees, their green leaves swaying gently.\nTwo years past, I passed the immortal elder’s dwelling,\nAnd saw the white waters flying west of the cliffs.\n\n**To the Historian Mao of the White Water Palace**\n*By Song Wuyi of the Yuan Dynasty*\n\nIn my lifetime, I’ve never set foot beneath Dan Mountain,\nYet in my hometown, I’ve only heard the name of White Water.\nThe path into the grotto-heaven spans less than a hundred li,\nMy journey through the immortal realm fulfills three lifetimes.\nFlowers converse with cranes and flutes as spring clouds swirl,\nBy the water’s edge, pavilions and terraces gleam in the morning sun.\nI send word to Historian Mao of the Stone Fields:\nLet us meet when the days grow warm to carve yellow essence.\n\n**On the Waterfall**\n*By Sun Daoxin, styled Shizhi*\n\nThe jade dragon battles, its strength spent and scattered,\nHanging inverted from Dan Mountain, it cannot take flight.\nWith the fury of thunder and the roar of lightning, it gathers its might,\nBursting forth as silver threads of water across half the sky.\nThe silver threads stretch far, the waters run dry,\nCold light unmoving, the mountain moon solitary.\nThe two cliffs part as if the earth’s axis turns,\nA ten-thousand-zhang plunge—no fish in the abyss.\nIn the sixth month, snow flies, untouched by summer’s heat,\nIt clears my spirit, and I yearn for the immortal’s song.\nLiu and Fan ascended together in those bygone years,\nAncient trees pierce the heavens, just as they were then.\nThough few are heard of who dwell here now,\nThere are still those of uncarved simplicity, true men.\nThe grotto remains open, its cinnabar qi still warm,\nCranes return, speaking of the Peach Blossom Spring.\nI entrust you to sing the *Zhaoyin* melody,\nAt dusk, pillowing on the stream in the mountains.\nCome morning, share with me a single ladle’s worth,\nTo wash away the world’s dust by the myriad *hu*.\n\n---\n\n**Another Poem**\n*By Zhu Jingchun, styled Jiong*\n\nMy life bears a fondness for mist and rosy clouds,\nLeaning on my staff, I gaze at the mountains time and again.\nThe stone cavern opens, and the cinnabar phoenix departs,\nThe waterfall flies, transforming into a jade dragon.\nRiding the wind, it scatters snow across half the sky,\nWithout rain, it roars like thunder through ten thousand valleys.\nI alone envy Historian Mao of the mountains,\nWho in seclusion has truly found a lesser Penglai.\n\n---\n\n**Another Poem**\n*By Chen Bangxie, styled Yong*\n\nFrom whence does the water come?\nFlowing forth from the white clouds’ embrace.\n\n**Spraying a thousand feet of snow,**\n**Crashing like thunder through ten thousand valleys.**\nThe Daoist’s bones are pure and clear,\nSeated guests grow cold, free of dust.\nWith a laugh, he descends the mountain,\nHugging his zither, treading home by moonlight.\n\n**Inscribed at the White Water Palace**\nThe *Hongbao* of the pillow is surely worth transmitting,\nLiving near the Cinnabar Mountain’s ninth heaven.\nNear and far, I often seek beyond clouds and waters,\nMy name should be carved upon the stone cliffs.\nAfter rain, the waterfall’s roar is heard at night,\nThe cinnabar furnace stays warm, uncounted by years.\nFrom time to time, a pot of wine, a song,\nLet them call me an earth-wandering immortal.\n\n**The Clear Radiance Pavilion**\nA frost-edged bowl, thoughts peerless,\nThe pavilion brims with poetic scenes, free of dust.\nFine mountains face me, unfolding emerald,\nLiving waters at their source paint white clouds.\nAn iron flute summons the toad, cold stirs,\nA jade sheng calls the crane as night begins.\nInspired, I pace with my long sword,\nAt times a divine light shoots toward the Dipper’s pattern.\n\n**Inscribed at Cinnabar Mountain**\n*By Gao Boyuan, styled Yi*\n\nCinnabar Mountain, Red Waters—a divine immortal’s abode,\nWith cloth saddle and green shoes, I make a fine journey.\nA hundred-foot flying spring, silver river snow,\nA single crane’s cry, autumn in the grotto-heaven.\nGreen *lingzi* ripen, the cloud altar still,\nJade trees bloom, the stone chamber deep.\nEndless streams and peaks hold splendid feasts,\nWhen shall I build my hut among these woods?\n\n**Another Poem**\n*By Chen Lǚchang, styled Kelǚ*\n\nMing’s vastness opens a stone window,\nWithin stands an immortal’s white jade terrace.\nA stream flows far from the heavens,\nThree terraces rise high before the grotto.\nThe old man’s gaunt bones seem a dragon transformed,\nDense bamboo’s cool shade awaits the phoenix’s return.\nEach time I seek wonders by Yin River,\nHere I find Penglai instead.\n\n**Another Poem**\n\nClad in iron, riding a steed over green moss,\nSuddenly I knock at the immortal’s gate, the stone grotto opens.\nThe azure sky’s autumn sounds hang as white water,\nPurple clouds’ spring hues descend from the cinnabar terrace.\nMaster Liu long ago rode a simurgh away,\nMagistrate Han still comes astride a crane.\nWine cups meet, our pure joy overflows,\nNew poems sung, we linger again.\n\n**Another Poem**\n*By Wang Jingzhong, styled Zhong*\n\nFour windows frame mountains fair enough to grasp,\nA stone house clings to cloud roots, towering and bright.\nIn the woods, a lost crow once turned into a tiger,\nIn the grotto, a bowing monkey seems almost human.\nA rushing torrent plunges thousands of feet,\nHigh steps now span over forty springs.\nDivine light nightly illumines the cinnabar chamber,\nSurely immortals come and go often here.\n\n**Another Poem**\n*By Yuan De, styled Jiyamuding*\n\nFamed mountains of Yue are known to the world,\nThe four-windowed immortal realm surpasses all.\nHalf the blue sky falls as the Silver River’s waters,\nThe white sun lingers past emerald ridges’ clouds.\nBeyond dust, phoenix songs call recluses,\nIn the woods, tigers and crows await the Primordial Lord.\nKnowing I never tire of climbing mountains,\nYou long allow me to seek you, free of worldly taint.\n\n**Another Poem**\n*By Lin Xiyuan*\n\nI once heard of Immortal Liu,\nWho served as magistrate of Shangyu.\nFor years he nurtured his spirit’s elixir,\nGathering divine herbs at will.\nOne day he rode a flying simurgh,\nSoaring past towering trees into the blue haze.\nLooking down upon the mortal realm,\nHow many mulberry fields had turned to seas?\nAlas, my bones remain unchanged,\nHow can I embrace such radiance?\nHis lofty footsteps linger among men,\nDeep longings shared across a thousand years.\n\n**Another Poem**\n*By Wang Chenliang, styled Wenjing*\n\nCinnabar Mountain, since ancient times an immortal’s dwelling,\nEspecially wondrous, set apart from the world.\nA hundred-foot hanging spring flies like a serpent,\nA thousand-year-old crow transforms into a tiger.\nPavilions still recall the flute’s song,\nLingzhi and trees long sustain grain-avoiding disciples.\nI wish to drive a firewood cart to visit true recluses,\nBut wonder if the mortal dust will allow me.\n\n**Another Poem**\n*By Yang Yuanqing, styled Huan*\n\nAn immortal soars through the sky on a jade dragon,\nLeaving divine traces still in the mountains.\nPassing clouds, I pick green *lingzi*,\nSeeking the waterfall, I find the White Water Palace.\nWarfare not yet stilled on this day,\nSuddenly I hear bells and drums, revering the mysterious Dao.\nShedding the world should not be hard,\nFor I once met a cloud-dwelling herb-gathering elder.\n\n**Another Poem**\n*By Ma Yizhi, styled Naixian*\n\nLong dwelling in the city, I recall the grotto-heaven’s name,\nOn a spring day I ascend, staff and sandals light.\nMountain rain clears, the cliff’s waterfall sings,\nRock flowers fade, the stone window brightens.\nA yellow-crowned white-haired man, his heart ancient,\nWild waters and idle clouds, their intent pure.\nI would go seek Magistrate Liu,\nWishing to bring my wife and children to learn long life.\n\n**Another Poem**\n\nA distant path leads straight to the White Water Palace,\nPeaks stand tall like green lotuses.\nA flying stream hangs like a thousand-foot silk,\nFrom the heights, I climb three or four more summits.\nSometimes I hear otters chasing fish,\nOnly immortals ride cranes in procession.\nAfter ten days wandering these mountains,\nI seek *lingzong* north and south of the clouds.\n\n**Another Poem**\n\nThe White Water Immortal has gone, never to return,\nPurple and green palaces lean against the clouds.\nA cliff suspends a waterfall like a silver sash,\nThree peaks array like emerald mounds.\nHerb-gathering immortal boys follow cranes,\nTame deer with flowers in their mouths come to men.\nNow I know this wondrous realm is not of the mortal world,\nLet us share pure verses, seated on stone moss.\n\n**Inscribed at Cinnabar Mountain**\n*By Yang Bianmei*\n\nThe Four Bright Mountains, two hundred eighty green peaks,\nHeaven’s four windows, where sun and moon rise and set.\nThis is the ninth heaven of the thirty-six grotto-heavens,\nA separate Cinnabar Mountain, Red Waters, not of men’s world.\nI dreamt of Immortal He the Mad Guest,\nWho went to visit Cloud-Crest Master,\nClimbing the solitary summit’s great orchid.\nBelow, I saw vast waves like the sun’s chariot wheel,\nRainbow light and mirage shadows swirling, billowing upward.\nThere was a Peach Blossom Beauty,\nWho fed me phoenix marrow and dragon liver,\nMaking my flesh grow feathers and wings.\nOn the path, I met Master Mao,\nWho laughed, bridging past and present.\nA red jade crow fell to earth, turning to stone.\nI too have heard of this.\nKnives repel tiger tides, the Great Master’s grotto-water,\nGate winds snap ancestral banners,\nBridge stones hold the red jade crow—\nWhy chase down to the earth’s veins or up to heaven’s ropes?\nAn iron boat cuts straight through.\n\nThe Feather-Weak Water-Fire Sword sought to hew the branches of Fusang,\nYet Master Mao, the Mao Immortal, lived a thousand springs after,\nOnce drunk on Lushan wine,\nSobered to ride a tiger,\nThen entered Zhong Mountain,\nLaughing to summon the colored simurgh down,\nBeckoning with his hand—stone-field jade the size of a peck measure.\n\nThe recluse of Stone Field dwelt on Cinnabar Mountain,\nMost able to carry on his ancestor’s steps.\nWhenever visitors came, they praised him,\nFurther confirming his name was no empty fame.\n\n*Kindly bestowed a letter, I reply with verse in place of a note,\nAt this time, I am eighty-five years of age.*\n\n**Xue Chaoyang, Tingfeng**\n\nVisitors often speak of the grotto-heaven’s wonders,\nI too have long cherished the mountains and waters’ clarity.\nThe Ascension-to-Immortality Tree stands near the ancient stone forest,\nThe stream for washing herbs runs deep, where wind and rain arise.\nThe Three-Flower Perfected One once dwelled here,\nHis distant descendants now hold renown.\nIf you ask why this old man’s hair remains unwhite,\nI can still visit you to inscribe lofty sentiments.\n\n**Poem from the Elderly Uncle, the Great Perfected One, sent to Stone Field in respectful response**\n\nIn years past, I saw you off at the extraordinary court,\nParting words unforgotten, even dreams were clear.\nI recall the four windows where we long resided,\nBorrowing a tiger’s back to inquire of long life.\nThe cinnabar grove has seen scholars of former dynasties,\nWhite Waters still transmit the names of high antiquity.\nIf you ascend the Three Terraces’ peak to gaze,\nThe Old Man Star shines near, revealing your heart.\n\n**Inscribed on Cinnabar Mountain**　　　　　　**Han Yanxin**\n\nTwice has the spring wind reached Penglai,\nWashing clean a myriad measures of traveler’s sorrow.\nOn a rain-soaked couch, I lie listening to the cliff’s waterfall roar,\nBy the sunlit window, I sit watching white clouds arise.\nGrasses by the steps sleep through the years,\nNine-times-refined cinnabar emerges from the fire.\nHow might I clear the brambles beside Fan’s pavilion,\nTo ask you for a plot of Stone Field to till?\n\n**Again**　　　　　　　　　**Wang Shuyu, Lin**\n\nBeneath the Three Terraces Peak lies the immortals’ abode,\nFan’s pavilion, where spring winds ever cling to ivy and vine.\nMyriad-fold layered peaks join the stone cliffs,\nA single curtain of flying rain—a Milky Way of waterfalls.\nHeaven’s light above and below, clouds gather and disperse,\nMountain hues misty, rain’s qi abundant.\nWith guests, I inscribe poems to suffice for pure delight,\nReturning, jade pendants chime among the clattering stones.\n\n**Again**　　　　　　　**Liu Tanzhi, Lü**\n\nTowering, the Red Waters Mountain,\nMisty, the immortals’ abode.\nHow lofty were Liu and Fan,\nTranscendent, roaming the eight poles.\nOnce gone, how desolate,\nA thousand years leave behind numinous traces.\nWithin dwells the Cloud-Exterior Man,\nSecretly wielding the handle to refine essence and spirit.\nIn secluded groves, he gathers green lingzhi,\nFrom cold springs, he boils white stones.\nAttaining a body of ethereal freshness,\nRemote, cut off from the dusty world.\nI came and saw it once,\nOverwhelmed as if by long-held admiration.\nPine flowers brewed into wine,\nHe insisted on detaining his guest.\n\n**Again**　　　　　　　　　**Chen Juncong**\n\nBy the murmuring cave mouth, I watch the flying waterfall,\nFine rain drizzles, sprinkling the adjoining fence.\nThe White Waters Perfected One knows well how to host guests,\nThe Azure Mountain Scholar loves to inscribe poems.\nAt night, the gibbon howls beneath the Three-Flower Tree,\nWild deer often carry five-colored lingzhi in their mouths.\nI ask: after Liu and Fan’s ascent to immortality,\nWho has come here to share such intimate moments?\n\n**Again**　　　　　　　　　**Xie Yuangong, Su**\n\nNorth and south of the clouds, oil-fruit platters,\nImmortals’ palaces overlook Zan and Ruan.\nSunlit peaks cast inverted reflections, half the sky emerald,\nSnowy waterfalls scatter blossoms, chilling the sixth month.\nIn vain, the simurgh’s departure leaves an empty abode,\nYet tigers still come to guard the immortal altar.\nBefore the grotto, peach trees endure through spring,\nAwaiting my return to inquire of the Great Elixir.\n\n**Again**　　　　　　　　　**Qi Wen, Angji**\n\nOf old, immortals departed from Great Orchid Mountain,\nLeaving behind empty terraces and halls within stone cliffs.\nCliff waterfalls fly white snow through all four seasons,\nStream clouds shield the Dark Pass through long days.\nGreen lingzhi’s dew is cold, gathered from the creeping vine,\nImmortals’ trees stir with wind as tigers return.\nLast night, fresh rain passed before the grotto,\nThe host detained his guest to listen to the murmuring stream.\n\n**Again**　　　　　　　　　**Han Zhijing, Ji**\n\nI long to seek the cinnabar sediment of Red Waters,\nFor this is the land of jade hairpins and bamboo shoots.\nPeaks form emerald screens, dividing the doors’ reflections,\nWaters weave silk ribbons, coiling along the stream.\nRiding clouds and harnessing qi, I face the scorching equator,\nAdmiring the moon and chanting to the wind, I envy the late Tang.\nIf you ask why this old man’s hair remains unblack,\nI can still visit to inscribe lofty sentiments.\n\n**Again**　　　　　　　　**Monk Daming, Lengyu**\n\nA man paces the stone altar with Yu’s steps,\nVoiding his song to the jade pendants’ chime.\n\n**Again**　　　　　　　　**Zhao Dechun, Yisheng**\n\nWhere to gaze on white waters and cinnabar peaks?\nAtop the Clear Radiance Pavilion, I lean on the railing.\nMidair, layered verdure nears the triple confluence,\nA thousand-zhang cascade chills the fifth month.\nImmortal maidens play flutes at the grotto’s mouth,\nMountain recluses pluck herbs beyond the clouds.\nI, too, am a crane of Difficult Peak—\nComing and going, never to return.\n\n**Again**　　　　　　　　**Chen Zishan, Zurén**\n\nThe Four Bright Mountains hold a divine one,\nWho dwells apart on a lofty summit.\nSoaring flight inverts the sun’s shadow,\nHis remnant dust bears wondrous traces.\nHis flowing influence spreads through the Three Flowers,\nAnd scholars revive his lineage.\nHe slashes thatch to build beneath the peak,\nRemote as if riding the wild swan’s path.\nJade-like plants flourish through the seasons,\nSpirit springs flow left and right.\nAt dawn he greets the Royal Father,\nAt dusk he summons the Azure Lad.\nThese two acres of fields,\nThrough bitter toil, sustain the year’s labor.\nSouth and east, endless furrows,\nThe plow’s traces coil within the bounds.\nSince ancient times, immortals and sages have dwelt here,\nTheir diet and practice unlike the world’s.\nWhite stalks harder than jade,\nBoiled and offered at morning rites.\nNot for lack of plow or hoe,\nYet his bamboo basket and gourd bowl never fill.\nGreat thieves cast covetous eyes and depart,\nHeaven’s calamities leave no want.\nOnce, the empty mat was contested,\nThe dry rice’s fault lay in himself.\nHow could he know the land of no hunger?\nThe bundled herbs dispelled ignorance early.\n\n**Master Mao’s Stone-Field Mountain Lodge**　　　**Zhang Zhongju, Inscription**\n\nThe plow first breaks a hundred acres of waste,\nAt the foot of Four Bright Mountain, a mountain lodge is built.\nPlanted, the jade grains gleam in pairs,\nSplit from the cloud-root, each piece square.\nWithin the grotto, immortals drink only marrow,\nAt the ridge’s end, no guest seeks the lost sheep.\nI know the master, his daily recitation of the *Yellow Court* complete,\nEmbraces the flying spring to rinse his fragrant teeth.\n\n**Again**　　　　　　　　**Liu Ruyuan, Ruochong**\n\nHe hews stone to sow fields of jasper,\nOpens the mountain to frame a cinnabar chamber.\nHigh dwelling neighbors the wild cranes,\nThe dusty world is lighter than chaff.\nIs there no sesame rice?\nThere is also a fasting formula.\nLooking back at the starving masses,\nHis heart aches with sorrow.\nShouldering his hoe, he emerges from Four Bright Mountain,\nThe Red Waters flow in torrents.\nSpirit sprouts bloom in triple clusters,\nFine jades stand in twin rows.\nA grain of millet holds the vast realm,\nA millet-pearl hangs in the azure vault.\nRapt, he dreams a dream of ripeness,\nAwakens startled by the yellow millet.\nHe leaps into the Northern Dipper,\nSips the golden liquid’s nectar.\nOne draught outlasts ten thousand kalpas,\nTreading the rainbow, he roams beside the Emperor.\nReturning, he plays with inverted light,\nSelf and things both forgotten.\nPine winds pass through the empty chamber,\nWithin, purity cradles pure yang.\nMoss-moon hangs on the sheer cliff,\nThe waterfall scatters silver on the bed.\nWithin the gourd, visions flicker and fade,\nBy the river, he soars and circles.\nClouds and rocks churn the spring rapids,\nIn stillness, a thousand days’ provisions rest.\nHis youthful face retains crimson radiance,\nHis hairpin gleams with dark light.\nHe paces the void in the Petal Pearl Palace,\nLeaving echoes like chiming jade.\nSilent, he transcends all forms,\nSeals his senses, burns pure incense.\nJade plants rise dense and tall,\nMagic herbs spread their fragrance.\nHe moves the Purple River Chariot,\nCommands the Golden Flower Ram.\nWishing to gather the elixir of long life,\nTo present it to the Radiant King.\n\n**Visiting the White Water Palace**　　　　**Hua Boren, Longevity**\n\nThe White Water Immortal Palace is rarely met,\nIn ten years, twice I follow old traces.\nCold currents gleam like a jade woman’s silk,\nClear peaks stand sharp as golden lotuses.\nBy the stream, no fish—only heaped stones,\nThe path to gather herbs wreathed in drifting clouds.\nTomorrow I’ll bring my nine-jointed staff,\nTo climb again those Three Terraces Peaks.\n\nThe Daoist dwells in White Water Grotto,\nFields at its mouth yield to hoe and plow.\nNo toil in plowing—labor grows light,\nJade and stone refine themselves through fire.\nGathering firewood by the stream, guests share the boil,\nOn Transformed Ram Ridge, immortals all ascend.\nDeep in night, moon arrives without shoulders to bear,\nSeated, one hears the flute and crane of the nine heavens.\n\n**Chen Zexu: \"This and That\"**\n\nA hut built at the mountain’s root becomes a dwelling,\nNo need for barbaric rites to await the year’s exorcism.\nPlanting jade—is there no uncut jade of He?\nRefining cinnabar—there is also Yu’s surplus grain.\nHe knows his life is borne by clouds and waters,\nWho recognizes the long delight of forests and springs?\nI too wish to return and seek my old calling,\nMy dreaming soul ever circles Jin Brook’s side.\n\n**Zhao Xingwu: \"Thinking of Lu\"**\n\nCarving a half-wall ladder through emerald screens,\nA thousand cliffs echo—this is the azure void.\nNo need to borrow Qin’s labor to halt the bridle,\nNor was this opened by the spirit of the Shu emperor.\nThe immortal’s bowl gathers grain finer than millet,\nSpring’s richness sows jade to prolong life.\nReturning, clogs slip on mossy green,\nThatched hut and pine-lichen frame the blue shoulders.\n\n**Xue Yifu**\n\nA few acres nestled by the mountain, one plot of land,\nGlad to keep the humble bowl over rich fare.\nLately, fasting with yellow stone in mind,\nYet still tending the hearth to plant white elm.\nJade qi moistens the mountain woods to lushness,\nPine clouds drift away, the crane’s nest stands alone.\nSoon I’ll cast off my clogs to follow the master,\nBegging for pearls from the green lattice.\n\n**Zhang Xiannan: \"Fu\" (To Xue, the Crane Studio Immortal, whom I have yet to meet but admire—first sending this poem)**\n\nTwo autumns since parting from the emperor’s court,\nWell you dwell secure in the cinnabar mounds.\nNo need for the Azure Flower staff to compile scriptures,\nRiding a crane, you ascend the White Jade Tower.\nI envy your transmission of Tang’s Lesser Guardian,\nI shame to have lost the legacy of Han’s Marquis of Liu.\nBefore your gate, White Water stretches three thousand feet—\nShould it become the Yellow River’s endless flow?\n\n**Wu Juzheng: \"Duanxue\" (Visiting White Water Palace)**\n\nFrom youth I wearied of the vulgar world,\nSeeking distant wonders with all my heart.\nThus I wandered beyond the dust,\nJoining the staff beneath the forest’s shade.\nFish weirs cross the stream,\nBird paths rise through green clouds.\nHaving glimpsed the immortal’s true abode,\nMy thoughts of rosy clouds grow deeper still.\nHow many peaks encircle the mountain?\nFlying cascades plunge a thousand feet.\nHeavenly spirits dance beside the eaves,\nWater music resounds by the steps.\nThe traces of Pi and Lu are long past,\nThe affairs of Liu and Fan have faded too.\nWithout those who inherit the ancient will,\nWho could grasp this pure delight?\nFormer worthies left their verses,\nCarved on cliffs, they seem like Buddha’s likeness.\n\n**The End of the \"Four Brightnesses Grotto-Heaven and Cinnabar Mountain Illustrated Ode Collection\"**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "四明洞天丹山间咏集 经名：四明洞天丹山图咏集。 元代曾坚、危素等编。 一卷。 底本出处：《正统道藏》洞玄部记传类。 四明洞天丹山图咏集序 沧海逸史临川曾坚撰 四明山在东海上，山有四穴通，光晷天宇。 澄霁望之，一如户牖。 土人名之日石窗，故山以名。 唐置州治今余姚，又因以明名郡。 宋改庆元旧治，更置县。 本朝升州而山属余姚，在州南百里。 图则山麓祠宇观所刻也。 其一日元建观之图，其二日唐迁观之图，盘言之则日四明山也。 木玄虚云：天下洞天三十有六，四明第九，其号日丹山赤水是也午按．山接大兰山，形势蟠结，周回三百八十里，有二百八十峰，高二百一十丈。 常有云气覆冒於中，凡二十里不绝。 二十里问名日过云，南曰云南，北日云北，山陇行三十里有峰日三台山，日屏风，日石屋，日云根。 石屋，云根间有瀑布，如悬河旁，日潺湲洞。 三台之侧有龙漱，后汉下那刘纲为上虞令，弃官同妻樊氏云翘居潺湲洞偶，从白君得仙卫，其上有洗药溪，学成会交友，登大兰山顶，攀巨杉升其上，一毕手别呼夫人，次之俱仙去，遣复山下，化为卧虎。 后人名其山曰以奉其杞。 榭日樊榭，梁隐者孔佑仍居之。 尝视山谷中钱数百斛，樵者争取之，化为瓦砾。 有鹿中矢来投佑，佑为牧豢，症。 可复去。 故祠侧建鹿亭。 陈永定中，有放一建观，因其旧祠，故日柯宇云。 唐天宝亡一年； 遣使梼祠，病其险远，劲道土奋街、、处士李建移置潺湲洞外，一市油水官。 宋龙虎山＝一华院昊君真阳，号混朴子，从一虚静张天师学，游历励此止一焉。 徽宗一以凝神殿校籍，召不起。 政和六年，韶大其观，建玉皇殿，书其榜而门日：丹山赤水洞天，封刘纲升玄明议真君，樊氏升真妙化元君，而混朴子授丹林郎。 禁樵采，镯租赋。 高宗丞相张魏公知其徒孔容，因表混朴子为真人，许岁度道士一人，以甲乙传次。 嘉熙初元，理宗梼嗣於会稽之龙瑞官，竣事分金龙玉简藏焉。 ＂今毛尊师永贞由三华嗣主之。 山之木曰青棂树，其实味甘而不可伴破。 山之兽曰鞠猴。 唐咸通中谢遗尘隐此。 陆龟蒙、皮日休时时往还，各赋诗九首，取以为题。",
      "translated_text": "**The *Yong Collection of Dan Mountain in Siming Grotto-Heaven***\n\n**Scripture Title:** *Yong Collection of the Illustrated Dan Mountain in Siming Grotto-Heaven*. Compiled by Zeng Jian and Wei Su of the Yuan dynasty. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongxuan* section, *Jizhuan* category.\n\n**Preface to the *Yong Collection of the Illustrated Dan Mountain in Siming Grotto-Heaven***\nBy Canghai Yishi, Zeng Jian of Linchuan\n\nSiming Mountain lies upon the Eastern Sea. The mountain has four apertures that pierce through, their light illuminating the heavens. When the skies clear after rain, they appear like windows or doors. The locals call them \"Stone Windows,\" and thus the mountain takes its name. During the Tang, a prefectural seat was established at present-day Yuyao, and the commandery was named *Ming* after the mountain. In the Song, the old seat of Qingyuan was changed, and a county was established. In the present dynasty, the prefecture was elevated, and the mountain fell under Yuyao, a hundred *li* south of the seat.\n\nThe illustrations are carved at the temples and abbeys at the mountain’s foot. The first is the *Illustration of Yuanjian Abbey*; the second, the *Illustration of Tangqian Abbey*—together, they are called Siming Mountain. Mu Xuanxu said: \"Among the thirty-six grotto-heavens under heaven, Siming ranks ninth, its title being *Dan Mountain and Crimson Waters*.\" Upon examination: the mountain connects with Dalan Mountain, its terrain coiling and binding, extending three hundred and eighty *li* in circumference, with two hundred and eighty peaks rising two hundred and ten *zhang*. Perpetual clouds and mist shroud its midst, unbroken for twenty *li*. This stretch is called *Guoyun*; to the south, *Yunnan*; to the north, *Yunbei*. Thirty *li* along the ridges stands a peak called *Santai Mountain*, with *Pingfeng*, *Shiwu*, and *Yungen*. Between *Shiwu* and *Yungen* hangs a waterfall like a suspended river, called *Chanyuan Cave*.\n\nBeside *Santai* lies *Longshu*. In the Later Han, Liu Gang of Xiapi, then magistrate of Shangyu, resigned his post and, with his wife Fan Yunqiao, dwelled in *Chanyuan Cave*. From White Lord, they obtained the arts of immortality. Above it flows *Xiyao Stream*, where they refined their studies. Upon completion, they gathered with friends atop Dalan Mountain, climbed a towering cedar, and with a single wave of his hand, Liu summoned his wife. Together, they ascended as immortals, leaving behind only their forms below, which transformed into recumbent tigers. Later generations named the mountain in their honor. A pavilion, *Fan Pavilion*, was built, where the recluse Kong You of the Liang later resided. Once, he saw several hundred *hu* of coins in the valley; when woodcutters scrambled to take them, they turned to rubble. A deer, struck by an arrow, fled to Kong, who healed and reared it. When cured, it departed. Thus, a *Deer Pavilion* was built beside the shrine.\n\nDuring the Yongding era of the Chen, a certain Fang Yi built an abbey, repurposing the old shrine, hence called *Keyu Abbey*. In the eleventh year of Tianbao of the Tang, envoys were sent to offer prayers at the shrine, but the path was deemed too perilous. Daoist monks and the scholar Li Jian relocated it outside *Chanyuan Cave*, near the You River post. In the Song, Wu Jun Zhenyang of Longhu Mountain’s Erhua Abbey, styled *Master Undisturbed*, studied under the Celestial Master Zhang Yujing. Traveling here, he took residence. Emperor Huizong summoned him to the *Ningshen Hall* to register his name, but he declined. In the sixth year of Zhenghe, the court expanded the abbey, constructing the *Jade Emperor Hall*, and inscribed its plaque: *Grotto-Heaven of Dan Mountain and Crimson Waters*. Liu Gang was enfeoffed as *Ascended Mystery Illustrious Perfected Lord*; Fan Shi, as *Ascended Perfected Wondrous Transformation Primordial Lady*. *Master Undisturbed* was appointed *Danlin Gentleman*. Logging was forbidden, and taxes were remitted.\n\nPrime Minister Zhang of Gaozong’s court knew his disciple Kong Rong and, on his recommendation, petitioned for *Master Undisturbed* to be named a Perfected. The court permitted the annual ordination of one Daoist, transmitted in order of seniority. In the first year of Jiaxi, Emperor Lizong offered sacrifices at the *Longrui Abbey* in Kuaiji. Upon completion, golden dragons and jade tablets were interred here. Now, Master Mao Yongzhen of the *Sanhua* lineage presides over it.\n\nThe mountain’s trees are called *qingling*, their fruit sweet but inedible when split. Its beasts are called *ju* monkeys. During the Xiantong era of the Tang, Xie Yichen retired here. Lu Guimeng and Pi Rixiu often visited, each composing nine poems, which they took as their themes.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 825,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.877658128738403,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "宋陆游记之：余再以使事航海，出庆元洋，掠余姚，竟上者四，西望缥渺如轻云，插入天末。 舟师指以相告日：大兰山也。 至京师，适薛君毅夫由毛尊师所来，示予二图，想见其山川奇秀，思欲得相羊上下，从一二潇洒士，坐鹿亭，酌潺湲； 呼鞠猴，一洗其尘土之累而吏役驱迫。 昔者舟行，徒怅．望咨嗟而已。 一近世士大夫汨於利达，上之不能效刘网脱屦簪绂，次之不能如皮陆忘形赋咏件宜乎，高世之士，椰榆哂唾而目其地曰洞天也。 余故详其本末，使有志物外者，得以览观焉。 四明洞天丹山图咏集 唐木玄虚僎　唐贺知章注 四明山名赤水天，灵踪圣迹自天然。 二百八十峰相接，其问窟宅多神仙。 按《记》云此山四面各有七十峰，计二百八十峰，相连如屏也。 其山束面如惊浪，七十高峰列姻蟑。 一条流水入勾章，二仙圣德彰兹养。 二仙者，是董黯、鲍全。 全有圣德之行，黯有孝道之功记云此乃四明山地仙俱出后汉时。 秦皇神将有王鄞，驱山塞海溺其身。 葬於水底不填筑，号作鄞江今见存。 四明山名勾章，其江因鄞江，此通大洋也。 大雷山前静水洞，谢眺曾居兹读诵。 因名大慈属慈溪，泉源水脉皆相统。 大雷山昔多禽兽，每有猎人常污触其洞问。 后有神仙偶为大雷雨阻之，因而为名。 晋汉时多有贤人得道之士，皆隐此山中。 内亦有金鹞洞。 数峰状似莲花叶，叶势与梨洲洞接。 一派清泉下小溪，数百余家安活业。 内有芙蓉峰与梨洲洞相近。 晋时有兴子孙公戊进此山，见道边梨熟，因吃三两颗，便觉饱。 再来寻，已失其所。 后因名之。",
      "translated_text": "Lu You of the Song recorded: \"Twice I sailed the sea on official business, departing from Qingyuan’s waters, skirting Yuyao, and ascending four times in all. Gazing west, the distant peaks appeared as faint as wisps of cloud, piercing the very edge of heaven. The helmsman pointed and told me: ‘That is Great Orchid Mountain.’ Upon reaching the capital, I happened to meet Master Xue Yifu, who had just come from the abode of Master Mao the Venerable. He showed me two scrolls, and through them I glimpsed the mountain’s wondrous beauty—longing to wander its heights and depths, to roam with a few carefree scholars, to sit in Deer Pavilion, to drink from the murmuring stream, to call the *ju* monkeys, and thus to wash away the dust of worldly toil and the press of official duties. In the past, as my boat passed by, I could only gaze in longing and sigh. Nowadays, scholars and officials are drowned in the pursuit of profit and advancement. The highest cannot emulate Liu Wang, who cast off his sandals and cap to wander free; the next cannot match Pi and Lu, who forgot all rank in their shared verses. Is it any wonder that those who stand above the world are met with scorn and spit, while men call this place a Grotto-Heaven? I have therefore set down its origins in full, that those who aspire to transcend the mundane may find something to contemplate.\"\n\n*Eulogies and Illustrations of the Red Mountain of the Four Brightnesses’ Grotto-Heaven*\nCollected by Mu Xuanxu of the Tang\nAnnotated by He Zhizhang of the Tang\n\nThe Four Brightnesses’ name is Heaven of Crimson Waters,\nIts numinous traces and sacred marks are of heaven’s own making.\nTwo hundred and eighty peaks stand linked,\nAnd within their caves and halls dwell many immortals.\n\nAccording to the *Records*, this mountain has seventy peaks on each of its four sides, totaling two hundred and eighty, arrayed like a screen. Its eastern face rises like startled waves, seventy towering peaks lined in misty ranks. A single stream flows into Gouzhang, and two immortals’ virtue shines in this nurturing land. The two immortals are Dong An and Bao Quan. Quan possessed the conduct of a sage, and An the merit of filial devotion. The *Records* state that these earthbound immortals both emerged in the Later Han. When the First Emperor’s divine general, Wang Yin, drove mountains to dam the sea, he drowned in the flood. Buried beneath the waters without filling the gap, he gave his name to Yin River, which remains to this day. The Four Brightnesses’ other name is Gouzhang, and its river is called Yin River, which flows into the great ocean.\n\nBefore Great Thunder Mountain lies the Quiet Water Grotto,\nWhere Xie Tiao once dwelt, reading and chanting sutras.\nThus it was named Great Compassion, and linked to Compassion Creek,\nFor all its springs and waterways share a single source.\n\nGreat Thunder Mountain was once home to many birds and beasts, and hunters often defiled its grottoes. Later, immortals summoned a great thunderstorm to block their way, and the mountain took its name from this event. In the Jin and Han dynasties, many worthies and adepts of the Dao concealed themselves here. Within lies the Golden Hawk Grotto. Several peaks resemble lotus petals, their forms touching the Pear Isle Grotto. A clear spring flows down to a small stream, sustaining several hundred households in their livelihoods. Nearby stands Hibiscus Peak, close to Pear Isle Grotto. In the Jin dynasty, Xing Zisun of the Gong clan entered this mountain and saw ripe pears by the path. He ate two or three and felt full. When he returned to look again, the place had vanished. Thus it was named Pear Isle.",
      "overlap_context": "r of Jiaxi, Emperor Lizong offered sacrifices at the *Longrui Abbey* in Kuaiji. Upon completion, golden dragons and jade tablets were interred here. Now, Master Mao Yongzhen of the *Sanhua* lineage presides over it.\n\nThe mountain’s trees are called *qingling*, their fruit sweet but inedible when split. Its beasts are called *ju* monkeys. During the Xiantong era of the Tang, Xie Yichen retired here. Lu Guimeng and Pi Rixiu often visited, each composing nine poems, which they took as their themes.",
      "start_char": 825,
      "end_char": 1470,
      "start_sentence": 40,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.374717712402344,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "傍耸高峰形突兀，顶头石匣盛仙蜜。 下有龙潭湛百寻，藏书石室深牢密。 名蜜岩峰，上有石匣盛仙蜜。 曾动星象，下有龙潭公私祷祀。 向下更有一潭，名石质。 潭内有石室，贮藏神仙秘典。 禹时有逸士王真亲曾开看，甚奇异也。 其山西南如奔牛，当烧次第相连钩。 大峰小峰计七十，山足两岐通越洲。 山脚下便是余姚、上虞两县，属赵洲，水陆皆通。 伏龟山如鹦子状，隐岫嵯峨百般样。 山中三朵五朵峰，仙人日日游其上。 西南山多异状，兼有三五朵奇峰出没山岚中。 汉时曾有张平子，驻前割木呈其仗。 板木余残三五堆，紫金声色真神异。 四角仞雕狮子守，尘劫虽移终不朽。 毛竹千丛生涧边，药苗仙果般般有。 汉时张子平曾割木於此山。 有板木三五堆，作紫金色，常有云霞覆之。 昔时张充曾见此板，得五寸，往见会稽太守令，割作蝴蝶，其木充天去也。 翠岩中问有石壁，碍石遮云数千尺。 内生异果能饱人，兼有涧泉通海脉。 晋时葛仙翁到此山，涧中有鱼，长六七尺，仙仓以杖击之，勿见山神日：勿恰绿，涧水通大洋，此鱼常从海而来也。 魏时有人杨德祖，路傍曾与山仙语。 二仙把火觅金刀，像形刻字因兹起。",
      "translated_text": "Flanking peaks rise steeply, their forms jagged and towering, with a stone casket at the summit holding immortal honey. Below lies a dragon pool, its depths plunging a hundred fathoms, and a stone chamber hidden deep within, its secrets securely sealed.\n\nThis is Honey Rock Peak, where atop the stone casket rests the immortal honey. Once, celestial omens stirred here, and below, the dragon pool became a site for both public and private prayers. Further down lies another pool, named Stone Essence. Within its waters stands a stone chamber, storing the esoteric scriptures of immortals. In the time of Yu the Great, the reclusive scholar Wang Zhen personally opened it and marveled at its wonders.\n\nTo the southwest, the mountain resembles a charging ox, its ridges burning in succession like linked hooks. Seventy peaks, great and small, stand in count, while the mountain’s base splits into two branches, connecting to Yuezhou. At its foot lie the counties of Yuyao and Shangyu, part of Zhaozhou, where both land and water routes converge.\n\nHidden Peak crouches like a parrot in repose, its secluded ridges soaring in a hundred varied forms. Among its peaks—three here, five there—immortals wander daily. To the southwest, the mountains take on strange shapes, with three or five extraordinary peaks emerging and vanishing amid the mist.\n\nIn the Han dynasty, Zhang Heng once paused here, cutting timber to fashion his staff. The leftover planks, three or five heaps, gleamed with the hue of purple gold, their resonance and luster truly divine. Four carved lions guard the corners, enduring through eons without decay. Thickets of bamboo grow by the streamside, while medicinal herbs and immortal fruits flourish in abundance.\n\nHere, Zhang Ziping of the Han once felled trees. The remaining planks, three or five piles, shimmered like purple gold, perpetually veiled in clouds and mist. Long ago, Zhang Chong saw these planks, took a five-inch piece, and presented it to the governor of Kuaiji. When carved into a butterfly, the wood soared into the heavens.\n\nAmidst the emerald cliffs, sheer stone walls rise thousands of feet, obstructing clouds. Within grow wondrous fruits that sate hunger, and streams that channel the pulse of the sea. When the Jin immortal Ge Xuan arrived at this mountain, he saw fish in the stream, six or seven feet long. As he struck one with his staff, the mountain spirit appeared, warning: *\"Do not harm it—the stream flows to the great ocean, and these fish often come from the sea.\"*\n\nIn the Wei dynasty, a man named Yang Dezhu once encountered mountain immortals by the roadside. Two immortals, holding fire and seeking a golden blade, carved images and inscribed words, giving rise to this tradition.",
      "overlap_context": ". Within lies the Golden Hawk Grotto. Several peaks resemble lotus petals, their forms touching the Pear Isle Grotto. A clear spring flows down to a small stream, sustaining several hundred households in their livelihoods. Nearby stands Hibiscus Peak, close to Pear Isle Grotto. In the Jin dynasty, Xing Zisun of the Gong clan entered this mountain and saw ripe pears by the path. He ate two or three and felt full. When he returned to look again, the place had vanished. Thus it was named Pear Isle.",
      "start_char": 1471,
      "end_char": 1976,
      "start_sentence": 71,
      "end_sentence": 95,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.461597204208374,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "杨德祖游此山，忽见一老人，云前行见二仙把火觅刀。 可详之。 德祖果见之，乃言两火是炎字，更觅金刀是到字，因名刻汉也。 其山南面如驱羊，七十峰峦形列张。 汉时刘阮迷七日，人间六代子孙亡。 有刘阮二人同行探药，到仙家七日却回，人问已过三百年矣。 归家犹见第七代子孙也。 中有大池数亩地，穴内仙蛇常吐气。 化为云雨作楼台，水应箪溪入数处。 因水流出仙荤，故老人相传名荤汉是也。 白岩瀑布如飞练，俱入紫溪流汗漫。 中有一山如覆盆，林木交加华卉乱。 两峰各名大小晦，蔽日阴沈轻雾翳。 樵夫应则昔时游，石床数丈祥云益。 宋时有应则入山，忽适巡境色秀丽，即复来，已不见。 但冥晦不敢久住； 因名大小晦。 紫溪即白水近观。 其问仙兽有犀牛，范颜捕得皮为裘。 服之对面人不见，隐藏形质无踪由。 梁时有范颜到此山，见犀牛数头，脯得一头，裂其皮作裘，服之便失其形，人睹不见，因号隐形裘。 山在日西山南是也。 其山北面如走蛇，危峦迭幛无津涯。",
      "translated_text": "Yang Dezhu wandered this mountain when suddenly he encountered an old man, who said, *\"Go forward and you will see two immortals holding fire and seeking a blade. Observe closely.\"* Dezhu indeed saw them, and explained: *\"The two fires form the character 'flame' (炎), and seeking the golden blade completes 'arrive' (到). Thus, this is called 'Han carving' (刻汉).\"*\n\nTo the mountain’s south, its peaks stand like driven sheep, seventy ridges arrayed in formation. In the Han dynasty, Liu and Ruan lost their way for seven days—by the time they returned, six generations of their descendants had perished. There were two men, Liu and Ruan, who went together to gather herbs. After seven days at the immortals’ abode, they came back, only to learn three hundred years had passed. Returning home, they beheld their seventh-generation descendants.\n\nWithin lies a great pond of several *mu*, where cave-dwelling immortal serpents often exhale *qi*. It transforms into clouds and rain, forming towers and terraces, its waters flowing into several streams like the Dan Creek. As the waters carry forth immortal herbs, the elders have long called it Herb Creek (*Xun Han*).\n\nThe White Cliff’s waterfall cascades like flying silk, all merging into the Purple Creek in boundless flow. Amidst stands a mountain shaped like an overturned basin, its tangled woods and riotous blossoms a tangle of chaos. Two peaks, named Great and Lesser Obscurity, shroud the sun in gloom, veiled by light mists. Woodcutters say that Ying Ze once roamed here, where stone beds stretch for *zhang*, graced by auspicious clouds.\n\nIn the Song dynasty, Ying Ze entered the mountain and suddenly found himself in a realm of surpassing beauty. When he returned, it had vanished—only darkness remained, and he dared not linger. Thus, the peaks were named Great and Lesser Obscurity. The Purple Creek is the White Water viewed from nearby.\n\nAmong its immortal beasts is the rhinoceros. Fan Yan once captured one, and its hide became a robe. When worn, it rendered the wearer invisible, concealing form and leaving no trace. In the Liang dynasty, Fan Yan came to this mountain and saw several rhinoceroses. He slew one, flayed its hide to make a robe, and when he donned it, his form vanished—no one could see him. Thus, it was called the Cloak of Concealment.\n\nThe mountain’s northern face winds like a slithering serpent, its perilous ridges layered without end or shore.",
      "overlap_context": "e sea. When the Jin immortal Ge Xuan arrived at this mountain, he saw fish in the stream, six or seven feet long. As he struck one with his staff, the mountain spirit appeared, warning: *\"Do not harm it—the stream flows to the great ocean, and these fish often come from the sea.\"*\n\nIn the Wei dynasty, a man named Yang Dezhu once encountered mountain immortals by the roadside. Two immortals, holding fire and seeking a golden blade, carved images and inscribed words, giving rise to this tradition.",
      "start_char": 1977,
      "end_char": 2411,
      "start_sentence": 96,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.404443264007568,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "七十之峰数亦足，八囊肾网相交加。 北而有入灵山，其状如赛，网加有走蛇之势是也。 又涌二山为两阵，引开长涧分墙仞， 抱子山头石室平，泉如甘露灵仙隐。 郑宏曾竟山海经，经中具列此泉名。 名为圣水味甘滑，得而服之当长生。 有山两阵相向，中央涧水流分四面，今俗呼为大小皎是也。 宋时郑宏曾寻得此泉水道服之，其石室中见有圣像在焉。 近代不闻神仙异边。 四明山中如伏虎，遍生青石为其祖。 凿开七窍出祥云，窍中各可兴风雨。 四明山中心名伏虎山，有赤石植梓之木，皆有七窍，皆泊龙神。 按《山海经》云：山嵩无窍不为名山也。 石库藏书仓贮盥，食之其味多甘甜。 一条搓木二百尺，光明夜照覃山尖。 梅福曾宿此库，见书，莫知其数，云：齐时樵人何昕者，遇一仓盐，以少许归与母食，其味甘，不数日，白发再黑，韶颜如童，再往取之，已失其所也。 又见一搓木，长二十余丈，横在山腹中，常吐光明，人皆见也。 束连勾章西舜窟，南嗣天台通地骨。 北包翠竭爱其源，地圣天仙时现没。 此是四明山之四至也。 周乃盘广八百里，古来灵瑞难遍纪。 梅福为仙居此山，刘纲作宰妻樊氏。 周景时，义士益昌游此山，先得升仙。 后有梅福又游此山，一宿室内梦一人谓福日：周时益昌化於此山室，其骨秘天井。 乃明早，果於天井中获得，其骨未朽，遂与埋之。 后汉刘纲，字伯经，任上虞令，与夫人樊氏云翘居四明山，皆得仙道，一日至大兰阜丘山上，登巨木飞升。 吴上虞令刘公传赞 令君，字伯经，讳纲，下那人也。 初居四明山，后为上虞令。 师事白君受道，历年道成，邀亲故会slJ 。 饮食毕，登大杉木上，去地十余丈，举手而别，忽然飞入云中而去。 妻樊夫人亦有道卫，俱升天。 今白水观乃其遗边。 云事载葛稚川神仙传及白水观碑。 赞日： 天人几何，同寄一尘。 士局耳日，分妄与真。 刘公登天，如适其邻。 以水投水，同则相亲。 宋孔先生传赞 先生史佚其字，讳佑，敬康曾孙也。 至行通神，隐於会稽四明山。 尝见山谷中有数百斛钱，视之如瓦石不异。 采樵者竞取，入手即成沙砾。 曾有鹿中箭来投先生，为之养创，愈然后去。 太守王僧虔欲引为主簿，不可屈。",
      "translated_text": "The seventy peaks here are numerous and grand, their ridges resembling eight interwoven nets of kidneys. To the north lies the entrance to Spirit Mountain, its form like a ceremonial screen, its layered ridges mirroring the slithering serpent’s motion. Two mountains surge forth like opposing ranks, parting to draw forth a long ravine that divides like a towering wall. Embracing Child Mountain’s summit is a level stone chamber, where springs flow sweet as nectar, concealing immortals within. Zheng Hong once explored the *Classic of Mountains and Seas*, which lists this spring by name. Called the Sacred Water, its taste is smooth and sweet; those who drink it attain longevity.\n\nTwo mountains stand face to face, their center cleft by a ravine whose waters diverge in four directions—now commonly called Great and Lesser Brightness. In the Song dynasty, Zheng Hong sought this spring’s course and drank from it; within the stone chamber, he beheld a sacred image. In recent times, no divine immortals have been heard of near its borders.\n\nWithin the Four Brightness Mountains lies a crouching tiger, its body formed of verdant stone, its ancestor. Carved with seven apertures, it exhales auspicious clouds, each cavity capable of summoning wind and rain. The heart of Four Brightness Mountain is named Crouching Tiger Mountain, where red stones and catalpa trees stand, each bearing seven apertures, all dwelling places of dragon spirits. As the *Classic of Mountains and Seas* states: \"A mountain without apertures cannot be a famous mountain.\"\n\nA stone vault stores books, a granary holds grain for washing—its taste is rich and sweet. A single twisted tree, two hundred feet long, shines with light that illuminates the mountain’s peak at night. Mei Fu once lodged in this vault and saw its books, countless in number. It is said that during the Qi dynasty, a woodcutter named He Xin encountered a granary of salt. Taking a small portion home to his mother, they found its taste sweet. Within days, her white hair turned black again, her complexion as youthful as a child’s. When he returned to retrieve more, the granary had vanished. He also saw a twisted tree, over twenty *zhang* in length, lying across the mountain’s belly, perpetually emitting a radiant glow visible to all.\n\nBound to the west by Gouzhang and Yu’s Grotto, to the south it connects with Tiantai, threading through the earth’s bones. To the north, it cradles the emerald expanse, cherishing its source—where earthly saints and heavenly immortals appear and vanish. These mark the four boundaries of Four Brightness Mountain.\n\nIts expanse winds broadly across eight hundred *li*, its ancient numinous wonders too many to record. Mei Fu became an immortal dwelling on this mountain, while Magistrate Liu Gang and his wife, Lady Fan, attained the Dao here. During the reign of King Jing of Zhou, the righteous man Yi Chang wandered this mountain and was the first to ascend as an immortal. Later, Mei Fu also journeyed here and dreamed one night in a chamber that a man told him: \"During the Zhou, Yi Chang transformed in this mountain’s chamber; his bones are hidden in the Heavenly Well.\" The next morning, he indeed found them in the Heavenly Well—though not yet decayed—and buried them.\n\nDuring the Later Han, Liu Gang, styled Bojing, served as Magistrate of Shangyu. He and his wife, Lady Fan Yunqiao, resided on Four Brightness Mountain and both attained the Way. One day, they ascended Great Orchid Mound’s hill and, climbing a towering tree, soared into the sky.\n\n**Eulogy for Magistrate Liu of Shangyu in Wu**\nThe Magistrate, styled Bojing, named Gang, was a native of Xia’na. He first dwelled on Four Brightness Mountain, later becoming Magistrate of Shangyu. He studied the Dao under Master Bai, and after years of cultivation, his Way was perfected. He invited his kin and friends to gather, and after the feast, he climbed a great cedar tree, over ten *zhang* above the ground. Raising his hand in farewell, he suddenly flew into the clouds and departed. His wife, Lady Fan, also possessed the Dao’s protection, and together they ascended to heaven. Today, White Water Abbey stands as their legacy. These events are recorded in the *Biographies of Divine Immortals* by Ge Zhichuan and the stele of White Water Abbey.\n\n**Eulogy:**\nHow many celestial beings dwell in this dust?\nBound by ears and eyes, they mistake falsehood for truth.\nYet Magistrate Liu ascended to heaven as if visiting a neighbor—\nLike water poured into water, kindred spirits naturally unite.\n\n**Eulogy for Master Kong of the Song**\nThe Master’s given name was You, his style lost to history, a great-grandson of Kong Jingkang. His conduct was so virtuous it moved the gods, and he secluded himself on Four Brightness Mountain in Kuaiji. Once, he saw several hundred *hu* of coins in a mountain valley, indistinguishable from tiles and stones. Woodcutters scrambled to take them, but in their hands, the coins turned to sand and pebbles. A deer, struck by an arrow, once fled to him; he nursed its wound until it healed, then released it.\n\nGovernor Wang Sengqian sought to appoint him as his chief clerk, but the Master could not be swayed.",
      "overlap_context": "e rhinoceros. Fan Yan once captured one, and its hide became a robe. When worn, it rendered the wearer invisible, concealing form and leaving no trace. In the Liang dynasty, Fan Yan came to this mountain and saw several rhinoceroses. He slew one, flayed its hide to make a robe, and when he donned it, his form vanished—no one could see him. Thus, it was called the Cloak of Concealment.\n\nThe mountain’s northern face winds like a slithering serpent, its perilous ridges layered without end or shore.",
      "start_char": 2412,
      "end_char": 3314,
      "start_sentence": 119,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.754565477371216,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "先生子道徽与杜景齐友善，少厉高行，能世其家风。 隐居南山，终身不窥都邑。 · 齐豫章王疑为杨州，辟西曹书佐不至。 乡里宗慕之，道徽兄子总有操行，遇寒饥不可得衣食，县令丘仲孚荐之除竟陵王侍郎，竟不至。 事载南史隐逸传赞日： 贪夫徇利，或死怀璧。 公不动心，视同瓦砾。 素风熏陶，犹子绝识。 一门清节，乃祖遗德。 四明山铭 应奉翰林文字文林郎同知制诰兼国史院编修官临川危素撰 余姚南去七十里，有山二百八十峰，束连句章，南接天台，北包翠竭。 中峰最高，上有四穴，若开户牖，以通日月之光，故号四明洞天。 恒有云气覆其上，秦皇命臣王鄞，驱山塞海，百灵劳役，奔入此地，因名鬼藏山云。 汉上虞县令刘纲，字伯经，下那人。 后居山中，从白君得仙卫。",
      "translated_text": "Master’s son Daohui was on close terms with Du Jingqi. From youth, he cultivated lofty conduct and carried on his family’s legacy. He secluded himself on South Mountain and never once gazed toward the capital. When the Prince of Yuzhang of the Qi summoned him to serve as West Section Clerk, he did not go.\n\nThe village elders revered and admired him. Daohui’s nephew Zong, his elder brother’s son, was likewise of upright character. When he suffered from cold and hunger and could not obtain clothing or food, the county magistrate Qiu Zhongfu recommended him for the post of Gentleman-in-Attendance to the Prince of Jingling, yet he too refused to go.\n\nThis is recorded in the *Praise for the \"Biographies of Recluses\"* in the *History of the Southern Dynasties*:\nGreedy men chase profit,\nsome even die clutching jade.\nYet he remained unmoved,\ntreating it as mere tile and stone.\nThe pure breeze nurtured his nature;\nhis nephew’s keen discernment followed.\nA single family’s unsullied integrity—\nhis ancestor’s virtue passed down.\n\n**Inscription for Four Brightness Mountain**\nComposed by Wei Su of Linchuan, Serving Gentleman for Rendering Literary Texts, Gentleman for Court Writings, Concurrently Compiler of the Bureau of National History\n\nSeventy *li* south of Yuyao rise two hundred and eighty peaks, bound to the east by Juzhang, touching Tiantai to the south, and embracing Cuiqie to the north. The central peak is the highest, its summit bearing four caverns like open doors and windows, channeling the light of sun and moon—hence the name Four Brightness Grotto-Heaven. Perpetually veiled in clouds, when the First Emperor of Qin ordered his minister Wang Yin to drive mountains and dam the sea, the myriad spirits, wearied by labor, fled into this land, whence it was also called Ghost-Hiding Mountain.\n\nDuring the Han, Liu Gang, styled Bojing, a native of Xia’na, served as magistrate of Shangyu. Later, he dwelled in these mountains and, following the White Lord, attained the ranks of the immortals.",
      "overlap_context": "was so virtuous it moved the gods, and he secluded himself on Four Brightness Mountain in Kuaiji. Once, he saw several hundred *hu* of coins in a mountain valley, indistinguishable from tiles and stones. Woodcutters scrambled to take them, but in their hands, the coins turned to sand and pebbles. A deer, struck by an arrow, once fled to him; he nursed its wound until it healed, then released it.\n\nGovernor Wang Sengqian sought to appoint him as his chief clerk, but the Master could not be swayed.",
      "start_char": 3314,
      "end_char": 3626,
      "start_sentence": 165,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.462104320526123,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "他日会别亲友，登大兰丘，援巨木飞升。 其妻樊氏从之，遗履木下，化为虎。 事闻于朝，即其地立祠宇，春秋祀焉。 宋隐者孔佑视山谷中钱数百斛，与瓦石无异，樵者争取之，即成沙砾。 有鹿中矢来投佑，佑为豢之，创愈而后去。 唐天宝三年，玄宗以刘君祠宇险远，命道士崔街、处士李建改筑于山麓二十里刘君修炼处。 宋末高士谢遗尘隐於是。 陆龟蒙、皮日休皆至，为诗各九章以相倡和。 宋政和问，徽宗书其榜，日：丹山赤水洞天。 命建玉皇殿，用方士法，所真金龙玉简，至今存焉。 主领焚修，以甲乙相传。 国朝秩祀名山，颁赐香币合亦及，然楝宇倾挠，莫有留意。 其先出於龙虎山三华道院，故广信。 毛永贞嗣居之，乃斥大其屋庐，足称夫仙灵之宅。 毛君之门人，临川昊国洪来请篆铭，将勒山石。 铭日：越山之峰，石穴玲珑，天欲雨，浮云蒙。 真人上升遗木履，潺湲古洞，闻流水。 白鹤裴回，拎盖戾止。 玉童采得青橘子。 子能食之可不死。 史素作铭，式告千撰。 白水观记 至治问，余读书信之龙虎山，适里中朱贞一先生同馆舍。 其门人毛君永贞，执侍左右，简默粹门，退则过余，从容款洽。 既去，隐余姚山中，声迩邈不相闻。 后二十有八年，其徒昊国洪来京师请铭其所居四明山，始询君无恙。 既叔而铭之。 又后一纪，先生门人薛毅失拥所刻山图，复请书其所未备，於是与君不相见者四十年矣。 顾余窃禄班行，汨役尘坛，闻君飘然高举於海岸孤绝之地，志虑凝重，无毫发外求於世，但慕羡之。 所谓上虞令刘纲夫妇登真，隐者孔佑化钱疗鹿，唐玄宗迁祠宇，陆鲁望、皮袭美倡和，宋徽宗书洞天之榜、建玉皇殿、投金龙玉简事，此叔之所及者。 若乃旧祠宇之所见者，有升仙山、升仙木、云南、云北、过云。 《会稽志》谓谢遗尘隐於南雷。 今有大雷峰，图之所未者。 观图有三台峰、云根石屋、龙揪、洗药溪、潺湲洞。 《四明郡志》则云：束北百三十里，涌为二百八十峰，中有三十六峰，束西南北各有门，由余姚言之，为西四明，则叔所未书者。 宋虚静天师张公之门人昊真阳，学于龙虎之三华道院，号日混朴子，来游是山，徽宗以丹林郎、凝神殿校籍召之，不起。 封刘纲升玄明义真君，其配樊夫人封升真妙化元君。 丞相张魏公与昊君门人朱孔容交，表为真人。 孔容之后世以甲乙传次。 此亦叔所未书者也。 君构清晖亭於瀑布之下，营石田山房以自休息。 在余作铭之后。 其赋咏留山中，唐自陆、皮之前，有孟束野、刘文房，宋有谢师厚而下若干人。 迨国朝黄文献公而下若干人。 君又将刻而传之。",
      "translated_text": "One day, bidding farewell to kin and friends, he ascended Great Orchid Mound, grasped a towering tree, and soared into the heavens. His wife, Lady Fan, followed him, leaving her sandals beneath the tree, which transformed into a tiger. Word of this reached the court, and a shrine was erected on the site, where spring and autumn sacrifices were offered.\n\nDuring the Song, the recluse Kong You saw several hundred *hu* of coins scattered among the valleys, indistinguishable from pebbles and tiles. Woodcutters scrambled to gather them, only for the coins to crumble into sand and gravel. A deer, struck by an arrow, came to Kong You for refuge; he sheltered it, and once its wound healed, it departed.\n\nIn the third year of the Tianbao era of the Tang, Emperor Xuanzong, deeming the shrine of Master Liu too perilous and remote, commanded the Daoist priest Cui Jie and the scholar Li Jian to rebuild it twenty *li* downslope at the site where Master Liu had cultivated the Dao. In the late Song, the eminent scholar Xie Yichen retired here. Lu Guimeng and Pi Rixiu both visited, composing nine poems each in mutual exchange.\n\nDuring the Zhenghe era of the Song, Emperor Huizong inscribed a plaque reading: *Cinnabar Mountain and Vermilion Waters Grotto-Heaven*. He ordered the construction of a Jade Emperor Hall, employing the methods of Daoist adepts, and cast golden dragons and jade tablets, which remain to this day. The supervision of the temple’s rituals has been passed down through successive generations. In the present dynasty, as part of the state’s veneration of sacred mountains, offerings of incense and silk have been bestowed here as well. Yet the halls have fallen into disrepair, and none have taken heed.\n\nOriginally affiliated with the Three Flowers Abbey of Mount Longhu, the temple was later established in Guangxin. Mao Yongzhen, who succeeded to its care, expanded its buildings, making them worthy of a dwelling for immortals. His disciple, Wu Guohong of Linchuan, requested an inscription in seal script to be carved into the mountain stone. The inscription reads:\n\n*Amidst the peaks of Yue’s mountains,*\n*Stone grottoes gleam like latticework.*\n*When heaven wills rain,*\n*Floating clouds shroud the heights.*\n*The Perfected One ascended, leaving wooden sandals behind;*\n*An ancient cavern murmurs with flowing water.*\n*White cranes circle and wheel,*\n*Or alight beneath canopies.*\n*Jade lads pluck green tangerines—*\n*Whoever eats them shall never die.*\n\nThis inscription was composed by me, Su, to serve as a testament for a thousand years.\n\n---\n\n*Record of White Water Abbey*\n\nDuring the Zhizhi era, I was studying at Mount Longhu when I shared lodgings with Master Zhu Zhenyi of my hometown. His disciple, Mao Yongzhen, attended him closely—reticent, refined, and unassuming. When he withdrew, he would visit me, and we spoke at leisure with ease. Later, he retreated into the mountains of Yuyao, and his voice faded into the distance, beyond hearing.\n\nTwenty-eight years later, his disciple Wu Guohong came to the capital to request an inscription for their abode on Four Brightness Mountain. Only then did I inquire after Master Mao’s well-being. I wrote the inscription as requested. Another twelve years passed, and Master Zhu’s disciple, Xue Yishi, brought forth the engraved mountain map, asking me to supplement what had been omitted. Thus, forty years have passed since I last saw Master Mao.\n\nThough I now draw a salary from the imperial ranks and am mired in worldly affairs, I hear that he drifts aloft in seclusion along the solitary shores of the sea, his mind and thoughts serene, seeking nothing beyond the slightest trace from the world. I can only admire him.\n\nThe matters I have recorded include: Magistrate Liu Gang of Shangyu and his wife attaining transcendence; the recluse Kong You transforming coins and healing the wounded deer; Emperor Xuanzong of the Tang relocating the shrine; Lu Guimeng and Pi Rixiu exchanging poems; Emperor Huizong of the Song inscribing the *Grotto-Heaven* plaque, constructing the Jade Emperor Hall, and casting golden dragons and jade tablets.\n\nAs for the sights at the old shrine, they include Ascension Mountain, Ascension Tree, Southern Cloud, Northern Cloud, and Passing Cloud. The *Gazetteer of Kuaiji* states that Xie Yichen retired at Nanlei; today, there is a Great Thunder Peak, which was not depicted in the earlier map.\n\nThe map includes Three Terraces Peak, Cloudroot Stone House, Dragon’s Whiskers, Washing Medicine Stream, and Murmuring Grotto. The *Gazetteer of Four Brightness Prefecture* records: \"One hundred and thirty *li* to the northeast, the peaks surge into two hundred and eighty, with thirty-six peaks at the center, each direction having its gate. From Yuyao, this is called Western Four Brightness\"—these details I had not previously recorded.\n\nDuring the Song, Wu Zhenyang, a disciple of the Celestial Master Zhang of Empty Tranquility, studied at the Three Flowers Abbey of Mount Longhu under the name *Master of Simplicity*. Emperor Huizong summoned him as Gentleman of the Vermilion Forest and Registrar of the Hall of Concentrated Spirit, but he declined. Liu Gang was enfeoffed as *Perfected Lord of Ascended Mystery and Illuminated Righteousness*, and his consort, Lady Fan, as *Perfected Lady of Ascended Mystery and Wondrous Transformation*. Chancellor Zhang, Duke of Wei, befriended Wu’s disciple Zhu Kongrong and petitioned for his enfeoffment as a Perfected One. Kongrong’s descendants have since passed down the lineage through successive generations—these details I had also not previously recorded.\n\nMaster Mao constructed the Pavilion of Clear Radiance beneath a waterfall and built the Stone Field Mountain Lodge for his repose, which he did after I had composed the inscription. His poetic compositions remain in the mountains. Before Lu Guimeng and Pi Rixiu, there were Meng Dongye and Liu Wenfang of the Tang; in the Song, there were Xie Shihou and others; and in the present dynasty, Huang Wenxian and others. Master Mao intends to carve and transmit these works as well.",
      "overlap_context": "ight of sun and moon—hence the name Four Brightness Grotto-Heaven. Perpetually veiled in clouds, when the First Emperor of Qin ordered his minister Wang Yin to drive mountains and dam the sea, the myriad spirits, wearied by labor, fled into this land, whence it was also called Ghost-Hiding Mountain.\n\nDuring the Han, Liu Gang, styled Bojing, a native of Xia’na, served as magistrate of Shangyu. Later, he dwelled in these mountains and, following the White Lord, attained the ranks of the immortals.",
      "start_char": 3626,
      "end_char": 4609,
      "start_sentence": 181,
      "end_sentence": 225,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.7811233997345,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "按《会稽志》云：俗谓之白水宫，又云有白水观碑。 盖祠宇观字义重复，故今当称为白观。 余得乡贡进士番易徐勉之《保越录》，越之祸乱极矣，四明之山风尘不惊，君优游其问，甘食而安寝，古所谓武陵桃源者，信有之矣。 故为之记，使与铭并。 刻之。 君字善卿，薛君字茂弘，相其后者，潘文信、盛元朴、许用和。 至正二十二年三月丁未朔，通奉大夫、中书参知政事、同知经筵事、提调四方献言详定使司事临川危素记。 石田山房诗序 余姚州南百里日四明山，神仙家丹山赤水洞天在焉。 汉上虞令刘纲尝修炼飞升于是，有观日祠宇观，傍屋日石田山房，则毛尊师永贞之所筑也。 初，三十代虚静张天师以道术授上清宫三华院混朴昊真人，阮得其传，居是山。 宋徽宗闻贤，召之不起，即所居斥而广之大。 故祠宇之系出於三华而三华世视祠宇，则其所处之馆也。 我仁皇时天下无事，玄教张昊二大宗师相继在朝，三华院有贞一先生朱本，初亦以博洽文雅见称于卿相问。 毛君皇从之游，先生固爱之，二宗师尤器重焉。 以教檄归领祠宇观事。 祠宇时颇废，自毛君主之，圯无不兴，敝无不茸。 今垂四十年矣。 勒厉如一日，饬理之。",
      "translated_text": "According to the *Gazetteer of Kuaiji*, the site is commonly called the White Water Palace, though it is also referred to as the White Water Abbey Stele. Since \"palace\" (祠宇) and \"abbey\" (观) are redundant in meaning, it should now be properly termed the White Abbey.\n\nI obtained *Preserving Yue* by the provincial graduate Xu Mianzhi of Panyu, which records the calamities that befell Yue—utter devastation—while the mountains of Siming remained untouched by the winds of war. There, Master Mao wandered freely, savoring his meals and sleeping in peace. Truly, this was the fabled Peach Blossom Spring of old. Thus, I have composed this account to accompany the inscription, and both shall be engraved.\n\nThe Master’s courtesy name was Shanqing; Master Xue’s was Maohong. Those who succeeded them in later years were Pan Wenxin, Sheng Yuanpu, and Xu Yonghe.\n\nOn the first day of the dingwei month in the third year of the Zhizheng reign (1362), this was recorded by Wei Su, Grand Master for Thorough Counsel, Participant in the Deliberation of Government Affairs, Co-Director of the Imperial Academy, and Commissioner for the Review of Memorials from the Four Quarters, of Linchuan.\n\n---\n\n**Preface to the Poems of Stone Field Mountain Lodge**\n\nA hundred li south of Yuyao Prefecture lies Siming Mountain, where the Daoist realm of the Cinnabar Mountain and Vermilion Waters Grotto Heaven is said to reside. The Former Han magistrate of Shangyu, Liu Gang, once cultivated and ascended to immortality here. The abbey is called the Abbey of Sacrificial Halls, while the adjacent dwelling is named Stone Field Mountain Lodge—built by Master Mao Yongzhen.\n\nInitially, the thirty-third-generation Celestial Master Zhang Tian Shi of the Vacuous Tranquility lineage transmitted his arts to Wu Zhenren of the Three Flowers Institute at the Supreme Clarity Palace. Ruan inherited this transmission and dwelled upon this mountain. When Emperor Huizong of Song heard of his virtue, he summoned him, but Ruan declined. Instead, the emperor expanded his residence, which became the abbey. Thus, the abbey traces its origins to the Three Flowers Institute, and the Three Flowers Institute, in turn, regarded the abbey as its ancestral hall.\n\nDuring the reign of our Benevolent Emperor, when the realm was at peace, the two great patriarchs of the Mystical Teachings, Zhang and Wu, served consecutively at court. At the Three Flowers Institute was Master Zhenyi, Zhu Ben, who was renowned among ministers and nobles for his erudition and literary grace. Master Mao became his disciple, and the Master held him in deep affection, while the two patriarchs particularly esteemed him. By imperial decree, he was entrusted with the administration of the Abbey of Sacrificial Halls.\n\nAt the time, the abbey had fallen into disrepair. Since Master Mao took charge, all that was ruined has been restored, and all that was dilapidated has been renovated. Nearly forty years have passed, yet his diligence remains unwavering, as if it were but a single day. Such is the order he has brought to this place.",
      "overlap_context": " previously recorded.\n\nMaster Mao constructed the Pavilion of Clear Radiance beneath a waterfall and built the Stone Field Mountain Lodge for his repose, which he did after I had composed the inscription. His poetic compositions remain in the mountains. Before Lu Guimeng and Pi Rixiu, there were Meng Dongye and Liu Wenfang of the Tang; in the Song, there were Xie Shihou and others; and in the present dynasty, Huang Wenxian and others. Master Mao intends to carve and transmit these works as well.",
      "start_char": 4609,
      "end_char": 5068,
      "start_sentence": 226,
      "end_sentence": 244,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.11602520942688,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "暇则退处于山房，焚香燕坐，外物一不以累其心，盖其左右有穹崖峭壁，流泉瀑布喷洒交射，势若县河。 其下则磊确荦诵，衡亘从合，畦呵万状，无非石也。 莒蒲、河车、芝草、苍耳，随采而足。 稻梁糜芭之植，十不收一二焉。 故日石田名之。 薛君毅夫亦学贞一之学，隐居白屋山。 山在上清之近继至石田，乐其幽胜，首为赋诗。 至京师告于文士大夫曰：石田其地胜，毛君其人贤，吾亦将从而老矣。 则各为赋诗，得若干首，来属余叔观老子倡知雄守雌之说以为道。 惟得其传则能致虚守薄舍繁华盛丽之美，而安於寂寞荒僻之陋，以息其神，以怡其真，以全其身，益其道然也。 若毛君者，几其人矣。 世当承平时，夫人疲精竭智以争夫膏腴衍沃之区，而肆其高广壮丽之构者，天下皆是也。 视夫石田奚啻霄壤之问哉。 兵兴十年，自夫维扬河南蕃富甲天下者，刻削蹂践无余。 昔之东阡西陌者，荒姻野草矣。 冻台燠室者，颓垣败础矣。 欲求彷佛於石田山房也，可得乎？ 吾是知毛君之智也。 以是知夫能得其师之传者也。 谨序之而因夫薛君以请焉。 至正二十一年冬十月朔临川鲁坚序。 唐贤诗 送萧炼师归四明山孟束野郊闲於独鹤心，大於高松年。 回出万物表，高柄四明巅。 千寻直列峰，百尺倒泻泉。",
      "translated_text": "In his leisure hours, he would retreat to his mountain chamber, where he would burn incense and sit in tranquil repose, allowing no external concerns to burden his mind. Surrounding him were towering cliffs and sheer precipices, with cascading springs and waterfalls spraying and intersecting, their force like a suspended river. Below lay jagged rocks, ridges stretching in every direction, fields and furrows of myriad forms—all composed of stone. There grew calamus, *he che* (fleeceflower root), lingzhi mushrooms, and cocklebur, which could be gathered as needed. The crops of rice, millet, and sorghum barely yielded a tenth or a fifth of their potential. Thus, the place was named \"Stony Fields.\"\n\nXue Jun, styled Yifu, who had also studied under Master Zhenyi, lived in seclusion on White House Mountain. The mountain lay near the Supreme Clarity Abbey, and upon visiting Stony Fields, he delighted in its secluded beauty and was the first to compose a poem about it. Traveling to the capital, he spoke to the literati and officials, saying: \"Stony Fields is a place of surpassing beauty, and Master Mao is a man of true worth. I, too, shall grow old there.\" Thereupon, each composed a poem, and several dozen were collected. They were presented to my uncle, Master Guan, who expounded on the Daoist principle of \"knowing the male but keeping to the female.\" Only those who grasp this transmission can attain emptiness and embrace simplicity, forsaking the splendor of prosperity and luxury to find contentment in solitude and rustic remoteness, thereby preserving their spirit, nurturing their authenticity, and safeguarding their person—thus enriching the Dao. Master Mao is nearly such a man.\n\nIn times of peace, people exhaust their energy and wit in pursuit of fertile, expansive lands, erecting grand and magnificent structures—such was the way of the world. Compared to Stony Fields, the difference is as vast as that between heaven and earth. Yet after a decade of war, the once-wealthiest regions of Yangzhou and Henan, which had surpassed all others, were ravaged and stripped bare. Where once lay eastern paths and western lanes now stretched only wild grass and smoke. Where once stood warm halls and heated chambers now lay crumbling walls and shattered foundations. Could one even hope to find a place resembling the mountain chamber of Stony Fields? Herein lies the wisdom of Master Mao. This is how one recognizes those who have truly inherited their master’s teachings.\n\nRespectfully, I have written this preface and, through Master Xue, present it here.\n\nComposed on the first day of the tenth lunar month in the winter of the twenty-first year of the Zhizheng era by Lu Jian of Linchuan.\n\n**Poem by Tang Worthy: \"Seeing Off Daoist Master Xiao Returning to Siming Mountain\" by Meng Jiao of Dongye**\n\nLeisurely as a solitary crane’s heart,\nVast as the age of a towering pine.\nEmerging beyond the myriad things,\nHe dwells high on Siming’s peak.\nA thousand fathoms of sheer, aligned peaks,\nA hundred-foot cascade of plunging springs.",
      "overlap_context": "aster held him in deep affection, while the two patriarchs particularly esteemed him. By imperial decree, he was entrusted with the administration of the Abbey of Sacrificial Halls.\n\nAt the time, the abbey had fallen into disrepair. Since Master Mao took charge, all that was ruined has been restored, and all that was dilapidated has been renovated. Nearly forty years have passed, yet his diligence remains unwavering, as if it were but a single day. Such is the order he has brought to this place.",
      "start_char": 5068,
      "end_char": 5556,
      "start_sentence": 245,
      "end_sentence": 269,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.130579471588135,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "绛雪为我饭，白云为我田。 静言不话俗，灵迹时步天。 游四窗　　　　　　刘文房　长卿 四明山绝奇，自古说登陆。 苍崖倚天立，覆石如覆屋。 玲珑开户牖，落落明四目。 箕星分南野，有斗挂檐北。 日月居束西，朝昏互出没。 我来游其问，寄傲巾半幅。 白云无本心，悠然伴幽独。 对此脱尘鞅。 顿忘荣与辱。 长笑天地宽，仙风吹佩玉。 九咏　　　　　陆鲁望　龟蒙 石窗石窗何处见，万仞倚晴虚。 积霭迷青琐，残霞动绮疏。 山应列圆娇，宫便接方诸。 只有三峰客，时来校隐书。 过云 相访一程云，云深路仅分。 啸台随日辩，樵斧带风闻。 晓看衣全湿，寒冲酒不醺。 几回归思静，髻佛见苏君。 云南 云南更有溪，丹砾书无泥。 药有巴宾卖，枝多越乌啼。 夜清先月午，秋近问岚迷。 若得山颜住，芝菌手自擭。 云北 云北近阳川，人家洞壑连。 坛当星斗下，楼掺翠微边。 一半遥峰雨，三条古井姻。 金庭如有路，应到左神天。 鹿亭 鹿亭岩下置，时引白尘过。 草细眠应久，泉香饮自多。 认声来月坞，寻路到姻萝。 早晚吞金液，骑将上绛河。 樊榭 古榭何时筑，人应白日飞。 至今山客说，时驾玉麟归。 乳带悬松嫩，芝台出石微。 凭阑虚目断，不见羽华衣。 潺湲洞 飞瀑泻云根，潺潺万古音。 似吹双羽管，如奏落霞琴。 倒穴漂龙沫，穿松溅鹤襟。 何人乘月弄，应作上清吟。 青棂子 山实号青棂，环冈次第生。 外形坚绿谷，中味敌琼英。 堕石樵儿拾，敲林宿乌惊。 亦应仙吏守，时取荐层城。 鞠猴 何事鞠猴名，先封在四明。 但为连臂饮，不作断肠声。 野蔓垂缨细，寒泉碾玉清。 满林游宦子，谁与作公卿。 石窗皮　　　　　袭美日休 窗开自真宰，四远见苍崖。 苔染浑成绮，云漫便当纱。 棂中空吐月，扉际不肩霞。 未会通何处，应连玉女家。 过云 粉洞二十里，当中幽客行。 片时迷鹿迹，寸步隔人声。 以杖控虚翠，将襟惹薄明。 经时未周得，恐是入层城。 云南 云南背一川，无鸦到峰前。 墟里生红药，人家发白泉。 儿童皆自古，婚嫁尽如仙。 共作真官户，无由税石田。 云北 云北昼冥冥，空疑背寿星。 犬能谙药气，人解写芝形。 野歇遇松盖，醉书蓬石屏。 焚香住此地，应得入金庭。 鹿亭 鹿草多此住，因过白云楣。 待倡傍花久，引尘穿竹迟。 经时饮玉涧，尽日嗅金芝。 为在石窗下，成仙自不知。 樊榭 主人成列仙，故榭独依然。 石洞闻人吠，松声惊鹿眠。 井香为大药，鹤语是虚篇。 欲买重柄隐，云峰不售钱。 潺湲洞 水流万丈源，尽日泻潺湲。 敲碎一轮月，镕消半段天。 响高吹谷动，势急饮云旋。 料得深秋夜，临流尽古仙。 青棂子 山风熟异果，夜是供真仙。 味似云腴美，形如玉脑圆。 御来多野鹤，落处半灵泉。 必共桃源种，花开不记年。 鞠候 堪羡鞠猴国，碧岩千万重。 姻萝为印绶，蕾实壑是提封。 众遣狙公渡，果教挥子供。 尔徒如不死，应得蹑玄宗。 宋贤诗 瀑布　　　　　　　谢师厚　景初 飞泉绿峭壁，斗绝千万丈。 奔流天上来，望若匹练广。 曲岭隔青林，永抱先闻响。 其傍有巨石，平润可俯仰。 俗士所不到，我辈固来赏。 须期秋色清，攀萝迩其上。 游四明　　　　　　孙季和　应时 平生抱遐尚，抚剑远行游。 迩谢声利牵，心与岩壑谋。",
      "translated_text": "**Poems on Siming Mountain**\n\n**\"Feeding on Red Snow\"**\nRed snow serves as my meal,\nWhite clouds as my fields.\nIn silence, I shun worldly speech,\nMy numinous traces often tread the heavens.\n\n---\n\n**\"Wandering the Four Windows\"**\n*By Liu Wenfang (Changqing)*\n\nSiming’s peaks are wondrous rare,\nSince ancient times, famed for climbers’ tread.\nAzure cliffs stand skyward-pressed,\nOverhanging stones like roofs o’erhead.\nLatticed windows open wide,\nFour vistas clear in light outspread.\nThe Winnowing Basket spans the southern wilds,\nThe Dipper hangs above the eaves to north.\nSun and moon dwell east and west,\nAt dawn and dusk they rise and set.\nI come to wander here,\nMy pride half-wrapped in cloth’s embrace.\nWhite clouds, without fixed intent,\nDrift idly with my solitude.\nFacing this, I cast off worldly bonds,\nInstantly forget both glory and disgrace.\nI laugh aloud—the earth is vast,\nA fairy breeze stirs jade at my waist.\n\n---\n\n**\"Nine Songs\"**\n*By Lu Luwang (Guimeng)*\n\n**Stone Window**\nWhere may one see the Stone Window?\nA thousand fathoms high, it leans on empty sky.\nGathering mists obscure its jade-green lattice,\nFading glow stirs its patterned tracery.\nThe mountains seem to array their rounded charms,\nThe palace nears the square Cauldron’s side.\nOnly the Three Peaks’ recluses,\nFrom time to time, come here to collate their hidden texts.\n\n**Passing Clouds**\nI visit a stretch of cloud,\nWhere mist runs deep and paths barely part.\nThe whistling terrace shifts with the sun,\nThe woodcutter’s axe carries on the wind.\nAt dawn, my robes are soaked through,\nThe cold sobers wine’s warmth.\nHow many times has my longing for home stilled,\nOnly to glimpse Su Jun in my hair’s reflection.\n\n**Southern Clouds**\nSouth of the clouds lies yet another stream,\nWhere cinnabar gravel bears no trace of mud.\nHerbs are sold by Ba merchants,\nBranches teem with Yue crows’ cries.\nAt night, the moon rises before midnight,\nAs autumn nears, I ask if the mists deceive.\nIf I could dwell in these mountain hues,\nI’d pluck lingzhi and ferns with my own hands.\n\n**Northern Clouds**\nNorth of the clouds, near Yang Creek,\nDwellings cling to ravines in a chain.\nAltars stand beneath the stars,\nPavilions brush the green-tinged heights.\nHalf the distant peaks are veiled in rain,\nThree ancient wells hold lingering smoke.\nIf a path to Golden Court exists,\nIt must lead to the Left Spirit’s realm.\n\n**Deer Pavilion**\nBeneath the Deer Pavilion’s crags,\nI often lead white deer past.\nFine grass invites long slumber,\nFragrant springs beckon deep draughts.\nBy sound, I find the moonlit dell,\nBy path, I reach the mist-wreathed vines.\nSoon, I’ll drink the golden elixir,\nAnd ride aloft to the Crimson River.\n\n**Fan Pavilion**\nWhen was this ancient pavilion built?\nIts master, they say, soared with the sun.\nTo this day, mountain recluses tell\nHow he sometimes rides a jade unicorn home.\nMilk-like sap drips from tender pines,\nLingzhi platforms rise from subtle stone.\nLeaning on the rail, my gaze strains far—\nNo sign of feathered robes in flight.\n\n**Chanyuan Grotto**\nA flying waterfall pours from cloud-roots,\nIts murmuring voice eternal.\nLike twin flutes blown in harmony,\nOr a zither played at sunset’s glow.\nIt churns dragon-spittle through inverted caves,\nSplashes crane’s robes through pines it pierces.\nWho will play its moonlit tune?\nSurely one who chants the Upper Clarity’s hymns.\n\n**Green Lattice Fruit**\nThe mountain’s fruit is called Green Lattice,\nGrowing in ordered ranks around the ridge.\nIts outer form rivals green jade’s hardness,\nIts inner savor vies with jasper’s bloom.\nWoodcutters’ children gather fallen ones,\nTapping the grove to startle roosting crows.\nSurely immortal officials guard it,\nOffering it now and then to the Celestial City.\n\n**Juhou (Macaque)**\nWhy is it called Juhou?\nFirst enfeoffed here in Siming’s bounds.\nThey drink with linked arms,\nNever uttering heart-rending cries.\nWild vines trail their slender tassels,\nCold springs grind jade’s purity.\nAmid the grove, wandering officials—\nWho among them will become a lord?\n\n---\n\n**\"Stone Window’s Skin\"**\n*By Jiaorizi (Biaomei, courtesy name Xiuru)*\n\nThe window opens by the Dao’s own will,\nRevealing distant azure cliffs.\nMoss weaves patterns like damask,\nClouds drift as if through gauze.\nWithin the lattice, the moon spills empty light,\nAt the sill, no rosy glow lingers.\nI wonder where it leads—\nIt must connect to the Jade Maiden’s home.\n\n---\n\n**\"Passing Clouds\"**\nA powdered grotto stretches twenty leagues,\nWhere recluses tread its heart.\nFor a moment, deer tracks vanish,\nA single step parts human voices.\nWith my staff, I part the mist’s green,\nWith my sleeve, I brush the faint glow.\nLong have I wandered without circling back—\nI fear I’ve entered the Celestial City.\n\n---\n\n**\"Southern Clouds\"**\nSouth of the clouds, a river flows,\nNo crows alight before the peaks.\nVillage gardens bloom with red peonies,\nHouseholds draw from white springs.\nChildren all seem ancient,\nMarriages like those of immortals.\nTogether, they form true official households,\nNever taxed on their stone fields.\n\n---\n\n**\"Northern Clouds\"**\nNorth of the clouds, the day is dim,\nI wonder if I’ve turned my back on the Star of Longevity.\nDogs know the scent of herbs,\nPeople trace lingzhi’s form.\nResting in the wild, beneath pine canopies,\nDrunk, I write on lotus-leaf stone screens.\nIf I burn incense and dwell here,\nI should gain entry to Golden Court.\n\n---\n\n**\"Deer Pavilion\"**\nDeer grass thrives here,\nSo I pass through white clouds’ eaves.\nI wait long by blossoms for the doe,\nLead dust slowly through bamboo.\nFor hours, I drink from jade streams,\nAll day, I savor golden lingzhi.\nLiving beneath the Stone Window,\nI become an immortal unawares.\n\n---\n\n**\"Fan Pavilion\"**\nThe master became one of the ranked immortals,\nHis pavilion alone remains.\nStone grottoes echo with human barks,\nPine winds startle sleeping deer.\nThe well’s fragrance is the great elixir,\nThe crane’s call is an empty tale.\nI’d buy this place to hide again,\nBut cloud-capped peaks demand no coin.\n\n---\n\n**\"Chanyuan Grotto\"**\nWater flows from a ten-thousand-fathom source,\nAll day it cascades in murmuring streams.\nIt shatters a full moon’s disc,\nMelts half the sky’s expanse.\nIts sound rouses the valley’s breath,\nIts force whirls clouds to drink.\nI imagine a late autumn night,\nWhen all the ancient immortals gather by its flow.\n\n---\n\n**\"Green Lattice Fruit\"**\nMountain winds ripen this wondrous fruit,\nNightly offered to true immortals.\nIts taste rivals cloud-fat’s richness,\nIts shape like jade brains, round.\nWild cranes gather where it’s plucked,\nHalf its fall lands in numinous springs.\nIt must share the Peach Blossom’s lineage,\nBlooming without reckoning years.\n\n---\n\n**\"Juhou\"**\nHow enviable is Juhou’s realm,\nWith jade-green cliffs in countless folds.\nMist-wreathed vines serve as seals and sashes,\nHoneyed fruits are its domain’s bounty.\nThe masses send the Monkey Lord to ferry them,\nFruit is commanded to serve the young.\nIf you, too, do not die,\nYou should ascend to the Dark Mystery’s school.\n\n---\n\n**\"Song of the Waterfall\"**\n*By Xie Shihou (Jingchu)*\n\nA flying spring leaps green cliffs,\nTowering thousands of fathoms high.\nIt rushes down from the heavens,\nSeeming as broad as bolted silk.\nA winding ridge parts the verdant woods,\nIts roar reaches me first.\nBeside it stands a giant stone,\nSmooth and hollow, fit for repose.\nVulgar men never come here,\nBut we have come to savor its sight.\nWe must wait for autumn’s clarity,\nThen climb the vines to draw near.\n\n---\n\n**\"Wandering Siming\"**\n*By Sun Jihe (Yingshi)*\n\nAll my life, I’ve cherished distant longings,\nStroking my sword, I wander far.\nNow, I cast off the world’s clamor,\nMy heart conspires with cliffs and ravines.",
      "overlap_context": "r Xue, present it here.\n\nComposed on the first day of the tenth lunar month in the winter of the twenty-first year of the Zhizheng era by Lu Jian of Linchuan.\n\n**Poem by Tang Worthy: \"Seeing Off Daoist Master Xiao Returning to Siming Mountain\" by Meng Jiao of Dongye**\n\nLeisurely as a solitary crane’s heart,\nVast as the age of a towering pine.\nEmerging beyond the myriad things,\nHe dwells high on Siming’s peak.\nA thousand fathoms of sheer, aligned peaks,\nA hundred-foot cascade of plunging springs.",
      "start_char": 5556,
      "end_char": 6889,
      "start_sentence": 270,
      "end_sentence": 383,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.747127056121826,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "束征泛苍海，南惊瑜丹丘，西登岷峨啸，北望关陇愁。 康庐挽归辔，巫峡纡行舟。 剑阁最险壮，龙门更奇幽。 历览虽未饱，胜盘略已收。 尔来卧竹湖，清梦长夷犹。 家山维四明，名字横九州。 出门宛在眼，欲往辄不酬。 人事真好乖，山灵岂吾仇。 忽近益可吠，投老空自尤，兹辰正芳春，会心得良俦。 赢粮幸易足，快策遂所求。 中宵雨声断，逗晓霁色浮。 天容极莹争，风气亦和柔。 瘦节挟篮舆，野服兼轻裘。 遥遥指林麓，欣欣听泉流。 试屐青姻岭，弭益白水愀。 飞湍响淙潺，怪松钧飕飕。 恨哉上羊额，喘若料虎头。 臂石防岁基，负樵歌道周。 百折快一眺，千里森双眸。 峰峦何绵联，脉络相缠缪。 化钧妙融结，神功巧雕搜。 长风动瞑渤，洪涛簸瀛洲。 臣鳖出属负，游龙绕拗缪。 鲸鹏恣摩荡，虫鱼纷迭稠。 万怪各起伏，千帆递行留。 或坦若几席，或峨若冠谎。 或排若剑戟，或刻若戈矛。 或舞若鸾凤，或骤若驿骊。 或戏若狡睨，或搏若琳魏。 俨然开明堂，玉帛朝诸侯。 赫然会岐阳，长围方大搜。 鏖战临长平，坚壁持鸿沟，广野列车骑，中军严筛终。 开辟浩茫茫，变化久悠悠。 愕盼不得语，形容那可伴。 仙树四十围，蟠根几千秋。 老干枯不死，新荣翠相穋。 飕驭定来止，桑田行验不。 遗迹信所闻，轻举当何由。 束南径崇冈，左右罗平畴。 人家散鹦犬，村坞来羊牛。 官征毕薪炭，春事勤锄扰。 土腻少沙石，气寒无麦舞。 荒蹊夹桃李，密荫开松揪。 是中可避世，何劳更乘柠。 骈岩下峭壁，别岫争幸晒。 孰云二剎胜，逝肯中道休。 仗锡既巉绝，雪窦仍阻修。 停云朝漠漠，刚风昼飕飕。 盘磴度方桥，广宇连飞楼。 珠玑错藻绣，金碧照丹髭。 撞钟食千指，呜板灯百簧。 真来天上居，不涉人问忧。 周遭富佳致，徜徉得穷搜。 妙峰远色赓，锦镜波光浏。 两滇赴活活，千丈落洒洒。 深瀑标随亮，品潭隐灵虹。 倒窥凛欲眩，俯掬清可漱。 涧草高下积，岩花零乱抽。 挂壁见猓捷，食苓闻鹿哟。 日长啭睨院，雾暗啼钩轿。 修竹奏竽瑟，细溜呜琳谬。 占大喜弄鹊，畏雨愁呼鸠。 何方共斋钵，且复荐茶瓯。 老僧颇好事，名德肯见投。 随意宿山房，无眠听更筹。 念昔身万里，及取天一陬。 登临世界阔，悦仰岁月道。 荣辱两蜗角，聚散一海鸥。 尘鞅自束缚，名场相敌雕。 不念猿鹤怨，坐令泉石羞。 心期晚乃惬，俗驾我尚优。 胜具学支许，奇踪非阮刘。 时哉山梁雉，乐矣濠工鲦。 聊追兴公赋，不欲柳子囚。 招招知音子，为我商声枢。 咏登仙木 刘樊蝉蜕此登仙，老木当年已插天。 玉骨半枯犹秀润，苍皮新长更荣鲜。 蟠桃时熟三千岁，铜狄重摩五百年。 化鹤未归山寂寂，徘徊谁与问因绿。 咏青棂子　　　　　　　　　史洗 羽忆新从帝所回，余欢未尽玳筵开。 醉抛青子香泥上，留与仙家取次栽。 访混朴昊尊师 何年隐四明，与世绝逢迎。 圣主方虚席，先生不入城。 风雷随地起，宫殿自天成。 近喜篮舆稳，宁忧白发生。 游四明留题丹山　　唐景实　震 四明光照九霄寒，闱苑神仙日往还。 瀑布远从银汉落，洞门长锁白云闲。 深崖瑞木金文润，绝顶灵搓铁色斑。 无限遗综人莫识，落花香泛水潺潺。 游丹山　　　　　　孙元实　子秀 四明洞天居第九，巨灵擘石开窗牖。",
      "translated_text": "**Wandering Far and Wide**\n\nI bound my travels to sail the azure sea,\nSouthward, I marveled at the crimson isles of Danqiu;\nWestward, I climbed Min and E, letting forth a long whistle,\nNorthward, I gazed toward Guan and Long with sorrow.\n\nKang and Lu pulled at my returning reins,\nWu Gorge coiled my drifting boat.\nSword Pavilion stood most perilous and grand,\nDragon Gate even more wondrous and secluded.\nThough my journeys were not yet sated,\nI had gathered a glimpse of their finest scenes.\n\nOf late, I lie by Bamboo Lake,\nMy clear dreams ever lingering in ease.\nMy homeland is the Four Bright Mountains,\nIts name famed across the Nine Provinces.\nWhen I step out, it seems ever before my eyes,\nYet each time I wish to go, my desire goes unfulfilled.\nWorldly affairs are truly perverse,\nDoes the mountain spirit bear me ill will?\nThe nearer I draw, the more it seems to mock,\nIn my old age, I reproach myself in vain.\nNow, in the height of fragrant spring,\nI meet kindred hearts and find good company.\nFortunately, provisions are easily gathered,\nAnd with swift steps, I pursue my longing.\n\nAt midnight, the rain’s sound ceases,\nBy dawn, the clearing skies float bright.\nThe heavens stretch vast and gleaming,\nThe wind’s breath gentle and mild.\nWith a slender staff, I grasp my bamboo sedan,\nIn rustic garb and light fur.\nFrom afar, I point toward the forest’s edge,\nJoyfully listening to the flowing springs.\n\nI test my clogs on Green Mist Ridge,\nRest by White Water’s melancholy shore.\nFlying rapids roar with rushing streams,\nStrange pines sway with whistling winds.\nAlas, ascending Goat’s Brow,\nI pant as if feeding a tiger’s head.\nI cling to rocks to guard against the year’s end,\nBearing firewood, I sing of the Dao’s circuit.\n\nA hundred turns, yet each glance brings delight,\nA thousand leagues stretch before my eyes.\nHow the peaks and ridges intertwine,\nTheir veins and sinews entwined.\nThe Creator’s artistry fuses and shapes,\nDivine craftsmanship carves and searches.\nA long wind stirs the twilight sea,\nMighty waves toss Yingzhou Isle.\nMinisterial turtles emerge, bearing their burdens,\nWandering dragons coil in sinuous paths.\nWhales and roc birds frolic and surge,\nFish and insects teem in dense throngs.\nA myriad wonders rise and fall,\nA thousand sails pass and linger.\nSome lie flat as a table,\nOthers tower like a crown or cap.\nSome stand arrayed like swords and halberds,\nOthers are carved like spears and pikes.\nSome dance like phoenixes,\nOthers gallop like post horses.\nSome play like cunning glances,\nOthers grapple like jade and marble.\nSolemnly, they seem to open a grand hall,\nWhere jade and silk greet the feudal lords.\nMajestically, they gather at Qiyang,\nA great encirclement in full pursuit.\nFierce battles rage near Changping,\nStalwart defenses hold Honggou’s divide.\nThe open plains array chariots and cavalry,\nThe central camp stands firm with drum and song.\n\nThe vastness of creation stretches boundless,\nIts transformations endure through endless time.\nStartled, I gaze but cannot speak,\nHow could mere form ever compare?\nA sacred tree, forty spans in girth,\nIts coiled roots aged for thousands of autumns.\nThough its old trunk withers, it does not die,\nNew verdure flourishes in emerald hues.\nThe wind’s chariot surely comes and goes,\nWill the mulberry fields soon prove the tale?\nThe legends of its traces are well attested,\nBut how could one lightly ascend to such heights?\n\nSoutheastward, I traverse lofty ridges,\nOn either side, level fields unfold.\nVillages scatter dogs and chickens,\nHamlets send forth sheep and cattle.\nOfficials collect firewood and charcoal,\nSpring labors urge hoes to toil.\nThe soil is rich, with little sand or stone,\nThe air is cold, and wheat does not sway.\nWild paths flank peach and plum trees,\nDense shade opens to pines and cypress.\nHere, one could escape the world—\nWhy seek further refuge by boat?\n\nTwin cliffs descend in sheer walls,\nSeparate peaks vie for sunlight.\nWho says the two monasteries are not sublime?\nHow could I turn back midway?\nWith my staff, I scale perilous heights,\nSnowy Abyss still bars the way.\nMorning clouds hang thick and still,\nDaytime winds whistle and howl.\nI cross winding steps over a square bridge,\nVast halls connect to soaring towers.\nPearls and jades interlace with embroidered patterns,\nGold and azure gleam on vermilion eaves.\nThe bell tolls for a thousand fingers,\nThe wooden clappers sound with a hundred lamps.\nTruly, this is a heavenly abode,\nUntouched by mortal cares.\n\nAll around, beauty abounds,\nI wander and explore to my heart’s content.\nDistant peaks echo in resplendent hues,\nThe brocade mirror’s waves shimmer and flow.\nTwo streams rush with lively murmurs,\nA thousand fathoms cascade in sparkling falls.\nDeep cataracts mark their radiant paths,\nHidden pools cradle rainbows.\nLooking down, I shudder with vertigo,\nBending to scoop water, its clarity refreshes.\nValley grasses pile high and low,\nRock flowers bloom in wild profusion.\nOn the cliffs, agile gibbons dart,\nDeer call as they feast on lingzhi.\nThe long day resounds with orioles’ songs,\nMisty shadows echo the cuckoo’s cry.\nTall bamboos play the pipes and zither,\nFine streams murmur with jade-like tones.\nThe magpie’s chatter brings joy,\nThe turtledove’s call forebodes rain.\nWhere shall I share my alms bowl?\nFor now, I offer tea in a simple cup.\n\nThe old monk delights in conversation,\nA man of renown, he welcomes my visit.\nAt ease, I lodge in his mountain chamber,\nSleepless, I listen to the night watch’s tally.\n\nI recall when I was ten thousand leagues away,\nNow I reach this corner of the heavens.\nAscending, I behold the world’s vastness,\nRevering the years’ passage.\nHonor and disgrace are but snail horns,\nGatherings and partings like sea gulls.\nThe dust’s harness binds me,\nThe arena of fame pits me against rivals.\nI heed not the gibbons’ and cranes’ laments,\nYet I shame the springs and stones.\nMy heart’s desire is at last fulfilled,\nWhile the world’s chariot still outpaces me.\nI learn from Zhi and Xu’s refined tastes,\nMy extraordinary path is not like Ruan’s or Liu’s.\nHow timely, like the pheasant on the mountain beam,\nHow joyful, like the minnows in Zhuangzi’s stream.\nI briefly follow Xinggong’s rhapsody,\nI do not wish to be imprisoned like Liuzi.\nCome, my learned friend,\nPlay for me the *shang* mode’s melody.\n\n---\n\n**Ode to the Ascending Immortal Tree**\n*By Liu Fan*\n\nThis cicada-shed tree ascends to immortality,\nIn its prime, it already pierced the heavens.\nIts jade-like bones half-withered, yet still lustrous,\nIts ancient bark newly grown, ever fresh.\nPeaches of immortality ripen every three thousand years,\nBronze guardians polish it for five hundred more.\nThe crane has not returned, the mountain lies still—\nWho lingers to ask of its origins?\n\n---\n\n**Ode to the Green Lingzhi**\n*By Shi Xi*\n\nRecalling its recent return from the imperial court,\nUnspent joy lingers as the tortoiseshell banquet unfolds.\nDrunken, I cast the green spores upon fragrant earth,\nLeaving them for the immortals to plant at their leisure.\n\n---\n\n**Visiting Master Hunpu, the Venerable Hao**\n\nIn what year did you hide in the Four Bright Mountains,\nCutting all ties with the world?\nThe sagely lord leaves his seat vacant,\nYet you refuse to enter the city.\nWind and thunder rise from the earth,\nPalaces form by heaven’s will.\nGladly, your bamboo sedan rides steady—\nWhy fear the coming of white hair?\n\n---\n\n**Inscribed While Traveling the Four Bright Mountains: Dan Mountain**\n*By Tang Jingshi*\n\nThe Four Bright Mountains gleam, chilling the nine skies,\nFairy gardens where immortals daily come and go.\nWaterfalls plunge from the Silver River’s distant flow,\nCave gates remain sealed in idle white clouds.\nDeep cliffs nurture auspicious trees with golden veins,\nLofty peaks bear sacred fungi with iron-hued spots.\nCountless relics lie unrecognized—\nFallen blossoms drift on murmuring streams.\n\n---\n\n**Traveling Dan Mountain**\n*By Sun Yuanshi*\n\nThe Four Bright Mountains rank ninth among cave heavens,\nThe mighty spirit cleaved stone to open windows and doors.",
      "overlap_context": "d as bolted silk.\nA winding ridge parts the verdant woods,\nIts roar reaches me first.\nBeside it stands a giant stone,\nSmooth and hollow, fit for repose.\nVulgar men never come here,\nBut we have come to savor its sight.\nWe must wait for autumn’s clarity,\nThen climb the vines to draw near.\n\n---\n\n**\"Wandering Siming\"**\n*By Sun Jihe (Yingshi)*\n\nAll my life, I’ve cherished distant longings,\nStroking my sword, I wander far.\nNow, I cast off the world’s clamor,\nMy heart conspires with cliffs and ravines.",
      "start_char": 6889,
      "end_char": 8151,
      "start_sentence": 384,
      "end_sentence": 478,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.38913869857788,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "扪萝陆辙不惮劳，同行昆遇忘年友。 老苔护石苍虎闲，飞瀑悬岩玉龙吼。 豁然人与境俱胜，醉歌拍缶忘升斗。 固知壶中别有天，未必醉翁真在酒。 徘徊步月澹忘归，世事浮云竟何有。 又　　　　　　　　　孙耕宽　嘉 与客穷幽胜，同登白水山。 银涛翻月落，苍壁倚天寒。 采药穿云坞，围棋坐石坛。 因忘归路晚，纫佩得秋兰。 又　　　　　　　　丰霞隐　自孙 万古丹山洞，今朝遂一游。 瀑高寒激雪，崖老晚疑秋。 驯虎随仙去，高堂有像留。 独嫌归太速，未得细寻幽。 咏瀑布　　　　　　　郭白云　亨嘉 尽日看无倦，神清骨自仙。 响添一夜雨，雄进百岩泉。 转石雷生壑，悬崖剑倚天。 好奇忘我老，犹欲上危巅。 又　　　　　　　　　　赵澹山 玉龙吼山山为开，怒涛进出翻崔鬼。 回风便可作飞雨，共听万壑呜春雷。 又　　　　　　　　赵竹逸　至道 飞落寒泉一振高，初闻响似浙江潮。 松阴无雨云长润，石宝虽晴雪未消。 素练几时悬绝壁，白虹千尺跨层霄。 丹山自是神仙府，弱水流来故不遥。 又　　　　　　　　僧雷崖圆丘 满目飞晴雪，丹山见白虹。 天机垂不尽，地轴卷无穷。 荡漾沉寒玉，飘零散晓风。 人问何处着，应直到龙宫。 元朝 题丹山赠石田炼师 黄晋卿  缙 石田外史丹山住，如此溪山得此人。 高咏久无皮袭美，清风复见谢遗尘。 门前飞瀑长翻雪，洞口幽花浅驻春。 老我京华归访隐，抱琴安得日相亲。 题瀑布            刘德玄  仁本 白水真仙骑自鹤，何年蜕骨此山中。 化为玉练垂千尺，翻却银河落半空。 鹤梦晓遗明月帐，鲛人夜掣水晶宫。 天台有客诗难就，归兴琼台双阙束。 又 中天飞瀑下瑶台，素练高悬亦怪哉。 织女投机收不得，姐娥剪水巧为裁。 光连双阙星河动，响挟千山风雨来。 祠宇洞前看未足，又随明月过天台。 送毛石田住白水宫　　　　张伯雨 拥剑住丹山，凌风袂羽翻。 空坛遗寂寞，飞瀑泻潺湲。 供薄难为客，山深不闭门。 大兰千仞顶，有日遇刘樊。 题白水宫 二仙控辔上青昱，千古流闻迹未陈。 白水主人传甲乙，青灯留我守庚申。 云根瀑落长疑雨，洞口花开自得春。 回首人问又尘土，芒鞋好结道为邻。 又　　　　　　　　　　　　赵君璋 曾共樵夫采药回，丹崖遥见白云堆。 百千万劫仙风在，三十六溪春水来。 琳馆随时容笑傲，杖华沾湿上崔鬼。 洞门深锁无人识，应是刘樊去后开。 又　　　　　　　　　　　高则诚　明 四明山中春雨余，三台峰下访仙居。 云开翠碧浮金阙，风定银河下玉虚。 幽洞夜明丹化鹤，清溪昼静獭窥鱼。 凭君为问刘樊信，青乌西来好寄书。 仙传二仙尝戏卫刘唾水成鱼樊唾水成獭故云云 又 丹山胜盘天下奇，重溪迭幛游人稀。",
      "translated_text": "Clutching vines and tracing wheel-ruts, undaunted by toil,\nI journey with Master Kun, a friend beyond years.\nAncient moss guards the stones where gray tigers repose,\nA flying waterfall hangs from cliffs where jade dragons roar.\n\nSuddenly, man and scene alike transcend,\nDrunk, we sing and beat jars, heedless of rank.\nI know well the heavens within the gourd—\nNot all who drink are truly lost in wine.\n\nWandering beneath the moon, I linger, forgetful of return,\nWorldly affairs like floating clouds—what are they after all?\n\n---\n\n**Another Poem**\n*By Sun Gengkuan*\n\nWith guests, I explore the depths of wonders,\nTogether we ascend Whitewater Mountain.\nSilver waves churn as the moon descends,\nAzure cliffs lean against the cold sky.\nGathering herbs, we thread through clouded ravines,\nPlaying weiqi, we sit upon a stone altar.\nForgetting the late hour of return,\nI pluck orchids to fasten at my belt.\n\n---\n\n**Another Poem**\n*By Feng Xia Yin*\n\nFor ages, the caves of Dan Mountain,\nToday, at last, I wander through.\nWaterfalls, high and cold, crash like driven snow,\nAncient cliffs, in twilight, seem autumn’s hue.\nTamed tigers follow immortals away,\nA lofty hall preserves their lingering forms.\nI regret my return too swift—\nI’ve yet to seek its hidden depths.\n\n---\n\n**Ode to the Waterfall**\n*By Guo Baiyun*\n\nAll day I watch, never weary,\nMy spirit cleansed, my bones feel immortal.\nA night’s rain swells its roar,\nA hundred cliffs’ springs surge in might.\nTurning stones, thunder shakes the ravine,\nFrom sheer cliffs, a sword points to heaven.\nEnamored of wonders, I forget my age,\nStill longing to climb the perilous peak.\n\n---\n\n**Another Poem**\n*By Zhao Danshan*\n\nJade dragons roar, and mountains part,\nRaging torrents surge, churning cliffs.\nA whirlwind could become flying rain,\nTogether we hear ten thousand gorges roar like spring thunder.\n\n---\n\n**Another Poem**\n*By Zhao Zhuyi*\n\nThe cold spring flies, its first sound like the Zhe River’s tide.\nBeneath pines, though rainless, clouds remain moist,\nOn stone treasures, though clear, snow lingers unmelted.\nA white silk banner hangs from sheer cliffs,\nA rainbow of a thousand feet spans layered skies.\nDan Mountain is itself an immortal’s abode—\nThe Weak River’s flow comes not from afar.\n\n---\n\n**Another Poem**\n*By Monk Leiyuan Yuanqiu*\n\nMy eyes fill with flying bright snow,\nOn Dan Mountain, a white rainbow appears.\nHeaven’s mechanism hangs, never exhausted,\nEarth’s axis rolls, boundless.\nRippling, it sinks like cold jade,\nScattered, it drifts on the dawn wind.\nIf asked where it alights—\nIt must reach the Dragon Palace.\n\n---\n\n**Inscribed on Dan Mountain, Presented to Recluse Shitian**\n*By Huang Jinqing of the Yuan Dynasty*\n\nBeyond Shitian’s history, Dan Mountain dwells,\nSuch streams and peaks matched with such a man.\nLong has lofty verse lacked Pi Rixiu’s touch,\nYet the pure wind returns, as in Xie’s dust-free days.\nBefore his gate, flying waterfalls ever churn snow,\nAt his cave’s mouth, delicate flowers briefly hold spring.\nOld, I return from the capital to seek seclusion—\nWhen may I hold my zither and daily draw near?\n\n---\n\n**Inscribed on the Waterfall**\n*By Liu Dexuan*\n\nThe Whitewater Immortal once rode a crane—\nIn what year did he shed his bones upon this mountain?\nTransformed into a jade ribbon, it hangs a thousand feet,\nThe Silver River overturned, falling from midair.\nAt dawn, the crane’s dream lingers in the moonlit canopy,\nAt night, the merfolk tug at the crystal palace.\nA visitor from Tiantai finds his poem unfinished,\nHis thoughts of return bound by jade towers and paired gates.\n\n---\n\n**Another Poem**\n\nFrom mid-heaven, the waterfall descends upon the jade terrace,\nA white silk banner hangs—how strange!\nThe Weaving Maid casts her loom, unable to gather it,\nChang’e cuts the water, skillfully tailoring its form.\nIts light connects twin gates, stirring the starry river,\nIts roar carries a thousand mountains’ wind and rain.\nBefore the shrine and cave, I gaze, unsatisfied—\nAgain, I follow the bright moon past Tiantai.\n\n---\n\n**Seeing Off Mao Shitian to Reside at Whitewater Palace**\n*By Zhang Boyu*\n\nGirding his sword, he dwells on Dan Mountain,\nHis sleeves like wings, riding the wind.\nThe empty altar remains desolate,\nThe flying waterfall cascades in murmurs.\nMeager offerings make a poor host,\nThe mountain’s depths leave no gate closed.\nAtop the thousand-fathom peak of Great Orchid,\nOne day, he shall meet Liu and Fan.\n\n---\n\n**Inscribed on Whitewater Palace**\n\nTwo immortals rein in their steeds upon the azure void,\nTheir ancient fame flows on, their traces yet unclear.\nThe Whitewater Master transmits the Jia and Yi,\nA green lamp keeps me through the Gengshen night.\nFrom cloud-rooted cliffs, the waterfall falls, ever mistaking rain,\nAt the cave’s mouth, flowers bloom, naturally embracing spring.\nTurning back, the human realm is but dust—\nBest to bind straw sandals and make Dao my neighbor.\n\n---\n\n**Another Poem**\n*By Zhao Junzhang*\n\nOnce with woodcutters, I returned from gathering herbs,\nFrom afar, on cinnabar cliffs, white clouds piled.\nThrough a hundred thousand kalpas, the immortal’s wind endures,\nFrom thirty-six streams, spring waters come.\nJade halls, in their time, permit carefree laughter,\nMy staff, dampened, ascends towering peaks.\nThe cave’s gate, deeply sealed, unknown to all—\nIt must have opened after Liu and Fan’s departure.\n\n---\n\n**Another Poem**\n*By Gao Zecheng of the Ming Dynasty*\n\nIn the Four Bright Mountains, after spring rain,\nBeneath the Three Terraces Peak, I seek an immortal’s abode.\nClouds part, emerald jade floats beside golden palaces,\nThe wind stills, the Silver River descends from the Jade Void.\nAt night, the secluded cave glows as cinnabar transforms cranes,\nBy day, the clear stream rests as otters watch fish.\nI entrust you to ask after Liu and Fan’s news—\nA blue bird from the west would bear a letter well.\n\n*(Note: The \"Liu and Fan\" refers to legends of two immortals who once played tricks—Liu spat water to form fish, Fan spat water to form otters.)*\n\n---\n\n**Another Poem**\n\nDan Mountain’s wonders coil, unmatched under heaven,\nLayered streams and towering peaks—few travelers tread.",
      "overlap_context": " gardens where immortals daily come and go.\nWaterfalls plunge from the Silver River’s distant flow,\nCave gates remain sealed in idle white clouds.\nDeep cliffs nurture auspicious trees with golden veins,\nLofty peaks bear sacred fungi with iron-hued spots.\nCountless relics lie unrecognized—\nFallen blossoms drift on murmuring streams.\n\n---\n\n**Traveling Dan Mountain**\n*By Sun Yuanshi*\n\nThe Four Bright Mountains rank ninth among cave heavens,\nThe mighty spirit cleaved stone to open windows and doors.",
      "start_char": 8152,
      "end_char": 9340,
      "start_sentence": 479,
      "end_sentence": 550,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.61797308921814,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "千年祠宇近霄汉，百尺飞泉摇夕晖。 玉童吹笙明在户，仙子朝真云满衣。 我来信宿噪兴感，扰扰何时能息机。 又　　　　　　　　　　僧白云　自悦 闻说石田能好奇，清晖亭下每忘归。 岂无飞佩来丹极，时有祥云护翠微。 春雨碧桃香冉冉，秋风琪树绿依依。 前年因过仙翁宅，曾看岩西白水飞。 寄白水宫毛外史　　　　宋无逸　元僖 平生未到丹山下，乡里空闻白水名。 路入洞天无百里，身游仙境是三生。 花问笙鹤春云绕，水际亭台晓日明。 寄语石田毛外史，相期日暖雕黄精。 题瀑布　　　　　　　孙道心　士志 玉龙战罢力披靡，倒挂丹山飞不起。 霆奔雷吼勇作气，迸出银演半天水。 银演迢迢水为枯，寒光不动山月孤。 两崖中断地转轴，万丈直下渊无鱼。 六月飞雪不受暑，使我神清慕仙倡。 刘樊当年同上升，古木参天更如许。 中问作者虽罕闻，亦有混朴之真人。 洞开尚留丹气暖，鹤返共说桃源春。 凭君为歌招隐曲，日暮山中枕流宿。 明朝分与一勺多，一洗人间尘万斛。 又　　　　　　　　　　　朱景纯　炯 我生颇有姻霞癖，倚杖看山日几回。 石穴凿开丹凤去，瀑泉飞作玉龙来。 因风忽洒半空雪，不雨长呜万壑雷。 独羡山中毛外史，隐居真得小蓬莱。 又　　　　　　　　　陈邦协　雍 水从何处来，流出白云堆。",
      "translated_text": "The millennia-old shrine nears the celestial vault,\nA hundred-foot cascading spring sways in the evening glow.\nJade lads play their flutes, their light lingering at the door,\nImmortal maidens pay homage to the True—clouds clothe their robes.\nI arrive, stay two nights, stirred by clamor and reflection,\nWhen shall this restless world cease its scheming?\n\n---\n\n**Another Poem**\n*By Monk Baiyun, self-styled Ziyue*\n\nI hear the Stone Fields delight in wonders,\nBeneath the Pavilion of Clear Radiance, I often forget to return.\nAre there none with flying pendants who ascend the cinnabar summit?\nYet auspicious clouds at times shield the verdant peaks.\nSpring rain graces the peach blossoms with fragrance, soft and lingering,\nAutumn winds caress the jade trees, their green leaves swaying gently.\nTwo years past, I passed the immortal elder’s dwelling,\nAnd saw the white waters flying west of the cliffs.\n\n**To the Historian Mao of the White Water Palace**\n*By Song Wuyi of the Yuan Dynasty*\n\nIn my lifetime, I’ve never set foot beneath Dan Mountain,\nYet in my hometown, I’ve only heard the name of White Water.\nThe path into the grotto-heaven spans less than a hundred li,\nMy journey through the immortal realm fulfills three lifetimes.\nFlowers converse with cranes and flutes as spring clouds swirl,\nBy the water’s edge, pavilions and terraces gleam in the morning sun.\nI send word to Historian Mao of the Stone Fields:\nLet us meet when the days grow warm to carve yellow essence.\n\n**On the Waterfall**\n*By Sun Daoxin, styled Shizhi*\n\nThe jade dragon battles, its strength spent and scattered,\nHanging inverted from Dan Mountain, it cannot take flight.\nWith the fury of thunder and the roar of lightning, it gathers its might,\nBursting forth as silver threads of water across half the sky.\nThe silver threads stretch far, the waters run dry,\nCold light unmoving, the mountain moon solitary.\nThe two cliffs part as if the earth’s axis turns,\nA ten-thousand-zhang plunge—no fish in the abyss.\nIn the sixth month, snow flies, untouched by summer’s heat,\nIt clears my spirit, and I yearn for the immortal’s song.\nLiu and Fan ascended together in those bygone years,\nAncient trees pierce the heavens, just as they were then.\nThough few are heard of who dwell here now,\nThere are still those of uncarved simplicity, true men.\nThe grotto remains open, its cinnabar qi still warm,\nCranes return, speaking of the Peach Blossom Spring.\nI entrust you to sing the *Zhaoyin* melody,\nAt dusk, pillowing on the stream in the mountains.\nCome morning, share with me a single ladle’s worth,\nTo wash away the world’s dust by the myriad *hu*.\n\n---\n\n**Another Poem**\n*By Zhu Jingchun, styled Jiong*\n\nMy life bears a fondness for mist and rosy clouds,\nLeaning on my staff, I gaze at the mountains time and again.\nThe stone cavern opens, and the cinnabar phoenix departs,\nThe waterfall flies, transforming into a jade dragon.\nRiding the wind, it scatters snow across half the sky,\nWithout rain, it roars like thunder through ten thousand valleys.\nI alone envy Historian Mao of the mountains,\nWho in seclusion has truly found a lesser Penglai.\n\n---\n\n**Another Poem**\n*By Chen Bangxie, styled Yong*\n\nFrom whence does the water come?\nFlowing forth from the white clouds’ embrace.",
      "overlap_context": "id.\nAt night, the secluded cave glows as cinnabar transforms cranes,\nBy day, the clear stream rests as otters watch fish.\nI entrust you to ask after Liu and Fan’s news—\nA blue bird from the west would bear a letter well.\n\n*(Note: The \"Liu and Fan\" refers to legends of two immortals who once played tricks—Liu spat water to form fish, Fan spat water to form otters.)*\n\n---\n\n**Another Poem**\n\nDan Mountain’s wonders coil, unmatched under heaven,\nLayered streams and towering peaks—few travelers tread.",
      "start_char": 9341,
      "end_char": 9927,
      "start_sentence": 551,
      "end_sentence": 581,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.10692596435547,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "喷洒 千尺雪，砰砌万壑雷。 道人清彻骨，坐 客冷无埃。 一笑下山去，拥琴踏月回。 题白水宫 枕中鸿宝定堪传，住近丹山第九天。 振迩每寻云水外，标名合在石崖边。 雨晴瀑布偏闻夜，火暖丹炉不记年。 时尽一壶歌一曲，任渠唤作地行仙。 清晖亭 涤颖冰瓯思不群，满亭诗景绝埃纷。 好山当面开清碧，活水源头写白云。 铁笛叫蟾寒欲起，玉笙招鹤夜初分。 兴来徙倚看长剑，时有神光射斗文。 题丹山　　　　　　　高伯元　彝 丹山赤水神仙宅，布鞯青鞋作胜游。 百尺飞泉银汉雪，一声映鹤洞天秋。 青棂子熟云坛静，琪树花开石室幽。 无限溪山留胜盘，何时卜筑向林丘。 又　　　　　　　　陈履常　克履 四明空阔石窗开，中有仙人白玉台。 一水远从天上落，三台高拱洞前来。 老搓瘦骨疑龙化，密竹清阴待凤回。 每向鄞江求胜迹，却於此地得蓬莱。 又 铁衣聪马踏苍苔，忽扣仙门石洞开。 碧汉秋声悬白水，紫云春色下丹台。 刘仙久矣乘鸾去，韩令今仍跨鹤来。 樽酒相逢足清兴，新诗吟罢重徘徊。 又　　　　　　　　　王敬中　中 四窗山色秀可揽，云根石屋高磷晌。 林问遗乌曾化虎，洞裹鞠猴浑似人。 奔流直下几千尺，高蹈今逾四十春。 灵光夜夜照丹室，应有神仙来往频。 又　　　　　　　元得　吉雅模丁 束越名山世共闻，四窗仙境更超群。 青天半落银河水，白日长过翠岭云。 尘外凤歌来隐士，林问虎乌候元君。 知予不倦登山屐，长许相寻谢俗氛。 又　　　　　　　　　　　林希原 昔闻刘仙翁，曾作上虞宰。 长年养神丹，灵药时自采。 一朝跨飞鸾，乔木凌苍霭。 下视尘寰中，桑田几沧海。 嗟子骨未换，何由抱丰采。 高躅在人问，深怀共千载。 又　　　　　　　　汪臣良　文璟 丹山自昔神仙宅，好是灵综与世殊。 百尺悬泉飞蜿蜓，千年遗乌化於菟。 亭台尚忆吹箫倡，芝木长供辟谷徒。 欲驾柴车访真隐，不知容我俗尘无。 又　　　　　　　　　杨元庆　环 仙子凌空驾玉龙，尚余灵迹在山中。 过云拾得青棂子，看瀑因寻白水宫。 未息干戈逢此日，忽闻锺鼓仰玄风。 也应脱屉非难事，曾识云问采药翁。 又　　　　　　　　马易之　乃贤 城居久忆洞天名，春日登临杖屦轻。 山雨晴时崖瀑玲，岩花落尽石窗明。 黄冠白发情偏古，野水闲云意自清。 便欲去寻刘县令，愿携妻子学长生。 又 一径遥通白水宫，众山屹立青芙蓉。 飞流倒垂千尺练，高处更登三四峰。 或闻溪獭趁鱼走，只有仙人跨鹤从。 看我山中游十日，云南云北访灵综。 又 白水真人去不回，紫青宫殿倚云开。 崖悬一瀑银为带，山列三峰翠作堆。 采药仙童随鹤过，衔花驯鹿倚人来。 方知异境非尘世，且共清吟坐石苔。 题丹山　　　　　　　　杨边梅 四明山，二百八十青孱颜，天空四牖，金乌玉兔两出没。 是为三十六洞天之九天，别有丹山赤水非人问。 我梦仙人贺狂客，去访云翘子，孤峰绝顶登大兰。 下见洪涛一表日车轮大，虹光蜃影、杂杳翻弥漫上。 有桃花美人者，液凤髓脯龙肝，令我食之生羽翰。 路逢毛先生，一笑今与古。 赤玉之乌堕地化为石。 我亦闻之。 刀厌虎潮飞，大士洞天水，门风折祖飞，桥石住赤玉之乌，何足追下穷地脉，上天维铁船径渡。",
      "translated_text": "**Spraying a thousand feet of snow,**\n**Crashing like thunder through ten thousand valleys.**\nThe Daoist’s bones are pure and clear,\nSeated guests grow cold, free of dust.\nWith a laugh, he descends the mountain,\nHugging his zither, treading home by moonlight.\n\n**Inscribed at the White Water Palace**\nThe *Hongbao* of the pillow is surely worth transmitting,\nLiving near the Cinnabar Mountain’s ninth heaven.\nNear and far, I often seek beyond clouds and waters,\nMy name should be carved upon the stone cliffs.\nAfter rain, the waterfall’s roar is heard at night,\nThe cinnabar furnace stays warm, uncounted by years.\nFrom time to time, a pot of wine, a song,\nLet them call me an earth-wandering immortal.\n\n**The Clear Radiance Pavilion**\nA frost-edged bowl, thoughts peerless,\nThe pavilion brims with poetic scenes, free of dust.\nFine mountains face me, unfolding emerald,\nLiving waters at their source paint white clouds.\nAn iron flute summons the toad, cold stirs,\nA jade sheng calls the crane as night begins.\nInspired, I pace with my long sword,\nAt times a divine light shoots toward the Dipper’s pattern.\n\n**Inscribed at Cinnabar Mountain**\n*By Gao Boyuan, styled Yi*\n\nCinnabar Mountain, Red Waters—a divine immortal’s abode,\nWith cloth saddle and green shoes, I make a fine journey.\nA hundred-foot flying spring, silver river snow,\nA single crane’s cry, autumn in the grotto-heaven.\nGreen *lingzi* ripen, the cloud altar still,\nJade trees bloom, the stone chamber deep.\nEndless streams and peaks hold splendid feasts,\nWhen shall I build my hut among these woods?\n\n**Another Poem**\n*By Chen Lǚchang, styled Kelǚ*\n\nMing’s vastness opens a stone window,\nWithin stands an immortal’s white jade terrace.\nA stream flows far from the heavens,\nThree terraces rise high before the grotto.\nThe old man’s gaunt bones seem a dragon transformed,\nDense bamboo’s cool shade awaits the phoenix’s return.\nEach time I seek wonders by Yin River,\nHere I find Penglai instead.\n\n**Another Poem**\n\nClad in iron, riding a steed over green moss,\nSuddenly I knock at the immortal’s gate, the stone grotto opens.\nThe azure sky’s autumn sounds hang as white water,\nPurple clouds’ spring hues descend from the cinnabar terrace.\nMaster Liu long ago rode a simurgh away,\nMagistrate Han still comes astride a crane.\nWine cups meet, our pure joy overflows,\nNew poems sung, we linger again.\n\n**Another Poem**\n*By Wang Jingzhong, styled Zhong*\n\nFour windows frame mountains fair enough to grasp,\nA stone house clings to cloud roots, towering and bright.\nIn the woods, a lost crow once turned into a tiger,\nIn the grotto, a bowing monkey seems almost human.\nA rushing torrent plunges thousands of feet,\nHigh steps now span over forty springs.\nDivine light nightly illumines the cinnabar chamber,\nSurely immortals come and go often here.\n\n**Another Poem**\n*By Yuan De, styled Jiyamuding*\n\nFamed mountains of Yue are known to the world,\nThe four-windowed immortal realm surpasses all.\nHalf the blue sky falls as the Silver River’s waters,\nThe white sun lingers past emerald ridges’ clouds.\nBeyond dust, phoenix songs call recluses,\nIn the woods, tigers and crows await the Primordial Lord.\nKnowing I never tire of climbing mountains,\nYou long allow me to seek you, free of worldly taint.\n\n**Another Poem**\n*By Lin Xiyuan*\n\nI once heard of Immortal Liu,\nWho served as magistrate of Shangyu.\nFor years he nurtured his spirit’s elixir,\nGathering divine herbs at will.\nOne day he rode a flying simurgh,\nSoaring past towering trees into the blue haze.\nLooking down upon the mortal realm,\nHow many mulberry fields had turned to seas?\nAlas, my bones remain unchanged,\nHow can I embrace such radiance?\nHis lofty footsteps linger among men,\nDeep longings shared across a thousand years.\n\n**Another Poem**\n*By Wang Chenliang, styled Wenjing*\n\nCinnabar Mountain, since ancient times an immortal’s dwelling,\nEspecially wondrous, set apart from the world.\nA hundred-foot hanging spring flies like a serpent,\nA thousand-year-old crow transforms into a tiger.\nPavilions still recall the flute’s song,\nLingzhi and trees long sustain grain-avoiding disciples.\nI wish to drive a firewood cart to visit true recluses,\nBut wonder if the mortal dust will allow me.\n\n**Another Poem**\n*By Yang Yuanqing, styled Huan*\n\nAn immortal soars through the sky on a jade dragon,\nLeaving divine traces still in the mountains.\nPassing clouds, I pick green *lingzi*,\nSeeking the waterfall, I find the White Water Palace.\nWarfare not yet stilled on this day,\nSuddenly I hear bells and drums, revering the mysterious Dao.\nShedding the world should not be hard,\nFor I once met a cloud-dwelling herb-gathering elder.\n\n**Another Poem**\n*By Ma Yizhi, styled Naixian*\n\nLong dwelling in the city, I recall the grotto-heaven’s name,\nOn a spring day I ascend, staff and sandals light.\nMountain rain clears, the cliff’s waterfall sings,\nRock flowers fade, the stone window brightens.\nA yellow-crowned white-haired man, his heart ancient,\nWild waters and idle clouds, their intent pure.\nI would go seek Magistrate Liu,\nWishing to bring my wife and children to learn long life.\n\n**Another Poem**\n\nA distant path leads straight to the White Water Palace,\nPeaks stand tall like green lotuses.\nA flying stream hangs like a thousand-foot silk,\nFrom the heights, I climb three or four more summits.\nSometimes I hear otters chasing fish,\nOnly immortals ride cranes in procession.\nAfter ten days wandering these mountains,\nI seek *lingzong* north and south of the clouds.\n\n**Another Poem**\n\nThe White Water Immortal has gone, never to return,\nPurple and green palaces lean against the clouds.\nA cliff suspends a waterfall like a silver sash,\nThree peaks array like emerald mounds.\nHerb-gathering immortal boys follow cranes,\nTame deer with flowers in their mouths come to men.\nNow I know this wondrous realm is not of the mortal world,\nLet us share pure verses, seated on stone moss.\n\n**Inscribed at Cinnabar Mountain**\n*By Yang Bianmei*\n\nThe Four Bright Mountains, two hundred eighty green peaks,\nHeaven’s four windows, where sun and moon rise and set.\nThis is the ninth heaven of the thirty-six grotto-heavens,\nA separate Cinnabar Mountain, Red Waters, not of men’s world.\nI dreamt of Immortal He the Mad Guest,\nWho went to visit Cloud-Crest Master,\nClimbing the solitary summit’s great orchid.\nBelow, I saw vast waves like the sun’s chariot wheel,\nRainbow light and mirage shadows swirling, billowing upward.\nThere was a Peach Blossom Beauty,\nWho fed me phoenix marrow and dragon liver,\nMaking my flesh grow feathers and wings.\nOn the path, I met Master Mao,\nWho laughed, bridging past and present.\nA red jade crow fell to earth, turning to stone.\nI too have heard of this.\nKnives repel tiger tides, the Great Master’s grotto-water,\nGate winds snap ancestral banners,\nBridge stones hold the red jade crow—\nWhy chase down to the earth’s veins or up to heaven’s ropes?\nAn iron boat cuts straight through.",
      "overlap_context": "gaze at the mountains time and again.\nThe stone cavern opens, and the cinnabar phoenix departs,\nThe waterfall flies, transforming into a jade dragon.\nRiding the wind, it scatters snow across half the sky,\nWithout rain, it roars like thunder through ten thousand valleys.\nI alone envy Historian Mao of the mountains,\nWho in seclusion has truly found a lesser Penglai.\n\n---\n\n**Another Poem**\n*By Chen Bangxie, styled Yong*\n\nFrom whence does the water come?\nFlowing forth from the white clouds’ embrace.",
      "start_char": 9927,
      "end_char": 11333,
      "start_sentence": 582,
      "end_sentence": 663,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.103755235672,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "弱羽水火剑，欲斫扶桑枝，毛先生毛仙后千春，曾醉庐山酒，酒醒骑虎，却入终山，笑呼彩鸾下，招手石田玉子大如斗。 石田高士居丹山，甚能继其祖武。 人来每称之，益信名不虚也。 蒙惠书以诗代简，时余年八十有五。 薛朝阳廷凤 客来每说洞天胜，我亦久怀山水清。 升仙木近石林古，洗药溪深风雨生。 三华真人昔居此，几叶玄孙今擅名。 若问老夫头未白，尚能相访写高情。 老舅大真人诗寄石田敬和一首因 致问讯　　　　　　　于一山　思缉 昔年相送领殊庭，别语难忘梦亦清。 记得四窗同久住，借骑一虎问长生。 丹林已重前朝士，白水犹传上古名。 若蹑三台峰顶望，老人星近见君情。 题丹山　　　　　　　　　韩彦信 春风两度到蓬瀛，万斛羁愁一洗清。 雨榻卧听崖瀑响，晴窗坐看白云生。 映阶睡草经年长，出火丹砂九转成。 安得诛茅傍樊榭，问君乞取石田耕。 又　　　　　　　　　王叔雨　霖 三台峰下神仙宅，樊榭春风长薜萝。 万迭层峦连石壁，一帘飞雨瀑银河。 天光上下云容歙，山色空蒙雨气多。 与客题诗足清赏，归来环佩杂鸣坷。 又　　　　　　　刘坦之　履 嵯峨赤水山，缥缈神仙宅。 高哉刘与樊，超然游八极。 一去何寥寥，千载遗灵迹。 中有外云人，冥柄炼精魄。 幽林拾青棂，寒泉煮白石。 致身潇爽问，邈与尘世隔。 我来一见之，倾倒如宿昔。 松花酿为酒，持以苦留客。 又　　　　　　　　　　陈君从 潺湲洞口看飞瀑，细雨霏霏洒接篱。 白水真人能好客，碧山学士爱题诗。 鞠侯夜啸三花树，野鹿时衔五色芝。 试问刘樊仙去后，何人来此共襟期。 又　　　　　　　　　谢元公　肃 云北云南油实盘、仙人官阙俯瓒阮。 晴峰倒影半空碧，雪瀑飞花六月寒。 鸾去徒劳寻放宅，虎来还为护仙坛。 洞前桃树春长在，迟我归来问大丹。 又　　　　　　　　　起文　昂吉 昔人仙去大兰山，台殿空遗石壁问。 崖瀑四时飞白雪，溪云长日护玄关。 青棂露冷从箩采，仙木风生看虎还。 昨夜洞前新雨过，主人留客听潺湲。 又　　　　　　　　　韩致静　稷 欲寻赤水丹恤淀； 好是瑶簪玉笋乡。 峰作翠屏分户映，水为罗带绕溪长。 乘云御气当炎衡，赏月吟风羡晚唐。",
      "translated_text": "The Feather-Weak Water-Fire Sword sought to hew the branches of Fusang,\nYet Master Mao, the Mao Immortal, lived a thousand springs after,\nOnce drunk on Lushan wine,\nSobered to ride a tiger,\nThen entered Zhong Mountain,\nLaughing to summon the colored simurgh down,\nBeckoning with his hand—stone-field jade the size of a peck measure.\n\nThe recluse of Stone Field dwelt on Cinnabar Mountain,\nMost able to carry on his ancestor’s steps.\nWhenever visitors came, they praised him,\nFurther confirming his name was no empty fame.\n\n*Kindly bestowed a letter, I reply with verse in place of a note,\nAt this time, I am eighty-five years of age.*\n\n**Xue Chaoyang, Tingfeng**\n\nVisitors often speak of the grotto-heaven’s wonders,\nI too have long cherished the mountains and waters’ clarity.\nThe Ascension-to-Immortality Tree stands near the ancient stone forest,\nThe stream for washing herbs runs deep, where wind and rain arise.\nThe Three-Flower Perfected One once dwelled here,\nHis distant descendants now hold renown.\nIf you ask why this old man’s hair remains unwhite,\nI can still visit you to inscribe lofty sentiments.\n\n**Poem from the Elderly Uncle, the Great Perfected One, sent to Stone Field in respectful response**\n\nIn years past, I saw you off at the extraordinary court,\nParting words unforgotten, even dreams were clear.\nI recall the four windows where we long resided,\nBorrowing a tiger’s back to inquire of long life.\nThe cinnabar grove has seen scholars of former dynasties,\nWhite Waters still transmit the names of high antiquity.\nIf you ascend the Three Terraces’ peak to gaze,\nThe Old Man Star shines near, revealing your heart.\n\n**Inscribed on Cinnabar Mountain**　　　　　　**Han Yanxin**\n\nTwice has the spring wind reached Penglai,\nWashing clean a myriad measures of traveler’s sorrow.\nOn a rain-soaked couch, I lie listening to the cliff’s waterfall roar,\nBy the sunlit window, I sit watching white clouds arise.\nGrasses by the steps sleep through the years,\nNine-times-refined cinnabar emerges from the fire.\nHow might I clear the brambles beside Fan’s pavilion,\nTo ask you for a plot of Stone Field to till?\n\n**Again**　　　　　　　　　**Wang Shuyu, Lin**\n\nBeneath the Three Terraces Peak lies the immortals’ abode,\nFan’s pavilion, where spring winds ever cling to ivy and vine.\nMyriad-fold layered peaks join the stone cliffs,\nA single curtain of flying rain—a Milky Way of waterfalls.\nHeaven’s light above and below, clouds gather and disperse,\nMountain hues misty, rain’s qi abundant.\nWith guests, I inscribe poems to suffice for pure delight,\nReturning, jade pendants chime among the clattering stones.\n\n**Again**　　　　　　　**Liu Tanzhi, Lü**\n\nTowering, the Red Waters Mountain,\nMisty, the immortals’ abode.\nHow lofty were Liu and Fan,\nTranscendent, roaming the eight poles.\nOnce gone, how desolate,\nA thousand years leave behind numinous traces.\nWithin dwells the Cloud-Exterior Man,\nSecretly wielding the handle to refine essence and spirit.\nIn secluded groves, he gathers green lingzhi,\nFrom cold springs, he boils white stones.\nAttaining a body of ethereal freshness,\nRemote, cut off from the dusty world.\nI came and saw it once,\nOverwhelmed as if by long-held admiration.\nPine flowers brewed into wine,\nHe insisted on detaining his guest.\n\n**Again**　　　　　　　　　**Chen Juncong**\n\nBy the murmuring cave mouth, I watch the flying waterfall,\nFine rain drizzles, sprinkling the adjoining fence.\nThe White Waters Perfected One knows well how to host guests,\nThe Azure Mountain Scholar loves to inscribe poems.\nAt night, the gibbon howls beneath the Three-Flower Tree,\nWild deer often carry five-colored lingzhi in their mouths.\nI ask: after Liu and Fan’s ascent to immortality,\nWho has come here to share such intimate moments?\n\n**Again**　　　　　　　　　**Xie Yuangong, Su**\n\nNorth and south of the clouds, oil-fruit platters,\nImmortals’ palaces overlook Zan and Ruan.\nSunlit peaks cast inverted reflections, half the sky emerald,\nSnowy waterfalls scatter blossoms, chilling the sixth month.\nIn vain, the simurgh’s departure leaves an empty abode,\nYet tigers still come to guard the immortal altar.\nBefore the grotto, peach trees endure through spring,\nAwaiting my return to inquire of the Great Elixir.\n\n**Again**　　　　　　　　　**Qi Wen, Angji**\n\nOf old, immortals departed from Great Orchid Mountain,\nLeaving behind empty terraces and halls within stone cliffs.\nCliff waterfalls fly white snow through all four seasons,\nStream clouds shield the Dark Pass through long days.\nGreen lingzhi’s dew is cold, gathered from the creeping vine,\nImmortals’ trees stir with wind as tigers return.\nLast night, fresh rain passed before the grotto,\nThe host detained his guest to listen to the murmuring stream.\n\n**Again**　　　　　　　　　**Han Zhijing, Ji**\n\nI long to seek the cinnabar sediment of Red Waters,\nFor this is the land of jade hairpins and bamboo shoots.\nPeaks form emerald screens, dividing the doors’ reflections,\nWaters weave silk ribbons, coiling along the stream.\nRiding clouds and harnessing qi, I face the scorching equator,\nAdmiring the moon and chanting to the wind, I envy the late Tang.\nIf you ask why this old man’s hair remains unblack,\nI can still visit to inscribe lofty sentiments.",
      "overlap_context": "pward.\nThere was a Peach Blossom Beauty,\nWho fed me phoenix marrow and dragon liver,\nMaking my flesh grow feathers and wings.\nOn the path, I met Master Mao,\nWho laughed, bridging past and present.\nA red jade crow fell to earth, turning to stone.\nI too have heard of this.\nKnives repel tiger tides, the Great Master’s grotto-water,\nGate winds snap ancestral banners,\nBridge stones hold the red jade crow—\nWhy chase down to the earth’s veins or up to heaven’s ropes?\nAn iron boat cuts straight through.",
      "start_char": 11333,
      "end_char": 12294,
      "start_sentence": 664,
      "end_sentence": 717,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.03274703025818,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "人在石坛行禹步，空歌时送佩琳琅。 又　　　　　　　　僧大明　冷昱 白水丹山何处看，清晖亭上一托阐。 半空积翠三合近，万丈飞流五月寒。 仙倡吹箫来洞口，山人采药出云端。 我身亦是难峰鹤，来往相从总不还。 又　　　　　　　　赵德纯　宜生 雄峰三十六，极造观明天。 上有神仙窟，丹霞覆其颠。 白鹿嘴瑶草，玄斤猿饮灵泉。 山深日常静，花落春自迁。 高人不羁世、昕夕中盘旋。 石田艺嘉谷，可以颐长年。 毛尊师石田山房　　张仲举　书 荦碗初开百亩荒，四明山麓结山房。 种来玉子双双白，凿破云根片片方。 洞裹有仙惟服髓，罔头无客重寻羊。 知师日诵黄庭罢，柢抱飞泉漱齿香。 又　　　　　　　　陈子山　祖仁 四明有神人，遗世宅崇峰。 飞游凌倒景，余垢亦奇踪。 流风被三华，有士振其宗。 诛茅宇峰下，迥若御鸿檬。 琅讦四时秀，灵泉左右通。 晨游揖王父，夕驽命青童。 惟兹二顷田，苦辛资岁功。 南东不尽亩，荦碗缢具中。 由来仙圣居，服食世非同。 白英坚过玉，烹饪奉朝赛。 非阙耕与锄，箪瓢糜不充。 大盗睨而去，天灾无匮空。 虚茵昔已争，乾饭咎在躬。 宁知不食地，束华蚤发蒙。 东华真人有食石法超摇乐玄虚，宛若咽瞳咙。 绿发方瞳子，长身此赤松。 游白水宫　　　　　滑伯仁　寿 白水仙宫也罕逢，十年两度追陈踪。 寒流光垂玉妇练，晴峦秀削金芙蓉。 临溪无鱼石磊磊，采药有路云溶溶。 明当挟我九节杖，更来陆彼三台峰。 又　　　　　　　胡士恭　益 凿石种琼田，开山结丹房。 高居邻野袖，尘世轻枇糠。 岂无胡麻饭，亦有辟谷方。 迥视众阻饥，侧怆摧中肠。 荷锄出四明，赤水流汤汤。 灵苗三聚华，美玉双成行。 粒粟藏大界，黍珠悬昊苍。 陶然熟梦境，寤觉惊黄梁。 腾身入北斗，酌彼金液浆。 一饮瑜万劫，蹑虹游帝傍。 归徕弄倒景，物我俱相忘。 松风度虚室，内白涵纯阳。 萝月挂峭壁，瀑泉洒银床。 壶中迭隐见，河上参翱翔。 云确激濑春，静休千日粮。 童颜驻绛霞，钳发凝玄光。 步虚蕊珠官，遗韵锵琳琅。 咽默超象外，闭兑焚清香。 琅讦郁森长，芝草离披芳。 运行紫河车，叱起金华羊。 愿采长生药，持以奉明王。 又　　　　　　留如渊　若冲",
      "translated_text": "**Again**　　　　　　　　**Monk Daming, Lengyu**\n\nA man paces the stone altar with Yu’s steps,\nVoiding his song to the jade pendants’ chime.\n\n**Again**　　　　　　　　**Zhao Dechun, Yisheng**\n\nWhere to gaze on white waters and cinnabar peaks?\nAtop the Clear Radiance Pavilion, I lean on the railing.\nMidair, layered verdure nears the triple confluence,\nA thousand-zhang cascade chills the fifth month.\nImmortal maidens play flutes at the grotto’s mouth,\nMountain recluses pluck herbs beyond the clouds.\nI, too, am a crane of Difficult Peak—\nComing and going, never to return.\n\n**Again**　　　　　　　　**Chen Zishan, Zurén**\n\nThe Four Bright Mountains hold a divine one,\nWho dwells apart on a lofty summit.\nSoaring flight inverts the sun’s shadow,\nHis remnant dust bears wondrous traces.\nHis flowing influence spreads through the Three Flowers,\nAnd scholars revive his lineage.\nHe slashes thatch to build beneath the peak,\nRemote as if riding the wild swan’s path.\nJade-like plants flourish through the seasons,\nSpirit springs flow left and right.\nAt dawn he greets the Royal Father,\nAt dusk he summons the Azure Lad.\nThese two acres of fields,\nThrough bitter toil, sustain the year’s labor.\nSouth and east, endless furrows,\nThe plow’s traces coil within the bounds.\nSince ancient times, immortals and sages have dwelt here,\nTheir diet and practice unlike the world’s.\nWhite stalks harder than jade,\nBoiled and offered at morning rites.\nNot for lack of plow or hoe,\nYet his bamboo basket and gourd bowl never fill.\nGreat thieves cast covetous eyes and depart,\nHeaven’s calamities leave no want.\nOnce, the empty mat was contested,\nThe dry rice’s fault lay in himself.\nHow could he know the land of no hunger?\nThe bundled herbs dispelled ignorance early.\n\n**Master Mao’s Stone-Field Mountain Lodge**　　　**Zhang Zhongju, Inscription**\n\nThe plow first breaks a hundred acres of waste,\nAt the foot of Four Bright Mountain, a mountain lodge is built.\nPlanted, the jade grains gleam in pairs,\nSplit from the cloud-root, each piece square.\nWithin the grotto, immortals drink only marrow,\nAt the ridge’s end, no guest seeks the lost sheep.\nI know the master, his daily recitation of the *Yellow Court* complete,\nEmbraces the flying spring to rinse his fragrant teeth.\n\n**Again**　　　　　　　　**Liu Ruyuan, Ruochong**\n\nHe hews stone to sow fields of jasper,\nOpens the mountain to frame a cinnabar chamber.\nHigh dwelling neighbors the wild cranes,\nThe dusty world is lighter than chaff.\nIs there no sesame rice?\nThere is also a fasting formula.\nLooking back at the starving masses,\nHis heart aches with sorrow.\nShouldering his hoe, he emerges from Four Bright Mountain,\nThe Red Waters flow in torrents.\nSpirit sprouts bloom in triple clusters,\nFine jades stand in twin rows.\nA grain of millet holds the vast realm,\nA millet-pearl hangs in the azure vault.\nRapt, he dreams a dream of ripeness,\nAwakens startled by the yellow millet.\nHe leaps into the Northern Dipper,\nSips the golden liquid’s nectar.\nOne draught outlasts ten thousand kalpas,\nTreading the rainbow, he roams beside the Emperor.\nReturning, he plays with inverted light,\nSelf and things both forgotten.\nPine winds pass through the empty chamber,\nWithin, purity cradles pure yang.\nMoss-moon hangs on the sheer cliff,\nThe waterfall scatters silver on the bed.\nWithin the gourd, visions flicker and fade,\nBy the river, he soars and circles.\nClouds and rocks churn the spring rapids,\nIn stillness, a thousand days’ provisions rest.\nHis youthful face retains crimson radiance,\nHis hairpin gleams with dark light.\nHe paces the void in the Petal Pearl Palace,\nLeaving echoes like chiming jade.\nSilent, he transcends all forms,\nSeals his senses, burns pure incense.\nJade plants rise dense and tall,\nMagic herbs spread their fragrance.\nHe moves the Purple River Chariot,\nCommands the Golden Flower Ram.\nWishing to gather the elixir of long life,\nTo present it to the Radiant King.\n\n**Visiting the White Water Palace**　　　　**Hua Boren, Longevity**\n\nThe White Water Immortal Palace is rarely met,\nIn ten years, twice I follow old traces.\nCold currents gleam like a jade woman’s silk,\nClear peaks stand sharp as golden lotuses.\nBy the stream, no fish—only heaped stones,\nThe path to gather herbs wreathed in drifting clouds.\nTomorrow I’ll bring my nine-jointed staff,\nTo climb again those Three Terraces Peaks.",
      "overlap_context": " stream.\n\n**Again**　　　　　　　　　**Han Zhijing, Ji**\n\nI long to seek the cinnabar sediment of Red Waters,\nFor this is the land of jade hairpins and bamboo shoots.\nPeaks form emerald screens, dividing the doors’ reflections,\nWaters weave silk ribbons, coiling along the stream.\nRiding clouds and harnessing qi, I face the scorching equator,\nAdmiring the moon and chanting to the wind, I envy the late Tang.\nIf you ask why this old man’s hair remains unblack,\nI can still visit to inscribe lofty sentiments.",
      "start_char": 12295,
      "end_char": 13196,
      "start_sentence": 718,
      "end_sentence": 780,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.92900562286377,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "道人住居白水洞，洞口有田供凿耕。 犁钮不用辛苦少，玉石自分烹炼精。 拾薪涧底客共煮，化羊岭上仙俱成。 夜深无肩月自到，坐听九霄笙鹤声。 又　　　　　　陈则虚　斯与 山根结屋便为注，不事蛮会待岁禳。 种玉岂无和氏璞，烧丹亦有禹余粮。 自知云水生涯担，谁识林泉兴味长。 我亦欲归寻旧业，梦魂时绕锦溪傍。 又　　　　　　　赵行吾　思鲁 半壁梯云凿翠屏，千岩喊两斯青冥。 驻鞭不假秦人力，开辟元非蜀帝灵。 仙碗收禾胜碎谷，春腴种玉可延龄。 归来屐齿苍苔滑，茅屋松萝映碧肩。 又　　　　　　　　　　薛毅夫 数亩依山宅一区，喜存挠碗胜膏腴。 近因辟谷怀黄石，也复耕姻种白榆。 玉气润多山木秀，松云飘尽鹤巢孤。 会当脱屐从师去，乞取青棂颗颗珠。 鹤斋薛真人余之未识者而慕其可 人先以诗寄之耳　张宪南　福 别帝归来已二秋，好教安稳住丹丘。 编经不用青华杖，跨鹤还登白玉楼。 羡尔能传唐少保，愧余无复汉留侯。 门前白水三千丈，应作黄河不尽流。 游白水宫　　　吴居正　端学 弱龄厌尘俗，胜迩心所仰。 遂为物外游，获陪林下杖。 鱼梁依涧度，乌道绿云上。 既睹仙真宅，愈重姻霞想。 环山知几峰，飞流可千丈。 天神傍榈舞，水乐临阶响。 皮陆迹已陈，刘樊事亦往。 不有继先志，何能领清赏。 前人有遗咏，磨崖看佛彷。 四明洞天丹山图咏集竟",
      "translated_text": "The Daoist dwells in White Water Grotto,\nFields at its mouth yield to hoe and plow.\nNo toil in plowing—labor grows light,\nJade and stone refine themselves through fire.\nGathering firewood by the stream, guests share the boil,\nOn Transformed Ram Ridge, immortals all ascend.\nDeep in night, moon arrives without shoulders to bear,\nSeated, one hears the flute and crane of the nine heavens.\n\n**Chen Zexu: \"This and That\"**\n\nA hut built at the mountain’s root becomes a dwelling,\nNo need for barbaric rites to await the year’s exorcism.\nPlanting jade—is there no uncut jade of He?\nRefining cinnabar—there is also Yu’s surplus grain.\nHe knows his life is borne by clouds and waters,\nWho recognizes the long delight of forests and springs?\nI too wish to return and seek my old calling,\nMy dreaming soul ever circles Jin Brook’s side.\n\n**Zhao Xingwu: \"Thinking of Lu\"**\n\nCarving a half-wall ladder through emerald screens,\nA thousand cliffs echo—this is the azure void.\nNo need to borrow Qin’s labor to halt the bridle,\nNor was this opened by the spirit of the Shu emperor.\nThe immortal’s bowl gathers grain finer than millet,\nSpring’s richness sows jade to prolong life.\nReturning, clogs slip on mossy green,\nThatched hut and pine-lichen frame the blue shoulders.\n\n**Xue Yifu**\n\nA few acres nestled by the mountain, one plot of land,\nGlad to keep the humble bowl over rich fare.\nLately, fasting with yellow stone in mind,\nYet still tending the hearth to plant white elm.\nJade qi moistens the mountain woods to lushness,\nPine clouds drift away, the crane’s nest stands alone.\nSoon I’ll cast off my clogs to follow the master,\nBegging for pearls from the green lattice.\n\n**Zhang Xiannan: \"Fu\" (To Xue, the Crane Studio Immortal, whom I have yet to meet but admire—first sending this poem)**\n\nTwo autumns since parting from the emperor’s court,\nWell you dwell secure in the cinnabar mounds.\nNo need for the Azure Flower staff to compile scriptures,\nRiding a crane, you ascend the White Jade Tower.\nI envy your transmission of Tang’s Lesser Guardian,\nI shame to have lost the legacy of Han’s Marquis of Liu.\nBefore your gate, White Water stretches three thousand feet—\nShould it become the Yellow River’s endless flow?\n\n**Wu Juzheng: \"Duanxue\" (Visiting White Water Palace)**\n\nFrom youth I wearied of the vulgar world,\nSeeking distant wonders with all my heart.\nThus I wandered beyond the dust,\nJoining the staff beneath the forest’s shade.\nFish weirs cross the stream,\nBird paths rise through green clouds.\nHaving glimpsed the immortal’s true abode,\nMy thoughts of rosy clouds grow deeper still.\nHow many peaks encircle the mountain?\nFlying cascades plunge a thousand feet.\nHeavenly spirits dance beside the eaves,\nWater music resounds by the steps.\nThe traces of Pi and Lu are long past,\nThe affairs of Liu and Fan have faded too.\nWithout those who inherit the ancient will,\nWho could grasp this pure delight?\nFormer worthies left their verses,\nCarved on cliffs, they seem like Buddha’s likeness.\n\n**The End of the \"Four Brightnesses Grotto-Heaven and Cinnabar Mountain Illustrated Ode Collection\"**",
      "overlap_context": "hing to gather the elixir of long life,\nTo present it to the Radiant King.\n\n**Visiting the White Water Palace**　　　　**Hua Boren, Longevity**\n\nThe White Water Immortal Palace is rarely met,\nIn ten years, twice I follow old traces.\nCold currents gleam like a jade woman’s silk,\nClear peaks stand sharp as golden lotuses.\nBy the stream, no fish—only heaped stones,\nThe path to gather herbs wreathed in drifting clouds.\nTomorrow I’ll bring my nine-jointed staff,\nTo climb again those Three Terraces Peaks.",
      "start_char": 13196,
      "end_char": 13799,
      "start_sentence": 781,
      "end_sentence": 816,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.043159246444702,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\四明洞天丹山图咏集.txt",
        "category": "记传类"
      }
    }
  ]
}