{
  "source_id": "坐忘论",
  "source_file": "chunked_daozang\\坐忘论.json",
  "total_chunks": 7,
  "total_original_chars": 6725,
  "total_translated_chars": 37931,
  "total_translation_time": 189.34191274642944,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\坐忘论.txt",
    "category": "藏外"
  },
  "full_translation": "**On Sitting in Forgetfulness**\n*By Sima Chengzhen of the Tang*\n\nWhat men hold precious is life;\nwhat life holds precious is the Dao.\nMan’s possession of the Dao\nis like a fish’s possession of water.\nFish stranded in a dried rut\nstill long to ascend to water.\nYet in this age of feeble decline,\nmen’s hearts no longer seek the Dao.\nThey dread the suffering of life and death,\nyet cling to the karmic deeds of life and death.\nThey prize the name of virtue and power,\nbut scorn the practice of virtue and power.\nThey deem sensual pleasures and rich flavors success,\nand despise tranquility and simplicity as poverty and disgrace.\nThey exhaust rare and precious goods\nto purchase blessings for future lives,\nindulging in easily tainted passions\nwhile forsaking the Dao of this present body.\nProud of their cunning and skill,\nthey remain as if in dream, as if in delusion.\nBorn, they die; dying, they are born—\nthus they cycle through ten thousand kalpas.\nHow utterly inverted is this!\nHow extreme the confusion!\n\nThus the *Scripture of Wondrous Perfection* states:\nMan constantly loses the Dao—\nit is not the Dao that loses man.\nMan constantly departs from life—\nit is not life that departs from the Dao.\nTherefore, those who nurture life\nmust take care never to lose the Dao;\nthose who cultivate the Dao\nmust take care never to lose life.\nLet the Dao and life guard each other,\nlet life and the Dao preserve each other.\nOnly when the two never part\ncan there be enduring permanence.\nThis enduring permanence\nis the essence of attaining the Dao.\n\nThe scripture says:\nLife is Heaven’s great virtue,\nEarth’s great joy,\nman’s great fortune.\nThe Daoist achieves this—\nit is not a matter of fate or fortune.\n\nThe *Scripture of Western Ascent* also says:\n\"My life rests with me,\nnot with Heaven.\"\nFrom this we know:\nlength or brevity of life lies within oneself.\nAttainment is not granted by Heaven,\nloss is not seized by others.\nI regret that, pressing my heart, I realize it is late—\ntime does not tarry even briefly.\nAlas, the years of my life,\nlike the ephemeral morning mushroom,\nhave already passed the age of knowing fate,\nyet the essentials of returning to the Dao\nremain imperfectly mastered.\nCherishing every inch of time,\nswift as the fleeting shadow of a candle,\nI strive to follow the scriptures’ purport.\nThe method is simple, the principle direct,\nthe practice easy to perform.\nIn response to the afflictions of the heart,\nI have distilled and set forth the method of pacifying the mind through seated forgetting,\ncondensing it into seven principles.\nThese serve as steps in the cultivation of the Dao,\nas both its pivot and wings.\nHere I arrange and record them.\n\n**First: Faith and Reverence**\nFaith is the root of the Dao;\nreverence is the stem of virtue.\n\nRoot deep, the Dao may endure long; stem firm, virtue may flourish abundantly. Yet jade of dazzling brilliance, though worth cities, brought Bian He the loss of his feet; words that could preserve a kingdom brought Wu Zixu execution. Such is the way of the world: when forms and implements stand forth, the heart’s threads grow tangled; when principles and affairs first sprout, emotions and thoughts turn heedless. How much more so with the supreme Dao, which transcends form and flavor, and the true nature, which is veiled by the desirable—who can hear the faint and subtle and hold fast to faith, or listen to the formless and remain unconfused?\n\nIf one hears of the method of seated forgetting and believes it to be the essential of cultivating the Dao, revering and honoring it with unwavering resolve, and then applies oneself diligently to practice, attainment of the Dao is certain. Thus Zhuang Zhou said: “Dismantle the limbs, dismiss brilliance, depart from form, abandon knowledge, and merge with the Great Thoroughfare—this is called seated forgetting.” What is there that seated forgetting does not forget? Within, one is unaware of one’s own body; without, one knows not the cosmos. In oneness with the Dao, the myriad cares all fade away. Thus Zhuangzi said, “Merge with the Great Thoroughfare.” These words are simple, yet their meaning runs deep. The deluded hear but do not believe—clutching treasure while seeking treasure, what can be done? Therefore the scripture says: “Where faith is insufficient, there is disbelief.” If the heart’s faith in the Dao is lacking, the calamity of disbelief will befall one. How then can the Dao be hoped for?\n\n**Second: Severing Conditions**\nTo sever conditions means to cut off the ties of worldly, contrived affairs. Abandoning affairs, the body does not labor; practicing non-action, the heart finds peace of itself. Day by day, tranquility and simplicity grow; day by day, the dust of entanglements thins. The farther one’s traces recede from the vulgar, the nearer the heart draws to the Dao. Who among the most divine and sagely did not follow this path? Thus the scripture says: “Block the openings, shut the gates, and to the end of life you will not toil.”\n\nSome display virtue or reveal ability to win others’ protection; some exchange greetings of congratulation or condolence, engaging in social intercourse; some feign reclusion while secretly hoping for advancement; some host feasts and banquets, seeking future favors. These are all cunning schemes to pursue worldly gain, neither in accord with the Dao nor conducive to true practice. All such things must be severed. Thus the scripture says: “Open the openings, assist in affairs, and to the end of life you will not be saved.”\n\nI do not initiate; they do not respond. Though they may initiate, I do not respond. Old conditions gradually dissolve; new conditions must not form. Sweet friendships and power alliances naturally grow distant day by day. Only when free from affairs and at ease can one cultivate the Dao. Thus Zhuangzi said: “Neither advance nor retreat,” for there is no entanglement with the vulgar. He also said: “Be not the lodging-place of fame, the storehouse of schemes, the bearer of tasks, or the master of knowledge.”\n\nIf there are affairs that cannot be abandoned, act only when unavoidable, without becoming attached or making them a preoccupation. Do not let the heart cling to them as a pursuit.\n\n**Third: Gathering the Heart**\nThe heart is the master of the body and the commander of the hundred spirits. Still, it gives rise to wisdom; agitated, it becomes deluded. Enchanted by illusory realms, one takes words to be real; feasting within contrived affairs, who awakens to their emptiness and falsity? The heart’s confusion and folly arise from the ground to which it clings.\n\nEven choosing neighbors to dwell beside may alter one’s conduct; selecting friends to associate with can bring benefit. How much more so when the body departs from the realm of life and death, and the heart abides within the supreme Dao—how can one not abandon the former? How can one fail to attain this?\n\nThus, at the outset of learning the Dao, one must sit in stillness, gather the heart, depart from external conditions, and dwell in nothingness. Not attaching to a single thing, one naturally enters the void, and the heart unites with the Dao. Thus the scripture says: “Within the supreme Dao, there is tranquil nothingness. The spirit’s function is without limit; the heart’s essence is likewise.” Trace the heart’s essence to its source, and the Dao is its root.\n\nYet the heart-spirit has been stained and obscured, growing ever more deeply veiled. Wandering long, it has become estranged from the Dao. If now one can purify and remove the heart’s filth, releasing the spirit’s original nature, this is called cultivating the Dao. No longer wandering, one merges with the Dao, abiding within it—this is called returning to the root. Guarding the root without parting from it is called stillness and stability. With stillness and stability prolonged, illness fades and life is restored. Restoration followed by continuity leads to knowing the constant. Knowing brings clarity without obscurity; the constant brings permanence without change or decay. Emerging from life and death truly depends on this.\n\nTherefore, in pacifying the heart through the Dao’s method, nothing is more precious than non-attachment. Thus the scripture says: “The ten thousand things flourish, each returning to its root. Returning to the root is called stillness; stillness is called restoring life. Restoring life is called the constant; knowing the constant is called clarity.”\n\nIf one clings to the heart in emptiness, this is still attachment to something, not true nothingness. Any attachment to something inevitably wearies the heart and stirs the qi, neither in accord with principle nor beneficial to health. Only when the heart does not cling to things and remains unmoving is this the true foundation of stability. Using this as stability, the heart and qi harmonize, and over time one grows ever lighter and more at ease. This serves as verification, by which right and wrong may be known.\n\nIf one extinguishes every arising thought without discerning right from wrong, permanently severing awareness, this is blind stability. If one allows the heart to arise without restraint or control, this is no different from an ordinary person. If one merely severs good and evil without giving the heart direction, drifting aimlessly and waiting for self-stabilization, one merely deludes oneself. If one engages in all manner of affairs while claiming the heart is unstained, such words may sound fine, but the conduct is far from it. Those who truly walk the path must especially guard against this.\n\nNow, still the chaos without extinguishing illumination; guard stillness without clinging to emptiness. Practice this with constancy, and true insight will naturally arise. If there are matters at hand or essential points in the method that raise doubts, allow thought to proceed so that the matter may be resolved and the doubt dispelled—this too is the root of wisdom. Once the matter is concluded, cease; truly, do not think excessively. Excessive thought harms tranquility with knowledge, injuring the root as a son harms his father. Though one may gallop with brilliance for a time, in the end it undermines the work of ten thousand generations.\n\nIf vexing, perverse, or chaotic thoughts arise, eliminate them upon awareness. If one hears words of praise or blame, good or evil, immediately cast them aside—do not let the heart receive them.\n\nIf the heart receives them, the heart becomes full; when the heart is full, the Dao has no place to dwell. Let all that is heard and seen be as if unheard and unseen, so that right and wrong, beauty and evil do not enter the heart. When the heart does not receive externals, it is called an empty heart; when the heart does not chase externals, it is called a peaceful heart. When the heart is peaceful and empty, the Dao naturally comes to rest within.\n\nThus the sutra says: If one can empty the heart and practice non-action, without desiring the Dao, the Dao will come of itself. When the inner heart has nothing to cling to, outer conduct also has nothing to strive for. Neither pure nor defiled, praise and blame cannot arise; neither wise nor foolish, gain and harm cannot reach one. In truth, following the mean is the constant way, while adaptability allows one to ebb and flow with the times—merely to avoid all entanglements is wisdom.\n\nIf one forces thought and action where neither time nor circumstance demands, claiming non-attachment, it is never true awakening. Why? The mind is like the eye: even a speck of dust entering the eye disturbs its peace; a small matter opening the heart stirs it to disorder. Once this disturbance arises, it is difficult to enter the gate of samadhi. Therefore, the essential task in cultivating the Dao is urgently to remove afflictions. If afflictions are not removed, one will never attain samadhi.\n\nIt is like good farmland: if brambles are not cleared, even when seeds are sown, fine sprouts will not grow. Love, views, thoughts, and anxieties are the brambles of the heart. If they are not cut away, samadhi and wisdom will not arise.\n\nSome dwell in wealth and nobility, or master the classics and histories; their words may be kind and frugal, yet their actions are greedy and cruel. Their eloquence suffices to conceal wrongdoing, their power suffices to intimidate others; success is claimed as their own, while failure is blamed on others. This affliction runs deepest, and though one may study, it is of no benefit. The reason is self-righteousness.\n\nYet this heart has long depended on conditions and is unaccustomed to independence; suddenly left without support, it finds it hard to be at ease. Even if it attains momentary peace, it soon scatters again. Rise and restrain it each time, striving to keep it unmoved; with long and patient training, it will naturally become peaceful and at ease. Whether day or night, in walking, standing, sitting, or lying down, and when attending to affairs, one must constantly intend to settle it. Once the heart attains samadhi, simply nurture it and avoid disturbance. Even a small measure of samadhi brings its own joy. Gradually, as familiarity grows, one feels only clarity and distance. What was once prized in life now seems flawed and leaky—how much more, when samadhi gives rise to wisdom, will one deeply discern truth from falsehood!\n\nOxen and horses are domesticated animals; if left unrestrained, they grow stubborn and refuse to be harnessed. Hawks and falcons are wild birds; though bound by man, if kept in hand all day, they become naturally tame. How much more, when the heart is left to wander unrestrained—only coarseness increases, and how can one perceive the subtle? Thus the sutra says: Though one may possess a great jade disc preceded by a team of four horses, it is not equal to sitting and advancing in this Dao.\n\nThe wonder of the Dharma lies in its practice, not in its words. If practiced, these words are true; if not practiced, they are false.\n\nMoreover, people of this age value the difficult and despise the easy. When the Dharma is discussed in depth, they extol only vast discourses on emptiness—things beyond thought and without practical steps—and sigh in awe, bowing in reverence. Yet if the words are plain, pointing to matters and stating truths, so that upon hearing, the heart understands, and in speaking, they can be practiced—this is truly inconceivable, yet people do not believe it. Thus the sutra says: My words are very easy to know, very easy to practice. Yet none in the world can know them, none can practice them. Only because they do not know is it that they do not know me.\n\nSome say fire is not hot, a lamp does not illuminate darkness, calling this profound meaning. Yet fire’s function is heat, a lamp’s purpose is light. Now, loudly proclaiming fire is not hot, one never for a moment abandons fire; emptily declaring a lamp does not illuminate darkness, one must still burn it all night. Words and actions contradict each other, and in truth, there is nothing to be gained. These are merely words to break attachment to forms, yet people mistake them for profound and abstruse wonders. Even with Hui Shi’s great eloquence, Zhuangzi found him unbearable. How can those who take words at face value discern the truth? Those who truly seek learning should not fix their minds here.\n\nSome say: To embody the great Dao is to be in the world without the heart being stained, to dwell in activity without the spirit being disturbed, to act without ceasing, to be still without interruption. Now, avoiding affairs to seek stillness, leaving activity to pursue samadhi, laboring to control the mind—this creates a duality of movement and stillness, clinging to abiding—these are the twin afflictions of grasping and rejecting. Unaware of their own attachments, they still claim this is the essential step of the Dao—how mistaken!\n\nIn response: To encompass all things and be called great, to guide all things is to be the Dao; to be in the world without stain, to handle affairs without disturbance—this is truly great! Truly wondrous! Yet it seems your discernment has not yet fully awakened.\n\nWhy is this so? Dazzled by the brilliance of brocade, one fails to see the plain silk from which it was first drawn; hearing the crane’s soaring cry, how could one know it was first nourished by valley grain? Towering trees that block the sun begin as tender shoots; sagely mastery of spirit is cultivated through gradual practice. Yet now, merely learning to speak of sagely virtue, one remains ignorant of how virtue itself is attained—this is like seeing the hare and demanding the stew, or spotting the slingshot and craving the roasted owl. How hasty and reckless!\n\nThus the scripture says: *\"Profound virtue is deep and distant! It moves contrary to things! Only then does it attain great harmony.\"*\n\n**Chapter Four: Simplifying Affairs**\nMan’s life is necessarily entangled with affairs and things. Affairs and things number in the tens of thousands, yet none are entrusted to one person alone. A bird content with a single branch of the forest is spurned by the reeds; a beast that drinks its fill from the river does not begrudge the vast waves. Seek outwardly among things, but clarify inwardly within yourself. Know the limits of your allotted share—do not pursue what lies beyond it; recognize what is fitting in affairs—do not undertake what is unfitting. Affairs that are unfitting drain wisdom and strength; pursuits beyond one’s share exhaust body and spirit. If the self is not at peace, how can the heart attend to the Dao?\n\nTherefore, those who cultivate the Dao must decisively simplify affairs, discerning what is essential, weighing what is light or heavy, and knowing what to retain or discard. Whatever is nonessential or excessive should be cut away. Like a man’s food with its wine and meat, his clothing with its silks and brocades, his status with its titles and ranks, his wealth with its gold and jade—these are all superfluous desires, not the true medicine for preserving life. The masses chase after them, only to bring about their own ruin. In stillness, reflect: how deeply deluded they are!\n\nThus Zhuangzi says: *\"One who understands the essence of life does not pursue what life does not require.\"* For what life does not require is what lies beyond one’s allotted share—external things. Coarse food and worn clothes suffice to sustain life; must one wait for wine, meat, silks, and brocades before it can be called living? Therefore, what is nonessential to life must be discarded; even what is useful but in excess should also be relinquished. Wealth harms the qi—accumulated, it injures a person. Even a little is burdensome, let alone much!\n\nNow, to use the Marquis of Sui’s pearl to shoot a sparrow a thousand fathoms high—people still laugh at this. How much more foolish to abandon the Dao, neglect one’s nature and life, and chase after the nonessential, hastening one’s own destruction! When comparing fame and rank to the Dao, fame and rank are fleeting and base, while the Dao is real and noble. Knowing the noble from the base, one should act accordingly: do not let fame harm the self, nor let rank displace the Dao.\n\nThus Zhuangzi says: *\"One who pursues fame loses the self—such a one is no true scholar.\"* The *Scripture of Western Ascent* says: *\"Embrace the One and guard unity to cross over to the realm of immortals. You have not yet mastered this, but instead sit entangled in official glory.\"* If one does not simplify and choose carefully, engaging with every matter, the body will labor and the mind grow dull, and the work of cultivating the Dao will be neglected. Only one who is at ease amid affairs and unburdened by things may be called a person of attainment. If one has not truly attained this yet claims to be unburdened, it is self-deception.\n\n**Chapter Five: True Observation**\nObservation is the forerunner of the wise and the keen insight of the capable. It thoroughly examines impending fortune and misfortune, carefully discerns the auspicious and inauspicious in movement and stillness. Seeing the opportunity before it arises, one acts accordingly, deeply seeking stability and security, striving to preserve life whole. From beginning to end, one’s conduct leaves no lingering entanglements. As this principle is not violated, it is called *true observation*.\n\nNow, every meal and rest is the source of gain or loss; every word and deed may become the root of fortune or misfortune. Though one may skillfully manage the branches, it is better to clumsily guard the root. Observing the root to know the branches is not the way of restless striving. Therefore, collect the heart and simplify affairs, daily reducing active doing. Only when the body is still and the heart at ease can one observe and perceive true principle.\n\nThus the scripture says: *\"Always without desire, observe its mystery.\"*\n\nYet for one cultivating the Dao, clothing and food are necessary. There are affairs that cannot be abandoned and things that cannot be discarded. One should receive them with an empty mind, address them with a clear eye, and not let them become obstacles that stir up vexation. If one sees affairs as affairs and grows vexed, the sickness of the heart has already arisen—how can this be called a peaceful mind?\n\nMan’s affairs and sustenance are like a boat. I wish to cross the sea, and the boat is the means. Once the sea is crossed, the boat is naturally left behind. Why, before crossing, would one wish to abandon the boat? Clothing and food are illusory—truly, they are not worth pursuing. Yet to depart from illusion, one seeks clothing and food. Though there are matters of provision, do not generate a mind of gain and loss. Then, whether engaged in affairs or not, the heart remains constantly at peace. One seeks alongside others but does not share their greed; one obtains alongside others but does not share their accumulation. Without greed, there is no sorrow; without accumulation, there is no loss. Outwardly, one’s traces may resemble others’, but the heart remains apart from the vulgar. This is the essential principle of practice—one must strive to embody it.\n\nThough one may have simplified earlier, some afflictions are difficult to eradicate, so one should observe them according to the method. If the affliction of desire is severe, contemplate that the defilement of desire arises entirely from thought. If thought does not arise, there is ultimately no matter of desire. If one knows that desire is empty externally and the mind is deluded internally, that the deluded mind and empty thought—who then is the master of desire?\n\nThe scripture says: *\"Desire is entirely thought!\"* If thought is all empty, where is desire? Further, consider that bewitching beauty is more perilous than fox spirits. Fox spirits bewilder people, causing revulsion and suffering. Though they may lead to death, one does not fall into evil destinies, for revulsion ensures one forever departs from lust. But bewitching beauty bewilders people, causing attachment and longing—even unto death, the clinging grows deeper. For the sake of perverse thoughts, one dies and falls into hell, forever barred from the human realm, the path of blessings long severed.\n\nThus the scripture says: *\"Those who in this life vow to be husband and wife will not, after death, both be reborn in the human realm.\"* Why is this so? Because of perverse thoughts.\n\nMoreover, if beauty were truly absolute, why do fish plunge deep at its sight, and birds take flight to the heights? Why do immortals deem it foul and filth, and sages liken it to axe and blade? A life may end after seven days without food, yet a century without desire spares one from untimely harm. Thus we know that desire is no essential need of body or mind—it is but a mortal foe, a thief of life. Why then cling to it, courting self-destruction?\n\nWhen you see others commit evil and feel revulsion, it is as if you saw a man slit his own throat, then seize another’s blade to finish the deed. He harms himself—why take up his sin as your own affliction? If evil is to be despised, then good must also be shunned—for both obstruct the Way.\n\nConsider the poor and suffering: who has made them so? Heaven and earth are impartial, covering and bearing all without favor. If you are poor, it is not their doing. Parents wish their children wealth and honor; if you are lowly, it is not by their will. Neither men nor spirits have leisure to save themselves—how could they impose poverty upon you? Searching near and far, you find no source. Know then that it is your *karma*, your *Heaven-appointed fate*. Karma is of your own making; fate is bestowed by Heaven. Their bond is as unshakable as shadow to form, echo to sound—inescapable, beyond reproach. Only the wise accept this, delighting in fate, unmoved by poverty’s bitterness.\n\nThus Zhuangzi says: *\"Karma enters and cannot be cast off.\"* It is of one’s own making. When poverty and illness come, they cannot be refused. The scripture says: *\"Heaven and earth cannot alter its course; yin and yang cannot reverse its karma.\"* From this we know that true fate is no fleeting thing—what cause is there for resentment?\n\nLike a warrior facing bandits, fearless, sword drawn to meet them, routing the horde—once victory is won, glory and rank endure for life. Now, when poverty and illness assail you, they are the bandits; your right mind is the warrior; wisdom is the sword; the dispelling of affliction is triumph; serene and constant joy is your reward. When suffering presses upon your heart and you do not contemplate thus, but instead grow troubled, it is as if a soldier, meeting bandits, abandons armor and flees, earning the penalty of a deserter. To forsake joy for suffering—how can this be pitied?\n\nIf afflicted by illness, reflect: this sickness arises from having a body. Without a body, where could suffering lodge? Thus the scripture says: *\"When I have no body, what suffering remains?\"* Next, examine the mind—it has no true master. Search within and without, and none can be found to bear it. All thoughts arise from the deluded mind. If the body withers and the heart turns to ash, all ailments vanish.\n\nIf you fear death, consider: this body is the abode of the spirit. Now aged and sick, its strength waning, like a decayed house unfit to dwell in—you must leave it to seek another refuge. When the body dies and the spirit departs, it is the same. To cling to life and resist death, to defy change, is to confuse the spirit, losing the right path. Reborn in this state, at the moment of receiving *qi*, you do not draw the pure and refined, but often meet the turbid and base. This is the root of the foolish and greedy—truly, their doing.\n\nThus, to be indifferent to life and accepting of death is twofold in benefit: first, it equalizes the principle of life and death; second, it perfects karma for the next life. To covet the ten thousand things is to invite a hundred ills. A single limb’s ailment disturbs the whole body—how much more so when the mind bears a thousand afflictions? Can the body then hope for longevity?\n\nAll likes and dislikes arise from delusion. If delusion accumulates unchecked, how can the Way be seen? Therefore, the heart must abandon all desires, dwell in emptiness, cast off emotion, and uphold right faith. Only then, looking back upon past infatuations, will disdain naturally arise. If you observe the world with a mind entangled in it, you will never perceive its faults; but with a mind detached, you will clearly see right and wrong. As the sober know the folly of the drunk, yet the drunk remain unaware of others’ faults, so the scripture says: *\"I once renounced the world, weary of the human realm.\"* And again: *\"The ears and eyes, sounds and sights—these are the faults that linger for you. The nose and mouth, the fragrances and flavors they crave—these are your foes.\"* Even Laozi, who spurned the world, saw fragrance and flavor as enemies. How could those drowning in desire know the stench of the fishmonger’s stall?\n\n**Sixth: Supreme Stability**\nStability is the utmost limit of the mundane, the first foundation of attaining the Dao, the fruition of practicing stillness, the completion of maintaining tranquility. The body is like withered wood, the heart like dead ashes—no stirring, no seeking, the height of quiescence. Without striving for stability, yet nothing is unstable—this is *Supreme Stability*.\n\nZhuangzi says: *\"When the universe is supremely stable, celestial radiance emerges.\"* The universe is the mind; celestial radiance is wisdom. The mind is the vessel of the Dao. When emptiness and stillness reach their utmost, the Dao resides within, and wisdom arises. Wisdom flows from one’s original nature, not newly acquired—thus it is called *celestial radiance*. Yet through the turbidity of greed and desire, clarity is lost, and confusion ensues. Wash and refine it, soften and straighten it, and return to pure stillness. The original true spirit gradually awakens—not that new wisdom is born at this moment.\n\nOnce wisdom arises, treasure and embrace it. Do not indulge in excessive knowledge, lest it harm stability. The difficulty lies not in generating wisdom, but in not using it. Since ancient times, many have forgotten the body, but few have forgotten fame. To possess wisdom yet not employ it is to forget fame—rare indeed in the world, hence its difficulty. To be noble yet not arrogant, wealthy yet not extravagant, free from worldly faults—thus one preserves wealth and honor for long.\n\nStill in samādhi yet unmoving, wise yet not employing wisdom, virtuous yet not relying on virtue—thus free from transgressions against the Dao, and so one deeply realizes the eternal Dao.\n\nThus *Zhuangzi* says: \"To know the Dao is easy; to refrain from speaking of it is difficult.\" To know yet not speak is the way to Heaven; to know and speak is the way to man. The ancients followed Heaven, not man. To possess wisdom that knows the Dao is not yet to attain the Dao. People recognize the benefits of gaining wisdom, but few know the advantages of attaining the Dao. Through wisdom, one illuminates the ultimate principle; through eloquence, one moves the sentiments of others. Following the heart to pursue affairs, expanding upon each encounter—one claims to dwell in activity while the heart remains still. But does stillness mean waiting passively for things to arise? Such conduct and speech both fall short of perfect stability. Though one’s intelligence surpasses the multitude, it only drifts further from the Dao. One sets out to chase the deer, only to return with a hare—what is gained is meager, constrained by narrow vision.\n\nThus *Zhuangzi* says: \"The Daoists of old cultivated the Dao by nurturing tranquility with wisdom.\" When wisdom arises yet nothing is done with knowing, this is called nurturing tranquility with wisdom. Wisdom and tranquility nourish each other, and harmony and principle emerge from one’s nature. Tranquility and wisdom are samādhi and prajñā; harmony and principle are virtue and the Dao. To possess wisdom yet not use it is to secure one’s tranquility. Nurtured over time, virtue and the Dao naturally form.\n\nYet this samādhi is achieved through causes. Some, observing profit and seeing harm, fear calamity and still their minds; some, through renunciation and purification, accumulate practice until the heart matures, converging in samādhi as if by nature. Swift thunder shatters mountains without startling, flashing blades cross before the eyes without fear. One regards fame and profit as a fleeting gap, knows life and death as a bursting abscess. Thus to focus the will without distraction is to concentrate the spirit. The heart’s emptiness and subtlety cannot be conceived.\n\nAs for the heart as a thing: in essence, it is not existent; in function, it is not nonexistent. Unhurried, it moves swiftly; unsummoned, it arrives. When angered, dark stones drink in feathers; when resentful, summer’s redness brings frost to fall.\n\nWhere vice runs rampant, the Nine Dark Realms are not distant; where goodness accumulates, the Three Clarities are not far. Now appearing, now vanishing—movement and stillness cannot name it; now possible, now impossible—not even milfoil and tortoise can divine it. As for its mastery, how could the taming of deer and horses compare to its difficulty?\n\nThe Most High Lord Lao, moving with constant goodness to save humankind, ascended the Spirit Terrace and expounded the wondrous, condensing the causes and fruits of the Two Vehicles while broadening the spontaneity of the ten thousand existences. Gradually, through daily diminution; suddenly, through non-study. The analogy: stretching a bow, chiseling a door. The method: blunting sharpness, unraveling tangles. Cultivation follows paths; practice shapes nature. Dimming the ears, breaking the body, one sits in profound forgetfulness, unmoved by stillness, entering illumination through the subtlest traces.\n\nThose who tread distant lands may never attain the perfect meaning, but those who follow this Dao may expect to behold its mystery. Little effort, great achievement—how essential! How wondrous!\n\n**Chapter Seven: Attaining the Dao**\n\nThe Dao is a thing of numinous strangeness, spirit-like yet possessing nature, empty yet without form. It cannot be anticipated or sought in echoes or shadows; one knows not how it is so, yet so it is. Flowing without exhaustion, it is called the Dao. The utmost sages received it in antiquity; the wondrous Dharma transmits it to the present. Tracing names to investigate principles, one finds it wholly real.\n\nThe superior person, pure in faith, restrains the self and practices diligently. With an empty heart and valley spirit, only the Dao gathers there. The Dao possesses supreme power, readily transforming form and spirit. When form follows the Dao’s thoroughfare, it unites with spirit. Form and spirit as one—this is called the spirit-person. The spirit’s nature is empty and fused, its essence unchanging and undying. When form aligns with it, there is no birth or death. Concealed, form becomes as spirit; revealed, spirit becomes as form. Thus one treads water and fire without harm, faces sun and moon without shadow, controls life and death at will, and moves in and out without obstruction. Though the body is coarse matter, it may yet attain the utmost emptiness and subtlety—how much deeper and farther, then, does its numinous wisdom reach!\n\nThus the *Lingbao Sutra* states: \"When body and spirit are as one, it is the true body.\" The *Scripture of Western Ascension* also says: \"When form and spirit unite, they endure long.\" Yet the Dao of emptying the heart varies in depth of power. Deep, it pervades the form; shallow, it reaches only the heart. Those it pervades become spirit-persons; those it reaches in the heart gain only wisdom and awareness. The body cannot escape decay—why? Wisdom is the heart’s function, and overuse wearies the substance. At first, small wisdom brings joy and much debate, scattering spirit and qi, leaving no numinous essence to nourish the body. Life ends prematurely, and the Dao remains incomplete. The sutras call this \"corpse liberation.\"\n\nThus the great person conceals brilliance and hides radiance, awaiting full attainment. Concentrating spirit and treasuring qi, one studies the Dao without intent. When spirit and Dao unite, this is called attaining the Dao. Thus the sutras say: \"One who is the same as the Dao—the Dao also attains them.\" And: \"Why did the ancients value this Dao? Did they not seek it daily to attain it and to be freed from transgressions?\"\n\nMountains with jade cause grasses and trees not to wither; people who embrace the Dao find their forms enduring. Nourished by its influence over time, their substance transforms to become as spirit. Refining spirit to the subtlest, they merge with the Dao in darkness. Scattering one body into the ten thousand dharmas, blending the ten thousand dharmas into one body. Wisdom illuminates without bounds; form transcends all limits. Gathering form and emptiness as function, uniting creation as achievement. True responses are without direction—truly, this is virtue and power.\n\nThus the *Scripture of Western Ascension* says: \"With the same heart as heaven yet without knowledge, with the same body as the Dao yet without form—only then does the great Dao flourish.\" To say \"flourish\" means to realize its ultimate attainment. It also says: \"When spirit does not leave the body, it endures as long as the Dao.\" When body and Dao are one, there is no time when they do not exist. When heart and Dao are one, there is no dharma they do not penetrate. The ear becomes the Dao-ear, hearing all sounds without sound; the eye becomes the Dao-eye, seeing all colors without color. The six senses become thoroughly clear—this is the reason.\n\nThe profound teachings of the mysterious tradition bring deep and vast benefit. Tracing texts to investigate principles, let us attempt to speak of them. The hidden mysteries of Shangqing rely on refined cultivation through resonance, borrowing divine elixirs to refine substance, so that wisdom and perception are utterly forgotten. The *Daodejing* opens its teaching with diligent faith in oneness, accumulating an empty heart to wash away burdens, so that the body’s shadow is severed. Skillful expedients, though differing, all converge at the Dao’s source. Heart and substance mutually sustain each other; principles surpass those of carriages and chambers. From external to internal, different paths lead to the same end. Encompassing the profound and obscure, discussion and silence cannot reach it. The wonders of these two traditions are thus beyond the reach of Confucius or Śākyamuni. As for the rest, they are but the commonplace.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "坐忘论 唐 司马承祯 夫人之所贵者，生也； 生之所贵者，道也。 人之有道，如鱼之有水。 涸辙之鱼，犹希升水。 弱丧之俗，无心造道。 恶生死之苦，爱生死之业。 重道德之名，轻道德之行。 喜色味为得志，鄙恬素为穷辱。 竭难得之货，市来生之福。 纵易染之情，丧今身之道。 自云智巧，如梦如迷。 生来死去，循环万劫。 审惟倒置，何甚如之！ 故《妙真经》云：人常失道，非道失人； 人常去生，非生去道。 故养生者慎勿失道，为道者慎勿失生。 使道与生相守，生与道相保，二者不相离，然后乃长久。 言长久者，得道之质也。 经云：生者，天之大德也，地之大乐也，人之大福也。 道人致之，非命禄也。 又《西升经》云：我命在我，不属于天。 由此言之，修短在己，得非天与，失非人夺。 扪心苦晚，时不少留。 所恨朝菌之年，已过知命，归道之要，犹未精通。 为惜寸阴，速如景烛。 勉寻经旨，事简理直，其事易行。 与心病相应者，约着安心坐忌之法，略成七条，修道阶次，兼其枢翼，以编叙之。 信敬第一 夫信者道之根，敬者德之蒂。",
      "translated_text": "**On Sitting in Forgetfulness**\n*By Sima Chengzhen of the Tang*\n\nWhat men hold precious is life;\nwhat life holds precious is the Dao.\nMan’s possession of the Dao\nis like a fish’s possession of water.\nFish stranded in a dried rut\nstill long to ascend to water.\nYet in this age of feeble decline,\nmen’s hearts no longer seek the Dao.\nThey dread the suffering of life and death,\nyet cling to the karmic deeds of life and death.\nThey prize the name of virtue and power,\nbut scorn the practice of virtue and power.\nThey deem sensual pleasures and rich flavors success,\nand despise tranquility and simplicity as poverty and disgrace.\nThey exhaust rare and precious goods\nto purchase blessings for future lives,\nindulging in easily tainted passions\nwhile forsaking the Dao of this present body.\nProud of their cunning and skill,\nthey remain as if in dream, as if in delusion.\nBorn, they die; dying, they are born—\nthus they cycle through ten thousand kalpas.\nHow utterly inverted is this!\nHow extreme the confusion!\n\nThus the *Scripture of Wondrous Perfection* states:\nMan constantly loses the Dao—\nit is not the Dao that loses man.\nMan constantly departs from life—\nit is not life that departs from the Dao.\nTherefore, those who nurture life\nmust take care never to lose the Dao;\nthose who cultivate the Dao\nmust take care never to lose life.\nLet the Dao and life guard each other,\nlet life and the Dao preserve each other.\nOnly when the two never part\ncan there be enduring permanence.\nThis enduring permanence\nis the essence of attaining the Dao.\n\nThe scripture says:\nLife is Heaven’s great virtue,\nEarth’s great joy,\nman’s great fortune.\nThe Daoist achieves this—\nit is not a matter of fate or fortune.\n\nThe *Scripture of Western Ascent* also says:\n\"My life rests with me,\nnot with Heaven.\"\nFrom this we know:\nlength or brevity of life lies within oneself.\nAttainment is not granted by Heaven,\nloss is not seized by others.\nI regret that, pressing my heart, I realize it is late—\ntime does not tarry even briefly.\nAlas, the years of my life,\nlike the ephemeral morning mushroom,\nhave already passed the age of knowing fate,\nyet the essentials of returning to the Dao\nremain imperfectly mastered.\nCherishing every inch of time,\nswift as the fleeting shadow of a candle,\nI strive to follow the scriptures’ purport.\nThe method is simple, the principle direct,\nthe practice easy to perform.\nIn response to the afflictions of the heart,\nI have distilled and set forth the method of pacifying the mind through seated forgetting,\ncondensing it into seven principles.\nThese serve as steps in the cultivation of the Dao,\nas both its pivot and wings.\nHere I arrange and record them.\n\n**First: Faith and Reverence**\nFaith is the root of the Dao;\nreverence is the stem of virtue.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 425,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.322818517684937,
      "metadata": {
        "source_file": "dao\\藏外\\坐忘论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "根深则道可长，蒂固则德可茂。 然则璧耀连城之彩，卞和致刖； 言开保国之效，伍子从诛。 斯乃形器着而心绪迷，理事萌而情思忽。 况至道超于色味，真性隔于可欲，而能闻希微以悬信，听罔象而不惑者哉！ 如人有闻坐忌之法，信是修道之要，敬仰尊重，决定无疑者，加之勤行，得道必矣。 故庄周云：隳肢体，黜聪明，离形去智，同于大通，是谓坐忌。 夫坐忌者，何所不忌哉！ 内不觉其一身，外不知乎宇宙，与道冥一，万虑皆遗，故庄子云，同于大通。 此则言浅而意深，惑者闻而不信，怀宝求宝，其如之何？ 故经云：信不足，有不信。 谓信道之心不足者，乃有不信之祸及之，何道之可望乎？ 断缘第二 断缘者，谓断有为俗事之缘也。 弃事则形不劳，无为则心自安。 恬简日就，尘累日薄，迹弥远俗，心弥近道，至神至圣，孰不由此乎？ 故经云：塞其兑，闭其门，终身不勤。 或显德露能，来人保己； 或遗问庆吊，以事往还； 或假修隐逸，情希升进； 或酒食邀致，以望后恩。 斯乃巧蕴机心，以干时利，既非顺道，深妨正业。 凡此之类，皆应绝之。 故经云：开其兑，济其事，终身不救。 我但不唱，彼自不和； 彼虽有唱，我不和之。 旧缘渐断，新缘莫结。 醴交势合，自致日疏，无事安闲，方可修道。 故庄子云：不将不迎。 为无交俗之情故也。 又云：无为名尸，无为谋府，无为事任，无为知主。 若事有不可废者，不得已而行之，勿遂生爱，系心为业。 收心第三 夫心者，一身之主，百神之帅。 静则生慧，动则成昏。 欣迷幻境之中，唯言实是； 甘宴有为之内，谁悟虚非？ 心识颠痴，良由所托之地。 且卜邻而居，犹从改操； 择交而友，尚能致益。 况身离生死之境，心居至道之中，安不舍彼乎？ 能不得此乎？ 所以学道之初，要须安坐，收心离境，住无所有，不着一物，自入虚无，心乃合道。 故经云：至道之中，寂无所有，神用无方，心体亦然。 源其心体，以道为本。 但为心神被染，蒙蔽渐深，流浪日久，遂与道隔。 今若能净除心垢，开释神本，名曰修道。 无复流浪，与道冥合，安在道中，名曰归根。 守根不离，名曰静定。 静定日久，病消命复。 复而又续，自得知常。 知则无所不明，常则永无变灭。 出离生死，实由于此。 是故法道安心，贵无所着。 故经云：夫物芸芸，各归其根。 归根曰静，静曰复命。 复命曰常，知常曰明。 若执心住空，还是有所，非谓无所。 凡住有所，则自令人心劳气发，既不合理，又反成疾。 但心不着物，又得不动，此是真定正基。 用此为定，心气调和，久益轻爽。 以此为验，则邪正可知。 若心起皆灭，不简是非，永断知觉，入于盲定。 若任心所起，一无收制，则与凡人元来不别。 若唯断善恶，心无指归，肆意浮游，待自定者，徒自误耳。 若遍行诸事，言心无染者，于言甚美，于行甚非，真学之流，特宜戒此。 今则息乱而不灭照，守静而不着空，行之有常，自得真见。 如有时事，或法有要疑者，且任思量，令事得济，所疑复悟，此亦生慧正根。 事讫则止，实莫多思，多思则以知害恬，为子伤本，虽骋一时之俊，终亏万代之业。 若烦邪乱想，随觉则除。 若闻毁誉之名，善恶等事，皆即拨去，莫将心受。",
      "translated_text": "Root deep, the Dao may endure long; stem firm, virtue may flourish abundantly. Yet jade of dazzling brilliance, though worth cities, brought Bian He the loss of his feet; words that could preserve a kingdom brought Wu Zixu execution. Such is the way of the world: when forms and implements stand forth, the heart’s threads grow tangled; when principles and affairs first sprout, emotions and thoughts turn heedless. How much more so with the supreme Dao, which transcends form and flavor, and the true nature, which is veiled by the desirable—who can hear the faint and subtle and hold fast to faith, or listen to the formless and remain unconfused?\n\nIf one hears of the method of seated forgetting and believes it to be the essential of cultivating the Dao, revering and honoring it with unwavering resolve, and then applies oneself diligently to practice, attainment of the Dao is certain. Thus Zhuang Zhou said: “Dismantle the limbs, dismiss brilliance, depart from form, abandon knowledge, and merge with the Great Thoroughfare—this is called seated forgetting.” What is there that seated forgetting does not forget? Within, one is unaware of one’s own body; without, one knows not the cosmos. In oneness with the Dao, the myriad cares all fade away. Thus Zhuangzi said, “Merge with the Great Thoroughfare.” These words are simple, yet their meaning runs deep. The deluded hear but do not believe—clutching treasure while seeking treasure, what can be done? Therefore the scripture says: “Where faith is insufficient, there is disbelief.” If the heart’s faith in the Dao is lacking, the calamity of disbelief will befall one. How then can the Dao be hoped for?\n\n**Second: Severing Conditions**\nTo sever conditions means to cut off the ties of worldly, contrived affairs. Abandoning affairs, the body does not labor; practicing non-action, the heart finds peace of itself. Day by day, tranquility and simplicity grow; day by day, the dust of entanglements thins. The farther one’s traces recede from the vulgar, the nearer the heart draws to the Dao. Who among the most divine and sagely did not follow this path? Thus the scripture says: “Block the openings, shut the gates, and to the end of life you will not toil.”\n\nSome display virtue or reveal ability to win others’ protection; some exchange greetings of congratulation or condolence, engaging in social intercourse; some feign reclusion while secretly hoping for advancement; some host feasts and banquets, seeking future favors. These are all cunning schemes to pursue worldly gain, neither in accord with the Dao nor conducive to true practice. All such things must be severed. Thus the scripture says: “Open the openings, assist in affairs, and to the end of life you will not be saved.”\n\nI do not initiate; they do not respond. Though they may initiate, I do not respond. Old conditions gradually dissolve; new conditions must not form. Sweet friendships and power alliances naturally grow distant day by day. Only when free from affairs and at ease can one cultivate the Dao. Thus Zhuangzi said: “Neither advance nor retreat,” for there is no entanglement with the vulgar. He also said: “Be not the lodging-place of fame, the storehouse of schemes, the bearer of tasks, or the master of knowledge.”\n\nIf there are affairs that cannot be abandoned, act only when unavoidable, without becoming attached or making them a preoccupation. Do not let the heart cling to them as a pursuit.\n\n**Third: Gathering the Heart**\nThe heart is the master of the body and the commander of the hundred spirits. Still, it gives rise to wisdom; agitated, it becomes deluded. Enchanted by illusory realms, one takes words to be real; feasting within contrived affairs, who awakens to their emptiness and falsity? The heart’s confusion and folly arise from the ground to which it clings.\n\nEven choosing neighbors to dwell beside may alter one’s conduct; selecting friends to associate with can bring benefit. How much more so when the body departs from the realm of life and death, and the heart abides within the supreme Dao—how can one not abandon the former? How can one fail to attain this?\n\nThus, at the outset of learning the Dao, one must sit in stillness, gather the heart, depart from external conditions, and dwell in nothingness. Not attaching to a single thing, one naturally enters the void, and the heart unites with the Dao. Thus the scripture says: “Within the supreme Dao, there is tranquil nothingness. The spirit’s function is without limit; the heart’s essence is likewise.” Trace the heart’s essence to its source, and the Dao is its root.\n\nYet the heart-spirit has been stained and obscured, growing ever more deeply veiled. Wandering long, it has become estranged from the Dao. If now one can purify and remove the heart’s filth, releasing the spirit’s original nature, this is called cultivating the Dao. No longer wandering, one merges with the Dao, abiding within it—this is called returning to the root. Guarding the root without parting from it is called stillness and stability. With stillness and stability prolonged, illness fades and life is restored. Restoration followed by continuity leads to knowing the constant. Knowing brings clarity without obscurity; the constant brings permanence without change or decay. Emerging from life and death truly depends on this.\n\nTherefore, in pacifying the heart through the Dao’s method, nothing is more precious than non-attachment. Thus the scripture says: “The ten thousand things flourish, each returning to its root. Returning to the root is called stillness; stillness is called restoring life. Restoring life is called the constant; knowing the constant is called clarity.”\n\nIf one clings to the heart in emptiness, this is still attachment to something, not true nothingness. Any attachment to something inevitably wearies the heart and stirs the qi, neither in accord with principle nor beneficial to health. Only when the heart does not cling to things and remains unmoving is this the true foundation of stability. Using this as stability, the heart and qi harmonize, and over time one grows ever lighter and more at ease. This serves as verification, by which right and wrong may be known.\n\nIf one extinguishes every arising thought without discerning right from wrong, permanently severing awareness, this is blind stability. If one allows the heart to arise without restraint or control, this is no different from an ordinary person. If one merely severs good and evil without giving the heart direction, drifting aimlessly and waiting for self-stabilization, one merely deludes oneself. If one engages in all manner of affairs while claiming the heart is unstained, such words may sound fine, but the conduct is far from it. Those who truly walk the path must especially guard against this.\n\nNow, still the chaos without extinguishing illumination; guard stillness without clinging to emptiness. Practice this with constancy, and true insight will naturally arise. If there are matters at hand or essential points in the method that raise doubts, allow thought to proceed so that the matter may be resolved and the doubt dispelled—this too is the root of wisdom. Once the matter is concluded, cease; truly, do not think excessively. Excessive thought harms tranquility with knowledge, injuring the root as a son harms his father. Though one may gallop with brilliance for a time, in the end it undermines the work of ten thousand generations.\n\nIf vexing, perverse, or chaotic thoughts arise, eliminate them upon awareness. If one hears words of praise or blame, good or evil, immediately cast them aside—do not let the heart receive them.",
      "overlap_context": ",\nI strive to follow the scriptures’ purport.\nThe method is simple, the principle direct,\nthe practice easy to perform.\nIn response to the afflictions of the heart,\nI have distilled and set forth the method of pacifying the mind through seated forgetting,\ncondensing it into seven principles.\nThese serve as steps in the cultivation of the Dao,\nas both its pivot and wings.\nHere I arrange and record them.\n\n**First: Faith and Reverence**\nFaith is the root of the Dao;\nreverence is the stem of virtue.",
      "start_char": 425,
      "end_char": 1644,
      "start_sentence": 30,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.66192054748535,
      "metadata": {
        "source_file": "dao\\藏外\\坐忘论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若心受之即心满，心满则道无所居。 所有闻见，如不闻见，则是非美恶不入于心。 心不受外，名曰虚心； 心不逐外，名曰安心。 心安而虚，则道自来止。 故经云：人能虚心无为，非欲于道，道自归之。 内心既无所着，外行亦无所为。 非静非秽，故毁誉无从生； 非智非愚，故利害无由至。 实则顺中为常，权可与时消息，苟免诸累，是其智也。 若非时非事，役思强为者，自云不着，终非真觉。 何邪？ 心法如眼也。 纤毫入眼，眼则不安； 小事开心，心必动乱。 既有动病，难入定门。 是故修道之要，急在除病。 病若不除，终不得定。 又如良田，荆棘未诛，虽下种子，嘉苗不成。 爱见思虑，是心荆棘。 若不除翦，定慧不生。 或身居富贵，或学备经史，言则慈俭，行乃贪残。 辩足以饰非，势足以威物，得则名己，过必尤人。 此病最深，虽学无益。 所以然者，为自是故。 然此心由来依境，未惯独立，乍无所托，难以自安。 纵得暂安，还复散乱。 随起随制，务令不动，久久调熟，自得安闲。 无问昼夜，行立坐卧，及应事之时，常须作意安之。 若心得定，但须赡养，莫有恼触。 少得定分，则堪自乐。 渐渐驯狎，唯觉清远。 平生所重，已嫌弊漏，况因定生慧，深违真假乎！ 牛马，家畜也，放纵不收，犹自生鲠，不受驾御； 鹰鹯，野鸟也，被人击绊，终日在手，自然调熟。 况心之放逸，纵任不收，唯益粗疏，何能观妙？ 故经云：虽有拱璧，以先驷马，不如坐进此道。 夫法之妙者，其在能行，不在能言。 行之则此言为当，不行则此言为妄。 又时人所学，贵难贱易。 若深论法，惟广说虚无，思虑所不达，行用所无阶者，则叹不可思议，而下风尽礼。 如其信言不美，指事陈情，闻则心解，言则可行者，此实不可思议，而人不信。 故经云：吾言甚易知，甚易行。 天下莫能知，莫能行。 夫唯不知，是以不吾知也。 或有言火不热，灯不照暗，称为妙义。 夫火以热为用，灯以照为功。 今则盛言火不热，未尝一时废火； 空言灯不照暗，必须终夜然灯。 言行相违，理实无取。 此只破相之言，而人反以为深元之妙。 虽则惠子之宏辩，庄生以为不堪。 肤受之流，谁能科简？ 至学之士，庶不留心。 或曰：夫为大道者，在物而心不染，处动而神不乱，无事而不为，无时而不寂。 今犹避事而取静，离动而之定，劳于控制，乃有动静二心，滞于住守，是成取舍两病。 不觉其所执，仍自谓道之阶要，何其谬耶！ 述曰：总物而称大，道物之谓道，在物而不染，处事而不乱，真为大矣！ 实为妙矣！ 然谓吾子之鉴有所未明。",
      "translated_text": "If the heart receives them, the heart becomes full; when the heart is full, the Dao has no place to dwell. Let all that is heard and seen be as if unheard and unseen, so that right and wrong, beauty and evil do not enter the heart. When the heart does not receive externals, it is called an empty heart; when the heart does not chase externals, it is called a peaceful heart. When the heart is peaceful and empty, the Dao naturally comes to rest within.\n\nThus the sutra says: If one can empty the heart and practice non-action, without desiring the Dao, the Dao will come of itself. When the inner heart has nothing to cling to, outer conduct also has nothing to strive for. Neither pure nor defiled, praise and blame cannot arise; neither wise nor foolish, gain and harm cannot reach one. In truth, following the mean is the constant way, while adaptability allows one to ebb and flow with the times—merely to avoid all entanglements is wisdom.\n\nIf one forces thought and action where neither time nor circumstance demands, claiming non-attachment, it is never true awakening. Why? The mind is like the eye: even a speck of dust entering the eye disturbs its peace; a small matter opening the heart stirs it to disorder. Once this disturbance arises, it is difficult to enter the gate of samadhi. Therefore, the essential task in cultivating the Dao is urgently to remove afflictions. If afflictions are not removed, one will never attain samadhi.\n\nIt is like good farmland: if brambles are not cleared, even when seeds are sown, fine sprouts will not grow. Love, views, thoughts, and anxieties are the brambles of the heart. If they are not cut away, samadhi and wisdom will not arise.\n\nSome dwell in wealth and nobility, or master the classics and histories; their words may be kind and frugal, yet their actions are greedy and cruel. Their eloquence suffices to conceal wrongdoing, their power suffices to intimidate others; success is claimed as their own, while failure is blamed on others. This affliction runs deepest, and though one may study, it is of no benefit. The reason is self-righteousness.\n\nYet this heart has long depended on conditions and is unaccustomed to independence; suddenly left without support, it finds it hard to be at ease. Even if it attains momentary peace, it soon scatters again. Rise and restrain it each time, striving to keep it unmoved; with long and patient training, it will naturally become peaceful and at ease. Whether day or night, in walking, standing, sitting, or lying down, and when attending to affairs, one must constantly intend to settle it. Once the heart attains samadhi, simply nurture it and avoid disturbance. Even a small measure of samadhi brings its own joy. Gradually, as familiarity grows, one feels only clarity and distance. What was once prized in life now seems flawed and leaky—how much more, when samadhi gives rise to wisdom, will one deeply discern truth from falsehood!\n\nOxen and horses are domesticated animals; if left unrestrained, they grow stubborn and refuse to be harnessed. Hawks and falcons are wild birds; though bound by man, if kept in hand all day, they become naturally tame. How much more, when the heart is left to wander unrestrained—only coarseness increases, and how can one perceive the subtle? Thus the sutra says: Though one may possess a great jade disc preceded by a team of four horses, it is not equal to sitting and advancing in this Dao.\n\nThe wonder of the Dharma lies in its practice, not in its words. If practiced, these words are true; if not practiced, they are false.\n\nMoreover, people of this age value the difficult and despise the easy. When the Dharma is discussed in depth, they extol only vast discourses on emptiness—things beyond thought and without practical steps—and sigh in awe, bowing in reverence. Yet if the words are plain, pointing to matters and stating truths, so that upon hearing, the heart understands, and in speaking, they can be practiced—this is truly inconceivable, yet people do not believe it. Thus the sutra says: My words are very easy to know, very easy to practice. Yet none in the world can know them, none can practice them. Only because they do not know is it that they do not know me.\n\nSome say fire is not hot, a lamp does not illuminate darkness, calling this profound meaning. Yet fire’s function is heat, a lamp’s purpose is light. Now, loudly proclaiming fire is not hot, one never for a moment abandons fire; emptily declaring a lamp does not illuminate darkness, one must still burn it all night. Words and actions contradict each other, and in truth, there is nothing to be gained. These are merely words to break attachment to forms, yet people mistake them for profound and abstruse wonders. Even with Hui Shi’s great eloquence, Zhuangzi found him unbearable. How can those who take words at face value discern the truth? Those who truly seek learning should not fix their minds here.\n\nSome say: To embody the great Dao is to be in the world without the heart being stained, to dwell in activity without the spirit being disturbed, to act without ceasing, to be still without interruption. Now, avoiding affairs to seek stillness, leaving activity to pursue samadhi, laboring to control the mind—this creates a duality of movement and stillness, clinging to abiding—these are the twin afflictions of grasping and rejecting. Unaware of their own attachments, they still claim this is the essential step of the Dao—how mistaken!\n\nIn response: To encompass all things and be called great, to guide all things is to be the Dao; to be in the world without stain, to handle affairs without disturbance—this is truly great! Truly wondrous! Yet it seems your discernment has not yet fully awakened.",
      "overlap_context": "o is the root of wisdom. Once the matter is concluded, cease; truly, do not think excessively. Excessive thought harms tranquility with knowledge, injuring the root as a son harms his father. Though one may gallop with brilliance for a time, in the end it undermines the work of ten thousand generations.\n\nIf vexing, perverse, or chaotic thoughts arise, eliminate them upon awareness. If one hears words of praise or blame, good or evil, immediately cast them aside—do not let the heart receive them.",
      "start_char": 1644,
      "end_char": 2612,
      "start_sentence": 101,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.649646759033203,
      "metadata": {
        "source_file": "dao\\藏外\\坐忘论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "何则？ 徒见贝锦之辉焕，未晓始抽于素丝； 才闻鸣鹤之冲天，讵织先资于谷食？ 蔽日之干，起于毫末； 神凝之圣，积习而成。 今徒学语其圣德，而不知圣之所以德。 可谓见卯而求时夜，见弹而求鸮炙。 何其造次哉！ 故经云：玄德深矣远矣！ 与物反矣！ 然后乃至大顺。 简事第四 夫人之生也，必营于事物。 事物称万，不独委于一人。 巢林一枝，鸟见遗于丛苇； 饮河满腹，兽不吝于洪波。 外求诸物，内明诸己。 知生之有分，不务分之所无； 识事之有当，不任非当之事。 事非当则伤于智力，务过分则毙于形神。 身且不安，何情及道？ 是以修道之人，要须断简事物，知其闲要，较量轻重，识其去取，非要非重，皆应绝之。 犹人食有酒肉，衣有罗绮，身有名位，财有金玉。 此并情欲之余好，非益生之良药，众皆徇之，自致亡败。 静而思之，何迷之甚！ 故庄子云：达生之情者，不务生之所无。 以为生之所无生之所无以为者，分之外物也。 蔬食弊衣，足延性命，岂待酒食罗绮，然后为生哉！ 是故于生无要用者，并须去之； 于生虽用，有余者，亦须舍之。 财有害气，积则伤人。 虽少犹累，而况多乎！ 今以随侯之珠，弹千仞之雀，人犹笑之。 况弃道德，忽性命，而从非要，以自促伐者乎！ 夫以名位比于道德，则名位假而贱，道德真而贵。 能知贵贱，应须去取。 不以名害身，不以位易道。 故《庄子》云：行名失己，非士也。 《西升经》云：抱元守一，至度神仙，子未能守，但坐荣官。 若不简择，触事皆为，则身劳智昏，修道事阙。 若处事安闲，在物无累者，自属证成之人。 若实未成，而言无累者，诚自诳耳。 真观第五 夫观者，智士之先鉴，能人之善察。 究傥来之祸福，详动静之吉凶。 得见机前，因之造适。 深祈卫定，功务全生。 自始之末，行无遗累。 理不违此，故谓之真观。 然则一餐一寝，居为损益之源，一言一行，堪成祸福之本。 虽则巧持其末，不如拙戒其本。 观本知末，又非躁竞之情。 是故收心简事，日损有为。 体静心闲，方能观见真理。 故经云：常无欲，以观其妙。 然于修道之身，必资衣食。 事有不可废，物有不可弃者，当须虚襟而受之，明目而当之，勿以为妨，心生烦躁。 若见事为事而烦躁者，心病已动，何名安心？ 夫人事衣食者，我之船舫。 我欲渡海，事资船舫。 渡海若讫，理自不留。 何因未渡，先欲废船？ 衣食虚幻，实不足营。 为欲出离虚幻，故求衣食。 虽有营求之事，莫生得失之心。 则有事无事，心常安泰。 与物同求，而不同贪； 与物同得，而不同积。 不贪故无忧，不积故无失。 迹每同人，心常异俗。 此实行之宗要，可力为之。 前虽断简，病有难除者，且依法观之。 若色病重者，当观染色，都由想耳。 想若不生，终无色事。 若知色想外空，色心内妄，妄心空想，谁为色主？ 经云：色者，全是想耳！ 想悉是空，何有色耶？ 又思妖妍美色，甚于狐魅。 狐魅惑人，令人厌患。 身虽致死，不入恶道，为厌患故，永离邪淫。 妖艳惑人，令人爱着，乃至身死，留恋弥深。 为邪念故，死堕地狱，永夫人道，福路长乖。 故经云：今世发心为夫妻，死后不得俱生人道。 所以者何？ 为邪念故。",
      "translated_text": "Why is this so? Dazzled by the brilliance of brocade, one fails to see the plain silk from which it was first drawn; hearing the crane’s soaring cry, how could one know it was first nourished by valley grain? Towering trees that block the sun begin as tender shoots; sagely mastery of spirit is cultivated through gradual practice. Yet now, merely learning to speak of sagely virtue, one remains ignorant of how virtue itself is attained—this is like seeing the hare and demanding the stew, or spotting the slingshot and craving the roasted owl. How hasty and reckless!\n\nThus the scripture says: *\"Profound virtue is deep and distant! It moves contrary to things! Only then does it attain great harmony.\"*\n\n**Chapter Four: Simplifying Affairs**\nMan’s life is necessarily entangled with affairs and things. Affairs and things number in the tens of thousands, yet none are entrusted to one person alone. A bird content with a single branch of the forest is spurned by the reeds; a beast that drinks its fill from the river does not begrudge the vast waves. Seek outwardly among things, but clarify inwardly within yourself. Know the limits of your allotted share—do not pursue what lies beyond it; recognize what is fitting in affairs—do not undertake what is unfitting. Affairs that are unfitting drain wisdom and strength; pursuits beyond one’s share exhaust body and spirit. If the self is not at peace, how can the heart attend to the Dao?\n\nTherefore, those who cultivate the Dao must decisively simplify affairs, discerning what is essential, weighing what is light or heavy, and knowing what to retain or discard. Whatever is nonessential or excessive should be cut away. Like a man’s food with its wine and meat, his clothing with its silks and brocades, his status with its titles and ranks, his wealth with its gold and jade—these are all superfluous desires, not the true medicine for preserving life. The masses chase after them, only to bring about their own ruin. In stillness, reflect: how deeply deluded they are!\n\nThus Zhuangzi says: *\"One who understands the essence of life does not pursue what life does not require.\"* For what life does not require is what lies beyond one’s allotted share—external things. Coarse food and worn clothes suffice to sustain life; must one wait for wine, meat, silks, and brocades before it can be called living? Therefore, what is nonessential to life must be discarded; even what is useful but in excess should also be relinquished. Wealth harms the qi—accumulated, it injures a person. Even a little is burdensome, let alone much!\n\nNow, to use the Marquis of Sui’s pearl to shoot a sparrow a thousand fathoms high—people still laugh at this. How much more foolish to abandon the Dao, neglect one’s nature and life, and chase after the nonessential, hastening one’s own destruction! When comparing fame and rank to the Dao, fame and rank are fleeting and base, while the Dao is real and noble. Knowing the noble from the base, one should act accordingly: do not let fame harm the self, nor let rank displace the Dao.\n\nThus Zhuangzi says: *\"One who pursues fame loses the self—such a one is no true scholar.\"* The *Scripture of Western Ascent* says: *\"Embrace the One and guard unity to cross over to the realm of immortals. You have not yet mastered this, but instead sit entangled in official glory.\"* If one does not simplify and choose carefully, engaging with every matter, the body will labor and the mind grow dull, and the work of cultivating the Dao will be neglected. Only one who is at ease amid affairs and unburdened by things may be called a person of attainment. If one has not truly attained this yet claims to be unburdened, it is self-deception.\n\n**Chapter Five: True Observation**\nObservation is the forerunner of the wise and the keen insight of the capable. It thoroughly examines impending fortune and misfortune, carefully discerns the auspicious and inauspicious in movement and stillness. Seeing the opportunity before it arises, one acts accordingly, deeply seeking stability and security, striving to preserve life whole. From beginning to end, one’s conduct leaves no lingering entanglements. As this principle is not violated, it is called *true observation*.\n\nNow, every meal and rest is the source of gain or loss; every word and deed may become the root of fortune or misfortune. Though one may skillfully manage the branches, it is better to clumsily guard the root. Observing the root to know the branches is not the way of restless striving. Therefore, collect the heart and simplify affairs, daily reducing active doing. Only when the body is still and the heart at ease can one observe and perceive true principle.\n\nThus the scripture says: *\"Always without desire, observe its mystery.\"*\n\nYet for one cultivating the Dao, clothing and food are necessary. There are affairs that cannot be abandoned and things that cannot be discarded. One should receive them with an empty mind, address them with a clear eye, and not let them become obstacles that stir up vexation. If one sees affairs as affairs and grows vexed, the sickness of the heart has already arisen—how can this be called a peaceful mind?\n\nMan’s affairs and sustenance are like a boat. I wish to cross the sea, and the boat is the means. Once the sea is crossed, the boat is naturally left behind. Why, before crossing, would one wish to abandon the boat? Clothing and food are illusory—truly, they are not worth pursuing. Yet to depart from illusion, one seeks clothing and food. Though there are matters of provision, do not generate a mind of gain and loss. Then, whether engaged in affairs or not, the heart remains constantly at peace. One seeks alongside others but does not share their greed; one obtains alongside others but does not share their accumulation. Without greed, there is no sorrow; without accumulation, there is no loss. Outwardly, one’s traces may resemble others’, but the heart remains apart from the vulgar. This is the essential principle of practice—one must strive to embody it.\n\nThough one may have simplified earlier, some afflictions are difficult to eradicate, so one should observe them according to the method. If the affliction of desire is severe, contemplate that the defilement of desire arises entirely from thought. If thought does not arise, there is ultimately no matter of desire. If one knows that desire is empty externally and the mind is deluded internally, that the deluded mind and empty thought—who then is the master of desire?\n\nThe scripture says: *\"Desire is entirely thought!\"* If thought is all empty, where is desire? Further, consider that bewitching beauty is more perilous than fox spirits. Fox spirits bewilder people, causing revulsion and suffering. Though they may lead to death, one does not fall into evil destinies, for revulsion ensures one forever departs from lust. But bewitching beauty bewilders people, causing attachment and longing—even unto death, the clinging grows deeper. For the sake of perverse thoughts, one dies and falls into hell, forever barred from the human realm, the path of blessings long severed.\n\nThus the scripture says: *\"Those who in this life vow to be husband and wife will not, after death, both be reborn in the human realm.\"* Why is this so? Because of perverse thoughts.",
      "overlap_context": " mind—this creates a duality of movement and stillness, clinging to abiding—these are the twin afflictions of grasping and rejecting. Unaware of their own attachments, they still claim this is the essential step of the Dao—how mistaken!\n\nIn response: To encompass all things and be called great, to guide all things is to be the Dao; to be in the world without stain, to handle affairs without disturbance—this is truly great! Truly wondrous! Yet it seems your discernment has not yet fully awakened.",
      "start_char": 2612,
      "end_char": 3820,
      "start_sentence": 161,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.99059224128723,
      "metadata": {
        "source_file": "dao\\藏外\\坐忘论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "又观色若定是美，何故鱼见深入，鸟见高飞？ 仙人以为秽浊，贤士喻之刀斧？ 一生之命，七日不食，便至于死。 百年无色，芃免夭伤。 故知色者，非身心之切要，适为性命之雠贼，何乃击恋，自取销毁？ 若见他人为恶，心生嫌恶者，犹如见人自杀己身，引项，承取他刃，以自害命。 他自为恶，不遣伐当，何故引取他恶，以为己病？ 又见为恶者若可嫌，见为善者亦须恶。 夫何故？ 同障道故。 若苦贫者，则审观之，谁与我贫？ 天地平等，覆载无私，我今贫苦，非天地也。 父母生子，欲令富贵，我今贫贱，非由父母。 人及鬼神，自救无暇，何能有力，将贫与我？ 进退寻察，无所从来，乃知我业也，乃知天命也。 业由我造，命由天赋。 业命之有，犹影响之逐形声，既不可逃，又不可怨。 唯有智者，因而善之，乐天知命，不觉贫之可苦。 故庄子云：业入而不可舍。 为自业。 故贫病来入，不可舍止。 经云：天地不能改其操，阴阳不能回其业。 由此言之，故知真命非假物也； 有何怨焉？ 又如勇士逢贼，无所畏惧，挥剑当前，群寇皆溃，功勋一立，荣禄终身。 今有贫病恼害我者，则寇贼也； 我有正心，则勇士也； 用智观察，则挥剑也； 恼累消除，则战胜也； 湛然常乐，则荣禄也。 凡有苦事，来迫我心，不作此观，而生忧恼者，如人逢贼，不立功勋，弃甲背军，以受逃亡之罪。 去乐就苦，何可愍焉！ 若病者，当观此病，由有我身，我若无身，患无所托。 故经云：及吾无身，吾有何患？ 次观于心，亦无真宰，内外求觅，无能受者。 所有计念，从妄心生，若枯体灰心，则万病俱泯。 若恶死者，应念我身，是神之舍。 身今老病，气力衰微，如屋朽坏，不堪居止，自须舍离，别处求安。 身死神逝，亦复如是。 若恋生恶死，拒违变化，则神识错乱，自失正业。 以此托生，受气之际，不感清秀，多逢浊辱。 盖下愚贪鄙，实此之由。 是故当生不悦，顺死无恶者，一为生死理齐，二为后身成业。 若贪爱万境，一爱一病。 一肢有疾，犹令举体不安，而况一心万疾，身欲长生，岂可得乎？ 凡有爱恶，皆是妄生。 积妄不除，何以见道？ 是故心舍诸欲，住无所有，除情正信，然后返观旧所痴爱，自生厌薄。 若以合境之心观境，终身不觉有恶； 如将离境之心观境，方能了见是非。 譬如醒人，能知醉者为恶； 如其自醉，不觉他非。 故经云：吾本弃俗，厌离人间。 又云：耳目声色，为子留愆，鼻口所喜，香味是怨。 老君厌世弃俗，犹见香味为怨。 嗜欲之流焉知鲍肆为臭哉！ 泰定第六 夫定者，尽俗之极地，致道之初基，习静之成功，持安之毕事。 形如槁木，心若死灰，无感无求，寂泊之至。 无心于定而无所不定，故曰泰定。 庄子云：宇泰定者，发乎天光。 宇则心也，天光则慧也。 心为道之器宇，虚静至极，则道居而慧生。 慧出本性，非适今有，故曰天光。 但以贪爱浊乱，遂至昏迷，澡雪柔挺，复归纯静。 本真神识，稍稍自明，非谓今时，别生他慧。 慧既生已，宝而怀之，勿为多知，以伤于定。 非生慧之难，慧而不用为难。 自古忘形者众，忘名者寡。 慧而不用，是忘名者也，天下希及之，是故为难。 贵能不骄，富能不奢，为无俗过，故得长守富贵。",
      "translated_text": "Moreover, if beauty were truly absolute, why do fish plunge deep at its sight, and birds take flight to the heights? Why do immortals deem it foul and filth, and sages liken it to axe and blade? A life may end after seven days without food, yet a century without desire spares one from untimely harm. Thus we know that desire is no essential need of body or mind—it is but a mortal foe, a thief of life. Why then cling to it, courting self-destruction?\n\nWhen you see others commit evil and feel revulsion, it is as if you saw a man slit his own throat, then seize another’s blade to finish the deed. He harms himself—why take up his sin as your own affliction? If evil is to be despised, then good must also be shunned—for both obstruct the Way.\n\nConsider the poor and suffering: who has made them so? Heaven and earth are impartial, covering and bearing all without favor. If you are poor, it is not their doing. Parents wish their children wealth and honor; if you are lowly, it is not by their will. Neither men nor spirits have leisure to save themselves—how could they impose poverty upon you? Searching near and far, you find no source. Know then that it is your *karma*, your *Heaven-appointed fate*. Karma is of your own making; fate is bestowed by Heaven. Their bond is as unshakable as shadow to form, echo to sound—inescapable, beyond reproach. Only the wise accept this, delighting in fate, unmoved by poverty’s bitterness.\n\nThus Zhuangzi says: *\"Karma enters and cannot be cast off.\"* It is of one’s own making. When poverty and illness come, they cannot be refused. The scripture says: *\"Heaven and earth cannot alter its course; yin and yang cannot reverse its karma.\"* From this we know that true fate is no fleeting thing—what cause is there for resentment?\n\nLike a warrior facing bandits, fearless, sword drawn to meet them, routing the horde—once victory is won, glory and rank endure for life. Now, when poverty and illness assail you, they are the bandits; your right mind is the warrior; wisdom is the sword; the dispelling of affliction is triumph; serene and constant joy is your reward. When suffering presses upon your heart and you do not contemplate thus, but instead grow troubled, it is as if a soldier, meeting bandits, abandons armor and flees, earning the penalty of a deserter. To forsake joy for suffering—how can this be pitied?\n\nIf afflicted by illness, reflect: this sickness arises from having a body. Without a body, where could suffering lodge? Thus the scripture says: *\"When I have no body, what suffering remains?\"* Next, examine the mind—it has no true master. Search within and without, and none can be found to bear it. All thoughts arise from the deluded mind. If the body withers and the heart turns to ash, all ailments vanish.\n\nIf you fear death, consider: this body is the abode of the spirit. Now aged and sick, its strength waning, like a decayed house unfit to dwell in—you must leave it to seek another refuge. When the body dies and the spirit departs, it is the same. To cling to life and resist death, to defy change, is to confuse the spirit, losing the right path. Reborn in this state, at the moment of receiving *qi*, you do not draw the pure and refined, but often meet the turbid and base. This is the root of the foolish and greedy—truly, their doing.\n\nThus, to be indifferent to life and accepting of death is twofold in benefit: first, it equalizes the principle of life and death; second, it perfects karma for the next life. To covet the ten thousand things is to invite a hundred ills. A single limb’s ailment disturbs the whole body—how much more so when the mind bears a thousand afflictions? Can the body then hope for longevity?\n\nAll likes and dislikes arise from delusion. If delusion accumulates unchecked, how can the Way be seen? Therefore, the heart must abandon all desires, dwell in emptiness, cast off emotion, and uphold right faith. Only then, looking back upon past infatuations, will disdain naturally arise. If you observe the world with a mind entangled in it, you will never perceive its faults; but with a mind detached, you will clearly see right and wrong. As the sober know the folly of the drunk, yet the drunk remain unaware of others’ faults, so the scripture says: *\"I once renounced the world, weary of the human realm.\"* And again: *\"The ears and eyes, sounds and sights—these are the faults that linger for you. The nose and mouth, the fragrances and flavors they crave—these are your foes.\"* Even Laozi, who spurned the world, saw fragrance and flavor as enemies. How could those drowning in desire know the stench of the fishmonger’s stall?\n\n**Sixth: Supreme Stability**\nStability is the utmost limit of the mundane, the first foundation of attaining the Dao, the fruition of practicing stillness, the completion of maintaining tranquility. The body is like withered wood, the heart like dead ashes—no stirring, no seeking, the height of quiescence. Without striving for stability, yet nothing is unstable—this is *Supreme Stability*.\n\nZhuangzi says: *\"When the universe is supremely stable, celestial radiance emerges.\"* The universe is the mind; celestial radiance is wisdom. The mind is the vessel of the Dao. When emptiness and stillness reach their utmost, the Dao resides within, and wisdom arises. Wisdom flows from one’s original nature, not newly acquired—thus it is called *celestial radiance*. Yet through the turbidity of greed and desire, clarity is lost, and confusion ensues. Wash and refine it, soften and straighten it, and return to pure stillness. The original true spirit gradually awakens—not that new wisdom is born at this moment.\n\nOnce wisdom arises, treasure and embrace it. Do not indulge in excessive knowledge, lest it harm stability. The difficulty lies not in generating wisdom, but in not using it. Since ancient times, many have forgotten the body, but few have forgotten fame. To possess wisdom yet not employ it is to forget fame—rare indeed in the world, hence its difficulty. To be noble yet not arrogant, wealthy yet not extravagant, free from worldly faults—thus one preserves wealth and honor for long.",
      "overlap_context": "destinies, for revulsion ensures one forever departs from lust. But bewitching beauty bewilders people, causing attachment and longing—even unto death, the clinging grows deeper. For the sake of perverse thoughts, one dies and falls into hell, forever barred from the human realm, the path of blessings long severed.\n\nThus the scripture says: *\"Those who in this life vow to be husband and wife will not, after death, both be reborn in the human realm.\"* Why is this so? Because of perverse thoughts.",
      "start_char": 3820,
      "end_char": 5033,
      "start_sentence": 246,
      "end_sentence": 316,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.61899971961975,
      "metadata": {
        "source_file": "dao\\藏外\\坐忘论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "定而不动，慧而不用，德而不恃，为无道过，故得深证常道。 故《庄子》云：知道易，勿言难。 知而不言，所以之天； 知而言之，所以之人。 古之人，天而不人。 慧能知道，非得道也。 人知得慧之利，未知得道之益。 因慧以明至理，纵辩以感物情。 与心徇事，触类而长，自云处动，而心常寂焉。 知寂者，寂以待物乎？ 此行此言，俱非泰定。 智虽出众，弥不近道。 本期逐鹿，获兔而归。 所得盖微，良由局小。 故《庄子》云：古之修道者，以恬养智。 智生而无以知为也，谓之以智养恬。 智与恬交相养，而和理出其性。 恬智则定慧也，和理则道德也。 有智不用，以安其恬。 养而久之，自成道德。 然论此定，因为而得成。 或因观利而见害，惧祸而息心； 或因损舍涤除，积习心熟，同归于定，咸若自然。 疾雷破山而不惊，白刃交前而无惧。 视名利如过隙，知生死若溃痈。 故知用志不分，乃凝神也。 心之虚妙，不可思也。 夫心之为物，即体非有，随用非无； 不驰而速，不召而至； 怒则玄石饮羽，怨则朱夏殒霜；",
      "translated_text": "Still in samādhi yet unmoving, wise yet not employing wisdom, virtuous yet not relying on virtue—thus free from transgressions against the Dao, and so one deeply realizes the eternal Dao.\n\nThus *Zhuangzi* says: \"To know the Dao is easy; to refrain from speaking of it is difficult.\" To know yet not speak is the way to Heaven; to know and speak is the way to man. The ancients followed Heaven, not man. To possess wisdom that knows the Dao is not yet to attain the Dao. People recognize the benefits of gaining wisdom, but few know the advantages of attaining the Dao. Through wisdom, one illuminates the ultimate principle; through eloquence, one moves the sentiments of others. Following the heart to pursue affairs, expanding upon each encounter—one claims to dwell in activity while the heart remains still. But does stillness mean waiting passively for things to arise? Such conduct and speech both fall short of perfect stability. Though one’s intelligence surpasses the multitude, it only drifts further from the Dao. One sets out to chase the deer, only to return with a hare—what is gained is meager, constrained by narrow vision.\n\nThus *Zhuangzi* says: \"The Daoists of old cultivated the Dao by nurturing tranquility with wisdom.\" When wisdom arises yet nothing is done with knowing, this is called nurturing tranquility with wisdom. Wisdom and tranquility nourish each other, and harmony and principle emerge from one’s nature. Tranquility and wisdom are samādhi and prajñā; harmony and principle are virtue and the Dao. To possess wisdom yet not use it is to secure one’s tranquility. Nurtured over time, virtue and the Dao naturally form.\n\nYet this samādhi is achieved through causes. Some, observing profit and seeing harm, fear calamity and still their minds; some, through renunciation and purification, accumulate practice until the heart matures, converging in samādhi as if by nature. Swift thunder shatters mountains without startling, flashing blades cross before the eyes without fear. One regards fame and profit as a fleeting gap, knows life and death as a bursting abscess. Thus to focus the will without distraction is to concentrate the spirit. The heart’s emptiness and subtlety cannot be conceived.\n\nAs for the heart as a thing: in essence, it is not existent; in function, it is not nonexistent. Unhurried, it moves swiftly; unsummoned, it arrives. When angered, dark stones drink in feathers; when resentful, summer’s redness brings frost to fall.",
      "overlap_context": "this moment.\n\nOnce wisdom arises, treasure and embrace it. Do not indulge in excessive knowledge, lest it harm stability. The difficulty lies not in generating wisdom, but in not using it. Since ancient times, many have forgotten the body, but few have forgotten fame. To possess wisdom yet not employ it is to forget fame—rare indeed in the world, hence its difficulty. To be noble yet not arrogant, wealthy yet not extravagant, free from worldly faults—thus one preserves wealth and honor for long.",
      "start_char": 5033,
      "end_char": 5434,
      "start_sentence": 317,
      "end_sentence": 346,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.142616748809814,
      "metadata": {
        "source_file": "dao\\藏外\\坐忘论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "纵恶则九幽匪遥，积善则三清何远？ 忽来忽往，动寂不能名； 时可时否，蓍龟莫能测； 其为调御，岂鹿马比其难乎！ 太上老君运常善以救人，升灵台而演妙，略二乘之因果，广万有之自然。 渐之以日损，顿之以不学。 喻则张弓凿户，法则挫锐解纷。 修之有途，习以成性。 黜聪隳体，嗒焉坐忘，不动于寂，几微入照。 履殊方者，了义无日，由斯道者，观妙可期。 力少功多，要矣！ 妙矣！ 得道第七 夫道者，神异之物，灵而有性，虚而无象，随迎莫测，影响莫求，不知所以不然而然之。 通生无匮，谓之道。 至圣得之于古，妙法传之于今。 循名究理，全然有实。 上士纯信，克己勤行。 空心谷神，唯道来集。 道有至力，染易形神。 形随道通，与神为一。 形神合一，谓之神人。 神性虚融，体无变灭。 形与之同，故无生死。 隐则形同于神，显则神同于形。 所以蹈水火而无害，对日月而无影，存亡在己，出入无间。 身为滓质，犹至虚妙，况其灵智益深益远乎！ 故《灵宝经》云：身神共一则为真身。 又《西升经》云：形神合同，故能长久。 然虚心之道，力有深浅，深则兼被于形，浅则唯及其心。 被形者，则神人也； 及心者，但得慧觉而已。 身不免谢，何则？ 慧是心用，用多则体劳。 初得小慧，悦而多辩，神气散泄，无灵润身，生致早终，道故难备。 经云尸解，此之谓也。 是故大人舍光藏晖，以期全备。 凝神宝气，学道无心，神与道合，谓之得道。 故经云：同于道者，道亦得之。 又云：古之所以贵此道者，何不日求以得，有罪以免耶？ 山有玉，草木因之不凋，人怀道，形体得之永固。 资熏日久，变质同神。 练神入微，与道冥一。 散一身为万法，混万法为一身。 智照无边，形超有际。 总色空以为用，合造化以为功。 真应无方，信惟道德。 故《西升经》云：与天同心而无知，与道同身而无体，然后大道盛矣。 而言盛者，谓证得其极。 又云：神不出身，与道同久。 且身与道同，则无时而不存。 心与道同，则无法而不通。 耳则道耳，无声而不闻； 眼则道眼，无色而不见。 六根洞达，良由于此。 至论玄教，为利深广，循文究理，尝试言之。 夫上清隐秘，精修在感，假神丹以炼质，智识为之洞忘； 《道德》开宗，勤信唯一，蕴虚心以涤累，形骸得之绝影。 方便善巧，俱会道源； 心体相资，理逾车室。 从外因内，异轨同归。 该通奥赜，议默无逮。 二者之妙，故非孔释之所能邻。 其余不知，盖是常耳。",
      "translated_text": "Where vice runs rampant, the Nine Dark Realms are not distant; where goodness accumulates, the Three Clarities are not far. Now appearing, now vanishing—movement and stillness cannot name it; now possible, now impossible—not even milfoil and tortoise can divine it. As for its mastery, how could the taming of deer and horses compare to its difficulty?\n\nThe Most High Lord Lao, moving with constant goodness to save humankind, ascended the Spirit Terrace and expounded the wondrous, condensing the causes and fruits of the Two Vehicles while broadening the spontaneity of the ten thousand existences. Gradually, through daily diminution; suddenly, through non-study. The analogy: stretching a bow, chiseling a door. The method: blunting sharpness, unraveling tangles. Cultivation follows paths; practice shapes nature. Dimming the ears, breaking the body, one sits in profound forgetfulness, unmoved by stillness, entering illumination through the subtlest traces.\n\nThose who tread distant lands may never attain the perfect meaning, but those who follow this Dao may expect to behold its mystery. Little effort, great achievement—how essential! How wondrous!\n\n**Chapter Seven: Attaining the Dao**\n\nThe Dao is a thing of numinous strangeness, spirit-like yet possessing nature, empty yet without form. It cannot be anticipated or sought in echoes or shadows; one knows not how it is so, yet so it is. Flowing without exhaustion, it is called the Dao. The utmost sages received it in antiquity; the wondrous Dharma transmits it to the present. Tracing names to investigate principles, one finds it wholly real.\n\nThe superior person, pure in faith, restrains the self and practices diligently. With an empty heart and valley spirit, only the Dao gathers there. The Dao possesses supreme power, readily transforming form and spirit. When form follows the Dao’s thoroughfare, it unites with spirit. Form and spirit as one—this is called the spirit-person. The spirit’s nature is empty and fused, its essence unchanging and undying. When form aligns with it, there is no birth or death. Concealed, form becomes as spirit; revealed, spirit becomes as form. Thus one treads water and fire without harm, faces sun and moon without shadow, controls life and death at will, and moves in and out without obstruction. Though the body is coarse matter, it may yet attain the utmost emptiness and subtlety—how much deeper and farther, then, does its numinous wisdom reach!\n\nThus the *Lingbao Sutra* states: \"When body and spirit are as one, it is the true body.\" The *Scripture of Western Ascension* also says: \"When form and spirit unite, they endure long.\" Yet the Dao of emptying the heart varies in depth of power. Deep, it pervades the form; shallow, it reaches only the heart. Those it pervades become spirit-persons; those it reaches in the heart gain only wisdom and awareness. The body cannot escape decay—why? Wisdom is the heart’s function, and overuse wearies the substance. At first, small wisdom brings joy and much debate, scattering spirit and qi, leaving no numinous essence to nourish the body. Life ends prematurely, and the Dao remains incomplete. The sutras call this \"corpse liberation.\"\n\nThus the great person conceals brilliance and hides radiance, awaiting full attainment. Concentrating spirit and treasuring qi, one studies the Dao without intent. When spirit and Dao unite, this is called attaining the Dao. Thus the sutras say: \"One who is the same as the Dao—the Dao also attains them.\" And: \"Why did the ancients value this Dao? Did they not seek it daily to attain it and to be freed from transgressions?\"\n\nMountains with jade cause grasses and trees not to wither; people who embrace the Dao find their forms enduring. Nourished by its influence over time, their substance transforms to become as spirit. Refining spirit to the subtlest, they merge with the Dao in darkness. Scattering one body into the ten thousand dharmas, blending the ten thousand dharmas into one body. Wisdom illuminates without bounds; form transcends all limits. Gathering form and emptiness as function, uniting creation as achievement. True responses are without direction—truly, this is virtue and power.\n\nThus the *Scripture of Western Ascension* says: \"With the same heart as heaven yet without knowledge, with the same body as the Dao yet without form—only then does the great Dao flourish.\" To say \"flourish\" means to realize its ultimate attainment. It also says: \"When spirit does not leave the body, it endures as long as the Dao.\" When body and Dao are one, there is no time when they do not exist. When heart and Dao are one, there is no dharma they do not penetrate. The ear becomes the Dao-ear, hearing all sounds without sound; the eye becomes the Dao-eye, seeing all colors without color. The six senses become thoroughly clear—this is the reason.\n\nThe profound teachings of the mysterious tradition bring deep and vast benefit. Tracing texts to investigate principles, let us attempt to speak of them. The hidden mysteries of Shangqing rely on refined cultivation through resonance, borrowing divine elixirs to refine substance, so that wisdom and perception are utterly forgotten. The *Daodejing* opens its teaching with diligent faith in oneness, accumulating an empty heart to wash away burdens, so that the body’s shadow is severed. Skillful expedients, though differing, all converge at the Dao’s source. Heart and substance mutually sustain each other; principles surpass those of carriages and chambers. From external to internal, different paths lead to the same end. Encompassing the profound and obscure, discussion and silence cannot reach it. The wonders of these two traditions are thus beyond the reach of Confucius or Śākyamuni. As for the rest, they are but the commonplace.",
      "overlap_context": "before the eyes without fear. One regards fame and profit as a fleeting gap, knows life and death as a bursting abscess. Thus to focus the will without distraction is to concentrate the spirit. The heart’s emptiness and subtlety cannot be conceived.\n\nAs for the heart as a thing: in essence, it is not existent; in function, it is not nonexistent. Unhurried, it moves swiftly; unsummoned, it arrives. When angered, dark stones drink in feathers; when resentful, summer’s redness brings frost to fall.",
      "start_char": 5434,
      "end_char": 6364,
      "start_sentence": 347,
      "end_sentence": 410,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.955318212509155,
      "metadata": {
        "source_file": "dao\\藏外\\坐忘论.txt",
        "category": "藏外"
      }
    }
  ]
}