{
  "source_id": "大丹铅汞论",
  "source_file": "chunked_daozang\\大丹铅汞论.json",
  "total_chunks": 4,
  "total_original_chars": 3264,
  "total_translated_chars": 18242,
  "total_translation_time": 92.97504043579102,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\大丹铅汞论.txt",
    "category": "众术类"
  },
  "full_translation": "**The Discourse on the Great Elixir of Lead and Mercury**\n\n**Title:** *The Discourse on the Great Elixir of Lead and Mercury*. Composed by Jin Fupo of the Tang dynasty. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Zhongshu* category.\n\n**Chapter One**\nThe art of the Great Elixir arises from lead and mercury. These two substances are the foundation of the Great Elixir. Observe their mutual transformation and activation, their exquisite interplay of restraint and subjugation—all emerge from the natural workings of Heaven and Earth, unattainable by human effort alone.\n\nLead pertains to yin, black in color, and corresponds to the Dark Warrior (Xuanwu). Its trigram is *Kan* (☵), residing in the north, governed by the *ren* and *gui* waters, for water generates metal. Within water lies metal, white in hue, corresponding to the White Tiger (Baihu). Its trigram is *Dui* (☱), associated with the west and the *geng* and *xin* metals.\n\nMercury pertains to yang, green in color, and corresponds to the Azure Dragon (Qinglong). Its trigram is *Zhen* (☳), residing in the east, governed by the *jia* and *yi* woods, for wood generates fire. Thus, within cinnabar lies mercury, red in color, corresponding to the Vermilion Bird (Zhuque). Its trigram is *Li* (☲), associated with the south and the *bing* and *ding* fires.\n\nFrom this, we deduce: *Kan* is water, the moon, and lead; *Li* is fire, the sun, and mercury. There must not be the slightest deviation.\n\nI often faltered midway, abandoning the path, until I consulted another adept, who declared: \"Heaven is born from *Kan*; Earth is born from *Li*.\" *Kan* pertains to water, the moon, and lead; *Li* pertains to fire, the sun, and mercury. When *Kan* and *Li* interact, when the sun and moon conjoin, when lead and mercury engage, when the tiger and dragon reverse their courses—only then do they achieve completion.\n\nThus, I first employed water-lead to refine fire-mercury, then transformed fire-mercury into true lead. With true lead, I subdued the mercury spirit, producing true mercury. Through external alchemy, I attained the fullness of creation’s workings. Only then did I comprehend the inverted art of the Five Phases: the dragon emerges from within fire, and the Five Phases do not follow their usual sequence—the tiger is born from within water. The words of the elixir classics are not spoken in vain.\n\nAh! By refining mercury with lead, one obtains the treasure within mercury; when mercury is subdued by lead, one gains the metal within water, and lead is revealed. Refining mercury with lead, refining the elixir with mercury—whether called lead or mercury, neither is used exclusively. Whether termed mercury or lead, neither is employed singularly. When lead and mercury restrain one another, when the Yellow Dame (Huangpo) facilitates their union, how distant can the external elixir be?\n\n**Chapter Two: Extracting True Lead and True Mercury**\nTake eight ounces of refined lead and four ounces of mountain silver, melt them together, and collect the flowers to obtain eight ounces, called \"lead yellow flowers.\" Grind eight ounces of cinnabar finely, place them in the divine crucible, and subject them to three cycles of water and fire. Naturally, true death occurs, forming the foundation of the Great Elixir—a mercury-free treasure of boundless value.\n\n**Chapter Three: The Method of Conjunction**\nExtract the flowers from black lead in the mountains, known as \"lead yellow flowers,\" the White Tiger, which the elixir classics call \"metal within water.\" Extract mercury from cinnabar through water and fire, known as \"jade liquid,\" residing in the Azure Dragon, which the elixir classics call \"mercury within cinnabar.\"\n\nCombine the metal within water and the mercury within cinnabar, each weighing eight ounces, to embody the marvel of Qian and Kun. Harmonize and pair them, sealing them together in the divine crucible. Bury it in the divine furnace, balance water and fire, and apply the techniques of withdrawal and addition. Lead descends when united with mercury; mercury is subdued when united with lead—thus forming the Great Elixir of Dragon and Tiger.\n\nReturn it to the earthen cauldron, nurture the cinnabar, and augment it endlessly. In three sevens and four sixes, black, white, snow, and yellow sprouts all emerge from within lead and mercury.\n\nMaster Zhang said: \"Without recognizing the true lead as the primal ancestor, all efforts are in vain.\" Master Zhongli declared: \"Embracing the blackness of the Great One, cinnabar stands foremost among the eight stones. Within cinnabar lies mercury, mercury being the child of cinnabar. Embracing the brilliance of the Great One, lead stands foremost among the five metals. Within lead lies silver, silver being the child of lead. The silver within lead is difficult to extract; the mercury within cinnabar is easy to obtain. When lead and mercury unite and are refined, they become the supreme treasure. This is the wondrous secret of the immortals—those who attain it must not neglect it.\"\n\n**Chapter Four**\n\n**Chapter Five**\nThe Three Lineages Converge in the Primordial Palace: Mother Cinnabar, Spirit Cinnabar, and Vermilion Cinnabar are called the Three Lineages. Encase Spirit Cinnabar within Mother Cinnabar, then place it into the Lead-Yellow Great One’s Chamber to nurture until death. Next, encase Vermilion Cinnabar within Spirit Cinnabar, and again wrap Spirit Cinnabar with Mother Cinnabar, placing it into the Lead-Yellow Great One’s Chamber for seven days. With Mother present, Spirit present, and Vermilion present—this is called the Three Presences—blending into one is called the Four Images. This is the immortals’ secret method, the world’s supreme treasure.\n\n**Chapter Six**\nThe Three Lineages Converge Again: Encase Vermilion Cinnabar within Raw Spirit Cinnabar, then wrap it externally with Mother Cinnabar. Place it into the Four Images’ Chamber for seven days, causing the Three Lineages to die again. Grind them finely, and their augmentation becomes boundless.\n\n**Chapter Seven**\nWhite Snow Transforms and Lives: Take four ounces of powdery frost, place raw male mercury close to the body, and set it into the Great Chamber’s base. After seven days, the powder truly dies, becoming snow-white and lovely. This powder possesses great efficacy; when used to dry mercury for transmutation, there is nothing it cannot accomplish.\n\n**Chapter Eight**\nWhite Snow Transforms into Yellow Powder: Take the dried true treasure of White Snow, crush it into white flakes, and refine it with fire above and water below—both in harmony and disharmony. Its color changes to yellow powder. When exposed to fire, it melts into liquid; when poured out, it forms a paste. Its taste is sweet, and it possesses the power to restore yang and revive the dead, a wondrous achievement in tempering and refinement.\n\n**Chapter Nine**\nLead-Yellow Transforms into the Great Treasure: Take one jin of pure lead and half a jin of silver, melt them together into liquid, then add half a jin of *xin*. After a long while, remove and place it in a cold pot, then shatter it. This *xin* is one lump; separate the embryo to remove the lead and silver, then grind the *xin* into powder. Mix it evenly with cinnabar, place it into the fire crucible, and refine until death. The *xin* remains on top, cinnabar at the bottom. This cinnabar is the foundation of the great elixir; it must be decocted until half is lost, after which the medicine becomes potent and may serve as a covering.\n\n**Chapter Ten**\nRefining and Nurturing the Great Elixir of Lead and Mercury: Take eight ounces of the supreme treasure from the lead mine, shaped like woven threads—this is the Old Man’s Beard. Crush it into flakes, store it with cinnabar, and add eight ounces of mercury. Refine and nurture it for forty-nine cycles, and it will naturally transform into elixir powder. Once the furnace yields the elixir, it no longer reverts to treasure. This may serve as the Great Chamber to nurture cinnabar.\n\n**Transforming and Refining the Four Spirits into the Great Elixir**\n\n**First Secret:** Employ the immortals’ three elixir wondrous method. Take sixteen ounces of the mountain-marsh supreme treasure and twelve ounces of the mountain-marsh primordial Great One. Melt them together in a sweet crucible, using half a jin of lead-yellow powder as a base. Gradually add five ounces of cinnabar into it, refining until death and grinding into powder. Form five ounces of Spirit Cinnabar into a lump, then coat it with five ounces of dead cinnabar. Externally, wrap it tightly with one jin of four-six Mother Cinnabar, then refine it with lead-white frost until death. For all external wrappings, seal them firmly in an oil jar. After seven days of nurturing and one firing, open it when cold. Grind the cinnabar, Spirit Cinnabar, and Mother Cinnabar into powder to form the Great Chamber. This is the first secret.\n\n**Second Secret:** Decoct mountain-marsh lead and silver to obtain half a jin of yellow blossom. First, wrap Vermilion Cinnabar piece by piece with one jin of Mother Cinnabar, nurturing until death, then peel away the Mother Cinnabar. Next, wrap equal parts of Vermilion Cinnabar and Spirit Cinnabar together, gradually nurturing them to death within the yellow blossom chamber’s base. Remove and grind them into one mass to form the Great Chamber. This is the second secret.\n\n**Third Secret:** Using half a jin of yellow blossom as before, gradually nurture four ounces of Spirit Cinnabar within it until death. Then, mix equal parts of dead Spirit Cinnabar and cinnabar into powder and refine them into lumps. Externally, wrap them with a piece of four-six Mother Cinnabar, nurture them in the yellow blossom chamber until truly dead, and blend them with Mother Cinnabar to form the Great Chamber. This is the third secret.\n\nThese three secrets are the great cavernous true methods. All use common lead to kill mercury into true lead, and true lead to kill cinnabar into true mercury. When lead and mercury are combined and refined, they nurture the infant—spirit within spirit, sage within sage.\n\n**Nurturing the Infant**\nThough the infant and the maiden share the same source, their forms are indeed different.\n\nThe Maiden is yet to coalesce into embryo, while the Infant has already taken refined form. Once the Infant is born, it possesses divine and sagely powers, the ability to penetrate and transform, operating without constraint, its changes unfathomable. In heaven, it is white snow; in the world, a leaden vessel; in man, powdery frost. Immortals liken it to the Maiden—nothing more than mercury. Yet it is born from the womb of cinnabar, the essence of mercury, the darkness of cinnabar. Stir it, and it does not cloud; let it settle, and it does not clear. Though lodged high in the mountains, splitting stone cannot reveal its form. Gentle and luminous, chaff cannot sully its nature. This is the elixir of longevity, the treasure of transmutation, the world’s supreme jewel, beyond compare.\n\nYet the impure masses, blind to the root of creation, never having encountered the immortals’ secrets, dare to seek the perfection of this supreme treasure of dry mercury for their own use, to indulge their selfish desires—how utterly deluded. If one wishes to obtain the method, one must first seek a teacher. To acquire the formula, one must first cultivate conduct. Observe the movement and stillness of yin and yang, verify the cycles of heaven and earth, discern medicinal materials, inquire into the methods of water and fire, cross-reference and examine, peruse the alchemical classics, and seek out enlightened masters. Only then can one align with the tracks of heaven and earth, share the same mechanism as the inner elixir—how could this not be kept secret? To reveal it to the unworthy is to invite retribution upon seven generations.\n\n**Refining Powdery Frost into the Great Elixir**\nTake four ounces of powdery frost, mix with one ounce of silver powder, and grind evenly. Place in an oil jar, press the previous Three Cavern Elixir powder on top, then seal with yellow earth powder, ensuring a firm closure. Refine with four ounces of fire for five days and nights. Next, remove the powdery frost, grind it finely, and roll it into a thin silver tube. Insert the powder inside, seal tightly, and nurture it within the Three Cavern Elixir head for twenty-one days. This powder possesses great efficacy and serves as the method for transmuting the Great Elixir.\n\n**The Mahāyāna of the Outer Elixir: Benefiting Others, Nourishing the Body, and Cultivating the Dao**\nI have heard extraordinary individuals say: Heaven steals from earth, earth steals from man, man steals from the myriad things—the Dao of mutual theft among the Three Powers. The defense of the outer elixir arises from this principle. The outer elixir takes lead as its ancestor, silver as its mother, and mercury as its consort. Lead steals heaven’s darkness, silver steals lead’s darkness, mercury steals silver’s darkness—each pilfering from the other, yet the principle remains one.\n\nThe outer elixir, in its transformations, generates without end. Without grasping this principle of mutual theft and harmonious exchange among the Three Powers, how could one comprehend the wonders of the outer elixir’s mutual generation, nurturance, consumption, and union? Moreover, the defense of the outer elixir differs not in the slightest from the creative workings of heaven and earth. The Great Elixir takes lead as its ancestor, silver as its mother, and mercury as its consort. Using lead with silver draws forth the primordial unity of darkness. Discarding lead to use silver, and nurturing mercury with silver, evokes the darkness of the postnatal silver mother. Once mercury is killed into lead, it is called true lead. From this, we know that mercury’s theft of silver is the child’s theft of its mother—does this not resonate with the mutual theft of heaven and earth, and earth’s theft of man, giving rise to their interconnected theories?\n\nOnce true lead is dead, what then is the so-called true mercury? Little does one realize that mercury arises from the darkness of the postnatal. Unrefined, it is called true mercury. Grind true lead into fine powder, blend it with true mercury, then seek cinnabar to nurture them. When lead and mercury unite, yin and yang pair, refining and nurturing each other—only then can it be called the medicine of truly dead lead and mercury. Once mercury is dead, the mother’s darkness scatters and dissipates—this goes without saying.\n\nAt this stage, one must understand the wondrous union of form and spirit, aligning with the Dao in truth, to mirror the creative workings of heaven and earth, differing in manifestation yet sharing the same source. Thus, silver is the mother of mercury. Form is the abode of spirit. When spirit returns to its abode, form and spirit unite as one. Lead merges with mercury, mercury dies into lead. Silver and lead combine, child and mother meet, inseparable and unobstructed—this is the harmonious union of the Four Symbols, fulfilling the great function of the outer elixir.\n\nYet the Four Symbols and Five Phases cannot lack even one. What is this one? Earth. And what is earth? It is sulphur, the Yellow Dame, the Yellow Sprout. The alchemical classics state: *\"Though the Yellow Dame serves as matchmaker.\"* They also say: *\"Return lead to the Yellow Sprout.\"* And: *\"Mercury is true mercury.\"* Further: *\"In the ash pool, with scorching flames, lead and mercury become silver. Pure white, the treasure appears—gold can be made.\"* If two ounces of truly dead lead and mercury are smelted to produce sacred silver, this is precisely what the alchemical classics call *\"returning mercury to the Yellow Sprout.\"* Following the previous method to nurture and extract cinnabar is precisely *\"returning mercury to true mercury.\"* The marvel of this reversal is not to be disclosed to the uninitiated.\n\nYet why do Daoists say, *\"Following the sequence, one becomes human; reversing it, one attains the Dao\"*? Nurturing cinnabar with silver depletes the silver—its preservation lies in close contact. Nurturing cinnabar with cinnabar leads to loss; pouring cinnabar over mercury revives the cinnabar. Even after a thousand years, no success is achieved. For solitary yin cannot generate on its own, nor can solitary yang achieve completion. In the world, using silver depletes it—fortunately, mercury enhances it. Using cinnabar causes it to dissipate—fortunately, sulphur stabilizes it. With no loss of silver and no flight of mercury’s essence, nurturing mercury with silver allows for rebirth and possession of the body, returning to the origin. Refining the Yellow Dame anew as the matchmaker—how could this fail to yield success?\n\nThe ancients wisely said: *\"Without cinnabar and sulphur, mercury does not dry; lead, without cinnabar, sulphur, and mercury, does not endure.\"* Is this not precisely the case?\n\nFor lead and mercury are the essence of the sun and moon, emerging from heaven to illuminate the four directions. The radiance of the sun and moon, alighting upon mountains and marshes, gives rise to the five metals, produces the eight minerals, and forms pearls and jade. What is this radiance? It is the manifestation of spirit and essence. What is the elixir? It is the true essence of lead and mercury, transformed through resonance into the returning elixir. When the elixir endures, it radiates; when it radiates, it shines—thus gold and silver are born, and all treasures emerge. The terms \"drying mercury\" and \"transmutation\" all derive from this elixir. All the world’s methods of refining cinnabar through steam and drips originate from this elixir’s generation.\n\nYet while the arts of gold and silver are but secondary pursuits of the immortals, one who can ingest and refine it, focusing the mind within the inner court and ascending further, will establish this heart in the realm of untroubled longevity, attaining the land of life-prolonging medicine. This is why I earnestly hold fast to it for the sake of fellow practitioners of the Dao.\n\n*On the Great Elixir of Lead and Mercury* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大丹铅汞论 经名：大丹锯汞论。 唐金付坡撰。 一卷。 底本出处：《正统道藏》洞神部众街类。 大丹铅汞论 第一 夫大丹之术，出乎铅汞。 而铅汞之药，乃大丹之基。 观其互换感发之‘机，交相制伏之妙，皆出乎天地自然，非人力所能致也。 且铅属阴，黑色，而为玄武，其卦为坎，位属北方壬癸之水，水能生金。 水中有金，其色白，而为白虎，其卦为兑，西方庚辛金也。 汞属阳，色青，而为青龙，其卦为震位，禀东方甲乙之木。 木能生火，故砂中有汞，其色赤，而为朱雀，其卦为离，南方丙丁火也。 以是论之，则坎为水，为月，为铅。 离为火，为日，为汞。 当无一毫之差，可也。 仆每至半途而悔，中道而废，复参异人乃日：天生於坎，地生於离。 坎属水，为月、，为铅。 离属火，为日，为汞。 坎离互用，日月相交，铅汞相持，虎龙相返，然后相成。 仆遂先以水铅而制离汞，后以离汞为真铅，复以真铅制汞魂，而为真汞，然贻外丹，得造化之大全。 由是始悟五行颠倒术，龙从火裹出。 五行不顺行，虎向水中生。 丹经言不妄发。 吁，以铅制汞，得汞中之宝，而汞伏於铅，得水中之金，而铅始见。 以铅制汞。 以汞制丹，日铅曰汞，不偏其用。 日汞日铅，不专其用。 铅汞制伏，黄婆会遇，外丹夫何远之有。 第二 采取真铅真汞：以挣铅八两，取山泽银四两，投入铅内，镕抡取花，得八两，谓之铅黄花。 朱砂八两，同研细，入神鼎，水火打经三转，自然真死，为大丹之基，汞脱无穷之宝。 第三 结法：黑铅取花於山泽，名日铅黄花，白虎，丹经为水中金是也。 朱砂取汞於水火，名日玉液，位居青龙，丹经为砂中汞是也。 石水中，金砂中，汞合为一处，各用八两，以体乾坤之妙，和合匹配，同归神鼎，封固牢密，埋入神炉，水火既济，运用抽添，铅得汞而降，汞得铅而伏，乃为龙虎大丹。 再归土釜，脱养辰砂，增添无极，三七四六，感黑白雪黄芽，皆自铅汞中产。 张真人日：不识真铅正祖宗，万般作用枉施功。 钟离先生日：抱太一之黑，为八石之首者，朱砂也。 砂中有汞，汞乃砂之子也。 抱太一之熙，为五金之首者，铅也。 铅中有银，银乃铅之子也。 难取者铅中银，易取者砂中汞。 铅汞相合，缎炼成至宝。 此神仙简秘之妙，得此者无忽焉。 第四",
      "translated_text": "**The Discourse on the Great Elixir of Lead and Mercury**\n\n**Title:** *The Discourse on the Great Elixir of Lead and Mercury*. Composed by Jin Fupo of the Tang dynasty. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Zhongshu* category.\n\n**Chapter One**\nThe art of the Great Elixir arises from lead and mercury. These two substances are the foundation of the Great Elixir. Observe their mutual transformation and activation, their exquisite interplay of restraint and subjugation—all emerge from the natural workings of Heaven and Earth, unattainable by human effort alone.\n\nLead pertains to yin, black in color, and corresponds to the Dark Warrior (Xuanwu). Its trigram is *Kan* (☵), residing in the north, governed by the *ren* and *gui* waters, for water generates metal. Within water lies metal, white in hue, corresponding to the White Tiger (Baihu). Its trigram is *Dui* (☱), associated with the west and the *geng* and *xin* metals.\n\nMercury pertains to yang, green in color, and corresponds to the Azure Dragon (Qinglong). Its trigram is *Zhen* (☳), residing in the east, governed by the *jia* and *yi* woods, for wood generates fire. Thus, within cinnabar lies mercury, red in color, corresponding to the Vermilion Bird (Zhuque). Its trigram is *Li* (☲), associated with the south and the *bing* and *ding* fires.\n\nFrom this, we deduce: *Kan* is water, the moon, and lead; *Li* is fire, the sun, and mercury. There must not be the slightest deviation.\n\nI often faltered midway, abandoning the path, until I consulted another adept, who declared: \"Heaven is born from *Kan*; Earth is born from *Li*.\" *Kan* pertains to water, the moon, and lead; *Li* pertains to fire, the sun, and mercury. When *Kan* and *Li* interact, when the sun and moon conjoin, when lead and mercury engage, when the tiger and dragon reverse their courses—only then do they achieve completion.\n\nThus, I first employed water-lead to refine fire-mercury, then transformed fire-mercury into true lead. With true lead, I subdued the mercury spirit, producing true mercury. Through external alchemy, I attained the fullness of creation’s workings. Only then did I comprehend the inverted art of the Five Phases: the dragon emerges from within fire, and the Five Phases do not follow their usual sequence—the tiger is born from within water. The words of the elixir classics are not spoken in vain.\n\nAh! By refining mercury with lead, one obtains the treasure within mercury; when mercury is subdued by lead, one gains the metal within water, and lead is revealed. Refining mercury with lead, refining the elixir with mercury—whether called lead or mercury, neither is used exclusively. Whether termed mercury or lead, neither is employed singularly. When lead and mercury restrain one another, when the Yellow Dame (Huangpo) facilitates their union, how distant can the external elixir be?\n\n**Chapter Two: Extracting True Lead and True Mercury**\nTake eight ounces of refined lead and four ounces of mountain silver, melt them together, and collect the flowers to obtain eight ounces, called \"lead yellow flowers.\" Grind eight ounces of cinnabar finely, place them in the divine crucible, and subject them to three cycles of water and fire. Naturally, true death occurs, forming the foundation of the Great Elixir—a mercury-free treasure of boundless value.\n\n**Chapter Three: The Method of Conjunction**\nExtract the flowers from black lead in the mountains, known as \"lead yellow flowers,\" the White Tiger, which the elixir classics call \"metal within water.\" Extract mercury from cinnabar through water and fire, known as \"jade liquid,\" residing in the Azure Dragon, which the elixir classics call \"mercury within cinnabar.\"\n\nCombine the metal within water and the mercury within cinnabar, each weighing eight ounces, to embody the marvel of Qian and Kun. Harmonize and pair them, sealing them together in the divine crucible. Bury it in the divine furnace, balance water and fire, and apply the techniques of withdrawal and addition. Lead descends when united with mercury; mercury is subdued when united with lead—thus forming the Great Elixir of Dragon and Tiger.\n\nReturn it to the earthen cauldron, nurture the cinnabar, and augment it endlessly. In three sevens and four sixes, black, white, snow, and yellow sprouts all emerge from within lead and mercury.\n\nMaster Zhang said: \"Without recognizing the true lead as the primal ancestor, all efforts are in vain.\" Master Zhongli declared: \"Embracing the blackness of the Great One, cinnabar stands foremost among the eight stones. Within cinnabar lies mercury, mercury being the child of cinnabar. Embracing the brilliance of the Great One, lead stands foremost among the five metals. Within lead lies silver, silver being the child of lead. The silver within lead is difficult to extract; the mercury within cinnabar is easy to obtain. When lead and mercury unite and are refined, they become the supreme treasure. This is the wondrous secret of the immortals—those who attain it must not neglect it.\"\n\n**Chapter Four**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 890,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.591822624206543,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大丹铅汞论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "三姓会於元宫：母砂、灵砂、朱砂、谓之三姓。 用母砂包灵砂，入铅黄太乙匮养死。 次以灵砂包朱砂，又以母砂包灵砂，入铅黄太乙匮内，养七日。 母在灵在朱在，谓之三在，混而为一，谓之四象。 乃神仙之秘法，为世上之至珍。 第五 三姓再会：生灵砂包朱砂，用母砂包在外，入四象匮内，养七日，三姓再死，研细，增添无有纪极。 第六 白雪化生：粉霜四两，生雄贴身，入大匮末内，养七日，其粉真死，雪白可爱。 此粉有大功，乾汞点化，无施不可。 第七 白雪变黄粉：白雪取乾真宝，碎为白屑，上火下水，既济未济炼养，色变如黄粉，见火成汁，倾出成膏，其味甜，有回阳起死之功，糁制成功之妙。 第八 铅黄信转为大宝：用净铅一、一斤，银半斤，合镕成汁，入信半斤，投之良久，取出坐锅放玲，打碎。 此信一陀，分胎去铅银，以信为末，与朱对勾，入火鼎内，打死。 信在上，朱在底。 此朱有大药之基，须是煎去折半，其药方灵，可为盖头。 第九 炼养铅汞大丹：铅坑至宝形如布线者八两，乃老翁须是也。 搅为碎屑，以砂合贮之，入汞八两，炼养四十九伏，自然化为丹粉。 灶之成丹，不复成宝。 此可为大匮，养辰砂。 转制四神为大丹 一秘：用神仙三丹妙诀，山泽至宝一十六两，山泽先天太乙一十二两，同入甘锅煎，铅黄半斤为末作置，将朱五两逐旋於中，脱死为末。 灵砂五两作一陀，以死朱五两贴了，外用四六母砂一斤，包令固密，再以铅白霜死。 大凡包裹外墙，筑入油缸固济了。 毕用养七日，一缎，寒取出，其朱，灵母砂，杵为末，作大匮。 此为一秘也。 二秘：山泽铅银煎取黄花半斤，先将母砂一斤，逐块包裹朱砂，逐渐养死，剥去母砂。 次以朱砂灵砂对停包曩，逐渐於黄花匮末内养死，取出捣为一处，以成大匮。 此二秘也。 三秘：依前黄花半斤，将灵砂四两，逐渐於内养死。 却将死灵砂与朱对停为末，煅作州陀。 外以四六母砂一片包袅，黄花匮内养令真死，与母混而为一，以作大匮。 此谓之三秘也。 夫是三秘，乃大洞真诀，皆以凡铅死汞为真铅，以真铅死朱为真汞，铅汞一处，合炼养婴儿，灵中之灵，圣中之圣也。 脱养婴儿 夫婴儿妮女，虽同其源，实易其体。",
      "translated_text": "**Chapter Five**\nThe Three Lineages Converge in the Primordial Palace: Mother Cinnabar, Spirit Cinnabar, and Vermilion Cinnabar are called the Three Lineages. Encase Spirit Cinnabar within Mother Cinnabar, then place it into the Lead-Yellow Great One’s Chamber to nurture until death. Next, encase Vermilion Cinnabar within Spirit Cinnabar, and again wrap Spirit Cinnabar with Mother Cinnabar, placing it into the Lead-Yellow Great One’s Chamber for seven days. With Mother present, Spirit present, and Vermilion present—this is called the Three Presences—blending into one is called the Four Images. This is the immortals’ secret method, the world’s supreme treasure.\n\n**Chapter Six**\nThe Three Lineages Converge Again: Encase Vermilion Cinnabar within Raw Spirit Cinnabar, then wrap it externally with Mother Cinnabar. Place it into the Four Images’ Chamber for seven days, causing the Three Lineages to die again. Grind them finely, and their augmentation becomes boundless.\n\n**Chapter Seven**\nWhite Snow Transforms and Lives: Take four ounces of powdery frost, place raw male mercury close to the body, and set it into the Great Chamber’s base. After seven days, the powder truly dies, becoming snow-white and lovely. This powder possesses great efficacy; when used to dry mercury for transmutation, there is nothing it cannot accomplish.\n\n**Chapter Eight**\nWhite Snow Transforms into Yellow Powder: Take the dried true treasure of White Snow, crush it into white flakes, and refine it with fire above and water below—both in harmony and disharmony. Its color changes to yellow powder. When exposed to fire, it melts into liquid; when poured out, it forms a paste. Its taste is sweet, and it possesses the power to restore yang and revive the dead, a wondrous achievement in tempering and refinement.\n\n**Chapter Nine**\nLead-Yellow Transforms into the Great Treasure: Take one jin of pure lead and half a jin of silver, melt them together into liquid, then add half a jin of *xin*. After a long while, remove and place it in a cold pot, then shatter it. This *xin* is one lump; separate the embryo to remove the lead and silver, then grind the *xin* into powder. Mix it evenly with cinnabar, place it into the fire crucible, and refine until death. The *xin* remains on top, cinnabar at the bottom. This cinnabar is the foundation of the great elixir; it must be decocted until half is lost, after which the medicine becomes potent and may serve as a covering.\n\n**Chapter Ten**\nRefining and Nurturing the Great Elixir of Lead and Mercury: Take eight ounces of the supreme treasure from the lead mine, shaped like woven threads—this is the Old Man’s Beard. Crush it into flakes, store it with cinnabar, and add eight ounces of mercury. Refine and nurture it for forty-nine cycles, and it will naturally transform into elixir powder. Once the furnace yields the elixir, it no longer reverts to treasure. This may serve as the Great Chamber to nurture cinnabar.\n\n**Transforming and Refining the Four Spirits into the Great Elixir**\n\n**First Secret:** Employ the immortals’ three elixir wondrous method. Take sixteen ounces of the mountain-marsh supreme treasure and twelve ounces of the mountain-marsh primordial Great One. Melt them together in a sweet crucible, using half a jin of lead-yellow powder as a base. Gradually add five ounces of cinnabar into it, refining until death and grinding into powder. Form five ounces of Spirit Cinnabar into a lump, then coat it with five ounces of dead cinnabar. Externally, wrap it tightly with one jin of four-six Mother Cinnabar, then refine it with lead-white frost until death. For all external wrappings, seal them firmly in an oil jar. After seven days of nurturing and one firing, open it when cold. Grind the cinnabar, Spirit Cinnabar, and Mother Cinnabar into powder to form the Great Chamber. This is the first secret.\n\n**Second Secret:** Decoct mountain-marsh lead and silver to obtain half a jin of yellow blossom. First, wrap Vermilion Cinnabar piece by piece with one jin of Mother Cinnabar, nurturing until death, then peel away the Mother Cinnabar. Next, wrap equal parts of Vermilion Cinnabar and Spirit Cinnabar together, gradually nurturing them to death within the yellow blossom chamber’s base. Remove and grind them into one mass to form the Great Chamber. This is the second secret.\n\n**Third Secret:** Using half a jin of yellow blossom as before, gradually nurture four ounces of Spirit Cinnabar within it until death. Then, mix equal parts of dead Spirit Cinnabar and cinnabar into powder and refine them into lumps. Externally, wrap them with a piece of four-six Mother Cinnabar, nurture them in the yellow blossom chamber until truly dead, and blend them with Mother Cinnabar to form the Great Chamber. This is the third secret.\n\nThese three secrets are the great cavernous true methods. All use common lead to kill mercury into true lead, and true lead to kill cinnabar into true mercury. When lead and mercury are combined and refined, they nurture the infant—spirit within spirit, sage within sage.\n\n**Nurturing the Infant**\nThough the infant and the maiden share the same source, their forms are indeed different.",
      "overlap_context": "ht stones. Within cinnabar lies mercury, mercury being the child of cinnabar. Embracing the brilliance of the Great One, lead stands foremost among the five metals. Within lead lies silver, silver being the child of lead. The silver within lead is difficult to extract; the mercury within cinnabar is easy to obtain. When lead and mercury unite and are refined, they become the supreme treasure. This is the wondrous secret of the immortals—those who attain it must not neglect it.\"\n\n**Chapter Four**",
      "start_char": 890,
      "end_char": 1775,
      "start_sentence": 47,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.086973428726196,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大丹铅汞论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "诧女者，未结胎。 婴儿者，已结秀。 婴兄既产，能神能圣，能通能变，运用无方，变化莫测。 在天为白雪，在世为铅壶，在人则为粉霜，神仙比之为妮女，不过、一水银尔。 以其产朱砂之腹，为汞之精，、砂之黑，搅之不浊，澄之不清，竟在高山，裂石不能得其形，柔和明净，糠枇不能污其质。 此为长生之药，点化之珍，世之至宝，无可比伦。 凡夫浊质，不明造化之根，不遇神仙之诀，乃欲其成乾汞至宝，以归一身之所用，以纵一己之私欲，何其不自揣量。 然人欲求其诀，当先寻师。 欲得其方，先修其行。 察阴阳之动静，验天地之循环，明辩药材，扣求水火法，参稽互考，褊阅丹经，寻访明师，直与天地同其轨辙，与内丹同其关键，可不秘乎。 泄之非人，罪及七祖矣。 脱养粉箱成大药 粉霜四两，入银末一两，同研匀，入油缸内，上以前三洞药丹末捺头，用黄土末作盖，封固坚牢，用火四两，缎养五日五夜。 次取出粉霜，再研细，银薄卷作筒子，入粉在内，卷暑令紧，入三洞丹头中，养之三七日。 此粉有大功，可作大丹转糁之法。 外丹大乘济物利人肥身养道 尝闻异人日：天盗地，地盗人，人盗万物，三才相盗之道，外丹之卫，莫不由是乎。 外丹以铅为祖，以银为母，以汞为妇。 铅盗天之黑，银盗铅之黑，汞盗银之黑，互相盗窃，其理一也。 其外丹欲以变化一，生生而不穷，非得此三才相吞柑盗交和之理，其何以知外丹相生相养相吞相合之妙也。 且夫外丹之卫，与天地造化，初无少异。 大丹以铅为祖，以银为母，以汞为妇，以铅用银，是感先天一元之黑也。 去铅用银，以银养汞，是感后天银母之黑也。 汞既以死为铅，故谓之真铅。 由是以知汞之盗银，子之盗母，其理与天之盗地，地之盗人，而有感异之说乎。 真铅既死，得所谓之真汞，又果何物耶。 殊不知汞者，即感后天之黑而生也。 未经缎炼，故谓之真汞。 能将真铅杵为细末，又将真汞混而为一，复求朱砂而养之，则铅汞相合，阴阳配匹，互相炼养，而可谓之铅汞真死之药耶。 汞既已死，母黑散耗，不言可知。 至此须明其形神俱妙，与道合真之理，方与天地造化，异事而同其源。 是故银者，汞之母。 形者，神之舍。 神归乎舍，形神合一。 铅交其汞，汞死为铅。 银与铅合，子与母会，不相分离，不相问隔，所谓和合四象，得外丹大全之用矣。 且四象五行，不可缺于一。 此一者何也，土也。 土者何也，硫黄是也，黄婆也，黄芽也。 丹经日：虽用黄婆作媒礼。 又日：反铅为黄芽也。 又水银为真汞。 又日：灰池炎灼，铅汞成银。 洁白见宝，可造黄金。 若是真死铅汞二两，煎出圣银，正丹经所谓反汞为黄芽。 依前脱养出朱砂，正所谓反水银为真汞。 反还之妙，不容於不知。 然则道家何以日顺则成人，逆则成道。 以银养朱则银折，全在乎贴身。 以砂养砂则耗折，以砂浇汞则砂活。 虽千百载，亦无成功。 谓其孤阴不能自生，孤阳不能自成。 世之用银则银折，所幸有汞，则益其银。 世之用砂则砂脱，所幸有硫，以固其汞。 银无耗散，汞精不飞，以银养汞，投胎夺舍，返本还元，再缎黄婆，以为媒礼，何谓无成功之效乎。 古贤有云：不得朱硫汞不乾，铅无朱硫汞不耐，正所谓欤。",
      "translated_text": "The Maiden is yet to coalesce into embryo, while the Infant has already taken refined form. Once the Infant is born, it possesses divine and sagely powers, the ability to penetrate and transform, operating without constraint, its changes unfathomable. In heaven, it is white snow; in the world, a leaden vessel; in man, powdery frost. Immortals liken it to the Maiden—nothing more than mercury. Yet it is born from the womb of cinnabar, the essence of mercury, the darkness of cinnabar. Stir it, and it does not cloud; let it settle, and it does not clear. Though lodged high in the mountains, splitting stone cannot reveal its form. Gentle and luminous, chaff cannot sully its nature. This is the elixir of longevity, the treasure of transmutation, the world’s supreme jewel, beyond compare.\n\nYet the impure masses, blind to the root of creation, never having encountered the immortals’ secrets, dare to seek the perfection of this supreme treasure of dry mercury for their own use, to indulge their selfish desires—how utterly deluded. If one wishes to obtain the method, one must first seek a teacher. To acquire the formula, one must first cultivate conduct. Observe the movement and stillness of yin and yang, verify the cycles of heaven and earth, discern medicinal materials, inquire into the methods of water and fire, cross-reference and examine, peruse the alchemical classics, and seek out enlightened masters. Only then can one align with the tracks of heaven and earth, share the same mechanism as the inner elixir—how could this not be kept secret? To reveal it to the unworthy is to invite retribution upon seven generations.\n\n**Refining Powdery Frost into the Great Elixir**\nTake four ounces of powdery frost, mix with one ounce of silver powder, and grind evenly. Place in an oil jar, press the previous Three Cavern Elixir powder on top, then seal with yellow earth powder, ensuring a firm closure. Refine with four ounces of fire for five days and nights. Next, remove the powdery frost, grind it finely, and roll it into a thin silver tube. Insert the powder inside, seal tightly, and nurture it within the Three Cavern Elixir head for twenty-one days. This powder possesses great efficacy and serves as the method for transmuting the Great Elixir.\n\n**The Mahāyāna of the Outer Elixir: Benefiting Others, Nourishing the Body, and Cultivating the Dao**\nI have heard extraordinary individuals say: Heaven steals from earth, earth steals from man, man steals from the myriad things—the Dao of mutual theft among the Three Powers. The defense of the outer elixir arises from this principle. The outer elixir takes lead as its ancestor, silver as its mother, and mercury as its consort. Lead steals heaven’s darkness, silver steals lead’s darkness, mercury steals silver’s darkness—each pilfering from the other, yet the principle remains one.\n\nThe outer elixir, in its transformations, generates without end. Without grasping this principle of mutual theft and harmonious exchange among the Three Powers, how could one comprehend the wonders of the outer elixir’s mutual generation, nurturance, consumption, and union? Moreover, the defense of the outer elixir differs not in the slightest from the creative workings of heaven and earth. The Great Elixir takes lead as its ancestor, silver as its mother, and mercury as its consort. Using lead with silver draws forth the primordial unity of darkness. Discarding lead to use silver, and nurturing mercury with silver, evokes the darkness of the postnatal silver mother. Once mercury is killed into lead, it is called true lead. From this, we know that mercury’s theft of silver is the child’s theft of its mother—does this not resonate with the mutual theft of heaven and earth, and earth’s theft of man, giving rise to their interconnected theories?\n\nOnce true lead is dead, what then is the so-called true mercury? Little does one realize that mercury arises from the darkness of the postnatal. Unrefined, it is called true mercury. Grind true lead into fine powder, blend it with true mercury, then seek cinnabar to nurture them. When lead and mercury unite, yin and yang pair, refining and nurturing each other—only then can it be called the medicine of truly dead lead and mercury. Once mercury is dead, the mother’s darkness scatters and dissipates—this goes without saying.\n\nAt this stage, one must understand the wondrous union of form and spirit, aligning with the Dao in truth, to mirror the creative workings of heaven and earth, differing in manifestation yet sharing the same source. Thus, silver is the mother of mercury. Form is the abode of spirit. When spirit returns to its abode, form and spirit unite as one. Lead merges with mercury, mercury dies into lead. Silver and lead combine, child and mother meet, inseparable and unobstructed—this is the harmonious union of the Four Symbols, fulfilling the great function of the outer elixir.\n\nYet the Four Symbols and Five Phases cannot lack even one. What is this one? Earth. And what is earth? It is sulphur, the Yellow Dame, the Yellow Sprout. The alchemical classics state: *\"Though the Yellow Dame serves as matchmaker.\"* They also say: *\"Return lead to the Yellow Sprout.\"* And: *\"Mercury is true mercury.\"* Further: *\"In the ash pool, with scorching flames, lead and mercury become silver. Pure white, the treasure appears—gold can be made.\"* If two ounces of truly dead lead and mercury are smelted to produce sacred silver, this is precisely what the alchemical classics call *\"returning mercury to the Yellow Sprout.\"* Following the previous method to nurture and extract cinnabar is precisely *\"returning mercury to true mercury.\"* The marvel of this reversal is not to be disclosed to the uninitiated.\n\nYet why do Daoists say, *\"Following the sequence, one becomes human; reversing it, one attains the Dao\"*? Nurturing cinnabar with silver depletes the silver—its preservation lies in close contact. Nurturing cinnabar with cinnabar leads to loss; pouring cinnabar over mercury revives the cinnabar. Even after a thousand years, no success is achieved. For solitary yin cannot generate on its own, nor can solitary yang achieve completion. In the world, using silver depletes it—fortunately, mercury enhances it. Using cinnabar causes it to dissipate—fortunately, sulphur stabilizes it. With no loss of silver and no flight of mercury’s essence, nurturing mercury with silver allows for rebirth and possession of the body, returning to the origin. Refining the Yellow Dame anew as the matchmaker—how could this fail to yield success?\n\nThe ancients wisely said: *\"Without cinnabar and sulphur, mercury does not dry; lead, without cinnabar, sulphur, and mercury, does not endure.\"* Is this not precisely the case?",
      "overlap_context": "mber until truly dead, and blend them with Mother Cinnabar to form the Great Chamber. This is the third secret.\n\nThese three secrets are the great cavernous true methods. All use common lead to kill mercury into true lead, and true lead to kill cinnabar into true mercury. When lead and mercury are combined and refined, they nurture the infant—spirit within spirit, sage within sage.\n\n**Nurturing the Infant**\nThough the infant and the maiden share the same source, their forms are indeed different.",
      "start_char": 1775,
      "end_char": 3002,
      "start_sentence": 85,
      "end_sentence": 140,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.088937282562256,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大丹铅汞论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "盖铅汞者，日月之精，出於天而光照四表。 日月之光，着乎山泽，而五金生焉，八石产焉，珠玉结焉。 光者何也，精神之发现也。 丹者何也，铅汞真精，感化而为还丹者也。 丹久而光，光而明，由是黄白生焉，众宝出焉。 曰乾汞，曰点化，皆由此丹而出。 凡世之谓感气母砂浇淋，皆自此出，此丹之生也。 虽然黄白之术，此特神仙之余事尔。 人能於服饵，克意於内庭而上之，遂使此心立於无患之寿域，臻於长生之药地，此仆之所以拳拳於同道之士也。 大丹铅汞论竟",
      "translated_text": "For lead and mercury are the essence of the sun and moon, emerging from heaven to illuminate the four directions. The radiance of the sun and moon, alighting upon mountains and marshes, gives rise to the five metals, produces the eight minerals, and forms pearls and jade. What is this radiance? It is the manifestation of spirit and essence. What is the elixir? It is the true essence of lead and mercury, transformed through resonance into the returning elixir. When the elixir endures, it radiates; when it radiates, it shines—thus gold and silver are born, and all treasures emerge. The terms \"drying mercury\" and \"transmutation\" all derive from this elixir. All the world’s methods of refining cinnabar through steam and drips originate from this elixir’s generation.\n\nYet while the arts of gold and silver are but secondary pursuits of the immortals, one who can ingest and refine it, focusing the mind within the inner court and ascending further, will establish this heart in the realm of untroubled longevity, attaining the land of life-prolonging medicine. This is why I earnestly hold fast to it for the sake of fellow practitioners of the Dao.\n\n*On the Great Elixir of Lead and Mercury* concludes.",
      "overlap_context": ". Using cinnabar causes it to dissipate—fortunately, sulphur stabilizes it. With no loss of silver and no flight of mercury’s essence, nurturing mercury with silver allows for rebirth and possession of the body, returning to the origin. Refining the Yellow Dame anew as the matchmaker—how could this fail to yield success?\n\nThe ancients wisely said: *\"Without cinnabar and sulphur, mercury does not dry; lead, without cinnabar, sulphur, and mercury, does not endure.\"* Is this not precisely the case?",
      "start_char": 3002,
      "end_char": 3211,
      "start_sentence": 141,
      "end_sentence": 150,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.20730710029602,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大丹铅汞论.txt",
        "category": "众术类"
      }
    }
  ]
}