{
  "source_id": "大惠静慈妙乐天尊说福德五圣经",
  "source_file": "chunked_daozang\\大惠静慈妙乐天尊说福德五圣经.json",
  "total_chunks": 3,
  "total_original_chars": 2463,
  "total_translated_chars": 16332,
  "total_translation_time": 83.26006317138672,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\大惠静慈妙乐天尊说福德五圣经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Most Benevolent, Serene, and Wondrously Joyous Heavenly Worthy’s Scripture of the Five Classics of Blessing and Virtue**\n\n**Scripture Title:** *The Most Benevolent, Serene, and Wondrously Joyous Heavenly Worthy’s Scripture of the Five Classics of Blessing and Virtue*\nAuthor unknown, approximately composed during the Song-Yuan period. Falsely attributed to the Heavenly Worthy instructing the Perfected One of Settled Wisdom on the methods of prostrating to the Five Manifest Spirit-Official Great Emperors, reciting incantations, and praying for blessings. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Orthodox Tradition*, Section Zhengyi, First Division.\n\n---\n\n**The Celestial Treasure Title:**\nThe Golden-Armed, Radiant Fire-Rhinoceros Great Immortal of the Thirty-Three Heavens, Transmuting the Primordial Cauldron—Supreme Commander of the King’s Hall, Pacifier of the Realm, Great General of the Rolled-Up Curtain; Roaming Envoy of the Nine Heavens; Marshal of the Six Heavens’ Officers and Soldiers; Subduer of Demons and Devils Under Heaven; Assistant for Upholding Righteousness and Dispelling Evil, Averter of Pestilence; Fire Master of the Fire Bureau; Director of the Southern Culmen Heavenly Pivot Court and the Northern Culmen Demon-Quelling Court; Calligrapher of Talismans; Seal-Mountain Breaker of Caverns, Orthodox Unity Spirit-Official, Great Marshal-in-Chief; by Imperial Decree Enfeoffed as the Five Manifest Spirit-Observing Great Emperor.\n\n**Incantation:**\nSpirit-Observing Great Emperor,\nDivinely sagacious, keen and bright.\nSunlight Bodhisattva,\nWhose qi pierces the imperial celestial court.\nGolden-inscribed sacred image,\nThree-eyed and divinely perceptive.\nRobed in yellow silk, clad in brocade,\nFeet treading the fiery wheel.\nGolden bricks, golden spears,\nPatrolling the cosmos.\nLords of sacred mountains and great rivers,\nPerfected Lords of numinous caverns.\nFire gourds, fire crows,\nWhose qi and flames wield majestic might.\nBeheading demons, extinguishing evil,\nSwift as lightning, fierce as thunder.\nPillar of the state, guardian of the people,\nNuminous spirit of protection.\nVirtue enduring for myriad eons,\nBlessings for myriad multitudes.\nAssisting the numinous, aiding compliance,\nTwo sagely generals.\nWith the wind a thousand *li*,\nA million divine soldiers.\nDelivering from calamity and distress,\nResponding like echo to sound.\nTransforming misfortune into fortune,\nLike shadow following form.\nSafeguarding this servant’s body—\nWhat prayer would go unanswered?\nDivine radiance penetrating all,\nForever dwelling in auspicious felicity.\nBy the Great Emperor’s decree,\nHasten! Hasten! As in the law’s command!\n\n---\n\n**Offering Incense and Invocation:**\nWe reverently invoke the Great Marshal of Spirit-Observation,\nThe Five Manifest Kings of Blessing and Radiant Splendor.\nIn embroidered robes and ornate caps, fierce of countenance,\nWith fire swords and golden spears, sacred power mighty.\nForemost among the righteous spirits under heaven,\nUnmatched in goodness among the Buddhas of the world.\nBeside the Jade Celestial Hall, ascending pearl curtains,\nBy the golden-colored terrace, erecting jeweled banners.\nBreaking caverns, sealing mountains, vanquishing goblins and specters,\nSummoning winds, racing lightning, destroying demonic and perverse.\nGuiding and transforming the myriad people, bestowing blessings,\nSecuring peace in the nine regions, dispelling disasters and misfortunes.\nWe offer incense and prostrate in sincere reverence,\nMay you bestow your gracious radiance upon this Daoist sanctuary.\n\n---\n\nAt that time, the Heavenly Worthy was in the Purple Radiance Hall within the Eightfold Splendor Palace, seated upon a nine-colored lotus throne, beneath a canopy of ten interwoven crane plumes. Surrounding him were the myriad celestial sages, perfected deities of heaven, celestial immortals, divine immortals, the assembled host of great immortals, golden lads and jade maidens, dharma-protecting dragon spirits, and all the attendant guards. Celestial music resounded as all listened to the Heavenly Worthy expound the wondrous Dharma of the Boundless and Utmost Real.\n\nAt that moment, among the assembly, a perfected one named Settled Wisdom stepped forth, holding a tablet and kneeling reverently. He addressed the Heavenly Worthy, saying: “May this disciple be permitted to hear of the principles of the Five Transformations?”\n\nThe Heavenly Worthy replied: “In the time of the Three Sovereigns, the people were transformed by the Dao. After the Five Emperors, the transformative power of virtue still remained. But when it came to the age of hegemonic states, daily engaged in warfare, at that time, the Dao and virtue were abandoned, benevolence and righteousness were not practiced. What they followed and were transformed by were merely wealth and food. How could my Dao transform them? Moreover, in this latter age, sentient beings take greed and attachment as their fundamental mind, and cunning and flattery as their own conduct. They rush along the path of profit, solidifying the roots of karmic deeds, brewing evil and incurring transgressions, not venerating the teachings of goodness. This causes enmity and grudges to intertwine, resentments and faults to entangle, disrupting the harmony of the Two Qi above and bringing harm to the Nine Provinces below. Some perish by the sword in mutual slaughter, some suffer from alternating droughts and floods. Famine and starvation follow one upon another, pestilence spreads contagiously. The people die prematurely, demons and ghosts roam freely. In such times, transformation must rely upon the numinous. Thereupon, the Perfected One of Settled Wisdom again addressed the Heavenly Worthy, saying: “As for the masters of numinous transformation in the world today, your disciple does not yet fully comprehend them. How may they cause those sentient beings to dwell in peace and freedom from affliction, to enjoy wealth, honor, and long life, and to be free from all disasters and difficulties?”\n\nThe Heavenly Worthy replied: “You are truly compassionate, desiring to benefit the sentient beings of the latter age, and so you inquire with such expedient means. If there are good men and good women who suffer from official calamities, illnesses, karmic lawsuits, or demonic disturbances—all manner of urgent difficulties with no means of deliverance—let them but arouse the mind of faith and devotion, pray for blessings and protection, and naturally they will enjoy prosperity and peace. The power of the sagely and divine is measureless. Pay homage to the true form of Spirit-Observation, prostrate, and recite the incantation:\n\nO Spirit of the Utmost Numinous,\nBestowing abundant blessings.\nFrom crown to sole, enveloped in grace,\nHow could it ever come to an end?”\n\nYour discerning gaze is most luminous, and thus this humble servant dares to present his devotion. Now I prostrate in homage, wholeheartedly placing my faith and reverence.\n\nWithin the Star and Moon Palace of the Thirty-Three Heavens, in the Thunder-Sound Hall, there manifests a crown of white serpents, a body of azure hue with three heads and six arms, self-possessed and free. The Great Immortal of the Fiery Rhinoceros Aura, the Divine Official of Manifest Response—transverse across the heavens, swiftly seizing the demonic forces of the Three Realms—Sealer of Mountains and Breaker of Caverns, the Dharma-Enforcing Demon-Quelling True Deity, the August Spirit-Observation Great Sage, the Five Thearchs, the Great Marshals of the Primal Origin, whose august and numinous titles are:\n\nFirst, the All-Heaven Mightily Fierce Great Marshal of the Primal Origin,\nRevealer of Wisdom, Illuminator of Sageliness, King of Trust and Vast Relief, Bestower of Blessings and Goodness.\n\nSecond, the Transverse-Heaven Marshal of the Great Department,\nRevealer of Clarity, Illuminator of Sageliness, King of Righteousness and Vast Protection, Bestower of Blessings and Harmony.\n\nThird, the Penetrating-Heaven Golden-Eyed Great Marshal,\nRevealer of Rectitude, Illuminator of Sageliness, King of Wisdom and Vast Favor, Bestower of Blessings and Response.\n\nFourth, the Flying Heaven Wind-Fire Great Marshal,\nRevealer of Integrity, Illuminator of Sageliness, King of Faith and Vast Moisture, Bestower of Blessings and Protection.\n\nFifth, the Cinnabar Heaven Demon-Quelling Great Marshal,\nRevealer of Virtue, Illuminator of Sageliness, King of Love and Vast Completion, Bestower of Blessings and Favor.\n\nThese august and numinous titles of the true form may all be received and upheld. Devout women and good men who constantly read and recite them shall accrue vast merit and boundless benefit.\n\nAll who dwell in the peace of heaven’s covering and earth’s bearing are subject to the governance of the divine. Thus, the Spirit-Observation Venerable Sage in heaven serves as the Five Marshals, and in the world as the Five Kings—fierce, valiant, and luminously efficacious, wielding authority of the utmost weight. They possess the power to bestow blessings and dispel calamities, the merit to reward good and punish evil. Though poverty and wealth differ, and success and failure vary, all matters of life and death are under their scrutiny, subject to the judgment of the August Sages. Merit and transgression are clearly manifest, not a thread amiss. Know that doing good brings down auspiciousness, while refraining from wrongdoing severs the roots of evil. When the filth of delusion is swept away, the light of wisdom shines brightly; misfortunes dissolve, and blessings and felicity all arrive.\n\nWhenever superior practitioners recite this scripture during the Three Primes, the Eight Festivals, the Five La Days, or on their birthdays, they shall externally dispel plagues and pestilence, and internally enhance their undertakings. The divine protect their households in secret, while demons and ghosts flee far from their borders. When merit is perfected and fruit is fulfilled, great good fortune is attained.\n\nThen the Heavenly Worthy spoke the Spirit-Observation Incantation:\n\nSpirit-Observation Marshals, manifesting fierce might and valor,\nPenetrating heaven and earth, hurling fire and riding the wind.\nAbove, flying cinnabar sparrows; below, galloping vermilion dragons.\nGolden light blazing, black mist swirling.\nDemons lose their courage, ghosts and specters hide their traces.\nPacifying the people and protecting the state, vanquishing evil and eliminating misfortune.\nDisasters and calamities vanish, fortune and virtue flourish.\nThe five numinous qi descend upon my body.\nAll that is sought shall be attained; all vows shall be fulfilled.\nBy the Northern Thearch’s command, swiftly establish divine merit!\nSwiftly, swiftly, as in the statutes and ordinances!\n\nThe Heavenly Worthy said: “Among the sentient beings of the world, when heavenly disasters, severe illnesses, or epidemics spread contagiously without abating—when one lies bedridden for long, untouched by medicine—or when monkey and dog spirits, fox and leopard demons alter their forms to delude mortals, falsely impersonate august deities, or falsely claim to be great sages, occupying people’s towers and pavilions, snatching souls, setting fires, hurling bricks, stealing wealth and goods—when doors open without wind, cauldrons heat without fire, and a thousand strange and bizarre phenomena disturb the people—then in a pure and clean courtyard, invite an Orthodox Unity Daoist priest to establish an altar according to the rites, transcribe and present memorials, and perform a jiao offering to the Five Heavenly Great Marshals. Burn incense, light lamps, and recite my divine incantation. After one day or five days, the Great Iron-Wheel Deity, the White Serpent General, the Faceless General, and the Fire Department’s troops and horses shall descend in unison, sweeping away demonic miasma, purifying and stabilizing the dwelling, bringing peace to the living and driving out misfortune.\n\nFurthermore, if one suffers imprisonment, bound in cangues and fetters, unable to escape—if one’s household is blocked, plans fail, slander arises, unjust lawsuits erupt, wealth dissipates, life and fortune decline, the five paths are obstructed, the three disasters strike repeatedly, and years of misfortune and hardship persist—then summon a Daoist priest to perform the rites as before. The Spirit-Observation Marshals, the Immortals of Blessing and Virtue, and the Auspicious Youths shall descend in timely fashion, guarding and protecting the people, dissolving calamities, and fulfilling all wishes.\n\nIf one travels through desolate wilds, secluded mountain forests, or fears to lodge alone, simply burn incense and recite the scripture, and malevolent forces shall disperse, bringing safety and peace.\n\nBut if there are sentient beings of stubborn and evil nature, icchantikas who lack faith, slander the true scripture, and disdain incense and offerings, the patrolling generals and terrestrial emissaries shall record their transgressions, determining the severity of their crimes. Those who commit grave offenses shall be cast into water or fire, meeting sudden and unnatural deaths. For lighter transgressions, their lifespan and fortune shall be diminished, and they shall suffer from illness and affliction.\n\nKnow that the Spirit-Observation Marshals are fiercely mighty and valiant, their retribution swift. They wield the authority over fortune and misfortune, life and death, demonstrating divine transformation. Good men and good women who encounter this scripture, reverently and respectfully receive, uphold, read, and recite it—and further, transcribe it for others, teaching them to recite it, or print and distribute the scripture to widely exhort and transform—shall delight the Spirit-Observation Marshals, who shall swiftly bestow blessings and protection. Naturally, their households shall prosper, wealth shall flourish, noble persons shall harmonize, and sagely power shall support them. All their heart’s desires shall be fulfilled.”\n\nThereupon, the Perfected One of Settled Wisdom and the assembly of immortals, having heard these words, leapt with joy, prostrated to the Spirit-Observation, and offered their prayers:\n\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay the land be preserved in peace and prosperity.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay wind and rain come in due season.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay the hundred grains ripen of themselves.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our dwellings enjoy peace and tranquility.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our fathers and mothers enjoy long life.\n\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our plans and fortunes align with our heart’s desires.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our wealth and possessions be abundant and full.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay fire and theft never encroach upon us.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our comings and goings bring profitable enterprise.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay we remain free from illness and preserve long life.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay all blessings naturally converge upon us.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay the sacred teachings of the Heavenly Perfected flourish.\n\nThe assembly of great immortals, having voiced their prayers, saw the Heavenly Worthy welcomed by a dragon-drawn chariot with banners and regalia, returning to the true realm.\n\nThereupon, the Heavenly Worthy again addressed the Perfected One of Settled Wisdom, saying: “You who have received this scripture of mine should disseminate it among the world below. Let the faithful uphold its teachings and practice accordingly, that they may beseech and partake of its blessings and protection.”\n\nThen the Perfected One of Settled Wisdom and the assembly of immortals, reverently obeying the Dao’s decree, bowed in homage and withdrew.\n\nThus concludes the *Scripture of Blessings and Virtue in Five Sections*, expounded by the Heavenly Worthy of Great Wisdom, Serene Compassion, and Wondrous Joy.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大惠静慈妙乐天尊说福德五圣经 经名：大惠静慈妙乐天尊说福德五圣经。 撰人不详，约出於宋元以徒。 假托天尊为定息真人说顶礼五显灵官大帝，诵咒祈福之法。 一卷。 底本出处：《正统道藏》 正一部。 通天宝号 运元鼎化三十三天金臂圆光火犀大仙、都统王殿治靖卷帘大将军、九天游奕远捉使、部领六天吏兵、降伏天下妖魔、辅正除邪辟瘟使、掌执火府火部使、主管南极天枢院、北极驱邪院文字、封山破洞正一灵官都大元帅、勅封五显灵观大帝。 咒曰： 灵观大帝，睿圣聪明。 日光菩萨，气射帝宸。 金刊圣像，三目圣明。 黄裳锦袍，足踏火输。 金砖金枪，按行乾坤。 名山大川，灵洞真君。 火瓢火鸦，气焰威灵。 斩妖灭邪，如电如霆。 护国砥柱，卫民灵神。 德亿万世，福亿万民。 辅灵助顺，二圣将军。 顺风千里，百万神兵。 救度灾厄，如响应声。 变祸成福，如影随形。 护佑臣身，何求不应。 神光洞照，永处吉庆。 奉大帝勑，急急如律令！ 焚香奉请 仰启灵观大元帅，福德华光五显王。 锦袍绣帽威容猛，火剑金枪圣力强。 天下正神功第一，佛中上善世无双。 玉宸殿畔登珠幌，金色台边建宝幢。 破洞封山魈魅绝，兴风走电鬼邪亡。 化导万民垂福佑，保安九域去灾殃。 焚香奉请虔诚礼，愿赐恩光降道场。 尔时天尊在八景宫中紫光殿内，坐九色莲花宝座，垂十绝鹤盖，与诸天上圣、天真大神、天仙神仙、诸大仙众、金童玉女、护法龙神，及诸侍卫等众等时同会，天乐俱鸣，咸听天尊说无极至真妙法。 是时会中有一真人，名曰定惠，越斑而出，秉简长跪，白天尊言：臣闻五化之理可得闻乎？ 天尊曰：三皇之初，民以道化，五帝之后，德化犹存。 至於霸国，日事战征，当彼之时，道德已废，仁义弗行，所从化者，财与食尔，吾道何由化之。 况乎末世，众生以贪爱为本心，以狡佞为己行，奔驰利路，坚固业根，酿恶招愆，不崇善教，致使冤仇纠结，怨咎牵连，上干二气之和，下致九州之害。 或刀兵相戮，或旱涝相仍，饥馑荐臻，瘟传染，人民夭横，魔鬼流行，当此之时，必归神化。 於是定惠真人复告天尊曰：迩者世间神化之主，臣等未悉，能知如何令彼众生安稳无恼，富贵长寿，无诸灾难？ 天尊告曰：尔甚慈悲，欲令利益末世众生，方便启问，若诸善男子善女人，或有官灾疾病冥讼精妖，一切急难无所救解者，但能起心信向，祈求福佑，自然亨泰，上圣威神之力，不可称量，皈命灵观真形，顶礼咒曰： 太灵之神，锡以繁祉。 顶踵被恩，曷有穷已。",
      "translated_text": "**The Most Benevolent, Serene, and Wondrously Joyous Heavenly Worthy’s Scripture of the Five Classics of Blessing and Virtue**\n\n**Scripture Title:** *The Most Benevolent, Serene, and Wondrously Joyous Heavenly Worthy’s Scripture of the Five Classics of Blessing and Virtue*\nAuthor unknown, approximately composed during the Song-Yuan period. Falsely attributed to the Heavenly Worthy instructing the Perfected One of Settled Wisdom on the methods of prostrating to the Five Manifest Spirit-Official Great Emperors, reciting incantations, and praying for blessings. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Orthodox Tradition*, Section Zhengyi, First Division.\n\n---\n\n**The Celestial Treasure Title:**\nThe Golden-Armed, Radiant Fire-Rhinoceros Great Immortal of the Thirty-Three Heavens, Transmuting the Primordial Cauldron—Supreme Commander of the King’s Hall, Pacifier of the Realm, Great General of the Rolled-Up Curtain; Roaming Envoy of the Nine Heavens; Marshal of the Six Heavens’ Officers and Soldiers; Subduer of Demons and Devils Under Heaven; Assistant for Upholding Righteousness and Dispelling Evil, Averter of Pestilence; Fire Master of the Fire Bureau; Director of the Southern Culmen Heavenly Pivot Court and the Northern Culmen Demon-Quelling Court; Calligrapher of Talismans; Seal-Mountain Breaker of Caverns, Orthodox Unity Spirit-Official, Great Marshal-in-Chief; by Imperial Decree Enfeoffed as the Five Manifest Spirit-Observing Great Emperor.\n\n**Incantation:**\nSpirit-Observing Great Emperor,\nDivinely sagacious, keen and bright.\nSunlight Bodhisattva,\nWhose qi pierces the imperial celestial court.\nGolden-inscribed sacred image,\nThree-eyed and divinely perceptive.\nRobed in yellow silk, clad in brocade,\nFeet treading the fiery wheel.\nGolden bricks, golden spears,\nPatrolling the cosmos.\nLords of sacred mountains and great rivers,\nPerfected Lords of numinous caverns.\nFire gourds, fire crows,\nWhose qi and flames wield majestic might.\nBeheading demons, extinguishing evil,\nSwift as lightning, fierce as thunder.\nPillar of the state, guardian of the people,\nNuminous spirit of protection.\nVirtue enduring for myriad eons,\nBlessings for myriad multitudes.\nAssisting the numinous, aiding compliance,\nTwo sagely generals.\nWith the wind a thousand *li*,\nA million divine soldiers.\nDelivering from calamity and distress,\nResponding like echo to sound.\nTransforming misfortune into fortune,\nLike shadow following form.\nSafeguarding this servant’s body—\nWhat prayer would go unanswered?\nDivine radiance penetrating all,\nForever dwelling in auspicious felicity.\nBy the Great Emperor’s decree,\nHasten! Hasten! As in the law’s command!\n\n---\n\n**Offering Incense and Invocation:**\nWe reverently invoke the Great Marshal of Spirit-Observation,\nThe Five Manifest Kings of Blessing and Radiant Splendor.\nIn embroidered robes and ornate caps, fierce of countenance,\nWith fire swords and golden spears, sacred power mighty.\nForemost among the righteous spirits under heaven,\nUnmatched in goodness among the Buddhas of the world.\nBeside the Jade Celestial Hall, ascending pearl curtains,\nBy the golden-colored terrace, erecting jeweled banners.\nBreaking caverns, sealing mountains, vanquishing goblins and specters,\nSummoning winds, racing lightning, destroying demonic and perverse.\nGuiding and transforming the myriad people, bestowing blessings,\nSecuring peace in the nine regions, dispelling disasters and misfortunes.\nWe offer incense and prostrate in sincere reverence,\nMay you bestow your gracious radiance upon this Daoist sanctuary.\n\n---\n\nAt that time, the Heavenly Worthy was in the Purple Radiance Hall within the Eightfold Splendor Palace, seated upon a nine-colored lotus throne, beneath a canopy of ten interwoven crane plumes. Surrounding him were the myriad celestial sages, perfected deities of heaven, celestial immortals, divine immortals, the assembled host of great immortals, golden lads and jade maidens, dharma-protecting dragon spirits, and all the attendant guards. Celestial music resounded as all listened to the Heavenly Worthy expound the wondrous Dharma of the Boundless and Utmost Real.\n\nAt that moment, among the assembly, a perfected one named Settled Wisdom stepped forth, holding a tablet and kneeling reverently. He addressed the Heavenly Worthy, saying: “May this disciple be permitted to hear of the principles of the Five Transformations?”\n\nThe Heavenly Worthy replied: “In the time of the Three Sovereigns, the people were transformed by the Dao. After the Five Emperors, the transformative power of virtue still remained. But when it came to the age of hegemonic states, daily engaged in warfare, at that time, the Dao and virtue were abandoned, benevolence and righteousness were not practiced. What they followed and were transformed by were merely wealth and food. How could my Dao transform them? Moreover, in this latter age, sentient beings take greed and attachment as their fundamental mind, and cunning and flattery as their own conduct. They rush along the path of profit, solidifying the roots of karmic deeds, brewing evil and incurring transgressions, not venerating the teachings of goodness. This causes enmity and grudges to intertwine, resentments and faults to entangle, disrupting the harmony of the Two Qi above and bringing harm to the Nine Provinces below. Some perish by the sword in mutual slaughter, some suffer from alternating droughts and floods. Famine and starvation follow one upon another, pestilence spreads contagiously. The people die prematurely, demons and ghosts roam freely. In such times, transformation must rely upon the numinous. Thereupon, the Perfected One of Settled Wisdom again addressed the Heavenly Worthy, saying: “As for the masters of numinous transformation in the world today, your disciple does not yet fully comprehend them. How may they cause those sentient beings to dwell in peace and freedom from affliction, to enjoy wealth, honor, and long life, and to be free from all disasters and difficulties?”\n\nThe Heavenly Worthy replied: “You are truly compassionate, desiring to benefit the sentient beings of the latter age, and so you inquire with such expedient means. If there are good men and good women who suffer from official calamities, illnesses, karmic lawsuits, or demonic disturbances—all manner of urgent difficulties with no means of deliverance—let them but arouse the mind of faith and devotion, pray for blessings and protection, and naturally they will enjoy prosperity and peace. The power of the sagely and divine is measureless. Pay homage to the true form of Spirit-Observation, prostrate, and recite the incantation:\n\nO Spirit of the Utmost Numinous,\nBestowing abundant blessings.\nFrom crown to sole, enveloped in grace,\nHow could it ever come to an end?”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1009,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.09340834617615,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\大惠静慈妙乐天尊说福德五圣经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "睿鉴孔昭，厥衷庸启。 臣今皈命，一心信礼。 三十三天星月宫内、雷音殿中，化现白蛇之冠，三头六臂青身自在之体，圆光火犀大仙、灵官显应，横天急捉三界邪魔，封山破洞主法摧魔正神、灵观大圣五帝大元帅真形睿号： 第一都天威猛大元帅 显聪昭圣孚仁广济福善王 第二横天都部大元帅 显明昭圣孚义广佑福顺王 第三通天金目大元帅 显正昭圣孚智广惠福应王 第四飞天风火大元帅 显直昭圣孚信广泽福佑王 第五丹天降魔大元帅 显德昭圣孚爱广成福惠王 此真形睿号，普可受持，信女善男，常当读诵，功德甚大，利益无穷。 凡叨覆载之安居，悉向神祇之宰制，是故灵观尊圣在天为五帅，在世为五王，勇烈明灵，威权至重，有赐福消灾之力，有赏善罚恶之功，贫富差殊，穷通虽异，然隶攸司之考窍，悉归上圣之裁量，功过昭然，丝毫弗谬，知作善降祥之美，杜为愆酿恶之因，垢翳若除，慧光明朗，灾尤消释，福庆咸臻。 凡有上士於三元八节、五腊、生辰持诵是经，外袪灾疠，内益经营，神祇密护於门庭，魔鬼远离於境界，功圆果满，获大吉祥。 尔时天尊即说灵观咒曰： 灵观元帅，显烈威雄。 通天彻地，掷火奔风。 上飞丹雀，下骤朱龙。 金光灼灼，黑雾蒙蒙。 邪魔丧胆，鬼魅潜踪。 安民护国，伐恶除凶。 灾祸消灭，福德兴隆。 五灵真炁，降我身躬。 所求皆遂，有愿克从。 北帝勑令，要立神功。 急急如律令！ 天尊曰：世间众生，天灾重病，瘟疫时行，传染不瘦，或久患卧床，不逢医药，及有猴犬之精，狐狸之祟，变易形质，迷惑阳人，诈托尊神，妄称大圣，占人楼阁，摄人魂魄，放火抛砖，偷财盗物，门无风而自开，釜无火而自热，百奇千怪，恼乱众生，当於清浄庭宇，请正一道士依科立坛，誊奏章表，醮祭五天大元帅，烧香燃灯，诵吾神咒。 或一日，或五日，当有铁轮大神、白蛇大将、无面目将军、火部兵马，一合来降，扫荡妖氛，肃清定舍，生人安泰，驱逐不祥。 又复有人身遭狱难，禁系枷锁，不能脱离，及有门户闭塞，谋运不成，口舌频生，非横竞起，钱财耗散，命禄衰微，五路不通，三灾叠至，连年蹇滞，累岁迍邅，亦当命道士如前举行，即得灵观元帅、福德仙官、善庆童子应时下降，卫护众生，灾厄消除，一切如意。 若或经行旷野山林隈僻之处，独宿恐怖，但能焚香诵经，凶恶自散，便得安稳。 或有众生根性顽恶，阐提不信，毁谤真经，轻慢香火，如此之人，巡察将军地行使者，紏录罪犯，定其轻重，所犯重者，投陷水火之中，卒於非命，其过若轻，减算除禄，灾病苦身。 当知灵观元帅威雄猛烈，报应尤速，专持祸福之权，生杀之柄，以示神化，善男子善女人得遇此经，虔诚恭敬，受持读诵，更能与人书写，教人持诵，或印造是经，广行劝化，灵观元帅心大欢喜，速得赐其福佑，自然门户兴隆，财物昌盛，贵人协顺，圣力扶持，凡所愿心，悉令成就。 於是定惠真人及诸仙等众闻此说已，踊跃欣喜，稽首灵观而祝愿曰： 稽首灵观五圣尊，愿得国土保升平。 稽首灵观五圣尊，愿得风雨应时行。 稽首灵观五圣尊，愿得百谷自登成。 稽首灵观五圣尊，愿得宅舍得安宁。 稽首灵观五圣尊，愿得父母享遐龄。",
      "translated_text": "Your discerning gaze is most luminous, and thus this humble servant dares to present his devotion. Now I prostrate in homage, wholeheartedly placing my faith and reverence.\n\nWithin the Star and Moon Palace of the Thirty-Three Heavens, in the Thunder-Sound Hall, there manifests a crown of white serpents, a body of azure hue with three heads and six arms, self-possessed and free. The Great Immortal of the Fiery Rhinoceros Aura, the Divine Official of Manifest Response—transverse across the heavens, swiftly seizing the demonic forces of the Three Realms—Sealer of Mountains and Breaker of Caverns, the Dharma-Enforcing Demon-Quelling True Deity, the August Spirit-Observation Great Sage, the Five Thearchs, the Great Marshals of the Primal Origin, whose august and numinous titles are:\n\nFirst, the All-Heaven Mightily Fierce Great Marshal of the Primal Origin,\nRevealer of Wisdom, Illuminator of Sageliness, King of Trust and Vast Relief, Bestower of Blessings and Goodness.\n\nSecond, the Transverse-Heaven Marshal of the Great Department,\nRevealer of Clarity, Illuminator of Sageliness, King of Righteousness and Vast Protection, Bestower of Blessings and Harmony.\n\nThird, the Penetrating-Heaven Golden-Eyed Great Marshal,\nRevealer of Rectitude, Illuminator of Sageliness, King of Wisdom and Vast Favor, Bestower of Blessings and Response.\n\nFourth, the Flying Heaven Wind-Fire Great Marshal,\nRevealer of Integrity, Illuminator of Sageliness, King of Faith and Vast Moisture, Bestower of Blessings and Protection.\n\nFifth, the Cinnabar Heaven Demon-Quelling Great Marshal,\nRevealer of Virtue, Illuminator of Sageliness, King of Love and Vast Completion, Bestower of Blessings and Favor.\n\nThese august and numinous titles of the true form may all be received and upheld. Devout women and good men who constantly read and recite them shall accrue vast merit and boundless benefit.\n\nAll who dwell in the peace of heaven’s covering and earth’s bearing are subject to the governance of the divine. Thus, the Spirit-Observation Venerable Sage in heaven serves as the Five Marshals, and in the world as the Five Kings—fierce, valiant, and luminously efficacious, wielding authority of the utmost weight. They possess the power to bestow blessings and dispel calamities, the merit to reward good and punish evil. Though poverty and wealth differ, and success and failure vary, all matters of life and death are under their scrutiny, subject to the judgment of the August Sages. Merit and transgression are clearly manifest, not a thread amiss. Know that doing good brings down auspiciousness, while refraining from wrongdoing severs the roots of evil. When the filth of delusion is swept away, the light of wisdom shines brightly; misfortunes dissolve, and blessings and felicity all arrive.\n\nWhenever superior practitioners recite this scripture during the Three Primes, the Eight Festivals, the Five La Days, or on their birthdays, they shall externally dispel plagues and pestilence, and internally enhance their undertakings. The divine protect their households in secret, while demons and ghosts flee far from their borders. When merit is perfected and fruit is fulfilled, great good fortune is attained.\n\nThen the Heavenly Worthy spoke the Spirit-Observation Incantation:\n\nSpirit-Observation Marshals, manifesting fierce might and valor,\nPenetrating heaven and earth, hurling fire and riding the wind.\nAbove, flying cinnabar sparrows; below, galloping vermilion dragons.\nGolden light blazing, black mist swirling.\nDemons lose their courage, ghosts and specters hide their traces.\nPacifying the people and protecting the state, vanquishing evil and eliminating misfortune.\nDisasters and calamities vanish, fortune and virtue flourish.\nThe five numinous qi descend upon my body.\nAll that is sought shall be attained; all vows shall be fulfilled.\nBy the Northern Thearch’s command, swiftly establish divine merit!\nSwiftly, swiftly, as in the statutes and ordinances!\n\nThe Heavenly Worthy said: “Among the sentient beings of the world, when heavenly disasters, severe illnesses, or epidemics spread contagiously without abating—when one lies bedridden for long, untouched by medicine—or when monkey and dog spirits, fox and leopard demons alter their forms to delude mortals, falsely impersonate august deities, or falsely claim to be great sages, occupying people’s towers and pavilions, snatching souls, setting fires, hurling bricks, stealing wealth and goods—when doors open without wind, cauldrons heat without fire, and a thousand strange and bizarre phenomena disturb the people—then in a pure and clean courtyard, invite an Orthodox Unity Daoist priest to establish an altar according to the rites, transcribe and present memorials, and perform a jiao offering to the Five Heavenly Great Marshals. Burn incense, light lamps, and recite my divine incantation. After one day or five days, the Great Iron-Wheel Deity, the White Serpent General, the Faceless General, and the Fire Department’s troops and horses shall descend in unison, sweeping away demonic miasma, purifying and stabilizing the dwelling, bringing peace to the living and driving out misfortune.\n\nFurthermore, if one suffers imprisonment, bound in cangues and fetters, unable to escape—if one’s household is blocked, plans fail, slander arises, unjust lawsuits erupt, wealth dissipates, life and fortune decline, the five paths are obstructed, the three disasters strike repeatedly, and years of misfortune and hardship persist—then summon a Daoist priest to perform the rites as before. The Spirit-Observation Marshals, the Immortals of Blessing and Virtue, and the Auspicious Youths shall descend in timely fashion, guarding and protecting the people, dissolving calamities, and fulfilling all wishes.\n\nIf one travels through desolate wilds, secluded mountain forests, or fears to lodge alone, simply burn incense and recite the scripture, and malevolent forces shall disperse, bringing safety and peace.\n\nBut if there are sentient beings of stubborn and evil nature, icchantikas who lack faith, slander the true scripture, and disdain incense and offerings, the patrolling generals and terrestrial emissaries shall record their transgressions, determining the severity of their crimes. Those who commit grave offenses shall be cast into water or fire, meeting sudden and unnatural deaths. For lighter transgressions, their lifespan and fortune shall be diminished, and they shall suffer from illness and affliction.\n\nKnow that the Spirit-Observation Marshals are fiercely mighty and valiant, their retribution swift. They wield the authority over fortune and misfortune, life and death, demonstrating divine transformation. Good men and good women who encounter this scripture, reverently and respectfully receive, uphold, read, and recite it—and further, transcribe it for others, teaching them to recite it, or print and distribute the scripture to widely exhort and transform—shall delight the Spirit-Observation Marshals, who shall swiftly bestow blessings and protection. Naturally, their households shall prosper, wealth shall flourish, noble persons shall harmonize, and sagely power shall support them. All their heart’s desires shall be fulfilled.”\n\nThereupon, the Perfected One of Settled Wisdom and the assembly of immortals, having heard these words, leapt with joy, prostrated to the Spirit-Observation, and offered their prayers:\n\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay the land be preserved in peace and prosperity.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay wind and rain come in due season.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay the hundred grains ripen of themselves.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our dwellings enjoy peace and tranquility.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our fathers and mothers enjoy long life.",
      "overlap_context": "monic disturbances—all manner of urgent difficulties with no means of deliverance—let them but arouse the mind of faith and devotion, pray for blessings and protection, and naturally they will enjoy prosperity and peace. The power of the sagely and divine is measureless. Pay homage to the true form of Spirit-Observation, prostrate, and recite the incantation:\n\nO Spirit of the Utmost Numinous,\nBestowing abundant blessings.\nFrom crown to sole, enveloped in grace,\nHow could it ever come to an end?”",
      "start_char": 1009,
      "end_char": 2280,
      "start_sentence": 44,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.48357963562012,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\大惠静慈妙乐天尊说福德五圣经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "稽首灵观五圣尊，愿得谋运称心情。 稽首灵观五圣尊，愿得财物足丰盈。 稽首灵观五圣尊，愿得火盗不相侵。 稽首灵观五圣尊，愿得出入利经营。 稽首灵观五圣尊，愿得无病保长生。 稽首灵观五圣尊，愿得诸福自来并。 稽首灵观五圣尊，愿得天真圣教兴。 诸大仙众称赞愿已，龙车旌节来迎天尊，复还真境。 是时天尊再告定惠真人曰：尔等受吾此经，宜下人间流传，信士依教奉行，祈沾福佑。 於是定惠真人及诸仙众遵奉道旨，作礼而退。 大惠静慈妙乐天尊说福德五圣经竟",
      "translated_text": "We bow to the Spirit-Observation, the Five August Worthies,\nMay our plans and fortunes align with our heart’s desires.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our wealth and possessions be abundant and full.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay fire and theft never encroach upon us.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our comings and goings bring profitable enterprise.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay we remain free from illness and preserve long life.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay all blessings naturally converge upon us.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay the sacred teachings of the Heavenly Perfected flourish.\n\nThe assembly of great immortals, having voiced their prayers, saw the Heavenly Worthy welcomed by a dragon-drawn chariot with banners and regalia, returning to the true realm.\n\nThereupon, the Heavenly Worthy again addressed the Perfected One of Settled Wisdom, saying: “You who have received this scripture of mine should disseminate it among the world below. Let the faithful uphold its teachings and practice accordingly, that they may beseech and partake of its blessings and protection.”\n\nThen the Perfected One of Settled Wisdom and the assembly of immortals, reverently obeying the Dao’s decree, bowed in homage and withdrew.\n\nThus concludes the *Scripture of Blessings and Virtue in Five Sections*, expounded by the Heavenly Worthy of Great Wisdom, Serene Compassion, and Wondrous Joy.",
      "overlap_context": "ervation, the Five August Worthies,\nMay the land be preserved in peace and prosperity.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay wind and rain come in due season.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay the hundred grains ripen of themselves.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our dwellings enjoy peace and tranquility.\nWe bow to the Spirit-Observation, the Five August Worthies,\nMay our fathers and mothers enjoy long life.",
      "start_char": 2281,
      "end_char": 2516,
      "start_sentence": 84,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.683075189590454,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\大惠静慈妙乐天尊说福德五圣经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}