{
  "source_id": "大洞玉经",
  "source_file": "chunked_daozang\\大洞玉经.json",
  "total_chunks": 29,
  "total_original_chars": 16975,
  "total_translated_chars": 101541,
  "total_translation_time": 700.4889011383057,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Jade Scripture of the Great Cavern**\n\n**Scripture Title:** *The Jade Scripture of the Great Cavern*. Compiled by Daoist Adept Zhao and others during the Song-Yuan period, transcribed and prefaced by Gong De. A collated and annotated edition of *The Thirty-Nine Chapters of the Supreme Clarity Scripture of the Great Cavern*. Two fascicles. Base text from *The Orthodox Daoist Canon*, *Dongzhen* section, *Benwen* category.\n\n---\n\n**The Jade Scripture of the Great Cavern**\n\nHold the tablet centered before the heart, gaze forward, and knock the teeth. Visualize the chamber filled with purple clouds of *qi*, enveloping the body like a crown. Golden Lads and Jade Maidens attend beside the scripture, while the Three Radiances and precious mushrooms illuminate the room. Knock the teeth and softly invoke:\n\n\"The heavens are bright, the *qi* is clear,\nThe Three Radiances illumine the cavern’s light.\nGolden chambers and jade halls,\nFive mushrooms bloom with treasured might.\nMysterious *qi* and purple canopy,\nDescend to grace this form of mine.\nImmortal lads and jade maidens,\nBestow your numinous power divine.\nThe Nine Thearchs align in splendor,\nThe Three Origins share their car.\nAscend beneath the purple canopy,\nTo enter the Thearch’s court afar.\"\n\n**Mystic Concealment Spell for Opening the Scripture**\n\nPierce the gate of subtle mystery,\nResplendent, vast as empty sky.\nThe supreme Dao arises in stillness,\nWhere the Three Primes’ palace comes nigh.\nThe Great Way is perfected here,\nRiding cloud-dragons through the air.\nImmortals attend left and right,\nJade maidens and lads so fair.\nThis body attains the deathless law,\nUntangles knots in the spirit’s breeze.\nSeven ancestors return to womb,\nTheir lineage reborn as immortals’ seeds.\n\nKnock the teeth, close the eyes, and bow in prayer, saying:\n\n\"Humblest servant [Name], a fleeting mortal of this dust,\nNow offers these modest words,\nTo supplicate the Jade Clarity’s Primordial Lady of the Rosy Origin,\nThe Lofty Sage, Myriad Perfected, Supreme Dao Lord of the Great Dao,\nThe Central Yellow Elder, Primordial Simplicity Dao Lord,\nThe Supreme Clarity’s Marshal of All Immortals, Master of Longevity, Lord of the Three Heavens, Perfected of Cypress Completion,\nThe Scripture-Teacher of *The Scripture of the Great Cavern*, Holy Mother, Primordial Lady of the Purple Tenuity, Lady Wang,\nThe Great Unifier of the Returning Wind, Holy Mother, Primordial Lady of the Central Marquis, Lady Wang,\nThe Supreme Clarity’s Ninefold Subtlety, Jade Protector, King of the Golden Watchtower, Grand Minister of Fate, High Dawn Master, Lord Azure Florescence of the Eastern Sea,\nThe Supreme Clarity’s Great Void, Lord of the Eastern Glow, Fusang Vermilion Forest, Supreme Dao Lord,\nThe Patriarchal Perfected of the Southern Culmen, Supreme Clarity’s Dao Master, Holy Consort of the Jade Dawn, Golden Watchtower’s Protector, Lord of the Eastern Florescence,\nThe Golden Watchtower’s Grand Master, Supreme Clarity’s Immortal Marquis—\n\nThis servant now enters the chamber to recite *The Thirty-Nine Chapters of the Supreme Clarity Scripture of the Great Cavern*,\nPraying that the dawn’s radiance may shine forth,\nIlluminating this servant’s viscera and palaces with flourishing splendor,\nDispelling calamities and misfortunes,\nReturning the seven ancestors to the womb,\nThat together we may ride the cloud chariot.\"\n\nClose the eyes and visualize the Lord of the First Thearch,\nLike an infant, four inches tall,\nDwelling within the philtrum beneath the nose,\nGoverning the assembly of the hundred spirits,\nSeated amidst five-colored clouds.\nVisualize the Lord of the First Thearch in the empty mystery,\nHis mouth directly aligned with this servant’s mouth,\nListening to the recitation of the Jade Scripture.\n\n---\n\n**Talismanic Script of the Great Cavern’s Thunderous Numen**\n\nInscribe the talisman on yellow silk,\nWith cinnabar for the inner text,\nAnd black ink for the border.\nWear it when walking,\nUse it as a mat when seated or bowing,\nTo subdue the myriad demons\nAnd stabilize the spirit’s resolve.\n\n**Talismanic Script of the Great Cavern’s Illuminating Ward**\n\nCarve the talisman on precious materials,\nInscribing both sides,\nEncase it in brocade,\nWith an outer pouch of yellow silk.\nWear it when conducting affairs,\nSo that the Demon Kings of the Six Heavens\nAnd the Wardens of the Three Heavens’ Prohibitions\nDare not obstruct or impede.\n\n---\n\n**Inner Secrets for Reciting the Scripture**\n\nSit upon the Thunderous Numen Talisman,\nWearing the Illuminating Ward Talisman.\nStill the mind and visualize the body within the Northern Dipper of the Three Heavens.\nUpon completion, knock the teeth thirty-nine times,\nThen recite the Concealed Writ\nAnd enter the root scripture.\n\n---\n\n**The Divine Wisdom’s Concealed Writ of the Great Cavern**\n\nMysterious radiance scatters the celestial shores,\nThe clear Han brushes past the returning clouds.\nWondrous *qi* illumines the Three Dawns,\nCinnabar auroras reflect the Purple Tenuity.\nThe myriad heavens inscribe numinous hues,\nStreaming through the skies in profuse array.\nThe spirit lamp shines bright as the Long Star,\nThe Net of Separation exhales its luminous ray.\nFour peaks gird the lofty clouds,\nMysterious essence shades the eight directions.\nThe Three Primes open the high void,\nOrchid towers unfold their layered gates.\nGolden ramparts mirror the Jade Clarity,\nNuminous splendor marks the celestial precincts.\nWinds arise in the Eightfold Assembly Palace,\nFierce beasts gallop through the clouds.\nIn the bustling Three Cavern Courts,\nPerfected Ones intermingle in disarray.\nAbove dwell the thousand radiant spirits,\nTheir hidden virtue towering and sublime.\nThe Great One gathers the threads of fate,\nGrasping life’s reins, wielding the spirit’s banner.\nThe Orthodox Unity treads the flourishing numen,\nSummoning the myriad spirits to return.\nThe Duke’s son flanks the silent axle,\nThe Cavern Yang guards the mystery’s pivot.\nAt the dawn’s clarity, the Dao is harmonized.\nThe dragon chariot pauses in its circuit.\nThe Seven Radiances align with the Spirit Kings,\nWhirlwind wheels traverse the ten-thousand treetops.\nThe body soars above the mysterious ford,\nFlying steps ascend the ridge’s ladder.\nParting the radiance, enter the spirit’s mound,\nResplendent, the feathered robes tremble.\nHidden depths intermingle in clouded assemblies,\nFlying radiance bears the spirit’s communion.\nGreen peaks without a speck of haze,\nSilken unions arise in the void’s expanse.\nGolden splendor girds the numinous carriage,\nWinged immortals soar in majesty.\nTen-thousand reins scatter through the void,\nLush and misty, the mystery’s upper window.\nWithin arises the Lord of Harmonized Radiance,\nThe Nine Thearchs flourish the Supreme August.\nThe luminous wheel shines upon the Yellow Tranquility,\nFeathered pearls gleam in the Mysterious Yang.\nThe celestial essence of primordial simplicity,\nThe Central Five named Nurturing Light.\nBound clarity gives birth to the nascent spirit,\nNine Perfected unite as a pair.\nWondrous radiance reveals the hidden reckoning,\nFollowing resonance, it marks the spirit’s trace.\nThe Muddy Pellet’s cavernous primordial light,\nDirects the pearl to the Crimson Palace.\nThe Gate of Life in the Primordial Yang’s domain,\nThree spirits escort the Purple Lad.\nRestrain and summon them to return above,\nFlanking the portals, attending the bright window.\nCanopies face the Brilliant Star,\nCircular splendor illumines the Three Thoroughfares.\nSquare fullness draws forth and connects life,\nReversing age to return to infancy.\nWhirlwinds gleam across the Nine Heavens,\nGreen axles coil around the cinnabar chamber.\nWhispering winds weave beyond the mist,\nCurved crimson rests in the flowery hall.\nRoaming the hidden, gazing upon ten-thousand transformations,\nReturning to assemble with the Spirit Sovereign of the Cloudy Empyrean.\nThe immortal’s path delights in life’s flourishing,\nThe ghostly path delights in misfortune’s thrall.\nOne hears only of the precious path of life,\nNever of the ghostly path’s rise.\nJade songs harmonize with the celestial *qi*,\nThe *Primordial Rectitude of Precious Life*’s foremost chapter.\nDivine wisdom commands the vermilion troops,\nThe Five Thearchs’ talismans chill the northern wilds.\nBrandishing banners to capture the myriad demons,\nJade writs restrain the Feng’s dark domain.\nThe body’s dissolution is the Dao’s natural course,\nThe vanquishing of demons is not your merit.\nFloating radiance beats the long fan,\nNuminous beings rejoice on the cloudy peak.\nGazing below at the four flying perils,\nHeaven’s kalpas never end.\n\nWithin the wondrous arises the true vision,\nThe returning chariot moves as if lingering slow.\nThe mind aligns, preserving the unseen resonance,\nCarrying forth the sublime and lofty marvel.\nSoaring wings await the wondrous convergence,\nWhat peer could match this penetrating gaze?\nWith a whistle, a shout, a sigh in an instant,\nSwiftly traversing the nine enclosures.\n\nGathering *qi* to revert to the primal exchange,\nMerging radiance to dwell in the profound and mysterious.\nThe Three Primes—these are the Three Prime Lords.\nWu You Shou—the name of the Great One.\nLü Chang Ling—the style of the Jade Emperor Lord.\nGongzi—this is Wu Ying Gongzi.\nDongyang Jun—the name of the Right White Prime Spirit.\nLi Ming Chu—the name of the Central Controller of Destiny.\nHai Dao Kang—the name of Tao Tao Kang.\nHe Jing Jun—the name of the Eight Perfected within the gallbladder.\nNine Emperors Chang Shang Huang—the name of the Nine Perfected in the Muddy Pellet.\nMing Lun—the name of the Four Perfected within the liver.\nHuang Ning—the name of the Three Perfected of essence and blood.\nYu Zhu—the name of the Two Perfected in the stomach duct.\nXuan Yang—the name of the Seven Perfected in the left kidney.\nTian Jing—the name of the One Perfected within the heart.\nYuan Su—the name of Wu Ying Gongzi.\nYang Guang Zi—the name of the spleen spirit.\nDong Yuan Jun—the name of the Muddy Pellet Lord.\nYun Zhu—the name of the Cinnabar Prime Lord within the heart.\nYuan Yang Chang Ming Men—the name of the Primal King of the Lower Origin.\nZi Tong—the name of the Minor Lad of the Grand Tenuity.\nJu Zhi—the name of the Nine Prime True Youth.\nShang Gui—the name of the Hun Maiden of the August One.\nYi Wei—the name of the Purple Prime Left Prime Lord.\nQi Ming—the name of the White Prime Right Prime Lord.\nYuan Hua—the name of the Moon Spirit.\nFang Ying—the name of the Peach Lord within the moon.\nJie Sheng—the name of the Controller of Destiny within the sun.\nShen Hui—the name of the heart spirit.\nWu Di—the name of the kidney spirits.\n\nThe Great Tenuity Jade Talisman of the Grand Tenuity\nThe incantation for wearing the talisman reads:\nMinor Lad of the Grand Tenuity, named Gan Jing Jing, styled Hui Yuan Zi, also called Three Collars Intertwined, also called Peer of the Imperial Perfected.\nEver guards beneath the root of the tongue, the mansion of blood and fluids.\nThe Grand Tenuity is the body of initial cultivation.\nThe Minor Lad is the Lad.\nPeer of the Imperial Perfected signifies the meaning of mutual companionship in knowledge.\n\nThe Jade Pure True King’s Incantation reads:\nCelestial Treasure, Great Concealment gives birth,\nIlluminating Beam, the primordial *qi* above,\nSeals for me the lower gate,\nBeyond the secure pass of life’s reception.\nYi Yuan Yu Tong Jun,\nArrayed in the Verdant Chamber Pavilion,\nSeven Ancestors untie their knots,\nFollowing the wind to leave the root’s source,\nMatching Heaven’s foundation for ascension,\nPenetrating the transformations of the Eight Mysteries.\nGreat Concealment gives birth—this is the human heart.\nIlluminating Beam—this is the human breath.\nYi Yuan Yu Tong—the spirit of the nose.\nVerdant Chamber—this is the philtrum.\n\nAnother incantation reads:\nPrimal *qi* arises from its origin,\nFive Paths bear the numinous forth,\nFeminine and masculine lodge in divine transformation,\nVast and profound, the darkly luxuriant,\nJade tones resonate with the Grand Harmony,\nMyriad chants issue from the Primal Center,\nThe immortal court revolves through nine cycles,\nHundredfold chaos unites in the One,\nChange holds the Void Within,\nAll enter the Imperial Assembly Chamber.\nFeminine and masculine—these are the Lords of the Feminine One and Masculine One of the Great Tenuity.\nChange Holds—this is the name of the northwest gate of the Nine Heavens.\nImperial Assembly—this is the name of the hall chamber.\n\nVisualization Chart\nUpper Scroll of the Jade Canon of the Great Tenuity\n\nHighest Scripture of the Void Sovereign Lord, First Scroll\n\nThe Supreme Cavern Mystery,\nPrimal birth of the Nine Heavens.\n*Qi*-Ancestor of the Great Void,\nLineage-Wind bears forth the Mystery.\n\nThe Mystery’s kin dispersed and severed,\nFour Purities govern in tranquility.\nImperial Unity’s Upper Radiance,\nLinks the multitudes and gathers the mists.\n\nEternal Pact of the One Revolution,\nSeven generations cast into repose.\nEntrusting the numinous, binding fate,\nReturning to the blossom of spontaneity.\n\nVast and distant, flowing into the Void,\nSix Luminaries drift in ascent.\nAscending Brahma, bearing splendor,\nWestern Florescence manifests peace.\n\nImmortal registers, imperial tablets—\nAll attain liberation at the source.\nWomb-Field’s profound path,\nGenerations issue jade orchids.\n\nNuminous light of the Eight Luminaries,\nGives rise to the myriad spirits.\n\n[Three Indigo Nets, Waves Reach the Terrace.]\n\nThe *qi* of the Highest Jade Sovereign,\nWithin the human body is the *qi* of the Bright Beam,\nDescending to correspond with the human nose.\nFor when humans receive the embryo and form the body,\nThe nose is first to take shape—\nThe meaning of \"Nose-Ancestor\" is drawn from this.\n\nLineage-Wind is another name for Ancestral *Qi*,\nGeneration upon generation, transformation upon transformation,\nMystery upon mystery—\nThe meaning of \"Mystery’s Descendant\" is drawn from this.\n\n\"Kin dispersed and severed\" refers to the human body,\nThe ancestral kin’s cast-off traces, hidden and manifest,\nWithin which lies the mechanism of natural resonance,\nWhere dispersion and convergence attain great liberation.\n\n\"Imperial Unity’s Upper Radiance\" is the True Unity,\nThe unparalleled Dharma-gate, the supreme vehicle’s wondrous Dao.\n\n\"Links the multitudes and gathers the mists\" means\nTo connect and thread the multitudes of *qi*,\nGathering the numinous mists—\nDrawing from the lungs as the flowery canopy of the five viscera,\nThe Bright Beam’s ancestral *qi* is tied to the nose.\n\n\"Six Luminaries\" refers to the Six Luminaries of the Southern Dipper,\n*Qi* floats in the southern blaze,\nSignifying the omen of transformed form and altered countenance.\n\n\"Ascending Brahma\" is the name of the Jade Sovereign Lord, Feng Ascending Brahma.\n\"Manifests peace\" is the name of the White Emperor of the Lungs, Zhang Anxing,\nStyled Western Florescence.\n\n\"Womb-Field\" refers to the immortal embryo congealed in the Cinnabar Field.\n\"Eight Luminaries\" are the Eight Radiant Scenes.\n\nGreat Cavern Supreme Unity Jade Talisman\n\nRecitation of the Secret Incantation:\n\nThe Supreme Unity Venerable Deity is named Wu You Shou, styled Gui Hui Chang, also called Jie Meng, also called Ji Pin. He constantly rests beneath my Jade Pillow, at the posterior gate of the Mud-Pellet Palace. The occipital bone behind the brain and the space between the brows, three inches inward, form the Cinnabar Field—this is the Mud-Pellet Palace. The posterior gate of the Mud-Pellet Palace lies precisely beneath the Jade Pillow, where the Governing Vessel enters.\n\n*Scripture of the Jade Sovereign of the Highest August, Second Chapter*\n\nThe Jade Sovereign follows the Mysterious Return,\nWandering the Celestial Dawn of the Golden Empyrean.\nResplendent shines the imperial radiance,\nSwiftly born upon the Feast of Jade Isle.\nTo the left, he summons the Divine Youth of Beginnings;\nTo the right, he commands the Ever-Assisting One to rise.\nThe Illuminated Perfected gleams across the Nine Empyreans,\nThree days’ [mystery] unfolds the Dark Expansion.\nA thousand scenes merge with the Three Girdles,\nWithin lies the Profound and Boundless Void.\nNow I attain longevity,\nA thousand kalpas mark but one cycle.\nThe Yellow Register guards the Power of Virtue’s measure,\nDonning brocade, he enters the Divine Mound.\nThe Supreme Unity’s root of life’s mandate,\nThe Noble Scion commands the numinous banner.\nTen revolutions fulfill the initial resolve,\nAttaining entry into the Root of Great Faith.\nDepart the hall, unite—\nPush the turning wheel, revolve.\n\nThe Heaven of the Jade Sovereign is the Qian Yang. \"Follows\" means that humans, receiving the uprightness of the One *Qi*, thus follow life—unlike grasses and trees, which grow in reverse, or birds and beasts, which grow horizontally. The Mysterious Return Master is the name of the Supreme Unity’s essence-spirit, also the numinous root of the Mud-Pellet Palace. \"Celestial Dawn\" is the name of the Feminine One Sovereign. \"Golden Empyrean\" is the name of the Masculine One Sovereign. \"Wandering\" means to roam freely. \"Resplendent\" refers to the brilliance of the sun and moon. \"Imperial radiance\" is the scene where the Feminine One dwells. \"Swiftly born\" is the name of the wind. \"Jade Isle\" is the scene where the Masculine One dwells. The Divine Youth of Beginnings is the name of the Primordial Sovereign of the Yellow Court. The Ever-Assisting One is the name of the Mud-Pellet Palace’s Imperial Minister. \"Illuminated Perfected\" is the name of the Nine Heavens Terrace. \"A thousand scenes merge with the Three Girdles\" refers to the Lesser Lad of the Great Tenuity, also called the Essence of a Thousand Scenes, also called the Intertwining of Three Girdles. \"Profound and Boundless Void\" is the style of the August Supreme Unity Sovereign. \"Virtue’s measure\" is the name of the Nine Heavens Terrace. \"Divine Mound\" is the numinous cavern of the Supreme Unity. \"Noble Scion\" is the Peerless Noble Scion.\n\n*Great Cavern Supreme Jade Talisman of the August Highest*\nRecitation of the Secret Incantation:\n\nThe August Highest Jade Sovereign Lord is named Feng Ling Fan, styled Lü Chang Ling, also called Bi Ling, also called Divine Venerable. He constantly guards the space between my brows, beyond the Purple Gate. One inch inward from the space between the brows is the Hall of Light; one inch to the left is the Azure Chamber; one inch to the right is the Purple Gate.\n\n*Scripture of the August Highest Jade Sovereign Lord, Third Chapter*\n\nThe Sovereign bears the Dark Loft Banner,\nCommanding the nine celestial stairways.\nThe Seven Awakenings ride the wondrous Dao,\nJoyously the divine wind returns.\nThe radiant gale halts at the Northern Bloom,\nThe Purple Flower sings at the Eastern Bend.\nJade harmony resounds beyond the Nine Empyreans,\nThe subtle jade tally of the Great Tenuity.\nThe Three Simplicities generate the Mud-Pellet Palace,\nEmitting the golden numinous radiance.\nThe Venerable Lord firmly upholds the summit,\nGuarding the death-defying mechanism.\nThe Ten Virtues arise within the Mysterious,\nTranscending death to rejoice in brilliance.\nPearl-luster entwined, vast capital numinous.\n\nThe Dark Loft Banner, also called the Reverse Flower Banner, is the Jade Sovereign’s decree for summoning the Perfected and governing the numinous. \"Northern Bloom\" refers to the Northern Retained Spring Immortal Garden, called the Halting Bloom. \"Eastern Bend\" is the Eastern Ultimate Azure Florescence Heaven. The Nine Empyreans are the Divine Empyrean, Jade Empyrean, Grand Empyrean, Azure Empyrean, Green Empyrean, Crimson Empyrean, Scenic Empyrean, Supreme Empyrean, and Jade Empyrean. The Three Simplicities are the Three Simplicity Venerable Lords. \"Golden numinous radiance\" is the divine light of the Golden Elixir. \"Firmly upholds the summit\" is the name of the Three Simplicity Venerable Lords. \"Death-defying mechanism\" is the Death Gate. The Seven Awakenings correspond to the number of fire.\n\n*Great Cavern Talisman of the Peerless Master*\nRecitation of the Secret Incantation:\n\nThe Left Peerless Master, styled Master Profound-None, courtesy name Master Conjoined-Tally, also called Lord Primordial Essence or Divine Master. He constantly guards beneath my left armpit: the posterior portal of the liver. On the back, three inches left of the spine, opposite the left breast, beneath the scapula of the left arm.\n\n*Scripture of the Purple Empyrean of the Supreme August Master*, Chapter Four:\nThe Grand Obscurity severs the Nine Profounds,\nThe Cavern’s radiance lodges numinous communion.\nThe Jade Emperor rides the Crimson Empyrean,\nVerdant auroras illumine the Golden Ramparts.\nThe upper palace lies within the Cloud Pearl,\nGazing upward to the boundless peak.\nThe numinous pass beneath the Great Desert,\nMist and foam mirror the void.\nObscure light blends with the Child of Chaos,\nThe Fire King is Master Profound-Above.\nMarvelous quiescence shares life with the Lofty,\nThe Boundless guards the Valley Lad.\nThe round path knows no stagnation,\nWondrous union enfolds nine layers.\nSouthward, it severs the roots of the seven ancestors,\nWestward, it dissolves the misfortunes of successive generations.\nThe body leaps beyond the myriad ford-waves,\nThe spirit engenders and gathers the ten directions.\nFire returns to the reversed womb-chariot,\nThe Three Conjoined ride the celestial dragon.\nUnfathomable nurturance scatters omen and birth.\n\n\"Lodges\" means without attachment to form. \"Crimson Empyrean\" refers to the Crimson Mound Heaven. \"Golden Ramparts\" is the name of a palace in the Nine Heavens. \"Cloud Pearl\" is the name of a celestial court, meaning the Golden Ramparts Palace lies within the Cloud Pearl Court. \"Great Desert\" denotes the earthly portal. \"Mist\" signifies lightning-dew; \"foam\" signifies bubble-shadows, implying that gazing down upon the worldly dust is like mist and foam. \"Obscure light\" is the name of the Seven Perfected of the left kidney. \"Child of Chaos\" is the name of the Lord of Crimson Qi within the blood. \"Master Profound-Above\" refers to the name of the Peerless Master. \"Marvelous quiescence\" is the inner name of the Heart Lord. \"Lofty\" is the name of the Supreme Primordial Father Lord. \"Boundless\" is the name of the Lord of Yellow Qi within the womb. \"Valley Lad\" is the name of the essence-spirit of the Central Origin Lord of the Cauldrons. \"Wondrous union\" is the name of a terrace in the Nine Heavens. \"South\" points to the Upper Palace of Southern Prosperity; \"roots\" denote the root of the womb-tree. \"West\" points to the capital of the Queen Mother of the West; \"generations\" denote the branches of the profound lineage. \"Myriad ford-waves\" lie beneath the Wondrous Union Terrace. \"Fire returns\" refers to the spirit of the Flowing Gold Fire Bell, causing fire to ascend to the upper fruit. \"Reversed womb-chariot\" is the vehicle for returning and delivering womb immortals at the juncture where paths are severed and roads cut off.\n\n*Great Cavern Talisman of the White Prime*\nRecitation of the Secret Incantation:\n\nThe White Prime Venerable Deity on the right is named Wondrous Standard of the Luminous Yang Palace, styled Profound Yi of the Absolute, also called Vermilion Essence, also called Inaugurator of Completion. He constantly guards beneath my right armpit, behind the lung’s rear gate. On the back, three inches to the right of the spinal bone, opposite the right breast, and beneath the scapula of the right arm.\n\n*Scripture of the Dao of the Celestial Emperor of Grand Tenuity, Fifth Chapter*\nThe Celestial Emperor of Grand Tenuity—\nEight Floatings ascend to the Cloud Camp.\nDivine Ancestry governs the spirit’s lapel,\nDragon Mountain adorns Jade Capital.\nGolden Chambers luxuriate in bright auroras,\nNine Portals gleam with lofty jasper.\nYellow Court traverses Northern Origin,\nPrimal Father turns left to illumine.\nVermilion Essence, Inaugurator of the Luminous Master,\nIn profound solitude ascends Supreme Clarity.\nFour Profounds uphold the Primal Prohibition,\nEver guarding the Five Thearchs’ City.\nTranscending stagnation in Heaven,\nTraversing the inception of the Dark Obscurity.\n\nEight Floatings is the name of a wind. Divine Ancestry is the name of the Central Controller of Destiny. Dragon Mountain is the name of the Central Terrace in the Jade Clarity Heaven. Bright Aurora is the name of a Nine Heavens Palace. Lofty Jasper is the name of a Nine Heavens Chamber, referring to the nine orifices’ gates that communicate with the luminous Lofty Jasper Chamber. Northern Origin is the secluded portal of the Yellow Court. Left-Turning Illumination is the style of the Supreme Primal Father Lord. Vermilion Essence is the name of the White Prime Venerable Deity. Inaugurator of the Luminous is the name of the White Primordial Right Origin Lady. Profound Solitude is the style of the Grand One Lord. Four Profounds denote the Four Symbols, the Four Sages, and the spirits of the four limbs. Five Thearchs’ City refers to the five viscera.\n\n*Great Cavern Controller of Destiny Jade Talisman*\nRecitation of the Secret Incantation:\n\nCentral Controller of Destiny Venerable Lord,\nwhose name is Li Mingchu,\nwhose style is Xuandu Qing,\nalso called Divine Ancestor,\nalso called Numinous Radiance.\nHe constantly guards within my Crimson Palace’s heart chamber,\nthe gates of its four apertures.\nThe heart has seven orifices,\nwhose spirits are named:\nPi, called Dharma Enclosure;\nZhu Xiao;\nCinnabar Sovereign;\nMoving Pearl;\nDivine Wisdom;\nCavern Source;\nand Cavern Clarity.\n\n*Third Scripture of the Three Primes’ Purple Essence*\nWithin the Purple Essence of the Great Prime,\nthe Three Primes’ Upper Radiance Way:\nResplendent and bright, the Treasure of the Great Chaos,\ndim and distant, it unfurls the Thearch’s seat.\nElder Scribe initiates the Three Simplicities,\nthe Thearch’s spirit ascends to Jade Clarity.\nAuspicious qi nurtures the five clouds,\nthe Controller of Destiny, Divine Bright Beginning.\nTen Radiant Perfected Immortals of Wondrous Conduct,\ncommanding demon-quelling Feathered Bright Chariots.\nThe blossoming courtyard—\nits gaze and plans now fulfilled.\n\nUpper Radiance refers to the Solar Office.\nResplendent Brightness is the name of a Nine Heavens Terrace.\nThearch’s Seat refers to the Thearch’s throne.\nElder Scribe is the name of the Primordial Sovereign of the Yellow Court.\nThree Simplicities refers to the Three Simplicity Venerable Lords.\nThearch’s Spirit is the name of the Thearch-One.\nDivine Bright Beginning is the name of the Central Controller of Destiny Lord.\nTen Radiant refers to the Ten Poles Heaven.\nFeathered Bright is the name of a chariot.\n\n*Great Cavern Peach Well-Being Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Peach Well-Being Lord of the Gate of Destiny**, named Child Dao-Kang, styled Harmonizing Essence-Extension, also called Gate of Destiny, also called Root of the Womb. Ever guards the pass within my navel, beyond the Gate of Destiny. Located three inches below the navel, its form is one inch square and round. In men, it stores essence; in women, it stores the fetus—this is the Lower Cinnabar Field.\n\n*True Yang Primordial Elder Mysterious Unity Lord’s Scripture, Chapter Seven*\nTrue Yang Thearch-Treasure Elder,\nreceives affairs in audience with the Jade Thearch.\nExtinguishes demons, purges filth-water,\na hundred offices journey to the Crimson Palace.\nWithin the Leisure Abode of Cinnabar Mystery,\nthe five qi congeal the ten directions.\nSeven revolutions summon the Controller of Destiny,\nthree returns call the Immortal Elders.\nThe Mount Tai Lord of Ghosts\nhastens to examine the Three Offices.\nTen virtues form the initial foundation,\ntogether ascending, the Seven Awakenings fill.\n\n\"Grasping dark sand, count the Fortune Spirits.\"\n\nTrue Yang refers to the name of a hall in the Upper Clarity Heaven.\nThearch-Guest is the name of Left Immortal Zhongchengzi.\nFilth-water refers to the water of corpse-filth.\nCrimson Palace means the heart.\nLeisure Abode is the Bright Hall of true qi.\nCinnabar Mystery is the Palace of Mud-Pill.\nSeven revolutions refer to the thought-moment—once a thought stirs, the seven apertures all open, meaning that by raising a thought, the Controller of Destiny arrives.\nLord of Ghosts is the mountain spirit.\n\n*Great Cavern Heaven-Gate Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Upper One Heavenly Thearch of Mud-Pill**, named Red Child Mysterious Congealed Heaven, styled Three Primordials Radiance, also called Elder Non-Supreme, also called Elder Scribe-Origin. Ever guards the center of Mud-Pill, the gate of the nine apertures. This is the Upper Cinnabar Field, within which are nine palaces—four feminine, five masculine—each one inch square, their form internally round and hollow, radiant and lustrous, the dwelling of the spirits. Behind this gate lie two vessels, penetrating the tip of the spinal column.\n\n*Upper Primordial Grand Simplicity Three Primordials Lord’s Scripture, Chapter Eight*\nGrand Simplicity’s Three-Flower Qi,\nmorning lamp of the Broad Spirit Hall.\nJade Guest displays the Mysterious Register,\nguarding the life of Child Dao-Kang.\nWhirling winds scatter ten thousand demons,\ngolden talismans summon the Broad Realm.\nAssisting and defending within the Earth Gate,\npreserve this King of Longevity.\nTurning to enter the Ten Immortals’ Gate,\nthe Eight Effulgences unite in Luminous Yang.\n\n\"Bright Pillar Child, gather and hold in contemplation.\"\n\nThree Flowers refer to the Three Flowers Gathered at the Crown.\nSpirit Lamp is the numinous light.\nJade Guest is the name of the hall where the Three Primordials Lords reside.\nChild Dao-Kang is the name of the Peach Well-Being Lord of the Gate of Destiny.\nSummoning the Broad Realm means calling to ascend the vast desert realm.\nEarth Gate is the gate of yin demons.\nAssisting and defending refer to sealing the form, closing debts, turning the back to earth, and soaring into emptiness.\nLuminous Yang is the name of the White Prime Honored Spirit.\n\n*Great Cavern Cinnabar August Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Central One Cinnabar Prime Lord of the Crimson Palace**, named August Spirit Moving Pearl, styled Child South Cinnabar, also called Life’s Upper Elder, also called Scribe Cloud-Restrained. Ever guards the center of my crown, below the gate of the great vertebra’s head. The human spine has twenty-four vertebrae; the uppermost first vertebra is this.\n\n*Upper Clarity Purple Essence Three Simplicities Lord’s Scripture, Chapter Nine*\nPurple Essence nurtures the Flowering Grove,\neternally luminous beyond the Great Non-Existent.\nJade Chamber generates treasure-clouds,\nwithin the nine-fold womb’s interior.\nThearch-Guest presents the five talismans,\nthe Three Primordials return with the Purple Canopy.\nGranary Jade Refines Life,\nguarding this Long Night Assembly.\nFive Numinous traverse the talisman-registers,\nthe Nine Unities unite the Nine Origins.\nThree Mysteries emerge from Grand Clarity,\nPurple Yang sends forth ten thousand mysteries.\nMysterious Essence nurtures the Nine Numinous,\nPrimordial Father knits the Womb Immortals.\n\n\"Joyous Elder reins in, soaring Bright Worthies.\"\n\nPurple Essence is a tree in heaven—its leaves resemble bamboo but are red, its flowers resemble mirrors but are bright, its fruit resembles plums but has no pit. Eating its leaves averts hunger, its flowers prevent death, its fruit bestows flight as an immortal—this is called the Grove of Nurturing Flowers.\nNine-fold refers to the nine-layered gates, the dwelling of the Womb Venerable of the Thearch-One.\nThearch-Guest is the name of Left Immortal Zhongchengzi.\nThree Primordials are the Upper Primordial Mud-Pill, Middle Primordial Crimson Palace, and Lower Primordial Gate of Destiny.\nPurple Canopy is the name of the Yellow Court’s gate.\nGranary Jade Refines Life refers to the Black Qi Lord of the Nodes, named Refines Life, styled Granary Jade.\nLong Night is the name of the assembly of Black Qi at the nodes.\nFive Numinous are the Five Elder Lords.\nThree Mysteries are the Three Perfected of the Dao.\nPurple Yang is the name of an office.\nMysterious Essence is the name of the Eight Perfected within the gallbladder.\nNine Numinous are the nine souls of heaven.\n\n*Great Cavern Yellow Court Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Yellow Court Primordial King below the Gate of Destiny**, named Origin Bright Essence, styled Primordial Yang Prosperity, also called Origin Child Spirit, also called Concealed Bright Beginning, also called Infant Womb, also called Scribe Elder-Origin. Ever guards the gate between my two kidneys, below the axle. This is the twenty-fourth vertebra below the spine, connected to the tailbone and both legs and arm bones, moving and bearing the body like an axle for a chariot. This is the center of the waist and hips.\n\n*Azure Numinous Peaceful Yang Primordial Lord’s Scripture, Chapter Ten*\nAzure Numinous fans the eight qi,\ndrumming the wheels of the Three-Flower Citadel.\nDonning this, the womb’s knitting is complete,\nseven ancestors receive blessed life.\nKarmic opposition extinguishes the Five Paths,\neternally guarding the Thearch-One’s encampment.\n\n\"Gaze upon Prosperity, follow the ten thousand vapors.\"\n\nDonning means the meaning of shedding the body.\nFive Paths refer to the Five Sufferings.\nExtinguishing them is as the *Scripture of Spirit Generation* says: \"The five difficulties depart through principle.\"\n\n*Great Cavern Nine Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Nine Perfected of Mud-Pill**, named Thearch-True Supreme August, styled Thearch-Prior Spirit, also called Primordial Ancestor. Ever guards the four borders of my mouth. Envision this above the crown. The mouth spirit is also called Pure Tranquility Harmony.\n\n*August Clarity Cavern-True Great Dao Lord’s Scripture, Chapter Ten*\nDuke’s Son holds the five talismans,\nthe Great One resides in the Purple Chamber.\n\nBeneath the Three Convergences at Earth’s Gate,\ndraw forth the life from the Jade Thearch’s Palace.\nMaiden Yu Mozi guards the omen of the Seven Qi’s window.\nRestraining and regulating, the flourishing blood and fluids\nfill and satisfy the five viscera to abundance.\nThe Ten Perfected ascend the Yellow Chamber,\nthe Thearch’s Son transforms into a Golden Immortal.\nWhite Jade Flying Talisman summons,\nleading the ascent to Dragon Terrace Heaven.\nReturn to purity, fulfill; auspicious seeking, still.\n\nThe Duke’s Son is Nonexistent Hero Duke’s Son.\nThe five talismans are the Five Script True Talismans.\nThe Three Convergences: August Clarity Primordial Lady, the highest immortal among women;\nCavern-True Perfected, the highest immortal among men—\nthese are the alternate names of Female One and Male One.\nThe Two Perfected unite with the Great One to transform within the vast expanse,\nhence called the Three Convergences.\nEarth’s Gate is the Palace of Kun.\nYu Mozi is the inner name of August One’s Hun Maiden.\nThe Seven Qi refer to the seven emotions; another says the seven apertures—\nit is unclear which is correct.\nRestraining and regulating is the name of Nine Origin True Man.\nThe Ten Perfected: with tenfold wondrous conduct complete,\none ascends to the Supreme Yellow Chamber.\nDragon Terrace is the name of a heavenly palace.\n\n*Great Cavern Eight Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Eight Perfected of the Gallbladder**, named Uniting Radiance Lord, styled North Terrace, also called Mysterious Essence. Ever guards the mansion of my spine’s bone joints. Also named Majestic Luminance. The Cinnabar Thearch Lord guards the uppermost vertebra; the Yellow Court King guards the first vertebra below; the Seven Perfected of Mysterious Yang guard the upper seven vertebrae; the Seven Perfected of Mysterious Yin guard the middle seven vertebrae; the Eight Spirits of the Gallbladder guard the lower seven vertebrae.\n\n*Highest Supreme Primordial Lord’s Scripture, Chapter Twelve*\n\nThe Highest Supreme feasts in Purple Empyrean,\nthe Five Elders assist the Jade Root.\nPrimordial Purity brushes the subtle radiance,\nuniting the talisman before the Thearch-One.\nWhite Thearch is titled Vast General,\nreturning to the Golden Supreme Rosy Clouds Land.\nPassing beneath my Death’s Gate,\ndrawing forth from the Three Paths’ bridge.\nThe Ten Penetrations arise from this,\nwondrous conduct is perfected thereby.\nWithin the Cavern’s luminous radiance,\nthe Thearch-One’s true mystery is profound.\nHarmony returns, falling; knotting unfolds, eternal.\n\nThe Jade Root is the name of a mountain in heaven, or taken as the human nose.\nSubtle radiance is the name of the sun.\nWhite Thearch Vast General: the White Thearch moves the vast radiance’s qi\nwithin the Vast General’s palace.\nThe Ten Penetrations: when the ten true matters are complete,\nwondrous clarity achieves the Ten Penetrations.\nFrom one to ten, all are the numbers of heaven and earth.\nThis Dao transcends beyond heaven and earth;\nyin and yang cannot restrain it,\nsin and fortune cannot requite it.\nSurpassing the fixed numbers of heaven and earth,\nhence called the Ten Penetrations.\n\n*Great Cavern Left Seven Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\nBetween the left kidney dwell the Seven Perfected, named Dark Yang Lord, styled Mystic Radiance, also called Primal Birth, Dark Mystery, and the Five Thearchs. They ever guard the farthest reaches of my spine, beneath the Earth Gate.\n\n*August Sovereign’s Four Elders Dao-Middle Lord’s Scripture, Chapter Thirteen*\nAugust Sovereign transcends the formless,\nrevolving the Nine Luminaries into life.\nWhirling winds blend the Thearch’s heart,\nEight Qi circulate in constant peace.\nVast rosy clouds intermingle with divine heavens,\nFive Thearchs scatter the sun’s essence.\nFluids overflow the Dark Void’s desert,\nblood congeals, the Five Flowers level.\nThe body’s treasure is a perfect pearl,\nflowing radiance gleams, revealing its form.\nNamed Longevity’s Abundant Leisure,\nalso called Clarity’s Deep Pool.\nTogether they cross the Three Evil Passes,\nopen the register to ascend Great Darkness.\nLet me preserve the immortal perfected,\nseven generations don robes of green and azure.\nUntie calamities on the dark road,\nsurpass blessings to rise with dawn’s spirits.\nCross the world to ascend Jade Ministers,\nancestors return to the womb’s infancy.\nPeer through the unobstructed emptiness,\nfirst penetrate the living’s perfect clarity.\nBlack pearls string through square pupils,\nwithin and without, all is luminously clear.\n\nThree Joys profound, Five Gates open.\n\nThe Nine Luminaries are the sun’s name, or the eyes called solar wheels. Vast rosy clouds are the name of Jade Clarity Mountain. The Five Flowers are the five viscera. Longevity’s Abundant Leisure is a mountain of the Nine Heavens, the land called Extended Life. The Three Evil Passes are the demonic gates. Green and azure refer to absorbing the qi of Azure Flower. Ascending Jade Ministers means attaining the rank of Upper Minister in the Jade Bureau. Perfect clarity refers to the sun and moon. Three Joys profound, Five Gates open is the inner name of the August Sovereign in the Nine Heavens’ invocation. Some interpret it as the Dharma Wheel revolving on the path of rebirth.\n\n*Great Cavern Right Seven Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\nBetween the right kidney dwell the Seven Perfected, named Dark Yin Lord, styled Supreme Perfected, also called Upper Birth. They ever guard my lower spine, the gate of Jade Pass.\n\n*Jade Dawn Supreme Great Dao Lord’s Scripture, Chapter Fourteen*\nJade Dawn governs the Nine Heavens,\nSupreme Great Dao Lord.\nEver preserving the radiant transformations within,\nNine Revolutions mirror Upper Clarity.\nLoosening the sash in the Jade Seal Chamber,\nriding plainness to enter the Four Clarities.\nCarrying the sun’s central king,\nfeathered immortals join Jade Dawn’s spirits.\nGreat One summons celestial demons,\nThearch Lords gather the myriad spirits.\nPull free the accumulated qi of death,\nleap beyond to the immortal thearchs’ court.\nThearchs stand above the Three Passes,\nEight Winds dance with divine soldiers.\nLeft ladle the nectar of fortune,\nright grasp the chariot of primal blessings.\nPenetrate the subtle without obstruction,\nBrahma’s path connects luminous life.\nPiercing the forehead, hear the ten directions,\nvast and open, all sounds.\nProfoundly serene, crossing the Dharma’s decree.\n\nRadiant transformations refer to the Dao’s transformations of the Three Radiance. Nine Revolutions are the nine cycles of the golden elixir. Mirroring Upper Clarity means that with the Lesser Lad of Great Tenuity driving the feathered luminous chariot to pay court to the Origin Prime, it is like seeking one’s form within a mirror. The Four Clarities are the name of the Jade Thearch’s southern gate. Left ladle and right grasp refer to the left ear drawing water from the right kidney and the right ear drawing water from the left kidney. Brahma’s path connects luminous life means wondrously penetrating Great Brahma, attaining keen hearing and luminous spirit. Piercing the forehead to hear the ten directions means the spirit’s sound pierces the forehead, its resonance flowing through the cloud camps.\n\n*Great Cavern Six Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\nWithin the lungs dwell the Six Perfected, named Upper Prime Pure Jade Lord, styled Liang Southern Lad. They ever guard the outside of my neck, within the Twelve Interval Beams. The Twelve Interval Beams are the two sides of the lung’s cylinder. The neck has two columns, each with six great sinews. In the visualization method, one spirit guards two beams.\n\n*Supreme Clarity Great Dao Lord’s Scripture, Chapter Fifteen*\nSupreme Clarity floats in the absolute void,\nThree Heavens’ treasure divine talismans.\nWithin the sun, the Five Splendors open,\nAzure Thearch circles in constant nothingness.\nHolding the register, ascend Great Clarity,\nreceive the writ in the Golden Flower Tower.\nFive viscera plant the Jade Root,\nsoul and spirit unite in harmonious congealment.\nPenetrate emptiness, pure and tranquil,\nqi connects, life’s clarity arises.\nStable harmony, wondrous luminous awakening,\nmysterious breathing naturally grants long life.\nIllumine the pear, uproot the kalpa’s net.\n\nFloating absolute void is the name of Supreme Clarity Mountain, corresponding to the nose as the Central Marchmount. Great Clarity is the name of the solar palace. Golden Flower Tower is the name of Supreme Clarity’s tower. Jade Root is the name of the nose spirit. Mysterious breathing refers to the turtle’s method of drawing qi, using the ears rather than the nose.\n\n*Great Cavern Five Perfected Jade Talisman*\nRecitation of the Incantation:\n\nWithin the spleen dwell the Five Perfected, named Lord Nourishing Radiance, styled Master Great Granary, also called Master Feather Terrace. They ever guard my throat’s innermost gate, the Portal of the Utmost Root. Above it lies the transverse script, the true seal of Central Yellow. The Utmost Root comprises the Twelve-Storied Tower, encircled left and right by a pair of portals, each precisely aligned with the lateral apertures of the Qi Forehead. The Qi Forehead is named Terrace of Triple Reflection.\n\n*Dao Scripture of the Great Ultimate Lord of Primordial Effulgence, Chapter Sixteen*\nThe Primordial Effulgence King of the Great Ultimate,\nThree Heavens’ divine immortals converge.\nPurple Simplicity veils towering heights,\nserene they ascend to Upper Florescence Capital.\nUprooted from the Five Realms of Suffering,\nreturned to the womb of the Seven Primordials’ court.\nNine Mysteries unravel layered knots,\nancestral burdens shed their grievous names.\nLingering beneath Flourishing Florescence,\nreverent they summon the Five Spirits.\nThe adept’s body ascends the Jade Hall,\nthe Five Gods revert to infancy.\nTogether they cross beyond the Great Vast,\nnurturing purity to attend Round Clarity.\nPenetrating emptiness, pure and harmonious,\nFlorescence pervades, guiding the Mysterious Dark.\nRefining the Five Sprouts’ savor with the tongue,\nembracing goodness, exhaling longevity.\nRevolve Round Clarity, the spirit’s primal net.\n\nPurple Simplicity veiling towering heights refers to the name of the Left Primordial Lord. Florescence Capital is the abode where the Primordial Lord resides. Flourishing Florescence is the name of a mountain in the midst of heaven. Round Clarity is the name of the sun. Pure and harmonious refers to the mouth as the office of Supreme Harmony. Mysterious Dark is the name of the kidney spirit. Beneath the tongue lies the Flowery Pool, containing two apertures that descend to connect with kidney water—this is the Flowery Tongue, wondrously linked to Jade Florescence. \"Revolve Round Clarity, the spirit’s primal net\" is the inner name of the Effulgence Lord in the Nine Heavens’ incantation. Alternate interpretation: \"Radiant tread firmly secures the body.\" As seen in the *Great Cavern Scripture of Mount Mao*, celestial inner sound and earthly outer sound.\n\n*Great Cavern Four Perfected Jade Talisman*\nRecitation of the Incantation:\n\nWithin the liver dwell the Four Perfected, named the Azure Luminance Lord, styled Bright Wheel Lad. They ever guard the gate of my gastric tube, beneath the fatty membrane. Of the five viscera, only the heart and lungs reside above the diaphragm; now, storing the spirit lies beyond the stomach’s opening, at the gate of the gastric tube—where food is swallowed—the fatty membrane being the membrane of the vital regions. *Scripture of the Sovereign Primordial Purple Prime Lord*, Chapter Seventeen:\n\nIn the Sovereign Primordial Purple Prime’s midst,\nRadiant light thickens in the limpid empyrean.\nThe Three Heavens gleam with ninefold effulgences,\nSeparating and uniting the myriad lives of billions.\nClad in crimson kerchief and verdant auroras,\nAbove they circle the numinous Cold Lad.\nDrawing forth the five poisons of suffering,\nTranscending the body to pass beyond the Primal Azure.\nWhite Simplicity ascends the towering peaks,\nGolden gates ward the crimson hosts.\nThe seven ancestors’ accumulated corpse-knots,\nIn one transformation scatter and dissolve.\nReceiving blessings in the Eastern Auroral Chamber,\nReturning to the womb in the Vermilion Fire Court.\nThe Cavern Spirit’s pure disputation is wondrous,\nPower flows through from the self’s serene luminance.\nThe Pure Perfected’s hands grasp the Dipper,\nFeet tread upon the Nine Prime Stars.\nBrandishing control of Heaven and Earth’s gates,\nSpirit and life take root.\nThe issuance converges, the light’s motion endures long.\nThe nine effulgences: nine suns appearing as one.\nCold Lad: name of a mountain in the Nine Heavens.\nDawn Opener Towering Peaks: name of the White Simplicity Right Prime Lord.\nNine Prime Stars: the pivot of the nine numina.\nHeaven and Earth’s gates: the hands are Heaven’s gate, the feet Earth’s gate.\n“The issuance converges, the light’s motion endures long”: incantation of the Nine Heavens.\n\n*Great Cavern Three Perfected Jade Talisman*\nRecitation of the Incantation:\n\nThe Three Perfected of essence and blood are named the Primordial Life Lord, styled Mysterious Tranquility Lad. They ever guard the wellspring beneath my nostrils’ two apertures. Within the tip of the nose lies the Gate of Mysterious Reach—commonly called the nose’s apex. *Scripture of the Non-Ultimate Central Perfected Supreme Elder*, Chapter Eighteen:\n\nThe Non-Ultimate True Supreme Mystery,\nThe Mystery’s Primordial plain qi thickens.\n\nThe Pearl of Frequency-Borne Conveyance,\nIn fusion’s dawn the radiant morrow breaks.\nOrthodox Unity’s left and right immortals,\nEver embrace the Forest Void’s mystic gate.\nThe portent holds the Five Talismanic Registers,\nIn union with immortality attains the true covenant.\nThe hun-spirit arises within the Great Nothingness,\nThe po-soul too meets the Five Dao’s assembly.\nGeneration upon generation unties the knot of death,\nSeven ancestors know no lingering bondage.\nDivine wind blows through the womb’s tree,\nIts roots and leaves now severed utterly.\nThe womb’s host of ghostly calamities,\nThe Five Talismans unseal the earth’s knots.\nForever a divine perfected king,\nResponding to immortality, lineage spans ten thousand ages.\nThe Cavern Perfected’s pure and chastened form,\nThe Dao flows through nature’s uncarved substance.\nThe true response manifests in mutable forms,\nUnmoving, abides in the Yellow Chamber.\nManifestations know no fixed abode,\nBones and flesh become gold and jade in truth.\nSerene perfection illumines the upright Dao,\nTo old age and beyond, never alters.\nMaitreya’s chariot, great life’s glory shines.\nPlain qi thickens—termed the three hues: azure, yellow, white.\n*Frequency-Borne*: name of the Great One.\n*Fusion’s Dawn*: inner name of the Mud-Pill Palace Lord.\n*Radiant Morrow*: name of the White Simplicity Prime Lord.\n*Left Immortal*: named Zhongchengzi; *Right Immortal*: named Quwenzhi.\n*Forest Void*: name of the Central Mysterious Unity Elder, denoting the embrace of essence-qi within the Forest Void’s mystic gate.\n*Five Dao*: name of the celestial bureau’s officials.\n*The Five Talismans unseal the earth’s knots*: dispelling yin demons requires the Five Talismans to scatter the earth’s knots.\n*Yellow Chamber*: the Yellow Court.\n\n*Great Cavern Two Perfected Jade Talisman*\nRecitation of the Incantation:\n\nThe Two Perfected of the Stomach Duct are named Lord Firm Jade, styled Congealed Feather Pearl. They ever guard my Granary Palace’s storehouse, the gateway of the five intestines. The stomach is the Granary Palace, transmitting and conveying to the gateway of the five intestines. This gateway is the lower orifice of the stomach, where heart and lungs meet—termed the Five Gathered Heads, the entry point where the stomach receives food.\n\n*Central Yellow Elder Lord’s Scripture, Chapter Nineteen*\nThe Central Yellow Elder Lord,\nRound Flower Jade Longevity Spirit.\nGreatly unfolds the Upper Jade Gate,\nRelying on clouds three *ren* in brightness.\nCrimson radiance veils the boundless,\nCarrying the Great One’s Perfected.\nThe Emperor’s daughter embraces Steadfast Mound,\nChanting the Jade Clarity texts.\nFive Talismans weave the Purple Chamber,\nJade registers mark the Round Court.\nSeven ancestors return as womb immortals,\nEradicating the three paths of rebirth.\nFlowing winds sever blood stagnation,\nMysterious descendants attain Yellow Tranquility.\nCavern Mystery’s purity and origin,\nOriginal life’s numinous connection fulfills.\nNature and life’s root foundation stands firm,\nFilial Dao completes the Illuminated King.\nLife’s root attains Great Harmony,\nNon-action ascends Supreme Clarity.\nFull radiance arises, comet’s passage unobstructed.\n\nThe Central Yellow Middle Origin Lord is named Round Flower Yellow *Ren*, styled Great Unfolding Above, a celestial mountain called Jade Longevity Spirit. The Great One Perfected is the Great One’s Womb Venerable. *Embracing Steadfast Mound* is the inner name of the August One’s soul-daughter. *Mysterious descendants* refers to great-grandsons. The Three Perfected of essence-blood are named Yellow Tranquility Child Mystery. *Filial Dao completes the Illuminated King* means filial piety moves heaven: in the sun, one becomes the Filial Dao Illuminated King; in the moon, the Filial Dao Immortal King; and in the Dipper, the Filial Fraternal King. *Life’s root* is the root foundation of nature and life.\n\n*Great Cavern One Perfected Jade Talisman*\nRecitation of the Incantation:\n\nThe One Perfected of the heart is named Lord Heavenly Essence Fluid, styled Soaring Life Supreme Flower. Ever guarding the gateway of my chest’s four poles. Above the two nipples on the chest, at the very center—four *cun* above the heart’s *jiuwei* bone—is where the spirit resides.\n\n*Azure Essence Upper Perfected Inner Radiance Lord’s Scripture, Chapter Twenty*\nAzure essence’s upper flower qi,\nGreat Tenuity’s Mysterious Radiance Youth.\nSpirit transforms within the Jade Chamber,\nSoaring feathers escape the purple void.\nThe sun as Three Collars Intertwined,\nOffering talismans ascends the Emperor’s Rampart.\nUnlocking passes, grasping golden tablets,\nClosing doors, striking jade bells.\nAnnihilating demons in the Three Feng wilds,\nSummoning spirits to the Supreme Clarity Palace.\nEmerging from the depths of yin’s abyss,\nEntering essence’s Six Harmonies Chamber.\nReversing age to transform into hoary form,\nReturning to whiteness, nurturing the infant’s ignorance.\nCavern Origin’s pure and luminous light,\nSaliva sea possesses numinous potency.\nSwallowing fluids generates ten thousand spirits,\nSpirit water’s Flower Pool fuses.\nSurge through the body, irrigating and moistening,\nComing and going without end.\nCommunicating with life’s Dao source,\nHeaven’s root ever flourishes abundantly.\nSeed qi\n\nOpening the Passes corresponds to the human nose, regulating the breath to moderate the qi of Metal in the lungs. The Jade Bell refers to the gathering of spirits through tooth-clicking, as if striking the great treasure bell.\n\nThe Six Harmonies is the Hall of Light.\n\nThe Great Cavern’s Nine Primordial Jade Talisman\nIncantation:\nNine Primordial True Youth, named Ju Zhi, styled Three Yangs,\nEver guards beneath my left ear, at the Gate of Hidden Dawn.\nLocated two finger-widths below the left earlobe, slightly toward the rear.\n\n*End of the Upper Scroll of the Great Cavern Jade Scripture*\n\n*Beginning of the Lower Scroll of the Great Cavern Jade Scripture*\n\nThe Scripture of the Way of the Jade Worthy Primordial Lord of the Nine Qi of Grand Yang, Twenty-First\n\nGrand Yang transforms the Three Dawns,\nPurple chariot descends in subtle mystery.\nThe Primordial Lord protects the Valley Youth,\nGuarding the stomach, sealing the Earth’s Gate.\nGolden talisman blazes in Northern Florescence,\nJade contract unfurls for the Seven Ancestors.\nThe Emperor’s Perfected pours forth upper life,\nSevering my suffering of the Three Paths.\nCavern Clarity’s pure and luminous light,\nThe Emperor’s heart communes with Grand Mystery.\nThe wisdom of past lives’宿命,\nWithin the root-source’s primordial origin.\nFuture and others’ minds,\nAll fuse without obstruction.\nCavern Source and Cavern Clarity,\nThe myriad Dao arise from this communion.\n\nAt the meeting of life’s inception,\nIn the profound midst of harmony.\n\nYuchen is the name of a palace.\nWeixuan is the name of the sun spirit.\nBaogu Tongzi is the name of the Primordial Lord’s essence-spirit.\nBeihua is the name of a pavilion.\nDongyuan and Dongming refer to this heart as the numinous source of the Great Cavern, the spirit-light of the Great Cavern.\n\nThe Jade Talisman of the Great Cavern Sovereign Unity\nIncantation:\n\nThe Sovereign Unity’s Spirit-Maiden,\nNamed Shanggui, styled Dizǐ,\nAlso called Yumozi, also called Baodingling.\nShe ever guards beneath my right ear,\nAt the Gate of Hidden Dawn.\nLocated two finger-widths below the right earlobe,\nOne fen toward the rear.\n\nThe Scripture of the Nine White Golden Flower Radiance Primordial Lord, Chapter Twenty-Two\nIn the Great Beginning’s ninefold white qi,\nQi emerges amid the Flower Radiance.\nThe Dharma altar unfurls the immortal banners,\nAs the Five Venerable Elders pace in measured steps.\nThe Lady named Qizhu,\nHolding the register, returns to the Purple Chamber.\nFather Ning resides in Huiming,\nMerging with the Grand Tenuity Lad.\nCavern Clarity’s dark wisdom,\nThe vast measure shares the profound mystery.\nRoot and dust wholly dissolve,\nBeing and nonbeing both become emptiness.\nWondrous practice completes the True Unity,\nNamed the Great Mind’s divine penetration.\nThe Dao perfected, one ascends to Jade Clarity,\nRanked as a Sage Immortal Duke.\nDark Pervasion next, Trust Illumination all.\n\nFlower Radiance is the name of a palace.\nQizhu is the name of the spirit of the Flowing Gush Pool.\nFuningzai is another name of the Sovereign Unity.\nZuohuiming is the style of the Primordial Father Lord of the Upper Mystery.\nRoot and dust dissolved refers to possessing the Dao-eye, Sage-ear, Mystery-nose, Flower-tongue, True-body, and Sovereign-heart.\n\nThe Jade Talisman of the Purple White Great Cavern\nIncantation:\n\nPurple White Left Primordial Lady, named Yi Yu Wu Ren, styled An Lai Shang. She ever guards the realm of my head and face. The Eight Luminaries of the Upper Region: the spirit of the teeth, the spirit of the hair, the spirit of the skin, the spirit of the eyes, the spirit of the crown marrow, the spirit of the ears, the spirit of the nose, and the spirit of the tongue.\n\nThe Twenty-Third Scripture of the Dao of the Nine August Upper Perfected Lords of Life:\nThe Primordial Beginning conferred upon Great Mystery the Treasured Pearl of Cang Hu Jie. The wondrous tones of Tan Chi’s tuning-hook, subtle sounds penetrating the Great Void. The qi of the Nine August Upper Perfected, the Four Controllers and Great Immortal Kings. Flying auroras scatter the sun of heaven, congealing radiance in the chambers of the Six Harmonies. Ascending to Jade Clarity at dawn’s court, riding the light amid the morning brilliance. The Three Spirits are named Fa Niu, bearing the register to summon the Void Sovereign. Transcendent records ascend to Purple Clarity, golden talismans inscribed in the Feather Palace. Crowned with the Dark Pearl of Cang Hu Jie, vast salvation ascends to Universal Radiance. Conveying and measuring those within the Mystery. Swallowing and savoring the Five Directions. Gathering and coalescing into the Womb Immortal, the Cinnabar Mother and Golden True Yang. Host and companion unite in the Primordial Model, the Great Change gives birth to the Mystery Realm. Governing the hall and courtyard, the Primordial Subtle Spirit.\n\nCang Hu Jie is the name of the Treasured Pearl. Great Immortal King is the title of the Lord of Life, commanding the Four Controllers. The Six Harmony Chambers are the chambers of the Hall of Light. Morning Brilliance is the name of a palace. Fa Niu is the name of the spirit within the blood. Feather Palace is the dwelling of the water spirits. Universal Radiance is the name of the Great Cavern’s hall. Golden True Yang is the Heavenly Father. It refers to the Heavenly Father and Earthly Mother uniting to form the Womb Immortal. The Primordial Model refers to Tan Chi’s tuning-hook. Governing the hall and courtyard, the Primordial Subtle Spirit, is the invocation of the Nine Heavens.\n\nThe White Talisman of the Great Cavern\nIncantation:\n\nYellow White Middle Primordial Lady, named Yuan Hua Huang Ren, styled Da Zhang Sheng. She ever guards the realm of my chest and abdomen.\n\nThe Twenty-Fourth Scripture of the Dao of the Heavenly August Upper Perfected Jade Flower Three Primordial Ladies:\nThe qi of the Heavenly August Upper Perfected, the Three Primordials ride the divine chariot. The Dharma Terrace arises in Vermilion Empyrean, the August Emperor flourishes, opening the Jade Gates. Drawing forth the Gate of Life within the household, untying the knots of the Peach Health Stairs. Gathering the spirits to preserve the Five Fortunes, transcending and turning to enter Grand Tenuity. Single entry yet dual cultivation, a single melody of the Water and Heaven thoroughfare. The sea sun rises from the east, the Primordial Mandate gives birth to the Great Beginning. Preserving and untying, knotting the Six Courts.\n\nThe Heavenly August Upper Perfected is the mother of the Jade Flower Immortal Maidens. Divine Chariot is the name of a carriage. Fa Tan is the name of the heart spirit. Vermilion Empyrean is the palace of the heart spirit. Di Chang is the inner name of the Nine Perfected within the Mud Pill Palace of the Upper August, the Jade Gates of the Treasure Pavilion. Single entry yet dual cultivation refers to Heaven One generating Water, then Earth Two generating Fire, the meaning of dual cultivation of nature and life. Heavenly Thoroughfare is the path of the northwest celestial gate.\n\nThe White Talisman of the Great Cavern\nIncantation:\n\nThe White Primordial Right Lady, named Qiming Xiao Ren, styled Upper Golden Gate, constantly guards my lower pass realm—from the lower abdomen to the soles of the feet. The Lower Cinnabar Field lies three inches below the navel, its form square and round, one inch in dimension, the repository where men store essence and women nurture the fetus. The Earth Pass is the name of the feet.\n\n*Taiyi Upper Primordial Forbidden Lord’s Scripture*, Chapter Twenty-Five:\nThe Supreme Upper Primordial Lord, the Youth Who Governs Fate at Noon,\nRadiant with divine brilliance, dons auroral robes to ascend the Emperor’s Ramparts.\nArrayed upon the Thunder Spirit’s mat, merging within the Five Solar Chambers,\nWhite qi nurtures Shangsheng, the Azure Lord presses Yanchang.\nTo the left, he carries Jing Shangmen; to the right, he embraces Hehe Ying.\nMy body births the splendor of sun and moon, befriending the Scarlet Qi King.\nEight luminaries illumine the Mud Pill Palace, brightly shining within the Grotto Chamber.\nThe Infant is the Red Child, Hunli gives birth to a jade countenance.\nThe Five Paths adorn with golden blossoms, enthroning him as an Upper Clarity Duke.\nSeven ancestors sever dark stagnation, his body ascends upon the divine wind.\nWandering above the Three Clarities, harmoniously he returns to infancy.\nThe Three Qi of the Great Beginning cycle, true scriptures inaugurate radiance.\nCinnabar brilliance flourishes; the Left Imperial Root.\nThe Youth Who Governs Fate is styled the Scarlet Qi King,\nHis inner name is General Liang, the supreme spirit of the noon sun.\nThe Emperor’s Ramparts are the Golden Ramparts Hall of the Jade Emperor.\nThe Thunder Spirit’s mat refers to the Thunder Spirit talisman, upon which one may bow, sit, or recline.\nYanchang is the name of the Azure Qi Lord of the Central Knot.\nJing Shangmen is the name of the Black Qi Lord of the Nodal Center.\nThe Red Child is the Mysterious Congealed Heaven, the name of the Supreme Emperor of the Uppermost Heaven.\nHunlizi is the name of the Scarlet Qi Lord within the blood.\nThe Five Paths is the name of a palace. Golden Blossom is the name of a mountain.\n\n*The Great Cavern Noon Sun Jade Talisman*\nRecite the incantation in silence:\n\nThe Noon Sun Controller of Fate,\nnamed Jiesheng, styled Tongling,\nalso called Shangjing, also Yuanguang,\nalso Miaojing, also the Nine Luminaries,\nalso Weixuan, also Yaoluo Controller of Fate Youth—\nstyled the Scarlet Qi King,\nhis inner name is General Liang,\nthe supreme spirit of the noon sun.\nHe ever guards the Gate of Dao-Permeation on my left hand.\nWithin the hollow of the left palm lies a gate.\n\n*The Daoist Scripture of the Primordial Void Yellow Chamber, Chapter Twenty-Six*\nWithin the Primordial Void Yellow Chamber,\ndwells the Yellow Tranquility Youth.\nTo the left stands the Firm Jade Lord,\nto the right, the Imperial Prosperity Sovereign.\nFloating clarity veils the morning qi,\nwhile the flourishing Void-Spirit assumes its form.\nThe Azure Liver Bright Wheel Youth\nopens and illumines the Eight Keens.\nGrand Unity Chouqiu Lan,\nbearing the talisman, enters the Jade Palace.\nHe absolves the sins of seven generations,\nrestoring the origin to await great communion.\nMerging within the Emperor’s One Chamber,\nthe Five Elders transform into youths.\nAt the dawn of the Great Simplicity’s Brahman conduct,\none virtue fuses the Four Golds.\nThe qi of world-transformation—\nthree paths ascend.\n\nThe Yellow Chamber is the domain governed by the True Morning Lord.\nThe Yellow Tranquility Youth is the name of the Three Perfected of essence and blood.\nThe Firm Jade Lord is the name of the Two Perfected of the stomach conduit.\nThe Imperial Prosperity High Sovereign is the inner name of the Nine-Nine Perfected.\nThe Void-Spirit is the cognomen of the Valley Spirit.\nThe Bright Wheel Youth is the name of the Four Perfected within the liver.\nThe Eight Keens are the Eight Sceneries.\nChouqiu Lan is the inner name of the Grand Unity Imperial Honored One.\n\n*The Great Cavern Moon Jade Talisman*\nRecite the incantation in silence:\n\nThe Moonlit Peach Lord is named Yingzi, styled Yun Jing.\nThe Azure Thearch’s Mother is titled Fragrant Radiance Infant.\nThe brilliance of sun and moon is called Bright Bright and Perfect Illumination.\nShe eternally guards the Gate of Dao-Communion on my right hand.\nWithin the right palm’s curve, at the heart of the curve, dwells the spirit.\n\n*The Great Ultimate Lord of the Four Perfected, Scripture of the Dao of the Perfected Lords, Chapter Twenty-Seven*\nThe Great Ultimate Lord of the Four Perfected,\nsoars on feathered ease to the Upper Clarity.\nSeven revolutions summon the Controller of Destinies,\nthe Great One displays majestic illumination.\nThe Registrar safeguards the stored destinies,\nthree ascents mount the Thunder Numinous.\nDemon kings come to receive their duties,\nimmortal officials bind ghostly essences.\nThe Azure Thearch’s Mother in the moon\nis titled Fragrant Radiance Infant.\nThe Great Unfurling Above is the name of the Central Yellow Primordial Lord.\nPeaceful Arrival Above is the name of the Left Purple Primordial Lord.\nWithin the Six Harmonies, the Grotto Chamber arrays the Fire Soldiers.\nThe Great Ultimate’s Fivefold Numinous Surge—\nthe Horizontal Script is the true seal of the Central Yellow.\nThe Thearch of the Yellow holds this script\nand becomes lord of the myriad spirits,\nwhile all the Heavenly Thearch’s sons\nbecome immortal guests.\n\n*Great Cavern Solar Radiance Jade Talisman*\nRecite the incantation in silence:\n\nLeft Eye Lad is named Lingfei, styled Yangguang, ever guarding the pupil of my left eye.\n\n*Dao Scripture of the Four Dipper Central Perfected Seven Mornings Scattered Blossoms Lord, Chapter Twenty-Eight*\nWithin the Dipper dwell four Perfected,\nscattering blossoms at Jade Clarity Terrace.\nThe Thearch’s Minister of the Central Mystery gives birth—\none turn and all Perfected come.\nFragrant winds fan the Three Treasures,\nthe five viscera reflect Clear Yi.\nAzure Hu’s radiant splendor,\nsandalwood’s blazing auspicious hook.\nThe Great Central’s six qi pure,\nthe winding waters of the Celestial River ascend.\nGreat Merit’s completion,\nthe Five Demons fell the Six Yin.\nWithin, the Primordial King of Yuanshi knots,\nloftily beholding the Six Harmonies’ court.\nFreshly winding mystery,\nmirrored layered chariots.\n\nThe Four Perfected are the gods of the Four Dippers. Central Mystery Born is the name of the Mud-Pill Palace’s Thearch Minister. The Three Treasures are a mountain’s name. Clear Yi is a palace’s name. Ascend means to rise. The waters of winding springs flow downward to Northern Feng, rising to become the Celestial River, ascending through the Southern Dipper. Mastering this Dao, the sunken all rise. The Five Thearchs’ Great Demons fell the Six Yin, and yang returns to the Six Palaces.\n\n*Great Cavern Yin Essence Jade Talisman*\nRecite the incantation:\nRight Eye Lad is named Chenying, styled Yinjing, ever guarding the pupil of my right eye.\n\n*Dao Scripture of the Chen Central Yellow Radiance Primordial Lord, Chapter Twenty-Nine*\nWithin Chen, the Yellow Radiance’s qi,\nthree elegances ascend the dawn court.\nAzure Terrace flies feathered wheels,\nwelcoming and extending—Dao now complete.\nThe Director of Destinies presents the Thearch’s script,\nstyled Mystic Merit Minister.\nPreserving life at Great Rosy Cloud Palace,\narrayed as guests in Upper Clarity’s hostels.\nThe Gate of Destiny joins essence to extend,\nguarding my body’s Yellow Peace.\nLeft, he grasps the Primordial Essence Lord,\nright, he seizes the Vermilion Luxuriance Spirit.\nGreat Harmony crosses the Seven Awakenings,\nstriking fire to generate true script.\nPurple Blossom’s Crown Embryo Immortal,\nPrimordial Destiny’s Perfected Central Spirit.\nCommanding destiny’s root,\nascending Dragon Ford.\n\nThe Three Elegances are a mountain’s name. Azure Vastness is a terrace’s name. Welcoming Extension is a talisman’s name. Mystic Merit Minister is the Director of Destinies’ Venerable Lord’s name. Joining Essence to Extend is Peach Vigor Lord’s name. Yellow Peace Child Mystery is the name of the Three Perfected of essence and blood. Primordial Essence Lord is the name of the Peerless Lad. Vermilion Luxuriance Spirit is the name of the Right White Primordial Venerable Spirit. The Seven Awakenings are the fire’s completion number. Moreover, *li* is fire, and from its luminous brilliance emerges the secret of the Cavernous Crimson Script. The Crown Blossom Embryo Immortal means the three blossoms gather at the crown, the embryo knits to form an immortal. The Perfected Central Spirit is the yang spirit within the Perfected.\n\n*Great Cavern Embryo Immortal Jade Talisman*\nRecite the incantation:\nLung Department Lad is named Suming, styled Xucheng, ever guarding below my lung department.\n\n*Dao Scripture of the Golden Watchtower Posterior Sage Supreme Peace Li Perfected Celestial Thearch Upper Radiance Lord, Chapter Thirty*\nThe Golden Watchtower’s Upper Radiance qi,\nten directions gleam with purple mist.\nThe Three Destinies’ Grand Unity Venerable,\nFive Summonses call the Supreme Peace spirits.\nSeven Turnings summon the Peak Perfected,\njade talismans announce to the Three Officials.\nExtracting the register from the Three Spirits below,\nreceiving life in the Highest Dawn.\nThe Grand Spirit Eightfold Spirit King,\none transformation returns felicitous clouds.\nPeach Lord guards the Six Harmonies,\ninscribing essence to defend the Mud-Pill Palace.\nGreat Clarity’s Eightfold Radiance Contemplation,\nthe Ten Virtues’ true script proclaimed.\nPreserving your child, Spirit within Spirit,\nPrimordial Destiny arises naturally.\n\nRadiance extending inscribed,\nattaining solar worthies.\n\nThe Golden Watchtower is the lung. The Grand Unity Embryo Venerable manifests as needed; the Supreme Peace Posterior Sage naturally communicates with spirits. The Peak Perfected are the host of Perfected of the Five Peaks. Proclaiming jade talismans to the Three Officials Thearchs, removing death registers from the Three Spirits’ divine realm, one then receives life in the Highest Dawn Palace. The Eightfold Spirit Lord is the name of the Grand Thearch’s essence and soul. The Six Harmonies are the name of the Bright Hall. Inscribing essence and Mud-Pill Palace are the names of the Thearch Minister. The Eight Radiance are the names of eight spirits.\n\n*Great Cavern Embryo Spirit Jade Talisman*\nIngest the talisman and silently recite the incantation:\nWithin the embryo, the One Primordial White Qi Lord is named Wuxuanzi, styled Yushangsheng. The Grand Unity’s essence and soul is named Xuanguizi, styled Shengchang, titled Eightfold Spirit King. These two spirits ever guard above my five viscera, at the root gate of the throat’s junction.\n\nThe throat’s junction is also called Golden Tower, also called Layered Tower, also called Three Thoughts Terrace. Twelve spirits reside within, including Pavilion Leader Perfected, who governs the communication of upper and lower qi.\n\n*Dao Scripture of the Supreme Void Posterior Sage Primordial Radiance Peng Chamber Perfected Lord, Chapter Thirty-One*\nSupreme Void’s empty radiance,\nwithin rosy clouds lies Peng Chamber.\nNine clouds seal layered gates,\nthe Thearch Lord stills in profound secrecy.\nEight Perfected join Radiance Lord,\nabove, they grasp the Female Grand Unity.\nMale and female blend in Jade Chamber,\nnine transformations return to seven.\nDispersing forms throughout the Six Harmonies,\nthe Mud-Pill Palace’s distinctions shift.\nThe Grand Perfected’s Ninefold Light Wheel,\nTen Abodes’ script knots.\nPreserving your child’s Primordial Qi flows,\nthe five qi govern Central Jie.\nBlending as one to return to the Thearch’s watchtower,\neternal life without end.\nTransforming to fly into Upper Clarity,\nthree thousand practices transcend.\n\nThe Wheel ascends,\nentering the profound lineage.\n\nEmpty Radiance is a mountain’s name. Peng Chamber is Peng Lord’s chamber, within which resides the talisman for extending life. Layered gates are doors. Joining Radiance Lord is the name of the eight Perfected within the gallbladder. The Ten Abodes are the Ten Grounds; one pertains to yang. Briefly passing the brush to the right makes it yin—this is the origin of coupling. This speaks of script, precisely capturing the meaning of reversing yin to yang. Governing Central Jie means governing the five qi within, blending the hundred spirits; *jie* means ascending.\n\n*Great Cavern Central Knot Jade Talisman*\nRecite the incantation:\nCentral Knot Azure Qi Lord is named Anyanchang, styled Heheying. The Primordial Lord’s essence and soul is named Baogu Tongzi, styled Mingguang. These two spirits ever guard below my five viscera, above the stomach’s upper opening.\n\nDirectly pointing to the stomach’s opening, visualize its spirit within the stomach’s opening. Previously mentioned were the two Perfected of the stomach tube, visualizing their spirits outside the stomach’s opening.\n\n*Dao Scripture of the Supreme Mystery Capital Nine Qi Venerable Lord Master Immortal Lord, Chapter Thirty-Two*\nAbove the Supreme Nine Qi,\nmist swirls between Great Radiance.\nDivine light adorns empty peaks,\nthe Five Paths illumine the Three Heavens.\n\nRiding the light to ascend the utmost heavens,\nborne on the wind to disperse stagnant spirits.\nThe Central One is called \"Moving Pearl,\"\ngoverning the heart to enter serene repose.\nMerging the Three and Five Palaces,\ntransforming through countless eons.\nSevering the roots of the fetal tree’s growth,\nforever cutting the blood-corpse’s origin.\nSeven ancestors disperse accumulated stagnation,\nreturning to the obscure mystery of flourishing darkness.\nMyriad qi generate myriad channels,\nall equally transmuting into immortals.\nThe Supreme Mystery initiates the Ten Illuminations,\nwondrous practices ascend the Ten Perfected.\n\nWithout obstruction, the light serves the divine void.\n\nThe Supreme Mystery Capital lies above the Nine Qi;\nthe Nine Qi are the incense of returning souls.\n*Great Radiance* is the name of a palace.\n*Empty Peak* is the name of a mountain.\n*Five Paths* is the name of a palace.\n*Dispersing Stagnant Spirits* is also the name of a mountain.\n*Moving Pearl* is the name of the One Perfected within the heart.\nMetal, wood, water, and fire,\nmerged with earth, are called the Three-Five Palace.\n\n*Great Cavern Central Knot Jade Talisman*\nRecite the incantation:\nCentral Knot Black Qi Lord is named Binlaisheng, styled Jingshangmen. The Imperial Perfected’s essence and soul is named Youtaiwang, styled Guanshangsheng. These two spirits ever guard the opening of my nine intestines, below the *fubo* (hidden beam).\n\nThe opening of the nine intestines is where the urine exits; the *fubo*’s lower gate is the junction between the large and small intestines. According to the secret instructions: the *fubo*’s lower gate lies behind the scrotum and before the anus, at the center between the two yin.\n\n*Dao Scripture of the Highest Clarity Eight August Lords, Chapter Thirty-Three*\nBeyond the utmost clouds of Highest Clarity,\nthe Eight August Lords revolve the Nine Heavens.\n\nWithin the profound solitude, the Imperial Heir is born,\nbearing transformation to those who dwell in radiant light.\nAt dawn, they ascend the Great Elder’s repose;\nat dusk, they feast in the Golden Flower’s ease.\nWith feathered tablets, they summon the Great One;\nwith brocade talismans, they call forth the myriad spirits.\nThey strengthen my dark-womb immortal,\nhewing away the roots of the placental tree.\nThey unbind the knots of the seven ancestors,\ndispersing calamity to pacify the nine lineages.\nThe Crimson Emperor’s cinnabar numen stands firm,\naiding the omen to enter the Golden Gate.\nThe Moon Mother’s numinous white orchid\nguards and seals the Gate of Death’s radiance.\nFrom this day forth, the qi of death is cut off;\nthe essence of life henceforth extends.\nThe myriad spirits and dark immortals,\ntranscending, become Perfected Kings of their stations.\nThe ten Perfected complete their wondrous practice,\nthe Great Mystery unites the luminous and the yang.\nThe Supreme Great Cavern Venerable,\none qi harmonizes with Dragon Radiance.\nIlluminating the kalpas, bridging the severed.\n---\n\n*Great Cavern Womb-Center Jade Talisman*\nRecite the incantation in silence:\n\nThe Great One Lord, styled Profound Solitude Prime,\nat dawn ascends the Great Elder’s repose—an allusion to the origin of spleen-earth;\nat dusk feasts in the Golden Flower’s ease—further alluding to the fluid of lung-metal.\n*Danling* is the name of a terrace.\n*Lingsu Lan* is the title of the Moon Mother.\n*Mingyang* is the name of a jade hall.\n*Longguang* is the name of a chariot.\n\nThe Womb-Center Yellow-Silk Lord,\nstyled Ancestral Bright Chariot, named Spirit of the Primal Ultimate.\nThe Celestial Emperor’s essence-soul,\nstyled Regulator of the Hidden Treasury, named Dharma-Circulating Pearl.\nThese two spirits ever guard within my small intestine,\nthe root of its two apertures.\nAt the small intestine’s end, the womb-pouch is bound.\nThe womb has one cord, joined within the lower abdomen;\nits right cord governs the passage of water,\nits left cord leaks forth the essence’s radiance.\nThus are the two apertures of desire.\n\n*Scripture of the Highest Dawn, Master Jade Protector King Azure Lad, Eastern Florescence Fangzhu Palace, Chapter Thirty-Four*\nEastern Florescence emits its first light,\nHighest Dawn illumines Supreme Purity.\nThe Cavern shines with the halo of the Round Pearl,\nlucid and bright, the Purple Luminary gleams.\nSeven spirits return to the Emperor’s seat,\nFive Elders soar on jade wheels.\nThe Supreme One, King within the Radiant Scene,\nController of Life commands the ten thousand spirits.\nFloating amid cloud-waves, silently gazing toward\nthe Mud-Pill Palace’s city.\nSeven revolutions summon the Three Officials,\nthe Northern Lord bows in reverent presentation.\nThe Five Marchmounts answer the summons and arrive,\nerasing death to inscribe long life.\nThrice raising the Thunder-Spirit Talisman,\nmystically dissolving the great demonic essences.\nSeven ancestors are born into the Hall of Fortune,\nMysterious Florescence safeguards Yellow Tranquility.\nObserve the carriage’s repose, the luminous guest’s flourishing—\n*First Light* is the land of the sun’s rising,\n*Highest Dawn* is the name of a palace.\n*Round Pearl* and *Purple Luminary* are both names of the sun.\n*Yellow Tranquility* is the name of the Three Perfected of essence and blood.\n\n*Great Cavern Blood-Center Jade Talisman*\nRecite the incantation in silence:\n\nThe Blood-Center Crimson Radiance Lord,\nstyled Blended Unity, named Uncle Preserver of Firmness.\nThe Controller of Life’s essence-soul,\nstyled Hair-Knot Unity, named Celebrant of the Mysterious.\nThese two spirits ever guard my hundred joints’ blood,\nbelow the severed nodes.\nThrough kalpas receiving form,\nnone has not been constituted by essence and blood.\nThus, if the nodes remain knotted and unresolved,\nthe Dao of immortality is difficult to achieve.\nThe Scripture states: “The gate of the severed bones of both legs\nlies below the joints of the leg meridians,\noutward toward the depression beneath the ankle bones—\nthis depression is called the Gate of the Severed Bones.”\n\n*Scripture of the Nine Elder Immortal August Lords of Fusang, Great Emperor, Chapter Thirty-Five*\nThe Great Emperor and Nine Elders of the Capital\nreview the immortals and ascend Fusang.\n\nSeven Cycles summon the Heavenly Thearch,\nLife’s Controller upholds the divine net.\nThe Five Marchmounts open the numinous gate,\ntransmitting commands to the Great Demon Clan.\nRivers and seas all receive their charge,\nestablishing the responsive meeting ground.\nPreserve the talisman within the Mud-Pill Palace,\nguard the spirit named Peach Prosperity.\nReverse the radiance to alter the Register of Death,\ninscribe the immortal Uncle Fire King.\nExtract the three paths’ afflictions,\nbanish calamity to birth the Supreme Hero.\nSeven Mysteries ascend the Vermilion Palace,\nthe myriad bodies converge in Luminous Yang.\nAbove befriend Square Fullness Lad,\nbelow carry Principle’s Hidden Treasury.\nOn the left seize Bright Chariot Lord,\non the right assist Returning Prosperity.\nUnite the Jade Radiance qi,\ntransforming the myriad auspiciously to strength.\nReturn to infancy as the Primordial Life Youth,\nsandalwood blazes the auspicious hook.\nHeaven’s One, Primordial Root Immortal,\nself-so in the Wheel of Light.\nThrough kalpas revolving,\nharmonious jade ascends.\n\nThe Capital is the Mountain of Jade Capital.\nThe Numinous Gate is a talisman’s name.\nUncle Fire King is the name of the Lower Mystery’s Primordial Mother Lord.\nThe Supreme Hero is the name of the One True within the heart.\nThe Vermilion Palace is the courtyard of flowing fire.\nLuminous Yang is the Jade Hall.\nSquare Fullness Lad is the name of the Peach Lord of the Moon.\nPrinciple’s Hidden Treasury is the name of the Heavenly Thearch’s essence-soul.\nAncestral Bright Chariot is the name of the Yellow Qi Lord within the womb.\nReturning Prosperity is the name of the Great One’s essence-soul, Mysterious Return Lad, styled Prosperity.\n\n*Great Cavern’s Seven Spirit Jade Talismans*\nRecite softly when ingesting the talisman:\nUpper Mystery’s Mysterious Father Lord,\nnamed Lofty Co-Birth, styled Left Revolving Radiance.\nLower Mystery’s Primordial Mother Lord,\nnamed Uncle Fire King, styled Right Revolving Light.\nAugust Thearch Great One Lord,\nnamed Heavy Dark Void, styled Profound Silence.\nNine August Honorable Lords,\nnamed Sunlight True, styled Flying Multitude Thearch-Born.\nGreat Thearch’s Essence-Soul,\nnamed Yang Hall King, styled Eight Numinous.\nHeavenly Thearch’s Nine Passes Opening Soul Lord,\nnamed Revolving Record Dao, styled Utmost Dark.\nHeavenly Register’s Thearch-Soul Great Demon King,\nnamed Illuminating Non-Obstruction, styled Vast Spirit.\n\nThese seven spirits ever guard the root of my original destiny,\nthe womb’s primordial knot.\nThe root of original destiny is the navel wheel,\nthe root-stem of qi’s division between child and mother.\nThe womb’s great knot lies within the navel,\nconnected to the kidneys, the gate of the embryo’s formation.\nThe inner and outer palaces of the Gate of Destiny:\nwithin one inch of the navel lies a band leading to the Gate within the Cinnabar Field,\nthe place of the embryo’s formation.\nThe outer palace refers to the exterior of the kidneys,\nthe inner palace to the interior of the navel—\nthey are but one locus.\n\n*Lesser Cavern Jade True Myriad Flowers Master’s Diagram Jade Lord Scripture, Chapter Thirty-Six*\nWithin the Jade True Myriad Flowers Palace,\nlofty immortals conceal the Thearch’s scriptures.\n\nThe Chart Master governs the nine heavens’ outer realm,\npenetrating insight births from the formless void.\nSeven revolutions summon the myriad perfected,\nthe Five Marchmounts arrive at once before the court.\nThe Three Officials summon the host of demons,\nthe Registrar examines what is presented.\nExtracting names from the Yellow Springs’ crooked depths,\nimmortal titles are inscribed in the Great Clarity.\nSeven generations’ bonds are untied,\ndefiled blood ceases its sinking decay.\nReturning to the Cinnabar Fire Chamber,\none receives anew the cavern spirits’ numen.\nElder Scribe guards the divine body,\ncommanding me to preserve Yellow Tranquility.\nUnite with the Thearch’s Elder,\nthen transcend to congeal the primordial.\n\nThe Chart Master is the Jade Lord who governs charts and records in the nine heavens. The Cinnabar Fire Chamber is the Vermilion Numinous Fire Chamber. Elder Scribe is the original name of the Infant Child. Yellow Tranquility is the name of the Three Perfected of essence and blood.\n\nThe Great Cavern’s Nine Spirit Jade Talisman.\nWhen ingesting the talisman, silently invoke:\nThe Three Primes Elder Lord, named Lao Zhangshang, styled Divine Birth Dao.\nThe human’s inner spirit is named Green Chamber,\nwhich is Laozi’s Mysterious Female.\nIn medical classics, it is the Conception and Governor Vessels;\nin Daoist practice, it is the human center—\nyet the world knows not the mechanism of its pivotal juncture.\n\nThe Orthodox Unity Left Immortal is named Zhongchengzi, styled Fourfold Flower Venerable, also called Thearch’s Guest.\nThe Orthodox Unity Right Immortal is named Quwenzi, styled Numinous Harmony, also called Radiant Worthies.\nThese three spirits ever guard my philtrum.\n\nThe nose spirits are named Feather Child, Bright Beam, Ward-Off-Wrong, Jade Root, Numinous Portal, and Open Pass.\nThe Central Mysterious One Elder Lord is named Lin Xufu, styled Numinous Timely Dao,\never guarding the orifice of essence-transmission.\n\nNine Bends and Lower Gate are the human’s yin.\nIn men, it is called Nine Bends; in women, Lower Gate.\nThe Northern Dark Thearch is named Baochengchang, styled Northern Campaign,\never guarding within the bladder.\nThe bladder lies before the small intestine and womb,\ntransmitting to both sides, intimately connected.\nThus when the small intestine is full of water,\nthe bladder’s lesser yang qi steams it,\nwhereupon the water within the intestine\nfollows the yang qi through the womb and transforms back into water.\n\nThe Western White Thearch is named Zhang’anxing, styled Western Florescence,\nalso called Soaring Brahma Seven Spirits,\never guarding men’s external kidneys and women’s two breasts.\nThe Southern Vermilion Thearch is named Changlaijue, styled Southern Harmony,\never guarding beneath the tongue within the mouth,\nwhere the Flower Pool’s waters lie.\nThe Eastern Azure Thearch is named Diaoliangji, styled Azure Balance,\never guarding the exterior of the five viscera.\nThe fat membrane is the diaphragm.\n\nThe five viscera—only the heart and lungs reside above the diaphragm. The Central Yellow Thearch is named Han Guanglu, styled Hunming, ever guarding the center of the spleen and stomach. The *Huangting Jing* states: \"The spleen spans one foot, covering the Great Granary.\" The *Zhonghuang Jing* also says: \"The stomach is the Great Granary.\" The mouth of the Great Granary, within the stomach’s cavity, is precisely the gate where the clear and turbid are separated and transmitted.\n\n*Xuanzhou Twenty-Nine Perfected Lords, Thearchs, and Controllers of Prohibitions, Scripture of the Dao, Chapter Thirty-Seven*\n\nXuanzhou severs the Three Fordless,\nFeathered Splendor in the Great Void’s court.\nTwisting skies fly o’er layered deserts,\nTransforming and blending the myriad essences.\nFive clouds billow in the boundless sky,\nSeven auroras descend upon Round Brilliance.\nBright and clear, the Secluded and Vast One,\nBrahma Prosperity aids Yellow Tranquility.\nThe Five Elders soar with crimson blossoms,\nScattering incense and bearing Jade Spirits.\nGolden essence bathes in the Thearch’s River,\nGreen mists drift o’er flowing jade.\nThe divine severs the Three Paths’ accumulations,\nImmortal embryos form in nascent shapes.\nThe Supreme Clarity Jade Thearch’s Master,\nThe Jade Palace Great Dao Lord,\nWith the heart’s Crimson Palace spirit,\nSoars to the Venerable of Great Mystery.\nUnfurl the divine radiance,\nInaugurate the Great Kalpa.\n\nBeneath the isles of Xuanzhou lies the Ford of Three Weaknesses—this is the Weak Water. Feathered Splendor is the name of a hall. Layered Desert, a mountain. Round Brilliance, the name of the sun. The Secluded and Vast One is the style of the Grand One Lord. Brahma Prosperity is the name of the Grand One’s essence-spirit. Yellow Tranquility is the name of the Three Perfected of Essence-Blood. Jade Spirit is the Jade Youth of Supreme Clarity. Thearch’s River, a pool. Jade Palace, Supreme Clarity itself.\n\n*The Three Divine Jade Talismans of the Great Cavern*\nRecite the talisman’s subtle invocation:\nThe Upper Prime Minister of Mud-Pill Palace,\nNamed Zhao Lejing, styled Zhong Xuansheng,\nAlso called Qi Feibo, also Chang Fu Zhao.\nThe Middle Prime Minister of Crimson Palace,\nNamed Zhong Guangjian, styled Si Hualing,\nAlso called You Chebo, also Dong Shihua.\nThe Lower Prime Minister of Yellow Court,\nNamed Gui Shangming, styled Gu Xiaxuan,\nAlso called Feng Shenbo, also Cheng Guangsheng.\nEver guard my Three Prime Palaces,\nProtect my original destiny,\nSafeguard my Thearch’s chamber.\n\n*The Scripture of the Great Void’s Dawn Lord, Engraved in the Jade Gate Cavern Palace of Mount Emei, Chapter Thirty-Eight*\n\nThe Three Perfected birth the Great Void,\nJade Gate □ dawn’s auroras.\nThe Great Simplicity’s Cavern Spirit,\nCinnabar Forest bears vermilion branches.\nReturning spirit to the Ninefold Palace,\nInner Prosperity blooms jade blossoms.\nA hundred passages receive essence-fluid,\nProlonging years in Three Elegance’s vale.\nThe nascent body ascends Jade Clarity,\nSeven ancestors escape the dark paths.\nEver preserve beyond the final kalpa,\nFor myriad ages inheriting the immortal lineage.\nEnthroned as the Sage Lineage’s Venerable,\nThe Great Cavern’s capital of Jade Clarity.\nLingchang Jade, the Lord of a Hundred Paths.\n\nThe Great Simplicity’s Cavern Spirit refers to the Great Simplicity Heaven’s Cavern-Radiant Palace of Primordial Spirit. Inner Prosperity is the name of a terrace. Three Elegance, a mountain. Great Cavern Capital, the divine capital.\n\n*The Great Cavern Thearch-One Jade Talisman*\nRecite the talisman’s subtle invocation:\nThe Venerable Lord of the Great Cavern Thearch-One,\nNamed Fu Ningzai, styled He Mujing,\nRevolving winds blend and merge,\nGuarding the tight passes of death’s qi,\nCommanding the thirty-nine gate spirits of the body.\nEver present within the human—\nWithin the upper lip, the inner side of the upper teeth,\nAnd below the nose in the philtrum, where the spirit dwells,\nThe convergence of all spirits’ affairs.\nFor the Conception and Governor Vessels are the seas of the body’s yin and yang,\nThe meeting of the five qi’s true origin.\nThe immortal scriptures say:\n\"A single thing embraces five hues,\nForever the immortal’s ladder.\"\n\n*The Scripture of the Western Prime’s Nine-Spirit True Immortal Mother, Azure Gold Elixir Sovereign Lord, Chapter Thirty-Nine*\n\nWestern Prime’s ninefold spirit,\nGolden Elixir flows in Cloud Palace.\nAscending to the utmost apex of radiance,\nSplendor and light fill the great auroral sky.\nIn motion, revolving the Nine Heavens’ wheels,\nIn stillness, sinking the Eight Streams’ net.\nWithin the chamber, the Embryo Immortal Mother,\nBearing the lapels of the Grand Thearch.\nMysterious Unity’s spirit arises in time,\nThe Three Elders spread the plain and firm.\nLeft hand grasps the Five Talisman Registers,\nRight hand carries the governance of the divine lineage.\nTogether ascending the Vermilion Dragon Gate,\nBowing heads in the Jade Clarity Chamber.\nUprooting the roots of death and decay,\nNurturing form within the Three and Five.\nSeven ancestors untie the corpse’s knots,\nReceiving blessings in the Bright Vermilion Realm.\nSupreme Clarity’s Sacred Central Venerable,\nTalisman-transforming Mysterious Qi King.\nUtmost qi’s longevity,\nReceiving the luminous chariot.\n\nThe Western Origin refers to Mount Tongbo or, as some say, Mount Kunlun. The Nine Spirits is the name of a hall within the mountain. The Nine Heavens’ Wheels are the celestial gates. The Eight Streams’ Net refers to the eight mountains of the earthly axis. The Immortal Mother is the Mother of Earth, known as the Yellow Matriarch, the Lady of No Night, the Great Medicine King—she embodies the Dao of refining form within the Great Yin.\n\nThe Spirit of the Time is the name of the Central Mysterious Unity Elder. The Three Elders are the Three Pristine Lords. The Divine Lineage refers to the Central Controller of Destiny, the Venerable One. The roots of death and decay signify the uprooting of the thirty-nine death gates. The Three and Five denote the vertical and horizontal numbers of the River Chart.\n\nThe *Great Cavern’s Jade Talisman of Total Perfection*\nThis talisman encompasses the thirty-nine talismanic true qi at the abode of the Supreme Unity. Alongside the thirty-nine talismans, all are inscribed in cinnabar, written on yellow paper, and worn with a plain blue silk sash measuring five feet and five inches. Even when used alone, this talisman may achieve great perfection.\n\nThe Incantation of the Supreme Mystery Perfected One\nThe Perfected One, surnamed Zhao and named Shouzhen, presides over the Palace of Supreme Mystery and Clarity.\nHeaven within heaven, the celestial peak and sacred summit,\nPavilions and terraces, palaces and halls, chambers and courts,\nCavernous abodes and jade chambers, halls of fortune and golden cities,\nSpiritual chariots and imperial seats, the names of the highest ranks—\nAll passages and orifices open and flow,\nDoors and windows, lattice and frames,\nSun, moon, and stars leap forth, light fills the eyes,\nWind, clouds, mist, and auroras, qi congeals in harmony,\nRivers, pools, and ocean waves, blood and fluids, essence and spirit,\nThe five viscera and six bowels, the face and form of the body,\nThe womb’s knots and nodes—each harbors its own spirit.\nSeek them and they are unseen, call them and they respond at once.\nThough spirits number in the millions, they serve the One of Pure Tranquility.\nOne source, myriad streams—though turbid or clear,\nAll rivers return to a single source, the four seas merge as one.\nVast is the Cavern of Emptiness, the Six Harmonies’ Yellow Court,\nThe True One is undivided, the Dharma gate has no lock.\nThe thirty death gates, their deathly qi ever frozen—\nI call to my spirits, ever keeping them wakeful,\nAs if from sleep they awaken, as if from drunkenness they sober.\nEmpty and numinous, the Valley Spirit unites the Five Phases,\nNinety-seven forms radiate great light.\nThe qi of the death gates naturally regenerates,\nAncestral qi returns to moisten, descendant branches flourish.\nLitigation ceases, grievances dissolve without trace,\nAll beings are universally delivered, wondrous practice reaches completion.\nThe wealth of the Great Cavern overflows with myriad treasures,\nIts nobility ascends to the highest immortal ranks.\nThe chariot returns to complete the Dao,\nAscending to the Supreme Mystery and Upper Clarity.\n\nThe *Jade Stanzas of the Great Cavern’s Inner Jade Chapters*\nThe Great Dao Lord of the Azure Youth,\nTreading the clouds of Fusang in the east,\nTransmits the Great Cavern’s decree,\nLuminous stanzas and resplendent talismanic script.\nResonant jade tones, pure echoes reach the imperial gates.\nMoved by compassion for the world of mortals,\nHe vanquishes demons and dispels malevolent vapors.\nBestowing upon me the light of purity,\nIts vast salvation illumines without bound,\nLike the ancient Cang Jie, he ferries those within the Mystery.\nThe Five Palaces bloom with radiant hues,\nThe Nine Origins ever guard the body.\nTiger robes subdue all evil,\nDragon banners summon the hundred spirits.\nThe Net of Separation exhales white qi,\nRevealing the dawn of the highest realms.\nThe Supreme Unity blends yin and yang,\nThe Seven Perfected divide them.\nBriefly visiting the Six Abyssal Palaces,\nThen returning to the Ninefold Wheel of Light,\nEternally enduring beyond all kalpas,\nForever neighbor to the Great Beginning.\n\nThe Purple Void Lady, named Yuanjun,\nRides a simurgh to pay homage at the Mysterious Capital.\nIn hand she holds the *Great Cavern Scripture*,\nIts jade pendants chiming with a crystalline ring.\nDividing the stanzas into thirty-nine,\nShe exhales qi to inscribe the numinous talismans.\nSummoning and gathering the spirits of the living body,\nShe guards their abodes in stillness and secrecy.\nThe Nine Perfected stand in solemn vigil,\nThe Three Origins protect the storehouses.\nTo her left, she carries the Thousand Radiance Essence,\nTo her right, she embraces the Ever-Upholding One.\nTogether they enter the Yellow Chamber in joy,\nTheir mirrored hearts retaining the cloud-like pearl.\nRoaming the True Yang Lodge,\nHer ancient chariot drawn by feathered luminaries,\nGreen peaks pierce the empyrean,\nDark radiance grazes the celestial thoroughfare.\nThe profound root of the Cavern’s subtlety,\nThe vast and boundless arising from the Great Nonbeing—\nWho could have foreseen that in a mere instant,\nShe would surge forth with the fury of wind and thunder?\nForever preserved as an immortal elder,\nMyriad spirits attend her call.\n\nOn the Three Mao Brothers of Mount Juqu,\nRanked among the immortals’ assembly,\nThey welcome the Lady Wei Yuanjun,\nHer golden tablets inscribed with jade patterns.\nResplendent in crimson auroras,\nAdorned with towering Jade Dawn crowns,\nWithin purple chambers and brocade canopies,\nTheir courtyards lined with azure jade.\nWith one heart they approach the Orchid Gate,\nStep by step ascending the Heavenly Altar.\nCarefree, they tread the Milky Way,\nWhistling and roaming, their pendants chiming.\nThe Three Dawns scatter spiritual radiance,\nThe Four Seas calm their waves.\nSwiftly they ride divine tigers,\nBrushing their robes as they mount azure simurghs.\nAscending to the honored ranks of the sagely lineage,\nDissolving the hardships of accumulated kalpas.\nInhaling the qi of the Nine Spirits,\nRefining the Sevenfold Return Elixir.\nNurturing form within the imperial chamber,\nRevolving the wind to open the celestial gates.\nThe Dao flows through natural essence,\nNuminous power descends to the mortal realm.\n\nThe *Jade Stanzas of the Great Cavern’s Inner Jade Chapters of the Jade Clarity*\n*Upper Grade of the Jade Stanza of the Jade Clarity Lord*\nThe Azure Plum Lord of the Azure Youth,\nDriving dragons to court the Purple Palace.\nThe Nine Luminaries illuminate the Eight Poles,\nThe Five Celestial Granaries descend to the Gate of Life.\nThe Twenty-Eight Constellation Lords,\nResplendent, brighten the celestial gates.\nThe Five Emperors arrive in jade chariots,\nThe Three Officials bestow profound grace.\nAuspicious light pervades heaven and earth,\nPropitious qi revives the spring of yang.\nHeavenly officers fix the immortal registers,\nThe Ding and Jia spirits dispel demonic vapors.\nGolden veils unveil the jade stanzas,\nSun and moon halt their crimson wheels.\nMyriad spirits fill my chamber,\nMy longevity endures with heaven and earth.\n\n*Middle Grade of the Inner Jade Stanza of Jade Clarity*\nThe Supreme Great Luo Heaven,\nThree Radiances merge with the Four Illuminations.\nPurple portals birth Brahma qi,\nGolden light blazes through the Nine Clarities.\nAll spirits unite in harmony,\nThe Great Sage awaits the Jade Capital.\nCavern stanzas chant jade tones,\nThe Central Yellow unfolds the precious scripture.\nThe Five Emperors proclaim jade talismans,\nThe Three Officials summon the hundred spirits.\nKalpa after kalpa, they respond to great peace,\nReturning to the root like an infant.\nThe true wind ever billows,\nThe Dao’s qi perpetually pure.\nJade maidens scatter gem-like blossoms,\nGolden lads leisurely tend the jade gates.\nThe Non-Action Red Origin Lord,\nAccompanies the Dao in its rising and sinking.\n\n*Lower Grade of the Inner Jade Stanza of Jade Clarity*\nTowering, the Ninefold Mountain of Light,\nIts jade towers housing the highest immortals.\nSun and moon circulate golden qi,\nDragon and tiger rush through the Mysterious Pass.\n\nIrrigating the chambers of azure mushrooms,\nDivine sprouts rise in emerald mist.\nResplendent, the purple auroras glow,\nMyriad sages descend in cloud-borne chariots.\nCavern hymns ring clear and bright,\nPiercing through heaven upon heaven.\nShould one preserve this chamber,\nFor ten thousand kalpas they become a celestial immortal.\nThe inner treasure is not sought without—\nThis is the supreme mystery.\nRefining the great vessel of treasure,\nOne dissolves and drifts back to the imperial chariot.\n\n**Talisman of the Capital Artisan**\n*Incantation for Ingesting the Talisman:*\nThe sun rises, vast and radiant,\nTrue Martial roams and traverses.\nMarching with talisman, commanding water,\nSeated, surveying the four directions.\nSeek the Dao and attain the Dao,\nSeek immortality and attain immortality.\nLong life and enduring vision,\nRank receives true auspices.\nAt the sight of myriad evils,\nTheir hearts tremble in dread.\nHasten, hasten, as decreed by statute and ordinance.\n\n*Usage:* Ingest with reverent invocation. For ablutions, this talisman is also used.\n\nAlso named *The Great Cavern Jade Clarity Register of the True Talisman of the Capital*, this is the first talisman in the Jade Script Talisman Treasury of the Lord Lao, the foremost of the three numinous writings.\n\n*The Perfected of the Great Mystery’s Incantation:*\nThirty-nine portals,\nFirmly guarded by spirits.\nBefore hearing the Jade Scripture,\nNone knew their names.\nThirty-nine talismans,\nCirculate with the qi’s movement.\nWithout seeing the Jade Scripture,\nTheir patterns remain obscure.\nI possess the affinity of the Dao,\nMy heart revolves the Jade Scripture.\nThe scripture commands reverence,\nThe scripture commands sincerity.\nTalismans seek unity with qi,\nSpirits respond in unison.\nThe numinous valley, cavernous and void,\nMyriad sounds resonate of themselves.\nThe azure sky bears no clouds,\nYet the true script emerges on its own.\nThe principle of resonance,\nGathers spirit and concentrates essence.\nThe fetal knot unravels of itself,\nThe corpse’s blood clarifies on its own.\nYang returns to the ancestral root,\nThe mysterious blossom flourishes evergreen.\nFather’s serenity, mother’s essence,\nRevolving wind, congealing staff.\nThe precious pearl radiates light,\nReturning to the womb, the infant coalesces.\nQi revolves the vast potter’s wheel,\nFire and timing harmonized.\nEmbrace the feminine, hold the masculine,\nWithdraw vision, return hearing.\nNurture the infant child,\nWealth and honor fill the Yellow Court.\nAscent and descent occur naturally,\nThe mirror turns toward Jade Clarity.\nOnce the fetal carriage returns,\nThe jade mat ascends on high.\nAfter ten thousand recitations, the Dao is complete,\nDragon and crane come to welcome.\nMerit accomplished, fame achieved,\nThe mystery and the common alike shine in glory.\n\n*Here ends the Lower Scroll of the Great Cavern Jade Scripture.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大洞玉经 经名：大洞玉经。 宋元间道士赵真人等撰，龚德同抄录并序。 系《上清大洞真经三十九章》 之校释本。 二卷。 底本出处：《正统道藏》洞真部本文类。 大洞玉经 秉简当心，临目叩齿，存室内紫云之炁徧满，来冠兆身，金童玉女侍经左右，三光宝芝洞焕室内，叩齿微祝曰： 天朗气清，三光洞明，金房玉室，五芝宝生，玄炁紫盖，来映我身， 仙童玉女，为我致灵，九帝齐景，三元同軿，上乘紫盖，升入帝庭。 开经玄蕴咒 彻微玄景门，焕朗彻空同。 至道由静默，当见三素宫。 大道於此成，骖景策云龙。 左右侍经真，玉女及玉童，身济不死律，解罗顺灵风。 七祖反胎生，世为神仙宗。 叩齿冥目，俯心祝曰： 粪土小兆男臣某，今有微言，上启玉清琼元君、高圣万真太上道君、中央黄老元素道君，上清总仙大司马长生法师主三天君栢成上真、降授《大洞真经》经师上真圣母紫微元君王夫人、降授回风大混合师上真圣母中侯元君王夫人、上清九微太真玉保王金阙上相大司命高晨师东海王青华小童君、上清太无东霞扶桑丹林大帝上道君、祖师南极紫真上清道主玉晨圣后金阙上保东华道君、金阙大夫上清仙侯，臣今入室诵咏《上清大洞真经三十九章》，愿晨晖焕发，＠照臣身脏府荣华，灾祸消散，七祖返胎，同驾云舆。 闭目存帝一尊君，如婴儿，长四寸，居鼻下人中皮内，主集百神、坐五色云中。 存帝一尊君空玄中，其口正对兆口，听诵玉经。 大洞震灵符文 符文用黄素为地，以朱书内，黑书郭。 行则佩，坐迹拜就以为褥，制伏万魔，全神定志。 大洞照辟符文 符用贵重之物，两面刻文，囊用锦，外用黄罗为之。 遇行事佩之，六天魔王三天禁君，不敢砠遏也。 诵经内诀 身坐震灵符，带照辟符，静思身在三台北斗中。 毕，叩齿三十九通，然后诵隐书，入本经。 大洞神慧隐书 玄景散天湄，清汉薄云回。 妙炁焕三晨，丹霞映紫微。 诸天书灵彩，流霄何霏霏。 神灯朗长庚，离罗吐明晖。 四岭带高云，玄精荫八垂。 三素启高虚，兰阙披重扉。 金墉映玉清，灵秀表天畿。 风生八会宫，猛兽骋云驰。 纷纷三洞府，真人互参差。 上有千景精，冥德高巍巍。 太一务猷收，执命握神麾。 正一履昌灵，摄召万神归。 公子翼寂辕，洞阳卫玄机。 明初合道康。 龙舆正徘徊。 七景协神王，飙轮万杪阶。 体娇玄津上，飞步绝岭梯。 披景入神丘，璀璨振羽衣。 冥摅交云会，飞景承神通。 青峰无毫荟，绮合生绝空。 金华带灵轩，翼翼高仙翁。 万辔乘虚散，蓊蔼玄上窗。 中生合景君，九帝昌上皇。 明轮＠黄宁，羽珠耀玄阳。 天精元素炁，中五号养光。 结朗始生神，九真合成双。 妙景启冥数，顺感标神踪。 泥丸洞元光，运珠正绛官。 元阳部命门，三神携紫童。 拘制招上归，夹阙侍明窗。 翳蔚对启明，圆华焕三冲。 方盈引接生，反老回婴蒙。 飙粲丽九天，绿辕绕丹房。 萧萧缠霭表，曲绛寝华堂。 游冥盻万变，归会神霄王。 仙道乐子生，鬼道乐子凶。 但闻贵生道，不闻鬼道隆。 瑶歌参天炁，贵生元正章。 神慧命朱兵，五帝符寒乡。 仗旛摄万魔，琼文检北酆。 体解自然道，妖灭非尔功。 泛景鼓长扇，含灵庆霄峰。 俯盻四谢飞，天劫永难终。",
      "translated_text": "**The Jade Scripture of the Great Cavern**\n\n**Scripture Title:** *The Jade Scripture of the Great Cavern*. Compiled by Daoist Adept Zhao and others during the Song-Yuan period, transcribed and prefaced by Gong De. A collated and annotated edition of *The Thirty-Nine Chapters of the Supreme Clarity Scripture of the Great Cavern*. Two fascicles. Base text from *The Orthodox Daoist Canon*, *Dongzhen* section, *Benwen* category.\n\n---\n\n**The Jade Scripture of the Great Cavern**\n\nHold the tablet centered before the heart, gaze forward, and knock the teeth. Visualize the chamber filled with purple clouds of *qi*, enveloping the body like a crown. Golden Lads and Jade Maidens attend beside the scripture, while the Three Radiances and precious mushrooms illuminate the room. Knock the teeth and softly invoke:\n\n\"The heavens are bright, the *qi* is clear,\nThe Three Radiances illumine the cavern’s light.\nGolden chambers and jade halls,\nFive mushrooms bloom with treasured might.\nMysterious *qi* and purple canopy,\nDescend to grace this form of mine.\nImmortal lads and jade maidens,\nBestow your numinous power divine.\nThe Nine Thearchs align in splendor,\nThe Three Origins share their car.\nAscend beneath the purple canopy,\nTo enter the Thearch’s court afar.\"\n\n**Mystic Concealment Spell for Opening the Scripture**\n\nPierce the gate of subtle mystery,\nResplendent, vast as empty sky.\nThe supreme Dao arises in stillness,\nWhere the Three Primes’ palace comes nigh.\nThe Great Way is perfected here,\nRiding cloud-dragons through the air.\nImmortals attend left and right,\nJade maidens and lads so fair.\nThis body attains the deathless law,\nUntangles knots in the spirit’s breeze.\nSeven ancestors return to womb,\nTheir lineage reborn as immortals’ seeds.\n\nKnock the teeth, close the eyes, and bow in prayer, saying:\n\n\"Humblest servant [Name], a fleeting mortal of this dust,\nNow offers these modest words,\nTo supplicate the Jade Clarity’s Primordial Lady of the Rosy Origin,\nThe Lofty Sage, Myriad Perfected, Supreme Dao Lord of the Great Dao,\nThe Central Yellow Elder, Primordial Simplicity Dao Lord,\nThe Supreme Clarity’s Marshal of All Immortals, Master of Longevity, Lord of the Three Heavens, Perfected of Cypress Completion,\nThe Scripture-Teacher of *The Scripture of the Great Cavern*, Holy Mother, Primordial Lady of the Purple Tenuity, Lady Wang,\nThe Great Unifier of the Returning Wind, Holy Mother, Primordial Lady of the Central Marquis, Lady Wang,\nThe Supreme Clarity’s Ninefold Subtlety, Jade Protector, King of the Golden Watchtower, Grand Minister of Fate, High Dawn Master, Lord Azure Florescence of the Eastern Sea,\nThe Supreme Clarity’s Great Void, Lord of the Eastern Glow, Fusang Vermilion Forest, Supreme Dao Lord,\nThe Patriarchal Perfected of the Southern Culmen, Supreme Clarity’s Dao Master, Holy Consort of the Jade Dawn, Golden Watchtower’s Protector, Lord of the Eastern Florescence,\nThe Golden Watchtower’s Grand Master, Supreme Clarity’s Immortal Marquis—\n\nThis servant now enters the chamber to recite *The Thirty-Nine Chapters of the Supreme Clarity Scripture of the Great Cavern*,\nPraying that the dawn’s radiance may shine forth,\nIlluminating this servant’s viscera and palaces with flourishing splendor,\nDispelling calamities and misfortunes,\nReturning the seven ancestors to the womb,\nThat together we may ride the cloud chariot.\"\n\nClose the eyes and visualize the Lord of the First Thearch,\nLike an infant, four inches tall,\nDwelling within the philtrum beneath the nose,\nGoverning the assembly of the hundred spirits,\nSeated amidst five-colored clouds.\nVisualize the Lord of the First Thearch in the empty mystery,\nHis mouth directly aligned with this servant’s mouth,\nListening to the recitation of the Jade Scripture.\n\n---\n\n**Talismanic Script of the Great Cavern’s Thunderous Numen**\n\nInscribe the talisman on yellow silk,\nWith cinnabar for the inner text,\nAnd black ink for the border.\nWear it when walking,\nUse it as a mat when seated or bowing,\nTo subdue the myriad demons\nAnd stabilize the spirit’s resolve.\n\n**Talismanic Script of the Great Cavern’s Illuminating Ward**\n\nCarve the talisman on precious materials,\nInscribing both sides,\nEncase it in brocade,\nWith an outer pouch of yellow silk.\nWear it when conducting affairs,\nSo that the Demon Kings of the Six Heavens\nAnd the Wardens of the Three Heavens’ Prohibitions\nDare not obstruct or impede.\n\n---\n\n**Inner Secrets for Reciting the Scripture**\n\nSit upon the Thunderous Numen Talisman,\nWearing the Illuminating Ward Talisman.\nStill the mind and visualize the body within the Northern Dipper of the Three Heavens.\nUpon completion, knock the teeth thirty-nine times,\nThen recite the Concealed Writ\nAnd enter the root scripture.\n\n---\n\n**The Divine Wisdom’s Concealed Writ of the Great Cavern**\n\nMysterious radiance scatters the celestial shores,\nThe clear Han brushes past the returning clouds.\nWondrous *qi* illumines the Three Dawns,\nCinnabar auroras reflect the Purple Tenuity.\nThe myriad heavens inscribe numinous hues,\nStreaming through the skies in profuse array.\nThe spirit lamp shines bright as the Long Star,\nThe Net of Separation exhales its luminous ray.\nFour peaks gird the lofty clouds,\nMysterious essence shades the eight directions.\nThe Three Primes open the high void,\nOrchid towers unfold their layered gates.\nGolden ramparts mirror the Jade Clarity,\nNuminous splendor marks the celestial precincts.\nWinds arise in the Eightfold Assembly Palace,\nFierce beasts gallop through the clouds.\nIn the bustling Three Cavern Courts,\nPerfected Ones intermingle in disarray.\nAbove dwell the thousand radiant spirits,\nTheir hidden virtue towering and sublime.\nThe Great One gathers the threads of fate,\nGrasping life’s reins, wielding the spirit’s banner.\nThe Orthodox Unity treads the flourishing numen,\nSummoning the myriad spirits to return.\nThe Duke’s son flanks the silent axle,\nThe Cavern Yang guards the mystery’s pivot.\nAt the dawn’s clarity, the Dao is harmonized.\nThe dragon chariot pauses in its circuit.\nThe Seven Radiances align with the Spirit Kings,\nWhirlwind wheels traverse the ten-thousand treetops.\nThe body soars above the mysterious ford,\nFlying steps ascend the ridge’s ladder.\nParting the radiance, enter the spirit’s mound,\nResplendent, the feathered robes tremble.\nHidden depths intermingle in clouded assemblies,\nFlying radiance bears the spirit’s communion.\nGreen peaks without a speck of haze,\nSilken unions arise in the void’s expanse.\nGolden splendor girds the numinous carriage,\nWinged immortals soar in majesty.\nTen-thousand reins scatter through the void,\nLush and misty, the mystery’s upper window.\nWithin arises the Lord of Harmonized Radiance,\nThe Nine Thearchs flourish the Supreme August.\nThe luminous wheel shines upon the Yellow Tranquility,\nFeathered pearls gleam in the Mysterious Yang.\nThe celestial essence of primordial simplicity,\nThe Central Five named Nurturing Light.\nBound clarity gives birth to the nascent spirit,\nNine Perfected unite as a pair.\nWondrous radiance reveals the hidden reckoning,\nFollowing resonance, it marks the spirit’s trace.\nThe Muddy Pellet’s cavernous primordial light,\nDirects the pearl to the Crimson Palace.\nThe Gate of Life in the Primordial Yang’s domain,\nThree spirits escort the Purple Lad.\nRestrain and summon them to return above,\nFlanking the portals, attending the bright window.\nCanopies face the Brilliant Star,\nCircular splendor illumines the Three Thoroughfares.\nSquare fullness draws forth and connects life,\nReversing age to return to infancy.\nWhirlwinds gleam across the Nine Heavens,\nGreen axles coil around the cinnabar chamber.\nWhispering winds weave beyond the mist,\nCurved crimson rests in the flowery hall.\nRoaming the hidden, gazing upon ten-thousand transformations,\nReturning to assemble with the Spirit Sovereign of the Cloudy Empyrean.\nThe immortal’s path delights in life’s flourishing,\nThe ghostly path delights in misfortune’s thrall.\nOne hears only of the precious path of life,\nNever of the ghostly path’s rise.\nJade songs harmonize with the celestial *qi*,\nThe *Primordial Rectitude of Precious Life*’s foremost chapter.\nDivine wisdom commands the vermilion troops,\nThe Five Thearchs’ talismans chill the northern wilds.\nBrandishing banners to capture the myriad demons,\nJade writs restrain the Feng’s dark domain.\nThe body’s dissolution is the Dao’s natural course,\nThe vanquishing of demons is not your merit.\nFloating radiance beats the long fan,\nNuminous beings rejoice on the cloudy peak.\nGazing below at the four flying perils,\nHeaven’s kalpas never end.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1256,
      "start_sentence": 0,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.474271059036255,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "妙中生真景，回辇若迟迟。 意合存冥感，携提高上奇。 翔翅期妙会，洞观谁与齐。 啸叱咄嗟顷，倏忽历九围。 摄炁反交初，并景幽玄栖。 三素者，三素老君也。 务猷收，太一名。 履昌灵，玉帝君字也。 公子，无英公子也。 洞阳君，右白元神名也。 理明初，中央司命丈人名也。 孩道康，命桃康名也。 合景君，胆中八真名也。 九帝昌上皇，泥丸九真名也。 明轮，肝中四真名也。 黄宁，精血三真名也。 羽珠，胃管二真名也。 玄阳，左肾七真名也。 天精，心中一真名也。 元素，无英公子名也。 养光子，脾神名也。 洞元君，泥丸君名也。 运珠，心中丹元君名也。 元阳昌命门，下元元王君名也。 紫童，太微小童名也。 拘制，九元真男名也。 上归，皇一魂女名也。 翳蔚，紫素左元君名也。 启明，白素右元君名也。 圆华，月神名也。 方盈，月中桃君名也。 接生，日中司命名也。 神慧，心神名。 五帝，肾神名也。 大洞太微玉符 服符微咒曰： 太微小童君，名干景精，字会元子，一名三衿交，一名对帝真。 常镇舌根之下，血液之府。 太微，乃兆初地修行之身。 小童，即童子。 对帝真，即同参知识之义。 玉清真王咒曰： 天宝大隐生，明梁玄上炁，为我塞下户，受生牢关外，益元羽童君，列于绿室轩，七祖得解结，随风离根源，配天升迁基，洞达变八玄。 太隐生，人之心也。 明梁者，人之鼻息。 益元羽童，鼻之神也。 绿室，乃人中也。 又咒曰 元炁自本生，五涂承灵出，雌雄寄神化，森罗邃幽蔚， 玉音响太和，万唱元中发，仙庭回九转，百混同得一， 易有含虚中，俱入帝会室。 雌雄，乃大洞雌一、雄一之君。 易有，九天西北门名。 帝会，堂室之名。 存思图 大洞玉经卷上",
      "translated_text": "Within the wondrous arises the true vision,\nThe returning chariot moves as if lingering slow.\nThe mind aligns, preserving the unseen resonance,\nCarrying forth the sublime and lofty marvel.\nSoaring wings await the wondrous convergence,\nWhat peer could match this penetrating gaze?\nWith a whistle, a shout, a sigh in an instant,\nSwiftly traversing the nine enclosures.\n\nGathering *qi* to revert to the primal exchange,\nMerging radiance to dwell in the profound and mysterious.\nThe Three Primes—these are the Three Prime Lords.\nWu You Shou—the name of the Great One.\nLü Chang Ling—the style of the Jade Emperor Lord.\nGongzi—this is Wu Ying Gongzi.\nDongyang Jun—the name of the Right White Prime Spirit.\nLi Ming Chu—the name of the Central Controller of Destiny.\nHai Dao Kang—the name of Tao Tao Kang.\nHe Jing Jun—the name of the Eight Perfected within the gallbladder.\nNine Emperors Chang Shang Huang—the name of the Nine Perfected in the Muddy Pellet.\nMing Lun—the name of the Four Perfected within the liver.\nHuang Ning—the name of the Three Perfected of essence and blood.\nYu Zhu—the name of the Two Perfected in the stomach duct.\nXuan Yang—the name of the Seven Perfected in the left kidney.\nTian Jing—the name of the One Perfected within the heart.\nYuan Su—the name of Wu Ying Gongzi.\nYang Guang Zi—the name of the spleen spirit.\nDong Yuan Jun—the name of the Muddy Pellet Lord.\nYun Zhu—the name of the Cinnabar Prime Lord within the heart.\nYuan Yang Chang Ming Men—the name of the Primal King of the Lower Origin.\nZi Tong—the name of the Minor Lad of the Grand Tenuity.\nJu Zhi—the name of the Nine Prime True Youth.\nShang Gui—the name of the Hun Maiden of the August One.\nYi Wei—the name of the Purple Prime Left Prime Lord.\nQi Ming—the name of the White Prime Right Prime Lord.\nYuan Hua—the name of the Moon Spirit.\nFang Ying—the name of the Peach Lord within the moon.\nJie Sheng—the name of the Controller of Destiny within the sun.\nShen Hui—the name of the heart spirit.\nWu Di—the name of the kidney spirits.\n\nThe Great Tenuity Jade Talisman of the Grand Tenuity\nThe incantation for wearing the talisman reads:\nMinor Lad of the Grand Tenuity, named Gan Jing Jing, styled Hui Yuan Zi, also called Three Collars Intertwined, also called Peer of the Imperial Perfected.\nEver guards beneath the root of the tongue, the mansion of blood and fluids.\nThe Grand Tenuity is the body of initial cultivation.\nThe Minor Lad is the Lad.\nPeer of the Imperial Perfected signifies the meaning of mutual companionship in knowledge.\n\nThe Jade Pure True King’s Incantation reads:\nCelestial Treasure, Great Concealment gives birth,\nIlluminating Beam, the primordial *qi* above,\nSeals for me the lower gate,\nBeyond the secure pass of life’s reception.\nYi Yuan Yu Tong Jun,\nArrayed in the Verdant Chamber Pavilion,\nSeven Ancestors untie their knots,\nFollowing the wind to leave the root’s source,\nMatching Heaven’s foundation for ascension,\nPenetrating the transformations of the Eight Mysteries.\nGreat Concealment gives birth—this is the human heart.\nIlluminating Beam—this is the human breath.\nYi Yuan Yu Tong—the spirit of the nose.\nVerdant Chamber—this is the philtrum.\n\nAnother incantation reads:\nPrimal *qi* arises from its origin,\nFive Paths bear the numinous forth,\nFeminine and masculine lodge in divine transformation,\nVast and profound, the darkly luxuriant,\nJade tones resonate with the Grand Harmony,\nMyriad chants issue from the Primal Center,\nThe immortal court revolves through nine cycles,\nHundredfold chaos unites in the One,\nChange holds the Void Within,\nAll enter the Imperial Assembly Chamber.\nFeminine and masculine—these are the Lords of the Feminine One and Masculine One of the Great Tenuity.\nChange Holds—this is the name of the northwest gate of the Nine Heavens.\nImperial Assembly—this is the name of the hall chamber.\n\nVisualization Chart\nUpper Scroll of the Jade Canon of the Great Tenuity",
      "overlap_context": " *Primordial Rectitude of Precious Life*’s foremost chapter.\nDivine wisdom commands the vermilion troops,\nThe Five Thearchs’ talismans chill the northern wilds.\nBrandishing banners to capture the myriad demons,\nJade writs restrain the Feng’s dark domain.\nThe body’s dissolution is the Dao’s natural course,\nThe vanquishing of demons is not your merit.\nFloating radiance beats the long fan,\nNuminous beings rejoice on the cloudy peak.\nGazing below at the four flying perils,\nHeaven’s kalpas never end.",
      "start_char": 1256,
      "end_char": 1946,
      "start_sentence": 73,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.39323115348816,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "高上虚皇君道经第一 高上洞玄，元生九天。 炁祖太无，宗风胤玄。 玄曾散绝，四清抚闲。 帝一上景，连众摄烟。 长契一运，七世投闲。 托灵属命，反华自然。 泯邈流虚，六曜浮迁。 凌梵衔晖，西华彰安。 仙编帝简，尽得解源。 胎田邃路，世发玉兰。 灵光八曜，混生万神。 〔三蓝罗，波逮台。 〕 高上玉皇之炁，在人身为明梁之炁，下应人之鼻中。 盖以人受胎结形，先始生鼻，鼻祖之义取於此。 宗风乃祖炁之异名，生生化化，玄之又玄，玄孙之义取於此。 曾亲结散者，谓人身乃祖亲之委蜕隐显，中有自然感召之机，结散乃得大解脱也。 帝一上景者，乃真一不二法门，最上乘之妙道也。 连众摄 烟者，连贯众炁，摄聚灵烟，取肺为五脏华盖，明梁祖炁系乎鼻。 六曜，谓南斗六曜，炁浮南炎，为兆化形易貌也。 凌梵，玉帝君名逢凌梵。 彰安，肺神白帝名彰安幸，字西华。 胎田，谓结胎仙於丹田也。 八曜，八景也。 大洞太一玉符 服符微咒曰",
      "translated_text": "Highest Scripture of the Void Sovereign Lord, First Scroll\n\nThe Supreme Cavern Mystery,\nPrimal birth of the Nine Heavens.\n*Qi*-Ancestor of the Great Void,\nLineage-Wind bears forth the Mystery.\n\nThe Mystery’s kin dispersed and severed,\nFour Purities govern in tranquility.\nImperial Unity’s Upper Radiance,\nLinks the multitudes and gathers the mists.\n\nEternal Pact of the One Revolution,\nSeven generations cast into repose.\nEntrusting the numinous, binding fate,\nReturning to the blossom of spontaneity.\n\nVast and distant, flowing into the Void,\nSix Luminaries drift in ascent.\nAscending Brahma, bearing splendor,\nWestern Florescence manifests peace.\n\nImmortal registers, imperial tablets—\nAll attain liberation at the source.\nWomb-Field’s profound path,\nGenerations issue jade orchids.\n\nNuminous light of the Eight Luminaries,\nGives rise to the myriad spirits.\n\n[Three Indigo Nets, Waves Reach the Terrace.]\n\nThe *qi* of the Highest Jade Sovereign,\nWithin the human body is the *qi* of the Bright Beam,\nDescending to correspond with the human nose.\nFor when humans receive the embryo and form the body,\nThe nose is first to take shape—\nThe meaning of \"Nose-Ancestor\" is drawn from this.\n\nLineage-Wind is another name for Ancestral *Qi*,\nGeneration upon generation, transformation upon transformation,\nMystery upon mystery—\nThe meaning of \"Mystery’s Descendant\" is drawn from this.\n\n\"Kin dispersed and severed\" refers to the human body,\nThe ancestral kin’s cast-off traces, hidden and manifest,\nWithin which lies the mechanism of natural resonance,\nWhere dispersion and convergence attain great liberation.\n\n\"Imperial Unity’s Upper Radiance\" is the True Unity,\nThe unparalleled Dharma-gate, the supreme vehicle’s wondrous Dao.\n\n\"Links the multitudes and gathers the mists\" means\nTo connect and thread the multitudes of *qi*,\nGathering the numinous mists—\nDrawing from the lungs as the flowery canopy of the five viscera,\nThe Bright Beam’s ancestral *qi* is tied to the nose.\n\n\"Six Luminaries\" refers to the Six Luminaries of the Southern Dipper,\n*Qi* floats in the southern blaze,\nSignifying the omen of transformed form and altered countenance.\n\n\"Ascending Brahma\" is the name of the Jade Sovereign Lord, Feng Ascending Brahma.\n\"Manifests peace\" is the name of the White Emperor of the Lungs, Zhang Anxing,\nStyled Western Florescence.\n\n\"Womb-Field\" refers to the immortal embryo congealed in the Cinnabar Field.\n\"Eight Luminaries\" are the Eight Radiant Scenes.\n\nGreat Cavern Supreme Unity Jade Talisman\n\nRecitation of the Secret Incantation:",
      "overlap_context": "d chants issue from the Primal Center,\nThe immortal court revolves through nine cycles,\nHundredfold chaos unites in the One,\nChange holds the Void Within,\nAll enter the Imperial Assembly Chamber.\nFeminine and masculine—these are the Lords of the Feminine One and Masculine One of the Great Tenuity.\nChange Holds—this is the name of the northwest gate of the Nine Heavens.\nImperial Assembly—this is the name of the hall chamber.\n\nVisualization Chart\nUpper Scroll of the Jade Canon of the Great Tenuity",
      "start_char": 1946,
      "end_char": 2348,
      "start_sentence": 129,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.32766056060791,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "太一尊神，名务猷收，字归会昌，一名解萌，一名寄频，常枕我玉枕之下，泥丸之后户。 脑后枕骨、眉间，却入三寸为丹田，即泥丸官。 泥丸后户，正在玉枕之下，督脉所入处。 上皇玉虚君道经第二 玉虚顺玄归，天晨金霄游。 朗朗生帝景，欻生宴玉洲。 左摄始童神，右命起常扶。 明真焕九霄，三日□玄敷。 千景并三衿，内有幽寥无。 今我得长生，千劫始一周。 黄录保德仞，披锦入神丘。 太一务命根，公子命灵旛。 十回度初心，得入大信根。 离堂合，推运回。 玉虚之天，乃乾阳也。 顺 者，以人得一炁之正，故顺生，非若草木逆生，禽兽横生也。 玄归子，太一精魂之名，又泥丸之灵根也。 天晨者，雌一君之名。 金霄者，雄一君之名。 游乃逍遥也。 朗朗者，日月之华。 帝景者，雌一所居之景也。 欻生者，风之名。 玉洲者，雄一所居之景也。 始童神，黄庭元王名也。 起常扶，泥丸帝卿之名也。 明真者，九天台名也。 千景并三衿，谓大微小童君，一名千景精，一名三衿交。 幽寥 无者，帝皇太一君之字也。 德仞者，九天台名也。 神丘者，帝一之灵穴也。 公子，无英公子也。 大洞皇上玉符 服符微祝曰 皇上玉帝君，名逢凌梵，字履昌灵，一名匕灵，一名神丈人。 常镇我两眉之问，紫户之外。 眉间却入一寸为明堂，左方一寸为青房，右方一寸为紫户。 皇上玉帝君道经第三 帝有玄上旛，制命九天阶。 七觉乘妙道，欢熙神风回。 飙灿北停华，紫英唱东隈。 琳和九霄外，玉符微太微。 三素生泥丸，发曜金灵晖。 老君牢张上，守卫死节机。 十善生玄中，度死而熙熙。 珠郁罗，广都灵。 玄上旛，一名反华旛，玉帝招真政灵之号令也。 北停华者，北方有留春仙苑，号曰停华也。 东隈者，东极青华之天也。 九霄者，神霄、琅霄、紫霄、青霄、碧霄、绛霄、景霄、太霄、玉霄也。 三素者，三素老君也。 金灵晖，金丹之神光也。 牢张上，三素老君名也。 死节机，死户也。 七觉，火之数也。 大洞无英主符 服符微咒曰",
      "translated_text": "The Supreme Unity Venerable Deity is named Wu You Shou, styled Gui Hui Chang, also called Jie Meng, also called Ji Pin. He constantly rests beneath my Jade Pillow, at the posterior gate of the Mud-Pellet Palace. The occipital bone behind the brain and the space between the brows, three inches inward, form the Cinnabar Field—this is the Mud-Pellet Palace. The posterior gate of the Mud-Pellet Palace lies precisely beneath the Jade Pillow, where the Governing Vessel enters.\n\n*Scripture of the Jade Sovereign of the Highest August, Second Chapter*\n\nThe Jade Sovereign follows the Mysterious Return,\nWandering the Celestial Dawn of the Golden Empyrean.\nResplendent shines the imperial radiance,\nSwiftly born upon the Feast of Jade Isle.\nTo the left, he summons the Divine Youth of Beginnings;\nTo the right, he commands the Ever-Assisting One to rise.\nThe Illuminated Perfected gleams across the Nine Empyreans,\nThree days’ [mystery] unfolds the Dark Expansion.\nA thousand scenes merge with the Three Girdles,\nWithin lies the Profound and Boundless Void.\nNow I attain longevity,\nA thousand kalpas mark but one cycle.\nThe Yellow Register guards the Power of Virtue’s measure,\nDonning brocade, he enters the Divine Mound.\nThe Supreme Unity’s root of life’s mandate,\nThe Noble Scion commands the numinous banner.\nTen revolutions fulfill the initial resolve,\nAttaining entry into the Root of Great Faith.\nDepart the hall, unite—\nPush the turning wheel, revolve.\n\nThe Heaven of the Jade Sovereign is the Qian Yang. \"Follows\" means that humans, receiving the uprightness of the One *Qi*, thus follow life—unlike grasses and trees, which grow in reverse, or birds and beasts, which grow horizontally. The Mysterious Return Master is the name of the Supreme Unity’s essence-spirit, also the numinous root of the Mud-Pellet Palace. \"Celestial Dawn\" is the name of the Feminine One Sovereign. \"Golden Empyrean\" is the name of the Masculine One Sovereign. \"Wandering\" means to roam freely. \"Resplendent\" refers to the brilliance of the sun and moon. \"Imperial radiance\" is the scene where the Feminine One dwells. \"Swiftly born\" is the name of the wind. \"Jade Isle\" is the scene where the Masculine One dwells. The Divine Youth of Beginnings is the name of the Primordial Sovereign of the Yellow Court. The Ever-Assisting One is the name of the Mud-Pellet Palace’s Imperial Minister. \"Illuminated Perfected\" is the name of the Nine Heavens Terrace. \"A thousand scenes merge with the Three Girdles\" refers to the Lesser Lad of the Great Tenuity, also called the Essence of a Thousand Scenes, also called the Intertwining of Three Girdles. \"Profound and Boundless Void\" is the style of the August Supreme Unity Sovereign. \"Virtue’s measure\" is the name of the Nine Heavens Terrace. \"Divine Mound\" is the numinous cavern of the Supreme Unity. \"Noble Scion\" is the Peerless Noble Scion.\n\n*Great Cavern Supreme Jade Talisman of the August Highest*\nRecitation of the Secret Incantation:\n\nThe August Highest Jade Sovereign Lord is named Feng Ling Fan, styled Lü Chang Ling, also called Bi Ling, also called Divine Venerable. He constantly guards the space between my brows, beyond the Purple Gate. One inch inward from the space between the brows is the Hall of Light; one inch to the left is the Azure Chamber; one inch to the right is the Purple Gate.\n\n*Scripture of the August Highest Jade Sovereign Lord, Third Chapter*\n\nThe Sovereign bears the Dark Loft Banner,\nCommanding the nine celestial stairways.\nThe Seven Awakenings ride the wondrous Dao,\nJoyously the divine wind returns.\nThe radiant gale halts at the Northern Bloom,\nThe Purple Flower sings at the Eastern Bend.\nJade harmony resounds beyond the Nine Empyreans,\nThe subtle jade tally of the Great Tenuity.\nThe Three Simplicities generate the Mud-Pellet Palace,\nEmitting the golden numinous radiance.\nThe Venerable Lord firmly upholds the summit,\nGuarding the death-defying mechanism.\nThe Ten Virtues arise within the Mysterious,\nTranscending death to rejoice in brilliance.\nPearl-luster entwined, vast capital numinous.\n\nThe Dark Loft Banner, also called the Reverse Flower Banner, is the Jade Sovereign’s decree for summoning the Perfected and governing the numinous. \"Northern Bloom\" refers to the Northern Retained Spring Immortal Garden, called the Halting Bloom. \"Eastern Bend\" is the Eastern Ultimate Azure Florescence Heaven. The Nine Empyreans are the Divine Empyrean, Jade Empyrean, Grand Empyrean, Azure Empyrean, Green Empyrean, Crimson Empyrean, Scenic Empyrean, Supreme Empyrean, and Jade Empyrean. The Three Simplicities are the Three Simplicity Venerable Lords. \"Golden numinous radiance\" is the divine light of the Golden Elixir. \"Firmly upholds the summit\" is the name of the Three Simplicity Venerable Lords. \"Death-defying mechanism\" is the Death Gate. The Seven Awakenings correspond to the number of fire.\n\n*Great Cavern Talisman of the Peerless Master*\nRecitation of the Secret Incantation:",
      "overlap_context": "er,\n*Qi* floats in the southern blaze,\nSignifying the omen of transformed form and altered countenance.\n\n\"Ascending Brahma\" is the name of the Jade Sovereign Lord, Feng Ascending Brahma.\n\"Manifests peace\" is the name of the White Emperor of the Lungs, Zhang Anxing,\nStyled Western Florescence.\n\n\"Womb-Field\" refers to the immortal embryo congealed in the Cinnabar Field.\n\"Eight Luminaries\" are the Eight Radiant Scenes.\n\nGreat Cavern Supreme Unity Jade Talisman\n\nRecitation of the Secret Incantation:",
      "start_char": 2348,
      "end_char": 3163,
      "start_sentence": 156,
      "end_sentence": 212,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.353095531463623,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "左无英公子，名玄无叔，字合符子，一名元素君，一名神公子。 常镇我左腋之下：肝之后户。 在背去脊骨左三寸，与前左乳相对，左臂甲骨之下。 上皇先生紫宸君道经第四 太冥绝九玄， 洞景寄神通。 玉帝乘朱霄，绿霞焕金墉。 上馆云珠内，仰接无仞峰。 灵关太漠下，霭沫镜中空。 冥光混离子，玄上叔火王。 玮寂高同生，无极保谷童。 圆涂无凝滞，绮合有九重。 南拔七祖根，西解累叶凶。 体矫万津波。 神生摄十方。 火归反胎辕，三合乘天龙。 弗育邈，散兆生。 寄者，不着相也。 朱霄者，朱陵之天。 金墉者，九天馆名。 云珠者，九庭名，谓金墉馆在云珠庭内也。 太漠，指地户也。 霭即露电，沬即泡影，谓俯盻世尘，如霭沫也。 冥光者，左肾七真之字。 混离子，血中赤炁君名也。 玄上叔，谓 无英公子名也。 玮寂者，心君内名。 高同生，上玄元父君名也。 无极者，胞中黄炁君之字也。 保谷童子，结中元君精魂之名也。 绮合者，九天台名也。 南指南昌上官也，根乃胎根胞树。 西指西王母之都也，叶乃玄叶孙枝。 万津波，在绮合台下。 火归者，流金火铃之神，使火假上果也。 返心乾者，回度胎仙之车，於路绝道断之际也。 大洞白元玉符 服符微咒曰",
      "translated_text": "The Left Peerless Master, styled Master Profound-None, courtesy name Master Conjoined-Tally, also called Lord Primordial Essence or Divine Master. He constantly guards beneath my left armpit: the posterior portal of the liver. On the back, three inches left of the spine, opposite the left breast, beneath the scapula of the left arm.\n\n*Scripture of the Purple Empyrean of the Supreme August Master*, Chapter Four:\nThe Grand Obscurity severs the Nine Profounds,\nThe Cavern’s radiance lodges numinous communion.\nThe Jade Emperor rides the Crimson Empyrean,\nVerdant auroras illumine the Golden Ramparts.\nThe upper palace lies within the Cloud Pearl,\nGazing upward to the boundless peak.\nThe numinous pass beneath the Great Desert,\nMist and foam mirror the void.\nObscure light blends with the Child of Chaos,\nThe Fire King is Master Profound-Above.\nMarvelous quiescence shares life with the Lofty,\nThe Boundless guards the Valley Lad.\nThe round path knows no stagnation,\nWondrous union enfolds nine layers.\nSouthward, it severs the roots of the seven ancestors,\nWestward, it dissolves the misfortunes of successive generations.\nThe body leaps beyond the myriad ford-waves,\nThe spirit engenders and gathers the ten directions.\nFire returns to the reversed womb-chariot,\nThe Three Conjoined ride the celestial dragon.\nUnfathomable nurturance scatters omen and birth.\n\n\"Lodges\" means without attachment to form. \"Crimson Empyrean\" refers to the Crimson Mound Heaven. \"Golden Ramparts\" is the name of a palace in the Nine Heavens. \"Cloud Pearl\" is the name of a celestial court, meaning the Golden Ramparts Palace lies within the Cloud Pearl Court. \"Great Desert\" denotes the earthly portal. \"Mist\" signifies lightning-dew; \"foam\" signifies bubble-shadows, implying that gazing down upon the worldly dust is like mist and foam. \"Obscure light\" is the name of the Seven Perfected of the left kidney. \"Child of Chaos\" is the name of the Lord of Crimson Qi within the blood. \"Master Profound-Above\" refers to the name of the Peerless Master. \"Marvelous quiescence\" is the inner name of the Heart Lord. \"Lofty\" is the name of the Supreme Primordial Father Lord. \"Boundless\" is the name of the Lord of Yellow Qi within the womb. \"Valley Lad\" is the name of the essence-spirit of the Central Origin Lord of the Cauldrons. \"Wondrous union\" is the name of a terrace in the Nine Heavens. \"South\" points to the Upper Palace of Southern Prosperity; \"roots\" denote the root of the womb-tree. \"West\" points to the capital of the Queen Mother of the West; \"generations\" denote the branches of the profound lineage. \"Myriad ford-waves\" lie beneath the Wondrous Union Terrace. \"Fire returns\" refers to the spirit of the Flowing Gold Fire Bell, causing fire to ascend to the upper fruit. \"Reversed womb-chariot\" is the vehicle for returning and delivering womb immortals at the juncture where paths are severed and roads cut off.\n\n*Great Cavern Talisman of the White Prime*\nRecitation of the Secret Incantation:",
      "overlap_context": "e Empyrean, Green Empyrean, Crimson Empyrean, Scenic Empyrean, Supreme Empyrean, and Jade Empyrean. The Three Simplicities are the Three Simplicity Venerable Lords. \"Golden numinous radiance\" is the divine light of the Golden Elixir. \"Firmly upholds the summit\" is the name of the Three Simplicity Venerable Lords. \"Death-defying mechanism\" is the Death Gate. The Seven Awakenings correspond to the number of fire.\n\n*Great Cavern Talisman of the Peerless Master*\nRecitation of the Secret Incantation:",
      "start_char": 3163,
      "end_char": 3660,
      "start_sentence": 213,
      "end_sentence": 249,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.380024671554565,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "右白元尊神，名洞阳官蔚灵标，字玄夷绝，一名朱精，一名启成。 常镇我右腋之下，肺之后户。 在背去脊骨右三寸，与前乳相对，右臂甲骨之下。 太微天帝君道经第五 太微天帝君，八浮入云营。 神宗理灵襟，龙山秀玉京。 金房郁明霞，九户朗高琼。 黄庭涉北元，元父左回明。 朱精启明师，幽寥登上清。 四玄秉元禁，长保五帝城。 超滞天，横冥始。 八浮者，风之名也。 神宗者，中央司命君名也。 龙山者，玉清天中台名也。 明霞者，九天宫名。 高琼者，九天室名，谓九窍之户，通明於高琼之室也。 北元者，黄庭之幽阙也。 左回明，上玄元父君字也。 朱精者，白元尊神名也。 启明者，白素右元君名也。 幽寥者，太一君字也。 四玄者，四象也，四圣也，四体之神也。 五帝城，指五脏也。 大洞司命玉符 服符微咒曰",
      "translated_text": "The White Prime Venerable Deity on the right is named Wondrous Standard of the Luminous Yang Palace, styled Profound Yi of the Absolute, also called Vermilion Essence, also called Inaugurator of Completion. He constantly guards beneath my right armpit, behind the lung’s rear gate. On the back, three inches to the right of the spinal bone, opposite the right breast, and beneath the scapula of the right arm.\n\n*Scripture of the Dao of the Celestial Emperor of Grand Tenuity, Fifth Chapter*\nThe Celestial Emperor of Grand Tenuity—\nEight Floatings ascend to the Cloud Camp.\nDivine Ancestry governs the spirit’s lapel,\nDragon Mountain adorns Jade Capital.\nGolden Chambers luxuriate in bright auroras,\nNine Portals gleam with lofty jasper.\nYellow Court traverses Northern Origin,\nPrimal Father turns left to illumine.\nVermilion Essence, Inaugurator of the Luminous Master,\nIn profound solitude ascends Supreme Clarity.\nFour Profounds uphold the Primal Prohibition,\nEver guarding the Five Thearchs’ City.\nTranscending stagnation in Heaven,\nTraversing the inception of the Dark Obscurity.\n\nEight Floatings is the name of a wind. Divine Ancestry is the name of the Central Controller of Destiny. Dragon Mountain is the name of the Central Terrace in the Jade Clarity Heaven. Bright Aurora is the name of a Nine Heavens Palace. Lofty Jasper is the name of a Nine Heavens Chamber, referring to the nine orifices’ gates that communicate with the luminous Lofty Jasper Chamber. Northern Origin is the secluded portal of the Yellow Court. Left-Turning Illumination is the style of the Supreme Primal Father Lord. Vermilion Essence is the name of the White Prime Venerable Deity. Inaugurator of the Luminous is the name of the White Primordial Right Origin Lady. Profound Solitude is the style of the Grand One Lord. Four Profounds denote the Four Symbols, the Four Sages, and the spirits of the four limbs. Five Thearchs’ City refers to the five viscera.\n\n*Great Cavern Controller of Destiny Jade Talisman*\nRecitation of the Secret Incantation:",
      "overlap_context": "to the capital of the Queen Mother of the West; \"generations\" denote the branches of the profound lineage. \"Myriad ford-waves\" lie beneath the Wondrous Union Terrace. \"Fire returns\" refers to the spirit of the Flowing Gold Fire Bell, causing fire to ascend to the upper fruit. \"Reversed womb-chariot\" is the vehicle for returning and delivering womb immortals at the juncture where paths are severed and roads cut off.\n\n*Great Cavern Talisman of the White Prime*\nRecitation of the Secret Incantation:",
      "start_char": 3660,
      "end_char": 4003,
      "start_sentence": 250,
      "end_sentence": 274,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.98648738861084,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "中央司命丈人君，名理明初，字玄度卿，一名神宗，一名灵华。 常镇我绛宫心房之中，四孔之户。 心有七窍，神名丕，曰法垣、曰朱霄、曰丹皇、运珠、曰神慧、曰洞源、洞明。 三元紫精君道经第六 紫精太元中，三元上景衢。 秀朗宝太混，眇眇扇帝敷。 伯史启三素，帝灵登玉虚。 庆炁育五云，司命神明初。 十华妙行仙，制魔羽明车。 骞苞庭，盻猷已。 上景者，日官也。 秀朗者，九天台名也。 帝敷者，帝座也。 伯史原，黄庭元王名也。 三素者，三素老君也。 帝灵者，帝一之名也。 神明初，中央司命君名也。 十华者，十极之天也。 羽明，车名也。 大洞桃康玉符 服符微祝曰",
      "translated_text": "Central Controller of Destiny Venerable Lord,\nwhose name is Li Mingchu,\nwhose style is Xuandu Qing,\nalso called Divine Ancestor,\nalso called Numinous Radiance.\nHe constantly guards within my Crimson Palace’s heart chamber,\nthe gates of its four apertures.\nThe heart has seven orifices,\nwhose spirits are named:\nPi, called Dharma Enclosure;\nZhu Xiao;\nCinnabar Sovereign;\nMoving Pearl;\nDivine Wisdom;\nCavern Source;\nand Cavern Clarity.\n\n*Third Scripture of the Three Primes’ Purple Essence*\nWithin the Purple Essence of the Great Prime,\nthe Three Primes’ Upper Radiance Way:\nResplendent and bright, the Treasure of the Great Chaos,\ndim and distant, it unfurls the Thearch’s seat.\nElder Scribe initiates the Three Simplicities,\nthe Thearch’s spirit ascends to Jade Clarity.\nAuspicious qi nurtures the five clouds,\nthe Controller of Destiny, Divine Bright Beginning.\nTen Radiant Perfected Immortals of Wondrous Conduct,\ncommanding demon-quelling Feathered Bright Chariots.\nThe blossoming courtyard—\nits gaze and plans now fulfilled.\n\nUpper Radiance refers to the Solar Office.\nResplendent Brightness is the name of a Nine Heavens Terrace.\nThearch’s Seat refers to the Thearch’s throne.\nElder Scribe is the name of the Primordial Sovereign of the Yellow Court.\nThree Simplicities refers to the Three Simplicity Venerable Lords.\nThearch’s Spirit is the name of the Thearch-One.\nDivine Bright Beginning is the name of the Central Controller of Destiny Lord.\nTen Radiant refers to the Ten Poles Heaven.\nFeathered Bright is the name of a chariot.\n\n*Great Cavern Peach Well-Being Jade Talisman*\nRecitation of the Secret Incantation:",
      "overlap_context": "Turning Illumination is the style of the Supreme Primal Father Lord. Vermilion Essence is the name of the White Prime Venerable Deity. Inaugurator of the Luminous is the name of the White Primordial Right Origin Lady. Profound Solitude is the style of the Grand One Lord. Four Profounds denote the Four Symbols, the Four Sages, and the spirits of the four limbs. Five Thearchs’ City refers to the five viscera.\n\n*Great Cavern Controller of Destiny Jade Talisman*\nRecitation of the Secret Incantation:",
      "start_char": 4003,
      "end_char": 4282,
      "start_sentence": 275,
      "end_sentence": 295,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.557886838912964,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "命门桃康君，名孩道康，字合精延，一名命门，一名胞根。 常镇我脐中之关，命门之外。 在脐下三寸，其形方圆一寸，男藏精，女藏胎，下丹田也。 真阳元老玄一君道经第七 真阳帝宝老，受事会玉皇。 灭魔除秽水，百司诣绛宫。 逸宅丹玄内，五炁结十方。 七转司命至，三回召仙翁。 太山主鬼者，急校三官中。 十德初成基，同飞七觉充。 玄握沙，称福神。 真阳者，上清天中馆名也。 帝宾，左仙仲成子名也。 秽水者。 尸秽之水也。 绛官谓心也。 逸宅者，真炁之明堂也。 丹玄，即泥丸之宫。 七转者，念头也，一念才动，七窍俱通，谓举念而司命至也。 主鬼者，岳神也。 大洞天户玉符 服符微祝曰 泥丸上一天帝君，名赤子玄凝天，字三元光，一名伯无上，一名伯史原。 常镇泥丸之中，九孔之户。 即上丹田，内有九宫，四雌五雄，各方一寸，其形内圆虚中，红而莹，乃神之所居。 其后户有两脉，贯於脊骨之端。 上元太素三元君道经第八 太素三华炁，晨灯广灵堂，玉宾表玄籍，守命孩道康。 回风散万魔，金符召广乡。 辅卫地户内，保此长生王。 转入十仙门，八景齐洞阳。 明柱子，会合存。 三华者，三华聚顶也。 神灯者，灵光也。 玉宾者，三元君所居馆名也。 孩道康，命门桃康君名也。 召广乡，召登广漠之乡也。 地户者，阴魔之门。 辅卫，即封形闭债，背土凌空之事。 洞阳者，白元尊神名也。 大洞丹皇玉符 服符微祝曰 绛宫中一丹元君，名皇神运珠，字子南丹，一名生上伯，一名史云拘。 常镇我顶中央，大椎骨首户之下。 人脊骨有二十四椎，上第一椎是也。 上清紫精三素君道经第九 紫精毓华林，长明太无外。 玉房生宝云，九扇胞胎内。 帝宾奉五符，三元回紫盖。 仓玉斌来生，卫此长夜会。 五灵度符籍，九统合九元。 三玄出太清，紫阳发万玄。 玄精育九灵，元父结胎仙。 乐伯勒，飞明贤。 紫精者，天中之树，叶似竹而赤，花似镜而明，实似李而无核，食其叶则辟饥，花则不死，实则飞仙，名毓华之林。 九扇者，九重之门，乃帝一胎尊所居之处。 帝宾者，左仙仲成子之名也。 三元者，上元泥九、中元绛官、下元命门也。 紫盖者，黄庭门名。 仓玉斌来生者，节中黑炁君，名斌来生，字仓玉也。 长夜者，节中黑炁所会之名也。 五灵者，五老君也。 三玄者，道之三真也。 紫阳者，官名。 玄精者，胆中八真名。 九灵者，天之九魂也。 大洞黄庭玉符 服符微祝曰 命门下一黄庭元王，名始明精，字元阳昌，一名始童神，一名藏明初，一名婴儿胎，一名史伯原。 常镇我两完间，车轴之下户。 脊骨下第二十四椎是也，与尾闾并两腿、臂骨相连缀耳，运动载身，若车之有轴也。 腰胯当中是也。 青灵安阳元君道经第十 青灵扇八炁，鼓轮三华城。 披此胞胎结，七祖受福生。 宿对灭五道，长守帝一营。 望昌谒，顺万烟。 披者，脱体之义。 五道，即五苦。 灭之者，生神章云：五难缘理去，是也。 大洞九真玉符 服符微祝曰 泥丸九真，名帝真上皇，字帝先灵，一名元宗。 常镇我口之四际。 想自顶上是也。 口神，一名清净和。 皇清洞真大道君道经第十 公子执五符，太一居紫房。",
      "translated_text": "**Peach Well-Being Lord of the Gate of Destiny**, named Child Dao-Kang, styled Harmonizing Essence-Extension, also called Gate of Destiny, also called Root of the Womb. Ever guards the pass within my navel, beyond the Gate of Destiny. Located three inches below the navel, its form is one inch square and round. In men, it stores essence; in women, it stores the fetus—this is the Lower Cinnabar Field.\n\n*True Yang Primordial Elder Mysterious Unity Lord’s Scripture, Chapter Seven*\nTrue Yang Thearch-Treasure Elder,\nreceives affairs in audience with the Jade Thearch.\nExtinguishes demons, purges filth-water,\na hundred offices journey to the Crimson Palace.\nWithin the Leisure Abode of Cinnabar Mystery,\nthe five qi congeal the ten directions.\nSeven revolutions summon the Controller of Destiny,\nthree returns call the Immortal Elders.\nThe Mount Tai Lord of Ghosts\nhastens to examine the Three Offices.\nTen virtues form the initial foundation,\ntogether ascending, the Seven Awakenings fill.\n\n\"Grasping dark sand, count the Fortune Spirits.\"\n\nTrue Yang refers to the name of a hall in the Upper Clarity Heaven.\nThearch-Guest is the name of Left Immortal Zhongchengzi.\nFilth-water refers to the water of corpse-filth.\nCrimson Palace means the heart.\nLeisure Abode is the Bright Hall of true qi.\nCinnabar Mystery is the Palace of Mud-Pill.\nSeven revolutions refer to the thought-moment—once a thought stirs, the seven apertures all open, meaning that by raising a thought, the Controller of Destiny arrives.\nLord of Ghosts is the mountain spirit.\n\n*Great Cavern Heaven-Gate Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Upper One Heavenly Thearch of Mud-Pill**, named Red Child Mysterious Congealed Heaven, styled Three Primordials Radiance, also called Elder Non-Supreme, also called Elder Scribe-Origin. Ever guards the center of Mud-Pill, the gate of the nine apertures. This is the Upper Cinnabar Field, within which are nine palaces—four feminine, five masculine—each one inch square, their form internally round and hollow, radiant and lustrous, the dwelling of the spirits. Behind this gate lie two vessels, penetrating the tip of the spinal column.\n\n*Upper Primordial Grand Simplicity Three Primordials Lord’s Scripture, Chapter Eight*\nGrand Simplicity’s Three-Flower Qi,\nmorning lamp of the Broad Spirit Hall.\nJade Guest displays the Mysterious Register,\nguarding the life of Child Dao-Kang.\nWhirling winds scatter ten thousand demons,\ngolden talismans summon the Broad Realm.\nAssisting and defending within the Earth Gate,\npreserve this King of Longevity.\nTurning to enter the Ten Immortals’ Gate,\nthe Eight Effulgences unite in Luminous Yang.\n\n\"Bright Pillar Child, gather and hold in contemplation.\"\n\nThree Flowers refer to the Three Flowers Gathered at the Crown.\nSpirit Lamp is the numinous light.\nJade Guest is the name of the hall where the Three Primordials Lords reside.\nChild Dao-Kang is the name of the Peach Well-Being Lord of the Gate of Destiny.\nSummoning the Broad Realm means calling to ascend the vast desert realm.\nEarth Gate is the gate of yin demons.\nAssisting and defending refer to sealing the form, closing debts, turning the back to earth, and soaring into emptiness.\nLuminous Yang is the name of the White Prime Honored Spirit.\n\n*Great Cavern Cinnabar August Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Central One Cinnabar Prime Lord of the Crimson Palace**, named August Spirit Moving Pearl, styled Child South Cinnabar, also called Life’s Upper Elder, also called Scribe Cloud-Restrained. Ever guards the center of my crown, below the gate of the great vertebra’s head. The human spine has twenty-four vertebrae; the uppermost first vertebra is this.\n\n*Upper Clarity Purple Essence Three Simplicities Lord’s Scripture, Chapter Nine*\nPurple Essence nurtures the Flowering Grove,\neternally luminous beyond the Great Non-Existent.\nJade Chamber generates treasure-clouds,\nwithin the nine-fold womb’s interior.\nThearch-Guest presents the five talismans,\nthe Three Primordials return with the Purple Canopy.\nGranary Jade Refines Life,\nguarding this Long Night Assembly.\nFive Numinous traverse the talisman-registers,\nthe Nine Unities unite the Nine Origins.\nThree Mysteries emerge from Grand Clarity,\nPurple Yang sends forth ten thousand mysteries.\nMysterious Essence nurtures the Nine Numinous,\nPrimordial Father knits the Womb Immortals.\n\n\"Joyous Elder reins in, soaring Bright Worthies.\"\n\nPurple Essence is a tree in heaven—its leaves resemble bamboo but are red, its flowers resemble mirrors but are bright, its fruit resembles plums but has no pit. Eating its leaves averts hunger, its flowers prevent death, its fruit bestows flight as an immortal—this is called the Grove of Nurturing Flowers.\nNine-fold refers to the nine-layered gates, the dwelling of the Womb Venerable of the Thearch-One.\nThearch-Guest is the name of Left Immortal Zhongchengzi.\nThree Primordials are the Upper Primordial Mud-Pill, Middle Primordial Crimson Palace, and Lower Primordial Gate of Destiny.\nPurple Canopy is the name of the Yellow Court’s gate.\nGranary Jade Refines Life refers to the Black Qi Lord of the Nodes, named Refines Life, styled Granary Jade.\nLong Night is the name of the assembly of Black Qi at the nodes.\nFive Numinous are the Five Elder Lords.\nThree Mysteries are the Three Perfected of the Dao.\nPurple Yang is the name of an office.\nMysterious Essence is the name of the Eight Perfected within the gallbladder.\nNine Numinous are the nine souls of heaven.\n\n*Great Cavern Yellow Court Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Yellow Court Primordial King below the Gate of Destiny**, named Origin Bright Essence, styled Primordial Yang Prosperity, also called Origin Child Spirit, also called Concealed Bright Beginning, also called Infant Womb, also called Scribe Elder-Origin. Ever guards the gate between my two kidneys, below the axle. This is the twenty-fourth vertebra below the spine, connected to the tailbone and both legs and arm bones, moving and bearing the body like an axle for a chariot. This is the center of the waist and hips.\n\n*Azure Numinous Peaceful Yang Primordial Lord’s Scripture, Chapter Ten*\nAzure Numinous fans the eight qi,\ndrumming the wheels of the Three-Flower Citadel.\nDonning this, the womb’s knitting is complete,\nseven ancestors receive blessed life.\nKarmic opposition extinguishes the Five Paths,\neternally guarding the Thearch-One’s encampment.\n\n\"Gaze upon Prosperity, follow the ten thousand vapors.\"\n\nDonning means the meaning of shedding the body.\nFive Paths refer to the Five Sufferings.\nExtinguishing them is as the *Scripture of Spirit Generation* says: \"The five difficulties depart through principle.\"\n\n*Great Cavern Nine Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Nine Perfected of Mud-Pill**, named Thearch-True Supreme August, styled Thearch-Prior Spirit, also called Primordial Ancestor. Ever guards the four borders of my mouth. Envision this above the crown. The mouth spirit is also called Pure Tranquility Harmony.\n\n*August Clarity Cavern-True Great Dao Lord’s Scripture, Chapter Ten*\nDuke’s Son holds the five talismans,\nthe Great One resides in the Purple Chamber.",
      "overlap_context": "ens Terrace.\nThearch’s Seat refers to the Thearch’s throne.\nElder Scribe is the name of the Primordial Sovereign of the Yellow Court.\nThree Simplicities refers to the Three Simplicity Venerable Lords.\nThearch’s Spirit is the name of the Thearch-One.\nDivine Bright Beginning is the name of the Central Controller of Destiny Lord.\nTen Radiant refers to the Ten Poles Heaven.\nFeathered Bright is the name of a chariot.\n\n*Great Cavern Peach Well-Being Jade Talisman*\nRecitation of the Secret Incantation:",
      "start_char": 4282,
      "end_char": 5575,
      "start_sentence": 296,
      "end_sentence": 383,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.848331928253174,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "三合地户下，拔命玉帝宫。 少女郁墨子，卫兆七炁窗。 拘制盛血液，盈满五藏充。 十真登黄房，帝子化金仙。 白玉飞符招，引升龙台天。 回素充，吉求静。 公子者，无英公子也。 五符者，五文真符也。 三合者，皇清元君，女之高仙； 洞真真人，男之高仙，即雌一、雄一之异名，二真与太一合化於广漠之境，故曰三合。 地户，即坤宫也。 郁墨子，皇一魂女之内名。 七炁者，七情也，一曰七窍，未详孰是。 拘制者，九元真男名也。 十真者，妙行十全，位登太上黄房也。 龙台，天宫名也。 大洞八真玉符 服符微祝曰 胆中八真，名合景君，字北台，一名玄精。 常镇我背中骨节之府。 一名威明，上一椎丹皇君守之，下第一椎黄庭王守之，上七节玄阳七真守之，中七节玄阴七真守之，下七节胆中八神守之。 高上太素君道经第十二 高上宴紫霄，五老辅玉根。 太素拂眇景，合符帝一前。 白帝号蔚将，回金太霞乡。 度我死户下，拔出三涂梁。 十通由斯生，妙行由此圆。 洞明光景中，帝一真玄玄。 和归落，结舒永。 玉根者，天中之山名，或以为人之鼻也。 眇景者，日名。 白帝浩蔚将者，白帝运浩景之炁，於蔚将之官也。 十通者，谓十真事毕，妙澄十通，自一至十，皆天地之数，此道通天地之外，阴阳莫能拘，罪福莫能报，超出天地定数，故曰十通。 大洞左七真玉符 服符微祝曰",
      "translated_text": "Beneath the Three Convergences at Earth’s Gate,\ndraw forth the life from the Jade Thearch’s Palace.\nMaiden Yu Mozi guards the omen of the Seven Qi’s window.\nRestraining and regulating, the flourishing blood and fluids\nfill and satisfy the five viscera to abundance.\nThe Ten Perfected ascend the Yellow Chamber,\nthe Thearch’s Son transforms into a Golden Immortal.\nWhite Jade Flying Talisman summons,\nleading the ascent to Dragon Terrace Heaven.\nReturn to purity, fulfill; auspicious seeking, still.\n\nThe Duke’s Son is Nonexistent Hero Duke’s Son.\nThe five talismans are the Five Script True Talismans.\nThe Three Convergences: August Clarity Primordial Lady, the highest immortal among women;\nCavern-True Perfected, the highest immortal among men—\nthese are the alternate names of Female One and Male One.\nThe Two Perfected unite with the Great One to transform within the vast expanse,\nhence called the Three Convergences.\nEarth’s Gate is the Palace of Kun.\nYu Mozi is the inner name of August One’s Hun Maiden.\nThe Seven Qi refer to the seven emotions; another says the seven apertures—\nit is unclear which is correct.\nRestraining and regulating is the name of Nine Origin True Man.\nThe Ten Perfected: with tenfold wondrous conduct complete,\none ascends to the Supreme Yellow Chamber.\nDragon Terrace is the name of a heavenly palace.\n\n*Great Cavern Eight Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Eight Perfected of the Gallbladder**, named Uniting Radiance Lord, styled North Terrace, also called Mysterious Essence. Ever guards the mansion of my spine’s bone joints. Also named Majestic Luminance. The Cinnabar Thearch Lord guards the uppermost vertebra; the Yellow Court King guards the first vertebra below; the Seven Perfected of Mysterious Yang guard the upper seven vertebrae; the Seven Perfected of Mysterious Yin guard the middle seven vertebrae; the Eight Spirits of the Gallbladder guard the lower seven vertebrae.\n\n*Highest Supreme Primordial Lord’s Scripture, Chapter Twelve*\n\nThe Highest Supreme feasts in Purple Empyrean,\nthe Five Elders assist the Jade Root.\nPrimordial Purity brushes the subtle radiance,\nuniting the talisman before the Thearch-One.\nWhite Thearch is titled Vast General,\nreturning to the Golden Supreme Rosy Clouds Land.\nPassing beneath my Death’s Gate,\ndrawing forth from the Three Paths’ bridge.\nThe Ten Penetrations arise from this,\nwondrous conduct is perfected thereby.\nWithin the Cavern’s luminous radiance,\nthe Thearch-One’s true mystery is profound.\nHarmony returns, falling; knotting unfolds, eternal.\n\nThe Jade Root is the name of a mountain in heaven, or taken as the human nose.\nSubtle radiance is the name of the sun.\nWhite Thearch Vast General: the White Thearch moves the vast radiance’s qi\nwithin the Vast General’s palace.\nThe Ten Penetrations: when the ten true matters are complete,\nwondrous clarity achieves the Ten Penetrations.\nFrom one to ten, all are the numbers of heaven and earth.\nThis Dao transcends beyond heaven and earth;\nyin and yang cannot restrain it,\nsin and fortune cannot requite it.\nSurpassing the fixed numbers of heaven and earth,\nhence called the Ten Penetrations.\n\n*Great Cavern Left Seven Perfected Jade Talisman*\nRecitation of the Secret Incantation:",
      "overlap_context": "le.\"\n\n*Great Cavern Nine Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\n**Nine Perfected of Mud-Pill**, named Thearch-True Supreme August, styled Thearch-Prior Spirit, also called Primordial Ancestor. Ever guards the four borders of my mouth. Envision this above the crown. The mouth spirit is also called Pure Tranquility Harmony.\n\n*August Clarity Cavern-True Great Dao Lord’s Scripture, Chapter Ten*\nDuke’s Son holds the five talismans,\nthe Great One resides in the Purple Chamber.",
      "start_char": 5575,
      "end_char": 6133,
      "start_sentence": 384,
      "end_sentence": 418,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.4397394657135,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "左肾间七真，名玄阳君，字冥光，一名元生，一名玄冥，一名五帝。 常镇我背骨尽际，地户之下。 皇上四老道中君道经第十三 皇上超无景，输转九曜生。 徊风混帝心，八炁运常宁。 广霞参神天，五帝散日精。 液溢玄中漠，血凝五华平。 体宝圆珠□，流曜莹兆形。 号为寿逸阜，亦曰澄溱渟。 俱济三恶关，启籍登太冥。 令我保仙真，七世披绿青。 解祸冥途中，超福晨上灵。 度世登玉卿，累祖返胎婴。 洞观无碍空，始通生圆明。 骊珠贯方瞳，内外洞照清。 三乐深，五达门。 九曜者，日名，又云眼为日轮也。 广霞者，玉清山名。 五华者，五脏也。 寿逸阜，九天山名，号延寿之国。 三恶关，鬼关也。 绿青者，服青华之炁。 登玉卿，位登玉府上卿也。 圆明者，日月也。 三乐深五达门者，九天祝言，皇上君内名也。 或释之曰：法轮回道上生。 大洞右七真玉符 服符微祝曰 右肾间七真，名玄阴君，字太真，一名上生。 常镇我背下骨，玉关之户。 玉晨太上大道君道经第十四 玉晨九天司，太上大道君。 常保景化内，九回镜上清。 解带玉＠室，乘素入四明。 携提日中王，并羽玉晨灵。 太一召天魔，帝君致万精。 拔过死积炁，越度仙皇庭。 帝立三关上，八风舞神兵。 左挹福醴液，右提庆元軿。 洞微无障玄，梵通明灵生。 贯颡闻十方，豁落一切声。 泓郁遐，渡法令。 景化者，三景道化也。 九回者，金丹九转也。 镜上清者，以大微小童，驾羽明之车，上朝元始，如求镜裹之形也。 四明者，玉帝南门之名也。 左挹右提者，谓左耳斟右肾之水，右耳酌左肾之水。 梵通明灵者，妙通大梵，聪明达灵也。 贯颡闻十方者，灵音贯颡，流响云营也。 大洞六真玉符 服符微祝曰 肺中六真，名上元素玉君，字梁南中童。 常镇我颈外，十二间梁之中。 十二间梁，肺筒两边也。 盖颈两条，各有六条大筋。 存法，一神守二梁也。 太清大道君道经第十五 太清浮绝空，三天宝神符。 日中开五晖，青帝圆常无。 捧籍登太明，受箓金华楼。 五脏植玉根，魂魄一凝和。 洞空清净玄，炁通生清明。 定和妙明觉，玄息自长生。 明考梨，拔劫阿。 浮绝空，太清山名，应鼻为中岳。 太明者，日宫名也。 金华楼，太清楼名。 玉根，鼻神名也。 玄息者，象龟引炁，以耳不以鼻，是为玄息。 大洞五真玉符 服符祝曰",
      "translated_text": "Between the left kidney dwell the Seven Perfected, named Dark Yang Lord, styled Mystic Radiance, also called Primal Birth, Dark Mystery, and the Five Thearchs. They ever guard the farthest reaches of my spine, beneath the Earth Gate.\n\n*August Sovereign’s Four Elders Dao-Middle Lord’s Scripture, Chapter Thirteen*\nAugust Sovereign transcends the formless,\nrevolving the Nine Luminaries into life.\nWhirling winds blend the Thearch’s heart,\nEight Qi circulate in constant peace.\nVast rosy clouds intermingle with divine heavens,\nFive Thearchs scatter the sun’s essence.\nFluids overflow the Dark Void’s desert,\nblood congeals, the Five Flowers level.\nThe body’s treasure is a perfect pearl,\nflowing radiance gleams, revealing its form.\nNamed Longevity’s Abundant Leisure,\nalso called Clarity’s Deep Pool.\nTogether they cross the Three Evil Passes,\nopen the register to ascend Great Darkness.\nLet me preserve the immortal perfected,\nseven generations don robes of green and azure.\nUntie calamities on the dark road,\nsurpass blessings to rise with dawn’s spirits.\nCross the world to ascend Jade Ministers,\nancestors return to the womb’s infancy.\nPeer through the unobstructed emptiness,\nfirst penetrate the living’s perfect clarity.\nBlack pearls string through square pupils,\nwithin and without, all is luminously clear.\n\nThree Joys profound, Five Gates open.\n\nThe Nine Luminaries are the sun’s name, or the eyes called solar wheels. Vast rosy clouds are the name of Jade Clarity Mountain. The Five Flowers are the five viscera. Longevity’s Abundant Leisure is a mountain of the Nine Heavens, the land called Extended Life. The Three Evil Passes are the demonic gates. Green and azure refer to absorbing the qi of Azure Flower. Ascending Jade Ministers means attaining the rank of Upper Minister in the Jade Bureau. Perfect clarity refers to the sun and moon. Three Joys profound, Five Gates open is the inner name of the August Sovereign in the Nine Heavens’ invocation. Some interpret it as the Dharma Wheel revolving on the path of rebirth.\n\n*Great Cavern Right Seven Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\nBetween the right kidney dwell the Seven Perfected, named Dark Yin Lord, styled Supreme Perfected, also called Upper Birth. They ever guard my lower spine, the gate of Jade Pass.\n\n*Jade Dawn Supreme Great Dao Lord’s Scripture, Chapter Fourteen*\nJade Dawn governs the Nine Heavens,\nSupreme Great Dao Lord.\nEver preserving the radiant transformations within,\nNine Revolutions mirror Upper Clarity.\nLoosening the sash in the Jade Seal Chamber,\nriding plainness to enter the Four Clarities.\nCarrying the sun’s central king,\nfeathered immortals join Jade Dawn’s spirits.\nGreat One summons celestial demons,\nThearch Lords gather the myriad spirits.\nPull free the accumulated qi of death,\nleap beyond to the immortal thearchs’ court.\nThearchs stand above the Three Passes,\nEight Winds dance with divine soldiers.\nLeft ladle the nectar of fortune,\nright grasp the chariot of primal blessings.\nPenetrate the subtle without obstruction,\nBrahma’s path connects luminous life.\nPiercing the forehead, hear the ten directions,\nvast and open, all sounds.\nProfoundly serene, crossing the Dharma’s decree.\n\nRadiant transformations refer to the Dao’s transformations of the Three Radiance. Nine Revolutions are the nine cycles of the golden elixir. Mirroring Upper Clarity means that with the Lesser Lad of Great Tenuity driving the feathered luminous chariot to pay court to the Origin Prime, it is like seeking one’s form within a mirror. The Four Clarities are the name of the Jade Thearch’s southern gate. Left ladle and right grasp refer to the left ear drawing water from the right kidney and the right ear drawing water from the left kidney. Brahma’s path connects luminous life means wondrously penetrating Great Brahma, attaining keen hearing and luminous spirit. Piercing the forehead to hear the ten directions means the spirit’s sound pierces the forehead, its resonance flowing through the cloud camps.\n\n*Great Cavern Six Perfected Jade Talisman*\nRecitation of the Secret Incantation:\n\nWithin the lungs dwell the Six Perfected, named Upper Prime Pure Jade Lord, styled Liang Southern Lad. They ever guard the outside of my neck, within the Twelve Interval Beams. The Twelve Interval Beams are the two sides of the lung’s cylinder. The neck has two columns, each with six great sinews. In the visualization method, one spirit guards two beams.\n\n*Supreme Clarity Great Dao Lord’s Scripture, Chapter Fifteen*\nSupreme Clarity floats in the absolute void,\nThree Heavens’ treasure divine talismans.\nWithin the sun, the Five Splendors open,\nAzure Thearch circles in constant nothingness.\nHolding the register, ascend Great Clarity,\nreceive the writ in the Golden Flower Tower.\nFive viscera plant the Jade Root,\nsoul and spirit unite in harmonious congealment.\nPenetrate emptiness, pure and tranquil,\nqi connects, life’s clarity arises.\nStable harmony, wondrous luminous awakening,\nmysterious breathing naturally grants long life.\nIllumine the pear, uproot the kalpa’s net.\n\nFloating absolute void is the name of Supreme Clarity Mountain, corresponding to the nose as the Central Marchmount. Great Clarity is the name of the solar palace. Golden Flower Tower is the name of Supreme Clarity’s tower. Jade Root is the name of the nose spirit. Mysterious breathing refers to the turtle’s method of drawing qi, using the ears rather than the nose.\n\n*Great Cavern Five Perfected Jade Talisman*\nRecitation of the Incantation:",
      "overlap_context": "diance’s qi\nwithin the Vast General’s palace.\nThe Ten Penetrations: when the ten true matters are complete,\nwondrous clarity achieves the Ten Penetrations.\nFrom one to ten, all are the numbers of heaven and earth.\nThis Dao transcends beyond heaven and earth;\nyin and yang cannot restrain it,\nsin and fortune cannot requite it.\nSurpassing the fixed numbers of heaven and earth,\nhence called the Ten Penetrations.\n\n*Great Cavern Left Seven Perfected Jade Talisman*\nRecitation of the Secret Incantation:",
      "start_char": 6133,
      "end_char": 7087,
      "start_sentence": 419,
      "end_sentence": 489,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.932284355163574,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "脾中五真，名养光君，字太仓子，一名羽台子。 常镇我喉内，极根之户。 上有横文，中黄之正印。 极根，乃重楼十二，环之左右，各有一户，正与炁颡之左右密相连。 炁颡，名三思台。 太极大道君道经第十六 太极元景王，三天摄神仙。 紫素翳郁仞，安来上华京。 拔出五苦界，返胎七元庭。 九玄解重结，累祖落冤名。 徘徊秀华下，俯仰邀五灵。 兆身升玉堂，五神回孩婴。 俱济太漠外，养素朝圆明。 洞虚清诤和，华通引玄冥。 舐练五芽味，含善吐长生。 回圆明，神初罗。 翳郁仞者，紫素左元君名。 华京，乃元君所都之处。 秀华者，天中之山名也。 圆明者，日之名也。 清净和者，口为太和之官。 玄冥者，肾神名。 舌下为华池，内有二窍，下通肾水，谓华舌，妙通玉华也。 徊圆明神罗初者，九天祝言，元景君内名也。 或释之曰：晖履安固止身。 见茅山大洞经，天上内音，地上外音。 大洞四真玉符 祝曰",
      "translated_text": "Within the spleen dwell the Five Perfected, named Lord Nourishing Radiance, styled Master Great Granary, also called Master Feather Terrace. They ever guard my throat’s innermost gate, the Portal of the Utmost Root. Above it lies the transverse script, the true seal of Central Yellow. The Utmost Root comprises the Twelve-Storied Tower, encircled left and right by a pair of portals, each precisely aligned with the lateral apertures of the Qi Forehead. The Qi Forehead is named Terrace of Triple Reflection.\n\n*Dao Scripture of the Great Ultimate Lord of Primordial Effulgence, Chapter Sixteen*\nThe Primordial Effulgence King of the Great Ultimate,\nThree Heavens’ divine immortals converge.\nPurple Simplicity veils towering heights,\nserene they ascend to Upper Florescence Capital.\nUprooted from the Five Realms of Suffering,\nreturned to the womb of the Seven Primordials’ court.\nNine Mysteries unravel layered knots,\nancestral burdens shed their grievous names.\nLingering beneath Flourishing Florescence,\nreverent they summon the Five Spirits.\nThe adept’s body ascends the Jade Hall,\nthe Five Gods revert to infancy.\nTogether they cross beyond the Great Vast,\nnurturing purity to attend Round Clarity.\nPenetrating emptiness, pure and harmonious,\nFlorescence pervades, guiding the Mysterious Dark.\nRefining the Five Sprouts’ savor with the tongue,\nembracing goodness, exhaling longevity.\nRevolve Round Clarity, the spirit’s primal net.\n\nPurple Simplicity veiling towering heights refers to the name of the Left Primordial Lord. Florescence Capital is the abode where the Primordial Lord resides. Flourishing Florescence is the name of a mountain in the midst of heaven. Round Clarity is the name of the sun. Pure and harmonious refers to the mouth as the office of Supreme Harmony. Mysterious Dark is the name of the kidney spirit. Beneath the tongue lies the Flowery Pool, containing two apertures that descend to connect with kidney water—this is the Flowery Tongue, wondrously linked to Jade Florescence. \"Revolve Round Clarity, the spirit’s primal net\" is the inner name of the Effulgence Lord in the Nine Heavens’ incantation. Alternate interpretation: \"Radiant tread firmly secures the body.\" As seen in the *Great Cavern Scripture of Mount Mao*, celestial inner sound and earthly outer sound.\n\n*Great Cavern Four Perfected Jade Talisman*\nRecitation of the Incantation:",
      "overlap_context": " long life.\nIllumine the pear, uproot the kalpa’s net.\n\nFloating absolute void is the name of Supreme Clarity Mountain, corresponding to the nose as the Central Marchmount. Great Clarity is the name of the solar palace. Golden Flower Tower is the name of Supreme Clarity’s tower. Jade Root is the name of the nose spirit. Mysterious breathing refers to the turtle’s method of drawing qi, using the ears rather than the nose.\n\n*Great Cavern Five Perfected Jade Talisman*\nRecitation of the Incantation:",
      "start_char": 7087,
      "end_char": 7473,
      "start_sentence": 490,
      "end_sentence": 517,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.485485315322876,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "肝中四真，名青明君，字明轮童子。 常镇我胃管之户，膏膜之下。 五脏唯心肺居膈上，今存神在胃口之外，胃管之户，乃咽食物处，膏膜，即膏肓之膜。 皇初紫元灵元君道经第十七 皇初紫元中，晖光郁霄清。 三天焕九景，离合亿万生， 披朱巾绿霞，上徊寒童灵。 拔出五苦毒，超身过始青。 白素起萧仞，金门卫朱兵。 七祖积尸结，一化百散倾。 受福东霞室，返胎朱火庭。 洞神清诤妙，力通自冲明。 净真手握斗，足蹑九元星。 挥执天地关，精神生命根。 发迁合，光运长。 九景者，九日并出也。 寒童灵，九天山名。 启明萧仞，白素右元君名也。 九元星者，九灵之罡也。 天地关，手为天关，足为地关。 发迁合光运长者，九天祝言。 大洞三真玉符 祝曰 精血三真，名元生君，字黄宁子玄。 常镇我鼻两孔之下源。 鼻准头内，名玄达之户，俗云鼻尖。 元英中真上老道经第十八 无英真上玄，玄元素炁郁。",
      "translated_text": "Within the liver dwell the Four Perfected, named the Azure Luminance Lord, styled Bright Wheel Lad. They ever guard the gate of my gastric tube, beneath the fatty membrane. Of the five viscera, only the heart and lungs reside above the diaphragm; now, storing the spirit lies beyond the stomach’s opening, at the gate of the gastric tube—where food is swallowed—the fatty membrane being the membrane of the vital regions. *Scripture of the Sovereign Primordial Purple Prime Lord*, Chapter Seventeen:\n\nIn the Sovereign Primordial Purple Prime’s midst,\nRadiant light thickens in the limpid empyrean.\nThe Three Heavens gleam with ninefold effulgences,\nSeparating and uniting the myriad lives of billions.\nClad in crimson kerchief and verdant auroras,\nAbove they circle the numinous Cold Lad.\nDrawing forth the five poisons of suffering,\nTranscending the body to pass beyond the Primal Azure.\nWhite Simplicity ascends the towering peaks,\nGolden gates ward the crimson hosts.\nThe seven ancestors’ accumulated corpse-knots,\nIn one transformation scatter and dissolve.\nReceiving blessings in the Eastern Auroral Chamber,\nReturning to the womb in the Vermilion Fire Court.\nThe Cavern Spirit’s pure disputation is wondrous,\nPower flows through from the self’s serene luminance.\nThe Pure Perfected’s hands grasp the Dipper,\nFeet tread upon the Nine Prime Stars.\nBrandishing control of Heaven and Earth’s gates,\nSpirit and life take root.\nThe issuance converges, the light’s motion endures long.\nThe nine effulgences: nine suns appearing as one.\nCold Lad: name of a mountain in the Nine Heavens.\nDawn Opener Towering Peaks: name of the White Simplicity Right Prime Lord.\nNine Prime Stars: the pivot of the nine numina.\nHeaven and Earth’s gates: the hands are Heaven’s gate, the feet Earth’s gate.\n“The issuance converges, the light’s motion endures long”: incantation of the Nine Heavens.\n\n*Great Cavern Three Perfected Jade Talisman*\nRecitation of the Incantation:\n\nThe Three Perfected of essence and blood are named the Primordial Life Lord, styled Mysterious Tranquility Lad. They ever guard the wellspring beneath my nostrils’ two apertures. Within the tip of the nose lies the Gate of Mysterious Reach—commonly called the nose’s apex. *Scripture of the Non-Ultimate Central Perfected Supreme Elder*, Chapter Eighteen:\n\nThe Non-Ultimate True Supreme Mystery,\nThe Mystery’s Primordial plain qi thickens.",
      "overlap_context": "ontaining two apertures that descend to connect with kidney water—this is the Flowery Tongue, wondrously linked to Jade Florescence. \"Revolve Round Clarity, the spirit’s primal net\" is the inner name of the Effulgence Lord in the Nine Heavens’ incantation. Alternate interpretation: \"Radiant tread firmly secures the body.\" As seen in the *Great Cavern Scripture of Mount Mao*, celestial inner sound and earthly outer sound.\n\n*Great Cavern Four Perfected Jade Talisman*\nRecitation of the Incantation:",
      "start_char": 7473,
      "end_char": 7867,
      "start_sentence": 518,
      "end_sentence": 545,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.399836540222168,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "寄频携运珠，混化启明日。 正一左右仙，长挟林虚阙。 兆有五符籍，合仙得真契。 魂生太无中，魄亦五道会。 世世解死结，七祖无住滞。 神风吹胞树，根叶已断绝。 胎中众鬼殃，五符开地结。 长为神真王，应仙续万世。 洞真清诤身，道通自然质。 真应化现相，不动在黄室。 应化无方在，骨肉金玉实。 静真明正道，至老长不易。 弥勒车，大生彰。 素炁郁，谓青黄白三色也。 寄频者，太一名也。 混化者，泥丸君内名也。 启明者，白素元君名也。 左仙名仲成子，右仙名曲文子。 林虚者，中央玄一老子名，谓长挟精炁，於林虚之玄关。 五道者，天中之官名也。 五符开地结者，除去阴魔，必仗五符而散地结也。 黄室者，黄庭也。 大洞二真玉符 祝曰",
      "translated_text": "The Pearl of Frequency-Borne Conveyance,\nIn fusion’s dawn the radiant morrow breaks.\nOrthodox Unity’s left and right immortals,\nEver embrace the Forest Void’s mystic gate.\nThe portent holds the Five Talismanic Registers,\nIn union with immortality attains the true covenant.\nThe hun-spirit arises within the Great Nothingness,\nThe po-soul too meets the Five Dao’s assembly.\nGeneration upon generation unties the knot of death,\nSeven ancestors know no lingering bondage.\nDivine wind blows through the womb’s tree,\nIts roots and leaves now severed utterly.\nThe womb’s host of ghostly calamities,\nThe Five Talismans unseal the earth’s knots.\nForever a divine perfected king,\nResponding to immortality, lineage spans ten thousand ages.\nThe Cavern Perfected’s pure and chastened form,\nThe Dao flows through nature’s uncarved substance.\nThe true response manifests in mutable forms,\nUnmoving, abides in the Yellow Chamber.\nManifestations know no fixed abode,\nBones and flesh become gold and jade in truth.\nSerene perfection illumines the upright Dao,\nTo old age and beyond, never alters.\nMaitreya’s chariot, great life’s glory shines.\nPlain qi thickens—termed the three hues: azure, yellow, white.\n*Frequency-Borne*: name of the Great One.\n*Fusion’s Dawn*: inner name of the Mud-Pill Palace Lord.\n*Radiant Morrow*: name of the White Simplicity Prime Lord.\n*Left Immortal*: named Zhongchengzi; *Right Immortal*: named Quwenzhi.\n*Forest Void*: name of the Central Mysterious Unity Elder, denoting the embrace of essence-qi within the Forest Void’s mystic gate.\n*Five Dao*: name of the celestial bureau’s officials.\n*The Five Talismans unseal the earth’s knots*: dispelling yin demons requires the Five Talismans to scatter the earth’s knots.\n*Yellow Chamber*: the Yellow Court.\n\n*Great Cavern Two Perfected Jade Talisman*\nRecitation of the Incantation:",
      "overlap_context": "ree Perfected Jade Talisman*\nRecitation of the Incantation:\n\nThe Three Perfected of essence and blood are named the Primordial Life Lord, styled Mysterious Tranquility Lad. They ever guard the wellspring beneath my nostrils’ two apertures. Within the tip of the nose lies the Gate of Mysterious Reach—commonly called the nose’s apex. *Scripture of the Non-Ultimate Central Perfected Supreme Elder*, Chapter Eighteen:\n\nThe Non-Ultimate True Supreme Mystery,\nThe Mystery’s Primordial plain qi thickens.",
      "start_char": 7867,
      "end_char": 8178,
      "start_sentence": 546,
      "end_sentence": 569,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.330079078674316,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "胃管二真，名坚玉君，字凝羽珠。 常镇我太仓之府，五肠之口。 胃为太仓，是传送达於五肠之口，口乃胃之下窍，心肺相接处，谓之五攒头，即胃口纳食处。 中央黄老君道经第十九 中央黄老君，圆华玉寿灵。 太张上玉门，仗云三仞明。 赤景翳逸寥，携提太一真。 帝女抱定陵，吟咏玉清文。 五符编紫房，玉籍标圆庭。 七祖返胎仙，灭绝三途生。 流风断血滞，玄叶得黄宁。 洞玄清净元，元命灵通成。 性命宗本坚，孝道成明王。 生根得太和，无为登上清。 满景生，比孛通。 黄素中元君，名圆华黄仞，字太张上，天中山名玉寿灵。 太一真者，太一胎尊也。 抱定陵，皇一之魂女内名也。 玄叶，即玄孙也。 精血三真，名黄宁子玄。 孝道成明王者，谓孝感於天，於日中为孝道明王，於月中为孝道仙王，斗中为孝悌王也。 生根者，性命之宗本也。 大洞一真玉符 祝曰 心中一真，名天精液君，字飞生上英。 常镇我胸中四极之口。 胸前两乳之上，正中央，自心坎鸠尾骨度上四寸，乃神所居。 青精上真内景君道经第二十 青精上华炁，太微玄景童。 神化玉室内，飞羽逸紫空。 日为三衿交，奉符登帝墉。 开关把金节，闭户叩琼钟。 灭魔三酆野，招灵上清宫。 明出穷阴间，入精六合房。 回老变皓形，还白养婴蒙。 洞元清净光，津海具神通。 咽液生万神，神水华池融。 涌身灌而润，往来无有穷。 通生道之源，天根常茂丰。 种炁会，出兰蒙。 青精之天，上华之室中，有返香之烟，其炁迎风三千里，犹彻闻也。 玄景童，此小童君之号。 三衿交，太微童君名也。 帝墉者，玉帝金墉之馆也。",
      "translated_text": "The Two Perfected of the Stomach Duct are named Lord Firm Jade, styled Congealed Feather Pearl. They ever guard my Granary Palace’s storehouse, the gateway of the five intestines. The stomach is the Granary Palace, transmitting and conveying to the gateway of the five intestines. This gateway is the lower orifice of the stomach, where heart and lungs meet—termed the Five Gathered Heads, the entry point where the stomach receives food.\n\n*Central Yellow Elder Lord’s Scripture, Chapter Nineteen*\nThe Central Yellow Elder Lord,\nRound Flower Jade Longevity Spirit.\nGreatly unfolds the Upper Jade Gate,\nRelying on clouds three *ren* in brightness.\nCrimson radiance veils the boundless,\nCarrying the Great One’s Perfected.\nThe Emperor’s daughter embraces Steadfast Mound,\nChanting the Jade Clarity texts.\nFive Talismans weave the Purple Chamber,\nJade registers mark the Round Court.\nSeven ancestors return as womb immortals,\nEradicating the three paths of rebirth.\nFlowing winds sever blood stagnation,\nMysterious descendants attain Yellow Tranquility.\nCavern Mystery’s purity and origin,\nOriginal life’s numinous connection fulfills.\nNature and life’s root foundation stands firm,\nFilial Dao completes the Illuminated King.\nLife’s root attains Great Harmony,\nNon-action ascends Supreme Clarity.\nFull radiance arises, comet’s passage unobstructed.\n\nThe Central Yellow Middle Origin Lord is named Round Flower Yellow *Ren*, styled Great Unfolding Above, a celestial mountain called Jade Longevity Spirit. The Great One Perfected is the Great One’s Womb Venerable. *Embracing Steadfast Mound* is the inner name of the August One’s soul-daughter. *Mysterious descendants* refers to great-grandsons. The Three Perfected of essence-blood are named Yellow Tranquility Child Mystery. *Filial Dao completes the Illuminated King* means filial piety moves heaven: in the sun, one becomes the Filial Dao Illuminated King; in the moon, the Filial Dao Immortal King; and in the Dipper, the Filial Fraternal King. *Life’s root* is the root foundation of nature and life.\n\n*Great Cavern One Perfected Jade Talisman*\nRecitation of the Incantation:\n\nThe One Perfected of the heart is named Lord Heavenly Essence Fluid, styled Soaring Life Supreme Flower. Ever guarding the gateway of my chest’s four poles. Above the two nipples on the chest, at the very center—four *cun* above the heart’s *jiuwei* bone—is where the spirit resides.\n\n*Azure Essence Upper Perfected Inner Radiance Lord’s Scripture, Chapter Twenty*\nAzure essence’s upper flower qi,\nGreat Tenuity’s Mysterious Radiance Youth.\nSpirit transforms within the Jade Chamber,\nSoaring feathers escape the purple void.\nThe sun as Three Collars Intertwined,\nOffering talismans ascends the Emperor’s Rampart.\nUnlocking passes, grasping golden tablets,\nClosing doors, striking jade bells.\nAnnihilating demons in the Three Feng wilds,\nSummoning spirits to the Supreme Clarity Palace.\nEmerging from the depths of yin’s abyss,\nEntering essence’s Six Harmonies Chamber.\nReversing age to transform into hoary form,\nReturning to whiteness, nurturing the infant’s ignorance.\nCavern Origin’s pure and luminous light,\nSaliva sea possesses numinous potency.\nSwallowing fluids generates ten thousand spirits,\nSpirit water’s Flower Pool fuses.\nSurge through the body, irrigating and moistening,\nComing and going without end.\nCommunicating with life’s Dao source,\nHeaven’s root ever flourishes abundantly.\nSeed qi",
      "overlap_context": "Lord.\n*Left Immortal*: named Zhongchengzi; *Right Immortal*: named Quwenzhi.\n*Forest Void*: name of the Central Mysterious Unity Elder, denoting the embrace of essence-qi within the Forest Void’s mystic gate.\n*Five Dao*: name of the celestial bureau’s officials.\n*The Five Talismans unseal the earth’s knots*: dispelling yin demons requires the Five Talismans to scatter the earth’s knots.\n*Yellow Chamber*: the Yellow Court.\n\n*Great Cavern Two Perfected Jade Talisman*\nRecitation of the Incantation:",
      "start_char": 8178,
      "end_char": 8843,
      "start_sentence": 570,
      "end_sentence": 613,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.54680609703064,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "开关者，应人之鼻，谓调鼻息以节约肺金之炁。 琼钟者，叩齿集神，如叩大宝钟也。 六合者，明堂也。 大洞九元玉符 祝曰 九元真男，名拘制，字三阳。 常镇我左耳之下，伏晨之户。 在左耳垂下二指面许，向后一分是也。 大洞玉经卷上竟 大洞玉经卷下 太阳九炁玉贤元君道经第二十一 太阳化三晨，紫軿微玄下。 元君保谷童，守胃塞地户。 金符焕北华，玉契披七祖。 帝真灌上生，断我三涂苦。 洞明清静光，帝心太玄通。 宿命过去智，根本元由中。 未来及他心，一切无碍融。 洞源与洞明，万道由通生。 会命初，幽中和。 玉晨，宫名。 微玄，日神名。 保谷童子，元君精魂名也。 北华，亭名。 洞原、洞明者，言此心乃大洞之灵源，大洞之神明也。 大洞皇一玉符 祝曰",
      "translated_text": "Opening the Passes corresponds to the human nose, regulating the breath to moderate the qi of Metal in the lungs. The Jade Bell refers to the gathering of spirits through tooth-clicking, as if striking the great treasure bell.\n\nThe Six Harmonies is the Hall of Light.\n\nThe Great Cavern’s Nine Primordial Jade Talisman\nIncantation:\nNine Primordial True Youth, named Ju Zhi, styled Three Yangs,\nEver guards beneath my left ear, at the Gate of Hidden Dawn.\nLocated two finger-widths below the left earlobe, slightly toward the rear.\n\n*End of the Upper Scroll of the Great Cavern Jade Scripture*\n\n*Beginning of the Lower Scroll of the Great Cavern Jade Scripture*\n\nThe Scripture of the Way of the Jade Worthy Primordial Lord of the Nine Qi of Grand Yang, Twenty-First\n\nGrand Yang transforms the Three Dawns,\nPurple chariot descends in subtle mystery.\nThe Primordial Lord protects the Valley Youth,\nGuarding the stomach, sealing the Earth’s Gate.\nGolden talisman blazes in Northern Florescence,\nJade contract unfurls for the Seven Ancestors.\nThe Emperor’s Perfected pours forth upper life,\nSevering my suffering of the Three Paths.\nCavern Clarity’s pure and luminous light,\nThe Emperor’s heart communes with Grand Mystery.\nThe wisdom of past lives’宿命,\nWithin the root-source’s primordial origin.\nFuture and others’ minds,\nAll fuse without obstruction.\nCavern Source and Cavern Clarity,\nThe myriad Dao arise from this communion.\n\nAt the meeting of life’s inception,\nIn the profound midst of harmony.\n\nYuchen is the name of a palace.\nWeixuan is the name of the sun spirit.\nBaogu Tongzi is the name of the Primordial Lord’s essence-spirit.\nBeihua is the name of a pavilion.\nDongyuan and Dongming refer to this heart as the numinous source of the Great Cavern, the spirit-light of the Great Cavern.\n\nThe Jade Talisman of the Great Cavern Sovereign Unity\nIncantation:",
      "overlap_context": " depths of yin’s abyss,\nEntering essence’s Six Harmonies Chamber.\nReversing age to transform into hoary form,\nReturning to whiteness, nurturing the infant’s ignorance.\nCavern Origin’s pure and luminous light,\nSaliva sea possesses numinous potency.\nSwallowing fluids generates ten thousand spirits,\nSpirit water’s Flower Pool fuses.\nSurge through the body, irrigating and moistening,\nComing and going without end.\nCommunicating with life’s Dao source,\nHeaven’s root ever flourishes abundantly.\nSeed qi",
      "start_char": 8843,
      "end_char": 9176,
      "start_sentence": 614,
      "end_sentence": 640,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.774599552154541,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "皇一魂女，名上归，字帝子，一名郁墨子，一名抱定陵。 常镇我右耳之下，伏晨之户。 在右耳垂下二指面许，向后一分。 九素金华景元君道经第二十二 太初九素炁，炁出华景中。 法坦舞仙旗，逡巡五老翁。 夫人名启珠，执籍归紫房。 父宁在回明，混合太微童。 洞清冥冥慧，大量玄玄同。 根尘悉消灭，有无皆虚空。 妙行真一全，名大心神通。 道备登玉清，位为圣仙公。 冥冲次，信明都。 华景者， 宫名。 启珠，流汨池水神名也。 父宁在，帝一名也。 左回明，上玄元父君字也。 根尘消灭，谓具道眼、圣耳、玄鼻、华舌、真身、帝心也。 大洞紫素玉符 祝曰",
      "translated_text": "The Sovereign Unity’s Spirit-Maiden,\nNamed Shanggui, styled Dizǐ,\nAlso called Yumozi, also called Baodingling.\nShe ever guards beneath my right ear,\nAt the Gate of Hidden Dawn.\nLocated two finger-widths below the right earlobe,\nOne fen toward the rear.\n\nThe Scripture of the Nine White Golden Flower Radiance Primordial Lord, Chapter Twenty-Two\nIn the Great Beginning’s ninefold white qi,\nQi emerges amid the Flower Radiance.\nThe Dharma altar unfurls the immortal banners,\nAs the Five Venerable Elders pace in measured steps.\nThe Lady named Qizhu,\nHolding the register, returns to the Purple Chamber.\nFather Ning resides in Huiming,\nMerging with the Grand Tenuity Lad.\nCavern Clarity’s dark wisdom,\nThe vast measure shares the profound mystery.\nRoot and dust wholly dissolve,\nBeing and nonbeing both become emptiness.\nWondrous practice completes the True Unity,\nNamed the Great Mind’s divine penetration.\nThe Dao perfected, one ascends to Jade Clarity,\nRanked as a Sage Immortal Duke.\nDark Pervasion next, Trust Illumination all.\n\nFlower Radiance is the name of a palace.\nQizhu is the name of the spirit of the Flowing Gush Pool.\nFuningzai is another name of the Sovereign Unity.\nZuohuiming is the style of the Primordial Father Lord of the Upper Mystery.\nRoot and dust dissolved refers to possessing the Dao-eye, Sage-ear, Mystery-nose, Flower-tongue, True-body, and Sovereign-heart.\n\nThe Jade Talisman of the Purple White Great Cavern\nIncantation:",
      "overlap_context": "rce and Cavern Clarity,\nThe myriad Dao arise from this communion.\n\nAt the meeting of life’s inception,\nIn the profound midst of harmony.\n\nYuchen is the name of a palace.\nWeixuan is the name of the sun spirit.\nBaogu Tongzi is the name of the Primordial Lord’s essence-spirit.\nBeihua is the name of a pavilion.\nDongyuan and Dongming refer to this heart as the numinous source of the Great Cavern, the spirit-light of the Great Cavern.\n\nThe Jade Talisman of the Great Cavern Sovereign Unity\nIncantation:",
      "start_char": 9176,
      "end_char": 9450,
      "start_sentence": 641,
      "end_sentence": 660,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.996145486831665,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "紫素左元君，名翳郁无仞，字安来上。 常镇我头面之境。 上部八景，齿神、发神、皮肤神、目神、顶髓神、耳神、鼻神、舌神。 九皇上真司命君道经第二十三 元始授太玄，苍胡颉宝珠。 檀炽钧音妙，希声彻太虚。 九皇上真炁，四司太仙王。 飞霞散天日，凝焕六合房。 上清朝玉虚，乘景晨晖中。 三神号发纽，捧籍启虚皇。 逸录登紫清，金符刻羽宫，顶玄苍胡颉，弘济登普光。 运度玄中人。 咽味生五方。 结集成胎仙，丹母金真阳。 主伴合元范，大易生玄乡。 掌堂庭，元眇灵。 苍胡颉，宝珠名。 太仙王，司命君之位号，统领四司。 六合房，乃明堂之房也。 晨晖，宫名。 发纽者，血中之神名。 羽宫，水神所居之处。 普光者，大洞殿名。 金真阳者，乾父也。 谓乾父、坤母结成胎仙。 元范者，所谓檀炽钧也。 掌堂庭元眇灵者，九天祝言。 大洞白素玉符 祝曰 黄素中元君，名圆华黄仞，字大张生。 常镇我胸腹之境。 天皇上真玉华三元君道经第二十四 天皇上真炁，三元乘神徊。 法坦兴朱霄，帝昌启玉扉。 拔户命门内，解结桃康阶。 敛神保五福，越转入太微。 单入而双修，一曲水天衢。 海日自东生，元命生太初。 保解乘，结六庭。 天皇上真者，玉华仙女之母也。 神徊者，车名也。 法坦，心神名。 朱霄，心神宫，帝昌，上皇泥丸九真内名，宝阁之户玉扉。 单入而双修者，谓天一生水，便对地二生火，性命双修之义也。 天衢，乃西北天门之路也。 大洞白素玉符 祝曰",
      "translated_text": "Purple White Left Primordial Lady, named Yi Yu Wu Ren, styled An Lai Shang. She ever guards the realm of my head and face. The Eight Luminaries of the Upper Region: the spirit of the teeth, the spirit of the hair, the spirit of the skin, the spirit of the eyes, the spirit of the crown marrow, the spirit of the ears, the spirit of the nose, and the spirit of the tongue.\n\nThe Twenty-Third Scripture of the Dao of the Nine August Upper Perfected Lords of Life:\nThe Primordial Beginning conferred upon Great Mystery the Treasured Pearl of Cang Hu Jie. The wondrous tones of Tan Chi’s tuning-hook, subtle sounds penetrating the Great Void. The qi of the Nine August Upper Perfected, the Four Controllers and Great Immortal Kings. Flying auroras scatter the sun of heaven, congealing radiance in the chambers of the Six Harmonies. Ascending to Jade Clarity at dawn’s court, riding the light amid the morning brilliance. The Three Spirits are named Fa Niu, bearing the register to summon the Void Sovereign. Transcendent records ascend to Purple Clarity, golden talismans inscribed in the Feather Palace. Crowned with the Dark Pearl of Cang Hu Jie, vast salvation ascends to Universal Radiance. Conveying and measuring those within the Mystery. Swallowing and savoring the Five Directions. Gathering and coalescing into the Womb Immortal, the Cinnabar Mother and Golden True Yang. Host and companion unite in the Primordial Model, the Great Change gives birth to the Mystery Realm. Governing the hall and courtyard, the Primordial Subtle Spirit.\n\nCang Hu Jie is the name of the Treasured Pearl. Great Immortal King is the title of the Lord of Life, commanding the Four Controllers. The Six Harmony Chambers are the chambers of the Hall of Light. Morning Brilliance is the name of a palace. Fa Niu is the name of the spirit within the blood. Feather Palace is the dwelling of the water spirits. Universal Radiance is the name of the Great Cavern’s hall. Golden True Yang is the Heavenly Father. It refers to the Heavenly Father and Earthly Mother uniting to form the Womb Immortal. The Primordial Model refers to Tan Chi’s tuning-hook. Governing the hall and courtyard, the Primordial Subtle Spirit, is the invocation of the Nine Heavens.\n\nThe White Talisman of the Great Cavern\nIncantation:\n\nYellow White Middle Primordial Lady, named Yuan Hua Huang Ren, styled Da Zhang Sheng. She ever guards the realm of my chest and abdomen.\n\nThe Twenty-Fourth Scripture of the Dao of the Heavenly August Upper Perfected Jade Flower Three Primordial Ladies:\nThe qi of the Heavenly August Upper Perfected, the Three Primordials ride the divine chariot. The Dharma Terrace arises in Vermilion Empyrean, the August Emperor flourishes, opening the Jade Gates. Drawing forth the Gate of Life within the household, untying the knots of the Peach Health Stairs. Gathering the spirits to preserve the Five Fortunes, transcending and turning to enter Grand Tenuity. Single entry yet dual cultivation, a single melody of the Water and Heaven thoroughfare. The sea sun rises from the east, the Primordial Mandate gives birth to the Great Beginning. Preserving and untying, knotting the Six Courts.\n\nThe Heavenly August Upper Perfected is the mother of the Jade Flower Immortal Maidens. Divine Chariot is the name of a carriage. Fa Tan is the name of the heart spirit. Vermilion Empyrean is the palace of the heart spirit. Di Chang is the inner name of the Nine Perfected within the Mud Pill Palace of the Upper August, the Jade Gates of the Treasure Pavilion. Single entry yet dual cultivation refers to Heaven One generating Water, then Earth Two generating Fire, the meaning of dual cultivation of nature and life. Heavenly Thoroughfare is the path of the northwest celestial gate.\n\nThe White Talisman of the Great Cavern\nIncantation:",
      "overlap_context": "ty,\nRanked as a Sage Immortal Duke.\nDark Pervasion next, Trust Illumination all.\n\nFlower Radiance is the name of a palace.\nQizhu is the name of the spirit of the Flowing Gush Pool.\nFuningzai is another name of the Sovereign Unity.\nZuohuiming is the style of the Primordial Father Lord of the Upper Mystery.\nRoot and dust dissolved refers to possessing the Dao-eye, Sage-ear, Mystery-nose, Flower-tongue, True-body, and Sovereign-heart.\n\nThe Jade Talisman of the Purple White Great Cavern\nIncantation:",
      "start_char": 9450,
      "end_char": 10064,
      "start_sentence": 661,
      "end_sentence": 707,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.137205362319946,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "白素右元君，名启明萧仞，字金门上。 常镇我下关之境。 小腹至脚底。 下丹田在脐下三寸，其形方圆一寸，男子藏精，女子藏胎之所。 地关，足名。 太一上元禁君道经第二十五 太上上元君，日中司命童。 焕然神光明，披霞升帝墉。 列坐震灵席，混合五日房。 白炁育尚生，青君按延昌。 左携精上门，右抱合和英。 我生日月华，友宾赤炁王。 八景照泥丸，朗照洞房中。 婴儿为赤子，混离生玉容。 五道秀金华，位为上清公。 七祖断玄滞，身得乘神风。 徘徊三清上，和乐返婴童。 太始三炁周，真文肇生明。 丹明昌，左帝根。 司命童，号赤炁王， 内名将军梁，为日中上神。 帝墉者，玉帝金墉馆也。 震灵席者，震灵符文，可拜可坐卧也。 延昌者，结中青炁君名也。 精上门者，节中黑炁君名也。 赤子玄凝天，泥九上一天帝名也。 混离子，血中赤炁君名也。 五道，宫名。 金华，山名。 大洞日中玉符 服符微祝曰",
      "translated_text": "The White Primordial Right Lady, named Qiming Xiao Ren, styled Upper Golden Gate, constantly guards my lower pass realm—from the lower abdomen to the soles of the feet. The Lower Cinnabar Field lies three inches below the navel, its form square and round, one inch in dimension, the repository where men store essence and women nurture the fetus. The Earth Pass is the name of the feet.\n\n*Taiyi Upper Primordial Forbidden Lord’s Scripture*, Chapter Twenty-Five:\nThe Supreme Upper Primordial Lord, the Youth Who Governs Fate at Noon,\nRadiant with divine brilliance, dons auroral robes to ascend the Emperor’s Ramparts.\nArrayed upon the Thunder Spirit’s mat, merging within the Five Solar Chambers,\nWhite qi nurtures Shangsheng, the Azure Lord presses Yanchang.\nTo the left, he carries Jing Shangmen; to the right, he embraces Hehe Ying.\nMy body births the splendor of sun and moon, befriending the Scarlet Qi King.\nEight luminaries illumine the Mud Pill Palace, brightly shining within the Grotto Chamber.\nThe Infant is the Red Child, Hunli gives birth to a jade countenance.\nThe Five Paths adorn with golden blossoms, enthroning him as an Upper Clarity Duke.\nSeven ancestors sever dark stagnation, his body ascends upon the divine wind.\nWandering above the Three Clarities, harmoniously he returns to infancy.\nThe Three Qi of the Great Beginning cycle, true scriptures inaugurate radiance.\nCinnabar brilliance flourishes; the Left Imperial Root.\nThe Youth Who Governs Fate is styled the Scarlet Qi King,\nHis inner name is General Liang, the supreme spirit of the noon sun.\nThe Emperor’s Ramparts are the Golden Ramparts Hall of the Jade Emperor.\nThe Thunder Spirit’s mat refers to the Thunder Spirit talisman, upon which one may bow, sit, or recline.\nYanchang is the name of the Azure Qi Lord of the Central Knot.\nJing Shangmen is the name of the Black Qi Lord of the Nodal Center.\nThe Red Child is the Mysterious Congealed Heaven, the name of the Supreme Emperor of the Uppermost Heaven.\nHunlizi is the name of the Scarlet Qi Lord within the blood.\nThe Five Paths is the name of a palace. Golden Blossom is the name of a mountain.\n\n*The Great Cavern Noon Sun Jade Talisman*\nRecite the incantation in silence:",
      "overlap_context": "s the name of the heart spirit. Vermilion Empyrean is the palace of the heart spirit. Di Chang is the inner name of the Nine Perfected within the Mud Pill Palace of the Upper August, the Jade Gates of the Treasure Pavilion. Single entry yet dual cultivation refers to Heaven One generating Water, then Earth Two generating Fire, the meaning of dual cultivation of nature and life. Heavenly Thoroughfare is the path of the northwest celestial gate.\n\nThe White Talisman of the Great Cavern\nIncantation:",
      "start_char": 10064,
      "end_char": 10454,
      "start_sentence": 708,
      "end_sentence": 737,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.75583529472351,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "日中司命君，名接生，字通灵，一名上景，一名圆光，一名眇景，一名九曜，一名微玄，一名曜罗司命童，号赤炁王，内名将军梁，乃日中上神。 常镇我左手通真之户。 左手掌心宛，宛中一户。 元虚黄房真晨君道经第二十六 元虚黄房中，内有黄宁童。 左有坚玉君，右有帝昌皇。 浮清翳晨炁，郁郁虚灵容。 青肝明轮子，开朗彻八聪。 太一畴丘兰，奉符入玉宫。 拔赦七世罪，回元期大通。 混合帝一室，五老变孩童。 太素梵行初，一善四金融。 变世炁，三道迁。 黄房，乃真晨君之所治也。 黄宁子玄，精血三真名也。 坚玉君，胃管二真名也。 帝昌上皇，泥九九真内名也。 虚灵者，谷神字也。 明轮童子，肝中四真名也。 八聪者，八景也。 畴丘兰，太一帝尊内名也。 大洞月中玉符 服符微祝曰",
      "translated_text": "The Noon Sun Controller of Fate,\nnamed Jiesheng, styled Tongling,\nalso called Shangjing, also Yuanguang,\nalso Miaojing, also the Nine Luminaries,\nalso Weixuan, also Yaoluo Controller of Fate Youth—\nstyled the Scarlet Qi King,\nhis inner name is General Liang,\nthe supreme spirit of the noon sun.\nHe ever guards the Gate of Dao-Permeation on my left hand.\nWithin the hollow of the left palm lies a gate.\n\n*The Daoist Scripture of the Primordial Void Yellow Chamber, Chapter Twenty-Six*\nWithin the Primordial Void Yellow Chamber,\ndwells the Yellow Tranquility Youth.\nTo the left stands the Firm Jade Lord,\nto the right, the Imperial Prosperity Sovereign.\nFloating clarity veils the morning qi,\nwhile the flourishing Void-Spirit assumes its form.\nThe Azure Liver Bright Wheel Youth\nopens and illumines the Eight Keens.\nGrand Unity Chouqiu Lan,\nbearing the talisman, enters the Jade Palace.\nHe absolves the sins of seven generations,\nrestoring the origin to await great communion.\nMerging within the Emperor’s One Chamber,\nthe Five Elders transform into youths.\nAt the dawn of the Great Simplicity’s Brahman conduct,\none virtue fuses the Four Golds.\nThe qi of world-transformation—\nthree paths ascend.\n\nThe Yellow Chamber is the domain governed by the True Morning Lord.\nThe Yellow Tranquility Youth is the name of the Three Perfected of essence and blood.\nThe Firm Jade Lord is the name of the Two Perfected of the stomach conduit.\nThe Imperial Prosperity High Sovereign is the inner name of the Nine-Nine Perfected.\nThe Void-Spirit is the cognomen of the Valley Spirit.\nThe Bright Wheel Youth is the name of the Four Perfected within the liver.\nThe Eight Keens are the Eight Sceneries.\nChouqiu Lan is the inner name of the Grand Unity Imperial Honored One.\n\n*The Great Cavern Moon Jade Talisman*\nRecite the incantation in silence:",
      "overlap_context": " upon which one may bow, sit, or recline.\nYanchang is the name of the Azure Qi Lord of the Central Knot.\nJing Shangmen is the name of the Black Qi Lord of the Nodal Center.\nThe Red Child is the Mysterious Congealed Heaven, the name of the Supreme Emperor of the Uppermost Heaven.\nHunlizi is the name of the Scarlet Qi Lord within the blood.\nThe Five Paths is the name of a palace. Golden Blossom is the name of a mountain.\n\n*The Great Cavern Noon Sun Jade Talisman*\nRecite the incantation in silence:",
      "start_char": 10454,
      "end_char": 10786,
      "start_sentence": 738,
      "end_sentence": 760,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.651201963424683,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "月中桃君，名盈子，字运景。 青帝母号芳艳婴，日月之明曰朗朗，曰圆明。 常镇我右手通真之户。 在右掌心宛，宛中是神所居。 太极主四真人元君道经第二十七 太极主四真，凌羽逸上清。 七转召司命，太一扬威明。 司录保储命，三举登震灵。 魔王来受事，仙官束鬼精。 月中青帝母，号曰芬艳婴。 太张上五符，安来上玉名。 混化六合内，洞房列火兵。 太极五灵冲，横文帝子宾。 登来章，乘法谟。 威明者，胆神之字也。 震灵者，符名也。 青帝母，月中之神也。 太张上，黄素中元君名也。 安来上，紫素左元君名也。 火兵者，阳灵也。 横文乃中黄之正印，黄帝执此文，而为万神之主，与诸天帝子，皆为仙宾也。 大洞阳光玉符 祝曰",
      "translated_text": "The Moonlit Peach Lord is named Yingzi, styled Yun Jing.\nThe Azure Thearch’s Mother is titled Fragrant Radiance Infant.\nThe brilliance of sun and moon is called Bright Bright and Perfect Illumination.\nShe eternally guards the Gate of Dao-Communion on my right hand.\nWithin the right palm’s curve, at the heart of the curve, dwells the spirit.\n\n*The Great Ultimate Lord of the Four Perfected, Scripture of the Dao of the Perfected Lords, Chapter Twenty-Seven*\nThe Great Ultimate Lord of the Four Perfected,\nsoars on feathered ease to the Upper Clarity.\nSeven revolutions summon the Controller of Destinies,\nthe Great One displays majestic illumination.\nThe Registrar safeguards the stored destinies,\nthree ascents mount the Thunder Numinous.\nDemon kings come to receive their duties,\nimmortal officials bind ghostly essences.\nThe Azure Thearch’s Mother in the moon\nis titled Fragrant Radiance Infant.\nThe Great Unfurling Above is the name of the Central Yellow Primordial Lord.\nPeaceful Arrival Above is the name of the Left Purple Primordial Lord.\nWithin the Six Harmonies, the Grotto Chamber arrays the Fire Soldiers.\nThe Great Ultimate’s Fivefold Numinous Surge—\nthe Horizontal Script is the true seal of the Central Yellow.\nThe Thearch of the Yellow holds this script\nand becomes lord of the myriad spirits,\nwhile all the Heavenly Thearch’s sons\nbecome immortal guests.\n\n*Great Cavern Solar Radiance Jade Talisman*\nRecite the incantation in silence:",
      "overlap_context": "ed of essence and blood.\nThe Firm Jade Lord is the name of the Two Perfected of the stomach conduit.\nThe Imperial Prosperity High Sovereign is the inner name of the Nine-Nine Perfected.\nThe Void-Spirit is the cognomen of the Valley Spirit.\nThe Bright Wheel Youth is the name of the Four Perfected within the liver.\nThe Eight Keens are the Eight Sceneries.\nChouqiu Lan is the inner name of the Grand Unity Imperial Honored One.\n\n*The Great Cavern Moon Jade Talisman*\nRecite the incantation in silence:",
      "start_char": 10786,
      "end_char": 11092,
      "start_sentence": 761,
      "end_sentence": 783,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.955773115158081,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "左目童子名灵飞，字阳光，常镇我左目之瞳。 四斗中真七晨散华君道经第二十八 斗中四真人，散华玉清台。 帝卿中玄生，一回众真来。 香风扇三宝，五脏映清夷。 苍胡颉光华，檀炽钧吉祥。 太中六炁清，曲水天河襄。 大度功圆成，五魔伐六阴。 中结元始王，高观六合庭。 鲜曲玄，镜重车。 四真人，四斗之神也。 中玄生，泥丸帝卿名也。 三宝，山名。 清夷，宫名。 襄者，升也。 泉曲之水，下注北酆，升为天河，上贯南斗，了明此道，沈者皆升。 五帝大魔伐六阴，而阳回六府。 大洞阴精玉符 祝曰 右目童子，名晨婴，字阴精。 常镇我右目之瞳。 辰中黄景元君道经第二十九 辰中黄景炁，三秀登霄庭。 沧台飞羽轮，迎延道已成。 司命奉帝书，号为玄度卿。 保生太霞宫，列宾馆上清。 命门合精延，守我身黄宁。 左携元素君，右摄朱蔚灵。 太和度七觉，点火生真文。 紫华顶胎仙，元命真中神。 总命本，登龙津。 三秀，山名。 沧溟，台名。 迎延，符名。 玄度卿，司命丈人名也。 合精延，桃康君名也。 黄宁子玄，精血三真名也。 元素君， 无英公子名也。 朱蔚灵，右白元尊神名。 七觉者，火之成数也。 又离为火，而文明发混洞赤文之秘也。 华顶胎仙者，三华聚顶，胎结成仙也。 真中神，乃真中之阳神也。 大洞胎仙玉符 祝曰 肺部童子，名素明，字虚成。 常镇我肺部之下。 金阙后圣太平李真天帝上景君道经第三十 金阙上景炁，十方晖紫烟。 三命太一尊，五召太平神。 七转招岳真，玉符告三官。 拔籍三灵下，受生高上晨。 太灵八灵王，一化回庆云。 桃君守六合，勒精卫泥丸。 太清八景观，十德真文宣。 保子神中神，元命生自然。 晖延勒，得日贤。 金阙者，肺也。 太一胎尊，随所应现，太平后圣，自然通神。 岳真者，五岳众真也。 颁玉符而告三官大帝，技死籍於三灵之神乡，则受生於高上之晨官矣。 八灵君，太帝精魂之字。 六合，明堂名。 勒精、泥丸，帝卿名。 八景，八神名。 大洞胎神玉符 服符微祝曰 胎中一元白炁君，名务玄子，字育上生。 太一精魂，名玄归子，字盛昌，号八灵王。 二神常镇我五脏之上，结喉之本户。 结喉，一名金楼，一名重楼，一名三思台，神有十二，亭长真人在其内，主通上下炁也。 太虚后圣元景彭室真君道经第三十一 太虚空无景，霞中有彭室。 九云合重扉，帝君静幽密。 八真合景君，上携女太一。 雌雄混玉房，九变还返七。 分形散六合，泥丸易分别。 太真九光轮，十住 音曳文结。 保子元炁通，五炁理中颉。 混一归帝阙，永寿无穷劫。 变化飞上清，三千行超越。 乘元轮，入幽宗。 空无景，山名。 彭室者，彭君之室，室中主延生之符。 重扉者，门也。 合景君，胆中八真名。 十住，乃十地，一属阳，略伸笔过右，便是阴，此耦之所由生也。 此言 文者，正得反阴为阳之义。 理中颉者，中理五炁，混合百神，颉乃升上之义。 大洞结中玉符 祝曰 结中青炁君，名按延昌，字合和婴。 元君精魂，名保谷童子，字明光。 二神常镇我五脏之下，胃之上口。 正指胃口，存其神在胃口内也。 前言胃管二真者，存其神在胃口外也。 太玄都九炁丈人主仙君道经第三十二 太上九炁上，烟回太晖间。 神光秀空峰，五道焕三天。",
      "translated_text": "Left Eye Lad is named Lingfei, styled Yangguang, ever guarding the pupil of my left eye.\n\n*Dao Scripture of the Four Dipper Central Perfected Seven Mornings Scattered Blossoms Lord, Chapter Twenty-Eight*\nWithin the Dipper dwell four Perfected,\nscattering blossoms at Jade Clarity Terrace.\nThe Thearch’s Minister of the Central Mystery gives birth—\none turn and all Perfected come.\nFragrant winds fan the Three Treasures,\nthe five viscera reflect Clear Yi.\nAzure Hu’s radiant splendor,\nsandalwood’s blazing auspicious hook.\nThe Great Central’s six qi pure,\nthe winding waters of the Celestial River ascend.\nGreat Merit’s completion,\nthe Five Demons fell the Six Yin.\nWithin, the Primordial King of Yuanshi knots,\nloftily beholding the Six Harmonies’ court.\nFreshly winding mystery,\nmirrored layered chariots.\n\nThe Four Perfected are the gods of the Four Dippers. Central Mystery Born is the name of the Mud-Pill Palace’s Thearch Minister. The Three Treasures are a mountain’s name. Clear Yi is a palace’s name. Ascend means to rise. The waters of winding springs flow downward to Northern Feng, rising to become the Celestial River, ascending through the Southern Dipper. Mastering this Dao, the sunken all rise. The Five Thearchs’ Great Demons fell the Six Yin, and yang returns to the Six Palaces.\n\n*Great Cavern Yin Essence Jade Talisman*\nRecite the incantation:\nRight Eye Lad is named Chenying, styled Yinjing, ever guarding the pupil of my right eye.\n\n*Dao Scripture of the Chen Central Yellow Radiance Primordial Lord, Chapter Twenty-Nine*\nWithin Chen, the Yellow Radiance’s qi,\nthree elegances ascend the dawn court.\nAzure Terrace flies feathered wheels,\nwelcoming and extending—Dao now complete.\nThe Director of Destinies presents the Thearch’s script,\nstyled Mystic Merit Minister.\nPreserving life at Great Rosy Cloud Palace,\narrayed as guests in Upper Clarity’s hostels.\nThe Gate of Destiny joins essence to extend,\nguarding my body’s Yellow Peace.\nLeft, he grasps the Primordial Essence Lord,\nright, he seizes the Vermilion Luxuriance Spirit.\nGreat Harmony crosses the Seven Awakenings,\nstriking fire to generate true script.\nPurple Blossom’s Crown Embryo Immortal,\nPrimordial Destiny’s Perfected Central Spirit.\nCommanding destiny’s root,\nascending Dragon Ford.\n\nThe Three Elegances are a mountain’s name. Azure Vastness is a terrace’s name. Welcoming Extension is a talisman’s name. Mystic Merit Minister is the Director of Destinies’ Venerable Lord’s name. Joining Essence to Extend is Peach Vigor Lord’s name. Yellow Peace Child Mystery is the name of the Three Perfected of essence and blood. Primordial Essence Lord is the name of the Peerless Lad. Vermilion Luxuriance Spirit is the name of the Right White Primordial Venerable Spirit. The Seven Awakenings are the fire’s completion number. Moreover, *li* is fire, and from its luminous brilliance emerges the secret of the Cavernous Crimson Script. The Crown Blossom Embryo Immortal means the three blossoms gather at the crown, the embryo knits to form an immortal. The Perfected Central Spirit is the yang spirit within the Perfected.\n\n*Great Cavern Embryo Immortal Jade Talisman*\nRecite the incantation:\nLung Department Lad is named Suming, styled Xucheng, ever guarding below my lung department.\n\n*Dao Scripture of the Golden Watchtower Posterior Sage Supreme Peace Li Perfected Celestial Thearch Upper Radiance Lord, Chapter Thirty*\nThe Golden Watchtower’s Upper Radiance qi,\nten directions gleam with purple mist.\nThe Three Destinies’ Grand Unity Venerable,\nFive Summonses call the Supreme Peace spirits.\nSeven Turnings summon the Peak Perfected,\njade talismans announce to the Three Officials.\nExtracting the register from the Three Spirits below,\nreceiving life in the Highest Dawn.\nThe Grand Spirit Eightfold Spirit King,\none transformation returns felicitous clouds.\nPeach Lord guards the Six Harmonies,\ninscribing essence to defend the Mud-Pill Palace.\nGreat Clarity’s Eightfold Radiance Contemplation,\nthe Ten Virtues’ true script proclaimed.\nPreserving your child, Spirit within Spirit,\nPrimordial Destiny arises naturally.\n\nRadiance extending inscribed,\nattaining solar worthies.\n\nThe Golden Watchtower is the lung. The Grand Unity Embryo Venerable manifests as needed; the Supreme Peace Posterior Sage naturally communicates with spirits. The Peak Perfected are the host of Perfected of the Five Peaks. Proclaiming jade talismans to the Three Officials Thearchs, removing death registers from the Three Spirits’ divine realm, one then receives life in the Highest Dawn Palace. The Eightfold Spirit Lord is the name of the Grand Thearch’s essence and soul. The Six Harmonies are the name of the Bright Hall. Inscribing essence and Mud-Pill Palace are the names of the Thearch Minister. The Eight Radiance are the names of eight spirits.\n\n*Great Cavern Embryo Spirit Jade Talisman*\nIngest the talisman and silently recite the incantation:\nWithin the embryo, the One Primordial White Qi Lord is named Wuxuanzi, styled Yushangsheng. The Grand Unity’s essence and soul is named Xuanguizi, styled Shengchang, titled Eightfold Spirit King. These two spirits ever guard above my five viscera, at the root gate of the throat’s junction.\n\nThe throat’s junction is also called Golden Tower, also called Layered Tower, also called Three Thoughts Terrace. Twelve spirits reside within, including Pavilion Leader Perfected, who governs the communication of upper and lower qi.\n\n*Dao Scripture of the Supreme Void Posterior Sage Primordial Radiance Peng Chamber Perfected Lord, Chapter Thirty-One*\nSupreme Void’s empty radiance,\nwithin rosy clouds lies Peng Chamber.\nNine clouds seal layered gates,\nthe Thearch Lord stills in profound secrecy.\nEight Perfected join Radiance Lord,\nabove, they grasp the Female Grand Unity.\nMale and female blend in Jade Chamber,\nnine transformations return to seven.\nDispersing forms throughout the Six Harmonies,\nthe Mud-Pill Palace’s distinctions shift.\nThe Grand Perfected’s Ninefold Light Wheel,\nTen Abodes’ script knots.\nPreserving your child’s Primordial Qi flows,\nthe five qi govern Central Jie.\nBlending as one to return to the Thearch’s watchtower,\neternal life without end.\nTransforming to fly into Upper Clarity,\nthree thousand practices transcend.\n\nThe Wheel ascends,\nentering the profound lineage.\n\nEmpty Radiance is a mountain’s name. Peng Chamber is Peng Lord’s chamber, within which resides the talisman for extending life. Layered gates are doors. Joining Radiance Lord is the name of the eight Perfected within the gallbladder. The Ten Abodes are the Ten Grounds; one pertains to yang. Briefly passing the brush to the right makes it yin—this is the origin of coupling. This speaks of script, precisely capturing the meaning of reversing yin to yang. Governing Central Jie means governing the five qi within, blending the hundred spirits; *jie* means ascending.\n\n*Great Cavern Central Knot Jade Talisman*\nRecite the incantation:\nCentral Knot Azure Qi Lord is named Anyanchang, styled Heheying. The Primordial Lord’s essence and soul is named Baogu Tongzi, styled Mingguang. These two spirits ever guard below my five viscera, above the stomach’s upper opening.\n\nDirectly pointing to the stomach’s opening, visualize its spirit within the stomach’s opening. Previously mentioned were the two Perfected of the stomach tube, visualizing their spirits outside the stomach’s opening.\n\n*Dao Scripture of the Supreme Mystery Capital Nine Qi Venerable Lord Master Immortal Lord, Chapter Thirty-Two*\nAbove the Supreme Nine Qi,\nmist swirls between Great Radiance.\nDivine light adorns empty peaks,\nthe Five Paths illumine the Three Heavens.",
      "overlap_context": " Yellow Primordial Lord.\nPeaceful Arrival Above is the name of the Left Purple Primordial Lord.\nWithin the Six Harmonies, the Grotto Chamber arrays the Fire Soldiers.\nThe Great Ultimate’s Fivefold Numinous Surge—\nthe Horizontal Script is the true seal of the Central Yellow.\nThe Thearch of the Yellow holds this script\nand becomes lord of the myriad spirits,\nwhile all the Heavenly Thearch’s sons\nbecome immortal guests.\n\n*Great Cavern Solar Radiance Jade Talisman*\nRecite the incantation in silence:",
      "start_char": 11092,
      "end_char": 12425,
      "start_sentence": 784,
      "end_sentence": 882,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 178.19489121437073,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "驾景登绝霄，乘风荡滞神。 中一曰运珠，理心入清闲。 混合三五宫，累变亿万年。 伐绝胎树生，永断血尸根。 七祖散积滞，反华墨幽玄。 万炁生万津，齐化成仙人。 太玄启十明，妙行登十真。 无阿景，奉神冲。 太玄都在九炁之上，九炁即返魂之香。 太晖者，宫名。 空峰者，山名。 五道者，宫名。 荡滞神，亦山名也。 运珠者，心中一真名也。 金木水火，混合於土，名曰三五官。 大洞节中玉符 祝曰 节中黑炁君，名斌来生，字精上门。 帝真精魂，名幽台王，字灌上生。 二神常守我九肠之口，伏梁之下。 九肠之口，是小水出处，伏梁下户，是大小肠穷相近间隔处当中。 按秘诀云：伏梁下户，在阴囊之后，肛门之前，二阴中央也。 上清八皇老君道经第三十三 上清绝霞外，八皇运九天。",
      "translated_text": "Riding the light to ascend the utmost heavens,\nborne on the wind to disperse stagnant spirits.\nThe Central One is called \"Moving Pearl,\"\ngoverning the heart to enter serene repose.\nMerging the Three and Five Palaces,\ntransforming through countless eons.\nSevering the roots of the fetal tree’s growth,\nforever cutting the blood-corpse’s origin.\nSeven ancestors disperse accumulated stagnation,\nreturning to the obscure mystery of flourishing darkness.\nMyriad qi generate myriad channels,\nall equally transmuting into immortals.\nThe Supreme Mystery initiates the Ten Illuminations,\nwondrous practices ascend the Ten Perfected.\n\nWithout obstruction, the light serves the divine void.\n\nThe Supreme Mystery Capital lies above the Nine Qi;\nthe Nine Qi are the incense of returning souls.\n*Great Radiance* is the name of a palace.\n*Empty Peak* is the name of a mountain.\n*Five Paths* is the name of a palace.\n*Dispersing Stagnant Spirits* is also the name of a mountain.\n*Moving Pearl* is the name of the One Perfected within the heart.\nMetal, wood, water, and fire,\nmerged with earth, are called the Three-Five Palace.\n\n*Great Cavern Central Knot Jade Talisman*\nRecite the incantation:\nCentral Knot Black Qi Lord is named Binlaisheng, styled Jingshangmen. The Imperial Perfected’s essence and soul is named Youtaiwang, styled Guanshangsheng. These two spirits ever guard the opening of my nine intestines, below the *fubo* (hidden beam).\n\nThe opening of the nine intestines is where the urine exits; the *fubo*’s lower gate is the junction between the large and small intestines. According to the secret instructions: the *fubo*’s lower gate lies behind the scrotum and before the anus, at the center between the two yin.\n\n*Dao Scripture of the Highest Clarity Eight August Lords, Chapter Thirty-Three*\nBeyond the utmost clouds of Highest Clarity,\nthe Eight August Lords revolve the Nine Heavens.",
      "overlap_context": "ve the stomach’s upper opening.\n\nDirectly pointing to the stomach’s opening, visualize its spirit within the stomach’s opening. Previously mentioned were the two Perfected of the stomach tube, visualizing their spirits outside the stomach’s opening.\n\n*Dao Scripture of the Supreme Mystery Capital Nine Qi Venerable Lord Master Immortal Lord, Chapter Thirty-Two*\nAbove the Supreme Nine Qi,\nmist swirls between Great Radiance.\nDivine light adorns empty peaks,\nthe Five Paths illumine the Three Heavens.",
      "start_char": 12426,
      "end_char": 12758,
      "start_sentence": 883,
      "end_sentence": 906,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.274875164031982,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "幽寥生帝子，携化景中人。 晨登太老寝，夕宴金华便。 羽节命太一，锦瘘召万神。 坚我玄胎仙，伐减胞树根。 解结生七祖，散祸宁九玄。 赤帝丹灵峙，扶兆入金门。 月母灵素兰，守闭死熙关。 死炁自今绝，生津从兹延。 万神万黑仙，超脱位真王。 十真妙行全，太玄会明阳。 无上大洞尊，一炁同龙光。 映遂劫，度连绝。 太一君，字幽寥元。 晨登大老寝，喻理脾土之元。 夕宴金华便，又喻咽肺金之液。 丹灵，台名。 灵素兰，月母之号。 明阳，玉堂名。 龙光，车名。 大洞胞中玉 符 服符微祝曰",
      "translated_text": "Within the profound solitude, the Imperial Heir is born,\nbearing transformation to those who dwell in radiant light.\nAt dawn, they ascend the Great Elder’s repose;\nat dusk, they feast in the Golden Flower’s ease.\nWith feathered tablets, they summon the Great One;\nwith brocade talismans, they call forth the myriad spirits.\nThey strengthen my dark-womb immortal,\nhewing away the roots of the placental tree.\nThey unbind the knots of the seven ancestors,\ndispersing calamity to pacify the nine lineages.\nThe Crimson Emperor’s cinnabar numen stands firm,\naiding the omen to enter the Golden Gate.\nThe Moon Mother’s numinous white orchid\nguards and seals the Gate of Death’s radiance.\nFrom this day forth, the qi of death is cut off;\nthe essence of life henceforth extends.\nThe myriad spirits and dark immortals,\ntranscending, become Perfected Kings of their stations.\nThe ten Perfected complete their wondrous practice,\nthe Great Mystery unites the luminous and the yang.\nThe Supreme Great Cavern Venerable,\none qi harmonizes with Dragon Radiance.\nIlluminating the kalpas, bridging the severed.\n---\n\n*Great Cavern Womb-Center Jade Talisman*\nRecite the incantation in silence:\n\nThe Great One Lord, styled Profound Solitude Prime,\nat dawn ascends the Great Elder’s repose—an allusion to the origin of spleen-earth;\nat dusk feasts in the Golden Flower’s ease—further alluding to the fluid of lung-metal.\n*Danling* is the name of a terrace.\n*Lingsu Lan* is the title of the Moon Mother.\n*Mingyang* is the name of a jade hall.\n*Longguang* is the name of a chariot.",
      "overlap_context": "testines, below the *fubo* (hidden beam).\n\nThe opening of the nine intestines is where the urine exits; the *fubo*’s lower gate is the junction between the large and small intestines. According to the secret instructions: the *fubo*’s lower gate lies behind the scrotum and before the anus, at the center between the two yin.\n\n*Dao Scripture of the Highest Clarity Eight August Lords, Chapter Thirty-Three*\nBeyond the utmost clouds of Highest Clarity,\nthe Eight August Lords revolve the Nine Heavens.",
      "start_char": 12758,
      "end_char": 13043,
      "start_sentence": 907,
      "end_sentence": 927,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.209092140197754,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "胞中黄素君，名祖明车，字神元极。 天帝精魂，名理维藏，字法运珠。 二神常镇我小肠之内，二孔之本。 小肠之端，胞囊系焉。 胞有一带，合於小腹之内，其右一带，管便溺水，左一带，则漏泄精华。 故日二欲孔焉。 东华方诸宫高晨师玉保王青童君道经第三十四 东华发始晖，高晨映上清。 洞焕圆珠霭，朗朗紫曜明。 七神回帝席，五老飞玉軏。 太一景中王，司命摄万灵。 泛然云波问，寂盼泥丸城。 七转召三官，北君稽首呈。 五岳应命到，拔死书长生。 三举震灵符，玄解大魔精。 七祖生福堂，玄华保黄宁。 观轩寝，明宾郁 始晖者，日出之乡。 高晨者，官名。 圆珠、紫曜，皆日名也。 黄宁者，精血三真名也。 大洞血中玉符 祝曰 血中赤熙君，名混离予，字叔保坚。 司命精魂，名发纽予，宇庆玄。 二神常镇我百关之血，绝节之下。 历劫受质，未有不由精血而成身也。 故节结不解，仙道难成。 经曰：两脚绝骨之户，在两腿经骨之下节，向外之踝骨下宛，宛中名日绝骨之户。 扶桑大帝九老仙皇君道经第三十五 大帝九老京，校仙登博桑。",
      "translated_text": "The Womb-Center Yellow-Silk Lord,\nstyled Ancestral Bright Chariot, named Spirit of the Primal Ultimate.\nThe Celestial Emperor’s essence-soul,\nstyled Regulator of the Hidden Treasury, named Dharma-Circulating Pearl.\nThese two spirits ever guard within my small intestine,\nthe root of its two apertures.\nAt the small intestine’s end, the womb-pouch is bound.\nThe womb has one cord, joined within the lower abdomen;\nits right cord governs the passage of water,\nits left cord leaks forth the essence’s radiance.\nThus are the two apertures of desire.\n\n*Scripture of the Highest Dawn, Master Jade Protector King Azure Lad, Eastern Florescence Fangzhu Palace, Chapter Thirty-Four*\nEastern Florescence emits its first light,\nHighest Dawn illumines Supreme Purity.\nThe Cavern shines with the halo of the Round Pearl,\nlucid and bright, the Purple Luminary gleams.\nSeven spirits return to the Emperor’s seat,\nFive Elders soar on jade wheels.\nThe Supreme One, King within the Radiant Scene,\nController of Life commands the ten thousand spirits.\nFloating amid cloud-waves, silently gazing toward\nthe Mud-Pill Palace’s city.\nSeven revolutions summon the Three Officials,\nthe Northern Lord bows in reverent presentation.\nThe Five Marchmounts answer the summons and arrive,\nerasing death to inscribe long life.\nThrice raising the Thunder-Spirit Talisman,\nmystically dissolving the great demonic essences.\nSeven ancestors are born into the Hall of Fortune,\nMysterious Florescence safeguards Yellow Tranquility.\nObserve the carriage’s repose, the luminous guest’s flourishing—\n*First Light* is the land of the sun’s rising,\n*Highest Dawn* is the name of a palace.\n*Round Pearl* and *Purple Luminary* are both names of the sun.\n*Yellow Tranquility* is the name of the Three Perfected of essence and blood.\n\n*Great Cavern Blood-Center Jade Talisman*\nRecite the incantation in silence:\n\nThe Blood-Center Crimson Radiance Lord,\nstyled Blended Unity, named Uncle Preserver of Firmness.\nThe Controller of Life’s essence-soul,\nstyled Hair-Knot Unity, named Celebrant of the Mysterious.\nThese two spirits ever guard my hundred joints’ blood,\nbelow the severed nodes.\nThrough kalpas receiving form,\nnone has not been constituted by essence and blood.\nThus, if the nodes remain knotted and unresolved,\nthe Dao of immortality is difficult to achieve.\nThe Scripture states: “The gate of the severed bones of both legs\nlies below the joints of the leg meridians,\noutward toward the depression beneath the ankle bones—\nthis depression is called the Gate of the Severed Bones.”\n\n*Scripture of the Nine Elder Immortal August Lords of Fusang, Great Emperor, Chapter Thirty-Five*\nThe Great Emperor and Nine Elders of the Capital\nreview the immortals and ascend Fusang.",
      "overlap_context": "g the kalpas, bridging the severed.\n---\n\n*Great Cavern Womb-Center Jade Talisman*\nRecite the incantation in silence:\n\nThe Great One Lord, styled Profound Solitude Prime,\nat dawn ascends the Great Elder’s repose—an allusion to the origin of spleen-earth;\nat dusk feasts in the Golden Flower’s ease—further alluding to the fluid of lung-metal.\n*Danling* is the name of a terrace.\n*Lingsu Lan* is the title of the Moon Mother.\n*Mingyang* is the name of a jade hall.\n*Longguang* is the name of a chariot.",
      "start_char": 13043,
      "end_char": 13498,
      "start_sentence": 928,
      "end_sentence": 958,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.410491943359375,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "七转召天帝，司命承神纲。 五岳启灵户，传制大魔宗。 河海皆受事，立示应会方。 保符泥丸内，守神曰桃康。 回明易死籍，记仙叔火王。 拔出三涂疾，去祸生上英。 七玄登朱宫，兆身会明阳。 上友方盈子，下携理维藏。 左摄明车君，右辅归盛昌。 混一玉景炁，化兆吉以强。 反婴元命童，檀炽吉祥钧。 天一元根仙，自在光明轮。 盈劫运，邕玉升。 京者，玉京之山也。 灵户者，符名也。 叔火王，下玄元母君名也。 上英者，心中一真名也。 朱官者，流火之庭也。 明阳者，玉堂也。 方盈子，月中桃君名也。 理维藏，天帝精魂名也。 祖明车，胞中黄炁君名也。 归盛昌，太一精魂名玄归子，字盛昌。 大洞七神玉符 服符微祝曰 上元玄父君，名高同生，字左回明。 下玄元母君，名叔火王，字右回光。 帝皇太一君； 名重冥空，字幽寥无。 九帝尊君，名日明真，字飞众帝生。 太帝精魂，名阳堂王，字八灵。 天帝九关开魂君，名回录道，字绝冥。 天纪帝魂大魔王，名照 无阿，字广神。 凡七神，常镇我本命之根，胞胎本结。 本命之根，即脐轮，子母分炁之根蒂也。 胞胎大结脐中，与肾相连，结胎之户也。 命门内宫、外宫，言入脐一寸内，有一带通丹田中门，乃结胎之地。 外宫指肾之外也，内宫，指脐之内也，只是一处。 小有玉真万华先生图玉君道经第三十六 玉真万华宫，高仙藏帝经。",
      "translated_text": "Seven Cycles summon the Heavenly Thearch,\nLife’s Controller upholds the divine net.\nThe Five Marchmounts open the numinous gate,\ntransmitting commands to the Great Demon Clan.\nRivers and seas all receive their charge,\nestablishing the responsive meeting ground.\nPreserve the talisman within the Mud-Pill Palace,\nguard the spirit named Peach Prosperity.\nReverse the radiance to alter the Register of Death,\ninscribe the immortal Uncle Fire King.\nExtract the three paths’ afflictions,\nbanish calamity to birth the Supreme Hero.\nSeven Mysteries ascend the Vermilion Palace,\nthe myriad bodies converge in Luminous Yang.\nAbove befriend Square Fullness Lad,\nbelow carry Principle’s Hidden Treasury.\nOn the left seize Bright Chariot Lord,\non the right assist Returning Prosperity.\nUnite the Jade Radiance qi,\ntransforming the myriad auspiciously to strength.\nReturn to infancy as the Primordial Life Youth,\nsandalwood blazes the auspicious hook.\nHeaven’s One, Primordial Root Immortal,\nself-so in the Wheel of Light.\nThrough kalpas revolving,\nharmonious jade ascends.\n\nThe Capital is the Mountain of Jade Capital.\nThe Numinous Gate is a talisman’s name.\nUncle Fire King is the name of the Lower Mystery’s Primordial Mother Lord.\nThe Supreme Hero is the name of the One True within the heart.\nThe Vermilion Palace is the courtyard of flowing fire.\nLuminous Yang is the Jade Hall.\nSquare Fullness Lad is the name of the Peach Lord of the Moon.\nPrinciple’s Hidden Treasury is the name of the Heavenly Thearch’s essence-soul.\nAncestral Bright Chariot is the name of the Yellow Qi Lord within the womb.\nReturning Prosperity is the name of the Great One’s essence-soul, Mysterious Return Lad, styled Prosperity.\n\n*Great Cavern’s Seven Spirit Jade Talismans*\nRecite softly when ingesting the talisman:\nUpper Mystery’s Mysterious Father Lord,\nnamed Lofty Co-Birth, styled Left Revolving Radiance.\nLower Mystery’s Primordial Mother Lord,\nnamed Uncle Fire King, styled Right Revolving Light.\nAugust Thearch Great One Lord,\nnamed Heavy Dark Void, styled Profound Silence.\nNine August Honorable Lords,\nnamed Sunlight True, styled Flying Multitude Thearch-Born.\nGreat Thearch’s Essence-Soul,\nnamed Yang Hall King, styled Eight Numinous.\nHeavenly Thearch’s Nine Passes Opening Soul Lord,\nnamed Revolving Record Dao, styled Utmost Dark.\nHeavenly Register’s Thearch-Soul Great Demon King,\nnamed Illuminating Non-Obstruction, styled Vast Spirit.\n\nThese seven spirits ever guard the root of my original destiny,\nthe womb’s primordial knot.\nThe root of original destiny is the navel wheel,\nthe root-stem of qi’s division between child and mother.\nThe womb’s great knot lies within the navel,\nconnected to the kidneys, the gate of the embryo’s formation.\nThe inner and outer palaces of the Gate of Destiny:\nwithin one inch of the navel lies a band leading to the Gate within the Cinnabar Field,\nthe place of the embryo’s formation.\nThe outer palace refers to the exterior of the kidneys,\nthe inner palace to the interior of the navel—\nthey are but one locus.\n\n*Lesser Cavern Jade True Myriad Flowers Master’s Diagram Jade Lord Scripture, Chapter Thirty-Six*\nWithin the Jade True Myriad Flowers Palace,\nlofty immortals conceal the Thearch’s scriptures.",
      "overlap_context": " the nodes remain knotted and unresolved,\nthe Dao of immortality is difficult to achieve.\nThe Scripture states: “The gate of the severed bones of both legs\nlies below the joints of the leg meridians,\noutward toward the depression beneath the ankle bones—\nthis depression is called the Gate of the Severed Bones.”\n\n*Scripture of the Nine Elder Immortal August Lords of Fusang, Great Emperor, Chapter Thirty-Five*\nThe Great Emperor and Nine Elders of the Capital\nreview the immortals and ascend Fusang.",
      "start_char": 13498,
      "end_char": 14056,
      "start_sentence": 959,
      "end_sentence": 998,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.39932131767273,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "主图九天表，洞观无中生。 七转召万真，五岳一来庭。 三官招众魔，司录校所呈。 拔籍重泉曲，仙名书太清。 七世解牢结，秽血息沉零。 反胎朱火室，更受洞神灵。 伯史卫神躯，令我保黄宁。 合帝伯，方超凝。 主图者，玉君主掌图录於九天也。 朱火室，朱陵火室。 伯史原，婴童之名。 黄宁，精血三真名。 大洞九神玉符. 服符微祝曰 三素老君，名牢张上，字神生道。 人中神名绿室。 盖老子之玄牝。 医经之任督，道家之人中，世莫知其机会之端。 正一左仙名仲成子，字四华尊，一名帝宾。 正一右仙名曲文子，字灵和，一名光贤。 凡三神，常镇我鼻下人中。 鼻神曰羽童、曰明梁、曰辟非、曰玉根、曰灵户、曰开关。 中央玄一老子，名林虚夫，字灵时道。 常镇通精之窍。 九曲、下户，人之阴也。 男曰九曲，女曰下户。 北方黑帝，名保成昌，字北伐。 常镇膀胱之中。 膀胱在小肠并胞之前，传之两边，密密相连。 故小肠水满，则膀胱少阳炁蒸之，然后肠之中水，随阳炁而过胞中，复化为水也。 西方白帝，名彰安幸，字西华。 一名 凌梵七灵。 常镇男之外肾，女之两乳。 南方赤帝，名长来觉，字南和。 常镇口中舌下。 下有华池之水。 东方青帝，名雕梁际，字青平。 常镇五脏之外。 膏膜膈也。",
      "translated_text": "The Chart Master governs the nine heavens’ outer realm,\npenetrating insight births from the formless void.\nSeven revolutions summon the myriad perfected,\nthe Five Marchmounts arrive at once before the court.\nThe Three Officials summon the host of demons,\nthe Registrar examines what is presented.\nExtracting names from the Yellow Springs’ crooked depths,\nimmortal titles are inscribed in the Great Clarity.\nSeven generations’ bonds are untied,\ndefiled blood ceases its sinking decay.\nReturning to the Cinnabar Fire Chamber,\none receives anew the cavern spirits’ numen.\nElder Scribe guards the divine body,\ncommanding me to preserve Yellow Tranquility.\nUnite with the Thearch’s Elder,\nthen transcend to congeal the primordial.\n\nThe Chart Master is the Jade Lord who governs charts and records in the nine heavens. The Cinnabar Fire Chamber is the Vermilion Numinous Fire Chamber. Elder Scribe is the original name of the Infant Child. Yellow Tranquility is the name of the Three Perfected of essence and blood.\n\nThe Great Cavern’s Nine Spirit Jade Talisman.\nWhen ingesting the talisman, silently invoke:\nThe Three Primes Elder Lord, named Lao Zhangshang, styled Divine Birth Dao.\nThe human’s inner spirit is named Green Chamber,\nwhich is Laozi’s Mysterious Female.\nIn medical classics, it is the Conception and Governor Vessels;\nin Daoist practice, it is the human center—\nyet the world knows not the mechanism of its pivotal juncture.\n\nThe Orthodox Unity Left Immortal is named Zhongchengzi, styled Fourfold Flower Venerable, also called Thearch’s Guest.\nThe Orthodox Unity Right Immortal is named Quwenzi, styled Numinous Harmony, also called Radiant Worthies.\nThese three spirits ever guard my philtrum.\n\nThe nose spirits are named Feather Child, Bright Beam, Ward-Off-Wrong, Jade Root, Numinous Portal, and Open Pass.\nThe Central Mysterious One Elder Lord is named Lin Xufu, styled Numinous Timely Dao,\never guarding the orifice of essence-transmission.\n\nNine Bends and Lower Gate are the human’s yin.\nIn men, it is called Nine Bends; in women, Lower Gate.\nThe Northern Dark Thearch is named Baochengchang, styled Northern Campaign,\never guarding within the bladder.\nThe bladder lies before the small intestine and womb,\ntransmitting to both sides, intimately connected.\nThus when the small intestine is full of water,\nthe bladder’s lesser yang qi steams it,\nwhereupon the water within the intestine\nfollows the yang qi through the womb and transforms back into water.\n\nThe Western White Thearch is named Zhang’anxing, styled Western Florescence,\nalso called Soaring Brahma Seven Spirits,\never guarding men’s external kidneys and women’s two breasts.\nThe Southern Vermilion Thearch is named Changlaijue, styled Southern Harmony,\never guarding beneath the tongue within the mouth,\nwhere the Flower Pool’s waters lie.\nThe Eastern Azure Thearch is named Diaoliangji, styled Azure Balance,\never guarding the exterior of the five viscera.\nThe fat membrane is the diaphragm.",
      "overlap_context": "on.\nThe inner and outer palaces of the Gate of Destiny:\nwithin one inch of the navel lies a band leading to the Gate within the Cinnabar Field,\nthe place of the embryo’s formation.\nThe outer palace refers to the exterior of the kidneys,\nthe inner palace to the interior of the navel—\nthey are but one locus.\n\n*Lesser Cavern Jade True Myriad Flowers Master’s Diagram Jade Lord Scripture, Chapter Thirty-Six*\nWithin the Jade True Myriad Flowers Palace,\nlofty immortals conceal the Thearch’s scriptures.",
      "start_char": 14056,
      "end_char": 14559,
      "start_sentence": 999,
      "end_sentence": 1037,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.73731565475464,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "五脏惟心肺居膈上。 中央黄帝，名含光露，字魂明。 常镇脾胃之中。 《黄庭经》曰：脾长一尺掩太仓。 又《中黄经》曰：胃为太仓。 太仓之口，胃脘之内，正是分擘清浊，传递之户也。 玄洲二十九真伯上帝司禁君道经第三十七 玄洲绝三津，羽景太无庭。 回霄飞重漠，委化混万精。 五云蔚绝空，七霞落圆明。 朗朗幽寥子，梵昌济黄宁。 五老飞绛华，散香携玉灵。 金质濯帝川，绿 烟霭流琼。 神拔三涂积，仙胎结兆形。 上清玉皇师，玉宸大道君。 与心绛宫神，飞澄太玄尊。 开神华，大纪元。 玄洲绝岛之下，有三弱之津，即弱水也。 羽景，堂名。 重漠，山名。 圆明，日名也。 幽寥子，太一君字也。 梵昌，太一精魂名也。 黄宁，精血三真名也。 玉灵，上清之玉童也。 帝川，池名。 玉宸，即上清也。 大洞三神玉符 服符微祝曰 泥丸上元帝卿，名兆勒精，字中玄生，一名起非伯，一名常扶肇。 绛宫中元辅卿，名中光坚，字四化灵，一名幽车伯，一名董史华。 黄庭下元弼卿，名归上明，字谷下玄，一名奉申伯，一名承光生。 常镇我三元之宫，卫我本命，守我帝室。 太无晨中君刊峨眉山中洞宫玉户太素君道经第三十八 三真生太无，玉户□晨霞。 太素洞元灵，丹林生朱柯。 回神九重府，内昌发琼华。 百关纳精液，停年三秀阿。 兆身腾玉清，七祖离幽涂。 长保不终劫，万世承仙家。 位为圣统尊，玉清大洞都。 陵昌玉，百涂君。 太素洞元灵者，太素之天，洞焕元灵之殿也。 内昌，台名。 三秀，山名。 大洞都，神都也。 大洞帝一玉符 服符微祝曰 大洞帝一尊君，名父宁在，字合母精，回风混合，镇卫死炁紧关，统三十九户之神，常在人中或上唇之内，光□目中瞳子，自无而有之，自有而无之，有有不有，无无不无，号真一之所，变万归一之道。 上唇之内，上齿之外，及鼻下人中，乃神所居，混合百神之事。 盖任督二脉，为一身阴阳之海，五炁真元之会。 仙经云：一物含五采，永作仙人梯。 西元龟山九灵真仙母青金丹皇君道经第三十九 西元九灵炁，金丹流云宫。 上极游曜杪，晖景大霞空。 动回九天轮，静沉八流纲。 室有胎仙母，携衿太帝皇。 玄一灵时生，三老素牢张。 左把五符籍，右携理神宗。 同登龙朱阙，稽首玉清房。 拔弃死灭根，养形三五中。 七祖解尸结，受福明朱方。 上澄圣中尊，符化玄炁王。 极炁寿，受乘明。",
      "translated_text": "The five viscera—only the heart and lungs reside above the diaphragm. The Central Yellow Thearch is named Han Guanglu, styled Hunming, ever guarding the center of the spleen and stomach. The *Huangting Jing* states: \"The spleen spans one foot, covering the Great Granary.\" The *Zhonghuang Jing* also says: \"The stomach is the Great Granary.\" The mouth of the Great Granary, within the stomach’s cavity, is precisely the gate where the clear and turbid are separated and transmitted.\n\n*Xuanzhou Twenty-Nine Perfected Lords, Thearchs, and Controllers of Prohibitions, Scripture of the Dao, Chapter Thirty-Seven*\n\nXuanzhou severs the Three Fordless,\nFeathered Splendor in the Great Void’s court.\nTwisting skies fly o’er layered deserts,\nTransforming and blending the myriad essences.\nFive clouds billow in the boundless sky,\nSeven auroras descend upon Round Brilliance.\nBright and clear, the Secluded and Vast One,\nBrahma Prosperity aids Yellow Tranquility.\nThe Five Elders soar with crimson blossoms,\nScattering incense and bearing Jade Spirits.\nGolden essence bathes in the Thearch’s River,\nGreen mists drift o’er flowing jade.\nThe divine severs the Three Paths’ accumulations,\nImmortal embryos form in nascent shapes.\nThe Supreme Clarity Jade Thearch’s Master,\nThe Jade Palace Great Dao Lord,\nWith the heart’s Crimson Palace spirit,\nSoars to the Venerable of Great Mystery.\nUnfurl the divine radiance,\nInaugurate the Great Kalpa.\n\nBeneath the isles of Xuanzhou lies the Ford of Three Weaknesses—this is the Weak Water. Feathered Splendor is the name of a hall. Layered Desert, a mountain. Round Brilliance, the name of the sun. The Secluded and Vast One is the style of the Grand One Lord. Brahma Prosperity is the name of the Grand One’s essence-spirit. Yellow Tranquility is the name of the Three Perfected of Essence-Blood. Jade Spirit is the Jade Youth of Supreme Clarity. Thearch’s River, a pool. Jade Palace, Supreme Clarity itself.\n\n*The Three Divine Jade Talismans of the Great Cavern*\nRecite the talisman’s subtle invocation:\nThe Upper Prime Minister of Mud-Pill Palace,\nNamed Zhao Lejing, styled Zhong Xuansheng,\nAlso called Qi Feibo, also Chang Fu Zhao.\nThe Middle Prime Minister of Crimson Palace,\nNamed Zhong Guangjian, styled Si Hualing,\nAlso called You Chebo, also Dong Shihua.\nThe Lower Prime Minister of Yellow Court,\nNamed Gui Shangming, styled Gu Xiaxuan,\nAlso called Feng Shenbo, also Cheng Guangsheng.\nEver guard my Three Prime Palaces,\nProtect my original destiny,\nSafeguard my Thearch’s chamber.\n\n*The Scripture of the Great Void’s Dawn Lord, Engraved in the Jade Gate Cavern Palace of Mount Emei, Chapter Thirty-Eight*\n\nThe Three Perfected birth the Great Void,\nJade Gate □ dawn’s auroras.\nThe Great Simplicity’s Cavern Spirit,\nCinnabar Forest bears vermilion branches.\nReturning spirit to the Ninefold Palace,\nInner Prosperity blooms jade blossoms.\nA hundred passages receive essence-fluid,\nProlonging years in Three Elegance’s vale.\nThe nascent body ascends Jade Clarity,\nSeven ancestors escape the dark paths.\nEver preserve beyond the final kalpa,\nFor myriad ages inheriting the immortal lineage.\nEnthroned as the Sage Lineage’s Venerable,\nThe Great Cavern’s capital of Jade Clarity.\nLingchang Jade, the Lord of a Hundred Paths.\n\nThe Great Simplicity’s Cavern Spirit refers to the Great Simplicity Heaven’s Cavern-Radiant Palace of Primordial Spirit. Inner Prosperity is the name of a terrace. Three Elegance, a mountain. Great Cavern Capital, the divine capital.\n\n*The Great Cavern Thearch-One Jade Talisman*\nRecite the talisman’s subtle invocation:\nThe Venerable Lord of the Great Cavern Thearch-One,\nNamed Fu Ningzai, styled He Mujing,\nRevolving winds blend and merge,\nGuarding the tight passes of death’s qi,\nCommanding the thirty-nine gate spirits of the body.\nEver present within the human—\nWithin the upper lip, the inner side of the upper teeth,\nAnd below the nose in the philtrum, where the spirit dwells,\nThe convergence of all spirits’ affairs.\nFor the Conception and Governor Vessels are the seas of the body’s yin and yang,\nThe meeting of the five qi’s true origin.\nThe immortal scriptures say:\n\"A single thing embraces five hues,\nForever the immortal’s ladder.\"\n\n*The Scripture of the Western Prime’s Nine-Spirit True Immortal Mother, Azure Gold Elixir Sovereign Lord, Chapter Thirty-Nine*\n\nWestern Prime’s ninefold spirit,\nGolden Elixir flows in Cloud Palace.\nAscending to the utmost apex of radiance,\nSplendor and light fill the great auroral sky.\nIn motion, revolving the Nine Heavens’ wheels,\nIn stillness, sinking the Eight Streams’ net.\nWithin the chamber, the Embryo Immortal Mother,\nBearing the lapels of the Grand Thearch.\nMysterious Unity’s spirit arises in time,\nThe Three Elders spread the plain and firm.\nLeft hand grasps the Five Talisman Registers,\nRight hand carries the governance of the divine lineage.\nTogether ascending the Vermilion Dragon Gate,\nBowing heads in the Jade Clarity Chamber.\nUprooting the roots of death and decay,\nNurturing form within the Three and Five.\nSeven ancestors untie the corpse’s knots,\nReceiving blessings in the Bright Vermilion Realm.\nSupreme Clarity’s Sacred Central Venerable,\nTalisman-transforming Mysterious Qi King.\nUtmost qi’s longevity,\nReceiving the luminous chariot.",
      "overlap_context": "\n\nThe Western White Thearch is named Zhang’anxing, styled Western Florescence,\nalso called Soaring Brahma Seven Spirits,\never guarding men’s external kidneys and women’s two breasts.\nThe Southern Vermilion Thearch is named Changlaijue, styled Southern Harmony,\never guarding beneath the tongue within the mouth,\nwhere the Flower Pool’s waters lie.\nThe Eastern Azure Thearch is named Diaoliangji, styled Azure Balance,\never guarding the exterior of the five viscera.\nThe fat membrane is the diaphragm.",
      "start_char": 14559,
      "end_char": 15528,
      "start_sentence": 1038,
      "end_sentence": 1101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.677143096923828,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "西元者，桐柏山，或云昆仑山。 九灵，山中馆名也。 九天轮，乃天阙也。 八流钢，流纲之八山，即地轴也。 仙母乃坤母，为黄婆，为无夜夫人，为大药王，即太阴炼形之道。 灵时者，中央玄一老子之字也。 牢张上，三素老君名也。 神宗，中央司命丈人名也。 死灭根，言拔弃三十九死户也。 三五中，河图纵横，三五之数也。 大洞总真玉符 右符总三十九符真炁，於帝一之所。 同三十九符并以丹书，服皆用黄纸，佩通青素一幅，五尺五寸。 此符单用，亦可功备大成。 太玄真人咒曰 真人姓赵，讳守真，主太玄清明宫。 天中之天，仙峰岳京，楼台殿阁，宫室阙廷，洞房庭馆，福堂金城， 灵轩帝席，上首之名，关窍开通，门户窗棂，日月星跃，光□目睛， 风云烟霞，气息混凝，川池海波，血液津精，五脏六府，面部身形， 胞胎结节，各有神灵，求之不见，呼之斯应，神有万万，主一清宁， 一源万派，浊浊澄澄，万流一源，四海合并，大哉空洞，六合黄庭， 真一不二，法门无扃，三十死户，死炁常冰，我呼我神，常令惺惺， 如睡斯觉，如醉斯醒，虚灵谷神，混合五行，九十七相，放大光明， 死户之炁，自然更生，祖炁回润，孙枝敷荣，冢讼罢对，冤债无征， 普度天人，妙行圆成，大洞之富，万宝充盈，大洞之贵，仙位高登， 车回毕道，太微上清。 大洞内炼玉章 青童大道君，东蹑扶桑云。 心传大洞旨，灵章粲符文。 琅琅琼玉音，清响彻帝阍。 哀悯人间世，灭魔绝妖氛。 惠我清净光，弘济照无垠。 有如苍胡颉，运度玄中人。 五府生华采，九元常镇身。 虎服摄众邪，龙旗召百神。 离罗吐白炁，开朗高上晨。 太一雌雄混，七真阴阳分。 暂诣六渊宫，再回九光轮。 永寿无终劫，太初长为邻。 元君号紫虚，乘鸾谒玄都。 手持大洞经，锵然鸣琼琚。 分章三十九，嘘炁写灵符。 召摄生身神，静密守所居。 九真肃严卫，三元护储胥。 左携千景精，右抱起常扶。 并襟乐黄室，镜心留云珠。 游玩真阳馆，夙驾羽明车。 青峰插霄汉，玄景薄天衢。 洞微根至理，豁落起太无。 岂期咄嗟顷，奋迅风雷俱。 长保为仙伯，万神伺招呼。 三茅句曲山，兄弟列仙班。 振接魏元君，金简玉斑斓。 济济朱霞被，峨峨玉晨冠。 紫房锦帷幄，形庭青琅玕。 同心诣兰阙，接武登天坛。 逍遥蹑云汉，啸傲鸣佩环。 三晨散灵彩，四海澄波澜。 迅辔御神虎，拂衣乘青鸾。 位登圣统尊，消弥累劫艰。 呼吸九灵炁，炼造七还丹。 养形混帝室，回风启天关。 道通自然质，灵威来人间。 玉清大洞内炼玉经 玉清帝君玉章上品 碧梅青童君，驾龙朝紫宸。 九曜耀八极，五斗临生门。 二十八宿君，灿烂明天阍。 五帝来玉軿，三官降玄恩。 祥光洞天地，瑞气回阳春。 天司定仙籍，丁甲除妖氛。 金朦启玉章，日月停朱轮。 万神含我室，寿与天地存。 玉清内炼玉章中品 无上大罗天。 三景合四明。 紫户生梵炁，金光焕九清。 混合万神备，大圣期玉京。 洞章歌玉音，中黄敷宝经。 五帝宣玉符，三官启百灵。 劫劫应太平，返本如孩婴。 真风日荡荡，道炁常泠泠。 玉女散璚葩，金童闲玉扃。 无为赤元君，与道伺升沈。 玉清内炼玉章下品 嵯峨九光山，璚阙居上仙。 日月运金炁，龙虎奔玄关。",
      "translated_text": "The Western Origin refers to Mount Tongbo or, as some say, Mount Kunlun. The Nine Spirits is the name of a hall within the mountain. The Nine Heavens’ Wheels are the celestial gates. The Eight Streams’ Net refers to the eight mountains of the earthly axis. The Immortal Mother is the Mother of Earth, known as the Yellow Matriarch, the Lady of No Night, the Great Medicine King—she embodies the Dao of refining form within the Great Yin.\n\nThe Spirit of the Time is the name of the Central Mysterious Unity Elder. The Three Elders are the Three Pristine Lords. The Divine Lineage refers to the Central Controller of Destiny, the Venerable One. The roots of death and decay signify the uprooting of the thirty-nine death gates. The Three and Five denote the vertical and horizontal numbers of the River Chart.\n\nThe *Great Cavern’s Jade Talisman of Total Perfection*\nThis talisman encompasses the thirty-nine talismanic true qi at the abode of the Supreme Unity. Alongside the thirty-nine talismans, all are inscribed in cinnabar, written on yellow paper, and worn with a plain blue silk sash measuring five feet and five inches. Even when used alone, this talisman may achieve great perfection.\n\nThe Incantation of the Supreme Mystery Perfected One\nThe Perfected One, surnamed Zhao and named Shouzhen, presides over the Palace of Supreme Mystery and Clarity.\nHeaven within heaven, the celestial peak and sacred summit,\nPavilions and terraces, palaces and halls, chambers and courts,\nCavernous abodes and jade chambers, halls of fortune and golden cities,\nSpiritual chariots and imperial seats, the names of the highest ranks—\nAll passages and orifices open and flow,\nDoors and windows, lattice and frames,\nSun, moon, and stars leap forth, light fills the eyes,\nWind, clouds, mist, and auroras, qi congeals in harmony,\nRivers, pools, and ocean waves, blood and fluids, essence and spirit,\nThe five viscera and six bowels, the face and form of the body,\nThe womb’s knots and nodes—each harbors its own spirit.\nSeek them and they are unseen, call them and they respond at once.\nThough spirits number in the millions, they serve the One of Pure Tranquility.\nOne source, myriad streams—though turbid or clear,\nAll rivers return to a single source, the four seas merge as one.\nVast is the Cavern of Emptiness, the Six Harmonies’ Yellow Court,\nThe True One is undivided, the Dharma gate has no lock.\nThe thirty death gates, their deathly qi ever frozen—\nI call to my spirits, ever keeping them wakeful,\nAs if from sleep they awaken, as if from drunkenness they sober.\nEmpty and numinous, the Valley Spirit unites the Five Phases,\nNinety-seven forms radiate great light.\nThe qi of the death gates naturally regenerates,\nAncestral qi returns to moisten, descendant branches flourish.\nLitigation ceases, grievances dissolve without trace,\nAll beings are universally delivered, wondrous practice reaches completion.\nThe wealth of the Great Cavern overflows with myriad treasures,\nIts nobility ascends to the highest immortal ranks.\nThe chariot returns to complete the Dao,\nAscending to the Supreme Mystery and Upper Clarity.\n\nThe *Jade Stanzas of the Great Cavern’s Inner Jade Chapters*\nThe Great Dao Lord of the Azure Youth,\nTreading the clouds of Fusang in the east,\nTransmits the Great Cavern’s decree,\nLuminous stanzas and resplendent talismanic script.\nResonant jade tones, pure echoes reach the imperial gates.\nMoved by compassion for the world of mortals,\nHe vanquishes demons and dispels malevolent vapors.\nBestowing upon me the light of purity,\nIts vast salvation illumines without bound,\nLike the ancient Cang Jie, he ferries those within the Mystery.\nThe Five Palaces bloom with radiant hues,\nThe Nine Origins ever guard the body.\nTiger robes subdue all evil,\nDragon banners summon the hundred spirits.\nThe Net of Separation exhales white qi,\nRevealing the dawn of the highest realms.\nThe Supreme Unity blends yin and yang,\nThe Seven Perfected divide them.\nBriefly visiting the Six Abyssal Palaces,\nThen returning to the Ninefold Wheel of Light,\nEternally enduring beyond all kalpas,\nForever neighbor to the Great Beginning.\n\nThe Purple Void Lady, named Yuanjun,\nRides a simurgh to pay homage at the Mysterious Capital.\nIn hand she holds the *Great Cavern Scripture*,\nIts jade pendants chiming with a crystalline ring.\nDividing the stanzas into thirty-nine,\nShe exhales qi to inscribe the numinous talismans.\nSummoning and gathering the spirits of the living body,\nShe guards their abodes in stillness and secrecy.\nThe Nine Perfected stand in solemn vigil,\nThe Three Origins protect the storehouses.\nTo her left, she carries the Thousand Radiance Essence,\nTo her right, she embraces the Ever-Upholding One.\nTogether they enter the Yellow Chamber in joy,\nTheir mirrored hearts retaining the cloud-like pearl.\nRoaming the True Yang Lodge,\nHer ancient chariot drawn by feathered luminaries,\nGreen peaks pierce the empyrean,\nDark radiance grazes the celestial thoroughfare.\nThe profound root of the Cavern’s subtlety,\nThe vast and boundless arising from the Great Nonbeing—\nWho could have foreseen that in a mere instant,\nShe would surge forth with the fury of wind and thunder?\nForever preserved as an immortal elder,\nMyriad spirits attend her call.\n\nOn the Three Mao Brothers of Mount Juqu,\nRanked among the immortals’ assembly,\nThey welcome the Lady Wei Yuanjun,\nHer golden tablets inscribed with jade patterns.\nResplendent in crimson auroras,\nAdorned with towering Jade Dawn crowns,\nWithin purple chambers and brocade canopies,\nTheir courtyards lined with azure jade.\nWith one heart they approach the Orchid Gate,\nStep by step ascending the Heavenly Altar.\nCarefree, they tread the Milky Way,\nWhistling and roaming, their pendants chiming.\nThe Three Dawns scatter spiritual radiance,\nThe Four Seas calm their waves.\nSwiftly they ride divine tigers,\nBrushing their robes as they mount azure simurghs.\nAscending to the honored ranks of the sagely lineage,\nDissolving the hardships of accumulated kalpas.\nInhaling the qi of the Nine Spirits,\nRefining the Sevenfold Return Elixir.\nNurturing form within the imperial chamber,\nRevolving the wind to open the celestial gates.\nThe Dao flows through natural essence,\nNuminous power descends to the mortal realm.\n\nThe *Jade Stanzas of the Great Cavern’s Inner Jade Chapters of the Jade Clarity*\n*Upper Grade of the Jade Stanza of the Jade Clarity Lord*\nThe Azure Plum Lord of the Azure Youth,\nDriving dragons to court the Purple Palace.\nThe Nine Luminaries illuminate the Eight Poles,\nThe Five Celestial Granaries descend to the Gate of Life.\nThe Twenty-Eight Constellation Lords,\nResplendent, brighten the celestial gates.\nThe Five Emperors arrive in jade chariots,\nThe Three Officials bestow profound grace.\nAuspicious light pervades heaven and earth,\nPropitious qi revives the spring of yang.\nHeavenly officers fix the immortal registers,\nThe Ding and Jia spirits dispel demonic vapors.\nGolden veils unveil the jade stanzas,\nSun and moon halt their crimson wheels.\nMyriad spirits fill my chamber,\nMy longevity endures with heaven and earth.\n\n*Middle Grade of the Inner Jade Stanza of Jade Clarity*\nThe Supreme Great Luo Heaven,\nThree Radiances merge with the Four Illuminations.\nPurple portals birth Brahma qi,\nGolden light blazes through the Nine Clarities.\nAll spirits unite in harmony,\nThe Great Sage awaits the Jade Capital.\nCavern stanzas chant jade tones,\nThe Central Yellow unfolds the precious scripture.\nThe Five Emperors proclaim jade talismans,\nThe Three Officials summon the hundred spirits.\nKalpa after kalpa, they respond to great peace,\nReturning to the root like an infant.\nThe true wind ever billows,\nThe Dao’s qi perpetually pure.\nJade maidens scatter gem-like blossoms,\nGolden lads leisurely tend the jade gates.\nThe Non-Action Red Origin Lord,\nAccompanies the Dao in its rising and sinking.\n\n*Lower Grade of the Inner Jade Stanza of Jade Clarity*\nTowering, the Ninefold Mountain of Light,\nIts jade towers housing the highest immortals.\nSun and moon circulate golden qi,\nDragon and tiger rush through the Mysterious Pass.",
      "overlap_context": "and grasps the Five Talisman Registers,\nRight hand carries the governance of the divine lineage.\nTogether ascending the Vermilion Dragon Gate,\nBowing heads in the Jade Clarity Chamber.\nUprooting the roots of death and decay,\nNurturing form within the Three and Five.\nSeven ancestors untie the corpse’s knots,\nReceiving blessings in the Bright Vermilion Realm.\nSupreme Clarity’s Sacred Central Venerable,\nTalisman-transforming Mysterious Qi King.\nUtmost qi’s longevity,\nReceiving the luminous chariot.",
      "start_char": 15529,
      "end_char": 16858,
      "start_sentence": 1102,
      "end_sentence": 1188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.39522123336792,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "灌溉碧芝房，灵苗生翠烟。 焕赫紫霞光，万圣垂云軿。 洞歌声朗朗，上彻天上天。 若能保其室，万劫为天仙。 内宝不外求，是为无上玄。 炼成大宝器，消摇归帝轩。 都匠符 服符咒曰 日出洋洋，真武游行，行符敕水，坐视四方，求道得道，求仙得仙， 长生久视，位纳真祥，万邪一见，情惨惊忙，急急如律令。 服用参扬。 沐浴，亦用此符。 一名大洞玉清都录真符，乃老君玉篆符廉中第一符，三中灵文，此符端首。 太玄真人咒曰 三十九户，固有神灵，未闻玉经，莫知其名，三十九符，随炁运行， 不见玉经，其文未明，我有道缘，心运玉经，经以致敬，经以致诚， 符求同炁，神应同声，灵谷洞虚，万籁自鸣，青天不云，真文自成， 感应之理，会神聚精，胞结自解，尸血自澄，阳回祖根，玄华长青， 父宁母精，徊风棍凝，宝珠放光，返胎结婴，气转洪钧，火候调停， 守雌抱雄，收视返听，颐养婴童，富贵黄庭，升降自然，回镜玉清， 胎辕既返，玉席高登，万遍道备，龙鹤来迎，功成名遂，玄俗光荣。 大洞玉经卷下竟",
      "translated_text": "Irrigating the chambers of azure mushrooms,\nDivine sprouts rise in emerald mist.\nResplendent, the purple auroras glow,\nMyriad sages descend in cloud-borne chariots.\nCavern hymns ring clear and bright,\nPiercing through heaven upon heaven.\nShould one preserve this chamber,\nFor ten thousand kalpas they become a celestial immortal.\nThe inner treasure is not sought without—\nThis is the supreme mystery.\nRefining the great vessel of treasure,\nOne dissolves and drifts back to the imperial chariot.\n\n**Talisman of the Capital Artisan**\n*Incantation for Ingesting the Talisman:*\nThe sun rises, vast and radiant,\nTrue Martial roams and traverses.\nMarching with talisman, commanding water,\nSeated, surveying the four directions.\nSeek the Dao and attain the Dao,\nSeek immortality and attain immortality.\nLong life and enduring vision,\nRank receives true auspices.\nAt the sight of myriad evils,\nTheir hearts tremble in dread.\nHasten, hasten, as decreed by statute and ordinance.\n\n*Usage:* Ingest with reverent invocation. For ablutions, this talisman is also used.\n\nAlso named *The Great Cavern Jade Clarity Register of the True Talisman of the Capital*, this is the first talisman in the Jade Script Talisman Treasury of the Lord Lao, the foremost of the three numinous writings.\n\n*The Perfected of the Great Mystery’s Incantation:*\nThirty-nine portals,\nFirmly guarded by spirits.\nBefore hearing the Jade Scripture,\nNone knew their names.\nThirty-nine talismans,\nCirculate with the qi’s movement.\nWithout seeing the Jade Scripture,\nTheir patterns remain obscure.\nI possess the affinity of the Dao,\nMy heart revolves the Jade Scripture.\nThe scripture commands reverence,\nThe scripture commands sincerity.\nTalismans seek unity with qi,\nSpirits respond in unison.\nThe numinous valley, cavernous and void,\nMyriad sounds resonate of themselves.\nThe azure sky bears no clouds,\nYet the true script emerges on its own.\nThe principle of resonance,\nGathers spirit and concentrates essence.\nThe fetal knot unravels of itself,\nThe corpse’s blood clarifies on its own.\nYang returns to the ancestral root,\nThe mysterious blossom flourishes evergreen.\nFather’s serenity, mother’s essence,\nRevolving wind, congealing staff.\nThe precious pearl radiates light,\nReturning to the womb, the infant coalesces.\nQi revolves the vast potter’s wheel,\nFire and timing harmonized.\nEmbrace the feminine, hold the masculine,\nWithdraw vision, return hearing.\nNurture the infant child,\nWealth and honor fill the Yellow Court.\nAscent and descent occur naturally,\nThe mirror turns toward Jade Clarity.\nOnce the fetal carriage returns,\nThe jade mat ascends on high.\nAfter ten thousand recitations, the Dao is complete,\nDragon and crane come to welcome.\nMerit accomplished, fame achieved,\nThe mystery and the common alike shine in glory.\n\n*Here ends the Lower Scroll of the Great Cavern Jade Scripture.*",
      "overlap_context": "reat peace,\nReturning to the root like an infant.\nThe true wind ever billows,\nThe Dao’s qi perpetually pure.\nJade maidens scatter gem-like blossoms,\nGolden lads leisurely tend the jade gates.\nThe Non-Action Red Origin Lord,\nAccompanies the Dao in its rising and sinking.\n\n*Lower Grade of the Inner Jade Stanza of Jade Clarity*\nTowering, the Ninefold Mountain of Light,\nIts jade towers housing the highest immortals.\nSun and moon circulate golden qi,\nDragon and tiger rush through the Mysterious Pass.",
      "start_char": 16859,
      "end_char": 17314,
      "start_sentence": 1189,
      "end_sentence": 1210,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.464568614959717,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\大洞玉经.txt",
        "category": "本文类"
      }
    }
  ]
}