{
  "source_id": "大明玄天上帝瑞应图录",
  "source_file": "chunked_daozang\\大明玄天上帝瑞应图录.json",
  "total_chunks": 10,
  "total_original_chars": 4732,
  "total_translated_chars": 30019,
  "total_translation_time": 145.94340109825134,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
    "category": "记传类"
  },
  "full_translation": "**The *Illustrated Record of Auspicious Responses of the Great Ming’s Dark Heaven Supreme Emperor***\n\n**Title:** *Illustrated Record of Auspicious Responses of the Great Ming’s Dark Heaven Supreme Emperor*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section of the *Dongshen* Department\n\n---\n\n**Imperial Stele for the Daoist Palace of Mount Taihe in the Great Peaks**\n\nIt is said that the boundless without trace is called sageliness; the inexhaustible and unfathomably subtle is called divinity. Thus, one who moves through heaven and earth, governs yin and yang, emerges from being and enters non-being, expands and contracts in the indistinct, rides the sun and drives the moon, drums the winds and harnesses thunder, now as rain, now as clouds—warding off calamities, repelling misfortunes, driving away sandstorms to summon blessings, regulating the four seasons, controlling the myriad things as if with bellows, and shaping all beings to perfect the work of transformation—is none other than the Dark Heaven Supreme Emperor, the Perfected Martial Deity.\n\nAccording to Daoist scriptures, the deity originally arose from the *Xianhe* (\"Black Five Spirits\") of primordial chaos, the transformation of the Great Yin Celestial One. Born with divine intelligence, perceptive of the distant and discerning of the minute, he concealed his heart in devotion to the Dao, his aspirations attuned to the Great Void. He entered Mount Wudang to cultivate inner refinement, his mind unified and will concentrated. Thereupon, the Jade Pure Primordial Lady bestowed upon him the Supreme Dao of the Limitless. When his merit was complete and his Dao perfected, he ascended to heaven on a dragon, returning to his root and resuming his position. His illustrious name endures through kalpas, as eternal as heaven and earth, as enduring as the sun and moon.\n\nWudang was formerly called Taihe (\"Great Harmony\"), but it was deemed that only the Dark Warrior (Xuanwu) could befit such a name, hence it was renamed Wudang (\"Martial Ascendancy\"). The mountain sprawls over eight hundred *li*, crowned by seventy-two peaks, thirty-six precipitous cliffs, and twenty-four secluded ravines. The loftiest peak is called Heavenly Pillar. The most sublime site is Purple Empyrean. At South Cliff, the ethereal vapors rise above while sheer chasms yawn below, spanning the purity of the grotto-heaven and towering over the profound palaces of the blessed land. Purple Empyrean and South Cliff each have their palaces. From South Cliff, thirty *li* north lies the Five Dragons Palace. Another forty *li* brings one to the foot of the mountain, where the True Celebration Palace stands. All were sites for offering sacrifices and praying for blessings, but by the end of the Yuan dynasty, they were destroyed by war and lay in ruins—overgrown with brambles, reduced to rubble, abandoned and unvisited.\n\nHeaven ordained the flourishing foundation of our dynasty. My late imperial father, the Grand Progenitor Gao Emperor, pacified the realm with a single army, and the deity secretly and openly assisted him, his numinous radiance resplendent. When I raised righteous troops to quell internal strife, the deity aided me at every turn—winds sweeping, thunder striking—his traces manifest. Since my ascension to the throne, abundant blessings have been bestowed, and my reverence has only deepened. Such wonders as the pomegranate and plum bearing fruit again, the harvests succeeding year after year, and auspicious omens proliferating have been unmistakable signs. Day and night, I have pondered how to repay the deity’s grace.\n\nMoreover, the toils of my late imperial father and mother, their boundless kindness like the vast heavens, are beyond full recompense. Considering the abode of the Wudang deity, I solemnly commanded my ministers to seek an auspicious site within several dozen *li* of the Five Dragons’ convergence. There, the Jade Void Palace of the Dark Heaven was constructed. At Purple Empyrean, South Cliff, and the Five Dragons, the Supreme Purple Empyrean Palace, the Great Sage South Cliff Palace, and the Prosperous Sage Five Dragons Palace were built. Atop Heavenly Pillar Peak, a bronze hall was cast, gilded with gold, and the deity’s image was sculpted to receive eternal offerings. The divine palaces and immortal abodes were resplendently renewed.\n\nFrom the inception of the project to its completion, the deity repeatedly manifested his presence: auspicious lights illuminated the heavens, mountain peaks glowed, grasses and trees took on richer hues, and numinous vapors gathered and dispersed in myriad transformations. All who witnessed these wonders bowed in awe and reverence. The pomegranate and plum bore fruit in even greater abundance than before.\n\nThe Nine Lands revealed their secrets, and a golden pestle leapt forth. Yin and yang stored their essence, while the mysterious substance flowed and glistened. Wondrous signs multiplied beyond enumeration, defying all record. Such were the responses of the deity.\n\nThereupon, Daoist priests were appointed as superintendents to oversee each palace, ensuring the rites were conducted with solemnity, that the divine grace might be fittingly requited. Above, this was to honor and invoke the celestial spirits of the imperial father, the Grand Ancestor Emperor Taizu, and the imperial mother, the Filial and Compassionate Grand Empress Xiaoci; below, it was to pray for blessings near and far for all ministers and commoners. Though the deity roams the boundless, transforming without fixed form—responding here to a stimulus there, present wherever it turns—without this, how could Our sincerity be conveyed, or the reverent hearts of all under Heaven be bound together?\n\nMoreover, the harmonious qi of mountains and rivers converges here, intertwining with the deity as inner and outer. When the deity descends or ascends, drifting and soaring in radiant freedom, casting its gaze upon familiar haunts, would it not linger here? Thus, the construction of these palaces and temples was not to be done without.\n\nWith due reverence, this text is inscribed and carved upon the mountain’s stele, to proclaim the divine merit for all eternity.\n\nOn the third day of the twelfth month in the sixteenth year of the Yongle reign.\n\n**Imperial Edict:**\nAt the various palaces and temples of the Great Peak, Mount Taihe, those who cultivate the Dao—nurturing the spirit and preserving their true nature, embracing the One and guarding simplicity—distance themselves from worldly forms and sever all mundane affairs. Their practice of tranquil refinement admits no interruption, even for a moment. Henceforth, all wandering and disorderly persons are strictly forbidden from causing disturbances, disrupting their quiet cultivation, or obstructing their pursuit of the Dao. Violators shall be severely punished. However, those of utmost sincerity who aspire to tread the mysterious threshold, seeking to transcend the mortal realm and earnestly inquire into the truth of the Dao, shall not be subject to this prohibition. Should any Daoist neglect the fundamental teachings, stir up trouble, harm the community, or corrupt the ancestral traditions, they shall be reprimanded and expelled from the mountain at once for minor offenses. For grave transgressions, a full report shall be submitted for imperial review and severe punishment.\n\n**Dated the eighteenth day of the tenth month in the eleventh year of the Yongle reign.**\n\n**Imperial Commission:**\nTo Zhang Yuqing, Orthodox Successor of the Zhengyi Lineage and Perfected Master:\nMount Wudang is a renowned mountain under Heaven, the sacred site where the Perfected Warrior attained the Dao and manifested his numinous responses. At the end of the Yuan dynasty, its palaces and temples were all destroyed by war, leaving those who cultivate the Dao—feathered immortals and reclusive scholars—without a place of refuge. With profound sincerity, We commanded the construction of these palaces and temples, above to offer prayers for the spirits of Our late father and mother in Heaven, and below to beseech blessings for all living beings under Heaven. May the rains and sunshine arrive in due season, calamities and pestilence be averted, the harvests be abundant, and every household and person be provided for.\n\nNow that the palaces and temples are completed, the deities have repeatedly displayed wondrous signs: radiant halos blazing in five resplendent colors, divine images manifesting within the light. Tens of thousands of onlookers have witnessed this and marveled. We have bestowed the following names: **Palace of the Mysterious Heaven and Jade Void**, **Palace of the Supreme Mystery and Purple Empyrean**, **Palace of the Five Dragons of Ascendant Sagehood**, and **Palace of the Great Sage and Southern Cliff**.\n\nYet such a sacred mountain and sublime site must have eminent Daoist masters to reside in and oversee it. For the **Palace of the Great Sage and Southern Cliff**, We have already appointed Sun Biyun of the Right Zhengyi Lineage as its abbot. For the remaining three sites, you shall select two practitioners of profound attainment for each to serve as abbots. Additionally, choose fifty devout and reverent Daoists for each site to act as guardians. If the full number cannot be selected at once, dispatch those you have chosen to the four sites to serve as guardians, diligently cultivating and advancing the Daoist teachings.\n\n**Dated the twenty-fifth day of the eighth month in the eleventh year of the Yongle reign.**\n\n**Imperial Commission:**\nTo Zhang Xin, Marquis of Longping, and Mu Xin, Imperial Son-in-Law and Commander of the Capital Garrison:\nThe Orthodox Successor of the Zhengyi Lineage, Perfected Master Zhang Yuqing, has recommended and assigned Daoist officials and priests to their respective posts. The appointments are as follows:\n\nFor the **Palace of the Mysterious Heaven and Jade Void**:\n- Ren Ziyuan, Daoist Official, as *Tidian* (Supervisor)\n- Zhou Weizhong, Perfected Master, concurrently as *Tidian*\n- Lin Ziliang as Vice-Palace Overseer\n\nFor the **Palace of the Five Dragons of Ascendant Sagehood**:\n- Li Shizhong as Abbot\n- Wu Jizu as *Tidian*\n\nFor the **Palace of the Supreme Mystery and Purple Empyrean**:\n- Li Youran and Hu Guyai as *Tidian*\n\nFor the **Palace of the Great Sage and Southern Cliff**:\n- Sun Biyun of the Right Zhengyi Lineage as Abbot\n- Wang Yizhong as *Tidian* to assist him\n\nThe names of these palaces shall remain as hereby decreed. You are to take note and act accordingly.\n\nOn the eleventh day of the ninth month in the eleventh year of the Yongle reign.\n\nA decree to Li Suxi, Quanzhen Daoist of the Five Dragons Palace:\n\nIn ancient times, Perfected Beings studied the Dao upon the renowned mountains of Wudang. Breaking a plum branch, they grafted it onto a *chang* tree, and prayed: \"When the Dao is achieved, this branch shall live, blossom, and bear ripe fruit.\" Later, it came to pass as they had spoken. Thereafter, it served to foretell the year’s abundance or scarcity. In times of peace, the flowers and fruits flourished in abundance. In years of scarcity, the flowers bloomed but bore no fruit.\n\nToday, the tree still stands. Inquiring of the elders, for a long time it has borne neither flowers nor fruit. Recently, you, Suxi, sent several hundred of its fruits to be presented, a truly rare occurrence. Could it be that your utmost sincerity has moved the Perfected Beings to bestow this auspicious sign, foretelling the nation’s prosperity?\n\nHereby, the Daoist Wan Daoyuan is specially dispatched, bearing incense to the Perfected Beings’ sacred precinct, where he shall burn offerings in gratitude for the divine favor. Additionally, one bolt of silk brocade, one set of multicolored silk robes, and forty ingots of paper money are bestowed upon you. You are to devote yourself wholeheartedly to praying for abundant blessings.\n\nDecreed on the nineteenth day of the sixth month in the third year of the Yongle reign.\n\nA decree to Quanzhen Daoist Li Suxi of the Five Dragons Palace:\n\nLast year, the Perfected Beings manifested their auspicious signs, and the winter plum bore fruit, already foretelling a bountiful harvest. You sent envoys to present the fruits, and this year it has occurred again—truly a rarity. Consulting ancient records, such an event might be witnessed once, and even then considered a rare encounter. Yet in these two years, its fruits have appeared twice, all due to the Perfected Beings’ protection of the nation and the sincere prayers of your cohort.\n\nHereby, Daoist Chen Yongfu is specially dispatched, bearing incense to the Perfected Beings’ sacred precinct to express gratitude to the divine spirits. Additionally, one bolt of silk brocade, one set of multicolored silk robes, and forty ingots of paper money are bestowed upon you. You should redouble your devotion and diligence to attain the supreme Dao.\n\nDecreed on the fifth day of the seventh month in the fourth year of the Yongle reign.\n\n---\n\n**Yellow Placard of Glorious Splendor**\n\n**Yellow Placard of Glorious Splendor**\n\nDuring the reign of our dynasty, the Noble Marquis of Prosperous Peace, Zhang Xin, and the Imperial Son-in-Law and Commander of the Capital Garrison, Mu Xin, led over two hundred thousand soldiers and laborers to construct the palaces and temples on Mount Wudang. The imperial edict was detailed and clearly recorded on the yellow placard.\n\nIn the autumn of the tenth year of Yongle, on an auspicious day in the ninth month, construction commenced. The yellow placard was first posted at the crossroads before the Jade Void Palace of the Dark Heaven, sheltered by a towering pavilion and protected by carved railings. Its vermilion lacquer gleamed brilliantly, illuminating the mountain forests, so that all officials, soldiers, and commoners passing beneath the pavilion could not but bow in reverence. Upon reading the imperial proclamation, they understood that the grandeur of this construction arose from the Emperor’s sincere heart, expressly to manifest and repay the Perfected Beings’ evident blessings upon the nation.\n\nAbove, it offered reverence to the celestial spirits of the late Emperor Taizu and Empress Xiaoci; below, it prayed for the well-being of all living beings. How weighty and great is this endeavor!\n\nThereupon, the people of the prefecture, supporting the elderly and carrying the young, gathered in awe to witness the spectacle. The streets and roads were filled to overflowing, and the news spread far and wide. Even those dwelling in the deepest mountains and remotest valleys, along with Daoists and Buddhists, all hastened to behold it. The elders could not but sigh in amazement, declaring they had never seen its like in their lifetimes.\n\nThereafter, the pavilion was often graced with radiant light illuminating the heavens, auspicious clouds swirling about, rosy hues intertwining, and rare birds and immortal cranes flying, calling, and alighting. The Marquis, the Imperial Son-in-Law, and all from officials to commoners rejoiced together, saying: \"No construction of palaces and temples in past dynasties has equaled the splendor of this day. It is fitting that heaven and humanity respond in harmony. Such auspicious signs truly mark the prosperity of our sagely dynasty and the omen of eternal peace.\"\n\nThus, the event was faithfully depicted and transcribed, along with the exhortation, upon the pavilion, so that for ten thousand generations to come, all may know what to revere.\n\n---\n\n**Black Clouds and Divine Response**\n\n**Black Clouds and Divine Response**\n\nWhen our dynasty constructed the palaces and temples on Mount Wudang, the Emperor composed a sacrificial text and dispatched the Noble Marquis of Prosperous Peace, Zhang Xin, and the Imperial Son-in-Law and Commander of the Capital Garrison, Mu Xin, to solemnly announce the undertaking to the Divine Warrior of the Northern Culmen. Their reverence and solemnity were thus.\n\nSince receiving the imperial command, the Marquis and his retinue had been diligent day and night. In the autumn of the tenth year of Yongle, they arrived at Mount Wudang. On the eighteenth day of the ninth month, an auspicious day, they performed the ritual announcement.\n\nThe night before, the Marquis and the Imperial Son-in-Law, along with all officials, fasted and purified themselves, lodging at the Jade Void Palace of the Dark Heaven. On the appointed day, the ritual arrangements were set before the foundation of the main hall. The Marquis and his retinue entered with reverence and awe to commence the rites.\n\nAt that moment, heaven and earth were bright and clear, the moon and stars shining brilliantly. Suddenly, a black cloud arose from the northwest, large as a chariot wheel, hovering over the mountain peak at a distance of about ten feet. It seemed to rise and fall, advance and retreat, coiling and swirling, its transformations swift and unpredictable. Within it, faint rumblings of thunder and lightning could be discerned, and the glimmer of banners and pennants appeared.\n\nAfter a long while, it remained motionless. The divine presence loomed majestically above, witnessing the rite. Upon its conclusion, the cloud vanished in an instant, the four directions clear and still, leaving no trace of sound.\n\nAll who witnessed the event were filled with awe and reverence, declaring that this was surely due to the Emperor’s sincere devotion in erecting temples to repay the gods, and to the fear and obedience with which high and low officials carried out their duties. Thus, on the day of the sacrificial announcement, the Perfected Beings manifested this divine response.\n\nThe event was respectfully recorded in detail.\n\n---\n\n**Auspicious Omen in the Withered Grove**\n\nThe world has long held that the leaves of the *qian* trees on Mount Wudang possess the power to cure all manner of illnesses. Since ancient times, people have revered them, though none had ever obtained them. In the autumn of the tenth year of the Yongle reign, the imperial court commanded Marquis Longping Zhang Xin and Imperial Son-in-Law Mu Xin to oversee the construction of official Daoist temples.\n\nThe following year, as the breath of spring first stirred and grasses and trees began to revive, atop Heavenly Pillar Peak there stood a single *qian* tree, its tender shoots flourishing, its delicate leaves spreading in profusion. Its jade-like radiance and luminous hues clung to the cliffs and pressed against the rocks, its pure fragrance wafting forth, distinct from all other blossoms. Thus, it was enclosed with carved railings, and strict prohibitions were set against any disrespect.\n\nWithin ten days, suddenly at Jade Void, Southern Cliff, Purple Cloud, and the Five Dragons peaks, hundreds more *qian* trees appeared. All flourished beneath the auspicious clouds and radiant sun, thriving amid the gentle winds and sweet rains. Their lush canopies cast deep shade, blanketing the valleys in emerald. The local inhabitants who beheld this sight could not but marvel and exclaim in wonder, deeming it an unprecedented spectacle. Word spread to the four directions, and people hastened to witness it for themselves.\n\nAs the immortal blossoms vied in splendor, a crimson glow suffused the grove. The lingering rosy clouds caught the sunlight, dazzling the eyes. Rare birds with iridescent plumage alighted upon the branches, their clear, melodious songs filling the air day and night without cease. Those who beheld it were moved to even greater reverence.\n\nBy then, the green leaves had unfurled in perfect order, their rich fragrance thick and sweet. The Marquis and the Imperial Son-in-Law remarked to one another: \"The leaves of the *qian* tree are especially renowned for healing ailments, as has been said since antiquity. Moreover, this year’s trees have sprouted in such abundance—could this not be the manifest work of celestial truth, revealing their divine power? With care, we shall gather them and present them to the court, appending this account to the *Records of the Manifestation of the Sage*, that their marvel may be proclaimed.\"\n\n*Fragrant Plum Presages Auspiciousness*\n*Fragrant Plum Presages Auspiciousness*\n\nAt the Five Dragons Palace of Mount Wudang stood a *fragrant plum*, said to have originated when a perfected adept in cultivation broke off a plum branch and placed it upon a *qian* tree, lifting his gaze to heaven and vowing: \"If my Dao is fulfilled, let flowers bloom and fruit bear forth.\" Later, as he had foretold, the tree flourished—an event recorded in detail by the former Master Dong.\n\nIn the autumn of the tenth year of the Yongle reign of the present dynasty, by imperial command, the Marquis of Longping, Zhang Xin, and the Imperial Son-in-Law and Commandant-escort, Mu Xin, were dispatched to construct the palaces and temples of Mount Wudang. In the spring of the eleventh year, the *fragrant plum* burst into bloom, its blossoms red and white, their subtle fragrance and sparse shadows wafting far and wide. By the fifth month, fruit had formed, its pearls scattered in profusion, their emerald hues shimmering in radiant splendor, each branch laden with countless gems. As the lingering mist caught the sunlight, their colors dazzled the eye, and all who beheld them marveled, exclaiming: \"This fruit, tended by the immortal overseers of the Bureau of Celestial Visits since ancient times, has never borne so abundantly as now. This is surely the response to our August Emperor’s utmost sincerity, for even the immortal *fragrant plum* has manifested its auspicious signs.\" The Marquis and the Imperial Son-in-Law gathered the fruit and presented it to the court, that its numinous wonder might be proclaimed. The event was duly recorded, that all who read of it might know what to revere and trust.\n\nThe Divine Left a Mighty Tree\n\nIn our dynasty, by imperial decree, the Marquis of Longping, Zhang Xin, and the Imperial Son-in-Law and Commandant Escort, Mu Xin, were charged with constructing the palaces and temples of Wudang. Over one hundred thousand logs were procured, all transported from the Han River’s banks at Hankou, straight to Junyang, with fortresses established along the route to coordinate the conveyance.\n\nOn the tenth day of the eleventh month in the tenth year of the Yongle reign, Guo Jin, Vice Minister of Works, together with Zhuge Ping, Director in the Ministry of Rites, oversaw the transport of the timber. Passing through Wuchang, they saw a single great log standing in the waters before Yellow Crane Tower. Only a foot of it emerged above the surface, like a stone pillar. Though buffeted day and night by the rushing torrent, it stood firm without human aid, unwavering. They measured the water’s depth at fifty-five feet, yet the log was only forty feet long, leaving its base suspended in the void—all who saw it marveled. When they lashed it to a boat, it followed effortlessly to the shore, as though the divine had preserved it for some great purpose. They then ordered it escorted to the mountain, and all along the river, soldiers and commoners who witnessed it gasped in awe, deeming it a numinous wonder.\n\nThe Marquis and the Imperial Son-in-Law arranged a ceremonial procession with drums and winds to welcome it, delivering it to the Jade Void Palace of the Dark Heaven. They further reported the matter to the court, proposing it as the central beam of the main hall, that it might be gazed upon by ten thousand generations. The event was illustrated and appended to the *Records of the Awakening of the Sage*.\n\nThe Waters Bore a Great Bell\n\nBy imperial edict of the present dynasty, the Marquis of Longping, Zhang Xin, and the Imperial Son-in-Law and Commander of the Capital Garrison, Mu Xin, were charged with the construction of the palaces and temples on Mount Wudang.\n\nOn the evening of the sixteenth day of the fifth month in the eleventh year of the Yongle reign, Liu Zhong and others, commoners of Xiangtan County, were sailing their boat to Yangbo Shoals in Guanghua County when suddenly a black gale arose, thunder and rain clashing together, forcing their vessel to halt and drift to the shore. In an instant, the wind ceased, and a great bell emerged from the waters, its form towering and vast. Thereupon, all aboard joined in prayer, saying: \"We wish to carry this to the palaces and temples of Mount Wudang, that the numinous might be made manifest. Grant us an auspicious omen.\" No sooner had they spoken than their wish was fulfilled. They loaded the bell and set forth, the wind gentle and the waves calm, arriving in Junzhou after two days and nights.\n\nAt that time, the Marquis of Longping and the Imperial Son-in-Law, hearing the news, rejoiced and said: \"This bell has long been submerged. That it should rise from the waters on the very day Mount Wudang’s temples are to flourish—could this not be the work of unseen spirits aiding us? It shall herald the mountain’s grandeur and stand as a sign of divine wonder for ten thousand generations.\" Thereupon, they arranged a ceremonial procession with drums and winds to welcome it, delivering it to the Jade Void Palace of the Dark Heaven, where it would be enshrined for perpetual morning and evening offerings. They further recorded the event, that it might be transmitted through the ages without end.\n\nBy imperial edict of the present dynasty, the construction of the palaces and temples on Mount Wudang was commanded, with the Marquis of Longping, Zhang Xin, and the Imperial Son-in-Law and Commander of the Capital Garrison, Mu Xin, overseeing the project.\n\nOn the twenty-fifth day of the fifth month in the eleventh year of the Yongle reign, repairs were underway on the Bronze Hall atop the Great Summit. That day, a circular radiance appeared from beneath the ravine’s spring, ascending through the void. Five colors blazed resplendently, illuminating the mountain valleys. Within the light, the image of a celestial sage manifested—clad in a black robe, hair unbound, standing with auspicious clouds swirling below in protection.\n\nOn the twenty-fifth day of the fifth month in the eleventh year of the Yongle reign, the sage’s image reappeared within the radiance before the Great Summit, seated with unbound hair. Two celestial deities stood in attendance on either side, as though engaged in conversation. Two more deities stood before them, with auspicious clouds swirling below in protection.\n\nOn the twenty-sixth day of the fifth month in the eleventh year of the Yongle reign, the Heavenly Pillar Peak of the Great Summit saw the circular radiance appear once more. Within the light, the sage’s image manifested again, with two celestial deities standing behind, and white clouds swirling below in protection.\n\nOn the twenty-first day of the sixth month in the eleventh year of the Yongle reign, the Purple Cloud Palace’s blessed grounds were being repaired. That day, a five-colored circular radiance appeared before the palace. Within it, the sage’s image was seen seated, a morning banner fluttering to the left amid the evening mist, held by a celestial general. To the right stood another general, bearing a sword. Below, white clouds swirled in protection, and within them, a tortoise and serpent coiled together. For a long while, the vision endured, and from that time onward, manifestations of the divine were without end.\n\nAmidst the mountains, over two hundred thousand officials, soldiers, and common folk gazed upon this auspicious sign, none failing to rise in reverence. All rejoiced and exulted, congratulating one another, saying: \"This is all due to His Majesty’s sincere heart, which has moved the celestial perfected to manifest their response, thus bestowing this felicitous omen. Since the dawn of humanity, there has been no grandeur to match the present day—truly a portent of eternal peace for the nation and a blessing for all under heaven.\" Accordingly, the events were faithfully depicted in sequence as above.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, the painting of the Great Summit Hall was completed. That day, dark clouds enveloped a five-colored circular radiance, within which the sage’s image appeared, flanked by two celestial deities in attendance.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, within the radiance before the Great Summit, the sage’s image manifested again, clad in a black robe with sleeves billowing as if stirred by the wind. Before him stood a deity bearing a sword to lead the way, while another followed in attendance.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, the sage’s image appeared a third time within the radiance, preceded by a deity leading the way and followed by another bearing an imperial seal in attendance.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, the sage’s image manifested a fourth time within the radiance, with a deity bearing a sword leading before him and another holding a black banner following behind.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, the sage’s image appeared a fifth time within the radiance, seated upon dark clouds, with two celestial deities standing in attendance on either side.\n\nOn the nineteenth day of the eighth month in the eleventh year of the Yongle reign, the hall’s construction was completed. That day, a five-colored circular radiance appeared, within which the image of the celestial perfected sage manifested, enveloped below by dark clouds in protection.\n\nOn the nineteenth day of the eighth month in the eleventh year of the Yongle reign, the sage’s image appeared once more within the radiance, with a deity in attendance behind.\n\n*The Illustrated Record of the Manifest Responses of the Mysterious Heavenly Thearch of the Great Ming* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大明玄天上帝瑞应图录 书名：大明玄天上帝瑞应图录。 撰人不详。 一卷。 底本出处：《正统道藏》洞神部记传类。 大明玄天上帝瑞应图录 御制大岳太和山道宫之碑 盖闻大而无迹，之谓圣。 充周无穷，妙不可测，之谓神。 是故行乎天地，统乎阴阳，出有入无，恍惚翕张，骖日驭月，鼓风驾霆，倏而为雨，忽而为云，御灾捍患，驱沙致祥，调运四时，橐钥万汇，陶铸群品，以成化工者，若极玄天上帝真武之神是已。 按道书，神本先天始黑五灵玄老太阴天乙之化，生而神灵，聪以知远，明以察微，潜心念道，志契太虚。 乃入武当山，修真内炼，心一志凝，遂感玉清元君，授以无极上道。 功满道备，乘龙天飞，归根复位。 显名亿劫，与天地悠久，日月齐并。 武当旧名太和，谓非玄武，不足以当之，故名曰武当。 蟠踞八百余里，高列七十二峰，三十六岩之奇峭，二十四涧之幽邃。 峰之最高，日天柱。 境之最胜，日紫霄。 南岩上出游氛，下临绝壑，跨洞天之清虚，凌福地之深官。 紫霄、南岩皆有宫，又自南岩北下三十里，有五龙宫。 又四十里，抵山趾，有真庆宫，俱为祀神祝厘之所，元末，悉毁于兵窦。 荆榛瓦砾，废而不举。 天启我国家隆盛之基，朕皇考太祖高皇帝，以一旅定天下，神阴翊显佑，灵明赫奕。 肆朕起义兵，靖内难，神辅相左右，风行霆击，其迹甚着。 暨即位之初，茂锡景既，益加炫惧。 至若榔梅再实，岁功屡成，嘉生骈臻，灼有异征。 朕夙夜祇念，罔以报神之休。 仰惟皇考、皇妣，劬劳恩深，昊天罔极，亦罔以尽其报。 惟武当神之攸栖，肃命臣工，即五龙之束数十里，得胜地焉，创建玄天玉虚宫。 於紫霄南岩五龙，创建太玄紫霄宫，大圣南岩宫，兴圣五龙宫。 又即天柱之顶，冶铜为殿，饰以黄金，范神之像，享杞无极。 神宫仙馆，焕然维新。 经营之始，至於告成之日，神屡显像，祥光烛霄，山峰腾辉，草木增色，灵氛聚散，变化万状。 众目咸睹，腮拜惜暗。 榔梅垂实，加前数倍。",
      "translated_text": "**The *Illustrated Record of Auspicious Responses of the Great Ming’s Dark Heaven Supreme Emperor***\n\n**Title:** *Illustrated Record of Auspicious Responses of the Great Ming’s Dark Heaven Supreme Emperor*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section of the *Dongshen* Department\n\n---\n\n**Imperial Stele for the Daoist Palace of Mount Taihe in the Great Peaks**\n\nIt is said that the boundless without trace is called sageliness; the inexhaustible and unfathomably subtle is called divinity. Thus, one who moves through heaven and earth, governs yin and yang, emerges from being and enters non-being, expands and contracts in the indistinct, rides the sun and drives the moon, drums the winds and harnesses thunder, now as rain, now as clouds—warding off calamities, repelling misfortunes, driving away sandstorms to summon blessings, regulating the four seasons, controlling the myriad things as if with bellows, and shaping all beings to perfect the work of transformation—is none other than the Dark Heaven Supreme Emperor, the Perfected Martial Deity.\n\nAccording to Daoist scriptures, the deity originally arose from the *Xianhe* (\"Black Five Spirits\") of primordial chaos, the transformation of the Great Yin Celestial One. Born with divine intelligence, perceptive of the distant and discerning of the minute, he concealed his heart in devotion to the Dao, his aspirations attuned to the Great Void. He entered Mount Wudang to cultivate inner refinement, his mind unified and will concentrated. Thereupon, the Jade Pure Primordial Lady bestowed upon him the Supreme Dao of the Limitless. When his merit was complete and his Dao perfected, he ascended to heaven on a dragon, returning to his root and resuming his position. His illustrious name endures through kalpas, as eternal as heaven and earth, as enduring as the sun and moon.\n\nWudang was formerly called Taihe (\"Great Harmony\"), but it was deemed that only the Dark Warrior (Xuanwu) could befit such a name, hence it was renamed Wudang (\"Martial Ascendancy\"). The mountain sprawls over eight hundred *li*, crowned by seventy-two peaks, thirty-six precipitous cliffs, and twenty-four secluded ravines. The loftiest peak is called Heavenly Pillar. The most sublime site is Purple Empyrean. At South Cliff, the ethereal vapors rise above while sheer chasms yawn below, spanning the purity of the grotto-heaven and towering over the profound palaces of the blessed land. Purple Empyrean and South Cliff each have their palaces. From South Cliff, thirty *li* north lies the Five Dragons Palace. Another forty *li* brings one to the foot of the mountain, where the True Celebration Palace stands. All were sites for offering sacrifices and praying for blessings, but by the end of the Yuan dynasty, they were destroyed by war and lay in ruins—overgrown with brambles, reduced to rubble, abandoned and unvisited.\n\nHeaven ordained the flourishing foundation of our dynasty. My late imperial father, the Grand Progenitor Gao Emperor, pacified the realm with a single army, and the deity secretly and openly assisted him, his numinous radiance resplendent. When I raised righteous troops to quell internal strife, the deity aided me at every turn—winds sweeping, thunder striking—his traces manifest. Since my ascension to the throne, abundant blessings have been bestowed, and my reverence has only deepened. Such wonders as the pomegranate and plum bearing fruit again, the harvests succeeding year after year, and auspicious omens proliferating have been unmistakable signs. Day and night, I have pondered how to repay the deity’s grace.\n\nMoreover, the toils of my late imperial father and mother, their boundless kindness like the vast heavens, are beyond full recompense. Considering the abode of the Wudang deity, I solemnly commanded my ministers to seek an auspicious site within several dozen *li* of the Five Dragons’ convergence. There, the Jade Void Palace of the Dark Heaven was constructed. At Purple Empyrean, South Cliff, and the Five Dragons, the Supreme Purple Empyrean Palace, the Great Sage South Cliff Palace, and the Prosperous Sage Five Dragons Palace were built. Atop Heavenly Pillar Peak, a bronze hall was cast, gilded with gold, and the deity’s image was sculpted to receive eternal offerings. The divine palaces and immortal abodes were resplendently renewed.\n\nFrom the inception of the project to its completion, the deity repeatedly manifested his presence: auspicious lights illuminated the heavens, mountain peaks glowed, grasses and trees took on richer hues, and numinous vapors gathered and dispersed in myriad transformations. All who witnessed these wonders bowed in awe and reverence. The pomegranate and plum bore fruit in even greater abundance than before.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 766,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.6805202960968,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "九地启秘，金杵跃出。 阴阳储精，玄质流润。 灵异纷员，莫能婵纪。 神之响应，有如此者。 遂命道士为提点，主管各宫，饬严祀事，昭答神肌。 上以资荐扬皇考太祖高皇帝、皇妣孝慈高皇后在天之灵，下以为天下臣庶祈近繁祉。 虽然神之浮游混茫，变化无方，此感彼应，无往不之，然非此无以达朕之诚，与系天下虔敬之心也。 又配山川冲和之气融结於斯，与神相为表裹，神之陆降，往来飘讽挥霍，顾瞻旧游，岂不徘徊於斯者乎，则是宫观之建，有不可无。 谨书为文，刻碑山中。 以彰神功，永永无穷焉。",
      "translated_text": "The Nine Lands revealed their secrets, and a golden pestle leapt forth. Yin and yang stored their essence, while the mysterious substance flowed and glistened. Wondrous signs multiplied beyond enumeration, defying all record. Such were the responses of the deity.\n\nThereupon, Daoist priests were appointed as superintendents to oversee each palace, ensuring the rites were conducted with solemnity, that the divine grace might be fittingly requited. Above, this was to honor and invoke the celestial spirits of the imperial father, the Grand Ancestor Emperor Taizu, and the imperial mother, the Filial and Compassionate Grand Empress Xiaoci; below, it was to pray for blessings near and far for all ministers and commoners. Though the deity roams the boundless, transforming without fixed form—responding here to a stimulus there, present wherever it turns—without this, how could Our sincerity be conveyed, or the reverent hearts of all under Heaven be bound together?\n\nMoreover, the harmonious qi of mountains and rivers converges here, intertwining with the deity as inner and outer. When the deity descends or ascends, drifting and soaring in radiant freedom, casting its gaze upon familiar haunts, would it not linger here? Thus, the construction of these palaces and temples was not to be done without.\n\nWith due reverence, this text is inscribed and carved upon the mountain’s stele, to proclaim the divine merit for all eternity.",
      "overlap_context": "eive eternal offerings. The divine palaces and immortal abodes were resplendently renewed.\n\nFrom the inception of the project to its completion, the deity repeatedly manifested his presence: auspicious lights illuminated the heavens, mountain peaks glowed, grasses and trees took on richer hues, and numinous vapors gathered and dispersed in myriad transformations. All who witnessed these wonders bowed in awe and reverence. The pomegranate and plum bore fruit in even greater abundance than before.",
      "start_char": 766,
      "end_char": 989,
      "start_sentence": 35,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.765433073043823,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "永乐十六年十二月初三日。 圣旨 大岳太和山各宫观，有修炼之士，怡神葆真，抱一守素。 外远身形，屏绝人事。 习静之功，顷刻无问。 一应往来浮浪之人，并不许生事喧聒，扰其静功，妨其办道，违者，治以重罪。 有至诚之士，慕蹑玄关，思超凡质，实心参真问道者，不在禁例。 若道士有不务本教，生事害群，伤坏祖风者，轻则即时谴责，逐出下山。 重则具奏来闻，治以重罪。 永乐十一年十月十八日。 勑 勑正一嗣教真人张宇清：武当天下名山，真武成道灵应感化之地。 元末，宫观悉毁于兵，遂使羽人逸士修炼学道者，无所依仰。 朕积诚于中，命创建宫观，上以资荐皇考、皇妣在天之灵，下为天下生灵祈福。 俾雨旸时若，灾沴不生。 年谷丰登，家给人足。 今宫观告成，神明屡显休应，圆光煜＇灿，五色灿烂。 神像昭彰，见于光内。 观者数十万人，咸加叹异。 已赐名日玄天玉虚宫。 太玄紫霄宫。 兴圣五龙宫。 大圣南岩宫。 然此名山胜境，必得高人羽士，以住持看守。 大圣南岩宫，已尝令右正一孙碧云为住持外，其三处，尔即选有道行者，各二人为住持。 别选至诚敬谨道士，每处各五十人看守。 如一时选拣不如数，随尔所选得若干人，就分派四处看守，精进修行，兴隆道教。 故勑。 永乐十一年八月二十五日。 勑隆平侯张信、驸马都尉沐昕等：今正一嗣教真人张宇清，举保道士，分派各官。 道官任自垣，道士邵庆芳，为玄天玉虚官提点。 高道周惟中，兼提点，林子良为副宫。 兴圣五龙宫，以李时中为住持，道士昊继祖为提点。 太玄紫霄宫，以李幽岩、胡古崖为提点。 大圣南岩宫，已命右正一孙碧云住持，以王一中为提点副之。 各处宫名，只依此劫为定，用报汝知之。 故勑。",
      "translated_text": "On the third day of the twelfth month in the sixteenth year of the Yongle reign.\n\n**Imperial Edict:**\nAt the various palaces and temples of the Great Peak, Mount Taihe, those who cultivate the Dao—nurturing the spirit and preserving their true nature, embracing the One and guarding simplicity—distance themselves from worldly forms and sever all mundane affairs. Their practice of tranquil refinement admits no interruption, even for a moment. Henceforth, all wandering and disorderly persons are strictly forbidden from causing disturbances, disrupting their quiet cultivation, or obstructing their pursuit of the Dao. Violators shall be severely punished. However, those of utmost sincerity who aspire to tread the mysterious threshold, seeking to transcend the mortal realm and earnestly inquire into the truth of the Dao, shall not be subject to this prohibition. Should any Daoist neglect the fundamental teachings, stir up trouble, harm the community, or corrupt the ancestral traditions, they shall be reprimanded and expelled from the mountain at once for minor offenses. For grave transgressions, a full report shall be submitted for imperial review and severe punishment.\n\n**Dated the eighteenth day of the tenth month in the eleventh year of the Yongle reign.**\n\n**Imperial Commission:**\nTo Zhang Yuqing, Orthodox Successor of the Zhengyi Lineage and Perfected Master:\nMount Wudang is a renowned mountain under Heaven, the sacred site where the Perfected Warrior attained the Dao and manifested his numinous responses. At the end of the Yuan dynasty, its palaces and temples were all destroyed by war, leaving those who cultivate the Dao—feathered immortals and reclusive scholars—without a place of refuge. With profound sincerity, We commanded the construction of these palaces and temples, above to offer prayers for the spirits of Our late father and mother in Heaven, and below to beseech blessings for all living beings under Heaven. May the rains and sunshine arrive in due season, calamities and pestilence be averted, the harvests be abundant, and every household and person be provided for.\n\nNow that the palaces and temples are completed, the deities have repeatedly displayed wondrous signs: radiant halos blazing in five resplendent colors, divine images manifesting within the light. Tens of thousands of onlookers have witnessed this and marveled. We have bestowed the following names: **Palace of the Mysterious Heaven and Jade Void**, **Palace of the Supreme Mystery and Purple Empyrean**, **Palace of the Five Dragons of Ascendant Sagehood**, and **Palace of the Great Sage and Southern Cliff**.\n\nYet such a sacred mountain and sublime site must have eminent Daoist masters to reside in and oversee it. For the **Palace of the Great Sage and Southern Cliff**, We have already appointed Sun Biyun of the Right Zhengyi Lineage as its abbot. For the remaining three sites, you shall select two practitioners of profound attainment for each to serve as abbots. Additionally, choose fifty devout and reverent Daoists for each site to act as guardians. If the full number cannot be selected at once, dispatch those you have chosen to the four sites to serve as guardians, diligently cultivating and advancing the Daoist teachings.\n\n**Dated the twenty-fifth day of the eighth month in the eleventh year of the Yongle reign.**\n\n**Imperial Commission:**\nTo Zhang Xin, Marquis of Longping, and Mu Xin, Imperial Son-in-Law and Commander of the Capital Garrison:\nThe Orthodox Successor of the Zhengyi Lineage, Perfected Master Zhang Yuqing, has recommended and assigned Daoist officials and priests to their respective posts. The appointments are as follows:\n\nFor the **Palace of the Mysterious Heaven and Jade Void**:\n- Ren Ziyuan, Daoist Official, as *Tidian* (Supervisor)\n- Zhou Weizhong, Perfected Master, concurrently as *Tidian*\n- Lin Ziliang as Vice-Palace Overseer\n\nFor the **Palace of the Five Dragons of Ascendant Sagehood**:\n- Li Shizhong as Abbot\n- Wu Jizu as *Tidian*\n\nFor the **Palace of the Supreme Mystery and Purple Empyrean**:\n- Li Youran and Hu Guyai as *Tidian*\n\nFor the **Palace of the Great Sage and Southern Cliff**:\n- Sun Biyun of the Right Zhengyi Lineage as Abbot\n- Wang Yizhong as *Tidian* to assist him\n\nThe names of these palaces shall remain as hereby decreed. You are to take note and act accordingly.",
      "overlap_context": " under Heaven be bound together?\n\nMoreover, the harmonious qi of mountains and rivers converges here, intertwining with the deity as inner and outer. When the deity descends or ascends, drifting and soaring in radiant freedom, casting its gaze upon familiar haunts, would it not linger here? Thus, the construction of these palaces and temples was not to be done without.\n\nWith due reverence, this text is inscribed and carved upon the mountain’s stele, to proclaim the divine merit for all eternity.",
      "start_char": 990,
      "end_char": 1669,
      "start_sentence": 45,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.009766101837158,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "永乐十一年九月十一日。 勑五龙宫全真道士李素希：昔者，高真学道於武当名山，折梅枝寄樃树，且祝曰：道成，此枝即活，花实而熟。 后果如其言。 自是，以验岁之丰歉。 太平岁，丰花实而繁。 其遇岁歉，花而不实。 今树尚存，问诸故老，久无花实。 比者，尔素希以实数百，遣人来进，诚为罕得，莫非以尔精诚所格，祝厘国家，故能感动高真降此嘉祥，以兆丰秾也。 兹特遣道士万道远，资香诣高真道场焚炳，以答神既。 并以彩段一，表裹纷丝衣一袭，钞四十锭，赐尔，尔其恪尽乃心，以祈茂祉。 故勑。 永乐三年六月十九日。",
      "translated_text": "On the eleventh day of the ninth month in the eleventh year of the Yongle reign.\n\nA decree to Li Suxi, Quanzhen Daoist of the Five Dragons Palace:\n\nIn ancient times, Perfected Beings studied the Dao upon the renowned mountains of Wudang. Breaking a plum branch, they grafted it onto a *chang* tree, and prayed: \"When the Dao is achieved, this branch shall live, blossom, and bear ripe fruit.\" Later, it came to pass as they had spoken. Thereafter, it served to foretell the year’s abundance or scarcity. In times of peace, the flowers and fruits flourished in abundance. In years of scarcity, the flowers bloomed but bore no fruit.\n\nToday, the tree still stands. Inquiring of the elders, for a long time it has borne neither flowers nor fruit. Recently, you, Suxi, sent several hundred of its fruits to be presented, a truly rare occurrence. Could it be that your utmost sincerity has moved the Perfected Beings to bestow this auspicious sign, foretelling the nation’s prosperity?\n\nHereby, the Daoist Wan Daoyuan is specially dispatched, bearing incense to the Perfected Beings’ sacred precinct, where he shall burn offerings in gratitude for the divine favor. Additionally, one bolt of silk brocade, one set of multicolored silk robes, and forty ingots of paper money are bestowed upon you. You are to devote yourself wholeheartedly to praying for abundant blessings.\n\nDecreed on the nineteenth day of the sixth month in the third year of the Yongle reign.",
      "overlap_context": "n*\n- Lin Ziliang as Vice-Palace Overseer\n\nFor the **Palace of the Five Dragons of Ascendant Sagehood**:\n- Li Shizhong as Abbot\n- Wu Jizu as *Tidian*\n\nFor the **Palace of the Supreme Mystery and Purple Empyrean**:\n- Li Youran and Hu Guyai as *Tidian*\n\nFor the **Palace of the Great Sage and Southern Cliff**:\n- Sun Biyun of the Right Zhengyi Lineage as Abbot\n- Wang Yizhong as *Tidian* to assist him\n\nThe names of these palaces shall remain as hereby decreed. You are to take note and act accordingly.",
      "start_char": 1670,
      "end_char": 1912,
      "start_sentence": 82,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.363645076751709,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "勑五龙宫全真道士李素希：去岁，高真效祥，樃梅成实，已兆岁丰。 尔遣人来进，今岁复然，诚为难得。 稽之於古间，或一见，尤以为希遇。 蚓兹二年，两见其实，皆由高真斓卫国家，尔辈精意祝厘所致。 兹特遣道士陈永富，资香诣高真道场，以答神灵。 并以彩段一，表裹纷丝衣一袭，钞四十锭，赐尔，宜益茂精勤，以臻至道。 故勑。 永乐四年七月初五日。 黄榜荣辉 黄榜荣辉 国朝劫命隆平侯张信、驸马都尉沐昕，统率军夫二十余万，动建武当山宫观。 圣谕详明，具载黄榜。 永乐十年秋九月庚子之吉兴工，首以黄榜揭于玄天玉虚宫前通衢之上，覆以巍亭，护以雕槛，丹漆绚耀，照映山林，使凡官员军民过於亭下，莫不肃敬。 伏睹动谕，则知兴建宫观之盛，发於皇上诚心，特以昭，答神明显佑国家之惠。 上荐太祖高皇帝、孝慈高皇后在天之灵，下为天下生灵祈福，岂不重且大哉。 於是，州之人民，扶老拥幼，骇而聚观。 盈街塞途，传闻四方。 虽探山穷谷之民，以及道释，亦皆相率争睹。 其长老，莫不嗟叹，以为自有生以来，所未尝见。 是后，亭上常有荣光烛天，祥云旋绕，霞彩交辉，珍禽仙鹤，飞鸣翔集。 侯与驸马，下逮士庶，於是咸相庆曰：历代兴建宫观，无若今日之盛，宜其天人协应。 祯祥若此，诚为圣朝之盛事，万世太平之休征。 谨因图其实，并以誊写劝谕於其亭上，使万代之下，咸知有所敬仰云。 黑云买感应 黑云买感应 国朝动建武当山宫观，皇帝御制祭文，遣隆平侯张信、驸马都尉沐昕，昭告于北极真武之神，其恭且严如是。 侯等奉命以来，夙夜惟谨。 永乐十年秋九月至武当，以是月十八日庚子吉，致告将事。 夜侯与驸马，率各官斋被，宿于玄天玉虚宫。 至期，陈设于正殿之基，侯等虔恭肃畏以入即事。 是时，天地开明，月星朗耀。 仰见黑云，自西北起，大如车轮，来覆山巅，相去一丈许，将升将坠，若往若来，盘结旋绕，倏忽之间，变化莫测。 隐隐中，有雷电之震作，旌幢之微露。 久而不动，神灵赫然临之在上，来鉴来故。 祀毕，即忽不见，四气朗清，寂无遗响。 众皆目睹其事，莫不惊异起敬，以谓斯皆皇上兴祠报神发乎诚心，大小之臣，惧听奉命，故祭告之日，感格神明显兹灵应。 敬迹其实，为之记述焉。 骞林应祥 骞林应祥",
      "translated_text": "A decree to Quanzhen Daoist Li Suxi of the Five Dragons Palace:\n\nLast year, the Perfected Beings manifested their auspicious signs, and the winter plum bore fruit, already foretelling a bountiful harvest. You sent envoys to present the fruits, and this year it has occurred again—truly a rarity. Consulting ancient records, such an event might be witnessed once, and even then considered a rare encounter. Yet in these two years, its fruits have appeared twice, all due to the Perfected Beings’ protection of the nation and the sincere prayers of your cohort.\n\nHereby, Daoist Chen Yongfu is specially dispatched, bearing incense to the Perfected Beings’ sacred precinct to express gratitude to the divine spirits. Additionally, one bolt of silk brocade, one set of multicolored silk robes, and forty ingots of paper money are bestowed upon you. You should redouble your devotion and diligence to attain the supreme Dao.\n\nDecreed on the fifth day of the seventh month in the fourth year of the Yongle reign.\n\n---\n\n**Yellow Placard of Glorious Splendor**\n\n**Yellow Placard of Glorious Splendor**\n\nDuring the reign of our dynasty, the Noble Marquis of Prosperous Peace, Zhang Xin, and the Imperial Son-in-Law and Commander of the Capital Garrison, Mu Xin, led over two hundred thousand soldiers and laborers to construct the palaces and temples on Mount Wudang. The imperial edict was detailed and clearly recorded on the yellow placard.\n\nIn the autumn of the tenth year of Yongle, on an auspicious day in the ninth month, construction commenced. The yellow placard was first posted at the crossroads before the Jade Void Palace of the Dark Heaven, sheltered by a towering pavilion and protected by carved railings. Its vermilion lacquer gleamed brilliantly, illuminating the mountain forests, so that all officials, soldiers, and commoners passing beneath the pavilion could not but bow in reverence. Upon reading the imperial proclamation, they understood that the grandeur of this construction arose from the Emperor’s sincere heart, expressly to manifest and repay the Perfected Beings’ evident blessings upon the nation.\n\nAbove, it offered reverence to the celestial spirits of the late Emperor Taizu and Empress Xiaoci; below, it prayed for the well-being of all living beings. How weighty and great is this endeavor!\n\nThereupon, the people of the prefecture, supporting the elderly and carrying the young, gathered in awe to witness the spectacle. The streets and roads were filled to overflowing, and the news spread far and wide. Even those dwelling in the deepest mountains and remotest valleys, along with Daoists and Buddhists, all hastened to behold it. The elders could not but sigh in amazement, declaring they had never seen its like in their lifetimes.\n\nThereafter, the pavilion was often graced with radiant light illuminating the heavens, auspicious clouds swirling about, rosy hues intertwining, and rare birds and immortal cranes flying, calling, and alighting. The Marquis, the Imperial Son-in-Law, and all from officials to commoners rejoiced together, saying: \"No construction of palaces and temples in past dynasties has equaled the splendor of this day. It is fitting that heaven and humanity respond in harmony. Such auspicious signs truly mark the prosperity of our sagely dynasty and the omen of eternal peace.\"\n\nThus, the event was faithfully depicted and transcribed, along with the exhortation, upon the pavilion, so that for ten thousand generations to come, all may know what to revere.\n\n---\n\n**Black Clouds and Divine Response**\n\n**Black Clouds and Divine Response**\n\nWhen our dynasty constructed the palaces and temples on Mount Wudang, the Emperor composed a sacrificial text and dispatched the Noble Marquis of Prosperous Peace, Zhang Xin, and the Imperial Son-in-Law and Commander of the Capital Garrison, Mu Xin, to solemnly announce the undertaking to the Divine Warrior of the Northern Culmen. Their reverence and solemnity were thus.\n\nSince receiving the imperial command, the Marquis and his retinue had been diligent day and night. In the autumn of the tenth year of Yongle, they arrived at Mount Wudang. On the eighteenth day of the ninth month, an auspicious day, they performed the ritual announcement.\n\nThe night before, the Marquis and the Imperial Son-in-Law, along with all officials, fasted and purified themselves, lodging at the Jade Void Palace of the Dark Heaven. On the appointed day, the ritual arrangements were set before the foundation of the main hall. The Marquis and his retinue entered with reverence and awe to commence the rites.\n\nAt that moment, heaven and earth were bright and clear, the moon and stars shining brilliantly. Suddenly, a black cloud arose from the northwest, large as a chariot wheel, hovering over the mountain peak at a distance of about ten feet. It seemed to rise and fall, advance and retreat, coiling and swirling, its transformations swift and unpredictable. Within it, faint rumblings of thunder and lightning could be discerned, and the glimmer of banners and pennants appeared.\n\nAfter a long while, it remained motionless. The divine presence loomed majestically above, witnessing the rite. Upon its conclusion, the cloud vanished in an instant, the four directions clear and still, leaving no trace of sound.\n\nAll who witnessed the event were filled with awe and reverence, declaring that this was surely due to the Emperor’s sincere devotion in erecting temples to repay the gods, and to the fear and obedience with which high and low officials carried out their duties. Thus, on the day of the sacrificial announcement, the Perfected Beings manifested this divine response.\n\nThe event was respectfully recorded in detail.\n\n---\n\n**Auspicious Omen in the Withered Grove**",
      "overlap_context": "he nation’s prosperity?\n\nHereby, the Daoist Wan Daoyuan is specially dispatched, bearing incense to the Perfected Beings’ sacred precinct, where he shall burn offerings in gratitude for the divine favor. Additionally, one bolt of silk brocade, one set of multicolored silk robes, and forty ingots of paper money are bestowed upon you. You are to devote yourself wholeheartedly to praying for abundant blessings.\n\nDecreed on the nineteenth day of the sixth month in the third year of the Yongle reign.",
      "start_char": 1913,
      "end_char": 2810,
      "start_sentence": 94,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.29932403564453,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "世传武当山骞林叶，能愈诸疾。 自昔以来，人皆敬重，未始有得之者。 永乐十年秋，朝廷命隆平侯张信、驸马都尉沐昕，劫建官观。 明年，春气始动，草木将苏，先是天柱峰有骞林树一株，萌芽茁秀，细叶纷披，瑶光玉彩，依岩扑石，清香芬散，异於群卉。 於是护以雕阑，禁毋亵慢。 不旬日间，忽见玉虚南岩紫霄，及五龙等处，忽有骞林树数百余株，悉皆敷荣於祥云丽日之下，畅茂於和风甘雨之问，连阴积翠，蔽覆山谷。 居民见者，莫不惊异嗟叹，以为常所未有。 四方之人闻之，亦竞趁来观。 及其仙葩竞秀，红光满林。 凝霞照日，炫耀人目。 珍禽翠羽，翔集其上。 嘹喨喧啁，昼夜不去。 观者愈起敬焉。 至是，绿叶舒齐，馨香馥郁。 侯与驸马相谓日：骞林叶尤能愈疾，自古云然。 况今年之树，发生繁盛，岂非天真显化，以彰其灵。 谨用采摘，进献於朝。 仍附着启圣录，庶以扬其异焉。 樃梅呈瑞 樃梅呈瑞",
      "translated_text": "The world has long held that the leaves of the *qian* trees on Mount Wudang possess the power to cure all manner of illnesses. Since ancient times, people have revered them, though none had ever obtained them. In the autumn of the tenth year of the Yongle reign, the imperial court commanded Marquis Longping Zhang Xin and Imperial Son-in-Law Mu Xin to oversee the construction of official Daoist temples.\n\nThe following year, as the breath of spring first stirred and grasses and trees began to revive, atop Heavenly Pillar Peak there stood a single *qian* tree, its tender shoots flourishing, its delicate leaves spreading in profusion. Its jade-like radiance and luminous hues clung to the cliffs and pressed against the rocks, its pure fragrance wafting forth, distinct from all other blossoms. Thus, it was enclosed with carved railings, and strict prohibitions were set against any disrespect.\n\nWithin ten days, suddenly at Jade Void, Southern Cliff, Purple Cloud, and the Five Dragons peaks, hundreds more *qian* trees appeared. All flourished beneath the auspicious clouds and radiant sun, thriving amid the gentle winds and sweet rains. Their lush canopies cast deep shade, blanketing the valleys in emerald. The local inhabitants who beheld this sight could not but marvel and exclaim in wonder, deeming it an unprecedented spectacle. Word spread to the four directions, and people hastened to witness it for themselves.\n\nAs the immortal blossoms vied in splendor, a crimson glow suffused the grove. The lingering rosy clouds caught the sunlight, dazzling the eyes. Rare birds with iridescent plumage alighted upon the branches, their clear, melodious songs filling the air day and night without cease. Those who beheld it were moved to even greater reverence.\n\nBy then, the green leaves had unfurled in perfect order, their rich fragrance thick and sweet. The Marquis and the Imperial Son-in-Law remarked to one another: \"The leaves of the *qian* tree are especially renowned for healing ailments, as has been said since antiquity. Moreover, this year’s trees have sprouted in such abundance—could this not be the manifest work of celestial truth, revealing their divine power? With care, we shall gather them and present them to the court, appending this account to the *Records of the Manifestation of the Sage*, that their marvel may be proclaimed.\"\n\n*Fragrant Plum Presages Auspiciousness*\n*Fragrant Plum Presages Auspiciousness*",
      "overlap_context": "and still, leaving no trace of sound.\n\nAll who witnessed the event were filled with awe and reverence, declaring that this was surely due to the Emperor’s sincere devotion in erecting temples to repay the gods, and to the fear and obedience with which high and low officials carried out their duties. Thus, on the day of the sacrificial announcement, the Perfected Beings manifested this divine response.\n\nThe event was respectfully recorded in detail.\n\n---\n\n**Auspicious Omen in the Withered Grove**",
      "start_char": 2810,
      "end_char": 3176,
      "start_sentence": 133,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.86823058128357,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "武当山五龙宫有樃梅，相传云高真修道之时，折梅枝寄樃树上，仰天誓曰：予若道成，花开果结。 后如其言，前董真人记之详矣。 国朝永乐十年秋，劫命隆平侯张信、驸马都尉沐昕，勃建武当山官观。 十一年春，樃梅发花，色敷红白，暗香疏影，远近闻见。 五月果成，珠玑错落，翡翠交辉，景景满枝，莫计其数。 凝霞映日，颜色炫耀，观者嗟异，皆曰：是果也，下有仙访司之，自古及今，结实未有如是之盛，是盖由我皇上至诚感格，故虽樃梅仙果，亦皆显瑞呈祥。 侯与驸马采取，进之於朝，以彰其灵异。 仍着其事，使览者知所敬信焉。",
      "translated_text": "At the Five Dragons Palace of Mount Wudang stood a *fragrant plum*, said to have originated when a perfected adept in cultivation broke off a plum branch and placed it upon a *qian* tree, lifting his gaze to heaven and vowing: \"If my Dao is fulfilled, let flowers bloom and fruit bear forth.\" Later, as he had foretold, the tree flourished—an event recorded in detail by the former Master Dong.\n\nIn the autumn of the tenth year of the Yongle reign of the present dynasty, by imperial command, the Marquis of Longping, Zhang Xin, and the Imperial Son-in-Law and Commandant-escort, Mu Xin, were dispatched to construct the palaces and temples of Mount Wudang. In the spring of the eleventh year, the *fragrant plum* burst into bloom, its blossoms red and white, their subtle fragrance and sparse shadows wafting far and wide. By the fifth month, fruit had formed, its pearls scattered in profusion, their emerald hues shimmering in radiant splendor, each branch laden with countless gems. As the lingering mist caught the sunlight, their colors dazzled the eye, and all who beheld them marveled, exclaiming: \"This fruit, tended by the immortal overseers of the Bureau of Celestial Visits since ancient times, has never borne so abundantly as now. This is surely the response to our August Emperor’s utmost sincerity, for even the immortal *fragrant plum* has manifested its auspicious signs.\" The Marquis and the Imperial Son-in-Law gathered the fruit and presented it to the court, that its numinous wonder might be proclaimed. The event was duly recorded, that all who read of it might know what to revere and trust.",
      "overlap_context": "of the *qian* tree are especially renowned for healing ailments, as has been said since antiquity. Moreover, this year’s trees have sprouted in such abundance—could this not be the manifest work of celestial truth, revealing their divine power? With care, we shall gather them and present them to the court, appending this account to the *Records of the Manifestation of the Sage*, that their marvel may be proclaimed.\"\n\n*Fragrant Plum Presages Auspiciousness*\n*Fragrant Plum Presages Auspiciousness*",
      "start_char": 3176,
      "end_char": 3416,
      "start_sentence": 153,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.466062545776367,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "神留巨木 神留巨木 国朝勑命隆平侯张信、驸马都尉沐昕，勑建武当宫观，材木采买十万有奇，悉自汉口江岸，直抵均阳，置堡协运。 永乐十年十一月初十日，工部侍郎郭进，同吏部郎中诸葛平等，督运木植，经过武昌，见有大木一根，立於黄鹤楼前江水中，上露尺许，若石柱焉。 奔流巨流，昼夜冲激，不假人为，而屹然不动。 随复探视水深，五丈五尺，而木止长四丈，下又虚悬，众皆奇异。 缆击於船，亦不劳力，而随至岸下，岂非神留，以需大用。 遂令护运至山，沿江军民见者，莫不咨嗟起敬，以为灵异。 侯与驸马，於是具鼓吹迎，送玄天玉虚宫。 复上闻於朝，以为正殿之梁，使万代有所瞻仰。 仍图其事，附着于启圣录云。 水涌洪锺 水涌洪锺",
      "translated_text": "The Divine Left a Mighty Tree\n\nIn our dynasty, by imperial decree, the Marquis of Longping, Zhang Xin, and the Imperial Son-in-Law and Commandant Escort, Mu Xin, were charged with constructing the palaces and temples of Wudang. Over one hundred thousand logs were procured, all transported from the Han River’s banks at Hankou, straight to Junyang, with fortresses established along the route to coordinate the conveyance.\n\nOn the tenth day of the eleventh month in the tenth year of the Yongle reign, Guo Jin, Vice Minister of Works, together with Zhuge Ping, Director in the Ministry of Rites, oversaw the transport of the timber. Passing through Wuchang, they saw a single great log standing in the waters before Yellow Crane Tower. Only a foot of it emerged above the surface, like a stone pillar. Though buffeted day and night by the rushing torrent, it stood firm without human aid, unwavering. They measured the water’s depth at fifty-five feet, yet the log was only forty feet long, leaving its base suspended in the void—all who saw it marveled. When they lashed it to a boat, it followed effortlessly to the shore, as though the divine had preserved it for some great purpose. They then ordered it escorted to the mountain, and all along the river, soldiers and commoners who witnessed it gasped in awe, deeming it a numinous wonder.\n\nThe Marquis and the Imperial Son-in-Law arranged a ceremonial procession with drums and winds to welcome it, delivering it to the Jade Void Palace of the Dark Heaven. They further reported the matter to the court, proposing it as the central beam of the main hall, that it might be gazed upon by ten thousand generations. The event was illustrated and appended to the *Records of the Awakening of the Sage*.\n\nThe Waters Bore a Great Bell",
      "overlap_context": "t, tended by the immortal overseers of the Bureau of Celestial Visits since ancient times, has never borne so abundantly as now. This is surely the response to our August Emperor’s utmost sincerity, for even the immortal *fragrant plum* has manifested its auspicious signs.\" The Marquis and the Imperial Son-in-Law gathered the fruit and presented it to the court, that its numinous wonder might be proclaimed. The event was duly recorded, that all who read of it might know what to revere and trust.",
      "start_char": 3417,
      "end_char": 3718,
      "start_sentence": 161,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.375021934509277,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "国朝勑命隆平侯张信、驸马都尉沐昕，勃建武当山宫观。 永乐十一年五月十六日晚，湘潭县民人刘忠等，舟行至光化县洋波滩，忽遇黑风骤至，雷雨交作，舟不得行，吹泊岸下。 须臾风止，见一大锺涌出水上，形制高广。 於是，众皆合词祷曰：忠等将欲载送干武当宫观，以显神灵，愿赐吉卜。 即如所祷，遂载以行，顺风恬波，连两昼夜至均州。 是时，隆平侯与驸马都尉，闻而喜曰：是锺湮没已久，当武当兴观之日，而出於水中，岂非有神明默相之。 将以鸣兹山之盛，为万古灵异之征。 於是具鼓吹迎，送玄天玉虚宫，永奉晨夕香火。 仍为述其事，庶传永世不朽云。 国朝勑建武当山宫观，命隆平侯张信、驸马都尉沐昕总其事。 永乐十一年五月二十有五日，修理大顶铜殿。 是日，圆光现自涧泉之下，乘虚而升，五色灿烂，照耀山谷。 光中复现天真圣像，身衣皂袍，披发而立，下有祥云拥护。 永乐十一年五月二十有五日，光中圣像复现于大顶前，披发而坐，有二天神拱侍左右，若应对之状。 又有二神立於前，下有祥云拥护。 永乐十一年五月二十有六日，大顶天柱峰，圆光再现，光中复有圣像，二天神随立於后，下有白云拥护。 永乐十一年六月二十有一日，紫霄宫修理福地。 是日，官前五色圆光现显，见圣像坐於其中，左建早旗，飞扬晚蔼，有一天将执之。 右一将捧剑而立。 下有白云拥护，云中复见龟蛇盘旋者。 久之，自时厥后，显化无穷。",
      "translated_text": "By imperial edict of the present dynasty, the Marquis of Longping, Zhang Xin, and the Imperial Son-in-Law and Commander of the Capital Garrison, Mu Xin, were charged with the construction of the palaces and temples on Mount Wudang.\n\nOn the evening of the sixteenth day of the fifth month in the eleventh year of the Yongle reign, Liu Zhong and others, commoners of Xiangtan County, were sailing their boat to Yangbo Shoals in Guanghua County when suddenly a black gale arose, thunder and rain clashing together, forcing their vessel to halt and drift to the shore. In an instant, the wind ceased, and a great bell emerged from the waters, its form towering and vast. Thereupon, all aboard joined in prayer, saying: \"We wish to carry this to the palaces and temples of Mount Wudang, that the numinous might be made manifest. Grant us an auspicious omen.\" No sooner had they spoken than their wish was fulfilled. They loaded the bell and set forth, the wind gentle and the waves calm, arriving in Junzhou after two days and nights.\n\nAt that time, the Marquis of Longping and the Imperial Son-in-Law, hearing the news, rejoiced and said: \"This bell has long been submerged. That it should rise from the waters on the very day Mount Wudang’s temples are to flourish—could this not be the work of unseen spirits aiding us? It shall herald the mountain’s grandeur and stand as a sign of divine wonder for ten thousand generations.\" Thereupon, they arranged a ceremonial procession with drums and winds to welcome it, delivering it to the Jade Void Palace of the Dark Heaven, where it would be enshrined for perpetual morning and evening offerings. They further recorded the event, that it might be transmitted through the ages without end.\n\nBy imperial edict of the present dynasty, the construction of the palaces and temples on Mount Wudang was commanded, with the Marquis of Longping, Zhang Xin, and the Imperial Son-in-Law and Commander of the Capital Garrison, Mu Xin, overseeing the project.\n\nOn the twenty-fifth day of the fifth month in the eleventh year of the Yongle reign, repairs were underway on the Bronze Hall atop the Great Summit. That day, a circular radiance appeared from beneath the ravine’s spring, ascending through the void. Five colors blazed resplendently, illuminating the mountain valleys. Within the light, the image of a celestial sage manifested—clad in a black robe, hair unbound, standing with auspicious clouds swirling below in protection.\n\nOn the twenty-fifth day of the fifth month in the eleventh year of the Yongle reign, the sage’s image reappeared within the radiance before the Great Summit, seated with unbound hair. Two celestial deities stood in attendance on either side, as though engaged in conversation. Two more deities stood before them, with auspicious clouds swirling below in protection.\n\nOn the twenty-sixth day of the fifth month in the eleventh year of the Yongle reign, the Heavenly Pillar Peak of the Great Summit saw the circular radiance appear once more. Within the light, the sage’s image manifested again, with two celestial deities standing behind, and white clouds swirling below in protection.\n\nOn the twenty-first day of the sixth month in the eleventh year of the Yongle reign, the Purple Cloud Palace’s blessed grounds were being repaired. That day, a five-colored circular radiance appeared before the palace. Within it, the sage’s image was seen seated, a morning banner fluttering to the left amid the evening mist, held by a celestial general. To the right stood another general, bearing a sword. Below, white clouds swirled in protection, and within them, a tortoise and serpent coiled together. For a long while, the vision endured, and from that time onward, manifestations of the divine were without end.",
      "overlap_context": "who witnessed it gasped in awe, deeming it a numinous wonder.\n\nThe Marquis and the Imperial Son-in-Law arranged a ceremonial procession with drums and winds to welcome it, delivering it to the Jade Void Palace of the Dark Heaven. They further reported the matter to the court, proposing it as the central beam of the main hall, that it might be gazed upon by ten thousand generations. The event was illustrated and appended to the *Records of the Awakening of the Sage*.\n\nThe Waters Bore a Great Bell",
      "start_char": 3718,
      "end_char": 4283,
      "start_sentence": 174,
      "end_sentence": 194,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.31865644454956,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "在山官员军民二十余万，仰见兹瑞，莫不起敬，咸欢欣踊跃，而相庆曰：斯皆皇上诚心，感格天真显应，故锡此嘉瑞。 自生民以来，未有盛於今日，寔为国家万世太平之征，天下苍生之福。 谨用依序图其事如右。 永乐十一年八月十有七日，彩绘大顶殿宇。 是日，黑云拥护五色圆光，内现圣像，左右有二天神侍立。 永乐十一年八月十七日，大顶前光中，再现圣像，身披皂袍，两袖飘举，若风动之。 前有一神捧剑导引，后一神侍从。 永乐十一年八月十七日，光中三现圣像，前有一神导引，后一神捧印侍从。 永乐十一年八月十七日，光中四现圣像，前有一神捧剑导引，后一神执皂旗侍从。 永乐十一年八月十七日，光中五现圣像，坐於黑云之上，左右有二天神侍立。 永乐十一年八月十九日，宇完成。 是日，有五色圆光，内现天真圣像，下有黑云拥护。 永乐十一年八月十九日，光中复现圣像，后有一神侍从。 大明玄天上帝端应图录竟",
      "translated_text": "Amidst the mountains, over two hundred thousand officials, soldiers, and common folk gazed upon this auspicious sign, none failing to rise in reverence. All rejoiced and exulted, congratulating one another, saying: \"This is all due to His Majesty’s sincere heart, which has moved the celestial perfected to manifest their response, thus bestowing this felicitous omen. Since the dawn of humanity, there has been no grandeur to match the present day—truly a portent of eternal peace for the nation and a blessing for all under heaven.\" Accordingly, the events were faithfully depicted in sequence as above.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, the painting of the Great Summit Hall was completed. That day, dark clouds enveloped a five-colored circular radiance, within which the sage’s image appeared, flanked by two celestial deities in attendance.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, within the radiance before the Great Summit, the sage’s image manifested again, clad in a black robe with sleeves billowing as if stirred by the wind. Before him stood a deity bearing a sword to lead the way, while another followed in attendance.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, the sage’s image appeared a third time within the radiance, preceded by a deity leading the way and followed by another bearing an imperial seal in attendance.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, the sage’s image manifested a fourth time within the radiance, with a deity bearing a sword leading before him and another holding a black banner following behind.\n\nOn the seventeenth day of the eighth month in the eleventh year of the Yongle reign, the sage’s image appeared a fifth time within the radiance, seated upon dark clouds, with two celestial deities standing in attendance on either side.\n\nOn the nineteenth day of the eighth month in the eleventh year of the Yongle reign, the hall’s construction was completed. That day, a five-colored circular radiance appeared, within which the image of the celestial perfected sage manifested, enveloped below by dark clouds in protection.\n\nOn the nineteenth day of the eighth month in the eleventh year of the Yongle reign, the sage’s image appeared once more within the radiance, with a deity in attendance behind.\n\n*The Illustrated Record of the Manifest Responses of the Mysterious Heavenly Thearch of the Great Ming* concludes.",
      "overlap_context": "rounds were being repaired. That day, a five-colored circular radiance appeared before the palace. Within it, the sage’s image was seen seated, a morning banner fluttering to the left amid the evening mist, held by a celestial general. To the right stood another general, bearing a sword. Below, white clouds swirled in protection, and within them, a tortoise and serpent coiled together. For a long while, the vision endured, and from that time onward, manifestations of the divine were without end.",
      "start_char": 4283,
      "end_char": 4675,
      "start_sentence": 195,
      "end_sentence": 208,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.796741008758545,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\大明玄天上帝瑞应图录.txt",
        "category": "记传类"
      }
    }
  ]
}