{
  "source_id": "大还心鉴",
  "source_file": "chunked_daozang\\大还心鉴.json",
  "total_chunks": 2,
  "total_original_chars": 1641,
  "total_translated_chars": 10532,
  "total_translation_time": 52.57228350639343,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\大还心鉴.txt",
    "category": "众术类"
  },
  "full_translation": "**The Great Return: A Mirror of the Heart**\n\n*Scripture Title:* *The Great Return: A Mirror of the Heart*. Composed by Han Shanzi, likely dating to the late Tang or Five Dynasties period. One fascicle.\n\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Zhongshu* category.\n\n**The Great Return: A Mirror of the Heart**\n\nThe *Ultimate Formula of Han Shanzi* states: If one awakens to the true lead, the medicine will naturally be divine; if one remembers the correct mercury, the medicine will surely be sacred. Cultivating this to perfection aligns with the sagely, and heaven and earth rejoice together. Attaining this depends on transmission from a master—this is the path of the Dao.\n\nThus, the sages of antiquity did not speak of it directly. Fearing that the foolish would take it lightly, they entrusted it to the *Book of Changes*, lodged it in the Five Phases, and aligned it with talismanic correspondences. Among the wondrous methods of harmonizing with the true, none surpasses the divine efficacy of the Great Elixir!\n\nGenerally, when foolish people hear of the Great Elixir, they harbor endless doubts. The wise, however, comprehend it and employ it with singular devotion. Thus, what is inherently secret becomes difficult, and the precious Dao must not be taken lightly.\n\nIn ancient times, the Three Sages bequeathed their words, inscribing them on golden tablets under the title *The Kinship of the Three*. Though the world transmits and copies it, scarcely one or two in a hundred awaken to its meaning. Those who grasp its principle dare not act rashly; those who clarify its practice still hesitate and procrastinate. Doubts arise in an instant and pass swiftly, while glory and splendor dazzle the eyes, gold and jade entangle the heart, wealth and sensuality occupy the mind—thus a hundred years are squandered in vain.\n\nThe Way of longevity rarely receives true attention. People do not realize that worldly desires exhaust the spirit and time erodes the years. For this reason, doubts multiply. Some perfected beings describe elixirs of varying degrees, yet fools immediately cite Qin Shihuang and Han Wudi. Qin Shihuang was insincere in word and deed, drowning in the sea of passions; Han Wudi, though he admired the mysterious realm, remained entangled in sensuality. How could they attain immortality and escape death? Why do they not speak of the Yellow Emperor and the ancients?\n\nThe Yellow Emperor transmitted the *Defense of the Mysterious Woman’s Returning Elixir*, teaching how to replenish gold and mercury in the cinnabar field. Later generations, failing to grasp the true essence, regrettably turned to the arts of bedroom practices. Yet the immortal maidens of Mount Tai surely had no intention of expounding on licentiousness—fools have been deluded by this for ten thousand generations. The songs and formulas are recorded in the *Discourse on the Golden Elixir*; those who obtain them may attain clarity.\n\nIn my early years, I admired the Dao and was fortunate to receive the true transmission. I reverently followed my immortal teacher and personally received his teachings. We spoke only of the wonders of lead and mercury, dragon and tiger, and how the true person avoids the grave errors of the Four Yellows and the adulterations of the Eight Stones. For lead and mercury embody the primordial order of heaven and earth, encapsulate the essence of the sun and moon, crown the Qian trigram above, and submit to the Kun trigram below. They govern the seventy-two minerals and command the radiant essence of heaven and earth. When refined into the elixir and ingested, they prolong life—how can this not be trusted?\n\nMoreover, since the five grains can sustain life, how can one not revere the divine elixir? Even yellow essence, when consumed, bestows longevity, while *Gelsemium* leads to certain death—these truths are evident to the eye, and the true sages uphold them. Yet the divine elixir stands supreme among all methods. All this depends on a long-standing affinity with the wonders of the Dao and sustained devotion—not something achieved in a single day.\n\nHowever, the numinous power of the returning elixir cannot avert calamities brought by self-inflicted harm. The compassionate methods of the sages cannot rescue one from the misfortunes of past karma. This also depends on one’s resolve to propagate the Dao’s principles. One must not lightly believe reckless claims, lest one be deluded by false arts!\n\nNow, in *The Great Return: A Mirror of the Heart*, I illuminate the realm of the mind. When the mind is clear, the elixir becomes the supreme medicine. Do not be misled by other substances, for if they are not of the same kind, the elixir will not be efficacious. If the mind strays from the Dao, even if the elixir is formed, it will bring disaster. This is deeply worthy of caution and self-reflection in one’s cultivation.\n\nThe Great Elixir is none other than the Dao of the One Yin and One Yang—this is the mechanism of heaven and earth. One metal and one mineral together are called the elixir, for they unite heaven and earth. The first, true lead, is the White Tiger; the second, mercury, is the cinnabar-born quicksilver.\n\nMaster Tao Tan said: \"If one uses worldly mercury, the quicksilver will turn to white smoke.\" This is a profound truth. The divine talisman and the wondrous White Snow—Master Ma said: \"Mercury differs from quicksilver; the deluded use it clumsily.\" Understanding these words, one transforms from the mundane to the sacred. The sacred does not depart from the mundane; one enters the sacred through the mundane. Within the mundane lies the sacred, and from the sacred emerges the mundane. Thus, one knows that quicksilver originally resides in cinnabar, and life unites lead and mercury. When mercury becomes the supreme treasure, its color returns to the original elixir. If the elixir fails to form, it reverts to quicksilver—this is true mercury. Once true mercury is attained, one ascends from the mundane to the sacred, capable of commanding the myriad spirits. This is what Master Ma meant when he said, \"Mercury differs from quicksilver.\" Yet since then, scholars have been few and ignorant, unable to reach this understanding!\n\nMaster Tao Tan also said that this is not the quicksilver of the world, and further stated that cinnabar is born of metal, and mercury arises from lead. This is not of the world—how can one not carefully examine its wondrous principles?\n\nSince ancient times, true persons have all ascended from the mundane to the sacred, aligning with the Great Elixir to attain transcendence. Yet the deluded remain confused. The elixir consists of the One Yin and One Yang, the two substances of dragon and tiger. Lead is the name of the Water Phase, the Northern River Chariot. Metal is born of water; the number of metal is four, and the number of water is one—together they make five. Mercury is the Azure Dragon, the Wood Phase of the East. The number of wood is three; wood generates fire. Cinnabar is the essence of fire. Two and three together also make five. Five is earth, which has no fixed position but is named in the four seasons. Water and metal together make five; wood and fire together make five. Thus, it is said that the Way of the Three and Five returns the elixir. The mystery of the Dao and the wonder of the elixir are rarely understood by those with profound insight. Those who understand—are they not sages? Truly, with this, the workings of creation lie in one’s hands, and transformation becomes free and effortless.\n\nWithout the true oral transmission, even if one recites the authentic verses, lacking a master’s lineage, the wondrous principle remains forever elusive. I recall my past years of delusion—wandering mountains and rivers in vain, accomplishing nothing, squandering wealth and resources—until sudden awakening came like sobering from drunkenness.\n\nThe Way is near at hand, as close as the misty heavens; the great Dao is not distant. Yet people guard secrets, making the easy difficult, for they fear that if fools obtain them too readily, celestial reckoning will be disrupted and divine retribution will shorten their lives. Thus, the *True One’s Sincere Scripture* states: \"Though all in the world seek long life, man’s fate is meager; gradually, the yin realm encroaches, until yin and yang bring death. How can the spirit of yang’s birth be guarded?\"\n\nIf one does not cultivate in spring to nurture life, but instead harms others and seizes their possessions, how can one attain longevity? Even if one encounters a perfected being, if the Dao does not resonate between them, how could it be transmitted to the unworthy?\n\nThe *Ritual Codes* say: \"Those who seek the returning elixir of long life and the completion of the great elixir cannot be ignorant of the crucible and furnace. Yet knowing the crucible and furnace, if one does not understand the firing times, one still does not know the heart-mind. Knowing the heart-mind, one must still guard against manifold obstacles and past karmic misfortunes. Even if one attains self-knowledge, one must not recklessly transmit it to others. If the Dao is not transmitted, it decays; if transmitted to the wrong person, calamity follows.\"\n\nThus, all wondrous mysteries do not depart from the heart-mind. The heart-mind is the origin of transcending the world; the elixir is the medicine of extended years. Ingesting it, one returns to the Yang Palace, and the registers of the Yin Bureau are struck from one’s name. Thereafter, even if one departs, one will achieve divine liberation and ascend as an immortal.\n\nThese are the words of true sages—unmistakable!\n\nI have perused the true intentions of ancient worthies, from the *Can Tong Qi*, the *Golden Green Scripture*, and the *Ancient Text of the Dragon and Tiger*, which transmit the legacy of the Three Sages, along with the verses and oral instructions of the many perfected—none depart from the wondrous truth of lead and mercury. Fearing that later seekers may harbor unresolved doubts, I have further expounded upon them in this *Heart-Mirror*, desiring to illuminate the great Dao, radiate the true origin, and dispel the doubts of learners, that all may understand.\n\nFools, bewildered by the ramblings of madmen, awaken and receive the teaching—then the azure clouds become attainable, and the bright moon shines perpetually. Having set this forth, may those who are not deluded grow in number!\n\n*The Great Returning Heart-Mirror* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大还心鉴 经名：大还心鉴。 寒山子撰，当出朴晚唐五代。 一卷。 底本出处：《正统道藏》洞神部众术类。 大还心鉴 《寒山子至诀》云：但悟铅真，药必自神，但记汞正药，必自圣。 修之合圣，天地同庆，得因师传，为道之径。 所以古之圣人，不直而言之，愚者容易，托之《周易》，寄之五行，合之符契，合真之妙者，莫若大丹之神欤！ ．大凡愚人闻之大丹，疑恨万端，有智者了解，用之一神，所以秘易成难，贵道不可轻也。 昔三圣遗言，着之金简，名日《参同契》世皆传写，悟无一二。 得其理者，未敢造次，明其事者，犹豫因循，疑来倏忽而迈，荣华闪目，金玉萦心，财色介怀，百年空弃。 长生之道，罕有留心，不知世色劳神，光阴侵岁，以此之故，递有多疑。 或至人述以近远之丹，愚者便说秦皇、汉武，秦皇口是心非，贪情欲海； 汉武虽慕玄境，心在色情，何得而长生不死？ 何不言黄帝与上古人乎？ 黄帝传玄女还丹之卫，言补金汞於丹田，后人不诀真宗，恨入御女之道。 且太山仙女，必无对偶说淫色之心，愚者惑之於万古。 其歌诀书，在金丹论中，得者可明矣！ ．余早年慕道，幸得传真，克奉仙师，亲承旨教，只论铅汞龙虎之妙，真人去四黄之大非，损八石之参杂。 且铅汞合天地之元纪，包日月之精华，上冠於乾，下顺於坤，总七十二石，统天地精光，修炼成丹，服之延驻，可不信乎？ 且五谷既能救命，岂可不奉神丹，黄精犹服长生，钩吻服之必死，目击可见，真圣奉之。 然神丹为万法之尊，是皆夙契道妙，久却留心，非一朝一夕耳。 然还丹之灵，不救自刑之祸，圣法慈愍，不救夙业之殃。 此亦在人弘心道旨，又不可轻信狂言，非惑於神术乎！ ．今以大还心鉴，着明心域，心明丹为至药，不惑他物，物非其类，丹必不灵，心非其道，虽成必祸。 此深可诚，而省己修进也。 论大丹唯一阴一阳之道，即合天地机也，一金一石谓之丹，亦天地合也。 一金，真铅，白虎是也； 二为汞者，丹砂中水银是也。 陶坛真人云：若用世问汞，水银化白烟。 此至言也。 神符白雪之妙，马真人日：汞与水银别，迷人用之拙。 即知此言，从凡化圣，圣不离凡，因凡入圣。 凡中有圣，圣中出凡，即知水银本在丹砂，命合铅汞，汞成至宝，色还本丹，丹更不成，却归水银，即真汞矣，既至真汞，即从凡入圣，可以统领万灵，即马真人云汞与水银别也。 自后之学者寡昧，不能至此矣！ ．陶真人若言非世问水银，又云砂产於金也，汞生於铅也，此非世问，可不审察妙旨矣！ ．自古真人，皆从凡入圣，与大丹同契，以至上升。 而迷者多惑，如丹唯一阴一阳，龙虎二物，铅是水一之名，北方河车，金生於水，金数四，水数一，共为五也。 汞青龙，束方木，木数三，木生火，丹砂者，本火之精，二之与三，共为五也。 五土也，土无定位，四季立名，水与金共五，木与火共五，故曰三五道还丹，道之玄也，丹之妙，罕有玄解知之。 知之者，圣人乎？ 可谓造化在乎手，变转自由耳。",
      "translated_text": "**The Great Return: A Mirror of the Heart**\n\n*Scripture Title:* *The Great Return: A Mirror of the Heart*. Composed by Han Shanzi, likely dating to the late Tang or Five Dynasties period. One fascicle.\n\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Zhongshu* category.\n\n**The Great Return: A Mirror of the Heart**\n\nThe *Ultimate Formula of Han Shanzi* states: If one awakens to the true lead, the medicine will naturally be divine; if one remembers the correct mercury, the medicine will surely be sacred. Cultivating this to perfection aligns with the sagely, and heaven and earth rejoice together. Attaining this depends on transmission from a master—this is the path of the Dao.\n\nThus, the sages of antiquity did not speak of it directly. Fearing that the foolish would take it lightly, they entrusted it to the *Book of Changes*, lodged it in the Five Phases, and aligned it with talismanic correspondences. Among the wondrous methods of harmonizing with the true, none surpasses the divine efficacy of the Great Elixir!\n\nGenerally, when foolish people hear of the Great Elixir, they harbor endless doubts. The wise, however, comprehend it and employ it with singular devotion. Thus, what is inherently secret becomes difficult, and the precious Dao must not be taken lightly.\n\nIn ancient times, the Three Sages bequeathed their words, inscribing them on golden tablets under the title *The Kinship of the Three*. Though the world transmits and copies it, scarcely one or two in a hundred awaken to its meaning. Those who grasp its principle dare not act rashly; those who clarify its practice still hesitate and procrastinate. Doubts arise in an instant and pass swiftly, while glory and splendor dazzle the eyes, gold and jade entangle the heart, wealth and sensuality occupy the mind—thus a hundred years are squandered in vain.\n\nThe Way of longevity rarely receives true attention. People do not realize that worldly desires exhaust the spirit and time erodes the years. For this reason, doubts multiply. Some perfected beings describe elixirs of varying degrees, yet fools immediately cite Qin Shihuang and Han Wudi. Qin Shihuang was insincere in word and deed, drowning in the sea of passions; Han Wudi, though he admired the mysterious realm, remained entangled in sensuality. How could they attain immortality and escape death? Why do they not speak of the Yellow Emperor and the ancients?\n\nThe Yellow Emperor transmitted the *Defense of the Mysterious Woman’s Returning Elixir*, teaching how to replenish gold and mercury in the cinnabar field. Later generations, failing to grasp the true essence, regrettably turned to the arts of bedroom practices. Yet the immortal maidens of Mount Tai surely had no intention of expounding on licentiousness—fools have been deluded by this for ten thousand generations. The songs and formulas are recorded in the *Discourse on the Golden Elixir*; those who obtain them may attain clarity.\n\nIn my early years, I admired the Dao and was fortunate to receive the true transmission. I reverently followed my immortal teacher and personally received his teachings. We spoke only of the wonders of lead and mercury, dragon and tiger, and how the true person avoids the grave errors of the Four Yellows and the adulterations of the Eight Stones. For lead and mercury embody the primordial order of heaven and earth, encapsulate the essence of the sun and moon, crown the Qian trigram above, and submit to the Kun trigram below. They govern the seventy-two minerals and command the radiant essence of heaven and earth. When refined into the elixir and ingested, they prolong life—how can this not be trusted?\n\nMoreover, since the five grains can sustain life, how can one not revere the divine elixir? Even yellow essence, when consumed, bestows longevity, while *Gelsemium* leads to certain death—these truths are evident to the eye, and the true sages uphold them. Yet the divine elixir stands supreme among all methods. All this depends on a long-standing affinity with the wonders of the Dao and sustained devotion—not something achieved in a single day.\n\nHowever, the numinous power of the returning elixir cannot avert calamities brought by self-inflicted harm. The compassionate methods of the sages cannot rescue one from the misfortunes of past karma. This also depends on one’s resolve to propagate the Dao’s principles. One must not lightly believe reckless claims, lest one be deluded by false arts!\n\nNow, in *The Great Return: A Mirror of the Heart*, I illuminate the realm of the mind. When the mind is clear, the elixir becomes the supreme medicine. Do not be misled by other substances, for if they are not of the same kind, the elixir will not be efficacious. If the mind strays from the Dao, even if the elixir is formed, it will bring disaster. This is deeply worthy of caution and self-reflection in one’s cultivation.\n\nThe Great Elixir is none other than the Dao of the One Yin and One Yang—this is the mechanism of heaven and earth. One metal and one mineral together are called the elixir, for they unite heaven and earth. The first, true lead, is the White Tiger; the second, mercury, is the cinnabar-born quicksilver.\n\nMaster Tao Tan said: \"If one uses worldly mercury, the quicksilver will turn to white smoke.\" This is a profound truth. The divine talisman and the wondrous White Snow—Master Ma said: \"Mercury differs from quicksilver; the deluded use it clumsily.\" Understanding these words, one transforms from the mundane to the sacred. The sacred does not depart from the mundane; one enters the sacred through the mundane. Within the mundane lies the sacred, and from the sacred emerges the mundane. Thus, one knows that quicksilver originally resides in cinnabar, and life unites lead and mercury. When mercury becomes the supreme treasure, its color returns to the original elixir. If the elixir fails to form, it reverts to quicksilver—this is true mercury. Once true mercury is attained, one ascends from the mundane to the sacred, capable of commanding the myriad spirits. This is what Master Ma meant when he said, \"Mercury differs from quicksilver.\" Yet since then, scholars have been few and ignorant, unable to reach this understanding!\n\nMaster Tao Tan also said that this is not the quicksilver of the world, and further stated that cinnabar is born of metal, and mercury arises from lead. This is not of the world—how can one not carefully examine its wondrous principles?\n\nSince ancient times, true persons have all ascended from the mundane to the sacred, aligning with the Great Elixir to attain transcendence. Yet the deluded remain confused. The elixir consists of the One Yin and One Yang, the two substances of dragon and tiger. Lead is the name of the Water Phase, the Northern River Chariot. Metal is born of water; the number of metal is four, and the number of water is one—together they make five. Mercury is the Azure Dragon, the Wood Phase of the East. The number of wood is three; wood generates fire. Cinnabar is the essence of fire. Two and three together also make five. Five is earth, which has no fixed position but is named in the four seasons. Water and metal together make five; wood and fire together make five. Thus, it is said that the Way of the Three and Five returns the elixir. The mystery of the Dao and the wonder of the elixir are rarely understood by those with profound insight. Those who understand—are they not sages? Truly, with this, the workings of creation lie in one’s hands, and transformation becomes free and effortless.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1148,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.0507230758667,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还心鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "不知真诀，假如念诵真歌，不遇师承，终无妙理。 余忆昔年迷谬，徒历山川，一事不为，虚弃财贷，忽然省悟，如醉醒焉！ ．目前可致，烟霄足知，大道不远。 盖人秘易为难，恐愚者得之容易，即天官臧算，神道夺寿。 故《真人诚经》云：世皆延年，为人薄命，渐被阴境侵之，已至阴阳死也。 至阳生之神卫乎？ 春不修行益生，损人侵物，何长生乎？ 虽遇至人，道不相契，固不传其非人乎！ 《科仪》云：希长生还丹，取成大丹，不可不知炉鼎也； 知炉鼎又不明火候，又不可知心也，知心又虑多难，与夙殃也。 万一自知，’又不可妄传授於人也。 道不传即废，传非人即殃。 故知万妙，不离其心也，心为出世之宗，丹为延年之药。 服之归阳官，即阴司落名，已后纵往，亦神解上仙。 此真圣之言，不惑矣！ ．余览古贤真旨，至《参同契》、《金碧经》、《古文龙虎》，传三圣遗文，众真歌诀，不离真妙之铅汞乎1．恐后之有疑未决者，更序之於心镜，必欲明其大道，照曜真元，涤学者疑滞，使之皆晓。 愚者惑狂夫之说，悟而见受，可谓青云可致，朗月常明，序而说之，知不惑者众矣！ . 大还心鉴竟",
      "translated_text": "Without the true oral transmission, even if one recites the authentic verses, lacking a master’s lineage, the wondrous principle remains forever elusive. I recall my past years of delusion—wandering mountains and rivers in vain, accomplishing nothing, squandering wealth and resources—until sudden awakening came like sobering from drunkenness.\n\nThe Way is near at hand, as close as the misty heavens; the great Dao is not distant. Yet people guard secrets, making the easy difficult, for they fear that if fools obtain them too readily, celestial reckoning will be disrupted and divine retribution will shorten their lives. Thus, the *True One’s Sincere Scripture* states: \"Though all in the world seek long life, man’s fate is meager; gradually, the yin realm encroaches, until yin and yang bring death. How can the spirit of yang’s birth be guarded?\"\n\nIf one does not cultivate in spring to nurture life, but instead harms others and seizes their possessions, how can one attain longevity? Even if one encounters a perfected being, if the Dao does not resonate between them, how could it be transmitted to the unworthy?\n\nThe *Ritual Codes* say: \"Those who seek the returning elixir of long life and the completion of the great elixir cannot be ignorant of the crucible and furnace. Yet knowing the crucible and furnace, if one does not understand the firing times, one still does not know the heart-mind. Knowing the heart-mind, one must still guard against manifold obstacles and past karmic misfortunes. Even if one attains self-knowledge, one must not recklessly transmit it to others. If the Dao is not transmitted, it decays; if transmitted to the wrong person, calamity follows.\"\n\nThus, all wondrous mysteries do not depart from the heart-mind. The heart-mind is the origin of transcending the world; the elixir is the medicine of extended years. Ingesting it, one returns to the Yang Palace, and the registers of the Yin Bureau are struck from one’s name. Thereafter, even if one departs, one will achieve divine liberation and ascend as an immortal.\n\nThese are the words of true sages—unmistakable!\n\nI have perused the true intentions of ancient worthies, from the *Can Tong Qi*, the *Golden Green Scripture*, and the *Ancient Text of the Dragon and Tiger*, which transmit the legacy of the Three Sages, along with the verses and oral instructions of the many perfected—none depart from the wondrous truth of lead and mercury. Fearing that later seekers may harbor unresolved doubts, I have further expounded upon them in this *Heart-Mirror*, desiring to illuminate the great Dao, radiate the true origin, and dispel the doubts of learners, that all may understand.\n\nFools, bewildered by the ramblings of madmen, awaken and receive the teaching—then the azure clouds become attainable, and the bright moon shines perpetually. Having set this forth, may those who are not deluded grow in number!\n\n*The Great Returning Heart-Mirror* concludes.",
      "overlap_context": "ogether also make five. Five is earth, which has no fixed position but is named in the four seasons. Water and metal together make five; wood and fire together make five. Thus, it is said that the Way of the Three and Five returns the elixir. The mystery of the Dao and the wonder of the elixir are rarely understood by those with profound insight. Those who understand—are they not sages? Truly, with this, the workings of creation lie in one’s hands, and transformation becomes free and effortless.",
      "start_char": 1148,
      "end_char": 1594,
      "start_sentence": 43,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.521560430526733,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还心鉴.txt",
        "category": "众术类"
      }
    }
  ]
}