{
  "source_id": "大道论",
  "source_file": "chunked_daozang\\大道论.json",
  "total_chunks": 9,
  "total_original_chars": 10264,
  "total_translated_chars": 64213,
  "total_translation_time": 438.1746554374695,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\大道论.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Treatise on the Great Dao**\n\n**Title:** *Treatise on the Great Dao*\nAuthor: Zhou Yinpu of the late Five Dynasties period (or Northern Song)\nOne fascicle.\nSource text: *Daoist Canon of the Orthodox Tradition*, *Great Mystery Section*\n\n---\n\n### **Treatise on the Great Dao**\n**By Zhou Gudu**\n\n#### **Chapter on the Supreme Dao**\nThe Dao is supremely empty and supremely quiescent, the true nature and true constancy. It crowns the five qi and propagates the Three Powers, spreading the One Reality to give rise to the ten thousand images. It is without bounds in separation or union, the ancestral root of Heaven and Earth, transcending the numinous and the luminous, encompassing all without being confined to form or concept. It is nameless and without lineage, yet possesses movement and constancy. It transcends the four propositions and six causes, beyond names, words, and analogies.\n\nThe *True Scripture of Southern Florescence* states: *\"Beyond the vastness of the Great Void, it is not exalted; beneath the six directions, it is not profound.\"*\n\nThe world has arising and ceasing; the Dao has no arising or ceasing. Things undergo transformation and alteration; the Dao knows no transformation or alteration.\n\nThe *Book of Changes* says: *\"The Dao is the designation of the empty and the nonexistent.\"*\n\nAs the empty and nonexistent penetrate all things, it is called the Dao—nothing is not pervaded by it, nothing does not proceed from it.\n\nMoreover, the Dao is the Mother, and virtue is the Child.\n\nThe *Treasure Scripture of No Delusion* states: *\"The Dao pervades things, its meaning lying in nonaction. Virtue does not lose itself, its achievement lying in action.\"*\n\nThe *Scripture of Western Ascent* says: *\"The Dao is profoundly abstruse.\"* And again: *\"The Supreme Dao is deeply subtle; those who know it do not speak.\"*\n\nWhen fire and water scour and consume without remnant, my Great Dao remains true and constant, unmoved. When the warp and woof of Heaven and Earth unravel and shatter, my Great Dao abides in profound stillness, serene and unchanging.\n\nZhuangzi calculated and reckoned for five years yet could not exhaust it; he pondered yin and yang for twelve years before finally grasping it—thus it is called the Supreme Dao.\n\n#### **Chapter on the Supreme Virtue**\nThe Dao possesses the virtue of all-pervading generation, hence it is called Supreme Virtue.\n\nThe Sage says: *\"Because it pervades generation, it is named the Dao; because it encompasses all, it is called the Great.\"*\n\nAnother explanation: The empty and nonexistent is the essence of the wondrous origin, for it is not a thing. The spontaneous is the nature of the wondrous origin, for it is not artificially made. The Dao is the functioning of the wondrous origin, hence it is called the Dao of all-pervading generation.\n\nThe empty and nonexistent, the spontaneous, and the Dao—all three are the true nature of the wondrous origin. The highest principle establishes its law as the One Source.\n\nWhen the Great Uncarved Block scatters, it governs the nine domains; when the primordial essence is disseminated, it arranges the ten thousand images in their revolutions. The primal qi begins its sway, the Three Powers are fully apportioned, the four seasons commence their succession, and the five phases take turns in ascendancy—how vast!\n\nHeaven and Earth bear the burden of covering and supporting; the sun and moon fulfill their duty of illumination. Wind and rain disperse nourishment; clouds and thunder spread their drumming. Humans and beasts, pure and turbid; seas and mountains, high and deep—all gather in kinds and divide into groups, their wisdom and foolishness differing in endowment.\n\nThose who turn toward the Dao ascend to truth and attain sagehood; those who turn away from it hasten toward death and sink into transmigration—all return to the Supreme Virtue of the Great Dao’s all-pervading generation.\n\nZhuangzi says: *\"Virtue is attainment. Things attain it and thereby live—this is called virtue.\"*\n\nVirtue is the functioning of the Dao; the Dao is the essence of virtue. In all-pervading generation of the ten thousand images, creation acts and refrains from acting; Supreme Virtue acts not, yet there is nothing it does not do.\n\nThe *Record of the Dao of Lord Lao* states: *\"Pervade the One, and the ten thousand affairs are complete; attain the mindless, and ghosts and spirits submit.\"*\n\nThat which pervades Heaven and Earth is virtue; that which courses through the ten thousand things is the Dao. The world is supremely pervading.\n\nThe ten thousand things are what is generated; virtue is what generates. Without the ten thousand things as what is generated, the generating power of virtue cannot be manifest.\n\nThe *Scripture of Great Peace* says: *\"Virtue is upright mutual benefaction; completion is the achievement of salvation; non-loss is non-deviation—these three embody the highest principle.\"*\n\nMoreover, virtue is what Heaven and Earth receive; yin and yang rely upon it; the five phases attain mutual generation through it; the four seasons attain their orderly progression through it. Kings and lords govern and transform; teachers and friends instruct and follow—even sages, perfected ones, immortals, ghosts, and spirits, as well as the myriad kinds of moving and growing things, all depend on the wondrous functioning of Supreme Virtue.\n\nThus, the Dao possesses sentiment and trustworthiness—this may be called Supreme Virtue.\n\n#### **Chapter on Transmitted Teachings**\nIn high antiquity, there was no teaching; teaching began with the Three Sovereigns and Five Emperors.\n\nTeaching is instruction. It involves speech, principles, meaning, transmission, and conveyance—speech proclaims, teaching instructs. Through speech, one awakens to teaching; through teaching, one clarifies principles. When principles are clear, speech is forgotten. Since there is one who teaches and one who is taught, there must be one who instructs and one who is instructed.\n\nThus, there are the teachings of spontaneity and the teachings of the numinous and luminous—these two teachings require no master or disciple.\n\nThe teachings of the numinous and luminous have grounds for their discourse but no basis in principle.\n\nThe teachings of true correctness, the teachings of the Three Sovereigns and Five Emperors, the teachings of returning to the common, and the teachings of instructing the world—these should be distinguished in their provisional and real aspects. All five teachings originate from the One Reality.\n\nThe teachings of spontaneity: Before primordial qi, when simplicity was undispersed, there was profound obscurity and quiescence, vast emptiness and boundlessness. No master preached the Dharma, no disciple received transmission. Without beginning or end, without meaning or words—primordial qi attained it and transformed; the numinous and luminous attained it and created; Heaven and Earth attained it and covered and supported; the sun and moon attained it and illuminated. The rulers of high antiquity attained it and ruled through nonaction—this was the transformation without teaching.\n\nThe teachings of the numinous and luminous: When simplicity dispersed, it became the numinous and luminous. No vessel is greater than Heaven and Earth; no authority is greater than the numinous and luminous. They blend primordial qi in their revolutions, accord with the Supreme Dao in their regulation, adjust the round and pure to establish Heaven, and fashion the square and turbid to form Earth. They universally pervade and transform the world, surpass harmonious qi to perfect human relations. Yin and yang cannot fathom their arising and ceasing; ghosts and spirits do not know their transformations.\n\nThe teachings of true correctness: The Supreme Void Emperor is the master; the Celestial Venerable of Primordial Beginning transmits the teaching. Passing through the mysteries and purities, it is concealed in the Nine Heavens. Correct transformation is bestowed upon the sages of the age. In the heavens, the Celestial Venerable is honored among the Three Clarities and the host of heavens, greatly propagating the true vehicle and opening the path to immortality. In the human realm, Fuxi received the Chart, Xuanyuan received the Talisman, Gaoxin received the Heavenly Scripture, and Yu of Xia received the Luo Writing. The Four Sages received the numinous and luminous; the Five Elders appeared on the river islets. Thus, there are the Three Tombs and Five Classics—the teachings of the Constant Dao.\n\nThe Teachings of Returning to Simplicity:\nThe Great Sage of the Mysterious Origin, during the reign of Emperor Shun, governed state and family, widely disseminating the numinous scriptures and true precepts among humanity. The golden tablets and jade chapters broadly propagated the Way in the heavens above. His earnest desire was that both heaven and earth return to purity and simplicity, restoring the august wind of antiquity.\n\nThe Teachings of Instruction for the World:\nThe Master lamented the loss of the Dao and virtue, expounding the teachings of benevolence and righteousness to transform the customs of the age. He employed ritual and wisdom to remedy the roots of chaos. Yet the wind of sincerity and depth has long faded, and the current of superficiality and shallowness prevails.\n\nAlas! Teachings arise from the sagely heart that pities the world and cherishes all beings. When the hearts of beings awaken to the teaching, they harmonize with the sagely mind. In the sagely mind, both expedient and real vanish; words and explanations dissolve entirely. Only then does one accord with the teaching beyond speech, where intent and image no longer abide.\n\n**Chapter on Transcending Distinctions**\nThe Great Dao addresses the cultivator, saying:\nSuppose it were named by clan—I have no birthplace, no clan, no surname. Thus, I have no clan.\nSuppose it were named by name—restricting the virtue of growth and longevity, it is called the Dao, hidden and not manifest. Its essence and nature are unknown, so it is only named by appellation, not by designation.\nSuppose it were ranked by honor and humility—it dwells in modesty and lowliness, emulating Earth, which is not exalted. As a servant, it honors the Dao and esteems virtue, thus not base.\nSuppose it were perceived by sight and hearing—it is not a form of color, so it cannot be seen; it is not a sound, so it cannot be heard.\nSuppose it were subject to slander or praise—it commits no transgressions, so it cannot be slandered; it bears no arrogance, so it cannot be praised.\nSuppose it were affected by benefit or harm—it has no desires, so it cannot be benefited; it is without obstruction, so it cannot be harmed.\nSuppose it were judged by right or wrong—it does not follow worldly customs, opposing things, so it has no right; it avoids faults and calamities, so it has no wrong.\nSuppose it were opposed by compliance or defiance—defiance is merely not conforming to the world, yet the Dao of Heaven is not defiant.\nSuppose it were measured by high or low—it emulates Earth, thus low and not high; it models Heaven, thus high and not low.\nSuppose it were measured by great or small—grasping a autumn hair, it is not great; aligning with Heaven and Earth, it is not small.\nSuppose it were defined by emptiness or existence—it has function and responds to things, so it is not empty; it is non-action and quiescent, so it is not existent.\nSuppose it were ranked by nobility or baseness—it does not boast of merit but awaits destiny, so it is not noble; it precedes Heaven and Earth, so it is not base.\nSuppose it were judged by wisdom or foolishness—embracing simplicity, it has no wisdom; containing virtue, it has no foolishness.\nSuppose it were ordered by before or after—it has no beginning, so it is not before; it has no end, so it is not after.\nSuppose it were distinguished by stillness or chaos—when all virtues manifest, life is not still; when kinds gather and groups divide, it is not chaotic.\nSuppose it were defined by gain or loss—externally, there is not a single thing, so nothing is gained; internally, it harmonizes with true nature, so nothing is lost.\nSuppose it were bound by love or hatred—it has no aversion, so it does not hate; it has no preference, so it does not love.\nSuppose it were oriented by facing or turning away—it is formless, so it does not face; it is one with the Dao, so it does not turn away.\nSuppose it were subject to favor or disgrace—it does not boast of merit or parade virtue, so it cannot be favored; it is without arrogance, indolence, or negligence, so it cannot be disgraced.\nSuppose it were confined by square or round—it has no boundaries, so it cannot be square; it has no form, so it cannot be round.\nSuppose it were distinguished by brightness or darkness—if dim, it is not bright above; perceiving the small is called brightness, so it is not dim below.\nSuppose it were judged by new or old—without beginning, it is not new; without end, it is not old.\nSuppose it were measured by advance or retreat—it does not advance into emptiness, nor retreat into existence. It does not advance for the superior person, nor retreat for the inferior.\n\nCultivator, be thus; I, too, am thus. There is no difference between us.\n\nO Dao-disciple, come! O Dao-disciple, come! I fear you will cling to parables, methods, and doctrines, losing the nature of the Dao. I fear beings will grasp the teaching, stagnate in its literal meaning, and calculate existence, becoming entangled in partiality and extremes. The foolish do not realize that when the illness ceases, the medicine is no longer needed. They catch the fish but discard the trap, clinging to the teaching and its words, guarding its metaphors, and losing the harmonious and true constancy.\n\n**Chapter on Distinctions**\nThe emotions of the heart, the perceptions of consciousness, the intentions of the mind—all arise falsely from the Dao. Beyond the Dao, there is no heart; beyond the heart, there is no Dao. Heart and Dao are one. The same applies to emotions, perceptions, intentions, and knowledge.\n\nSever the heart that awakens to the Dao; prune the consciousness that recognizes the Dao; loosen the wisdom that verifies the Dao; remove the knowledge that attains the Dao; untangle the intentions that comprehend the Dao. Then, forget knowledge, forget intention, forget wisdom, forget perception, forget the heart. Naturally, there will be no seeking, no pursuing, no learning of the Dao—this is attaining the Dao. This is truly removing the cultivator’s attachments to traces and proximity, truly attaining the Dao, truly attaining the One.\n\nIf one clings to the Dao or the One, one strays far from the Dao. If one forgets the Dao and the One, one attains the Dao and the One.\n\nThe three bodies differ; the two births are not the same. There is the body of self-nature—the original nature of the Dao. There is the body of function—the Dao and the myriad phenomena as interdependent. There is the body of emulation—like embodying the Dao’s nature through cultivation, reaching non-action.\n\nThere are two kinds of birth: the birth that can generate—the Dao giving birth to the myriad things; and the birth that is generated—the myriad things born from the Dao. Those who awaken cultivate; through cultivation, they necessarily attain sagehood. Those who are deluded do not cultivate—they remain ordinary. Those who do not stagnate in sagehood or ordinariness awaken; those who stagnate in sagehood or ordinariness are deluded. Understanding delusion and awakening is emptiness; comprehending sagehood and ordinariness is dissolution.\n\nThus, transcending form and emptiness, expedient and real, verbal teachings, mutual dependence, distinctions of form, and existence and non-existence—this is truly attaining the Dao.\n\nThe Dao is not words or wisdom; it borrows words and wisdom to reach naturalness. Virtue is not action; it relies on action to manifest its true function.\n\nTherefore, open the twenty-four gates to close the five senses. These are:\nThe Gate of Profound Clarity and Deep Stillness—The body of the Dao is supremely void, profoundly clear and cool, reflecting things without partiality, its mysterious responses hidden and subtle.\nThe Gate of Heavenly Sage without Mind—Heaven and Earth are impartial, covering and supporting the myriad things, nurturing and growing them without missing their seasons. The sage is impartial, transforming and governing the people, delighting in clarity and peace.\nThe Gate of Empty Response and Pervasive Connection—The Great Dao is without mind, pervading the myriad existences. Naturally clear and still, it transcends both existence and non-existence.\n\nThe Gate of Spirit Unfailing—Subtle existence is pure and still, responding to things without fixed form, never resting even for a moment, as wondrous as the spirit.\n\nThe Gate of Deep Stillness and Growth—The myriad things arise and take form from the Dao, drawing sustenance from the transformations of nature.\n\nThe Gate of Humility and Benefiting Others—Those who cultivate the Dao are yielding and soft, holding fast to virtue with purity, aiding others without weariness.\n\nThe Gate of Single-Minded Unknowing—Embracing and guarding the harmonious unity of qi, not yet discerning the distinctions of worldly affairs.\n\nThe Gate of Interdependence of Being and Non-Being—Vacuity borrows form, and form borrows vacuity; being arises from non-being, hence they are said to rely on one another. Heaven and Earth, humans and all phenomena are called \"form,\" which is being; the function of the Dao is non-being.\n\nThe Gate of Delusion and Pursuing Phenomena—Worldly people merely covet mundane learning, clinging to action and losing the true source, sinking into the depths of sound and color.\n\nThe Gate of Embracing and Holding Fast—Holding to the Dao with the harmony of Earth, expansive and yielding, still and receptive; like an infant holding fast, or a valley embracing all.\n\nThe Gate of Crippled Form and Ignorance—Those who boast of skill and parade merit differ not from the crippled; deluded and clinging in darkness, hence called ignorant.\n\nThe Gate of Four Analogies in One Teaching—The scriptures say: Those who cultivate the Dao are like one crossing a river, fearful of neighbors yet appearing composed; like ice, pure and cold, serene and silent.\n\nThe Gate of Not Acting as Ruler—The emperors of high antiquity governed with pure transformation and impartiality; though all under heaven came to pay homage, they did not boast of their virtue or power, nor claim their own ability.\n\nThe Gate of Not Displaying Authority and Wisdom—The laws and strategies by which emperors govern the state must not be shown to others. If unworthy men gain power, they will act with deceit, indulging in cruelty and bringing calamity upon themselves.\n\nThe Gate of Not Boasting of Instruments and Tools—The ancient emperors did not flaunt civil or military prowess, nor exalt themselves; embodying the supreme Dao, their minds aligned with non-action.\n\nThe Gate of Abiding in the Center Without Preference—Neither dwelling in non-being nor clinging to being, not residing in the dusty world, not fleeing to dull emptiness, not seeking extremes or thoroughness.\n\nThe Gate of Probing the Root of Nature—Deeply guarding one’s original nature, one naturally attains longevity; spirit and qi do not scatter, and desires do not arise.\n\nThe Gate of Unperturbed Transformation and Governance—When a state relies on many punishments, the people scatter; when it holds to the One, the people are pure. Scattering is the root of chaos; purity is the origin of order. Thus, the scriptures say: Cooking a small fish requires no stirring.\n\nThe Gate of Manifesting Virtue Through Things—Active doing and striving are not as good as returning to stillness and non-action; four-horse chariots and jade tablets are not as precious as the great treasure of the numinous vessel.\n\nThe Gate of Accumulating from the Subtle to the Manifest—Those newly cultivating the supreme Dao will surely see success; with long vision and longevity, they ascend to the immortal realms.\n\nThe Gate of Humility and Great Achievement—Governing a state with humility, the people joyfully support and follow; the myriad families gather to it, thus accomplishing great enterprise.\n\nThe Gate of Cultivating the Self and Treasuring Virtue—The scriptures say: Compassion, frugality, and humility are the sources of governing the self and cultivating virtue; greed, malice, flattery, and obsequiousness are the roots of inviting calamity and destroying the self. Thus, virtue is to be treasured.\n\nThe Gate of the Skillful Artisan Without Harm—When a ruler metes out punishment, it is not like the commands of Heaven’s seasons—spring, summer, autumn, and winter. To forcibly replace Heaven’s killing is to risk excessive harm. Heaven’s craft is without clumsiness, hence without error.\n\nThe Gate of Heaven’s Dao, Level and Universal—Heaven’s Dao suppresses the high and lifts the low, supports the weak and curbs the strong, brings misfortune to the excessive and blessings to the humble, reduces the surplus and supplements the deficient.\n\nClosing the five senses refers to guarding against and discarding intelligence, benevolence, righteousness, skill, and profit.\n\n**Chapter on Near and Far**\nThe sages wish to establish teachings and reveal principles, hence there are distinctions of nature and capacity. Yet the words of sages are truthful, while the words of ordinary people are deluded; thus, there are advances and retreats, doubts and differences.\n\nThe body of the Dao is fundamentally without delusion or enlightenment. Enlightenment has nothing to enlighten; laughter has nothing to laugh at. Advancement does not necessarily bring gain; retreat does not necessarily bring loss. Not seeing the three kinds of scholars—this is the true superior scholar.\n\nSome are near yet know they are near, transforming delusion into enlightenment through close cultivation and learning.\n\nSome know they are near yet do not draw near, constantly speaking of the teaching of non-action yet not practicing non-action—this is knowing nearness yet not drawing near.\n\nSome are near yet do not know they are near, deluded by worldly dust and confused by phenomena, not awakening to the true source, unaware that within the dust lies the subtlest wonder.\n\nSome are far yet do not know they are far, awakening to profound depth yet not clinging to it; depth is not subject to emotion, hence they do not know farness.\n\nSome are far yet know they are far, awakening to depth and knowing that sentient beings possess profound nature; seeing their own bodies as responsive transformations, they expound the Dao to benefit others, merging with depth.\n\nSome practice yet do not arrive, though they have long cultivated and followed the path, their practice is bound by emotion and has not reached the utmost emptiness.\n\nSome do not know practice, not awakening to the teachings and methods, cultivating without a guide’s instruction.\n\nSome do not know arrival, unaware of the gate to the utmost extreme, having no direction to enter, hence not knowing arrival.\n\nSome do not practice yet arrive, not seeing their own practice, not seeing their own arrival, yet mysteriously merging with the root—hence not practicing yet arriving.\n\nSome arrive and transform themselves. Attaining true quiescence, the mysterious virtue shines within; without teaching or words, they naturally become pure and transformed.\n\n**Chapter on Applying the Dao**\nApplying the Dao restrains people; the function of the Dao restrains the wondrous root. Forgetting the Dao, one’s virtue is non-action. Forgetting the vacuous, one reaches the utmost extreme. Attaining virtue is like receiving a favor.\n\nPeople emulate the Dao and follow virtue, aligning with the function of nature. Human life arises as the Dao’s qi is bestowed, the purest essence granted as spirit; the Three Origins congeal the spirit, the Five Phases coalesce into purity. Having received the essence of being, one is endowed with the function of non-being. In the time of small simplicity, no thing dares resist; holding the great image, all forms come forth.\n\nThose of the same Dao and same virtue are yielding and firm like infants, abiding in the wondrous mystery of the Mysterious Female. Without dividing mind and phenomena, they equalize life and death, harmonizing with the natural movements of Heaven and Earth, the fluctuations of yin and yang.\n\nThe rulers of high antiquity who applied the Dao were empty-minded and benefited others, embodying the Dao to transform the people. They oversaw the four directions universally, mastered the six penetrations independently, cut off seeing and hearing, dismissed cleverness and brightness. They did not bind teachings with stagnant words, nor congeal emotions by clinging to things. They planted the root of the Three Ones, firmly establishing growth in the true source; they pruned the sprouts of the Four Sixes, severing the spreading vines in the numinous palace. They did not boast of great skill in achievement, nor did they pursue the eloquence of small success.\n\nThe Lower Canon states: \"Stillness is the rectitude of all under Heaven.\"\nThe *Nanhua Sutra* says: The Dao is affective and trustworthy, non-actional and formless; it may be transmitted but not received, attained but not seen.\nThus, the Sovereign of Xiwei grasped it to harness Heaven and Earth; Fuxi obtained it to inherit the Mother of Qi; the Yellow Emperor attained it to ascend the cloudy heavens; Zhuanxu secured it to dwell in the Mysterious Palace. Even unto the Dipper’s Handle, Kanpei, Yushang, and Pengzu—all applied the Dao and employed it, ascending to the fruit of sageliness.\nThus we know: sages, spirit-men, immortals, ghosts and spirits, Heaven and Earth, sun and moon, stars and constellations, the myriad things—if they did not attain and employ the Dao, they would lack the numinous penetration to rise lightly, the hidden profundity to cover and bear, the luminous singularity to oversee and nurture life.\nMoreover, the Dao collaborates with Heaven to command covering, with Earth to command bearing, with sun and moon to command illumination. Whatever has use, the Dao grants it use.\nThe Dao names Heaven as \"pure,\" Earth as \"tranquil,\" valleys as \"full,\" things as \"living.\" Thus use and name alike are the Dao’s mandates.\nTherefore, humans emulate Earth, Earth emulates Heaven, Heaven emulates the Dao, and the Dao emulates spontaneity.\n\n**Chapter on the Two Teachings**\nKnow that worldly learning is detrimental: worldly learning clings to realms and stagnates scholars. Without entering the true vision, it profits nothing for the Dao—hence it is detrimental.\nTrue learning is beneficial: the mind merges with the ultimate Dao, the body enters the Double Mystery, not dwelling in the three states—hence it is beneficial.\nYet true learning may be detrimental: gradual cultivation of the Dao’s practice requires shedding defiled passions and desires—hence it is called detrimental, for it diminishes passions and desires.\nOr worldly learning may be beneficial: through worldly teachings one gradually enters true teachings, attains the Dao and awakens to reality, moving from the worldly to the true—hence it is called beneficial.\nSome harm themselves to benefit others: entering the mysterious realm, transcending worldly questions, others witnessing this also cultivate, and through cultivation attain the Dao—hence it is called benefiting others.\nSome are harmed by others yet benefit themselves: seeing cultivators attain the Dao, they also diligently practice; when merit and conduct are complete, they awaken to the profound mystery—hence it is called self-benefit.\nTo return from being to non-being is difficult; to enter non-being from non-being is easy. The teaching of non-action is of great benefit.\nCultivators who preserve non-being and forget being do not equal those who forget both benefit and harm, who dissolve being and non-being equally. Only by attaining the source can one inwardly illumine the great clarity and accomplish the great transformation.\n\n**Chapter on the Two Afflictions**\nRegarding the Dao, there is affliction and non-affliction—hypothetically asking whether cultivators of the Dao have affliction or not.\nKnowing emptiness yet not clinging to emptiness is non-affliction; not grasping emptiness or being is non-affliction.\nKnowing emptiness yet clinging to emptiness is affliction; emptiness becoming entangled with emotion is affliction.\nNot knowing emptiness is affliction; grasping being while feigning emptiness is affliction.\nKnowing emptiness yet not cultivating emptiness is affliction; having understanding without practice is also affliction.\nKnowing emptiness and cultivating emptiness is non-affliction; having both understanding and practice is thus non-affliction.\nNot clinging to emptiness or to cultivating emptiness is equal to non-affliction: first awakening to emptiness, then broadly cultivating emptiness, cultivating until there is no cultivation—equaling non-clinging.\nRegarding the Dao, this is affliction.\nThere are degrees of depth: the affliction of clinging to emptiness and the affliction of grasping being are deep afflictions; clinging to emptiness while grasping being—both afflictions are profound.\nKnowing emptiness yet not cultivating emptiness is a shallow affliction.\nIf those of superior capacity cultivate emptiness without clinging to emptiness, their affliction is shallow; those of middling capacity who cultivate emptiness and cling to emptiness have deep affliction.\nDrowning in emptiness and stagnating in quiescence while aiding the world—though there is grasping of being—some awaken to emptiness without clinging to emptiness while saving the world, possessing dual natures.\nThus there is no fixed sameness: those who cling to the nature of emptiness are of middling capacity.\n\n**Chapter on Master and Resource**\nThe *Daoist Canon* states: The good person is the teacher of the ungood person; the ungood person is the resource of the good person.\nTo be a teacher, there are methods to grasp and conduct to follow. One may take the great roots of virtue, Dao, ritual, and music, and place them above the three supreme reverences of ruler, father, and teacher.\nA teacher possesses the Dao, virtue, wisdom, and benevolence—these four excellences.\nWith the Dao, one is penetrating and upright; with virtue, one is spiritually clear; with wisdom, one observes the moment; with benevolence, one pities beings—such may be called a master-father.\nAs a teacher, one is elder and ruler; in advancing the Dao, one becomes true and immortal.\nHow could this refer only to teaching masters? It is also the treasure of the state.\nHow wondrous—the good person!\nThe ungood person is deluded, confused, desirous, and merciless—these four non-excellences.\nNot drawing near to orthodox teachings but pursuing heterodox texts is called delusion.\nRejecting perfected beings while allying with the benighted and foolish is called confusion.\nIndulging in the five dusts and colluding with the six thieves is called desire.\nLacking a heart to pacify people and pity things, possessing the nature of aconite and owl venom—this is called mercilessness.\nSuch may be called the resource of the good person.\nThus one may know the rise and decline of teachings, the difficulty and ease of awakening and learning. The good person brings peace and delights in companionship, does not conceal learning but venerates the master, bears the sorrow of oversight, endures the toil of diligence. If one reaches the ultimate and penetrates emptiness, then love and attachment are both forgotten, mind and realm are both dissolved. The wordless teaching—how distant can it be?\nBefore the one qi and two images, there was profound obscurity and nothingness; after the division of the five supremes and three talents, the sounds of teaching gradually flowed forth.\nReturning to simplicity and restoring purity, joy lies in the root of non-action’s transformation. Attaining truth and verifying sageliness, one roams the profound mystery of the Double Mystery.\nThe Heavenly Worthy transmitted the Dao to the host of immortals; Lord Lao opened the mystery to the myriad states, guiding the black-haired people to the realm of longevity, leading all within the four seas to the river of blessings.\nSomeone asked: Since ancient times, have emperors and kings who attained and employed the Dao done so naturally, or through a master?\nI replied: The teachers of the Upper Three Sovereigns were the Great Dharma Masters of the Mysterious Center; the teachers of the Middle Three Sovereigns were the Ancient Masters; the teachers of the Lower Three Sovereigns were the Imperial Lords of the Golden Portal.\nFuxi’s teacher was Yuhua Zi; Shennong’s teacher was Dacheng Zi; Zhurong’s teacher was Guangshou Zi; the Yellow Emperor’s teacher was Guangcheng Zi; Zhuanxu’s teacher was Chijing Zi; Emperor Ku’s teacher was Lutu Zi; Emperor Yao’s teacher was Wucheng Zi; Emperor Shun’s teacher was Yinshou Zi; Yu of Xia’s teacher was Zhenxing Zi; Tang of Yin’s teacher was Xize Zi; King Wen of Zhou’s teacher was Xieyi Zi; King Wu’s teacher was Yucheng Zi; King Cheng’s teacher was Wuguang Zi; King Kang’s teacher was Guoshu Zi; Confucius’ teacher was Laozi.\n\nFrom the age of pristine simplicity to the era of decadent customs, spanning the nine heavens in height and encompassing the eight directions in breadth, through the reigns of the Three Sovereigns, Five Emperors, Three Kings, and Five Hegemons—without the guidance of sages, perfected beings, or immortals, who followed the regulations of their teachers and refined themselves through the supreme teachings, none could transcend the mortal realm and ascend to perfection.\n\nFurthermore, the *Guangyi* states: When Lord Lao sought to manifest the great teaching and spread transformation throughout the ten thousand directions, he declared, \"The Dao cannot lack a revered teacher, nor can the teaching lack a founding master.\" Thus, Lord Lao took the Most High Jade Dawn Great Dao Lord as his teacher. The Great Dao Lord, together with five hundred million Heavenly Lords and countless sacred sovereigns, took the Primordial Heavenly Venerable as their teacher.\n\nMoreover, Lord Lao embodies boundless greatness, boundless wisdom, boundless divine power, and boundless teachings; his Dao is inexhaustible, and his lifespan spans kalpas. Yet even he received instruction from a teacher to verify the truth and benefit all beings. How then can worldly people, without seeking a teacher or cultivating in accordance with the teachings, hope to have their names inscribed in the registers of immortals or ascend beyond the Nine Mysteries to the Three Clarities?\n\n**Chapter on Humaneness and Righteousness**\nThe Five Phases are what humans receive as the nature of the Five Constants, the virtues of emperors and kings. The nature of humaneness corresponds to wood, aligning with the virtue of spring’s growth. The nature of propriety corresponds to fire, harmonizing with the virtue of summer’s nurturance. The nature of righteousness corresponds to metal, aligning with the virtue of autumn’s sternness. The nature of wisdom corresponds to water, harmonizing with the virtue of winter’s concealment. Embracing these true constants deeply accords with the transformations of Fuxi and Shennong. Embodying this supreme Dao naturally gives rise to the winds of humaneness and righteousness.\n\nHolding harmonious qi and containing spirit and numen, one forms a nature and substance from the yang of heaven and the yin of earth. Substance is the division of form. Master Haozi said: Yang Xiong, Ban Gu, and their ilk, who claimed that Daoists slight humaneness and righteousness, disparage propriety and wisdom, and focus solely on purity and emptiness, were世儒 who failed to grasp the profound intent of the mysterious sages.\n\nHumaneness is partial love; righteousness is the correction of wrongs. When decadence first arises, the Dao becomes superficial and thin. The *Tian Yun* states: \"The utmost humaneness borrows the Way from humaneness and lodges temporarily in righteousness, like a lotus hut not meant for long dwelling, or straw dogs not to be reused.\" The *Upper Scripture* says: \"When the great Dao declines, humaneness and righteousness arise.\" It also says: \"Abandon sageliness and discard wisdom.\"\n\nConfucius asked the Fisherman: \"What is the real?\" The Fisherman replied: \"The real is the utmost sincerity. Without sincerity, one cannot move others. Thus, the real is inner utmost sincerity.\" Confucius taught humaneness and righteousness, transforming people through ritual and music—this is not the real.\n\n*Zhuangzi* says: \"The utmost propriety does not enter people; the utmost righteousness does not attach to things; the utmost wisdom does not scheme; the utmost humaneness has no partiality; the utmost trust dispenses with pledges.\" The Dao is obscured by minor achievements; words are obscured by superficial falsity. Moreover, the Dao is primary, while humaneness and righteousness are secondary. Armies and weapons are the dregs of virtue; rewards, punishments, and the five penalties are the dregs of teaching; ritual, law, and names are the dregs of governance; bells, drums, and feathered banners are the dregs of music; hempen mourning garments and wounds are the dregs of unity.\n\nHarming the world by emphasizing the secondary and neglecting the root: if one follows natural emotions and human nature without losing constancy, discarding ritual yet maintaining a serene and harmonious will, ceasing music yet keeping the heart from excess, abolishing humaneness yet dissolving love and hatred, eradicating righteousness yet forgetting right and wrong—then one may empty the heart of the winds of ancient simplicity, restrain sharp thoughts from the paths of secondary learning, dwell in the forefront of nature and knowledge as the origin of decadence, and strike the Dao’s loss as the source of chaos. This leads to Zhuang Kuang’s superfluous toes and fingers, casts Zeng and Shi into the misfortune of tumors and growths—how could one not blame the craftsmen of humaneness and righteousness and condemn the sages?\n\n**Chapter on Losing the Dao**\nThe wondrous origin is spontaneous, its essence and nature empty and nonexistent; fundamentally, there is no attainment and no loss. Yet, in relation to humans, one receives harmonious qi and contains the Dao to become human. In high antiquity, nature was pure and substance simple. From the Three Sovereigns and Five Emperors onward, the original truth was lost. Emperors and kings acted with intention, and the people’s nature changed. After the Dao was lost, humaneness, righteousness, propriety, wisdom, and power prevailed.\n\nMoreover, the movement and stillness of heaven and earth: if heaven did not move and revolve, it could not arrange the sun, moon, and stars, nor manifest the virtue of the Five Phases and Four Seasons’ nurturance. If earth were not tranquil and still, it could not firmly bear the growth of living things, nor provide the virtue on which the myriad beings, mountains, and rivers depend. This is the transformation of embodying the great Dao and spontaneity.\n\nThe *Book of Changes* says: \"The Supreme Ultimate generates the Two Modes; the Two Modes generate the Three Powers; the Three Powers generate the myriad beings.\" Their application and craftsmanship bring forth flourishing nurturance—this is the function of the Dao. Where the Dao abides, there is life; where the Dao departs, there is death. The Dao cannot be separated from; what can be separated is not the Dao.\n\nHumans are born tranquil—this is the nature of heaven and earth. Nature is originally pure and still. If one gallops amid the six dusts and rushes through the three karmas, the numinous terrace is not established, the celestial light is not bright, and one loses nature, sinking into birth and death. Acting evilly in the open, humans punish it; acting evilly in secret, ghosts punish it. This is losing the Dao.\n\nThus, when heaven loses the Dao, there is yang turbulence. When earth loses the Dao, there is yin dissipation. When spirits lose the Dao, their numinosity ceases and perishes. When valleys lose the Dao, their flowing waters dry up. When the myriad beings lose the Dao, there is no growth. When the Son of Heaven loses the Dao, he loses the world. When feudal lords lose the Dao, they lose their states. When people lose the Dao, they lose their lives.\n\nThe Dao is empty yet used; harmonious qi is empty and vacuous, thus serving the Dao’s function. Emptiness and harmony reside in the center—do not lose the nature of emptiness and harmony.\n\n**Chapter on the Conduct of the Heart**\nThe heart has four aspects: the deluded heart, the awakened heart, the cultivated heart, and the verified heart.\n\nThe deluded heart has ten kinds: delusion about affairs, delusion about principles, delusion about teachings, delusion about realms, delusion about qi, delusion about the body, delusion about spirit, delusion about immortality, delusion about the real, and delusion about sageliness.\n\nDelusion about affairs refers to being unable to discern and comprehend all conditioned affairs, whether good or evil, thus generating a confused, attached, and bewildered heart. Lacking the wisdom to employ one’s nature in discerning and choosing, one falls into the cycle of birth and death without reaching the true source.\n\n**The Scripture of Western Ascension** states: \"The Dao probes the most profound, the abyss of emptiness and non-being.\"\n**Laozi** says: \"Profound indeed, it seems the ancestor of the myriad things.\"\n\n**Delusion about principles** refers to having no perception or understanding of the wondrous, empty, and ultimate essence, the natural and true nature, nor of awakening, cultivation, verification, and realization—hence it is called the heart deluded about principles.\n\n**The heart deluded about teachings** arises when the sages intend to guide beings to turn from the mundane toward the real, transforming opposition into accord. As the commentary states: \"The Dao values non-action, while people value action; the Dao is fundamentally without emotion or desire, while people cling to desire and emotion.\" Without encountering a wise teacher or enlightened companion to open the heart, inspire, and point out the teachings of the Three Vehicles—Jade Purity, Numinous Treasure, and Cavernous Spirit—one remains unaware of the sages' wondrous doctrines. Even if one encounters them, one does not generate joy or diligence in seeking and practicing, nor does one contemplate, examine, and investigate the principles to cultivate the heart of liberation. Such a heart exists in name only, as if absent.\n\n**Laozi** says: \"The Dao models itself on spontaneity.\" Those who attain it can speak of it; those who hear it can discourse on it. Yet those who speak do not know that the sage abides in non-action and practices the teaching without words.\n\n**The heart deluded about realms** has two aspects: delusion about the true realm and delusion about the illusory realm. The true realm is the wondrous, fundamental, and spontaneous essence of the great Dao, yet it is obscured by illusion, cutting one off from the true source and severing one from the dust of defilement. As the **Classic** states: \"Constantly without desire, one observes its mystery; constantly with desire, one observes its manifestations.\"\n\nThe **illusory heart** refers to the afflictions of the six senses, the three karmic actions, and the ten unwholesome deeds—discriminating and pursuing conditioned existence in vain. As the **Scripture** says: \"Do not see what can be desired, and the heart will not be disturbed.\" The **Scripture of Western Ascension** states: \"Those who accumulate evil invite evil qi; those who accumulate goodness invite good qi. Those who accumulate goodness are aided by numinous spirits, for the heavenly Dao assists the good.\"\n\n**The heart deluded about qi** arises when people receive the harmonious qi of heaven and earth, which may be clear or turbid. Those who receive clear qi are wise; those who receive turbid qi are foolish. The **Scripture of Fixed Contemplation** says: \"One who extends life for thousands of years is called an immortal; one who refines form into qi is called a perfected person; one who refines qi into spirit is called a spirit person; one who refines spirit to merge with the Dao is called a sage.\"\n\nPeople are deluded about the original harmony and true nature, failing to nurture spirit and cherish qi. Thus, the **Expansive Meaning** states: \"The Dao is non-being; form is being. Being is subject to decay, while non-being endures forever. Those who cultivate the Dao externally secure their form to treasure their being, while internally they preserve their spirit to honor their non-being. By uniting with non-being to merge with the Dao, they attain longevity. Form is the yin po; spirit is the yang hun. Ordinary people possess a modicum of yang qi, yet it does not suffice for immortality; with a modicum of yin qi, they do not attain sagehood. When yin qi is exhausted, one ascends to the ranks of immortals—immortals are pure yang. When yang qi perishes, one becomes a ghost—a ghost is yin qi.\"\n\nThe **Classic** says: \"Concentrate your qi to attain suppleness—can you be like a newborn babe?\" When yang qi is inwardly abundant and one guards the One with virtue, possessing virtue enables one to govern a state; governing a state enables one to embody the Dao; embodying the Dao enables one to govern and transform; governing and transforming enables one to pacify the people. When the people are at peace, the state is at peace, and naturally, all is secure and harmonious. The **Classic** says: \"In loving the people and governing the state, can you practice non-action?\"\n\n**Delusion about the body** has two meanings: first, not knowing that within the body there is qi, spirit, and consciousness, which can be refined through immortal practices to attain the fruit of immortality, through true practices to attain the fruit of perfection, and through sagely practices to attain the fruit of sagehood. The **Scripture of Western Ascension** says: \"The sage is constantly at peace, at one with heaven and earth, and communicates with ghosts and spirits. The multitude are at peace only in what they deem peaceful; what they deem not peaceful is not peaceful to them.\"\n\nSecond, delusion about the body arises when the body is empty of the myriad things, and the heart’s emptiness allows harmonious qi to return to goodness. Those who nurture the body conceal it within itself without revealing it, hide the person within others without being seen. Thus, the sage places the self last yet finds it foremost, sets the self aside yet preserves it. Not knowing the body as the root of suffering, this is called delusion about the body.\n\n**Delusion about spirit** refers to spirit as that which is unfathomable in yin and yang, wondrous in function without fixed form, hidden or manifest, transforming and penetrating without limit—this is called spirit. In heaven, it is called *shen*; on earth, it is called *qi*; in humans, it is called *gui*. The numinous spirit and consciousness within beings cannot refine spirit to merge with the Dao and ascend to sagely fruition. **Zhuangzi** says: \"The myriad things follow their nature and each attains its life.\"\n\n**Delusion about immortality** is the failure to cultivate immortal practices. **Delusion about the real** is the failure to cultivate true practices. **Delusion about sageliness** is the failure to cultivate sagely practices.\n\n**The awakened heart** is the heart that awakens to the Dao. **The cultivated heart** is the heart that cultivates the Dao. **The verified heart** is the heart that verifies the Dao.\n\nWhen the heart severs entangling thoughts, the mind severs false imaginings, and wisdom severs discrimination, then true seeing sees all, while perverse seeing fails to see; true hearing hears all, while perverse hearing fails to hear; true awareness is aware of all, while perverse awareness fails to be aware; true knowing knows all, while perverse knowing fails to know. If true and perverse are both extinguished, and knowing and awareness are both forgotten, one attains the state of forgetting the heart and forgetting the realm. When heart and realm are both forgotten, one merges obscurely with the Dao.\n\nThe **Scripture of Inner Contemplation** says: \"The heart is neither blue nor red, neither white nor yellow, neither long nor short, neither round nor square. Vast, it encompasses heaven and earth; minute, it enters the tip of a hair. Restrained, it halts; released, it rages. Pure and still, it lives; turbid and agitated, it perishes. Illuminating, it shines to the eight limits; obscured, it is deluded in one direction. The difficulty in subduing humans lies solely in the heart. Thus, teaching people to cultivate the Dao is to cultivate the heart; teaching people to cultivate the heart is to cultivate the Dao.\n\nThe heart cannot be stilled—one stills it by contemplating the Dao. The heart cannot be seen—one clarifies it through the Dao. The two paths of good and evil, all worldly dharmas, arise and perish through the heart. Those who practice the Dao extinguish the heart to merge with the Dao; worldly people indulge the heart and endanger the self.\"\n\nThe heart, when active, brings chaos; when extinguished, brings order. Thus, the Son of Heaven establishes officials, clarifies laws, institutes punishments and rewards, and displays fortune and misfortune to encourage people—all because the heart is difficult to govern. Those without a heart are not swayed by commands. Those with a settled heart are not confused by commands. Those who still the heart do not act recklessly. Those who restrain the heart do not fall into disorder. Those who rectify the heart do not stray. Those with a cool heart are not defiled. Those with an empty heart are not attached. Understanding these seven principles, one may speak of the Dao and discuss the cultivation of the heart.\n\n**Cultivating the Dao**\nA person who possesses the Dao is like an echo in a valley. Cultivating the Dao ensures attainment, just as calling out ensures a response. A sharp cry elicits a sharp echo—this illustrates the diligence of superior practitioners. A slow call elicits a slow echo—this illustrates the hesitation of middling practitioners. When the call ceases and no echo responds, this illustrates the neglect of inferior practitioners. Without cultivation, the Dao remains distant.\n\nThus, the sage embraces the profound fullness of loving containment and self-knowledge, while discarding the superficial vanity of the eyes and self-regard. The echo in the valley, like the wondrous and inexhaustible power of spirit, also illustrates longevity and enduring vision. Hence it is said: *\"The valley spirit does not die—this is called the Mysterious Female.\"*\n\nThose who diligently cultivate the Dao refine yin with yang, but if yin qi becomes excessive while yang qi sinks and hides, harmonious qi dissipates, malevolent forces take residence, and aging, illness, suffering, and death swiftly follow. Better to refine yang with yin, reversing old age to return to infancy, confusion to enlightenment, deviation to rectitude, and nothingness to being. The key lies in seeking a teacher, studying diligently, following teachings, and practicing in quiet mountain forests, embracing profound stillness. First, one masters the Orthodox Unity; next, enters the Cavernous Spirit; then advances through the Wondrous Mystery and Numinous Treasure, swiftly attaining the purity of the Cavernous Perfection. Through breath regulation, guiding and stretching, and myriad practices, one ascends to the ultimate fruit of immortality.\n\n**Preserving Life**\nHarmonious qi and spirit-consciousness follow form in life and death, yet the spirit’s nature is truly without birth or death. When form gathers, life arises; when form scatters, death follows. *Zhuangzi* says: *\"There is life, there is death; there is going out, there is coming in. In going out and coming in, no form is seen—this is called the Gate of Heaven.\"*\n\nThere is external nurturing and internal nurturing. Internal nurturing reaches the ultimate of life and death, while external nurturing serves as the master of all things. External nurturing sustains others; internal nurturing sustains oneself. To harmonize with neither life nor death requires the greatest nurturing talent.\n\nAll material beings die when qi scatters and live when qi gathers. Though qi differs in gathering and scattering, spirit knows no distinction of birth and death. Thus, through spirit one employs qi, and through qi one nourishes spirit. When gathered, they unite in accomplishment; when scattered, each operates independently.\n\n*Zhuangzi’s \"Knowledge Wanders North\"* records Shun’s reply: *\"The body is not yours—it is the entrusted form of heaven and earth. Life is not yours—it is the entrusted harmony of heaven and earth. Nature and destiny are not yours—they are the entrusted compliance of heaven and earth.\"* Heaven and earth bind qi to generate a single qi, which flows in compliance above and below.\n\nAwakening to the body, to life, and to nature and destiny, one understands the entrusted form, harmony, and compliance. Thus, when heaven and earth’s qi gathers, life arises; when it scatters, death follows. Life and death are based on qi’s gathering and scattering—a provisional distinction—yet all emerge from formlessness. Formlessness is the true constancy, hence without birth or death.\n\nNow, preserving life means governing the arising of emotions and desires. If emotions and desires arise, they obstruct the true and constant nature. Just as preserving life is thus, so too is governing a state.\n\nIf one extensively employs schemes, expands territory, accumulates wealth, and exalts palaces, indulging in ease, luxury, and endless craftiness, one loses the pure and true nature. Once the true nature is lost, true transformation fails, madness and deviance enter the heart, and one cannot rectify oneself, losing authority. Having lost authority, flatterers gain influence, and one not only forgets the principle of preserving life but also forfeits the way to sustain the state’s prosperity. If the body is free from illusory burdens, lifespan extends; ancestral temples endure, and the state remains eternally secure.\n\nThose who preserve life also preserve the state; those who cultivate the Dao also preserve life. This begins by diminishing right and wrong, abandoning arrogance, curbing desires, and forgetting fame and profit. Then, one defends against the assaults of the five colors in the colorless, the five sounds in the soundless, and the five flavors in the tasteless. Do not gallop through the six dusts or rush through the three realms. When ears and eyes perceive nothing, the heart cuts off thought, qi flows harmoniously, spirit does not leave the body, and the body does not leave the spirit. Spirit and body guard each other, and the path of immortality and long life is achieved—the way of preserving life is fulfilled.\n\nPerceiving the emptiness of sound and color, awakening to the insubstantiality of form, with spirit clear and will tranquil, virtue profound and Dao lofty, one does not sink into the pitfalls of life and death but naturally arrives at the boundless mystery.\n\n*The Scripture of Western Ascension* says: *\"To pity others is not as good as cherishing the body; to cherish the body is not as good as loving the spirit; to love the spirit is not as good as containing the spirit; to contain the spirit is not as good as guarding the true. Guarding the true ensures long endurance.\"*\n\nIt also says: *\"The spirit loves people, but people do not love the spirit.\"* Thus, Laozi teaches people to nurture spirit and qi—this is the art of preserving life.\n\n**Governing the State**\nGoverning the world, the state, the family, or the self—none can be rectified without virtue and the Dao. A state governed by non-action simplifies affairs; governed by action, affairs multiply. Simplified affairs calm the heart; multiplied affairs confuse the people. A calm heart stabilizes the state; a confused people endanger it. To leave danger and attain stability, tranquility is the Dao.\n\nThe *Scripture* states: *\"Thus the sage embraces the One and becomes the model for all under heaven.\"* It also says: *\"Know the white, yet guard the black, and become the model for all under heaven.\"* Following heaven and emulating earth, they expand the work of nurturing and sustaining, yet forget their merit and form, never presuming to exalt themselves above the world. The *Scripture* further says: *\"One who values their body for the sake of the world may be entrusted with the world; one who cherishes their body for the sake of the world may be confided with the world.\"* It also states: *\"The sage does not act great, and thus achieves greatness; acting without attachment, accomplishing without dwelling. Bearing the nation’s disgrace, they become the lord of the altars of soil and grain; bearing the nation’s misfortune, they become the king of all under heaven.\"* Only then, regarding the common people as straw dogs, governing a great state as if frying a small fish—such is Laozi’s solemn exhortation. They do not exalt the worthy, do not prize treasures, regard all things as equal, and take humility as their foundation. They do not indulge in warfare, lighten taxes and corvée, avoid arrogance and pride, and eschew extravagance and excessive desires. They know that those who secretly indulge in wine and lust within the imperial domain, who exhaust the farming and weaving masses, who covet rare treasures and exotic beasts from distant lands, and who wear out the people of water and land—such rulers do not uphold the Dao and virtue, and their states cannot be well-governed. Governing the world with non-action and transformation brings order; governing with action breeds the seeds of chaos. The *Scripture of Great Peace* says: *\"Only in purity and stillness does one know the origin of the governing Dao.\"* The Heavenly Perfected One said to the Yellow Emperor: *\"I have never heard of one who governs their body yet fails to govern their state.\"* The body of one person is the image of a state: the position of the chest and abdomen is like the palace, the limbs like the suburbs and borders, the joints like the hundred officials, the spirit like the ruler, and qi like the people. To know how to govern the body is to know how to govern the state. Loving the people brings stability to the state; comprehending qi preserves the body. What is lost cannot be restored; the dead cannot be revived. Thus, the perfected one dissolves calamities before they arise and governs illnesses before they manifest. Qi is difficult to nurture yet easy to disperse; the people are difficult to gather yet easy to scatter. Govern before matters arise, not after they have passed.\n\n**The Two Methods**\nThe two methods of the vast and the subtle: the spirit is subtle while qi is vast; qi is subtle while form is frail. Refining conduct and cultivating the true, seeking the supreme Dao—one may refine form to merge with qi, refine qi to merge with spirit, and refine spirit to unite with the Dao. Cultivating spirit without cultivating qi leads to the extinction of qi and the end of form. Cultivating qi without cultivating spirit merely prolongs life, yet the Dao remains distant. Absorbing qi and refining the heart, harmonizing the pure and true, practicing breath control and meditation, stillness attaining great harmony—spirit and qi flow unimpeded, the mind’s terrace becomes radiant and vast, the elixir scene settles and congeals. The ordinary form then reverts to the true body—why wait for another life? Moreover, delusion makes one ordinary; awakening makes one a sage. One may employ the Three Vehicles—Small, Medium, and Great—to traverse the subtle and vast, or ascend through the Three Clarities to experience their vastness and subtlety, or pass through the Nine Heavens to do the same, or refine the Five Qi to traverse their health and subtlety, or align with the Three Powers to experience their frailty and subtlety, or observe the gates of perception to discern their vastness and subtlety, or divide the hun and po to distinguish their refinement, or take form as frail and the formless as subtle, or take the Dao and virtue as subtle and benevolence and righteousness as coarse. The *Scripture* says: *\"The greatest image has no form.\"* The *Western Ascension Scripture* states: *\"Nothing in the world is softer than qi; nothing is softer than the Dao.\"* The Dao is the substance of non-action; qi is formed by yin and yang. The Dao envelops heaven and earth and permeates the ten thousand methods. The *Scripture of Southern Florescence* says: *\"It encompasses all without exclusion, entering subtly into the finest details.\"*\n\n**Observation and Cultivation**\nTo observe is to observe the illusory, dreamlike body; to cultivate is to cultivate the conduct of the Dao and virtue. Forgetting the body and forgetting cultivation, one naturally enters the realm of mysterious penetration. Bound to form and conduct, one sinks into the source of life and death. Observation is wisdom. With wisdom, one observes principle; principle and wisdom merge, naturally aligning with the Middle Way. The *Scripture of the Origin* says: *\"Possessing all wisdom, one accomplishes the supreme Dao.\"* Using the eyes to see things is called observation; using the spirit to reflect is called observation. Externally, one withers the ten thousand images; internally, one stills the myriad thoughts—cultivating the heart and myriad practices is called observation. Cultivation leads to entering the wondrous and formless, gradually ascending the sagely path—this is the way of practice. The *Scripture of Karmic Retribution* says: *\"Tormented by all suffering, constantly bound to the body, trapped in the cycle of birth and death, unable to escape—by what means can delusive thoughts be eliminated?\"* The Most High said: *\"Delusive thoughts and inversions all arise from the heart. Forcibly creating distinctions, fixating on the self, encountering circumstances and becoming confused—every thought is delusion. By this, one drifts and sinks into the cycle of birth and death. One should instead focus the mind and observe the body, seeing it as entirely illusory. Once knowing its illusory nature, delusive thoughts gradually fade; once delusive thoughts fade, inner and outer become pure. Awakening to the Dao is called forgetting the body; having forgotten the body, the illusions of bondage naturally vanish.\"* *Zhuangzi* said: *\"Abiding in timeliness and following nature, even a single morning’s joy does not intrude—this is the perfected one’s forgetting of the body.\"* From the ordinary to the sagely, none surpass the four methods of seeing, cultivating, accomplishing, and benefiting. Seeing has two aspects: first, encountering good companions and discussing true scriptures, or personally studying the teachings and advancing in practice; second, inwardly perceiving the subtle and mysterious, gradually attaining purity and stillness, reaching the utmost wonder. Cultivation has three aspects: the Small Vehicle, the Medium Vehicle, and the Great Vehicle. Accomplishment has three aspects: the fruit of immortality, the fruit of the true, and the fruit of the sage. Benefiting has three aspects: those who attain the three fruits each expound the teachings, guiding all beings and benefiting the age. These four methods arise from the unexcelled Dharma and enter the unexcelled Dharma, existing for the sake of benefiting and saving. Merging into the wondrous body, they return to the One—without right observation, there is no cultivation or realization.\n\nThe Treatise on the Great Dao Concludes",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大道论 经名：大道论。 五代末（或北宋）周因朴着。 一卷。 底本出处：《正统道藏》太玄部。 大道论 周固朴着 至道章 道者至虚至寂，真性真常，冠五气而播三才，布一真而生万象，离合无际，天地有宗，超出神明，靡该意象，无名无氏，有动有常，离四句六因，绝名言譬喻。 《南华真经》云：在太虚之表而不为高，在六极之下而不为深。 世有生灭，道无生灭，物有变异，道无变异。 《易》曰：道者虚无之称。 以虚无而通於物，故称曰道，无不通，无不由也。 又道为母，德为子。 《无惑宝经》云：道者通物，以无为义，德者不失，以有为功。 《西升经》云：道深甚奥。 又云：至道深妙，知者不言。 当火水焚荡无遗，我大道真常不动； 值天地纲纪嫦裂，我大道湛寂凝然。 庄生考算数，而五载莫穷，推阴阳而十二年固 得，故曰至道。 至德章 道有通生之德，故云至德。 圣人云：以通生故，字道； 包含故，名大。 又解：虚无者，妙本之体，非有物故； 自然者，妙本之性，非造作故； 道者，妙本之功用，故谓之通生之道。 一虚无，二自然，三道，俱是妙本真性。 上义立其法唯一原。 夫散大朴而统御九围，播元精而轮排万象，始气权敞，三才具分，四序肇兴，五行迭旺，大哉。 天地掌其覆载，日月职其照临，风雨散滋，云雷布鼓，人兽清浊，海岳高深，类聚群分，智凡殊禀。 向道者登真证圣，背道者趋死沈生，咸归我大道通生之至德。 庄生云：德者，得也。 物得之以生，谓之德。 德者道之用也，道者德之体也。 通生万象，造化有为有不为也，至德无为无不为也。 《老君道记》云：通於一而万事毕，无心得而鬼神服。 通於天地者德也，行於万物者道也。 天下至通也。 万物是所生，德是能生，无万物之为所生，不能显德之为能生。 《太平经》云：德者正相德也，成者成济也，不丧者不失也，具三上义。 又德者，天地禀之，阴阳赖之，五行得以相生，四时得以纶绪，王侯理化，师友训从，乃至圣人、真人、仙人、鬼神，异类动植，皆资至德之妙用也。 谓以道有情有信也，可谓至德。 垂教章 上古无教，教自三皇五帝以来。 教者，告也。 有言、有理、有义、有授、有传，言则宣，教则告。 因言悟教，因教明理，理明则忘言，既有能教、所教，须有能师、所师。 则有自然之教、神明之教，此二教无师资也。 神明之教义，说则有据，理则无有。 正真之教、三皇五帝之教、返俗之教、训世之教，宜分权实，具斯五教，启自一真。 自然之教者，元气之前，淳朴未散，杳冥寂尔，浩旷空洞，无师说法，无资受传，无终无始，无义无言，元气得之而变化，神明得之而造作，天地得之而覆载，日月得之而照临，上古之君得而无为，无教之化也。 神明之教者，朴散为神明，夫器莫大於天地，权莫大於神明，混元气而周运，吋至道而裁成，整圆清而立天，制方浊而为地，溥灵通而化世界，轶和气而成人伦。 阴阳莫测其兴亡，鬼神不知其变化。 正真之教者，无上虚皇为师，元始天尊传受，洎乎玄粹，秘於九天，正化敷於代圣，天上则天尊於三清众天，大弘真乘，开导仙阶； 人问则伏羲受图，轩辕受符，高辛受天经，夏禹受洛书，四圣禀其神明，五老现於河渚，故有三坟五典、常道之教。",
      "translated_text": "**Treatise on the Great Dao**\n\n**Title:** *Treatise on the Great Dao*\nAuthor: Zhou Yinpu of the late Five Dynasties period (or Northern Song)\nOne fascicle.\nSource text: *Daoist Canon of the Orthodox Tradition*, *Great Mystery Section*\n\n---\n\n### **Treatise on the Great Dao**\n**By Zhou Gudu**\n\n#### **Chapter on the Supreme Dao**\nThe Dao is supremely empty and supremely quiescent, the true nature and true constancy. It crowns the five qi and propagates the Three Powers, spreading the One Reality to give rise to the ten thousand images. It is without bounds in separation or union, the ancestral root of Heaven and Earth, transcending the numinous and the luminous, encompassing all without being confined to form or concept. It is nameless and without lineage, yet possesses movement and constancy. It transcends the four propositions and six causes, beyond names, words, and analogies.\n\nThe *True Scripture of Southern Florescence* states: *\"Beyond the vastness of the Great Void, it is not exalted; beneath the six directions, it is not profound.\"*\n\nThe world has arising and ceasing; the Dao has no arising or ceasing. Things undergo transformation and alteration; the Dao knows no transformation or alteration.\n\nThe *Book of Changes* says: *\"The Dao is the designation of the empty and the nonexistent.\"*\n\nAs the empty and nonexistent penetrate all things, it is called the Dao—nothing is not pervaded by it, nothing does not proceed from it.\n\nMoreover, the Dao is the Mother, and virtue is the Child.\n\nThe *Treasure Scripture of No Delusion* states: *\"The Dao pervades things, its meaning lying in nonaction. Virtue does not lose itself, its achievement lying in action.\"*\n\nThe *Scripture of Western Ascent* says: *\"The Dao is profoundly abstruse.\"* And again: *\"The Supreme Dao is deeply subtle; those who know it do not speak.\"*\n\nWhen fire and water scour and consume without remnant, my Great Dao remains true and constant, unmoved. When the warp and woof of Heaven and Earth unravel and shatter, my Great Dao abides in profound stillness, serene and unchanging.\n\nZhuangzi calculated and reckoned for five years yet could not exhaust it; he pondered yin and yang for twelve years before finally grasping it—thus it is called the Supreme Dao.\n\n#### **Chapter on the Supreme Virtue**\nThe Dao possesses the virtue of all-pervading generation, hence it is called Supreme Virtue.\n\nThe Sage says: *\"Because it pervades generation, it is named the Dao; because it encompasses all, it is called the Great.\"*\n\nAnother explanation: The empty and nonexistent is the essence of the wondrous origin, for it is not a thing. The spontaneous is the nature of the wondrous origin, for it is not artificially made. The Dao is the functioning of the wondrous origin, hence it is called the Dao of all-pervading generation.\n\nThe empty and nonexistent, the spontaneous, and the Dao—all three are the true nature of the wondrous origin. The highest principle establishes its law as the One Source.\n\nWhen the Great Uncarved Block scatters, it governs the nine domains; when the primordial essence is disseminated, it arranges the ten thousand images in their revolutions. The primal qi begins its sway, the Three Powers are fully apportioned, the four seasons commence their succession, and the five phases take turns in ascendancy—how vast!\n\nHeaven and Earth bear the burden of covering and supporting; the sun and moon fulfill their duty of illumination. Wind and rain disperse nourishment; clouds and thunder spread their drumming. Humans and beasts, pure and turbid; seas and mountains, high and deep—all gather in kinds and divide into groups, their wisdom and foolishness differing in endowment.\n\nThose who turn toward the Dao ascend to truth and attain sagehood; those who turn away from it hasten toward death and sink into transmigration—all return to the Supreme Virtue of the Great Dao’s all-pervading generation.\n\nZhuangzi says: *\"Virtue is attainment. Things attain it and thereby live—this is called virtue.\"*\n\nVirtue is the functioning of the Dao; the Dao is the essence of virtue. In all-pervading generation of the ten thousand images, creation acts and refrains from acting; Supreme Virtue acts not, yet there is nothing it does not do.\n\nThe *Record of the Dao of Lord Lao* states: *\"Pervade the One, and the ten thousand affairs are complete; attain the mindless, and ghosts and spirits submit.\"*\n\nThat which pervades Heaven and Earth is virtue; that which courses through the ten thousand things is the Dao. The world is supremely pervading.\n\nThe ten thousand things are what is generated; virtue is what generates. Without the ten thousand things as what is generated, the generating power of virtue cannot be manifest.\n\nThe *Scripture of Great Peace* says: *\"Virtue is upright mutual benefaction; completion is the achievement of salvation; non-loss is non-deviation—these three embody the highest principle.\"*\n\nMoreover, virtue is what Heaven and Earth receive; yin and yang rely upon it; the five phases attain mutual generation through it; the four seasons attain their orderly progression through it. Kings and lords govern and transform; teachers and friends instruct and follow—even sages, perfected ones, immortals, ghosts, and spirits, as well as the myriad kinds of moving and growing things, all depend on the wondrous functioning of Supreme Virtue.\n\nThus, the Dao possesses sentiment and trustworthiness—this may be called Supreme Virtue.\n\n#### **Chapter on Transmitted Teachings**\nIn high antiquity, there was no teaching; teaching began with the Three Sovereigns and Five Emperors.\n\nTeaching is instruction. It involves speech, principles, meaning, transmission, and conveyance—speech proclaims, teaching instructs. Through speech, one awakens to teaching; through teaching, one clarifies principles. When principles are clear, speech is forgotten. Since there is one who teaches and one who is taught, there must be one who instructs and one who is instructed.\n\nThus, there are the teachings of spontaneity and the teachings of the numinous and luminous—these two teachings require no master or disciple.\n\nThe teachings of the numinous and luminous have grounds for their discourse but no basis in principle.\n\nThe teachings of true correctness, the teachings of the Three Sovereigns and Five Emperors, the teachings of returning to the common, and the teachings of instructing the world—these should be distinguished in their provisional and real aspects. All five teachings originate from the One Reality.\n\nThe teachings of spontaneity: Before primordial qi, when simplicity was undispersed, there was profound obscurity and quiescence, vast emptiness and boundlessness. No master preached the Dharma, no disciple received transmission. Without beginning or end, without meaning or words—primordial qi attained it and transformed; the numinous and luminous attained it and created; Heaven and Earth attained it and covered and supported; the sun and moon attained it and illuminated. The rulers of high antiquity attained it and ruled through nonaction—this was the transformation without teaching.\n\nThe teachings of the numinous and luminous: When simplicity dispersed, it became the numinous and luminous. No vessel is greater than Heaven and Earth; no authority is greater than the numinous and luminous. They blend primordial qi in their revolutions, accord with the Supreme Dao in their regulation, adjust the round and pure to establish Heaven, and fashion the square and turbid to form Earth. They universally pervade and transform the world, surpass harmonious qi to perfect human relations. Yin and yang cannot fathom their arising and ceasing; ghosts and spirits do not know their transformations.\n\nThe teachings of true correctness: The Supreme Void Emperor is the master; the Celestial Venerable of Primordial Beginning transmits the teaching. Passing through the mysteries and purities, it is concealed in the Nine Heavens. Correct transformation is bestowed upon the sages of the age. In the heavens, the Celestial Venerable is honored among the Three Clarities and the host of heavens, greatly propagating the true vehicle and opening the path to immortality. In the human realm, Fuxi received the Chart, Xuanyuan received the Talisman, Gaoxin received the Heavenly Scripture, and Yu of Xia received the Luo Writing. The Four Sages received the numinous and luminous; the Five Elders appeared on the river islets. Thus, there are the Three Tombs and Five Classics—the teachings of the Constant Dao.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1259,
      "start_sentence": 0,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.34627652168274,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "返俗之教者，玄元大圣，帝舜时理国理家，灵文真诀大布人问，金简玉章广弘天上，切欲令天上天下，还淳返朴，复契皇风。 训世之教者，夫子伤道德丧，阐仁义之教，化乎时俗，将礼智而救乱原，淳厚之风远矣，华薄之风行矣。 噫，教出圣人救世愍物之心，物心悟教则同圣心，圣心则权实双亡，言诠俱泯，此际方契不言之教，意象固无存焉。 绝义章 大道谓修者曰：假设告喻，莫氏族我，无生处无氏姓一，故无族。 莫名字我，约生长之德，字之日道，隐而不显也，莫知其体性，故但字而不名也。 莫尊卑我，处谦下，象地不尊也，为臣尊道贵德，不卑也。 莫视听我，非是色法故不可视，非是声法故不可听。 莫毁誉我，无乖失故不可毁，无矜街故不可誉。 莫利害我，无所欲故不可利，)物故不害。 莫是非我，不徇俗与物反，无是； 难诸过患，无非。 莫逆顺我，逆俗耳不顺也，)天道不逆也。 莫高下我，则地故下不高，法天故高不下。 莫大小我，持秋毫而不大，符天地而不小。 莫空有我，有用物情不空也，无为虚寂不有也。 莫贵贱我，不矜功而待命，不贵； 虞天地之先，不贱。 莫智愚我，抱朴无智，含德无愚。 莫先后我，无始故不先，无终故不后。 莫静乱我，众德发，生不静； 类聚群分，不乱。 莫得失我，外无一物，不得； 内合真性，不失。 莫爱憎我，无恶故不憎，无好故不爱。 莫向背我，无形故不向，同道故不背。 莫宠辱我，不矜功街德，不可宠； 无骄逸慢息，不可辱。 莫方圆我，无边际，不可方隅； 无形质，不可规圆。 莫明暗我，若昧不明也，在上不缴； 见小日明，在下不昧。 莫新旧我，无初而不新，无末而不旧。 莫进退我。 不进着空，不退着有，不为上士而进，不为下士而退。 修者如此，我亦如此，同无别也。 道子来，道子来，余恐子执着譬喻法数，而失道性。 恐众生执教，滞教下义计有法，当情而在边缴，愚者不知病息药亡，得鱼弃荃，执教滞言护喻，而失冲和真常也。 分别章 夫心情、识智、意智，皆从道妄立也。 道外无心，心外无道，即心即道也。 其情识智意知亦然。 芟悟道之心，剪认道之识，松证道之智，除得道之智，萝了道之意，则忘知、忘意、忘智、忘识、忘心，则自无求道、趣道、学道，斯得道矣。 此则除修者执踪迩也，是真得道，是真得一。 若执道执一，去道远矣。 若忘道忘一，得道得一矣。 三体既异，二生不同，有自体之体，道之本性也。 有为体之体，道与万象为依也。 有仿象之体，如体道性修行，以至无为也。 夫生有二，有能生之生，是道生万物之生也； 有从生之生，是万物从道而生也。 悟之者修，修而必得圣人也。 迷之者不修，凡人也。 不滞圣凡者悟，滞圣凡者迷。 了迷悟而是空，达圣凡而俱泯。 是以出色空、权实、言教、相待、形分、有无，真得道矣。 道非言智，假言智而达自然。 德非有为，·因有为而显真用也。 故启乎二十四门，以闭其五户，所谓澄照深静门、道体虚极，湛然清泠，鉴物无私，隐奥玄应。 天圣无心门、天地无私，覆载万物，生长不失其时； 圣人无私，化理黎庶，乐在清平。 虚应贯通门、大道无心，贯通万有，自然清静，离有离无。",
      "translated_text": "The Teachings of Returning to Simplicity:\nThe Great Sage of the Mysterious Origin, during the reign of Emperor Shun, governed state and family, widely disseminating the numinous scriptures and true precepts among humanity. The golden tablets and jade chapters broadly propagated the Way in the heavens above. His earnest desire was that both heaven and earth return to purity and simplicity, restoring the august wind of antiquity.\n\nThe Teachings of Instruction for the World:\nThe Master lamented the loss of the Dao and virtue, expounding the teachings of benevolence and righteousness to transform the customs of the age. He employed ritual and wisdom to remedy the roots of chaos. Yet the wind of sincerity and depth has long faded, and the current of superficiality and shallowness prevails.\n\nAlas! Teachings arise from the sagely heart that pities the world and cherishes all beings. When the hearts of beings awaken to the teaching, they harmonize with the sagely mind. In the sagely mind, both expedient and real vanish; words and explanations dissolve entirely. Only then does one accord with the teaching beyond speech, where intent and image no longer abide.\n\n**Chapter on Transcending Distinctions**\nThe Great Dao addresses the cultivator, saying:\nSuppose it were named by clan—I have no birthplace, no clan, no surname. Thus, I have no clan.\nSuppose it were named by name—restricting the virtue of growth and longevity, it is called the Dao, hidden and not manifest. Its essence and nature are unknown, so it is only named by appellation, not by designation.\nSuppose it were ranked by honor and humility—it dwells in modesty and lowliness, emulating Earth, which is not exalted. As a servant, it honors the Dao and esteems virtue, thus not base.\nSuppose it were perceived by sight and hearing—it is not a form of color, so it cannot be seen; it is not a sound, so it cannot be heard.\nSuppose it were subject to slander or praise—it commits no transgressions, so it cannot be slandered; it bears no arrogance, so it cannot be praised.\nSuppose it were affected by benefit or harm—it has no desires, so it cannot be benefited; it is without obstruction, so it cannot be harmed.\nSuppose it were judged by right or wrong—it does not follow worldly customs, opposing things, so it has no right; it avoids faults and calamities, so it has no wrong.\nSuppose it were opposed by compliance or defiance—defiance is merely not conforming to the world, yet the Dao of Heaven is not defiant.\nSuppose it were measured by high or low—it emulates Earth, thus low and not high; it models Heaven, thus high and not low.\nSuppose it were measured by great or small—grasping a autumn hair, it is not great; aligning with Heaven and Earth, it is not small.\nSuppose it were defined by emptiness or existence—it has function and responds to things, so it is not empty; it is non-action and quiescent, so it is not existent.\nSuppose it were ranked by nobility or baseness—it does not boast of merit but awaits destiny, so it is not noble; it precedes Heaven and Earth, so it is not base.\nSuppose it were judged by wisdom or foolishness—embracing simplicity, it has no wisdom; containing virtue, it has no foolishness.\nSuppose it were ordered by before or after—it has no beginning, so it is not before; it has no end, so it is not after.\nSuppose it were distinguished by stillness or chaos—when all virtues manifest, life is not still; when kinds gather and groups divide, it is not chaotic.\nSuppose it were defined by gain or loss—externally, there is not a single thing, so nothing is gained; internally, it harmonizes with true nature, so nothing is lost.\nSuppose it were bound by love or hatred—it has no aversion, so it does not hate; it has no preference, so it does not love.\nSuppose it were oriented by facing or turning away—it is formless, so it does not face; it is one with the Dao, so it does not turn away.\nSuppose it were subject to favor or disgrace—it does not boast of merit or parade virtue, so it cannot be favored; it is without arrogance, indolence, or negligence, so it cannot be disgraced.\nSuppose it were confined by square or round—it has no boundaries, so it cannot be square; it has no form, so it cannot be round.\nSuppose it were distinguished by brightness or darkness—if dim, it is not bright above; perceiving the small is called brightness, so it is not dim below.\nSuppose it were judged by new or old—without beginning, it is not new; without end, it is not old.\nSuppose it were measured by advance or retreat—it does not advance into emptiness, nor retreat into existence. It does not advance for the superior person, nor retreat for the inferior.\n\nCultivator, be thus; I, too, am thus. There is no difference between us.\n\nO Dao-disciple, come! O Dao-disciple, come! I fear you will cling to parables, methods, and doctrines, losing the nature of the Dao. I fear beings will grasp the teaching, stagnate in its literal meaning, and calculate existence, becoming entangled in partiality and extremes. The foolish do not realize that when the illness ceases, the medicine is no longer needed. They catch the fish but discard the trap, clinging to the teaching and its words, guarding its metaphors, and losing the harmonious and true constancy.\n\n**Chapter on Distinctions**\nThe emotions of the heart, the perceptions of consciousness, the intentions of the mind—all arise falsely from the Dao. Beyond the Dao, there is no heart; beyond the heart, there is no Dao. Heart and Dao are one. The same applies to emotions, perceptions, intentions, and knowledge.\n\nSever the heart that awakens to the Dao; prune the consciousness that recognizes the Dao; loosen the wisdom that verifies the Dao; remove the knowledge that attains the Dao; untangle the intentions that comprehend the Dao. Then, forget knowledge, forget intention, forget wisdom, forget perception, forget the heart. Naturally, there will be no seeking, no pursuing, no learning of the Dao—this is attaining the Dao. This is truly removing the cultivator’s attachments to traces and proximity, truly attaining the Dao, truly attaining the One.\n\nIf one clings to the Dao or the One, one strays far from the Dao. If one forgets the Dao and the One, one attains the Dao and the One.\n\nThe three bodies differ; the two births are not the same. There is the body of self-nature—the original nature of the Dao. There is the body of function—the Dao and the myriad phenomena as interdependent. There is the body of emulation—like embodying the Dao’s nature through cultivation, reaching non-action.\n\nThere are two kinds of birth: the birth that can generate—the Dao giving birth to the myriad things; and the birth that is generated—the myriad things born from the Dao. Those who awaken cultivate; through cultivation, they necessarily attain sagehood. Those who are deluded do not cultivate—they remain ordinary. Those who do not stagnate in sagehood or ordinariness awaken; those who stagnate in sagehood or ordinariness are deluded. Understanding delusion and awakening is emptiness; comprehending sagehood and ordinariness is dissolution.\n\nThus, transcending form and emptiness, expedient and real, verbal teachings, mutual dependence, distinctions of form, and existence and non-existence—this is truly attaining the Dao.\n\nThe Dao is not words or wisdom; it borrows words and wisdom to reach naturalness. Virtue is not action; it relies on action to manifest its true function.\n\nTherefore, open the twenty-four gates to close the five senses. These are:\nThe Gate of Profound Clarity and Deep Stillness—The body of the Dao is supremely void, profoundly clear and cool, reflecting things without partiality, its mysterious responses hidden and subtle.\nThe Gate of Heavenly Sage without Mind—Heaven and Earth are impartial, covering and supporting the myriad things, nurturing and growing them without missing their seasons. The sage is impartial, transforming and governing the people, delighting in clarity and peace.\nThe Gate of Empty Response and Pervasive Connection—The Great Dao is without mind, pervading the myriad existences. Naturally clear and still, it transcends both existence and non-existence.",
      "overlap_context": ", the Celestial Venerable is honored among the Three Clarities and the host of heavens, greatly propagating the true vehicle and opening the path to immortality. In the human realm, Fuxi received the Chart, Xuanyuan received the Talisman, Gaoxin received the Heavenly Scripture, and Yu of Xia received the Luo Writing. The Four Sages received the numinous and luminous; the Five Elders appeared on the river islets. Thus, there are the Three Tombs and Five Classics—the teachings of the Constant Dao.",
      "start_char": 1259,
      "end_char": 2472,
      "start_sentence": 57,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.116092681884766,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "如神不竭门、妙有清静，应物无方，未曾暂休，如神之妙。 深静生长门、万物自道而生成，资禀於自然之化。 谦柔济物门、修道之人柔弱，以德精持，济物无倦。 专一无知门、抱守冲和一气，未解分别尘事。 有无相资门、虚无假於形质，形质假於虚无，有用无因，故云相资。 天地人物万象，谓之形质，为有也，道用为无也。 迷真逐境门、世人但贪俗学，执着有为，迷失真源，沉埋声色。 含容守固门、抱道坤和，宽裕雌静； 如婴儿守固，若溪谷含容。 形残不晓门、矜巧街功，何异形残，迷执暗中，故云不晓。 四法同喻门、经云修道之人，若涉）畏邻似容，如冰洁冷闲默。 不为王宰门、上古帝王淳化无私，天下来朝，帝王不矜街道德，执我能为。 不彰权智门、帝王治国权法，不可示人。 非人得权为矫诈，恣行残害，自招殃祸。 不矜器用门、古帝王无矜文耀武，不自尊高，体冥至道，心合无为。 处中不尚门、不在无不在，有不居尘境，不去顽空，不求边彻。 探固根性门、深守本性，自得长生，神气不荒，自无嗜欲。 化理无挠门、治国刑法多，则民散，守一致，则民淳，散为乱本，淳为理原。 故经云烹鲜而不挠指物显德门、动作有为，不如静归无事．； 驷马珪璧，不如大宝神器。 从微积着门、新修至道，必见成功，久视长生，高升仙界。 谦下成大门、理国卑下，万民乐推，万姓归之，以成大业。 修身宝德门、经云慈悲、俭约、谦逊，为理身修德之源； 贪毒谄谀，为招祸灭身之本，故以德为宝。 巧匠无伤门、君王行刑，不如天道春夏秋冬之令，苦代天之杀，必虑过伤，天巧而不拙，故无误焉。 天道平普门。 天道抑高而举下，抚弱而遏强，祸淫而福谦，喊多而补少。 闭五户者，所谓智、仁、义、巧、利，防慎舍除等。 远近章 圣欲立言显理，故有性分。 然圣言则称实之言，凡言则涉妄，故有进退、疑次、殊异。 道体则本无迷悟，悟无可悟，笑无可笑，进未必得，退未必失，不见三士，是真上士。 有近知近，变迷成悟，亲近修学。 有知近不近，常说无为之教，不修无为之行，是知近而不近也。 有近不知近，尘迷境惑，不悟真源，不知即尘而有妙极。 远不知远，悟了深远，不着深远，深远不当情，故不知远。 有远而知远，悟深远，已知众生有深远性，而见身应化，演道利人，合同深远。 行而不到，虽久修习而上执行，执行当情，未造虚极。 不知行，不悟教法，修行无导师指示。 不知到，不知造极之门，无所趣入，故不知到。 有不行到，不见已行，不见已到，而冥妙本，故不行到。 到而自化。 得到真寂，玄德内明，不教不言，而自淳化。 用道章 用道则约人，道用则约妙本。 道忘，其德无为也。 虚忘，造极也。 德得，如得恩德也。 人则仿道效德，契自然之用也。 人生也，大道胤气，至精授灵，三元凝神，五行结粹，既禀有精之质，元分无用之功，时小朴而无物敢拒，持大象而有形皆往。 同道同德之人，柔弱固於婴儿，处通妙於玄牝，不分心境，齐彼死生，与天地自然，顺阴阳动静也。 上古用道之君，虚心利物，体道化民，职四辟而普周，掌六通而独立，杜绝视听，黜陆聪明，不束教滞言，不凝情着物，植三一之宗本，固生长於真原，剪四六之苗根，绝蔓衍於灵府，不矜大功之巧，岂务小成之辩。",
      "translated_text": "The Gate of Spirit Unfailing—Subtle existence is pure and still, responding to things without fixed form, never resting even for a moment, as wondrous as the spirit.\n\nThe Gate of Deep Stillness and Growth—The myriad things arise and take form from the Dao, drawing sustenance from the transformations of nature.\n\nThe Gate of Humility and Benefiting Others—Those who cultivate the Dao are yielding and soft, holding fast to virtue with purity, aiding others without weariness.\n\nThe Gate of Single-Minded Unknowing—Embracing and guarding the harmonious unity of qi, not yet discerning the distinctions of worldly affairs.\n\nThe Gate of Interdependence of Being and Non-Being—Vacuity borrows form, and form borrows vacuity; being arises from non-being, hence they are said to rely on one another. Heaven and Earth, humans and all phenomena are called \"form,\" which is being; the function of the Dao is non-being.\n\nThe Gate of Delusion and Pursuing Phenomena—Worldly people merely covet mundane learning, clinging to action and losing the true source, sinking into the depths of sound and color.\n\nThe Gate of Embracing and Holding Fast—Holding to the Dao with the harmony of Earth, expansive and yielding, still and receptive; like an infant holding fast, or a valley embracing all.\n\nThe Gate of Crippled Form and Ignorance—Those who boast of skill and parade merit differ not from the crippled; deluded and clinging in darkness, hence called ignorant.\n\nThe Gate of Four Analogies in One Teaching—The scriptures say: Those who cultivate the Dao are like one crossing a river, fearful of neighbors yet appearing composed; like ice, pure and cold, serene and silent.\n\nThe Gate of Not Acting as Ruler—The emperors of high antiquity governed with pure transformation and impartiality; though all under heaven came to pay homage, they did not boast of their virtue or power, nor claim their own ability.\n\nThe Gate of Not Displaying Authority and Wisdom—The laws and strategies by which emperors govern the state must not be shown to others. If unworthy men gain power, they will act with deceit, indulging in cruelty and bringing calamity upon themselves.\n\nThe Gate of Not Boasting of Instruments and Tools—The ancient emperors did not flaunt civil or military prowess, nor exalt themselves; embodying the supreme Dao, their minds aligned with non-action.\n\nThe Gate of Abiding in the Center Without Preference—Neither dwelling in non-being nor clinging to being, not residing in the dusty world, not fleeing to dull emptiness, not seeking extremes or thoroughness.\n\nThe Gate of Probing the Root of Nature—Deeply guarding one’s original nature, one naturally attains longevity; spirit and qi do not scatter, and desires do not arise.\n\nThe Gate of Unperturbed Transformation and Governance—When a state relies on many punishments, the people scatter; when it holds to the One, the people are pure. Scattering is the root of chaos; purity is the origin of order. Thus, the scriptures say: Cooking a small fish requires no stirring.\n\nThe Gate of Manifesting Virtue Through Things—Active doing and striving are not as good as returning to stillness and non-action; four-horse chariots and jade tablets are not as precious as the great treasure of the numinous vessel.\n\nThe Gate of Accumulating from the Subtle to the Manifest—Those newly cultivating the supreme Dao will surely see success; with long vision and longevity, they ascend to the immortal realms.\n\nThe Gate of Humility and Great Achievement—Governing a state with humility, the people joyfully support and follow; the myriad families gather to it, thus accomplishing great enterprise.\n\nThe Gate of Cultivating the Self and Treasuring Virtue—The scriptures say: Compassion, frugality, and humility are the sources of governing the self and cultivating virtue; greed, malice, flattery, and obsequiousness are the roots of inviting calamity and destroying the self. Thus, virtue is to be treasured.\n\nThe Gate of the Skillful Artisan Without Harm—When a ruler metes out punishment, it is not like the commands of Heaven’s seasons—spring, summer, autumn, and winter. To forcibly replace Heaven’s killing is to risk excessive harm. Heaven’s craft is without clumsiness, hence without error.\n\nThe Gate of Heaven’s Dao, Level and Universal—Heaven’s Dao suppresses the high and lifts the low, supports the weak and curbs the strong, brings misfortune to the excessive and blessings to the humble, reduces the surplus and supplements the deficient.\n\nClosing the five senses refers to guarding against and discarding intelligence, benevolence, righteousness, skill, and profit.\n\n**Chapter on Near and Far**\nThe sages wish to establish teachings and reveal principles, hence there are distinctions of nature and capacity. Yet the words of sages are truthful, while the words of ordinary people are deluded; thus, there are advances and retreats, doubts and differences.\n\nThe body of the Dao is fundamentally without delusion or enlightenment. Enlightenment has nothing to enlighten; laughter has nothing to laugh at. Advancement does not necessarily bring gain; retreat does not necessarily bring loss. Not seeing the three kinds of scholars—this is the true superior scholar.\n\nSome are near yet know they are near, transforming delusion into enlightenment through close cultivation and learning.\n\nSome know they are near yet do not draw near, constantly speaking of the teaching of non-action yet not practicing non-action—this is knowing nearness yet not drawing near.\n\nSome are near yet do not know they are near, deluded by worldly dust and confused by phenomena, not awakening to the true source, unaware that within the dust lies the subtlest wonder.\n\nSome are far yet do not know they are far, awakening to profound depth yet not clinging to it; depth is not subject to emotion, hence they do not know farness.\n\nSome are far yet know they are far, awakening to depth and knowing that sentient beings possess profound nature; seeing their own bodies as responsive transformations, they expound the Dao to benefit others, merging with depth.\n\nSome practice yet do not arrive, though they have long cultivated and followed the path, their practice is bound by emotion and has not reached the utmost emptiness.\n\nSome do not know practice, not awakening to the teachings and methods, cultivating without a guide’s instruction.\n\nSome do not know arrival, unaware of the gate to the utmost extreme, having no direction to enter, hence not knowing arrival.\n\nSome do not practice yet arrive, not seeing their own practice, not seeing their own arrival, yet mysteriously merging with the root—hence not practicing yet arriving.\n\nSome arrive and transform themselves. Attaining true quiescence, the mysterious virtue shines within; without teaching or words, they naturally become pure and transformed.\n\n**Chapter on Applying the Dao**\nApplying the Dao restrains people; the function of the Dao restrains the wondrous root. Forgetting the Dao, one’s virtue is non-action. Forgetting the vacuous, one reaches the utmost extreme. Attaining virtue is like receiving a favor.\n\nPeople emulate the Dao and follow virtue, aligning with the function of nature. Human life arises as the Dao’s qi is bestowed, the purest essence granted as spirit; the Three Origins congeal the spirit, the Five Phases coalesce into purity. Having received the essence of being, one is endowed with the function of non-being. In the time of small simplicity, no thing dares resist; holding the great image, all forms come forth.\n\nThose of the same Dao and same virtue are yielding and firm like infants, abiding in the wondrous mystery of the Mysterious Female. Without dividing mind and phenomena, they equalize life and death, harmonizing with the natural movements of Heaven and Earth, the fluctuations of yin and yang.\n\nThe rulers of high antiquity who applied the Dao were empty-minded and benefited others, embodying the Dao to transform the people. They oversaw the four directions universally, mastered the six penetrations independently, cut off seeing and hearing, dismissed cleverness and brightness. They did not bind teachings with stagnant words, nor congeal emotions by clinging to things. They planted the root of the Three Ones, firmly establishing growth in the true source; they pruned the sprouts of the Four Sixes, severing the spreading vines in the numinous palace. They did not boast of great skill in achievement, nor did they pursue the eloquence of small success.",
      "overlap_context": "ts mysterious responses hidden and subtle.\nThe Gate of Heavenly Sage without Mind—Heaven and Earth are impartial, covering and supporting the myriad things, nurturing and growing them without missing their seasons. The sage is impartial, transforming and governing the people, delighting in clarity and peace.\nThe Gate of Empty Response and Pervasive Connection—The Great Dao is without mind, pervading the myriad existences. Naturally clear and still, it transcends both existence and non-existence.",
      "start_char": 2472,
      "end_char": 3728,
      "start_sentence": 119,
      "end_sentence": 170,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.108540296554565,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "下经云：静为天下正。 《南华经》云：道者有情有信，无为无形，可传不可受，可得不可见。 故稀韦氏得之以挈天地，伏羲氏得之以袭气母，黄帝得之以登云天，颛顼得之以处玄宫，乃至维斗堪埋禺强彭祖，皆得道用道，而登圣果。 是知圣人、神人、仙人、鬼神、天地、日月、星辰、万物，若不得道用道，无以灵通轻举，隐奥覆载，昭一临生长者也。 又道与天用令覆，与地令载，与日月令照临。 凡有用之物，皆道与之用也。 又道与天名清，地名宁，谷名盈，物名生，故用与名，皆道之命也。 故人法地，地法天，天法道，道法自然矣。 二学章 是知俗学为损，俗学执境滞士。 不入真景，无益於道，故为损。 真学为益，心冥至道，体入重玄，不三住心，为益也。 或真学为损，渐修道行，而弃除染情嗜欲，故名为损，损情欲也。 或俗学为益，因俗教渐入真教，得道悟真，从俗入真，故名为益。 或自损而他益，自入玄境，得出世问，他见亦修，修之得道，故名他益。 或他损而自益，见修者得道，亦勤修习，功行既满，悟契玄玄，故名自益。 有有归无难，无有入无易，无为之教大益。 修者存无而忘有，不若损益两忘，有无齐泯，理须得宗，宗无功而内大明，可成大化。 二病章 夫於道也，有病无病，假设问修道之人有病无病。 知空性不滞空性不病，不执空有，无病也。 知空性滞空性病，空性当情，是病。 不知空性病，执有空情，故是病也。 知空性不修空病，有解无行，亦是病也。 知空性修空不病，解行俱有，是以无病。 不着空与修空无病等，一悟了空，二褊修空，修到不修，等其不着。 於道病也。 有其深浅，滞空之病与执有病，病深也； 滞空着有，其病俱深。 知空性不修空，其病浅也。 若上根修空不着空，其病浅； 中根修空执空，其病深。 溺空滞寂而济世，虽有执有。 或悟空而不着空，而救世也，有二性。 故不定不同，已执空性，中根也。 师资章 道经云：善人不善人之师，不善人善人之资。 夫为师有法可执，有行可则，可以道德礼乐四之大本，顶其君父师三之极尊。 师有道、有德、有智、有仁，四善也。 人有道则通正，有德则神清，有智则观机，有仁则愍物，可谓师父也。 为师则为长为君，进道则为真为仙也。 岂唯教授之师，抑以邦家之宝。 奇哉，善人者也。 不善之人者，邪惑、迷乱、嗜欲、无慈，四不善也。 不亲正教而务异典，谓之邪惑。 非斥至人而党昏愚，谓之迷乱。 耽恣五尘，符同六贼，谓之嗜欲。 无安人恤物之心，有姜毒枭鸩之性，谓之无慈。 可谓善人之资也。 然可知教之废兴，悟学之难易，善安靖而乐友，不隐学而宗师，抱临履之忧，服勤劳之苦，若造极达空，则遗爱两忘，心境双泯，不言之教，复何远哉。 自一气二象之前，杳冥无物； 分五太三才之后，声教渐流。 复朴还淳，乐在无为之化本，登真证圣，游仞至极之重玄。 天尊传道於群仙，老君开玄於万国，运苍生於寿域，致率土於福河。 或有问曰：自古帝王得道用道，自然耶，有宗师耶？ 余对曰：上三皇师，玄中大法师； 中三皇师，有古先生； 下三皇师，金阙帝君。 伏羲师郁华子，神农师大成子，祝融师广寿子，黄帝师广成子，颛顼师赤精子，帝誉师录图子，帝尧师务成子，帝舜师尹寿子，夏禹师真行子，殷汤师锡则子，周文王师燮邑子，武王师育成子，成王师务光子，康王师郭叔子，仲尼师老子。",
      "translated_text": "The Lower Canon states: \"Stillness is the rectitude of all under Heaven.\"\nThe *Nanhua Sutra* says: The Dao is affective and trustworthy, non-actional and formless; it may be transmitted but not received, attained but not seen.\nThus, the Sovereign of Xiwei grasped it to harness Heaven and Earth; Fuxi obtained it to inherit the Mother of Qi; the Yellow Emperor attained it to ascend the cloudy heavens; Zhuanxu secured it to dwell in the Mysterious Palace. Even unto the Dipper’s Handle, Kanpei, Yushang, and Pengzu—all applied the Dao and employed it, ascending to the fruit of sageliness.\nThus we know: sages, spirit-men, immortals, ghosts and spirits, Heaven and Earth, sun and moon, stars and constellations, the myriad things—if they did not attain and employ the Dao, they would lack the numinous penetration to rise lightly, the hidden profundity to cover and bear, the luminous singularity to oversee and nurture life.\nMoreover, the Dao collaborates with Heaven to command covering, with Earth to command bearing, with sun and moon to command illumination. Whatever has use, the Dao grants it use.\nThe Dao names Heaven as \"pure,\" Earth as \"tranquil,\" valleys as \"full,\" things as \"living.\" Thus use and name alike are the Dao’s mandates.\nTherefore, humans emulate Earth, Earth emulates Heaven, Heaven emulates the Dao, and the Dao emulates spontaneity.\n\n**Chapter on the Two Teachings**\nKnow that worldly learning is detrimental: worldly learning clings to realms and stagnates scholars. Without entering the true vision, it profits nothing for the Dao—hence it is detrimental.\nTrue learning is beneficial: the mind merges with the ultimate Dao, the body enters the Double Mystery, not dwelling in the three states—hence it is beneficial.\nYet true learning may be detrimental: gradual cultivation of the Dao’s practice requires shedding defiled passions and desires—hence it is called detrimental, for it diminishes passions and desires.\nOr worldly learning may be beneficial: through worldly teachings one gradually enters true teachings, attains the Dao and awakens to reality, moving from the worldly to the true—hence it is called beneficial.\nSome harm themselves to benefit others: entering the mysterious realm, transcending worldly questions, others witnessing this also cultivate, and through cultivation attain the Dao—hence it is called benefiting others.\nSome are harmed by others yet benefit themselves: seeing cultivators attain the Dao, they also diligently practice; when merit and conduct are complete, they awaken to the profound mystery—hence it is called self-benefit.\nTo return from being to non-being is difficult; to enter non-being from non-being is easy. The teaching of non-action is of great benefit.\nCultivators who preserve non-being and forget being do not equal those who forget both benefit and harm, who dissolve being and non-being equally. Only by attaining the source can one inwardly illumine the great clarity and accomplish the great transformation.\n\n**Chapter on the Two Afflictions**\nRegarding the Dao, there is affliction and non-affliction—hypothetically asking whether cultivators of the Dao have affliction or not.\nKnowing emptiness yet not clinging to emptiness is non-affliction; not grasping emptiness or being is non-affliction.\nKnowing emptiness yet clinging to emptiness is affliction; emptiness becoming entangled with emotion is affliction.\nNot knowing emptiness is affliction; grasping being while feigning emptiness is affliction.\nKnowing emptiness yet not cultivating emptiness is affliction; having understanding without practice is also affliction.\nKnowing emptiness and cultivating emptiness is non-affliction; having both understanding and practice is thus non-affliction.\nNot clinging to emptiness or to cultivating emptiness is equal to non-affliction: first awakening to emptiness, then broadly cultivating emptiness, cultivating until there is no cultivation—equaling non-clinging.\nRegarding the Dao, this is affliction.\nThere are degrees of depth: the affliction of clinging to emptiness and the affliction of grasping being are deep afflictions; clinging to emptiness while grasping being—both afflictions are profound.\nKnowing emptiness yet not cultivating emptiness is a shallow affliction.\nIf those of superior capacity cultivate emptiness without clinging to emptiness, their affliction is shallow; those of middling capacity who cultivate emptiness and cling to emptiness have deep affliction.\nDrowning in emptiness and stagnating in quiescence while aiding the world—though there is grasping of being—some awaken to emptiness without clinging to emptiness while saving the world, possessing dual natures.\nThus there is no fixed sameness: those who cling to the nature of emptiness are of middling capacity.\n\n**Chapter on Master and Resource**\nThe *Daoist Canon* states: The good person is the teacher of the ungood person; the ungood person is the resource of the good person.\nTo be a teacher, there are methods to grasp and conduct to follow. One may take the great roots of virtue, Dao, ritual, and music, and place them above the three supreme reverences of ruler, father, and teacher.\nA teacher possesses the Dao, virtue, wisdom, and benevolence—these four excellences.\nWith the Dao, one is penetrating and upright; with virtue, one is spiritually clear; with wisdom, one observes the moment; with benevolence, one pities beings—such may be called a master-father.\nAs a teacher, one is elder and ruler; in advancing the Dao, one becomes true and immortal.\nHow could this refer only to teaching masters? It is also the treasure of the state.\nHow wondrous—the good person!\nThe ungood person is deluded, confused, desirous, and merciless—these four non-excellences.\nNot drawing near to orthodox teachings but pursuing heterodox texts is called delusion.\nRejecting perfected beings while allying with the benighted and foolish is called confusion.\nIndulging in the five dusts and colluding with the six thieves is called desire.\nLacking a heart to pacify people and pity things, possessing the nature of aconite and owl venom—this is called mercilessness.\nSuch may be called the resource of the good person.\nThus one may know the rise and decline of teachings, the difficulty and ease of awakening and learning. The good person brings peace and delights in companionship, does not conceal learning but venerates the master, bears the sorrow of oversight, endures the toil of diligence. If one reaches the ultimate and penetrates emptiness, then love and attachment are both forgotten, mind and realm are both dissolved. The wordless teaching—how distant can it be?\nBefore the one qi and two images, there was profound obscurity and nothingness; after the division of the five supremes and three talents, the sounds of teaching gradually flowed forth.\nReturning to simplicity and restoring purity, joy lies in the root of non-action’s transformation. Attaining truth and verifying sageliness, one roams the profound mystery of the Double Mystery.\nThe Heavenly Worthy transmitted the Dao to the host of immortals; Lord Lao opened the mystery to the myriad states, guiding the black-haired people to the realm of longevity, leading all within the four seas to the river of blessings.\nSomeone asked: Since ancient times, have emperors and kings who attained and employed the Dao done so naturally, or through a master?\nI replied: The teachers of the Upper Three Sovereigns were the Great Dharma Masters of the Mysterious Center; the teachers of the Middle Three Sovereigns were the Ancient Masters; the teachers of the Lower Three Sovereigns were the Imperial Lords of the Golden Portal.\nFuxi’s teacher was Yuhua Zi; Shennong’s teacher was Dacheng Zi; Zhurong’s teacher was Guangshou Zi; the Yellow Emperor’s teacher was Guangcheng Zi; Zhuanxu’s teacher was Chijing Zi; Emperor Ku’s teacher was Lutu Zi; Emperor Yao’s teacher was Wucheng Zi; Emperor Shun’s teacher was Yinshou Zi; Yu of Xia’s teacher was Zhenxing Zi; Tang of Yin’s teacher was Xize Zi; King Wen of Zhou’s teacher was Xieyi Zi; King Wu’s teacher was Yucheng Zi; King Cheng’s teacher was Wuguang Zi; King Kang’s teacher was Guoshu Zi; Confucius’ teacher was Laozi.",
      "overlap_context": "niversally, mastered the six penetrations independently, cut off seeing and hearing, dismissed cleverness and brightness. They did not bind teachings with stagnant words, nor congeal emotions by clinging to things. They planted the root of the Three Ones, firmly establishing growth in the true source; they pruned the sprouts of the Four Sixes, severing the spreading vines in the numinous palace. They did not boast of great skill in achievement, nor did they pursue the eloquence of small success.",
      "start_char": 3728,
      "end_char": 5028,
      "start_sentence": 171,
      "end_sentence": 229,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.83912754058838,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "上至淳朴之代，下及浇漓之风，纵极九范来天，横笼八极，三皇五帝，三王五霸以，若无圣人、真人、仙人，假宗师之规，藉至教而炼陶，无以去世登真也。 又《广义》云：老君将显大教，布化万方，乃曰道不可无师尊，教不可无宗主，老君乃师事太上玉晨大道君。 又大道君与五亿天主、亿万圣君，师元始天尊。 且老君体大无边，智大无边，神力无边，说教无边，道贯无穷，寿命亿劫，尚禀受宗师，证真利物，岂可世人不求寻师，依教修行，而希姓名署仙籍之中，拔九玄於三清之上者哉。 仁义章 五行者，人禀之为五常之性也，帝王之德也。 仁性察木，伺春发生之德。 礼性禀火，同夏长养之德。 义性禀金，同秋肃杀之德。 智性禀水，同冬伏藏之德。 任此真常，深契羲农之化。 体兹至道，自然仁义之风。 抱和气，含神·灵，以天阳地阴而成性质。 质者形分也。 昊子云：扬雄、斑固之俦，以道家轻仁义、薄礼智，而专任清虚者，盖世儒不达玄圣之深旨也。 仁者褊爱，义者裁非，浇季萌生，道之华薄。 《天运》曰：古之至仁，假道於仁，托宿於义，同莲庐而非久处，指刍狗无以再陈。 上经云：大道废，有仁义。 又云：绝圣弃智。 孔子问渔父：何谓真？ 渔父曰：真者，精诚之至也。 不精不诚，不能动人。 故真者，内至诚也。 孔子以仁义为教，礼乐化人，非真也。 《庄子》云：至礼不人，至义不物，至智不谋，至仁无亲，至信辟金。 道隐小成，言隐浮伪。 况道德为上，仁义为末。 三军五兵，德之末也。 赏罚五刑，教之末也。 礼法刑名，治之末也。 锺鼓羽旎，乐之末也。 绩绖杀伤，一及之末也。 伤世重末而轻本。 若任情天性，人不失常，废礼而志自恬和，止乐而心不淫荡，除仁而爱憎泯，削义而是非忘，可虚心於淳古之风，抑锐思於末学之路，居性识之前为浇漓之首，击道丧之后作素乱之源，致朱旷於骈拇枝指，坠曾史於疣赘之殃，得不残朴罪工仁义责圣者乎。 失道章 妙本自然，体性虚无，固无得无丧，若约人则禀和气，含道而成人也。 当上古性纯质朴，三皇五帝以来，失其素真，帝王有为、人民性革，道德丧后，仁义礼智权势焉。 且天地动静者，天不动运，无以挤排日月星辰，五行四序覆育之德也。 地不宁静，无以厚载生长动植，万物山川所依之德也。 盖禀大道，自然之化也。 《易》云：太极生两仪，两仪生三才，三才生万物。 应用匠成茂养，道之用也。 道存则生，道去则死。 道不可离，可离非道。 人生而静口天地之性。 性本清静，若驰骋六尘，奔波三业，则灵台不树，天光不明，失性而沦乎生死。 为不善於显明，人诛之； 为不善於幽间，鬼诛之。 失道矣。 是故天失道，则有阳勃。 地失道，则有阴泄。 神失道，灵既休绝。 谷失道，流注竭个。 万物失道，则无生长。 天子失道，则失天下也。 侯王失道，则失国也。 人失道，则丧生也。 道冲而用之，和气冲虚，故为道用。 冲和处中，无失冲和之性也。 心行章 夫心有四，所谓迷心、悟心、修心、证心。 迷心有十，迷事、迷理、迷教、迷境、迷气、迷身、迷神、迷仙、迷真、迷圣也。 迷事者，谓於一切有为之事若善若恶，俱不能分别了达，而生颠倒滞惑之心，为无智慧用性而拣择取舍，致有轮回生死，不到真源。",
      "translated_text": "From the age of pristine simplicity to the era of decadent customs, spanning the nine heavens in height and encompassing the eight directions in breadth, through the reigns of the Three Sovereigns, Five Emperors, Three Kings, and Five Hegemons—without the guidance of sages, perfected beings, or immortals, who followed the regulations of their teachers and refined themselves through the supreme teachings, none could transcend the mortal realm and ascend to perfection.\n\nFurthermore, the *Guangyi* states: When Lord Lao sought to manifest the great teaching and spread transformation throughout the ten thousand directions, he declared, \"The Dao cannot lack a revered teacher, nor can the teaching lack a founding master.\" Thus, Lord Lao took the Most High Jade Dawn Great Dao Lord as his teacher. The Great Dao Lord, together with five hundred million Heavenly Lords and countless sacred sovereigns, took the Primordial Heavenly Venerable as their teacher.\n\nMoreover, Lord Lao embodies boundless greatness, boundless wisdom, boundless divine power, and boundless teachings; his Dao is inexhaustible, and his lifespan spans kalpas. Yet even he received instruction from a teacher to verify the truth and benefit all beings. How then can worldly people, without seeking a teacher or cultivating in accordance with the teachings, hope to have their names inscribed in the registers of immortals or ascend beyond the Nine Mysteries to the Three Clarities?\n\n**Chapter on Humaneness and Righteousness**\nThe Five Phases are what humans receive as the nature of the Five Constants, the virtues of emperors and kings. The nature of humaneness corresponds to wood, aligning with the virtue of spring’s growth. The nature of propriety corresponds to fire, harmonizing with the virtue of summer’s nurturance. The nature of righteousness corresponds to metal, aligning with the virtue of autumn’s sternness. The nature of wisdom corresponds to water, harmonizing with the virtue of winter’s concealment. Embracing these true constants deeply accords with the transformations of Fuxi and Shennong. Embodying this supreme Dao naturally gives rise to the winds of humaneness and righteousness.\n\nHolding harmonious qi and containing spirit and numen, one forms a nature and substance from the yang of heaven and the yin of earth. Substance is the division of form. Master Haozi said: Yang Xiong, Ban Gu, and their ilk, who claimed that Daoists slight humaneness and righteousness, disparage propriety and wisdom, and focus solely on purity and emptiness, were世儒 who failed to grasp the profound intent of the mysterious sages.\n\nHumaneness is partial love; righteousness is the correction of wrongs. When decadence first arises, the Dao becomes superficial and thin. The *Tian Yun* states: \"The utmost humaneness borrows the Way from humaneness and lodges temporarily in righteousness, like a lotus hut not meant for long dwelling, or straw dogs not to be reused.\" The *Upper Scripture* says: \"When the great Dao declines, humaneness and righteousness arise.\" It also says: \"Abandon sageliness and discard wisdom.\"\n\nConfucius asked the Fisherman: \"What is the real?\" The Fisherman replied: \"The real is the utmost sincerity. Without sincerity, one cannot move others. Thus, the real is inner utmost sincerity.\" Confucius taught humaneness and righteousness, transforming people through ritual and music—this is not the real.\n\n*Zhuangzi* says: \"The utmost propriety does not enter people; the utmost righteousness does not attach to things; the utmost wisdom does not scheme; the utmost humaneness has no partiality; the utmost trust dispenses with pledges.\" The Dao is obscured by minor achievements; words are obscured by superficial falsity. Moreover, the Dao is primary, while humaneness and righteousness are secondary. Armies and weapons are the dregs of virtue; rewards, punishments, and the five penalties are the dregs of teaching; ritual, law, and names are the dregs of governance; bells, drums, and feathered banners are the dregs of music; hempen mourning garments and wounds are the dregs of unity.\n\nHarming the world by emphasizing the secondary and neglecting the root: if one follows natural emotions and human nature without losing constancy, discarding ritual yet maintaining a serene and harmonious will, ceasing music yet keeping the heart from excess, abolishing humaneness yet dissolving love and hatred, eradicating righteousness yet forgetting right and wrong—then one may empty the heart of the winds of ancient simplicity, restrain sharp thoughts from the paths of secondary learning, dwell in the forefront of nature and knowledge as the origin of decadence, and strike the Dao’s loss as the source of chaos. This leads to Zhuang Kuang’s superfluous toes and fingers, casts Zeng and Shi into the misfortune of tumors and growths—how could one not blame the craftsmen of humaneness and righteousness and condemn the sages?\n\n**Chapter on Losing the Dao**\nThe wondrous origin is spontaneous, its essence and nature empty and nonexistent; fundamentally, there is no attainment and no loss. Yet, in relation to humans, one receives harmonious qi and contains the Dao to become human. In high antiquity, nature was pure and substance simple. From the Three Sovereigns and Five Emperors onward, the original truth was lost. Emperors and kings acted with intention, and the people’s nature changed. After the Dao was lost, humaneness, righteousness, propriety, wisdom, and power prevailed.\n\nMoreover, the movement and stillness of heaven and earth: if heaven did not move and revolve, it could not arrange the sun, moon, and stars, nor manifest the virtue of the Five Phases and Four Seasons’ nurturance. If earth were not tranquil and still, it could not firmly bear the growth of living things, nor provide the virtue on which the myriad beings, mountains, and rivers depend. This is the transformation of embodying the great Dao and spontaneity.\n\nThe *Book of Changes* says: \"The Supreme Ultimate generates the Two Modes; the Two Modes generate the Three Powers; the Three Powers generate the myriad beings.\" Their application and craftsmanship bring forth flourishing nurturance—this is the function of the Dao. Where the Dao abides, there is life; where the Dao departs, there is death. The Dao cannot be separated from; what can be separated is not the Dao.\n\nHumans are born tranquil—this is the nature of heaven and earth. Nature is originally pure and still. If one gallops amid the six dusts and rushes through the three karmas, the numinous terrace is not established, the celestial light is not bright, and one loses nature, sinking into birth and death. Acting evilly in the open, humans punish it; acting evilly in secret, ghosts punish it. This is losing the Dao.\n\nThus, when heaven loses the Dao, there is yang turbulence. When earth loses the Dao, there is yin dissipation. When spirits lose the Dao, their numinosity ceases and perishes. When valleys lose the Dao, their flowing waters dry up. When the myriad beings lose the Dao, there is no growth. When the Son of Heaven loses the Dao, he loses the world. When feudal lords lose the Dao, they lose their states. When people lose the Dao, they lose their lives.\n\nThe Dao is empty yet used; harmonious qi is empty and vacuous, thus serving the Dao’s function. Emptiness and harmony reside in the center—do not lose the nature of emptiness and harmony.\n\n**Chapter on the Conduct of the Heart**\nThe heart has four aspects: the deluded heart, the awakened heart, the cultivated heart, and the verified heart.\n\nThe deluded heart has ten kinds: delusion about affairs, delusion about principles, delusion about teachings, delusion about realms, delusion about qi, delusion about the body, delusion about spirit, delusion about immortality, delusion about the real, and delusion about sageliness.\n\nDelusion about affairs refers to being unable to discern and comprehend all conditioned affairs, whether good or evil, thus generating a confused, attached, and bewildered heart. Lacking the wisdom to employ one’s nature in discerning and choosing, one falls into the cycle of birth and death without reaching the true source.",
      "overlap_context": "eacher was Dacheng Zi; Zhurong’s teacher was Guangshou Zi; the Yellow Emperor’s teacher was Guangcheng Zi; Zhuanxu’s teacher was Chijing Zi; Emperor Ku’s teacher was Lutu Zi; Emperor Yao’s teacher was Wucheng Zi; Emperor Shun’s teacher was Yinshou Zi; Yu of Xia’s teacher was Zhenxing Zi; Tang of Yin’s teacher was Xize Zi; King Wen of Zhou’s teacher was Xieyi Zi; King Wu’s teacher was Yucheng Zi; King Cheng’s teacher was Wuguang Zi; King Kang’s teacher was Guoshu Zi; Confucius’ teacher was Laozi.",
      "start_char": 5028,
      "end_char": 6276,
      "start_sentence": 230,
      "end_sentence": 292,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.359471559524536,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "《西升经》云：道探甚奥，虚无之渊。 《老子》云：渊乎似万物之宗。 迷理者，所谓於虚极妙体、自然实性上无所闻见，悟修证了等，故云迷理心也。 迷教心者，圣人意欲令众生反俗归真，逆而成顺，注云道尚无为，人尚有为，道本无情无欲，人尚有欲有情。 谓不遇明师智友导引开心，启发指示三乘玉清灵宝洞神之教法也。 圣人教法妙义，纵遇不生爱乐，勤求修习，观诠察理，求出离之心，存若亡。 《老子》云：道法本自然。 者能得，闻者能言。 言者不知圣人处无为之事，行不言之教。 迷境心者有二，迷真境心，迷妄境心。 真境则大道妙本自然之体性也，被妄隔真源、尘染断绝也。 上经云：常无欲以观其妙，常有欲以观其激。 妄心者，则烦恼六根三业十不善行也，虚妄分别，驰逐有为也。 经云：不见可欲，使心不乱。 《西升经》云：积恶者恶气至，积善者善气至。 积善神明辅成，天道犹佑於善人也。 迷气心者，人禀中和之气，其气有清有浊，禀清气者智人，禀浊气者愚人。 《定观经》云：延数千岁，名日仙人； 炼形为气，名日真人； 炼气成神，名日神人； 炼神合道，名曰圣人。 人迷元和正性，而不能养神爱气也。 故《广义》曰：道者无也，形者有也，有故有逝，无故长存。 世人修道，外固其形以宝其有，内存其神以宗其无，契无合道，以至长生。 以形为阴魄也，以神为阳魂也。 凡人有少阳气在，不至於，有少阴气在，不至於仙。 阴气既，即阶仙品，仙者纯阳也。 阳气灭即为鬼，鬼〔者〕阴气也。 经云：专气致柔，能如婴儿乎。 阳气内充，守一有德，有德必能有国，有国必能有道，有道必能理化，理化必能安民，民安则国安，国安自然泰平也。 经云：爱民理国，能无为乎。 迷身者，不知身中有气、有神、有识，可炼仙行得仙果，炼真行得真果，炼圣行得圣果。 《西升经》云：圣人常安，与天地俱安，而鬼神通； 众人皆安其所安，其所不安，即不安矣。 又迷身者，身虚·万物，至心之虚，而和气归善。 养身者藏身於身而不出，藏人於人而不见，是以圣人后其身而身先，外其身而身存。 不知身为患本，故日迷身。 迷神者，神者阴阳不测，妙用无方，隐显变通，不可穷极，谓之神。 在天曰神，在地曰祇，在人日鬼。 众生身内神识精灵，不能炼神合道，而登圣果。 《庄子》云：万物任自然，而各得其生。 迷仙者，不修仙行。 迷真者，不修真行。 迷圣者，不修圣行。 悟心者，悟道之心也。 修心者，修道之心也。 证心者，证道之心也。 心绝缘虑，意绝妄想，智绝分别。 是则真见无不见，邪见有不见； 真闻无不闻，邪闻有不闻； 真觉无不觉，邪觉有不觉； 真知无不知，邪知有不知。 若真邪双泯，知觉两忘，则达乎忘心忘境也。 心境俱忘，冥合道矣。 《内观经》云：夫心者，非青非赤、非白非黄、非长非短、非圆非方，大包天地，细入毫芒，制之则止，放之则狂，清静则生，浊躁则亡，明照八表，暗迷一方。 人之难伏，惟在於心，所以教人修道即修心也，教人修心即修道也。 心不可息，念道以息之。 心不可见，因道以明之。 善恶二趣，一切世法，因心而灭，因心而生。 习道之士灭心则契道，世俗之士纵心则危身。",
      "translated_text": "**The Scripture of Western Ascension** states: \"The Dao probes the most profound, the abyss of emptiness and non-being.\"\n**Laozi** says: \"Profound indeed, it seems the ancestor of the myriad things.\"\n\n**Delusion about principles** refers to having no perception or understanding of the wondrous, empty, and ultimate essence, the natural and true nature, nor of awakening, cultivation, verification, and realization—hence it is called the heart deluded about principles.\n\n**The heart deluded about teachings** arises when the sages intend to guide beings to turn from the mundane toward the real, transforming opposition into accord. As the commentary states: \"The Dao values non-action, while people value action; the Dao is fundamentally without emotion or desire, while people cling to desire and emotion.\" Without encountering a wise teacher or enlightened companion to open the heart, inspire, and point out the teachings of the Three Vehicles—Jade Purity, Numinous Treasure, and Cavernous Spirit—one remains unaware of the sages' wondrous doctrines. Even if one encounters them, one does not generate joy or diligence in seeking and practicing, nor does one contemplate, examine, and investigate the principles to cultivate the heart of liberation. Such a heart exists in name only, as if absent.\n\n**Laozi** says: \"The Dao models itself on spontaneity.\" Those who attain it can speak of it; those who hear it can discourse on it. Yet those who speak do not know that the sage abides in non-action and practices the teaching without words.\n\n**The heart deluded about realms** has two aspects: delusion about the true realm and delusion about the illusory realm. The true realm is the wondrous, fundamental, and spontaneous essence of the great Dao, yet it is obscured by illusion, cutting one off from the true source and severing one from the dust of defilement. As the **Classic** states: \"Constantly without desire, one observes its mystery; constantly with desire, one observes its manifestations.\"\n\nThe **illusory heart** refers to the afflictions of the six senses, the three karmic actions, and the ten unwholesome deeds—discriminating and pursuing conditioned existence in vain. As the **Scripture** says: \"Do not see what can be desired, and the heart will not be disturbed.\" The **Scripture of Western Ascension** states: \"Those who accumulate evil invite evil qi; those who accumulate goodness invite good qi. Those who accumulate goodness are aided by numinous spirits, for the heavenly Dao assists the good.\"\n\n**The heart deluded about qi** arises when people receive the harmonious qi of heaven and earth, which may be clear or turbid. Those who receive clear qi are wise; those who receive turbid qi are foolish. The **Scripture of Fixed Contemplation** says: \"One who extends life for thousands of years is called an immortal; one who refines form into qi is called a perfected person; one who refines qi into spirit is called a spirit person; one who refines spirit to merge with the Dao is called a sage.\"\n\nPeople are deluded about the original harmony and true nature, failing to nurture spirit and cherish qi. Thus, the **Expansive Meaning** states: \"The Dao is non-being; form is being. Being is subject to decay, while non-being endures forever. Those who cultivate the Dao externally secure their form to treasure their being, while internally they preserve their spirit to honor their non-being. By uniting with non-being to merge with the Dao, they attain longevity. Form is the yin po; spirit is the yang hun. Ordinary people possess a modicum of yang qi, yet it does not suffice for immortality; with a modicum of yin qi, they do not attain sagehood. When yin qi is exhausted, one ascends to the ranks of immortals—immortals are pure yang. When yang qi perishes, one becomes a ghost—a ghost is yin qi.\"\n\nThe **Classic** says: \"Concentrate your qi to attain suppleness—can you be like a newborn babe?\" When yang qi is inwardly abundant and one guards the One with virtue, possessing virtue enables one to govern a state; governing a state enables one to embody the Dao; embodying the Dao enables one to govern and transform; governing and transforming enables one to pacify the people. When the people are at peace, the state is at peace, and naturally, all is secure and harmonious. The **Classic** says: \"In loving the people and governing the state, can you practice non-action?\"\n\n**Delusion about the body** has two meanings: first, not knowing that within the body there is qi, spirit, and consciousness, which can be refined through immortal practices to attain the fruit of immortality, through true practices to attain the fruit of perfection, and through sagely practices to attain the fruit of sagehood. The **Scripture of Western Ascension** says: \"The sage is constantly at peace, at one with heaven and earth, and communicates with ghosts and spirits. The multitude are at peace only in what they deem peaceful; what they deem not peaceful is not peaceful to them.\"\n\nSecond, delusion about the body arises when the body is empty of the myriad things, and the heart’s emptiness allows harmonious qi to return to goodness. Those who nurture the body conceal it within itself without revealing it, hide the person within others without being seen. Thus, the sage places the self last yet finds it foremost, sets the self aside yet preserves it. Not knowing the body as the root of suffering, this is called delusion about the body.\n\n**Delusion about spirit** refers to spirit as that which is unfathomable in yin and yang, wondrous in function without fixed form, hidden or manifest, transforming and penetrating without limit—this is called spirit. In heaven, it is called *shen*; on earth, it is called *qi*; in humans, it is called *gui*. The numinous spirit and consciousness within beings cannot refine spirit to merge with the Dao and ascend to sagely fruition. **Zhuangzi** says: \"The myriad things follow their nature and each attains its life.\"\n\n**Delusion about immortality** is the failure to cultivate immortal practices. **Delusion about the real** is the failure to cultivate true practices. **Delusion about sageliness** is the failure to cultivate sagely practices.\n\n**The awakened heart** is the heart that awakens to the Dao. **The cultivated heart** is the heart that cultivates the Dao. **The verified heart** is the heart that verifies the Dao.\n\nWhen the heart severs entangling thoughts, the mind severs false imaginings, and wisdom severs discrimination, then true seeing sees all, while perverse seeing fails to see; true hearing hears all, while perverse hearing fails to hear; true awareness is aware of all, while perverse awareness fails to be aware; true knowing knows all, while perverse knowing fails to know. If true and perverse are both extinguished, and knowing and awareness are both forgotten, one attains the state of forgetting the heart and forgetting the realm. When heart and realm are both forgotten, one merges obscurely with the Dao.\n\nThe **Scripture of Inner Contemplation** says: \"The heart is neither blue nor red, neither white nor yellow, neither long nor short, neither round nor square. Vast, it encompasses heaven and earth; minute, it enters the tip of a hair. Restrained, it halts; released, it rages. Pure and still, it lives; turbid and agitated, it perishes. Illuminating, it shines to the eight limits; obscured, it is deluded in one direction. The difficulty in subduing humans lies solely in the heart. Thus, teaching people to cultivate the Dao is to cultivate the heart; teaching people to cultivate the heart is to cultivate the Dao.\n\nThe heart cannot be stilled—one stills it by contemplating the Dao. The heart cannot be seen—one clarifies it through the Dao. The two paths of good and evil, all worldly dharmas, arise and perish through the heart. Those who practice the Dao extinguish the heart to merge with the Dao; worldly people indulge the heart and endanger the self.\"",
      "overlap_context": "elusion about realms, delusion about qi, delusion about the body, delusion about spirit, delusion about immortality, delusion about the real, and delusion about sageliness.\n\nDelusion about affairs refers to being unable to discern and comprehend all conditioned affairs, whether good or evil, thus generating a confused, attached, and bewildered heart. Lacking the wisdom to employ one’s nature in discerning and choosing, one falls into the cycle of birth and death without reaching the true source.",
      "start_char": 6276,
      "end_char": 7485,
      "start_sentence": 293,
      "end_sentence": 352,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.4083137512207,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "心生则乱，心灭则理。 所以天子制官僚、明法度、置刑赏、悬吉凶以劝人者，皆为心之难理也。 无心者，令不有也。 定心者，令不惑也。 息心者，令不为也。 制心者，令不乱也。 正心者，令不邪也。 冷心者，令不染也。 虚心者，令不着也。 明此七者，可与言道，可与言修心矣。 修道章 夫人有道，若谷之有响。 道修之而必得，响声之而必应。 声若急急，而响急应。 喻上士勤修。 声若缓缓，而响缓应，喻中士进退。 若绝乎声，而响不应，喻下士不修。 不修则道远矣。 是以圣人取其含爱之腹厚实，并自知自爱也； 去彼妄视之眼华薄，及自见自贵也。 谷之有响，比神之妙能而无穷竭也，亦喻长生久视。 故云：谷神不死，是谓玄牝。 勤道之士以阴炼阳，所为阴气充塞，阳气沉藏，和气沦胥，祆邪来舍，致其衰老疾苦，死亡立至也。 不若以阳炼阴，自老返婴，自迷返悟，自邪返正，自无返有。 要在乎寻师习学，顺教修行，静处山林，滋味玄默。 初其正一，次入洞神，袭乎妙玄灵宝，捷乎洞真至粹，乃至吐纳导引，屈伸万行，阶仙圣之极果矣。 保生章 和气神识者，随形而有生死，其神性实无生死。 击於形聚为生，形灭为死。 《庄子》云：有乎生，有乎死，有乎出，有乎入，出入无见其形，是之谓天门。 有外养，有内养，内养者造生死之极致，外养者为品物之宗师。 外养存人，内养存己，要契不生不死，非养大之才也。 夫质生之物，气散而一为死，气聚而为生，然气有聚散之异，神无生灭之别。 是故因神而能用气，因气亦能资神，聚则同成，散而各运。 《庄子．知北游篇》丞答舜曰：身非汝有，天地之委形也； 生非汝有，天地之委和也； 性命非汝有，天地之委顺也。 天地结气而生一气有上下委顺尔。 悟身、悟生、悟性命，则了知委形、委和、委顺。 是知天地气聚而生，天地气散而死，据气聚散而有死生，假立分别也，而皆从无体。 无体真常，故无生灭。 今言保生者，御其情欲之生也。 情欲若生，则壅塞真常之性。 保生既尔，理国亦然。 若广用智谋，广极疆土，广聚货财，广崇宫室，逸情奢侈，恣巧多端，则失清静真性。 真性既失，真化不行，狂邪入心，自不能正，失权也。 既失其权，佞谄是用，不唯忘保生之理，其国祚莫保久长之道也。 若身无幻累，寿命遐远，宗庙延洪，社稷永固。 保生之人则保国也，修道之人则保生也。 盖由薄是非，去侨傲，戒嗜欲，忘名利，然后防御五色攻劫於无色之色，五声攻劫於无声之声，五味攻劫於无味之味。 勿驰骋於六尘，勿奔波於三世，既耳目无所闻见，心绝思虑，气通和畅，神不离形，形不离神，神形相守，长生仙行成矣，保生之道遂矣。 达声色之性空，悟形体之非有，神清志静，德厚道·高，则不沦胥於生死遘隍，自到於重玄闽闽。 《西升经》云：一及人不如哀身，一及身不如爱神，爱神不如含神，含神不如守真，守真长久长存也。 又曰：神爱人，人不爱神，是以老君教人养神养气，是谓保生之术。 理国章 理天下，理国祚，理家理身，非道德无以匡济也。 国以无为理则事简，以有为理则事繁。 事简则心淳，事繁则民乱。 心淳则国安，民乱则国危，去危就安，安静为道。",
      "translated_text": "The heart, when active, brings chaos; when extinguished, brings order. Thus, the Son of Heaven establishes officials, clarifies laws, institutes punishments and rewards, and displays fortune and misfortune to encourage people—all because the heart is difficult to govern. Those without a heart are not swayed by commands. Those with a settled heart are not confused by commands. Those who still the heart do not act recklessly. Those who restrain the heart do not fall into disorder. Those who rectify the heart do not stray. Those with a cool heart are not defiled. Those with an empty heart are not attached. Understanding these seven principles, one may speak of the Dao and discuss the cultivation of the heart.\n\n**Cultivating the Dao**\nA person who possesses the Dao is like an echo in a valley. Cultivating the Dao ensures attainment, just as calling out ensures a response. A sharp cry elicits a sharp echo—this illustrates the diligence of superior practitioners. A slow call elicits a slow echo—this illustrates the hesitation of middling practitioners. When the call ceases and no echo responds, this illustrates the neglect of inferior practitioners. Without cultivation, the Dao remains distant.\n\nThus, the sage embraces the profound fullness of loving containment and self-knowledge, while discarding the superficial vanity of the eyes and self-regard. The echo in the valley, like the wondrous and inexhaustible power of spirit, also illustrates longevity and enduring vision. Hence it is said: *\"The valley spirit does not die—this is called the Mysterious Female.\"*\n\nThose who diligently cultivate the Dao refine yin with yang, but if yin qi becomes excessive while yang qi sinks and hides, harmonious qi dissipates, malevolent forces take residence, and aging, illness, suffering, and death swiftly follow. Better to refine yang with yin, reversing old age to return to infancy, confusion to enlightenment, deviation to rectitude, and nothingness to being. The key lies in seeking a teacher, studying diligently, following teachings, and practicing in quiet mountain forests, embracing profound stillness. First, one masters the Orthodox Unity; next, enters the Cavernous Spirit; then advances through the Wondrous Mystery and Numinous Treasure, swiftly attaining the purity of the Cavernous Perfection. Through breath regulation, guiding and stretching, and myriad practices, one ascends to the ultimate fruit of immortality.\n\n**Preserving Life**\nHarmonious qi and spirit-consciousness follow form in life and death, yet the spirit’s nature is truly without birth or death. When form gathers, life arises; when form scatters, death follows. *Zhuangzi* says: *\"There is life, there is death; there is going out, there is coming in. In going out and coming in, no form is seen—this is called the Gate of Heaven.\"*\n\nThere is external nurturing and internal nurturing. Internal nurturing reaches the ultimate of life and death, while external nurturing serves as the master of all things. External nurturing sustains others; internal nurturing sustains oneself. To harmonize with neither life nor death requires the greatest nurturing talent.\n\nAll material beings die when qi scatters and live when qi gathers. Though qi differs in gathering and scattering, spirit knows no distinction of birth and death. Thus, through spirit one employs qi, and through qi one nourishes spirit. When gathered, they unite in accomplishment; when scattered, each operates independently.\n\n*Zhuangzi’s \"Knowledge Wanders North\"* records Shun’s reply: *\"The body is not yours—it is the entrusted form of heaven and earth. Life is not yours—it is the entrusted harmony of heaven and earth. Nature and destiny are not yours—they are the entrusted compliance of heaven and earth.\"* Heaven and earth bind qi to generate a single qi, which flows in compliance above and below.\n\nAwakening to the body, to life, and to nature and destiny, one understands the entrusted form, harmony, and compliance. Thus, when heaven and earth’s qi gathers, life arises; when it scatters, death follows. Life and death are based on qi’s gathering and scattering—a provisional distinction—yet all emerge from formlessness. Formlessness is the true constancy, hence without birth or death.\n\nNow, preserving life means governing the arising of emotions and desires. If emotions and desires arise, they obstruct the true and constant nature. Just as preserving life is thus, so too is governing a state.\n\nIf one extensively employs schemes, expands territory, accumulates wealth, and exalts palaces, indulging in ease, luxury, and endless craftiness, one loses the pure and true nature. Once the true nature is lost, true transformation fails, madness and deviance enter the heart, and one cannot rectify oneself, losing authority. Having lost authority, flatterers gain influence, and one not only forgets the principle of preserving life but also forfeits the way to sustain the state’s prosperity. If the body is free from illusory burdens, lifespan extends; ancestral temples endure, and the state remains eternally secure.\n\nThose who preserve life also preserve the state; those who cultivate the Dao also preserve life. This begins by diminishing right and wrong, abandoning arrogance, curbing desires, and forgetting fame and profit. Then, one defends against the assaults of the five colors in the colorless, the five sounds in the soundless, and the five flavors in the tasteless. Do not gallop through the six dusts or rush through the three realms. When ears and eyes perceive nothing, the heart cuts off thought, qi flows harmoniously, spirit does not leave the body, and the body does not leave the spirit. Spirit and body guard each other, and the path of immortality and long life is achieved—the way of preserving life is fulfilled.\n\nPerceiving the emptiness of sound and color, awakening to the insubstantiality of form, with spirit clear and will tranquil, virtue profound and Dao lofty, one does not sink into the pitfalls of life and death but naturally arrives at the boundless mystery.\n\n*The Scripture of Western Ascension* says: *\"To pity others is not as good as cherishing the body; to cherish the body is not as good as loving the spirit; to love the spirit is not as good as containing the spirit; to contain the spirit is not as good as guarding the true. Guarding the true ensures long endurance.\"*\n\nIt also says: *\"The spirit loves people, but people do not love the spirit.\"* Thus, Laozi teaches people to nurture spirit and qi—this is the art of preserving life.\n\n**Governing the State**\nGoverning the world, the state, the family, or the self—none can be rectified without virtue and the Dao. A state governed by non-action simplifies affairs; governed by action, affairs multiply. Simplified affairs calm the heart; multiplied affairs confuse the people. A calm heart stabilizes the state; a confused people endanger it. To leave danger and attain stability, tranquility is the Dao.",
      "overlap_context": " solely in the heart. Thus, teaching people to cultivate the Dao is to cultivate the heart; teaching people to cultivate the heart is to cultivate the Dao.\n\nThe heart cannot be stilled—one stills it by contemplating the Dao. The heart cannot be seen—one clarifies it through the Dao. The two paths of good and evil, all worldly dharmas, arise and perish through the heart. Those who practice the Dao extinguish the heart to merge with the Dao; worldly people indulge the heart and endanger the self.\"",
      "start_char": 7485,
      "end_char": 8710,
      "start_sentence": 353,
      "end_sentence": 411,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 174.2168824672699,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "〔经云〕：是以圣人抱一，为天下式。 又云：知其白，守其黑，为天下式。 法天则地，广其覆载之功，而忘功忘形，不可以尊高轻於天下。 经云：贵以身为天下，若可寄天下； 爱以身为天下，若可托天下。 又云：圣人不为大，故能成其大； 为而不恃，功成不处； 受国之垢，是谓社稷主； 受国不祥，是为天下王。 然后以百姓为刍狗，理大国若烹小鲜，老君之严勖也。 不尚贤，不贵宝，等观庶物，谦下为基，不玩兵黩武，轻榣薄赋，不惑骄矜，无奢淫嗜欲。 是知窃慎畿甸溺酒荒禽，役耕桑之黎庶，戒远方奇珍异兽，劳水陆之疲民。 是知不尚道德，其国不理也。 以无理无化顺天下，以有理有乱之萌生。 《太平经》云：爰清爰静，是知理道本始。 天真皇人谓黄帝曰：未闻身理而国不理者。 夫一人之身，一国之象也。 胸腹之位犹宫室也，四肢之别犹郊境也，骨节之分犹百官也，神犹君也，气犹民也。 知理身则知理国矣。 爱其民则安国，悟其气则全身。 亡者不可存，死者不可生，所以至人销未起之患，理未病之疾。 气难养而易离，民难聚而易散，理之於无事之前，勿追於既逝之后。 二法章 庞细之二法也，神细而气庞，气细而形赢。 炼行修真，求於至道，可炼形同气，炼气同神，炼神合道。 修神而不修气，气灭形终。 修气不修其神，徒延龄而道远矣。 纳气炼心，冲融真粹，导引吐纳，静以太和，神气通流，灵台莹廓，丹景湛凝，凡形便回为真体，岂俟他生。 况迷则是凡，悟则是圣，或可以小中大三乘输其鹰细，或可以三清历其庞细，或可以九天历其庞细，或可以五气历其康细，或可以三才历其赢细，或可以观门历其赢细，或可以根境识三分其庞细，或可魂魄分其厅细，或可有形为赢无形为细，或可道德为细仁义为厅。 经云：大象无形。 《西升经》云：天下柔弱，莫若於气，气莫柔於道。 道，无为之体。 气，阴阳而成。 道则包裹天地，贯通万法。 《南华经》云：包罗无外，妙入细微。 观修章 观则观幻梦之身，修则修道德之行。 忘身忘修，自入玄通之境。 系形系行，沦乎死生之源。 观者，智也。 以智观理，理智冥合，自契中道。 《本际经》云：具一切智，成无上道。 以目视物谓之观，以神悬鉴谓之观，外桔万象，内息众绿，心修众行谓之观。 修方入妙无，渐阶圣行，修习之蹊径也。 《业报经》云：众苦所恼，常为有身，生死轮回，不能自出，以何方便，妄想得除。 太上曰：妄想颠倒皆从心起，强生分别，系念我身，触境生迷，举心皆妄，以此流浪，沦乎生死。 但当定志观身，尽皆虚假，既知虚假，妄想渐除，妄想既除，内外清静。 自悟其道，谓之忘身，既忘其身，幻累自灭。 《庄子》曰：安时处顺，一辰乐不入，此达人之忘身也。 从凡至圣，莫越见、修、成、利四法也。 见有二，一为值遇善友，与讲真经，或自览经教法进趣。 二见者内见玄微，徐清徐静，以至妙极。 修者有三，一小乘、二中乘、三大乘。 成者有三，仙果、真果、圣果。 利者有三，即三果之人各各演教，诱导群品，利物济时也。 此四法出於无等等之法，入乎无等等之法，为利济故有四。 混归妙体，唯一其一，非正观，无以修证。",
      "translated_text": "The *Scripture* states: *\"Thus the sage embraces the One and becomes the model for all under heaven.\"* It also says: *\"Know the white, yet guard the black, and become the model for all under heaven.\"* Following heaven and emulating earth, they expand the work of nurturing and sustaining, yet forget their merit and form, never presuming to exalt themselves above the world. The *Scripture* further says: *\"One who values their body for the sake of the world may be entrusted with the world; one who cherishes their body for the sake of the world may be confided with the world.\"* It also states: *\"The sage does not act great, and thus achieves greatness; acting without attachment, accomplishing without dwelling. Bearing the nation’s disgrace, they become the lord of the altars of soil and grain; bearing the nation’s misfortune, they become the king of all under heaven.\"* Only then, regarding the common people as straw dogs, governing a great state as if frying a small fish—such is Laozi’s solemn exhortation. They do not exalt the worthy, do not prize treasures, regard all things as equal, and take humility as their foundation. They do not indulge in warfare, lighten taxes and corvée, avoid arrogance and pride, and eschew extravagance and excessive desires. They know that those who secretly indulge in wine and lust within the imperial domain, who exhaust the farming and weaving masses, who covet rare treasures and exotic beasts from distant lands, and who wear out the people of water and land—such rulers do not uphold the Dao and virtue, and their states cannot be well-governed. Governing the world with non-action and transformation brings order; governing with action breeds the seeds of chaos. The *Scripture of Great Peace* says: *\"Only in purity and stillness does one know the origin of the governing Dao.\"* The Heavenly Perfected One said to the Yellow Emperor: *\"I have never heard of one who governs their body yet fails to govern their state.\"* The body of one person is the image of a state: the position of the chest and abdomen is like the palace, the limbs like the suburbs and borders, the joints like the hundred officials, the spirit like the ruler, and qi like the people. To know how to govern the body is to know how to govern the state. Loving the people brings stability to the state; comprehending qi preserves the body. What is lost cannot be restored; the dead cannot be revived. Thus, the perfected one dissolves calamities before they arise and governs illnesses before they manifest. Qi is difficult to nurture yet easy to disperse; the people are difficult to gather yet easy to scatter. Govern before matters arise, not after they have passed.\n\n**The Two Methods**\nThe two methods of the vast and the subtle: the spirit is subtle while qi is vast; qi is subtle while form is frail. Refining conduct and cultivating the true, seeking the supreme Dao—one may refine form to merge with qi, refine qi to merge with spirit, and refine spirit to unite with the Dao. Cultivating spirit without cultivating qi leads to the extinction of qi and the end of form. Cultivating qi without cultivating spirit merely prolongs life, yet the Dao remains distant. Absorbing qi and refining the heart, harmonizing the pure and true, practicing breath control and meditation, stillness attaining great harmony—spirit and qi flow unimpeded, the mind’s terrace becomes radiant and vast, the elixir scene settles and congeals. The ordinary form then reverts to the true body—why wait for another life? Moreover, delusion makes one ordinary; awakening makes one a sage. One may employ the Three Vehicles—Small, Medium, and Great—to traverse the subtle and vast, or ascend through the Three Clarities to experience their vastness and subtlety, or pass through the Nine Heavens to do the same, or refine the Five Qi to traverse their health and subtlety, or align with the Three Powers to experience their frailty and subtlety, or observe the gates of perception to discern their vastness and subtlety, or divide the hun and po to distinguish their refinement, or take form as frail and the formless as subtle, or take the Dao and virtue as subtle and benevolence and righteousness as coarse. The *Scripture* says: *\"The greatest image has no form.\"* The *Western Ascension Scripture* states: *\"Nothing in the world is softer than qi; nothing is softer than the Dao.\"* The Dao is the substance of non-action; qi is formed by yin and yang. The Dao envelops heaven and earth and permeates the ten thousand methods. The *Scripture of Southern Florescence* says: *\"It encompasses all without exclusion, entering subtly into the finest details.\"*\n\n**Observation and Cultivation**\nTo observe is to observe the illusory, dreamlike body; to cultivate is to cultivate the conduct of the Dao and virtue. Forgetting the body and forgetting cultivation, one naturally enters the realm of mysterious penetration. Bound to form and conduct, one sinks into the source of life and death. Observation is wisdom. With wisdom, one observes principle; principle and wisdom merge, naturally aligning with the Middle Way. The *Scripture of the Origin* says: *\"Possessing all wisdom, one accomplishes the supreme Dao.\"* Using the eyes to see things is called observation; using the spirit to reflect is called observation. Externally, one withers the ten thousand images; internally, one stills the myriad thoughts—cultivating the heart and myriad practices is called observation. Cultivation leads to entering the wondrous and formless, gradually ascending the sagely path—this is the way of practice. The *Scripture of Karmic Retribution* says: *\"Tormented by all suffering, constantly bound to the body, trapped in the cycle of birth and death, unable to escape—by what means can delusive thoughts be eliminated?\"* The Most High said: *\"Delusive thoughts and inversions all arise from the heart. Forcibly creating distinctions, fixating on the self, encountering circumstances and becoming confused—every thought is delusion. By this, one drifts and sinks into the cycle of birth and death. One should instead focus the mind and observe the body, seeing it as entirely illusory. Once knowing its illusory nature, delusive thoughts gradually fade; once delusive thoughts fade, inner and outer become pure. Awakening to the Dao is called forgetting the body; having forgotten the body, the illusions of bondage naturally vanish.\"* *Zhuangzi* said: *\"Abiding in timeliness and following nature, even a single morning’s joy does not intrude—this is the perfected one’s forgetting of the body.\"* From the ordinary to the sagely, none surpass the four methods of seeing, cultivating, accomplishing, and benefiting. Seeing has two aspects: first, encountering good companions and discussing true scriptures, or personally studying the teachings and advancing in practice; second, inwardly perceiving the subtle and mysterious, gradually attaining purity and stillness, reaching the utmost wonder. Cultivation has three aspects: the Small Vehicle, the Medium Vehicle, and the Great Vehicle. Accomplishment has three aspects: the fruit of immortality, the fruit of the true, and the fruit of the sage. Benefiting has three aspects: those who attain the three fruits each expound the teachings, guiding all beings and benefiting the age. These four methods arise from the unexcelled Dharma and enter the unexcelled Dharma, existing for the sake of benefiting and saving. Merging into the wondrous body, they return to the One—without right observation, there is no cultivation or realization.",
      "overlap_context": "zi teaches people to nurture spirit and qi—this is the art of preserving life.\n\n**Governing the State**\nGoverning the world, the state, the family, or the self—none can be rectified without virtue and the Dao. A state governed by non-action simplifies affairs; governed by action, affairs multiply. Simplified affairs calm the heart; multiplied affairs confuse the people. A calm heart stabilizes the state; a confused people endanger it. To leave danger and attain stability, tranquility is the Dao.",
      "start_char": 8710,
      "end_char": 9922,
      "start_sentence": 412,
      "end_sentence": 468,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.84886384010315,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "大道论竟",
      "translated_text": "The Treatise on the Great Dao Concludes",
      "overlap_context": " Accomplishment has three aspects: the fruit of immortality, the fruit of the true, and the fruit of the sage. Benefiting has three aspects: those who attain the three fruits each expound the teachings, guiding all beings and benefiting the age. These four methods arise from the unexcelled Dharma and enter the unexcelled Dharma, existing for the sake of benefiting and saving. Merging into the wondrous body, they return to the One—without right observation, there is no cultivation or realization.",
      "start_char": 9923,
      "end_char": 9930,
      "start_sentence": 469,
      "end_sentence": 469,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 0.9310867786407471,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\大道论.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}