{
  "source_id": "天口篇",
  "source_file": "chunked_daozang\\天口篇.json",
  "total_chunks": 9,
  "total_original_chars": 9852,
  "total_translated_chars": 54635,
  "total_translation_time": 409.5438494682312,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\天口篇.txt",
    "category": "藏外"
  },
  "full_translation": "**Heaven’s Mouth Chapter**\nThe ancients said: *\"The sage is Heaven’s mouth.\"* I am no sage—how could I presume to speak for Heaven? Yet I do so only to uphold the August Supreme Lord, whose hidden virtue sustains the people below. To rouse the deaf and awaken the blind is but to fulfill the beauty of Heaven’s all-pervading light! To exhort goodness and correct faults is likewise a good cause for universal deliverance. Though my tongue stammers and falters, I do not shirk my dull roots; though the world teems with multitudes, I earnestly beg you to heed my words. Thus I compose these instructional texts, numbering several chapters, and title them *Heaven’s Mouth*, in gratitude for the venerable Cuiweng’s exalted praise.\n\nRespectfully inscribed by Zhang Sanfeng, the Cavernous Mystery Perfected One.\n\n---\n\n**The Orthodox Teaching Chapter**\nFrom ancient times to the present, there have been two teachings—no third. Why two? One is *orthodox*, the other *heterodox*. Why no third? Because there is only *the One*, only *the Dao*.\n\nHow then are they divided? How do they become three? Since the advent of Confucius, Laozi, and Śākyamuni—even unto their continued presence—though they endure, they are no longer merely Confucius, Laozi, or Śākyamuni. Confucius was fundamentally a Confucian, Laozi a Daoist, and Śākyamuni a Buddhist. Yet though they are distinct, they are ultimately undivided; because they are undivided, they must necessarily converge. Thus, one is neither Confucian nor Daoist, neither Daoist nor Buddhist. Śākyamuni, Confucius, and Laozi are all called *the Dao*.\n\nConfucius’s *cutting off the four* [errors], Laozi’s *embracing the One*, and Śākyamuni’s *emptying the five aggregates*—all are forms of self-cultivation. Confucius’s *benevolence toward the people*, Laozi’s *salvation of the world*, and Śākyamuni’s *relief of suffering*—all are acts of benefiting others. In self-cultivation and benefiting others, their aims are one.\n\nThose who distinguish Confucius, Laozi, and Śākyamuni do so because they mistake names for reality, or forms for principles. To see them as Confucian, Daoist, or Buddhist is to fail to see them as such; though they are not Confucian, Daoist, or Buddhist, they remain Confucian, Daoist, and Buddhist. Confucius, Laozi, and Śākyamuni were all ancient sages. The sages’ teachings take *orthodoxy* as their foundation—anything not orthodox is called a *heterodox teaching*.\n\nThe Confucians Yang Zhu and Mo Di, the Daoists’ alchemists, and the Buddhists’ demonic monks—these too are \"three teachings,\" yet they are all heterodox. Thus, those who divide the teachings into three are foolish; those who distinguish orthodoxy from heterodoxy are wise.\n\n---\n\n**The Confucian Canon Chapter**\nBeyond the Six Classics, the only writings worthy of emulation are those of Confucius’s school. They do not discourse on transcending the world or expound on mystical scriptures, lest people fall into perilous chasms without true practice.\n\nConfucius and Yan Hui’s cultivation of the mind aimed only at *retreating to nurture their aspirations* and *acting with righteousness to attain the Dao*. The Dao lies in aiding others—mountains and forests are no different from court and market. The Dao lies in self-cultivation—court and market are unstained by mountains and forests. Thus, their words often contain profound meaning, yet interpreting them is exceedingly difficult, as in the second passage of the *Great Learning*.\n\nConfucius’s *self-cultivation* relied on the *four restraints* [against desire]; Yanzi’s *refinement of the self* did likewise. Before their efforts were perfected, they did not leave their humble alleys; once perfected, they did not forget the state. Thus, they could *seek action in reclusion* and *attain reclusion in action*. In reclusion, Confucius and Yan Hui were present; in action, they were also present. Even in neither action nor reclusion were they absent—*spiritual clarity* resided within them, and *transformations* followed their will. This is the true Great Dao.\n\nConfucius transmitted to Zengzi, Zengzi to Zisi, and the *Doctrine of the Mean* is a work of profound and luminous Daoist subtlety, from which those who awaken to the mystery steal the truth—countless as the sands of the Ganges. After Zisi, Mencius stands foremost. He *held fast to the mind* and *nurtured qi*, neither aiding nor forgetting it, filling heaven and earth, *vast and unyielding*. All may be delivered, silently drawing upon it. The wonder of *flood-like qi* is difficult to express in words. In *refuting heterodoxy and aiding orthodoxy*, he overturned Yang Zhu and Mo Di.\n\nI urge you, scholars and commoners alike: do not seek truth on the three isles of immortals—simply take it from the *Four Books*. Regard Yan Hui, Zengzi, Zisi, and Mencius as your enlightened teachers; take *minister, son, younger brother, and friend* as your practices; regard *body, mind, nature, and life* as your mercury and lead; and *refinement in righteousness and ripening in benevolence* as your ascension. When cultivating the Dao, do not covet its use; when nurturing the Dao, do not hasten its practice; when attaining the Dao, you may then manifest it. If the Dao cannot be manifested, vanish like the wind and return, transmitting it to the famous mountains—its source and flow will endure.\n\n---\n\n**The Chan Essence Chapter**\nWhat is meant by *Śākya*? Śākyamuni said: *\"I delight in ‘Śākya,’ so I established the teaching with ‘Śākya,’ taking it to mean ‘releasing the ten thousand conditions.’\"*\n\nWhat is meant by *Buddha*? The Great Being said: *\"I delight in ‘Buddha,’ so I established the teaching with ‘Buddha,’ taking it to mean ‘awakening sentient beings.’\"*\n\nThus have I heard: the Śākya Lord *departs the world*; thus have I heard: the Buddha Lord *awakens the world*. The entire canon, numbering hundreds of scriptures, aims only at *transcending worldly defilements* and *rousing the deluded*.\n\nThus, Śākyamuni is pure, and the Great Being attains purity. Śākyamuni encompasses purity, and the Great Being universalizes it—not clinging to purity, not destroying purity, not begrudging purity. Even to the point of *no purity, not purity; not purity, yet purity*—this is *great purity*, *perfect purity*.\n\nIf one can chant the tide-sound [of the sutras], one will attain a *pure mind* and a *prajñā mind*. Yet once prajñā is attained, forget prajñā; if prajñā is not forgotten, it is not prajñā. If it is not prajñā, it is not called prajñā; if it is *not-not prajñā*, then it is prajñā.\n\nOne who attains prajñā is called *Śākya*; one who can become Śākya *is* Śākya; there is *Śākya-Śākya*; the Śākya is *not* Śākya-Śākya; the Śākya *itself* is Śākya-Śākya.\n\nThis is called *Buddha*; one who can become Buddha *is* Buddha; there is *Buddha-Buddha*; the Buddha is *not* Buddha-Buddha; the Buddha *itself* is Buddha-Buddha.\n\nŚākyamuni is thus; the Great Being is thus; even the śramaṇa bhikṣus are thus.\n\nCan one become Śākya without this? No.\nCan one become Buddha without this? No.\nWhy is this so?\nŚākya is Śākya; not-Śākya is not Śākya.\nBuddha is Buddha; not-Buddha is not Buddha.\nWhy is this so?\nThere is no Śākya beyond Śākya; to grasp Śākya is to be Śākya.\nThere is no Buddha beyond Buddha; to grasp Buddha is to be Buddha.\nWhy is this so?\nŚākya-Śākya-Śākya: though devoid of Śākya-intent, this is true Śākya-intent.\nBuddha-Buddha-Buddha: though devoid of Buddha-thought, this is true Buddha-thought.\nNot-Śākya yet Śākya—this is the supreme vehicle.\nNot-Buddha yet Buddha—this is the great vehicle.\nThe sutra treasury of Śākya and Buddha:\nit is by becoming Śākya and Buddha that the treasury is formed—this is called the Treasury of the True Dharma Eye.\n\n*Mysterious Sound Chapter*\nMysterious learning takes virtue/power as its essence and the golden elixir as its function; only then can one become an immortal.\nThere are five ranks of immortals, though in truth there are only four.\n\nFirst, the human immortal.\nThe human immortal refines primordial essence to replenish primordial qi, having cultivated the root of immortality. Yet they can only nurture health and do not transcend birth and death—this is the immortal among humans.\n\nSecond, the earthly immortal.\nThe earthly immortal refines primordial qi to congeal the inner elixir, having dispelled the affliction of leakage. Yet they can walk on land and do not leave the dust and soil—this is the immortal among earth.\n\nThird, the divine immortal.\nThe divine immortal refines primordial spirit to transform into primordial spirit, having attained the marvel of spiritual penetration. Water and fire cannot harm them; they are also called water immortals. When they refine spirit to return to emptiness, they become heavenly immortals.\nThus, below the heavenly immortal is the divine immortal; below the divine immortal is the earthly immortal; below the earthly immortal is the human immortal. Below the human immortal, there are only ghosts and no immortals.\nGhosts are pure yin; immortals are pure yang. Humans possess half yin and half yang, thus they do not escape birth and death. To lack the yin half is to become an immortal; to lack the yang half is to become a ghost.\nTherefore, humans exist between the possibility of becoming immortal or ghost—indeed, they temporarily dwell between these two possibilities. To escape this in-between state, one must abide in the ranks of heavenly or divine immortals.\nTurn your head to recognize the shore; let go and leave the dust. Though the elixir classics number ten thousand words, all depends on oneself. To mistake the self for another is to fall into heterodox paths.\nThe writings left by former sages must also be skillfully pondered. It is neither metal nor stone, neither mercury nor lead, neither furnace nor cauldron, neither woman nor man, neither sun nor moon, neither Kun nor Qian, neither father nor mother, neither dragon nor tiger, neither horse nor hare, neither female nor male.\nWhere, then, is the mystery?\nThe mystery lies in the mysterious place.\n\nWhere lies the marvel?\nThe marvel lies in the marvelous place.\nI possess a true transmission, yet dare not speak recklessly;\nPeople possess true feeling, and thus do not shut their doors.\n\nTo broadly accumulate hidden merits is the beginning of immortal rank;\nTo broadly practice convenience is the foundation of immortality;\nTo broadly cultivate cause and effect is the root of immortality.\n\nIf one finds such a person to seek my Dao,\nI would wish to expound the supreme vehicle,\npointing out subtle words,\nso that one sees the azure sky as clouds and mist disperse,\nand departs with a long whistle.\n\n**The Five Virtues Chapter**\nHuman life possesses five virtues,\nwhich I have likened to the five phases of Heaven and Earth,\nand the five channels of the human body.\n\nBenevolence pertains to Wood and the liver;\nRighteousness pertains to Metal and the lungs;\nPropriety pertains to Fire and the heart;\nWisdom pertains to Water and the kidneys;\nTrustworthiness pertains to Earth and the spleen.\n\nThus, not one of the five virtues may be lacking,\njust as not one of the five channels may be severed,\nor one of the five phases may be absent.\n\nAll say Wood cannot be lacking,\nyet why is there no benevolence?\nWithout benevolence, one must lack the thought of nurturing,\nand the liver is already severed,\nso Wood withers and dries!\n\nAll say Metal cannot be lacking,\nyet why is there no righteousness?\nWithout righteousness, one must lack the thought of expediency,\nand the lungs are already severed,\nso Metal rusts and dulls!\n\nAll say Fire cannot be lacking,\nyet why is there no propriety?\nWithout propriety, one must lack a radiant countenance,\nand the heart is already severed,\nso Fire declines and extinguishes!\n\nAll say Water cannot be lacking,\nyet why is there no wisdom?\nWithout wisdom, one must lack a clear and serene intent,\nand the kidneys are already severed,\nso Water darkens and dries!\n\nAll say Earth cannot be lacking,\nyet why is there no trustworthiness?\nWithout trustworthiness, one must lack a sincere and trusting nature,\nand the spleen is already severed,\nso Earth crumbles and collapses!\n\nThus, one who would be human\nmust first possess the five virtues of the heart,\nand only then the five channels of the body.\n\nWhen benevolence is not severed, the liver’s qi flourishes;\nWhen righteousness is not severed, the lungs’ qi is balanced;\nWhen propriety is not severed, the heart’s qi is luminous;\nWhen wisdom is not severed, the kidneys’ qi is numinous;\nWhen trustworthiness is not severed, the spleen’s qi is awakened.\n\nVirtue envelops the body,\nthe body envelops the heart,\nthe body serves the heart,\nand the heart is illuminated by virtue.\n\nThis body is the heart,\nthis heart is the body,\nand this royal virtue is the five channels.\n\nWhen virtue is lost, the channels are lost;\nwhen virtue is perfected, the body is perfected;\nwhen the body is perfected, the channels are perfected.\nOnly then can one assist and harmonize with the five phases of Heaven and Earth.\n\n**The Filial Conduct Chapter**\nThe osmanthus palace displays its pillars and couplets,\nand of the hundred conducts, filial piety comes first.\nIf the cultured ancestor could practice filial piety,\nhis fragrance would endure for ten thousand myriad years.\n\nThus, in one’s own person,\nto accomplish the Dao is to become an immortal;\nto become an immortal is to become a sage;\nto become a sage is to be both worthy and virtuous.\n\nRadiance opens the sun and moon,\nand love and longing connect Earth and Heaven.\nIf the people of the world desire to emulate filial piety,\nknow that filial piety is the origin of the hundred conducts.\n\nWhen Yu Shun ordered the hundred offices, filial piety stood before all commendations;\nWhen King Wen of Zhou rectified the hundred norms, filial piety preceded all good reputations.\nMaster Zeng valued the three ways, yet serving parents was the greatest;\nMaster Min excelled in the four virtues, yet serving his mother was most earnest.\n\nSince ancient times, there have been many filial children—\nI shall briefly expound a few examples.\nDo not regard this as a mere filial classic;\nyou must observe it as a model of filial conduct.\n\nSome carried rice on their backs,\nsome left behind savory broth;\nsome gazed at white clouds,\nsome wore patched robes;\nsome wept until their strength waned,\nsome cherished fresh tangerines;\nsome prayed for bamboo to sprout,\nsome moved stones to flow with springs;\nsome remembered the crow’s return to feed its parent,\nsome entreated the fish to leap from the abyss;\nsome held the An Yang decree,\nsome set aside the *Liao E* ode;\nsome canceled feasts out of longing,\nsome aged their faces in service—\nall were streams of worthy and sagely men,\ncould there be no words of virtuous merit?\n\nAmong their hundred fine deeds,\nnone surpasses the enduring embrace of filial piety.\n\nOnly through filial piety can one befriend others;\nshifting filial piety can become loyalty.\nOnly through filial piety can one model conduct for a wife;\nthrough filial piety, one gains trust among friends.\nOne act of filial piety encompasses the five relationships—\nknow that filial piety can be a moral influence.\n\nSupreme filial piety resides in the heart,\nand love and longing reveal one’s true nature;\nModerate filial piety resides in the body,\nand service and support should be earnest.\n\nThough one may speak of filial piety,\none must both know and practice it.\nThough one may feign filial piety on the face,\none deceives both others and one’s kin.\n\nThe virtue of filial piety is boundless—\neach thought gains a portion,\nportion by portion, inch by inch,\neach inch reaches the heavenly spirits.\n\nFilial, filial, ever filial,\nsincere, sincere, ever sincere.\nI compose this *Filial Classic*,\nthe great classic within the classics.\n\n**The Debauchery and Evil Chapter**\nThe osmanthus palace bears its pillar inscriptions,\nand of the ten thousand evils, debauchery is foremost.\nThus, the retributions for evil are many,\nbut none are as shameful as the retribution for debauchery.\n\nHeaven’s punishments are each wondrous,\nHeaven’s penalties are each manifest.\nSome seduce another’s wife,\nonly for their own wife to be seduced by another;\nSome embrace another’s daughter,\nonly for their own daughter to be embraced by another;\nSome perish by lewdness;\nSome cut off their posterity by lewdness;\nSome squander their family’s wealth;\nSome forfeit their official rank and longevity;\nSome beget base descendants!\nSome follow deceit and fraud,\nand the retributions for debauchery are endless—\nbrush and ink cannot exhaust them.\n\nThis evil—who can let it pass?\nWhy do they not turn back!\n\nOne may say the debauched are full,\nyet punishment arrives only when sins are complete.\nBut the moment one is debauched, retribution follows—\nHeaven’s mirror brooks no leniency.\n\nOne case of a lewd ghost—\nhow lamentable, truly lamentable!\nI urge you, people of the world,\ndo not violate the precept against debauchery.\n\nWhat you have not seen, do not think of;\nwhat you have seen, do not act upon.\nDo not jest with virgins,\ndo not trifle with chaste women.\nWhen you encounter another’s wife or concubine,\nregard her as your sister.\nDo not defile maidservants or male servants,\ndo not dally with courtesans or actresses.\n\nThe rouge and powder of a moment are but fleeting flowers,\nand one’s spirit scatters in an instant.\nTo preserve the body, one must exit the pit;\nto escape suffering, one must cross the shore.\n\nEven with your own wife,\nintimate feelings within the boudoir should be moderated.\nTo give rise to proper thoughts,\none must establish boundaries of reverence and avoidance.\n\nWhether on the birthdays of sages and deities,\nduring solar or lunar eclipses,\non the days of the Stove God’s sacrifice,\non inauspicious days,\nduring dark and gloomy conjunctions,\nor amid thunder and lightning—\none must separate quilts and beds,\nor even beds and chambers.\n\nThe celestial spirits observe one’s reverence,\nand blessings bestow themselves upon those who seek them.\nThe immortals honor one’s integrity,\nand those who seek the Dao shall attain it.\nIf one can further refrain from all evils,\nthey are truly a great hero.\n\n**On Retribution for Giving**\n\nFor families of wealth and nobility, accumulating goodness is easy,\nyet seeking good retribution is not so simple.\nIt is not that goodness goes unrewarded,\nbut that retribution is measured by its weight.\nFor families of poverty and lowliness, accumulating goodness is difficult,\nyet receiving good retribution is not hard.\nIt is not that goodness alone is rewarded,\nbut that retribution is likewise measured by its weight.\nAs for those who are neither rich nor noble, neither poor nor lowly,\ntheir accumulation of goodness and receipt of retribution\nare also meted out in proportion.\n\nBy the measure of gold given:\nWhen the high and noble donate gold, a hundred taels yield ten merits;\nwhen the poor and lowly donate gold, ten taels yield ten merits.\n\nBy the measure of aiding others:\nWhen the rich and noble aid others, helping a hundred yields ten virtues;\nwhen the poor and lowly aid others, helping ten yields ten virtues.\nFor those who are neither rich nor noble, neither poor nor lowly,\nthe standard is set by the common man.\n\nFor the wealthy and noble to claim the standard of the common man is improper;\nto claim the standard of the poor and lowly is even more so.\nWhat one generation amasses, the next dissipates;\nwhat one generation strengthens, the next weakens.\n\nYet if the wealthy and noble act with propriety in their goodness,\neven a few hundred taels will surely bring great retribution—\nthey need only expand and fulfill it.\nFor the poor and lowly to forcibly imitate the common man is unwise;\nto forcibly imitate the wealthy and noble is even more so.\nLack of sustenance breeds transgression,\nand deep hunger and cold invite the resentment of wife and children.\nYet if the poor and lowly act with propriety in their goodness,\neven as their household teeters on collapse,\ngreat retribution will surely follow—\nthey need only weigh and apply it wisely.\n\nHeaven does not fail the good.\nBut if one dwells in wealth and nobility yet hoards their fortune,\nrewarding much goodness with little,\nor swift goodness with delayed retribution,\nand thus neglects the cultivation of virtue,\nthen calamity will not be long in coming,\nand misfortune will be plentiful.\nA once-prosperous clan may vanish in an instant,\nand the gates of a marquisate may crumble to ashes—\nsuch are the consequences.\nIf one dwells in poverty and lowliness yet boasts of their deeds,\nrewarding little goodness with little,\nor delayed goodness with delayed retribution,\nand thus treats virtue with carelessness,\nthen the calamities they invite will be stranger still,\nand their misfortunes more severe.\nAmid the desolation of war,\nor the wandering of plague and sickness,\nsuch fates unfold.\nThe same applies to those who are neither rich nor noble, neither poor nor lowly.\n\nWhy is this so?\nThose who dwell in wealth and nobility\npossess the power and position to accumulate goodness.\nFor one born into such circumstances,\neven if goodness goes unrewarded, it is their due—\nclothed in abundance, fed in abundance,\nrenowned in name, prosperous in life.\nTo enjoy such peace and honor,\nand to pass it on to one’s descendants,\nis itself a form of good retribution.\nYet if they scorn goodness and refuse to act,\nexpecting retribution while indulging in reckless greed,\nthen Heaven will transfer their power to the virtuous,\nshowing no mercy.\n\nThose who dwell in poverty and lowliness\nlack the power and position to accumulate goodness.\nFor one born into such circumstances,\neven small acts of kindness seem unremarkable.\nCherishing words and objects,\nloving others and all things—\nif one can persist in such ways,\npiling earth into mountains,\ngathering water into seas,\ngood retribution will surely follow.\nYet if they spurn goodness and refuse to act,\nexpecting retribution while their hearts grow dim,\nthen Heaven will deepen their hardship,\npunishing the wicked without favor.\n\nThus is the law of good retribution,\nand thus is the law of evil retribution.\nLet those who are neither rich nor noble, neither poor nor lowly observe this.\nLet those who are rich or noble, poor or lowly reflect upon it.\n\nAlas!\nThe principle of giving and retribution\nis seen most clearly by sages and worthies,\nand practiced most greatly by immortals and buddhas.\nEven the chivalrous may sometimes exceed in their deeds,\nyet if the common people could but match the chivalrous,\nit would be enough.\nI, in my youth, delighted in giving,\nand by good fortune ascended to the Nine Heavens,\nthus gaining clear insight into the retribution between heaven and humanity.\nHow could this be mere abstruse theory?\nEven the heart of Heaven operates thus.\nYet what does Heaven say?\n\n**On Fullness and Decline**\n\nThe affairs of the world and the state\nare ever subject to waxing and waning, obscurity and clarity,\nfullness and decline.\nThe common people attribute this to the cycles of Heaven,\nwhile the enlightened ascribe it to the hearts of men.\nTheir reasoning is sound, their words pure—\nwhat commentary could I add?\n\nYet there are those who decline before reaching fullness,\nor who, though destined to decline, do not.\nThe causes and circumstances of such cases\nI shall now expound in detail, to serve as admonition for the world.\n\nThe momentum of a state’s power,\nonce at its peak, begins to wane.\nSome dynasties face turmoil in a single generation,\nand sigh over peril and collapse by the next.\nIf this is called decline,\nwhy do some revive through restoration?\nIf this is not called fullness,\nwhy do great crises suddenly arise?\n\nFor it is when rulers do not draw near to the worthy and capable\nthat treacherous villains corrupt governance;\nwhen they do not cultivate poetry and ritual,\nthat descendants grow extravagant and reckless.\nIn times of peace and prosperity,\none must still harbor thoughts of peril.\nWith foresight and vigilance,\nthe noble-minded should take heed,\nto fulfill Heaven’s allotted span.\nYet even Heaven’s span is not endless—\nif one daily maintains fullness,\nten thousand years may yet be attained.\n\nThe vital energy of a state’s destiny,\nonce plunged into chaos, begins to stabilize.\nSome dynasties, though their fortune wanes, regain their strength;\nthough their power declines, it rises again.\nIf this is not called decline,\nwhy do they teeter like eggs on the brink?\nIf this is called decline,\nwhy do they once more enjoy peace and stability?\n\nFor when one reins in the horse at the cliff’s edge,\ndisaster may yet be averted;\nwhen one turns back upon witnessing the scene,\nthe dynasty’s blessings may endure.\nEven in the smallest pleasures of feasting and drinking,\nit is difficult to sustain unending joy.\nExtending this principle to greater matters,\nthe noble-minded should awaken with urgency,\nto avert Heaven’s ordained calamities.\nYet Heaven’s calamities are not fixed—\nif one daily guards against decline,\neven the mediocre may long endure.\n\nAh!\nThe heart of Heaven lies within human affairs—\nwhy do people not strive for goodness?\n\n**On Praise and Blame**\n\nWhy do people blame me?\nWhy do they praise me?\nWhy do they blame others?\nWhy do they praise others?\n\nOne who craves praise yet falls short of merit invites blame;\none who guards against blame and corrects their faults earns praise.\nThus, those who praise or blame me act without gradual cause,\nwhile I invite praise or blame through gradual deeds.\nThose who praise or blame others act without reason,\nwhile others invite praise or blame for their own reasons.\n\nI love that all under Heaven seek no praise,\nyet act in ways worthy of praise;\nI despise that all under Heaven fear no blame,\nyet indulge in deeds that invite it.\nI am ashamed that all under Heaven, unaware of praise or blame,\nfade into obscurity—\nto fade into obscurity is to self-destruct without others’ blame.\n\nThose who, in life, self-destruct through their faults will surely be praised;\nthose who, in life, self-praise for their merits will surely be blamed.\nYet if praise exceeds truth, the wind of mutual flattery arises;\nif blame exceeds truth, those who demand perfection deserve condemnation.\nLet the world take heed and be warned.\n\n**On Longevity and Shortness**\n\nWho is fated for long life? Who for short?\nGazing from on high, the Emperor sees no separate eyes.\nTo teach all beings to flourish together,\nthe great earth must teem with life.\nThus, benevolence brings longevity, malice brings retribution;\nmerit brings longevity, faults bring reduction;\nnurture brings longevity, harm brings loss.\nEven immortals, Buddhas, and sages may not escape kalpas,\nyet singing may serve as words to summon the lost back.\n\n**On Prosperity and Adversity**\n\nThe prosperous know no endless sorrow,\nwhile the sorrowful lack cultivated virtue.\nFlourishing and withering—two paths like spring and autumn,\nyet I dwell in both, free in concealment or display.\nLife rushes by like an arrow—\nwhy rejoice in prosperity? Why sigh in adversity?\nCircumstances may bind, but not the hero;\nfate may be endured, so play idly.\nReading to cultivate the Dao, one’s noble qi soars like a dragon;\nwith Yan’s gourd and a zither’s notes, Confucius and Xu would approve.\nWith a robe’s lapel and a Fuqin’s strings, I too may follow.\nThe dragon in the hut ascends to the clouds;\nthe donkey by the lake roams carefree.\nClouds rise to become timely rain;\nstreams recede to visit the pine and cypress.\nOr, without ambition for office, like Yan or Wang the woodcutter—\nwhy torment oneself to die in the weeds?\n\n**On Character**\n\nThe boundaries of human character must be clearly discerned.\nSome possess an upright qi, standing apart from the crowd—\nothers call them arrogant, I call them resolute.\nSome dwell in humble light, no different from the world—\nothers call them fickle, I call them harmonious.\nSome roam freely, following their nature—\nothers call them lazy, I call them at ease.\nSome chant and sing as they please, following destiny—\nothers call them mad, I call them enlightened.\nSome hold themselves with solemn dignity, bearing noble restraint—\nothers call them proud, I call them stern.\nSome stand with simple integrity, their nature firm and enduring—\nothers call them dull, I call them unadorned.\nSome distinguish right from profit, free of self-interest—\nothers call them affected, I call them principled.\nSome have lofty hearts, untouched by worldly dust—\nothers call them eccentric, I call them noble.\nSome radiate warmth and harmony, unversed in letters—\nothers call them vulgar, I call them refined.\nSome take stillness as their cause, ignorant of scriptures and repentance—\nothers call them foolish, I call them awakened.\nSome eat and drink no differently, unharmed by cold or heat—\nothers call them strange, I call them immortal.\n\nAmid the mingling of worthy and unworthy,\nsome appear similar yet differ in truth—\none must observe closely.\n\nDo not slight others’ hearts while valuing your own,\ndo not belittle others’ hearts while prizing your own,\ndo not lack others’ hearts while possessing your own—\nthen the spirit of the perfected emerges.\nShun lived in the mountains, differing little from others,\nyet upon hearing one good word or seeing one good deed,\nhe shone like a crimson peak, his radiance filling the sky.\n\n**On Joyful Living**\n\nAn old man from Ancheng said to Lord Weicheng:\n\"I hear that to live in a peaceful age is to be a man of peace—\nwithout hierarchy, dwelling in ease and benevolence.\nDo you know the joys of such a life?\nLet me compose a brief rhapsody for you.\n\nRed dust rolls on;\nthe bitter sea surges.\nFollow me, guard my conduct;\nnurture my vastness, preserve my loftiness.\nPreserve great harmony, dispel worldly cares;\nend strife, lessen contention.\nEndure cold to deepen learning and cultivation;\nforget desires to dwell in the groves.\nAs an official, do no wrong;\nas a scholar, avoid resentment.\nTeach children to shun debauchery and gambling;\ninstruct women to keep the household solemn.\nFarming yields no shortage for taxes;\nstudies neglect not the garden of virtue.\nDrink communal wine to cure deafness;\nbe a pillar among the people.\nDignified in bearing, ancient in appearance;\nunfettered in spirit, whole in essence.\nAmid the clamor of right and wrong,\nall grievances vanish.\"\n\nBe able to release life and abstain from killing;\nthus nurture nature to prolong years.\nWith village elders, discourse on maxims;\nsummon the younger generation to expound merits and faults.\nPerfect oneself to perfect others;\ntransform a thousand faces, ten thousand forms.\nSpread mats in the thatched hall;\ninvite the mountain elder to take the seat of honor.\nPlant lotuses of the gentleman in the pond;\ncultivate chrysanthemums of Master Tao along the fence.\nPlum blossoms fragrance the earth of the mountain;\nbamboo fills the ravine of the recluse.\nAt ease wherever one finds oneself,\ncan one not find joy in what is not joy?\n\nNow you, with furrowed brows and a heart of stagnant blood,\ntread the marketplace;\ncast your body among springs and rocks.\nStaying brings no peace;\nleaving brings no benefit.\nYou love greed and love strife;\nyou crave finery and crave indulgence.\nGround down with the dusty world,\nyou watch the setting sun fade away.\n\nThe distressed man then sighed and said, \"Alas!\nThe immortal elder’s teachings reach even this!\nI humbly receive your instruction.\"\nHe bowed deeply and withdrew.\n\n**On Yielding**\n\nIn a chamber of harmony, in a household of accumulated virtue,\n\"west wall and east hall are fitting places for inscribed maxims.\"\nFor example, when one suffers a loss, many feel indignation.\nYet if I can endure and yield,\nthis is to cultivate harmony for myself\nand to accumulate virtue for my children and grandchildren.\nNow I shall inscribe a few sayings of sages, worthies, and wise men\nto exhort others.\n\nSome say:\n*\"What benefits others benefits oneself;\nwhat suits others suits oneself.\nIf I benefit others but not myself,\nif I suit others but not myself—\"*\nSome say:\n*\"Those who endure losses enjoy abundant fortune;\nthose who profit excessively always lose.\"*\nSome say:\n*\"If everyone were to prevail,\nwho in the world would be left to bear the name of the vanquished?\"*\nSome say:\n*\"The two words 'fullness' and 'emptiness' are decreed by Heaven and Earth;\nwhen one has endured every loss, the calamity is already dispelled.\"*\nI too have a saying:\n*\"When I have endured many losses, Heaven cannot bear it,\nand Heaven will surely grant me advantage.\"*\n\nStudents, take heed!\nThose who endure losses ultimately suffer no loss.\n\n**On Loyalty and Empathy**\n\nLoyalty and empathy are the single thread transmitted by the Proclaimed Sage.\nWhat is this \"single thread that runs through\"?\nLoyalty is the essence, empathy the function.\n\"Loyalty\" means centering the heart;\n\"empathy\" means aligning with the hearts of others.\nDoes not the meaning of \"establishing oneself to establish others\" lie herein?\n\nLoyalty unifies empathy.\nUsing the Way of empathy as benevolence,\none can refrain from imposing what one does not desire,\nand the Heavenly heart remains undisturbed by human desires.\nUsing the Way of empathy in the world,\none can endure offenses without retaliation,\nand the human heart remains free from violent opposition.\nUsing the Way of empathy to govern,\none can refrain from imposing what one detests,\nand the hearts of ministers remain free from cruel policies.\n\nThe principles of sages and worthies,\ndrop by drop, return to their source—\ntruly, they can be practiced throughout one’s life.\n\nIf one merely desires to align with one’s own heart\nbut not with the hearts of others,\nthen one’s heart will surely generate\na mind that favors oneself over others,\na mind that values oneself and devalues others,\na mind that prioritizes oneself and belittles others,\na mind that profits oneself and harms others,\na mind that succeeds oneself and fails others.\nAll such minds are not aligned with the hearts of others.\nIf not aligned with the hearts of others,\nhow can one align with one’s own heart?\nThough one may desire to align with one’s own heart,\ngreed harms the heart;\nif unable to align with one’s own heart,\nendurance corrupts the heart.\nWhen the heart is corrupted, the heart is lost.\nWhen the heart is lost, there is no center.\nWith the center gone, the root of benevolence dies—\nno wonder the heart lacks empathy.\n\nThus, those who are not loyal\nalso fail to uphold the thread of empathy.\nI wish for you, scholars,\nto seek the meaning of this single thread,\nto preserve its truth,\nso that you may not become offenders against the gate of Confucius.\n\n**On Emptiness and Nothingness**\n\nEmptiness and nothingness are the shared teachings of Laozi and the Buddha.\nWhat is emptiness?\nAn empty heart.\nWhen the heart is empty, the spirit is clear;\nwhen the spirit is clear, nature is wise.\nGreat transcendence, great enlightenment arise from this.\nWhat is nothingness?\nNo self.\nWhen there is no self, there are no others;\nwhen there are no others, there are no desires.\nGreat purity, great joy are attained from this.\n\nNow you, my two disciples,\ndo not understand emptiness and nothingness\nbut only seek \"solid existence.\"\nThe term \"solid existence\" sounds fine,\nyet in the end, those who enter delusion are like\nthose who, in their eagerness to seek reality, discuss minerals and metals—\nachieving nothing—\nor those who daily seek existence while reciting Chan verses,\nonly to generate the six dusts.\nOf the infinite sands of the Ganges,\nwho has attained the first *paramita*?\n\nI pity your ignorance;\nI open the gate to your wisdom.\nObserve the empty heart leading to innate wisdom,\nand know that emptiness can grasp reality.\nObserve the absence of self leading to the absence of desire,\nand know that nothingness can encompass existence.\nConfucius had no self;\nYanzi cultivated an empty heart.\nEven Confucians esteemed this—\nhow much more should you?\n\n**On Nurturing Life**\n\nOf all human desires,\nnone surpasses the desire for life.\nTo attain life,\none must value life;\nto value life,\none must never treat life lightly.\nSacrificing oneself to perfect benevolence,\noffering one’s life in the face of danger—\nthis is not treating life lightly.\nPreserving life in ordinary times,\nusing it in critical moments—\nthis differs from a vain existence,\nfor though one may die, one yet lives.\nLoyal ministers, righteous scholars,\nchaste women, steadfast widows—\nonly those who value life can achieve this.\n\nIf one lives in times of peace,\nencounters a flourishing age,\nwhether noble or humble,\nfulfills filial piety and loyalty,\nserves as a pillar for the state,\nor becomes a paragon for the world—\nthen one who cherishes life\nmust know how to nurture it.\n\nThe discourse on nurturing life\ndiffers from the cultivation of truth.\nCultivating truth can escape calamity—\nthis is the Dao.\nNurturing life can prolong years—\nthis is technique.\nYet if one nurtures life without understanding\nthe principles of Heaven, Earth, and humanity from ancient times to the present,\none will ultimately find no effective method.\n\nThe people of antiquity,\nwith their unadorned simplicity,\nharbored few concerns, few thoughts,\nspoke little, laughed little,\nsaw little, heard little,\nwore coarse clothes, ate rough food,\nknew not, sought not—\nthus they preserved their true nature\nand attained long life.\n\nThe people of recent times,\nwith their daily-growing vanity,\nharbor many concerns, many thoughts,\nspeak much, laugh much,\nsee much, hear much,\nwear fine clothes, eat rich food,\nscatter their will, dissipate their spirit—\nthus they often injure their nature\nand hasten their early demise.\n\nThe harmony of Heaven’s Dao lies in its power of return:\nthe sun, though waning, regains its fullness;\nthe moon, though waning, becomes round again;\nrain, though ceasing, brings clear skies;\nthunder, though roaring, returns to silence—\nthus it preserves an undiminished spirit\nand perpetuates the celestial cycles in ever-renewing freshness.\nThe disharmony of human Dao lies in excessive depletion:\nessence is allowed to drain,\nqi is allowed to wane,\nthe spirit ceaselessly moves,\nthe form unsteadily holds—\nthus it is difficult to restore an already exhausted body\nand merely linger in the world from dawn to dusk.\n\nTherefore, for one who nurtures life,\nmedicine and diet come second,\nprotection comes first.\nOne may learn from Heaven’s Dao,\nor one may learn from the ancients.\n\nAlas! How lamentable!\nAll people are bound by the five kalpas.\n\nWhat are the five kalpas?\nBirth, aging, sickness, death, and suffering.\nMust one not be born?\nOne should be born uprightly, born rightly—\nnot born in delusion.\nTo be born as a sage or worthy,\neven if one dies young, is still to have lived—\none’s radiant spirit remains in the world,\none’s reputation endures,\none’s fragrance lingers—\nhow is this different from immortals or buddhas?\nOnly those who live evilly,\nlive cruelly,\nlive brutally—\nafter one life, they will not be born again as they were,\nnot that they will not be born at all,\nbut that they will be born rightly,\ncycle after cycle,\nall falling into evil destinies,\nsuffering uninterrupted torment,\nand though they may wish not to be born, they cannot escape it.\n\nBirth is but one kalpa.\nThus, sinking into the world,\nstruggling in human life,\nunaware of turning the tide, unknowing of change—\nslowly, one grows old: this is another kalpa.\nThus, essence depleted, form withered,\nspirit gone, qi exhausted,\nmedicine cannot replenish,\nnurture cannot restore—\nweakly, one falls ill: this is another kalpa.\nThus, impermanence suddenly arrives,\nthe great limit draws near,\nwhere is one’s home? Who are one’s wife and children?\nHastily, one dies: this is another kalpa.\nThus, evil must be repaid,\ntransgressions must be repaid,\nwandering through the netherworld,\nwhimpering in sorrow—\nthis is extreme suffering, the stirring of karma.\n\nFortunately, if one is reborn one day,\none may be fated for blades and warfare,\nor for water and fire,\nor for various afflictions and hardships,\nor for various trials and poverty—\nstill one will drift endlessly among the five kalpas,\nnot to mention the knife mountains and hells.\nThose who fall into this kalpa\ncannot dissolve their karmic debts\nwithout cause and effect,\nwithout virtue and merit.\n\nThus, in one’s lifetime,\none must cultivate goodness and accumulate blessings,\nreturn to the origin and restore the primordial—\nonly then can one ascend the Terrace of Spring\nand together attain ultimate bliss.\nTo be born is to seek long life;\nto attain long life is to transcend birth;\nto transcend birth is to transcend extinction;\nto transcend extinction is to achieve liberation.\nLet people strive for this!\n\n**On Revering the Divine**\n\nThe divine is that which subtly pervades all things.\nThe Supreme Emperor established teachings through the divine Dao,\nand thus the divine truly governs good and evil.\nAll who are wise, bright, upright, and just\nare entrusted with the divine’s authority.\nThe celestial spirits are the divine,\nguiding all things;\nthe earthly spirits are the deities,\nupholding all things—\nthis is the vast virtue of the divine,\nwhich the people receive daily yet do not perceive.\nOnly by fully exhausting one’s humanity\nto align with Heaven and Earth can this be so.\n\nAs for the sacred peaks, rivers, suburban altars,\ntemples, shrines, and monasteries—\nthe steles erected and images enshrined within\nare all imbued with the spirit of antiquity.\nTheir halls are grand,\ntheir numinous power resplendent—\nall who gaze upon them cannot but stand in solemn reverence.\n\nYet when incense burns brightly, those who pray for blessings multiply;\nwhen supplications are frequent, those who seek blessings arrive—\nhow could the divine be deceived by people?\nThe origins of the divine are manifold,\nbut all arise from the upright qi.\n\nAs the *Discourses of Lu* states:\n\"In the ancestral rites of the sage-kings,\nthose who established laws for the people were enshrined,\nthose who labored to the death in service were enshrined,\nthose who toiled to stabilize the state were sacrificed to,\nthose who averted great disasters were enshrined,\nthose who warded off great calamities were enshrined\"—\nand the mountains, rivers, and altars of the soil and grain\nwere all those who had rendered great merit to the people.\n\nTo \"establish laws for the people\"\nwas never to expect repayment;\nto \"labor to the death in service\"\nwas never to hope for gratitude;\nto \"toil to stabilize the state\"\nwas never to seek favor;\nto \"avert great disasters\" or \"ward off great calamities\"\nwas never to await entreaty.\nTo spread merit and virtue among the people\nwas never to wait for their prayers.\n\nEven in the solemn rites of spring and autumn,\nwith frequent offerings and sacrifices,\nthe ancestral temple’s purpose is merely to pray to the divine\nto protect our lord and state—\nnothing to do with oneself;\nmerely to pray to the divine\nto protect our parents—\nnothing to do with oneself;\nmerely to pray to the divine\nto bless our people and creatures—\nnothing to do with oneself;\nmerely to pray to the divine\nto deliver lost souls and lingering spirits—\nnothing to do with oneself.\n\nMoreover, one purifies one’s body,\ncleanses one’s thoughts,\ncalms one’s concerns,\nwashes one’s heart and liver—\nrevering the heart to revere the divine—\nthus, without seeking blessings, one naturally obtains them.\nTherefore, to revere the divine\nis not as wondrous as revering one’s own heart.\n\nThe human heart is the divine,\nthe divine is the heart.\nOnly without shame in the heart\ncan one be without shame before the divine.\nOne can face the divine,\nand one can face the heart—\nyet the divine is not beyond the heart.\nIt dwells in your chamber,\nit dwells in your heart.\n\nJust as the divine of Heaven abides in the sun,\nand wherever the sunlight shines, nothing is unseen;\nthe divine of the human heart abides in the eyes,\nand wherever the gaze falls, nothing is hidden.\nYet people still seek to flatter and ingratiate themselves with the divine\nto erase their sins and impurities—\nhow could this be possible?\n\nBeware: the way of revering the divine has two paths,\nand the obsequious flattery of the vulgar is not among them.\n\nThe superior person maintains a heart of uprightness and magnanimity, establishing merit and conduct with profound and far-reaching intent. In their dwelling and movements, they fear the divine’s scrutiny, and though blessings and felicity come, they still attribute them to the divine’s consideration. Such a person, though they may never burn incense or hold candles, nor reverently approach the temple gates, has already grasped the great Way of revering the divine.\n\nThe middling person maintains a heart of meticulous reverence, speaking of the Emperor of Heaven with trembling awe. When good thoughts arise, they are spurred by the divine’s encouragement; when merit and virtue accrue, their heart bears the divine’s grace. Such a person, though they may fast, bathe, and pay homage to the bodhisattvas, may be said to follow the lesser Way of revering the divine.\n\nAs for those who outwardly display petty caution while inwardly harboring great wickedness—rushing to and fro on the first and fifteenth days of the month—the divine will say: *\"You come to me, yet I seek you out! Do not flatter me, do not profane me. You offer me incense, and I bind you in chains. Go and reform your heart—only then may it be acceptable!\"*\n\n**On Loving Others**\nOf all things born, humans are the most numinous. Having surpassed other beings in spirit, they must cherish their own lives. Do not scheme against others in secret, do not harm them with sharp weapons, do not poison them with drugs, do not oppress them with power. Those who entrap, injure, poison, or oppress others—whether by fire or other means—face clear punishment by state law and hidden retribution from Heaven; none shall escape in the end.\n\nEven creatures that can speak and dance, plants with fragrance and color, animals that can be tamed and played with, and aquatic beings that can be raised and enjoyed—humans still cherish them. How could humans not be more precious than these?\n\nNow I urge you, people of the world: live together in harmony, do not bully or abuse one another. In your comings and goings, reflect on the virtue of loving others, of accomplishing for others—their reputation, their merit, their affairs, their benefit. For in accomplishing another’s reputation, you accomplish your own; in accomplishing another’s merit, you accomplish your own; in accomplishing another’s affairs, you accomplish your own; in accomplishing another’s benefit, you accomplish your own. All is love.\n\nWhen you accomplish another’s reputation, merit, affairs, or benefit, do not obscure the loyalty of loyal ministers, do not steal the achievements of meritorious officials, do not slander the chastity of widows, do not defame the purity of maidens. Do not envy ability, nor falsely claim another’s skill; do not resent talent, nor conceal another’s gifts. Do not hide goodness, nor steal another’s virtue; do not spread evil, nor imitate another’s wrongdoing. Do not secretly obstruct another’s advancement, do not recklessly erase another’s writings, do not ruin another’s grand undertakings, do not undermine another’s good deeds. Do not thwart another’s noble plans, do not diminish another’s wealth or longevity, do not seize another’s land, do not meddle with another’s property. Do not aid villains in seizing the geomantic fortunes of the virtuous, do not ally with petty men to lead astray the descendants of the renowned. The embrace of universal compassion is too vast to enumerate fully.\n\nThus, the Everlasting Heavenly Worthy tirelessly exhorts: do not humiliate the good and the humble, do not deceive the poor and destitute, do not separate fathers from children, do not divide flesh and blood, do not break marriages, do not mock the deaf and mute. Rescue those in peril, aid those in urgent need, pity the orphaned, tolerate others’ faults, relieve suffering, provide for the hungry and cold, support your kin, assist neighbors and friends, show compassion to widows and orphans, respect the elderly, and cherish the poor. All these are acts of loving others.\n\nAlas! Heaven births countless beings to serve as the ground for the benevolent to practice benevolence, the stage for the good to accumulate goodness. If one can extend their heart broadly and protect and nurture the multitudes—whether dwelling in wealth and nobility or poverty and lowliness—those who love others will surely prosper their descendants or achieve prominence. Heaven blesses the good, the Emperor favors the virtuous; since ancient times, such rewards have been most abundant and swift.\n\nTherefore, to those who wish to know the Way of living in the world, I still urge: love others.\n\n**On Medicine**\nThe Way of medicine can preserve a state or sicken it; medicine in the world can save lives or take them. One cannot be careless in this art. There is a principle within it—learning it is endless, practicing it is boundless.\n\nMedicines are divided into sovereign, minister, assistant, and courier; illnesses are distinguished as deficient or excessive, chronic or acute. Though all physicians can speak of these, few truly understand them. The sages’ learning is refined, yet their aspirations grow ever humbler; their virtue is lofty, yet their hearts remain modest. Those who practice the art of *Qi Huang* should be the same. Do not belittle yourself, do not mislead yourself, do not deceive yourself. To deceive yourself is to deceive others; to mislead yourself is to mislead others; to belittle yourself is to belittle others. The sin of such actions rests upon your own person.\n\nThus, in this Way, achieving merit is easy, but incurring fault is also easy; accumulating blessings is difficult, but inviting disaster is not. To seek merit without fault, blessings without disaster, one must hold oneself in vigilant restraint. The subtleties of pulse and principle are profound; shallow learning cannot grasp them.\n\nNow I urge you, physicians: when entering a patient’s chamber, first inquire about their history—do not experiment with medicines on them. Now I urge you, patients: before the physician, first clarify the cause—do not gamble your life to test the doctor. To gamble your life to test the doctor is your own fault; to experiment with medicines on others is the physician’s fault.\n\nFurthermore, when aiding the critically ill, do not inflate your fees; when saving the destitute, do not calculate payment. If you can clearly discern the symptoms, proceed to rescue them; if you cannot, defer to those more skilled—this is the accumulation of steadfast and sincere goodness.\n\nI further urge you, scholars and literati: study the divine prescriptions extensively, delve deeply into the principles of medicine. Do not hoard knowledge, do not act recklessly—benefit yourself and others. Fan Wenzheng and Lu Xuangong, with the hearts of loyal ministers, devoted great attention to medicine. How could one neglect the Way of medicine?\n\n**On Physiognomy and Divination**\nThe superior person has their physiognomy, the inferior person has theirs, but the middling person has no fixed physiognomy.\n\nThe superior person has their destiny, the inferior person has theirs, but the middling person has no fixed destiny. As for the superior and the inferior, their natures are difficult to alter—this need not be discussed. Now, it is only you, the middling person, neither high nor low, who may rise or fall, now ascending, now descending. Neither high nor low is still low; capable of rising or falling remains low; sometimes rising or falling ultimately remains low—only by breaking free from the low can one cease to be low. Physiognomy is transformed by oneself, destiny is shaped by oneself; the ancients spoke truly and did not deceive you.\n\nEven those who practice physiognomy and divination—though they may excel in reading your form, they cannot read your heart; though they may excel in calculating your fate, they cannot calculate your virtue. If they cannot read your heart, they cannot truly read your form; if they cannot calculate your virtue, they cannot truly calculate your fate. Do not be foolish in accepting physiognomy, for wisdom lies beyond appearances; when the heart is upright, even favorable readings are good. Do not be deceived by divination, for spirit transcends fate; when virtue is steadfast, even one’s destiny is good.\n\nI wish for you, people of the world, to read your own form and calculate your own fate. I wish for you, physiognomists, to urge great cultivation of the heart. I wish for you, diviners, to encourage others to accumulate virtue. All bone and qi—observe what the books describe; all fortune and misfortune—follow what the books predict. Yet when predicting, speak again of virtue; when describing, speak again of the heart. Embed exhortation and transformation within physiognomy and divination, and the Three Ancestors of the *Máyī* tradition and Master Zǐpíng will surely grant you sustenance.\n\n**On Geomancy**\nHeaven covers both good and evil, earth bears both good and evil, and the immortal masters conceal both good and evil for heaven and earth. Heaven covers without partiality, earth bears without partiality, and the immortal masters bestow favor without partiality. When people are swayed by selfish desires, their perception of principle becomes obscured. Geomancy is the principle of heaven. Where there is the principle of heaven, there is no room for human desire—thus, only the wise, upright, sagely, and virtuous can truly discourse on it.\n\nNow, you people of the world recklessly discuss fengshui, profaning the mountain spirits. You exhume the bones of your kin to seek fortune and rank, consult temporal masters to debate blessings and misfortunes, either searching on others’ behalf or seeking for yourselves. You swindle people’s wealth, demand their praise, and with such hearts, how can you know the principle of heaven? \"Nine out of ten geomancers end in poverty\"—what is strange about this?\n\nWhen the immortal masters bestow land, the auspicious receive auspiciousness, and the inauspicious receive inauspiciousness. The auspicious do not receive undue favor, the inauspicious do not incur undeserved blame—principle is impartial, and the heart is clear. I have often discussed geomancy with others, and when speaking of it, I always couple it with retribution—it is no different.\n\nThose who oversee the earth are immortal masters, for their office is that of immortals, not of mortals. If one seeks land from mortals, why not seek immortality from mortals?",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "天口篇 先民有言：“圣为天口。 ”愚非圣，安能代天立言？ 特以维皇上帝，阴骘下民。 发聩振聋，本照临之美意！ 劝善规过，亦普度之良因。 舌端艾艾期期，不辞根钝； 天下林林总总，恳听吾言。 爱作训体文若干篇，名曰《天口》，盖以报碧翁崇褒之意云尔。 洞玄真人臣张三丰书。 正教篇 古今有两教，无三教。 奚有两教？ 曰正曰邪。 奚无三教？ ，惟一惟道。 一何以分？ 分何以三？ 盖自有孔、老、牟尼，乃至有孔、老、牟尼，虽至有孔、老、牟尼，仍非有孔、老、牟尼。 孔固儒也，老固道也，牟尼固释也，然有所分，故究无所分，故以无所分，故必有所合，故不孔亦不老，不老亦不牟尼，牟尼、孔、老，皆名曰道。 孔之绝四，老之抱一，牟尼之空五，皆修己也； 孔之仁民，老之济世，牟尼之救苦，皆利人也:修己利人，其趋一也。 彼世人之别为孔、老、牟尼者，盖以名分不察实也，抑以形分不按理也。 见为孔、老、牟尼，即非孔、老、牟尼，虽非孔、老、牟尼，还是孔、老、牟尼。 孔、老、牟尼，皆古圣人。 圣人之教，以正为教，若非正教，是名邪教。 儒家杨墨，道家方士，释家妖僧，亦三教也。 虽分三教，仍一邪也。 是故分三教者愚，分邪止者智。 儒书篇 六经而外，立言可法者，必推孔门，不谈出世，不讲玄经，盖恐人落身崖壑，无实行也。 \"孔、颜存心，只望人隐居求志，行义达道。 道在济人，山林无非朝市； 道在修己，朝市不染山林。 故出言实多玄义，而解人之索甚难，《大学》第二节； 孔子之修身也； 为仁用四勿，颜子之炼己也。 功夫末纯，不离陋巷，功夫已熟，不忘国家。 故能隐中求行，行中达隐，隐处有孔、颜，行处亦有孔、颜，乃至无行无隐而非有孔、颜，神明在我，变化从心，真大道也。 孔子传曾子，曾子传子思，《中庸》一部，道妙深明，悟玄之家，窃取成真者。 恒河沙数。 子思而后，撅推孟子，持心养气，勿助勿忘，充天塞地，至大至刚，人人得度，默默取将，浩然之妙，口诀难言，辟邪辅正，杨、墨掀翻。 吾愿尔士庶，不须三岛求真，只向《四书》领取，以颜、曾、思、孟为明师，以子臣弟友为功行，以身心性命为汞铅，以义精仁熟为升举。 修道时莫贪用道，养道时莫贪行道，得道时便可显道。 道不可显，飘然而返，传之名山，源流自远。 禅旨篇 于意云何而名为释？ 牟尼云：“吾好释，故以释开教，取释去万缘之意。 ”于意云何而又为佛？ 大士云，\"吾好佛，故以佛设教，取觉悟众生之意。 \"如是我闻，释主离世； 如是我闻，佛主醒世。 全经数百藏，无非超脱尘垢，警悟沉迷。 是故牟尼清净，复得大土清净，牟尼总其清净，大士普其清净，非有所执其清净，非有所坏其清净，非有所吝其清净，乃至无清净、非清净，非清净、亦清净，是大清净，是满清净。 人能呗诵潮音，必得清净心，必得般若心。 但得般若，便忘般若，若不忘般若，即非般若。 既非般若，不名般若，非非般若，乃是般若。 得般若者，是谓之释，是可成释，是有释释，是释非有释释，是释自有释释； 是谓之佛，是可成佛，是有佛佛，是佛非有佛佛，是佛自有佛佛。 牟尼如是也，大士如是也，即沙门比丘亦如是也。",
      "translated_text": "**Heaven’s Mouth Chapter**\nThe ancients said: *\"The sage is Heaven’s mouth.\"* I am no sage—how could I presume to speak for Heaven? Yet I do so only to uphold the August Supreme Lord, whose hidden virtue sustains the people below. To rouse the deaf and awaken the blind is but to fulfill the beauty of Heaven’s all-pervading light! To exhort goodness and correct faults is likewise a good cause for universal deliverance. Though my tongue stammers and falters, I do not shirk my dull roots; though the world teems with multitudes, I earnestly beg you to heed my words. Thus I compose these instructional texts, numbering several chapters, and title them *Heaven’s Mouth*, in gratitude for the venerable Cuiweng’s exalted praise.\n\nRespectfully inscribed by Zhang Sanfeng, the Cavernous Mystery Perfected One.\n\n---\n\n**The Orthodox Teaching Chapter**\nFrom ancient times to the present, there have been two teachings—no third. Why two? One is *orthodox*, the other *heterodox*. Why no third? Because there is only *the One*, only *the Dao*.\n\nHow then are they divided? How do they become three? Since the advent of Confucius, Laozi, and Śākyamuni—even unto their continued presence—though they endure, they are no longer merely Confucius, Laozi, or Śākyamuni. Confucius was fundamentally a Confucian, Laozi a Daoist, and Śākyamuni a Buddhist. Yet though they are distinct, they are ultimately undivided; because they are undivided, they must necessarily converge. Thus, one is neither Confucian nor Daoist, neither Daoist nor Buddhist. Śākyamuni, Confucius, and Laozi are all called *the Dao*.\n\nConfucius’s *cutting off the four* [errors], Laozi’s *embracing the One*, and Śākyamuni’s *emptying the five aggregates*—all are forms of self-cultivation. Confucius’s *benevolence toward the people*, Laozi’s *salvation of the world*, and Śākyamuni’s *relief of suffering*—all are acts of benefiting others. In self-cultivation and benefiting others, their aims are one.\n\nThose who distinguish Confucius, Laozi, and Śākyamuni do so because they mistake names for reality, or forms for principles. To see them as Confucian, Daoist, or Buddhist is to fail to see them as such; though they are not Confucian, Daoist, or Buddhist, they remain Confucian, Daoist, and Buddhist. Confucius, Laozi, and Śākyamuni were all ancient sages. The sages’ teachings take *orthodoxy* as their foundation—anything not orthodox is called a *heterodox teaching*.\n\nThe Confucians Yang Zhu and Mo Di, the Daoists’ alchemists, and the Buddhists’ demonic monks—these too are \"three teachings,\" yet they are all heterodox. Thus, those who divide the teachings into three are foolish; those who distinguish orthodoxy from heterodoxy are wise.\n\n---\n\n**The Confucian Canon Chapter**\nBeyond the Six Classics, the only writings worthy of emulation are those of Confucius’s school. They do not discourse on transcending the world or expound on mystical scriptures, lest people fall into perilous chasms without true practice.\n\nConfucius and Yan Hui’s cultivation of the mind aimed only at *retreating to nurture their aspirations* and *acting with righteousness to attain the Dao*. The Dao lies in aiding others—mountains and forests are no different from court and market. The Dao lies in self-cultivation—court and market are unstained by mountains and forests. Thus, their words often contain profound meaning, yet interpreting them is exceedingly difficult, as in the second passage of the *Great Learning*.\n\nConfucius’s *self-cultivation* relied on the *four restraints* [against desire]; Yanzi’s *refinement of the self* did likewise. Before their efforts were perfected, they did not leave their humble alleys; once perfected, they did not forget the state. Thus, they could *seek action in reclusion* and *attain reclusion in action*. In reclusion, Confucius and Yan Hui were present; in action, they were also present. Even in neither action nor reclusion were they absent—*spiritual clarity* resided within them, and *transformations* followed their will. This is the true Great Dao.\n\nConfucius transmitted to Zengzi, Zengzi to Zisi, and the *Doctrine of the Mean* is a work of profound and luminous Daoist subtlety, from which those who awaken to the mystery steal the truth—countless as the sands of the Ganges. After Zisi, Mencius stands foremost. He *held fast to the mind* and *nurtured qi*, neither aiding nor forgetting it, filling heaven and earth, *vast and unyielding*. All may be delivered, silently drawing upon it. The wonder of *flood-like qi* is difficult to express in words. In *refuting heterodoxy and aiding orthodoxy*, he overturned Yang Zhu and Mo Di.\n\nI urge you, scholars and commoners alike: do not seek truth on the three isles of immortals—simply take it from the *Four Books*. Regard Yan Hui, Zengzi, Zisi, and Mencius as your enlightened teachers; take *minister, son, younger brother, and friend* as your practices; regard *body, mind, nature, and life* as your mercury and lead; and *refinement in righteousness and ripening in benevolence* as your ascension. When cultivating the Dao, do not covet its use; when nurturing the Dao, do not hasten its practice; when attaining the Dao, you may then manifest it. If the Dao cannot be manifested, vanish like the wind and return, transmitting it to the famous mountains—its source and flow will endure.\n\n---\n\n**The Chan Essence Chapter**\nWhat is meant by *Śākya*? Śākyamuni said: *\"I delight in ‘Śākya,’ so I established the teaching with ‘Śākya,’ taking it to mean ‘releasing the ten thousand conditions.’\"*\n\nWhat is meant by *Buddha*? The Great Being said: *\"I delight in ‘Buddha,’ so I established the teaching with ‘Buddha,’ taking it to mean ‘awakening sentient beings.’\"*\n\nThus have I heard: the Śākya Lord *departs the world*; thus have I heard: the Buddha Lord *awakens the world*. The entire canon, numbering hundreds of scriptures, aims only at *transcending worldly defilements* and *rousing the deluded*.\n\nThus, Śākyamuni is pure, and the Great Being attains purity. Śākyamuni encompasses purity, and the Great Being universalizes it—not clinging to purity, not destroying purity, not begrudging purity. Even to the point of *no purity, not purity; not purity, yet purity*—this is *great purity*, *perfect purity*.\n\nIf one can chant the tide-sound [of the sutras], one will attain a *pure mind* and a *prajñā mind*. Yet once prajñā is attained, forget prajñā; if prajñā is not forgotten, it is not prajñā. If it is not prajñā, it is not called prajñā; if it is *not-not prajñā*, then it is prajñā.\n\nOne who attains prajñā is called *Śākya*; one who can become Śākya *is* Śākya; there is *Śākya-Śākya*; the Śākya is *not* Śākya-Śākya; the Śākya *itself* is Śākya-Śākya.\n\nThis is called *Buddha*; one who can become Buddha *is* Buddha; there is *Buddha-Buddha*; the Buddha is *not* Buddha-Buddha; the Buddha *itself* is Buddha-Buddha.\n\nŚākyamuni is thus; the Great Being is thus; even the śramaṇa bhikṣus are thus.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1240,
      "start_sentence": 0,
      "end_sentence": 59,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.05789852142334,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "不如是能成释不？ 不也。 不如是能成佛不？ 不也。 何以故？ 即释是释，非释即非释； 即佛是佛，非佛即非佛。 何以故？ 释外无释，取释为释； 佛外无佛，取佛为佛。 何以故？ 释释释意，并无释意，乃已释意； 佛佛佛念，并无佛念，乃实佛念。 不释而释者上乘，不佛而佛者大乘。 释佛之经藏； 即释佛而成藏，是谓正法眼藏。 玄音篇 玄学以功德为体，金丹为用，而后可以成仙。 仙品有五，实言之则只四。 一曰人仙。 人仙者，炼元精而补元气，已培修仙之本，然能养健，不离生死，此人中仙也。 一曰地仙。 地仙者，炼元气而结内丹，已无漏通之患，然可陆行，不离尘土央； \"此地中仙也。 一曰神仙。 神仙者，炼元杰而化元神，已有神通之妙，水火无害，又名水仙； 炼神还虚，即天仙也。 是故天仙而下为神仙，神仙而下为地仙，地仙而下为人仙，人仙而下，则有鬼而无仙也。 鬼者纯阴，仙者纯阳，人得半阴半阳，则不离乎生死，缺阴之半则成仙，缺阳之半则成鬼。 故人在可仙可鬼之中，亦暂在可仙可鬼之中，欲逃出可仙可鬼之中，即当住天仙、神仙之中。 回头识岸，撒手离尘，丹经万言，总在自己，认己为他，即落旁门。 前圣遗书，亦须善玩，非金非石，非汞非铅，非炉非鼎，非女非男，非日非月，非坤非乾，非公非母，非龙非虎，非马非兔，非牝非牡。 玄在何处？ 玄在玄处。",
      "translated_text": "Can one become Śākya without this? No.\nCan one become Buddha without this? No.\nWhy is this so?\nŚākya is Śākya; not-Śākya is not Śākya.\nBuddha is Buddha; not-Buddha is not Buddha.\nWhy is this so?\nThere is no Śākya beyond Śākya; to grasp Śākya is to be Śākya.\nThere is no Buddha beyond Buddha; to grasp Buddha is to be Buddha.\nWhy is this so?\nŚākya-Śākya-Śākya: though devoid of Śākya-intent, this is true Śākya-intent.\nBuddha-Buddha-Buddha: though devoid of Buddha-thought, this is true Buddha-thought.\nNot-Śākya yet Śākya—this is the supreme vehicle.\nNot-Buddha yet Buddha—this is the great vehicle.\nThe sutra treasury of Śākya and Buddha:\nit is by becoming Śākya and Buddha that the treasury is formed—this is called the Treasury of the True Dharma Eye.\n\n*Mysterious Sound Chapter*\nMysterious learning takes virtue/power as its essence and the golden elixir as its function; only then can one become an immortal.\nThere are five ranks of immortals, though in truth there are only four.\n\nFirst, the human immortal.\nThe human immortal refines primordial essence to replenish primordial qi, having cultivated the root of immortality. Yet they can only nurture health and do not transcend birth and death—this is the immortal among humans.\n\nSecond, the earthly immortal.\nThe earthly immortal refines primordial qi to congeal the inner elixir, having dispelled the affliction of leakage. Yet they can walk on land and do not leave the dust and soil—this is the immortal among earth.\n\nThird, the divine immortal.\nThe divine immortal refines primordial spirit to transform into primordial spirit, having attained the marvel of spiritual penetration. Water and fire cannot harm them; they are also called water immortals. When they refine spirit to return to emptiness, they become heavenly immortals.\nThus, below the heavenly immortal is the divine immortal; below the divine immortal is the earthly immortal; below the earthly immortal is the human immortal. Below the human immortal, there are only ghosts and no immortals.\nGhosts are pure yin; immortals are pure yang. Humans possess half yin and half yang, thus they do not escape birth and death. To lack the yin half is to become an immortal; to lack the yang half is to become a ghost.\nTherefore, humans exist between the possibility of becoming immortal or ghost—indeed, they temporarily dwell between these two possibilities. To escape this in-between state, one must abide in the ranks of heavenly or divine immortals.\nTurn your head to recognize the shore; let go and leave the dust. Though the elixir classics number ten thousand words, all depends on oneself. To mistake the self for another is to fall into heterodox paths.\nThe writings left by former sages must also be skillfully pondered. It is neither metal nor stone, neither mercury nor lead, neither furnace nor cauldron, neither woman nor man, neither sun nor moon, neither Kun nor Qian, neither father nor mother, neither dragon nor tiger, neither horse nor hare, neither female nor male.\nWhere, then, is the mystery?\nThe mystery lies in the mysterious place.",
      "overlap_context": "is not prajñā, it is not called prajñā; if it is *not-not prajñā*, then it is prajñā.\n\nOne who attains prajñā is called *Śākya*; one who can become Śākya *is* Śākya; there is *Śākya-Śākya*; the Śākya is *not* Śākya-Śākya; the Śākya *itself* is Śākya-Śākya.\n\nThis is called *Buddha*; one who can become Buddha *is* Buddha; there is *Buddha-Buddha*; the Buddha is *not* Buddha-Buddha; the Buddha *itself* is Buddha-Buddha.\n\nŚākyamuni is thus; the Great Being is thus; even the śramaṇa bhikṣus are thus.",
      "start_char": 1240,
      "end_char": 1771,
      "start_sentence": 60,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.660720348358154,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "妙在何处？ 妙在妙处。 我有真传，不敢妄，言； 人有真情，亦不闭门。 广积阴功，始为仙品； 广行方便，始是仙基； 广修因果，始是仙根。 若得是人而求吾道，吾愿与说最上乘法，指点微言，必如拨云雾而见青天，长啸而去。 五德篇 人生有五德，吾尝以譬天地之五行。 人身之五经，仁属木也，肝也； 义属金也，肺也； 礼属火也，心也； 智属水也，肾也； 信属土也，脾也。 是知五德之不可少一，犹如五经之不可绝一，即如五行之不可缺一。 人皆曰木不可少也，而何以无仁也？ 无仁者，必无养育之念，其肝己绝，而木为之稿枯矣！ 人皆曰金不可少也，而何以无义也？ 无义者，必无权宜之思，其肺已绝。 而金为之朽钝矣！ 人皆曰火不可少也，而何以无礼也？ 无礼者，必无光明之色，其心已绝，而火为之衰熄矣； 人皆曰水不可少也，而何以无智也？ 无智者，必无清澄之意，其肾已绝，而水为之昏涸矣，人皆曰土不可少也，而何以无信也？ 无信者，必无交孚之情，其脾已绝，而土为之分崩矣。 是知为人者。 必先有心之五德，而后有身之五经。 仁不绝肝气生，义不绝肺气平，礼不绝心气明，智不绝肾气灵，信不绝脾气醒。 德包乎身，身包乎心，身为心用，心以德明。 是身即心，是心即身，是王德即五经。 德失经失，德成身成，身成经成，而后可以参赞天地之五行。 孝行篇 桂宫列楹联，百行孝为先。 文祖能行孝，馨香万万年。 故其于一身，成道即成仙，成仙即成圣，成圣即兼贤。 光明开日月，爱慕通地天。 世人欲希孝，孝真百行原。 虞舜百揆叙，孝在明扬前。 周文百度贞，孝居令闻先。 曾子贵三道，事亲独大焉。 闵子冠四科，事母独殷然。 古来多孝子，略略为敷宣。 莫作孝典看，须作孝则观。 或为米之负，或遗羹之甘，或瞻云之白，或表衣之斑，或哭杖力减，或怀橘味鲜，或祷竹生笋，或感石流泉，或念乌反哺，或祈鱼跃渊，或捧安阳檄，或废《蓼莪》篇，或思而罢宴，或奉而刻颜，此皆贤哲流，岂无德功言！ 就其百事好，不若孝缠绵。 惟孝始能友，移孝可作忠，惟孝型于妻，以孝信乎朋，一孝包五伦，须知孝可风。 至孝孝在心，爱慕见天真； 中孝孝在身，奉养宜殷勤。 口中虽讲孝，能道要能行。 面上徒妆孝，欺人并欺亲。 孝德无穷尽，一念得一分，分分而寸寸，寸寸格天神。 孝孝复孝孝，肫肫复肫肫，我作此《孝经》，经中之大经。 淫恶篇 桂宫题楹帖，万恶淫为首。 所以恶报多，不如淫报丑。 天刑件件奇，天罚样样有。 或诱他人妻，己妻为人诱； 或搂他人女，己女为人搂； 或以奸杀身； 或以奸绝后； 或倾家业财； 或夺功名寿； 或生子孙贱！ 或随诳骗走，淫报极纷纷，笔谈难缕缕。 此恶放过谁，伊胡不回首！ 漫曰淫者盈，罪满报方临，即淫即有报，天鉴不容情。 一条淫鬼案，可叹真可叹！ 劝汝世间人，莫把淫戒犯。 未见不可思，既见不可乱。 处女不可戏，节妇不可玩。 遇人妻妾女，当作姊妹看。 勿污婢与奴，勿狎①妓与旦。 红粉一时花，精神一刻散。 保身须出坑，离苦须过岸。 即汝妻与妻，闺情亦宜节。 欲生端相几，须立敬避格。 或逢圣神诞，或逢日月食，或当祀灶期，或当忌辰日，或遇阴晦交，或遇雷电疾，必分被与床，或分床与室。",
      "translated_text": "Where lies the marvel?\nThe marvel lies in the marvelous place.\nI possess a true transmission, yet dare not speak recklessly;\nPeople possess true feeling, and thus do not shut their doors.\n\nTo broadly accumulate hidden merits is the beginning of immortal rank;\nTo broadly practice convenience is the foundation of immortality;\nTo broadly cultivate cause and effect is the root of immortality.\n\nIf one finds such a person to seek my Dao,\nI would wish to expound the supreme vehicle,\npointing out subtle words,\nso that one sees the azure sky as clouds and mist disperse,\nand departs with a long whistle.\n\n**The Five Virtues Chapter**\nHuman life possesses five virtues,\nwhich I have likened to the five phases of Heaven and Earth,\nand the five channels of the human body.\n\nBenevolence pertains to Wood and the liver;\nRighteousness pertains to Metal and the lungs;\nPropriety pertains to Fire and the heart;\nWisdom pertains to Water and the kidneys;\nTrustworthiness pertains to Earth and the spleen.\n\nThus, not one of the five virtues may be lacking,\njust as not one of the five channels may be severed,\nor one of the five phases may be absent.\n\nAll say Wood cannot be lacking,\nyet why is there no benevolence?\nWithout benevolence, one must lack the thought of nurturing,\nand the liver is already severed,\nso Wood withers and dries!\n\nAll say Metal cannot be lacking,\nyet why is there no righteousness?\nWithout righteousness, one must lack the thought of expediency,\nand the lungs are already severed,\nso Metal rusts and dulls!\n\nAll say Fire cannot be lacking,\nyet why is there no propriety?\nWithout propriety, one must lack a radiant countenance,\nand the heart is already severed,\nso Fire declines and extinguishes!\n\nAll say Water cannot be lacking,\nyet why is there no wisdom?\nWithout wisdom, one must lack a clear and serene intent,\nand the kidneys are already severed,\nso Water darkens and dries!\n\nAll say Earth cannot be lacking,\nyet why is there no trustworthiness?\nWithout trustworthiness, one must lack a sincere and trusting nature,\nand the spleen is already severed,\nso Earth crumbles and collapses!\n\nThus, one who would be human\nmust first possess the five virtues of the heart,\nand only then the five channels of the body.\n\nWhen benevolence is not severed, the liver’s qi flourishes;\nWhen righteousness is not severed, the lungs’ qi is balanced;\nWhen propriety is not severed, the heart’s qi is luminous;\nWhen wisdom is not severed, the kidneys’ qi is numinous;\nWhen trustworthiness is not severed, the spleen’s qi is awakened.\n\nVirtue envelops the body,\nthe body envelops the heart,\nthe body serves the heart,\nand the heart is illuminated by virtue.\n\nThis body is the heart,\nthis heart is the body,\nand this royal virtue is the five channels.\n\nWhen virtue is lost, the channels are lost;\nwhen virtue is perfected, the body is perfected;\nwhen the body is perfected, the channels are perfected.\nOnly then can one assist and harmonize with the five phases of Heaven and Earth.\n\n**The Filial Conduct Chapter**\nThe osmanthus palace displays its pillars and couplets,\nand of the hundred conducts, filial piety comes first.\nIf the cultured ancestor could practice filial piety,\nhis fragrance would endure for ten thousand myriad years.\n\nThus, in one’s own person,\nto accomplish the Dao is to become an immortal;\nto become an immortal is to become a sage;\nto become a sage is to be both worthy and virtuous.\n\nRadiance opens the sun and moon,\nand love and longing connect Earth and Heaven.\nIf the people of the world desire to emulate filial piety,\nknow that filial piety is the origin of the hundred conducts.\n\nWhen Yu Shun ordered the hundred offices, filial piety stood before all commendations;\nWhen King Wen of Zhou rectified the hundred norms, filial piety preceded all good reputations.\nMaster Zeng valued the three ways, yet serving parents was the greatest;\nMaster Min excelled in the four virtues, yet serving his mother was most earnest.\n\nSince ancient times, there have been many filial children—\nI shall briefly expound a few examples.\nDo not regard this as a mere filial classic;\nyou must observe it as a model of filial conduct.\n\nSome carried rice on their backs,\nsome left behind savory broth;\nsome gazed at white clouds,\nsome wore patched robes;\nsome wept until their strength waned,\nsome cherished fresh tangerines;\nsome prayed for bamboo to sprout,\nsome moved stones to flow with springs;\nsome remembered the crow’s return to feed its parent,\nsome entreated the fish to leap from the abyss;\nsome held the An Yang decree,\nsome set aside the *Liao E* ode;\nsome canceled feasts out of longing,\nsome aged their faces in service—\nall were streams of worthy and sagely men,\ncould there be no words of virtuous merit?\n\nAmong their hundred fine deeds,\nnone surpasses the enduring embrace of filial piety.\n\nOnly through filial piety can one befriend others;\nshifting filial piety can become loyalty.\nOnly through filial piety can one model conduct for a wife;\nthrough filial piety, one gains trust among friends.\nOne act of filial piety encompasses the five relationships—\nknow that filial piety can be a moral influence.\n\nSupreme filial piety resides in the heart,\nand love and longing reveal one’s true nature;\nModerate filial piety resides in the body,\nand service and support should be earnest.\n\nThough one may speak of filial piety,\none must both know and practice it.\nThough one may feign filial piety on the face,\none deceives both others and one’s kin.\n\nThe virtue of filial piety is boundless—\neach thought gains a portion,\nportion by portion, inch by inch,\neach inch reaches the heavenly spirits.\n\nFilial, filial, ever filial,\nsincere, sincere, ever sincere.\nI compose this *Filial Classic*,\nthe great classic within the classics.\n\n**The Debauchery and Evil Chapter**\nThe osmanthus palace bears its pillar inscriptions,\nand of the ten thousand evils, debauchery is foremost.\nThus, the retributions for evil are many,\nbut none are as shameful as the retribution for debauchery.\n\nHeaven’s punishments are each wondrous,\nHeaven’s penalties are each manifest.\nSome seduce another’s wife,\nonly for their own wife to be seduced by another;\nSome embrace another’s daughter,\nonly for their own daughter to be embraced by another;\nSome perish by lewdness;\nSome cut off their posterity by lewdness;\nSome squander their family’s wealth;\nSome forfeit their official rank and longevity;\nSome beget base descendants!\nSome follow deceit and fraud,\nand the retributions for debauchery are endless—\nbrush and ink cannot exhaust them.\n\nThis evil—who can let it pass?\nWhy do they not turn back!\n\nOne may say the debauched are full,\nyet punishment arrives only when sins are complete.\nBut the moment one is debauched, retribution follows—\nHeaven’s mirror brooks no leniency.\n\nOne case of a lewd ghost—\nhow lamentable, truly lamentable!\nI urge you, people of the world,\ndo not violate the precept against debauchery.\n\nWhat you have not seen, do not think of;\nwhat you have seen, do not act upon.\nDo not jest with virgins,\ndo not trifle with chaste women.\nWhen you encounter another’s wife or concubine,\nregard her as your sister.\nDo not defile maidservants or male servants,\ndo not dally with courtesans or actresses.\n\nThe rouge and powder of a moment are but fleeting flowers,\nand one’s spirit scatters in an instant.\nTo preserve the body, one must exit the pit;\nto escape suffering, one must cross the shore.\n\nEven with your own wife,\nintimate feelings within the boudoir should be moderated.\nTo give rise to proper thoughts,\none must establish boundaries of reverence and avoidance.\n\nWhether on the birthdays of sages and deities,\nduring solar or lunar eclipses,\non the days of the Stove God’s sacrifice,\non inauspicious days,\nduring dark and gloomy conjunctions,\nor amid thunder and lightning—\none must separate quilts and beds,\nor even beds and chambers.",
      "overlap_context": " thousand words, all depends on oneself. To mistake the self for another is to fall into heterodox paths.\nThe writings left by former sages must also be skillfully pondered. It is neither metal nor stone, neither mercury nor lead, neither furnace nor cauldron, neither woman nor man, neither sun nor moon, neither Kun nor Qian, neither father nor mother, neither dragon nor tiger, neither horse nor hare, neither female nor male.\nWhere, then, is the mystery?\nThe mystery lies in the mysterious place.",
      "start_char": 1771,
      "end_char": 3017,
      "start_sentence": 94,
      "end_sentence": 171,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.47841691970825,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "天神察其恭，求福福自锡。 天仙重其操，访道道可获。 再能免诸恶，更是大豪杰。 施报篇 富贵之家积善易，欲求善报则不易，非不报善也，必衡其量而报之； 贫贱之家积善难，而得善报则不难，非独报善也，亦衡其量而报之； 至于非富非贵、非贫非贱者，积善获报，亦称量予之也。 以助金论，宫贵助金，百金十功； 贫贱助金，十全十功。 以济人论，富贵济人，百人十善； 贫贱济人，十人十善； 非富非贵、非贫非贱者，自当以中人定论也。 富贵而借口中人不可，借口贫贱尤不可，前人聚后人消矣，前人强后人弱矣。 虽然，富贵而行善得当，寥寥数百金，亦必有大报也，但当扩而充之耳； 贫贱而强学中人不可，强学富贵尤不可，奉养缺罪过生矣，冻馁深妻子怨矣，虽然，贫贱而行善得当，茫茫家道倾，必即有大报也，但当权而用之耳。 天固不负善人也，倘有居富贵而吝贸财，以善多而报少，以善速而报迟，遂不留心作善者，其召祸必不常，其逢凶必不少，望族转瞬而冰消，侯门再过而灰烬，均此类也； 居贫贱而谈功果，以善少而报少，以善迟而报迟，遂敢轻心视善者，其召祸必更奇，其逢凶必更甚，惨淡刀兵之际，流离病疫之间，皆由此也； 其处非富非贵、非贫非贱者，亦是此例。 何也？ 身居富贵者，有积善之势，有积善之权，人生处此，即有善而无报，亦分内事，衣丰食丰，声有名有，但得常常若此，享其安荣，及其子孙，是亦善报矣，乃敢薄善而不为，以望报肆其狂贪，故上天转移其权而与善士，绝不肯稍留馀情； 居贫贱者，无积善之势，无积善之权七八学处此，遇小善而即行，似非奇事，惜字惜物，爱人爱物，但得常常惹此，结土成山，结水成海，必得善报矣，乃敢非善而不为，以望报昏其心志，故上天益加其穷，以诛恶类，绝不肯稍存私覆。 善报如是，恶报如是。 非富非贵、非贫非贱者，请试观之，尔富尔贵、尔贫尔贱者，请试思之。 嗟乎！ 施报之理，惟圣贤看之甚明，惟仙佛处之甚大，豪侠之士或有过情者，然世人能如豪侠亦足矣。 吾也少好施与，幸上九清，故于天人报应，洞澈颇详。 此岂玄微之说哉！ 虽天心亦皆如是也。 然天何言哉！ 盈亏篇 天下国家之事，尝有消长晦明，一盈一亏。 常人目为天运，达士归之人心，理固正也，词固醇也，吾何议论之云云。 然世有未盈则亏，欲亏不亏者，此情此故，吾当蟹蟹发明，以为世劝。 国家之气势，安极始危，乃有一传而生事变，再世而叹危亡者。 谓为亏欤，何以尚有中兴？ 谓非盈欤，何以忽萌大难？ 盖不亲贤才，则奸雄坏政； 不敦诗礼，则子孙奢狂。 人事承平之会，当存履险之思。 思想预防，君子宜儆惕焉，以尽上天之历数，然天亦无尽数之时也，人日持盈，万万年亦可至耳。 国家之气机，乱极始治，乃有运将衰而复盛，势稍降而复升者。 谓不亏欤，何以几邻累卵？ 谓已亏软，何以复享安盘？ 盖临崖勒辔，即可免其颠危； 触景回头，自可绵其世祚。 人情宴饮之微，尚难存尽欢之想，即小征大，君子宜猛省焉，以挽上天之劫数，然天亦无劫数之见也，人日畏亏，平平者自可久耳； 咦！ 天心在人事中矣，人何不勉于善哉！",
      "translated_text": "The celestial spirits observe one’s reverence,\nand blessings bestow themselves upon those who seek them.\nThe immortals honor one’s integrity,\nand those who seek the Dao shall attain it.\nIf one can further refrain from all evils,\nthey are truly a great hero.\n\n**On Retribution for Giving**\n\nFor families of wealth and nobility, accumulating goodness is easy,\nyet seeking good retribution is not so simple.\nIt is not that goodness goes unrewarded,\nbut that retribution is measured by its weight.\nFor families of poverty and lowliness, accumulating goodness is difficult,\nyet receiving good retribution is not hard.\nIt is not that goodness alone is rewarded,\nbut that retribution is likewise measured by its weight.\nAs for those who are neither rich nor noble, neither poor nor lowly,\ntheir accumulation of goodness and receipt of retribution\nare also meted out in proportion.\n\nBy the measure of gold given:\nWhen the high and noble donate gold, a hundred taels yield ten merits;\nwhen the poor and lowly donate gold, ten taels yield ten merits.\n\nBy the measure of aiding others:\nWhen the rich and noble aid others, helping a hundred yields ten virtues;\nwhen the poor and lowly aid others, helping ten yields ten virtues.\nFor those who are neither rich nor noble, neither poor nor lowly,\nthe standard is set by the common man.\n\nFor the wealthy and noble to claim the standard of the common man is improper;\nto claim the standard of the poor and lowly is even more so.\nWhat one generation amasses, the next dissipates;\nwhat one generation strengthens, the next weakens.\n\nYet if the wealthy and noble act with propriety in their goodness,\neven a few hundred taels will surely bring great retribution—\nthey need only expand and fulfill it.\nFor the poor and lowly to forcibly imitate the common man is unwise;\nto forcibly imitate the wealthy and noble is even more so.\nLack of sustenance breeds transgression,\nand deep hunger and cold invite the resentment of wife and children.\nYet if the poor and lowly act with propriety in their goodness,\neven as their household teeters on collapse,\ngreat retribution will surely follow—\nthey need only weigh and apply it wisely.\n\nHeaven does not fail the good.\nBut if one dwells in wealth and nobility yet hoards their fortune,\nrewarding much goodness with little,\nor swift goodness with delayed retribution,\nand thus neglects the cultivation of virtue,\nthen calamity will not be long in coming,\nand misfortune will be plentiful.\nA once-prosperous clan may vanish in an instant,\nand the gates of a marquisate may crumble to ashes—\nsuch are the consequences.\nIf one dwells in poverty and lowliness yet boasts of their deeds,\nrewarding little goodness with little,\nor delayed goodness with delayed retribution,\nand thus treats virtue with carelessness,\nthen the calamities they invite will be stranger still,\nand their misfortunes more severe.\nAmid the desolation of war,\nor the wandering of plague and sickness,\nsuch fates unfold.\nThe same applies to those who are neither rich nor noble, neither poor nor lowly.\n\nWhy is this so?\nThose who dwell in wealth and nobility\npossess the power and position to accumulate goodness.\nFor one born into such circumstances,\neven if goodness goes unrewarded, it is their due—\nclothed in abundance, fed in abundance,\nrenowned in name, prosperous in life.\nTo enjoy such peace and honor,\nand to pass it on to one’s descendants,\nis itself a form of good retribution.\nYet if they scorn goodness and refuse to act,\nexpecting retribution while indulging in reckless greed,\nthen Heaven will transfer their power to the virtuous,\nshowing no mercy.\n\nThose who dwell in poverty and lowliness\nlack the power and position to accumulate goodness.\nFor one born into such circumstances,\neven small acts of kindness seem unremarkable.\nCherishing words and objects,\nloving others and all things—\nif one can persist in such ways,\npiling earth into mountains,\ngathering water into seas,\ngood retribution will surely follow.\nYet if they spurn goodness and refuse to act,\nexpecting retribution while their hearts grow dim,\nthen Heaven will deepen their hardship,\npunishing the wicked without favor.\n\nThus is the law of good retribution,\nand thus is the law of evil retribution.\nLet those who are neither rich nor noble, neither poor nor lowly observe this.\nLet those who are rich or noble, poor or lowly reflect upon it.\n\nAlas!\nThe principle of giving and retribution\nis seen most clearly by sages and worthies,\nand practiced most greatly by immortals and buddhas.\nEven the chivalrous may sometimes exceed in their deeds,\nyet if the common people could but match the chivalrous,\nit would be enough.\nI, in my youth, delighted in giving,\nand by good fortune ascended to the Nine Heavens,\nthus gaining clear insight into the retribution between heaven and humanity.\nHow could this be mere abstruse theory?\nEven the heart of Heaven operates thus.\nYet what does Heaven say?\n\n**On Fullness and Decline**\n\nThe affairs of the world and the state\nare ever subject to waxing and waning, obscurity and clarity,\nfullness and decline.\nThe common people attribute this to the cycles of Heaven,\nwhile the enlightened ascribe it to the hearts of men.\nTheir reasoning is sound, their words pure—\nwhat commentary could I add?\n\nYet there are those who decline before reaching fullness,\nor who, though destined to decline, do not.\nThe causes and circumstances of such cases\nI shall now expound in detail, to serve as admonition for the world.\n\nThe momentum of a state’s power,\nonce at its peak, begins to wane.\nSome dynasties face turmoil in a single generation,\nand sigh over peril and collapse by the next.\nIf this is called decline,\nwhy do some revive through restoration?\nIf this is not called fullness,\nwhy do great crises suddenly arise?\n\nFor it is when rulers do not draw near to the worthy and capable\nthat treacherous villains corrupt governance;\nwhen they do not cultivate poetry and ritual,\nthat descendants grow extravagant and reckless.\nIn times of peace and prosperity,\none must still harbor thoughts of peril.\nWith foresight and vigilance,\nthe noble-minded should take heed,\nto fulfill Heaven’s allotted span.\nYet even Heaven’s span is not endless—\nif one daily maintains fullness,\nten thousand years may yet be attained.\n\nThe vital energy of a state’s destiny,\nonce plunged into chaos, begins to stabilize.\nSome dynasties, though their fortune wanes, regain their strength;\nthough their power declines, it rises again.\nIf this is not called decline,\nwhy do they teeter like eggs on the brink?\nIf this is called decline,\nwhy do they once more enjoy peace and stability?\n\nFor when one reins in the horse at the cliff’s edge,\ndisaster may yet be averted;\nwhen one turns back upon witnessing the scene,\nthe dynasty’s blessings may endure.\nEven in the smallest pleasures of feasting and drinking,\nit is difficult to sustain unending joy.\nExtending this principle to greater matters,\nthe noble-minded should awaken with urgency,\nto avert Heaven’s ordained calamities.\nYet Heaven’s calamities are not fixed—\nif one daily guards against decline,\neven the mediocre may long endure.\n\nAh!\nThe heart of Heaven lies within human affairs—\nwhy do people not strive for goodness?",
      "overlap_context": "pit;\nto escape suffering, one must cross the shore.\n\nEven with your own wife,\nintimate feelings within the boudoir should be moderated.\nTo give rise to proper thoughts,\none must establish boundaries of reverence and avoidance.\n\nWhether on the birthdays of sages and deities,\nduring solar or lunar eclipses,\non the days of the Stove God’s sacrifice,\non inauspicious days,\nduring dark and gloomy conjunctions,\nor amid thunder and lightning—\none must separate quilts and beds,\nor even beds and chambers.",
      "start_char": 3017,
      "end_char": 4230,
      "start_sentence": 172,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.765586614608765,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "毁誉篇 人何以故而毁我？ 人何以故而誉我？ 彼何以故而毁人？ 彼何以故而誉人？ 望人誉而功不至，斯毁之矣； 防人毁而过能悛，斯誉之矣。 是故毁誉我者无其渐，我招毁誉有其渐，毁誉人者无其因，人招毁誉有其因。 吾爱天下人不求誉，而行可誉之事； 吾恶天下人不畏毁，而行可毁之端； 吾耻天下人不知毁誉，而湮没以终，湮没以终，人不毁而自毁也。 生前以有过自毁者，人必誉之； 生平以有功自誉者，人必毁之。 虽然，誉人而过乎其实，标榜之风必起矣，毁人而过乎其实，求全之辈可诛矣。 世人勉之戒之。 修短篇 谁合修，谁合短，皇矣下观，原无别眼。 欲教民物共长生，大块芸芸必充满。 是故仁则寿，恶则谴； 功则寿，过则减； 养则寿，戕则损。 仙佛圣贤劫可免，以歌当话招流返。 穷达篇 达之人兮无穷愁，愁之人兮少德修。 荣枯两途兮一春一秋，吾亦两居兮隐显自由。 人命忙忙兮其驶如箭，达何足欢兮穷何足叹！ 境可缚兮非英雄，命可安兮且闲玩。 读书养道兮浩气犹龙，颜瓢点瑟兮孔许其同，原襟宓琴兮吾亦可从。 庐中龙兮上云霄，湖上驴兮自道遥。 云之出兮为霖雨，流之退兮访松乔。 抑或无心仕进兮严竿王樵，何必自苦兮闷死蓬蒿！ 人品篇 人品近似之界，不可不明。 有人焉，正气自存，离群特立，人以为傲也，吾以为毅； 有人焉，谦光自处，与世无殊，人以为流也，吾以为和； 有人焉，优游自适，率乎天真，人以为惰也，吾以为安； 有人焉，啸咏自如，由乎天命，人以为狂也，吾以为达； 有人焉，郑重持身，丰裁峻节，人以为骄也，吾以为严； 有人焉，浑厚立己，性格坚苍，人以为拙也，吾以为朴； 有人焉，义利分明，一私莫着，人以为矫也，吾以为介； 有人焉，襟怀卓异，一尘不亲，人以为僻也，吾以为高； 有人焉，雍和满着，不识文词，人以为俗也，吾以为儒； 有人焉，清净为缘，不知经忏，人以为愚也，吾以为觉； 有人焉，饮食无异，寒暑不灾，人以为怪也，吾以为仙。 贤否错出之间，有相似而实不同者，不可不细观也。 勿有薄人心，厚己心，轻人心，重己心，无人心，有己心，则至人之精神出矣。 舜居深山中，其所以异步人者几希，及其闻一善言，见一善行，而舜如赤城之标，朱光在天上矣。 快活篇 有安城老叟言于危城公曰：\"吾闻生太平之世，为太平之人； 无上无下，居易居仁，子亦知快活之事乎？ 请为子小赋而陈之。 红埃滚滚； 苦海滔滔。 循吾兮，守吾操； 养吾浩，全吾高。 保太和兮淡世虑； 灭争竞兮少气淘。 耐清寒兮增学养； 忘嗜欲兮住林皋。 出为好官兮无罪戾； 入为达士兮免牢骚。 训儿孙兮戒淫赌，教妇女兮肃庭户。 耕不歉乎官租； 学不荒乎德圃。 饮社酒兮治聋； 为天民之巨拇。 庞庞兮貌古； 落落兮神全。 任是非之杂沓； 斯怨尤之胥捐。",
      "translated_text": "**On Praise and Blame**\n\nWhy do people blame me?\nWhy do they praise me?\nWhy do they blame others?\nWhy do they praise others?\n\nOne who craves praise yet falls short of merit invites blame;\none who guards against blame and corrects their faults earns praise.\nThus, those who praise or blame me act without gradual cause,\nwhile I invite praise or blame through gradual deeds.\nThose who praise or blame others act without reason,\nwhile others invite praise or blame for their own reasons.\n\nI love that all under Heaven seek no praise,\nyet act in ways worthy of praise;\nI despise that all under Heaven fear no blame,\nyet indulge in deeds that invite it.\nI am ashamed that all under Heaven, unaware of praise or blame,\nfade into obscurity—\nto fade into obscurity is to self-destruct without others’ blame.\n\nThose who, in life, self-destruct through their faults will surely be praised;\nthose who, in life, self-praise for their merits will surely be blamed.\nYet if praise exceeds truth, the wind of mutual flattery arises;\nif blame exceeds truth, those who demand perfection deserve condemnation.\nLet the world take heed and be warned.\n\n**On Longevity and Shortness**\n\nWho is fated for long life? Who for short?\nGazing from on high, the Emperor sees no separate eyes.\nTo teach all beings to flourish together,\nthe great earth must teem with life.\nThus, benevolence brings longevity, malice brings retribution;\nmerit brings longevity, faults bring reduction;\nnurture brings longevity, harm brings loss.\nEven immortals, Buddhas, and sages may not escape kalpas,\nyet singing may serve as words to summon the lost back.\n\n**On Prosperity and Adversity**\n\nThe prosperous know no endless sorrow,\nwhile the sorrowful lack cultivated virtue.\nFlourishing and withering—two paths like spring and autumn,\nyet I dwell in both, free in concealment or display.\nLife rushes by like an arrow—\nwhy rejoice in prosperity? Why sigh in adversity?\nCircumstances may bind, but not the hero;\nfate may be endured, so play idly.\nReading to cultivate the Dao, one’s noble qi soars like a dragon;\nwith Yan’s gourd and a zither’s notes, Confucius and Xu would approve.\nWith a robe’s lapel and a Fuqin’s strings, I too may follow.\nThe dragon in the hut ascends to the clouds;\nthe donkey by the lake roams carefree.\nClouds rise to become timely rain;\nstreams recede to visit the pine and cypress.\nOr, without ambition for office, like Yan or Wang the woodcutter—\nwhy torment oneself to die in the weeds?\n\n**On Character**\n\nThe boundaries of human character must be clearly discerned.\nSome possess an upright qi, standing apart from the crowd—\nothers call them arrogant, I call them resolute.\nSome dwell in humble light, no different from the world—\nothers call them fickle, I call them harmonious.\nSome roam freely, following their nature—\nothers call them lazy, I call them at ease.\nSome chant and sing as they please, following destiny—\nothers call them mad, I call them enlightened.\nSome hold themselves with solemn dignity, bearing noble restraint—\nothers call them proud, I call them stern.\nSome stand with simple integrity, their nature firm and enduring—\nothers call them dull, I call them unadorned.\nSome distinguish right from profit, free of self-interest—\nothers call them affected, I call them principled.\nSome have lofty hearts, untouched by worldly dust—\nothers call them eccentric, I call them noble.\nSome radiate warmth and harmony, unversed in letters—\nothers call them vulgar, I call them refined.\nSome take stillness as their cause, ignorant of scriptures and repentance—\nothers call them foolish, I call them awakened.\nSome eat and drink no differently, unharmed by cold or heat—\nothers call them strange, I call them immortal.\n\nAmid the mingling of worthy and unworthy,\nsome appear similar yet differ in truth—\none must observe closely.\n\nDo not slight others’ hearts while valuing your own,\ndo not belittle others’ hearts while prizing your own,\ndo not lack others’ hearts while possessing your own—\nthen the spirit of the perfected emerges.\nShun lived in the mountains, differing little from others,\nyet upon hearing one good word or seeing one good deed,\nhe shone like a crimson peak, his radiance filling the sky.\n\n**On Joyful Living**\n\nAn old man from Ancheng said to Lord Weicheng:\n\"I hear that to live in a peaceful age is to be a man of peace—\nwithout hierarchy, dwelling in ease and benevolence.\nDo you know the joys of such a life?\nLet me compose a brief rhapsody for you.\n\nRed dust rolls on;\nthe bitter sea surges.\nFollow me, guard my conduct;\nnurture my vastness, preserve my loftiness.\nPreserve great harmony, dispel worldly cares;\nend strife, lessen contention.\nEndure cold to deepen learning and cultivation;\nforget desires to dwell in the groves.\nAs an official, do no wrong;\nas a scholar, avoid resentment.\nTeach children to shun debauchery and gambling;\ninstruct women to keep the household solemn.\nFarming yields no shortage for taxes;\nstudies neglect not the garden of virtue.\nDrink communal wine to cure deafness;\nbe a pillar among the people.\nDignified in bearing, ancient in appearance;\nunfettered in spirit, whole in essence.\nAmid the clamor of right and wrong,\nall grievances vanish.\"",
      "overlap_context": "rns back upon witnessing the scene,\nthe dynasty’s blessings may endure.\nEven in the smallest pleasures of feasting and drinking,\nit is difficult to sustain unending joy.\nExtending this principle to greater matters,\nthe noble-minded should awaken with urgency,\nto avert Heaven’s ordained calamities.\nYet Heaven’s calamities are not fixed—\nif one daily guards against decline,\neven the mediocre may long endure.\n\nAh!\nThe heart of Heaven lies within human affairs—\nwhy do people not strive for goodness?",
      "start_char": 4232,
      "end_char": 5329,
      "start_sentence": 220,
      "end_sentence": 289,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 161.8974370956421,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "能放生而戒杀； 亦养性兮延年。 与乡老兮谈格言； 招后辈兮讲功过。 将成已而成人； 化千个面万个。 铺野席于茅堂； 推山翁为上座。 池栽君子之莲； 篱种陶公之菊。 山香处土之梅； 涧满幽人之竹。 随遇而安，乐乎不乐？ 今吾子两道愁眉，一腔死血。 足踏市朝； 身抛泉石。 入而不安； 出而无益。 既好贪兮又好争； 羌好穿兮又好吃。 与尘市而同磨； 看夕阳之转灭。 \"危城乃愀然曰：\"噫！ 仙叟之教我者，至于斯夫！ 谨受训。 ”深揖而退。 能让篇 养和之室，积厚之家，\"西壁东堂，宜书格语。 譬如吃亏一条，人多不平。 不知吾能忍让，即是为自己养和，为子与孙积厚之事。 今将圣神贤士至理名言，约书几句，以为人劝。 有云\"便人乃自便，宜人乃自宜，我便人不便，我宜人不宜\"者； 有云\"吃得亏人多厚福，赚得盈时总是亏\"者； 有云\"若使人人皆得胜，人间谁合受号人\"者； 有云\"乾坤两字盈虚定； 吃尽亏时劫巳除”者。 予亦有句云:\"亏我多时天不忍，老天定与我便宜。 ”诸生勉乎哉！ 吃亏人终不受亏也。 忠恕篇 忠恕者，宣圣一贯之传也。 一以贯者何？ 忠为体而恕为用也。 中心为\"忠\"，由中立心也。 如心为\"恕\"，如人之心也。 已立立人之义，其在斯乎？ 忠所以贯乎恕也，以恕道为仁，则能不欲勿施，天心无人欲之扰，以恕道处世，则能犯而不校，人心无横逆之来； 以恕道治世，则能所恶勿施，臣心无残酷之政。 圣贤道理，滴滴归源，真可以终身行之者也。 使徒欲如己之心，而不欲如人之心，则其心必生是己非人心，厚己薄人心，重己轻人心，利己害人心，成己败人心。 诸如此心，皆不如人心，既不如人心，安能如己心？ 虽欲如己心，贪多害己心； 不能如己心，忍多坏己心。 其心坏，其心失也。 其心失，无中心也。 中心亡而仁根死，无怪其心不恕也。 然则不忠者，亦以贯乎不想也。 吾愿尔士人，寻一贯之旨，存一贯之真，庶非孔门之罪人也。 虚无篇 虚无者，老、释同传之旨也。 虚者何？ 虚心也。 心虚故神清，神清故性慧，大超脱、大解悟从此生矣。 无者何？ 无我也。 无我故无人，无人故无欲，大清净、大欢喜从此得也。 今汝两门人，不明虚无，只探实有。 \"实有\"二字，其名亦佳，究竟入迷者如谷之数助求实而谈金石，无一得也，日求有而参禅偈，生六尘也； 无量恒河沙，谁是第一波罗密哉！ 吾悯尔等愚，吾开尔等智。 观心虚而至性慧，知虚之能取实也； 观无我而至无欲，知无之能包有也。 孔予毋我，颜子斋心，虽儒家尚如是也，况尔等乎？ 养生篇 人之所欲，莫甚于生，欲得其生，须重其生，欲重其生，切莫轻生。 杀身成仁，见危授命，非轻生也，平日保其生，至此用其生，乃不同夫虚生，乃虽死而犹生。 忠臣义士，烈女贞嫂，惟重生者能之也。 若失生值太平，躬逢盛世，或贵或贱，全孝全忠，为国家着英，为世间人瑞，则生生者，不可不知养生也。 养生之论，与修真不同。 修真可以逃劫数，道也； 养生可以延年命，术也。 然养生而不明古今天人之理，亦终无集验之方。 上古之民，浑朴为风，寡虑寡思，寡言寡笑，寡视寡听，粗衣粝食，不识不知，故能保全其真，以永眉寿；",
      "translated_text": "Be able to release life and abstain from killing;\nthus nurture nature to prolong years.\nWith village elders, discourse on maxims;\nsummon the younger generation to expound merits and faults.\nPerfect oneself to perfect others;\ntransform a thousand faces, ten thousand forms.\nSpread mats in the thatched hall;\ninvite the mountain elder to take the seat of honor.\nPlant lotuses of the gentleman in the pond;\ncultivate chrysanthemums of Master Tao along the fence.\nPlum blossoms fragrance the earth of the mountain;\nbamboo fills the ravine of the recluse.\nAt ease wherever one finds oneself,\ncan one not find joy in what is not joy?\n\nNow you, with furrowed brows and a heart of stagnant blood,\ntread the marketplace;\ncast your body among springs and rocks.\nStaying brings no peace;\nleaving brings no benefit.\nYou love greed and love strife;\nyou crave finery and crave indulgence.\nGround down with the dusty world,\nyou watch the setting sun fade away.\n\nThe distressed man then sighed and said, \"Alas!\nThe immortal elder’s teachings reach even this!\nI humbly receive your instruction.\"\nHe bowed deeply and withdrew.\n\n**On Yielding**\n\nIn a chamber of harmony, in a household of accumulated virtue,\n\"west wall and east hall are fitting places for inscribed maxims.\"\nFor example, when one suffers a loss, many feel indignation.\nYet if I can endure and yield,\nthis is to cultivate harmony for myself\nand to accumulate virtue for my children and grandchildren.\nNow I shall inscribe a few sayings of sages, worthies, and wise men\nto exhort others.\n\nSome say:\n*\"What benefits others benefits oneself;\nwhat suits others suits oneself.\nIf I benefit others but not myself,\nif I suit others but not myself—\"*\nSome say:\n*\"Those who endure losses enjoy abundant fortune;\nthose who profit excessively always lose.\"*\nSome say:\n*\"If everyone were to prevail,\nwho in the world would be left to bear the name of the vanquished?\"*\nSome say:\n*\"The two words 'fullness' and 'emptiness' are decreed by Heaven and Earth;\nwhen one has endured every loss, the calamity is already dispelled.\"*\nI too have a saying:\n*\"When I have endured many losses, Heaven cannot bear it,\nand Heaven will surely grant me advantage.\"*\n\nStudents, take heed!\nThose who endure losses ultimately suffer no loss.\n\n**On Loyalty and Empathy**\n\nLoyalty and empathy are the single thread transmitted by the Proclaimed Sage.\nWhat is this \"single thread that runs through\"?\nLoyalty is the essence, empathy the function.\n\"Loyalty\" means centering the heart;\n\"empathy\" means aligning with the hearts of others.\nDoes not the meaning of \"establishing oneself to establish others\" lie herein?\n\nLoyalty unifies empathy.\nUsing the Way of empathy as benevolence,\none can refrain from imposing what one does not desire,\nand the Heavenly heart remains undisturbed by human desires.\nUsing the Way of empathy in the world,\none can endure offenses without retaliation,\nand the human heart remains free from violent opposition.\nUsing the Way of empathy to govern,\none can refrain from imposing what one detests,\nand the hearts of ministers remain free from cruel policies.\n\nThe principles of sages and worthies,\ndrop by drop, return to their source—\ntruly, they can be practiced throughout one’s life.\n\nIf one merely desires to align with one’s own heart\nbut not with the hearts of others,\nthen one’s heart will surely generate\na mind that favors oneself over others,\na mind that values oneself and devalues others,\na mind that prioritizes oneself and belittles others,\na mind that profits oneself and harms others,\na mind that succeeds oneself and fails others.\nAll such minds are not aligned with the hearts of others.\nIf not aligned with the hearts of others,\nhow can one align with one’s own heart?\nThough one may desire to align with one’s own heart,\ngreed harms the heart;\nif unable to align with one’s own heart,\nendurance corrupts the heart.\nWhen the heart is corrupted, the heart is lost.\nWhen the heart is lost, there is no center.\nWith the center gone, the root of benevolence dies—\nno wonder the heart lacks empathy.\n\nThus, those who are not loyal\nalso fail to uphold the thread of empathy.\nI wish for you, scholars,\nto seek the meaning of this single thread,\nto preserve its truth,\nso that you may not become offenders against the gate of Confucius.\n\n**On Emptiness and Nothingness**\n\nEmptiness and nothingness are the shared teachings of Laozi and the Buddha.\nWhat is emptiness?\nAn empty heart.\nWhen the heart is empty, the spirit is clear;\nwhen the spirit is clear, nature is wise.\nGreat transcendence, great enlightenment arise from this.\nWhat is nothingness?\nNo self.\nWhen there is no self, there are no others;\nwhen there are no others, there are no desires.\nGreat purity, great joy are attained from this.\n\nNow you, my two disciples,\ndo not understand emptiness and nothingness\nbut only seek \"solid existence.\"\nThe term \"solid existence\" sounds fine,\nyet in the end, those who enter delusion are like\nthose who, in their eagerness to seek reality, discuss minerals and metals—\nachieving nothing—\nor those who daily seek existence while reciting Chan verses,\nonly to generate the six dusts.\nOf the infinite sands of the Ganges,\nwho has attained the first *paramita*?\n\nI pity your ignorance;\nI open the gate to your wisdom.\nObserve the empty heart leading to innate wisdom,\nand know that emptiness can grasp reality.\nObserve the absence of self leading to the absence of desire,\nand know that nothingness can encompass existence.\nConfucius had no self;\nYanzi cultivated an empty heart.\nEven Confucians esteemed this—\nhow much more should you?\n\n**On Nurturing Life**\n\nOf all human desires,\nnone surpasses the desire for life.\nTo attain life,\none must value life;\nto value life,\none must never treat life lightly.\nSacrificing oneself to perfect benevolence,\noffering one’s life in the face of danger—\nthis is not treating life lightly.\nPreserving life in ordinary times,\nusing it in critical moments—\nthis differs from a vain existence,\nfor though one may die, one yet lives.\nLoyal ministers, righteous scholars,\nchaste women, steadfast widows—\nonly those who value life can achieve this.\n\nIf one lives in times of peace,\nencounters a flourishing age,\nwhether noble or humble,\nfulfills filial piety and loyalty,\nserves as a pillar for the state,\nor becomes a paragon for the world—\nthen one who cherishes life\nmust know how to nurture it.\n\nThe discourse on nurturing life\ndiffers from the cultivation of truth.\nCultivating truth can escape calamity—\nthis is the Dao.\nNurturing life can prolong years—\nthis is technique.\nYet if one nurtures life without understanding\nthe principles of Heaven, Earth, and humanity from ancient times to the present,\none will ultimately find no effective method.\n\nThe people of antiquity,\nwith their unadorned simplicity,\nharbored few concerns, few thoughts,\nspoke little, laughed little,\nsaw little, heard little,\nwore coarse clothes, ate rough food,\nknew not, sought not—\nthus they preserved their true nature\nand attained long life.",
      "overlap_context": "d cultivation;\nforget desires to dwell in the groves.\nAs an official, do no wrong;\nas a scholar, avoid resentment.\nTeach children to shun debauchery and gambling;\ninstruct women to keep the household solemn.\nFarming yields no shortage for taxes;\nstudies neglect not the garden of virtue.\nDrink communal wine to cure deafness;\nbe a pillar among the people.\nDignified in bearing, ancient in appearance;\nunfettered in spirit, whole in essence.\nAmid the clamor of right and wrong,\nall grievances vanish.\"",
      "start_char": 5329,
      "end_char": 6562,
      "start_sentence": 290,
      "end_sentence": 372,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.00156784057617,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "近今之民，浮华日后，多虑多恩，多言多笑，多视多听，丰衣厚食，荡志荡神，故尝戒伐其性，以致天亡。 天道之泰，在乎能复，日员又中，月缺又圆，雨漏又晴，雷鸣又蛰，故能留不敝之神，以绵天运于常新； 人道之否，在乎多剥，精任其泄，气任其亏，神运不停，形摇不守，故难回已惫之身，聊居人世于朝暮。 然则养生者，药食为后，保护为先，学天道可也，学古人可也， 五劫筋 鸣乎悲哉！ 凡人之有五劫也。 五劫维何？ 生、老、病、死、苦也。 人岂不必生？ 但当直而生，正而生，不可罔而生也。 生为圣贤，夭犹生也，英灵在世，声名在世，馨香在世，与仙佛何异焉！ 独有生而恶，生而暴，生而酷者，一生之后，必不复生，不必不与生，正当与之生，绵绵劫劫，皆入恶趣，受无间罪，虽欲不生，不可得也。 生，于劫也。 如是而沉沦世上，困厄人间，不知回机不识变迁，悠悠老矣，又一劫也； 如是而精耗形枯，神亡气竭，药不能补，养不能回，恹恹病矣，又一劫也； 如是而无常忽至，大限已临，身家何处，妻子何人，匆匆死矣，又一劫也； 如是而有恶必报，有过必报，转徙阴曹，瞅瞅啼泣，是极苦矣，叉干动也。 幸而托生有日，或命带刀兵，或命带水火，或命带诸疾难，或命带诸困穷，仍将流连于五劫之中而无底止，不必说到刀山地狱间也。 堕此劫者，非有因果，非有德功，不能消其罪庚。 故人之一生，须要修善积福，返本还元，庶克同上春台，咸登极乐。 有生长生，长生不生，不生故不灭，不灭故超脱也。 人其勉诸！ 敬神篇 神也者，妙万物而为言者也。 上帝以神道设教，故神实司乎善恶。 凡聪明正直者，皆以神之权授之。 夫天神为神，主引万物，地神为祗，主提万物，此神德之荡荡者，百姓日受而不知，亦惟尽乎人以合乎天地焉可也。 若夫岳渎郊坛，庵堂祠院，其间之竖碑立像乱无非振古之精神，寺宇崇宏，声灵赫曜，瞻望者莫不肃然起敬也。 然而香火盛则祈福之人多，祷告繁则邀福之人至，神岂为人所愚哉！ 失神之出处不一，要皆从正气中来。 《鲁语》曰:\"圣王之制祖也，法施于民则祖之，以死勤事则祖之，以劳定国则祀之，能御大灾则祖之，能捍大患则祖之\"，加之山川社稷，皆有功烈于民者也。 夫曰\"法施于民\",:原不期人之报也； \"以死勤事\"，原不冀人之感也！ \"以劳定国\"，原不望人之恩也！ \"御大灾\"、\"捍大患\"，原不待人之求也； 广功德于人间，原不俟人之祝也。 即或春秋典重，斋诞频临，太庙者亦止祈神灵以保我君国，而于己无与也； 亦止祈神灵以保我父母，而于己无与也； 亦止祈神灵以泽我民物，而于己无与也； 亦止祈神灵以超度沉魂滞魄，而于己无与也。 而且肃吾身，洁吾念，澹吾虑，濯吾肺肝，敬其心以敬神焉，则不求福而自获福也。 是则敬神者，不如自敬其心之为妙也。 凡人心即神，神即心，无愧心，始无愧神，可对神，仍可对心，抑非心之外遂无神也。 相在尔室，相在尔心焉耳。 有如天之神栖乎日，日光所照，何处不明； 人心之神栖乎目，目光所到，何物不见。 人顾欲馅媚神祗，以图消其罪垢，岂可得哉！ 戒之曰，敬神之道有二，下流之谄渎不与焉。",
      "translated_text": "The people of recent times,\nwith their daily-growing vanity,\nharbor many concerns, many thoughts,\nspeak much, laugh much,\nsee much, hear much,\nwear fine clothes, eat rich food,\nscatter their will, dissipate their spirit—\nthus they often injure their nature\nand hasten their early demise.\n\nThe harmony of Heaven’s Dao lies in its power of return:\nthe sun, though waning, regains its fullness;\nthe moon, though waning, becomes round again;\nrain, though ceasing, brings clear skies;\nthunder, though roaring, returns to silence—\nthus it preserves an undiminished spirit\nand perpetuates the celestial cycles in ever-renewing freshness.\nThe disharmony of human Dao lies in excessive depletion:\nessence is allowed to drain,\nqi is allowed to wane,\nthe spirit ceaselessly moves,\nthe form unsteadily holds—\nthus it is difficult to restore an already exhausted body\nand merely linger in the world from dawn to dusk.\n\nTherefore, for one who nurtures life,\nmedicine and diet come second,\nprotection comes first.\nOne may learn from Heaven’s Dao,\nor one may learn from the ancients.\n\nAlas! How lamentable!\nAll people are bound by the five kalpas.\n\nWhat are the five kalpas?\nBirth, aging, sickness, death, and suffering.\nMust one not be born?\nOne should be born uprightly, born rightly—\nnot born in delusion.\nTo be born as a sage or worthy,\neven if one dies young, is still to have lived—\none’s radiant spirit remains in the world,\none’s reputation endures,\none’s fragrance lingers—\nhow is this different from immortals or buddhas?\nOnly those who live evilly,\nlive cruelly,\nlive brutally—\nafter one life, they will not be born again as they were,\nnot that they will not be born at all,\nbut that they will be born rightly,\ncycle after cycle,\nall falling into evil destinies,\nsuffering uninterrupted torment,\nand though they may wish not to be born, they cannot escape it.\n\nBirth is but one kalpa.\nThus, sinking into the world,\nstruggling in human life,\nunaware of turning the tide, unknowing of change—\nslowly, one grows old: this is another kalpa.\nThus, essence depleted, form withered,\nspirit gone, qi exhausted,\nmedicine cannot replenish,\nnurture cannot restore—\nweakly, one falls ill: this is another kalpa.\nThus, impermanence suddenly arrives,\nthe great limit draws near,\nwhere is one’s home? Who are one’s wife and children?\nHastily, one dies: this is another kalpa.\nThus, evil must be repaid,\ntransgressions must be repaid,\nwandering through the netherworld,\nwhimpering in sorrow—\nthis is extreme suffering, the stirring of karma.\n\nFortunately, if one is reborn one day,\none may be fated for blades and warfare,\nor for water and fire,\nor for various afflictions and hardships,\nor for various trials and poverty—\nstill one will drift endlessly among the five kalpas,\nnot to mention the knife mountains and hells.\nThose who fall into this kalpa\ncannot dissolve their karmic debts\nwithout cause and effect,\nwithout virtue and merit.\n\nThus, in one’s lifetime,\none must cultivate goodness and accumulate blessings,\nreturn to the origin and restore the primordial—\nonly then can one ascend the Terrace of Spring\nand together attain ultimate bliss.\nTo be born is to seek long life;\nto attain long life is to transcend birth;\nto transcend birth is to transcend extinction;\nto transcend extinction is to achieve liberation.\nLet people strive for this!\n\n**On Revering the Divine**\n\nThe divine is that which subtly pervades all things.\nThe Supreme Emperor established teachings through the divine Dao,\nand thus the divine truly governs good and evil.\nAll who are wise, bright, upright, and just\nare entrusted with the divine’s authority.\nThe celestial spirits are the divine,\nguiding all things;\nthe earthly spirits are the deities,\nupholding all things—\nthis is the vast virtue of the divine,\nwhich the people receive daily yet do not perceive.\nOnly by fully exhausting one’s humanity\nto align with Heaven and Earth can this be so.\n\nAs for the sacred peaks, rivers, suburban altars,\ntemples, shrines, and monasteries—\nthe steles erected and images enshrined within\nare all imbued with the spirit of antiquity.\nTheir halls are grand,\ntheir numinous power resplendent—\nall who gaze upon them cannot but stand in solemn reverence.\n\nYet when incense burns brightly, those who pray for blessings multiply;\nwhen supplications are frequent, those who seek blessings arrive—\nhow could the divine be deceived by people?\nThe origins of the divine are manifold,\nbut all arise from the upright qi.\n\nAs the *Discourses of Lu* states:\n\"In the ancestral rites of the sage-kings,\nthose who established laws for the people were enshrined,\nthose who labored to the death in service were enshrined,\nthose who toiled to stabilize the state were sacrificed to,\nthose who averted great disasters were enshrined,\nthose who warded off great calamities were enshrined\"—\nand the mountains, rivers, and altars of the soil and grain\nwere all those who had rendered great merit to the people.\n\nTo \"establish laws for the people\"\nwas never to expect repayment;\nto \"labor to the death in service\"\nwas never to hope for gratitude;\nto \"toil to stabilize the state\"\nwas never to seek favor;\nto \"avert great disasters\" or \"ward off great calamities\"\nwas never to await entreaty.\nTo spread merit and virtue among the people\nwas never to wait for their prayers.\n\nEven in the solemn rites of spring and autumn,\nwith frequent offerings and sacrifices,\nthe ancestral temple’s purpose is merely to pray to the divine\nto protect our lord and state—\nnothing to do with oneself;\nmerely to pray to the divine\nto protect our parents—\nnothing to do with oneself;\nmerely to pray to the divine\nto bless our people and creatures—\nnothing to do with oneself;\nmerely to pray to the divine\nto deliver lost souls and lingering spirits—\nnothing to do with oneself.\n\nMoreover, one purifies one’s body,\ncleanses one’s thoughts,\ncalms one’s concerns,\nwashes one’s heart and liver—\nrevering the heart to revere the divine—\nthus, without seeking blessings, one naturally obtains them.\nTherefore, to revere the divine\nis not as wondrous as revering one’s own heart.\n\nThe human heart is the divine,\nthe divine is the heart.\nOnly without shame in the heart\ncan one be without shame before the divine.\nOne can face the divine,\nand one can face the heart—\nyet the divine is not beyond the heart.\nIt dwells in your chamber,\nit dwells in your heart.\n\nJust as the divine of Heaven abides in the sun,\nand wherever the sunlight shines, nothing is unseen;\nthe divine of the human heart abides in the eyes,\nand wherever the gaze falls, nothing is hidden.\nYet people still seek to flatter and ingratiate themselves with the divine\nto erase their sins and impurities—\nhow could this be possible?\n\nBeware: the way of revering the divine has two paths,\nand the obsequious flattery of the vulgar is not among them.",
      "overlap_context": "\nNurturing life can prolong years—\nthis is technique.\nYet if one nurtures life without understanding\nthe principles of Heaven, Earth, and humanity from ancient times to the present,\none will ultimately find no effective method.\n\nThe people of antiquity,\nwith their unadorned simplicity,\nharbored few concerns, few thoughts,\nspoke little, laughed little,\nsaw little, heard little,\nwore coarse clothes, ate rough food,\nknew not, sought not—\nthus they preserved their true nature\nand attained long life.",
      "start_char": 6562,
      "end_char": 7786,
      "start_sentence": 373,
      "end_sentence": 421,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.09517478942871,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "上士存心正大，立功行而至意遥深，居处之间，恐神鉴察，有福有庆，仍归神思，斯人也，虽未焚香秉烛，恭即庙门，而已得敬神之大道也； 中士存心谨恪，言帝天而身益震慑，善念之生，因神鼓励，有功有德，心荷神麻，斯人也，抑或斋戒沐浴，参礼菩萨，亦可谓敬神之小道也。 至于外饰小心，中藏大慝，纷纷往来，朔日谷日，神将曰：\"尔来乎，吾正索尔！ 勿馅我，勿渎我，尔敬我香，我加尔锁，归去革心，庶乎其可！ \" 爱人篇 万物之生，惟人最灵，既灵于物，须爱其生。 毋以阴谋掐人、毋以利器伤人，毋以药物毒人，毋以权势厄人。 陷人、伤人、毒人、厄火者，明有国刑，暗有天罚，终难逃也。 今夫飞物之能言能舞、植物之有香有色、动物之可驯可玩、潜物之可育可娱者，人犹爱之，人岂不重于物哉！ 今劝尔世人，相生相聚，无相凌虐，出入往来，当思爱人之名，成人之名，爱人之功，成人之功，爱人之事，成人之事，爱人之利，成人之利； 夫成人之名，即所以成己之名也； 成人之功，即所以成己之功也； 成人之事，即所以成己之事也； 成人之利，即所以成己之利也，皆爱也。 其成人之名与功、事与利者，勿掩忠臣之忠，勿窃勋臣之勋，勿毁节孝之妇，勿谤童女之贞，勿妒能亦勿假人之能，勿忌才亦勿昧人之才，勿隐善亦勿盗人之善，勿扬恶亦勿效人之恶，勿阴阻人之进阶，勿妄抹人之文字，勿败人之盛举，勿堕人之善行，勿坏人之、良图，勿损人之富寿，勿占人之田土，勿弄人之赀财，勿助匪人而夺仁人之风水，勿党小人而诱名家之子孙，胞与之怀，难尽述也。 以故永命天尊倦倦于勿辱善邑勿欺穷困，勿离人父子，勿间人骨肉，勿破人婚姻，勿侮人聋碱，以及救人之难，济人之急，悯人之孤，容人之过，拯人疾苦，贝周人饥寒，提携亲族，赈济邻朋，矜孤恤寡，敬老怜贫者，皆于人而爱之也。 嗟乎！ 天生亿兆，为仁人用仁之地，为善人积善之场，果能推心广博，保育群黎，居富贵而爱人者，必裕后昆，居贫贱而爱人者，必能显达。 惟天佑善，惟帝福人，伊古以来，最多最速。 故欲知处世之道者，吾仍劝之曰爱人。 医药篇 医之为道也，能活国亦能病国； 药之于世也，能活人亦能杀人。 不可不慎其术也。 中有理焉，学之无尽，行之无穷。 药分君臣佐使，病分虚实旧新，凡医士皆能言之，而能知之者罕也。 圣贤学问精而志气益下，道德高而心怀益谦，操歧黄者亦宜如是。 不可自轻，不可自误，不可自欺。 自欺欺人，自误误人，自轻轻人，其罪集于乃躬也。 故此道立功易，取过亦易，积福难，招祸不难。 欲求有功无过，有福无祸，则必兢兢自持，脉理微细，浅学难知。 今劝尔医士，入病人之塌，先问从来，勿以药试人也； 今劝尔病家，对医士之前，先明原故，勿以命试医也。 以命试医咎在己，以药试人咎在医。 更宜扶危急莫高身价，救困穷莫计金赀。 能洞见其症候者，即行拯拔，不能见其症候者，以侯高明，则积稳诚之善也。 更劝汝儒学者流，多考灵方，细研医旨，勿秘勿妄，利己利人。 范文正、陆宣公人臣之心思，且于医三致意焉，大可忽于医道哉！ 相卜篇 上人有相，下人有相，中人无相。",
      "translated_text": "The superior person maintains a heart of uprightness and magnanimity, establishing merit and conduct with profound and far-reaching intent. In their dwelling and movements, they fear the divine’s scrutiny, and though blessings and felicity come, they still attribute them to the divine’s consideration. Such a person, though they may never burn incense or hold candles, nor reverently approach the temple gates, has already grasped the great Way of revering the divine.\n\nThe middling person maintains a heart of meticulous reverence, speaking of the Emperor of Heaven with trembling awe. When good thoughts arise, they are spurred by the divine’s encouragement; when merit and virtue accrue, their heart bears the divine’s grace. Such a person, though they may fast, bathe, and pay homage to the bodhisattvas, may be said to follow the lesser Way of revering the divine.\n\nAs for those who outwardly display petty caution while inwardly harboring great wickedness—rushing to and fro on the first and fifteenth days of the month—the divine will say: *\"You come to me, yet I seek you out! Do not flatter me, do not profane me. You offer me incense, and I bind you in chains. Go and reform your heart—only then may it be acceptable!\"*\n\n**On Loving Others**\nOf all things born, humans are the most numinous. Having surpassed other beings in spirit, they must cherish their own lives. Do not scheme against others in secret, do not harm them with sharp weapons, do not poison them with drugs, do not oppress them with power. Those who entrap, injure, poison, or oppress others—whether by fire or other means—face clear punishment by state law and hidden retribution from Heaven; none shall escape in the end.\n\nEven creatures that can speak and dance, plants with fragrance and color, animals that can be tamed and played with, and aquatic beings that can be raised and enjoyed—humans still cherish them. How could humans not be more precious than these?\n\nNow I urge you, people of the world: live together in harmony, do not bully or abuse one another. In your comings and goings, reflect on the virtue of loving others, of accomplishing for others—their reputation, their merit, their affairs, their benefit. For in accomplishing another’s reputation, you accomplish your own; in accomplishing another’s merit, you accomplish your own; in accomplishing another’s affairs, you accomplish your own; in accomplishing another’s benefit, you accomplish your own. All is love.\n\nWhen you accomplish another’s reputation, merit, affairs, or benefit, do not obscure the loyalty of loyal ministers, do not steal the achievements of meritorious officials, do not slander the chastity of widows, do not defame the purity of maidens. Do not envy ability, nor falsely claim another’s skill; do not resent talent, nor conceal another’s gifts. Do not hide goodness, nor steal another’s virtue; do not spread evil, nor imitate another’s wrongdoing. Do not secretly obstruct another’s advancement, do not recklessly erase another’s writings, do not ruin another’s grand undertakings, do not undermine another’s good deeds. Do not thwart another’s noble plans, do not diminish another’s wealth or longevity, do not seize another’s land, do not meddle with another’s property. Do not aid villains in seizing the geomantic fortunes of the virtuous, do not ally with petty men to lead astray the descendants of the renowned. The embrace of universal compassion is too vast to enumerate fully.\n\nThus, the Everlasting Heavenly Worthy tirelessly exhorts: do not humiliate the good and the humble, do not deceive the poor and destitute, do not separate fathers from children, do not divide flesh and blood, do not break marriages, do not mock the deaf and mute. Rescue those in peril, aid those in urgent need, pity the orphaned, tolerate others’ faults, relieve suffering, provide for the hungry and cold, support your kin, assist neighbors and friends, show compassion to widows and orphans, respect the elderly, and cherish the poor. All these are acts of loving others.\n\nAlas! Heaven births countless beings to serve as the ground for the benevolent to practice benevolence, the stage for the good to accumulate goodness. If one can extend their heart broadly and protect and nurture the multitudes—whether dwelling in wealth and nobility or poverty and lowliness—those who love others will surely prosper their descendants or achieve prominence. Heaven blesses the good, the Emperor favors the virtuous; since ancient times, such rewards have been most abundant and swift.\n\nTherefore, to those who wish to know the Way of living in the world, I still urge: love others.\n\n**On Medicine**\nThe Way of medicine can preserve a state or sicken it; medicine in the world can save lives or take them. One cannot be careless in this art. There is a principle within it—learning it is endless, practicing it is boundless.\n\nMedicines are divided into sovereign, minister, assistant, and courier; illnesses are distinguished as deficient or excessive, chronic or acute. Though all physicians can speak of these, few truly understand them. The sages’ learning is refined, yet their aspirations grow ever humbler; their virtue is lofty, yet their hearts remain modest. Those who practice the art of *Qi Huang* should be the same. Do not belittle yourself, do not mislead yourself, do not deceive yourself. To deceive yourself is to deceive others; to mislead yourself is to mislead others; to belittle yourself is to belittle others. The sin of such actions rests upon your own person.\n\nThus, in this Way, achieving merit is easy, but incurring fault is also easy; accumulating blessings is difficult, but inviting disaster is not. To seek merit without fault, blessings without disaster, one must hold oneself in vigilant restraint. The subtleties of pulse and principle are profound; shallow learning cannot grasp them.\n\nNow I urge you, physicians: when entering a patient’s chamber, first inquire about their history—do not experiment with medicines on them. Now I urge you, patients: before the physician, first clarify the cause—do not gamble your life to test the doctor. To gamble your life to test the doctor is your own fault; to experiment with medicines on others is the physician’s fault.\n\nFurthermore, when aiding the critically ill, do not inflate your fees; when saving the destitute, do not calculate payment. If you can clearly discern the symptoms, proceed to rescue them; if you cannot, defer to those more skilled—this is the accumulation of steadfast and sincere goodness.\n\nI further urge you, scholars and literati: study the divine prescriptions extensively, delve deeply into the principles of medicine. Do not hoard knowledge, do not act recklessly—benefit yourself and others. Fan Wenzheng and Lu Xuangong, with the hearts of loyal ministers, devoted great attention to medicine. How could one neglect the Way of medicine?\n\n**On Physiognomy and Divination**\nThe superior person has their physiognomy, the inferior person has theirs, but the middling person has no fixed physiognomy.",
      "overlap_context": "lls in your chamber,\nit dwells in your heart.\n\nJust as the divine of Heaven abides in the sun,\nand wherever the sunlight shines, nothing is unseen;\nthe divine of the human heart abides in the eyes,\nand wherever the gaze falls, nothing is hidden.\nYet people still seek to flatter and ingratiate themselves with the divine\nto erase their sins and impurities—\nhow could this be possible?\n\nBeware: the way of revering the divine has two paths,\nand the obsequious flattery of the vulgar is not among them.",
      "start_char": 7786,
      "end_char": 9019,
      "start_sentence": 422,
      "end_sentence": 462,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.14669919013977,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "上人有命，下人有命，中人无命。 惟上与下，性受难移，不必论也。 兹惟尔中人，不上不下，可上可下，或上或下。 不上不下仍是下，可上可下犹是下，或上或下终是下，离不绝下乃非下。 相自我改，命自我造，古人有言不汝欺也。 即操相算者，亦上相汝身，难相汝心，亦上算汝命，难算汝德。 不能相汝心，即不能相汝身也； 不能算汝德，即不能算妆命也。 莫受相者愚，心智于相也，心体正，好相也； 莫被算者鬼，德神于算也，德性坚，好命也。 吾愿尔世人，自相自算； 吾愿尔相者，劝大修心； 吾愿尔算者，劝人积德。 一切骨气，且照书谈，一切运气，且照书推。 推己复言德，谈己复言心，寓劝化于相算之中，麻衣三祖、子平先生必赐尔等衣饭矣。 堪舆篇 惟天覆善恶，惟地载善恶，惟仙师为天地埋藏善恶。 天无私覆，地无私载，仙师无私恩。 人有私欲，则见理不明。 地理者，天理也。 既有天理，即无人欲，故此道惟聪明正直圣人贤士乃克言之。 今汝世人妄谈风水，冒渎山灵，举亲骸以求福禄，对时师以论殃祥，或代搜求，或自寻觅，赚人货财，要人夸好，如此人心，安知天理？ 十个堪舆九个穷，何足怪也！ 仙师赐地，吉人与吉，凶人与凶，吉不受恩，凶不受怨，理自公也，心自明也。 吾尝与人讲堪舆，即以堪舆兼报应，亦是如此。 夫司地者，仙师也，职既与仙，使不与凡。 人向凡夫求地，何不向凡夫求仙？",
      "translated_text": "The superior person has their destiny, the inferior person has theirs, but the middling person has no fixed destiny. As for the superior and the inferior, their natures are difficult to alter—this need not be discussed. Now, it is only you, the middling person, neither high nor low, who may rise or fall, now ascending, now descending. Neither high nor low is still low; capable of rising or falling remains low; sometimes rising or falling ultimately remains low—only by breaking free from the low can one cease to be low. Physiognomy is transformed by oneself, destiny is shaped by oneself; the ancients spoke truly and did not deceive you.\n\nEven those who practice physiognomy and divination—though they may excel in reading your form, they cannot read your heart; though they may excel in calculating your fate, they cannot calculate your virtue. If they cannot read your heart, they cannot truly read your form; if they cannot calculate your virtue, they cannot truly calculate your fate. Do not be foolish in accepting physiognomy, for wisdom lies beyond appearances; when the heart is upright, even favorable readings are good. Do not be deceived by divination, for spirit transcends fate; when virtue is steadfast, even one’s destiny is good.\n\nI wish for you, people of the world, to read your own form and calculate your own fate. I wish for you, physiognomists, to urge great cultivation of the heart. I wish for you, diviners, to encourage others to accumulate virtue. All bone and qi—observe what the books describe; all fortune and misfortune—follow what the books predict. Yet when predicting, speak again of virtue; when describing, speak again of the heart. Embed exhortation and transformation within physiognomy and divination, and the Three Ancestors of the *Máyī* tradition and Master Zǐpíng will surely grant you sustenance.\n\n**On Geomancy**\nHeaven covers both good and evil, earth bears both good and evil, and the immortal masters conceal both good and evil for heaven and earth. Heaven covers without partiality, earth bears without partiality, and the immortal masters bestow favor without partiality. When people are swayed by selfish desires, their perception of principle becomes obscured. Geomancy is the principle of heaven. Where there is the principle of heaven, there is no room for human desire—thus, only the wise, upright, sagely, and virtuous can truly discourse on it.\n\nNow, you people of the world recklessly discuss fengshui, profaning the mountain spirits. You exhume the bones of your kin to seek fortune and rank, consult temporal masters to debate blessings and misfortunes, either searching on others’ behalf or seeking for yourselves. You swindle people’s wealth, demand their praise, and with such hearts, how can you know the principle of heaven? \"Nine out of ten geomancers end in poverty\"—what is strange about this?\n\nWhen the immortal masters bestow land, the auspicious receive auspiciousness, and the inauspicious receive inauspiciousness. The auspicious do not receive undue favor, the inauspicious do not incur undeserved blame—principle is impartial, and the heart is clear. I have often discussed geomancy with others, and when speaking of it, I always couple it with retribution—it is no different.\n\nThose who oversee the earth are immortal masters, for their office is that of immortals, not of mortals. If one seeks land from mortals, why not seek immortality from mortals?",
      "overlap_context": "e you, scholars and literati: study the divine prescriptions extensively, delve deeply into the principles of medicine. Do not hoard knowledge, do not act recklessly—benefit yourself and others. Fan Wenzheng and Lu Xuangong, with the hearts of loyal ministers, devoted great attention to medicine. How could one neglect the Way of medicine?\n\n**On Physiognomy and Divination**\nThe superior person has their physiognomy, the inferior person has theirs, but the middling person has no fixed physiognomy.",
      "start_char": 9019,
      "end_char": 9567,
      "start_sentence": 463,
      "end_sentence": 489,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.440348148345947,
      "metadata": {
        "source_file": "dao\\藏外\\天口篇.txt",
        "category": "藏外"
      }
    }
  ]
}