{
  "source_id": "太上修真玄章",
  "source_file": "chunked_daozang\\太上修真玄章.json",
  "total_chunks": 2,
  "total_original_chars": 2475,
  "total_translated_chars": 13636,
  "total_translation_time": 65.83546686172485,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\太上修真玄章.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Supreme Scripture on Cultivating the Mysterious and True**\n\n**Scripture Title:** *The Supreme Scripture on Cultivating the Mysterious and True*\nOne scroll, unattributed; likely composed during the Song or Yuan dynasties.\nSource text: *Daoist Canon of the Zhengtong Era*, *Great Mystery Section*.\n\n---\n\n### **Chapter One: The One Qi Gives Rise to All Transformations**\nThe divine is nature—there is the nature of Heaven and Earth, and the nature of qi and form.\nBefore the union of father and mother, it is the nature of Heaven and Earth;\nafter their union, it is the nature of qi and form.\nQi comprises the qi of Earth, which is true qi,\nwhile the qi of father and mother is ordinary qi.\nWhen a person first resides in the mother’s womb, receiving the father’s essence and mother’s blood,\nthis forms the initial sign of life.\nThe so-called ordinary qi merges with the ninefold true qi of the Hollow Emperor,\ncompleting the body’s structure—this is true qi.\nThe first qi generates the embryo,\nthe second qi forms the fetus,\nthe third qi nurtures the spirit,\nilluminating the qi of immortality to give rise to the hun-soul, and nature begins to manifest.\nYet, as the body’s structure is not yet complete, it cannot yet be spiritually active.\nBy the fourth qi, the po-soul is born;\nby the fifth qi, the viscera take form.\nAt the sixth qi, the celestial, lofty, true, and harmonious qi generates spirit,\nand the body’s structure is complete—then it can move.\nMovement gives rise to spirit, and spirit gives rise to the awakening of nature.\nBy the ninth month, the qi is full;\nby the tenth month, the fetus is complete—then birth occurs.\n\n---\n\n### **Chapter Two: The Root and Stem of Nature and Life**\nThe immortals say: While in the mother’s womb, the infant’s umbilical cord connects to the mother’s,\nso that when the mother inhales, the infant inhales, and when she exhales, the infant exhales.\nUpon birth, the umbilical cord is cut, and each breathes independently.\nThe single point of ordinary qi received from the parents then resides in the lower Cinnabar Field,\nlodging in the kidneys.\nThe Cinnabar Field lies before the navel and behind the kidneys,\nsituated between them in a ring-like connection,\nmeasuring one *cun* and two *fen* in breadth.\nIt has two apertures corresponding to Qian and Kun,\nconnecting upward to the Mud Pill Palace and downward to the Bubbling Spring.\nSix additional apertures correspond to Kan, Li, Zhen, Xun, Gen, and Dui,\nlinking to the six viscera.\nThe qi of the entire body gathers here,\nlike water flowing to the east or spokes converging at the hub—\nthus, this aperture is the root and stem of life.\nNature resides in the Cinnabar Field and Mud Pill Palace,\nlodging in the heart.\nThe Mud Pill Palace is located in the human head,\nbetween the Hall of Light,\nwithin the six directions—this is the crown of the head.\nThus, the world calls the infant’s crown the \"Gate of Nature.\"\nBefore the Gate of Nature closes, one knows matters of past lives and their causes;\nonce it closes, these are forgotten.\nTherefore, the Mud Pill Palace is the root of nature.\nOnly by knowing the root of nature and the stem of life can one begin to speak of cultivation.\n\n---\n\n### **Chapter Three: The Precelestial and Postcelestial**\nThe qi of Heaven and Earth has two aspects:\nbefore receiving the embryo, it is called the precelestial,\nalso known as the mother qi.\nThis qi is vast and unyielding,\nfilling Heaven and Earth,\ncirculating through the six directions without cease, day and night.\nOnce a person receives the embryo, they are endowed with this qi,\nwhich is then called the postcelestial,\nor child qi.\nIt is also said: The qi of the sun and moon’s generation\nis the aforementioned ninefold true qi of the Hollow Emperor—\nin truth, it is one qi.\nThis qi also fills the human body,\nand each day, at the *zi* hour,\nwhen the Dipper’s handle points to the earth,\nthe precelestial qi follows the Dipper’s handle,\narising from beneath the ninefold earth,\ncirculating through the six directions to transform the myriad things.\nThe *zi* hour is not the *zi* hour of the human world.\nIn the twelve double-hours of each day,\none must constantly practice inward vision and reversed hearing,\nsuddenly perceiving a warm qi surging within the body—\nthis is the moment.\nAs the alchemical classics say:\n\"When essence is born, the time arrives of itself;\nwithin a hundred moments, one must not be deluded.\"\nOnce the qi of Heaven and Earth is born,\nthe child qi of the human body responds in kind,\narising and ascending to the Cinnabar Field,\nrefining ordinary qi to complete the transformation of the human form.\n\n---\n\n### **Chapter Four: The Mysterious Function of Form and Spirit**\nForm is the dwelling of spirit and qi;\nspirit is the master of form and qi.\nWithout spirit, form and qi are but a lifeless clod;\nwithout form and qi, the numinous spirit has no place to reside.\nAlas!\nSpirit is nature, and qi is life—\nneither can be neglected.\nTo cultivate nature without cultivating life,\nas Master Ziyang says:\n\"Spirit and essence belong to yin; their dwelling is hard to secure,\nand one cannot avoid the method of constant migration.\"\nTo cultivate life without cultivating nature,\nas the Buddhists say:\n\"Refining qi to purity, one may live ten thousand years,\nbut without awakening to the samadhi of right enlightenment,\nwhen one’s retribution is exhausted, one returns to be scattered among the various destinies.\"\nThus, the Confucians say:\n\"To discuss nature without discussing qi is incomplete;\nto discuss qi without discussing nature is unclear.\"\nOne must know that nature is primary, and qi secondary.\n\n---\n\n### **Chapter Five: The Creation of the Golden Elixir**\nIn refining the Golden Elixir,\nform is likened to the cauldron,\nqi to the medicinal substances,\nand spirit to the fire’s function.\nAbandoning scheming and extinguishing thoughts,\npracticing inward vision and reversed hearing,\nso that spirit, essence, hun-soul, po-soul, and intent—\nthese five—do not leak,\nis to stabilize the cauldron.\nDay as Kun, night as Qian,\ngathering the mind in one place,\nremaining silent all day,\nlike a fool, like an idiot—\nthis is to gather the medicinal substances.\nBeing alert yet unwavering,\nclearly and constantly aware,\nwith spirit not straying outward,\nqi naturally stills—\nthis is to regulate the fire’s function.\nThus, the sage forgets form to nurture qi,\nforgets qi to nurture spirit,\nforgets spirit to nurture emptiness.\nWhen form and spirit are both wondrous,\nthey merge with the true Dao.\nThe so-called \"forgetting\" is not\nlike withered wood or dead ashes,\nsitting in dull stupor facing a wall.\nThe heart is like the great void,\npure and bright within and without,\nround and lively like a pearl rolling on a plate,\nclear and deep like the moon reflected in a pool.\nMoving yet unmoving,\nstill yet not still.\n\"One must be engaged yet not fixated;\ndo not forget, nor force its growth.\"\nLet it roam without straying outward,\nrestrain it without confining it within.\nThe space in the breast is always open and vast—\nthis is true forgetting.\n\nIf emptiness transforms into spirit, spirit into qi, and qi into form—this is death! It differs not from the common mortal.\n\n**Chapter Six: The Transformations of Emptiness and Non-Being**\nBeyond heaven and earth lies the Great Void, the Great Nothingness—together called emptiness and non-being, or simply the Void. With no mind, it is empty and thus non-being; empty, it can contain; non-being, it can transform. Thus, things return to things, affairs to affairs, forms to forms, qi to qi—each reverts to its root. Heaven and earth naturally cover and bear, sun and moon naturally revolve, yin and yang naturally rise and fall, cold and heat naturally come and go, the four seasons naturally shift, the five qi naturally spread, creatures of flight and stillness naturally move and rest. Colors remain colors—how could heaven and earth harbor a mind? This is why they endure long and last forever.\n\nMan cannot match heaven and earth in longevity because he possesses a mind and thus cannot attain emptiness and non-being. If he could achieve emptiness and non-being, his spirit would naturally return to spirit, spirit to qi, and the beginning of cultivation could then be spoken of.\n\n**Chapter Seven: The Three Disciplines of Cultivation**\nIn the method of cultivation, one must first guard one’s speech, then moderate diet, and further reduce sleep—these three are the great keys to immortal and Buddha cultivation.\n\nWhy speak of this? As the Old Master said: \"The gate of the Mysterious Female is called the root of heaven and earth. It flows continuously as if existing, yet its use is never exhausted.\" The Mysterious Female is spirit and qi; the mouth and nose are its gates. Exhalation and inhalation, long draws and gentle releases, should be continuous—returning to the root to restore life and nurture primordial qi. Thus, guarding speech comes first.\n\nMaster Ziyang said: \"From emptiness arises the One Qi; from the One Qi, yin and yang are born.\" The qi that humans generate in daily life arises from emptiness. When hunger and emptiness arise, one thinks of food, thereby obstructing qi. Once obstructed, qi cannot return to its origin and is instead dissipated by sounds, colors, fragrances, flavors, joy, anger, sorrow, and delight. Thus, moderating diet follows.\n\nThe Daoist adept, like a hen brooding her eggs, must maintain unbroken warmth; the slightest interruption risks forfeiting life. If one indulges in sleep, spirit departs from qi, and qi, left masterless, scatters wildly—how then can it be gathered and refined? Thus, reducing sleep comes next.\n\n**Chapter Eight: The Union of Spirit and Qi**\nHaving mastered guarding speech, moderating diet, and reducing sleep, one may then practice the methods of inner refinement and elixir-gathering, the techniques of seated meditation and illusion-transformation, proceeding step by step.\n\nWhen the Mother Qi of the prior heaven descends, and the Child Qi of the posterior heaven ascends, both meet in the cinnabar field. Silently, they transform the mundane qi of father and mother. Over months and years, the mundane qi is refined away, and true qi fills the body, arising spontaneously and irresistibly. It ascends from the double passes to the Mud Pill Palace, where it unites with spirit—this is called \"pursuing the two qi along the Yellow Path and gathering the three natures in the Original Palace,\" where they transform into sweet dew.\n\nFrom the Mysterious Pass, it descends once more into the cinnabar field. One ascent and one descent complete the work of creation. But this requires the heart to be empty and non-being, with not a single thought stirring—only then can resonance occur. Otherwise, the medicinal ingredients dissipate, the firing times err, and no elixir is formed. All this arises naturally; one must not forcefully direct spirit or manipulate qi, nor compare it to the hastening of sprouts.\n\n**Chapter Nine: Movement and Stillness, Ascent and Descent**\nExtreme movement gives rise to stillness; extreme stillness gives rise to movement. One movement, one stillness—these are but its functions. Like the wonder of heaven and earth: in movement, it opens; in stillness, it closes. Without opening, there is no closing; without closing, no opening. Opening and closing—endless generation.\n\nWhen the work of stillness reaches its peak, the primordial yang qi naturally arises. As qi is born, heaven and earth quake, mountains and peaks tremble, dragons and elephants race, wind and fire clash, a fragrant brew pours over the crown, and light shines through the curtains. Then, like spring rain, it flows gently; like melting ice, it trickles. From the head, it streams to the feet, then rises again, circulating through the three palaces, ascending and descending without pause. One ascent and one descent complete a celestial cycle.\n\nWhen qi ascends, it is the Winter Solstice, the Zi hour—one yang is born beneath five yins, its hexagram being *Fu* (Return). Advancing and retreating to *Kun* (Earth), where six yins reach their extreme, it transforms and rises again. The two solstices and two equinoxes, the dark and bright moons, the crescents and full moons, the five phases and four images, the twenty-eight constellations, the three hundred and sixty-five degrees—all converge in a single moment. Thus, one moment contains the qi-image of a year. A year has thirty-two thousand six hundred moments, and each must be harmonized. Except for the Mao and You hours, one can seize thirty thousand years of celestial destiny. All this silently accords with the creative work of heaven and earth—it is not a method bound by rigid forms or clinging to images.\n\n**Chapter Ten: Refining Qi into Spirit**\nAt this time, qi and pulse are harmonized, spirit is refreshed and clear—radiant as one freshly bathed, awakened from sleep, or lovers united in joy, mother and child in tender embrace. Spirit embraces qi, and qi embraces spirit. Day by day, month by month, they merge and intermingle, forging a single whole. Yin is exhausted, and pure yang is achieved—thus the true person is formed.\n\nWhen the embryo is shed and spirit transforms, a body exists beyond the body. Gathered, it takes form; scattered, it becomes mist. Coming and going without hindrance, its numinous display is effortless. Creation cannot restrain it, yin and yang cannot control it, ghosts and spirits cannot fathom it, cold and heat cannot assail it. It roams freely in the realm of nothingness, its body one with emptiness and non-being.\n\n*The Supreme Mystery of Cultivating the True—Exalted Chapter, Complete.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上修真玄章 经名：太上修真玄章。 一卷不着撰人，疑出于宋元时期。 底本出处：《正统道藏》太玄部。 太上修真玄章 一炁一化生章第一 神者，性也，有天地之性，有气质之性。 父母未生已前，即天地之性； 父母既生之后，即气质之性。 气者，有地之气，真炁也。 父母之气，凡炁也。 盖人初在母腹中，受父精母血，成其朕兆也。 所谓凡炁合空洞帝真九炁，而全其体段，所谓真炁也。 一炁生胞，二炁生胎，三炁长灵，明仙之炁而生魂，性始来。 以体段未具，而不能灵。 迨夫四炁魄生，五气脏生，第六炁 天高真冲融之炁，而生灵，体段始具，则能动，动则神生，神生则性灵。 至九月炁足，十月胎圆，然后降生 性命根蒂章第二 神仙云：人在．母腹中，其脐带与母脐带相连，母呼亦呼，母吸亦吸。 及乎降诞，剪去脐带，然后各自呼吸，而所受父母一点凡炁，则栖子下丹田中，而寄体於肾。 其丹田前对脐，后对肾，在脐肾之问，其连如环，广一寸二分，有二窍，以应乾坤，上通泥丸，下贯涌泉。 旁有六窍，以应坎离震巽艮兑，以通六腑。 一身之炁，皆聚於此，如水之朝束，辐之赓毂，故此窍为命之根蒂，其性居丹田泥丸，而寄体於心。 泥丸者，在人之首，明堂之问，六合之内，是为顶门，故世呼婴儿顶门为性门也。 性门未合，皆知宿生因绿等事，合则忘之矣！ 故泥丸为性之根，能知性根命蒂，则始可言修炼矣！ 先天后天章第三 天地之炁有二，未受胎已前，谓之先天，又谓之母炁。 其为炁也，至大至刚，充塞天地，周流六虚，昼夜不息。 人才受胎，便禀此炁，谓之后天，又日子炁。 又云：日月发生之炁即前所谓混合空洞帝真九炁是也，其实一炁耳。 其炁亦充塞人腔子裹，每日用子时，斗柄帖地，先天之炁随斗柄，从九地之下发生，周流六虚，造化万物。 子时非人问之子时也。 日用二六时中，常常收视反听，顿觉身中暖炁冲然，即其时也。 丹经云：精生其时，时至自知，百刻之中，切忌昏迷。 天地之炁既生，人身之子炁感类，而从其发生，上升丹田，点化凡炁以成人身之造化。 形神玄用章第四 形者，神气之舍； 神者，形气之主。 形气非神，块然一物，灵神非形气，则茫然无归宿之地。 呜呼！ 神则性也，气则命也，二者不可偏废。 修性而不修命，紫阳云：精神属阴，宅舍难固，未兔长用迁徙之法。 修命而不修性，释氏云：炼炁纯粹，寿可万岁，若不明正觉三昧，报尽还来，散入诸趣。 所以儒家云：论性不论炁不备，论炁不论性不明。 要知性为上，气次之。 金丹作为章第五 炼金丹者，以形譬鼎器，气喻药物，神喻火功。 忘机绝虑，收视返听，使精神魂魄意，五者不泄，定鼎器也。 昼牝夜玄，摄心一处，终日默默，如愚如痴。 采药物也，惺惺不昧，了了常如，神不外驰，其炁自息，调火功也。 是以圣人忘形以养炁，忘炁以养神，忘神以养虚，形神俱妙，与道合真。 所谓忘者，非枯木死灰，面壁昏坐，懵然无知之谓也。 心若太虚，内外贞白，圆活如走盘之珠，澄湛如印潭之月，动而不动，静而不静。 必有事焉而勿正，心勿忘，勿助其长，纵之不逸於外，制之不 拘於内，胸次间常虚豁豁地，夫是谓真忘矣！",
      "translated_text": "**The Supreme Scripture on Cultivating the Mysterious and True**\n\n**Scripture Title:** *The Supreme Scripture on Cultivating the Mysterious and True*\nOne scroll, unattributed; likely composed during the Song or Yuan dynasties.\nSource text: *Daoist Canon of the Zhengtong Era*, *Great Mystery Section*.\n\n---\n\n### **Chapter One: The One Qi Gives Rise to All Transformations**\nThe divine is nature—there is the nature of Heaven and Earth, and the nature of qi and form.\nBefore the union of father and mother, it is the nature of Heaven and Earth;\nafter their union, it is the nature of qi and form.\nQi comprises the qi of Earth, which is true qi,\nwhile the qi of father and mother is ordinary qi.\nWhen a person first resides in the mother’s womb, receiving the father’s essence and mother’s blood,\nthis forms the initial sign of life.\nThe so-called ordinary qi merges with the ninefold true qi of the Hollow Emperor,\ncompleting the body’s structure—this is true qi.\nThe first qi generates the embryo,\nthe second qi forms the fetus,\nthe third qi nurtures the spirit,\nilluminating the qi of immortality to give rise to the hun-soul, and nature begins to manifest.\nYet, as the body’s structure is not yet complete, it cannot yet be spiritually active.\nBy the fourth qi, the po-soul is born;\nby the fifth qi, the viscera take form.\nAt the sixth qi, the celestial, lofty, true, and harmonious qi generates spirit,\nand the body’s structure is complete—then it can move.\nMovement gives rise to spirit, and spirit gives rise to the awakening of nature.\nBy the ninth month, the qi is full;\nby the tenth month, the fetus is complete—then birth occurs.\n\n---\n\n### **Chapter Two: The Root and Stem of Nature and Life**\nThe immortals say: While in the mother’s womb, the infant’s umbilical cord connects to the mother’s,\nso that when the mother inhales, the infant inhales, and when she exhales, the infant exhales.\nUpon birth, the umbilical cord is cut, and each breathes independently.\nThe single point of ordinary qi received from the parents then resides in the lower Cinnabar Field,\nlodging in the kidneys.\nThe Cinnabar Field lies before the navel and behind the kidneys,\nsituated between them in a ring-like connection,\nmeasuring one *cun* and two *fen* in breadth.\nIt has two apertures corresponding to Qian and Kun,\nconnecting upward to the Mud Pill Palace and downward to the Bubbling Spring.\nSix additional apertures correspond to Kan, Li, Zhen, Xun, Gen, and Dui,\nlinking to the six viscera.\nThe qi of the entire body gathers here,\nlike water flowing to the east or spokes converging at the hub—\nthus, this aperture is the root and stem of life.\nNature resides in the Cinnabar Field and Mud Pill Palace,\nlodging in the heart.\nThe Mud Pill Palace is located in the human head,\nbetween the Hall of Light,\nwithin the six directions—this is the crown of the head.\nThus, the world calls the infant’s crown the \"Gate of Nature.\"\nBefore the Gate of Nature closes, one knows matters of past lives and their causes;\nonce it closes, these are forgotten.\nTherefore, the Mud Pill Palace is the root of nature.\nOnly by knowing the root of nature and the stem of life can one begin to speak of cultivation.\n\n---\n\n### **Chapter Three: The Precelestial and Postcelestial**\nThe qi of Heaven and Earth has two aspects:\nbefore receiving the embryo, it is called the precelestial,\nalso known as the mother qi.\nThis qi is vast and unyielding,\nfilling Heaven and Earth,\ncirculating through the six directions without cease, day and night.\nOnce a person receives the embryo, they are endowed with this qi,\nwhich is then called the postcelestial,\nor child qi.\nIt is also said: The qi of the sun and moon’s generation\nis the aforementioned ninefold true qi of the Hollow Emperor—\nin truth, it is one qi.\nThis qi also fills the human body,\nand each day, at the *zi* hour,\nwhen the Dipper’s handle points to the earth,\nthe precelestial qi follows the Dipper’s handle,\narising from beneath the ninefold earth,\ncirculating through the six directions to transform the myriad things.\nThe *zi* hour is not the *zi* hour of the human world.\nIn the twelve double-hours of each day,\none must constantly practice inward vision and reversed hearing,\nsuddenly perceiving a warm qi surging within the body—\nthis is the moment.\nAs the alchemical classics say:\n\"When essence is born, the time arrives of itself;\nwithin a hundred moments, one must not be deluded.\"\nOnce the qi of Heaven and Earth is born,\nthe child qi of the human body responds in kind,\narising and ascending to the Cinnabar Field,\nrefining ordinary qi to complete the transformation of the human form.\n\n---\n\n### **Chapter Four: The Mysterious Function of Form and Spirit**\nForm is the dwelling of spirit and qi;\nspirit is the master of form and qi.\nWithout spirit, form and qi are but a lifeless clod;\nwithout form and qi, the numinous spirit has no place to reside.\nAlas!\nSpirit is nature, and qi is life—\nneither can be neglected.\nTo cultivate nature without cultivating life,\nas Master Ziyang says:\n\"Spirit and essence belong to yin; their dwelling is hard to secure,\nand one cannot avoid the method of constant migration.\"\nTo cultivate life without cultivating nature,\nas the Buddhists say:\n\"Refining qi to purity, one may live ten thousand years,\nbut without awakening to the samadhi of right enlightenment,\nwhen one’s retribution is exhausted, one returns to be scattered among the various destinies.\"\nThus, the Confucians say:\n\"To discuss nature without discussing qi is incomplete;\nto discuss qi without discussing nature is unclear.\"\nOne must know that nature is primary, and qi secondary.\n\n---\n\n### **Chapter Five: The Creation of the Golden Elixir**\nIn refining the Golden Elixir,\nform is likened to the cauldron,\nqi to the medicinal substances,\nand spirit to the fire’s function.\nAbandoning scheming and extinguishing thoughts,\npracticing inward vision and reversed hearing,\nso that spirit, essence, hun-soul, po-soul, and intent—\nthese five—do not leak,\nis to stabilize the cauldron.\nDay as Kun, night as Qian,\ngathering the mind in one place,\nremaining silent all day,\nlike a fool, like an idiot—\nthis is to gather the medicinal substances.\nBeing alert yet unwavering,\nclearly and constantly aware,\nwith spirit not straying outward,\nqi naturally stills—\nthis is to regulate the fire’s function.\nThus, the sage forgets form to nurture qi,\nforgets qi to nurture spirit,\nforgets spirit to nurture emptiness.\nWhen form and spirit are both wondrous,\nthey merge with the true Dao.\nThe so-called \"forgetting\" is not\nlike withered wood or dead ashes,\nsitting in dull stupor facing a wall.\nThe heart is like the great void,\npure and bright within and without,\nround and lively like a pearl rolling on a plate,\nclear and deep like the moon reflected in a pool.\nMoving yet unmoving,\nstill yet not still.\n\"One must be engaged yet not fixated;\ndo not forget, nor force its growth.\"\nLet it roam without straying outward,\nrestrain it without confining it within.\nThe space in the breast is always open and vast—\nthis is true forgetting.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1245,
      "start_sentence": 0,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.09203839302063,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\太上修真玄章.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "．若夫虚化神，神化炁，炁化形，死矣！ 是与凡夫无别。 虚无生化章第六 天地之外，曰太虚太无，总曰虚无，又日虚空。 以无心，故虚故无，虚则能容，无则能化。 是以物各付物，事各付事，形各付形，气各付气，四者各付本根，天地自覆载，日月自运行，阴阳自升降，寒暑自往来，四时自推迁，五炁自顺布，飞潜自动静。 色自色，天地亦何容心焉！ 此天地所以能长且久也。 人不能与天地同长久者，以其有心，故不能虚无。 苟能虚无，其神自来归神归炁，复始可言修炼矣! 修炼三治章第七 夫修炼之法，当先慎言语，次节饮食，其次省睡眠，此三者，乃修仙修佛之大关键也。 胡为而言哉？ 老君曰：玄牝之门，是谓天地根，绵绵若存，用之不勤。 玄牝者，神炁也，口鼻者，神炁之门户也。 出息入息，长收缓放，使之绵绵，归根复命，以养元炁。 故先之以慎言语，紫阳云：虚无生一炁，一炁产阴阳。 人自日用发生之炁，每凭虚而生，人才饥虚，便思饮食，以故塞其炁。 其炁既塞，不能归元，则随声色香味，喜怒哀乐耗散之矣！ 故次之以节饮食。 学道之士，如鸡抱卵，使暖气相续，才有问断，赚他性命。 人若贪睡则神离於炁炁无所主，奔溃肆逸，欲望凝结，其可得乎？ 故次之省睡眠。 神气交媾章第八 既能慎言语，节饮食，省睡眠，然后行内炼采药之方，坐禅修幻之法，次第而行之。 由先天之母气下降，而后天之子气上升，俱会於丹田，默化父母之凡炁，日久月深，凡气炼尽，真炁充实、其炁油然而生，莫之能御。 自双关升泥丸，与神交妮，所谓追二炁於黄道，会三性於元宫，仍化成甘露。 自玄雍而下，复入丹田，一升一降，成其造化。 但要此心虚无，一念不动，然后相应，不然则药材消耗，火候差殊，不作丹也。 此皆出於自然，不可存神运炁，与枢苗助长之说同日语矣！ 动静升降章第九 动极生静，静极生动，一动一静，为其用而已矣！ 如天地之妙，其动互也辟，其静也翕，不辟则不翕，不翕则不辟。 辟兮翕兮，生生无穷。 若静定之功既极，元阳之炁自生。 炁之生也，乾坤震动，山岳动摇，龙象争驰，风火相激，酝酗灌顶，光射帘帏。 已而淫淫若春泽，液液象解冰，自头流达足，究竟复上升。 往来三宫，自升自降，无暂休息； 一升一降，为一周天。 盖气上升为冬至子时，一阳生於五阴之下，其卦为复； 进退至坤，六阴既极，复变而升。 二至二分，晦朔弦望，五行四象，十八宿？ 三百六十五度，钻簇归一刻之中。 一刻故有一年之炁象，一年三二万六千刻，刻刻要调和，除却卯酉外，可以夺天上三万年气数。 此皆与天地造化默相符合，非执文泥象之法也。 炼炁成神章第十 当此之时，气脉调和，精神爽快，曦然如浴之方起，睡之正醒，夫妇合欢，子母留恋。 自神抱其气，气抱其神，日积月累，互相交合，打成一片，阴尽阳纯，遂成真人。 迨夫脱胎神化，身外有身，聚则成形，散则成熙，去来无碍，灵显自如。 造化莫能拘，阴阳莫能制，鬼神莫能测，寒暑不能侵，逍遥乎无何有之乡，与虚无同其体矣！ 太上修真玄章竟",
      "translated_text": "If emptiness transforms into spirit, spirit into qi, and qi into form—this is death! It differs not from the common mortal.\n\n**Chapter Six: The Transformations of Emptiness and Non-Being**\nBeyond heaven and earth lies the Great Void, the Great Nothingness—together called emptiness and non-being, or simply the Void. With no mind, it is empty and thus non-being; empty, it can contain; non-being, it can transform. Thus, things return to things, affairs to affairs, forms to forms, qi to qi—each reverts to its root. Heaven and earth naturally cover and bear, sun and moon naturally revolve, yin and yang naturally rise and fall, cold and heat naturally come and go, the four seasons naturally shift, the five qi naturally spread, creatures of flight and stillness naturally move and rest. Colors remain colors—how could heaven and earth harbor a mind? This is why they endure long and last forever.\n\nMan cannot match heaven and earth in longevity because he possesses a mind and thus cannot attain emptiness and non-being. If he could achieve emptiness and non-being, his spirit would naturally return to spirit, spirit to qi, and the beginning of cultivation could then be spoken of.\n\n**Chapter Seven: The Three Disciplines of Cultivation**\nIn the method of cultivation, one must first guard one’s speech, then moderate diet, and further reduce sleep—these three are the great keys to immortal and Buddha cultivation.\n\nWhy speak of this? As the Old Master said: \"The gate of the Mysterious Female is called the root of heaven and earth. It flows continuously as if existing, yet its use is never exhausted.\" The Mysterious Female is spirit and qi; the mouth and nose are its gates. Exhalation and inhalation, long draws and gentle releases, should be continuous—returning to the root to restore life and nurture primordial qi. Thus, guarding speech comes first.\n\nMaster Ziyang said: \"From emptiness arises the One Qi; from the One Qi, yin and yang are born.\" The qi that humans generate in daily life arises from emptiness. When hunger and emptiness arise, one thinks of food, thereby obstructing qi. Once obstructed, qi cannot return to its origin and is instead dissipated by sounds, colors, fragrances, flavors, joy, anger, sorrow, and delight. Thus, moderating diet follows.\n\nThe Daoist adept, like a hen brooding her eggs, must maintain unbroken warmth; the slightest interruption risks forfeiting life. If one indulges in sleep, spirit departs from qi, and qi, left masterless, scatters wildly—how then can it be gathered and refined? Thus, reducing sleep comes next.\n\n**Chapter Eight: The Union of Spirit and Qi**\nHaving mastered guarding speech, moderating diet, and reducing sleep, one may then practice the methods of inner refinement and elixir-gathering, the techniques of seated meditation and illusion-transformation, proceeding step by step.\n\nWhen the Mother Qi of the prior heaven descends, and the Child Qi of the posterior heaven ascends, both meet in the cinnabar field. Silently, they transform the mundane qi of father and mother. Over months and years, the mundane qi is refined away, and true qi fills the body, arising spontaneously and irresistibly. It ascends from the double passes to the Mud Pill Palace, where it unites with spirit—this is called \"pursuing the two qi along the Yellow Path and gathering the three natures in the Original Palace,\" where they transform into sweet dew.\n\nFrom the Mysterious Pass, it descends once more into the cinnabar field. One ascent and one descent complete the work of creation. But this requires the heart to be empty and non-being, with not a single thought stirring—only then can resonance occur. Otherwise, the medicinal ingredients dissipate, the firing times err, and no elixir is formed. All this arises naturally; one must not forcefully direct spirit or manipulate qi, nor compare it to the hastening of sprouts.\n\n**Chapter Nine: Movement and Stillness, Ascent and Descent**\nExtreme movement gives rise to stillness; extreme stillness gives rise to movement. One movement, one stillness—these are but its functions. Like the wonder of heaven and earth: in movement, it opens; in stillness, it closes. Without opening, there is no closing; without closing, no opening. Opening and closing—endless generation.\n\nWhen the work of stillness reaches its peak, the primordial yang qi naturally arises. As qi is born, heaven and earth quake, mountains and peaks tremble, dragons and elephants race, wind and fire clash, a fragrant brew pours over the crown, and light shines through the curtains. Then, like spring rain, it flows gently; like melting ice, it trickles. From the head, it streams to the feet, then rises again, circulating through the three palaces, ascending and descending without pause. One ascent and one descent complete a celestial cycle.\n\nWhen qi ascends, it is the Winter Solstice, the Zi hour—one yang is born beneath five yins, its hexagram being *Fu* (Return). Advancing and retreating to *Kun* (Earth), where six yins reach their extreme, it transforms and rises again. The two solstices and two equinoxes, the dark and bright moons, the crescents and full moons, the five phases and four images, the twenty-eight constellations, the three hundred and sixty-five degrees—all converge in a single moment. Thus, one moment contains the qi-image of a year. A year has thirty-two thousand six hundred moments, and each must be harmonized. Except for the Mao and You hours, one can seize thirty thousand years of celestial destiny. All this silently accords with the creative work of heaven and earth—it is not a method bound by rigid forms or clinging to images.\n\n**Chapter Ten: Refining Qi into Spirit**\nAt this time, qi and pulse are harmonized, spirit is refreshed and clear—radiant as one freshly bathed, awakened from sleep, or lovers united in joy, mother and child in tender embrace. Spirit embraces qi, and qi embraces spirit. Day by day, month by month, they merge and intermingle, forging a single whole. Yin is exhausted, and pure yang is achieved—thus the true person is formed.\n\nWhen the embryo is shed and spirit transforms, a body exists beyond the body. Gathered, it takes form; scattered, it becomes mist. Coming and going without hindrance, its numinous display is effortless. Creation cannot restrain it, yin and yang cannot control it, ghosts and spirits cannot fathom it, cold and heat cannot assail it. It roams freely in the realm of nothingness, its body one with emptiness and non-being.\n\n*The Supreme Mystery of Cultivating the True—Exalted Chapter, Complete.*",
      "overlap_context": "d wood or dead ashes,\nsitting in dull stupor facing a wall.\nThe heart is like the great void,\npure and bright within and without,\nround and lively like a pearl rolling on a plate,\nclear and deep like the moon reflected in a pool.\nMoving yet unmoving,\nstill yet not still.\n\"One must be engaged yet not fixated;\ndo not forget, nor force its growth.\"\nLet it roam without straying outward,\nrestrain it without confining it within.\nThe space in the breast is always open and vast—\nthis is true forgetting.",
      "start_char": 1245,
      "end_char": 2445,
      "start_sentence": 57,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.743428468704224,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\太上修真玄章.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}