{
  "source_id": "太上赤文洞神三箓",
  "source_file": "chunked_daozang\\太上赤文洞神三箓.json",
  "total_chunks": 12,
  "total_original_chars": 6499,
  "total_translated_chars": 38812,
  "total_translation_time": 188.8005039691925,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
    "category": "众术类"
  },
  "full_translation": "*The Supreme Red Writ of the Cavernous Spirit’s Three Registers*\n\n**Scripture Title:** *The Supreme Red Writ of the Cavernous Spirit’s Three Registers*\nCompiled by Tao Hongjing of the Qi and Liang dynasties; annotated by Li Chunfeng of the Tang.\nOne fascicle.\nSource edition: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Category of Miscellaneous Arts.\n\n*The Supreme Red Writ of the Cavernous Spirit’s Three Registers*\nCompiled by Master Zhenbai of the Liang\nAnnotated by Li Chunfeng, Grand Astrologer of the Tang\n\nThe Recluse Master says: The original text was called *The Red Writ of the Cavernous Spirit’s Formula*, later divided into three versions. This scripture predates Ge and Bao, bearing the names of its transmitters from Hanzhong, who declared: \"I now compile the various transmitted versions into one scroll, retaining the original title as it was presented before me, hence its collective designation.\"\n\nTwo characters contain errors, which are preserved here. During my time in the village, a certain Guo, a man of refined interests, showed this to me. The text was written in cinnabar on green-tinted silk—a script style of the Qi and Liang eras—ancient and unadorned, its talismanic seals exquisitely rendered. Though undated and lacking a clear era, it was once transmitted to the late Daoist Zhang Qiao, who attested to its profound efficacy. How could I, for the sake of an old friend, treat this lightly? Thus, I have collated it as it stands before me.\n\nPreface written in the third month of the *renzi* year, the sixth year of the Zhenguan era.\n\nThe \"Three Registers\" section above contains the inner text of the *Zhouyi*. In the \"Three Jia\" positions, it discusses the inner text of the *Zhouyi*, listing the names of the Eight Polar Sage Ancestors, with the upper character being the \"Marvelous Conduct Talisman.\"\n\nIn ancient times, Fu Xi transmitted it to Shen Nong; Shen Nong, having received it, discerned the sowing of the Five Grains and distinguished the properties of the hundred herbs, thereby aiding the livelihood of the people. Later, the Lineage Chart was obtained by Zhuan Xu’s teacher; the Duke of Zhou obtained it and illuminated the Dao of the *Yi*; the Grand Duke obtained it and employed its subtle strategies to assist King Wu in overthrowing Zhou; Confucius obtained it and thereby penetrated its profound mysteries, further exalting the Dao of the *Yi*.\n\nThis text, in its ancient form, emerged in accordance with its method. Even if Yao in his chamber did not necessarily know of its transmission, those who received it revered it. Thereafter, Guan Yiwu, Sun Bin, and others passed it down in succession; Fan Li and Zhang Liang did likewise.\n\nIt is also said: \"Bin is the essence of the white tortoise, his ministerial position endowed with the qi of martial glory.\" This line originally existed but remains obscure. Yang Shi, Fang Zhong, and Shangguan Bi—all were recorded in the original text, yet their verification in later times remains unseen.\n\nThe method states: The divine beings speak of the *Scripture of Great Peace*, which refers to divine beings and perfected persons. Each day, one must recite the incantation without abstaining from any foods, including those of the \"zhou\" and \"qie\" categories. After reciting the incantation for forty-nine days, the spirit will naturally come to the \"hall palace\"—that is, beside the ear. The Dao explains all matters under heaven. Whatever good or ill, fortune or misfortune is reported beside the ear, none is not foretold in advance. Whether in battle, strength or weakness, victory or defeat, survival or demise, or even theft by an unknown perpetrator—all may be known. It reveals the intentions of captured slaves or rebels who come forth, the direction one should take, or how to seek profit, advantage, honor, and glory. In all undertakings, nothing is left unaddressed. Even before knowing whether something will succeed, merely focusing on the spirit will summon it. Matters of great consequence in the world, the fortunes of the state, blessings and omens, rank and emolument, fame and position—events from a thousand years past or yet to come—all are thoroughly understood. Once the incantation has been recited ten thousand times, if one inquires about a matter, the answer is immediately obtained. The two spirits wear Daoist robes and communicate with one’s innermost thoughts. If one smiles and asks, they respond to every question. If there is something one desires, first recite the incantation seven times, and the spirit will come before the hall palace. The person’s intentions are all foreknown. One spirit, clad in green robes, stands by the left ear to report matters; the other, in purple silk, stands by the right ear. The spirits constantly follow the person, responding swiftly to urgent inquiries and answering promptly when urgently summoned, leaving nothing unknown.\n\n**Records of Auspicious and Inauspicious Responses within the Eight Trigrams**\nThe incantation reads: □□□□□□□□ (command, slay, seize).\n\nThese spirits are the essences of the sun and moon, and they are to be employed on the yin and yang days of *zi* and *chou*. One should select the first day of the six *jia* days, write this talisman in cinnabar, burn it to ash, and mix it with pure water. Recite the above incantation two hundred and twenty times, then apply seven drops of the ash-water to each of the ears, eyes, nose, and mouth. Consume the remainder. Write the talisman again, recite the incantation forty-nine times as before, and carry it on one’s person—then the spirits will manifest their efficacy. When summoning or dispatching them, align the *gang* (cosmic pivot) as instructed. After sixty days, when the cycle returns to the day of *jia-zi*, burn the talisman to ash and apply it again. Write the talisman anew and carry it, repeating the cycle. With sincere focus and unwavering incense offerings, there is no lack of divine efficacy. Burn incense, transmit the talisman, and recite the incantation seven times:\n\n*\"May the bean burner and Li Gui,\nRequire a thousand voids and ten thousand sages,\nTo join and open the gates of heaven and earth.\"*\n\nWhen performing the ritual, recite this incantation seven times. Begin on the first *jia-zi* day, and on that day, receive the talisman. After completing sixty *jia-zi* cycles, offer a feast of venison and lamb’s liver. If venison is unavailable, substitute mutton. After the offering, consume the food yourself. This method must not be lightly disclosed; keep it secret.\n\n**Talisman of Zhen (East)**\nIts spirit wears green robes and a green crown, resembling a woman in form. If one has doubts, it will inform them of fortune or misfortune. Before sunrise, take well-flower water, face the direction of Zhen, and consume the talisman five times.\n\n**Talisman of Gen (Northeast)**\nIts spirit wears black robes and a black crown. At the hour of *mao*, take well-flower water, face the direction of Gen, and consume the talisman five times. The spirit will speak face-to-face, and this talisman is highly efficacious.\n\n**Talisman of Xun (Southeast)**\nIts spirit wears a green crown and resembles a woman in form. Both large and small talismans are consumed while facing Xun, and the spirit will come to report fortune or misfortune. Use well-flower water, consume the talisman five times while facing Xun, and one’s mind will naturally open and awaken.\n\n**Talisman of Li (South)**\nIts spirit wears red robes and resembles a woman in form. Cultivate with sincerity, and the spirit will come of its own accord to speak. At the hour of *mao*, face the direction of Li, and consume the talisman five times with well water.\n\n**Talisman of Qian (Northwest)**\nIts spirit wears black robes and resembles a man in form. At the hour of *mao*, face the direction of Qian, consume the talisman five times with well-flower water, and the spirit will come.\n\n**Talisman of Kun (Southwest)**\nIts spirit wears yellow robes and a yellow crown, resembling an elderly woman in form. At the hour of *mao*, face the direction of Kun, and consume the talisman three times with well-flower water. The spirit will come of its own accord to converse, and its efficacy is profound.\n\n**Talisman of Dui (West)**\nIts spirit wears white robes and a white crown, resembling a woman in form. It knows the auspicious and inauspicious days, can pursue fugitives, dispatch thieves, and foretell deaths by drowning, warfare, tigers, or wolves. It sharpens vision and hearing, enabling foreknowledge of names. Use well-flower water, face the direction of Dui, and consume the talisman five times.\n\n**Talisman of Kan (North)**\nIts spirit wears black robes. At the hour of *mao*, face north, and swallow the talisman five times with well-flower water. One will then attain spiritual penetration, clarity, and divine efficacy.\n\nFor all cultivation, on the forty-ninth day and night, face north, burn incense, light the Seven Star lamps, bow in worship, and recite the above incantation twice. From the fourteenth to the forty-ninth day, one may employ the spirits at will, as in the recitation. Do not write or read these methods aloud. Do not transmit them to the unworthy. When practicing, one must be resolute in heart, pure in intention, and reverent. If one is careless or disrespectful, they will bring misfortune upon their seven generations of ancestors and themselves.\n\n**The Master’s Method of Dream-Wandering through Various Realms to Bewilder the Jade Maiden’s Soul**\n**First: Testing the Method**\nHave a child sleep, first recite the incantation, and after two days of immobility, invoke the Venerable Immovable Sage to seize control. Fold black paper and place it in the child’s mouth to bite, then cover their head with two pieces of silk. First, take two breaths from the sleeping child, then recite the incantation:\n\n*\"Summon the Four Great Divine Generals,\nTo seize the Jade Maiden and bewilder her soul.\"*\n\nAfter reciting, blow into the sleeping child’s mouth, then use both thumbs to press and separate the *Sansi* platforms (temples) of the sleeper. Have the person sleep again, then take the qi of the five directions and blow it onto their body. After the time it takes to drink two bowls of tea, sit upright and recite:\n\n*\"Venerable Immovable Sage, seize them and go in search—once seen...\"*\n\nRecite again:\n\n*\"Summon the Four Great Divine Generals,\nTo seize the Jade Maiden and bewilder her soul.\nI call you—return swiftly!\"*\n\nCall the child by their given name, and they will awaken.\n\n**Second: Dispelling Nightmares at Home**\nThe incantation reads:\n\n*\"Om bīlǐ xiāng qù shè.\"*\n\n**Third: Dispelling Dreams Sent by Others**\nThe incantation reads:\n*\"Chīlún chì shā bēi shè.\"*\n\n**Fourth: Crossing Rivers in Dreams**\nThe incantation reads:\n*\"Yún yìng gǎn tōng hù fǎ shè.\"*\n\n**Fifth: Observing Mountain Landscapes in Dreams**\nThe incantation reads:\n*\"Chì wēiwǔ dà jiàng chì shā shè.\"*\n\n**Sixth: Entering the Yin Realm in Dreams**\nThe incantation reads:\n*\"Gōu sì dà shén jiàng gōu fǔ mìng bì qì shè.\"*\n\n**Seventh: Entering the Yang Realm in Dreams**\nThe incantation reads:\n*\"Dié gōu shén jiàng shū shè.\"*\n\n**Eighth: Inducing Cloud-Wandering Dreams**\nThe incantation reads:\n*\"Jiǔ tiān péng biàn dà jiàng hún shè.\"*\n\n**Ninth: Inducing Familial Dreams**\nThe incantation reads:\n*\"Hù shēn zhǔ rén èr shén bù yuǎn shè.\"*\n\n**Tenth: Enabling Dream Vision of Ghosts and Spirits**\nIt reads:\n*\"Gōu shén qiǎn guǐ cēncī shè.\"*\n\n**Eleventh: Inducing Dreams of Ascending the Nine Heavens**\nIt reads:\n*\"Kāi tōng lìshì chuán shén shè.\"*\n\n**Twelfth: Directing All Dreams at Will**\nIt reads:\n*\"Shā shén shòu shòu yù nǚ huán hún mèng shè.\"*\n\nWrite the talisman and recite the incantation in a secluded, cool chamber. Gather your spirit, face north, and sit upright. Visualize the Seven Stars of the Northern Dipper hovering above your head, with the Dark Warrior (Xuanwu) manifesting—the tortoise and serpent entering your mouth. Hold your breath as you write, then blow onto the paper. Use a new brush and cinnabar to inscribe it. If giving it to another, write two additional talismans of your choosing on the same sheet and seal it. At night, pass it through incense smoke, burn it over a lamp, and consume the ashes with fragrant water. Sleep alone, and the effect will manifest.\n\nFor transmission, perform the ritual on the seventh night: burn incense, light the Seven Star Lamps, and bow in worship. Recite each incantation twice, increasing to forty-nine days (seven sets of seven), after which you may use them at will. If recited backward, the method becomes profoundly secret. In practice, steadfast devotion is essential. Disrespect will render it ineffective.\n\n---\n\n**The Straightforward Method**\nInscribe the Five Directions Seal in cinnabar, burn it to ash, and mix it into warm water. Recite the Five Directions Incantation and the Heaven-Earth Sages’ Incantation, then wash your head and eyes with the water to straighten your vision.\n\n**The Shadow-Chasing Method**\nUse five sheets of pure paper, press the Five Directions Seal onto your body, and recite the Five Directions Incantation along with the Sages’ Incantations. Recite the Water Incantation, form the Water Seal, and chase your shadow in moonlight for ten steps—you will cast no shadow.\n\n**The Fire-Breaking Lock Method**\nForm the Fire Seal with your left hand and the Wood Seal with your right. First recite the Wood Incantation, then the Fire Incantation. With your right little finger, trace the character for \"fire\" on the ground, then trace the Fire Seal with your right hand—the lock will open of its own accord.\n\n**The Moonlight Illumination Method**\nPlace the Five Directions Seal inside a *kaolao* (ritual vessel). At the second watch of the night, carry the *kaolao* ten steps outside, then tilt it while reciting the Five Directions Incantation and the Sages’ Incantations. Retrieve the Five Directions Seal from the *kaolao*, bring it indoors, and pour it out—your entire dwelling will be illuminated.\n\n**The Rising Method**\nAffix the Five Directions Seal to the soles of your feet, recite the Sages’ Incantations, and form the Five Directions Seal. You will feel your body lighten and rise with the wind, ascending to a height of a hundred feet.\n\n**The River-Crossing Method**\nWhen encountering a river, place the Earth Seal beneath the soles of your feet, recite the Earth Incantation and the Sages’ Incantations, and step into the water as if walking on a broad path—you will cross without realizing it.\n\n**The Wisdom-Eye Method**\nBurn the Five Directions Seal to ash over a lamp and mix it into two *dou* and two *sheng* of well-drawn water. Form the Fire Seal with your left hand and recite the Sages’ Incantations along with the Fire Manifestation Incantation. Stir the water three times with your right hand, then wash your eyes with it to perceive the spirit realm.\n\n**The Concealment Method**\nPress the Five Directions Seal onto your body or head, recite the Sages’ Incantations, and enter a crowd—no one will see you. If observing valuables, do not succumb to greed.\n\n**The Earth-Shrinking Method**\nPlace the Five Directions Seal on the soles of your feet, recite the Sages’ Incantations, and travel a thousand *li* in a day.\n\n**The True Purity Method**\nBurn the Five Directions Seal to ash and consume it with east-flowing water. Recite the Sages’ Incantations and the Five Directions Incantation for thirty-five days—your desires will vanish entirely, and you will attain perpetual detachment.\n\n**The Spirit-Exiting Method**\nOn the eight solar terms, inscribe the Five Directions Spirit Seals in cinnabar, burn them to ash with pure incense, and consume them in a purified chamber. Sit upright and recite the Sages’ Incantations, then the Wood Incantation. Form the Wood Seal, and your spirit will exit in all four directions—east, west, north, and south alike.\n\n**The Five Transformations**\n**Wood Transformation:** Press the Wood Seal onto your body, recite the Sages’ Incantations, and chant the Wood Incantation above your head. Form the Wood Seal in a forest, and you will merge with the trees—no one will see you. This is called *Wood Transformation*.\n\n**Fire Transformation:** Press the Fire Seal onto your body, recite the Sages’ Incantations and the Fire Incantation, and form the Fire Seal. You will become indistinguishable from fire, unscathed by flames. Lean against grass or wood, and it will burst into smoke and fire. This is called *Fire Transformation*.\n\n**Metal Transformation:** Press the Metal Seal onto your body, recite the Sages’ Incantations and the Metal Incantation, and form the Metal Seal. You will be invulnerable to blades and swords. This is called *Metal Transformation*.\n\n**Water Transformation:** Press the Water Seal onto your body, recite the Sages’ Incantations and the Water Incantation, and form the Water Seal. You will merge with water and be unable to drown. This is called *Water Transformation*.\n\n**Earth Transformation:** Press the Earth Seal onto your body, recite the Sages’ Incantations and the Earth Incantation, and form the Earth Seal. You will merge with the earth, becoming invisible to the eye. This is called *Earth Transformation*.\n\n**The Corpse Transformation Method**\nHold the Five Directions Seal, burn it to ash, and mix it with fragrant water. Consume it for seven days, reciting the Sages’ Incantations seventy times each morning, along with the Five Directions Spirit Incantations, and forming the Five Directions Spirit Seals. On the seventh day, you will die, yet remain unharmed even after ten years.\n\n**The Five Directions Halo Method**\nBurn the Five Directions Seal to ash and consume it. On the second day of each month, before sunrise, recite the Sages’ Incantations and the Five Directions Spirit Incantations, and form the Five Directions Seals. A five-colored halo will emanate from your mouth, allowing you to perceive future events.\n\n**The Paper Animation Method**\nDry the Five Directions Seal with incense powder, then cut paper into various shapes. Recite the Five Directions Spirit Incantations and the Sages’ Incantations, burn the Water Seal to ash, and mix it with one *sheng* of well-drawn water. Recite the Water Incantation, form the Water Seal, and sprinkle the water—all paper shapes will transform as commanded. This is a most potent prohibition.\n\n**The Twelfth-Month Flower-Blooming Method**\nUse the Fire Seal of apricot and peach trees and the Water Seal. Draw two *dou* and two *sheng* of freshly drawn water to pour over the trees, recite the Water, Fire, and Earth Incantations, and the trees will bloom in season.\n\n**The Wheat-Growing Method**\nTake one *sheng* of wheat and prepare a plot fifty *bu* in length and breadth. Burn the Five Directions Seal to ash, mix it with two *sheng* of well-drawn water, and recite the Sages’ Incantations and the Five Directions Spirit Incantations seven times each. Soak the wheat in the water. Plant it on the eighth day of each month at the *you* hour; by the *xu* hour, the seedlings will sprout. At the *yin* hour, water them with the Five Directions Spirit Seal, and again at the *chen* hour. By the *si* hour, the wheat will ear; by the *wu* hour, it will ripen. Harvest five *sheng* and five *ge* of wheat, recite the Fire Incantation, and consume it. For ten days, you will not crave morning food, and this will prolong your years—this is the method of absolute fasting.\n\n**The Millet-Growing Method**\nTake half a *sheng* of millet and prepare a plot fifty-two *bu* in length and breadth. Burn the Wood Seal to ash, mix it with well-drawn water, and pour it over the plot. By the *shen* and *you* hours, the seedlings will sprout; by the *xu* hour, they will ear; and by the *zi* hour, they will be ready for harvest. In a purified chamber, pound the millet into grains, dry them for two days, then cook half a *sheng* into congee and consume it—this will prevent aging.\n\n**The Rain-Summoning Method**\nBury the Five Directions Seal in the earth, recite the Sages’ Incantations and the Water Incantation, and form the Water Seal—rain, mist, or frost will fall. To halt it, form the Fire Seal, recite the Fire Incantation, and it will cease.\n\n**The Wind-Commanding Method**\nBury the Earth Seal in the *xun* direction, recite the Sages’ Incantations and the Earth Incantation, and form the Earth Seal—trees will topple and mountains crumble in the ensuing gale. To halt it, form the Wood Seal, recite the Wood Incantation, and the wind will cease.\n\n**The Flesh-Crest Manifestation Method**\nBurn the Five Directions Seal to ash and consume it with fragrant water for five to seven days. Each day, recite the Sages’ Incantations, and a flesh-crest will grow upon your head, your body will resemble lapis lazuli, and the fifty-two marks will transform you into a being of extraordinary form. After two talismans, recite the incantations, first knocking the teeth five times—more is better. Invoke the incantation in times of urgency, and visualize it for aid. If the water is enchanted and given to the sick, wind will not stir, water will not drown, and malevolent spirits will flee.\n\nThe True Primordial Heavenly Worthy receives the Jade Emperor’s decree, the Jade Emperor’s command moves, and the Venerable Lord exhorts—may a thousand blessings and a hundred fortunes follow.\n\n**The Talisman-Writing Method with Enchanted Brush**\nThe Black-Killing Spirit King empowers the brush to subdue all ghosts. Recite the incantation seven times, then spit upon the brush before writing. Write separate talismans for the sick to consume.\n\n**The Self-Consumption of Enchanted Water Method**\nClear and cool, dragon and tiger take form,\nNeither hunger nor thirst—\nI attain longevity.\n*Swiftly, swiftly, as decreed by statute and law!*\n\n**The Enchanted Fruit Method for the Sick**\nFirst knock the teeth seven times, then recite:\n*\"The Perfected Descend and Perfect,\nAll ailments are repelled.\"*\n*Swiftly, swiftly, as decreed by statute and law!*\nRecite the incantation five times.\n\n**The Ritual Procedure**\nAt midnight, the *zi* hour, in a quiet chamber, use two swords to draw a boundary two *zhang* and three *chi* upon the ground, marking the perimeter with mulberry ash. Place forty-nine willow twigs, seven lamps, seven incense burners, two zithers, one bow, two arrows, two sets of brush and inkstone, two new felt mats five *chi* in length, a bowl of white congee, five to seven seasonal fruits, and two bowls of purified water. Arrange all items in their proper positions, then invoke and welcome:\nThe Primordial Heavenly Worthy of True Origin, descending upon the light to take his seat,\nThe Great Emperor of the North Pole, descending upon the light to take his seat.\n\nThe Star Lords of the Five Directions:\nThe Star Lord of Virtue of the East, *jia-yi* years,\nThe Star Lord of Mars of the South, *bing-ding* years,\nThe Star Lord of Venus of the West, *geng-xin* years,\nThe Perfected Star Lord of the North, *ren-gui* years,\nThe Star Lord of Saturn of the Center, *wu-ji* years.\n\nWith reverence, [this ritual] is prepared for the household of [name], born in the year of [year and zodiac], who has observed pure precepts. On this day of the present month, an altar is established.\n\nRespectfully offered are incense, tea, and sacrificial offerings. The incantation reads:\nHeaven attains the One and becomes clear,\nEarth attains the One and becomes tranquil,\nI attain the One and become numinous.\nHeaven covers, Earth bears,\nSun and Moon illuminate me,\nThe Five Lights assist me,\nThe Five Stars empower me.\nHasten, hasten, swiftly, swiftly, as decreed by statute and law!\n\n**Seal-Forming Methods**\n*Heaven Seal*: Press the tips of both middle fingers against the middle joints of the index fingers.\n*Earth Seal*: Cross the feet in a ten-character stance.\n*Wood Seal*: Press the tips of both thumbs against the *Zhen* Palace, drawing qi from the East five times.\n*Fire Seal*: Press both thumbs against the *Li* Palace, drawing qi from the South three times.\n*Metal Seal*: Press the tips of both thumbs against the *Dui* Palace, drawing qi from the West twice.\n*Water Seal*: Press the tips of both thumbs against the *Kan* Palace, drawing qi from the North twice.\n*Earth Seal*: Press the tips of both thumbs against the *Central* Palace, drawing qi five times.\n\nAfter forming each seal with its corresponding posture, recite the incantation:\n*\"These are all the sacred assemblies.\"*\nWhen this verse is spoken and each method applied, there shall be no lack of efficacy.\n\n**Incantations of the Five Directions**\n*Wood Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya svāhā.*\n*Fire Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya svāhā.*\n*Metal Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya vāruṇa svāhā.*\n*Earth Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya bālā-balavīrya svāhā.*\n*Water Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya hūṃ svāhā.*\n\nThe seals are to be carved from jujube wood, each two *cun* and two *fen* in size, using the *Dragon’s Startle* method.\n\n**Incantations Invoking the Five Directional Deities**\n*Wood Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the East!\n*Fire Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the South!\n*Water Command*: Command the Great Golden Summit, Wheel-King of Self-Mastery of the North!\n*Metal Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the West!\n*Earth Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the Center!\n\nShould a person of worthy wisdom receive and transmit this,\nOne of meager virtue shall bring calamity upon nine generations and themselves.\n\n**Rites of Reverence**\n\nThe days of veneration are as follows: the first day of the first month, the second day of the eleventh month, the third day of the third month, the fourth day of the fourth month, the fifth day of the fifth month, the sixth day of the sixth month, the seventh day of the seventh month, the eighth day of the eighth month, the ninth day of the ninth month, the tenth day of the tenth month, the eleventh day of the eleventh month, and the twelfth day of the twelfth month.\n\nFor those who practice this Dao, a purified chamber must be chosen, where morning and evening incense and offerings are diligently presented. On the aforementioned days of each month, rites of worship and invocation should be performed. With sincere devotion and reverence, the cycle is to be repeated without end. One must not begin with diligence only to grow lax later; steadfast focus is essential. By such practice, there shall be no failure.\n\nThe arrangement of the altar and its offerings has been described above.\n\n**The Supreme Mysterious and Wondrous Thousand-Gold Register**\nOn the following days— the first and seventh days of the first month, the third day of the third month, the fifth day of the fifth month, the seventh day of the seventh month, the fifteenth day of the ninth month, and the eight solar terms— the rites are conducted in the same manner. At each festival, one must first consume the Twelve-Hour Talisman, then inscribe a Congee Talisman, burn it to ash, grind it in an inkstone, and blow the residue before inscribing further talismans.\n\nThese twelve talismans are to be burned to nine portions of ash, taken each morning with water.\n\nWhen receiving the Dao, if the celestial signs align, a clean mat is to be used. If none is available, the ground must be swept clean. Offerings of incense, lamps, tea, and wine— each in sets of three— along with fruits as one desires, are to be prepared. Facing north, the talismans are inscribed as follows:\n\n1. The Unifying Thread Talisman\n2. The True Reception Talisman\n3. The Celestial Armor Talisman\n4. The Terrestrial Armor Talisman\n5. The Personal Armor Talisman\n6. The Perceptive Eye Talisman\n\nFacing north, incense is burned, and with reverence, the following are invoked:\nThe Supreme Primordial and Wondrous Dao Perfected Lord,\nThe Nine Heavens’ Divine Attendant of the Archery Terrace,\nThe Nine Heavens’ Envoys,\nThe Azure Dragon of the Left,\nThe White Tiger of the Right,\nThe Vermilion Bird of the Front,\nThe Dark Warrior of the Rear.\n\nMay they bestow their aid and grace, granting the petitioner’s wishes as desired.\n\nHaving purified oneself through fasting and ablutions, one burns incense, pours libations, stands upright, and bows deeply to invoke:\nThe True Lord of the Northern Dipper,\nThe Lady of the Purple Tenuity,\nThe Lord of the East,\nThe Queen Mother of the West,\nThe River Earl,\nThe Rain Master,\nThe Twelve Palace Deities,\nThe Six Jia Generals,\nThe Directing Talisman Envoys.\n\nMay they deem the petitioner worthy to receive the talismans, fulfilling all desires.\n\nFurther invocations are made:\nThe Azure Emperor of the East, riding the Azure Dragon;\nThe Vermilion Emperor of the South, riding the Vermilion Dragon;\nThe White Emperor of the West, riding the White Dragon;\nThe Black Emperor of the North, riding the Black Dragon;\nThe Yellow Emperor of the Center, riding the Yellow Dragon.\n\nMay the Five Emperors of the Five Directions each descend their numinous qi, riding their five dragons to their respective positions, and attend the altar to receive the offerings, granting the petitioner’s wishes.\n\nIncense is offered again, and the following are invoked:\nThe Azure Emperor of the East and the Azure Dragon,\nThe Vermilion Emperor of the South and the Vermilion Dragon,\nThe White Emperor of the West and the White Dragon,\nThe Black Emperor of the North and the Black Dragon,\nThe Yellow Emperor of the Center and the Yellow Dragon.\n\nMay each descend their numinous qi into the petitioner’s body.\nMay the upright qi of the Five Celestial Stars enter the petitioner’s body.\nMay the petitioner’s hun and po be shielded from all malevolent influences, all harm averted, and all spirits and demons be commanded to prosperity.\n\nThe River Earl’s Officials,\nThe Directing Talisman True Officials,\nThe Enforcers of the Dao,\nThe Twelve Divine Officials,\nThe Upper and Lower Five Jia,\nThe Wind Earl,\nThe Rain Master—\n\nMay they all descend their numinous qi into the petitioner’s body, harmonizing virtue and spirit. In heat, there shall be no heat; in cold, no cold. When hungry, one shall be sated; in peril, one shall find safety. The talismans’ divine efficacy shall be manifest.\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\nThe prayer is repeated:\n\nWith reverence, we address the multitude of spirits: the wine and offerings are humble and meager, unworthy of presentation. We pray for your indulgence and that each of you, with your respective divine retinues, deign to accept them.\n\nHaving bowed twice, the petitioner drinks the wine, and the remainder is cast into the east-flowing waters. The *General Register Talisman* and the *Three Jia Talismans* are then swallowed. Thereafter, the *True Receiving Talisman* is placed in a blue pouch and worn within the topknot of the hair.\n\nThe *All-Seeing Talisman* is burned to ash, mixed with water, and allowed to settle. The eyes are washed with the clear liquid, enabling one to see and converse with earth spirits and hear the speech of ghosts and gods, ever abiding within the body.\n\nAfter the rites, the spirits must be sent forth.\n\n**General Register Talisman (First)**\nFor all talismans, on the day prior to use, write the talisman in cinnabar and swallow its nine segments. The ritual is performed on the seventh day of the first month, the third day of the third month, the fifth day of the fifth month, the seventh day of the seventh month, the fifteenth day of the eighth month, and the ninth day of the ninth month. At night, when the stars are clear, write the talisman, burn incense, and recite the incantation:\n\n*\"The Celestial Pivot roams and traverses,\nSun, moon, and stars assemble.\nThe talisman burns, qi submits,\nThe Nine Essences transmit the Sovereign’s decree.\nAll talismans, swiftly, swiftly, swiftly take form,\nGuarding and shielding this petitioner’s body,\nEver as treasure and silk.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\n**True Receiving Talisman**\nWrite this talisman beneath the Northern Dipper. For all talismans, first recite the incantation, then write the talisman in cinnabar, invoking the name at the year, month, day, and hour. The incantation reads:\n\n*\"Lady Xuan Yuan, by nature fond of purity,\nYearns for the wondrous Dao.\nShe reverently enacts the celestial talismans,\nCommanding spirits and subduing ghosts.\nHeavenly spirits protect me,\nEarthly spirits bear me,\nSun and moon illuminate me,\nCelestial spirits guard me,\nThe River Earl ferries me,\nAll malevolence submits to me,\nTrue spirits shield me.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\n**All-Seeing Talisman (Third)**\n\nPlace it in a blue pouch and wear it atop your hair knot. Write this talisman on the eight solar terms; it sharpens hearing and sight, allowing speech with ghosts and spirits. Write in cinnabar, burn to ash, steep in water, wash the eyes, and drink. Instantly, you may converse with ghosts and spirits. Burn this talisman after invoking the spirit. When inscribing it, first burn incense and recite the incantation:\n\n*\"The sun is my father,\nThe moon is my mother,\nThe Five Stars are my brothers.\nI command the subjugation of all ghosts and spirits.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\"*\n\n**Celestial Armor Talisman (Fourth)**\nThe Celestial Armor Talisman bears the surname Qing and the style name Wengong. It knows the celestial cycles of stars, their movements, and their returning measures, and can dispatch stars and the moon to manifest forms before people. When a person’s body resembles the Celestial Serpent, with dragon’s feet like those of an ox, four-footed and shod, this spirit brings much joy. To summon the spirit, prepare a secluded chamber with incense, fruit, wine, and dried meat. At the hour of *zi*, inscribe the talisman on white silk, five *cun* in width, place it in a blue pouch, and wear it in your hair knot. First recite the incantation:\n\n*\"Yin and yang harmonize,\nAll affairs follow.\nMessenger of the talisman,\nPursue me east and west.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\"*\n\n**Terrestrial Armor Talisman (Fifth)**\nThe Terrestrial Armor Talisman knows all hidden corpses, buried treasures, and tombs beneath heaven. This spirit bears the surname Zhuo and the style name Wugong. Its form resembles a woman’s body, clad in cloth robes with unbound hair, riding a green dragon. Upon first sight, it brings much joy. Write this talisman in cinnabar, shout thrice, and the spirit will arrive immediately. The incantation reads:\n\n*\"Gentle and warm, firm and yielding,\nEarth is soft, heaven is hard.\nI now inquire,\nFortune and misfortune clearly discerned.\nSwiftly, swiftly, in accordance with the Most High’s statutes and ordinances!\"*\n\n**Human Armor Talisman (Sixth)**\nThe Human Armor Talisman bears the surname Jin and the given name Hua. Its form resembles a woman, half red and half blue, clad in red robes, riding a red horse. Its face is human-like, with two attendants wielding *mouli* blades, one white-faced and one-eyed, without a nose. It knows where a household’s servants or maidservants have fled, and can reveal the whereabouts of fathers and sons separated for many years. When questioned, it instantly knows their location.\n\nInscribe this talisman in cinnabar and wear it within your topknot; focus upon the spirit’s name, and in an instant they will arrive in full. For the first offering to this talisman, use wine and dried meat; thereafter, no further offerings are required.\n\n**Fifth Talisman: The Wandering Sickness Talisman (Seventh)**\nThis talisman is the emissary of the Lord of the Northern Dipper, ever patrolling and inspecting the world. When curses or malevolent acts are committed, it inflicts sickness upon the offender, deducting years from their lifespan. All sudden afflictions—festering sores, blindness, and every manner of ailment—are governed by this spirit. If one dreams of peace and comfort, offer incense, tea, and cakes to it, and no ghost or spirit will dare to act; the illness will then yield to tranquility.\n\nThis spirit takes the form of a woman clad in black robes, bent at the waist and holding a *li* blade, riding a donkey. Its surname is Zhuan, and its given name is Eji. It is also called Ebao. Inscribe this talisman in cinnabar and place it beside the head of the afflicted; they will recover at once. If the illness recurs, write the talisman in ink, inscribe the person’s name beneath it, and burn it in a brazier—it will not return.\n\nThe incantation reads:\n*\"Emissary of the Northern Lord,\nCome swiftly riding your spirit donkey,\nRelease the sins of the afflicted.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\"*\n\n**Imperial Tally Talisman (Eighth)**\nThe Imperial Tally Talisman is ever at one’s command.\n\nThe spirit’s surname is Liu, its given name Kesi, and its sobriquet Yishu or Changfeixing. It can discern the fortunes and misfortunes of the human realm, as well as matters of good and ill omen in their profound subtlety. Clad in celestial robes and crowned with a floral coronet, it rides the clouds and knows the winds and rains, the harvest’s bounty, and the turning of the seasons. Inscribe this talisman in cinnabar, place it in a blue pouch, and wear it over the chest beneath one’s garments. Thereafter, whenever one calls upon it in thought, the spirit-talisman will appear as if seen with one’s own eyes, and the spirit will speak of the auspices or inauspices at hand.\n\nThe incantation reads:\n*\"The sun is my father,\nThe moon is my\n\nInscribe this talisman in cinnabar, writing the name of the deceased beneath it. Close your eyes and recite the incantation:\n\n*\"Vast and boundless,\nThis is my talisman’s seal.\nHasten, hasten, as the statutes command.\"*\n\nUpon opening your eyes after the incantation, the ghost will arrive. When asked where the grave lies, the ghost will reveal its location.\n\nThis is the Spirit-Summoning Talisman, also called the Verification Talisman. These talismans were all inscribed upon the stone walls within the Hua Mountain grotto, and those who copy them must do so with utmost sincerity and care, for they command all ghosts and spirits.\n\nInscribe it in cinnabar. When taken to a household to inquire about matters concerning their kin, even the door spirits and the Ao deities will all come forth, standing before you to declare the auspices or inauspices, and they will disclose their names, dwelling places, and origins.\n\nHere ends the *Three Registers of the Cavern Spirits in Vermilion Script of the Most High*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上赤文洞神三箓 经名：太上赤文洞神三箓。 齐梁陶弘景集，唐李淳风注。 一卷。 底本出处； 《正统道藏》洞玄部众术类。 太上赤文洞神三箓 梁贞白先生集 唐太史令李淳风注 隐居先生曰：线者，本曰赤文洞神式，别出为三本。 此书於葛鲍未，题有所受人汉中，曰：吾今以众所传者，证之为一篇，而遂题本称於予前，故具名众也。 中有两字讹两，存之。 予在里村时，有好事郭君，喻示于余。 此本青廉泥丹书，齐梁时字也，古朴而符篆精妙，未有岁载之题，而不详时代。 曾授与故人道士张乔，张乔云：试之大验。 余为故人惜心，岂徒然也。 因为校之于前。 贞观六年，岁在壬子辰月序。",
      "translated_text": "*The Supreme Red Writ of the Cavernous Spirit’s Three Registers*\n\n**Scripture Title:** *The Supreme Red Writ of the Cavernous Spirit’s Three Registers*\nCompiled by Tao Hongjing of the Qi and Liang dynasties; annotated by Li Chunfeng of the Tang.\nOne fascicle.\nSource edition: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Category of Miscellaneous Arts.\n\n*The Supreme Red Writ of the Cavernous Spirit’s Three Registers*\nCompiled by Master Zhenbai of the Liang\nAnnotated by Li Chunfeng, Grand Astrologer of the Tang\n\nThe Recluse Master says: The original text was called *The Red Writ of the Cavernous Spirit’s Formula*, later divided into three versions. This scripture predates Ge and Bao, bearing the names of its transmitters from Hanzhong, who declared: \"I now compile the various transmitted versions into one scroll, retaining the original title as it was presented before me, hence its collective designation.\"\n\nTwo characters contain errors, which are preserved here. During my time in the village, a certain Guo, a man of refined interests, showed this to me. The text was written in cinnabar on green-tinted silk—a script style of the Qi and Liang eras—ancient and unadorned, its talismanic seals exquisitely rendered. Though undated and lacking a clear era, it was once transmitted to the late Daoist Zhang Qiao, who attested to its profound efficacy. How could I, for the sake of an old friend, treat this lightly? Thus, I have collated it as it stands before me.\n\nPreface written in the third month of the *renzi* year, the sixth year of the Zhenguan era.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 273,
      "start_sentence": 0,
      "end_sentence": 17,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.35952091217041,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "三箓篇上，周易内文，三甲处，谈周易内文，具八极圣祖名，上字妙行符。 昔伏羲传与神农； 神农传，由知五谷之播种，辨别百药之良，得济生民。 后线图得之，为颛师； 周公得之，以明易道； 太公得之，以阴谋佐武成王灭纣； 孔子得之，遂洞幽微，以赞易道。 此文古本，如之法出，户中尧未必知传授者崇之，其后管夷吾、孙膑等，皆相传； 范蠡、张良亦尔。 又曰：膑是白龟之精，位相禀荣武之气。 元有此句，未详。 扬誓方仲论上官弼，此皆元本有之，验其人未之见。",
      "translated_text": "The \"Three Registers\" section above contains the inner text of the *Zhouyi*. In the \"Three Jia\" positions, it discusses the inner text of the *Zhouyi*, listing the names of the Eight Polar Sage Ancestors, with the upper character being the \"Marvelous Conduct Talisman.\"\n\nIn ancient times, Fu Xi transmitted it to Shen Nong; Shen Nong, having received it, discerned the sowing of the Five Grains and distinguished the properties of the hundred herbs, thereby aiding the livelihood of the people. Later, the Lineage Chart was obtained by Zhuan Xu’s teacher; the Duke of Zhou obtained it and illuminated the Dao of the *Yi*; the Grand Duke obtained it and employed its subtle strategies to assist King Wu in overthrowing Zhou; Confucius obtained it and thereby penetrated its profound mysteries, further exalting the Dao of the *Yi*.\n\nThis text, in its ancient form, emerged in accordance with its method. Even if Yao in his chamber did not necessarily know of its transmission, those who received it revered it. Thereafter, Guan Yiwu, Sun Bin, and others passed it down in succession; Fan Li and Zhang Liang did likewise.\n\nIt is also said: \"Bin is the essence of the white tortoise, his ministerial position endowed with the qi of martial glory.\" This line originally existed but remains obscure. Yang Shi, Fang Zhong, and Shangguan Bi—all were recorded in the original text, yet their verification in later times remains unseen.",
      "overlap_context": " The text was written in cinnabar on green-tinted silk—a script style of the Qi and Liang eras—ancient and unadorned, its talismanic seals exquisitely rendered. Though undated and lacking a clear era, it was once transmitted to the late Daoist Zhang Qiao, who attested to its profound efficacy. How could I, for the sake of an old friend, treat this lightly? Thus, I have collated it as it stands before me.\n\nPreface written in the third month of the *renzi* year, the sixth year of the Zhenguan era.",
      "start_char": 274,
      "end_char": 484,
      "start_sentence": 18,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.45168161392212,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "其法曰：神人言曰《太平经》称神人、真人，每日持诵咒，不忌州切诸物，俱诵咒四十九日，其神自来厅宫，厅宫者耳边是也。 道说一切人间万事也。 所报耳边善恶吉凶，莫不预言。 若斗战、强弱、胜败、存亡，或被盗不知主者。 若捕捉奴婢进叛人来之意。 若何所向之方，求谋利益干贵进荣。 凡百所为举无漏也。 更进未知其成否也，但存神即至也。 天下大事，国家休祥，利禄名位，千载已前，未来之事，皆通晓也。 诵咒满十万褊，若问其事，即得。 其两神身着道服，令人心语。 笑问之，一一皆语。 若心欲所求，先诵咒七褊，其神便来厅宫前。 其人来意，一一预知。 其神一个着绿衣，在左耳报事； 一个紫罗衣，在右耳边报事。 其神常随人行，但问急意便急，报急唤急，至无不知者也。 八卦内吉凶应录 咒曰： □□□□□□□□勑煞摄。 其神乃日月之精，宜子丑阴阳日使之。 但取六甲头日，朱书此符，烧灰以清水调之，诵前咒二百二十遍，以符灰水入两耳、目鼻及口，各七点，之余者，服之讫，再书此符，依前咒诵四十九遍，然后带之，即见神验。 呼遣差此指挥罡若遣报起罡，六十日却值六甲子日，烧灰点之，即书符带之，周而复始。 至心存想，不住烧香，无不神效，焚香度符，念咒七徧咒曰： 愿豆炉共李鬼，要千虚万圣，合通天地户。 此咒祭时，以念咒七遍，每遇甲子日为首，却甲子日受符，至满六十甲子，并用鹿脯、羊肝食祭之如无鹿脯，以羊脯代之，祭后祭物自食。 此法不可轻泄秘之。 东方震符 其神青衣，头带青冠，如女子之形，若有疑问，告人吉凶。 天日未出时，以井花水向震地服符五道。 东方艮符 其神黑衣冠，以井花水，卯时向艮地服符五道，神人对面言语，此符大验。 东方巽符 其神青头冠，如女子之形，大小同服，令东巽，来告人吉凶。 用井花水服符五道向巽地，服自然心开意悟。 南方离符 其神赤衣，如持女子之形，精心修，其神自来言语。 卯时向离地，以井水服符五道。 西北乾符 其神黑衣，如男子之形，卯时向乾地服符五道，以井花水服下，其神便来。 西南坤符 其神黄衣冠，如老母之形，卯时向坤用井花水服之符三道，其神自来共语，大有神验。 西北兑符 其神白衣冠，如女子之形，能知吉凶日月，追逃亡、遣盗、溺死、兵死、虎狼死、目明、耳听、先知名字，用井花水向兑服符五道。 北方坎符 其神着黑衣，卯时向北方，以井花水吞符五道，即得神通精爽灵验矣。 凡修持，逢七七日夜，面北焚香，点七星灯，礼拜合念前，咒二遍。 二七日至七七日，任意使，皆如念。 不用书读之，请勿传下士，其行时，切要坚心净意虔诚，如轻弗敬怠慢者，堕七祖及自身。 祖师入夜梦游诸境玉女迷魂法 第一，试法门。 令小儿睡，先念咒，二曰不动，尊圣摄，以黑纸上迭了，令小孩儿口咬之，二帛蒙头，先取睡卧二口气，念咒曰： 追四大神将，勾迷魂玉女。 念毕，吹睡小儿口内，以两手大拇指去睡人三思台上分捻。 又其人自睡，又取五方气吹在身上，如二碗茶问，自端坐念：不动尊圣摄去寻之见了。 再念：追四大神将，勾玉女迷魂，吾唤速来归。 唤小名，起来。 第二，去家梦。 咒曰： 唵比哩庠去摄。",
      "translated_text": "The method states: The divine beings speak of the *Scripture of Great Peace*, which refers to divine beings and perfected persons. Each day, one must recite the incantation without abstaining from any foods, including those of the \"zhou\" and \"qie\" categories. After reciting the incantation for forty-nine days, the spirit will naturally come to the \"hall palace\"—that is, beside the ear. The Dao explains all matters under heaven. Whatever good or ill, fortune or misfortune is reported beside the ear, none is not foretold in advance. Whether in battle, strength or weakness, victory or defeat, survival or demise, or even theft by an unknown perpetrator—all may be known. It reveals the intentions of captured slaves or rebels who come forth, the direction one should take, or how to seek profit, advantage, honor, and glory. In all undertakings, nothing is left unaddressed. Even before knowing whether something will succeed, merely focusing on the spirit will summon it. Matters of great consequence in the world, the fortunes of the state, blessings and omens, rank and emolument, fame and position—events from a thousand years past or yet to come—all are thoroughly understood. Once the incantation has been recited ten thousand times, if one inquires about a matter, the answer is immediately obtained. The two spirits wear Daoist robes and communicate with one’s innermost thoughts. If one smiles and asks, they respond to every question. If there is something one desires, first recite the incantation seven times, and the spirit will come before the hall palace. The person’s intentions are all foreknown. One spirit, clad in green robes, stands by the left ear to report matters; the other, in purple silk, stands by the right ear. The spirits constantly follow the person, responding swiftly to urgent inquiries and answering promptly when urgently summoned, leaving nothing unknown.\n\n**Records of Auspicious and Inauspicious Responses within the Eight Trigrams**\nThe incantation reads: □□□□□□□□ (command, slay, seize).\n\nThese spirits are the essences of the sun and moon, and they are to be employed on the yin and yang days of *zi* and *chou*. One should select the first day of the six *jia* days, write this talisman in cinnabar, burn it to ash, and mix it with pure water. Recite the above incantation two hundred and twenty times, then apply seven drops of the ash-water to each of the ears, eyes, nose, and mouth. Consume the remainder. Write the talisman again, recite the incantation forty-nine times as before, and carry it on one’s person—then the spirits will manifest their efficacy. When summoning or dispatching them, align the *gang* (cosmic pivot) as instructed. After sixty days, when the cycle returns to the day of *jia-zi*, burn the talisman to ash and apply it again. Write the talisman anew and carry it, repeating the cycle. With sincere focus and unwavering incense offerings, there is no lack of divine efficacy. Burn incense, transmit the talisman, and recite the incantation seven times:\n\n*\"May the bean burner and Li Gui,\nRequire a thousand voids and ten thousand sages,\nTo join and open the gates of heaven and earth.\"*\n\nWhen performing the ritual, recite this incantation seven times. Begin on the first *jia-zi* day, and on that day, receive the talisman. After completing sixty *jia-zi* cycles, offer a feast of venison and lamb’s liver. If venison is unavailable, substitute mutton. After the offering, consume the food yourself. This method must not be lightly disclosed; keep it secret.\n\n**Talisman of Zhen (East)**\nIts spirit wears green robes and a green crown, resembling a woman in form. If one has doubts, it will inform them of fortune or misfortune. Before sunrise, take well-flower water, face the direction of Zhen, and consume the talisman five times.\n\n**Talisman of Gen (Northeast)**\nIts spirit wears black robes and a black crown. At the hour of *mao*, take well-flower water, face the direction of Gen, and consume the talisman five times. The spirit will speak face-to-face, and this talisman is highly efficacious.\n\n**Talisman of Xun (Southeast)**\nIts spirit wears a green crown and resembles a woman in form. Both large and small talismans are consumed while facing Xun, and the spirit will come to report fortune or misfortune. Use well-flower water, consume the talisman five times while facing Xun, and one’s mind will naturally open and awaken.\n\n**Talisman of Li (South)**\nIts spirit wears red robes and resembles a woman in form. Cultivate with sincerity, and the spirit will come of its own accord to speak. At the hour of *mao*, face the direction of Li, and consume the talisman five times with well water.\n\n**Talisman of Qian (Northwest)**\nIts spirit wears black robes and resembles a man in form. At the hour of *mao*, face the direction of Qian, consume the talisman five times with well-flower water, and the spirit will come.\n\n**Talisman of Kun (Southwest)**\nIts spirit wears yellow robes and a yellow crown, resembling an elderly woman in form. At the hour of *mao*, face the direction of Kun, and consume the talisman three times with well-flower water. The spirit will come of its own accord to converse, and its efficacy is profound.\n\n**Talisman of Dui (West)**\nIts spirit wears white robes and a white crown, resembling a woman in form. It knows the auspicious and inauspicious days, can pursue fugitives, dispatch thieves, and foretell deaths by drowning, warfare, tigers, or wolves. It sharpens vision and hearing, enabling foreknowledge of names. Use well-flower water, face the direction of Dui, and consume the talisman five times.\n\n**Talisman of Kan (North)**\nIts spirit wears black robes. At the hour of *mao*, face north, and swallow the talisman five times with well-flower water. One will then attain spiritual penetration, clarity, and divine efficacy.\n\nFor all cultivation, on the forty-ninth day and night, face north, burn incense, light the Seven Star lamps, bow in worship, and recite the above incantation twice. From the fourteenth to the forty-ninth day, one may employ the spirits at will, as in the recitation. Do not write or read these methods aloud. Do not transmit them to the unworthy. When practicing, one must be resolute in heart, pure in intention, and reverent. If one is careless or disrespectful, they will bring misfortune upon their seven generations of ancestors and themselves.\n\n**The Master’s Method of Dream-Wandering through Various Realms to Bewilder the Jade Maiden’s Soul**\n**First: Testing the Method**\nHave a child sleep, first recite the incantation, and after two days of immobility, invoke the Venerable Immovable Sage to seize control. Fold black paper and place it in the child’s mouth to bite, then cover their head with two pieces of silk. First, take two breaths from the sleeping child, then recite the incantation:\n\n*\"Summon the Four Great Divine Generals,\nTo seize the Jade Maiden and bewilder her soul.\"*\n\nAfter reciting, blow into the sleeping child’s mouth, then use both thumbs to press and separate the *Sansi* platforms (temples) of the sleeper. Have the person sleep again, then take the qi of the five directions and blow it onto their body. After the time it takes to drink two bowls of tea, sit upright and recite:\n\n*\"Venerable Immovable Sage, seize them and go in search—once seen...\"*\n\nRecite again:\n\n*\"Summon the Four Great Divine Generals,\nTo seize the Jade Maiden and bewilder her soul.\nI call you—return swiftly!\"*\n\nCall the child by their given name, and they will awaken.\n\n**Second: Dispelling Nightmares at Home**\nThe incantation reads:\n\n*\"Om bīlǐ xiāng qù shè.\"*",
      "overlap_context": "er did not necessarily know of its transmission, those who received it revered it. Thereafter, Guan Yiwu, Sun Bin, and others passed it down in succession; Fan Li and Zhang Liang did likewise.\n\nIt is also said: \"Bin is the essence of the white tortoise, his ministerial position endowed with the qi of martial glory.\" This line originally existed but remains obscure. Yang Shi, Fang Zhong, and Shangguan Bi—all were recorded in the original text, yet their verification in later times remains unseen.",
      "start_char": 484,
      "end_char": 1777,
      "start_sentence": 30,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.60569381713867,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "第三，去遣人梦。 咒曰： 摛伦叱杀卑摄。 第四，过河筏梦。 咒曰： 云应感通护法摄。 第五，观山境梦。 咒曰： 叱威武大将勑煞摄。 第六，入阴人梦。 咒曰： 勾四大神将勾府命闭气摄。 第七，入阳人梦。 咒曰： 牒勾神将枢摄。 第八，令人游云梦。 咒曰： 九天蓬变大将魂摄。 第九，令人游家梦。 咒曰： 护身主人二神不远摄。 第十，令人洗眼见鬼神梦。 曰： 勾神遣鬼参差摄。 第十一，令人游九霄梦。 曰： 开通力士传神摄。 第十二，一切去者随意梦。 曰： 煞神受受玉女还魂梦摄。 右书符，念咒洁冷密室内，集神面北端坐，想北斗七星覆顶上，玄武现，龟蛇入口内，不出气，书了吹在纸上，用新笔朱砂书之。 如与人，仍於咒上任意别书符二道，盖之。 至夜，香上度过，灯上烧灰，香水吞下，自身独寐，而可应。 凡授，逢七日夜，焚香点七星灯礼拜，各念咒二褊，加至七七日，任意使用。 如背念，得甚秘； 行持，切要坚心。 如有轻慢，弗应也。 直头法 右以五方印朱书，烧灰，下在温水内，念，五方咒及天地诸圣咒毕，水洗头目直。 赶影法 右用净纸五张，下五方印按在身上，念五方咒及诸圣咒，念水咒，结水印，月影中赶十步无影。 把火烧锁法 左手结火印，右手结木印，先念木咒，后念火咒，右手小指地上书火字，右手描火印，其锁自开。 扶月明法 右用五方印安考老内，夜至二更，将考老出门行十步，侧考老，裹念五方咒及诸圣咒，后取五方印考老，挟入房内倾下，满屋皆明也。 起身法 右五方印帖在两脚心，念诸圣咒，结五方印，自觉身轻，随风便起，可高百尺。 渡津法 凡遇河津，用土印安在脚心下，念土咒及诸圣咒，便入水中，如行大路，其水不觉便过了。 慧眼法 右五方印，灯上烧灰，用井花水二斗二升灰水内，左手结火印，念诸圣咒并火现，右手搅水三匝，用水洗眼目，见影界。 隐身法 右用五方印按在身上，或於头上，念诸圣咒，入众人内，令人皆不见。 或观财物，不得贪心。 缩地法 右五方印安在脚心上，念诸圣咒，日行千里。 真净法 右用五方印烧灰，用东流水服之，念诸圣咒及五方咒，若五七日，不阙缩尽永离欲。 出神法 以八节日朱书五方神印，净香调印烧灰，净室中服之，端坐念诸圣咒，念木咒，结木印出四方东西皆同。 五假法 木假，用木印按在身上，念诸圣咒及头上念木睨，结木印於林木中，与木同体，众人不见，谓之木假。 火假，用火印按在身上，念诸圣咒，念火咒，结火印，与火无异，入火不焦，倚草木便生烟焰，谓之火假。 金假，用金印按在身上，念诸圣咒及金咒，结金印，刀剑不惧避，谓之金假。 水假，用水印按在身上，念诸圣咒及水咒，结水印，与水同体，不能沉溺，谓之水假。 土假，用土印按在身上，念诸圣咒及土咒，结土印，与土同体，对目不见，谓之土假。 尸假法 右以五方印拈定烧灰，香水调服七日，每日早晨念诸圣咒七七褊，念五方神咒，结五方神印，第七日便死，或死十年不碍。 五方圆光法 用五方印烧灰调服之，每月二日早晨日未出时，念诸圣咒及五方神咒，结五方印，口中出五色圆光，察未来之事。 一切类用纸便活法 以五方印用香面焙乾后，剪刀铰为诸物形状，念五方神咒及诸圣咒，及水印烧灰，井花水一升，念水咒，结水印，用水洒之，诸物随水变化大禁焉耳。",
      "translated_text": "**Third: Dispelling Dreams Sent by Others**\nThe incantation reads:\n*\"Chīlún chì shā bēi shè.\"*\n\n**Fourth: Crossing Rivers in Dreams**\nThe incantation reads:\n*\"Yún yìng gǎn tōng hù fǎ shè.\"*\n\n**Fifth: Observing Mountain Landscapes in Dreams**\nThe incantation reads:\n*\"Chì wēiwǔ dà jiàng chì shā shè.\"*\n\n**Sixth: Entering the Yin Realm in Dreams**\nThe incantation reads:\n*\"Gōu sì dà shén jiàng gōu fǔ mìng bì qì shè.\"*\n\n**Seventh: Entering the Yang Realm in Dreams**\nThe incantation reads:\n*\"Dié gōu shén jiàng shū shè.\"*\n\n**Eighth: Inducing Cloud-Wandering Dreams**\nThe incantation reads:\n*\"Jiǔ tiān péng biàn dà jiàng hún shè.\"*\n\n**Ninth: Inducing Familial Dreams**\nThe incantation reads:\n*\"Hù shēn zhǔ rén èr shén bù yuǎn shè.\"*\n\n**Tenth: Enabling Dream Vision of Ghosts and Spirits**\nIt reads:\n*\"Gōu shén qiǎn guǐ cēncī shè.\"*\n\n**Eleventh: Inducing Dreams of Ascending the Nine Heavens**\nIt reads:\n*\"Kāi tōng lìshì chuán shén shè.\"*\n\n**Twelfth: Directing All Dreams at Will**\nIt reads:\n*\"Shā shén shòu shòu yù nǚ huán hún mèng shè.\"*\n\nWrite the talisman and recite the incantation in a secluded, cool chamber. Gather your spirit, face north, and sit upright. Visualize the Seven Stars of the Northern Dipper hovering above your head, with the Dark Warrior (Xuanwu) manifesting—the tortoise and serpent entering your mouth. Hold your breath as you write, then blow onto the paper. Use a new brush and cinnabar to inscribe it. If giving it to another, write two additional talismans of your choosing on the same sheet and seal it. At night, pass it through incense smoke, burn it over a lamp, and consume the ashes with fragrant water. Sleep alone, and the effect will manifest.\n\nFor transmission, perform the ritual on the seventh night: burn incense, light the Seven Star Lamps, and bow in worship. Recite each incantation twice, increasing to forty-nine days (seven sets of seven), after which you may use them at will. If recited backward, the method becomes profoundly secret. In practice, steadfast devotion is essential. Disrespect will render it ineffective.\n\n---\n\n**The Straightforward Method**\nInscribe the Five Directions Seal in cinnabar, burn it to ash, and mix it into warm water. Recite the Five Directions Incantation and the Heaven-Earth Sages’ Incantation, then wash your head and eyes with the water to straighten your vision.\n\n**The Shadow-Chasing Method**\nUse five sheets of pure paper, press the Five Directions Seal onto your body, and recite the Five Directions Incantation along with the Sages’ Incantations. Recite the Water Incantation, form the Water Seal, and chase your shadow in moonlight for ten steps—you will cast no shadow.\n\n**The Fire-Breaking Lock Method**\nForm the Fire Seal with your left hand and the Wood Seal with your right. First recite the Wood Incantation, then the Fire Incantation. With your right little finger, trace the character for \"fire\" on the ground, then trace the Fire Seal with your right hand—the lock will open of its own accord.\n\n**The Moonlight Illumination Method**\nPlace the Five Directions Seal inside a *kaolao* (ritual vessel). At the second watch of the night, carry the *kaolao* ten steps outside, then tilt it while reciting the Five Directions Incantation and the Sages’ Incantations. Retrieve the Five Directions Seal from the *kaolao*, bring it indoors, and pour it out—your entire dwelling will be illuminated.\n\n**The Rising Method**\nAffix the Five Directions Seal to the soles of your feet, recite the Sages’ Incantations, and form the Five Directions Seal. You will feel your body lighten and rise with the wind, ascending to a height of a hundred feet.\n\n**The River-Crossing Method**\nWhen encountering a river, place the Earth Seal beneath the soles of your feet, recite the Earth Incantation and the Sages’ Incantations, and step into the water as if walking on a broad path—you will cross without realizing it.\n\n**The Wisdom-Eye Method**\nBurn the Five Directions Seal to ash over a lamp and mix it into two *dou* and two *sheng* of well-drawn water. Form the Fire Seal with your left hand and recite the Sages’ Incantations along with the Fire Manifestation Incantation. Stir the water three times with your right hand, then wash your eyes with it to perceive the spirit realm.\n\n**The Concealment Method**\nPress the Five Directions Seal onto your body or head, recite the Sages’ Incantations, and enter a crowd—no one will see you. If observing valuables, do not succumb to greed.\n\n**The Earth-Shrinking Method**\nPlace the Five Directions Seal on the soles of your feet, recite the Sages’ Incantations, and travel a thousand *li* in a day.\n\n**The True Purity Method**\nBurn the Five Directions Seal to ash and consume it with east-flowing water. Recite the Sages’ Incantations and the Five Directions Incantation for thirty-five days—your desires will vanish entirely, and you will attain perpetual detachment.\n\n**The Spirit-Exiting Method**\nOn the eight solar terms, inscribe the Five Directions Spirit Seals in cinnabar, burn them to ash with pure incense, and consume them in a purified chamber. Sit upright and recite the Sages’ Incantations, then the Wood Incantation. Form the Wood Seal, and your spirit will exit in all four directions—east, west, north, and south alike.\n\n**The Five Transformations**\n**Wood Transformation:** Press the Wood Seal onto your body, recite the Sages’ Incantations, and chant the Wood Incantation above your head. Form the Wood Seal in a forest, and you will merge with the trees—no one will see you. This is called *Wood Transformation*.\n\n**Fire Transformation:** Press the Fire Seal onto your body, recite the Sages’ Incantations and the Fire Incantation, and form the Fire Seal. You will become indistinguishable from fire, unscathed by flames. Lean against grass or wood, and it will burst into smoke and fire. This is called *Fire Transformation*.\n\n**Metal Transformation:** Press the Metal Seal onto your body, recite the Sages’ Incantations and the Metal Incantation, and form the Metal Seal. You will be invulnerable to blades and swords. This is called *Metal Transformation*.\n\n**Water Transformation:** Press the Water Seal onto your body, recite the Sages’ Incantations and the Water Incantation, and form the Water Seal. You will merge with water and be unable to drown. This is called *Water Transformation*.\n\n**Earth Transformation:** Press the Earth Seal onto your body, recite the Sages’ Incantations and the Earth Incantation, and form the Earth Seal. You will merge with the earth, becoming invisible to the eye. This is called *Earth Transformation*.\n\n**The Corpse Transformation Method**\nHold the Five Directions Seal, burn it to ash, and mix it with fragrant water. Consume it for seven days, reciting the Sages’ Incantations seventy times each morning, along with the Five Directions Spirit Incantations, and forming the Five Directions Spirit Seals. On the seventh day, you will die, yet remain unharmed even after ten years.\n\n**The Five Directions Halo Method**\nBurn the Five Directions Seal to ash and consume it. On the second day of each month, before sunrise, recite the Sages’ Incantations and the Five Directions Spirit Incantations, and form the Five Directions Seals. A five-colored halo will emanate from your mouth, allowing you to perceive future events.\n\n**The Paper Animation Method**\nDry the Five Directions Seal with incense powder, then cut paper into various shapes. Recite the Five Directions Spirit Incantations and the Sages’ Incantations, burn the Water Seal to ash, and mix it with one *sheng* of well-drawn water. Recite the Water Incantation, form the Water Seal, and sprinkle the water—all paper shapes will transform as commanded. This is a most potent prohibition.",
      "overlap_context": "hen take the qi of the five directions and blow it onto their body. After the time it takes to drink two bowls of tea, sit upright and recite:\n\n*\"Venerable Immovable Sage, seize them and go in search—once seen...\"*\n\nRecite again:\n\n*\"Summon the Four Great Divine Generals,\nTo seize the Jade Maiden and bewilder her soul.\nI call you—return swiftly!\"*\n\nCall the child by their given name, and they will awaken.\n\n**Second: Dispelling Nightmares at Home**\nThe incantation reads:\n\n*\"Om bīlǐ xiāng qù shè.\"*",
      "start_char": 1778,
      "end_char": 3195,
      "start_sentence": 90,
      "end_sentence": 161,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.24395179748535,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "腊月开花法 以杏桃树火印、水印，用新汲水二斗二升浇树，念水、火、土咒，应时开花。 种麦法 用小麦一升，地长阔五十步作畦子，以五方印烧灰，井花水二升，念诸圣咒及五方神咒，各念七徧，水浸麦子。 每月八日酉时种下，戌时生苗，寅时用五方神印浇徧，至辰时又浇，巳时秀穗，午时黄熟收之，得麦五升五合，念火咒讫服之，十日不思量早食，可以延年，此是绝食之法。 种粟法 用粟米半升，地长阔五十二步，木印烧灰，井花水调浇，至申酉时苗生，戌时秀，子时收。 净室中打候子，乾二日，半升煎粥食，令人不老。 求雨法 以五方印埋於地上，念诸圣咒及水咒，结水印，其雨便下雾霜； 要住，结火印，念火咒，即住。 化风法 以土印埋於巽地上，念诸圣咒及土咒，结土印，立便倒树摧山大风； 要住，结木印，念木咒，风即止。 生肉髻法 以五方印烧灰，香水调服五七日，每日念诸圣咒，头生肉髻，身似琉璃，五十二相便为异样之身，二符后咒之，先叩齿五通，多益善。 呼办咒之，有急又存呼之救助。 咒水与病人吃，风不动，水不浸，邪魔立起。 真元始天尊合受玉皇上帝勑，合受玉皇上帝动，老君劝，千百祥令。 咒笔书符法 黑杀神王力笔下万鬼，悉咒七徧毕，喷上，然后书之，别书符，与病人吃。 咒水自吃法 清清冷冷，龙虎成形，不饥不渴，吾受长生。 急急如律令勑。 咒果子与病人法先叩齿七徧，咒曰： 长真降成，万病不侵，急急如律令。 念咒五徧。 行持法式 夜半子时，静室中用剑二口，画地二丈三尺，桑柴灰为界，柳枝四十九茎，灯七盏，香炉七，个琴二张，弓一张，箭二只，笔砚二付，新· 毡二领，长五尺，白粥一碗，果子及时着五七个，净水二椀，各依位铺设了，启请 元始天尊乘光降临於位就座， 北极大帝乘光下降於位就座，",
      "translated_text": "**The Twelfth-Month Flower-Blooming Method**\nUse the Fire Seal of apricot and peach trees and the Water Seal. Draw two *dou* and two *sheng* of freshly drawn water to pour over the trees, recite the Water, Fire, and Earth Incantations, and the trees will bloom in season.\n\n**The Wheat-Growing Method**\nTake one *sheng* of wheat and prepare a plot fifty *bu* in length and breadth. Burn the Five Directions Seal to ash, mix it with two *sheng* of well-drawn water, and recite the Sages’ Incantations and the Five Directions Spirit Incantations seven times each. Soak the wheat in the water. Plant it on the eighth day of each month at the *you* hour; by the *xu* hour, the seedlings will sprout. At the *yin* hour, water them with the Five Directions Spirit Seal, and again at the *chen* hour. By the *si* hour, the wheat will ear; by the *wu* hour, it will ripen. Harvest five *sheng* and five *ge* of wheat, recite the Fire Incantation, and consume it. For ten days, you will not crave morning food, and this will prolong your years—this is the method of absolute fasting.\n\n**The Millet-Growing Method**\nTake half a *sheng* of millet and prepare a plot fifty-two *bu* in length and breadth. Burn the Wood Seal to ash, mix it with well-drawn water, and pour it over the plot. By the *shen* and *you* hours, the seedlings will sprout; by the *xu* hour, they will ear; and by the *zi* hour, they will be ready for harvest. In a purified chamber, pound the millet into grains, dry them for two days, then cook half a *sheng* into congee and consume it—this will prevent aging.\n\n**The Rain-Summoning Method**\nBury the Five Directions Seal in the earth, recite the Sages’ Incantations and the Water Incantation, and form the Water Seal—rain, mist, or frost will fall. To halt it, form the Fire Seal, recite the Fire Incantation, and it will cease.\n\n**The Wind-Commanding Method**\nBury the Earth Seal in the *xun* direction, recite the Sages’ Incantations and the Earth Incantation, and form the Earth Seal—trees will topple and mountains crumble in the ensuing gale. To halt it, form the Wood Seal, recite the Wood Incantation, and the wind will cease.\n\n**The Flesh-Crest Manifestation Method**\nBurn the Five Directions Seal to ash and consume it with fragrant water for five to seven days. Each day, recite the Sages’ Incantations, and a flesh-crest will grow upon your head, your body will resemble lapis lazuli, and the fifty-two marks will transform you into a being of extraordinary form. After two talismans, recite the incantations, first knocking the teeth five times—more is better. Invoke the incantation in times of urgency, and visualize it for aid. If the water is enchanted and given to the sick, wind will not stir, water will not drown, and malevolent spirits will flee.\n\nThe True Primordial Heavenly Worthy receives the Jade Emperor’s decree, the Jade Emperor’s command moves, and the Venerable Lord exhorts—may a thousand blessings and a hundred fortunes follow.\n\n**The Talisman-Writing Method with Enchanted Brush**\nThe Black-Killing Spirit King empowers the brush to subdue all ghosts. Recite the incantation seven times, then spit upon the brush before writing. Write separate talismans for the sick to consume.\n\n**The Self-Consumption of Enchanted Water Method**\nClear and cool, dragon and tiger take form,\nNeither hunger nor thirst—\nI attain longevity.\n*Swiftly, swiftly, as decreed by statute and law!*\n\n**The Enchanted Fruit Method for the Sick**\nFirst knock the teeth seven times, then recite:\n*\"The Perfected Descend and Perfect,\nAll ailments are repelled.\"*\n*Swiftly, swiftly, as decreed by statute and law!*\nRecite the incantation five times.\n\n**The Ritual Procedure**\nAt midnight, the *zi* hour, in a quiet chamber, use two swords to draw a boundary two *zhang* and three *chi* upon the ground, marking the perimeter with mulberry ash. Place forty-nine willow twigs, seven lamps, seven incense burners, two zithers, one bow, two arrows, two sets of brush and inkstone, two new felt mats five *chi* in length, a bowl of white congee, five to seven seasonal fruits, and two bowls of purified water. Arrange all items in their proper positions, then invoke and welcome:\nThe Primordial Heavenly Worthy of True Origin, descending upon the light to take his seat,\nThe Great Emperor of the North Pole, descending upon the light to take his seat.",
      "overlap_context": "halo will emanate from your mouth, allowing you to perceive future events.\n\n**The Paper Animation Method**\nDry the Five Directions Seal with incense powder, then cut paper into various shapes. Recite the Five Directions Spirit Incantations and the Sages’ Incantations, burn the Water Seal to ash, and mix it with one *sheng* of well-drawn water. Recite the Water Incantation, form the Water Seal, and sprinkle the water—all paper shapes will transform as commanded. This is a most potent prohibition.",
      "start_char": 3196,
      "end_char": 3949,
      "start_sentence": 162,
      "end_sentence": 192,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.511960744857788,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "东方甲乙岁德星君， 南方丙丁荧惑星君， 西方庚辛太白星君， 北方壬癸辰星真君， 中央戊己镇星君。 谨具某家某人年甲姓氏，清净戒於今月某日，设坛。 谨献上香荼、祭物，咒曰：天得一清，地得一宁，我得一灵。 天覆地载，日月照我，五光助我，五星申我。 急呼急至急急如律令。 结印法 天字印，两手中指端箔天指中节文上。 地字印，两脚蹉十字。 木字印，两手大指端箔震宫，东方取气五口。 火字印，两手大指拾离宫，南方取气三口。 金字印，两手大指箔兑宫，西方取气二口。 水字印，两手大指箔坎宫，北方取气二口。 土字印，两手大指箔中宫，取炁五口。 结印法各张势，然后念咒：此是一切圣众。 说此偈，一一用事，无不应验矣。 五方诸圣咒 木咒：囊谟三满多，没驮喃揲啰嘢娑嚩贺。 火咒：囊谟三满多，没驮喃嘢娑嚩贺。 金咒：囊谟三满多，没驮喃嚩噜弯嘢娑嚩贺。 土咒：囊谟三满多，没驮喃钵啰钵尾野娑嚩贺。 水咒：囊模三满多，没驮喃吽嘢娑嘢贺。 右印，用龙惊，枣木刊印，各方二寸二分。 五方神咒 木咤勑东方大金顶自在轮王， 火咤勑唵南方大金顶自在轮王， 水咤勑北方大金顶自在输王， 金咤勑唵西方大金顶自在输王， 土咤勑唵中央大金顶自在轮王。 如有贤哲者，得受传； 薄德者，殃及九祖及连本身。",
      "translated_text": "The Star Lords of the Five Directions:\nThe Star Lord of Virtue of the East, *jia-yi* years,\nThe Star Lord of Mars of the South, *bing-ding* years,\nThe Star Lord of Venus of the West, *geng-xin* years,\nThe Perfected Star Lord of the North, *ren-gui* years,\nThe Star Lord of Saturn of the Center, *wu-ji* years.\n\nWith reverence, [this ritual] is prepared for the household of [name], born in the year of [year and zodiac], who has observed pure precepts. On this day of the present month, an altar is established.\n\nRespectfully offered are incense, tea, and sacrificial offerings. The incantation reads:\nHeaven attains the One and becomes clear,\nEarth attains the One and becomes tranquil,\nI attain the One and become numinous.\nHeaven covers, Earth bears,\nSun and Moon illuminate me,\nThe Five Lights assist me,\nThe Five Stars empower me.\nHasten, hasten, swiftly, swiftly, as decreed by statute and law!\n\n**Seal-Forming Methods**\n*Heaven Seal*: Press the tips of both middle fingers against the middle joints of the index fingers.\n*Earth Seal*: Cross the feet in a ten-character stance.\n*Wood Seal*: Press the tips of both thumbs against the *Zhen* Palace, drawing qi from the East five times.\n*Fire Seal*: Press both thumbs against the *Li* Palace, drawing qi from the South three times.\n*Metal Seal*: Press the tips of both thumbs against the *Dui* Palace, drawing qi from the West twice.\n*Water Seal*: Press the tips of both thumbs against the *Kan* Palace, drawing qi from the North twice.\n*Earth Seal*: Press the tips of both thumbs against the *Central* Palace, drawing qi five times.\n\nAfter forming each seal with its corresponding posture, recite the incantation:\n*\"These are all the sacred assemblies.\"*\nWhen this verse is spoken and each method applied, there shall be no lack of efficacy.\n\n**Incantations of the Five Directions**\n*Wood Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya svāhā.*\n*Fire Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya svāhā.*\n*Metal Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya vāruṇa svāhā.*\n*Earth Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya bālā-balavīrya svāhā.*\n*Water Incantation*: *Namo samanta-buddhānāṃ, mahā-tathāgatāya hūṃ svāhā.*\n\nThe seals are to be carved from jujube wood, each two *cun* and two *fen* in size, using the *Dragon’s Startle* method.\n\n**Incantations Invoking the Five Directional Deities**\n*Wood Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the East!\n*Fire Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the South!\n*Water Command*: Command the Great Golden Summit, Wheel-King of Self-Mastery of the North!\n*Metal Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the West!\n*Earth Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the Center!\n\nShould a person of worthy wisdom receive and transmit this,\nOne of meager virtue shall bring calamity upon nine generations and themselves.",
      "overlap_context": "ace forty-nine willow twigs, seven lamps, seven incense burners, two zithers, one bow, two arrows, two sets of brush and inkstone, two new felt mats five *chi* in length, a bowl of white congee, five to seven seasonal fruits, and two bowls of purified water. Arrange all items in their proper positions, then invoke and welcome:\nThe Primordial Heavenly Worthy of True Origin, descending upon the light to take his seat,\nThe Great Emperor of the North Pole, descending upon the light to take his seat.",
      "start_char": 3949,
      "end_char": 4529,
      "start_sentence": 193,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.546311140060425,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "礼敬法 从正月初一日、一一月初二日、三月初三日、四月初四日、五月初五日、六月初六日、七月初七日、八月初八日、九月初九日、十月初十日、十一月十一日、十二月十二日。 右法，凡行持之士，须择净室，晨夕勤奉香火，如遇已上月日，皆宜祭祝。 虔心敬礼，周而复始，不可始勤终怠，务在精专，行之，无不怂矣。 其设坛铺陈，已迷椅前。 太上玄妙千金箓 凡用正，月一日及七日、三月三日、五月五日、七月七日、九月十五日、八节日，皆一般每遇祭时，先吃十二时符，便书粥符一道，烧灰，砚瓦中磨散，吹后书符。 此十二符，烧灰为九，每日早晨水服之。 如受法时，星像同，用净席一领。 如无扫净地上，一般用香、灯、茶酒各三盏，果子等随意，面北书符。 一都线符，二纳真符，三天甲符，四地甲符，五人甲符，六通目符，面北焚香，谨请太上元皇妙道真君、九天都仙仆射、九天使者、左青龙、右白虎、前朱雀、后玄武，愿祈匡济之恩，赐臣所求如意。 某清斋洁净，焚香浇酒，正立躬身，谨请北斗真君、紫微夫人、东王公、西王母、河伯、雨师、十二宫神、六甲都卿、直符使者，使臣如意，可堪受符。 又请东方青帝驾於青龙，南方赤帝驾於赤龙，西方白帝驾於白龙，北方黑帝驾於黑龙，中央黄帝驾於黄龙，五方五帝各降神虚之气，驾五龙各请就位，愿赴坛领纳，使臣如意。 上香再请东方青帝青龙，南方赤帝赤龙，西方白帝白龙，北方黑帝黑龙，中央黄帝黄龙，各当降神虚之气，入臣身中； 五星天象正气，入臣身中； 使臣魂魄万邪不入，诸恶不伤，神鬼吾使所昌者昌。 河伯使官、直符真官、乘法治官、十二神官、上下五甲、风伯、雨师，并降神虚之气，入臣身中，道德通灵，当暑无暑，当寒无寒，饥即得饱，危即得安，行符神验。 急急如律令摄。 再祝曰：",
      "translated_text": "**Rites of Reverence**\n\nThe days of veneration are as follows: the first day of the first month, the second day of the eleventh month, the third day of the third month, the fourth day of the fourth month, the fifth day of the fifth month, the sixth day of the sixth month, the seventh day of the seventh month, the eighth day of the eighth month, the ninth day of the ninth month, the tenth day of the tenth month, the eleventh day of the eleventh month, and the twelfth day of the twelfth month.\n\nFor those who practice this Dao, a purified chamber must be chosen, where morning and evening incense and offerings are diligently presented. On the aforementioned days of each month, rites of worship and invocation should be performed. With sincere devotion and reverence, the cycle is to be repeated without end. One must not begin with diligence only to grow lax later; steadfast focus is essential. By such practice, there shall be no failure.\n\nThe arrangement of the altar and its offerings has been described above.\n\n**The Supreme Mysterious and Wondrous Thousand-Gold Register**\nOn the following days— the first and seventh days of the first month, the third day of the third month, the fifth day of the fifth month, the seventh day of the seventh month, the fifteenth day of the ninth month, and the eight solar terms— the rites are conducted in the same manner. At each festival, one must first consume the Twelve-Hour Talisman, then inscribe a Congee Talisman, burn it to ash, grind it in an inkstone, and blow the residue before inscribing further talismans.\n\nThese twelve talismans are to be burned to nine portions of ash, taken each morning with water.\n\nWhen receiving the Dao, if the celestial signs align, a clean mat is to be used. If none is available, the ground must be swept clean. Offerings of incense, lamps, tea, and wine— each in sets of three— along with fruits as one desires, are to be prepared. Facing north, the talismans are inscribed as follows:\n\n1. The Unifying Thread Talisman\n2. The True Reception Talisman\n3. The Celestial Armor Talisman\n4. The Terrestrial Armor Talisman\n5. The Personal Armor Talisman\n6. The Perceptive Eye Talisman\n\nFacing north, incense is burned, and with reverence, the following are invoked:\nThe Supreme Primordial and Wondrous Dao Perfected Lord,\nThe Nine Heavens’ Divine Attendant of the Archery Terrace,\nThe Nine Heavens’ Envoys,\nThe Azure Dragon of the Left,\nThe White Tiger of the Right,\nThe Vermilion Bird of the Front,\nThe Dark Warrior of the Rear.\n\nMay they bestow their aid and grace, granting the petitioner’s wishes as desired.\n\nHaving purified oneself through fasting and ablutions, one burns incense, pours libations, stands upright, and bows deeply to invoke:\nThe True Lord of the Northern Dipper,\nThe Lady of the Purple Tenuity,\nThe Lord of the East,\nThe Queen Mother of the West,\nThe River Earl,\nThe Rain Master,\nThe Twelve Palace Deities,\nThe Six Jia Generals,\nThe Directing Talisman Envoys.\n\nMay they deem the petitioner worthy to receive the talismans, fulfilling all desires.\n\nFurther invocations are made:\nThe Azure Emperor of the East, riding the Azure Dragon;\nThe Vermilion Emperor of the South, riding the Vermilion Dragon;\nThe White Emperor of the West, riding the White Dragon;\nThe Black Emperor of the North, riding the Black Dragon;\nThe Yellow Emperor of the Center, riding the Yellow Dragon.\n\nMay the Five Emperors of the Five Directions each descend their numinous qi, riding their five dragons to their respective positions, and attend the altar to receive the offerings, granting the petitioner’s wishes.\n\nIncense is offered again, and the following are invoked:\nThe Azure Emperor of the East and the Azure Dragon,\nThe Vermilion Emperor of the South and the Vermilion Dragon,\nThe White Emperor of the West and the White Dragon,\nThe Black Emperor of the North and the Black Dragon,\nThe Yellow Emperor of the Center and the Yellow Dragon.\n\nMay each descend their numinous qi into the petitioner’s body.\nMay the upright qi of the Five Celestial Stars enter the petitioner’s body.\nMay the petitioner’s hun and po be shielded from all malevolent influences, all harm averted, and all spirits and demons be commanded to prosperity.\n\nThe River Earl’s Officials,\nThe Directing Talisman True Officials,\nThe Enforcers of the Dao,\nThe Twelve Divine Officials,\nThe Upper and Lower Five Jia,\nThe Wind Earl,\nThe Rain Master—\n\nMay they all descend their numinous qi into the petitioner’s body, harmonizing virtue and spirit. In heat, there shall be no heat; in cold, no cold. When hungry, one shall be sated; in peril, one shall find safety. The talismans’ divine efficacy shall be manifest.\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\nThe prayer is repeated:",
      "overlap_context": " command the Great Golden Summit, Wheel-King of Self-Mastery of the South!\n*Water Command*: Command the Great Golden Summit, Wheel-King of Self-Mastery of the North!\n*Metal Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the West!\n*Earth Command*: *Oṃ*, command the Great Golden Summit, Wheel-King of Self-Mastery of the Center!\n\nShould a person of worthy wisdom receive and transmit this,\nOne of meager virtue shall bring calamity upon nine generations and themselves.",
      "start_char": 4530,
      "end_char": 5253,
      "start_sentence": 227,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.788583517074585,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "谨告诸神，酒礼微薄，不堪供献，愿赐宥之，各将本部神，愿纳之。 再拜，讫取酒自饮，余者送东流水中，取都箓符、三甲符吞之。 后将纳真符，青袋盛之，於头髻中带之。 通目符烧灰，调水澄清，洗眼，即得见土神说话耳。 闻鬼神言语，长在人身。 祭后，当送之。 都录符第一 凡用符，先一日朱书符，作九子吞之。 祭法，正月七日、三月三日、五月五日、七月七日、八月十五日、九月九日，夜静星象全书符，烧香念咒曰： 天罡游历，日月星都，符焚气伏，九精度君勑，众符但但但成，营卫臣身，常为资帛。 急急如律令摄。 纳真符 北斗下书此符，凡书符，先念咒毕，朱书符，称名於年月日时，咒曰： 轩辕夫人，性好洁净，希於妙道，谨行天符，摄神收鬼，天神佑我，地神载我，日月照我，天神护我，河伯度我，众邪伏我，真神卫我。 急急如律令摄。 通目符第三",
      "translated_text": "With reverence, we address the multitude of spirits: the wine and offerings are humble and meager, unworthy of presentation. We pray for your indulgence and that each of you, with your respective divine retinues, deign to accept them.\n\nHaving bowed twice, the petitioner drinks the wine, and the remainder is cast into the east-flowing waters. The *General Register Talisman* and the *Three Jia Talismans* are then swallowed. Thereafter, the *True Receiving Talisman* is placed in a blue pouch and worn within the topknot of the hair.\n\nThe *All-Seeing Talisman* is burned to ash, mixed with water, and allowed to settle. The eyes are washed with the clear liquid, enabling one to see and converse with earth spirits and hear the speech of ghosts and gods, ever abiding within the body.\n\nAfter the rites, the spirits must be sent forth.\n\n**General Register Talisman (First)**\nFor all talismans, on the day prior to use, write the talisman in cinnabar and swallow its nine segments. The ritual is performed on the seventh day of the first month, the third day of the third month, the fifth day of the fifth month, the seventh day of the seventh month, the fifteenth day of the eighth month, and the ninth day of the ninth month. At night, when the stars are clear, write the talisman, burn incense, and recite the incantation:\n\n*\"The Celestial Pivot roams and traverses,\nSun, moon, and stars assemble.\nThe talisman burns, qi submits,\nThe Nine Essences transmit the Sovereign’s decree.\nAll talismans, swiftly, swiftly, swiftly take form,\nGuarding and shielding this petitioner’s body,\nEver as treasure and silk.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\n**True Receiving Talisman**\nWrite this talisman beneath the Northern Dipper. For all talismans, first recite the incantation, then write the talisman in cinnabar, invoking the name at the year, month, day, and hour. The incantation reads:\n\n*\"Lady Xuan Yuan, by nature fond of purity,\nYearns for the wondrous Dao.\nShe reverently enacts the celestial talismans,\nCommanding spirits and subduing ghosts.\nHeavenly spirits protect me,\nEarthly spirits bear me,\nSun and moon illuminate me,\nCelestial spirits guard me,\nThe River Earl ferries me,\nAll malevolence submits to me,\nTrue spirits shield me.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\n**All-Seeing Talisman (Third)**",
      "overlap_context": "alisman True Officials,\nThe Enforcers of the Dao,\nThe Twelve Divine Officials,\nThe Upper and Lower Five Jia,\nThe Wind Earl,\nThe Rain Master—\n\nMay they all descend their numinous qi into the petitioner’s body, harmonizing virtue and spirit. In heat, there shall be no heat; in cold, no cold. When hungry, one shall be sated; in peril, one shall find safety. The talismans’ divine efficacy shall be manifest.\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\nThe prayer is repeated:",
      "start_char": 5253,
      "end_char": 5615,
      "start_sentence": 246,
      "end_sentence": 261,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.970050573348999,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "青袋盛之，於髻上带之。 此符遇八节日书之，通耳目，与鬼神语话。 朱书，烧灰淋水，洗眼，饮之。 即时，与鬼神说话。 此符，请神后烧。 如书此符，先焚香念咒曰： 日是我父，月是我母，五星是我兄，吾令摄伏诸鬼神。 急急如律令。 天甲符第四 天甲符，姓清，字文公，知天上星辰变运往复度数，能投星月，使人见形。 如人身家天蛇形，如龙脚如牛，四足着履，此神令人多喜。 要见神，於诤室中，香果酒脯，子时书符於白素上，广五寸书符，青袋盛之，於髻之中。 先念咒曰： 阴阳和合，万事皆从。 行符使者，逐我西东。 急急如律令。 地甲符第五 地甲符者，天下伏尸，埋藏财宝物及坟墓，并皆知之。 此神姓浊，字武公，形如女子身，着布衣露头，乘青龙，初见人多喜。 此符朱书，喝三声，其神即至。 咒曰： 温温阳阳，地柔天刚。 吾当问请，吉凶审详。 急急如太上律令。 人甲符第六 人甲符，姓金，名化，形如女人，赤青半阳，身着赤衣，乘亦马，面如人，伏纵二人各执牟梨，面白一目，无鼻，能知人家奴婢逃亡甚处； 又如父子相离多年。 如问事，便知去处。",
      "translated_text": "Place it in a blue pouch and wear it atop your hair knot. Write this talisman on the eight solar terms; it sharpens hearing and sight, allowing speech with ghosts and spirits. Write in cinnabar, burn to ash, steep in water, wash the eyes, and drink. Instantly, you may converse with ghosts and spirits. Burn this talisman after invoking the spirit. When inscribing it, first burn incense and recite the incantation:\n\n*\"The sun is my father,\nThe moon is my mother,\nThe Five Stars are my brothers.\nI command the subjugation of all ghosts and spirits.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\"*\n\n**Celestial Armor Talisman (Fourth)**\nThe Celestial Armor Talisman bears the surname Qing and the style name Wengong. It knows the celestial cycles of stars, their movements, and their returning measures, and can dispatch stars and the moon to manifest forms before people. When a person’s body resembles the Celestial Serpent, with dragon’s feet like those of an ox, four-footed and shod, this spirit brings much joy. To summon the spirit, prepare a secluded chamber with incense, fruit, wine, and dried meat. At the hour of *zi*, inscribe the talisman on white silk, five *cun* in width, place it in a blue pouch, and wear it in your hair knot. First recite the incantation:\n\n*\"Yin and yang harmonize,\nAll affairs follow.\nMessenger of the talisman,\nPursue me east and west.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\"*\n\n**Terrestrial Armor Talisman (Fifth)**\nThe Terrestrial Armor Talisman knows all hidden corpses, buried treasures, and tombs beneath heaven. This spirit bears the surname Zhuo and the style name Wugong. Its form resembles a woman’s body, clad in cloth robes with unbound hair, riding a green dragon. Upon first sight, it brings much joy. Write this talisman in cinnabar, shout thrice, and the spirit will arrive immediately. The incantation reads:\n\n*\"Gentle and warm, firm and yielding,\nEarth is soft, heaven is hard.\nI now inquire,\nFortune and misfortune clearly discerned.\nSwiftly, swiftly, in accordance with the Most High’s statutes and ordinances!\"*\n\n**Human Armor Talisman (Sixth)**\nThe Human Armor Talisman bears the surname Jin and the given name Hua. Its form resembles a woman, half red and half blue, clad in red robes, riding a red horse. Its face is human-like, with two attendants wielding *mouli* blades, one white-faced and one-eyed, without a nose. It knows where a household’s servants or maidservants have fled, and can reveal the whereabouts of fathers and sons separated for many years. When questioned, it instantly knows their location.",
      "overlap_context": "onth, day, and hour. The incantation reads:\n\n*\"Lady Xuan Yuan, by nature fond of purity,\nYearns for the wondrous Dao.\nShe reverently enacts the celestial talismans,\nCommanding spirits and subduing ghosts.\nHeavenly spirits protect me,\nEarthly spirits bear me,\nSun and moon illuminate me,\nCelestial spirits guard me,\nThe River Earl ferries me,\nAll malevolence submits to me,\nTrue spirits shield me.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\n**All-Seeing Talisman (Third)**",
      "start_char": 5615,
      "end_char": 6070,
      "start_sentence": 262,
      "end_sentence": 289,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.9572434425354,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "朱书此符，於头髻中带，思念神名，须臾悉至。 初祭此符，用酒脯，已后不用。 伍符是行病符第七 此符是北斗之君使者，常巡察世闲。 有咒诅为恶逆者，与其病人喊算除年。 但人家卒息疮尰、眼盲一切病患，并是此神治。 如梦安乐，以香茶饼祭之，使诸鬼神不敢行，病即得安乐。 此神形如女子，着黑衣，曲腰持梨，乘驴。 姓专，名恶吉。 又一名，恶保。 此符朱书，放息人头边，立愈。 如病人再发，用墨书之，安电中其人名字，於符下火烧，亦不发。 咒曰：, 北君使者，当来乘神驴来临病者，释放病者之罪。 急急如律令。 帝策符第八 帝策符，常使之。",
      "translated_text": "Inscribe this talisman in cinnabar and wear it within your topknot; focus upon the spirit’s name, and in an instant they will arrive in full. For the first offering to this talisman, use wine and dried meat; thereafter, no further offerings are required.\n\n**Fifth Talisman: The Wandering Sickness Talisman (Seventh)**\nThis talisman is the emissary of the Lord of the Northern Dipper, ever patrolling and inspecting the world. When curses or malevolent acts are committed, it inflicts sickness upon the offender, deducting years from their lifespan. All sudden afflictions—festering sores, blindness, and every manner of ailment—are governed by this spirit. If one dreams of peace and comfort, offer incense, tea, and cakes to it, and no ghost or spirit will dare to act; the illness will then yield to tranquility.\n\nThis spirit takes the form of a woman clad in black robes, bent at the waist and holding a *li* blade, riding a donkey. Its surname is Zhuan, and its given name is Eji. It is also called Ebao. Inscribe this talisman in cinnabar and place it beside the head of the afflicted; they will recover at once. If the illness recurs, write the talisman in ink, inscribe the person’s name beneath it, and burn it in a brazier—it will not return.\n\nThe incantation reads:\n*\"Emissary of the Northern Lord,\nCome swiftly riding your spirit donkey,\nRelease the sins of the afflicted.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\"*\n\n**Imperial Tally Talisman (Eighth)**\nThe Imperial Tally Talisman is ever at one’s command.",
      "overlap_context": "uman Armor Talisman (Sixth)**\nThe Human Armor Talisman bears the surname Jin and the given name Hua. Its form resembles a woman, half red and half blue, clad in red robes, riding a red horse. Its face is human-like, with two attendants wielding *mouli* blades, one white-faced and one-eyed, without a nose. It knows where a household’s servants or maidservants have fled, and can reveal the whereabouts of fathers and sons separated for many years. When questioned, it instantly knows their location.",
      "start_char": 6070,
      "end_char": 6329,
      "start_sentence": 290,
      "end_sentence": 306,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.167013168334961,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "其神姓刘，名可思一树名常飞行，能知人间祸福，吉凶玄妙之事。 身着天衣，冠华冠，乘云行，能知风雨、岁丰、时分。 朱书此符，青袋盛之，胸前衣襟中。 自后但有思念，神符即至，便如亲目见问，其神言道其吉凶。 咒曰： 日是我父，月是我母，明星是我兄，太乙是朋友。 急急如律令。 此是九天使者，好人长生能学者。 先书都录符、通目符、三甲符，然后可书此符，为人所求之事，自然成。 上士克果，上仙飞腾。 中士成之，得为地仙。 下士修之，得为地官、禄位之职品。 旷野符 右人家忘失坟冢。",
      "translated_text": "The spirit’s surname is Liu, its given name Kesi, and its sobriquet Yishu or Changfeixing. It can discern the fortunes and misfortunes of the human realm, as well as matters of good and ill omen in their profound subtlety. Clad in celestial robes and crowned with a floral coronet, it rides the clouds and knows the winds and rains, the harvest’s bounty, and the turning of the seasons. Inscribe this talisman in cinnabar, place it in a blue pouch, and wear it over the chest beneath one’s garments. Thereafter, whenever one calls upon it in thought, the spirit-talisman will appear as if seen with one’s own eyes, and the spirit will speak of the auspices or inauspices at hand.\n\nThe incantation reads:\n*\"The sun is my father,\nThe moon is my",
      "overlap_context": " and place it beside the head of the afflicted; they will recover at once. If the illness recurs, write the talisman in ink, inscribe the person’s name beneath it, and burn it in a brazier—it will not return.\n\nThe incantation reads:\n*\"Emissary of the Northern Lord,\nCome swiftly riding your spirit donkey,\nRelease the sins of the afflicted.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\"*\n\n**Imperial Tally Talisman (Eighth)**\nThe Imperial Tally Talisman is ever at one’s command.",
      "start_char": 6329,
      "end_char": 6562,
      "start_sentence": 307,
      "end_sentence": 320,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.9945290088653564,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "朱书此符，亡人名姓符下，闭目念咒曰： 幽幽杳杳，吾符诀。 急急如律令。 咒毕开眼，其鬼即至。 问坟冢何处，其鬼自道。 此是招神符，又名勘合符。 此符并是华山洞内石壁刻之上，令人书之，志心谨慎，主收一切鬼神。 朱书。 如到人家问事家亲，并门神，并鳌神，悉来前，立道其吉凶，皆知姓名、住处、根因。 太上赤文洞神三箓竟",
      "translated_text": "Inscribe this talisman in cinnabar, writing the name of the deceased beneath it. Close your eyes and recite the incantation:\n\n*\"Vast and boundless,\nThis is my talisman’s seal.\nHasten, hasten, as the statutes command.\"*\n\nUpon opening your eyes after the incantation, the ghost will arrive. When asked where the grave lies, the ghost will reveal its location.\n\nThis is the Spirit-Summoning Talisman, also called the Verification Talisman. These talismans were all inscribed upon the stone walls within the Hua Mountain grotto, and those who copy them must do so with utmost sincerity and care, for they command all ghosts and spirits.\n\nInscribe it in cinnabar. When taken to a household to inquire about matters concerning their kin, even the door spirits and the Ao deities will all come forth, standing before you to declare the auspices or inauspices, and they will disclose their names, dwelling places, and origins.\n\nHere ends the *Three Registers of the Cavern Spirits in Vermilion Script of the Most High*.",
      "overlap_context": "obes and crowned with a floral coronet, it rides the clouds and knows the winds and rains, the harvest’s bounty, and the turning of the seasons. Inscribe this talisman in cinnabar, place it in a blue pouch, and wear it over the chest beneath one’s garments. Thereafter, whenever one calls upon it in thought, the spirit-talisman will appear as if seen with one’s own eyes, and the spirit will speak of the auspices or inauspices at hand.\n\nThe incantation reads:\n*\"The sun is my father,\nThe moon is my",
      "start_char": 6562,
      "end_char": 6722,
      "start_sentence": 321,
      "end_sentence": 330,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.2039642333984375,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\太上赤文洞神三箓.txt",
        "category": "众术类"
      }
    }
  ]
}