{
  "source_id": "太上洞玄灵宝净供妙经",
  "source_file": "chunked_daozang\\太上洞玄灵宝净供妙经.json",
  "total_chunks": 4,
  "total_original_chars": 4147,
  "total_translated_chars": 21814,
  "total_translation_time": 106.73773074150085,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝净供妙经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Supreme Cavern Mystery Numinous Treasure Scripture of Wondrous Pure Offerings*\n\n**Scripture Title:** *The Supreme Cavern Mystery Numinous Treasure Scripture of Wondrous Pure Offerings*. Author unknown, approximately composed during the Sui-Tang period. Contemporaneous with *The Scripture of the Great Offering of the Mysterious Capital*. One fascicle. Base text from *The Orthodox Daoist Canon*, Cavern Mystery Division, Original Texts Category.\n\n---\n\nAt that time, the Left Immortal Duke of the Supreme Ultimate was atop the loftiest peak of Mount Ruoye, the utmost cloud-capped summit of its towering heights. There, in concentrated meditation and stillness, he forever stilled the six dusts, inwardly emptied and unadorned, his body and mind unmoving, without straying thoughts. Within seven days, he attained quiescent samādhi.\n\nOn the following day at noon, he suddenly heard from above the chaotic ringing of bells and drums, and amidst the floating clouds, celestial grand music arose. In an instant, the heavens rained fragrant flowers—some large, some small—each with a hundred petals, their expanse vast and round, some like chariot wheels, varying in size, their colors and forms ever-changing. Some were azure, some yellow, some vermilion, some purple, some transformed into the seven treasures, displaying manifold marvels, rare and wondrous. These celestial flowers cannot be fully described. There were also various incenses—powdered incense, pearl incense, hundred-fold blended incense, seven-treasure incense, and the like—all rising to the heavens, their fragrance rich and pervasive, filling the mountains and forests.\n\nAt that time, amidst the clouds appeared five-colored flying clouds, and eight luminous chariots, bearing thirty thousand divine immortals and their retinues. These immortals were all wise and discerning, eloquent and accomplished in the six penetrations, their virtues inconceivable. Within the three chariots were Perfected Ones, their necks bearing circular aureoles of five colors, illuminating the empty sky. They wore jeweled crowns upon their heads, their robes of cloud-brocade adorned with golden filigree, their pearls bright as the moon, serving as pendants and garlands. Possessing the thirty-two marks and eighty excellences, their radiance shone purely and clearly, each seated upon a chariot before him.\n\nThe Perfected One of the first jeweled chariot declared his name: \"I am Yuluoqiao.\"\nThe Perfected One of the second jade chariot declared his name: \"I am Guangmiaoyin.\"\nThe Perfected One of the third green chariot declared his name: \"I am Zhendinguang.\"\n\nThe three Perfected Ones spoke in unison, praising: \"Excellent! Excellent! Good man, through immeasurable and boundless kalpas, you have cultivated great diligence, ever practicing forbearance, and extending a heart of compassion. Today, without relying on external matters, your body and mind remain unmoving, attaining the mind of no-self. Having no mind of self, you also have no mind of others; having no mind of others, you also have no mind of distinction. Having no mind of distinction, you attain the mind of equality. Good man, upon this mountain, you have attained this mind of non-mind, accomplishing the Dao-fruit, inconceivable. We have now, by the command of the Heavenly Worthy, heard of your merit and virtue filling the world, resonating with the heavens above. Thus, we have come here with our retinues to bear witness to your true practice and to perfect your Dao, enabling future beings to gain knowledge, enter the city of Dharma, and attain the formless Dharma. For this reason, we have descended.\"\n\nThereupon, the Immortal Duke rose from his seat, prostrating himself upon the ground. After listening to the words of the Perfected One Yuluoqiao, he remained thus for a long while before rising. Making obeisance, he inquired: \"How is it that the great Perfected Ones possess such luminous forms, and why do fragrant flowers rain down in manifold transformations, displaying such auspicious signs? I do not yet understand the cause and condition of this day, nor the reason for your gracious condescension to bestow such favor. I earnestly wish that the great Perfected Ones will enlighten me, allowing me to awaken and clearly comprehend these causes and conditions, so that the ignorant and blind may be roused to understand all conditions and ultimately accomplish the supreme Dao-fruit.\"\n\nThen, the first Perfected One, Yuluoqiao, spoke: \"Excellent! Excellent! Good man, what are your past vows, and how do you contemplate them?\"\nThe Immortal Duke replied: \"Truly, I have sealed them in my mouth and dare not speak lightly.\"\nThe great Perfected One said: \"We have come now to fulfill your vow, desiring that in the future you will raise the great bridge of Dharma, construct the great vessel of salvation, open the great causes and conditions, and propagate great merit and virtue. For this reason, we have descended here.\"\n\nThe Immortal Duke again rose and made obeisance, addressing them further: \"Great Perfected Ones and Masters, awaken this ignorant one. I have questions to ask but dare not presume to inquire. I only wish that the great Perfected Ones will heed my humble words.\"\nThe Perfected One replied: \"Excellent! Excellent! Ask whatever you wish.\"\nThe Immortal Duke said: \"On the seventh day of the seventh month, in a single thought, I beheld the ten directions, where in all the hells, the dark souls and hungry ghosts were swallowing fire and eating coals, treading upon knife mountains, their heads and hands severed. Some were immersed in cauldrons of boiling water, their five limbs rotting away, no longer retaining their ghostly forms. The sufferings and pains were inconceivable, and the torments of the Dharma-realm could not be greater. Yet in a single thought, I witnessed such suffering, and unconsciously, my body’s hundred joints and pores all bled, as if dismembered. Such were my past contemplations, just as I have now spoken. I do not yet understand what merit and virtue the great Perfected Ones possess that can save all these dark souls, freeing them from afflictions, satiating their hunger, and granting them liberation.\"\n\nThereupon, the Perfected One, having heard these words, snapped his fingers and exclaimed joyfully: \"Excellent! Excellent! Good man, to speak thus is truly inconceivable. Now, I will tell you—listen carefully, and I shall explain it to you.\"\n\nThe Great Perfected One then declared: \"The three Yuan auspicious days and the five La festivals together are called the Eight Days. On these days, one should go to the dark altar’s pure abode, invite Daoist priests, and perform the Dao through the night. Offer fragrant oil, prepare various sweet fruits, and pile them into mountains—whether large or small, or arranged in trays—adorning them in manifold ways to present as offerings to the Heavenly Worthy. Through this compassion, grace extends to the ten directions, and the immeasurable, boundless prisoners of hell and hungry ghosts all attain liberation.\n\nThose who commit grave offenses—slandering the Great Dao, defaming the scriptures, or violating the pure precepts and Daoist priests—are guilty of heavy sins. Likewise, killing one’s father or mother, assaulting one’s master or lord, or plotting treason against the ruler are also grave sins. If one commits such sins, the offerings may grant temporary liberation. For those with lighter offenses, through these offerings and the night-long performance of the Dao, they attain permanent liberation and immediate satiation.\n\nGood man, the merit of diligently establishing such blessings ensures that in future lives, compassionate Daoist priests and filial children will make offerings to their ancestors—whether departed parents, sisters, brothers, or other kin—all of whom will be liberated and satiated, free from hunger. If one does not make offerings on these Eight Days to one’s ancestors, it is an act of unfilial piety.\n\nI exhort all future generations to diligently prepare pure offerings. Not only will ghosts and spirits attain liberation, but those in this life will see their wealth and treasures increase, untouched by harm from their seven generations of ancestors. Not only will the seven generations of ancestors be unable to cause harm, but no ghosts, demons, or malevolent spirits will be able to inflict injury. Why is this so?\n\nWorldly commoners, in their ignorance, may seek out ghosts and demons or make offerings to their ancestors, but if they do not adhere to the Eight Days, their offerings will mislead the ancestors and incur further sin. Why? If offerings are made outside the Eight Days, the souls of the departed will remain hungry, and in their hunger, they will turn to harm, summoning external demons to join in malevolence. If offerings are made properly on the Eight Days, the departed will rejoice, refrain from causing harm, and no demons or malevolent spirits will be able to inflict injury. Such is the principle.\n\nThe Immortal Lord then said: \"Excellent! The Heavenly Perfected One’s words on pure offerings are vast and profound. You mentioned the Eight Days but did not clarify what they are. Pray, elucidate their distinctions.\"\n\nThe Perfected One replied: \"The Eight Days are as follows: the fifteenth day of the first, seventh, and tenth months are called the Three Yuan Days. Additionally, the first day of the first month is the Heavenly La; the fifth day of the fifth month is the Earthly La; the seventh day of the seventh month is the Dao and Virtue La; the first day of the tenth month is the People’s Year La; and the La day in the twelfth month is the Kings and Lords La. Together, these are called the Eight Days. If offerings are made outside these days, the karmic retribution of sin and blessing will not be realized, as previously explained.\n\nGood man, hold these words firmly in your heart. What I have spoken is the ordinance of the Three Upper Heavens, inscribed in purple script and golden characters as the eternal rites of heaven and earth—unfathomable and beyond conception. How could one not revere and diligently practice them?\"\n\nThe Second Perfected One, Radiant and Wondrous Sound, then addressed the Immortal Lord: \"Excellent! Excellent, good man! The merit is immense, beyond all measure. By the command of the Heavenly Worthy, I and the divine immortals and their retinues have descended upon you. Why? Because it is inconceivable, because it is without attainment.\"\n\n\"Good man, what was previously spoken is called the Eight Days—unfathomable, named the Eight Liberations. At the *mao* hour on these days, arrange the seats of the Six Paths, prepare pure fragrant water, garments, and all external requisites, as well as fine delicacies and food, setting them out in order. The Daoist, within the oratory, at dawn presents a memorial for bathing. At noon, perform the circumambulation and repentance rites, so that the ancestral spirits of the patrons’ households, those who have passed away, may all attain liberation and purity on this day.\"\n\nThe Immortal Lord said: \"Excellent! The Great Perfected One opens the gate of liberation for all beings, descending here for no attainment.\"\n\n\"I do not yet understand—what are these Six Paths you speak of? Pray, expound upon them fully.\"\n\nThe Perfected One said: \"The first is the Heavenly Path, the second the Human Path, the third the Animal Path, the fourth the Spirit Path, the fifth the Ghost Path, and the sixth the Hell Path. These are called the Six Paths. Good man, hold these words firmly in your heart. How could one not revere and follow them?\"\n\nThen the Third Perfected One, True Radiance of Concentration, spoke: \"Excellent! Excellent, good man! The two Great Perfected Ones have fully expounded the Eight Days, their merit and sequence, their principles vast and clear. Now, I shall speak last of the great causal conditions, for I wish to tell you—would you hear them?\"\n\nThe Immortal Lord rose and bowed, saying: \"Your boundless compassion does not forsake this ordinary being. Today, my joy is beyond words. I only pray the Great Perfected One illumines my ignorance—how could I trouble you with further entreaties?\"\n\nThe Perfected One replied: \"We act by the command of the Heavenly Worthy, truly to perfect what was long ago established. How could your heart not speak of it? If it were not spoken, one would fall into ignorance and sever the seed of the true Dao. Moreover, in past kalpas, you cultivated merit to accomplish this—how could it not be spoken?\n\n\"Good man, the causal conditions of offering and merit previously mentioned have two aspects. What are these two? The first is offering while abiding in form, which is called finite. The second is offering without abiding in form, which is called pure offering, called infinite. Why? It is like the waters of rivers and seas, revolving without end. Thus, this scripture clarifies the meaning of the infinite, and it is likewise so. And like empty space, boundless and immeasurable—thus do I now clarify the meaning of the infinite. If the waters of rivers and seas were to revolve and exhaust, then the meaning of the infinite I now expound would also be exhausted. If empty space and rivers and seas are ultimately unknowable in their bounds, then the meaning of the infinite is likewise so.\n\n\"Good man, you must also understand the meaning of the finite, discerning it clearly. The finite is like one who recites scriptural verses—one line, two gāthās, from three to four, even up to hundreds of thousands of millions of verses—yet this is not considered much. Why? If one expounds them to others, within a few years they are exhausted. Thus do I now clarify the meaning of the finite. It is also like one who attains the position of a great king, enjoying wealth and nobility for generations, with gold, silver, lapis lazuli, coral, amber, and vajra, all manner of treasures filling a city—yet this is not considered much. Why? If used for almsgiving, within a fortnight they are exhausted. Thus do I now clarify the meaning of the finite. If one recites scriptures endlessly with the mouth and gives treasures ceaselessly with the hand, then know that what I now speak of—offering while abiding in form—is called finite. Why? All limited things, when given, diminish with each day, while limitless things cannot be exhausted even by kalpas. Thus, the meaning of the finite I now expound is ultimately thus.\n\n\"Good man, the principle is entirely so. Not only is the merit of this offering thus, but all fasts—even a single night’s assembly—are likewise. How could one not diligently practice? If one can constantly rouse the mind, practice without abiding in form, and truly know the meaning of the infinite, then you will certainly attain the supreme Dao. Why? Because there is no self-body, no self-mind. Since there is no self-body, there is no self-mind. Since there is no self-mind, there is no other-mind. Since there is no other-mind, all minds are extinguished—this is called purity. One attains the samādhi of no-mind, the samādhi of no-self.\n\n\"Good man, I now decisively clarify these words. If there is a self-mind that ceases another’s mind, then the self-mind is not extinguished—this is called attaining the no-self of body and mind, but not yet the no-self of the realm of beings. If one seeks the no-self of the Dharma-realm, one must know that originally there was none, and now there is none. Knowing that originally there was none and now there is none, one knows there is also no Dharma-realm. Since there is no Dharma-realm, there is no arising and no ceasing. Since there is no arising and no ceasing, then know that there is also no non-arising and no non-ceasing. What is meant by no arising and no ceasing? It is for the sake of expounding the Dharma. Thus it is said: no arising, no ceasing. Attaining this principle is called making a pure offering, called attaining the no-self of the Dharma-realm, called attaining the purity of the Dharma-realm.\n\n\"Good man, what I now speak last was all practiced by the Heavenly Worthies, Perfected Ones, Immortals, and Sages of ancient times, boundless and immeasurable, and by the mighty ghost-kings of the ten directions, who thereby attained the supreme Dao. Though you are not yet enrolled among them, your title is Left Immortal Lord of the Supreme Ultimate. The great rank of Immortal—how could you not practice it? You will certainly ascend to the rank of Perfected One, attain the six penetrations, and accomplish the supreme Dao.\"\n\nThereupon, the Immortal Lord rose from his seat, bowed, and gave thanks, saying: \"Today, I have suddenly encountered the Great Perfected One and been granted these words—truly this is rare. From kalpas without measure, I have cultivated merit and encountered immortals who have always expounded to me the lesser vehicle, the lesser wisdom, and the methods of nurturing life.\"\n\nNever before have I heard such subtle and wondrous teachings as those now expounded by the Great Perfected One—boundless and immeasurable, beyond all thought and conception. My karmic obstructions, long accumulated like layers of frozen ice, have at this moment met the fire of your wisdom and dissolved without a trace, leaving no residue behind. My present liberation is just so.\n\nIt is like the parable of the man who sold his child: father, mother, and siblings wept in grief beyond measure, yet in but a moment, gold and silver filled their treasuries to overflowing, and the child was returned to them, their joy beyond all bounds. My joy today is just so.\n\nOr again, like the tale of the king’s daughter named Guayin, who suffered the sixfold afflictions and could not speak. Cast into the deep mountains, starving and exhausted, her life nearly spent, she was visited by a Perfected One who descended to her aid. At once her illness was cured, her speech restored, and she was filled with nourishment—her joy beyond all bounds. My joy today is just so.\n\nI only pray, Great Perfected One, that you command the spirit-chariots to linger a while in these woods and groves, and not ascend too soon.\n\nThe Great Perfected One replied: “We shall depart now, but shall return before long.”\n\nWith these parting words, the three celestial carriages rose in order, accompanied by immortal musicians and attendants, soaring into the clouds until they vanished from sight. In an instant, they were nowhere to be seen.\n\nThe Immortal Lord reverently received and practiced the teachings. On the fifteenth day, he diligently prepared a pure offering, observing all the proper rites and decorum. He constructed a Great Fruit Mountain, eighteen feet high, adorned with rare and wondrous ornaments. All manner of sweet fruits filled the mountain and its forests, and abundant rice was also prepared.\n\nAt noon that day, beings from the ten directions—from the hells and the six paths of existence, each with their distinct forms—gathered in numberless multitudes. Among these spirits was a great king named Dawei, who stepped forward with the assembled ghosts, bowed in unison, and praised in one voice: “Excellent! Excellent!”\n\nKing Dawei declared: “O pure-land Daoist, you have opened the gate of liberation for us all. Today, whether kin or not, countless spirits have gathered here, and all have been purified and set free. Were it not for your pure precepts and compassion, how could you have prepared such a pure offering for us and our kin? We pray that you, Dharma Master, swiftly attain the rank of Great Immortal and realize the supreme Dao.”\n\nAll the gods, humans, animals, spirits, ghosts, and suffering souls of the hells echoed these words. When they had spoken, they bathed in fragrant waters, donned splendid robes, took their seats in order, and partook of the feast in full.\n\nWhen the noon offering was complete, King Dawei and his kin took leave of the Immortal Lord, saying: “Dharma Master, excellent! Excellent! Beyond all thought and conception! Through your compassion, countless souls have found liberation.” With these words, they bowed and departed.\n\nThe Immortal Lord then addressed the assembled good men and women: “From kalpas without measure until this day, I have at last received these essential teachings from the Great Perfected One—beyond all thought and conception. Though I previously received from the Great Perfected One the scripture for making offerings, its discourse was brief and did not expound the causes and conditions as profoundly as these teachings now revealed. There is also a scripture called *The Great Offering*, which speaks only of the Three Primes and does not clarify the Eight Days, nor does it expound such vast and boundless merit—beyond all thought and conception.\n\nGood men and women, how could you not revere and uphold this scripture? Those who honor and practice it are called filial children, repaying the kindness of their parents who gave them life. And not only their birth parents, but also their true parents in the Dao. Having repaid their true parents, they gradually ascend the ranks of the Dao’s fruition.\n\nBut those who slander or disbelieve, who fail to offer sustenance to their ancestors, are called unfilial and have turned against their true parents. Why? To withhold offerings from one’s ancestors is to leave their spirits hungry—this is unfilial. Having acted unfilially and slandered the teachings, they mislead their ancestors. Their departed parents suffer myriad torments, while in this present life, their bodies are harmed by demonic forces, plagued by wind and leprosy, and afflicted with all manner of pain. Let future generations of men and women take heed.\n\nHere ends *The Marvelous Scripture of Pure Offerings from the Cavernous Mystery of the Numinous Treasure of the Most High*.”",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝净供妙经 经名：太上洞玄灵宝净供妙经。 撰人不详，约出於隋唐。 与《玄都大献经》同时。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝净供妙经 尔时，太极左仙公於若耶山崇高之顶最极云峰，精思静处，永息六尘，内虚冲素，身心不动，亦不缘驰，是七日中而得寂定。 来日午时，忽闻上方钟鼓乱鸣，浮云之际，作天大乐。 俄顷之间，天雨香花，乃及大花，或复小花，花皆百叶，纵广圆大，有如车轮，大小不定，色相无常。 或青，或黄，或朱，或紫，或成七宝，种种变异，殊妙希有。 是诸天花，非可具显。 复有诸香、末香、珠香、百和之香、七宝香等，如是诸香，香皆冲天，其气芯芬，亘满山林。 尔时云中复有五色飞云，八景辈舆，神仙眷属三万人俱。 是诸仙等，皆善智慧，明了辩才，六通成就，不可思议。 见三舆内并有真人，项负圆光，光皆五色，晃曜虚空，首冠宝冠，衣皆云锦，金镂庄严，珠皆明月，用为缨络。 三十二相，八十种好，显照净明，各乘辇舆而住於前。 第一宝舆真人，自称名曰我郁罗翘。 第二玉舆真人，自称名曰我光妙音。 第三绿舆真人，自称名日我真定光。 三真同声赞言：善哉善哉。 善男子，汝於无量无边之劫，建大精进，常行忍辱，运慈悲心，得於今日，不缘他事，身心不动，得无我心。 既无我心，亦无他心，既无他心，亦无别心。 既无别心，得平等心。 善男子，汝於此山得无是心，成就道果，不可思议。 我等今者，奉天尊言，闻子功德，满於世界，上应诸天，令我来此，与诸眷属，证明实行，成就子道。 使诸来生，得有所知； 使诸来生，得入法城； 使诸来生，得无相法。 以是因缘，故来而降。 是时，仙公即从座起，头面着地，听真人郁罗翘说言已毕，良久乃起，作礼而言：云何大真，光相如是，复雨香花，种种变异，瑞相如此。 不审今日，是何因缘，以何义故，曲垂恩逮，乃至如是。 特愿大真示我，令悟决了因缘。 当令愚瞽，觉晓诸缘，必竟成就无上道果。 尔时，第一真人郁罗翘言：善哉善哉，善男子。 汝昔所愿，为念云何。 仙公曰：实缄在口，未敢便言。 大真曰：我今来者，成就子愿，欲使将来，兴大法桥，作大舟橄，开大因缘，弘大功德。 以是义故，而降此也。 仙公复起作礼，而重白言：真人大师，悟我愚蒙，欲有所问，未敢谘请。 唯愿大真，采我鄙言。 真人曰：大善大善，随汝所问。 仙公曰：我已今七月七日，於一念中，观见十方，是诸地狱，幽魂饿鬼，吞火食炭，履陟刀山，头手异处。 或身入镬汤，五体烂坏，无复鬼形，诸苦诸痛，不可思议。 法界中苦，实不能加，而我一念，见如是苦，不觉身体百节毛孔，并皆流血，有如支解。 是昔所念，具如今言。 不审大真，作何功德，能救如是一切幽魂，得无烦恼，具诸饱满，而得解脱。 尔时，真人得斯语已，弹指欢言：善哉善哉，善男子，作如是言，实不可思议。 吾今告子，谛而听之，当为汝说是。",
      "translated_text": "*The Supreme Cavern Mystery Numinous Treasure Scripture of Wondrous Pure Offerings*\n\n**Scripture Title:** *The Supreme Cavern Mystery Numinous Treasure Scripture of Wondrous Pure Offerings*. Author unknown, approximately composed during the Sui-Tang period. Contemporaneous with *The Scripture of the Great Offering of the Mysterious Capital*. One fascicle. Base text from *The Orthodox Daoist Canon*, Cavern Mystery Division, Original Texts Category.\n\n---\n\nAt that time, the Left Immortal Duke of the Supreme Ultimate was atop the loftiest peak of Mount Ruoye, the utmost cloud-capped summit of its towering heights. There, in concentrated meditation and stillness, he forever stilled the six dusts, inwardly emptied and unadorned, his body and mind unmoving, without straying thoughts. Within seven days, he attained quiescent samādhi.\n\nOn the following day at noon, he suddenly heard from above the chaotic ringing of bells and drums, and amidst the floating clouds, celestial grand music arose. In an instant, the heavens rained fragrant flowers—some large, some small—each with a hundred petals, their expanse vast and round, some like chariot wheels, varying in size, their colors and forms ever-changing. Some were azure, some yellow, some vermilion, some purple, some transformed into the seven treasures, displaying manifold marvels, rare and wondrous. These celestial flowers cannot be fully described. There were also various incenses—powdered incense, pearl incense, hundred-fold blended incense, seven-treasure incense, and the like—all rising to the heavens, their fragrance rich and pervasive, filling the mountains and forests.\n\nAt that time, amidst the clouds appeared five-colored flying clouds, and eight luminous chariots, bearing thirty thousand divine immortals and their retinues. These immortals were all wise and discerning, eloquent and accomplished in the six penetrations, their virtues inconceivable. Within the three chariots were Perfected Ones, their necks bearing circular aureoles of five colors, illuminating the empty sky. They wore jeweled crowns upon their heads, their robes of cloud-brocade adorned with golden filigree, their pearls bright as the moon, serving as pendants and garlands. Possessing the thirty-two marks and eighty excellences, their radiance shone purely and clearly, each seated upon a chariot before him.\n\nThe Perfected One of the first jeweled chariot declared his name: \"I am Yuluoqiao.\"\nThe Perfected One of the second jade chariot declared his name: \"I am Guangmiaoyin.\"\nThe Perfected One of the third green chariot declared his name: \"I am Zhendinguang.\"\n\nThe three Perfected Ones spoke in unison, praising: \"Excellent! Excellent! Good man, through immeasurable and boundless kalpas, you have cultivated great diligence, ever practicing forbearance, and extending a heart of compassion. Today, without relying on external matters, your body and mind remain unmoving, attaining the mind of no-self. Having no mind of self, you also have no mind of others; having no mind of others, you also have no mind of distinction. Having no mind of distinction, you attain the mind of equality. Good man, upon this mountain, you have attained this mind of non-mind, accomplishing the Dao-fruit, inconceivable. We have now, by the command of the Heavenly Worthy, heard of your merit and virtue filling the world, resonating with the heavens above. Thus, we have come here with our retinues to bear witness to your true practice and to perfect your Dao, enabling future beings to gain knowledge, enter the city of Dharma, and attain the formless Dharma. For this reason, we have descended.\"\n\nThereupon, the Immortal Duke rose from his seat, prostrating himself upon the ground. After listening to the words of the Perfected One Yuluoqiao, he remained thus for a long while before rising. Making obeisance, he inquired: \"How is it that the great Perfected Ones possess such luminous forms, and why do fragrant flowers rain down in manifold transformations, displaying such auspicious signs? I do not yet understand the cause and condition of this day, nor the reason for your gracious condescension to bestow such favor. I earnestly wish that the great Perfected Ones will enlighten me, allowing me to awaken and clearly comprehend these causes and conditions, so that the ignorant and blind may be roused to understand all conditions and ultimately accomplish the supreme Dao-fruit.\"\n\nThen, the first Perfected One, Yuluoqiao, spoke: \"Excellent! Excellent! Good man, what are your past vows, and how do you contemplate them?\"\nThe Immortal Duke replied: \"Truly, I have sealed them in my mouth and dare not speak lightly.\"\nThe great Perfected One said: \"We have come now to fulfill your vow, desiring that in the future you will raise the great bridge of Dharma, construct the great vessel of salvation, open the great causes and conditions, and propagate great merit and virtue. For this reason, we have descended here.\"\n\nThe Immortal Duke again rose and made obeisance, addressing them further: \"Great Perfected Ones and Masters, awaken this ignorant one. I have questions to ask but dare not presume to inquire. I only wish that the great Perfected Ones will heed my humble words.\"\nThe Perfected One replied: \"Excellent! Excellent! Ask whatever you wish.\"\nThe Immortal Duke said: \"On the seventh day of the seventh month, in a single thought, I beheld the ten directions, where in all the hells, the dark souls and hungry ghosts were swallowing fire and eating coals, treading upon knife mountains, their heads and hands severed. Some were immersed in cauldrons of boiling water, their five limbs rotting away, no longer retaining their ghostly forms. The sufferings and pains were inconceivable, and the torments of the Dharma-realm could not be greater. Yet in a single thought, I witnessed such suffering, and unconsciously, my body’s hundred joints and pores all bled, as if dismembered. Such were my past contemplations, just as I have now spoken. I do not yet understand what merit and virtue the great Perfected Ones possess that can save all these dark souls, freeing them from afflictions, satiating their hunger, and granting them liberation.\"\n\nThereupon, the Perfected One, having heard these words, snapped his fingers and exclaimed joyfully: \"Excellent! Excellent! Good man, to speak thus is truly inconceivable. Now, I will tell you—listen carefully, and I shall explain it to you.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1142,
      "start_sentence": 0,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.86200714111328,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝净供妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "大真人即告言曰：唯三元吉日，五腊节者，总名八日。 能於玄坛精舍，奉请道士，宿宵行道，及供香油，作诸甘果，积聚为山，随其大小，或复柈合，种种庄严，上献天尊。 因此慈悲，惠及十方，无量无边，地狱囚徒饿鬼，皆得解脱。 若犯重罪，谤於大道，及毁诸经净戒道士，是名重罪。 若杀父害母，攻伐师主，谋逆国君，亦名重罪。 若犯此罪，由得暂时应其供献，而得解脱。 若罪轻者，因此供献，宿宵行道，永得解脱，俱时饱满。 善男子，善弘建之福，使来生慈悲道士及孝子，皆得饷於先人，或亡父母、姊妹弟兄，皆得解脱，饱满无饥。 若不同此八日，不奉饷先人者，即为不孝。 告诸来生，勤修净供，非但鬼神而得解脱，见世之人财宝增益，不为七世先人之所伤害。 非但七世先人不能伤害，一切鬼神、外魔鬼贼不能伤害。 何以故。 世间凡夫，或於所见，求诸魔鬼，祠祭先人，不依八日，而祠饷之，番悮先人，而更得罪。 何以 故。 祠饷不依八日，则魂灵饥饿，於饥饿中，即生伤害，招引外魔，合为凶害。 若祠饷得所，依於八日，则先亡欢悦，不为祸害，一切魔鬼贼等，不能为害，理致如是。 仙公又言：善哉。 天真向所说者，净供献大而可知。 云言八日，未辩是何，赐垂分别。 真人言：是八日者，正月十五日、七月十五日、十月十五日，是名三元之日。 复有正月一日，是名天腊； 五月初五日，是名地腊； 七月七日，是名道德腊； 十月一日，是名民岁腊； 十二月遇腊日，是名王侯腊。 是名而言，总名八日。 若非八日而祠饷之，终不得达罪福之报，具如前说。 善男子，坚持在心，吾今说者，是上三天之所科格，紫书金题天地常仪，不可思议，可不尊重，善奉行之。 第二真人光妙音告仙公言：善哉善哉，善男子。 功德巨大，不可限量。 我奉天尊言，令我与诸神仙眷属，降於子耶。 何以故。 为不可思议故，为无所得故。",
      "translated_text": "The Great Perfected One then declared: \"The three Yuan auspicious days and the five La festivals together are called the Eight Days. On these days, one should go to the dark altar’s pure abode, invite Daoist priests, and perform the Dao through the night. Offer fragrant oil, prepare various sweet fruits, and pile them into mountains—whether large or small, or arranged in trays—adorning them in manifold ways to present as offerings to the Heavenly Worthy. Through this compassion, grace extends to the ten directions, and the immeasurable, boundless prisoners of hell and hungry ghosts all attain liberation.\n\nThose who commit grave offenses—slandering the Great Dao, defaming the scriptures, or violating the pure precepts and Daoist priests—are guilty of heavy sins. Likewise, killing one’s father or mother, assaulting one’s master or lord, or plotting treason against the ruler are also grave sins. If one commits such sins, the offerings may grant temporary liberation. For those with lighter offenses, through these offerings and the night-long performance of the Dao, they attain permanent liberation and immediate satiation.\n\nGood man, the merit of diligently establishing such blessings ensures that in future lives, compassionate Daoist priests and filial children will make offerings to their ancestors—whether departed parents, sisters, brothers, or other kin—all of whom will be liberated and satiated, free from hunger. If one does not make offerings on these Eight Days to one’s ancestors, it is an act of unfilial piety.\n\nI exhort all future generations to diligently prepare pure offerings. Not only will ghosts and spirits attain liberation, but those in this life will see their wealth and treasures increase, untouched by harm from their seven generations of ancestors. Not only will the seven generations of ancestors be unable to cause harm, but no ghosts, demons, or malevolent spirits will be able to inflict injury. Why is this so?\n\nWorldly commoners, in their ignorance, may seek out ghosts and demons or make offerings to their ancestors, but if they do not adhere to the Eight Days, their offerings will mislead the ancestors and incur further sin. Why? If offerings are made outside the Eight Days, the souls of the departed will remain hungry, and in their hunger, they will turn to harm, summoning external demons to join in malevolence. If offerings are made properly on the Eight Days, the departed will rejoice, refrain from causing harm, and no demons or malevolent spirits will be able to inflict injury. Such is the principle.\n\nThe Immortal Lord then said: \"Excellent! The Heavenly Perfected One’s words on pure offerings are vast and profound. You mentioned the Eight Days but did not clarify what they are. Pray, elucidate their distinctions.\"\n\nThe Perfected One replied: \"The Eight Days are as follows: the fifteenth day of the first, seventh, and tenth months are called the Three Yuan Days. Additionally, the first day of the first month is the Heavenly La; the fifth day of the fifth month is the Earthly La; the seventh day of the seventh month is the Dao and Virtue La; the first day of the tenth month is the People’s Year La; and the La day in the twelfth month is the Kings and Lords La. Together, these are called the Eight Days. If offerings are made outside these days, the karmic retribution of sin and blessing will not be realized, as previously explained.\n\nGood man, hold these words firmly in your heart. What I have spoken is the ordinance of the Three Upper Heavens, inscribed in purple script and golden characters as the eternal rites of heaven and earth—unfathomable and beyond conception. How could one not revere and diligently practice them?\"\n\nThe Second Perfected One, Radiant and Wondrous Sound, then addressed the Immortal Lord: \"Excellent! Excellent, good man! The merit is immense, beyond all measure. By the command of the Heavenly Worthy, I and the divine immortals and their retinues have descended upon you. Why? Because it is inconceivable, because it is without attainment.\"",
      "overlap_context": " were my past contemplations, just as I have now spoken. I do not yet understand what merit and virtue the great Perfected Ones possess that can save all these dark souls, freeing them from afflictions, satiating their hunger, and granting them liberation.\"\n\nThereupon, the Perfected One, having heard these words, snapped his fingers and exclaimed joyfully: \"Excellent! Excellent! Good man, to speak thus is truly inconceivable. Now, I will tell you—listen carefully, and I shall explain it to you.\"",
      "start_char": 1142,
      "end_char": 1875,
      "start_sentence": 49,
      "end_sentence": 82,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.990689039230347,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝净供妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "善男子，向所说者，是名八日，不可思议，名八解脱。 当於此日卯时，安六道座，清净香汤，及诸衣服外具，甘撰饮食，次第安之。 道士於道场中所，清旦奏沐浴章表一道。 午时行道忏谢，施主等家先灵已往，皆於今日解脱清净。 仙公曰：善哉。 大真能为一切众生开解脱门，为无所得迂降此耶。 不审今说六道为是何道，请具说之。 真人曰：一者天道，二者人道，三者畜生道，四者神道，五者鬼道，六者地狱道，是名六道。 善男子，善缄在心，可不遵耶。 复次第三真人真定光言：善哉善哉。 善男子，是八日者，二大真人具说已竟，功德次第，理大分明。 吾今最后说大因缘，使欲告子。 子欲闻耶。 仙公作礼而起，自言：慈悲广被，不弃凡夫。 今日踊跃，非意能陈。 特愿大真，照我愚蒙，岂烦谘请。 真人云：我等奉天尊言，实为过去重成就，子心云何不说。 若不说者，即堕无明，断真道种。 且子往劫因修功德成办，云何不说。 善男子，向言供献功德因缘，有二种意。 何等二种。 一者住相供献，名为有尽。 二者不住相供献，名为净供，名为无尽，何以故。 譬如江海之水，轮转无穷。 是故此经明无尽义，亦复如是。 又如虚空，无边无际，不可限量。 是故我今明无尽义，亦复如是。 若江海之水，轮转有尽，是故我今明无尽之义，便应有尽。 若虚空江海，毕竟不可得知多少边际，故示无尽之义，亦复如是。 善男子，复应须知有尽之义，辩了分明。 夫有尽者，譬如有人诵诸经句，一句两偈，从三至四，乃至百千万亿之句，亦不为多。 何以故。 若为他说，不盈数岁，便为有尽。 是故我今明有尽之义，亦复如是。 复如有人得大王位，富贵累世，金银、瑠璃、珊瑚、琥珀、金刚，诸珍鳞甲等，宝满一城中，亦不为多。 何以故。 若用布施，不盈旬朔，便尔有尽。 是故我今明有尽之义，亦复如是。 若诵经句，口说无尽，及诸珍等，手施无穷，是故当知我今说者，住相供献，名为有尽。 何以故。 夫一切有限之物，施随日消，无限之物，非劫能轰。 是故我今明有尽之义，必竟如是。 善男子，理趣皆然，非但此供功德如是，凡为斋者，一会宿宵，亦复如是。 可不勤行。 若能常励其心，行不住相，善知无尽义者，次定令汝成无上道。 何以故，无我身故，无我心故。 既无我身，即无我心。 既无我心，亦无他心。 既无他心，诸心即灭，是名清净。 得无心定，得无我定。 善男子，今复决了斯言。 若有我心，息於他心，即我心不灭，是名得身心无我，未得身界无我。 若欲求法界无我者，应须当知本无今无，既知本无今无，即知亦无法界。 法界既无，则不生不灭。 不生不灭，是故当知亦非不生，亦非不灭。 所言不生不灭者，何以故，为说法故。 是故云言不生不灭。 得如是理，则名能为净供，则名为得法界无我，则名为得法界清争。 善男子，我今最后说者，并是往古无量无边天尊真人仙真圣道，并及十方诸大力鬼神王等之所履行，得无上道。 子於今虽不名编，然位号曰太极左仙公。 仙阶之大，今可不履行。 必定当得登真人圣，具足六通，成无上道。 尔时，仙公即从座起，作礼谢言：我今顿遭大真，赐如是言，实为希有。 我从无量劫来，行诸功德，亦遇仙人，常为我说小乘小智养生之法。",
      "translated_text": "\"Good man, what was previously spoken is called the Eight Days—unfathomable, named the Eight Liberations. At the *mao* hour on these days, arrange the seats of the Six Paths, prepare pure fragrant water, garments, and all external requisites, as well as fine delicacies and food, setting them out in order. The Daoist, within the oratory, at dawn presents a memorial for bathing. At noon, perform the circumambulation and repentance rites, so that the ancestral spirits of the patrons’ households, those who have passed away, may all attain liberation and purity on this day.\"\n\nThe Immortal Lord said: \"Excellent! The Great Perfected One opens the gate of liberation for all beings, descending here for no attainment.\"\n\n\"I do not yet understand—what are these Six Paths you speak of? Pray, expound upon them fully.\"\n\nThe Perfected One said: \"The first is the Heavenly Path, the second the Human Path, the third the Animal Path, the fourth the Spirit Path, the fifth the Ghost Path, and the sixth the Hell Path. These are called the Six Paths. Good man, hold these words firmly in your heart. How could one not revere and follow them?\"\n\nThen the Third Perfected One, True Radiance of Concentration, spoke: \"Excellent! Excellent, good man! The two Great Perfected Ones have fully expounded the Eight Days, their merit and sequence, their principles vast and clear. Now, I shall speak last of the great causal conditions, for I wish to tell you—would you hear them?\"\n\nThe Immortal Lord rose and bowed, saying: \"Your boundless compassion does not forsake this ordinary being. Today, my joy is beyond words. I only pray the Great Perfected One illumines my ignorance—how could I trouble you with further entreaties?\"\n\nThe Perfected One replied: \"We act by the command of the Heavenly Worthy, truly to perfect what was long ago established. How could your heart not speak of it? If it were not spoken, one would fall into ignorance and sever the seed of the true Dao. Moreover, in past kalpas, you cultivated merit to accomplish this—how could it not be spoken?\n\n\"Good man, the causal conditions of offering and merit previously mentioned have two aspects. What are these two? The first is offering while abiding in form, which is called finite. The second is offering without abiding in form, which is called pure offering, called infinite. Why? It is like the waters of rivers and seas, revolving without end. Thus, this scripture clarifies the meaning of the infinite, and it is likewise so. And like empty space, boundless and immeasurable—thus do I now clarify the meaning of the infinite. If the waters of rivers and seas were to revolve and exhaust, then the meaning of the infinite I now expound would also be exhausted. If empty space and rivers and seas are ultimately unknowable in their bounds, then the meaning of the infinite is likewise so.\n\n\"Good man, you must also understand the meaning of the finite, discerning it clearly. The finite is like one who recites scriptural verses—one line, two gāthās, from three to four, even up to hundreds of thousands of millions of verses—yet this is not considered much. Why? If one expounds them to others, within a few years they are exhausted. Thus do I now clarify the meaning of the finite. It is also like one who attains the position of a great king, enjoying wealth and nobility for generations, with gold, silver, lapis lazuli, coral, amber, and vajra, all manner of treasures filling a city—yet this is not considered much. Why? If used for almsgiving, within a fortnight they are exhausted. Thus do I now clarify the meaning of the finite. If one recites scriptures endlessly with the mouth and gives treasures ceaselessly with the hand, then know that what I now speak of—offering while abiding in form—is called finite. Why? All limited things, when given, diminish with each day, while limitless things cannot be exhausted even by kalpas. Thus, the meaning of the finite I now expound is ultimately thus.\n\n\"Good man, the principle is entirely so. Not only is the merit of this offering thus, but all fasts—even a single night’s assembly—are likewise. How could one not diligently practice? If one can constantly rouse the mind, practice without abiding in form, and truly know the meaning of the infinite, then you will certainly attain the supreme Dao. Why? Because there is no self-body, no self-mind. Since there is no self-body, there is no self-mind. Since there is no self-mind, there is no other-mind. Since there is no other-mind, all minds are extinguished—this is called purity. One attains the samādhi of no-mind, the samādhi of no-self.\n\n\"Good man, I now decisively clarify these words. If there is a self-mind that ceases another’s mind, then the self-mind is not extinguished—this is called attaining the no-self of body and mind, but not yet the no-self of the realm of beings. If one seeks the no-self of the Dharma-realm, one must know that originally there was none, and now there is none. Knowing that originally there was none and now there is none, one knows there is also no Dharma-realm. Since there is no Dharma-realm, there is no arising and no ceasing. Since there is no arising and no ceasing, then know that there is also no non-arising and no non-ceasing. What is meant by no arising and no ceasing? It is for the sake of expounding the Dharma. Thus it is said: no arising, no ceasing. Attaining this principle is called making a pure offering, called attaining the no-self of the Dharma-realm, called attaining the purity of the Dharma-realm.\n\n\"Good man, what I now speak last was all practiced by the Heavenly Worthies, Perfected Ones, Immortals, and Sages of ancient times, boundless and immeasurable, and by the mighty ghost-kings of the ten directions, who thereby attained the supreme Dao. Though you are not yet enrolled among them, your title is Left Immortal Lord of the Supreme Ultimate. The great rank of Immortal—how could you not practice it? You will certainly ascend to the rank of Perfected One, attain the six penetrations, and accomplish the supreme Dao.\"\n\nThereupon, the Immortal Lord rose from his seat, bowed, and gave thanks, saying: \"Today, I have suddenly encountered the Great Perfected One and been granted these words—truly this is rare. From kalpas without measure, I have cultivated merit and encountered immortals who have always expounded to me the lesser vehicle, the lesser wisdom, and the methods of nurturing life.\"",
      "overlap_context": "pt and golden characters as the eternal rites of heaven and earth—unfathomable and beyond conception. How could one not revere and diligently practice them?\"\n\nThe Second Perfected One, Radiant and Wondrous Sound, then addressed the Immortal Lord: \"Excellent! Excellent, good man! The merit is immense, beyond all measure. By the command of the Heavenly Worthy, I and the divine immortals and their retinues have descended upon you. Why? Because it is inconceivable, because it is without attainment.\"",
      "start_char": 1875,
      "end_char": 3121,
      "start_sentence": 83,
      "end_sentence": 146,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.77179789543152,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝净供妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "未有如今大真所说微妙，无边无际，不可思议。 我今结累，由如久积凝冰，一旦逢火，释然消解，无复遗余。 我今无滞，亦复如是。 复如法解卖儿，父母兄弟，四人悲号，不可思议，不期须臾，金银诸库，悉皆盈满，遂得儿还，欢喜无量。 我今欢喜，亦复如是。 又如昔日国王有女，名曰絓音，六极不言，弃之深山，饥饿困乏，性命惙然，逐感真人下降示之，於是病便即愈，具足能言，而得饱满，欢喜无量。 我今欢喜，亦复如是。 特愿大真，命诸灵驾，暂停林薮，希未便腾。 大真言：我等今去，不久便来。 别言已毕，是三舆辇，次第而去，诸仙伎乐，导从腾空，至於云表。 俄顷之间，不知所在。 仙公敬而奉行，至十五日，谨依说法，弘建净供，具如威仪。 作大果山，山高丈八，种种庄严，微妙希有。 诸杂甘果，徧满山林，及诸米饭，亦复甚多。 是日午时，十方地狱，六道含灵，身相各异，无量无边，俱来集会。 是诸鬼中，有一大王，王名大威，前进与诸鬼等，俱时作礼，同声赞言：善哉善哉。 大威王言：净界道士，能为我等，开解脱门，得於今日，是我眷属，非我眷属，无量无边，并来云集，俱蒙清净，而得解脱。 若非净戒慈悲，何能为我是诸眷属，营建净供。 唯愿法师不久成就大仙，证无上道。 及诸天人、畜生神鬼，地狱幽魂，并同斯言。 是言已毕，皆沐浴香汤，衣服庄严，依位而坐，饮食具足。 午时了竟，大王与诸眷属各辞仙公，言：法师，善哉善哉，不可思议。 我等因此慈悲，有无量魂灵，而得解脱。 作斯言已，稽首而去。 仙公告诸来生善男子善女人：我於无量无边劫来，至於今日，始蒙大真说此要言，不可思议。 虽前奉大真授我献经，其议少略，不顿如今说诸因缘，其议深远，乃至如此。 复见有经，名曰《大献》，直说三元，不明八日，不说功德广大如是，无边无际，不可思议。 善男女等，可不尊奉，若能遵敬奉行此经，是人名曰孝子，报其父母生长之恩。 非但胎生父母，亦得报其真父母也。 得报真已，渐阶道果。 若有诽谤不信，不饷先人，是名不孝，违真父母。 何以故。 若不饷先人，鬼魂饥饿，是名不孝。 既不孝已，既生诽谤，若诽谤已，则误先人。 是亡父母，受诸苦恼，其身现世，魔王鬼贼之所伤害，风癞之病，诸苦痛者，具足受之。 将来男女，明各慎之。 太上洞玄灵宝净供妙经竟",
      "translated_text": "Never before have I heard such subtle and wondrous teachings as those now expounded by the Great Perfected One—boundless and immeasurable, beyond all thought and conception. My karmic obstructions, long accumulated like layers of frozen ice, have at this moment met the fire of your wisdom and dissolved without a trace, leaving no residue behind. My present liberation is just so.\n\nIt is like the parable of the man who sold his child: father, mother, and siblings wept in grief beyond measure, yet in but a moment, gold and silver filled their treasuries to overflowing, and the child was returned to them, their joy beyond all bounds. My joy today is just so.\n\nOr again, like the tale of the king’s daughter named Guayin, who suffered the sixfold afflictions and could not speak. Cast into the deep mountains, starving and exhausted, her life nearly spent, she was visited by a Perfected One who descended to her aid. At once her illness was cured, her speech restored, and she was filled with nourishment—her joy beyond all bounds. My joy today is just so.\n\nI only pray, Great Perfected One, that you command the spirit-chariots to linger a while in these woods and groves, and not ascend too soon.\n\nThe Great Perfected One replied: “We shall depart now, but shall return before long.”\n\nWith these parting words, the three celestial carriages rose in order, accompanied by immortal musicians and attendants, soaring into the clouds until they vanished from sight. In an instant, they were nowhere to be seen.\n\nThe Immortal Lord reverently received and practiced the teachings. On the fifteenth day, he diligently prepared a pure offering, observing all the proper rites and decorum. He constructed a Great Fruit Mountain, eighteen feet high, adorned with rare and wondrous ornaments. All manner of sweet fruits filled the mountain and its forests, and abundant rice was also prepared.\n\nAt noon that day, beings from the ten directions—from the hells and the six paths of existence, each with their distinct forms—gathered in numberless multitudes. Among these spirits was a great king named Dawei, who stepped forward with the assembled ghosts, bowed in unison, and praised in one voice: “Excellent! Excellent!”\n\nKing Dawei declared: “O pure-land Daoist, you have opened the gate of liberation for us all. Today, whether kin or not, countless spirits have gathered here, and all have been purified and set free. Were it not for your pure precepts and compassion, how could you have prepared such a pure offering for us and our kin? We pray that you, Dharma Master, swiftly attain the rank of Great Immortal and realize the supreme Dao.”\n\nAll the gods, humans, animals, spirits, ghosts, and suffering souls of the hells echoed these words. When they had spoken, they bathed in fragrant waters, donned splendid robes, took their seats in order, and partook of the feast in full.\n\nWhen the noon offering was complete, King Dawei and his kin took leave of the Immortal Lord, saying: “Dharma Master, excellent! Excellent! Beyond all thought and conception! Through your compassion, countless souls have found liberation.” With these words, they bowed and departed.\n\nThe Immortal Lord then addressed the assembled good men and women: “From kalpas without measure until this day, I have at last received these essential teachings from the Great Perfected One—beyond all thought and conception. Though I previously received from the Great Perfected One the scripture for making offerings, its discourse was brief and did not expound the causes and conditions as profoundly as these teachings now revealed. There is also a scripture called *The Great Offering*, which speaks only of the Three Primes and does not clarify the Eight Days, nor does it expound such vast and boundless merit—beyond all thought and conception.\n\nGood men and women, how could you not revere and uphold this scripture? Those who honor and practice it are called filial children, repaying the kindness of their parents who gave them life. And not only their birth parents, but also their true parents in the Dao. Having repaid their true parents, they gradually ascend the ranks of the Dao’s fruition.\n\nBut those who slander or disbelieve, who fail to offer sustenance to their ancestors, are called unfilial and have turned against their true parents. Why? To withhold offerings from one’s ancestors is to leave their spirits hungry—this is unfilial. Having acted unfilially and slandered the teachings, they mislead their ancestors. Their departed parents suffer myriad torments, while in this present life, their bodies are harmed by demonic forces, plagued by wind and leprosy, and afflicted with all manner of pain. Let future generations of men and women take heed.\n\nHere ends *The Marvelous Scripture of Pure Offerings from the Cavernous Mystery of the Numinous Treasure of the Most High*.”",
      "overlap_context": "e it? You will certainly ascend to the rank of Perfected One, attain the six penetrations, and accomplish the supreme Dao.\"\n\nThereupon, the Immortal Lord rose from his seat, bowed, and gave thanks, saying: \"Today, I have suddenly encountered the Great Perfected One and been granted these words—truly this is rare. From kalpas without measure, I have cultivated merit and encountered immortals who have always expounded to me the lesser vehicle, the lesser wisdom, and the methods of nurturing life.\"",
      "start_char": 3121,
      "end_char": 4025,
      "start_sentence": 147,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.113236665725708,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝净供妙经.txt",
        "category": "本文类"
      }
    }
  ]
}