{
  "source_id": "太上三生解冤妙经",
  "source_file": "chunked_daozang\\太上三生解冤妙经.json",
  "total_chunks": 3,
  "total_original_chars": 2017,
  "total_translated_chars": 11984,
  "total_translation_time": 59.88507413864136,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上三生解冤妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Marvelous Sutra of the Most High on Resolving Karmic Grievances Across Three Lifetimes**\n\n**Sutra Title:** *The Marvelous Sutra of the Most High on Resolving Karmic Grievances Across Three Lifetimes*. The author is unknown, but it likely emerged during the Tang or Song dynasties. It exhorts people to recite the sutra to resolve karmic grievances. One scroll.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Benwen* Category.\n\n---\n\n**The Marvelous Sutra of the Most High on Resolving Karmic Grievances Across Three Lifetimes**\n\nAt that time, the Heavenly Worthy Who Rescues from Suffering in Response to Cries, accompanied by his retinue, traversed the worlds of the ten directions, transforming and delivering sentient beings, leading them out of the sea of suffering, guiding them to the true Dao, and preventing them from entering heterodox sects.\n\nHe observed that within the Western Lands there was a kingdom named Pure Brahman. The people of this land were given to lust and killing, performed few good deeds, and many sank into hell or lost their human forms. Moved by compassion for these beings, he instantly transformed his body and descended.\n\nThat night, the king dreamed of a divine messenger who announced: \"Tomorrow, a celestial perfected one shall arrive from the east. Why not go forth to welcome him?\" The king, unable to sleep, sat awaiting dawn. At daybreak, he assembled his ministers, consorts, imperial relatives, and all the citizens, leaving the palace to welcome the Heavenly Worthy.\n\nUpon reaching the western outskirts of the city, they came to a great garden where pavilions stood in perfect order and flowers bloomed in profusion. There, the Heavenly Worthy sat upon a golden dragon throne within a seven-jeweled hall, attended by celestial youths. The king, his ministers, consorts, imperial relatives, and all the citizens gathered around below, gazing and listening as he expounded the wondrous Dharma of the Orthodox Unity.\n\nSuddenly, auspicious vapors filled the garden, and heavenly flowers rained down. The assembly was filled with awe and inexpressible joy.\n\nThen the queen and her noble consorts burned incense, prostrated themselves, and knelt to speak: \"Our humble kingdom is a land of fools, where we have never before heard such a profound and wondrous Dao. Today, we have encountered it, and we count ourselves deeply fortunate. We have a small matter to present before you and humbly beseech your great compassion to grant us permission.\"\n\nThe Heavenly Worthy said: \"Speak whatever is in your heart.\"\n\nThe queen replied: \"The king is now advanced in years, yet we have no heir. Previously, I conceived, but within a few months, the child was lost. Even when the months were fulfilled and a child was born—whether boy or girl—some died at one or two years, others at three or five, all perishing prematurely. We know not what sins of past lives or this present existence have brought such misfortune. If you would take pity on us, we would reverently receive your instructions.\"\n\nThe Heavenly Worthy said: \"In your past life, you were careless during pregnancy and caused the fetus to be lost. The children’s hearts harbored resentment, and thus you receive such retribution in this life. If you do not believe me, I shall summon these aggrieved spirits for you to question yourself.\"\n\nThe Heavenly Worthy pointed, and the queen looked to see a yaksha with a face like indigo leaves and eyes like baleful stars. It pointed at the queen and said: \"In a past life, I was destined by karmic decree to be born as your child. But you were young and heedless, acting recklessly, and through carelessness, you caused my death. Now I seek to repay you. Yet because in your past life you dwelled in the Central Kingdom, revered Heaven and Earth, the sun, moon, and stars, diligently served your parents-in-law, honored your father and mother, venerated the Three Treasures, were deeply devoted to good deeds, sculpted images, commissioned sutras, spared no expense, built halls, and erected altars, exhausting your strength in acts of charity, taking pity on the distressed, and aiding the poor, you accumulated such merit that in this life you have become the queen of a small kingdom. Were it not for this good fortune, I would have killed you long ago.\"\n\nHearing this, the queen trembled with fear. Shaking, she prostrated herself before the Heavenly Worthy and said: \"In a past life, I committed such deeds. Though I know it now, what use is regret? I humbly beseech the Heavenly Worthy to show me a way to resolve this, even if it means giving away all my wealth in acts of charity.\"\n\nThe Heavenly Worthy said: \"Excellent, excellent! Though in past lives you established great merit and widely cultivated fields of blessings, you never repented or resolved the karmic knots within your body. Formerly, from the Heavenly Worthy of the Orthodox Unity, I received *The Marvelous Sutra of Resolving Karmic Grievances Across Three Lifetimes*. You should recite it with utmost sincerity, and your karmic grievances will naturally dissolve.\n\n\"Human beings are born through the union of Heaven and Earth, formed by the convergence of yin and yang. After three months, the distinction of male and female arises. They must be protected, not harmed; nurtured, not injured. Their lives are no different from those of adults. To harm or lose them is to incur a karmic debt. A single day of creating grievance brings retribution across three lifetimes—how can this not be terrifying?\n\n\"Deluded beings, relying on their youth and strength, are careless during pregnancy. They act recklessly, climbing high, leaping down, carrying heavy loads, rushing about, riding strenuously, engaging in improper relations, or suffering blows, falls, pinching, pressing, striking, or kneading. Some take harmful medicines, receive acupuncture injuries, consume poisonous fish or spoiled meat, or eat hard foods and cold drinks. Such actions often harm the fetus. Whether one inflicts this oneself or instructs others to do so, the causes of harm cannot be fully recounted. The deeds of past lives bring retribution in this present one.\n\n\"Thus, pregnancy is often plagued by illness, lingering pain, loss of appetite, difficulty in standing or walking, skin swelling and breaking, and waist pain as if pierced by an awl. Day and night pass like a year. After enduring such suffering, when the time of birth arrives, there may be many complications: days of obstructed labor, transverse or breech presentations. Relatives are terrified, and family members are filled with anxiety. At such times, the aggrieved spirits come to inflict harm, bringing extraordinary pain. Sometimes the mother lives and the child dies, or the child lives and the mother dies, or both perish, becoming spirits of untimely death. If reborn, they suffer as before; if not, they entangle and harm their relatives. But if one encounters this sutra and recites it with sincere devotion, all karmic obstructions will be completely dissolved.\"\n\nThen he spoke the incantation:\n\n*\"At dawn and dusk, the turning wheel shines,\nIllumining past and present.\"*\n\nAll beings receive their endowment of qi and take form through its transformation. Yet karmic grievances and defilements assail them across three lifetimes. The primordial unity of qi dissolves and liberates the aggrieved spirits. Upon hearing this, they scatter; upon listening, they disperse. The celestial soldiers and divine warriors uphold and protect without fail. Swiftly born, swiftly freed, each attains peace and tranquility. By the mandate of the Primordial Sovereign, this power endures without cease. Hasten, hasten, as in the statutes and decrees!\n\nAt that moment, having recited the sutra seven times, the yaksha prostrated before the Heavenly Worthy, giving thanks: \"By this merit, I shall now proceed directly to the Middle Kingdom and be reborn into a family of wealth and nobility.\" With this, he bowed in gratitude and departed. All who heard this rejoiced greatly.\n\nThe Heavenly Worthy said: \"This sutra does not merely resolve the grievances of one individual. If each of you cultivates sincere devotion and recites it a hundred times, all grievances within a nation—whether already arisen or yet to arise, regardless of the weight of their transgressions—shall be completely dissolved.\"\n\nAs the assembly spoke in unison, reciting the sutra together, upon reaching a hundred repetitions, they suddenly beheld dark clouds spreading in all directions. Amidst the black mist, auspicious qi descended from the heavens, and countless beings prostrated themselves, declaring: \"Through the compassion of Heaven, this sutra and its teachings have been bestowed upon us. All grievances within our nation—whether of the living or the unborn, regardless of the gravity of their sins—have been wholly dissolved.\"\n\nIn an instant, the clouds dispersed and the mist cleared. The sky became bright and serene, and the people rejoiced, praising and giving thanks for the grace of Heaven.\n\nThe assembly then said: \"By the power of the Dao, all have been universally delivered. Though we may have no grievances at present, we fear those that may arise in the future. What preemptive merit should we cultivate to forever escape this suffering?\"\n\nThe Heavenly Worthy replied: \"I now proclaim this *Wondrous Sutra for Resolving Grievances Across Three Lifetimes*. If there are good men and good women who burn incense and recite this sutra three times daily, all grievances bound to their persons shall be entirely eradicated. Should one copy this sutra with devotion and share it with others, their entire household shall partake in its blessings and grace. If someone suffers from weak fetal qi, frequent miscarriages, or instability, turning to this sutra in reverence will bring stability and ensure the birth of wise and virtuous children. If in dreams one often sees deceased sons or daughters, this signifies karmic grievances awaiting their return. With devotion, burn incense and pay homage to this sutra morning and evening; the aggrieved spirits will retreat, and all terrors shall cease. If someone faces great difficulty in childbirth, before the month of peril arrives, invite a Zhengyi Daoist master to burn incense and recite this sutra before the sacred images of the Three Pure Ones. Thereby, benevolent spirits will be moved to protect and assist, ensuring a smooth and natural birth, free from grievous calamities. Mother and child shall both be safe, each preserving their allotted lifespan. If one recites this sutra with utmost sincerity while walking, standing, sitting, or lying down, in future lives they shall be reborn as persons of wealth and nobility, endowed with wisdom, comely in appearance, their descendants prosperous, and their blessings boundless.\"\n\nMoved by these causes and conditions, he composed a verse:\n\n*\"Beings accumulate many grievances,\nDeep grievances are hard to untie.\nA grievance formed in a single day\nDemands repayment across three lifetimes.\nI now transmit this wondrous sutra,\nTo dissolve all karmic grievances.\nHear and recite it with sincere devotion,\nAnd grievances shall vanish of themselves.\"*\n\nWhen the Heavenly Worthy had finished expounding the sutra, the immortals and great sages came to welcome him, and he journeyed to other realms to deliver all beings. Again, he addressed the king and queen: \"Henceforth, if you uphold the true Dao, you shall give birth to filial and wise sons. I now bestow upon you three sacred talismans, to be written in cinnabar and swallowed. One talisman preserves the body, one repels aggrieved spirits, and one hastens a swift birth. You may teach the people of the world to revere and practice this.\"\n\n*Talisman for Preserving the Body*\n*Talisman for Repelling Grievances*\n\n*Talisman for Hastening Swift Birth*\n*The Wondrous Sutra of the Most High for Dissolving Grievances Across Three Lifetimes Concludes*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上三生解冤妙经 经名：太上三生解冤妙经。 撰人不详，约出於唐宋。 劝人诵经解冤。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上三生解冤妙经 尔时，寻声救苦天尊，与诸侍从巡游十方世界，化度众生，出离苦海，令归正道，不入邪宗。 观见西方於内一国王，号净梵。 此国人民多生淫杀，不造善功，多沈地狱，多失人身。 念彼众生，遂即化身下降。 其国王夜梦神报，来日天真自东而至，何不迎之。 王心不寐，坐而待旦，韶众大臣、后妃天亲，及诸市民，远离本所，迎接天尊。 至於城西，有一大园，楼阁严整，花太繁盛。 是时，天尊在七宝殿内金龙座上，天童侍卫。 国王大臣、后妃天亲，及诸市民，座下围绕，观听演说正一妙法。 俄然瑞气盈园，天花交散，大众惊异，喜悦难言。 时有皇后及诸贵妃，烧香拜礼，跪而告曰：弊居小国，愚鲁之邦，未尝得闻如斯高玄妙道。 今日遇值，深为幸矣。 有少短意、欲诉道前，伏愿洪慈，特赐允许。 天尊曰：汝有何言，尽心而说。 皇后告曰：今王年老，予嗣未立。 先有所怀，数月之中，遂致损落。 其或月满，所得男女，或一岁二岁，或三岁，或五岁之间，即便死亡。 未知前生今世何罪，致得如是。 若蒙哀愍，则仰受诀言。 天尊曰：是汝前生之中，怀孕不慎，杀落其胎。 儿女心内憎嫌，故得今身如此之报。 恐汝不信，吾今摄此冤魂，汝当亲问。 天尊指处，皇后视之，见一夜叉，面如叶蓝，眼如怪星。 指皇后而言：前生之时，我受阴注，投你为母。 你身年幼，全无惜护，随性作为，因此不慎，杀落我身。 今欲还报，缘汝前世生居中国，敬奉天地日月星辰，勤侍翁婆，孝顺父母，钦崇三宝，至重善人，塑像造经，略无悭惜，盖殿修坛，竭力施为，悯怜困苦，济惠贫寒，积此善功，今生证为小国之后，若非此福，我即杀你，料应多日。 皇后闻言，心神惧怕，战战兢兢，拜跪道前：我有先身，曾作如是，今日虽知，悔之何及。 伏望天尊略示方便，舍自己之财，尽为布施，愿求解释。 天尊曰：善哉善哉。 汝虽前生建大功德，广作福田，即知不曾忏悔身中之冤结。 吾昔於正一天尊，受《三生解冤妙经》，汝当随吾精心诵之，冤业自消。 夫人禀天地而生，构阴阳而成，三月之外，始分男女，可保而不可伤，可养而不可害，命与大人一体无异。 误损有落，便成冤债。 一日造冤，三世报还，岂不怖哉。 迷昧众生，倚恃年壮，怀孕之时，全无将护，恣意而行，登高跳下，负重急走，或跨骑劳形，或阴阳不慎，或撞或隐，或搦或按，或扑或揉，或服药而损，或针刺而伤，或餐毒鱼恶肉，或吃硬物冷浆。 如斯等事，妊孕多伤。 或是自作，或教他杀害之因，焉能尽说。 前生所作，今身还报。 致使怀孕多病，疼痛缠绵，饮食减少，行立艰难，皮肤肿破，腰似锥钻，巴明盻夜，一日如年。 受此痛苦，啀至月足，临产多般，或连日不分，或横逆不顺，亲姻恐惧，眷属忧惶。 当此之时，冤家来害，苦痛非常。 或母活子死，或子活母死，或子母俱亡，皆为横夭之魂。 若得托生，依前再受，若未托生，缠害亲姻。 若遇此经，志心持念，一切宽业，尽总消除。 即说咒曰： 晨昏运度，耀明古今。",
      "translated_text": "**The Marvelous Sutra of the Most High on Resolving Karmic Grievances Across Three Lifetimes**\n\n**Sutra Title:** *The Marvelous Sutra of the Most High on Resolving Karmic Grievances Across Three Lifetimes*. The author is unknown, but it likely emerged during the Tang or Song dynasties. It exhorts people to recite the sutra to resolve karmic grievances. One scroll.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Benwen* Category.\n\n---\n\n**The Marvelous Sutra of the Most High on Resolving Karmic Grievances Across Three Lifetimes**\n\nAt that time, the Heavenly Worthy Who Rescues from Suffering in Response to Cries, accompanied by his retinue, traversed the worlds of the ten directions, transforming and delivering sentient beings, leading them out of the sea of suffering, guiding them to the true Dao, and preventing them from entering heterodox sects.\n\nHe observed that within the Western Lands there was a kingdom named Pure Brahman. The people of this land were given to lust and killing, performed few good deeds, and many sank into hell or lost their human forms. Moved by compassion for these beings, he instantly transformed his body and descended.\n\nThat night, the king dreamed of a divine messenger who announced: \"Tomorrow, a celestial perfected one shall arrive from the east. Why not go forth to welcome him?\" The king, unable to sleep, sat awaiting dawn. At daybreak, he assembled his ministers, consorts, imperial relatives, and all the citizens, leaving the palace to welcome the Heavenly Worthy.\n\nUpon reaching the western outskirts of the city, they came to a great garden where pavilions stood in perfect order and flowers bloomed in profusion. There, the Heavenly Worthy sat upon a golden dragon throne within a seven-jeweled hall, attended by celestial youths. The king, his ministers, consorts, imperial relatives, and all the citizens gathered around below, gazing and listening as he expounded the wondrous Dharma of the Orthodox Unity.\n\nSuddenly, auspicious vapors filled the garden, and heavenly flowers rained down. The assembly was filled with awe and inexpressible joy.\n\nThen the queen and her noble consorts burned incense, prostrated themselves, and knelt to speak: \"Our humble kingdom is a land of fools, where we have never before heard such a profound and wondrous Dao. Today, we have encountered it, and we count ourselves deeply fortunate. We have a small matter to present before you and humbly beseech your great compassion to grant us permission.\"\n\nThe Heavenly Worthy said: \"Speak whatever is in your heart.\"\n\nThe queen replied: \"The king is now advanced in years, yet we have no heir. Previously, I conceived, but within a few months, the child was lost. Even when the months were fulfilled and a child was born—whether boy or girl—some died at one or two years, others at three or five, all perishing prematurely. We know not what sins of past lives or this present existence have brought such misfortune. If you would take pity on us, we would reverently receive your instructions.\"\n\nThe Heavenly Worthy said: \"In your past life, you were careless during pregnancy and caused the fetus to be lost. The children’s hearts harbored resentment, and thus you receive such retribution in this life. If you do not believe me, I shall summon these aggrieved spirits for you to question yourself.\"\n\nThe Heavenly Worthy pointed, and the queen looked to see a yaksha with a face like indigo leaves and eyes like baleful stars. It pointed at the queen and said: \"In a past life, I was destined by karmic decree to be born as your child. But you were young and heedless, acting recklessly, and through carelessness, you caused my death. Now I seek to repay you. Yet because in your past life you dwelled in the Central Kingdom, revered Heaven and Earth, the sun, moon, and stars, diligently served your parents-in-law, honored your father and mother, venerated the Three Treasures, were deeply devoted to good deeds, sculpted images, commissioned sutras, spared no expense, built halls, and erected altars, exhausting your strength in acts of charity, taking pity on the distressed, and aiding the poor, you accumulated such merit that in this life you have become the queen of a small kingdom. Were it not for this good fortune, I would have killed you long ago.\"\n\nHearing this, the queen trembled with fear. Shaking, she prostrated herself before the Heavenly Worthy and said: \"In a past life, I committed such deeds. Though I know it now, what use is regret? I humbly beseech the Heavenly Worthy to show me a way to resolve this, even if it means giving away all my wealth in acts of charity.\"\n\nThe Heavenly Worthy said: \"Excellent, excellent! Though in past lives you established great merit and widely cultivated fields of blessings, you never repented or resolved the karmic knots within your body. Formerly, from the Heavenly Worthy of the Orthodox Unity, I received *The Marvelous Sutra of Resolving Karmic Grievances Across Three Lifetimes*. You should recite it with utmost sincerity, and your karmic grievances will naturally dissolve.\n\n\"Human beings are born through the union of Heaven and Earth, formed by the convergence of yin and yang. After three months, the distinction of male and female arises. They must be protected, not harmed; nurtured, not injured. Their lives are no different from those of adults. To harm or lose them is to incur a karmic debt. A single day of creating grievance brings retribution across three lifetimes—how can this not be terrifying?\n\n\"Deluded beings, relying on their youth and strength, are careless during pregnancy. They act recklessly, climbing high, leaping down, carrying heavy loads, rushing about, riding strenuously, engaging in improper relations, or suffering blows, falls, pinching, pressing, striking, or kneading. Some take harmful medicines, receive acupuncture injuries, consume poisonous fish or spoiled meat, or eat hard foods and cold drinks. Such actions often harm the fetus. Whether one inflicts this oneself or instructs others to do so, the causes of harm cannot be fully recounted. The deeds of past lives bring retribution in this present one.\n\n\"Thus, pregnancy is often plagued by illness, lingering pain, loss of appetite, difficulty in standing or walking, skin swelling and breaking, and waist pain as if pierced by an awl. Day and night pass like a year. After enduring such suffering, when the time of birth arrives, there may be many complications: days of obstructed labor, transverse or breech presentations. Relatives are terrified, and family members are filled with anxiety. At such times, the aggrieved spirits come to inflict harm, bringing extraordinary pain. Sometimes the mother lives and the child dies, or the child lives and the mother dies, or both perish, becoming spirits of untimely death. If reborn, they suffer as before; if not, they entangle and harm their relatives. But if one encounters this sutra and recites it with sincere devotion, all karmic obstructions will be completely dissolved.\"\n\nThen he spoke the incantation:\n\n*\"At dawn and dusk, the turning wheel shines,\nIllumining past and present.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1231,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.998443603515625,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上三生解冤妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "万类受禀，结化成形。 冤业悮染，三世相侵。 正一之气，解免冤魂。 闻之即散，听之离分。 天丁甲卒，扶护无倾。 速生速免，各得安宁。 元皇符命，时刻不停。 急急如律令。 是时，念经七徧，夜叉座前拜谢天尊：我今承斯功德，径往中土，托生富贵之家。 拜谢而去。 众人闻之，皆大欢喜。 天尊曰：此经非独解一人之冤结。 汝等各发诚心，诵经百徧，一国之人，应有冤结，悉皆解脱。 于会下言，同声诵之。 至於百徧，蓦见阴云四布，黑雾之中，瑞气垂空，诸多类拜而言：我等特蒙天慈，降赐经法，一国冤结，已生未生、罪无轻重，咸皆解脱。 倏忽之间，云收雾敛，天气朗清，人民欢庆，赞谢天恩。 众等告曰：然赖道力，普得济度，虽无即目之冤，虑有他时所犯。 作何预修功德，永离此苦。 天尊曰：吾今说此《三生解冤妙经》，若有善男子善女人，每日烧香诵经三徧，己身冤结，尽皆消灭。 如精心抄一本与人，合家眷属，同沾福惠。 若复有人胎气怯弱，或数落不安，转礼此经，即得安稳，必得智慧男女。 如睡梦中间，常见亡过儿女，此是冤业，又待重来。 精心每日旦暮烧香，拜礼此经，冤魂自退，普无惊怖。 若复有人临产多难，即於难月之前，请正一道士法师，对三清圣像，焚香诵经，遂感善神护佑，诞育顺理，则无冤横之灾，子母全安，各保天年之寿。 如行住坐卧，精诚持念，后世为人，富贵聪明，形容端正，子孙荣旺，获福无量。 叹斯因缘，而作偈曰： 众生多结冤，冤深难解结。 一日结成冤，三世报不歇。 我今传妙经，解除诸冤业。 闻诵志心听，冤家自消灭。 是时，天尊说经既毕，诸仙大圣来迎天尊，巡游他方，济拔群品，再为国王、后妃曰：自后依奉正道，即生孝慧之男。 吾今付汝灵符三道，朱书吞之。 一符保身，一符辟冤魂，一符催速生。 汝等可以教世人遵敬奉行。 保身符 辟冤符",
      "translated_text": "All beings receive their endowment of qi and take form through its transformation. Yet karmic grievances and defilements assail them across three lifetimes. The primordial unity of qi dissolves and liberates the aggrieved spirits. Upon hearing this, they scatter; upon listening, they disperse. The celestial soldiers and divine warriors uphold and protect without fail. Swiftly born, swiftly freed, each attains peace and tranquility. By the mandate of the Primordial Sovereign, this power endures without cease. Hasten, hasten, as in the statutes and decrees!\n\nAt that moment, having recited the sutra seven times, the yaksha prostrated before the Heavenly Worthy, giving thanks: \"By this merit, I shall now proceed directly to the Middle Kingdom and be reborn into a family of wealth and nobility.\" With this, he bowed in gratitude and departed. All who heard this rejoiced greatly.\n\nThe Heavenly Worthy said: \"This sutra does not merely resolve the grievances of one individual. If each of you cultivates sincere devotion and recites it a hundred times, all grievances within a nation—whether already arisen or yet to arise, regardless of the weight of their transgressions—shall be completely dissolved.\"\n\nAs the assembly spoke in unison, reciting the sutra together, upon reaching a hundred repetitions, they suddenly beheld dark clouds spreading in all directions. Amidst the black mist, auspicious qi descended from the heavens, and countless beings prostrated themselves, declaring: \"Through the compassion of Heaven, this sutra and its teachings have been bestowed upon us. All grievances within our nation—whether of the living or the unborn, regardless of the gravity of their sins—have been wholly dissolved.\"\n\nIn an instant, the clouds dispersed and the mist cleared. The sky became bright and serene, and the people rejoiced, praising and giving thanks for the grace of Heaven.\n\nThe assembly then said: \"By the power of the Dao, all have been universally delivered. Though we may have no grievances at present, we fear those that may arise in the future. What preemptive merit should we cultivate to forever escape this suffering?\"\n\nThe Heavenly Worthy replied: \"I now proclaim this *Wondrous Sutra for Resolving Grievances Across Three Lifetimes*. If there are good men and good women who burn incense and recite this sutra three times daily, all grievances bound to their persons shall be entirely eradicated. Should one copy this sutra with devotion and share it with others, their entire household shall partake in its blessings and grace. If someone suffers from weak fetal qi, frequent miscarriages, or instability, turning to this sutra in reverence will bring stability and ensure the birth of wise and virtuous children. If in dreams one often sees deceased sons or daughters, this signifies karmic grievances awaiting their return. With devotion, burn incense and pay homage to this sutra morning and evening; the aggrieved spirits will retreat, and all terrors shall cease. If someone faces great difficulty in childbirth, before the month of peril arrives, invite a Zhengyi Daoist master to burn incense and recite this sutra before the sacred images of the Three Pure Ones. Thereby, benevolent spirits will be moved to protect and assist, ensuring a smooth and natural birth, free from grievous calamities. Mother and child shall both be safe, each preserving their allotted lifespan. If one recites this sutra with utmost sincerity while walking, standing, sitting, or lying down, in future lives they shall be reborn as persons of wealth and nobility, endowed with wisdom, comely in appearance, their descendants prosperous, and their blessings boundless.\"\n\nMoved by these causes and conditions, he composed a verse:\n\n*\"Beings accumulate many grievances,\nDeep grievances are hard to untie.\nA grievance formed in a single day\nDemands repayment across three lifetimes.\nI now transmit this wondrous sutra,\nTo dissolve all karmic grievances.\nHear and recite it with sincere devotion,\nAnd grievances shall vanish of themselves.\"*\n\nWhen the Heavenly Worthy had finished expounding the sutra, the immortals and great sages came to welcome him, and he journeyed to other realms to deliver all beings. Again, he addressed the king and queen: \"Henceforth, if you uphold the true Dao, you shall give birth to filial and wise sons. I now bestow upon you three sacred talismans, to be written in cinnabar and swallowed. One talisman preserves the body, one repels aggrieved spirits, and one hastens a swift birth. You may teach the people of the world to revere and practice this.\"\n\n*Talisman for Preserving the Body*\n*Talisman for Repelling Grievances*",
      "overlap_context": " inflict harm, bringing extraordinary pain. Sometimes the mother lives and the child dies, or the child lives and the mother dies, or both perish, becoming spirits of untimely death. If reborn, they suffer as before; if not, they entangle and harm their relatives. But if one encounters this sutra and recites it with sincere devotion, all karmic obstructions will be completely dissolved.\"\n\nThen he spoke the incantation:\n\n*\"At dawn and dusk, the turning wheel shines,\nIllumining past and present.\"*",
      "start_char": 1231,
      "end_char": 1972,
      "start_sentence": 53,
      "end_sentence": 88,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.679391860961914,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上三生解冤妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "催产符 太上三生解冤妙经竟",
      "translated_text": "*Talisman for Hastening Swift Birth*\n*The Wondrous Sutra of the Most High for Dissolving Grievances Across Three Lifetimes Concludes*",
      "overlap_context": " he journeyed to other realms to deliver all beings. Again, he addressed the king and queen: \"Henceforth, if you uphold the true Dao, you shall give birth to filial and wise sons. I now bestow upon you three sacred talismans, to be written in cinnabar and swallowed. One talisman preserves the body, one repels aggrieved spirits, and one hastens a swift birth. You may teach the people of the world to revere and practice this.\"\n\n*Talisman for Preserving the Body*\n*Talisman for Repelling Grievances*",
      "start_char": 1972,
      "end_char": 1990,
      "start_sentence": 89,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.2072386741638184,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上三生解冤妙经.txt",
        "category": "本文类"
      }
    }
  ]
}