{
  "source_id": "太上无极总真文昌大洞仙经",
  "source_file": "chunked_daozang\\太上无极总真文昌大洞仙经.json",
  "total_chunks": 15,
  "total_original_chars": 16067,
  "total_translated_chars": 110380,
  "total_translation_time": 561.1851530075073,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Vast Boundless Primordial Perfected Wenchang Great Cavern Immortal Scripture**\n\n**Scripture Title:** *The Supreme Vast Boundless Primordial Perfected Wenchang Great Cavern Immortal Scripture*. Originally collated by the Master of Moyi Cave of Ganshan. According to the preface, it was transmitted by Lord Wenchang to the Daoist Liu Ansheng in the *wuzi* year of the Qiandao reign of the Southern Song, and later recollated by the Daoist Luo Yizi in the autumn of the *jiazi* year of the Jingding reign. Printed and disseminated in the year of *shetige*.\n\nThis text was modeled after the *Highest Clarity Great Cavern Scripture* and the *Numinous Treasure Scripture of Salvation for Humanity*. Five scrolls in total. Base text from the *Daoist Canon of the Zhengtong Era*, *Cavern Reality Division*, *Original Texts* category.\n\n---\n\n**The Supreme Vast Boundless Primordial Perfected Wenchang Great Cavern Immortal Scripture, Scroll One**\n\n**Preface by the Celestial Worthy of the Nine Heavens’ Transformative Governance, Clarity and True Contemplation, Treasure Radiance, Compassionate Response, and Eternal Life**\n\nCollated by the Supreme Mystery and Unsurpassed Highest Virtue Perfected Lord, Master of Moyi Cave of Ganshan\n\nI once lived as a farmer, and while tilling the fields, I unearthed a golden statue beneath my hoe. Upon inquiring with the village elders, I was told it was an image of the Celestial Venerable of Primordial Beginning. Long ago, when Yu the Great governed the waters, he smelted metal to fashion this statue to pacify the sacred peaks. I had worshipped it with incense and offerings without the slightest negligence. Yet when a sea storm churned the waves beyond human strength to withstand, I, on behalf of the people, cast the golden statue into the raging waters. Thereupon, the winds and tides receded, and the entire region found peace.\n\nI had long pondered this event when one evening, a radiance stretched across the sky above the sandy shoals. Digging there, I recovered the original statue and returned it to build a temple for its enshrinement. The people of the region joined me in its veneration, and over the years, its numinous responses became too numerous to record.\n\nMy parents, alas, perished in a pestilence. I built a hut beside their graves, tending the earth around them. Then, three divine beings—Perfected Zhen Dingguang, Yu Luoqiao, and Guang Miaoyin—appeared before me, clad in hempen headscarves, feathered robes, and straw sandals. They bestowed upon me a volume of the *Great Cavern Scripture*, saying: \"Recite this morning and evening, and you shall surely attain good fruits. Among the Three Powers, above, it may aid the souls of your parents and ancestors, liberating them from dark suffering; in the middle, it may eradicate sins, dispel calamities, prolong life, and augment blessings; below, it may protect your clan and save others, ensuring their preservation. You may offer gold and silk to us three, and we shall memorialize your devotion.\"\n\nThat very day, I followed their command, preparing a vegetarian feast and presenting gold and silks to receive their teachings. Thereafter, I recited the scripture morning and night without cease, and its numinous responses were manifold. Once, during a scorching summer, a great flood submerged my parents’ graves. I reverently presented the golden statue and recited the *Great Cavern Scripture*, vowing to complete a thousand recitations to ensure their safety. The following autumn, incessant rains swelled the streams into a single torrent, and my fear grew. Yet when the waters receded, I saw that the valley before the graves had transformed into a vast, solid plain, over a *li* in breadth. From then on, the pines and catalpas remained unharmed.\n\nI had long grieved that my parents died of pestilence, hating the plague demons with a bone-deep enmity. Though the paths of the living and the dead diverge, I lacked the power to exact vengeance. Thus, I diligently recited the *Great Cavern Immortal Scripture* morning and evening, entreating the golden statue with utmost sincerity, praying for the might to subdue the plague demons.\n\nThree years later, I suddenly dreamed that the golden statue spoke to me: \"You have mastered the *Great Cavern Immortal Scripture*, but you have not yet seen the *Great Cavern Register of Methods*. Today, I shall bestow it upon you to quell demonic forces. This will not only fulfill your original vow but also aid Heaven’s transformative work, assisting the state and saving the people.\" From its sleeve, it produced two texts, which I received with a hundred bows. The first was the *Great Cavern Register*, and the second, the *Great Cavern Methods*.\n\nUpon waking, I found the two books at my pillow. I prepared a vegetarian feast, placed them in a sacred casket, and chose an auspicious day to examine them. As I read the passage, *\"When the ten thousand armored soldiers of the Great Cavern Heaven descend to deliver...\"*, suddenly, wind and thunder darkened the day. Countless figures in golden armor and crimson sashes arrayed themselves before me, bowing to receive my command. One holding a red banner stood at their fore, saying, \"We await your orders.\"\n\nStill in a daze, I unthinkingly shouted: \"I command you to subdue the plague demons! In this village, an entire household lies stricken—go and drive them out!\" At once, the banner-bearer led over a hundred soldiers into the house. In an instant, they emerged, dragging five demonic agents. Some wore tiger skins, some wore rooster crowns, some resembled humans, others crows or donkeys and horses. All wielded tools of water, fire, feathers, and chisels.\n\nEnraged, I rebuked them, threatening to annihilate their forms. They pleaded: \"We disciples arise from the yearly cycles, formed by the *qi* of the seasons. We roam in fixed directions, afflicting those destined to suffer. Those punished by dark judgments endure calamity; those whose heavenly mandate is severed meet death. This is not our private doing. It begins with the Three Officials and Five Peaks, who memorialize the Jade Emperor, presenting the sins of mortals. Thereupon, the Emperor commands the Three Officials and Five Peaks to spread illness. The Year Star’s register assigns our tasks, and we act strictly according to the ledger. If the Perfected Master grants us leniency, we shall henceforth obey restraints. Wherever we encounter the talismans and registers of the Perfected Master, we shall not dare to approach.\"\n\nI then instructed them according to the scripture’s methods, and they departed. Thereafter, whenever villagers fell ill with pestilence, I provided them with talismans and methods, and all were saved. Through these registers and methods, I rescued countless afflicted souls. My name spread far and wide, and scholars, commoners, officials, and clerics flocked to my door seeking healing, their numbers beyond count.\n\nI accumulated profound merit and wondrous deeds, all through reciting the *Great Cavern Immortal Scripture* and obtaining the *Great Cavern Register of Methods*. Thus, I could fully manifest divine efficacy, rectify the proper, expel the perverse, deliver the living, ferry the dead, dispel calamities, and prolong life.\n\nLater, in unseen realms, mighty ghosts and spirits, as well as the valiant souls of local shrines, came to request that I recite the scripture for their benefit. They expressed their gratitude, saying: \"By the power of the Perfected Master’s scripture, our virtue and might have increased, and our names have been inscribed in the registers of good spirits.\"\n\nShould lost souls and lingering spirits unable to attain rebirth appear—manifesting in dreams or possessing forms to beseech me for scripture-recitation and merit-transference—they would all express their gratitude, saying: \"By the power of this scripture, we have escaped the苦趣 and all obtained rebirth.\"\n\nWhen seasonal epidemics spread unchecked, one need only recite this scripture and perform the register rites, dispatching the *Plague-Dispelling Talisman*, *Plague-Cutting Talisman*, *Plague-Stilling Talisman*, and summoning the celestial couriers and armored legions to command the Nine Divisions of officials: the *Plague-Seizing, Plague-Consuming Officers*; *Toxin-Seizing, Toxin-Consuming Officers*; *Evil-Seizing, Evil-Consuming Officers*; *Qi-Seizing, Qi-Consuming Officers*; *Ghost-Seizing, Ghost-Consuming Officers*; *Calamity-Seizing, Calamity-Consuming Officers*; *Essence-Seizing, Essence-Consuming Officers*; *Divine Physician Officers for Healing*; and *Talisman-Wielding, Shrine-Destroying Officers*. Each division leads its armored troops, joined by the five hundred million black-clad cavalry of the Northern Celestial Officials, the Venerable Canglao, the Venerable Magu, and the Diamond Vajra Warriors, to apprehend the malevolent forces.\n\nFirst, a memorial is sent to the Year Sovereign, then a petition to Mount Tai, before delegating authority to the City Gods and Earth Deities, who dispatch the Epidemic Envoys. If the perverse resist the rectification and refuse to disperse, or violate the covenant upon hearing the scripture, they are then reported and annihilated.\n\nThe Great Dao cherishes compassion; the Supreme Clarity ever embodies goodness. The Celestial Emperor delights in life and extends benevolence to halt killing. Those who practice the scripture and register rites must not act with private harshness, lest they incur heavenly censure. One should dispatch them with propriety, honor them with scripture, awe them with register rites, and exhort them with virtuous deeds—this is the swift path of expedient cultivation.\n\nPractitioners of this scripture and register rites must exercise careful discernment to establish profound merit. This scripture is revered and mighty, capable of resolving karmic entanglements, settling tomb disputes, halting heavenly retributions, dissolving curses, lifting offenses, pacifying graves and dwellings, calming military and government affairs, stilling warfare, ending epidemics, praying for wind and rain, summoning auspicious omens, ensuring silkworm and grain harvests, protecting life and body, shielding clans, aiding the state, securing borders, restraining insects and tigers, averting droughts and floods, vanquishing demons, quelling myriad evils, pacifying the spirits of sacrificial rites, aiding the souls of ancestors, and delivering lost and lingering spirits. All these may be accomplished by holding fasts, reciting scriptures, and performing the Dao.\n\nFor treating illnesses and neutralizing poisons, there is the *Divine Prescription of the Purple Court Heavenly Physician*—a remnant grace of the Golden Empress of Yu the August, extending to all generations, sparing people from untimely deaths and freeing them from the scourge of epidemics. Those who uphold this teaching should seek out and study it to attain immortal merit.\n\nIn a former life in Wu and Kuaiji, through the merit of this scripture, I attained the rank of Brahmā-Conquering Tathāgata. Thereafter, through unwavering recitation, I realized the fruition of Supreme Clarity’s *Imperial Sovereign of Unbounded Joy and Nurturing Heaven*, the *Venerable Perfected of Luminous Purity and Merciful Response, Eternal Life of Rebirth*. By diligent recitation of the scripture, I ascended to the nobility of the Upper Clarity—how could one not deeply revere and transmit it?\n\nThose who receive and recite it must strive to practice it, aspiring to ascend together with the assembly of Wenchang in the cultivation of wondrous deeds.\n\n*Revealed in the autumn of the wùzǐ year of the Qián Dào era at the Phoenix Terrace, received by Liú Ānshèng. Re-revealed in the autumn of the jiǎzǐ year of the Jǐngdìng era, re-collated at the Biē Tóu Mountain’s Mó Wéi Cave, with the Golden Lotus Stone serving as the ritual altar, received by Luó Yìzǐ. Thereafter, on the ninth day of the ninth month in the yǐchǒu year of the Xuánmò era, again revealed at the Xīlíng Guìyán Wèishēng Zǒngzhēn Altar:*\n\nThe *Scripture of Salvation* and the *Great Cavern Scripture* are the ancestors of all scriptures; the Pearl of Millet and the Treasure of Cānghú are the sources of all sages. These two scriptures, though bearing different names, share a single origin—giving birth to heaven and establishing earth, gestating the mysterious and dividing the primordial. They are no deceptive words to delude the world, but the essential means to enter sageliness and generate spirit. They govern creation and turn the pivot of the cosmos. Their words lack ornate rhyme, their verses eschew florid embellishment—thus they are profound and abstruse, difficult to fathom in detail. They are treasures cherished by the heavens above.\n\nFrom the Boundless to the present, how could they be allowed to fall into neglect? Yet people today know only to recite the *Scripture of Salvation* and remain unaware of the *Great Cavern Scripture*. For the *Scripture of Salvation*, I once composed verses to embellish its meaning, but the *Great Cavern Scripture* has lacked such adornment. Now, I command the attendant disciples to carve woodblocks and disseminate it, and I shall also compose hymns to illuminate its virtue, that readers may more easily understand and reciters more readily awaken.\n\n**Preface to the Scripture’s Meaning**\nFrom the primordial tones of Cānghú’s burning sand,\nSealed in celestial script to ferry heaven’s kin.\nThe Great Mysterious Dao’s father sought its transmission,\nAnd only then did the *Great Cavern Scripture* descend to the world.\n\n**Cultivating the True Dao**\nMortals of the vast earth seek to awaken the truth,\nYet the path to immortality is distant and hard to find.\nIf you wish for a swift and unerring way,\nRecite and hold the *Great Cavern Scripture* in heart and mouth.\n\n**Praying for Offspring and Prosperity**\nThe virtue of past ancestors was slight,\nAnd this life’s prosperity and descendants are fraught with hardship.\nIf you wish your prayers to align with your desires,\nHow can it compare to diligently studying the *Great Cavern Scripture*?\n\n**Averting Heavenly Disasters**\nSun and moon lose their light, suffering eclipse,\nStars stray from their courses, disrupting celestial patterns.\nTo dispel heavenly calamities and bring peace to the common folk,\nLet the worthy recite the *Great Cavern Scripture* together.\n\n**Praying for Wind, Rain, and Bountiful Harvests**\nDrought demons bring disaster, rain falls like gold,\nLocusts and floods leave no grain to harvest.\nTo ensure universal abundance and no famine,\nPrayers rely entirely on the *Great Cavern Scripture*.\n\n**Transforming the Common Folk**\nArtisans, merchants, farmers, and all four classes,\nGreedily pursue gain, unaware of the karma they carry.\nAmidst busyness, carve out a moment of leisure,\nAnd study the *Great Cavern Scripture* of Wenchang.\n\n**Pacifying Treasury and Halting Warfare**\nTreasuries overflow with wealth and resources,\nWeapons forever stilled in joyful peace.\nThe people sing of the Dao’s governance, seeking lasting order—\nRepay the nation by diligently studying the *Great Cavern Scripture*.\n\n**Pacifying Ghosts and Spirits**\nEarth deities, shrine spirits, and all numinous beings,\nSeek promotion yet lack the means.\nTo ascend the registers of good spirits and augment their power,\nThey must listen to the *Great Cavern Scripture* day and night.\n\n**Aiding Ancestral Spirits**\nThe souls of kin—parents and ancestors—\nLinger long in the underworld, unable to ascend.\nIf you wish to deliver them but lack the means,\nFast and diligently study the *Great Cavern Scripture*.\n\n**Resolving Tomb Disputes**\nTomb disputes and summonses burden descendants,\nCoupled with heavenly retributions in the celestial court.\nFor generations, misfortunes are passed down—\nTo resolve them, one should study the *Great Cavern Scripture*.\n\n**Resolving Offenses Against Graves and Dwellings**\nWhether renovating homes or constructing graves,\nBreaking ground offends the inauspicious spirits.\nThis brings misfortunes upon the household—\nTo resolve and pacify them, hold fast to the *Great Cavern Scripture*.\n\n**Dispelling Pestilence**\nWhen the Year-Star governs the Five Pestilences,\nPlagues spread through towns and villages, harming the people.\nTo protect neighborhoods from contagion,\nMaintain strict purity and study the *Great Cavern Scripture* together.\n\n**Curing Illness**\nWhen monthly afflictions and yearly calamities linger in the body,\nOne seeks physicians, divination, and gods in vain.\nWith no means of relief and nowhere to turn,\nEntrust your fate to the Dao and take refuge in the *Great Cavern Scripture*.\n\n**Delivering Sunken Souls and Stagnant Spirits**\nThe six kinds of karmic souls—men and women—\nDwell in darkness, bound to the shadowy underworld.\nTo universally proclaim their deliverance to the celestial realms,\nFrequently study the *Great Cavern Scripture*.\n\n**Untangling Karmic Grievances**\nThe six paths of karmic foes weave deep entanglements,\nVengeance upon vengeance—when will it end?\nTo bring joy to each and all,\nThere is nothing but listening to the *Great Cavern Scripture*.\n\n**Ending Curses**\nWhether over wealth or wrath,\nA moment’s fury invokes the gods.\nWhen ghostly lawsuits form, when will they cease?\nOnly the *Great Cavern Scripture* can dissolve them.\n\n**Quelling Calamities**\nIllness, death, and misfortune cling to the body,\nOfficial disasters and bandits bring bitter oppression.\nWealth scatters like melting ice—\nFor protection, hold fast to the *Great Cavern Scripture*.\n\n**Eradicating Demonic Beings**\nSpirits of trees, stones, foxes, monkeys, and dogs,\nHurl bricks, set fires, and take human form.\nThey wield power, demand lewd sacrifices—\nTo exterminate them, study the *Great Cavern Scripture*.\n\n**Opening the Mind and Sharpening Wisdom**\nScholars and students with minds choked by weeds,\nChild prodigies who falter in response—\nTo wield the brush with divine aid,\nFirst cultivate the habit of holding the *Great Cavern Scripture*.\n\n**Preserving Form and Life**\nThis body is like illusion, like a bubble,\nYet within its qi and spirit lies the path to true cultivation.\nTo preserve form and life, aligning with Heaven,\nDiligently ponder the *Great Cavern Scripture* of Wenchang.\n\n**Admonishing the Wealthy**\nDo not rely on vast wealth amassed at home,\nFor Heaven’s decree can strip your fortune and topple your prosperity.\nWhen the time is ripe to cultivate merit,\nSacrifice your wealth to print and distribute the *Great Cavern Scripture*.\n\n**Accounts of Efficacy**\nWith a heart of sincerity reaching the Supreme Clarity,\nOne receives transmission from the Three Spirits.\nThis body attains the fruit of Heavenly Worthies—\nAll because of diligent study of the *Great Cavern Scripture*.\n\n**Two Universal Exhortations**\nHear my earnest words on the *Great Cavern Scripture*,\nIts profound mysteries truly beyond naming.\nIts boundless merits defy thought—\nI urge all mortals not to take it lightly.\n\nThe Primordial Heavenly King expounded the Great Vehicle,\nOnly those with karmic affinity encounter this sacred scripture.\nIf one can study and recite it steadfastly to the end,\nThey shall join the assembly of Wenchang.\n\n**Qinghe Elder’s Eulogy on Essential Teachings**\nThe Three Caverns’ scriptures treasure jade-like sounds,\nTheir words resplendent, scattered like pearls and gold.\nThey avert disasters, ward off misfortunes, and birth heaven and earth,\nDelivering all beings as numerous as the sands of the Ganges.\n\nThe Great Dao unfurls, weaving the Cavern’s text,\nIts aid to people and benefit to creatures boundless.\nIf mortal beings wish to become soaring immortals,\nFor my sake, purify your heart and read this wondrous chapter.\n\nThe Dao is fundamentally soundless—how could it have words?\nYet the sages established teachings to forcefully transmit it.\nTo catch fish, one must rely on the power of the trap;\nOnce the fish is caught, what need remains for the trap?\n\nWhen the Primordial One first transmitted the *Great Cavern Scripture*,\nIts single sound resounded for all to hear.\nThe lamp of Dharma was passed on by later generations—\nNot only by Heavenly Worthies and Dao Lords.\n\nWhen the divine wind is still and the sea cloudless,\nHeaven and earth are serene, the four qi pure.\nIf even one karmic thread stirs in delusion,\nThe celestial pivot turns once more without cease.\n\nOn auspicious days and favorable hours, recite the scripture well,\nLet not worldly cares entangle the mind.\nWhen the work of aiding people and benefiting creatures is complete,\nYour name shall be inscribed on jade tablets and golden registers.\n\nNeither existent nor nonexistent, originally pure,\nBeyond form, beyond sound, transcending all comparison.\nWhere depiction and description fail to reach,\nThe subtle image within the Mystery is most distinct.\n\nThe highest true beings, devoid of qi,\nHave endured from the Dragon Han era to the present.\nUnchanging, unaugmented, they are quiescence itself—\nThis is called the Great Dharma Body.\n\nContemplate the talismanic decree—it proclaims itself,\nAble to release those bound in dark prisons of suffering.\nReturning to the origin, restoring the primordial, it revives life,\nSo that all may ascend at every moment.\n\nImpurities arise from the mind’s obscurity,\nThe three paths and five sufferings burden form and soul.\nWhen the light of Heaven washes away the roots and dust,\nImmortal transformation dawns as one bows to the Supreme.\n\nGradually entering non-action, attaining the Dao’s essence,\nNot a speck of dust clings, the mind is perfectly attuned.\nGlancing back at the three thousand realms below,\nAll dharmas dissolve into emptiness.\n\nThe Great Dharma Body, formless and traceless,\nNeither born nor destroyed, is called the Perfected True One.\nThough countless kalpas of stone wear away,\nIts tranquil divine radiance remains ever bright.\n\nAfter traversing the arduous roads of life’s passes,\nThis time, joy comes with one’s name on the golden tablet.\nWho can restrain the aspirations of a true man?\nReturning in glory, one rides freely like a team of four horses.\n\nTo study the Dao, rely on abundant wisdom,\nLest the clear river swell with wind and waves.\nMelt the heart and enter beyond the cinnabar clouds—\nWhat can the spears and halberds of the world do to me?\n\n**Preface to the *Scripture of Transformative Enlightenment from the Nine Heavens***\nComposed by the Perfected Lord of Merit-Gathering at the Northern Bureau\n\nThis scripture was proclaimed by the Golden Mouth of the Most High,\nSolely to save beings in the final kalpa.\nUpon concluding the discourse, it was entrusted by jade decree\nTo be stored in the Jade Palace’s inner sanctum.\n\nA command was issued to all heavens to propagate its teachings,\nAnd all Perfected Ones to transmit it accordingly.\nThus, it was transmitted and descended to eight altars,\nYet only Shaoxi’s numinous response saw it gathered and printed,\nWhile others merely copied and recited it.\n\nThe people of Dingzhou excel in goodness beyond other prefectures,\nAnd the transformative enlightenment of the Great Emperor is most profound in this land.\nMy own incense offerings have continued for over a decade,\nUnmixed and unwavering from beginning to end.\nOnly Wenchang’s numinous response has been particularly commendable here, descending to transmit it.\n\nMoreover, I urge the faithful to carve blocks and print it for distribution—\nNow, fortunately, the task is complete.\n\nAlas!\n\nAll who appear in the green registers and receive this scripture—are they not those who seek life and wish to escape the sufferings of war, plague, and pestilence? Yet I say: merely receiving the scripture is not enough; one must recite it to be sufficient. And even reciting it is not enough; one must practice it to be complete.\n\nWhat is practice? It is filial piety, fraternal duty, loyalty, obedience, impartiality, and forbearance. These are not difficult—they are merely the three words: *abide in one’s proper place*. Such are my words. They can dispel the kalpa’s tribulations. Whether you doubt or believe, what have I to do with it?\n\n**Rites for Recitation**\nWhen reciting the scripture, one must fast and bathe, don fresh and pure garments, enter the chamber, light incense, knock the teeth nine times, and bow in the heart to the Nine Heavens. Visualize the Primordial Heavenly King of the Origin and the host of exalted Perfected Ones, the Seven-Curved Great Emperor of Transformative Enlightenment, and the immortal officials descending to the dharma assembly, all arrayed in the void. Only then recite the incantations.\n\n**Incantation for Purifying Heart and Mouth**\nSpirits of the cinnabar pearl mouth, expel filth and disperse miasma.\nSpirit of the tongue, rectify order, connect life and nourish the spirit.\nSpirits of the thousand teeth, repel evil and guard the true.\nSpirit of the throat, fierce as a tiger, extend *qi* and draw forth essence.\nSpirit of the heart, cinnabar origin, let me commune with the true.\nContemplate the spirit, refine the fluid—may the Dao’s *qi* endure forever.\nSwiftly, swiftly, as the law commands!\n\n**Incantation for Purifying the Body**\nNuminous Treasure Heavenly Worthy, pacify and comfort this bodily form.\nDisciples’ souls and spirits, five viscera in profound darkness,\nAzure Dragon and White Tiger, arrayed in splendid ranks,\nVermilion Bird and Dark Warrior, attend and guard my true self.\nSwiftly, swiftly, as the law commands!\n\n**Incantation for Purifying the Three Karmas**\nWithin this body’s inner realms, thirty-six thousand beings dwell.\nIn movement, action, concealment, and retreat—through kalpas past and future—\nMay this body ever abide in freedom, ever dwell within the Three Treasures.\nWhen the kalpa collapses, may this body never perish.\nAs this incantation is recited, may the three karmas be wholly purified.\n\n**Incantation for Dispelling Filth**\nEssence of the Great One, blossom of the Well Star,\nFlowing to bathe the body at noon, sweeping filth and expelling evil at dusk.\nPure as a luminous pearl, immaculate as a lotus blossom,\nTransform into a body of golden light, step upon clouds of brocade and rosy dawn,\nAscend the seven-jeweled hall, become a true immortal.\nSwiftly, swiftly, as the Nine Heavens’ Transformative Sovereign, the Primordial August Emperor commands!\n\n**Incantation for Purifying Heaven and Earth**\nHeaven and Earth in primordial chaos, foul *qi* disperses like petals.\nWithin the cavernous void, radiance illumines the Great Origin.\nThe Three Clarities’ jade decrees, light shines upon the nine thoroughfares.\nMighty spirits of the eight directions, let me be as nature intends.\nNuminous Treasure talismanic command, proclaimed throughout the Nine Heavens.\n*Gan luo da na*, penetrating the stellar pivot of the Great Mystery,\nSever demons, bind evil, slay ten thousand ghosts.\nIncantation of Mount Zhong, jade script of the Origin.\nRecite once to repel ghosts and prolong life,\nPressing forth to the Five Peaks, known to the Eight Seas.\nDemon kings bow their heads, attending my chariot.\nMalevolence and filth swept clean—may the Dao’s *qi* ever abide.\n\n**Incantation for Purifying the Altar**\nWhen the Most High preached the Dharma, golden bells chimed five notes.\nAll filth hid in the ninefold earth; demon hordes guarded the *qian* grove.\nHeavenly flowers scattered as Dharma rain; Dharma drums shook the deluded from slumber.\nAll heavens rejoiced—how excellent! Golden youths strummed jade zithers.\nMay the eight rosy dawns’ radiance pour forth, illuminating my heart of refuge.\nSwiftly ascend the great Dharma bridge, soaring to the depths of the five clouds.\nSwiftly, swiftly, as the law commands!\n\n**Incantation for Pacifying the Local Deity**\nThe Origin establishes and pacifies, proclaiming to the ten thousand spirits.\nTrue officials of mountains and rivers, numinous deities of the land,\nAltars to the left, millet to the right—let none dare recklessly disturb.\nTurn toward the true Dao, within and without made solemn and pure.\nEach abides in its proper place, guarding the imperial court in readiness.\nThe Most High has decreed: hunt down and capture demonic essences.\nDharma-protecting divine kings, safeguard the recitation of scriptures.\nTake refuge in the Great Dao—*yuan*, *heng*, *li*, *zhen*.\nSwiftly, swiftly, as the law commands!\n\n**Incantation of the Five Stars**\nThe Five Stars array their radiance, shining brilliantly in the five directions.\nWater engenders and averts disaster; Wood’s virtue brings prosperity.\nMars dissolves calamities; Venus repels warfare.\nSaturn stabilizes the four quarters—household and state flourish and prosper.\nNames inscribed on jade tablets, characters recorded in the imperial chamber,\nRiding the whirlwind, fanning the light, soaring through the great void,\nEmerging and entering the unseen, roaming and feasting in the ten directions.\nFive-colored clouds float as canopies, summoning spirits and commanding winds,\nCommanding the ten thousand spirits, above to protect the immortal elders.\n\n**Opening the Brazier**\nMost High True Lord of the Three Heavens’ Primordial Origin, Three *Qi* of the Great Shang, Lord Lao, summon forth the thirty-six officers of the Three and Five Merit Officials within our bodies, the left and right attending envoys, the incense-bearing dragon-riding couriers, the incense-attending Golden Youths, the message-transmitting and flower-scattering Jade Maidens, the Five Thearchs’ direct talismans and daily incense officials—thirty-six each, emerge!\n\nSilently visualize them emerging in solemn attire, opening the gates. Here, on this land’s true officials’ domain, where we burn incense and recite scriptures, Golden Youths waft smoke, numinous consorts scatter flowers, and the true sages of the Three Realms gather before our chariot.\n\nWe humbly pray: after reciting this scripture, may true *qi* circulate throughout,\nAbove, to protect and preserve the ancestral altars, pacify and serve the emperor, dispel disasters of war, water, and fire, and eliminate plagues of pestilence, drought, and locusts;\nIn the middle, to extend longevity, protect and bless the entire household, dissolve the nine stars’ and eight difficulties’ misfortunes, and free them from the burdens of the five sufferings and three calamities;\nBelow, to inscribe names in the black ledgers, release them from the ghostly realm, ascend the seven ancestors to immortality, and enable the deceased to attain the Dao.\n\nNext, we pray for the people of different surnames: may they ride the scripture’s Dharma to flourish in ten thousand blessings; for the creatures of mountains and marshes: may they feel the sagely merit and all transcend to the Dao’s shore. May we be spared from illness and calamity, our thoughts ever turned to the true and the Dao, our minds cleansed and hearts stilled, aspiring to ascend lightly. Aiding others and benefiting all beings, establishing merit as the foremost task—whatever we pray for, may it swiftly be granted, known throughout heaven above and earth below.\n\nMay the life-*qi* of the Most High’s Ten Directions’ true and upright ones descend, flowing into our bodies, so that our entreaties swiftly reach the boundless Great Dao’s Three Clarities, the August Jade Thearch of the Vast Heaven, the Divine Literary Martial Filial Virtuous Loyal Benevolent King of Zitong, and the Great Merciful Savior of the Kalpa, the Ever-Living Heavenly Worthy of Renewed Life before the throne.\n\n**Incantation for Gathering Spirits**\n\nThe Primordial Origin’s Great Perfection, the Five Thunder’s Lofty Venerables.\nThe Grand Hua’s radiant brilliance illumines the Eight Gates with penetrating clarity.\nThe Five Elders proclaim their mandate—no hidden realm remains unheard.\nAbove, they govern the Nine Heavens; at the center, they command Mount Feng;\nBelow, they pacify rivers and seas, the twelve water sources.\nThe Eight Mighty Spirit Incantations, the numinous talismans of jade script,\nSummon dragons to bring rain, gather *qi* and condense mist.\nSun, moon, and the five stars; the Northern Dipper’s seven origins.\nThe Luminous Celestial Thearch unites them, decreeing the descent of the Supreme Mystery,\nProclaiming might through the Three Realms—none dare delay.\nAll heavens, all earths, all waters, all mountains,\nThe jade perfected ones’ legions, the vast and profound great spirits,\nThe Transcendent Kings at their feasts, the great marshals bearing banners,\nHeavenly soldiers clearing the way before them, golden tigers charging behind,\nFierce beasts of the Jue Heaven arrayed, guarding the four gates.\nWhat is called arrives instantly; what is summoned appears at once.\nThe vermilion writs blaze forth, wind and fire unceasing.\nRegisters are seized in response to command, golden horses speed the transmission.\n\nHere ends the first scroll of *The Supreme Mystery’s Comprehensive Perfection of Wenchang’s Great Cavern Scripture of the Dao*.\nHere begins the second scroll of *The Supreme Mystery’s Comprehensive Perfection of Wenchang’s Great Cavern Scripture of the Dao*.\n\nGan Mountain’s Mowei Cave Master, the Supreme and Unsurpassed Highest Virtue Perfected Lord of the Great Mystery, having collated and rectified, now offers incense.\n\nWe bow in reverence, as auspicious winds and nurturing rains gather the numinous essence of the Five Fragrances; as boundless virtue and perfect benevolence witness the sincerity of a single wisp. This may traverse the boundless, called the smoke that is no smoke. Relying on this misty qi, we universally extend our offerings—one mind in utmost reverence, ten thousand spirits gazing from afar.\n\nMay the golden key be opened, and the jade scriptures be exalted. We pray that sacred radiance be dispersed, that Brahma’s voice resound clearly; that the dead receive rebirth, that the living attain deliverance; that no wish go unfulfilled. All beneath Heaven’s canopy, all upon Earth’s embrace—those with karmic affinity shall all realize enlightenment.\n\nWe now raise our invocation in verse:\n\nEach awakens the utmost sincere heart,\nWishing to enter Wenchang’s Assembly of Fortune and Lineage.\nWe take refuge in the Three Treasures and all patriarchs,\nHoping only for compassion’s constant embrace.\n\nWe look up to the Three Clarities’ realm,\nTo the supreme lords of the Three Realms.\nThe Primordial Beginning’s Great Dharma King,\nThe Most Compassionate True Master of Teachings.\n\nThe Jade Emperor’s Great Dao Lord,\nFather of the Great Mystery’s True Dao.\nWe look up to the Great Canopy Heaven,\nTo the supreme lord of the Mysterious Vault.\n\nWe look up to the Three Clarities’ realm,\nTo the assembled perfected hosts attending the Celestial Throne.\nCang Hu’s precious pearl,\nFrom which the Great Cavern Scriptures were woven.\nThe wondrous Dao defies thought;\nJade verses give birth to ten thousand spirits.\n\nThe Most Compassionate Primordial Beginning Venerable,\nWhose golden image emerged from the earth’s portal.\nManifesting as three divine persons,\nWho in hempen robes bestowed golden treasures.\nIn dreams, two scrolls were tucked into sleeves—\nRegisters and methods both transmitted.\nTransformations revealed Wenchang,\nResponding to wishes with numinous efficacy.\n\nWe now purify the Three Karmas,\nSevering forever the roots of blood and corpse.\nBearing the talisman, we enter the Jade Capital,\nKowtowing at the Golden Gate.\nWith whole heart, we prostrate in homage,\nTo the Primordial Beginning’s Great Dharma King.\nWe pray only for great compassion,\nTo receive our petition.\n\nMay our silent contemplation,\nMerge with the talisman before the Emperor’s Unity.\nTranscending the Yellow Court’s immortal realm,\nTogether we ascend beyond the Great Wilderness.\nMay our seven ancestors sever their dark entanglements,\nReceiving audience with the Jade Emperor.\nWhen we recite and intone,\nMay the hundred spirits all assemble.\nMay the sound penetrate the ten thousand heavens,\nIts resonance reaching the nine earths.\nMay all wishes be fulfilled,\nAs the scriptures proclaim.\nHenceforth, may we gradually cultivate,\nAttaining the Dao and serving the sages.\n\nAll scripture-assembly’s filial friends,\nPledge their original resolve like metal and stone.\nWith each bow and each invocation,\nWe take refuge in the Lord of the Seven Bends.\nWe visualize the Azure Beginning Heaven,\nThe Primordial Long-Life Mother.\nWe visualize the Purple Cloud Crag,\nWenchang’s true land.\nThe post-celestial compassionate parents,\nManifesting in the Osmanthus Fragrance Palace.\nFilial sons and loving grandsons,\nImmortals arrayed to attend their compassionate countenance.\n\nWe pray to receive the true faith’s rites,\nTo release the great wish-fulfilling radiance.\nResponding to hearts and dreams alike,\nBestowing lineage and storing blessings.\nMay we serve our compassionate kin,\nLifetimes of honor with crane-plumed hair.\nMay we encounter sagely times,\nEach step graced with abundant favor.\nWherever we dwell in life,\nMay thoughts summon the wish-fulfilling radiance.\nMay our good karma ripen,\nThat we may early awaken to the true Dao.\nMay our karmic defilements dissolve,\nThat our minds alone reach the Pure Land.\nUniversally with all beings of heaven and earth,\nMay we realize good fruits according to our capacities.\n\nOne true heart like metal and stone,\nA true heart taking refuge in the Emperor Lord.\nAll sages and all heavenly venerables,\nTogether we offer the incense of the heart in praise.\nWith all scripture students,\nWe wholeheartedly take refuge and bow in homage.\n\nWith utmost sincerity, we bow in homage to:\nThe Jade Clarity’s sacred realm, the Clear and Subtle Heavenly Palace, amidst the Yu Luo Xiao Terrace, above the Sen Luo Pure Abyss—manifesting a Brahma-like form, possessing boundless divine powers. Expounding the true and mysterious, shattering the obstructions of being and non-being, color and emptiness; delivering all classes of beings, erasing distinctions of wisdom and folly, high and low. Its wondrous workings defy fathoming, its numinous mechanism beyond measure.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Boundlessly Delivering Primordial Beginning Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Highest Clarity’s true realm, the Yu Yu Heavenly Palace, amidst the Purple Tenuity’s Jade Terrace, above the Mysterious Capital’s Jade Capital—continuing the lineage of the Primordial Beginning’s Void Sovereign, surpassing the root and sprout of the Western Na Jade Realm. Entering the millet-like pearl, fully drawing the essence of the true and mysterious; dwelling in the Fragrant Grove Garden, repeatedly discoursing on the secret essentials’ fish-traps and rabbit-snares. Its wondrous virtue defies thought, its divine powers defy discussion.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Boundlessly Delivering Numinous Treasure Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Grand Clarity’s immortal realm, the Great Crimson Heavenly Palace, towering high in the Golden Gate, far above the layered clouds—incarnated through countless kalpas, expounding the Dharma to the twelve thousand heavens. Five thousand secret words, fusing the wondrous Dao of the Three Powers; over eighty salvific methods, receiving the beings of the Six Destinies. Its sagely virtue lofty, its mysterious merit vast.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Boundlessly Delivering Dao and Virtue Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Purple Gold’s Golden Gate, the White Jade’s Jade Capital—dwelling in the realm of wondrous being, abiding in the Heaven of Mysterious Truth. Having perfected merit and completed the Dao, thus the wondrous Dao stands preeminent among all heavens; with a broad mind and expansive body, thus compassion’s light universally illumines the Three Realms. In rank, supreme and unsurpassed; in Dao, mysterious and ever more mysterious. The true sage, patriarch, and master—on whom heaven and humanity rely.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Vaulted Heaven’s Sacred Lord Jade Emperor Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Han dynasty’s stalwart minister, whose family served the Han for generations—wielding a three-inch tongue to become the emperor’s teacher, receiving a single scroll to become humanity’s paragon. His body never toiled in military campaigns, yet his merit was recorded in the Vermilion Registers. Formerly encountering the Yellow Stone Elder, he rooted himself in the land of divine immortals; later following Red Pine Master, he ascended to the Great Existence’s court. His favor exalted as the supreme minister, his position steadfast as the Heavenly Pivot’s guardian. He revealed the Three Caverns’ true scriptures in detail, bestowed the glory of the Nine Radiant Precious Nodes. Praised through the ages, extolled by all heavens.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Collator and Lord of Scriptures, the Dao-Sublime and Sage-Surpassing Highest Great Virtue Venerable Heavenly Emperor Dharma Lord Dao Lord Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Supreme Void of the Northern Ascension, the Ever-Fused Heaven, the Silent Void’s Mysterious Brahma Realm; the Supreme Unity’s True Celebration Palace; the True Mystery’s Highest Sage, the Nine Heavens’ Roaming Ensign; the Great General of the Left-Guarding Celestial Pole’s Right Wall; the Supreme Ultimate’s True Lineage, the Great Mystery’s Compassionate Father, the Numinously Penetrating Great Wondrous Immortal; the Eight Might and Nine Radiance’s Sacred Holder of the Qian Yuan Emperor; the Heart Seal’s Bearer of the Yin Spirit’s Dipper Talisman; the Supreme Dark Warrior’s Right Assistant Controller; the Left-Guarding Sacred Mansion’s Court—who vows to sever demonic forces, to rescue and protect all classes of beings, to uphold the kalpic destiny, to govern the ten thousand spirits. His awe-inspiring virtue boundless, his divine powers vast and pervasive. Patrolling the Ten Caverns, inspecting all heavens; blessing the filial and loyal, exterminating calamitous harms.\n\nThe Most Sage, Most Divine, Most Marshal-like, Heaven-Pacifying, World-Blessing True Martial, Jade Void’s Preceptor and Minister, Purple Emperor Heavenly Unity Perfected Lord, Mysterious Heaven’s Benevolent and Majestic Clear and Subtle Supreme Emperor, Golden Gate’s Manifested Heavenly Venerable.\n\nWith utmost sincerity, we bow in reverence to the venerable one dwelling in the blessed land of Gan Mountain, within the Mowei Grotto-Heaven. From a single qi, rooted in the Purple Tenuity’s manifestation, he ascends to the Golden Gate’s Nine Radiances, communicating the vital essence of the Azure Vault. He expounded the Six-Chapter Scripture, refining mortals into sages, and extolled the Wanshou Abbey’s restoration of ancient teachings to enlighten the present. Upholding humanity’s ultimate principle, he awakens the earth’s numinous spirits. His Dao vast beyond naming, his merits too lofty for discourse—great in benevolence, great in filial piety, great in sageliness, great in compassion—he is the Nine Heavens’ Venerable Elder, the Repository of Fortune and Ordainer of Destiny, the Supreme Dao’s Peerless and Most Virtuous Perfected Lord, the Mysterious and True Lord of Myriad Blessings, the Heavenly Venerable.\n\nWith utmost sincerity, we bow in reverence to the one originally of the southern lands, who journeyed upstream to Shu’s capital. First, he obtained the Yellow Emperor’s Nine Cauldrons’ cinnabar scriptures; later, he served the Old Lord. Twice at the Jade Bureau, he received the thousand-scroll essentials of cultivation, swiftly mastering the arts of ingestion and exhalation. His registers of the Dao complete, he swore the oath of the Alliance’s威 ranks and sealed the Linjue covenant. Discerning right from wrong, he seized the Court of Fortune’s governance to transform the Springs of Harmony. His virtue perfected in the Great Elixir, his Dao aligned with the Seven Governors—great in compassion, great in vow, great in sageliness, great in compassion—he is the Three Heavens’ Prime Minister, the Mysterious Capital’s Venerable Elder, the Heavenly Master who Upholds the Teaching and Delivers Beings, the Orthodox Unity’s Assistant to the Origin, the Embodied Dao’s Profound and Mysterious Divine Transformation, the Tranquil and Manifest Protector Perfected Lord, the Six Harmonies’ Boundless and Lofty Illustrious Great Emperor, the Demon-Quelling and Dao-Guarding Heavenly Venerable.\n\nWith utmost sincerity, we bow in reverence to the everlasting pillar of history, who in the Tang dynasty transformed through the Mysterious. Acquiring wondrous arts to preserve his spirit, he cast off worldly clamor and wearied of service. Mastering the radiant great Dharma of Light and Flower, he awakened to the true mechanism of the myriad existences. His bones ever immortal, he left the trace of a horse leaping into the abyss; his forgiving heart adjudicated cases, bringing forth the auspicious omen of a rat flying through the window. Bestowed the Red Dragon’s Elixir, styled the Azure Paulownia Master—great in compassion, great in vow, great in sageliness, great in compassion—he is the Three Heavens’ Secondary Minister, the Nine Qi’s Venerable Elder, the Cinnabar Forest Great Emperor, the Heavenly Venerable who Adapts to Circumstances and Reveals Transformations.\n\nWith utmost sincerity, we bow in reverence to the one born in the Han house, ennobled in the Jin dynasty. Solemnly deploying qi to subdue evil, he once swallowed a tiger to save the world. Holding the Jade Empyrean’s Pure Grotto Dharma, he transmitted the Dark Altar’s Inner Teachings’ scriptures. Presiding over the Thunder Bureau’s judicial and executive affairs, he assumed the Heavenly Master’s office, ascending to the Purple Tenuity Heaven’s Right Minister’s rank. Adjudicating the Dongyang Palace, he governs the Primordial Unity’s Teaching—great in compassion, great in vow, great in sageliness, great in compassion—the Boundless True Origin’s Pure August Emperor, the Nine Heavens’ Protector and Registrar of Destiny, the Heavenly Venerable.\n\nWith utmost sincerity, we bow in reverence to the one whose virtue shone in Ba Gorge and whose traces were concealed by the Yu River. In youth, his name was inscribed on the golden tablet; in person, he received the jade steps’ crown and robes. Halting slaughter in response to the Frost Terrace’s dream, he manifested his majesty in the sun’s countenance. Awakening to the Supreme Vehicle to exhort goodness, he befriended and aided the great master. Investigating the Dao of true constancy, he temporarily assumed the role of Chongtian Abbey’s abbot to lecture and refine his virtue, receiving the imperial commendation for benevolent relief. His divine merits unfathomable, he stabilized the nation’s destiny and revived its fortunes, opening a renewed heaven for Shu’s people. His grace extended to all beings, his virtue exalted for a hundred generations—great in compassion, great in vow, great in sageliness, great in compassion—the Manifested Perfected of Bishan, the Heavenly Emperor of the Luminous River Child.\n\nWith utmost sincerity, we bow in reverence to the Holy Ancestral Mother, born on the fifth day of the tenth month. At the Beginning of the Azure Heaven’s Primordial Mandate’s transformation, the first qi had not yet dispersed. She contained the essence of the Seven Bends’ true origin; at the Nine Heavens’ inception, she embraced the completeness of the Three Luminaries’ refined body. Her phoenix mechanism bore no traceable sign; her crane-like nature aspired to purity beyond discourse. The compassionate mother prior to Heaven and Earth, her graceful countenance timeless—when yang returned on the tenth month’s fifth day, she became the spring of the teaching that expounded the Three Bonds and Five Constants. Her longevity everlasting, her form endowed with primordial essence, she perused the prefaces and postscripts of her collected deeds, yet the Beginning of the Azure Heaven’s enlightenment remains unfathomable—great in compassion, great in vow, great in sageliness, great in compassion—the Seven Bends’ First Kalpa’s Form-Conferring, Longevity-Granting Mother, the Primordial Lady of the Great Ultimate.\n\nWith utmost sincerity, we bow in reverence to the Holy Father, born on the eleventh day of the second month. In the fragrant osmanthus palace, the Upper Palace of Literary Prosperity, his Dao-body perfectly formed, he contained the transformations of ninety-odd lives. His true origin yet concealed, he stored the essence of thirty-six thousand years. Unfolding the phoenix script of post-Heavenly agelessness, he received the Azure Empyrean’s unfathomable dream-state. The great compassionate father of the divine father, the supremely good man among perfected beings—his pulse the root of the Three Bonds and Five Constants, his heart the vessel of a hundred deeds and myriad virtues. Devotion to him knows no end; how could praise ever cease? Great in compassion, great in vow, great in sageliness, great in compassion—the Seven Bends’ Holy Father, the Manifestly Blessed, Compassionately Protective, Benevolent and Prosperous, Commanding Virtue King, the Primordial Great Emperor of Mysterious Inception, the Fruit-Attaining, Longevity-Granting King Bodhisattva, the Heavenly Venerable who Propagates Blessings and Extends Fortune.\n\nWith utmost sincerity, we bow in reverence to the Holy Mother, born on the seventh day of the seventh month. In the fragrant inner palace, the Auxiliary Palace of Literary Prosperity, her virtuous nature harmonious as spring, she contained the pure qi of the Great True One. Her clear radiance deep as autumn, she nurtured the Seventh Night’s luminous essence. Embracing the dragon’s image before its dispersal, concealing the phoenix’s mechanism before its revelation—great compassionate mother of the Sword Spring, supremely good woman of Penglai—she produced the bonds of ten thousand generations, gave birth to the teachings of the Nine Heavens. Devotion to her knows no end; how could praise ever cease? Great in compassion, great in vow, great in sageliness, great in compassion—the Seven Bends’ Holy Mother, the Illustrious Virtue-Accumulating, Blessing-Inheriting, Compassionate, Reverent, and Gracious Empress Dowager, the Fruit-Attaining, Treasure Radiance Bodhisattva, the Lady who Inherits Blessings and Stores Fortune.\n\nWith utmost sincerity, we bow in reverence to the Primordial August Emperor, born on the third day of the second month. In the fragrant osmanthus palace, the Upper Palace of Literary Prosperity, through ninety-six lives, he sowed the fruits of goodness in the garden of poetry and books. Through a hundred thousand myriad transformations, he cultivated the osmanthus root in the field of hidden merits. From the Thunder Loom’s illumination on Phoenix Mountain to the Auspicious Storage of Wishes on Turtle Peak, he opened human hearts, grounding them in the filial piety of profound kinship. To prolong the nation’s pulse, he first instilled loyalty to the sovereign. Responding to dreams to protect life, he extended compassion to the suffering. Unassuming in the Jade True Blessing Palace, he manifested ninety-eight transformations in concealment and revelation, displaying divine marvels across billions of kalpas. Wherever the flying phoenix spread teachings, altars were established; aiding the nation and saving the people, all received his virtue. His merits endure in the teachings of Confucianism, Daoism, and Buddhism; his office fulfills the duties of the Heaven, Earth, and Water Officials. His awe-inspiring spirit defies measure; his meritorious deeds surpass thought—supremely benevolent, supremely filial, neither joyous nor proud.\n\nGreat Sage, Great Compassion, Great Mercy, Great Vow, Divine Writ, Sacred Martial, Filial Virtue, Loyal Benevolence King; King of the Playful Samādhi of the Unmoving Realm of Peace; Bodhisattva of Attained Fruition, Guardian of the Śākya, Brahmā, and Tathāgata, Great Compassionate Savior of Kalpas, Ever-Renewing Eternal Life Heavenly Worthy.\nWith utmost sincerity, we pay homage and bow in reverence.\n**Birthday of the Sacred Empress: the third day of the fifth lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHer virtuous model was pure as ice, cupping the serene moon of the nine heavens; her benevolent heart, spring’s essence, fanned the family tradition of the Seven Peaks. Her graceful bearing attended the inner chambers of her parents; her kindness and gentleness fulfilled the Way of motherhood. Harmony filled the hall above and below; she was the eternal spring pavilion of past and future ages. Responding to dreams to nurture auspiciousness, she manifested transformations from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Empress of the Seven Peaks; Reverent, Obedient, Gentle, Responsive, Virtuous, Kind, Illustrious Empress; Bodhisattva of Attained Fruition, Tranquil Harmony, Mysterious Wonder, Primordial Lady.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Eldest Son: the third day of the third lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHis sacred virtue was kind and auspicious, a single thought inheriting the family’s pulse; his divine works shone brightly, easing the heart of his imperial father across the nine heavens. Amidst the clouds of play, he detailed the formless, soundless rites of music; in the moon’s cavern, he transmitted the established, regulated legacy of his forebears. He bestowed the five blessings upon generations of benevolent, filial households; he inscribed the three firsts upon the flourishing descendants of poetry and books. Establishing teachings from the heart, responding to dreams to nurture auspiciousness—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Eldest Son, Heir of Virtue and Treader of Filial Piety; Evolver of the Pure and Subtle Heavenly Emperor; True Lord of Flourishing Literary Destiny.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Eldest Daughter-in-Law: the first day of the eighth lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHer gentle nature was spring’s softness, her pure gracefulness adorned her service; her true heart was jade’s purity, embodying the lofty virtue of her model. She complemented the family’s revered tradition of the eldest son; silently, she mastered the inner principles of harmony. Her teachings flowed with kindness and brotherly love; her transformations harmonized with tranquil harmony. Responding to dreams to nurture auspiciousness, bestowing blessings from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Eldest Daughter-in-Law; Virtuous Assistant, Illustrious, Obedient, Filial Lady; Mysterious True Wondrous Consort; Heavenly Lord of Serene Literary Response.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Son: the first day of the first lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nFather and son, one family, fully embodied the Way of filial piety and kindness; ruler and minister, through a thousand generations, fulfilled the hearts of benevolence and reverence. A model for humanity and heaven, he established teachings upon the fundamental principles; a standard for the world’s path, he rooted his conduct in the poetry and rites of the family courtyard. He rectified decay in the field of hidden virtue; he brought fortune through humility in the garden of cultivated arts. Manifesting transformations from the heart, responding to dreams to nurture auspiciousness—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Son; King of Established Filial Virtue and Flourishing Power; Evolver of the Wondrous Perfected Heavenly Emperor; True Lord of Literary Fortune.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Daughter-in-Law: the eighteenth day of the second lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHer filial virtue was modest and gentle, endowed with the pure essence of the primordial origin; her true heart was earth’s compliance, gracefully embodying the inner bearing of the Seven Peaks. Before the Five Wives’ Ridge, she upheld the splendid canon of inquiring after well-being; upon the Three Tides’ Waters, she flowed the clear source of accumulated blessings. Responding to dreams to nurture auspiciousness, manifesting transformations from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Daughter-in-Law; Assisting, Obedient, Kind, Illustrious, Filial Lady; Jade True Wondrous Responsive Consort; Heavenly Lord of Inherited Literary Blessings.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Virtuous and Filial Princess: the sixteenth day of the fourth lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nThe toad’s moon congealed auspiciousness, rooted in her father’s loving kindness; the phoenix’s heart gathered fortune, cultivated by her mother’s harmonious virtue. Her bearing was pure as frost and snow, unattached to worldly things; her embrace was spring’s wind and autumn’s moon, naturally attuned to heaven. Inwardly observing the emptiness of ten thousand realms from childhood, she attained the Dao of the nine heavens. Her heart’s clarity defied discussion; her gentle virtue eluded description—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Daughter; Gentle, True, Wondrous, Serene, Virtuous, Filial Princess; True Person of the Mysterious Origin; Heavenly Lord of Myriad Longevities of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Eldest Grandson: the third day of the seventh lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHis heavenly bearing was awe-inspiring, his Dao’s standard purified the family’s tradition; his noble character was upright, his benevolent renown renewed the governance of transformation. Thunder resounded amidst spring’s harmony, awakening all; rain and dew pervaded the heavens, nurturing all things. Responding to thoughts to nurture auspiciousness, his divine radiance answered dreams—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Eldest Grandson; Marquis of Illustrious Response and Filial Piety; Heavenly Lord of Perfect Jewel Flourishing; True Person of Accumulated Blessings of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Eldest Granddaughter-in-Law: the twenty-eighth day of the first lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHer sacred nature was a heavenly bearing, pure as spring’s embrace; her immortal demeanor was the Dao’s standard, revealing the clarity of autumn’s moon. Four generations under one roof, her inner bearing was dignified and harmonious; a hundred deeds and ten thousand virtues, her family’s blessings were meticulous and profound. Her divine radiance responded to dreams, transforming in accord with the moment—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Eldest Granddaughter-in-Law; Gentle, Responsive, Illustrious, Filial Lady; Mysterious True Serene and Pure; Heavenly Lord of Accumulated Blessings of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Grandson: the thirteenth day of the tenth lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHis words were spring’s wind in conversation, each character nurturing benevolence; his demeanor was harmonious, every word transmitting the family’s laws. He inherited the heart of the sacred son, cultivating roots in hidden virtue; he continued the body of the divine grandson, attaining the fruition of true immortality. Responding to dreams to nurture auspiciousness, establishing teachings from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Grandson; Marquis of Inherited Response, Illustrious, and Filial Obedience; Heavenly Lord of Wondrous Clarity of Ancestral Virtue; True Person of Inherited Blessings of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Granddaughter-in-Law: the twenty-third day of the seventh lunar month.**\n\nWithin the osmanthus-scented inner palace, the Literary Flourishing assists the official duties. Her jade-like essence and golden bearing were the very soil where her parents’ careful cultivation took root; her grace and radiance shone like the transforming sun, the very heaven where descendants’ lineage would perpetuate. She nurtured the roots of hidden virtue, her inner resources mutually awakening; she extended the mandate of cap-and-robe, her gentle emergence mutually completing. Responding to dreams to nurture auspiciousness, adapting to circumstances to unfold transformations—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Granddaughter-in-Law; Lady of Kindly Response and Embodied Filial Piety; Heavenly Lord of True Origin, Cultivated Essence, Literary Flourishing, and Inherited Blessings.\nWith utmost sincerity, we pay homage and bow in reverence.\n\nTo the assisting deities of Literary Flourishing: Heavenly Compliant True Lord of the Great One; True Lords of the Three Mao who Govern Life; Lord of Emoluments, Duke Dugu, Left Controller of the Civil Register; King of Prosperity and Peace, Right Controller of the Martial Register, Heroic, Loyal, and Winged in Aid; Marshal of Twin Pines Reporting Auspiciousness; Immortal Officials of the Two Osmanthus and Emolument Registers; Jade Boys and Jade Maidens; Flying Phoenixes in attendance; the Heavenly Deaf and Earthly Mute serving at left and right; the Three Immortals of the Northern Bureau assisting the jade ritual altar; the Cloud, Thunder, and Rain Departments; all the Immortal Worthies and Sages; and all the true lords who assist the Dao.\n\nThe rites of praise now complete, we rely upon your light to repent:\nSeven-Curved Merciful Venerable, true master of the teaching,\nMerciful father, merciful mother, born together with me.\nChildren born as sacred children are all filial and kind;\nGrandchildren who continue as divine grandchildren are all kind and filial.\nOne family’s harmonious qi knows no end;\nFor ten thousand generations, the moon shines upon the spring terrace.\nMerciful light universally illuminates all heavenly beings,\nSubtly entering the tiniest dust to fill heaven and earth.\nMy life shares the same body as heaven and earth,\nJust like Literary Flourishing at the beginning of kalpas.\nThe sacred is not sacred of itself, nor the ordinary ordinary of itself—\nOnly after drifting to this day do we awaken.\nMay we encounter the teaching of the Seven-Curved Merciful Venerable,\nDevoted to loyalty, to filial piety, to a merciful heart.\nNot with verbal karma to scorn gods and humans,\nNot with bodily karma to burden parents,\nNot with mental karma to deceive heaven and earth,\nNot with heart karma to bring calamity upon descendants.\nMay we follow filial conduct and hidden merit,\nPracticing all manner of skillful means in every direction.\nRepenting and redeeming the stains of many lives’ transgressions,\nWe take refuge in the primordial sovereign’s great merciful light.\nSeeking descendants, seeking emolument, seeking the means of life—\nWe seek not from others but from ourselves.\nOnly our teacher, Literary Flourishing of the Seven Curves,\nThrough kalpas awaits others with the law of forbearance.\nMay you release a single wish-fulfilling light,\nCompassionately mindful of all beings in true repentance.\n\nRepentance now complete, we proceed to make vows:\nMay parents together attain the fruit of longevity,\nTortoise years and crane hair reflecting merciful light.\nMay I myself bow to great good fortune,\nHonoring those above and nurturing those below without suffering.\nMay descendants inhale the osmanthus of clouded cliffs,\nFlourishing together with me in fine splendor.\nFather’s kindness and children’s filial piety bring spring to the whole family,\nBrightness unbetraying the Merciful Venerable’s teaching.\nMay we receive the Seven-Curved One’s personal guidance,\nPointing the way to ascend as immortals and enter the Dao’s gate.\nAbandoning life and receiving life, perfectly and universally knowing,\nMay all be fulfilled through endless future kalpas.\n\nVows now complete, we proceed to praise:\nWithin the osmanthus-scented palace, host of benevolence and filial piety,\nYour teaching rain flows everywhere, washing away karmic roots.\nKarmic roots transform into osmanthus blossoms’ fragrance,\nGood roots planted to bear the fruit of longevity.\nOne family’s flesh and blood without affliction,\nSeven-Curved descendants together protecting and sustaining.\nUniversally vowing for this life and the next,\nBefore the Purple Cloud Cliff, attaining the Dao’s fruit.\nStep by step, heart by heart, at the Emperor’s side,\nLife after life, the heavens ordain.\nThough bones may be ordinary and the body reduced to ashes,\nA single point of true heart is naturally like metal and stone.\n\nThose who make such vows—on this day, the disciple of this locale, so-and-so, bows to the Primordial Heavenly King and the thousand true and ten thousand sacred beings, holding and reciting the *Great Cavern Immortal Scripture*, beseeching the granting of pardon for transgressions and forgiveness of sins, transforming misfortune into auspiciousness, severing evil roots, advancing in the Dao without demonic obstruction, enabling ancestors and parents to swiftly cross over to the Southern Palace, attaining rebirth in the Middle Land, and may all sentient beings of the family circle equally rely upon refinement. May disasters and calamities be extinguished. In presenting these humble entreaties, we presume upon your heavenly majesty, hoping for sympathetic resonance and gracious compliance with our requests. We humbly pray that the incense-attending messengers convey these sincere entreaties, universally making them known. We bow in reverence and take refuge:\nIn the Three Pure Ones, Heavenly Worthies of Response and Transformation.\nIn the Jade Pure One, Heavenly Worthy of Universal Transformation.\n\nThe Heavenly Worthy of Great Unity and Salvation from Suffering.\nThe Heavenly Worthy of the Celestial Pivot, Prime Minister and Dharma Lord.\nThe Heavenly Worthy of Salvation from Suffering at the End of Kalpas.\nThe Heavenly Worthy of Dispelling Disasters and Resolving Adversities.\nThe Heavenly Worthy of Thunder’s Universal Transformation.\nThe Heavenly Worthy of Mysterious Perfection and Myriad Blessings.\nThe Star Lords of the Dipper Mansion and the Celestial Ministries.\nThe Three Hundred and Sixty Heavenly Worthies of Response and Transformation of the Three Primes and Three Officials.\nThe Heavenly Worthy of Settling Light, Clarity, and Universal Salvation.\nThe Heavenly Worthy of Purple Purity and Conferring Blessings.\nThe Heavenly Worthy of Renewal and Eternal Life.\nThe Heavenly Worthy of Boundless Salvation of Beings.\nThe Heavenly Worthy of Universal Repentance of Sins.\nThe Heavenly Worthies of the Ten Directions and Numinous Treasure.\nMay the inconceivable merits and virtues inspire all beings to awaken and comprehend, to receive, uphold, transmit, and recite.\n\nThe August and Complete Titles of the Primordial Sovereign:\nGrand Preceptor of the Golden Watchtower, Inspector-General, Grand Preceptor of the Supreme Unity, Inner Assistant to the Three Pure Ones, Grand Marshal of the Great Supervisory Office, Commander-in-Chief of the Three Realms’ Yin Troops with Discretionary Powers, Overseer of the Prisons of Heaven, Earth, and Water, Holder of the Tiger Tallies and Dragon Credentials of the Five Marchmounts and Four Watercourses, Director of All Celestial Stars and Constellations, Arbiter of the Registers of Cassia and Emoluments, Supreme Perfected of the Primordial Sovereign of the Illustrious and Manifest, True Lord of the Bureau of Emoluments and Tribute, Perfected Lord of the Examination of Merit, Master of Penetrating Illumination and Perfected Communication, Compiler of the Registers of Flying Immortals, Keeper of the Primordial Wheel of Transformation and the Six Paths, Compassionate Sovereign of Salvation from Suffering and Deliverance from Difficulty, Pure and Tranquil Perfected of the Inner Realm of Jade Purity, Whose Body Manifests upon the Purple Cloud Crag, Who Holds a Jade Staff, Who Governs the Myriad Spirits and Universally Relieves All Sufferings, Great Benevolent, Great Filial, Great Sage, Great Compassionate, Supreme, Unarrogant, Joyfully Nurturing Heavenly Thearch, Commander-in-Chief of the Primordial Unity of Heaven, Lord of the Myriad Heavens Who Responds with Compassion to All Wishes, Heavenly Worthy of Response to Compassionate Vows, Heavenly Thearch of the Nine Heavens Who Stabilizes the Primordial, Protects Life, Upholds the Dao, Assists the Primordial, and Opens Civilization, Lord of Salvation of Beings and Ruler of Wenchang, Heavenly Thearch of Eternal Joy and Eternal Protection with Numinous Response, King of Concentration and Wisdom Who Governs the Five Lakes, Four Seas, and the Twelve River Sources, Water Bureau Commissioner, Bodhisattva Who Attains the Fruit of Buddhahood, Tathāgata of the Śākya, Brahmā, and Indra’s Realm, Who Settles the True, Contemplates Correctly, and Annotates the Registers of Emoluments, Heavenly Worthy of Treasure Light, Compassionate Response, Manifest Dao, and Governance of the World, Who Protects and Pacifies, Eradicates Sins, Renews and Grants Eternal Life, Upholds Goodness, Relieves Suffering, Dispels Kalpas, Enacts Transformation, and Manifests Pure and Unified Response.\n\nThe Second Scroll of *The Supreme, Boundless, Primordial, and Perfect Wenchang Great Cavern Sutra* Concludes.\n\nThe Third Scroll of *The Supreme, Boundless, Primordial, and Perfect Wenchang Great Cavern Sutra*.\n\nThe Master of Gan Mountain’s Mowei Grotto, Supreme and Unsurpassed True Lord of Highest Virtue, Rectifies the Mysterious Storehouse Incantation:\n\nThe Primordial qi of the Mysterious Origin divides,\nPure radiance opens the grotto’s spirits.\nA numinous wind revolves the Great Harmony,\nJade tones gather the flowing essence.\nSupreme is this, fundamentally natural—\nWho recognizes this mysterious text?\nFirm and resolute, illumined in singular awakening,\nIn an instant one transcends the Three Vehicles.\nStill and silent, without root of form,\nThrough kalpas eternal, how could one drift or sink?\nWho can refine and uphold this practice?\nUltimately, one ascends to Jade Clarity.\n\nThe Dao speaks: In the primordial Dragon Han kalpa, the Celestial King of the Origin of Origins revealed *The Jade Sutra of the Great Grotto* within the Highest and Vast Jade Clarity Palace. He expounded the Dao of the Supreme Mystery and the Mystery of Mysteries, naming it *The Great Grotto Sutra of the Immortals*. The Celestial King of the Origin of Origins first intoned the Supreme Mystery in a single sound, its resonance flowing through Jade Clarity. He propagated the Imperial Singular True Dao, proclaimed the precious texts of the Great Grotto, demonstrated the methods of the Nine Governances, and transmitted the talismans of the Nine Lights. When scholars recite these, upon purifying themselves and cultivating practice, they immediately gain the joyous celebration of the myriad spirits, the protection of the hundred numina, the resonance of the ten thousand sages, and the presence of the ten thousand immortals. Thereby, one may transcend the Three Calamities and Four Malevolences, the Five Demons and Six Harms, the Seven Injuries and Eight Difficulties, the Nine Adversities and Ten Evils. One ascends as an immortal, enters sagehood, and the spirit is born in Purple Tenuity. Naturally and effortlessly, one is unbound by the constraints of yin and yang, the Five Phases, or the Six qi. With each thought, one grows, hastening toward the Great Vehicle, propagating it endlessly. The myriad heavens below observe, and the Jade Emperor descends his gaze. Flying immortals safeguard and welcome one’s ancestors through kalpas past, their ethereal souls and wandering spirits all attaining rebirth. Lineages connect with immortals, becoming eternally noble. When merit is fulfilled and the Dao perfected, flesh and bone ascend together, riding dragons and driving clouds to ascend and pay homage in Jade Clarity.\n\nThe Celestial King of the Origin of Origins, whistling and chanting the Supreme Mystery, concentrated his spirit in distant contemplation and proclaimed the Grotto’s chapters:\n\nSupreme Grotto of the Origin,\nThe Origin gives birth to the Nine Heavens.\nThe Ancestor of qi is the Supreme Nonbeing,\nThe lineage of wind inherits the Mystery.\nThe Mystery’s transmission once severed,\nThe Four Clarities soothed and pacified.\nThe Imperial Singular’s Upper Radiance,\nLinked with the multitudes, gathers the mists.\nLong bound to the singular destiny,\nSeven generations cast into tranquility.\nEntrusting the numinous, attaching to life,\nReturning to the splendor of the natural.\nVast and distant, flowing radiance,\nThe Six Luminaries sink and shift.\nAscending the model, wielding brilliance,\nWestern Florescence manifests peace.\nAll inscribed in the Imperial Registers,\nFully attaining liberation at the source.\nThe Womb Field’s profound path,\nGenerations bring forth jade orchids.\nNuminous light of eightfold radiance,\nIntermingling births the myriad spirits.\n\nThe Celestial King of the Origin of Origins says:\nJade Emptiness follows the Mystery in return,\nRoaming the Golden Dawn of the Celestial Morn.\nBrightly shines the Imperial Radiance,\nSuddenly one feasts on Jade Isle.\nTo the left, the Beginning Youth is gathered,\nTo the right, the Eternal Talisman is summoned.\nIlluminating the true, resplendent in the Nine Heavens,\nThree suns reflect the unfolding Mystery.\nThe Dry Radiance joins the Three Collars,\nWithin lies the profound and boundless void.\nGrant me long years,\nA thousand kalpas mark but one cycle.\nThe Yellow Register guards virtue’s measure,\nDonning brocade, one enters the divine mounds.\nThe Supreme Singular attends to the root of life,\nThe Duke’s son summons the united talisman.\nTen revolutions fulfill the initial resolve,\nAttaining entry into the root of great faith.\n\nThe Celestial King of the Origin of Origins says:\nThe Jade Emperor’s Mysterious Upper Banner,\nCommands the steps of the Nine Heavens.\nThe Seven Awakenings complete the Dao’s reckoning,\nJoyous and harmonious, the divine wind returns.\nThe whirlwind gleams, halting in Northern Florescence,\nPurple blossoms sing in Eastern Jasper.\nJade harmony beyond the Nine Heavens,\nThe Jade Talisman summons Supreme Tenuity.\nThe Three Pristines give birth in the Mud Pill,\nRadiating the golden numinous brilliance.\nThe Venerable Lord firmly upholds the summit,\nGuarding the mechanism of life and death’s fidelity.\nThe Ten Virtues arise within the Mystery,\nTranscending adversity, naturally.\n\nThe Celestial King of the Origin of Origins says:\nThe Supreme Darkness severs the Nine Mysteries,\nThe Grotto’s radiance entrusts divine communion.\nThe Jade Emperor rides the Vermilion Dawn,\nGreen auroras illumine the golden ramparts.\nThe Upper Palace within the cloud’s pearls,\nGazing upward, one meets the Mysterious Summit’s peak.\nThe Numinous Pass beneath the Great Desert,\nMists and foam surge into the void.\nThe Dark Transformation blends Kan and Li,\nThe Mysterious of Mysteries, the Young Fire King.\nRare stillness, lofty and co-arising,\nThe Boundless protects the Valley Youth.\nThe Round Way knows no stagnation,\nWondrous union possesses nine layers.\nTo the south, the roots of seven ancestors are untied,\nTo the west, the misfortunes of accumulated kalpas are dissolved.\nThe body transcends the myriad tidal waves,\nThe spirit gathers the ten directions.\nGreat return reverses the Womb Chariot,\nThe Three Unions ride the Celestial Dragon.\n\nThe Celestial King of the Origin of Origins says:\nThe Palace of the Celestial Emperor of Supreme Tenuity,\nEight floats enter the cloud’s encampment.\nThe Divine Clan governs the numinous heart,\nDragon Mountain flourishes in Jade Capital.\nThe Golden Chamber dense with bright auroras,\nNine gates gleam with lofty jasper.\nThe Yellow Court traverses Northern Origin,\nThe Origin Father turns left in radiance.\nVermilion crystal awakens the Illuminating Master,\nThe profound and boundless ascends Upper Clarity.\nThe Four Mysteries hold the Origin’s prohibitions,\nEternally safeguarding the Five Emperor Cities.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Purple Essence of Supreme Nonbeing,\nThe Three Origins ascend the Radiant Way.\nFlourishing and bright, guarding the Supreme Brilliance,\nVast and distant, fanning the Imperial unfolding.\nThe Earl of History initiates the Three Pristines,\nThe Imperial Numen ascends Jade Emptiness.\nAuspicious qi nurtures the Five Clouds,\nThe Controller of Destinies, the numinous inception.\nThe Ten Florals, wondrous immortal practices,\nSubdue demons, giving birth to the Six Illuminations.\n\nThe Celestial King of the Origin of Origins says:\nThe True Yang’s Imperial Guest, the Venerable,\nReceives affairs in the Jade Emperor’s court.\nAnnihilating demons, purging filthy waters,\nThe hundred offices proceed to the Crimson Palace.\nThe Leisurely Abode within Cinnabar Mystery,\nThe Five qi bind the ten directions.\nSeven revolutions, the Controller of Destinies arrives,\nThree returns summon the Immortal Duke.\nThe Lord of Ghosts of Mount Tai,\nSwiftly examines within the Three Offices.\nThe Ten Virtues form the initial foundation,\nTogether flying with the Seven Awakening Origins.\n\nThe Celestial King of the Origin of Origins says:\nThe Three Floral qi of Supreme Pristine,\nAt dawn ascend the Vast Numinous Hall.\nThe Jade Guest manifests the Mysterious Register,\nGuarding life, the child’s Dao is at peace.\nThe revolving wind scatters the myriad demons,\nThe golden talisman summons the vast realm.\nAssisting and safeguarding within the Earth’s Gates,\nProtecting this King of Eternal Life.\nTurning, one enters the Ten Immortal Gates,\nThe Eight Sceneries together illumine the Grotto’s yang.\n\nThe Celestial King of the Origin of Origins says:\nThe Purple Essence nurtures the Floral Grove,\nEternally dark beyond Supreme Nonbeing.\nThe Jade Chamber gives birth to precious clouds,\nWithin the ninefold womb and embryo.\nThe Imperial Guest presents the Five Talismans,\nThe Three Lights revolve the Purple Canopy.\nAzure jade refines the coming life,\nSafeguarding this Eternal Night Assembly.\nThe Five Numinous transmit the talismanic registers,\nThe Nine Governances unite the Nine Lights.\nThe Three Mysteries emerge from Supreme Clarity,\nPurple Yang emits the myriad lives.\nMysterious essence nurtures the Nine Numinous,\nThe Origin Father binds the Womb Immortals.\n\nThe Celestial King of the Origin of Origins says:\nThe Azure Numinous fans the Eight qi,\nDrumming the wheels of the Three Floral City.\nLiberating the embryo’s knots of the multitudes,\nSeven generations receive blessed birth.\n\nThe lodging aligns to extinguish the Five Paths,\nEternally guarding the Imperial Unity’s camp.\nThe Duke’s son holds the Five Talismans,\nThe Great Unity resides in the Purple Chamber.\nBeneath the Triune Earth Gate,\nLiberating lives from the Jade Emperor’s palace.\nThe Maiden with Dark Radiance,\nSafeguards the multitudes at the Seven qi Window.\nBinding and restraining the blood-oath covenants,\nFilling and fulfilling the Five Viscera.\nThe Ten Perfected ascend the Yellow Chamber,\nThe Imperial Son transforms into Golden Immortals.\nWhite jade talismans fly forth in summons,\nDrawing them upward to the Dragon Terrace Heaven.\n\nThe Celestial King of the Origin of Origins says:\nOn high, feasting in the Purple Empyrean,\nThe Five Elders assist the Jade Root.\nThe Primordial Simplicity brushes the ethereal radiance,\nUniting talismans before the Imperial Unity.\nThe White Emperor commands the luminous generals,\nRevolving gold toward the Great Auroral Land.\nDelivering me from beneath the Gate of Death,\nLiberating from the Three Wretched Paths’ bridge.\nThe Ten Penetrations arise from this,\nWondrous practices flourish thereby.\nWithin the luminous clarity of the Dao,\nThe Imperial Unity’s true mystery is profoundly abstruse.\n\n*End of the Upper Scripture of the Vast Cavern of Wenchang, the Unbounded and Supreme Perfected Text, Scroll Three*\n*Beginning of the Upper Scripture of the Vast Cavern of Wenchang, the Unbounded and Supreme Perfected Text, Scroll Four*\n\nThe Mountain of Sweetness’ Mo-Wei Cavern Master, the Supreme and Utmost Virtuous Perfected Lord of the Great Mystery, collated and corrected.\n\nThe Dao speaks: At that time, the Celestial King of the Origin of Origins emitted azure rays from his brows, his crown revolving with purple qi. A canopy of myriad blossoms and precious jewels floated above, a net of gauze veiling his form. Jade light and golden auroras intertwined, shimmering in radiant splendor.\n\nThe Jade Clarity Dao Lord, the Great Mystery Dao Father, bowed his head in reverent anticipation, wishing to hear the Cavern Chapters. Thereupon, the Celestial King of the Origin of Origins joyfully intoned:\n\nThe August Supreme transcends the formless,\nRevolving the Nine Luminaries to life.\nThe circling winds blend with the Imperial Heart,\nThe Eight qi operate in eternal tranquility.\nVast auroras intermingle with the divine heavens,\nThe Five Emperors scatter solar essence.\nElixir overflows within the Primordial Void,\nBlood congeals, the Five Blossoms level.\nThe body treasures the round pearl’s reflection,\nFlowing radiance liberates the multitudes’ forms.\nNamed the Abundance of Longevity and Ease,\nAlso called the Clarity of Still Depths.\nTogether crossing the Three Wretched Passes,\nOpening registers to ascend the Great Clarity.\nEnabling you to preserve the immortal truth,\nSeven generations don the verdant karmic robes.\nUnraveling calamities beneath the nether paths,\nSurpassing blessings to the morning’s numinous heights.\nGeneration after generation ascending to the Jade Land,\nAncestors returning to the womb’s infancy.\nPerceiving the unimpeded emptiness of the Cavern,\nFirst penetrating the illumination of karmic causes.\nThe lustrous pearl settles in the square pupils,\nWithin and without, the Cavern’s clarity shines.\n\nThe Celestial King of the Origin of Origins says:\nThe Jade Clarity governs the Nine Heavens,\nThe Supreme Great Dao gives birth.\nEternally preserving within the radiant transformations,\nNine revolutions mirror the Upper Clarity.\nLoosening the sash in the jade-lit chamber,\nMounting the plainness to enter the Four Clarities.\nSeizing the Sun’s Central King,\nJoining wings with the Moon’s Morning Numinous.\nThe Great Unity summons the celestial demons,\nThe Imperial Lords examine the myriad essences.\nLiberating from the accumulated qi of death,\nTranscending to the Yellow Court of Immortals.\nThe Emperor stands atop the Three Passes,\nThe Eight Winds dance with divine soldiers.\nIn the left hand, grasping the nectar of blessings,\nIn the right, lifting the vase of felicitous origins.\nThe Cavern’s subtlety is unimpeded mystery,\nBrahmā’s penetration engenders empty clarity.\nPiercing the forehead to hear the Ten Directions,\nExpansively falling away—all sounds.\n\nThe Celestial King of the Origin of Origins says:\nThe Grand Clarity floats in the absolute void,\nThe Three Heavens’ treasure of divine talismans.\nWithin the sun, the Five Radiance unfold,\nThe Azure Emperor perfects eternal nonbeing.\nHolding registers to ascend the Great Clarity,\nReceiving records at the Golden Flower Tower.\nThe Five Viscera plant the Jade Root,\nSoul and spirit unite in harmonious fusion.\nThe Cavern’s emptiness is pure and mysterious,\nQi flows to engender clarity and brightness.\nStabilizing harmony, wondrous luminous awakening,\nThe Dao’s breath naturally ensures long life.\n\nThe Celestial King of the Origin of Origins says:\nThe Primordial King of the Supreme Ultimate’s Radiance,\nThe Three Heavens gather the divine lives.\nPurple Simplicity veils the towering peaks,\nPeacefully arriving at the Upper Flowery Capital.\nLiberating from the Five Sufferings’ accumulation,\nReturning to the womb of the Seven Origins’ court.\nThe Nine Mysteries unravel the heavy knots,\nAncestors delight in the brocade’s purity.\nWandering beneath the elegant blossoms,\nLooking up and down to seek the Five Numinous.\nThe multitudes’ bodies ascend the Jade Hall,\nThe Five Spirits return to infancy.\nTogether ascending beyond the Great Void,\nNurturing simplicity to attend the Round Clarity.\nThe Cavern’s emptiness is pure and harmonious,\nFlowery penetration guides the mysterious brightness.\nTempering the Five Canine Pearls,\nEmbracing goodness to savor eternal life.\n\nThe Celestial King of the Origin of Origins says:\nIn the August Beginning’s Purple Primordial midst,\nRadiance and light flourish in the empyrean’s brightness.\nThe Three Heavens illumine the Nine Effulgences,\nSeparating and uniting the myriad lives.\nDonning pearl-hemmed green auroras,\nRevolving above the Cold Lad’s numinous.\nLiberating from the Five Poisons’ afflictions,\nSurpassing the body beyond the Beginning Azure.\nWhite Simplicity opens the towering peaks,\nThe Golden Gate guards the Vermilion Soldiers.\nSeven generations’ accumulated corpse-knots,\nA single transformation scatters a hundred collapses.\nReceiving blessings in the Eastern Auroral Chamber,\nReturning to the womb of the Vermilion Fire Court.\nThe Cavern’s numinosity is pure and practiced,\nPower flows to naturally penetrate clarity.\nThe Perfected Pure One’s hands grasp the Dipper,\nFeet tread the Nine Origins’ stars.\nWielding the Heaven and Earth’s passes,\nSpirit and essence are the root of life.\n\nThe Celestial King of the Origin of Origins says:\nThe Peerless True Supreme Mystery,\nThe Primordial Nine Simplicities’ qi.\nEntrusting the forehead with the revolving pearl,\nBlending transformations to inaugurate tomorrow’s sun.\nThe Orthodox Unity’s left and right immortals,\nEternally supporting the Numinous Void’s chamber.\nThe multitudes possess jade talismanic registers,\nUniting with immortals to obtain the true qi.\nThe hun is born within the Supreme Nonbeing,\nThe po also meets the Five Paths.\nGeneration after generation, liberating from the Gate of Death,\nSeven ancestors without lingering obstructions.\nDivine winds blow upon the womb’s tree,\nRoots and leaves already severed.\nWithin the womb, planting ghostly calamities,\nThe Five Talismans open the earth’s knots.\nEternally becoming the Divine Perfected King,\nResponding to immortals to continue myriad generations.\nThe Cavern’s truth is the pure and tranquil body,\nThe Dao flows through the natural substance.\nTrue responses manifest in forms,\nUnmoving, abiding in the Yellow Chamber.\nResponsive transformations exist without fixed direction,\nBones and flesh are solid as gold and jade.\nThe tranquil truth illumines the correct Dao,\nUnchanging even unto old age.\n\nThe Celestial King of the Origin of Origins says:\nThe Central Yellow Simplicity’s qi,\nThe Round Flower’s Jade Longevity Numinous.\nThe Great Spread of the Upper Jade Gate,\nSubduing clouds in the threefold peaks’ brightness.\nAzure radiance veils the boundless,\nCarrying the Great Unity’s essence.\nThe Imperial Maiden embraces the Stable Mound,\nChanting the Jade Clarity’s scriptures.\nThe Five Registers compile in the Purple Chamber,\nThe Five Talismans enter the Round Court.\nSeven ancestors return to the womb’s abode,\nExtinguishing the Three Wretched Paths’ lives.\nFlowing winds sever blood’s stagnation,\nThe mysterious leaves attain Yellow Tranquility.\nThe Cavern’s mystery is pure and luminous,\nThe primordial life’s numinous penetration achieves completion.\nNature and life’s ancestral root is firm,\nFilial piety perfects the Illuminated King.\nPlanting roots to obtain the Great Harmony,\nThrough nonaction ascending the Upper Clarity.\n\nThe Celestial King of the Origin of Origins says:\nThe Azure Essence’s Upper Flowery qi,\nThe Great Tenuity’s mysterious radiant lad.\nDivine transformations within the Jade Chamber,\nFlying feathers soar through the purple void.\nThe sun as the Three Collars’ intersection,\nPresenting talismans to ascend the Imperial Ramparts.\nOpening passes to grasp the golden tally,\nClosing gates to strike the jade bell.\n\nThe vanquishing of demons spans the Three Feng Wastes,\nSummoning spirits to ascend the Upper Clarity Palace.\nEmerging radiant from the darkest Yin Pass,\nEntering refined into the Six Harmonies’ Chamber.\nReversing age to transform into hoary form,\nReturning white to revert as an infant child.\nThe Cavern’s source shines with pure luminous light,\nEssential fluids possess numinous penetration.\nSwallowing fluids to generate the ten thousand spirits,\nSpirit-water fuses with the Flowery Pool.\nSurging upward to irrigate and moisten,\nComing and going without end.\nCommunicating with the source of the life-generating Dao,\nThe Heavenly Root ever flourishes in abundance.\n\nThe Celestial King of the Origin of Origins says:\nThe Great Yang transforms the Three Mornings,\nThe purple chariot descends in subtle mystery.\nThe Primordial Lord guards the Valley Child,\nSealing the stomach to block death’s gate.\nThe golden tally blazes in Northern Florescence,\nThe jade contract extricates the seven ancestors.\nThe Imperial Perfected irrigates Upper Life,\nSevering my suffering of the Three Paths.\nThe Cavern’s clarity shines with pure luminous light,\nThe Emperor’s heart achieves great mysterious penetration.\nThe knowledge of past lives and former existences,\nThe root and origin reside within the Primordial Cause.\nFuture lives and others’ minds,\nAll fuse without obstruction.\nThe Cavern’s source and the Cavern’s clarity,\nThe ten thousand Dao arise from penetrating life.\n\nThe Celestial King of the Origin of Origins says:\nIn the Great Beginning’s ninefold pure qi,\nQi emerges from the Flowery Radiance’s midst.\nThe Dharma Enclosure dances with immortal banners,\nThe Five Elder Lords advance in solemn procession.\nHeavenly beings bear the Pearl of Initiation,\nHolding registers to return to the Purple Chamber.\nThe Primordial Father revolves leftward in luminous clarity,\nMerging with the Great Tenuity’s child.\nThe Cavern’s purity illumines wisdom,\nThe Great Intent resonates with the Primordial Penetration.\nRoot and dust wholly dissolve,\nBeing and nonbeing all become empty void.\nThe wondrous practice perfects the True One,\nNamed as the great heart’s numinous penetration.\nThe Dao complete, one ascends Jade Clarity,\nAttaining the rank of Sage Immortal Elder.\n\nThe Celestial King of the Origin says:\nThe Primordial Beginning bestows the Great Mystery,\nThe Azure Barbarian presents the precious pearl.\nThe sandalwood’s blazing melody is wondrous,\nIts subtle sound pervades the Great Void.\nThe Nine August Ones’ Upper Perfected qi,\nThe Four Directors’ Great Immortal Kings.\nFlying auroras scatter the sun of heaven,\nCongealing and dispersing within the Six Harmonies’ Chamber.\nUpper Clarity pays court to Jade Void,\nRiding the radiance within the morning’s brilliance.\nThe Three Spirits proclaim the Unfastening Cord,\nBearing registers to initiate the Void Emperor.\nSoaring records ascend Purple Clarity,\nGolden tallies inscribed in the Feathered Palace.\nCrowning the Azure Barbarian’s head,\nVast salvation ascends Universal Radiance.\nConveying those within the Mysterious Center,\nSwallowing essences to generate the Five Fragrances.\nGathering and coalescing into the Womb Immortal,\nThe Cinnabar Mother and Golden Perfected Yang.\nHost and companion unite with the Primordial Model,\nThe Great Simplicity generates the Mysterious Realm.\n\nThe Most High, Limitless, and Perfect Wondrous Script of the Celestial Writ of the Great Cavern, Scroll Four concludes.\nThe Most High, Limitless, and Perfect Wondrous Script of the Celestial Writ of the Great Cavern, Scroll Five\n\nThe Supreme Perfected Lord of the Great Mystery, Highest Virtue of Gan Mountain’s Mo Wei Cavern, collated and corrected.\n\nThe Dao speaks: At that time, the Celestial King of the Origin of Origins, with the qi of the Highest Cavern’s Primordial Chaos, the Great Nonbeing, the Primordial Heaven’s Treasure, and the Jade Emperor, coalesced a precious pearl, naming it the Azure Barbarian, saying: “I, with this precious pearl, follow the Dao’s wondrous unity, benevolently bestowing the root of life, gestating the mysterious and dividing the primordial, giving birth to the beginning and transmitting the Perfected, transforming and generating the various heavens, congealing into the ten thousand qi. Vast and supreme treasure, only I alone preserve it.\n\nNow, for the Jade Palace Dao Lord, this treasure is reissued. The Celestial Emperor Kings and Heavenly Perfected Great Sages gaze upon the treasure’s radiance, its light spreading into hundreds of thousands of myriads of millions, coalescing into the *Wondrous Script of the Great Cavern*’s jade writ, congealing into clouds, shimmering into chapters. The Celestial Emperor Kings and Heavenly Perfected Great Sages, with pure luminous discernment, with primal penetrating vision, with flowery tongues’ penetration, in unison intone the Great Cavern’s cloud chapters. Their resonance pervades the ten thousand heavens, their echoes flow through the nine earths. Heavenly realms, earthly realms, water realms, and divine lands—all spirits and numina, not leaving their original seats, together behold the cloud chapters, their eyes dazzled by immortal Sanskrit, their ears all attaining comprehension. A hundred lifetimes’ obstructions extinguished, ten thousand kalpas’ dust dissolved. The Three Paths and Nine Dark Realms, the ten directions’ evil destinies, all receive the light and sound. Wherever it reaches, the ten fetters, nine knots, six defilements, and seven dusts—in this instant, all simultaneously attain liberation.\n\nAt that time, the Great Mystery Dao Father approached the Xiao Terrace, prostrating twice and bowing his head, seeking to receive the precious pearl’s coalesced *Wondrous Script of the Great Cavern*’s jade writ and cloud chapters, hoping thereby to guide and transform the beings of heaven and humanity, all to avoid the ten thousand disasters, all to dissolve the multitude of sins, not to sink into evil destinies, all to attain the One Vehicle. Vastly nurturing this vow, he earnestly entreated.\n\nThe Celestial King of the Origin of Origins commanded the Perfected Jade Palace Dao Lord, the Great Sage of the Primordial Spirit, to assume the proper dignified deportment, and personally bestowed the Azure Barbarian Pearl upon the Great Mystery Dao Father.\n\nThe Celestial King of the Origin of Origins proclaimed: “This Azure Barbarian Pearl, together with the sandalwood’s blazing melody—were it not for the Great Mystery, one could not seek or request it. Only your profound compassion and weighty vows permit the bestowal of this precious writ.”\n\nThe Celestial King of the Origin of Origins says:\nThe Heavenly August Ones’ Upper Perfected qi,\nThe Three Origins ride the morning’s return.\nThe Dharma Enclosure arises in Vermilion Empyrean,\nThe Imperial Crystals open the Jade Gates.\nExtricating corpses from the Gate of Life,\nUnbinding knots on the Peach Health Stair.\nGathering spirits to preserve the Five Registers,\nRevolving to ascend into the Great Tenuity.\nAlone entering yet doubly cultivating,\nA single melody opens the water and heaven.\nThe sea’s sun rises naturally from the east,\nThe primordial life generates the Great Beginning.\n\nThe Celestial King of the Origin of Origins says:\nThe Great One generates the primordial qi,\nThe child who governs life within the sun.\nResplendent with numinous radiant light,\nDonning auroras to ascend the Imperial Ramparts.\nSeated in array upon the Thunder Spirit’s mat,\nMerging within the Five Suns’ Chamber.\nWhite qi nurtures Upper Life,\nThe Azure Lord secures prolonged prosperity.\nLeft, grasping the Gate of Essence Above,\nRight, embracing the Infant of Union and Harmony.\nMy life generates the sun and moon’s splendor,\nFellow guests with the Red Qi King.\nEight Auroras illuminate the Mud Pill,\nLuminously within the Cavern’s Chamber.\nThe infant becomes the Red Child,\nMerging and parting to generate the Jade Countenance.\nThe Five Dao flourish with golden splendor,\nAttaining the rank of Upper Clarity Lord.\nThe seven ancestors sever the mysterious stagnation,\nThe body attains to ride the spirit wind.\nWandering above Jade Clarity,\nHarmoniously returning as an infant child.\nThe Great Beginning’s three qi cycle,\nThe Perfected Writ inaugurates luminous life.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Primordial Void’s Yellow Chamber,\nThere resides the Yellow Tranquility Child.\nTo the left, the Firm Jade Lord,\nTo the right, the Imperial Prosperity August.\nFloating clarity veils the spirit qi,\nLuxuriant and vast, the empty numinous countenance.\nThe Azure Liver’s Bright Wheel Child,\nOpening and illuminating through the Eight Windows.\nThe Great One and Longevity Mound’s orchid,\nPresenting tallies to enter the Jade Palace.\nExtricating my seven generations’ sins,\nRevolving the primordial to await the Ten Penetrations.\nMerging within the Emperor’s One Chamber,\nThe Five Elders transform into infant ignorance.\nThe Great Simplicity’s Brahmanic practice begins,\nOne goodness penetrates the Four Golds.\n\nThe Celestial King of the Origin of Origins says:\nThe Supreme Ultimate governs the Four Perfected,\nSoaring on feathered wings through the Upper Clarity.\nSeven revolutions summon the Controller of Destinies,\nAs the Great One displays radiant majesty.\nThe Recorder hastens to the appointed station,\nThreefold ascent to the numinous Thunder.\nDemon kings come to receive their duties,\nImmortal officials bind ghostly essences.\nWithin the moon dwells the Azure Emperor’s Mother,\nNamed Fragrant Radiance Infant.\nThe Great Expansion unfolds the Five Talismans,\nPeacefully inscribing the Jade Register above.\nWithin the Six Harmonies all transforms,\nThe Bridal Chamber arrays the Fire Soldiers.\nThe Supreme Ultimate’s Five Numinous Surges,\nThe Emperor’s Son as guest with the Horizontal Script.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Dipper dwell the Four Perfected,\nScattering blossoms upon the Jade Clarity Terrace.\nThe Imperial Minister engenders the Central Mystery,\nOne revolution and the host of Perfected arrive.\nFragrant winds fan the Three Treasures,\nThe Five Viscera reflect the Clear Tranquility.\nThe Azure Hu’s luminous splendor,\nThe Sandalwood’s blazing auspicious hook.\nThe Great Centrality’s Six Qi purify,\nThe Winding Waters embrace the Celestial River.\nThe Six Perfections’ merit is perfected,\nThe Five Demons fell the Six Yin.\nAt the center binds the King of the Origin of Origins,\nGazing from on high upon the Six Harmonies’ court.\n\nThe Celestial King of the Origin of Origins says:\nAt dawn the Yellow Radiance qi,\nThreefold refinement ascends the Empyrean court.\nFrom the Azure Terrace the feathered wheels take flight,\nExtending welcome as the Dao is accomplished.\nThe Controller of Destinies presents the Emperor’s writ,\nNamed the Dark Passage Minister.\nPreserving life within the Great Rosy Cloud Palace,\nArraying guests in the Upper Clarity’s hostel.\nThe Gate of Destiny joins with essence to extend,\nGuarding my body’s Yellow Tranquility.\nTo the left he grasps the Primordial Simplicity Lord,\nTo the right he seizes the Vermilion Luxuriance Spirit.\nThe Great Harmony ferries the Seven Awakenings,\nKindling fire to generate the Perfected Writ.\nThe Purple Blossom leads the Womb Immortals,\nThe Origin’s Mandate as the Perfected within the Perfected.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Golden Watchtower the Supreme Radiance qi,\nThe Ten Directions glow with purple mist.\nThe Three Mandates of the Great One Emperor,\nFive summonses to the Great Peace spirits.\nSeven revolutions beckon the Peak Perfected,\nJade talismans announce to the Three Bureaus.\nExtracting the registers from beneath the Three Numinous,\nReceiving rebirth in the Highest Dawn.\nThe Supreme Emperor of the Eight Numinous,\nOne transformation returns to Mysterious Felicity.\nThe Peach Lord guards the Six Harmonies,\nInscribing essence to defend the Muddy Pellet.\nThe Supreme Clarity’s Eightfold Radiance observes,\nThe Ten Virtues proclaim the Perfected Writ.\nPreserving the child as the Perfected within the Perfected,\nThe Origin’s Mandate arises naturally.\n\nThe Celestial King of the Origin of Origins says:\nThe Great Void holds no scene,\nYet within the rosy clouds stands Peng’s Chamber.\nNinefold clouds seal the layered gates,\nThe Emperor Lord abides in serene seclusion.\nThe Eight Perfected join with the Radiance Lord,\nAscending with the Female Great One.\nMale and female merge within the Jade Chamber,\nNine transformations return to attain the Seven.\nDispersing forms throughout the Six Harmonies,\nThe Muddy Pellet’s distinctions are easily made.\nThe Great Perfected’s Ninefold Light Wheel,\nThe Ten Companions knot the Writ’s patterns.\nPreserving the child’s Origin qi flows,\nThe Five qi govern the Central Prowess.\nMerging as one to return to the Emperor’s watchtower,\nEternal longevity without end or kalpa.\nTransforming to soar through the Upper Clarity,\nSurpassing the Three Thousand Practices.\n\nThe Celestial King of the Origin of Origins says:\nAbove the Great Mystery’s Nine qi,\nMists swirl amidst the Great Radiance.\nDivine light blooms upon the empty peaks,\nThe Five Paths illumine the Three Heavens.\nMounting the radiance to ascend the Absolute Empyrean,\nRiding the winds to dispel stagnant spirits.\nWithin the center a single sun revolves the pearl,\nGoverning the heart to enter tranquil leisure.\nMerging within the Three and Five Palaces,\nLayered transformations through myriad eons.\nFelling the womb’s tree at its root,\nForever severing the blood corpse’s source.\nSeven ancestors disperse accumulated stagnation,\nReturning blossoms to the Dark Mystery’s depths.\nMyriad qi generate myriad spirits,\nAll immortals become Immortal Kings.\nThe Great Mystery initiates the Ten Clarities,\nWondrous practices ascend the Ten Perfected.\n\nThe Celestial King of the Origin of Origins says:\nBeyond the Upper Clarity’s Absolute Rosy Clouds,\nThe Eight Emperors revolve the Nine Heavens.\nFrom the profound and boundless arises the Emperor’s abode,\nBearing these Radiance-dwelling persons.\nAt dawn ascending the Supreme Elder’s chamber,\nAt dusk feasting in the Golden Blossom Pavilion.\nFeathered tablets command the Great One,\nBroidered banners summon the myriad spirits.\nStrengthening my Six Palaces’ embryo,\nFelling the womb tree’s root.\nUntying the knots of the seven ancestors,\nDispersing calamities to pacify the Nine Mysteries.\nThe Vermilion Emperor’s Cinnabar Numinous stands guard,\nSupporting the omen to enter the Jade Gate.\nThe Moon Mother’s Numinous Simplicity Orchid,\nGuards the closure of the death qi’s pass.\nFrom this day forth death qi is forever severed,\nLife’s fluids henceforth extend.\nMyriad spirits and myriad qi immortals,\nTranscending to become Perfected Kings.\nThe Ten Perfected’s wondrous practices complete,\nThe Great Mystery unites the Bright Yang.\n\nThe Supreme Worthy of the Great Cavern,\nOne qi conjoins with the Dragon’s Radiance.\n\nThe Celestial King of the Origin of Origins says:\nEastern Florescence emits its first radiance,\nThe High Dawn reflects the Upper Clarity.\nResplendent the Luminous Pearl’s mist,\nLustrous the Purple Brilliance’s clarity.\nSeven spirits return to the Emperor’s seat,\nFive Elders fly upon jade carriages.\nThe Great One stands within the Radiance,\nThe Controller of Destinies gathers the myriad essences.\nFloating amidst the cloud waves,\nSilently gazing upon the Muddy Pellet’s citadel.\nSeven revolutions summon the Three Bureaus,\nThe Northern Lord bows to the numinous.\nThe Five Peaks respond to the qi’s arrival,\nExtracting death’s register for eternal life.\nThreefold ascent of the Thunder Numinous talisman,\nMysteriously dissolving the Great Demon’s essence.\nSeven ancestors untie the blood knots,\nThe Dark Blossom preserves the Yellow Tranquility.\n\nThe Celestial King of the Origin of Origins says:\nThe Supreme Emperor’s Nine Elders’ capital,\nReviewing immortals to ascend Fusang.\nSeven revolutions summon the Celestial Emperor,\nThe Controller of Destinies rides the spirit’s net.\nThe Five Peaks open their numinous portals,\nTransmitting voices to the Great Demon King.\nRivers and seas all receive their duties,\nEstablishing your responsive assembly.\nPreserving the talisman within the Muddy Pellet,\nGuarding the spirit named Peach Prosperity.\nReversing illumination to alter death’s register,\nRecording immortality as the Fire King’s uncle.\nSevering the Three Paths’ afflictions,\nRemoving calamities to birth the Supreme Flower.\nThe Seven Mysteries ascend the Vermilion Chamber,\nThe omen’s body meets in the Jade Hall.\nAbove befriending the Square Fullness Child,\nBelow grasping the Principle’s Latent Store.\nTo the left seizing the Bright Chariot Lord,\nTo the right assisting the Return to Prosperity.\nMerging the Jade Capital’s qi as one,\nTransforming the omen to flourish in auspiciousness.\nReturning to infancy as the Origin’s Mandate Child,\nThe Sandalwood blazes with the Auspicious Hook.\nThe Celestial One’s Origin Root Immortal,\nFree within the Wheel of Luminous Radiance.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Jade Clarity’s Myriad Blossoms Palace,\nHigh immortals conceal the Emperor’s scriptures.\nThe Chart governs the Nine Heavens’ exterior,\nPenetrating observation arises from Non-Being.\nSeven revolutions summon the myriad spirits,\nThe Five Peaks come once to the court.\nThe Three Bureaus beckon the host of demons,\nThe Recorder reviews their presentations.\nExtracting the registers from the Yellow Springs’ depths,\nRecording immortality in the Upper Clarity’s annals.\n\nThe Celestial King of the Origin of Origins says:\nUpon the Dark Continent beyond the Three Fordings,\nThe Feathered Radiance’s Supreme Non-Being court.\nRevolving empyreans fly into the boundless,\nEntrusting transformation to merge the myriad essences.\nFive clouds luxuriate in the absolute void,\nSeven rosy clouds descend upon the Perfect Clarity.\nLustrous the Profound and Boundless Child,\nThe Brahmanic Prosperity aids the Yellow Tranquility.\nThe Five Elders wave the crimson blossoms,\nScattering fragrance to bear the Jade Numinous.\nGolden substance washes in the Emperor’s river,\nGreen mists luxuriate with flowing jade.\nDivine extraction of the Three Paths’ accumulations,\nImmortal embryo knits the omen’s form.\n\nThe Supreme Clarity Jade Emperor’s Master, the Great Dao Lord of the Jade Heaven,\nWith the vermilion palace’s heart-spirit, soars to the Venerable One of the Grand Mystery.\n\nThe Celestial King of the Origin of Origins says:\nThe Three Perfected give birth to the Grand Prime,\nJade portals reflect the dawn’s radiance.\nThe Grand Simplicity penetrates the primal void,\nCinnabar groves bristle with crimson branches.\nReturning spirit to the ninefold palace,\nThe Southern Prosperity emits jade blossoms.\nA hundred meridians receive the fluid elixir,\nThe Dark Mystery rests in the Three Effulgences’ vale.\nThe omen-body ascends to Jade Clarity,\nSeven ancestors depart the gloomy prison.\nLong preserved beyond the kalpa’s end,\nFor myriad ages they become the immortals’ lineage.\nEnthroned as the sagely lineage’s sovereign,\nThe Jade Clarity’s Grand Cavern spirit.\n\nThe Celestial King of the Origin of Origins says:\nThe Western Prime’s ninefold numinous qi,\nGolden elixir flows through the cloud palace.\nAbove, the supreme jade brilliance transcribes,\nRadiant scenes within the Grand Rosy Clouds.\nMoving, it revolves the nine heavens’ wheel,\nStill, it sinks the eight currents’ net.\nWithin the chamber dwells the Embryo Immortal Mother,\nWho bears the lapels of the Grand Thearch.\nThe Mysterious Unity’s spirit arises in time,\nThe Three Elders spread the plain white canopy.\nLeft hand grasps the omen’s talismanic register,\nRight hand carries the governance of the divine lineage.\nTogether they ascend the numinous dragon’s gate,\nBowing heads in the Jade Clarity’s chamber.\nUprooting the roots of death and extinction,\nNurturing form within the Three and Five.\nSeven ancestors dissolve the corpse’s knots,\nReceiving blessings from the luminous pearl’s realm.\nAbove, they attest to the sagely sovereign within,\nTalisman-transformed into the Primordial Qi’s king.\n\nThe Great Dao Lord of the Jade Heaven says:\nMy master, the Celestial King of the Origin of Origins, bestowed upon me this *Grand Cavern Sutra of the Immortals*. Its purport is profound and recondite, the wondrous gate of cultivating truth.\n\nFirst, stabilize the regulated breath—\nA thousand harmonies of Grand Harmony.\nMidway, contemplate the transformation into truth,\nDissolving forms to disperse dust.\nFive thousand primal unities converge,\nSitting in presence, standing in absence.\nGrand stabilization perfects truth,\nWondrous practice connects with the numinous.\n\nFirst is the circulation of qi,\nNext is the circulation of spirit,\nFinally, the circulation of the numinous.\nTen circulations complete the truth,\nThe Dao perfected, ascending to the celestial court,\nTranscending and soaring beyond,\nPassing through the Three Realms,\nComing and going within the Three Clarities,\nAttaining the rank of Grand Cavern,\nHeavenly One, Thearchic Sovereign.\nSix perfections, ten circulations,\nMyriad practices perfected,\nA thousand harmonies, myriad unions,\nNaturally attaining the supreme.\n\nThus concludes the fifth scroll of the *Grand Cavern Sutra of the Supreme Vastness, the All-True Wenchang*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上无极总真文昌大洞仙经 经名：太上无极总真文昌大洞仙经。 原题甘山摩维洞主校正。 据序文称，乃南宋乾道戊子文昌君降授道士刘安胜，景定甲子秋道士罗懿子重校正。 岁在摄提格绣梓宣行。 系模仿《上清大洞经》及《灵宝度人经》编造。 五卷。 底本出处：《正统道藏》洞真部本文类。 太上无极总真文昌大洞仙经卷一 九天开化主宰澄真正观宝光慈应更生永命天尊序 甘山摩维洞主太玄无上上德真君校正 予之居事畎浍，忽於锄下得一金像，询之父老，曰乃元始天王相。 昔夏禹理水，冶金为像，以镇方岳，予香火奉祀，未尝少懈，因海风翻浪，人力不可支，予为众舍金像投骇浪中，由是风潮遂回，一境获安。 思忆之久，一夕沙碛中有光亘天，掘之，再得旧像，归筑宫安奉，同邦人共事之，积年灵感，不可胜纪。 予考妣不幸死於瘟疫，予葬庐墓，培壅周隅，有三神人乃真定光，郁罗翘、光妙音三真人葛巾羽褐芒鞋访予，以《大洞经》一帙赐予，曰晨夕诵之，必获善果，於三才中，上可以资奉父母祖族魂灵，出离幽苦，中可以灭罪消灾，延年益福，下可以庇族救人同获保全，汝可舍金宝拜吾三人，吾为奏传。 予即日依命设斋，贡金缯，奉师受之。 尔后晨夕持诵不最辍，屡获灵感，因盛暑洪水奫浸考妣坟墓，予礼奉金像，诵《大洞经》，期以千卷为终，以保无虞。 次年秋雨霖霪，傍溪涌涨，数流为一，予益恐，及水落视之，则坟前溪谷变成坚埇，广一里余，自是松楸无害。 予尝思父母死於疫疾，恨瘟鬼之害，切骨为雠，幽明路殊，力不能报，每旦夕勤诵《大洞仙经》，虔恳金像，愿赐威力，以治瘟鬼。 又三年，忽梦金像语予曰：《大洞仙经》汝熟记矣，《大洞法箓》尔未见也，今当授汝，以治邪魔，非惟可以契汝初心，亦可以佐天行化，助国救民也。 袖中出书二件，予百拜受之。 一曰《大洞箓》，二曰《大洞法》。 既觉，此二书在枕前，因设斋置匦收贮，择日出而阅之。 读至大洞天驺甲卒一万人下度之句，忽风雷昼暝，金甲朱绶者无数，列於予前，俯而请命。 一人执红旗立於众先，曰：愿听使令。 予方恍惚，不觉厉声谓之曰：吾要汝等往治瘟鬼，此乡某家合门病瘟，为吾驱来！ 语毕，一持旗者，领百余人入其家，俄顷执鬼使五人而出，有蒙虎皮者，冠鸡雄者，貌若人者，若乌鸦者，若驴马者，所执皆水火羽翣凿之具。 予怒而叱之，将灭其形，彼乃词曰：弟子等岁运所生，岁炁所成，所游有方，所病有人，阴谴至者受其灾，天命绝者致其死，亦非弟子所敢私行。 始自三官五岳上奏玉帝，呈世人罪状，由是帝命行下三官五岳行病，年王案分给牒分遣，某等一依定籍施行，若蒙真官赐以宽贷，自后愿遵约束，遇有行瘟，见真官符箓所在，即不至矣。 予因依经法授以教法而去，闾里病瘟者，予与之符法，皆得全活，予因以此法箓救人病疾众矣，名闻远方，士庶官吏踵门求治者，不可计数。 予积玄功妙行，皆由持诵此《大洞仙经》，而获《大洞法箓》，故能全收神效，立正除邪，济生度死，消灾延寿。 其后冥冥中有大力鬼神、社庙英爽来求予诵经回施者，皆谢云：乘真官经力、增助威德迁神善籍矣。",
      "translated_text": "**The Supreme Vast Boundless Primordial Perfected Wenchang Great Cavern Immortal Scripture**\n\n**Scripture Title:** *The Supreme Vast Boundless Primordial Perfected Wenchang Great Cavern Immortal Scripture*. Originally collated by the Master of Moyi Cave of Ganshan. According to the preface, it was transmitted by Lord Wenchang to the Daoist Liu Ansheng in the *wuzi* year of the Qiandao reign of the Southern Song, and later recollated by the Daoist Luo Yizi in the autumn of the *jiazi* year of the Jingding reign. Printed and disseminated in the year of *shetige*.\n\nThis text was modeled after the *Highest Clarity Great Cavern Scripture* and the *Numinous Treasure Scripture of Salvation for Humanity*. Five scrolls in total. Base text from the *Daoist Canon of the Zhengtong Era*, *Cavern Reality Division*, *Original Texts* category.\n\n---\n\n**The Supreme Vast Boundless Primordial Perfected Wenchang Great Cavern Immortal Scripture, Scroll One**\n\n**Preface by the Celestial Worthy of the Nine Heavens’ Transformative Governance, Clarity and True Contemplation, Treasure Radiance, Compassionate Response, and Eternal Life**\n\nCollated by the Supreme Mystery and Unsurpassed Highest Virtue Perfected Lord, Master of Moyi Cave of Ganshan\n\nI once lived as a farmer, and while tilling the fields, I unearthed a golden statue beneath my hoe. Upon inquiring with the village elders, I was told it was an image of the Celestial Venerable of Primordial Beginning. Long ago, when Yu the Great governed the waters, he smelted metal to fashion this statue to pacify the sacred peaks. I had worshipped it with incense and offerings without the slightest negligence. Yet when a sea storm churned the waves beyond human strength to withstand, I, on behalf of the people, cast the golden statue into the raging waters. Thereupon, the winds and tides receded, and the entire region found peace.\n\nI had long pondered this event when one evening, a radiance stretched across the sky above the sandy shoals. Digging there, I recovered the original statue and returned it to build a temple for its enshrinement. The people of the region joined me in its veneration, and over the years, its numinous responses became too numerous to record.\n\nMy parents, alas, perished in a pestilence. I built a hut beside their graves, tending the earth around them. Then, three divine beings—Perfected Zhen Dingguang, Yu Luoqiao, and Guang Miaoyin—appeared before me, clad in hempen headscarves, feathered robes, and straw sandals. They bestowed upon me a volume of the *Great Cavern Scripture*, saying: \"Recite this morning and evening, and you shall surely attain good fruits. Among the Three Powers, above, it may aid the souls of your parents and ancestors, liberating them from dark suffering; in the middle, it may eradicate sins, dispel calamities, prolong life, and augment blessings; below, it may protect your clan and save others, ensuring their preservation. You may offer gold and silk to us three, and we shall memorialize your devotion.\"\n\nThat very day, I followed their command, preparing a vegetarian feast and presenting gold and silks to receive their teachings. Thereafter, I recited the scripture morning and night without cease, and its numinous responses were manifold. Once, during a scorching summer, a great flood submerged my parents’ graves. I reverently presented the golden statue and recited the *Great Cavern Scripture*, vowing to complete a thousand recitations to ensure their safety. The following autumn, incessant rains swelled the streams into a single torrent, and my fear grew. Yet when the waters receded, I saw that the valley before the graves had transformed into a vast, solid plain, over a *li* in breadth. From then on, the pines and catalpas remained unharmed.\n\nI had long grieved that my parents died of pestilence, hating the plague demons with a bone-deep enmity. Though the paths of the living and the dead diverge, I lacked the power to exact vengeance. Thus, I diligently recited the *Great Cavern Immortal Scripture* morning and evening, entreating the golden statue with utmost sincerity, praying for the might to subdue the plague demons.\n\nThree years later, I suddenly dreamed that the golden statue spoke to me: \"You have mastered the *Great Cavern Immortal Scripture*, but you have not yet seen the *Great Cavern Register of Methods*. Today, I shall bestow it upon you to quell demonic forces. This will not only fulfill your original vow but also aid Heaven’s transformative work, assisting the state and saving the people.\" From its sleeve, it produced two texts, which I received with a hundred bows. The first was the *Great Cavern Register*, and the second, the *Great Cavern Methods*.\n\nUpon waking, I found the two books at my pillow. I prepared a vegetarian feast, placed them in a sacred casket, and chose an auspicious day to examine them. As I read the passage, *\"When the ten thousand armored soldiers of the Great Cavern Heaven descend to deliver...\"*, suddenly, wind and thunder darkened the day. Countless figures in golden armor and crimson sashes arrayed themselves before me, bowing to receive my command. One holding a red banner stood at their fore, saying, \"We await your orders.\"\n\nStill in a daze, I unthinkingly shouted: \"I command you to subdue the plague demons! In this village, an entire household lies stricken—go and drive them out!\" At once, the banner-bearer led over a hundred soldiers into the house. In an instant, they emerged, dragging five demonic agents. Some wore tiger skins, some wore rooster crowns, some resembled humans, others crows or donkeys and horses. All wielded tools of water, fire, feathers, and chisels.\n\nEnraged, I rebuked them, threatening to annihilate their forms. They pleaded: \"We disciples arise from the yearly cycles, formed by the *qi* of the seasons. We roam in fixed directions, afflicting those destined to suffer. Those punished by dark judgments endure calamity; those whose heavenly mandate is severed meet death. This is not our private doing. It begins with the Three Officials and Five Peaks, who memorialize the Jade Emperor, presenting the sins of mortals. Thereupon, the Emperor commands the Three Officials and Five Peaks to spread illness. The Year Star’s register assigns our tasks, and we act strictly according to the ledger. If the Perfected Master grants us leniency, we shall henceforth obey restraints. Wherever we encounter the talismans and registers of the Perfected Master, we shall not dare to approach.\"\n\nI then instructed them according to the scripture’s methods, and they departed. Thereafter, whenever villagers fell ill with pestilence, I provided them with talismans and methods, and all were saved. Through these registers and methods, I rescued countless afflicted souls. My name spread far and wide, and scholars, commoners, officials, and clerics flocked to my door seeking healing, their numbers beyond count.\n\nI accumulated profound merit and wondrous deeds, all through reciting the *Great Cavern Immortal Scripture* and obtaining the *Great Cavern Register of Methods*. Thus, I could fully manifest divine efficacy, rectify the proper, expel the perverse, deliver the living, ferry the dead, dispel calamities, and prolong life.\n\nLater, in unseen realms, mighty ghosts and spirits, as well as the valiant souls of local shrines, came to request that I recite the scripture for their benefit. They expressed their gratitude, saying: \"By the power of the Perfected Master’s scripture, our virtue and might have increased, and our names have been inscribed in the registers of good spirits.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1218,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.80558633804321,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "或有沉魂滞魄不得往生者，托梦附形来求予诵经资荐者，皆谢云：乘经力已出苦趣，俱得更生矣 ，应遇天行时疫，侵染不止，但诵此经，行箓法中遣瘟符、绝瘟符、止瘟符、天驺甲卒已上收瘟食瘟吏、收毒食毒吏、收邪食邪吏、收炁食炁吏，收鬼食鬼吏、收殃食殃吏、收精食精吏、治病神医吏、诛符破庙吏等九部，各领甲卒，及北方黑骑天官五亿万骑、苍老麻姑金刚力士等收捕之，先牒年王，次申岱岳，分委城隍社令，札遣瘟疫使之，若拒正不伏退散，闻经不依盟约，然后奏而灭之。 夫大道尚慈，太清常善，上帝好生，推仁止杀，行经法箓者，不可循私苛暴，以招天谴。 但以礼遣之，以经奉之，以法箓威之，以善功劝之，亦方便修行之捷径也。 行此经箓法之士，宜在详酌，以立玄功，此经尊重，能解冤结，除冢讼，止谴罪，释咒诅，解触犯，安坟宅，宁军府，息兵甲，止疫疾，祈风雨，降祥瑞，致蚕谷，保形命，庇族属，救邦社，安边陲，禁虫虎，止旱涝，灭妖怪，息群凶，安奉祀典鬼神，资荐先祖魂识，拯济穷魂滞魄，皆可设斋诵经行道以禳谢之。 其余治病域毒，有紫庭天医神方，乃禹皇金后之余恩及乎万世，使人无夭横之伤，时免札瘥之患，奉教之士，当寻访受习，以取仙功。 予曩生吴会，以此经功，位证梵镇如来，厥后诵持不替，证果太上不骄乐育天帝、澄真正观宝光慈应更生永命天尊，由诵经之勤，遂获上清之贵，可不深加尊敬而授之乎！ 得受诵者勉而行之，愿同文昌一会中人齐登妙行。 乾道戊子秋降于鸾台，刘安胜捧。 至景定甲子秋再降，重校正于鳖头山摩维洞，金莲石着仪坛，罗懿子捧。 继后岁在玄默摄提格菊月重九日，再降书于西陵桂岩卫生总真坛云：《度人经》、《大洞书》，诸经之祖，黍米珠、苍胡宝，众圣之源，斯二经者，同出而异名，生天立地，孕玄分元，非诬民惑世之言，乃入圣生神之要，主持造化，斡旋枢机，言无韵丽，曲无华宛，故为玄奥，难可寻详，真上天之所宝也。 自无极迄今，讵容缺焉。 世人惟知诵《度人经》，而不知诵《大洞经》，盖《度人经》 予曾作烦以美其意，《大洞经》未之有也，今命侍化诸子绣木宣行，予亦当作颂以彰其德，庶几观者易晓，诵者易悟也。 叙经意 始自苍胡檀炽音，结云成篆度天人。 太玄道父亲求授，下世方闻大洞经。 修真道 大地凡夫学悟真，仙源路杳实难寻。 欲知捷径无差错，口诵心持大洞经。 祈禄嗣 宗祖前生善力轻，今生禄嗣颇艰辛。 祷祈欲得如君意，何似勤看大洞经。 弭天灾 日月无光苦并吞，星辰错度紊天文。 上消天厄宁凡庶，至士同宣大洞经。 祈风雨致田蚕 旱魃为灾雨若金，虫蝗水涝谷无成。 普教丰稔无饥馑，祈祷全凭大洞经。 化凡庶 工贾农商与四民，贪求不觉业随身。 忙中好割闲心力，习诵文昌大洞经。 宁府库息兵甲 府库资财甚满盈，兵戈永息乐升平。 民歌有道图长治，报国勤看大洞经。 安奉鬼神 社庙神祇与百灵，欲求升擢盖无因。 迁名善籍增威力，旦暮须听大洞经。 荐先祖 眷属宗亲父母魂，久留地府不超升。 欲思荐拔缘无力，斋戒勤看大洞经。 除冢讼 冢讼征呼累后人，又兼谴罪在天庭。 生生世世遗殃咎，解止宜看大洞经。",
      "translated_text": "Should lost souls and lingering spirits unable to attain rebirth appear—manifesting in dreams or possessing forms to beseech me for scripture-recitation and merit-transference—they would all express their gratitude, saying: \"By the power of this scripture, we have escaped the苦趣 and all obtained rebirth.\"\n\nWhen seasonal epidemics spread unchecked, one need only recite this scripture and perform the register rites, dispatching the *Plague-Dispelling Talisman*, *Plague-Cutting Talisman*, *Plague-Stilling Talisman*, and summoning the celestial couriers and armored legions to command the Nine Divisions of officials: the *Plague-Seizing, Plague-Consuming Officers*; *Toxin-Seizing, Toxin-Consuming Officers*; *Evil-Seizing, Evil-Consuming Officers*; *Qi-Seizing, Qi-Consuming Officers*; *Ghost-Seizing, Ghost-Consuming Officers*; *Calamity-Seizing, Calamity-Consuming Officers*; *Essence-Seizing, Essence-Consuming Officers*; *Divine Physician Officers for Healing*; and *Talisman-Wielding, Shrine-Destroying Officers*. Each division leads its armored troops, joined by the five hundred million black-clad cavalry of the Northern Celestial Officials, the Venerable Canglao, the Venerable Magu, and the Diamond Vajra Warriors, to apprehend the malevolent forces.\n\nFirst, a memorial is sent to the Year Sovereign, then a petition to Mount Tai, before delegating authority to the City Gods and Earth Deities, who dispatch the Epidemic Envoys. If the perverse resist the rectification and refuse to disperse, or violate the covenant upon hearing the scripture, they are then reported and annihilated.\n\nThe Great Dao cherishes compassion; the Supreme Clarity ever embodies goodness. The Celestial Emperor delights in life and extends benevolence to halt killing. Those who practice the scripture and register rites must not act with private harshness, lest they incur heavenly censure. One should dispatch them with propriety, honor them with scripture, awe them with register rites, and exhort them with virtuous deeds—this is the swift path of expedient cultivation.\n\nPractitioners of this scripture and register rites must exercise careful discernment to establish profound merit. This scripture is revered and mighty, capable of resolving karmic entanglements, settling tomb disputes, halting heavenly retributions, dissolving curses, lifting offenses, pacifying graves and dwellings, calming military and government affairs, stilling warfare, ending epidemics, praying for wind and rain, summoning auspicious omens, ensuring silkworm and grain harvests, protecting life and body, shielding clans, aiding the state, securing borders, restraining insects and tigers, averting droughts and floods, vanquishing demons, quelling myriad evils, pacifying the spirits of sacrificial rites, aiding the souls of ancestors, and delivering lost and lingering spirits. All these may be accomplished by holding fasts, reciting scriptures, and performing the Dao.\n\nFor treating illnesses and neutralizing poisons, there is the *Divine Prescription of the Purple Court Heavenly Physician*—a remnant grace of the Golden Empress of Yu the August, extending to all generations, sparing people from untimely deaths and freeing them from the scourge of epidemics. Those who uphold this teaching should seek out and study it to attain immortal merit.\n\nIn a former life in Wu and Kuaiji, through the merit of this scripture, I attained the rank of Brahmā-Conquering Tathāgata. Thereafter, through unwavering recitation, I realized the fruition of Supreme Clarity’s *Imperial Sovereign of Unbounded Joy and Nurturing Heaven*, the *Venerable Perfected of Luminous Purity and Merciful Response, Eternal Life of Rebirth*. By diligent recitation of the scripture, I ascended to the nobility of the Upper Clarity—how could one not deeply revere and transmit it?\n\nThose who receive and recite it must strive to practice it, aspiring to ascend together with the assembly of Wenchang in the cultivation of wondrous deeds.\n\n*Revealed in the autumn of the wùzǐ year of the Qián Dào era at the Phoenix Terrace, received by Liú Ānshèng. Re-revealed in the autumn of the jiǎzǐ year of the Jǐngdìng era, re-collated at the Biē Tóu Mountain’s Mó Wéi Cave, with the Golden Lotus Stone serving as the ritual altar, received by Luó Yìzǐ. Thereafter, on the ninth day of the ninth month in the yǐchǒu year of the Xuánmò era, again revealed at the Xīlíng Guìyán Wèishēng Zǒngzhēn Altar:*\n\nThe *Scripture of Salvation* and the *Great Cavern Scripture* are the ancestors of all scriptures; the Pearl of Millet and the Treasure of Cānghú are the sources of all sages. These two scriptures, though bearing different names, share a single origin—giving birth to heaven and establishing earth, gestating the mysterious and dividing the primordial. They are no deceptive words to delude the world, but the essential means to enter sageliness and generate spirit. They govern creation and turn the pivot of the cosmos. Their words lack ornate rhyme, their verses eschew florid embellishment—thus they are profound and abstruse, difficult to fathom in detail. They are treasures cherished by the heavens above.\n\nFrom the Boundless to the present, how could they be allowed to fall into neglect? Yet people today know only to recite the *Scripture of Salvation* and remain unaware of the *Great Cavern Scripture*. For the *Scripture of Salvation*, I once composed verses to embellish its meaning, but the *Great Cavern Scripture* has lacked such adornment. Now, I command the attendant disciples to carve woodblocks and disseminate it, and I shall also compose hymns to illuminate its virtue, that readers may more easily understand and reciters more readily awaken.\n\n**Preface to the Scripture’s Meaning**\nFrom the primordial tones of Cānghú’s burning sand,\nSealed in celestial script to ferry heaven’s kin.\nThe Great Mysterious Dao’s father sought its transmission,\nAnd only then did the *Great Cavern Scripture* descend to the world.\n\n**Cultivating the True Dao**\nMortals of the vast earth seek to awaken the truth,\nYet the path to immortality is distant and hard to find.\nIf you wish for a swift and unerring way,\nRecite and hold the *Great Cavern Scripture* in heart and mouth.\n\n**Praying for Offspring and Prosperity**\nThe virtue of past ancestors was slight,\nAnd this life’s prosperity and descendants are fraught with hardship.\nIf you wish your prayers to align with your desires,\nHow can it compare to diligently studying the *Great Cavern Scripture*?\n\n**Averting Heavenly Disasters**\nSun and moon lose their light, suffering eclipse,\nStars stray from their courses, disrupting celestial patterns.\nTo dispel heavenly calamities and bring peace to the common folk,\nLet the worthy recite the *Great Cavern Scripture* together.\n\n**Praying for Wind, Rain, and Bountiful Harvests**\nDrought demons bring disaster, rain falls like gold,\nLocusts and floods leave no grain to harvest.\nTo ensure universal abundance and no famine,\nPrayers rely entirely on the *Great Cavern Scripture*.\n\n**Transforming the Common Folk**\nArtisans, merchants, farmers, and all four classes,\nGreedily pursue gain, unaware of the karma they carry.\nAmidst busyness, carve out a moment of leisure,\nAnd study the *Great Cavern Scripture* of Wenchang.\n\n**Pacifying Treasury and Halting Warfare**\nTreasuries overflow with wealth and resources,\nWeapons forever stilled in joyful peace.\nThe people sing of the Dao’s governance, seeking lasting order—\nRepay the nation by diligently studying the *Great Cavern Scripture*.\n\n**Pacifying Ghosts and Spirits**\nEarth deities, shrine spirits, and all numinous beings,\nSeek promotion yet lack the means.\nTo ascend the registers of good spirits and augment their power,\nThey must listen to the *Great Cavern Scripture* day and night.\n\n**Aiding Ancestral Spirits**\nThe souls of kin—parents and ancestors—\nLinger long in the underworld, unable to ascend.\nIf you wish to deliver them but lack the means,\nFast and diligently study the *Great Cavern Scripture*.\n\n**Resolving Tomb Disputes**\nTomb disputes and summonses burden descendants,\nCoupled with heavenly retributions in the celestial court.\nFor generations, misfortunes are passed down—\nTo resolve them, one should study the *Great Cavern Scripture*.",
      "overlap_context": "y manifest divine efficacy, rectify the proper, expel the perverse, deliver the living, ferry the dead, dispel calamities, and prolong life.\n\nLater, in unseen realms, mighty ghosts and spirits, as well as the valiant souls of local shrines, came to request that I recite the scripture for their benefit. They expressed their gratitude, saying: \"By the power of the Perfected Master’s scripture, our virtue and might have increased, and our names have been inscribed in the registers of good spirits.\"",
      "start_char": 1218,
      "end_char": 2526,
      "start_sentence": 32,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.151047706604004,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "解触犯安坟宅 或为营修与筑坟，兴工动土犯凶神。 致令宅宇多灾咎，解息宜持大洞经。 除瘟疫 行病年王统五瘟，遍州历里害生民。 保全邻簇无传染，严洁同看大洞经。 治疾病 月厄年灾久染身，寻医问卜与求神。 不能解离无门告，命道皈依大洞经。 拯济沉魂滞魄 六类冤亲男女魂，冥冥漠漠在幽阴。 普告受炼生天界，好与频看大洞经。 解冤结 六道冤家结得深，冤冤相报几时停。 欲令各各生欢喜，除是听闻大洞经。 止咒诅 或为争财或为嗔，一时忿怒叫神明。 结成鬼讼何时了，解雪无非大洞经。 息群凶 疾病丧亡不离身，官灾盗贼苦侵凌。 财消物散如冰雪，保佑当持大洞经。 灭妖怪 木石狐狸猴犬精，抛砖放火现人形。 作威作福求淫祀，殄灭宜看大洞经。 开心志启聪明 士子儒生茅塞心，神童应对不聪明。 挥毫欲得如神助，先好常持大洞经。 保形命 如幻如泡是此身，气精神里好修真。 保全形命同天在，熟玩文昌大洞经。 戒富豪 莫恃家豪积万金，天司夺禄易危倾。 有时正好修功德，割己刊行大洞经。 述应验 一片真心达上清，感通得授自三神。 此身位证天尊果，只为勤看大洞经。 普劝二颂 听我重言大洞经，斯文玄奥果难名。 无边功德莫思议，普劝凡夫不可轻。 元始天王说大乘，有缘方遇此尊经。 若能终始勤修诵，共作文昌一会人。 清河老人颂节要 三洞诸经贵玉音，文章错落粲珠金。 禳灾辟厄生天地，度尽尘沙无鞅人。 大道施张结洞文，济人利物极无边。 凡胎欲作飞升客，为我清心读妙篇。 道本无声岂有言，圣人立法强传宣。 求鱼须是因筌力，获得鱼儿岂用筌。 元始初传大洞经，一音初出众知闻。 法灯自许时人续，不但天尊与道君。 神风静默海无云，天地澄闲四气清。 若使一缘才妄动，璇玑又是不停轮。 日吉时良好诵经，世间万虑勿萦心。 济人利物功成也，玉简金书为记名。 不无不有本纯真，非色非声绝等伦。 模写形容难到处，玄中位象甚分明。 位极无炁最上真，始乎龙汉迄于今。 不增不减为清静，是则名为大法身。 谛观符命自维宣，能释幽牢罪苦缠。 返本还元扶起命，人人时刻得升迁。 罪垢皆由心境昏，三涂五苦累形魂。 天光一洗根尘净，仙化朝元礼至尊。 渐入无为得道宗，一尘不染意圆通。 回眸下视三千界，万法都来一个空。 无影无形大法身，不生不灭号成真。 几经劫石消磨尽，寂寂神光依旧明。 历尽关山道路辛，这回金榜喜题名。 男儿志气谁能御，驷马荣归自在行。 学道须凭慧力多，清江毋或涨风波。 融心直入丹霞外，满目戈矛奈我何。 九天开化本愿经序 北府枢相集福真君作 此经乃太上金口宣说，无非为救末劫设也。 自说经毕，即奉玉旨，付玉宸内殿收贮。 并勑下诸天演化，众真照此传行。 於是诸坛传降，迨已八所，独绍熙灵应，鸠众锓梓，余则誊写转诵而已，鼎之民好善，优於诸郡，大帝开化，莫甚於此邦，吾主香火，亦近十余，然纯一不杂，终始无怠，惟文昌灵应，颇嘉於此而传降焉。 且勉善信刊板印施，今幸告成。 噫！",
      "translated_text": "**Resolving Offenses Against Graves and Dwellings**\nWhether renovating homes or constructing graves,\nBreaking ground offends the inauspicious spirits.\nThis brings misfortunes upon the household—\nTo resolve and pacify them, hold fast to the *Great Cavern Scripture*.\n\n**Dispelling Pestilence**\nWhen the Year-Star governs the Five Pestilences,\nPlagues spread through towns and villages, harming the people.\nTo protect neighborhoods from contagion,\nMaintain strict purity and study the *Great Cavern Scripture* together.\n\n**Curing Illness**\nWhen monthly afflictions and yearly calamities linger in the body,\nOne seeks physicians, divination, and gods in vain.\nWith no means of relief and nowhere to turn,\nEntrust your fate to the Dao and take refuge in the *Great Cavern Scripture*.\n\n**Delivering Sunken Souls and Stagnant Spirits**\nThe six kinds of karmic souls—men and women—\nDwell in darkness, bound to the shadowy underworld.\nTo universally proclaim their deliverance to the celestial realms,\nFrequently study the *Great Cavern Scripture*.\n\n**Untangling Karmic Grievances**\nThe six paths of karmic foes weave deep entanglements,\nVengeance upon vengeance—when will it end?\nTo bring joy to each and all,\nThere is nothing but listening to the *Great Cavern Scripture*.\n\n**Ending Curses**\nWhether over wealth or wrath,\nA moment’s fury invokes the gods.\nWhen ghostly lawsuits form, when will they cease?\nOnly the *Great Cavern Scripture* can dissolve them.\n\n**Quelling Calamities**\nIllness, death, and misfortune cling to the body,\nOfficial disasters and bandits bring bitter oppression.\nWealth scatters like melting ice—\nFor protection, hold fast to the *Great Cavern Scripture*.\n\n**Eradicating Demonic Beings**\nSpirits of trees, stones, foxes, monkeys, and dogs,\nHurl bricks, set fires, and take human form.\nThey wield power, demand lewd sacrifices—\nTo exterminate them, study the *Great Cavern Scripture*.\n\n**Opening the Mind and Sharpening Wisdom**\nScholars and students with minds choked by weeds,\nChild prodigies who falter in response—\nTo wield the brush with divine aid,\nFirst cultivate the habit of holding the *Great Cavern Scripture*.\n\n**Preserving Form and Life**\nThis body is like illusion, like a bubble,\nYet within its qi and spirit lies the path to true cultivation.\nTo preserve form and life, aligning with Heaven,\nDiligently ponder the *Great Cavern Scripture* of Wenchang.\n\n**Admonishing the Wealthy**\nDo not rely on vast wealth amassed at home,\nFor Heaven’s decree can strip your fortune and topple your prosperity.\nWhen the time is ripe to cultivate merit,\nSacrifice your wealth to print and distribute the *Great Cavern Scripture*.\n\n**Accounts of Efficacy**\nWith a heart of sincerity reaching the Supreme Clarity,\nOne receives transmission from the Three Spirits.\nThis body attains the fruit of Heavenly Worthies—\nAll because of diligent study of the *Great Cavern Scripture*.\n\n**Two Universal Exhortations**\nHear my earnest words on the *Great Cavern Scripture*,\nIts profound mysteries truly beyond naming.\nIts boundless merits defy thought—\nI urge all mortals not to take it lightly.\n\nThe Primordial Heavenly King expounded the Great Vehicle,\nOnly those with karmic affinity encounter this sacred scripture.\nIf one can study and recite it steadfastly to the end,\nThey shall join the assembly of Wenchang.\n\n**Qinghe Elder’s Eulogy on Essential Teachings**\nThe Three Caverns’ scriptures treasure jade-like sounds,\nTheir words resplendent, scattered like pearls and gold.\nThey avert disasters, ward off misfortunes, and birth heaven and earth,\nDelivering all beings as numerous as the sands of the Ganges.\n\nThe Great Dao unfurls, weaving the Cavern’s text,\nIts aid to people and benefit to creatures boundless.\nIf mortal beings wish to become soaring immortals,\nFor my sake, purify your heart and read this wondrous chapter.\n\nThe Dao is fundamentally soundless—how could it have words?\nYet the sages established teachings to forcefully transmit it.\nTo catch fish, one must rely on the power of the trap;\nOnce the fish is caught, what need remains for the trap?\n\nWhen the Primordial One first transmitted the *Great Cavern Scripture*,\nIts single sound resounded for all to hear.\nThe lamp of Dharma was passed on by later generations—\nNot only by Heavenly Worthies and Dao Lords.\n\nWhen the divine wind is still and the sea cloudless,\nHeaven and earth are serene, the four qi pure.\nIf even one karmic thread stirs in delusion,\nThe celestial pivot turns once more without cease.\n\nOn auspicious days and favorable hours, recite the scripture well,\nLet not worldly cares entangle the mind.\nWhen the work of aiding people and benefiting creatures is complete,\nYour name shall be inscribed on jade tablets and golden registers.\n\nNeither existent nor nonexistent, originally pure,\nBeyond form, beyond sound, transcending all comparison.\nWhere depiction and description fail to reach,\nThe subtle image within the Mystery is most distinct.\n\nThe highest true beings, devoid of qi,\nHave endured from the Dragon Han era to the present.\nUnchanging, unaugmented, they are quiescence itself—\nThis is called the Great Dharma Body.\n\nContemplate the talismanic decree—it proclaims itself,\nAble to release those bound in dark prisons of suffering.\nReturning to the origin, restoring the primordial, it revives life,\nSo that all may ascend at every moment.\n\nImpurities arise from the mind’s obscurity,\nThe three paths and five sufferings burden form and soul.\nWhen the light of Heaven washes away the roots and dust,\nImmortal transformation dawns as one bows to the Supreme.\n\nGradually entering non-action, attaining the Dao’s essence,\nNot a speck of dust clings, the mind is perfectly attuned.\nGlancing back at the three thousand realms below,\nAll dharmas dissolve into emptiness.\n\nThe Great Dharma Body, formless and traceless,\nNeither born nor destroyed, is called the Perfected True One.\nThough countless kalpas of stone wear away,\nIts tranquil divine radiance remains ever bright.\n\nAfter traversing the arduous roads of life’s passes,\nThis time, joy comes with one’s name on the golden tablet.\nWho can restrain the aspirations of a true man?\nReturning in glory, one rides freely like a team of four horses.\n\nTo study the Dao, rely on abundant wisdom,\nLest the clear river swell with wind and waves.\nMelt the heart and enter beyond the cinnabar clouds—\nWhat can the spears and halberds of the world do to me?\n\n**Preface to the *Scripture of Transformative Enlightenment from the Nine Heavens***\nComposed by the Perfected Lord of Merit-Gathering at the Northern Bureau\n\nThis scripture was proclaimed by the Golden Mouth of the Most High,\nSolely to save beings in the final kalpa.\nUpon concluding the discourse, it was entrusted by jade decree\nTo be stored in the Jade Palace’s inner sanctum.\n\nA command was issued to all heavens to propagate its teachings,\nAnd all Perfected Ones to transmit it accordingly.\nThus, it was transmitted and descended to eight altars,\nYet only Shaoxi’s numinous response saw it gathered and printed,\nWhile others merely copied and recited it.\n\nThe people of Dingzhou excel in goodness beyond other prefectures,\nAnd the transformative enlightenment of the Great Emperor is most profound in this land.\nMy own incense offerings have continued for over a decade,\nUnmixed and unwavering from beginning to end.\nOnly Wenchang’s numinous response has been particularly commendable here, descending to transmit it.\n\nMoreover, I urge the faithful to carve blocks and print it for distribution—\nNow, fortunately, the task is complete.\n\nAlas!",
      "overlap_context": "avern Scripture* day and night.\n\n**Aiding Ancestral Spirits**\nThe souls of kin—parents and ancestors—\nLinger long in the underworld, unable to ascend.\nIf you wish to deliver them but lack the means,\nFast and diligently study the *Great Cavern Scripture*.\n\n**Resolving Tomb Disputes**\nTomb disputes and summonses burden descendants,\nCoupled with heavenly retributions in the celestial court.\nFor generations, misfortunes are passed down—\nTo resolve them, one should study the *Great Cavern Scripture*.",
      "start_char": 2527,
      "end_char": 3879,
      "start_sentence": 75,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.28212785720825,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "凡显名青编而受此经者，岂非欲生之徒，求免兵戈疫疠之苦者欤！ 予谓受经未善也，必诵之而后可，诵之又未善也，必行之而后可。 行者何？ 孝悌忠顺公恕是也，孝悌忠顺公恕非难，亦惟曰安本分三字而已。 吾言如是，可以消劫，疑之信之，吾何有焉。 持诵礼法 凡诵经，当斋沐，服清净衣，入室焚香，叩齿九通，心拜九天，存想元始天王与诸高真，七曲大帝开化仙官，迂临法会，皆列虚无，然后念咒。 净心口神咒 丹珠口神，吐秽除氛。 舌神正伦，通命养神。 罗千齿神，却邪卫真。 喉神虎贲，伸炁引精。 心神丹元，令我通真。 思神炼液，道炁长存。 急急如律令！ 净身神咒 灵宝天尊，安慰身形。 弟子魂魄，五藏玄冥。 青龙白虎，队仗纷纭。 朱雀玄武，侍卫我真。 急急如律令！ 净三业神咒 身中诸内境，三万六千人。 动作履行藏，前劫并后劫。 愿身常自在，常住三宝中。 当於劫坏时，愿身常不灭。 诵此神咒时，三业悉清净。 解秽神咒 太一之精子，束井之华卯，流灌身体午，荡秽除邪酉，净如明珠子，洁如莲华卯，化金光身午，步云锦霞酉，登七宝殿子，为真仙家午。 急急如九天开化主宰元皇上帝律令！ 净天地神咒 天地混沌，秽气分葩。 洞中虚玄，晃耀太元。 三清玉勑，光映九衢。 八方威神，使我自然。 灵宝符命，普告九天。 乾啰怛那，洞罡太玄。 斩妖缚邪，杀鬼万千。 中山神咒，元始玉文。 持诵一遍，却鬼延年。 按行五岳，八海知闻。 魔王束首，侍卫我轩。 凶秽荡净，道炁常存。 净坛咒 太上说法时，金锺响五音。 百秽藏九地，群魔护骞林。 天华散法雨，法鼓震迷沉。 诸天庆善哉，金童抚瑶琴。 愿倾八霞光，照我皈依心。 早登大法桥，翼侍五云深。 急急如律令！ 安土地咒 元始安镇，普告万灵。 岳渎真官，土地祇灵。 左社右稷，不得妄惊。 回向正道，内外肃清。 各安方位，备守帝庭。 太上有命，搜捕邪精。 护法神王，保卫诵经。 皈依大道，元亨利贞。 急急如律令！ 五星神咒 五星列照，焕明五方。 水生却灾，木德致昌。 荧惑消祸，太白辟兵。 镇星四据，家国利亨。 名刊玉简，字录帝房。 乘飙扇景，飞腾太空。 出入冥无，游宴十方。 五云浮盖，招神摄风。 役使万灵，上卫仙翁。 发炉 无上三天真元始三炁太上老君，召出臣等身中三五功曹、左右官使者、捧香驿龙骑吏、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 默想出者严装关启，此间土地里域真官令臣焚香诵经之所，金童扬姻，灵妃散花，三界真圣交集轩前。 伏愿某诵经之后，真炁周流，上以保全宗社，安奉帝王，禳兵戈水火之灾，除疫病旱蝗之厄； 中以祝延永命，保佑合门消九星八难之迍，免五苦三灾之累； 下以落名黑简，脱籍鬼乡，七祖升仙，先亡证道。 次祈人民异姓，乘经法而万福兴隆，山泽含灵，感圣功而咸超道岸，庶使某疾患不侵，灾殃扫荡，思真慕道，延想丹华，涤虑澄心，以祈轻举，济人利物，立功为先，凡有所祈，克获通感，天上天下，咸丐闻知。 愿得太上十方正真生炁下降，流入臣某身中，令臣所启，速达无极大道三清上圣、昊天玉皇上帝、梓潼神文圣武孝德忠仁王、救劫大慈悲更生永命天尊御前。 集神咒",
      "translated_text": "All who appear in the green registers and receive this scripture—are they not those who seek life and wish to escape the sufferings of war, plague, and pestilence? Yet I say: merely receiving the scripture is not enough; one must recite it to be sufficient. And even reciting it is not enough; one must practice it to be complete.\n\nWhat is practice? It is filial piety, fraternal duty, loyalty, obedience, impartiality, and forbearance. These are not difficult—they are merely the three words: *abide in one’s proper place*. Such are my words. They can dispel the kalpa’s tribulations. Whether you doubt or believe, what have I to do with it?\n\n**Rites for Recitation**\nWhen reciting the scripture, one must fast and bathe, don fresh and pure garments, enter the chamber, light incense, knock the teeth nine times, and bow in the heart to the Nine Heavens. Visualize the Primordial Heavenly King of the Origin and the host of exalted Perfected Ones, the Seven-Curved Great Emperor of Transformative Enlightenment, and the immortal officials descending to the dharma assembly, all arrayed in the void. Only then recite the incantations.\n\n**Incantation for Purifying Heart and Mouth**\nSpirits of the cinnabar pearl mouth, expel filth and disperse miasma.\nSpirit of the tongue, rectify order, connect life and nourish the spirit.\nSpirits of the thousand teeth, repel evil and guard the true.\nSpirit of the throat, fierce as a tiger, extend *qi* and draw forth essence.\nSpirit of the heart, cinnabar origin, let me commune with the true.\nContemplate the spirit, refine the fluid—may the Dao’s *qi* endure forever.\nSwiftly, swiftly, as the law commands!\n\n**Incantation for Purifying the Body**\nNuminous Treasure Heavenly Worthy, pacify and comfort this bodily form.\nDisciples’ souls and spirits, five viscera in profound darkness,\nAzure Dragon and White Tiger, arrayed in splendid ranks,\nVermilion Bird and Dark Warrior, attend and guard my true self.\nSwiftly, swiftly, as the law commands!\n\n**Incantation for Purifying the Three Karmas**\nWithin this body’s inner realms, thirty-six thousand beings dwell.\nIn movement, action, concealment, and retreat—through kalpas past and future—\nMay this body ever abide in freedom, ever dwell within the Three Treasures.\nWhen the kalpa collapses, may this body never perish.\nAs this incantation is recited, may the three karmas be wholly purified.\n\n**Incantation for Dispelling Filth**\nEssence of the Great One, blossom of the Well Star,\nFlowing to bathe the body at noon, sweeping filth and expelling evil at dusk.\nPure as a luminous pearl, immaculate as a lotus blossom,\nTransform into a body of golden light, step upon clouds of brocade and rosy dawn,\nAscend the seven-jeweled hall, become a true immortal.\nSwiftly, swiftly, as the Nine Heavens’ Transformative Sovereign, the Primordial August Emperor commands!\n\n**Incantation for Purifying Heaven and Earth**\nHeaven and Earth in primordial chaos, foul *qi* disperses like petals.\nWithin the cavernous void, radiance illumines the Great Origin.\nThe Three Clarities’ jade decrees, light shines upon the nine thoroughfares.\nMighty spirits of the eight directions, let me be as nature intends.\nNuminous Treasure talismanic command, proclaimed throughout the Nine Heavens.\n*Gan luo da na*, penetrating the stellar pivot of the Great Mystery,\nSever demons, bind evil, slay ten thousand ghosts.\nIncantation of Mount Zhong, jade script of the Origin.\nRecite once to repel ghosts and prolong life,\nPressing forth to the Five Peaks, known to the Eight Seas.\nDemon kings bow their heads, attending my chariot.\nMalevolence and filth swept clean—may the Dao’s *qi* ever abide.\n\n**Incantation for Purifying the Altar**\nWhen the Most High preached the Dharma, golden bells chimed five notes.\nAll filth hid in the ninefold earth; demon hordes guarded the *qian* grove.\nHeavenly flowers scattered as Dharma rain; Dharma drums shook the deluded from slumber.\nAll heavens rejoiced—how excellent! Golden youths strummed jade zithers.\nMay the eight rosy dawns’ radiance pour forth, illuminating my heart of refuge.\nSwiftly ascend the great Dharma bridge, soaring to the depths of the five clouds.\nSwiftly, swiftly, as the law commands!\n\n**Incantation for Pacifying the Local Deity**\nThe Origin establishes and pacifies, proclaiming to the ten thousand spirits.\nTrue officials of mountains and rivers, numinous deities of the land,\nAltars to the left, millet to the right—let none dare recklessly disturb.\nTurn toward the true Dao, within and without made solemn and pure.\nEach abides in its proper place, guarding the imperial court in readiness.\nThe Most High has decreed: hunt down and capture demonic essences.\nDharma-protecting divine kings, safeguard the recitation of scriptures.\nTake refuge in the Great Dao—*yuan*, *heng*, *li*, *zhen*.\nSwiftly, swiftly, as the law commands!\n\n**Incantation of the Five Stars**\nThe Five Stars array their radiance, shining brilliantly in the five directions.\nWater engenders and averts disaster; Wood’s virtue brings prosperity.\nMars dissolves calamities; Venus repels warfare.\nSaturn stabilizes the four quarters—household and state flourish and prosper.\nNames inscribed on jade tablets, characters recorded in the imperial chamber,\nRiding the whirlwind, fanning the light, soaring through the great void,\nEmerging and entering the unseen, roaming and feasting in the ten directions.\nFive-colored clouds float as canopies, summoning spirits and commanding winds,\nCommanding the ten thousand spirits, above to protect the immortal elders.\n\n**Opening the Brazier**\nMost High True Lord of the Three Heavens’ Primordial Origin, Three *Qi* of the Great Shang, Lord Lao, summon forth the thirty-six officers of the Three and Five Merit Officials within our bodies, the left and right attending envoys, the incense-bearing dragon-riding couriers, the incense-attending Golden Youths, the message-transmitting and flower-scattering Jade Maidens, the Five Thearchs’ direct talismans and daily incense officials—thirty-six each, emerge!\n\nSilently visualize them emerging in solemn attire, opening the gates. Here, on this land’s true officials’ domain, where we burn incense and recite scriptures, Golden Youths waft smoke, numinous consorts scatter flowers, and the true sages of the Three Realms gather before our chariot.\n\nWe humbly pray: after reciting this scripture, may true *qi* circulate throughout,\nAbove, to protect and preserve the ancestral altars, pacify and serve the emperor, dispel disasters of war, water, and fire, and eliminate plagues of pestilence, drought, and locusts;\nIn the middle, to extend longevity, protect and bless the entire household, dissolve the nine stars’ and eight difficulties’ misfortunes, and free them from the burdens of the five sufferings and three calamities;\nBelow, to inscribe names in the black ledgers, release them from the ghostly realm, ascend the seven ancestors to immortality, and enable the deceased to attain the Dao.\n\nNext, we pray for the people of different surnames: may they ride the scripture’s Dharma to flourish in ten thousand blessings; for the creatures of mountains and marshes: may they feel the sagely merit and all transcend to the Dao’s shore. May we be spared from illness and calamity, our thoughts ever turned to the true and the Dao, our minds cleansed and hearts stilled, aspiring to ascend lightly. Aiding others and benefiting all beings, establishing merit as the foremost task—whatever we pray for, may it swiftly be granted, known throughout heaven above and earth below.\n\nMay the life-*qi* of the Most High’s Ten Directions’ true and upright ones descend, flowing into our bodies, so that our entreaties swiftly reach the boundless Great Dao’s Three Clarities, the August Jade Thearch of the Vast Heaven, the Divine Literary Martial Filial Virtuous Loyal Benevolent King of Zitong, and the Great Merciful Savior of the Kalpa, the Ever-Living Heavenly Worthy of Renewed Life before the throne.\n\n**Incantation for Gathering Spirits**",
      "overlap_context": " recited it.\n\nThe people of Dingzhou excel in goodness beyond other prefectures,\nAnd the transformative enlightenment of the Great Emperor is most profound in this land.\nMy own incense offerings have continued for over a decade,\nUnmixed and unwavering from beginning to end.\nOnly Wenchang’s numinous response has been particularly commendable here, descending to transmit it.\n\nMoreover, I urge the faithful to carve blocks and print it for distribution—\nNow, fortunately, the task is complete.\n\nAlas!",
      "start_char": 3879,
      "end_char": 5145,
      "start_sentence": 153,
      "end_sentence": 232,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.58243942260742,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "元始大真，五雷高尊。 太华皓映，洞朗八门。 五老告命，无幽不闻。 上御九天，中制酆山。 下镇河海，十二水源。 八威神咒，灵策玉文。 召龙致雨，收气聚烟。 日月五星，北斗七元。 合明天帝，敕下太玄，宣威三界，不得稽延。 诸天诸地，诸水诸山。 玉真所部，溟泠大神。 仙王游宴，大帅仗旛。 天丁前袪，金虎后奔。 玃天猛兽，罗备四门。 所呼立至，所召立前。 赤书焕落，风火无间。 摄箓应命，金马驿传。 太上无极总真文昌大洞仙经卷之一竟 太上无极总真文昌大洞仙经卷之二",
      "translated_text": "The Primordial Origin’s Great Perfection, the Five Thunder’s Lofty Venerables.\nThe Grand Hua’s radiant brilliance illumines the Eight Gates with penetrating clarity.\nThe Five Elders proclaim their mandate—no hidden realm remains unheard.\nAbove, they govern the Nine Heavens; at the center, they command Mount Feng;\nBelow, they pacify rivers and seas, the twelve water sources.\nThe Eight Mighty Spirit Incantations, the numinous talismans of jade script,\nSummon dragons to bring rain, gather *qi* and condense mist.\nSun, moon, and the five stars; the Northern Dipper’s seven origins.\nThe Luminous Celestial Thearch unites them, decreeing the descent of the Supreme Mystery,\nProclaiming might through the Three Realms—none dare delay.\nAll heavens, all earths, all waters, all mountains,\nThe jade perfected ones’ legions, the vast and profound great spirits,\nThe Transcendent Kings at their feasts, the great marshals bearing banners,\nHeavenly soldiers clearing the way before them, golden tigers charging behind,\nFierce beasts of the Jue Heaven arrayed, guarding the four gates.\nWhat is called arrives instantly; what is summoned appears at once.\nThe vermilion writs blaze forth, wind and fire unceasing.\nRegisters are seized in response to command, golden horses speed the transmission.\n\nHere ends the first scroll of *The Supreme Mystery’s Comprehensive Perfection of Wenchang’s Great Cavern Scripture of the Dao*.\nHere begins the second scroll of *The Supreme Mystery’s Comprehensive Perfection of Wenchang’s Great Cavern Scripture of the Dao*.",
      "overlap_context": "hroughout heaven above and earth below.\n\nMay the life-*qi* of the Most High’s Ten Directions’ true and upright ones descend, flowing into our bodies, so that our entreaties swiftly reach the boundless Great Dao’s Three Clarities, the August Jade Thearch of the Vast Heaven, the Divine Literary Martial Filial Virtuous Loyal Benevolent King of Zitong, and the Great Merciful Savior of the Kalpa, the Ever-Living Heavenly Worthy of Renewed Life before the throne.\n\n**Incantation for Gathering Spirits**",
      "start_char": 5145,
      "end_char": 5389,
      "start_sentence": 233,
      "end_sentence": 251,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.991580724716187,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "甘山摩维洞主太玄无上上德真君校正 祝香 伏以祥风泽雨，锺灵秀於五香，大德至仁，鉴精诚於一缕，可通无际之际，是名非烟之烟，凭此氤氲，普伸供养，一志惟恭，万神遥鉴。 愿开金钥，仰赞瑶章，伏愿宝光分敷，梵音朗彻，死者受生，生者受度，无愿不成，天之所覆，地之所承，有缘悉证，启请有颂，谨为举扬。 各发无上至诚心，愿入文昌禄嗣会。 皈依三宝诸祖师，惟望慈悲常摄授。 仰启三清境，无上三境尊。 元始大法王，大慈真教主。 玉宸大道君，太玄真道父。 仰启大罗天，无上玄穹主。 仰启三清界，侍宸诸真众。 苍胡颉宝珠，所结大洞经。 妙道难思议，玉章生万神。 大慈元始尊，金像出地户。 化现三神人，葛衣赠金宝。 梦中袖二书，箓法并相授。 变化显文昌，随愿随灵应。 臣今 净三业，永断血尸根。 奉符入玉京，稽首黄金阙。 一心头面礼，元始大法王。 惟愿大慈悲，开受臣所请。 愿臣默想念，合符帝一前。 越度仙黄庭，俱跻大漠外。 七祖断玄滞，受事会玉皇。 愿臣讽诵时，百灵皆会集。 音彻通万天，流响达九地。 成就一切愿，如经所称述。 从此渐进修，成道事诸圣。 经筵诸孝友，金石矢初心。 一礼一称名，皈依七曲主。 注想始青天，先天长寿母。 注想紫云岩，文昌真国土。 后天慈父母，化现桂香宫。 孝子及慈孙，列仙侍慈容。 愿受真信礼，放大如意光。 随心随梦应，嗣禄互储祥。 愿我侍慈亲，生生荣鹤发。 愿我逢圣时，步步荣宠渥。 愿我处生方，随念如意光。 愿我善缘熟，学道早悟真。 愿我业垢空，惟心达净土。 普与人天众，量缘证善果。 金石一真心，真心皈帝君。 诸圣诸天尊，心香同赞祝。 愿与诸经生，一心皈命礼。 至心皈命礼 玉清圣境，清微天宫，郁罗萧台之中，森罗净泓之上，现有为之梵相，具无极之神通，敷演真玄，破无有色空之碍，拯提趣类，绝智愚高下之分，妙用难窥，灵机罔测。 大悲大愿大圣大慈无量度人元始天尊。 至心皈命礼 上清真境，禹余天宫，紫微琼台之中，玄都玉京之上，接元始虚皇之统系，超西那玉国之根苗，入黍米珠，尽挹真玄之精粹，在香林苑，屡谈秘要之筌蹄，妙德难思，神通莫议。 大悲大愿大圣大慈无量度人灵宝天尊。 至心皈命礼 太清仙境，大赤天宫，巍巍金阙之高，渺渺重霄之上，降生於无量数劫 ，说法於万二千天，五千秘言，融三才之妙道，八十余度，接六趣之众生，圣德崇高，玄功广博。 大悲大愿大圣大慈无量度人道德天尊。 至心皈命礼 紫金金阙，白玉玉京，住妙有之境中，处玄真之天上，功成道备，故妙道卓冠於诸天，心广体胖，故慈光遍烛於三界，位尊而上极无上，道妙而玄之又玄，真圣宗师，天人依仗。 大悲大愿大圣大慈穹苍圣主玉皇天尊。 至心皈命礼 股肱佐汉，家世相韩，掉三寸舌而为帝者之师，受一编书而作人中之杰，身不劳於汗马，功已着於丹书，向遇黄石公，即根本神仙之地，后从赤松子，乃飞升大有之庭，眷隆上相之尊严，位正天枢之镇重，启三洞真经之详，演膺九光宝节之荣，褒万古敷扬诸天赞重。 大悲大愿大圣大慈校经主宰 ，道高圣迈上上大德尊天帝法主道君天尊。 至心皈命礼 北上太虚无上常融天、寂虚玄梵境，太乙真庆官、真玄上圣九天游奕使，左领天罡北极右垣大将、太极真宗太玄慈父灵通大妙仙、八威九光圣执乾元帝、心印秉阴灵斗极符、总玄武右弼司判、左领圣府院，誓断妖魔，救护群品，匡扶劫运，统摄万灵，威德无边，神通浩溥，巡游十洞，检察诸天，福佑孝忠，剿除孽害，至圣至神至帅镇天真武治世福神、玉虚师相紫皇天乙真君、玄天仁威清微上帝金阙化身天尊。",
      "translated_text": "Gan Mountain’s Mowei Cave Master, the Supreme and Unsurpassed Highest Virtue Perfected Lord of the Great Mystery, having collated and rectified, now offers incense.\n\nWe bow in reverence, as auspicious winds and nurturing rains gather the numinous essence of the Five Fragrances; as boundless virtue and perfect benevolence witness the sincerity of a single wisp. This may traverse the boundless, called the smoke that is no smoke. Relying on this misty qi, we universally extend our offerings—one mind in utmost reverence, ten thousand spirits gazing from afar.\n\nMay the golden key be opened, and the jade scriptures be exalted. We pray that sacred radiance be dispersed, that Brahma’s voice resound clearly; that the dead receive rebirth, that the living attain deliverance; that no wish go unfulfilled. All beneath Heaven’s canopy, all upon Earth’s embrace—those with karmic affinity shall all realize enlightenment.\n\nWe now raise our invocation in verse:\n\nEach awakens the utmost sincere heart,\nWishing to enter Wenchang’s Assembly of Fortune and Lineage.\nWe take refuge in the Three Treasures and all patriarchs,\nHoping only for compassion’s constant embrace.\n\nWe look up to the Three Clarities’ realm,\nTo the supreme lords of the Three Realms.\nThe Primordial Beginning’s Great Dharma King,\nThe Most Compassionate True Master of Teachings.\n\nThe Jade Emperor’s Great Dao Lord,\nFather of the Great Mystery’s True Dao.\nWe look up to the Great Canopy Heaven,\nTo the supreme lord of the Mysterious Vault.\n\nWe look up to the Three Clarities’ realm,\nTo the assembled perfected hosts attending the Celestial Throne.\nCang Hu’s precious pearl,\nFrom which the Great Cavern Scriptures were woven.\nThe wondrous Dao defies thought;\nJade verses give birth to ten thousand spirits.\n\nThe Most Compassionate Primordial Beginning Venerable,\nWhose golden image emerged from the earth’s portal.\nManifesting as three divine persons,\nWho in hempen robes bestowed golden treasures.\nIn dreams, two scrolls were tucked into sleeves—\nRegisters and methods both transmitted.\nTransformations revealed Wenchang,\nResponding to wishes with numinous efficacy.\n\nWe now purify the Three Karmas,\nSevering forever the roots of blood and corpse.\nBearing the talisman, we enter the Jade Capital,\nKowtowing at the Golden Gate.\nWith whole heart, we prostrate in homage,\nTo the Primordial Beginning’s Great Dharma King.\nWe pray only for great compassion,\nTo receive our petition.\n\nMay our silent contemplation,\nMerge with the talisman before the Emperor’s Unity.\nTranscending the Yellow Court’s immortal realm,\nTogether we ascend beyond the Great Wilderness.\nMay our seven ancestors sever their dark entanglements,\nReceiving audience with the Jade Emperor.\nWhen we recite and intone,\nMay the hundred spirits all assemble.\nMay the sound penetrate the ten thousand heavens,\nIts resonance reaching the nine earths.\nMay all wishes be fulfilled,\nAs the scriptures proclaim.\nHenceforth, may we gradually cultivate,\nAttaining the Dao and serving the sages.\n\nAll scripture-assembly’s filial friends,\nPledge their original resolve like metal and stone.\nWith each bow and each invocation,\nWe take refuge in the Lord of the Seven Bends.\nWe visualize the Azure Beginning Heaven,\nThe Primordial Long-Life Mother.\nWe visualize the Purple Cloud Crag,\nWenchang’s true land.\nThe post-celestial compassionate parents,\nManifesting in the Osmanthus Fragrance Palace.\nFilial sons and loving grandsons,\nImmortals arrayed to attend their compassionate countenance.\n\nWe pray to receive the true faith’s rites,\nTo release the great wish-fulfilling radiance.\nResponding to hearts and dreams alike,\nBestowing lineage and storing blessings.\nMay we serve our compassionate kin,\nLifetimes of honor with crane-plumed hair.\nMay we encounter sagely times,\nEach step graced with abundant favor.\nWherever we dwell in life,\nMay thoughts summon the wish-fulfilling radiance.\nMay our good karma ripen,\nThat we may early awaken to the true Dao.\nMay our karmic defilements dissolve,\nThat our minds alone reach the Pure Land.\nUniversally with all beings of heaven and earth,\nMay we realize good fruits according to our capacities.\n\nOne true heart like metal and stone,\nA true heart taking refuge in the Emperor Lord.\nAll sages and all heavenly venerables,\nTogether we offer the incense of the heart in praise.\nWith all scripture students,\nWe wholeheartedly take refuge and bow in homage.\n\nWith utmost sincerity, we bow in homage to:\nThe Jade Clarity’s sacred realm, the Clear and Subtle Heavenly Palace, amidst the Yu Luo Xiao Terrace, above the Sen Luo Pure Abyss—manifesting a Brahma-like form, possessing boundless divine powers. Expounding the true and mysterious, shattering the obstructions of being and non-being, color and emptiness; delivering all classes of beings, erasing distinctions of wisdom and folly, high and low. Its wondrous workings defy fathoming, its numinous mechanism beyond measure.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Boundlessly Delivering Primordial Beginning Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Highest Clarity’s true realm, the Yu Yu Heavenly Palace, amidst the Purple Tenuity’s Jade Terrace, above the Mysterious Capital’s Jade Capital—continuing the lineage of the Primordial Beginning’s Void Sovereign, surpassing the root and sprout of the Western Na Jade Realm. Entering the millet-like pearl, fully drawing the essence of the true and mysterious; dwelling in the Fragrant Grove Garden, repeatedly discoursing on the secret essentials’ fish-traps and rabbit-snares. Its wondrous virtue defies thought, its divine powers defy discussion.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Boundlessly Delivering Numinous Treasure Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Grand Clarity’s immortal realm, the Great Crimson Heavenly Palace, towering high in the Golden Gate, far above the layered clouds—incarnated through countless kalpas, expounding the Dharma to the twelve thousand heavens. Five thousand secret words, fusing the wondrous Dao of the Three Powers; over eighty salvific methods, receiving the beings of the Six Destinies. Its sagely virtue lofty, its mysterious merit vast.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Boundlessly Delivering Dao and Virtue Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Purple Gold’s Golden Gate, the White Jade’s Jade Capital—dwelling in the realm of wondrous being, abiding in the Heaven of Mysterious Truth. Having perfected merit and completed the Dao, thus the wondrous Dao stands preeminent among all heavens; with a broad mind and expansive body, thus compassion’s light universally illumines the Three Realms. In rank, supreme and unsurpassed; in Dao, mysterious and ever more mysterious. The true sage, patriarch, and master—on whom heaven and humanity rely.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Vaulted Heaven’s Sacred Lord Jade Emperor Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Han dynasty’s stalwart minister, whose family served the Han for generations—wielding a three-inch tongue to become the emperor’s teacher, receiving a single scroll to become humanity’s paragon. His body never toiled in military campaigns, yet his merit was recorded in the Vermilion Registers. Formerly encountering the Yellow Stone Elder, he rooted himself in the land of divine immortals; later following Red Pine Master, he ascended to the Great Existence’s court. His favor exalted as the supreme minister, his position steadfast as the Heavenly Pivot’s guardian. He revealed the Three Caverns’ true scriptures in detail, bestowed the glory of the Nine Radiant Precious Nodes. Praised through the ages, extolled by all heavens.\n\nThe Great Compassionate, Great Vow-Making, Great Sage, Greatly Merciful, Collator and Lord of Scriptures, the Dao-Sublime and Sage-Surpassing Highest Great Virtue Venerable Heavenly Emperor Dharma Lord Dao Lord Heavenly Venerable.\n\nWith utmost sincerity, we bow in homage to:\nThe Supreme Void of the Northern Ascension, the Ever-Fused Heaven, the Silent Void’s Mysterious Brahma Realm; the Supreme Unity’s True Celebration Palace; the True Mystery’s Highest Sage, the Nine Heavens’ Roaming Ensign; the Great General of the Left-Guarding Celestial Pole’s Right Wall; the Supreme Ultimate’s True Lineage, the Great Mystery’s Compassionate Father, the Numinously Penetrating Great Wondrous Immortal; the Eight Might and Nine Radiance’s Sacred Holder of the Qian Yuan Emperor; the Heart Seal’s Bearer of the Yin Spirit’s Dipper Talisman; the Supreme Dark Warrior’s Right Assistant Controller; the Left-Guarding Sacred Mansion’s Court—who vows to sever demonic forces, to rescue and protect all classes of beings, to uphold the kalpic destiny, to govern the ten thousand spirits. His awe-inspiring virtue boundless, his divine powers vast and pervasive. Patrolling the Ten Caverns, inspecting all heavens; blessing the filial and loyal, exterminating calamitous harms.\n\nThe Most Sage, Most Divine, Most Marshal-like, Heaven-Pacifying, World-Blessing True Martial, Jade Void’s Preceptor and Minister, Purple Emperor Heavenly Unity Perfected Lord, Mysterious Heaven’s Benevolent and Majestic Clear and Subtle Supreme Emperor, Golden Gate’s Manifested Heavenly Venerable.",
      "overlap_context": "rayed, guarding the four gates.\nWhat is called arrives instantly; what is summoned appears at once.\nThe vermilion writs blaze forth, wind and fire unceasing.\nRegisters are seized in response to command, golden horses speed the transmission.\n\nHere ends the first scroll of *The Supreme Mystery’s Comprehensive Perfection of Wenchang’s Great Cavern Scripture of the Dao*.\nHere begins the second scroll of *The Supreme Mystery’s Comprehensive Perfection of Wenchang’s Great Cavern Scripture of the Dao*.",
      "start_char": 5389,
      "end_char": 6831,
      "start_sentence": 252,
      "end_sentence": 313,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.609822273254395,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "至心皈命礼 甘山福地摩维洞天中，有老人一炁根紫微之应化，上朝金阙九华，通碧落之生芒，说六章经陶凡炼圣之文，赞万寿观复古通今之化，扶持人极，发越地灵，道大难名，功高莫议，大仁大孝大圣大慈储福定命九天丈人、大玄无上上德真君，玄真万福天尊。 至心皈命礼 本来南土，上泝蜀都，先获黄帝九鼎之丹书，后事老君，两度於玉局千轴得修行之要，一时成吐纳之功，法箓全成，受盟威品而结璘诀，正邪两辩，夺福庭治而化咸泉，德就大丹，道齐七政，大悲大愿大圣大慈三天上相玄都丈人、扶教度人天师、正一辅元体道冲玄神化静应显佑真君、六合无穷高明大帝降魔护道天尊。 至心皈命礼 永平柱史，唐代易玄，得异术以全神，脱尘嚣而厌役，主光华之大法，悟万有之真机，遒骨常仙，留马跃入渊之迹，恕心决狱，致鼠飞穿牖之祥，受赤龙丹号碧梧子，大悲大愿大圣大慈、三天次相九炁丈人、丹琳大帝、随机演化天尊。 至心皈命礼 诞生汉室，锡号晋朝，惟布炁以降邪，曾吞虎而救世，管玉霄洞清之法，传玄坛内教之经，掌雷府刑判都督府便宜之事，领天师职升紫微天右相之班，判洞阳宫主混元教，大悲大愿大圣大慈无极真元清皇上帝、九天保册司命天尊。 至心皈命礼 德彰巴峡，迹隐渝江，幼题金榜之姓名，亲授玉阶之冕服，止杀应霜台之梦，现威变日表之容，悟最上乘以劝善，大师而友助，究真常道，假恭天观主，以讲磨膺仁济之褒，嘉表神功之莫测，镇国祚复兴之地，开蜀民再造之天，恩被群生，德隆百世，大悲大愿大圣大慈璧山显应真人清明河童天帝。 至心皈命礼　圣祖母十月初五日诞。 始青天上元命化，初一炁未漓，含七曲真元之粹，九天肇始，包三光精体之全，鸾机无兆朕之可名，鹤质仰清高而莫议，先天先地之慈母，不古不今之婉容，阳回十月五日之春，教演三纲五常之祖，寿绵长寿，形赋元形，载观本行集之跋经，莫测始青天之证道，大悲大愿大圣大慈七曲初劫赋形长生寿母太极元君。 至心皈命礼　圣父二月十一日诞。 桂香宝殿，文昌上宫。 道体混成，含九十余生之化，真元未露，储三万六千之精，开后天不老之鸾书，奉青霄莫测之态梦，神父之大慈父，至人之上善人，脉寿三纲五常之根，心包百行万善之体，皈依莫尽，称赞何忘，大悲大愿大圣大慈七曲圣父、显庆慈佑仁裕令德王玄初大帝、证果长寿王菩萨储真衍庆天尊。 至心皈命礼　圣母七月初七日诞。 桂香内殿，文昌辅宫。 淑质春和，含太真之淑气，清光秋湛，蕴七夕之清辉，包龙像於未漓，隐鸾机於不露，剑泉之大慈母，蓬莱之上善人，产万世之纲常，生九天之名教，皈依莫尽，称赞何忘，大悲大愿大圣大慈七曲圣母、昭德积庆慈懿恭惠太后、证果宝光菩萨嗣庆储祥元君。 至心皈命礼　元皇天帝二月初三日诞。 桂香宝殿，文昌上宫。 九十六生，种善果於诗书之圃，百千万化，培桂根於阴骘之田，自雷杼炳灵於凤山，至如意储祥於鳌岫，开人心，必本於笃亲之孝，寿国脉，必先於致主之忠，应梦保生，垂慈悯苦，不骄帝境玉真庆宫，现九十八化之行藏，显亿千万劫之神异，飞鸾开化，在在建坛，助国救民，人人被德，功存乎儒道释教，职尽乎天地水官，威灵不可度量，功德果难思议，至仁至孝，不乐不骄，",
      "translated_text": "With utmost sincerity, we bow in reverence to the venerable one dwelling in the blessed land of Gan Mountain, within the Mowei Grotto-Heaven. From a single qi, rooted in the Purple Tenuity’s manifestation, he ascends to the Golden Gate’s Nine Radiances, communicating the vital essence of the Azure Vault. He expounded the Six-Chapter Scripture, refining mortals into sages, and extolled the Wanshou Abbey’s restoration of ancient teachings to enlighten the present. Upholding humanity’s ultimate principle, he awakens the earth’s numinous spirits. His Dao vast beyond naming, his merits too lofty for discourse—great in benevolence, great in filial piety, great in sageliness, great in compassion—he is the Nine Heavens’ Venerable Elder, the Repository of Fortune and Ordainer of Destiny, the Supreme Dao’s Peerless and Most Virtuous Perfected Lord, the Mysterious and True Lord of Myriad Blessings, the Heavenly Venerable.\n\nWith utmost sincerity, we bow in reverence to the one originally of the southern lands, who journeyed upstream to Shu’s capital. First, he obtained the Yellow Emperor’s Nine Cauldrons’ cinnabar scriptures; later, he served the Old Lord. Twice at the Jade Bureau, he received the thousand-scroll essentials of cultivation, swiftly mastering the arts of ingestion and exhalation. His registers of the Dao complete, he swore the oath of the Alliance’s威 ranks and sealed the Linjue covenant. Discerning right from wrong, he seized the Court of Fortune’s governance to transform the Springs of Harmony. His virtue perfected in the Great Elixir, his Dao aligned with the Seven Governors—great in compassion, great in vow, great in sageliness, great in compassion—he is the Three Heavens’ Prime Minister, the Mysterious Capital’s Venerable Elder, the Heavenly Master who Upholds the Teaching and Delivers Beings, the Orthodox Unity’s Assistant to the Origin, the Embodied Dao’s Profound and Mysterious Divine Transformation, the Tranquil and Manifest Protector Perfected Lord, the Six Harmonies’ Boundless and Lofty Illustrious Great Emperor, the Demon-Quelling and Dao-Guarding Heavenly Venerable.\n\nWith utmost sincerity, we bow in reverence to the everlasting pillar of history, who in the Tang dynasty transformed through the Mysterious. Acquiring wondrous arts to preserve his spirit, he cast off worldly clamor and wearied of service. Mastering the radiant great Dharma of Light and Flower, he awakened to the true mechanism of the myriad existences. His bones ever immortal, he left the trace of a horse leaping into the abyss; his forgiving heart adjudicated cases, bringing forth the auspicious omen of a rat flying through the window. Bestowed the Red Dragon’s Elixir, styled the Azure Paulownia Master—great in compassion, great in vow, great in sageliness, great in compassion—he is the Three Heavens’ Secondary Minister, the Nine Qi’s Venerable Elder, the Cinnabar Forest Great Emperor, the Heavenly Venerable who Adapts to Circumstances and Reveals Transformations.\n\nWith utmost sincerity, we bow in reverence to the one born in the Han house, ennobled in the Jin dynasty. Solemnly deploying qi to subdue evil, he once swallowed a tiger to save the world. Holding the Jade Empyrean’s Pure Grotto Dharma, he transmitted the Dark Altar’s Inner Teachings’ scriptures. Presiding over the Thunder Bureau’s judicial and executive affairs, he assumed the Heavenly Master’s office, ascending to the Purple Tenuity Heaven’s Right Minister’s rank. Adjudicating the Dongyang Palace, he governs the Primordial Unity’s Teaching—great in compassion, great in vow, great in sageliness, great in compassion—the Boundless True Origin’s Pure August Emperor, the Nine Heavens’ Protector and Registrar of Destiny, the Heavenly Venerable.\n\nWith utmost sincerity, we bow in reverence to the one whose virtue shone in Ba Gorge and whose traces were concealed by the Yu River. In youth, his name was inscribed on the golden tablet; in person, he received the jade steps’ crown and robes. Halting slaughter in response to the Frost Terrace’s dream, he manifested his majesty in the sun’s countenance. Awakening to the Supreme Vehicle to exhort goodness, he befriended and aided the great master. Investigating the Dao of true constancy, he temporarily assumed the role of Chongtian Abbey’s abbot to lecture and refine his virtue, receiving the imperial commendation for benevolent relief. His divine merits unfathomable, he stabilized the nation’s destiny and revived its fortunes, opening a renewed heaven for Shu’s people. His grace extended to all beings, his virtue exalted for a hundred generations—great in compassion, great in vow, great in sageliness, great in compassion—the Manifested Perfected of Bishan, the Heavenly Emperor of the Luminous River Child.\n\nWith utmost sincerity, we bow in reverence to the Holy Ancestral Mother, born on the fifth day of the tenth month. At the Beginning of the Azure Heaven’s Primordial Mandate’s transformation, the first qi had not yet dispersed. She contained the essence of the Seven Bends’ true origin; at the Nine Heavens’ inception, she embraced the completeness of the Three Luminaries’ refined body. Her phoenix mechanism bore no traceable sign; her crane-like nature aspired to purity beyond discourse. The compassionate mother prior to Heaven and Earth, her graceful countenance timeless—when yang returned on the tenth month’s fifth day, she became the spring of the teaching that expounded the Three Bonds and Five Constants. Her longevity everlasting, her form endowed with primordial essence, she perused the prefaces and postscripts of her collected deeds, yet the Beginning of the Azure Heaven’s enlightenment remains unfathomable—great in compassion, great in vow, great in sageliness, great in compassion—the Seven Bends’ First Kalpa’s Form-Conferring, Longevity-Granting Mother, the Primordial Lady of the Great Ultimate.\n\nWith utmost sincerity, we bow in reverence to the Holy Father, born on the eleventh day of the second month. In the fragrant osmanthus palace, the Upper Palace of Literary Prosperity, his Dao-body perfectly formed, he contained the transformations of ninety-odd lives. His true origin yet concealed, he stored the essence of thirty-six thousand years. Unfolding the phoenix script of post-Heavenly agelessness, he received the Azure Empyrean’s unfathomable dream-state. The great compassionate father of the divine father, the supremely good man among perfected beings—his pulse the root of the Three Bonds and Five Constants, his heart the vessel of a hundred deeds and myriad virtues. Devotion to him knows no end; how could praise ever cease? Great in compassion, great in vow, great in sageliness, great in compassion—the Seven Bends’ Holy Father, the Manifestly Blessed, Compassionately Protective, Benevolent and Prosperous, Commanding Virtue King, the Primordial Great Emperor of Mysterious Inception, the Fruit-Attaining, Longevity-Granting King Bodhisattva, the Heavenly Venerable who Propagates Blessings and Extends Fortune.\n\nWith utmost sincerity, we bow in reverence to the Holy Mother, born on the seventh day of the seventh month. In the fragrant inner palace, the Auxiliary Palace of Literary Prosperity, her virtuous nature harmonious as spring, she contained the pure qi of the Great True One. Her clear radiance deep as autumn, she nurtured the Seventh Night’s luminous essence. Embracing the dragon’s image before its dispersal, concealing the phoenix’s mechanism before its revelation—great compassionate mother of the Sword Spring, supremely good woman of Penglai—she produced the bonds of ten thousand generations, gave birth to the teachings of the Nine Heavens. Devotion to her knows no end; how could praise ever cease? Great in compassion, great in vow, great in sageliness, great in compassion—the Seven Bends’ Holy Mother, the Illustrious Virtue-Accumulating, Blessing-Inheriting, Compassionate, Reverent, and Gracious Empress Dowager, the Fruit-Attaining, Treasure Radiance Bodhisattva, the Lady who Inherits Blessings and Stores Fortune.\n\nWith utmost sincerity, we bow in reverence to the Primordial August Emperor, born on the third day of the second month. In the fragrant osmanthus palace, the Upper Palace of Literary Prosperity, through ninety-six lives, he sowed the fruits of goodness in the garden of poetry and books. Through a hundred thousand myriad transformations, he cultivated the osmanthus root in the field of hidden merits. From the Thunder Loom’s illumination on Phoenix Mountain to the Auspicious Storage of Wishes on Turtle Peak, he opened human hearts, grounding them in the filial piety of profound kinship. To prolong the nation’s pulse, he first instilled loyalty to the sovereign. Responding to dreams to protect life, he extended compassion to the suffering. Unassuming in the Jade True Blessing Palace, he manifested ninety-eight transformations in concealment and revelation, displaying divine marvels across billions of kalpas. Wherever the flying phoenix spread teachings, altars were established; aiding the nation and saving the people, all received his virtue. His merits endure in the teachings of Confucianism, Daoism, and Buddhism; his office fulfills the duties of the Heaven, Earth, and Water Officials. His awe-inspiring spirit defies measure; his meritorious deeds surpass thought—supremely benevolent, supremely filial, neither joyous nor proud.",
      "overlap_context": "nd spirits. His awe-inspiring virtue boundless, his divine powers vast and pervasive. Patrolling the Ten Caverns, inspecting all heavens; blessing the filial and loyal, exterminating calamitous harms.\n\nThe Most Sage, Most Divine, Most Marshal-like, Heaven-Pacifying, World-Blessing True Martial, Jade Void’s Preceptor and Minister, Purple Emperor Heavenly Unity Perfected Lord, Mysterious Heaven’s Benevolent and Majestic Clear and Subtle Supreme Emperor, Golden Gate’s Manifested Heavenly Venerable.",
      "start_char": 6832,
      "end_char": 8135,
      "start_sentence": 314,
      "end_sentence": 334,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.47142219543457,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "大圣大慈大悲大愿神文圣武孝德忠仁王、安乐不动地游戏三昧定慧王、菩萨证果迦释梵镇如来救劫大慈悲更生永命天尊。 至心皈命礼　圣后五月初三日诞。 桂香内殿，文昌辅宫。 懿范冰清，掬九天之霁月，仁心春粹，扇七曲之家风，婉仪入侍於亲闱，慈淑天全於母道，上下一堂之和气，古今万世之春台，应梦储祥，因心演化，大仁大孝大圣大慈七曲圣后、恭顺淑应德惠昭懿皇后、证果定应菩萨冲和洞妙元君。 至心皈命礼　圣长子三月初三日诞。 桂香内殿，文昌辅宫。 圣德慈祥，一念嗣家声之脉，神功显着，九天宽帝父之心，戏彩云岩，详无体无声之礼乐，问安月窟，传有典有则之箕裘，锡五福於生生仁孝之家，榜三元於奕奕诗书之裔，因心立教，应梦储祥，至仁至孝至圣至慈圣长子嗣德履孝王、演化清微天帝、文昌衍庆真君。 至心皈命礼　圣长妇八月初一日生。 桂香内殿，文昌辅宫。 淑质春柔，粹婉容於侍问，真心玉洁，俨懿范之清高，相成震长之家声，默识兑和之阃则，教流恺悌，化洽冲和，应梦储祥，因心锡庆，至仁至孝至圣至慈圣长子妇、善助显懿循孝夫人、元真妙洞真妃、文昌静应天君。 至心皈命礼　圣次子正月初一日生。 桂香内殿，文昌辅宫。 父子一家，全克孝克慈之道，君臣千载，尽止仁止敬之心，模范人天，本纲常而立教，准绳世道，根诗礼之趋庭，干蛊於阴骘之天，福谦於行艺之圃，因心演化，应梦储祥，至仁至孝至圣至慈圣次子、昌德立孝王、演化妙成天帝、文昌司禄真君。 至心皈命礼　＝圣次子妇二月十八日诞。 桂香内殿文昌辅官。 孝德谦柔，禀一元之淑质，真心坤顺，婉七曲之闺仪，五妇岭前揭问安之华典，三潮水上流积庆之清源，应梦储祥，因心演化，至仁至孝至圣至慈圣次子 妇、助顺惠懿克孝夫人、玉真洞应真妃、文昌嗣庆天君。 至心皈命礼　懿孝公主四月十六日诞。 桂香内殿文昌辅官。 蟾魄凝祥，根父天之慈爱，鸾心敛福，陶母德之雍和，霜姿雪质之清，不物於物，春风秋月之抱，自天其天，内观万境之空幼，得九天之道，心清莫议，德婉难名，至仁至孝至圣至慈圣女、淑真妙靖懿孝公主、洞元真人、文昌万寿天君。 至心皈命礼　圣长孙七月初三日诞。 桂香内殿，文昌辅宫。 凛凛天姿，道矩肃家声之粹，挺挺风烈，仁声流化治之新，雷霆间发於春和，人人开悟，雨露旁周於天表，物物生成，应念储祥，炳灵应梦，至仁至孝至圣至慈圣长孙、绍应昭灵至孝侯、宝华圆满天君文昌积庆真人。 至心皈命礼　圣长孙妇正月二十八日诞。 桂香内殿，文昌辅宫。 圣质天姿，粹出春风之抱，仙标道矩，豁开秋月之清，四世一堂，印印闺仪之雍肃，百行万善，天天家庆之精详，应梦炳灵，随机演化，至仁至孝至圣至慈圣长孙妇、淑应昭孝夫人、玄真静素文昌积庆天君。 至心皈命礼　圣次孙十月十三日诞。 桂香内殿，文昌辅宫。 谈笑春风，字字仁心之发育，动容和气，言言家法之流传，子承圣子之心，根培阴骘，孙继神孙之体，果证真仙，应梦储祥，因心立教，至仁至孝至圣至慈圣次孙、承应宣灵顺孝侯、祖德妙清天君文昌袭庆真人。 至心皈命礼　圣次孙妇七月二十三日诞。",
      "translated_text": "Great Sage, Great Compassion, Great Mercy, Great Vow, Divine Writ, Sacred Martial, Filial Virtue, Loyal Benevolence King; King of the Playful Samādhi of the Unmoving Realm of Peace; Bodhisattva of Attained Fruition, Guardian of the Śākya, Brahmā, and Tathāgata, Great Compassionate Savior of Kalpas, Ever-Renewing Eternal Life Heavenly Worthy.\nWith utmost sincerity, we pay homage and bow in reverence.\n**Birthday of the Sacred Empress: the third day of the fifth lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHer virtuous model was pure as ice, cupping the serene moon of the nine heavens; her benevolent heart, spring’s essence, fanned the family tradition of the Seven Peaks. Her graceful bearing attended the inner chambers of her parents; her kindness and gentleness fulfilled the Way of motherhood. Harmony filled the hall above and below; she was the eternal spring pavilion of past and future ages. Responding to dreams to nurture auspiciousness, she manifested transformations from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Empress of the Seven Peaks; Reverent, Obedient, Gentle, Responsive, Virtuous, Kind, Illustrious Empress; Bodhisattva of Attained Fruition, Tranquil Harmony, Mysterious Wonder, Primordial Lady.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Eldest Son: the third day of the third lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHis sacred virtue was kind and auspicious, a single thought inheriting the family’s pulse; his divine works shone brightly, easing the heart of his imperial father across the nine heavens. Amidst the clouds of play, he detailed the formless, soundless rites of music; in the moon’s cavern, he transmitted the established, regulated legacy of his forebears. He bestowed the five blessings upon generations of benevolent, filial households; he inscribed the three firsts upon the flourishing descendants of poetry and books. Establishing teachings from the heart, responding to dreams to nurture auspiciousness—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Eldest Son, Heir of Virtue and Treader of Filial Piety; Evolver of the Pure and Subtle Heavenly Emperor; True Lord of Flourishing Literary Destiny.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Eldest Daughter-in-Law: the first day of the eighth lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHer gentle nature was spring’s softness, her pure gracefulness adorned her service; her true heart was jade’s purity, embodying the lofty virtue of her model. She complemented the family’s revered tradition of the eldest son; silently, she mastered the inner principles of harmony. Her teachings flowed with kindness and brotherly love; her transformations harmonized with tranquil harmony. Responding to dreams to nurture auspiciousness, bestowing blessings from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Eldest Daughter-in-Law; Virtuous Assistant, Illustrious, Obedient, Filial Lady; Mysterious True Wondrous Consort; Heavenly Lord of Serene Literary Response.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Son: the first day of the first lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nFather and son, one family, fully embodied the Way of filial piety and kindness; ruler and minister, through a thousand generations, fulfilled the hearts of benevolence and reverence. A model for humanity and heaven, he established teachings upon the fundamental principles; a standard for the world’s path, he rooted his conduct in the poetry and rites of the family courtyard. He rectified decay in the field of hidden virtue; he brought fortune through humility in the garden of cultivated arts. Manifesting transformations from the heart, responding to dreams to nurture auspiciousness—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Son; King of Established Filial Virtue and Flourishing Power; Evolver of the Wondrous Perfected Heavenly Emperor; True Lord of Literary Fortune.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Daughter-in-Law: the eighteenth day of the second lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHer filial virtue was modest and gentle, endowed with the pure essence of the primordial origin; her true heart was earth’s compliance, gracefully embodying the inner bearing of the Seven Peaks. Before the Five Wives’ Ridge, she upheld the splendid canon of inquiring after well-being; upon the Three Tides’ Waters, she flowed the clear source of accumulated blessings. Responding to dreams to nurture auspiciousness, manifesting transformations from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Daughter-in-Law; Assisting, Obedient, Kind, Illustrious, Filial Lady; Jade True Wondrous Responsive Consort; Heavenly Lord of Inherited Literary Blessings.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Virtuous and Filial Princess: the sixteenth day of the fourth lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nThe toad’s moon congealed auspiciousness, rooted in her father’s loving kindness; the phoenix’s heart gathered fortune, cultivated by her mother’s harmonious virtue. Her bearing was pure as frost and snow, unattached to worldly things; her embrace was spring’s wind and autumn’s moon, naturally attuned to heaven. Inwardly observing the emptiness of ten thousand realms from childhood, she attained the Dao of the nine heavens. Her heart’s clarity defied discussion; her gentle virtue eluded description—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Daughter; Gentle, True, Wondrous, Serene, Virtuous, Filial Princess; True Person of the Mysterious Origin; Heavenly Lord of Myriad Longevities of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Eldest Grandson: the third day of the seventh lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHis heavenly bearing was awe-inspiring, his Dao’s standard purified the family’s tradition; his noble character was upright, his benevolent renown renewed the governance of transformation. Thunder resounded amidst spring’s harmony, awakening all; rain and dew pervaded the heavens, nurturing all things. Responding to thoughts to nurture auspiciousness, his divine radiance answered dreams—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Eldest Grandson; Marquis of Illustrious Response and Filial Piety; Heavenly Lord of Perfect Jewel Flourishing; True Person of Accumulated Blessings of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Eldest Granddaughter-in-Law: the twenty-eighth day of the first lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHer sacred nature was a heavenly bearing, pure as spring’s embrace; her immortal demeanor was the Dao’s standard, revealing the clarity of autumn’s moon. Four generations under one roof, her inner bearing was dignified and harmonious; a hundred deeds and ten thousand virtues, her family’s blessings were meticulous and profound. Her divine radiance responded to dreams, transforming in accord with the moment—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Eldest Granddaughter-in-Law; Gentle, Responsive, Illustrious, Filial Lady; Mysterious True Serene and Pure; Heavenly Lord of Accumulated Blessings of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Grandson: the thirteenth day of the tenth lunar month.**\nWithin the Osmanthus Fragrance Inner Palace, auxiliary to the Palace of Literary Flourishing.\nHis words were spring’s wind in conversation, each character nurturing benevolence; his demeanor was harmonious, every word transmitting the family’s laws. He inherited the heart of the sacred son, cultivating roots in hidden virtue; he continued the body of the divine grandson, attaining the fruition of true immortality. Responding to dreams to nurture auspiciousness, establishing teachings from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Grandson; Marquis of Inherited Response, Illustrious, and Filial Obedience; Heavenly Lord of Wondrous Clarity of Ancestral Virtue; True Person of Inherited Blessings of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Granddaughter-in-Law: the twenty-third day of the seventh lunar month.**",
      "overlap_context": "t and revelation, displaying divine marvels across billions of kalpas. Wherever the flying phoenix spread teachings, altars were established; aiding the nation and saving the people, all received his virtue. His merits endure in the teachings of Confucianism, Daoism, and Buddhism; his office fulfills the duties of the Heaven, Earth, and Water Officials. His awe-inspiring spirit defies measure; his meritorious deeds surpass thought—supremely benevolent, supremely filial, neither joyous nor proud.",
      "start_char": 8135,
      "end_char": 9401,
      "start_sentence": 335,
      "end_sentence": 363,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.11387634277344,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "桂香内殿，文昌辅官。 玉质金姿，父母熟栽培之地，恩光化日，子孙绵嗣续之天，生根荣阴骘之根，内资相警，休命续衣冠之命，婉出相成，应梦储祥，随机演化，至仁至孝至圣至慈圣次孙妇、惠应体孝夫人、真元育粹文昌袭庆天君。 至心皈命礼 文昌佐神、太一真官天顺真君、三茅司命真君、文班左司主禄独孤大王、武班右司主嗣英惠忠烈翼济福安王、双松报喜太尉、桂禄二籍仙官、仙童玉女、飞鸾从驾，天聋地哑侍驾左右，三仙北府赞佐碧玉醮筵、云雷雨部、诸仙列圣、辅道一切真宰。 礼赞已周，依光忏悔： 七曲慈尊真教主，慈父慈母同我生。 子生圣子皆孝慈，孙继神孙尽慈孝。 一家和气天无尽，万世春台月有光。 慈光普照诸天人，细入微尘满天地。 我生同得乾坤体，一似文昌始劫时。 圣非自圣凡自凡，流浪至今方觉悟。 愿逢七曲慈尊教，惟忠惟孝惟慈心。 不以口业傲神人，不以身业累父母。 不以意业欺天地，不以心业祸子孙。 愿从孝行与阴功，种种力行诸方便。 忏赎多生诸罪垢，皈依元皇大慈光。 求嗣求禄求生方，不求诸人求诸己。 惟我文昌七曲师，历劫待人存恕法。 愿放一种如意光，悯念众生真忏悔。 忏悔已周，次当发愿： 父母愿同长寿果，龟龄鹤发映慈光。 己身愿拜大吉祥，仰事俯育无苦恼。 子孙愿嗅云岩桂，嘉与己身同发荣。 父慈子孝一家春，光明无负慈尊教。 愿蒙七曲亲提接，指引登真入道门。 舍生受生正遍知，尽未来世俱圆满。 发愿已周，次当赞颂： 桂香殿上仁孝主，教雨周流洗业根。 业根化作桂华香，善本种成长寿果。 一家骨肉无烦恼，七曲子孙同护持。 普愿今世与来生，紫云岩前成道果。 步步心心帝左右，生生世世天主张。 骨凡身换形可灰，一点真心自金石。 发如是愿者，是日爰有本贯弟子某稽首元始天王、千真万圣，持诵大洞仙经，丐赐赦过宥罪，改祸成祥，恶根断绝，进道无魔，祖先父母早度南宫，获生中土，眷缘众生，均赖陶镕，灾殃殄灭，所伸凡恳干冒天威，愿冀感通，曲从所请，伏愿香火使者领兹丹恳，普为关闻，稽首皈依： 三清应化天尊。 玉清普化天尊。",
      "translated_text": "Within the osmanthus-scented inner palace, the Literary Flourishing assists the official duties. Her jade-like essence and golden bearing were the very soil where her parents’ careful cultivation took root; her grace and radiance shone like the transforming sun, the very heaven where descendants’ lineage would perpetuate. She nurtured the roots of hidden virtue, her inner resources mutually awakening; she extended the mandate of cap-and-robe, her gentle emergence mutually completing. Responding to dreams to nurture auspiciousness, adapting to circumstances to unfold transformations—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Granddaughter-in-Law; Lady of Kindly Response and Embodied Filial Piety; Heavenly Lord of True Origin, Cultivated Essence, Literary Flourishing, and Inherited Blessings.\nWith utmost sincerity, we pay homage and bow in reverence.\n\nTo the assisting deities of Literary Flourishing: Heavenly Compliant True Lord of the Great One; True Lords of the Three Mao who Govern Life; Lord of Emoluments, Duke Dugu, Left Controller of the Civil Register; King of Prosperity and Peace, Right Controller of the Martial Register, Heroic, Loyal, and Winged in Aid; Marshal of Twin Pines Reporting Auspiciousness; Immortal Officials of the Two Osmanthus and Emolument Registers; Jade Boys and Jade Maidens; Flying Phoenixes in attendance; the Heavenly Deaf and Earthly Mute serving at left and right; the Three Immortals of the Northern Bureau assisting the jade ritual altar; the Cloud, Thunder, and Rain Departments; all the Immortal Worthies and Sages; and all the true lords who assist the Dao.\n\nThe rites of praise now complete, we rely upon your light to repent:\nSeven-Curved Merciful Venerable, true master of the teaching,\nMerciful father, merciful mother, born together with me.\nChildren born as sacred children are all filial and kind;\nGrandchildren who continue as divine grandchildren are all kind and filial.\nOne family’s harmonious qi knows no end;\nFor ten thousand generations, the moon shines upon the spring terrace.\nMerciful light universally illuminates all heavenly beings,\nSubtly entering the tiniest dust to fill heaven and earth.\nMy life shares the same body as heaven and earth,\nJust like Literary Flourishing at the beginning of kalpas.\nThe sacred is not sacred of itself, nor the ordinary ordinary of itself—\nOnly after drifting to this day do we awaken.\nMay we encounter the teaching of the Seven-Curved Merciful Venerable,\nDevoted to loyalty, to filial piety, to a merciful heart.\nNot with verbal karma to scorn gods and humans,\nNot with bodily karma to burden parents,\nNot with mental karma to deceive heaven and earth,\nNot with heart karma to bring calamity upon descendants.\nMay we follow filial conduct and hidden merit,\nPracticing all manner of skillful means in every direction.\nRepenting and redeeming the stains of many lives’ transgressions,\nWe take refuge in the primordial sovereign’s great merciful light.\nSeeking descendants, seeking emolument, seeking the means of life—\nWe seek not from others but from ourselves.\nOnly our teacher, Literary Flourishing of the Seven Curves,\nThrough kalpas awaits others with the law of forbearance.\nMay you release a single wish-fulfilling light,\nCompassionately mindful of all beings in true repentance.\n\nRepentance now complete, we proceed to make vows:\nMay parents together attain the fruit of longevity,\nTortoise years and crane hair reflecting merciful light.\nMay I myself bow to great good fortune,\nHonoring those above and nurturing those below without suffering.\nMay descendants inhale the osmanthus of clouded cliffs,\nFlourishing together with me in fine splendor.\nFather’s kindness and children’s filial piety bring spring to the whole family,\nBrightness unbetraying the Merciful Venerable’s teaching.\nMay we receive the Seven-Curved One’s personal guidance,\nPointing the way to ascend as immortals and enter the Dao’s gate.\nAbandoning life and receiving life, perfectly and universally knowing,\nMay all be fulfilled through endless future kalpas.\n\nVows now complete, we proceed to praise:\nWithin the osmanthus-scented palace, host of benevolence and filial piety,\nYour teaching rain flows everywhere, washing away karmic roots.\nKarmic roots transform into osmanthus blossoms’ fragrance,\nGood roots planted to bear the fruit of longevity.\nOne family’s flesh and blood without affliction,\nSeven-Curved descendants together protecting and sustaining.\nUniversally vowing for this life and the next,\nBefore the Purple Cloud Cliff, attaining the Dao’s fruit.\nStep by step, heart by heart, at the Emperor’s side,\nLife after life, the heavens ordain.\nThough bones may be ordinary and the body reduced to ashes,\nA single point of true heart is naturally like metal and stone.\n\nThose who make such vows—on this day, the disciple of this locale, so-and-so, bows to the Primordial Heavenly King and the thousand true and ten thousand sacred beings, holding and reciting the *Great Cavern Immortal Scripture*, beseeching the granting of pardon for transgressions and forgiveness of sins, transforming misfortune into auspiciousness, severing evil roots, advancing in the Dao without demonic obstruction, enabling ancestors and parents to swiftly cross over to the Southern Palace, attaining rebirth in the Middle Land, and may all sentient beings of the family circle equally rely upon refinement. May disasters and calamities be extinguished. In presenting these humble entreaties, we presume upon your heavenly majesty, hoping for sympathetic resonance and gracious compliance with our requests. We humbly pray that the incense-attending messengers convey these sincere entreaties, universally making them known. We bow in reverence and take refuge:\nIn the Three Pure Ones, Heavenly Worthies of Response and Transformation.\nIn the Jade Pure One, Heavenly Worthy of Universal Transformation.",
      "overlap_context": "nurture auspiciousness, establishing teachings from the heart—Great Benevolence, Great Filial Piety, Great Sage, Great Compassion, Sacred Second Grandson; Marquis of Inherited Response, Illustrious, and Filial Obedience; Heavenly Lord of Wondrous Clarity of Ancestral Virtue; True Person of Inherited Blessings of Literary Flourishing.\nWith utmost sincerity, we pay homage and bow in reverence.\n\n**Birthday of the Sacred Second Granddaughter-in-Law: the twenty-third day of the seventh lunar month.**",
      "start_char": 9402,
      "end_char": 10308,
      "start_sentence": 364,
      "end_sentence": 399,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.93790078163147,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "太乙救苦天尊。 天枢上相法主道君天尊。 终劫济苦天尊。 消灾解厄天尊。 雷声普化天尊。 玄真万福天尊。 斗府天曹列位星君。 三元三官大帝三百六十应感天尊。 定光澄明普度天尊。 紫清介福天尊。 更生永命天尊。 无量度人天尊。 普天忏罪天尊。 十方灵宝天尊。 不可思议功德，当愿众生心开悟解，受持转诵。 元皇全号 金阙上相检校太师、混元内辅三清上宰大都督府、都统三界阴兵行便宜事、管天地水三界狱事、收五岳四渎真形虎符龙券、总诸天星曜、判桂禄嗣籍、上仙英显元皇真人、司禄职贡举真君、洞照通真先生，编修飞仙列籍、掌混元造化轮回六道救苦救难慈尊、玉清内境清静道真、身现紫云岩、手持如玉杖、统御万灵溥济诸苦大仁大孝大圣大慈无上不骄乐育天帝、都统混天诚心接物万天教主，随愿慈应天尊、九天定元保生扶教辅元开化文昌度人主宰、长乐永佑灵应大天帝君、掌五湖四海总十二河源水府运使定慧王、菩萨证果迦释梵镇如来、澄真正观注禄定籍、宝光慈应治世显道、保安拔罪更生永命、扶善济苦消劫行化纯一显应天尊。 太上无极总真文昌大洞仙经卷之二竟 太上无极总真文昌大洞仙经卷之三",
      "translated_text": "The Heavenly Worthy of Great Unity and Salvation from Suffering.\nThe Heavenly Worthy of the Celestial Pivot, Prime Minister and Dharma Lord.\nThe Heavenly Worthy of Salvation from Suffering at the End of Kalpas.\nThe Heavenly Worthy of Dispelling Disasters and Resolving Adversities.\nThe Heavenly Worthy of Thunder’s Universal Transformation.\nThe Heavenly Worthy of Mysterious Perfection and Myriad Blessings.\nThe Star Lords of the Dipper Mansion and the Celestial Ministries.\nThe Three Hundred and Sixty Heavenly Worthies of Response and Transformation of the Three Primes and Three Officials.\nThe Heavenly Worthy of Settling Light, Clarity, and Universal Salvation.\nThe Heavenly Worthy of Purple Purity and Conferring Blessings.\nThe Heavenly Worthy of Renewal and Eternal Life.\nThe Heavenly Worthy of Boundless Salvation of Beings.\nThe Heavenly Worthy of Universal Repentance of Sins.\nThe Heavenly Worthies of the Ten Directions and Numinous Treasure.\nMay the inconceivable merits and virtues inspire all beings to awaken and comprehend, to receive, uphold, transmit, and recite.\n\nThe August and Complete Titles of the Primordial Sovereign:\nGrand Preceptor of the Golden Watchtower, Inspector-General, Grand Preceptor of the Supreme Unity, Inner Assistant to the Three Pure Ones, Grand Marshal of the Great Supervisory Office, Commander-in-Chief of the Three Realms’ Yin Troops with Discretionary Powers, Overseer of the Prisons of Heaven, Earth, and Water, Holder of the Tiger Tallies and Dragon Credentials of the Five Marchmounts and Four Watercourses, Director of All Celestial Stars and Constellations, Arbiter of the Registers of Cassia and Emoluments, Supreme Perfected of the Primordial Sovereign of the Illustrious and Manifest, True Lord of the Bureau of Emoluments and Tribute, Perfected Lord of the Examination of Merit, Master of Penetrating Illumination and Perfected Communication, Compiler of the Registers of Flying Immortals, Keeper of the Primordial Wheel of Transformation and the Six Paths, Compassionate Sovereign of Salvation from Suffering and Deliverance from Difficulty, Pure and Tranquil Perfected of the Inner Realm of Jade Purity, Whose Body Manifests upon the Purple Cloud Crag, Who Holds a Jade Staff, Who Governs the Myriad Spirits and Universally Relieves All Sufferings, Great Benevolent, Great Filial, Great Sage, Great Compassionate, Supreme, Unarrogant, Joyfully Nurturing Heavenly Thearch, Commander-in-Chief of the Primordial Unity of Heaven, Lord of the Myriad Heavens Who Responds with Compassion to All Wishes, Heavenly Worthy of Response to Compassionate Vows, Heavenly Thearch of the Nine Heavens Who Stabilizes the Primordial, Protects Life, Upholds the Dao, Assists the Primordial, and Opens Civilization, Lord of Salvation of Beings and Ruler of Wenchang, Heavenly Thearch of Eternal Joy and Eternal Protection with Numinous Response, King of Concentration and Wisdom Who Governs the Five Lakes, Four Seas, and the Twelve River Sources, Water Bureau Commissioner, Bodhisattva Who Attains the Fruit of Buddhahood, Tathāgata of the Śākya, Brahmā, and Indra’s Realm, Who Settles the True, Contemplates Correctly, and Annotates the Registers of Emoluments, Heavenly Worthy of Treasure Light, Compassionate Response, Manifest Dao, and Governance of the World, Who Protects and Pacifies, Eradicates Sins, Renews and Grants Eternal Life, Upholds Goodness, Relieves Suffering, Dispels Kalpas, Enacts Transformation, and Manifests Pure and Unified Response.\n\nThe Second Scroll of *The Supreme, Boundless, Primordial, and Perfect Wenchang Great Cavern Sutra* Concludes.\n\nThe Third Scroll of *The Supreme, Boundless, Primordial, and Perfect Wenchang Great Cavern Sutra*.",
      "overlap_context": "ment. May disasters and calamities be extinguished. In presenting these humble entreaties, we presume upon your heavenly majesty, hoping for sympathetic resonance and gracious compliance with our requests. We humbly pray that the incense-attending messengers convey these sincere entreaties, universally making them known. We bow in reverence and take refuge:\nIn the Three Pure Ones, Heavenly Worthies of Response and Transformation.\nIn the Jade Pure One, Heavenly Worthy of Universal Transformation.",
      "start_char": 10309,
      "end_char": 10816,
      "start_sentence": 400,
      "end_sentence": 418,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.89600920677185,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "甘山摩维洞主太玄无上上德真君校正 玄蕴咒 玄元始炁分，清华开洞神。 灵风回太和，玉音摄流精。 至哉本自然，谁识此玄文。 坚刚明一悟，倏忽超三乘。 寂寂无色根，永劫奚漂沉。 胡能精修持，究竟登玉清。 道言：昔在龙汉劫初，元始天王出《大洞玉经》於高上大有玉清宫，演太玄重玄玄一之道，命之曰《大洞仙经》。 元始天王始以太玄一音，流响玉清，弘帝一真道，说大洞宝文，示九统之法，传九光之符，至士诵之，登斋修行即得万神欢庆，百灵护持，万圣感格，万仙翕临，可以飞度三灾四煞、五鬼六害、七伤八难、九厄十恶，登仙入圣，神生紫微，自然无为，不系阴阳五行六炁之所拘束，念念增长，趣入大乘，弘之无穷，诸天下观玉帝降鉴，飞天保迎亿曾万祖历劫种亲，游爽飞魂，俱得更生，世冑接仙，长为贵人，功满道备，骨肉同升，乘龙驾云，上朝玉清。 元始天王啸咏太玄，凝神遐想而说洞章： 高上洞元，元生九天。 炁祖太无，宗风胤玄。 玄曾绝散，四清抚闲。 帝一上景，连众摄烟。 长契一运，七世投闲。 托灵属命，反华自然。 泯邈流辉，六曜沉迁。 陵范御晖，西华彰安。 并编帝简，尽得解源。 胎田邃路，世发玉兰。 灵光八辉，混生万神。 元始天王曰： 玉虚顺玄归，天晨金霄游。 朗朗生帝景，欻尔宴玉洲。 左摄始童神，右命起恒符。 明真焕九霄，三日映玄敷。 干景并三衿，内有幽寥无。 令我得长年，千劫始一周。 黄箓保德仞，披锦入神丘。 太一务命根，公子召合符。 十回度初心，得入大信根。 元始天王曰： 玉帝玄上旛，制命九天阶。 七觉成道数，欢熙神风回。 飙灿北停华，紫英唱东琼。 琳和九霄外，玉符征太微。 三素生泥丸，发曜金灵晖。 老君牢张上，守卫死节机。 十善生玄中，度厄而自然。 元始天王曰： 太冥绝九玄，洞景寄神通。 玉帝乘朱霄，绿霞焕金墉。 上馆云珠内，仰接玄仞峰。 灵关太漠下，蔼沬竟冲空。 冥化混离坎，玄玄叔火王。 玮寂高同生，无极保谷童。 圆涂无凝滞，绮合有九重。 南披七祖根，西解累劫凶。 体娇万津波，神生摄十方。 大归反胎辕，三合乘天龙。 元始天王日： 太微天帝宫，八浮入云营。 神宗理灵襟，龙山秀玉京。 金房郁明霞，九户朗高琼。 黄庭涉北元，元父左回明。 朱晶启明师，幽寥登上清。 四玄秉元禁，长保五帝城。 元始天王曰： 紫精太无中，三元上景衢。 秀朗保太晖，眇眇扇帝敷。 伯史启三素，帝灵登玉虚。 庆炁育五云，司命神明初。 十华妙行仙，制魔生六明。 元始天王曰： 真阳帝宾老，受事会玉皇。 灭魔除秽水，百司诣绛宫。 逸宅丹玄内，五炁结十方。 七转司命至，三回召仙公。 泰山主鬼者，急校三官中。 十德初成基，同飞七觉元。 元始天王曰： 太素三华炁，晨登广灵堂。 玉宾表玄籍，守命孩道康。 徊风散万魔，金符召广乡。 辅卫地户内，保此长生王。 转入十仙门，八景齐洞阳。 元始天王曰： 紫精毓华林，长暝太无外。 玉房生宝云，九扇胞胎内。 帝宾奉五符，三光回紫盖。 苍玉斌来生，卫此长夜会。 五灵度符籍，九统合九光。 三玄出太清，紫阳发万生。 玄精育九灵，元父结胎仙。 元始天王曰： 青灵扇八炁，鼓轮三华城。 拔兆胞胎结，七世受福生。",
      "translated_text": "The Master of Gan Mountain’s Mowei Grotto, Supreme and Unsurpassed True Lord of Highest Virtue, Rectifies the Mysterious Storehouse Incantation:\n\nThe Primordial qi of the Mysterious Origin divides,\nPure radiance opens the grotto’s spirits.\nA numinous wind revolves the Great Harmony,\nJade tones gather the flowing essence.\nSupreme is this, fundamentally natural—\nWho recognizes this mysterious text?\nFirm and resolute, illumined in singular awakening,\nIn an instant one transcends the Three Vehicles.\nStill and silent, without root of form,\nThrough kalpas eternal, how could one drift or sink?\nWho can refine and uphold this practice?\nUltimately, one ascends to Jade Clarity.\n\nThe Dao speaks: In the primordial Dragon Han kalpa, the Celestial King of the Origin of Origins revealed *The Jade Sutra of the Great Grotto* within the Highest and Vast Jade Clarity Palace. He expounded the Dao of the Supreme Mystery and the Mystery of Mysteries, naming it *The Great Grotto Sutra of the Immortals*. The Celestial King of the Origin of Origins first intoned the Supreme Mystery in a single sound, its resonance flowing through Jade Clarity. He propagated the Imperial Singular True Dao, proclaimed the precious texts of the Great Grotto, demonstrated the methods of the Nine Governances, and transmitted the talismans of the Nine Lights. When scholars recite these, upon purifying themselves and cultivating practice, they immediately gain the joyous celebration of the myriad spirits, the protection of the hundred numina, the resonance of the ten thousand sages, and the presence of the ten thousand immortals. Thereby, one may transcend the Three Calamities and Four Malevolences, the Five Demons and Six Harms, the Seven Injuries and Eight Difficulties, the Nine Adversities and Ten Evils. One ascends as an immortal, enters sagehood, and the spirit is born in Purple Tenuity. Naturally and effortlessly, one is unbound by the constraints of yin and yang, the Five Phases, or the Six qi. With each thought, one grows, hastening toward the Great Vehicle, propagating it endlessly. The myriad heavens below observe, and the Jade Emperor descends his gaze. Flying immortals safeguard and welcome one’s ancestors through kalpas past, their ethereal souls and wandering spirits all attaining rebirth. Lineages connect with immortals, becoming eternally noble. When merit is fulfilled and the Dao perfected, flesh and bone ascend together, riding dragons and driving clouds to ascend and pay homage in Jade Clarity.\n\nThe Celestial King of the Origin of Origins, whistling and chanting the Supreme Mystery, concentrated his spirit in distant contemplation and proclaimed the Grotto’s chapters:\n\nSupreme Grotto of the Origin,\nThe Origin gives birth to the Nine Heavens.\nThe Ancestor of qi is the Supreme Nonbeing,\nThe lineage of wind inherits the Mystery.\nThe Mystery’s transmission once severed,\nThe Four Clarities soothed and pacified.\nThe Imperial Singular’s Upper Radiance,\nLinked with the multitudes, gathers the mists.\nLong bound to the singular destiny,\nSeven generations cast into tranquility.\nEntrusting the numinous, attaching to life,\nReturning to the splendor of the natural.\nVast and distant, flowing radiance,\nThe Six Luminaries sink and shift.\nAscending the model, wielding brilliance,\nWestern Florescence manifests peace.\nAll inscribed in the Imperial Registers,\nFully attaining liberation at the source.\nThe Womb Field’s profound path,\nGenerations bring forth jade orchids.\nNuminous light of eightfold radiance,\nIntermingling births the myriad spirits.\n\nThe Celestial King of the Origin of Origins says:\nJade Emptiness follows the Mystery in return,\nRoaming the Golden Dawn of the Celestial Morn.\nBrightly shines the Imperial Radiance,\nSuddenly one feasts on Jade Isle.\nTo the left, the Beginning Youth is gathered,\nTo the right, the Eternal Talisman is summoned.\nIlluminating the true, resplendent in the Nine Heavens,\nThree suns reflect the unfolding Mystery.\nThe Dry Radiance joins the Three Collars,\nWithin lies the profound and boundless void.\nGrant me long years,\nA thousand kalpas mark but one cycle.\nThe Yellow Register guards virtue’s measure,\nDonning brocade, one enters the divine mounds.\nThe Supreme Singular attends to the root of life,\nThe Duke’s son summons the united talisman.\nTen revolutions fulfill the initial resolve,\nAttaining entry into the root of great faith.\n\nThe Celestial King of the Origin of Origins says:\nThe Jade Emperor’s Mysterious Upper Banner,\nCommands the steps of the Nine Heavens.\nThe Seven Awakenings complete the Dao’s reckoning,\nJoyous and harmonious, the divine wind returns.\nThe whirlwind gleams, halting in Northern Florescence,\nPurple blossoms sing in Eastern Jasper.\nJade harmony beyond the Nine Heavens,\nThe Jade Talisman summons Supreme Tenuity.\nThe Three Pristines give birth in the Mud Pill,\nRadiating the golden numinous brilliance.\nThe Venerable Lord firmly upholds the summit,\nGuarding the mechanism of life and death’s fidelity.\nThe Ten Virtues arise within the Mystery,\nTranscending adversity, naturally.\n\nThe Celestial King of the Origin of Origins says:\nThe Supreme Darkness severs the Nine Mysteries,\nThe Grotto’s radiance entrusts divine communion.\nThe Jade Emperor rides the Vermilion Dawn,\nGreen auroras illumine the golden ramparts.\nThe Upper Palace within the cloud’s pearls,\nGazing upward, one meets the Mysterious Summit’s peak.\nThe Numinous Pass beneath the Great Desert,\nMists and foam surge into the void.\nThe Dark Transformation blends Kan and Li,\nThe Mysterious of Mysteries, the Young Fire King.\nRare stillness, lofty and co-arising,\nThe Boundless protects the Valley Youth.\nThe Round Way knows no stagnation,\nWondrous union possesses nine layers.\nTo the south, the roots of seven ancestors are untied,\nTo the west, the misfortunes of accumulated kalpas are dissolved.\nThe body transcends the myriad tidal waves,\nThe spirit gathers the ten directions.\nGreat return reverses the Womb Chariot,\nThe Three Unions ride the Celestial Dragon.\n\nThe Celestial King of the Origin of Origins says:\nThe Palace of the Celestial Emperor of Supreme Tenuity,\nEight floats enter the cloud’s encampment.\nThe Divine Clan governs the numinous heart,\nDragon Mountain flourishes in Jade Capital.\nThe Golden Chamber dense with bright auroras,\nNine gates gleam with lofty jasper.\nThe Yellow Court traverses Northern Origin,\nThe Origin Father turns left in radiance.\nVermilion crystal awakens the Illuminating Master,\nThe profound and boundless ascends Upper Clarity.\nThe Four Mysteries hold the Origin’s prohibitions,\nEternally safeguarding the Five Emperor Cities.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Purple Essence of Supreme Nonbeing,\nThe Three Origins ascend the Radiant Way.\nFlourishing and bright, guarding the Supreme Brilliance,\nVast and distant, fanning the Imperial unfolding.\nThe Earl of History initiates the Three Pristines,\nThe Imperial Numen ascends Jade Emptiness.\nAuspicious qi nurtures the Five Clouds,\nThe Controller of Destinies, the numinous inception.\nThe Ten Florals, wondrous immortal practices,\nSubdue demons, giving birth to the Six Illuminations.\n\nThe Celestial King of the Origin of Origins says:\nThe True Yang’s Imperial Guest, the Venerable,\nReceives affairs in the Jade Emperor’s court.\nAnnihilating demons, purging filthy waters,\nThe hundred offices proceed to the Crimson Palace.\nThe Leisurely Abode within Cinnabar Mystery,\nThe Five qi bind the ten directions.\nSeven revolutions, the Controller of Destinies arrives,\nThree returns summon the Immortal Duke.\nThe Lord of Ghosts of Mount Tai,\nSwiftly examines within the Three Offices.\nThe Ten Virtues form the initial foundation,\nTogether flying with the Seven Awakening Origins.\n\nThe Celestial King of the Origin of Origins says:\nThe Three Floral qi of Supreme Pristine,\nAt dawn ascend the Vast Numinous Hall.\nThe Jade Guest manifests the Mysterious Register,\nGuarding life, the child’s Dao is at peace.\nThe revolving wind scatters the myriad demons,\nThe golden talisman summons the vast realm.\nAssisting and safeguarding within the Earth’s Gates,\nProtecting this King of Eternal Life.\nTurning, one enters the Ten Immortal Gates,\nThe Eight Sceneries together illumine the Grotto’s yang.\n\nThe Celestial King of the Origin of Origins says:\nThe Purple Essence nurtures the Floral Grove,\nEternally dark beyond Supreme Nonbeing.\nThe Jade Chamber gives birth to precious clouds,\nWithin the ninefold womb and embryo.\nThe Imperial Guest presents the Five Talismans,\nThe Three Lights revolve the Purple Canopy.\nAzure jade refines the coming life,\nSafeguarding this Eternal Night Assembly.\nThe Five Numinous transmit the talismanic registers,\nThe Nine Governances unite the Nine Lights.\nThe Three Mysteries emerge from Supreme Clarity,\nPurple Yang emits the myriad lives.\nMysterious essence nurtures the Nine Numinous,\nThe Origin Father binds the Womb Immortals.\n\nThe Celestial King of the Origin of Origins says:\nThe Azure Numinous fans the Eight qi,\nDrumming the wheels of the Three Floral City.\nLiberating the embryo’s knots of the multitudes,\nSeven generations receive blessed birth.",
      "overlap_context": "ly Worthy of Treasure Light, Compassionate Response, Manifest Dao, and Governance of the World, Who Protects and Pacifies, Eradicates Sins, Renews and Grants Eternal Life, Upholds Goodness, Relieves Suffering, Dispels Kalpas, Enacts Transformation, and Manifests Pure and Unified Response.\n\nThe Second Scroll of *The Supreme, Boundless, Primordial, and Perfect Wenchang Great Cavern Sutra* Concludes.\n\nThe Third Scroll of *The Supreme, Boundless, Primordial, and Perfect Wenchang Great Cavern Sutra*.",
      "start_char": 10816,
      "end_char": 12175,
      "start_sentence": 419,
      "end_sentence": 506,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.84649586677551,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "宿对灭五道，长守帝一营。 公子执五符，太一居紫房。 三合地户下，拔命玉帝宫。 少女郁墨子，卫兆七炁窗。 拘制盟血液，盈满五藏充。 十真登黄房，帝子化金仙。 白玉飞符招，引升龙台天。 元始天王曰： 高上宴紫霄，五老辅玉根。 太素拂眇景，合符帝一前。 白帝皓郁将，回金太霞乡。 度我死户下，拔出三途梁。 十通由斯生，妙行由此兴。 洞明光景中，帝一真玄玄。 太上无极总真文昌大洞仙经卷之三竟 太上无极总真文昌大洞仙经卷之四 甘山摩维洞主太玄无上上德真君校正 道言：尔时，元始天王眉放青毫，顶旋紫炁，万华宝盖，浮罗覆形，玉光金霞，纡绚晃耀。 玉宸道君太玄道父，稽首颙伫，愿听洞章，於是元始天王怡然啸咏曰： 皇上超无景，轮转九曜生。 徊风混帝心，八炁运常宁。 广霞参神天，五帝散日精。 液溢元中漠，血凝五华平。 体宝圆珠映，流曜拔兆形。 号为寿逸阜，亦曰澄溱渟。 俱济三涂关，启籍登太明。 使子保仙真，七世披缘青。 解祸冥途下，超福晨上灵。 世世登玉乡，累祖反胎婴。 洞观无碍空，始通生因明。 骊珠湛方瞳，内外洞照清。 元始天王曰： 玉宸九天司，太上大道生。 常保景化内，九回镜上清。 解带玉映室，乘素入四明。 擭提日中王，并羽月晨灵。 太一召天魔，帝君校万精。 拔过死积炁，越度仙黄庭。 帝立三关上，八风舞神兵。 左把福醴液，右提庆源缾。 洞微无障玄，梵通生虚明。 贯颡闻十方，豁落一切声。 元始天王曰： 泰清浮绝空，三天宝神符。 日中开五晖，青帝圆常无。 捧籍登太明，受录金华楼。 五藏植玉根，魂魄一凝和。 洞空清净玄，炁通生清明。 定和妙明觉，玄息自长生。 元始天王曰： 太极元景王，三天摄神生。 紫素翳郁仞，安来上华京。 拔出五苦积，返胎七元庭。 九玄解重结，累祖乐锦清。 徘徊秀华下，俯仰要五灵。 兆身升玉堂，五神回孩婴。 俱跻太漠外，养素朝圆明。 洞虚清净和，华通引玄明。 砥炼五牙珠，含善味长生。 元始天王曰： 皇初紫元中，晖光郁霄明。 三天焕九景，离合亿万生。 披珠巾绿霞，上徊寒童灵。 拔出五苦毒，超身过始青。 白素启萧仞，金门卫朱兵。 七世积尸结，一化百散倾。 受福东霞室，反胎朱火庭。 洞灵清净行，力通自冲明。 净真手握斗，足蹑九元星。 挥执天地关，精神生命根。 元始天王曰： 无英真上玄，玄元九素炁。 寄频携运珠，混化启明日。 正一左右仙，长扶灵虚室。 兆有玉符籍，合仙得真炁。 魂生太无中，魄亦五道会。 世世解死户，七祖无住滞。 神风吹胞树，根叶已断绝。 胎中种鬼殃，五符开地结。 长为神真王，应仙续万世。 洞真清净身，道通自然质。 真应化现相，不动住黄室。 应化无方在，骨肉金玉实。 静真明正道，至老长不易。 元始天王曰： 中央黄素炁，圆华玉寿灵。 太张上玉门，伏云三仞明。 青景翳逸寥，携提太一精。 帝女抱定陵，吟咏玉清经。 五籍编紫房，五符入圆庭。 七祖反胎宅，灭绝三途生。 流风断血滞，玄叶得黄宁。 洞玄清净光，元命灵通成。 性命宗本坚，孝道成明王。 生根得太和，无为登上清。 元始天王曰： 青精上华炁，太微玄景童。 神化玉室内，飞羽逸紫空。 日为三衿交，奉符登帝墉。 开关把金节，闭户扣琼锺。",
      "translated_text": "The lodging aligns to extinguish the Five Paths,\nEternally guarding the Imperial Unity’s camp.\nThe Duke’s son holds the Five Talismans,\nThe Great Unity resides in the Purple Chamber.\nBeneath the Triune Earth Gate,\nLiberating lives from the Jade Emperor’s palace.\nThe Maiden with Dark Radiance,\nSafeguards the multitudes at the Seven qi Window.\nBinding and restraining the blood-oath covenants,\nFilling and fulfilling the Five Viscera.\nThe Ten Perfected ascend the Yellow Chamber,\nThe Imperial Son transforms into Golden Immortals.\nWhite jade talismans fly forth in summons,\nDrawing them upward to the Dragon Terrace Heaven.\n\nThe Celestial King of the Origin of Origins says:\nOn high, feasting in the Purple Empyrean,\nThe Five Elders assist the Jade Root.\nThe Primordial Simplicity brushes the ethereal radiance,\nUniting talismans before the Imperial Unity.\nThe White Emperor commands the luminous generals,\nRevolving gold toward the Great Auroral Land.\nDelivering me from beneath the Gate of Death,\nLiberating from the Three Wretched Paths’ bridge.\nThe Ten Penetrations arise from this,\nWondrous practices flourish thereby.\nWithin the luminous clarity of the Dao,\nThe Imperial Unity’s true mystery is profoundly abstruse.\n\n*End of the Upper Scripture of the Vast Cavern of Wenchang, the Unbounded and Supreme Perfected Text, Scroll Three*\n*Beginning of the Upper Scripture of the Vast Cavern of Wenchang, the Unbounded and Supreme Perfected Text, Scroll Four*\n\nThe Mountain of Sweetness’ Mo-Wei Cavern Master, the Supreme and Utmost Virtuous Perfected Lord of the Great Mystery, collated and corrected.\n\nThe Dao speaks: At that time, the Celestial King of the Origin of Origins emitted azure rays from his brows, his crown revolving with purple qi. A canopy of myriad blossoms and precious jewels floated above, a net of gauze veiling his form. Jade light and golden auroras intertwined, shimmering in radiant splendor.\n\nThe Jade Clarity Dao Lord, the Great Mystery Dao Father, bowed his head in reverent anticipation, wishing to hear the Cavern Chapters. Thereupon, the Celestial King of the Origin of Origins joyfully intoned:\n\nThe August Supreme transcends the formless,\nRevolving the Nine Luminaries to life.\nThe circling winds blend with the Imperial Heart,\nThe Eight qi operate in eternal tranquility.\nVast auroras intermingle with the divine heavens,\nThe Five Emperors scatter solar essence.\nElixir overflows within the Primordial Void,\nBlood congeals, the Five Blossoms level.\nThe body treasures the round pearl’s reflection,\nFlowing radiance liberates the multitudes’ forms.\nNamed the Abundance of Longevity and Ease,\nAlso called the Clarity of Still Depths.\nTogether crossing the Three Wretched Passes,\nOpening registers to ascend the Great Clarity.\nEnabling you to preserve the immortal truth,\nSeven generations don the verdant karmic robes.\nUnraveling calamities beneath the nether paths,\nSurpassing blessings to the morning’s numinous heights.\nGeneration after generation ascending to the Jade Land,\nAncestors returning to the womb’s infancy.\nPerceiving the unimpeded emptiness of the Cavern,\nFirst penetrating the illumination of karmic causes.\nThe lustrous pearl settles in the square pupils,\nWithin and without, the Cavern’s clarity shines.\n\nThe Celestial King of the Origin of Origins says:\nThe Jade Clarity governs the Nine Heavens,\nThe Supreme Great Dao gives birth.\nEternally preserving within the radiant transformations,\nNine revolutions mirror the Upper Clarity.\nLoosening the sash in the jade-lit chamber,\nMounting the plainness to enter the Four Clarities.\nSeizing the Sun’s Central King,\nJoining wings with the Moon’s Morning Numinous.\nThe Great Unity summons the celestial demons,\nThe Imperial Lords examine the myriad essences.\nLiberating from the accumulated qi of death,\nTranscending to the Yellow Court of Immortals.\nThe Emperor stands atop the Three Passes,\nThe Eight Winds dance with divine soldiers.\nIn the left hand, grasping the nectar of blessings,\nIn the right, lifting the vase of felicitous origins.\nThe Cavern’s subtlety is unimpeded mystery,\nBrahmā’s penetration engenders empty clarity.\nPiercing the forehead to hear the Ten Directions,\nExpansively falling away—all sounds.\n\nThe Celestial King of the Origin of Origins says:\nThe Grand Clarity floats in the absolute void,\nThe Three Heavens’ treasure of divine talismans.\nWithin the sun, the Five Radiance unfold,\nThe Azure Emperor perfects eternal nonbeing.\nHolding registers to ascend the Great Clarity,\nReceiving records at the Golden Flower Tower.\nThe Five Viscera plant the Jade Root,\nSoul and spirit unite in harmonious fusion.\nThe Cavern’s emptiness is pure and mysterious,\nQi flows to engender clarity and brightness.\nStabilizing harmony, wondrous luminous awakening,\nThe Dao’s breath naturally ensures long life.\n\nThe Celestial King of the Origin of Origins says:\nThe Primordial King of the Supreme Ultimate’s Radiance,\nThe Three Heavens gather the divine lives.\nPurple Simplicity veils the towering peaks,\nPeacefully arriving at the Upper Flowery Capital.\nLiberating from the Five Sufferings’ accumulation,\nReturning to the womb of the Seven Origins’ court.\nThe Nine Mysteries unravel the heavy knots,\nAncestors delight in the brocade’s purity.\nWandering beneath the elegant blossoms,\nLooking up and down to seek the Five Numinous.\nThe multitudes’ bodies ascend the Jade Hall,\nThe Five Spirits return to infancy.\nTogether ascending beyond the Great Void,\nNurturing simplicity to attend the Round Clarity.\nThe Cavern’s emptiness is pure and harmonious,\nFlowery penetration guides the mysterious brightness.\nTempering the Five Canine Pearls,\nEmbracing goodness to savor eternal life.\n\nThe Celestial King of the Origin of Origins says:\nIn the August Beginning’s Purple Primordial midst,\nRadiance and light flourish in the empyrean’s brightness.\nThe Three Heavens illumine the Nine Effulgences,\nSeparating and uniting the myriad lives.\nDonning pearl-hemmed green auroras,\nRevolving above the Cold Lad’s numinous.\nLiberating from the Five Poisons’ afflictions,\nSurpassing the body beyond the Beginning Azure.\nWhite Simplicity opens the towering peaks,\nThe Golden Gate guards the Vermilion Soldiers.\nSeven generations’ accumulated corpse-knots,\nA single transformation scatters a hundred collapses.\nReceiving blessings in the Eastern Auroral Chamber,\nReturning to the womb of the Vermilion Fire Court.\nThe Cavern’s numinosity is pure and practiced,\nPower flows to naturally penetrate clarity.\nThe Perfected Pure One’s hands grasp the Dipper,\nFeet tread the Nine Origins’ stars.\nWielding the Heaven and Earth’s passes,\nSpirit and essence are the root of life.\n\nThe Celestial King of the Origin of Origins says:\nThe Peerless True Supreme Mystery,\nThe Primordial Nine Simplicities’ qi.\nEntrusting the forehead with the revolving pearl,\nBlending transformations to inaugurate tomorrow’s sun.\nThe Orthodox Unity’s left and right immortals,\nEternally supporting the Numinous Void’s chamber.\nThe multitudes possess jade talismanic registers,\nUniting with immortals to obtain the true qi.\nThe hun is born within the Supreme Nonbeing,\nThe po also meets the Five Paths.\nGeneration after generation, liberating from the Gate of Death,\nSeven ancestors without lingering obstructions.\nDivine winds blow upon the womb’s tree,\nRoots and leaves already severed.\nWithin the womb, planting ghostly calamities,\nThe Five Talismans open the earth’s knots.\nEternally becoming the Divine Perfected King,\nResponding to immortals to continue myriad generations.\nThe Cavern’s truth is the pure and tranquil body,\nThe Dao flows through the natural substance.\nTrue responses manifest in forms,\nUnmoving, abiding in the Yellow Chamber.\nResponsive transformations exist without fixed direction,\nBones and flesh are solid as gold and jade.\nThe tranquil truth illumines the correct Dao,\nUnchanging even unto old age.\n\nThe Celestial King of the Origin of Origins says:\nThe Central Yellow Simplicity’s qi,\nThe Round Flower’s Jade Longevity Numinous.\nThe Great Spread of the Upper Jade Gate,\nSubduing clouds in the threefold peaks’ brightness.\nAzure radiance veils the boundless,\nCarrying the Great Unity’s essence.\nThe Imperial Maiden embraces the Stable Mound,\nChanting the Jade Clarity’s scriptures.\nThe Five Registers compile in the Purple Chamber,\nThe Five Talismans enter the Round Court.\nSeven ancestors return to the womb’s abode,\nExtinguishing the Three Wretched Paths’ lives.\nFlowing winds sever blood’s stagnation,\nThe mysterious leaves attain Yellow Tranquility.\nThe Cavern’s mystery is pure and luminous,\nThe primordial life’s numinous penetration achieves completion.\nNature and life’s ancestral root is firm,\nFilial piety perfects the Illuminated King.\nPlanting roots to obtain the Great Harmony,\nThrough nonaction ascending the Upper Clarity.\n\nThe Celestial King of the Origin of Origins says:\nThe Azure Essence’s Upper Flowery qi,\nThe Great Tenuity’s mysterious radiant lad.\nDivine transformations within the Jade Chamber,\nFlying feathers soar through the purple void.\nThe sun as the Three Collars’ intersection,\nPresenting talismans to ascend the Imperial Ramparts.\nOpening passes to grasp the golden tally,\nClosing gates to strike the jade bell.",
      "overlap_context": "y.\nThe Five Numinous transmit the talismanic registers,\nThe Nine Governances unite the Nine Lights.\nThe Three Mysteries emerge from Supreme Clarity,\nPurple Yang emits the myriad lives.\nMysterious essence nurtures the Nine Numinous,\nThe Origin Father binds the Womb Immortals.\n\nThe Celestial King of the Origin of Origins says:\nThe Azure Numinous fans the Eight qi,\nDrumming the wheels of the Three Floral City.\nLiberating the embryo’s knots of the multitudes,\nSeven generations receive blessed birth.",
      "start_char": 12176,
      "end_char": 13556,
      "start_sentence": 507,
      "end_sentence": 606,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.970091342926025,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "灭魔三酆野，招灵上清宫。 明出穷关阴，入精六合房。 回老变皓形，还白返婴童。 洞源清净光，津液具神通。 咽液生万神，神水华池融。 涌升灌而润，往来无有穷。 通生道之源，天根常茂丰。 元始天王曰： 太阳化三晨，紫軿微玄下。 元君保谷童，守胃塞死户。 金符焕北华，玉契拔七祖。 帝真灌上生，断我三途苦。 洞明清净光，帝心大玄通。 宿命过去智，根本元由中。 未来及他心，一切无碍融。 洞源与洞明，万道由通生。 元始天王曰： 太初九素炁，炁出华景中。 法垣舞仙旗，逡巡五老公。 天人名启珠，执籍归紫房。 元父左回明，混会太微童。 洞清明智慧，太意朗元通。 根尘悉消灭，有无皆虚空。 妙行真一全，名大心神通。 道备登玉清，位为圣仙翁。 元天王曰： 元始授太玄，苍胡颉宝珠。 檀炽钧音妙，希声彻太虚。 九皇上真炁，四司大仙王。 飞霞散天日，凝涣六合房。 上清朝玉虚，乘景晨晖中。 三神号发纽，捧籍启虚皇。 逸录登紫清，金符刻羽宫。 顶玄苍胡颉，弘济登普光。 运度玄中人，咽味生五芳。 结集成胎仙，丹母金真阳。 主伴合元范，太易生玄乡。 太上无极总真文昌大洞仙经卷之四竟 太上无极总真文昌大洞仙经卷之五 甘山摩维洞主太玄无上上德真君校正 道言：尔时 ，元始天王以大洞高上混沌太无元天宝玉皇之炁，结一宝珠，命之曰苍胡颉，曰：吾以此宝珠从道妙一，善贷生根，孕玄分元，诞始传真，化生诸天，凝成万炁，大哉至宝，惟我独存。 今为玉宸道君重出斯宝，诸天帝王、天真大圣瞻望宝光，其光分敷百千万亿，结成《大洞仙经》玉文，凝而成云，绚而成章，诸天帝王天真大圣，以清明识，以始通观，以华舌通，齐声宣咏大洞云章，响彻万天，流响九地，天界地界，水界神乡，一切神灵，不离本坐，俱睹云章，绚目仙梵，历耳皆悉，百生障灭，万劫尘消，三涂九幽，十方恶趣，咸承光音，所及十缠九结六染七尘，於是顷间一时解脱。 是时太玄道父前诣萧台，再拜稽首，求受宝珠所结《大洞仙经》玉文云章，庶以导化人天众生，俱免万灾，咸消众罪，不沉恶趣，俱等一乘，弘是愿育，殷勤启请。 元始天王命元神大圣玉宸道君具俯仰威仪，手付太玄道父苍胡颉宝。 元始天王告曰：此苍胡颉宝，与檀炽钧音，若非太玄，可得求请，唯子慈深愿重，可畀宝章。 元始天王曰： 天皇上真炁，三元乘晨回。 法垣兴朱霄，帝晶启玉扉。 拔尸命门内，解结桃康阶。 敛神保五籍，越转入太微。 单入而双修，一曲水天开。 海日自东生，元命生太初。 元始天王曰： 太一生元炁，日中司命童。 焕然神光明，披霞升帝墉。 列坐震灵席，混合五日房。 白炁育 上生，青君安延昌。 左携精上门，右抱合和婴。 我生日月华，友宾赤炁王。 八景照泥丸，朗然洞房中。 婴儿为赤子，混离生玉容。 五道秀金华，位为上清公。 七祖断玄滞，身得乘神风。 徘徊玉清上，和乐反婴童。 太始三炁周，真文肇生明。 元始天王曰： 元虚黄房内，中有黄宁童。 左有坚玉君，右有帝昌皇。 浮清翳神炁，蔚蔚虚灵容。 青肝明轮子，开朗彻八窗。 太一寿丘兰，奉符入玉宫。 拔我七世罪，回元期十通。 混合帝一室，五老变孩蒙。 太素梵行初，一善四金通。",
      "translated_text": "The vanquishing of demons spans the Three Feng Wastes,\nSummoning spirits to ascend the Upper Clarity Palace.\nEmerging radiant from the darkest Yin Pass,\nEntering refined into the Six Harmonies’ Chamber.\nReversing age to transform into hoary form,\nReturning white to revert as an infant child.\nThe Cavern’s source shines with pure luminous light,\nEssential fluids possess numinous penetration.\nSwallowing fluids to generate the ten thousand spirits,\nSpirit-water fuses with the Flowery Pool.\nSurging upward to irrigate and moisten,\nComing and going without end.\nCommunicating with the source of the life-generating Dao,\nThe Heavenly Root ever flourishes in abundance.\n\nThe Celestial King of the Origin of Origins says:\nThe Great Yang transforms the Three Mornings,\nThe purple chariot descends in subtle mystery.\nThe Primordial Lord guards the Valley Child,\nSealing the stomach to block death’s gate.\nThe golden tally blazes in Northern Florescence,\nThe jade contract extricates the seven ancestors.\nThe Imperial Perfected irrigates Upper Life,\nSevering my suffering of the Three Paths.\nThe Cavern’s clarity shines with pure luminous light,\nThe Emperor’s heart achieves great mysterious penetration.\nThe knowledge of past lives and former existences,\nThe root and origin reside within the Primordial Cause.\nFuture lives and others’ minds,\nAll fuse without obstruction.\nThe Cavern’s source and the Cavern’s clarity,\nThe ten thousand Dao arise from penetrating life.\n\nThe Celestial King of the Origin of Origins says:\nIn the Great Beginning’s ninefold pure qi,\nQi emerges from the Flowery Radiance’s midst.\nThe Dharma Enclosure dances with immortal banners,\nThe Five Elder Lords advance in solemn procession.\nHeavenly beings bear the Pearl of Initiation,\nHolding registers to return to the Purple Chamber.\nThe Primordial Father revolves leftward in luminous clarity,\nMerging with the Great Tenuity’s child.\nThe Cavern’s purity illumines wisdom,\nThe Great Intent resonates with the Primordial Penetration.\nRoot and dust wholly dissolve,\nBeing and nonbeing all become empty void.\nThe wondrous practice perfects the True One,\nNamed as the great heart’s numinous penetration.\nThe Dao complete, one ascends Jade Clarity,\nAttaining the rank of Sage Immortal Elder.\n\nThe Celestial King of the Origin says:\nThe Primordial Beginning bestows the Great Mystery,\nThe Azure Barbarian presents the precious pearl.\nThe sandalwood’s blazing melody is wondrous,\nIts subtle sound pervades the Great Void.\nThe Nine August Ones’ Upper Perfected qi,\nThe Four Directors’ Great Immortal Kings.\nFlying auroras scatter the sun of heaven,\nCongealing and dispersing within the Six Harmonies’ Chamber.\nUpper Clarity pays court to Jade Void,\nRiding the radiance within the morning’s brilliance.\nThe Three Spirits proclaim the Unfastening Cord,\nBearing registers to initiate the Void Emperor.\nSoaring records ascend Purple Clarity,\nGolden tallies inscribed in the Feathered Palace.\nCrowning the Azure Barbarian’s head,\nVast salvation ascends Universal Radiance.\nConveying those within the Mysterious Center,\nSwallowing essences to generate the Five Fragrances.\nGathering and coalescing into the Womb Immortal,\nThe Cinnabar Mother and Golden Perfected Yang.\nHost and companion unite with the Primordial Model,\nThe Great Simplicity generates the Mysterious Realm.\n\nThe Most High, Limitless, and Perfect Wondrous Script of the Celestial Writ of the Great Cavern, Scroll Four concludes.\nThe Most High, Limitless, and Perfect Wondrous Script of the Celestial Writ of the Great Cavern, Scroll Five\n\nThe Supreme Perfected Lord of the Great Mystery, Highest Virtue of Gan Mountain’s Mo Wei Cavern, collated and corrected.\n\nThe Dao speaks: At that time, the Celestial King of the Origin of Origins, with the qi of the Highest Cavern’s Primordial Chaos, the Great Nonbeing, the Primordial Heaven’s Treasure, and the Jade Emperor, coalesced a precious pearl, naming it the Azure Barbarian, saying: “I, with this precious pearl, follow the Dao’s wondrous unity, benevolently bestowing the root of life, gestating the mysterious and dividing the primordial, giving birth to the beginning and transmitting the Perfected, transforming and generating the various heavens, congealing into the ten thousand qi. Vast and supreme treasure, only I alone preserve it.\n\nNow, for the Jade Palace Dao Lord, this treasure is reissued. The Celestial Emperor Kings and Heavenly Perfected Great Sages gaze upon the treasure’s radiance, its light spreading into hundreds of thousands of myriads of millions, coalescing into the *Wondrous Script of the Great Cavern*’s jade writ, congealing into clouds, shimmering into chapters. The Celestial Emperor Kings and Heavenly Perfected Great Sages, with pure luminous discernment, with primal penetrating vision, with flowery tongues’ penetration, in unison intone the Great Cavern’s cloud chapters. Their resonance pervades the ten thousand heavens, their echoes flow through the nine earths. Heavenly realms, earthly realms, water realms, and divine lands—all spirits and numina, not leaving their original seats, together behold the cloud chapters, their eyes dazzled by immortal Sanskrit, their ears all attaining comprehension. A hundred lifetimes’ obstructions extinguished, ten thousand kalpas’ dust dissolved. The Three Paths and Nine Dark Realms, the ten directions’ evil destinies, all receive the light and sound. Wherever it reaches, the ten fetters, nine knots, six defilements, and seven dusts—in this instant, all simultaneously attain liberation.\n\nAt that time, the Great Mystery Dao Father approached the Xiao Terrace, prostrating twice and bowing his head, seeking to receive the precious pearl’s coalesced *Wondrous Script of the Great Cavern*’s jade writ and cloud chapters, hoping thereby to guide and transform the beings of heaven and humanity, all to avoid the ten thousand disasters, all to dissolve the multitude of sins, not to sink into evil destinies, all to attain the One Vehicle. Vastly nurturing this vow, he earnestly entreated.\n\nThe Celestial King of the Origin of Origins commanded the Perfected Jade Palace Dao Lord, the Great Sage of the Primordial Spirit, to assume the proper dignified deportment, and personally bestowed the Azure Barbarian Pearl upon the Great Mystery Dao Father.\n\nThe Celestial King of the Origin of Origins proclaimed: “This Azure Barbarian Pearl, together with the sandalwood’s blazing melody—were it not for the Great Mystery, one could not seek or request it. Only your profound compassion and weighty vows permit the bestowal of this precious writ.”\n\nThe Celestial King of the Origin of Origins says:\nThe Heavenly August Ones’ Upper Perfected qi,\nThe Three Origins ride the morning’s return.\nThe Dharma Enclosure arises in Vermilion Empyrean,\nThe Imperial Crystals open the Jade Gates.\nExtricating corpses from the Gate of Life,\nUnbinding knots on the Peach Health Stair.\nGathering spirits to preserve the Five Registers,\nRevolving to ascend into the Great Tenuity.\nAlone entering yet doubly cultivating,\nA single melody opens the water and heaven.\nThe sea’s sun rises naturally from the east,\nThe primordial life generates the Great Beginning.\n\nThe Celestial King of the Origin of Origins says:\nThe Great One generates the primordial qi,\nThe child who governs life within the sun.\nResplendent with numinous radiant light,\nDonning auroras to ascend the Imperial Ramparts.\nSeated in array upon the Thunder Spirit’s mat,\nMerging within the Five Suns’ Chamber.\nWhite qi nurtures Upper Life,\nThe Azure Lord secures prolonged prosperity.\nLeft, grasping the Gate of Essence Above,\nRight, embracing the Infant of Union and Harmony.\nMy life generates the sun and moon’s splendor,\nFellow guests with the Red Qi King.\nEight Auroras illuminate the Mud Pill,\nLuminously within the Cavern’s Chamber.\nThe infant becomes the Red Child,\nMerging and parting to generate the Jade Countenance.\nThe Five Dao flourish with golden splendor,\nAttaining the rank of Upper Clarity Lord.\nThe seven ancestors sever the mysterious stagnation,\nThe body attains to ride the spirit wind.\nWandering above Jade Clarity,\nHarmoniously returning as an infant child.\nThe Great Beginning’s three qi cycle,\nThe Perfected Writ inaugurates luminous life.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Primordial Void’s Yellow Chamber,\nThere resides the Yellow Tranquility Child.\nTo the left, the Firm Jade Lord,\nTo the right, the Imperial Prosperity August.\nFloating clarity veils the spirit qi,\nLuxuriant and vast, the empty numinous countenance.\nThe Azure Liver’s Bright Wheel Child,\nOpening and illuminating through the Eight Windows.\nThe Great One and Longevity Mound’s orchid,\nPresenting tallies to enter the Jade Palace.\nExtricating my seven generations’ sins,\nRevolving the primordial to await the Ten Penetrations.\nMerging within the Emperor’s One Chamber,\nThe Five Elders transform into infant ignorance.\nThe Great Simplicity’s Brahmanic practice begins,\nOne goodness penetrates the Four Golds.",
      "overlap_context": "ng.\nPlanting roots to obtain the Great Harmony,\nThrough nonaction ascending the Upper Clarity.\n\nThe Celestial King of the Origin of Origins says:\nThe Azure Essence’s Upper Flowery qi,\nThe Great Tenuity’s mysterious radiant lad.\nDivine transformations within the Jade Chamber,\nFlying feathers soar through the purple void.\nThe sun as the Three Collars’ intersection,\nPresenting talismans to ascend the Imperial Ramparts.\nOpening passes to grasp the golden tally,\nClosing gates to strike the jade bell.",
      "start_char": 13557,
      "end_char": 14893,
      "start_sentence": 607,
      "end_sentence": 680,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.31673765182495,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "元始天王曰： 太极主四真，凌羽逸上清。 七转召司命，太一扬威明。 司录促诣位，三举登震灵。 魔王来受事，仙官束鬼精。 月中青帝母，号曰芬艳婴。 太张上五符，安来上玉名。 混化六合内，洞房列火兵。 太极五灵冲，横文帝子宾。 元始天王曰： 斗中四真人，散花玉清台。 帝卿中玄生，一徊众真来。 香风扇三宝，五藏映清夷。 苍胡颉光华，檀炽钧吉祥。 太中六炁清，曲水襄天河。 六度功圆成，五魔伐六阴。 中结元始王，高观六合庭。 元始天王曰： 晨中黄景炁，三秀登霄庭。 沧台飞羽轮，延迎道已成。 司命奉帝书，号为玄度卿。 保生太霞宫，列宾馆上清。 命门合精延，守我身黄宁。 左携元素君，右摄朱郁灵。 太和度七觉，点火生真文。 紫华领胎仙，元命真中神。 元始天王曰： 金阙上景炁，十方晖紫烟。 三命太一帝，五召太平神。 七转招岳真，玉符告三官。 拔籍三灵下，受生高上晨。 太帝八灵王，一化回庆玄。 桃君守六合，勒精卫泥丸。 太清八景观，十德真文宣。 保子神中神，元命生自然。 元始天王曰： 太虚空无景，霞中有彭室。 九云合重扉，帝君静幽密。 八真合景君，上携女太一。 雌雄混玉房，九变还得七。 分形散六合，泥丸易分别。 太真九光轮，十佺丿文结。 保子元炁通，五炁理中颉。 混一归帝阙，永寿无终劫。 变化飞上清，三千行超越。 元始天王曰： 太玄九炁上，烟回大晖间。 神光秀空峰，五道焕三天。 驾景登绝霄，乘风荡滞神。 中一日运珠，理心入清闲。 混合三五宫，累变亿万年。 伐绝胞树生，永断血尸根。 七祖散积滞，返华黑幽玄。 万炁生万神，齐仙成仙王。 太玄启十明，妙行登十真。 元始天王曰： 上清绝霞外，八皇运九天。 幽寥生帝宇，携此景中人。 晨登太老寝，夕宴金华轩。 羽节命太一，锦旗招万神。 坚我六府胎，伐灭胞树根。 解结生七祖，散祸宁九玄。 赤帝丹灵峙，扶兆入玉门。 月母灵素兰，守闭死炁关。 死炁自今绝，生津从兹延。 万神万炁仙，超脱位真王。 十真妙行全，太玄会明阳。 无上大洞尊，一炁同龙光。 元始天王曰： 东华发始晖，高晨映上清。 焕洞圆珠蔼，朗朗紫曜明。 七神回帝席，五老飞玉軿。 太一景中立，司命摄万精。 泛然云波间，寂盻泥丸城。 七转召三官，北君稽首灵。 五岳应炁到，拔死书长生。 三举震灵符，玄解大魔精。 七祖解血结，玄华保黄宁。 元始天王曰： 太帝九老京，校仙登扶桑。 七转召天帝，司命乘神纲。 五岳启灵户，传声大魔王。 河海皆受事，立尔应会方。 保符泥丸内，守神曰桃康。 回明易死籍，记仙叔火王。 拔绝三途疾，去祸生上英。 七玄登朱室，兆身会玉堂。 上友方盈子，下携理维藏。 左摄明车君，右辅归盛昌。 混一玉京炁，化兆吉以昌。 反婴元命童，檀炽吉祥钧。 天一元根仙，自在光明轮。 元始天王曰： 玉清万华宫，高仙藏帝经。 主图九天表，洞观无中生。 七转召万神，五岳一来庭。 三官招众魔，司录校所呈。 拔籍重泉曲，记仙书上清。 元始天王曰： 玄洲绝三津，羽景太无庭。 回霄飞垂漠，委化混万精。 五云蔚绝空，七霞落圆明。 朗朗幽寥子，梵昌济黄宁。 五老挥绛华，散香携玉灵。 金质濯帝川，绿烟蔼流琼。 神拔三涂积，仙胎结兆形。",
      "translated_text": "The Celestial King of the Origin of Origins says:\nThe Supreme Ultimate governs the Four Perfected,\nSoaring on feathered wings through the Upper Clarity.\nSeven revolutions summon the Controller of Destinies,\nAs the Great One displays radiant majesty.\nThe Recorder hastens to the appointed station,\nThreefold ascent to the numinous Thunder.\nDemon kings come to receive their duties,\nImmortal officials bind ghostly essences.\nWithin the moon dwells the Azure Emperor’s Mother,\nNamed Fragrant Radiance Infant.\nThe Great Expansion unfolds the Five Talismans,\nPeacefully inscribing the Jade Register above.\nWithin the Six Harmonies all transforms,\nThe Bridal Chamber arrays the Fire Soldiers.\nThe Supreme Ultimate’s Five Numinous Surges,\nThe Emperor’s Son as guest with the Horizontal Script.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Dipper dwell the Four Perfected,\nScattering blossoms upon the Jade Clarity Terrace.\nThe Imperial Minister engenders the Central Mystery,\nOne revolution and the host of Perfected arrive.\nFragrant winds fan the Three Treasures,\nThe Five Viscera reflect the Clear Tranquility.\nThe Azure Hu’s luminous splendor,\nThe Sandalwood’s blazing auspicious hook.\nThe Great Centrality’s Six Qi purify,\nThe Winding Waters embrace the Celestial River.\nThe Six Perfections’ merit is perfected,\nThe Five Demons fell the Six Yin.\nAt the center binds the King of the Origin of Origins,\nGazing from on high upon the Six Harmonies’ court.\n\nThe Celestial King of the Origin of Origins says:\nAt dawn the Yellow Radiance qi,\nThreefold refinement ascends the Empyrean court.\nFrom the Azure Terrace the feathered wheels take flight,\nExtending welcome as the Dao is accomplished.\nThe Controller of Destinies presents the Emperor’s writ,\nNamed the Dark Passage Minister.\nPreserving life within the Great Rosy Cloud Palace,\nArraying guests in the Upper Clarity’s hostel.\nThe Gate of Destiny joins with essence to extend,\nGuarding my body’s Yellow Tranquility.\nTo the left he grasps the Primordial Simplicity Lord,\nTo the right he seizes the Vermilion Luxuriance Spirit.\nThe Great Harmony ferries the Seven Awakenings,\nKindling fire to generate the Perfected Writ.\nThe Purple Blossom leads the Womb Immortals,\nThe Origin’s Mandate as the Perfected within the Perfected.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Golden Watchtower the Supreme Radiance qi,\nThe Ten Directions glow with purple mist.\nThe Three Mandates of the Great One Emperor,\nFive summonses to the Great Peace spirits.\nSeven revolutions beckon the Peak Perfected,\nJade talismans announce to the Three Bureaus.\nExtracting the registers from beneath the Three Numinous,\nReceiving rebirth in the Highest Dawn.\nThe Supreme Emperor of the Eight Numinous,\nOne transformation returns to Mysterious Felicity.\nThe Peach Lord guards the Six Harmonies,\nInscribing essence to defend the Muddy Pellet.\nThe Supreme Clarity’s Eightfold Radiance observes,\nThe Ten Virtues proclaim the Perfected Writ.\nPreserving the child as the Perfected within the Perfected,\nThe Origin’s Mandate arises naturally.\n\nThe Celestial King of the Origin of Origins says:\nThe Great Void holds no scene,\nYet within the rosy clouds stands Peng’s Chamber.\nNinefold clouds seal the layered gates,\nThe Emperor Lord abides in serene seclusion.\nThe Eight Perfected join with the Radiance Lord,\nAscending with the Female Great One.\nMale and female merge within the Jade Chamber,\nNine transformations return to attain the Seven.\nDispersing forms throughout the Six Harmonies,\nThe Muddy Pellet’s distinctions are easily made.\nThe Great Perfected’s Ninefold Light Wheel,\nThe Ten Companions knot the Writ’s patterns.\nPreserving the child’s Origin qi flows,\nThe Five qi govern the Central Prowess.\nMerging as one to return to the Emperor’s watchtower,\nEternal longevity without end or kalpa.\nTransforming to soar through the Upper Clarity,\nSurpassing the Three Thousand Practices.\n\nThe Celestial King of the Origin of Origins says:\nAbove the Great Mystery’s Nine qi,\nMists swirl amidst the Great Radiance.\nDivine light blooms upon the empty peaks,\nThe Five Paths illumine the Three Heavens.\nMounting the radiance to ascend the Absolute Empyrean,\nRiding the winds to dispel stagnant spirits.\nWithin the center a single sun revolves the pearl,\nGoverning the heart to enter tranquil leisure.\nMerging within the Three and Five Palaces,\nLayered transformations through myriad eons.\nFelling the womb’s tree at its root,\nForever severing the blood corpse’s source.\nSeven ancestors disperse accumulated stagnation,\nReturning blossoms to the Dark Mystery’s depths.\nMyriad qi generate myriad spirits,\nAll immortals become Immortal Kings.\nThe Great Mystery initiates the Ten Clarities,\nWondrous practices ascend the Ten Perfected.\n\nThe Celestial King of the Origin of Origins says:\nBeyond the Upper Clarity’s Absolute Rosy Clouds,\nThe Eight Emperors revolve the Nine Heavens.\nFrom the profound and boundless arises the Emperor’s abode,\nBearing these Radiance-dwelling persons.\nAt dawn ascending the Supreme Elder’s chamber,\nAt dusk feasting in the Golden Blossom Pavilion.\nFeathered tablets command the Great One,\nBroidered banners summon the myriad spirits.\nStrengthening my Six Palaces’ embryo,\nFelling the womb tree’s root.\nUntying the knots of the seven ancestors,\nDispersing calamities to pacify the Nine Mysteries.\nThe Vermilion Emperor’s Cinnabar Numinous stands guard,\nSupporting the omen to enter the Jade Gate.\nThe Moon Mother’s Numinous Simplicity Orchid,\nGuards the closure of the death qi’s pass.\nFrom this day forth death qi is forever severed,\nLife’s fluids henceforth extend.\nMyriad spirits and myriad qi immortals,\nTranscending to become Perfected Kings.\nThe Ten Perfected’s wondrous practices complete,\nThe Great Mystery unites the Bright Yang.\n\nThe Supreme Worthy of the Great Cavern,\nOne qi conjoins with the Dragon’s Radiance.\n\nThe Celestial King of the Origin of Origins says:\nEastern Florescence emits its first radiance,\nThe High Dawn reflects the Upper Clarity.\nResplendent the Luminous Pearl’s mist,\nLustrous the Purple Brilliance’s clarity.\nSeven spirits return to the Emperor’s seat,\nFive Elders fly upon jade carriages.\nThe Great One stands within the Radiance,\nThe Controller of Destinies gathers the myriad essences.\nFloating amidst the cloud waves,\nSilently gazing upon the Muddy Pellet’s citadel.\nSeven revolutions summon the Three Bureaus,\nThe Northern Lord bows to the numinous.\nThe Five Peaks respond to the qi’s arrival,\nExtracting death’s register for eternal life.\nThreefold ascent of the Thunder Numinous talisman,\nMysteriously dissolving the Great Demon’s essence.\nSeven ancestors untie the blood knots,\nThe Dark Blossom preserves the Yellow Tranquility.\n\nThe Celestial King of the Origin of Origins says:\nThe Supreme Emperor’s Nine Elders’ capital,\nReviewing immortals to ascend Fusang.\nSeven revolutions summon the Celestial Emperor,\nThe Controller of Destinies rides the spirit’s net.\nThe Five Peaks open their numinous portals,\nTransmitting voices to the Great Demon King.\nRivers and seas all receive their duties,\nEstablishing your responsive assembly.\nPreserving the talisman within the Muddy Pellet,\nGuarding the spirit named Peach Prosperity.\nReversing illumination to alter death’s register,\nRecording immortality as the Fire King’s uncle.\nSevering the Three Paths’ afflictions,\nRemoving calamities to birth the Supreme Flower.\nThe Seven Mysteries ascend the Vermilion Chamber,\nThe omen’s body meets in the Jade Hall.\nAbove befriending the Square Fullness Child,\nBelow grasping the Principle’s Latent Store.\nTo the left seizing the Bright Chariot Lord,\nTo the right assisting the Return to Prosperity.\nMerging the Jade Capital’s qi as one,\nTransforming the omen to flourish in auspiciousness.\nReturning to infancy as the Origin’s Mandate Child,\nThe Sandalwood blazes with the Auspicious Hook.\nThe Celestial One’s Origin Root Immortal,\nFree within the Wheel of Luminous Radiance.\n\nThe Celestial King of the Origin of Origins says:\nWithin the Jade Clarity’s Myriad Blossoms Palace,\nHigh immortals conceal the Emperor’s scriptures.\nThe Chart governs the Nine Heavens’ exterior,\nPenetrating observation arises from Non-Being.\nSeven revolutions summon the myriad spirits,\nThe Five Peaks come once to the court.\nThe Three Bureaus beckon the host of demons,\nThe Recorder reviews their presentations.\nExtracting the registers from the Yellow Springs’ depths,\nRecording immortality in the Upper Clarity’s annals.\n\nThe Celestial King of the Origin of Origins says:\nUpon the Dark Continent beyond the Three Fordings,\nThe Feathered Radiance’s Supreme Non-Being court.\nRevolving empyreans fly into the boundless,\nEntrusting transformation to merge the myriad essences.\nFive clouds luxuriate in the absolute void,\nSeven rosy clouds descend upon the Perfect Clarity.\nLustrous the Profound and Boundless Child,\nThe Brahmanic Prosperity aids the Yellow Tranquility.\nThe Five Elders wave the crimson blossoms,\nScattering fragrance to bear the Jade Numinous.\nGolden substance washes in the Emperor’s river,\nGreen mists luxuriate with flowing jade.\nDivine extraction of the Three Paths’ accumulations,\nImmortal embryo knits the omen’s form.",
      "overlap_context": "nt and vast, the empty numinous countenance.\nThe Azure Liver’s Bright Wheel Child,\nOpening and illuminating through the Eight Windows.\nThe Great One and Longevity Mound’s orchid,\nPresenting tallies to enter the Jade Palace.\nExtricating my seven generations’ sins,\nRevolving the primordial to await the Ten Penetrations.\nMerging within the Emperor’s One Chamber,\nThe Five Elders transform into infant ignorance.\nThe Great Simplicity’s Brahmanic practice begins,\nOne goodness penetrates the Four Golds.",
      "start_char": 14894,
      "end_char": 16285,
      "start_sentence": 681,
      "end_sentence": 786,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.348365783691406,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "上清玉皇师，玉宸大道君。 与心绛宫神，飞澄太玄尊。 元始天王曰： 三真生太元，玉户映晨华。 太素洞元虚，丹林森朱柯。 回神九重府，南昌发琼华。 百关纳津液，停玄三秀阿。 兆身腾玉清，七祖离幽扃。 长保不终劫，万世成仙家。 位为圣统尊，玉清大洞神。 元始天王曰： 西元九灵炁，金丹流云宫。 上极璇曜抄，晖景太霞中。 动回九天轮，静沉八流纲。 室有胎仙母，携衿太帝皇。 玄一灵时生，三老素牢张。 左把兆符籍，右携理神宗。 同登琳龙阙，稽首玉清房。 拔弃死灭根，养形三五中。 七祖解尸结，受福明珠方。 上证圣中尊，符化元炁王。 玉宸道君言：我师元始天王，授我此《大洞仙经》，其旨玄奥，修真妙门。 初定通息，太和一千，中观变真，离相消尘，元合五千，坐在立亡，大定全真，妙行通灵。 初曰通炁，次曰通神，终日通灵，十通成真，道备登宸，超脱飞升，过度三界，往来三清，证品太洞，天一帝尊，六度十通，万行圆成，千和万合，自然至尊。 太上无极总真文昌大洞仙经卷之五竟",
      "translated_text": "The Supreme Clarity Jade Emperor’s Master, the Great Dao Lord of the Jade Heaven,\nWith the vermilion palace’s heart-spirit, soars to the Venerable One of the Grand Mystery.\n\nThe Celestial King of the Origin of Origins says:\nThe Three Perfected give birth to the Grand Prime,\nJade portals reflect the dawn’s radiance.\nThe Grand Simplicity penetrates the primal void,\nCinnabar groves bristle with crimson branches.\nReturning spirit to the ninefold palace,\nThe Southern Prosperity emits jade blossoms.\nA hundred meridians receive the fluid elixir,\nThe Dark Mystery rests in the Three Effulgences’ vale.\nThe omen-body ascends to Jade Clarity,\nSeven ancestors depart the gloomy prison.\nLong preserved beyond the kalpa’s end,\nFor myriad ages they become the immortals’ lineage.\nEnthroned as the sagely lineage’s sovereign,\nThe Jade Clarity’s Grand Cavern spirit.\n\nThe Celestial King of the Origin of Origins says:\nThe Western Prime’s ninefold numinous qi,\nGolden elixir flows through the cloud palace.\nAbove, the supreme jade brilliance transcribes,\nRadiant scenes within the Grand Rosy Clouds.\nMoving, it revolves the nine heavens’ wheel,\nStill, it sinks the eight currents’ net.\nWithin the chamber dwells the Embryo Immortal Mother,\nWho bears the lapels of the Grand Thearch.\nThe Mysterious Unity’s spirit arises in time,\nThe Three Elders spread the plain white canopy.\nLeft hand grasps the omen’s talismanic register,\nRight hand carries the governance of the divine lineage.\nTogether they ascend the numinous dragon’s gate,\nBowing heads in the Jade Clarity’s chamber.\nUprooting the roots of death and extinction,\nNurturing form within the Three and Five.\nSeven ancestors dissolve the corpse’s knots,\nReceiving blessings from the luminous pearl’s realm.\nAbove, they attest to the sagely sovereign within,\nTalisman-transformed into the Primordial Qi’s king.\n\nThe Great Dao Lord of the Jade Heaven says:\nMy master, the Celestial King of the Origin of Origins, bestowed upon me this *Grand Cavern Sutra of the Immortals*. Its purport is profound and recondite, the wondrous gate of cultivating truth.\n\nFirst, stabilize the regulated breath—\nA thousand harmonies of Grand Harmony.\nMidway, contemplate the transformation into truth,\nDissolving forms to disperse dust.\nFive thousand primal unities converge,\nSitting in presence, standing in absence.\nGrand stabilization perfects truth,\nWondrous practice connects with the numinous.\n\nFirst is the circulation of qi,\nNext is the circulation of spirit,\nFinally, the circulation of the numinous.\nTen circulations complete the truth,\nThe Dao perfected, ascending to the celestial court,\nTranscending and soaring beyond,\nPassing through the Three Realms,\nComing and going within the Three Clarities,\nAttaining the rank of Grand Cavern,\nHeavenly One, Thearchic Sovereign.\nSix perfections, ten circulations,\nMyriad practices perfected,\nA thousand harmonies, myriad unions,\nNaturally attaining the supreme.\n\nThus concludes the fifth scroll of the *Grand Cavern Sutra of the Supreme Vastness, the All-True Wenchang*.",
      "overlap_context": "ation to merge the myriad essences.\nFive clouds luxuriate in the absolute void,\nSeven rosy clouds descend upon the Perfect Clarity.\nLustrous the Profound and Boundless Child,\nThe Brahmanic Prosperity aids the Yellow Tranquility.\nThe Five Elders wave the crimson blossoms,\nScattering fragrance to bear the Jade Numinous.\nGolden substance washes in the Emperor’s river,\nGreen mists luxuriate with flowing jade.\nDivine extraction of the Three Paths’ accumulations,\nImmortal embryo knits the omen’s form.",
      "start_char": 16285,
      "end_char": 16727,
      "start_sentence": 787,
      "end_sentence": 811,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.86164951324463,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上无极总真文昌大洞仙经.txt",
        "category": "本文类"
      }
    }
  ]
}