{
  "source_id": "太上洞玄灵宝二部传授仪",
  "source_file": "chunked_daozang\\太上洞玄灵宝二部传授仪.json",
  "total_chunks": 4,
  "total_original_chars": 3461,
  "total_translated_chars": 22390,
  "total_translation_time": 119.14678359031677,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上洞玄灵宝二部传授仪.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Cavern Mystery Numinous Treasure Ritual for Transmitting the Two Sections**\n\n**Scripture Title:** *The Supreme Cavern Mystery Numinous Treasure Ritual for Transmitting the Two Sections*. Author unknown, likely composed during the Sui or Tang dynasties. Describes the liturgical procedures for transmitting the *Scripture of Numinous Treasure Wisdom, Resolute Will, and Penetration of the Subtle*. One fascicle.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n### **Ritual for Initiating Thought, Subtle Contemplation, and Resolute Will**\n\n**First:** Upon initially entering the altar, the master circumambulates the scriptures to the left of the hall. Facing north, he offers incense thrice.\n\n**Second:** The master remains facing north, bowing to the scriptures three times. The disciple faces south toward the master and bows three times.\n\n**Third:** The master turns to the west, standing facing east, and concludes the meditation on the deities.\n\nThe ritual drum is struck twenty-four times.\n\n*\"Unsurpassed Three Heavens, Mysterious Primordial Three Qi, Supreme Lord Lao: summon forth from within this servant’s body the Three and Five Merit Officials, the Left and Right Attendant Envoys, the Left and Right Incense-Bearing Dragon-Riding Couriers, the Golden Lads of Incense, the Jade Maidens of Transmission, and the Five Thearchs’ Direct Talismans—thirty-six of each—forth to report to the local earth deities and territorial true officials. This servant now burns incense and performs the transmission ritual, praying that the Supreme Ten Directions’ True Qi of Life may enter my body, that my petition swiftly ascend to the presence of the Supreme Jade Thearch of the Boundless Dao.\"*\n\nNext, kneeling, the master summons the officials, saying:\n\n*\"Reverently, I dispatch from within this servant’s body the Five Body True Officials and Merit Officials; from the Upper Three Heavens, the Enforcing Transformation Yin-Yang Merit Officials of the Dao’s Transmission, the Dispelling Disaster and Dissolving Calamity Officers—twelve of each. From within this servant’s body, the Governing Duty Officers, the Great Generals of Establishing Authority and Supervising Merit, the Vanguard of Merit Verification, the Rear Guard of Merit Execution, the Courier Court Commandant, the Courier Court Aide, and the Four Divisions’ Merit-Overseeing Heralds. From within this servant’s body, the Transcendent Envoys, the Orthodox Unity Merit Officials, the Healing Merit Officials, the Left and Right Attendant Envoys, the Yin-Yang Divine Decree Officers, the Scarlet Talisman Chariot Officers, the Gale-Wind Posting Officers, the Courier Horse Memorial Officers, the Flying Dragon Cavalry Officers—two of each—forth!\"*\n\nThose dispatched don their solemn regalia, crowns and sashes, and compose their dignified bearing. The Direct Envoys and Merit Officials wear the Heaven-Penetrating Crowns and black silk unlined robes. The Orthodox Unity Merit Officials wear the Vermilion Yang Headbands and crimson unlined robes. The Envoys wear the Nine Virtues’ Crowns, five-colored longevity unlined robes, tiger talisman belts, and hold jade tablets.\n\nThe Direct Envoys and Merit Officials stand at the four directions; all other officials stand at the center. The Healing Merit Officials guard this servant’s body. The Left Attendant Envoys hold authority staffs at the front; the Right Attendant Envoys bear banners at the rear. The Yang Decree Officers stand to the left; the Yin Decree Officers to the right. The Upper Division Merit Officials stand above; the Middle Division Merit Officials stand within this servant’s body. The Qi-Urging Merit Officials hasten the ten directions; the Upper Division Envoys gaze afar to the heavens; the Middle Division Envoys survey the eight directions. The Capital Envoys encircle this servant’s body.\n\nThe Wolf Officers, Tiger Warriors, Inspecting Hook Cavalry, Capital Officials’ Aides, Heavenly Couriers, Armored Soldiers, Heavenly Might Warriors, Qi-Gathering and Qi-Consuming Officers, Spirit-Gathering and Spirit-Consuming Officers, Ghost-Gathering and Ghost-Consuming Officers, Evil-Gathering and Evil-Consuming Officers, Essence-Gathering and Essence-Consuming Officers, Poison-Gathering and Poison-Consuming Officers, Talisman-Executing and Shrine-Destroying Officers, Scarlet Talisman Chariot Officers, Gale-Wind Posting Officers, Courier Horse Memorial Officers, and Flying Dragon Cavalry Officers assemble before, behind, left, and right of this servant.\n\nWhen the Merit Officials and Envoys have completed their solemn preparations, they array the ceremonial regalia and report to the Numinous Treasure Officials, the Transcendent Overseers of the Retreat, the Celestial Masters’ twenty-four established dioceses, the thirty-six sacred abodes, the seventy-two blessed lands, the three hundred sixty named mountains including Kunlun, the upper palaces of the thirty-six thousand deities, the sun, moon, and stars, the Jade Armillary Sphere, the Five Thearchs of Heaven and Earth, the officials and generals of the Three Realms, the Two Mysteries, Three Origins, Four Beginnings, the directional winds, the qi-infusing cyclical officers, the Examiners and Summoners, the Nine Yi and Hu Elders of the East, the Eight Man and Yue Elders of the South, the Six Rong and Di Elders of the West, the Five Di and Qiang Elders of the North, the Three Qin and Cang Elders of the Center, the Lords of the Five Marchmounts, Four Waterways, and Marshes, the deities of all temples, the local mountain and river spirits, the valley and forest elders, the Twelve Stream Maidens, the original land deities, the altars’ generals and officers—all at once don their solemn attire. Together with the Merit Officials, Envoys, and Flying Dragon Cavalry Officers within this servant’s body, they ascend to report to the Supreme Boundless Dao, the Supreme Lord of the Great Dao, the Supreme Lord Lao, the Supreme Venerable, the Unsurpassed Mysterious Elder, the Ten Directions’ Boundless Dao and Virtue’s Multitudes of Sagely Heavenly Worthies, the Perfected Thearchs, Heavenly Thearchs, Celestial Masters, Numinous Treasure Retreat-Overseeing Great Dharma Masters, and all officials and lords.\"*\n\n*\"On the day this servant received the Dharma, it was vowed to proclaim the Dharma’s resonance, extol the great transformation, transmit it to later learners, and deliver heaven and humanity. Now, there is a man or woman of such-and-such prefecture, county, village, named so-and-so, who has purified themselves and cultivated conduct, aspiring to transcendence. Having already received the Three Caverns’ great deliverance Dharma, yet the profound mysteries remain ungrasped, the true path not yet fully realized. Today, bearing sincerity and offering devotion, they seek to receive the Heavenly Worthy’s expounded *Two Halves Diagram of Thought, Subtle Contemplation, and Resolute Will*, the Ten Precepts’ essential instructions. Their cinnabar sincerity is earnest, and this cannot be refused. This servant, in accordance with the Dharma, has fasted with them. The day’s rites concluded, I now transmit and deliver them. Reverently, I present a yellow silk memorial with red borders. The Merit Officials, Envoys, and Flying Dragon Cavalry Officers shall swiftly ascend to the Supreme Celestial Courts, placing the memorial upon the Jade Tablet, clearly requesting review.\"*\n\nNext, the memorial is read aloud.\n\nThen, the drum is struck thrice, and it is said:\n\n*\"This servant, again relying on the Upper Officials of the Multitudes of Perfected Ones, the Merit Officials, Envoys, and Flying Dragon Cavalry Officers, has separately reported and submitted this servant’s memorial for transmitting the precepts of resolute will—a yellow silk memorial with red borders—to be heard in the presence of the Pure Mystery. Let no subordinate officials obstruct or intercept the document, preventing its ascent.\"*\n\nThe servant seals the qi within the mouth, and the memorial ascends to the Courts of the Three Heavens, awaiting the report in response. Once the memorial is prostrated upon the ground, the palace rites proceed as in the preceding petition.\n\nNext, the master rises, turns left, and faces south, while the disciple turns to face north, the two standing opposite one another. The master kneels at length and says:\n\n*\"The Duly Appointed Dharma Master, Master of the Sacred Peak [Name], your servant [Name], bows his head and prostrates himself twice, reverently addressing the Supreme, Formless, Nameless, Void, and Spontaneously Self-Arising Perfect Great Dao; the Utmost Primordial Honored One; the Supreme Lord of the Great Dao; the Heavenly Worthies of the Boundless Dao and Virtue in the Ten Directions; the Most Perfect Great Dharma Master of the Mysterious Center; the Perfected of the Great Ultimate; the Three Perfected of the Mysterious Unity; and the Heavenly Master Lord.*\n\n*This servant, of foolish and lowly station, is but a walking corpse of foul flesh. By the karmic conditions of past lives, I have presumptuously borne a burden far beyond my worth, advancing to receive the precious scriptures of the Three Treasures. Yet I have failed to retire into secluded forests, transcending worldly traces, nor have I widely propagated the imperial teachings, broadly established fields of merit, delivered the suffering through ascetic practice, or accumulated merit to redress my faults. Instead, I remain indistinguishable from ordinary men, unable to discern the demonic from the mundane. The Great Dao, in its boundless compassion, has preserved my life and limbs, allowing me to behold the sun, moon, and stars to this day. The depth of its grace is measureless, and I am truly without limit in my gratitude.*\n\n*This servant, trembling with awe, bows his head and prostrates himself, acknowledging his mortal transgressions, mortal transgressions indeed.*\n\n*I have heard that the sacred scriptures are of such exalted dignity that they cannot be practiced by the vulgar and base, and their profound meanings are so abstruse that they cannot be gazed upon by the shallow understanding and fleshly eyes of a humble servant such as myself. Yet by a stroke of fortune, I have encountered this turning of the kalpa, when the Three Caverns govern the age, and the worthy are sought out. Thus, this defiled vessel has been deemed fit to receive the numinous texts.*\n\n*Having only recently received the scriptures, I am unworthy to reveal them. Yet now, in the ren-chen cycle, the Great Peace draws near, and fortune and misfortune intertwine. Without those who have attained the Dao, the kalpas cannot be preserved. Though the hearts of men are inscrutable, the wise diligently seek, and the Way should not be entirely cut off.*\n\n*Thus, I humbly present [Name], a male or female Daoist official of [Prefecture, County, Village], who has purified himself and cultivated a pure conduct, aspiring to the attainment of immortality. Having already received the great deliverance of the Three Caverns, he has yet to fully awaken to the Mysterious Teachings or traverse the true path. Now, bearing sincerity and offering his heart, he seeks to receive the Ten Essential Precepts of the Two Halves of the Diagram, as expounded by the Heavenly Worthy to stabilize resolve and fathom subtleties. His earnest devotion is such that it cannot be refused. Therefore, in accordance with the Mysterious Regulations, I have divided the covenant, received the diagram, transmitted the prohibitions, and made oaths before the Three Officials, pledging not to recklessly disclose them.*\n\n*I now reverently submit this for your consideration, awaiting your decree for its implementation. This servant, trembling with awe, bows his head and prostrates himself twice to make this known.\"*\n\nNext, the text of the diagram is read aloud:\n\nThe Four Qi of Pristine Emptiness and Spontaneity are originally one, scattering into two halves. Through the intermingling qi, one half descends, and the four components reunite as one. Having received the *Sutra of Stabilizing Resolve and Contemplating the Subtle*, one must not commit the Five Heinous Crimes, ascending to return to the One. Pristine Emptiness and Spontaneity, though present in the realm of desire, receive the merit of the Ten Precepts of Stabilizing Resolve and Contemplating the Subtle, naturally ascending by degrees. The Heavenly Worthies of the Ten Directions and Boundless Realms, their virtue unceasing, abide in eternal joy. Those who do not receive the *Sutra of Stabilizing Resolve and Contemplating the Subtle* and persist in evil naturally accumulate it, descending as wayward souls. Thus, wayward souls naturally summon the upper half, and the lower half enters here. When the two halves are exhausted and reunite as one, from there they enter the Eighteen Hells, ceaselessly as hungry ghosts and beasts. Yet again, the four components reunite as one. For evil, one descends; for goodness, one ascends through the Realm of Desire, the Realm of Form, and the Formless Realm. The Formless Heavens are empty and do not abide; the Heavens of Form are empty and do not abide; the Heavens of Desire are empty and do not abide—non-abiding, all is emptiness, and emptiness cannot be grasped. One hundred seventy-seven characters.\n\nNext, draw a single line: the master holds the brush above, the disciple holds it below, and together they draw one stroke. The disciple follows the master’s words, saying: \"After drawing the One, I reverently adhere to the covenant, honoring the Dao and esteeming virtue, revering the Three Treasures. I will perform purification rites, uphold the precepts, and deliver beings from the cycle of birth and death. Beyond this, any violation of the regulations shall be as the *Scripture of Luminous Perfection* decrees.\"\n\nNext, the diagram contract is broken: male disciples receive the left half, female disciples the right.\n\nNext, inscribe the ring: on the left, write \"Left Primordial Above,\" the disciple repeating after the master. On the right, write \"Right Mysterious Elder,\" and afterward inscribe the ring’s center with \"Most High.\" The master then says: \"These Three Masters are the Heavenly Worthy, the Left Mysterious Perfected, and the Right Mysterious Perfected.\"\n\nNext, the master threads the ring through the diagram contract and places it on the altar. The disciple faces south, kneeling lengthily, holding cinnabar water before the heart. The master faces north and begins the oath, saying:\n\n\"Most High Numinous Treasure, Supreme Master of the Three Caverns or Cavernous Mystery, Master of the [Dharma] from [Sacred Peak], your servant [Name], humbly invokes the cinnabar water. From [Prefecture, County, Village], [Full Name], aged [Number] years, presents words and pledges, entrusting their life to this servant, seeking to receive the Ten Essential Precepts of the Two Halves of the Diagram of Stabilizing Resolve and Contemplating the Subtle. Previously, they have submitted a memorial on yellow silk, petitioning the Most High and the assembly of Worthies. May the overseeing covenant lords, the Numinous Treasure Lords, the Numinous Treasure Venerable, the Lords and Officers of the Three Officials—Heaven, Earth, and Water—and the seven generations of my ancestors witness that [Name] has come seeking life, purifying themselves, offering their heart, and receiving the numinous and wondrous scriptural instructions. They vow to uphold the great Dharma, revering it in every action, guarding their speech, conducting themselves with care, casting aside worldly attachments, severing external distractions, calming the mind, and maintaining silence, focusing their resolve on the Dharma. They must not pollute it, nor lead others astray to disrupt the true qi. In every act, they shall practice great compassion, broadly delivering all beings, bringing peace to the realm and prosperity to the people, unifying the Four Seas. May their seven generations of ancestors all ascend and be delivered, their bodies entering radiant light, reborn swiftly among humans. When the great kalpa ends, may they together ascend to the Upper Clarity. For those not yet delivered, the term shall be forty years. They must not leak this in the interim, recklessly transmitting it to the unworthy, breaking the covenant, violating the oath, or carelessly divulging the sacred texts. Should they do so, their parents in life and death shall be bound in eternal night, tormented by wind and blades for ten thousand kalpas, without cause for complaint. Any transgression of the prohibitions shall be as the *Scripture of Luminous Perfection* decrees.\"\n\nNext, the disciple makes their own oath, saying:\n\n\"Disciple [Name], having received the true command and oral instructions from the Dharma Master, dares not violate or recklessly transmit them to the unworthy, lest calamity extend to my person. I vow not to betray the true deities of the above and below, center and periphery, the four directions and eight quarters. Today, I together consume the covenant water, abide by the Dharma, purify myself, and cultivate the wondrous instructions. I pray that both disciple and master may transcend heavenly disasters—the ninety-six solar cycles, the great calamity of the Jia-Shen year—passing from kalpa to kalpa without loss or excess, the sun and moon shining together, the Three Treasures turning in harmony. Humbly receiving the Three Cavern Heavenly Scriptures from the Numinous Treasure Venerable, I acknowledge the grace of this life.\"\n\nNext, the master exhales the cinnabar water three times, passing it to the disciple, who exhales it three times until it is consumed. Then, the master passes the diagram contract to the disciple, who kneels lengthily to receive it—males with the left hand, females with the right. The recipient circles their waist three times with their left hand, bows three times to the master, then recites the Three Wisdom Chapters to completion and turns to pay homage to the Ten Directions. Next, the master stands in the south, and the disciple faces the master, bowing three times, visualizing the Great Saints of the Ten Directions above. Then, they receive the Nine Precepts.\n\nThe master recites the precepts:\n\nThe Heavenly Worthy says: \"The two halves reuniting as one holds five meanings. Do you understand?\"\n\nThe Two Perfected answer: \"We do. Is it not that from the qi of Pristine Emptiness, through the mingling of misty vapors, one half descends, and these four halves reunite as one? Is it not that those who falsely claim the One to do evil summon the spontaneous qi, sinking into the Three Wretched Realms? Is it not that by doing good, one departs these four halves, returns to the Great Void, restores the qi of Pristine Emptiness, reunites the two halves, and abides in spontaneity?\"\n\nThe Heavenly Worthy says: \"You have grasped it. Now, I shall display the revolving diagram of the two halves in the empty space before the Left Perfected.\"\n\nThe Heavenly Worthy says: \"Though you have received this instruction, you must take the Nine Precepts as the foundation:\n\n1. Do not kill; contemplate the lives of all beings.\n2. Do not engage in licentiousness or entertain wayward thoughts.\n3. Do not steal or take wealth by unjust means.\n4. Do not deceive; do not reverse judgments of good and evil.\n5. Abstain from alcohol; always reflect on pure conduct.\n6. Harmonize with clan and kin, without partiality.\n7. Upon seeing others do good, rejoice and assist in their merit.\n8. Upon seeing others in distress, aid them in performing good deeds.\n9. Do not harbor expectations for those who have not attained the Dao.\"\n\nDisciple [Name], having received the precepts, shall uphold and cultivate them for life.\"\n\nThe disciple bows three times to the master. Then the disciple recites the *Five Hymns of Wisdom and Praise*. Flowers are scattered, good omens are chanted, and three bows are made.\n\nThe Supreme Mystery of the Great Void,\nReveres its scriptures to propagate the Dao.\nIn reverence and awe, one attains immortality,\nPassing through kalpas without number.\n\nMajestic is the virtue of the Great Perfected,\nSerene in the cause of non-arising.\nCelestial radiance weaves empty structures,\nRiding the void in natural ascent.\n\nSun and moon serve as blazing torches,\nPeace and harmony bring endless joy.\nTo learn immortality, sever ornate thoughts,\nEach念 builds upon the last.\n\nComing and going disturb my spirit,\nRestless, it knows no stillness.\nExtinguish念 and dwell in emptiness,\nWhispering into profound silence.\n\nSeek the scriptures as if parched with thirst,\nHold fast to your resolve like metal and stone.\nPreserve the child and soar the mysterious path,\nThe Five Numinous Talismans will ferry your register.\n\nDeliver me through the Six Perfections,\nThus able to unbind the Three Nets.\nPurify the fast and honor the Primal Simplicity,\nExhale and inhale to nurture the cloud-sprout.\n\nRoam within the Golden Gates,\nThe Jade Capital is my home.\nNaturally, the Seven Treasures arise,\nEach person seated upon a blooming lotus.\n\nGazing up, I chew the fruit of the Mystic Capital,\nBowing down, I hold the melon of the Empty Cavern.\nMy countenance shines like the ten suns,\nWhy reckon the multitude of kalpas?\n\nThe dharma drum summons the celestial immortals,\nThe tolling bell subdues the great demons.\nA divine wind fans the fragrant blossoms,\nResplendent, unfurling the brocade robes.\n\nThe Great Perfected strums the cloud zither,\nThe assembled immortals pluck the cloud harps.\nElegant songs of the Three Heavens’ radiance,\nScatter wisdom through the Jade Flower Grove.\n\nThe seven ancestors ascend the Hall of Blessings,\nBy this, they tread the mysterious tones.\nIf past-life virtue was insufficient,\nThis scripture remains distant and hard to find.\n\nIf faith in the Dao is not whole,\nEven with the chart to soar, one sinks instead.\nThe Dao of the Supreme is non-action,\nIts propagation lies in the heart of the multitudes.\n\nTo learn the Dao, trust in the cinnabar faith,\nHonor the master as if they were your closest kin.\nDraw near the radiance and pair with purity,\nDiligently renew yourself with each passing day.\n\nUntil all beings are delivered,\nI shall not cross over myself.\n\nHere concludes the *Transmission Rites of the Two Sections of the Supreme Mystery and Numinous Treasure of the Cavernous Mystery*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝二部传授仪 经名：太上洞玄灵宝二部传授仪。 撰人不详，似出於隋唐。 言传授《灵宝智慧定志通微经》之科仪。 一卷。 底本出处：《正统道藏》正一部。 太上洞玄灵宝二部传授仪 度思微定志局 第一初入坛，或在堂左行绕经，师北向三上香。 第二次师仍北向，礼经三拜，弟子在北向南对师，礼三拜。 第三次师还西面，东向立，思神竟。 鸣法鼓二十四通。 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言玉女、五帝直符，各三十六人出，关启此间土地里域真官正神。 臣今正尔烧香度法，愿得太上十方正真生炁，入我身中，所启速达，径御太上无极大道至真玉帝御前。 次长跪出官曰： 谨出臣某身中五体真官功曹吏，出臣身中上三天执法开化阴阳功曹、度道消灾散祸解厄君吏，各十二人。 出臣身中治职君吏、某治建节监功大将军、前部效功、后部效杀驿庭令、驿庭丞、四部监功谒者。 臣身中仙灵直使、正一功曹、治病功曹、左右官使者、阴阳神决吏、科车赤符吏、罡风骑置吏、驿马上章吏、飞龙骑吏等，各二人出。 出者严装显服，冠带垂缨，整其威仪。 直使功曹戴通天之冠，衣皂纨单衣。 正一功曹冠朱阳之帻，绛章单衣。 使者冠九德之冠，五色寿命单衣，腰带虎符，齐执玉板。 直使功曹住立四方，正一切曹住立中央，治病功曹营卫臣身。 左官使者建节在前，右官使者持幢在后，阳神决吏立左，阴神决吏立右，上部功曹住立上方，中部功曹住臣身中，促炁功曹催促十方，上部使者远望上天，中部使者远瞻八方，都官使者匝绕臣身。 狼吏虎贲、察奸钩骑、都官仆射、天驺甲卒、天丁力士、收炁食炁吏、收神食神吏、收鬼食鬼吏、收邪食邪吏、收精食精吏、收毒食毒吏、诛符破庙吏、科车赤符吏、罡风骑置吏、驿马上章吏、飞龙骑吏，屯驻臣前后左右。 功曹使者严装事竟，罗列卤簿，关启灵宝官属领仙监斋君吏，天师所布下二十四治，三十六靖庐、七十二福地、三百六十名山昆仑等上宫三万六千神，日月星辰、璇玑玉衡、天地五帝、三界官君将吏，及道上二玄三元四始，四面方位风炁注炁甲子诸官君将吏、考召君，东九夷胡老君、南八蛮越老君、西六戎氐老君、北五狄羌老君、中央三秦伧老君、五岳四渎丘沼君、诸庙神祇，所在高山山川溪谷山林孟长、十二溪女，根源本始土地之主，社稷将吏，一时严装，与臣身中功曹使者、飞龙骑吏，上启太上无极大道、太上大道君、太上老君、太上丈人、无上玄老、十方无极大道道德众圣天尊、至真大帝、天帝、天师君、灵宝监斋大法师、诸官君。 臣受法之日，要当宣通法音，赞扬大化，传授后学，开度天人。 今有某郡县乡里男女生某甲，洁己清行，志求神仙，已受三洞大度之法，玄宗难悟，未极真途。 今赍信效心，求受天尊所演思微定志两半图局十戒要诀，丹情慊苦，不可违逆。 臣辄依法与甲对斋，日限事竟，今付度解脱，谨拜黄缯赤表一通，功曹使者飞龙骑吏，以时腾奏，上诣上上太上曹，表露在玉案上，分别请省。 次读表。 次鸣鼓三通曰： 臣重因众真上官、功曹使者、飞龙骑吏，分别关奏，操臣拜度定志戒诀黄缯赤表一通，上闻清玄御前，无令下官故炁邀截公文，令不上达。",
      "translated_text": "**The Supreme Cavern Mystery Numinous Treasure Ritual for Transmitting the Two Sections**\n\n**Scripture Title:** *The Supreme Cavern Mystery Numinous Treasure Ritual for Transmitting the Two Sections*. Author unknown, likely composed during the Sui or Tang dynasties. Describes the liturgical procedures for transmitting the *Scripture of Numinous Treasure Wisdom, Resolute Will, and Penetration of the Subtle*. One fascicle.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n### **Ritual for Initiating Thought, Subtle Contemplation, and Resolute Will**\n\n**First:** Upon initially entering the altar, the master circumambulates the scriptures to the left of the hall. Facing north, he offers incense thrice.\n\n**Second:** The master remains facing north, bowing to the scriptures three times. The disciple faces south toward the master and bows three times.\n\n**Third:** The master turns to the west, standing facing east, and concludes the meditation on the deities.\n\nThe ritual drum is struck twenty-four times.\n\n*\"Unsurpassed Three Heavens, Mysterious Primordial Three Qi, Supreme Lord Lao: summon forth from within this servant’s body the Three and Five Merit Officials, the Left and Right Attendant Envoys, the Left and Right Incense-Bearing Dragon-Riding Couriers, the Golden Lads of Incense, the Jade Maidens of Transmission, and the Five Thearchs’ Direct Talismans—thirty-six of each—forth to report to the local earth deities and territorial true officials. This servant now burns incense and performs the transmission ritual, praying that the Supreme Ten Directions’ True Qi of Life may enter my body, that my petition swiftly ascend to the presence of the Supreme Jade Thearch of the Boundless Dao.\"*\n\nNext, kneeling, the master summons the officials, saying:\n\n*\"Reverently, I dispatch from within this servant’s body the Five Body True Officials and Merit Officials; from the Upper Three Heavens, the Enforcing Transformation Yin-Yang Merit Officials of the Dao’s Transmission, the Dispelling Disaster and Dissolving Calamity Officers—twelve of each. From within this servant’s body, the Governing Duty Officers, the Great Generals of Establishing Authority and Supervising Merit, the Vanguard of Merit Verification, the Rear Guard of Merit Execution, the Courier Court Commandant, the Courier Court Aide, and the Four Divisions’ Merit-Overseeing Heralds. From within this servant’s body, the Transcendent Envoys, the Orthodox Unity Merit Officials, the Healing Merit Officials, the Left and Right Attendant Envoys, the Yin-Yang Divine Decree Officers, the Scarlet Talisman Chariot Officers, the Gale-Wind Posting Officers, the Courier Horse Memorial Officers, the Flying Dragon Cavalry Officers—two of each—forth!\"*\n\nThose dispatched don their solemn regalia, crowns and sashes, and compose their dignified bearing. The Direct Envoys and Merit Officials wear the Heaven-Penetrating Crowns and black silk unlined robes. The Orthodox Unity Merit Officials wear the Vermilion Yang Headbands and crimson unlined robes. The Envoys wear the Nine Virtues’ Crowns, five-colored longevity unlined robes, tiger talisman belts, and hold jade tablets.\n\nThe Direct Envoys and Merit Officials stand at the four directions; all other officials stand at the center. The Healing Merit Officials guard this servant’s body. The Left Attendant Envoys hold authority staffs at the front; the Right Attendant Envoys bear banners at the rear. The Yang Decree Officers stand to the left; the Yin Decree Officers to the right. The Upper Division Merit Officials stand above; the Middle Division Merit Officials stand within this servant’s body. The Qi-Urging Merit Officials hasten the ten directions; the Upper Division Envoys gaze afar to the heavens; the Middle Division Envoys survey the eight directions. The Capital Envoys encircle this servant’s body.\n\nThe Wolf Officers, Tiger Warriors, Inspecting Hook Cavalry, Capital Officials’ Aides, Heavenly Couriers, Armored Soldiers, Heavenly Might Warriors, Qi-Gathering and Qi-Consuming Officers, Spirit-Gathering and Spirit-Consuming Officers, Ghost-Gathering and Ghost-Consuming Officers, Evil-Gathering and Evil-Consuming Officers, Essence-Gathering and Essence-Consuming Officers, Poison-Gathering and Poison-Consuming Officers, Talisman-Executing and Shrine-Destroying Officers, Scarlet Talisman Chariot Officers, Gale-Wind Posting Officers, Courier Horse Memorial Officers, and Flying Dragon Cavalry Officers assemble before, behind, left, and right of this servant.\n\nWhen the Merit Officials and Envoys have completed their solemn preparations, they array the ceremonial regalia and report to the Numinous Treasure Officials, the Transcendent Overseers of the Retreat, the Celestial Masters’ twenty-four established dioceses, the thirty-six sacred abodes, the seventy-two blessed lands, the three hundred sixty named mountains including Kunlun, the upper palaces of the thirty-six thousand deities, the sun, moon, and stars, the Jade Armillary Sphere, the Five Thearchs of Heaven and Earth, the officials and generals of the Three Realms, the Two Mysteries, Three Origins, Four Beginnings, the directional winds, the qi-infusing cyclical officers, the Examiners and Summoners, the Nine Yi and Hu Elders of the East, the Eight Man and Yue Elders of the South, the Six Rong and Di Elders of the West, the Five Di and Qiang Elders of the North, the Three Qin and Cang Elders of the Center, the Lords of the Five Marchmounts, Four Waterways, and Marshes, the deities of all temples, the local mountain and river spirits, the valley and forest elders, the Twelve Stream Maidens, the original land deities, the altars’ generals and officers—all at once don their solemn attire. Together with the Merit Officials, Envoys, and Flying Dragon Cavalry Officers within this servant’s body, they ascend to report to the Supreme Boundless Dao, the Supreme Lord of the Great Dao, the Supreme Lord Lao, the Supreme Venerable, the Unsurpassed Mysterious Elder, the Ten Directions’ Boundless Dao and Virtue’s Multitudes of Sagely Heavenly Worthies, the Perfected Thearchs, Heavenly Thearchs, Celestial Masters, Numinous Treasure Retreat-Overseeing Great Dharma Masters, and all officials and lords.\"*\n\n*\"On the day this servant received the Dharma, it was vowed to proclaim the Dharma’s resonance, extol the great transformation, transmit it to later learners, and deliver heaven and humanity. Now, there is a man or woman of such-and-such prefecture, county, village, named so-and-so, who has purified themselves and cultivated conduct, aspiring to transcendence. Having already received the Three Caverns’ great deliverance Dharma, yet the profound mysteries remain ungrasped, the true path not yet fully realized. Today, bearing sincerity and offering devotion, they seek to receive the Heavenly Worthy’s expounded *Two Halves Diagram of Thought, Subtle Contemplation, and Resolute Will*, the Ten Precepts’ essential instructions. Their cinnabar sincerity is earnest, and this cannot be refused. This servant, in accordance with the Dharma, has fasted with them. The day’s rites concluded, I now transmit and deliver them. Reverently, I present a yellow silk memorial with red borders. The Merit Officials, Envoys, and Flying Dragon Cavalry Officers shall swiftly ascend to the Supreme Celestial Courts, placing the memorial upon the Jade Tablet, clearly requesting review.\"*\n\nNext, the memorial is read aloud.\n\nThen, the drum is struck thrice, and it is said:\n\n*\"This servant, again relying on the Upper Officials of the Multitudes of Perfected Ones, the Merit Officials, Envoys, and Flying Dragon Cavalry Officers, has separately reported and submitted this servant’s memorial for transmitting the precepts of resolute will—a yellow silk memorial with red borders—to be heard in the presence of the Pure Mystery. Let no subordinate officials obstruct or intercept the document, preventing its ascent.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1277,
      "start_sentence": 0,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.748116970062256,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞玄灵宝二部传授仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣闭口炁，升表到三天曹，伏须告报。 操表伏地竟，仍复宫如上章法。 次师起，左回还南面，北向，弟子还北面，南向相对。 师长跪曰： 具位法师某岳先生，臣某甲稽首再拜，上启太上无形无名虚无自然至真大道、无上元尊、太上大道君、十方无极大道道德众圣天尊、至真玄中大法师、太极真人、玄一三真人、天师君。 臣以下愚，行尸臭肉，宿命缘会，谬荷非分，进受大法三宝尊经。 未能栖隐幽林，超绝尘迹，又不能敷宣皇教，广建福田，济度苦行，立功补过，而混同常人，魔俗不别。 大道多恩，赐全首领，得有今日，视息三光，恩深施重，实在罔极。 臣某诚惶诚恐，稽首顿首，死罪死罪。 盖闻神经尊贵，非凡陋之徒所可施行，妙义渊赜，非贱臣小子浅识肉眼所可仰瞻。 臣侥幸之运，遭遇际会，三洞御世，搜选种人，得以秽质，叨忝灵文。 臣受经始浅，未宜宣露。 今壬辰之运，太平已近，祸福交行，自非得道之夫，年劫难保。 虽人心难测，贤者勤求，不宜闭绝。 谨有某郡县乡里男女官道士某甲，洁己清行，志求神仙，已受三洞大度之法，玄宗难悟，未极真途。 今赍信效心，求受天尊所演思微定志两半图局十戒要诀，丹情慊苦，难可违逆。 今谨依玄科，分券受局，传说禁戒，告誓三官，约不妄宣。 谨以上闻，须报施行，臣某诚惶诚恐，稽首再拜以闻。 次读局文曰：",
      "translated_text": "The servant seals the qi within the mouth, and the memorial ascends to the Courts of the Three Heavens, awaiting the report in response. Once the memorial is prostrated upon the ground, the palace rites proceed as in the preceding petition.\n\nNext, the master rises, turns left, and faces south, while the disciple turns to face north, the two standing opposite one another. The master kneels at length and says:\n\n*\"The Duly Appointed Dharma Master, Master of the Sacred Peak [Name], your servant [Name], bows his head and prostrates himself twice, reverently addressing the Supreme, Formless, Nameless, Void, and Spontaneously Self-Arising Perfect Great Dao; the Utmost Primordial Honored One; the Supreme Lord of the Great Dao; the Heavenly Worthies of the Boundless Dao and Virtue in the Ten Directions; the Most Perfect Great Dharma Master of the Mysterious Center; the Perfected of the Great Ultimate; the Three Perfected of the Mysterious Unity; and the Heavenly Master Lord.*\n\n*This servant, of foolish and lowly station, is but a walking corpse of foul flesh. By the karmic conditions of past lives, I have presumptuously borne a burden far beyond my worth, advancing to receive the precious scriptures of the Three Treasures. Yet I have failed to retire into secluded forests, transcending worldly traces, nor have I widely propagated the imperial teachings, broadly established fields of merit, delivered the suffering through ascetic practice, or accumulated merit to redress my faults. Instead, I remain indistinguishable from ordinary men, unable to discern the demonic from the mundane. The Great Dao, in its boundless compassion, has preserved my life and limbs, allowing me to behold the sun, moon, and stars to this day. The depth of its grace is measureless, and I am truly without limit in my gratitude.*\n\n*This servant, trembling with awe, bows his head and prostrates himself, acknowledging his mortal transgressions, mortal transgressions indeed.*\n\n*I have heard that the sacred scriptures are of such exalted dignity that they cannot be practiced by the vulgar and base, and their profound meanings are so abstruse that they cannot be gazed upon by the shallow understanding and fleshly eyes of a humble servant such as myself. Yet by a stroke of fortune, I have encountered this turning of the kalpa, when the Three Caverns govern the age, and the worthy are sought out. Thus, this defiled vessel has been deemed fit to receive the numinous texts.*\n\n*Having only recently received the scriptures, I am unworthy to reveal them. Yet now, in the ren-chen cycle, the Great Peace draws near, and fortune and misfortune intertwine. Without those who have attained the Dao, the kalpas cannot be preserved. Though the hearts of men are inscrutable, the wise diligently seek, and the Way should not be entirely cut off.*\n\n*Thus, I humbly present [Name], a male or female Daoist official of [Prefecture, County, Village], who has purified himself and cultivated a pure conduct, aspiring to the attainment of immortality. Having already received the great deliverance of the Three Caverns, he has yet to fully awaken to the Mysterious Teachings or traverse the true path. Now, bearing sincerity and offering his heart, he seeks to receive the Ten Essential Precepts of the Two Halves of the Diagram, as expounded by the Heavenly Worthy to stabilize resolve and fathom subtleties. His earnest devotion is such that it cannot be refused. Therefore, in accordance with the Mysterious Regulations, I have divided the covenant, received the diagram, transmitted the prohibitions, and made oaths before the Three Officials, pledging not to recklessly disclose them.*\n\n*I now reverently submit this for your consideration, awaiting your decree for its implementation. This servant, trembling with awe, bows his head and prostrates himself twice to make this known.\"*\n\nNext, the text of the diagram is read aloud:",
      "overlap_context": "aloud.\n\nThen, the drum is struck thrice, and it is said:\n\n*\"This servant, again relying on the Upper Officials of the Multitudes of Perfected Ones, the Merit Officials, Envoys, and Flying Dragon Cavalry Officers, has separately reported and submitted this servant’s memorial for transmitting the precepts of resolute will—a yellow silk memorial with red borders—to be heard in the presence of the Pure Mystery. Let no subordinate officials obstruct or intercept the document, preventing its ascent.\"*",
      "start_char": 1277,
      "end_char": 1807,
      "start_sentence": 33,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.1784884929657,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞玄灵宝二部传授仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "清虚自然四炁，本是一，散为两半，因氤氲之炁，分半下降，四体合为一。 受思微定志经，不行五逆，上升反乎一。 清虚自然，因在欲时，受思微定志十戒之勋，自然渐升。 十方无极天尊，功德不住，处於长乐。 不受思微定志，为恶不止，自然为积，下降枉魂，故枉魂自然招上半，下人此，半尽两半成一尽，从此入十八地狱，不住饿鬼畜生。 又复四体合为一。 为恶下降，为善上升无色界、色界、欲界。 无色天空不住，色天空不住，欲天空不住无住，一切空空，无住不得住。 一百七十七字。 次画一，师受捉笔上，弟子手捉笔下，共画一，左就右，弟子随师言曰： 画一之后，谨依契令，尊道贵德，祟重师宝，修斋持戒，救度生死。 自此之外，违负科法，一如明真之文。 次破局券 男弟子得左，女弟子得右。 次刻环 左言左元上，弟子随师而言。 次刻环 右言右玄老，后刻环，中言太上。 师又言曰：此三师即是天尊、左玄真人、右玄真人。 次师以环贯局券，置案上。 次弟子向南长跪，执丹水当心，师向北，启盟曰： 太上灵宝无上三洞或洞玄法师，某岳先生臣某，敢告丹水。 某郡县乡里甲乙，年如干岁，操辞立誓，投命诣臣，求受思微定志两半图局十戒要诀，向已为拜黄缯章表，列启太上众尊。 愿监盟君吏、灵宝君、灵宝丈人、天官地官水官三官君吏，及某家七世祖考，监见某自来求生，斋戒投心，所受灵妙经旨诀，约承按大法，奉尊俯仰，检口慎行，弃诸色累，断绝外想，静心夷默，专志在法，不得混浊，更相招引，以乱真炁。 每行大慈，广度一切，国安民丰，四海宁一，七祖父母，皆得升度，身入光明，早生人中。 大劫运终，同飞上清。 其未仙度，五八为期，不得中泄，妄传非其人，愆盟负誓，轻漏灵文，生死父母长役幽夜，风刀万劫，不得有怨，违诸禁戒，一如明真之文。 次弟子自誓曰： 弟子某甲，承真告命法师口诀，不敢违负，妄传非其人，殃延甲身，要不负上下中央四面八方正真神明。 今共吞盟水，案法斋戒，修行妙旨。 乞弟子及师，得度天灾。 阳九百六、甲申大厄，从劫到劫，无有亏盈，日月同曜，三宝齐轮，伏受灵宝丈人三洞天文，见生之恩。 次师三噏丹水，度与弟子，三噏令尽。 次师度局券与弟子，长跪受，男左手取，女右手取。 度者左手并绕腰三过，向师三拜，次诵智慧三首竟，回心礼十方。 次师法居南，弟子向师礼三拜，心存见十方大圣在於上方，乃受九戒。 师说戒。 天尊曰：两半成一，其义有五。 卿等知乎？ 二真答日：已知，不亦於彼清虚之炁，因烟煴之交，分半下降，就此四半合为一邪。 不亦或此假一而为恶者，致招自然之炁，沦於三徒乎。 不亦为善，离此四半，还登太虚，复我清虚之炁，反我两半，处於自然乎。 天尊曰：卿体之矣。 今便以两半轮转图局，相示於空中，下左真之前。 天尊曰：虽得此诀，要当以九戒为本。 一者不杀，当念众生。 二者不淫，妄行邪念。 三者不盗，取非义财。 四者不欺，善恶反论。 五者断酒，常思浄行。 六者宗亲和睦，无有非亲。 七者见人善事，心助欢喜。 八者见人有忧，助为作福。 九者一切未得道，我不有望。 弟子某受戒终身修奉。",
      "translated_text": "The Four Qi of Pristine Emptiness and Spontaneity are originally one, scattering into two halves. Through the intermingling qi, one half descends, and the four components reunite as one. Having received the *Sutra of Stabilizing Resolve and Contemplating the Subtle*, one must not commit the Five Heinous Crimes, ascending to return to the One. Pristine Emptiness and Spontaneity, though present in the realm of desire, receive the merit of the Ten Precepts of Stabilizing Resolve and Contemplating the Subtle, naturally ascending by degrees. The Heavenly Worthies of the Ten Directions and Boundless Realms, their virtue unceasing, abide in eternal joy. Those who do not receive the *Sutra of Stabilizing Resolve and Contemplating the Subtle* and persist in evil naturally accumulate it, descending as wayward souls. Thus, wayward souls naturally summon the upper half, and the lower half enters here. When the two halves are exhausted and reunite as one, from there they enter the Eighteen Hells, ceaselessly as hungry ghosts and beasts. Yet again, the four components reunite as one. For evil, one descends; for goodness, one ascends through the Realm of Desire, the Realm of Form, and the Formless Realm. The Formless Heavens are empty and do not abide; the Heavens of Form are empty and do not abide; the Heavens of Desire are empty and do not abide—non-abiding, all is emptiness, and emptiness cannot be grasped. One hundred seventy-seven characters.\n\nNext, draw a single line: the master holds the brush above, the disciple holds it below, and together they draw one stroke. The disciple follows the master’s words, saying: \"After drawing the One, I reverently adhere to the covenant, honoring the Dao and esteeming virtue, revering the Three Treasures. I will perform purification rites, uphold the precepts, and deliver beings from the cycle of birth and death. Beyond this, any violation of the regulations shall be as the *Scripture of Luminous Perfection* decrees.\"\n\nNext, the diagram contract is broken: male disciples receive the left half, female disciples the right.\n\nNext, inscribe the ring: on the left, write \"Left Primordial Above,\" the disciple repeating after the master. On the right, write \"Right Mysterious Elder,\" and afterward inscribe the ring’s center with \"Most High.\" The master then says: \"These Three Masters are the Heavenly Worthy, the Left Mysterious Perfected, and the Right Mysterious Perfected.\"\n\nNext, the master threads the ring through the diagram contract and places it on the altar. The disciple faces south, kneeling lengthily, holding cinnabar water before the heart. The master faces north and begins the oath, saying:\n\n\"Most High Numinous Treasure, Supreme Master of the Three Caverns or Cavernous Mystery, Master of the [Dharma] from [Sacred Peak], your servant [Name], humbly invokes the cinnabar water. From [Prefecture, County, Village], [Full Name], aged [Number] years, presents words and pledges, entrusting their life to this servant, seeking to receive the Ten Essential Precepts of the Two Halves of the Diagram of Stabilizing Resolve and Contemplating the Subtle. Previously, they have submitted a memorial on yellow silk, petitioning the Most High and the assembly of Worthies. May the overseeing covenant lords, the Numinous Treasure Lords, the Numinous Treasure Venerable, the Lords and Officers of the Three Officials—Heaven, Earth, and Water—and the seven generations of my ancestors witness that [Name] has come seeking life, purifying themselves, offering their heart, and receiving the numinous and wondrous scriptural instructions. They vow to uphold the great Dharma, revering it in every action, guarding their speech, conducting themselves with care, casting aside worldly attachments, severing external distractions, calming the mind, and maintaining silence, focusing their resolve on the Dharma. They must not pollute it, nor lead others astray to disrupt the true qi. In every act, they shall practice great compassion, broadly delivering all beings, bringing peace to the realm and prosperity to the people, unifying the Four Seas. May their seven generations of ancestors all ascend and be delivered, their bodies entering radiant light, reborn swiftly among humans. When the great kalpa ends, may they together ascend to the Upper Clarity. For those not yet delivered, the term shall be forty years. They must not leak this in the interim, recklessly transmitting it to the unworthy, breaking the covenant, violating the oath, or carelessly divulging the sacred texts. Should they do so, their parents in life and death shall be bound in eternal night, tormented by wind and blades for ten thousand kalpas, without cause for complaint. Any transgression of the prohibitions shall be as the *Scripture of Luminous Perfection* decrees.\"\n\nNext, the disciple makes their own oath, saying:\n\n\"Disciple [Name], having received the true command and oral instructions from the Dharma Master, dares not violate or recklessly transmit them to the unworthy, lest calamity extend to my person. I vow not to betray the true deities of the above and below, center and periphery, the four directions and eight quarters. Today, I together consume the covenant water, abide by the Dharma, purify myself, and cultivate the wondrous instructions. I pray that both disciple and master may transcend heavenly disasters—the ninety-six solar cycles, the great calamity of the Jia-Shen year—passing from kalpa to kalpa without loss or excess, the sun and moon shining together, the Three Treasures turning in harmony. Humbly receiving the Three Cavern Heavenly Scriptures from the Numinous Treasure Venerable, I acknowledge the grace of this life.\"\n\nNext, the master exhales the cinnabar water three times, passing it to the disciple, who exhales it three times until it is consumed. Then, the master passes the diagram contract to the disciple, who kneels lengthily to receive it—males with the left hand, females with the right. The recipient circles their waist three times with their left hand, bows three times to the master, then recites the Three Wisdom Chapters to completion and turns to pay homage to the Ten Directions. Next, the master stands in the south, and the disciple faces the master, bowing three times, visualizing the Great Saints of the Ten Directions above. Then, they receive the Nine Precepts.\n\nThe master recites the precepts:\n\nThe Heavenly Worthy says: \"The two halves reuniting as one holds five meanings. Do you understand?\"\n\nThe Two Perfected answer: \"We do. Is it not that from the qi of Pristine Emptiness, through the mingling of misty vapors, one half descends, and these four halves reunite as one? Is it not that those who falsely claim the One to do evil summon the spontaneous qi, sinking into the Three Wretched Realms? Is it not that by doing good, one departs these four halves, returns to the Great Void, restores the qi of Pristine Emptiness, reunites the two halves, and abides in spontaneity?\"\n\nThe Heavenly Worthy says: \"You have grasped it. Now, I shall display the revolving diagram of the two halves in the empty space before the Left Perfected.\"\n\nThe Heavenly Worthy says: \"Though you have received this instruction, you must take the Nine Precepts as the foundation:\n\n1. Do not kill; contemplate the lives of all beings.\n2. Do not engage in licentiousness or entertain wayward thoughts.\n3. Do not steal or take wealth by unjust means.\n4. Do not deceive; do not reverse judgments of good and evil.\n5. Abstain from alcohol; always reflect on pure conduct.\n6. Harmonize with clan and kin, without partiality.\n7. Upon seeing others do good, rejoice and assist in their merit.\n8. Upon seeing others in distress, aid them in performing good deeds.\n9. Do not harbor expectations for those who have not attained the Dao.\"\n\nDisciple [Name], having received the precepts, shall uphold and cultivate them for life.\"",
      "overlap_context": "uch that it cannot be refused. Therefore, in accordance with the Mysterious Regulations, I have divided the covenant, received the diagram, transmitted the prohibitions, and made oaths before the Three Officials, pledging not to recklessly disclose them.*\n\n*I now reverently submit this for your consideration, awaiting your decree for its implementation. This servant, trembling with awe, bows his head and prostrates himself twice to make this known.\"*\n\nNext, the text of the diagram is read aloud:",
      "start_char": 1807,
      "end_char": 3091,
      "start_sentence": 52,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.34218406677246,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞玄灵宝二部传授仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "礼师三拜。 次弟子行咏智慧五首赞。 散华，唱善，礼三拜。 太上玄虚宗，弘道尊其经。 俯仰已得仙，历劫无数龄。 巍巍太真德，寂寂因无生。 霄景结空构，乘虚自然征。 日月为炳烛，安和乐未央。 学仙绝华念，念念相因积。 去来乱我神，神躁靡不历。 灭念停虚闲，萧萧入空寂。 请经若饥渴，持志如金石。 保子飞玄路，五灵度符籍。 济我六度行，故能解三罗。 清斋礼太素，吐纳养云芽。 逍遥金阙内，玉京为余家。 自然生七宝，人人坐运华。 仰嚼玄都□，俯含空洞瓜。 容颜曜十日，奚计年劫多。 法鼓会天仙，鸣锺征大魔。 灵风扇香华，灿烂开繁衿。 太真抚云璈，众仙弹云琴。 雅歌三天景，散慧玉华林。 七祖升福堂，由此步玄音。 前世德未足，斯书邈难寻。 信道情不尽，图飞乃反沉。 太上无为道，弘之在兆心。 学道由丹信，奉师如至亲。 挹景偶清虚，孳孳随日新。 众人未得度，终不度我身。 太上洞玄灵宝二部传授仪竟",
      "translated_text": "The disciple bows three times to the master. Then the disciple recites the *Five Hymns of Wisdom and Praise*. Flowers are scattered, good omens are chanted, and three bows are made.\n\nThe Supreme Mystery of the Great Void,\nReveres its scriptures to propagate the Dao.\nIn reverence and awe, one attains immortality,\nPassing through kalpas without number.\n\nMajestic is the virtue of the Great Perfected,\nSerene in the cause of non-arising.\nCelestial radiance weaves empty structures,\nRiding the void in natural ascent.\n\nSun and moon serve as blazing torches,\nPeace and harmony bring endless joy.\nTo learn immortality, sever ornate thoughts,\nEach念 builds upon the last.\n\nComing and going disturb my spirit,\nRestless, it knows no stillness.\nExtinguish念 and dwell in emptiness,\nWhispering into profound silence.\n\nSeek the scriptures as if parched with thirst,\nHold fast to your resolve like metal and stone.\nPreserve the child and soar the mysterious path,\nThe Five Numinous Talismans will ferry your register.\n\nDeliver me through the Six Perfections,\nThus able to unbind the Three Nets.\nPurify the fast and honor the Primal Simplicity,\nExhale and inhale to nurture the cloud-sprout.\n\nRoam within the Golden Gates,\nThe Jade Capital is my home.\nNaturally, the Seven Treasures arise,\nEach person seated upon a blooming lotus.\n\nGazing up, I chew the fruit of the Mystic Capital,\nBowing down, I hold the melon of the Empty Cavern.\nMy countenance shines like the ten suns,\nWhy reckon the multitude of kalpas?\n\nThe dharma drum summons the celestial immortals,\nThe tolling bell subdues the great demons.\nA divine wind fans the fragrant blossoms,\nResplendent, unfurling the brocade robes.\n\nThe Great Perfected strums the cloud zither,\nThe assembled immortals pluck the cloud harps.\nElegant songs of the Three Heavens’ radiance,\nScatter wisdom through the Jade Flower Grove.\n\nThe seven ancestors ascend the Hall of Blessings,\nBy this, they tread the mysterious tones.\nIf past-life virtue was insufficient,\nThis scripture remains distant and hard to find.\n\nIf faith in the Dao is not whole,\nEven with the chart to soar, one sinks instead.\nThe Dao of the Supreme is non-action,\nIts propagation lies in the heart of the multitudes.\n\nTo learn the Dao, trust in the cinnabar faith,\nHonor the master as if they were your closest kin.\nDraw near the radiance and pair with purity,\nDiligently renew yourself with each passing day.\n\nUntil all beings are delivered,\nI shall not cross over myself.\n\nHere concludes the *Transmission Rites of the Two Sections of the Supreme Mystery and Numinous Treasure of the Cavernous Mystery*.",
      "overlap_context": "r take wealth by unjust means.\n4. Do not deceive; do not reverse judgments of good and evil.\n5. Abstain from alcohol; always reflect on pure conduct.\n6. Harmonize with clan and kin, without partiality.\n7. Upon seeing others do good, rejoice and assist in their merit.\n8. Upon seeing others in distress, aid them in performing good deeds.\n9. Do not harbor expectations for those who have not attained the Dao.\"\n\nDisciple [Name], having received the precepts, shall uphold and cultivate them for life.\"",
      "start_char": 3091,
      "end_char": 3475,
      "start_sentence": 107,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.877994060516357,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞玄灵宝二部传授仪.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}