{
  "source_id": "太上洞玄灵宝三元品戒功德轻重经",
  "source_file": "chunked_daozang\\太上洞玄灵宝三元品戒功德轻重经.json",
  "total_chunks": 10,
  "total_original_chars": 12452,
  "total_translated_chars": 79893,
  "total_translation_time": 319.9837863445282,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
    "category": "戒律类"
  },
  "full_translation": "*The Scripture on the Merits and Gravity of the Three Primal Precepts from the Supreme Cavernous Mystery Numinous Treasure*\n\nThus spake the Heavenly Worthy:\n\nIn the Upper Primal Realm, the Celestial Officials of the First Order, where primordial qi first congeals and the Three Luminaries dawn in radiance, the essences of azure, yellow, and white qi coalesce to establish the Three Palaces of the Upper Primal. The first of these is named the Supreme Cavernous Mystery Primordial Yang Seven-Jewel Purple Tenuity Palace. Therein resides the azure primordial yang qi, governing the Perfected of the Upper Realms, the Celestial August Emperor of the Jade Void, the Divine Sovereigns of the Heavens, and the exalted deities of the highest sanctity.\n\nThis palace is arrayed in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers, enveloped likewise in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers of azure yang qi. Within it, the divine immortals and their retinues number fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad, as do their multitudes—all formed from the spontaneous coagulation of azure primordial qi into human form. Their raiment is of azure feathered flight-garments.\n\nWithin the Purple Tenuity Palace lies the Talisman of Prolonged Life. When this talisman is inscribed and placed in the eight directions, the qi of those regions rushes forth in response, manifesting as human beings. Should the talisman be destroyed and burned in fire, the people dissolve with the smoke, reverting to qi. None but those who have attained the Dao with golden tablets and jade names may wield it. Its script emerges but once every forty thousand kalpas, overseen by the Fire Officials of the Great Yang and enacted by the Upper Repository of the Supreme Cavernous Mystery.\n\nThe Purple Tenuity Palace contains three bureaus: left, right, and central. The Left Bureau governs life, examined by the Fire Officials of the Great Yang. The Right Bureau governs death, examined by the Water Officials of the Great Yin. The Central Bureau governs the records of life, death, transgressions, and the trials of the Wind Blade.\n\nEach bureau commands a retinue of ninety million officials, collectively administering the twelve departments of life, death, transgressions, and blessings:\n\n1. The Supreme Cavernous Mystery Upper Primal Illuminated Perfection Department\n2. The Supreme Cavernous Mystery Upper Primal Surveillance and Rectification Department\n3. The Supreme Cavernous Mystery Upper Primal Brahman Conduct Department\n4. The Supreme Cavernous Mystery Upper Primal Unfolding Numinosity Department\n5. The Supreme Cavernous Mystery Upper Primal Spirit-Restraining Department\n6. The Supreme Cavernous Mystery Upper Primal Luminous Clarity Department\n7. The Supreme Cavernous Mystery Upper Primal Rectified Spirits Department\n8. The Supreme Cavernous Mystery Upper Primal Unfolding Clarity Department\n9. The Supreme Cavernous Mystery Upper Primal Three Capitals Department\n10. The Supreme Cavernous Mystery Upper Primal Southern Ascendant Department\n11. The Supreme Cavernous Mystery Upper Primal Primordial Merit Department\n12. The Supreme Cavernous Mystery Upper Three Numinosities Department\n\nThese twelve departments were established by the Supreme Cavernous Mystery Lady of Azure, subordinate to the Purple Tenuity Palace. They govern the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s trials by Wind Blade. Each department comprises one hundred twenty examining officials, one thousand two hundred examining scribes, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They oversee the registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and the merits and transgressions of all men and women among the common folk.\n\nMajor trials occur every three years, intermediate trials every nine years, and minor trials every twenty-four years. Major blessings are bestowed every three years, intermediate blessings every nine years, and minor blessings every twenty-four years. Transgressions and blessings are meted out together, merits and demerits recompensed alike. The ledgers of good and evil are stored within the Seven-Jewel Casket of the Illuminated Perfection Jade Coffer in the Cavernous Mystery Capital.\n\nIn the Upper Primal Realm, the left palace of the primordial yellow qi of the Central Yellow is named the Supreme Cavernous Mystery Primordial Yellow Supreme Ultimate Left Palace. Therein resides the primordial yellow qi of the Origin, governing the registers of life for the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it, and all men and women among the common folk.\n\nThis palace is arrayed in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers, enveloped likewise in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers of primordial yellow qi. Within it, the divine immortals and their retinues number fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad, as do their multitudes—all formed from the spontaneous coagulation of primordial yellow qi into human form. Their raiment is of yellow feathered flight-garments.\n\nWithin the Supreme Ultimate Left Palace lies the Talisman of Summoning Spirits. Its method of use follows the same rites and standards as the Talisman of Prolonged Life in the Purple Tenuity Palace. It is overseen by the Wind Blade Examining Officials and enacted by the Left Repository of the Supreme Cavernous Mystery.\n\nThe Supreme Ultimate Left Palace contains three bureaus: left, right, and central. The Left Bureau governs life, examined by the Great Yang Fire Officials. The Right Bureau governs death, examined by the Great Yin Water Officials. The Central Bureau governs the records of life, death, transgressions, and the trials of the Wind Blade.\n\nEach bureau commands a retinue of ninety million officials, collectively administering the twelve departments of life, death, transgressions, and blessings:\n\n1. The Supreme Cavernous Mystery Upper Primal Illuminated Brahman Department\n2. The Supreme Cavernous Mystery Upper Primal Majestic Numinosity Department\n3. The Supreme Cavernous Mystery Upper Primal Grand Constancy Department\n4. The Supreme Cavernous Mystery Upper Primal Grand Purity Department\n5. The Supreme Cavernous Mystery Upper Primal Proclaiming Majesty Department\n6. The Supreme Cavernous Mystery Upper Primal Illuminated Capital Department\n7. The Supreme Cavernous Mystery Upper Primal Capital Numinosity Department\n8. The Supreme Cavernous Mystery Upper Primal Grand Ceremony Department\n9. The Supreme Cavernous Mystery Upper Primal Illuminated Dharma Department\n10. The Supreme Cavernous Mystery Upper Primal Examining Rectification Department\n11. The Supreme Cavernous Mystery Upper Primal Illuminated Majesty Department\n12. The Supreme Cavernous Mystery Upper Primal Nine Capitals Department\n\nThese twelve departments were established by the Supreme Cavernous Mystery Lady of Azure, subordinate to the Primordial Yellow Supreme Ultimate Left Palace. They govern the Left Bureau’s Great Yang Fire Palace, the Right Bureau’s Great Yin Water Palace, and the Central Bureau’s trials by Wind Blade. Each department comprises one hundred twenty examining officials, one thousand two hundred examining scribes, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They oversee the life registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and all men and women among the common folk, as well as those destined to attain immortality with jade tablets on the right.\n\nThe recording of merits and demerits, the erasure or retention of ranks, and the retribution of sins and blessings follow the same time limits as those of the Purple Tenuity Palace. The registers are sealed within the Yang-Generating Case of the Mysterious Capital’s Luminous Perfected Jade Coffer. The Right Palace of the Supreme Cavernous Primordial White Qi of the First-Rank Upper Primordial Heaven, named the Supreme Cavernous Primordial White Supreme Ultimate Right Palace, is governed by the Primordial Cavernous White Qi. It oversees the registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it, the records of common men and women’s transcendence and immortal ascension, as well as the death registers of the condemned. This palace comprises fifty billion, five myriad, fifty-five hundred million, fifty-five myriad, fifty-five layers, and is also enveloped by fifty billion, five myriad, fifty-five hundred million, fifty-five myriad layers of Cavernous White Qi. The divine immortals and officials within likewise number fifty billion, five myriad, fifty-five hundred million, fifty-five myriad, and are also fifty billion, five myriad, fifty-five hundred million, fifty-five myriad in multitude. All are formed from the natural Cavernous White Qi into human form. They wear feathered flying robes of white.\n\nWithin the Supreme Ultimate Right Palace resides the Luminous Perfected Talisman, whose usage and regulations follow the same rites of life extension as those of the Purple Tenuity Palace. The Palace of Great Yin Water governs its examinations, and the Supreme Cavernous Right Bureau enforces them. The Supreme Ultimate Right Palace comprises three bureaus: Left, Right, and Central. The Left Bureau governs life and is examined by the Palace of Great Yang Fire. The Right Bureau governs death and is examined by the Palace of Great Yin Water. The Central Bureau governs the trials of life, death, and sin by Wind Blade. Each of the three palaces commands ninety million officials and collectively oversees the twelve departments of life, death, sin, and blessing:\n\nSupreme Cavernous Upper Primordial Rectifying Department.\nSupreme Cavernous Upper Primordial Four Luminaries Department.\nSupreme Cavernous Upper Primordial Celestial Surveillance Department.\nSupreme Cavernous Upper Primordial Execution Department.\nSupreme Cavernous Upper Primordial Celestial Covenant Department.\nSupreme Cavernous Upper Primordial Dark Capital Department.\nSupreme Cavernous Upper Primordial Dignity Department.\nSupreme Cavernous Upper Primordial Great Yin Department.\nSupreme Cavernous Upper Primordial Lower Primordial Department.\nSupreme Cavernous Upper Primordial Surveillance Department.\nSupreme Cavernous Upper Primordial Spirit-Watching Department.\nSupreme Cavernous Upper Primordial Great Luminosity Department.\n\nThese twelve departments were established by the Supreme Cavernous Mystery Lady of Azure and are subordinate to the Primordial Cavernous White Supreme Ultimate Right Palace. They govern the Left Bureau’s Palace of Great Yang Fire, the Right Bureau’s Palace of Great Yin Water, and the Central Bureau’s trials by Wind Blade. Each department comprises one hundred twenty examining officials, one thousand two hundred examining scribes, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They oversee the comprehensive registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and all common men and women whose names are to be erased from the immortal records due to transcendence or death, recording their dates. They determine the ranks of immortals, the retribution of sins and blessings, following the same time limits as those of the Purple Tenuity Palace. The registers are sealed within the Northern Repository Case of the Nine Dark Jade Coffer of the Everlasting Night Bureau.\n\nThe three palaces of the First-Rank Upper Primordial Heavenly Officials—Left, Right, and Central—each govern twelve departments, totaling thirty-six departments. They universally administer the natural titles within the Supreme Void of Primordial Yang, collectively overseeing the registers of merits and demerits, life and death, of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and all common men and women. The August Jade Emperor, the assemblies of Heavenly Great Sages, the myriad deities of the Ten Directions, the Boundless Supreme Unity, the Upper Perfected of the Southern Culmen, the Perfected of Wondrous Conduct, the celestial bodies of the sun, moon, and stars, the innumerable hosts of the Jade Armillary Sphere, and all revered deities convene thrice yearly—on the fifteenth day of the first, seventh, and tenth months—to review and verify the registers of life, death, merits, and demerits of those who have attained the Dao in past kalpas, those yet to attain it, and all common men and women.\n\nOn these days, the examining officials of the Three Bureaus—Yin-Yang, Water-Fire, and Wind Blade—and the thirty-six departments’ officials and subordinates meticulously calculate the weight of merits, demerits, sins, and transgressions, along with their time limits. Each matter is distinctly recorded in the Green and Black Registers and presented to the Purple Tenuity and Supreme Ultimate Palaces—Left, Right, and Central. Those whose merits are complete and who are destined for immortality are recorded in the Purple Tenuity Palace. Those who have accumulated good deeds, reverence, and faith, and who uphold the Great Dao, are recorded in the Supreme Ultimate Left Palace. Those who have amassed evil and are unfit for the Dao, whose sins warrant death, are recorded in the Supreme Ultimate Right Palace.\n\nFor the Purple Tenuity Palace, names are inscribed in the Golden Register of Jade Records, and the Earthly Bureau is notified to erase their mortal records, while the Water Bureau removes their names from the registers. They are protected across the Three Realms and may not be violated, as decreed in the Writ of the Lady of Azure. For the Supreme Ultimate Left Palace, names are inscribed in the Azure Primordial Register and the Jade Calendar of Longevity in the Southern Upper Realm. The Water and Earth Bureaus are notified to provide separate protection, ensuring no violation, as decreed in the Writ of the Lady of Azure. For the Supreme Ultimate Right Palace, names are recorded in the Black Register and transferred to the Everlasting Night’s Nine Dark Bureau. The Water and Earth Bureaus are notified to seize and record the sinful souls, delivering them to the Execution Department for servitude. If the merits, demerits, and qi of the examined are not yet balanced, the matter is referred to the Three Assemblies for further review and rectification.\n\nThe Second-Rank Middle Primordial Earthly Officials, formed from the Primordial Cavernous Mixed Spirit Qi and the essence of the Ultimate Yellow, establish the Middle Primordial Three Palaces. The first palace is named the Cavernous Void Pure Spirit Palace, governed by the Primordial Cavernous Mixed Spirit Qi. It oversees the Five Emperors, the Five Marchmounts, all Perfected, and the deities and immortals of the earth who have attained the Dao. This palace comprises fifty billion, five myriad, fifty-five hundred million, fifty-five myriad layers of Mixed Spirit Qi, and its divine immortals, deities, and officials number ninety-nine million, nine hundred ninety-nine myriad. These are the souls of the deceased who possessed merits and have been delivered to assume duties in the Earthly Bureau, each with a set term. Upon fulfilling their merits, they may ascend to the ranks of Heavenly Immortals or be reborn among humans, with vacancies promptly filled to maintain their duties.\n\nThe Cavernous Void Pure Spirit Palace is also named the Luminous Dawn Martial City Palace and comprises three bureaus: Left, Right, and Central. The Left Bureau is named the Enduring Transgression Luminous Dawn Bureau and governs life, examined by the Palace of Great Yang Fire.\n\nThe Right Bureau is named the Zhòu-Jué Yīn Heavenly Bureau and governs death, examined by the Palace of Great Yin Water. The Central Bureau is named the Seven Non-Tranquil Radiance Bureau and oversees the records of life, death, and transgressions, as well as the trials of the Wind Blade.\n\nEach of the three bureaus commands fifty million officials, collectively administering the fourteen departments of life, death, transgressions, and blessings:\n\nThe Supreme Mystery Central Origin Numinous Capital Department.\nThe Supreme Mystery Central Origin Upholding Rectitude Department.\nThe Supreme Mystery Central Origin Numinous Might Department.\nThe Supreme Mystery Central Origin Yellow Spirit Department.\nThe Supreme Mystery Central Origin Cavernous Mystery Department.\nThe Supreme Mystery Central Origin Might and Reverence Department.\nThe Supreme Mystery Central Origin Numinous Tie Department.\nThe Supreme Mystery Central Origin Mountain Rectitude Department.\nThe Supreme Mystery Central Origin Cavernous Heaven Department.\nThe Supreme Mystery Central Origin Nine Capitals Department.\nThe Supreme Mystery Central Origin Five Assemblies Department.\nThe Supreme Mystery Central Origin Pervasive Radiance Department.\nThe Supreme Mystery Central Origin Ceremonial Model Department.\nThe Supreme Mystery Central Origin Nine Examinations Department.\n\nThese fourteen departments were established by the Supreme Mystery Lady of Azure and belong to the Cavernous Void Pure Spirit Palace, overseeing the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials.\n\nEach of the fourteen departments is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the registers of merits, transgressions, and offenses for the perfected immortals of the Five Marchmounts, those who have attained the Dao, those who study but have yet to attain it, and all men and women among the common people.\n\nMajor examinations occur every three years, intermediate examinations every nine years, and minor examinations every twenty-four years. Major blessings are conferred every three years, intermediate blessings every nine years, and minor blessings every twenty-four years. Transgressions and blessings are both enacted, merits and offenses equally recompensed. Their registers are sealed within the cavern chambers of the Five Marchmounts.\n\nThe second rank of the Central Origin’s Left Palace is named the Southern Cavern Yang Palace, also called the Ancestral Heaven Palace, and governs all the spirit officials of the nine lands, four directions, eight extremities, and the registers of life for those who study but have yet to attain the Dao, as well as all men and women among the common people. Its palace is enveloped in fifty billion, five myriad, fifty-five hundred million, fifty-five myriad layers of Mixed Yellow Qi, and its earthly officials number ninety-nine million, nine hundred ninety-nine myriad—all souls of the deceased who possessed merits and have been delivered to assume their duties.\n\nThe Southern Cavern Yang Palace comprises three bureaus: Left, Right, and Central. The Left Bureau is named the Forgiving Affairs Bureau and governs life, examined by the Great Yang Fire Officials. The Right Bureau is named the Ancestral Spirit Bureau and governs death, examined by the Great Yin Water Officials. The Central Bureau is named the Numinous Tie Spirit Bureau and oversees the records of life, death, and transgressions, as well as the trials of the Wind Blade.\n\nEach of the three bureaus commands fifty million officials, collectively administering the fourteen departments of life, death, transgressions, and blessings:\n\nThe Supreme Mystery Central Origin Southern Prosperity Department.\nThe Supreme Mystery Central Origin Examination and Calculation Department.\nThe Supreme Mystery Central Origin Summoning Spirits Department.\nThe Supreme Mystery Central Origin Great Yang Department.\nThe Supreme Mystery Central Origin Illuminating Mechanism Department.\nThe Supreme Mystery Central Origin Capital Statutes Department.\nThe Supreme Mystery Central Origin Nine Commands Department.\nThe Supreme Mystery Central Origin Illuminating Capital Department.\nThe Supreme Mystery Central Origin Heavenly Supervision Department.\nThe Supreme Mystery Central Origin Proclaiming the Wilds Department.\nThe Supreme Mystery Central Origin Supervisory Command Department.\nThe Supreme Mystery Central Origin Mound and Succession Department.\nThe Supreme Mystery Central Origin Nine Qi Department.\nThe Supreme Mystery Central Origin Central Spirit Department.\n\nThese fourteen departments were established by the Supreme Mystery Lady of Azure and belong to the Southern Cavern Yang Palace, overseeing the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials.\n\nEach of the fourteen departments is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the registers of merits, transgressions, and offenses for the spirit officials of the nine lands, four directions, eight extremities, those who study but have yet to attain the Dao, and all men and women among the common people. The cycles of transgression, blessing, and retribution follow the same timeframes as those of the Pure Spirit Palace. Their registers are sealed within the Stone Casket of the Primordial Yang Terrace of the Southern Cinnabar Cavern.\n\nThe second rank of the Central Origin’s Right Palace is named the Northern Feng Palace, also called the Yin Heaven Palace, and governs all spirit officials of the earth, the registers of transgressions and deaths for those who have attained the Dao in past lives, those who study but have yet to attain it, and all men and women among the common people. Its palace is enveloped in fifty billion, five myriad, fifty-five hundred million, fifty-five myriad layers of Mixed Yellow Qi, and its earthly officials number ninety-nine million, nine hundred ninety-nine myriad—all souls of the deceased who possessed merits and have been delivered to assume their duties.\n\nThe Northern Feng Palace comprises three bureaus: Left, Right, and Central. The Left Bureau is named the Linked Winding Springs Bureau and governs life, examined by the Great Yang Fire Officials. The Right Bureau is named the Supreme Execution Nine Darks Bureau and governs death, examined by the Great Yin Water Officials. The Central Bureau is named the Transgression Qi Salty Pond Bureau and oversees the records of life, death, and transgressions, as well as the trials of the Wind Blade.\n\nEach of the three bureaus commands fifty million officials, collectively administering the fourteen departments of life, death, transgressions, and blessings:\n\nThe Supreme Mystery Central Origin Nine Executions Department.\nThe Supreme Mystery Central Origin Transgression Oversight Department.\nThe Supreme Mystery Central Origin Han Supervision Department.\nThe Supreme Mystery Central Origin Retribution Rectification Department.\nThe Supreme Mystery Central Origin Supervising Execution Department.\nThe Supreme Mystery Central Origin Hastening Examination Department.\nThe Supreme Mystery Central Origin Qi Seizure Department.\nThe Supreme Mystery Central Origin Execution Oversight Department.\nThe Supreme Mystery Central Origin Dipper Addition Department.\nThe Supreme Mystery Central Origin Striking Authority Department.\nThe Supreme Mystery Central Origin Subtlety Oversight Department.\nThe Supreme Mystery Central Origin Nine Darks Department.\nThe Supreme Mystery Central Origin Liberation Department.\nThe Supreme Mystery Central Origin Cold Night Department.\n\nThese fourteen departments were established by the Supreme Mystery Lady of Azure and belong to the Northern Feng Palace, overseeing the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials.\n\nEach of the fourteen departments is staffed with one hundred twenty examining officials, one hundred twenty examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the black registers of transgressions and deaths for the nine lands, four directions, eight extremities, scholars who have yet to attain the Dao, and all men and women among the common people, as well as the records of blessings and retributions for those eligible for liberation.\n\nThe examination and summons cycles follow the same regulations as those of the Clear Numen Palace. Their ledgers and records are sealed within the Vault of Mysterious Yin at the Northern Wall. The Middle Primordial’s Second-Rank Earth Officials oversee the three palaces of the Left, Right, and Central Bureaus, each governing fourteen departments, totaling forty-two departments. These operate within the cavernous voids of mountains and grottos, all bearing natural designations, and universally govern the immortals, perfected beings, and numinous spirits of the Five Marchmounts, Four Directions, and Eight Extremities on earth, as well as those who have already attained the Dao in past ages, those presently in fortune who have yet to attain it, and all common men and women. They manage the ledgers of life and death, merits and transgressions, blessings and retributions, and the records of those who have perished or transcended.\n\nAll the Great Saints of the heavens, the myriad exalted deities of the ten directions, the perfected of wondrous conduct, the Southern and Northern Dippers, the celestial bodies of sun, moon, and stars, the Jade Armillary and Jade Balance, and the countless hosts of all revered deities customarily descend on the eight seasonal nodes to the Clear Numen Grotto-Yang and the Northern Feng’s three palaces to assemble and review the ledgers of life and death, merits and transgressions, blessings and retributions for all upon the earth. On such days, the Five Emperors of the earth, the immortals and perfected of the Five Marchmounts, the Earthly Bureau’s Four Offices and Earthly Emperors, the numinous officials of the Eight Extremities, the officials of the Three Realms, and all spirits invariably arrive in solemn array.\n\nThe three palaces and nine bureaus, along with the forty-two departments’ examination and summons officials, each oversee the Green and Black Ledgers of life and death. According to merits and transgressions, blessings and retributions, life and death, and transcendence, they calculate the weight of years and months. Every matter is distinguished in the Green and Black Ledgers and reported to the Three Palaces. On the fifteenth day of the first, seventh, and tenth months, the Three Palaces submit their reports to heaven. Once the ledgers of merits, transgressions, life, and death are finalized, those destined for life are reported to the Left Palace, those destined for immortality to the Central Palace, and those destined for death to the Right Palace. Upper and lower correspond precisely, with no discrepancy in the years, months, days, or even the finest details of merits, transgressions, life, and death. If any examination of *qi* remains unresolved, it is referred to the Three Assemblies for further review and correction before resubmission.\n\nThe Lower Primordial’s Third-Rank Water Officials, embodying the *qi* of cavernous primordial wind and marsh and the essence of vast dawn, establish the Lower Primordial’s Three Palaces. The first palace is named the Palace of the Dawn Valley Grotto-Source, also called the Azure Florescence Square-Cinnabar Palace. It governs the *qi* of cavernous primordial wind and marsh and is presided over by the Water Emperor, the Divine King of Dawn Valley, the River Earls of the Nine Waters, the water bureaus, the immortals and perfected, and all great deities of the waters. It maintains the ledgers of those who have already attained the Dao in past ages, those who have yet to attain it, and all common men and women. The palace is enveloped in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers of wind-and-marsh *qi*, and its immortals, water deities, and officials number ninety-nine myriad, nine thousand nine hundred ninety myriad. These are the souls of the deceased who possessed merit, having received deliverance to fill the ranks of water officials. Each serves for a set term, and upon fulfilling their merit, they may ascend to the ranks of celestial immortals or be reborn among humanity. Through such cycles, all may attain the status of higher immortals. Vacancies are filled as they arise to maintain their duties.\n\nThe Palace of Dawn Valley, also called the Azure Florescence Square-Cinnabar Palace, comprises the Left, Right, and Central Bureaus. The Left Bureau is named the Clear Primordial Numinous Abyss Bureau, overseeing life and the examinations of the Great Yang Fire Officials. The Right Bureau is named the Nine Waters Cold Night Bureau, overseeing death and the examinations of the Great Yin Water Officials. The Central Bureau is named the Northern Solstice Azure Numen Bureau, overseeing the trials of life, death, transgressions, and the Wind Blade. Each bureau commands fifty million officials, collectively governing the fourteen departments of life, death, transgressions, and blessings:\n\nThe Lower Primordial’s Luminous Water Department.\nThe Lower Primordial’s Primordial Clarity Department.\nThe Lower Primordial’s Fierce Fire Department.\nThe Lower Primordial’s Three Luminaries Department.\nThe Lower Primordial’s Trial Review Department.\nThe Lower Primordial’s Water Command Department.\nThe Lower Primordial’s Luminous Model Department.\nThe Lower Primordial’s Grotto-Source Department.\nThe Lower Primordial’s Inspection and Assembly Department.\nThe Lower Primordial’s Karma and Forgiveness Department.\nThe Lower Primordial’s Swift Water Department.\nThe Lower Primordial’s Cavernous Yang Department.\nThe Lower Primordial’s Dragon Stable Department.\nThe Lower Primordial’s Mechanism and Assembly Department.\n\nThese fourteen departments were established by the Supreme Mystery Lady of Azure and belong to the Palace of Dawn Valley Grotto-Source, overseeing the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials. Each of the fourteen departments is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the records of merits and transgressions for the deities and spirits of the Nine Rivers, Three Rivers, and Four Seas, as well as all common men and women.\n\nMajor examinations occur every three years, intermediate examinations every nine years, and minor examinations every twenty-four years. Major blessings are bestowed every three years, intermediate blessings every nine years, and minor blessings every twenty-four years. Transgressions and blessings are both enacted, merits and transgressions equally recompensed. Their ledgers are sealed within the grotto-chambers of the Nine Rivers.\n\nThe Lower Primordial’s Third-Rank Left Palace is named the Clear Cold Palace, also called the Southern Water Assembly Palace. It universally governs the myriad essences of the waters, the dragons and whales, the great assemblies of water disasters, the water mothers, the Dragon Gate’s cycles of deliverance, and the ledgers of all common men and women, managing the trials of life and death, merits and transgressions, and the weight of their severity. The palace is enveloped in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers of wind-and-marsh adamantine *qi*, and its immortals, water deities, and officials likewise number ninety-nine myriad, nine thousand nine hundred ninety myriad. These, too, are the souls of the deceased who possessed merit, having received deliverance to fill the ranks of water officials.\n\nThe Clear Cold Palace, also called the Southern Water Assembly Palace, comprises the Left, Right, and Central Bureaus. The Left Bureau is named the Age-Karma Bureau, overseeing life and the examinations of the Great Yang Fire Officials. The Right Bureau is named the Long Night Cold Court Bureau, overseeing death and the examinations of the Great Yin Water Officials. The Central Bureau is named the Numinous Treasure Karma Blade Bureau, overseeing the trials of life, death, transgressions, and the Wind Blade. Each bureau commands fifty million officials, collectively governing the matters of life, death, transgressions, blessings, and the karmic assemblies of the myriad essences in the waters. The fourteen departments include:\n\nThe Lower Primordial’s Luminous Karma Department.\n\nThe Lower Primordial’s Mechanism-Age Department.\nThe Lower Primordial’s Water-Purity Department.\nThe Lower Primordial’s Transgression-Blessing Department.\nThe Lower Primordial’s Trial-Assembly Department.\nThe Lower Primordial’s Urgent Qi Department.\nThe Lower Primordial’s Spirit-Seizing Department.\nThe Lower Primordial’s Dragon-Summoning Department.\nThe Lower Primordial’s Nine Rivers Department.\nThe Lower Primordial’s Chaste Women Department.\nThe Lower Primordial’s Illumination Department.\nThe Lower Primordial’s Soul-Deliverance Department.\nThe Lower Primordial’s Essence-Examination Department.\nThe Lower Primordial’s Purity-Righteousness Department.\n\nThese fourteen departments, established by the Great Mystery’s Lady Qing, belong to the Clear Cold Palace. They oversee the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials, as well as the matters of life, death, transgressions, blessings, and the karmic assemblies of the myriad essences in the waters. Each department is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining officers. They govern the great and small karmic assemblies of the gods and spirits of the Nine Rivers, the Four Seas, the Three Rivers, the Huai, and the Ji water palaces; record the merits and transgressions of the people, men and women; and determine the retributions of transgressions and blessings, with time limits as set by the Yang Valley Palace. These records are sealed in the Yang Spring Grotto Chamber.\n\nThe Lower Primordial’s third-rank Right Palace is named the Northern Fengdu Palace, also called the Luo Feng Palace. It primarily governs the long-night dead ghosts, those sentenced to penal servitude for karmic terms, and the affairs of the myriad ghosts and spirits in the waters, as well as the black registers of those among the people, men and women, who are fated to die. This palace is composed of the qi of five hundred five million fifty-five thousand five hundred fifty-five layers of wind, marsh, purity, and ascetic practice. Among its divine immortals, water gods, and officials, there are ninety-nine million nine hundred ninety-nine thousand nine hundred ninety-nine, all of whom are souls of the deceased who have earned merit and, having received deliverance, are appointed to these official positions.\n\nThe Northern Fengdu Palace, also called the Luo Feng Palace, comprises the Left, Right, and Central Bureaus. The Left Bureau is named the Karma-Measure Deliverance Bureau, overseeing the registers of life and the examinations of the Great Yang Fire Officials. The Right Bureau is named the Ghost-Spirit Spring Bend Bureau, overseeing the registers of death and the examinations of the Great Yin Water Officials. The Central Bureau is named the Numinous Passage Great Karma Bureau, overseeing the trials of life, death, transgressions, and the Wind Blade’s examinations of ghosts and spirits. Each bureau commands fifty million officials, collectively governing the matters of life, death, transgressions, blessings, and the affairs of ghosts and spirits.\n\nThe fourteen departments include:\nThe Lower Primordial’s Northern Primordial Department.\nThe Lower Primordial’s Examination-Righteousness Department.\nThe Lower Primordial’s Nine Disciplines Department.\nThe Lower Primordial’s Four Poles Department.\nThe Lower Primordial’s Dark Night Department.\nThe Lower Primordial’s Long Karma Department.\nThe Lower Primordial’s Suffering Spirits Department.\nThe Lower Primordial’s Three Tribulations Department.\nThe Lower Primordial’s Five Methods Department.\nThe Lower Primordial’s Myriad Torments Department.\nThe Lower Primordial’s Poison Blade Department.\nThe Lower Primordial’s Long Night Department.\nThe Lower Primordial’s Dark Waves Department.\nThe Lower Primordial’s Boundless Department.\n\nThese fourteen departments, established by the Great Mystery’s Lady Qing, belong to the Northern Luo Feng Palace. They oversee the examinations of the Left Bureau’s Great Yang Fire Palace, the Right Bureau’s Great Yin Water Palace, and the Central Bureau’s Wind Blade trials, as well as the penal servitude of ghosts and spirits. Each department is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining officers. They govern the affairs of the long sources of all waters, the Three Rivers, the Nine Rivers, the Four Streams, the dark waves, and the long-night dead souls and ghosts and spirits; record the merits, transgressions, transgressions, and blessings of the people; and determine the retributions and time limits, as set by the Yang Valley Palace. These records are sealed in the Nine Sources Grotto Chamber.\n\nThe Lower Primordial’s third-rank Water Officials’ three palaces—the Left, Right, and Central Bureaus—each govern fourteen departments, totaling forty-two departments. Together, they administer the Nine Rivers Grotto Chambers, all bearing natural designations. They collectively govern the water palaces of the Three Rivers, the Four Seas, the Nine Rivers, the Huai, and the Ji; the water emperors, divine kings, river lords, and all the great sages of the Four Streams; and all the spirits in the waters—both those who have attained the Dao in the past and those who have not, as well as the records of the merits, transgressions, transgressions, and blessings of the people, men and women. They also oversee the long-term penal servitude of the dead, the karmic assembly periods of the myriad spirits, fish, dragons, whales, and other beings in the water palaces.\n\nThe great sages of the various heavens, the perfected ones of wondrous conduct, the sun, moon, and stellar lodges, the jade pivots and armillary spheres, as well as the immortals, perfected ones, jade maidens, and officials of the Five Peaks on earth, along with all the honored spirits, regularly descend on the days of the Great Year, the jiazi, and the gengshen to the Yang Valley, the Clear Cold, and the Northern Fengdu Palaces. There, they gather to review the registers of life and death from the Nine Rivers, the Four Seas, the Three Rivers, the Huai, and the Ji; the penal servitude terms of the long-night dead souls; and the great and small karmic assemblies of the spirits in the water palaces.\n\nOn these days, all the spirits of the water palaces invariably arrive in solemn assembly. The examining officials of the three palaces, nine bureaus, and forty-two departments each hold the blue and black registers of life and death, the penal servitude terms of the long-source dead souls, and the affairs of the great and small karmic assemblies of the myriad spirits in the waters. They distinguish between the blue and black registers and report to the three palaces.\n\nOn the fifteenth day of the first month, the seventh month, and the tenth month, they present the registers of merits, transgressions, transgressions, blessings, life, and death to the three palaces of heaven. Those fated to live are reported to the Left Palace; those destined for immortality, to the Central Palace; and those doomed to die, to the Right Palace. The matters of penal servitude, long-term labor, and the great and small karmic assemblies of the myriad spirits in the waters are reported according to their origins, ensuring correspondence between upper and lower realms. If any qi remains unexamined or unrectified, it is submitted to the three assemblies for further examination and reporting.\n\nThe Upper Primordial’s Heavenly Officials establish three palaces, three bureaus, and thirty-six departments. The Middle Primordial’s Earthly Officials establish three palaces, three bureaus, and forty-two departments. The Lower Primordial’s Water Officials establish three palaces, three bureaus, and forty-two departments. Together, the Heavenly, Earthly, and Water Officials comprise nine palaces, nine bureaus, and one hundred twenty departments. The three ranks succeed one another, governing life, death, transgressions, blessings, and the depth of merits and transgressions, assigning penal servitude, conducting examinations, and setting time limits for days, months, and years without error.\n\nThe merits of those who cultivate immortality and the retributions for their evil deeds are each recorded by their respective examining officials according to their jurisdiction. The Heavenly, Earthly, and Water Officials each establish separate palaces, bureaus, and offices without limit in number—all branches and designations of the offices that prohibit, inspect, and punish, impeaching those with merits, transgressions, or sins, and reporting them to the proper bureaus. The one hundred twenty bureaus are the principal bureaus of the Heavenly, Earthly, and Water Officials.\n\nWithin the human body, there are likewise three palaces, six viscera, one hundred twenty joints, and thirty-six thousand spirits. When the body commits evil, the body’s spirits also report it to the Three Officials. When the body performs good deeds, its name is recorded for transcendence. Life and death, sin and blessing—none fail to originate first with the body’s spirits, which respond in resonance according to nature.\n\nHumans are born by receiving qi, and qi coalesces into spirit. If one can nurture qi, the spirit will abide long; if one inwardly contemplates and guards the true, the true will not depart from the body. Those who obtain the talisman of the Great Mystery for extending life will see the thirty-six thousand spirits coalesce qi and manifest form, jointly elevating the body to ascend to heaven in broad daylight, riding cloud chariots into the void. If essence is lost and qi dissipated, the myriad spirits scatter and flee; the spirit wanders, qi disperses, and the empty corpse perishes.\n\nIn the Heavenly Official’s one palace and central bureau, there are twelve bureaus; in the Earthly Official’s one palace and central bureau, fourteen bureaus; in the Water Official’s one palace and central bureau, fourteen bureaus.\n\nThe protocols for the ranks, titles, superiority and inferiority, merits and transgressions of the Upper Perfected:\nThe protocols for the Upper Perfected and the host of sages in audience and procession, merits and transgressions.\nThe protocols for the Upper Perfected and the Great Sages in excursion and retinue, merits and transgressions.\nThe protocols for the Upper Perfected and the Middle Sages in excursion and retinue, merits and transgressions.\nThe protocols for the Upper Perfected in overseeing the ledgers of life and death, merits and transgressions.\nThe protocols for the Upper Perfected in managing the registers of life, death, and destiny, merits and transgressions.\nThe protocols for the Upper Perfected in managing the weight of merits and transgressions in life and death, merits and transgressions.\nThe protocols for the Upper Perfected in managing the retribution and cyclical turning of the merits of ghosts and spirits, merits and transgressions.\nThe protocols for the Upper Perfected in managing the dark punishments and deliverance of ghosts and spirits, merits and transgressions.\nThe protocols for the Upper Perfected in managing the ascent and deliverance of the dead, the severity of rebirth, merits and transgressions.\nThe protocols for the Upper Perfected in managing the refinement and rebirth of the dead, merits and transgressions.\nThe protocols for the Upper Perfected in managing the ranks and dates of immortals’ attainment of the Dao, merits and transgressions.\nThe protocols for the Upper Perfected in managing the sounds of the myriad demons’ chants and songs, merits and transgressions.\n\n**Three Primordials’ Catalog of Precepts and Transgressions**\n\nThe transgression of those who study the supreme Dao but doubt the scriptures and precepts, harboring dual minds.\nThe transgression of those who study the supreme Dao but slight the sacred texts and criticize the scriptures.\nThe transgression of those who study the supreme Dao but slight their masters and violate their covenants.\nThe transgression of those who study the supreme Dao but slander their masters and fail to revere heavenly principles.\nThe transgression of those who study the supreme Dao but steal scriptures without a master’s lineage.\nThe transgression of those who study the supreme Dao but teach disciples without a master.\nThe transgression of those who study the supreme Dao but obtain scriptures from indirect sources and transmit them to disciples.\nThe transgression of those who study the supreme Dao but obtain scriptures without a master’s covenant and transmission.\nThe transgression of those who study the supreme Dao but, upon receiving scriptures, fail to transmit them according to the scriptural regulations for years and months.\nThe transgression of those who study the supreme Dao but transmit scriptures to unworthy recipients.\nThe transgression of those who study the supreme Dao but receive teachings from masters without the merit of deliverance.\nThe transgression of those who study the supreme Dao but transmit teachings to disciples without merit.\nThe transgression of those who study the supreme Dao but transmit teachings without prior reporting, contrary to their master’s transmission.\nThe transgression of those who study the supreme Dao but transmit scriptures without prior reporting to the Five Emperors.\nThe transgression of those who study the supreme Dao but receive scriptures without faith, disparaging the Dao.\nThe transgression of those who study the supreme Dao but obstruct the worthy and claim merit for themselves.\nThe transgression of those who study the supreme Dao but fail to pay respects to their masters on the first day of the month and the eight seasonal nodes.\nThe transgression of those who study the supreme Dao but do not perform purification fasts.\nThe transgression of those who study the supreme Dao but perform purification fasts without diligence.\nThe transgression of those who study the supreme Dao but recite scriptures with omissions or abbreviations.\nThe transgression of those who study the supreme Dao but, in processions, skip ranks or contend for precedence.\nThe transgression of those who study the supreme Dao but harbor resentment or anger toward their masters.\nThe transgression of students and commoners who attack the virtuous.\nThe transgression of students and commoners who engage in malicious speech and slander.\nThe transgression of students and commoners who criticize their masters or the populace.\nThe transgression of students and commoners who drink to the point of losing their nature.\nThe transgression of students and commoners who kill living beings and secretly harm others.\nThe transgression of students and commoners who indulge in greed and arrogance.\nThe transgression of students and commoners who defile the Dao and its precepts.\nThe transgression of students and commoners who curse ghosts and spirits.\nThe transgression of students and commoners who kill and harm sentient beings.\nThe transgression of students and commoners who engage in frivolous speech, sow discord, and lack faith.\nThe transgression of students and commoners who commit adultery and defilement.\nThe transgression of students and commoners who steal property.\nThe transgression of students and commoners who envy the worthy and resent the capable.\nThe transgression of students and commoners who betray their masters’ kindness.\nThe transgression of students and commoners who deceive their masters and turn against the Dao.\nThe transgression of students and commoners who reveal celestial patterns.\nThe transgression of students and commoners who slander scriptures and precepts.\nThe transgression of students and commoners who regret their cultivation of scriptures midway.\nThe transgression of students and commoners who are disloyal to their superiors.\nThe transgression of students and commoners who deceive their subordinates.\nThe transgression of students and commoners who deceive their fellow students.\nThe transgression of students and commoners who speak kindly but harbor evil in their hearts.\nThe transgression of students and commoners who speak of others’ faults and evils.\nThe transgression of students and commoners who slight the Three Luminaries.\nThe transgression of students and commoners who defile and disrespect spirits and ghosts.\n\nThese sixty transgressions are overseen by the wind-blade examining officials of the Heavenly Official’s one palace and central bureau’s twelve bureaus, the Earthly Official’s one palace and central bureau’s fourteen bureaus, and the Water Official’s one palace and central bureau’s fourteen bureaus.\n\nThe Heavenly Official’s left palace and left bureau’s twelve bureaus, the Earthly Official’s left palace and left bureau’s fourteen bureaus, and the Water Official’s left palace and left bureau’s fourteen bureaus oversee the following:\n\nThe transgression of students and commoners who envy and resent their fellow students.\nThe transgression of students and commoners who engage in frivolity and false speech.\nThe transgression of students and commoners who greedily take profit for themselves without satiety.\n\nThe transgression of students and commoners who hoard emoluments and treasures without thought of dispersing or bestowing them.\nThe transgression of students and commoners who delight in others’ valuables entering their own possession.\nThe transgression of students and commoners who wish harm, ruin, and dispersal upon others.\nThe transgression of students and commoners who privately keep blades, weapons, and arms.\nThe transgression of students and commoners who slaughter the six livestock and take life.\nThe transgression of students and commoners who pierce and shoot wild beasts and flying birds.\nThe transgression of students and commoners who burn mountains to hunt.\nThe transgression of students and commoners who set traps to catch fish.\nThe transgression of students and commoners who use vessels of gold and silver for dining.\nThe transgression of students and commoners who greedily delight in glory and emoluments while enacting cruel governance.\nThe transgression of students and commoners who burn and ruin others’ completed works.\nThe transgression of students and commoners who cast food and drink into water.\nThe transgression of students and commoners who crave impure flavors and rich meats.\nThe transgression of students and commoners who greedily consume the five pungent vegetables.\nThe transgression of students and commoners who write in cursive script with deceptive intent.\nThe transgression of students and commoners who gather and assemble crowds of people.\nThe transgression of students and commoners who scheme to obtain others’ wives.\nThe transgression of students and commoners who criticize state affairs.\nThe transgression of students and commoners who scheme to obtain others’ possessions.\nThe transgression of students and commoners who exchange coarse goods for others’ fine goods.\nThe transgression of students and commoners who curry favor with powerful nobles and kings.\nThe transgression of students and commoners who recklessly speak of celestial timings and stellar lodges.\nThe transgression of students and commoners who set fire to fields, wilds, mountains, and forests.\nThe transgression of students and commoners who fell trees and pluck flowering grasses.\nThe transgression of students and commoners who associate with evil persons and befriend those of different kinds.\nThe transgression of students and commoners who engage with worldly customs and vie for worldly glory.\nThe transgression of students and commoners who eat alone among others without thought of the hungry and destitute.\nThe transgression of students and commoners who disrupt others’ marriages in the world.\nThe transgression of students and commoners who indulge in worldly music and entertainment.\nThe transgression of students and commoners who praise others to their face while secretly slandering the virtuous.\nThe transgression of students and commoners who speak of the faults and evils of their superiors.\nThe transgression of students and commoners who reveal others’ hidden evils and private vulgarities.\nThe transgression of students and commoners who attack the virtuous with groundless and reckless accusations.\nThe transgression of students and commoners who pry into others’ writings and scrutinize their subtleties.\nThe transgression of students and commoners who walk or speak alone with women.\nThe transgression of students and commoners who dwell in mixed-gender groups.\nThe transgression of students and commoners who share meals and exchange clothing with the opposite sex.\nThe transgression of students and commoners who provide improper instruction to men and women.\nThe transgression of students and commoners who hold themselves in high esteem and indulge in arrogance and ease.\nThe transgression of students and commoners who use public matters to avenge private grievances.\nThe transgression of students and commoners who abandon their families and households.\nThe transgression of students and commoners who cause miscarriage or harm to fetuses.\nThe transgression of students and commoners who distance their own clans while favoring those of different surnames.\nThe transgression of students and commoners who poison water to harm living beings.\nThe transgression of students and commoners who conceal and favor their own disciples.\nThe transgression of students and commoners who assemble crowds of people.\nThe transgression of students and commoners who send written accusations against others.\nThe transgression of students and commoners who rely on their own nature and act willfully.\nThe transgression of students and commoners who recklessly create taboos.\nThe transgression of students and commoners who covet others’ affairs and possessions.\nThe transgression of students and commoners who criticize the strengths and weaknesses of teachers and friends.\nThe transgression of students and commoners who belittle the scriptures, teachings, and spoken Dharma.\nThe transgression of students and commoners who disdain and slight the elderly and infirm.\nThe transgression of students and commoners who abandon and despise beggars.\nThe transgression of students and commoners who ride their power and authority to bully others in the world.\nThe transgression of students and commoners who form cliques with their favorites.\nThe transgression of students and commoners whose parents and siblings live separately.\nThese sixty transgressions are overseen by the wind-blade examining officials of the Heavenly Official’s left palace and left bureau’s twelve bureaus, the Earthly Official’s left palace and left bureau’s fourteen bureaus, the Water Official’s left palace and left bureau’s fourteen bureaus, and the Fire Official of the Great Yang.\n\nThe Heavenly Official’s right palace and right bureau’s twelve bureaus, the Earthly Official’s right palace and right bureau’s fourteen bureaus, and the Water Official’s right palace and right bureau’s fourteen bureaus oversee the following:\n\nThe transgression of students and commoners who harbor anger and resentment toward their disciples.\nThe transgression of students and commoners who angrily reproach the virtuous.\nThe transgression of students and commoners who do not release living beings or deliver the dying.\nThe transgression of students and commoners who, in wealth and honor, forget their teachers.\nThe transgression of students and commoners who, on the fasting days of the various heavens, do not contemplate the Dao.\nThe transgression of students and commoners who harbor anger and resentment toward their teachers and masters.\nThe transgression of students and commoners who discuss others’ faults and evils.\nThe transgression of students and commoners who mock others for their ignorance, poverty, and low status.\nThe transgression of students and commoners who encourage others to do evil.\nThe transgression of students and commoners who prevent others from doing good.\nThe transgression of students and commoners who delight in others’ faults and mistakes.\nThe transgression of students and commoners who turn their backs on proper alignment and follow what is not the Dao.\nThe transgression of students and commoners who lack pure reputations at the Five Peaks and Three Rivers.\nThe transgression of students and commoners who defile the Five Peaks and Three Rivers.\nThe transgression of students and commoners who seize what others cherish.\nThe transgression of students and commoners who gallop through worldly customs seeking to compete in the world.\nThe transgression of students and commoners who attend worldly celebrations and condolences to please the masses.\nThe transgression of students and commoners who claim others’ achievements as their own virtue.\nThe transgression of students and commoners who comment on others’ preferences and aversions in food and drink.\nThe transgression of students and commoners who frighten and alarm the people, bringing about their decline and misfortune.\n\nThe transgression of students and commoners who frighten birds and beasts into desolate lands.\nThe transgression of students and commoners who terrify the old and the young.\nThe transgression of students and commoners who disrespect and belittle officials and authorities.\nThe transgression of students and commoners who debate the rights and wrongs of the world.\nThe transgression of students and commoners who recklessly discuss the rise and fall of the state.\nThe transgression of students and commoners who bestow favors while harboring stinginess.\nThe transgression of students and commoners who wander without restraint.\nThe transgression of students and commoners who ascend heights without regard for descent.\nThe transgression of students and commoners who cage flying birds and running beasts.\nThe transgression of students and commoners who delight in others’ misfortunes and calamities.\nThe transgression of students and commoners who obstruct paths with thorns.\nThe transgression of students and commoners who bow and worship spirits and ghosts.\nThe transgression of students and commoners who expose themselves to the Three Luminaries.\nThe transgression of students and commoners who curse wind and rain.\nThe transgression of students and commoners who borrow and do not return.\nThe transgression of students and commoners who deceive others with false honors.\nThe transgression of students and commoners who are arrogant toward the Three Treasures and disdain the Heavenly Worthies.\nThe transgression of students and commoners who plot against rulers, elders, teachers, and parents.\nThe transgression of students and commoners who encourage others to be unfilial to parents and siblings.\nThe transgression of students and commoners who falsely claim unique titles as Perfected Ones.\nThe transgression of students and commoners who trust in heterodox teachings and deviant views.\nThe transgression of students and commoners who, without a scriptural master, falsely study and deceive gods and humans.\nThe transgression of students and commoners who hoard excess clothing and do not distribute it to the poor.\nThe transgression of students and commoners who secretly copy scriptures and precepts with carelessness and exposure.\nThe transgression of students and commoners who adorn their coarse garments with extravagant embellishments.\nThe transgression of students and commoners who, with unclean bodies, ascend high seats.\nThe transgression of students and commoners who disrespect and slight the master’s gate without reverence.\nThe transgression of students and commoners who, when their master is in sorrow or distress, do not establish fasts or prayers.\nThe transgression of students and commoners who abandon and forget their master while pursuing worldly fame.\nThe transgression of students and commoners who, when their master gains wealth and nobility, hope for prosperity and glory.\nThe transgression of students and commoners who, when their master is ill or in distress, do not attend or inquire.\nThe transgression of students and commoners who, when far from distress and urgency, pursue ease and pleasure.\nThe transgression of students and commoners who enter and exit the Dao’s gates without opening or closing them.\nThe transgression of students and commoners who recklessly converse with others within the Dao’s gates.\nThe transgression of students and commoners who, when hosting fasts and invitations, do not transfer merit to the Three Officials.\nThe transgression of students and commoners who grieve for their own families and do not consider others’ distress.\nThe transgression of students and commoners who, when their families suffer misfortune or illness, blame the Dao and fault their master.\nThe transgression of students and commoners who, having received their master’s scriptures and Dao, claim to have attained them themselves.\nThe transgression of students and commoners who transmit their master’s Dao and methods without offering pledges or tokens of faith.\n\nThese sixty transgressions are overseen by the twelve bureaus of the Heavenly Official’s Right Palace and Right Mansion, the fourteen bureaus of the Earthly Official’s Right Palace and Right Mansion, the fourteen bureaus of the Water Official’s Right Palace and Right Mansion, and the Examiners of the Great Yin Water Official.\n\nThe Three Primordials’ Precept Categories each contain sixty precepts, totaling one hundred eighty precepts, each governed by the yin and yang, left and right, water and fire, wind and blade officials’ examination registers.\n\nThe fifteenth day of the first month is the Upper Primordial’s Precept Examination Day.\nThe fifteenth day of the seventh month is the Middle Primordial’s Precept Examination Day.\nThe fifteenth day of the tenth month is the Lower Primordial’s Precept Examination Day.\n\nOn these three days of the year, the earthly and Five Emperors’ sacred mountains, the divine officials of the Three Realms, and all the water palaces’ Three Officials administer punishments. Without bound or depth, near or far, great or small, all divine spirits ascend together to the Upper Three Heavens’ Mysterious Capital Three Primordials’ Palace, bearing the records of those who have attained the Dao on heaven and earth, those who have not yet attained it but dwell in blessings, and the karmic roots and ledgers of the living and the dead, their merits and transgressions, their light and heavy deeds, all reported to Heaven.\n\nOn that day, the Boundless Heavenly Worthy, the Ten Directions’ Great Sage Assembly, the Thirty-Two Heavenly Emperors, the Flying Heavenly Divine Kings, the Supreme Jade Void Perfected Great Spirits, the Boundless Great Dao’s Most High Lord Lao, the Venerable Masters, the Five Elder Emperors, the Southern and Northern Poles and Eastern and Western Flowers, the Nine Numinous Perfected Mothers, the Southern Upper Primordial Lady, and the Jade Maiden of Supreme Harmony all arrive together at the Three Primordials’ Palace. Once the assembly of sages is gathered, the flying immortals, divine immortals, Perfected Ones, Jade Maidens, the Longevity Directors of Life and Death, the Southern and Northern Dippers, the celestial sun, moon, and stars, the Jade Armillary Sphere, and all divine beings arrive in solemn array.\n\nThe Three Primordials’ left, right, and central palaces’ Three Officials and nine mansions’ one hundred twenty bureaus, the yin and yang, left and right, water and fire, wind and blade examination officials, each calculate the ledgers of life and death in heaven and on earth, cross-examining one another. Those with good deeds are recorded in the Azure Register; those with heavy transgressions are inscribed in the Black Register. Each is reported to the Three Officials with their merits and transgressions, good and evil, without the slightest error.\n\nOn that day, those who follow the Three Primordials’ method of repentance, purify themselves with fasting, burn incense, and act in accordance with the Mysterious Regulations for one hundred days will have their earthly dwellings specially guarded, their gates and defenses secured. After eight years of practice, they will all receive the Three Officials’ protection and recommendation, their names inscribed in the Azure Register, and they will attain the rank of Upper Immortal, never losing their destined place in the Dao.\n\nThe Dao Lord bows his head and respectfully asks the Heavenly Worthy: What determines the weight of merits, the stages of deliverance, and the order of precedence? Past-life heavy debts are repaid by oneself and may extend to one’s descendants. The evil one commits in this life brings retribution upon oneself and may also mislead the deceased. Now, as we see among the common people—men and women—those who suffer in this life, enduring all manner of hardships and a hundred afflictions, unable to free themselves.\n\nMoreover, we witness the tormented forms and souls of the deceased, dragged and tossed amidst the Three Wretched Paths and Five Sufferings, forever bound to the Long River’s icy courts, where wind and blade torment them across ten thousand kalpas without release. Scriptures and transmissions speak variously: some say the evil of past lives brings calamity upon descendants; others, that one’s own grave sins mislead the departed ancestors; still others, that good and evil each have their karmic counterparts, and that the roots of life and death, sin and blessing, lie in one’s own fate. If such karmic retribution—good or ill—belongs to each individual alone, why then do we speak of delayed or extended consequences? Yet it is also said that without the merit of deliverance, the condemned souls of past lives have no means of liberation. Once merit is established, the gates of life and death open wide. But if each bears their own karmic ties, and those who commit evil perish only to sink into eternal darkness for ten thousand kalpas, how could they ever amass such great merit to redeem themselves? If descendants build merit on behalf of the deceased, this would differ little in principle from the notion of delayed consequences. My understanding is shallow and narrow; I cannot fathom this. Since the Heavenly Worthy has inaugurated the teaching of great forgiveness, illuminating both life and death, it is fitting that the hidden and the manifest be made entirely clear, lest the ignorant remain confused by these two doctrines.\n\nHaving been elevated to this office and entrusted with its oversight, I must proclaim the true Dharma and enlighten future generations. May the sound of this teaching flow through all heavens, enduring for billions of kalpas, preserving the Orthodox Unity, so that all beings—living and dead—may receive its blessings, and the light of great forgiveness be made manifest. For this reason, I humbly present this inquiry, beseeching the Heavenly Worthy to grant a measure of compassion.\n\nThereupon, the Heavenly Worthy replied with joy: Excellent, excellent. Your question is of profound importance. Though you have penetrated the cavernous depths of the numinous, the hidden sources remain not fully exhausted; though you have surveyed the vast expanse, the Dragon Han remains obscure. Qi cannot be exhausted, numbers cannot be fathomed; death gives way to rebirth, darkness to light. The turning of heaven and earth is like a wheel’s revolution; the arising and ceasing of human life is like a shadow following form—thus, it is difficult to bring to an end. Qi flows in ceaseless succession, giving rise to manifold conditions of birth. Good and evil, fortune and misfortune—each has its root in fate. It is neither heaven nor earth, nor even other people, but precisely the mind. The mind is spirit. The body is not truly ours. That by which we live comes from the void and the natural, dwelling temporarily in the womb, transformed and born. The parents who conceived us are not our original parents; our true parents are not here. The love and reverence we owe our parents are supreme and without equal. Yet the parents who bore us in this life are but the karmic conditions of our temporary lodging, the source of nurture and upbringing to whom we repay gratitude with propriety, calling them father and mother.\n\nThus, the body we receive is not truly our own. It is but a dwelling, a temporary abode, a shelter for the self. We cling to it as form, manifesting existence and nonexistence. Therefore, those who attain the Dao no longer possess a body. When I have no body, what suffering can I know? Suffering arises only because I have a body. With a body, a hundred afflictions arise; without a body, one enters the natural, aligns with the Dao, and body and spirit become one. When body and spirit unite, it is the true body, returning to the original parents and attaining the Dao—free from suffering, never to die. Even if one enters nirvana, the spirit departs while the form does not perish to ash. In the end, it returns to its origin, never parted. If the body commits a hundred evils and dies after exhausting its sins, this is called death. Death is dissolution, a return to the parents of the borrowed womb. If the karmic conditions are not yet fulfilled, it cannot return to the true parents. The spirit, bound to toil and drudgery, the form reduced to dust, the dust scattered and transformed into *shuang*. When the soul is liberated, it merges with the *shuang*, and thus soul and *shuang* transform as one, gaining rebirth and becoming human again. Body and spirit follow one another, never parting.\n\nIn this way, good and evil each have their counterparts, belonging to the individual alone. How can blame be laid upon ancestors or descendants? Before the Dragon Han, extending to the Red Clarity, the old texts state that life and death arise from the self, neither extending upward nor flowing downward; sin and blessing are borne by the individual alone. After the Red Clarity, reaching the High Antiquity, the human heart was corrupted: men and women lost their purity, jealousy and harm arose, and they turned to mutual destruction. The heart could not stand firm, drawing in ancestors above and descendants below as witnesses, swearing oaths before the gods. Yet they lacked self-trust, violating their vows, leading the Three Officials to record their transgressions. Upon death, they became ghosts, misleading the departed above and burdening descendants below, entangling all in calamity, great and small, without end, bringing ruin to the entire clan. Such evil-doers bring great misfortune upon themselves. The clear teachings of the Dharma state that they shall never be equaled. Those of insight accumulate merit, seeking it within themselves, not from others. Are the ancient texts of the Perfected not to be trusted?\n\nThe Heavenly Worthy further addressed the Most High Dao Lord: The Dao of great compassion places the deliverance of others first. Without merit, there is no reward; without virtue, no promotion; without faith, no deliverance; without practice, no immortality. Those who establish merit do so for the sake of heaven and earth, the Three Luminaries, the sovereign, the myriad people, their ancestors, their family, all beings, and themselves. The scriptures say: If you wish to deliver yourself, first deliver others. If all others are not delivered, you yourself will never be delivered. Great compassion is vast and boundless, extending mercy without end, revered by heaven and humanity—how much more so for the seven generations of ancestors? Sin and blessing may not be transferred, but when it comes to merit, there is the bond of karmic gratitude. Sincere remorse moves heaven to reverse one’s fate; the power of single-minded devotion opens the way for both humans and spirits. How much more so for those who, born of borrowed qi and nurtured in the womb, owe their existence and upbringing to others? When love and affection run deep, how can one not strive to build great merit, to deliver and repay the destitute souls?\n\nSince the Dragon Han era through to the Red Clarity, those who attained the Dao and abide in present blessings—whose households are pure and noble, whose good affinities extend into future lives—have all accumulated merit and piled up virtue, their achievements moving the various heavens to bestow reciprocal rewards. As for those bound in the long night of the Nine Dark Realms, whose karmic debts have been resolved, none have escaped through anything but the power of merit: ransoming, delivering, and returning them to the human realm. In the Southern Ridge’s Vermilion Palace and the Nine Capitals’ upper registers, all their names are recorded—such is the principle of karmic retribution, precise to the finest detail. The reckoning of years and months is utterly clear.\n\nThe Dao Lord bowed in reverence: Having now heard the Heavenly Worthy expound the karmic correspondences of merit and retribution, all doubts have instantly dissolved; my heart rejoices and my mind is at ease, with no lingering obstructions. I shall diligently apply my heart to propagating the Great Dharma, universally revealing it to all the people—men, women, and children—throughout the boundless worlds of the various heavens, that all may comply and fully perceive its truth.\n\nThe Most High Dao Lord addressed the Heavenly Worthy: Since you have deigned to awaken and resolve all doubts, I now inquire which among the merits should be prioritized. Are the revealed true statutes, the supreme wisdom of the highest grade for ransoming the roots of sin, sufficient in themselves, or are there additional methods? Does the solemn vow to ransom sins, the instruction of the young and ignorant, the establishment of quiet abodes, the offering of reverence to masters and treasures, the distribution of incense and oil, the lighting of lamps to illuminate the night, the cultivation of good thoughts, the deliverance of sentient beings, the practice of compassion, loyalty, and filial piety, the relief of the destitute, and the feeding of the hundred birds—all without stint—carry varying degrees of merit? Are they of the same rank, or do they differ in nobility and humility? I humbly request your instruction.\n\nThe Heavenly Worthy replied: In the establishment of merit, there is no great nor small, no high nor low—its power is equal. The weight of karmic retribution depends on the heart of the practitioner. If one’s heart remains unwavering in diligence, enduring hardship without retreat, such merit is beyond measure, and its virtue beyond naming. Yet if one merely possesses sincere intention but does not persist in practice, one may only escape sin without attaining further reward. Those who act without true heart, offering empty gestures, gain nothing from their efforts.\n\nThe wealthy, cherishing their treasures, refuse to distribute or ransom the roots of sin; they merely contemplate the Dao in their hearts, hoping for great reward—such efforts are futile and profitless. How could the heavenly Dao demand one’s wealth, compelling merit-making? It observes the stinginess of the heart and examines the sincerity of intent: if one possesses but does not give, what can one seek? Yet the poor who arouse the heart, whose will is firm and bright, who toil without complaint in the master’s gate—such individuals are seen by the Dao, and their merit moves the various heavens. Thus, offering wealth corresponds to the heart, and offering the heart corresponds to wealth—their merit is equal.\n\nThe ancients sought the heart; the degenerate age seeks wealth. The ancients attained immortality through nothing but the heart; the degenerate age attains deliverance through nothing but wealth. Why is this so? In the degenerate age, wealth is prized over the Dao. If a thousand pounds of gold and a scroll of immortal scripture were placed in a barren mountain, the people of this age would covet the gold, not the scripture. Gold can only bring bodily affliction; the scripture can extend one’s life. One ought to know this, yet one cannot escape stinginess and greed. If one cannot free oneself from greed and stinginess, how can one fully realize the Dao? Thus, it is not that the Dao fails to flourish among people—this is what is meant.\n\nThe statutes of luminous truth and the supreme wisdom of the highest grade for ransoming the roots of sin, applied to the realm of birth and death, are of the utmost gravity. As for scholars who have not yet entered samadhi, dwelling amid the clamor of the world, how can they avoid gains and losses? In every action and deed, sin and blessing proceed together. Thus, the Three Bureaus, Nine Courts, One Hundred Twenty Offices, and the left and right officials of yin and yang, water and fire, who oversee human gains and losses—those who accumulate good merit have their names recorded in the left registers, while those who commit evil have theirs in the right. Each is assessed according to the years, months, days, and the nearness or distance of their merit, with the weight of days determining the gravity. Karmic retribution converges like the meeting of tidal waters, its appointed time inevitable, with not a single error. The difference lies only in the weight and proximity of the reckoning.\n\nI now declare this to you so that you may diligently proclaim it, that all good men and women of future generations may universally know that heaven and earth possess an unerring resonance, and that these words are truly real. I now transmit the method of atonement for the Three Primes. The ancient texts of the Primordial Dao of the Origin were concealed in the Three Prime Palaces, revealed but once in ten thousand kalpas, never passed down to the lower worlds. Those who behold their titles may uproot their karmic roots and untie their bonds of their own accord. Treasure and practice them, and great fortune will surely follow. Treat them lightly or leak their secrets, and calamity will strike, annihilating one’s clan. With utter sincerity, deeply guard these statutes.\n\nThe Dao Lord rejoiced, bowed his head, and paid homage. At that moment, all the heavens simultaneously proclaimed their approval, bowed their heads, and received the teaching. Thus concludes *The Scripture on the Weight of Merit in the Three Prime Precepts of the Upper Cavern of Mystery and Numinous Treasure*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝三元品戒功德轻重经 经名：太上洞玄灵宝三元品戒功德轻重经。 撰人不详，约出於东晋。 古《灵宝经》 中原有《三元品戒经》一卷，本篇即该经之部分篇章，后人分出单行。 一卷。 太上洞玄灵宝三元品戒功德轻重经 底本出处：《正统道藏》洞玄部戒律类。 天尊曰：上元一品天官，元气始凝，三光开明，结青黄白之气，置上元三宫。 其第一宫名太玄都元阳七宝紫微宫，则青元始阳之气，总主上真自然玉虚高皇上帝、诸天帝王上圣大神。 其宫皆五亿五万五千五百五十五亿五万重，亦有五亿五万五千五百五十五亿五万重青阳之气，其中神仙官僚亦有五亿五万五千五百五十五亿五万重，亦有五亿五万五千五百五十五亿五万众，皆结自然青元之气而为人也。 衣则青羽飞衣。 紫微宫中有延生之符，书符安八方，则八方之气欻然而到，响应成人。 毁符，以火焚之，而人随烟即化还为气也。 自非金简玉名得道之人，莫能施之。 其文四万劫一出，太阳火官主之，太玄上府行之。 紫微宫置左右中三府。 左府主生，太阳火官考之。 右府主死，太阴水官考之。 中府主生死罪录风刀之考。 三府各领官僚九千万众，总统生死罪福一十二曹官： 太玄上元明真曹。 太玄上元监正曹。 太玄上元梵行曹。 太玄上元开灵曹。 太玄上元禁神曹。 太玄上元通明曹。 太玄上元正神曹。 太玄上元开明曹。 太玄上元三都曹。 太玄上元南上曹。 太玄上元元功曹。 太玄上三灵曹。 右一十二曹，太玄女青所置，属紫微宫，主左府太阳火官、右府太阴水官，中府风刀之考。 一十二曹，曹置一百二十考官，一千二百考吏，一万二千考兵，一十二万考士。 主总上真已得道过去及未得道见在福中，及百姓子男女人所犯功过罪恶簿录。 大考三年，中考九年，小考二十四年。 大福三年，中福九年，小福二十四年。 罪福俱行，功过同报。 善恶簿录在玄都明真玉匮七宝函中。 上元一品天元中黄之气左宫，名太玄都元黄太极左宫，则元始元黄之气，总主上真已得道过去及未得道，及百姓子男女人生命录籍。 其宫皆五亿五万五千五百五十五亿五万重，亦有五亿五万五千五百五十五亿五万重元黄之气。 其中神仙官僚亦有五亿五万五千五百五十五亿五万重，亦有五亿五万五千五百五十五亿五万众。 皆结自然元黄之气而为人也。 衣则黄羽飞衣。 太极左宫中有招灵之符，用之法度亦如紫微宫延生之仪格也。 风刀考官主之，太玄左府行之。 太极左宫置左右中三府。 左府主生，太阳火官考。 右府主死，太阴水官考。 中府主生死罪录风刀之考。 三府各领官僚九千万众，总统生死罪福一十二曹官： 太玄上元明梵曹。 太玄上元威灵曹。 太玄上元太常曹。 太玄上元太清曹。 太玄上元宣威曹。 太玄上元明都曹。 太玄上元都灵曹。 太玄上元太仪曹。 太玄上元明法曹。 太玄上元考正曹。 太玄上元明威曹。 太玄上元九都曹。 右一十二曹。 太玄女青所置，属元黄太极左宫，主左府太阳火宫、右府太阴水宫、中府风刀之考。 一十二曹，曹置一百二十考官，一千二百考史，一万二千考兵，一十二万考士，主总上真已得道过去及未得道见在福中，及百姓子男女人生命录籍，及应得道仙右玉简。",
      "translated_text": "*The Scripture on the Merits and Gravity of the Three Primal Precepts from the Supreme Cavernous Mystery Numinous Treasure*\n\nThus spake the Heavenly Worthy:\n\nIn the Upper Primal Realm, the Celestial Officials of the First Order, where primordial qi first congeals and the Three Luminaries dawn in radiance, the essences of azure, yellow, and white qi coalesce to establish the Three Palaces of the Upper Primal. The first of these is named the Supreme Cavernous Mystery Primordial Yang Seven-Jewel Purple Tenuity Palace. Therein resides the azure primordial yang qi, governing the Perfected of the Upper Realms, the Celestial August Emperor of the Jade Void, the Divine Sovereigns of the Heavens, and the exalted deities of the highest sanctity.\n\nThis palace is arrayed in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers, enveloped likewise in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers of azure yang qi. Within it, the divine immortals and their retinues number fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad, as do their multitudes—all formed from the spontaneous coagulation of azure primordial qi into human form. Their raiment is of azure feathered flight-garments.\n\nWithin the Purple Tenuity Palace lies the Talisman of Prolonged Life. When this talisman is inscribed and placed in the eight directions, the qi of those regions rushes forth in response, manifesting as human beings. Should the talisman be destroyed and burned in fire, the people dissolve with the smoke, reverting to qi. None but those who have attained the Dao with golden tablets and jade names may wield it. Its script emerges but once every forty thousand kalpas, overseen by the Fire Officials of the Great Yang and enacted by the Upper Repository of the Supreme Cavernous Mystery.\n\nThe Purple Tenuity Palace contains three bureaus: left, right, and central. The Left Bureau governs life, examined by the Fire Officials of the Great Yang. The Right Bureau governs death, examined by the Water Officials of the Great Yin. The Central Bureau governs the records of life, death, transgressions, and the trials of the Wind Blade.\n\nEach bureau commands a retinue of ninety million officials, collectively administering the twelve departments of life, death, transgressions, and blessings:\n\n1. The Supreme Cavernous Mystery Upper Primal Illuminated Perfection Department\n2. The Supreme Cavernous Mystery Upper Primal Surveillance and Rectification Department\n3. The Supreme Cavernous Mystery Upper Primal Brahman Conduct Department\n4. The Supreme Cavernous Mystery Upper Primal Unfolding Numinosity Department\n5. The Supreme Cavernous Mystery Upper Primal Spirit-Restraining Department\n6. The Supreme Cavernous Mystery Upper Primal Luminous Clarity Department\n7. The Supreme Cavernous Mystery Upper Primal Rectified Spirits Department\n8. The Supreme Cavernous Mystery Upper Primal Unfolding Clarity Department\n9. The Supreme Cavernous Mystery Upper Primal Three Capitals Department\n10. The Supreme Cavernous Mystery Upper Primal Southern Ascendant Department\n11. The Supreme Cavernous Mystery Upper Primal Primordial Merit Department\n12. The Supreme Cavernous Mystery Upper Three Numinosities Department\n\nThese twelve departments were established by the Supreme Cavernous Mystery Lady of Azure, subordinate to the Purple Tenuity Palace. They govern the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s trials by Wind Blade. Each department comprises one hundred twenty examining officials, one thousand two hundred examining scribes, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They oversee the registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and the merits and transgressions of all men and women among the common folk.\n\nMajor trials occur every three years, intermediate trials every nine years, and minor trials every twenty-four years. Major blessings are bestowed every three years, intermediate blessings every nine years, and minor blessings every twenty-four years. Transgressions and blessings are meted out together, merits and demerits recompensed alike. The ledgers of good and evil are stored within the Seven-Jewel Casket of the Illuminated Perfection Jade Coffer in the Cavernous Mystery Capital.\n\nIn the Upper Primal Realm, the left palace of the primordial yellow qi of the Central Yellow is named the Supreme Cavernous Mystery Primordial Yellow Supreme Ultimate Left Palace. Therein resides the primordial yellow qi of the Origin, governing the registers of life for the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it, and all men and women among the common folk.\n\nThis palace is arrayed in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers, enveloped likewise in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers of primordial yellow qi. Within it, the divine immortals and their retinues number fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad, as do their multitudes—all formed from the spontaneous coagulation of primordial yellow qi into human form. Their raiment is of yellow feathered flight-garments.\n\nWithin the Supreme Ultimate Left Palace lies the Talisman of Summoning Spirits. Its method of use follows the same rites and standards as the Talisman of Prolonged Life in the Purple Tenuity Palace. It is overseen by the Wind Blade Examining Officials and enacted by the Left Repository of the Supreme Cavernous Mystery.\n\nThe Supreme Ultimate Left Palace contains three bureaus: left, right, and central. The Left Bureau governs life, examined by the Great Yang Fire Officials. The Right Bureau governs death, examined by the Great Yin Water Officials. The Central Bureau governs the records of life, death, transgressions, and the trials of the Wind Blade.\n\nEach bureau commands a retinue of ninety million officials, collectively administering the twelve departments of life, death, transgressions, and blessings:\n\n1. The Supreme Cavernous Mystery Upper Primal Illuminated Brahman Department\n2. The Supreme Cavernous Mystery Upper Primal Majestic Numinosity Department\n3. The Supreme Cavernous Mystery Upper Primal Grand Constancy Department\n4. The Supreme Cavernous Mystery Upper Primal Grand Purity Department\n5. The Supreme Cavernous Mystery Upper Primal Proclaiming Majesty Department\n6. The Supreme Cavernous Mystery Upper Primal Illuminated Capital Department\n7. The Supreme Cavernous Mystery Upper Primal Capital Numinosity Department\n8. The Supreme Cavernous Mystery Upper Primal Grand Ceremony Department\n9. The Supreme Cavernous Mystery Upper Primal Illuminated Dharma Department\n10. The Supreme Cavernous Mystery Upper Primal Examining Rectification Department\n11. The Supreme Cavernous Mystery Upper Primal Illuminated Majesty Department\n12. The Supreme Cavernous Mystery Upper Primal Nine Capitals Department\n\nThese twelve departments were established by the Supreme Cavernous Mystery Lady of Azure, subordinate to the Primordial Yellow Supreme Ultimate Left Palace. They govern the Left Bureau’s Great Yang Fire Palace, the Right Bureau’s Great Yin Water Palace, and the Central Bureau’s trials by Wind Blade. Each department comprises one hundred twenty examining officials, one thousand two hundred examining scribes, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They oversee the life registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and all men and women among the common folk, as well as those destined to attain immortality with jade tablets on the right.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1305,
      "start_sentence": 0,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.033061742782593,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "功过注上除落品格，罪福报应，亦如紫微宫年限。 簿录封於玄都明真玉匮阳生函中。 上元一品天元洞白之气右宫，名太玄都洞白太极右宫，则天元洞白之气，总主上真已得道过去及未得道，百姓子男女人灭度仙录及罪传死籍。 其宫皆五亿五万五千五百五十五亿五万重，亦有五亿五万五千．五百五十五亿五万重洞白之气。 其中神仙官僚亦有五亿五万五千五百五十五亿五万重，亦有五亿五万五千五百五十五亿五万众。 皆结自然洞白之气而为人也。 衣白羽飞衣。 太极右宫中有明真之符，用之法度亦如紫微宫延生之仪格也。 太阴水官考主之，太玄右府行之。 太极右宫置左右中三府。 左府主生，太阳火官考。 右府主死，太阴水官考。 中府主生死罪录风刀之考。 三宫各领官僚九千万众，总统生死罪福一十二曹官： 太玄上元司正曹。 太玄上元四明曹。 太玄上元监天曹。 太玄上元司杀曹。 太玄上元盟天曹。 太玄上元幽都曹。 太玄上元威仪曹。 太玄上元太阴曹。 太玄上元下元曹。 太玄上元监司曹。 太玄上元监灵曹。 太玄上元太明曹。 右一十二曹，太玄女青所置，属元洞白太极右宫，主左府太阳火宫、右府太阴水官、中府风刀之考。 一十二曹，曹置一百二十考官，一千二百考吏，一万二千考兵，一十二万考士。 主总领上真已得道过去及，未得道见在福中，及百姓子男女人应灭度退削仙名及死者录籍年月。 定名品仙格，罪福报应，亦如紫微宫年限。 簿录封於长夜之府九幽玉匮北库函由丁。 上元一品天官三宫左右中三府，府统一十二曹，合三十六曹，普治元阳之上太空之中自然之号，普统上真已得道过去及未得道见在福中，及百姓子男女人灭度生死功过簿录。 高皇玉帝、诸天大圣众、十方诸天大神、无极太一、南极上真、妙行真人、诸天日月星宿、纵玑玉衡，无鞅数众，一切尊神，常以正月十五日、七月十五日、十月十五日，一年三过，集校诸天已得道过去及未得道，百姓子男女人灭度生死功过簿录。 其日阴阳水火风刀三府考官、三十六曹官属，各条算功过罪恶轻重、年月日限。 事事分别青黑二簿，列奏紫微太极左右中三宫。 功德满足，应合仙者，言名紫微宫。 有善功敬信，宗奉大法者，言名太极左宫。 有积恶不合道，罪应死者，言名太极右宫。 紫微宫则书玉名金录仙籍，告下地官削薄，水官除简，三界侍护，不得干犯。 如女青文，太极左宫则书青元之录，长生玉历南上之籍，告下水土二官，右别营卫，不得干犯。 如女青文，太极右官则注黑簿，移付长夜九幽之府，告下水土二官，摄录罪魂，付司杀送役。 若善恶功过考气未正，皆申三会，须考正又言也。 中元二品地官，元洞混灵之气，凝极黄之精，置中元三宫。 其第一宫号洞空清灵宫，则元洞混灵之气，总主五帝五岳诸真人及地上诸神仙已得道诸大神。 其宫皆五亿五万五千五百五十五亿五万重混灵之气，其中神仙神灵官僚有九万九千九百九十九万众，此皆是死者有功德之魂，受度得补地官之任，各有年限，功满便得进升天仙官号。 亦还生人中，其随缺随补，以充其任。 洞空清灵宫，一号明晨武城宫，置左右中三府。 左府号耐犯明晨府，主生，太阳火官考。",
      "translated_text": "The recording of merits and demerits, the erasure or retention of ranks, and the retribution of sins and blessings follow the same time limits as those of the Purple Tenuity Palace. The registers are sealed within the Yang-Generating Case of the Mysterious Capital’s Luminous Perfected Jade Coffer. The Right Palace of the Supreme Cavernous Primordial White Qi of the First-Rank Upper Primordial Heaven, named the Supreme Cavernous Primordial White Supreme Ultimate Right Palace, is governed by the Primordial Cavernous White Qi. It oversees the registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it, the records of common men and women’s transcendence and immortal ascension, as well as the death registers of the condemned. This palace comprises fifty billion, five myriad, fifty-five hundred million, fifty-five myriad, fifty-five layers, and is also enveloped by fifty billion, five myriad, fifty-five hundred million, fifty-five myriad layers of Cavernous White Qi. The divine immortals and officials within likewise number fifty billion, five myriad, fifty-five hundred million, fifty-five myriad, and are also fifty billion, five myriad, fifty-five hundred million, fifty-five myriad in multitude. All are formed from the natural Cavernous White Qi into human form. They wear feathered flying robes of white.\n\nWithin the Supreme Ultimate Right Palace resides the Luminous Perfected Talisman, whose usage and regulations follow the same rites of life extension as those of the Purple Tenuity Palace. The Palace of Great Yin Water governs its examinations, and the Supreme Cavernous Right Bureau enforces them. The Supreme Ultimate Right Palace comprises three bureaus: Left, Right, and Central. The Left Bureau governs life and is examined by the Palace of Great Yang Fire. The Right Bureau governs death and is examined by the Palace of Great Yin Water. The Central Bureau governs the trials of life, death, and sin by Wind Blade. Each of the three palaces commands ninety million officials and collectively oversees the twelve departments of life, death, sin, and blessing:\n\nSupreme Cavernous Upper Primordial Rectifying Department.\nSupreme Cavernous Upper Primordial Four Luminaries Department.\nSupreme Cavernous Upper Primordial Celestial Surveillance Department.\nSupreme Cavernous Upper Primordial Execution Department.\nSupreme Cavernous Upper Primordial Celestial Covenant Department.\nSupreme Cavernous Upper Primordial Dark Capital Department.\nSupreme Cavernous Upper Primordial Dignity Department.\nSupreme Cavernous Upper Primordial Great Yin Department.\nSupreme Cavernous Upper Primordial Lower Primordial Department.\nSupreme Cavernous Upper Primordial Surveillance Department.\nSupreme Cavernous Upper Primordial Spirit-Watching Department.\nSupreme Cavernous Upper Primordial Great Luminosity Department.\n\nThese twelve departments were established by the Supreme Cavernous Mystery Lady of Azure and are subordinate to the Primordial Cavernous White Supreme Ultimate Right Palace. They govern the Left Bureau’s Palace of Great Yang Fire, the Right Bureau’s Palace of Great Yin Water, and the Central Bureau’s trials by Wind Blade. Each department comprises one hundred twenty examining officials, one thousand two hundred examining scribes, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They oversee the comprehensive registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and all common men and women whose names are to be erased from the immortal records due to transcendence or death, recording their dates. They determine the ranks of immortals, the retribution of sins and blessings, following the same time limits as those of the Purple Tenuity Palace. The registers are sealed within the Northern Repository Case of the Nine Dark Jade Coffer of the Everlasting Night Bureau.\n\nThe three palaces of the First-Rank Upper Primordial Heavenly Officials—Left, Right, and Central—each govern twelve departments, totaling thirty-six departments. They universally administer the natural titles within the Supreme Void of Primordial Yang, collectively overseeing the registers of merits and demerits, life and death, of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and all common men and women. The August Jade Emperor, the assemblies of Heavenly Great Sages, the myriad deities of the Ten Directions, the Boundless Supreme Unity, the Upper Perfected of the Southern Culmen, the Perfected of Wondrous Conduct, the celestial bodies of the sun, moon, and stars, the innumerable hosts of the Jade Armillary Sphere, and all revered deities convene thrice yearly—on the fifteenth day of the first, seventh, and tenth months—to review and verify the registers of life, death, merits, and demerits of those who have attained the Dao in past kalpas, those yet to attain it, and all common men and women.\n\nOn these days, the examining officials of the Three Bureaus—Yin-Yang, Water-Fire, and Wind Blade—and the thirty-six departments’ officials and subordinates meticulously calculate the weight of merits, demerits, sins, and transgressions, along with their time limits. Each matter is distinctly recorded in the Green and Black Registers and presented to the Purple Tenuity and Supreme Ultimate Palaces—Left, Right, and Central. Those whose merits are complete and who are destined for immortality are recorded in the Purple Tenuity Palace. Those who have accumulated good deeds, reverence, and faith, and who uphold the Great Dao, are recorded in the Supreme Ultimate Left Palace. Those who have amassed evil and are unfit for the Dao, whose sins warrant death, are recorded in the Supreme Ultimate Right Palace.\n\nFor the Purple Tenuity Palace, names are inscribed in the Golden Register of Jade Records, and the Earthly Bureau is notified to erase their mortal records, while the Water Bureau removes their names from the registers. They are protected across the Three Realms and may not be violated, as decreed in the Writ of the Lady of Azure. For the Supreme Ultimate Left Palace, names are inscribed in the Azure Primordial Register and the Jade Calendar of Longevity in the Southern Upper Realm. The Water and Earth Bureaus are notified to provide separate protection, ensuring no violation, as decreed in the Writ of the Lady of Azure. For the Supreme Ultimate Right Palace, names are recorded in the Black Register and transferred to the Everlasting Night’s Nine Dark Bureau. The Water and Earth Bureaus are notified to seize and record the sinful souls, delivering them to the Execution Department for servitude. If the merits, demerits, and qi of the examined are not yet balanced, the matter is referred to the Three Assemblies for further review and rectification.\n\nThe Second-Rank Middle Primordial Earthly Officials, formed from the Primordial Cavernous Mixed Spirit Qi and the essence of the Ultimate Yellow, establish the Middle Primordial Three Palaces. The first palace is named the Cavernous Void Pure Spirit Palace, governed by the Primordial Cavernous Mixed Spirit Qi. It oversees the Five Emperors, the Five Marchmounts, all Perfected, and the deities and immortals of the earth who have attained the Dao. This palace comprises fifty billion, five myriad, fifty-five hundred million, fifty-five myriad layers of Mixed Spirit Qi, and its divine immortals, deities, and officials number ninety-nine million, nine hundred ninety-nine myriad. These are the souls of the deceased who possessed merits and have been delivered to assume duties in the Earthly Bureau, each with a set term. Upon fulfilling their merits, they may ascend to the ranks of Heavenly Immortals or be reborn among humans, with vacancies promptly filled to maintain their duties.\n\nThe Cavernous Void Pure Spirit Palace is also named the Luminous Dawn Martial City Palace and comprises three bureaus: Left, Right, and Central. The Left Bureau is named the Enduring Transgression Luminous Dawn Bureau and governs life, examined by the Palace of Great Yang Fire.",
      "overlap_context": " Bureau’s trials by Wind Blade. Each department comprises one hundred twenty examining officials, one thousand two hundred examining scribes, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They oversee the life registers of the Upper Perfected who have attained the Dao in past kalpas, those yet to attain it in the present blessings, and all men and women among the common folk, as well as those destined to attain immortality with jade tablets on the right.",
      "start_char": 1305,
      "end_char": 2562,
      "start_sentence": 66,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.2464394569397,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右府号纣绝阴天府，主死，太阴水官考。 中府号七非恬照府，主生死罪录风刀之考。 三府各领官僚五千万人，总统生死罪福一十四曹官： 太玄中元灵都曹。 太玄中元维正曹。 太玄中元灵威曹。 太玄中元黄神曹。 太玄中元洞玄曹。 太玄中元威仰曹。 太玄中元灵纽曹。 太玄中元岳正曹。 太玄中元洞天曹。 太玄中元九都曹。 太玄中元五集曹。 太玄中元通明曹。 太玄中元仪范曹。 太玄中元九考曹。 右一十四曹，太玄女青所置，属洞空清灵宫，主左府太阳火官、右府太阴水官、中府风刀之考。 一十四曹，曹置考官一百二十，考吏一千二百，考兵一万二千，考士一十二万。 主五岳神仙真人、已得道及未得道学士及百姓子男女人，所犯功过罪恶簿录。 大考三年，中考九年，小考二十四年。 大福三年，中福九年，小福二十四年。 罪福俱行，功过同报。 其簿录并封五岳洞室。 中元二品左宫名南洞阳宫，一号宗天宫，总主地上九土土皇四维八极诸灵官，及未得道学者百姓子男女人生命录籍。 其宫皆五亿五万五千五百五十五亿五万重混黄之气，其中土府地上官僚亦有九万九千九百九万众，皆是死者有功之魂受度而补其职局也。 南洞阳宫置左右中三府。 左府号谅事府，主生，太阳火官考。 右府号宗灵府，主死，太阴水官考。 中府号灵纽神府，主生死罪录风刀之考。 三府各领官僚五千万人，总统生死罪福一十四曹官： 太玄中元南昌曹。 太玄中元考算曹。 太玄中元招灵曹。 太玄中元太阳曹。 太玄中元明机曹。 ， 太玄中元都律曹。 太玄中元九令曹。 太玄中元明都曹。 太玄中元监天曹。 太玄中元宣野曹。 太玄中元监令曹。 太玄中元丘承曹。 太玄中元九气曹。 太玄中元中神曹。 右一十四曹，太玄女青所置，属南洞阳宫，主左府太阳火官、右府太阴水官、中府风刀之考。 一十四曹，曹置考官一百二十，考吏一千二百，考兵一万二千，考士一十二万。 主地上九土四维八极诸灵官，及未得道学者百姓子男女人，所犯功过罪恶簿录，罪福报应，亦如清灵宫年限。 其簿封於南丹洞室元阳之台石中。 中元二品右宫名北酆宫，一号阴天宫，总主地上诸灵官，已得道过去及未得道学者百姓子男女人罪簿死籍。 其宫皆五亿五万五千五百五十五亿五万重混黄之气，其中土府地上官僚亦有九万九千九百九十万众，亦是死者有功之魂受度而补其职局也。 北酆宫置左右中三府。 左府号连宛泉曲府，主生，太阳火官考。 右府号泰杀九幽府，主死，太阴水官考。 中府号罪气咸池府，主生死罪录风刀之考。 三府各领官僚五千万人，总统生死罪福一十四曹官： 太玄中元九杀曹。 太玄中元司非曹。 太玄中元韩司曹。 太玄中元报正曹。 太玄中元督杀曹。 太玄中元促考曹。 太玄中元摄气曹。 太玄中元司杀曹。 太玄中元斗加曹。 太玄中元主击曹。 太玄中元司微曹。 太玄中元九幽曹。 太玄中元开度曹。 太玄中元寒夜曹。 右一十四曹，太玄女青所置，属北酆宫，主左府太阳火官，右府太阴水官、中府风刀之考。 一十四曹，曹置考官一百二十，考吏一千二百，考兵一万二千，考士一十二万。 主地上九土四维八极诸学士百姓子男女人所犯罪恶死录黑簿，及应开度者罪福报应。",
      "translated_text": "The Right Bureau is named the Zhòu-Jué Yīn Heavenly Bureau and governs death, examined by the Palace of Great Yin Water. The Central Bureau is named the Seven Non-Tranquil Radiance Bureau and oversees the records of life, death, and transgressions, as well as the trials of the Wind Blade.\n\nEach of the three bureaus commands fifty million officials, collectively administering the fourteen departments of life, death, transgressions, and blessings:\n\nThe Supreme Mystery Central Origin Numinous Capital Department.\nThe Supreme Mystery Central Origin Upholding Rectitude Department.\nThe Supreme Mystery Central Origin Numinous Might Department.\nThe Supreme Mystery Central Origin Yellow Spirit Department.\nThe Supreme Mystery Central Origin Cavernous Mystery Department.\nThe Supreme Mystery Central Origin Might and Reverence Department.\nThe Supreme Mystery Central Origin Numinous Tie Department.\nThe Supreme Mystery Central Origin Mountain Rectitude Department.\nThe Supreme Mystery Central Origin Cavernous Heaven Department.\nThe Supreme Mystery Central Origin Nine Capitals Department.\nThe Supreme Mystery Central Origin Five Assemblies Department.\nThe Supreme Mystery Central Origin Pervasive Radiance Department.\nThe Supreme Mystery Central Origin Ceremonial Model Department.\nThe Supreme Mystery Central Origin Nine Examinations Department.\n\nThese fourteen departments were established by the Supreme Mystery Lady of Azure and belong to the Cavernous Void Pure Spirit Palace, overseeing the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials.\n\nEach of the fourteen departments is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the registers of merits, transgressions, and offenses for the perfected immortals of the Five Marchmounts, those who have attained the Dao, those who study but have yet to attain it, and all men and women among the common people.\n\nMajor examinations occur every three years, intermediate examinations every nine years, and minor examinations every twenty-four years. Major blessings are conferred every three years, intermediate blessings every nine years, and minor blessings every twenty-four years. Transgressions and blessings are both enacted, merits and offenses equally recompensed. Their registers are sealed within the cavern chambers of the Five Marchmounts.\n\nThe second rank of the Central Origin’s Left Palace is named the Southern Cavern Yang Palace, also called the Ancestral Heaven Palace, and governs all the spirit officials of the nine lands, four directions, eight extremities, and the registers of life for those who study but have yet to attain the Dao, as well as all men and women among the common people. Its palace is enveloped in fifty billion, five myriad, fifty-five hundred million, fifty-five myriad layers of Mixed Yellow Qi, and its earthly officials number ninety-nine million, nine hundred ninety-nine myriad—all souls of the deceased who possessed merits and have been delivered to assume their duties.\n\nThe Southern Cavern Yang Palace comprises three bureaus: Left, Right, and Central. The Left Bureau is named the Forgiving Affairs Bureau and governs life, examined by the Great Yang Fire Officials. The Right Bureau is named the Ancestral Spirit Bureau and governs death, examined by the Great Yin Water Officials. The Central Bureau is named the Numinous Tie Spirit Bureau and oversees the records of life, death, and transgressions, as well as the trials of the Wind Blade.\n\nEach of the three bureaus commands fifty million officials, collectively administering the fourteen departments of life, death, transgressions, and blessings:\n\nThe Supreme Mystery Central Origin Southern Prosperity Department.\nThe Supreme Mystery Central Origin Examination and Calculation Department.\nThe Supreme Mystery Central Origin Summoning Spirits Department.\nThe Supreme Mystery Central Origin Great Yang Department.\nThe Supreme Mystery Central Origin Illuminating Mechanism Department.\nThe Supreme Mystery Central Origin Capital Statutes Department.\nThe Supreme Mystery Central Origin Nine Commands Department.\nThe Supreme Mystery Central Origin Illuminating Capital Department.\nThe Supreme Mystery Central Origin Heavenly Supervision Department.\nThe Supreme Mystery Central Origin Proclaiming the Wilds Department.\nThe Supreme Mystery Central Origin Supervisory Command Department.\nThe Supreme Mystery Central Origin Mound and Succession Department.\nThe Supreme Mystery Central Origin Nine Qi Department.\nThe Supreme Mystery Central Origin Central Spirit Department.\n\nThese fourteen departments were established by the Supreme Mystery Lady of Azure and belong to the Southern Cavern Yang Palace, overseeing the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials.\n\nEach of the fourteen departments is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the registers of merits, transgressions, and offenses for the spirit officials of the nine lands, four directions, eight extremities, those who study but have yet to attain the Dao, and all men and women among the common people. The cycles of transgression, blessing, and retribution follow the same timeframes as those of the Pure Spirit Palace. Their registers are sealed within the Stone Casket of the Primordial Yang Terrace of the Southern Cinnabar Cavern.\n\nThe second rank of the Central Origin’s Right Palace is named the Northern Feng Palace, also called the Yin Heaven Palace, and governs all spirit officials of the earth, the registers of transgressions and deaths for those who have attained the Dao in past lives, those who study but have yet to attain it, and all men and women among the common people. Its palace is enveloped in fifty billion, five myriad, fifty-five hundred million, fifty-five myriad layers of Mixed Yellow Qi, and its earthly officials number ninety-nine million, nine hundred ninety-nine myriad—all souls of the deceased who possessed merits and have been delivered to assume their duties.\n\nThe Northern Feng Palace comprises three bureaus: Left, Right, and Central. The Left Bureau is named the Linked Winding Springs Bureau and governs life, examined by the Great Yang Fire Officials. The Right Bureau is named the Supreme Execution Nine Darks Bureau and governs death, examined by the Great Yin Water Officials. The Central Bureau is named the Transgression Qi Salty Pond Bureau and oversees the records of life, death, and transgressions, as well as the trials of the Wind Blade.\n\nEach of the three bureaus commands fifty million officials, collectively administering the fourteen departments of life, death, transgressions, and blessings:\n\nThe Supreme Mystery Central Origin Nine Executions Department.\nThe Supreme Mystery Central Origin Transgression Oversight Department.\nThe Supreme Mystery Central Origin Han Supervision Department.\nThe Supreme Mystery Central Origin Retribution Rectification Department.\nThe Supreme Mystery Central Origin Supervising Execution Department.\nThe Supreme Mystery Central Origin Hastening Examination Department.\nThe Supreme Mystery Central Origin Qi Seizure Department.\nThe Supreme Mystery Central Origin Execution Oversight Department.\nThe Supreme Mystery Central Origin Dipper Addition Department.\nThe Supreme Mystery Central Origin Striking Authority Department.\nThe Supreme Mystery Central Origin Subtlety Oversight Department.\nThe Supreme Mystery Central Origin Nine Darks Department.\nThe Supreme Mystery Central Origin Liberation Department.\nThe Supreme Mystery Central Origin Cold Night Department.\n\nThese fourteen departments were established by the Supreme Mystery Lady of Azure and belong to the Northern Feng Palace, overseeing the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials.\n\nEach of the fourteen departments is staffed with one hundred twenty examining officials, one hundred twenty examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the black registers of transgressions and deaths for the nine lands, four directions, eight extremities, scholars who have yet to attain the Dao, and all men and women among the common people, as well as the records of blessings and retributions for those eligible for liberation.",
      "overlap_context": "ume duties in the Earthly Bureau, each with a set term. Upon fulfilling their merits, they may ascend to the ranks of Heavenly Immortals or be reborn among humans, with vacancies promptly filled to maintain their duties.\n\nThe Cavernous Void Pure Spirit Palace is also named the Luminous Dawn Martial City Palace and comprises three bureaus: Left, Right, and Central. The Left Bureau is named the Enduring Transgression Luminous Dawn Bureau and governs life, examined by the Palace of Great Yang Fire.",
      "start_char": 2562,
      "end_char": 3914,
      "start_sentence": 114,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.498438119888306,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "考召年限，亦如清灵宫中之格。 其簿目封於玄阴北壁库中。 中元二品地官三宫左右中三府，府统一十四曹，合四十二曹，并治山洞空玄之中，皆自然之号，普统地上五岳四维八极神仙真人神灵，已得道过去及未得道见在福中，及百姓子男女人灭度生死功过罪福簿籍之事。 诸天大圣、十方诸大尊神、妙行真人、南斗北斗、诸天日月星宿、璇玑玉衡、无鞅数众，一切尊神，常以八节之日，下诣清灵洞阳北酆三宫，集校诸地上生死功过罪福簿录。 是其日诸地上五帝、五岳神仙真人、土府四司土帝，及八极诸灵官地只、三界官属、一切神灵，莫不森然齐到。 三宫九府，四十二曹考召官属，各主生死青黑二簿，随功过罪福生死灭度，考算年月轻重。 事事分别青黑二簿，列言三宫。 三宫以正月十五日、七月十五日、十月十五日，率言上天。 三宫功过生死簿定，应生者言左宫，应仙者言中宫，应死者言右官。 上下相应，功过生死年月日数，毫分无失。 若有考气未正，皆申三会，须考正又言也。 下元三品水官，洞元风泽之气，晨浩之精，置下元三宫。 其第一宫号旸谷洞源宫，一曰青华方诸宫，则洞元风泽之气，总主水帝旸谷神王，九江水府河伯、神仙诸真人、水中诸大神，已得道过去未得道、及百姓子男女人仙簿录籍。 其宫皆五亿五万五千五百五十五亿五万重风泽之气，其中神仙水神官僚亦有九万九千九百九十万众。 亦是死者有功之魂，受度得补水官之任。 亦各有年限，功满便得进升天仙官号，或还生人中。 如此轮转，皆得上仙也。 其随缺随补，以充其职。 旸谷宫一号青华方诸宫，左右中三府。 左府号清元灵渊府，主生，太阳火官考。 右府号九水寒夜府，主死，太阴水官考。 中府号朔单青灵府，主生死罪简风刀之考。 三府各领官僚五千万人，总统生死罪福一十四曹官： 太玄下元水明曹。 太玄下元元清曹。 太玄下元烈火曹。 太玄下元三明曹。 太玄下元简对曹。 太玄下元水令曹。 太玄下元明范曹。 太玄下元洞源曹。 太玄下元检会曹。 太玄下元劫谅曹。 太玄下元促水曹。 太玄下元洞阳曹。 太玄下元龙厩曹。 太玄下元机会曹。 右一十四曹，太玄女青所置，属旸谷洞源宫，主左府太阳火官考、右府太阴水官考、中府风刀之考。 一十四曹，曹置考官一百二十，考吏一千二百，考兵一万二千，考士一十二万。 主九江三河四海水府诸神灵，及百姓子男女人功过简录。 大考三年，中考九年，小考二十四年。 大福三年，中福九年，小福二十四年。 罪福俱行，功过同报，其簿录并封九河洞室。 下元三品左宫名清泠宫，一名南水会宫，总主水中万精，蛟龙鲸鱼，水灾大会，水母龙门度数之期，及百姓子男女人籍录，生死功过简对轻重之事。 其宫皆五亿五万五千五百五十五亿五万重风泽金刚之气，其中神仙水神官僚亦有九万九千九百九十万众，亦是死者有功之魂，受度而得补於水官也。 清泠宫一号南水会宫，置左右中三府。 左府号龄劫府，主生，太阳火官考。 右府号长夜寒庭府，主死，太阴水官考。 中府号灵宝劫刃府，主生死罪简风刀之考。 三府各领官僚五千万人，总统生死罪福，及劫会水中万精灵事。 一十四曹官： 太玄下元明劫曹。",
      "translated_text": "The examination and summons cycles follow the same regulations as those of the Clear Numen Palace. Their ledgers and records are sealed within the Vault of Mysterious Yin at the Northern Wall. The Middle Primordial’s Second-Rank Earth Officials oversee the three palaces of the Left, Right, and Central Bureaus, each governing fourteen departments, totaling forty-two departments. These operate within the cavernous voids of mountains and grottos, all bearing natural designations, and universally govern the immortals, perfected beings, and numinous spirits of the Five Marchmounts, Four Directions, and Eight Extremities on earth, as well as those who have already attained the Dao in past ages, those presently in fortune who have yet to attain it, and all common men and women. They manage the ledgers of life and death, merits and transgressions, blessings and retributions, and the records of those who have perished or transcended.\n\nAll the Great Saints of the heavens, the myriad exalted deities of the ten directions, the perfected of wondrous conduct, the Southern and Northern Dippers, the celestial bodies of sun, moon, and stars, the Jade Armillary and Jade Balance, and the countless hosts of all revered deities customarily descend on the eight seasonal nodes to the Clear Numen Grotto-Yang and the Northern Feng’s three palaces to assemble and review the ledgers of life and death, merits and transgressions, blessings and retributions for all upon the earth. On such days, the Five Emperors of the earth, the immortals and perfected of the Five Marchmounts, the Earthly Bureau’s Four Offices and Earthly Emperors, the numinous officials of the Eight Extremities, the officials of the Three Realms, and all spirits invariably arrive in solemn array.\n\nThe three palaces and nine bureaus, along with the forty-two departments’ examination and summons officials, each oversee the Green and Black Ledgers of life and death. According to merits and transgressions, blessings and retributions, life and death, and transcendence, they calculate the weight of years and months. Every matter is distinguished in the Green and Black Ledgers and reported to the Three Palaces. On the fifteenth day of the first, seventh, and tenth months, the Three Palaces submit their reports to heaven. Once the ledgers of merits, transgressions, life, and death are finalized, those destined for life are reported to the Left Palace, those destined for immortality to the Central Palace, and those destined for death to the Right Palace. Upper and lower correspond precisely, with no discrepancy in the years, months, days, or even the finest details of merits, transgressions, life, and death. If any examination of *qi* remains unresolved, it is referred to the Three Assemblies for further review and correction before resubmission.\n\nThe Lower Primordial’s Third-Rank Water Officials, embodying the *qi* of cavernous primordial wind and marsh and the essence of vast dawn, establish the Lower Primordial’s Three Palaces. The first palace is named the Palace of the Dawn Valley Grotto-Source, also called the Azure Florescence Square-Cinnabar Palace. It governs the *qi* of cavernous primordial wind and marsh and is presided over by the Water Emperor, the Divine King of Dawn Valley, the River Earls of the Nine Waters, the water bureaus, the immortals and perfected, and all great deities of the waters. It maintains the ledgers of those who have already attained the Dao in past ages, those who have yet to attain it, and all common men and women. The palace is enveloped in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers of wind-and-marsh *qi*, and its immortals, water deities, and officials number ninety-nine myriad, nine thousand nine hundred ninety myriad. These are the souls of the deceased who possessed merit, having received deliverance to fill the ranks of water officials. Each serves for a set term, and upon fulfilling their merit, they may ascend to the ranks of celestial immortals or be reborn among humanity. Through such cycles, all may attain the status of higher immortals. Vacancies are filled as they arise to maintain their duties.\n\nThe Palace of Dawn Valley, also called the Azure Florescence Square-Cinnabar Palace, comprises the Left, Right, and Central Bureaus. The Left Bureau is named the Clear Primordial Numinous Abyss Bureau, overseeing life and the examinations of the Great Yang Fire Officials. The Right Bureau is named the Nine Waters Cold Night Bureau, overseeing death and the examinations of the Great Yin Water Officials. The Central Bureau is named the Northern Solstice Azure Numen Bureau, overseeing the trials of life, death, transgressions, and the Wind Blade. Each bureau commands fifty million officials, collectively governing the fourteen departments of life, death, transgressions, and blessings:\n\nThe Lower Primordial’s Luminous Water Department.\nThe Lower Primordial’s Primordial Clarity Department.\nThe Lower Primordial’s Fierce Fire Department.\nThe Lower Primordial’s Three Luminaries Department.\nThe Lower Primordial’s Trial Review Department.\nThe Lower Primordial’s Water Command Department.\nThe Lower Primordial’s Luminous Model Department.\nThe Lower Primordial’s Grotto-Source Department.\nThe Lower Primordial’s Inspection and Assembly Department.\nThe Lower Primordial’s Karma and Forgiveness Department.\nThe Lower Primordial’s Swift Water Department.\nThe Lower Primordial’s Cavernous Yang Department.\nThe Lower Primordial’s Dragon Stable Department.\nThe Lower Primordial’s Mechanism and Assembly Department.\n\nThese fourteen departments were established by the Supreme Mystery Lady of Azure and belong to the Palace of Dawn Valley Grotto-Source, overseeing the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials. Each of the fourteen departments is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the records of merits and transgressions for the deities and spirits of the Nine Rivers, Three Rivers, and Four Seas, as well as all common men and women.\n\nMajor examinations occur every three years, intermediate examinations every nine years, and minor examinations every twenty-four years. Major blessings are bestowed every three years, intermediate blessings every nine years, and minor blessings every twenty-four years. Transgressions and blessings are both enacted, merits and transgressions equally recompensed. Their ledgers are sealed within the grotto-chambers of the Nine Rivers.\n\nThe Lower Primordial’s Third-Rank Left Palace is named the Clear Cold Palace, also called the Southern Water Assembly Palace. It universally governs the myriad essences of the waters, the dragons and whales, the great assemblies of water disasters, the water mothers, the Dragon Gate’s cycles of deliverance, and the ledgers of all common men and women, managing the trials of life and death, merits and transgressions, and the weight of their severity. The palace is enveloped in fifty-five myriad, five thousand five hundred fifty-five myriad, five myriad layers of wind-and-marsh adamantine *qi*, and its immortals, water deities, and officials likewise number ninety-nine myriad, nine thousand nine hundred ninety myriad. These, too, are the souls of the deceased who possessed merit, having received deliverance to fill the ranks of water officials.\n\nThe Clear Cold Palace, also called the Southern Water Assembly Palace, comprises the Left, Right, and Central Bureaus. The Left Bureau is named the Age-Karma Bureau, overseeing life and the examinations of the Great Yang Fire Officials. The Right Bureau is named the Long Night Cold Court Bureau, overseeing death and the examinations of the Great Yin Water Officials. The Central Bureau is named the Numinous Treasure Karma Blade Bureau, overseeing the trials of life, death, transgressions, and the Wind Blade. Each bureau commands fifty million officials, collectively governing the matters of life, death, transgressions, blessings, and the karmic assemblies of the myriad essences in the waters. The fourteen departments include:\n\nThe Lower Primordial’s Luminous Karma Department.",
      "overlap_context": "the fourteen departments is staffed with one hundred twenty examining officials, one hundred twenty examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining scholars. They maintain the black registers of transgressions and deaths for the nine lands, four directions, eight extremities, scholars who have yet to attain the Dao, and all men and women among the common people, as well as the records of blessings and retributions for those eligible for liberation.",
      "start_char": 3914,
      "end_char": 5184,
      "start_sentence": 188,
      "end_sentence": 239,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.077863454818726,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "太玄下元机龄曹。 太玄下元水梵曹。 太玄下元罪福曹。 太玄下元简会曹。 太玄下元促气曹。 太玄下元摄灵曹。 太玄下元召龙曹。 太玄下元九河曹。 太玄下元烈女曹。 太玄下元开明曹。 太玄下元度魂曹。 太玄下元检精曹。 太玄下元清正曹。 右一十四曹，太玄女青所置，属清冷宫，主左府太阳火官、右府太阴水官、中府风刀之考，生死罪福劫会水中万精灵事。 一十四曹，曹置考官一百二十，考史一千二百，考兵一万二千，考士一十二万。 主九江四海三河淮济水府诸神灵大小劫会，百姓子男女人功过简录，罪福报应，年限如旸谷宫格。 其简录封於阳泉洞室。 下元三品右宫名北酆都宫，一名罗酆宫，总主水中积夜死鬼谪役年劫，及百鬼万灵事，百姓子男女人应死简录黑簿。 其宫皆五亿五万五千五百五十五亿五万重风泽梵行之气，其中神仙水神官僚有九万九千九百九十九万众，亦是死者有功之魂，受度得补其官僚也。 北酆都宫一号罗酆宫，置左右中三府。 左府号开度劫量府，主生籍，太阳火官考。 右府号泉曲鬼神府，主死籍，太阴水官考。 中府号通灵大劫府，主生死罪简，风刀之考鬼神事。 三府各领官僚五千万人，总统生死罪福及鬼神事。 一十四曹官： 太玄下元北元曹。 太玄下元考正曹。 太玄下元九科曹。 太玄下元四极曹。 太玄下元幽夜曹。 太玄下元长劫曹。 太玄下元苦神曹。 太玄下元三难曹。 太玄下元五法曹。 太玄下元万掠曹。 太玄下元毒刃曹。 太玄下元长夜曹。 太玄下元溟波曹。 太玄下元无极曹。 右一十四曹，太玄女青所置，属北都罗酆官，主左府太阳火宫、右府太阴水官、中府风刀之考，鬼神谪役事。 一十四曹，曹置考官一百二十，考吏一千二百，考兵一万二千，考士一十二万。 主诸水长源、三河九江四渎，溟波长夜死魂鬼神之事，及百姓功过罪福简录，报应年限，亦如旸谷宫格。 其简录封於九源洞室。 下元三品水官三宫左右中三府，府统一十四曹，合四十二曹，并治九江洞室，皆自然之号，并统三河四海九江水府、淮济四渎水帝神王、河伯诸大圣，水中一切神灵，已得道过去及未得道者、百姓子男女人功过罪福简籍之事，及死者长徒作役，水府万灵鱼龙鲸鲵精物大小劫会之期。 诸天大圣、妙行真人、日月星宿、璇玑玉衡，及地上五岳神仙真人玉女、三官僚属，一切尊神，常以太岁、甲子、庚申之日，下诣旸谷清泠北酆都，三宫，集校九江四海三河淮济生死简录，死魂长夜谪役年限，水府神灵大小劫会之事。 是其日，诸水府一切神灵，莫不森然齐到，三宫九府四十二曹考召官属，各操生死青黑二簿，死魂谪役长源年限，大小劫会水中万灵之事，分别青黑二簿，列言三宫。 以正月十五日、七月十五日、十月十五日，率言上天三宫功过罪福生死简簿。 应生者言左宫，应仙者言中宫，应死者言右宫。 谪役长徒，大小劫会水中万灵之事，随所由列言，上下相应。 若有考气未正者，皆申三会，须考正又言之。 上元天官置三宫三府三十六曹，中元地官置三宫三府四十二曹，下元水官置三官三府四十二曹，天地水三官九宫九府一百二十曹。 三品相承，生死罪福，功过深重，责役考对，年月日限，无有差错。",
      "translated_text": "The Lower Primordial’s Mechanism-Age Department.\nThe Lower Primordial’s Water-Purity Department.\nThe Lower Primordial’s Transgression-Blessing Department.\nThe Lower Primordial’s Trial-Assembly Department.\nThe Lower Primordial’s Urgent Qi Department.\nThe Lower Primordial’s Spirit-Seizing Department.\nThe Lower Primordial’s Dragon-Summoning Department.\nThe Lower Primordial’s Nine Rivers Department.\nThe Lower Primordial’s Chaste Women Department.\nThe Lower Primordial’s Illumination Department.\nThe Lower Primordial’s Soul-Deliverance Department.\nThe Lower Primordial’s Essence-Examination Department.\nThe Lower Primordial’s Purity-Righteousness Department.\n\nThese fourteen departments, established by the Great Mystery’s Lady Qing, belong to the Clear Cold Palace. They oversee the examinations of the Left Bureau’s Great Yang Fire Officials, the Right Bureau’s Great Yin Water Officials, and the Central Bureau’s Wind Blade trials, as well as the matters of life, death, transgressions, blessings, and the karmic assemblies of the myriad essences in the waters. Each department is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining officers. They govern the great and small karmic assemblies of the gods and spirits of the Nine Rivers, the Four Seas, the Three Rivers, the Huai, and the Ji water palaces; record the merits and transgressions of the people, men and women; and determine the retributions of transgressions and blessings, with time limits as set by the Yang Valley Palace. These records are sealed in the Yang Spring Grotto Chamber.\n\nThe Lower Primordial’s third-rank Right Palace is named the Northern Fengdu Palace, also called the Luo Feng Palace. It primarily governs the long-night dead ghosts, those sentenced to penal servitude for karmic terms, and the affairs of the myriad ghosts and spirits in the waters, as well as the black registers of those among the people, men and women, who are fated to die. This palace is composed of the qi of five hundred five million fifty-five thousand five hundred fifty-five layers of wind, marsh, purity, and ascetic practice. Among its divine immortals, water gods, and officials, there are ninety-nine million nine hundred ninety-nine thousand nine hundred ninety-nine, all of whom are souls of the deceased who have earned merit and, having received deliverance, are appointed to these official positions.\n\nThe Northern Fengdu Palace, also called the Luo Feng Palace, comprises the Left, Right, and Central Bureaus. The Left Bureau is named the Karma-Measure Deliverance Bureau, overseeing the registers of life and the examinations of the Great Yang Fire Officials. The Right Bureau is named the Ghost-Spirit Spring Bend Bureau, overseeing the registers of death and the examinations of the Great Yin Water Officials. The Central Bureau is named the Numinous Passage Great Karma Bureau, overseeing the trials of life, death, transgressions, and the Wind Blade’s examinations of ghosts and spirits. Each bureau commands fifty million officials, collectively governing the matters of life, death, transgressions, blessings, and the affairs of ghosts and spirits.\n\nThe fourteen departments include:\nThe Lower Primordial’s Northern Primordial Department.\nThe Lower Primordial’s Examination-Righteousness Department.\nThe Lower Primordial’s Nine Disciplines Department.\nThe Lower Primordial’s Four Poles Department.\nThe Lower Primordial’s Dark Night Department.\nThe Lower Primordial’s Long Karma Department.\nThe Lower Primordial’s Suffering Spirits Department.\nThe Lower Primordial’s Three Tribulations Department.\nThe Lower Primordial’s Five Methods Department.\nThe Lower Primordial’s Myriad Torments Department.\nThe Lower Primordial’s Poison Blade Department.\nThe Lower Primordial’s Long Night Department.\nThe Lower Primordial’s Dark Waves Department.\nThe Lower Primordial’s Boundless Department.\n\nThese fourteen departments, established by the Great Mystery’s Lady Qing, belong to the Northern Luo Feng Palace. They oversee the examinations of the Left Bureau’s Great Yang Fire Palace, the Right Bureau’s Great Yin Water Palace, and the Central Bureau’s Wind Blade trials, as well as the penal servitude of ghosts and spirits. Each department is staffed with one hundred twenty examining officials, one thousand two hundred examining clerks, twelve thousand examining soldiers, and one hundred twenty thousand examining officers. They govern the affairs of the long sources of all waters, the Three Rivers, the Nine Rivers, the Four Streams, the dark waves, and the long-night dead souls and ghosts and spirits; record the merits, transgressions, transgressions, and blessings of the people; and determine the retributions and time limits, as set by the Yang Valley Palace. These records are sealed in the Nine Sources Grotto Chamber.\n\nThe Lower Primordial’s third-rank Water Officials’ three palaces—the Left, Right, and Central Bureaus—each govern fourteen departments, totaling forty-two departments. Together, they administer the Nine Rivers Grotto Chambers, all bearing natural designations. They collectively govern the water palaces of the Three Rivers, the Four Seas, the Nine Rivers, the Huai, and the Ji; the water emperors, divine kings, river lords, and all the great sages of the Four Streams; and all the spirits in the waters—both those who have attained the Dao in the past and those who have not, as well as the records of the merits, transgressions, transgressions, and blessings of the people, men and women. They also oversee the long-term penal servitude of the dead, the karmic assembly periods of the myriad spirits, fish, dragons, whales, and other beings in the water palaces.\n\nThe great sages of the various heavens, the perfected ones of wondrous conduct, the sun, moon, and stellar lodges, the jade pivots and armillary spheres, as well as the immortals, perfected ones, jade maidens, and officials of the Five Peaks on earth, along with all the honored spirits, regularly descend on the days of the Great Year, the jiazi, and the gengshen to the Yang Valley, the Clear Cold, and the Northern Fengdu Palaces. There, they gather to review the registers of life and death from the Nine Rivers, the Four Seas, the Three Rivers, the Huai, and the Ji; the penal servitude terms of the long-night dead souls; and the great and small karmic assemblies of the spirits in the water palaces.\n\nOn these days, all the spirits of the water palaces invariably arrive in solemn assembly. The examining officials of the three palaces, nine bureaus, and forty-two departments each hold the blue and black registers of life and death, the penal servitude terms of the long-source dead souls, and the affairs of the great and small karmic assemblies of the myriad spirits in the waters. They distinguish between the blue and black registers and report to the three palaces.\n\nOn the fifteenth day of the first month, the seventh month, and the tenth month, they present the registers of merits, transgressions, transgressions, blessings, life, and death to the three palaces of heaven. Those fated to live are reported to the Left Palace; those destined for immortality, to the Central Palace; and those doomed to die, to the Right Palace. The matters of penal servitude, long-term labor, and the great and small karmic assemblies of the myriad spirits in the waters are reported according to their origins, ensuring correspondence between upper and lower realms. If any qi remains unexamined or unrectified, it is submitted to the three assemblies for further examination and reporting.\n\nThe Upper Primordial’s Heavenly Officials establish three palaces, three bureaus, and thirty-six departments. The Middle Primordial’s Earthly Officials establish three palaces, three bureaus, and forty-two departments. The Lower Primordial’s Water Officials establish three palaces, three bureaus, and forty-two departments. Together, the Heavenly, Earthly, and Water Officials comprise nine palaces, nine bureaus, and one hundred twenty departments. The three ranks succeed one another, governing life, death, transgressions, blessings, and the depth of merits and transgressions, assigning penal servitude, conducting examinations, and setting time limits for days, months, and years without error.",
      "overlap_context": "urt Bureau, overseeing death and the examinations of the Great Yin Water Officials. The Central Bureau is named the Numinous Treasure Karma Blade Bureau, overseeing the trials of life, death, transgressions, and the Wind Blade. Each bureau commands fifty million officials, collectively governing the matters of life, death, transgressions, blessings, and the karmic assemblies of the myriad essences in the waters. The fourteen departments include:\n\nThe Lower Primordial’s Luminous Karma Department.",
      "start_char": 5185,
      "end_char": 6489,
      "start_sentence": 240,
      "end_sentence": 291,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.08784198760986,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "其学仙善功，行恶罪报，各随所属考官，悉书之焉。 天地水三官，各各别置宫府曹署，亦无限数，皆是支流别号，禁察司罚之官，纠诸功过罪恶之人，列言正曹。 一百二十曹，是天地水正曹也。 人身中亦有三宫六府百二十关节，三万六千神。 人身行恶，身神亦奏之三官。 人身行善，则度其仙名。 生死罪福，莫不先由身神，影响相应，在乎自然也。 人禀气而生，气结成神，人能养气，神则长在，内思守真，真不离身。 有得太玄延生之符，三万六千神则结气而见形，共举人身，白日登天，驰骋云驾，升入虚空。 丧精失气，万神奔落，神游气散，空尸形亡也。 天官一宫中府十二曹，地官一宫中府十四曹，水官一宫中府十四曹。 上真称号高下尊卑功过仪典。 上真众圣朝礼旋行功过仪典。 上真大圣游宴从驾功过仪典。 上真中圣游宴从驾功过仪典。 上真总校生死图录功过仪典。 上真总领生死命籍算录功过仪典。 上真总领生死功德轻重功过仪典。 上真总领鬼神功德报对轮转功过仪典。 上真总领鬼神幽责开度功过仪典。 上真总领升度死魂更生轻重功过仪典。 上真总领死魂受炼更生功过仪典。 上真总领神仙得道年月品秩功过仪典。 上真总领万魔谣歌之音功过仪典。 三元品戒罪目 学上道不信经戒怀疑两心之罪。 学上道轻慢圣文评论经典之罪。 学上道轻慢师主违背盟誓之罪。 学上道毁谤师父不崇天义之罪。 学上道窃取经书无有师宗之罪。 学上道学无师而授弟子之罪。 学上道傍取经书而传弟子之罪。 学上道得经书无师盟度之罪。 学上道受经不依经科年月传授之罪。 学上道受经传授非人之罪。 学上道受法师门无开度功之罪。 学上道无功而传授弟子之罪。 学上道传法宿奏不合师传之罪。 学上道传经不宿奏五帝之罪。 学上道受经无信贱道之罪。 学上道遏断贤路自取功名之罪。 学上道月朔八节不礼师尊之罪。 学上道不修斋直之罪。 学上道斋直不精之罪。 学上道诵经越略之罪。 学上道旋行越次争竞之罪。 学上道恚怒师父之罪。 学者及百姓子攻击善人之罪。 学者及百姓子恶口赤舌之罪。 学者及百姓子评论师主百姓之罪。 学者及百姓子饮酒失性之罪。 学者及百姓子杀生阴贼之罪。 学者及百姓子贪欲骄逸之罪。 学者及百姓子秽浊道法之罪。 学者及百姓子咒诅鬼神之罪。 学者及百姓子杀害众生之罪。 学者及百姓子绮语两舌不信之罪。 学者及百姓子奸淫秽浊之罪。 学者及百姓子盗窃财物之罪。 学者及百姓子嫉贤妬能之罪。 学者及百姓子背师恩爱之罪。 学者及百姓子欺师背道之罪。 学者及百姓子泄露天文之罪。 学者及百姓子毁谤经法之罪。 学者及百姓子修经中悔之罪。 学者及百姓子不忠於上之罪。 学者及百姓子罔略於下之罪。 学者及百姓子欺罔同学之罪。 学者及百姓子口善心恶之罪。 学者及百姓子说人过恶之罪。 学者及百姓子轻慢三光之罪。 学者及百姓子秽慢神鬼之罪。 右六十条罪，由天官一宫中府十二曹、地官一宫中府十四曹、水官一宫中府十四曹风刀考官主之。 天官左宫左府十二曹、地官左宫左府十四曹、水官左宫左府十四曹。 学者及百姓子嫉妬同学之罪。 学者及百姓子浮华妄语之罪。 学者及百姓子贪利入己无厌之罪。",
      "translated_text": "The merits of those who cultivate immortality and the retributions for their evil deeds are each recorded by their respective examining officials according to their jurisdiction. The Heavenly, Earthly, and Water Officials each establish separate palaces, bureaus, and offices without limit in number—all branches and designations of the offices that prohibit, inspect, and punish, impeaching those with merits, transgressions, or sins, and reporting them to the proper bureaus. The one hundred twenty bureaus are the principal bureaus of the Heavenly, Earthly, and Water Officials.\n\nWithin the human body, there are likewise three palaces, six viscera, one hundred twenty joints, and thirty-six thousand spirits. When the body commits evil, the body’s spirits also report it to the Three Officials. When the body performs good deeds, its name is recorded for transcendence. Life and death, sin and blessing—none fail to originate first with the body’s spirits, which respond in resonance according to nature.\n\nHumans are born by receiving qi, and qi coalesces into spirit. If one can nurture qi, the spirit will abide long; if one inwardly contemplates and guards the true, the true will not depart from the body. Those who obtain the talisman of the Great Mystery for extending life will see the thirty-six thousand spirits coalesce qi and manifest form, jointly elevating the body to ascend to heaven in broad daylight, riding cloud chariots into the void. If essence is lost and qi dissipated, the myriad spirits scatter and flee; the spirit wanders, qi disperses, and the empty corpse perishes.\n\nIn the Heavenly Official’s one palace and central bureau, there are twelve bureaus; in the Earthly Official’s one palace and central bureau, fourteen bureaus; in the Water Official’s one palace and central bureau, fourteen bureaus.\n\nThe protocols for the ranks, titles, superiority and inferiority, merits and transgressions of the Upper Perfected:\nThe protocols for the Upper Perfected and the host of sages in audience and procession, merits and transgressions.\nThe protocols for the Upper Perfected and the Great Sages in excursion and retinue, merits and transgressions.\nThe protocols for the Upper Perfected and the Middle Sages in excursion and retinue, merits and transgressions.\nThe protocols for the Upper Perfected in overseeing the ledgers of life and death, merits and transgressions.\nThe protocols for the Upper Perfected in managing the registers of life, death, and destiny, merits and transgressions.\nThe protocols for the Upper Perfected in managing the weight of merits and transgressions in life and death, merits and transgressions.\nThe protocols for the Upper Perfected in managing the retribution and cyclical turning of the merits of ghosts and spirits, merits and transgressions.\nThe protocols for the Upper Perfected in managing the dark punishments and deliverance of ghosts and spirits, merits and transgressions.\nThe protocols for the Upper Perfected in managing the ascent and deliverance of the dead, the severity of rebirth, merits and transgressions.\nThe protocols for the Upper Perfected in managing the refinement and rebirth of the dead, merits and transgressions.\nThe protocols for the Upper Perfected in managing the ranks and dates of immortals’ attainment of the Dao, merits and transgressions.\nThe protocols for the Upper Perfected in managing the sounds of the myriad demons’ chants and songs, merits and transgressions.\n\n**Three Primordials’ Catalog of Precepts and Transgressions**\n\nThe transgression of those who study the supreme Dao but doubt the scriptures and precepts, harboring dual minds.\nThe transgression of those who study the supreme Dao but slight the sacred texts and criticize the scriptures.\nThe transgression of those who study the supreme Dao but slight their masters and violate their covenants.\nThe transgression of those who study the supreme Dao but slander their masters and fail to revere heavenly principles.\nThe transgression of those who study the supreme Dao but steal scriptures without a master’s lineage.\nThe transgression of those who study the supreme Dao but teach disciples without a master.\nThe transgression of those who study the supreme Dao but obtain scriptures from indirect sources and transmit them to disciples.\nThe transgression of those who study the supreme Dao but obtain scriptures without a master’s covenant and transmission.\nThe transgression of those who study the supreme Dao but, upon receiving scriptures, fail to transmit them according to the scriptural regulations for years and months.\nThe transgression of those who study the supreme Dao but transmit scriptures to unworthy recipients.\nThe transgression of those who study the supreme Dao but receive teachings from masters without the merit of deliverance.\nThe transgression of those who study the supreme Dao but transmit teachings to disciples without merit.\nThe transgression of those who study the supreme Dao but transmit teachings without prior reporting, contrary to their master’s transmission.\nThe transgression of those who study the supreme Dao but transmit scriptures without prior reporting to the Five Emperors.\nThe transgression of those who study the supreme Dao but receive scriptures without faith, disparaging the Dao.\nThe transgression of those who study the supreme Dao but obstruct the worthy and claim merit for themselves.\nThe transgression of those who study the supreme Dao but fail to pay respects to their masters on the first day of the month and the eight seasonal nodes.\nThe transgression of those who study the supreme Dao but do not perform purification fasts.\nThe transgression of those who study the supreme Dao but perform purification fasts without diligence.\nThe transgression of those who study the supreme Dao but recite scriptures with omissions or abbreviations.\nThe transgression of those who study the supreme Dao but, in processions, skip ranks or contend for precedence.\nThe transgression of those who study the supreme Dao but harbor resentment or anger toward their masters.\nThe transgression of students and commoners who attack the virtuous.\nThe transgression of students and commoners who engage in malicious speech and slander.\nThe transgression of students and commoners who criticize their masters or the populace.\nThe transgression of students and commoners who drink to the point of losing their nature.\nThe transgression of students and commoners who kill living beings and secretly harm others.\nThe transgression of students and commoners who indulge in greed and arrogance.\nThe transgression of students and commoners who defile the Dao and its precepts.\nThe transgression of students and commoners who curse ghosts and spirits.\nThe transgression of students and commoners who kill and harm sentient beings.\nThe transgression of students and commoners who engage in frivolous speech, sow discord, and lack faith.\nThe transgression of students and commoners who commit adultery and defilement.\nThe transgression of students and commoners who steal property.\nThe transgression of students and commoners who envy the worthy and resent the capable.\nThe transgression of students and commoners who betray their masters’ kindness.\nThe transgression of students and commoners who deceive their masters and turn against the Dao.\nThe transgression of students and commoners who reveal celestial patterns.\nThe transgression of students and commoners who slander scriptures and precepts.\nThe transgression of students and commoners who regret their cultivation of scriptures midway.\nThe transgression of students and commoners who are disloyal to their superiors.\nThe transgression of students and commoners who deceive their subordinates.\nThe transgression of students and commoners who deceive their fellow students.\nThe transgression of students and commoners who speak kindly but harbor evil in their hearts.\nThe transgression of students and commoners who speak of others’ faults and evils.\nThe transgression of students and commoners who slight the Three Luminaries.\nThe transgression of students and commoners who defile and disrespect spirits and ghosts.\n\nThese sixty transgressions are overseen by the wind-blade examining officials of the Heavenly Official’s one palace and central bureau’s twelve bureaus, the Earthly Official’s one palace and central bureau’s fourteen bureaus, and the Water Official’s one palace and central bureau’s fourteen bureaus.\n\nThe Heavenly Official’s left palace and left bureau’s twelve bureaus, the Earthly Official’s left palace and left bureau’s fourteen bureaus, and the Water Official’s left palace and left bureau’s fourteen bureaus oversee the following:\n\nThe transgression of students and commoners who envy and resent their fellow students.\nThe transgression of students and commoners who engage in frivolity and false speech.\nThe transgression of students and commoners who greedily take profit for themselves without satiety.",
      "overlap_context": "y-two departments. The Lower Primordial’s Water Officials establish three palaces, three bureaus, and forty-two departments. Together, the Heavenly, Earthly, and Water Officials comprise nine palaces, nine bureaus, and one hundred twenty departments. The three ranks succeed one another, governing life, death, transgressions, blessings, and the depth of merits and transgressions, assigning penal servitude, conducting examinations, and setting time limits for days, months, and years without error.",
      "start_char": 6489,
      "end_char": 7890,
      "start_sentence": 292,
      "end_sentence": 368,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.74585795402527,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "学者及百姓子积禄重宝不思散施之罪。 学者及百姓子乐人宝物入己之罪。 学者及百姓子愿人伤败流散之罪。 学者及百姓子私畜刀仗兵器之罪。 学者及百姓子屠割六畜杀生之罪。 学者及百姓子刺射野兽飞乌之罪。 学者及百姓子烧山捕猎之罪。 学者及百姓子张荃捕鱼之罪。 学者及百姓子金银器食之罪。 学者及百姓子贪乐荣禄虐政之罪。 学者及百姓子烧败见物成功之罪。 学者及百姓子以饮食投水中之罪。 学者及百姓子贪浊滋味肥荤之罪。 学者及百姓子贪食五辛之罪。 学者及百姓子草书伪意之罪。 学者及百姓子合聚草众之罪。 · 学者及百姓子图谋人妇女之罪。 学者及百姓子评论国事之罪。 学者及百姓子图谋人财物之罪。 学者及百姓子粗物易人好物之罪。 学者及百姓子交关权贵侯王之罪。 学者及百姓子妄说天时星宿之罪。 学者及百姓子火烧田野山林之罪。 学者及百姓子斫伐树木采摘华草之罪。 学者及百姓子与恶人交游亲近异类之罪。 学者及百姓子交关流俗华竞之罪。 学者及百姓子在人中独食不思饥馁之罪。 学者及百姓子与世间破人婚姻之罪。 学者及百姓子放荡世间妓乐之罪。 学者及百姓子面誉世人阴毁善人之罪。 学者及百姓子说人尊上过恶之罪。 学者及百姓子泄露人阴恶私鄙之罪。 学者及百姓子攻击善人横生无端之罪。 学者及百姓子窥人书疏察微之罪。 学者及百姓子与女人独行独语之罪。 学者及百姓子男女群居之罪。 学者及百姓子男女共食交错衣物之罪。 学者及百姓子男女教化不善之罪。 学者及百姓子自贵骄逸之罪。 学者及百姓子因公报冤之罪。 学者及百姓子离别家室之罪。 学者及百姓子落子伤胎之罪。 学者及百姓子疏宗族亲异姓之罪。 学者及百姓子毒药投水伤生之罪。 学者及百姓子匿爱弟子之罪。 学者及百姓子聚集人众之罪。 学者及百姓子投书谱人之罪。 学者及百姓子自恃用性之罪。 学者及百姓子妄作忌讳之罪。 学者及百姓子希人事物之罪。 学者及百姓子评论师友长短之罪。 学者及百姓子轻慢经教法言之罪。 学者及百姓子薄贱他人老病之罪。 学者及百姓子弃薄乞人之罪。 学者及百姓子乘威势以凌世人之罪。 学者及百姓子阿党所亲之罪。 学者及百姓子父母兄弟各别离居之罪。 右六十条罪，由天官左宫左府十二曹、地官左宫左府十四曹、水官左宫左府十四曹、太阳火官考吏主之。 天官右宫右府十二曹、地官右宫右府十四曹、水官右宫右府十四曹。 学者及百姓子嗔恚弟子之罪。 学者及百姓子恚责善人之罪。 学者及百姓子不放生度死之罪。 学者及百姓子富贵忘师之罪。 学者及百姓子诸天斋日不念道之罪。 学者及百姓子嗔恚师主之罪。 学者及百姓子论人过恶之罪。 学者及百姓子笑人须暗贫贱之罪。 学者及百姓子劝人为恶之罪。 学者及百姓子禁人作善之罪。 学者及百姓子快人过失之罪。 学者及百姓子去就背向非道之罪。 学者及百姓子五岳三河无简名之罪。 学者及百姓子秽污五岳三河之罪。 学者及百姓子夺人所好之罪。 学者及百姓子驰聘流俗求竞世间之罪。 学者及百姓子庆吊世间求悦众人之罪。 学者及百姓子认他人之功以为己德之罪。 学者及百姓子言人饮食好恶之罪。 学者及百姓子惊惧百姓衰厄之罪。",
      "translated_text": "The transgression of students and commoners who hoard emoluments and treasures without thought of dispersing or bestowing them.\nThe transgression of students and commoners who delight in others’ valuables entering their own possession.\nThe transgression of students and commoners who wish harm, ruin, and dispersal upon others.\nThe transgression of students and commoners who privately keep blades, weapons, and arms.\nThe transgression of students and commoners who slaughter the six livestock and take life.\nThe transgression of students and commoners who pierce and shoot wild beasts and flying birds.\nThe transgression of students and commoners who burn mountains to hunt.\nThe transgression of students and commoners who set traps to catch fish.\nThe transgression of students and commoners who use vessels of gold and silver for dining.\nThe transgression of students and commoners who greedily delight in glory and emoluments while enacting cruel governance.\nThe transgression of students and commoners who burn and ruin others’ completed works.\nThe transgression of students and commoners who cast food and drink into water.\nThe transgression of students and commoners who crave impure flavors and rich meats.\nThe transgression of students and commoners who greedily consume the five pungent vegetables.\nThe transgression of students and commoners who write in cursive script with deceptive intent.\nThe transgression of students and commoners who gather and assemble crowds of people.\nThe transgression of students and commoners who scheme to obtain others’ wives.\nThe transgression of students and commoners who criticize state affairs.\nThe transgression of students and commoners who scheme to obtain others’ possessions.\nThe transgression of students and commoners who exchange coarse goods for others’ fine goods.\nThe transgression of students and commoners who curry favor with powerful nobles and kings.\nThe transgression of students and commoners who recklessly speak of celestial timings and stellar lodges.\nThe transgression of students and commoners who set fire to fields, wilds, mountains, and forests.\nThe transgression of students and commoners who fell trees and pluck flowering grasses.\nThe transgression of students and commoners who associate with evil persons and befriend those of different kinds.\nThe transgression of students and commoners who engage with worldly customs and vie for worldly glory.\nThe transgression of students and commoners who eat alone among others without thought of the hungry and destitute.\nThe transgression of students and commoners who disrupt others’ marriages in the world.\nThe transgression of students and commoners who indulge in worldly music and entertainment.\nThe transgression of students and commoners who praise others to their face while secretly slandering the virtuous.\nThe transgression of students and commoners who speak of the faults and evils of their superiors.\nThe transgression of students and commoners who reveal others’ hidden evils and private vulgarities.\nThe transgression of students and commoners who attack the virtuous with groundless and reckless accusations.\nThe transgression of students and commoners who pry into others’ writings and scrutinize their subtleties.\nThe transgression of students and commoners who walk or speak alone with women.\nThe transgression of students and commoners who dwell in mixed-gender groups.\nThe transgression of students and commoners who share meals and exchange clothing with the opposite sex.\nThe transgression of students and commoners who provide improper instruction to men and women.\nThe transgression of students and commoners who hold themselves in high esteem and indulge in arrogance and ease.\nThe transgression of students and commoners who use public matters to avenge private grievances.\nThe transgression of students and commoners who abandon their families and households.\nThe transgression of students and commoners who cause miscarriage or harm to fetuses.\nThe transgression of students and commoners who distance their own clans while favoring those of different surnames.\nThe transgression of students and commoners who poison water to harm living beings.\nThe transgression of students and commoners who conceal and favor their own disciples.\nThe transgression of students and commoners who assemble crowds of people.\nThe transgression of students and commoners who send written accusations against others.\nThe transgression of students and commoners who rely on their own nature and act willfully.\nThe transgression of students and commoners who recklessly create taboos.\nThe transgression of students and commoners who covet others’ affairs and possessions.\nThe transgression of students and commoners who criticize the strengths and weaknesses of teachers and friends.\nThe transgression of students and commoners who belittle the scriptures, teachings, and spoken Dharma.\nThe transgression of students and commoners who disdain and slight the elderly and infirm.\nThe transgression of students and commoners who abandon and despise beggars.\nThe transgression of students and commoners who ride their power and authority to bully others in the world.\nThe transgression of students and commoners who form cliques with their favorites.\nThe transgression of students and commoners whose parents and siblings live separately.\nThese sixty transgressions are overseen by the wind-blade examining officials of the Heavenly Official’s left palace and left bureau’s twelve bureaus, the Earthly Official’s left palace and left bureau’s fourteen bureaus, the Water Official’s left palace and left bureau’s fourteen bureaus, and the Fire Official of the Great Yang.\n\nThe Heavenly Official’s right palace and right bureau’s twelve bureaus, the Earthly Official’s right palace and right bureau’s fourteen bureaus, and the Water Official’s right palace and right bureau’s fourteen bureaus oversee the following:\n\nThe transgression of students and commoners who harbor anger and resentment toward their disciples.\nThe transgression of students and commoners who angrily reproach the virtuous.\nThe transgression of students and commoners who do not release living beings or deliver the dying.\nThe transgression of students and commoners who, in wealth and honor, forget their teachers.\nThe transgression of students and commoners who, on the fasting days of the various heavens, do not contemplate the Dao.\nThe transgression of students and commoners who harbor anger and resentment toward their teachers and masters.\nThe transgression of students and commoners who discuss others’ faults and evils.\nThe transgression of students and commoners who mock others for their ignorance, poverty, and low status.\nThe transgression of students and commoners who encourage others to do evil.\nThe transgression of students and commoners who prevent others from doing good.\nThe transgression of students and commoners who delight in others’ faults and mistakes.\nThe transgression of students and commoners who turn their backs on proper alignment and follow what is not the Dao.\nThe transgression of students and commoners who lack pure reputations at the Five Peaks and Three Rivers.\nThe transgression of students and commoners who defile the Five Peaks and Three Rivers.\nThe transgression of students and commoners who seize what others cherish.\nThe transgression of students and commoners who gallop through worldly customs seeking to compete in the world.\nThe transgression of students and commoners who attend worldly celebrations and condolences to please the masses.\nThe transgression of students and commoners who claim others’ achievements as their own virtue.\nThe transgression of students and commoners who comment on others’ preferences and aversions in food and drink.\nThe transgression of students and commoners who frighten and alarm the people, bringing about their decline and misfortune.",
      "overlap_context": "ly Official’s left palace and left bureau’s twelve bureaus, the Earthly Official’s left palace and left bureau’s fourteen bureaus, and the Water Official’s left palace and left bureau’s fourteen bureaus oversee the following:\n\nThe transgression of students and commoners who envy and resent their fellow students.\nThe transgression of students and commoners who engage in frivolity and false speech.\nThe transgression of students and commoners who greedily take profit for themselves without satiety.",
      "start_char": 7891,
      "end_char": 9330,
      "start_sentence": 369,
      "end_sentence": 448,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.03060221672058,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "学者及百姓子惊惧鸟兽促着穷地之罪。 学者及百姓子惊怖老少之罪。 学者及百姓子轻凌官长有司之罪。 学者及百姓子论议世间曲直之罪。 学者及百姓子妄论国家盛衰之罪。 学者及百姓子施惠追吝之罪。 学者及百姓子游遨无度之罪。 学者及百姓子登高罔下之罪。 学者及百姓子牢笼飞鸟走兽之罪。 学者及百姓子快人丧祸之罪。 学者及百姓子以棘人行道之罪。 学者及百姓子拜礼神鬼之罪。 学者及百姓子裸露三光之罪。 学者及百姓子呵骂风雨之罪。 学者及百姓子换借不还之罪。 学者及百姓子罔人荣称之罪。 学者及百姓子傲慢三宝轻忽天尊之罪。 学者及百姓子谋人君长师父之罪。 学者及百姓子劝人不孝父母兄弟之罪。 学者及百姓子矫称自异号为真人之罪。 学者及百姓子信外道杂卫邪见之罪。 学者及百姓子无经师托学欺诈神人之罪。 学者及百姓子衣服赢余不散穷人之罪。 学者及百姓子窃写经戒慢露之罪。 学者及百姓子荣饰衣褐华丽之罪。 学者及百姓子身不洁净登上高座之罪。 学者及百姓子秽慢师门不恭之罪。 学者及百姓子师有哀忧不建斋祷之罪。 学者及百姓子弃忘师父逐世盛名之罪。 学者及百姓子师得豪贵希望丰荣之罪。 学者及百姓子师疾厄不侍省之罪。 学者及百姓子远厄急逐宽乐之罪。 学者及百姓子出入道户不关启之罪。 学者及百姓子妄与他人入道户交语之罪。 学者及百姓子斋请不为三官迁功之罪。 学者及百姓子自愁家门不念他厄之罪。 学者及百姓子家有丧疾怨道咎师之罪。 学者及百姓子得师经道而自称已得之罪。 学者及百姓子传师道法不折送盟信之罪。 学者及百姓子八节不言名五帝之罪。 右六十条罪，由天官右宫右府十二曹、地官右宫右府十四曹、水官右宫右府十四曹、太阴水官考吏主之。 三元品戒，部有六十条，合一百八十条戒，各有阴阳左右水火风刀官考典之。 正月十五日，上元校戒之日。 七月十五日，中元校戒之日。 十月十五日，下元校戒之日。 此一年三日，皆地上及五帝五岳灵山、三界神官，及诸水府三官司罚。 无穷无深、无远无近、无大无小一切神灵，皆同上诣上三天玄都三元宫中，皆赍诸天地上得道及未得道见在福中，及兆民生死缘对宿根簿录，功过轻重，列言上天。 是其日，无极天尊、十方大圣众、三十二天帝、飞天神王、高上玉虚至真大神、无极大道太上老君、诸君丈人、五老帝君、南极北极东西二华、九灵真母、南上元君、太和玉女，同时俱到三元宫中。 众圣既集，诸天飞仙神仙、真人玉女，长生司命司录司杀、南斗北斗，诸天日月星宿、璇玑玉衡，一切众神，莫不森然俱至。 三元左右中宫三官九府百二十曹、阴阳左右水火风刀考官，各算计天上天下生死簿录，更相校讯。 有善功者上名青簿，罪重者下名黑簿，各以一通，列言三官，功过善恶，毫分无失。 是其日，能依三元谢过之法，清斋烧香，依玄科言，行之百日，则地只右别，营卫门户。 行之八年，皆得三官保举，度名青簿之中，克得上仙，道不失其分也。 道君稽首敢问天尊：功德轻重，拔度阶级，高下次第，何者为先。 先世负重责，为止一身，为流及子孙。 己身行恶，为身自受报对，为上误先亡。 如今所见百姓子男女人，见世生身充受涂炭，百苦备婴，不能自解。",
      "translated_text": "The transgression of students and commoners who frighten birds and beasts into desolate lands.\nThe transgression of students and commoners who terrify the old and the young.\nThe transgression of students and commoners who disrespect and belittle officials and authorities.\nThe transgression of students and commoners who debate the rights and wrongs of the world.\nThe transgression of students and commoners who recklessly discuss the rise and fall of the state.\nThe transgression of students and commoners who bestow favors while harboring stinginess.\nThe transgression of students and commoners who wander without restraint.\nThe transgression of students and commoners who ascend heights without regard for descent.\nThe transgression of students and commoners who cage flying birds and running beasts.\nThe transgression of students and commoners who delight in others’ misfortunes and calamities.\nThe transgression of students and commoners who obstruct paths with thorns.\nThe transgression of students and commoners who bow and worship spirits and ghosts.\nThe transgression of students and commoners who expose themselves to the Three Luminaries.\nThe transgression of students and commoners who curse wind and rain.\nThe transgression of students and commoners who borrow and do not return.\nThe transgression of students and commoners who deceive others with false honors.\nThe transgression of students and commoners who are arrogant toward the Three Treasures and disdain the Heavenly Worthies.\nThe transgression of students and commoners who plot against rulers, elders, teachers, and parents.\nThe transgression of students and commoners who encourage others to be unfilial to parents and siblings.\nThe transgression of students and commoners who falsely claim unique titles as Perfected Ones.\nThe transgression of students and commoners who trust in heterodox teachings and deviant views.\nThe transgression of students and commoners who, without a scriptural master, falsely study and deceive gods and humans.\nThe transgression of students and commoners who hoard excess clothing and do not distribute it to the poor.\nThe transgression of students and commoners who secretly copy scriptures and precepts with carelessness and exposure.\nThe transgression of students and commoners who adorn their coarse garments with extravagant embellishments.\nThe transgression of students and commoners who, with unclean bodies, ascend high seats.\nThe transgression of students and commoners who disrespect and slight the master’s gate without reverence.\nThe transgression of students and commoners who, when their master is in sorrow or distress, do not establish fasts or prayers.\nThe transgression of students and commoners who abandon and forget their master while pursuing worldly fame.\nThe transgression of students and commoners who, when their master gains wealth and nobility, hope for prosperity and glory.\nThe transgression of students and commoners who, when their master is ill or in distress, do not attend or inquire.\nThe transgression of students and commoners who, when far from distress and urgency, pursue ease and pleasure.\nThe transgression of students and commoners who enter and exit the Dao’s gates without opening or closing them.\nThe transgression of students and commoners who recklessly converse with others within the Dao’s gates.\nThe transgression of students and commoners who, when hosting fasts and invitations, do not transfer merit to the Three Officials.\nThe transgression of students and commoners who grieve for their own families and do not consider others’ distress.\nThe transgression of students and commoners who, when their families suffer misfortune or illness, blame the Dao and fault their master.\nThe transgression of students and commoners who, having received their master’s scriptures and Dao, claim to have attained them themselves.\nThe transgression of students and commoners who transmit their master’s Dao and methods without offering pledges or tokens of faith.\n\nThese sixty transgressions are overseen by the twelve bureaus of the Heavenly Official’s Right Palace and Right Mansion, the fourteen bureaus of the Earthly Official’s Right Palace and Right Mansion, the fourteen bureaus of the Water Official’s Right Palace and Right Mansion, and the Examiners of the Great Yin Water Official.\n\nThe Three Primordials’ Precept Categories each contain sixty precepts, totaling one hundred eighty precepts, each governed by the yin and yang, left and right, water and fire, wind and blade officials’ examination registers.\n\nThe fifteenth day of the first month is the Upper Primordial’s Precept Examination Day.\nThe fifteenth day of the seventh month is the Middle Primordial’s Precept Examination Day.\nThe fifteenth day of the tenth month is the Lower Primordial’s Precept Examination Day.\n\nOn these three days of the year, the earthly and Five Emperors’ sacred mountains, the divine officials of the Three Realms, and all the water palaces’ Three Officials administer punishments. Without bound or depth, near or far, great or small, all divine spirits ascend together to the Upper Three Heavens’ Mysterious Capital Three Primordials’ Palace, bearing the records of those who have attained the Dao on heaven and earth, those who have not yet attained it but dwell in blessings, and the karmic roots and ledgers of the living and the dead, their merits and transgressions, their light and heavy deeds, all reported to Heaven.\n\nOn that day, the Boundless Heavenly Worthy, the Ten Directions’ Great Sage Assembly, the Thirty-Two Heavenly Emperors, the Flying Heavenly Divine Kings, the Supreme Jade Void Perfected Great Spirits, the Boundless Great Dao’s Most High Lord Lao, the Venerable Masters, the Five Elder Emperors, the Southern and Northern Poles and Eastern and Western Flowers, the Nine Numinous Perfected Mothers, the Southern Upper Primordial Lady, and the Jade Maiden of Supreme Harmony all arrive together at the Three Primordials’ Palace. Once the assembly of sages is gathered, the flying immortals, divine immortals, Perfected Ones, Jade Maidens, the Longevity Directors of Life and Death, the Southern and Northern Dippers, the celestial sun, moon, and stars, the Jade Armillary Sphere, and all divine beings arrive in solemn array.\n\nThe Three Primordials’ left, right, and central palaces’ Three Officials and nine mansions’ one hundred twenty bureaus, the yin and yang, left and right, water and fire, wind and blade examination officials, each calculate the ledgers of life and death in heaven and on earth, cross-examining one another. Those with good deeds are recorded in the Azure Register; those with heavy transgressions are inscribed in the Black Register. Each is reported to the Three Officials with their merits and transgressions, good and evil, without the slightest error.\n\nOn that day, those who follow the Three Primordials’ method of repentance, purify themselves with fasting, burn incense, and act in accordance with the Mysterious Regulations for one hundred days will have their earthly dwellings specially guarded, their gates and defenses secured. After eight years of practice, they will all receive the Three Officials’ protection and recommendation, their names inscribed in the Azure Register, and they will attain the rank of Upper Immortal, never losing their destined place in the Dao.\n\nThe Dao Lord bows his head and respectfully asks the Heavenly Worthy: What determines the weight of merits, the stages of deliverance, and the order of precedence? Past-life heavy debts are repaid by oneself and may extend to one’s descendants. The evil one commits in this life brings retribution upon oneself and may also mislead the deceased. Now, as we see among the common people—men and women—those who suffer in this life, enduring all manner of hardships and a hundred afflictions, unable to free themselves.",
      "overlap_context": "rough worldly customs seeking to compete in the world.\nThe transgression of students and commoners who attend worldly celebrations and condolences to please the masses.\nThe transgression of students and commoners who claim others’ achievements as their own virtue.\nThe transgression of students and commoners who comment on others’ preferences and aversions in food and drink.\nThe transgression of students and commoners who frighten and alarm the people, bringing about their decline and misfortune.",
      "start_char": 9331,
      "end_char": 10685,
      "start_sentence": 449,
      "end_sentence": 505,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.393245697021484,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "又见死者形魂忧恼，流曳三途五苦之中，长河寒庭，风刀万劫不得解脱。 经传或云先身行恶，殃流子孙。 或云己身罪重，上误先亡。 或云善恶各有缘对，生死罪福各有命根。 如此报应善恶缘对，则各归一身，不应复有延误之言。 又云自非功德拔度，先世谪魂则无由解脱。 功德既建，则生死开泰。 若各有缘对，行恶之者，死则长沦万劫，长挚幽夜，何缘复得建此大功，以自拔赎。 若子孙建功，上为亡者，则与延误，理无复异。 愚情浅狭，所未能了。 天尊既开大宥之化，生死皆明，宜#1使幽显尽然有判，不令愚暗惑於二论。 既蒙饰擢，位任总司，当宣正法，开示来生。 欲使法音流演诸天，亿劫不绝，正一长存，生死蒙福，大宥明焉。 缘兹上白，伏愿天尊特垂一及怜。 於是天尊欢喜答曰：善哉，善哉。 子之所问，要乎深矣。 子虽洞灵墟，而幽源未尽，虽览大有，而龙汉难明。 气不可极，数难可穷，死而复生，幽而复明。 天地运转，如车之轮，人之生灭，如影随形，故难终也。 气气相续，种种生缘，善恶祸福，各有命根。 非天非地，亦又非人，正由心也。 心则神也。 形非我有也。 我所以得生者，从虚无自然中来，因缘寄胎，受化而生也。 我受胎父母，亦非我始生父母也，我真父母不在此也。 父母爱重，尊高无上。 今所生父母，是我寄附因缘，禀受育养之恩，故以礼报，而称为父母焉。 故我受形，亦非我形也。 寄之为屋宅，因之为营室，以舍我也。 附之以为形，示之以有无。 故得道者，无复有形也。 及我无身，我有何患。 所以有患者，为我有身耳。 有身则百患生，无身则入自然，立行合道，则身神一也。 身神并一，则为真身，归於始生父母，而成道也，无复患也，终不死也。 纵使灭度，则神往而形不灰也。 终身归其本，不相去也。 身犯百恶，罪竟而死，名曰死也。 死则灭坏，归於寄胎父母。 罪缘未尽，不得归於真父母也。 神充涂役，形成灰尘，灰尘飞化而成爽也。 魂神解脱，则与爽混合，故魂爽变化，合成一也，而得更生，还为人也。 形神相随，终不相去也。 如此善恶，身各有对，岂可咎於先亡及后子孙乎。 龙汉之前，逮至赤明，旧文生死各由一身，亦不上延，亦不下流，罪福止一，各以身当。 赤明以后，逮及上皇，人心破坏，男女不纯，嫉害争竞，更相残伤，心不自固，上引祖父，下引子孙，以为证誓，质告神明，竟不自信，负违誓言，致三官结簿，身没鬼官，上误先亡，下流子孙，致有殃逮，大小相牵，终天无解，祸及一宗。 此罪恶之人，自求大殃。 至法明言，永不得同。 达士积行，当取诸身，无求乎人。 明真旧典，岂虚言哉。 天尊重告太上道君曰：大慈之道，度人为先，非功不赏，非德不迁，非信不度，非行不仙也。 夫建功德者，一为天地，一为三光，一为帝主，一为兆民，一为祖世，一为家门，一为众生，一为己身。 经云：夫欲度身，当先度人。 众人不得度，终不度我身。 大慈广远，惠逮无穷，天人所仰，况在七祖父母乎。 罪福可不相加，至於功德，故有因缘之恩，精诚自责，天为回度，一志之感，人神同开，况於寄胎禀气，而生受其育养生成者哉。 慈爱既浓，岂可不为重建功德，以相开度，施报穷魂乎。",
      "translated_text": "Moreover, we witness the tormented forms and souls of the deceased, dragged and tossed amidst the Three Wretched Paths and Five Sufferings, forever bound to the Long River’s icy courts, where wind and blade torment them across ten thousand kalpas without release. Scriptures and transmissions speak variously: some say the evil of past lives brings calamity upon descendants; others, that one’s own grave sins mislead the departed ancestors; still others, that good and evil each have their karmic counterparts, and that the roots of life and death, sin and blessing, lie in one’s own fate. If such karmic retribution—good or ill—belongs to each individual alone, why then do we speak of delayed or extended consequences? Yet it is also said that without the merit of deliverance, the condemned souls of past lives have no means of liberation. Once merit is established, the gates of life and death open wide. But if each bears their own karmic ties, and those who commit evil perish only to sink into eternal darkness for ten thousand kalpas, how could they ever amass such great merit to redeem themselves? If descendants build merit on behalf of the deceased, this would differ little in principle from the notion of delayed consequences. My understanding is shallow and narrow; I cannot fathom this. Since the Heavenly Worthy has inaugurated the teaching of great forgiveness, illuminating both life and death, it is fitting that the hidden and the manifest be made entirely clear, lest the ignorant remain confused by these two doctrines.\n\nHaving been elevated to this office and entrusted with its oversight, I must proclaim the true Dharma and enlighten future generations. May the sound of this teaching flow through all heavens, enduring for billions of kalpas, preserving the Orthodox Unity, so that all beings—living and dead—may receive its blessings, and the light of great forgiveness be made manifest. For this reason, I humbly present this inquiry, beseeching the Heavenly Worthy to grant a measure of compassion.\n\nThereupon, the Heavenly Worthy replied with joy: Excellent, excellent. Your question is of profound importance. Though you have penetrated the cavernous depths of the numinous, the hidden sources remain not fully exhausted; though you have surveyed the vast expanse, the Dragon Han remains obscure. Qi cannot be exhausted, numbers cannot be fathomed; death gives way to rebirth, darkness to light. The turning of heaven and earth is like a wheel’s revolution; the arising and ceasing of human life is like a shadow following form—thus, it is difficult to bring to an end. Qi flows in ceaseless succession, giving rise to manifold conditions of birth. Good and evil, fortune and misfortune—each has its root in fate. It is neither heaven nor earth, nor even other people, but precisely the mind. The mind is spirit. The body is not truly ours. That by which we live comes from the void and the natural, dwelling temporarily in the womb, transformed and born. The parents who conceived us are not our original parents; our true parents are not here. The love and reverence we owe our parents are supreme and without equal. Yet the parents who bore us in this life are but the karmic conditions of our temporary lodging, the source of nurture and upbringing to whom we repay gratitude with propriety, calling them father and mother.\n\nThus, the body we receive is not truly our own. It is but a dwelling, a temporary abode, a shelter for the self. We cling to it as form, manifesting existence and nonexistence. Therefore, those who attain the Dao no longer possess a body. When I have no body, what suffering can I know? Suffering arises only because I have a body. With a body, a hundred afflictions arise; without a body, one enters the natural, aligns with the Dao, and body and spirit become one. When body and spirit unite, it is the true body, returning to the original parents and attaining the Dao—free from suffering, never to die. Even if one enters nirvana, the spirit departs while the form does not perish to ash. In the end, it returns to its origin, never parted. If the body commits a hundred evils and dies after exhausting its sins, this is called death. Death is dissolution, a return to the parents of the borrowed womb. If the karmic conditions are not yet fulfilled, it cannot return to the true parents. The spirit, bound to toil and drudgery, the form reduced to dust, the dust scattered and transformed into *shuang*. When the soul is liberated, it merges with the *shuang*, and thus soul and *shuang* transform as one, gaining rebirth and becoming human again. Body and spirit follow one another, never parting.\n\nIn this way, good and evil each have their counterparts, belonging to the individual alone. How can blame be laid upon ancestors or descendants? Before the Dragon Han, extending to the Red Clarity, the old texts state that life and death arise from the self, neither extending upward nor flowing downward; sin and blessing are borne by the individual alone. After the Red Clarity, reaching the High Antiquity, the human heart was corrupted: men and women lost their purity, jealousy and harm arose, and they turned to mutual destruction. The heart could not stand firm, drawing in ancestors above and descendants below as witnesses, swearing oaths before the gods. Yet they lacked self-trust, violating their vows, leading the Three Officials to record their transgressions. Upon death, they became ghosts, misleading the departed above and burdening descendants below, entangling all in calamity, great and small, without end, bringing ruin to the entire clan. Such evil-doers bring great misfortune upon themselves. The clear teachings of the Dharma state that they shall never be equaled. Those of insight accumulate merit, seeking it within themselves, not from others. Are the ancient texts of the Perfected not to be trusted?\n\nThe Heavenly Worthy further addressed the Most High Dao Lord: The Dao of great compassion places the deliverance of others first. Without merit, there is no reward; without virtue, no promotion; without faith, no deliverance; without practice, no immortality. Those who establish merit do so for the sake of heaven and earth, the Three Luminaries, the sovereign, the myriad people, their ancestors, their family, all beings, and themselves. The scriptures say: If you wish to deliver yourself, first deliver others. If all others are not delivered, you yourself will never be delivered. Great compassion is vast and boundless, extending mercy without end, revered by heaven and humanity—how much more so for the seven generations of ancestors? Sin and blessing may not be transferred, but when it comes to merit, there is the bond of karmic gratitude. Sincere remorse moves heaven to reverse one’s fate; the power of single-minded devotion opens the way for both humans and spirits. How much more so for those who, born of borrowed qi and nurtured in the womb, owe their existence and upbringing to others? When love and affection run deep, how can one not strive to build great merit, to deliver and repay the destitute souls?",
      "overlap_context": "s his head and respectfully asks the Heavenly Worthy: What determines the weight of merits, the stages of deliverance, and the order of precedence? Past-life heavy debts are repaid by oneself and may extend to one’s descendants. The evil one commits in this life brings retribution upon oneself and may also mislead the deceased. Now, as we see among the common people—men and women—those who suffer in this life, enduring all manner of hardships and a hundred afflictions, unable to free themselves.",
      "start_char": 10685,
      "end_char": 11906,
      "start_sentence": 506,
      "end_sentence": 562,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.64745736122131,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "自龙汉以来，至于赤明，得道者及见在福中，门户清贵，善缘来生，莫非积功累德，勋感诸天，以致交报。 及九幽长夜宿责之身得解脱者，莫非功德拔赎开度，以还人中也。 南陵朱宫九都上格，悉有其名，报应之理，毫分无失也。 年月相推，甚有分明。 道君作礼：今闻天尊告诸缘对功德报应，诸疑顿尽，心欢意释，无复余滞。 辄当勤心，奉宣大法，普示诸天无极世界百姓子男女人，咸令遵承，一切见明矣。 太上道君上白天尊：既垂开悟，诸疑并了，不审功德，何者为先。 见明真科文及智慧上品拔赎罪根，为尽如是，为复有余方，信誓拔赎，及教化童蒙，建立静舍，供养师宝，布诸香油，燃灯照夜，心行善念，救度众生，慈爱忠孝，布散穷乏，饷饴百乌，无有吝惜。 其中功德，为有轻重，为同一等高下尊卑。 愿垂告示。 天尊告曰：凡建功德，无大无小，无高无下，其功等耳。 轻重报应，由人心也。 心行不怠，苦而不退，此功难称，德亦难名。 徒有至心，行之不专，正可得免罪而已。 无心而浮好，徒施而无获也。 富室之家，爱惜财宝，不肯施散，拔赎罪根，徒推心求道，希望大报，此将徒劳而无益也。 天道何其责人财宝，强使作功德，故观其悭心，质求其意，有而不散，将何求哉。 穷而发心，意志坚明，勤苦师门，劳不为惮，道已鉴之，如此之辈，则功感诸天。 故施财以对心，推心以对财，其功等尔。 古人求心，末世求财，古人非心不仙，末世非财不度。 所以尔者，末世贵财而不贵道也。 以黄金万斤，仙经一部，施於穷山，末世乃当贪取此金，岂贪仙经也。 黄金克为身患，仙经克得命长。 亦合知如此，祇自不能免於悭贪，既自不能免於贪悭，安得为究道耶。 故非道弘人，此之谓也。 明真科法，智慧上品，拔度罪根，施於生死，其法甚重。 至於学士，身未入定，处於嚣尘，能无得失？ 举动施为，罪福并行，故三官九府百二十曹、左右阴阳水火考官，司人得失，善功者列言左官，行恶者列言右宫，各随年月日数远近，以考促之功德，日数轻重。 报应如涛水之会，必至之期，万无一失也。 但以轻重远近言之耳。 今故相告，勤为宣示，咸令来生男女善人，普知天地有不期之响应，真实之言也。 今以三元谢罪之法相付。 元始上道旧文，秘於三元宫中，万劫一行，不传下世。 有盼其篇目，宿根自拔，结缚自释。 宝而行之，必招大福。 轻而泄之，祸至灭族。 言丹心尽，深慎科法。 道君欢喜，稽首作礼。 是时诸天同时称善，稽首奉行。 上洞玄灵宝三元品戒功德轻重经竟 #1 宜：原误作「宣」，据敦煌S.6659抄本改。",
      "translated_text": "Since the Dragon Han era through to the Red Clarity, those who attained the Dao and abide in present blessings—whose households are pure and noble, whose good affinities extend into future lives—have all accumulated merit and piled up virtue, their achievements moving the various heavens to bestow reciprocal rewards. As for those bound in the long night of the Nine Dark Realms, whose karmic debts have been resolved, none have escaped through anything but the power of merit: ransoming, delivering, and returning them to the human realm. In the Southern Ridge’s Vermilion Palace and the Nine Capitals’ upper registers, all their names are recorded—such is the principle of karmic retribution, precise to the finest detail. The reckoning of years and months is utterly clear.\n\nThe Dao Lord bowed in reverence: Having now heard the Heavenly Worthy expound the karmic correspondences of merit and retribution, all doubts have instantly dissolved; my heart rejoices and my mind is at ease, with no lingering obstructions. I shall diligently apply my heart to propagating the Great Dharma, universally revealing it to all the people—men, women, and children—throughout the boundless worlds of the various heavens, that all may comply and fully perceive its truth.\n\nThe Most High Dao Lord addressed the Heavenly Worthy: Since you have deigned to awaken and resolve all doubts, I now inquire which among the merits should be prioritized. Are the revealed true statutes, the supreme wisdom of the highest grade for ransoming the roots of sin, sufficient in themselves, or are there additional methods? Does the solemn vow to ransom sins, the instruction of the young and ignorant, the establishment of quiet abodes, the offering of reverence to masters and treasures, the distribution of incense and oil, the lighting of lamps to illuminate the night, the cultivation of good thoughts, the deliverance of sentient beings, the practice of compassion, loyalty, and filial piety, the relief of the destitute, and the feeding of the hundred birds—all without stint—carry varying degrees of merit? Are they of the same rank, or do they differ in nobility and humility? I humbly request your instruction.\n\nThe Heavenly Worthy replied: In the establishment of merit, there is no great nor small, no high nor low—its power is equal. The weight of karmic retribution depends on the heart of the practitioner. If one’s heart remains unwavering in diligence, enduring hardship without retreat, such merit is beyond measure, and its virtue beyond naming. Yet if one merely possesses sincere intention but does not persist in practice, one may only escape sin without attaining further reward. Those who act without true heart, offering empty gestures, gain nothing from their efforts.\n\nThe wealthy, cherishing their treasures, refuse to distribute or ransom the roots of sin; they merely contemplate the Dao in their hearts, hoping for great reward—such efforts are futile and profitless. How could the heavenly Dao demand one’s wealth, compelling merit-making? It observes the stinginess of the heart and examines the sincerity of intent: if one possesses but does not give, what can one seek? Yet the poor who arouse the heart, whose will is firm and bright, who toil without complaint in the master’s gate—such individuals are seen by the Dao, and their merit moves the various heavens. Thus, offering wealth corresponds to the heart, and offering the heart corresponds to wealth—their merit is equal.\n\nThe ancients sought the heart; the degenerate age seeks wealth. The ancients attained immortality through nothing but the heart; the degenerate age attains deliverance through nothing but wealth. Why is this so? In the degenerate age, wealth is prized over the Dao. If a thousand pounds of gold and a scroll of immortal scripture were placed in a barren mountain, the people of this age would covet the gold, not the scripture. Gold can only bring bodily affliction; the scripture can extend one’s life. One ought to know this, yet one cannot escape stinginess and greed. If one cannot free oneself from greed and stinginess, how can one fully realize the Dao? Thus, it is not that the Dao fails to flourish among people—this is what is meant.\n\nThe statutes of luminous truth and the supreme wisdom of the highest grade for ransoming the roots of sin, applied to the realm of birth and death, are of the utmost gravity. As for scholars who have not yet entered samadhi, dwelling amid the clamor of the world, how can they avoid gains and losses? In every action and deed, sin and blessing proceed together. Thus, the Three Bureaus, Nine Courts, One Hundred Twenty Offices, and the left and right officials of yin and yang, water and fire, who oversee human gains and losses—those who accumulate good merit have their names recorded in the left registers, while those who commit evil have theirs in the right. Each is assessed according to the years, months, days, and the nearness or distance of their merit, with the weight of days determining the gravity. Karmic retribution converges like the meeting of tidal waters, its appointed time inevitable, with not a single error. The difference lies only in the weight and proximity of the reckoning.\n\nI now declare this to you so that you may diligently proclaim it, that all good men and women of future generations may universally know that heaven and earth possess an unerring resonance, and that these words are truly real. I now transmit the method of atonement for the Three Primes. The ancient texts of the Primordial Dao of the Origin were concealed in the Three Prime Palaces, revealed but once in ten thousand kalpas, never passed down to the lower worlds. Those who behold their titles may uproot their karmic roots and untie their bonds of their own accord. Treasure and practice them, and great fortune will surely follow. Treat them lightly or leak their secrets, and calamity will strike, annihilating one’s clan. With utter sincerity, deeply guard these statutes.\n\nThe Dao Lord rejoiced, bowed his head, and paid homage. At that moment, all the heavens simultaneously proclaimed their approval, bowed their heads, and received the teaching. Thus concludes *The Scripture on the Weight of Merit in the Three Prime Precepts of the Upper Cavern of Mystery and Numinous Treasure*.",
      "overlap_context": "ns of ancestors? Sin and blessing may not be transferred, but when it comes to merit, there is the bond of karmic gratitude. Sincere remorse moves heaven to reverse one’s fate; the power of single-minded devotion opens the way for both humans and spirits. How much more so for those who, born of borrowed qi and nurtured in the womb, owe their existence and upbringing to others? When love and affection run deep, how can one not strive to build great merit, to deliver and repay the destitute souls?",
      "start_char": 11906,
      "end_char": 12909,
      "start_sentence": 563,
      "end_sentence": 603,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.222978353500366,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝三元品戒功德轻重经.txt",
        "category": "戒律类"
      }
    }
  ]
}