{
  "source_id": "太上玉清谢罪登真宝忏",
  "source_file": "chunked_daozang\\太上玉清谢罪登真宝忏.json",
  "total_chunks": 2,
  "total_original_chars": 2062,
  "total_translated_chars": 13409,
  "total_translation_time": 56.33180356025696,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\太上玉清谢罪登真宝忏.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Most High Jade Pure Repentance for Ascending to Perfection and Atoning for Sins**\n\n**Sutra Title:** *The Most High Jade Pure Repentance for Ascending to Perfection and Atoning for Sins*\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category\n\nThe Most High Jade Pure Repentance for Ascending to Perfection and Atoning for Sins\n\nThe Most High said: Should there be male or female officials of the Dharma-body, devoted to the Dao with sincerity, diligently cultivating and advancing in practice, and widely performing virtuous deeds in this present life—if they do not repent and eliminate past karmic transgressions, they shall never be ranked in the Jade Court nor have their names inscribed in the Golden Register. Though they may wish to deliver the deceased and save the living, how could this be possible?\n\nDevout men and devout women, who follow and uphold my teachings, should diligently engage in repentance. Thus, they may deliver their nine generations of ancestors, bless their descendants, and through unwavering cultivation, attain the perfection of transcendence. Before my image, they should arrange offerings of incense, flowers, seasonal fruits, banners, and lamps, perform the rite of repentance, and reverently declare:\n\n*\"The repentant disciple [Name] takes refuge in the Three Pure Ones and the Ten Loftiest Perfected. From beginningless time until now, this disciple, ignorant of the true Dharma, believed in perverse views, indulged in desires, and committed manifold transgressions: failing to honor parents, disrespecting the Three Treasures, lacking reverence toward superiors, and lacking kindness toward subordinates; relying on the powerful to bully the weak, aiding the unworthy and suppressing the loyal and good; envying the worthy and resenting the capable, concealing virtue and spreading evil; manipulating weights and measures to alter fairness; misapplying medical treatments to harm lives; seeking bribes to cause miscarriages; worshipping heterodox spirits; hosting lavish feasts; slaughtering living beings and butchering swine and sheep. Acting solely for self-gratification, devoid of compassion, slandering the worthy and the sagely—now, this disciple openly confesses these sins without concealment. Humbly before the sacred presence, with sincere heart, this disciple repents, takes refuge, and pays homage to the sacred titles of the Jade Pure, the Universally Compassionate, and the Guardians of the World:\"*\n\n*I take refuge and pay homage to the Heavenly Worthy of the Jade Pure Sacred Realm,*\n*I take refuge and pay homage to the Heavenly Worthy of Universal Compassion and National Protection,*\n*I take refuge and pay homage to the Heavenly Worthy of the Jade Void Imperial Court,*\n*I take refuge and pay homage to the Heavenly Worthy of the Great One, Savior of Suffering,*\n*I take refuge and pay homage to the Heavenly Worthy of Profound Mystery and Supreme Virtue,*\n*I take refuge and pay homage to the Heavenly Worthy of Wondrous Response and Manifestation,*\n*I take refuge and pay homage to the Heavenly Worthy of Radiant Spiritual Light,*\n*I take refuge and pay homage to the Heavenly Worthy of Illuminating the Obscure and Rectifying Principle,*\n*I take refuge and pay homage to the Heavenly Worthy of Great Brahma and Profound Quiescence,*\n*I take refuge and pay homage to the Heavenly Worthy of Virtuous Fragrance and Exalted Protection,*\n*I take refuge and pay homage to the Heavenly Worthy of Mysterious Transformation and Benefiting Beings,*\n*I take refuge and pay homage to the Heavenly Worthy of the Jade Chronicle of the Divine Sovereign,*\n*I take refuge and pay homage to the Heavenly Worthy of Vast Merit and the Supreme Dao,*\n*I take refuge and pay homage to the Heavenly Worthy of Responding to Quiescence and Embracing Emptiness,*\n*I take refuge and pay homage to the Heavenly Worthy of the Great Tenuity, Upholder of Purity,*\n*I take refuge and pay homage to the Heavenly Worthy of Nurturing Virtue and Pure Transformation,*\n*I take refuge and pay homage to the Heavenly Worthy of Pure Essence and Radiant Virtue,*\n*I take refuge and pay homage to the Heavenly Worthy of Majestic Sustenance and the Torch of Wisdom,*\n*I take refuge and pay homage to the Heavenly Worthy of Deliverance from Delusion and Stagnation,*\n*I take refuge and pay homage to the Heavenly Worthy of Abundant Merit and Flourishing Virtue,*\n*I take refuge and pay homage to the Heavenly Worthy of Cleansing Filth and Dispelling Wrath,*\n*I take refuge and pay homage to the Heavenly Worthy of Benevolent Harmony and Prolonging Joy,*\n*I take refuge and pay homage to the Heavenly Worthy of Majestic and Resplendent Spirit,*\n*I take refuge and pay homage to the Heavenly Worthy of Divine Light and Brilliant Radiance,*\n*I take refuge and pay homage to the Perfected One of Great Compassion and Wondrous Conduct,*\n*I take refuge and pay homage to the Perfected One of Great Mercy and Universal Salvation.*\n\n*\"Disciple [Name], relying on the true teachings, reverently pays homage to the Most High Perfected, earnestly praying with utmost sincerity, and wholeheartedly repents. From beginningless time until now, through the three karmic actions, this disciple has committed the ten unwholesome deeds:\"*\n\n**The Karma of Killing:**\nIn this present life, men and women suffer shortened lifespans and live in solitude. Upon death, they fall into hell, enduring suffering for long kalpas. When their suffering ends, they are reborn only to be killed by others, trapped in an endless cycle of vengeance like ants in a wheel. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Theft:**\nIn this present life, one constantly suffers under legal punishments—torture, beatings, and lashings—living in poverty and destitution. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as an animal, burdened with labor and towing loads to repay past debts. Only when the debt is repaid can one return, yet there is no escape from this cycle. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Lust:**\nIn this present life, one is despised and suffers frequent illnesses. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a sparrow, wagtail, pig, or dog. When the retribution is exhausted, one reenters the cycle without escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of False Speech:**\nIn this present life, one is suspected and distrusted by others, suffers from lip sores and foul breath that repels people. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as an ugly, poor, and lowly person, enduring cold, hunger, and thirst, or as a hungry ghost or animal. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Frivolous Speech:**\nIn this present life, one is belittled by others, fails in endeavors, and lives in constant distress. Upon death, one enters hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a poor and lowly person, despised by many, or as an animal—mangy, scabrous, or a wild boar—hated by other beasts, bitten on sight, with no refuge. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Divisive Speech:**\nIn this present life, one becomes a servant or slave, driven by others, and suffers misfortune that turns blessings into calamities. Upon death, one enters hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a two-headed snake or an earthworm. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Harsh Speech:**\nIn this present life, one is insulted and humiliated by others, constantly suffering legal punishments.\n\nUpon death, one enters hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a person of hideous appearance—with a bird’s beak and a dog’s face, saliva and breath both foul—so that others refuse to heed one’s words. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Greed and Attachment:**\nIn this present life, one’s heart is filled with anguish and distress. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a hungry ghost, parched with hunger and thirst, never hearing the name of water or broth for endless kalpas. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Anger and Resentment:**\nIn this present life, one is constantly filled with hatred, cruel and merciless. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a scorpion or snake, bearing venom and claws, hated by others, beaten on sight, with no place to hide. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Ignorance and Delusion:**\nIn this present life, one is dull-witted, unable to discern good from evil, and scorned by others. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a beast of burden, pulling plows and bearing heavy loads, suffering hunger and thirst with no one to appeal to, growing old, emaciated, and weak, sold to the butcher’s block, meeting no good end. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\nNow, with devotion and reverence, I bow in homage and invoke the sacred names of the universally compassionate and world-protecting honored ones:\n\nI bow in homage and reverence to the Heavenly Worthy of Latent Transformation and Nurturance,\nI bow in homage and reverence to the Heavenly Worthy of Guiding the Lost and Dispelling Obstruction,\nI bow in homage and reverence to the Heavenly Worthy of the Wondrous Realm of Joy,\nI bow in homage and reverence to the Heavenly Worthy of the Wondrous Realm of Stillness,\nI bow in homage and reverence to the Heavenly Worthy of Deliverance from Peril,\nI bow in homage and reverence to the Heavenly Worthy of Relief from Suffering,\nI bow in homage and reverence to the Heavenly Worthy of Boundless Salvation,\nI bow in homage and reverence to the Heavenly Worthy of Unobstructed Freedom,\nI bow in homage and reverence to the Heavenly Worthy of Manifesting True Virtue,\nI bow in homage and reverence to the Heavenly Worthy of Harmonizing the World,\nI bow in homage and reverence to the Heavenly Worthy of Dragon Virtue and Universal Radiance,\nI bow in homage and reverence to the Heavenly Worthy of Latent Attainment of Myriad Blessings,\nI bow in homage and reverence to the Heavenly Worthy of the Dao’s Response to True Stillness,\nI bow in homage and reverence to the Heavenly Worthy of the Perfectly Rounded Jeweled Realm,\nI bow in homage and reverence to the Heavenly Worthy of Manifesting the Jeweled Form,\nI bow in homage and reverence to the Heavenly Worthy of Ultimate Profound Purity,\nI bow in homage and reverence to the Heavenly Worthy of Separation from Defilement,\nI bow in homage and reverence to the Heavenly Worthy of Embracing Emptiness,\nI bow in homage and reverence to the Heavenly Worthy of Realization and Awakening,\nI bow in homage and reverence to the Heavenly Worthy of Universal Adornment,\nI bow in homage and reverence to the Heavenly Worthy of Fearlessness,\nI bow in homage and reverence to the Heavenly Worthy of Pure and Wondrous Treasure,\nI bow in homage and reverence to the Greatly Compassionate and Benevolent Perfected One,\nI bow in homage and reverence to the Perfected One of Deliverance from Suffering and Salvation from Calamity.\n\nThis disciple, relying on the true scriptures, reverently worships the Most High Perfected Ones, earnestly praying with utmost sincerity, wholeheartedly repenting.\n\nOf old, the wondrous workings defy description, embracing the Three Realms and called great;\nThe utmost spirit is unfathomable, discerning the hundred virtues and bestowing auspiciousness.\nMoreover, when the crimson sincerity unfolds,\nIt meets the flourishing era and harmonizes with all.\nForever shall I serve with clarity,\nGathering abundant pure blessings.\nGazing upon the mushroom canopy as it arrives in ranks,\nI open the sacred precinct and fill it with harmony.\nMay I, through purity and devotion,\nReverently uphold the subtle and profound.\nI humbly implore that your precious gaze graciously descend,\nAnd this sincerity be truly fulfilled.\nProtect my household and bring forth good fortune,\nPreserve my blessings and longevity in peace.\nBasking in this propitious time,\nI cherish the true shelter of your grace.\nThis disciple, with utmost sincerity, earnestly prays thus.\n\nThe *Precious Repentance for Atonement and Ascension to Perfection of the Most High Jade Purity* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上玉清谢罪登真宝忏 经名：太上玉清谢罪登真宝忏。 一卷。 底本出处：《正统道藏》洞真部威仪类。 太上玉清谢罪登真宝忏 太上曰：若有男官法身、女官法身，奉道志诚，焚修精进，见在世间，广施德行。 若不忏除，夙冤往业，终不得位列玉庭，名标金格。 虽欲拔亡度生，其可得乎？ 清信男子、清信女人，遵禀吾教，自勤忏悔，可以济拔九祖，福后嗣人，修崇弗解，获致登真。 当於我像前，设香花、时果、旛灯供养，作忏悔法，恭信白言：忏悔弟子某归依三清上圣，十极高真。 弟子自从无始以来，未识正法，信邪倒见，放恣情欲，广造罪愆，不孝二亲，不祟三宝，奉上不敬，使下不宽，倚赖豪强，欺凌孤弱，援引不肖，排斥忠良，妬贤嫉能，掩善扬恶，或以权石，辄易重轻，谬用医方，误伤性命，为求贿赂，损孕堕胎，淫祀邪神，筵会宝客，烹饪生类，宰杀猜羊。 自务快情，全无恻隐，谤讟贤圣，今兹发露，不敢覆藏。 仰对圣前，诚心忏悔，归依信礼，玉清普慈护世诸尊圣号： 归命信礼玉清圣境天尊， 归命信礼普慈护国天尊， 归命信礼玉虚皇上天尊， 归命信礼太一救苦天尊， 归命信礼冲玄至德天尊， 归命信礼妙范应感天尊， 归命信礼灵光炳曜天尊， 归命信礼瞩幽正理天尊， 归命信礼大梵玄寂天尊， 归命信礼德芳崇佑天尊， 归命信礼玄化利生天尊， 归命信礼师皇玉纪天尊， 归命信礼弘功至道天尊， 归命信礼应寂含虚天尊， 归命信礼太微秉粹天尊， 归命信礼育德纯化天尊， 归命信礼纯精耀德天尊， 归命信礼威持智炬天尊， 归命信礼拯迷拔滞天尊， 归命信礼丰功茂德天尊， 归命信礼涤垢蠲忿天尊， 归命信礼惠和延喜天尊， 归命信礼威神炳焕天尊， 归命信礼神光炜烨天尊， 归命信礼大慈妙行真人， 归命信礼大悲普济真人。 弟子某式凭真诰，虔礼上真，恳祷至诚，一心忏悔。 某自从无始以来，三业起因，造十不善。 杀生业者，见在世中，男女命促，自身孤独。 死堕地狱，长劫受苦，苦尽复生，还遭他杀，冤冤相报，似蚁循环。 今对圣前，咸悉忏悔。 偷盗业者，见在世中，常遭刑纲，拷撩捶挞，贫穷不济。 死堕地狱，长劫受苦，苦尽复生，为畜生身，负重牵挽，偿他宿债，报尽还来，无由出离。 今对圣前，咸悉忏悔。 淫欲业者，见在世中，为人憎嫌，常多疾病。 死堕地狱，长劫受苦，苦尽复生，为其雀鸰、猜犬之类，报尽复入，无由出离。 今对圣前，咸悉忏悔。 妄语业者，见在世中，被他猜忌，人不信任，唇疮口气，臭秽熏人。 死堕地狱，长劫受苦，苦尽复生，为人丑陋，贫穷下贱，寒饿饥渴，或为饿鬼，或为畜生，报尽复还，却入地狱，无由出离。 今对圣前，咸悉忏悔。 绮言业者，见在世中，被他轻贱，为事不遂，常多窘迫。 死入地狱，长劫受苦，苦尽复生，为人贫贱，人多憎恶，或畜生中，疥癞野犴，众兽憎嫌，见即齿啮，蔽身无所，报尽复还，却入地狱，无由出离。 今对圣前，咸悉忏悔。 两舌业者，见在世中，为人奴婢，被他驱使，见在折除，转福为祸，当身受殃死入地狱，长劫受苦，苦尽复生，为两头蛇，或为蚯蚓，报尽复还，却入地狱，无由出离。 今对圣前，咸悉忏悔。 恶骂业者，见在世中，被人毁辱，常遭刑宪。",
      "translated_text": "**The Most High Jade Pure Repentance for Ascending to Perfection and Atoning for Sins**\n\n**Sutra Title:** *The Most High Jade Pure Repentance for Ascending to Perfection and Atoning for Sins*\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category\n\nThe Most High Jade Pure Repentance for Ascending to Perfection and Atoning for Sins\n\nThe Most High said: Should there be male or female officials of the Dharma-body, devoted to the Dao with sincerity, diligently cultivating and advancing in practice, and widely performing virtuous deeds in this present life—if they do not repent and eliminate past karmic transgressions, they shall never be ranked in the Jade Court nor have their names inscribed in the Golden Register. Though they may wish to deliver the deceased and save the living, how could this be possible?\n\nDevout men and devout women, who follow and uphold my teachings, should diligently engage in repentance. Thus, they may deliver their nine generations of ancestors, bless their descendants, and through unwavering cultivation, attain the perfection of transcendence. Before my image, they should arrange offerings of incense, flowers, seasonal fruits, banners, and lamps, perform the rite of repentance, and reverently declare:\n\n*\"The repentant disciple [Name] takes refuge in the Three Pure Ones and the Ten Loftiest Perfected. From beginningless time until now, this disciple, ignorant of the true Dharma, believed in perverse views, indulged in desires, and committed manifold transgressions: failing to honor parents, disrespecting the Three Treasures, lacking reverence toward superiors, and lacking kindness toward subordinates; relying on the powerful to bully the weak, aiding the unworthy and suppressing the loyal and good; envying the worthy and resenting the capable, concealing virtue and spreading evil; manipulating weights and measures to alter fairness; misapplying medical treatments to harm lives; seeking bribes to cause miscarriages; worshipping heterodox spirits; hosting lavish feasts; slaughtering living beings and butchering swine and sheep. Acting solely for self-gratification, devoid of compassion, slandering the worthy and the sagely—now, this disciple openly confesses these sins without concealment. Humbly before the sacred presence, with sincere heart, this disciple repents, takes refuge, and pays homage to the sacred titles of the Jade Pure, the Universally Compassionate, and the Guardians of the World:\"*\n\n*I take refuge and pay homage to the Heavenly Worthy of the Jade Pure Sacred Realm,*\n*I take refuge and pay homage to the Heavenly Worthy of Universal Compassion and National Protection,*\n*I take refuge and pay homage to the Heavenly Worthy of the Jade Void Imperial Court,*\n*I take refuge and pay homage to the Heavenly Worthy of the Great One, Savior of Suffering,*\n*I take refuge and pay homage to the Heavenly Worthy of Profound Mystery and Supreme Virtue,*\n*I take refuge and pay homage to the Heavenly Worthy of Wondrous Response and Manifestation,*\n*I take refuge and pay homage to the Heavenly Worthy of Radiant Spiritual Light,*\n*I take refuge and pay homage to the Heavenly Worthy of Illuminating the Obscure and Rectifying Principle,*\n*I take refuge and pay homage to the Heavenly Worthy of Great Brahma and Profound Quiescence,*\n*I take refuge and pay homage to the Heavenly Worthy of Virtuous Fragrance and Exalted Protection,*\n*I take refuge and pay homage to the Heavenly Worthy of Mysterious Transformation and Benefiting Beings,*\n*I take refuge and pay homage to the Heavenly Worthy of the Jade Chronicle of the Divine Sovereign,*\n*I take refuge and pay homage to the Heavenly Worthy of Vast Merit and the Supreme Dao,*\n*I take refuge and pay homage to the Heavenly Worthy of Responding to Quiescence and Embracing Emptiness,*\n*I take refuge and pay homage to the Heavenly Worthy of the Great Tenuity, Upholder of Purity,*\n*I take refuge and pay homage to the Heavenly Worthy of Nurturing Virtue and Pure Transformation,*\n*I take refuge and pay homage to the Heavenly Worthy of Pure Essence and Radiant Virtue,*\n*I take refuge and pay homage to the Heavenly Worthy of Majestic Sustenance and the Torch of Wisdom,*\n*I take refuge and pay homage to the Heavenly Worthy of Deliverance from Delusion and Stagnation,*\n*I take refuge and pay homage to the Heavenly Worthy of Abundant Merit and Flourishing Virtue,*\n*I take refuge and pay homage to the Heavenly Worthy of Cleansing Filth and Dispelling Wrath,*\n*I take refuge and pay homage to the Heavenly Worthy of Benevolent Harmony and Prolonging Joy,*\n*I take refuge and pay homage to the Heavenly Worthy of Majestic and Resplendent Spirit,*\n*I take refuge and pay homage to the Heavenly Worthy of Divine Light and Brilliant Radiance,*\n*I take refuge and pay homage to the Perfected One of Great Compassion and Wondrous Conduct,*\n*I take refuge and pay homage to the Perfected One of Great Mercy and Universal Salvation.*\n\n*\"Disciple [Name], relying on the true teachings, reverently pays homage to the Most High Perfected, earnestly praying with utmost sincerity, and wholeheartedly repents. From beginningless time until now, through the three karmic actions, this disciple has committed the ten unwholesome deeds:\"*\n\n**The Karma of Killing:**\nIn this present life, men and women suffer shortened lifespans and live in solitude. Upon death, they fall into hell, enduring suffering for long kalpas. When their suffering ends, they are reborn only to be killed by others, trapped in an endless cycle of vengeance like ants in a wheel. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Theft:**\nIn this present life, one constantly suffers under legal punishments—torture, beatings, and lashings—living in poverty and destitution. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as an animal, burdened with labor and towing loads to repay past debts. Only when the debt is repaid can one return, yet there is no escape from this cycle. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Lust:**\nIn this present life, one is despised and suffers frequent illnesses. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a sparrow, wagtail, pig, or dog. When the retribution is exhausted, one reenters the cycle without escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of False Speech:**\nIn this present life, one is suspected and distrusted by others, suffers from lip sores and foul breath that repels people. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as an ugly, poor, and lowly person, enduring cold, hunger, and thirst, or as a hungry ghost or animal. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Frivolous Speech:**\nIn this present life, one is belittled by others, fails in endeavors, and lives in constant distress. Upon death, one enters hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a poor and lowly person, despised by many, or as an animal—mangy, scabrous, or a wild boar—hated by other beasts, bitten on sight, with no refuge. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Divisive Speech:**\nIn this present life, one becomes a servant or slave, driven by others, and suffers misfortune that turns blessings into calamities. Upon death, one enters hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a two-headed snake or an earthworm. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Harsh Speech:**\nIn this present life, one is insulted and humiliated by others, constantly suffering legal punishments.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1309,
      "start_sentence": 0,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.85322403907776,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太上玉清谢罪登真宝忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "死入地狱，长劫受苦，苦尽复生，为人丑陋，鸟喙狗面，口液俱臭，人不听信，报尽复还，却入地狱，无由出离。 今对圣前，咸悉忏悔。 贪爱业者，见在世中，心多苦恼。 死堕地狱，长劫受苦，苦尽复生，还为饿鬼，饥渴焦然，亘劫不闻浆水之名，报尽复还，却入地狱，无由出离。 今对圣前，咸悉忏悔。 嗔恚业者，见在世中，常怀嗔恨，狠毒不仁。 死堕地狱，长劫受苦，苦尽复生，为蛇蝎类，含毒带螯，为人憎嫌，见即打扑，藏窜无地，报尽复还，却入地狱，无由出离。 今对圣前，咸悉忏悔。 愚痴业者，见在世中，为人愚懵，不识善恶，被人槟弃。 死堕地狱，长劫受苦，苦尽复生，为畜生类，负重拽犁，饥渴无告，老废瘦瘠，乏其筋力，鬻於屠肆，不得善终，报尽复还，却入地狱，无由出离。 今对圣前，咸悉忏悔。 今当归命信礼，普慈护世诸尊圣号： 归命信礼潜符化育天尊， 归命信礼导迷释滞天尊， 归命信礼妙乐境天尊， 归命信礼妙静境天尊， 归命信礼拔危天尊， 归命信礼济苦天尊， 归命信礼度人无量天尊， 归命信礼无碍自在天尊， 归命信礼应真德化天尊， 归命信礼契世咸通天尊， 归命信礼龙德普曜天尊， 归命信礼潜臻万福天尊， 归命信礼道应真寂天尊， 归命信礼行圆宝界天尊， 归命信礼显宝相天尊， 归命信礼极湛净天尊， 归命信礼离垢染天尊， 归命信礼含虚天尊， 归命信礼证悟天尊， 归命信礼普庄严天尊， 归命信礼无怖畏天尊， 归命信礼净妙宝天尊， 归命信礼大慈大惠真人， 归命信礼拔苦度厄真人。 弟子某式凭真诰，虔礼上真，恳祷至诚，一心忏悔。 原夫妙用难名，包三才而称大； 至神莫测，鉴百善而降祥。 矧丹诚之有开，遇昌期而胥协。 永为昭事，茂集纯禧。 瞻芝盖以骈来，启灵场而载洽。 庶凭精洁，仰奉希微。 伏冀宝睠丕临，斯诚允达。 佑门庭而协吉，保福寿以攸绥。 荷此亨辰，宝击真荫。 某无任至诚，恳祷之至。 太上玉清谢罪登真宝忏竟",
      "translated_text": "Upon death, one enters hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a person of hideous appearance—with a bird’s beak and a dog’s face, saliva and breath both foul—so that others refuse to heed one’s words. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Greed and Attachment:**\nIn this present life, one’s heart is filled with anguish and distress. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a hungry ghost, parched with hunger and thirst, never hearing the name of water or broth for endless kalpas. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Anger and Resentment:**\nIn this present life, one is constantly filled with hatred, cruel and merciless. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a scorpion or snake, bearing venom and claws, hated by others, beaten on sight, with no place to hide. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Ignorance and Delusion:**\nIn this present life, one is dull-witted, unable to discern good from evil, and scorned by others. Upon death, one falls into hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a beast of burden, pulling plows and bearing heavy loads, suffering hunger and thirst with no one to appeal to, growing old, emaciated, and weak, sold to the butcher’s block, meeting no good end. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\nNow, with devotion and reverence, I bow in homage and invoke the sacred names of the universally compassionate and world-protecting honored ones:\n\nI bow in homage and reverence to the Heavenly Worthy of Latent Transformation and Nurturance,\nI bow in homage and reverence to the Heavenly Worthy of Guiding the Lost and Dispelling Obstruction,\nI bow in homage and reverence to the Heavenly Worthy of the Wondrous Realm of Joy,\nI bow in homage and reverence to the Heavenly Worthy of the Wondrous Realm of Stillness,\nI bow in homage and reverence to the Heavenly Worthy of Deliverance from Peril,\nI bow in homage and reverence to the Heavenly Worthy of Relief from Suffering,\nI bow in homage and reverence to the Heavenly Worthy of Boundless Salvation,\nI bow in homage and reverence to the Heavenly Worthy of Unobstructed Freedom,\nI bow in homage and reverence to the Heavenly Worthy of Manifesting True Virtue,\nI bow in homage and reverence to the Heavenly Worthy of Harmonizing the World,\nI bow in homage and reverence to the Heavenly Worthy of Dragon Virtue and Universal Radiance,\nI bow in homage and reverence to the Heavenly Worthy of Latent Attainment of Myriad Blessings,\nI bow in homage and reverence to the Heavenly Worthy of the Dao’s Response to True Stillness,\nI bow in homage and reverence to the Heavenly Worthy of the Perfectly Rounded Jeweled Realm,\nI bow in homage and reverence to the Heavenly Worthy of Manifesting the Jeweled Form,\nI bow in homage and reverence to the Heavenly Worthy of Ultimate Profound Purity,\nI bow in homage and reverence to the Heavenly Worthy of Separation from Defilement,\nI bow in homage and reverence to the Heavenly Worthy of Embracing Emptiness,\nI bow in homage and reverence to the Heavenly Worthy of Realization and Awakening,\nI bow in homage and reverence to the Heavenly Worthy of Universal Adornment,\nI bow in homage and reverence to the Heavenly Worthy of Fearlessness,\nI bow in homage and reverence to the Heavenly Worthy of Pure and Wondrous Treasure,\nI bow in homage and reverence to the Greatly Compassionate and Benevolent Perfected One,\nI bow in homage and reverence to the Perfected One of Deliverance from Suffering and Salvation from Calamity.\n\nThis disciple, relying on the true scriptures, reverently worships the Most High Perfected Ones, earnestly praying with utmost sincerity, wholeheartedly repenting.\n\nOf old, the wondrous workings defy description, embracing the Three Realms and called great;\nThe utmost spirit is unfathomable, discerning the hundred virtues and bestowing auspiciousness.\nMoreover, when the crimson sincerity unfolds,\nIt meets the flourishing era and harmonizes with all.\nForever shall I serve with clarity,\nGathering abundant pure blessings.\nGazing upon the mushroom canopy as it arrives in ranks,\nI open the sacred precinct and fill it with harmony.\nMay I, through purity and devotion,\nReverently uphold the subtle and profound.\nI humbly implore that your precious gaze graciously descend,\nAnd this sincerity be truly fulfilled.\nProtect my household and bring forth good fortune,\nPreserve my blessings and longevity in peace.\nBasking in this propitious time,\nI cherish the true shelter of your grace.\nThis disciple, with utmost sincerity, earnestly prays thus.\n\nThe *Precious Repentance for Atonement and Ascension to Perfection of the Most High Jade Purity* is now complete.",
      "overlap_context": "r slave, driven by others, and suffers misfortune that turns blessings into calamities. Upon death, one enters hell, enduring suffering for long kalpas. When the suffering ends, one is reborn as a two-headed snake or an earthworm. When the retribution is exhausted, one returns to hell, with no escape. Now, before the sacred presence, this disciple fully repents.\n\n**The Karma of Harsh Speech:**\nIn this present life, one is insulted and humiliated by others, constantly suffering legal punishments.",
      "start_char": 1309,
      "end_char": 2126,
      "start_sentence": 59,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.4785795211792,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太上玉清谢罪登真宝忏.txt",
        "category": "威仪类"
      }
    }
  ]
}