{
  "source_id": "太上三元飞星冠禁金书玉箓图",
  "source_file": "chunked_daozang\\太上三元飞星冠禁金书玉箓图.json",
  "total_chunks": 3,
  "total_original_chars": 2665,
  "total_translated_chars": 16366,
  "total_translation_time": 74.58438086509705,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\灵图类\\太上三元飞星冠禁金书玉箓图.txt",
    "category": "灵图类"
  },
  "full_translation": "*The Supreme Three Primordials Flying Star Coronation Prohibition Gold Writ Jade Register Diagram*\n\n**Scripture Title:** *The Supreme Three Primordials Flying Star Coronation Prohibition Gold Writ Jade Register Diagram*. Author unknown. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Lingtu* Category.\n\n---\n\n*The Supreme Three Primordials Flying Star Coronation Prohibition Gold Writ Jade Register Diagram*\n\nOn Crane Call Mountain, the Supreme Lord Lao bestowed the Gold Writ and Jade Register upon Celestial Master Zhang Daoling. Daoling bowed deeply, knelt, and addressed him: \"Your servant is base and lowly, a withered remnant of mortal life. Yet I have been specially favored by the Supreme One with the essential methods of the perfected. I see that demonic and vulgar forces intermingle, and now the great demons of the world defy prohibitions and precepts, moving with the baleful qi of tigers, wolves, and the Five Epidemics to harm mankind. The multitudes suffer hardship in their livelihoods. By good fortune, I have encountered the Sagely Venerable One—may you deign to show compassion.\"\n\nThe Supreme One addressed Daoling: \"The human heart is the master of the myriad transformations. If one can preserve its spirit, the spirit will abide in the human heart as the master of the myriad transformations. If one can know its spirit, the spirit will guard the person. If you do not know its spirit, the spirit will depart from you. If you can preserve its words, the spirit will return to you. For this reason, the Three Palaces wail in sorrow, and the Five Spirits leave the body. This is how demons arise from within, and ghosts come from without. Ghosts and demons grow ever more exultant, while the spirit transforms into a thief. Your living name is cast into the left tally, and your death is recorded in the right palace. Weapons and illness come to harm you—how can you prolong your distant years? This is why I constantly pity you. Now you ask me, and I know your aspiration. I shall teach you the Way of the Three and Five, the Covenant of Might, and the Orthodox Unity. Receive it with sincerity and faith; do not show it to the unworthy. You may attain long life, repel the myriad calamities, remain unstained by the Three Disasters, and be unassailed by the Nine Adversities. Even the disasters of water and fire will not draw near.\n\n**Coronation of the Five Stars and Seven Primordials**\n\n*Qian* Metal Star, *Yuan* Wood Star, *Heng* Water Star, *Li* Fire Star, *Zhen* Earth Star.\n*Qian* at the head, *Yuan* at the left ear, *Heng* at the right ear, *Li* at the right shoulder, *Zhen* at the left shoulder. [Missing characters] at the left shoulder, [missing] at the right elbow, [missing] at the right arm, [missing] at the left thigh, [missing] above the abdomen, [missing] above the heart, [missing] at the left breast.\n\nWhen observed thus, the Five Dipper is complete.\n\nThe Yin Contemplation Incantation states:\nThe Four Spirits clash,\nThe Five Dipper comes to aid.\nA thousand disasters scatter and vanish,\nTen thousand afflictions dissolve of themselves.\nAs I now act,\nI turn my back on solitude and strike at emptiness.\nWhat petty ghost\nDares approach my dwelling?\nHeavenly Soldiers and Mightly Warriors,\nMove and they shall be utterly destroyed.\nSwiftly, swiftly, as decreed by statute and ordinance.\n\n**Method of Coronating the Seven Dipper**\n\n1. [Missing] at the left hand, [missing] at the left elbow, [missing] at the left shoulder, [missing] above the heart, [missing] at the right shoulder, [missing] at the right elbow, [missing] at the right hand.\n2. [Missing] at the right hand, [missing] at the right elbow, [missing] at the right shoulder, [missing] above the heart, [missing] at the left shoulder, [missing] at the left elbow, [missing] at the left hand.\n3. [Missing] at the left hand, [missing] at the left elbow, [missing] at the left shoulder, [missing] above the heart, [missing] at the right thigh, [missing] at the right knee, [missing] at the right foot.\n4. [Missing] at the right hand, [missing] at the right elbow, [missing] at the right shoulder, [missing] above the heart, [missing] at the left thigh, [missing] at the left knee, [missing] at the left foot.\n5. [Missing] at the left foot, [missing] at the left knee, [missing] at the left thigh, [missing] above the heart, [missing] at the right shoulder, [missing] at the right elbow, [missing] at the right noon.\n6. [Missing] at the right foot, [missing] at the right knee, [missing] at the right thigh, [missing] above the heart, [missing] at the left shoulder, [missing] at the left elbow, [missing] at the left hand.\n7. [Missing] at the left foot, [missing] at the left knee, [missing] at the left shoulder, [missing] above the heart, [missing] at the right shoulder, [missing] at the right elbow, [missing] at the right hand.\n\nCoronate thus seven times, and the stars will coil around your form. The myriad ghosts will be subdued and crushed, and the hundred spirits will guard and protect you. Your name will be inscribed in the Jade Register, your years extended, your lifespan lengthened, your bones transformed into true gold, and you will ascend to the celestial clouds. With prolonged cultivation, there will be no lack of verification. Do not show this to the unworthy—be cautious, be cautious.\n\n**Radiant Coronation of the Five Stars, Seven Stars, and Seven Primordials**\n\nThe Five Houses are *Qian*, *Yuan*, *Heng*, *Li*, and *Zhen*.\nThe Seven Primordials are [missing characters].\n\nWhen cultivation and preservation are complete, next coronate the Five Dipper and the Twenty-Eight Constellations.\n\n**Method of Coronating the Five Dipper and Twenty-Eight Constellations**\n\n1. *Jiao* at the left hand, *Kang* at the left elbow, *Di* at the left shoulder, *Fang* above the heart, *Xin* at the right thigh, *Wei* at the right knee, *Ji* at the right foot.\n2. *Dou* at the right hand, *Niu* at the right elbow, *Nü* at the right shoulder, *Xu* above the heart, *Wei* at the left thigh, *Shi* at the left knee, *Bi* at the left foot.\n3. *Kui* at the left foot, *Lou* at the left knee, *Wei* at the left thigh, *Mao* above the heart, *Bi* at the right shoulder, *Zi* at the right elbow, *Shen* at the right hand.\n4. *Jing* at the right foot, *Gui* at the right knee, *Liu* at the right thigh, *Xing* above the heart, *Zhang* at the left shoulder, *Yi* at the left elbow, *Zhen* at the left hand.\n5. [Missing] at the head, [missing] at the left shoulder, [missing] at the right shoulder, [missing] at the left thigh, [missing] at the right thigh, [missing] at the left foot, [missing] at the right foot.\n\nThis method of coronating the stars is the highest teaching. Hold fast to its profound and wondrous essentials and practice them. What Way will not be accomplished? What ghost will not be subdued? None will fail to revere and submit—this is the secret text of the immortals. If a perfected one obtains it, do not transmit it recklessly. This is the dynamic of the stars and the moon, driving spirits and commanding ghosts, its efficacy unfathomable. If transmitted recklessly to the unworthy, calamity will befall oneself and extend to the seven generations of ancestors. Practice diligently, and you will soon attain the Dao of immortality.\n\nFor all who wish to cultivate immortality and study the Dao, on the first day of the first lunar month, stand in a pure and clean place, face north, and bow four times to the Primordial Sovereign. The Primordial Sovereign is the one who opened heaven at the beginning. Another name is the Sagely Mother—without paying homage to the Sagely Mother, the study of the Dao will not succeed.\n\nYou should declare:\n\"Your servant is a person of the lowest realm, born of the womb, base and vulgar, mingled with filth and stench, defiled by the clamor of dust, a remnant breath in a rotting husk, a life of blood and foulness. Yet I have been bathed in the mysterious shade and have returned to this remnant life. By good fortune, through generations of revering the true, blessings have been left to later descendants. How dare I, with my foul and filthy self, unafraid of heavenly might, delight in the Dao and rejoice in immortality, offering utmost sincerity to the profound and mysterious?\"\n\nProstrate, I beseech the divine radiance to secretly illuminate me, that I may transcend the gate of deathlessness. May the Most Sagely bestow grace, grant me protection, ward off calamities, and harmonize with the Dao in perfect accord.\n\nNext, tap the teeth three times and inwardly visualize the Five Stars.\nFirst, envision Jupiter in the left hand, its hue like a blue jewel.\nNext, envision Venus in the right hand, its hue like a white jewel.\nThen, envision Mars above the crown, its hue like a fiery pearl.\nNext, envision Saturn within the heart, its hue like yellow gold.\nFinally, envision Mercury beneath the feet, its hue like black jade.\nLet their divine radiance thoroughly illuminate the entire body.\n\nInwardly recite the incantation:\n*\"The Five Stars guard my form,\ntheir light illumines the mysterious darkness.\nA thousand spirits and ten thousand sages\nshield my true spirit.\nFierce beasts of heaven,\nsubdue the five weapons.\nDemons of the five heavens,\nperish in body and vanish in form.\nWherever I dwell,\nall spirits shall attend me.\"*\nSwiftly, swiftly, as decreed by law.\n\nOnce the Five Dippers are crowned, then visualize the Five Stars transforming upon my body.\nEnvision Jupiter in the left hand, transmuting into a wind wheel.\nMars above the crown, transforming into fierce fire encircling the body.\nSaturn before the heart, changing into golden chainmail wrapped around the body.\nVenus in the right hand, becoming a vajra divine sword, its blade and edge ablaze with flame.\nMercury beneath the feet, suddenly shifting into a river that in an instant becomes a sea, from which five dragons emerge.\n\nAfter visualizing the spirits, inwardly recite the incantation:\n*\"The Five Stars guard my form,\ntheir light illumines the fire spirit.\nPreserve my five limbs,\nguard my ten thousand spirits.\nDemons of the six heavens,\nmove and be slain in form.\"*\nSwiftly, swiftly, as decreed by law.\n\nNext, envision the Great Killing Star of the Celestial Stem, its qi descending from the stem—internally yellow, externally black—until it reaches before me. With the nose, inhale it for twelve breaths, then inwardly recite the incantation:\n*\"True qi of the Great Killing,\ninternally yin, externally yang.\nPreserve my body and life,\ndispel evil and avert misfortune.\nMountain spirits and goblins,\nearth gods and strong demons □.\nCrimson mouths and white tongues,\ninsects, snakes, tigers, and wolves.\nThose who harm me shall die,\nthose who plot against me shall perish.\nThose who cherish me shall prosper,\nthose who serve me shall flourish.\nTen thousand spirits shattered,\nsubdued beneath Heaven’s firmament.\"*\nSwiftly, swiftly, as decreed by law.\n\nPlace the left hand upon the heart and the right hand upon the crown.\nInwardly envision □ star in the right hand, □ star in the left hand, □ star before the chest.\nThen inwardly recite the incantation:\n*\"The Great Killing Star of the Celestial Stem\nguards the origin of my heart.\nExternally repels the five weapons,\ninternally dispels the five pestilences.\nThose who oppose me shall be deluded,\nthose who scheme against me shall meet misfortune.\nRebellious ghosts and wicked men,\nwhat can they do to me?\"*\nSwiftly, swiftly, as decreed by law.\n\nPlace the left hand upon the heart and the right hand pointing heavenward in concealment.\nEnvision the Celestial Stem Star in the right hand, □ star in the left hand, □ star above the head.\nRecite the incantation:\n*\"True qi of Yang Brightness\ncrowns my vermilion yang.\nDispels ten thousand harms,\ndrives back rebellious □.\nThieves and wicked men,\ninsects, snakes, tigers, and wolves.\nThose who plot against me shall die,\nthose who harm me shall perish.\nCrimson mouths and white tongues,\nsubdued beneath the Celestial Stem.\"*\nSwiftly, swiftly, as decreed by law.\n\nTurn the right hand to point backward toward the heart, the left hand pointing to the heart.\nInwardly envision the Celestial Stem Star in the right hand, □ above the head, □ star in the left hand.\nThen inwardly recite the incantation:\n*\"Luminous and upright qi,\ndwells in the Celestial Stem.\nGuards the Crimson Palace,\ndispels misfortune and calamity.\nWhat spirit dares remain?\nWhat ghost dares approach?\nA thousand sages and ten thousand ghosts\nsubmit to my Celestial Stem.\"*\nSwiftly, swiftly, as decreed by law.\n\nWith both hands, trace the Three Terraces as a canopy.\nInwardly envision the Upper Terrace Star Officer, Void Essence, in my left hand.\nNext, envision the Middle Terrace Star Officer, Sixfold Purity, and the Lower Terrace Star Officer, Crooked Life, beneath the right hand and both knees.\nMy head wears the canopy, my feet tread the Celestial Stem.\nThe earth’s net spans the eight directions,\nthe heaven’s net stretches in four directions.\nThe Northern Dipper brings death—\ndispels calamity and eradicates misfortune.\nThe Southern Dipper bestows life—\nprolongs lifespan and extends years.\nAll wishes are fulfilled,\nwherever I dwell brings prosperity.\nInternal and external strong □,\nmove and be utterly destroyed.*\nSwiftly, swiftly, as decreed by law.\n\nAfter crowning all the stars, each night before sleeping, inwardly recite this incantation. First, before the bed, perform the Void Yu Step or the Nine-Trace Step.\nAt the moment of retiring, before the grove, inwardly recite the incantation:\n*\"Step backward from the bed,\ndispel evil and eradicate misfortune.\nHeavenly Emperor’s prison wardens,\nforbid ghosts from wandering at night.\nFor grave offenses, waist severance;\nfor minor offenses, preservation of life.\nNeither grave nor minor,\nsever the ghost’s two arms.\nMoon to the right, sun to the left,\neach two inches and five fen from my brow.\nThe Northern Dipper’s seven stars\nencircle the chamber.\"*\nSwiftly, swiftly, as decreed by law.\n\nThe Lord Lao addressed Dao Ling, saying: \"In conducting great affairs, you must cultivate the method of worshipping the stars. If you do not know this method, the celestial spirits will not protect you. Malevolent demons will come to harm you, and wicked people will plot against you. Heaven-sent pestilential qi will arise, and weapons and warfare will erupt in due time. Through these, you may fall ill and even meet your end. You should diligently refine this most wondrous method. Be steadfast in this, and do not transmit it to those who accumulate evil. To carelessly divulge the true scripture will bring calamity upon yourself, extending even to your seven generations of ancestors. Be cautious, be ever cautious.\"\n\nThe Lord Lao said: \"This is the method of the host of immortals. If you can practice it, you shall attain longevity and enduring vision in the world. Those who cannot achieve longevity do so because heavenly demons have bound them with sin. If you refine my method, you will surely be free from all disasters and misfortunes, your lifespan will be prolonged, and blessings will flow endlessly to your descendants. If you reveal it to the unworthy, calamity will befall your seven generations, and your own body will fill the Yellow River.\"\n\nUpon concluding, Dao Ling respectfully received the teachings and admonitions, bowing his head in reverence to put them into practice.\n\n**The Nine-Palace Dipper Formula**\n\nThe Dipper’s essence is wondrous, the twelve spirits.\nRiding the Celestial Stem, martial might arrays.\nQi drifts and shifts, like floating clouds.\nSeven transformations move, ceasing only in accord with Heaven.\nKnow their changes, and the auspicious and inauspicious will be clear to your right.\nStep through the Dipper’s lodges, before the Celestial Pass.\nEnter the Six Pitches, uphold the Four Prohibitions.\nFlank Heavenly Flower, tread Heavenly Task.\nEmbrace Heavenly Pillar, connect with Heavenly Heart.\nFrom here, ascend to Heavenly Bird.\nLean on Heavenly Auxiliary, gaze toward Heavenly Surge.\nEnter Heavenly Inner, exit Heavenly Peril.\nThe Dipper’s Dao flows, hard and soft harmonize.\nHeaven bestows wealth and emolument, the clear and cold abyss.\nEnter the profound darkness, for a thousand myriad years.\n\nHere ends *The Supreme Three Primes’ Flying Star Coronation Prohibitions, Golden Writ, and Jade Register Diagram*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上三元飞星冠禁金书玉录图 经名：太上三元飞星冠禁金书玉箓图。 不着撰人。 一卷。 底本出处：《正统道藏》洞神部灵图类。 太上三元飞星冠禁金书玉录图 太上老君於鹤鸣山，以金书玉箓付天师张道陵。 道陵稽首，长跪启曰：臣鄙下凡贱，枯骨余生，特蒙太上赐以上真要法。 臣见魔俗混杂，今天下大魔不伏禁戒，动与虎狼五疫故气伤人者。 众治生难为，幸遇圣尊，愿垂哀愍。 太上告道陵曰：夫人心为万化之主，若能存其神，神乃依於人心，为万化之主。 若能知其神，神乃守於人。 子不知其神，神乃离於人。 子能存其言，神乃反於人。 为此，三宫悲号，五神离身。 此乃魔从内起，鬼自外来。 鬼魔益欢，神变为贼。 落生名於左契，注死录於右宫。 兵病来伤，岂延遐寿，所以吾常愍之。 子今问我，知子志哉。 吾为子说三五盟威正一之道，谛信受之，勿示非人。 子可长生，辟除万祸，三灾不染，九横难侵，水火之灾不可近耳。 冠五星七元 乾金星，元木星，亨水星，利火星，贞土星。 乾在头，元左耳，亨右耳，利右肩，贞左肩。 □左肩，□右肘，□右肱，□左股，□腹上，□心上，□左乳。 右如此观之，五斗成也。 阴思咒曰：四神相冲，五斗来扶。 千灾散灭，万厄自除。 吾今行事，背孤击虚。 是何小鬼，敢近吾庐。 天丁力士，动即尽诛。 急急如律令。 冠七斗法 一□左手，□左肘，□左肩，□心上，□右肩，□右肘，□右手。 二□右手，□右肘，□右肩，□心上，□左肩，□左肘，□左手。 三□左手，□左肘，□左肩，□心上，□右股，□右膝，□右足。 四□右手，□右肘，□右肩，□心上，□左股，□左膝，□左足。 五□左足，□左膝，□左股，□心上，□右肩，□右肘，□右午。 六□右足，□右膝，□右股，□心上，□左肩，□左肘，□左手。 七□左足，□左膝，□左肩，□心上，□右肩，□右肘，□右手。 右冠之七遍，其星绕络身形。 万鬼摧伏，百灵卫护。 玉历题名注算，延年益寿，骨变真金，上升霄汉。 久修鍊之，无不应验。 勿示非人，慎之慎之。 光冠五星七星七元。 五屋者，乾元享利贞。 七元者□□□□□□□。 修存毕，次冠五斗二十八宿。 冠五斗二十八宿法 一角左手，亢左肘，氏左肩，房心上，心右股，尾右膝，箕右足。 二斗右手，牛右肘，女右肩，虚心上，危左股，室左膝，壁左足。 三奎左足，娄左膝，胃左股，昂心上，毕右肩，觜右肘，参右手。 四井右足，鬼右膝，柳右股，星心上，张左肩，翼左肘，轸左手。 五□头上，□左肩，□右肩，□左股，□右股，□左足，□右足。 右冠星之法，最为上教。 玄妙之要，怀而行之。 何道不成？ 、何鬼不伏？ 无不钦降，此乃神仙秘密之文。 若至人得之，切勿妄传。 此关星动月，驱神役鬼，验不可测。 若妄传非人，殃及自身，延及七祖。 勤而行之，早成仙道也。 凡欲修仙学道，可於正月一日已前，立於清净之地，面向北，朝元君四拜。 元君者，元始开天是也。 二名圣母，若不朝圣母，学道不成。 当告启曰：臣下境之人，胎生凡贱，杂秽腥浊，触挠嚣尘，残喘腐骸，腥血之命。 特沐玄荫，得反余生。 幸蒙累世崇真，福留后叶。 敢将粪秽，不惧天威，好道乐仙，至诚玄奥。",
      "translated_text": "*The Supreme Three Primordials Flying Star Coronation Prohibition Gold Writ Jade Register Diagram*\n\n**Scripture Title:** *The Supreme Three Primordials Flying Star Coronation Prohibition Gold Writ Jade Register Diagram*. Author unknown. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Lingtu* Category.\n\n---\n\n*The Supreme Three Primordials Flying Star Coronation Prohibition Gold Writ Jade Register Diagram*\n\nOn Crane Call Mountain, the Supreme Lord Lao bestowed the Gold Writ and Jade Register upon Celestial Master Zhang Daoling. Daoling bowed deeply, knelt, and addressed him: \"Your servant is base and lowly, a withered remnant of mortal life. Yet I have been specially favored by the Supreme One with the essential methods of the perfected. I see that demonic and vulgar forces intermingle, and now the great demons of the world defy prohibitions and precepts, moving with the baleful qi of tigers, wolves, and the Five Epidemics to harm mankind. The multitudes suffer hardship in their livelihoods. By good fortune, I have encountered the Sagely Venerable One—may you deign to show compassion.\"\n\nThe Supreme One addressed Daoling: \"The human heart is the master of the myriad transformations. If one can preserve its spirit, the spirit will abide in the human heart as the master of the myriad transformations. If one can know its spirit, the spirit will guard the person. If you do not know its spirit, the spirit will depart from you. If you can preserve its words, the spirit will return to you. For this reason, the Three Palaces wail in sorrow, and the Five Spirits leave the body. This is how demons arise from within, and ghosts come from without. Ghosts and demons grow ever more exultant, while the spirit transforms into a thief. Your living name is cast into the left tally, and your death is recorded in the right palace. Weapons and illness come to harm you—how can you prolong your distant years? This is why I constantly pity you. Now you ask me, and I know your aspiration. I shall teach you the Way of the Three and Five, the Covenant of Might, and the Orthodox Unity. Receive it with sincerity and faith; do not show it to the unworthy. You may attain long life, repel the myriad calamities, remain unstained by the Three Disasters, and be unassailed by the Nine Adversities. Even the disasters of water and fire will not draw near.\n\n**Coronation of the Five Stars and Seven Primordials**\n\n*Qian* Metal Star, *Yuan* Wood Star, *Heng* Water Star, *Li* Fire Star, *Zhen* Earth Star.\n*Qian* at the head, *Yuan* at the left ear, *Heng* at the right ear, *Li* at the right shoulder, *Zhen* at the left shoulder. [Missing characters] at the left shoulder, [missing] at the right elbow, [missing] at the right arm, [missing] at the left thigh, [missing] above the abdomen, [missing] above the heart, [missing] at the left breast.\n\nWhen observed thus, the Five Dipper is complete.\n\nThe Yin Contemplation Incantation states:\nThe Four Spirits clash,\nThe Five Dipper comes to aid.\nA thousand disasters scatter and vanish,\nTen thousand afflictions dissolve of themselves.\nAs I now act,\nI turn my back on solitude and strike at emptiness.\nWhat petty ghost\nDares approach my dwelling?\nHeavenly Soldiers and Mightly Warriors,\nMove and they shall be utterly destroyed.\nSwiftly, swiftly, as decreed by statute and ordinance.\n\n**Method of Coronating the Seven Dipper**\n\n1. [Missing] at the left hand, [missing] at the left elbow, [missing] at the left shoulder, [missing] above the heart, [missing] at the right shoulder, [missing] at the right elbow, [missing] at the right hand.\n2. [Missing] at the right hand, [missing] at the right elbow, [missing] at the right shoulder, [missing] above the heart, [missing] at the left shoulder, [missing] at the left elbow, [missing] at the left hand.\n3. [Missing] at the left hand, [missing] at the left elbow, [missing] at the left shoulder, [missing] above the heart, [missing] at the right thigh, [missing] at the right knee, [missing] at the right foot.\n4. [Missing] at the right hand, [missing] at the right elbow, [missing] at the right shoulder, [missing] above the heart, [missing] at the left thigh, [missing] at the left knee, [missing] at the left foot.\n5. [Missing] at the left foot, [missing] at the left knee, [missing] at the left thigh, [missing] above the heart, [missing] at the right shoulder, [missing] at the right elbow, [missing] at the right noon.\n6. [Missing] at the right foot, [missing] at the right knee, [missing] at the right thigh, [missing] above the heart, [missing] at the left shoulder, [missing] at the left elbow, [missing] at the left hand.\n7. [Missing] at the left foot, [missing] at the left knee, [missing] at the left shoulder, [missing] above the heart, [missing] at the right shoulder, [missing] at the right elbow, [missing] at the right hand.\n\nCoronate thus seven times, and the stars will coil around your form. The myriad ghosts will be subdued and crushed, and the hundred spirits will guard and protect you. Your name will be inscribed in the Jade Register, your years extended, your lifespan lengthened, your bones transformed into true gold, and you will ascend to the celestial clouds. With prolonged cultivation, there will be no lack of verification. Do not show this to the unworthy—be cautious, be cautious.\n\n**Radiant Coronation of the Five Stars, Seven Stars, and Seven Primordials**\n\nThe Five Houses are *Qian*, *Yuan*, *Heng*, *Li*, and *Zhen*.\nThe Seven Primordials are [missing characters].\n\nWhen cultivation and preservation are complete, next coronate the Five Dipper and the Twenty-Eight Constellations.\n\n**Method of Coronating the Five Dipper and Twenty-Eight Constellations**\n\n1. *Jiao* at the left hand, *Kang* at the left elbow, *Di* at the left shoulder, *Fang* above the heart, *Xin* at the right thigh, *Wei* at the right knee, *Ji* at the right foot.\n2. *Dou* at the right hand, *Niu* at the right elbow, *Nü* at the right shoulder, *Xu* above the heart, *Wei* at the left thigh, *Shi* at the left knee, *Bi* at the left foot.\n3. *Kui* at the left foot, *Lou* at the left knee, *Wei* at the left thigh, *Mao* above the heart, *Bi* at the right shoulder, *Zi* at the right elbow, *Shen* at the right hand.\n4. *Jing* at the right foot, *Gui* at the right knee, *Liu* at the right thigh, *Xing* above the heart, *Zhang* at the left shoulder, *Yi* at the left elbow, *Zhen* at the left hand.\n5. [Missing] at the head, [missing] at the left shoulder, [missing] at the right shoulder, [missing] at the left thigh, [missing] at the right thigh, [missing] at the left foot, [missing] at the right foot.\n\nThis method of coronating the stars is the highest teaching. Hold fast to its profound and wondrous essentials and practice them. What Way will not be accomplished? What ghost will not be subdued? None will fail to revere and submit—this is the secret text of the immortals. If a perfected one obtains it, do not transmit it recklessly. This is the dynamic of the stars and the moon, driving spirits and commanding ghosts, its efficacy unfathomable. If transmitted recklessly to the unworthy, calamity will befall oneself and extend to the seven generations of ancestors. Practice diligently, and you will soon attain the Dao of immortality.\n\nFor all who wish to cultivate immortality and study the Dao, on the first day of the first lunar month, stand in a pure and clean place, face north, and bow four times to the Primordial Sovereign. The Primordial Sovereign is the one who opened heaven at the beginning. Another name is the Sagely Mother—without paying homage to the Sagely Mother, the study of the Dao will not succeed.\n\nYou should declare:\n\"Your servant is a person of the lowest realm, born of the womb, base and vulgar, mingled with filth and stench, defiled by the clamor of dust, a remnant breath in a rotting husk, a life of blood and foulness. Yet I have been bathed in the mysterious shade and have returned to this remnant life. By good fortune, through generations of revering the true, blessings have been left to later descendants. How dare I, with my foul and filthy self, unafraid of heavenly might, delight in the Dao and rejoice in immortality, offering utmost sincerity to the profound and mysterious?\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1300,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.13234758377075,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\太上三元飞星冠禁金书玉箓图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "伏乞神光密照，得超不死之门。 至圣垂恩，愿赐之卫，辟除灾害，共道合然。 次三啄齿，阴思五星。 次思左手中岁星，色如青宝。 次思右手中太白星，色如白宝。 次思顶上荧惑星，色如火珠。 次思心中镇星，色如黄金。 次思足下辰星，色如黑玉。 皆神光洞照一身。 阴思咒曰：五星镇形，光照玄冥。 千神万圣，护我真灵。 巨天猛兽，制伏五兵。 五天魔鬼，亡身灭形。 所在之处，万神奉迎。 急急如律令。 次冠五斗讫，却思五星，於我身上变化。 次思左手中岁星，变为风轮。 顶上荧惑星，变为猛火绕一身。 思镇星在心前，化为黄金锁甲，缠绕一身。 思右手中太白星，变为金刚神剑，剑有锋刃，皆放炎光。 思足下辰星，忽变江水，须臾成海，中有五龙出见。 次思神讫，而阴咒曰：五星镇形，光照火精。 保我五体，镇我万灵。 六天魔鬼，动即斩形。 急急如律令。 次思天罡大煞，气从天罡上来，其气内黄外黑，直至吾前。 吾以鼻吸之十二息，而阴咒曰：大煞真气，内阴外阳。 保我躯命，除邪辟殃。 山精魍魉，土地地强□。 赤口白舌，虫蛇虎狼。 害我者死，谋我者亡。 爱我者吉，奉我者昌。 万神摧碎，伏匿天刚。 急急如律令。 将左手抚心，右手摩顶。 暗思□星在右手，□星在左手，□星在胸前。 而阴咒曰：魁星大煞，镇我心原。 外辟五兵，内除五瘟。 当我者迷，谋我者凶。 逆鬼凶人，於我何论。 急急如律令。 将左手抚心，右手指天阴。 思魁星在右手，□星在左手，□星在头上。 咒曰：阳明真气，冠我朱阳。 辟除万害，迸及逆□。 盗贼凶人，虫蛇虎狼。 谋我者死，害我者亡。 赤口白舌，伏匿魁罡。 急急如律令。 反右手指背对心，左手指心。 阴思魁星在右手，□在头上，□星在左手。 而阴咒曰：明明正气，主在天魁。 镇在绛宫，辟除非灾。 何神敢住？ 何鬼敢来？ 千圣万鬼，伏我天罡。 急急如律令。 两手扶三台星为华盖，阴思上台星官虚精，在．吾左手中。 次思中台星官六淳，下台星官曲生，在右手两膝下。 吾头戴华盖，足履魁是。 地网八极，天罗四张。 北斗落死，除灾灭殃。 南斗上生，寿命延长。 所求如愿，所在吉昌。 中外强□，动即尽亡。 急急如律令。 冠诸星毕，每夜卧时，阴思此咒，先於床前乘虚禹步或九迹步。 禹步 九迹步 临卧时，林前阴咒曰：反履背床，除邪灭殃。 天帝狱吏，禁鬼夜行。 重即腰斩，轻即全生。 不轻不重，截鬼两肱。 右月左日，各去我眉间二寸五分。 北斗七星，周围一室。 急急如律令。",
      "translated_text": "Prostrate, I beseech the divine radiance to secretly illuminate me, that I may transcend the gate of deathlessness. May the Most Sagely bestow grace, grant me protection, ward off calamities, and harmonize with the Dao in perfect accord.\n\nNext, tap the teeth three times and inwardly visualize the Five Stars.\nFirst, envision Jupiter in the left hand, its hue like a blue jewel.\nNext, envision Venus in the right hand, its hue like a white jewel.\nThen, envision Mars above the crown, its hue like a fiery pearl.\nNext, envision Saturn within the heart, its hue like yellow gold.\nFinally, envision Mercury beneath the feet, its hue like black jade.\nLet their divine radiance thoroughly illuminate the entire body.\n\nInwardly recite the incantation:\n*\"The Five Stars guard my form,\ntheir light illumines the mysterious darkness.\nA thousand spirits and ten thousand sages\nshield my true spirit.\nFierce beasts of heaven,\nsubdue the five weapons.\nDemons of the five heavens,\nperish in body and vanish in form.\nWherever I dwell,\nall spirits shall attend me.\"*\nSwiftly, swiftly, as decreed by law.\n\nOnce the Five Dippers are crowned, then visualize the Five Stars transforming upon my body.\nEnvision Jupiter in the left hand, transmuting into a wind wheel.\nMars above the crown, transforming into fierce fire encircling the body.\nSaturn before the heart, changing into golden chainmail wrapped around the body.\nVenus in the right hand, becoming a vajra divine sword, its blade and edge ablaze with flame.\nMercury beneath the feet, suddenly shifting into a river that in an instant becomes a sea, from which five dragons emerge.\n\nAfter visualizing the spirits, inwardly recite the incantation:\n*\"The Five Stars guard my form,\ntheir light illumines the fire spirit.\nPreserve my five limbs,\nguard my ten thousand spirits.\nDemons of the six heavens,\nmove and be slain in form.\"*\nSwiftly, swiftly, as decreed by law.\n\nNext, envision the Great Killing Star of the Celestial Stem, its qi descending from the stem—internally yellow, externally black—until it reaches before me. With the nose, inhale it for twelve breaths, then inwardly recite the incantation:\n*\"True qi of the Great Killing,\ninternally yin, externally yang.\nPreserve my body and life,\ndispel evil and avert misfortune.\nMountain spirits and goblins,\nearth gods and strong demons □.\nCrimson mouths and white tongues,\ninsects, snakes, tigers, and wolves.\nThose who harm me shall die,\nthose who plot against me shall perish.\nThose who cherish me shall prosper,\nthose who serve me shall flourish.\nTen thousand spirits shattered,\nsubdued beneath Heaven’s firmament.\"*\nSwiftly, swiftly, as decreed by law.\n\nPlace the left hand upon the heart and the right hand upon the crown.\nInwardly envision □ star in the right hand, □ star in the left hand, □ star before the chest.\nThen inwardly recite the incantation:\n*\"The Great Killing Star of the Celestial Stem\nguards the origin of my heart.\nExternally repels the five weapons,\ninternally dispels the five pestilences.\nThose who oppose me shall be deluded,\nthose who scheme against me shall meet misfortune.\nRebellious ghosts and wicked men,\nwhat can they do to me?\"*\nSwiftly, swiftly, as decreed by law.\n\nPlace the left hand upon the heart and the right hand pointing heavenward in concealment.\nEnvision the Celestial Stem Star in the right hand, □ star in the left hand, □ star above the head.\nRecite the incantation:\n*\"True qi of Yang Brightness\ncrowns my vermilion yang.\nDispels ten thousand harms,\ndrives back rebellious □.\nThieves and wicked men,\ninsects, snakes, tigers, and wolves.\nThose who plot against me shall die,\nthose who harm me shall perish.\nCrimson mouths and white tongues,\nsubdued beneath the Celestial Stem.\"*\nSwiftly, swiftly, as decreed by law.\n\nTurn the right hand to point backward toward the heart, the left hand pointing to the heart.\nInwardly envision the Celestial Stem Star in the right hand, □ above the head, □ star in the left hand.\nThen inwardly recite the incantation:\n*\"Luminous and upright qi,\ndwells in the Celestial Stem.\nGuards the Crimson Palace,\ndispels misfortune and calamity.\nWhat spirit dares remain?\nWhat ghost dares approach?\nA thousand sages and ten thousand ghosts\nsubmit to my Celestial Stem.\"*\nSwiftly, swiftly, as decreed by law.\n\nWith both hands, trace the Three Terraces as a canopy.\nInwardly envision the Upper Terrace Star Officer, Void Essence, in my left hand.\nNext, envision the Middle Terrace Star Officer, Sixfold Purity, and the Lower Terrace Star Officer, Crooked Life, beneath the right hand and both knees.\nMy head wears the canopy, my feet tread the Celestial Stem.\nThe earth’s net spans the eight directions,\nthe heaven’s net stretches in four directions.\nThe Northern Dipper brings death—\ndispels calamity and eradicates misfortune.\nThe Southern Dipper bestows life—\nprolongs lifespan and extends years.\nAll wishes are fulfilled,\nwherever I dwell brings prosperity.\nInternal and external strong □,\nmove and be utterly destroyed.*\nSwiftly, swiftly, as decreed by law.\n\nAfter crowning all the stars, each night before sleeping, inwardly recite this incantation. First, before the bed, perform the Void Yu Step or the Nine-Trace Step.\nAt the moment of retiring, before the grove, inwardly recite the incantation:\n*\"Step backward from the bed,\ndispel evil and eradicate misfortune.\nHeavenly Emperor’s prison wardens,\nforbid ghosts from wandering at night.\nFor grave offenses, waist severance;\nfor minor offenses, preservation of life.\nNeither grave nor minor,\nsever the ghost’s two arms.\nMoon to the right, sun to the left,\neach two inches and five fen from my brow.\nThe Northern Dipper’s seven stars\nencircle the chamber.\"*\nSwiftly, swiftly, as decreed by law.",
      "overlap_context": "ar, mingled with filth and stench, defiled by the clamor of dust, a remnant breath in a rotting husk, a life of blood and foulness. Yet I have been bathed in the mysterious shade and have returned to this remnant life. By good fortune, through generations of revering the true, blessings have been left to later descendants. How dare I, with my foul and filthy self, unafraid of heavenly might, delight in the Dao and rejoice in immortality, offering utmost sincerity to the profound and mysterious?\"",
      "start_char": 1300,
      "end_char": 2276,
      "start_sentence": 72,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.45433235168457,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\太上三元飞星冠禁金书玉箓图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "老君告道陵曰：汝行大事，须修拜星之法。 若不知其法，天灵不护。 邪魔来伤，恶人谋害。 天行毒气，兵甲时起。 因兹染伤，及至无常。 宜修炼此上妙之法，当勉也，不得传与积恶之人。 轻泄真文，殃及己身，上延七祖，慎之慎之。 老君曰：此者群仙之法，子能行之，当得长生久视世间。 人不能长生者，为天魔结其罪也。 若修炼我法，必得无诸灾横，寿命长延，福流於后无穷。 若非人示之，殃及七祖，身填黄河。 言毕，道陵敬受教戒，稽首奉行。 步九宫斗诀 斗要妙，十二神。 乘天罡，威武陈。 气彷佛，如浮云。 七变动，止应天。 知变化，右吉凶。 步斗宿，天关前。 入六律，持四禁。 傍天英，履天任。 拥天柱，接天心。 从此度，登天禽。 倚天辅，望天冲。 入天内，出天蓬。 斗道通，刚柔济。 天富禄，清泠渊。 入杳冥，千万岁。 太上三元飞星冠禁金书玉箓图竟",
      "translated_text": "The Lord Lao addressed Dao Ling, saying: \"In conducting great affairs, you must cultivate the method of worshipping the stars. If you do not know this method, the celestial spirits will not protect you. Malevolent demons will come to harm you, and wicked people will plot against you. Heaven-sent pestilential qi will arise, and weapons and warfare will erupt in due time. Through these, you may fall ill and even meet your end. You should diligently refine this most wondrous method. Be steadfast in this, and do not transmit it to those who accumulate evil. To carelessly divulge the true scripture will bring calamity upon yourself, extending even to your seven generations of ancestors. Be cautious, be ever cautious.\"\n\nThe Lord Lao said: \"This is the method of the host of immortals. If you can practice it, you shall attain longevity and enduring vision in the world. Those who cannot achieve longevity do so because heavenly demons have bound them with sin. If you refine my method, you will surely be free from all disasters and misfortunes, your lifespan will be prolonged, and blessings will flow endlessly to your descendants. If you reveal it to the unworthy, calamity will befall your seven generations, and your own body will fill the Yellow River.\"\n\nUpon concluding, Dao Ling respectfully received the teachings and admonitions, bowing his head in reverence to put them into practice.\n\n**The Nine-Palace Dipper Formula**\n\nThe Dipper’s essence is wondrous, the twelve spirits.\nRiding the Celestial Stem, martial might arrays.\nQi drifts and shifts, like floating clouds.\nSeven transformations move, ceasing only in accord with Heaven.\nKnow their changes, and the auspicious and inauspicious will be clear to your right.\nStep through the Dipper’s lodges, before the Celestial Pass.\nEnter the Six Pitches, uphold the Four Prohibitions.\nFlank Heavenly Flower, tread Heavenly Task.\nEmbrace Heavenly Pillar, connect with Heavenly Heart.\nFrom here, ascend to Heavenly Bird.\nLean on Heavenly Auxiliary, gaze toward Heavenly Surge.\nEnter Heavenly Inner, exit Heavenly Peril.\nThe Dipper’s Dao flows, hard and soft harmonize.\nHeaven bestows wealth and emolument, the clear and cold abyss.\nEnter the profound darkness, for a thousand myriad years.\n\nHere ends *The Supreme Three Primes’ Flying Star Coronation Prohibitions, Golden Writ, and Jade Register Diagram*.",
      "overlap_context": ", before the grove, inwardly recite the incantation:\n*\"Step backward from the bed,\ndispel evil and eradicate misfortune.\nHeavenly Emperor’s prison wardens,\nforbid ghosts from wandering at night.\nFor grave offenses, waist severance;\nfor minor offenses, preservation of life.\nNeither grave nor minor,\nsever the ghost’s two arms.\nMoon to the right, sun to the left,\neach two inches and five fen from my brow.\nThe Northern Dipper’s seven stars\nencircle the chamber.\"*\nSwiftly, swiftly, as decreed by law.",
      "start_char": 2277,
      "end_char": 2650,
      "start_sentence": 148,
      "end_sentence": 176,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.997700929641724,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\太上三元飞星冠禁金书玉箓图.txt",
        "category": "灵图类"
      }
    }
  ]
}