{
  "source_id": "太上清静元洞真文玉字妙经",
  "source_file": "chunked_daozang\\太上清静元洞真文玉字妙经.json",
  "total_chunks": 3,
  "total_original_chars": 1852,
  "total_translated_chars": 12224,
  "total_translation_time": 70.43567728996277,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\太上清静元洞真文玉字妙经.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Supreme Clarity Primordial Cavern True Writ of Jade Characters Sublime Scripture**\n\n**Scripture Title:** *The Supreme Clarity Primordial Cavern True Writ of Jade Characters Sublime Scripture*\nAuthor unknown, likely composed during the Sui or Tang dynasties. Teaches the method of transcribing the True Writ of Jade Characters to dispel calamities. One scroll.\n\n**Source of Base Text:** *Daoist Canon of the Orthodox Unity*, Supreme Mystery Section.\n\n---\n\n**The Supreme Clarity Primordial Cavern True Writ of Jade Characters Sublime Scripture**\n\nThe August Heaven Supreme Lord Emperor, the Limitless Supreme Primordial Lord—this is the Lord of the Dao, the King Father of the East, the qi of Azure Yang, the forebear of the myriad spirits. The Non-Action Western Queen Mother is the qi of Grand Yin, born of spontaneity. The August Heaven Supreme Emperor, the Supreme Unity Primordial Lord, is the star at the center of heaven.\n\nThis Lord resolves the concealed writs, the concealed kings: Han Chang, Li Jian, Piao Rongzi, Chi Chengzi, Shouzi, Guo Liangqiangzi, Xuanzǐ, Wang Shenzu, Taizengzi, Yī, the great sea drowning in waters, seeking Ying, following Kong Tong, Lu Huangzi, Huangming Guangzi, Yinyou Qiongying, Gongzi, Zhutian Shi Yiying, Dancheng Chengyi, Qixuanguang, Jianjin Zang, Li Changzi, Xuanguang, Zhongchengzi, Taihe Diande, Li Yuling, Jiao Siye, Gan You, Da Fangboyang, Yuhua, Chen Yuzǐ, Guangdacheng, Chijing Chengzi, Liuqu Wuyou, Yinzi, Qiaozhenzi, Xishe Youyi, Kencheng, Zhongbo Jing’er, Wencheng, Wuyi Wuwei, Guli, Dongshan Jingzhen, Jiaoyuanqi, Biro Xiang, Youwen Tong, Ju Li Zang, Bo Chao Shi, Kuo Daxiang, Xiamen Yu, Huangshen Guo, Xiamen Shen, Jing Tongmen, Zhi Da Xu, Ming Shi Zhang, Yuanchen Liuying, Lingmiao Qianying—all empty, soaring jade-feathered writs, the hundred stars of Mount Huang, the sun-serpent Ru, Yuehua’s mandate, running through Yu’s transformations, the craftsman’s remnants, the mountain’s restraints, the chariot at the utmost pole, the purple ox of Chou Market, the succession of Yuan Fu’s mandate.\n\nOne ascends and descends for nine days; the sun’s primordial unity extends nine tones. Yi Yanma’s mandate, surging upward, excites the rain; the heavens above are tranquil, the passage serene. Zhi Zhen Gongming, the youthful Marquis Lin, Guanghua Dezuo, Xu Shangwang Tingyin, Qiu Ling, Shangying Zhenxu, Han Han Zhengtong, Mingling Taishen, the vast and expansive spirit-immortals descend. Lingzhuzi, the White Horse, Xuantong Xuanwei, the purple-penetrating radiance, the yellow-receiving thoroughfare, the body’s primordial mandate, the flowing blessings of infant moon-essence, the green succession returning essence, repelling poison, warming the body, withering the true, augmenting the cinnabar’s splendor, traversing the earth—□ extending the years, the mandate of dark expeditions, the wisdom of tranquil truth, soaring and ascending, born of stone beams.\n\nThe true taboo: the Xuán constellation nurtures clouds, sprouting from grass roots, the jade grove receives the mandate. From the mouth □□ issues □□: \"If not I, you shall not transcend. If not I, you shall not attain.\" Revolving spirit, exhaling radiance, the jade-splendored body. The Lord descends to the sands, bestowing cinnabar waters, originally issuing from the Three Heavens of Primordial Unity.\n\n---\n\n**Right:** Three hundred ninety characters. The Three Primordials inspect the true concealed writ, resolving the text.\n\n**Celestial Writ Harmonizes with the Mandate:** The Primordial Six Yi participates in knowing the wood’s dissolution, revealing the omen’s form, each part distinct.\n\n**Right:** Postscript talismanic incantations of the Nine Heavens, seventeen characters:\n*Control the constricted heavens, pacify the heart; the enlightened master’s heart, the three bodies’ names, the heart conjoined with the Nine Sons, the Great Square’s baleful omens—none surpass the perfected. Thus the blade’s balefulness, the heavens too, precede the heavens. Cherish the Fire Bird, bind the heart, the Primordial World’s yin radiance.*\n\n**Right:** *Dragon Flight* concealed incantation on plain silk, thirty-seven characters:\n*Chaos-opening luminous guide, sudden gasping orchid net, rejoicing in transcendent catalpa, profound abyss plucking, perusing the foundation, bamboo slips level and serene, pitying knowledge, equal brilliance, flame abyss valley replete, dharma synthesis penetrating paulownia, radiant roaming prosperity, limpid pearl’s reflection, the master’s rejoicing elder, clouds extending, silent vase’s play, soaring above, feathered shadow’s bright extension, orchid’s luxuriance narrating, resplendent awaiting, measured heights, immortal prosperity frozen, traversing the Dark Radiance, ascending the Flourishing Cloud, universal immortal waves, journeying to the fan’s expanse, swift azure revering rosy clouds, grand feathered retention, nephew’s ascension, penetrating numinous captor, purple essence pine clouds, reverent tranquility, orchid mushrooms.*\n\nThirty-two characters belong to the *Orthodox Heavenly Names*:\n*Ten Directions’ Orthodox Taboos, Four Directions’ Orthodox Taboos, Nine Stars’ Orthodox Taboos, Seven Stars’ Orthodox Taboos, Five Stars’ Orthodox Taboos, True Heaven Three, Twenty-Four Perfected, Eight Births, Eight Deaths.*\n\n**Right:** One hundred ten *Lords of the Upper Clarity* taboos:\n*Eastern Marchmount Heavenly Mystery, taboo: Origin Wind, style: Jade Prosperity Righteous Radiance.*\n*Eastern Azure Emperor, Year Star’s Void Sovereign Son, Azure Emperor’s Dark Radiance Long Mystery Mansion, ingesting the Azure Emperor’s essence, chanting the true writ thrice.*\n\n*Southern Marchmount Heavenly □, taboo: Open Luminance, style: Alas, Summoning Generation.*\n*Southern Vermilion Emperor, Mars Star’s Void Sovereign Son, Vermilion Emperor’s Heavenly Origin Longevity Mansion, ingesting the Vermilion Emperor’s essence, chanting the true writ thrice.*\n\n*Western Marchmount Heavenly Void, taboo: Luminous Sovereign, style: Luxuriant Grove.* *This taboo belongs to the lower talisman.*\n*Western White Emperor, Venus Star’s White Treasury Son, White Emperor’s Primordial Radiance Longevity Mansion, ingesting the White Emperor’s essence, chanting the true writ thrice.*\n\n*Northern Marchmount Primordial Perfection, taboo: Aid Initiation, style: Meng’s Exquisite Ice Jade.*\n*Northern Black Emperor, Mercury Star’s Yu Qiang Lord, Black Emperor’s Primordial Luminance Dark Palace Mansion, ingesting the Black Emperor’s essence, chanting the true writ thrice.*\n\n*Central Marchmount Flourishing Yang, taboo: Meng Ying, style: Forest Mound.*\n*Supreme Central Yellow Emperor, Saturn Star’s Yang Essence Lord, Yellow Emperor’s Primordial Yang Mansion, ingesting the Yellow Emperor’s essence, chanting the true writ thrice.*\n\n**Right:** Explication of the Five Talismans within the staff, decoding the *Numinous Treasure’s* *Tally Talisman* characters:\n*Flame luminous numinous majesty, profound floating ultimate, scorching red whirlwind crossbow penetrating, classed primordial clan, containing the pivot’s axis, superior metal prosperity, opening radiance, lunar essence treasure, black node numinous assembly, concealed marquis’ bureau, treasure taboo true incantation decoding the child.*\n\n**Right:** Thirty-three characters, all the Five Directions’ *Orthodox Treasure Taboos*.\n*Secret names without place unused—thus when inscribing talismans for transformation, journeying eastward, invoke the Eastern Direction’s true taboo; nothing fails to be repelled. Journeying southward, invoke the Southern Direction’s treasure taboo true name; nothing fails to be repelled.*\n\nExplication of the transmission of *Upper Perfected Talisman Characters’* method and measure: those who attain the Dao are not merely *Middle Immortals*.\n*From the* Crimson Writ’s Upper Chapter.\n\n**Right:** Decoding the *Numinous Treasure’s Tally Talisman* characters.\nDecoding the *Eight Radiant Records’* talismanic incantations:\n*Loan taboo: Ancestral Maiden; Tripod taboo: Hook; Stele taboo: Shattered Torso; Crystal taboo: Zhang Tiger; Together taboo: Dark Wind.*\n\n**Right:** These are the *Numinous Treasure’s Three Sections’* *Five Directions’ Demon Kings’* true surnames and names. The method’s lodged mysterious names—those of the *Eastern Florescence Purple Palace’s* *Azure Record*—are transmitted to attaining Daoists, not to *Middle Immortals*.\nWhen journeying eastward, silently intone the *Azure Heaven Demon King’s* surname and name to dispel balefulness and avert calamity. When journeying southward, do likewise. For those journeying in the four seasons’ months, intone the Central Direction. When journeying westward, invoke the Western Direction’s names. When journeying northward, invoke the Northern Direction’s names. For all five directions’ comings and goings, inscribe talismans likewise. Those who transmit lightly face the *Wind Blade’s* trial.\n\n*Cavernous Mystery Writ, Nine Heavens Perfected, Three-Five Concealed, Fourteen Words, Two-Seven Depart Six-Eight.*\n*Former lives’ womb transformations, flowing golden primordial realm, unflourishing bodily virtue, already bound to divine immortals. Briefly traversing the Five Sufferings’ courts, former lives possess karmic affinity. In the empty pavilion, plain silk is arrayed; may the Eight Difficulties’ bodies be delivered, turbid qi scoured away, together frolicking with the Upper Perfected. Six Perfections engender Brahmanic traces; the Utmost Perfected emerges from the Void Mystery. Empty cavern facing cloudy empyrean, gazing upward to the Ten Poles’ guests. Forms receive the Heavenly Honored One’s aspect, boundlessly ascending to the worthy. The Supreme’s Three Heavens unite with the Seven Treasures to pacify the numinous.*\n\nThese *Three Sections’* *Eight Radiant Talismans’* true incantations deliver those whose lodged names are immortal; they are not recklessly transmitted to the unfaithful, facing the *Wind Blade’s* trial. The *Three Sections’* *Eight Radiant Records’* *Thirty-Two Heavens’ Treasure Writs* are methods for delivering those who attain the Dao, not transmitted to *Lower Immortals*. Unless one’s myriad kalpas’ cyclic revolutions and present life’s good affinity converge, the multitude does not behold these treasure incantations. One must select the proper person for transmission. Transmission must find its proper person. The true incantations emerge from the scriptural scrolls.\n\n**Right:** These *Three Sections’* *Eight Radiant Talismans* comprise ninety-six talismans. The incantations emerge from the *Minor Kalpa* scrolls.\n\nMoreover, the *Supreme’s Three Heavens United with the Seven Treasures to Pacify the Numinous*, ten characters, are the *Eight Radiant* postscripts’ great talismanic true incantations:\n*Great illumination transforms immortals, returning to the origin to dissolve evil. The hun-spirit penetrates firm rectitude; myriad evils submit in assent. The Controller of Destinies fixes life; the august spirit pacifies the po. If baleful transgressions exist, all are consigned to the Dark Obscurity. The Great One transforms the Six Harmonies; the Five Spirits assist the Mud Pill. Seven accumulations extinguish the Three Paths; blood corpses block the lower passes. Three collars face the Imperial Perfected; uproot the placenta tree’s roots. The Elder is styled Divine Ancestor; the same-hearted Primordial Plain Lord. The Heavenly Sovereign enters the Grand Clarity; the Five Elders present the talismanic writ. Generation after generation ascends the Feathered Palace; the resplendent flower’s solar chariot. The Primordial King initiates luminous essence, securing my root life gate. Protecting and assisting, the green qi circulates; return to the upper valley’s lower mystery. The Dark Radiance reflects body and spirit, morning crossing the Supreme’s wheel. Sun and moon conjoin the jade collar; years follow the two dawns’ division. Within the cinnabar writ’s jade hall, one’s position is as the Supreme Lord. On the left, the Feathered Terrace’s child is engraved; on the right, the Golden Countenance Immortal is raised.*\n\nThe *Supreme Clarity’s Primordial Cavern Divine Writ of Jade Characters, Wondrous Scripture of the Dao* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上清静元洞真文玉字妙经 经名：太上清静元洞真文玉字妙经。 撰人不详，似出於隋唐。 教人书写真文玉字消灾之法。 一卷。 底本出处：《正统道藏》太玄部。 太上清静元洞真文玉字妙经 皇天太上帝君无极太上元君者道君东之王父者青阳之气万神之先无为西王母太阴之气生在自然皇天上帝太一元君者天中央星是君解偃文偃王汉昌李监漂融子赤成子收子过梁强子玄子王神祖太曾子一大海溺水寻之英随孔通卢黄子荒命光子音由穷英公孔子柱天士贻英丹成承翼起玄女光坚紧藏李常子玄光仲成子太和典德李玉灵角思耶干酉大方伯阳郁华陈预子广大成赤精成子六曲务犹尹子乔真子锡射有邑肯成仲伯景饵文成五意无为古历东山静真交元气碧罗香幽文通鞠历藏伯朝使廓大乡侠门御黄神过侠门神静通门智达旭命是章元辰流影灵妙钱英皆空飞琼羽章百星山黄必日蛇儒岳华命走通禹易工款残山制轩在极逐勿紫丑市代元馥纪命一上下九日日元一长九音乙延马命上激雨上天安通静智真恭命童侯林光华德祚旭上王庭音丘灵上影真虚汉含正童冥灵太神谱恢廓灵真人降陵珠子白马玄通玄微通身紫度炎光黄承彻身玄命益祚流婴月精青代还精却毒温身枯真益华丹行地□延年度命幽征智静真飞腾生石梁真讳玄星宿养云生草根玉林受命位口口出口中非我尔不仙非我尔不成回灵吐曜玉华之身君降沙与丹水本出元三天 右三百九十字三元检真隐书解文 天文合符命元六乙参知木解兆形一一分",
      "translated_text": "**The Supreme Clarity Primordial Cavern True Writ of Jade Characters Sublime Scripture**\n\n**Scripture Title:** *The Supreme Clarity Primordial Cavern True Writ of Jade Characters Sublime Scripture*\nAuthor unknown, likely composed during the Sui or Tang dynasties. Teaches the method of transcribing the True Writ of Jade Characters to dispel calamities. One scroll.\n\n**Source of Base Text:** *Daoist Canon of the Orthodox Unity*, Supreme Mystery Section.\n\n---\n\n**The Supreme Clarity Primordial Cavern True Writ of Jade Characters Sublime Scripture**\n\nThe August Heaven Supreme Lord Emperor, the Limitless Supreme Primordial Lord—this is the Lord of the Dao, the King Father of the East, the qi of Azure Yang, the forebear of the myriad spirits. The Non-Action Western Queen Mother is the qi of Grand Yin, born of spontaneity. The August Heaven Supreme Emperor, the Supreme Unity Primordial Lord, is the star at the center of heaven.\n\nThis Lord resolves the concealed writs, the concealed kings: Han Chang, Li Jian, Piao Rongzi, Chi Chengzi, Shouzi, Guo Liangqiangzi, Xuanzǐ, Wang Shenzu, Taizengzi, Yī, the great sea drowning in waters, seeking Ying, following Kong Tong, Lu Huangzi, Huangming Guangzi, Yinyou Qiongying, Gongzi, Zhutian Shi Yiying, Dancheng Chengyi, Qixuanguang, Jianjin Zang, Li Changzi, Xuanguang, Zhongchengzi, Taihe Diande, Li Yuling, Jiao Siye, Gan You, Da Fangboyang, Yuhua, Chen Yuzǐ, Guangdacheng, Chijing Chengzi, Liuqu Wuyou, Yinzi, Qiaozhenzi, Xishe Youyi, Kencheng, Zhongbo Jing’er, Wencheng, Wuyi Wuwei, Guli, Dongshan Jingzhen, Jiaoyuanqi, Biro Xiang, Youwen Tong, Ju Li Zang, Bo Chao Shi, Kuo Daxiang, Xiamen Yu, Huangshen Guo, Xiamen Shen, Jing Tongmen, Zhi Da Xu, Ming Shi Zhang, Yuanchen Liuying, Lingmiao Qianying—all empty, soaring jade-feathered writs, the hundred stars of Mount Huang, the sun-serpent Ru, Yuehua’s mandate, running through Yu’s transformations, the craftsman’s remnants, the mountain’s restraints, the chariot at the utmost pole, the purple ox of Chou Market, the succession of Yuan Fu’s mandate.\n\nOne ascends and descends for nine days; the sun’s primordial unity extends nine tones. Yi Yanma’s mandate, surging upward, excites the rain; the heavens above are tranquil, the passage serene. Zhi Zhen Gongming, the youthful Marquis Lin, Guanghua Dezuo, Xu Shangwang Tingyin, Qiu Ling, Shangying Zhenxu, Han Han Zhengtong, Mingling Taishen, the vast and expansive spirit-immortals descend. Lingzhuzi, the White Horse, Xuantong Xuanwei, the purple-penetrating radiance, the yellow-receiving thoroughfare, the body’s primordial mandate, the flowing blessings of infant moon-essence, the green succession returning essence, repelling poison, warming the body, withering the true, augmenting the cinnabar’s splendor, traversing the earth—□ extending the years, the mandate of dark expeditions, the wisdom of tranquil truth, soaring and ascending, born of stone beams.\n\nThe true taboo: the Xuán constellation nurtures clouds, sprouting from grass roots, the jade grove receives the mandate. From the mouth □□ issues □□: \"If not I, you shall not transcend. If not I, you shall not attain.\" Revolving spirit, exhaling radiance, the jade-splendored body. The Lord descends to the sands, bestowing cinnabar waters, originally issuing from the Three Heavens of Primordial Unity.\n\n---\n\n**Right:** Three hundred ninety characters. The Three Primordials inspect the true concealed writ, resolving the text.\n\n**Celestial Writ Harmonizes with the Mandate:** The Primordial Six Yi participates in knowing the wood’s dissolution, revealing the omen’s form, each part distinct.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 571,
      "start_sentence": 0,
      "end_sentence": 9,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.706279754638672,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\太上清静元洞真文玉字妙经.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "右九天谱录后符诀，一十七字 制屯天安心明师心三身名心合九子太方凶无上人然刀凶天亦前天爱火鸟束心元世阴光 右龙飞尺素隐诀三十七字 混洞开明导沌卒喘兰罗勒罗庆特越梓泓渊拔览造基简平宁怜知齐耀爓渊谷盈法综通桐景游昌澄珠映师庆翁京云延罂寂范戏飞上婆生羽影明延兰莽桩述映艳候度高仙昌冻度玄景度生勃崇云普仙波乡诣扇扈迅碧钦霞泰羽留甥升通灵虏紫英松云恭静遂兰芝 三十二字属正天名　十方正讳　四方正讳　九星正讳　七星正讳　五星正讳　真天三　二十四真人　八生　八死 右上清百一十道君讳。 东岳天玄，讳始风，字玉昌义光。 东方青帝，岁星虚皇子，青帝玄光长玄府，服青帝之精，咏真文三通。 南岳天□，讳开明，字吁唤代。 南方赤帝，荧惑星虚皇子，赤帝天元长生府，服赤帝之精，咏真文三通。 西岳天虚，讳明皇，字瑈林。 此讳属下符。 西方白帝，太白星白藏子，白帝元曜长寿府，服白帝之精，咏真文三通。 北岳元真，讳济启，字孟瑰冰琅。 北方黑帝，辰星虞强君，黑帝元明玄宫府，服黑帝之精，咏真文三通。 中岳华阳，讳孟瑛，字林丘。 太上中央黄帝，镇星阳精君，黄帝元阳府，服黄帝之精，咏真文三通。 右解杖中五符真诀，解灵宝策符字。 爓明灵威仰洞浮极炎赤飘弩通班元氏含枢纽上金昌开曜魄宝黑节灵会隐侯局宝讳真诀诀解子。 右三十三字，并是五方正宝讳。 秘名无处不用，所以书符为转者，东行呼东方真讳，无所不辟，南行呼南方宝讳真名，无所不辟。 解传上真符字法度，应得道之人，不度中仙也。 出赤书上篇。 右解灵宝策符字。 解八景录符诀 贷讳宗妞，鼎讳勾，碑讳破胴，晃讳张虎，由共讳玄风。 右是灵宝三部录上五方魔王姓真名，法度宿有玄名，东华紫宫中青录上者，得道之人，不传中仙道士。 若行东方者，口阴咒青天魔王姓名，除凶去殃。 若南行者，亦尔。 四季月行者，咒中央。 若西行，唤西方姓名。 若北行，唤北方姓名。 五方行来书亦尔。 轻传者，有风刀之考也。 洞玄文，九天真，三五隐，十四言，二七去六八。 前生胎化，流金元国，未盛身德，已系神仙。 暂过五苦庭，前身有宿缘，虚亭设中素，愿度八难身，荡除秽浊气，相与戏上真。 六度生梵迹，至真出虚玄。 空洞向云霄，仰秀十极宾。 形受天尊相，辽辽造登贤。 太上三天合同七宝镇灵 此三部八景符真诀，度宿有仙名者，不妄传不信之人，有风刀之考。 三部八景录三十二天宝书，法应度得道之人，不传下仙。 自非万劫轮转，善缘今生，众不见此宝诀。 可择其人而传。 传必得其人。 真诀出经卷中。 右三部八景符，合九十六符。 诀出小劫卷中。 又太上三天合同七宝镇灵十字，是八景后大符真诀。 大明化仙，回元解恶。 魂通刚正，万恶伏诺。 司命定生，皇神安魄。 若有凶犯，悉付玄霍。 太一变六合，五神辅泥丸。 七积灭三涂，血尸塞下关。 三衿对帝真，拔斫胞树根。 丈人号神宗，同心元素君。 天皇入太清，五老奉符文。 世世登羽宫，重华日中轩。 元王始明精，固我本命门。 保弼运绿气，归上谷下玄。 玄景映形神，朝济太上轮。 日月并玉衿，年随二晨分。 丹书玉堂内，位为无上君。 左镌羽台子，右提金颜仙。",
      "translated_text": "**Right:** Postscript talismanic incantations of the Nine Heavens, seventeen characters:\n*Control the constricted heavens, pacify the heart; the enlightened master’s heart, the three bodies’ names, the heart conjoined with the Nine Sons, the Great Square’s baleful omens—none surpass the perfected. Thus the blade’s balefulness, the heavens too, precede the heavens. Cherish the Fire Bird, bind the heart, the Primordial World’s yin radiance.*\n\n**Right:** *Dragon Flight* concealed incantation on plain silk, thirty-seven characters:\n*Chaos-opening luminous guide, sudden gasping orchid net, rejoicing in transcendent catalpa, profound abyss plucking, perusing the foundation, bamboo slips level and serene, pitying knowledge, equal brilliance, flame abyss valley replete, dharma synthesis penetrating paulownia, radiant roaming prosperity, limpid pearl’s reflection, the master’s rejoicing elder, clouds extending, silent vase’s play, soaring above, feathered shadow’s bright extension, orchid’s luxuriance narrating, resplendent awaiting, measured heights, immortal prosperity frozen, traversing the Dark Radiance, ascending the Flourishing Cloud, universal immortal waves, journeying to the fan’s expanse, swift azure revering rosy clouds, grand feathered retention, nephew’s ascension, penetrating numinous captor, purple essence pine clouds, reverent tranquility, orchid mushrooms.*\n\nThirty-two characters belong to the *Orthodox Heavenly Names*:\n*Ten Directions’ Orthodox Taboos, Four Directions’ Orthodox Taboos, Nine Stars’ Orthodox Taboos, Seven Stars’ Orthodox Taboos, Five Stars’ Orthodox Taboos, True Heaven Three, Twenty-Four Perfected, Eight Births, Eight Deaths.*\n\n**Right:** One hundred ten *Lords of the Upper Clarity* taboos:\n*Eastern Marchmount Heavenly Mystery, taboo: Origin Wind, style: Jade Prosperity Righteous Radiance.*\n*Eastern Azure Emperor, Year Star’s Void Sovereign Son, Azure Emperor’s Dark Radiance Long Mystery Mansion, ingesting the Azure Emperor’s essence, chanting the true writ thrice.*\n\n*Southern Marchmount Heavenly □, taboo: Open Luminance, style: Alas, Summoning Generation.*\n*Southern Vermilion Emperor, Mars Star’s Void Sovereign Son, Vermilion Emperor’s Heavenly Origin Longevity Mansion, ingesting the Vermilion Emperor’s essence, chanting the true writ thrice.*\n\n*Western Marchmount Heavenly Void, taboo: Luminous Sovereign, style: Luxuriant Grove.* *This taboo belongs to the lower talisman.*\n*Western White Emperor, Venus Star’s White Treasury Son, White Emperor’s Primordial Radiance Longevity Mansion, ingesting the White Emperor’s essence, chanting the true writ thrice.*\n\n*Northern Marchmount Primordial Perfection, taboo: Aid Initiation, style: Meng’s Exquisite Ice Jade.*\n*Northern Black Emperor, Mercury Star’s Yu Qiang Lord, Black Emperor’s Primordial Luminance Dark Palace Mansion, ingesting the Black Emperor’s essence, chanting the true writ thrice.*\n\n*Central Marchmount Flourishing Yang, taboo: Meng Ying, style: Forest Mound.*\n*Supreme Central Yellow Emperor, Saturn Star’s Yang Essence Lord, Yellow Emperor’s Primordial Yang Mansion, ingesting the Yellow Emperor’s essence, chanting the true writ thrice.*\n\n**Right:** Explication of the Five Talismans within the staff, decoding the *Numinous Treasure’s* *Tally Talisman* characters:\n*Flame luminous numinous majesty, profound floating ultimate, scorching red whirlwind crossbow penetrating, classed primordial clan, containing the pivot’s axis, superior metal prosperity, opening radiance, lunar essence treasure, black node numinous assembly, concealed marquis’ bureau, treasure taboo true incantation decoding the child.*\n\n**Right:** Thirty-three characters, all the Five Directions’ *Orthodox Treasure Taboos*.\n*Secret names without place unused—thus when inscribing talismans for transformation, journeying eastward, invoke the Eastern Direction’s true taboo; nothing fails to be repelled. Journeying southward, invoke the Southern Direction’s treasure taboo true name; nothing fails to be repelled.*\n\nExplication of the transmission of *Upper Perfected Talisman Characters’* method and measure: those who attain the Dao are not merely *Middle Immortals*.\n*From the* Crimson Writ’s Upper Chapter.\n\n**Right:** Decoding the *Numinous Treasure’s Tally Talisman* characters.\nDecoding the *Eight Radiant Records’* talismanic incantations:\n*Loan taboo: Ancestral Maiden; Tripod taboo: Hook; Stele taboo: Shattered Torso; Crystal taboo: Zhang Tiger; Together taboo: Dark Wind.*\n\n**Right:** These are the *Numinous Treasure’s Three Sections’* *Five Directions’ Demon Kings’* true surnames and names. The method’s lodged mysterious names—those of the *Eastern Florescence Purple Palace’s* *Azure Record*—are transmitted to attaining Daoists, not to *Middle Immortals*.\nWhen journeying eastward, silently intone the *Azure Heaven Demon King’s* surname and name to dispel balefulness and avert calamity. When journeying southward, do likewise. For those journeying in the four seasons’ months, intone the Central Direction. When journeying westward, invoke the Western Direction’s names. When journeying northward, invoke the Northern Direction’s names. For all five directions’ comings and goings, inscribe talismans likewise. Those who transmit lightly face the *Wind Blade’s* trial.\n\n*Cavernous Mystery Writ, Nine Heavens Perfected, Three-Five Concealed, Fourteen Words, Two-Seven Depart Six-Eight.*\n*Former lives’ womb transformations, flowing golden primordial realm, unflourishing bodily virtue, already bound to divine immortals. Briefly traversing the Five Sufferings’ courts, former lives possess karmic affinity. In the empty pavilion, plain silk is arrayed; may the Eight Difficulties’ bodies be delivered, turbid qi scoured away, together frolicking with the Upper Perfected. Six Perfections engender Brahmanic traces; the Utmost Perfected emerges from the Void Mystery. Empty cavern facing cloudy empyrean, gazing upward to the Ten Poles’ guests. Forms receive the Heavenly Honored One’s aspect, boundlessly ascending to the worthy. The Supreme’s Three Heavens unite with the Seven Treasures to pacify the numinous.*\n\nThese *Three Sections’* *Eight Radiant Talismans’* true incantations deliver those whose lodged names are immortal; they are not recklessly transmitted to the unfaithful, facing the *Wind Blade’s* trial. The *Three Sections’* *Eight Radiant Records’* *Thirty-Two Heavens’ Treasure Writs* are methods for delivering those who attain the Dao, not transmitted to *Lower Immortals*. Unless one’s myriad kalpas’ cyclic revolutions and present life’s good affinity converge, the multitude does not behold these treasure incantations. One must select the proper person for transmission. Transmission must find its proper person. The true incantations emerge from the scriptural scrolls.\n\n**Right:** These *Three Sections’* *Eight Radiant Talismans* comprise ninety-six talismans. The incantations emerge from the *Minor Kalpa* scrolls.\n\nMoreover, the *Supreme’s Three Heavens United with the Seven Treasures to Pacify the Numinous*, ten characters, are the *Eight Radiant* postscripts’ great talismanic true incantations:\n*Great illumination transforms immortals, returning to the origin to dissolve evil. The hun-spirit penetrates firm rectitude; myriad evils submit in assent. The Controller of Destinies fixes life; the august spirit pacifies the po. If baleful transgressions exist, all are consigned to the Dark Obscurity. The Great One transforms the Six Harmonies; the Five Spirits assist the Mud Pill. Seven accumulations extinguish the Three Paths; blood corpses block the lower passes. Three collars face the Imperial Perfected; uproot the placenta tree’s roots. The Elder is styled Divine Ancestor; the same-hearted Primordial Plain Lord. The Heavenly Sovereign enters the Grand Clarity; the Five Elders present the talismanic writ. Generation after generation ascends the Feathered Palace; the resplendent flower’s solar chariot. The Primordial King initiates luminous essence, securing my root life gate. Protecting and assisting, the green qi circulates; return to the upper valley’s lower mystery. The Dark Radiance reflects body and spirit, morning crossing the Supreme’s wheel. Sun and moon conjoin the jade collar; years follow the two dawns’ division. Within the cinnabar writ’s jade hall, one’s position is as the Supreme Lord. On the left, the Feathered Terrace’s child is engraved; on the right, the Golden Countenance Immortal is raised.*",
      "overlap_context": ", you shall not attain.\" Revolving spirit, exhaling radiance, the jade-splendored body. The Lord descends to the sands, bestowing cinnabar waters, originally issuing from the Three Heavens of Primordial Unity.\n\n---\n\n**Right:** Three hundred ninety characters. The Three Primordials inspect the true concealed writ, resolving the text.\n\n**Celestial Writ Harmonizes with the Mandate:** The Primordial Six Yi participates in knowing the wood’s dissolution, revealing the omen’s form, each part distinct.",
      "start_char": 571,
      "end_char": 1876,
      "start_sentence": 10,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.618685483932495,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\太上清静元洞真文玉字妙经.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "太上清静元洞真文玉字妙经竟",
      "translated_text": "The *Supreme Clarity’s Primordial Cavern Divine Writ of Jade Characters, Wondrous Scripture of the Dao* concludes.",
      "overlap_context": " initiates luminous essence, securing my root life gate. Protecting and assisting, the green qi circulates; return to the upper valley’s lower mystery. The Dark Radiance reflects body and spirit, morning crossing the Supreme’s wheel. Sun and moon conjoin the jade collar; years follow the two dawns’ division. Within the cinnabar writ’s jade hall, one’s position is as the Supreme Lord. On the left, the Feathered Terrace’s child is engraved; on the right, the Golden Countenance Immortal is raised.*",
      "start_char": 1877,
      "end_char": 1893,
      "start_sentence": 76,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.1107120513916016,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\太上清静元洞真文玉字妙经.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}