{
  "source_id": "太上洞玄灵宝三元玉京玄都大献经",
  "source_file": "chunked_daozang\\太上洞玄灵宝三元玉京玄都大献经.json",
  "total_chunks": 12,
  "total_original_chars": 11714,
  "total_translated_chars": 68620,
  "total_translation_time": 316.4578711986542,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Primes, Jade Capital, and Mystic Metropolis of the Great Offering**\n\nThis scripture is titled *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Primes, Jade Capital, and Mystic Metropolis of the Great Offering*. Its author is unknown. Tang dynasty scholar Xuanying’s *Rectification of Heresies* attributes this text to the Daoist Liu Wudai, who composed it in imitation of the *Ullambana Sutra*. The original consists of one fascicle and is included in the *Daoist Canon* (Zhengtong Daozang) under the Cavernous Mystery Division, Texts category, as an annotated edition. There is also a fragmentary manuscript (S. 3061) from Dunhuang without annotations. The present translation is based on the *Daoist Canon* edition, collated with the Dunhuang manuscript.\n\n---\n\n**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Primes, Jade Capital, and Mystic Metropolis of the Great Offering**\n\nThe perfected ones of wondrous origin emerge before the myriad forms; the great sages of profound source transcend beyond the six directions. Neither born nor extinguished, they elude the reach of seeing and hearing; without dependence or action, they surpass the bounds of form and name. Though abstruse and profoundly remote, they respond and transform without limit; though subtle and empty, they truly benefit all beings. When they manifest golden countenances in the golden palaces, they reveal the hundred-thousandfold dharma-body; when they prepare jade tablets in the Jade Capital, they open the essential scriptures of the five directions. None fail to bridge the myriad kinds, awakening the deluded masses, responding to karmic conditions, and adapting their teachings to the moment.\n\nYet now, the wondrous origin of the Numinous Treasure remains serene and equanimous. All sentient beings, however, turn from the real and lose their essence, indulging in empty imaginings and false views. They recklessly indulge the six senses, entangling themselves in the net of desire, thereby sinking into the five turbidities through karmic bonds. Thus, the苦海 (*sea of suffering*) knows no bounds; drifting through the three wretched destinies, birth and death stretch endlessly. Without the guidance of perfected ones, there is no escape from suffering.\n\nOur Great Sage, the Heavenly Worthy, encompasses wisdom in both emptiness and existence, his station surpassing the limits of the cosmos. His Dao pervades the Great Network (Daluo), opening the gate of myriad wonders and penetrating the realm of double mystery. With compassion, he saves beings; ever benevolent, he delivers humanity. Thus, he manifested traces in the Western Land, appearing in the mountain’s south to expound the teachings beneath the mulberry grove. He adorned the sacred with precious jades, sending forth auspicious omens in clouds and mist, scattering numinous fragrance across pure realms. Everywhere, wondrous forms unfolded—smiling, he emitted fivefold radiance; illuminating all heavens, his divine splendor shone across the ten realms.\n\nMoved by the suffering of beings in the evil destinies—oppressed in the three wretched paths, entangled in the eight difficulties—he responded to the inquiries of the Dao Lord, explaining the causes of adversity, expounding the portents of fortune and misfortune, and discoursing on the meritorious practices of redemption. Thus, he revealed this Dharma of the Great Offering of the Mystic Metropolis to instruct humans and gods. Universally, he vowed to eradicate the roots of transgression in the five destinies, enabling the four kinds of birth to restore their names in the register of life.\n\nThis scripture is titled *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Primes, Jade Capital, and Mystic Metropolis of the Great Offering*. Scriptures take karmic resonance as their essence, compassionate deliverance as their substance, and vows and practice as their function. However, later interpretations of the title vary in detail—some broadly explain the Two Vehicles, others narrowly expound the Three Treasures—all being conjectures of later generations, unrelated to the original intent of the title.\n\nHere, we thoroughly investigate the principles of its name and examine its historical traces, extracting its essential meaning to form a single explanation. The title is divided into two parts: the first six characters are the general title, and the latter eight characters specify the particular title.\n\nWithin the general title, there are further divisions. The first two characters, *Tai Shang* (Supreme), invoke the sacred name of the Heavenly Worthy, indicating the sage who expounds the teaching. The next four characters, *Dong Xuan Ling Bao* (Cavernous Mystery Numinous Treasure), reveal the profound name of the supreme teaching, clarifying the true Dharma being expounded.\n\nFirst, the invocation of the Heavenly Worthy’s sacred name: *Tai* (Supreme) means \"great\" or \"ultimate,\" denoting the vastness of his essence. *Shang* (High) means \"exalted,\" expressing the loftiness of his virtue. The Heavenly Worthy’s virtue is supremely exalted, his essence boundlessly vast; thus, his virtue and essence are both declared, hence *Tai Shang*.\n\nNext, the true Dharma expounded in the *Dong Xuan* scriptures: *Dong* means \"to penetrate\" or \"to unify.\" *Xuan* means \"profound\" or \"remote.\" This scripture’s wondrous principles are profoundly clear, its true path vast and boundless—penetrating without obstruction, unified without division: this is *Dong*. Deep and unfathomable, distant and inexhaustible: this is *Xuan*. Hence, *Dong Xuan*.\n\n*Ling Bao* (Numinous Treasure) signifies the meaning of \"numinous transformation beyond measure.\" *Bao* (Treasure) denotes \"precious and esteemed.\" This wondrous scripture’s principles are subtly profound, its numinous transformations beyond measure, urging practitioners to treasure and uphold it. Thus, the *Daode Jing* states: \"I have three treasures, which I treasure and uphold.\" This is its meaning.\n\nThe particular title is also divided into two parts. The first eight characters, from *San Yuan* (Three Primes) to *Da Xian* (Great Offering), clarify the scripture’s purpose. The final character, *Jing* (Scripture), is the general term for Dharma teachings.\n\nClarifying the scripture’s purpose: the Three Primes are presented to elucidate the retribution of good and evil and the wondrous Dharma of exhortation and admonition. Thus, the Upper Prime, Middle Prime, and Lower Prime are described. All sentient beings’ records of life and death, good and evil, are universally bound to the Three Primes and Nine Bureaus, the Three Officials of Heaven, Earth, and Water, who examine and verify merits and transgressions without the slightest error.\n\nThe Three Primes are as follows: the fifteenth day of the first lunar month is the Upper Prime, when the Heavenly Official conducts the reckoning. The fifteenth day of the seventh lunar month is the Middle Prime, when the Earthly Official conducts the reckoning. The fifteenth day of the tenth lunar month is the Lower Prime, when the Water Official conducts the reckoning. All sentient beings are governed by the Three Officials of Heaven, Earth, and Water.\n\nThe reason the fifteenth day of the first lunar month is the Upper Prime, when the Heavenly Official conducts the reckoning: in the eleventh lunar month, the first yang arises; in the first lunar month, the third yang arises, completing the *qian* (☰) trigram. *Qian* is the function of Heaven. When the celestial numbers are complete in the first lunar month, all Heavenly Officials preside over the reckoning.\n\nThe reason the fifteenth day of the seventh lunar month is the Middle Prime, when the Earthly Official conducts the reckoning: in the fifth lunar month, the first yin arises; in the sixth lunar month, the second yin arises; in the seventh lunar month, the third yin arises, completing the *kun* (☷) trigram.\n\n*Kun* is the function of Earth. In the seventh lunar month, the *kun* qi prevails in full cycle, so all Earthly Officials preside over the reckoning.\n\nThe reason the fifteenth day of the tenth lunar month is the Lower Prime, when the Water Official conducts the reckoning: the tenth lunar month corresponds to *hai*, which belongs to the north; the north is *kan* (☵), and *kan* is the position of water. This is precisely the time when the Water Bureau establishes its dominion, so all Water Officials preside over the reckoning.\n\nMoreover, the Three Primes are the fundamental origins. These Three Officials serve as the foundational principles for the conduct of all things, hence they are called the Three Primes.\n\n*Yujing* is the name of a sacred mountain within the Three Clarities’ wondrous realm. *Xuandu* is the title of a palace in the Great Brahmā Heaven. The *Great Offering* refers to this sutra’s universal reckoning of humans and devas, modeled after the *Great Offering* rites of Xuandu, to deliver and redeem all departed spirits. Its vast and encompassing merit is thus called the *Great Offering*.\n\nThe Heavenly Worthy, in compassion for the multitudes, emits divine radiance. The Dao Lord, in pity for sentient beings, transmits the dharma of this sutra, fully expounding the Heavenly, Earthly, and Water Officials—the Three Officials, Nine Bureaus, One Hundred Twenty Offices, Four Controllers, and Five Thearchs—who, on the mornings of the Three Primes, ascend to the Xuandu Palace to assess the good and evil of humans and devas, distinguishing the registers of life and death. All meritorious deeds are duly recorded, while karmic punishments in the netherworld may be absolved through redemption. The proper methods of deliverance are fully set forth in this sutra.\n\nThus, from the Son of Heaven down to the common people, if one encounters this precious sutra and practices its teachings, gathering the finest fruits, flowers, and fragrant delicacies—all the rare and wondrous treasures of the human realm—with sincere devotion, one may arrange a *Great Offering* tray, adorned in manifold ways, and make offerings. The saints of the ten directions will clearly witness this, and the Three Generations of Heavenly Worthies will bestow their grace, for this is the very purpose and intent of this sutra.\n\nLater, the general term for the teachings of the Dao is as follows: examining the true texts of the Three Caverns and the seven divisions of the mysterious teachings, one finds their titles commonly called *sutras*. Thus, *sutra* is the comprehensive name for the teachings and the grand model of perfected beings. The excellence of the sutra is indeed great, for it is the vessel for all beings.\n\nSutras are of many kinds, broadly categorized into three:\n1. Those of the Five Virtues and Three Primes, inscribed in cloud-seals upon the void, with eight-rayed radiance—esoteric and wondrous texts.\n2. Those written in azure script on purple brushes, on golden tablets with jade characters, encased in phoenix-script and concealed within the Seven Treasures’ Mystic Terrace, either in mountain grottoes or above the heavens.\n3. Those on bamboo slips or silk scrolls, written in seal or clerical script as the times dictate, transmitted and circulated in the world.\n\nThough these three forms differ in refinement, all are the teachings expounded by the Great Sage Heavenly Worthy, each capable of curing illness and thus called good medicine.\n\nThe meaning of *sutra* has many interpretations. Summarizing its essentials, it may be briefly explained in four ways:\n1. **Origin** (*you*): The Three Generations of Heavenly Worthies and the saints of the ten directions all attain the Dao through the sutras and precepts, hence it is called *origin*.\n2. **Path** (*jing*): It opens and guides all things, leading the four kinds of birth, serving as the bridge for learners and the essential path for cultivating truth, hence it is called *path*.\n3. **Dharma** (*fa*): It embodies profound and wondrous principles, subtle and refined, providing a model for the multitudes and a standard for the saints, hence it is called *dharma*.\n4. **Eternal** (*chang*): Not only are its wondrous principles profound and serene, but it is also the unchanging canon of the Three Generations of Dharma Kings.\n\nPossessing these four meanings, it is thus called *sutra*.\n\nWithin this scroll, it is further divided into four parts:\n1. From the beginning to *\"illuminating all heavens\"* is the **Preface Section**;\n2. From *\"At that time, the assembly of saints\"* to *\"difficult to redeem\"* is the **Main Exposition Section**;\n3. From *\"At that time, the Most High Dao Lord, having received the decree\"* to the end of the verse is the **Transmission Section**;\n4. From *\"At that time, the holy assembly\"* is the **Conclusion**.\n\nWithin the initial Preface Section, there are five subdivisions:\n1. The Heavenly Worthy gathers with his disciples;\n2. From *\"Together in the Jade Realm of Xina\"* onward, describing the pure land’s location;\n3. From *\"Spreading golden mats upon the ground, with jade-bordered steps\"* to the proper description of the land’s adornment;\n4. From *\"Yellow clouds entwined fourfold, purple auroras encircling thrice\"* onward, displaying the auspicious omens;\n5. From *\"Then the Heavenly Worthy smiled\"* onward, manifesting divine radiance.\n\n---\n\n**The Most High Numinous Treasure Sutra of the Three Primes’ Jade Capital and Xuandu Great Offering**\n\nThe Primordial Heavenly Worthy, together with the Most High Dao Lord, the Great Saints of the Ten Directions, Flying Heavenly Divine Kings, and seven thousand two hundred forty youths, assembled in the Long Mulberry Grove of Mount Fuluo in the Jade Realm of Xina, on Mount Yucha.\n\n**Commentary:** This opens the sutra’s origin and traces the path, listing the assembly of worthies and sages. It is the first subdivision, presenting the Heavenly Worthy gathering with his disciples and describing the pure land’s location.\n\nThe Primordial Heavenly Worthy is the august name of the Most Sage, the great title of creation and completion. Remotely, it reaches the boundless void, beyond words; proximately, tracing the teachings’ traces, it may be named. *Primordial* signifies its primacy; *Heavenly Worthy* denotes its loftiness and wonder. Hence, the Primordial Heavenly Worthy.\n\nThe Most High Dao Lord is a sage who has attained the Dao. The Flying Heavenly Divine Kings possess free and luminous wisdom. The youths are inwardly free from desires, outwardly detached from worldly pursuits, their pure nature unblemished, serene and still.\n\nTogether, they are in the Jade Realm of Xina, on Mount Yucha’s Fuluo Peak. This is a pure land, the wondrous realm of the Jade Capital, the celestial realm above the azure void. It is also said that the people of this land are purely pure and white, like white jade or fresh frost, hence it is named the Jade Realm.\n\nMoreover, the mountain is named Yucha, its peak called Fuluo, and within its forests stands the everlasting mulberry—thus the place is so designated. This is where the sutra is expounded, described here in full. It is as when Confucius compiled the *Book of Documents* or when the Venerable Lord Lao discoursed at Hangu Pass. Having already identified the sage who proclaims the sutra and revealed the site of his teaching, we now further disclose the marvels of his dwelling.\n\nThe ground is spread with golden mats, the steps edged with white jade. Seven treasures and luminous jades gleam with radiance bright as the sun. Yellow clouds entwine on all four sides, purple mists coil thrice around, and fragrant light suffuses the azure void, overflowing into the empty sky.\n\n*Annotation:* This is the dwelling of the Heavenly Worthy, the third [section], describing the adornment of the land and the manifestation of auspicious signs. *Spread* means to lay out. The site of his teaching is entirely covered with gold, and the edges of its steps are bordered with white jade. The *seven treasures* include gold, silver, lapis lazuli, coral, amber, giant clams, and agate. *Luminous jades* are another name for jade. The Heavenly Worthy’s abode is adorned with rare and wondrous treasures, exquisitely arrayed, their brilliance resplendent, shining through the ten directions, illuminating all heavens, outshining the sun and moon—hence it is said that their light gleams like the sun.\n\nThe *yellow clouds entwining on all four sides* and the *purple mists coiling thrice* signify manifold auspicious omens. Yellow is the color of the central direction. True hues manifest blessings, joyous clouds display portents, all converging at once, arriving from every side, dense and luxuriant, swirling in encircling embrace. Moreover, light purple mists spiral thrice, while divine winds stir and fragrant vapors billow, filling the empty sky as offerings.\n\n*Annotation:* No other matters are spoken of here, yet *purple mists* are mentioned. Crimson and black intermingle to form purple. Crimson is yang, the Dao; black is yin, virtue. This reveals that the Heavenly Worthy’s virtue and Dao are like a compassionate cloud, sheltering all beings, their grace surpassing even that of parents. The rare and refined adornments of the celestial paradise, the natural rewards of karmic fruition, differ utterly from the mundane. Even the music and wondrous arts must be extraordinary. The *Celestial Harmony* is a marvelous sound arising naturally; the *Great Music* consists of sublime melodies beyond compare. Thus it is called *marvelous and refined music*. The *myriad forms interplaying* means that the sounds performed arise spontaneously, a thousand arts and ten thousand skills delighting the Heavenly Worthy. As the assembled heavens offer rare treasures and play refined music, the Heavenly Worthy rejoices, revealing his numinous countenance. A smile graces his face, and five-colored light streams from his mouth, penetrating and illuminating all heavens. This is the Heavenly Worthy’s joy manifesting his numinous presence—the fifth [section], displaying his majestic radiance.\n\nFrom the above to this point constitutes the *prefatory section*. The Heavenly Worthy is ever at ease, and when he smiles, his light is like spring’s warmth. Wherever his radiance reaches, all receive its grace, none left unilluminated. With the pure eye of the Dao, all sages share this vision, gathered together in the assembly, rightfully perceiving all.\n\nAt that time, all the sages, united in one place, universally beheld the hells within the boundless worlds of the ten directions. By the Heavenly Worthy’s majestic light, nothing in the hells remained unseen.\n\n*At that time* refers to the moment when the Heavenly Worthy expounds the sutra. *All the sages* is a collective term. United as one, they all universally perceived, yet knew not what torments and punishments filled the hells. The condemned toil in penal servitude, hungry ghosts and dead souls stand naked, their necks and feet bound in chains and fetters. This shows that beings, through past karma, fail to cultivate good roots and commit every evil. Upon death, they enter the hells and the hungry ghost realm, emaciated and bare, their heads and necks shackled. The hungry ghosts and dead souls, stripped of clothing, wear locks on their necks and fetters on their feet—how excruciating must their suffering be!\n\nTheir feet stand on sword trees, their heads bear fire mountains. These are the retributions they receive according to their karma. Not only do they endure hunger and nakedness, but their bodies are burdened with iron rods, their feet planted on sword trees, their heads crowned with fire mountains, scorched and sliced by unbearable pain. Some have their heads set aflame with burning coals, their feet planted on knife mountains, driven and tormented, beaten with iron rods. Their limbs bound in fetters, they cannot move, enduring this suffering for ten thousand kalpas.\n\nThese beings, enduring such agony, what other forms of torment might they undergo? Dragged by others, their five limbs rot and decay, their faces scorched and charred, boiled in cauldrons of seething broth, a myriad pains piercing their bodies.\n\n*Annotation:* The conditions described here are evident from the text. They arise from past lives’ sins: shooting birds in flight, slaughtering beings, setting nets and snares, flying hawks and hunting dogs, ripping open wombs and plundering eggs, boiling creatures in cauldrons—committing manifold transgressions, thus receiving such retribution.\n\nIron hammers rain blows without respite; hunger and thirst know no rest. When hungry, they eat burning coals; when thirsty, they drink fiery essence. This is the karmic retribution of evil beings, whose sins are manifold, their stinginess and greed excessive, reborn as hungry ghosts. When they seek food, it turns to burning coals; when they seek drink, water becomes fiery essence. This stems from miserliness, obstructing the accumulation of merit. Such is fully expounded in the sutras, not only now recounted for your sake. For ten thousand kalpas, they remain in the hungry ghost realm.\n\nThe assembly, moved by compassion, intoned boundless blessings. As one, they raised their hands, snapped their fingers, and paid reverence to the Heavenly Worthy Who Rescues from Suffering at the Sound of Prayers. They vowed that in life after life, they would never act with miserliness, obstructing the accumulation of merit, and thus receive such retribution. Not only in the hungry ghost realm, but in all other realms, they would drift through the three paths and five sufferings.\n\nThis is not merely retribution in one place, but rather drifting through the three paths and eight difficulties, nowhere untouched.\n\nThe Three Paths refer to the hell realm, the animal realm, and the hungry ghost realm. The Five Sufferings are: embracing bronze pillars, treading upon knife mountains, walking through sword trees, entering cauldrons of boiling liquid, and swallowing fire and eating coals. Together with the Three Paths of hell, these are called the Eight Difficulties.\n\nYet all the sages, moved by compassion, ever hold pity in their hearts. Given such grievous torment, there must be questions to raise. What follows is how the inquiry begins.\n\nThe Dao Lord bowed deeply and addressed the Heavenly Worthy: \"We pray to know what sins these offenders committed in their past lives, what karmic causes they created, to endure such agony. We humbly beseech the Heavenly Worthy to bestow instruction, to reveal what we have not yet heard. If we are graced with enlightenment, we shall reverently receive the sagely grace.\"\n\nThis shows the Dao Lord making the inquiry to ensure that all who have not yet awakened may hear and know. Though the Dao Lord is a sage who has already understood karmic retribution, he now raises these questions to teach and transform all beings.\n\nAfter the Dao Lord asked about the causes and conditions, how did the Heavenly Worthy respond?\n\nThe Heavenly Worthy declared: \"These offenders, due to past causes, did not encounter the luminous teachings, did not hear the Dharma’s sound. They were miserly and greedy without measure, killed the innocent without cause, spoke falsely while harboring deceit, imprisoned the worthy, drank wine and ate meat, and brought chaos to the five spirits.\n\nThis is the Heavenly Worthy’s response to the Dao Lord’s inquiry, revealing the causes and conditions. All such acts are the evil karma of sentient beings.\n\nYet the Heavenly Worthy of the Great Dao, in boundless compassion, saves and delivers all. His divine radiance universally illumines, shining afar upon the ten directions. Thus, the Dao Lord, bearing the Heavenly Worthy’s majesty, having heard and understood the questions, respectfully requested a full explanation of the causes and conditions.\n\nThese karmic-obstructed offenders, in their past lives, committed transgressions, did not encounter the luminous precepts of the sagely teachings, did not hear the wondrous sounds of the true Dharma. They were solely devoted to miserliness and greed, did not honor merit and virtue, severed the path to heaven, and created the causes for hell. They sank into the river of love, drifting through the cycle of birth and death.\n\nThe five spirits refer to the spirits of the five viscera: the hun, po, spirit, essence, and will. Yet by drinking wine and eating meat, their karmic offenses deepened. Not only did they pollute and disturb the five spirits, but they also revolved through the Eight Difficulties, causing the six roots and three karmic actions to widely create transgressions. They concealed evil and harbored resentment, their bodies and minds unwholesome. They wantonly killed living beings, their greed and stinginess boundless. They lost the Dao and strayed from the true, not knowing how to turn back. Once they enter hell, they shall have no end to their release.\n\nThey cursed and reviled, invoked spirits and gods, deceived their teachers and betrayed the Dao, defiled and disrespected the Three Luminaries, usurped their lords and murdered their fathers, and violently harmed their kin. Such meanings are clearly understood.\n\nWhen they cursed and reviled, they wished for others’ swift ruin, calling upon spirits and invoking ghosts, stopping at nothing. Such words and deeds are too numerous to recount in haste.\n\nThis refers to their past lives, when in ignorance and arrogance, their hearts held no reverence or restraint. Their pride and extravagance grew, or they deceived and disrespected Dharma masters, slandered true sages, defiled the sun and moon, and belittled the stars. As ministers, they were disloyal; as children, they were unfilial. In places where they usurped and murdered their lords and fathers—sages find such acts abhorrent, for they harm gradually, hence the term 'usurpation and regicide.'\n\nThe *Book of Changes* states: \"When a minister murders his lord, or a child murders his father, it is not a matter of a single morning or evening. Its origins lie in gradual accumulation.\" *Usurpation* means to seize, and *regicide* means to kill. Sages detest such acts and thus alter their names.\n\nTheir hearts harbored flattery and deceit, they did not consider the suffering of beings, secretly committed theft, and endlessly slandered others. They seized merit and virtue to enrich themselves, yet refused to practice generosity or give alms to the poor. Now they endure such suffering to repay past enmity.\n\nSuch are the deeds they committed while among humans, and their meanings are clear. *Flattery* means to curry favor. *Generosity* means to use what one has to relieve others’ distress, distributing it evenly—hence the term *generosity*.\n\n*Master Zhuang* said: \"Green wheat grows upon the hillside. If in life one does not practice generosity, in death, why hold pearls in the mouth? In life, one fears the worry of robbery; in death, one fears the calamity of grave robbers desecrating the coffin.\"\n\nYet the evil karma of the mundane world is vast in number. To speak of it briefly is difficult to exhaust. The main categories and names are as such.\n\nThen the Heavenly Worthy, following the sequence of the preceding questions and answers, reiterated the meaning in detail, calling it a *gatha*. A *gatha* is another name for praise and eulogy. To restate the meaning, it is thus called a *gatha*.\n\n*They usurped and murdered their lords and fathers,*\n*Killed the innocent without cause.*\n*In death, they receive blows from golden hammers,*\n*Iron rods never leave their bodies.*\n\nThis is the text of the gatha. In the preceding passage, usurpation and murder came later, but in the gatha, they appear first. The weight of lords and fathers has been primary since ancient times. Among the three thousand precepts, \"do not kill\" is foremost, hence it is placed first in the gatha. This re-emphasizes the meaning of usurping lords and fathers from the preceding prose.\n\n*Entering others’ homes in darkness,*\n*Plundering their wealth and goods.*\n*Their dead souls descend to dark hell,*\n*For ten thousand kalpas, they shall not emerge.*\n\nSuch words are self-explanatory.\n\nThus, *Master Zhuang* said: \"Those who do evil in the light are punished by men. Those who do evil in darkness are punished by ghosts. Only when one is clear before both men and ghosts can one act alone.\" Hence, we know that the netherworld cannot be deceived, and the divine way is not to be trifled with. All transgressions, even the slightest, are recorded. The retribution of good and evil follows like a shadow. Once one falls into the Three Paths, they shall not emerge for ten thousand kalpas.\n\nThis re-emphasizes the sin of theft from the preceding prose.\n\n*Lustful and indulgent in excess,*\n*Defiling and disrespecting the Three Luminaries.*\n*Their dead souls suffer dark confinement,*\n*In later lives, they are both mad and deranged.*\n\nThis clarifies the karmic offenses of bodily actions. It speaks of those who engage in depravity, indulging in lust without restraint, solely pursuing desire, seeking refinement and smoothness, offending the sun, moon, and stars, and disregarding the Three Luminaries.\n\nWhen their punishment for clear transgressions is complete and they begin to be reborn in the human realm, though they obtain a human body, they suffer the retribution of madness, folly, and derangement. This clarifies the karmic offenses of bodily actions, then proceeds to speak of the offenses of speech, and what follows thereafter.\n\n*Fierce and quarrelsome in speech,*\n*They sow strife among their kin.*\n*In death, they suffer molten copper poured down their throats;*\n*In later lives, they are ever barking at others.*\n\nThis clarifies the offenses of speech. Those who commit offenses of speech engage in frivolous talk, spread false rumors, sow discord among their kin, reverse right and wrong, destroy harmony, recklessly invoke fortune and misfortune, and harm others. After death, they fall into hell, where molten copper is poured into their mouths. Once their punishment is complete, residual karma causes them to be reborn as dogs, ever barking at people.\n\n*Feasting on living beings,*\n*Drinking wine to disorder the five spirits.*\n*In death, they suffer boiling in cauldrons,*\n*With iron rods never leaving their bodies.*\n\nThis speaks of those who devour living beings, taking lives without remorse, consuming wine and meat, and neglecting all beings. Thus, the spirits of their five viscera become confused and disordered. Gluttonous for rich flavors, they fail to realize that karmic retribution follows them. At life’s end, they sink into hell, where they are boiled in cauldrons and scorched by furnace coals, enduring myriad pains that never leave their bodies. This re-emphasizes the sin of drinking wine and eating meat from the preceding prose.\n\n*Clamorous, they turn falsehood into truth,*\n*Deceiving and deluding the foolish to benefit themselves.*\n*In death, they suffer the retribution of having their tongues torn out;*\n*In later lives, they are mute.*\n\nThis speaks of those who engage in deceitful speech, openly practicing cunning and fraud, using deception and trickery, employing all manner of schemes, and constantly acting unlawfully to seek personal gain. After death, their souls sink into hell, where they suffer the calamity of having their tongues torn out. Once their punishment is complete, they are reborn mute. This clarifies the sin of deceitful speech, echoing the earlier prose on groundless clamor.\n\n*Deceiving their teachers and disbelieving the Dao,*\n*They clamor and invoke the divine.*\n*Dragged through the Three Paths,*\n*In later lives, they take the forms of the six livestock.*\n\nThose who deceive and delude their teachers, slander the true sages, belittle the Three Treasures, defile sacred texts, create divisions in the Dao, utter coarse and violent words, and use curses and invocations, calling upon the divine with loud shouts—such evil karma binds them, casting them into the Three Paths, where they are endlessly tossed and tormented. Once their punishment is complete, they are reborn in the forms of the six livestock, sinking into myriad bodies and losing the human way. This clarifies the sin of defying heaven, echoing the earlier prose on deceiving teachers, defying the Dao, and clamoring to the divine.\n\n*Slandering and striking the worthy,*\n*Flattering and scheming without cause.*\n*In death, they fall to be stung by venomous beasts;*\n*Endlessly tormented, they know no joy.*\n\nThose who engage in slander, defamation, and secret attacks on the worthy, flattering and scheming with deceit, are reborn with the bodies of wasps, scorpions, vipers, or other venomous creatures, taking turns in these foul forms. When will they ever know joy again? From the fierce and quarrelsome speech to this point, all clarify the karmic retribution for offenses of speech.\n\nHereafter, the offenses of the mind are addressed.\n\n*Diminishing and appropriating offerings of merit,*\n*Indulging their miserly and greedy hearts.*\n*In death, their souls become hungry ghosts,*\n*Hungry and thirsty, they drink fire and consume essence.*\n\nThis fully clarifies the offenses of the mind. When those who cultivate goodness deduct from their own bodies, offer alms, and create scriptures and images for the living and the dead, some greedy individuals intercept and appropriate these offerings of merit. Though they may temporarily benefit themselves, retribution follows like a shadow. After death, they fall into the realm of hungry ghosts, where hunger drives them to swallow fire and eat coals. The sin of greed brings such retribution—through ten thousand kalpas and a thousand rebirths, they never hear the name of water or broth. When hungry, they eat coals; when thirsty, they drink fire. This clarifies the sin of greed, echoing the earlier prose on appropriating offerings of merit to enrich oneself.\n\n*Disrespecting and insulting the venerable,*\n*Failing to revere those who embody the Dao.*\n*In later lives, they are born lowly,*\n*Taking the forms of the six livestock.*\n\nThis clarifies the sin of discriminating between self and others, disrespecting teachers, and insulting the venerable—such retribution is born among the lowly. Those who fail to revere the Three Treasures in life are reborn in the forms of the six livestock. Karmic retribution follows without the slightest deviation. Some are born in remote, lowly lands, among barbarians far from civilization. Though they may obtain a human body, they never hear the names of the Three Treasures, the true scriptures, or the correct Dharma. Through ten thousand kalpas, they rarely encounter them, and the sacred teachings and divine texts remain unseen. From the appropriation of offerings of merit to this point, the offenses of the mind are clarified.\n\nWhen the Heavenly Worthy finished reciting the verses, the Dao Lord bowed and made his request. After the Heavenly Worthy had spoken these verses, the Most High Dao Lord advanced, bowed, and addressed the Heavenly Worthy: \"Today’s joyous gathering is beyond words. The Heavenly Worthy has deigned to gaze upon us and bestow teachings on the roots of sin. I wonder—do these sinful beings have families, living relatives, and descendants, or do they leave no heirs in their present lives?\"\n\nWhen the Heavenly Worthy finished reciting the verses, the Dao Lord, harboring doubts, prepared to ask: if no means of redemption were taught, sentient beings would have no escape from suffering. Hoping for a method of salvation, he earnestly posed his question, advancing to bow and speak. The Heavenly Worthy, in his compassion, deigned to bestow guidance. Overwhelmed with gratitude, the Dao Lord heard the decree, his joy beyond words.\n\nThe Dao Lord also knew that sentient beings’ sons and daughters, their descendants, continue unbroken through generations. Wishing to teach them how to preserve their lineage and save their departed ancestors, he raised this question to introduce what follows.\n\nThe Heavenly Worthy replied: \"Though they may have sons and daughters, if they do not cultivate merit or create karmic conditions, how can they escape? Their transgressions grow ever more severe, sinking them into the fields of sin. Through countless kalpas of suffering, they have no way to return. All evils are committed, and their hopes of rebirth stretch endlessly.\"\n\nThe Heavenly Worthy said: \"The descendants, sons, daughters, and families of these sinners, lacking merit and possessing only the karmic conditions of hell, see their transgressions grow ever more numerous and grave. In the end, their sorrowful souls, suffering spirits, sink and stagnate, trapped in the filth of sin, their minds planting the seeds of past evil karma.\"\n\nThe text further states that those who accumulate evil have sins that flourish and multiply, like brambles and thorns overrunning a barren, filthy field. Even if the seeds of the five grains or good sprouts fall therein, they are ultimately choked by the overgrowth, never able to grow into stalks or bear fruit—hence the term \"fields of sin.\" The Heavenly Worthy, seeing the depth of hell’s sins and the difficulty of rescuing those mired in suffering, thus raises this question to introduce what follows.\n\nThe Dao Lord bowed and again asked the Heavenly Worthy: \"By what karmic conditions may one escape the manifold sufferings? By what meritorious deeds may one return to the human realm?\"\n\nThe commentary explains: The Dao Lord, moved by compassion for beings sunk in hell, posed this question once more to establish fields of merit, urging filial sons and obedient descendants to recall the agony of their departed ancestors, and loving brothers to remember the plight of their kin lost in suffering. They are to reduce their family wealth to perform acts of salvation. This repeated inquiry serves to exalt and cultivate the fields of merit.\n\nBelow, the Heavenly Worthy expounds upon the sins of the damned, their varied types, and the methods of grand offerings for redemption. This section is divided into three parts:\nFirst, it clarifies that the multitude of sinners differ in kind, making their salvation difficult to achieve uniformly.\nSecond, it presents the *Yuanjiao Record*, guiding those who seek refuge and veneration.\nThird, it describes the rituals to be observed by the assembly, encouraging emulation.\n\nThe Heavenly Worthy declared: \"These sinners have committed countless transgressions, and their offenses are not of a single type. If one seeks to save them, the methods cannot be the same. No single person’s effort suffices to deliver them all.\"\n\nThis is the first part, explaining that the multitude of sinners differ in kind, making their salvation difficult to achieve.\n\nThe Heavenly Worthy continued: \"As their karmic roots follow them, their sinful roots are hard to uproot. Only by establishing merit and cultivating fields of virtue—without broad vows and unwavering resolve, without ample merit—can one atone for sins and dispel calamities. If relying solely on one person’s strength, how can the multitude of evildoers be saved? Thus, those who commit evil are difficult to rescue unless they widely cultivate karmic conditions and broadly establish fields of merit. Without relying on collective causes, how can one hastily achieve deliverance? Since merit is required, what kind should be performed?\"\n\nNext, the text explains the nature of such merit.\n\nOne should follow the *Great Offering of the Mysterious Capital* on the fifteenth day of the seventh month, the Zhongyuan Festival, when the Earth Official conducts his review. He selects the multitude, distinguishing good from evil. All the great sages of the heavens descend to the palaces, determining the kalpas and examining the records of humans and ghosts. The prisoners and hungry ghosts assemble as one.\n\nThis is the second part, guiding those who seek refuge and veneration.\n\nThe Heavenly Worthy spoke of the Three Yuan Assemblies, also recounting the reasons for the Nine Bureaus’ investigations. He fully explained the morning of the search, detailing how the various officials assess good and evil, so that future generations may follow the example of the *Great Offering of the Jade Capital of the Mysterious Capital* on these Three Yuan days. Each should make offerings to the Three Generations of Heavenly Worthies, the saints of the ten directions, the Nine Ancestors and Seven Generations, and all beings in the Dharma realm, that all may receive the causes of redemption and attain liberation together.\n\nThe fifteenth day of the seventh month is the Zhongyuan Festival, when the Earth Official conducts his review. Saints from the ten directions gather in assembly. The Heavenly Official, Water Official, and all the bureaus—five hundred fifty-five thousand five hundred fifty-five billion sages—convene to determine the kalpas, examine the severity of sinners’ offenses, and rank them accordingly. On this day, offerings are made to deliver the spirits of deceased parents. What methods should be used?\n\nOn that day and night, incense is burned, and lamps are lit to illuminate the nine dark realms of the heavens and the eight gates of eternal night. The *Great Offering of the Mysterious Capital* is performed, modeled after the Jade Capital Mountain. Flowers and fruits of all kinds are gathered, arranged in five colors. All the rare and wondrous treasures of the world, sacred implements, precious objects, patterned silks, brocades, toys, garments, ten kinds of banners and canopies, jeweled parasols, and adornments for offerings—along with delicacies, fine foods, and fragrant hundred-flavored dishes—are presented to the assembled saints and Daoist masters.\n\nThe commentary states: This is the third part, demonstrating the rituals of devotion and encouraging emulation.\n\nThe five colors are blue, yellow, red, white, and black. Banners and canopies are made from interwoven five-colored silks to adorn the offerings. Seeing the hell-bound sinners suffering for kalpas uncounted, the Heavenly Worthy commands filial children to gather all the rare and wondrous treasures of the human realm, modeling them after the Jade Capital of the Mysterious Capital, to make offerings to the saints of the ten directions and Daoist masters, thereby rescuing the spirits of the departed from the sufferings of hell.\n\nOne should vow that the Nine Ancestors and Seven Generations, and all beings in the Dharma realm, may rely on the causes of these offerings and be protected by the karmic rewards of heaven. How should the saints of the ten directions and the Daoist masters perform merit on this day?\n\nOn that day and night, this scripture is expounded, and the great saints of the ten directions chant the sacred verses in unison. The prisoners and hungry ghosts are thereby liberated, all sated and freed from suffering, returning to the human realm. Without such efforts, redemption is difficult to achieve.\n\nThe commentary explains: The Heavenly Worthy extensively expounded these methods, hoping to encourage and instruct. Fearing that those of true faith are few, he repeatedly entrusted these teachings. At every command for the Great Offering, he instructed that masters be invited to perform purification rites and expound the scripture day and night in six periods.\n\nThe \"day and night\" refers to the night of the fifteenth day of the seventh month. On this day, purification rites are held, lectures are given, incense is burned, and lamps are lit to illuminate the nine dark realms of the heavens and the eight gates of suffering. The \"nine dark realms\" are the nine hells, and the \"eight gates\" are the eight gates of calamity, where beings endure punishment.\n\nOn these Three Yuan days, the *Great Offering* is performed in imitation of the Jade Capital of the Mysterious Capital, presenting all the rare and wondrous fruits and fragrant hundred-flavored delicacies of the human realm as offerings to the Three Treasures. Thereupon, the saints of the ten directions and the Daoist masters, moved by these sacred words, chant and recite, their voices ascending to the nine billion heavens and descending to the six heavens. The sinners in hell are all liberated at once.\n\nWhen I pass into the past, the goodness of the East shall not be absolute, nor shall the evil of the West be profound. The noble ones of苦 County shall journey to the Great Qin. After thirty-six thousand years from the era of the Supreme Sovereign, this kalpa shall reach its end, heaven and earth shall crumble, and all people shall suffer in the fires of tribulation.\n\nThe *Scripture* states: When the Heavenly Worthy spoke this sutra, He declared that after His passing, those who propagate the teachings shall arise in succession, generation after generation, with sagely and enlightened kings perpetuating the Three Treasures. \"The goodness of the East shall not be absolute, nor shall the evil of the West be profound\" means that the East is not entirely good without evil, nor is the West entirely evil without goodness. The \"noble ones of苦 County\" refer to Lord Lao’s incarnate form, born from the Mysterious Jade Maiden, who cut open her left armpit in苦 County of Chen Commandery—hence the name苦 County. At the moment of His birth, He walked nine steps in each of the four directions, and upon speaking, pointed to a plum tree as His surname, declaring, \"Above heaven and below heaven, I alone am revered.\" Then, nine dragons surged forth from the earth, spouting water to bathe Him. Where the dragons emerged, nine wells formed, which remain visible to this day.\n\nIt is also said: Lord Lao’s incarnate form appeared within the burning house of the Three Realms and the苦 sea of suffering—this, too, is a \"苦 County.\" \"Journey to the Great Qin\" refers to the alternate name for the Western land of Tianzhu. \"Journey\" means \"to go.\" Lord Lao traveled west to the Flowing Sands, reaching the land of Yanzhin, where He propagated the teachings of the *futu* to transform the barbarian customs. Thus, the *Book of the Later Han* states: \"Lord Lao expounded the *futu* sutras to transform the barbarian customs.\" The *futu* teachings emphasize purity and stillness, and the *futu* sutras of today’s Buddhist tradition were originally spoken by Lord Lao. However, due to the ignorance of the monastic community, they recklessly added false interpretations and distorted meanings. The sages of former times were misled, and later generations further fabricated falsehoods, turning truth into deception. Through mutual influence, the teachings of simplicity and sincerity became corrupted. As ornate literature flourished, deceit and falsehoods multiplied. The pure and simple dissolved, and the false and deceptive bloomed like flowers.\n\nIn the Wujie world, men and women, by nature and habit stingy and greedy, upon death become hungry ghosts. Their souls and spirits suffer hunger, yet when food is offered, it transforms into dust. The Commentary states: Those who have not severed their false and deceptive ways, who engage solely in deceit—*Wujie world* is the name of this realm, also called the *Jambudvīpa* realm. Yet the beings of this land, deluded by distortions and perversions, entangled in confusion and chaos, grow stingy and greedy, discriminating between self and others. Upon death, they become hungry ghosts as retribution for past transgressions. The food they are given turns to dust before their eyes, inedible. Through vast kalpas, they endure bitter suffering, mired in torment and sinking into perdition. They revolve through the Five Paths, repaying past enmities.\n\nNow, I declare this to you: you should heed it well. In future lives, men and women must rouse themselves with diligence, exerting effort to refine their conduct, lest they become the cause of sin. The Commentary states: *Hao* means vast. It speaks of enduring as hungry ghosts through immeasurable kalpas. Even if they complete their punishment and are reborn, they return to lowly families, cycling endlessly through the Five Paths, never attaining sagehood. The Five Paths are: the Heavenly Path, the Human Path, the Animal Path, the Hell Path, and the Hungry Ghost Path.\n\nThe Heavenly Worthy further exhorts and instructs the Dao Lord: in future lives, men and women must discipline themselves, rousing their minds with diligence, and not become the cause of sin. *Sins* here refer to karmic offenses. Just as one reaps what one sows in the fields, so too do good and evil deeds yield corresponding retribution—like planting in spring and harvesting in autumn. Thus, it is called the *field of sin*.\n\nAt that time, the Most High Dao Lord, having received the Heavenly Worthy’s decree, bowed in reverence and spoke these verses. This is called the *Division of the Dao*. *At that time* refers to the moment when the Heavenly Worthy, having concluded the teaching of the cause, entrusted it to the Dao Lord. Having heard the Heavenly Worthy expound this great scripture of deliverance and salvation, and having received admonitions for both present and future lives—earnest teachings disseminated to guide all beings—the Most High Dao Lord bowed before the Heavenly Worthy, praising the sublime teaching and reverently receiving its wondrous decree, his joy beyond words. As the virtue was inconceivable, he then spoke these verses:\n\nIn past lives, our karmic affinity met,\nNow we behold the Heavenly Worthy’s face.\nFirst, the kalpas of the present were revealed,\nThen the transgressions of future kalpas told.\n\nThe Commentary states: The Dao Lord, overjoyed, thus composed these verses to praise the Heavenly Worthy. Through past and present lives, their Dao affinity converged, allowing him to personally receive the supreme teaching and pay homage to the Heavenly Worthy. He was further instructed in the causes of deliverance, entrusted with transmission, and charged to swiftly turn the Wheel of the Dao, vowing to practice diligently without laziness. Both past and future kalpas have been graced by the Dao’s benevolence.\n\nThe verse on *future kalpas’ transgressions* states: The Dao Lord, in his future incarnation, admonishes beings against the sins of greed, anger, and delusion. Those consumed by greed hoard wealth, endlessly seeking possessions, indulging in arrogance and extravagance, each flaunting their splendor. They do not cultivate merit, their hearts lacking compassion, unmindful of all beings. In this life, they fail to establish fields of blessings; after death, they sink into evil paths. Such retribution is certain and unerring. All this suffering stems from past lives’ failure to cultivate good deeds, and in future lives, they will endure its calamities. Such are the profound transgressions of future kalpas.\n\nDiligently practice the supreme Dao,\nLest it become the enemy of conditioned existence.\nGreed breeds great calamity,\nAnger and delusion are the roots of disaster.\n\nThe Commentary states: This verse admonishes against the sins of greed, anger, and delusion. The Dao Lord, wishing to awaken the deluded masses, composed these verses to elucidate the roots of causes and conditions, the sources of fortune and misfortune. Greed is the affliction that burdens the body; anger and delusion are the roots of ruin. Thus, he briefly expounded their origins, urging their severance.\n\nThe Dao Lord, having expounded the Heavenly Worthy’s teaching, further elaborated: wealth, sensuality, fame, and profit are the sources of calamity; greed, anger, and delusion are the roots of self-destruction. How could one cultivate the true while obstructing the Human Path, or even lose the field of blessings? If one can prevent the Three Poisons from arising and keep the Six Roots pure, this is the path to cultivating life. Untainted by worldly dust, it becomes the bridge to deliverance from suffering. What disaster could then arise?\n\nSever the hindrance of afflictions,\nAnd the Three Actions will naturally be at peace.\nDemonic forces cannot disturb,\nHow could one suffer the hardships of hell?\n\nThe Commentary states: Afflictions arise from the Three Actions; demonic disturbances stem from the Six Roots. Yet if one embraces the Dao and guards the true, how could worldly dust contaminate them? The inception of a disturbed mind begins with sensual desire; the cause of hell lies in deviant lust. To sever afflictions, one must attain tranquility. Seeking the cause of eternal joy lies in keeping the Six Roots unstained.\n\nIf one practices the Heavenly Worthy’s teachings and, on the great offering days of the Mysterious Capital, makes offerings to the Heavenly Worthies of the Ten Directions, they will wander before the Golden Gates, forever free from the sufferings of hell. They will roam the Jasper Gardens, stride through the Seven Jeweled Parks, freely indulging in desirelessness, bowing in reverence to the Heavenly Worthy.\n\nThe Commentary states: The Dao Lord declared that if, in future times, people observe the Three Primordials by holding fasts and establishing lectures, following the rites of the Mysterious Capital’s offerings to make offerings to the Great Sages of the Ten Directions and the Daoist masters, their merit will be accomplished and their deeds manifest. They will become Heavenly Worthies, journeying through the Western Jade Realm of the Upper Realm, where treasures are inexhaustible. The departed souls of the past will all escape suffering, avoiding the Three Wretched Paths. Below, it describes how the assembly of sages rejoices and circumambulates.\n\nAt that time, the assembly of sages from the Ten Directions, having heard the Heavenly Worthy’s wondrous Dharma and the causes of deliverance—hearing what they had never heard before and awakening to what they had never awakened to—joined their voices in praise, rejoicing and reverently practicing. They chanted the *Step of Emptiness*, circumambulating in reverence, bowing in homage and gratitude, extolling the Heavenly Worthy. After the Most High Dao Lord and the assembly of sages from the Ten Directions had spoken their verses, what further exhortations did the Heavenly Worthy offer?\n\nThe Most High Dao Lord and the assembly of great sages from the Ten Directions, having recited their verses, the Heavenly Worthy proclaimed: On the days of the Three Primes, this scripture must be expounded, its rites diligently practiced, and homage paid with reverence. Perform the Six-Hour Circumambulation, purify yourself with fragrant waters, abstain from food after noon, maintain inner and outer tranquility, embrace simplicity and non-action, refrain from worldly affairs, first receive the Ten Precepts, calm the mind and seal the senses, contemplate the divine and meditate upon the Real, and visualize the abiding Dharma.\n\nAt that moment, the assembly of sages bowed as one, entreating to receive the precepts.\n\nCommentary: Here, the Heavenly Worthy, in great compassion, once more offers exhortations, further proclaiming the precepts and the rites for their observance. Though the sages perpetually cultivate pure conduct, abiding in clarity and free from desire, untouched by defilement, their purpose is to instruct the common and deliver the ignorant. Thus, on this day, with earnest guidance, the precepts are again expounded, commanding protection, purification through fasting, contemplation of the divine, and meditation upon the Real. Day and night, uphold and maintain them, dwell in mindfulness of the Three Treasures, and in the future, attain the Dao, behold the Heavenly Worthy, and wander in the Jade Capital, at ease within the Golden Towers. Such is the merit of establishing lectures and fasting on the Three Prime days to deliver the departed—thus is the blessing attained.\n\nHaving proclaimed the precepts, what is their text?\n\nThe Heavenly Worthy declared:\n\nThe first precept: Do not kill living beings or make licentious sacrifices to the six heavenly spirits and ghosts.\nThe second precept: Do not steal or commit wrongdoing by taking others’ property.\nThe third precept: Do not delight in beauty and lust, or harbor jealousy and unlawful thoughts.\nThe fourth precept: Do not engage in false speech or frivolous talk, thereby committing sins of the mouth.\nThe fifth precept: Do not indulge in wine or sink into drunkenness, acting recklessly without restraint.\nThe sixth precept: Do not be arrogant and self-righteous, or deceive and slander the multitudes.\nThe seventh precept: Do not deceive your teacher or betray the Dao, or discard sacred scriptures.\nThe eighth precept: Do not harbor anger toward the four assemblies or slander Daoist practitioners.\nThe ninth precept: Do not greedily seek excess, harming others to benefit yourself.\nThe tenth precept: Do not insult or curse your clan and kin, or disrespect the elderly.\n\nThese ten precepts are the great afflictions of the body. Those who violate them will suffer the wind-knives for ten thousand kalpas, forever encountering evil conditions. With a sincere and reverent heart, guide those who come after, diligently practice and listen attentively, and receive them without forgetting their words. If you follow them according to the Dharma, in life you will commit no transgressions, and in death you will not be bound or confined. Heaven will send cloud chariots, and you will naturally attain the Dao.\n\nThe commentary states: These are the ten precepts, which are the rituals for cultivation and observance. Those who uphold them will surely attain rebirth among humans and gods, while those who violate them will inevitably sink into hell. If there are good men and good women who can uphold these ten precepts, advance with zealous diligence, and never grow weary in their hearts, their conduct will align with the Dao, and they will never stray from it in life. In life, they will be revered by the teachings, and in death, they will ascend to the Upper Clarity, riding cloud chariots, coming and going without obstruction, transcending the Three Realms, and attaining a vajra body. If one violates them, they will sink into the five sufferings, pass through the three evil destinies, walk upon sword trees and blade mountains, constantly compelled to tread them, driven and hurried by ox-headed hell wardens. Their flesh will scatter like stars, their bones dissolve like rain, and for ten thousand kalpas they will suffer without a moment’s respite, forever encountering evil conditions, facing enmity with enmity. Those who transgress the scriptures and violate the precepts will reap misfortune in hell. Those who cultivate according to the Dharma will receive joy in heaven.\n\nThereafter, the Most High Lord of the Dao further inquired about the rites of the Three Prime Fasts. The following text presents how to make the invocation.\n\nThe Most High Lord of the Dao bowed his head in reverence and said: The meaning of the Middle Prime Fast has already been fully heard. I have yet to learn the proper forms for the Upper and Lower Primes.\n\nThe commentary states: The rites of the Three Prime Fasts are all contained in the scriptures. The Most High Lord of the Dao, fearing that future generations would be ignorant and fail to comprehend, posed this lofty question again, hoping to receive what had not yet been heard. In this assembly, he earnestly requested once more. The Heavenly Worthy’s response is as follows.\n\nThe Heavenly Worthy declared: These Three Prime Fasts are determined and recorded in the Three Registers, the essential texts of the Numinous Treasure. The fifteenth day of the first month is the Upper Prime, when the Heavenly Official conducts his review. The fifteenth day of the tenth month is the Lower Prime, when the Water Official conducts his review. Their jurisdictions differ.\n\nThe commentary states: This is the Heavenly Worthy’s explanation of the origins of the Three Primes. These Three Prime rites are determined and recorded in the Three Registers, derived from the essential texts of the Numinous Treasure. Their jurisdictions differ because the Upper Prime’s Left Bureau governs life, and the Fire Official of the Great Yang conducts the review. The Lower Prime’s Right Bureau governs death, and the Water Official of the Great Yin conducts the review. The Middle Prime governs the registers of life and death, all matters of sin and merit for the prisoners of hell, and the trials of the wind-knives. Each oversees the inspection of ninety thousand beings, encompassing all twelve months. The Middle and Lower Primes share two bureaus. As for the incense circumambulation, it is performed to distinguish the Upper Prime’s knowledge of life and the Lower Prime’s knowledge of death. Since their jurisdictions differ, they are not the same—hence it is said their jurisdictions differ.\n\nNow, what is expounded here is the Great Offering of the Dark Capital on the fifteenth day of the seventh month, which oversees both the Upper and Lower Primes. Thus, it is fitting to observe it.\n\nThe commentary states: This means the Middle Prime encompasses and reconciles the Upper and Lower Primes, reviewing all matters together. The hungry ghosts and imprisoned spirits are all addressed on this day. However, the Middle Prime Dao of this day encompasses the Upper and Lower Primes, and its merit is the greatest. Therefore, the rites of the Great Offering of the Dark Capital are performed to deliver the departed. Thus, it does not mention the Heavenly or Water Officials but only the Middle Prime, for it is the Earth Official of the Middle Prime. The Earth Official resides in the center, and the center is the correct color. Therefore, the Middle Prime is invoked to encompass the Upper and Lower. Moreover, by autumn, all things reach maturity, so the direction of metal is taken as the time of ripeness. Thus, the fifteenth day of the seventh month, the day of the Middle Prime, is chosen for the offering. Furthermore, on this day, all hungry ghosts and sinful spirits are released. On the day of the Middle Prime’s teachings and precepts, at the dawn of the Great Offering of the Dark Capital, one must establish merit, observe the fast, perform the Dao, expound the scriptures, make offerings to the Three Treasures, and deliver the departed. At this time, the prisoners of hell all receive blessings. Those who observe these rites will enjoy prosperity, while those who neglect them will incur misfortune.\n\nThe commentary states: If the Heavenly Worthy partakes in the Great Offering, the blessings are boundless. If one treats the Great Offering lightly, misfortune will befall them for ten thousand kalpas.\n\nUpon hearing this, the Most High Lord of the Dao, the Ten Directions’ Great Sages, the Flying Heavenly Kings, and the seven thousand two hundred and forty youths all rejoiced together, bowed in reverence, and departed.\n\nThe commentary states: The supreme sages, moved by compassion, always seek to deliver beings. In proclaiming the wondrous Dharma and illuminating the mysterious teachings, how could they not rejoice upon hearing these sublime words? Thus, with devout hearts and exuberant spirits, they bowed and departed, each returning to their respective realms to diligently teach and transform.\n\nThe *Scripture of the Three Primes of the Numinous Treasure: The Great Offering of the Jade Capital and the Dark Capital* concludes here.\n\nHere follows the corrected scriptural passage:\n\nFor ten thousand kalpas, they shall not escape, bound in the prisons of the Dark Capital, where they will suffer the torments of the Five Evils. Their bodies shall be fettered and shackled, their necks clamped in iron collars, their waists bound with iron chains, their hands and feet locked in iron manacles. Day and night, they shall endure the lash of whips and the strike of cudgels, their flesh torn and their bones shattered, their blood flowing like rivers, their cries of anguish shaking the earth. Even if they die, they shall be reborn only to suffer again, never to emerge.\n\nMoreover, their minds shall be afflicted with madness and confusion, their bodies stricken with sores and ulcers, their limbs twisted and deformed. In future lives, they shall be reborn as the lowliest of beasts, their bodies pierced by iron rods that never leave them. If they have deceived and misled others for their own gain, they shall fall into the realm of venomous creatures, where they shall be stung and devoured. If they have hoarded wealth and refused to give, they shall suffer eternal hunger and thirst, forced to drink the essence of fire and eat the ashes of charcoal. If they have harmed living beings, they shall be reborn as livestock, their bodies butchered and their flesh consumed. If they have severed the bonds of kinship, their descendants shall be cut off, and they shall wander as solitary ghosts, never to find rest.\n\nThe commentary states: These are the consequences of transgressing the precepts and violating the Dao. The fields of sin bear such bitter fruit, and none may escape their due retribution.\n\nThe Heavenly Worthy then spoke in verse:\n\nThose who break the precepts and defile the Dao\nShall fall into the prisons of the Dark Capital,\nWhere they shall suffer the Five Evils’ torment,\nBound in iron, their flesh rent and torn.\nTheir cries shall shake the earth,\nYet none shall hear their pleas.\nEven in death, they shall not escape,\nBut be reborn to suffer anew.\nTheir minds shall be clouded with madness,\nTheir bodies stricken with sores.\nIn future lives, they shall be beasts,\nTheir flesh pierced by iron rods.\nIf they have deceived others,\nThey shall fall among venomous creatures.\nIf they have hoarded wealth,\nThey shall hunger and thirst eternally.\nIf they have harmed living beings,\nThey shall be butchered as livestock.\nIf they have severed kinship,\nTheir descendants shall be cut off,\nAnd they shall wander as solitary ghosts,\nNever to find peace.\n\nThus, on the three prime mornings—the fifteenth day of the first, seventh, and tenth months—when the Earth Official reviews the registers, distinguishing good from evil, the divine sages and immortals of all heavens shall gather in the Palace of Numinous Flowers to examine the records of kalpas and the ledgers of wicked ghosts and prisoners.\n\nOn these days, the world should purify their chambers and dwellings, burning incense and lighting lamps at night. At that time, they should make vows to illuminate the heavens and the nine dark realms of the Eight Gates. They should emulate the divine sages and perfected ones, performing the Great Offering of the Dark Capital upon the Jade Capital Mountain. From the lower realms, they should gather the finest flowers and fruits, all the rare delicacies and sweet nectars of the world, along with banners, canopies, and jeweled parasols, to adorn and present as offerings. With sincere hearts, they should make distant offerings to the assembled sages and all Daoist masters.\n\nOn these nights, they should recite this scripture, wishing to extend blessings to their nine generations of ancestors, their seven generations of parents, all their kin, and even others. Through repentance of sins and earnest devotion, the imprisoned and hungry ghosts shall be liberated, granted food and satiation, freed from all suffering, and reborn among humans to enjoy happiness according to their karma. Without such efforts, none may be redeemed.\n\nAt the Hall of Jade: Based on the preceding and following context, this should read \"the descent of the divine birth.\"\n\n---\n\nThen he spoke these verses:\n\n*(The Dunhuang manuscript reads: \"Then he spoke this hymn.\")*\n*(The Dunhuang manuscript omits the lines: \"First recounting the transgressions of this kalpa, / Then foretelling the faults of the kalpa to come.\")*\n\n*(Note: \"二云\" should read \"一云\" based on the preceding and following context.)*\n\n---\n\nAt that time, the sacred assemblies of the ten directions all attained awakening, rejoicing as one. They bowed their heads, received the command, and withdrew.\n\n*(The Dunhuang manuscript significantly condenses the text from \"At that time\" to the end of the scroll, rendering it simply as: \"At that time, the sacred assemblies of the ten directions all attained awakening, rejoicing as one. They bowed their heads, received the command, and withdrew.\"—a total of twenty characters.)*\n\n---\n\n**Annotation:**\n*(Based on the preceding and following context, \"释文\" should read \"Annotation.\")*\n*\"Three Primes\" (三元): The colophon of the Dunhuang manuscript reads \"Middle Prime\" (中元), which is more accurate.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝三元玉京玄都大献经 经名：太上洞玄灵宝三元玉京玄都大献经。 原不题撰人。 唐玄嶷《甄正论》称此经为『道士刘无待造，以拟盂兰盆』。 原本一卷，收入《正统道藏》洞玄部本文类，系注疏本。 另有敦煌S 3061 号残写本，无注疏。 今以《道藏》本为底本，以敦煌本参校#1 。 太上洞玄灵宝三元玉京玄都大献经 若夫至人妙本，出万象之先，大圣深源，超六合之外。 不生不灭，视听之所未阶，无待无为，形名之所不及。 虽窈冥玄绝，而能应化无方，眇邈虚冲，而实济益斯在。 若乃现金容於金阙，示百万之法身，备玉简於玉京，开五方之要典，莫不桥梁庶类，开悟群迷，应感赴缘，逗机行化。 至如今灵宝妙本，理净平夷，但一切众生，违真丧实，虚想妄见，纵荡六情，方缠爱网，遂使业沦五浊，苦海所以无边； 流浪三涂，生死於兹浩漫。 自非至人引导，无由出苦。 在我大圣天尊，智周空有，位过寰极，道贯大罗，辟众妙之门，洞重玄之境，能以慈悲救物，常善度人。 故乃托迹西那，现山阳而演教桑林之下。 荐宝玉以妆严，发奇瑞於云霞，散灵香於净域。 遍开妙相，含笑而吐五光； 匝照诸天，朗神辉於十界。 愍诸恶趣受苦众生，幽厄三涂，沈缠八难，因道君之请问，告恶对之缘由，说祸福之前征，论拔赎之功行。 故演此玄都大献之法，以教人天。 普愿五道还除罪源，将令四生复保命籍。 此经题云《太上洞玄灵宝三元玉京玄都大献经》 。 夫经者，感应为宗，慈救为体，愿行为用。 然今题释，详略不同，或泛解二乘，或约陈三宝，皆是后人臆度，非关题经本意。 今研穷名理，考寻事迹，举其指要，以成一字，仍於题中分为二别。 所言二者，前六字是通题，后八字明其别题。 既前通题之中，又分为二。 初太上二字，举天尊圣号，明能说之圣人。 次洞玄灵宝四字，显至教之深名，明所说之正法。 初举天尊圣号者。 太者，泰也。 极大之尊名，以明其体。 上者，尚也。 穷高之美称，以语其德。 明天尊德高无上，体大无穷，德体双陈，故云太上。 次明所说之正法洞玄经者。 洞者，通也同也。 玄者，深也远也。 言此经妙理深澄，真途寥廓，通而无碍，同而不隔，是其洞也。 深而难测，远而莫穷，是其玄也。 故曰洞玄。 灵宝者，灵变不测之义。 宝者，宝重珍贵之名。 言此妙经，理致幽玄，灵变不测，劝令行者，皆可宝持。 故德经云：我有三宝，宝而持之。 即其义也。 次明别题者，又分为二。 前三元至大献八字，明目经意由。 后经一字，明法教之通称。 明目经意由者，三元方欲显明善恶之报，惩劝之妙法，故述上元、中元、下元以晓之。 言一切众生，生死命籍，善恶簿录，普皆系在三元九府，天地水三官，考校功过，毫分无失。 所言三元者，正月十五日为上元，即天官检勾。 七月十五日为中元，即地官检勾。 十月十五日为下元，即水官检勾。 一切众生，皆是天地水三官之所统摄。 所以正月十五日为上元，天官校录者。 十一月一阳生，正月三阳生，三阳成乾。 乾者，天之用也。 正月天道数成，故一切天官主当校录。 所以七月十五日为中元，地官检录者。 五月一阴生，六月二阴生，七月三阴生，三阴成坤。",
      "translated_text": "**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Primes, Jade Capital, and Mystic Metropolis of the Great Offering**\n\nThis scripture is titled *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Primes, Jade Capital, and Mystic Metropolis of the Great Offering*. Its author is unknown. Tang dynasty scholar Xuanying’s *Rectification of Heresies* attributes this text to the Daoist Liu Wudai, who composed it in imitation of the *Ullambana Sutra*. The original consists of one fascicle and is included in the *Daoist Canon* (Zhengtong Daozang) under the Cavernous Mystery Division, Texts category, as an annotated edition. There is also a fragmentary manuscript (S. 3061) from Dunhuang without annotations. The present translation is based on the *Daoist Canon* edition, collated with the Dunhuang manuscript.\n\n---\n\n**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Primes, Jade Capital, and Mystic Metropolis of the Great Offering**\n\nThe perfected ones of wondrous origin emerge before the myriad forms; the great sages of profound source transcend beyond the six directions. Neither born nor extinguished, they elude the reach of seeing and hearing; without dependence or action, they surpass the bounds of form and name. Though abstruse and profoundly remote, they respond and transform without limit; though subtle and empty, they truly benefit all beings. When they manifest golden countenances in the golden palaces, they reveal the hundred-thousandfold dharma-body; when they prepare jade tablets in the Jade Capital, they open the essential scriptures of the five directions. None fail to bridge the myriad kinds, awakening the deluded masses, responding to karmic conditions, and adapting their teachings to the moment.\n\nYet now, the wondrous origin of the Numinous Treasure remains serene and equanimous. All sentient beings, however, turn from the real and lose their essence, indulging in empty imaginings and false views. They recklessly indulge the six senses, entangling themselves in the net of desire, thereby sinking into the five turbidities through karmic bonds. Thus, the苦海 (*sea of suffering*) knows no bounds; drifting through the three wretched destinies, birth and death stretch endlessly. Without the guidance of perfected ones, there is no escape from suffering.\n\nOur Great Sage, the Heavenly Worthy, encompasses wisdom in both emptiness and existence, his station surpassing the limits of the cosmos. His Dao pervades the Great Network (Daluo), opening the gate of myriad wonders and penetrating the realm of double mystery. With compassion, he saves beings; ever benevolent, he delivers humanity. Thus, he manifested traces in the Western Land, appearing in the mountain’s south to expound the teachings beneath the mulberry grove. He adorned the sacred with precious jades, sending forth auspicious omens in clouds and mist, scattering numinous fragrance across pure realms. Everywhere, wondrous forms unfolded—smiling, he emitted fivefold radiance; illuminating all heavens, his divine splendor shone across the ten realms.\n\nMoved by the suffering of beings in the evil destinies—oppressed in the three wretched paths, entangled in the eight difficulties—he responded to the inquiries of the Dao Lord, explaining the causes of adversity, expounding the portents of fortune and misfortune, and discoursing on the meritorious practices of redemption. Thus, he revealed this Dharma of the Great Offering of the Mystic Metropolis to instruct humans and gods. Universally, he vowed to eradicate the roots of transgression in the five destinies, enabling the four kinds of birth to restore their names in the register of life.\n\nThis scripture is titled *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Primes, Jade Capital, and Mystic Metropolis of the Great Offering*. Scriptures take karmic resonance as their essence, compassionate deliverance as their substance, and vows and practice as their function. However, later interpretations of the title vary in detail—some broadly explain the Two Vehicles, others narrowly expound the Three Treasures—all being conjectures of later generations, unrelated to the original intent of the title.\n\nHere, we thoroughly investigate the principles of its name and examine its historical traces, extracting its essential meaning to form a single explanation. The title is divided into two parts: the first six characters are the general title, and the latter eight characters specify the particular title.\n\nWithin the general title, there are further divisions. The first two characters, *Tai Shang* (Supreme), invoke the sacred name of the Heavenly Worthy, indicating the sage who expounds the teaching. The next four characters, *Dong Xuan Ling Bao* (Cavernous Mystery Numinous Treasure), reveal the profound name of the supreme teaching, clarifying the true Dharma being expounded.\n\nFirst, the invocation of the Heavenly Worthy’s sacred name: *Tai* (Supreme) means \"great\" or \"ultimate,\" denoting the vastness of his essence. *Shang* (High) means \"exalted,\" expressing the loftiness of his virtue. The Heavenly Worthy’s virtue is supremely exalted, his essence boundlessly vast; thus, his virtue and essence are both declared, hence *Tai Shang*.\n\nNext, the true Dharma expounded in the *Dong Xuan* scriptures: *Dong* means \"to penetrate\" or \"to unify.\" *Xuan* means \"profound\" or \"remote.\" This scripture’s wondrous principles are profoundly clear, its true path vast and boundless—penetrating without obstruction, unified without division: this is *Dong*. Deep and unfathomable, distant and inexhaustible: this is *Xuan*. Hence, *Dong Xuan*.\n\n*Ling Bao* (Numinous Treasure) signifies the meaning of \"numinous transformation beyond measure.\" *Bao* (Treasure) denotes \"precious and esteemed.\" This wondrous scripture’s principles are subtly profound, its numinous transformations beyond measure, urging practitioners to treasure and uphold it. Thus, the *Daode Jing* states: \"I have three treasures, which I treasure and uphold.\" This is its meaning.\n\nThe particular title is also divided into two parts. The first eight characters, from *San Yuan* (Three Primes) to *Da Xian* (Great Offering), clarify the scripture’s purpose. The final character, *Jing* (Scripture), is the general term for Dharma teachings.\n\nClarifying the scripture’s purpose: the Three Primes are presented to elucidate the retribution of good and evil and the wondrous Dharma of exhortation and admonition. Thus, the Upper Prime, Middle Prime, and Lower Prime are described. All sentient beings’ records of life and death, good and evil, are universally bound to the Three Primes and Nine Bureaus, the Three Officials of Heaven, Earth, and Water, who examine and verify merits and transgressions without the slightest error.\n\nThe Three Primes are as follows: the fifteenth day of the first lunar month is the Upper Prime, when the Heavenly Official conducts the reckoning. The fifteenth day of the seventh lunar month is the Middle Prime, when the Earthly Official conducts the reckoning. The fifteenth day of the tenth lunar month is the Lower Prime, when the Water Official conducts the reckoning. All sentient beings are governed by the Three Officials of Heaven, Earth, and Water.\n\nThe reason the fifteenth day of the first lunar month is the Upper Prime, when the Heavenly Official conducts the reckoning: in the eleventh lunar month, the first yang arises; in the first lunar month, the third yang arises, completing the *qian* (☰) trigram. *Qian* is the function of Heaven. When the celestial numbers are complete in the first lunar month, all Heavenly Officials preside over the reckoning.\n\nThe reason the fifteenth day of the seventh lunar month is the Middle Prime, when the Earthly Official conducts the reckoning: in the fifth lunar month, the first yin arises; in the sixth lunar month, the second yin arises; in the seventh lunar month, the third yin arises, completing the *kun* (☷) trigram.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1227,
      "start_sentence": 0,
      "end_sentence": 62,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.387967348098755,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "坤者，地之用也。 七月坤气王周，故一切地官主当校录。 所以十月十五日为下元，水官校录者。 十月建亥，亥属北方，北方是坎，坎是水位，正是水司建王之时，故一切水官主当校录。 又三元者，元本也。 但此上三官，为万物之行本，故曰三元。 玉京者，三清妙境之山名。 玄都者，大罗天中之宫号。 大献者，此经普校人天，仿学玄都大献之法，拔赎一切亡灵，愿行该广，故称大献。 明天尊慈怜兆庶，故发神光。 道君愍念群生，为转经法，具陈天地水官，三官九府百二十曹，四司五帝考录诸官，各以三元之晨，上诣玄都官内，校定人天善恶，分别生死簿书，所有善功，咸蒙记录，冥司谪罚，并无收赎。 拔度之宜，经文具载。 故上从天子，下及兆人，若能遇此宝经，依文修选，探诸花果百味芬芳，备尽人间珍奇异物，列情励志，造大献盘，种种装严，虔心供养，十方众圣，鉴照分明，三代天尊，流恩授受，此乃目经意由也。 后明法教之通称者，寻三洞真文，七部玄教，讨其题目，素号曰经。 是知经者，法教之总名，至人之洪范。 经之为美，其大矣哉，盖群品之舟航者也。 但经乃多种，大略有三。 一者五德三元，凝空云篆，垂芒八角，秘妙之文。 二者青林紫笔，金简玉字，包以凤文，蕴藏於七宝玄台，或在山洞之中，或在诸天之上。 三者简策缣纸，篆隶随时，传授流通，见行於代。 虽复有三迹，而粗妙不同，皆是大圣天尊诠至，咸能治病，悉名良药。 但经之义训，训亦多途。 举其枢要，略释为四。 所言四者，一由，二径，三法，四常。 第一训由者，言三代天尊，十方众圣，莫不因由经戒，而得成道，故曰由也。 第二训径者，能开通万物，导达四生，作学者之津梁，实修真之要径，故曰径也。 第三训法者，言能为旨趣玄妙，所致精微，可以轨则苍生，楷模众圣，故曰法也。 第四训常者，言非但妙理深远，湛寂凝然，抑亦三代法王不刊之衍。 具斯四义，故得称经。 就此一卷之中，又为四也： 第一从初至彻照诸天，名为序分； 第二从尔时众圣下，至难可拔赎，名为正说分； 第三从尔时太上道君得闻命旨下，尽颂终，名为通传分； 第四从尔时圣众下，名为总结。 就初序分之中，又分为五： 第一举天尊与徒众云集； 第二从俱在西那玉国下，次明净土方所； 第三从敷黄金荐地白玉缘阶下，至正述国土装严； 第四从黄云四缠紫霞三匝下，表诸祥瑞； 第五从是时天尊含笑下，明出威光。 太上洞玄灵宝三元玉京玄都大献经 元始天尊与太上道君、十方大圣、飞天神王、七千二百四十童子，俱在西那玉国郁察之山，浮罗之岳长桑林中。 释曰：此则开宗发迹之道，备诸贤圣之目，即是第一，举天尊与徒众云集之时，并明净土方所。 元始天尊者，至圣之洪名，生成之大号，远穷溟涬，难以为言，近寻教迹，方可立称。 又元始者，言其最先。 天尊者，语其高妙。 故曰元始天尊。 太上道君者，得道之圣人。 飞天神王者，自在之灵智。 童子者，内无嗜欲，外绝营求，至性不亏，湛然凝寂。 俱在西那玉国郁察山中浮罗之岳。 此为净土方所，即玉京之妙境，碧虚之上界。 亦言此土之人，纯浄洁白，或如白玉，乍等严霜，因此立名称玉国。",
      "translated_text": "*Kun* is the function of Earth. In the seventh lunar month, the *kun* qi prevails in full cycle, so all Earthly Officials preside over the reckoning.\n\nThe reason the fifteenth day of the tenth lunar month is the Lower Prime, when the Water Official conducts the reckoning: the tenth lunar month corresponds to *hai*, which belongs to the north; the north is *kan* (☵), and *kan* is the position of water. This is precisely the time when the Water Bureau establishes its dominion, so all Water Officials preside over the reckoning.\n\nMoreover, the Three Primes are the fundamental origins. These Three Officials serve as the foundational principles for the conduct of all things, hence they are called the Three Primes.\n\n*Yujing* is the name of a sacred mountain within the Three Clarities’ wondrous realm. *Xuandu* is the title of a palace in the Great Brahmā Heaven. The *Great Offering* refers to this sutra’s universal reckoning of humans and devas, modeled after the *Great Offering* rites of Xuandu, to deliver and redeem all departed spirits. Its vast and encompassing merit is thus called the *Great Offering*.\n\nThe Heavenly Worthy, in compassion for the multitudes, emits divine radiance. The Dao Lord, in pity for sentient beings, transmits the dharma of this sutra, fully expounding the Heavenly, Earthly, and Water Officials—the Three Officials, Nine Bureaus, One Hundred Twenty Offices, Four Controllers, and Five Thearchs—who, on the mornings of the Three Primes, ascend to the Xuandu Palace to assess the good and evil of humans and devas, distinguishing the registers of life and death. All meritorious deeds are duly recorded, while karmic punishments in the netherworld may be absolved through redemption. The proper methods of deliverance are fully set forth in this sutra.\n\nThus, from the Son of Heaven down to the common people, if one encounters this precious sutra and practices its teachings, gathering the finest fruits, flowers, and fragrant delicacies—all the rare and wondrous treasures of the human realm—with sincere devotion, one may arrange a *Great Offering* tray, adorned in manifold ways, and make offerings. The saints of the ten directions will clearly witness this, and the Three Generations of Heavenly Worthies will bestow their grace, for this is the very purpose and intent of this sutra.\n\nLater, the general term for the teachings of the Dao is as follows: examining the true texts of the Three Caverns and the seven divisions of the mysterious teachings, one finds their titles commonly called *sutras*. Thus, *sutra* is the comprehensive name for the teachings and the grand model of perfected beings. The excellence of the sutra is indeed great, for it is the vessel for all beings.\n\nSutras are of many kinds, broadly categorized into three:\n1. Those of the Five Virtues and Three Primes, inscribed in cloud-seals upon the void, with eight-rayed radiance—esoteric and wondrous texts.\n2. Those written in azure script on purple brushes, on golden tablets with jade characters, encased in phoenix-script and concealed within the Seven Treasures’ Mystic Terrace, either in mountain grottoes or above the heavens.\n3. Those on bamboo slips or silk scrolls, written in seal or clerical script as the times dictate, transmitted and circulated in the world.\n\nThough these three forms differ in refinement, all are the teachings expounded by the Great Sage Heavenly Worthy, each capable of curing illness and thus called good medicine.\n\nThe meaning of *sutra* has many interpretations. Summarizing its essentials, it may be briefly explained in four ways:\n1. **Origin** (*you*): The Three Generations of Heavenly Worthies and the saints of the ten directions all attain the Dao through the sutras and precepts, hence it is called *origin*.\n2. **Path** (*jing*): It opens and guides all things, leading the four kinds of birth, serving as the bridge for learners and the essential path for cultivating truth, hence it is called *path*.\n3. **Dharma** (*fa*): It embodies profound and wondrous principles, subtle and refined, providing a model for the multitudes and a standard for the saints, hence it is called *dharma*.\n4. **Eternal** (*chang*): Not only are its wondrous principles profound and serene, but it is also the unchanging canon of the Three Generations of Dharma Kings.\n\nPossessing these four meanings, it is thus called *sutra*.\n\nWithin this scroll, it is further divided into four parts:\n1. From the beginning to *\"illuminating all heavens\"* is the **Preface Section**;\n2. From *\"At that time, the assembly of saints\"* to *\"difficult to redeem\"* is the **Main Exposition Section**;\n3. From *\"At that time, the Most High Dao Lord, having received the decree\"* to the end of the verse is the **Transmission Section**;\n4. From *\"At that time, the holy assembly\"* is the **Conclusion**.\n\nWithin the initial Preface Section, there are five subdivisions:\n1. The Heavenly Worthy gathers with his disciples;\n2. From *\"Together in the Jade Realm of Xina\"* onward, describing the pure land’s location;\n3. From *\"Spreading golden mats upon the ground, with jade-bordered steps\"* to the proper description of the land’s adornment;\n4. From *\"Yellow clouds entwined fourfold, purple auroras encircling thrice\"* onward, displaying the auspicious omens;\n5. From *\"Then the Heavenly Worthy smiled\"* onward, manifesting divine radiance.\n\n---\n\n**The Most High Numinous Treasure Sutra of the Three Primes’ Jade Capital and Xuandu Great Offering**\n\nThe Primordial Heavenly Worthy, together with the Most High Dao Lord, the Great Saints of the Ten Directions, Flying Heavenly Divine Kings, and seven thousand two hundred forty youths, assembled in the Long Mulberry Grove of Mount Fuluo in the Jade Realm of Xina, on Mount Yucha.\n\n**Commentary:** This opens the sutra’s origin and traces the path, listing the assembly of worthies and sages. It is the first subdivision, presenting the Heavenly Worthy gathering with his disciples and describing the pure land’s location.\n\nThe Primordial Heavenly Worthy is the august name of the Most Sage, the great title of creation and completion. Remotely, it reaches the boundless void, beyond words; proximately, tracing the teachings’ traces, it may be named. *Primordial* signifies its primacy; *Heavenly Worthy* denotes its loftiness and wonder. Hence, the Primordial Heavenly Worthy.\n\nThe Most High Dao Lord is a sage who has attained the Dao. The Flying Heavenly Divine Kings possess free and luminous wisdom. The youths are inwardly free from desires, outwardly detached from worldly pursuits, their pure nature unblemished, serene and still.\n\nTogether, they are in the Jade Realm of Xina, on Mount Yucha’s Fuluo Peak. This is a pure land, the wondrous realm of the Jade Capital, the celestial realm above the azure void. It is also said that the people of this land are purely pure and white, like white jade or fresh frost, hence it is named the Jade Realm.",
      "overlap_context": "ises, completing the *qian* (☰) trigram. *Qian* is the function of Heaven. When the celestial numbers are complete in the first lunar month, all Heavenly Officials preside over the reckoning.\n\nThe reason the fifteenth day of the seventh lunar month is the Middle Prime, when the Earthly Official conducts the reckoning: in the fifth lunar month, the first yin arises; in the sixth lunar month, the second yin arises; in the seventh lunar month, the third yin arises, completing the *kun* (☷) trigram.",
      "start_char": 1227,
      "end_char": 2495,
      "start_sentence": 63,
      "end_sentence": 115,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.231520891189575,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "又更山名郁察，岳号浮罗，林有长桑，便为题目。 此说经之处，乃具而言之。 犹如孔子定书，老君说经於函谷。 向来既标说经之圣人，并显说法之处所，更显所居之处，有何珍异。 敷黄金荐地，白玉缘阶，七宝琳琅，光明焕日，黄云四缠，紫霞三匝，香光缠苍，冲溢虚空。 释曰：此是天尊所居之处，即是第三，述国土庄严，并表祥瑞。 敷者，布也。 言其说法之所，悉以黄金遍布，其地阶之边，并用白玉而为缘钫。 七宝者，金银、琉璃、珊瑚、琥珀、砗琴、玛碯之类。 琳琅者，即玉之别名也。 天尊所居之处，众宝珍奇，庄严妙丽，光彩焕烂，朗彻十方，照耀诸天，明於日月，故云光明焕日。 黄云四缠，紫霞三匝者，此是表诸祥瑞。 黄即中方之色也。 复有正色呈祥，喜云显瑞，一时俱合，四面而来。 蓊蔚軿阗，周旋围逵。 又更紫气轻霞，萦盘三匝，灵风扇动，香气氤氲，郁缢虚空，而为供养。 释曰：不道余事，而言紫霞者，朱黑相杂而为紫霞。 朱曰阳，曰道。 黑曰阴，曰德。 明天尊道德，犹若慈云，荫覆众生，恩隆父母。 但以上界天堂珍奇、雅妙华饰，果报自然，与俗不同，将音乐奇能，亦应殊异。 天钧大乐，奇雅妙音，万种互作。 释曰：天钧者，自然之奇响。 大乐者，非常之妙曲。 故曰奇雅妙音。 万种互作者，言所奏音声，皆自然而至，千种万伎，娱乐天尊，诸天既献诸珍奇，并奏雅音，天尊欢喜，显所灵相。 天尊含笑，五色光明，从口中出，彻照诸天。 此是天尊欢喜显灵相，即是第五，明出威光。 从上至此，总为序分。 但天尊常适，故若含笑，照同春景，每有光明，所在蒙恩，无不彻照。 但道眼清浄，众圣共同，俱在会中，宜应利见。 尔时，众圣俱在一处，普见十方无极世界地狱之中， 此是众圣乘天尊威光，地狱之中，无不睹见。 尔时者，即是天尊说法之时。 众圣者，不一之称。 但众既同，悉皆普见，未知地狱之中，有何责罚。 囚徒谪役，饿鬼死魂，裸身无衣，颈脚锁械， 此明众生宿业，不修善根，诸恶备造，死入地狱饿鬼道中，裸形饥赢，头颈锁械。 但饿鬼死魂，身既无衣，项上着锁，脚上连械，未知中间，甚为楚痛。 足立剑树，头戴火山， 此皆随缘所受，言岂直饥饿裸形，每令身负铁杖，足立剑树，头戴火山，焚割其痛毒难忍。 或头然火炭，足立刀山，摧逼驱驰，考以铁杖，四肢锁械，运动无由，万劫之中，恒受斯罪。 此类众生，既受斯苦痛，未审中间，更有何色类。 大小相牵，五体烂坏，头面燋燎，镬汤煮渍，万痛切身， 释曰：此等状迹，即文可知，皆由前身弹射飞鸟，杀害众生，布网张罗，飞鹰走犬，刳胎探卵，鼎镬烹燖，广造诸愆，有此报对。 金锤乱拷，食息无闲，饥即食炭，渴饮火精， 此是恶业众生，造罪非一，悭食过重，饿鬼报身。 饥欲求食，食成火炭。 渴方就饮，水变火精。 此缘悭贪，障闭功德。 此乃诸经具明，非唯今为子说。 万劫#2恒在饿鬼道中。 大众慈悲，称无量善，一时举手弹指，敬礼寻声救苦天尊，愿生生世世，莫作悭贪，障闭功德，受如此报。 非直只饿鬼道中，亦更余处，流曳三涂五苦之中。 此言非直一处受报，乃更流曳三涂八难之中，无不周遍。",
      "translated_text": "Moreover, the mountain is named Yucha, its peak called Fuluo, and within its forests stands the everlasting mulberry—thus the place is so designated. This is where the sutra is expounded, described here in full. It is as when Confucius compiled the *Book of Documents* or when the Venerable Lord Lao discoursed at Hangu Pass. Having already identified the sage who proclaims the sutra and revealed the site of his teaching, we now further disclose the marvels of his dwelling.\n\nThe ground is spread with golden mats, the steps edged with white jade. Seven treasures and luminous jades gleam with radiance bright as the sun. Yellow clouds entwine on all four sides, purple mists coil thrice around, and fragrant light suffuses the azure void, overflowing into the empty sky.\n\n*Annotation:* This is the dwelling of the Heavenly Worthy, the third [section], describing the adornment of the land and the manifestation of auspicious signs. *Spread* means to lay out. The site of his teaching is entirely covered with gold, and the edges of its steps are bordered with white jade. The *seven treasures* include gold, silver, lapis lazuli, coral, amber, giant clams, and agate. *Luminous jades* are another name for jade. The Heavenly Worthy’s abode is adorned with rare and wondrous treasures, exquisitely arrayed, their brilliance resplendent, shining through the ten directions, illuminating all heavens, outshining the sun and moon—hence it is said that their light gleams like the sun.\n\nThe *yellow clouds entwining on all four sides* and the *purple mists coiling thrice* signify manifold auspicious omens. Yellow is the color of the central direction. True hues manifest blessings, joyous clouds display portents, all converging at once, arriving from every side, dense and luxuriant, swirling in encircling embrace. Moreover, light purple mists spiral thrice, while divine winds stir and fragrant vapors billow, filling the empty sky as offerings.\n\n*Annotation:* No other matters are spoken of here, yet *purple mists* are mentioned. Crimson and black intermingle to form purple. Crimson is yang, the Dao; black is yin, virtue. This reveals that the Heavenly Worthy’s virtue and Dao are like a compassionate cloud, sheltering all beings, their grace surpassing even that of parents. The rare and refined adornments of the celestial paradise, the natural rewards of karmic fruition, differ utterly from the mundane. Even the music and wondrous arts must be extraordinary. The *Celestial Harmony* is a marvelous sound arising naturally; the *Great Music* consists of sublime melodies beyond compare. Thus it is called *marvelous and refined music*. The *myriad forms interplaying* means that the sounds performed arise spontaneously, a thousand arts and ten thousand skills delighting the Heavenly Worthy. As the assembled heavens offer rare treasures and play refined music, the Heavenly Worthy rejoices, revealing his numinous countenance. A smile graces his face, and five-colored light streams from his mouth, penetrating and illuminating all heavens. This is the Heavenly Worthy’s joy manifesting his numinous presence—the fifth [section], displaying his majestic radiance.\n\nFrom the above to this point constitutes the *prefatory section*. The Heavenly Worthy is ever at ease, and when he smiles, his light is like spring’s warmth. Wherever his radiance reaches, all receive its grace, none left unilluminated. With the pure eye of the Dao, all sages share this vision, gathered together in the assembly, rightfully perceiving all.\n\nAt that time, all the sages, united in one place, universally beheld the hells within the boundless worlds of the ten directions. By the Heavenly Worthy’s majestic light, nothing in the hells remained unseen.\n\n*At that time* refers to the moment when the Heavenly Worthy expounds the sutra. *All the sages* is a collective term. United as one, they all universally perceived, yet knew not what torments and punishments filled the hells. The condemned toil in penal servitude, hungry ghosts and dead souls stand naked, their necks and feet bound in chains and fetters. This shows that beings, through past karma, fail to cultivate good roots and commit every evil. Upon death, they enter the hells and the hungry ghost realm, emaciated and bare, their heads and necks shackled. The hungry ghosts and dead souls, stripped of clothing, wear locks on their necks and fetters on their feet—how excruciating must their suffering be!\n\nTheir feet stand on sword trees, their heads bear fire mountains. These are the retributions they receive according to their karma. Not only do they endure hunger and nakedness, but their bodies are burdened with iron rods, their feet planted on sword trees, their heads crowned with fire mountains, scorched and sliced by unbearable pain. Some have their heads set aflame with burning coals, their feet planted on knife mountains, driven and tormented, beaten with iron rods. Their limbs bound in fetters, they cannot move, enduring this suffering for ten thousand kalpas.\n\nThese beings, enduring such agony, what other forms of torment might they undergo? Dragged by others, their five limbs rot and decay, their faces scorched and charred, boiled in cauldrons of seething broth, a myriad pains piercing their bodies.\n\n*Annotation:* The conditions described here are evident from the text. They arise from past lives’ sins: shooting birds in flight, slaughtering beings, setting nets and snares, flying hawks and hunting dogs, ripping open wombs and plundering eggs, boiling creatures in cauldrons—committing manifold transgressions, thus receiving such retribution.\n\nIron hammers rain blows without respite; hunger and thirst know no rest. When hungry, they eat burning coals; when thirsty, they drink fiery essence. This is the karmic retribution of evil beings, whose sins are manifold, their stinginess and greed excessive, reborn as hungry ghosts. When they seek food, it turns to burning coals; when they seek drink, water becomes fiery essence. This stems from miserliness, obstructing the accumulation of merit. Such is fully expounded in the sutras, not only now recounted for your sake. For ten thousand kalpas, they remain in the hungry ghost realm.\n\nThe assembly, moved by compassion, intoned boundless blessings. As one, they raised their hands, snapped their fingers, and paid reverence to the Heavenly Worthy Who Rescues from Suffering at the Sound of Prayers. They vowed that in life after life, they would never act with miserliness, obstructing the accumulation of merit, and thus receive such retribution. Not only in the hungry ghost realm, but in all other realms, they would drift through the three paths and five sufferings.\n\nThis is not merely retribution in one place, but rather drifting through the three paths and eight difficulties, nowhere untouched.",
      "overlap_context": "ly Divine Kings possess free and luminous wisdom. The youths are inwardly free from desires, outwardly detached from worldly pursuits, their pure nature unblemished, serene and still.\n\nTogether, they are in the Jade Realm of Xina, on Mount Yucha’s Fuluo Peak. This is a pure land, the wondrous realm of the Jade Capital, the celestial realm above the azure void. It is also said that the people of this land are purely pure and white, like white jade or fresh frost, hence it is named the Jade Realm.",
      "start_char": 2495,
      "end_char": 3758,
      "start_sentence": 116,
      "end_sentence": 170,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.54760432243347,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "三涂者，即是地狱道，畜生、饿鬼道。 五苦者，抱铜柱，履刀山，循剑树，入镬汤，吞火食炭。 并三涂地狱，是名八难。 但众圣慈悲，恒怀愍念，既斯痛切，应有问端，其次之若为起请。 道君稽首上白天尊，未审此辈罪人，生世之日，行何罪业，作何因缘，受斯楚痛。 伏愿天尊赐垂训励，告所未闻，如蒙开悟，仰受圣恩。 此明道君为请问，欲令未悟咸悉知闻。 道君既是圣人，先已悟知业报，於兹#3为其发问，欲以教化众生。 道君既问因缘，天尊作何酬答。 天尊告曰：斯罪人也，皆由前缘不见明教，不闻法音，悭贪无度，杀害无辜，口是心非，禁系#4贤人，饮酒食肉，祸乱五神。 此是天尊道君所问，告示因缘。 诸如此言等，皆众生之恶业。 但大道天尊慈悲救度，神光普被，远照十方，故使道君承威，语问既知，敬请具辩因缘。 言此业障罪人，前有过，不见明科圣教，不闻正法灵音，唯事悭贪，不崇功德，绝天堂路，作地狱因，沈溺爱河，漂流生死。 五神者，即五藏神也，魂魄神精志是也。 但饮酒食肉，罪业既深，非直浊乱五神，抑亦轮回八难，遂使六根三业，广造诸愆，匿恶潜怨，身心不善，任情杀生，贪吝无端，失道乖真，不知回向，一入地狱，终无出期。 骂詈咒诅，叫唤神明，欺师罔道，秽慢三光，篡君杀父，侵暴宗亲。 如此之义，分明可知。 但其咒诅之时，冀欲前人早败，呼神吹鬼，无所不为。 如此言词，造次难尽。 此言过去生中，愚痴欺慢，心无敬忌，增上骄奢，或欺慢法师，口诬真圣，秽触日月，轻慢星辰，为臣不忠，为子不孝，篡杀君父之处。 圣人难之，取其渐而害之，故云篡弒。 易曰：臣弒其君，子弒其父，非一朝一夕之故，其所由来者，渐矣。 篡即夺也，弒即杀也。 圣人恶之，易其名也。 心怀谄曲，不念众生，潜行窃盗，唝嗃无端，割夺功德，以饶一身。 不肯布施，散乞贫人。 今受斯苦，以酬宿怨。 其目如此，此等皆是人中所行之事，其义可知。 谄，希意之意，谓之谄。 布施者，以己有济人之急，遍布既均，名之布施。 庄子曰：青青之麦，生於陵陂。 生不布施，死何含珠。 为生有攻劫之忧，死有掘冢探棺之患。 但俗间恶业，其数极多，略说而言之，难以穷悉，大纲名目，有如此等。 天尊以次而说偈言#5。 天尊以其向来问答次序，重申其意，详而说之，其名曰偈。 偈者，赞颂之别名也。 重明其义，故易之日偈。 篡杀於君父，杀害无辜人。 死受金锤打#6，铁杖不去身。 此即偈之文也。 前文中篡杀在后，今偈则篡杀在前者，但君父之重，自古为先，三千之条无杀，故於偈中而为称首。 此重明上长行中篡君父义。 乘暗入他家，掠夺人财物。 死魂地幽狱，万劫不得出#7。 此言之等，其义可解。 故庄论云：为不善於显明之中者，人得而诛之。 为不善於幽暗者，鬼得而诛之。 明於人明於鬼者，然后能独行。 故知冥司叵罔，神道难欺，所有罪愆，纤毫必录，善恶报应，如影随形，一堕三涂，万劫无出。 此重明上长行窃盗之罪。 奢淫好细滑，秽慢於三光。 死魂受幽闭，后生并痴狂#8。 此明身之业罪。 言邪行之人，耽淫无度，唯贪色欲，细滑是求，触犯日月星辰，不避三光。",
      "translated_text": "The Three Paths refer to the hell realm, the animal realm, and the hungry ghost realm. The Five Sufferings are: embracing bronze pillars, treading upon knife mountains, walking through sword trees, entering cauldrons of boiling liquid, and swallowing fire and eating coals. Together with the Three Paths of hell, these are called the Eight Difficulties.\n\nYet all the sages, moved by compassion, ever hold pity in their hearts. Given such grievous torment, there must be questions to raise. What follows is how the inquiry begins.\n\nThe Dao Lord bowed deeply and addressed the Heavenly Worthy: \"We pray to know what sins these offenders committed in their past lives, what karmic causes they created, to endure such agony. We humbly beseech the Heavenly Worthy to bestow instruction, to reveal what we have not yet heard. If we are graced with enlightenment, we shall reverently receive the sagely grace.\"\n\nThis shows the Dao Lord making the inquiry to ensure that all who have not yet awakened may hear and know. Though the Dao Lord is a sage who has already understood karmic retribution, he now raises these questions to teach and transform all beings.\n\nAfter the Dao Lord asked about the causes and conditions, how did the Heavenly Worthy respond?\n\nThe Heavenly Worthy declared: \"These offenders, due to past causes, did not encounter the luminous teachings, did not hear the Dharma’s sound. They were miserly and greedy without measure, killed the innocent without cause, spoke falsely while harboring deceit, imprisoned the worthy, drank wine and ate meat, and brought chaos to the five spirits.\n\nThis is the Heavenly Worthy’s response to the Dao Lord’s inquiry, revealing the causes and conditions. All such acts are the evil karma of sentient beings.\n\nYet the Heavenly Worthy of the Great Dao, in boundless compassion, saves and delivers all. His divine radiance universally illumines, shining afar upon the ten directions. Thus, the Dao Lord, bearing the Heavenly Worthy’s majesty, having heard and understood the questions, respectfully requested a full explanation of the causes and conditions.\n\nThese karmic-obstructed offenders, in their past lives, committed transgressions, did not encounter the luminous precepts of the sagely teachings, did not hear the wondrous sounds of the true Dharma. They were solely devoted to miserliness and greed, did not honor merit and virtue, severed the path to heaven, and created the causes for hell. They sank into the river of love, drifting through the cycle of birth and death.\n\nThe five spirits refer to the spirits of the five viscera: the hun, po, spirit, essence, and will. Yet by drinking wine and eating meat, their karmic offenses deepened. Not only did they pollute and disturb the five spirits, but they also revolved through the Eight Difficulties, causing the six roots and three karmic actions to widely create transgressions. They concealed evil and harbored resentment, their bodies and minds unwholesome. They wantonly killed living beings, their greed and stinginess boundless. They lost the Dao and strayed from the true, not knowing how to turn back. Once they enter hell, they shall have no end to their release.\n\nThey cursed and reviled, invoked spirits and gods, deceived their teachers and betrayed the Dao, defiled and disrespected the Three Luminaries, usurped their lords and murdered their fathers, and violently harmed their kin. Such meanings are clearly understood.\n\nWhen they cursed and reviled, they wished for others’ swift ruin, calling upon spirits and invoking ghosts, stopping at nothing. Such words and deeds are too numerous to recount in haste.\n\nThis refers to their past lives, when in ignorance and arrogance, their hearts held no reverence or restraint. Their pride and extravagance grew, or they deceived and disrespected Dharma masters, slandered true sages, defiled the sun and moon, and belittled the stars. As ministers, they were disloyal; as children, they were unfilial. In places where they usurped and murdered their lords and fathers—sages find such acts abhorrent, for they harm gradually, hence the term 'usurpation and regicide.'\n\nThe *Book of Changes* states: \"When a minister murders his lord, or a child murders his father, it is not a matter of a single morning or evening. Its origins lie in gradual accumulation.\" *Usurpation* means to seize, and *regicide* means to kill. Sages detest such acts and thus alter their names.\n\nTheir hearts harbored flattery and deceit, they did not consider the suffering of beings, secretly committed theft, and endlessly slandered others. They seized merit and virtue to enrich themselves, yet refused to practice generosity or give alms to the poor. Now they endure such suffering to repay past enmity.\n\nSuch are the deeds they committed while among humans, and their meanings are clear. *Flattery* means to curry favor. *Generosity* means to use what one has to relieve others’ distress, distributing it evenly—hence the term *generosity*.\n\n*Master Zhuang* said: \"Green wheat grows upon the hillside. If in life one does not practice generosity, in death, why hold pearls in the mouth? In life, one fears the worry of robbery; in death, one fears the calamity of grave robbers desecrating the coffin.\"\n\nYet the evil karma of the mundane world is vast in number. To speak of it briefly is difficult to exhaust. The main categories and names are as such.\n\nThen the Heavenly Worthy, following the sequence of the preceding questions and answers, reiterated the meaning in detail, calling it a *gatha*. A *gatha* is another name for praise and eulogy. To restate the meaning, it is thus called a *gatha*.\n\n*They usurped and murdered their lords and fathers,*\n*Killed the innocent without cause.*\n*In death, they receive blows from golden hammers,*\n*Iron rods never leave their bodies.*\n\nThis is the text of the gatha. In the preceding passage, usurpation and murder came later, but in the gatha, they appear first. The weight of lords and fathers has been primary since ancient times. Among the three thousand precepts, \"do not kill\" is foremost, hence it is placed first in the gatha. This re-emphasizes the meaning of usurping lords and fathers from the preceding prose.\n\n*Entering others’ homes in darkness,*\n*Plundering their wealth and goods.*\n*Their dead souls descend to dark hell,*\n*For ten thousand kalpas, they shall not emerge.*\n\nSuch words are self-explanatory.\n\nThus, *Master Zhuang* said: \"Those who do evil in the light are punished by men. Those who do evil in darkness are punished by ghosts. Only when one is clear before both men and ghosts can one act alone.\" Hence, we know that the netherworld cannot be deceived, and the divine way is not to be trifled with. All transgressions, even the slightest, are recorded. The retribution of good and evil follows like a shadow. Once one falls into the Three Paths, they shall not emerge for ten thousand kalpas.\n\nThis re-emphasizes the sin of theft from the preceding prose.\n\n*Lustful and indulgent in excess,*\n*Defiling and disrespecting the Three Luminaries.*\n*Their dead souls suffer dark confinement,*\n*In later lives, they are both mad and deranged.*\n\nThis clarifies the karmic offenses of bodily actions. It speaks of those who engage in depravity, indulging in lust without restraint, solely pursuing desire, seeking refinement and smoothness, offending the sun, moon, and stars, and disregarding the Three Luminaries.",
      "overlap_context": ", and paid reverence to the Heavenly Worthy Who Rescues from Suffering at the Sound of Prayers. They vowed that in life after life, they would never act with miserliness, obstructing the accumulation of merit, and thus receive such retribution. Not only in the hungry ghost realm, but in all other realms, they would drift through the three paths and five sufferings.\n\nThis is not merely retribution in one place, but rather drifting through the three paths and eight difficulties, nowhere untouched.",
      "start_char": 3758,
      "end_char": 5013,
      "start_sentence": 171,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.13848805427551,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "明受罪既终，始生人道，虽得人身，乃被颠狂愚痴之报。 此即明其身业之罪，次陈口业，更后若为。 凶横作口舌，斗乱於宗亲。 死受镕铜灌，后身#9恒吠人。 此即明其口业。 但口业之人，专行绮语，虚传口舌，斗乱宗亲，反是为非，破他和合，妄生祸福，损陷於人，死入地狱之中。 即镕铜灌口，受罪之后，余业更生，报处狗身，见人恒吠。 食啖於众生，饮酒乱五神。 死受镬汤煮，铁杖不去身#10。 此言啖食之人，残他性命，饮酒食肉，不念众生，遂令五藏之神，昏迷浊乱，口贪肥饱，不悟业报随身，及至命终，沈沦地狱，镬汤炉炭，煎煮其身，万痛交连，恒不去体。 此重明上长行中饮酒食肉之罪。 唝嗃虚为实，欺诱顽益己#11。 死受拔舌报，后生不得语。 此言妄语之人，公行谲诈，以至欺诳眩诱，巧作多端，恒为不轨，谋之以求益己之事。 死后魂沈地狱，乃受拔舌之殃，罪毕报生，仍令喑哑。 此明妄语之罪，覆上长行中唝嗃无端。 欺师不信道，叫唤於神明。 流曳三涂中，后生六畜身。 但以诳惑师尊，罔诬真圣，轻三宝，秽灵文，於道中馒生分别，口彰粗横，咒诅为言，牵引神明，高呼大吹，婴缠恶业，坠陷三涂，轮转去来，死生劳曳。 受罪既毕，更处六畜之形，沈滞多身，失於人道。 此明欺天之罪，覆上长#12行中欺师罔道，叫唤神明o 谗谤击贤人，谄曲作无端。 死堕毒兽螫#13； 辗转无一欢。 但谗谈谤讟，潜击贤人，谄进曲巧，陈诈其人，命蜂虿之身，或作蚖蛇，或蝮蝎诸毒虫等，次递遍为，辗转秽恶，受生何时，更知欢乐。 从凶横作口舌，至此总明口业报对。 自此以下，举其意业。 减割功德物，以纵悭贪心。 死魂为饿鬼，饥渴饮火精#14。 此具明意业，但崇善之减己削身，布施财物，造经像以为存亡。 或有贪人中间，割截功德物，一时虽得润己，报罪如影随形，死堕饿鬼之中，饥则吞火食炭。 贪欲之罪，招报如斯，万劫千生，不闻浆水名字，饥即食炭，渴饮火精。 此明贪欲之罪，覆上长行中割夺功德，以饶一身。 侮慢於耆德，不敬有道人。 后生为下贱，报处六畜形#15 。 此明是非人我，不敬师尊，侮慢耆德，即於贱之人报。 生不敬崇三宝，死受六畜之身。 业报相随，一无差失。 或生於边地下贱，外远蛮夷，虽复受得人身，不闻三宝名字，真经正法，万劫难逢，圣教灵文，何由可见。 割减功德物至此，明其意业。 天尊说偈既了，道君作礼请。 天尊说此偈已，太上道君前进作礼，上白天尊：今日欣会，庆亦难言。 天尊垂盻，赐告罪根，未审斯等罪人，皆有眷属，见在亲罗，为当即身更无后嗣#16。 天尊说偈既终，道君怀疑将问，若不教拔赎，众生无出苦门。 冀垂救度之方，所以殷动请问，前进稽首，作礼兴言，天尊慈悲，赐垂指诀，馑闻命旨，庆幸难言。 道君又知众生男女子孙，代代不绝，将欲教其胤绪，救拔先亡，故起问端，以招后义。 天尊告曰：虽有男女种前业根，不修功德，不作因缘，何由可免，辗转增笃，沈沦罪田#17，亿劫辛苦，无由得还。 众恶备履，望反绵绵。 天尊言：其罪人后代男女子孙眷属，既无功德，唯有地狱因缘，辗转增多，弥加笃厚，终既悲魂，苦爽沈滞，沦回罪秽，心田种前恶业。",
      "translated_text": "When their punishment for clear transgressions is complete and they begin to be reborn in the human realm, though they obtain a human body, they suffer the retribution of madness, folly, and derangement. This clarifies the karmic offenses of bodily actions, then proceeds to speak of the offenses of speech, and what follows thereafter.\n\n*Fierce and quarrelsome in speech,*\n*They sow strife among their kin.*\n*In death, they suffer molten copper poured down their throats;*\n*In later lives, they are ever barking at others.*\n\nThis clarifies the offenses of speech. Those who commit offenses of speech engage in frivolous talk, spread false rumors, sow discord among their kin, reverse right and wrong, destroy harmony, recklessly invoke fortune and misfortune, and harm others. After death, they fall into hell, where molten copper is poured into their mouths. Once their punishment is complete, residual karma causes them to be reborn as dogs, ever barking at people.\n\n*Feasting on living beings,*\n*Drinking wine to disorder the five spirits.*\n*In death, they suffer boiling in cauldrons,*\n*With iron rods never leaving their bodies.*\n\nThis speaks of those who devour living beings, taking lives without remorse, consuming wine and meat, and neglecting all beings. Thus, the spirits of their five viscera become confused and disordered. Gluttonous for rich flavors, they fail to realize that karmic retribution follows them. At life’s end, they sink into hell, where they are boiled in cauldrons and scorched by furnace coals, enduring myriad pains that never leave their bodies. This re-emphasizes the sin of drinking wine and eating meat from the preceding prose.\n\n*Clamorous, they turn falsehood into truth,*\n*Deceiving and deluding the foolish to benefit themselves.*\n*In death, they suffer the retribution of having their tongues torn out;*\n*In later lives, they are mute.*\n\nThis speaks of those who engage in deceitful speech, openly practicing cunning and fraud, using deception and trickery, employing all manner of schemes, and constantly acting unlawfully to seek personal gain. After death, their souls sink into hell, where they suffer the calamity of having their tongues torn out. Once their punishment is complete, they are reborn mute. This clarifies the sin of deceitful speech, echoing the earlier prose on groundless clamor.\n\n*Deceiving their teachers and disbelieving the Dao,*\n*They clamor and invoke the divine.*\n*Dragged through the Three Paths,*\n*In later lives, they take the forms of the six livestock.*\n\nThose who deceive and delude their teachers, slander the true sages, belittle the Three Treasures, defile sacred texts, create divisions in the Dao, utter coarse and violent words, and use curses and invocations, calling upon the divine with loud shouts—such evil karma binds them, casting them into the Three Paths, where they are endlessly tossed and tormented. Once their punishment is complete, they are reborn in the forms of the six livestock, sinking into myriad bodies and losing the human way. This clarifies the sin of defying heaven, echoing the earlier prose on deceiving teachers, defying the Dao, and clamoring to the divine.\n\n*Slandering and striking the worthy,*\n*Flattering and scheming without cause.*\n*In death, they fall to be stung by venomous beasts;*\n*Endlessly tormented, they know no joy.*\n\nThose who engage in slander, defamation, and secret attacks on the worthy, flattering and scheming with deceit, are reborn with the bodies of wasps, scorpions, vipers, or other venomous creatures, taking turns in these foul forms. When will they ever know joy again? From the fierce and quarrelsome speech to this point, all clarify the karmic retribution for offenses of speech.\n\nHereafter, the offenses of the mind are addressed.\n\n*Diminishing and appropriating offerings of merit,*\n*Indulging their miserly and greedy hearts.*\n*In death, their souls become hungry ghosts,*\n*Hungry and thirsty, they drink fire and consume essence.*\n\nThis fully clarifies the offenses of the mind. When those who cultivate goodness deduct from their own bodies, offer alms, and create scriptures and images for the living and the dead, some greedy individuals intercept and appropriate these offerings of merit. Though they may temporarily benefit themselves, retribution follows like a shadow. After death, they fall into the realm of hungry ghosts, where hunger drives them to swallow fire and eat coals. The sin of greed brings such retribution—through ten thousand kalpas and a thousand rebirths, they never hear the name of water or broth. When hungry, they eat coals; when thirsty, they drink fire. This clarifies the sin of greed, echoing the earlier prose on appropriating offerings of merit to enrich oneself.\n\n*Disrespecting and insulting the venerable,*\n*Failing to revere those who embody the Dao.*\n*In later lives, they are born lowly,*\n*Taking the forms of the six livestock.*\n\nThis clarifies the sin of discriminating between self and others, disrespecting teachers, and insulting the venerable—such retribution is born among the lowly. Those who fail to revere the Three Treasures in life are reborn in the forms of the six livestock. Karmic retribution follows without the slightest deviation. Some are born in remote, lowly lands, among barbarians far from civilization. Though they may obtain a human body, they never hear the names of the Three Treasures, the true scriptures, or the correct Dharma. Through ten thousand kalpas, they rarely encounter them, and the sacred teachings and divine texts remain unseen. From the appropriation of offerings of merit to this point, the offenses of the mind are clarified.\n\nWhen the Heavenly Worthy finished reciting the verses, the Dao Lord bowed and made his request. After the Heavenly Worthy had spoken these verses, the Most High Dao Lord advanced, bowed, and addressed the Heavenly Worthy: \"Today’s joyous gathering is beyond words. The Heavenly Worthy has deigned to gaze upon us and bestow teachings on the roots of sin. I wonder—do these sinful beings have families, living relatives, and descendants, or do they leave no heirs in their present lives?\"\n\nWhen the Heavenly Worthy finished reciting the verses, the Dao Lord, harboring doubts, prepared to ask: if no means of redemption were taught, sentient beings would have no escape from suffering. Hoping for a method of salvation, he earnestly posed his question, advancing to bow and speak. The Heavenly Worthy, in his compassion, deigned to bestow guidance. Overwhelmed with gratitude, the Dao Lord heard the decree, his joy beyond words.\n\nThe Dao Lord also knew that sentient beings’ sons and daughters, their descendants, continue unbroken through generations. Wishing to teach them how to preserve their lineage and save their departed ancestors, he raised this question to introduce what follows.\n\nThe Heavenly Worthy replied: \"Though they may have sons and daughters, if they do not cultivate merit or create karmic conditions, how can they escape? Their transgressions grow ever more severe, sinking them into the fields of sin. Through countless kalpas of suffering, they have no way to return. All evils are committed, and their hopes of rebirth stretch endlessly.\"\n\nThe Heavenly Worthy said: \"The descendants, sons, daughters, and families of these sinners, lacking merit and possessing only the karmic conditions of hell, see their transgressions grow ever more numerous and grave. In the end, their sorrowful souls, suffering spirits, sink and stagnate, trapped in the filth of sin, their minds planting the seeds of past evil karma.\"",
      "overlap_context": "asizes the sin of theft from the preceding prose.\n\n*Lustful and indulgent in excess,*\n*Defiling and disrespecting the Three Luminaries.*\n*Their dead souls suffer dark confinement,*\n*In later lives, they are both mad and deranged.*\n\nThis clarifies the karmic offenses of bodily actions. It speaks of those who engage in depravity, indulging in lust without restraint, solely pursuing desire, seeking refinement and smoothness, offending the sun, moon, and stars, and disregarding the Three Luminaries.",
      "start_char": 5013,
      "end_char": 6294,
      "start_sentence": 227,
      "end_sentence": 275,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.06779766082764,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "又云积恶之人，罪可滋植，犹如枳棘丛生荒秽之田，纵有五谷善芽，落在其中，终被沈芜沦翳，不得秀苗成实，故云罪田。 天尊以其地狱罪深，将与救拔盛沦难免之义，以招更问之端。 道君稽首又问天尊：作何因缘，得离众苦。 行何福业，得还人中。 释曰：道君愍念众生沈沦地狱，重与告问，以树福田，欲使孝子顺孙，念先亡之苦痛，慈兄悌弟，忆骨肉之沦没，减削家财，以相救拔。 重为斯问，崇起福田。 此下举天尊告罪，罪类不同，令作大献拔赎之法。 就此之中，分为三段： 初明罪众不同，卒难救济； 第二举元校录，令识归崇； 第三尔时众奉之仪，劝令仿学。 天尊告曰：斯等罪人，造罪既多，非是一类。 若欲救拔，亦难可同#18。 非一人力，得以济免。 问此是第一，明罪众不同，卒难救济。 天尊以其业根相随，罪根难拔，但立功树福田，非愿广不迁移，谢罪除殃，非功多不克，若以一人之力，不可免济群凶，故知行恶之人，卒难救技，自非多崇缘业，广建福田，若不凭藉众缘，造次何能济度。 既须功德，欲为何等。 次去以下功德若为。 当依玄都大献法，七月十五日中元之辰，地官校戒，擢选众人，分别善恶，诸天大圣，普诣宫中，简定劫数，人鬼簿录，饿鬼囚徒，一时俱集# 问此是第二段，令识归崇。 言天尊三元大会之日，兼陈九府检勾之由，具明搜之晨，委示诸官校定善恶之际，使来世众生，令依此三元之日，各各上仿玉京玄都大献轨则，供养三代天尊、十方圣众、九玄七祖、法界苍生，咸蒙拔赎之因，俱得解脱。 此七月十五日，是中元地官校戒之日。 十方众圣普来集会，於是天官、水官及诸曹等，五亿五万五千五百五十五亿贤圣俱会，简定劫数，考校罪人轻重等级，欲於此日以设供养，拔度父母亡灵，未知作何法用。 以其日夜烧香然灯，照耀诸天九幽长夜八门之中。 作玄都大献，仿玉京山，采诸花果，依以五色，世间所有众奇异物，道具名珍，绫文锦绮，玩弄服饰，十绝旛幢，宝盖庄严，供养之具，肴膳饮食，百味芬芳，献诸众圣，及道士等# 。 释日：此是第三，示修奉之仪，劝令仿学。 说五色者，即是青、黄、赤、白、黑是也。 交复五色之缯，以为旛盖，庄严供养。 天尊以见地狱罪人，动经亿劫，故令孝养父母，为过去先亡探拾人间所有珍奇异物，仿效玄都玉京，以为供养之具，献诸十方众圣及道士等，救拔过往亡灵地狱之苦。 当愿九玄七祖，法界苍生，凭兹供养之因，并护天堂之果报。 欲屈十方众圣，及道士等，作何功德。 於其日夜讲说是经，十方大圣齐咏灵篇，囚徒饿鬼，当得解脱，一俱饱满，免 於众苦，得还人中。 自非如斯，难可拔赎# 。 释曰：天尊广陈诸法，冀在劝示因缘。 当恐正信者稀，所以重重付嘱。 每於大献之命，皆令启请法师，日夜六时，修斋讲说。 其日夜者，即是今七月十五日夜，於此日当修斋建讲，烧香然灯，照耀诸天九幽之内，八门之中。 九幽者，九幽地狱也。 八门者，八难之门，并是众生受罪之处。 至此三元齐日，仿玄都玉京作大献之法，备尽人间所有珍奇异果，百味芬芳，供养三宝。 於是十方及道士等，感此至言，为之诵咏，上通九亿，下彻六天，地狱罪人，一时解脱。",
      "translated_text": "The text further states that those who accumulate evil have sins that flourish and multiply, like brambles and thorns overrunning a barren, filthy field. Even if the seeds of the five grains or good sprouts fall therein, they are ultimately choked by the overgrowth, never able to grow into stalks or bear fruit—hence the term \"fields of sin.\" The Heavenly Worthy, seeing the depth of hell’s sins and the difficulty of rescuing those mired in suffering, thus raises this question to introduce what follows.\n\nThe Dao Lord bowed and again asked the Heavenly Worthy: \"By what karmic conditions may one escape the manifold sufferings? By what meritorious deeds may one return to the human realm?\"\n\nThe commentary explains: The Dao Lord, moved by compassion for beings sunk in hell, posed this question once more to establish fields of merit, urging filial sons and obedient descendants to recall the agony of their departed ancestors, and loving brothers to remember the plight of their kin lost in suffering. They are to reduce their family wealth to perform acts of salvation. This repeated inquiry serves to exalt and cultivate the fields of merit.\n\nBelow, the Heavenly Worthy expounds upon the sins of the damned, their varied types, and the methods of grand offerings for redemption. This section is divided into three parts:\nFirst, it clarifies that the multitude of sinners differ in kind, making their salvation difficult to achieve uniformly.\nSecond, it presents the *Yuanjiao Record*, guiding those who seek refuge and veneration.\nThird, it describes the rituals to be observed by the assembly, encouraging emulation.\n\nThe Heavenly Worthy declared: \"These sinners have committed countless transgressions, and their offenses are not of a single type. If one seeks to save them, the methods cannot be the same. No single person’s effort suffices to deliver them all.\"\n\nThis is the first part, explaining that the multitude of sinners differ in kind, making their salvation difficult to achieve.\n\nThe Heavenly Worthy continued: \"As their karmic roots follow them, their sinful roots are hard to uproot. Only by establishing merit and cultivating fields of virtue—without broad vows and unwavering resolve, without ample merit—can one atone for sins and dispel calamities. If relying solely on one person’s strength, how can the multitude of evildoers be saved? Thus, those who commit evil are difficult to rescue unless they widely cultivate karmic conditions and broadly establish fields of merit. Without relying on collective causes, how can one hastily achieve deliverance? Since merit is required, what kind should be performed?\"\n\nNext, the text explains the nature of such merit.\n\nOne should follow the *Great Offering of the Mysterious Capital* on the fifteenth day of the seventh month, the Zhongyuan Festival, when the Earth Official conducts his review. He selects the multitude, distinguishing good from evil. All the great sages of the heavens descend to the palaces, determining the kalpas and examining the records of humans and ghosts. The prisoners and hungry ghosts assemble as one.\n\nThis is the second part, guiding those who seek refuge and veneration.\n\nThe Heavenly Worthy spoke of the Three Yuan Assemblies, also recounting the reasons for the Nine Bureaus’ investigations. He fully explained the morning of the search, detailing how the various officials assess good and evil, so that future generations may follow the example of the *Great Offering of the Jade Capital of the Mysterious Capital* on these Three Yuan days. Each should make offerings to the Three Generations of Heavenly Worthies, the saints of the ten directions, the Nine Ancestors and Seven Generations, and all beings in the Dharma realm, that all may receive the causes of redemption and attain liberation together.\n\nThe fifteenth day of the seventh month is the Zhongyuan Festival, when the Earth Official conducts his review. Saints from the ten directions gather in assembly. The Heavenly Official, Water Official, and all the bureaus—five hundred fifty-five thousand five hundred fifty-five billion sages—convene to determine the kalpas, examine the severity of sinners’ offenses, and rank them accordingly. On this day, offerings are made to deliver the spirits of deceased parents. What methods should be used?\n\nOn that day and night, incense is burned, and lamps are lit to illuminate the nine dark realms of the heavens and the eight gates of eternal night. The *Great Offering of the Mysterious Capital* is performed, modeled after the Jade Capital Mountain. Flowers and fruits of all kinds are gathered, arranged in five colors. All the rare and wondrous treasures of the world, sacred implements, precious objects, patterned silks, brocades, toys, garments, ten kinds of banners and canopies, jeweled parasols, and adornments for offerings—along with delicacies, fine foods, and fragrant hundred-flavored dishes—are presented to the assembled saints and Daoist masters.\n\nThe commentary states: This is the third part, demonstrating the rituals of devotion and encouraging emulation.\n\nThe five colors are blue, yellow, red, white, and black. Banners and canopies are made from interwoven five-colored silks to adorn the offerings. Seeing the hell-bound sinners suffering for kalpas uncounted, the Heavenly Worthy commands filial children to gather all the rare and wondrous treasures of the human realm, modeling them after the Jade Capital of the Mysterious Capital, to make offerings to the saints of the ten directions and Daoist masters, thereby rescuing the spirits of the departed from the sufferings of hell.\n\nOne should vow that the Nine Ancestors and Seven Generations, and all beings in the Dharma realm, may rely on the causes of these offerings and be protected by the karmic rewards of heaven. How should the saints of the ten directions and the Daoist masters perform merit on this day?\n\nOn that day and night, this scripture is expounded, and the great saints of the ten directions chant the sacred verses in unison. The prisoners and hungry ghosts are thereby liberated, all sated and freed from suffering, returning to the human realm. Without such efforts, redemption is difficult to achieve.\n\nThe commentary explains: The Heavenly Worthy extensively expounded these methods, hoping to encourage and instruct. Fearing that those of true faith are few, he repeatedly entrusted these teachings. At every command for the Great Offering, he instructed that masters be invited to perform purification rites and expound the scripture day and night in six periods.\n\nThe \"day and night\" refers to the night of the fifteenth day of the seventh month. On this day, purification rites are held, lectures are given, incense is burned, and lamps are lit to illuminate the nine dark realms of the heavens and the eight gates of suffering. The \"nine dark realms\" are the nine hells, and the \"eight gates\" are the eight gates of calamity, where beings endure punishment.\n\nOn these Three Yuan days, the *Great Offering* is performed in imitation of the Jade Capital of the Mysterious Capital, presenting all the rare and wondrous fruits and fragrant hundred-flavored delicacies of the human realm as offerings to the Three Treasures. Thereupon, the saints of the ten directions and the Daoist masters, moved by these sacred words, chant and recite, their voices ascending to the nine billion heavens and descending to the six heavens. The sinners in hell are all liberated at once.",
      "overlap_context": "untless kalpas of suffering, they have no way to return. All evils are committed, and their hopes of rebirth stretch endlessly.\"\n\nThe Heavenly Worthy said: \"The descendants, sons, daughters, and families of these sinners, lacking merit and possessing only the karmic conditions of hell, see their transgressions grow ever more numerous and grave. In the end, their sorrowful souls, suffering spirits, sink and stagnate, trapped in the filth of sin, their minds planting the seeds of past evil karma.\"",
      "start_char": 6294,
      "end_char": 7559,
      "start_sentence": 276,
      "end_sentence": 317,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.28985071182251,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "吾过去后，东善非极，西恶非深，苦县君子，当之大秦。 上皇之后三万六千年，此劫数尽，天地将坏，人人涂炭# 。 释曰：天尊说此经时，言我过去之后，皆有教化之人累起，相袭代代，常有圣明王，绍隆三宝。 东善非极，西恶非深者，言东方未必极善而无恶，西方未必深恶而无善。 苦县君子，即是老君应身，玄妙玉女割左腋而生於陈郡苦县，故云苦县。 堂玉# 之际，东西南北行九步，因即能言，自指李树为姓，天上天下，唯我独尊。 即九龙从地踊出，吐水沐浴。 出龙之地，便为九井，至今见在。 又云：老君应身三界火宅苦海之中，亦是一苦县也。 当之大秦，即西方天竺之别名也。 之，适也。 老君西至流沙，适於严宾，行浮图之教，以化戎俗。 故《后汉书》云：老君说浮图经，以化戎俗。 言浮图好清浄，今之释中浮图经者，即老君之所说也。 但以僧众无知，妄为添解讹义，前圣疑惑，后人致更作伪返真，更相引导，淳朴之教，於兹遂浇。 华文竞兴，奸讹弥烦。 朴散淳浇，邪伪纷葩。",
      "translated_text": "When I pass into the past, the goodness of the East shall not be absolute, nor shall the evil of the West be profound. The noble ones of苦 County shall journey to the Great Qin. After thirty-six thousand years from the era of the Supreme Sovereign, this kalpa shall reach its end, heaven and earth shall crumble, and all people shall suffer in the fires of tribulation.\n\nThe *Scripture* states: When the Heavenly Worthy spoke this sutra, He declared that after His passing, those who propagate the teachings shall arise in succession, generation after generation, with sagely and enlightened kings perpetuating the Three Treasures. \"The goodness of the East shall not be absolute, nor shall the evil of the West be profound\" means that the East is not entirely good without evil, nor is the West entirely evil without goodness. The \"noble ones of苦 County\" refer to Lord Lao’s incarnate form, born from the Mysterious Jade Maiden, who cut open her left armpit in苦 County of Chen Commandery—hence the name苦 County. At the moment of His birth, He walked nine steps in each of the four directions, and upon speaking, pointed to a plum tree as His surname, declaring, \"Above heaven and below heaven, I alone am revered.\" Then, nine dragons surged forth from the earth, spouting water to bathe Him. Where the dragons emerged, nine wells formed, which remain visible to this day.\n\nIt is also said: Lord Lao’s incarnate form appeared within the burning house of the Three Realms and the苦 sea of suffering—this, too, is a \"苦 County.\" \"Journey to the Great Qin\" refers to the alternate name for the Western land of Tianzhu. \"Journey\" means \"to go.\" Lord Lao traveled west to the Flowing Sands, reaching the land of Yanzhin, where He propagated the teachings of the *futu* to transform the barbarian customs. Thus, the *Book of the Later Han* states: \"Lord Lao expounded the *futu* sutras to transform the barbarian customs.\" The *futu* teachings emphasize purity and stillness, and the *futu* sutras of today’s Buddhist tradition were originally spoken by Lord Lao. However, due to the ignorance of the monastic community, they recklessly added false interpretations and distorted meanings. The sages of former times were misled, and later generations further fabricated falsehoods, turning truth into deception. Through mutual influence, the teachings of simplicity and sincerity became corrupted. As ornate literature flourished, deceit and falsehoods multiplied. The pure and simple dissolved, and the false and deceptive bloomed like flowers.",
      "overlap_context": " Three Yuan days, the *Great Offering* is performed in imitation of the Jade Capital of the Mysterious Capital, presenting all the rare and wondrous fruits and fragrant hundred-flavored delicacies of the human realm as offerings to the Three Treasures. Thereupon, the saints of the ten directions and the Daoist masters, moved by these sacred words, chant and recite, their voices ascending to the nine billion heavens and descending to the six heavens. The sinners in hell are all liberated at once.",
      "start_char": 7559,
      "end_char": 7961,
      "start_sentence": 318,
      "end_sentence": 334,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.15131664276123,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "无极世界男女之人，性习悭贪，死为饿鬼，饥其魂神，授食不得，变为埃尘# 。 释曰：未断浇讹，专行浮诈，无极世界，即此方之名也，亦名阎浮之界。 但此土众生，承为娇怪，邪淫颠倒，迷惑札纷，既悭贪，是非人我，死为饿鬼，以报宿愆，与食变作埃尘，眼见不能入口。 浩劫辛苦，涂炭沈沦。 辗转五道，以报昔怨。 今故相告，宜遵之焉。 来生男女，当自翘勤，勤情励己，勿为罪由也# 。 释曰：浩者，大也。 言广大劫来，常为饿鬼。 纵令更受罪得了，还生下贱之家，轮回五道之间，必竟不能成圣。 五道者，即为天堂道，人道，畜生道，地狱道，饿鬼道。 天尊更劝励以告道君，来生男女，当自克翘，心勤励志，勿作罪由。 罪由者，即罪业也。 言人所为善恶，叉获其报，犹如种田收子，各随种类，春种秋收，故曰罪田。 尔时，太上道君得闻命旨，稽首作礼而说偈言# 。 此即名道分。 尔时者，即是天尊说法缘讫，付前道君之时。 太上道君既闻天尊说是大献拔度之经，又说今生来生之诫，殷勤教诲，宣布流转，稽首尊前，赞叹其美，奉承妙旨，庆幸难言。 善既不可思议，遂即因而说偈。 前生有缘会，今得见天尊。 先说今劫已，复告后劫愆# 。 释曰：此则道君自欣幸，故遂作偈，赞天尊前代今生，道缘相会，遂得亲承至道，觐谒天尊。 又蒙告示因缘，以相拔度，传授付嘱，速转法轮，立誓勤行，不生怠慢。 前劫后劫，皆蒙道恩。 又后劫愆者，二云# 后身道君以诫众生贪嗔痴罪，故说此偈。 但贪欲之人，好为积贮，广求财物，唯事骄奢，各擅豪华，不崇功德，心无慈悲，不念众生，今生不竖福田，死后沈沦恶道。 如此之报，次定无疑。 皆前身不修善功，后身受其殃苦，诸如此等，并是后劫之深愆也。 勤行修至道，勿与有为怨。 贪欲成大患，嗔痴为祸源。 释曰：此偈诫贪欲嗔痴罪。 道君意欲觉悟群迷，故作颂论其因缘之本，祸福之源。 言贪欲者累身之患，嗔痴者为祸败之根源。 故略述所由，劝令除断。 又道君既开天尊之教，因而演说，以此为将来之诫，但以财色名利，是祸息之源，贪欲嗔痴，是灭身之本。 然岂为修真，妨人道行，抑亦丧失福田。 若能三毒不兴，六根清净，即是修生之道，尘触不婴，可为拔苦之津梁，更有何灾难。 断除烦恼障，三业自清闲。 邪魔不能乱，岂遭地狱艰。 释曰：但烦恼所生，因由三业，邪魔扰乱，缘起六根。 但能抱道守真，尘触岂能相染。 只如乱心之始，色欲为先。 地狱之因，邪淫是本。 若欲断除烦恼，当须清闲，求其长乐之因，会是六根无染。 若能修行天尊之教，常依玄都大献之日，供养十方天尊，则逍遥金阙之前，长无地狱之患。 游涉琳琅苑，高步七宝园。 逍遥恣无欲，稽首礼天尊。 释曰：道君言若后有人於三元日修斋建讲，依玄都献法，供养十方大圣及道士等，功成业着，得为天尊，游行上界西那玉国，自然珍宝无有穷尽，过往亡灵皆离苦难，不落三涂。 次下明诸众圣，欢喜旋绕。 尔时# ，十方众圣得闻天尊妙法，拔度之因，闻所未闻，悟所未悟，遂乃同声赞善，欢喜奉行。 诵咏步虚，周回旋绕，稽首礼谢，赞欺天尊。 太上道君、十方众圣，既说偈已，天尊更有何训励。",
      "translated_text": "In the Wujie world, men and women, by nature and habit stingy and greedy, upon death become hungry ghosts. Their souls and spirits suffer hunger, yet when food is offered, it transforms into dust. The Commentary states: Those who have not severed their false and deceptive ways, who engage solely in deceit—*Wujie world* is the name of this realm, also called the *Jambudvīpa* realm. Yet the beings of this land, deluded by distortions and perversions, entangled in confusion and chaos, grow stingy and greedy, discriminating between self and others. Upon death, they become hungry ghosts as retribution for past transgressions. The food they are given turns to dust before their eyes, inedible. Through vast kalpas, they endure bitter suffering, mired in torment and sinking into perdition. They revolve through the Five Paths, repaying past enmities.\n\nNow, I declare this to you: you should heed it well. In future lives, men and women must rouse themselves with diligence, exerting effort to refine their conduct, lest they become the cause of sin. The Commentary states: *Hao* means vast. It speaks of enduring as hungry ghosts through immeasurable kalpas. Even if they complete their punishment and are reborn, they return to lowly families, cycling endlessly through the Five Paths, never attaining sagehood. The Five Paths are: the Heavenly Path, the Human Path, the Animal Path, the Hell Path, and the Hungry Ghost Path.\n\nThe Heavenly Worthy further exhorts and instructs the Dao Lord: in future lives, men and women must discipline themselves, rousing their minds with diligence, and not become the cause of sin. *Sins* here refer to karmic offenses. Just as one reaps what one sows in the fields, so too do good and evil deeds yield corresponding retribution—like planting in spring and harvesting in autumn. Thus, it is called the *field of sin*.\n\nAt that time, the Most High Dao Lord, having received the Heavenly Worthy’s decree, bowed in reverence and spoke these verses. This is called the *Division of the Dao*. *At that time* refers to the moment when the Heavenly Worthy, having concluded the teaching of the cause, entrusted it to the Dao Lord. Having heard the Heavenly Worthy expound this great scripture of deliverance and salvation, and having received admonitions for both present and future lives—earnest teachings disseminated to guide all beings—the Most High Dao Lord bowed before the Heavenly Worthy, praising the sublime teaching and reverently receiving its wondrous decree, his joy beyond words. As the virtue was inconceivable, he then spoke these verses:\n\nIn past lives, our karmic affinity met,\nNow we behold the Heavenly Worthy’s face.\nFirst, the kalpas of the present were revealed,\nThen the transgressions of future kalpas told.\n\nThe Commentary states: The Dao Lord, overjoyed, thus composed these verses to praise the Heavenly Worthy. Through past and present lives, their Dao affinity converged, allowing him to personally receive the supreme teaching and pay homage to the Heavenly Worthy. He was further instructed in the causes of deliverance, entrusted with transmission, and charged to swiftly turn the Wheel of the Dao, vowing to practice diligently without laziness. Both past and future kalpas have been graced by the Dao’s benevolence.\n\nThe verse on *future kalpas’ transgressions* states: The Dao Lord, in his future incarnation, admonishes beings against the sins of greed, anger, and delusion. Those consumed by greed hoard wealth, endlessly seeking possessions, indulging in arrogance and extravagance, each flaunting their splendor. They do not cultivate merit, their hearts lacking compassion, unmindful of all beings. In this life, they fail to establish fields of blessings; after death, they sink into evil paths. Such retribution is certain and unerring. All this suffering stems from past lives’ failure to cultivate good deeds, and in future lives, they will endure its calamities. Such are the profound transgressions of future kalpas.\n\nDiligently practice the supreme Dao,\nLest it become the enemy of conditioned existence.\nGreed breeds great calamity,\nAnger and delusion are the roots of disaster.\n\nThe Commentary states: This verse admonishes against the sins of greed, anger, and delusion. The Dao Lord, wishing to awaken the deluded masses, composed these verses to elucidate the roots of causes and conditions, the sources of fortune and misfortune. Greed is the affliction that burdens the body; anger and delusion are the roots of ruin. Thus, he briefly expounded their origins, urging their severance.\n\nThe Dao Lord, having expounded the Heavenly Worthy’s teaching, further elaborated: wealth, sensuality, fame, and profit are the sources of calamity; greed, anger, and delusion are the roots of self-destruction. How could one cultivate the true while obstructing the Human Path, or even lose the field of blessings? If one can prevent the Three Poisons from arising and keep the Six Roots pure, this is the path to cultivating life. Untainted by worldly dust, it becomes the bridge to deliverance from suffering. What disaster could then arise?\n\nSever the hindrance of afflictions,\nAnd the Three Actions will naturally be at peace.\nDemonic forces cannot disturb,\nHow could one suffer the hardships of hell?\n\nThe Commentary states: Afflictions arise from the Three Actions; demonic disturbances stem from the Six Roots. Yet if one embraces the Dao and guards the true, how could worldly dust contaminate them? The inception of a disturbed mind begins with sensual desire; the cause of hell lies in deviant lust. To sever afflictions, one must attain tranquility. Seeking the cause of eternal joy lies in keeping the Six Roots unstained.\n\nIf one practices the Heavenly Worthy’s teachings and, on the great offering days of the Mysterious Capital, makes offerings to the Heavenly Worthies of the Ten Directions, they will wander before the Golden Gates, forever free from the sufferings of hell. They will roam the Jasper Gardens, stride through the Seven Jeweled Parks, freely indulging in desirelessness, bowing in reverence to the Heavenly Worthy.\n\nThe Commentary states: The Dao Lord declared that if, in future times, people observe the Three Primordials by holding fasts and establishing lectures, following the rites of the Mysterious Capital’s offerings to make offerings to the Great Sages of the Ten Directions and the Daoist masters, their merit will be accomplished and their deeds manifest. They will become Heavenly Worthies, journeying through the Western Jade Realm of the Upper Realm, where treasures are inexhaustible. The departed souls of the past will all escape suffering, avoiding the Three Wretched Paths. Below, it describes how the assembly of sages rejoices and circumambulates.\n\nAt that time, the assembly of sages from the Ten Directions, having heard the Heavenly Worthy’s wondrous Dharma and the causes of deliverance—hearing what they had never heard before and awakening to what they had never awakened to—joined their voices in praise, rejoicing and reverently practicing. They chanted the *Step of Emptiness*, circumambulating in reverence, bowing in homage and gratitude, extolling the Heavenly Worthy. After the Most High Dao Lord and the assembly of sages from the Ten Directions had spoken their verses, what further exhortations did the Heavenly Worthy offer?",
      "overlap_context": "spoken by Lord Lao. However, due to the ignorance of the monastic community, they recklessly added false interpretations and distorted meanings. The sages of former times were misled, and later generations further fabricated falsehoods, turning truth into deception. Through mutual influence, the teachings of simplicity and sincerity became corrupted. As ornate literature flourished, deceit and falsehoods multiplied. The pure and simple dissolved, and the false and deceptive bloomed like flowers.",
      "start_char": 7961,
      "end_char": 9221,
      "start_sentence": 335,
      "end_sentence": 386,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.72118949890137,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "太上道君、十方大圣，说偈颂已，天尊告曰：三元斋日，皆须讲说是经，勤修礼拜，六时行道，香汤洁己，过中不味，内外恬夷，淡泊无为，不交人事，先授十戒，静心闭意，思神念真，想存在法。 尔时众圣一时稽首，请奉戒文。 释文# ：此则天尊慈悲，重垂训励， 又复宣传戒法，修奉之仪。 但以圣人常修浄行，湛然无欲，不涉垢尘，冀在垂教化凡，拯救愚昧。 故於此日诱引殷勤，更说戒文，令遣保护，清斋洁己，思神念真，日夜受持，存念三宝，当来成道，得见天尊，游宴玉京，逍遥金阙。 此是三元之日建讲设斋，拔度先亡，得福如是。 天尊既垂戒法，其文若为。 天尊告曰：",
      "translated_text": "The Most High Dao Lord and the assembly of great sages from the Ten Directions, having recited their verses, the Heavenly Worthy proclaimed: On the days of the Three Primes, this scripture must be expounded, its rites diligently practiced, and homage paid with reverence. Perform the Six-Hour Circumambulation, purify yourself with fragrant waters, abstain from food after noon, maintain inner and outer tranquility, embrace simplicity and non-action, refrain from worldly affairs, first receive the Ten Precepts, calm the mind and seal the senses, contemplate the divine and meditate upon the Real, and visualize the abiding Dharma.\n\nAt that moment, the assembly of sages bowed as one, entreating to receive the precepts.\n\nCommentary: Here, the Heavenly Worthy, in great compassion, once more offers exhortations, further proclaiming the precepts and the rites for their observance. Though the sages perpetually cultivate pure conduct, abiding in clarity and free from desire, untouched by defilement, their purpose is to instruct the common and deliver the ignorant. Thus, on this day, with earnest guidance, the precepts are again expounded, commanding protection, purification through fasting, contemplation of the divine, and meditation upon the Real. Day and night, uphold and maintain them, dwell in mindfulness of the Three Treasures, and in the future, attain the Dao, behold the Heavenly Worthy, and wander in the Jade Capital, at ease within the Golden Towers. Such is the merit of establishing lectures and fasting on the Three Prime days to deliver the departed—thus is the blessing attained.\n\nHaving proclaimed the precepts, what is their text?\n\nThe Heavenly Worthy declared:",
      "overlap_context": "y’s wondrous Dharma and the causes of deliverance—hearing what they had never heard before and awakening to what they had never awakened to—joined their voices in praise, rejoicing and reverently practicing. They chanted the *Step of Emptiness*, circumambulating in reverence, bowing in homage and gratitude, extolling the Heavenly Worthy. After the Most High Dao Lord and the assembly of sages from the Ten Directions had spoken their verses, what further exhortations did the Heavenly Worthy offer?",
      "start_char": 9222,
      "end_char": 9492,
      "start_sentence": 387,
      "end_sentence": 395,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.058175086975098,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "第一戒者，不得杀生，淫祀六天神鬼。 第二戒者，不得窃盗为非，取他财物。 第三戒者，不得爱乐美色，嫉妬非法。 第四戒者，不得妄言绮语，以为口过。 第五戒者，不得耽酒沈酗，纵横无度。 第六戒者，不得唝嗃自是，欺谤兆人。 第七戒者，不得欺师罔道，损弃圣典。 第八戒者，不得嗔恚四辈，讪谤道士。 第九戒者，不得贪觅过度，损物益己。 第十戒者，不得触骂宗亲，不敬耆老。 此十戒者，身之大患，犯之者风刀万劫，恒值恶缘。 善心信敬，开导后人，勤行谛听，受勿忘言。 行之如法，生不犯过，死无拘闭，天降云軿，自然得道。 释曰：此即是其十戒，并是修奉之仪。 护持者克获於人天，犯之者必沈於地狱。 若有善男子善女人，能持此十戒，踊猛精进，心不懈倦，行与道合，乃无违失生，则为教所仰，死则升彼上清，驾蹑云车，往来无碍，超越三界，金刚之躯。 若犯之者，则沦五苦，历三涂，剑树刀山，每令巡履，牛头狱卒，催逼驰驱，肉散如星，骨消如雨，万劫受苦，不拾须臾，恒值恶缘，怨怨相对。 违经犯戒，地狱获殃。 如法修行，天堂受乐。 自次以下，道君重问三元斋法，此举下文，更作若为启请。 太上道君稽首礼日：三元斋法，中元之旨，前已具闻。 未审上下二元，依何法式。 释曰：此三元斋法，俱在众经。 道君恐来代愚蒙，多所不悟，再兴高问，冀垂未闻，於此会中，殷勤重请。 天尊所答，其此若为。 天尊告曰：此三元斋，三录定简，灵宝要文。 正月十五日者，此为上元天官检勾。 十月十五日者，此为下元水官检勾。 此者所摄不同。 释曰：此即天尊告示三元由委。 言此三元之法，是三录定简，出灵宝要文。 所摄不同者，为上元左府主生生，太阳火官考。 下元即右府主死死，太阴水官考。 中元主生死簿录，一切地狱囚徒罪福之事，风刀之考。 各领察九万众，凡有一十二月。 其中元、下元，三府两同。 然香旋绕者，各为上元知生，下元知死之途。 既别统摄，是以不同，故云所摄不同o 今所陈说，七月十五日作玄都大献者，此乃总管上下二元，故以相告，宜遵之焉。 释曰：此言中元通括上下，一切都和勘当，饿鬼囚徒，并在今日。 但今日中元道，摄上下二元，其功最重。 故玄都献法，拔度先亡，所以不言天官、水官，唯称中元者，唯中元地官。 地官处中，中是正色，故举中元，以摄上下。 又万物至秋，皆悉成结，所以取其方金即熟。 故以七月十五日中元之辰，以为供养。 又一切饿鬼罪魂，今日皆蒙释放。 中元教戒之日，玄都大献之晨，常须建福修斋，行道讲经，供养三宝，拔度亡灵，既此一时，地狱囚徒，咸蒙福佑，遵则享祚，泄则祸臻。 释曰：但天尊奉大献之供，享福无极，轻泄大献之轻，则祸臻万劫。 太上道君、十方大圣、飞天神王、七千二百四十童子，闻是说已，一时欢喜，作礼而去。 释曰：上圣慈悲，常惟救度。 至於宣扬妙法，光阐玄风，冀其至言，宁不欢喜。 於是虔心踊跃，作礼而行。 各适彼方，殷勤教化。 太上洞玄灵宝三元#31玉京玄都大献经竟 #1 案敦煌本与《道藏》本经文差异颇多。 今仅校正其与文义有意者。 非关文义之异不校。",
      "translated_text": "The first precept: Do not kill living beings or make licentious sacrifices to the six heavenly spirits and ghosts.\nThe second precept: Do not steal or commit wrongdoing by taking others’ property.\nThe third precept: Do not delight in beauty and lust, or harbor jealousy and unlawful thoughts.\nThe fourth precept: Do not engage in false speech or frivolous talk, thereby committing sins of the mouth.\nThe fifth precept: Do not indulge in wine or sink into drunkenness, acting recklessly without restraint.\nThe sixth precept: Do not be arrogant and self-righteous, or deceive and slander the multitudes.\nThe seventh precept: Do not deceive your teacher or betray the Dao, or discard sacred scriptures.\nThe eighth precept: Do not harbor anger toward the four assemblies or slander Daoist practitioners.\nThe ninth precept: Do not greedily seek excess, harming others to benefit yourself.\nThe tenth precept: Do not insult or curse your clan and kin, or disrespect the elderly.\n\nThese ten precepts are the great afflictions of the body. Those who violate them will suffer the wind-knives for ten thousand kalpas, forever encountering evil conditions. With a sincere and reverent heart, guide those who come after, diligently practice and listen attentively, and receive them without forgetting their words. If you follow them according to the Dharma, in life you will commit no transgressions, and in death you will not be bound or confined. Heaven will send cloud chariots, and you will naturally attain the Dao.\n\nThe commentary states: These are the ten precepts, which are the rituals for cultivation and observance. Those who uphold them will surely attain rebirth among humans and gods, while those who violate them will inevitably sink into hell. If there are good men and good women who can uphold these ten precepts, advance with zealous diligence, and never grow weary in their hearts, their conduct will align with the Dao, and they will never stray from it in life. In life, they will be revered by the teachings, and in death, they will ascend to the Upper Clarity, riding cloud chariots, coming and going without obstruction, transcending the Three Realms, and attaining a vajra body. If one violates them, they will sink into the five sufferings, pass through the three evil destinies, walk upon sword trees and blade mountains, constantly compelled to tread them, driven and hurried by ox-headed hell wardens. Their flesh will scatter like stars, their bones dissolve like rain, and for ten thousand kalpas they will suffer without a moment’s respite, forever encountering evil conditions, facing enmity with enmity. Those who transgress the scriptures and violate the precepts will reap misfortune in hell. Those who cultivate according to the Dharma will receive joy in heaven.\n\nThereafter, the Most High Lord of the Dao further inquired about the rites of the Three Prime Fasts. The following text presents how to make the invocation.\n\nThe Most High Lord of the Dao bowed his head in reverence and said: The meaning of the Middle Prime Fast has already been fully heard. I have yet to learn the proper forms for the Upper and Lower Primes.\n\nThe commentary states: The rites of the Three Prime Fasts are all contained in the scriptures. The Most High Lord of the Dao, fearing that future generations would be ignorant and fail to comprehend, posed this lofty question again, hoping to receive what had not yet been heard. In this assembly, he earnestly requested once more. The Heavenly Worthy’s response is as follows.\n\nThe Heavenly Worthy declared: These Three Prime Fasts are determined and recorded in the Three Registers, the essential texts of the Numinous Treasure. The fifteenth day of the first month is the Upper Prime, when the Heavenly Official conducts his review. The fifteenth day of the tenth month is the Lower Prime, when the Water Official conducts his review. Their jurisdictions differ.\n\nThe commentary states: This is the Heavenly Worthy’s explanation of the origins of the Three Primes. These Three Prime rites are determined and recorded in the Three Registers, derived from the essential texts of the Numinous Treasure. Their jurisdictions differ because the Upper Prime’s Left Bureau governs life, and the Fire Official of the Great Yang conducts the review. The Lower Prime’s Right Bureau governs death, and the Water Official of the Great Yin conducts the review. The Middle Prime governs the registers of life and death, all matters of sin and merit for the prisoners of hell, and the trials of the wind-knives. Each oversees the inspection of ninety thousand beings, encompassing all twelve months. The Middle and Lower Primes share two bureaus. As for the incense circumambulation, it is performed to distinguish the Upper Prime’s knowledge of life and the Lower Prime’s knowledge of death. Since their jurisdictions differ, they are not the same—hence it is said their jurisdictions differ.\n\nNow, what is expounded here is the Great Offering of the Dark Capital on the fifteenth day of the seventh month, which oversees both the Upper and Lower Primes. Thus, it is fitting to observe it.\n\nThe commentary states: This means the Middle Prime encompasses and reconciles the Upper and Lower Primes, reviewing all matters together. The hungry ghosts and imprisoned spirits are all addressed on this day. However, the Middle Prime Dao of this day encompasses the Upper and Lower Primes, and its merit is the greatest. Therefore, the rites of the Great Offering of the Dark Capital are performed to deliver the departed. Thus, it does not mention the Heavenly or Water Officials but only the Middle Prime, for it is the Earth Official of the Middle Prime. The Earth Official resides in the center, and the center is the correct color. Therefore, the Middle Prime is invoked to encompass the Upper and Lower. Moreover, by autumn, all things reach maturity, so the direction of metal is taken as the time of ripeness. Thus, the fifteenth day of the seventh month, the day of the Middle Prime, is chosen for the offering. Furthermore, on this day, all hungry ghosts and sinful spirits are released. On the day of the Middle Prime’s teachings and precepts, at the dawn of the Great Offering of the Dark Capital, one must establish merit, observe the fast, perform the Dao, expound the scriptures, make offerings to the Three Treasures, and deliver the departed. At this time, the prisoners of hell all receive blessings. Those who observe these rites will enjoy prosperity, while those who neglect them will incur misfortune.\n\nThe commentary states: If the Heavenly Worthy partakes in the Great Offering, the blessings are boundless. If one treats the Great Offering lightly, misfortune will befall them for ten thousand kalpas.\n\nUpon hearing this, the Most High Lord of the Dao, the Ten Directions’ Great Sages, the Flying Heavenly Kings, and the seven thousand two hundred and forty youths all rejoiced together, bowed in reverence, and departed.\n\nThe commentary states: The supreme sages, moved by compassion, always seek to deliver beings. In proclaiming the wondrous Dharma and illuminating the mysterious teachings, how could they not rejoice upon hearing these sublime words? Thus, with devout hearts and exuberant spirits, they bowed and departed, each returning to their respective realms to diligently teach and transform.\n\nThe *Scripture of the Three Primes of the Numinous Treasure: The Great Offering of the Jade Capital and the Dark Capital* concludes here.",
      "overlap_context": "fasting, contemplation of the divine, and meditation upon the Real. Day and night, uphold and maintain them, dwell in mindfulness of the Three Treasures, and in the future, attain the Dao, behold the Heavenly Worthy, and wander in the Jade Capital, at ease within the Golden Towers. Such is the merit of establishing lectures and fasting on the Three Prime days to deliver the departed—thus is the blessing attained.\n\nHaving proclaimed the precepts, what is their text?\n\nThe Heavenly Worthy declared:",
      "start_char": 9492,
      "end_char": 10759,
      "start_sentence": 396,
      "end_sentence": 452,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.722322702407837,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "#2 案「万劫」以下至此数十字，原本作注文。 核诸前后文义，当作经文为是。 今改作经文。 #3 兹：原作「慈」，据文义改。 #4 禁系：敦煌本作「攻击」。 #5 天尊以次而说偈言：敦煌本作「其因如此，今为卿等略说是」。 #6 死受金锤打：敦煌本作「死魂受槌考」。 #7 万劫不得出：敦煌本作「历劫难可出」。 #8 并痴狂：敦煌本作「颠痴狂」。 #9 后身：敦煌本作『后生』。 #10 铁杖不去身：敦煌本作『痛切恒在身』。 #11 欺诱顽益己：敦煌本作『欺诱益己取』。 #12 『长』字原缺，据前后文例补。 #13 死堕毒兽螫：敦煌本作『无变为小虫』。 #14 饥渴饮火精：敦煌本作『饥则食火精』 。 #15 六畜形：敦煌本作『边夷身』 。 #16 后嗣：敦煌本作『后根』。 #17 罪田：敦煌本作『罪因』，近是。 #18 同：原作『周』，据敦煌本改。 #19敦煌本此段经文作：『当依玄都旧法，正月十五日、七月十五日、十月十五日，三元之晨，地官校句，授选众戒，分别善恶。 诸天仙圣，普诣灵华官中，简定劫数簿录及恶鬼囚徒』。 此与《道藏》本颇不同。 #20 敦煌本此段经文作『世间当以其日清浄室宅，夜则烧香燃灯，是时起愿，照曜诸天及九幽长夜八门之中。 又学上圣灵真，作玄都大献於玉京山，法下界应采诸妙花果，尽世间所有众奇异甘弥上馔，幡幢宝盖，庄严供养，遥心丹到，献诸众圣及诸道士』。 #21 敦煌本此段经文作：『於其日夜讲诵是经，谷（欲）为其家九玄七祖父母，一切眷属，广及他人，忏悔诸罪，发心殷勤，则囚徒饿鬼，当得解脱，与食俱饱，免於众苦，得还人中，随业受乐。 自非如斯，难可拔赎』 。 #22 敦煌本无此段经文。",
      "translated_text": "Here follows the corrected scriptural passage:\n\nFor ten thousand kalpas, they shall not escape, bound in the prisons of the Dark Capital, where they will suffer the torments of the Five Evils. Their bodies shall be fettered and shackled, their necks clamped in iron collars, their waists bound with iron chains, their hands and feet locked in iron manacles. Day and night, they shall endure the lash of whips and the strike of cudgels, their flesh torn and their bones shattered, their blood flowing like rivers, their cries of anguish shaking the earth. Even if they die, they shall be reborn only to suffer again, never to emerge.\n\nMoreover, their minds shall be afflicted with madness and confusion, their bodies stricken with sores and ulcers, their limbs twisted and deformed. In future lives, they shall be reborn as the lowliest of beasts, their bodies pierced by iron rods that never leave them. If they have deceived and misled others for their own gain, they shall fall into the realm of venomous creatures, where they shall be stung and devoured. If they have hoarded wealth and refused to give, they shall suffer eternal hunger and thirst, forced to drink the essence of fire and eat the ashes of charcoal. If they have harmed living beings, they shall be reborn as livestock, their bodies butchered and their flesh consumed. If they have severed the bonds of kinship, their descendants shall be cut off, and they shall wander as solitary ghosts, never to find rest.\n\nThe commentary states: These are the consequences of transgressing the precepts and violating the Dao. The fields of sin bear such bitter fruit, and none may escape their due retribution.\n\nThe Heavenly Worthy then spoke in verse:\n\nThose who break the precepts and defile the Dao\nShall fall into the prisons of the Dark Capital,\nWhere they shall suffer the Five Evils’ torment,\nBound in iron, their flesh rent and torn.\nTheir cries shall shake the earth,\nYet none shall hear their pleas.\nEven in death, they shall not escape,\nBut be reborn to suffer anew.\nTheir minds shall be clouded with madness,\nTheir bodies stricken with sores.\nIn future lives, they shall be beasts,\nTheir flesh pierced by iron rods.\nIf they have deceived others,\nThey shall fall among venomous creatures.\nIf they have hoarded wealth,\nThey shall hunger and thirst eternally.\nIf they have harmed living beings,\nThey shall be butchered as livestock.\nIf they have severed kinship,\nTheir descendants shall be cut off,\nAnd they shall wander as solitary ghosts,\nNever to find peace.\n\nThus, on the three prime mornings—the fifteenth day of the first, seventh, and tenth months—when the Earth Official reviews the registers, distinguishing good from evil, the divine sages and immortals of all heavens shall gather in the Palace of Numinous Flowers to examine the records of kalpas and the ledgers of wicked ghosts and prisoners.\n\nOn these days, the world should purify their chambers and dwellings, burning incense and lighting lamps at night. At that time, they should make vows to illuminate the heavens and the nine dark realms of the Eight Gates. They should emulate the divine sages and perfected ones, performing the Great Offering of the Dark Capital upon the Jade Capital Mountain. From the lower realms, they should gather the finest flowers and fruits, all the rare delicacies and sweet nectars of the world, along with banners, canopies, and jeweled parasols, to adorn and present as offerings. With sincere hearts, they should make distant offerings to the assembled sages and all Daoist masters.\n\nOn these nights, they should recite this scripture, wishing to extend blessings to their nine generations of ancestors, their seven generations of parents, all their kin, and even others. Through repentance of sins and earnest devotion, the imprisoned and hungry ghosts shall be liberated, granted food and satiation, freed from all suffering, and reborn among humans to enjoy happiness according to their karma. Without such efforts, none may be redeemed.",
      "overlap_context": ": The supreme sages, moved by compassion, always seek to deliver beings. In proclaiming the wondrous Dharma and illuminating the mysterious teachings, how could they not rejoice upon hearing these sublime words? Thus, with devout hearts and exuberant spirits, they bowed and departed, each returning to their respective realms to diligently teach and transform.\n\nThe *Scripture of the Three Primes of the Numinous Treasure: The Great Offering of the Jade Capital and the Dark Capital* concludes here.",
      "start_char": 10760,
      "end_char": 11501,
      "start_sentence": 453,
      "end_sentence": 479,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.714216232299805,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "#23 堂玉：据前后文义，当作『诞降』。 #24 敦煌本无此段经文。 #25 敦煌本无此段经文。 #26 而说偈言：敦煌本作『而说颂曰』 。 #27 敦煌本无『 先说今劫已，复告后劫愆』 二句。 #28 二云：据前后文义，当作『一云』。 #29 案敦煌本『尔时』以下至卷末，经文较《道藏》本大为简化。 仅作『尔时十方圣众齐得开悟，一时欢喜，稽首受命而退』。 凡二十字。 #30 释文：据前后文例，当作『释曰』 。 #31 『三元』，敦煌本尾题作『中元』，近是。",
      "translated_text": "At the Hall of Jade: Based on the preceding and following context, this should read \"the descent of the divine birth.\"\n\n---\n\nThen he spoke these verses:\n\n*(The Dunhuang manuscript reads: \"Then he spoke this hymn.\")*\n*(The Dunhuang manuscript omits the lines: \"First recounting the transgressions of this kalpa, / Then foretelling the faults of the kalpa to come.\")*\n\n*(Note: \"二云\" should read \"一云\" based on the preceding and following context.)*\n\n---\n\nAt that time, the sacred assemblies of the ten directions all attained awakening, rejoicing as one. They bowed their heads, received the command, and withdrew.\n\n*(The Dunhuang manuscript significantly condenses the text from \"At that time\" to the end of the scroll, rendering it simply as: \"At that time, the sacred assemblies of the ten directions all attained awakening, rejoicing as one. They bowed their heads, received the command, and withdrew.\"—a total of twenty characters.)*\n\n---\n\n**Annotation:**\n*(Based on the preceding and following context, \"释文\" should read \"Annotation.\")*\n*\"Three Primes\" (三元): The colophon of the Dunhuang manuscript reads \"Middle Prime\" (中元), which is more accurate.*",
      "overlap_context": "he assembled sages and all Daoist masters.\n\nOn these nights, they should recite this scripture, wishing to extend blessings to their nine generations of ancestors, their seven generations of parents, all their kin, and even others. Through repentance of sins and earnest devotion, the imprisoned and hungry ghosts shall be liberated, granted food and satiation, freed from all suffering, and reborn among humans to enjoy happiness according to their karma. Without such efforts, none may be redeemed.",
      "start_char": 11502,
      "end_char": 11748,
      "start_sentence": 480,
      "end_sentence": 490,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.427422046661377,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元玉京玄都大献经.txt",
        "category": "本文类"
      }
    }
  ]
}