{
  "source_id": "太上洞玄灵宝开演秘密藏经",
  "source_file": "chunked_daozang\\太上洞玄灵宝开演秘密藏经.json",
  "total_chunks": 6,
  "total_original_chars": 6027,
  "total_translated_chars": 34872,
  "total_translation_time": 155.83158588409424,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝开演秘密藏经.txt",
    "category": "本文类"
  },
  "full_translation": "The *Supreme Cavernous Mystery Numinous Treasure Scripture of Unfolding the Secret Treasury*\n\nThis scripture, titled *The Supreme Cavernous Mystery Numinous Treasure Scripture of Unfolding the Secret Treasury*, originated in the Tang dynasty. Originally part of *Volume Nine of the Scripture of the Fundamental Principle*, it was later separated into an independent text. It comprises one fascicle. The base text is derived from the *Zhengtong Daoist Canon*, Cavernous Mystery Division, *Benwen* Category.\n\n---\n\nOn the fifth day of the tenth month in the first year of the Shanghuang era, the Supreme Great Dao Lord, together with countless celestial perfected beings and divine persons of wondrous conduct, arrived at the abode of the Lord Emperor of the Grand Tenuity—above the radiant clouds, within the jade towers, in the chambers of golden splendor. Before the purified altar of the Dao, they circumambulated in step with the void, chanting sacred hymns in accordance with the three vehicles’ forms of reverence. They struck the ritual drums, summoning the assembly of all perfected beings. At this moment, none among the host of sages failed to gather, expounding upon the profound and wondrous, elucidating the Dao and its virtue. The sacred assembly took their places, the four quarters arrayed in solemn order.\n\nThe Lord Emperor of the Grand Tenuity rose from his seat and bowed deeply to the Dao Lord, saying: \"Today is a day of great celebration, the dawn of teaching and admonition. Though the sagely honored one has condescended to descend to this humble hall, your boundless compassion has deigned to cast a glance upon us, overwhelming us with profound grace. This humble servant and petty disciple has rarely encountered such a felicitous gathering, and the joy of the assembled perfected beings is unparalleled. I humbly beseech your mercy to enlighten what we have yet to awaken to. I dare not presume to know: of the wondrous bodies attained by the Celestial Worthies of the three times and ten directions, by what means are they formed? Are they of one and the same essence, or do they differ from one another? I implore your compassion to fully expound upon this, that all sentient beings and those who study the Dao in future ages may have something to rely upon. With this entreaty, I prostrate myself in reverence, trembling with awe.\"\n\nThen the Supreme Dao Lord commanded the Golden Mother of the Western Terrace, and the thirty-two heavens joined their voices in harmony, singing numinous melodies. Celestial musicians played their instruments, manifesting auspicious signs that shook heaven and earth with their wondrous and extraordinary splendor. After a long while, the Dao Lord spoke: \"Profound indeed, subtle indeed—you now seek to inquire into the secret treasury of the true Dao. Since I attained the Dao, I have never before expounded upon these hidden and arcane matters. Yet since you have made this request, I shall transgress the prohibitions and transmit them. Listen carefully and receive these essential words; do not recklessly divulge them.\"\n\nAt that time, the assembly prostrated themselves to receive the crucial teachings.\n\nThe Supreme Lord declared: \"The ultimate truth of the wondrous principle is quiescent, formless, pure, and serene, beyond all description or designation. For the sake of guiding and transforming beings, I shall briefly outline two paths: first, the quiescent essence of the Dao-body, which is emptiness and non-being; second, the birth-body, which is conceived and born in physical form.\n\nThe Dao-body transcends all characteristics. Perfect wisdom is fulfilled, delusive falsehoods are eradicated, and one merges obscurely with the profound origin, becoming one with the Dao. It is neither extinguished nor born, neither comes nor goes. The path of speech is severed, and the workings of thought are forever stilled.\n\nThe birth-body, on the other hand, accords with worldly dharmas. It arises dependent upon father and mother, the harmonization of qi and destiny. The jade womb and numinous palace are like empty space, manifesting as circumstances permit, with varying durations of gestation. Some are born from the armpit or back, reared in secluded palaces; some are born with white hair, while others eternally retain a youthful countenance. Their adorned forms and wondrous natures are revered by both gods and humans.\"\n\nThe Lord Emperor bowed and asked: \"Is the Dao-body itself the quiescent origin, or is there another principle that may be called the origin?\"\n\nThe Supreme Lord replied: \"The Dao is the sacred origin; the origin is the root of the Dao. Though they are of one essence, there are not two separate sources. The Dao is named as independent, its essence inherently numinous and unobstructed. It is self-sufficient, transcending all dependence, vanishing into the distance, and ceasing all activity. The origin is spoken of in contrast to the end, a provisional name given in dependence upon conditions. It is called the beginning of things, involved in the capacity to give rise to them. It also serves as the fixed origin, with activity and quiescence differing in function. Emergence and submergence mutually manifest, while speech and silence complement one another.\"\n\nThe Lord Emperor further inquired: \"If this origin-body is capable of giving rise to the myriad things, and is thus the primordial beginning of all things, how does it differ from the spiritual origin?\"\n\nThe Supreme Lord answered: \"In their true essence, there is no duality. Why is this so? Because both are ultimately so, without beginning or end, and thus inexpressible. Yet through skillful means, one may also speak of their distinction.\n\nThe so-called spiritual origin is the inception of deluded thought, the initial mind-moment that serves as the root of all birth and death. From this initial mind, thought follows thought in succession, and the karmic fruits of sentient beings revolve endlessly. This is called the inception of consciousness, also known as the spiritual origin.\n\nThe origin-body, however, is the sentiment of the Dao, the pure mind that serves as the root of all worldly and transcendent dharmas. Thus, it is called the origin. This true nature is neither mind nor non-mind, neither form nor non-form. It is not bound by conditions, nor is it impermanent—hence it is said to be non-mind. Yet it gives rise to mind and knows all things—thus it is also called mind. It is unimpeded—hence it is called non-form. Yet it gives rise to form, and the Dao-eye perceives it—thus it is also called form.\n\nThis pure mind is replete with all boundless virtues and perfections of wisdom. It abides eternally in self-mastery, serene and blissful. Yet because it is obscured by afflictions, it has not been fully revealed—hence it is called nature. If one cultivates skillful means to sever all afflictions, and the obstructive dharmas are exhausted, it becomes manifest and luminous—hence it is called the origin-body. Such a body is inherently present in the origin-body, not newly created—thus it is called the origin. The origin is not of any nature, nor is it encompassed by the three times. Yet for the sake of expediency, it is spoken of as not not belonging to the three times. Because it has always existed, it is called the past. Because all sentient beings will inevitably attain it, it is called the future. Because the great sages of the ten directions have already attained it, it is called the present. Though it is spoken of as having distinctions within the three times, its essence is unmoving and eternally unchanging.\"\n\nThe Lord Emperor again asked: \"If the origin-body is inherently replete with all qualities, how can afflictions obscure it? If it is inherently complete yet becomes obscured, then all divine worthies who have attained the Dao should also eventually lose it. Why is this so? Because their essence is one and the same.\"\n\nThe Most High replied: \"Though the essence is one, its meanings are two. Because expedient means are insufficient, and because expedient means are complete—this is why I say all dharmas take emptiness as their nature. To transform sentient beings, I employ skillful expedient means, expounding as circumstances require. The nature of such verbal expression is like empty space, without discrimination. The original essence-body and the original nature are both characterized by emptiness, attaining what is unattainable—thus there is nothing to lose. Because there is something attained, there is something to lose. Therefore, ordinary beings are called those who lose, while the divine worthies of the ten directions are called those of constant virtue.\"\n\nThe Lord Emperor again asked: \"If the dharmas of birth and death are beginningless and endless, and their original nature is pure, why are they not called the fruit of the Dao?\"\n\nThe Most High replied: \"The dharmas of birth and death have causes and effects, and thus are impermanent—they are not called the fruit of the Dao. The essence of the constant Dao is not of causes and effects, and thus is eternal. Because its essence is the fruit, it is called the fruit of the Dao.\"\n\nThe Lord Emperor again asked: \"Is this original essence-body entirely shared by all, or is it one body possessed individually, with countless bodies? If it is one, then when one person attains it, it should obstruct others. If it is many manifestations, it is not the Great Oneness and cannot be called eternal.\"\n\nThe Most High said: \"Have I not said that all dharmas are like empty space? The nature of empty space is neither one nor many, neither obstructive nor unobstructive. The original essence-body is likewise so—its essence is neither one nor many, and its nature is unobstructed.\"\n\nThe Supreme Lord of the Grand Tenuity bowed and said: \"I humbly receive your teaching. Yet I remain unclear: how do the two terms 'birth' and 'manifestation' differ in the scriptural teachings? I venture to inquire and hope for your compassionate elucidation.\"\n\nThe Most High replied: \"In truth, there is no duality—yet according to meaning, they are named differently. The 'birth-body' reveals form, each instance resembling others, yet without fixed appearance or constant order. Whatever manifests the original is called the 'manifestation-body.'\"\n\nThe Lord Emperor again asked: \"Are the birth-body and manifestation-body responsive?\"\n\nThe Most High replied: \"Just so. 'Birth' and 'manifestation' are both termed 'conditions,' and as their benefits are undifferentiated, they are called 'responsive.' Their essence is without distinction; their names differ according to meaning.\"\n\nThe Lord Emperor again asked: \"Is the manifestation-body a dharma of existence or non-existence?\"\n\nThe Most High replied: \"Have I not said that all dharmas are inherently without possession—how could the manifestation-body be a dharma of existence? If provisionally named, it is both existent and non-existent. Because it does not depart from the original, it is called non-existent. Because sentient beings perceive it, it is called existent. Because it is not a separate essence, it is called non-existent. Because it truly benefits, it is called existent. It is like a bright mirror that reflects forms and images, clearly and distinctly, in various differences. The images in the mirror cannot be definitively said to be existent or non-existent, yet one may also say there are images in the mirror. Because the mind-mirror of all sentient beings is bright, they see the image of the true Dao. It is also like still water, without waves, where the reflections of the sun, moon, stars, and flying birds appear. The sun, moon, stars, and birds are all seen at the water’s bottom; all things also see their own reflections, clearly and distinctly. These objects in the water and their reflections are neither truly real—one cannot say they exist, nor can one say they do not exist. When the mind-water of all sentient beings is clear, the reflection of the Dao-body is seen likewise. Its essence is the true Dao, and thus it is not existent; yet because it is not unseen, it cannot be called non-existent. It is like one who pursues the departed by following their tracks and thus finds them—the tracks and the person are neither identical nor different. The manifestation-body is likewise. Those of clear understanding use the manifestation to enter awakening, see the true Dao-body, and know the boundless dharmas—thus it is called one. Yet it is not without relying on the manifestation that they gradually attain understanding, establish the field of merit—thus it is called different. Such meaning belongs to the realm of the Dao and cannot be comprehended by ordinary beings or lesser sages.\"\n\nThereupon, the Dao Lord, wishing to clarify this meaning, spoke again in verse:\n\nThe Dao-body neither arises nor ceases,\nFollowing principle, it naturally pervades.\nSerene and ever pure,\nIt stands alone, though called empty.\n\nBeyond names, without opposition,\nIt forgets even the work of creation.\nProfoundly still, its functions cease,\nIn tranquil emptiness it abides.\n\nThe original body is the beginning of all things,\nEstablishing the three realms.\nIts mysterious workings are unfathomable,\nYet its perfect illumination follows each thought.\n\nIt is the wondrous root of manifestations,\nAppearing in countless forms.\nSpirit neither arises nor ceases,\nIts marvelous work knows no coming or going.\n\nThe birth-body relies on father and mother,\nTemporarily endowed with wisdom, it appears ordinary.\nThe jade womb is not of worldly conception,\nIts transformations adapt to what is fitting.\n\nMajestic and dignified, it inspires admiration,\nDispelling delusion and greed even in old age.\nIt is not a body of flesh and bone,\nBut extends according to the vow.\n\nThe provisional manifestation has no fixed place,\nYet its seen body endures long.\nIt appears in the five destinies’ forms,\nIts countenance conforming to beauty or ugliness.\n\nFollowing the original’s descent,\nIts benefits know no preference.\nSometimes it arises through transformation,\nAt times through father and mother.\n\nThe Supreme Lord of the Grand Tenuity bowed again and said: \"I venture to ask: does the Dao-body arise from causes, or is it without cause? If it arises from causes, like worldly dharmas, it is produced by conditions and thus impermanent. If it arises without cause, it falls into heterodox views, the doctrine of other paths. If the Dao-body does not arise from causes but exists naturally, then all sentient beings who do not cultivate the Dao should also attain the Dao. How can these two meanings be resolved? I humbly hope for your compassionate and expansive instruction.\"\n\nThe Dao Lord replied: \"Supreme Lord of the Grand Tenuity, you have indeed brought forth such profound and subtle meanings. The true Dao is the mark of reality, which cannot be expressed by words. What is now called the Dao borrows words to reveal it, enabling awakening and entry. Understanding transcends words; forget the trap and grasp the intent—do not cling to the text. The Dao that is spoken of is unobstructed, like empty space—neither existent nor non-existent, neither foolish nor wise, neither cause nor effect, neither ordinary nor sagely, neither form nor mind, neither mark nor non-mark, and not even all dharmas, for it is not attached to anything.\"\n\n\"Why is this so? The nature of all dharmas is precisely non-nature; the nature of dharmas and the nature of the Dao are both ultimately empty. This emptiness is also empty; the emptiness of emptiness is also empty. Emptiness is without distinction, for distinctions are empty—thus it is without distinction. Moreover, all is empty, for emptiness is non-dual; hence it is said to be identical.\n\nYet sentient beings, unable to comprehend this meaning, generate notions of dharma where there is no dharma, and conceive of emptiness where there is no emptiness. Through such inverted thoughts, they become attached to views, harboring the four inversions. They falsely construct dharmas, clinging to self and things, and thus are bound to birth and death, failing to attain the Dao-body.\n\nThe Heavenly Worthy, the Great Sage, fully realizes this true nature—ultimately without nature—penetrating the source of the Dao, merging with its undifferentiated essence. This is called attaining the Dao. When body and Dao become one, it is called the Dao-body.\n\nCultivating this right contemplation is termed the cause; yet there is nothing to cultivate, hence it is called non-cause. Therefore, the true Dao does not arise from causes, nor is it causeless. Its essence is not a result, nor is it non-result; it is neither eternal nor non-eternal, neither ceasing nor non-ceasing.\n\nSuch profound and secret meanings can only be understood by the nature and the Dao. Even the highest sages and perfected immortals do not fully comprehend them; through the power of faith, they may vaguely grasp them.\n\nThis body dwells without abiding, yet abides nowhere it does not—this is the true and real body of the right Dao.\"\n\nThe Supreme Lord of the Grand Tenuity further inquired: \"May I ask how the Heavenly Worthy’s birth-body and karmic marks are constituted?\"\n\nThe Most High replied: \"What is called birth is non-birth, unborn, apart from all birth. Why? The Heavenly Worthies of the ten directions have exhausted all birth; defilements and ignorance are forever purified, hence there is no birth. Yet to benefit sentient beings, they manifest in accordance with worldly dharmas—thus there appears to be birth.\n\nWhy? If I were to say that the qi of the Dao is lofty and remote, quiescent and unborn, beings would assume it cannot be cultivated, losing the mind of aspiration and failing to practice good deeds. Therefore, it is said that all sages possess a birth-fruit; yet they are not born due to karmic bonds or in accordance with vows.\n\nIf further explained, their birth in the heavens or among humans arises from superior karma as its cause, for among these, it is the foremost—this is the distinguishing mark of the birth-body.\"\n\nThe Supreme Lord of the Grand Tenuity bowed his head in reverence and said: \"Excellent! The Dao Lord has expounded such profound and subtle meanings—never before have I heard such a wondrous sutra. It is like a person of meager fortune and heavy sins, born deaf and blind, who cannot perceive the five colors—blue, yellow, red, white, or black—or hear the five notes of the scale. A great physician of luminous skill imparts a wondrous art, opening their ears and eyes, so that all colors and sounds become perceptible.\n\nI, too, am like this: through this sutra, I have come to hear and see the two kinds of body. Know that this sutra is the ear and eye of the Dharma; those who attain it can perceive the two Dharma-bodies of the right Dao—the provisional and the real.\n\nThe great physician of luminous skill is none other than the Dao Lord, who has bestowed this wondrous sutra upon me like eyes and ears. Those who receive this teaching attain the right Dao and its subtle body. Having attained the Dao-body, they can then conform and manifest the birth-body.\n\nSince this sutra gives birth to the two bodies, it is called the Mother of Dharma. Why? This profound and wondrous teaching enables all to generate the true Dharma-body, just as a worldly mother gives birth to a child. The most filial of children constantly remember the kindness of nurture and embrace, desiring to repay it without end.\n\nWe, too, through this right teaching, have generated the untainted body. Therefore, we must always repay this debt with offerings: establishing halls and palaces, adorning them with the seven treasures, with incense, flowers, lamps, and candles, with music, banners, and canopies, worshiping morning and evening as if attending our own parents.\"\n\nThe Most High Dao Lord replied to the Supreme Lord: \"So it is, so it is—just as you have said. From of old, I have never expounded such a teaching to others. Why? Because the capacity of learners was not yet sufficient. It is not that we, the Heavenly Worthies of the ten directions, conceal or withhold anything. All teachings expounded point to the one Dao—one flavor, one mark. Yet sentient beings each awaken to it in their own way, with differences in depth and attainment according to their understanding; this is called the distinct teaching. Yet it points to one mark, hence it is called the same return—there is no other sutra.\n\nIt is like the sky sending down a single sweet rain: the great rivers and seas receive it differently, and thus it is called different waters, though the rain is truly one. The great sages of the ten directions send down the one Dharma-rain, and according to the vessels of the three vehicles, the benefits differ—hence it is called the three teachings. The body-marks shown are likewise.\n\nTo those who have not awakened, it is as if it has not been spoken; to those who have understood, it is always complete and perfect. Therefore, we hold nothing in secret.\"\n\nAt that time, the Supreme Lord of the Grand Tenuity and the great assembly, hearing this Dharma-sound, marveled at what they had never before encountered. In the empty sky, celestial wondrous flowers rained down, and heavenly music resounded as they made offerings to the Dao Lord. Together, they spoke in unison, praising in verse:\n\nWe take refuge in the Most High Worthy,\nUnsurpassed and supreme true Dharma King.\nSkillfully expounding the two subtle bodies,\nLike the equal descent of sweet dew and rain.\nThe three vehicles awaken with differences,\nYet all the Dao Lord’s words are all-embracing.\nBeings float upon this Dharma-boat,\nCrossing the great river of birth-and-death’s suffering.\nPartaking of this pure and good Dharma-medicine,\nThe filth and sickness of body and mind are all cured.\nEach receives the Dharma-benefit, joy pervading—\nThus we bow in gratitude to our compassionate father.\n\nThen the Supreme Lord of the Grand Tenuity and the great assembly, having spoken this verse, addressed the Most High: \"If all the teachings spoken by the divine worthies equally express the one Dao, without distinction of depth or shallowness, how then do the complete and the incomplete teachings arise, with their differing paths?\"\n\nThe Dao Lord replied: \"Whatever the great sages say is all right contemplation, the mind of omniscience—nothing is not ultimate, all is the definitive meaning. Yet because of sentient beings, there are differences between the partial and the complete.\"\n\nFor those of dull faculties, at times the teaching speaks of existence, at times of emptiness, at times of permanence, at times of impermanence—this is called the \"two halves.\" As the teachings differ from before to after, they cannot be given all at once. Following the illness, a single remedy is prescribed, biased toward one truth—this is called \"partial.\" Once the former illness is cured, another medicine is revealed. Since the treatment is complete, it is called \"fulfilled.\" Having understood the two halves, one enters the Middle Way—only then is it called \"complete\" and \"perfect.\"\n\nFor those of profound wisdom, hearing one side of the teaching, they immediately comprehend: conditioned designations are the true Middle Way. What is called \"middle\" is to be free from all attachments, yet without abandoning anything; not clinging to either extreme—hence it is called \"middle.\" It can guide sentient beings to the noble abode, reaching the city of liberation—thus it is called \"middle.\" One who understands this Middle Way is called \"right contemplation.\" It is the foremost vehicle, capable of conveying practitioners beyond the three realms, transcending the two kinds of birth-and-death, realizing the true nature of dharmas, and attaining the supreme Dao.\n\nTherefore, this sutra can shatter the boundless dark chamber of ignorance, allowing one to see the precious treasure of the supreme true Dharma. Like a bright lamp dispelling all darkness, it enables those with eyes to see all treasures, using them freely as they wish, delighting the heart with joy.\n\nNow the Supreme Lord of the Grand Tenuity bowed and said to the Most High: \"If this is so, then only a correct understanding of the essential Middle Way is needed to attain the Dao. Why must one further study other scriptures and precepts, which only bring weariness?\"\n\nThe Most High replied: \"If practitioners delve into the roots of the aggregates and virtue, fully comprehending the true emptiness and Middle Way, then they are already complete—there is no need to cultivate other methods. However, for the multitudes of sentient beings in the Five Defilements who have not yet grasped the profound and wondrous purport of this sutra, other teachings are first shown to tame their minds, cutting off the four mara-bandits of afflictions. Just as a king, though possessing boundless treasures and pleasures, still requires city walls, moats, and fortifications to guard against thieves and block all obstacles, so too does right contemplation. When the mind-king first awakens, it dwells in the city of the Middle Way, using precepts and wisdom as its walls and moats, firmly adorning itself and preparing for all mara-trials. Thus, the Heavenly Worthies of the ten directions expound the scriptures and precepts, broadly opening the Dharma-gates.\"\n\nThe Supreme Lord of the Grand Tenuity bowed his head and asked: \"I venture to inquire of the Dao Lord: what are the ultimate distinctions of 'ultimate' and 'consummate'? I humbly request your instruction.\"\n\nThe Most High said: \"'Ultimate' means decisive; 'consummate' means fixed. The Dharma I speak is decisively non-dual. As I say: the world is impermanent, like emptiness, empty of self, pure. The fruit of the Dao is eternally attained, blissful, free, truly pure. If other scholars come to question these meanings, they will never cause me to waver. All the divine worthies of the three times speak thus—this is the meaning of 'decisive' and 'ultimate.'\n\nFurthermore, 'ultimate' means thorough; 'consummate' means true. When the Dao Lords speak of all dharmas, they say their original nature is pure, like the nature of empty space, provisionally existing through causes and conditions, yet not truly real in substance. The principle of the Middle Way is free from inversion—it is the mark of quiescence. Those who speak thus do so with thorough truthfulness, without falsehood. Hence, it is also called the meaning of 'ultimate.'\n\nMoreover, 'ultimate' means to penetrate; 'consummate' means to comprehend. When the great sages of the ten directions sit at the seat of enlightenment, they realize profound right wisdom. In a single thought, they illuminate all dharmas and their true nature, penetrating and comprehending without error. This wisdom is perfect, corresponding to the true mark of dharmas, penetrating and comprehending without omission—hence it is called 'ultimate.'\n\nAs for 'consummate,' 'consummate' means to reach; 'consummate' means the limit. The divine worthies of the ten directions attain omniscience, reaching the limit of the Dharma—this is called 'consummate.'\n\nFurthermore, 'consummate' means to sever; 'consummate' means to exhaust. All divine worthies, with the wisdom of true mark, sever and exhaust all afflictions and habits, attaining complete liberation—this clarifies 'consummate.'\n\nMoreover, 'consummate' means to cross; 'consummate' means to have arrived. The great sages and perfected ones who have attained the Dao cross the sea of birth-and-death, having reached the other shore—hence it is called 'consummate.' Such are the distinctions of 'ultimate' and 'consummate.'\n\nThe Supreme Lord again asked: \"What should this sutra be called, and what are the required methods for its transmission? I humbly request your full instruction.\"\n\nThe Most High said: \"This sutra is called *Revealing the Secret Treasury*. Why? This sutra clarifies the meaning of the secret and wondrous bodies of the divine worthies of the three times and ten directions who have attained the Dao. Like us, the supreme Dharma-kings, who emerge in the Five Defilements to transform sentient beings, manifesting the three karmas, employing skillful means—our intentions are subtle and hidden, difficult to comprehend.\n\nThe reason is this: the bodies attained by the Heavenly Worthies of the ten directions are the true marks of the Dao, inherently harmonizing with nature, formless and nameless, not fabricated dharmas, like the mark of empty space. Having realized this Dharma for countless kalpas, they share one nature and mark, equal and non-dual. Yet they can manifest various Dharma-bodies, displaying cultivation, retribution, and responsive transformations without limit. In the realms of humans, gods, and evil destinies, they appear according to the types they encounter, conforming to their karmic actions and practices. Some appear surpassingly noble, transcending the world, supremely rare, unmatched and fearless, with awe-inspiring transformations and unimaginable freedom—this is called *Revealing the Secret Treasury of the Body.*\n\nWithin the true nature of the right Dao, though wordless and unspeakable, in the mark of quiescence, they skillfully employ causes and conditions to distinguish and reveal, teaching endlessly according to what is fitting. Their words and sequences are profound and recondite in meaning and flavor.\"\n\nShould they expound the One Vehicle or the Three Vehicles, elucidating the karmic fruits of humans and gods, gradually guiding all to converge upon the true and singular right Dao—this is called *Revealing the Secret Treasury of the Mouth.*\n\nThough free from thought and deliberation, beyond discriminative conceptions, with omniscience they penetrate the gate of emptiness, attaining right understanding and right contemplation, exhausting the bounds of principle to become one with the true reality. With knowledge of all modes, they illumine the dharmas of the world: form yet not form, mind yet not mind. The five destinies of humans and gods, the four great elements and six realms, the thoughts of sentient beings, and the karmic fruits of causes and conditions—all are clearly and unimpededly comprehended in a single thought. Skillfully discerning the roots and natures of beings, they act in accord with what is fitting, thoroughly penetrating and exhausting the secret dharmas of both the mundane and transcendent—this is called *Revealing the Secret Treasury of the Mind.*\n\nThrough these three kinds of secret Dharma, the true Dao-body is perfected, which neither ordinary beings nor even the highest sages can fathom or know. In this sutra, I have fully disclosed this meaning, clearly expounding the marks of the body and opening the gate of expedient means, guiding all learners to enter the profound mystery. Therefore, this sutra is named *Revealing the Profound Secret Treasury.*\n\nThus should it be received and upheld. This sutra is the most sublime among all Mahayana sutras. If there be one of utmost sincerity, capable of understanding and expounding its meaning, having ascertained such a person, bow in reverence and transmit it—no oath of secrecy is required. Why? Because those who have received other sutras already know their hearts, and this is also a matter of equality, without discrimination.\n\nThe Most August Lord of the Grand Tenuity bowed and said: \"Excellent! O Dao-Lord, in expounding such profound and recondite meaning, today I have first come to know that the Divine Honored One is truly the father and mother of all beings. Through the power of great compassion and great mercy, within the markless you reveal the true Dharma-mark, proclaiming these three kinds of subtle and secret purports, enabling all future beings to awaken to the One Vehicle, attain the wondrous Dharma-body, and realize supreme enlightenment. They will themselves comprehend the secret treasury and, in turn, be able to reveal for all beings the three kinds of profound secrets.\n\nOnly now do I truly understand that the supreme Mahayana, the equal and right Dharma, makes no distinction of purity or defilement, bestowing only upon those capable of practice. Those with the heart to receive it shall transmit it forthwith, that this wondrous teaching may widely circulate, universally opening the Dharma-eye for all, continuing the unsurpassed position of the Dao-Lord, and ensuring the Wheel of the Three Jewels turns without cease, radiating its light unbroken.\"\n\nThe Most High addressed him, saying: \"Excellent! O Emperor-Lord, that you are able to resolve to propagate this Dharma. Future men and women who receive this blessing shall all behold the right Dao and attain the pure Dharma-body. Know this, Emperor-Lord: if other sutras were not to circulate, there would be no profound harm to the world; but should even a single verse of this sutra be lost, it would give rise to all manner of calamities and misfortunes. Why? Because this sutra clearly reveals the true Dao-body, which is the ultimate refuge and dwelling of all beings. If this sutra is lost, they will forever remain orphaned and exposed, drifting in the three evil destinies and five paths, submerged in endless suffering, with no means of liberation. Why? Because they will have lost their root-source and have nowhere to return.\"\n\nThus, Emperor-Lord, you must ever single-mindedly propagate and proclaim this Dharma, ensuring its unbroken circulation. I once received it from the Supreme Emperor, who received it from the Five Emperors and the Most High Jade Sovereign; the Jade Sovereign received it from the Jade Clarity Emperor-Lord and the Great King Who Subdues Demons; the Great King received it from the August Emperor-Lord of the Eight Heavens. Thus it was transmitted mouth to mouth, without reliance on written text. Now, Emperor-Lord, you may commit it to writing and record it, that it may circulate among future beings. I shall guard this sutra with my divine power, and wherever it abides, all shall be auspicious. When the great kalpa comes full cycle and all other Ways perish, this sutra alone shall endure, returning to the Great Luo Heaven, descending again to the world in accord with conditions, to deliver gods and humans.\n\nThereupon, the Emperor-Lord of the Grand Tenuity carved jade into tablets and engraved gold into characters, binding them with silver, and compiled this sutra. He placed it in a casket of purple jade, sealed it upon a seven-jeweled dais, while immortal youths and jade maidens scattered flowers and burned incense in offering to the sacred text. When the great assembly had received the sutra, the Most High Dao-Lord returned to Jade Capital, and all who had gathered bowed in reverence and departed.\n\nThus concludes the *Most High Cavernous Mystery Divine Treasure: The Sutra of Unfolding the Secret Treasury*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝开演秘密藏经 经名：太上洞玄灵宝开演秘密藏经。 出於唐代。 原系《本际经》卷九，复分出单行。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝开演秘密藏经 太上大道君以上皇元年十月五日与无量天真、妙行神人，诣太微帝君处，明霞之上、琼阙之内、金华之房。 诸天上帝清斋道前，旋行步虚，诵咏灵章，一依俯仰三乘之格，扣击法鼓，普集群真。 此时众圣莫不皆集，敷讲玄妙，阐扬道德。 圣众列位，四座严整。 太微帝君从座而起，稽首道君：今日大庆，教诫之晨，迂屈圣尊，曲降卑肆，洪慈垂眄，过忝重恩。 贱臣小子希遭嘉会，群真欢乐不并於常。 伏愿哀怜，觉所未悟。 不审三世十方天尊所得妙身，以何为法，为同一体，为各异耶？ 唯愿哀矜，具垂敷演，令一切众生及将来世学道之人有所依倚。 缘恩上启，伏用战惶。 太上道君方命西台金母，三十二天齐声合和，唱咏灵音，鼓天妓乐，表现祥瑞，惊天骇地，妙丽殊特。 良久言曰：深乎微哉，乃欲问发真道秘藏。 自我成道已来，未曾说此隐奥之事，今既有请，冒禁相传。 当谛听受，勿妄宣泄。 是时众会伏受要言。 太上告曰：至真妙理，寂绝无形，清浄凝湛，不可言名。 方便引化，略开二途：一者，道身寂体虚无； 二者，生身诞孕形躯。 言道身者，离一切相，正慧成满，除断虚妄，冥契玄宗，与道为一，不灭不生，无来无去，言语路断，念虑永毕。 言生身者，随顺世法，依因父母，气数和合，琼胎灵府，犹如虚空，随宜出处，年月不同，腋背降诞，长养深宫； 或生而皓素，或常保少容，瓖姿妙质，天人所宗。 帝君礼曰：不审道身即是寂本，为更有义名为本耶？ 太上告曰：道为圣本，本即道根。 虽是一体，先无二源。 道名独立，体自灵通。 强字无待，远逝息功。 本对於末，因待假名，称为物始，用涉能生。 又为定本，动寂用殊，出没互表，语嘿相须。 帝君又问：如是本身，能生万物，即是万物之本始者，此与神本有何差别？ 太上答曰：源其实体，无有二相。 何以故？ 俱毕竟故，无始终故，不可说故。 以善方便，亦得言异。 所谓神本，是妄想初，一念之心，能为一切生死根本。 以是初心，念念想续，众生业果，轮转无穷。 是名识初，亦名神本。 言本身者，即是道情，清浄之心，能为一切世出世法之根本故，故名为本。 如是真性，非心不心，非色不色，无缘虑故，非无常故，故言非心； 能生心故，无不知故，亦名为心； 无所碍故，故名非色； 能生色故，道眼见故，亦名为色。 是清浄心，具足一切，无量功德、智慧成就，常住自在，湛然安乐； 但为烦恼所覆蔽故，未得显了，故名为性。 若修方便，断诸烦恼，障法尽故，显现明了，故名本身。 如此身者，本身有之，非今造故，故名为本。 本非有性，非三世摄，方便说故，非非三世。 本来有故，名为过去； 一切众生，必定尝得，故名未来； 十方大圣，今已得故，故名现在。 虽复说有，三世差别，体不动故，常住无变。 帝君又问：若是本身，性是具足，一切烦恼，云何能障？ 若本具足，而起障者，一切神尊得成道，亦已应还失。 何以故？ 体唯一故。",
      "translated_text": "The *Supreme Cavernous Mystery Numinous Treasure Scripture of Unfolding the Secret Treasury*\n\nThis scripture, titled *The Supreme Cavernous Mystery Numinous Treasure Scripture of Unfolding the Secret Treasury*, originated in the Tang dynasty. Originally part of *Volume Nine of the Scripture of the Fundamental Principle*, it was later separated into an independent text. It comprises one fascicle. The base text is derived from the *Zhengtong Daoist Canon*, Cavernous Mystery Division, *Benwen* Category.\n\n---\n\nOn the fifth day of the tenth month in the first year of the Shanghuang era, the Supreme Great Dao Lord, together with countless celestial perfected beings and divine persons of wondrous conduct, arrived at the abode of the Lord Emperor of the Grand Tenuity—above the radiant clouds, within the jade towers, in the chambers of golden splendor. Before the purified altar of the Dao, they circumambulated in step with the void, chanting sacred hymns in accordance with the three vehicles’ forms of reverence. They struck the ritual drums, summoning the assembly of all perfected beings. At this moment, none among the host of sages failed to gather, expounding upon the profound and wondrous, elucidating the Dao and its virtue. The sacred assembly took their places, the four quarters arrayed in solemn order.\n\nThe Lord Emperor of the Grand Tenuity rose from his seat and bowed deeply to the Dao Lord, saying: \"Today is a day of great celebration, the dawn of teaching and admonition. Though the sagely honored one has condescended to descend to this humble hall, your boundless compassion has deigned to cast a glance upon us, overwhelming us with profound grace. This humble servant and petty disciple has rarely encountered such a felicitous gathering, and the joy of the assembled perfected beings is unparalleled. I humbly beseech your mercy to enlighten what we have yet to awaken to. I dare not presume to know: of the wondrous bodies attained by the Celestial Worthies of the three times and ten directions, by what means are they formed? Are they of one and the same essence, or do they differ from one another? I implore your compassion to fully expound upon this, that all sentient beings and those who study the Dao in future ages may have something to rely upon. With this entreaty, I prostrate myself in reverence, trembling with awe.\"\n\nThen the Supreme Dao Lord commanded the Golden Mother of the Western Terrace, and the thirty-two heavens joined their voices in harmony, singing numinous melodies. Celestial musicians played their instruments, manifesting auspicious signs that shook heaven and earth with their wondrous and extraordinary splendor. After a long while, the Dao Lord spoke: \"Profound indeed, subtle indeed—you now seek to inquire into the secret treasury of the true Dao. Since I attained the Dao, I have never before expounded upon these hidden and arcane matters. Yet since you have made this request, I shall transgress the prohibitions and transmit them. Listen carefully and receive these essential words; do not recklessly divulge them.\"\n\nAt that time, the assembly prostrated themselves to receive the crucial teachings.\n\nThe Supreme Lord declared: \"The ultimate truth of the wondrous principle is quiescent, formless, pure, and serene, beyond all description or designation. For the sake of guiding and transforming beings, I shall briefly outline two paths: first, the quiescent essence of the Dao-body, which is emptiness and non-being; second, the birth-body, which is conceived and born in physical form.\n\nThe Dao-body transcends all characteristics. Perfect wisdom is fulfilled, delusive falsehoods are eradicated, and one merges obscurely with the profound origin, becoming one with the Dao. It is neither extinguished nor born, neither comes nor goes. The path of speech is severed, and the workings of thought are forever stilled.\n\nThe birth-body, on the other hand, accords with worldly dharmas. It arises dependent upon father and mother, the harmonization of qi and destiny. The jade womb and numinous palace are like empty space, manifesting as circumstances permit, with varying durations of gestation. Some are born from the armpit or back, reared in secluded palaces; some are born with white hair, while others eternally retain a youthful countenance. Their adorned forms and wondrous natures are revered by both gods and humans.\"\n\nThe Lord Emperor bowed and asked: \"Is the Dao-body itself the quiescent origin, or is there another principle that may be called the origin?\"\n\nThe Supreme Lord replied: \"The Dao is the sacred origin; the origin is the root of the Dao. Though they are of one essence, there are not two separate sources. The Dao is named as independent, its essence inherently numinous and unobstructed. It is self-sufficient, transcending all dependence, vanishing into the distance, and ceasing all activity. The origin is spoken of in contrast to the end, a provisional name given in dependence upon conditions. It is called the beginning of things, involved in the capacity to give rise to them. It also serves as the fixed origin, with activity and quiescence differing in function. Emergence and submergence mutually manifest, while speech and silence complement one another.\"\n\nThe Lord Emperor further inquired: \"If this origin-body is capable of giving rise to the myriad things, and is thus the primordial beginning of all things, how does it differ from the spiritual origin?\"\n\nThe Supreme Lord answered: \"In their true essence, there is no duality. Why is this so? Because both are ultimately so, without beginning or end, and thus inexpressible. Yet through skillful means, one may also speak of their distinction.\n\nThe so-called spiritual origin is the inception of deluded thought, the initial mind-moment that serves as the root of all birth and death. From this initial mind, thought follows thought in succession, and the karmic fruits of sentient beings revolve endlessly. This is called the inception of consciousness, also known as the spiritual origin.\n\nThe origin-body, however, is the sentiment of the Dao, the pure mind that serves as the root of all worldly and transcendent dharmas. Thus, it is called the origin. This true nature is neither mind nor non-mind, neither form nor non-form. It is not bound by conditions, nor is it impermanent—hence it is said to be non-mind. Yet it gives rise to mind and knows all things—thus it is also called mind. It is unimpeded—hence it is called non-form. Yet it gives rise to form, and the Dao-eye perceives it—thus it is also called form.\n\nThis pure mind is replete with all boundless virtues and perfections of wisdom. It abides eternally in self-mastery, serene and blissful. Yet because it is obscured by afflictions, it has not been fully revealed—hence it is called nature. If one cultivates skillful means to sever all afflictions, and the obstructive dharmas are exhausted, it becomes manifest and luminous—hence it is called the origin-body. Such a body is inherently present in the origin-body, not newly created—thus it is called the origin. The origin is not of any nature, nor is it encompassed by the three times. Yet for the sake of expediency, it is spoken of as not not belonging to the three times. Because it has always existed, it is called the past. Because all sentient beings will inevitably attain it, it is called the future. Because the great sages of the ten directions have already attained it, it is called the present. Though it is spoken of as having distinctions within the three times, its essence is unmoving and eternally unchanging.\"\n\nThe Lord Emperor again asked: \"If the origin-body is inherently replete with all qualities, how can afflictions obscure it? If it is inherently complete yet becomes obscured, then all divine worthies who have attained the Dao should also eventually lose it. Why is this so? Because their essence is one and the same.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1215,
      "start_sentence": 0,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.58596348762512,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝开演秘密藏经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "太上答曰：虽体是一，义则有二。 方便未足故，方便具足故，是故我言一切诸法，以空为性，为化众生，善巧方便，随宜演说。 是言说性，犹如虚空，亦无分别； 识本本身皆虚空相，得无所得，故无所失。 有所得故，故有所失。 是故凡夫名为失者，十方神尊名为常德。 帝君又问：若生死法，无始无终，本性清浄，何故不名为道果耶？ 太上答曰：生死之法，有因果故，故是无常，不名道果。 常道之体，非因果故，是故为常，体是果故，故名道果。 帝君又问：如是本身为悉共有，但是一身为各各有，有无量身。 若有一者，一人得已，应碍余人； 若是多迹，非为太一，不得言常。 太上曰：我不说言，一切诸法，如虚空耶？ 虚空之性，非一非多，非碍非无碍。 如是本身，亦复如是。 体非一多，性无障碍。 太微帝君稽首谢曰：谨闻命矣。 不审生之与边二义，云何经门二言？ 敢以谘启，伏愿弘慈，广垂分别。 太上告曰：体实无二，随义名身，生体擢貌，事事同人，迩无定相，形不常伦。 但能显本，即是迹陈。 帝君又问：生身迹身，是应作耶？ 太上答曰：如是如是。 生之与迩，并称机缘，利益不差，即名为应。 体则无别，随义异名。 帝君又问：是迹身者，为有法耶？ 为无法耶？ 太上答曰：我不说云，一切诸法，性无所有，云何迹身而当有法？ 若假名字，亦有亦无，不离本故，故名为无。 众生见故，故名为有； 更非别体，故名为无。 有实利益，故名为有。 犹如明镜，能见色象，了了分明，种种差别，是镜中象，不可定说，是有是无，而亦得言镜中有像。 一切众生，心镜明故，见真道像。 又如止水，无涛波故，影现日月、星辰飞鸟，日月星辰，及以飞鸟，悉见水底； 一切诸物，亦见自影，了了分明。 此水中物及所见影，俱非真实，不可言有，不可言无。 一切众生，心水澄清，见道身影，亦复如是。 体即真道，是故非有； 非不见故，不得言无。 如追逝者，寻迹能得，是迹与人，非一非异。 迹身亦尔。 明解之人，用迹入悟，见真道身，知无边法，故名为一； 非不因迹，渐得开晓，建立福田，是名为异。 如是之义，是道境界，非是凡夫下圣能了。 於是道君欲显斯义，重说偈言： 道身不生灭，任理自玄通，湛然常清浄，独立强言空。 绝名无待对，亦忘造物功。 端静息义用，萧寂守虚冲。 本身为物始，生立布三才。 冥功虽叵测，圆照逐念开。 能为妙迹本，表见亿万该。 神有无起灭，奇功靡去来。 生身托父母，寄慧示同凡。 琼胎非世孕，变示适所堪。 端严使欣慕，白首破迷贪。 非是骨肉身，随愿之所覃。 权迹无定方，见身亦长久。 遍示五道形，姿容顺妍丑。 任本之所垂，利益无优貌。 乍有变化生，时或因父母。 太微帝君稽首又曰：敢问道身为有因耶？ 为无因耶？ 若有因者，同世问法，因缘生故，故是无常； 若无因生，复堕邪见，异道之谓。 若是道身不从因生，自然有者，一切众生不修道者，应皆成道。 如是二义，云何可了？ 唯愿慈愍，广垂开示。 道君答曰：太微帝君乃能显发如是深奥微密之义。 夫正道者，真实之相，非言语法之所能宣。 今言道者，寄言显示，令得悟入，解了无言，忘荃取旨，勿着文字。 所言道者，通达无碍，犹如虚空，非有非无，非愚非智，非因非果，非凡非圣，非色非心，非相非非相，即一切法亦无所即。",
      "translated_text": "The Most High replied: \"Though the essence is one, its meanings are two. Because expedient means are insufficient, and because expedient means are complete—this is why I say all dharmas take emptiness as their nature. To transform sentient beings, I employ skillful expedient means, expounding as circumstances require. The nature of such verbal expression is like empty space, without discrimination. The original essence-body and the original nature are both characterized by emptiness, attaining what is unattainable—thus there is nothing to lose. Because there is something attained, there is something to lose. Therefore, ordinary beings are called those who lose, while the divine worthies of the ten directions are called those of constant virtue.\"\n\nThe Lord Emperor again asked: \"If the dharmas of birth and death are beginningless and endless, and their original nature is pure, why are they not called the fruit of the Dao?\"\n\nThe Most High replied: \"The dharmas of birth and death have causes and effects, and thus are impermanent—they are not called the fruit of the Dao. The essence of the constant Dao is not of causes and effects, and thus is eternal. Because its essence is the fruit, it is called the fruit of the Dao.\"\n\nThe Lord Emperor again asked: \"Is this original essence-body entirely shared by all, or is it one body possessed individually, with countless bodies? If it is one, then when one person attains it, it should obstruct others. If it is many manifestations, it is not the Great Oneness and cannot be called eternal.\"\n\nThe Most High said: \"Have I not said that all dharmas are like empty space? The nature of empty space is neither one nor many, neither obstructive nor unobstructive. The original essence-body is likewise so—its essence is neither one nor many, and its nature is unobstructed.\"\n\nThe Supreme Lord of the Grand Tenuity bowed and said: \"I humbly receive your teaching. Yet I remain unclear: how do the two terms 'birth' and 'manifestation' differ in the scriptural teachings? I venture to inquire and hope for your compassionate elucidation.\"\n\nThe Most High replied: \"In truth, there is no duality—yet according to meaning, they are named differently. The 'birth-body' reveals form, each instance resembling others, yet without fixed appearance or constant order. Whatever manifests the original is called the 'manifestation-body.'\"\n\nThe Lord Emperor again asked: \"Are the birth-body and manifestation-body responsive?\"\n\nThe Most High replied: \"Just so. 'Birth' and 'manifestation' are both termed 'conditions,' and as their benefits are undifferentiated, they are called 'responsive.' Their essence is without distinction; their names differ according to meaning.\"\n\nThe Lord Emperor again asked: \"Is the manifestation-body a dharma of existence or non-existence?\"\n\nThe Most High replied: \"Have I not said that all dharmas are inherently without possession—how could the manifestation-body be a dharma of existence? If provisionally named, it is both existent and non-existent. Because it does not depart from the original, it is called non-existent. Because sentient beings perceive it, it is called existent. Because it is not a separate essence, it is called non-existent. Because it truly benefits, it is called existent. It is like a bright mirror that reflects forms and images, clearly and distinctly, in various differences. The images in the mirror cannot be definitively said to be existent or non-existent, yet one may also say there are images in the mirror. Because the mind-mirror of all sentient beings is bright, they see the image of the true Dao. It is also like still water, without waves, where the reflections of the sun, moon, stars, and flying birds appear. The sun, moon, stars, and birds are all seen at the water’s bottom; all things also see their own reflections, clearly and distinctly. These objects in the water and their reflections are neither truly real—one cannot say they exist, nor can one say they do not exist. When the mind-water of all sentient beings is clear, the reflection of the Dao-body is seen likewise. Its essence is the true Dao, and thus it is not existent; yet because it is not unseen, it cannot be called non-existent. It is like one who pursues the departed by following their tracks and thus finds them—the tracks and the person are neither identical nor different. The manifestation-body is likewise. Those of clear understanding use the manifestation to enter awakening, see the true Dao-body, and know the boundless dharmas—thus it is called one. Yet it is not without relying on the manifestation that they gradually attain understanding, establish the field of merit—thus it is called different. Such meaning belongs to the realm of the Dao and cannot be comprehended by ordinary beings or lesser sages.\"\n\nThereupon, the Dao Lord, wishing to clarify this meaning, spoke again in verse:\n\nThe Dao-body neither arises nor ceases,\nFollowing principle, it naturally pervades.\nSerene and ever pure,\nIt stands alone, though called empty.\n\nBeyond names, without opposition,\nIt forgets even the work of creation.\nProfoundly still, its functions cease,\nIn tranquil emptiness it abides.\n\nThe original body is the beginning of all things,\nEstablishing the three realms.\nIts mysterious workings are unfathomable,\nYet its perfect illumination follows each thought.\n\nIt is the wondrous root of manifestations,\nAppearing in countless forms.\nSpirit neither arises nor ceases,\nIts marvelous work knows no coming or going.\n\nThe birth-body relies on father and mother,\nTemporarily endowed with wisdom, it appears ordinary.\nThe jade womb is not of worldly conception,\nIts transformations adapt to what is fitting.\n\nMajestic and dignified, it inspires admiration,\nDispelling delusion and greed even in old age.\nIt is not a body of flesh and bone,\nBut extends according to the vow.\n\nThe provisional manifestation has no fixed place,\nYet its seen body endures long.\nIt appears in the five destinies’ forms,\nIts countenance conforming to beauty or ugliness.\n\nFollowing the original’s descent,\nIts benefits know no preference.\nSometimes it arises through transformation,\nAt times through father and mother.\n\nThe Supreme Lord of the Grand Tenuity bowed again and said: \"I venture to ask: does the Dao-body arise from causes, or is it without cause? If it arises from causes, like worldly dharmas, it is produced by conditions and thus impermanent. If it arises without cause, it falls into heterodox views, the doctrine of other paths. If the Dao-body does not arise from causes but exists naturally, then all sentient beings who do not cultivate the Dao should also attain the Dao. How can these two meanings be resolved? I humbly hope for your compassionate and expansive instruction.\"\n\nThe Dao Lord replied: \"Supreme Lord of the Grand Tenuity, you have indeed brought forth such profound and subtle meanings. The true Dao is the mark of reality, which cannot be expressed by words. What is now called the Dao borrows words to reveal it, enabling awakening and entry. Understanding transcends words; forget the trap and grasp the intent—do not cling to the text. The Dao that is spoken of is unobstructed, like empty space—neither existent nor non-existent, neither foolish nor wise, neither cause nor effect, neither ordinary nor sagely, neither form nor mind, neither mark nor non-mark, and not even all dharmas, for it is not attached to anything.\"",
      "overlap_context": "rections have already attained it, it is called the present. Though it is spoken of as having distinctions within the three times, its essence is unmoving and eternally unchanging.\"\n\nThe Lord Emperor again asked: \"If the origin-body is inherently replete with all qualities, how can afflictions obscure it? If it is inherently complete yet becomes obscured, then all divine worthies who have attained the Dao should also eventually lose it. Why is this so? Because their essence is one and the same.\"",
      "start_char": 1216,
      "end_char": 2496,
      "start_sentence": 61,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.239704608917236,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝开演秘密藏经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "何以故？ 一切法性，即是无性； 法性道性，俱毕竟空。 是空亦空，空空亦空，空无分别，分别空故，是无分别。 亦复皆空，空无二故，故言其即。 而诸众生不能解了如是义故，於无法中而生法想，於不空中而生空想，以有如是心想倒故，而有见着，具是四倒，妄造诸法，计我及物，故名生死，不得道身。 天尊大圣，了此实性，毕竟无性，洞会道源，混体冥一，故名得道。 身与道一，故名道身。 习此正观，名之曰因； 亦无所习，故名非因。 是故正道非从因生，亦非无因； 体非是果，亦非非果； 非常非非常，非灭非非灭。 如是深奥秘密之义，唯性与道，乃能解知。 上圣真仙皆不通达，以信力故，仿髴能知。 如是身者，住无所住，无所不住，是名正道真实之身。 帝君又曰：不审天尊所受生身业相云何？ 太上告曰：所言生者，无生不生，离一切生。 何以故？ 十方天尊生已尽故，染欲无明永清浄故，故无有生； 欲利众生，示同世法，是故有生。 何以故？ 我若说云，道气高远，寂灭不生，众生便谓不可修习，无回向心，不修善业。 是故说云，一切圣人皆有生果； 然非结业随愿故生。 若复相说，随人天生，皆以上业而为生因，以於其中最第一故，是名分别生身之相。 太微帝君稽首礼日：善哉，道君演说如是深奥之义，自昔以来，未曾得闻如是妙经。 譬如薄福重罪之人，生而聋盲，不见五色，青黄赤白及黑等相，不闻宫商五音之声，有大明医授以妙术，为开耳目，一切色声，无不闻见。 我亦如是，闻於是经，能得闻见二种身相。 当知是经是法耳目，其有得者，能见正道二种法身权实之趣。 大明医者，即是道君，示我妙经，如施耳目。 得此教者，即得正道、微妙之身。 得道身已，便能随顺示见生身。 是经能生二种身故，名为法母。 何以故？ 是深妙教，能令一切生真法身，如世慈母能生子故，至孝之子，常念鞠育怀抱之恩，思欲上报，终天无极。 我等如是，因是正教，生无漏身。 是故常当报恩供养，安置堂殿，七宝庄严，香花灯烛，伎乐幡盖，晨夕朝礼，如侍所亲。 太上道君答帝君曰：如是如是，实如所说。 我从昔来，未曾为人说如是法。 何以故？ 是诸学者力未堪故，非是我等十方天尊有所隐覆，有所吝惜。 所演法言，皆表一道，一味一相，而诸众生各得悟入，深浅差别，随解有异，名为别教； 示其一相，故曰同归，无异经也。 譬如天降一味甘雨，江河大海，受处不同，名为异水，雨实唯一。 十方大圣降一法雨，随三乘器，受益不同，故名三教。 所示身相，亦复如是。 於未悟者名为未说，於解了者常满究竟。 是故我等无所秘藏。 是时太微帝君及诸大众闻是法音，叹未曾有，於虚空中雨天妙花，鼓天伎乐，供养道君，而共齐声，说偈叹曰： 我等归命太上尊，无上最胜真法王。 巧说二种微妙身，犹如等降甘露雨。 三乘得悟有差别，道君所说皆周普。 众生泛此法舟航，免度生死大河苦。 服此清浄良法药，身心垢秽病皆愈。 各蒙法利喜充遍，是故礼谢慈悲父。 尔时太微帝君及诸大众说是偈已，白太上言：若诸神尊所说诸法，同表一道，无浅深者，云何而得有图满教、及未具了差别趣耶？ 道君告曰：若於大圣诸有所言，皆是正观，一切智心，无非毕竟，悉是了义，随众生故，半满不同。",
      "translated_text": "\"Why is this so? The nature of all dharmas is precisely non-nature; the nature of dharmas and the nature of the Dao are both ultimately empty. This emptiness is also empty; the emptiness of emptiness is also empty. Emptiness is without distinction, for distinctions are empty—thus it is without distinction. Moreover, all is empty, for emptiness is non-dual; hence it is said to be identical.\n\nYet sentient beings, unable to comprehend this meaning, generate notions of dharma where there is no dharma, and conceive of emptiness where there is no emptiness. Through such inverted thoughts, they become attached to views, harboring the four inversions. They falsely construct dharmas, clinging to self and things, and thus are bound to birth and death, failing to attain the Dao-body.\n\nThe Heavenly Worthy, the Great Sage, fully realizes this true nature—ultimately without nature—penetrating the source of the Dao, merging with its undifferentiated essence. This is called attaining the Dao. When body and Dao become one, it is called the Dao-body.\n\nCultivating this right contemplation is termed the cause; yet there is nothing to cultivate, hence it is called non-cause. Therefore, the true Dao does not arise from causes, nor is it causeless. Its essence is not a result, nor is it non-result; it is neither eternal nor non-eternal, neither ceasing nor non-ceasing.\n\nSuch profound and secret meanings can only be understood by the nature and the Dao. Even the highest sages and perfected immortals do not fully comprehend them; through the power of faith, they may vaguely grasp them.\n\nThis body dwells without abiding, yet abides nowhere it does not—this is the true and real body of the right Dao.\"\n\nThe Supreme Lord of the Grand Tenuity further inquired: \"May I ask how the Heavenly Worthy’s birth-body and karmic marks are constituted?\"\n\nThe Most High replied: \"What is called birth is non-birth, unborn, apart from all birth. Why? The Heavenly Worthies of the ten directions have exhausted all birth; defilements and ignorance are forever purified, hence there is no birth. Yet to benefit sentient beings, they manifest in accordance with worldly dharmas—thus there appears to be birth.\n\nWhy? If I were to say that the qi of the Dao is lofty and remote, quiescent and unborn, beings would assume it cannot be cultivated, losing the mind of aspiration and failing to practice good deeds. Therefore, it is said that all sages possess a birth-fruit; yet they are not born due to karmic bonds or in accordance with vows.\n\nIf further explained, their birth in the heavens or among humans arises from superior karma as its cause, for among these, it is the foremost—this is the distinguishing mark of the birth-body.\"\n\nThe Supreme Lord of the Grand Tenuity bowed his head in reverence and said: \"Excellent! The Dao Lord has expounded such profound and subtle meanings—never before have I heard such a wondrous sutra. It is like a person of meager fortune and heavy sins, born deaf and blind, who cannot perceive the five colors—blue, yellow, red, white, or black—or hear the five notes of the scale. A great physician of luminous skill imparts a wondrous art, opening their ears and eyes, so that all colors and sounds become perceptible.\n\nI, too, am like this: through this sutra, I have come to hear and see the two kinds of body. Know that this sutra is the ear and eye of the Dharma; those who attain it can perceive the two Dharma-bodies of the right Dao—the provisional and the real.\n\nThe great physician of luminous skill is none other than the Dao Lord, who has bestowed this wondrous sutra upon me like eyes and ears. Those who receive this teaching attain the right Dao and its subtle body. Having attained the Dao-body, they can then conform and manifest the birth-body.\n\nSince this sutra gives birth to the two bodies, it is called the Mother of Dharma. Why? This profound and wondrous teaching enables all to generate the true Dharma-body, just as a worldly mother gives birth to a child. The most filial of children constantly remember the kindness of nurture and embrace, desiring to repay it without end.\n\nWe, too, through this right teaching, have generated the untainted body. Therefore, we must always repay this debt with offerings: establishing halls and palaces, adorning them with the seven treasures, with incense, flowers, lamps, and candles, with music, banners, and canopies, worshiping morning and evening as if attending our own parents.\"\n\nThe Most High Dao Lord replied to the Supreme Lord: \"So it is, so it is—just as you have said. From of old, I have never expounded such a teaching to others. Why? Because the capacity of learners was not yet sufficient. It is not that we, the Heavenly Worthies of the ten directions, conceal or withhold anything. All teachings expounded point to the one Dao—one flavor, one mark. Yet sentient beings each awaken to it in their own way, with differences in depth and attainment according to their understanding; this is called the distinct teaching. Yet it points to one mark, hence it is called the same return—there is no other sutra.\n\nIt is like the sky sending down a single sweet rain: the great rivers and seas receive it differently, and thus it is called different waters, though the rain is truly one. The great sages of the ten directions send down the one Dharma-rain, and according to the vessels of the three vehicles, the benefits differ—hence it is called the three teachings. The body-marks shown are likewise.\n\nTo those who have not awakened, it is as if it has not been spoken; to those who have understood, it is always complete and perfect. Therefore, we hold nothing in secret.\"\n\nAt that time, the Supreme Lord of the Grand Tenuity and the great assembly, hearing this Dharma-sound, marveled at what they had never before encountered. In the empty sky, celestial wondrous flowers rained down, and heavenly music resounded as they made offerings to the Dao Lord. Together, they spoke in unison, praising in verse:\n\nWe take refuge in the Most High Worthy,\nUnsurpassed and supreme true Dharma King.\nSkillfully expounding the two subtle bodies,\nLike the equal descent of sweet dew and rain.\nThe three vehicles awaken with differences,\nYet all the Dao Lord’s words are all-embracing.\nBeings float upon this Dharma-boat,\nCrossing the great river of birth-and-death’s suffering.\nPartaking of this pure and good Dharma-medicine,\nThe filth and sickness of body and mind are all cured.\nEach receives the Dharma-benefit, joy pervading—\nThus we bow in gratitude to our compassionate father.\n\nThen the Supreme Lord of the Grand Tenuity and the great assembly, having spoken this verse, addressed the Most High: \"If all the teachings spoken by the divine worthies equally express the one Dao, without distinction of depth or shallowness, how then do the complete and the incomplete teachings arise, with their differing paths?\"\n\nThe Dao Lord replied: \"Whatever the great sages say is all right contemplation, the mind of omniscience—nothing is not ultimate, all is the definitive meaning. Yet because of sentient beings, there are differences between the partial and the complete.\"",
      "overlap_context": "h cannot be expressed by words. What is now called the Dao borrows words to reveal it, enabling awakening and entry. Understanding transcends words; forget the trap and grasp the intent—do not cling to the text. The Dao that is spoken of is unobstructed, like empty space—neither existent nor non-existent, neither foolish nor wise, neither cause nor effect, neither ordinary nor sagely, neither form nor mind, neither mark nor non-mark, and not even all dharmas, for it is not attached to anything.\"",
      "start_char": 2496,
      "end_char": 3762,
      "start_sentence": 133,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.022210359573364,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝开演秘密藏经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "为钝根者，或时说有，或时说空，或时说常，或说无常，是名两半。 前后异说，不得一时，随病发故，偏示一义，是名为半。 前病除已，复显一药，用具足故，名之为满。 了两半已，入一中道，乃名具足、圆满之相。 若深智者闻说一边，即应了悟，因缘假名，即正中道。 所言中者，离一切着，亦无所离，不滞二边，故名为中； 能通众生至善家处，到解脱城，故名为中。 若有了知是中道者，名为正观○ 是第一乘，能运学者，出离三界，过二生死，了真法性，成无上道。 是故此经能破无边无明暗室，令见无上正法珍宝，犹如明灯，破一切暗，令有目者，见诸宝物，随意更用，称心快乐。 我今哀愍暗苦众生，然此法灯，照烦恼暗，普令一切寻光见道，得真智慧，自在安乐，极无上果，究竟升玄。 太微帝君白太上曰：若如是者，唯当正解中道之要，便得成道，何须更习诸余经诚，为繁劳耶？ 太上告曰：若诸学人探蕴德本，了达正空中道之相，是即具足，无俟更修诸余法术； 但为五浊诸众生等，未了此经深妙之趣，先示余法，调伏其心，遮断烦恼四魔恶贼。 犹如帝王，具足无量珍宝乐具，而须城舍，墙堑庄严，防断盗贼，遮诸障难。 如是正观，始悟心王，住中道城，以诸诚慧为法墙堑，牢自庄严，备诸魔试。 是故十方天尊大圣具演经诫，广开法门。 太微帝君稽首拜曰：敢问道君，毕竟究竟，云何差别？ 愿垂告示。 太上曰：毕者，决也； 竟者，定也。 我所说法，决定无二，如言世间，无常若空，空无我浄； 道果常臻，安乐自在，真实清浄。 若异学者，有来难问，如是之义，终不动转。 三世神尊皆作是说。 是决定毕竟之义。 又复毕者名审，竟者名谛。 若诸道君说一切法，本性清浄，如虚空性，假因缘有，体非真实。 中道之理，性无颠倒，是寂灭相。 作是说者，审谛诚信，无有虚妄，是故复名毕竟之义。 又复毕者名达，竟者言了。 十方大圣坐道场时，证深正智，於一切法，及法真性，一念洞明，通达照了，无有差谬。 是智圆满，称寔相法，达了无遗，故名毕竟。 言究竟者，究之言到，竟之言边际。 十方神尊得一切智，到法边际，是名究竟。 又复究者名断，竟者名尽。 一切神尊以实相慧，断烦恼习，一切皆尽，具足解脱，是明究竟。 又复究者名度，竟者名已。 十方大圣、得道真人，度生死海，已至彼岸，故名究竟。 如此是名分别，毕竟究竟，差别之相。 帝君又曰：当何名此经，云何传授方法所须？ 愿垂具告。 太上曰：此经名为《开演秘密之藏》，所以者何？ 此经明於三世十方得道神尊微密妙身秘藏之义，如我等比无上法王，出此五浊，化诸众生三业示见，方便善巧，意趣微隐，难可了知。 所以尔者，十方天尊所得之身即真道相，体合自然，无形无名，非造作法，如虚空相，无数劫来久证此法，同一性相，平等无二，而能出见种种法身，示修习报，应化无方，人天恶道，随类所见，受生业行，皆同其法。 或见殊胜，超踰世间，第一希有，独步无畏，威变自在，不可思议，是名开演身秘密藏。 能於正道真实之性，无言无说，寂灭相中，善巧因缘，分别显示，随其所宜，说法无尽，言辞次第，义味深赜。",
      "translated_text": "For those of dull faculties, at times the teaching speaks of existence, at times of emptiness, at times of permanence, at times of impermanence—this is called the \"two halves.\" As the teachings differ from before to after, they cannot be given all at once. Following the illness, a single remedy is prescribed, biased toward one truth—this is called \"partial.\" Once the former illness is cured, another medicine is revealed. Since the treatment is complete, it is called \"fulfilled.\" Having understood the two halves, one enters the Middle Way—only then is it called \"complete\" and \"perfect.\"\n\nFor those of profound wisdom, hearing one side of the teaching, they immediately comprehend: conditioned designations are the true Middle Way. What is called \"middle\" is to be free from all attachments, yet without abandoning anything; not clinging to either extreme—hence it is called \"middle.\" It can guide sentient beings to the noble abode, reaching the city of liberation—thus it is called \"middle.\" One who understands this Middle Way is called \"right contemplation.\" It is the foremost vehicle, capable of conveying practitioners beyond the three realms, transcending the two kinds of birth-and-death, realizing the true nature of dharmas, and attaining the supreme Dao.\n\nTherefore, this sutra can shatter the boundless dark chamber of ignorance, allowing one to see the precious treasure of the supreme true Dharma. Like a bright lamp dispelling all darkness, it enables those with eyes to see all treasures, using them freely as they wish, delighting the heart with joy.\n\nNow the Supreme Lord of the Grand Tenuity bowed and said to the Most High: \"If this is so, then only a correct understanding of the essential Middle Way is needed to attain the Dao. Why must one further study other scriptures and precepts, which only bring weariness?\"\n\nThe Most High replied: \"If practitioners delve into the roots of the aggregates and virtue, fully comprehending the true emptiness and Middle Way, then they are already complete—there is no need to cultivate other methods. However, for the multitudes of sentient beings in the Five Defilements who have not yet grasped the profound and wondrous purport of this sutra, other teachings are first shown to tame their minds, cutting off the four mara-bandits of afflictions. Just as a king, though possessing boundless treasures and pleasures, still requires city walls, moats, and fortifications to guard against thieves and block all obstacles, so too does right contemplation. When the mind-king first awakens, it dwells in the city of the Middle Way, using precepts and wisdom as its walls and moats, firmly adorning itself and preparing for all mara-trials. Thus, the Heavenly Worthies of the ten directions expound the scriptures and precepts, broadly opening the Dharma-gates.\"\n\nThe Supreme Lord of the Grand Tenuity bowed his head and asked: \"I venture to inquire of the Dao Lord: what are the ultimate distinctions of 'ultimate' and 'consummate'? I humbly request your instruction.\"\n\nThe Most High said: \"'Ultimate' means decisive; 'consummate' means fixed. The Dharma I speak is decisively non-dual. As I say: the world is impermanent, like emptiness, empty of self, pure. The fruit of the Dao is eternally attained, blissful, free, truly pure. If other scholars come to question these meanings, they will never cause me to waver. All the divine worthies of the three times speak thus—this is the meaning of 'decisive' and 'ultimate.'\n\nFurthermore, 'ultimate' means thorough; 'consummate' means true. When the Dao Lords speak of all dharmas, they say their original nature is pure, like the nature of empty space, provisionally existing through causes and conditions, yet not truly real in substance. The principle of the Middle Way is free from inversion—it is the mark of quiescence. Those who speak thus do so with thorough truthfulness, without falsehood. Hence, it is also called the meaning of 'ultimate.'\n\nMoreover, 'ultimate' means to penetrate; 'consummate' means to comprehend. When the great sages of the ten directions sit at the seat of enlightenment, they realize profound right wisdom. In a single thought, they illuminate all dharmas and their true nature, penetrating and comprehending without error. This wisdom is perfect, corresponding to the true mark of dharmas, penetrating and comprehending without omission—hence it is called 'ultimate.'\n\nAs for 'consummate,' 'consummate' means to reach; 'consummate' means the limit. The divine worthies of the ten directions attain omniscience, reaching the limit of the Dharma—this is called 'consummate.'\n\nFurthermore, 'consummate' means to sever; 'consummate' means to exhaust. All divine worthies, with the wisdom of true mark, sever and exhaust all afflictions and habits, attaining complete liberation—this clarifies 'consummate.'\n\nMoreover, 'consummate' means to cross; 'consummate' means to have arrived. The great sages and perfected ones who have attained the Dao cross the sea of birth-and-death, having reached the other shore—hence it is called 'consummate.' Such are the distinctions of 'ultimate' and 'consummate.'\n\nThe Supreme Lord again asked: \"What should this sutra be called, and what are the required methods for its transmission? I humbly request your full instruction.\"\n\nThe Most High said: \"This sutra is called *Revealing the Secret Treasury*. Why? This sutra clarifies the meaning of the secret and wondrous bodies of the divine worthies of the three times and ten directions who have attained the Dao. Like us, the supreme Dharma-kings, who emerge in the Five Defilements to transform sentient beings, manifesting the three karmas, employing skillful means—our intentions are subtle and hidden, difficult to comprehend.\n\nThe reason is this: the bodies attained by the Heavenly Worthies of the ten directions are the true marks of the Dao, inherently harmonizing with nature, formless and nameless, not fabricated dharmas, like the mark of empty space. Having realized this Dharma for countless kalpas, they share one nature and mark, equal and non-dual. Yet they can manifest various Dharma-bodies, displaying cultivation, retribution, and responsive transformations without limit. In the realms of humans, gods, and evil destinies, they appear according to the types they encounter, conforming to their karmic actions and practices. Some appear surpassingly noble, transcending the world, supremely rare, unmatched and fearless, with awe-inspiring transformations and unimaginable freedom—this is called *Revealing the Secret Treasury of the Body.*\n\nWithin the true nature of the right Dao, though wordless and unspeakable, in the mark of quiescence, they skillfully employ causes and conditions to distinguish and reveal, teaching endlessly according to what is fitting. Their words and sequences are profound and recondite in meaning and flavor.\"",
      "overlap_context": "erse, addressed the Most High: \"If all the teachings spoken by the divine worthies equally express the one Dao, without distinction of depth or shallowness, how then do the complete and the incomplete teachings arise, with their differing paths?\"\n\nThe Dao Lord replied: \"Whatever the great sages say is all right contemplation, the mind of omniscience—nothing is not ultimate, all is the definitive meaning. Yet because of sentient beings, there are differences between the partial and the complete.\"",
      "start_char": 3762,
      "end_char": 4974,
      "start_sentence": 191,
      "end_sentence": 236,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.43081831932068,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝开演秘密藏经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "或说一乘，或说三乘，人天业果，渐渐开化，使得同归真一正道，是名开演口秘密藏。 虽无念虑，离分别想，以一切智，洞达空门，正解正观，穷理边底，与真实相平等为一，以一切种智照世间法。 色法非色法，心法非心法。 人天五道，四大六家，众生想念，果报因缘，於一念中明了无碍。 善识根性，随宜所行，世出秘法，洞达究尽，是名开演心秘密藏。 以是三种秘密之法，成真道身，非是凡夫乃至上圣所能觉知。 我於是经，具开此义，明说身相，启方便门，令诸学者入重玄趣。 是故此经名为《开演秘密奥藏》。 如是受持。 此经大乘，众经中最妙。 若有至心，堪能解了，讲宣其义，审得其人，稽首而传，不须盟信。 何以故？ 已受余经，知其心故，亦是平等，无拣择故。 太微帝君拜手言曰：善哉，道君演说如是深奥之义。 我於今日，始知神尊，审是众生真实父母，能以大慈大悲之力，於无相中，示真法相，说此三种微密之趣，令诸来生悟一乘道，得妙法身，证无上觉，自能了知秘密之藏，亦当能为一切众生，开演甚深三种微密。 我今始知无上大乘平等正法，无择秽贱，唯授能行，有心之人，辄当传付，令此妙教广得流通，普令一切开正法眼，绍继道君无上之位，使三宝轮转，运照无辍。 太上告曰：善哉，帝君乃能发心，弘宣此法。 来生男女当受斯庆，咸见正道，得浄法身。 帝君当知，若使余经不流布者，於诸世间无深损害； 若失此经一句一偈，则为一切构诸灾祸。 何以故？ 此经明示，真道正身，即是众生，终归窟宅。 若失此经，永为孤露，流漂三涂、五道之中，没於长苦，无由解脱。 何以故？ 不得本源，无所归故。",
      "translated_text": "Should they expound the One Vehicle or the Three Vehicles, elucidating the karmic fruits of humans and gods, gradually guiding all to converge upon the true and singular right Dao—this is called *Revealing the Secret Treasury of the Mouth.*\n\nThough free from thought and deliberation, beyond discriminative conceptions, with omniscience they penetrate the gate of emptiness, attaining right understanding and right contemplation, exhausting the bounds of principle to become one with the true reality. With knowledge of all modes, they illumine the dharmas of the world: form yet not form, mind yet not mind. The five destinies of humans and gods, the four great elements and six realms, the thoughts of sentient beings, and the karmic fruits of causes and conditions—all are clearly and unimpededly comprehended in a single thought. Skillfully discerning the roots and natures of beings, they act in accord with what is fitting, thoroughly penetrating and exhausting the secret dharmas of both the mundane and transcendent—this is called *Revealing the Secret Treasury of the Mind.*\n\nThrough these three kinds of secret Dharma, the true Dao-body is perfected, which neither ordinary beings nor even the highest sages can fathom or know. In this sutra, I have fully disclosed this meaning, clearly expounding the marks of the body and opening the gate of expedient means, guiding all learners to enter the profound mystery. Therefore, this sutra is named *Revealing the Profound Secret Treasury.*\n\nThus should it be received and upheld. This sutra is the most sublime among all Mahayana sutras. If there be one of utmost sincerity, capable of understanding and expounding its meaning, having ascertained such a person, bow in reverence and transmit it—no oath of secrecy is required. Why? Because those who have received other sutras already know their hearts, and this is also a matter of equality, without discrimination.\n\nThe Most August Lord of the Grand Tenuity bowed and said: \"Excellent! O Dao-Lord, in expounding such profound and recondite meaning, today I have first come to know that the Divine Honored One is truly the father and mother of all beings. Through the power of great compassion and great mercy, within the markless you reveal the true Dharma-mark, proclaiming these three kinds of subtle and secret purports, enabling all future beings to awaken to the One Vehicle, attain the wondrous Dharma-body, and realize supreme enlightenment. They will themselves comprehend the secret treasury and, in turn, be able to reveal for all beings the three kinds of profound secrets.\n\nOnly now do I truly understand that the supreme Mahayana, the equal and right Dharma, makes no distinction of purity or defilement, bestowing only upon those capable of practice. Those with the heart to receive it shall transmit it forthwith, that this wondrous teaching may widely circulate, universally opening the Dharma-eye for all, continuing the unsurpassed position of the Dao-Lord, and ensuring the Wheel of the Three Jewels turns without cease, radiating its light unbroken.\"\n\nThe Most High addressed him, saying: \"Excellent! O Emperor-Lord, that you are able to resolve to propagate this Dharma. Future men and women who receive this blessing shall all behold the right Dao and attain the pure Dharma-body. Know this, Emperor-Lord: if other sutras were not to circulate, there would be no profound harm to the world; but should even a single verse of this sutra be lost, it would give rise to all manner of calamities and misfortunes. Why? Because this sutra clearly reveals the true Dao-body, which is the ultimate refuge and dwelling of all beings. If this sutra is lost, they will forever remain orphaned and exposed, drifting in the three evil destinies and five paths, submerged in endless suffering, with no means of liberation. Why? Because they will have lost their root-source and have nowhere to return.\"",
      "overlap_context": "passingly noble, transcending the world, supremely rare, unmatched and fearless, with awe-inspiring transformations and unimaginable freedom—this is called *Revealing the Secret Treasury of the Body.*\n\nWithin the true nature of the right Dao, though wordless and unspeakable, in the mark of quiescence, they skillfully employ causes and conditions to distinguish and reveal, teaching endlessly according to what is fitting. Their words and sequences are profound and recondite in meaning and flavor.\"",
      "start_char": 4974,
      "end_char": 5607,
      "start_sentence": 237,
      "end_sentence": 261,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.357267141342163,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝开演秘密藏经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "是故帝君常当一心，弘宣此法，必使流通。 我昔受之於太帝，太帝受之於五帝上真高上玉皇，玉皇受之於玉清帝君、消魔大王，大王受之於八天虚皇帝君，口口相传，不记文字。 帝君今可书而录之，使得流布将来众生。 吾当以神通力守护此经，随有之处，悉皆吉祥。 大劫之周，余道皆灭，此经独存，当还大罗之天，随机下世，救度天人。 於是太微帝君镌玉为简，镂金为字，编以白银，撰录此经，盛以紫玉之函，封於七宝之台，仙童玉女散花烧香，供养灵文。 是时大众闻受经已，太上道君还於玉京，诸来会者各礼而去。 太上洞玄灵宝开演秘密藏经竟",
      "translated_text": "Thus, Emperor-Lord, you must ever single-mindedly propagate and proclaim this Dharma, ensuring its unbroken circulation. I once received it from the Supreme Emperor, who received it from the Five Emperors and the Most High Jade Sovereign; the Jade Sovereign received it from the Jade Clarity Emperor-Lord and the Great King Who Subdues Demons; the Great King received it from the August Emperor-Lord of the Eight Heavens. Thus it was transmitted mouth to mouth, without reliance on written text. Now, Emperor-Lord, you may commit it to writing and record it, that it may circulate among future beings. I shall guard this sutra with my divine power, and wherever it abides, all shall be auspicious. When the great kalpa comes full cycle and all other Ways perish, this sutra alone shall endure, returning to the Great Luo Heaven, descending again to the world in accord with conditions, to deliver gods and humans.\n\nThereupon, the Emperor-Lord of the Grand Tenuity carved jade into tablets and engraved gold into characters, binding them with silver, and compiled this sutra. He placed it in a casket of purple jade, sealed it upon a seven-jeweled dais, while immortal youths and jade maidens scattered flowers and burned incense in offering to the sacred text. When the great assembly had received the sutra, the Most High Dao-Lord returned to Jade Capital, and all who had gathered bowed in reverence and departed.\n\nThus concludes the *Most High Cavernous Mystery Divine Treasure: The Sutra of Unfolding the Secret Treasury*.",
      "overlap_context": "d; but should even a single verse of this sutra be lost, it would give rise to all manner of calamities and misfortunes. Why? Because this sutra clearly reveals the true Dao-body, which is the ultimate refuge and dwelling of all beings. If this sutra is lost, they will forever remain orphaned and exposed, drifting in the three evil destinies and five paths, submerged in endless suffering, with no means of liberation. Why? Because they will have lost their root-source and have nowhere to return.\"",
      "start_char": 5607,
      "end_char": 5854,
      "start_sentence": 262,
      "end_sentence": 269,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.195621967315674,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝开演秘密藏经.txt",
        "category": "本文类"
      }
    }
  ]
}