{
  "source_id": "太上说轮转五道宿命因缘经",
  "source_file": "chunked_daozang\\太上说轮转五道宿命因缘经.json",
  "total_chunks": 4,
  "total_original_chars": 3042,
  "total_translated_chars": 17132,
  "total_translation_time": 77.68212485313416,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上说轮转五道宿命因缘经.txt",
    "category": "本文类"
  },
  "full_translation": "The *Sutra of the Five Paths of Transmigration and the Causes and Conditions of Past Lives as Spoken by the Most High*\n\n**Title:** *Sutra of the Five Paths of Transmigration and the Causes and Conditions of Past Lives as Spoken by the Most High*. The author is unknown, but it appears to date from the Tang dynasty. It is attributed to the Most High Lord Lao, who expounds on the causes and conditions of past lives to the Left Mystery Perfected One and others. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, \"Writings\" section of the *Dongshen* Department.\n\n---\n\nAt that time, the Most High Lord Lao was dwelling in a pure abode in the kingdom of Kapilavastu, accompanied by twelve hundred and fifty celestial immortals, earthly immortals, immortal youths, and jade maidens. Having completed the nine-month long fast, he emerged from the divine abode and traveled to the Jetavana Grove in the kingdom of Śrāvastī, the Garden of Anāthapiṇḍada.\n\nBetween the two kingdoms stood a great tree named Śikhin, towering one thousand eight hundred and sixty *li* in height, its branches and leaves spreading to cover an area six hundred and thirty *li* in circumference. Upon this tree grew tens of millions of fruits, each as large as a stone, sweet and fragrant to the taste, like honey. When the ripe fruits fell, the people who ate them found all illnesses cured and their ears and eyes sharpened in clarity.\n\nAs we sat beneath the tree, the assembled immortals gathered the fruits to eat. Then the Left Mystery Perfected One addressed the immortals, saying: \"I observe that all things between heaven and earth possess their own causes and conditions from past lives.\"\n\nThe immortals then stepped forward, bowed in reverence, knelt, and addressed the Heavenly Worthy, saying: \"What are these causes and conditions of past lives? We, your disciples, wish to hear of them. Pray, expound upon them in full to enlighten those who have not yet heard.\"\n\nThe Perfected One replied: \"Excellent. If there are those who delight in hearing, listen single-mindedly and with care.\"\n\nThe Dao spoke: \"A person’s accumulation of blessings is like this tree—small at first, then gradually growing vast, bearing boundless fruit. Those who in this life are noble and exalted, becoming emperors, kings, lords, or regional governors, descend from those who in past lives revered the Three Treasures. Those who in this life are immensely wealthy, with limitless riches, descend from those who in past lives practiced generosity. Those who in this life enjoy long life, free from illness, descend from those who in past lives upheld the precepts. Those who in this life are comely, with radiant complexions, peerless in grace, their hands and feet supple and graceful—so that all who see them rejoice and never tire of gazing—descend from those who in past lives cultivated forbearance. Those who in this life are diligent, never idle, descend from those who in past lives accumulated merit through unflagging effort. Those who in this life are composed, their words and deeds measured and precise, descend from those who in past lives refined their thoughts through meditation. Those who in this life are wise, penetrating the scriptures and dharma, extolling the sublime teachings, awakening the benighted—so that all who hear their words receive and cherish them—descend from those who in past lives cultivated wisdom. Those who in this life possess voices of crystalline clarity descend from those who in past lives chanted and praised the Three Treasures. Those who in this life are pure and free from illness descend from those who in past lives nurtured a heart of compassion.\"\n\nThe assembled immortals then addressed the Heavenly Worthy, saying: \"What is a heart of compassion?\"\n\nThe Left Mystery Perfected One replied: \"First, to cherish all beings as a mother loves her child. Second, to wish that all beings in the world attain freedom. Third, to comprehend the Dao’s intent and abide in constant joy. Fourth, to refrain from all evil. This is a heart of compassion.\"\n\nThe Dao continued: \"Those who in this life are beautiful descend from those who in past lives treated others with reverence. Those who in this life are ugly descend from those who in past lives indulged in anger. Those who in this life are ignorant descend from those who in past lives neglected study. Those who in this life are dull-witted and obtuse descend from those who in past lives refused to teach others. Those who in this life are mute or speech-impaired descend from those who in past lives slandered the innocent. Those who in this life are deaf or blind descend from those who in past lives disdained the scriptures and refused to listen to the teachings. Those who in this life are slaves or servants descend from those who in past lives left debts unpaid and failed to revere the Three Treasures. Those who in this life are dark and unsightly descend from those who in past lives obscured the light. Those who in this life are born among the naked peoples descend from those who in past lives disdained clothing, exposing themselves in sacred precincts. Those who in this life are born among the horse-hoofed peoples descend from those who in past lives regretted their acts of generosity and charity. Those who in this life are born among deer and muntjacs descend from those who in past lives startled others with fear. Those who in this life fall among dragons descend from those who in past lives delighted in frivolous play. Those who in this life suffer from festering sores, leprosy, or incurable afflictions—untreatable by medicine, their agony beyond words—descend from those who in past lives unjustly whipped living beings. Those who in this life are shunned, unwelcome to others, descend from those who in past lives showed no joy in the presence of others. Those who in this life are beloved, inspiring reverence and affection, descend from those who in past lives delighted in the company of others. Those who in this life are repeatedly seized by officials, imprisoned, their bodies broken by cangues and fetters, descend from those who in past lives unjustly confined and bound living beings, denying them freedom. Those who in this life are harelipped descend from those who in past lives sat with hooks in the mouths of fish. Such transgressions must not be taken lightly.\n\nThe Dao declared: \"In this world, fools who hear kind and virtuous words yet take no pleasure in them, instead sowing discord with slander, shall in the next life become dogs with yapping, echoing barks. Those who hear the scriptures yet fail to heed them shall in the next life fall among donkeys. Those who are miserly, hoarding food for themselves, shall in the next life fall among hungry ghosts; if they are reborn among humans, they will be solitary, impoverished, starving, clothed in rags, unable to feed themselves. Those who delight in eating yet offer others only foul food shall in the next life be reborn as pigs, swine, or dung beetles. Those who rob others of their wealth, stripping them of their clothing, shall in the next life fall among sheep, where others will flay their skins to repay their past sins. Those who take pleasure in killing, spending their lives fishing, shall in the next life become mayflies upon the water, born at dawn and dead by dusk. Those who steal others’ possessions without cause shall in the next life be reborn as slaves, servants, oxen, or horses. Those who lust after others’ wives, heedless of sun, moon, and stars, shall upon death plunge directly into hell, where men embrace copper pillars and women lie upon iron beds. If they are reborn, they will surely fall among chickens and ducks. Those who delight in falsehood, twisting others’ virtues into vices, shall upon death plunge directly into hell, where molten copper will be poured into their mouths, their tongues torn out and plowed by oxen. If they are reborn, they will become owls and vultures, their cries striking terror into all who hear them; all will call them omens of misfortune and curse them to death. Those who indulge in wine and intoxication, committing the thirty-six transgressions, shall upon death fall into the hell of mud and excrement. If they are reborn, they will be utterly foolish, knowing nothing. Those whose marriages are discordant, who quarrel and drive each other away, shall in the next life fall among turtledoves. Those who exploit others’ labor shall in the next life take the form of elephants.\n\nThe Dao continued: \"If those who serve as prefects or magistrates, drawing their sustenance from office and their emoluments from rank, privately extort from the people, beating and flogging them, compelling forced deliveries—so that their grievances go unheard, their punishments unchecked, and no leniency is shown—\"\n\nSuch persons bear grave sins; upon death, they descend directly into hell, where their spirits endure a hundred pains for tens of millions of kalpas. Only after their sins are exhausted may they be reborn—then as water buffaloes, their noses pierced and yoked, made to pull heavy carts while great rods strike them, repaying their past transgressions.\n\nThe Dao continued: \"Those who in this life are human yet do not bathe—such persons come from swine, pigs, or dung beetles in a former existence. Those who in this life are miserly and greedy, refusing to yield and speaking harshly—such persons come from vicious dogs in a former existence. Those who in this life are cruel, obstinate, and self-willed—such persons come from sheep in a former existence. Those who in this life speak rashly and cannot endure hardship—such persons come from macaques in a former existence. Those whose bodies in this life reek of stench—such persons come from fish and turtles in a former existence. Those who in this life rush toward evil and harbor venomous hearts—such persons come from vipers in a former existence. Those who in this life delight in preparing fine foods, slaughtering living beings, and lack all compassion—such persons come from jackals, wolves, tigers, and leopards in a former existence. Those born in this life among the frontier lands of the Six Barbarian tribes—such persons, in a former existence, did not believe in the Dao and its teachings. Those whose backs in this life are hunched—such persons, in a former existence, did not fully prostrate themselves when worshipping the Three Treasures. Those who in this life suffer frequent illnesses and undergo much acupuncture—such persons, in a former existence, were physicians who applied needles and moxibustion, sometimes curing, sometimes worsening conditions, yet took others’ possessions in payment.\n\nThe Dao continued: \"Those who in this life are well-ordered in conduct, adorned with literary grace, upright in principle, rich in wisdom, and able to expound wondrous meanings—such persons, in a former existence, propagated the true teachings and come from the heavens. Those who in this life are learned, clear in understanding, intelligent, and free from greed—such persons come from immeasurable kalpas of accumulated merit in a former existence. Those whose complexions in this life are fair and bright—such persons, in a former existence, delighted in offering banners and flowers to the Three Treasures. Those whose bodies and breath in this life are fragrant and pure—such persons, in a former existence, committed no transgressions and spoke no evil, hence their present state. Those who in this life die by fire—such persons, in a former existence, delighted in setting fires and burning living beings. Those who in this life drown—such persons, in a former existence, without cause cast living beings into water. Those who in this life hang themselves—such persons, in a former existence, without cause bound living beings with ropes. Those who in this life are killed by fierce tigers or venomous snakes—such persons, in a former existence, without cause accepted bribes to kill others. Those who in this life are struck dead by thunderbolts—such persons, in a former existence, committed many evils, reviled their elders, disrespected their parents, and defiled the Three Luminaries. Those who in this life remain solitary into old age, without sons—such persons, in a former existence, secretly harbored malice and envied others’ children and grandchildren. Those who in this life are short-lived, their births marred by miscarriage or premature death, dying before their time—such persons shall remain in the Three Wretched Realms for tens of millions of kalpas before they may emerge.\n\nThe Dao continued: \"Those whose eyes in this life are blind in one eye—such persons, in a former existence, disliked reading scriptures and collecting alms from the elderly. Those who in this life are skilled artisans, constructing and repairing with craftsmanship—such persons come from the palaces of the heavens in a former existence. Those who in this life are clear and penetrating in understanding, with voices of wondrous tone—such persons, in a former existence, delighted in listening to and teaching the scriptures and their precepts. Those who in this life are blind, deaf, or lack the six senses—such persons, in a former existence, delighted in mocking others and living beings. Those who in this life lose their parents early and remain solitary—such persons, in a former existence, killed others’ parents. Those born into separation, scattered in foreign lands, reduced to lowly status, enslaved and driven—such persons, in a former existence, delighted in banditry, breaking into homes, blocking roads, seizing people, beating and binding them, selling them into servitude, causing their parents anguish so profound their livers and hearts shattered, their deaths bringing no relief. Thus do they now repay their past sins.\n\nThe Perfected One of the Left Mystery said: \"I have witnessed the karmic retributions of past lives—how clear they are! One must be cautious.\"\n\nThe Dao continued: \"Those who perform meritorious deeds should personally offer incense, blessings, and food, and recite scriptures. Do not invite others to eat on your behalf, lest your vows remain unfulfilled. If you rely on others for your meals, how can you ever be sated? Reflect well on performing good deeds and bestowing kindness.\"\n\nThe Perfected One of the Left Mystery said: \"Burning incense, practicing the Dao, observing fasts, reciting scriptures, lighting lamps to continue the light, and fulfilling vows—these should be regular practices of almsgiving. Through them, one gains merit, attains wisdom, and becomes free from hindrances. The divine generals will welcome you, all evils will dissipate, and the myriad demons will not dare to oppose you. Those who are indolent and lack diligence—when illness strikes, no good fortune remains. Only then do they think to burn incense and perform good deeds, but evil has already descended, and demons stand guard, competing to manifest strange omens. For this reason, one must always be diligent. Karmic retribution follows a person like a shadow or echo.\"\n\nThe Dao continued: \"Cultivating the field of merit is like planting a *śimbali* tree—how many roots did you sow? The various immortals then stepped forward, bowed, and addressed the Most High, saying: 'Originally, there was but one root, yet gradually it grew, yielding limitless seeds.' The Most High said to the immortals: 'Giving one brings ten thousandfold in return—were these words empty?' Then the Dao proclaimed in verse:\n\nThe worthy delight in almsgiving,\nHeavenly spirits naturally support them.\nGive one, receive ten thousandfold,\nEnjoying peace, longevity, and long life.\nBestow kindness upon good people today,\nTheir merit is immeasurable.\nAll shall attain the Dao of immortality,\nLiberating the beings of the ten directions.\n\nThe Most High addressed the various immortals: \"Worldly people, lacking wisdom and possessing only the fleshly eyes of life and death, do not understand karmic retribution. With the eye of the Dao, I have witnessed countless kalpas, up to the present day.\"\n\nThe karmic retribution of sin and blessing is as clear as beholding a jewel of lapis lazuli in the palm—no doubt lingers within or without.\n\nThen the various heavenly immortals rose, adjusted their robes, and bowed to address the Most High, saying: \"Though you have expounded this principle, we have yet to fully comprehend it. We humbly beseech further enlightenment.\"\n\nThe Most High replied: \"This is called *The Sutra of the Five Paths’ Turning Wheel: Karmic Retribution of Past-Life Causes and Conditions*. If good men and good women are able to recite, chant, and propagate it, their merit shall be boundless.\"\n\nAt that time, the Left Mystic Perfected and the various heavenly immortals, along with the people of the world who had heard this sutra, all rejoiced greatly. Each arose according to their karmic conditions, circumambulated three times, bowed in reverence, and withdrew.\n\nThus concludes *The Most High’s Sutra of the Turning Wheel of the Five Paths: Karmic Retribution of Past-Life Causes and Conditions*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上说转轮五道宿命因缘经 经名：太上说转轮五道宿命因缘经。 撰人不详，似出於唐代。 假托太上老君为左玄真人等说宿命因缘。 一卷。 底本出处：《正统道藏》洞神部本文类。 太上说转轮五道宿命因缘经 尔时，太上老君在迦维罗卫国精舍中，与诸天仙、地仙、仙童、玉女等一千二百五十人俱。 九月长斋，一时讫，竟从神舍中出，往到舍卫国祇树下给孤独园。 二国中间，有一大树名尸俱类，高一千八百六十里，枝叶方圆覆六百三十里。 其树上有子数千万石，食之甘香，其味如蜜。 甘果熟落，人民食之，众病自愈，耳目精明。 吾坐树下，是诸仙等取果食之。 左玄真人告诸仙等，吾观天地万物，各有宿命因缘。 诸仙等即前作礼，长跪白天尊言曰：何等宿命因缘，此诸弟子愿闻也。 唯具演说，开化未闻。 真人答曰：善哉，若有乐闻者，一心谛听。",
      "translated_text": "The *Sutra of the Five Paths of Transmigration and the Causes and Conditions of Past Lives as Spoken by the Most High*\n\n**Title:** *Sutra of the Five Paths of Transmigration and the Causes and Conditions of Past Lives as Spoken by the Most High*. The author is unknown, but it appears to date from the Tang dynasty. It is attributed to the Most High Lord Lao, who expounds on the causes and conditions of past lives to the Left Mystery Perfected One and others. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, \"Writings\" section of the *Dongshen* Department.\n\n---\n\nAt that time, the Most High Lord Lao was dwelling in a pure abode in the kingdom of Kapilavastu, accompanied by twelve hundred and fifty celestial immortals, earthly immortals, immortal youths, and jade maidens. Having completed the nine-month long fast, he emerged from the divine abode and traveled to the Jetavana Grove in the kingdom of Śrāvastī, the Garden of Anāthapiṇḍada.\n\nBetween the two kingdoms stood a great tree named Śikhin, towering one thousand eight hundred and sixty *li* in height, its branches and leaves spreading to cover an area six hundred and thirty *li* in circumference. Upon this tree grew tens of millions of fruits, each as large as a stone, sweet and fragrant to the taste, like honey. When the ripe fruits fell, the people who ate them found all illnesses cured and their ears and eyes sharpened in clarity.\n\nAs we sat beneath the tree, the assembled immortals gathered the fruits to eat. Then the Left Mystery Perfected One addressed the immortals, saying: \"I observe that all things between heaven and earth possess their own causes and conditions from past lives.\"\n\nThe immortals then stepped forward, bowed in reverence, knelt, and addressed the Heavenly Worthy, saying: \"What are these causes and conditions of past lives? We, your disciples, wish to hear of them. Pray, expound upon them in full to enlighten those who have not yet heard.\"\n\nThe Perfected One replied: \"Excellent. If there are those who delight in hearing, listen single-mindedly and with care.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 342,
      "start_sentence": 0,
      "end_sentence": 16,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.658220291137695,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上说轮转五道宿命因缘经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "道言：夫人作福亦如此树，小小渐大，收子无限。 人今生在世，豪贵为帝王国主，诸侯方伯，此人先身从礼拜三宝中来。 今身为人大富，财物无量者，此人先身从布施中来。 今身为人长寿，无有疾病者，此人先身从持戒中来。 今身为人端正，颜色洁白，晖容第一，手足柔奕，众人见之，皆各喜悦，视之无厌者，此人先身从忍辱中来。 今身为人精进，无有懈怠者，此人先身从福德精进中来。 今身为人安详，言行审谛者，此人先身从精思中来。 今身为人聪明，达解经法，赞扬妙法，开悟愚蒙，人闻其言，莫不谘受宣明为珍者，此人先身从智慧中来。 今身为人音声清澈者，此人先身从歌咏三宝中来。 今身为人洁净，无有疾病者，此人先身从慈心中来。 诸仙等上白天尊曰：云何为慈心。 左玄真人答曰：一慈念众生如母爱子。 二慈念世间一切众生各得自在。 三解道意，心常欢喜。 四为一切不犯众恶。 此是为慈心也。 道言：今身为人姝美者，此人先身恭敬人故。 今身为人丑陋者，此人先身喜嗔恚故。 今身为人无所知者，此人先身不学问故。 今身为人颛愚暗塞者，此人先身不教人故。 今身为人喑痖者，此人先身无辜谤毁人故。 今身为人聋盲者，此人先身不喜看经，不肯听经故。 今身为人奴婢者，此人先身负债不偿，亦不礼三宝故。 今身为人丑黑者，此人先身遮翳光明故。 今身生在裸国人中者，此人先身轻衣裸露唐突精舍故。 今身生在马蹄人国中者，此人先身布施作福还悔惜心故。 今身生獐麂鹿中者，此人先身意惊恐人故。 今身堕在龙中者，此人先身喜相调戏故。 今身生恶疮癞疾难瘥，医药不治，苦毒难言者，此人先身无辜鞭打众生故。 今身为人所僧，人不欲见，见不欢悦者，此人先身见人不欢喜故。 今身为人，人见欢喜敬念者，此人先身见人喜悦故。 今身为人，数遭县官击闭牢狱，节核其身，枷锁在体者，此人先身无辜笼罩系缚众生不得纵意故。 今身为人兔缺者，此人先身坐钓鱼口缺故。 如此之罪，不可不慎也。 道言：今世愚人，闻人好言善语，心不乐闻，於中两舌乱人非是者，此人后世当作龛音答耳狗。 若世人闻经，心不听采者，后生当堕驴中。 若世人悭贪独食者，后生堕饿鬼之中，得生出世，或为独身，或为人贫穷饥饿，衣不盖形，食不供口。 若世人好食，自啖恶食施人者，后死当作猪豚蜣螂之中。 若世人劫夺人财物，生剥脱人衣服者，后死当堕羊中，人还生剥其皮，偿其宿罪。 若世人喜杀，一生捕鱼者，后死为水上蜉蝣之虫，朝生暮死。 若世人无辜盗取人财物者，后死出世，当生奴婢牛马之中。 若世人喜淫人妇女，不避三光者，死径入地狱之中，男抱铜柱，女卧铁床。 后得出世，必生鸡鸭之中。 若世人好妄语，传人善事以作恶言者，死径入地狱，洋铜灌口，拔出其舌，以牛犁之。 后得生世，当作鸱枭恶鸟，人闻其声，莫不惊怖，皆言变怪，众口咒之，必令其死。 若世人喜酒耽醉者，犯三十六失，死堕泥犁之中。 后生出世，愚痴甚无所知。 若世人夫妇不相和顺，数共斗争，更相驱遣者，后生堕鸠鸽之中。 若世人贪人力者，后生当作象形。 道言：若世人为州郡令长者，禀食於官，奉於禄爵，或私侵於民，鞭打捶杖，逼强输送，告诉无所考劾，击录不得宽纵。",
      "translated_text": "The Dao spoke: \"A person’s accumulation of blessings is like this tree—small at first, then gradually growing vast, bearing boundless fruit. Those who in this life are noble and exalted, becoming emperors, kings, lords, or regional governors, descend from those who in past lives revered the Three Treasures. Those who in this life are immensely wealthy, with limitless riches, descend from those who in past lives practiced generosity. Those who in this life enjoy long life, free from illness, descend from those who in past lives upheld the precepts. Those who in this life are comely, with radiant complexions, peerless in grace, their hands and feet supple and graceful—so that all who see them rejoice and never tire of gazing—descend from those who in past lives cultivated forbearance. Those who in this life are diligent, never idle, descend from those who in past lives accumulated merit through unflagging effort. Those who in this life are composed, their words and deeds measured and precise, descend from those who in past lives refined their thoughts through meditation. Those who in this life are wise, penetrating the scriptures and dharma, extolling the sublime teachings, awakening the benighted—so that all who hear their words receive and cherish them—descend from those who in past lives cultivated wisdom. Those who in this life possess voices of crystalline clarity descend from those who in past lives chanted and praised the Three Treasures. Those who in this life are pure and free from illness descend from those who in past lives nurtured a heart of compassion.\"\n\nThe assembled immortals then addressed the Heavenly Worthy, saying: \"What is a heart of compassion?\"\n\nThe Left Mystery Perfected One replied: \"First, to cherish all beings as a mother loves her child. Second, to wish that all beings in the world attain freedom. Third, to comprehend the Dao’s intent and abide in constant joy. Fourth, to refrain from all evil. This is a heart of compassion.\"\n\nThe Dao continued: \"Those who in this life are beautiful descend from those who in past lives treated others with reverence. Those who in this life are ugly descend from those who in past lives indulged in anger. Those who in this life are ignorant descend from those who in past lives neglected study. Those who in this life are dull-witted and obtuse descend from those who in past lives refused to teach others. Those who in this life are mute or speech-impaired descend from those who in past lives slandered the innocent. Those who in this life are deaf or blind descend from those who in past lives disdained the scriptures and refused to listen to the teachings. Those who in this life are slaves or servants descend from those who in past lives left debts unpaid and failed to revere the Three Treasures. Those who in this life are dark and unsightly descend from those who in past lives obscured the light. Those who in this life are born among the naked peoples descend from those who in past lives disdained clothing, exposing themselves in sacred precincts. Those who in this life are born among the horse-hoofed peoples descend from those who in past lives regretted their acts of generosity and charity. Those who in this life are born among deer and muntjacs descend from those who in past lives startled others with fear. Those who in this life fall among dragons descend from those who in past lives delighted in frivolous play. Those who in this life suffer from festering sores, leprosy, or incurable afflictions—untreatable by medicine, their agony beyond words—descend from those who in past lives unjustly whipped living beings. Those who in this life are shunned, unwelcome to others, descend from those who in past lives showed no joy in the presence of others. Those who in this life are beloved, inspiring reverence and affection, descend from those who in past lives delighted in the company of others. Those who in this life are repeatedly seized by officials, imprisoned, their bodies broken by cangues and fetters, descend from those who in past lives unjustly confined and bound living beings, denying them freedom. Those who in this life are harelipped descend from those who in past lives sat with hooks in the mouths of fish. Such transgressions must not be taken lightly.\n\nThe Dao declared: \"In this world, fools who hear kind and virtuous words yet take no pleasure in them, instead sowing discord with slander, shall in the next life become dogs with yapping, echoing barks. Those who hear the scriptures yet fail to heed them shall in the next life fall among donkeys. Those who are miserly, hoarding food for themselves, shall in the next life fall among hungry ghosts; if they are reborn among humans, they will be solitary, impoverished, starving, clothed in rags, unable to feed themselves. Those who delight in eating yet offer others only foul food shall in the next life be reborn as pigs, swine, or dung beetles. Those who rob others of their wealth, stripping them of their clothing, shall in the next life fall among sheep, where others will flay their skins to repay their past sins. Those who take pleasure in killing, spending their lives fishing, shall in the next life become mayflies upon the water, born at dawn and dead by dusk. Those who steal others’ possessions without cause shall in the next life be reborn as slaves, servants, oxen, or horses. Those who lust after others’ wives, heedless of sun, moon, and stars, shall upon death plunge directly into hell, where men embrace copper pillars and women lie upon iron beds. If they are reborn, they will surely fall among chickens and ducks. Those who delight in falsehood, twisting others’ virtues into vices, shall upon death plunge directly into hell, where molten copper will be poured into their mouths, their tongues torn out and plowed by oxen. If they are reborn, they will become owls and vultures, their cries striking terror into all who hear them; all will call them omens of misfortune and curse them to death. Those who indulge in wine and intoxication, committing the thirty-six transgressions, shall upon death fall into the hell of mud and excrement. If they are reborn, they will be utterly foolish, knowing nothing. Those whose marriages are discordant, who quarrel and drive each other away, shall in the next life fall among turtledoves. Those who exploit others’ labor shall in the next life take the form of elephants.\n\nThe Dao continued: \"If those who serve as prefects or magistrates, drawing their sustenance from office and their emoluments from rank, privately extort from the people, beating and flogging them, compelling forced deliveries—so that their grievances go unheard, their punishments unchecked, and no leniency is shown—\"",
      "overlap_context": "e that all things between heaven and earth possess their own causes and conditions from past lives.\"\n\nThe immortals then stepped forward, bowed in reverence, knelt, and addressed the Heavenly Worthy, saying: \"What are these causes and conditions of past lives? We, your disciples, wish to hear of them. Pray, expound upon them in full to enlighten those who have not yet heard.\"\n\nThe Perfected One replied: \"Excellent. If there are those who delight in hearing, listen single-mindedly and with care.\"",
      "start_char": 343,
      "end_char": 1589,
      "start_sentence": 17,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.495518922805786,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上说轮转五道宿命因缘经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "此人罪重，死径入地狱之中，神经百痛数千万劫，罪毕出世，当作水牛，贯穿其鼻，牵车挽重，大棒打之，偿其宿罪。 道言：今身为人不沐浴者，此人先身从猪豚蜣螂中来。 今身为人悭贪，不让讥辞多声者，此人先身从恶狗中来。 今身为人狠戾自用意者，此人先身从羊中来。 今身为人言不安详，不能忍事者，此人先身从猕猴中来。 今身为人身体腥臭者，此人先身从鱼鳖中来。 今身为人趋恶行毒心者，此人先身从蝮蛇中来。 今身为人好作美食，杀害众生，无有慈心者，此人先身从豺狼虎豹中来。 今身生在边方六夷国中者，此人先身不信道法故。 今身为人背伛者，此人先身礼拜三宝不申背故。 今身为人疾病多有针灸者，此人先身作大医师，为人针灸，或瘥或剧，而无功效，便取他物直之故。 道言：今身为人安序文身，直理多智，开畅妙义，人所尊贵者，此人先身宣通真义，从诸天中来。 今身为人学问清彻，聪明不贪者，此人先身积福无量劫中来。 今身为人洁白，花色了了者，此人先身常喜持旛华奉上三宝中来。 今身为人身体口气香洁者，此人先身行无有过，口无有恶，今故如此也。 今身为人被烧死者，此人先身常喜放火，烧杀众生之故。 今身为人溺水死者，此人先身无辜以众生投掷水中故。 今身为人自缢死者，此人先身无辜以绳索系众生故。 今身为人被遭恶虎毒蛇死者，此人先身无辜受贷杀人故。 今身为人被天雷霹雳死者，此人先身为行多恶，欺骂长者，陵慢父母，污秽三光故。 今身为人孤独至老，无有儿子者，此人先身常阴怀恶憎，忌他人儿孙故。 今身为人生而短命，胞胎伤堕，出世未已而早夭终，在三涂数千万劫可得出也。 道言：今身为人眼目眇者，此人先身常不喜看经文，收拭老人眼目中来。 今身为人巧匠，兴造观治工巧者，此人先身从诸天宫殿中来。 今身为人明彻解了妙音者，此人先身常喜听受经法教人中来。 今身为人盲聋，六根不具者，此人常好狎人及众生故。 今身为人早失父母孤独者，此人先身杀人父母故。 生於分离，各异乡土，为人下贱，奴婢驱使者，此人先身常好作劫贼，或破人家，或要路断道，捉人打拍缚束转卖，使人父母懊恼，肝心寸绝，至死无益。 今偿宿罪，如此之故。 左玄真人曰：吾见宿世以来，罪福如此，明可慎之。 道言：凡人作功德者，皆应身自行香福食及以转经，不请人食，而不尽愿者。 如借人食，岂自得饱者乎。 善思作福为惠也。 左玄真人曰：烧香行道，斋戒诵经，然灯续明，尽愿以为常法布施。 得福并达智慧，无所挂碍，诸神将接，万恶皆消，众魔不敢复当。 懈怠之人，无有精进心者，一朝疾病，无有吉利，方欲烧香，便云作福，诸恶以降，众魔守前，竞来作诸变怪。 以是之故，常当精进。 罪福随人如影响也。 道言：植种福田，如尸俱类树，本种几根也。 诸仙等即前作礼上白太上言：本一根，小小渐大，收子无限。 太上语诸仙曰：施一得万倍，言岂虚也。 道乃颂曰： 贤者好布施，天神自扶将。 施一得万倍，安乐寿命长。 今日施善人，其福不可量。 皆当得仙道，度脱诸十方。 太上告诸仙人等：世人无智，生死肉眼，不知罪福。 吾以道眼睹无数劫来，至于今日。",
      "translated_text": "Such persons bear grave sins; upon death, they descend directly into hell, where their spirits endure a hundred pains for tens of millions of kalpas. Only after their sins are exhausted may they be reborn—then as water buffaloes, their noses pierced and yoked, made to pull heavy carts while great rods strike them, repaying their past transgressions.\n\nThe Dao continued: \"Those who in this life are human yet do not bathe—such persons come from swine, pigs, or dung beetles in a former existence. Those who in this life are miserly and greedy, refusing to yield and speaking harshly—such persons come from vicious dogs in a former existence. Those who in this life are cruel, obstinate, and self-willed—such persons come from sheep in a former existence. Those who in this life speak rashly and cannot endure hardship—such persons come from macaques in a former existence. Those whose bodies in this life reek of stench—such persons come from fish and turtles in a former existence. Those who in this life rush toward evil and harbor venomous hearts—such persons come from vipers in a former existence. Those who in this life delight in preparing fine foods, slaughtering living beings, and lack all compassion—such persons come from jackals, wolves, tigers, and leopards in a former existence. Those born in this life among the frontier lands of the Six Barbarian tribes—such persons, in a former existence, did not believe in the Dao and its teachings. Those whose backs in this life are hunched—such persons, in a former existence, did not fully prostrate themselves when worshipping the Three Treasures. Those who in this life suffer frequent illnesses and undergo much acupuncture—such persons, in a former existence, were physicians who applied needles and moxibustion, sometimes curing, sometimes worsening conditions, yet took others’ possessions in payment.\n\nThe Dao continued: \"Those who in this life are well-ordered in conduct, adorned with literary grace, upright in principle, rich in wisdom, and able to expound wondrous meanings—such persons, in a former existence, propagated the true teachings and come from the heavens. Those who in this life are learned, clear in understanding, intelligent, and free from greed—such persons come from immeasurable kalpas of accumulated merit in a former existence. Those whose complexions in this life are fair and bright—such persons, in a former existence, delighted in offering banners and flowers to the Three Treasures. Those whose bodies and breath in this life are fragrant and pure—such persons, in a former existence, committed no transgressions and spoke no evil, hence their present state. Those who in this life die by fire—such persons, in a former existence, delighted in setting fires and burning living beings. Those who in this life drown—such persons, in a former existence, without cause cast living beings into water. Those who in this life hang themselves—such persons, in a former existence, without cause bound living beings with ropes. Those who in this life are killed by fierce tigers or venomous snakes—such persons, in a former existence, without cause accepted bribes to kill others. Those who in this life are struck dead by thunderbolts—such persons, in a former existence, committed many evils, reviled their elders, disrespected their parents, and defiled the Three Luminaries. Those who in this life remain solitary into old age, without sons—such persons, in a former existence, secretly harbored malice and envied others’ children and grandchildren. Those who in this life are short-lived, their births marred by miscarriage or premature death, dying before their time—such persons shall remain in the Three Wretched Realms for tens of millions of kalpas before they may emerge.\n\nThe Dao continued: \"Those whose eyes in this life are blind in one eye—such persons, in a former existence, disliked reading scriptures and collecting alms from the elderly. Those who in this life are skilled artisans, constructing and repairing with craftsmanship—such persons come from the palaces of the heavens in a former existence. Those who in this life are clear and penetrating in understanding, with voices of wondrous tone—such persons, in a former existence, delighted in listening to and teaching the scriptures and their precepts. Those who in this life are blind, deaf, or lack the six senses—such persons, in a former existence, delighted in mocking others and living beings. Those who in this life lose their parents early and remain solitary—such persons, in a former existence, killed others’ parents. Those born into separation, scattered in foreign lands, reduced to lowly status, enslaved and driven—such persons, in a former existence, delighted in banditry, breaking into homes, blocking roads, seizing people, beating and binding them, selling them into servitude, causing their parents anguish so profound their livers and hearts shattered, their deaths bringing no relief. Thus do they now repay their past sins.\n\nThe Perfected One of the Left Mystery said: \"I have witnessed the karmic retributions of past lives—how clear they are! One must be cautious.\"\n\nThe Dao continued: \"Those who perform meritorious deeds should personally offer incense, blessings, and food, and recite scriptures. Do not invite others to eat on your behalf, lest your vows remain unfulfilled. If you rely on others for your meals, how can you ever be sated? Reflect well on performing good deeds and bestowing kindness.\"\n\nThe Perfected One of the Left Mystery said: \"Burning incense, practicing the Dao, observing fasts, reciting scriptures, lighting lamps to continue the light, and fulfilling vows—these should be regular practices of almsgiving. Through them, one gains merit, attains wisdom, and becomes free from hindrances. The divine generals will welcome you, all evils will dissipate, and the myriad demons will not dare to oppose you. Those who are indolent and lack diligence—when illness strikes, no good fortune remains. Only then do they think to burn incense and perform good deeds, but evil has already descended, and demons stand guard, competing to manifest strange omens. For this reason, one must always be diligent. Karmic retribution follows a person like a shadow or echo.\"\n\nThe Dao continued: \"Cultivating the field of merit is like planting a *śimbali* tree—how many roots did you sow? The various immortals then stepped forward, bowed, and addressed the Most High, saying: 'Originally, there was but one root, yet gradually it grew, yielding limitless seeds.' The Most High said to the immortals: 'Giving one brings ten thousandfold in return—were these words empty?' Then the Dao proclaimed in verse:\n\nThe worthy delight in almsgiving,\nHeavenly spirits naturally support them.\nGive one, receive ten thousandfold,\nEnjoying peace, longevity, and long life.\nBestow kindness upon good people today,\nTheir merit is immeasurable.\nAll shall attain the Dao of immortality,\nLiberating the beings of the ten directions.\n\nThe Most High addressed the various immortals: \"Worldly people, lacking wisdom and possessing only the fleshly eyes of life and death, do not understand karmic retribution. With the eye of the Dao, I have witnessed countless kalpas, up to the present day.\"",
      "overlap_context": "discordant, who quarrel and drive each other away, shall in the next life fall among turtledoves. Those who exploit others’ labor shall in the next life take the form of elephants.\n\nThe Dao continued: \"If those who serve as prefects or magistrates, drawing their sustenance from office and their emoluments from rank, privately extort from the people, beating and flogging them, compelling forced deliveries—so that their grievances go unheard, their punishments unchecked, and no leniency is shown—\"",
      "start_char": 1589,
      "end_char": 2827,
      "start_sentence": 67,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.188841104507446,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上说轮转五道宿命因缘经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "罪福报应，由如掌中视宝珠瑠璃，内外无有狐疑。 诸天仙人等即起，整顿衣服，作礼上白太上曰：演说斯义，未能解悟，愿赐开谕。 太上曰：此名为《五道轮转宿命因缘报应经》，若善男子善女人能诵咏宣传者，功德无量。 是时，左玄真人与诸天仙人等，世闻人民闻说是经，皆大欢喜，因缘各起，围绕三匝，稽首作礼而退。 太上说转轮五道宿命因缘经竟",
      "translated_text": "The karmic retribution of sin and blessing is as clear as beholding a jewel of lapis lazuli in the palm—no doubt lingers within or without.\n\nThen the various heavenly immortals rose, adjusted their robes, and bowed to address the Most High, saying: \"Though you have expounded this principle, we have yet to fully comprehend it. We humbly beseech further enlightenment.\"\n\nThe Most High replied: \"This is called *The Sutra of the Five Paths’ Turning Wheel: Karmic Retribution of Past-Life Causes and Conditions*. If good men and good women are able to recite, chant, and propagate it, their merit shall be boundless.\"\n\nAt that time, the Left Mystic Perfected and the various heavenly immortals, along with the people of the world who had heard this sutra, all rejoiced greatly. Each arose according to their karmic conditions, circumambulated three times, bowed in reverence, and withdrew.\n\nThus concludes *The Most High’s Sutra of the Turning Wheel of the Five Paths: Karmic Retribution of Past-Life Causes and Conditions*.",
      "overlap_context": "ort them.\nGive one, receive ten thousandfold,\nEnjoying peace, longevity, and long life.\nBestow kindness upon good people today,\nTheir merit is immeasurable.\nAll shall attain the Dao of immortality,\nLiberating the beings of the ten directions.\n\nThe Most High addressed the various immortals: \"Worldly people, lacking wisdom and possessing only the fleshly eyes of life and death, do not understand karmic retribution. With the eye of the Dao, I have witnessed countless kalpas, up to the present day.\"",
      "start_char": 2827,
      "end_char": 2993,
      "start_sentence": 115,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.3395445346832275,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上说轮转五道宿命因缘经.txt",
        "category": "本文类"
      }
    }
  ]
}