{
  "source_id": "太上正一解五音咒诅秘箓",
  "source_file": "chunked_daozang\\太上正一解五音咒诅秘箓.json",
  "total_chunks": 3,
  "total_original_chars": 1770,
  "total_translated_chars": 12177,
  "total_translation_time": 59.56659388542175,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上正一解五音咒诅秘箓.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers**\n\n**Title:** *The Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers*\n*Author unknown, originating in the Ming dynasty. Based on the text from the Zhengtong Daoist Canon, Orthodox Unity Section, First Subsection.*\n\n---\n\n**The Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers**\n\nA devout Daoist disciple of [such-and-such] village and origin, [so-and-so], humbly declares: Born on the [such-and-such] year, month, day, and hour, under the celestial governance of the [such-and-such] Star Lord of the Northern Dipper, I today respectfully present ritual offerings and prostrate myself to reverently approach the gate of the Heavenly Master of Dragon-Tiger Mountain, successor of the Han, to receive the *Supreme Register for Resolving the Five-Tone Curses* of the first rank. This register dissolves curses, dispels malevolent influences, averts calamities, transcends misfortune, prolongs life, and ensures longevity. I vow to receive and uphold it with devotion, ensuring its efficacy and adherence. Should I violate its precepts, I shall suffer harm as decreed by the Mysterious Code and divine ordinances.\n\n- **Eastern Region:** The Nine Yi tribes, governed by the Lords of Jia and Yi, command 9,000 troops to reverse and resolve the curses of the three spring months.\n- **Southern Region:** The Eight Man tribes, governed by the Lords of Bing and Ding, command 3,000 troops to reverse and resolve the curses of the three summer months.\n- **Western Region:** The Six Rong tribes, governed by the Lords of Geng and Xin, command 7,000 troops to reverse and resolve the curses of the three autumn months.\n- **Northern Region:** The Five Di tribes, governed by the Lords of Ren and Gui, command 5,000 troops to reverse and resolve the curses of the three winter months.\n- **Central Region:** The Three Qin tribes, governed by the Lords of Wu and Ji, command 12,000 troops to reverse and resolve the curses of the four seasonal months.\n\nShould this disciple be afflicted by evil persons who draw my likeness, stab my heart with blades, or invoke curses at roadside shrines, altars, prisons, mountain forests, streams, wells, or hearths; or if cursed by the River Earl, Water Officials, heretical masters, or any spirits in profane places—wherever curses of a hundred kinds arise to bring harm—I now summon the million-strong hosts of the Supreme Prime soldiers, along with the hundred thousand troops of the Reversing Lords, to descend as one. Together, they shall dissolve all curses, release the bound souls, and forbid their detention. May the spirit and qi be harmonized, disasters dispelled, and misfortune eradicated. *Hasten as the law commands!*\n\n**The above talismans and cinnabar inscriptions are recorded herein.**\n\nThe Orthodox Unity Perfected One states: I observe that in this world, men and women are often afflicted by the malevolent curses of evil persons, who invoke heaven and earth as witnesses, call upon ghosts and spirits, and conjure myriad curses. The hundred oath-bound ghosts seize and bind them, causing distress in movement and rest, restless dreams, strange apparitions, and frequent omens. With no means of resolution, they suffer injury or death—truly a pitiable plight. Thus, I approached the Golden Gates beneath the Supreme Venerable Lord of the Great Clarity in the Heavenly Center, earnestly beseeching the opening of the Purple Yang Palace and the unveiling of the cloud-brocade scripture case. I requested the *Supreme Register for Resolving the Five-Tone Curses*, to transmit it to the virtuous and faithful of the world. Those who receive and wear it shall be freed from such suffering, fulfill their natural lifespan, and forever avoid premature misfortune. You ought to reverently uphold it.\n\nThis disciple today presents ritual offerings and respectfully approaches the gate of the Heavenly Master to receive the *Supreme Secret Register for Resolving the Five-Tone Curses* of the first rank. After receiving it, I swear to abide by its covenant. Should I ever violate it, I willingly accept punishment in the netherworld and dare not blame the Dao or fault my master. *As decreed by the Mysterious Code and divine ordinances!*\n\n---\n\n**The Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers**\n\n**Ritual Petition for Receiving the Register**\n\n**Petition for Receiving the *Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers*:**\n\nOn the [such-and-such] year, under the reign of the [such-and-such] Grand Year-Star, in the [such-and-such] month, on the [such-and-such] day of the [such-and-such] phase, at the [such-and-such] hour, a devout Daoist disciple of [such-and-such] village and origin, [so-and-so], declares: Born on the [such-and-such] year, month, day, and hour, under the celestial governance of the [such-and-such] Star Lord of the Northern Dipper, I today respectfully present ritual offerings and prostrate myself to reverently approach the gate of the Heavenly Master of Dragon-Tiger Mountain, successor of the Han, to receive the *Supreme Secret Register for Resolving the Five-Tone Curses* of the first rank. I vow to honor and uphold it with devotion.\n\nI reflect that natural disasters and pestilence are common in the mortal world, yet when ghosts blame humans, it is not their true desire. The mundane world calls it \"cursing,\" while Daoist texts name it \"enmity and hatred.\" Though the terms differ, the principle may hold truth. Some endure unrelenting curses, passed down through generations, growing more resentful upon admonishment, impervious to reason. Only the Great Dao, moved by compassion, seeks to right these wrongs. Through flying talismans and registers, it blunts sharp conflicts and resolves entanglements, fostering harmony so that wrathful hearts naturally subside. Those who seek mercy, yet fail to recognize their faults, now bow before the master, beseeching guidance. With utmost sincerity, I present this petition.\n\nAt the gate of the Heavenly Master, this disciple presents ritual offerings and humbly declares the desire to receive the *Supreme Secret Register for Resolving the Five-Tone Curses* of the first rank, along with the sacred name of the True Master, to be revered for life. Today, based on this petition, I swear an oath before heaven and earth, pledge to the Three Officials, break the contract, and divide the ring, following the precepts to transmit and bestow the register as follows.\n\n**Register of the First Rank:**\n*The Supreme Secret Register for Resolving the Five-Tone Curses*\n\n**Ritual Outline: *Essential Principles of Cultivating Perfection in the Orthodox Unity Tradition***\n\n**Sacred Names of the Three Ancestral Perfected Masters and the Three Precept Masters:**\n- **Ancestral Master:** The Heavenly-Appointed, Law-Assisting, Primordial-Augmenting Great Dharma Master of Orthodox Unity, the Divine and Wondrous Transformative Perfected Lord of Serene Response and Manifest Protection—Zhang Daoling.\n- **Mystery Master (Lineal Successor):** The Perfected Lord of Marvelous Dao in the Great Clarity’s Transmission—Zhang Heng.\n- **Perfected Master (Systematic Successor):** The Perfected Lord of Illuminating Transformation and Vast Virtue in the Great Clarity—Zhang Lu.\n\n**Sacred Names of the Three Precept-Conferring Masters:**\n- **Scripture Master:** The Perfected Noble of the Southern Bureau, Supreme Minister of the Jade Treasury, and Great Dharma Lord of All Heavens—Heir to the Forty-Second Celestial Master of Han, Zhang Zhengchang.\n- **Register Master:** The Perfected Sovereign of Primordial Execution in the Three Caverns of the Great Clarity, the Numinous Treasure Teaching-Overseeing Perfected and Great Dharma Lord of All Heavens—Heir to the Forty-Third Celestial Master of Han, Zhang Zichu.\n- **Initiation Master:** The Perfected of Mysterious Transformation in the Numinous Treasure Transmission of the Three Caverns’ Sacred Registers, the Divine Magistrate of Execution in the Southern Bureau, and Great Dharma Lord of All Heavens—Heir to the Forty-Fourth Celestial Master of the Lineage, Zhang Yuqing.\n\n**Officiating at the Altar:**\n- **Ritual Master’s Dharma Name:**\n- **Witnessing Master (for the Oath):**\n- **Supervising Initiation Master:**\n\n**Endorsing Master**, the Rightly Responsive Master of the Celestial Master, states:\n\nThe *Purple Yang Treasure Admonitions* and the *Cloud Satchel’s* numinous texts dissolve the entanglements of curses and spells, shatter the hidden harms of malevolent schemes. First transmitted by the sacred brush, they are recorded in the arcane scriptures, bestowed upon the world to dispel all manner of calamities. Thus did the Most High establish the teaching, transmitting it as a worldly learning. Through the ages, Perfected Masters have upheld and proclaimed these treasure instructions, drawing forth those of karmic affinity in an unbroken lineage.\n\nBy ancestral fortune, I have borne the grace of the state, inheriting the title of the Orthodox Unity Master and reviving the ancestral lineage of Tianmu. Yet as the transmission of the Dharma Registers has grown distant over generations, I have selected skilled artisans to carve wood and produce these books, ensuring their enduring transmission.\n\nAs for the precepts to be upheld—compassion, mercy, and the ancient sagely way—none may attain without them. Those who ascend the altar in good faith must purify their profound vision, accumulate merit through virtuous deeds, that their aspirations may be fulfilled and they may transcend the mundane to enter the wondrous.\n\nHow luminous is this covenantal record—can one not be vigilant?\n\n**The Celestial Master’s** disciple, **Guangwei Zi**, declares:\n\nFor over fifteen hundred years, my family has employed the talismans of the Most High to deliver beings across heaven and earth, safeguarding the nation’s destiny. The ancestral instructions are resplendently clear—what need is there for superfluous praise?\n\nWhen my Perfected Ancestor first encountered the sagely dynasty’s unification of the realm, he was honored above all. The common folk of Jiangnan, clad in coarse hemp, were all placed under his guidance. Since I inherited the teaching, the imperial courts of three reigns have bestowed their radiant favor. At the ascension of the dragon-throne, I was granted a resplendent title, my solemnity likened to *Xu Jing*, my reverence compared to *Chong He*. Official ranks were conferred following Tang precedent, and enfeoffed lands were expanded within the Liu domain.\n\nTo perform good deeds, transmit the Dharma Registers, and thereby continue the ancestral legacy; to pray for blessings and ward off the people’s disasters, reverently upholding the sagely instructions—how could I not exert myself with utmost diligence? In transmitting the Registers and bestowing talismans, the transformative power of the teaching is further illuminated. Above, this serves to exalt the Son of Heaven’s illustrious mandate; below, it bestows upon the common people the supreme felicity of the imperial standard. May my sincerity in this hour bring forth boundless fortune.\n\n**Endorsing Master of the Orthodox Unity Primary Altar**, the Perfected of the Three Caverns’ Sacred Registers of Highest Clarity, **so-and-so**, endorses the faithful devotee **so-and-so**, who has received and vows to wear upon his person the *Most High’s Secret Register for Dissolving the Five-Tone Curses and Spells*. Having already recorded the details at this altar, he respectfully petitions the Orthodox Unity Lineage’s Celestial Master Perfected for transmission, reporting to the Ancestral Celestial Master and Perfected Lord of Orthodox Unity in accordance with the ritual statutes. Herewith, a certificate is issued as proof, that he may follow the teaching and uphold it. Should he violate this covenantal oath, he shall incur the judgment of the numinous tribunal.\n\n**The Most High’s Orthodox Unity Secret Register for Dissolving the Five-Tone Curses and Spells.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上正一解五音咒诅秘箓 经名：太上正一解五音咒诅秘箓。 原不题撰人，出於明代。 底本出处《正统道藏》正一部。 太上正一解五音咒诅秘箓 据某乡贯居住奉道信士某词称，本命某年月日时建生，上属北斗某星君注照，即日谨赍法信叩头，恭诣龙虎山嗣汉天师真人门下，拜受太上解五音咒诅箓一阶，解释咒诅，荡禳魇梼，消灾度厄，延寿长年，敬受奉行，克符效信，有违科约，坐见中伤，一如玄科律令。 东方九夷甲乙君领兵九千人，翻解春三月咒诅。 南方八蛮丙丁君领兵三千人，翻解夏三月咒诅。 西方六戎庚辛君领兵七千人，翻解秋三月咒诅。 北方五狄壬癸君领兵五千人，翻解冬三月咒诅。 中央三秦戊己君领兵一万二千人，翻解四季月咒诅。 弟子某或被恶人图画形像，以刀刺心或道上神社坛场牢狱，山林溪涧，井灶之间； 或与河伯水官，俗中邪师，凡有鬼神之处，咒诅百端，致生灾害。 奉请太元兵士百万众，又请翻倒君兵士十万人，一合来下，悉皆解之，放遣魂魄，不得拘留，平和神炁，消荡灾凶，急急如律令。 已上符篆并丹书 正一真人曰：吾观世间男女多为恶人魇祷，指斥天地，呼证鬼神，兴诸咒诅，百盟之鬼，所见拘挚，使人动止轗轲，梦寝不宁，怪异妄生，妖祥屡见，无由解释，以致殒伤，深可哀悯，於是即诣太清天中老君金阙之下，殷勤礼请，乞开紫阳之宫，启云锦之笈，请太上解五音咒诅妙箓，传付世间善信之士，得参佩者，即免斯苦，克终天年，永无夭恶，子宜敬奉焉。 弟子某即日赍持法信，恭诣天师门下，拜受太上解五音咒诅秘录一阶，佩受之后，誓遵盟约，一旦有违，甘当冥考，不敢怨道咎师，一如玄科律令。 太上正一解五音咒诅秘箓 请箓法词 太上正一解五音咒诅秘箓请法词： 维某年某太岁某月，某朔某日某辰，某乡贯居住奉道信士某词称，本命某年月日时建生，上属北斗某星君，即日谨赍法信叩头，恭诣龙虎山嗣汉天师真人门下，拜受太上解五音咒诅秘箓一阶，供养尊礼，伏以天灾物疠，固尘世之常，然鬼责人，非岂本心之欲尔，世谛谓之咒诅，道书乃日冤憎，义虽不同，理或有是，至有终日不解，历世相仍，闻谏愈憎，巧言莫喻，惟吾大道悯念此徒兴慈悲心，举直措枉。 飞符摄箓，挫锐解纷，俾其和气，自然嗔心，不动求哀，末学未省过尤，稽首师尊，愿垂拯教，某任恳祷之至，谨词。 天师门下，据弟子某赍持法信，诣道自陈，求受太上解五音咒诅秘箓一阶，及请真师宝讳，终身敬奉，今来所据投词，即日告盟天地，立誓三官，破券分环，依科，传授给付如后。 录一阶 太上解五音咒诅秘箓",
      "translated_text": "**The Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers**\n\n**Title:** *The Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers*\n*Author unknown, originating in the Ming dynasty. Based on the text from the Zhengtong Daoist Canon, Orthodox Unity Section, First Subsection.*\n\n---\n\n**The Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers**\n\nA devout Daoist disciple of [such-and-such] village and origin, [so-and-so], humbly declares: Born on the [such-and-such] year, month, day, and hour, under the celestial governance of the [such-and-such] Star Lord of the Northern Dipper, I today respectfully present ritual offerings and prostrate myself to reverently approach the gate of the Heavenly Master of Dragon-Tiger Mountain, successor of the Han, to receive the *Supreme Register for Resolving the Five-Tone Curses* of the first rank. This register dissolves curses, dispels malevolent influences, averts calamities, transcends misfortune, prolongs life, and ensures longevity. I vow to receive and uphold it with devotion, ensuring its efficacy and adherence. Should I violate its precepts, I shall suffer harm as decreed by the Mysterious Code and divine ordinances.\n\n- **Eastern Region:** The Nine Yi tribes, governed by the Lords of Jia and Yi, command 9,000 troops to reverse and resolve the curses of the three spring months.\n- **Southern Region:** The Eight Man tribes, governed by the Lords of Bing and Ding, command 3,000 troops to reverse and resolve the curses of the three summer months.\n- **Western Region:** The Six Rong tribes, governed by the Lords of Geng and Xin, command 7,000 troops to reverse and resolve the curses of the three autumn months.\n- **Northern Region:** The Five Di tribes, governed by the Lords of Ren and Gui, command 5,000 troops to reverse and resolve the curses of the three winter months.\n- **Central Region:** The Three Qin tribes, governed by the Lords of Wu and Ji, command 12,000 troops to reverse and resolve the curses of the four seasonal months.\n\nShould this disciple be afflicted by evil persons who draw my likeness, stab my heart with blades, or invoke curses at roadside shrines, altars, prisons, mountain forests, streams, wells, or hearths; or if cursed by the River Earl, Water Officials, heretical masters, or any spirits in profane places—wherever curses of a hundred kinds arise to bring harm—I now summon the million-strong hosts of the Supreme Prime soldiers, along with the hundred thousand troops of the Reversing Lords, to descend as one. Together, they shall dissolve all curses, release the bound souls, and forbid their detention. May the spirit and qi be harmonized, disasters dispelled, and misfortune eradicated. *Hasten as the law commands!*\n\n**The above talismans and cinnabar inscriptions are recorded herein.**\n\nThe Orthodox Unity Perfected One states: I observe that in this world, men and women are often afflicted by the malevolent curses of evil persons, who invoke heaven and earth as witnesses, call upon ghosts and spirits, and conjure myriad curses. The hundred oath-bound ghosts seize and bind them, causing distress in movement and rest, restless dreams, strange apparitions, and frequent omens. With no means of resolution, they suffer injury or death—truly a pitiable plight. Thus, I approached the Golden Gates beneath the Supreme Venerable Lord of the Great Clarity in the Heavenly Center, earnestly beseeching the opening of the Purple Yang Palace and the unveiling of the cloud-brocade scripture case. I requested the *Supreme Register for Resolving the Five-Tone Curses*, to transmit it to the virtuous and faithful of the world. Those who receive and wear it shall be freed from such suffering, fulfill their natural lifespan, and forever avoid premature misfortune. You ought to reverently uphold it.\n\nThis disciple today presents ritual offerings and respectfully approaches the gate of the Heavenly Master to receive the *Supreme Secret Register for Resolving the Five-Tone Curses* of the first rank. After receiving it, I swear to abide by its covenant. Should I ever violate it, I willingly accept punishment in the netherworld and dare not blame the Dao or fault my master. *As decreed by the Mysterious Code and divine ordinances!*\n\n---\n\n**The Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers**\n\n**Ritual Petition for Receiving the Register**\n\n**Petition for Receiving the *Supreme Orthodox Unity Scripture for Resolving the Five-Tone Curses and Secret Registers*:**\n\nOn the [such-and-such] year, under the reign of the [such-and-such] Grand Year-Star, in the [such-and-such] month, on the [such-and-such] day of the [such-and-such] phase, at the [such-and-such] hour, a devout Daoist disciple of [such-and-such] village and origin, [so-and-so], declares: Born on the [such-and-such] year, month, day, and hour, under the celestial governance of the [such-and-such] Star Lord of the Northern Dipper, I today respectfully present ritual offerings and prostrate myself to reverently approach the gate of the Heavenly Master of Dragon-Tiger Mountain, successor of the Han, to receive the *Supreme Secret Register for Resolving the Five-Tone Curses* of the first rank. I vow to honor and uphold it with devotion.\n\nI reflect that natural disasters and pestilence are common in the mortal world, yet when ghosts blame humans, it is not their true desire. The mundane world calls it \"cursing,\" while Daoist texts name it \"enmity and hatred.\" Though the terms differ, the principle may hold truth. Some endure unrelenting curses, passed down through generations, growing more resentful upon admonishment, impervious to reason. Only the Great Dao, moved by compassion, seeks to right these wrongs. Through flying talismans and registers, it blunts sharp conflicts and resolves entanglements, fostering harmony so that wrathful hearts naturally subside. Those who seek mercy, yet fail to recognize their faults, now bow before the master, beseeching guidance. With utmost sincerity, I present this petition.\n\nAt the gate of the Heavenly Master, this disciple presents ritual offerings and humbly declares the desire to receive the *Supreme Secret Register for Resolving the Five-Tone Curses* of the first rank, along with the sacred name of the True Master, to be revered for life. Today, based on this petition, I swear an oath before heaven and earth, pledge to the Three Officials, break the contract, and divide the ring, following the precepts to transmit and bestow the register as follows.\n\n**Register of the First Rank:**\n*The Supreme Secret Register for Resolving the Five-Tone Curses*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1050,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.472002744674683,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一解五音咒诅秘箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "仪式 正一修真旨要 祖玄真三师玉讳 祖师三天扶教辅元大法师正一冲玄神化 静应显佑真君张道陵， 玄师嗣师太清演教妙道真君张衡。 真师系师太清昭化广德真君张鲁， 经籍度三师法讳 经师上清三洞经录南曹真士玉府上卿 都天大法主嗣汉四十二代天师张正常， 籍师上清三洞经箓太极执法真宰灵宝 领教真人都天大法主嗣汉四十三代天师张字初。 度师上清三洞宝录灵宝领教玄化真人 南曹执法仙宰都天大法主嗣教四十四代天师张宇清。 临坛师法名 证　盟　师 监　度　师",
      "translated_text": "**Ritual Outline: *Essential Principles of Cultivating Perfection in the Orthodox Unity Tradition***\n\n**Sacred Names of the Three Ancestral Perfected Masters and the Three Precept Masters:**\n- **Ancestral Master:** The Heavenly-Appointed, Law-Assisting, Primordial-Augmenting Great Dharma Master of Orthodox Unity, the Divine and Wondrous Transformative Perfected Lord of Serene Response and Manifest Protection—Zhang Daoling.\n- **Mystery Master (Lineal Successor):** The Perfected Lord of Marvelous Dao in the Great Clarity’s Transmission—Zhang Heng.\n- **Perfected Master (Systematic Successor):** The Perfected Lord of Illuminating Transformation and Vast Virtue in the Great Clarity—Zhang Lu.\n\n**Sacred Names of the Three Precept-Conferring Masters:**\n- **Scripture Master:** The Perfected Noble of the Southern Bureau, Supreme Minister of the Jade Treasury, and Great Dharma Lord of All Heavens—Heir to the Forty-Second Celestial Master of Han, Zhang Zhengchang.\n- **Register Master:** The Perfected Sovereign of Primordial Execution in the Three Caverns of the Great Clarity, the Numinous Treasure Teaching-Overseeing Perfected and Great Dharma Lord of All Heavens—Heir to the Forty-Third Celestial Master of Han, Zhang Zichu.\n- **Initiation Master:** The Perfected of Mysterious Transformation in the Numinous Treasure Transmission of the Three Caverns’ Sacred Registers, the Divine Magistrate of Execution in the Southern Bureau, and Great Dharma Lord of All Heavens—Heir to the Forty-Fourth Celestial Master of the Lineage, Zhang Yuqing.\n\n**Officiating at the Altar:**\n- **Ritual Master’s Dharma Name:**\n- **Witnessing Master (for the Oath):**\n- **Supervising Initiation Master:**",
      "overlap_context": "y declares the desire to receive the *Supreme Secret Register for Resolving the Five-Tone Curses* of the first rank, along with the sacred name of the True Master, to be revered for life. Today, based on this petition, I swear an oath before heaven and earth, pledge to the Three Officials, break the contract, and divide the ring, following the precepts to transmit and bestow the register as follows.\n\n**Register of the First Rank:**\n*The Supreme Secret Register for Resolving the Five-Tone Curses*",
      "start_char": 1050,
      "end_char": 1304,
      "start_sentence": 25,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.47035002708435,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一解五音咒诅秘箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "保　举　师 天师正应先生曰：紫阳宝诰，云笈灵文，解咒诅之牵缠，破魇谋之阴害，始传圣笔，载在玄文，授付世人，消诸横恶。 故我太上设教，流传世学，由是历代真师，对扬宝训，汲引有绿，绳绳不绝。 我以夙庆，世戴国恩，绍正一之师称，振天目之宗绪。 第法箓传世寝远，乃选良匠锓木成书，以久其传。 若夫禁戒持守，恻隐慈悲，从古至人，若不如是。 登坛善信，各宜涤除玄览，积行累功，庶几有愿皆符，自此超凡入妙。 昭然盟载，可不慎欤。 天师广微子曰：我家以太上符箓，济度人天，保镇国祚，千有五百余岁矣。 祖训孔昭，奚庸赘赞。 惟我先真君，际遇圣朝混一区宇，首见尊崇，江南冠褐，咸隶管领。 予袭教以来，三朝帝阙迭被恩光，恭遇龙飞，特颁焕号，以精严比虚靖，谓只肃似冲和，加官征例於唐朝，胙土进封於留国。 做好事，传法箓，俾绍先猷； 祈福贶，御民灾，钦承圣训。 祈天永命，敢不只勤，度箓传符，益彰开化，上以对扬天子丕显之命，下以敷锡庶民皇极之休，尚克时忱，以介景福。 正一元坛保举师，上清三洞经箓某保举到，奉道信士某，参受太上解五音咒诅秘录，皈身佩奉，本坛除已具录事由，躬请正一嗣教天师真人，申闻祖天师正一真君，依科传度外，爰给词以为证，俾遵教以奉行，倘负盟言，自贻玄宪。 太上正一解五音咒诅秘箓",
      "translated_text": "**Endorsing Master**, the Rightly Responsive Master of the Celestial Master, states:\n\nThe *Purple Yang Treasure Admonitions* and the *Cloud Satchel’s* numinous texts dissolve the entanglements of curses and spells, shatter the hidden harms of malevolent schemes. First transmitted by the sacred brush, they are recorded in the arcane scriptures, bestowed upon the world to dispel all manner of calamities. Thus did the Most High establish the teaching, transmitting it as a worldly learning. Through the ages, Perfected Masters have upheld and proclaimed these treasure instructions, drawing forth those of karmic affinity in an unbroken lineage.\n\nBy ancestral fortune, I have borne the grace of the state, inheriting the title of the Orthodox Unity Master and reviving the ancestral lineage of Tianmu. Yet as the transmission of the Dharma Registers has grown distant over generations, I have selected skilled artisans to carve wood and produce these books, ensuring their enduring transmission.\n\nAs for the precepts to be upheld—compassion, mercy, and the ancient sagely way—none may attain without them. Those who ascend the altar in good faith must purify their profound vision, accumulate merit through virtuous deeds, that their aspirations may be fulfilled and they may transcend the mundane to enter the wondrous.\n\nHow luminous is this covenantal record—can one not be vigilant?\n\n**The Celestial Master’s** disciple, **Guangwei Zi**, declares:\n\nFor over fifteen hundred years, my family has employed the talismans of the Most High to deliver beings across heaven and earth, safeguarding the nation’s destiny. The ancestral instructions are resplendently clear—what need is there for superfluous praise?\n\nWhen my Perfected Ancestor first encountered the sagely dynasty’s unification of the realm, he was honored above all. The common folk of Jiangnan, clad in coarse hemp, were all placed under his guidance. Since I inherited the teaching, the imperial courts of three reigns have bestowed their radiant favor. At the ascension of the dragon-throne, I was granted a resplendent title, my solemnity likened to *Xu Jing*, my reverence compared to *Chong He*. Official ranks were conferred following Tang precedent, and enfeoffed lands were expanded within the Liu domain.\n\nTo perform good deeds, transmit the Dharma Registers, and thereby continue the ancestral legacy; to pray for blessings and ward off the people’s disasters, reverently upholding the sagely instructions—how could I not exert myself with utmost diligence? In transmitting the Registers and bestowing talismans, the transformative power of the teaching is further illuminated. Above, this serves to exalt the Son of Heaven’s illustrious mandate; below, it bestows upon the common people the supreme felicity of the imperial standard. May my sincerity in this hour bring forth boundless fortune.\n\n**Endorsing Master of the Orthodox Unity Primary Altar**, the Perfected of the Three Caverns’ Sacred Registers of Highest Clarity, **so-and-so**, endorses the faithful devotee **so-and-so**, who has received and vows to wear upon his person the *Most High’s Secret Register for Dissolving the Five-Tone Curses and Spells*. Having already recorded the details at this altar, he respectfully petitions the Orthodox Unity Lineage’s Celestial Master Perfected for transmission, reporting to the Ancestral Celestial Master and Perfected Lord of Orthodox Unity in accordance with the ritual statutes. Herewith, a certificate is issued as proof, that he may follow the teaching and uphold it. Should he violate this covenantal oath, he shall incur the judgment of the numinous tribunal.\n\n**The Most High’s Orthodox Unity Secret Register for Dissolving the Five-Tone Curses and Spells.**",
      "overlap_context": "Third Celestial Master of Han, Zhang Zichu.\n- **Initiation Master:** The Perfected of Mysterious Transformation in the Numinous Treasure Transmission of the Three Caverns’ Sacred Registers, the Divine Magistrate of Execution in the Southern Bureau, and Great Dharma Lord of All Heavens—Heir to the Forty-Fourth Celestial Master of the Lineage, Zhang Yuqing.\n\n**Officiating at the Altar:**\n- **Ritual Master’s Dharma Name:**\n- **Witnessing Master (for the Oath):**\n- **Supervising Initiation Master:**",
      "start_char": 1304,
      "end_char": 1838,
      "start_sentence": 42,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.62424111366272,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一解五音咒诅秘箓.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}