{
  "source_id": "太上三五正一盟威箓",
  "source_file": "chunked_daozang\\太上三五正一盟威箓.json",
  "total_chunks": 27,
  "total_original_chars": 20345,
  "total_translated_chars": 122762,
  "total_translation_time": 536.1681878566742,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Three-Five Orthodox Unity Covenant of Might Register**\n\n**Title:** *The Supreme Three-Five Orthodox Unity Covenant of Might Register*. Author unknown, approximately composed during the Northern and Southern Dynasties, affiliated with the early Celestial Master Dao’s ritual ordinances. Annotations within include Song-dynasty place names, likely added by later disciples. Six fascicles.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Unity Section, First Subsection.\n\n---\n\n**Fascicle One of *The Supreme Three-Five Orthodox Unity Covenant of Might Register***\n\n**Chapter One: Register of the Supreme Orthodox Unity Divine Lad and One General**\nThe qi responds to the first solar term of the first month, its day residing in *Xu* (Void). It governs the *Yangping* precinct, with *Lichun* (Beginning of Spring) falling forty-five days after the winter solstice.\n\n**Chapter Two: Register of the Supreme Orthodox Unity Divine Lads and Ten Generals**\nThe radiance responds to the mid-first month, its day residing in *Wei* (Rooftop). It governs the *Lutang* precinct, with *Yushui* (Rain Water) falling sixty days after the winter solstice.\n\n**Chapter Three: Register of the Supreme Orthodox Unity One Hundred Fifty Generals**\nThe radiance responds to the first solar term of the second month, its day residing in *Shi* (House) and *Bi* (Wall). It governs the *Heming* precinct, with *Jingzhe* (Awakening of Insects) falling seventy-five days after the winter solstice.\n\n**Chapter Four: Register of the Supreme Orthodox Unity Three Generals**\nThe radiance responds to the mid-second month, its day residing in *Kui* (Straddler). It governs the *Liyuan* precinct, with *Chunfen* (Spring Equinox) falling ninety days after the winter solstice.\n\n---\n\n**Chapter One: Tallies of the Supreme Orthodox Unity Divine Lad and One General**\nThe *Yangping* precinct’s Left Pacifying Radiance Libationer, affiliated with Metal, resides in *Jiulong* County of *Pengzhou*, associated with *Xu* (Void), and lodges at the *Lichun* (Beginning of Spring) solar term of the first month.\n\nIn the such-and-such year, such-and-such month, such-and-such day of the first lunar day, so-and-so of such-and-such prefecture, commandery, county, village, and hamlet, born on such-and-such month, day, and hour, originally under the governance of the such-and-such Star Lord of the Northern Dipper, declares: Having been summoned by the Five Dark Divine Lad Lords, so-and-so, a flesh-born mortal of this life, has long possessed the capacity for the Dao. Having encountered the Great Way, I respectfully offer ritual gifts and present myself at such-and-such sacred mountain, such-and-such abbey or oratory, to submit under the tutelage of such-and-such Dharma Master. I humbly receive the *Register of the Supreme Orthodox Unity Divine Lad and One General*. After being invested with the true officers of the register, I shall cultivate and practice in strict accordance with the statutes and methods. I hereby respectfully submit this petition.\n\n**One Celestial Capital Direct Envoy Merit Officer,**\n**One Celestial Capital Orthodox Unity Merit Officer.**\n\nOne Celestial Capital Healing Merit Officer,\nOne Celestial Capital Left Palace Envoy,\nOne Celestial Capital Yang Spirit Decisive Clerk,\nTwelve Celestial Capital Wolf Clerks and Twelve Tiger Warriors,\nTwelve Celestial Capital Inspecting Treachery Hook Riders,\nTwelve Celestial Capital Three Officials Directors,\nTwelve Celestial Capital Heavenly Armored Soldiers,\nTwelve Celestial Capital Heavenly Might Warriors,\nTwelve Celestial Capital Black-Seizing Black-Consuming Clerks.\nSeals and talismans within the scroll are all vermilion-inscribed.\nDivine Generals in golden armor with azure sashes.\n\nOne Upper Numinous Palace Direct Envoy Merit Officer,\nOne Upper Numinous Palace Orthodox Unity Merit Officer,\nOne Upper Numinous Palace Healing Merit Officer,\nOne Upper Numinous Palace Left Palace Envoy,\nOne Upper Numinous Palace Yang Spirit Central Clerk,\nTwelve Upper Numinous Palace Wolf Clerks and Twelve Tiger Warriors,\nTwelve Upper Numinous Palace Inspecting Treachery Hook Riders,\nTwelve Upper Numinous Palace Three Officials Directors,\nTwelve Upper Numinous Palace Heavenly Armored Soldiers,\nTwelve Upper Numinous Palace Heavenly Might Warriors,\nTwelve Upper Numinous Palace Qi-Seizing Qi-Consuming Clerks.\nGolden armor with verdant sashes.\n\n*Register of the Supreme Orthodox Unity Divine Lad and Ten Generals*, Second Scroll.\n\nThe Zhenlu Hall Right Pacifying Qi Libationer, associated with Water, located in Mianzhu County of Hanzhou, corresponding to the *Wei* constellation, during the Rain Water solar term of the first lunar month.\n\nThe Dharma Register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, having long been summoned by the Five Qi Divine Lads, respectfully presents incense and offerings at the gate of the Dharma Master, to receive the *Register of the Supreme Orthodox Unity Divine Lad and Ten Generals*, in full accordance with the ritual statutes and ordinances.\n\nOne Upper Immortal Capital Direct Envoy Merit Officer,\nOne Upper Immortal Capital Orthodox Unity Merit Officer,\nOne Upper Immortal Capital Healing Merit Officer,\nOne Upper Immortal Capital Left Palace Envoy,\nOne Upper Immortal Capital Yang Spirit Secondary Clerk,\nTwo Upper Immortal Capital Healing Yang Official Great Concealment Clerks,\nTwo Crimson Heaven Calendar Banner Strong Wind Rider Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Left Rider Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Right Rider Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Left Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Right Generals,\nTwo Hundred Forty Upper Immortal Capital Wolf Clerks and Tiger Warriors,\nTwo Hundred Forty Upper Immortal Capital Inspecting Treachery Hook Riders,\nTwo Hundred Forty Upper Immortal Capital Three Officials Directors,\nTwo Hundred Forty Upper Immortal Capital Heavenly Armored Soldiers,\nTwo Hundred Forty Upper Immortal Capital Heavenly Might Warriors,\nTwo Hundred Forty Upper Immortal Capital Qi-Seizing Qi-Consuming Clerks,\nTwo Hundred Forty Upper Immortal Capital Statute Chariot Crimson Talisman Clerks,\nTwo Upper Immortal Capital Strong Wind Rider Post Station Memorial Presenting Clerks each.\n\nTwo Upper Numinous Palace Direct Envoy Merit Officers,\nTwo Upper Numinous Palace Orthodox Unity Merit Officers,\nTwo Upper Numinous Palace Healing Merit Officers,\nTwo Upper Numinous Palace Left Palace Envoys,\nTwo Upper Numinous Palace Yang Spirit Secondary Clerks,\nTwo Upper Numinous Palace Healing Yang Official Great Concealment Clerks,\nTwo Upper Numinous Palace Central Capital Rider Generals,\nTwo Upper Numinous Palace Central Capital Left Rider Generals,\nTwo Upper Numinous Palace Central Capital Right Rider Generals,\nTwo Upper Numinous Palace Central Capital Generals,\nTwo Upper Numinous Palace Central Capital Left Generals,\nTwo Upper Numinous Palace Central Capital Right Generals,\nTwo Hundred Forty Upper Numinous Palace Wolf Clerks and Tiger Warriors,\nTwo Hundred Forty Upper Numinous Palace Inspecting Treachery Hook Riders,\nTwo Hundred Forty Upper Numinous Palace Three Officials Directors,\nTwo Hundred Forty Upper Numinous Palace Heavenly Armored Soldiers,\nTwo Hundred Forty Upper Numinous Palace Heavenly Might Warriors,\nTwo Hundred Forty Upper Numinous Palace Qi-Seizing Qi-Consuming Clerks,\nTwo Hundred Forty Upper Numinous Palace Statute Chariot Crimson Talisman Clerks,\nTwo Upper Numinous Palace Strong Wind Rider Post Station Memorial Presenting Clerks.\n\n*Register of the Supreme Orthodox Unity Upper Immortals and One Hundred Fifty Generals*, Third Scroll.\n\nThe Zhenheming Hall Left Eternal Void Libationer, associated with Metal, located in Dayi County of Qizhou, corresponding to the *Shi* and *Bi* constellations, during the Awakening of Insects solar term of the second lunar month.\n\nThe Dharma Register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, having upheld the Dao with unwavering diligence since receiving the precepts, and whose progress in the Way renews daily, reports in full sincerity: having been summoned by the Nine Elders of the Primordial Netherworld’s Northern Di Lord, and having been found worthy of appointment for meritorious cultivation, now seeks to receive the *Register of the Supreme Orthodox Unity Upper Immortals and One Hundred Fifty Generals*, with the pledge to provide aid and support, in strict accordance with the ritual statutes and ordinances, without daring to transgress. Humbly requests its bestowal.\n\nFifteen Upper Immortal Capital Direct Envoy Merit Officers,\nFifteen Upper Immortal Capital Orthodox Unity Merit Officers,\n\nFifteen Upper Immortal Capital Healing Merit Officers,\nFifteen Upper Immortal Capital Left Bureau Merit Officers,\nFifteen Middle Upper Immortal Capital Right Bureau Merit Officers,\nFifteen Upper Immortal Capital Yang Spirit Decisive Clerks,\nFifteen Upper Immortal Capital Yang Spirit Healing Merit Officers,\nFifteen Upper Immortal Capital Yin Spirit Decisive Clerks,\nFifteen Upper Immortal Capital Yin Spirit Healing Merit Officers,\nFifteen Upper Immortal Capital Healing Yang Bureau Grand Physician Clerks,\nFifteen Upper Immortal Capital Healing Yin Bureau Grand Physician Clerks,\nFive Crimson Heaven Banner Rigorous Wind Generals,\nFive Crimson Heaven Banner Rigorous Wind Left Generals,\nFive Crimson Heaven Banner Rigorous Wind Right Generals,\nFive Crimson Heaven Banner Rigorous Wind Central Palace Grand Generals,\nFive Crimson Heaven Banner Rigorous Wind Central Palace Left Generals,\nFive Crimson Heaven Banner Rigorous Wind Central Palace Right Generals,\nFive Crimson Heaven Banner Rigorous Wind Grand Courier Generals,\nFive Crimson Heaven Banner Rigorous Wind Capital Courier Generals,\nFive Crimson Heaven Banner Rigorous Wind Left Courier Generals,\nFive Crimson Heaven Banner Rigorous Wind Right Courier Generals,\nFive Crimson Heaven Banner Left Rigorous Wind Official Cavalry Generals,\nFive Crimson Heaven Banner Right Rigorous Wind Official Cavalry Generals,\nFive Crimson Heaven Banner Rigorous Wind Left Cavalry Generals,\nFive Crimson Heaven Banner Rigorous Wind Right Cavalry Generals,\nOne Thousand Two Hundred Upper Immortal Capital Attendant Tiger Warriors,\nOne Thousand Two Hundred Upper Immortal Capital Investigative Hook Cavalry,\nOne Thousand Two Hundred Upper Immortal Capital Three Bureau Directors,\nOne Thousand Two Hundred Upper Immortal Capital Celestial Armored Soldiers,\nOne Thousand Two Hundred Upper Immortal Capital Celestial Ding Warriors,\nSixty Upper Immortal Capital Black-Consuming Black Clerks,\nSixty Upper Immortal Capital Spirit-Consuming Spirit Clerks,\nSixty Upper Immortal Capital Ghost-Consuming Ghost Clerks,\nSixty Upper Immortal Capital Evil-Consuming Evil Clerks,\nSixty Upper Immortal Capital Poison-Consuming Poison Clerks,\nSixty Upper Immortal Capital Ominous-Consuming Ominous Clerks,\nSixty Upper Immortal Capital Essence-Consuming Essence Clerks,\nSixty Upper Immortal Capital Pestilence-Consuming Pestilence Clerks,\nSixty Upper Immortal Capital Chariot Scarlet Talisman Clerks,\nTwo Upper Immortal Capital Rigorous Wind Cavalry Post-Horse Memorial Clerks.\n\nFifteen Upper Spirit Official Direct Envoy Merit Officers,\nFifteen Upper Spirit Official Orthodox Unity Merit Officers,\nFifteen Upper Spirit Official Healing Merit Officers,\nFifteen Upper Spirit Official Left Bureau Envoys,\nFifteen Upper Spirit Official Right Bureau Envoys,\nFifteen Upper Spirit Official Yang Spirit Central Clerks,\nFifteen Upper Spirit Official Yin Spirit Decisive Clerks,\nFifteen Upper Spirit Official Yang Bureau Healing Merit Officers,\nFifteen Upper Spirit Official Yin Bureau Healing Merit Officers,\nFifteen Upper Spirit Official Healing Yang Bureau Grand Physician Clerks,\nFifteen Upper Spirit Official Healing Yin Bureau Grand Physician Clerks,\nFive Upper Spirit Official Courier Cavalry Generals,\nFive Upper Spirit Official Left Courier Cavalry Generals,\nFive Upper Spirit Official Right Courier Cavalry Generals,\nFive Upper Spirit Official Capital Bureau Courier Cavalry Generals,\nFive Upper Spirit Official Left Capital Bureau Courier Cavalry Generals,\nFive Upper Spirit Official Right Capital Bureau Courier Cavalry Generals,\nFive Upper Spirit Official Capital Bureau Generals,\nFive Upper Spirit Official Left Capital Bureau Generals,\nFive Upper Spirit Official Right Capital Bureau Generals,\nFive Upper Spirit Official Capital Supervisor Generals,\nFive Upper Spirit Official Left Capital Supervisor Generals,\nFive Upper Spirit Official Right Capital Supervisor Generals,\nFive Upper Spirit Official Central Cavalry Generals,\nFive Upper Spirit Official Central Cavalry Left Generals,\nFive Upper Spirit Official Central Cavalry Right Generals,\nOne Thousand Two Hundred Upper Spirit Official Wolf Attendant Tiger Warriors,\nOne Thousand Two Hundred Upper Spirit Official Investigative Hook Cavalry,\nOne Thousand Two Hundred Upper Spirit Official Capital Bureau Directors,\nOne Thousand Two Hundred Upper Spirit Official Celestial Armored Soldiers,\nOne Thousand Two Hundred Upper Spirit Official Celestial Ding Warriors,\nSixty Upper Spirit Official Black-Consuming Black Clerks,\nSixty Upper Spirit Official Spirit-Consuming Spirit Clerks,\nSixty Upper Spirit Official Ghost-Consuming Ghost Clerks,\nSixty Upper Spirit Official Evil-Consuming Evil Clerks,\nSixty Upper Spirit Official Poison-Consuming Poison Clerks,\nSixty Upper Spirit Official Chariot Scarlet Talisman Clerks,\nTwo Upper Spirit Official Rigorous Wind Cavalry Post-Horse Memorial Clerks.\n\n**Register of the Supreme Orthodox Unity Three Generals, Chapter Four**\nThe Zhenli Yuan governance, under the Right Eternal Prosperity Libationer, belongs to Earth, located in Jiulong County of Pengzhou, corresponding to the Astral Mansion of Kui, during the mid-second month of spring equinox.\n\nThe Dharma-register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, having cultivated the Dao with diligent devotion and rendered meritorious service in conversion, whose sincerity remains unflagging and whose progress in the Way renews daily, has been summoned by the Three Black Lords of the Supreme Primordial, and on this day receives appointment. In accordance with the ancient rites of the Heavenly Master, [Name] now reverently receives the *Register of the Supreme Lord Lao’s Left, Right, and Central Three Generals*, with ninety million troops and attendants bound to the body by command.\n\nOne Left Upper Immortal Concealing Body Grand General,\nSurname Tang, given name Hong, style Wenming,\nSeventy-two *zhang* in height,\nWearing a crimson brocade cap and unlined robe,\nHolding a golden talisman and bearing a sword,\nLeading three hundred thousand troops,\nDescending from the five-black floating clouds into [Name]’s left kidney,\nGenerating the hundred meridians to strengthen [Name]’s body.\n*Red essence, yellow embrace, black sash, green shoes, vermilion soles.*\n\nOne Right Upper Spirit Concealing Shadow Grand General,\nSurname Ge, given name Yong, style Wendu,\nSeventy-two *zhang* in height,\nWearing a crimson brocade cap and unlined robe,\nHolding a jade halberd and bearing a sword,\nLeading thirty million troops,\nRiding crimson-black floating clouds into [Name]’s right kidney,\nGenerating the hundred meridians to strengthen [Name]’s body.\n*Red essence, red embrace, earthen sash, green belt, vermilion shoes.*\n\nOne Central Upper Perfected Concealing Form Grand General,\nSurname Zhou, given name Wu, style Wengang,\nNinety-two *zhang* in height,\nWearing a crimson brocade cap and unlined robe,\nHolding a vermilion yang tally and bearing a sword,\nLeading thirty million troops,\nRiding triple-five crimson-black floating clouds into [Name]’s body to strengthen [Name]’s form.\n*Red essence, yellow embrace, earthen sash, green shoes, vermilion soles.*\n\n*End of the First Scroll of the Covenant of the Triple-Five Orthodox Unity’s Radiant Talisman*\n\n*The Second Scroll of the Covenant of the Triple-Five Orthodox Unity’s Radiant Register*\n\n**Fifth Chapter: Summoning the Hundred Ghosts of the Upper Numinous**\nQi responds to the third lunar node, its day governed by *Lou*,\nPresiding over the *Geji* administration,\nOne hundred and five days after the winter solstice: Pure Brightness.\n\n**Sixth Chapter: The Primordial Destiny’s Chaotic Crimson Register of the Orthodox Unity**\nFlaming brilliance responds to the third lunar month, its day governed by *Wei*,\nPresiding over the *Gengchu* administration,\nOne hundred and twenty days after the winter solstice: Grain Rain.\n\n**Fifth Chapter: Summoning the Hundred Ghosts of the Upper Numinous Register**\nThe *Geji* administration governs the Left Metropolis, overseen by the *Xi* Libationer,\nAssigned to fire, located in Jiulong County of Pengzhou,\nCorresponding to the *Lou* constellation,\nThe Pure Brightness third lunar node.\n\nThis dharma-register disciple [Name], whose fate is bound to the [specific] Star Lord of the Northern Dipper,\nNow presents incense and offerings to the gate of [Title] Dharma Master,\nSeeking to receive the *Upper Numinous Hundred Ghosts Summoning Register*,\nInternally to cultivate the body, externally to save others,\nTo execute the perverse and eradicate evil,\nTo ascend and deliver the seven ancestors,\nTo summon and command all spirits,\nWho shall arrive at the utterance of the command,\nAnd may not presume to trespass without summons.\nUpon receiving this register, [Name] shall abide by all statutes and covenants,\nAnd may not violate them.\nShould violation occur, [Name] willingly accepts netherworld punishment.\n*Hastily, hastily, in accordance with the statutes and ordinances!*\n\nTwelve Merit Officers of the Upper Numinous Direct Envoys,\nTwelve Left Mysterious Merit Officers of the Upper Numinous,\n\nTwelve Right Mysterious Merit Officers of the Upper Numinous,\nTwelve Left Official Envoys of the Upper Numinous,\nTwelve Right Official Envoys of the Upper Numinous,\nTwelve Healing Merit Officers of the Upper Numinous,\nTwelve Left Axillary Envoys of the Upper Numinous,\nTwelve Right Axillary Envoys of the Upper Numinous,\nTwelve Left Yang-Spirit Secondary Clerks of the Upper Numinous,\nTwelve Right Yang-Spirit Secondary Clerks of the Upper Numinous,\nTwelve Left Yin-Spirit Decisive Clerks of the Upper Numinous,\nTwelve Right Yin-Spirit Custodial Clerks of the Upper Numinous,\nTwelve Left Superior Envoys of the Upper Numinous,\nTwelve Right Superior Envoys of the Upper Numinous,\nTwelve Left Healing Officers of the Upper Numinous,\nTwelve Right Healing Officers of the Upper Numinous,\nTwelve Left Superior Black Officers of the Upper Numinous,\nTwelve Right Superior Black Officers of the Upper Numinous,\nTwelve Left Black-Receiving Clerks of the Upper Numinous,\nTwelve Right Black-Receiving Clerks of the Upper Numinous,\nTwelve Left Chief Envoys of the Upper Numinous,\nTwelve Right Chief Envoys of the Upper Numinous,\nTwelve Left Black-Seizing Envoys of the Upper Numinous,\nTwelve Right Black-Seizing Envoys of the Upper Numinous,\nTwelve Left Body-Supporting Envoys of the Upper Numinous,\nTwelve Right Body-Supporting Envoys of the Upper Numinous,\nTwelve Left Primordial Black-Seizing, Black-Consuming Clerks of the Upper Numinous,\nTwelve Right Primordial Black-Seizing, Black-Consuming Clerks of the Upper Numinous,\nTwelve Left Perverse-Seizing, Perverse-Consuming Clerks of the Upper Numinous,\nTwelve Right Perverse-Seizing, Perverse-Consuming Clerks of the Upper Numinous,\nTwelve Left Ghost-Seizing, Ghost-Consuming Clerks of the Upper Numinous,\nTwelve Right Ghost-Seizing, Ghost-Consuming Clerks of the Upper Numinous,\nTwelve Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Superior Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Superior Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Supreme Primordial Generals of the Upper Numinous,\nTwelve Right Supreme Primordial Generals of the Upper Numinous,\nTwelve Left Primordial Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Primordial Standard-Bearing Generals of the Upper Numinous,\nTwelve Primordial Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Yang-Spirit Generals of the Upper Numinous,\nTwelve Right Yang-Spirit Generals of the Upper Numinous,\nTwelve Left Yin-Spirit Generals of the Upper Numinous,\nTwelve Right Yin-Spirit Generals of the Upper Numinous,\nTwelve Left Superior Chief Cavalry Generals of the Upper Numinous,\nTwelve Right Superior Chief Cavalry Generals of the Upper Numinous,\nTwelve Left Supreme Unity Chief Cavalry Generals of the Upper Numinous,\nTwelve Right Supreme Unity Chief Cavalry Generals of the Upper Numinous,\nTwelve Left Celestial Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Celestial Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Superior Three Heavens, Nine Palaces Generals of the Upper Numinous,\nTwelve Right Superior Three Heavens, Nine Palaces Generals of the Upper Numinous,\nTwelve Left Superior Wind Cavalry Generals of the Upper Numinous,\nTwelve Right Superior Wind Cavalry Generals of the Upper Numinous,\nTwelve Left Mysterious Unity Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Mysterious Unity Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Three Primordials, Mysterious August Generals of the Upper Numinous,\nTwelve Right Three Primordials, Mysterious August Generals of the Upper Numinous,\nTwelve Left Superior Slaying Talisman Generals of the Upper Numinous,\nTwelve Right Superior Slaying Talisman Generals of the Upper Numinous,\nTwelve Three August Ones, Nine Palaces Generals of the Upper Numinous,\nTwelve Left Superior August Ones, Body-Protecting Generals of the Upper Numinous,\nTwelve Right Superior August Ones, Body-Protecting Generals of the Upper Numinous,\nTwelve Vermilion Heaven Valiant Cavalry Envoys of the Upper Numinous,\nTwelve Vermilion Heaven Valiant Black-Seizing Envoys of the Upper Numinous,\nTwelve Purple Palace Salvation Envoys of the Upper Numinous,\nTwelve Pure and Wondrous Salvation Envoys of the Upper Numinous,\nTwelve Mysterious Primordial Salvation Envoys of the Upper Numinous,\nTwelve Celestial Ding Warriors of the Upper Numinous,\nTwelve Celestial Li Armored Soldiers of the Upper Numinous,\nTwelve Celestial Healers, Mysterious Capital Envoys of the Upper Numinous,\nTwelve Nine Palaces, Eight Poles Envoys of the Upper Numinous,\nTwelve Left Celestial Cavalry Clerks of the Upper Numinous,\nTwelve Right Celestial Cavalry Clerks of the Upper Numinous,\nTwelve Left Celestial Superior Envoys of the Upper Numinous,\nTwelve Right Celestial Superior Envoys of the Upper Numinous,\nTwelve Left Superior Mysterious Primordial Envoys of the Upper Numinous,\nTwelve Right Superior Mysterious Primordial Envoys of the Upper Numinous,\nTwelve Left Official Vermilion Wolf Envoys of the Upper Numinous,\nTwelve Right Official Vermilion Wolf Envoys of the Upper Numinous,\nTwelve Left Pure Wind, Guarding Cavalry Envoys of the Upper Numinous,\nTwelve Right Pure Wind, Guarding Cavalry Envoys of the Upper Numinous,\nTwelve Left Mysterious Vermilion Bird Envoys of the Upper Numinous,\nTwelve Right Mysterious Vermilion Bird Envoys of the Upper Numinous,\nTwelve Left Chariot-Regulating, Vermilion Talisman Clerks of the Upper Numinous,\nTwelve Right Chariot-Regulating, Vermilion Talisman Clerks of the Upper Numinous,\nTwelve Left Orthodox Unity Envoys of the Upper Numinous,\nTwelve Right Orthodox Unity Envoys of the Upper Numinous,\nTwelve Left Primordial Dark Warrior Envoys of the Upper Numinous,\nTwelve Right Primordial Dark Warrior Envoys of the Upper Numinous,\nTwelve Left Superior Nine Primordials Envoys of the Upper Numinous,\nTwelve Right Superior Nine Primordials Envoys of the Upper Numinous,\nTwelve Left Three Primordials, Four Beginnings Envoys of the Upper Numinous,\nTwelve Right Three Primordials, Four Beginnings Envoys of the Upper Numinous,\nTwelve Left Superior Rushing Tiger Guards of the Upper Numinous,\nTwelve Right Superior Rushing Tiger Guards of the Upper Numinous,\n\n**The Supreme Orthodox Unity Primordial Mandate of the Chaotic Crimson-Green Register, Sixth Grade**\n\nThe **Right Metropolitan Director of Zhen-Gengyin-Gu, Attendant Libationer Xi**, affiliated with Water, resides in Mianzhu County of Hanzhou, corresponding to the Stomach Mansion and the Grain Rain solar term of the third lunar month.\n\nThe register disciple [Name], born under the governance of the [X] Star Lord of the Northern Dipper, having long been summoned by the Central Di in the ranks, now respectfully presents incense and offerings at the gate of the Dharma Master, seeking to receive the **Supreme Orthodox Unity Primordial Mandate of the Crimson Heaven’s Three-Five Chaotic Crimson Register**. Upon its bestowal, the true officials within the register shall don their solemn vestments and descend into the disciple’s body. After receiving this mandate, [Name] shall abide by all statutes and covenants without transgression. Should any violation occur, [Name] willingly accepts the judgment of the netherworld. *Hasten, hasten, in accordance with the statutes and ordinances!*\n\n**Fifteen Direct Envoys of the Three-Five Primordial Mandate of the Upper Three Heavens,**\n**Fifteen Orthodox Unity Functionaries of the Three-Five Primordial Mandate’s Form and Spirit,**\n**Fifteen Functionaries of the Three-Five Primordial Mandate for Generating Form and Curing Illness,**\n**Fifteen Left Envoys of the Three-Five Primordial Mandate’s Form and Spirit,**\n**Fifteen Right Envoys of the Three-Five Primordial Mandate’s Form and Spirit,**\n**Fifteen Inner Yang Spirit Central Clerks of the Three-Five Primordial Mandate,**\n**Fifteen Inner Yin Spirit Decisive Clerks of the Three-Five Primordial Mandate,**\n**Fifteen Yang Official Functionaries of the Three-Five Primordial Mandate for Curing Illness,**\n**Fifteen Yin Official Functionaries of the Three-Five Primordial Mandate for Curing Illness,**\n**Fifteen Great Physicians of the Three-Five Primordial Mandate’s Solar Yang Officials for Generating Vitality,**\n**Fifteen Great Physicians of the Three-Five Primordial Mandate’s Lunar Yin Officials for Generating Darkness,**\n**Fifteen Functionaries of the Three-Five Primordial Mandate’s Stellar Officials for Attacking and Repelling Enemies,**\n**Fifteen Clerks of Destiny of the Three-Five Primordial Mandate,**\n**Fifteen Recorders of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Peril of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Punishment of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Sincerity of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Acupuncture of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Governance of the Three-Five Primordial Mandate,**\n**Fifteen Inspectors of the Three-Five Primordial Mandate,**\n**Fifteen Central Yellow Ninefold Dao Clerks of Destiny of the Three-Five Primordial Mandate’s Central Wenchang Palace, governing officials.**\n\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Rigidity**, governing the right kidney, establishing life through the Three-Five.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Rigidity**, governing the left kidney, establishing life through the Three-Five.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Rigidity**, governing the right kidney, establishing life through the Three-Five.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the right kidney to generate the liver.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the left kidney to generate the liver.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the right kidney to generate the liver.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the right kidney to generate the hun-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the left kidney to generate the hun-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the right kidney to generate the hun-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chī**, governing the right kidney to generate form.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chī**, governing the left kidney to generate form.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chī**, governing the right kidney to generate form.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Mèi**, governing the right kidney to generate the lungs.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Mèi**, governing the left kidney to generate the lungs.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Mèi**, governing the right kidney to generate the lungs.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Lí**, governing the right kidney to generate the spleen.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Lí**, governing the left kidney to generate the spleen.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Lí**, governing the right kidney to generate the spleen.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Mèi**, governing the heart to generate the pò-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Mèi**, governing the heart to generate the pò-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Mèi**, governing the heart to generate the pò-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper È**, governing the heart to generate humanity.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper È**, governing the heart to generate humanity.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper È**, governing the heart to generate humanity.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Striker**, governing the heart to generate sinews.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Striker**, governing the heart to generate sinews.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Striker**, governing the heart to generate sinews.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Adversary**, governing the heart to generate spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Adversary**, governing the heart to generate spirit.\n\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Adversary**, governing the heart to generate spirit.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Subduer**, governing the liver to pacify the hun-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Subduer**, governing the liver to pacify the hun-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Subduer**, governing the liver to pacify the hun-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Slayer**, governing the liver to purify the hun-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Slayer**, governing the liver to purify the hun-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Slayer**, governing the liver to purify the hun-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Revolving Mechanism Repelling Adversary**, governing the liver to immortalize the hun-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Perilous Mechanism Repelling Adversary**, governing the liver to immortalize the hun-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Righteous Mechanism Repelling Adversary**, governing the liver to immortalize the hun-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Jade Balance Breaking Adversary**, governing the lungs to still the po-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Jade Balance Breaking Adversary**, governing the lungs to still the po-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Jade Balance Breaking Adversary**, governing the lungs to still the po-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Assault**, governing the lungs to immortalize the po-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Assault**, governing the lungs to immortalize the po-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Assault**, governing the lungs to immortalize the po-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Life**, governing the spleen to pacify the spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Life**, governing the spleen to pacify the spirit.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Life**, governing the spleen to pacify the spirit.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Longevity**, governing the spleen to purify the spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Longevity**, governing the spleen to purify the spirit.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Longevity**, governing the spleen to purify the spirit.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Immortality**, governing the spleen to retain the spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Immortality**, governing the spleen to retain the spirit.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Immortality**, governing the spleen to retain the spirit.\n\nTwo million four hundred thousand **Tiger-Rushing Officials of the Upper Immortal Capital’s Central Bureau, Executing Ferocious Wolves**.\nTwo million four hundred thousand **Hook-Riding Valiant Warriors of the Upper Immortal Capital’s Central Bureau, Breaking Adversaries and Investigating Treachery**.\nTwo million four hundred thousand **Chief Archers of the Upper Immortal Capital’s Central Bureau, Severing the Capital Bureau**.\nTwo million four hundred thousand **Chief Archers of the Upper Immortal Capital’s Central Bureau, Severing the Three Bureaus**.\nTwo million four hundred thousand **Black Heaven Ding Valiant Warriors of the Upper Immortal Capital, Seizing**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Dipper to Seize Blackness and Consume Blackness**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Dipper to Seize Spirits and Consume Spirits**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Stars to Seize Ghosts and Consume Ghosts**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Revolving Mechanism to Seize Essences and Consume Essences**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Jade Balance to Seize Deviance and Consume Deviance**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Three-Five Solar Chariot of Red Talismans**.\nOne million two hundred thousand **Ghost-Capturing Envoys of the Upper Immortal Capital’s Central Bureau, Riding the Three-Five Lunar Chariot**.\nNine hundred thousand **Gale-Riding Couriers of the Upper Immortal Capital’s Central Bureau, Submitting Petitions to Remove Death Registers and Determine Life via the Three-Five**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Determining Intent Officials of the Upper Immortal Capital’s Central Bureau**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Determining Will Officials of the Upper Immortal Capital’s Central Bureau**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Determining Wisdom Officials of the Upper Immortal Capital’s Central Bureau**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Determining Courage and Wisdom Officials of the Upper Immortal Capital’s Central Bureau**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Six Yang and Six Yin Body-Forming Officials of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **Water Spirit Valiant Warriors of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **Eight Slayings Vajra Valiant Warriors of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **High Chariot Direct Serving Envoys of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **Red Talisman Chariot Inspecting Envoys of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **Chariot Inspecting and Capturing Envoys of the Upper Immortal Capital’s Central Bureau**.\nTwo million four hundred thousand **Tiger-Rushing Officials of the Upper Immortal Capital’s Central Bureau, Executing Ferocious Wolves**.\nTwo million four hundred thousand **Hook-Riding Warriors of the Upper Immortal Capital’s Central Bureau, Breaking Adversaries and Investigating Treachery**.\nTwo million four hundred thousand **Chief Archers of the Upper Immortal Capital’s Central Bureau, Severing the Three Bureaus**.\nTwo million four hundred thousand **Chief Archers of the Upper Immortal Capital’s Central Bureau, Severing the Capital Bureau**.\nTwo million four hundred thousand **Heavenly Wrinkled-Armor Soldiers of the Upper Immortal Capital’s Central Bureau, Stabbing and Slashing**.\nTwo million four hundred thousand **Black Heaven Ding Valiant Warriors of the Grand Immortal Divine Luminaries’ Central Bureau, Seizing Blackness and Consuming Blackness**.\nTwo million four hundred thousand **Officials of the Grand Immortal Divine Luminaries’ Central Bureau, Riding the Dipper to Seize Blackness and Consume Blackness**.\nTwo million four hundred thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Dipper to Seize Spirits and Consume Spirits**.\nTwo million four hundred thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Vertical Mechanism to Seize Essences and Consume Essences**.\nTwo million four hundred thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Jade Balance to Seize Deviance and Consume Deviance**.\nTwo million two hundred twenty thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Three-Five Solar Chariot of Red Talismans**.\nOne million two hundred thousand **Ghost-Capturing Envoys of the Supreme Divine Luminaries’ Central Bureau, Riding the Lunar Chariot**.\n\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Rigorous Winds to Station Post Horses and Present Memorials, the Three-Five Eliminators of Death Registers and Fixers of Life Records**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Central Yellow Nine Dao Fixers of Resolve**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Central Yellow Nine Dao Fixers of Intent**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Central Yellow Nine Dao Fixers of Wisdom and Discernment**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Central Yellow Nine Dao Fixers of Courage and Intelligence**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Six Yang and Six Yin Completers of the Body**.\n**Seven thousand two hundred** **Vajra Warriors of the Eight Slayers of the Supreme Divine Luminaries’ Central Bureau**.\n**Seven thousand two hundred** **Vajra Warriors of the Eight Spirits of the Supreme Divine Luminaries’ Central Bureau**.\n**Seven thousand two hundred** **High Chariot Envoys of the Supreme Divine Luminaries’ Central Bureau**.\n**Seven thousand two hundred** **Red Talisman Envoys of the Supreme Divine Luminaries’ Central Bureau’s Chariot Bureau**.\n**Seven thousand two hundred** **Striking Warriors of the Supreme Divine Luminaries’ Central Bureau’s Chariot Bureau**.\n\n**Two million four hundred thousand** **High Numinous Officials, Executors of the Fierce Wolf, Tiger-Rushing Vajra Warriors**.\n**Two million four hundred thousand** **High Numinous Officials, Breakers of Enemies and Investigators of Treachery, Hook-Riding Warriors**.\n**Two million four hundred thousand** **High Numinous Officials, Decapitators and Slashers of the Three Bureaus’ Commanders**.\n**Two million four hundred thousand** **High Numinous Officials, Beheaders of the Capital Bureaus’ Commanders**.\n**One million two hundred thousand** **High Numinous Officials, Piercing and Stabbing Celestial Black Steed Armored Soldiers**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Dipper to Seize Blackness and Consume Blackness**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Dipper to Seize Spirits and Consume Spirits**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Stars to Seize Ghosts and Consume Ghosts**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Mobile Mechanism to Seize Essences and Consume Essences**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Solar Chariot Bureau’s Red Talisman Officials**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Lunar Chariot Bureau’s Ghost-Capturing Officials**.\n**Nine hundred thousand** **High Numinous Officials, Riding the Rigorous Winds to Station Post Horses and Present Memorials, the Three-Five Eliminators of Death Registers and Fixers of Life Records**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Nine Dao Fixers of Resolve**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Nine Dao Fixers of Intent**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Nine Dao Fixers of Wisdom and Discernment**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Nine Dao Fixers of Courage and Intelligence**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Six Yang and Six Yin Completers of the Body**.\n**Seven thousand two hundred** **Striking Warriors of the High Numinous Officials’ Chariot Bureau**.\n\n**Seven thousand two hundred** **Celestial Numinous Officials’ Red Talisman Envoys of the Chariot Bureau**.\n**Seventy-two** **Direct Envoys and Merit Recorders of the Celestial Numinous Officials**.\n**Two** **Celestial Numinous Red Officials, Commanders of Spirit-Seizing and Spirit-Subduing**.\n**Two** **Celestial Numinous Red Officials, Prison-Subduing Warrior-Officials**.\n**Two** **Celestial Numinous Red Officials, Deviance-Slaying Envoys**.\n**Two** **Celestial Numinous Red Officials, Deviance-Inspecting Direct Talisman-Bearers**.\n**One hundred twenty** **Celestial Numinous Red Officials, Immortals, Daoists, and Jade Maidens**.\n**Fourteen** **Celestial Numinous Red Officials, Generals of Unfailing Body Protection**.\n**Two** **Celestial Numinous Red Officials, Merit Recorders and Envoys for Healing Illness**.\n**Nine each** **Celestial Numinous Red Officials, Military Clerks and Cavalry-Officers**.\n**Nine each** **Celestial Numinous Red Officials, Generals of Body Protection**.\n\nThe **Divine Talisman Decree of the August Heavenly Dao**, in union with [Name], traverses the Eight Poles. The **Divine Lads and Red Contracts** guard [Name]’s form, with **one thousand two hundred officials** attending the four directions. The **sun, moon, and stars**, the **Three-Five Generals**, descend to the abode. The **Four Dao Great Mound Lords** and **Celestial Numinous Red Officials**, the **Deviance-Slaying and Treachery-Piercing Two**, the **Eight Marquis Lords and Thirty-Six Immortal Lads**, the **Yellow Thearch’s Left and Right Capital Marquis Tomb Gate Assistants**, the **rivers, bridges, mountains, and streams**, the **immortal spirits and altars of the soil and grain**—all heed the appointment this day. Whatever [Name] commands shall without exception submit and protect, escorting [them] to ascend Kunlun and reach the Celestial Pole. Herewith, I offer **one hundred twenty feet of plain silk** and **one bolt each of five-colored trims** as ritual tokens. I hereby accept and comply, binding myself to the luminous covenant. No truncation of the true [teaching] is permitted. Should this be violated, the body shall be forfeit to the **Three Bureaus of Heaven, Earth, and Water**, in accordance with the **Statutes and Ordinances of the Most High Lord Lao**.\n\n**Lads**: Light azure robes, deep green sashes, white belts, vermilion shoes.\n**Heavenly Worthy**: Green cloud cloak, deep green.\n\n**The Second Scroll of the Most High Orthodox Unity’s Covenant of Alliance and Awe Concludes**\n**The Third Scroll of the Most High Orthodox Unity’s Covenant of Alliance and Awe**\n\n**Chapter Seven: The Register for Summoning the Hundred Ghosts of the Orthodox Unity’s Upper Immortals**\n*Qi* responds to the fourth lunar month’s solar term. On this day, in the *Yi* trigram, it governs the central region of Qin. **Establishment of Summer** occurs one hundred thirty-five days after the winter solstice.\n\n**Chapter Eight: The Register of the Nine Provinces’ Community Altars of the Orthodox Unity**\n*Qi* responds to the middle of the fourth lunar month. On this day, in the *Bi* constellation, it governs the realm of Zhen Duo. **Grain Full** occurs one hundred fifty days after the winter solstice.\n\n**Chapter Seven: The Register for Summoning the Hundred Ghosts of the Orthodox Unity’s Upper Immortals**\nThe **Left Administering Divine Officer Xi Jijiu**, governing the central region of Qin, belongs to the element of Water. Located in Deyang County of Hanzhou, it corresponds to the *Xu* constellation. **Establishment of Summer** occurs on the solar term of the fourth lunar month.\n\nThe disciple of the register’s method, [Name], whose fate is governed by the [X] Star Lord of the Northern Dipper, having been summoned by the **Nine Elders of the Primordial Descent from the Northern Center under Di Jun**, now respectfully presents ritual tokens of silk and incense at the gate of the [Title] Master, seeking to receive the **Register for Summoning the Hundred Ghosts of the Orthodox Unity’s Upper Immortal Officials**. Upon acceptance and wearing, all summons shall be answered without delay. No reckless transgressions are permitted. **Hastily, hastily, in accordance with the statutes and ordinances!**\n\n**Divine Officials and Direct Envoys of the Immortal Bureaus:**\n- **Twelve Celestial Clerks of the Orthodox Unity**\n- **Twelve Celestial Clerks of the Orthodox Unity’s Proper Function**\n- **Twelve Celestial Clerks of the Left Mysterious Function**\n- **Twelve Celestial Clerks of the Right Mysterious Function**\n- **Twelve Celestial Clerks for Healing Ailments**\n- **Twelve Left Bureau Envoys**\n- **Twelve Right Bureau Envoys**\n- **Twelve Left Attendant Envoys**\n- **Twelve Right Attendant Envoys**\n- **Twelve Left Yang Spirit Decisive Officers**\n- **Twelve Right Yang Spirit Decisive Officers**\n- **Twelve Left Yin Spirit Storehouse Officers**\n- **Twelve Right Yin Spirit Storehouse Officers**\n- **Twelve Left Celestial Envoys**\n- **Twelve Right Celestial Envoys**\n- **Twelve Left Celestial Physician Officers**\n- **Twelve Right Celestial Physician Officers**\n- **Twelve Left Upper Mysterious Envoys**\n- **Twelve Right Upper Mysterious Envoys**\n- **Twelve Left Black-Receiving Envoys**\n- **Twelve Right Black-Receiving Envoys**\n- **Twelve Left Capital Envoys**\n- **Twelve Right Capital Envoys**\n- **Twelve Left Black-Gathering Envoys**\n- **Twelve Right Black-Gathering Envoys**\n- **Twelve Left Body-Protecting Officers**\n- **Twelve Right Body-Protecting Officers**\n- **Twelve Left Black-Gathering Direct Talisman Officers**\n- **Twelve Right Black-Gathering Direct Talisman Officers**\n- **Twelve Left Evil-Gathering and Evil-Consuming Officers**\n- **Twelve Right Evil-Gathering and Evil-Consuming Officers**\n- **Twelve Banner Generals of the Celestial Calendar**\n- **Twelve Left Banner Generals of the Celestial Calendar**\n- **Twelve Right Banner Generals of the Celestial Calendar**\n- **Twelve Celestial Banner Generals of the Celestial Calendar**\n- **Twelve Left Celestial Banner Generals of the Celestial Calendar**\n- **Twelve Right Celestial Banner Generals of the Celestial Calendar**\n- **Twelve Left Added-Primordial Banner Generals of the Celestial Calendar**\n- **Twelve Right Added-Primordial Banner Generals of the Celestial Calendar**\n- **Twelve Left Celestial Cavalry Generals**\n- **Twelve Right Celestial Cavalry Generals**\n- **Twelve Left Generals of the Most High’s Capital Cavalry**\n- **Twelve Right Generals of the Most High’s Capital Cavalry**\n- **Twelve Left Upper Primordial Generals of the Mysterious**\n- **Twelve Right Upper Primordial Generals of the Mysterious**\n- **Twelve Generals of the Great One’s Capital**\n- **Twelve Left Celestial Physician Generals**\n- **Twelve Right Celestial Physician Generals**\n- **Twelve Left Generals of the Three Heavens’ Nine Palaces**\n- **Twelve Right Generals of the Three Heavens’ Nine Palaces**\n- **Twelve Left Generals of the Upper Sovereign’s Guard Cavalry**\n- **Twelve Right Generals of the Upper Sovereign’s Guard Cavalry**\n- **Twelve Left Generals of the Rigorous Wind Cavalry**\n- **Twelve Right Generals of the Rigorous Wind Cavalry**\n- **Twelve Left Mysterious Banner Generals of the Celestial Calendar**\n- **Twelve Right Mysterious Banner Generals of the Celestial Calendar**\n- **Twelve Left Upper Executioner Generals**\n- **Twelve Right Upper Executioner Generals**\n- **Twelve Left Yang Spirit Generals**\n- **Twelve Right Yang Spirit Generals**\n- **Twelve Left Yin Spirit Generals**\n- **Twelve Right Yin Spirit Generals**\n- **Twelve Envoys of the Crimson Heaven’s Net**\n- **Twelve Black-Gathering Envoys of the Crimson Heaven’s Net**\n- **Twelve Envoys of the Purple Palace’s Salvation**\n- **Twelve Envoys of the Pure and Wondrous Salvation**\n- **Twelve Envoys of the Mysterious Origin’s Salvation**\n- **Twelve Envoys of the Celestial Ding Warriors**\n- **Twelve Celestial Armored Soldiers**\n- **Twelve Envoys of the Celestial Physician’s Mysterious Capital**\n- **Twelve Envoys of the Nine Palaces and Eight Poles**\n- **Twelve Left Celestial Cavalry Envoys**\n- **Twelve Right Celestial Cavalry Envoys**\n- **Twelve Envoys of the Nine Palaces’ Mysterious Upper Realm**\n- **Twelve Left Envoys of the Upper Primordial of the Mysterious**\n- **Twelve Right Envoys of the Upper Primordial of the Mysterious**\n- **Twelve Left Envoys of the Crimson Wolves**\n- **Twelve Right Envoys of the Crimson Wolves**\n- **Twelve Left Envoys of the Pure Wind**\n- **Twelve Right Envoys of the Pure Wind**\n\n**Twelve Left Envoys of the Vermilion Phoenix**\n**Twelve Right Envoys of the Vermilion Phoenix**\n**Twelve Envoys of the Scarlet Talisman Chariot**\n**Twelve Clerks of the Scarlet Talisman Chariot**\n**Twelve Envoys of the Orthodox Unity**\n**Twelve Left Envoys of the Celestial Dark Warrior**\n**Twelve Right Envoys of the Celestial Dark Warrior**\n**Twelve Left Envoys of the Upper Nine Heavens**\n**Twelve Right Envoys of the Upper Nine Heavens**\n**Twelve Left Envoys of the Three Origins and Four Beginnings**\n**Twelve Right Envoys of the Three Origins and Four Beginnings**\n**Twelve Left Rushing Tiger Valiant Clerks**\n**Twelve Right Rushing Tiger Valiant Clerks**\n\nGreen caps and yellow robes, draped in green clouds and clad in verdant green;\nGreen caps and red robes, draped in deep green and clad in dark green, with vermilion shoes.\n\n**The Orthodox Unity’s Register of the Nine Provinces’ Earth Altars, Rank the Eighth**\nZhen Zhen Duo Zhi, Right Director, Divine Sacrificial Wine Officer Xi, associated with water, stationed in Jintang County of Hanzhou, corresponding to the *Bi* constellation, during the fourth month of the solar term *Lesser Fullness*.\n\nThe disciple of the Dharma Register, so-and-so, whose fate is governed by the Star Lord of the Northern Dipper’s such-and-such star, now respectfully offers Dharma tokens and presents himself at the gate of such-and-such Dharma Master to receive the *Orthodox Unity’s Register of the Nine Provinces’ Earth Altars*. Dispatched to inspect the famous mountains, rivers, marshes, and lakes of the Nine Provinces; the Five Peaks and Four Floods; the Five Lakes and Four Seas; the thirty-six states; and the twelve thousand townships and villages—traversing the upper, middle, and lower primal extremities, encompassing east, west, south, and north—summon all malevolent ghosts and black legions of the myriad demons to appear without delay or evasion. Heal the myriad people, and in accordance with the Dharma, subdue and register the twelve hundred ghosts. May the ten thousand spirits ever attend at his left and right, prolonging life and augmenting years, eliminating misfortune and transcending calamity.\n\nUpon receiving and wearing this register, so-and-so shall abide by all regulations and covenants. Should he violate them, he willingly accepts the punishments of the netherworld and dares not harbor resentment. Through diligent cultivation and sincerity, he shall be appointed this very day. The vanguard clerks and soldiers, previously summoned by the Divine Lord of the Luminous Dao of the Central Realm, now present themselves to receive their commissions. Respectfully submitted.\n\n**The Supreme Sovereign’s Talismans for All Lords**\nInscribed in vermilion on peachwood slips, one foot and six inches in length, the center of the slip sealed with the talisman of the Heavenly Emperor’s Envoy. The talisman board is entrusted to the jade clerks and soldiers, bound with hempen cords and sealed with silk, to be deployed as needed for summons and inquiries. Do not disclose this true and precious talisman. Do not summon without cause. Those who carry this register and talisman shall be recognized by all ghosts, who will cross their hands, raise their staffs, and bow their heads beneath the Supreme Clarity to receive it. Ghosts who disobey shall be beheaded and executed. Hasten! As the statutes and ordinances command.\n\nWhen first receiving the talisman, the disciple swears before the August Heavenly Lord of the Great Dao, the Penetrating Supreme Sovereign of the Nine Palaces’ Primal Extremity, that divine youths and jade maidens shall attend him, escorting him to ascend and roam the Nine Heavens. In all his comings and goings among men, whatever he summons shall arrive instantly, daring not to violate the statutes and ordinances.\n\nWang Yanling knows this through contemplation, ensuring that people remain free from illness. Entering water, they shall fear no winds or waves; entering battle, they shall not be harmed by armor or weapons. All shall proceed in accordance with the statutes, laws, and ordinances.\n\n**The Eastern Azure Emperor**, surnamed Hao, named Xiao;\n**The Southern Vermilion Emperor**, surnamed Liu, named Ao;\n**The Western White Emperor**, surnamed Yi, named Ao;\n**The Northern Dark Emperor**, surnamed Xia, named Yu;\n**The Earth Spirit of the Capital’s Altar**, surnamed Huang, named Chong;\n**The Earth Spirit of Jizhou’s Altar**, surnamed Feng, named Qian;\n**The Earth Spirit of Youzhou’s Altar**, surnamed Zhang, named Jian;\n**The Earth Spirit of Xuzhou’s Altar**, surnamed Xia, named Yi (also named Fu, also named Qian);\n**The Earth Spirit of Liangzhou’s Altar**, surnamed Fan, named Zha (also named Li);\n**The Earth Spirit of Yongzhou’s Altar**, surnamed Yang, named Qian;\n**The Earth Spirit of Yanzhou’s Altar**, surnamed Fei, named Qian;\n**The Earth Spirit of Yangzhou’s Altar**, surnamed Zou, named Hun;\n**The Earth Spirit of Qingzhou’s Altar**, surnamed Han, named Yu;\n**The Earth Spirit of Yizhou’s Altar**, surnamed Yan, named Li;\n**The Earth Spirit of Youzhou’s Altar**, surnamed Qi, named Ji.\n\n**Wu Zixu**, presiding over temple spirits;\n**The Prison Warden**, whose name commands the removal of all altar spirits who sit idle without summons.\n\n**The Talisman Clerk**, the celestial registrar, surnamed Jia, named Yan, presiding over ghost capture;\n**The Capital Bureau Attendant**, surnamed Chen, named Song, presiding over all marshals;\n**The Celestial Marshal of the Vast Ultimate**, surnamed Ri, named Si, presiding over earth spirits;\n**The Envoys of the Exposed Dao**, surnamed Lü, named Ying, presiding over roads and paths;\n**The Supreme Ultimate Ordinance**, surnamed Zhu, named Luo, presiding over (text missing);\n**The Heavenly Gate General**, surnamed En, named Xun, presiding over armories and treasuries;\n**The Sun Lord**, surnamed Du, named Shen, presiding over the clarity of heaven and turbidity of earth, bearing the Six Jia Talismans;\n**The Moon Lord**, surnamed Gui, named Hua, presiding over the world’s compliance and rebellion;\n**The Lord of a Thousand Harms and Slaughter**, surnamed Wei, named Xuan, presiding over all talisman clerks and the Great Year;\n**The Illustrious Lord**, surnamed Fan, named Tan, presiding over the capture of all monstrous beings in the ghost legions;\n**The Central Capital Prison Warden**, surnamed Han, named Gui, presiding over all unlawful talisman clerks in the world;\n**The Heavenly Altar Lord**, surnamed Wu, named Ku, presiding over all earth altar lords.\n\nTo summon the spirits of the myriad beings, inscribe the talisman in cinnabar on peachwood slips, one foot and six inches in length, and seal it with the Heavenly Emperor’s Envoy talisman. Summon ghosts with the left cord, and the spirits shall arrive instantly. Those who wear the talisman shall be feared by all ghosts. Knowing the names of the great ghosts, none shall dare to cause harm. The names of the earth spirits of all provinces govern their respective counties, townships, and villages within their domains. The earth altar lords must not permit malevolent spirits, ghosts, or demons to consume blood offerings. For the great and small mountain spirits who do not submit, summon them in accordance with the Dharma, and the ghosts shall respond like an echo, arriving instantly. Hasten! Summon and inquire into the origins of matters as required.\n\nThe method for transmitting talismans: adjust the color and dimensions according to the recipient’s birth year. Provide one knife and one pair of rings. The talisman master takes one ring and the accompanying items, while the other is given to the principal to retain as a token of the master’s talisman authority. Those deemed capable may be appointed with the approval of Xu Shen. Do not transmit to unworthy recipients. The principal must examine and deliberate carefully. How could one not be cautious?\n\nHasten! As the statutes and ordinances command.\n\nTo perceive spirits in the ghostly realms: take white quartz, one ghost general named Ghost Supervisor, and poria, three ingredients in equal measure. Grind them finely, and ingest a one-*cun* measure—ghosts shall appear.\n\nAnother method for perceiving spirits: take white quartz, fuling, and anemarrhena, three ingredients in equal measure. Grind them finely, and ingest a one-*daogui* measure—ghosts shall appear at once.\n\nAnother formula: magpie fledglings, red quartz, azurite, and night-glowing powder; or onion seeds, lindera, white quartz, and anemarrhena powder—all enable one to see ghosts, who shall then fear the living.\n\n*Tai Shang San Wu Zheng Yi Meng Wei Lu*, Scroll Three—concluded.\n*Tai Shang San Wu Zheng Yi Meng Wei Lu*, Scroll Four\n\n**Section Nine: The Register of the Celestial Net and Five Dipper Constellations of the Great Orthodox Unity**\nQi responds to the fifth lunar month’s solar term. On its appointed day, the *zhi* star governs, stabilizing prosperity and governance. One hundred sixty-five days after the winter solstice: Grain in Ear.\n\n**Section Ten: The Yellow River Chart Register for Preserving Life**\nQi responds to the midpoint of the fifth lunar month. On its appointed day, the *jing* star governs, stabilizing the upper regions of governance. One hundred eighty days after the winter solstice: Summer Solstice.\n\n**Section Eleven: The Register for Dissolving the Six Harmful Spirits and the Divine Tiger**\nQi responds to the sixth lunar month’s solar term. On its appointed day, the *gui* star governs, stabilizing the *Yongquan* region. Fifteen days after the summer solstice: Minor Heat.\n\n**Section Twelve: The Register of the Nine Phoenixes for Dispelling Impurities**\nQi responds to the midpoint of the sixth lunar month. On its appointed day, the *liu* star governs, stabilizing the *Chougeng* region. Thirty days after the summer solstice: Major Heat.\n\n**Section Nine: The Star Net and Five Dipper Tallies**\nStabilizes the *Lüli* region under the governance of the Left Capital Supervisor and Director of Rites. Corresponds to earth, located in Huai’an Prefecture’s Jintang County. Aligns with purple, the *can* and *er* constellations, and the Grain in Ear solar term of the fifth lunar month.\n\nIn such-and-such a year, month, and day of a given era, in such-and-such a prefecture, commandery, county, township, and village, the Dharma Register disciple [Name], born on such-and-such a month, day, and hour, whose fate is governed by the [specific] Star Lord of the Northern Dipper, having been summoned by the Lords of the Three Primordial Qi, now respectfully presents ritual offerings to the sacred precincts of [Name] Mountain’s abbey. Seeking initiation under the [Name] Dharma Master, he petitions to receive the *Tai Shang Zheng Yi Star Net and Five Dipper Register*. From this day forth, he shall be permitted to receive and uphold the five-hundred-*li* step-net register, in accordance with the Red Register’s statutes and ordinances.\n\nUpper Prime General: surname Tang, given name Lüe, height ninety myriad *zhang*.\nMiddle Prime General: surname Li, given name Chang, height seventy myriad *zhang*.\n\nLower Prime General: surname Xu, given name Zong, height fifty myriad *zhang*.\nUpper Prime Three-Five Punitive Deity Attendant: surname Hua, given name Hong, commanding a host of ten million.\nMiddle Prime Three-Five Punitive Deity Attendant: surname Tian, given name Tongfu, commanding a host of ten million.\nLower Prime Three-Five Punitive Deity Attendant: surname Wen, given name Zhongshu, commanding a host of ten million.\nEastern Dipper Attendants: fifteen.\nSouthern Dipper Attendants: fifteen.\nWestern Dipper Attendants: fifteen.\nNorthern Dipper Attendants: fifteen.\nCentral Dipper Attendants: fifteen.\nJupiter Attendants: fifteen.\nMars Attendants: fifteen.\nMercury Attendants: fifteen.\nSaturn Attendants: fifteen.\nVenus Attendants: fifteen.\nGenerative Qi Attendants: fifteen.\nThree-Five Nine Star Attendants: fifteen.\nPerfected Masters Attendants: fifteen.\nThree-Five Nine Surnames Attendants: fifteen.\nNine Heavens Seven Star Attendants: fifteen.\nNine Qi Middle Prime Attendants: fifteen.\nMetal-Punitive Lads: one thousand two hundred.\nRegister-Opening Lads: one thousand two hundred.\nCelestial and Terrestrial Lads: one thousand two hundred.\nThree-Five Lads: one thousand two hundred.\nLeveling Prime Valiant Guards: one thousand two hundred.\nFive Dipper Petty Officers: one thousand two hundred.\nThe scroll contains talismans and diagrams, all inscribed in vermilion.\n\n*Tai Shang Zheng Yi He Tu Preserving Life Register*, Chapter Ten\nThe Supervisor of the Right Bureau of the Upper Precinct, subordinate to the Minister of Qi and Sacrifices, is of the earth phase, located in Deyang County of Hanzhou, corresponding to the Well Mansion, during the mid-summer fifth month.\n\nThe Dharma Register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, on this day respectfully presents ritual offerings to the abode of [Name] Dharma Master, petitioning to receive the *Tai Shang Zheng Yi He Tu Preserving Life Register*’s Central Palace Eight Seas Three Rivers Essential Instructions, the *He Tu* Secret Seal Register’s Central General of three million two hundred thousand, who encamp to protect [Name]’s bodily form, preserve life and guard destiny, prolong years and extend longevity, dispel calamities and resolve adversities, traverse rivers and seas under the Dragon Kings’ dominion, ensuring wind and waves remain tranquil. Swiftly, swiftly, in accordance with the statutes and ordinances of the Most High Lord Lao.\n\nMysterious Elder Mysterious Remnant Great General: one hundred thousand.\nMysterious Elder Penetrating Heaven Great General: one hundred thousand.\n\nMysterious Elder Circumambient Heaven Great General: one hundred thousand.\nMysterious Elder Establishing Heaven Great General: one hundred thousand.\nMysterious Elder Central Mystery Great General: one hundred thousand.\nMysterious Elder Central Sincerity Great General: one hundred thousand.\nMysterious Elder Central Po Great General: one hundred thousand.\nMysterious Elder Frontal Efficacy Great General: one hundred thousand.\nMysterious Elder Heaven-Covering Great General: one hundred thousand.\nMysterious Elder Five Mulberries Great General: one hundred thousand.\nMysterious Elder Chariot-Central Great General: one hundred thousand.\nMysterious Elder Transcendent Heaven Great General: one hundred thousand.\nMysterious Elder Five Canopies Great General: one hundred thousand.\nMysterious Elder Numinous Heaven Great General: one hundred thousand.\nMost High Ninefold Opening Great General: one hundred thousand.\nMost High Central Malevolence Great General: one hundred thousand.\nMost High Yellow Canopy Great General: one hundred thousand.\nMost High Tiger-Subduing Great General: one hundred thousand.\nMost High Fivefold Punishment Great General: one hundred thousand.\nMost High Cultivating Heaven Great General: one hundred thousand.\nMost High Northern Division Great General: one hundred thousand.\nMost High Central Transcendence Great General: one hundred thousand.\nMost High Grand Encampment Great General: one hundred thousand.\nMost High Nine Qi Great General: one hundred thousand.\nMost High Southern Red Guard Great General: one hundred thousand.\nMost High Northern Black Guard Great General: one hundred thousand.\nMost High Eastern Bluegreen Guard Great General: one hundred thousand.\nMost High Central Yellow Guard Great General: one hundred thousand.\nMost High Western White Guard Great General: one hundred thousand.\nMost High Central Establishment Great General: one hundred thousand.\nMost High Bluegreen Canopy Great General: one hundred thousand.\nMost High Left and Right Two Generals: one hundred thousand.\nAbove, totaling thirty-two divisions of Great Generals and heavenly soldiers, who follow and attend [Name], protecting within the body. Swiftly, swiftly, in accordance with the statutes and ordinances.\n\n*Tai Shang Zheng Yi Resolving the Six Harms Divine Talisman Register*, Chapter Eleven\n**Governor of the Gushing Spring, Ruling the Left Supervisor Spirit Qi Ritual Libationer**, affiliated with Water, located in Deyang County of Hanzhou, corresponding to the Ghost Star, at the Minor Heat solar term of the sixth lunar month.\n\n[Name], a disciple of the Dharma Registers, whose destiny is governed by the [Name] Star Lord of the Northern Dipper, now respectfully presents ritual offerings to the abode of [Name] Dharma Master, petitioning to receive the *Tai Shang Tai Yi Lord’s Limitless Most High Primordial Unity Lord’s Limitless Resolving the Six Harms Secret Register*, born of the Heavenly Thearch, nurtured by August Heaven, borne by August Earth, illumined by the Sun and Moon, assisted by the Northern Dipper, traversing mountains and rivers, protected by the myriad spirits, attended by the hundred gods, supported by yin and yang, escorted by the Wind Earl, sheltered by purple clouds, healed by divine medicines. Coming and going without limit, entering the sea and emerging in heaven, passing through gates into rivers and exiting through earthly portals, the Destiny Controller of the Earthly Door grants me the Heavenly Kitchen. What do I seek to be fed? What do I lack to be provided? One meal is unfathomable, a thousand years linked to destiny. The Sun and Moon align with Heaven, the limitless with Earth. Ascending without end, the celestial mechanism harnesses the stellar pivots. Wherever I ride, whatever I point toward—none dare oppose me, for I receive the teachings and commands of the Most High Heavenly Thearch. Dragons and tigers support me, the Vermilion Bird guides me, the Dark Warrior follows me. On the left, the yang-aligned Bluegreen Dragon; on the right, the yin-aligned White Tiger. My head bears the Seven Stars, aligning with the Celestial Dipper to command destiny and retain my life. The Recorder protects me, illnesses depart from me, thieves and bandits avoid me. All I seek is attained, all I suppress is subdued. Crossing rivers and traversing seas, wind and waves do not rise. Tigers and wolves seeing me break their fangs and teeth. The cinnabar script serves as a talisman—misfortunes and calamities perish. Yu clears the path, Chiyou averts warfare. Heavenly talismans and earthly seals open before and close behind. Longevity is without limit, enduring as Heaven itself. Swiftly, swiftly, in accordance with the Jade Decree.\n\n*Tai Shang Zheng Yi Nine Phoenixes Dispelling Defilement Register*, Chapter Twelve\n**Governor of the Dense Thicket, Ruling the Right Supervisor Spirit Qi Ritual Libationer**, affiliated with Water, located in Xinjin County of Shuzhou, corresponding to the Willow Star, at the Major Heat solar term of the sixth lunar month.\n\n[Name], a disciple of the Dharma Registers, whose destiny is governed by the [Name] Star Lord of the Northern Dipper, now respectfully presents ritual offerings to the abode of [Name] Dharma Master, petitioning to receive and wear the *Tai Shang Zheng Yi Nine Phoenixes Dispelling Defilement Register*. As decreed by the statutes and ordinances.\n\nRespectfully invoking the East, West, South, and North Dispelling Defilement Spirit Lords, who govern the resolution of submerged defilements’ adversities, prolonging years and enhancing destiny, repelling malevolence and eliminating misfortune, securing the po and hun souls, sharpening hearing and vision, averting disasters and transcending adversities, pacifying and attaching the body’s spirits. Swiftly, swiftly, in accordance with the statutes and ordinances.\n\nRespectfully invoking the Five Breaking Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Repelling Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Eradicating Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Scouring Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Removing Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Gathering Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Transporting Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Resolving Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Washing Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Beheading Defilement Lords and their one hundred twenty officials and generals.\n\n*Tai Shang San Wu Zheng Yi Alliance of Might Register, Fourth Section of the Spring Gathering* concludes.\n*Tai Shang San Wu Zheng Yi Alliance of Might Register, Scroll the Fifth*\n\n*The Supreme Orthodox Unity Register of the Complete Seal of All Chapters, Section the Thirteenth*\nQi aligns with the seventh lunar month’s solar term. Its stellar day is *Xing*. It governs the Northern Peace Abode. The Autumn Commencement falls forty-five days after the Summer Solstice.\n\n*The Supreme Orthodox Unity Register of the Florid Canopy for Beheading Demons, Section the Fourteenth*\nQi aligns with the mid-seventh lunar month. Its stellar day is *Zhang*. It governs the Root Bamboo Abode. The Limit of Heat falls sixty days after the Summer Solstice.\n\n*The Supreme Orthodox Unity Register of the Nine Heavens’ Military Talismans, Section the Fifteenth*\nQi aligns with the eighth lunar month’s solar term. Its stellar day is *Yi*. It governs the Meng Qin Abode. The White Dew falls seventy-five days after the Summer Solstice.\n\n*The Supreme Orthodox Unity Register of the Nine Offices’ Warding Calamities, Section the Sixteenth*\nQi aligns with the mid-eighth lunar month. Its stellar day is *Jiao*. It governs the Level Canopy Abode. The Autumnal Equinox falls ninety days after the Summer Solstice.\n\n*The Supreme Orthodox Unity Register of the Complete Seal of All Chapters, Section the Thirteenth*\nThe Northern Peace Abode’s Left Censor of Qi, Libationer, pertains to Metal. Located in Meishan County of Meizhou, it corresponds to the *Xing* constellation. The Autumn Commencement falls on the seventh lunar month’s solar term.\n\nThe disciple of the register, [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, now respectfully presents ritual offerings to the master’s gate to receive the *Supreme Orthodox Unity Register of the Complete Seal of All Chapters*—one thousand two hundred seal-chapters, essential incantations, and the arts of longevity. Along with the twenty-four Jade Maidens, these are to be employed inwardly for self-cultivation and outwardly for saving others, propagating the Daoist teachings, aiding the state and sustaining fate, healing the common folk, and delivering all living beings. After receiving this register, [Name] vows never to violate its precepts. Should there ever be a turning away, false speech, deceit of the master, or slander of the Dao, [Name]’s person shall be punished by the Three Officials of Heaven, Earth, and Water, subjected to the trials of the Wind Blade. The seven generations of ancestors shall be summoned to judgment. *Swiftly, swiftly, as decreed by statute and ordinance!*\n\nTwenty-four Jade Maidens of the Florid Canopy,\nTwenty-four Jade Maidens of the Polishing Mirror,\n\nTwenty-four Jade Maidens of Pure Numinosity,\nTwenty-four Jade Maidens of Healing Illness,\nTwenty-four Jade Maidens of Massage,\nTwenty-four Jade Maidens of Circumambulating the City,\nTwenty-four Jade Maidens of Wielding the Seal,\nTwenty-four Jade Maidens Within the Seal,\nTwenty-four Jade Maidens of Guarding the Seal,\nTwenty-four Jade Maidens of Affixing the Seal,\nTwenty-four Jade Maidens of Ascending the Seal,\nTwenty-four Jade Maidens of Stellar Medicines,\nTwenty-four Jade Maidens of Sensing Medicines,\nTwenty-four Jade Maidens of Dispensing Medicines,\nTwenty-four Jade Maidens of Covering Medicines,\nTwenty-four Jade Maidens of Conveying Medicines,\nTwenty-four Jade Maidens of Grasping Medicines,\nTwenty-four Jade Maidens of Enacting the Seal.\n\nThe above eighteen divisions of seal-wielding Jade Maidens, totaling four hundred thirty-two persons, are transmitted into the body of [Name], together with:\n\nTwelve Celestial Officers of Qi Promotion of the Upper Immortals, the Northern Dipper Lord,\nTwelve Celestial Officers of Healing Illness of the Upper Immortals, the Grand One Lord,\nTwelve Celestial Envoys of Heavenly Perfection of the Upper Immortals, the Heavenly One Lord,\nTwelve Central Division Envoys of the Upper Immortals, the Three Qi Lords,\nTwelve Celestial Officers of Orthodox Unity of the Upper Immortals, the Southern Dipper Lord,\nTwelve Attendant Envoys and Celestial Officers of the Upper Immortals, the Florid Canopy Lord.\n\nThe above six divisions of celestial officers, totaling seventy-two persons, are transmitted into the body of [Name].\n\nOne hundred twenty subordinate officials of the *Jiǎzǐ* Divine General of the Talisman Wooden Tablet,\nOne hundred twenty subordinate officials of the *Jiǎxū* Divine General of the Incantation Mound,\nOne hundred twenty subordinate officials of the *Jiǎshēn* Divine General of Mount Dengxi,\nOne hundred twenty subordinate officials of the *Jiǎwǔ* Divine General of Supporting Heaven,\nOne hundred twenty subordinate officials of the *Jiǎchén* Divine General of Meng Feiqing,\nOne hundred twenty subordinate officials of the *Jiǎyín* Divine General of Xiang Yushi.\n\nThe Jade Maidens of *Jiǎxū*: Feilian,\nThe Jade Maidens of *Jiǎzǐ*: Huayi,\nThe Jade Maidens of *Jiǎwǔ*: Sujing,\nThe Jade Maidens of *Jiǎshēn*: Sushi,\nThe Jade Maidens of *Jiǎyín*: Huijing,\nThe Jade Maidens of *Jiǎchén*: Kaichao Ji.\n\nThe Jade Maidens of *Dīngchǒu*: Zhao Ziyu,\nThe Jade Maidens of *Dīngmǎo*: Sima Qing,\nThe Jade Maidens of *Dīngyǒu*: Zang Wengong,\nThe Jade Maidens of *Dīnghài*: Zhang Wentong,\nThe Jade Maidens of *Dīngsì*: Cui Juqing,\nThe Jade Maidens of *Dīngwèi*: Shi Shuqing.\n\nThe Jade Maidens of *Guǐwèi*: Lü Weiming,\nThe Jade Maidens of *Guǐyǒu*: Sun Zhongfang,\nThe Jade Maidens of *Guǐmǎo*: Su Tajia,\nThe Jade Maidens of *Guǐsì*: Shi Gonglai,\nThe Jade Maidens of *Guǐhài*: Zuo Shisong,\nThe Jade Maidens of *Guǐchǒu*: Jiang Hanqing.\n\nThe above Jade Maidens of the Six *Jiǎ*, Six *Dīng*, and Six *Guǐ* are transmitted into the body of [Name].\n\n*Register of the Orthodox Unity Florid Canopy for Beheading Demons, Fourteenth Scroll*\nEngraved bamboo slip, overseen by the Inspector of Qi, the Libationer—attributed to Water, stationed in Shu Prefecture, Xinjin County, corresponding to the *Zhang* constellation, during the *Chushu* solar term of the seventh month.\n\nThe register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, having been summoned by the Invisible Lord of Life Mandate of the Central August Direct Envoys, with the original intent of stabilizing the hun and po souls, aspiring to immortality, harmonizing heart and rectifying body, where the Five Palaces and Six Repositories reside, where the Dao unifies all, where the primordial qi takes flight as spirit, and where the Three-and-Five Florid Canopy beheads demonic registers—[Name], having not yet received this register, has failed the prior covenant. Now, with meritorious conduct in accordance with the statutes, [Name] offers ritual gifts and presents at the gate of the master, requesting to receive the *Register of the Orthodox Unity Florid Canopy for Beheading Demons*. Within this register, demonic officials and ghosts are examined. Upon receiving and wearing it, [Name] shall not dare to disclose its essential texts, as previously sworn by statute and ordinance.\n\nTwo Direct Envoys and Celestial Officers...\n\nTwo Direct Envoys of Orthodox Unity,\nTwo Envoys for Healing Ailments,\nTwo Envoys for Accelerating Qi,\nTwo Envoys for Beheading Demons,\nTwo Envoys for Seizing Demons,\nTwo Envoys for Registering Demons,\nTwo Envoys for Capturing Demons,\nTwo Officers for Binding Demons,\nTwo Officers for Whipping Demons,\nTwo Officers for the Eastern Red Talisman,\nTwo Officers for the Rigid Phoenix Mount,\nTwo Courier Officers for Memorials,\nTwo Officers of the Left General for Annihilation,\nTwo Officers of the Right General for Annihilation,\nTwo Black-Robed Officers for Seizing Demons,\nTwo Eastern Green Cloud Officers for Seizing Demons,\nTwo Southern Red Cloud Officers for Seizing Demons,\nTwo Western White Cloud Officers for Seizing Demons,\nTwo Northern Black Cloud Officers for Seizing Demons,\nTwo Central Yellow Cloud Officers for Seizing Demons,\nTwo Officers for Executing Demons,\nTwo Officers for Smashing Demons,\nTwo Officers for Interrogating Demons.\n\nFrom the East: 100,000 chariots and cavalry of Jia-Yi Green Origin, clad in green robes, come to garrison at the Gate of Primordial Birth within [Name]’s body.\nFrom the South: 100,000 chariots and cavalry of Bing-Ding Red Mystery, clad in red robes, come to garrison at the Gate of Protective Birth within [Name]’s body.\nFrom the West: 100,000 chariots and cavalry of Geng-Xin White Mystery, clad in white robes, come to garrison at the Gate of Ninefold Birth within [Name]’s body.\nFrom the North: 100,000 chariots and cavalry of Ren-Gui Black Mystery, clad in black robes, come to garrison at the Gate of Nurturing Birth within [Name]’s body.\nFrom the Center: 100,000 chariots and cavalry of the Yellow Origin Controller of Mystery, clad in yellow robes, come to garrison at the Gate of Life Controller within [Name]’s body.\n\n*Register of the Orthodox Unity Nine Heavens’ Military Talismans*, Chapter Fifteen\nZhen Meng of Qin Prefecture, Left Chief of Qi Cultivation and Libationer, affiliated with Metal, stationed in Kuizhou Taideng County, corresponding to the Wing constellation, during the White Dew solar term of the eighth month.\n\nThe register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, now respectfully presents ritual gifts at the gate of the master, requesting to receive and wear the *Register of the Orthodox Unity Nine Heavens’ Military Talismans*, in accordance with the statutes and ordinances.\n\nDuly appointed to manage Daoist documents for the salvation and healing of the people, diligent and unwavering, conduct aligned with the celestial realm, deemed worthy of promotion and endorsement. Respectfully presenting five-colored silks, [Name] seeks to receive the Nine Heavens’ Military Talismans. When I formerly received these talismans at the gate of the master, I swore to transmit them only to the loyal and virtuous. Now, in the presence of the Most High, I endorse [Name] as the Master of the Nine Heavens’ Military Talismans, commanding the 1,200 Official Lords of the Celestial Master and the officials of the Five Directions, to assist the Daoist gate, execute the rebellious, nourish the talismanic shrines, and eradicate false spirits, wayward ghosts, and residual qi. After nine years of meritorious service, [Name]’s name shall be inscribed among the officials of the Yang realm, appointed as the Left Divine Chancellor, titled King of the Nine Heavens and Nine Earths, Sovereign over Myriad Ghosts. When first manifested, heaven blazed and earth radiated, myriad spirits trembled. [Name]’s stature spans seventy-two zhang in height and seventy-two wei in girth, bearing one hundred twenty seals and cords, accompanied by one hundred twenty processional musicians before and behind. Day and night, through the twelve hours, [Name] guards the Heavenly Thearch, awaiting to behead the ghostly multitudes and residual qi of the Five Directions. With this talisman, summoning the myriad spirits and thousand ghosts shall result in their annihilation. Swiftly, swiftly, in accordance with the statutes and ordinances of the August Heaven, the Great Emperor, and the Most High Lord Lao.\n\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right,\n\nNine Green-Collar Generals of the East, leading 810,000 green-clad soldiers, assemble to the left;\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right.\n\nSeven White-Collar Generals of the West, leading 490,000 white-clad soldiers, assemble to the right;\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right.\n\nEight Red-Collar Generals of the South, leading 640,000 red-clad soldiers, assemble to the front;\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right.\n\nFive Black-Collar Generals of the North, leading 250,000 black-clad soldiers, assemble to the rear.\n\nFrom the East, the Azure Origin Generals Jia and Yi, with a thousand chariots and cavalry clad in azure, each wielding the Primordial Azure Qi, assemble at the Gate of Beginning Life.\nFrom the South, the Vermilion Origin Generals Bing and Ding, with a thousand chariots and cavalry clad in red, each wielding the Primordial Crimson Qi, assemble at the Gate of Guarding Life.\nFrom the West, the White Origin Generals Geng and Xin, with a thousand chariots and cavalry clad in white, each wielding the Pristine White Qi, assemble at the Nine Gates of Life.\nFrom the North, the Black Origin Generals Ren and Gui, with a thousand chariots and cavalry clad in black, each wielding the Supreme Dark Qi, assemble at the Gate of Nurturing Life.\nFrom the Center, the Yellow Origin Generals Wu and Ji, with a thousand chariots and cavalry clad in yellow, each wielding the Primordial Yellow Qi, assemble at the Gate of the Controller of Destiny.\n\nThe Lord of the Eastern Yi, eliminating the rebellious and guarding the troops;\nThe Lord of the Southern Yue, Bian Que, guarding the troops;\nThe Lord of the Western Di, commanding the troops of the dead;\nThe Lord of the Northern Qiang, with armored scaled troops;\nThe Lord of the Central Qin, leading the yellow-clad soldiers.\n\nThe Central General of the Twelve Hundred Officers, standing twenty-four zhang in height and twelve wei in girth, crowned with a golden headdress, bearing one hundred twenty seals and cords. The Heavenly Thearch and Primordial Beginning summon the talismans of the Nine Heavens; the newly manifested Lord Lao transmits them to the libationer of the people’s sacrifices, commanding the ghosts and spirits of the Five Directions of the Nine Heavens to submit and obey.\n\nThe Most High deploys 300,000 Tiger-Rushing Soldiers to capture the delusive and rebellious ghosts and perverse qi across the world.\nThe Most High deploys 300,000 Heavenly Soldiers to capture the chaotic and rebellious ghosts and residual qi of the Nine Heavens.\nThe Most High dispatches 400,000 Earthly Soldiers to capture the false claimants of imperial title and unrighteous ghosts upon the earth.\nThe Most High commands 400,000 Soldiers of the Nine Heavens’ Venerable Elder to capture the scattered and wanton ghosts of a hundred evils.\nThe Most High commands 400,000 Camp Soldiers to capture the earthly ghosts that disrupt governance and the unrighteous spirits of the Five Directions.\nThe Most High commands 400,000 Soldiers of the Two Heavenly Pillars to capture the ghosts that consume seasonal offerings and blood sacrifices, bringing calamity.\nThe Most High commands 400,000 Soldiers of the Azure Canopy,\n400,000 Soldiers of the Crimson Canopy,\n400,000 Soldiers of the White Canopy,\n400,000 Soldiers of the Black Canopy,\n400,000 Soldiers of the Yellow Canopy.\n\nThe Azure Qi Generals’ soldiers, layer upon layer, assemble to the left of [Name];\nThe Crimson Qi Generals’ soldiers, layer upon layer, assemble to the right of [Name];\nThe White Qi Generals’ soldiers, layer upon layer, assemble to the front of [Name];\nThe Black Qi Generals’ soldiers, layer upon layer, assemble to the rear of [Name];\nThe Yellow Qi Generals’ soldiers, layer upon layer, assemble at the center of [Name].\nTransmit and confer these upon [Name], each guarding the qi of the Five Directions.\nAs the nine armies listed below repel the evil and rebellious ghosts and unrighteous qi of the Five Directions, swiftly command all to submit and be annihilated. Swiftly, swiftly, in accordance with the statutes and ordinances of the Most High Lord Lao.\n\n400,000 Soldiers of the Left Supreme Heavenly Pillar, capturing the greatly deluded ghosts;\n300,000 Soldiers of the Right Supreme Five Kinds, capturing the newly arrived ghosts;\n300,000 Soldiers of the Left Supreme Central Palace Five Camps, capturing the greatly rebellious ghosts;\n300,000 Soldiers of the Right Supreme Domain Gate, capturing the unprincipled ghosts;\n300,000 Soldiers of the Left Supreme Central Great Army, capturing the spectral and perverse ghosts;\n300,000 Soldiers of the Right Supreme Nine Wildernesses, capturing the thousand righteous ghosts;\n300,000 Soldiers of the Left Supreme Heavenly Command, capturing the northern rebellious ghosts;\nThe Seven Divisions of Officers and Generals of the Right Supreme, capturing the unrighteous spirits of the Three Officials (Heaven, Earth, Water) and the Five Directions that deceive and disturb the governance of the people.\n\n100,000 Soldiers of the Mysterious Elder’s Mysterious Retainer Great General;\n100,000 Soldiers of the Mysterious Elder’s Circumambient Heaven Great General;\n100,000 Soldiers of the Mysterious Elder’s Central Mysterious Great General;\n100,000 Soldiers of the Mysterious Elder’s Five Absences Great General;\n100,000 Soldiers of the Mysterious Elder’s Heaven-Covering Great General;\n100,000 Soldiers of the Mysterious Elder’s Nine Heavens Great General;\n100,000 Soldiers of the Mysterious Elder’s Central Law Great General;\n100,000 Soldiers of the Mysterious Elder’s Establishing Mysterious Great General;\n100,000 Soldiers of the Mysterious Elder’s Returning Heaven Great General;\n100,000 Soldiers of the Mysterious Elder’s Central Domain Great General;\n100,000 Soldiers of the Mysterious Elder’s Subtle Central Great General;\n100,000 Soldiers of the Mysterious Elder’s Central Court Great General.\n\n100,000 Soldiers of the Nine Heavens’ Venerable Elder, capturing those who falsely claim to be female masters and teachers for punishment.\n\n400,000 Soldiers of the Western Regions, capturing newly emerged rebellious ghosts;\n400,000 Soldiers of the Palace Gate, capturing newly beheaded greatly rebellious ghosts;\n400,000 Soldiers of the Southern Ravine, capturing the 120 city-building Heavenly Sovereign ghosts;\n400,000 Soldiers of the Camp Gate, capturing the horn-butting ghosts;\n400,000 Soldiers of the Dispatched Earth, capturing the Heavenly Sovereign ghosts;\n400,000 Soldiers of the Heavenly Supervisor, capturing the self-proclaimed imperial ghosts;\n400,000 Soldiers of the Front Reception, capturing the altar and stove ghosts;\n400,000 Soldiers of the Northern Three Qin, capturing the ghosts of those who died away from home;\n400,000 Soldiers of the Great General of the Transcendent Heaven;\n400,000 Soldiers of the Great General of the Upright Heaven;\n400,000 Soldiers of the Nine Paths Great General.\n\nThe 400,000 Soldiers of the Great General of the Nine Punishments;\nThe 400,000 Soldiers of the Great General of the Nine Hardnesses;\nThe 400,000 Soldiers of the Great General of the Camp Gate;\nThe 400,000 Soldiers of the Great General of the Jade Canopy;\nThe 400,000 Soldiers of the Great General of the Azure Canopy;\nThe 400,000 Soldiers of the Great General of the Vermilion Canopy;\nThe 400,000 Soldiers of the Great General of the White Canopy;\nThe 400,000 Soldiers of the Great General of the Black Canopy;\nThe 400,000 Soldiers of the Great General of the Yellow Canopy;\nThe 400,000 Soldiers of the Great General of the Palace Gate.\n\nThe 23 Departments of Official Generals, who capture petty officials—those who falsely claim authority as divine regulators of governance, generals, or those who recklessly stir up turmoil, harming and killing the common people. When local customs fail to distinguish and apprehend them for interrogation, these 120 Left and Right Supreme Mysterious Elder Three-Five Official Generals within the register’s jurisdiction are employed. The Water Officials are tasked with their regulation and governance.\n\n*Register of the Nine Palaces of the Orthodox Unity for Warding Off Calamities, Scroll Sixteen*\nThe Ritual Master of the Pacifying Canopy Governance and Right Leader of Meritorious Qi Offerings, affiliated with Earth, resides in Xinjin County of Shuzhou, corresponding to the *Zhen* constellation, during the autumn equinox in the eighth month.\n\nI, so-and-so, a disciple of the register’s method, delight in the Dao and take joy in the law, a descendant of the Most High, whose fate is bound to the divine immortals’ jade calendar and the Seven Stars of the Northern Dipper. Today, I respectfully present the ritual offerings and approach the gate of Master so-and-so to receive the *Register of the Nine Palaces of the Orthodox Unity for Warding Off Calamities*. May I, in this lifetime, secure protection from the nine calamities, dissolve myriad evils, and vanish all misfortunes. May I traverse the world, swiftly encounter immortals, prolong my years, and extend my lifespan. May all disasters be subdued and concealed. As this disciple wishes, I humbly receive this in accordance with the Mysterious Regulations and Ordinances.\n\n*Orthodox Unity Alliance Register of the Three-Five, Scroll Five* [End]\n*Orthodox Unity Alliance Register of the Three-Five, Scroll Six*\n\n**Register of the Eight Trigrams for Body Protection, Chapter Seventeen**\n*Qi* responds to the ninth-month solar term. On this day, the Horn and Neck [lunar mansions] govern. The Cloud Terrace Abbey presides. One hundred and five days after the Summer Solstice: Cold Dew.\n\n**Register for Examination and Summoning, Chapter Eighteen**\n*Qi* responds to the mid-ninth month. On this day, the Root [lunar mansion] governs. The Zhenkou Abbey presides. One hundred and twenty days after the Summer Solstice: Frost Descent.\n\n**Crimson Register for Beheading Malevolence, Chapter Nineteen**\n*Qi* responds to the tenth-month solar term. On this day, the Chamber [lunar mansion] governs. The Rear City Abbey presides. One hundred and thirty-five days after the Summer Solstice: Beginning of Winter.\n\n**Divine Register for Repelling Malevolence, Chapter Twenty**\n*Qi* responds to the mid-tenth month. On this day, the Heart and Tail [lunar mansions] govern. The Gongmu Abbey presides. One hundred and fifty days after the Summer Solstice: Light Snow.\n\n**Register of the Four Divisions for Restraining Qi, Chapter Twenty-One**\n*Qi* responds to the eleventh-month solar term. On this day, the Winnowing Basket [lunar mansion] governs. The Pingwang Abbey presides. One hundred and sixty-five days after the Summer Solstice: Heavy Snow.\n\n**Register for Beheading River Malevolence, Chapter Twenty-Two**\n*Qi* responds to the mid-eleventh month. On this day, the Dipper [lunar mansion] governs. The Chief Clerk Abbey presides. One hundred and eighty days after the Summer Solstice: Winter Solstice.\n\n**Register of the Merit Officers, Chapter Twenty-Three**\n*Qi* responds to the twelfth-month solar term. On this day, the Ox [lunar mansion] governs. The Jade Bureau Abbey presides. Fifteen days after the Winter Solstice: Minor Cold.\n\n**Register for Life Preservation and Longevity, Chapter Twenty-Four**\n*Qi* responds to the mid-twelfth month. On this day, the Woman [lunar mansion] governs. The Northern Mang Abbey presides. Thirty days after the Winter Solstice: Major Cold.\n\n---\n\n**The Supreme Orthodox Unity Register of the Eight Trigrams for Body Protection, Chapter Seventeen**\nThe Cloud Terrace Abbey’s Left Supervisor of *Qi* Libation Officers, affiliated with Fire, located in Cangxi County, Yanzhou Prefecture, corresponds to the Horn and Neck lunar mansions. Ninth-month solar term: Cold Dew.\n\nIn the such-and-such year, such-and-such month, such-and-such day, such-and-such hour, disciple so-and-so of the Orthodox Register, from such-and-such prefecture, commandery, county, village, and hamlet, born on such-and-such *jiazi* day, month, and hour, whose fate is bound to the such-and-such Star Lord of the Northern Dipper, now respectfully presents ritual offerings and approaches the gate of Master so-and-so to receive the *Supreme Great Unity Lord, August Heavenly Thearch’s* [missing characters] *Supreme Primordial Lady, Great Unity Primordial Lady, Mysterious Primordial Qi’s* Eight Trigrams Secret Register for Warding Off Calamities, Preserving Life, and Protecting the Body.\n\nThe Heavenly Thearch gives birth to me,\nAugust Heaven nurtures me,\nSun and Moon illuminate me,\nThe Northern Dipper assists me,\nMountains and rivers guide me,\nThe hundred spirits attend me,\nYin and Yang flow through me,\nThe Wind Earl escorts me,\nThe Heavenly Kitchen provisions me,\nPurple clouds canopy me,\nDivine medicines heal me.\n\nI traverse without end:\nEntering the sea, I emerge at Heaven’s Gate;\nEntering the river, I exit at Earth’s Portal.\nThe Director of Destinies elevates me—\nWhat desire remains unfulfilled?\nWhat aim remains unmet?\nOne meal sustains a thousand years,\nMy fate linked to the sun and moon,\nCoeternal with Heaven and Earth,\nAscending the celestial mechanism,\nMounting the *Kui* and riding the *Gang*.\nWhere I point, all perishes.\n\nThis disciple receives the divine talisman of the Supreme Thearch.\nThe receiver dares to bear this charge:\nAugust Heaven covers me,\nDragon and Tiger envoys serve me,\nVermilion Phoenix leads me,\nDark Warrior follows me,\nLeft Yang adheres to the Azure Dragon,\nRight Yin rests upon the White Tiger.\nMy head bears the Seven Stars,\nMy dharma aligns with the Celestial Dipper.\nThe Director of Destinies preserves my years,\nThe Recorder of Deeds guards my life.\nIllness flees me,\nOfficial matters depart me,\nBandits and thieves avoid me,\nThe host of stars brightens my path,\nHeaven’s *qi* benefits me,\nEarth’s *qi* stabilizes me.\n\nCrossing rivers and seas,\nWind and waves do not rise.\nTigers and wolves seeing me\nBreak their fangs and shatter their teeth.\n\nCinnabar script in ninefold transmission\nRepels and dispels calamities.\nWhite silk as talisman\nEradicates misfortune and harm.\nYu clears the path,\nChiyou averts warfare.\nProlonging years to the utmost limit,\nI complete my destiny with Heaven.\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\n---\n\n**The Supreme Orthodox Unity Three-Five Register for Examination and Summoning, Chapter Eighteen**\nThe Zhenkou Abbey’s Right Supervisor of *Qi* Libation Officers, affiliated with Metal, located in Xixian County, Xingyuan Prefecture, corresponds to the Root lunar mansion. Mid-ninth month: Frost Descent.\n\nIn the such-and-such year, such-and-such month, such-and-such day, such-and-such hour, disciple so-and-so of the Orthodox Register, from such-and-such prefecture, commandery, county, village, and hamlet, born on such-and-such *jiazi* day, month, and hour, whose fate is bound to the such-and-such Star Lord of the Northern Dipper, now respectfully presents ritual offerings and approaches the gate of Master so-and-so to receive the *Great Clarity Central Palace’s Three-Five*...\n\n**General’s Register for Examination and Summoning**\n\nThis register commands its officers and soldiers to provide medical treatment for the people, assist the state, and uphold destiny. *Hastily, hastily, in accordance with the statute and ordinance!*\n\nRespectfully summon:\n- The **Great General Who Summons Ghosts of the East**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the South**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the West**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the North**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the Upper Realm**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the Lower Realm**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Hearth**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Seven Ancestors**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Household**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Earth Altar**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Spirits**, with eight *ren* officers and soldiers;\n- The **Great General Who Summons the Azure Emperor**, with six thousand officers and soldiers;\n- The **Great General Who Summons the Vermilion Emperor**, with six thousand officers and soldiers;\n- The **Great General Who Summons the White Emperor**, with six thousand officers and soldiers;\n- The **Great General Who Summons the Black Emperor**, with six thousand officers and soldiers;\n- The **Great General Who Summons the Yellow Emperor**, with six thousand officers and soldiers;\n- The **Great General Left Chief Minister**, with six thousand officers and soldiers;\n- The **Great General Right Chief Minister**, with six thousand officers and soldiers;\n- The **Great General Who Preserves Life**, with twenty thousand officers and soldiers;\n- The **Great General Who Slays Ghosts**, with twenty thousand officers and soldiers;\n- The **Great General Who Beheads Ghosts**, with twenty thousand officers and soldiers;\n- The **Great General Who Attaches to Water**, with four thousand officers and soldiers;\n- The **Great General Who Attaches to the City Walls**, with four thousand officers and soldiers;\n- The **Great General Who Attaches to the Whip**, with four thousand officers and soldiers.\n\n---\n\n**The Supreme Orthodox Unity Register for Beheading Malevolence, Red Register, Chapter Nineteen**\n\nThe Left Metropolitan Supervisor of *Qi* Libation Officers of Zhenhoucheng Abbey, affiliated with Water, located in Shina County, Hanzhou Prefecture, corresponds to the Chamber lunar mansion. Beginning of Winter, tenth month.\n\nDisciple so-and-so of the Orthodox Register, whose fate is bound to the such-and-such Star Lord of the Northern Dipper, on this day enters the Dao, truthfully acknowledging past transgressions. Fortunate to have been born into the human realm, though unworthy of the pure transformation, I have acted with foolish obstinacy, mired in vulgarity and lowliness. From childhood to adulthood, I have long suffered from lingering illnesses, afflicted by wicked and perverse forces, never knowing a day of health. Now, I respectfully present ritual offerings and approach the gate of Master so-and-so to receive the **Supreme Orthodox Unity Heavenly Numinous Red Officials’ Register for Beheading Malevolence**, commanding its generals, officers, and soldiers to guard and protect me, so-and-so, in all my movements—coming and going, dwelling and resting—repelling and expelling all malevolent forces, capturing and destroying spirits and specters: *yuan*, *tuo*, turtles, soft-shelled turtles, foxes, ancient spirits, thousand-year-old demons, hundred-year-old monstrosities, hard and soft, pure and turbid, high mountains and deep seas, cunning and deceptive specters, the residual *qi* of the Six Heavens, the three *hun* and seven *po*, and all spirits that cling to the body’s gods. *As decreed by the Most High Lord Lao’s statutes and ordinances!*\n\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Direct Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Principal Bureau**.\n\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Administrative Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Left Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Right Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Chief Envoys**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yang-Spirit Decisive Clerks**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yin-Spirit Decisive Clerks**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yang Physician-Grand Masters**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yin-Spirit Grand Masters**,\nTwo **Heavenly Numinous Red Officials of the Seizing Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Punishing Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Subduing Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Governing Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Intercepting Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yang-Spirit Generals**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yin-Spirit Generals**,\nTwo **Heavenly Numinous Red Officials of the Body-Protecting Generals**,\nTwo **Heavenly Numinous Red Officials of the Seizing and Capturing Generals**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Body-Guarding Generals**,\nTwo **Heavenly Numinous Red Officials of the Malevolence-Monitoring Clerks**,\nTwo **Heavenly Numinous Red Officials of the Malevolence-Monitoring Direct Talismans**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Envoys**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Orthodox Unity Envoys**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Imperial Clerks**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Deceit-Piercing Clerks**,\nTwo **Heavenly Numinous Red Officials of the Seizing Malevolence Body-Protecting Great Spirits**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Anomaly-Seizing Envoys**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Celestial Physician Bian Que**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Immortals, Daoists, and Jade Maidens** each,\nTwo **Heavenly Numinous Red Officials of the Azure Dragon, Vermilion Bird, White Tiger, and Dark Warrior** each.\n\nThe celestial talismans bear constant decrees, and when your servant arrives,\nThe ghostly spirits of the Northern Dipper all flee in terror.\nPreserve life and extend longevity—\nThe Azure Dragon attends on the left,\nThe White Tiger attends on the right,\nThe Vermilion Bird leads the way,\nThe Dark Warrior follows behind.\nThirty-six immortals support and guard on either side,\nOne hundred twenty spirit talismans of heaven are bestowed for use,\nEarth talismans provide sustenance.\nMoving east, west, south, or north,\nYou walk alongside immortals.\nOne hundred twenty spirit-envoys are dispatched to command,\nTo drive away and seize the hundred ghosts.\nThe Southern Dipper’s life-protecting celestial talisman fortifies the body,\nImmortals harness four dragons to swiftly ascend to the Heavenly Gate.\nThe Most High guards the body—*Hasten, hasten, in accordance with statutes and ordinances!*\n\n**Section Twenty of the Orthodox Unity Great Register for Repelling Malevolence**\n\n*Zhen Gongmu, the Right Metropolitan Qi Master of Sacrificial Rites, affiliated with Water, stationed in Shifang County of Hanzhou, corresponding to the Xinwei and Jihai constellations, during the tenth month of the Lesser Snow solar term.*\n\nSo-and-so, a disciple of the Orthodox Unity Register, whose fate is governed by the Star Lord of the Northern Dipper’s [X] Star, being a mortal of flesh born of the womb, a descendant of the hundred officials, has unfortunately contracted an illness of unknown origin. In the present year, the condition has worsened, and fearing it may be caused by malevolent spirits or ghostly specters, unable to distinguish clearly, I now respectfully follow the rites and present ritual offerings at the gate of such-and-such a Dharma Master, beseeching to receive the *Orthodox Unity Great Register for Repelling Malevolence* to capture and subdue them. From the day of receiving the talisman, I vow to examine myself in accordance with the Dharma, severing all ties with malevolent ghosts, just as the statutes and ordinances of the Most High’s Mystic Capital command.\n\nThe talisman protects my body—\nAll residual *qi* and the Five You ghosts, depart swiftly, depart at once!\nKnow your names—*Hasten, hasten, in accordance with statutes and ordinances!*\n\n**Section Twenty-One of the Orthodox Unity Four Divisions Register for Suppressing Qi**\n\nThe *Zhenping Gangzhi Zuogong Qi* Ritual Master, affiliated with Water, resides in Xinjin County of Shuzhou, corresponding to the *Ji* constellation, during the Great Snow solar term of the eleventh lunar month.\n\nThis Dharma Register disciple, so-and-so, whose fate is governed by the such-and-such Star Lord of the Northern Dipper, delights in the Dao and rejoices in the Dharma, having wandered through renowned mountains, traversed rivers and marshes, and aspired to the immortals. Today, I respectfully present:\n- one great sword,\n- one *shi* and two *dou* of rice,\n- one bundle of firewood,\n- seven feet and five inches of crimson silk,\n- one pair of silver bracelets,\n- forty feet of white silk,\n- one hundred sheets of paper,\n- one inkstick,\n- one writing knife,\n- one *liang* of true pearls,\n\nas tokens of my solemn vow. I come before the gate of such-and-such a Dharma Master to beseech the bestowal of the *Orthodox Unity Supreme Mystery Hu-Xuan Western Mystery Master Hu’s Miscellaneous Incantations and Four Divisions Register for Suppressing Qi*, to repel malevolence, preserve life, support my family, and aid the state upon wearing it—all in accordance with the statutes and ordinances of the Most High.\n\n**Zi:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Chou:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n\n**Yin:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Mao:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Chen:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Si:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Wu:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Wei:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Shen:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**You:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Xu:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Hai:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n\nThus concludes the swallowing of *qi* for the twelve hours.\n\nNext, visualize the *qi* of the five directions:\nFirst, visualize the azure *qi* of the East;\nthen, the vermilion *qi* of the South;\nthen, the white *qi* of the West;\nthen, the black *qi* of the North;\nthen, the yellow *qi* of the Center;\nthen, the twenty-four *qi* above the Grand Year Star.\n\nFirst, visualize and swallow the *qi* above this day;\nthen, visualize and draw in the *qi* above this hour to swallow it.\n\nThus concludes the visualization of the *qi* of the five directions and others.\n\nNext, visualize the *qi* of the five viscera:\nThe azure *qi* returns to the liver, governed by the Azure Dragon;\nthe vermilion *qi* returns to the heart, governed by the Vermilion Phoenix;\nthe white *qi* returns to the lungs, governed by the White Tiger;\nthe black *qi* returns to the kidneys, governed by the Dark Warrior;\nthe yellow *qi* returns to the spleen, governed by the Yellow Elder Lord.\n\nWood’s number is nine,\nFire’s number is eight,\nWater’s number is seven,\nMetal’s number is six,\nEarth’s number is five.\n\nTo suppress naked insects, use the *qi* of Wood;\nto suppress scaled creatures, use the *qi* of Metal;\nto suppress feathered creatures, use the *qi* of Water;\nto suppress furred creatures, use the *qi* of Fire;\nto suppress armored creatures, use the *qi* of Earth.\nThe method of *qi*-suppression follows the same sequence as before.\n\nSo-and-so, devoted to the Dao with utmost sincerity, diligently cultivates prohibitions and precepts, focusing the mind with single-hearted devotion. They humbly request to receive the divine immortal method of *qi*-suppression. The recipient, holding a blade, kneels and bows twice, then performs the stellar method to draw in *qi*, stepping through the twelve hours, beginning with *zi* and executing the Yu step—left foot forward, right foot behind—while reciting the incantations:\n\nThe incantation to command boiling water and fire,\nthe incantation to command road and lodging,\nthe incantation to command self-defense,\nthe incantation to save from the year’s end,\nthe incantation to command serpents,\nthe incantation to save from malevolent ghosts,\nthe incantation to save from the Earth Lord’s poison,\nthe incantation to command seals,\nthe incantation to command the ghost-child in the clouds,\nthe incantation to command swelling,\nthe incantation to command miscellaneous talismans,\nthe incantation to command tumors,\nthe incantation to command madness,\nthe incantation to save the ancestral halls and seating of lay households,\nthe incantation to command the water whip,\nthe incantation to save from insects,\nthe incantation to command illnesses before the master,\nthe incantation to command malignant sores,\nthe incantation to save lay masters,\nthe incantation to command tigers and wolves,\nthe incantation to command food,\nthe incantation to command massage,\nthe incantation to command bamboo tombs of others,\nthe incantation to command dogs,\nthe incantation to command needles,\nthe incantation to save from miscellaneous *qi*,\nthe incantation to command trees,\nthe incantation to command blades,\nthe incantation to command snake, tiger, and sore afflictions,\nthe incantation to command mosquitoes and horseflies.\n\nIn total, thirty documents are conferred, transmitting the *qi*-suppression methods of the Supreme Mystery, Hu Xuan, and Master Hu, along with all required ritual implements.\n\nAs stated in So-and-so’s petition, they are a flesh-born mortal, a descendant of the common folk, fortunate across a thousand generations to be governed by the Lords of the Great Dao, the Venerable Ones, and the *qi* of the Three Masters for self-preservation. Having previously received the esteemed register and office from their master, they have served under their teacher’s guidance but have yet to obtain the oral transmission of the enlightened master. As a humble flesh-born mortal, they now petition the celestial courts, beseeching the cessation of former *qi* and the compassionate bestowal of stellar *qi* to illuminate the Daoist methods. With these, they may propagate the teachings effectively, achieve healing efficacy, uphold the Dao to assist the sovereign, employ the methods to cure illnesses, subdue all ghosts, and ensure the officers and soldiers within their body exert their full power in transmission. Thus, divine merit will be established, ranks and titles advanced, and all prohibitions enforced in accordance with the methods. They further request the twelve *Qi*-Governors and the one hundred twenty officials and generals, as well as the *qi*-suppression generals of the five directions to restrain poisonous insects, tigers, wolves, and the like. Together, these are transmitted into So-and-so’s body, ensuring that all encounters with suppression and restraint bring immediate peace and security. Urgently, as the statutes command.\n\nThe Hu Xuan Lord, surnamed Gao, named Zisong, stands ten *zhang* tall, wears a red crown and robes of five colors, and is seated beneath a flowered canopy on a jade bed, entering to guard So-and-so’s body.\n\nThe Three Mystery Lords, seated on jade beds beneath canopies at the four corners of the Dipper’s canopy, enter to guard So-and-so’s body.\n\nThe officers and soldiers of the azure *qi* of the East,\nthe officers and soldiers of the vermilion *qi* of the South,\nthe officers and soldiers of the white *qi* of the West,\nthe officers and soldiers of the black *qi* of the North,\nthe officers and soldiers of the yellow *qi* of the Center,\nthe Azure *Qi*-Lord of the East,\nthe Vermilion *Qi*-Lord of the South,\nthe White *Qi*-Lord of the West,\nthe Black *Qi*-Lord of the North,\nthe Yellow *Qi*-Lord of the Center.\n\nThe true *Qi*-Lords and officers of the five directions are transmitted into So-and-so’s body. As So-and-so delights in the Dao and its methods, they shall traverse famous mountains and the four seas. The officers of the five directions will drive away evil *qi*, and all poisonous creatures on earth and under heaven shall be subdued and pacified. Urgently, as the statutes command.\n\n**Register of the Supreme Orthodox Unity’s Slaying the River Demons, Section Twenty-Two**\nOverseen by the Registrar of the Right, the Offering *Qi* Libationer, affiliated with Metal, in Pujiang County of Qiong Prefecture, corresponding to the Dipper constellation, during the eleventh month of the winter solstice.\n\nThe register disciple So-and-so, whose fate is governed by the Star Lord of the Northern Dipper, being a flesh-born mortal of common descent, devoted to the Dao with a single heart, may have acted unlawfully and suffered punishment from the netherworld, or fallen ill due to malevolent spirits or spectral afflictions, unable to discern the cause. Today, in accordance with the regulations, they humbly present ritual offerings and approach the gate of the Dharma Master to beseech the bestowal of the *Supreme Orthodox Unity’s Register for Slaying River Demons*. Upon receiving and wearing it, they shall forever use it to aid their body, sever all ties with ghosts and demons, and never dare to communicate with spirits. They shall propagate the orthodox methods to heal the people. Should they violate these precepts, they shall suffer harm without blaming the Dao or resenting their master. As the statutes of the Supreme Venerable Lord command.\n\n**Register of the Supreme Orthodox Unity’s Three-Five Merit Officers, Section Twenty-Three**\nOverseen by the Left Inspector of *Qi* of the Jade Bureau, the Libationer, affiliated with Water, in Chengdu County of Yizhou Prefecture, corresponding to the Ox constellation, during the *xiaoxue* solar term of the twelfth month.\n\nThe register disciple So-and-so, whose fate is governed by the Star Lord of the Northern Dipper, now humbly presents ritual offerings and approaches the gate of the Dharma Master to receive the *Supreme Orthodox Unity’s Register of the Three-Five Merit Officers*. Upon receiving and wearing it, they must assist in healing the people and shall not violate the precepts. Should they transgress, they shall suffer harm without blaming the Dao or resenting their master. Urgently, as the statutes of the Supreme Venerable Lord command.\n\nThe One Thousand Two Hundred Merit Officers of the Orthodox Unity of the Great Clarity’s Jia Bureau,\nThe One Thousand Two Hundred Merit Officers for Healing of the Supreme Clarity’s Jia Bureau...\n\nThe One Thousand Two Hundred Direct Envoys of the Merit Officers of the Supreme Clarity’s Jia Bureau,\nThe One Thousand Two Hundred Five-Fate Merit Officers of the Supreme Clarity’s Jia Bureau.\n\nTwo Hundred Merit Officers of the Three Bureaus of the Upper Immortal Capital,\nTwo Hundred Merit Officers of the Orthodox Bureau of the Upper Immortal Capital,\nTwo Hundred Merit Officers of the Upper Bureau of the Upper Immortal Capital,\nTwo Hundred Merit Officers of the Middle Bureau of the Upper Immortal Capital,\nTwo Hundred Merit Officers of the Lower Bureau of the Upper Immortal Capital.\n\nFifteen Merit Officers of the Three-Five Bureau of the Upper Numinous Office,\nFifteen Merit Officers of the Orthodox Unity Bureau of the Upper Numinous Office,\nFifteen Direct Envoys of the Merit Officers of the Upper Numinous Office,\nFifteen Healing Merit Officers of the Upper Numinous Office,\nFifteen Incense-Assisting Envoys of the Upper Numinous Office.\n\nThe Three-Five Merit Officers, the Direct Talismans of the Five Thearchs,\nThe Orthodox Unity Merit Officers, the Direct Envoys,\nThe Register Bureaus and Talismanic Contracts.\n\nTwelve Clerks of the Three-Five Merit Officers,\nTwelve Clerks of the Five Thearchs’ Merit Officers,\nTwelve Clerks of the Direct Envoys’ Merit Officers,\nTwelve Clerks of the Orthodox Unity Merit Officers,\nTwelve Clerks of the Incense Officials’ Envoys.\n\n**The Twenty-Fourth Register of the Supreme Orthodox Unity’s Longevity and Life-Preserving Registers**\n\nThe *qi*-Offering Libationer of the Right Inspection Bureau of the Northern Mang Mountain Sanctuary, governed by earth, located in Luoyang County of the Eastern Capital, corresponding to the *nü* constellation, during the *dahan* solar term of the twelfth month.\n\nThe register disciple So-and-so, whose fate is governed by the Star Lord of the Northern Dipper, now humbly presents ritual offerings and approaches the gate of the Dharma Master to receive the *Supreme Three-Five Longevity and Life-Preserving Register*. Upon receiving it, they must assist in healing the people and shall not violate the precepts. Should they transgress, they shall suffer harm without blaming the Dao or resenting their master. Urgently, as the statutes of the Supreme Venerable Lord command.\n\nThree Incense-Assisting Envoys of the Heavenly Numinous Office,\nThree Bian Que Healing Envoys of the Heavenly Numinous Office,\nThree Black-Register-Removing Envoys of the Heavenly Numinous Office.\n\nSupervision and Protection,\nRecommendation and Advocacy.\n\nThe *Register of the Supreme Orthodox Unity and Alliance of Might*, Scroll Six of the *Supreme Three-Five Longevity and Life-Preserving Registers*, is hereby conferred in full.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上三五正一盟威箓 经名：太上三五正一盟威箓。 撰人不详，约出於南北朝，系早期天师道法禄。 其注文中出现宋代地名，当系徒人所加。 六卷。 底本出处：《正统道藏》正一部。 太上三五正一盟威箓卷之一 太上正一童子一将军录品第一 炁应正月节，其日在虚，镇阳平治，冬至后四十五日立春。 太上正一童子十将军录品第二 熙应正月中，其日在危，镇鹿堂治，冬至后六十日雨水。 太上正一一百五十将军录品第三 熙应二月节，其日在室壁，镇鹤呜治，冬至后七十五日惊垫。 太上正一三将军录品第四 熙应二月中，其日在奎，镇漓沅治，冬至后九十日春分。 太上正一童子一将军筹品第一 镇阳平治左平熙祭酒，属金，在彭州九陇县，惠虚，宿立春正月节。 维某年某岁月朔日辰，某州郡县乡里某乙，本命某某月日时生，上属北斗某星君，言被五黑神童君召，某乙素以胎生肉人，宿绿有韦，得遇大道，谨资法信，诣某名山某宫观，投某法师门下，拜受太上正一童子一将军录，录中真吏受佩之后，一如科法修行，请给谨状。 上仙都直使功曹一人， 上仙都正一功曹一人，",
      "translated_text": "**The Supreme Three-Five Orthodox Unity Covenant of Might Register**\n\n**Title:** *The Supreme Three-Five Orthodox Unity Covenant of Might Register*. Author unknown, approximately composed during the Northern and Southern Dynasties, affiliated with the early Celestial Master Dao’s ritual ordinances. Annotations within include Song-dynasty place names, likely added by later disciples. Six fascicles.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Unity Section, First Subsection.\n\n---\n\n**Fascicle One of *The Supreme Three-Five Orthodox Unity Covenant of Might Register***\n\n**Chapter One: Register of the Supreme Orthodox Unity Divine Lad and One General**\nThe qi responds to the first solar term of the first month, its day residing in *Xu* (Void). It governs the *Yangping* precinct, with *Lichun* (Beginning of Spring) falling forty-five days after the winter solstice.\n\n**Chapter Two: Register of the Supreme Orthodox Unity Divine Lads and Ten Generals**\nThe radiance responds to the mid-first month, its day residing in *Wei* (Rooftop). It governs the *Lutang* precinct, with *Yushui* (Rain Water) falling sixty days after the winter solstice.\n\n**Chapter Three: Register of the Supreme Orthodox Unity One Hundred Fifty Generals**\nThe radiance responds to the first solar term of the second month, its day residing in *Shi* (House) and *Bi* (Wall). It governs the *Heming* precinct, with *Jingzhe* (Awakening of Insects) falling seventy-five days after the winter solstice.\n\n**Chapter Four: Register of the Supreme Orthodox Unity Three Generals**\nThe radiance responds to the mid-second month, its day residing in *Kui* (Straddler). It governs the *Liyuan* precinct, with *Chunfen* (Spring Equinox) falling ninety days after the winter solstice.\n\n---\n\n**Chapter One: Tallies of the Supreme Orthodox Unity Divine Lad and One General**\nThe *Yangping* precinct’s Left Pacifying Radiance Libationer, affiliated with Metal, resides in *Jiulong* County of *Pengzhou*, associated with *Xu* (Void), and lodges at the *Lichun* (Beginning of Spring) solar term of the first month.\n\nIn the such-and-such year, such-and-such month, such-and-such day of the first lunar day, so-and-so of such-and-such prefecture, commandery, county, village, and hamlet, born on such-and-such month, day, and hour, originally under the governance of the such-and-such Star Lord of the Northern Dipper, declares: Having been summoned by the Five Dark Divine Lad Lords, so-and-so, a flesh-born mortal of this life, has long possessed the capacity for the Dao. Having encountered the Great Way, I respectfully offer ritual gifts and present myself at such-and-such sacred mountain, such-and-such abbey or oratory, to submit under the tutelage of such-and-such Dharma Master. I humbly receive the *Register of the Supreme Orthodox Unity Divine Lad and One General*. After being invested with the true officers of the register, I shall cultivate and practice in strict accordance with the statutes and methods. I hereby respectfully submit this petition.\n\n**One Celestial Capital Direct Envoy Merit Officer,**\n**One Celestial Capital Orthodox Unity Merit Officer.**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 472,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.742803812026978,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "上仙都治病功曹一人， 上仙都左官使者一人， 上仙都阳神决吏一人， 上仙都狼吏虎贲各十二人， 上仙都察奸钩骑各十二人， 上仙都三官仆射各十二人， 上仙都天驯甲卒各十二人， 上仙都天丁力士各十二人， 上仙都收黑食黑吏十二人。 卷内符图并朱书。 神将金甲青带 上灵官直使功曹一人， 上灵官正一功曹一人， 上灵官治病功曹一人， 上灵官左官使者一人， 上灵官阳神央吏一人， 上灵官狼吏虎贲各十二人， 上灵官察奸钩骑十二人， 上灵官三官仆射十二人， 上灵官天绉甲卒十二人， 上灵官天丁力士十二人， 上灵官收熙食炁吏十二人。 金甲绿带 太上正一童子十将军录品第二",
      "translated_text": "One Celestial Capital Healing Merit Officer,\nOne Celestial Capital Left Palace Envoy,\nOne Celestial Capital Yang Spirit Decisive Clerk,\nTwelve Celestial Capital Wolf Clerks and Twelve Tiger Warriors,\nTwelve Celestial Capital Inspecting Treachery Hook Riders,\nTwelve Celestial Capital Three Officials Directors,\nTwelve Celestial Capital Heavenly Armored Soldiers,\nTwelve Celestial Capital Heavenly Might Warriors,\nTwelve Celestial Capital Black-Seizing Black-Consuming Clerks.\nSeals and talismans within the scroll are all vermilion-inscribed.\nDivine Generals in golden armor with azure sashes.\n\nOne Upper Numinous Palace Direct Envoy Merit Officer,\nOne Upper Numinous Palace Orthodox Unity Merit Officer,\nOne Upper Numinous Palace Healing Merit Officer,\nOne Upper Numinous Palace Left Palace Envoy,\nOne Upper Numinous Palace Yang Spirit Central Clerk,\nTwelve Upper Numinous Palace Wolf Clerks and Twelve Tiger Warriors,\nTwelve Upper Numinous Palace Inspecting Treachery Hook Riders,\nTwelve Upper Numinous Palace Three Officials Directors,\nTwelve Upper Numinous Palace Heavenly Armored Soldiers,\nTwelve Upper Numinous Palace Heavenly Might Warriors,\nTwelve Upper Numinous Palace Qi-Seizing Qi-Consuming Clerks.\nGolden armor with verdant sashes.\n\n*Register of the Supreme Orthodox Unity Divine Lad and Ten Generals*, Second Scroll.",
      "overlap_context": "h sacred mountain, such-and-such abbey or oratory, to submit under the tutelage of such-and-such Dharma Master. I humbly receive the *Register of the Supreme Orthodox Unity Divine Lad and One General*. After being invested with the true officers of the register, I shall cultivate and practice in strict accordance with the statutes and methods. I hereby respectfully submit this petition.\n\n**One Celestial Capital Direct Envoy Merit Officer,**\n**One Celestial Capital Orthodox Unity Merit Officer.**",
      "start_char": 472,
      "end_char": 795,
      "start_sentence": 20,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.741833448410034,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "镇鹿堂治右平熙祭酒，属水，在汉州绵竹县，应危宿，雨水正月中。 某法箓弟子某乙命属北斗某星君，夙被五炁神童君召，谨资香信，诣某法师门下，拜受太上正一童子十将军录，一如科约，律令。 上仙都直使功曹一人， 上仙都正一功曹一人， 上仙都治病功曹一人， 上仙都左官使者一人， 上仙都阳神次吏一人， 上仙都治病阳官太翳吏二人， 赤天历旗刚风骑将军二人， 赤天历旗刚风左骑将军二人， 赤天历旗刚风右骑将军二人， 赤天历旗刚风将军二人， 赤天历旗刚风左将军二人， 赤天历旗刚风右将军二人， 上仙都狼吏虎贲二百四十人， 上仙都察奸钩骑二百四十人， 上仙都三官仆射二百四十人， 上仙都天绉甲卒二百四十人， 上仙都天丁力士二百四十人， 上仙都收炁食炁吏二百四十人， 上仙都科车赤符吏二百四十人， 上仙都刚风骑置驿马上章吏各二人。 上灵官直使功曹二人， 上灵官正一功曹二人， 上灵官治病功曹二人， 上灵官左官使者二人， 上灵官阳神次吏二人， 上灵官治病阳官太翳二人， 上灵官中都骑将军二人， 上灵官中都左骑将军二人， 上灵官中都右骑将军二人， 上灵官中都将军二人， 上灵官中都左将军二人， 上灵官中都右将军二人， 上灵官狼吏虎贲二百四十人， 上灵官察奸钩骑二百四十人， 上灵官三官仆射二百四十人， 上灵官天绉甲卒二百四十人， 上灵官天丁力士二百四十人， 上灵官收炁食炁吏二百四十人， 上灵官科车赤符吏二百四十人， 上灵官刚风骑置驿马上章吏二人。 太上正一上仙百五十将军录品第三 镇鹤呜洽左长无祭酒，属金，在祁州大邑县，应室壁二宿，惊垫二月节。 某法录弟子某乙，命属北斗某星君，奉法以来，专勤不替，在道日新，领太上高皇帝王神黑不能自分别，诣臣自实悉言，被元下九老北中狄君召，即日听署修行有功，求受太上正一上仙百五十将军录，要当扶助，一依科约，不敢有违，请给，谨词。 上仙都直使功曹十五人， 上仙都正一功曹十五人，",
      "translated_text": "The Zhenlu Hall Right Pacifying Qi Libationer, associated with Water, located in Mianzhu County of Hanzhou, corresponding to the *Wei* constellation, during the Rain Water solar term of the first lunar month.\n\nThe Dharma Register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, having long been summoned by the Five Qi Divine Lads, respectfully presents incense and offerings at the gate of the Dharma Master, to receive the *Register of the Supreme Orthodox Unity Divine Lad and Ten Generals*, in full accordance with the ritual statutes and ordinances.\n\nOne Upper Immortal Capital Direct Envoy Merit Officer,\nOne Upper Immortal Capital Orthodox Unity Merit Officer,\nOne Upper Immortal Capital Healing Merit Officer,\nOne Upper Immortal Capital Left Palace Envoy,\nOne Upper Immortal Capital Yang Spirit Secondary Clerk,\nTwo Upper Immortal Capital Healing Yang Official Great Concealment Clerks,\nTwo Crimson Heaven Calendar Banner Strong Wind Rider Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Left Rider Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Right Rider Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Left Generals,\nTwo Crimson Heaven Calendar Banner Strong Wind Right Generals,\nTwo Hundred Forty Upper Immortal Capital Wolf Clerks and Tiger Warriors,\nTwo Hundred Forty Upper Immortal Capital Inspecting Treachery Hook Riders,\nTwo Hundred Forty Upper Immortal Capital Three Officials Directors,\nTwo Hundred Forty Upper Immortal Capital Heavenly Armored Soldiers,\nTwo Hundred Forty Upper Immortal Capital Heavenly Might Warriors,\nTwo Hundred Forty Upper Immortal Capital Qi-Seizing Qi-Consuming Clerks,\nTwo Hundred Forty Upper Immortal Capital Statute Chariot Crimson Talisman Clerks,\nTwo Upper Immortal Capital Strong Wind Rider Post Station Memorial Presenting Clerks each.\n\nTwo Upper Numinous Palace Direct Envoy Merit Officers,\nTwo Upper Numinous Palace Orthodox Unity Merit Officers,\nTwo Upper Numinous Palace Healing Merit Officers,\nTwo Upper Numinous Palace Left Palace Envoys,\nTwo Upper Numinous Palace Yang Spirit Secondary Clerks,\nTwo Upper Numinous Palace Healing Yang Official Great Concealment Clerks,\nTwo Upper Numinous Palace Central Capital Rider Generals,\nTwo Upper Numinous Palace Central Capital Left Rider Generals,\nTwo Upper Numinous Palace Central Capital Right Rider Generals,\nTwo Upper Numinous Palace Central Capital Generals,\nTwo Upper Numinous Palace Central Capital Left Generals,\nTwo Upper Numinous Palace Central Capital Right Generals,\nTwo Hundred Forty Upper Numinous Palace Wolf Clerks and Tiger Warriors,\nTwo Hundred Forty Upper Numinous Palace Inspecting Treachery Hook Riders,\nTwo Hundred Forty Upper Numinous Palace Three Officials Directors,\nTwo Hundred Forty Upper Numinous Palace Heavenly Armored Soldiers,\nTwo Hundred Forty Upper Numinous Palace Heavenly Might Warriors,\nTwo Hundred Forty Upper Numinous Palace Qi-Seizing Qi-Consuming Clerks,\nTwo Hundred Forty Upper Numinous Palace Statute Chariot Crimson Talisman Clerks,\nTwo Upper Numinous Palace Strong Wind Rider Post Station Memorial Presenting Clerks.\n\n*Register of the Supreme Orthodox Unity Upper Immortals and One Hundred Fifty Generals*, Third Scroll.\n\nThe Zhenheming Hall Left Eternal Void Libationer, associated with Metal, located in Dayi County of Qizhou, corresponding to the *Shi* and *Bi* constellations, during the Awakening of Insects solar term of the second lunar month.\n\nThe Dharma Register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, having upheld the Dao with unwavering diligence since receiving the precepts, and whose progress in the Way renews daily, reports in full sincerity: having been summoned by the Nine Elders of the Primordial Netherworld’s Northern Di Lord, and having been found worthy of appointment for meritorious cultivation, now seeks to receive the *Register of the Supreme Orthodox Unity Upper Immortals and One Hundred Fifty Generals*, with the pledge to provide aid and support, in strict accordance with the ritual statutes and ordinances, without daring to transgress. Humbly requests its bestowal.\n\nFifteen Upper Immortal Capital Direct Envoy Merit Officers,\nFifteen Upper Immortal Capital Orthodox Unity Merit Officers,",
      "overlap_context": " Spirit Central Clerk,\nTwelve Upper Numinous Palace Wolf Clerks and Twelve Tiger Warriors,\nTwelve Upper Numinous Palace Inspecting Treachery Hook Riders,\nTwelve Upper Numinous Palace Three Officials Directors,\nTwelve Upper Numinous Palace Heavenly Armored Soldiers,\nTwelve Upper Numinous Palace Heavenly Might Warriors,\nTwelve Upper Numinous Palace Qi-Seizing Qi-Consuming Clerks.\nGolden armor with verdant sashes.\n\n*Register of the Supreme Orthodox Unity Divine Lad and Ten Generals*, Second Scroll.",
      "start_char": 795,
      "end_char": 1683,
      "start_sentence": 44,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.831151723861694,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "上仙都治病功曹十五人， 上仙都左官功曹十五人， 中上仙都右官功曹十五人， 上仙都阳神决吏十五人， 上仙都阳神治病功曹十五人， 上仙都阴神决吏十五人， 上仙都阴神治病功曹十五人， 上仙都治病阳官太医吏十五人， 上仙都治病阴官太医吏十五人， 赤天历旗刚风将军五人， 赤天历旗刚风左将军五人， 赤天历旗刚风右将军五人， 赤天历旗刚风中宫大将军五人， 赤天历旗刚风中宫左将军五人， 赤天历旗刚风中宫右将军五人， 赤天历旗刚风大驿将军五人， 赤天历旗刚风都驿将军五人， 赤天历旗刚风左驿将军五人， 赤天历旗刚风右驿将军五人， 赤天历旗左刚风官骑将军五人， 赤天历旗右刚风官骑将军五人， 赤天历旗刚风左骑将军五人， 赤天历旗刚风右骑将军五人， 上仙都郎吏虎贲千二百人， 上仙都察奸钩骑千二百人， 上仙都三官仆射千二百人， 上仙都天骊甲卒千二百人， 上仙都天丁力士千二百人， 上仙都收黑食黑吏六十人， 上仙都收神食神吏六十人， 上仙都收鬼食鬼吏六十人， 上仙都收邪食邪吏六十人， 上仙都收毒食毒吏六十人， 上仙都收凶食凶吏六十人， 上仙都收精食精吏六十人， 上仙都收瘟食瘟吏六十人， 上仙都科车赤符吏六十人， 上仙都刚风骑置驿马上章吏二人。 上灵官直使功曹十五人， 上灵官正一功曹十五人， 上灵官治病功曹十五人， 上灵官左官使者十五人， 上灵官右官使者十五人， 上灵官阳神央吏十五人， 上灵官阴神决吏十五人， 上灵官阳官治病功曹十五人， 上灵官阴官治病功曹十五人， 上灵官治病阳官太医吏十五人， 上灵官治病阴官太医吏十五人， 上灵官驿骑将军五人， 上灵官左驿骑将军五人， 上灵官右驿骑将军五人， 上灵官都官驿骑将军五人， 上灵官左都官驿骑将军五人， 上灵官右都官驿骑将军五人， 上灵官都官将军五人， 上灵官左都官将军五人， 上灵官右都官将军五人， 上灵官都督将军五人， 上灵官左都督将军五人， 上灵官右都督将军五人， 上灵官中骑将军五人， 上灵官中骑左将军五人， 上灵官中骑右将军五人， 上灵官狼吏虎贲千二百人， 上灵官察奸钩骑千二百人， 上灵官都官仆射千二百人， 上灵官天绉甲卒千二百人， 上灵官天丁力士千二百人， 上灵官收黑食黑吏六十人， 上灵官收神食神吏六十人， 上灵官收鬼食鬼吏六十人， 上灵官收邪食邪吏六十人， 上灵官收毒食毒吏六十人， 上灵官科车赤符吏六十人， 上灵官刚风骑置驿马上章吏二人。 太上正一三将军录品第四 镇漓沅治，右长熙祭酒，属土，在彭州九陇县，应奎宿，春分二月中。 某法录弟子某乙，命属北斗某星君，奉道勤修，劝化有功，精诚不懈，在道日新，素被太元三黑君召某乙，即日听署，依天师旧仪，裔信拜受太上老君左右中三将军兵士都九千万众附身律令。 左上仙蔽身大将军一人，姓唐名宏，字文明，身长七十二丈，赤积大冠单衣，手执金符，带剑，从兵三十万众，从五黑浮云中，下入某左肾中，生百脉进益某身。 赤情黄抱皂绿朱履 右上灵隐影大将军一人，姓葛名雍，字文度，身长七十二丈，赤绩大冠单衣，手执金刚玉戟，带剑，从兵三千万众、乘赤黑浮云，下入某右肾中，生百脉进益某身。 赤情红抱阜绿红带朱履",
      "translated_text": "Fifteen Upper Immortal Capital Healing Merit Officers,\nFifteen Upper Immortal Capital Left Bureau Merit Officers,\nFifteen Middle Upper Immortal Capital Right Bureau Merit Officers,\nFifteen Upper Immortal Capital Yang Spirit Decisive Clerks,\nFifteen Upper Immortal Capital Yang Spirit Healing Merit Officers,\nFifteen Upper Immortal Capital Yin Spirit Decisive Clerks,\nFifteen Upper Immortal Capital Yin Spirit Healing Merit Officers,\nFifteen Upper Immortal Capital Healing Yang Bureau Grand Physician Clerks,\nFifteen Upper Immortal Capital Healing Yin Bureau Grand Physician Clerks,\nFive Crimson Heaven Banner Rigorous Wind Generals,\nFive Crimson Heaven Banner Rigorous Wind Left Generals,\nFive Crimson Heaven Banner Rigorous Wind Right Generals,\nFive Crimson Heaven Banner Rigorous Wind Central Palace Grand Generals,\nFive Crimson Heaven Banner Rigorous Wind Central Palace Left Generals,\nFive Crimson Heaven Banner Rigorous Wind Central Palace Right Generals,\nFive Crimson Heaven Banner Rigorous Wind Grand Courier Generals,\nFive Crimson Heaven Banner Rigorous Wind Capital Courier Generals,\nFive Crimson Heaven Banner Rigorous Wind Left Courier Generals,\nFive Crimson Heaven Banner Rigorous Wind Right Courier Generals,\nFive Crimson Heaven Banner Left Rigorous Wind Official Cavalry Generals,\nFive Crimson Heaven Banner Right Rigorous Wind Official Cavalry Generals,\nFive Crimson Heaven Banner Rigorous Wind Left Cavalry Generals,\nFive Crimson Heaven Banner Rigorous Wind Right Cavalry Generals,\nOne Thousand Two Hundred Upper Immortal Capital Attendant Tiger Warriors,\nOne Thousand Two Hundred Upper Immortal Capital Investigative Hook Cavalry,\nOne Thousand Two Hundred Upper Immortal Capital Three Bureau Directors,\nOne Thousand Two Hundred Upper Immortal Capital Celestial Armored Soldiers,\nOne Thousand Two Hundred Upper Immortal Capital Celestial Ding Warriors,\nSixty Upper Immortal Capital Black-Consuming Black Clerks,\nSixty Upper Immortal Capital Spirit-Consuming Spirit Clerks,\nSixty Upper Immortal Capital Ghost-Consuming Ghost Clerks,\nSixty Upper Immortal Capital Evil-Consuming Evil Clerks,\nSixty Upper Immortal Capital Poison-Consuming Poison Clerks,\nSixty Upper Immortal Capital Ominous-Consuming Ominous Clerks,\nSixty Upper Immortal Capital Essence-Consuming Essence Clerks,\nSixty Upper Immortal Capital Pestilence-Consuming Pestilence Clerks,\nSixty Upper Immortal Capital Chariot Scarlet Talisman Clerks,\nTwo Upper Immortal Capital Rigorous Wind Cavalry Post-Horse Memorial Clerks.\n\nFifteen Upper Spirit Official Direct Envoy Merit Officers,\nFifteen Upper Spirit Official Orthodox Unity Merit Officers,\nFifteen Upper Spirit Official Healing Merit Officers,\nFifteen Upper Spirit Official Left Bureau Envoys,\nFifteen Upper Spirit Official Right Bureau Envoys,\nFifteen Upper Spirit Official Yang Spirit Central Clerks,\nFifteen Upper Spirit Official Yin Spirit Decisive Clerks,\nFifteen Upper Spirit Official Yang Bureau Healing Merit Officers,\nFifteen Upper Spirit Official Yin Bureau Healing Merit Officers,\nFifteen Upper Spirit Official Healing Yang Bureau Grand Physician Clerks,\nFifteen Upper Spirit Official Healing Yin Bureau Grand Physician Clerks,\nFive Upper Spirit Official Courier Cavalry Generals,\nFive Upper Spirit Official Left Courier Cavalry Generals,\nFive Upper Spirit Official Right Courier Cavalry Generals,\nFive Upper Spirit Official Capital Bureau Courier Cavalry Generals,\nFive Upper Spirit Official Left Capital Bureau Courier Cavalry Generals,\nFive Upper Spirit Official Right Capital Bureau Courier Cavalry Generals,\nFive Upper Spirit Official Capital Bureau Generals,\nFive Upper Spirit Official Left Capital Bureau Generals,\nFive Upper Spirit Official Right Capital Bureau Generals,\nFive Upper Spirit Official Capital Supervisor Generals,\nFive Upper Spirit Official Left Capital Supervisor Generals,\nFive Upper Spirit Official Right Capital Supervisor Generals,\nFive Upper Spirit Official Central Cavalry Generals,\nFive Upper Spirit Official Central Cavalry Left Generals,\nFive Upper Spirit Official Central Cavalry Right Generals,\nOne Thousand Two Hundred Upper Spirit Official Wolf Attendant Tiger Warriors,\nOne Thousand Two Hundred Upper Spirit Official Investigative Hook Cavalry,\nOne Thousand Two Hundred Upper Spirit Official Capital Bureau Directors,\nOne Thousand Two Hundred Upper Spirit Official Celestial Armored Soldiers,\nOne Thousand Two Hundred Upper Spirit Official Celestial Ding Warriors,\nSixty Upper Spirit Official Black-Consuming Black Clerks,\nSixty Upper Spirit Official Spirit-Consuming Spirit Clerks,\nSixty Upper Spirit Official Ghost-Consuming Ghost Clerks,\nSixty Upper Spirit Official Evil-Consuming Evil Clerks,\nSixty Upper Spirit Official Poison-Consuming Poison Clerks,\nSixty Upper Spirit Official Chariot Scarlet Talisman Clerks,\nTwo Upper Spirit Official Rigorous Wind Cavalry Post-Horse Memorial Clerks.\n\n**Register of the Supreme Orthodox Unity Three Generals, Chapter Four**\nThe Zhenli Yuan governance, under the Right Eternal Prosperity Libationer, belongs to Earth, located in Jiulong County of Pengzhou, corresponding to the Astral Mansion of Kui, during the mid-second month of spring equinox.\n\nThe Dharma-register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, having cultivated the Dao with diligent devotion and rendered meritorious service in conversion, whose sincerity remains unflagging and whose progress in the Way renews daily, has been summoned by the Three Black Lords of the Supreme Primordial, and on this day receives appointment. In accordance with the ancient rites of the Heavenly Master, [Name] now reverently receives the *Register of the Supreme Lord Lao’s Left, Right, and Central Three Generals*, with ninety million troops and attendants bound to the body by command.\n\nOne Left Upper Immortal Concealing Body Grand General,\nSurname Tang, given name Hong, style Wenming,\nSeventy-two *zhang* in height,\nWearing a crimson brocade cap and unlined robe,\nHolding a golden talisman and bearing a sword,\nLeading three hundred thousand troops,\nDescending from the five-black floating clouds into [Name]’s left kidney,\nGenerating the hundred meridians to strengthen [Name]’s body.\n*Red essence, yellow embrace, black sash, green shoes, vermilion soles.*\n\nOne Right Upper Spirit Concealing Shadow Grand General,\nSurname Ge, given name Yong, style Wendu,\nSeventy-two *zhang* in height,\nWearing a crimson brocade cap and unlined robe,\nHolding a jade halberd and bearing a sword,\nLeading thirty million troops,\nRiding crimson-black floating clouds into [Name]’s right kidney,\nGenerating the hundred meridians to strengthen [Name]’s body.\n*Red essence, red embrace, earthen sash, green belt, vermilion shoes.*",
      "overlap_context": "orld’s Northern Di Lord, and having been found worthy of appointment for meritorious cultivation, now seeks to receive the *Register of the Supreme Orthodox Unity Upper Immortals and One Hundred Fifty Generals*, with the pledge to provide aid and support, in strict accordance with the ritual statutes and ordinances, without daring to transgress. Humbly requests its bestowal.\n\nFifteen Upper Immortal Capital Direct Envoy Merit Officers,\nFifteen Upper Immortal Capital Orthodox Unity Merit Officers,",
      "start_char": 1683,
      "end_char": 3139,
      "start_sentence": 91,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.70711040496826,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "中上仙藏形大将军一人，姓周名武，字文刚，身长九十二丈，赤绩大冠单衣，手执朱阳之节，带剑，从兵三千万众，乘三五赤黑浮云，下入某身中进益某身。 赤情黄抱阜绿朱履 太上三五正一盟成采卷之一竟 太上三五正一盟威录卷之二 太上正一上灵百鬼召录品第五 炁应三月节，其日在娄，镇葛绩治，冬至后一百五日清明。 太上正一元命混沌赤录品第六 熙应三月中，其日在胃，镇庚除治，冬至后一百二十日谷雨。 太上正一上灵百鬼召筹品第五 镇葛绩治左都领熙祭酒，属火，在彭州九陇县，应娄宿，清明三月节。 某法录弟子某乙，命属北斗某星君，今资香信，诣某法师门下，求受太上正一上灵百鬼召录，内以治身，外以救人，诛邪灭恶，升度七祖，召唤诸神，应口即至，不召不得妄想干犯，某身受召之后，一如科约奉行，不得违背，违背之日，甘当冥考，急急如律令。 上灵官直使功曹十二人， 上灵官左玄功曹十二人，",
      "translated_text": "One Central Upper Perfected Concealing Form Grand General,\nSurname Zhou, given name Wu, style Wengang,\nNinety-two *zhang* in height,\nWearing a crimson brocade cap and unlined robe,\nHolding a vermilion yang tally and bearing a sword,\nLeading thirty million troops,\nRiding triple-five crimson-black floating clouds into [Name]’s body to strengthen [Name]’s form.\n*Red essence, yellow embrace, earthen sash, green shoes, vermilion soles.*\n\n*End of the First Scroll of the Covenant of the Triple-Five Orthodox Unity’s Radiant Talisman*\n\n*The Second Scroll of the Covenant of the Triple-Five Orthodox Unity’s Radiant Register*\n\n**Fifth Chapter: Summoning the Hundred Ghosts of the Upper Numinous**\nQi responds to the third lunar node, its day governed by *Lou*,\nPresiding over the *Geji* administration,\nOne hundred and five days after the winter solstice: Pure Brightness.\n\n**Sixth Chapter: The Primordial Destiny’s Chaotic Crimson Register of the Orthodox Unity**\nFlaming brilliance responds to the third lunar month, its day governed by *Wei*,\nPresiding over the *Gengchu* administration,\nOne hundred and twenty days after the winter solstice: Grain Rain.\n\n**Fifth Chapter: Summoning the Hundred Ghosts of the Upper Numinous Register**\nThe *Geji* administration governs the Left Metropolis, overseen by the *Xi* Libationer,\nAssigned to fire, located in Jiulong County of Pengzhou,\nCorresponding to the *Lou* constellation,\nThe Pure Brightness third lunar node.\n\nThis dharma-register disciple [Name], whose fate is bound to the [specific] Star Lord of the Northern Dipper,\nNow presents incense and offerings to the gate of [Title] Dharma Master,\nSeeking to receive the *Upper Numinous Hundred Ghosts Summoning Register*,\nInternally to cultivate the body, externally to save others,\nTo execute the perverse and eradicate evil,\nTo ascend and deliver the seven ancestors,\nTo summon and command all spirits,\nWho shall arrive at the utterance of the command,\nAnd may not presume to trespass without summons.\nUpon receiving this register, [Name] shall abide by all statutes and covenants,\nAnd may not violate them.\nShould violation occur, [Name] willingly accepts netherworld punishment.\n*Hastily, hastily, in accordance with the statutes and ordinances!*\n\nTwelve Merit Officers of the Upper Numinous Direct Envoys,\nTwelve Left Mysterious Merit Officers of the Upper Numinous,",
      "overlap_context": "brace, black sash, green shoes, vermilion soles.*\n\nOne Right Upper Spirit Concealing Shadow Grand General,\nSurname Ge, given name Yong, style Wendu,\nSeventy-two *zhang* in height,\nWearing a crimson brocade cap and unlined robe,\nHolding a jade halberd and bearing a sword,\nLeading thirty million troops,\nRiding crimson-black floating clouds into [Name]’s right kidney,\nGenerating the hundred meridians to strengthen [Name]’s body.\n*Red essence, red embrace, earthen sash, green belt, vermilion shoes.*",
      "start_char": 3139,
      "end_char": 3540,
      "start_sentence": 174,
      "end_sentence": 186,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.655100107192993,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "上灵官右玄功曹十二人， 上灵官左官使者十二人， 上灵官右官使者十二人， 上灵官治病功曹十二人， 上灵官左腋使者十二人， 上灵官右腋使者十二人， 上灵官左阳神次吏十二人， 上灵官右阳神次吏十二人， 上灵官左阴神决吏十二人， 上灵官右阴神庾吏十二人， 上灵官左上使者十二人， 上灵官右上使者十二人， 上灵官左医治十二人， 上灵官右医治十二人， 上灵官左上黑十二人， 上灵官右上黑十二人， 上灵官左承黑吏十二人， 上灵官右承黑吏十二人， 上灵官左都使者十二人， 上灵官右都使者十二人， 上灵官左收黑使者十二人， 上灵官右收黑使者十二人， 上灵官左扶身使者十二人， 上灵官右扶身使者十二人， 上灵官左元收黑食黑吏十二人， 上灵官右元收黑食黑史十二人， 上灵官左收邪食邪吏十二人， 上灵官右收邪食邪吏十二人， 上灵官左收鬼食鬼吏十二人， 上灵官右收鬼食鬼吏十二人， 上灵官历旗将军十二人， 上灵官左历旗将军十二人， 上灵官右历旗将军十二人， 上灵官左上历旗将军十二人， 上灵官右上历旗将军十二人， 上灵官左太元将军十二人， 上灵官右太元将军十二人， 上灵官左元历旗将军十二人， 上灵官右元历旗将军十二人， 上灵官元历旗将军十二人， 上灵官左阳神将军十二人， 上灵官右阳神将军十二人， 上灵官左阴神将军十二人， 上灵官右阴神将军十二人， 上灵官左上都骑将军十二人， 上灵官右上都骑将军十二人， 上灵官左太一都骑将军十二人， 上灵官右太一都骑将军十二人， 上灵官左天历旗将军十二人， 上灵官右天历旗将军十二人， 上灵官左上三天九府将军十二人， 上灵官右上三天九府将军十二人， 上灵官左上风骑将军十二人， 上灵官右上风骑将军十二人， 上灵官左玄一历旗将军十二人， 上灵官右玄一历旗将军十二人， 上灵官左三元玄皇将军十二人， 上灵官右三元玄皇将军十二人， 上灵官左上杀符将军十二人， 上灵官右上杀符将军十二人， 上灵官三皇九府将军十二人， 上灵官左上皇护身将军十二人， 上灵官右上皇护身将军十二人， 上灵官赤天刚骑使者十二人， 上灵官赤天刚收黑使者十二人， 上灵官紫宫度世使者十二人， 上灵官清妙度世使者十二人， 上灵官玄元度世使者十二人， 上灵官天丁力士十二人， 上灵官天骊甲卒十二人， 上灵官天医玄都使者十二人， 上灵官九宫八极使者十二人， 上灵官左天骑吏十二人， 上灵官右天骑吏十二人， 上灵官左天上使者十二人， 上灵官右天上使者十二人， 上灵官左上玄元使者十二人， 上灵官右上玄元使者十二人， 上灵官左官赤狼使者十二人， 上灵官右官赤狼使者十二人， 上灵官左清风护骑使者十二人， 上灵官右清风护骑使者十二人， 上灵官左玄朱雀使者十二人， 上灵官右玄朱雀使者十二人， 上灵官左科车赤符吏十二人， 上灵官右科车赤符吏十二人， 上灵官左正一使者十二人， 上灵官右正一使者十二人， 上灵官左元玄武使者十二人， 上灵官右元玄武使者十二人， 上灵官左上九元使者十二人， 上灵官右上九元使者十二人， 上灵官左三元四始使者十二人， 上灵官右三元四始使者十二人， 上灵官左上走虎贲吏十二人， 上灵官右上走虎贲吏十二人，",
      "translated_text": "Twelve Right Mysterious Merit Officers of the Upper Numinous,\nTwelve Left Official Envoys of the Upper Numinous,\nTwelve Right Official Envoys of the Upper Numinous,\nTwelve Healing Merit Officers of the Upper Numinous,\nTwelve Left Axillary Envoys of the Upper Numinous,\nTwelve Right Axillary Envoys of the Upper Numinous,\nTwelve Left Yang-Spirit Secondary Clerks of the Upper Numinous,\nTwelve Right Yang-Spirit Secondary Clerks of the Upper Numinous,\nTwelve Left Yin-Spirit Decisive Clerks of the Upper Numinous,\nTwelve Right Yin-Spirit Custodial Clerks of the Upper Numinous,\nTwelve Left Superior Envoys of the Upper Numinous,\nTwelve Right Superior Envoys of the Upper Numinous,\nTwelve Left Healing Officers of the Upper Numinous,\nTwelve Right Healing Officers of the Upper Numinous,\nTwelve Left Superior Black Officers of the Upper Numinous,\nTwelve Right Superior Black Officers of the Upper Numinous,\nTwelve Left Black-Receiving Clerks of the Upper Numinous,\nTwelve Right Black-Receiving Clerks of the Upper Numinous,\nTwelve Left Chief Envoys of the Upper Numinous,\nTwelve Right Chief Envoys of the Upper Numinous,\nTwelve Left Black-Seizing Envoys of the Upper Numinous,\nTwelve Right Black-Seizing Envoys of the Upper Numinous,\nTwelve Left Body-Supporting Envoys of the Upper Numinous,\nTwelve Right Body-Supporting Envoys of the Upper Numinous,\nTwelve Left Primordial Black-Seizing, Black-Consuming Clerks of the Upper Numinous,\nTwelve Right Primordial Black-Seizing, Black-Consuming Clerks of the Upper Numinous,\nTwelve Left Perverse-Seizing, Perverse-Consuming Clerks of the Upper Numinous,\nTwelve Right Perverse-Seizing, Perverse-Consuming Clerks of the Upper Numinous,\nTwelve Left Ghost-Seizing, Ghost-Consuming Clerks of the Upper Numinous,\nTwelve Right Ghost-Seizing, Ghost-Consuming Clerks of the Upper Numinous,\nTwelve Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Superior Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Superior Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Supreme Primordial Generals of the Upper Numinous,\nTwelve Right Supreme Primordial Generals of the Upper Numinous,\nTwelve Left Primordial Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Primordial Standard-Bearing Generals of the Upper Numinous,\nTwelve Primordial Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Yang-Spirit Generals of the Upper Numinous,\nTwelve Right Yang-Spirit Generals of the Upper Numinous,\nTwelve Left Yin-Spirit Generals of the Upper Numinous,\nTwelve Right Yin-Spirit Generals of the Upper Numinous,\nTwelve Left Superior Chief Cavalry Generals of the Upper Numinous,\nTwelve Right Superior Chief Cavalry Generals of the Upper Numinous,\nTwelve Left Supreme Unity Chief Cavalry Generals of the Upper Numinous,\nTwelve Right Supreme Unity Chief Cavalry Generals of the Upper Numinous,\nTwelve Left Celestial Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Celestial Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Superior Three Heavens, Nine Palaces Generals of the Upper Numinous,\nTwelve Right Superior Three Heavens, Nine Palaces Generals of the Upper Numinous,\nTwelve Left Superior Wind Cavalry Generals of the Upper Numinous,\nTwelve Right Superior Wind Cavalry Generals of the Upper Numinous,\nTwelve Left Mysterious Unity Standard-Bearing Generals of the Upper Numinous,\nTwelve Right Mysterious Unity Standard-Bearing Generals of the Upper Numinous,\nTwelve Left Three Primordials, Mysterious August Generals of the Upper Numinous,\nTwelve Right Three Primordials, Mysterious August Generals of the Upper Numinous,\nTwelve Left Superior Slaying Talisman Generals of the Upper Numinous,\nTwelve Right Superior Slaying Talisman Generals of the Upper Numinous,\nTwelve Three August Ones, Nine Palaces Generals of the Upper Numinous,\nTwelve Left Superior August Ones, Body-Protecting Generals of the Upper Numinous,\nTwelve Right Superior August Ones, Body-Protecting Generals of the Upper Numinous,\nTwelve Vermilion Heaven Valiant Cavalry Envoys of the Upper Numinous,\nTwelve Vermilion Heaven Valiant Black-Seizing Envoys of the Upper Numinous,\nTwelve Purple Palace Salvation Envoys of the Upper Numinous,\nTwelve Pure and Wondrous Salvation Envoys of the Upper Numinous,\nTwelve Mysterious Primordial Salvation Envoys of the Upper Numinous,\nTwelve Celestial Ding Warriors of the Upper Numinous,\nTwelve Celestial Li Armored Soldiers of the Upper Numinous,\nTwelve Celestial Healers, Mysterious Capital Envoys of the Upper Numinous,\nTwelve Nine Palaces, Eight Poles Envoys of the Upper Numinous,\nTwelve Left Celestial Cavalry Clerks of the Upper Numinous,\nTwelve Right Celestial Cavalry Clerks of the Upper Numinous,\nTwelve Left Celestial Superior Envoys of the Upper Numinous,\nTwelve Right Celestial Superior Envoys of the Upper Numinous,\nTwelve Left Superior Mysterious Primordial Envoys of the Upper Numinous,\nTwelve Right Superior Mysterious Primordial Envoys of the Upper Numinous,\nTwelve Left Official Vermilion Wolf Envoys of the Upper Numinous,\nTwelve Right Official Vermilion Wolf Envoys of the Upper Numinous,\nTwelve Left Pure Wind, Guarding Cavalry Envoys of the Upper Numinous,\nTwelve Right Pure Wind, Guarding Cavalry Envoys of the Upper Numinous,\nTwelve Left Mysterious Vermilion Bird Envoys of the Upper Numinous,\nTwelve Right Mysterious Vermilion Bird Envoys of the Upper Numinous,\nTwelve Left Chariot-Regulating, Vermilion Talisman Clerks of the Upper Numinous,\nTwelve Right Chariot-Regulating, Vermilion Talisman Clerks of the Upper Numinous,\nTwelve Left Orthodox Unity Envoys of the Upper Numinous,\nTwelve Right Orthodox Unity Envoys of the Upper Numinous,\nTwelve Left Primordial Dark Warrior Envoys of the Upper Numinous,\nTwelve Right Primordial Dark Warrior Envoys of the Upper Numinous,\nTwelve Left Superior Nine Primordials Envoys of the Upper Numinous,\nTwelve Right Superior Nine Primordials Envoys of the Upper Numinous,\nTwelve Left Three Primordials, Four Beginnings Envoys of the Upper Numinous,\nTwelve Right Three Primordials, Four Beginnings Envoys of the Upper Numinous,\nTwelve Left Superior Rushing Tiger Guards of the Upper Numinous,\nTwelve Right Superior Rushing Tiger Guards of the Upper Numinous,",
      "overlap_context": "o summon and command all spirits,\nWho shall arrive at the utterance of the command,\nAnd may not presume to trespass without summons.\nUpon receiving this register, [Name] shall abide by all statutes and covenants,\nAnd may not violate them.\nShould violation occur, [Name] willingly accepts netherworld punishment.\n*Hastily, hastily, in accordance with the statutes and ordinances!*\n\nTwelve Merit Officers of the Upper Numinous Direct Envoys,\nTwelve Left Mysterious Merit Officers of the Upper Numinous,",
      "start_char": 3540,
      "end_char": 5028,
      "start_sentence": 187,
      "end_sentence": 282,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.222556114196777,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "太上正一元命混沌赤绿品第六 镇庚阴沽右都领熙祭酒，属水，在汉州绵竹县，应胃宿，谷雨三月节。 某法箓弟子某乙，命属北斗某星君下生，素被君中狄召，某乙今谨资香信，诣某法师门下，求受太上正一元命赤天三五混沌赤录，录中真官严装显服，度人身中，某佩受之后，一如科约，不得有违，有违之日，甘当冥考，急急如律令。 上三天三五元命直使功曹一十五人， 上三天三五元命形神正一功曹一十五人， 上三天三五元命生形治病功曹一十五人， 上三天三五元命左官形神使者一十五人， 上三天三五元命右官形神使者一十五人， 上三天三五元命内阳神央吏一十五人， 上三天三五元命内阴神决吏一十五人， 上三天三五元命生黑阳官治病功曹一十五人， 上三天三五元命生黑阴官治病功曹一十五人， 上三天三五元命日阳官生熙治病太医一十五人， 上三天三五元命月阴官生黑治病太医一十五人， 上三天三五元命星官攻伐却敌功曹一十五人， 上三天三五元命司命吏一十五人， 上三天三五元命司录吏一十五人， 上三天三五元命司危吏一十五人， 上三天三五元命司伐吏一十五人， 上三天三五元命司诚吏一十五人， 上三天三五元命司针吏一十五人， 上三天三五元命司政吏一十五人， 上三天三五元命司察吏一十五人， 上三天三五元命文昌中官中黄九道司命一十五人，治官 赤天三五混沌生身蔽神斗刚大将军九人，治右肾，三五定生。 赤天三五混沌生身蔽神斗刚左将军九人，治左肾，三五定生。 赤天三五混沌生身蔽神斗刚右将军九人，治右肾，三五定生。 赤天三五混沌生身蔽神斗魁大将军九人，治右肾生肝。 赤天三五混沌生身蔽神斗魁左将军九人，治左肾生肝。 赤天三五混沌生身蔽神斗魁右将军九人，治右肾生肝。 赤天三五混沌生身蔽神斗魁大将军九人，治右肾生魂。 赤天三五混沌生身蔽神斗魁左将军九人，治左肾生魂。 赤天三五混沌生身蔽神斗魁右将军九人，治右肾生魂。 赤天三五混沌生身蔽神斗魑大将军九人，治右肾生形。 赤天三五混沌生身蔽神斗魑左将军九人，治左肾生形。 赤天三五混沌生身蔽神斗魑右将军九人，治右肾生形。 赤天三五混沌生身蔽神斗魅大将军九人，治右肾生肺。 赤天三五混沌生身蔽影斗魅左将军九人，治左肾生肺。 赤天三五混沌生身蔽影斗魅右将军九人，治右肾生肺。 赤天三五混沌生身蔽影斗魑大将军九人，治右肾生脾。 赤天三五混沌生形蔽影斗魑左将军九人，治左肾生脾。 赤天三五混沌生形蔽影斗魑右将军九人，治右肾生脾。 赤天三五混沌生形蔽影斗魅大将军九人，治心生魄。 赤天三五混沌生形蔽影斗魅左将军九人，治心生魄。 赤天三五混沌生形蔽影斗魅右将军九人，治心生魄。 赤天三五混沌生躯蔽身斗鳄大将军九人，治心生人。 赤天三五混沌生躯蔽身斗鳄左将军九人，治心生人。 赤天三五混沌生躯蔽身斗鳄右将军九人，治心生人。 赤天三五混沌生躯蔽身斗击大将军九人，治心生筋。 赤天三五混沌生躯蔽身斗击左将军九人，治心生筋。 赤天三五混沌生躯蔽身斗击右将军九人，治心生筋。 赤天三五混沌生躯蔽身斗敌大将军九人，治心生神。 赤天三五混沌生躯蔽身斗敌左将军九人，治心生神。",
      "translated_text": "**The Supreme Orthodox Unity Primordial Mandate of the Chaotic Crimson-Green Register, Sixth Grade**\n\nThe **Right Metropolitan Director of Zhen-Gengyin-Gu, Attendant Libationer Xi**, affiliated with Water, resides in Mianzhu County of Hanzhou, corresponding to the Stomach Mansion and the Grain Rain solar term of the third lunar month.\n\nThe register disciple [Name], born under the governance of the [X] Star Lord of the Northern Dipper, having long been summoned by the Central Di in the ranks, now respectfully presents incense and offerings at the gate of the Dharma Master, seeking to receive the **Supreme Orthodox Unity Primordial Mandate of the Crimson Heaven’s Three-Five Chaotic Crimson Register**. Upon its bestowal, the true officials within the register shall don their solemn vestments and descend into the disciple’s body. After receiving this mandate, [Name] shall abide by all statutes and covenants without transgression. Should any violation occur, [Name] willingly accepts the judgment of the netherworld. *Hasten, hasten, in accordance with the statutes and ordinances!*\n\n**Fifteen Direct Envoys of the Three-Five Primordial Mandate of the Upper Three Heavens,**\n**Fifteen Orthodox Unity Functionaries of the Three-Five Primordial Mandate’s Form and Spirit,**\n**Fifteen Functionaries of the Three-Five Primordial Mandate for Generating Form and Curing Illness,**\n**Fifteen Left Envoys of the Three-Five Primordial Mandate’s Form and Spirit,**\n**Fifteen Right Envoys of the Three-Five Primordial Mandate’s Form and Spirit,**\n**Fifteen Inner Yang Spirit Central Clerks of the Three-Five Primordial Mandate,**\n**Fifteen Inner Yin Spirit Decisive Clerks of the Three-Five Primordial Mandate,**\n**Fifteen Yang Official Functionaries of the Three-Five Primordial Mandate for Curing Illness,**\n**Fifteen Yin Official Functionaries of the Three-Five Primordial Mandate for Curing Illness,**\n**Fifteen Great Physicians of the Three-Five Primordial Mandate’s Solar Yang Officials for Generating Vitality,**\n**Fifteen Great Physicians of the Three-Five Primordial Mandate’s Lunar Yin Officials for Generating Darkness,**\n**Fifteen Functionaries of the Three-Five Primordial Mandate’s Stellar Officials for Attacking and Repelling Enemies,**\n**Fifteen Clerks of Destiny of the Three-Five Primordial Mandate,**\n**Fifteen Recorders of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Peril of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Punishment of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Sincerity of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Acupuncture of the Three-Five Primordial Mandate,**\n**Fifteen Clerks of Governance of the Three-Five Primordial Mandate,**\n**Fifteen Inspectors of the Three-Five Primordial Mandate,**\n**Fifteen Central Yellow Ninefold Dao Clerks of Destiny of the Three-Five Primordial Mandate’s Central Wenchang Palace, governing officials.**\n\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Rigidity**, governing the right kidney, establishing life through the Three-Five.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Rigidity**, governing the left kidney, establishing life through the Three-Five.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Rigidity**, governing the right kidney, establishing life through the Three-Five.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the right kidney to generate the liver.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the left kidney to generate the liver.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the right kidney to generate the liver.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the right kidney to generate the hun-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the left kidney to generate the hun-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chief**, governing the right kidney to generate the hun-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chī**, governing the right kidney to generate form.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chī**, governing the left kidney to generate form.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Chī**, governing the right kidney to generate form.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Mèi**, governing the right kidney to generate the lungs.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Mèi**, governing the left kidney to generate the lungs.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Mèi**, governing the right kidney to generate the lungs.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Shielding Spirit Dipper Lí**, governing the right kidney to generate the spleen.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Lí**, governing the left kidney to generate the spleen.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Lí**, governing the right kidney to generate the spleen.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Mèi**, governing the heart to generate the pò-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Mèi**, governing the heart to generate the pò-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Form Shielding Spirit Dipper Mèi**, governing the heart to generate the pò-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper È**, governing the heart to generate humanity.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper È**, governing the heart to generate humanity.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper È**, governing the heart to generate humanity.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Striker**, governing the heart to generate sinews.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Striker**, governing the heart to generate sinews.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Striker**, governing the heart to generate sinews.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Adversary**, governing the heart to generate spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Adversary**, governing the heart to generate spirit.",
      "overlap_context": " Numinous,\nTwelve Right Primordial Dark Warrior Envoys of the Upper Numinous,\nTwelve Left Superior Nine Primordials Envoys of the Upper Numinous,\nTwelve Right Superior Nine Primordials Envoys of the Upper Numinous,\nTwelve Left Three Primordials, Four Beginnings Envoys of the Upper Numinous,\nTwelve Right Three Primordials, Four Beginnings Envoys of the Upper Numinous,\nTwelve Left Superior Rushing Tiger Guards of the Upper Numinous,\nTwelve Right Superior Rushing Tiger Guards of the Upper Numinous,",
      "start_char": 5028,
      "end_char": 6395,
      "start_sentence": 283,
      "end_sentence": 335,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.342239379882812,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "赤天三五混沌生躯蔽身斗敌右将军九人，治心生神。 赤天三五混沌生躯辅体斗伐大将军九人，治肝安魂。 赤天三五混沌生躯辅体斗伐左将军九人，治肝安魂。 赤天三五混沌生躯辅体斗伐右将军九人，治肝安魂。 赤天三五混沌生躯辅体斗煞大将军九人，治肝清魂。 赤天三五混沌生躯辅体斗煞左将军九人，治肝清魂。 赤天三五混沌生躯辅体斗煞右将军九人，治肝清魂。 赤天三五混沌环玑却敌大将军九人，治肝仙魂。 赤天三五混沌难玑却敌左将军九人，治肝仙魂。 赤天三五混沌义玑却敌右将军九人，治肝仙魂。 赤天三五混沌玉衡破敌大将军九人，治肺静魄。 赤天三五混沌玉衡破敌左将军九人，治肺静魄。 赤天三五混沌玉衡破敌右将军九人，治肺静魄。 赤天三五混沌攻击大将军九人，治肺仙魄。 赤天三五混沌攻击左将军九人，治肺仙魄。 赤天三五混沌攻击右将军九人，治肺仙魄。 赤天三五中黄司命定生大将军九人，治脾安神。 赤天三五中黄司命定生左将军九人，治脾安神。 赤天三五中黄司命定生右将军九人，治脾安神。 赤天三五中黄司命定寿大将军九人，治脾清神。 赤天三五中黄司命定寿左将军九人，治脾清神。 赤天三五中黄司命定寿右将军九人，治脾清神。 赤天三五中黄司命定仙大将军九人，治脾留神。 赤天三五中黄司命定仙左将军九人，治脾留神。 赤天三五中黄司命定仙右将军九人，治脾留神。 上仙都中官执凶狼吏虎贲二百四十万人。 上仙都中官破敌察奸钩骑力士二百四十万人。 上仙都中官斩断都官仆射力士二百四十万人。 上仙都中官斩断三官仆射力士二百四十万人。 上仙都收黑天丁力士二百四十万人。 上仙都中官乘魁收黑食黑吏二百四十万人。 上仙都中官乘斗收神食神吏二百四十万人。 上仙都中官乘星收鬼食鬼吏二百四十万人。 上仙都中官乘环玑收精食精吏二百四十万人。 上仙都中官乘玉衡收邪食邪吏二百四十万人。 上仙都中官乘日三五科车赤符吏二百四十万人。 上仙都中官乘月三五捕鬼使者一百二十万人。 上仙都中官刚风骑置驿马上章三五除死籍定生九十万人。 上仙都中官中黄九道定意吏十二万人。 上仙都中官中黄九道定志吏十二万人。 上仙都中官中黄九道定聪智吏十二万人。 上仙都中官中黄九道定胆智吏十二万人。 上仙都中官中黄九道六阳六阴成身吏十二万人。 上仙都中官水神力士七千二百人。 上仙都中官八杀金刚力士七千二百人。 上仙都中官高车直事使者七千二百人。 上仙都中官科车赤符使者七千二百人。 上仙都中官科车检捕使者七千二百人。 上仙都中官执凶狼吏虎贲二百四十万人。 上仙都中官破敌察奸钩骑二百四十万人。 上仙都中官断斩三官仆射二百四十万人。 上仙都中官斩截都官仆射二百四十万人。 上仙都中官击刺天绉甲卒二百四十万人。 太仙神明中官收黑食黑天丁力士二百四十万人。 太仙神明中官乘魁收黑食黑吏二百四十万人。 太上神明中官乘斗收神食神吏二百四十万人。 太上神明中官乘纵玑收精食精吏二百四十万人。 太上神明中官乘玉衡收邪食邪吏二百四十万人。 太上神明中官乘日三五科车赤符吏二百二十万人。 太上神明中官乘月科车捕鬼使者一百二十万人。",
      "translated_text": "**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Adversary**, governing the heart to generate spirit.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Subduer**, governing the liver to pacify the hun-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Subduer**, governing the liver to pacify the hun-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Subduer**, governing the liver to pacify the hun-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Slayer**, governing the liver to purify the hun-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Slayer**, governing the liver to purify the hun-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Assisting Form Dipper Slayer**, governing the liver to purify the hun-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Revolving Mechanism Repelling Adversary**, governing the liver to immortalize the hun-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Perilous Mechanism Repelling Adversary**, governing the liver to immortalize the hun-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Righteous Mechanism Repelling Adversary**, governing the liver to immortalize the hun-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Jade Balance Breaking Adversary**, governing the lungs to still the po-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Jade Balance Breaking Adversary**, governing the lungs to still the po-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Jade Balance Breaking Adversary**, governing the lungs to still the po-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Assault**, governing the lungs to immortalize the po-soul.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Assault**, governing the lungs to immortalize the po-soul.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Assault**, governing the lungs to immortalize the po-soul.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Life**, governing the spleen to pacify the spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Life**, governing the spleen to pacify the spirit.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Life**, governing the spleen to pacify the spirit.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Longevity**, governing the spleen to purify the spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Longevity**, governing the spleen to purify the spirit.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Longevity**, governing the spleen to purify the spirit.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Immortality**, governing the spleen to retain the spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Immortality**, governing the spleen to retain the spirit.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Central Yellow Controller of Destiny Determining Immortality**, governing the spleen to retain the spirit.\n\nTwo million four hundred thousand **Tiger-Rushing Officials of the Upper Immortal Capital’s Central Bureau, Executing Ferocious Wolves**.\nTwo million four hundred thousand **Hook-Riding Valiant Warriors of the Upper Immortal Capital’s Central Bureau, Breaking Adversaries and Investigating Treachery**.\nTwo million four hundred thousand **Chief Archers of the Upper Immortal Capital’s Central Bureau, Severing the Capital Bureau**.\nTwo million four hundred thousand **Chief Archers of the Upper Immortal Capital’s Central Bureau, Severing the Three Bureaus**.\nTwo million four hundred thousand **Black Heaven Ding Valiant Warriors of the Upper Immortal Capital, Seizing**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Dipper to Seize Blackness and Consume Blackness**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Dipper to Seize Spirits and Consume Spirits**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Stars to Seize Ghosts and Consume Ghosts**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Revolving Mechanism to Seize Essences and Consume Essences**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Jade Balance to Seize Deviance and Consume Deviance**.\nTwo million four hundred thousand **Officials of the Upper Immortal Capital’s Central Bureau, Riding the Three-Five Solar Chariot of Red Talismans**.\nOne million two hundred thousand **Ghost-Capturing Envoys of the Upper Immortal Capital’s Central Bureau, Riding the Three-Five Lunar Chariot**.\nNine hundred thousand **Gale-Riding Couriers of the Upper Immortal Capital’s Central Bureau, Submitting Petitions to Remove Death Registers and Determine Life via the Three-Five**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Determining Intent Officials of the Upper Immortal Capital’s Central Bureau**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Determining Will Officials of the Upper Immortal Capital’s Central Bureau**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Determining Wisdom Officials of the Upper Immortal Capital’s Central Bureau**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Determining Courage and Wisdom Officials of the Upper Immortal Capital’s Central Bureau**.\nOne hundred twenty thousand **Central Yellow Ninefold Dao Six Yang and Six Yin Body-Forming Officials of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **Water Spirit Valiant Warriors of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **Eight Slayings Vajra Valiant Warriors of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **High Chariot Direct Serving Envoys of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **Red Talisman Chariot Inspecting Envoys of the Upper Immortal Capital’s Central Bureau**.\nSeventy-two hundred **Chariot Inspecting and Capturing Envoys of the Upper Immortal Capital’s Central Bureau**.\nTwo million four hundred thousand **Tiger-Rushing Officials of the Upper Immortal Capital’s Central Bureau, Executing Ferocious Wolves**.\nTwo million four hundred thousand **Hook-Riding Warriors of the Upper Immortal Capital’s Central Bureau, Breaking Adversaries and Investigating Treachery**.\nTwo million four hundred thousand **Chief Archers of the Upper Immortal Capital’s Central Bureau, Severing the Three Bureaus**.\nTwo million four hundred thousand **Chief Archers of the Upper Immortal Capital’s Central Bureau, Severing the Capital Bureau**.\nTwo million four hundred thousand **Heavenly Wrinkled-Armor Soldiers of the Upper Immortal Capital’s Central Bureau, Stabbing and Slashing**.\nTwo million four hundred thousand **Black Heaven Ding Valiant Warriors of the Grand Immortal Divine Luminaries’ Central Bureau, Seizing Blackness and Consuming Blackness**.\nTwo million four hundred thousand **Officials of the Grand Immortal Divine Luminaries’ Central Bureau, Riding the Dipper to Seize Blackness and Consume Blackness**.\nTwo million four hundred thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Dipper to Seize Spirits and Consume Spirits**.\nTwo million four hundred thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Vertical Mechanism to Seize Essences and Consume Essences**.\nTwo million four hundred thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Jade Balance to Seize Deviance and Consume Deviance**.\nTwo million two hundred twenty thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Three-Five Solar Chariot of Red Talismans**.\nOne million two hundred thousand **Ghost-Capturing Envoys of the Supreme Divine Luminaries’ Central Bureau, Riding the Lunar Chariot**.",
      "overlap_context": "rning the heart to generate sinews.\n**Nine Right Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Striker**, governing the heart to generate sinews.\n**Nine Great Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Adversary**, governing the heart to generate spirit.\n**Nine Left Generals of the Crimson Heaven’s Three-Five Chaotic Generating Body Shielding Self Dipper Adversary**, governing the heart to generate spirit.",
      "start_char": 6396,
      "end_char": 7775,
      "start_sentence": 336,
      "end_sentence": 395,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.560649871826172,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "太上神明中官刚风骑置驿马上章吏三五除死籍定生吏一十二万人。 太上神明中官中黄九道定志吏一十二万人。 太上神明中官中黄九道定意吏一十二万人。 太上神明中官中黄九道定聪智吏一十二万人。 太上神明中官中黄九道定胆智吏一十二万人。 太上神明中官六阳六阴成身吏一十二万人。 太上神明中官八煞金刚力士七千二百人。 太上神明中官八神金刚力士七千二百人。 太上神明中官高车使者七千二百人。 太上神明中官科车赤符使者七千二百人。 太上神明中官科车交击力士七千二百人。 上灵官执凶狼吏虎贲力士二百四十万人。 上灵官破敌察奸钩骑力士二百四十万人。 上灵官断斩三官仆射力士二百四十万人。 上灵官斩截都官仆射力士二百四十万人。 上灵官击刺天骊甲卒一百二十万人。 上灵官乘魁收黑食黑吏一百二十万人。 上灵官乘斗收神食神吏一百二十万人。 上灵官乘星收鬼食鬼吏一百二十万人。 上灵官乘游玑收精食精吏一百二十万人。 上灵官乘日科车赤符吏一百二十万人。 上灵官乘月科车捕鬼吏一百二十万人。 上灵官刚风骑置驿马上章吏三五除死籍定生吏九十万人。 上灵官中黄九道定志吏一十二万人。 上灵官中黄九道定意吏一十二万人。 上灵官中黄九道定聪智吏一十二万人。 上灵官中黄九道定胆智吏一十二万人。 上灵官中黄六阳六阴成身吏一十二万人。 上灵官科车交击力士七千二百人。 天灵官科车赤符使者七千二百人。 天灵官直使功曹七十二人。 天灵赤官收神摄神都护二人。 天灵赤官摄狱吏兵二人。 天灵赤官斩邪使者二人。 天灵赤官检邪直符二人。 天灵赤官仙人道士玉女百二十人。 天灵赤官护身不离身将军一十四人。 天灵赤官治病功曹使者二人。 天灵赤官兵曹兵马吏各九人。 天灵赤官护身将军各九人。 皇天大道神符令录契，与某周行八极，神童赤契备卫某身形，千二百官侍卫四方，日月星辰，三五将军临庐，四道大丘公天灵赤官，斩邪刺奸二人，八侯君三十六仙童，黄帝君左右都侯墓门丞，江河桥梁山川，仙神社稷即日听署，若是某所使莫不宾伏卫，送昆仑上升天极，今资香信素一百二十尺，五色缘各一端，以置法信，辄依拜受，要明教约，不得截真，若违之日，身谢天地水三官，一如太上老君律令。 童子浅清袍深青绿白带朱履 天尊绿云被深青绿",
      "translated_text": "**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Rigorous Winds to Station Post Horses and Present Memorials, the Three-Five Eliminators of Death Registers and Fixers of Life Records**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Central Yellow Nine Dao Fixers of Resolve**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Central Yellow Nine Dao Fixers of Intent**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Central Yellow Nine Dao Fixers of Wisdom and Discernment**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Central Yellow Nine Dao Fixers of Courage and Intelligence**.\n**Twelve myriad** **Officials of the Supreme Divine Luminaries’ Central Bureau, the Six Yang and Six Yin Completers of the Body**.\n**Seven thousand two hundred** **Vajra Warriors of the Eight Slayers of the Supreme Divine Luminaries’ Central Bureau**.\n**Seven thousand two hundred** **Vajra Warriors of the Eight Spirits of the Supreme Divine Luminaries’ Central Bureau**.\n**Seven thousand two hundred** **High Chariot Envoys of the Supreme Divine Luminaries’ Central Bureau**.\n**Seven thousand two hundred** **Red Talisman Envoys of the Supreme Divine Luminaries’ Central Bureau’s Chariot Bureau**.\n**Seven thousand two hundred** **Striking Warriors of the Supreme Divine Luminaries’ Central Bureau’s Chariot Bureau**.\n\n**Two million four hundred thousand** **High Numinous Officials, Executors of the Fierce Wolf, Tiger-Rushing Vajra Warriors**.\n**Two million four hundred thousand** **High Numinous Officials, Breakers of Enemies and Investigators of Treachery, Hook-Riding Warriors**.\n**Two million four hundred thousand** **High Numinous Officials, Decapitators and Slashers of the Three Bureaus’ Commanders**.\n**Two million four hundred thousand** **High Numinous Officials, Beheaders of the Capital Bureaus’ Commanders**.\n**One million two hundred thousand** **High Numinous Officials, Piercing and Stabbing Celestial Black Steed Armored Soldiers**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Dipper to Seize Blackness and Consume Blackness**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Dipper to Seize Spirits and Consume Spirits**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Stars to Seize Ghosts and Consume Ghosts**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Mobile Mechanism to Seize Essences and Consume Essences**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Solar Chariot Bureau’s Red Talisman Officials**.\n**One million two hundred thousand** **High Numinous Officials, Riding the Lunar Chariot Bureau’s Ghost-Capturing Officials**.\n**Nine hundred thousand** **High Numinous Officials, Riding the Rigorous Winds to Station Post Horses and Present Memorials, the Three-Five Eliminators of Death Registers and Fixers of Life Records**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Nine Dao Fixers of Resolve**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Nine Dao Fixers of Intent**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Nine Dao Fixers of Wisdom and Discernment**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Nine Dao Fixers of Courage and Intelligence**.\n**Twelve myriad** **High Numinous Officials, the Central Yellow Six Yang and Six Yin Completers of the Body**.\n**Seven thousand two hundred** **Striking Warriors of the High Numinous Officials’ Chariot Bureau**.\n\n**Seven thousand two hundred** **Celestial Numinous Officials’ Red Talisman Envoys of the Chariot Bureau**.\n**Seventy-two** **Direct Envoys and Merit Recorders of the Celestial Numinous Officials**.\n**Two** **Celestial Numinous Red Officials, Commanders of Spirit-Seizing and Spirit-Subduing**.\n**Two** **Celestial Numinous Red Officials, Prison-Subduing Warrior-Officials**.\n**Two** **Celestial Numinous Red Officials, Deviance-Slaying Envoys**.\n**Two** **Celestial Numinous Red Officials, Deviance-Inspecting Direct Talisman-Bearers**.\n**One hundred twenty** **Celestial Numinous Red Officials, Immortals, Daoists, and Jade Maidens**.\n**Fourteen** **Celestial Numinous Red Officials, Generals of Unfailing Body Protection**.\n**Two** **Celestial Numinous Red Officials, Merit Recorders and Envoys for Healing Illness**.\n**Nine each** **Celestial Numinous Red Officials, Military Clerks and Cavalry-Officers**.\n**Nine each** **Celestial Numinous Red Officials, Generals of Body Protection**.\n\nThe **Divine Talisman Decree of the August Heavenly Dao**, in union with [Name], traverses the Eight Poles. The **Divine Lads and Red Contracts** guard [Name]’s form, with **one thousand two hundred officials** attending the four directions. The **sun, moon, and stars**, the **Three-Five Generals**, descend to the abode. The **Four Dao Great Mound Lords** and **Celestial Numinous Red Officials**, the **Deviance-Slaying and Treachery-Piercing Two**, the **Eight Marquis Lords and Thirty-Six Immortal Lads**, the **Yellow Thearch’s Left and Right Capital Marquis Tomb Gate Assistants**, the **rivers, bridges, mountains, and streams**, the **immortal spirits and altars of the soil and grain**—all heed the appointment this day. Whatever [Name] commands shall without exception submit and protect, escorting [them] to ascend Kunlun and reach the Celestial Pole. Herewith, I offer **one hundred twenty feet of plain silk** and **one bolt each of five-colored trims** as ritual tokens. I hereby accept and comply, binding myself to the luminous covenant. No truncation of the true [teaching] is permitted. Should this be violated, the body shall be forfeit to the **Three Bureaus of Heaven, Earth, and Water**, in accordance with the **Statutes and Ordinances of the Most High Lord Lao**.\n\n**Lads**: Light azure robes, deep green sashes, white belts, vermilion shoes.\n**Heavenly Worthy**: Green cloud cloak, deep green.",
      "overlap_context": "sm to Seize Essences and Consume Essences**.\nTwo million four hundred thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Jade Balance to Seize Deviance and Consume Deviance**.\nTwo million two hundred twenty thousand **Officials of the Supreme Divine Luminaries’ Central Bureau, Riding the Three-Five Solar Chariot of Red Talismans**.\nOne million two hundred thousand **Ghost-Capturing Envoys of the Supreme Divine Luminaries’ Central Bureau, Riding the Lunar Chariot**.",
      "start_char": 7776,
      "end_char": 8776,
      "start_sentence": 396,
      "end_sentence": 438,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.12431240081787,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "太上三五正一盟威箓卷之二竟 太上三五正一盟威箓卷之三 太上正一上仙百鬼召录品第七 炁应四月节。 其日在易，镇秦中治，冬至后一百三十五日立夏。 太上正一九州社令录品第八 炁应四月中，其日在毕，镇真多治，冬至后一百五十日小满。 太上正一上仙百鬼召录品第七 镇秦中治左领神熙祭酒，属水，在汉州德阳县，应勖宿，立夏四月节。 某法录弟子某乙命属北斗某星君，素被元下九老北中狄君召某乙谨裔香信，诣某法师门下，求受太上正一上仙官百鬼召录，受佩之后，应有召问立至，不得妄有干犯，急急如律令。 仙灵官直使功曹十二人， 仙灵官正一功曹十二人， 仙灵官左玄功曹十二人， 仙灵官右玄功曹十二人， 仙灵官治病功曹十二人， 仙灵官左官使者十二人， 仙灵官右官使者十二人， 仙灵官左依使者十二人， 仙灵官右依使者十二人， 仙灵官左阳神决吏十二人， 仙灵官右阳神决吏十二人， 仙灵官左阴神庾吏十二人， 仙灵官右阴神庾吏十二人， 仙灵官左天使者十二人， 仙灵官右天使者十二人， 仙灵官左天医吏十二人， 仙灵官右天医吏十二人， 仙灵官左上玄使者十二人， 仙灵官右上玄使者十二人， 仙灵官左承黑使者十二人， 仙灵官右承黑使者十二人， 仙灵官左都使者十二人， 仙灵官右都使者十二人， 仙灵官左收黑使者十二人， 仙灵官右收黑使者十二人， 仙灵官左扶身吏十二人， 仙灵官右扶身吏十二人， 仙灵官左收黑直符吏十二人， 仙灵官右收黑直符吏十二人， 仙灵官左收邪食邪吏十二人， 仙灵官右收邪食邪吏十二人， 仙灵官历旗将军十二人， 仙灵官左历旗将军十二人， 仙灵官右历旗将军十二人， 仙灵官天历旗将军十二人， 仙灵官左天历旗将军十二人， 仙灵官右天历旗将军十二人， 仙灵官左加元历旗将军十二人， 仙灵官右加元历旗将军十二人， 仙灵官左天骑将军十二人， 仙灵官右天骑将军十二人， 仙灵官左太上都骑将军十二人， 仙灵官右太上都骑将军十二人， 仙灵官左玄上元将军十二人， 仙灵官右玄上元将军十二人， 仙灵官太一都将军十二人， 仙灵官左天医将军十二人， 仙灵官右天医将军十二人， 仙灵官左三天九府将军十二人， 仙灵官右三天九府将军十二人， 仙灵官左上皇护骑将军十二人， 仙灵官右上皇护骑将军十二人， 仙灵官左刚风骑将军十二人， 仙灵官右刚风骑将军十二人， 仙灵官左玄历旗将军十二人， 仙灵官右玄历旗将军十二人， 仙灵官左上煞将军十二人， 仙灵官右上煞将军十二人， 仙灵官左阳神将军十二人， 仙灵官右阳神将军十二人， 仙灵官左阴神将军十二人， 仙灵官右阴神将军十二人， 仙灵官赤天罔使者十二人， 仙灵官赤天罔收黑使者十二人， 仙灵官紫宫度世使者十二人， 仙灵官清妙度世使者十二人， 仙灵官玄元度世使者十二人， 仙灵官天丁力士使者十二人， 仙灵官天绉甲卒十二人， 仙灵官天医玄都使者十二人， 仙灵官九宫八极使者十二人， 仙灵官左天骑使者十二人， 仙灵官右天骑使者十二人， 仙灵官九宫玄上使者十二人， 仙灵官左玄上元使者十二人， 仙灵官右玄上元使者十二人， 仙乱官左赤狼使者十二人， 仙灵官右赤狼使者十二人， 仙灵官左清风使者十二人， 仙灵官右清风使者十二人，",
      "translated_text": "**The Second Scroll of the Most High Orthodox Unity’s Covenant of Alliance and Awe Concludes**\n**The Third Scroll of the Most High Orthodox Unity’s Covenant of Alliance and Awe**\n\n**Chapter Seven: The Register for Summoning the Hundred Ghosts of the Orthodox Unity’s Upper Immortals**\n*Qi* responds to the fourth lunar month’s solar term. On this day, in the *Yi* trigram, it governs the central region of Qin. **Establishment of Summer** occurs one hundred thirty-five days after the winter solstice.\n\n**Chapter Eight: The Register of the Nine Provinces’ Community Altars of the Orthodox Unity**\n*Qi* responds to the middle of the fourth lunar month. On this day, in the *Bi* constellation, it governs the realm of Zhen Duo. **Grain Full** occurs one hundred fifty days after the winter solstice.\n\n**Chapter Seven: The Register for Summoning the Hundred Ghosts of the Orthodox Unity’s Upper Immortals**\nThe **Left Administering Divine Officer Xi Jijiu**, governing the central region of Qin, belongs to the element of Water. Located in Deyang County of Hanzhou, it corresponds to the *Xu* constellation. **Establishment of Summer** occurs on the solar term of the fourth lunar month.\n\nThe disciple of the register’s method, [Name], whose fate is governed by the [X] Star Lord of the Northern Dipper, having been summoned by the **Nine Elders of the Primordial Descent from the Northern Center under Di Jun**, now respectfully presents ritual tokens of silk and incense at the gate of the [Title] Master, seeking to receive the **Register for Summoning the Hundred Ghosts of the Orthodox Unity’s Upper Immortal Officials**. Upon acceptance and wearing, all summons shall be answered without delay. No reckless transgressions are permitted. **Hastily, hastily, in accordance with the statutes and ordinances!**\n\n**Divine Officials and Direct Envoys of the Immortal Bureaus:**\n- **Twelve Celestial Clerks of the Orthodox Unity**\n- **Twelve Celestial Clerks of the Orthodox Unity’s Proper Function**\n- **Twelve Celestial Clerks of the Left Mysterious Function**\n- **Twelve Celestial Clerks of the Right Mysterious Function**\n- **Twelve Celestial Clerks for Healing Ailments**\n- **Twelve Left Bureau Envoys**\n- **Twelve Right Bureau Envoys**\n- **Twelve Left Attendant Envoys**\n- **Twelve Right Attendant Envoys**\n- **Twelve Left Yang Spirit Decisive Officers**\n- **Twelve Right Yang Spirit Decisive Officers**\n- **Twelve Left Yin Spirit Storehouse Officers**\n- **Twelve Right Yin Spirit Storehouse Officers**\n- **Twelve Left Celestial Envoys**\n- **Twelve Right Celestial Envoys**\n- **Twelve Left Celestial Physician Officers**\n- **Twelve Right Celestial Physician Officers**\n- **Twelve Left Upper Mysterious Envoys**\n- **Twelve Right Upper Mysterious Envoys**\n- **Twelve Left Black-Receiving Envoys**\n- **Twelve Right Black-Receiving Envoys**\n- **Twelve Left Capital Envoys**\n- **Twelve Right Capital Envoys**\n- **Twelve Left Black-Gathering Envoys**\n- **Twelve Right Black-Gathering Envoys**\n- **Twelve Left Body-Protecting Officers**\n- **Twelve Right Body-Protecting Officers**\n- **Twelve Left Black-Gathering Direct Talisman Officers**\n- **Twelve Right Black-Gathering Direct Talisman Officers**\n- **Twelve Left Evil-Gathering and Evil-Consuming Officers**\n- **Twelve Right Evil-Gathering and Evil-Consuming Officers**\n- **Twelve Banner Generals of the Celestial Calendar**\n- **Twelve Left Banner Generals of the Celestial Calendar**\n- **Twelve Right Banner Generals of the Celestial Calendar**\n- **Twelve Celestial Banner Generals of the Celestial Calendar**\n- **Twelve Left Celestial Banner Generals of the Celestial Calendar**\n- **Twelve Right Celestial Banner Generals of the Celestial Calendar**\n- **Twelve Left Added-Primordial Banner Generals of the Celestial Calendar**\n- **Twelve Right Added-Primordial Banner Generals of the Celestial Calendar**\n- **Twelve Left Celestial Cavalry Generals**\n- **Twelve Right Celestial Cavalry Generals**\n- **Twelve Left Generals of the Most High’s Capital Cavalry**\n- **Twelve Right Generals of the Most High’s Capital Cavalry**\n- **Twelve Left Upper Primordial Generals of the Mysterious**\n- **Twelve Right Upper Primordial Generals of the Mysterious**\n- **Twelve Generals of the Great One’s Capital**\n- **Twelve Left Celestial Physician Generals**\n- **Twelve Right Celestial Physician Generals**\n- **Twelve Left Generals of the Three Heavens’ Nine Palaces**\n- **Twelve Right Generals of the Three Heavens’ Nine Palaces**\n- **Twelve Left Generals of the Upper Sovereign’s Guard Cavalry**\n- **Twelve Right Generals of the Upper Sovereign’s Guard Cavalry**\n- **Twelve Left Generals of the Rigorous Wind Cavalry**\n- **Twelve Right Generals of the Rigorous Wind Cavalry**\n- **Twelve Left Mysterious Banner Generals of the Celestial Calendar**\n- **Twelve Right Mysterious Banner Generals of the Celestial Calendar**\n- **Twelve Left Upper Executioner Generals**\n- **Twelve Right Upper Executioner Generals**\n- **Twelve Left Yang Spirit Generals**\n- **Twelve Right Yang Spirit Generals**\n- **Twelve Left Yin Spirit Generals**\n- **Twelve Right Yin Spirit Generals**\n- **Twelve Envoys of the Crimson Heaven’s Net**\n- **Twelve Black-Gathering Envoys of the Crimson Heaven’s Net**\n- **Twelve Envoys of the Purple Palace’s Salvation**\n- **Twelve Envoys of the Pure and Wondrous Salvation**\n- **Twelve Envoys of the Mysterious Origin’s Salvation**\n- **Twelve Envoys of the Celestial Ding Warriors**\n- **Twelve Celestial Armored Soldiers**\n- **Twelve Envoys of the Celestial Physician’s Mysterious Capital**\n- **Twelve Envoys of the Nine Palaces and Eight Poles**\n- **Twelve Left Celestial Cavalry Envoys**\n- **Twelve Right Celestial Cavalry Envoys**\n- **Twelve Envoys of the Nine Palaces’ Mysterious Upper Realm**\n- **Twelve Left Envoys of the Upper Primordial of the Mysterious**\n- **Twelve Right Envoys of the Upper Primordial of the Mysterious**\n- **Twelve Left Envoys of the Crimson Wolves**\n- **Twelve Right Envoys of the Crimson Wolves**\n- **Twelve Left Envoys of the Pure Wind**\n- **Twelve Right Envoys of the Pure Wind**",
      "overlap_context": "lk** and **one bolt each of five-colored trims** as ritual tokens. I hereby accept and comply, binding myself to the luminous covenant. No truncation of the true [teaching] is permitted. Should this be violated, the body shall be forfeit to the **Three Bureaus of Heaven, Earth, and Water**, in accordance with the **Statutes and Ordinances of the Most High Lord Lao**.\n\n**Lads**: Light azure robes, deep green sashes, white belts, vermilion shoes.\n**Heavenly Worthy**: Green cloud cloak, deep green.",
      "start_char": 8776,
      "end_char": 10251,
      "start_sentence": 439,
      "end_sentence": 528,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.171504259109497,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "仙灵官左朱雀使者十二人， 仙灵官右朱雀使者十二人， 仙灵官科车赤符使者十二人， 仙灵官科车赤符吏十二人， 仙灵官正一使者十二人， 仙灵官左天玄武使者十二人， 仙灵官右天玄武使者十二人， 仙灵官左上九天使者十二人， 仙灵官右上九天使者十二人， 仙灵官左三元四始使者十二人， 仙灵官右三元四始使者十二人， 仙灵官左走虎贲吏十二人， 仙灵官右走虎贲吏十二人。 绿冠黄服绿云被青绿 绿冠红服绿绿青披深青绿朱履 太上正一九州社令录品第八 镇真多治右领神熙祭酒，属水，在汉州金堂县，应毕宿，小满四月中。 某法箓弟子某乙，命属北斗某星君，今谨资法信，诣某法师门下，奉受太上正一九州社令录，遣察行九州名山川泽，五岳四渍，五湖四海，三十六国，万二千乡亭里域，周遍上下元极，束西南北，限召众邪故黑万鬼立到，不得迁历，救治万民，千二百鬼注依法收录，万神常在，左右侍从，延年益寿，除凶度厄，某乙受佩之后，一如科约，不得违背，有违之日，甘当冥考，不敢有恨，修行精诚，即日听署，前部吏兵，素被中治明道神君召，诣臣拜受请给，谨词。 上皇诸君符，朱书桃刺，一尺六寸，刺头当中封天帝使者，印板玉吏兵，芒绳大张，缯彩封题，随以意所言召问，勿传泄吾真宝符，未有所治勿召，自带符录，百鬼即自知之，叉手擎杖，当於泰清下稽首受之，鬼不从者斩而戮之，急急如律令。 臣初受符之时，誓上谓皇天大道君洞达太上元极九宫，神童玉女皆来侍从，乘送迎上游九天，人问出入，举言所召即至，不敢致违律令。 王延陵知之存念，令人不病，入水不畏风浪，入军不被甲兵，一如科法律令。 东方青帝姓昊名晓， 南方赤帝姓刘名嚣， 西方白帝姓一及名敖， 北方黑帝姓夏名禹， 京师社天之心神，姓黄名崇， 冀州社天之头神，姓冯名迁， 刻州社天之腹神，姓张名贱， 徐州社天之胸神，姓夏名意，一名符一名前。 梁州社天之喉神，姓范名扎，一名礼。 雍州社天之背神，姓杨名谦， 兖州社天之膊神，姓费名前， 扬州社天之足神，姓邹名混， 青州社天之颈神，姓韩名育， 益州社天之眉神，姓颜名理， 幽州社天之手神，姓戚名季， 伍子胥主庙祇， 狱丞姓名下令除，主诸社神，有坐不召， 符吏即天上主录，姓贾名衍主捕鬼， 都官从事姓陈名松，主诸司马， 天司马空极姓日名巳，主地神， 表道使者姓吕名应，主走道路， 太极令姓朱名雒，主（缺文） 天侯门将军姓邓名训，主武库钱， 日君姓都名神，主天清地浊，带六甲符， 月君姓桂名华，主天下顺逆， 千害杀君姓魏名玄，主诸符吏太岁， 明主公姓樊名贪，主收捕鬼部中百怪， 中都狱丞姓韩名贵，主领天下不法符吏， 天社君姓伍名库，主天下社君。 夫欲召万物神符，丹书桃刺长一尺六寸，封以天帝使者印约，以左索召鬼，其神立至，佩带符百鬼皆畏，人知大鬼姓名，则悉不为害也，凡诸州神名，主其州中所部县乡里域，社君不得令邪精鬼魅血食，大小山神其有不伏者案法召之，鬼应响立至，急急依事召问元由也。 度符法当随生年所属依色寸尺，刀一口环一双，度符师取一环并物，一者付主使存师符信，能者可署明许慎之，不得传非其人也，主者审详之，岂不慎哉。",
      "translated_text": "**Twelve Left Envoys of the Vermilion Phoenix**\n**Twelve Right Envoys of the Vermilion Phoenix**\n**Twelve Envoys of the Scarlet Talisman Chariot**\n**Twelve Clerks of the Scarlet Talisman Chariot**\n**Twelve Envoys of the Orthodox Unity**\n**Twelve Left Envoys of the Celestial Dark Warrior**\n**Twelve Right Envoys of the Celestial Dark Warrior**\n**Twelve Left Envoys of the Upper Nine Heavens**\n**Twelve Right Envoys of the Upper Nine Heavens**\n**Twelve Left Envoys of the Three Origins and Four Beginnings**\n**Twelve Right Envoys of the Three Origins and Four Beginnings**\n**Twelve Left Rushing Tiger Valiant Clerks**\n**Twelve Right Rushing Tiger Valiant Clerks**\n\nGreen caps and yellow robes, draped in green clouds and clad in verdant green;\nGreen caps and red robes, draped in deep green and clad in dark green, with vermilion shoes.\n\n**The Orthodox Unity’s Register of the Nine Provinces’ Earth Altars, Rank the Eighth**\nZhen Zhen Duo Zhi, Right Director, Divine Sacrificial Wine Officer Xi, associated with water, stationed in Jintang County of Hanzhou, corresponding to the *Bi* constellation, during the fourth month of the solar term *Lesser Fullness*.\n\nThe disciple of the Dharma Register, so-and-so, whose fate is governed by the Star Lord of the Northern Dipper’s such-and-such star, now respectfully offers Dharma tokens and presents himself at the gate of such-and-such Dharma Master to receive the *Orthodox Unity’s Register of the Nine Provinces’ Earth Altars*. Dispatched to inspect the famous mountains, rivers, marshes, and lakes of the Nine Provinces; the Five Peaks and Four Floods; the Five Lakes and Four Seas; the thirty-six states; and the twelve thousand townships and villages—traversing the upper, middle, and lower primal extremities, encompassing east, west, south, and north—summon all malevolent ghosts and black legions of the myriad demons to appear without delay or evasion. Heal the myriad people, and in accordance with the Dharma, subdue and register the twelve hundred ghosts. May the ten thousand spirits ever attend at his left and right, prolonging life and augmenting years, eliminating misfortune and transcending calamity.\n\nUpon receiving and wearing this register, so-and-so shall abide by all regulations and covenants. Should he violate them, he willingly accepts the punishments of the netherworld and dares not harbor resentment. Through diligent cultivation and sincerity, he shall be appointed this very day. The vanguard clerks and soldiers, previously summoned by the Divine Lord of the Luminous Dao of the Central Realm, now present themselves to receive their commissions. Respectfully submitted.\n\n**The Supreme Sovereign’s Talismans for All Lords**\nInscribed in vermilion on peachwood slips, one foot and six inches in length, the center of the slip sealed with the talisman of the Heavenly Emperor’s Envoy. The talisman board is entrusted to the jade clerks and soldiers, bound with hempen cords and sealed with silk, to be deployed as needed for summons and inquiries. Do not disclose this true and precious talisman. Do not summon without cause. Those who carry this register and talisman shall be recognized by all ghosts, who will cross their hands, raise their staffs, and bow their heads beneath the Supreme Clarity to receive it. Ghosts who disobey shall be beheaded and executed. Hasten! As the statutes and ordinances command.\n\nWhen first receiving the talisman, the disciple swears before the August Heavenly Lord of the Great Dao, the Penetrating Supreme Sovereign of the Nine Palaces’ Primal Extremity, that divine youths and jade maidens shall attend him, escorting him to ascend and roam the Nine Heavens. In all his comings and goings among men, whatever he summons shall arrive instantly, daring not to violate the statutes and ordinances.\n\nWang Yanling knows this through contemplation, ensuring that people remain free from illness. Entering water, they shall fear no winds or waves; entering battle, they shall not be harmed by armor or weapons. All shall proceed in accordance with the statutes, laws, and ordinances.\n\n**The Eastern Azure Emperor**, surnamed Hao, named Xiao;\n**The Southern Vermilion Emperor**, surnamed Liu, named Ao;\n**The Western White Emperor**, surnamed Yi, named Ao;\n**The Northern Dark Emperor**, surnamed Xia, named Yu;\n**The Earth Spirit of the Capital’s Altar**, surnamed Huang, named Chong;\n**The Earth Spirit of Jizhou’s Altar**, surnamed Feng, named Qian;\n**The Earth Spirit of Youzhou’s Altar**, surnamed Zhang, named Jian;\n**The Earth Spirit of Xuzhou’s Altar**, surnamed Xia, named Yi (also named Fu, also named Qian);\n**The Earth Spirit of Liangzhou’s Altar**, surnamed Fan, named Zha (also named Li);\n**The Earth Spirit of Yongzhou’s Altar**, surnamed Yang, named Qian;\n**The Earth Spirit of Yanzhou’s Altar**, surnamed Fei, named Qian;\n**The Earth Spirit of Yangzhou’s Altar**, surnamed Zou, named Hun;\n**The Earth Spirit of Qingzhou’s Altar**, surnamed Han, named Yu;\n**The Earth Spirit of Yizhou’s Altar**, surnamed Yan, named Li;\n**The Earth Spirit of Youzhou’s Altar**, surnamed Qi, named Ji.\n\n**Wu Zixu**, presiding over temple spirits;\n**The Prison Warden**, whose name commands the removal of all altar spirits who sit idle without summons.\n\n**The Talisman Clerk**, the celestial registrar, surnamed Jia, named Yan, presiding over ghost capture;\n**The Capital Bureau Attendant**, surnamed Chen, named Song, presiding over all marshals;\n**The Celestial Marshal of the Vast Ultimate**, surnamed Ri, named Si, presiding over earth spirits;\n**The Envoys of the Exposed Dao**, surnamed Lü, named Ying, presiding over roads and paths;\n**The Supreme Ultimate Ordinance**, surnamed Zhu, named Luo, presiding over (text missing);\n**The Heavenly Gate General**, surnamed En, named Xun, presiding over armories and treasuries;\n**The Sun Lord**, surnamed Du, named Shen, presiding over the clarity of heaven and turbidity of earth, bearing the Six Jia Talismans;\n**The Moon Lord**, surnamed Gui, named Hua, presiding over the world’s compliance and rebellion;\n**The Lord of a Thousand Harms and Slaughter**, surnamed Wei, named Xuan, presiding over all talisman clerks and the Great Year;\n**The Illustrious Lord**, surnamed Fan, named Tan, presiding over the capture of all monstrous beings in the ghost legions;\n**The Central Capital Prison Warden**, surnamed Han, named Gui, presiding over all unlawful talisman clerks in the world;\n**The Heavenly Altar Lord**, surnamed Wu, named Ku, presiding over all earth altar lords.\n\nTo summon the spirits of the myriad beings, inscribe the talisman in cinnabar on peachwood slips, one foot and six inches in length, and seal it with the Heavenly Emperor’s Envoy talisman. Summon ghosts with the left cord, and the spirits shall arrive instantly. Those who wear the talisman shall be feared by all ghosts. Knowing the names of the great ghosts, none shall dare to cause harm. The names of the earth spirits of all provinces govern their respective counties, townships, and villages within their domains. The earth altar lords must not permit malevolent spirits, ghosts, or demons to consume blood offerings. For the great and small mountain spirits who do not submit, summon them in accordance with the Dharma, and the ghosts shall respond like an echo, arriving instantly. Hasten! Summon and inquire into the origins of matters as required.\n\nThe method for transmitting talismans: adjust the color and dimensions according to the recipient’s birth year. Provide one knife and one pair of rings. The talisman master takes one ring and the accompanying items, while the other is given to the principal to retain as a token of the master’s talisman authority. Those deemed capable may be appointed with the approval of Xu Shen. Do not transmit to unworthy recipients. The principal must examine and deliberate carefully. How could one not be cautious?\n\nHasten! As the statutes and ordinances command.",
      "overlap_context": "the Nine Palaces and Eight Poles**\n- **Twelve Left Celestial Cavalry Envoys**\n- **Twelve Right Celestial Cavalry Envoys**\n- **Twelve Envoys of the Nine Palaces’ Mysterious Upper Realm**\n- **Twelve Left Envoys of the Upper Primordial of the Mysterious**\n- **Twelve Right Envoys of the Upper Primordial of the Mysterious**\n- **Twelve Left Envoys of the Crimson Wolves**\n- **Twelve Right Envoys of the Crimson Wolves**\n- **Twelve Left Envoys of the Pure Wind**\n- **Twelve Right Envoys of the Pure Wind**",
      "start_char": 10251,
      "end_char": 11622,
      "start_sentence": 529,
      "end_sentence": 580,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.810022830963135,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "彻视鬼方 白石英，与鬼将一名鬼督邮、袂苓，三物等，治下筛，服寸圭，见鬼。 又视鬼方 白石英、狭苓、知母，三物分等，治下筛，服刀圭，即见鬼。 又方：鹊子、赤石英及曾青夜光散，葱实、乌药、白石英知母散，皆令人见鬼，即畏生人。 保举 监度 度师 太上三五正一盟威箓卷之三竟 太上三五正一盟威箓卷之四 太上正一星纲五斗录品第九 炁应五月节，其日赀参，镇昌利治，冬至后一百六十五日芒种。 太上正一河图保命录品第十 炁应五月中，其日井，镇隶上治，冬至后一百八十日夏至。 太上正一解六害神虎录品第十一 炁应六月节，其日鬼，镇涌泉治，夏至后一十五日小暑。 太上正一九凤破秽录品第十二 炁应六月中，其日柳，镇稠梗治，夏至后三十日大暑。 太上正一星网五斗筹品第九 镇吕利治左都监熙祭酒，属土，在怀安军金堂县，应紫，参二宿，芒种五月节。 维某年某岁月朔日辰某州郡县乡里，某法箓弟子，某乙本命某某月日时生，上属北斗某星君，言被元始三炁君召，今谨赍法信诣某名山官观太上御前，投某法师门下，求受太上正一星纲五斗箓，即日听署校五百里步纲拜受，一如赤箓律令。 上元将军姓唐名掠，长九十万丈， 中元将军姓李名昌，长七十万丈，",
      "translated_text": "To perceive spirits in the ghostly realms: take white quartz, one ghost general named Ghost Supervisor, and poria, three ingredients in equal measure. Grind them finely, and ingest a one-*cun* measure—ghosts shall appear.\n\nAnother method for perceiving spirits: take white quartz, fuling, and anemarrhena, three ingredients in equal measure. Grind them finely, and ingest a one-*daogui* measure—ghosts shall appear at once.\n\nAnother formula: magpie fledglings, red quartz, azurite, and night-glowing powder; or onion seeds, lindera, white quartz, and anemarrhena powder—all enable one to see ghosts, who shall then fear the living.\n\n*Tai Shang San Wu Zheng Yi Meng Wei Lu*, Scroll Three—concluded.\n*Tai Shang San Wu Zheng Yi Meng Wei Lu*, Scroll Four\n\n**Section Nine: The Register of the Celestial Net and Five Dipper Constellations of the Great Orthodox Unity**\nQi responds to the fifth lunar month’s solar term. On its appointed day, the *zhi* star governs, stabilizing prosperity and governance. One hundred sixty-five days after the winter solstice: Grain in Ear.\n\n**Section Ten: The Yellow River Chart Register for Preserving Life**\nQi responds to the midpoint of the fifth lunar month. On its appointed day, the *jing* star governs, stabilizing the upper regions of governance. One hundred eighty days after the winter solstice: Summer Solstice.\n\n**Section Eleven: The Register for Dissolving the Six Harmful Spirits and the Divine Tiger**\nQi responds to the sixth lunar month’s solar term. On its appointed day, the *gui* star governs, stabilizing the *Yongquan* region. Fifteen days after the summer solstice: Minor Heat.\n\n**Section Twelve: The Register of the Nine Phoenixes for Dispelling Impurities**\nQi responds to the midpoint of the sixth lunar month. On its appointed day, the *liu* star governs, stabilizing the *Chougeng* region. Thirty days after the summer solstice: Major Heat.\n\n**Section Nine: The Star Net and Five Dipper Tallies**\nStabilizes the *Lüli* region under the governance of the Left Capital Supervisor and Director of Rites. Corresponds to earth, located in Huai’an Prefecture’s Jintang County. Aligns with purple, the *can* and *er* constellations, and the Grain in Ear solar term of the fifth lunar month.\n\nIn such-and-such a year, month, and day of a given era, in such-and-such a prefecture, commandery, county, township, and village, the Dharma Register disciple [Name], born on such-and-such a month, day, and hour, whose fate is governed by the [specific] Star Lord of the Northern Dipper, having been summoned by the Lords of the Three Primordial Qi, now respectfully presents ritual offerings to the sacred precincts of [Name] Mountain’s abbey. Seeking initiation under the [Name] Dharma Master, he petitions to receive the *Tai Shang Zheng Yi Star Net and Five Dipper Register*. From this day forth, he shall be permitted to receive and uphold the five-hundred-*li* step-net register, in accordance with the Red Register’s statutes and ordinances.\n\nUpper Prime General: surname Tang, given name Lüe, height ninety myriad *zhang*.\nMiddle Prime General: surname Li, given name Chang, height seventy myriad *zhang*.",
      "overlap_context": " and dimensions according to the recipient’s birth year. Provide one knife and one pair of rings. The talisman master takes one ring and the accompanying items, while the other is given to the principal to retain as a token of the master’s talisman authority. Those deemed capable may be appointed with the approval of Xu Shen. Do not transmit to unworthy recipients. The principal must examine and deliberate carefully. How could one not be cautious?\n\nHasten! As the statutes and ordinances command.",
      "start_char": 11623,
      "end_char": 12162,
      "start_sentence": 581,
      "end_sentence": 603,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.28959584236145,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "下元将军姓徐名宗，长五十万丈， 上元三五伐神功曹姓华名宏，领兵千万人， 中元三五伐神功曹姓田名同福，领兵千万人， 下元三五伐神功曹姓温名仲舒，领兵千万人， 东斗功曹一十五人， 南斗功曹一十五人， 西斗功曹一十五人， 北斗功曹一十五人， 中斗功曹一十五人， 岁星功曹一十五人， 荧惑功曹一十五人， 辰星功曹一十五人， 镇星功曹一十五人， 太白功曹一十五人， 生炁功曹一十五人， 三五九星功曹一十五人， 真人先生功曹一十五人， 三五九姓功曹一十五人， 九天七星功曹一十五人， 九炁中元功曹一十五人， 金伐童子一千二百人， 开纲童子一千二百人， 僮天僮地一千二百人， 三五童子一千二百人， 平元力士一千二百人， 五斗小吏一千二百人。 卷内符图并朱书。 太上正一河图保命箓品第十 镇隶上治右都监炁祭酒，属土，在汉州德阳县，应井宿，夏至五月中。 某法箓弟子某乙，命属北斗某星君，即日谨赍法信奉诣某法师门下，拜受太上正一河图保命箓中宫八海三河要诀，河图秘篆箓中将军三百二十万人，营护某乙身形，保身护命，长生延年，消灾解厄，涉历河海龙王，保守风波静息，急急如太上老君律令。 玄老玄留大将军十万人， 玄老通天大将军十万人，",
      "translated_text": "Lower Prime General: surname Xu, given name Zong, height fifty myriad *zhang*.\nUpper Prime Three-Five Punitive Deity Attendant: surname Hua, given name Hong, commanding a host of ten million.\nMiddle Prime Three-Five Punitive Deity Attendant: surname Tian, given name Tongfu, commanding a host of ten million.\nLower Prime Three-Five Punitive Deity Attendant: surname Wen, given name Zhongshu, commanding a host of ten million.\nEastern Dipper Attendants: fifteen.\nSouthern Dipper Attendants: fifteen.\nWestern Dipper Attendants: fifteen.\nNorthern Dipper Attendants: fifteen.\nCentral Dipper Attendants: fifteen.\nJupiter Attendants: fifteen.\nMars Attendants: fifteen.\nMercury Attendants: fifteen.\nSaturn Attendants: fifteen.\nVenus Attendants: fifteen.\nGenerative Qi Attendants: fifteen.\nThree-Five Nine Star Attendants: fifteen.\nPerfected Masters Attendants: fifteen.\nThree-Five Nine Surnames Attendants: fifteen.\nNine Heavens Seven Star Attendants: fifteen.\nNine Qi Middle Prime Attendants: fifteen.\nMetal-Punitive Lads: one thousand two hundred.\nRegister-Opening Lads: one thousand two hundred.\nCelestial and Terrestrial Lads: one thousand two hundred.\nThree-Five Lads: one thousand two hundred.\nLeveling Prime Valiant Guards: one thousand two hundred.\nFive Dipper Petty Officers: one thousand two hundred.\nThe scroll contains talismans and diagrams, all inscribed in vermilion.\n\n*Tai Shang Zheng Yi He Tu Preserving Life Register*, Chapter Ten\nThe Supervisor of the Right Bureau of the Upper Precinct, subordinate to the Minister of Qi and Sacrifices, is of the earth phase, located in Deyang County of Hanzhou, corresponding to the Well Mansion, during the mid-summer fifth month.\n\nThe Dharma Register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, on this day respectfully presents ritual offerings to the abode of [Name] Dharma Master, petitioning to receive the *Tai Shang Zheng Yi He Tu Preserving Life Register*’s Central Palace Eight Seas Three Rivers Essential Instructions, the *He Tu* Secret Seal Register’s Central General of three million two hundred thousand, who encamp to protect [Name]’s bodily form, preserve life and guard destiny, prolong years and extend longevity, dispel calamities and resolve adversities, traverse rivers and seas under the Dragon Kings’ dominion, ensuring wind and waves remain tranquil. Swiftly, swiftly, in accordance with the statutes and ordinances of the Most High Lord Lao.\n\nMysterious Elder Mysterious Remnant Great General: one hundred thousand.\nMysterious Elder Penetrating Heaven Great General: one hundred thousand.",
      "overlap_context": "cts of [Name] Mountain’s abbey. Seeking initiation under the [Name] Dharma Master, he petitions to receive the *Tai Shang Zheng Yi Star Net and Five Dipper Register*. From this day forth, he shall be permitted to receive and uphold the five-hundred-*li* step-net register, in accordance with the Red Register’s statutes and ordinances.\n\nUpper Prime General: surname Tang, given name Lüe, height ninety myriad *zhang*.\nMiddle Prime General: surname Li, given name Chang, height seventy myriad *zhang*.",
      "start_char": 12162,
      "end_char": 12730,
      "start_sentence": 604,
      "end_sentence": 635,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.615146160125732,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "玄老周天大将军十万人， 玄老建天大将军十万人， 玄老中玄大将军十万人， 玄老中诚大将军十万人， 玄老中魄大将军十万人， 玄老前效大将军十万人， 玄老盖天大将军十万人， 玄老五桑大将军十万人， 玄老车中大将军十万人， 玄老越天大将军十万人， 玄老五盖大将军十万人， 玄老灵天大将军十万人， 太上九开大将军十万人， 太上中邪大将军十万人， 太上黄盖大将军十万人， 太上校虎大将军十万人， 太上五诛大将军十万人， 太上修天大将军十万人， 太上北部大将军十万人， 太上中越大将军十万人， 太上太营大将军十万人， 太上九炁大将军十万人， 太上南方赤镇大将军十万人， 太上北方黑镇大将军十万人， 太上东方青镇大将军十万人， 太上中央黄镇大将军十万人， 太上西方白镇大将军十万人， 太上中建大将军十万人， 太上青盖大将军十万人， 太上左右二将军十万人。 右合三十二部大将军天兵，随逐某乙，身中扶护，急急如律令。 太上正解六害神符箓品第十一 镇涌泉治左监神炁祭酒，属水，在汉州德阳县，应鬼宿，小暑六月节。 某法箓弟子某乙，命属北斗某星君，今谨赍法信诣某法师门下，拜受太上太一君无极太上元一君无极解六害秘箓，天帝所生，皇天养我，皇地载我，日月照我，北斗辅我，山川通我，万灵佑我，百神侍我，阴阳扶我，风伯送我，紫云盖我，神药治我，往来无极，入海出天，门入河出，地户司命，与我天厨，饴我何求，不得何指，不测一食，千岁连命，日月与天，元穷与地，无极登升，天机驾魁，乘罔所向者，伏所指者，亡我受太上天帝教令，谁敢有当，龙虎扶我，朱雀导我，玄武从我，左阳青龙，右阴白虎，头戴七星，法应天斗司命留我，司录护我，疾病离我，盗贼避我，所求皆得，所厌皆伏，踰河渡海，风浪不起，虎狼见我，摧牙折齿，丹书为符，凶咎灭亡，禹为除道，蚩尤避兵，天符地节，前开后闭，延年无极，与天同毕，急急如玉令。 太上正一九凤破秽箓品第十二 镇稠梗治右监神炁祭酒，属水，在蜀州新津县，应柳宿，大暑六月中。 某法箓弟子某乙，命属北斗某星君，今谨赍法信诣某法师门下，请受太上正一九凤破秽箓受佩，一如律令。 谨请东西南北解秽神君，主消淹秽之厄，延年益命，辟邪除凶，保定魄魂，聪明耳目，禳灾度厄，安附身神，急急如律令。 谨请破秽君五人官将百二十人， 谨请却秽君五人官将百二十人， 谨请灭秽君五人官将百二十人， 谨请荡秽君五人官将百二十人， 谨请除秽君五人官将百二十人， 谨请收秽君五人官将百二十人， 谨请运秽君五人官将百二十人， 谨请解秽君五人官将百二十人， 谨请洗秽君五人官将百二十人， 谨请斩秽君五人官将百二十人， 太上三五正一盟威采春之四竟 太上三五正一盟威箓卷之五",
      "translated_text": "Mysterious Elder Circumambient Heaven Great General: one hundred thousand.\nMysterious Elder Establishing Heaven Great General: one hundred thousand.\nMysterious Elder Central Mystery Great General: one hundred thousand.\nMysterious Elder Central Sincerity Great General: one hundred thousand.\nMysterious Elder Central Po Great General: one hundred thousand.\nMysterious Elder Frontal Efficacy Great General: one hundred thousand.\nMysterious Elder Heaven-Covering Great General: one hundred thousand.\nMysterious Elder Five Mulberries Great General: one hundred thousand.\nMysterious Elder Chariot-Central Great General: one hundred thousand.\nMysterious Elder Transcendent Heaven Great General: one hundred thousand.\nMysterious Elder Five Canopies Great General: one hundred thousand.\nMysterious Elder Numinous Heaven Great General: one hundred thousand.\nMost High Ninefold Opening Great General: one hundred thousand.\nMost High Central Malevolence Great General: one hundred thousand.\nMost High Yellow Canopy Great General: one hundred thousand.\nMost High Tiger-Subduing Great General: one hundred thousand.\nMost High Fivefold Punishment Great General: one hundred thousand.\nMost High Cultivating Heaven Great General: one hundred thousand.\nMost High Northern Division Great General: one hundred thousand.\nMost High Central Transcendence Great General: one hundred thousand.\nMost High Grand Encampment Great General: one hundred thousand.\nMost High Nine Qi Great General: one hundred thousand.\nMost High Southern Red Guard Great General: one hundred thousand.\nMost High Northern Black Guard Great General: one hundred thousand.\nMost High Eastern Bluegreen Guard Great General: one hundred thousand.\nMost High Central Yellow Guard Great General: one hundred thousand.\nMost High Western White Guard Great General: one hundred thousand.\nMost High Central Establishment Great General: one hundred thousand.\nMost High Bluegreen Canopy Great General: one hundred thousand.\nMost High Left and Right Two Generals: one hundred thousand.\nAbove, totaling thirty-two divisions of Great Generals and heavenly soldiers, who follow and attend [Name], protecting within the body. Swiftly, swiftly, in accordance with the statutes and ordinances.\n\n*Tai Shang Zheng Yi Resolving the Six Harms Divine Talisman Register*, Chapter Eleven\n**Governor of the Gushing Spring, Ruling the Left Supervisor Spirit Qi Ritual Libationer**, affiliated with Water, located in Deyang County of Hanzhou, corresponding to the Ghost Star, at the Minor Heat solar term of the sixth lunar month.\n\n[Name], a disciple of the Dharma Registers, whose destiny is governed by the [Name] Star Lord of the Northern Dipper, now respectfully presents ritual offerings to the abode of [Name] Dharma Master, petitioning to receive the *Tai Shang Tai Yi Lord’s Limitless Most High Primordial Unity Lord’s Limitless Resolving the Six Harms Secret Register*, born of the Heavenly Thearch, nurtured by August Heaven, borne by August Earth, illumined by the Sun and Moon, assisted by the Northern Dipper, traversing mountains and rivers, protected by the myriad spirits, attended by the hundred gods, supported by yin and yang, escorted by the Wind Earl, sheltered by purple clouds, healed by divine medicines. Coming and going without limit, entering the sea and emerging in heaven, passing through gates into rivers and exiting through earthly portals, the Destiny Controller of the Earthly Door grants me the Heavenly Kitchen. What do I seek to be fed? What do I lack to be provided? One meal is unfathomable, a thousand years linked to destiny. The Sun and Moon align with Heaven, the limitless with Earth. Ascending without end, the celestial mechanism harnesses the stellar pivots. Wherever I ride, whatever I point toward—none dare oppose me, for I receive the teachings and commands of the Most High Heavenly Thearch. Dragons and tigers support me, the Vermilion Bird guides me, the Dark Warrior follows me. On the left, the yang-aligned Bluegreen Dragon; on the right, the yin-aligned White Tiger. My head bears the Seven Stars, aligning with the Celestial Dipper to command destiny and retain my life. The Recorder protects me, illnesses depart from me, thieves and bandits avoid me. All I seek is attained, all I suppress is subdued. Crossing rivers and traversing seas, wind and waves do not rise. Tigers and wolves seeing me break their fangs and teeth. The cinnabar script serves as a talisman—misfortunes and calamities perish. Yu clears the path, Chiyou averts warfare. Heavenly talismans and earthly seals open before and close behind. Longevity is without limit, enduring as Heaven itself. Swiftly, swiftly, in accordance with the Jade Decree.\n\n*Tai Shang Zheng Yi Nine Phoenixes Dispelling Defilement Register*, Chapter Twelve\n**Governor of the Dense Thicket, Ruling the Right Supervisor Spirit Qi Ritual Libationer**, affiliated with Water, located in Xinjin County of Shuzhou, corresponding to the Willow Star, at the Major Heat solar term of the sixth lunar month.\n\n[Name], a disciple of the Dharma Registers, whose destiny is governed by the [Name] Star Lord of the Northern Dipper, now respectfully presents ritual offerings to the abode of [Name] Dharma Master, petitioning to receive and wear the *Tai Shang Zheng Yi Nine Phoenixes Dispelling Defilement Register*. As decreed by the statutes and ordinances.\n\nRespectfully invoking the East, West, South, and North Dispelling Defilement Spirit Lords, who govern the resolution of submerged defilements’ adversities, prolonging years and enhancing destiny, repelling malevolence and eliminating misfortune, securing the po and hun souls, sharpening hearing and vision, averting disasters and transcending adversities, pacifying and attaching the body’s spirits. Swiftly, swiftly, in accordance with the statutes and ordinances.\n\nRespectfully invoking the Five Breaking Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Repelling Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Eradicating Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Scouring Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Removing Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Gathering Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Transporting Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Resolving Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Washing Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Beheading Defilement Lords and their one hundred twenty officials and generals.\n\n*Tai Shang San Wu Zheng Yi Alliance of Might Register, Fourth Section of the Spring Gathering* concludes.\n*Tai Shang San Wu Zheng Yi Alliance of Might Register, Scroll the Fifth*",
      "overlap_context": "sand, who encamp to protect [Name]’s bodily form, preserve life and guard destiny, prolong years and extend longevity, dispel calamities and resolve adversities, traverse rivers and seas under the Dragon Kings’ dominion, ensuring wind and waves remain tranquil. Swiftly, swiftly, in accordance with the statutes and ordinances of the Most High Lord Lao.\n\nMysterious Elder Mysterious Remnant Great General: one hundred thousand.\nMysterious Elder Penetrating Heaven Great General: one hundred thousand.",
      "start_char": 12730,
      "end_char": 13933,
      "start_sentence": 636,
      "end_sentence": 685,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.481734037399292,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "太上正一都章毕印箓品第十三 炁应七月节，其日星，镇北平治，夏至后四十五日立秋。 太上正一斩邪华盖箓品第十四 炁应七月中，其日张，镇本竹治，夏至后六十日处暑。 太上正一九天兵符箓品第十五 炁应八月节，其日翼，镇蒙秦治，夏至后七十五日白露。 太上正一九官捍厄箓品第十六 炁应八月中，其日较，镇平盖治，夏至后九十日秋分。 太上正一都章毕印箓品第十三 镇北平治左监察炁祭酒，属金，在眉州彭山县，应星宿，立秋七月节。 某法箓弟子某乙，命属北斗某星君，今谨赍法信诣某法师门下，奉受太上正一都章毕印箓千二百印章，真言要语，长生之术，二十四玉女等，内以治身，外以救人，宣扬道教，助国扶命，医治百姓，拯救苍生，某受法之后，誓不违科，一旦背向异辞，欺师妄道诽谤之愆，某身谢天地水三官，皆被风刀之考，七祖引对，急急如律令。 华盖玉女二十四人， 摩镜玉女二十四人，",
      "translated_text": "*The Supreme Orthodox Unity Register of the Complete Seal of All Chapters, Section the Thirteenth*\nQi aligns with the seventh lunar month’s solar term. Its stellar day is *Xing*. It governs the Northern Peace Abode. The Autumn Commencement falls forty-five days after the Summer Solstice.\n\n*The Supreme Orthodox Unity Register of the Florid Canopy for Beheading Demons, Section the Fourteenth*\nQi aligns with the mid-seventh lunar month. Its stellar day is *Zhang*. It governs the Root Bamboo Abode. The Limit of Heat falls sixty days after the Summer Solstice.\n\n*The Supreme Orthodox Unity Register of the Nine Heavens’ Military Talismans, Section the Fifteenth*\nQi aligns with the eighth lunar month’s solar term. Its stellar day is *Yi*. It governs the Meng Qin Abode. The White Dew falls seventy-five days after the Summer Solstice.\n\n*The Supreme Orthodox Unity Register of the Nine Offices’ Warding Calamities, Section the Sixteenth*\nQi aligns with the mid-eighth lunar month. Its stellar day is *Jiao*. It governs the Level Canopy Abode. The Autumnal Equinox falls ninety days after the Summer Solstice.\n\n*The Supreme Orthodox Unity Register of the Complete Seal of All Chapters, Section the Thirteenth*\nThe Northern Peace Abode’s Left Censor of Qi, Libationer, pertains to Metal. Located in Meishan County of Meizhou, it corresponds to the *Xing* constellation. The Autumn Commencement falls on the seventh lunar month’s solar term.\n\nThe disciple of the register, [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, now respectfully presents ritual offerings to the master’s gate to receive the *Supreme Orthodox Unity Register of the Complete Seal of All Chapters*—one thousand two hundred seal-chapters, essential incantations, and the arts of longevity. Along with the twenty-four Jade Maidens, these are to be employed inwardly for self-cultivation and outwardly for saving others, propagating the Daoist teachings, aiding the state and sustaining fate, healing the common folk, and delivering all living beings. After receiving this register, [Name] vows never to violate its precepts. Should there ever be a turning away, false speech, deceit of the master, or slander of the Dao, [Name]’s person shall be punished by the Three Officials of Heaven, Earth, and Water, subjected to the trials of the Wind Blade. The seven generations of ancestors shall be summoned to judgment. *Swiftly, swiftly, as decreed by statute and ordinance!*\n\nTwenty-four Jade Maidens of the Florid Canopy,\nTwenty-four Jade Maidens of the Polishing Mirror,",
      "overlap_context": "ly invoking the Five Resolving Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Washing Defilement Lords and their one hundred twenty officials and generals,\nRespectfully invoking the Five Beheading Defilement Lords and their one hundred twenty officials and generals.\n\n*Tai Shang San Wu Zheng Yi Alliance of Might Register, Fourth Section of the Spring Gathering* concludes.\n*Tai Shang San Wu Zheng Yi Alliance of Might Register, Scroll the Fifth*",
      "start_char": 13933,
      "end_char": 14330,
      "start_sentence": 686,
      "end_sentence": 698,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.272774696350098,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "清灵玉女二十四人， 治病玉女二十四人， 按摩玉女二十四人， 周城玉女二十四人， 挥印玉女二十四人， 印中玉女二十四人， 守印玉女二十四人， 着印玉女二十四人， 升印玉女二十四人， 星药玉女二十四人， 感药玉女二十四人， 放药玉女二十四人， 盖药玉女二十四人， 将药玉女二十四人， 捉药玉女二十四人， 行印玉女二十四人。 右一十八部用印玉女，合四百三十二人，度某乙身中 上仙都促炁功曹十二人北斗君， 上仙都治病功曹十二人太一君， 上仙都天真使者十二人天一君， 上仙都中部使者十二人三炁君， 上仙都正一功曹十二人南斗君， 上仙都直事使者功曹十二人华盖君。 右六部功曹，合七十二人，度某乙身中。 甲子神将符木板从官百二十人， 甲戌神将咒丘明从官百二十人， 甲申神将邓西岳从官百二十人， 甲午神将扶天岳从官百二十人， 甲辰神将孟非卿从官百二十人， 甲寅神将享于始从官百二十人， 甲戌玉女飞廉， 甲子玉女华翼， 甲午玉女素精， 甲申玉女素石， 甲寅玉女惠精， 甲辰玉女开朝藉， 丁丑玉女赵子玉， 丁卯玉女司马卿， 丁酉玉女臧文公， 丁亥玉女张文通， 丁巳玉女崔巨卿， 丁未玉女石叔卿， 癸未玉女吕威明， 癸酉玉女孙仲房， 癸卯玉女苏他家， 癸巳玉女史公来， 癸亥玉女左石松， 癸丑玉女江汉卿。 右六甲六丁六癸玉女，度某乙身中。 太上正一斩邪华盖箓品第十四 镇本竹治右监察炁祭酒，属水，在蜀 州新津县，应张宿，处暑七月中。 某法箓弟子某乙，命属北斗某星 君，言被中皇直使司命无形君召，本意 志仙安魂定魄，义在不死，心和体正， 五宫六府，道一所处，元一飞神，三五 华盖，斩邪仙箓，某以未佩，有负先约， 科行有功，今资法信，诣某法师门下， 请受太上正一斩邪华盖箓，箓中考邪 鬼吏，随逐某身佩受之后，不敢泄露要 文，一如前约律令。 直使功曹二人，",
      "translated_text": "Twenty-four Jade Maidens of Pure Numinosity,\nTwenty-four Jade Maidens of Healing Illness,\nTwenty-four Jade Maidens of Massage,\nTwenty-four Jade Maidens of Circumambulating the City,\nTwenty-four Jade Maidens of Wielding the Seal,\nTwenty-four Jade Maidens Within the Seal,\nTwenty-four Jade Maidens of Guarding the Seal,\nTwenty-four Jade Maidens of Affixing the Seal,\nTwenty-four Jade Maidens of Ascending the Seal,\nTwenty-four Jade Maidens of Stellar Medicines,\nTwenty-four Jade Maidens of Sensing Medicines,\nTwenty-four Jade Maidens of Dispensing Medicines,\nTwenty-four Jade Maidens of Covering Medicines,\nTwenty-four Jade Maidens of Conveying Medicines,\nTwenty-four Jade Maidens of Grasping Medicines,\nTwenty-four Jade Maidens of Enacting the Seal.\n\nThe above eighteen divisions of seal-wielding Jade Maidens, totaling four hundred thirty-two persons, are transmitted into the body of [Name], together with:\n\nTwelve Celestial Officers of Qi Promotion of the Upper Immortals, the Northern Dipper Lord,\nTwelve Celestial Officers of Healing Illness of the Upper Immortals, the Grand One Lord,\nTwelve Celestial Envoys of Heavenly Perfection of the Upper Immortals, the Heavenly One Lord,\nTwelve Central Division Envoys of the Upper Immortals, the Three Qi Lords,\nTwelve Celestial Officers of Orthodox Unity of the Upper Immortals, the Southern Dipper Lord,\nTwelve Attendant Envoys and Celestial Officers of the Upper Immortals, the Florid Canopy Lord.\n\nThe above six divisions of celestial officers, totaling seventy-two persons, are transmitted into the body of [Name].\n\nOne hundred twenty subordinate officials of the *Jiǎzǐ* Divine General of the Talisman Wooden Tablet,\nOne hundred twenty subordinate officials of the *Jiǎxū* Divine General of the Incantation Mound,\nOne hundred twenty subordinate officials of the *Jiǎshēn* Divine General of Mount Dengxi,\nOne hundred twenty subordinate officials of the *Jiǎwǔ* Divine General of Supporting Heaven,\nOne hundred twenty subordinate officials of the *Jiǎchén* Divine General of Meng Feiqing,\nOne hundred twenty subordinate officials of the *Jiǎyín* Divine General of Xiang Yushi.\n\nThe Jade Maidens of *Jiǎxū*: Feilian,\nThe Jade Maidens of *Jiǎzǐ*: Huayi,\nThe Jade Maidens of *Jiǎwǔ*: Sujing,\nThe Jade Maidens of *Jiǎshēn*: Sushi,\nThe Jade Maidens of *Jiǎyín*: Huijing,\nThe Jade Maidens of *Jiǎchén*: Kaichao Ji.\n\nThe Jade Maidens of *Dīngchǒu*: Zhao Ziyu,\nThe Jade Maidens of *Dīngmǎo*: Sima Qing,\nThe Jade Maidens of *Dīngyǒu*: Zang Wengong,\nThe Jade Maidens of *Dīnghài*: Zhang Wentong,\nThe Jade Maidens of *Dīngsì*: Cui Juqing,\nThe Jade Maidens of *Dīngwèi*: Shi Shuqing.\n\nThe Jade Maidens of *Guǐwèi*: Lü Weiming,\nThe Jade Maidens of *Guǐyǒu*: Sun Zhongfang,\nThe Jade Maidens of *Guǐmǎo*: Su Tajia,\nThe Jade Maidens of *Guǐsì*: Shi Gonglai,\nThe Jade Maidens of *Guǐhài*: Zuo Shisong,\nThe Jade Maidens of *Guǐchǒu*: Jiang Hanqing.\n\nThe above Jade Maidens of the Six *Jiǎ*, Six *Dīng*, and Six *Guǐ* are transmitted into the body of [Name].\n\n*Register of the Orthodox Unity Florid Canopy for Beheading Demons, Fourteenth Scroll*\nEngraved bamboo slip, overseen by the Inspector of Qi, the Libationer—attributed to Water, stationed in Shu Prefecture, Xinjin County, corresponding to the *Zhang* constellation, during the *Chushu* solar term of the seventh month.\n\nThe register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, having been summoned by the Invisible Lord of Life Mandate of the Central August Direct Envoys, with the original intent of stabilizing the hun and po souls, aspiring to immortality, harmonizing heart and rectifying body, where the Five Palaces and Six Repositories reside, where the Dao unifies all, where the primordial qi takes flight as spirit, and where the Three-and-Five Florid Canopy beheads demonic registers—[Name], having not yet received this register, has failed the prior covenant. Now, with meritorious conduct in accordance with the statutes, [Name] offers ritual gifts and presents at the gate of the master, requesting to receive the *Register of the Orthodox Unity Florid Canopy for Beheading Demons*. Within this register, demonic officials and ghosts are examined. Upon receiving and wearing it, [Name] shall not dare to disclose its essential texts, as previously sworn by statute and ordinance.\n\nTwo Direct Envoys and Celestial Officers...",
      "overlap_context": "s register, [Name] vows never to violate its precepts. Should there ever be a turning away, false speech, deceit of the master, or slander of the Dao, [Name]’s person shall be punished by the Three Officials of Heaven, Earth, and Water, subjected to the trials of the Wind Blade. The seven generations of ancestors shall be summoned to judgment. *Swiftly, swiftly, as decreed by statute and ordinance!*\n\nTwenty-four Jade Maidens of the Florid Canopy,\nTwenty-four Jade Maidens of the Polishing Mirror,",
      "start_char": 14330,
      "end_char": 15219,
      "start_sentence": 699,
      "end_sentence": 760,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.240867137908936,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "正一功曹二人， 治病功曹二人， 促炁功曹二人， 斩邪功曹二人， 收邪功曹二人， 录邪功曹二人， 捉邪功曹二人， 缚邪吏二人， 鞭邪吏二人， 科东赤符吏二人， 刚凤骑置吏二人， 驿马上章吏二人， 左将军灭亡吏二人， 右将军灭亡吏二人， 乌衣捕邪吏二人， 束方青云收邪吏二人， 南方赤云收邪吏二人， 西方白云收邪吏二人， 北方黑云收邪吏二人， 中央黄云收邪吏二人， 诛邪吏二人， 破邪吏二人， 考邪吏二人。 东方甲乙青始车骑十万人，衣青衣服来屯某乙身中始生门， 南方丙丁赤玄车骑十万人，衣赤衣服来屯某乙身中防生门， 西方庚辛白玄车骑十万人，衣白衣服来屯某乙身中九生门， 北方壬癸黑玄车骑十万人，衣黑衣服来屯某乙身中养生门， 中央黄始司玄车骑十万人，衣黄衣服来屯某乙身中司命门。 太上正一九天兵符箓品第十五 镇蒙秦治左领功炁祭酒，属金，在夔州台登县，应翼宿，白露八月节。 某法箓弟子某乙命属北斗某星君，今谨赍法信诣某法师门下，求受太上正一九天兵符箓受佩一如律令。 谨给道门领理文书救治百姓，专勤不易，行合天中，堪任加署，谨赍五色彩诣臣求受九天兵符，臣昔於某法师门下受符之日，誓传忠良，今辄於太上御前加署九天兵主，领太上天师千二百官君，五方官属，辅助道门，诛除凶逆，血食符庙，奸神伪鬼，众精故炁，因及九年，有功注名阳官，请左神丞相，号九天九地，万鬼中王，昔出之时，天光地赫，万神震动，身长七十二丈，广七十二围，百二十印绶，前后百二十鼓吹，日夜十二时，卫天帝君，伺斩五方鬼众精故炁，以符召万神千鬼俱灭，急急如皇天大帝太上老君律令。 左灭亡君一十二人， 右灭亡君一十二人，",
      "translated_text": "Two Direct Envoys of Orthodox Unity,\nTwo Envoys for Healing Ailments,\nTwo Envoys for Accelerating Qi,\nTwo Envoys for Beheading Demons,\nTwo Envoys for Seizing Demons,\nTwo Envoys for Registering Demons,\nTwo Envoys for Capturing Demons,\nTwo Officers for Binding Demons,\nTwo Officers for Whipping Demons,\nTwo Officers for the Eastern Red Talisman,\nTwo Officers for the Rigid Phoenix Mount,\nTwo Courier Officers for Memorials,\nTwo Officers of the Left General for Annihilation,\nTwo Officers of the Right General for Annihilation,\nTwo Black-Robed Officers for Seizing Demons,\nTwo Eastern Green Cloud Officers for Seizing Demons,\nTwo Southern Red Cloud Officers for Seizing Demons,\nTwo Western White Cloud Officers for Seizing Demons,\nTwo Northern Black Cloud Officers for Seizing Demons,\nTwo Central Yellow Cloud Officers for Seizing Demons,\nTwo Officers for Executing Demons,\nTwo Officers for Smashing Demons,\nTwo Officers for Interrogating Demons.\n\nFrom the East: 100,000 chariots and cavalry of Jia-Yi Green Origin, clad in green robes, come to garrison at the Gate of Primordial Birth within [Name]’s body.\nFrom the South: 100,000 chariots and cavalry of Bing-Ding Red Mystery, clad in red robes, come to garrison at the Gate of Protective Birth within [Name]’s body.\nFrom the West: 100,000 chariots and cavalry of Geng-Xin White Mystery, clad in white robes, come to garrison at the Gate of Ninefold Birth within [Name]’s body.\nFrom the North: 100,000 chariots and cavalry of Ren-Gui Black Mystery, clad in black robes, come to garrison at the Gate of Nurturing Birth within [Name]’s body.\nFrom the Center: 100,000 chariots and cavalry of the Yellow Origin Controller of Mystery, clad in yellow robes, come to garrison at the Gate of Life Controller within [Name]’s body.\n\n*Register of the Orthodox Unity Nine Heavens’ Military Talismans*, Chapter Fifteen\nZhen Meng of Qin Prefecture, Left Chief of Qi Cultivation and Libationer, affiliated with Metal, stationed in Kuizhou Taideng County, corresponding to the Wing constellation, during the White Dew solar term of the eighth month.\n\nThe register disciple [Name], whose fate is governed by the [specific] Star Lord of the Northern Dipper, now respectfully presents ritual gifts at the gate of the master, requesting to receive and wear the *Register of the Orthodox Unity Nine Heavens’ Military Talismans*, in accordance with the statutes and ordinances.\n\nDuly appointed to manage Daoist documents for the salvation and healing of the people, diligent and unwavering, conduct aligned with the celestial realm, deemed worthy of promotion and endorsement. Respectfully presenting five-colored silks, [Name] seeks to receive the Nine Heavens’ Military Talismans. When I formerly received these talismans at the gate of the master, I swore to transmit them only to the loyal and virtuous. Now, in the presence of the Most High, I endorse [Name] as the Master of the Nine Heavens’ Military Talismans, commanding the 1,200 Official Lords of the Celestial Master and the officials of the Five Directions, to assist the Daoist gate, execute the rebellious, nourish the talismanic shrines, and eradicate false spirits, wayward ghosts, and residual qi. After nine years of meritorious service, [Name]’s name shall be inscribed among the officials of the Yang realm, appointed as the Left Divine Chancellor, titled King of the Nine Heavens and Nine Earths, Sovereign over Myriad Ghosts. When first manifested, heaven blazed and earth radiated, myriad spirits trembled. [Name]’s stature spans seventy-two zhang in height and seventy-two wei in girth, bearing one hundred twenty seals and cords, accompanied by one hundred twenty processional musicians before and behind. Day and night, through the twelve hours, [Name] guards the Heavenly Thearch, awaiting to behead the ghostly multitudes and residual qi of the Five Directions. With this talisman, summoning the myriad spirits and thousand ghosts shall result in their annihilation. Swiftly, swiftly, in accordance with the statutes and ordinances of the August Heaven, the Great Emperor, and the Most High Lord Lao.\n\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right,",
      "overlap_context": "r, has failed the prior covenant. Now, with meritorious conduct in accordance with the statutes, [Name] offers ritual gifts and presents at the gate of the master, requesting to receive the *Register of the Orthodox Unity Florid Canopy for Beheading Demons*. Within this register, demonic officials and ghosts are examined. Upon receiving and wearing it, [Name] shall not dare to disclose its essential texts, as previously sworn by statute and ordinance.\n\nTwo Direct Envoys and Celestial Officers...",
      "start_char": 15219,
      "end_char": 15968,
      "start_sentence": 761,
      "end_sentence": 794,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.548646211624146,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "东方青领将军九人，青衣兵士八十一万众来屯左， 左灭亡君一十二人， 右灭亡君一十二人， 西方白领将军七人，白衣兵士四十九万众来屯右， 左灭亡君一十二人， 右灭亡君一十二人， 南方赤领将军八人，赤衣兵士六十四万众来屯前， 左灭亡君一十二人， 右灭亡君一十二人， 北方黑领将军五人，黑衣兵士二十五万众来屯后， 东方青始甲乙君车骑千人衣青二各持泰始青炁来屯某乙始生门， 南方赤玄丙丁君车骑千人衣赤，各持太初赤炁来屯某乙防生门， 西方白玄庚辛君车骑千人衣白，各持太素白炁来屯某乙九生门， 北方黑玄壬癸君车骑千人衣黑，各持太玄黑炁来屯某乙养生门， 中央司玄戊己君车骑千人衣黄，各持太始黄炁来屯某乙司命门， 东方夷老君除逆部伏卫兵， 南方越老君扁鹊伏卫兵， 西方氐老君官死伏卫兵， 北方羌老君及甲错鳞兵， 中央秦老君将领黄兵， 千二百官中央将军身长二十四丈，广十二围，头戴金积冠，百二十印绶，天帝元始召九天符，新出老君传领民祭酒，召九天五方鬼神一切降伏。 太上施虎贲兵三十万众，主收天下荧惑逆鬼邪炁， 太上施天兵三十万众，主收九天乱道逆鬼故炁， 太上发地兵四十万众，主收破地上妄称帝王不正逆鬼， 太上九天丈人兵四十万众，主收散作无端百恶横行鬼， 太上营兵四十万众，主收地上破坏治化五方不正鬼， 太上柱二天兵四十万众，主收食俗时粮血食为灾鬼， 太上青盖兵四十万人， 太上赤盖兵四十万人， 太上白盖兵四十万人， 太上黑盖兵四十万人， 太上黄盖兵四十万人。 东方青炁君兵百千万重来屯某乙左边， 南方赤炁君兵百千万重来屯某乙右边， 西方白炁君兵百千万重来屯某乙前， 北方黑炁君兵百千万重来屯某乙后， 中央黄炁君兵百千万重来屯某乙身中， 以时传度付某乙身中，各保五方炁侯， 如所列下九兵符辟五方恶逆之鬼贼不正鬼炁，所在里域，速令一切伏灭急急如太上老君律令。 左无上柱天兵四十万人，主收大惑鬼， 右无上五种三十万人，主收新来鬼， 左无上中宫五营兵三十万人，主收大逆鬼， 右无上域门兵三十万人，主收不道鬼， 左无上中大兵三十万人，主收精邪鬼， 右无上九无中野兵三十万人，主收千正鬼， 左无上领天兵三十万人，主收北无逆鬼， 右无上七部官将，主收天地水三官五方不正神奸诈恐动治民者， 玄老玄留大将军十万人， 玄老周天大将军十万人， 玄老中玄大将军十万人， 玄老五无大将军十万人， 玄老盖天大将军十万人， 玄老九天大将军十万人， 玄老中律大将军十万人， 玄老建玄大将军十万人， 玄老还天大将军十万人， 玄老中域大将军十万人， 玄老中微大将军十万人， 玄老中庭大将军十万人， 玄老九天丈人兵十万人，主收亡女称师教者治之， 太上西域兵四十万人，主收新出逆鬼， 太上宫门大兵四十万人，主收新斩大逆鬼， 太上南溪兵四十万人，主收百二十作城天皇鬼， 太上营门兵四十万人，主收角抵鬼， 太上发地兵四十万人，主收天皇鬼， 太上督天兵四十万人，主收自称帝鬼， 太上前受大兵四十万人，主收社灶鬼， 太上北方三秦兵四十万人，主收客死鬼， 太上越天大将军四十万人， 太上正天大将军四十万人， 太上九道大将军四十万人，",
      "translated_text": "Nine Green-Collar Generals of the East, leading 810,000 green-clad soldiers, assemble to the left;\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right.\n\nSeven White-Collar Generals of the West, leading 490,000 white-clad soldiers, assemble to the right;\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right.\n\nEight Red-Collar Generals of the South, leading 640,000 red-clad soldiers, assemble to the front;\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right.\n\nFive Black-Collar Generals of the North, leading 250,000 black-clad soldiers, assemble to the rear.\n\nFrom the East, the Azure Origin Generals Jia and Yi, with a thousand chariots and cavalry clad in azure, each wielding the Primordial Azure Qi, assemble at the Gate of Beginning Life.\nFrom the South, the Vermilion Origin Generals Bing and Ding, with a thousand chariots and cavalry clad in red, each wielding the Primordial Crimson Qi, assemble at the Gate of Guarding Life.\nFrom the West, the White Origin Generals Geng and Xin, with a thousand chariots and cavalry clad in white, each wielding the Pristine White Qi, assemble at the Nine Gates of Life.\nFrom the North, the Black Origin Generals Ren and Gui, with a thousand chariots and cavalry clad in black, each wielding the Supreme Dark Qi, assemble at the Gate of Nurturing Life.\nFrom the Center, the Yellow Origin Generals Wu and Ji, with a thousand chariots and cavalry clad in yellow, each wielding the Primordial Yellow Qi, assemble at the Gate of the Controller of Destiny.\n\nThe Lord of the Eastern Yi, eliminating the rebellious and guarding the troops;\nThe Lord of the Southern Yue, Bian Que, guarding the troops;\nThe Lord of the Western Di, commanding the troops of the dead;\nThe Lord of the Northern Qiang, with armored scaled troops;\nThe Lord of the Central Qin, leading the yellow-clad soldiers.\n\nThe Central General of the Twelve Hundred Officers, standing twenty-four zhang in height and twelve wei in girth, crowned with a golden headdress, bearing one hundred twenty seals and cords. The Heavenly Thearch and Primordial Beginning summon the talismans of the Nine Heavens; the newly manifested Lord Lao transmits them to the libationer of the people’s sacrifices, commanding the ghosts and spirits of the Five Directions of the Nine Heavens to submit and obey.\n\nThe Most High deploys 300,000 Tiger-Rushing Soldiers to capture the delusive and rebellious ghosts and perverse qi across the world.\nThe Most High deploys 300,000 Heavenly Soldiers to capture the chaotic and rebellious ghosts and residual qi of the Nine Heavens.\nThe Most High dispatches 400,000 Earthly Soldiers to capture the false claimants of imperial title and unrighteous ghosts upon the earth.\nThe Most High commands 400,000 Soldiers of the Nine Heavens’ Venerable Elder to capture the scattered and wanton ghosts of a hundred evils.\nThe Most High commands 400,000 Camp Soldiers to capture the earthly ghosts that disrupt governance and the unrighteous spirits of the Five Directions.\nThe Most High commands 400,000 Soldiers of the Two Heavenly Pillars to capture the ghosts that consume seasonal offerings and blood sacrifices, bringing calamity.\nThe Most High commands 400,000 Soldiers of the Azure Canopy,\n400,000 Soldiers of the Crimson Canopy,\n400,000 Soldiers of the White Canopy,\n400,000 Soldiers of the Black Canopy,\n400,000 Soldiers of the Yellow Canopy.\n\nThe Azure Qi Generals’ soldiers, layer upon layer, assemble to the left of [Name];\nThe Crimson Qi Generals’ soldiers, layer upon layer, assemble to the right of [Name];\nThe White Qi Generals’ soldiers, layer upon layer, assemble to the front of [Name];\nThe Black Qi Generals’ soldiers, layer upon layer, assemble to the rear of [Name];\nThe Yellow Qi Generals’ soldiers, layer upon layer, assemble at the center of [Name].\nTransmit and confer these upon [Name], each guarding the qi of the Five Directions.\nAs the nine armies listed below repel the evil and rebellious ghosts and unrighteous qi of the Five Directions, swiftly command all to submit and be annihilated. Swiftly, swiftly, in accordance with the statutes and ordinances of the Most High Lord Lao.\n\n400,000 Soldiers of the Left Supreme Heavenly Pillar, capturing the greatly deluded ghosts;\n300,000 Soldiers of the Right Supreme Five Kinds, capturing the newly arrived ghosts;\n300,000 Soldiers of the Left Supreme Central Palace Five Camps, capturing the greatly rebellious ghosts;\n300,000 Soldiers of the Right Supreme Domain Gate, capturing the unprincipled ghosts;\n300,000 Soldiers of the Left Supreme Central Great Army, capturing the spectral and perverse ghosts;\n300,000 Soldiers of the Right Supreme Nine Wildernesses, capturing the thousand righteous ghosts;\n300,000 Soldiers of the Left Supreme Heavenly Command, capturing the northern rebellious ghosts;\nThe Seven Divisions of Officers and Generals of the Right Supreme, capturing the unrighteous spirits of the Three Officials (Heaven, Earth, Water) and the Five Directions that deceive and disturb the governance of the people.\n\n100,000 Soldiers of the Mysterious Elder’s Mysterious Retainer Great General;\n100,000 Soldiers of the Mysterious Elder’s Circumambient Heaven Great General;\n100,000 Soldiers of the Mysterious Elder’s Central Mysterious Great General;\n100,000 Soldiers of the Mysterious Elder’s Five Absences Great General;\n100,000 Soldiers of the Mysterious Elder’s Heaven-Covering Great General;\n100,000 Soldiers of the Mysterious Elder’s Nine Heavens Great General;\n100,000 Soldiers of the Mysterious Elder’s Central Law Great General;\n100,000 Soldiers of the Mysterious Elder’s Establishing Mysterious Great General;\n100,000 Soldiers of the Mysterious Elder’s Returning Heaven Great General;\n100,000 Soldiers of the Mysterious Elder’s Central Domain Great General;\n100,000 Soldiers of the Mysterious Elder’s Subtle Central Great General;\n100,000 Soldiers of the Mysterious Elder’s Central Court Great General.\n\n100,000 Soldiers of the Nine Heavens’ Venerable Elder, capturing those who falsely claim to be female masters and teachers for punishment.\n\n400,000 Soldiers of the Western Regions, capturing newly emerged rebellious ghosts;\n400,000 Soldiers of the Palace Gate, capturing newly beheaded greatly rebellious ghosts;\n400,000 Soldiers of the Southern Ravine, capturing the 120 city-building Heavenly Sovereign ghosts;\n400,000 Soldiers of the Camp Gate, capturing the horn-butting ghosts;\n400,000 Soldiers of the Dispatched Earth, capturing the Heavenly Sovereign ghosts;\n400,000 Soldiers of the Heavenly Supervisor, capturing the self-proclaimed imperial ghosts;\n400,000 Soldiers of the Front Reception, capturing the altar and stove ghosts;\n400,000 Soldiers of the Northern Three Qin, capturing the ghosts of those who died away from home;\n400,000 Soldiers of the Great General of the Transcendent Heaven;\n400,000 Soldiers of the Great General of the Upright Heaven;\n400,000 Soldiers of the Nine Paths Great General.",
      "overlap_context": "fore and behind. Day and night, through the twelve hours, [Name] guards the Heavenly Thearch, awaiting to behead the ghostly multitudes and residual qi of the Five Directions. With this talisman, summoning the myriad spirits and thousand ghosts shall result in their annihilation. Swiftly, swiftly, in accordance with the statutes and ordinances of the August Heaven, the Great Emperor, and the Most High Lord Lao.\n\nTwelve Lords of Annihilation of the Left,\nTwelve Lords of Annihilation of the Right,",
      "start_char": 15968,
      "end_char": 17391,
      "start_sentence": 795,
      "end_sentence": 865,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.853095293045044,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "太上九诛大将军四十万人， 太上九刚大将军四十万人， 太上营门大将军四十万人， 太上玉盖大将军四十万人， 太上青盖大将军四十万人， 太上赤盖大将军四十万人， 太上白盖大将军四十万人， 太上黑盖大将军四十万人， 太上黄盖大将军四十万人， 太上宫门大将军四十万人， 太上二十三部官将，主收小官，自称威神制却治官及将军，民妄设风波，伤杀百姓人民，俗不得别署收捕考校，此左无上有玄老太上三五官将度内官一百二十人，所用水官度治。 太上正一九官捍厄箓品第十六 镇平盖治右领功炁祭酒，属土，在蜀州新津县，应轸宿，秋分八月中。 某法箓弟子某乙，好道乐法，太上子孙，命属神仙玉历，北斗七星君，今谨赍法信，诣某法师门下，拜受太上正一九宫捍厄箓，愿某住世，身得保度九厄，解脱万恶消亡，周行天下，早遇神仙，延年益寿，诸灾伏匿，如臣之愿，佩受一如玄科律令。 太上三五正一盟威箓卷之五竟 太上三五正一盟威箓卷之六",
      "translated_text": "The 400,000 Soldiers of the Great General of the Nine Punishments;\nThe 400,000 Soldiers of the Great General of the Nine Hardnesses;\nThe 400,000 Soldiers of the Great General of the Camp Gate;\nThe 400,000 Soldiers of the Great General of the Jade Canopy;\nThe 400,000 Soldiers of the Great General of the Azure Canopy;\nThe 400,000 Soldiers of the Great General of the Vermilion Canopy;\nThe 400,000 Soldiers of the Great General of the White Canopy;\nThe 400,000 Soldiers of the Great General of the Black Canopy;\nThe 400,000 Soldiers of the Great General of the Yellow Canopy;\nThe 400,000 Soldiers of the Great General of the Palace Gate.\n\nThe 23 Departments of Official Generals, who capture petty officials—those who falsely claim authority as divine regulators of governance, generals, or those who recklessly stir up turmoil, harming and killing the common people. When local customs fail to distinguish and apprehend them for interrogation, these 120 Left and Right Supreme Mysterious Elder Three-Five Official Generals within the register’s jurisdiction are employed. The Water Officials are tasked with their regulation and governance.\n\n*Register of the Nine Palaces of the Orthodox Unity for Warding Off Calamities, Scroll Sixteen*\nThe Ritual Master of the Pacifying Canopy Governance and Right Leader of Meritorious Qi Offerings, affiliated with Earth, resides in Xinjin County of Shuzhou, corresponding to the *Zhen* constellation, during the autumn equinox in the eighth month.\n\nI, so-and-so, a disciple of the register’s method, delight in the Dao and take joy in the law, a descendant of the Most High, whose fate is bound to the divine immortals’ jade calendar and the Seven Stars of the Northern Dipper. Today, I respectfully present the ritual offerings and approach the gate of Master so-and-so to receive the *Register of the Nine Palaces of the Orthodox Unity for Warding Off Calamities*. May I, in this lifetime, secure protection from the nine calamities, dissolve myriad evils, and vanish all misfortunes. May I traverse the world, swiftly encounter immortals, prolong my years, and extend my lifespan. May all disasters be subdued and concealed. As this disciple wishes, I humbly receive this in accordance with the Mysterious Regulations and Ordinances.\n\n*Orthodox Unity Alliance Register of the Three-Five, Scroll Five* [End]\n*Orthodox Unity Alliance Register of the Three-Five, Scroll Six*",
      "overlap_context": "tched Earth, capturing the Heavenly Sovereign ghosts;\n400,000 Soldiers of the Heavenly Supervisor, capturing the self-proclaimed imperial ghosts;\n400,000 Soldiers of the Front Reception, capturing the altar and stove ghosts;\n400,000 Soldiers of the Northern Three Qin, capturing the ghosts of those who died away from home;\n400,000 Soldiers of the Great General of the Transcendent Heaven;\n400,000 Soldiers of the Great General of the Upright Heaven;\n400,000 Soldiers of the Nine Paths Great General.",
      "start_char": 17391,
      "end_char": 17815,
      "start_sentence": 866,
      "end_sentence": 881,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.307685136795044,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "八卦护身箓品第十七 炁应九月节，其日角亢，镇云台治，夏至后一百五日寒露。 考召箓品第十八 炁应九月中，其日氏镇浕口治，夏至后一百二十日霜降。 斩邪赤箓品箓第十九 炁应十月节，其日房，镇后城治，夏至后一百三十五日立冬。 辟邪神箓品第二十 炁应十月中，其日心尾，镇公慕治，夏至后一百五十日小雪。 四部禁炁箓品第二十一 炁应十一月节，其日箕，镇平罔治，夏至后一百六十五日大雪。 斩河邪箓品第二十二 炁应十一月中，其日斗，镇主簿治，夏至后一百八十日冬至。 功曹箓品第二十三 炁应十二月节，其日牛，镇玉局治，四冬至后一十五日小寒。 保命长生箓品第二十四 炁应十二月中，其日女，镇北邙治，冬至后三十日大寒。 太上正一八卦护身箓第十七 镇云台治左监贡炁祭酒，属火，在阅州苍溪县，应角亢宿，寒露九月节。 维某年某岁月朔日辰，某州郡县乡里，某法箓弟子某乙，本命某甲子某月日时生，上属北斗某星君，今谨赍法信，诣某法师门下奉受太上太一君皇天上帝□□ 太上元君太一元君玄元始炁八卦，捍厄保命护身秘箓，天帝生我，皇天养我，日月照我，北斗辅我，山川导我，百神侍我，阴阳通我，风伯送我，天厨供我，紫云盖我，神药治我，往来无穷，入海则出天门，入河即出地户，司命举我，何求不得，何指不测，一食千岁，连命日月，与天地元穷，登升天机，驾魁乘刚，所指者亡，身受太上帝君神符，受者敢当，皇天覆我，龙虎使我，朱雀导我，玄武从我，左阳从青龙，右阴据白虎，头戴七星，法应天斗，司命留我年，司录护我命，疾病远我，官事离我，盗贼避我，群星明我，天炁利我，地炁安我，踰河渡海，风浪不起，虎狼见我，摧牙折齿，丹书九通，辟除灾凶，白素为符，凶害灭除，禹为除道，蚩尤避兵，延年元极，与天相毕，急急如律令。 太上正一三五考召箓品第十八 镇尽口治右监贡炁祭酒，属金，在兴元府西县，应氏宿，霜降九月中。 维某年某岁月朔日辰，某州郡县乡里，某法箓弟子某乙，本命某甲子某月日时生，上属北斗某星君，今谨资法 信，诣某法师门下，奉受太清中宫三五",
      "translated_text": "**Register of the Eight Trigrams for Body Protection, Chapter Seventeen**\n*Qi* responds to the ninth-month solar term. On this day, the Horn and Neck [lunar mansions] govern. The Cloud Terrace Abbey presides. One hundred and five days after the Summer Solstice: Cold Dew.\n\n**Register for Examination and Summoning, Chapter Eighteen**\n*Qi* responds to the mid-ninth month. On this day, the Root [lunar mansion] governs. The Zhenkou Abbey presides. One hundred and twenty days after the Summer Solstice: Frost Descent.\n\n**Crimson Register for Beheading Malevolence, Chapter Nineteen**\n*Qi* responds to the tenth-month solar term. On this day, the Chamber [lunar mansion] governs. The Rear City Abbey presides. One hundred and thirty-five days after the Summer Solstice: Beginning of Winter.\n\n**Divine Register for Repelling Malevolence, Chapter Twenty**\n*Qi* responds to the mid-tenth month. On this day, the Heart and Tail [lunar mansions] govern. The Gongmu Abbey presides. One hundred and fifty days after the Summer Solstice: Light Snow.\n\n**Register of the Four Divisions for Restraining Qi, Chapter Twenty-One**\n*Qi* responds to the eleventh-month solar term. On this day, the Winnowing Basket [lunar mansion] governs. The Pingwang Abbey presides. One hundred and sixty-five days after the Summer Solstice: Heavy Snow.\n\n**Register for Beheading River Malevolence, Chapter Twenty-Two**\n*Qi* responds to the mid-eleventh month. On this day, the Dipper [lunar mansion] governs. The Chief Clerk Abbey presides. One hundred and eighty days after the Summer Solstice: Winter Solstice.\n\n**Register of the Merit Officers, Chapter Twenty-Three**\n*Qi* responds to the twelfth-month solar term. On this day, the Ox [lunar mansion] governs. The Jade Bureau Abbey presides. Fifteen days after the Winter Solstice: Minor Cold.\n\n**Register for Life Preservation and Longevity, Chapter Twenty-Four**\n*Qi* responds to the mid-twelfth month. On this day, the Woman [lunar mansion] governs. The Northern Mang Abbey presides. Thirty days after the Winter Solstice: Major Cold.\n\n---\n\n**The Supreme Orthodox Unity Register of the Eight Trigrams for Body Protection, Chapter Seventeen**\nThe Cloud Terrace Abbey’s Left Supervisor of *Qi* Libation Officers, affiliated with Fire, located in Cangxi County, Yanzhou Prefecture, corresponds to the Horn and Neck lunar mansions. Ninth-month solar term: Cold Dew.\n\nIn the such-and-such year, such-and-such month, such-and-such day, such-and-such hour, disciple so-and-so of the Orthodox Register, from such-and-such prefecture, commandery, county, village, and hamlet, born on such-and-such *jiazi* day, month, and hour, whose fate is bound to the such-and-such Star Lord of the Northern Dipper, now respectfully presents ritual offerings and approaches the gate of Master so-and-so to receive the *Supreme Great Unity Lord, August Heavenly Thearch’s* [missing characters] *Supreme Primordial Lady, Great Unity Primordial Lady, Mysterious Primordial Qi’s* Eight Trigrams Secret Register for Warding Off Calamities, Preserving Life, and Protecting the Body.\n\nThe Heavenly Thearch gives birth to me,\nAugust Heaven nurtures me,\nSun and Moon illuminate me,\nThe Northern Dipper assists me,\nMountains and rivers guide me,\nThe hundred spirits attend me,\nYin and Yang flow through me,\nThe Wind Earl escorts me,\nThe Heavenly Kitchen provisions me,\nPurple clouds canopy me,\nDivine medicines heal me.\n\nI traverse without end:\nEntering the sea, I emerge at Heaven’s Gate;\nEntering the river, I exit at Earth’s Portal.\nThe Director of Destinies elevates me—\nWhat desire remains unfulfilled?\nWhat aim remains unmet?\nOne meal sustains a thousand years,\nMy fate linked to the sun and moon,\nCoeternal with Heaven and Earth,\nAscending the celestial mechanism,\nMounting the *Kui* and riding the *Gang*.\nWhere I point, all perishes.\n\nThis disciple receives the divine talisman of the Supreme Thearch.\nThe receiver dares to bear this charge:\nAugust Heaven covers me,\nDragon and Tiger envoys serve me,\nVermilion Phoenix leads me,\nDark Warrior follows me,\nLeft Yang adheres to the Azure Dragon,\nRight Yin rests upon the White Tiger.\nMy head bears the Seven Stars,\nMy dharma aligns with the Celestial Dipper.\nThe Director of Destinies preserves my years,\nThe Recorder of Deeds guards my life.\nIllness flees me,\nOfficial matters depart me,\nBandits and thieves avoid me,\nThe host of stars brightens my path,\nHeaven’s *qi* benefits me,\nEarth’s *qi* stabilizes me.\n\nCrossing rivers and seas,\nWind and waves do not rise.\nTigers and wolves seeing me\nBreak their fangs and shatter their teeth.\n\nCinnabar script in ninefold transmission\nRepels and dispels calamities.\nWhite silk as talisman\nEradicates misfortune and harm.\nYu clears the path,\nChiyou averts warfare.\nProlonging years to the utmost limit,\nI complete my destiny with Heaven.\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\n---\n\n**The Supreme Orthodox Unity Three-Five Register for Examination and Summoning, Chapter Eighteen**\nThe Zhenkou Abbey’s Right Supervisor of *Qi* Libation Officers, affiliated with Metal, located in Xixian County, Xingyuan Prefecture, corresponds to the Root lunar mansion. Mid-ninth month: Frost Descent.\n\nIn the such-and-such year, such-and-such month, such-and-such day, such-and-such hour, disciple so-and-so of the Orthodox Register, from such-and-such prefecture, commandery, county, village, and hamlet, born on such-and-such *jiazi* day, month, and hour, whose fate is bound to the such-and-such Star Lord of the Northern Dipper, now respectfully presents ritual offerings and approaches the gate of Master so-and-so to receive the *Great Clarity Central Palace’s Three-Five*...",
      "overlap_context": "in this lifetime, secure protection from the nine calamities, dissolve myriad evils, and vanish all misfortunes. May I traverse the world, swiftly encounter immortals, prolong my years, and extend my lifespan. May all disasters be subdued and concealed. As this disciple wishes, I humbly receive this in accordance with the Mysterious Regulations and Ordinances.\n\n*Orthodox Unity Alliance Register of the Three-Five, Scroll Five* [End]\n*Orthodox Unity Alliance Register of the Three-Five, Scroll Six*",
      "start_char": 17815,
      "end_char": 18697,
      "start_sentence": 882,
      "end_sentence": 904,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.649897813796997,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "将军考召箓，箓中吏兵请给医治百姓， 助国扶命，急急如律令。 上请东方召鬼大将军一万吏兵度， 上请南方召鬼大将军一万吏兵度， 上请西方召鬼大将军一万吏兵度， 上请北方召鬼大将军一万吏兵度， 上请上方召鬼大将军一万吏兵度， 上请下方召鬼大将军一万吏兵度， 上请召灶大将军一万吏兵度， 上请召七祖大将军一万吏兵度， 上请召宅大将军一万吏兵度， 上请召社大将军一万吏兵度， 上请召神大将军八壬吏兵度， 上请召青帝大将军六千吏兵度， 上请召赤帝大将军六千吏兵度， 上请召白帝大将军六千吏兵度， 上请召黑帝大将军六千吏兵度， 上请召黄帝大将军六千吏兵度，. 上请召左仆射大将军六千吏兵度， 上请召右仆射大将军六千吏兵度， 上请召活人大将军二万吏兵度， 上请召煞鬼大将军二万吏兵度， 上请召斩鬼大将军二万吏兵度， 上请召附水大将军四千吏兵度。 上请召附城大将军四千吏兵度， 上请召附鞭大将军四千吏兵度。 太上正一斩邪赤箓品第十九 镇后城治左都炁祭酒，属水，在汉州什那县，应房宿，立冬十月节。 某法箓弟子某乙，命属北斗某星君，即日投道，自实宿绿，有幸得诞人道，虽忝清化，执行顽愚，幽俗下贱，自小及长，常抱疾病淋沥，为奸邪所淫，初无健日，今谨赍法信，诣某法师门下，请受太上正一天灵赤官斩邪大箓将军吏兵营护某乙，随从行来，出入住止，辟斥众邪，收灭精魅，鼋鼉龟龞，狐狸老精，千岁妖怪，百岁孽王，刚柔清浊，山海高下，妖魅巧伪，六天故炁，三魂七魄，安附身神，依如老君律令。 天灵赤官斩邪直曹二人， 天灵赤官斩邪正曹二人，",
      "translated_text": "**General’s Register for Examination and Summoning**\n\nThis register commands its officers and soldiers to provide medical treatment for the people, assist the state, and uphold destiny. *Hastily, hastily, in accordance with the statute and ordinance!*\n\nRespectfully summon:\n- The **Great General Who Summons Ghosts of the East**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the South**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the West**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the North**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the Upper Realm**, with ten thousand officers and soldiers;\n- The **Great General Who Summons Ghosts of the Lower Realm**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Hearth**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Seven Ancestors**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Household**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Earth Altar**, with ten thousand officers and soldiers;\n- The **Great General Who Summons the Spirits**, with eight *ren* officers and soldiers;\n- The **Great General Who Summons the Azure Emperor**, with six thousand officers and soldiers;\n- The **Great General Who Summons the Vermilion Emperor**, with six thousand officers and soldiers;\n- The **Great General Who Summons the White Emperor**, with six thousand officers and soldiers;\n- The **Great General Who Summons the Black Emperor**, with six thousand officers and soldiers;\n- The **Great General Who Summons the Yellow Emperor**, with six thousand officers and soldiers;\n- The **Great General Left Chief Minister**, with six thousand officers and soldiers;\n- The **Great General Right Chief Minister**, with six thousand officers and soldiers;\n- The **Great General Who Preserves Life**, with twenty thousand officers and soldiers;\n- The **Great General Who Slays Ghosts**, with twenty thousand officers and soldiers;\n- The **Great General Who Beheads Ghosts**, with twenty thousand officers and soldiers;\n- The **Great General Who Attaches to Water**, with four thousand officers and soldiers;\n- The **Great General Who Attaches to the City Walls**, with four thousand officers and soldiers;\n- The **Great General Who Attaches to the Whip**, with four thousand officers and soldiers.\n\n---\n\n**The Supreme Orthodox Unity Register for Beheading Malevolence, Red Register, Chapter Nineteen**\n\nThe Left Metropolitan Supervisor of *Qi* Libation Officers of Zhenhoucheng Abbey, affiliated with Water, located in Shina County, Hanzhou Prefecture, corresponds to the Chamber lunar mansion. Beginning of Winter, tenth month.\n\nDisciple so-and-so of the Orthodox Register, whose fate is bound to the such-and-such Star Lord of the Northern Dipper, on this day enters the Dao, truthfully acknowledging past transgressions. Fortunate to have been born into the human realm, though unworthy of the pure transformation, I have acted with foolish obstinacy, mired in vulgarity and lowliness. From childhood to adulthood, I have long suffered from lingering illnesses, afflicted by wicked and perverse forces, never knowing a day of health. Now, I respectfully present ritual offerings and approach the gate of Master so-and-so to receive the **Supreme Orthodox Unity Heavenly Numinous Red Officials’ Register for Beheading Malevolence**, commanding its generals, officers, and soldiers to guard and protect me, so-and-so, in all my movements—coming and going, dwelling and resting—repelling and expelling all malevolent forces, capturing and destroying spirits and specters: *yuan*, *tuo*, turtles, soft-shelled turtles, foxes, ancient spirits, thousand-year-old demons, hundred-year-old monstrosities, hard and soft, pure and turbid, high mountains and deep seas, cunning and deceptive specters, the residual *qi* of the Six Heavens, the three *hun* and seven *po*, and all spirits that cling to the body’s gods. *As decreed by the Most High Lord Lao’s statutes and ordinances!*\n\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Direct Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Principal Bureau**.",
      "overlap_context": "nth: Frost Descent.\n\nIn the such-and-such year, such-and-such month, such-and-such day, such-and-such hour, disciple so-and-so of the Orthodox Register, from such-and-such prefecture, commandery, county, village, and hamlet, born on such-and-such *jiazi* day, month, and hour, whose fate is bound to the such-and-such Star Lord of the Northern Dipper, now respectfully presents ritual offerings and approaches the gate of Master so-and-so to receive the *Great Clarity Central Palace’s Three-Five*...",
      "start_char": 18697,
      "end_char": 19407,
      "start_sentence": 905,
      "end_sentence": 935,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.93678092956543,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "天灵赤官斩邪治曹二人， 天灵赤官斩邪左曹二人， 天灵赤官斩邪右曹二人， 天灵赤官斩邪都使者二人， 天灵赤官斩邪阳神决吏二人， 天灵赤官斩邪阴神决吏二人， 天灵赤官斩邪阳官太医二人， 天灵赤官斩邪阴神太医二人， 天灵赤官摄邪将军二人， 天灵赤官诛邪将军二人， 天灵赤官伐邪将军二人， 天灵赤官斩邪将军二人， 天灵赤官治邪将军二人， 天灵赤官截邪将军二人， 天灵赤官斩邪阳神将军二人， 天灵赤官斩邪阴神将军二人， 天灵赤官护身将军二人， 天灵赤官擒搏将军二人， 天灵赤官斩邪卫身将军二人， 天灵赤官监邪吏二人， 天灵赤官监邪直符二人， 天灵赤官斩邪使者二人， 天灵赤官斩邪正一使者二人， 天灵赤官斩邪御吏二人， 天灵赤官斩邪刺奸二人， 天灵赤官摄邪护身大神二人， 天灵赤官斩邪擒奇使者二人， 天灵赤官斩邪天医扁鹊二人， 天灵赤官斩邪仙人道士玉女各二人， 天灵赤官青龙朱雀白虎玄武各二人。 天符有常教臣来，北斗鬼神皆怖走，保命延长，青龙侍左，白虎侍右，朱雀导前，玄武从后，三十六仙人扶护左右，使百二十神天符给用地符给粮，出入东西南北，与仙人同行，摄神使者百二十人，与驱使收摄百鬼，南斗护命天符辅身，仙人驾四龙遥诣天门，太上护身，急急如律令。 太上正一辟邪大箓品第二十 镇公慕治右都炁祭酒，属水，在汉州什邡县，应心尾宿，小雪十月中。 某法箓弟子某乙，命属北斗某星君，素以胎生凡夫肉人，百官子孙，有幸建延考犯疾病何邪，今於某年之中，转见进甚，恐是邪精鬼魅，不自分别，今谨依科赍法物，诣某法师门下，求乞拜受太上正一辟邪大箓以自捕捉，受符之日要当如法检身斩绝，不与邪鬼交通，一如太上玄都法罪律令。 符保某身，诸众故炁五酉鬼速去急去，知汝名字，急急如律令。 太上正一四部禁炁箓品第二十一",
      "translated_text": "Two **Heavenly Numinous Red Officials of the Beheading Malevolence Administrative Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Left Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Right Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Chief Envoys**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yang-Spirit Decisive Clerks**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yin-Spirit Decisive Clerks**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yang Physician-Grand Masters**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yin-Spirit Grand Masters**,\nTwo **Heavenly Numinous Red Officials of the Seizing Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Punishing Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Subduing Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Governing Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Intercepting Malevolence Generals**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yang-Spirit Generals**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Yin-Spirit Generals**,\nTwo **Heavenly Numinous Red Officials of the Body-Protecting Generals**,\nTwo **Heavenly Numinous Red Officials of the Seizing and Capturing Generals**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Body-Guarding Generals**,\nTwo **Heavenly Numinous Red Officials of the Malevolence-Monitoring Clerks**,\nTwo **Heavenly Numinous Red Officials of the Malevolence-Monitoring Direct Talismans**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Envoys**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Orthodox Unity Envoys**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Imperial Clerks**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Deceit-Piercing Clerks**,\nTwo **Heavenly Numinous Red Officials of the Seizing Malevolence Body-Protecting Great Spirits**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Anomaly-Seizing Envoys**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Celestial Physician Bian Que**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Immortals, Daoists, and Jade Maidens** each,\nTwo **Heavenly Numinous Red Officials of the Azure Dragon, Vermilion Bird, White Tiger, and Dark Warrior** each.\n\nThe celestial talismans bear constant decrees, and when your servant arrives,\nThe ghostly spirits of the Northern Dipper all flee in terror.\nPreserve life and extend longevity—\nThe Azure Dragon attends on the left,\nThe White Tiger attends on the right,\nThe Vermilion Bird leads the way,\nThe Dark Warrior follows behind.\nThirty-six immortals support and guard on either side,\nOne hundred twenty spirit talismans of heaven are bestowed for use,\nEarth talismans provide sustenance.\nMoving east, west, south, or north,\nYou walk alongside immortals.\nOne hundred twenty spirit-envoys are dispatched to command,\nTo drive away and seize the hundred ghosts.\nThe Southern Dipper’s life-protecting celestial talisman fortifies the body,\nImmortals harness four dragons to swiftly ascend to the Heavenly Gate.\nThe Most High guards the body—*Hasten, hasten, in accordance with statutes and ordinances!*\n\n**Section Twenty of the Orthodox Unity Great Register for Repelling Malevolence**\n\n*Zhen Gongmu, the Right Metropolitan Qi Master of Sacrificial Rites, affiliated with Water, stationed in Shifang County of Hanzhou, corresponding to the Xinwei and Jihai constellations, during the tenth month of the Lesser Snow solar term.*\n\nSo-and-so, a disciple of the Orthodox Unity Register, whose fate is governed by the Star Lord of the Northern Dipper’s [X] Star, being a mortal of flesh born of the womb, a descendant of the hundred officials, has unfortunately contracted an illness of unknown origin. In the present year, the condition has worsened, and fearing it may be caused by malevolent spirits or ghostly specters, unable to distinguish clearly, I now respectfully follow the rites and present ritual offerings at the gate of such-and-such a Dharma Master, beseeching to receive the *Orthodox Unity Great Register for Repelling Malevolence* to capture and subdue them. From the day of receiving the talisman, I vow to examine myself in accordance with the Dharma, severing all ties with malevolent ghosts, just as the statutes and ordinances of the Most High’s Mystic Capital command.\n\nThe talisman protects my body—\nAll residual *qi* and the Five You ghosts, depart swiftly, depart at once!\nKnow your names—*Hasten, hasten, in accordance with statutes and ordinances!*\n\n**Section Twenty-One of the Orthodox Unity Four Divisions Register for Suppressing Qi**",
      "overlap_context": "nd-year-old demons, hundred-year-old monstrosities, hard and soft, pure and turbid, high mountains and deep seas, cunning and deceptive specters, the residual *qi* of the Six Heavens, the three *hun* and seven *po*, and all spirits that cling to the body’s gods. *As decreed by the Most High Lord Lao’s statutes and ordinances!*\n\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Direct Bureau**,\nTwo **Heavenly Numinous Red Officials of the Beheading Malevolence Principal Bureau**.",
      "start_char": 19407,
      "end_char": 20213,
      "start_sentence": 936,
      "end_sentence": 971,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.285593032836914,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "镇平冈治左贡炁祭酒，属水，在蜀州新津县，应箕宿，大雪十一月节。 某法箓弟子某乙，命属北斗某星君，好道乐法，尝游名山，遍历川泽，志慕神仙，今谨赍大刀一口，命米一石二斗，薪一束，绛七尺五寸，银镮一双，白素四十尺，纸一百张，墨一丸，书刀一口，真珠一两，以为誓信，诣某法师门下，求乞拜受太上正一太玄胡玄西玄壶公杂咒法四部禁炁箓，却邪保生，扶家助国佩受，一如太上律令。 子禹步三前还王上吞十二炁， 丑禹步三前还王上吞十二炁，",
      "translated_text": "The *Zhenping Gangzhi Zuogong Qi* Ritual Master, affiliated with Water, resides in Xinjin County of Shuzhou, corresponding to the *Ji* constellation, during the Great Snow solar term of the eleventh lunar month.\n\nThis Dharma Register disciple, so-and-so, whose fate is governed by the such-and-such Star Lord of the Northern Dipper, delights in the Dao and rejoices in the Dharma, having wandered through renowned mountains, traversed rivers and marshes, and aspired to the immortals. Today, I respectfully present:\n- one great sword,\n- one *shi* and two *dou* of rice,\n- one bundle of firewood,\n- seven feet and five inches of crimson silk,\n- one pair of silver bracelets,\n- forty feet of white silk,\n- one hundred sheets of paper,\n- one inkstick,\n- one writing knife,\n- one *liang* of true pearls,\n\nas tokens of my solemn vow. I come before the gate of such-and-such a Dharma Master to beseech the bestowal of the *Orthodox Unity Supreme Mystery Hu-Xuan Western Mystery Master Hu’s Miscellaneous Incantations and Four Divisions Register for Suppressing Qi*, to repel malevolence, preserve life, support my family, and aid the state upon wearing it—all in accordance with the statutes and ordinances of the Most High.\n\n**Zi:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Chou:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.",
      "overlap_context": "bdue them. From the day of receiving the talisman, I vow to examine myself in accordance with the Dharma, severing all ties with malevolent ghosts, just as the statutes and ordinances of the Most High’s Mystic Capital command.\n\nThe talisman protects my body—\nAll residual *qi* and the Five You ghosts, depart swiftly, depart at once!\nKnow your names—*Hasten, hasten, in accordance with statutes and ordinances!*\n\n**Section Twenty-One of the Orthodox Unity Four Divisions Register for Suppressing Qi**",
      "start_char": 20213,
      "end_char": 20429,
      "start_sentence": 972,
      "end_sentence": 975,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.260472297668457,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "寅禹步三前还王上吞十二炁， 卯禹步三前还王上吞十二炁， 辰禹步三前还王上吞十二炁， 巳禹步三前还王上吞十二炁， 午禹步三前还王上吞十二炁， 未禹步三前还王上吞十二炁， 申禹步三前还王上吞十二炁， 酉禹步三前还王上吞十二炁， 戌禹步三前还王上吞十二炁， 亥禹步三前还王上吞十二炁， 右十二时吞炁毕。 次思五方炁， 先思束方青炁， 次思南方赤炁， 次思西方白炁， 次思北方黑炁， 次思中央黄炁， 次思太岁上二十四炁， 先思今日上炁吞之， 次思今时上取炁吞之， 右思五方等炁毕。 次思五藏炁， 青炁归肝中主青龙， 赤熙归心中主朱雀， 白炁归肺中主白虎， 黑炁归肾中主玄武， 黄炁归脾中主黄老君， 木数九，火数八，水数七，金数六， 土数五。",
      "translated_text": "**Yin:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Mao:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Chen:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Si:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Wu:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Wei:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Shen:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**You:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Xu:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Hai:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n\nThus concludes the swallowing of *qi* for the twelve hours.\n\nNext, visualize the *qi* of the five directions:\nFirst, visualize the azure *qi* of the East;\nthen, the vermilion *qi* of the South;\nthen, the white *qi* of the West;\nthen, the black *qi* of the North;\nthen, the yellow *qi* of the Center;\nthen, the twenty-four *qi* above the Grand Year Star.\n\nFirst, visualize and swallow the *qi* above this day;\nthen, visualize and draw in the *qi* above this hour to swallow it.\n\nThus concludes the visualization of the *qi* of the five directions and others.\n\nNext, visualize the *qi* of the five viscera:\nThe azure *qi* returns to the liver, governed by the Azure Dragon;\nthe vermilion *qi* returns to the heart, governed by the Vermilion Phoenix;\nthe white *qi* returns to the lungs, governed by the White Tiger;\nthe black *qi* returns to the kidneys, governed by the Dark Warrior;\nthe yellow *qi* returns to the spleen, governed by the Yellow Elder Lord.\n\nWood’s number is nine,\nFire’s number is eight,\nWater’s number is seven,\nMetal’s number is six,\nEarth’s number is five.",
      "overlap_context": "reme Mystery Hu-Xuan Western Mystery Master Hu’s Miscellaneous Incantations and Four Divisions Register for Suppressing Qi*, to repel malevolence, preserve life, support my family, and aid the state upon wearing it—all in accordance with the statutes and ordinances of the Most High.\n\n**Zi:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.\n**Chou:** With three steps of the *Yu Bu*, return to the king’s presence above, and swallow the twelve *qi*.",
      "start_char": 20429,
      "end_char": 20803,
      "start_sentence": 976,
      "end_sentence": 1004,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.159701824188232,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "禁裸虫用木炁， 禁鳞虫用金炁， 禁羽虫用水炁， 禁毛虫用火炁， 禁甲虫用土炁。 右炁禁法皆如前次第。 某乙奉道精诚，勤修禁戒，至心专一，请受禁炁神仙之法，受者执刀，长跪再拜，发星法取炁步十二时，从子起禹步，左足前右足后，咒之。 言敕汤火文， 又言敕路宿文， 又言敕自防身文， 又言救腊文， 又言敕蛇文， 又言救恶鬼文， 又言救社公毒文， 又言敕印文， 又言敕云中鬼子文， 又言敕臃文， 又言敕都杂符文， 又言敕肿文， 又言敕獝文， 又言救俗家房庙坐席文， 又言敕水鞭文， 又言救虫文， 又言敕师前病家文， 又言敕恶疮文， 又言救俗师文， 又言敕虎狼文， 又言敕食文， 又言敕按摩文， 又言敕他家竹冢文， 又言敕犬文， 又言敕针文， 又言救度杂炁文， 又言敕禁树文， 又言敕刀文， 又言敕蛇虎疮文， 又言敕蚊虻文。 右合三十条牒，度太玄，胡玄，壶公等禁炁杂次，信物并备限。 右据某乙状如前，称素胎生肉人，流俗子孙，千载有幸，制属太上诸君丈人道炁三师以相自保，持前蒙师老赐署重箓治职，得在师任以来，未得明师口诀，求请鲰生肉人，口奏上天曹，愿典者罢塞故炁，愍念群生，助赐星炁，得明道法，宣行有方，救治有效，道炁兴王，用法治病，百鬼皆伏，身中吏兵，尽力传行，毕立神功，迁转名位，凡所禁止，依法施行，又请通炁君十二人，官将百二十人，又请五方炁禁断毒虫虎狼等神将，一合随文度入某乙身中，凡遇禁摄，立使安宁，急急如律令。 胡玄君姓高讳子嵩，身长十丈赤冠，五色之衣，华盖玉床，入镇某乙身中。 右三玄君斗帐玉床四角华盖，入镇某乙身中。 东方青炁吏兵， 南方赤炁吏兵， 西方白炁吏兵， 北方黑炁吏兵， 中央黄炁吏兵， 束方青炁君， 南方赤炁君， 西方白炁君， 北方黑炁君， 中央黄炁君。 右五方真炁君吏等，度入某乙身中，某乙好生乐法，当游名山四海，令五方君史驱逐邪炁，天下地上一切毒虫，咸令摄伏，急急如律令。 太上正一斩河邪箓品第二十二 镇主簿治右贡炁祭酒，属金，邛州蒲江县，应斗宿，冬至十一月中。 某法箓弟子某乙，命属北斗某星君，素以胎生凡夫肉人，专心乐道，或施为不法，被冥考所罚，或疾病是何邪精魅作祟，不自分别，即日依科，谨赍法信，诣某法师门下，求乞拜受太上正一斩河邪箓，受佩之后，永自辅身，断绝鬼祟，不敢与鬼交通，宣行正法，救治百姓，若违背科约之日，坐见中伤，不得怨道咎师，一如太上老君律令。 太上正一三五功曹箓品第二十三 镇玉局治左察炁祭酒，属水，在益州成都县，应牛宿，小雪十二月节。 某法箓弟子某乙，命属北斗某星君，今谨赍法信，诣某法师门下，求受太上正一三五功曹箓，受佩之后，要当扶助医治百姓，不得违背科约，有违之日，坐见中伤，不得怨道咎师，急急如太上老君律令。 太清甲官正一功曹千二百人， 泰清甲官治病功曹千二百人，",
      "translated_text": "To suppress naked insects, use the *qi* of Wood;\nto suppress scaled creatures, use the *qi* of Metal;\nto suppress feathered creatures, use the *qi* of Water;\nto suppress furred creatures, use the *qi* of Fire;\nto suppress armored creatures, use the *qi* of Earth.\nThe method of *qi*-suppression follows the same sequence as before.\n\nSo-and-so, devoted to the Dao with utmost sincerity, diligently cultivates prohibitions and precepts, focusing the mind with single-hearted devotion. They humbly request to receive the divine immortal method of *qi*-suppression. The recipient, holding a blade, kneels and bows twice, then performs the stellar method to draw in *qi*, stepping through the twelve hours, beginning with *zi* and executing the Yu step—left foot forward, right foot behind—while reciting the incantations:\n\nThe incantation to command boiling water and fire,\nthe incantation to command road and lodging,\nthe incantation to command self-defense,\nthe incantation to save from the year’s end,\nthe incantation to command serpents,\nthe incantation to save from malevolent ghosts,\nthe incantation to save from the Earth Lord’s poison,\nthe incantation to command seals,\nthe incantation to command the ghost-child in the clouds,\nthe incantation to command swelling,\nthe incantation to command miscellaneous talismans,\nthe incantation to command tumors,\nthe incantation to command madness,\nthe incantation to save the ancestral halls and seating of lay households,\nthe incantation to command the water whip,\nthe incantation to save from insects,\nthe incantation to command illnesses before the master,\nthe incantation to command malignant sores,\nthe incantation to save lay masters,\nthe incantation to command tigers and wolves,\nthe incantation to command food,\nthe incantation to command massage,\nthe incantation to command bamboo tombs of others,\nthe incantation to command dogs,\nthe incantation to command needles,\nthe incantation to save from miscellaneous *qi*,\nthe incantation to command trees,\nthe incantation to command blades,\nthe incantation to command snake, tiger, and sore afflictions,\nthe incantation to command mosquitoes and horseflies.\n\nIn total, thirty documents are conferred, transmitting the *qi*-suppression methods of the Supreme Mystery, Hu Xuan, and Master Hu, along with all required ritual implements.\n\nAs stated in So-and-so’s petition, they are a flesh-born mortal, a descendant of the common folk, fortunate across a thousand generations to be governed by the Lords of the Great Dao, the Venerable Ones, and the *qi* of the Three Masters for self-preservation. Having previously received the esteemed register and office from their master, they have served under their teacher’s guidance but have yet to obtain the oral transmission of the enlightened master. As a humble flesh-born mortal, they now petition the celestial courts, beseeching the cessation of former *qi* and the compassionate bestowal of stellar *qi* to illuminate the Daoist methods. With these, they may propagate the teachings effectively, achieve healing efficacy, uphold the Dao to assist the sovereign, employ the methods to cure illnesses, subdue all ghosts, and ensure the officers and soldiers within their body exert their full power in transmission. Thus, divine merit will be established, ranks and titles advanced, and all prohibitions enforced in accordance with the methods. They further request the twelve *Qi*-Governors and the one hundred twenty officials and generals, as well as the *qi*-suppression generals of the five directions to restrain poisonous insects, tigers, wolves, and the like. Together, these are transmitted into So-and-so’s body, ensuring that all encounters with suppression and restraint bring immediate peace and security. Urgently, as the statutes command.\n\nThe Hu Xuan Lord, surnamed Gao, named Zisong, stands ten *zhang* tall, wears a red crown and robes of five colors, and is seated beneath a flowered canopy on a jade bed, entering to guard So-and-so’s body.\n\nThe Three Mystery Lords, seated on jade beds beneath canopies at the four corners of the Dipper’s canopy, enter to guard So-and-so’s body.\n\nThe officers and soldiers of the azure *qi* of the East,\nthe officers and soldiers of the vermilion *qi* of the South,\nthe officers and soldiers of the white *qi* of the West,\nthe officers and soldiers of the black *qi* of the North,\nthe officers and soldiers of the yellow *qi* of the Center,\nthe Azure *Qi*-Lord of the East,\nthe Vermilion *Qi*-Lord of the South,\nthe White *Qi*-Lord of the West,\nthe Black *Qi*-Lord of the North,\nthe Yellow *Qi*-Lord of the Center.\n\nThe true *Qi*-Lords and officers of the five directions are transmitted into So-and-so’s body. As So-and-so delights in the Dao and its methods, they shall traverse famous mountains and the four seas. The officers of the five directions will drive away evil *qi*, and all poisonous creatures on earth and under heaven shall be subdued and pacified. Urgently, as the statutes command.\n\n**Register of the Supreme Orthodox Unity’s Slaying the River Demons, Section Twenty-Two**\nOverseen by the Registrar of the Right, the Offering *Qi* Libationer, affiliated with Metal, in Pujiang County of Qiong Prefecture, corresponding to the Dipper constellation, during the eleventh month of the winter solstice.\n\nThe register disciple So-and-so, whose fate is governed by the Star Lord of the Northern Dipper, being a flesh-born mortal of common descent, devoted to the Dao with a single heart, may have acted unlawfully and suffered punishment from the netherworld, or fallen ill due to malevolent spirits or spectral afflictions, unable to discern the cause. Today, in accordance with the regulations, they humbly present ritual offerings and approach the gate of the Dharma Master to beseech the bestowal of the *Supreme Orthodox Unity’s Register for Slaying River Demons*. Upon receiving and wearing it, they shall forever use it to aid their body, sever all ties with ghosts and demons, and never dare to communicate with spirits. They shall propagate the orthodox methods to heal the people. Should they violate these precepts, they shall suffer harm without blaming the Dao or resenting their master. As the statutes of the Supreme Venerable Lord command.\n\n**Register of the Supreme Orthodox Unity’s Three-Five Merit Officers, Section Twenty-Three**\nOverseen by the Left Inspector of *Qi* of the Jade Bureau, the Libationer, affiliated with Water, in Chengdu County of Yizhou Prefecture, corresponding to the Ox constellation, during the *xiaoxue* solar term of the twelfth month.\n\nThe register disciple So-and-so, whose fate is governed by the Star Lord of the Northern Dipper, now humbly presents ritual offerings and approaches the gate of the Dharma Master to receive the *Supreme Orthodox Unity’s Register of the Three-Five Merit Officers*. Upon receiving and wearing it, they must assist in healing the people and shall not violate the precepts. Should they transgress, they shall suffer harm without blaming the Dao or resenting their master. Urgently, as the statutes of the Supreme Venerable Lord command.\n\nThe One Thousand Two Hundred Merit Officers of the Orthodox Unity of the Great Clarity’s Jia Bureau,\nThe One Thousand Two Hundred Merit Officers for Healing of the Supreme Clarity’s Jia Bureau...",
      "overlap_context": "he *qi* of the five viscera:\nThe azure *qi* returns to the liver, governed by the Azure Dragon;\nthe vermilion *qi* returns to the heart, governed by the Vermilion Phoenix;\nthe white *qi* returns to the lungs, governed by the White Tiger;\nthe black *qi* returns to the kidneys, governed by the Dark Warrior;\nthe yellow *qi* returns to the spleen, governed by the Yellow Elder Lord.\n\nWood’s number is nine,\nFire’s number is eight,\nWater’s number is seven,\nMetal’s number is six,\nEarth’s number is five.",
      "start_char": 20804,
      "end_char": 22079,
      "start_sentence": 1005,
      "end_sentence": 1064,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.97384262084961,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "泰清甲官直使功曹千二百人， 泰清甲官五命功曹千二百人。 上仙都三曹二百人， 上仙都正曹二百人， 上仙都上曹二百人， 上仙都中曹二百人， 上仙都下曹二百人。 上灵官三五功曹十五人， 上灵官正一功曹十五人， 上灵官直使功曹十五人， 上灵官治病功曹十五人， 上灵官扶香使者十五人。 三五功曹，五帝直符，正一功曹，直使功曹，录曹符契。 三五功曹吏十二人， 五帝功曹吏十二人， 直使功曹吏十二人， 正一功曹吏十二人， 香官使者吏十二人。 太上正一延生保命箓品第二十四 镇北邙治右察炁祭酒，属土，在洛京洛阳县，应女宿，大寒十二月中 某乙命属北斗某星君，今谨赍法信，诣某法师门下，求受太上三五保命长生之箓后，要当扶助医治百姓，不得违背科约，有违之日，坐见中伤，不得怨道咎师，急急如太上老君律令。 天灵官扶香使者三人， 天灵官扁鹊医治三人， 天灵官除黑簿使者三人。 监度 保举",
      "translated_text": "The One Thousand Two Hundred Direct Envoys of the Merit Officers of the Supreme Clarity’s Jia Bureau,\nThe One Thousand Two Hundred Five-Fate Merit Officers of the Supreme Clarity’s Jia Bureau.\n\nTwo Hundred Merit Officers of the Three Bureaus of the Upper Immortal Capital,\nTwo Hundred Merit Officers of the Orthodox Bureau of the Upper Immortal Capital,\nTwo Hundred Merit Officers of the Upper Bureau of the Upper Immortal Capital,\nTwo Hundred Merit Officers of the Middle Bureau of the Upper Immortal Capital,\nTwo Hundred Merit Officers of the Lower Bureau of the Upper Immortal Capital.\n\nFifteen Merit Officers of the Three-Five Bureau of the Upper Numinous Office,\nFifteen Merit Officers of the Orthodox Unity Bureau of the Upper Numinous Office,\nFifteen Direct Envoys of the Merit Officers of the Upper Numinous Office,\nFifteen Healing Merit Officers of the Upper Numinous Office,\nFifteen Incense-Assisting Envoys of the Upper Numinous Office.\n\nThe Three-Five Merit Officers, the Direct Talismans of the Five Thearchs,\nThe Orthodox Unity Merit Officers, the Direct Envoys,\nThe Register Bureaus and Talismanic Contracts.\n\nTwelve Clerks of the Three-Five Merit Officers,\nTwelve Clerks of the Five Thearchs’ Merit Officers,\nTwelve Clerks of the Direct Envoys’ Merit Officers,\nTwelve Clerks of the Orthodox Unity Merit Officers,\nTwelve Clerks of the Incense Officials’ Envoys.\n\n**The Twenty-Fourth Register of the Supreme Orthodox Unity’s Longevity and Life-Preserving Registers**\n\nThe *qi*-Offering Libationer of the Right Inspection Bureau of the Northern Mang Mountain Sanctuary, governed by earth, located in Luoyang County of the Eastern Capital, corresponding to the *nü* constellation, during the *dahan* solar term of the twelfth month.\n\nThe register disciple So-and-so, whose fate is governed by the Star Lord of the Northern Dipper, now humbly presents ritual offerings and approaches the gate of the Dharma Master to receive the *Supreme Three-Five Longevity and Life-Preserving Register*. Upon receiving it, they must assist in healing the people and shall not violate the precepts. Should they transgress, they shall suffer harm without blaming the Dao or resenting their master. Urgently, as the statutes of the Supreme Venerable Lord command.\n\nThree Incense-Assisting Envoys of the Heavenly Numinous Office,\nThree Bian Que Healing Envoys of the Heavenly Numinous Office,\nThree Black-Register-Removing Envoys of the Heavenly Numinous Office.\n\nSupervision and Protection,\nRecommendation and Advocacy.",
      "overlap_context": "of the Three-Five Merit Officers*. Upon receiving and wearing it, they must assist in healing the people and shall not violate the precepts. Should they transgress, they shall suffer harm without blaming the Dao or resenting their master. Urgently, as the statutes of the Supreme Venerable Lord command.\n\nThe One Thousand Two Hundred Merit Officers of the Orthodox Unity of the Great Clarity’s Jia Bureau,\nThe One Thousand Two Hundred Merit Officers for Healing of the Supreme Clarity’s Jia Bureau...",
      "start_char": 22079,
      "end_char": 22512,
      "start_sentence": 1065,
      "end_sentence": 1090,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.853360176086426,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "度师 太上三五正一盟威箓卷之六竟",
      "translated_text": "The *Register of the Supreme Orthodox Unity and Alliance of Might*, Scroll Six of the *Supreme Three-Five Longevity and Life-Preserving Registers*, is hereby conferred in full.",
      "overlap_context": "ng it, they must assist in healing the people and shall not violate the precepts. Should they transgress, they shall suffer harm without blaming the Dao or resenting their master. Urgently, as the statutes of the Supreme Venerable Lord command.\n\nThree Incense-Assisting Envoys of the Heavenly Numinous Office,\nThree Bian Que Healing Envoys of the Heavenly Numinous Office,\nThree Black-Register-Removing Envoys of the Heavenly Numinous Office.\n\nSupervision and Protection,\nRecommendation and Advocacy.",
      "start_char": 22512,
      "end_char": 22533,
      "start_sentence": 1091,
      "end_sentence": 1092,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.529710292816162,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上三五正一盟威箓.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}