{
  "source_id": "太上妙法本相经",
  "source_file": "chunked_daozang\\太上妙法本相经.json",
  "total_chunks": 30,
  "total_original_chars": 21656,
  "total_translated_chars": 122051,
  "total_translation_time": 602.6221144199371,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
    "category": "正统道藏太平部"
  },
  "full_translation": "**The Supreme Wondrous Dharma’s Original Form Sutra**\n\n**Sutra Title:** *The Supreme Wondrous Dharma’s Original Form Sutra* (abbreviated as *Original Form Sutra*).\nAuthor unknown, approximately composed during the Northern and Southern Dynasties. The original number of fascicles is unclear. Three fascicles of fragmentary versions survive.\n**Base Text Source:** *Daoist Canon of the Orthodox Tradition*, *Great Peace Section*.\n**Collated with:** Dunhuang manuscripts P.2357, S.3173 (Fascicle One), P.2396, and P.2755 (Fascicle Two).\n\n---\n\n**The Supreme Wondrous Dharma’s Original Form Sutra, Fascicle One**\n*(The preceding portion is missing in the original.)*\n\nThe mind may be focused, yet no flesh is to be cherished, no bone to be prized.\nNeither forceful nor weak, it functions solely through transformation.\nPracticed, it exists; abandoned, it vanishes.\nIf one seeks its origin, it drifts like a fleeting impulse;\nif one probes its source, it defies all foundation.\nRadiant yet not dazzling, still yet not silent,\nit cannot be clarified by settling, nor muddied by stirring.\nPraised, it gains no glory; slandered, it suffers no disgrace.\nHonored, it is not exalted; rejected, it is not diminished.\nRevered, it receives no benefit; slighted, it is not uprooted.\nNeither diminished nor enhanced, it abides in effortless non-action.\n\nThe Discerner says:\nPure and true, non-action—without reliance or attachment.\nSlandered, it is not disgraced; praised, it is not glorified.\nRevered, it gains no benefit; slighted, it suffers no loss.\nWithout harm or disgrace, it is simply non-action—\nwhy then expound teachings? Why require devotion? Why strive to practice?\n\nWhy then engage in vain labor? It is better to remain serene and still, following the four qi, employing them to their end. Human life is impermanent, departure and abiding never cease—would it not be better to dwell in ease?\n\nThe disciple says: One may cultivate to attain great fortune, yet if one abandons what cannot be relied upon, striving to attain immortality, one falls into the three lower realms. By reverently practicing divine blessings, disgrace and misfortune arrive—how can this compare to the task of pure and true non-action, the teaching of vain striving, the method of no benefit?\n\nThe answer says: That which is pure and true is the Dao itself. If one practices it, one practices it for oneself; if one strives for it, one strives for oneself; if one reveres it, one reveres it for oneself; if one reveres and upholds it, one does so for oneself—what benefit does this bring to the pure and true? One seeks benefit for oneself, not to benefit the pure and true; one seeks deliverance for oneself, not to deliver the pure and true; one strives to cultivate for oneself, not for the pure and true to strive; one seeks the Dao for oneself, not for the Dao to seek one.\n\nThus, the perfected person first endures hardship and toil, then obtains great joy; first reveres and upholds, then attains true honor. If one disgraces the Dao, one harms oneself; if one slights the true, one slights oneself; if one abandons the Dao, one abandons the Dao for oneself; if one slanders the true, one slanders the true for oneself. Why is this so? One curses the echo, not the echo cursing one; one reviles the true, not the true reviling one; one slights the Dao, not the Dao slighting one; one brings misfortune upon the Dao, not the Dao bringing misfortune upon one; one destroys the Dao, not the Dao destroying one; one poisons the Dao, not the Dao poisoning one.\n\nWhy is this so? It is like a strong crossbow shooting at the sky—its arrow must return. Thus, one shoots at the sky oneself, not the sky shooting at one; one curses the echo oneself, not the echo cursing one. Therefore, poison does not move of itself, misfortune does not arise of itself—all is summoned by the actions of body, mouth, and mind.\n\nThus, the body is the root of the three evils and the foundation of immortality. It is called:\n1. The field of good fortune,\n2. The garden of suffering,\n3. The household of seeds,\n4. The gate of distant life,\n5. The realm of the Dao,\n6. The village of pus and blood,\n7. The vessel of treasures,\n8. The bowl of shards,\n9. The chamber of bright wisdom,\n10. The darkness of the nine nights.\n\nOne who understands this principle may be called a perfected person. When merit is complete and virtue is perfected, one becomes the boundless honored one of the three realms. Ever joyful, without limit, one becomes the distant and lofty Supreme Immortal. Adorned with myriad excellences, vast wisdom spans the great thousand worlds. Merit and virtue are not false, and in the Dark Capital, causes and conditions are reckoned. Hearing this and generating a good mind, one is without a single karmic tie for ten thousand kalpas. Following one’s karma, one scatters and departs—hell, hungry ghosts, and animals become one’s familial cause.\n\nThe Discerner says: As the Heavenly Worthy has said, one seeks the Dao for oneself, not the Dao seeking one; one seeks deliverance for oneself, not the Dao delivering one. Therefore, teachings are established, texts preserved, prohibitions and precepts set forth to restrain and guide. If the Dao does not seek to deliver people, why should it institute methods and teachings to move the people and all beings? If the Dao does not rely on people, what then should people devote themselves to? Is it because the Dao is good for the people and esteems their kinship?\n\nThe answer says: The Dao has no partiality—does its transformation extend to all? People draw near to the Dao themselves, and through resonance, results are attained. Prohibitions and teachings are not applied to one alone but extend to all. Yet it is people themselves who seek prohibitions and precepts, restraining body and mind, binding speech and conduct.\n\nThus, what does the Way of the sage seek? Only that those with minds set their will upon it! Therefore, people can magnify the Dao, but the Dao does not magnify people. The Great Dao is non-action, abiding in spirit with tranquil indifference—what does it seek from people? It is people who magnify themselves, not the Dao that magnifies them.\n\nThus, the nature of the Dao universally nurtures, not just one kind—why should it exclusively magnify humans? In the lands of the ten directions and the great thousand worlds, with myriad forms and names, all are reached by it, yet it does not rely on one kind to transform all. Thus, it universally pervades all forms and names—how could it magnify humans alone?\n\nHow is this known? The Dao generates heaven and earth, establishes yin and yang, arranges the sun and moon, sets the stars in place. It circles the heavens in three hundred and sixty-five degrees, with the calculations of waxing and waning, the four seasons alternating in succession, not a hair’s breadth in error. It gives birth to the forms and names of people and the myriad kinds, crafting all things—how could it magnify humans alone? Thus, it does not magnify humans alone.\n\nTherefore, all superior beings seek the Dao for themselves and seek deliverance for themselves. Why is this so? It is like water: one seeks to cross it, and so comes to cross the water. One knows that water does not cross people—people cross themselves. Thus, the Dao does not deliver people; people seek the Dao themselves. The Dao does not covet the people; the people covet the Dao themselves. If the Dao coveted the people, there would be distinctions of near and far; if the Dao coveted deliverance, there would be natures of advance and retreat.\n\nThus, the nature of the Dao is tranquil and indifferent, without partiality or favoritism, without self or other. Its compassion and kindness nurture all equally. Why is this so? It is like giving birth to ten children: when they are infants, one universally loves and cherishes them, without desire to abandon any. If there is the slightest discord, one rushes to consult shamans and diviners, inquiring about their future. Hearing of decline, one’s liver shatters; hearing of good fortune, one leaps with joy. One nurses and rears them with tender care, anxious for their growth.\n\nYet when they mature, they focus solely on their own plans, turn against their parents, disobey commands, reject teachings, show no harmony in countenance, speak with hostility, and utter harsh words near and far, so that neighboring villages regard them with disdain. Their evil deeds fear the shadow, and they flee in haste, ceasing only at death. Though their forms perish, their names endure—fragrant or foul, ever present.\n\nIf one or two children are obedient in word and fate, harmonious in countenance, their goodness is heard of far and wide, and their village follows their example, with songs of praise never ceasing at the crossroads. Among ten siblings, fragrant or foul, their uses differ. Thus, the Dao’s compassion for all beings is like the twelve kinds of parental kindness.\n\nWhen they mature and are filial, their conduct follows their own will. Therefore, when parents are upright, they know that the filiality of bearing and rearing depends on the child; when the Dao is upright, it knows that the reverence and devotion of the people depend on the people themselves.\n\nThus does the Dao cherish all beings as a mother loves her child—without partiality, without desire for gain. The Dao’s compassion and a mother’s love are alike in this.\n\nThe disputant said: \"We receive the third grace. I would ask further of its meaning.\"\nAs the Heavenly Worthy has said, the Dao cherishes all beings as a mother loves her child, universally pitying all without abandonment. Yet I observe in the world those who suffer calamity—unable to advance in life, unwilling to retreat in death—whose sorrow shatters the heart, whose weeping moves the trees, whose tears wet the beasts, whose cries grieve the birds. Those who see forget themselves; those who hear weep in sorrow. Their anguish and torment cannot be endured. If the Dao is truly great in compassion, should it not pity and save them, delivering them from such suffering? If the Dao does not pity or save, then by this evidence, can we say it possesses compassion or extends grace to all?\n\nIn ancient times, the orphaned child’s grief moved the river’s corpse to halt its flow; the abandoned infant at Fanyang was suckled by a divine beast. Even mountains and rivers respond with compassion—how much more should the Dao? By this reasoning, can we say the Dao lacks compassion, that the Sage lacks sorrow, that it stands alone and apart, bearing the burden of non-action?\n\nThe answer came: All beings possess their own karmic conditions. Whether sorrow or grief, suffering or affliction, these are predetermined by past deeds. Thus, the river’s corpse and the abandoned infant—why did their currents cease? Why was the infant nursed? It was I who sent the dragons to halt the flow and the divine beast to nourish the child. Do you not know this? The river spirit knows the flow of water; the tiger knows its killing. Why do they not act thus? It is because of me!\n\nThe disputant said: If the Dao is responsive, then there should be no suffering. If the Dao is compassionate, then none should be forsaken. Yet the world lies in ashes, and even those who perish receive no deliverance. Does this not prove there is no responsiveness, no compassion—only the workings of transformation? If not, then there must be two Daos: one that governs poverty, suffering, orphanhood, and disaster, and another that governs long life, wealth, and natural bliss. By this reasoning, we must acknowledge there are two.\n\nThe answer came: All beings possess their own causes and conditions. Longevity or brevity, suffering or joy—these are fixed and unalterable. Past karma is already set; its retribution cannot be uniform. Thus, the fruits of karma are never false, and their recompense is without exception. It is like planting seeds: what grows follows what was sown. Can anything grow from what is not its kind? The fruits of poverty and wealth, suffering and joy, are likewise.\n\nWhy is this so? A single mother may bear four or five children, yet their height, complexion, beauty or ugliness, lifespans, and stations in life all differ. This proves that the seeds of past karma cannot be altered. As for your questions, you have now heard the answers.\n\nThe Heavenly Worthy said: Were it not for your inquiries, the multitude would remain ignorant. Were it not for your seeking, the multitude would never resolve their doubts. Now, the light of your single lamp suffices to illuminate ten thousand miles. If you still have doubts, they are not truly doubts; if you remain perplexed, it is not true perplexity.\n\nThe disputant said: \"I receive this grace. Yet the six defilements remain unclear, and my doubts are many. Though I have asked several questions and gained some understanding, lingering uncertainties crowd upon me. My heart is not yet at ease, and I wish to ask further.\"\n\nThe Heavenly Worthy said: \"If you have doubts, you must ask, lest you carry confusion and uncertainty, losing your way in this very life.\"\n\nThe disputant said: \"I humbly receive this heavenly grace once more. As the Heavenly Worthy has said, all beings possess their own karmic conditions; poverty and wealth, suffering and joy, high and low station, long and short life—all are received according to past karma. But I wonder: for those who are poor, suffering, orphaned, or lowly, if they cultivate goodness and accumulate merit, can they still attain blessings? If they do not seize the opportunity, will they continue to wander through evil rebirths? I beseech the Heavenly Worthy to explain these causes and conditions, that all who are poor and suffering may hear and understand.\"\n\nThe answer came: \"Your question is most essential and profound. Sit upright and listen carefully, for I shall explain. All beings—whether suffering or joyful, noble or base—receive retribution in this life according to the karma they cultivated in past lives. For those who are poor and suffering, know that poverty is not a place to dwell. Exert yourselves in fasting, almsgiving, bowing in reverence, offering incense and water, helping others bear their burdens, yielding the path to the elderly and distressed, practicing abstinence, and exhorting others to goodness. When all these virtues are fulfilled, you shall attain the Way of the Great Perfected. Can you then still speak of poverty?\n\nA poor man’s offering of a few coins is equal to a king’s gift of a hundred gold pieces. A single bow from one in suffering is equal to a lifetime of renunciation. Why? In poverty, one has little to spare, yet if one gives without reluctance, the merit is vast and immeasurable. In suffering, one has no leisure, yet if one remembers the Dao and bows even once, it surpasses the lifelong renunciation of the indolent. Thus, a lotus blooming in boiling water—can this not be called difficult? Karma has no fixed constancy; all actions receive their due recompense.\n\nThe danger lies in poverty itself—knowing there is a Dao yet always falling short of others. The danger lies in orphanhood and lowliness—failing to believe in causes and conditions, thus remaining forever in that state. Therefore, the true person, seeing this peril, cultivates and studies the Dao, and so becomes a true person. If suffering beings recognize the repugnance of suffering and the desirability of joy, and practice accordingly, they are equal to the Ten Immortals. Why? Knowing suffering, they endure it, and so ultimately transcend it. Recognizing lowliness, they abandon it, and so escape it.\n\nWhy is this so? All beings possess the nature of joy and the nature of suffering. Below the rank of the Immortals, all dwell within these natures of suffering and joy. Above the Immortals, they forever part from suffering—how much more so the Dao? Thus, the karma of all beings has no fixed constancy; retribution follows action without exception. How can there be any distinction of kind?\"\n\nThe disputant said: \"I receive this grace. I would ask further of its meaning.\"\n\n\"Now, I inquire: of the true persons as numerous as the sands of the ten directions and all the great sage assemblies who have attained the Dao—by what qi were they born, and by practicing what Dao did they achieve this karma, thus receiving their present retribution?\"\n\nThe answer came: \"The true persons as numerous as the sands of the ten directions and the assemblies of sages who have attained the Dao—none are not those who have cultivated the *Scripture of Original Form*. The Original Form encompasses all that is vast and enters all that is minute; its teachings widely expounded, it delivers boundless heavenly and mortal beings, as numerous as the sands of the Ganges, beyond reckoning or record. Like a floating bridge across the Yangtze and Han, since the beginning of the kalpas at the source of the waters, it has delivered beings without measure, beyond count. Since the revelation of the Original Form, the deliverance of all sage assemblies has been likewise.\n\nIf you cultivate the scriptures, maintaining unbroken purification and precepts, your merit and virtue complete, you too shall be equal to the Ten Immortals. For the Ten Immortals originally arose from the suffering and toil of ordinary beings, enduring hardship to attain radiant illumination. How much more so for one whose past karma is vast, whose present life is endowed with keen intelligence, profound wisdom, and penetrating insight into the mysterious origin? Your merit equals Mount Kunlun, your virtue matches the abyssal sea; the attainment of the Ten Immortals is not even a hair’s breadth beyond you.\n\nWhy is this so? When your two mirrors reflect one another, all darkness is universally dispelled, and you wander the Dao of the Upper Clarity. The golden script and jade secrets, the purple writ recording your name—like a shadow born of preceding radiance, you are fixed in the Central Sun. Your virtue and origin are likewise.\"\n\nThe disputant said: \"So it is, so it is! The assemblies of sages who have attained the Dao depart in numbers like the sands of the Ganges, with none returning. Now, those who begin cultivation are also as numerous as the sands of the Ganges—will they reach an end, or is there no limit? If there is no end, they will depart without cease; if there is an end, causes and conditions will perish. I humbly request clarification.\"\n\nThe answer came: \"So it is, so it is! Their departure in numbers like the sands of the Ganges is not considered many. When the reckoning of the Nine Heavens is exhausted and heaven and earth are reduced to ashes, even then the ants and all creeping things will arouse the mind of goodness. After passing through a thousand heavens, those who attain the Dao will still not be considered many. When all creeping things arouse the mind of goodness, the multitudes of the ten thousand kinds will universally ascend to the Jeweled Capital within the Purple Tenuity. After passing through a thousand heavens, those who attain the Dao will still not be considered many.\n\nThus, emptiness cannot be filled, and the void cannot be made substantial—this is called the *inconceivable realm*. A pearl’s mouth receives the multitudes yet is not cramped; the boundless expanse of eternal joy contains all yet is not filled. How much more so for emptiness and the void?\"\n\nThe disputant said: \"I receive this grace. I would ask further of its meaning.\"\n\nAs the Heavenly Worthy has said: when the kalpa’s end arrives and its destiny is fulfilled, all beings will universally attain the Dao, with none left behind. For those who undergo endless rebirths—what need then for teaching, what pursuit of a master, what toil in diligent practice, what reliance on the Dharma? All such efforts would be but self-imposed hardship. Would it not be better to sit in tranquil repose, seeking only the sustenance of millet and fowl?\n\nThe reply: A hundred years of suffering is not equal to one year of joy before death. Ten bolts of coarse cloth cannot compare to a single length of brocade. Do not birds and sparrows live out their three hundred days of fate? Yet they are not equal to a human’s single year. A hundred pounds of iron are not worth ten copper coins. A thousand taels of promised gold cannot match a single *hu* of grain. To await the reign of a king for a hundred generations is not as noble as the worth of a full meal.\n\nIt is like gambling: the first to play holds the advantage, and the one who moves first wins. There is no lingering debt, for to linger in debt is to become a burden to oneself. Carrying shame and debt, one hires out labor to repay it, yet misfortune in the fields leads to ruin. The debt is passed to one’s children, who live in perpetual want, pledging their lives to repay it, casting themselves into the realm of death. Men are debased, women abased; none regard them with favor. The debt of gambling reaches such extremes.\n\nWhy is this so? The first to play in gambling is like one who truly attains the Dao; the one who lingers in debt is like one who falls into the Three Wretched Realms. Thus, the perfected person practices the Dao early and now reaps the fruit of the Eight Liberations, ever abiding in joy and non-action, their virtue measureless.\n\nWhy is this? It is like planting: those who sow early reap early, those who sow in season reap in season, and those who sow late reap late. Those who do not sow have nothing to harvest. If calamity strikes, there is nothing to gather, and only when the master bestows alms does one receive. To expect fruit without cultivation is just the same.\n\nWhy is this so?\n\nJust as one burdened for a hundred years cannot cast off the load in an instant, nor can one imprisoned for a decade escape confinement at will. To gaze longingly at the sweetness of ten years ahead is to be deluded by the moment; to demand immediate fulfillment is to seek what cannot yet be attained. Thus, the perfected person, knowing the folly of distant longing, cuts off longing and thereby attains it; recognizing the emptiness of unripened fruit, forsakes the fruit and thus gains it.\n\nWhy is this so? It is like tending fields: those who rely on heaven’s rain may not see their wishes fulfilled, but those who first dig channels and weirs, guiding the water to irrigate, will surely reap a harvest. Heaven is not without rain, yet scorching sun may still bring ruin, famine, and hardship, cutting short one’s days. The end of the kalpa is not without the Dao, yet the Three Wretched Realms may still prove inescapable.\n\nTherefore, the perfected person, fearing this, seeks the Dao early. Once their truth is exalted, they know no defeat or sorrow, ever abiding in non-action. They act through the non-action of action, entrust themselves to the non-entrustment of entrustment, lodge in the non-lodging of lodging, dwell in the thoughtless thought, and reside in the unattached attachment. Thus, the sage values the first endeavor and honors the initial work.\n\nWhy is this so? To honor the first endeavor is to esteem the scholar’s learning. The Three Primes and Nine Calamities bring misfortunes that cannot be avoided, yet those who humble their hearts and cultivate the Dao universally escape them. Thus, the sage values the first endeavor and honors the initial work. All who aspire to the Dao must begin with the initial work.\n\nThe initial work is the cause of transgression; the first endeavor is the merit of prior action. Therefore, merit is valued and work is esteemed. Those who neither value nor esteem are no different from the six kinds of livestock. Why is this so? The six kinds of livestock know nothing of the Dao, nor do they comprehend the subtle principle of merit and work—thus they are no different from livestock.\n\nThe disciple said: I receive your grace. I humbly seek further explanation.\n\nScholars in the world receive their masters’ teachings and cultivate the Way and virtue, yet some labor for kalpas without attainment, while others, though not necessarily practicing for many years, ascend to the office of the Great Perfection and Non-Action—why is this?\n\nIt is answered: For scholars who cultivate the Dao, the essence lies in comprehending the principle. Those who spend many years without success do so because their minds fail to grasp the principle. It is like a lame man attempting a journey of ten thousand li: though he walks daily, he covers no more than ten li, and only after three years does he reach his destination. Another man, setting out from the same place and bound for the same destination, travels swiftly—covering three hundred li a day—and arrives within a month. The scholar whose mind comprehends the principle is likewise: like one who strides as if flying, none can overtake him. Why? One rides a dragon, the other walks on foot—how can they keep pace? Though their destinations are the same, their speeds differ; though scholars aspire to the Dao, their capacities are not equal.\n\nSome embody the Dao’s teachings yet harbor attachments in their hearts; some feign authenticity while secretly practicing deceit, recklessly divulging esoteric essentials; some speak as if they were perfected beings yet harbor base intentions; some recite sacred texts with their lips while their minds wander; some occupy high positions in learning yet remain deluded by greed for wealth and sensuality; some falsely assume grandeur, overawing the foolish with pomp.\n\nSuch scholars are bound for the Three Wicked Realms—where then is the Dao for them? Those who have not yet matured in their understanding may follow such companions, yet though they traverse the world, they are but walking corpses in a prison of their own making.\n\nHow can all scholars be equated with these? Consider this analogy: when one sets forth an idea, ten debate it; when one raises a challenge, ten aim their arrows at it. Some may hit the mark once or twice, others two or three times—yet is their intent not the same? Only their perceptions differ. Those who comprehend and those who do not are likewise divided.\n\nThe debater says: \"I am indebted.\" Yet further questions remain. I observe in the world five or ten who leave home together, each following their inclination to serve a master, cultivating virtue and the Dao without cease, day or night. The disciples of one master all attain the fruit of the Five Penetrations, while the disciples of another master gain no distinct awakening. If measured by years, their time is the same; if measured by diligence, their labor is equal—yet the disciples of one master advance alone, while those of another do not. The answer lies in the master’s clarity or obscurity, hence the difference in progress.\n\nWhy is this so? The master is the gateway to the Dao. If the master is enlightened, deeply versed in scriptural meaning, discerning the profound mysteries of the present age, and able to distinguish the subtle tendencies of the Dao; if they instruct in rituals and prostrations, admonish in accordance with the Dharma, expound the texts to guide disciples into the Dharma assembly, restrain them with propriety, honor them with discipline, and daily impart increasing teachings—then though their forms may differ in appearance, whether near or far, their understanding becomes clear. Filled with reverent awe for the divine, ever fearful of straying from the path, they remain diligent day and night, steadfast and unwavering. Their qi harmonizes, their spirit softens, their form and soul rejoice, and the radiance of the spirit guides them, ushering them into the true Dao. They diligently serve the Three Perfected, invoking profound responses, spreading teachings to turn back the shadows, fiercely pursuing and adhering to the path. With the urging of the Three Masters, they refine and elevate their spirit. The fruit of the Five Penetrations is attained through merit, and in the future, they will surely receive the wondrous reward of the formless Dao.\n\nWhy is this so? The enlightened master is the bridge to all paths. It is like entering the sea to gather treasures: one must first know the method of presenting one’s name and credentials, secure the ship with iron, lower the anchor, furl the sails, and set the rudder toward the treasure’s location. One must moor the floating vessel, then deploy sand-stone cannons, set up furnaces, and smelt the ore—whether much or little, coming and going without stumbling. Following an enlightened master is just the same.\n\nWhy is this so?\n\nJust as within myriad layers of perilous terrain lie golden elixirs, soft lapis, and the Eight Sacred Fungi—should one advance to gather and ingest them, their lifespan would align with Heaven and Earth, never meeting untimely demise—yet though all who hear of this yearn to set forth, each seeks to traverse and partake, the hazards and obstructions leave them stranded, unable to proceed, with none but turning back. So too are the followers of unenlightened masters. Soft lapis is not absent, yet the peril lies in stagnation and failure to reach it; the void does not lack truth, yet the danger is in aimlessness and lack of direction.\n\nWhy is this so? It is like crossing waters in a leaking boat—once filled, it must sink. Adrift upon vast, rushing currents, midstream it must founder. To seek the Eight Sacred Fungi amid towering perils is to surely retreat. To enter the sea in search of treasures without presenting one’s name and credentials is to capsize the vessel. So too is it with master and disciple lacking virtue.\n\nThus the perfected one never takes themselves as master, and so becomes a master; never deems themselves enlightened, and so attains enlightenment; never claims selfhood, and so fulfills the self; never presumes wisdom, and so achieves wisdom; never asserts vision, and so gains true sight; never exalts themselves, and so rises in stature; never claims virtue, and so embodies virtue; never seeks prominence, and so becomes renowned; never asserts their use, and so proves useful; never assumes authority, and so gains true authority; never presumes greatness, and so becomes great; never boasts of beauty, and so achieves beauty; never declares their authenticity, and so becomes authentic. These thirteen, the perfected one does not adopt.\n\nThe method of the scholar demands a skilled interpreter—pondering conduct and practice, one must not undertake what is not yet fitting, lest later it become a calamity; one must not act as artisan before mastery, lest later it harm the hand. Thus the perfected one does not pursue fame, yet their fame becomes manifest; does not prize reputation, yet their reputation spreads far.\n\nTherefore, the Daoist devotees themselves to the Dao, diligently cultivates virtue, entrusts themselves to worthy disciples, follows enlightened masters, expounds the precepts of transformation, recites the scriptures, practices immortal qi, observes fasting and integrity, contemplates the divine, restrains verbal transgressions, binds the five hearts, dissolves the six emotions, turns from the yin thief, faces the Gate of Life, enacts great compassion, cherishes all beings, pities the orphaned and aged, and takes pity on the cold and poor. Such are the supreme practices of the scholar, the fertile field of the worthy—without the binding precepts of an enlightened master, how could one attain this?\n\nThus the enlightened master is the gateway to the Dao.\n\nWhy is this so? When the master is enlightened, the teachings flourish; when the master is benighted, the teachings fail. Hence, the disciples of one master attain the fruit of the Five Penetrations, while the disciples of another remain without awakening or response.\n\nThe discerning one says: I receive this grace. I wish to hear the remainder of your explanation.\n\nDoes the scholar who abstains from grains and ingests medicinal herbs attain the Dao?\nThe answer: Yes.\nFurther asked: How does this compare to perpetual fasting?\nAnswered: It is not its equal.\nFurther asked: How does perpetual fasting compare to scripture recitation?\nAnswered: It is not its equal.\nFurther asked: How does scripture recitation compare to seated contemplation?\nAnswered: It is not its equal.\n\nWhy is this so?\nThose who abandon grains rely solely on medicinal herbs; when the qi of the herbs is abundant and full, they may endure for a thousand years before their term ends, only to be reborn anew—no different from a beginner in the end.\n\nThose who practice perpetual fasting tally their merit daily; when merit reaches ten thousand, they ascend to the Great Void, transcending the Four Paths. With a single fast of rectitude, when merit is complete and virtue perfected, they attain the Dao of Non-Action and Supreme Perfection.\n\nThe fruit of perpetual fasting is beyond conception, and so too is that of the scripture-reciting scholar—beyond conception.\n\nWhy is this so?\nThe scripture-reading scholar counts each character as merit; with three thousand merits, their name is inscribed in the Registers of Upper Clarity—how much more so for those who broadly peruse the scrolls and long hold the scriptures?\n\nWhy is this so?\nThe scriptures are the teachings of the Dao; to read and practice accordingly is to face the Dao’s own command. Thus, the scriptures weave the destinies of all beings, dispelling the calamity of greed and desire. When this calamity is removed, afflictions and disasters vanish; when disasters vanish, the Five Poisons diminish; when all evils dissolve, the myriad virtues converge. Then, transcending the host of immortals, one attains the supreme fruit.\n\nTherefore, the perfected treasure the scriptures and cherish them, loving them as they would wife and child. The Ten Immortals arise from this, for the scriptures stand foremost among the practices of Non-Action.\n\nThe scholar’s pursuit of the Dao is likewise beyond conception.\n\nWhy is this so?\n\"Contemplation\" speaks of mindfulness; \"mindfulness\" speaks of stability; \"stability\" speaks of immovability. To be immovable is to employ the power of the Ten Immortals.\n\nWhy is this so?\nBy closing the gates of distraction, one severs wayward thoughts and abandons improper intentions. When the spirit is settled and the will unshakable, the perfected, through cultivation, attain stability; through scripture study, they attain rectitude; through fasting, they attain endurance. Persisting without deviation, they perfect the Supreme Perfection.\n\nThough but a moment’s departure is avoided, when merit is complete, they become guests of the Highest Realm, roaming the Purple Gold Precincts, ever joyful and assured of their destiny.\n\nAll the countless multitudes cultivate the causes of the Three Actions; when merit gathers across the Ten Directions, they ascend as towering Supreme Immortals.\n\nYou must practice thus, and excel as they have: beneath your feet, lotus blossoms arise, and your marks of excellence remain ever natural.\n\nThe discerning one says: I receive this grace. I wish to hear the remainder of your explanation.\n\nAs the Heavenly Worthy has declared, the merit of the Three Actions is boundless—equal in discourse to the Ten Immortals, beyond thought, beyond measure. Yet I wonder: do other actions also bear retribution?\n\nThe answer: They do.\n\nIf a scholar, though not cultivating the Three Actions, broadly constructs temples and monasteries, offering all manner of supplies in almsgiving, what retribution shall he receive?\n\nThe answer: He shall naturally receive the retribution of heaven.\n\nAnd once this retribution is received, where shall he dwell?\n\nHe shall dwell in the dwelling of impermanence, abide in the abode of impermanence. Why? If, while within this retribution, he cultivates the Three Actions, his discourse shall equal that of the highest Dao, and he shall attain the supreme fruit. But if, within this retribution, he does not cultivate the Three Actions, he shall descend among men and birds, or fall into the Three Wretched Realms. Thus he dwells in the dwelling of impermanence, abides in the abode of impermanence.\n\nIf one refrains from creating the Four Actions and instead focuses solely on altar rites and almsgiving, what retribution shall he receive?\n\nThe answer: He shall receive the retribution of the Heavenly Kitchens and Earthly Treasuries.\n\nAnd when this retribution is exhausted, where shall he dwell, and what shall be his station?\n\nThe answer: He shall likewise have no permanent abode. Why? If, within this retribution, he cultivates the Three Actions, his fruit shall be supreme. If not, he shall fall according to his karma—thus he has no permanent abode.\n\nIf a person of resolve does not cultivate the Five Actions but devotes himself entirely to the transformation of the Dao, neglecting worldly affairs, what retribution shall he receive?\n\nThe answer: The Four Paths are difficult to ascend; he shall gradually cultivate stability. Why? Such a one is a householder of the Dao. If, within his retribution, he cultivates the Three Actions, his merit shall surpass that of the Three Actions, ascending to the benefits of progress, and below, he shall rank with the advancing immortals.\n\nThus the perfected ones broadly establish fields of merit, and none fail to bear fruit. Why? The perfected ones plant all seeds of action, and thus receive all seeds of retribution; they embody all seeds of compassion, and thus embody all seeds of love.\n\nBy constructing temples and monasteries, they now receive palaces and halls;\nBy performing altar rites and almsgiving, they now receive the heavenly kitchens’ feasts;\nBy transforming others through the Dao, they now attain unobstructed wisdom;\nBy abstaining from the five pungent roots, they now attain a pure body;\nBy forsaking rich and fatty foods, they now attain a form of non-action;\nBy revering prostration, they now attain the highest honor;\nBy cherishing non-killing, they now attain long life and longevity;\nBy praising goodness, they now attain a thousandfold voice;\nBy practicing forbearance, they now attain a wondrously beautiful form;\nBy avoiding slander and insult, they now attain the love and respect of all;\nBy constantly aiding and saving beings, they now attain freedom from illness;\nBy harboring no love or hatred in the heart, they now attain equanimous wisdom;\nBy using medicine to relieve the suffering of beings, they now attain a divine and efficacious tongue;\nBy adorning the Dharma, they now attain a body of purple gold;\nBy refraining from false speech, they now attain a lotus tongue;\nBy never severing the Way, they now attain all marks of excellence.\n\nAll that is unattainable arises from prior cultivation. The perfected ones act thus, transcending the realm of the Supreme Ones. You too must act thus—even what came before is not sufficient.\n\nWhen merit gathers and conditions converge, aeons pass like lightning. Roaming beyond the Great Veil, they sit and behold the great thousandfold worlds, as if a hair’s breadth were a pearl in the palm—when the pearl departs, its luster remains.\n\nSuch are these virtues and deeds, all led forth by the ten thousand practices. If even one good is not fully cultivated, the Ten Immortals ascend the high ridge. Without shrinking from toil and hardship, they universally assemble in the realm of the Supreme Perfected.\n\nThe discerning one says: I receive this grace. I wish to ask what remains unresolved.\n\nAs the Heavenly Worthy has declared, the multitudes of the ten directions—numberless as the sands of the Ganges—all arise from the three karmic actions. Yet how do kings and feudal lords cultivate their karma to become revered among men? Their fathers pass, and their sons succeed them—why is this so? If we reckon by causes and conditions, there is no succession; if by kindred lineage, there are breaks and ruptures. Such discrepancies give rise to endless doubt. We only pray the Heavenly Worthy will reveal the origins of these causes and conditions.\n\nThe Heavenly Worthy replied: Excellent question! The reason kings and feudal lords inherit their domains through generations is that their prior karma has accumulated, and they share in its blessings together.\n\nThe questioner asked: Then why do these lineages sometimes break? If those with blessings share in them together, their surnames and heirs should endure without end. If not, there would be no causes and conditions at all.\n\nThe Heavenly Worthy answered: All ranks, whether noble or base, have their own karmic grades. If their prior karma is the same, they share the same blessings and receive their nature accordingly. Why is this? Consider the farmer who tills the field: he plants according to the seed, and the seed grows according to its kind. If he changes the seed, the crop changes as well. Thus, a single plot of land may yield a hundred different harvests—how much more so the rise and fall of a feudal domain?\n\nThe discerning one said: I receive this grace. I wish to ask further questions. The principles the Heavenly Worthy has expounded are unheard of in this world. Since the revelation of the original form, how many aeons have passed? How many beings have been delivered? Are they delivered because of karmic affinity, or regardless of it? We only pray the Heavenly Worthy will reveal the origins of these causes and conditions.\n\nThe Heavenly Worthy replied: Excellent, excellent! Since the revelation of the wondrous original form, which I have received and upheld, countless aeons—numberless as the sands of the Ganges—have passed. The beings I have delivered are measureless and boundless, beyond reckoning or description. They arise and perish with the turning of the cosmic kalpas, like the records of the sea’s waters—unknown to all. The great sages who have attained the Dao before the radiant kings of sun and moon are also numberless as the sands of the Ganges, and all have studied the original form to achieve the Way. Thus, the original form is the primal sovereign of all scriptures, turning the wheel of the Dao in ways beyond thought or imagination.\n\nUpon hearing the Heavenly Worthy’s discourse, all present gained understanding together and rejoiced greatly. They rose to perform the threefold bow, then knelt and prostrated themselves before the Heavenly Worthy, reciting these verses:\n\nA thousand aeons’ karmic convergence,\nDestiny births this transient form.\nI encountered the Supreme Worthy,\nWho expounded the scripture of utmost truth.\n\nEvery question finds its answer,\nFor the Dao arises from the three karmic actions.\nAll good rests in impermanence,\nIts flow unceasing, never still.\n\nDisciples serve the luminous spirit,\nThe Dharma’s teachings grow ever clearer.\nPointing to the traces of non-action,\nThe fruit attains the name of the Ten Immortals.\n\nMaster and disciple, both benighted,\nThrough ten thousand aeons, no refinement—\nLike the blind traversing myriad dangers,\nSure to plunge into the great abyss.\n\nOne master, a host of great sages,\nAll transcend through the scripture of utmost truth.\nNow, all who have come here\nMust practice the ten thousand virtues,\nUnshaken even by kings and lords,\nNone but submit with sincere devotion.\n\nWealth and rank are but bubbles on water,\nNot worth trading for true glory.\nThe golden-purple body of the attained Dao\nIs originally empty, perfected through non-action.\n\nAll, whether noble or base,\nFind right and wrong in the sincerity of the heart.\n\n*Thus concludes the first scroll of the Heavenly Worthy’s Wondrous Dharma Scripture of the Original Form.*\n\n[The above follows the *Daoist Canon* edition, with lacunae supplemented from Dunhuang manuscript P.2357. The opening lines of the Dunhuang manuscript are also incomplete.]\n\n*Scroll Two of the Heavenly Worthy’s Wondrous Dharma Scripture of the Original Form*\n\nIn general discourse...\n\nThe Dao shapes heaven and earth, its virtue exalts the myriad things, nurturing without end, its merit filling the harmonious qi. The hundred beasts and divine insects, knowing from whence they are born, still cling to their kin, harboring no harmful thoughts—how much more should those who aspire to transcendence hold such devotion! Yet the heterodox fail to honor this, falling short even of the hearts of beasts and insects.\n\nEarth and wood may be moved, but the heterodox remain unmoved. When the mind departs and the body follows, spirit and form come to rest, yet their perceptions diverge, and so spirit and form drift apart, dwelling in separation. Those who cultivate the Dao exert body and mind in unison, arriving at the same end. Without delusion or distraction, steadfast and unmoving—even if heaven rains flying stones, fire arises to scorch the earth, or the earth spews forth yellow springs in boiling surges—they never waver for even a moment. Such is the resolve of those who esteem the Dao’s work.\n\nDelighting in dwelling on Mount Lao, though three thousand heavenly demons assail them—hurling mountains, striking with hammers, casting rocks in wild disarray, shattering trees, collapsing cliffs into countless fragments like swirling snow—they remain unharmed, their form unaltered, their joy undisturbed, their focus unchanged. Then come hundreds of blazing torches, vying to terrify, scorching the forests until no sapling or fruit remains, their flames surging and receding like the sea. Yet the adept’s will remains serene, their heart at ease, untroubled and unshaken. Their resolve cannot be undone, their clarity ever brightening. Unburdened by fear or dread, their Dao-mind remains as before, drawing from non-action.\n\nThis unspoken teaching is for my disciples alone; this unnamed instruction, for my heirs. Why? Because to speak not, to name not, is to embody emptiness and nothingness. Those who walk this path awaken the Dao-mind alone, beyond the reach of the worldly and common—they descend from the heavens above.\n\nThe heterodox invert truth, teaching from the solid, leading their followers astray, and many plunge into fire. How much less can they grasp emptiness and nothingness! Those who do are my true seed. Without such seed, without such heirs, how could one know emptiness and nothingness as the master? Why? The Dao shapes heaven and earth yet does not claim me as father; its virtue exalts the myriad things yet does not claim me as mother—how then could one alone know the source of emptiness and nothingness?\n\nThus the perfected ones, knowing emptiness is worthy of honor, practice emptiness and attain emptiness; knowing nothingness is to be relied upon, cultivate nothingness and attain nothingness. Those who understand the nameless and unspoken know how heavenly beings descend to transform the world. Embracing the Dao in action, carrying yin in conduct, relying on emptiness for benefit, and through nothingness achieving merit.\n\nAll that bears qi arises from they know not what—some call it spontaneity, others causation. Whether in suffering or joy, wealth or poverty, nobility or lowliness, all speak thus. Those who truly know spontaneity do not believe in spontaneity; those who truly know causation do not believe in causation. It is like a child learning speech: they know how to imitate but not the meaning, know how to study but not the principle.\n\nThus I study the teachings of the Father, proclaiming them to all directions. Diligent yet unwearied, laboring without seeking merit, ever withdrawing once the work is done to fulfill the heavenly Dao—thus I abandon that and take this. The Dao, though strong, may break like a branch; virtue, though weak, melts like snow. By embracing harmony, one governs above and below. Thus the high are humbled, the low are raised—this is how the Dao is applied. If rigid, one perishes; if unyielding, one breaks. Only by avoiding both can one endure. If rigid and unyielding, the body has no support—where then is the Dao?\n\nThus the Daoist embraces harmony, rejects rigidity and strength, humbles the high and raises the low. The nature of water nurtures the body, suffusing the Jade Palace, ever free from harm. Thus the perfected ones have no illness, for they take the people’s suffering as their own—this is called \"illness as illness.\" Without sorrow or distress, what illness do I have?\n\nStrength and aggression are the root of death; harmony and gentleness, the root of life. How do we know this? Tigers, though strong, are trapped in pits; trees, though strong, are felled by fire. Are pits not to be feared? Yet those who dwell in them as friends bring ruin upon themselves. Does fire not arise from wood? Yet those who ceaselessly drill bring flames upon themselves. Thus the perfected ones break their strength and aggression, preserving harmony and gentleness. Therefore, the rigid and strong are companions of death; the soft and weak, companions of life.\n\nThus the Daoist values the way of life, prizing steadfastness. The demonic and worldly value strength and aggression, prizing stubborn attachment. Thus the true and the common differ in their pursuits, seeking distinct benefits. Though their efforts may be the same, their rewards are inverted.\n\nThe progenitor of life, the progenitor of cause—who is closer? The progenitor of life is the qi of heaven: follow it and qi harmonizes; oppose it and qi disorders. Thus the father is one with heaven, the mother one with earth. To oppose father and mother is to oppose heaven and earth. Yet one honors the progenitor of life, reveres the parents of cause—even loving a wife, one thus honors them.\n\nThus the perfected ones abandon attachment and so attain perfection; they honor the progenitor of life and so attain the Dao. Though the world differs in its views, all people are the same, born from heavenly qi and nurtured by earthly qi. Yet none recognize the weight of their origin, the grace of heaven and earth—all fall short of the beasts, insects, and divine creatures who know the Dao.\n\nLascivious women gather in throngs, eagerly seeking to seduce men. If one delights in dwelling among them, they engage in debauchery; if one remains unwilling, their resolve firm as a eunuch’s, unmoved and unshaken—what benefit can such seduction bring? The danger lies in seeing lust through lust—how can lust be restrained? Applying lust to a eunuch—what desire remains to covet?\n\nThus the sage’s heart wanders like an empty bird, their emotions severed like a eunuch’s. Even entering a land of lust, how could they be stained? The lascivious women are not without desire, but I do not share it—what benefit is their desire to me? Only when two lusts meet does desire arise.\n\nThus the Perfected One often passes through the abodes of lascivious women, and the women, repentant and awakened, do not impose their desires but instead sever them entirely. Therefore, upon seeing beauty, he likens it to earth and wood; upon seeing treasure, he casts it aside as tiles and pebbles. Why? Because coveting treasure with treasure only stirs greater greed, and delighting in lust with lust only multiplies desire. When the great karmic bond nears its end, where do treasure and beauty reside? Only through restraint and severance is the Dao accomplished without fail—only those with wisdom can ponder this.\n\nFrom the One arise the myriad things, the root of the Four Great Elements, yet people remain unaware. Yang generates and yin nurtures, yet none believe it. Heaven covers and earth bears, yet living beings do not recognize it. Sun and moon shine brightly, yet the ten thousand kinds do not comprehend. Manifest proofs and clear evidence are met with disbelief in the divine. They resign themselves to fate and death, not cultivating karmic conditions, clinging to partial views and divergent paths, treasuring their fathers as if they were jewels.\n\nThus the Perfected One practices the One and embraces virtue to nurture the Four Great Elements. When merit is complete and affairs are accomplished, he attains the reward of purple gold. Therefore, the wise recognize this: first cultivate karmic conditions to nourish spirit and form, neither abandoning nor discarding, preserving wholeness as ever. Thus they know the One generates the Two, the Two generates the Three, and the Three generate the myriad things—thereby heaven and earth endure forever, arising from this principle. Hence they constantly treasure and practice it.\n\nThose who do not know the One are ranked with the six livestock. The six livestock know not the One, nor whence karmic conditions arise—thus they are equated with the six livestock. The Dao is square yet does not sever; it responds universally to all. Virtue is round yet does not lack; it manifests through merit and resonates to completion.\n\nShould it sever, there arises the peril of deficiency and loss; should it lack, there emerges the flaw of exhaustion and abandonment. Thus, it neither severs nor lacks, remaining serene and unharmed. Why is this so? Where there is intent, there is response; where there is merit, there is resonance. Flowing and suffusing the ten thousand directions, it bends to enter the chamber of reality.\n\nThus, it is neither broad nor extravagant, yet can respond to breadth and extravagance; neither expansive nor narrow, yet can respond to expansion and narrowness; neither beautiful nor ugly, yet can respond to beauty and ugliness; neither sinful nor blessed, yet can respond to sin and blessing. Therefore, it is beyond thought or conjecture, an empty and effortless craftsmanship, its forms filling the ten thousand kinds.\n\nIf one seeks to explain it in words, no rhetoric can clarify; if one seeks to measure it, no great power can fathom. It is like the spirit of the valley, responding in accordance with size and shape. The transformative responses of the Dao are likewise.\n\nThe good person is like water, benefiting all things, their merit flowing like a current, all receiving its moisture. Thus, the Dao is the treasure of softness and weakness, and virtue is the treasure of warp and weft. Therefore, the perfected person constantly treasures the Dao and ever cherishes virtue, holding fast without wavering—this is the task of the perfected person!\n\nStone and water harmonize to exist, while the Brahmin child and the Dao are named in transformation. Though their names may be the same, the principles of their use differ. Thus, though water and stone share the same realm, the benefits they receive are unequal.\n\nTherefore, the perfected person treasures the Dao and cherishes virtue, valuing them more than the benefits of water. Throughout the day, they do not depart from their provisions, regarding them as their left and right hands, wielding them as if before their eyes, grasping them as if in awe. Day and night, they strive ceaselessly, ever feeling insufficient—thus they attain perfection.\n\nWhen the world possesses the Dao, the true Dharma flourishes; when the world lacks the Dao, the true Dharma declines.\n\nWhy is this so? When the world fails to honor the Dao, true qi departs and scatters—thus the true Dharma declines. Yet this is not something a ruler can abolish; rather, when the mandate nears its end, delusion arises in the heart and the Dharma is forsaken. If it flourishes, this too is not something a ruler can bring about; rather, boundless fortune unfolds.\n\nThus, when King Yeya was ensnared by the filth of sensual attachment, Purple Yang was poised to respond; when the wondrous Brahmin arose from the sincerity of his vows, the age to come would face the ordeal of suffering’s deliverance. All these are the creations of past karma manifesting in the present body. What is cultivated in this life becomes the provision for the next; what was sown in former lives now shapes the body’s radiance.\n\nTherefore, even emperors and kings cannot summon or suppress it. If governance aligns with the proper use of things, and one draws from this in the present, will they not meet their fate anew? They are no different from King Yeya. Emerging into life and sinking into death, never lingering in one place, they revolve through the five destinies, reborn according to their inclinations. By the reckoning of karma, they receive birth—not falsely granted glory, nor falsely imposed suffering. Heaven observes, earth awaits, and the overseer of pure spirits examines each soul, not losing even the slightest fraction. It is like the teeth of a millstone grinding every edge—none escapes its grasp. If one seeks to receive what is not to be received, the outcome is the same.\n\nWhy is this so? It is like building a wall—every plank must be tamped; if even one plank is left untamped, the wall cannot stand. Thus, the sage, fearing that transgressions cannot be avoided, diligently cultivates the Dao and its practices, setting their mind on purity and truth. Unbound by worldly customs, they do not pursue royal affairs. Through such diligence, they escape the suffering of bondage.\n\nThose who possess resolve and discernment share companionship with the heavenly beings, untouched by demonic afflictions or wayward entanglements. Why is this so? Because of their resolve and discernment. Without resolve or discernment, they share companionship with the six livestock. Why is this? The six livestock know only their mother and do not recognize their father—thus, those without resolve or discernment are no different from beasts.\n\nLofty yet without a peak, low yet without a base, expansive yet without bounds, inexhaustible when pressed, immeasurable in extent, unfathomable in scope. Vast and self-governing, merging and self-acting, it responds to the myriad forms, its merit perfected across the ten directions. It nurtures all that has form, its compassion extending to all beings.\n\nWhy is this so? If there were no such response, who could comprehend its teachings? Thus, it arises in response.\n\nTo cultivate this responsive teaching with a mind so single-mindedly bound that it cannot be undone—does this not also join one with the assembly of the supreme? Thus, the perfected person practices the methods of responsive transformation to attain non-action.\n\nIf one knows that responsive transformation is worthy of emulation and diligently practices it, one also shares companionship with the perfected. Why is this so? The true nature is formless, born from emptiness and nothingness, neither color nor image, its wondrous qi naturally arising. How could it be cut or divided to respond? It divides yet does not diminish, spreads yet does not exhaust, serene and subtle without reliance—thus, it coalesces qi into form and extends relief to the myriad forms.\n\nIts great passing has no summit, its use inexhaustible; its great return has no depth, its use unbounded. It accomplishes yet does not dwell; ever withdrawing the self. It shapes as a vessel yet does not claim it; ever casting off names. This is the supreme teaching of the true and correct, the essential principle of non-action. To accomplish yet not abide—this is the Dao of Heaven. To craft as a vessel yet claim nothing—this is the model of the perfected. Without merit, without name, how could transformation be delayed? Thus, the perfected abides in the teaching without name, diligent in the work without toil, and so accomplishes it.\n\nWhy is this so? If one clings to name, merit cannot be established; if one clings to merit, then it becomes a bestowal. Thus, the perfected knows action but not its name, knows diligence but not its toil. Therefore, bestowing without expecting reward, the fruit naturally ripens. The waters flowing to the sea do not long for return, yet they cycle back of themselves—the response of the great passing is likewise. Thus, one knows action and knows diligence.\n\nBuilding a chamber with doors and windows, kindling light to cast its glow—if one aligns with the wondrous chamber yet no light enters, where is the brightness? Without light, the craftsman has nothing to fashion; without doors and windows, brightness has nothing to illuminate. If sentient beings lack the nature of the Dao, the craftsman has nothing to work upon. Because sentient beings possess the principle of reflection, models are established to teach them. If one gazes into a chamber at night, nothing can be discerned—only when light is cast can work proceed.\n\nThus, the perfected, receiving the instruction of the three masters, becomes perfected. Why is this so? A chamber without doors and windows is no different from having no chamber; a body without a teacher’s instruction is no different from having no body. Therefore, the perfected abandons attachment to cultivate the Dao and so becomes true; leaving the household to practice learning, one becomes virtuous.\n\nThus, Yu Luoqiao valued the Dao and esteemed virtue, attaining the station of non-action! Gold and jade piled like mountains, coins and silks spread like plains—without preserving the Dao or aspiring to truth, what is the use? They vanish like the setting sun, their blessings exhausted, with nothing to rely upon, nothing to depend on. Birdlime smeared on dung is not esteemed; dung beetles rolling their balls hold nothing precious. Thus, treasures cannot be prized, coins and silks are not worthy of esteem.\n\nTherefore, the perfected values the Dao and scorns treasure, esteems virtue and discards wealth, ultimately attaining the station of the Great Perfected. Why is this so? Treasures amassed become gates of misfortune; wealth gathered invites thieves. Thus, the person of the Dao diligently cultivates the Dao, not treasures; practices virtue, not wealth. Even if coins were piled to the heavens, it would not compare to sitting and advancing in this Dao—thus, one does not pursue treasure or wealth.\n\nThe Dao gives birth to the myriad things yet does not claim mastery; virtue nurtures all beings yet does not count it as toil. Thus, the Dao abides above yet is not burdensome, and the people do not grow weary. Without the Dao, wealth does not long endure. Why is this so? People cannot depart from the Dao, just as fish cannot leave water. People who abandon the Dao perish; fish who leave water die. Thus, the perfected embraces the Dao and holds fast to virtue, and so attains enduring life.\n\nEnduring life means abiding in serenity without change, dwelling in the task of non-action. Thus is the Dao of long life and enduring vision—enduring vision means that when heaven and earth crumble, a thousand ashes scatter, the myriad things all perish, yet the self alone endures. Witnessing the dissolution of heaven and earth, the spirit remains serene—this is the Dao of enduring vision and long life.\n\nThe nature of an unborn infant is without desire; the radiance of a pearl within an oyster lies hidden within. Why is this so? The infant’s nature perceives nothing externally, distinguishes nothing internally—it cries for milk when hungry, ceases when full. Even if left unfed for a long time, it wails all day without hoarseness. Why? Because its harmony is perfect, without restlessness or vexation, thus it can give rise to goodness.\n\nThe bright pearl within the oyster, when released, becomes a pearl; if never released, it remains within the clam. The only danger is growing large, being seized by passions and desires—its poison cannot be broken. Thus, the perfected, following non-desire, completes the true Dao, arising at the age of seven to uphold virtue and so perfecting the self. Why is this so? Desire is the root of the five poisons; thought is the source of bodily harm—thus, one abandons them, daring to follow what one dares not indulge.\n\nThe guest of impermanence cannot be entertained; the views of external paths must be abandoned and not returned to. If one awakens to them, it is swifter than the ordinary person—one may reach the station of earthly immortality in an instant. Why is this so? The stain of heterodox learning enters, the qi of empty wisdom spreads, the virtue of past blessings is received—yet seeing a slight misstep, one is transformed into heterodoxy. Thus, past attachments lead to swift awakening.\n\nThe guest of impermanence and the views of external paths alike delude the mind without change, departing and not returning. One must strictly adhere to practice, not clinging to loyalty or sincerity, drifting east and west with the wind, blown away entirely. Why is this so? Lacquer’s nature favors blackness—it takes on color as it is dyed, not adhering to one hue but staining as it is tainted. Thus, the inconstant cannot be governed by the Dao; the views of external paths cannot be repented. Each clings to their own inclination, not following the true teaching.\n\nThus, the true person’s resolve stands firm as Kunlun, unshaken and immovable—though the forest’s trees grow tall, they never shed their leaves. Therefore, the true person binds the knot that cannot be knotted, yet remains inextricable; fastens the gate that cannot be gated, yet remains unopenable. Never swept away by the wind, they thus attain truth.\n\nClay is made from earth, yet without water it cannot take form; vessels are shaped from clay, yet without evenness they cannot be leveled. Thus, water is the origin of harmony and evenness, and evenness the root of balance and refinement. When the craftsman applies skill, the vessel gains the name of pottery; without application, the clay remains unharmonized, and without leveling, the shaping fails. Thus, earth, water, evenness, and craftsmanship support and uphold one another, and only then is the clay placed upon the wheel. Fire tends the kiln, smoke marks the hue; when sealed and cooled, the vessel is revealed—such is the work of pottery.\n\nWhy is this so? Earth is the cause of the vessel, water its condition. The shaping of clay forms its limbs, evenness spreads its pattern like teachings. The craftsman is the world’s model, fire and heat concentrate the true qi. The vessel’s use exalts non-action; virtue arises from the slightest thread, swelling into rivers, seas, and mountains.\n\nThe true person, following this path, now attains the supreme guest; all ordinary beings’ blessings, when tread upon, become the ten immortals. The virtue of the sea is inconceivable, its power shaking the great thousand worlds. Such is the Way—divine, boundless, and immeasurable.\n\nTo abandon learning is to stray into perversity; to refuse learning is to be like the blind. The Way arises from this, yet without understanding, one grasps not the truth of Daoist study. Wandering like livestock, the right mindfulness clings to greed and diligence. The mouth profits from the six livestock, the hands tie them with halters. Stealing the world’s goods, one builds a household and fields, unaware of the debt owed in darkness—the cause of hell’s blade-winds. Without tasting the poison’s bitterness, one seeks to repay it, calling to children and grandchildren. Again and again, they are pulled along, their fortune exhausted until no smoke rises from the hearth.\n\nIf one can cast off all attachments and delight in the true scriptures, perversity severs itself, and no defilements draw near. Without learning, one is utterly blind, unable to distinguish good from evil, new from old. The six livestock know not learning, hence the saying: \"like the new.\" Cease striving, sever all records, and abide ever in spontaneity. The benefits are inconceivable—ten thousand kalpas pass like a lightning flash. Such is the power of the Way and virtue; only the wise persist.\n\nAt first, it may seem insignificant, yet virtue manifests, revealing the profound mystery. The merit of non-action is perfected, and one becomes a master of the three realms. Only through cultivation without weariness may one enter the gate of eternal joy.\n\nBeauty and ugliness—who can say which is greater? Flattery and integrity—how much do they weigh? Thus, the noble person despises flattery and ultimately gains the name of noble conduct. Yet noble conduct is neither granted by heaven nor bestowed by earth; it arises from holding loyalty and repaying deeds, from words of trust and evident goodness, unadorned and unembellished.\n\nWhen an upright person follows others, they gain a name but bear no fruit; when a flatterer follows others, they gain prestige but lack substance. Therefore, the wise abandon the path of the noble and cultivate the Way of non-action.\n\nThe Way values humility, while demonic paths exalt loftiness. The human path prizes life, the ghostly path prizes death. The true Way cherishes simplicity, while the human path cherishes ornamentation. Though their names may be the same, their directions differ entirely.\n\nWhy is this so? Humility seeks to gather all virtues; when these virtues unite, they become as vast as rivers and seas—hence the value of humility. Demonic paths exalt loftiness, rejecting all virtues, self-taught in their own strengths, unwilling to yield to the goodness of others—thus they are demonic.\n\nThe human path exalts perfection, not seeking the life of eternal vision. When illness or suffering arises, they pray to spirits and deities, vainly seeking blessings and fortune. Not aspiring to long life, they are said to prize life. The ghostly path prizes death, valuing annihilation and revering injury—hence it is called the path of prizing death. The true Way values simplicity, not pursuing ornamentation. The rightful concern is for the Way, not for glory—thus, though their concerns may seem alike, their directions differ entirely.\n\nTherefore, the true person humbles themselves, thereby uniting all virtues. Radiant as the sun and moon, lofty as Kunlun, they dwell in lowliness like rivers and seas, which, by occupying the lowest places, become lords of all valleys. Assisting the profound and exalting the virtues of all, the four masters ultimately transmit the Way of numinous wisdom.\n\nThus, the person of the Way need not regard loftiness nor rely on favor. Therefore, kings and lords call themselves \"the orphaned\" and \"the widowed,\" humble titles that bring high rank. Thus, the true person abides in lowliness and thereby attains loftiness, receiving the virtues of all virtues and thereby perfecting their own virtue.\n\nWhy is this so? A mound without water cannot nurture the hundred grasses; deep but not broad, high but not thick. The silkworm, slender as a hair, eats leaves and spins silk, weaving robes and crowns of five colors, fragrant and splendid—noble and base alike wear them. In lands without mulberry or silkworms, when people see colored silks, they know not their origin. If someone explains that they come from the silkworm’s mouth, woven by a skilled woman, none would disbelieve.\n\nIf a master of virtue explains the origin of the Way, their marks of excellence are complete, unmatched among people. Their voice is like thunder, their eyes like the sun’s radiance. Their shoulders slope like a stag’s, their face is level and bright, their hands hang past their knees, their feet tread upon firm ground. Their palms bear ten lines, their forehead three intersecting marks; their ears rise above their hair, their nose has twin pillars, straight and square. Their forty-eight teeth gleam white as frost, their tongue can cover their face, their breath is fragrant as lotus and orchid. Their eyebrows bear eight hues, their white hair-mark shines with light; their topknot spirals like a conch, their crown is adorned with nine auspicious jades. Their head is like a jade hall, their back bears the Dipper’s net, their chest bears the Vermilion Bird, their feet tread upon the dragon’s bed. On their left is blue, on their right white; the six jia spirits attend them, divine beings practice at their side, the nine immortals stand in ranks. Through kalpas they do not decline, through countless ages they do not age. They depart like bending and stretching, their form traverses the four directions. Six kinds of tremors shake the earth, yet they remain serene as the sea’s edge. Such is their awe-inspiring virtue—the king of ten thousand sages.\n\nArising from study, they transcend the Daoist realm; the ignorant do not believe, startled and bewildered, they clamor in confusion.\n\nIn foreign lands, no insects breed, their hearts are solid and unmeasured, what is real is not hollow, only knowledge leads to forgetting. When bandits approach the state, how shall they be repelled? When besieged by a hundred layers, how shall they be broken? It is said: when bandits come, resist them with force, repel them with counsel. Why is this so? Bandits are cowardly by nature—easily withstood. If the enemy is small, one may withdraw the army; by employing counsel to repel, troops need not be sent, and the army may still return. Why? Counsel can subdue evil, fortune can dissolve misfortune. Thus, repel them with counsel, dissolve them with fortune. When besieged by a hundred layers, make the city walls firm, shut the gates and don armor. The bandits will weary and grow disheartened, and soon they will retreat. Therefore, the Perfected One always defends against bandits with arms, and bandits cannot invade; with firm city walls, bandits cannot prevail.\n\nWhen a state is on the verge of chaos, how shall it be stabilized? When ministers grow weary and plot rebellion, how shall they be pacified? It is said: the people rebel from vexation, ministers rebel from confusion—such is the cause of chaos and rebellion. How shall it be remedied? It is said: abandon greed and desire, govern through non-action to nurture the people. When the common folk are at peace, they will delight in their ruler and state, and chaos will never arise. When all under heaven willingly submit, how could they desire disorder? Thus, there is no chaos.\n\nWhen ministers plot rebellion, it is because the ruler is confused, and they do not follow the laws. Their conduct is unlawful—this is why they rebel. They must repent their errors, reform the old and cultivate the new, rectify the framework and govern by law. Within, there is no confusion; without, no tyranny. Therefore, the Perfected One always dispels vexation and chaos, and the people are tranquil; always dispels confusion and treachery, and ministers delight in loyalty. When the ruler is clear and ministers are at peace, there is no collapse; when the people delight in harmony, there is lasting security.\n\nUncarved wood cannot become a vessel; untilled land will never yield soft grain. Why? Uncarved wood will eventually rot and decay; untilled fields will grow thick with thorns. Jackals, wolves, foxes, and owls will dwell within, while horned owls and magpies nest in the woods. Abandoned fields become overgrown with brambles. When scholars abandon the law, it is the same. If wood remains uncarved, it will forever remain dry and brittle. But if it encounters a craftsman, who applies the marking line, the axe, saw, and chisel, and day by day refines it with carving, it will surely achieve its purpose—used, it will serve as desired; tempered, it will suffer no damage.\n\nThus, the Perfected One wields uncarved wood and employs craftsmen, and so can fashion vessels; cultivates untilled land, and so can harvest grain. Why? Uncarved wood and untilled fields are like the ordinary person; encountering craftsmen and plowing are like the teacher’s instruction; becoming a vessel and reaping grain are like the fruition of practice. Therefore, the Perfected One diligently cultivates and refines, and now attains perfection.\n\nPractice non-action, and each day brings increase; practice action, and each day brings loss. Why? Non-action does not obstruct things, and one knows the benefit of non-action. Those who cling to action are attached to existence, yet all that exists ultimately returns to non-existence. Thus, one knows that action brings daily loss. If one can reduce and reduce again, until reaching non-action, then the Perfected One cultivates non-action and not action, practices increase and not loss, and so can achieve growth.\n\nDwelling in the Dao, one must walk the upright path; abiding in the law, one must act with truth. Those who do not do so will surely fall into deviance. Therefore, the Perfected One always closes the gate of deviance and opens the path of uprightness. Through this cause and condition, one now attains the position of true perfection. Why? It is like a smith who, regardless of the shape’s size, uses the square and compass to measure all around—nothing fails to conform. Why? If the mold is uniform, the material takes shape according to its kind, never deviating or changing. It transforms and returns to its nature, whether gold or silver, copper or iron. When melted, it manifests according to its kind.\n\nIf the teacher practices uprightness, the disciple will also be upright; if the teacher indulges in deviance, the disciple will also be deviant. The transmission between teacher and disciple is just like this. Sand and stone may be hard, but within the mortar, they are ground to powder. Without the craftsman’s hammer, how can they be refined? Blue and white stones, with straight veins and patterns, may become pestles—yet even the most skilled craftsman, without a hammer in hand, how can they be shaped?\n\nThus, scholars must apply admonition and guidance, following the text to gain understanding. Even if a worthy teacher imparts instruction, without the text, nothing is taught; even if one has fine talent, without a teacher, nothing is learned. Therefore, one is cultivated through texts and guided through admonition.\n\nIt is like building a boat—without water, it cannot sail; like felling a tree—without an axe, it cannot be cut; like kindling a fire—without wood, it cannot be lit; like drawing from a deep well—without a rope, it cannot be retrieved. Thus, the Perfected One encounters craftsmen and receives their hammering, and now attains the task of Great Perfection and non-action.\n\nIf water is placed in a cauldron but no fire is applied, how can it boil? If grain is placed in a mortar but left unthreshed, how can it be refined? Therefore, all undertakings are accomplished through effort. If one aspires to the flavor of the Dao, one must labor diligently—only then can it be perfected and exalted. Thus, the Perfected One encounters fire and receives threshing, and now attains the fruit of ripeness and maturity. Why? Fortune is never wasted in vain; merit never loses its lesson.\n\nWithout grinding and winnowing, the decayed will surely endure; without carving and polishing, the unhewn will surely be discarded. Thus, only the wise can practice this, only they can labor at it—without practice and without diligence, one will never draw near. Water in a cauldron left unheated, grain in a mortar left unthreshed—merely watching without acting, one will never attain one’s desire. The Daoist who abides in the Dharma yet does not practice the Way is likewise.\n\nThough the zither and lute possess refined music, without plucking they do not sound; though bells and drums possess rhythmic tones, without striking they do not resound. Thus, the Perfected One plucks the zither to awaken others, strikes the drum to gather the multitude. Why? By plucking the zither and striking the drum, one allows all beings to hear and know. The zither and drum are like the nature of the Dao; the one who strikes them is like the master’s teaching. If one loves the zither, one comes of one’s own to listen; if one loves the drum, one comes of one’s own to listen. Thus, the Perfected One constantly strikes the drum and plucks the zither, never ceasing day or night. Why? The Perfected One pities beings who do not hear the music, and so strikes it day and night.\n\nIf there are beings who delight in the Three Treasures, one should give them the Three Treasures; if there are those who love the zither and lute, one should give them the zither and lute. Why? The zither and lute can awaken beings, and so one gives them. If the Perfected One does not pluck the zither or strike the lute, how will beings come to know? If the Perfected One does not proclaim the true principle, how will beings come to know it? Thus, one gives the Three Treasures, gives the zither and lute—hence the analogy.\n\nAt that time, the Wild Mother among the assembly heard the Heavenly Worthy expound on plucking the zither and striking the drum to awaken beings. All repented and awakened, and so she practiced day and night, striking the zither and drum without daring to cease. The Wild Mother then returned to the northern Long Mountains, felled autumn paulownia trees, and crafted bells, drums, zithers, and lutes. Adorned with pearls and dyed in vibrant hues, carved with coiling dragons, strung with yellow silk, and inlaid with polished jade, she gathered three thousand disciples in that land to practice the zither and lute, to strike the floating bells and drums, playing day and night without pause. People from near and far all came to listen to the music—men and women alike, none did not halt their steps. The multitude gathered in the tens of thousands, coming without end. The Wild Mother rejoiced without cease, practicing year after year without change, believing she would ascend as an immortal by dawn and dusk, rising step by step. Yet from youth to old age, each met their end in due time, falling into the Three Wretched Realms.\n\nThus, the Perfected One never relies on sound yet attains discernment; never presumes to know yet achieves true knowledge. Why? The Perfected One studies the Dao without a master, without receiving instruction; without understanding, there is no reversal; without clarity, there is no proclamation. Thus, the Perfected One does not take oneself as a master yet becomes a master; does not presume to be enlightened yet becomes enlightened; does not seek to manifest yet becomes manifest; does not give of oneself yet bestows. By not taking oneself as a master, not presuming enlightenment, not seeking manifestation, not giving of oneself, all merits reside within—thus one attains perfection.\n\nTherefore, a gāthā says:\nGrasping the discourse of the Great Constant,\nThe myriad dharmas have no fixed form.\nComing and going like the whirling wind,\nFlowing eastward, life swiftly passes.\nRevolving like surging, boiling waters,\nGrievously wounding the human nature.\nWith profound wisdom, observe future lives—\nThus, abandon the path of compliance.\nCultivate the body in worldly ease,\nYet the fruit is ascent to the supreme.\nMyriad afflictions dissolve like clouds,\nIn purity and non-action, the true corrects the chaotic.\nWith perfect adornments, radiance fully emerges,\nSurpassing the great penetration of the sage.\nAll the blessings of ordinary beings—\n[...]\n\nThe *Sublime Scripture of the Original Form of the Wondrous Dharma*, Middle Fascicle, concludes.\n\nThe *Sublime Scripture of the Original Form of the Wondrous Dharma*, Lower Fascicle:\nUniversal Exposition\n\nThe Heavenly Worthy said: Within this, for all beings, I universally expound the original form of the sublime wondrous Dharma, the cause of the supreme Way, delivering boundless multitudes. All beings gather in assembly, none do not revere and admire.\n\nAt that time, the Eastern Yu, Western Yu, Southern and Northern Yu; the Eastern Lai, Western Lai, Southern and Northern Lai; the Wild Mother, the Unhooked, the Lone Drawer, the Wooden Marquis, the Chicken Deer—all heretical paths—came to be seated. Each shone with radiant brilliance, stirring among the assembly, their numinous majesty resplendent, vying in eloquent words to test and challenge without yielding.\n\nThe Yu said: What you spoke yesterday—that all beings, from past karma to future retribution, reap the fruits of their former causes—is not mistaken. Yet I observe that all beings dwell in the heavy chamber of the great night—how can they know the causes of past lives or the retribution of the present body? If they encounter the grace of the Dharma, the fruit of the Dharma may be attained; if they do not, they drift with the current. Like gathering firewood in a stream, those caught by the hook are retrieved; those not caught drift away. All ordinary beings are like firewood in water—those who encounter the teaching attain it; those who do not drift away. How can there be past karma imposed upon them, retribution borne in this life? If it were due to past causes, there would be no need for further action; if relying on past karmic conditions, there would be no need to seek the teaching. The allotment would be complete, no need for provisional reception. What you have said does not accord with the Way of the utmost truth—your words are not yet understood.\n\nThe Yu continued: The beings of the ten directions each possess their kind of qi, not dependent on past karma’s creation. For example, birds give birth to birds, beasts to beasts; humans, plants, crawling creatures—each kind begets its like, each type resembles its own. How can there be past causes and karmic retribution? Like melting gold, its color appears according to its kind; like planting seeds, the fruit follows the seed. How can there be transformation contrary to kind? What you have said does not accord with the utmost truth—your words are not yet understood.\n\nThe Lai replied: I observe that if parents have four legs, their offspring also have four legs; if parents fly, their offspring also fly; if parents are white or black, their offspring are white or black; if parents can speak, their offspring can speak. Yet there has never been a bird that could gallop a thousand miles.\n\nThe Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Lai replied: I observe fish dwelling in still waters, tigers in deep forests, swallows and sparrows near humans, and earthworms in their burrows. Each kind receives its qi and nature, each endowed with its own disposition. How could any consume what is contrary to its nature? The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Wild Mother said: I see worms beget worms, oysters beget oysters, flies beget flies, and ants beget ants. They feed according to their qi, sustaining their lives—how could their karmic birth alter their form? The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Unhooked One said: I see that among all beings, those that eat meat produce offspring that eat meat; those that graze on grass produce offspring that graze on grass; those that consume wood produce offspring that consume wood; and those that feed on earth produce offspring that feed on earth. All beings possess their own fixed qi, none borrow from another—how could they be mistaken for a different kind? The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Lone Archer said: I see that all beings differ in nature, sharing the same substance yet bearing different names. Yin and yang are not the same, and their transformations vary. According to this principle, each possesses its own kind of qi, never altering or changing. If one understands this, then a hundred may be known; if one grasps a single kind, then ten thousand may be known. The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Wooden Marquis said: I see that to preserve a nation is to preserve its form; to preserve the body is to preserve its shape. Those with flowing hair beget offspring with flowing hair; those that crawl sideways beget offspring that crawl sideways. They are born according to their kind and bear fruit according to their seed—how could they receive what is contrary to their nature? From heaven to earth, there has never been a case of one kind receiving what belongs to another. The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Cock and the Deer each spoke in turn: \"We observe that all living beings—whether square or round, long or short—each receives its qi according to its kind, and their natures are fixed. We have never seen clay smelted into gold or pigs transformed into dogs. Kind begets kind, seed perpetuates seed, each receives its qi without alteration. If alteration were possible, then all ordinary beings, all creatures in motion, would possess past-life causes and conditions, and the virtues they have sown—could these lead to the attainment of the utmost truth? If kinds do not change and are fixed in their reception of life, then your words are all false and deceptive, deluding the ignorant with useless teachings.\n\nWe accept only what we see in this present life—what we have wrought, we receive. We will never follow your empty talk of past-life causes or recklessly discuss future retribution, lest we mislead later learners and disrupt the transformation of the land, vainly pleasing the fleeting times. Can such be called divine? If one follows this, one is forever cut off from long life.\"\n\nThe Heavenly Worthy said: \"All living beings possess their own conditions and ranks. The deeds accumulated in past lives are received in this life; what is wrought in this life is received in the next. Without cause or condition, how can fruit come to be? Without father or mother, how can a child be born? Without heaven or earth, where would the myriad kinds abide?\n\nIt is like planting: without earth, nothing grows. Like flying insects: without wings, they cannot fly. Like swift movement: without space, it cannot proceed. Like clouds and rain: without dragons, they cannot form. Why is this so? If kinds did not rely on one another, all would share the same fate. If kinds were fixed, all would uniformly attain completion. Yet from one father, offspring differ in their reception; from one mother’s milk, their appearances vary. Without cause and condition, all would receive equally; without fortune or misfortune, all would be uniformly strong or weak.\n\nBy your reasoning, one could plant in empty space, farm in flowing streams, bear children without a father, or give birth without a mother. One could forge ore into vessels, bind bees to harvest honey, raise silkworms to obtain brocade, or grow hemp to make fine linen. Why? Because ore can be forged, bees can be bound to yield honey, silkworms can be made to spin patterns, and hemp naturally becomes linen. What you achieve differs from my Way.\n\nMy Way and yours are not the same; my practice and yours are unequal. Though the name of the Way may be shared, its principles are opposed in direction. Why? I employ the method of cultivating emptiness through reality, practicing the Way through existence, acting for future use, and cultivating without expectation of reward. Thus, knowing diligence but not reward, the fruit naturally responds; knowing action but not arrival, the Way naturally reaches. Withdrawing from achievement, achievement achieves itself; relinquishing fortune, fortune fortifies itself. If one clings to achievement, it cannot be relied upon; if one dwells in fortune, it will be exhausted without end. Therefore, withdrawing from achievement and relinquishing fortune, one ultimately meets with both. Accumulating the practice of the Way over lifetimes, the response of the fruit reaches its destination.\n\nThus, the perfected ones accumulate deeds over a thousand lifetimes without expecting reward. They cast their foul bodies to eagles and tigers—not hoping for repayment from eagles and tigers, but only pitying their hunger. Therefore, giving without expecting reward, the movement naturally responds; suffering without seeking joy, joy naturally manifests. Thus, knowing action, diligence, practice, and application, one never expects a single lifetime to demand its fruit. This is why my use differs from yours, and our reception of merit is unequal.\"\n\nThe Four Yu, Four Lai, Wild Mother, Unhooked, Lone Puller, Wooden Marquis, Cock, and Deer all refused to believe and said to one another: \"The Heavenly Worthy does not teach the utmost truth. He recklessly speaks of empty, future fruits, expounding parables to delude the ignorant, wasting their bodies and forms, and vainly involving them in rebirth. He falsely testifies to future, unrealized fruits, crafting clever words and false analogies, speaking of causes and conditions. Among the four assemblies, those whose minds are deluded and unenlightened waste their years in vain.\n\nAt this, those who had intended to stay arose in haste and fled. Then the Heavenly Worthy closed the celestial radiance, and darkness enveloped the four directions. The various Ways were lost, not knowing where to turn, except for the place where he sat, which remained as brightly lit as before, undisturbed. The followers of the Ways returned to the light and asked: \"What ominous portent has caused the sudden absence of light and the darkness in the four directions, leaving travelers lost and turning back? We do not know what has caused this strange event.\"\n\nThe Heavenly Worthy said: \"The celestial light has vanished of itself—what concern is it of yours? You accumulate the arts of the Way and soar through empty space, your might and spirit unmatched in the world. How could darkness confine you or cause you to speak of being lost? I merely speak of future, unrealized fruits and guide the ignorant with past teachings—how would I know why the light has closed?\"\n\nYu said: \"Our Way knows only of long life, short life, and flying—we have not beheld such principles. Heavenly Worthy, distinguish this for us: if we can understand, then we will know that you have attained the fruit of causes and conditions and the merit of the future. If we cannot, then we will know your words are false.\"\n\nThe Heavenly Worthy then smiled joyfully, and radiance issued from his mouth, illuminating the ten directions and brightly revealing the Eight Purities. They saw all they had received in past lives and all they were destined for in the future, witnessing the deeds of former times, each clearly reflected. The four kinds of beings saw their past, future, and present states, all their destinies and rebirths, none unseen.\n\nThey beheld the divine immortals’ palaces atop Kunlun’s summit—a wall four thousand *li* square, with twelve hundred gates encircling it. Within were three thousand six hundred smaller palaces, jade towers and golden halls, five cities with twelve gates each. The ground was made entirely of lapis lazuli, adorned with coral, silver foil, and strands of pearls, intricately layered in a thousand folds, their brilliance unmatched.\n\nThen they beheld the Heavenly Thearch ruling at the center, with the thirty-two Heavenly Kings assisting on all four sides. At the four corners stood towering palaces, exquisitely adorned, where four Heavenly Thearchs governed, with celestial dragons, ghosts, and spirits attending on either side. Above Kunlun, such wondrous music resounded beyond all reckoning.\n\nAt that moment, the Four Yu, Four Lai, and all those of heterodox paths awakened in their hearts, never to regress, and thus attained the Dao of earthly immortals.\n\nThen Elder Jing asked: \"All beings have their karmic conditions, and human actions are repaid according to the deeds they accumulate. Take the Four Yu and Four Lai—formerly they did not believe in the true and authentic, so they fell into heterodoxy. Though they once strayed, exerting their own power without following true teachings, they rebelled and departed, returning in confusion. Yet even now, though they still do not fully believe, their faith is not entirely exhausted. In a single moment of belief, what they attain is lofty. How is this so?\"\n\nThe answer came: \"These twelve heterodox paths, when they first embarked on the Dao, all arose from deluded and false causes. They encountered unorthodox masters, received unorthodox *qi*, and when that *qi* took form, they fell into heterodoxy. Their spirits became attached, and thus they were called heterodox paths. Now, through this single turning of faith, by the merit of this returning faith, they have attained the Dao of earthly immortals. The Four Yu possess abundant roots of wisdom, so they will ultimately revolve into the ranks of the Great Dao and Great Perfection. Why is this? For those who cultivate the Dao, the initial resolve is prized, but what matters is their later attainment. Thus they receive the reward of a single fruit. It is like planting a tree that bears fruit—if frost, hail, or bitter winds strike in a given year, breaking its branches, the fruit is lost. But when the seasons later become temperate, the flowers set fruit, yielding abundance and sweetness. Thus, though the tree ripens in due season, it preserves at least one fruit. Why? The tree is like the scholar; the flowers are like their fruits; frost and hail are like heterodox masters. Though they were once led astray by heterodoxy, now they have turned to true teachings.\n\nThe Eastern Yu was originally a man from the Central Plains of the Eastern Sea. In his youth, he cultivated the Dao and aspired to become a divine immortal, but midway he encountered the teachings of a false master and practiced deception, thus earning the name of a false path.\n\nThe Western Yu was from Jin Cang in the Western Sea. In his youth, he loved the supreme Dao and neglected worldly affairs, but midway he encountered the teachings of the Wild Mother, which he practiced incorrectly. Cultivating her methods, he became tainted by heterodox *qi*. His practice was unorthodox, the heterodox *qi* attached to him, and his spirit became stained. Believing himself a true immortal, he was called a heterodox path.\n\nThe Southern Lai was from Yang Ze in the Southern Sea. In his youth, he practiced Daoist arts and aspired to the purple of high rank, but midway he encountered the teachings of the Three Aspirations, which he delighted in and applied. The *qi* attached to him, and he became an outsider.\n\nThe Northern Lai was from Cang Chi in the Northern Sea. In his youth, he was drawn to Daoist teachings, but in adulthood he encountered the methods of a heterodox master and followed them, believing them to be the true and authentic Dao. Practicing them, he was called heterodox.\n\nThe Wild Mother was a woman from the distant West. In her youth, she cultivated the Dao and rejected worldly customs, but midway she encountered perverse and deviant teachings, which she practiced and thus fell outside the principles of the true teaching. Heterodox *qi* attached to her, her essence transformed into spirit, and those who imitated her were all called heterodox paths.\n\nThe Unhooked was from Han Chi in the North. In his youth, he loved the Dao and did not follow the common crowd, but midway he encountered the teachings of a false master, which he devotedly practiced. Thus heterodox *qi* entered and attached to him, and his spirit became imitable. Practicing accordingly, he was called a heterodox path.\n\nThe Lone Draught was from Wuji in the East. In his youth, he loved Daoist arts and was devoted to the true and authentic, but midway he encountered the teachings of a false master, which he practiced and thus fell into heterodoxy. His methods were easily corrupted, and his master was untrustworthy.\n\nThus, the master is the father and mother of the Daoist. Like nursing a child with milk and sweetness, one must seek the finest and purest. Therefore, the true person chooses a master to study under and can thus attain perfection. They examine the Dao and cultivate it, and thus can accomplish the Dao. Why? All paths that lead to heterodoxy stem from the master’s teachings not being true. When a tree’s flowers are struck by frost, it is also due to the craftsman’s lack of skill. To be led astray by external teachings is due to the mind’s lack of firmness.\n\nFor the scholar, first resolve, then vow; one must preserve their authenticity. First contemplate, then diligently practice, and one will surely reach their fruition. Thus, the Daoist must strengthen their resolve, fortify their precepts, secure their heart, and scrutinize their intentions. They must choose a master to cultivate under, select good companions to practice with, and reflect thrice in seeking benefit—how could they err? Pursuing an enlightened master without shunning hardship, gaining three benefits each day—how could they falter?\n\nThus, cultivating the Dao is not easy, and being a master is even more difficult. It is like travelers journeying together through perilous paths. Of a thousand or ten thousand, none may reach their destination. But if one or two are learned enough to guide the crowd and brave enough to resist the foolish, resolutely protecting the timid, calming the bandits ahead, then all the travelers can pass through safely. Of a thousand or ten thousand companions, none will fail to receive grace. If a scholar encounters a good companion, it is the same.\n\nTherefore, the true person does not practice recklessly or act carelessly, thus attaining non-action. Discarding what is harmful and embracing what is beneficial, they accomplish the Dao by this means.\"\n\nYu asked the Heavenly Worthy: \"All the myriad dharmas—from what do they arise, and by what *qi* do they exist? I only wish the Heavenly Worthy would explain their causes and conditions, so that all beings may know from whence they come.\"\n\nThe answer came: \"All the myriad dharmas arise by receiving the *qi* of the Dao and are completed through emptiness. Why? The Dao is formless, yet responds to *qi* in myriad forms. Emptiness is without division, yet permeates and moves all that has form. Without emptiness and without *qi*, all speech and thought are obliterated. Without speech and without thought, the ten thousand existences vanish. Thus, the Dao is the father of the myriad things, and emptiness is the mother of the myriad things.\"\n\nWhy is this so? It is like the father as yang and the mother as yin—through cause and effect, through the breath of the womb, after ten months a form is attained. A name is given, a designation bestowed, and thus the Way of father and son, the ranks of honor and humility, are established. If there were no father, from whence would the child be born? If there were no mother, how would the breath of the womb be fulfilled? Therefore, emptiness circulates and pervades all dwelling within it, and thus we know it as the mother. Without cause, the child would not exist; without the child, how could there be emptiness? If there is a child, then emptiness is the mother of the ten thousand existences.\n\nThus, the Dao gives birth and virtue nurtures, borrowing existence as if a form were present. Without the child, how could the filial Way be made manifest? Without existence, how could emptiness be discerned? Therefore, being and non-being give rise to one another—this is what is meant.\n\nThus, the perfected person constantly cultivates emptiness, honoring it as the mother, and constantly follows the Dao, revering it as the father. Therefore, to honor the Dao and esteem emptiness is to hold in reverence what is greatest. Why? Because our origin lies in father and mother, and so what we revere is greatest. Yet there are beings, regardless of high or low station, who do not know what they should value, who harm their own forms and sever their own roots. Why? It is like a tree—if one hacks away at its roots, not one in ten thousand will survive. If one exposes its roots, it will wither in winter. Those who recklessly lose the Dao are likewise. They are like a tree growing upside-down, like a fish cast from the water—though they live for a time, their lives will not be long.\n\nThus, the perfected person guards the Dao with firmness, attaining long endurance, deepening the roots and strengthening the stem to bring forth blossoms and preserve countenance. Therefore, they do not act in violation, nor do they act in opposition, and thus find peace and joy in this.\n\nYu said: \"I have received this grace. I wish to ask further for clarification. The Dao is most true, taking non-speech as its essence, without body or form, borrowing emptiness and non-being as its foundation. Yet I wonder—those perfected persons who dwell within blessings, what methods do they honor and cultivate? What substance do they expound? From what do they arouse their minds?\"\n\nFrom what does intention arise? How does one attain such a position? I wish for you to distinguish this clearly, that all who come after may hear and know.\n\nThe answer: Your question is most essential and wondrous. Listen carefully, and I shall distinguish it for you. The utmost truth has no form—cultivating emptiness, one attains its reality. The supreme Dharma has no speech—following its patterns, one attains the Dao. Ever mindful of the suffering and affliction of sentient beings, grieving for the world, they broadly save all. Throughout the day, they act without concern for their own bodies; all their lives, they preserve salvation without relying on the self for the self. By this mindfulness, they move and respond naturally. Unwearied in practice, they thus attain the title of *Great Perfected*.\n\nIt is like boiling salty earth—one need only tend the fire, and in time, the whole cauldron will teem with life. People need only practice compassion, and joy will naturally return to them. Why is this? When malicious thoughts arise, one dreams of harm; when virtuous thoughts emerge, one dreams of auspicious signs. Thus, acting with poison brings calamity; acting with goodness brings blessing. Therefore, one knows that acting without thought of reward, the fruit ripens of itself; sowing without thought of harvest, the yield is abundant. The Dao of true nature is likewise.\n\nThe question: If the mind is upright, it is repaid with true response; if the mind is crooked, it is repaid with deceit. It depends solely on the mind—does one not require a model? Earlier, you spoke of this: if the master is true, the disciple is upright; if the master is false, the disciple is deceitful. Yet today, your explanation seems at variance. I wish for you to distinguish this, that all who do not understand may receive clarification.\n\nThe answer: If the master is enlightened, there is no danger of entanglement; if the master is benighted, they fall prey to demonic forces. Without a master, how can one cultivate the Dao? Without mindfulness, how can one practice goodness? Thus, an enlightened master practices great compassion, severs extravagance and greed, and master and disciple inquire together, good companions learning from one another. How could one study the Dao of *Shangqing* without a master? Therefore, the master is like a father—without a father, from where does the child arise? Without a master, from where does the Dao take form? This is why the enlightened master is esteemed.\n\nWhy is this? The enlightened master is clear in the methods of the Dao, without error. Those who follow describe it truly, the upright transmission uncorrupted. Evil influences do not disturb it, merit is accomplished, and virtue is perfected, thus attaining the Dao of utmost truth and non-action. Therefore, the enlightened and the benighted differ, the worthy and the foolish are distinct. Their practices vary, their studies diverge, and their karmic responses follow accordingly. Thus, master and disciple emulate one another, friends learn from one another—this is what is meant.\n\nPlain silk changes without constancy, taking the dye the artisan applies. If the nature is dyed black, it shifts with the craftsman’s art. Once stained and adhered, it cannot be scraped away; once glued and pressed, it cannot be torn apart. The influence of demonic forces is likewise. Why is this? Just as purple and vermilion mixed half-and-half will dull the red, or the waters of the Zī and Mian intermingled for ten days will confuse their taste—thus, those who dwell in purity delight in purity and despise filth, while those who dwell in filth do not esteem refinement but prize their own squalor. Matters of like kind differ in substance; the Dao follows its course, and companionship follows its nature. The perception of right and wrong is likewise.\n\nThings of like nature receive alike, taken and given from the same vessel—though their names may be the same, their emptiness and fullness are not equal. Therefore, the great person dwells in depth, not in shallowness, and thus preserves depth. Ever abiding in simplicity, they await the enlightened artisan. Those who dwell in shallowness will never receive the artisan’s touch. Thus, the noble person recognizes depth and knows simplicity, and so abides in their proper place, neither recklessly staining nor recklessly acting, and thus maintains their station.\n\nClarity extinguished, one perishes; preserving it, one endures. Recklessly stained by demonic customs, the body is surely ruined; recklessly acting without uprightness, the form is surely destroyed. Therefore, the noble person guards trustworthiness in this.\n\nIlluminated conduct is like snow; profound virtue retreats like a valley. Holding to truth is like loss; following the artisan is like duty. Preparing the Dao is like guarding against thieves; hitting the mark is like whiteness. When merit and conduct are as bright as snow, one nears the Dao. Neither leveling nor obscuring nor seeking, the manifold fruits flourish threefold, attaining non-action.\n\nWhy is this? Illuminated conduct is self-purifying, without defilement. Profound virtue is the mind abiding in the great Dao, undisturbed and unburdened. Holding to truth is the will harmonizing with the Dao and things, guarding stillness without wavering. Following the artisan is traversing the bright path, as if pursuing honor and emolument. Preparing the Dao is fortifying against the four quarters’ treacherous foes, ever fearful of downfall. Hitting the mark is fearing the arrow may miss, the mind unwavering. Unceasing in these six matters, one nearly attains non-action.\n\nThus, the perfected person practices these six matters, and the six virtues gather therein. Therefore, the Daoist’s taking and giving differ, their holdings vary. Without the six severances complete, how can one attain non-action? Without cutting off the five colors, how can one reach the wondrous realm? Merit incomplete, the sleeve too short—none may walk the path. Courageously practicing the Dao, ice and boiling water dissolve one another.\n\nWhy is this? A bird’s nest that does not rest has no place of peace. Desiring to be dyed by the Dao, one meets emptiness. Without cutting off the five colors, where can one lodge in emptiness? Thus, the perfected person does not nest the mind in the nest and so can achieve nesting; departing from the five colors, they can achieve truth.\n\nThe noble person does not act yet acts, does not use yet uses, is not esteemed yet is esteemed, does not rely yet relies. What they rely upon are the Three Treasures, and thus the Daoist’s conduct is the opposite of the vulgar. Why is this? The vulgar esteem greed, while the Daoist values frugality; the vulgar esteem killing, while the Daoist values longevity; the vulgar esteem licentiousness, while the Daoist values chastity. Though their actions may appear the same, their purposes differ, and their rewards are not equal. Thus, the Dao and the vulgar are opposites—this is what is meant.\n\nGoverning the self and governing the state follow the same principle. The path of the journey and the destination share the same pattern.\n\nWhy is this so? In cultivating the self, cutting off thoughts brings tranquility to the spirit; in governing the state, eliminating vexations brings peace to the realm. If one’s aspirations remain unfulfilled, their plans will not succeed. Thus, the Perfected Person observes the state to cultivate the self, examines principles to practice the Way, and acts throughout the day to attain non-action. Therefore, reducing what must be reduced ultimately leads to the Great Dao. Why is this so? By daily diminishing the unwholesome and daily increasing the wholesome, when wayward thoughts arise, cast them aside at once; when vexing notions stir, burn them immediately—thus avoiding the snares of entanglement.\n\nA great state falls because of its unwholesomeness; fertile fields are ruined for the same reason. What is unwholesome is the corruption of the Way. Why is this so? If fertile fields are abandoned, weeds flourish; if a great state is vexed, the people rebel; if the people rebel, arms and armor contend, and the world falls into despair—this is what is meant.\n\nWhy is this so? The people are the root of the ruler, and the ruler is the honor of the people. Without the people, the ruler has no security; thus, one must not treat the people lightly, for they are the root, nor treat the ruler lightly, for he is the honor. Therefore, neither can be slighted or disdained. Observe how flowing waters cannot be long preserved, and shifting things cannot rest in stillness. Thus, the wise observe and practice the Way, while the foolish cling to delusion and never awaken. The Perfected Person gazes upon this and acts accordingly, attaining non-action—expansive in salvation, restrained in conduct, enduring without perishing. Those who do not perish keep their spirit eternally present, never parting from their form; thus, they die yet do not perish—this is what is meant.\n\nThe path of delusion is not distant; the demonic way does not endure. Those who rely on themselves fail to comprehend; those who enlighten themselves fail to manifest. Why is this so? Like a lone traveler on a journey, the lost will surely fall into peril; those who claim enlightenment without guidance will inevitably face demonic obstacles. Why is this so? Those who study without a teacher will mislead later learners; those who wander blindly through myriad dangers will surely meet with disaster. Thus, the Perfected Person ascends the high ridge and walks without losing the way, following an enlightened teacher to learn, never erring from beginning to end. Therefore, the Daoist acts with careful discernment.\n\nTo transmit without clarity is to leak; to teach without a teacher is to obstruct. Illness left untreated will fester and kill. Delusion uncorrected leads to ruin on treacherous paths. Galloping down steep slopes leaves many tracks and surely ends in a fall. A rigid and overbearing tree will snap. A coarse tool in fine craftsmanship will chip the vessel. Water eroding the bank will carve deep hollows. Fine silk torn by the wind will surely split. A tree in a dense forest will suffer from tangled leaves. The demonic way, if not abandoned, melts the marrow like snow. A sharp blade turned inward will cut by its own radiance. A clumsy hand wielding an axe will surely harm itself. The impoverished who force generosity will dissipate and fail. The weak and destitute who recklessly rush will never reach the sunlit plain. Planting in sandy mounds will not sustain drought-stricken seedlings. A toppled tree with flourishing branches will break without being cut. Building a house without windows and doors will not stand. Setting a crossbow without releasing the string will not strike the target. Carving unseasoned wood will not hold its joints. Crossing great waters without rowing the oar will not reach the far shore. To walk the constant Way without complete adherence to its precepts is likewise. Why is this so?\n\nThe perfected person first carves windows and doors before building a house, fastens the bowstring before loosing the arrow, sharpens the axe and chisel before shaping unhewn wood, secures the oar and rudder before sailing the waters. With all necessities prepared, nothing remains unconquered. The perfected person’s virtue and conduct likewise attain success through such means.\n\nThe Dao makes no distinction of near or far—only goodness is drawn close. The true holds no rank of noble or base—cultivate it, and it responds. Merit is not bestowed in vain—where it is given, resonance follows. Action does not cease—pursue it, and arrival is certain. Why is this so?\n\nIf there were partiality, the peril of factional entanglement would arise. If there were hierarchy, the calamity of arrogance and resentment would follow. Thus, the Dao is neither near nor far, yet responds to all near and far; neither noble nor base, yet answers all noble and base. Therefore, the perfected person neither exalts the high nor scorns the low, yet the mind remains serene. They neither disdain the humble nor overlook the obscure. Their luminous conduct leaves no gaps; they cast off dust without attachment.\n\nThey shun the five desires and hundred distractions, dismissing idle chatter without utterance. They do not heed slanderous speech nor covet fine gains. They banish the six evils to embrace the six penetrations. With boundless nurturance and vast salvation, they transform their former abode. Leaving the root to dwell in the present, they perfect utmost truth. With the three clarities and six attainments, their wisdom arises naturally. Their station reaches the highest, governing all perfected immortals. Like a mother’s nurturing care, they treat all equally. They bestow widely upon beings, reaping according to each one’s nature.\n\nInconceivable, it is called the Empty, Supreme, Utmost True Dao. Empty boasts are like vain bragging—seek them, and they cannot be fathomed. Artful words are like false beauty—examine them, and they lack foundation. This may be termed dwelling in existence while speaking of emptiness, losing virtue through cleverness. Such a path withdraws, descending not upon its practitioner. Why is this so?\n\nThe Dao responds to substance, not to emptiness. Thus, substance is the beginning of practicing emptiness, the origin of attaining truth. Therefore, the perfected person’s words never drift into idle talk, their conduct never strays into deceitful craft. Thus, their virtue is perfected without concealment, their merit shines without diminishment, achieving the state of non-action.\n\nTheir luminous teaching is like the sun—its use is inexhaustible. Their conduct is like the tongue—used without breaking. Their clarity is like jade—its luster remains unstained. Their nature is like water—its flow never reverses. Their enlightened speech is like snow—its use never wears out. Their words are like unguent—applied without ceasing. Their bright precepts are like the sun—never failing in use. Their grasp is like a knot—never loosening.\n\nLofty yet not proud, humble yet not ashamed; virtuous yet not self-satisfied, pure yet not rigid. They empty themselves without pause, hold fast to the Dao without wavering. They bestow great compassion tirelessly, ever mindful of salvation. They do not claim merit for themselves—virtue resonates naturally. All wisdom fuses within; myriad virtues share a single cause. Merit accumulates without end.\n\nSo towering are they that the nine immortals transcend all bounds, attaining the supreme truth of non-action.\n\nA great state insatiably greedy will surely be afflicted by calamity. Bandits insatiably greedy will surely be pursued by officials. Relying on strength to bully the weak, unaware of excess, will surely be trapped by the mighty. Clinging to nobility to oppress the upright, unaware of crookedness, will surely be ruined by misfortune. Thus, governing the self and governing the state are the same.\n\nWhy is this so? Those who rely on virtue flourish; those who rely on strength perish. Those who uphold loyalty endure; those who depend on nobility falter. Those who aid tyranny labor in vain; those who side with the doomed stand alone. Therefore, the perfected person upholds loyalty to endure, distances themselves from falsity to attain longevity. Neither perishing nor isolated, they take companions as kin, kindred spirits as dear. Thus, they abandon that and embrace this.\n\nOne who tunes music with a glued bridge will wear their nails to the quick without completing the melody. One who rides a horse with severed reins will reach perilous heights only to be dashed against the cliffs. Though there may be the sound of music-making, there will be no melody of measured rhythm. Though there may be the gallop of a horse, there will be no destination of reason and principle.\n\nThose who cling to fixed views in cultivating the Dao are likewise thus. The Dao is vast and not to be abbreviated; true qi circulates in perfect harmony, extending even to the crawling creatures, nourishing all things. Why is this so? Without the Dao, the myriad things cannot come into being; without the Dao, cultivation of emptiness cannot be accomplished. Therefore, one who knows the vast yet does not constrict, who knows frugality yet does not indulge, abides in insufficiency and thus attains enduring sufficiency. Knowing insufficiency, they diligently practice it and thus attain enduring sufficiency. If one deems insufficiency sufficient, it will ultimately remain insufficient; if one deems the unexalted exalted, it will ultimately remain unexalted; if one deems the unpracticed practiced, it will ultimately remain unpracticed; if one deems the unresolved resolved, it will ultimately remain unresolved. Thus, the perfected person abides in insufficiency, dwells in the unexalted, and thereby attains non-action.\n\nWords that are not true leave no form. Why is this so? The Dao is hidden and wordless, yet teachings through words fill all; the Dao is hidden and formless, yet through its formlessness, forms arise and responses manifest. Therefore, it cannot be pondered or debated, nor can it be fathomed.\n\n*(End of* The Supreme Wondrous Dharma’s Original Aspect Sutra, Scroll the Lower *)*\n\nThe following text is based on emendations: #1 \"Original\" (原作) reads \"field\" (田), corrected according to the Dunhuang manuscript P.2396. #2 \"Tongue\" (舌) originally reads \"bitter\" (苦), corrected according to the Dunhuang manuscript. #3 \"Cruelty\" (虐) originally reads \"emptiness\" (虚), corrected according to the Dunhuang manuscript. #4 The Daozang edition is deficient hereafter; the following is supplemented according to the Dunhuang manuscript.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上妙法本相经 经名：太上妙法本相经。 简称《本相经》。 撰人不详，约出於南北朝。 原本卷数不详。 现存残本三卷。 底本出处：《正统道藏》太平部。 参校本； 敦煌P.2357、S.3173（卷上）、P.2396、P.2755（卷下）号残抄本。 太上妙法本相经卷上 （已上原缺） 〔心可专，无肉可爱，无骨所重。 不强不弱，唯化为用。 行之则有，废之便无。 若寻其元，芒然由趣，若究其宗，莫知所据。 光而不耀，静而不寂，澄之不清，挠之不浊，誉之不荣，毁之不辱，奉之不贵，却之不损，恭之不益，慢之不拔。 不损不益，淡然无为也〕#1 。 辩夫曰：清真无为，无依无着，毁之不辱，誉之不荣，恭之不益，慢之不损，无损无辱、无为而已，岂用教演？ 岂须奉之？ 岂懃行之？",
      "translated_text": "**The Supreme Wondrous Dharma’s Original Form Sutra**\n\n**Sutra Title:** *The Supreme Wondrous Dharma’s Original Form Sutra* (abbreviated as *Original Form Sutra*).\nAuthor unknown, approximately composed during the Northern and Southern Dynasties. The original number of fascicles is unclear. Three fascicles of fragmentary versions survive.\n**Base Text Source:** *Daoist Canon of the Orthodox Tradition*, *Great Peace Section*.\n**Collated with:** Dunhuang manuscripts P.2357, S.3173 (Fascicle One), P.2396, and P.2755 (Fascicle Two).\n\n---\n\n**The Supreme Wondrous Dharma’s Original Form Sutra, Fascicle One**\n*(The preceding portion is missing in the original.)*\n\nThe mind may be focused, yet no flesh is to be cherished, no bone to be prized.\nNeither forceful nor weak, it functions solely through transformation.\nPracticed, it exists; abandoned, it vanishes.\nIf one seeks its origin, it drifts like a fleeting impulse;\nif one probes its source, it defies all foundation.\nRadiant yet not dazzling, still yet not silent,\nit cannot be clarified by settling, nor muddied by stirring.\nPraised, it gains no glory; slandered, it suffers no disgrace.\nHonored, it is not exalted; rejected, it is not diminished.\nRevered, it receives no benefit; slighted, it is not uprooted.\nNeither diminished nor enhanced, it abides in effortless non-action.\n\nThe Discerner says:\nPure and true, non-action—without reliance or attachment.\nSlandered, it is not disgraced; praised, it is not glorified.\nRevered, it gains no benefit; slighted, it suffers no loss.\nWithout harm or disgrace, it is simply non-action—\nwhy then expound teachings? Why require devotion? Why strive to practice?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 322,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.848076105117798,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "岂徒劳之？ 不如闲静，随其四气，终而用之。 人生无常，去留不停，不如优豫乎？ 弟子谓可修得大福，废无可恃，懃致神仙，慢落三徒，奉行灵佑，辱之祸至，何期清真无为之任，虚懃之教，无益之法乎？ 答曰：夫清真者，即是道也。 若人行之，人自行之； 若人懃之，人自懃之； 若人恭之，人自恭之； 若人奉之，人自奉之，何益於清真乎？ 人自求益，非益清真； 人自求度，非度清真； 人自懃修，非清真懃修； 人自求道，非道求人。 是以真人先自懃苦，后获大乐； 先自恭奉，后得真尊。 若人辱道，人自损之； 若人慢真，人自慢之； 若人废道，人自废道； 若人毁真，人自毁真。 何以故？ 人自骂响，非响骂人； 人自恶真，非真恶人； 人自慢道，非道慢人； 人自祸道，非道祸人； 人自灭道，非道灭人； 人自毒道，非道毒人。 何以故？ 譬如强弩射天，其箭必还。 是以人自射天，非天射人； 人自骂响，非响骂人。 故毒不自运，祸不自生，一由身口心行所招致也。 是以身者，三恶之根，神仙之本，一名良福田，二名赋黎园，三名种子户，四名远生门，五名道之域，六名脓血村，七名珍宝器，八名瓦砾椀，九名明智室，十名九夜昏。 人能知斯理，可名为真人。 功满德亦就，三界无极尊。 常乐无边境，迢迢太上仙。 相好具万种，海智邈大千。 功德不虚妄，玄都计因缘。 闻而生好心，万劫无一缘。 随业落散去，三涂是家因。 辩夫曰：如天尊所说，人自求道，非道求人，人自求度，非道度人，所以立教存文，禁诫约束。 若道不求度人，不应设法加教以动民物。 若道不赖於人，人岂何所务之？ 将知道好於民而贵其亲。 答曰：道无亲疏，化及一切？ 人自亲道，感而致果。 禁诫加教，非独一人，约及一切。 但人自求禁诫，束其身心，约其口行。 是以圣人之道何求乎？ 有心者志之耳！ 是故人能弘道，非道弘人。 大道无为，处神淡泊，何求於人乎？ 但人自弘，非能弘道。 故道性徧养，非独一类，何故专弘於人乎？ 十方大千之国，万种形名，悉以及之，终不寄一类而化及也，是以普徧形#2 名，岂独弘之於人也！ 何以故得知之？ 道生天地，置立阴阳，布造日月，安设星辰，周天三百六十五度，盈缩之数，四时代谢，毫分无失，乃生民人万类之形名，匠成一切，而独弘之於人乎？ 是故非独弘人。 是以一切至士，自求於道，自求度之。 所以者何？ 譬如於水，人自求渡，乃来渡水，将知水不渡人，人自渡之。 是故道不度人，人自求道； 道不贪民，民自贪道。 若道贪民，则有亲疏之隔； 若道贪度，则有进退之性。 是以道性淡泊，无有亲疏，亦无彼此，慈恩子养，平等一切。 何以故？ 譬如生十子，孩抱之时普恩爱之，无欲遗弃，小有不和，驰追巫卜，问其进止，闻衰肝碎，闻吉踊悦，乳铺慈育，迟不长大。 暨其长成，专志自计，反目二亲，命不顺从，教不入怀，色不和候，言生攻击，恶声远近，邻邑异目。 恶迹畏影，随逐急疾，至死乃止。 形没名流，伊馨恒存。 若有一子二子，言命色顺，善闻远着，此邑取风，芳歌不辍於路口。 十子兄弟，馨香善恶，其用不同。 故道慈众生，亦与十二种恩等耳。 长成孝顺，其任随意。 是故父母正，知生养孝顺由子，道正，知慈悲恭由百姓。",
      "translated_text": "Why then engage in vain labor? It is better to remain serene and still, following the four qi, employing them to their end. Human life is impermanent, departure and abiding never cease—would it not be better to dwell in ease?\n\nThe disciple says: One may cultivate to attain great fortune, yet if one abandons what cannot be relied upon, striving to attain immortality, one falls into the three lower realms. By reverently practicing divine blessings, disgrace and misfortune arrive—how can this compare to the task of pure and true non-action, the teaching of vain striving, the method of no benefit?\n\nThe answer says: That which is pure and true is the Dao itself. If one practices it, one practices it for oneself; if one strives for it, one strives for oneself; if one reveres it, one reveres it for oneself; if one reveres and upholds it, one does so for oneself—what benefit does this bring to the pure and true? One seeks benefit for oneself, not to benefit the pure and true; one seeks deliverance for oneself, not to deliver the pure and true; one strives to cultivate for oneself, not for the pure and true to strive; one seeks the Dao for oneself, not for the Dao to seek one.\n\nThus, the perfected person first endures hardship and toil, then obtains great joy; first reveres and upholds, then attains true honor. If one disgraces the Dao, one harms oneself; if one slights the true, one slights oneself; if one abandons the Dao, one abandons the Dao for oneself; if one slanders the true, one slanders the true for oneself. Why is this so? One curses the echo, not the echo cursing one; one reviles the true, not the true reviling one; one slights the Dao, not the Dao slighting one; one brings misfortune upon the Dao, not the Dao bringing misfortune upon one; one destroys the Dao, not the Dao destroying one; one poisons the Dao, not the Dao poisoning one.\n\nWhy is this so? It is like a strong crossbow shooting at the sky—its arrow must return. Thus, one shoots at the sky oneself, not the sky shooting at one; one curses the echo oneself, not the echo cursing one. Therefore, poison does not move of itself, misfortune does not arise of itself—all is summoned by the actions of body, mouth, and mind.\n\nThus, the body is the root of the three evils and the foundation of immortality. It is called:\n1. The field of good fortune,\n2. The garden of suffering,\n3. The household of seeds,\n4. The gate of distant life,\n5. The realm of the Dao,\n6. The village of pus and blood,\n7. The vessel of treasures,\n8. The bowl of shards,\n9. The chamber of bright wisdom,\n10. The darkness of the nine nights.\n\nOne who understands this principle may be called a perfected person. When merit is complete and virtue is perfected, one becomes the boundless honored one of the three realms. Ever joyful, without limit, one becomes the distant and lofty Supreme Immortal. Adorned with myriad excellences, vast wisdom spans the great thousand worlds. Merit and virtue are not false, and in the Dark Capital, causes and conditions are reckoned. Hearing this and generating a good mind, one is without a single karmic tie for ten thousand kalpas. Following one’s karma, one scatters and departs—hell, hungry ghosts, and animals become one’s familial cause.\n\nThe Discerner says: As the Heavenly Worthy has said, one seeks the Dao for oneself, not the Dao seeking one; one seeks deliverance for oneself, not the Dao delivering one. Therefore, teachings are established, texts preserved, prohibitions and precepts set forth to restrain and guide. If the Dao does not seek to deliver people, why should it institute methods and teachings to move the people and all beings? If the Dao does not rely on people, what then should people devote themselves to? Is it because the Dao is good for the people and esteems their kinship?\n\nThe answer says: The Dao has no partiality—does its transformation extend to all? People draw near to the Dao themselves, and through resonance, results are attained. Prohibitions and teachings are not applied to one alone but extend to all. Yet it is people themselves who seek prohibitions and precepts, restraining body and mind, binding speech and conduct.\n\nThus, what does the Way of the sage seek? Only that those with minds set their will upon it! Therefore, people can magnify the Dao, but the Dao does not magnify people. The Great Dao is non-action, abiding in spirit with tranquil indifference—what does it seek from people? It is people who magnify themselves, not the Dao that magnifies them.\n\nThus, the nature of the Dao universally nurtures, not just one kind—why should it exclusively magnify humans? In the lands of the ten directions and the great thousand worlds, with myriad forms and names, all are reached by it, yet it does not rely on one kind to transform all. Thus, it universally pervades all forms and names—how could it magnify humans alone?\n\nHow is this known? The Dao generates heaven and earth, establishes yin and yang, arranges the sun and moon, sets the stars in place. It circles the heavens in three hundred and sixty-five degrees, with the calculations of waxing and waning, the four seasons alternating in succession, not a hair’s breadth in error. It gives birth to the forms and names of people and the myriad kinds, crafting all things—how could it magnify humans alone? Thus, it does not magnify humans alone.\n\nTherefore, all superior beings seek the Dao for themselves and seek deliverance for themselves. Why is this so? It is like water: one seeks to cross it, and so comes to cross the water. One knows that water does not cross people—people cross themselves. Thus, the Dao does not deliver people; people seek the Dao themselves. The Dao does not covet the people; the people covet the Dao themselves. If the Dao coveted the people, there would be distinctions of near and far; if the Dao coveted deliverance, there would be natures of advance and retreat.\n\nThus, the nature of the Dao is tranquil and indifferent, without partiality or favoritism, without self or other. Its compassion and kindness nurture all equally. Why is this so? It is like giving birth to ten children: when they are infants, one universally loves and cherishes them, without desire to abandon any. If there is the slightest discord, one rushes to consult shamans and diviners, inquiring about their future. Hearing of decline, one’s liver shatters; hearing of good fortune, one leaps with joy. One nurses and rears them with tender care, anxious for their growth.\n\nYet when they mature, they focus solely on their own plans, turn against their parents, disobey commands, reject teachings, show no harmony in countenance, speak with hostility, and utter harsh words near and far, so that neighboring villages regard them with disdain. Their evil deeds fear the shadow, and they flee in haste, ceasing only at death. Though their forms perish, their names endure—fragrant or foul, ever present.\n\nIf one or two children are obedient in word and fate, harmonious in countenance, their goodness is heard of far and wide, and their village follows their example, with songs of praise never ceasing at the crossroads. Among ten siblings, fragrant or foul, their uses differ. Thus, the Dao’s compassion for all beings is like the twelve kinds of parental kindness.\n\nWhen they mature and are filial, their conduct follows their own will. Therefore, when parents are upright, they know that the filiality of bearing and rearing depends on the child; when the Dao is upright, it knows that the reverence and devotion of the people depend on the people themselves.",
      "overlap_context": "t exalted; rejected, it is not diminished.\nRevered, it receives no benefit; slighted, it is not uprooted.\nNeither diminished nor enhanced, it abides in effortless non-action.\n\nThe Discerner says:\nPure and true, non-action—without reliance or attachment.\nSlandered, it is not disgraced; praised, it is not glorified.\nRevered, it gains no benefit; slighted, it suffers no loss.\nWithout harm or disgrace, it is simply non-action—\nwhy then expound teachings? Why require devotion? Why strive to practice?",
      "start_char": 322,
      "end_char": 1555,
      "start_sentence": 20,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.12864136695862,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "是以道慈众生，如母爱子，无有亲疏，亦无贪物。 道慈母爱，亦复如是。 辩夫曰：受#3 恩。 更问余解。 如天尊所说，道慈众生，如母爱子，普哀一切，无有遗弃。 窃见世间有苦厄之人，进不得生，退不肯死，哀悲摧碎，树木啼泣，六畜沾津，飞鸟哀鸣，视者忘身，听者酸零，苦楚伤割，不可处之。 道若大慈，应哀念之，矜济救度，免脱斯苦。 道不哀怜，叵不矜济，推斯证验，将知道无慈悲，恩及一切。 昔孤童之感河尸绝流，弃婴繁阳，灵狩乳弃。 山河尚复矜感，而况於道乎？ 推缘之应，将知道不有慈，圣不有悲，独立不群，无为之任也。 答曰：一切众生，各有缘品，若忧若悲，若苦若恼，先业定也。 如是河尸弃婴，所以流绝，灵狩乳者，悉吾遣蛟龙绝流，灵狩养婴，汝知不乎？ 所以知之，水正知流行，虎正知杀害，何故不尔，以吾故耳！ 辩夫曰：道若有感，则无忧苦，若道慈悲，则无孤遗。 所以天下涂炭，乃至灭身而无其救，将知无感无慈，任化而已。 若当不尔，道有二种，一主贫苦孤厄灾祸，一主长寿富乐自然。 类族斯义，当知有二也。 答曰：一切众生，各有因缘，长短苦乐，居然定分，无可移易。 先业既定，报亦难准，是以业果不妄，取报无殊。 譬如种植，随种而生，岂有非类而生者哉！ 贫富苦乐之果，亦复如是。 所以者何？ 一母生子，乃至四五，长短黑白，正陋不同，寿命贵贱，各不一等，将知先业所种不可移也。 如汝所问，悉得闻知。 天尊曰：夫也，非汝所问，则众不知，非汝所访，则众不决。 今汝起一灯之照，足充万里之光，汝若有滞，未足为滞，汝若有惑，未足为惑。 辩夫曰：受恩。 但六弊不知，疑惑者多，虽问数事，得释理趣，余滞比肩，实心不尽，意欲更问。 天尊曰：若有疑必问，勿使抱惑怀疑，以迷当年也。 辩夫曰：重受天恩。 如天尊所说，一切众生，各有缘品，贫富苦乐，居然定分，贵贱长短，各受先业。 不审贫苦孤贱，更可修善得福，遇时不为，即流转涉恶而生#4 。 唯愿天尊告其因缘，所请得了，令诸贫苦不及之人，悉得闻知。 答曰：汝之所问，甚要甚妙，端坐谛听，为汝说之。 夫一切众生，若苦若乐，若贵若贱，一由先身所造因业，今之所报。 若诸贫苦不及之人，当知贫苦不可居处，勉力修斋布施，屈伸礼拜，香水供养，助人担重，路避老厄，行斋劝化，众善备至，当来悉获太真之道，而言贫苦乎！ 贫人布施铢两，当同国王百金，苦中行道一礼，当同一身出家。 何以故？ 居贫不足，应惜不惜，施功高大，不可称量。 苦者无聊，不应忆道，而一礼者，故可当慢士一世出家。 是故汤中出莲华，可谓难乎！ 故业无常定，作之皆报。 但患贫苦，可知有道，恒不及人； 但患孤贱，不信因缘，常居孤贱。 是以真人见是畏故，行学修道，故成真人。 若苦恼众生，知於苦可恶，知於乐可欲，苦而行之，亦与十仙同等。 何以故？ 知苦行苦，故终无苦。 觉贱不处，故能去贱。 何以故？ 一切众生，悉有乐性，悉有苦性。 自一仙以下，苦乐之性，莫不居之； 自一仙以上，永与苦别，而况於道乎？ 故一切众生，业无常定，随造便报，岂有种类也。 辩夫曰：受恩。 愿问余解。",
      "translated_text": "Thus does the Dao cherish all beings as a mother loves her child—without partiality, without desire for gain. The Dao’s compassion and a mother’s love are alike in this.\n\nThe disputant said: \"We receive the third grace. I would ask further of its meaning.\"\nAs the Heavenly Worthy has said, the Dao cherishes all beings as a mother loves her child, universally pitying all without abandonment. Yet I observe in the world those who suffer calamity—unable to advance in life, unwilling to retreat in death—whose sorrow shatters the heart, whose weeping moves the trees, whose tears wet the beasts, whose cries grieve the birds. Those who see forget themselves; those who hear weep in sorrow. Their anguish and torment cannot be endured. If the Dao is truly great in compassion, should it not pity and save them, delivering them from such suffering? If the Dao does not pity or save, then by this evidence, can we say it possesses compassion or extends grace to all?\n\nIn ancient times, the orphaned child’s grief moved the river’s corpse to halt its flow; the abandoned infant at Fanyang was suckled by a divine beast. Even mountains and rivers respond with compassion—how much more should the Dao? By this reasoning, can we say the Dao lacks compassion, that the Sage lacks sorrow, that it stands alone and apart, bearing the burden of non-action?\n\nThe answer came: All beings possess their own karmic conditions. Whether sorrow or grief, suffering or affliction, these are predetermined by past deeds. Thus, the river’s corpse and the abandoned infant—why did their currents cease? Why was the infant nursed? It was I who sent the dragons to halt the flow and the divine beast to nourish the child. Do you not know this? The river spirit knows the flow of water; the tiger knows its killing. Why do they not act thus? It is because of me!\n\nThe disputant said: If the Dao is responsive, then there should be no suffering. If the Dao is compassionate, then none should be forsaken. Yet the world lies in ashes, and even those who perish receive no deliverance. Does this not prove there is no responsiveness, no compassion—only the workings of transformation? If not, then there must be two Daos: one that governs poverty, suffering, orphanhood, and disaster, and another that governs long life, wealth, and natural bliss. By this reasoning, we must acknowledge there are two.\n\nThe answer came: All beings possess their own causes and conditions. Longevity or brevity, suffering or joy—these are fixed and unalterable. Past karma is already set; its retribution cannot be uniform. Thus, the fruits of karma are never false, and their recompense is without exception. It is like planting seeds: what grows follows what was sown. Can anything grow from what is not its kind? The fruits of poverty and wealth, suffering and joy, are likewise.\n\nWhy is this so? A single mother may bear four or five children, yet their height, complexion, beauty or ugliness, lifespans, and stations in life all differ. This proves that the seeds of past karma cannot be altered. As for your questions, you have now heard the answers.\n\nThe Heavenly Worthy said: Were it not for your inquiries, the multitude would remain ignorant. Were it not for your seeking, the multitude would never resolve their doubts. Now, the light of your single lamp suffices to illuminate ten thousand miles. If you still have doubts, they are not truly doubts; if you remain perplexed, it is not true perplexity.\n\nThe disputant said: \"I receive this grace. Yet the six defilements remain unclear, and my doubts are many. Though I have asked several questions and gained some understanding, lingering uncertainties crowd upon me. My heart is not yet at ease, and I wish to ask further.\"\n\nThe Heavenly Worthy said: \"If you have doubts, you must ask, lest you carry confusion and uncertainty, losing your way in this very life.\"\n\nThe disputant said: \"I humbly receive this heavenly grace once more. As the Heavenly Worthy has said, all beings possess their own karmic conditions; poverty and wealth, suffering and joy, high and low station, long and short life—all are received according to past karma. But I wonder: for those who are poor, suffering, orphaned, or lowly, if they cultivate goodness and accumulate merit, can they still attain blessings? If they do not seize the opportunity, will they continue to wander through evil rebirths? I beseech the Heavenly Worthy to explain these causes and conditions, that all who are poor and suffering may hear and understand.\"\n\nThe answer came: \"Your question is most essential and profound. Sit upright and listen carefully, for I shall explain. All beings—whether suffering or joyful, noble or base—receive retribution in this life according to the karma they cultivated in past lives. For those who are poor and suffering, know that poverty is not a place to dwell. Exert yourselves in fasting, almsgiving, bowing in reverence, offering incense and water, helping others bear their burdens, yielding the path to the elderly and distressed, practicing abstinence, and exhorting others to goodness. When all these virtues are fulfilled, you shall attain the Way of the Great Perfected. Can you then still speak of poverty?\n\nA poor man’s offering of a few coins is equal to a king’s gift of a hundred gold pieces. A single bow from one in suffering is equal to a lifetime of renunciation. Why? In poverty, one has little to spare, yet if one gives without reluctance, the merit is vast and immeasurable. In suffering, one has no leisure, yet if one remembers the Dao and bows even once, it surpasses the lifelong renunciation of the indolent. Thus, a lotus blooming in boiling water—can this not be called difficult? Karma has no fixed constancy; all actions receive their due recompense.\n\nThe danger lies in poverty itself—knowing there is a Dao yet always falling short of others. The danger lies in orphanhood and lowliness—failing to believe in causes and conditions, thus remaining forever in that state. Therefore, the true person, seeing this peril, cultivates and studies the Dao, and so becomes a true person. If suffering beings recognize the repugnance of suffering and the desirability of joy, and practice accordingly, they are equal to the Ten Immortals. Why? Knowing suffering, they endure it, and so ultimately transcend it. Recognizing lowliness, they abandon it, and so escape it.\n\nWhy is this so? All beings possess the nature of joy and the nature of suffering. Below the rank of the Immortals, all dwell within these natures of suffering and joy. Above the Immortals, they forever part from suffering—how much more so the Dao? Thus, the karma of all beings has no fixed constancy; retribution follows action without exception. How can there be any distinction of kind?\"\n\nThe disputant said: \"I receive this grace. I would ask further of its meaning.\"",
      "overlap_context": "ple, with songs of praise never ceasing at the crossroads. Among ten siblings, fragrant or foul, their uses differ. Thus, the Dao’s compassion for all beings is like the twelve kinds of parental kindness.\n\nWhen they mature and are filial, their conduct follows their own will. Therefore, when parents are upright, they know that the filiality of bearing and rearing depends on the child; when the Dao is upright, it knows that the reverence and devotion of the people depend on the people themselves.",
      "start_char": 1555,
      "end_char": 2785,
      "start_sentence": 95,
      "end_sentence": 151,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.22683262825012,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "不审十方恒沙真人，一切得道大圣众，为禀何炁而生，为习何道而致斯业乎，得如今之报也？ 答曰：十方恒沙真人，得道圣众者，莫不悉从修本相是经之人也。 夫本相者，大无不包，细无不入，广演言教，广度天人无量，亦如恒河沙之众，不可称记，亦如江汉浮桥，肇劫水首以来，度人无量，不可胜数。 本相开化以来，度诸圣众，亦复如是。 如汝修行经典，斋戒不绝，功德满足，亦与十仙等耳。 如十仙本悉因凡夫苦恼，苦行至致光明也。 何况子之前业广阔，逮乎今身，聪茂渊溢，解了玄宗，其功等於昆仑，其德同於渊海，十仙之期，毫分不失。 何以故？ 子两镜#5 相照者，其暗普灭，游乎上清之道； 金书玉隐，紫解注名，亦如影生前晖，定於中阳。 子之德宗，亦复如是。 辩夫曰：如是如是，得道圣众，去如恒河沙之数，无有返者，今始修学，亦如恒河沙数，有终期而无尽也。 若当不尽，去不休停； 若当有尽，因缘即灭，唯愿分别。 答曰：如是如是，去如恒沙，不足为多。 九天数终，乾坤灰扬，尔时蝼蚁、一切蠕动，皆发善心，动经千天，得道之众，未足为多。 蠕动皆发善心，万类之众，普迁七宝玉京紫微之中，动经千天，得道之众，未足为多。 是故空不可满，虚不可实，故名#6 不可思议之场也。 珠口纳众由不盈狭，长乐广包由不充徧，而况於空虚乎？ 辩夫曰：受恩。 更问余解。",
      "translated_text": "\"Now, I inquire: of the true persons as numerous as the sands of the ten directions and all the great sage assemblies who have attained the Dao—by what qi were they born, and by practicing what Dao did they achieve this karma, thus receiving their present retribution?\"\n\nThe answer came: \"The true persons as numerous as the sands of the ten directions and the assemblies of sages who have attained the Dao—none are not those who have cultivated the *Scripture of Original Form*. The Original Form encompasses all that is vast and enters all that is minute; its teachings widely expounded, it delivers boundless heavenly and mortal beings, as numerous as the sands of the Ganges, beyond reckoning or record. Like a floating bridge across the Yangtze and Han, since the beginning of the kalpas at the source of the waters, it has delivered beings without measure, beyond count. Since the revelation of the Original Form, the deliverance of all sage assemblies has been likewise.\n\nIf you cultivate the scriptures, maintaining unbroken purification and precepts, your merit and virtue complete, you too shall be equal to the Ten Immortals. For the Ten Immortals originally arose from the suffering and toil of ordinary beings, enduring hardship to attain radiant illumination. How much more so for one whose past karma is vast, whose present life is endowed with keen intelligence, profound wisdom, and penetrating insight into the mysterious origin? Your merit equals Mount Kunlun, your virtue matches the abyssal sea; the attainment of the Ten Immortals is not even a hair’s breadth beyond you.\n\nWhy is this so? When your two mirrors reflect one another, all darkness is universally dispelled, and you wander the Dao of the Upper Clarity. The golden script and jade secrets, the purple writ recording your name—like a shadow born of preceding radiance, you are fixed in the Central Sun. Your virtue and origin are likewise.\"\n\nThe disputant said: \"So it is, so it is! The assemblies of sages who have attained the Dao depart in numbers like the sands of the Ganges, with none returning. Now, those who begin cultivation are also as numerous as the sands of the Ganges—will they reach an end, or is there no limit? If there is no end, they will depart without cease; if there is an end, causes and conditions will perish. I humbly request clarification.\"\n\nThe answer came: \"So it is, so it is! Their departure in numbers like the sands of the Ganges is not considered many. When the reckoning of the Nine Heavens is exhausted and heaven and earth are reduced to ashes, even then the ants and all creeping things will arouse the mind of goodness. After passing through a thousand heavens, those who attain the Dao will still not be considered many. When all creeping things arouse the mind of goodness, the multitudes of the ten thousand kinds will universally ascend to the Jeweled Capital within the Purple Tenuity. After passing through a thousand heavens, those who attain the Dao will still not be considered many.\n\nThus, emptiness cannot be filled, and the void cannot be made substantial—this is called the *inconceivable realm*. A pearl’s mouth receives the multitudes yet is not cramped; the boundless expanse of eternal joy contains all yet is not filled. How much more so for emptiness and the void?\"\n\nThe disputant said: \"I receive this grace. I would ask further of its meaning.\"",
      "overlap_context": "andon it, and so escape it.\n\nWhy is this so? All beings possess the nature of joy and the nature of suffering. Below the rank of the Immortals, all dwell within these natures of suffering and joy. Above the Immortals, they forever part from suffering—how much more so the Dao? Thus, the karma of all beings has no fixed constancy; retribution follows action without exception. How can there be any distinction of kind?\"\n\nThe disputant said: \"I receive this grace. I would ask further of its meaning.\"",
      "start_char": 2785,
      "end_char": 3327,
      "start_sentence": 152,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.15548610687256,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "如天尊所说，劫末运终，普皆成道，无有逋留。 展转化生者，当尔何假於教，何求於师，何劳於懃，何托於法，徒自涉苦懃耳，不如端拱，自求生养鸡黍之肴矣。 答曰：夫百年之苦，不如一年受乐而死，粗布十端，不如色锦一丈。 鸟雀岂不受命三百，不如人受一年。 居铁百斤，不如金钱十文。 欲许千金，不如交粟一斛。 待百世之王，不如足食之贵。 譬如博弈，贵其前出，先者为胜，终不留负，留负者，即是身之累也，担愧负累，雇业以偿，东作失利，遂致困乏。 留负子孙，恒居不足，托命债力，投身死地，男卑女贱，人不仳之，博弈之负，乃至如斯。 所以者何？ 博之前出者，譬成道真，留负者，譬三涂。 是以真人早行修道，今得八解之果，常乐无为，其德无量。 何以故？ 譬如种植，先种前食，中种中食，晚种晚食，不种无所收食，若遇颠灾，无可收拾，主施散给，尔乃得之。 不造而望果者，亦复如是。 何以故？",
      "translated_text": "As the Heavenly Worthy has said: when the kalpa’s end arrives and its destiny is fulfilled, all beings will universally attain the Dao, with none left behind. For those who undergo endless rebirths—what need then for teaching, what pursuit of a master, what toil in diligent practice, what reliance on the Dharma? All such efforts would be but self-imposed hardship. Would it not be better to sit in tranquil repose, seeking only the sustenance of millet and fowl?\n\nThe reply: A hundred years of suffering is not equal to one year of joy before death. Ten bolts of coarse cloth cannot compare to a single length of brocade. Do not birds and sparrows live out their three hundred days of fate? Yet they are not equal to a human’s single year. A hundred pounds of iron are not worth ten copper coins. A thousand taels of promised gold cannot match a single *hu* of grain. To await the reign of a king for a hundred generations is not as noble as the worth of a full meal.\n\nIt is like gambling: the first to play holds the advantage, and the one who moves first wins. There is no lingering debt, for to linger in debt is to become a burden to oneself. Carrying shame and debt, one hires out labor to repay it, yet misfortune in the fields leads to ruin. The debt is passed to one’s children, who live in perpetual want, pledging their lives to repay it, casting themselves into the realm of death. Men are debased, women abased; none regard them with favor. The debt of gambling reaches such extremes.\n\nWhy is this so? The first to play in gambling is like one who truly attains the Dao; the one who lingers in debt is like one who falls into the Three Wretched Realms. Thus, the perfected person practices the Dao early and now reaps the fruit of the Eight Liberations, ever abiding in joy and non-action, their virtue measureless.\n\nWhy is this? It is like planting: those who sow early reap early, those who sow in season reap in season, and those who sow late reap late. Those who do not sow have nothing to harvest. If calamity strikes, there is nothing to gather, and only when the master bestows alms does one receive. To expect fruit without cultivation is just the same.\n\nWhy is this so?",
      "overlap_context": "ithin the Purple Tenuity. After passing through a thousand heavens, those who attain the Dao will still not be considered many.\n\nThus, emptiness cannot be filled, and the void cannot be made substantial—this is called the *inconceivable realm*. A pearl’s mouth receives the multitudes yet is not cramped; the boundless expanse of eternal joy contains all yet is not filled. How much more so for emptiness and the void?\"\n\nThe disputant said: \"I receive this grace. I would ask further of its meaning.\"",
      "start_char": 3327,
      "end_char": 3692,
      "start_sentence": 173,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.355872869491577,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "譬如百岁任重，岂可越投，十年囹圄，岂可竟之。 遥望十年之甘，时当昧也，指日而须者，未可致。 是以真人知未望之望，故绝望而获望，知未果之果，故绝果而得果。 何以故？ 譬作田耨，恃天而雨者，将不遂其愿，不如先治渠堰，引水溉灌，定可获也。 天非不无雨，但恐炎阳而败，饥馑艰辛，命不延久。 劫末非不无道，但恐三涂而不可免脱。 是以真人畏是故，故先求道，其真既崇，永无忧败，常生无为，为於无为之为，任於无任之任，托於无托之托，寄於无寄之寄，居於无想之想，处於无着之着。 是故圣人尚於初业，贵於先功。 何以故？ 贵於先功，尚於学士也。 三元九厄，殃灾叵遇，有能逊心修道者，普得免脱也。 是以圣人尚於先功，贵於初业。 若有志於道者，悉由初业也。 初业者，是罪之因，先功者，前举之功，故贵功而尚业乎。 不贵不尚者，与诸六畜同之，所以者何？ 六畜不知有道，岂识功业之妙理，故同六畜耳。 辩夫曰：受恩。 愿问余解。",
      "translated_text": "Just as one burdened for a hundred years cannot cast off the load in an instant, nor can one imprisoned for a decade escape confinement at will. To gaze longingly at the sweetness of ten years ahead is to be deluded by the moment; to demand immediate fulfillment is to seek what cannot yet be attained. Thus, the perfected person, knowing the folly of distant longing, cuts off longing and thereby attains it; recognizing the emptiness of unripened fruit, forsakes the fruit and thus gains it.\n\nWhy is this so? It is like tending fields: those who rely on heaven’s rain may not see their wishes fulfilled, but those who first dig channels and weirs, guiding the water to irrigate, will surely reap a harvest. Heaven is not without rain, yet scorching sun may still bring ruin, famine, and hardship, cutting short one’s days. The end of the kalpa is not without the Dao, yet the Three Wretched Realms may still prove inescapable.\n\nTherefore, the perfected person, fearing this, seeks the Dao early. Once their truth is exalted, they know no defeat or sorrow, ever abiding in non-action. They act through the non-action of action, entrust themselves to the non-entrustment of entrustment, lodge in the non-lodging of lodging, dwell in the thoughtless thought, and reside in the unattached attachment. Thus, the sage values the first endeavor and honors the initial work.\n\nWhy is this so? To honor the first endeavor is to esteem the scholar’s learning. The Three Primes and Nine Calamities bring misfortunes that cannot be avoided, yet those who humble their hearts and cultivate the Dao universally escape them. Thus, the sage values the first endeavor and honors the initial work. All who aspire to the Dao must begin with the initial work.\n\nThe initial work is the cause of transgression; the first endeavor is the merit of prior action. Therefore, merit is valued and work is esteemed. Those who neither value nor esteem are no different from the six kinds of livestock. Why is this so? The six kinds of livestock know nothing of the Dao, nor do they comprehend the subtle principle of merit and work—thus they are no different from livestock.\n\nThe disciple said: I receive your grace. I humbly seek further explanation.",
      "overlap_context": "n practices the Dao early and now reaps the fruit of the Eight Liberations, ever abiding in joy and non-action, their virtue measureless.\n\nWhy is this? It is like planting: those who sow early reap early, those who sow in season reap in season, and those who sow late reap late. Those who do not sow have nothing to harvest. If calamity strikes, there is nothing to gather, and only when the master bestows alms does one receive. To expect fruit without cultivation is just the same.\n\nWhy is this so?",
      "start_char": 3692,
      "end_char": 4074,
      "start_sentence": 189,
      "end_sentence": 207,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.786619901657104,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "世有学士受师教法，修行道德，动经年劫而不成立，复有学士修行道德，未必多年而致太真无为之任者何？ 答曰：学士修道，贵在会理。 多年而无成者，心不会理。 譬如跛(疒十可)规於万里之所，日涉不过十里，三年乃达其所趣。 复有一人，俱与一处，同涉一趣，及其驰涉，日行三百，不过月旬而达所趣。 学士心会，亦复如是，譬如飞步，难为及也。 何以故？ 一人乘龙，一人步涉，岂可相逐？ 里趣同所，飞涉不等； 学士志道，不同一等。 或形染道法，心存有中； 或假真专伪，妄泄秘要； 或言如真人，心怀良贱； 或口诵明文，心不专一； 或身居上学，迷贪财色； 或矫假高贵，威赫愚俗。",
      "translated_text": "Scholars in the world receive their masters’ teachings and cultivate the Way and virtue, yet some labor for kalpas without attainment, while others, though not necessarily practicing for many years, ascend to the office of the Great Perfection and Non-Action—why is this?\n\nIt is answered: For scholars who cultivate the Dao, the essence lies in comprehending the principle. Those who spend many years without success do so because their minds fail to grasp the principle. It is like a lame man attempting a journey of ten thousand li: though he walks daily, he covers no more than ten li, and only after three years does he reach his destination. Another man, setting out from the same place and bound for the same destination, travels swiftly—covering three hundred li a day—and arrives within a month. The scholar whose mind comprehends the principle is likewise: like one who strides as if flying, none can overtake him. Why? One rides a dragon, the other walks on foot—how can they keep pace? Though their destinations are the same, their speeds differ; though scholars aspire to the Dao, their capacities are not equal.\n\nSome embody the Dao’s teachings yet harbor attachments in their hearts; some feign authenticity while secretly practicing deceit, recklessly divulging esoteric essentials; some speak as if they were perfected beings yet harbor base intentions; some recite sacred texts with their lips while their minds wander; some occupy high positions in learning yet remain deluded by greed for wealth and sensuality; some falsely assume grandeur, overawing the foolish with pomp.",
      "overlap_context": " the initial work.\n\nThe initial work is the cause of transgression; the first endeavor is the merit of prior action. Therefore, merit is valued and work is esteemed. Those who neither value nor esteem are no different from the six kinds of livestock. Why is this so? The six kinds of livestock know nothing of the Dao, nor do they comprehend the subtle principle of merit and work—thus they are no different from livestock.\n\nThe disciple said: I receive your grace. I humbly seek further explanation.",
      "start_char": 4074,
      "end_char": 4338,
      "start_sentence": 208,
      "end_sentence": 223,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.5701704025268555,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "如斯之士，定入三涂，道在何处，未熟之闻#7，并可逐侣，虽行世界，即是行尸狱也。 一切学士，岂得同之！ 所以者何？ 譬如辩意，一人作意，十人辩之，一人作难，十人射之，值之者若一若二，射着者若两若三，其意岂不同一，但所见不同。 会以不会，亦复如是。 辩夫曰：受恩。 更问余解。 窃见世中，十人五人，同时出家，随心所好，各奉一师，修行道德，不舍昼夜。 一师之徒，悉得五通之果，一师之徒，无有异悟。 若依其年，年则同之，若依其懃，懃劳等所，一师之徒独进，一师独不进。 答曰：师有明暗，故有进否。 所以者何？ 师者，即是道之门户也。 若有明师，善知经义，观今玄宗，辨道冥趣，教授礼拜，勅诲如法，依文演授，将入法会，约之以礼，尊之以律，日日增受，形殊见等，若远若近，寻之明了。 兢惧威神，恒恐驰趣，日夜翘勤，专守不移，炁和神柔，形魂畅悦，神晖授引，拥将真道，孔务三真，将感玄应，敷教回景，猛狩依附，三师进策，加研转神。 五通之果，因功而得，将来定受玄纪无为之果也。 所以者何？ 明师者，百道之关梁。 譬如入海采於众宝，先知投简名刺之法，牢船铁，沉帐#8 帆，设轩之诣宝所，缀沉浮船，乃发沙石炮，营坟煎取，若多若寡，来往莫蹶。 奉逐明师亦如是。 何以故？",
      "translated_text": "Such scholars are bound for the Three Wicked Realms—where then is the Dao for them? Those who have not yet matured in their understanding may follow such companions, yet though they traverse the world, they are but walking corpses in a prison of their own making.\n\nHow can all scholars be equated with these? Consider this analogy: when one sets forth an idea, ten debate it; when one raises a challenge, ten aim their arrows at it. Some may hit the mark once or twice, others two or three times—yet is their intent not the same? Only their perceptions differ. Those who comprehend and those who do not are likewise divided.\n\nThe debater says: \"I am indebted.\" Yet further questions remain. I observe in the world five or ten who leave home together, each following their inclination to serve a master, cultivating virtue and the Dao without cease, day or night. The disciples of one master all attain the fruit of the Five Penetrations, while the disciples of another master gain no distinct awakening. If measured by years, their time is the same; if measured by diligence, their labor is equal—yet the disciples of one master advance alone, while those of another do not. The answer lies in the master’s clarity or obscurity, hence the difference in progress.\n\nWhy is this so? The master is the gateway to the Dao. If the master is enlightened, deeply versed in scriptural meaning, discerning the profound mysteries of the present age, and able to distinguish the subtle tendencies of the Dao; if they instruct in rituals and prostrations, admonish in accordance with the Dharma, expound the texts to guide disciples into the Dharma assembly, restrain them with propriety, honor them with discipline, and daily impart increasing teachings—then though their forms may differ in appearance, whether near or far, their understanding becomes clear. Filled with reverent awe for the divine, ever fearful of straying from the path, they remain diligent day and night, steadfast and unwavering. Their qi harmonizes, their spirit softens, their form and soul rejoice, and the radiance of the spirit guides them, ushering them into the true Dao. They diligently serve the Three Perfected, invoking profound responses, spreading teachings to turn back the shadows, fiercely pursuing and adhering to the path. With the urging of the Three Masters, they refine and elevate their spirit. The fruit of the Five Penetrations is attained through merit, and in the future, they will surely receive the wondrous reward of the formless Dao.\n\nWhy is this so? The enlightened master is the bridge to all paths. It is like entering the sea to gather treasures: one must first know the method of presenting one’s name and credentials, secure the ship with iron, lower the anchor, furl the sails, and set the rudder toward the treasure’s location. One must moor the floating vessel, then deploy sand-stone cannons, set up furnaces, and smelt the ore—whether much or little, coming and going without stumbling. Following an enlightened master is just the same.\n\nWhy is this so?",
      "overlap_context": "their capacities are not equal.\n\nSome embody the Dao’s teachings yet harbor attachments in their hearts; some feign authenticity while secretly practicing deceit, recklessly divulging esoteric essentials; some speak as if they were perfected beings yet harbor base intentions; some recite sacred texts with their lips while their minds wander; some occupy high positions in learning yet remain deluded by greed for wealth and sensuality; some falsely assume grandeur, overawing the foolish with pomp.",
      "start_char": 4338,
      "end_char": 4845,
      "start_sentence": 224,
      "end_sentence": 244,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.640494585037231,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "譬如万万里重崄之中，甚有金丹、柔琉、八芝，有能进到取而服之者，命同天地，终不横夭#9 。 有闻之者，莫不倾俟，人人应涉取而服之，但患崄阻，悉滞莫进，无不返者。 暗师之徒，亦复如是。 柔琉非不有之，但患悉滞不达； 空中非不有真，但患莫然无趣。 所以者何？ 譬如漏船渡水，水满必没，湍浮广水，中流必沉。 远所八芝，重崄必返。 入海采宝，不投简刺，舟船必翻。 师徒无德，亦复如是。 是以真人终不自师，故能成师； 终不自明，故能成明； 终不自我，故能成我； 终不自智，故能成智； 终不自见，故能成见； 终不自高，故能成高； 终不自德，故能成德； 终不自彰，故能成彰，终不自用，故能成用； 终不自任，故能成任； 终不自大，故能成大； 终不自美，故能成美； 终不自真，故能成真。 凡此十三，真人所不取。 夫学士之法，甚须良释，忖思行业，未使未任为任，后必成患，未匠为匠，后必伤手。 是以真人不尚其名，其名显矣，不贵其誉，其誉远矣。 故道士务於道，勤於德，托良徒，追明师，讲化律，诵经籍，习仙气，修斋直，思神明，检口过，束五心，逝六情，背阴贼，向生门，行大慈，念一切，哀孤老，矜寒贫。 斯学士之上业，贤者之福田，自非明师之约法，何能如斯？ 是以明师者，道之门户也。 何以故？ 其师明则法教行，其师暗则法教不成。 是以一师之徒获五通之果，一师之徒而无悟感也。 辩夫曰：受恩。 愿闻余解。",
      "translated_text": "Just as within myriad layers of perilous terrain lie golden elixirs, soft lapis, and the Eight Sacred Fungi—should one advance to gather and ingest them, their lifespan would align with Heaven and Earth, never meeting untimely demise—yet though all who hear of this yearn to set forth, each seeks to traverse and partake, the hazards and obstructions leave them stranded, unable to proceed, with none but turning back. So too are the followers of unenlightened masters. Soft lapis is not absent, yet the peril lies in stagnation and failure to reach it; the void does not lack truth, yet the danger is in aimlessness and lack of direction.\n\nWhy is this so? It is like crossing waters in a leaking boat—once filled, it must sink. Adrift upon vast, rushing currents, midstream it must founder. To seek the Eight Sacred Fungi amid towering perils is to surely retreat. To enter the sea in search of treasures without presenting one’s name and credentials is to capsize the vessel. So too is it with master and disciple lacking virtue.\n\nThus the perfected one never takes themselves as master, and so becomes a master; never deems themselves enlightened, and so attains enlightenment; never claims selfhood, and so fulfills the self; never presumes wisdom, and so achieves wisdom; never asserts vision, and so gains true sight; never exalts themselves, and so rises in stature; never claims virtue, and so embodies virtue; never seeks prominence, and so becomes renowned; never asserts their use, and so proves useful; never assumes authority, and so gains true authority; never presumes greatness, and so becomes great; never boasts of beauty, and so achieves beauty; never declares their authenticity, and so becomes authentic. These thirteen, the perfected one does not adopt.\n\nThe method of the scholar demands a skilled interpreter—pondering conduct and practice, one must not undertake what is not yet fitting, lest later it become a calamity; one must not act as artisan before mastery, lest later it harm the hand. Thus the perfected one does not pursue fame, yet their fame becomes manifest; does not prize reputation, yet their reputation spreads far.\n\nTherefore, the Daoist devotees themselves to the Dao, diligently cultivates virtue, entrusts themselves to worthy disciples, follows enlightened masters, expounds the precepts of transformation, recites the scriptures, practices immortal qi, observes fasting and integrity, contemplates the divine, restrains verbal transgressions, binds the five hearts, dissolves the six emotions, turns from the yin thief, faces the Gate of Life, enacts great compassion, cherishes all beings, pities the orphaned and aged, and takes pity on the cold and poor. Such are the supreme practices of the scholar, the fertile field of the worthy—without the binding precepts of an enlightened master, how could one attain this?\n\nThus the enlightened master is the gateway to the Dao.\n\nWhy is this so? When the master is enlightened, the teachings flourish; when the master is benighted, the teachings fail. Hence, the disciples of one master attain the fruit of the Five Penetrations, while the disciples of another remain without awakening or response.\n\nThe discerning one says: I receive this grace. I wish to hear the remainder of your explanation.",
      "overlap_context": "ed master is the bridge to all paths. It is like entering the sea to gather treasures: one must first know the method of presenting one’s name and credentials, secure the ship with iron, lower the anchor, furl the sails, and set the rudder toward the treasure’s location. One must moor the floating vessel, then deploy sand-stone cannons, set up furnaces, and smelt the ore—whether much or little, coming and going without stumbling. Following an enlightened master is just the same.\n\nWhy is this so?",
      "start_char": 4845,
      "end_char": 5401,
      "start_sentence": 245,
      "end_sentence": 277,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.63769245147705,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "夫学士断谷服药，得道以不？ 答曰：得。 问曰：何如长斋？ 对曰：不如。 问曰：长斋何如诵经？ 对曰：不如。 问曰； 诵经何如坐思？ 对曰：不如。 所以者何？ 去谷之士，正念药耳，药炁充足，正满千年则终，方更受生，方与始学同耳。 长斋之士，日计其功，功满一万，飞升太空，下超四道，一仙斋直，功满德就，遂成无为至真之道乎。 长斋之果，不可思议，若有诵经之士，亦不可思议。 所以者何？ 读经之士，计文为功，一字一功，功满三千，名列上清，而况广看卷目，长执文籍乎？ 何以故？ 经者，道之教，若读而依行者，即是道之面勅也，是故经者，经纬众生，去贪欲之患。 其患既除，烦恼灾尽，其灾既尽，五毒亦减，众恶既消，万善同会，运邈群仙，得为无上之果。 是以真人宝经而珍之，爱乐如妻子，十仙由斯起，经最为无为首。 学士之为道，亦不可思议#10 。 所以者何？ 思之言念，念之言定，定之言不动，不动者，即用十仙人也。 何以故？ 闲所门故，绝於不正之想，废於非意之意，神亦既定，志亦难夺。 是以真人修行故能定，修经故能正，修斋故能长，仍行而不改，故能成至真。 暂时不去离，功满无上宾，逍遥紫金场，常乐必致身。 一切恒沙众，悉修三业因，功集综十方，岧岧太上仙。 汝当行如是，善着亦如前，莲华足下生，相好恒自然。 辩夫曰：受恩。 更问余解。",
      "translated_text": "Does the scholar who abstains from grains and ingests medicinal herbs attain the Dao?\nThe answer: Yes.\nFurther asked: How does this compare to perpetual fasting?\nAnswered: It is not its equal.\nFurther asked: How does perpetual fasting compare to scripture recitation?\nAnswered: It is not its equal.\nFurther asked: How does scripture recitation compare to seated contemplation?\nAnswered: It is not its equal.\n\nWhy is this so?\nThose who abandon grains rely solely on medicinal herbs; when the qi of the herbs is abundant and full, they may endure for a thousand years before their term ends, only to be reborn anew—no different from a beginner in the end.\n\nThose who practice perpetual fasting tally their merit daily; when merit reaches ten thousand, they ascend to the Great Void, transcending the Four Paths. With a single fast of rectitude, when merit is complete and virtue perfected, they attain the Dao of Non-Action and Supreme Perfection.\n\nThe fruit of perpetual fasting is beyond conception, and so too is that of the scripture-reciting scholar—beyond conception.\n\nWhy is this so?\nThe scripture-reading scholar counts each character as merit; with three thousand merits, their name is inscribed in the Registers of Upper Clarity—how much more so for those who broadly peruse the scrolls and long hold the scriptures?\n\nWhy is this so?\nThe scriptures are the teachings of the Dao; to read and practice accordingly is to face the Dao’s own command. Thus, the scriptures weave the destinies of all beings, dispelling the calamity of greed and desire. When this calamity is removed, afflictions and disasters vanish; when disasters vanish, the Five Poisons diminish; when all evils dissolve, the myriad virtues converge. Then, transcending the host of immortals, one attains the supreme fruit.\n\nTherefore, the perfected treasure the scriptures and cherish them, loving them as they would wife and child. The Ten Immortals arise from this, for the scriptures stand foremost among the practices of Non-Action.\n\nThe scholar’s pursuit of the Dao is likewise beyond conception.\n\nWhy is this so?\n\"Contemplation\" speaks of mindfulness; \"mindfulness\" speaks of stability; \"stability\" speaks of immovability. To be immovable is to employ the power of the Ten Immortals.\n\nWhy is this so?\nBy closing the gates of distraction, one severs wayward thoughts and abandons improper intentions. When the spirit is settled and the will unshakable, the perfected, through cultivation, attain stability; through scripture study, they attain rectitude; through fasting, they attain endurance. Persisting without deviation, they perfect the Supreme Perfection.\n\nThough but a moment’s departure is avoided, when merit is complete, they become guests of the Highest Realm, roaming the Purple Gold Precincts, ever joyful and assured of their destiny.\n\nAll the countless multitudes cultivate the causes of the Three Actions; when merit gathers across the Ten Directions, they ascend as towering Supreme Immortals.\n\nYou must practice thus, and excel as they have: beneath your feet, lotus blossoms arise, and your marks of excellence remain ever natural.\n\nThe discerning one says: I receive this grace. I wish to hear the remainder of your explanation.",
      "overlap_context": "ut the binding precepts of an enlightened master, how could one attain this?\n\nThus the enlightened master is the gateway to the Dao.\n\nWhy is this so? When the master is enlightened, the teachings flourish; when the master is benighted, the teachings fail. Hence, the disciples of one master attain the fruit of the Five Penetrations, while the disciples of another remain without awakening or response.\n\nThe discerning one says: I receive this grace. I wish to hear the remainder of your explanation.",
      "start_char": 5401,
      "end_char": 5933,
      "start_sentence": 278,
      "end_sentence": 307,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.939345359802246,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "如天尊所说，三业其功无量，乃与十仙同论，不可思议，不可称量，不审余业有报不？ 答曰：有。 问曰：如有学士，不修三业，广修宫观，供养之具，悉以布施，得何报乎？ 答曰：天堂自然报。 问曰：受报既已，寄何所居？ 答曰：寄於无常之寄，居於无常之居。 何以故？ 若处报中修行三业，与上道同论，得计无上果。 若处报不修三业，下落於人鸟中，或落三涂中。 故寄於无常之寄，居於无常之居。 问曰：不造四业，专於修坛布散，得何报乎？ 答曰：天厨地藏受报。 问曰：报尽已讫，受何所寄，居何所任？ 答曰：亦无常所寄，何以故？ 若报中当修三业，其果无上，若不尔者，随业堕落，故无常所寄。 问曰：如有志士，不修五业，专於道化，不营俗事，得何报乎？ 答曰：四道难阶，渐修定也。 何以故？ 斯人即在家道人，故若报中修行三业，其功高於三业，上与可进之益，下与进仙齐伦。 是以真人广建福田，无不果也。 何以故？ 真人具种造，故具种报，具种慈，故具种爱。 以造宫观，故今得感宫殿也； 以修坛布散，故今得天厨饮食也； 以道化人，故今得无碍智； 以断五辛，故今得清净身； 以断甘肥，故今得无为形； 以好礼拜，故今得无上尊； 以好不煞，故今得长生寿； 以好赞善，故今得千种声； 以行忍辱，故今得丽妙形； 以不毁辱，故今得众爱敬； 以恒救济物，今得无病患； 以心无爱憎，今得平等智； 以药救众生苦，今得神口良； 以好庄严法，今得紫金身； 以口不妄说，今得莲华舌； 以不逝绝，故今得具种相。 一切不可及，悉由先造长。 真人行如是，超越太上乡。 汝但行如是，前亦不足长。 功集运凑会，兆劫如电光。 逍遥大罗外，坐视大千方。 毫厘若掌珠，珠去就先良。 如斯之德业，悉由万行将。 一善不修备，十仙乘高冈。 勤苦不辞惮，普会至真场。 辩夫曰：受恩。 愿问不解。",
      "translated_text": "As the Heavenly Worthy has declared, the merit of the Three Actions is boundless—equal in discourse to the Ten Immortals, beyond thought, beyond measure. Yet I wonder: do other actions also bear retribution?\n\nThe answer: They do.\n\nIf a scholar, though not cultivating the Three Actions, broadly constructs temples and monasteries, offering all manner of supplies in almsgiving, what retribution shall he receive?\n\nThe answer: He shall naturally receive the retribution of heaven.\n\nAnd once this retribution is received, where shall he dwell?\n\nHe shall dwell in the dwelling of impermanence, abide in the abode of impermanence. Why? If, while within this retribution, he cultivates the Three Actions, his discourse shall equal that of the highest Dao, and he shall attain the supreme fruit. But if, within this retribution, he does not cultivate the Three Actions, he shall descend among men and birds, or fall into the Three Wretched Realms. Thus he dwells in the dwelling of impermanence, abides in the abode of impermanence.\n\nIf one refrains from creating the Four Actions and instead focuses solely on altar rites and almsgiving, what retribution shall he receive?\n\nThe answer: He shall receive the retribution of the Heavenly Kitchens and Earthly Treasuries.\n\nAnd when this retribution is exhausted, where shall he dwell, and what shall be his station?\n\nThe answer: He shall likewise have no permanent abode. Why? If, within this retribution, he cultivates the Three Actions, his fruit shall be supreme. If not, he shall fall according to his karma—thus he has no permanent abode.\n\nIf a person of resolve does not cultivate the Five Actions but devotes himself entirely to the transformation of the Dao, neglecting worldly affairs, what retribution shall he receive?\n\nThe answer: The Four Paths are difficult to ascend; he shall gradually cultivate stability. Why? Such a one is a householder of the Dao. If, within his retribution, he cultivates the Three Actions, his merit shall surpass that of the Three Actions, ascending to the benefits of progress, and below, he shall rank with the advancing immortals.\n\nThus the perfected ones broadly establish fields of merit, and none fail to bear fruit. Why? The perfected ones plant all seeds of action, and thus receive all seeds of retribution; they embody all seeds of compassion, and thus embody all seeds of love.\n\nBy constructing temples and monasteries, they now receive palaces and halls;\nBy performing altar rites and almsgiving, they now receive the heavenly kitchens’ feasts;\nBy transforming others through the Dao, they now attain unobstructed wisdom;\nBy abstaining from the five pungent roots, they now attain a pure body;\nBy forsaking rich and fatty foods, they now attain a form of non-action;\nBy revering prostration, they now attain the highest honor;\nBy cherishing non-killing, they now attain long life and longevity;\nBy praising goodness, they now attain a thousandfold voice;\nBy practicing forbearance, they now attain a wondrously beautiful form;\nBy avoiding slander and insult, they now attain the love and respect of all;\nBy constantly aiding and saving beings, they now attain freedom from illness;\nBy harboring no love or hatred in the heart, they now attain equanimous wisdom;\nBy using medicine to relieve the suffering of beings, they now attain a divine and efficacious tongue;\nBy adorning the Dharma, they now attain a body of purple gold;\nBy refraining from false speech, they now attain a lotus tongue;\nBy never severing the Way, they now attain all marks of excellence.\n\nAll that is unattainable arises from prior cultivation. The perfected ones act thus, transcending the realm of the Supreme Ones. You too must act thus—even what came before is not sufficient.\n\nWhen merit gathers and conditions converge, aeons pass like lightning. Roaming beyond the Great Veil, they sit and behold the great thousandfold worlds, as if a hair’s breadth were a pearl in the palm—when the pearl departs, its luster remains.\n\nSuch are these virtues and deeds, all led forth by the ten thousand practices. If even one good is not fully cultivated, the Ten Immortals ascend the high ridge. Without shrinking from toil and hardship, they universally assemble in the realm of the Supreme Perfected.\n\nThe discerning one says: I receive this grace. I wish to ask what remains unresolved.",
      "overlap_context": "s of the Highest Realm, roaming the Purple Gold Precincts, ever joyful and assured of their destiny.\n\nAll the countless multitudes cultivate the causes of the Three Actions; when merit gathers across the Ten Directions, they ascend as towering Supreme Immortals.\n\nYou must practice thus, and excel as they have: beneath your feet, lotus blossoms arise, and your marks of excellence remain ever natural.\n\nThe discerning one says: I receive this grace. I wish to hear the remainder of your explanation.",
      "start_char": 5933,
      "end_char": 6650,
      "start_sentence": 308,
      "end_sentence": 356,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.114282608032227,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "如天尊所说，十方恒河沙之众，悉从三业而起，不审国主侯王，复作何业，得为人尊？ 其父亦崩而子继之，所以者何？ 若计因缘，则不相承，若计种类，则有断绝，其中差互，疑惑不尽，唯愿天尊告其因缘所从而来。 天尊答曰：善哉！ 如国主侯王，所以世封，以先业所锺，同受其福。 问曰：所以断绝？ 若有福之人，同生受福，应当姓嗣不绝，若不尔者，则无因缘。 答曰：一切贵贱，各有缘品，若先业同，故同一福而受其性也。 何以故？ 譬如佃田，随种而种，因种而生，若改其种，则改种之。 是故一地可易百种，而况一封改绝乎？ 辩夫曰：受恩。 愿问余解。 天尊演说斯义，世之无有。 不审本相从开化以来，为经几劫，为度几人，为度有缘，为度无缘？ 唯愿天尊告其因缘所从而来。 答曰：善哉善哉！ 自本相妙经吾所宗受，动经恒沙劫数，度人无量无边，不可记称，恒与人运同生，与运同灭，海水沾录，由不知之。 如日月登明王之前，得道大圣众，亦如恒河沙之数，莫不悉从本相受学而致道也。 是以本相者，诸经之元王，与道转轮，不可思议#11 。 夫闻天尊所说，悉同受解，便大欢喜，即起三礼，於天尊前长跪稽首，而作偈曰： 千载因缘会，运生落斯形，值遇无上尊，辩说至真经。 请问无不解，道随三业生。 诸善寄无常，流转亦无停。 学士奉明神，法教日以明。 指求无为迹，果感十仙名。 师徒普暗昧，万劫不雕成，盲人涉万险，必坠于大坑。 一师大圣众，悉超至真经。 今自诸来者，万善必令行，不避国王侯，莫不逊心精。 富贵如水泡，不足博为荣。 得道紫金体，本空无为成。 一切贵贱徒，是非在心精。 太上妙法本相经卷上竟 #1 以上《道藏》本原缺，据敦煌P.2357号残卷补。 敦煌本首行前亦有缺文。 #2 形：原作「於」，据敦煌P.2357号残卷改。 #3 受：原作「爱」，据敦煌本改。 #4 生：原作「坐」，据敦煌本改。 #5 镜：原作「影」，据敦煌本改。 #6 名：原作「多」，据敦煌本改。 #7 闻：原作「问」，据敦煌本改。 #8 沉帐：原作「深张」，据敦煌本改。 #9 夭：原作「天」，据敦煌本改。 #10#11 议：原作「谊」，据文义改。 太上妙法本相经卷中 普言",
      "translated_text": "As the Heavenly Worthy has declared, the multitudes of the ten directions—numberless as the sands of the Ganges—all arise from the three karmic actions. Yet how do kings and feudal lords cultivate their karma to become revered among men? Their fathers pass, and their sons succeed them—why is this so? If we reckon by causes and conditions, there is no succession; if by kindred lineage, there are breaks and ruptures. Such discrepancies give rise to endless doubt. We only pray the Heavenly Worthy will reveal the origins of these causes and conditions.\n\nThe Heavenly Worthy replied: Excellent question! The reason kings and feudal lords inherit their domains through generations is that their prior karma has accumulated, and they share in its blessings together.\n\nThe questioner asked: Then why do these lineages sometimes break? If those with blessings share in them together, their surnames and heirs should endure without end. If not, there would be no causes and conditions at all.\n\nThe Heavenly Worthy answered: All ranks, whether noble or base, have their own karmic grades. If their prior karma is the same, they share the same blessings and receive their nature accordingly. Why is this? Consider the farmer who tills the field: he plants according to the seed, and the seed grows according to its kind. If he changes the seed, the crop changes as well. Thus, a single plot of land may yield a hundred different harvests—how much more so the rise and fall of a feudal domain?\n\nThe discerning one said: I receive this grace. I wish to ask further questions. The principles the Heavenly Worthy has expounded are unheard of in this world. Since the revelation of the original form, how many aeons have passed? How many beings have been delivered? Are they delivered because of karmic affinity, or regardless of it? We only pray the Heavenly Worthy will reveal the origins of these causes and conditions.\n\nThe Heavenly Worthy replied: Excellent, excellent! Since the revelation of the wondrous original form, which I have received and upheld, countless aeons—numberless as the sands of the Ganges—have passed. The beings I have delivered are measureless and boundless, beyond reckoning or description. They arise and perish with the turning of the cosmic kalpas, like the records of the sea’s waters—unknown to all. The great sages who have attained the Dao before the radiant kings of sun and moon are also numberless as the sands of the Ganges, and all have studied the original form to achieve the Way. Thus, the original form is the primal sovereign of all scriptures, turning the wheel of the Dao in ways beyond thought or imagination.\n\nUpon hearing the Heavenly Worthy’s discourse, all present gained understanding together and rejoiced greatly. They rose to perform the threefold bow, then knelt and prostrated themselves before the Heavenly Worthy, reciting these verses:\n\nA thousand aeons’ karmic convergence,\nDestiny births this transient form.\nI encountered the Supreme Worthy,\nWho expounded the scripture of utmost truth.\n\nEvery question finds its answer,\nFor the Dao arises from the three karmic actions.\nAll good rests in impermanence,\nIts flow unceasing, never still.\n\nDisciples serve the luminous spirit,\nThe Dharma’s teachings grow ever clearer.\nPointing to the traces of non-action,\nThe fruit attains the name of the Ten Immortals.\n\nMaster and disciple, both benighted,\nThrough ten thousand aeons, no refinement—\nLike the blind traversing myriad dangers,\nSure to plunge into the great abyss.\n\nOne master, a host of great sages,\nAll transcend through the scripture of utmost truth.\nNow, all who have come here\nMust practice the ten thousand virtues,\nUnshaken even by kings and lords,\nNone but submit with sincere devotion.\n\nWealth and rank are but bubbles on water,\nNot worth trading for true glory.\nThe golden-purple body of the attained Dao\nIs originally empty, perfected through non-action.\n\nAll, whether noble or base,\nFind right and wrong in the sincerity of the heart.\n\n*Thus concludes the first scroll of the Heavenly Worthy’s Wondrous Dharma Scripture of the Original Form.*\n\n[The above follows the *Daoist Canon* edition, with lacunae supplemented from Dunhuang manuscript P.2357. The opening lines of the Dunhuang manuscript are also incomplete.]\n\n*Scroll Two of the Heavenly Worthy’s Wondrous Dharma Scripture of the Original Form*\n\nIn general discourse...",
      "overlap_context": " they sit and behold the great thousandfold worlds, as if a hair’s breadth were a pearl in the palm—when the pearl departs, its luster remains.\n\nSuch are these virtues and deeds, all led forth by the ten thousand practices. If even one good is not fully cultivated, the Ten Immortals ascend the high ridge. Without shrinking from toil and hardship, they universally assemble in the realm of the Supreme Perfected.\n\nThe discerning one says: I receive this grace. I wish to ask what remains unresolved.",
      "start_char": 6650,
      "end_char": 7560,
      "start_sentence": 357,
      "end_sentence": 402,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.734142303466797,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "道匠天地，德崇万物，含养无穷，功充合气。 百兽神虫，知道所生，犹尚依亲，悉无害想，而矧神仙之念乎！ 外道不宗，不如百兽神虫之心。 土木可移，外道不受，将知心去身往，神形永止，所见殊异，故神形离索，不同而居。 夫为道也，身心力行，同时而到，不妄不想，专执不动，天雨飞石，火生焚地，地为之出黄泉，黄泉涌沸出，终不暂顾，斯是志士之尚道业也。 乐居於劳山，徒有三千天魔，发山打锻搥掷，乱坠其侧，树木摧折，山崖崩缺，千万段数，亦如飞雪，石不能伤，完端不易，乐心不摇，存念如故。 复有炬焰百数，竞来恐赫，林木燋燃，荡无苗果，乍来乍缩亦如海。 譬乐志静然，安心由闲，颇无惊张，其念叵解，其想逾明，不烦不惧，道心如故，将取之於无为。 不言之说，唯与我子，不名之教，唯与我息。 何以故？ 不言不名，即体空无。 斯之侣者，道心独起，非世庸之所及也，悉是天上来。 外道倒见，起教於实，乱悮群徒，入火者众，而况体空无乎！ 若尔者，即是我种子。 非种非子，何能知空无之为主？ 何以故？ 道匠天地，不以我为父，德崇万物，不以我为母，而况独知空无之所从也。 是以真人知空之可宗，故习空得空，知无之可恃，故修无得无。 若知不言不名者，故知天人降生，於世化人也。 抱道而用，负阴而行，赖空而利，因无而功。 一切含气，由不知所从之，谓言自然，谓言因缘。 若苦若乐，若富若贫，若贵若贱，悉有斯言。 真知自然，不信自然； 真知因缘，不信因缘。 亦如小儿习语，知导不知义，知学不知理。 吾故学父之教，宣於万方，勤而不辞，劳而无功，恒以功成身退，以遂天道，故去彼取此。 道强若折，德弱若雪，以取中和，御於上下。 故高者抑之，下者举之，此道之所用。 若刚则亡，若强则折，不亡不折，乃肯常全。 若刚若强，身无可恃，道在何方？ 是以道人取於中和，去於刚强，抑高举下； 水性养身，浸润玉宫，始终无患。 是以真人无病，以百姓为病，故曰病病。 不忧不患，吾有何患？ 强梁者，死之本； 和柔者，生之根。 何以故知之？ 虎强以阱槛之，木强以火拱之。 阱岂不可畏，以友居之，故强为者必为阱所患。 火岂不出木，以钻不止，故摇动者必为火所焚。 是以真人折於强梁，存於和柔； 是故坚强者死之徒，柔弱者生之徒。 故道人尚於生道，贵於握固； 魔俗尚於强梁，贵於胶漆。 故真俗所用不同，求利殊别，勤劳虽同，受用更倒。 所生翁，所因翁，孰亲？ 生翁，天气也，顺之则炁和，逆之则气乱。 故父与天同，母与地等，若逆父母，即是逆天地也。 但思尊於所生，重於因父母，以爱妻故，是以重之。 是以真人去爱，故能成真，重於所生，故能成道。 故天下不同，所见各异，一切人民等同，受其天炁而生，因其地气而长，各不识所生之重，天地之恩，皆不如禽兽神虫之识道也。 淫女群居，广补发人，若乐居之，则与女淫之，若不愿乐，志如宦夫，不动不摇，岂补何益也。 但患以淫见淫，淫何可禁，以淫加宦，宦何所贪。 是故圣人逝心如空鸟，绝情如婴宦，假入淫国，何能染乎？ 淫女非不好欲，我不与欲，其好何补？ 以两淫相好，故生欲耳。",
      "translated_text": "The Dao shapes heaven and earth, its virtue exalts the myriad things, nurturing without end, its merit filling the harmonious qi. The hundred beasts and divine insects, knowing from whence they are born, still cling to their kin, harboring no harmful thoughts—how much more should those who aspire to transcendence hold such devotion! Yet the heterodox fail to honor this, falling short even of the hearts of beasts and insects.\n\nEarth and wood may be moved, but the heterodox remain unmoved. When the mind departs and the body follows, spirit and form come to rest, yet their perceptions diverge, and so spirit and form drift apart, dwelling in separation. Those who cultivate the Dao exert body and mind in unison, arriving at the same end. Without delusion or distraction, steadfast and unmoving—even if heaven rains flying stones, fire arises to scorch the earth, or the earth spews forth yellow springs in boiling surges—they never waver for even a moment. Such is the resolve of those who esteem the Dao’s work.\n\nDelighting in dwelling on Mount Lao, though three thousand heavenly demons assail them—hurling mountains, striking with hammers, casting rocks in wild disarray, shattering trees, collapsing cliffs into countless fragments like swirling snow—they remain unharmed, their form unaltered, their joy undisturbed, their focus unchanged. Then come hundreds of blazing torches, vying to terrify, scorching the forests until no sapling or fruit remains, their flames surging and receding like the sea. Yet the adept’s will remains serene, their heart at ease, untroubled and unshaken. Their resolve cannot be undone, their clarity ever brightening. Unburdened by fear or dread, their Dao-mind remains as before, drawing from non-action.\n\nThis unspoken teaching is for my disciples alone; this unnamed instruction, for my heirs. Why? Because to speak not, to name not, is to embody emptiness and nothingness. Those who walk this path awaken the Dao-mind alone, beyond the reach of the worldly and common—they descend from the heavens above.\n\nThe heterodox invert truth, teaching from the solid, leading their followers astray, and many plunge into fire. How much less can they grasp emptiness and nothingness! Those who do are my true seed. Without such seed, without such heirs, how could one know emptiness and nothingness as the master? Why? The Dao shapes heaven and earth yet does not claim me as father; its virtue exalts the myriad things yet does not claim me as mother—how then could one alone know the source of emptiness and nothingness?\n\nThus the perfected ones, knowing emptiness is worthy of honor, practice emptiness and attain emptiness; knowing nothingness is to be relied upon, cultivate nothingness and attain nothingness. Those who understand the nameless and unspoken know how heavenly beings descend to transform the world. Embracing the Dao in action, carrying yin in conduct, relying on emptiness for benefit, and through nothingness achieving merit.\n\nAll that bears qi arises from they know not what—some call it spontaneity, others causation. Whether in suffering or joy, wealth or poverty, nobility or lowliness, all speak thus. Those who truly know spontaneity do not believe in spontaneity; those who truly know causation do not believe in causation. It is like a child learning speech: they know how to imitate but not the meaning, know how to study but not the principle.\n\nThus I study the teachings of the Father, proclaiming them to all directions. Diligent yet unwearied, laboring without seeking merit, ever withdrawing once the work is done to fulfill the heavenly Dao—thus I abandon that and take this. The Dao, though strong, may break like a branch; virtue, though weak, melts like snow. By embracing harmony, one governs above and below. Thus the high are humbled, the low are raised—this is how the Dao is applied. If rigid, one perishes; if unyielding, one breaks. Only by avoiding both can one endure. If rigid and unyielding, the body has no support—where then is the Dao?\n\nThus the Daoist embraces harmony, rejects rigidity and strength, humbles the high and raises the low. The nature of water nurtures the body, suffusing the Jade Palace, ever free from harm. Thus the perfected ones have no illness, for they take the people’s suffering as their own—this is called \"illness as illness.\" Without sorrow or distress, what illness do I have?\n\nStrength and aggression are the root of death; harmony and gentleness, the root of life. How do we know this? Tigers, though strong, are trapped in pits; trees, though strong, are felled by fire. Are pits not to be feared? Yet those who dwell in them as friends bring ruin upon themselves. Does fire not arise from wood? Yet those who ceaselessly drill bring flames upon themselves. Thus the perfected ones break their strength and aggression, preserving harmony and gentleness. Therefore, the rigid and strong are companions of death; the soft and weak, companions of life.\n\nThus the Daoist values the way of life, prizing steadfastness. The demonic and worldly value strength and aggression, prizing stubborn attachment. Thus the true and the common differ in their pursuits, seeking distinct benefits. Though their efforts may be the same, their rewards are inverted.\n\nThe progenitor of life, the progenitor of cause—who is closer? The progenitor of life is the qi of heaven: follow it and qi harmonizes; oppose it and qi disorders. Thus the father is one with heaven, the mother one with earth. To oppose father and mother is to oppose heaven and earth. Yet one honors the progenitor of life, reveres the parents of cause—even loving a wife, one thus honors them.\n\nThus the perfected ones abandon attachment and so attain perfection; they honor the progenitor of life and so attain the Dao. Though the world differs in its views, all people are the same, born from heavenly qi and nurtured by earthly qi. Yet none recognize the weight of their origin, the grace of heaven and earth—all fall short of the beasts, insects, and divine creatures who know the Dao.\n\nLascivious women gather in throngs, eagerly seeking to seduce men. If one delights in dwelling among them, they engage in debauchery; if one remains unwilling, their resolve firm as a eunuch’s, unmoved and unshaken—what benefit can such seduction bring? The danger lies in seeing lust through lust—how can lust be restrained? Applying lust to a eunuch—what desire remains to covet?\n\nThus the sage’s heart wanders like an empty bird, their emotions severed like a eunuch’s. Even entering a land of lust, how could they be stained? The lascivious women are not without desire, but I do not share it—what benefit is their desire to me? Only when two lusts meet does desire arise.",
      "overlap_context": "fected through non-action.\n\nAll, whether noble or base,\nFind right and wrong in the sincerity of the heart.\n\n*Thus concludes the first scroll of the Heavenly Worthy’s Wondrous Dharma Scripture of the Original Form.*\n\n[The above follows the *Daoist Canon* edition, with lacunae supplemented from Dunhuang manuscript P.2357. The opening lines of the Dunhuang manuscript are also incomplete.]\n\n*Scroll Two of the Heavenly Worthy’s Wondrous Dharma Scripture of the Original Form*\n\nIn general discourse...",
      "start_char": 7560,
      "end_char": 8774,
      "start_sentence": 403,
      "end_sentence": 458,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.71507287025452,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "是以真人数经淫女，而女悔悟，不加其欲，益自断绝。 故见色，土木以譬之，见宝，瓦砾以投之。 何以故？ 贪宝与宝，其贪愈起，好淫与淫，其欲愈繁，暨至大缘将灭，宝色何寄？ 方之抑割，道无不成，唯有知者，乃能思之。 一生万物，四大之本，而人不知。 阳生阴育，而人莫信。 天覆地载，众生不识。 日月照明，万类不悉。 现效明证，不信有神。 任命生死，不造因缘，偏见异趣，因父为宝。 是以真人行一抱德，以养四大，功成事就，遂致紫金之报。 故知者识之，先造因缘，以养神形，不弃不捐，全固如常。 故知一生於二，二生三，三生万物，致天地长存，由斯而兴，故恒宝而行之也。 若不知一者，即与六畜同论。 六畜不知有一，不知因缘所从而来，故与六畜同论之。 道方而不割，随应而普入； 德圆而不阙，因功而感成。",
      "translated_text": "Thus the Perfected One often passes through the abodes of lascivious women, and the women, repentant and awakened, do not impose their desires but instead sever them entirely. Therefore, upon seeing beauty, he likens it to earth and wood; upon seeing treasure, he casts it aside as tiles and pebbles. Why? Because coveting treasure with treasure only stirs greater greed, and delighting in lust with lust only multiplies desire. When the great karmic bond nears its end, where do treasure and beauty reside? Only through restraint and severance is the Dao accomplished without fail—only those with wisdom can ponder this.\n\nFrom the One arise the myriad things, the root of the Four Great Elements, yet people remain unaware. Yang generates and yin nurtures, yet none believe it. Heaven covers and earth bears, yet living beings do not recognize it. Sun and moon shine brightly, yet the ten thousand kinds do not comprehend. Manifest proofs and clear evidence are met with disbelief in the divine. They resign themselves to fate and death, not cultivating karmic conditions, clinging to partial views and divergent paths, treasuring their fathers as if they were jewels.\n\nThus the Perfected One practices the One and embraces virtue to nurture the Four Great Elements. When merit is complete and affairs are accomplished, he attains the reward of purple gold. Therefore, the wise recognize this: first cultivate karmic conditions to nourish spirit and form, neither abandoning nor discarding, preserving wholeness as ever. Thus they know the One generates the Two, the Two generates the Three, and the Three generate the myriad things—thereby heaven and earth endure forever, arising from this principle. Hence they constantly treasure and practice it.\n\nThose who do not know the One are ranked with the six livestock. The six livestock know not the One, nor whence karmic conditions arise—thus they are equated with the six livestock. The Dao is square yet does not sever; it responds universally to all. Virtue is round yet does not lack; it manifests through merit and resonates to completion.",
      "overlap_context": "rm as a eunuch’s, unmoved and unshaken—what benefit can such seduction bring? The danger lies in seeing lust through lust—how can lust be restrained? Applying lust to a eunuch—what desire remains to covet?\n\nThus the sage’s heart wanders like an empty bird, their emotions severed like a eunuch’s. Even entering a land of lust, how could they be stained? The lascivious women are not without desire, but I do not share it—what benefit is their desire to me? Only when two lusts meet does desire arise.",
      "start_char": 8774,
      "end_char": 9102,
      "start_sentence": 459,
      "end_sentence": 476,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.262376308441162,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "若割则有缺损之患； 若阙则有罢废之短。 故不割不阙，淡而不损。 所以者何？ 有心者应，有功者感，流洒万方，曲入室实。 故非宽非奢，能应之宽奢； 非阐非狭，能应之阐狭； 非好非丑，能应之好丑； 非罪非福，能应之罪福。 故不思叵议，虚无功匠，形充万类。 若言辩之，非文能释，若知量之，非大权所测，譬之谷神，随之大小方圆而应。 道之应化，亦复如是。 善人如水，利入一切，功济如流，悉受其润。 是故道为柔弱之宝，德为经纬之珍。 是以真人恒宝於道，常珍於德，守而不移，乃成真人之任乎！ 石与水相和而有，梵子与道相名而化，其名虽同，取用理殊。 是故水石虽同一域，受利不等。 故真人宝道珍德，贵於水利，终日行不离其辎重，顾之若左右，执用若目前，掺之若可畏，昼夜汲汲，恒若不足，故能成真也。 天下有道，真法兴焉； 天下无道，真法废焉。",
      "translated_text": "Should it sever, there arises the peril of deficiency and loss; should it lack, there emerges the flaw of exhaustion and abandonment. Thus, it neither severs nor lacks, remaining serene and unharmed. Why is this so? Where there is intent, there is response; where there is merit, there is resonance. Flowing and suffusing the ten thousand directions, it bends to enter the chamber of reality.\n\nThus, it is neither broad nor extravagant, yet can respond to breadth and extravagance; neither expansive nor narrow, yet can respond to expansion and narrowness; neither beautiful nor ugly, yet can respond to beauty and ugliness; neither sinful nor blessed, yet can respond to sin and blessing. Therefore, it is beyond thought or conjecture, an empty and effortless craftsmanship, its forms filling the ten thousand kinds.\n\nIf one seeks to explain it in words, no rhetoric can clarify; if one seeks to measure it, no great power can fathom. It is like the spirit of the valley, responding in accordance with size and shape. The transformative responses of the Dao are likewise.\n\nThe good person is like water, benefiting all things, their merit flowing like a current, all receiving its moisture. Thus, the Dao is the treasure of softness and weakness, and virtue is the treasure of warp and weft. Therefore, the perfected person constantly treasures the Dao and ever cherishes virtue, holding fast without wavering—this is the task of the perfected person!\n\nStone and water harmonize to exist, while the Brahmin child and the Dao are named in transformation. Though their names may be the same, the principles of their use differ. Thus, though water and stone share the same realm, the benefits they receive are unequal.\n\nTherefore, the perfected person treasures the Dao and cherishes virtue, valuing them more than the benefits of water. Throughout the day, they do not depart from their provisions, regarding them as their left and right hands, wielding them as if before their eyes, grasping them as if in awe. Day and night, they strive ceaselessly, ever feeling insufficient—thus they attain perfection.\n\nWhen the world possesses the Dao, the true Dharma flourishes; when the world lacks the Dao, the true Dharma declines.",
      "overlap_context": "d the Three generate the myriad things—thereby heaven and earth endure forever, arising from this principle. Hence they constantly treasure and practice it.\n\nThose who do not know the One are ranked with the six livestock. The six livestock know not the One, nor whence karmic conditions arise—thus they are equated with the six livestock. The Dao is square yet does not sever; it responds universally to all. Virtue is round yet does not lack; it manifests through merit and resonates to completion.",
      "start_char": 9102,
      "end_char": 9448,
      "start_sentence": 477,
      "end_sentence": 496,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.631512641906738,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "何以故？ 天下不崇其道，真炁去离，是以废焉。 非王者所能废，但祚将欲终，故起迷心而废之。 若其兴焉，非王者所能兴，但福将无穷。 是故馌王舍於色染之秽，紫阳将应之，妙梵发於誓愿之信，当来有拔苦之难。 斯皆先业所造之於今身。 若今身所造，后世之资，若前世所造，今形之晕。 是以帝王不能兴，不能废。 若政而顺用物，来取於此，更受会乎？ 与馌王等也。 出生入死，不停一所，轮转五道，受生随趣。 计业受生，不妄受荣，不妄受悴，天候地伺，主检精魂，毫分不失。 亦如硙齿磨棱，莫不拘者。 若受以不受，亦复如是。",
      "translated_text": "Why is this so? When the world fails to honor the Dao, true qi departs and scatters—thus the true Dharma declines. Yet this is not something a ruler can abolish; rather, when the mandate nears its end, delusion arises in the heart and the Dharma is forsaken. If it flourishes, this too is not something a ruler can bring about; rather, boundless fortune unfolds.\n\nThus, when King Yeya was ensnared by the filth of sensual attachment, Purple Yang was poised to respond; when the wondrous Brahmin arose from the sincerity of his vows, the age to come would face the ordeal of suffering’s deliverance. All these are the creations of past karma manifesting in the present body. What is cultivated in this life becomes the provision for the next; what was sown in former lives now shapes the body’s radiance.\n\nTherefore, even emperors and kings cannot summon or suppress it. If governance aligns with the proper use of things, and one draws from this in the present, will they not meet their fate anew? They are no different from King Yeya. Emerging into life and sinking into death, never lingering in one place, they revolve through the five destinies, reborn according to their inclinations. By the reckoning of karma, they receive birth—not falsely granted glory, nor falsely imposed suffering. Heaven observes, earth awaits, and the overseer of pure spirits examines each soul, not losing even the slightest fraction. It is like the teeth of a millstone grinding every edge—none escapes its grasp. If one seeks to receive what is not to be received, the outcome is the same.",
      "overlap_context": "ore, the perfected person treasures the Dao and cherishes virtue, valuing them more than the benefits of water. Throughout the day, they do not depart from their provisions, regarding them as their left and right hands, wielding them as if before their eyes, grasping them as if in awe. Day and night, they strive ceaselessly, ever feeling insufficient—thus they attain perfection.\n\nWhen the world possesses the Dao, the true Dharma flourishes; when the world lacks the Dao, the true Dharma declines.",
      "start_char": 9448,
      "end_char": 9686,
      "start_sentence": 497,
      "end_sentence": 510,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.482557535171509,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "何以故？ 譬如筑墙版无不杵，若一版不杵，则不可立。 是以圣人恐罪叵过，故勤於道业，志於清真，不拘於俗，不务王业，以是勤故，得生无拘之患。 能有志识者，尽与天人同侣，不魔所婴，不横他缘。 何以故？ 以志识故。 不志不识，与六畜同侣。 所以者何？ 六畜止知识其母，不识其父，是以不志识者与畜同。 高而莫盖，卑而无底，傍而不穷，推而不尽，度不可极，量不可及。 弥荡自臣，混而自行，应身万有，功就十方，宣育有形，慈及一切。 何以故？ 若无其应，教谁能了，是故起应之。",
      "translated_text": "Why is this so? It is like building a wall—every plank must be tamped; if even one plank is left untamped, the wall cannot stand. Thus, the sage, fearing that transgressions cannot be avoided, diligently cultivates the Dao and its practices, setting their mind on purity and truth. Unbound by worldly customs, they do not pursue royal affairs. Through such diligence, they escape the suffering of bondage.\n\nThose who possess resolve and discernment share companionship with the heavenly beings, untouched by demonic afflictions or wayward entanglements. Why is this so? Because of their resolve and discernment. Without resolve or discernment, they share companionship with the six livestock. Why is this? The six livestock know only their mother and do not recognize their father—thus, those without resolve or discernment are no different from beasts.\n\nLofty yet without a peak, low yet without a base, expansive yet without bounds, inexhaustible when pressed, immeasurable in extent, unfathomable in scope. Vast and self-governing, merging and self-acting, it responds to the myriad forms, its merit perfected across the ten directions. It nurtures all that has form, its compassion extending to all beings.\n\nWhy is this so? If there were no such response, who could comprehend its teachings? Thus, it arises in response.",
      "overlap_context": "ath, never lingering in one place, they revolve through the five destinies, reborn according to their inclinations. By the reckoning of karma, they receive birth—not falsely granted glory, nor falsely imposed suffering. Heaven observes, earth awaits, and the overseer of pure spirits examines each soul, not losing even the slightest fraction. It is like the teeth of a millstone grinding every edge—none escapes its grasp. If one seeks to receive what is not to be received, the outcome is the same.",
      "start_char": 9686,
      "end_char": 9906,
      "start_sentence": 511,
      "end_sentence": 523,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.73833703994751,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "修其应教，以心专结，而不可解者，亦与无上同会乎？ 是以真人修於应化之法，以致於无为。 若知应化之可法者，勤而行之，亦与真人同侣。 何以故？ 真性无形，诞生虚无，非色非像，妙炁自然。 岂有阙割而应之？ 分而不减，布而不尽，湛然夷微而不所依，故着炁成形，宣济万形。 大逝无巅，其用不穷； 大反无下，其用不极。 成功而不居，恒以身退之； 器匠而不称，恒以名去之。 斯正真之上教，无为之理务。 成功而不处，此天之道。 器匠两不务，此真人之范。 不功不名，岂遂巡化？ 是以真人存於不名之教，勤於不劳之功，故能成之。 何以故？ 若存其名，则功不立，若存其功，即则施之。 是以真人知行不知其名，知勤不知其劳，故施不望报，而果自成。 归海不望其返，而水自还，大逝之应，亦复如是，故知行知勤之也。 筑室以户牖，起明以景晕，正於妙室而莫景入，岂有明也？ 若无景，则工匠无所造； 若无户牖，则明无所照。 众生无道性，则匠无所加。 众生以可鉴之理，故设范以教之。 若夜视室中，无可居之，以景晕敷，遂乃可工之。 是以真人蒙三师加训，得成真人。 何以故？ 筑室不立户牖，则与无室同之； 有身不蒙师教，则与无身等之。 是故真人舍爱而修道，故能成真，出家而行学，故能成德。 是故郁罗翘贵道而尚德，以致无为之位乎！ 金玉如山，钱帛如原，不存其道，不志於真，何如日逾灭之，日福尽之，无所恃之，无所怙之。 雀罗其粪，无所尚之； 蜣螂拥丸，无所珍之。 故宝珍不可贵，钱帛不足尚。 是以真人贵道而贱宝，尚德而去钱，终致太真之位也。 何以故？ 宝集则祸门，钱聚则盗臻。 是故道人勤道不勤宝，修德不修帛，便使积钱至天，不如坐进此道，故不为宝，不为帛。 道生於万物，德畜於一切； 功加於有生，普育於有形。 故道生万物，不以为主； 德成有生，不以为劳。 是以道居其上，不以为重，而民莫厌。 若非其道，财不久立。 何以故？ 人不可去其道，鱼不可离其水。 人去道则亡，鱼离水则死。 是以真人抱道而执德，故能常生。 常生者，湛然不迁，居无为之任。 是故长生久视之道，久视谓天地毁灭，千数灰扬，万物普尽，而身独存。 视天地磨灭，其神湛然，故曰久视长生之道。 婴儿之未生，其性则无欲； 明珠之在蚌，其耀处於内。 所以者何？ 婴儿之性，外无所了，内无所分，念乳则啼，不饥则止，假令久不乳，终日号而不嘎。 何以故？ 以和之至，无躁无烦，故可生善。 明珠在蚌中，发则成珠，不发终始为蛤中，但患长大，情欲所摄，其毒不可折。 是故真人从於无欲而成真道，起於年七而奉其德，故可成身。 何以故？ 欲者五毒之根，想者祸身之本，故去之，敢从不敢放。 无常之客，不可投之，外道之见，去而不反，若其悟之，速於庸夫，地仙之位，须臾可到。 何以故？ 邪学之染以入，孔智之炁以布，宿惠之德以受，但见差跌化成邪道，是故宿着而悟速。 无常之客与外道见等，迷心不变，去而不反，专绳行之，不执忠悫，随风东西，吹之悉去。 所以者何？ 漆性尚黑，因色而就，不专一色，随染即着。 故无恒之夫，不可以道御之，外道之见，不可悔之，各执一趣，不师正教。",
      "translated_text": "To cultivate this responsive teaching with a mind so single-mindedly bound that it cannot be undone—does this not also join one with the assembly of the supreme? Thus, the perfected person practices the methods of responsive transformation to attain non-action.\n\nIf one knows that responsive transformation is worthy of emulation and diligently practices it, one also shares companionship with the perfected. Why is this so? The true nature is formless, born from emptiness and nothingness, neither color nor image, its wondrous qi naturally arising. How could it be cut or divided to respond? It divides yet does not diminish, spreads yet does not exhaust, serene and subtle without reliance—thus, it coalesces qi into form and extends relief to the myriad forms.\n\nIts great passing has no summit, its use inexhaustible; its great return has no depth, its use unbounded. It accomplishes yet does not dwell; ever withdrawing the self. It shapes as a vessel yet does not claim it; ever casting off names. This is the supreme teaching of the true and correct, the essential principle of non-action. To accomplish yet not abide—this is the Dao of Heaven. To craft as a vessel yet claim nothing—this is the model of the perfected. Without merit, without name, how could transformation be delayed? Thus, the perfected abides in the teaching without name, diligent in the work without toil, and so accomplishes it.\n\nWhy is this so? If one clings to name, merit cannot be established; if one clings to merit, then it becomes a bestowal. Thus, the perfected knows action but not its name, knows diligence but not its toil. Therefore, bestowing without expecting reward, the fruit naturally ripens. The waters flowing to the sea do not long for return, yet they cycle back of themselves—the response of the great passing is likewise. Thus, one knows action and knows diligence.\n\nBuilding a chamber with doors and windows, kindling light to cast its glow—if one aligns with the wondrous chamber yet no light enters, where is the brightness? Without light, the craftsman has nothing to fashion; without doors and windows, brightness has nothing to illuminate. If sentient beings lack the nature of the Dao, the craftsman has nothing to work upon. Because sentient beings possess the principle of reflection, models are established to teach them. If one gazes into a chamber at night, nothing can be discerned—only when light is cast can work proceed.\n\nThus, the perfected, receiving the instruction of the three masters, becomes perfected. Why is this so? A chamber without doors and windows is no different from having no chamber; a body without a teacher’s instruction is no different from having no body. Therefore, the perfected abandons attachment to cultivate the Dao and so becomes true; leaving the household to practice learning, one becomes virtuous.\n\nThus, Yu Luoqiao valued the Dao and esteemed virtue, attaining the station of non-action! Gold and jade piled like mountains, coins and silks spread like plains—without preserving the Dao or aspiring to truth, what is the use? They vanish like the setting sun, their blessings exhausted, with nothing to rely upon, nothing to depend on. Birdlime smeared on dung is not esteemed; dung beetles rolling their balls hold nothing precious. Thus, treasures cannot be prized, coins and silks are not worthy of esteem.\n\nTherefore, the perfected values the Dao and scorns treasure, esteems virtue and discards wealth, ultimately attaining the station of the Great Perfected. Why is this so? Treasures amassed become gates of misfortune; wealth gathered invites thieves. Thus, the person of the Dao diligently cultivates the Dao, not treasures; practices virtue, not wealth. Even if coins were piled to the heavens, it would not compare to sitting and advancing in this Dao—thus, one does not pursue treasure or wealth.\n\nThe Dao gives birth to the myriad things yet does not claim mastery; virtue nurtures all beings yet does not count it as toil. Thus, the Dao abides above yet is not burdensome, and the people do not grow weary. Without the Dao, wealth does not long endure. Why is this so? People cannot depart from the Dao, just as fish cannot leave water. People who abandon the Dao perish; fish who leave water die. Thus, the perfected embraces the Dao and holds fast to virtue, and so attains enduring life.\n\nEnduring life means abiding in serenity without change, dwelling in the task of non-action. Thus is the Dao of long life and enduring vision—enduring vision means that when heaven and earth crumble, a thousand ashes scatter, the myriad things all perish, yet the self alone endures. Witnessing the dissolution of heaven and earth, the spirit remains serene—this is the Dao of enduring vision and long life.\n\nThe nature of an unborn infant is without desire; the radiance of a pearl within an oyster lies hidden within. Why is this so? The infant’s nature perceives nothing externally, distinguishes nothing internally—it cries for milk when hungry, ceases when full. Even if left unfed for a long time, it wails all day without hoarseness. Why? Because its harmony is perfect, without restlessness or vexation, thus it can give rise to goodness.\n\nThe bright pearl within the oyster, when released, becomes a pearl; if never released, it remains within the clam. The only danger is growing large, being seized by passions and desires—its poison cannot be broken. Thus, the perfected, following non-desire, completes the true Dao, arising at the age of seven to uphold virtue and so perfecting the self. Why is this so? Desire is the root of the five poisons; thought is the source of bodily harm—thus, one abandons them, daring to follow what one dares not indulge.\n\nThe guest of impermanence cannot be entertained; the views of external paths must be abandoned and not returned to. If one awakens to them, it is swifter than the ordinary person—one may reach the station of earthly immortality in an instant. Why is this so? The stain of heterodox learning enters, the qi of empty wisdom spreads, the virtue of past blessings is received—yet seeing a slight misstep, one is transformed into heterodoxy. Thus, past attachments lead to swift awakening.\n\nThe guest of impermanence and the views of external paths alike delude the mind without change, departing and not returning. One must strictly adhere to practice, not clinging to loyalty or sincerity, drifting east and west with the wind, blown away entirely. Why is this so? Lacquer’s nature favors blackness—it takes on color as it is dyed, not adhering to one hue but staining as it is tainted. Thus, the inconstant cannot be governed by the Dao; the views of external paths cannot be repented. Each clings to their own inclination, not following the true teaching.",
      "overlap_context": "are no different from beasts.\n\nLofty yet without a peak, low yet without a base, expansive yet without bounds, inexhaustible when pressed, immeasurable in extent, unfathomable in scope. Vast and self-governing, merging and self-acting, it responds to the myriad forms, its merit perfected across the ten directions. It nurtures all that has form, its compassion extending to all beings.\n\nWhy is this so? If there were no such response, who could comprehend its teachings? Thus, it arises in response.",
      "start_char": 9906,
      "end_char": 11127,
      "start_sentence": 524,
      "end_sentence": 593,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.26507925987244,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "是故真人志如昆仑，坚然不动，林木颇长，终不颖脱。 是以真人结於不结之结，而不可解，关於无关之关，而不可开，终不随风而去，故能成真。 作土为泥，非水不成，埏埴为器，非均不平，是以水为和均之始，均为平镣之本。 故匠加其功，得有瓦器之名，无加之则泥不和，无均平之则埏。 是以土水均匠，拥循扶立，方付埏塈，火营烟色，青了封闭，冷熟开之，则见瓦器之功。 所以者何？ 土者瓦之因，水者瓦之缘。 埏埴瓦支体，平均文教扇。 工匠世之范，火真炁专。 瓦器崇用无为，德因起之於丝毫，遂成江海山岳。 真人从斯业，今得无上宾，一切凡夫福，履之成十仙。 海德不思议，威力振大千，其道如是神，无量亦无边。 绝学不邪僻，不学如盲人，得道由斯起，不解道学真。 游游若畜行，正念贪殷懃。 口利行六畜，手系期之牵。 搅窃世间物，自作家有田。 不知冥中负，地狱刀风因。 不勘惚毒苦，求还唤子孙。 复连相牵挽，荡尽不立烟。 若能去诸尽，玩玩至真文。 邪僻自断绝，故无来附亲。 不学殊无目，好恶不别新，六畜不知学，故如新之论。 罢功绝诸籍，岧岧常自然。 利益不思议，万劫若电间。 道德如是力，智者乃能勤。 初如不足观，德着识玄宗。 功感成无为，朝师三界贤。 但修莫懈倦，必致常乐门。 美与恶，其孰多？ 唯与阿，理几何？ 是故君子恶阿，终得君子之行名。 君子亦非天授，亦不地与，抱忠报行，言信善着，不华不饰。 唯人行人，有名而无果，阿人行人，有威而无实。 故智者罢去君子之行，修於无为之道。 道行尚卑，魔行尚高，人道贵生，鬼道贵终。 真道务朴，人道务华。 其名虽同，逆顺不等。 何以故？ 尚卑欲取众善之德，其德既合，成足江海，是故尚卑。 魔行尚高，不受众德，自师所长，不下於众善之善，故为魔行。 人道尚於完端，不希常生之生，若遇疾苦，请祷神祇，妄求恩福。 不希久视之生，故曰贵生。 鬼道贵终，贵於终亡，尚於被伤，故为贵终。 真道贵於质朴，不务华荣。 正有忧道，不忧其荣，是故所忧虽同，逆顺不等。 是以真人但以身卑下，故能合众德之德，皦如日月，高如昆仑。 江海处於卑下，以摽百谷之王，佐玄崇於众德之德，四师果授於灵智之道。 是故道人不足顾於高，不足恃於惠。 是以侯王自称为孤寡，贱称而致禄高。 故真人居下，故能成於高，善受众德之德，故能成其德。 何以故？ 堆不着水，百草不能长，深而不广，高而不厚。 蚕如於发，食叶吐丝，成於衮冕，彩缯五色，芬芳葩葩，贵贱同猥。 其外国土无桑蚕，见於彩缯，不知所由，若有人辨之从蚕口中吐出，巧妇织成，无不信之。 若有师德辨道所由，相好具足，人中无比。 音如雷鸣，目如日光，肶鹿，面貌平阳，手垂过膝，足蹑乾刚，掌有十文，额参午行，耳高於发，八道厅堂，鼻有双柱，筒条齐方，四十八齿，白耀如霜，舌能覆面，莲华兰香，眉有八彩，白毫相光，肉髻螺文，九箕紫璋，顶若玉堂，背有斗纲，胸生朱雀，脚蹑龙床，左青右白，六甲挟将，神真习翼，九仙两厢，经劫不衰，兆载不尚，去若屈伸，形涉沙方，六种振动，湛若海疆，威德如是，万圣之王。 从学而兴，超举道场，凡愚不信，惊怪揎攘。",
      "translated_text": "Thus, the true person’s resolve stands firm as Kunlun, unshaken and immovable—though the forest’s trees grow tall, they never shed their leaves. Therefore, the true person binds the knot that cannot be knotted, yet remains inextricable; fastens the gate that cannot be gated, yet remains unopenable. Never swept away by the wind, they thus attain truth.\n\nClay is made from earth, yet without water it cannot take form; vessels are shaped from clay, yet without evenness they cannot be leveled. Thus, water is the origin of harmony and evenness, and evenness the root of balance and refinement. When the craftsman applies skill, the vessel gains the name of pottery; without application, the clay remains unharmonized, and without leveling, the shaping fails. Thus, earth, water, evenness, and craftsmanship support and uphold one another, and only then is the clay placed upon the wheel. Fire tends the kiln, smoke marks the hue; when sealed and cooled, the vessel is revealed—such is the work of pottery.\n\nWhy is this so? Earth is the cause of the vessel, water its condition. The shaping of clay forms its limbs, evenness spreads its pattern like teachings. The craftsman is the world’s model, fire and heat concentrate the true qi. The vessel’s use exalts non-action; virtue arises from the slightest thread, swelling into rivers, seas, and mountains.\n\nThe true person, following this path, now attains the supreme guest; all ordinary beings’ blessings, when tread upon, become the ten immortals. The virtue of the sea is inconceivable, its power shaking the great thousand worlds. Such is the Way—divine, boundless, and immeasurable.\n\nTo abandon learning is to stray into perversity; to refuse learning is to be like the blind. The Way arises from this, yet without understanding, one grasps not the truth of Daoist study. Wandering like livestock, the right mindfulness clings to greed and diligence. The mouth profits from the six livestock, the hands tie them with halters. Stealing the world’s goods, one builds a household and fields, unaware of the debt owed in darkness—the cause of hell’s blade-winds. Without tasting the poison’s bitterness, one seeks to repay it, calling to children and grandchildren. Again and again, they are pulled along, their fortune exhausted until no smoke rises from the hearth.\n\nIf one can cast off all attachments and delight in the true scriptures, perversity severs itself, and no defilements draw near. Without learning, one is utterly blind, unable to distinguish good from evil, new from old. The six livestock know not learning, hence the saying: \"like the new.\" Cease striving, sever all records, and abide ever in spontaneity. The benefits are inconceivable—ten thousand kalpas pass like a lightning flash. Such is the power of the Way and virtue; only the wise persist.\n\nAt first, it may seem insignificant, yet virtue manifests, revealing the profound mystery. The merit of non-action is perfected, and one becomes a master of the three realms. Only through cultivation without weariness may one enter the gate of eternal joy.\n\nBeauty and ugliness—who can say which is greater? Flattery and integrity—how much do they weigh? Thus, the noble person despises flattery and ultimately gains the name of noble conduct. Yet noble conduct is neither granted by heaven nor bestowed by earth; it arises from holding loyalty and repaying deeds, from words of trust and evident goodness, unadorned and unembellished.\n\nWhen an upright person follows others, they gain a name but bear no fruit; when a flatterer follows others, they gain prestige but lack substance. Therefore, the wise abandon the path of the noble and cultivate the Way of non-action.\n\nThe Way values humility, while demonic paths exalt loftiness. The human path prizes life, the ghostly path prizes death. The true Way cherishes simplicity, while the human path cherishes ornamentation. Though their names may be the same, their directions differ entirely.\n\nWhy is this so? Humility seeks to gather all virtues; when these virtues unite, they become as vast as rivers and seas—hence the value of humility. Demonic paths exalt loftiness, rejecting all virtues, self-taught in their own strengths, unwilling to yield to the goodness of others—thus they are demonic.\n\nThe human path exalts perfection, not seeking the life of eternal vision. When illness or suffering arises, they pray to spirits and deities, vainly seeking blessings and fortune. Not aspiring to long life, they are said to prize life. The ghostly path prizes death, valuing annihilation and revering injury—hence it is called the path of prizing death. The true Way values simplicity, not pursuing ornamentation. The rightful concern is for the Way, not for glory—thus, though their concerns may seem alike, their directions differ entirely.\n\nTherefore, the true person humbles themselves, thereby uniting all virtues. Radiant as the sun and moon, lofty as Kunlun, they dwell in lowliness like rivers and seas, which, by occupying the lowest places, become lords of all valleys. Assisting the profound and exalting the virtues of all, the four masters ultimately transmit the Way of numinous wisdom.\n\nThus, the person of the Way need not regard loftiness nor rely on favor. Therefore, kings and lords call themselves \"the orphaned\" and \"the widowed,\" humble titles that bring high rank. Thus, the true person abides in lowliness and thereby attains loftiness, receiving the virtues of all virtues and thereby perfecting their own virtue.\n\nWhy is this so? A mound without water cannot nurture the hundred grasses; deep but not broad, high but not thick. The silkworm, slender as a hair, eats leaves and spins silk, weaving robes and crowns of five colors, fragrant and splendid—noble and base alike wear them. In lands without mulberry or silkworms, when people see colored silks, they know not their origin. If someone explains that they come from the silkworm’s mouth, woven by a skilled woman, none would disbelieve.\n\nIf a master of virtue explains the origin of the Way, their marks of excellence are complete, unmatched among people. Their voice is like thunder, their eyes like the sun’s radiance. Their shoulders slope like a stag’s, their face is level and bright, their hands hang past their knees, their feet tread upon firm ground. Their palms bear ten lines, their forehead three intersecting marks; their ears rise above their hair, their nose has twin pillars, straight and square. Their forty-eight teeth gleam white as frost, their tongue can cover their face, their breath is fragrant as lotus and orchid. Their eyebrows bear eight hues, their white hair-mark shines with light; their topknot spirals like a conch, their crown is adorned with nine auspicious jades. Their head is like a jade hall, their back bears the Dipper’s net, their chest bears the Vermilion Bird, their feet tread upon the dragon’s bed. On their left is blue, on their right white; the six jia spirits attend them, divine beings practice at their side, the nine immortals stand in ranks. Through kalpas they do not decline, through countless ages they do not age. They depart like bending and stretching, their form traverses the four directions. Six kinds of tremors shake the earth, yet they remain serene as the sea’s edge. Such is their awe-inspiring virtue—the king of ten thousand sages.\n\nArising from study, they transcend the Daoist realm; the ignorant do not believe, startled and bewildered, they clamor in confusion.",
      "overlap_context": "de the mind without change, departing and not returning. One must strictly adhere to practice, not clinging to loyalty or sincerity, drifting east and west with the wind, blown away entirely. Why is this so? Lacquer’s nature favors blackness—it takes on color as it is dyed, not adhering to one hue but staining as it is tainted. Thus, the inconstant cannot be governed by the Dao; the views of external paths cannot be repented. Each clings to their own inclination, not following the true teaching.",
      "start_char": 11127,
      "end_char": 12357,
      "start_sentence": 594,
      "end_sentence": 650,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.232789754867554,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "外国无虫，实心不量，有实不虚，唯知乃忘。 国贼将至，以何攘之？ 被围百重，以何破之？ 曰：贼来以敌拒之，以议攘之。 所以者何？ 贼性怯，易可捍之？ 小敌则可还师，行议攘，不须兵而可还师。 何以故？ 议能伏恶，福能消祸，是故以议攘之，以福消之，被围百重，牢为城郭，闭门坐甲，贼劳厌甲，不久则还。 是以真人恒以兵捍贼，贼不能侵，以牢城郭，贼不能得。 国将欲乱，以何止之？ 臣厌欲叛，以何安之？ 曰； 民乱以烦，臣叛以昏，是以乱叛，当如是过。 以何救之？ 曰：去贪不欲，无为以养民，百姓安宁，愿乐君国，始终不乱。 天下乐推，岂有厌乱？ 是以不乱。 臣将欲叛，以君昏，故不从律令，所行非法，是以欲叛，当悔其过，改故修来，整纲治纲，依律理治，内不昏乱，外不威虐。 是以真人，恒去烦乱，而民宁怗，恒去昏贼，臣乐不叛。 君清臣宁，永无倾败； 民乐乱穆，长为安泰。 其朴不雕，不可成器； 其荒不耕，终不成柔。 何以故？ 朴不雕刻，终致朽弊； 荒田不垦，刑棘茂盛。 豺狼狸枭，长在其中，鸱枭鸟鹊，栖宿林中。 田罢不治，终成荆棘。 学士罢法，亦复如是。 若朴不雕，终守枯朽。 若遭工匠，加其绳墨，斲斧锯凿，日加雕琢，必就功业，用之则如意，亨之则无损。 是以真人执朴经匠，故能成器，修治荒田，故能得谷。 何以故？ 朴质荒田，譬凡夫； 经匠遭耕，譬师教； 成器得谷，譬果显。 是以真人勤於修治，今得成真。 为无为日益，为有为日损。 何以故？ 无为者，无不为物，知无为之有益。 为有者，执着於有，有者都归於无，是以知有为日以损之。 若能以损之又损之，以至於无为，是以真人修无不修有，行益不行损，故能成益。 居於道，必行正，处於法，必行真。 若不如者，必就於邪。 是以真人恒闭於邪门，开於正路，以是因缘，今得正真之位乎。 所以者何？ 譬如铸师，随形大小，曲尺周徧，无不鉼从者。 何以故？ 若鉼其同，因类受形，终不错变，同化反类， 若金若银，若铜若铁，及其销铄，随类而现。 若师习正，弟子亦正，若师玩邪，弟子亦邪。 师徒相教，亦复如是。 沙石磬坚，定中为硙，工匠无锤，如何得成？ 青白之石，文理端直，中为确杵，工匠虽巧，手无锤锤，岂可成之？ 是以学士加诫御之，寻文知之。 假使贤师教化，非文不授，假使良才，非师不授。 是故以文化之，以诫御之。 譬如作船，非水不行，譬如伐木，非斧不克，譬如钻火，非木不得，譬如深井，非索不获。 是以真人遭匠加搥，今得太真无为之任。 釜中着水，不加其火，岂得沸之？ 置谷臼中，坐视不舂，岂得精之？ 是故一切所造，因功乃成。 若有志於道味者，悉须勤劳，合成乃崇。 是故真人遭火得舂，令为精熟之果。 何以故？ 福不唐捐，功不失训；",
      "translated_text": "In foreign lands, no insects breed, their hearts are solid and unmeasured, what is real is not hollow, only knowledge leads to forgetting. When bandits approach the state, how shall they be repelled? When besieged by a hundred layers, how shall they be broken? It is said: when bandits come, resist them with force, repel them with counsel. Why is this so? Bandits are cowardly by nature—easily withstood. If the enemy is small, one may withdraw the army; by employing counsel to repel, troops need not be sent, and the army may still return. Why? Counsel can subdue evil, fortune can dissolve misfortune. Thus, repel them with counsel, dissolve them with fortune. When besieged by a hundred layers, make the city walls firm, shut the gates and don armor. The bandits will weary and grow disheartened, and soon they will retreat. Therefore, the Perfected One always defends against bandits with arms, and bandits cannot invade; with firm city walls, bandits cannot prevail.\n\nWhen a state is on the verge of chaos, how shall it be stabilized? When ministers grow weary and plot rebellion, how shall they be pacified? It is said: the people rebel from vexation, ministers rebel from confusion—such is the cause of chaos and rebellion. How shall it be remedied? It is said: abandon greed and desire, govern through non-action to nurture the people. When the common folk are at peace, they will delight in their ruler and state, and chaos will never arise. When all under heaven willingly submit, how could they desire disorder? Thus, there is no chaos.\n\nWhen ministers plot rebellion, it is because the ruler is confused, and they do not follow the laws. Their conduct is unlawful—this is why they rebel. They must repent their errors, reform the old and cultivate the new, rectify the framework and govern by law. Within, there is no confusion; without, no tyranny. Therefore, the Perfected One always dispels vexation and chaos, and the people are tranquil; always dispels confusion and treachery, and ministers delight in loyalty. When the ruler is clear and ministers are at peace, there is no collapse; when the people delight in harmony, there is lasting security.\n\nUncarved wood cannot become a vessel; untilled land will never yield soft grain. Why? Uncarved wood will eventually rot and decay; untilled fields will grow thick with thorns. Jackals, wolves, foxes, and owls will dwell within, while horned owls and magpies nest in the woods. Abandoned fields become overgrown with brambles. When scholars abandon the law, it is the same. If wood remains uncarved, it will forever remain dry and brittle. But if it encounters a craftsman, who applies the marking line, the axe, saw, and chisel, and day by day refines it with carving, it will surely achieve its purpose—used, it will serve as desired; tempered, it will suffer no damage.\n\nThus, the Perfected One wields uncarved wood and employs craftsmen, and so can fashion vessels; cultivates untilled land, and so can harvest grain. Why? Uncarved wood and untilled fields are like the ordinary person; encountering craftsmen and plowing are like the teacher’s instruction; becoming a vessel and reaping grain are like the fruition of practice. Therefore, the Perfected One diligently cultivates and refines, and now attains perfection.\n\nPractice non-action, and each day brings increase; practice action, and each day brings loss. Why? Non-action does not obstruct things, and one knows the benefit of non-action. Those who cling to action are attached to existence, yet all that exists ultimately returns to non-existence. Thus, one knows that action brings daily loss. If one can reduce and reduce again, until reaching non-action, then the Perfected One cultivates non-action and not action, practices increase and not loss, and so can achieve growth.\n\nDwelling in the Dao, one must walk the upright path; abiding in the law, one must act with truth. Those who do not do so will surely fall into deviance. Therefore, the Perfected One always closes the gate of deviance and opens the path of uprightness. Through this cause and condition, one now attains the position of true perfection. Why? It is like a smith who, regardless of the shape’s size, uses the square and compass to measure all around—nothing fails to conform. Why? If the mold is uniform, the material takes shape according to its kind, never deviating or changing. It transforms and returns to its nature, whether gold or silver, copper or iron. When melted, it manifests according to its kind.\n\nIf the teacher practices uprightness, the disciple will also be upright; if the teacher indulges in deviance, the disciple will also be deviant. The transmission between teacher and disciple is just like this. Sand and stone may be hard, but within the mortar, they are ground to powder. Without the craftsman’s hammer, how can they be refined? Blue and white stones, with straight veins and patterns, may become pestles—yet even the most skilled craftsman, without a hammer in hand, how can they be shaped?\n\nThus, scholars must apply admonition and guidance, following the text to gain understanding. Even if a worthy teacher imparts instruction, without the text, nothing is taught; even if one has fine talent, without a teacher, nothing is learned. Therefore, one is cultivated through texts and guided through admonition.\n\nIt is like building a boat—without water, it cannot sail; like felling a tree—without an axe, it cannot be cut; like kindling a fire—without wood, it cannot be lit; like drawing from a deep well—without a rope, it cannot be retrieved. Thus, the Perfected One encounters craftsmen and receives their hammering, and now attains the task of Great Perfection and non-action.\n\nIf water is placed in a cauldron but no fire is applied, how can it boil? If grain is placed in a mortar but left unthreshed, how can it be refined? Therefore, all undertakings are accomplished through effort. If one aspires to the flavor of the Dao, one must labor diligently—only then can it be perfected and exalted. Thus, the Perfected One encounters fire and receives threshing, and now attains the fruit of ripeness and maturity. Why? Fortune is never wasted in vain; merit never loses its lesson.",
      "overlap_context": "s practice at their side, the nine immortals stand in ranks. Through kalpas they do not decline, through countless ages they do not age. They depart like bending and stretching, their form traverses the four directions. Six kinds of tremors shake the earth, yet they remain serene as the sea’s edge. Such is their awe-inspiring virtue—the king of ten thousand sages.\n\nArising from study, they transcend the Daoist realm; the ignorant do not believe, startled and bewildered, they clamor in confusion.",
      "start_char": 12357,
      "end_char": 13426,
      "start_sentence": 651,
      "end_sentence": 716,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.390146255493164,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "不磨不扇，守弊必终； 不雕不琢，朴朽必弃。 是故智人乃能行之，乃能勤之，不行不勤，终不近之。 釜水不爨，臼谷不舂，坐看不为，无时如意。 道人在法不行其道，亦复如是。 琴瑟虽有雅乐之音，非弹不鸣； 钟鼓虽有节曲之响，非打不声。 是以真人弹琴悟人，打鼓来众。 何以故？ 弹琴打鼓，欲令众生前得闻知。 琴鼓者，譬如道性，叩打者，譬如师教。 若好琴者自来听琴，好鼓者自来听鼓。 是以真人恒打鼓弹琴，不舍昼夜。 何以故？ 真人以忧众生，不闻乐故，是以昼夜打之。 若有众生好於三宝，当与之三宝，若有好之琴瑟，当与之琴瑟。 何以故？ 琴瑟能悟众生，故与之。 若真人不弹琴鼓瑟，众生何以故得知之？ 真人不宣真理，众生无以得知之。 是以与三宝，与琴瑟，故譬之。 尔时，坐中野母，闻天尊说弹琴鼓瑟以悟众生，悉归改悟，是以昼夜作琴打鼓，不敢自停之法。 野母於是便回北陇山中，伐於秋桐，造作锺鼓，并及琴瑟。 珠玩色染，盘龙克镂，黄丝为弦，磨玉折，师徒三千，於斯国中，校习琴瑟，捊浮锺鼓，昼夜振击，时不暂辍。 远近民人，悉来听乐，若男若女，莫不自停，聚众千万，来不知止。 野母欢喜，甚无已已，从年匝岁，专习不改，自谓朝升暮仙，阿尔而登，从初至老，各随时而终，堕於三涂。 是以真人终不承声，故能致审，终不自知，故能成知。 何以故？ 真人学道，不师不受，不解不反，不明不宣。 是以真人不自师，故成师，不自明，故成明，不自彰，故成彰，不自与，故成与。 是以不自师，不自明，不自彰，不自与，众功处身，故能成真。 以此故作偈颂曰： 综揽说太常，万法亦无定。 来去如回风，东流逝长命。 回转若涌沸，恻怆伤人性。 孔智观来世，故舍去顺行。 世身修安乐，果成登无上。 万恼若云消，清静无为正乱相好具足发，超迈大通圣。 一切凡夫福，□□□□□。 太上妙法本相经卷中竟 太上妙法本相经卷下 普说 天尊言：我於斯之中，为诸众生普说太上妙法本相，至道之因，无量度人，一切众生悉来振集，莫不倾仰。 尔时东虞、西虞、南北四虞，东来、西来、南北四来，野母、不钩、独挽、木侯、鸡鹿，一切邪道，悉来在座，各自赫奕光明，动摇於其众中，澄曜威神，竞作巧辞，试难不行。 虞曰：昨君所说，一切众生，从先业至彼后报，因前而获其果，皆不妄举。 我窃观一切众生，重室之中而居巨夜，岂知前世之因，今身之报？ 若遭教泽法，法果可登，若不遇者，随流而去。 譬如流中采薪，钩着者得，不钩着者随流而去。 一切凡夫亦如水中之薪，遭教则达，不遭则去，岂有先业所加，今身而受？ 若先因所行者，则不须更造，若恃前业所缘，今不须求教，定分以竟，不用假受。 如君所说，皆不合至真之道，其言未解。 虞复言曰：十方众生，各有类气，不依先业之所造也。 譬如禽还生禽，兽还生兽，人民草木，蠢动众生，种种相生，类类相似，岂有前因果报乎？ 譬如销金，随类色见。 譬如种植，随种而果。 岂可非类而变应也！ 如君所说，皆不合至真，其言未解。 来复言曰：我见众生，父母四足，子亦四足，父母飞行，子亦飞行，父母白黑，其子白黑，父母能言，其子能言，未有鸟能驰步万里者也。",
      "translated_text": "Without grinding and winnowing, the decayed will surely endure; without carving and polishing, the unhewn will surely be discarded. Thus, only the wise can practice this, only they can labor at it—without practice and without diligence, one will never draw near. Water in a cauldron left unheated, grain in a mortar left unthreshed—merely watching without acting, one will never attain one’s desire. The Daoist who abides in the Dharma yet does not practice the Way is likewise.\n\nThough the zither and lute possess refined music, without plucking they do not sound; though bells and drums possess rhythmic tones, without striking they do not resound. Thus, the Perfected One plucks the zither to awaken others, strikes the drum to gather the multitude. Why? By plucking the zither and striking the drum, one allows all beings to hear and know. The zither and drum are like the nature of the Dao; the one who strikes them is like the master’s teaching. If one loves the zither, one comes of one’s own to listen; if one loves the drum, one comes of one’s own to listen. Thus, the Perfected One constantly strikes the drum and plucks the zither, never ceasing day or night. Why? The Perfected One pities beings who do not hear the music, and so strikes it day and night.\n\nIf there are beings who delight in the Three Treasures, one should give them the Three Treasures; if there are those who love the zither and lute, one should give them the zither and lute. Why? The zither and lute can awaken beings, and so one gives them. If the Perfected One does not pluck the zither or strike the lute, how will beings come to know? If the Perfected One does not proclaim the true principle, how will beings come to know it? Thus, one gives the Three Treasures, gives the zither and lute—hence the analogy.\n\nAt that time, the Wild Mother among the assembly heard the Heavenly Worthy expound on plucking the zither and striking the drum to awaken beings. All repented and awakened, and so she practiced day and night, striking the zither and drum without daring to cease. The Wild Mother then returned to the northern Long Mountains, felled autumn paulownia trees, and crafted bells, drums, zithers, and lutes. Adorned with pearls and dyed in vibrant hues, carved with coiling dragons, strung with yellow silk, and inlaid with polished jade, she gathered three thousand disciples in that land to practice the zither and lute, to strike the floating bells and drums, playing day and night without pause. People from near and far all came to listen to the music—men and women alike, none did not halt their steps. The multitude gathered in the tens of thousands, coming without end. The Wild Mother rejoiced without cease, practicing year after year without change, believing she would ascend as an immortal by dawn and dusk, rising step by step. Yet from youth to old age, each met their end in due time, falling into the Three Wretched Realms.\n\nThus, the Perfected One never relies on sound yet attains discernment; never presumes to know yet achieves true knowledge. Why? The Perfected One studies the Dao without a master, without receiving instruction; without understanding, there is no reversal; without clarity, there is no proclamation. Thus, the Perfected One does not take oneself as a master yet becomes a master; does not presume to be enlightened yet becomes enlightened; does not seek to manifest yet becomes manifest; does not give of oneself yet bestows. By not taking oneself as a master, not presuming enlightenment, not seeking manifestation, not giving of oneself, all merits reside within—thus one attains perfection.\n\nTherefore, a gāthā says:\nGrasping the discourse of the Great Constant,\nThe myriad dharmas have no fixed form.\nComing and going like the whirling wind,\nFlowing eastward, life swiftly passes.\nRevolving like surging, boiling waters,\nGrievously wounding the human nature.\nWith profound wisdom, observe future lives—\nThus, abandon the path of compliance.\nCultivate the body in worldly ease,\nYet the fruit is ascent to the supreme.\nMyriad afflictions dissolve like clouds,\nIn purity and non-action, the true corrects the chaotic.\nWith perfect adornments, radiance fully emerges,\nSurpassing the great penetration of the sage.\nAll the blessings of ordinary beings—\n[...]\n\nThe *Sublime Scripture of the Original Form of the Wondrous Dharma*, Middle Fascicle, concludes.\n\nThe *Sublime Scripture of the Original Form of the Wondrous Dharma*, Lower Fascicle:\nUniversal Exposition\n\nThe Heavenly Worthy said: Within this, for all beings, I universally expound the original form of the sublime wondrous Dharma, the cause of the supreme Way, delivering boundless multitudes. All beings gather in assembly, none do not revere and admire.\n\nAt that time, the Eastern Yu, Western Yu, Southern and Northern Yu; the Eastern Lai, Western Lai, Southern and Northern Lai; the Wild Mother, the Unhooked, the Lone Drawer, the Wooden Marquis, the Chicken Deer—all heretical paths—came to be seated. Each shone with radiant brilliance, stirring among the assembly, their numinous majesty resplendent, vying in eloquent words to test and challenge without yielding.\n\nThe Yu said: What you spoke yesterday—that all beings, from past karma to future retribution, reap the fruits of their former causes—is not mistaken. Yet I observe that all beings dwell in the heavy chamber of the great night—how can they know the causes of past lives or the retribution of the present body? If they encounter the grace of the Dharma, the fruit of the Dharma may be attained; if they do not, they drift with the current. Like gathering firewood in a stream, those caught by the hook are retrieved; those not caught drift away. All ordinary beings are like firewood in water—those who encounter the teaching attain it; those who do not drift away. How can there be past karma imposed upon them, retribution borne in this life? If it were due to past causes, there would be no need for further action; if relying on past karmic conditions, there would be no need to seek the teaching. The allotment would be complete, no need for provisional reception. What you have said does not accord with the Way of the utmost truth—your words are not yet understood.\n\nThe Yu continued: The beings of the ten directions each possess their kind of qi, not dependent on past karma’s creation. For example, birds give birth to birds, beasts to beasts; humans, plants, crawling creatures—each kind begets its like, each type resembles its own. How can there be past causes and karmic retribution? Like melting gold, its color appears according to its kind; like planting seeds, the fruit follows the seed. How can there be transformation contrary to kind? What you have said does not accord with the utmost truth—your words are not yet understood.\n\nThe Lai replied: I observe that if parents have four legs, their offspring also have four legs; if parents fly, their offspring also fly; if parents are white or black, their offspring are white or black; if parents can speak, their offspring can speak. Yet there has never been a bird that could gallop a thousand miles.",
      "overlap_context": "water is placed in a cauldron but no fire is applied, how can it boil? If grain is placed in a mortar but left unthreshed, how can it be refined? Therefore, all undertakings are accomplished through effort. If one aspires to the flavor of the Dao, one must labor diligently—only then can it be perfected and exalted. Thus, the Perfected One encounters fire and receives threshing, and now attains the fruit of ripeness and maturity. Why? Fortune is never wasted in vain; merit never loses its lesson.",
      "start_char": 13426,
      "end_char": 14679,
      "start_sentence": 717,
      "end_sentence": 774,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.69072341918945,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "如君所说，皆不合至真，其言未解。 来复言曰：吾见鱼止水之中，虎居长林，燕雀依人，蚯蚓居穴，类气受性，各有所禀。 岂有非性而食之也！ 如君所说，皆不合至真，其言未解。 野母复言：我见虫还生虫，蚝还生蚝，蝇还生蝇，蚁还生蚁，随气啖食，以养性命，岂有生业而改其形也！ 如君所说，皆不合至真，其言未解。 不钩复言曰：我见众生，若有啖肉者，其子啖肉，若有啖草者，其子食草，若有食木者，其子食木，若有啖土者，其子啖土。 一切众生各有定气，不相假受，错谬其类也！ 如君所说，皆不合至真，其言未解。 独挽复言曰：我见一切众生性不同，同体而异名，阴阳不同，受化不等，依斯理物，各有类气，不相改异。 况一可知百，类一可知万。 如君所说，都不合至真，其言未解。 木侯复言曰：我见保国保身，依国依形，被发还以被发，傍行还以傍行，随类而生，随种而果，岂有非其性而横受也！ 从天至地，未有异类而异受之。 如君所说，皆不合至真，其言未解。",
      "translated_text": "The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Lai replied: I observe fish dwelling in still waters, tigers in deep forests, swallows and sparrows near humans, and earthworms in their burrows. Each kind receives its qi and nature, each endowed with its own disposition. How could any consume what is contrary to its nature? The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Wild Mother said: I see worms beget worms, oysters beget oysters, flies beget flies, and ants beget ants. They feed according to their qi, sustaining their lives—how could their karmic birth alter their form? The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Unhooked One said: I see that among all beings, those that eat meat produce offspring that eat meat; those that graze on grass produce offspring that graze on grass; those that consume wood produce offspring that consume wood; and those that feed on earth produce offspring that feed on earth. All beings possess their own fixed qi, none borrow from another—how could they be mistaken for a different kind? The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Lone Archer said: I see that all beings differ in nature, sharing the same substance yet bearing different names. Yin and yang are not the same, and their transformations vary. According to this principle, each possesses its own kind of qi, never altering or changing. If one understands this, then a hundred may be known; if one grasps a single kind, then ten thousand may be known. The Master’s words do not accord with the utmost truth—his understanding remains unclear.\n\nThe Wooden Marquis said: I see that to preserve a nation is to preserve its form; to preserve the body is to preserve its shape. Those with flowing hair beget offspring with flowing hair; those that crawl sideways beget offspring that crawl sideways. They are born according to their kind and bear fruit according to their seed—how could they receive what is contrary to their nature? From heaven to earth, there has never been a case of one kind receiving what belongs to another. The Master’s words do not accord with the utmost truth—his understanding remains unclear.",
      "overlap_context": " seeds, the fruit follows the seed. How can there be transformation contrary to kind? What you have said does not accord with the utmost truth—your words are not yet understood.\n\nThe Lai replied: I observe that if parents have four legs, their offspring also have four legs; if parents fly, their offspring also fly; if parents are white or black, their offspring are white or black; if parents can speak, their offspring can speak. Yet there has never been a bird that could gallop a thousand miles.",
      "start_char": 14679,
      "end_char": 15084,
      "start_sentence": 775,
      "end_sentence": 789,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.826520919799805,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "鸡、鹿各复言曰：我见一切众生，或方或圆，或长或短，各自受气，类性定也，未见炼土成金，变豕为犬。 类类相生，种种自续，各各受气，不相改易，若当改易，一切凡夫，蠢动众生，悉有前世因缘，福德所种，有成於至真之道乎！ 若类不改，定而受生，君之所言，皆是虚妄，诱诳童蒙，无益之业也。 我当遭今身所造，即见受也，终不习君虚说前世之因，妄论未来之果，遂使迷悮后学，乱化国土，空悦时变，可见神乎？ 若尔从之，於是与长生隔矣。 天尊言曰； 夫一切众生，各有缘品，前世积业，今身所受，今身所造，后世所受。 无因无缘，果从何成？ 无父无母，子因何生？ 无天无地，万类何停？ 譬如种植，非地不生。 譬如飞虫，非羽不飞。 譬如飞驰，非空不行。 譬如云雨，非龙不成。 何以故？ 若有种类，不相假受，应普同命，若有定类，应普同成。 所以一父而生，其受不同，一母而乳，其貌不等。 若无因缘，应普同受，若无祸福，应普强弱。 如汝所言，空中可以种栽，流中可以田耨，无父可以结子，无母可以生息。 锻矿可以成器，系蜂可以获蜜，养蚕可以得锦，长麻可以成纻。 何以故？ 以能锻矿故，以系蜂获蜜故，以使蚕穿纹故，麻纻自成故。 子之所成者，与我道异也。 吾道与子道不同，吾习与子习不等，道名虽同，逆顺理反，何以故？ 吾之所用，因实而修空，据有而行道，行於未来之用，修於不望之果，是故知勤不知报，而果自应，知行不知到，而道自达。 以成功退之，而功自功，居福舍之，而福自福。 若处其功，功无可恃，若居其福，福尽无止。 故退功舍福，终会功福，积世行道，果感所到。 是以真人积千世之业，而不望报。 投臭身於鹰虎，岂望鹰虎所报也，但哀饥饿故。 是以施不望报，而运自应，苦不望乐，而乐自感。 故知行、知勤、知习、知用，终不望一身而责其果也。 是以吾与子所用不同，功受不等也。 四虞、四来、野母、不钩、独挽、木侯、鸡、鹿等，各不信受，相谓言曰：天尊者，非至真之道也。 妄说虚空未来之果，广演譬喻，诱诸愚冥，虚身丧形，枉及受生也。 虚证将来未然之果，巧言妄譬，说有因缘，及诸四众，迷心未了，一生之中，虚弃当年也。 於是生心欲停止者，踊跃飞驰，悉皆还返。 尔时，天尊闭天光明，四方冥黑，诸道迷乱，莫知趣向，唯有座所光明如常，无有迷乱。 诸道还来就其光明，因而问曰：天何妖怪，忽无光明，四方冥黑，行者迷返？ 不审此怪为坐何事？ 。 天尊曰：天光自无，何关子焉。 子积行道术，飞驰空中，威神之力，世所无有，岂为暗所拘，而论迷乱也！ 我止知说将来未然之果，诱说愚蒙过去之法，岂知光明所以而闭也！ 汝何不作道智观之，道眼视之，足知所由乎？ 虞曰：我道止知长寿短寿、飞行之事，未睹斯理。 天尊与我分别，若能知之，即知天尊得因缘之果，未来之功； 若不能了，即知天尊所说之妄也。 天尊於是欣然而笑，光明从口中而出，照曜十方，朗睹八清，及得过去所受，未来所趣，见前之业，悉各鉴视。 及诸四种众生，过去未来，及得见在，一切受趣，莫不见之。 见昆仑顶上神仙之宫，壁方四千里，周回一千二百门，其中小宫三千六百区，金楼玉殿，五城十二门，纯以琉璃为地，珊瑚、银薄、真珠连绵，千屈万迭，晃曜无比。",
      "translated_text": "The Cock and the Deer each spoke in turn: \"We observe that all living beings—whether square or round, long or short—each receives its qi according to its kind, and their natures are fixed. We have never seen clay smelted into gold or pigs transformed into dogs. Kind begets kind, seed perpetuates seed, each receives its qi without alteration. If alteration were possible, then all ordinary beings, all creatures in motion, would possess past-life causes and conditions, and the virtues they have sown—could these lead to the attainment of the utmost truth? If kinds do not change and are fixed in their reception of life, then your words are all false and deceptive, deluding the ignorant with useless teachings.\n\nWe accept only what we see in this present life—what we have wrought, we receive. We will never follow your empty talk of past-life causes or recklessly discuss future retribution, lest we mislead later learners and disrupt the transformation of the land, vainly pleasing the fleeting times. Can such be called divine? If one follows this, one is forever cut off from long life.\"\n\nThe Heavenly Worthy said: \"All living beings possess their own conditions and ranks. The deeds accumulated in past lives are received in this life; what is wrought in this life is received in the next. Without cause or condition, how can fruit come to be? Without father or mother, how can a child be born? Without heaven or earth, where would the myriad kinds abide?\n\nIt is like planting: without earth, nothing grows. Like flying insects: without wings, they cannot fly. Like swift movement: without space, it cannot proceed. Like clouds and rain: without dragons, they cannot form. Why is this so? If kinds did not rely on one another, all would share the same fate. If kinds were fixed, all would uniformly attain completion. Yet from one father, offspring differ in their reception; from one mother’s milk, their appearances vary. Without cause and condition, all would receive equally; without fortune or misfortune, all would be uniformly strong or weak.\n\nBy your reasoning, one could plant in empty space, farm in flowing streams, bear children without a father, or give birth without a mother. One could forge ore into vessels, bind bees to harvest honey, raise silkworms to obtain brocade, or grow hemp to make fine linen. Why? Because ore can be forged, bees can be bound to yield honey, silkworms can be made to spin patterns, and hemp naturally becomes linen. What you achieve differs from my Way.\n\nMy Way and yours are not the same; my practice and yours are unequal. Though the name of the Way may be shared, its principles are opposed in direction. Why? I employ the method of cultivating emptiness through reality, practicing the Way through existence, acting for future use, and cultivating without expectation of reward. Thus, knowing diligence but not reward, the fruit naturally responds; knowing action but not arrival, the Way naturally reaches. Withdrawing from achievement, achievement achieves itself; relinquishing fortune, fortune fortifies itself. If one clings to achievement, it cannot be relied upon; if one dwells in fortune, it will be exhausted without end. Therefore, withdrawing from achievement and relinquishing fortune, one ultimately meets with both. Accumulating the practice of the Way over lifetimes, the response of the fruit reaches its destination.\n\nThus, the perfected ones accumulate deeds over a thousand lifetimes without expecting reward. They cast their foul bodies to eagles and tigers—not hoping for repayment from eagles and tigers, but only pitying their hunger. Therefore, giving without expecting reward, the movement naturally responds; suffering without seeking joy, joy naturally manifests. Thus, knowing action, diligence, practice, and application, one never expects a single lifetime to demand its fruit. This is why my use differs from yours, and our reception of merit is unequal.\"\n\nThe Four Yu, Four Lai, Wild Mother, Unhooked, Lone Puller, Wooden Marquis, Cock, and Deer all refused to believe and said to one another: \"The Heavenly Worthy does not teach the utmost truth. He recklessly speaks of empty, future fruits, expounding parables to delude the ignorant, wasting their bodies and forms, and vainly involving them in rebirth. He falsely testifies to future, unrealized fruits, crafting clever words and false analogies, speaking of causes and conditions. Among the four assemblies, those whose minds are deluded and unenlightened waste their years in vain.\n\nAt this, those who had intended to stay arose in haste and fled. Then the Heavenly Worthy closed the celestial radiance, and darkness enveloped the four directions. The various Ways were lost, not knowing where to turn, except for the place where he sat, which remained as brightly lit as before, undisturbed. The followers of the Ways returned to the light and asked: \"What ominous portent has caused the sudden absence of light and the darkness in the four directions, leaving travelers lost and turning back? We do not know what has caused this strange event.\"\n\nThe Heavenly Worthy said: \"The celestial light has vanished of itself—what concern is it of yours? You accumulate the arts of the Way and soar through empty space, your might and spirit unmatched in the world. How could darkness confine you or cause you to speak of being lost? I merely speak of future, unrealized fruits and guide the ignorant with past teachings—how would I know why the light has closed?\"\n\nYu said: \"Our Way knows only of long life, short life, and flying—we have not beheld such principles. Heavenly Worthy, distinguish this for us: if we can understand, then we will know that you have attained the fruit of causes and conditions and the merit of the future. If we cannot, then we will know your words are false.\"\n\nThe Heavenly Worthy then smiled joyfully, and radiance issued from his mouth, illuminating the ten directions and brightly revealing the Eight Purities. They saw all they had received in past lives and all they were destined for in the future, witnessing the deeds of former times, each clearly reflected. The four kinds of beings saw their past, future, and present states, all their destinies and rebirths, none unseen.\n\nThey beheld the divine immortals’ palaces atop Kunlun’s summit—a wall four thousand *li* square, with twelve hundred gates encircling it. Within were three thousand six hundred smaller palaces, jade towers and golden halls, five cities with twelve gates each. The ground was made entirely of lapis lazuli, adorned with coral, silver foil, and strands of pearls, intricately layered in a thousand folds, their brilliance unmatched.",
      "overlap_context": " its form; to preserve the body is to preserve its shape. Those with flowing hair beget offspring with flowing hair; those that crawl sideways beget offspring that crawl sideways. They are born according to their kind and bear fruit according to their seed—how could they receive what is contrary to their nature? From heaven to earth, there has never been a case of one kind receiving what belongs to another. The Master’s words do not accord with the utmost truth—his understanding remains unclear.",
      "start_char": 15085,
      "end_char": 16356,
      "start_sentence": 790,
      "end_sentence": 840,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.522518634796143,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "但见天帝在中而治，三十二天王辅弼四边。 复见四角上宫阁，高妙丽饰，有四天帝王，治在其中，天龙鬼神，亦在左右。 昆仑之上，见斯妙乐，不可称计。 尔时四虞、四来、诸邪道等，心乃开悟，於是不退，遂获地仙之道。 尔时，静老问曰：一切众生各有缘品，人之所行，一依所行计业而致其报，如四虞、四来等，以前不信正真，故今落邪中。 昨虽一往，自行威力，不从真教，叛而去之，昏迷还返。 今虽不信，犹未委尽，一信之间，所获即高。 其事云何？ 答曰：如斯十二邪道，始於道时，皆起邪妄之因，以遭不正之师，受於不正之气，其气成精，遂落邪中，其神以附，名为邪道耳。 以今一回之信，缘此回信之功，以致地仙之道耳。 四虞慧根多，故终轮於大道大真之位也。 何以故？ 夫为道者，尚於初心，贵其后成，是以得一果之报。 譬如种树结果，值岁霜雹、寒风废折，不收其果，后岁时调适，花得结实，足以丰甘，是故择岁而熟，必存一果。 何以故？ 树者，譬学士； 花者，譬其果； 霜雹，譬邪师。 是以中为邪所误，今就正真教也。 东虞者，东海中原人，少修道业，志存神仙，中遭伪师之法，因而行伪，遂名为伪道也。 西虞者，西海金仓人也，少好上道，不务家业，中遭野母之教，习而不正，修行其法，遂染邪精。 其修不正，邪气以附，其神染着，自谓真仙，即名为邪道也。 南来者，南海阳泽人也，少术道法，志契朱紫，中遭三志之教，乐而行用，其气附着，遂为外也。 北来者，北海仓池人也，少染道教，长遭邪师之法，随而行之，自谓正真之道，习而行之，遂名为邪也。 野母者，西方长引人也，少修道业，不务王俗，中遭邪僻之教，因而习之，即落理外，不只正教，邪气附着，其精化神，如可法效，即而染之者，皆名邪道也。 不钩者，北方寒池人也，少好道业，不群流俗，中遭伪师之教，专而修之，遂致邪气附入，其神可效，因而行之，名为邪道也。 独挽者，东方无极人也，少好道法，专志正真，中遭伪师之教，法而行之，遂致邪中，是以其法易遭，其师叵直。 故师者，道士之父母也，乳饴诸子，甚须良美。 是以真人择师而学，故能成真，审道而修，故能成道。 何以故？ 诸道致邪，一由师教之不真，树花遭霜，亦由匠者之不正，中遭外教，盖由心意之不坚。 夫为学士，先志后愿，必全其真，先念后勤，必达其果。 故道人强於志，坚於诫，牢於心，审於意，择师而修，良、徒而行，三思求益，岂有过误？ 追逐明师，不辞勤苦，日有三益，岂有颠蹙？ 是故为道不易，为师甚难。 譬如行人共侣，经过险路，千万之众，皆不能达，若有一人二人，文能润众，武能敌愚，强抚无怯，前盗息心，诸来行众，悉得通达，千万之侣，莫不蒙恩。 若有学士，遭其良徒，亦复如是。 是故真人不妄修，不妄行，以致於无为，弃损取益，成道以此。 虞问天尊曰：一切万法，悉从何生，因何气而有？ 唯愿天尊告其因缘，令诸众等，各知所从而来。 答曰：一切万法，各禀道气而生，因空而成。 何以故？ 道者无形，应气万质； 空者无段，通运有形。 无空无气，荡绝言想； 无言无想，万有隐没。 是故道者万物之父，空者万物之母。",
      "translated_text": "Then they beheld the Heavenly Thearch ruling at the center, with the thirty-two Heavenly Kings assisting on all four sides. At the four corners stood towering palaces, exquisitely adorned, where four Heavenly Thearchs governed, with celestial dragons, ghosts, and spirits attending on either side. Above Kunlun, such wondrous music resounded beyond all reckoning.\n\nAt that moment, the Four Yu, Four Lai, and all those of heterodox paths awakened in their hearts, never to regress, and thus attained the Dao of earthly immortals.\n\nThen Elder Jing asked: \"All beings have their karmic conditions, and human actions are repaid according to the deeds they accumulate. Take the Four Yu and Four Lai—formerly they did not believe in the true and authentic, so they fell into heterodoxy. Though they once strayed, exerting their own power without following true teachings, they rebelled and departed, returning in confusion. Yet even now, though they still do not fully believe, their faith is not entirely exhausted. In a single moment of belief, what they attain is lofty. How is this so?\"\n\nThe answer came: \"These twelve heterodox paths, when they first embarked on the Dao, all arose from deluded and false causes. They encountered unorthodox masters, received unorthodox *qi*, and when that *qi* took form, they fell into heterodoxy. Their spirits became attached, and thus they were called heterodox paths. Now, through this single turning of faith, by the merit of this returning faith, they have attained the Dao of earthly immortals. The Four Yu possess abundant roots of wisdom, so they will ultimately revolve into the ranks of the Great Dao and Great Perfection. Why is this? For those who cultivate the Dao, the initial resolve is prized, but what matters is their later attainment. Thus they receive the reward of a single fruit. It is like planting a tree that bears fruit—if frost, hail, or bitter winds strike in a given year, breaking its branches, the fruit is lost. But when the seasons later become temperate, the flowers set fruit, yielding abundance and sweetness. Thus, though the tree ripens in due season, it preserves at least one fruit. Why? The tree is like the scholar; the flowers are like their fruits; frost and hail are like heterodox masters. Though they were once led astray by heterodoxy, now they have turned to true teachings.\n\nThe Eastern Yu was originally a man from the Central Plains of the Eastern Sea. In his youth, he cultivated the Dao and aspired to become a divine immortal, but midway he encountered the teachings of a false master and practiced deception, thus earning the name of a false path.\n\nThe Western Yu was from Jin Cang in the Western Sea. In his youth, he loved the supreme Dao and neglected worldly affairs, but midway he encountered the teachings of the Wild Mother, which he practiced incorrectly. Cultivating her methods, he became tainted by heterodox *qi*. His practice was unorthodox, the heterodox *qi* attached to him, and his spirit became stained. Believing himself a true immortal, he was called a heterodox path.\n\nThe Southern Lai was from Yang Ze in the Southern Sea. In his youth, he practiced Daoist arts and aspired to the purple of high rank, but midway he encountered the teachings of the Three Aspirations, which he delighted in and applied. The *qi* attached to him, and he became an outsider.\n\nThe Northern Lai was from Cang Chi in the Northern Sea. In his youth, he was drawn to Daoist teachings, but in adulthood he encountered the methods of a heterodox master and followed them, believing them to be the true and authentic Dao. Practicing them, he was called heterodox.\n\nThe Wild Mother was a woman from the distant West. In her youth, she cultivated the Dao and rejected worldly customs, but midway she encountered perverse and deviant teachings, which she practiced and thus fell outside the principles of the true teaching. Heterodox *qi* attached to her, her essence transformed into spirit, and those who imitated her were all called heterodox paths.\n\nThe Unhooked was from Han Chi in the North. In his youth, he loved the Dao and did not follow the common crowd, but midway he encountered the teachings of a false master, which he devotedly practiced. Thus heterodox *qi* entered and attached to him, and his spirit became imitable. Practicing accordingly, he was called a heterodox path.\n\nThe Lone Draught was from Wuji in the East. In his youth, he loved Daoist arts and was devoted to the true and authentic, but midway he encountered the teachings of a false master, which he practiced and thus fell into heterodoxy. His methods were easily corrupted, and his master was untrustworthy.\n\nThus, the master is the father and mother of the Daoist. Like nursing a child with milk and sweetness, one must seek the finest and purest. Therefore, the true person chooses a master to study under and can thus attain perfection. They examine the Dao and cultivate it, and thus can accomplish the Dao. Why? All paths that lead to heterodoxy stem from the master’s teachings not being true. When a tree’s flowers are struck by frost, it is also due to the craftsman’s lack of skill. To be led astray by external teachings is due to the mind’s lack of firmness.\n\nFor the scholar, first resolve, then vow; one must preserve their authenticity. First contemplate, then diligently practice, and one will surely reach their fruition. Thus, the Daoist must strengthen their resolve, fortify their precepts, secure their heart, and scrutinize their intentions. They must choose a master to cultivate under, select good companions to practice with, and reflect thrice in seeking benefit—how could they err? Pursuing an enlightened master without shunning hardship, gaining three benefits each day—how could they falter?\n\nThus, cultivating the Dao is not easy, and being a master is even more difficult. It is like travelers journeying together through perilous paths. Of a thousand or ten thousand, none may reach their destination. But if one or two are learned enough to guide the crowd and brave enough to resist the foolish, resolutely protecting the timid, calming the bandits ahead, then all the travelers can pass through safely. Of a thousand or ten thousand companions, none will fail to receive grace. If a scholar encounters a good companion, it is the same.\n\nTherefore, the true person does not practice recklessly or act carelessly, thus attaining non-action. Discarding what is harmful and embracing what is beneficial, they accomplish the Dao by this means.\"\n\nYu asked the Heavenly Worthy: \"All the myriad dharmas—from what do they arise, and by what *qi* do they exist? I only wish the Heavenly Worthy would explain their causes and conditions, so that all beings may know from whence they come.\"\n\nThe answer came: \"All the myriad dharmas arise by receiving the *qi* of the Dao and are completed through emptiness. Why? The Dao is formless, yet responds to *qi* in myriad forms. Emptiness is without division, yet permeates and moves all that has form. Without emptiness and without *qi*, all speech and thought are obliterated. Without speech and without thought, the ten thousand existences vanish. Thus, the Dao is the father of the myriad things, and emptiness is the mother of the myriad things.\"",
      "overlap_context": ", and present states, all their destinies and rebirths, none unseen.\n\nThey beheld the divine immortals’ palaces atop Kunlun’s summit—a wall four thousand *li* square, with twelve hundred gates encircling it. Within were three thousand six hundred smaller palaces, jade towers and golden halls, five cities with twelve gates each. The ground was made entirely of lapis lazuli, adorned with coral, silver foil, and strands of pearls, intricately layered in a thousand folds, their brilliance unmatched.",
      "start_char": 16356,
      "end_char": 17578,
      "start_sentence": 841,
      "end_sentence": 887,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.27201867103577,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "何以故？ 譬如父阳母阴，因果胎息，以十月之得有形，施名立字，乃有父子之道，尊卑之位。 若其无父，子从何生； 若其无母，胎息何成？ 是故空者，运通居之，将知是其母。 子无所因，则无其子，若无其子，可不空无也。 若有其子，空者万有之母。 是故道生德畜，假有若存形。 若非其子，孝道无以可明。 若无其有，空无以可辩？ 是故有无相生，此之谓也。 ，是以真人恒修於空，以贵其母故，恒顺於道，以尊其父故。 是以尊道贵空，所敬处大。 何以故？ 我之本，父母也，故所敬处大。 可有众生，不避贵贱，不知其所重者，自伐其形，自绝其根。 何以故？ 譬如其树，若刖斩其根株者，万无一活，若露其根株者，遭冬则枯槁。 狂人失道，亦复如是。 其犹颠木之生苗，逸鱼之失水，假尔而生，命亦不久。 是以真人守道坚固，以致长存，深根固蒂，以致华颜。 故不为违，不为逆，安乐以此。 虞曰：受恩。 愿问余解。 夫道至真，以无言为宗，无体无形，假以空无为主。 不审诸真人见在福中者，敬修何法？ 述何为质？ 因何起心？",
      "translated_text": "Why is this so? It is like the father as yang and the mother as yin—through cause and effect, through the breath of the womb, after ten months a form is attained. A name is given, a designation bestowed, and thus the Way of father and son, the ranks of honor and humility, are established. If there were no father, from whence would the child be born? If there were no mother, how would the breath of the womb be fulfilled? Therefore, emptiness circulates and pervades all dwelling within it, and thus we know it as the mother. Without cause, the child would not exist; without the child, how could there be emptiness? If there is a child, then emptiness is the mother of the ten thousand existences.\n\nThus, the Dao gives birth and virtue nurtures, borrowing existence as if a form were present. Without the child, how could the filial Way be made manifest? Without existence, how could emptiness be discerned? Therefore, being and non-being give rise to one another—this is what is meant.\n\nThus, the perfected person constantly cultivates emptiness, honoring it as the mother, and constantly follows the Dao, revering it as the father. Therefore, to honor the Dao and esteem emptiness is to hold in reverence what is greatest. Why? Because our origin lies in father and mother, and so what we revere is greatest. Yet there are beings, regardless of high or low station, who do not know what they should value, who harm their own forms and sever their own roots. Why? It is like a tree—if one hacks away at its roots, not one in ten thousand will survive. If one exposes its roots, it will wither in winter. Those who recklessly lose the Dao are likewise. They are like a tree growing upside-down, like a fish cast from the water—though they live for a time, their lives will not be long.\n\nThus, the perfected person guards the Dao with firmness, attaining long endurance, deepening the roots and strengthening the stem to bring forth blossoms and preserve countenance. Therefore, they do not act in violation, nor do they act in opposition, and thus find peace and joy in this.\n\nYu said: \"I have received this grace. I wish to ask further for clarification. The Dao is most true, taking non-speech as its essence, without body or form, borrowing emptiness and non-being as its foundation. Yet I wonder—those perfected persons who dwell within blessings, what methods do they honor and cultivate? What substance do they expound? From what do they arouse their minds?\"",
      "overlap_context": " answer came: \"All the myriad dharmas arise by receiving the *qi* of the Dao and are completed through emptiness. Why? The Dao is formless, yet responds to *qi* in myriad forms. Emptiness is without division, yet permeates and moves all that has form. Without emptiness and without *qi*, all speech and thought are obliterated. Without speech and without thought, the ten thousand existences vanish. Thus, the Dao is the father of the myriad things, and emptiness is the mother of the myriad things.\"",
      "start_char": 17578,
      "end_char": 17990,
      "start_sentence": 888,
      "end_sentence": 915,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.504880666732788,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "从何生意？ 而致斯位乎？ 愿为分别，令诸来者，悉得闻知。 答曰； 汝之所问，甚要甚妙，谛听，为汝分别。 夫至真无形，修空以得其真，至法无言，顺文以得其道。 恒念於众生苦恼之难，心忧世界，广济一切，终日行之不忧其身，毕身存济不恃身为身，以此念故，运感自然，行之不辞，故致太真之号也。 譬如煮其咸土，但知爨火，周时自变，满釜生灵。 人但行慈悲，乐自归人。 何以故？ 恶想兴则梦行其害，善念发则梦见其祥，是故行毒则祸臻，行善则福至。 故知行不知报而果自成，知种不知收而获自丰，真性之道，亦复如是。 问曰：其心正报之以真应，其心不正报之以邪伪，止由心也，则不须其范。 昨所说时，其师真则弟子正，其师邪则弟子伪。 今日所说，其理差异，愿为分别，令诸不了，悉得受解。 答曰：尔其师明，则无陷滞之患； 其师暗，则为魔曹之所难。 无师岂为道乎？ 无念岂为善乎？ 是故明师行大慈，断奢贪，师徒相询，善友相习。 岂得无师而学上清之道乎？ 故师者父也，若无其父，子从何生？ 若无其师，道从何成？ 是以贵之於明师。 何以故？ 明师者，明闲道法，无有谬误，后人述之，其正相承，邪气不乱，功成德就，遂至於至真无为之道乎！ 是故明暗不同，贤愚殊分，所行各异，受业因趣，何以随师而习，因业取对。 故师徒相仿，朋友相习，此之谓矣。 素变无常，随匠所染，染性尚黑，从工互变。 污着黏牢，刬不可却，胶布相投，挽不可夺。 魔气相染，亦复如是。 何以故？ 譬如紫朱参半，朱必灭色，淄渑经旬，必乱其味。 是故处净者乐於净，恶其秽； 居秽者不尚於华洁，而贵其秽。 类味事殊，道顺事友，邪正之见，亦复如是。 类性等受，取与同器，其名虽一，虚实不等。 是以大丈夫处其厚，不居其薄，故能存为厚； 恒以身居其朴，以俟於明匠，若处其薄者，则终不加其匠。 是故君子识其厚，知其朴，故能居身於其所，不妄染，不妄行，故能处身於其所。 明泯则亡，守之则存。 妄染魔俗，则身必坏，妄行不正，则形必败。 故君子守信以此。 明行若雪，孔德若退，执真若失，逐匠若职，备道若贼，射着若白，功行明雪，则几於道。 不夷、不微、不希，众果三茂，以致於无为。 何以故？ 明行者，自洁清，无秽尘。 孔德者，心存大道，不扰不烦。 执真者，志契道物，守静不移。 逐匠者，驰涉明轨，若务荣禄。 备道者，四固奸寇，恒恐颠怖。 射着者，恐矢不中，心无移易。 六事不辍，几近於无为也。 是以真人行於六事，六德集焉。 故道人取与不同，所持各异。 六断不备，焉为无为； 五色不绝，焉致妙乡。 功缺短袂，无可行人； 勇敢行道，冰汤相消。 何以故？ 飞巢不止，寄无所安。 欲染於道，空无之会。 五色不绝，寄空何所？ 是以真人不栖心於巢，故能成栖，去离五色，故能成真。 君子不行而行，不用而用，不贵而贵，不恃而恃。 是其恃者，三宝以恃之，故道人所行与俗反。 何以故？ 俗人尚於贪，道人贵於廉； 俗人尚於杀，道人贵於长； 俗人尚於淫，道人贵於贞。 所行之行，虽同其行，而用不同，受之不等，故道与俗反，此之谓矣。 治身之与治国，其理同然。 行路之与达处，其数俱尔。",
      "translated_text": "From what does intention arise? How does one attain such a position? I wish for you to distinguish this clearly, that all who come after may hear and know.\n\nThe answer: Your question is most essential and wondrous. Listen carefully, and I shall distinguish it for you. The utmost truth has no form—cultivating emptiness, one attains its reality. The supreme Dharma has no speech—following its patterns, one attains the Dao. Ever mindful of the suffering and affliction of sentient beings, grieving for the world, they broadly save all. Throughout the day, they act without concern for their own bodies; all their lives, they preserve salvation without relying on the self for the self. By this mindfulness, they move and respond naturally. Unwearied in practice, they thus attain the title of *Great Perfected*.\n\nIt is like boiling salty earth—one need only tend the fire, and in time, the whole cauldron will teem with life. People need only practice compassion, and joy will naturally return to them. Why is this? When malicious thoughts arise, one dreams of harm; when virtuous thoughts emerge, one dreams of auspicious signs. Thus, acting with poison brings calamity; acting with goodness brings blessing. Therefore, one knows that acting without thought of reward, the fruit ripens of itself; sowing without thought of harvest, the yield is abundant. The Dao of true nature is likewise.\n\nThe question: If the mind is upright, it is repaid with true response; if the mind is crooked, it is repaid with deceit. It depends solely on the mind—does one not require a model? Earlier, you spoke of this: if the master is true, the disciple is upright; if the master is false, the disciple is deceitful. Yet today, your explanation seems at variance. I wish for you to distinguish this, that all who do not understand may receive clarification.\n\nThe answer: If the master is enlightened, there is no danger of entanglement; if the master is benighted, they fall prey to demonic forces. Without a master, how can one cultivate the Dao? Without mindfulness, how can one practice goodness? Thus, an enlightened master practices great compassion, severs extravagance and greed, and master and disciple inquire together, good companions learning from one another. How could one study the Dao of *Shangqing* without a master? Therefore, the master is like a father—without a father, from where does the child arise? Without a master, from where does the Dao take form? This is why the enlightened master is esteemed.\n\nWhy is this? The enlightened master is clear in the methods of the Dao, without error. Those who follow describe it truly, the upright transmission uncorrupted. Evil influences do not disturb it, merit is accomplished, and virtue is perfected, thus attaining the Dao of utmost truth and non-action. Therefore, the enlightened and the benighted differ, the worthy and the foolish are distinct. Their practices vary, their studies diverge, and their karmic responses follow accordingly. Thus, master and disciple emulate one another, friends learn from one another—this is what is meant.\n\nPlain silk changes without constancy, taking the dye the artisan applies. If the nature is dyed black, it shifts with the craftsman’s art. Once stained and adhered, it cannot be scraped away; once glued and pressed, it cannot be torn apart. The influence of demonic forces is likewise. Why is this? Just as purple and vermilion mixed half-and-half will dull the red, or the waters of the Zī and Mian intermingled for ten days will confuse their taste—thus, those who dwell in purity delight in purity and despise filth, while those who dwell in filth do not esteem refinement but prize their own squalor. Matters of like kind differ in substance; the Dao follows its course, and companionship follows its nature. The perception of right and wrong is likewise.\n\nThings of like nature receive alike, taken and given from the same vessel—though their names may be the same, their emptiness and fullness are not equal. Therefore, the great person dwells in depth, not in shallowness, and thus preserves depth. Ever abiding in simplicity, they await the enlightened artisan. Those who dwell in shallowness will never receive the artisan’s touch. Thus, the noble person recognizes depth and knows simplicity, and so abides in their proper place, neither recklessly staining nor recklessly acting, and thus maintains their station.\n\nClarity extinguished, one perishes; preserving it, one endures. Recklessly stained by demonic customs, the body is surely ruined; recklessly acting without uprightness, the form is surely destroyed. Therefore, the noble person guards trustworthiness in this.\n\nIlluminated conduct is like snow; profound virtue retreats like a valley. Holding to truth is like loss; following the artisan is like duty. Preparing the Dao is like guarding against thieves; hitting the mark is like whiteness. When merit and conduct are as bright as snow, one nears the Dao. Neither leveling nor obscuring nor seeking, the manifold fruits flourish threefold, attaining non-action.\n\nWhy is this? Illuminated conduct is self-purifying, without defilement. Profound virtue is the mind abiding in the great Dao, undisturbed and unburdened. Holding to truth is the will harmonizing with the Dao and things, guarding stillness without wavering. Following the artisan is traversing the bright path, as if pursuing honor and emolument. Preparing the Dao is fortifying against the four quarters’ treacherous foes, ever fearful of downfall. Hitting the mark is fearing the arrow may miss, the mind unwavering. Unceasing in these six matters, one nearly attains non-action.\n\nThus, the perfected person practices these six matters, and the six virtues gather therein. Therefore, the Daoist’s taking and giving differ, their holdings vary. Without the six severances complete, how can one attain non-action? Without cutting off the five colors, how can one reach the wondrous realm? Merit incomplete, the sleeve too short—none may walk the path. Courageously practicing the Dao, ice and boiling water dissolve one another.\n\nWhy is this? A bird’s nest that does not rest has no place of peace. Desiring to be dyed by the Dao, one meets emptiness. Without cutting off the five colors, where can one lodge in emptiness? Thus, the perfected person does not nest the mind in the nest and so can achieve nesting; departing from the five colors, they can achieve truth.\n\nThe noble person does not act yet acts, does not use yet uses, is not esteemed yet is esteemed, does not rely yet relies. What they rely upon are the Three Treasures, and thus the Daoist’s conduct is the opposite of the vulgar. Why is this? The vulgar esteem greed, while the Daoist values frugality; the vulgar esteem killing, while the Daoist values longevity; the vulgar esteem licentiousness, while the Daoist values chastity. Though their actions may appear the same, their purposes differ, and their rewards are not equal. Thus, the Dao and the vulgar are opposites—this is what is meant.\n\nGoverning the self and governing the state follow the same principle. The path of the journey and the destination share the same pattern.",
      "overlap_context": "e. Therefore, they do not act in violation, nor do they act in opposition, and thus find peace and joy in this.\n\nYu said: \"I have received this grace. I wish to ask further for clarification. The Dao is most true, taking non-speech as its essence, without body or form, borrowing emptiness and non-being as its foundation. Yet I wonder—those perfected persons who dwell within blessings, what methods do they honor and cultivate? What substance do they expound? From what do they arouse their minds?\"",
      "start_char": 17990,
      "end_char": 19216,
      "start_sentence": 916,
      "end_sentence": 988,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.543413162231445,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "何以故？ 治身断念则神安，治国去烦则国平。 趣里不达，所规不获。 是以真人观国以治其身，观理以行其道，终日行之，以致於无为。 是故损之以损之，果致於大道。 何以故？ 以恶日损，以善日益。 是以有异念，急弃之，起烦想，即烧之，终不为罗之患，以此。 大国所以灭，良田所以败，以其不善。 故不善者，不善其道也。 何以故？ 若良田废，则梯莠茂。 若大国烦，则民乱，若民乱，则兵革竞起，天下无聊，是故云之。 所以者何？ 民者君之根，君者民之尊，若无其民，则君无所安，是故不得轻民而无根，不得轻君而无尊。 故不可轻，不可贱。 观流逝之不可长保，审徙不停不可宁处。 故智者观之，能行其道，愚者守迷，始终莫悟。 是以真人瞻之行之，故致於无为，广而救，狭而行，终身不亡。 不亡者，其神恒存，不离其形，是以死而不亡，此之谓矣。 迷道不远，魔道不久，自成不达，自明不显。 所以者何？ 若独徒而旅行，迷者必致陷身之患，若自成明而显者，必有滞魔之难。 何以故？ 学不师受，必迷误后学，迷涉万险，必致祸败。 是以真人乘高岗而行，始终不迷，随其明师而学，终始不误。 故道人审而行之。 不明而传者泄，不师而教者滞，病而不疗者，结积必杀。 迷而不变，险路必败。 峻陂而驰，迹多必跌。 刚而强张，木人必折。 粗铤纯器，盘节必缺。 水凿其岸，淹射必穴。 缀缯风冲，妙好必裂。 若木寄林，杂叶必弊。 魔道不废，消膏若雪。 利刃自向，曜锋必割。 拙人持斲，其手必害。 居贫强施，消融必败。 赢窭妄驰，原阳叵达。 沙阜种植，旱苗不活。 颠木枝茂，不斩自折。 筑室为屋，窗牖不立。 建弩射着，弦发不设。 朴枋为器，凿不安穴。 船渡大水，不摇其檝。 欲行常道，不全具诫，亦复如是。 何以故？",
      "translated_text": "Why is this so? In cultivating the self, cutting off thoughts brings tranquility to the spirit; in governing the state, eliminating vexations brings peace to the realm. If one’s aspirations remain unfulfilled, their plans will not succeed. Thus, the Perfected Person observes the state to cultivate the self, examines principles to practice the Way, and acts throughout the day to attain non-action. Therefore, reducing what must be reduced ultimately leads to the Great Dao. Why is this so? By daily diminishing the unwholesome and daily increasing the wholesome, when wayward thoughts arise, cast them aside at once; when vexing notions stir, burn them immediately—thus avoiding the snares of entanglement.\n\nA great state falls because of its unwholesomeness; fertile fields are ruined for the same reason. What is unwholesome is the corruption of the Way. Why is this so? If fertile fields are abandoned, weeds flourish; if a great state is vexed, the people rebel; if the people rebel, arms and armor contend, and the world falls into despair—this is what is meant.\n\nWhy is this so? The people are the root of the ruler, and the ruler is the honor of the people. Without the people, the ruler has no security; thus, one must not treat the people lightly, for they are the root, nor treat the ruler lightly, for he is the honor. Therefore, neither can be slighted or disdained. Observe how flowing waters cannot be long preserved, and shifting things cannot rest in stillness. Thus, the wise observe and practice the Way, while the foolish cling to delusion and never awaken. The Perfected Person gazes upon this and acts accordingly, attaining non-action—expansive in salvation, restrained in conduct, enduring without perishing. Those who do not perish keep their spirit eternally present, never parting from their form; thus, they die yet do not perish—this is what is meant.\n\nThe path of delusion is not distant; the demonic way does not endure. Those who rely on themselves fail to comprehend; those who enlighten themselves fail to manifest. Why is this so? Like a lone traveler on a journey, the lost will surely fall into peril; those who claim enlightenment without guidance will inevitably face demonic obstacles. Why is this so? Those who study without a teacher will mislead later learners; those who wander blindly through myriad dangers will surely meet with disaster. Thus, the Perfected Person ascends the high ridge and walks without losing the way, following an enlightened teacher to learn, never erring from beginning to end. Therefore, the Daoist acts with careful discernment.\n\nTo transmit without clarity is to leak; to teach without a teacher is to obstruct. Illness left untreated will fester and kill. Delusion uncorrected leads to ruin on treacherous paths. Galloping down steep slopes leaves many tracks and surely ends in a fall. A rigid and overbearing tree will snap. A coarse tool in fine craftsmanship will chip the vessel. Water eroding the bank will carve deep hollows. Fine silk torn by the wind will surely split. A tree in a dense forest will suffer from tangled leaves. The demonic way, if not abandoned, melts the marrow like snow. A sharp blade turned inward will cut by its own radiance. A clumsy hand wielding an axe will surely harm itself. The impoverished who force generosity will dissipate and fail. The weak and destitute who recklessly rush will never reach the sunlit plain. Planting in sandy mounds will not sustain drought-stricken seedlings. A toppled tree with flourishing branches will break without being cut. Building a house without windows and doors will not stand. Setting a crossbow without releasing the string will not strike the target. Carving unseasoned wood will not hold its joints. Crossing great waters without rowing the oar will not reach the far shore. To walk the constant Way without complete adherence to its precepts is likewise. Why is this so?",
      "overlap_context": "s this? The vulgar esteem greed, while the Daoist values frugality; the vulgar esteem killing, while the Daoist values longevity; the vulgar esteem licentiousness, while the Daoist values chastity. Though their actions may appear the same, their purposes differ, and their rewards are not equal. Thus, the Dao and the vulgar are opposites—this is what is meant.\n\nGoverning the self and governing the state follow the same principle. The path of the journey and the destination share the same pattern.",
      "start_char": 19216,
      "end_char": 19902,
      "start_sentence": 989,
      "end_sentence": 1036,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.484275341033936,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "真人行先凿户牖，发弩射的，先牢弦结，兴朴造器，先利斧凿，治船渡水，先安橹檝。 具是所须，乘无不克。 真人德行，况斯而获。 道无亲疏，唯善为亲。 真无贵贱，修之则应。 功不妄施，施之必感。 行不休止，趋之必达。 何以故？ 若有亲疏，则有党累之患，若有贵贱，则有豪望之祸，是故不亲不疏，能应之亲疏，不贵不贱，能应之贵贱。 是以真人不尚不贵，而心夷然，不慢卑贱，而采无遗。 明行不漏，弃尘不着。 五好百顾，溢谈不话，谗说不听，美利不贪。 屏除六恶，以纳六通。 宽养广救，以易故乡。 离本就今，以成至真。 三明六达，孔智自然。 位极高上，总统真仙。 慈育母养，平等一切。 广施众生，随色而获。 不可思议，号为虚无无上正真之道。 浮说若夸，寻之不究； 巧言若美，择之无据。 可谓处有说虚，损巧失德，其道即隐，不降其人。 何以故？ 道感有实，不降於虚，是故实者习空之首，得真之元。 是以真人终日言不浮谈，终身行不邪巧，是故德成而不隐，功着而不损，以成於无为。 明教若日#1，其用不厌，其行若舌#2，用之不折。 明行若玉，其行不玷，其性若水，用之不逆。 明说若雪，其用不弊，其言若膏，用之不替。 明诫若日，其用不败，其执若结，用之不泄。 高而不高，卑而不耻，德而不德，纯而不否。 己虚不辍，守道不移，广施大慈，念救不疲。 不自称功，德感自然，众智内融，万善同缘，德积不停。 巍巍如此，九仙超迈，无为至真。 大国贪而不厌，必为祸所患； 寇贼贪而不厌，必为官所难。 恃力凌弱，不知甚，必为健所困； 怙贵押直，不知曲，必为殃所残。 是故治身与治国同。 何以故？ 恃德者隆，恃强者终，守忠者久，依贵者殆，助虐#3者徒，两亡者孤。 是以真人守忠能久，远虚能寿，不亡不孤，唯侣为友，唯同为厚，故去彼取此#4。 胶柱而作乐者，爪尽至节，不成其曲。 驰马而绝控者，至崄必为岸所患。 虽有作乐之音，而无节曲之声； 虽有驰马之奔，而无理趣之所。",
      "translated_text": "The perfected person first carves windows and doors before building a house, fastens the bowstring before loosing the arrow, sharpens the axe and chisel before shaping unhewn wood, secures the oar and rudder before sailing the waters. With all necessities prepared, nothing remains unconquered. The perfected person’s virtue and conduct likewise attain success through such means.\n\nThe Dao makes no distinction of near or far—only goodness is drawn close. The true holds no rank of noble or base—cultivate it, and it responds. Merit is not bestowed in vain—where it is given, resonance follows. Action does not cease—pursue it, and arrival is certain. Why is this so?\n\nIf there were partiality, the peril of factional entanglement would arise. If there were hierarchy, the calamity of arrogance and resentment would follow. Thus, the Dao is neither near nor far, yet responds to all near and far; neither noble nor base, yet answers all noble and base. Therefore, the perfected person neither exalts the high nor scorns the low, yet the mind remains serene. They neither disdain the humble nor overlook the obscure. Their luminous conduct leaves no gaps; they cast off dust without attachment.\n\nThey shun the five desires and hundred distractions, dismissing idle chatter without utterance. They do not heed slanderous speech nor covet fine gains. They banish the six evils to embrace the six penetrations. With boundless nurturance and vast salvation, they transform their former abode. Leaving the root to dwell in the present, they perfect utmost truth. With the three clarities and six attainments, their wisdom arises naturally. Their station reaches the highest, governing all perfected immortals. Like a mother’s nurturing care, they treat all equally. They bestow widely upon beings, reaping according to each one’s nature.\n\nInconceivable, it is called the Empty, Supreme, Utmost True Dao. Empty boasts are like vain bragging—seek them, and they cannot be fathomed. Artful words are like false beauty—examine them, and they lack foundation. This may be termed dwelling in existence while speaking of emptiness, losing virtue through cleverness. Such a path withdraws, descending not upon its practitioner. Why is this so?\n\nThe Dao responds to substance, not to emptiness. Thus, substance is the beginning of practicing emptiness, the origin of attaining truth. Therefore, the perfected person’s words never drift into idle talk, their conduct never strays into deceitful craft. Thus, their virtue is perfected without concealment, their merit shines without diminishment, achieving the state of non-action.\n\nTheir luminous teaching is like the sun—its use is inexhaustible. Their conduct is like the tongue—used without breaking. Their clarity is like jade—its luster remains unstained. Their nature is like water—its flow never reverses. Their enlightened speech is like snow—its use never wears out. Their words are like unguent—applied without ceasing. Their bright precepts are like the sun—never failing in use. Their grasp is like a knot—never loosening.\n\nLofty yet not proud, humble yet not ashamed; virtuous yet not self-satisfied, pure yet not rigid. They empty themselves without pause, hold fast to the Dao without wavering. They bestow great compassion tirelessly, ever mindful of salvation. They do not claim merit for themselves—virtue resonates naturally. All wisdom fuses within; myriad virtues share a single cause. Merit accumulates without end.\n\nSo towering are they that the nine immortals transcend all bounds, attaining the supreme truth of non-action.\n\nA great state insatiably greedy will surely be afflicted by calamity. Bandits insatiably greedy will surely be pursued by officials. Relying on strength to bully the weak, unaware of excess, will surely be trapped by the mighty. Clinging to nobility to oppress the upright, unaware of crookedness, will surely be ruined by misfortune. Thus, governing the self and governing the state are the same.\n\nWhy is this so? Those who rely on virtue flourish; those who rely on strength perish. Those who uphold loyalty endure; those who depend on nobility falter. Those who aid tyranny labor in vain; those who side with the doomed stand alone. Therefore, the perfected person upholds loyalty to endure, distances themselves from falsity to attain longevity. Neither perishing nor isolated, they take companions as kin, kindred spirits as dear. Thus, they abandon that and embrace this.\n\nOne who tunes music with a glued bridge will wear their nails to the quick without completing the melody. One who rides a horse with severed reins will reach perilous heights only to be dashed against the cliffs. Though there may be the sound of music-making, there will be no melody of measured rhythm. Though there may be the gallop of a horse, there will be no destination of reason and principle.",
      "overlap_context": "n. Planting in sandy mounds will not sustain drought-stricken seedlings. A toppled tree with flourishing branches will break without being cut. Building a house without windows and doors will not stand. Setting a crossbow without releasing the string will not strike the target. Carving unseasoned wood will not hold its joints. Crossing great waters without rowing the oar will not reach the far shore. To walk the constant Way without complete adherence to its precepts is likewise. Why is this so?",
      "start_char": 19902,
      "end_char": 20680,
      "start_sentence": 1037,
      "end_sentence": 1082,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.267472743988037,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "执见而修道者，亦复如是。 道广不略，真气圆布，蚑行有生，润及一切。 何以故？ 万物无道则不生，修空无道则不成。 是故知广而不狭，知俭而不宽，处於不足，故能常足。 知於不足，勤而行之，故能常足。 若不足而足，终致不足； 不高而高，终致不高； 不行而行，终致不行； 不解而解，终致不解。 是以真人处於不足，居於不高，以致於无为。 言非则无形，何以故？ 道隐无言，言教弥满； 道隐无形，成形诞应，故不思叵议，而不可测。 〕(以下缺) 太上妙法本相经卷下竟",
      "translated_text": "Those who cling to fixed views in cultivating the Dao are likewise thus. The Dao is vast and not to be abbreviated; true qi circulates in perfect harmony, extending even to the crawling creatures, nourishing all things. Why is this so? Without the Dao, the myriad things cannot come into being; without the Dao, cultivation of emptiness cannot be accomplished. Therefore, one who knows the vast yet does not constrict, who knows frugality yet does not indulge, abides in insufficiency and thus attains enduring sufficiency. Knowing insufficiency, they diligently practice it and thus attain enduring sufficiency. If one deems insufficiency sufficient, it will ultimately remain insufficient; if one deems the unexalted exalted, it will ultimately remain unexalted; if one deems the unpracticed practiced, it will ultimately remain unpracticed; if one deems the unresolved resolved, it will ultimately remain unresolved. Thus, the perfected person abides in insufficiency, dwells in the unexalted, and thereby attains non-action.\n\nWords that are not true leave no form. Why is this so? The Dao is hidden and wordless, yet teachings through words fill all; the Dao is hidden and formless, yet through its formlessness, forms arise and responses manifest. Therefore, it cannot be pondered or debated, nor can it be fathomed.\n\n*(End of* The Supreme Wondrous Dharma’s Original Aspect Sutra, Scroll the Lower *)*",
      "overlap_context": "d, they take companions as kin, kindred spirits as dear. Thus, they abandon that and embrace this.\n\nOne who tunes music with a glued bridge will wear their nails to the quick without completing the melody. One who rides a horse with severed reins will reach perilous heights only to be dashed against the cliffs. Though there may be the sound of music-making, there will be no melody of measured rhythm. Though there may be the gallop of a horse, there will be no destination of reason and principle.",
      "start_char": 20680,
      "end_char": 20896,
      "start_sentence": 1083,
      "end_sentence": 1098,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.95161509513855,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 29,
      "original_text": "#1日：原作「田」，据敦煌P.2396号残卷改。 #2舌：原作「苦」，据敦煌本改。 #3虐：原作「虚」，据敦煌本改。 #4《道藏》本此下缺，据敦煌本补。",
      "translated_text": "The following text is based on emendations: #1 \"Original\" (原作) reads \"field\" (田), corrected according to the Dunhuang manuscript P.2396. #2 \"Tongue\" (舌) originally reads \"bitter\" (苦), corrected according to the Dunhuang manuscript. #3 \"Cruelty\" (虐) originally reads \"emptiness\" (虚), corrected according to the Dunhuang manuscript. #4 The Daozang edition is deficient hereafter; the following is supplemented according to the Dunhuang manuscript.",
      "overlap_context": "n unresolved. Thus, the perfected person abides in insufficiency, dwells in the unexalted, and thereby attains non-action.\n\nWords that are not true leave no form. Why is this so? The Dao is hidden and wordless, yet teachings through words fill all; the Dao is hidden and formless, yet through its formlessness, forms arise and responses manifest. Therefore, it cannot be pondered or debated, nor can it be fathomed.\n\n*(End of* The Supreme Wondrous Dharma’s Original Aspect Sutra, Scroll the Lower *)*",
      "start_char": 20896,
      "end_char": 20980,
      "start_sentence": 1099,
      "end_sentence": 1102,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.7031474113464355,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上妙法本相经.txt",
        "category": "正统道藏太平部"
      }
    }
  ]
}