{
  "source_id": "太上灵宝净明秘法篇",
  "source_file": "chunked_daozang\\太上灵宝净明秘法篇.json",
  "total_chunks": 12,
  "total_original_chars": 6852,
  "total_translated_chars": 36993,
  "total_translation_time": 201.20772790908813,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
    "category": "方法类"
  },
  "full_translation": "**The Supreme Numinous Treasure Pure Brightness Esoteric Methods**\n\n**Scripture Title:** *The Supreme Numinous Treasure Pure Brightness Esoteric Methods*\nAuthor unknown, approximately dating to the Southern Song dynasty. One of the scriptures of the Lingming sect. Two fascicles. Base text from *Zhengtong Daoist Canon*, Dongxuan Section, Methods Category.\n\n---\n\n### *The Supreme Numinous Treasure Pure Brightness Esoteric Methods, Fascicle One*\n\n#### **Daily Incense-Burning and Ritual Practice**\nEach day at the *zi* hour, begin by burning incense. Visualize the Daoist abbey facing west, with the ritual master standing eastward. Strike the teeth thirty-six times, then lower both hands and form the *yin* mudra. Release the mudra, withdraw the hands, and bow once—with each bow, visualize a radiance several *zhang* in diameter illuminating the face. Bow twice more, strike the teeth nine times, and recite the incantation:\n\n*\"Dao fragrance, virtue fragrance,\nThe fragrance of non-action, purity, and spontaneity,\nThe true fragrance of Numinous Treasure Pure Brightness—\nOffered to the Six Sovereigns of the Pure Brightness Numinous Treasure Heavenly Worthies,\nAll Numinous Treasure Lords, Emperor Lords, Heavenly Lords, and Divine Kings.\nMay the methods I practice swiftly fulfill my heart’s intent.\nAbove, repay the kindness of sovereign and parents;\nBelow, relieve the suffering of all beings.\nMay true *qi* ever fill my body,\nAnd all the hundred spirits be commanded and submit.\nSwiftly, swiftly, as decreed by law and command!\"*\n\nUpon completing the recitation, inhale *qi* once and swallow it.\n\n---\n\n#### **Talisman for Liberating the Six Kin**\n**First Talisman:** To be used on the natal days of parents and the six kin. Inscribe with cinnabar, form the *yin* mudra, and visualize oneself as the Bright King of Filial Dao. Recite the incantation once. The talisman may be either swallowed or worn, while visualizing the Two Emperor Lords holding it and proceeding.\n\n**Second Talisman:** To be used on the day of death for parents and the six kin. Inscribe with cinnabar, form the *mao* mudra, and visualize oneself as the Bright King of Filial Dao. Recite the incantation once, then burn the talisman to ash, mix with clay, and apply to the heart. By this method’s power, the deceased will naturally return to life. While mixing the clay, visualize the Two Emperor Lords holding the talisman to guide the departed.\n\nThese two talismans are not limited in number; burn one each day to accumulate merit for the living and the dead. The Two Emperor Lords will hold the talismans to either extend lifespan or deliver the departed—this is the root of filial Dao. Only after achieving merit in this practice may one refine the body’s form.\n\n---\n\n#### **Talisman for Refining the Body’s Form**\nForm the *kan* mudra and inscribe with cinnabar. For the first two talismans, on a *jiazi* day, face east, recite the incantation while forming the mudra, and perform the method once each. Inscribe sixty talismans. Consuming one daily will naturally fill the body with true *qi*, granting immortality and the power to command ghosts and spirits. While inscribing, visualize oneself as the Bright King of Filial Dao and the Numinous Treasure Heavenly Worthy, with the Two Emperor Lords standing to the left and right. Only after achieving merit in this may one proceed to the *Lingshu Sanxing* talisman.\n\n---\n\n#### **Talismans for Healing All Illnesses**\nFor the first two talismans, face north and recite the method once each, maintaining the prior visualization. Roll the talismans into pills, recite the incantation over water, and administer to the afflicted—they will recover. If recovery is not immediate, use the latter two talismans, applying them with focused intent, and the Straight Talisman Emperor Lords will naturally attend. With prolonged practice and many healings, spirits will respond to summons spontaneously.\n\nWhen reciting the method and inscribing talismans, recite once without interruption. If pausing, recite again without limit to the number. When dispatching a talisman, recite once.\n\n---\n\n#### **Talisman for Binding the Hundred Demons**\nFor harm caused by altars or temples, face north to inscribe, recite the incantation five times, and draw a mouthful of true *qi* from each of the five directions. Form the Jade Emperor mudra to inscribe. While inscribing, visualize oneself as the Bright King of Filial Dao and the Pure Brightness Numinous Treasure Heavenly Worthy, with the Two Emperor Lords holding the straight talisman and the Four Saints escorting. Exercise caution in its use; do not employ it recklessly. Once this talisman proves efficacious, over time it need not be sent by a person—the Emperor Lords will wield it and proceed of their own accord.\n\n---\n\n#### **Talisman for Pacifying, Summoning, and Commanding**\nWhen inscribing this talisman, recite the incantation and form the Jade Emperor mudra, drawing a mouthful of *qi* from each of the five directions.\n\n**For summoning rain or snow:** Inscribe in cinnabar on an iron plate five *cun* in length and place it where dragons reside. To strike an object, place it atop for seven days, and it will arrive.\n\nBefore employing the *Lingshu Sanxing* talisman, adhere to this method. Once proficient in the *Sanxing* talisman, knowledge will come spontaneously. When dispatching a talisman, recite the incantation and draw *qi* from the talisman’s original abbey.\n\n---\n\n#### **The Primordial Net Flying Step Dharma Treasure Register**\nOn each *jiazi* day, face east, form the Jade Emperor mudra, and gaze toward the Dipper. Draw a mouthful of *qi* from the Northern Dipper, then another from the eastern direction. With eyes closed, inscribe sixty talismans, recite the incantation seven times, and say:\n\n*\"Controller of authority, remover of death’s register,\nEastern Ultimate, name inscribed for rebirth.\nThe treasure register may be worn or consumed,\nIts use transcends the soul and spirit.\nThe numinous gates of heaven open,\nEyes closed, recite the true method.\nBeyond the body lies my true self—\nThis is the pattern for transcending the mundane.\nSwiftly, swiftly, as decreed by law and command!\"*\n\nConsume one talisman daily with enchanted water; wear the remainder in a blue pouch. On the nights of the Three Primes, Three Assemblies, *gengshen*, and *jiazi*, within a quiet chamber, wear the treasure register inscribed on the *jiazi* day. Form the *mao* mudra with both hands, close the eyes, still the mind, press the tongue to the upper palate, and swallow *qi* once. Perceive a body beyond the body, clad in garments identical to one’s own, standing before you. Ahead lies a star altar, nine *chi* and two *cun* in height, with the sun to the left and moon to the right, the Southern Dipper behind and Northern Dipper before. Flanked by Azure Dragon and White Tiger, fronted and backed by Vermilion Bird and Dark Warrior. Feel a lightness, as if floating, and proceed directly before the altar. Step the *ding* *gang* three times, ascend one tier, and circumambulate the altar to the left, reciting the incantation:\n\n*\"The immortal Dao is vast and boundless,\nThe home of the Primordial Beginning.\nI ascend the altar,\nPurifying the spirit and transforming thoughts.\"*\n\nMay the Most High bestow upon me the streaming rosy clouds.\nThe nectar of streaming rosy clouds,\nDiffuses *qi* with fragrant radiance.\nHaving partaken of it,\nI may tread the *gang* steps.\nThe spirit lords of the five viscera,\nAnd the incense officials of the day’s straight hour,\nHearing my secret incantation,\nAre each at peace.\nSwiftly, swiftly, in accordance with the statutes and ordinances.\n\nUpon reciting the incantation, hold the *qi* and enter the earthly gate.\nProceed leftward once more, and recite the incantation:\n\nSupreme Great Luo,\nGreat Luo of Jade Purity.\nThe true persons of the Jade Purity Palace who transmit the Dharma,\nHearing my secret incantation,\nDeliver my corporeal form.\nTake that jade rosy cloud,\nTo purify my spirit.\nNow I tread the *gang* steps,\nJourneying to the imperial realm,\nTo ascend and pay homage to the Jade Emperor.\nSwiftly, swiftly, in accordance with the statutes and ordinances.\n\nAfter reciting the incantation, hold the *qi* and enter the heavenly gate, reaching the third tier of the altar.\nUpon entering the heavenly gate, as if two immortals, jade lads and jade maidens, incense attendants, and messengers—six in all—appear.\nNext, kneel lengthily with eyes closed, as if a divine being, riding a five-colored cloud and clad in Upper Clarity robes, transmits the Jade Emperor’s talisman, its golden script resplendent, calling forth your name.\nThen, a lad bearing a jade goblet,\nWithin which is the nectar of jade rosy clouds.\nFrom the Northern Dipper, a black *qi*;\nFrom the Southern Dipper, a red *qi*;\nFrom the sun, a crimson *qi*;\nFrom the moon, a white radiance;\nFrom the Three Terraces, a five-colored mixed *qi*—\nEach flows into the cup.\nIf you can receive it, bow twice and drink.\nHold the *qi*, release the mudra, and descend the altar.\nRecite the two sacred texts,\nAscending into the void as if reaching the heavens,\nFlying into the Northern Dipper.\nPass beneath the Three Terraces’ stars,\nTreading from the *Kui* star to the *Piao* return.\nEnter the Dipper in six steps and exit,\nForming the shape of the Three Terraces,\nThen emerge from the Dipper’s mouth.\nCircle leftward seventy times, transgressing fire.\nProceed eastward, passing through □□,\nNinety-nine steps to reach the Great Yang,\nTo pay homage to the ancestral master, the Celestial Emperor.\nThen turn right, entering the Western Dipper from the Northern Dipper,\nSixty-four steps to reach the Great Yin,\nTo pay homage to the ancestral master, the Immortal August Lord.\nTurn right and exit,\nThen proceed rightward, circling left—\nSeven revolutions in all, forming a ring.\nThis is the realm of primordial color.\nFix your gaze, and behold within the formless realm\nAll the immortals coming to welcome you.\nThereupon, traverse the ten directions,\nPaying homage to the thirty-two Celestial Emperors and the twenty-eight constellations.\nUpon seeing each constellation,\nTread the *ding gang* twelve times,\nReturning to life within the Dipper’s lodging,\nBorrowing the *Ji* constellation’s guiding principle to proceed directly.\nGaze back toward the great *Piao* of the Northern Dipper,\nThen circle rightward at the Mountain of Crossing Blades,\nFacing south for forty-nine steps to pass,\nRe-entering the Palace of the Fire Star.\nPassing through the Great Yin,\nAfter thirty-six steps,\nPay homage to the Water Star.\nFrom the water, proceed eastward,\nCounting sixty-four steps,\nThen turn back, transgressing water.\nBorrow the guiding principle to exit the palace,\nPassing beside the Great Yin,\nEighty-one steps to complete the Metal Star.\nProceed delicately to the Dipper’s mouth,\nThirty-five steps to enter the Earthly Branch.\nFrom earth, return,\nRe-entering the lodgings of Metal, Water, and Wood.\nThen gaze directly northward,\nWhere the golden towers stand majestic—\nThe abode of the Three Clarities’ Celestial Emperors.\nAdvance eight steps,\nKneel lengthily and bow twice.\nRecite the incantation:\n\nThis humble earthbound servant, so-and-so,\nBy fortunate karmic affinity from past lives,\nHas encountered a sagely master,\nWho transmitted secret instructions,\nEnabling me to pay homage at the celestial gates.\nConcentrating the spirit and entering stillness,\nThe nine *qi* become limpid and bright,\nThe body beyond the body\nAttains flight into the celestial precincts.\nI, unworthy, gaze upon the heavens and revere the sagely,\nProstrating myself twice in homage.\n\nRecite another incantation:\n\nFortunate to receive the mysterious favor,\nI have encountered a sagely master.\nAt midnight, my spirit takes flight,\nWith wholehearted devotion to pay homage to the Emperor.\nYet this humble servant’s bones are coarse and stubborn,\nDifficult to transcend and ascend.\nWith filial piety and sincerity,\nI hope to receive grace.\nThrough earnest seeking,\nI have gained the imperial regard.\nMay my Dao-heart become steadfast,\nMy spirit-thoughts pure and clear.\nCommanding all spirits,\nTo fulfill the imperial decree.\nI humbly beseech the celestial grace\nTo grant this servant’s petition.\n\nBow twice again in prostration,\nThen exit the gate.\nBehold your original form at the crown of your head.\nRecite the incantation:\n\nSerpent-cicada, serpent-cicada,\nShedding and departing the dust.\nNow I pay homage to the true,\nAscending to meet the azure clouds.\nMay the divine beings\nSeal and enclose my form.\nLift me away,\nBy the secret and efficacious instructions.\n\nSuddenly, it enters through the crown of the head—\nOnly then is the treading of the *gang* complete.\nFor minor practices,\nThree to five steps suffice.\nTo earnestly seek the method of flight and ascension,\nNothing surpasses this.\nNow, the diagrams of the guiding principles for the yellow, white, and black paths\nAre appended below.\n\n**Diagram of the Primordial Guiding Principle for Flying Steps**\n\nHere ends the *Upper Scroll of the Most High Numinous Treasure Pure Brightness Secret Methods*\n*Lower Scroll of the Most High Numinous Treasure Pure Brightness Secret Methods*\n*Upper Scroll of the Numinous Writ*\n\n*Heng ta su qie. Ta* pronounced *ye. Qie* pronounced *jia.*\nThus summoning the four heavenly gates below,\nCalled the Four Illuminating Merit Officers,\nWho oversee the transmission of the numinous writ’s talismans.\nWhenever wishing to summon and command spirits,\nFirst close the eyes, face east, and draw *qi* four times,\nForm the mudra, and inscribe this talisman.\nOnly then may you summon the various spirits\nAnd inscribe the spirit-summoning talisman.\nAll is known.\n\nAll pronounced *ju*. *Zhi* pronounced *zhi*. Summons the Eye-Opening Youth.\n\n*Se ni bo di*. *Ni* pronounced *er*. *Bo* pronounced *bi*. *Di* pronounced *ji*. Summons the Ear-Opening Youth.\n\nWhenever wishing to see the forms of spirits or speak with spirits, first close the eyes, draw one mouthful of red *qi* from the south, then one mouthful of black *qi* from the north. Form the mudra and inscribe these two talismans, then swallow them with fragrant water.\n\n*Pi du bi*. *Pi* pronounced *pi*. *Bi* pronounced *pi*. Summons the Crown-Opening Youth.\n\nWhenever wishing to divide the body and wander freely, draw one mouthful of *qi* from the east, inscribe the talisman, and recite the *Ruan Bo* mudra. After inscribing, hold the breath, leap once with the body, and proceed as desired.\n\n*Suo he luo*. *Suo* pronounced *sha*. *He* pronounced *jia*. Summons the Three Hun.\n\n*Po jia*. Summons the Seven Po.\n\n*Bu lu*. *Lu* pronounced *lu*. Summons the Six Bowels.\n\n*Ji bo na*. Summons the Five Viscera.\n\n*Jie li*. Summons the Nine Orifices.\n\n*Tuo mi di ti*. Summons the Four Limbs.\n\nWhenever wishing to shed the mortal coil, first inscribe these six talismans, draw six mouthfuls of blue-green *qi* from the east, form the mudra, inscribe the six talismans, and swallow them. Then the host of spirits will guard and protect, preventing dissipation.\n\n*Li se*. Summons the Heavenly Officials.\n\n*Jiu nan*. *Nan* pronounced *bi*. Summons the Earthly Officials.\n\n*Xi duo*. Summons the Water Officials.\n\nWhenever wishing to summon and inquire, face the Celestial Asterism, draw three mouthfuls of *qi*, form the mudra, recite the incantation, and inscribe the talisman, then place it upon the altar—they will arrive.\n\n*Pi di nu chao*. *Pi* pronounced *pi*. Summons the Four Beasts.\n\nWhenever deploying spirits to distribute *qi*, extend the hand toward the void, form the mudra, recite the incantation, inscribe the talisman, and blow it to the four sides of the body—they will arrive.\n\n*He di*. Summons the Clouds and Thunder.\n\nWhenever praying for rain, face the *Bi* Star, draw one mouthful of *qi*, form the mudra, recite the incantation, inscribe the talisman, and place it where the dragon resides—they will arrive.\n\n*Ye ju zhe ji*. Summons the host of gods of Heaven and Earth.\n\nWhenever setting up an offering to request a summoning, face the Gate of Heaven, the Door of Earth, and the Ghost Gate, drawing one mouthful of *qi* from each, inscribe the talisman, recite the incantation seven times, and burn it—they will arrive.\n\n*San mu*. Summons the gods of the Yang Realm.\n\n*Bo la*. *Bo* pronounced *duo*. Summons the gods of the Yin Realm.\n\nWhenever performing *zhui jian* or *she zhao*, use these. Form the mudra, recite the incantation, and summon to inquire of their whereabouts.\n\n*Xi ni pi ju*. Summons the divine generals of the Northern Dipper’s methods.\n\nWhenever wishing to summon, face the *zi* position and draw seven mouthfuls of *qi*, form the mudra, recite the incantation, and inscribe the talisman.\n\n*Tu shu xi na*. Summons the divine generals of the Southern Dipper’s methods.\n\nWhenever wishing to summon, face the *wu* position and draw six mouthfuls of *qi*, form the mudra, recite the incantation, and inscribe the talisman.\n\n*Ye du yi tan*. Summons the envoys of the Marshal of Pure Clarity.\n\nWhenever summoning to inquire about major matters, face east, draw three mouthfuls of *qi*, form the mudra, recite the incantation, inscribe the talisman, and grasp it.\n\n*Yang qi luo*. Summons the divine kings and emperors of the *Mo Ming*.\n\nWhenever dispatching envoys, use the eight talismans from the upper scroll as required, then summon. Face east, draw nine mouthfuls of *qi*, form the mudra, recite the incantation, inscribe the talisman, and place it beneath the seat.\n\n*Bi di chi lu*. Summons the envoys, record-keepers, scribes, and judges of Pure Clarity.\n\nWhenever summoning to inquire about matters, they will arrive. Face east, draw one mouthful of *qi*, form the mudra, recite the incantation, and place the talisman beneath the seat.\n\n*Ni li pan li*. Summons the spirit officials of Pure Clarity.\n\nWhenever summoning for salvation or healing, face east, draw one mouthful of *qi*, form the mudra, inscribe the talisman, recite the incantation, and burn it.\n\n*Ye ning*. Summons the Six *Ding*.\n\n*Tu [ ] chan luo*. Summons the Six *Jia*.\n\nWhenever pursuing, capturing, or seeking, summon them. To summon the Six *Ding*, press the right nostril with the left hand, draw one mouthful of *qi*, recite the incantation, and inscribe the talisman. To summon the Six *Jia*, press the left nostril with the right hand, draw one mouthful of *qi*, and recite the incantation while inscribing it. Tear the talisman to shreds, and they will arrive.\n\n*Du lu*. *Ke ji hu*. Summons the Spirit of Absorbing Truth.\n\nWhenever breaking altars, felling temples, requesting rain, or driving away thunder, summon them for protection. Inscribe the talisman on blue paper, form the mudra, recite the incantation, draw one mouthful of the spirit’s *qi*, and wear it.\n\n*Xu shu shan po na*. Summons the Three *Jia*.\n\nWhenever performing secret rites of retribution, use them as agents. Face west, draw one mouthful of *qi* from Venus, form the mudra, recite the incantation, and inscribe the talisman. Tear it, and they will arrive.\n\n*Ta mo*. Summons the Mounted Attendant of Perception, the Celestial Strategist.\n\nWhenever summoning the wardens of earthly or celestial prisons, use them. For binding and interrogation, press the tongue against the upper palate, silently recite the incantation while inscribing the talisman, and place it at the site of confinement to bind the spirits.\n\n*Mo [ ] duo*. Summons the Spirit of Interpretation.\n\nWhenever capturing spirits or demons whose speech is unintelligible, summon to question them. When summoning, hold the breath, visualize the lungs as white, exhale *qi*, and with the hand trace the talisman in the air following the *qi*. Form the mudra and silently recite the divine incantation.\n\n*Wang jia [ ]*. *[ ]* is pronounced *huo*.\n\nSummons the Registrar. The Registrar is the Archival Spirit. Whenever verifying or examining official cases, exhale a breath of *qi*, form the mudra, recite the incantation while inscribing the talisman, and burn it to summon them instantly.\n\n*Ci na*. Summons the Celestial Treasury Spirit. Whenever officials or generals request their salaries, form the Jade Emperor’s mudra while summoning, recite the incantation and inscribe the talisman to summon them at once.\n\n*Ji zhe mo*. Summons the Mobile Kitchen. When desiring to abstain from earthly food, summon them. While summoning, form the mudra, recite the incantation, and inscribe a talisman. Swallow it, and the food of the Celestial Kitchen will be delivered.\n\n*Di shan zhe bo li na*. Summons the Celestial Steed Spirit.\n*□Bu zhi shi duo*. *Jue* is pronounced *qu*; summons the Heavenly Horse Spirit.\n*Na hu an*. *An* is pronounced *an*; summons the Cloud Chariot and Wind Horse. These three talismans enable spirit travel upon summoning. For each, draw a breath of *qi* from the five directions, recite the incantation, form the mudra, and inscribe the talisman. Place it beneath the seat to summon them immediately.\n\n*Lu yong bo*. Summons the Chief Secretarial Officer of the Three Armors. Inscribe the talisman, form the mudra, recite the incantation, and draw a breath of *qi* from the west to inscribe it. Once complete, swallow the talisman. When needed, exhale a breath of *qi*.\n\n*Se xi di*. *Di* is pronounced *ji*; summons the Pure and Luminous Talisman-Bearing Merit Officer of the Three Realms. Use whenever burning documents. While inscribing, draw a breath of *qi* from the east, form the mudra, recite the incantation, and inscribe the talisman. Burn the documents to be dispatched.\n\n*Teng beng qie*. Summons the Mountain-Moving Officer. Use when moving mountains. While inscribing the talisman, draw seven breaths of *qi* from the Northern Dipper, form the mudra, recite the incantation, and inscribe it.\n\n*Fan a bi*. Use when relocating rivers or seas. While inscribing the talisman, hold the breath, recite the incantation seven times, form the mudra, and inscribe it. Cast it into the water, and the currents will shift.\n\n*Ba ye cha*. Summons the Dragon. While summoning, draw nine breaths of *qi* at the hour of *chen*, inscribe the talisman, recite the incantation nine times, and send it to where the dragon resides. Whenever dragons in rivers or seas cause harm, invoke this to restrain them.\n\n*Yu an*. *Yu* is pronounced *she*; summons the Mountain Spirit and local deities. Whenever summoning them for matters, draw three breaths of *qi* from the *gen* direction, inscribe the talisman in the air with the hand, recite the incantation three times, and blow upon it.\n\n*Ye yan*.\n\n*Di zhen mi pan zha*. Summons the Spirit of Gold, Jade, Pearls, and Treasures. Whenever hidden treasures are found, invoke this spirit to guard them. Form the mudra, recite the incantation, and seize it.\n\n*Qi dang mi pan zha*. For matters concerning the Five Peaks, summon the officers of the Five Peaks to employ them. While inscribing the talisman, form the mudra and recite the incantation seven times. To summon the City God, Earth God, *Yinggan*, Local Deities, or *Dian* spirits, use this method. First inscribe the name below, then the talisman. This was once used to summon the Earth God of Nanchang.\n\n*Bi you yan ji*. Summons the Spirit of Bows and Crossbows.\n\n*He ye she ye*. *She* is pronounced *shi*. Summons the Spirit of Sabers and Swords.\n\n*Qian zhi bi*. Summons the Spirit of Spears.\n\n*□ yao wen*. Summons the Spirit of Halberds.\n\n*Wu shi fa luo*. Summons the Spirit of Banners. For dispatching soldiers to various places, executing ghosts and spirits, or secret uses, employ these five talismans. Draw *qi* from the north, form the mudra, recite the incantation, and inscribe them. Once the talismans are complete, burn them with fire, and the soldiers will appear wielding weapons.\n\n*Shu lan*. Summons the Fire Spirit to command burning. Form the mudra with the hand at *yin*, draw seven breaths of *qi* from *wu*, recite the incantation, and inscribe the talisman. Place the talisman into the fire.\n\n*Zhi duo*. Summons the Water Spirit to command flooding. Form the mudra with the hand at *shen*, draw one breath of *qi* from *zi*, recite the incantation, and inscribe the talisman. Place the talisman into the water.\n\n*Di li ci zha*. Summons the Spirit of Medicinal Herbs. Use this to prepare medicine for healing. Form the mudra at *yin*, draw three breaths of *qi* from the east, inscribe the talisman, recite the incantation, and blend it with the medicine.\n\n*Se zhi ye na ye na ye bo*. Summons the Great General of Thunderbolts. To summon the Five Thunders, first invoke this spirit. Form the mudra of the Great Slayer, recite the incantation seven times, inscribe the talisman, and place it where the strike is desired to summon the thunder.\n\n*She ti*. Summons the Spirit of Spears. Invokes Marshal Five, Guo Tian the Great General, to carry out secret methods. Form the mudra of the Great Slayer, recite the incantation seven times, draw *qi* toward the Northern Dipper, inscribe the talisman with the left hand, and blow it into the air.\n\n*Yong sha*. Summons the Officers of Poison and Food.\n\nNīshān'nà. Summons the Five Thunders. *Jūzhītā*. Summons the Lords of the Eight Trigrams. When preparing to establish an altar to receive the Three Realms, first form the mudra with the middle finger while reciting the incantation, then inscribe this and wear it.\n\n*Lúhūwū*. Summons spirits to act and inquires whether the matter is fitting. Extend the hand toward the void and recite: *Ōm*. They will draw near. Used after divination.\n\n*Rèn ōm dǐnàluó dāo dǐ chànà yún fēng jūnà shě sūlū'nà tánjiā qīngnà*. (Pronounce *shě* as *hán*.) Summons the Five Thunders to strike an object. When summoning, curl the five fingers and press them with the thumb. Form the mudra at *yin*, draw five breaths of the five-colored *qi* from *yin*, inscribe upon paulownia wood, and affix it with a needle where the strike is desired.\n\n*Mílú héyē*. Summons the silent, mute thunder of yin. *Qīngmò*. Summons the Messenger Mo Si. *Xūxū bàn*. Summons the Great Spirit of Blazing Fire. All the above are inscribed upon the Five Thunders talisman in overlapping layers. The mudras and methods of use are as before.\n\n*Jūhēyē*. A secret sword method. Form the Golden Blade mudra and point while blowing the talisman. *Xīdá*. Causes the sword to leap from its scabbard.\n\n**Làiqí.** Causes the sword to return. Perform with the hands while reciting the incantation and inscribing the talisman.\n**Mílí.** The sword enters its scabbard. Exhaust the practitioner’s spirit, visualize the talisman’s form, and blow upon the sword to guide it in.\n**Suōhē.** Inscribe this to command ghosts and spirits, then take it away.\n\n**Língshū Xiàpiān**\n**Guǐmí Xiǎngshàn.** (*Guǐ* pronounced as *guī*, *mí* as *mǐ*, *xiǎng* as *hēng*, *shàn* as *zhāo*.)\nSummons the Lord of Solar Essence and Lunar Fluid of the Pure Brightness Abbey, Master of *Qi*-Dissemination.\nWhen summoning, inhale one breath of *qi* from the east and seven breaths from the north. In the void, inscribe the talisman with the right hand’s fingers. Recite the incantation and blow upon the afflicted.\n**Duòjiē.** (*Duò* pronounced as *chǐ*.)\nSummons the Water Spirit of the Pure Brightness Incantation.\nFor self-swallowed water, ingested talismans, or healing, draw nine breaths of *qi* from the east and blow into the water. Then visualize a talisman entering the water directly.\n**Bìyǎoyào.** (*Bì* and *yǎo* as given.)\nSummons the Acupuncture Spirit of the Pure Brightness.\nWhen summoning, take a nine-inch stalk of thatch as the needle and visualize the talisman upon it. Recite the incantation nine times, then needle the painful spot and pierce.\nSummons the Sword Spirit.\nWith the right hand’s middle finger, inscribe a talisman toward the intended direction and blow upon it. Daily, face west, draw one breath of sword-*qi*, and blow it onto the middle finger. This is the *Qi*-Sword of Pure Brightness.\n**Piáoxiāo Chìzhě.** (*Piáo* pronounced as *biāo*.)\nSummons deceased ancestors. Used in ancestral rites and offerings.\n\nWhen inscribing talismans, draw *qi* from the *yin* (3rd Earthly Branch) direction at dawn to animate them.\n\n**Níngbiāo.**\nSummons the *po*-soul of the deceased. Used to rescue those in critical illness, extending their lifespan for rebirth. At the time of use, face east, draw nine breaths of *qi*, inscribe in cinnabar, and have the afflicted ingest it.\n\n**Tújué Lì.**\n(*Tú* as in \"disciple,\" *jué* as in \"cave,\" *lì* as in \"middle finger.\")\nSummons the household spirit.\n\n**Yīngcuì Hāoyīn.**\n(*Kūn* script.)\nSummons the local earth god.\n\n**Níbiàn Huà.**\nSummons the Controller of Destiny. Used in healing illnesses, subduing malevolent spirits, and overseeing life. When inscribing the talisman, hold one breath of *qi* and silently recite the incantation while writing.\n\n**Zǔshān Yāo.**\n(*Shān* pronounced as *sǎn*.)\nDispels curses cast by vengeful ghosts. At the time of use, draw one breath of *qi* from the north, inscribe the talisman while summoning and instructing the spirit, then present the talisman to them.\n\n**Kūchǔn Rú.**\nDispels spirits of those killed by violence. For those who have suffered unjust deaths, use this to release them. At the time of use, draw one breath of *qi* from the north, inscribe the talisman while summoning them, and guide them toward rebirth to prevent them from becoming vengeful spirits.\n\n**Hóngxiā.**\nDispels hanging ghosts. For those who died by hanging and have not yet been reborn, recite the incantation once, form the mudra, inscribe the talisman, and affix it.\n\n**Xiāokuài.**\nFor drowning ghosts, use this talisman to aid their transformation. Recite the incantation once, form the mudra, and inscribe it.\n\n**Yìnquē.**\nDispels illness-causing ghosts. For those suffering from lingering or recurrent afflictions, have the afflicted ingest or wear this talisman. Draw three breaths of *qi* from the east, recite the incantation three times, and inscribe it.\n\n**Lěizuān.**\nDispels poisonous *gu* or flying *gu* toxins. When used, burn the talisman while forming the mudra and reciting the incantation five times.\n\n**Xiànxián.**\nDispels disloyalty.\n\n**Fùyì.**\nDispels flattery and sycophancy.\n\n**Lànjiǎo.**\nDispels greed.\nAll these are grave harms to rulers and the people. When encountered, inscribe the talisman to summon and transform their hearts, so they may reform and become loyal, incorruptible, and upright. In each case, form the mudra, recite the incantation, face the person, inscribe the talisman with the hand, and blow upon it.\n\n**Wǔkǔn Hèyuè.**\nSummons spirits and gods to act. Used in altars and temples to requisition divine soldiers and generals. When inscribing this talisman, press the second joint of the four fingers, recite the incantation five times, and inscribe it.\n\n**Zhuālù Cùlù.**\nDispels unfilial conduct. Such grave offenses against the Great Dao and moral principles warrant execution. Summon the talisman spirit and the sword to execute their spirit at night. This is a method abandoned by royal law; use with utmost caution. When used, face the location, inscribe one talisman, and blow upon it. Press the Jade Emperor’s script, recite the incantation three times.\n\n**Shànchóu.**\nSubdues barbarians. Barbarians, who show no parental kindness or filial piety, encroach upon the Central Kingdom. Use this to bewitch them, so they may submit. When used, face the location in jest, inscribe the talisman, and place it along their path. Draw one breath of true *qi* from the Celestial Stem, recite the incantation, and inscribe it.\n\n**Něishāo Kuìpàn.**\n(*Shāo* pronounced as *shāo*; *zì* pronounced as *tǔ*.)\nRewards the honest and incorruptible. For those who embody these virtues, use the talisman and blow upon them, and fortune will naturally arrive. Inscribe the talisman while forming the mudra, recite the incantation five times, write five talismans, and blow upon them.\n\n**Báomòu Xīndèng Yǎn.**\nSummons drought demons.\n**Gǔliáng Wūdān Yìshū Niǔwān.**\n(*Chǐ* twenty times.)\nWhen inscribing the talisman, form the mudra, recite the incantation ten times, and burn the talisman.\n\n**Qūxié Gēbào.**\nSummons the *Kuígāng*. Used to slay and vanquish demonic forces. Form the mudra, recite the incantation, and inscribe it.\n\n**Fèncuì Tuòxián.**\nDispels harm to others.\n\n**Xuēyī Lìzhū.**\nSuppresses rebellion and coercion. Used for self-protection. Recite the incantation five times, form the mudra, inscribe the talisman, and wear it. May also be used for others.\n\n**Duōdá Hōng.**\n\nTo dispel *wēn* toxins, send away the old woman, and use it accordingly. When using, take seven breaths of northern *qi*, recite the incantation once, inscribe seven talismans, and burn them at the afflicted household. *Wōmìluō suōhē.* (*Wō* pronounced as *yān.*)\n\nSuppresses the hundred spirits. When using, perform divination to determine the tenth *kǎo*, recite the incantation while forming the mudra, and inscribe the talisman to suppress them. *Ǒng hù [□].*\n\nSummons the spirit of closed breath. When practicing *qi*, if speaking of breath-holding, use it accordingly. At the time of use, rub the nose with the hand, recite the incantation while inscribing, and swallow it. *Wěiyǐn mó.*\n\nDispels defilement and impurity. Whenever encountering such things—such as doorways and the like—inscribe this talisman and burn it. While inscribing, visualize the talisman engulfing the body in great flames. Form the *yín* mudra, recite the incantation seven times, then burn it. *Dátā.*\n\nEliminates lustful thoughts. *Dāolì.* Expels lustful demons. If the heart stirs, inscribe *xiàlì* in cinnabar and swallow it to extinguish them. While inscribing, exhale five breaths of *qi*, form the mudra, recite the incantation, and inscribe it.\n\n*Běnxiǎn kuí* ghosts. Dispels corpse worms. *Xīn hē.*\n\nProtects *qi*. If one wishes to refine the body, first inscribe the talisman and swallow it for five days. Recite the incantation seven times, form the *yín* mudra, face east to gather three breaths of *qi*, and blow upon it. *Piāolóng shāonà jǐnjǐn shānà tóngshé jiénà.*\n\nSummons the hundred ghosts of Fengdu. On the sixteenth day of the first month, summon them to admonish and forbid them from harming people. While inscribing, form the mudra at the second joint of the four fingers without pause, then burn the talisman. Once the matter is concluded, use the *suōhē* talisman to send them away.\n\n*Fēnglún huǒchē.* For summoning the guilty ghosts of Fengdu to capture and slay them. When inscribing, recite the incantation seven times, face the Celestial Stem to gather *qi*, and blow upon it. Inscribe the talisman with the hand.\n\n*Dìjū dáhē.* Enters the Heavenly Gate.\n\n*Fēnghuǒ jiāojiā.* Dispels evil within the body.\n\n*Fànyì zhēngxiāo.* Summons the *Tāngāng* Vajra. Used when ascending to the true and entering the Heavenly Gate. When using, first obtain the decree before inscribing to prepare for necessary use.\n\n*Nine beams, transverse owl, bow, vessel, drain, execute, boots, *juǎnjuǎn*, *hē*, cage, *lì*, villain, *hōng*.* After ascending to the true and entering the Heavenly Gate, present this talisman to the *Tāngāng* Vajra. It records the response of the divine officials, lest one enter the Heavenly Pivot unaware of the order.\n\n*Fùzhī zhīnà.* When meeting the recording officials, one must also summon the Rewarding Goodness Judge.\n\n*Dálīnájiā.* Also summons the Punishing Evil Judge.\n\n*Sānmùtuóluó.* Also summons the seventy-four bureau judges of the Heavenly Gate. Once the judges are summoned, present them with the following two talismans.\n\n*Dìlì.* This talisman declares, \"My conduct is virtuous.\"\n\n*Shékāi.* Declares, \"The entire household is good and kind.\"\n\nUpon verification with these two talismans, all judges and recording officials will issue the certificate.\n\n*Yúnmù dìnà.* Summons the matching-talisman officials.\n\n*Veigapodi.* Once the talismans are matched, dispatch them to depart.\n\nHaving received the certificate, use this talisman to summon the officials, match them, and then send them off.\n\n*Yipojaduo.* The bearers of the bestowed elixirs and documents arrive first beneath the Four Heavenly Gates.\n\n*Zhiqiluo.* Summons the Heavenly Kings to assemble the certificate for ascending the hall granted by the Supreme Emperor.\n\n*Zhuapizhinatuo.* Summons the couriers of the Heavenly Writs to present the memorial of gratitude.\n\n*Yidiyidi.* Summons the Left and Right Chancellors of the Three Clarities to inquire about the rites of court audience and gratitude.\n\n*Luoyoudinan.* Summons the Jade Maidens who transmit words for the Three Clarities.\n\n*Heheshapuo.* Summons the chief officials.\n\n*Jilinühe.* Summons the deputy officials.\n\n*Wind Wheel Fire Chariot.* When the bestowed elixir arrives, use this talisman to express gratitude.\n\nFor all these talismans, from the summoning of the recording officials onward, the incantatory seals are not written—one should know them by oneself.\n\nHere ends the *Lower Scroll of the Supreme Numinous Treasure Pure Brightness Esoteric Methods*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上灵宝净明秘法篇 经名：太上灵宝净明秘法篇。 撰人不详，约出於南宋。 系令明派道书之一。 二卷。 底本出处：《正统道藏》洞玄部方法类。 太上灵宝净明秘法篇上 逐日烧香行持法 每日子时起烧香，存道院向西，法师面东立，叩齿三十六通，垂两手掐寅。 放诀收手再拜，一拜存一光，圆数丈，直照面。 又拜二拜，叩齿九通，咒曰： 道香德香，无为清净自然香，灵宝净明真香，供养净明灵宝天尊等六位都法主，一切灵宝君、帝君及天君神王、诸宰主，愿我所行法，速行遂我心。 上报君父母，下救众生苦。 真炁常满体，役使诸百灵，百灵尽皈依。 急急如律令。 念阮毕，吸炁一口吞。 度脱六亲符 前一道，於父母六亲本命之日用。 朱砂书符，掐寅诀，存身为孝道明王。 念咒一徧。 书符，或吞或佩，存二帝君执符而行。 后一道，於父母六亲身死之日用。 朱砂书符，掐卯诀，存身为孝道明王。 念咒一徧，书符烧灰，和泥涂於心上。 即亡者托此法力，自然回生。 和泥时，二帝君执符，以引亡人。 右此二道，不限道数，日烧各一道，以为存亡作福。 即二帝君执符以往，或往益算，或往荐送，即孝道之本也。 行此有功，方能服炼身形。 服炼身形符 掐坎诀，朱书。 掐坎诀，朱书。 前二符，於甲子日面东念咒掐诀，各诵法一徧，书符六十道。 日服之，则自然真炁满足，长生不死，可以役使鬼神。 书符时，存身为孝道明王、灵宝天尊，二帝君立于左右。 行此有功，方可行灵书散形符。 救治百病符 前二符，各面北念法一徧。 依前存想。 丸符咒水，以服病者，则病者即安。 如未安，即用后二道符，各以意使之，则直符帝君自然而往。 行之既久，救治既多，则呼召自至也。 念法书符，只念一徧，不住书之。 每住，则再念，不限道数。 发符时，只念一徧。 束缚百邪符 右，凡有坛庙等为人害者，面北书之，念咒五徧，取五方真炁各一口，掐玉皇诀书之。 书符时，存身为孝道明王、灵宝净明天尊，二帝君直符，四圣卫护以行。 当慎所用，不可妄行。 此符行之既灵，则久而不必使人送於所在，自有帝君执之以往。 安镇呼召符 右书此符时，念咒掐玉皇诀，取五方炁各一口。 凡欲召雨雪用，朱书於铁板上，长五寸，置於有龙处。 或欲击物，则置其上，七日自至此。 未行灵书散符时，须依此。 如散符既熟，则又可自然而知。 凡发符即念咒，取本院符使炁。 元纲飞步法宝箓 每於甲子日，向东，掐玉皇诀望斗，口取北斗炁一口，复取东方炁一口，闭黑书符六十道讫，念咒七徧，咒曰： 司权除杀籍，东极上生名。 宝箓可佩服，用之超魂神。 灵灵天门开，闭目念真法。 身外有吾身，此是超凡格。 急急如律令。 一日服一道，用咒水吞之。 余者，以青袋佩之。 每於三元、三会、庚申、甲子夜，於静室内，佩甲子日所篆宝箓。 以两手掐卯文，闭目静思，以闭炁不动，舌挂上愕，咽炁一口。 觉身外有身，衣服形制，如其本身在前。 前有星坛，高九尺二寸，左日右月，南斗在后，北斗在前，即有左右青龙、白虎，前后朱雀、玄武翼之。 觉飘飘然，直诣坛前，丁罡三步，上坛一级，巡坛左行，念咒曰： 仙道渺莽，元始之家。 我欲升坛，清神变虑。",
      "translated_text": "**The Supreme Numinous Treasure Pure Brightness Esoteric Methods**\n\n**Scripture Title:** *The Supreme Numinous Treasure Pure Brightness Esoteric Methods*\nAuthor unknown, approximately dating to the Southern Song dynasty. One of the scriptures of the Lingming sect. Two fascicles. Base text from *Zhengtong Daoist Canon*, Dongxuan Section, Methods Category.\n\n---\n\n### *The Supreme Numinous Treasure Pure Brightness Esoteric Methods, Fascicle One*\n\n#### **Daily Incense-Burning and Ritual Practice**\nEach day at the *zi* hour, begin by burning incense. Visualize the Daoist abbey facing west, with the ritual master standing eastward. Strike the teeth thirty-six times, then lower both hands and form the *yin* mudra. Release the mudra, withdraw the hands, and bow once—with each bow, visualize a radiance several *zhang* in diameter illuminating the face. Bow twice more, strike the teeth nine times, and recite the incantation:\n\n*\"Dao fragrance, virtue fragrance,\nThe fragrance of non-action, purity, and spontaneity,\nThe true fragrance of Numinous Treasure Pure Brightness—\nOffered to the Six Sovereigns of the Pure Brightness Numinous Treasure Heavenly Worthies,\nAll Numinous Treasure Lords, Emperor Lords, Heavenly Lords, and Divine Kings.\nMay the methods I practice swiftly fulfill my heart’s intent.\nAbove, repay the kindness of sovereign and parents;\nBelow, relieve the suffering of all beings.\nMay true *qi* ever fill my body,\nAnd all the hundred spirits be commanded and submit.\nSwiftly, swiftly, as decreed by law and command!\"*\n\nUpon completing the recitation, inhale *qi* once and swallow it.\n\n---\n\n#### **Talisman for Liberating the Six Kin**\n**First Talisman:** To be used on the natal days of parents and the six kin. Inscribe with cinnabar, form the *yin* mudra, and visualize oneself as the Bright King of Filial Dao. Recite the incantation once. The talisman may be either swallowed or worn, while visualizing the Two Emperor Lords holding it and proceeding.\n\n**Second Talisman:** To be used on the day of death for parents and the six kin. Inscribe with cinnabar, form the *mao* mudra, and visualize oneself as the Bright King of Filial Dao. Recite the incantation once, then burn the talisman to ash, mix with clay, and apply to the heart. By this method’s power, the deceased will naturally return to life. While mixing the clay, visualize the Two Emperor Lords holding the talisman to guide the departed.\n\nThese two talismans are not limited in number; burn one each day to accumulate merit for the living and the dead. The Two Emperor Lords will hold the talismans to either extend lifespan or deliver the departed—this is the root of filial Dao. Only after achieving merit in this practice may one refine the body’s form.\n\n---\n\n#### **Talisman for Refining the Body’s Form**\nForm the *kan* mudra and inscribe with cinnabar. For the first two talismans, on a *jiazi* day, face east, recite the incantation while forming the mudra, and perform the method once each. Inscribe sixty talismans. Consuming one daily will naturally fill the body with true *qi*, granting immortality and the power to command ghosts and spirits. While inscribing, visualize oneself as the Bright King of Filial Dao and the Numinous Treasure Heavenly Worthy, with the Two Emperor Lords standing to the left and right. Only after achieving merit in this may one proceed to the *Lingshu Sanxing* talisman.\n\n---\n\n#### **Talismans for Healing All Illnesses**\nFor the first two talismans, face north and recite the method once each, maintaining the prior visualization. Roll the talismans into pills, recite the incantation over water, and administer to the afflicted—they will recover. If recovery is not immediate, use the latter two talismans, applying them with focused intent, and the Straight Talisman Emperor Lords will naturally attend. With prolonged practice and many healings, spirits will respond to summons spontaneously.\n\nWhen reciting the method and inscribing talismans, recite once without interruption. If pausing, recite again without limit to the number. When dispatching a talisman, recite once.\n\n---\n\n#### **Talisman for Binding the Hundred Demons**\nFor harm caused by altars or temples, face north to inscribe, recite the incantation five times, and draw a mouthful of true *qi* from each of the five directions. Form the Jade Emperor mudra to inscribe. While inscribing, visualize oneself as the Bright King of Filial Dao and the Pure Brightness Numinous Treasure Heavenly Worthy, with the Two Emperor Lords holding the straight talisman and the Four Saints escorting. Exercise caution in its use; do not employ it recklessly. Once this talisman proves efficacious, over time it need not be sent by a person—the Emperor Lords will wield it and proceed of their own accord.\n\n---\n\n#### **Talisman for Pacifying, Summoning, and Commanding**\nWhen inscribing this talisman, recite the incantation and form the Jade Emperor mudra, drawing a mouthful of *qi* from each of the five directions.\n\n**For summoning rain or snow:** Inscribe in cinnabar on an iron plate five *cun* in length and place it where dragons reside. To strike an object, place it atop for seven days, and it will arrive.\n\nBefore employing the *Lingshu Sanxing* talisman, adhere to this method. Once proficient in the *Sanxing* talisman, knowledge will come spontaneously. When dispatching a talisman, recite the incantation and draw *qi* from the talisman’s original abbey.\n\n---\n\n#### **The Primordial Net Flying Step Dharma Treasure Register**\nOn each *jiazi* day, face east, form the Jade Emperor mudra, and gaze toward the Dipper. Draw a mouthful of *qi* from the Northern Dipper, then another from the eastern direction. With eyes closed, inscribe sixty talismans, recite the incantation seven times, and say:\n\n*\"Controller of authority, remover of death’s register,\nEastern Ultimate, name inscribed for rebirth.\nThe treasure register may be worn or consumed,\nIts use transcends the soul and spirit.\nThe numinous gates of heaven open,\nEyes closed, recite the true method.\nBeyond the body lies my true self—\nThis is the pattern for transcending the mundane.\nSwiftly, swiftly, as decreed by law and command!\"*\n\nConsume one talisman daily with enchanted water; wear the remainder in a blue pouch. On the nights of the Three Primes, Three Assemblies, *gengshen*, and *jiazi*, within a quiet chamber, wear the treasure register inscribed on the *jiazi* day. Form the *mao* mudra with both hands, close the eyes, still the mind, press the tongue to the upper palate, and swallow *qi* once. Perceive a body beyond the body, clad in garments identical to one’s own, standing before you. Ahead lies a star altar, nine *chi* and two *cun* in height, with the sun to the left and moon to the right, the Southern Dipper behind and Northern Dipper before. Flanked by Azure Dragon and White Tiger, fronted and backed by Vermilion Bird and Dark Warrior. Feel a lightness, as if floating, and proceed directly before the altar. Step the *ding* *gang* three times, ascend one tier, and circumambulate the altar to the left, reciting the incantation:\n\n*\"The immortal Dao is vast and boundless,\nThe home of the Primordial Beginning.\nI ascend the altar,\nPurifying the spirit and transforming thoughts.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1277,
      "start_sentence": 0,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.82482147216797,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "愿得太上，赐我流霞。 流霞之浆，布炁芬芳。 我得服之，可以步罡。 五脏神君，直日香官。 闻吾秘咒，亦各以安。 急急如律令。 念咒讫，闭炁入地户。 又复左行，念咒曰： 无上大罗，大罗玉清。 玉清之官度法真人。 闻吾秘咒，度我尸形。 取彼玉霞，以净我神。 我今步罡，行之帝乡，上谒玉皇。 急急如律令。 念咒讫，闭炁入天门，即第三重坛。 既入天门，如有仙人二人、玉童、玉女、侍香、传言共六人。 次长跪闭目，若有神人乘五色云，服以上清衣，传玉帝符，金书照耀，呼召子之名。 复有童子一人，执彼瑶爵之中，有玉霞浆。 北斗之中，有一黑炁。 南斗之中，有一赤炁。 日中有红炁，月中有白熙，三台中有五色杂炁，各一道流入杯中。 汝能受之，再拜而饮。 闭炁放诀下坛，念二篇灵书，腾空如到天上，飞入北斗之中。 三台之星，盖顶而行，乃自魁星步，而至魒回。 身入斗六步而出，作三台之形，乃出斗口。 左环七七步，犯火。 又东行，自□□中过，凡九九步至太阳，朝祖师上帝。 复乃右行，自北斗入西斗，八八步至太阴，朝祖师仙皇君。 右旋而出，出即右行，复左，凡七反如环，此元色界也。 定眼，见无色界中，诸仙来迎。 於是周历十方，谒三十二天帝、二十八宿。 见一宿，即丁罡十二，以回生于斗宿，即借箕宿之纲以行直。 还望北斗大魒之次，乃交锋之山右旋，南向四十九步而过，重入火星宫。 经於太阴，六六之后，而谒水星。 由水东行，计六十四步，再回而行，犯水。 借纲复出宫，经於太阴之旁，八十一步，以成金星。 细行达于斗口，三十五步而入土辰。 由土返行，再入金星、水、木之宿。 而后直望北方，金阙巍峨，即三清上帝之所在也。 乃八步而进，长跪再拜。 咒曰： 地行贱臣某甲，幸因宿世，得遇圣师，传度秘诀，使朝天阙。 凝神入静，九炁澄明，身外之身，得飞天阃。 臣无任瞻天仰圣，顿首再拜。 又咒曰： 幸膺玄贶遂遇圣师。 午夜飞神，一心谒帝。 伏为凡骨坚顽，理难超举。 精心孝悌，以冀蒙恩。 果遂精求，得承宸眷。 庶使道心坚固，神思清明。 役使诸神，成遵旨喻。 伏愿天恩，允臣所奏。 又顿首再拜，而出门外，乃见本形就顶门。 咒曰： 蛇蝉蛇蝉，脱克离尘。 吾今朝真，上谒青云。 欲使神人，闭债封形。 举尔以去，秘诀灵灵。 忽自顶门而入，则方乃是步罡了也。 若小可行持，则不过三五步足矣。 欲专意求飞举之法，则莫大於此。 今有行纲黄、白、黑道之图，特具于后。 元纲飞步之图 太上灵宝净明秘法篇上竟 太上灵宝净明秘法篇下 灵书上篇 恒他苏伽。 他音邪。 伽音加。 如此召四天门下，谓之四明功曹，掌行灵书之符。 凡欲告召鬼神指使，必闭目，望东方取炁四口，掐诀，先书此符。 然后，方召诸神，而书召神符。 俱知。",
      "translated_text": "May the Most High bestow upon me the streaming rosy clouds.\nThe nectar of streaming rosy clouds,\nDiffuses *qi* with fragrant radiance.\nHaving partaken of it,\nI may tread the *gang* steps.\nThe spirit lords of the five viscera,\nAnd the incense officials of the day’s straight hour,\nHearing my secret incantation,\nAre each at peace.\nSwiftly, swiftly, in accordance with the statutes and ordinances.\n\nUpon reciting the incantation, hold the *qi* and enter the earthly gate.\nProceed leftward once more, and recite the incantation:\n\nSupreme Great Luo,\nGreat Luo of Jade Purity.\nThe true persons of the Jade Purity Palace who transmit the Dharma,\nHearing my secret incantation,\nDeliver my corporeal form.\nTake that jade rosy cloud,\nTo purify my spirit.\nNow I tread the *gang* steps,\nJourneying to the imperial realm,\nTo ascend and pay homage to the Jade Emperor.\nSwiftly, swiftly, in accordance with the statutes and ordinances.\n\nAfter reciting the incantation, hold the *qi* and enter the heavenly gate, reaching the third tier of the altar.\nUpon entering the heavenly gate, as if two immortals, jade lads and jade maidens, incense attendants, and messengers—six in all—appear.\nNext, kneel lengthily with eyes closed, as if a divine being, riding a five-colored cloud and clad in Upper Clarity robes, transmits the Jade Emperor’s talisman, its golden script resplendent, calling forth your name.\nThen, a lad bearing a jade goblet,\nWithin which is the nectar of jade rosy clouds.\nFrom the Northern Dipper, a black *qi*;\nFrom the Southern Dipper, a red *qi*;\nFrom the sun, a crimson *qi*;\nFrom the moon, a white radiance;\nFrom the Three Terraces, a five-colored mixed *qi*—\nEach flows into the cup.\nIf you can receive it, bow twice and drink.\nHold the *qi*, release the mudra, and descend the altar.\nRecite the two sacred texts,\nAscending into the void as if reaching the heavens,\nFlying into the Northern Dipper.\nPass beneath the Three Terraces’ stars,\nTreading from the *Kui* star to the *Piao* return.\nEnter the Dipper in six steps and exit,\nForming the shape of the Three Terraces,\nThen emerge from the Dipper’s mouth.\nCircle leftward seventy times, transgressing fire.\nProceed eastward, passing through □□,\nNinety-nine steps to reach the Great Yang,\nTo pay homage to the ancestral master, the Celestial Emperor.\nThen turn right, entering the Western Dipper from the Northern Dipper,\nSixty-four steps to reach the Great Yin,\nTo pay homage to the ancestral master, the Immortal August Lord.\nTurn right and exit,\nThen proceed rightward, circling left—\nSeven revolutions in all, forming a ring.\nThis is the realm of primordial color.\nFix your gaze, and behold within the formless realm\nAll the immortals coming to welcome you.\nThereupon, traverse the ten directions,\nPaying homage to the thirty-two Celestial Emperors and the twenty-eight constellations.\nUpon seeing each constellation,\nTread the *ding gang* twelve times,\nReturning to life within the Dipper’s lodging,\nBorrowing the *Ji* constellation’s guiding principle to proceed directly.\nGaze back toward the great *Piao* of the Northern Dipper,\nThen circle rightward at the Mountain of Crossing Blades,\nFacing south for forty-nine steps to pass,\nRe-entering the Palace of the Fire Star.\nPassing through the Great Yin,\nAfter thirty-six steps,\nPay homage to the Water Star.\nFrom the water, proceed eastward,\nCounting sixty-four steps,\nThen turn back, transgressing water.\nBorrow the guiding principle to exit the palace,\nPassing beside the Great Yin,\nEighty-one steps to complete the Metal Star.\nProceed delicately to the Dipper’s mouth,\nThirty-five steps to enter the Earthly Branch.\nFrom earth, return,\nRe-entering the lodgings of Metal, Water, and Wood.\nThen gaze directly northward,\nWhere the golden towers stand majestic—\nThe abode of the Three Clarities’ Celestial Emperors.\nAdvance eight steps,\nKneel lengthily and bow twice.\nRecite the incantation:\n\nThis humble earthbound servant, so-and-so,\nBy fortunate karmic affinity from past lives,\nHas encountered a sagely master,\nWho transmitted secret instructions,\nEnabling me to pay homage at the celestial gates.\nConcentrating the spirit and entering stillness,\nThe nine *qi* become limpid and bright,\nThe body beyond the body\nAttains flight into the celestial precincts.\nI, unworthy, gaze upon the heavens and revere the sagely,\nProstrating myself twice in homage.\n\nRecite another incantation:\n\nFortunate to receive the mysterious favor,\nI have encountered a sagely master.\nAt midnight, my spirit takes flight,\nWith wholehearted devotion to pay homage to the Emperor.\nYet this humble servant’s bones are coarse and stubborn,\nDifficult to transcend and ascend.\nWith filial piety and sincerity,\nI hope to receive grace.\nThrough earnest seeking,\nI have gained the imperial regard.\nMay my Dao-heart become steadfast,\nMy spirit-thoughts pure and clear.\nCommanding all spirits,\nTo fulfill the imperial decree.\nI humbly beseech the celestial grace\nTo grant this servant’s petition.\n\nBow twice again in prostration,\nThen exit the gate.\nBehold your original form at the crown of your head.\nRecite the incantation:\n\nSerpent-cicada, serpent-cicada,\nShedding and departing the dust.\nNow I pay homage to the true,\nAscending to meet the azure clouds.\nMay the divine beings\nSeal and enclose my form.\nLift me away,\nBy the secret and efficacious instructions.\n\nSuddenly, it enters through the crown of the head—\nOnly then is the treading of the *gang* complete.\nFor minor practices,\nThree to five steps suffice.\nTo earnestly seek the method of flight and ascension,\nNothing surpasses this.\nNow, the diagrams of the guiding principles for the yellow, white, and black paths\nAre appended below.\n\n**Diagram of the Primordial Guiding Principle for Flying Steps**\n\nHere ends the *Upper Scroll of the Most High Numinous Treasure Pure Brightness Secret Methods*\n*Lower Scroll of the Most High Numinous Treasure Pure Brightness Secret Methods*\n*Upper Scroll of the Numinous Writ*\n\n*Heng ta su qie. Ta* pronounced *ye. Qie* pronounced *jia.*\nThus summoning the four heavenly gates below,\nCalled the Four Illuminating Merit Officers,\nWho oversee the transmission of the numinous writ’s talismans.\nWhenever wishing to summon and command spirits,\nFirst close the eyes, face east, and draw *qi* four times,\nForm the mudra, and inscribe this talisman.\nOnly then may you summon the various spirits\nAnd inscribe the spirit-summoning talisman.\nAll is known.",
      "overlap_context": "ght, the Southern Dipper behind and Northern Dipper before. Flanked by Azure Dragon and White Tiger, fronted and backed by Vermilion Bird and Dark Warrior. Feel a lightness, as if floating, and proceed directly before the altar. Step the *ding* *gang* three times, ascend one tier, and circumambulate the altar to the left, reciting the incantation:\n\n*\"The immortal Dao is vast and boundless,\nThe home of the Primordial Beginning.\nI ascend the altar,\nPurifying the spirit and transforming thoughts.\"*",
      "start_char": 1277,
      "end_char": 2369,
      "start_sentence": 73,
      "end_sentence": 146,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.126497983932495,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "俱音具。 知音至。 召开目童子也。 瑟泥勃地。 泥音尔。 勃音鼻。 地音计。 召开耳童子也。 凡欲见鬼神形，共鬼神言，必闭目，取南方赤炁一口，又取北方黑炁一口，掐诀，书此二符，用香水吞之。 椟弊。 音皮。 弊音譬。 召开顶童子也。 凡欲分形游行，取东方炁一口，书符念阮箔诀。 书了闭炁，将身一踊，使所往如意。 娑合啰。 娑音莎。 合音甲。 召三魂也。 婆迦。 召七魄也。 哺卢。 卢音庐。 召六腑也。 鸡波那。 召五脏也。 羯璃。 召九窍也。 陀弥底提。 召四肢也。 凡欲脱壳，必先书此符六道，望东取青炁六口，掐诀书符六道，吞之，则众神守护，无散荡也。 离瑟。 召天官也。",
      "translated_text": "All pronounced *ju*. *Zhi* pronounced *zhi*. Summons the Eye-Opening Youth.\n\n*Se ni bo di*. *Ni* pronounced *er*. *Bo* pronounced *bi*. *Di* pronounced *ji*. Summons the Ear-Opening Youth.\n\nWhenever wishing to see the forms of spirits or speak with spirits, first close the eyes, draw one mouthful of red *qi* from the south, then one mouthful of black *qi* from the north. Form the mudra and inscribe these two talismans, then swallow them with fragrant water.\n\n*Pi du bi*. *Pi* pronounced *pi*. *Bi* pronounced *pi*. Summons the Crown-Opening Youth.\n\nWhenever wishing to divide the body and wander freely, draw one mouthful of *qi* from the east, inscribe the talisman, and recite the *Ruan Bo* mudra. After inscribing, hold the breath, leap once with the body, and proceed as desired.\n\n*Suo he luo*. *Suo* pronounced *sha*. *He* pronounced *jia*. Summons the Three Hun.\n\n*Po jia*. Summons the Seven Po.\n\n*Bu lu*. *Lu* pronounced *lu*. Summons the Six Bowels.\n\n*Ji bo na*. Summons the Five Viscera.\n\n*Jie li*. Summons the Nine Orifices.\n\n*Tuo mi di ti*. Summons the Four Limbs.\n\nWhenever wishing to shed the mortal coil, first inscribe these six talismans, draw six mouthfuls of blue-green *qi* from the east, form the mudra, inscribe the six talismans, and swallow them. Then the host of spirits will guard and protect, preventing dissipation.\n\n*Li se*. Summons the Heavenly Officials.",
      "overlap_context": "er Scroll of the Numinous Writ*\n\n*Heng ta su qie. Ta* pronounced *ye. Qie* pronounced *jia.*\nThus summoning the four heavenly gates below,\nCalled the Four Illuminating Merit Officers,\nWho oversee the transmission of the numinous writ’s talismans.\nWhenever wishing to summon and command spirits,\nFirst close the eyes, face east, and draw *qi* four times,\nForm the mudra, and inscribe this talisman.\nOnly then may you summon the various spirits\nAnd inscribe the spirit-summoning talisman.\nAll is known.",
      "start_char": 2369,
      "end_char": 2655,
      "start_sentence": 147,
      "end_sentence": 179,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.845353364944458,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "救赧。 音鼻。 召地官也。 悉多。 召水官也。 凡欲召问，即望天罡取炁三口，掐诀念咒书之，以置案上，即至。 毗地奴抄。 毗音皮。 召四兽也。 凡行神布炁，即以手望空，掐诀念咒书符，以吹於身之四傍，即至也。 诃帝。 召云雷也。 凡祈雨，即望毕星，取炁一口，掐诀念咒书之，置有龙处，即至也。 野举遮击。 召天地众神。 凡设醮请召，望天门、地户、鬼门各取炁一口，书符念咒七徧。 焚之即至。 三慕。 召阳界神也。 般刺。 般音掇。 召阴界神也。 凡有 追荐、摄召用此。 掐诀念咒，召问其所在。 悉泥毗俱。 召北斗诸法神将也。 凡欲召，即子上取炁七口，掐诀念咒书之。 荼输西那。 召南斗诸法神将也。 凡欲召，即午上取炁六口，掐诀念咒书之。 曳都翳昙。 召净明元帅使者也。 如有大事召问之，望东取炁三口，掐诀念咒书符，握之。 扬岐啰。 召摩明诸帝君神王也。 如有差使者，上卷八符合用者，即召之。 望东取炁九口，掐诀念咒书符，置於坐下。 比地叱陆。 召净明使者、典者、誊籍、判官也。 如召之问事，即至。 望束取炁一口，掐诀念咒，置符於坐下。 你哩盘哩。 召净明灵官等也。 如有救治召之。 望东取炁一口，掐诀书符，念咒烧之。 耶儜。 召六丁也。",
      "translated_text": "*Jiu nan*. *Nan* pronounced *bi*. Summons the Earthly Officials.\n\n*Xi duo*. Summons the Water Officials.\n\nWhenever wishing to summon and inquire, face the Celestial Asterism, draw three mouthfuls of *qi*, form the mudra, recite the incantation, and inscribe the talisman, then place it upon the altar—they will arrive.\n\n*Pi di nu chao*. *Pi* pronounced *pi*. Summons the Four Beasts.\n\nWhenever deploying spirits to distribute *qi*, extend the hand toward the void, form the mudra, recite the incantation, inscribe the talisman, and blow it to the four sides of the body—they will arrive.\n\n*He di*. Summons the Clouds and Thunder.\n\nWhenever praying for rain, face the *Bi* Star, draw one mouthful of *qi*, form the mudra, recite the incantation, inscribe the talisman, and place it where the dragon resides—they will arrive.\n\n*Ye ju zhe ji*. Summons the host of gods of Heaven and Earth.\n\nWhenever setting up an offering to request a summoning, face the Gate of Heaven, the Door of Earth, and the Ghost Gate, drawing one mouthful of *qi* from each, inscribe the talisman, recite the incantation seven times, and burn it—they will arrive.\n\n*San mu*. Summons the gods of the Yang Realm.\n\n*Bo la*. *Bo* pronounced *duo*. Summons the gods of the Yin Realm.\n\nWhenever performing *zhui jian* or *she zhao*, use these. Form the mudra, recite the incantation, and summon to inquire of their whereabouts.\n\n*Xi ni pi ju*. Summons the divine generals of the Northern Dipper’s methods.\n\nWhenever wishing to summon, face the *zi* position and draw seven mouthfuls of *qi*, form the mudra, recite the incantation, and inscribe the talisman.\n\n*Tu shu xi na*. Summons the divine generals of the Southern Dipper’s methods.\n\nWhenever wishing to summon, face the *wu* position and draw six mouthfuls of *qi*, form the mudra, recite the incantation, and inscribe the talisman.\n\n*Ye du yi tan*. Summons the envoys of the Marshal of Pure Clarity.\n\nWhenever summoning to inquire about major matters, face east, draw three mouthfuls of *qi*, form the mudra, recite the incantation, inscribe the talisman, and grasp it.\n\n*Yang qi luo*. Summons the divine kings and emperors of the *Mo Ming*.\n\nWhenever dispatching envoys, use the eight talismans from the upper scroll as required, then summon. Face east, draw nine mouthfuls of *qi*, form the mudra, recite the incantation, inscribe the talisman, and place it beneath the seat.\n\n*Bi di chi lu*. Summons the envoys, record-keepers, scribes, and judges of Pure Clarity.\n\nWhenever summoning to inquire about matters, they will arrive. Face east, draw one mouthful of *qi*, form the mudra, recite the incantation, and place the talisman beneath the seat.\n\n*Ni li pan li*. Summons the spirit officials of Pure Clarity.\n\nWhenever summoning for salvation or healing, face east, draw one mouthful of *qi*, form the mudra, inscribe the talisman, recite the incantation, and burn it.\n\n*Ye ning*. Summons the Six *Ding*.",
      "overlap_context": "ons the Seven Po.\n\n*Bu lu*. *Lu* pronounced *lu*. Summons the Six Bowels.\n\n*Ji bo na*. Summons the Five Viscera.\n\n*Jie li*. Summons the Nine Orifices.\n\n*Tuo mi di ti*. Summons the Four Limbs.\n\nWhenever wishing to shed the mortal coil, first inscribe these six talismans, draw six mouthfuls of blue-green *qi* from the east, form the mudra, inscribe the six talismans, and swallow them. Then the host of spirits will guard and protect, preventing dissipation.\n\n*Li se*. Summons the Heavenly Officials.",
      "start_char": 2656,
      "end_char": 3168,
      "start_sentence": 180,
      "end_sentence": 227,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.301538944244385,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "菟□忏啰。 召六甲也。 如有追捉寻觅，召之。 召六丁，则以左手按鼻右孔，吸炁一口，念咒书符。 召六甲，则以右手按鼻左孔，吸炁一口，念咒书之。 以符褫碎，即至。 都嚧。 嗑即胡。 召纳真神也。 凡破坛，伐庙，请雨，驱雷，即召之，使护卫。 用青纸书符，掐诀念咒，取其神炁一口，佩之。 虚庶赡婆那。 召三甲也。 凡行报应秘法，用以使之。 望西取太白炁一口，掐诀念咒耆符，以褫之，即至也。 它么。 召通耳目骑吏，乃天策神也。 凡摄召地狱、天狱主，用之。 如禁勘，即以舌挂上聘，默念咒书之，置於结狱处，即禁鬼。 么多。 召译语神也。 凡欲摄到精怪，言语不通，即召问之。 召时闭炁，存见肺白吐炁，以手望空，随炁书之，掐诀默念神咒。 罔迦。 音祸。",
      "translated_text": "*Tu [ ] chan luo*. Summons the Six *Jia*.\n\nWhenever pursuing, capturing, or seeking, summon them. To summon the Six *Ding*, press the right nostril with the left hand, draw one mouthful of *qi*, recite the incantation, and inscribe the talisman. To summon the Six *Jia*, press the left nostril with the right hand, draw one mouthful of *qi*, and recite the incantation while inscribing it. Tear the talisman to shreds, and they will arrive.\n\n*Du lu*. *Ke ji hu*. Summons the Spirit of Absorbing Truth.\n\nWhenever breaking altars, felling temples, requesting rain, or driving away thunder, summon them for protection. Inscribe the talisman on blue paper, form the mudra, recite the incantation, draw one mouthful of the spirit’s *qi*, and wear it.\n\n*Xu shu shan po na*. Summons the Three *Jia*.\n\nWhenever performing secret rites of retribution, use them as agents. Face west, draw one mouthful of *qi* from Venus, form the mudra, recite the incantation, and inscribe the talisman. Tear it, and they will arrive.\n\n*Ta mo*. Summons the Mounted Attendant of Perception, the Celestial Strategist.\n\nWhenever summoning the wardens of earthly or celestial prisons, use them. For binding and interrogation, press the tongue against the upper palate, silently recite the incantation while inscribing the talisman, and place it at the site of confinement to bind the spirits.\n\n*Mo [ ] duo*. Summons the Spirit of Interpretation.\n\nWhenever capturing spirits or demons whose speech is unintelligible, summon to question them. When summoning, hold the breath, visualize the lungs as white, exhale *qi*, and with the hand trace the talisman in the air following the *qi*. Form the mudra and silently recite the divine incantation.\n\n*Wang jia [ ]*. *[ ]* is pronounced *huo*.",
      "overlap_context": "voys, record-keepers, scribes, and judges of Pure Clarity.\n\nWhenever summoning to inquire about matters, they will arrive. Face east, draw one mouthful of *qi*, form the mudra, recite the incantation, and place the talisman beneath the seat.\n\n*Ni li pan li*. Summons the spirit officials of Pure Clarity.\n\nWhenever summoning for salvation or healing, face east, draw one mouthful of *qi*, form the mudra, inscribe the talisman, recite the incantation, and burn it.\n\n*Ye ning*. Summons the Six *Ding*.",
      "start_char": 3169,
      "end_char": 3485,
      "start_sentence": 228,
      "end_sentence": 252,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.259185791015625,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "召主簿也。 主簿，架阁神。 如有公案理会照证，吐炁一口，掐诀念咒书之，烧化即至。 刺那。 召天库神也。 凡为官将请俸给，即召之时，掐玉皇诀，念咒书符，即至。 击遮摩。 召行厨也。 如欲绝火食，即召之。 召时，掐诀念咒，书符一道。 吞之，即送天厨食也。 地扇遮波利那。 召天骥神也。 □补稚视多。 崛音屈，召天马神也。 拏虎。 音庵。 召云车、风马也。 此三符出神而有往，既召之。 召之，皆取五方炁一口，念咒掐诀书之。 以符置坐下，即至。 嚧雍波。 召三甲都总吏秘，即使之。 书符，掐诀念咒，望西取炁一口，书之。 符成吞之。 却於用时，吹炁一口。 瑟悉地。 地音计。 召净明执符三界功曹。 凡烧文字，即用。 书时，望东取炁一口，掐诀念咒书符。 所发文字，烧之。 腾崩伽。 召移山吏。 凡移山，用之。 书符时，望北斗取炁七口，掐诀念咒书之。 梵阿弊。 凡移江海，用之。 书符时，闭炁，念咒七徧，掐诀书之。 以投水中，即易流也。 跋夜茶。 召龙也。 召时，辰上取炁九口，书之。 念咒九徧，送有龙处。 凡江海龙为害，即呼以戒之。 余暗。 余音蛇。 召山神、凡神。 凡有事召之，即艮上取炁三口，虚空以手书符，念咒三徧。 吹之。 夜檐。",
      "translated_text": "Summons the Registrar. The Registrar is the Archival Spirit. Whenever verifying or examining official cases, exhale a breath of *qi*, form the mudra, recite the incantation while inscribing the talisman, and burn it to summon them instantly.\n\n*Ci na*. Summons the Celestial Treasury Spirit. Whenever officials or generals request their salaries, form the Jade Emperor’s mudra while summoning, recite the incantation and inscribe the talisman to summon them at once.\n\n*Ji zhe mo*. Summons the Mobile Kitchen. When desiring to abstain from earthly food, summon them. While summoning, form the mudra, recite the incantation, and inscribe a talisman. Swallow it, and the food of the Celestial Kitchen will be delivered.\n\n*Di shan zhe bo li na*. Summons the Celestial Steed Spirit.\n*□Bu zhi shi duo*. *Jue* is pronounced *qu*; summons the Heavenly Horse Spirit.\n*Na hu an*. *An* is pronounced *an*; summons the Cloud Chariot and Wind Horse. These three talismans enable spirit travel upon summoning. For each, draw a breath of *qi* from the five directions, recite the incantation, form the mudra, and inscribe the talisman. Place it beneath the seat to summon them immediately.\n\n*Lu yong bo*. Summons the Chief Secretarial Officer of the Three Armors. Inscribe the talisman, form the mudra, recite the incantation, and draw a breath of *qi* from the west to inscribe it. Once complete, swallow the talisman. When needed, exhale a breath of *qi*.\n\n*Se xi di*. *Di* is pronounced *ji*; summons the Pure and Luminous Talisman-Bearing Merit Officer of the Three Realms. Use whenever burning documents. While inscribing, draw a breath of *qi* from the east, form the mudra, recite the incantation, and inscribe the talisman. Burn the documents to be dispatched.\n\n*Teng beng qie*. Summons the Mountain-Moving Officer. Use when moving mountains. While inscribing the talisman, draw seven breaths of *qi* from the Northern Dipper, form the mudra, recite the incantation, and inscribe it.\n\n*Fan a bi*. Use when relocating rivers or seas. While inscribing the talisman, hold the breath, recite the incantation seven times, form the mudra, and inscribe it. Cast it into the water, and the currents will shift.\n\n*Ba ye cha*. Summons the Dragon. While summoning, draw nine breaths of *qi* at the hour of *chen*, inscribe the talisman, recite the incantation nine times, and send it to where the dragon resides. Whenever dragons in rivers or seas cause harm, invoke this to restrain them.\n\n*Yu an*. *Yu* is pronounced *she*; summons the Mountain Spirit and local deities. Whenever summoning them for matters, draw three breaths of *qi* from the *gen* direction, inscribe the talisman in the air with the hand, recite the incantation three times, and blow upon it.\n\n*Ye yan*.",
      "overlap_context": "e incantation while inscribing the talisman, and place it at the site of confinement to bind the spirits.\n\n*Mo [ ] duo*. Summons the Spirit of Interpretation.\n\nWhenever capturing spirits or demons whose speech is unintelligible, summon to question them. When summoning, hold the breath, visualize the lungs as white, exhale *qi*, and with the hand trace the talisman in the air following the *qi*. Form the mudra and silently recite the divine incantation.\n\n*Wang jia [ ]*. *[ ]* is pronounced *huo*.",
      "start_char": 3485,
      "end_char": 3986,
      "start_sentence": 253,
      "end_sentence": 303,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.014266967773438,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "召金玉珠宝神也。 凡见有伏藏，即召之，使守也。 掐诀念咒，以捉之。 讫缍弥泮咤。 凡有事系五岳，召五岳吏使之。 书符时，掐诀，念咒七徧。 如召城隍、社令神、应干、土地、典者，皆用此。 於其下，先书名，次以书符。 召者，昔尝召南昌社公用之也。 弊又演吉。 召弓弩神也。 合曳舍曳。 舍音式。 召刀剑神也。 乾质闭。 召戈神也。 □药文。 召戟神也。 乌什伐啰。 召旗神也。 凡有差使诸处兵将，诛斩鬼神，及秘用此五符，各於北方取炁，掐诀念咒书之。 符成，以火烧之，即兵将皆手执兵器也。 输蓝。 召火神也，召使梵烧。 以手掐寅，於午上取炁七口，念咒书之。 以符置火中。 质多。 召水神也，召使灌浸。 以手掐申，於子上取炁一口，念咒书之。 以符置水中。 地栗刺咤。 召药神也。 以此用药救治。 掐寅，东方取炁三口，书符念咒，和药用也。 瑟质夜那夜那夜波。 召霹雳大将。 凡欲召五雷，必先召之。 以手掐大煞文，念咒七徧，书以置於所击处，以招雷也。 舍提。 召枪神也。 召灵官五郎、郭天大将，使以行秘法也。 掐大煞文，念咒七徧，望北斗取炁，以左手书符，望空吹之。 雍莎。 召食毒等吏。",
      "translated_text": "*Di zhen mi pan zha*. Summons the Spirit of Gold, Jade, Pearls, and Treasures. Whenever hidden treasures are found, invoke this spirit to guard them. Form the mudra, recite the incantation, and seize it.\n\n*Qi dang mi pan zha*. For matters concerning the Five Peaks, summon the officers of the Five Peaks to employ them. While inscribing the talisman, form the mudra and recite the incantation seven times. To summon the City God, Earth God, *Yinggan*, Local Deities, or *Dian* spirits, use this method. First inscribe the name below, then the talisman. This was once used to summon the Earth God of Nanchang.\n\n*Bi you yan ji*. Summons the Spirit of Bows and Crossbows.\n\n*He ye she ye*. *She* is pronounced *shi*. Summons the Spirit of Sabers and Swords.\n\n*Qian zhi bi*. Summons the Spirit of Spears.\n\n*□ yao wen*. Summons the Spirit of Halberds.\n\n*Wu shi fa luo*. Summons the Spirit of Banners. For dispatching soldiers to various places, executing ghosts and spirits, or secret uses, employ these five talismans. Draw *qi* from the north, form the mudra, recite the incantation, and inscribe them. Once the talismans are complete, burn them with fire, and the soldiers will appear wielding weapons.\n\n*Shu lan*. Summons the Fire Spirit to command burning. Form the mudra with the hand at *yin*, draw seven breaths of *qi* from *wu*, recite the incantation, and inscribe the talisman. Place the talisman into the fire.\n\n*Zhi duo*. Summons the Water Spirit to command flooding. Form the mudra with the hand at *shen*, draw one breath of *qi* from *zi*, recite the incantation, and inscribe the talisman. Place the talisman into the water.\n\n*Di li ci zha*. Summons the Spirit of Medicinal Herbs. Use this to prepare medicine for healing. Form the mudra at *yin*, draw three breaths of *qi* from the east, inscribe the talisman, recite the incantation, and blend it with the medicine.\n\n*Se zhi ye na ye na ye bo*. Summons the Great General of Thunderbolts. To summon the Five Thunders, first invoke this spirit. Form the mudra of the Great Slayer, recite the incantation seven times, inscribe the talisman, and place it where the strike is desired to summon the thunder.\n\n*She ti*. Summons the Spirit of Spears. Invokes Marshal Five, Guo Tian the Great General, to carry out secret methods. Form the mudra of the Great Slayer, recite the incantation seven times, draw *qi* toward the Northern Dipper, inscribe the talisman with the left hand, and blow it into the air.\n\n*Yong sha*. Summons the Officers of Poison and Food.",
      "overlap_context": "breaths of *qi* at the hour of *chen*, inscribe the talisman, recite the incantation nine times, and send it to where the dragon resides. Whenever dragons in rivers or seas cause harm, invoke this to restrain them.\n\n*Yu an*. *Yu* is pronounced *she*; summons the Mountain Spirit and local deities. Whenever summoning them for matters, draw three breaths of *qi* from the *gen* direction, inscribe the talisman in the air with the hand, recite the incantation three times, and blow upon it.\n\n*Ye yan*.",
      "start_char": 3986,
      "end_char": 4468,
      "start_sentence": 304,
      "end_sentence": 347,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.69976544380188,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "尼钐那。 召五雷也。 俱只他。 召八卦神君也。 凡欲结坛奉迎三界，先以手掐中指念咒，书此佩之。 嚧呼呜。 召神行事，问其事之当否。 以手向空，念云：唵。 即近。 於问事之后用也。 刃唵底那罗刀底剎那云风居那舍苏噜那昙迦青那。 舍音含。 召五雷，使击物也。 凡召时，屈五指，以大指押之。 掐寅，取寅上五色炁五口，书於桐木上，针钉於所击处也。 弥嚧合耶。 召阴哑无声之雷也。 青莫。 召莫俟使。 嘘伴。 召钦火大神。 已上皆书於五雷符上，迭书之。 诀节使用如前也。 居诃耶。 用剑秘法也。 掐金刀诀，指以吹符也。 悉怛。 又使剑自匣中跃也。",
      "translated_text": "Nīshān'nà. Summons the Five Thunders. *Jūzhītā*. Summons the Lords of the Eight Trigrams. When preparing to establish an altar to receive the Three Realms, first form the mudra with the middle finger while reciting the incantation, then inscribe this and wear it.\n\n*Lúhūwū*. Summons spirits to act and inquires whether the matter is fitting. Extend the hand toward the void and recite: *Ōm*. They will draw near. Used after divination.\n\n*Rèn ōm dǐnàluó dāo dǐ chànà yún fēng jūnà shě sūlū'nà tánjiā qīngnà*. (Pronounce *shě* as *hán*.) Summons the Five Thunders to strike an object. When summoning, curl the five fingers and press them with the thumb. Form the mudra at *yin*, draw five breaths of the five-colored *qi* from *yin*, inscribe upon paulownia wood, and affix it with a needle where the strike is desired.\n\n*Mílú héyē*. Summons the silent, mute thunder of yin. *Qīngmò*. Summons the Messenger Mo Si. *Xūxū bàn*. Summons the Great Spirit of Blazing Fire. All the above are inscribed upon the Five Thunders talisman in overlapping layers. The mudras and methods of use are as before.\n\n*Jūhēyē*. A secret sword method. Form the Golden Blade mudra and point while blowing the talisman. *Xīdá*. Causes the sword to leap from its scabbard.",
      "overlap_context": "udra of the Great Slayer, recite the incantation seven times, inscribe the talisman, and place it where the strike is desired to summon the thunder.\n\n*She ti*. Summons the Spirit of Spears. Invokes Marshal Five, Guo Tian the Great General, to carry out secret methods. Form the mudra of the Great Slayer, recite the incantation seven times, draw *qi* toward the Northern Dipper, inscribe the talisman with the left hand, and blow it into the air.\n\n*Yong sha*. Summons the Officers of Poison and Food.",
      "start_char": 4469,
      "end_char": 4743,
      "start_sentence": 348,
      "end_sentence": 375,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.27935528755188,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "赖耆。 使剑归也。 皆以手，念咒书之。 弥璃。 剑入匣也。 使人劳其神，想符形，吹剑入也。 娑诃。 书此，以与鬼神，执以去也。 灵书下篇 轨糜享钐。 轨音归。 糜音米。 享音亨。 钐音钊。 召浄明院布炁日精月液帝君。 召时，吸东方炁一口，北方炁七口，虚空中，以右手指书符。 念咒吹病人。 跢揭。 跢音齿。 召浄明咒水神。 凡吮水自服、吞符，及治病，皆取东方炁九口，吹水中。 次以心想符一道，直入水中。 毖。 召浄明行针神。 召时，取茅九寸为针，心想其符在上。 念咒九徧。 针痛处。 刺。 召剑神。 以右手中旨，望所用方书符一道，吹之。 又每日望西，取剑炁一口，望中旨上吹之。 此浄明炁剑也。 瓢□叱赭。 瓢音标。 召亡过祖先。 凡追荐用之。",
      "translated_text": "**Làiqí.** Causes the sword to return. Perform with the hands while reciting the incantation and inscribing the talisman.\n**Mílí.** The sword enters its scabbard. Exhaust the practitioner’s spirit, visualize the talisman’s form, and blow upon the sword to guide it in.\n**Suōhē.** Inscribe this to command ghosts and spirits, then take it away.\n\n**Língshū Xiàpiān**\n**Guǐmí Xiǎngshàn.** (*Guǐ* pronounced as *guī*, *mí* as *mǐ*, *xiǎng* as *hēng*, *shàn* as *zhāo*.)\nSummons the Lord of Solar Essence and Lunar Fluid of the Pure Brightness Abbey, Master of *Qi*-Dissemination.\nWhen summoning, inhale one breath of *qi* from the east and seven breaths from the north. In the void, inscribe the talisman with the right hand’s fingers. Recite the incantation and blow upon the afflicted.\n**Duòjiē.** (*Duò* pronounced as *chǐ*.)\nSummons the Water Spirit of the Pure Brightness Incantation.\nFor self-swallowed water, ingested talismans, or healing, draw nine breaths of *qi* from the east and blow into the water. Then visualize a talisman entering the water directly.\n**Bìyǎoyào.** (*Bì* and *yǎo* as given.)\nSummons the Acupuncture Spirit of the Pure Brightness.\nWhen summoning, take a nine-inch stalk of thatch as the needle and visualize the talisman upon it. Recite the incantation nine times, then needle the painful spot and pierce.\nSummons the Sword Spirit.\nWith the right hand’s middle finger, inscribe a talisman toward the intended direction and blow upon it. Daily, face west, draw one breath of sword-*qi*, and blow it onto the middle finger. This is the *Qi*-Sword of Pure Brightness.\n**Piáoxiāo Chìzhě.** (*Piáo* pronounced as *biāo*.)\nSummons deceased ancestors. Used in ancestral rites and offerings.",
      "overlap_context": " paulownia wood, and affix it with a needle where the strike is desired.\n\n*Mílú héyē*. Summons the silent, mute thunder of yin. *Qīngmò*. Summons the Messenger Mo Si. *Xūxū bàn*. Summons the Great Spirit of Blazing Fire. All the above are inscribed upon the Five Thunders talisman in overlapping layers. The mudras and methods of use are as before.\n\n*Jūhēyē*. A secret sword method. Form the Golden Blade mudra and point while blowing the talisman. *Xīdá*. Causes the sword to leap from its scabbard.",
      "start_char": 4744,
      "end_char": 5057,
      "start_sentence": 376,
      "end_sentence": 411,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.85768723487854,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "书符时，寅上取生炁昼之。 儜标。 召死魄也。 凡救危病用之，可以展限再生。 用时，东方，取炁九口，朱书，与之吞。 菟掘。 上徒中窟下唵中旨中。 召宅神也。 婴粹蒿堙。 坤文。 召土地也。 呢辫桦。 召司命也. 凡救疾病、摧鬼监生用之。 书符时，闭炁一口，默念咒书之。 诅縿夭。 碜音糁。 凡为人解咒鬼也。 用时，取北方炁一口，书符召之训教，以符与之。 刳蠢蠕。 解杀伤鬼也。 凡有人曾杀伤被冤魂，以此解之。 用时，取北方炁一口，书符召之，使之托生，不得为冤对也。 虾。 为人解缢鬼也。 凡有缢鬼未经托生者，念一徧，掐诀书符，贴之。 枭块。 凡有溺鬼处，以此符与之托化。 念咒一徧，掐诀书之。 胤缺。 解病鬼。 凡有复连蛊疰者用之，以此符与疾者吞带。 取东方炁三口，念咒三徧书之。 累钻。 解药蛊毒，或有飞蛊毒害人处，以此解之。 用时，以符烧，并掐诀念咒五徧。 陷涎。 去不忠也。 复毅。 去谀谄也。 滥搅。 去贪也。 凡此者，皆君民之大害也。 遇此，书符召以变其心，则皆改过，为忠廉正直之士。 皆掐诀念咒，望其人，以手书符，吹之。 忤捆鹤钺。 召鬼神行事也。 凡所在坛庙，抽借兵将用之。 如篆此符，则掐四指第二节，念咒五徧书之。 挝戮蹙摝。 去不孝也。 此等正害於大法，情理重者，以此诛之，召符神并剑，夜戮其神。 此王法之所弃也，宜慎用之，无侯。 用时，望其所在，书符一道，吹之。 掐玉皇文，念咒三徧。 扇愁。 攻蛮夷也。 蛮夷，父不慈，子不孝，侵于中国。 以此魇之，当效顺也。 用时，以戏望其所在书之，置其所经之路。 用时，望天罡取正炁一口，念咒书之。 馁捎溃判。 稍音稍。 剚音土。 赏公廉也。 凡有此者，用符吹之即其人自然福至。 书符掐诀，念咒五徧，书五道，吹。 魃愗心磴魇。 呼旱鬼也。 蛊俍诬殚熠枢纽湾缀秉岐妓霰。 褫之二十。 书符时掐诀，念咒十徧，以符烧之。 驱邪割暴。 召魁罡也。 凡斩伐邪魔，掐诀念咒书之。 忿毳涎。 解人害也。 靴揖詈诛。 厌横逆也。 凡自护身，即用之。 念咒五徧。 掐诀书符，佩之。 或为人，亦用此。 咄怛吽。",
      "translated_text": "When inscribing talismans, draw *qi* from the *yin* (3rd Earthly Branch) direction at dawn to animate them.\n\n**Níngbiāo.**\nSummons the *po*-soul of the deceased. Used to rescue those in critical illness, extending their lifespan for rebirth. At the time of use, face east, draw nine breaths of *qi*, inscribe in cinnabar, and have the afflicted ingest it.\n\n**Tújué Lì.**\n(*Tú* as in \"disciple,\" *jué* as in \"cave,\" *lì* as in \"middle finger.\")\nSummons the household spirit.\n\n**Yīngcuì Hāoyīn.**\n(*Kūn* script.)\nSummons the local earth god.\n\n**Níbiàn Huà.**\nSummons the Controller of Destiny. Used in healing illnesses, subduing malevolent spirits, and overseeing life. When inscribing the talisman, hold one breath of *qi* and silently recite the incantation while writing.\n\n**Zǔshān Yāo.**\n(*Shān* pronounced as *sǎn*.)\nDispels curses cast by vengeful ghosts. At the time of use, draw one breath of *qi* from the north, inscribe the talisman while summoning and instructing the spirit, then present the talisman to them.\n\n**Kūchǔn Rú.**\nDispels spirits of those killed by violence. For those who have suffered unjust deaths, use this to release them. At the time of use, draw one breath of *qi* from the north, inscribe the talisman while summoning them, and guide them toward rebirth to prevent them from becoming vengeful spirits.\n\n**Hóngxiā.**\nDispels hanging ghosts. For those who died by hanging and have not yet been reborn, recite the incantation once, form the mudra, inscribe the talisman, and affix it.\n\n**Xiāokuài.**\nFor drowning ghosts, use this talisman to aid their transformation. Recite the incantation once, form the mudra, and inscribe it.\n\n**Yìnquē.**\nDispels illness-causing ghosts. For those suffering from lingering or recurrent afflictions, have the afflicted ingest or wear this talisman. Draw three breaths of *qi* from the east, recite the incantation three times, and inscribe it.\n\n**Lěizuān.**\nDispels poisonous *gu* or flying *gu* toxins. When used, burn the talisman while forming the mudra and reciting the incantation five times.\n\n**Xiànxián.**\nDispels disloyalty.\n\n**Fùyì.**\nDispels flattery and sycophancy.\n\n**Lànjiǎo.**\nDispels greed.\nAll these are grave harms to rulers and the people. When encountered, inscribe the talisman to summon and transform their hearts, so they may reform and become loyal, incorruptible, and upright. In each case, form the mudra, recite the incantation, face the person, inscribe the talisman with the hand, and blow upon it.\n\n**Wǔkǔn Hèyuè.**\nSummons spirits and gods to act. Used in altars and temples to requisition divine soldiers and generals. When inscribing this talisman, press the second joint of the four fingers, recite the incantation five times, and inscribe it.\n\n**Zhuālù Cùlù.**\nDispels unfilial conduct. Such grave offenses against the Great Dao and moral principles warrant execution. Summon the talisman spirit and the sword to execute their spirit at night. This is a method abandoned by royal law; use with utmost caution. When used, face the location, inscribe one talisman, and blow upon it. Press the Jade Emperor’s script, recite the incantation three times.\n\n**Shànchóu.**\nSubdues barbarians. Barbarians, who show no parental kindness or filial piety, encroach upon the Central Kingdom. Use this to bewitch them, so they may submit. When used, face the location in jest, inscribe the talisman, and place it along their path. Draw one breath of true *qi* from the Celestial Stem, recite the incantation, and inscribe it.\n\n**Něishāo Kuìpàn.**\n(*Shāo* pronounced as *shāo*; *zì* pronounced as *tǔ*.)\nRewards the honest and incorruptible. For those who embody these virtues, use the talisman and blow upon them, and fortune will naturally arrive. Inscribe the talisman while forming the mudra, recite the incantation five times, write five talismans, and blow upon them.\n\n**Báomòu Xīndèng Yǎn.**\nSummons drought demons.\n**Gǔliáng Wūdān Yìshū Niǔwān.**\n(*Chǐ* twenty times.)\nWhen inscribing the talisman, form the mudra, recite the incantation ten times, and burn the talisman.\n\n**Qūxié Gēbào.**\nSummons the *Kuígāng*. Used to slay and vanquish demonic forces. Form the mudra, recite the incantation, and inscribe it.\n\n**Fèncuì Tuòxián.**\nDispels harm to others.\n\n**Xuēyī Lìzhū.**\nSuppresses rebellion and coercion. Used for self-protection. Recite the incantation five times, form the mudra, inscribe the talisman, and wear it. May also be used for others.\n\n**Duōdá Hōng.**",
      "overlap_context": "the needle and visualize the talisman upon it. Recite the incantation nine times, then needle the painful spot and pierce.\nSummons the Sword Spirit.\nWith the right hand’s middle finger, inscribe a talisman toward the intended direction and blow upon it. Daily, face west, draw one breath of sword-*qi*, and blow it onto the middle finger. This is the *Qi*-Sword of Pure Brightness.\n**Piáoxiāo Chìzhě.** (*Piáo* pronounced as *biāo*.)\nSummons deceased ancestors. Used in ancestral rites and offerings.",
      "start_char": 5057,
      "end_char": 5929,
      "start_sentence": 412,
      "end_sentence": 495,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.949235677719116,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "去殟毒也，遣媪，即用之。 用时，取北炁七口，念咒一徧，书符七道，於殟家烧之。 嚩密啰娑诃。 嚩音焉。 厌百精也。 如用，则占至考入十，念咒掐诀，书符镇之。 唵户□。 召闭息神也。 如行炁，言闭息，即用之。 用时，以手摩鼻，念咒书之，吞下。 尾引摩。 解厌秽也。 凡遇此，乃见户之类，即书此符烧之。 书符时，存想符有大火烧身。 掐寅，咒七徧，而后烧。 怛他。 去淫心也。 刀利。 除淫鬼也。 如遇心动，即以朱书下利，吞之即灭。 书符时，呵炁五口，掐诀念咒书之。 本蚬魁鬼。 去尸虫也。 噷呵。 护炁也。 如愿身炼，即先篆，吞五日。 念咒七徧，掐寅上，望东取炁三口，吹之。 飘笼稍那谨谨沙那铜蛇竭那。 召酆都百鬼也。 以正月十六日召至，告戒之，使不得害人。 书符时，掐四指二节，不住手，书以烧之。 即至事讫，遣用娑诃符。 风轮火车。 凡召到酆都鬼、有罪鬼，搏杀之。 如篆时，念咒七徧，望天罡取炁，吹之。 以手书符。 帝居怛诃。 入天门也。 风火交加。 去身中恶也。 梵翳征销。 召贪罡力士也。 凡升真入天门用之也。 用时，先得诏便书，以备要用。 九梁横枭揖卮泄诛靴詃詃诃笼詈奸吽。 凡升真已，入天门，即以此符付 贪罡力士。 乃录事神祇应，恐入天枢不知次第。 缚只知那。 凡见录事，又须召赏善判官也。 怛哩拏伽。 又召掌恶判官也。 三慕陀罗。 又召天门七十四司判官也。 既召至判官，即以下二符与之。 帝利。 此符云吾行美也。 蛇开。 言一家尽良善也。 如此验证，有此二符，即诸判官同录事，给付券矣。 云目帝那。 召合符吏也。",
      "translated_text": "To dispel *wēn* toxins, send away the old woman, and use it accordingly. When using, take seven breaths of northern *qi*, recite the incantation once, inscribe seven talismans, and burn them at the afflicted household. *Wōmìluō suōhē.* (*Wō* pronounced as *yān.*)\n\nSuppresses the hundred spirits. When using, perform divination to determine the tenth *kǎo*, recite the incantation while forming the mudra, and inscribe the talisman to suppress them. *Ǒng hù [□].*\n\nSummons the spirit of closed breath. When practicing *qi*, if speaking of breath-holding, use it accordingly. At the time of use, rub the nose with the hand, recite the incantation while inscribing, and swallow it. *Wěiyǐn mó.*\n\nDispels defilement and impurity. Whenever encountering such things—such as doorways and the like—inscribe this talisman and burn it. While inscribing, visualize the talisman engulfing the body in great flames. Form the *yín* mudra, recite the incantation seven times, then burn it. *Dátā.*\n\nEliminates lustful thoughts. *Dāolì.* Expels lustful demons. If the heart stirs, inscribe *xiàlì* in cinnabar and swallow it to extinguish them. While inscribing, exhale five breaths of *qi*, form the mudra, recite the incantation, and inscribe it.\n\n*Běnxiǎn kuí* ghosts. Dispels corpse worms. *Xīn hē.*\n\nProtects *qi*. If one wishes to refine the body, first inscribe the talisman and swallow it for five days. Recite the incantation seven times, form the *yín* mudra, face east to gather three breaths of *qi*, and blow upon it. *Piāolóng shāonà jǐnjǐn shānà tóngshé jiénà.*\n\nSummons the hundred ghosts of Fengdu. On the sixteenth day of the first month, summon them to admonish and forbid them from harming people. While inscribing, form the mudra at the second joint of the four fingers without pause, then burn the talisman. Once the matter is concluded, use the *suōhē* talisman to send them away.\n\n*Fēnglún huǒchē.* For summoning the guilty ghosts of Fengdu to capture and slay them. When inscribing, recite the incantation seven times, face the Celestial Stem to gather *qi*, and blow upon it. Inscribe the talisman with the hand.\n\n*Dìjū dáhē.* Enters the Heavenly Gate.\n\n*Fēnghuǒ jiāojiā.* Dispels evil within the body.\n\n*Fànyì zhēngxiāo.* Summons the *Tāngāng* Vajra. Used when ascending to the true and entering the Heavenly Gate. When using, first obtain the decree before inscribing to prepare for necessary use.\n\n*Nine beams, transverse owl, bow, vessel, drain, execute, boots, *juǎnjuǎn*, *hē*, cage, *lì*, villain, *hōng*.* After ascending to the true and entering the Heavenly Gate, present this talisman to the *Tāngāng* Vajra. It records the response of the divine officials, lest one enter the Heavenly Pivot unaware of the order.\n\n*Fùzhī zhīnà.* When meeting the recording officials, one must also summon the Rewarding Goodness Judge.\n\n*Dálīnájiā.* Also summons the Punishing Evil Judge.\n\n*Sānmùtuóluó.* Also summons the seventy-four bureau judges of the Heavenly Gate. Once the judges are summoned, present them with the following two talismans.\n\n*Dìlì.* This talisman declares, \"My conduct is virtuous.\"\n\n*Shékāi.* Declares, \"The entire household is good and kind.\"\n\nUpon verification with these two talismans, all judges and recording officials will issue the certificate.\n\n*Yúnmù dìnà.* Summons the matching-talisman officials.",
      "overlap_context": "\nWhen inscribing the talisman, form the mudra, recite the incantation ten times, and burn the talisman.\n\n**Qūxié Gēbào.**\nSummons the *Kuígāng*. Used to slay and vanquish demonic forces. Form the mudra, recite the incantation, and inscribe it.\n\n**Fèncuì Tuòxián.**\nDispels harm to others.\n\n**Xuēyī Lìzhū.**\nSuppresses rebellion and coercion. Used for self-protection. Recite the incantation five times, form the mudra, inscribe the talisman, and wear it. May also be used for others.\n\n**Duōdá Hōng.**",
      "start_char": 5929,
      "end_char": 6602,
      "start_sentence": 496,
      "end_sentence": 557,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.34034276008606,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "吠伽婆帝。 合符了，遣之去也。 既得符券，即以此符召吏，合而后遣。 翳婆伽多。 四天门下，持所赐丹药、文字先到也。 只岐啰。 召天王，合上帝所赐登殿券也。 挝毗只知他。 召送天书，便交谢表也。 翳帝夷帝。 召三清左右丞，问朝谢之礼。 罗又底南。 召三清传言玉女也。 喝喝剎婆。 召主吏也。 鸡哩女诃。 召副吏也。 风轮火车。 所赐丹至，以此符谢也。 凡此符，自召录事以后，不书诀节，当自知之也。 太上灵宝浄明秘法篇下竟",
      "translated_text": "*Veigapodi.* Once the talismans are matched, dispatch them to depart.\n\nHaving received the certificate, use this talisman to summon the officials, match them, and then send them off.\n\n*Yipojaduo.* The bearers of the bestowed elixirs and documents arrive first beneath the Four Heavenly Gates.\n\n*Zhiqiluo.* Summons the Heavenly Kings to assemble the certificate for ascending the hall granted by the Supreme Emperor.\n\n*Zhuapizhinatuo.* Summons the couriers of the Heavenly Writs to present the memorial of gratitude.\n\n*Yidiyidi.* Summons the Left and Right Chancellors of the Three Clarities to inquire about the rites of court audience and gratitude.\n\n*Luoyoudinan.* Summons the Jade Maidens who transmit words for the Three Clarities.\n\n*Heheshapuo.* Summons the chief officials.\n\n*Jilinühe.* Summons the deputy officials.\n\n*Wind Wheel Fire Chariot.* When the bestowed elixir arrives, use this talisman to express gratitude.\n\nFor all these talismans, from the summoning of the recording officials onward, the incantatory seals are not written—one should know them by oneself.\n\nHere ends the *Lower Scroll of the Supreme Numinous Treasure Pure Brightness Esoteric Methods*.",
      "overlap_context": "ge.\n\n*Dálīnájiā.* Also summons the Punishing Evil Judge.\n\n*Sānmùtuóluó.* Also summons the seventy-four bureau judges of the Heavenly Gate. Once the judges are summoned, present them with the following two talismans.\n\n*Dìlì.* This talisman declares, \"My conduct is virtuous.\"\n\n*Shékāi.* Declares, \"The entire household is good and kind.\"\n\nUpon verification with these two talismans, all judges and recording officials will issue the certificate.\n\n*Yúnmù dìnà.* Summons the matching-talisman officials.",
      "start_char": 6603,
      "end_char": 6828,
      "start_sentence": 558,
      "end_sentence": 578,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.70967698097229,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明秘法篇.txt",
        "category": "方法类"
      }
    }
  ]
}