{
  "source_id": "太一救苦护身妙经",
  "source_file": "chunked_daozang\\太一救苦护身妙经.json",
  "total_chunks": 2,
  "total_original_chars": 2066,
  "total_translated_chars": 11848,
  "total_translation_time": 56.06974220275879,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太一救苦护身妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Wondrous Scripture of the Great One Who Saves from Suffering and Protects the Body**\n\n**Scripture Title:** *The Wondrous Scripture of the Great One Who Saves from Suffering and Protects the Body*. Author unknown, likely composed between the Tang and Song dynasties. It expounds upon the recitation of the name of the Heavenly Worthy Who Saves from Suffering to seek protection. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, *Section of Mysterious Writings*, *Category of Original Texts*.\n\n---\n\nAt that time, the Heavenly Worthy of Primordial Beginning was in the Nine-Colored Jade Hall of the Highest Clarity Heaven atop the Dark Radiance, ascending the Seven-Treasured Throne. He emitted a great luminosity, universally gathering the myriad spirits, and together with the teachings of Heaven, transformed all beings.\n\nThe Heavenly Worthies of the Ten Directions, Dao Lords, Lord Lao, Imperial Lords, Perfected Lords, Venerable Ones, and Sagely Ones—along with countless immortals—all came to attend the throne and listen to the wondrous Dharma.\n\nThereupon, Brahmā praised it as good, Śakra rejoiced in song, and celestial music resounded of itself, arriving with the light.\n\nAt this moment, Lord Lao of the Most High rose from his jade seat, stepping upon a lotus flower. Perfected Ones attended him on either side, jade maidens supported his trailing robes, and he came before the Heavenly Worthy, proclaiming: \"Your disciples, enlightened by the Master’s teachings, have received the blessings of the celestial halls. Your boundless merit is beyond measure. Yet I observe that within the Three Realms and the Sea of Suffering, countless beings are unjustly afflicted by calamities, entangled in the net of sins, and among the various kinds of beings, none can escape the cycles of birth and transformation. I cannot remain in the Great Clarity; I wish to rely on your majestic radiance, divide my body across the Three Realms, and save all beings. I humbly beseech the Most Venerable to regard my compassionate intent with favor.\"\n\nThereupon, the Heavenly Worthy of Primordial Beginning slightly manifested his Dharma-body and addressed Lord Lao: \"Excellent, excellent! You rise from your jade seat, startling the myriad heavens, to save from suffering and deliver the living—this need not be spoken by you. Return to your seat, and I shall proclaim it for you.\"\n\nThe Heavenly Worthy said: \"All things are born of me, all spirits are transformed by me. Those who suffer calamities must be saved. You need not rely on your own power to manifest a body and deliver them. In the Eastern Realm of Everlasting Joy, there is a being of great compassion and kindness, the Heavenly Worthy of the Great One Who Saves from Suffering. His manifested forms are as numerous as the sands of the Ganges. Responding to the cries of beings, he dwells in celestial palaces, descends among humans, resides in hells, subdues demonic hordes, or appears as immortal youths and jade maidens, as Imperial Lords and Sagely Ones, as Heavenly Worthies and Perfected Ones, as Vajra Deva Kings, as demon kings and mighty warriors, as Heavenly Masters and Daoist priests, as emperors and elders, as celestial physicians and merit officials, as men and women, as civil and military officials, as great marshals, as teaching masters and Chan masters, or as wind and rain masters. His divine transformations are boundless, his meritorious deeds inexhaustible. He saves from suffering upon hearing a cry and responds to beings according to their needs. Now I inform you of this.\"\n\nLord Lao again addressed the Heavenly Worthy: \"This sagely being possesses infinite transformations. How may he come before my Master?\"\n\nThe Heavenly Worthy told Lord Lao: \"You may raise your voice and chant the name of the Great One. Let the immortal officials join in the recitation, and he will naturally respond and manifest his body.\"\n\nThereupon, Lord Lao, the assembled immortals, and all others followed the teaching. Together, they chanted the name of the Heavenly Worthy of the Great One Who Saves from Suffering.\n\nSuddenly, from among the ranks of the Imperial Lords, a youth appeared, stepping upon lotus flowers. He bowed his head before the Heavenly Worthy and proclaimed: \"Your disciple is the Great One. By my Master’s grace, I have come to expound the Dharma. I gather my forms and listen to the wondrous sounds. In Heaven, joy arises in an instant; in the underworld, movement spans ten thousand kalpas. Within the Three Realms, all beings suffer, crying out in anguish: *How bitter! How bitter!*\"\n\nHe circled the Heavenly Worthy, bowing and prostrating, and begged to descend through the celestial gates.\n\nAt this, the assembled immortals, seeing the youth’s plea, wept tears that stained their robes, sighing: \"In Heaven, there is joy; below, there is disaster. The retributions of samsara—when will there be peace?\"\n\nThe Heavenly Worthy addressed the Great One: \"Your vows are compassionate, and beings suffer. In accordance with your vows, divide your body to save them.\"\n\nThe youth rejoiced, bowed again, and withdrew.\n\nThe assembled immortals beheld the youth transform into a Heavenly Worthy, his feet upon a lotus, a halo of radiance shining forth. In his hand, he held a willow branch and pure water. Nine-headed lions attended him on either side as he rode through the void.\n\nThen they saw the Heavenly Worthy transform into an Imperial Lord, his feet upon a lotus, a ruyi scepter in hand, a halo of radiance shining forth. Nine-headed lions attended him on either side as he rode through the void.\n\nNext, they saw the Imperial Lord transform into a Perfected One, his feet upon a lotus, emitting divine light that connected the Nine Heavens above and the Nine Earths below. Nine-headed lions attended him on either side as he rode through the void.\n\nThen they saw the Perfected One transform into a woman, clad in fiery brocade robes, her hair unbound and feet bare, stepping upon a lotus. In her hand, she wielded a golden sword, a halo of radiance shining forth. Nine-headed lions, spouting flames, circled her form as she rode through the void.\n\nLord Lao addressed the Heavenly Worthy: \"This sagely being’s power and virtue, transforming to save the living—from what kalpa did they arise, and through what aeons of cultivation? I humbly beseech you to respond according to the needs of beings and proclaim it for all.\"\n\nThe Heavenly Worthy said: \"This sagely being is called in Heaven the Fortune Spirit of the Great One, in the world the Great Compassionate One, in hell the Radiant Imperial Lord of the Sun, among heterodox paths the Lion Bright King who subdues demons, and in the watery palaces the Imperial Lord of the Abyssal Depths. You are my qi, and I am your root. You know me, and I know you—this is the essence of the Nine Yangs. Most numinous, most numinous! You may keep this secret; it cannot be fully described.\"\n\nAt that time, Lord Lao, hearing the words of the Heavenly Worthy, closed his eyes and composed his spirit. He snapped his fingers, knocked his head, and recited the incantation:\n\n*\"The primordial qi of the primordial ancestor,\nWondrously transforms the essence of the Nine Yangs.\nPower and virtue spread through the ten directions,\nVaguely, vaguely, revealing its truth.\nThe Three Nines send forth the wind,\nWandering from the Blue of the Beginning.\nReverently, the nectar of jade is born,\nOffering it to avoid hunger and thirst.\nThe myriad spirits should believe and worship,\nThe Eight Sufferings cannot follow.\"*\n\nBy accumulating virtuous deeds and upholding precepts, one may ascend to the Jade Capital.\n\nAt that time, the Heavenly Worthy further addressed Lord Lao and all the immortals, saying: \"If there are beings afflicted by pestilence and lingering illness, they may burn incense, recite the sacred name, and reverently transmit this sutra—thus shall their ailments dissipate, and peace be attained. If there are beings seeking office or position, beset by treacherous slander, let them recite the sacred name and transmit this sutra, and naturally envy shall cease, and rank and emolument be elevated. If there are beings traversing rivers and seas, threatened by waves, fish, or dragons, let them visualize and recite the sacred name, and they shall reach the shore unharmed. If there are beings struck by thunder, lightning, or terrifying storms, let them visualize and recite the sacred name, and their spirit shall be clear, their soul undisturbed. If there are beings whose parents, teachers, or kin are discordant, whose siblings are estranged, let them visualize and recite the sacred name, transmit this sutra, and naturally their kin shall harmonize—fathers kind, children filial, elder brothers friendly, younger brothers respectful. If there are kings or lords whose courts harbor rebellious ministers, whose lands are ravaged by war and famine, whose winds and rains are untimely, whose people suffer, let them uphold fasting and recitation, transmit this sutra, and winds and rains shall align with the seasons, traitors be exposed, and the realm know peace. If there are beings harmed by malevolent spirits or bandits, let them visualize and recite the sacred name, and demons shall retreat, bandits perish. If there are beings traveling through mountains or forests, threatened by beasts, snakes, or birds, let them visualize and recite the sacred name, and creatures shall withdraw, daring not to harm. If there are women with child facing difficult labor, let them visualize and recite the sacred name, and true qi shall protect them, free from pain or injury, bearing wise sons or comely daughters, whole in body and spirit, mother and child reunited. If there are men or women, lay or ordained, who aspire to the Dao and seek immortality, let them visualize and recite the sacred name, transmit this sutra, and their merit shall be perfected, ascending to heaven in broad daylight. If there are beings bound in shackles or imprisoned, groaning in despair, let them visualize and recite the sacred name, and they shall be freed, escaping confinement. If there are beings whose seven generations of ancestors, nine lineages of forebears, disciples, classmates, spouses, or departed kin linger in the cold courts of the underworld, unable to be reborn, let them visualize and recite the sacred name, and naturally they shall depart the shadowy realms, ascending to heaven. If there are beings entangled by vengeful ties, let them visualize and recite the sacred name, and their grievances shall dissolve, their bonds severed.\"\n\nThen the Heavenly Worthy addressed Lord Lao, saying: \"This sacred name is most exalted, most noble, most holy, most numinous. On the three ninth days of each month, it descends most frequently among mortals. Always in a purified chamber, burn incense, bow in worship, prepare willow branches and pure water, seasonal flowers, and medicinal herbs as offerings—thus shall one naturally live to one hundred and twenty, the Five Fortunes ever present, the Eight Difficulties far removed. Beware of ashes from the hearth, pomegranate refuse, or any unclean matter—these are impure and must not be touched.\"\n\nWhen the Heavenly Worthy finished expounding the sutra, all the immortals in the great assembly chanted in praise. Lions spoke, phoenixes sang, fish and dragons took human form, withered trees revived, and even the lowliest creatures were moved—all received blessings without exception. Majestic and resplendent, all ascended as immortals. Then the Dao Lord, Lord Lao, and the boundless host of perfected beings joined in unison, extolling: \"Today we have heard the wondrous teaching and gained great benefit.\" They took their leave and departed.\n\n*Thus concludes the Wondrous Sutra of the Great One for Salvation from Suffering and Protection of the Body.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太一救苦护身妙经 经名：太一救苦护身妙经。 撰人不详，约出於唐宋间。 言念诵救苦天尊祈求护卫。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太一救苦护身妙经 尔时，元始天尊在玄景之上清微天中九色玉堂，升七宝座，放大光明，普集万灵，与天教化。 十方天尊、道君、老君、帝君、元君、丈人、圣人，万万仙众，俱来诣座，听宣妙法。 於是梵王称善，帝释欣歌，仙乐自响，随光而至。 是时太上老君身离玉座，步蹑莲花，真人侍於左右，玉女扶於曳裾，至天尊前，奏曰：臣等蒙师开化，受福天堂，施功无极，恩不可量。 臣观三界之中、苦海之内，无量众生，横遭厄难，罪网牵缠，异类群情，难逃生化。 臣不可住於太清，欲仗威光，分身三界，救度群情。 惟望至尊，观心慈欲。 於是元始天尊微起法身，告老君曰：善哉善哉。 汝离玉座，惊怖万天，救苦救生，不须汝言。 可还座中，吾为宣说。 天尊曰：万物吾生，万灵吾化。 遭苦遭厄，当须救之。 不须汝威力化身救度。 此东方长乐世界有大慈仁者，太一救苦天尊，化身如恒沙数，物随声应，或住天宫，或降人间，或居地狱，或摄群邪，或为仙童玉女，或为帝君圣人，或为天尊真人，或为金刚神王，或为魔王力士，或为天师道士，或为皇人老君，或为天医功曹，或为男子女子，或为文武官宰，或为都大元帅，或为教师禅师，或为风师雨师，神通无量，功行无穷，寻声救苦，应物随机，今告汝知。 老君重奏曰：此之威神，有无量变化，如何得至我师御前。 天尊告老君曰：汝可举声唱太一之名，使仙官齐咏，自然应化现身。 於是老君众仙等，遵其教旨，齐声称咏太一救苦天尊之名。 忽见帝君班中有童子一人，步步蹑於莲花，稽首至天尊前奏曰：臣乃太一，为我师开化说法。 臣集相聚形，听宣妙音，天中快乐一时，地下动经万劫，三界之中，群生受苦，高声叫唤，苦哉苦哉。 旋绕天尊，礼拜俯伏，乞下天关。 於是众仙见童子奏对泣泪滴衣，哽噎叹言。 天上快乐，地下受灾，轮回报对，何时清闲。 天尊告太一曰：汝行愿慈悲，众生受苦。 依汝行愿，分身救之。 童子喜笑，再拜而退。 众仙观见童子化一天尊，足蹑莲花，圆光照耀，手执柳枝净水，九头狮子左右从随，乘空而去。 又见天尊化一帝君，足蹑莲花，手执如意，圆光照耀，九头狮子左右从随，乘空而去。 又见帝君化一真人，足蹑莲花，手放神光，上通九天，下通九地，九头狮子左右从随，乘空而去。 又见真人化一女子，身着火锦衬衣，披发跣足，蹑於莲花，手执金剑，圆光照耀，九头狮子，口吐火焰，绕於身形，乘空而去。 老君奏天尊曰：此圣威德，变化救生，从何而有，甚劫修行，惟愿应机，为众宣说。 天尊曰：此圣在天呼为太一福神，在世呼为大慈仁者，在地狱呼为日耀帝君，在外道摄邪，呼为狮子明王，在水府呼为洞渊帝君。 汝是吾之气，吾是汝之根，汝知吾知，此是九阳之精，甚灵甚灵。 汝可秘之，不可尽述。 是时老君闻天尊言，闭目定神，弹指叩头，咒曰： 元元之祖气，妙化九阳精。 威德布十方，恍恍现其真。 三九扬风出，徘徊离始青。 恭敬生琼液，奉之免渴饥。 万灵当信礼，八苦不能随。",
      "translated_text": "**The Wondrous Scripture of the Great One Who Saves from Suffering and Protects the Body**\n\n**Scripture Title:** *The Wondrous Scripture of the Great One Who Saves from Suffering and Protects the Body*. Author unknown, likely composed between the Tang and Song dynasties. It expounds upon the recitation of the name of the Heavenly Worthy Who Saves from Suffering to seek protection. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, *Section of Mysterious Writings*, *Category of Original Texts*.\n\n---\n\nAt that time, the Heavenly Worthy of Primordial Beginning was in the Nine-Colored Jade Hall of the Highest Clarity Heaven atop the Dark Radiance, ascending the Seven-Treasured Throne. He emitted a great luminosity, universally gathering the myriad spirits, and together with the teachings of Heaven, transformed all beings.\n\nThe Heavenly Worthies of the Ten Directions, Dao Lords, Lord Lao, Imperial Lords, Perfected Lords, Venerable Ones, and Sagely Ones—along with countless immortals—all came to attend the throne and listen to the wondrous Dharma.\n\nThereupon, Brahmā praised it as good, Śakra rejoiced in song, and celestial music resounded of itself, arriving with the light.\n\nAt this moment, Lord Lao of the Most High rose from his jade seat, stepping upon a lotus flower. Perfected Ones attended him on either side, jade maidens supported his trailing robes, and he came before the Heavenly Worthy, proclaiming: \"Your disciples, enlightened by the Master’s teachings, have received the blessings of the celestial halls. Your boundless merit is beyond measure. Yet I observe that within the Three Realms and the Sea of Suffering, countless beings are unjustly afflicted by calamities, entangled in the net of sins, and among the various kinds of beings, none can escape the cycles of birth and transformation. I cannot remain in the Great Clarity; I wish to rely on your majestic radiance, divide my body across the Three Realms, and save all beings. I humbly beseech the Most Venerable to regard my compassionate intent with favor.\"\n\nThereupon, the Heavenly Worthy of Primordial Beginning slightly manifested his Dharma-body and addressed Lord Lao: \"Excellent, excellent! You rise from your jade seat, startling the myriad heavens, to save from suffering and deliver the living—this need not be spoken by you. Return to your seat, and I shall proclaim it for you.\"\n\nThe Heavenly Worthy said: \"All things are born of me, all spirits are transformed by me. Those who suffer calamities must be saved. You need not rely on your own power to manifest a body and deliver them. In the Eastern Realm of Everlasting Joy, there is a being of great compassion and kindness, the Heavenly Worthy of the Great One Who Saves from Suffering. His manifested forms are as numerous as the sands of the Ganges. Responding to the cries of beings, he dwells in celestial palaces, descends among humans, resides in hells, subdues demonic hordes, or appears as immortal youths and jade maidens, as Imperial Lords and Sagely Ones, as Heavenly Worthies and Perfected Ones, as Vajra Deva Kings, as demon kings and mighty warriors, as Heavenly Masters and Daoist priests, as emperors and elders, as celestial physicians and merit officials, as men and women, as civil and military officials, as great marshals, as teaching masters and Chan masters, or as wind and rain masters. His divine transformations are boundless, his meritorious deeds inexhaustible. He saves from suffering upon hearing a cry and responds to beings according to their needs. Now I inform you of this.\"\n\nLord Lao again addressed the Heavenly Worthy: \"This sagely being possesses infinite transformations. How may he come before my Master?\"\n\nThe Heavenly Worthy told Lord Lao: \"You may raise your voice and chant the name of the Great One. Let the immortal officials join in the recitation, and he will naturally respond and manifest his body.\"\n\nThereupon, Lord Lao, the assembled immortals, and all others followed the teaching. Together, they chanted the name of the Heavenly Worthy of the Great One Who Saves from Suffering.\n\nSuddenly, from among the ranks of the Imperial Lords, a youth appeared, stepping upon lotus flowers. He bowed his head before the Heavenly Worthy and proclaimed: \"Your disciple is the Great One. By my Master’s grace, I have come to expound the Dharma. I gather my forms and listen to the wondrous sounds. In Heaven, joy arises in an instant; in the underworld, movement spans ten thousand kalpas. Within the Three Realms, all beings suffer, crying out in anguish: *How bitter! How bitter!*\"\n\nHe circled the Heavenly Worthy, bowing and prostrating, and begged to descend through the celestial gates.\n\nAt this, the assembled immortals, seeing the youth’s plea, wept tears that stained their robes, sighing: \"In Heaven, there is joy; below, there is disaster. The retributions of samsara—when will there be peace?\"\n\nThe Heavenly Worthy addressed the Great One: \"Your vows are compassionate, and beings suffer. In accordance with your vows, divide your body to save them.\"\n\nThe youth rejoiced, bowed again, and withdrew.\n\nThe assembled immortals beheld the youth transform into a Heavenly Worthy, his feet upon a lotus, a halo of radiance shining forth. In his hand, he held a willow branch and pure water. Nine-headed lions attended him on either side as he rode through the void.\n\nThen they saw the Heavenly Worthy transform into an Imperial Lord, his feet upon a lotus, a ruyi scepter in hand, a halo of radiance shining forth. Nine-headed lions attended him on either side as he rode through the void.\n\nNext, they saw the Imperial Lord transform into a Perfected One, his feet upon a lotus, emitting divine light that connected the Nine Heavens above and the Nine Earths below. Nine-headed lions attended him on either side as he rode through the void.\n\nThen they saw the Perfected One transform into a woman, clad in fiery brocade robes, her hair unbound and feet bare, stepping upon a lotus. In her hand, she wielded a golden sword, a halo of radiance shining forth. Nine-headed lions, spouting flames, circled her form as she rode through the void.\n\nLord Lao addressed the Heavenly Worthy: \"This sagely being’s power and virtue, transforming to save the living—from what kalpa did they arise, and through what aeons of cultivation? I humbly beseech you to respond according to the needs of beings and proclaim it for all.\"\n\nThe Heavenly Worthy said: \"This sagely being is called in Heaven the Fortune Spirit of the Great One, in the world the Great Compassionate One, in hell the Radiant Imperial Lord of the Sun, among heterodox paths the Lion Bright King who subdues demons, and in the watery palaces the Imperial Lord of the Abyssal Depths. You are my qi, and I am your root. You know me, and I know you—this is the essence of the Nine Yangs. Most numinous, most numinous! You may keep this secret; it cannot be fully described.\"\n\nAt that time, Lord Lao, hearing the words of the Heavenly Worthy, closed his eyes and composed his spirit. He snapped his fingers, knocked his head, and recited the incantation:\n\n*\"The primordial qi of the primordial ancestor,\nWondrously transforms the essence of the Nine Yangs.\nPower and virtue spread through the ten directions,\nVaguely, vaguely, revealing its truth.\nThe Three Nines send forth the wind,\nWandering from the Blue of the Beginning.\nReverently, the nectar of jade is born,\nOffering it to avoid hunger and thirst.\nThe myriad spirits should believe and worship,\nThe Eight Sufferings cannot follow.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1247,
      "start_sentence": 0,
      "end_sentence": 45,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.16717076301575,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太一救苦护身妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "积行持科戒，提携证玉京。 尔时，天尊重告老君及诸仙曰：若有众生，时遭疾疫，病痛缠绵，可以焚香念诵圣号，看转此经，疾患退散，克获安宁。 若有众生求官觅职，奸佞妄生，但当念诵圣号，看转此经，自然嫉妬不生，高迁禄秩。 若有众生泛涉江海，波浪所惊，鱼龙欲伤，可以存思念诵圣号，便得达岸，无有害伤。 若有众生值雷霹雳，风雨惊怖，但当存思念诵圣号，神气爽清，魂魄不动。 若有众生父母师资，六亲不和，兄弟乖疏，但当存思念诵圣号，看转此经，自感六亲和睦，父慈子孝，兄友弟恭。 若有帝王国主，朝生叛臣，兵火作乱，风雨不调，万民涂炭，怨地尤天，但当持斋念，看转此经，风雨便得顺时，叛臣败露，国泰民安。 若有众生为邪精鬼贼，妄来所伤，但当存思念诵圣号，妖魅自止，鬼贼灭亡。 若有众生山林往来，被虫蛇禽兽奔夺所伤，但当存思念诵圣号，禽虫自退，不敢来害。 若有女人怀受胎孕，临产艰难，但当存思念诵圣号，自感真气佑护，无痛无伤，便生智慧之男，有相之女，六根具足，母子团圆。 若有男子女子慕道求仙，在家出家，养性养命，但当存思念诵圣号，看转此经，便得功行圆满，白日升天。 若有众生频遭枷锁牢狱之中，呻吟难诉，但当存思念诵圣号，便得解脱，出离囹圄。 若有众生为七祖九先、门人同学、夫妻男女身殁之后，流滞寒庭，未得托生，但当存思念诵圣号，自然出离阴境，便得生天。 若有众生为冤家牵引，复连相缠，但当存思念诵圣号，冤家解释，后连断除。 於是，天尊告老君曰：此圣最尊最贵，最圣最灵。 每月三九日，多降人间。 常於净室中，焚香礼拜，柳枝净水，时花药苗，如法供养，自然寿满一百二十，五福常臻，八难远离。 切忌灶下灰烬，石榴秽物，此为不洁，勿令触之。 尔时，天尊说经毕竟，大会之中群仙唱善。 狮子能语，凤凰能言，鱼龙成人，枯朽还生，蠢动含情，福资皆徧。 巍巍堂堂，皆得升仙。 於是道君、老君、无量众真，同声赞叹：今闻妙音，大获利益。 奉辞而退。 太一救苦护身妙经竟",
      "translated_text": "By accumulating virtuous deeds and upholding precepts, one may ascend to the Jade Capital.\n\nAt that time, the Heavenly Worthy further addressed Lord Lao and all the immortals, saying: \"If there are beings afflicted by pestilence and lingering illness, they may burn incense, recite the sacred name, and reverently transmit this sutra—thus shall their ailments dissipate, and peace be attained. If there are beings seeking office or position, beset by treacherous slander, let them recite the sacred name and transmit this sutra, and naturally envy shall cease, and rank and emolument be elevated. If there are beings traversing rivers and seas, threatened by waves, fish, or dragons, let them visualize and recite the sacred name, and they shall reach the shore unharmed. If there are beings struck by thunder, lightning, or terrifying storms, let them visualize and recite the sacred name, and their spirit shall be clear, their soul undisturbed. If there are beings whose parents, teachers, or kin are discordant, whose siblings are estranged, let them visualize and recite the sacred name, transmit this sutra, and naturally their kin shall harmonize—fathers kind, children filial, elder brothers friendly, younger brothers respectful. If there are kings or lords whose courts harbor rebellious ministers, whose lands are ravaged by war and famine, whose winds and rains are untimely, whose people suffer, let them uphold fasting and recitation, transmit this sutra, and winds and rains shall align with the seasons, traitors be exposed, and the realm know peace. If there are beings harmed by malevolent spirits or bandits, let them visualize and recite the sacred name, and demons shall retreat, bandits perish. If there are beings traveling through mountains or forests, threatened by beasts, snakes, or birds, let them visualize and recite the sacred name, and creatures shall withdraw, daring not to harm. If there are women with child facing difficult labor, let them visualize and recite the sacred name, and true qi shall protect them, free from pain or injury, bearing wise sons or comely daughters, whole in body and spirit, mother and child reunited. If there are men or women, lay or ordained, who aspire to the Dao and seek immortality, let them visualize and recite the sacred name, transmit this sutra, and their merit shall be perfected, ascending to heaven in broad daylight. If there are beings bound in shackles or imprisoned, groaning in despair, let them visualize and recite the sacred name, and they shall be freed, escaping confinement. If there are beings whose seven generations of ancestors, nine lineages of forebears, disciples, classmates, spouses, or departed kin linger in the cold courts of the underworld, unable to be reborn, let them visualize and recite the sacred name, and naturally they shall depart the shadowy realms, ascending to heaven. If there are beings entangled by vengeful ties, let them visualize and recite the sacred name, and their grievances shall dissolve, their bonds severed.\"\n\nThen the Heavenly Worthy addressed Lord Lao, saying: \"This sacred name is most exalted, most noble, most holy, most numinous. On the three ninth days of each month, it descends most frequently among mortals. Always in a purified chamber, burn incense, bow in worship, prepare willow branches and pure water, seasonal flowers, and medicinal herbs as offerings—thus shall one naturally live to one hundred and twenty, the Five Fortunes ever present, the Eight Difficulties far removed. Beware of ashes from the hearth, pomegranate refuse, or any unclean matter—these are impure and must not be touched.\"\n\nWhen the Heavenly Worthy finished expounding the sutra, all the immortals in the great assembly chanted in praise. Lions spoke, phoenixes sang, fish and dragons took human form, withered trees revived, and even the lowliest creatures were moved—all received blessings without exception. Majestic and resplendent, all ascended as immortals. Then the Dao Lord, Lord Lao, and the boundless host of perfected beings joined in unison, extolling: \"Today we have heard the wondrous teaching and gained great benefit.\" They took their leave and departed.\n\n*Thus concludes the Wondrous Sutra of the Great One for Salvation from Suffering and Protection of the Body.*",
      "overlap_context": "ped his fingers, knocked his head, and recited the incantation:\n\n*\"The primordial qi of the primordial ancestor,\nWondrously transforms the essence of the Nine Yangs.\nPower and virtue spread through the ten directions,\nVaguely, vaguely, revealing its truth.\nThe Three Nines send forth the wind,\nWandering from the Blue of the Beginning.\nReverently, the nectar of jade is born,\nOffering it to avoid hunger and thirst.\nThe myriad spirits should believe and worship,\nThe Eight Sufferings cannot follow.\"*",
      "start_char": 1247,
      "end_char": 2047,
      "start_sentence": 46,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.902571439743042,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太一救苦护身妙经.txt",
        "category": "本文类"
      }
    }
  ]
}