{
  "source_id": "太上飞步南斗太微玉经",
  "source_file": "chunked_daozang\\太上飞步南斗太微玉经.json",
  "total_chunks": 4,
  "total_original_chars": 2587,
  "total_translated_chars": 17070,
  "total_translation_time": 93.72218060493469,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步南斗太微玉经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Supreme Jade Scripture of Soaring Steps to the Southern Dipper and Grand Tenuity*\n\n**Scripture Title:** *The Supreme Jade Scripture of Soaring Steps to the Southern Dipper and Grand Tenuity*. Author unknown, likely composed between the Tang and Song dynasties. It expounds the methods of \"soaring steps\" to the six stars of the Southern Dipper. One fascicle.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, *Section of Divine Writings from the Cavern of Spirits*, category of original texts.\n\n---\n\n*The Supreme Jade Scripture of Soaring Steps to the Southern Dipper and Grand Tenuity*\n\nWhen the Supreme Perfected King of the Great Void of the Southern Summit, the Red Lord of Mount Song (Pine Master), was studying the Dao, he arrived riding a dragon-drawn phoenix chariot to the Jade Chamber of Grand Tenuity within the Palace of Grand Tenuity. Reclining in the Vermilion Brilliance, seated in the shade of the *kumu* tree, he dissolved his *qi* into the void and concealed his spirit in non-being. The Mysterious Essence remained unopened by the Dao, and for me, he grasped the firmament with Heaven.\n\nThe Perfected Maiden of the Vermilion Radiance and Purple Numinosity of Highest Clarity cast the splendor of her gauze-like radiance beyond the luminous heavens. Soaring to the Jade Latitude, she circled the Vermilion Net, summoning the Perfected of Cavernous Yang and grasping the handle of the Southern Asterism. Roaming Grand Tenuity, her harmonious resonance echoed through the Nine Clarities. Clouds revolved and lightning filled the skies; her body merged with the profound obscurity as she gazed down upon the world.\n\nThe Red Lord possessed a golden countenance and refined endowments, his virtue square in action and round in completion. His heart was empty of dust, like the midnight moon; his thoughts severed from karmic deeds, like a lotus in water.\n\nHereafter, she taught the Red Lord the supreme Dao of the Highest Perfected, the *Jade Scripture of Soaring to the Southern Dipper and Treading the Stellar Path of Grand Tenuity*.\n\nThe Dao speaks of the Cavernous Void, its roots planted beyond being and non-being. The two luminaries suspend their essence in the Great Void, their luxuriant splendor spreading between the two poles. The radiant sun flows and evolves; the six stars adorn the heavens. Thus, the great image gives rise to things, and the primordial chaos issues forth its source—necessarily from the Southern Dipper, where the alchemy of refinement and tempering is accomplished.\n\nTherefore, the six directions form the crucible’s frame, the six principles serve as the cauldron’s vessel, the Two Modes become water and fire, and expansion and contraction govern advance and retreat. The Great One presides over the furnace, the Thearch wields the tally, and the flying elixir endures for ninety million years. The Three Luminaries array their brilliance, and the host of stars order the cosmos.\n\nThus, Heaven is the canopy, Earth the chariot, the sun and moon the wheels, the four seasons the steeds. Girded with the Southern Asterism, adorned with the Northern Dipper, one establishes the Imperial Ultimate and creates the myriad things—such is the wondrous purport of Grand Tenuity, the esoteric words of the Highest Perfected.\n\nThe Vermilion Mound of Southern Prosperity holds the six stars in highest esteem. To tread them, one must first know their true names, then wear their true forms. One treads upon their *hun* souls, then steps upon their *po* spirits, and only then ascends the stars. After three circuits of return, the six asterisms reflect one’s form.\n\nPracticing for five years, one becomes a Perfected of Highest Clarity. After nine years, one beholds the Six Perfected and reveals one’s utmost sincerity, becoming of the same rank as the omens. After fifteen years, one weaves the Vermilion Net with one’s hands, presiding over the myriad spirits, and rides the Six Flying Dragons to ascend to Jade Clarity.\n\n**The Six True Stars of the Southern Dipper:**\nFlowery Gate, Expansive Edge, Holding Brilliance, Exhausting Well\n\nSix Star Talismans—First Star Talisman, Second Star Talisman, Third Star Talisman, Fourth Star Talisman, Fifth Star Talisman, Sixth Star Talisman—are inscribed in cinnabar on azure silk, each six inches square. On the third, sixth, sixteenth, twenty-third, and twenty-sixth days of the lunar month, face south, bow twice, and ingest them. The incantation reads:\n\n*\"Verdant Radiance of the Grand Tenuity, true qi opens in profound clarity. Crimson pearls and cinnabar fruits thread the jade steps’ stem, while vermilion light illumines the treasure palace. Dragon and tiger bear purple script; the Infant of Being and Nonbeing wears a brocade skirt of crimson embroidery, a jade bell girdle at the waist. Facing the Northern Clarity, you swallow awns and tread upon radiance, rising with the Emperor in shared ascent. Phoenix chariots and tiger banners escort the Perfected Ministers; I become the Master of the Dao, unshaken for a billion kalpas.\"*\n\nAgain, inscribe in cinnabar on azure silk, six inches in breadth, and place within a brocade pouch worn over the heart. For flying ascent or conducting affairs, all inauspicious matters dissolve—don fresh, pure garments.\n\n**Names of the Five Stars’ *Hun* Souls:**\nJue, Zhen, Po, Lin, Ying\n\nFor the *hun* souls of the Five Stars, begin stepping from Jue, both feet advancing to Ying, traversing thrice in return. Visualize ascending the stars with five Perfected Ones, clad in vermilion robes and jade crowns, their forms like infants, accompanying you. Then let your hands hang down, pinch the tiger’s mouth with two fingers on each hand, and click the teeth five times. The ascent incantation reads:\n\n*\"Majestic and resplendent, Cavernous Clarity—Five Stars of the Southern *Hun*, revolving through the celestial pivots, descending upon the earth to receive the numinous. Crimson-robed and jade-visaged, they harmonize with me in ascent. Divine teachers and imperial companions, formless in separation or union, seated in marvel among the immortals—Great Ultimate, Great Clarity—my body flies swift as a cry, the Four Ones merging in luminosity.\"*\n\nStep within a nine-foot circle of azure earth, marking the stars with green and the weft with yellow.\n\n**Names of the Seven Stars’ *Po* Souls**\n\nWith chisel and mirror resounding like chinking metal—*Po* Souls of the Seven Stars—beginning from *Zhao* and stepping to *Pu*, traverse back and forth three times. Visualize yourself ascending the star, where seven jade maidens, clad in yellow robes and crowned with jeweled topknots, their forms like infants, accompany you. Then raise both hands, pressing the thumb to the base of the three fingers, and click the teeth seven times. The ascent incantation reads:\n\n*\"Spinning crimson, threading the rosy clouds, nurturing the radiance of cinnabar spirits—seven jade maidens of beauty, entwining the essence of heaven. Fine clouds disperse like silk; the Yellow-Robed Great Divinity sits in the sacred grass’s obscurity, inhaling and guiding the swirling mists. With me at the Dao’s pivot, the numinous transcends the dust of suffering. The golden chariot and grand carriage, dragon robes draped upon the body—sit upright in the Hall of Brightness, guarded by the myriad spirits. Ascend the Seven Luminaries, attuning to the Jade Clarity.\"*\n\nStep within a nine-foot circle of azure earth, marking the stars with yellow and the weft with vermilion.\n\nAt each step of the *hun* and *po* souls, invoke one star’s name, visualizing one spirit; proceed likewise thereafter. Burn incense to the left and right.\n\nThe Way of the Flying Dipper and Six Celestial Stems measures the length of the steps, whether long or short. For every double step where the feet cannot reach the star, follow the weft as a guiding line to align with the star—this suffices for both feet. If the double step still falls short, let both feet trace the weft until one foot rests upon it. One foot treads, both feet step, treading the weft. Tread the star’s weft and void—this is the station of the Immortal King.\n\n**Secret Names of the Six Stars**\n*Vermilion Radiance, Emperor Yao, Flourishing Brilliance*—these six stars’ secret names grant immortality to those who know them. Recite them while facing the stars to unlock the radiance of the Cavernous Chambers and restrain the primordial *qi* of the myriad heavens.\n\n**First: Precious Radiance, Jade Mystery, Supreme Perfected Dao Lord**, who governs the Elixir Jade and Rosy Flower Palace of Medicinal Alchemy.\nWhen first ascending the first star, remove your shoes outside the mat. Step forward with the left foot, aligning the right heel with the front foot. With the right two fingers, press the base of the thumb, letting the left hand hang. Swallow the *qi* three times, visualizing the Jade Mystery Supreme Perfected Dao Lord, clad in a cinnabar brocade robe, his form like an infant, within the Celestial Star’s Medicinal Palace. His mouth emits purple *qi*, infusing your hundred bones, suffusing you with golden light, indistinguishable from the void. Forgetting your form, recite:\n*\"Resplendent Great Ultimate, divine radiance flowing like gold. Cinnabar splendor of the Purple Palace, supreme and exalted—transforming into a jade child, you open my golden gate. Purple clouds swirl in eddies, illuminating the Nine Clarities. In the vast and obscure, the empty vision, I forget my form in rapture. Master of life in the Emperor’s Palace, root of the supreme Dao.\"*\nThis is called *Yuexing Yuxuan* (Meeting the Star of Jade Mystery).\n\n**Second: Cinnabar Essence, Mystic Brilliance, Precious Chamber Supreme Perfected Dao Lord**, who governs the Seven Treasures and Golden Flower Palace of Medicinal Alchemy.\nWhen ascending the second star, press the *Shanyuan* with the right hand and the space between the brows with the left, thirty-six times. Hold the breath for seven cycles, visualizing the Precious Chamber Supreme Perfected Dao Lord, clad in a purple embroidered feathered robe, golden bells at his waist, his form like an infant, seated upon a cinnabar dais. The Dao Lord holds the Six Stars of the Southern Dipper in his hands, like a crimson thread stringing luminous pearls, their cinnabar radiance blazing through. He casts them into my *Niwan*, fixing their positions to illuminate me. My body’s spirits stand in array, like layers of pupils in the eye. Recite:\n*\"My body floats upon the cinnabar weft, treading the numinous essence. The Precious Chamber’s Perfected King breathes the wind and thunder, rolling pearls and kneading the ministers. Flying light enters the *Niwan*; purple and yellow revolve. The Golden Chamber’s *qi* proclaims—controlling the boundless void, my form rides the flying dragon.\"*\nThis is called *Dan Jing Lian Sheng* (Cinnabar Essence Refining Life).\n\n**Third: Numinous Jade, Precious Radiance, Red Heaven Supreme Perfected Dao Lord**, who governs the Golden Cavern’s Rainbow City and Cinnabar Flower Radiance Palace.\nWhen ascending the third star, cover both ears with your hands. Visualize beneath your feet a circumference of five hundred *li*, revolving like a wheel. Purple clouds churn like boiling water in a cauldron, their bubbling *qi* rumbling like thunder for hundreds of thousands of *li*. Within the starlight appears an infant, unclothed, six *fen* in length, leaping from the star into my mouth and descending to the Purple Chamber. Recite:\n*\"Vermilion mist merges in the cavern; starlight intertwines. Yellow mists pervade the high void, governing the Red Heaven. Connecting my heart and spirit, transforming into a jade immortal. Riding the *qi* and embracing the wind, my body enters the Jade Chamber. Laughing at the myriad beings’ humiliations, I don the imperial robes. Refining cinnabar and spreading yellow—true sovereign, true lord.\"*\nThis is called *Fei Zhen Hua Xing* (Flying Perfection Transforming Form).\n\n**Fourth: Luminous Brilliance, Azure Void Perfected King, Heavenly Virtue Supreme Perfected Dao Lord**, who governs the Nine Spirits’ Essence, Purple Yang’s Bright Secrets, and Golden Brilliance Jade Palace.\nWhen ascending the fourth star, let your hands hang and clasp them to the left and right, closing your eyes and holding your breath. Ascend the star, visualizing it opening like a lotus. Behold the Dao Lord, his form tender like an infant, clad in a green brocade robe, holding a golden battle-axe, seated upon a green jade lion throne. His mouth emits azure *qi*, entering my liver nine times. Envision the *qi* in my liver transforming into a precious pearl, its light flowing with majestic brilliance. Within it is a youth, wearing a black turban and azure cloak, playing a jade zither. Its sound flows smoothly, permeating my entire body, harmonious and serene. After a long while, recite:\n*\"Heavenly soul of the Nine Spirits, fire as younger brother, wood as elder. Radiance flourishes and flows, lush and verdant in essence and clarity. The Dao Lord wields the battle-axe; the youth plays the zither. Azure mist in subtle wonder perfumes my spirit’s window. Facing the Purple Emperor, he bestows upon me the Emperor’s Terrace. Tiger-script in the golden enclosure, establishing my rank in the Northern Clarity. My golden form flies through the void; the spirit’s way unites in obscurity.\"*\nThis is called *Ning Jing Hua Tong* (Congealing Essence and Flower Youth).\n\n**Fifth: Supreme Perfection, Grand Mystery, Precious Immortal, Jade Emperor, Supreme Perfected Dao Lord**, who governs the Purple Radiance and Rosy Yang’s Cavernous Spirit Jade Palace.\nWhen ascending the fifth star, cross your hands before the star and kneel, clicking the teeth seven times and holding your breath. Next, tap the *Naohu* with your hands, producing a rustling sound. Visualize wind, thunder, water, and fire erupting to the left and right. I then conceal the *qi* within the starlight’s heart, forgetting my form and abandoning life, unaware of my whereabouts. Recall my body suddenly transforming into an infant, clad in a crimson floral embroidered cloak, dissolving within. Recite:\n\n\"True Perfection transforms, and through transformation returns to the True; water, fire, wind, and thunder command the myriad spirits. Forgetting self and life-and-death, I penetrate the knowledge of the hidden and obscure. When thought fades and *qi* vanishes in slumber, heaven and earth reverse their phases. By recalling my destination, my body becomes profoundly serene—an embryonic form, fragrant and refined, its benevolent virtue returning to the origin. I transcend the divine and the kalpa’s beginning, merging with primordial chaos.\"\nThis is called *Shesheng Dunzhen* (Nurturing Life and Concealing the True).\n\n**Sixth: Purple Imperial Crimson Chamber Mysterious Mystery Grand Emperor Jade Perfected Supreme Virtue Dao Lord**, who governs the Radiant Jade Mystery Terrace and Six-Flower Cloud Palace.\nWhen ascending the sixth star, face the chart, bow twice, and hold your breath. Visualize the star emitting a dragon, the dragon assuming a pearl’s hue, its numinous light and purple radiance scattering boundlessly. The six stars’ hun-souls and spirit-body join hands in laughter, riding the dragon high into the azure heavens, traversing a path of myriad blossoming hues, ascending to unite with the True of the Empty Cavern’s Non-True.\nBow twice and recite:\n\nSix *qi* vast and surging,\nBecome the Dao, become the Mystery.\nDivine beings are without constancy,\nTransforming and shifting as they act.\nI enter Heavenly One,\nMerging and refining the essence-wheel.\nTen thousand myriad partings and unions,\nEver seizing victory and precedence.\nAscending the Golden Palace in joy,\nFollowing the Imperial Perfected’s simplicity.\nEnveloping yin and yang,\nAgain radiant, again flourishing.\nSages and divine beings—\nAre they emptiness, are they dust?\n\nThis is called *Shezhen Liulong* (Gathering the True and Six Dragons).\n\nWhen the steps and recitations are complete, store the chart in its case, burn incense, and conclude.\n\nThe six stars of the Southern Asterism’s Vermilion Network are the supreme Dao, bestowed upon those perfected ones who attain the Way, soaring through the Jade Purity and the Jade Emperor’s lofty numen.\n\nThe Highest Clarity Cinnabar Flower Purple Spirit Perfected Woman, having first studied under the Red Lord, received this from me within the Vermilion Terrace’s Phoenix Pavilion, between the Cinnabar Jade Celestial Palace.\nThose who practice this will be ranked as Immortal Ministers; those who practice this will become Supreme Perfected Ones.\n\nThe covenant requires six gold pearls and sixty feet of crimson silk to present as offerings to the Southern Asterism, honoring the Six Perfected.\nThose who neglect this will not attain immortality; the Three Officials will examine their souls.\n\nThis is the essence of the supreme Dao, the mother of the true and mysterious.\n\nThe *Tai Shang Fei Bu Nan Dou Tai Wei Yu Jing* (Highest Lord’s Flying Steps of the Southern Dipper and Great Tenuity Jade Scripture) concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上飞步南斗太微玉经 经名：太上飞步南斗太微玉经。 撰人不详，当出於唐宋间。 言飞步南斗六星法术。 一卷。 底本出处：《正统道藏》洞神部本文类。 太上飞步南斗太微玉经 南上太虚真王南岳赤君松子，学道时，来即乘龙驾凤轩，於太微之室药玉琼房也。 偃息朱明，坐荫苦木，消炁於虚，藏神於无，玄精不开以道，为我握固以天。 上清丹华紫灵真女，映曜罗之晖於景霄之外，飞登玉纬，旋行朱纲，招洞阳之真，把南辰之柄，逍遥太微，逸响九清，云回电满，身合杳冥，下观世界。 以赤君金颜淑资，德方行圆，心空无尘，如夜半月，念断离业，如水中莲。 以下教赤君上真高上之道，飞斗丹天足蹑南辰太微玉经。 道言空洞，植根於有无之表，二曜悬精於太虚之间，蔓秀芒於两极之际，赤杲流演，六星丽天，所以大象有物，鸿蒙发源，必自南斗，陶冶烹治成焉。 故六合为匡郭，六仪为鼎器，两仪为水火，盈缩为进退，太一临炉，帝君推策，飞丹九千万岁，三辰布焕，群星纪纲焉。 故天为盖，地为舆，日月为轮，四时为马，巾南辰，佩北斗，建皇极，作万物，是太微妙旨，高真秘言。 南昌丹陵，六星为贵，蹑之者先知真名，然后佩服真形，有履其魂，次蹑其魄，然后登星，往返三周，六辰映形。 行之五年，为上清之真，九年见六真，告其至情，与兆同伦。 十五年手结朱网，坐主万灵，乘六飞龙升乎玉清。 南斗六星真 花阔廉持竟井",
      "translated_text": "*The Supreme Jade Scripture of Soaring Steps to the Southern Dipper and Grand Tenuity*\n\n**Scripture Title:** *The Supreme Jade Scripture of Soaring Steps to the Southern Dipper and Grand Tenuity*. Author unknown, likely composed between the Tang and Song dynasties. It expounds the methods of \"soaring steps\" to the six stars of the Southern Dipper. One fascicle.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, *Section of Divine Writings from the Cavern of Spirits*, category of original texts.\n\n---\n\n*The Supreme Jade Scripture of Soaring Steps to the Southern Dipper and Grand Tenuity*\n\nWhen the Supreme Perfected King of the Great Void of the Southern Summit, the Red Lord of Mount Song (Pine Master), was studying the Dao, he arrived riding a dragon-drawn phoenix chariot to the Jade Chamber of Grand Tenuity within the Palace of Grand Tenuity. Reclining in the Vermilion Brilliance, seated in the shade of the *kumu* tree, he dissolved his *qi* into the void and concealed his spirit in non-being. The Mysterious Essence remained unopened by the Dao, and for me, he grasped the firmament with Heaven.\n\nThe Perfected Maiden of the Vermilion Radiance and Purple Numinosity of Highest Clarity cast the splendor of her gauze-like radiance beyond the luminous heavens. Soaring to the Jade Latitude, she circled the Vermilion Net, summoning the Perfected of Cavernous Yang and grasping the handle of the Southern Asterism. Roaming Grand Tenuity, her harmonious resonance echoed through the Nine Clarities. Clouds revolved and lightning filled the skies; her body merged with the profound obscurity as she gazed down upon the world.\n\nThe Red Lord possessed a golden countenance and refined endowments, his virtue square in action and round in completion. His heart was empty of dust, like the midnight moon; his thoughts severed from karmic deeds, like a lotus in water.\n\nHereafter, she taught the Red Lord the supreme Dao of the Highest Perfected, the *Jade Scripture of Soaring to the Southern Dipper and Treading the Stellar Path of Grand Tenuity*.\n\nThe Dao speaks of the Cavernous Void, its roots planted beyond being and non-being. The two luminaries suspend their essence in the Great Void, their luxuriant splendor spreading between the two poles. The radiant sun flows and evolves; the six stars adorn the heavens. Thus, the great image gives rise to things, and the primordial chaos issues forth its source—necessarily from the Southern Dipper, where the alchemy of refinement and tempering is accomplished.\n\nTherefore, the six directions form the crucible’s frame, the six principles serve as the cauldron’s vessel, the Two Modes become water and fire, and expansion and contraction govern advance and retreat. The Great One presides over the furnace, the Thearch wields the tally, and the flying elixir endures for ninety million years. The Three Luminaries array their brilliance, and the host of stars order the cosmos.\n\nThus, Heaven is the canopy, Earth the chariot, the sun and moon the wheels, the four seasons the steeds. Girded with the Southern Asterism, adorned with the Northern Dipper, one establishes the Imperial Ultimate and creates the myriad things—such is the wondrous purport of Grand Tenuity, the esoteric words of the Highest Perfected.\n\nThe Vermilion Mound of Southern Prosperity holds the six stars in highest esteem. To tread them, one must first know their true names, then wear their true forms. One treads upon their *hun* souls, then steps upon their *po* spirits, and only then ascends the stars. After three circuits of return, the six asterisms reflect one’s form.\n\nPracticing for five years, one becomes a Perfected of Highest Clarity. After nine years, one beholds the Six Perfected and reveals one’s utmost sincerity, becoming of the same rank as the omens. After fifteen years, one weaves the Vermilion Net with one’s hands, presiding over the myriad spirits, and rides the Six Flying Dragons to ascend to Jade Clarity.\n\n**The Six True Stars of the Southern Dipper:**\nFlowery Gate, Expansive Edge, Holding Brilliance, Exhausting Well",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 563,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.206015825271606,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步南斗太微玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "一星符 二星符 三星符 四星符 五星符 六星符 丹书青素，方六寸。 三日、六日、十六日、二十三日、二十六日，南向再拜服之。 祝曰： 太微绿景，真炁洞开，绛珠丹实，贯蒂玉阶，彤光宝宫，龙虎紫文，有无婴儿，朱绣锦裙，腰带玉铃，对御北清，吞芒蹑景，与帝同兴，凤辇虎旗，翊侍真卿，我为道主，亿劫无倾。 又丹书青素，广等六寸，锦囊带心前，飞登行事，凶事悉解，着新净衣。 五星魂名 玦珍珀琳瑛 魂五星，自玦步起，双足至瑛上，往返三过。 存我同登星，有五真人，着朱衣，戴玉冠，形如婴儿，与我俱行。 因垂两手，以二指各捻虎口，叩齿五通，登言曰： 巍峨洞清，南魂五星，流转天维，陆降上灵，丹袍玉颜，谐我携登，神师帝友，离合无形，坐咤仙圣，太极太清，身飞迅呜，四一合明。 步围九尺碧地，以青点星，以黄为纲。 七星魄名",
      "translated_text": "Six Star Talismans—First Star Talisman, Second Star Talisman, Third Star Talisman, Fourth Star Talisman, Fifth Star Talisman, Sixth Star Talisman—are inscribed in cinnabar on azure silk, each six inches square. On the third, sixth, sixteenth, twenty-third, and twenty-sixth days of the lunar month, face south, bow twice, and ingest them. The incantation reads:\n\n*\"Verdant Radiance of the Grand Tenuity, true qi opens in profound clarity. Crimson pearls and cinnabar fruits thread the jade steps’ stem, while vermilion light illumines the treasure palace. Dragon and tiger bear purple script; the Infant of Being and Nonbeing wears a brocade skirt of crimson embroidery, a jade bell girdle at the waist. Facing the Northern Clarity, you swallow awns and tread upon radiance, rising with the Emperor in shared ascent. Phoenix chariots and tiger banners escort the Perfected Ministers; I become the Master of the Dao, unshaken for a billion kalpas.\"*\n\nAgain, inscribe in cinnabar on azure silk, six inches in breadth, and place within a brocade pouch worn over the heart. For flying ascent or conducting affairs, all inauspicious matters dissolve—don fresh, pure garments.\n\n**Names of the Five Stars’ *Hun* Souls:**\nJue, Zhen, Po, Lin, Ying\n\nFor the *hun* souls of the Five Stars, begin stepping from Jue, both feet advancing to Ying, traversing thrice in return. Visualize ascending the stars with five Perfected Ones, clad in vermilion robes and jade crowns, their forms like infants, accompanying you. Then let your hands hang down, pinch the tiger’s mouth with two fingers on each hand, and click the teeth five times. The ascent incantation reads:\n\n*\"Majestic and resplendent, Cavernous Clarity—Five Stars of the Southern *Hun*, revolving through the celestial pivots, descending upon the earth to receive the numinous. Crimson-robed and jade-visaged, they harmonize with me in ascent. Divine teachers and imperial companions, formless in separation or union, seated in marvel among the immortals—Great Ultimate, Great Clarity—my body flies swift as a cry, the Four Ones merging in luminosity.\"*\n\nStep within a nine-foot circle of azure earth, marking the stars with green and the weft with yellow.\n\n**Names of the Seven Stars’ *Po* Souls**",
      "overlap_context": "terisms reflect one’s form.\n\nPracticing for five years, one becomes a Perfected of Highest Clarity. After nine years, one beholds the Six Perfected and reveals one’s utmost sincerity, becoming of the same rank as the omens. After fifteen years, one weaves the Vermilion Net with one’s hands, presiding over the myriad spirits, and rides the Six Flying Dragons to ascend to Jade Clarity.\n\n**The Six True Stars of the Southern Dipper:**\nFlowery Gate, Expansive Edge, Holding Brilliance, Exhausting Well",
      "start_char": 563,
      "end_char": 938,
      "start_sentence": 20,
      "end_sentence": 38,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.860629558563232,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步南斗太微玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "钊镂鉴铿镠镐铺 魄七星，自钊步起，只足至铺，往返三过。 存我登星，有七玉女，着黄衣，顶宝髻，形如婴儿，与我同行。 因举两手，以大指捻三指根纹，叩齿七通，登言曰： 旋朱贯霞，孕光丹灵，七玉女美，媚蔓天精，缜云散丝，黄裳大神，坐神草昧，含引氤氲，与我道枢，灵迈苦尘，金辇大辂，龙衣被身，正坐明堂，卫列万神，扶登七映，调理玉清。 步围九尺碧地，以黄点星，以朱为纲。 每步魂魄时，一星辄祝一名，存一神，后亦如之。 烧香左右。 飞斗六辰之道，约其步之修阻，凡双足一步，不可至星，当缘纲为丁纲，令至星上，双足可也。 双足步星不可及者，复双足缘纲，令只足据纲可也。 只足蹑也，双足步也，蹑纲也。 蹈星纲空，位为仙王。 六星秘讳 朱光帝尧昌明 此六星秘讳，知之神仙。 临星忆之，开洞房之光，禁万天之正炁。 第一宝光玉玄上真道君，治丹玉琼华药阙。 初登第一星时，脱履席外，先前左足，以右足根并前足，右二指捻大拇指根纹，垂左手，三咽气，存玉玄上真道君，着丹锦朱袍，状如婴儿，在天星药阙中，口吐紫炁，注我百骸，焕然金光，与空等无异色，我当忘形祝曰： 焕然太极，神光流金，丹华紫阙，上上高尊，化玉孩子，开我金门，紫霄 郁回，洞焕九清，渺冥虚观，恍惚忘形，主生帝宫，为至道根。 右名曰谒星玉玄。 第二丹精玄明宝室上真道君，治七宝药金华阙。 登第二星时，以右手按山源，以左手按两眉之交三九过，闭炁七息，存宝室上真道君，着紫绣羽袍，腰流金铃，状如婴儿，坐丹床，道君两手携南斗六星，如绛弦贯流珠，丹光焕彻，掷入我泥丸中，令定位照我，身神森然，如累目瞳，祝曰： 身浮丹纲，履登神精，宝室真王，呼吸风雷，翻珠揉卿，飞景泥丸，紫黄转回，金房炁宣，俯控亿空，形载飞龙。 右名曰丹精炼生。 第三灵瑶宝曜赤天上真道君，治金洞虹城丹英光阙。 登第三星时，以手掩两耳，俯存我足下，周回五百里，转如车轮，有紫云合沸，如釜中汤声，沸气鼓数百千里雷，星光中有婴儿，无衣，长六分，自星中跳入我口中下．极紫户。 祝曰： 朱烟洞合，星光交缠，黄淫高空，镇制赤天，通我心神，化景玉仙，乘炁涵风，身入玉房，笑辱庶汇，垂裳帝轩，调丹布黄，真宰真君。 右名曰飞真化形。 第四景明碧虚真王天德上真道君，治九灵粹极紫阳朗诀金明玉阙。 登第四星时，垂手左右握，都关目闭炁，登星，存星开如莲花，见道君柔形婴儿，着绿锦宝衣，手柄金钺，坐青玉之猊座，口吐青炁，入我肝中九过，思肝中之气化成宝珠，光流威明，内有童子，巾青帔玄，手援玉琴，其声漻然，透一体内，间关平怡，良久，祝曰： 天魂九灵，火弟木兄，生光滋流，郁葱精明，道君柄钺，童子鼓琴，青烟妙微，熏我神窗，面见紫皇，锡我帝台，虎书金廓，建候北清，金形飞空，神道一冥。 右名曰凝精华童。 第五极真太玄宝仙玉皇太上上真道君，治紫晖霞阳洞神玉阙。 登第五星时，叉手当星跪，叩齿七通，闭炁。 次以手呜脑户，令习习有声，思见风雷水火勃发左右，我因藏气星光之心，忘形弃生，不知所之。 又忆我身忽成婴儿，着朱花绣帔，溶溶於内，祝曰：",
      "translated_text": "With chisel and mirror resounding like chinking metal—*Po* Souls of the Seven Stars—beginning from *Zhao* and stepping to *Pu*, traverse back and forth three times. Visualize yourself ascending the star, where seven jade maidens, clad in yellow robes and crowned with jeweled topknots, their forms like infants, accompany you. Then raise both hands, pressing the thumb to the base of the three fingers, and click the teeth seven times. The ascent incantation reads:\n\n*\"Spinning crimson, threading the rosy clouds, nurturing the radiance of cinnabar spirits—seven jade maidens of beauty, entwining the essence of heaven. Fine clouds disperse like silk; the Yellow-Robed Great Divinity sits in the sacred grass’s obscurity, inhaling and guiding the swirling mists. With me at the Dao’s pivot, the numinous transcends the dust of suffering. The golden chariot and grand carriage, dragon robes draped upon the body—sit upright in the Hall of Brightness, guarded by the myriad spirits. Ascend the Seven Luminaries, attuning to the Jade Clarity.\"*\n\nStep within a nine-foot circle of azure earth, marking the stars with yellow and the weft with vermilion.\n\nAt each step of the *hun* and *po* souls, invoke one star’s name, visualizing one spirit; proceed likewise thereafter. Burn incense to the left and right.\n\nThe Way of the Flying Dipper and Six Celestial Stems measures the length of the steps, whether long or short. For every double step where the feet cannot reach the star, follow the weft as a guiding line to align with the star—this suffices for both feet. If the double step still falls short, let both feet trace the weft until one foot rests upon it. One foot treads, both feet step, treading the weft. Tread the star’s weft and void—this is the station of the Immortal King.\n\n**Secret Names of the Six Stars**\n*Vermilion Radiance, Emperor Yao, Flourishing Brilliance*—these six stars’ secret names grant immortality to those who know them. Recite them while facing the stars to unlock the radiance of the Cavernous Chambers and restrain the primordial *qi* of the myriad heavens.\n\n**First: Precious Radiance, Jade Mystery, Supreme Perfected Dao Lord**, who governs the Elixir Jade and Rosy Flower Palace of Medicinal Alchemy.\nWhen first ascending the first star, remove your shoes outside the mat. Step forward with the left foot, aligning the right heel with the front foot. With the right two fingers, press the base of the thumb, letting the left hand hang. Swallow the *qi* three times, visualizing the Jade Mystery Supreme Perfected Dao Lord, clad in a cinnabar brocade robe, his form like an infant, within the Celestial Star’s Medicinal Palace. His mouth emits purple *qi*, infusing your hundred bones, suffusing you with golden light, indistinguishable from the void. Forgetting your form, recite:\n*\"Resplendent Great Ultimate, divine radiance flowing like gold. Cinnabar splendor of the Purple Palace, supreme and exalted—transforming into a jade child, you open my golden gate. Purple clouds swirl in eddies, illuminating the Nine Clarities. In the vast and obscure, the empty vision, I forget my form in rapture. Master of life in the Emperor’s Palace, root of the supreme Dao.\"*\nThis is called *Yuexing Yuxuan* (Meeting the Star of Jade Mystery).\n\n**Second: Cinnabar Essence, Mystic Brilliance, Precious Chamber Supreme Perfected Dao Lord**, who governs the Seven Treasures and Golden Flower Palace of Medicinal Alchemy.\nWhen ascending the second star, press the *Shanyuan* with the right hand and the space between the brows with the left, thirty-six times. Hold the breath for seven cycles, visualizing the Precious Chamber Supreme Perfected Dao Lord, clad in a purple embroidered feathered robe, golden bells at his waist, his form like an infant, seated upon a cinnabar dais. The Dao Lord holds the Six Stars of the Southern Dipper in his hands, like a crimson thread stringing luminous pearls, their cinnabar radiance blazing through. He casts them into my *Niwan*, fixing their positions to illuminate me. My body’s spirits stand in array, like layers of pupils in the eye. Recite:\n*\"My body floats upon the cinnabar weft, treading the numinous essence. The Precious Chamber’s Perfected King breathes the wind and thunder, rolling pearls and kneading the ministers. Flying light enters the *Niwan*; purple and yellow revolve. The Golden Chamber’s *qi* proclaims—controlling the boundless void, my form rides the flying dragon.\"*\nThis is called *Dan Jing Lian Sheng* (Cinnabar Essence Refining Life).\n\n**Third: Numinous Jade, Precious Radiance, Red Heaven Supreme Perfected Dao Lord**, who governs the Golden Cavern’s Rainbow City and Cinnabar Flower Radiance Palace.\nWhen ascending the third star, cover both ears with your hands. Visualize beneath your feet a circumference of five hundred *li*, revolving like a wheel. Purple clouds churn like boiling water in a cauldron, their bubbling *qi* rumbling like thunder for hundreds of thousands of *li*. Within the starlight appears an infant, unclothed, six *fen* in length, leaping from the star into my mouth and descending to the Purple Chamber. Recite:\n*\"Vermilion mist merges in the cavern; starlight intertwines. Yellow mists pervade the high void, governing the Red Heaven. Connecting my heart and spirit, transforming into a jade immortal. Riding the *qi* and embracing the wind, my body enters the Jade Chamber. Laughing at the myriad beings’ humiliations, I don the imperial robes. Refining cinnabar and spreading yellow—true sovereign, true lord.\"*\nThis is called *Fei Zhen Hua Xing* (Flying Perfection Transforming Form).\n\n**Fourth: Luminous Brilliance, Azure Void Perfected King, Heavenly Virtue Supreme Perfected Dao Lord**, who governs the Nine Spirits’ Essence, Purple Yang’s Bright Secrets, and Golden Brilliance Jade Palace.\nWhen ascending the fourth star, let your hands hang and clasp them to the left and right, closing your eyes and holding your breath. Ascend the star, visualizing it opening like a lotus. Behold the Dao Lord, his form tender like an infant, clad in a green brocade robe, holding a golden battle-axe, seated upon a green jade lion throne. His mouth emits azure *qi*, entering my liver nine times. Envision the *qi* in my liver transforming into a precious pearl, its light flowing with majestic brilliance. Within it is a youth, wearing a black turban and azure cloak, playing a jade zither. Its sound flows smoothly, permeating my entire body, harmonious and serene. After a long while, recite:\n*\"Heavenly soul of the Nine Spirits, fire as younger brother, wood as elder. Radiance flourishes and flows, lush and verdant in essence and clarity. The Dao Lord wields the battle-axe; the youth plays the zither. Azure mist in subtle wonder perfumes my spirit’s window. Facing the Purple Emperor, he bestows upon me the Emperor’s Terrace. Tiger-script in the golden enclosure, establishing my rank in the Northern Clarity. My golden form flies through the void; the spirit’s way unites in obscurity.\"*\nThis is called *Ning Jing Hua Tong* (Congealing Essence and Flower Youth).\n\n**Fifth: Supreme Perfection, Grand Mystery, Precious Immortal, Jade Emperor, Supreme Perfected Dao Lord**, who governs the Purple Radiance and Rosy Yang’s Cavernous Spirit Jade Palace.\nWhen ascending the fifth star, cross your hands before the star and kneel, clicking the teeth seven times and holding your breath. Next, tap the *Naohu* with your hands, producing a rustling sound. Visualize wind, thunder, water, and fire erupting to the left and right. I then conceal the *qi* within the starlight’s heart, forgetting my form and abandoning life, unaware of my whereabouts. Recall my body suddenly transforming into an infant, clad in a crimson floral embroidered cloak, dissolving within. Recite:",
      "overlap_context": "hrough the celestial pivots, descending upon the earth to receive the numinous. Crimson-robed and jade-visaged, they harmonize with me in ascent. Divine teachers and imperial companions, formless in separation or union, seated in marvel among the immortals—Great Ultimate, Great Clarity—my body flies swift as a cry, the Four Ones merging in luminosity.\"*\n\nStep within a nine-foot circle of azure earth, marking the stars with green and the weft with yellow.\n\n**Names of the Seven Stars’ *Po* Souls**",
      "start_char": 938,
      "end_char": 2224,
      "start_sentence": 39,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.435625076293945,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步南斗太微玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "真极亦化，化极归真，水火风雷，役使万灵，忘我生死，彻知幽冥，念失气寐，天地返相，以忆所至，湛然之身，胎形芳雅，仁德回元，超神劫初，与混芒并。 右名曰摄生遁真。 第六紫宸绛房玄玄大帝玉真上德道君，治光玉玄台六华云阙。 登第六星时，正身向图再拜，闭炁，思星出一龙，龙作珠色，灵光紫霞，散照无外，六星魂魄及以神身，携手笑接，乘龙高升碧霄，蕊彩亿万之程，上合空洞无真之真。 再拜祝曰： 六气浩荡，为道为玄，神物无常，随作随迁，我入天一，混化精轮，万万离合，长获胜先，燕登金阙，循简帝真，裹囊阴阳，再光再昌，圣人神人，是空是尘。 右名曰摄真六龙。 步祝都竟，贮图函中，烧香，乃复。 六星南辰朱纲上道，以授高真之得道者，翱翔玉清玉帝高灵。 上清丹华紫灵真女，始学赤君，赤君授我於丹玉琼阙绛台凤轩之间。 行之者位为仙卿，行之者为太上真人矣。 盟用金珠六枚，绛纹六十尺，以贽告南辰，奉礼六真。 慢之者，不得为仙，三官考魂。 此至道之精，真玄之母也。 太上飞步南斗太微玉经竟",
      "translated_text": "\"True Perfection transforms, and through transformation returns to the True; water, fire, wind, and thunder command the myriad spirits. Forgetting self and life-and-death, I penetrate the knowledge of the hidden and obscure. When thought fades and *qi* vanishes in slumber, heaven and earth reverse their phases. By recalling my destination, my body becomes profoundly serene—an embryonic form, fragrant and refined, its benevolent virtue returning to the origin. I transcend the divine and the kalpa’s beginning, merging with primordial chaos.\"\nThis is called *Shesheng Dunzhen* (Nurturing Life and Concealing the True).\n\n**Sixth: Purple Imperial Crimson Chamber Mysterious Mystery Grand Emperor Jade Perfected Supreme Virtue Dao Lord**, who governs the Radiant Jade Mystery Terrace and Six-Flower Cloud Palace.\nWhen ascending the sixth star, face the chart, bow twice, and hold your breath. Visualize the star emitting a dragon, the dragon assuming a pearl’s hue, its numinous light and purple radiance scattering boundlessly. The six stars’ hun-souls and spirit-body join hands in laughter, riding the dragon high into the azure heavens, traversing a path of myriad blossoming hues, ascending to unite with the True of the Empty Cavern’s Non-True.\nBow twice and recite:\n\nSix *qi* vast and surging,\nBecome the Dao, become the Mystery.\nDivine beings are without constancy,\nTransforming and shifting as they act.\nI enter Heavenly One,\nMerging and refining the essence-wheel.\nTen thousand myriad partings and unions,\nEver seizing victory and precedence.\nAscending the Golden Palace in joy,\nFollowing the Imperial Perfected’s simplicity.\nEnveloping yin and yang,\nAgain radiant, again flourishing.\nSages and divine beings—\nAre they emptiness, are they dust?\n\nThis is called *Shezhen Liulong* (Gathering the True and Six Dragons).\n\nWhen the steps and recitations are complete, store the chart in its case, burn incense, and conclude.\n\nThe six stars of the Southern Asterism’s Vermilion Network are the supreme Dao, bestowed upon those perfected ones who attain the Way, soaring through the Jade Purity and the Jade Emperor’s lofty numen.\n\nThe Highest Clarity Cinnabar Flower Purple Spirit Perfected Woman, having first studied under the Red Lord, received this from me within the Vermilion Terrace’s Phoenix Pavilion, between the Cinnabar Jade Celestial Palace.\nThose who practice this will be ranked as Immortal Ministers; those who practice this will become Supreme Perfected Ones.\n\nThe covenant requires six gold pearls and sixty feet of crimson silk to present as offerings to the Southern Asterism, honoring the Six Perfected.\nThose who neglect this will not attain immortality; the Three Officials will examine their souls.\n\nThis is the essence of the supreme Dao, the mother of the true and mysterious.\n\nThe *Tai Shang Fei Bu Nan Dou Tai Wei Yu Jing* (Highest Lord’s Flying Steps of the Southern Dipper and Great Tenuity Jade Scripture) concludes.",
      "overlap_context": "the fifth star, cross your hands before the star and kneel, clicking the teeth seven times and holding your breath. Next, tap the *Naohu* with your hands, producing a rustling sound. Visualize wind, thunder, water, and fire erupting to the left and right. I then conceal the *qi* within the starlight’s heart, forgetting my form and abandoning life, unaware of my whereabouts. Recall my body suddenly transforming into an infant, clad in a crimson floral embroidered cloak, dissolving within. Recite:",
      "start_char": 2224,
      "end_char": 2662,
      "start_sentence": 77,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.219910144805908,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步南斗太微玉经.txt",
        "category": "本文类"
      }
    }
  ]
}