{
  "source_id": "太上混元真录",
  "source_file": "chunked_daozang\\太上混元真录.json",
  "total_chunks": 10,
  "total_original_chars": 10294,
  "total_translated_chars": 59244,
  "total_translation_time": 299.6082532405853,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
    "category": "记传类"
  },
  "full_translation": "*The Supreme Perfection of the Primordial Chaos: A True Record*\n\n**Title:** *The Supreme Perfection of the Primordial Chaos: A True Record*. One scroll. Compiler unknown. Base text from *The Orthodox Daoist Canon*, \"Records and Biographies\" section of the *Dongshen* Department.\n\n*The Supreme Perfection of the Primordial Chaos: A True Record*\n\nDuring the Yin and Zhou dynasties, Lord Lao appeared and withdrew for over one or two hundred years. He regarded the heart as no-heart, the body as no-body, the Great Void as supreme, and preserving the true as treasure. He pondered the mysteries of the Gate of Heavenly Oneness and roamed beyond the Eight Wastelands. Inhaling and exhaling vital qi, he preserved unity with the One Spirit—neither small nor great, neither ugly nor fair—treating glory and rank as transient as straw. Thus, with the heart of no-heart and the body of no-body, he embraced heaven and earth and nurtured the myriad things.\n\nThe heart that is not a heart is vast. The body that is not a body is boundless. These principles are inexhaustible. Drawing from non-action, he enriched the state with the Dao and harmonized the people. Hence, during the reigns of Kings Cheng and Kang, the realm knew peace, and punishments fell into disuse.\n\nWhen King Kang passed, his son Xia ascended as King Zhao. At that time, the Supreme Lord again commanded Lord Lao to enlighten the western lands—India, Yuezhi, Da Qin, Anxi, and Jibin. He bestowed upon King Zhao the esoteric script of the Eight Heavens, yet the king, believing himself to dwell in the course of nature and succeed the qi of the Five Emperors, mastered the workings of yin and yang but did not revere celestial patterns. Knowing the decline of Zhou, Lord Lao withdrew the celestial texts and retired to his homeland, intending to journey toward the Flowing Sands.\n\nAt that time, the western heavens concealed themselves in seclusion. To the north lay a land of extinction, ninety thousand li from Mount Kunlun, called the Land of Endless Extension. Its people stood forty feet tall, lived eight thousand years, and all possessed virtue and power. Lord Lao wished to follow them, speaking of returning to Kunlun.\n\nIn the first year of the Wuji era, on the *renwu* day of the fifth month in the *guichou* year, he harnessed a blue ox to a resplendent chariot and departed westward from Zhou. By then, the royal Way had waned, and governance and instruction had ceased. Thus, Qian Chengshu composed *The Hymn to Lord Lao*, saying:\n\nProfound indeed was the Li clan, to bring forth such a sagely countenance. He delved into the mysteries of the abstruse, uniquely illuminating the subtle and divine. Embracing purity and holding fast to simplicity, he harbored treasures and concealed radiance. Expounding the One and revering antiquity, he served as the model for sages and the teacher of kings. Yet when Zhou declined and the Dao waned, his grand designs could no longer be proclaimed. Like the dragon in the first *nine*, he held aloft his resolve with boundless aspiration. In distant, remote winds, his illustrious reputation was forever transmitted.\n\nXue Daoheng likewise said:\n*\"Though these five peaks be small,\nThis realm of nine provinces is yet too narrow.\nI shall ascend in lofty flight,\nTranscending all in distant wandering.\nThe blue ox is already harnessed,\nThe purple qi arises first.\nThe gates of the Mysterious swing open,\nThe divine transformation flows in secret.\"*\n\n**Discussion:**\nUpon examining the classics and histories, it is found that before the Zhou and Qin dynasties, emperors and feudal lords used no reign titles, referring only to the first year, second year, and so on. Only in the time of Emperor Wen of Han were the titles *Zhongyuan* and *Houyuan* established, and it was during Emperor Wu’s reign that *Yuan Guang* and *Yuan Shuo* were first used. Yet according to the *Great Mystery Classic*, the *Explanations of the Knots*, the *Inner Explanations*, the *Inner Transmission of the Primordial*, and the *Preface to the Dao and Its Virtue*, Lord Lao descended in the first year of *Shanghuang* (a *dingmao* year) to serve as the Zhou’s teacher, and departed westward from Zhou in the first year of *Wuji* (a *guichou* year). This is one instance where Guiguzi, Master Guo, Celestial Master Zhang, and Lord Ge Xuan cited celestial reign titles to correspond with mortal eras. Had they not been true immortals who had attained the Dao, who could have thoroughly investigated such matters? The same applies to reign titles like *Kaihuang*, *Chiming*, *Zhuling*, and *Shanghe*—these are certainly not known to the common world.\n\nSome say that \"departing westward from Zhou\" simply means resigning from office and returning home, after which he secretly crossed the Hangu Pass—it does not mean that while still serving Zhou, he openly journeyed west. At that time, Zhou’s capital was at Feng and Hao, with the pass to its east. Thus, the *Inner Transmission of the Primordial* states: *\"When a sage passes through the capital, the roads are swept and incense burned to await the arrival of the celestial perfected.\"* If Zhou lay east of the pass, then the celestial perfected would be exiting the realm—how could it be called \"entering\"? From this, it becomes even clearer that Lord Lao set forth from Lai Xiang; this is certain.\n\nSome say that \"seeing Zhou’s decline\" refers to the time of King Zhao, when governance and instruction had grown deficient. Yet various scriptures and treatises claim he crossed west during the reigns of Kings You, Li, Ping, or Jing—these are all forced interpretations, deeply mistaken. At that time, Lord Lao, riding in a chariot drawn by a blue ox and crowned with a thin wooden canopy, set forth westward with Master Wuji, Master Guigu, and Master Beiguo. Their path took them through the Hangu Pass, which lay twelve *li* south of Taolin County in Shanzhou, where the ruins of the old pass remain.\n\nThe pass prefect was named Yin Xi, courtesy name Gongwen. His father had fled the tyranny of King Zhou of Shang and secretly traveled to Qinzhou in Tianshui, where he eventually settled. Their ancestors had accumulated virtue and amassed goodness, and their blessings converged upon him, leading to his birth. His mother once dreamed in broad daylight of lightning encircling her body, and a tall figure instructed her to swallow it. Upon waking, her mouth was filled with a lingering sweetness. When he was born, twin beams of light like the sun flew about his side, illuminating the room, then vanished after some time. In his family’s courtyard, lotuses spontaneously bloomed from the earth, their colors vivid and bright. At birth, his eyes held the essence of the sun, his form tall and refined, his arms hanging past his knees, his bearing majestic with the countenance of a celestial being.\n\nFrom youth, he loved studying the ancient classics and the *Book of Changes*, excelling in astronomy and esoteric apocrypha. Gazing upward and peering downward, nothing escaped his penetrating insight—even spirits and gods could not conceal their true forms from him. His magnanimity was extraordinary, and he paid no heed to conventional rites, his joy or sorrow never showing on his face. Embracing the Dao, he wandered freely, harboring the aspiration for distant travel. Later, he indeed traversed mountains and rivers, examining valleys and streams in detail. Wherever he spoke of a place, he knew it would become a site of transcendence. Thus, he built a thatched hut to cultivate the utmost Dao.\n\nWhen King Kang heard of this, he appointed him a grandee. Because he observed the heavens from his thatched hut, his residence was named *Louguan* (\"Lookout Tower\"). Today, on the northern slopes of Mount Zhongnan in Yongzhou, within the boundaries of Zhengzuo County in Wenshan Village, stand the remnants of the thatched hut, the altar of benevolence, and the sacred halls—venerated and protected through the ages, they remain to this day.\n\nAt the time, the pass prefect practiced hidden virtue and sought no fame or recognition. Yet his reputation spread far, and the capital praised him, so he entered the Eastern Palace as a companion to the crown prince. By the time of King Zhao, he saw purple qi advancing westward from the east and knew a sage would soon pass through. Thus, he requested to be appointed prefect of the Hangu Pass. Using astrological signs, he intercepted travelers, saying: *\"The yang numbers are exhausted, the nine stars are aligned, and this year and month together govern ninety days beyond their term. By the law, a sage should pass through the capital.\"* When the time came, he purified himself and meditated on the perfected, ordering the roads to be swept for forty *li* and incense burned along both sides to await the celestial perfected’s entry.\n\nHe had previously instructed the pass guard, Sun Jingyun: *\"If anyone appears in unusual attire, resembling an ancient figure, riding a blue ox and a thin-planked chariot, do not allow them to pass.\"* On the *jiazi* day of the twelfth day of the seventh month in the *guichou* year, Lord Lao indeed arrived at the pass, riding in a white carriage drawn by a blue ox. The guard said: *\"The prefect has given orders—may the venerable one kindly tarry a moment.\"* The guard then entered to report: *\"Just now, an old man of venerable appearance, riding a blue ox and chariot, has come from the east seeking to cross the western pass.\"*\n\nYin Xi said: *\"Good! The Dao has come now—I shall meet the sage!\"* Immediately donning his official seal and sash, he went out to welcome him, offering the rites of a disciple and entreating him: *\"May the venerable one deign to grace us with your presence.\"* Lord Lao declined, saying: *\"I am but a poor, lowly old man, dwelling east of the pass with my fields to the west. I merely wish to gather firewood—why detain me? Pray, allow me to cross. I possess no virtue or power—why do you show such excessive respect? This is most mistaken.\"* Lord Lao spoke thus in humility, testing him further, unwilling to reveal himself at first—this was one trial.\n\nYin Xi bowed again and said: *\"How could the venerable one be gathering firewood? I beg you, deign to stay a while.\"*\n\nLord Lao spoke again: *\"I have heard that in Jambudvīpa there dwells an ancient master, skilled in entering non-action, without end or beginning, eternally abiding in continuity. Thus, I ascended to seek the Dao and passed through this pass. Some say: ‘I have heard that in Da Qin there is an ancient master whose Dao is non-action—hence I go to observe him.’ My path lies beyond here—why falsely detain me?\"* This was the second trial.\n\nYin Xi replied: *\"Now beholding the venerable one’s countenance, your sagely bearing transcends all, for you are the supreme honor of heaven. How could there be any borderland barbarian worth observing? I pray you do not be misled by such words and deign to bestow a measure of compassion.\"* Lord Lao asked again: *\"By what auspicious signs do you recognize me?\"* This was the third trial.\n\nYin Xi answered: *\"Last winter, in the tenth month, the star of Heavenly Reason moved westward past Xu. Now, at the new moon, the harmonious wind has blown thrice, and the true qi of the southeast—shaped like dragons and serpents—has crossed the Han River westward. These are the portents of a true person. From my youth, I have delighted in studying the ancient texts and the *Book of Changes*, gazing upward to observe celestial patterns and downward to examine earthly principles. The responses of wind and clouds have never failed to prove true. Previously, I saw purple qi advancing westward. Since the yang number reaches its utmost at nine, after ninety days, a sage would arrive in humble attire, riding a blue ox and a plain-planked cart from the east to cross the pass. From that time onward, I have longed day and night, dreaming of the true person for so long. Now, beholding the venerable one’s majestic countenance, your sagely bearing surpasses all others—I have never seen the like from youth to age. By what I know, could you not be the true person of highest antiquity?\"*\n\nLord Lao, having passed all three trials, then smiled and said: *\"I knew you cherished the Dao, so I came to test you. You possess the clarity of divine insight—you shall attain deliverance for the age.\"* Some say Lord Lao then gaped in astonishment, his tongue protruding, and exclaimed: *\"Excellent! You know me, and I know you as well.\"* Thus, after three exchanges, he at last advanced toward Yin Xi. Hence the Four Hoary Ones said: *\"Beholding Laozi and Yin Xi, how could one not revere and awaken to the foreknowledge of the Dao? Yet his persistent humble words were meant to instruct the age.\"*\n\nThe Pass Prefect then prepared seating in the official residence, performed the rites of a disciple, and served him facing north. He ordered a grand feast to be prepared and offered to Lord Lao. Lord Lao tested his heart of compassionate giving once more. At that time, there was a debtor named Xu Jia, who was hired for one hundred coins a day. Previously, they had agreed that once Lord Lao reached the Western Sea, Da Qin, or Parthia, he would repay the debt in gold upon his return. When Xu Jia saw Lord Lao about to embark on a distant journey, he doubted he would ever return and withheld his wages. Seduced by a beautiful woman, he then brought a complaint to the Pass Prefect, suing Lord Lao for the money.\n\nLord Lao said to Xu Jia: *\"You have followed me for over two hundred years and owe seven million two hundred thousand coins. Your life should have ended long ago—you have lived until now only because of the Great Mystery Life Talisman I placed within you.\"* As he spoke, the Great Mystery Life Talisman flew from Xu Jia’s mouth and returned before Lord Lao, its script fresh and bright. Xu Jia instantly became a pile of white bones.\n\nSeeing Xu Jia die for his deceitful heart, Yin Xi pitied him and wished to observe whether Lord Lao could revive the dead. He said: *\"I shall repay this debt on his behalf.\"* He then prepared the money and said: *\"I humbly beseech the venerable one to pardon Xu Jia’s past transgressions and grant him new life.\"* Lord Lao, moved by Yin Xi’s compassionate giving, said: *\"Very well.\"* He cast the talisman onto the dry bones, and Xu Jia was restored to life as before.\n\nLord Lao said: *\"I do not blame you. You violated our original agreement, and the Dao naturally departed from you—hence your death. Now I return your money to you.\"* He then dismissed him with courtesy.\n\nAfter two or three trials, Lord Lao saw that the Pass Prefect had passed them all and knew he was certain to attain the Dao. Thus, he stayed at the pass for over a hundred days. The Pass Prefect bowed and said: *\"This latecomer’s knowledge is shallow, my senses dull and obstructed. I have been deluded by the customs of the age, sunk in the allure of sounds and sights. Now, beholding the sage, it is as if the deaf have gained hearing, the blind have gained sight. I offer my body and life—pray, let me hear the great Dao.\"*\n\nLord Lao said: *\"Subtle indeed is your question. The great Dao preserves the true in three grades. Its rule takes oneness as its measure, rectitude as its virtue.\"*\n\nYin Xi asked again: *\"The Dao has three grades—what practice must one follow to ascend as an immortal?\"*\n\nLord Lao said: *\"Take oneness as the number. If you can know the One, all affairs are complete. Seal off passions and desires, enter the inner chamber to refine gold, and ingest qi—this is foremost. If you can know this, guard it and do not lose it.\"*\n\nYin Xi then leapt up, bowed, and asked: *\"How does one refine gold?\"*\n\nLord Lao said: *\"It is the divine method. From the primordial origin of pure emptiness, none fail to attain the Dao through the golden talisman, treading the nine depths to enter the boundless. Above and below, in utter vacuity, they ascend together with the divine luminaries.\"*\n\nYin Xi bowed again and said: *\"I wish to hear it.\"*\n\nLord Lao then transmitted to him the *Taiqing Eight Talismans Classic*, the *Taiqing Observing Heaven Classic*, the *Nine Capitals Classic*, the *Divine Elixir Classic*, the *Golden Liquid Classic*, and the *Formulas for Entering the Nine Cycles of Reverted Elixir and Subduing Fire*. The method stated:\n\n*\"The golden liquid, reverted elixir, flows with immortal radiance,\nSoaring high on clouds, ascending to the celestial mounds.\nThe red and yellow substances form in an instant,\nAnd you shall obtain the intermingled pearls of yin and yang.\nYou may transform and summon the traveling kitchen,\nWith spirit persons and jade maidens as your companions.\nEntering and exiting without question, your tally matches heaven’s.\nIts essence congeals like frost, adept at sinking and floating—\nYou must be startled and awed, for they shall surely come to roam.\"*\n\nThe nine elixirs are:\nFirst, Elixir Radiance;\nSecond, Divine Talisman;\nThird, Divine Elixir;\nFourth, Reverted Elixir;\nFifth, Ingested Elixir;\nSixth, Refined Elixir;\nSeventh, Malleable Elixir;\nEighth, Subdued Elixir;\nNinth, Cold Elixir.\n\nAnother song said:\n*\"Round as three-five, a tenth of an inch.\nMouth four-eight, lips two inches.\nTwo feet long, thickness even.\nBelly threefold aligned, seated warmth enduring.\"*\n\nYin resides above, yang rushes below.\nHead and tail in martial stance, the center in civil grace.\nBeginning at seventy, ending at thirty days.\nWithin, two hundred—skillfully harmonized.\nYin fire is white, yellow sprouts are lead.\nWhen the two gather, they assist and uphold the practitioner.\nDwell in the palace as a child, and you shall abide in peace.\nComing and going in roaming, yet never leaving the gate.\nGradually growing great, your nature becomes pure and refined.\nThen return to the One, reverting to the original source.\nUpon completing one cycle, be most diligent,\nGuard it closely, lest you fall into confusion and darkness.\nThe path is distant, profoundly subtle and mysterious.\nShould you attain this, you shall comprehend heaven and earth.\nAt midnight and noon, govern and purify the po and hun.\nAttain longevity and enter the immortal village.\nThose who delight in the Dao, seek its texts.\nContemplate them deeply—no need for further discourse.\n\nNow, mercury, sal ammoniac, and liquid pearls,\nWhen wrought into divine elixir,\nIf you ingest a single *daogui*,\nYou shall ascend to the celestial palace.\nWith a body made firm by consuming qi,\nYou may attain the rank of immortal.\nIf you desire to become an immortal,\nFirst ingest the Reverted Elixir and Golden Liquid.\nPreserve your spirit, and you shall ascend as an immortal,\nBecoming a perfected one.\nIf you do not ingest the Reverted Elixir and Golden Liquid,\nYour suffering will be in vain.\nStruck by cold and heat, wind and dampness, or demonic qi,\nEven the Controller of Fate cannot save you.\nThe Dao is thus—how can you not strive?\nTemper your clothing, eat sparingly,\nAccord with the body, and guard emptiness.\nIn emptiness and nothingness, you are naturally so—\nEven demons cannot harm you.\nWhen your years and lifespan are exhausted,\nYou shall simply die.\nWhy say this?\nBecause without firmness and spirit, it is so.\nIt is like the growth of the myriad things—\nNot that they seek death,\nBut they naturally wither, decay, and perish.\nHumans are the same.\nI use this to illustrate for you—\nExert yourself to preserve your spirit and refine the elixir,\nAnd take early precautions.\nThose who attain this Dao shall live forever,\nCommanding ghosts and spirits.\nIf one is not the right person,\nEven ten thousand gold pieces shall not be transmitted.\nDo not show it to fools,\nOr those who speak with forked tongues and do not believe,\nLest they slander the divine Dao,\nAnd compound your transgressions.\nDeliverance from the world lies within yourself—\nThere are no ghosts or gods.\n\nAlas!\nThough a walking corpse may be rich and possess all things,\nEven if one is as noble as heaven and king,\nIndulging in desires without restraint,\nOne’s years shall not exceed a hundred—\nReduced to a vessel of clay,\nHow lamentable!\nYet to compound the divine elixir takes but an instant.\nOnce achieved, you become an immortal,\nAnd your fate is bound to heaven.\nIndulge your heart’s desires—\nWhat limit is there to joy?\n\nThe Pass Keeper bowed his head and asked again:\n“How does one consume qi?”\nThe Old Lord replied:\n“Consuming qi consolidates essence,\nReceiving the luminous mystery of the *Xuanjing* and the essential wonders of the Dao.\nEmerging from darkness into light,\nAbove, secure the Cloud Gate;\nBelow, fortify the numinous root.\nLike clouds without feet,\nLike water without roots.\nThe primordial qi is chaotic,\nTransforming into the Great Clarity.\nGrasp and hold it—\nOver time, you shall naturally become numinous.\nKnowing it is easy,\nPracticing it is difficult.\nFor those who cultivate life,\nVirtue is the chariot of form,\nThe Dao is the horse of qi,\nThe hun is rooted in essence,\nThe po is the gate of the eyes.\nWhen form moves, virtue scatters;\nWhen qi strays, the Dao rebels.\nWhen essence dissipates, the hun is harmed;\nWhen the eyes stir, the po is disordered.\nThus, the sage stills the form and seals the breath,\nAccumulates essence and cherishes vision,\nEmpties virtue and the Dao,\nFirmly guards the hun and po.\nWhen form is one, spirit is myriad—\nThe Dao is then accomplished.\nWith the Dao accomplished, transformations occur,\nAnd one faces peril without fear.\nIf you can cultivate this,\nYou shall grasp the great essentials of the Dao.\n\nLife does not come again,\nThus it is guided by qi.\nTreasure qi, and you attain the Dao;\nAttain the Dao, and you endure long.\nSpirit is essence—\nTreasure essence, and spirit becomes luminous;\nSpirit luminous, and you attain long life.\nQi in motion is the Dao,\nEssence preserved is the treasure.\nThe practice of qi is also called refining qi,\nOr the method of long breath.\nLie flat, clench your fists externally,\nRinse the mouth and swallow.\nAfter three swallows, circulate the qi:\nInhale only through the nose,\nExhale only through the mouth.\nGently contract the nose to draw it in,\nDo not fill to the utmost—\nOverfilling makes return difficult.\nWhen first practicing,\nAfter five breaths, one breath may be exhaled.\nWith each exhalation,\nWhen you wish to stop, exhale once.\nCalm the body,\nHarmonize the qi,\nDo not interfere with breathing.\nIf not harmonized, cease;\nWhen harmonized, proceed.\nGuard it without weariness.\nWhen qi arrives and form is at ease,\nThe nose’s breath harmonized,\nPure qi comes.\nWhen you feel the body grow warm,\nAnd warmth brings forth sweat,\nDo not rise—rest and nurture it.\nStrive for longevity,\nAnd the Three Worms shall depart of themselves,\nWith clear intent and vivid imagination.\n\nAt midnight, when the magpie cries,\nPray thus:\n‘In the east, the Azure Sprout—\nConsume the Azure Sprout.\nDrink from the morning blossom,\nThree swallows, then cease.’\n‘In the south, the Vermilion Cinnabar—\nConsume the Vermilion Cinnabar.\nDrink from the Cinnabar Pool,\nThree swallows, then cease.’\n‘In the central wilds,\nGaze upon Mount Tai,\nConsume the primordial qi.\nDrink from the sweet spring,\nThree swallows, then cease.’\n‘In the west, the Bright Stone—\nConsume the Bright Stone.\nDrink from the numinous liquid,\nThree swallows, then cease.’\n‘In the north, the Mysterious Nourishment—\nConsume the Mysterious Nourishment.\nDrink from the Jade Syrup,\nThree swallows, then cease.’\nAfter thirty days of this,\nThe Three Worms shall die,\nThe true spirit and true qi shall naturally settle,\nThe corpse-worm shall no longer return to the heart,\nAnd you shall become an immortal.\n\nThus, I have composed for you the *Jade Record Central Scripture* in three scrolls and fifty-five chapters,\nOriginally stored in the Golden Coffer and Jade Record Bamboo Case of the Supreme Sovereign.\nNow I entrust it to you—\nGuard it well, and do not transmit it recklessly.\n\nIts essentials state:\nThe art of nurturing life lies in severing worldly affairs and simplifying.\nReturn to purity and tranquility,\nNurture the primordial qi.\nHarmonize and accumulate spirit,\nReturn and reflect upon life’s mysteries.\nIf you wish to cultivate the Dao, guard the natural.\nBeware of guiding and pulling, lest you weary your form.\nAvoiding grains and fasting starves your essence.\nThe six jia and yin-yang—do not disturb their balance.\nWhen the heart is wild and the mind chaotic,\nSpirit departs from the body.\nA withered skeleton stands alone,\nReturning to the Yellow Springs.\nDwell in stillness within a dark chamber,\nNurture your spirit.\nRefine your thoughts—\nThe Dao is natural.\n\nThus, according to the *Divine Records*,\nIts discourse states:\nThese three scrolls are the ancestors of primordial qi.\nThey draw from the harmony of the natural—\nTheir essential lies in embracing the One without departure.”\n\nOne Day’s Dao: sated at dawn, hungry at dusk.\nOne Month’s Dao: never lose its waxing and waning.\nOne Year’s Dao: lean in summer, plump in winter.\nA Century’s Dao: moderate grains, eat jujubes.\nA Millennium’s Dao: only sons, no daughters.\nThis is called long life and enduring vision—\nThe Dao has no fixed number.\n\nNext were bestowed the *Scripture of the Natural*, the *Canon of Cyclical Treasuries*, and the *Yellow Court Scripture*,\nContaining the esoteric methods of swallowing qi, ingesting essence, preserving the true, and securing longevity.\nWhen the Keeper of the Pass had received them, he secretly practiced their inner cultivation.\n\nThe Keeper of the Pass again bowed deeply and asked, “May I inquire: what is the Great Dao?”\nThe Old Master said, “Your bones align with the true, your eyes hold the light of the sun, your nape bears a radiant halo,\nYour five viscera bear patterns, your face the seven stars.\nAbove, you mirror the celestial patterns; below, you accord with earthly principles—nothing is lacking.\nThus, you are destined to refine spirit with wisdom, to emerge in the final kalpa,\nAnd become the foremost of the perfected.\nThis is due to the good deeds of your past lives.\nI now transmit to you the Great Dao:\nAbove, it enables you to ascend bodily, transcend the world, become deathless and unborn, attain the supreme truth,\nAnd teach and transform at will, liberating countless generations.\nIn the middle, it allows you to become the teacher of kings;\nBelow, it secures your body, protects your family, and delivers salvation.\nWhen the lives of heavenly beings end, they are transformed and reborn,\nTheir blessings and fortune enduring, all guided into the Dao, returning to the natural.\nDo you not wish to uphold it?”\n\nXi bowed joyfully and said, “Now that I have heard the supreme Dao, I am suddenly enlightened,\nHaving passed through ten thousand kalpas to be reborn—this is truly a destined encounter from past lives.\nI beseech the Heavenly Worthy and Great One to compose a book expounding the meaning of the Great Dao,\nThat I may receive and cultivate it.”\nThe Old Master said, “You are destined to benefit the world, abandon the mundane realm, and propagate the Great Dao.\nYou shall become a divine immortal.”\n\nThereupon, Xi resigned from office, feigning illness,\nAnd on the twenty-fifth day of the twelfth month of that year, he returned to his estate.\nBy the twenty-eighth day, he received the *Five Thousand Characters* at this place.\nThe present Louguan is the former residence of the Grand Master and Keeper of the Pass, Yin.\nThe *Pavilion of Auspicious Qi* and the chariot once ridden by the Old Master remain visible to this day.\n\nThe Old Master said, “The main text of the *Dao De Jing* consists of five thousand words,\nYet within it, the paired eulogies and勢 amount to two scrolls, totaling over five thousand words.\nThus, the *Records of the Grand Historian* states: ‘Laozi expounded over five thousand words to the Keeper of the Pass, elucidating the meaning of Dao and virtue.’\nThe Dao is made manifest through words, yet it transcends words;\nIt is observed through form, yet it transcends form.\nThus, writings cannot exhaust words, nor words exhaust meaning.\nThe intent of the sage is profoundly aligned with the heart of the Great Dao—\nWhat heart does the Great Dao possess? It takes the heart of heaven and humanity as its own.\nThis scripture is pure and true, its exterior and interior pervaded by emptiness and all-encompassing.\nVast and boundless, it embraces the ten directions, heaven and earth, and all things born within it.\nScattered, it is formless; revealed, it bears patterns.\nThus, the sage embodies and models it—its meaning is evident,\nAnd the transformations of the Great Dao are observable.\nThrough images, the imageless is seen; through forms, the formless is perceived.\nBy this scripture, the beginnings of high antiquity may be known.\n\nThis scripture is attended by thirty-six thousand mighty spirits,\nWho guard its celestial and terrestrial symbols—these two scrolls encompass heaven and earth,\nPenetrating even the finest hair’s tip.\nIts eighty-one chapters correspond to the numbers of the nine provinces, the four seas, and heaven and earth,\nThus it can conceal Kunlun within a millet grain.\nThis scripture can still prayers in times of peril and resolve disputes with words.”\n\nXi bowed, received the teachings, and said,\n“Though I am not clever, I shall devote myself to these words.\nThe *Five Thousand Characters* proclaim the origin of Dao and virtue.\nDiligently studying it, one’s voice resonates with the supreme ultimate.\nChanting it afar delights the heavens, and one carries the mystery of the Dao.\nIn tranquil contemplation, one invokes the true, and all wonders converge.\nInwardly observing form and shadow, spirit and qi endure.\nEmbodying Dao and virtue, the myriad spirits submit,\nDisasters vanish in the nine depths, blessings arise in the ten directions,\nNations are pacified, and families secured—who can fathom this?\nThe text of non-action is not defiled by filth, nor adorned by glory,\nNot disturbed by chaos, nor clarified by stillness—it is natural.\nManifesting the Dao, it is transmitted endlessly—this is its constancy.\nPeople of later ages regard the *Dao De Jing* as a Confucian discourse,\nUtterly lacking reverence and devotion—this is a grave error.\nThis scripture originally issued from the Palace of Supreme Emptiness,\nThe ancestor of all scriptures.\nAbove, it illumines the Great Dao; below, it propagates teachings for the age.\nIt cannot be conceived or debated, nor analyzed or explicated.\nThe Supreme Perfected and all immortals recite it ceaselessly—\nHow much more should ordinary people and Daoists?”\n\nThe Keeper of the Pass again bowed deeply and asked,\n“The two scrolls of Dao and virtue mirror heaven and earth.\nIf one wishes to cultivate them inwardly, what is the principle?”\nThe Old Master said, “The Dao is emptiness and the natural.\nVirtue does not dwell on achievements.\nThose who cultivate it ascend to heaven, become perfected ones,\nAttain long life without death—this was prized in high antiquity.”\n\nThe Keeper of the Pass kowtowed and said, “I am guilty, guilty.\nThough I am humble and lowly, I yearn for divine immortality.\nI beg for a single teaching to attain life.”\nThe Old Master said, “Excellent. I shall annotate the *Five Thousand Characters*,\nProviding a sequential and sectioned explanation to transmit to you.\nIts essentials are these:\nThe Dao refers to the *Niwan* (Mud-Pill Palace).\nThe Name refers to the spleen.\nThe Mother refers to the *Dantian* (Cinnabar Field).\nThe *Niwan* is the virtue of heaven, located within the human head.\nPurple qi descends from above to the *Dantian*.\nThe spleen is the Central Yellow Supreme Unity.\nYellow qi lingers there, governing the central palace—its spirit is guarded by the Great White.\nWithin it dwells a single spirit—do not neglect it.\nThe *Dantian* is the Mysterious Female,\nNestled against the spine, residing in the lower origin.\nAt midnight, a single qi descends.”\n\nCircling through the Three Palaces is wondrously called \"guarding emptiness and non-being\"—its alternate names refer to essence.\nFirst is essence, second is sweat, third is fluid, fourth is blood, fifth is mucus, sixth is spittle; thus they are called alternate names.\n\"Mysterious and again mysterious\" refers to the left and right kidneys.\nThe \"gate of all wonders\" means that when a person dies, their qi ceases at the mouth—hence it is called the gate of all wonders.\nIn the morning, one eats fine food; by evening, it becomes excrement—thus it is called foul.\nWhen a person practices the Dao to prepare for death, it is called \"not good.\"\nIn the morning, one performs good deeds; by evening, they turn to evil—thus it is said, \"this is not good.\"\n\"Being and non-being give rise to each other\" refers to the mouth and the belly.\n\"Difficulty and ease complete each other\" refers to essence and qi.\n\"Long and short define each other\" refers to the liver and the lungs.\n\"High and low incline toward each other\" refers to the heart and the kidneys.\n\"Sounds and voices harmonize\" refers to the mouth and ears, the intestines and the stomach.\n\"Before and after follow each other\" refers to the two feet.\n\"Non-action\" means guarding naturalness.\n\"All things arise\" refers to the Six Jia spirits intertwining with the body.\n\"Not departing\" means the Dao moves as one within the body; if it does not move, the body dies—next, it means the mind moves as one.\nThe heart-spirit glows red; qi generates the five colors.\nPassing the Dark Pass, entering the Bright Hall,\nAscending to the Crimson Palace, veiled by the Flowery Canopy,\nDescending toward the Pass of Ultimate Mystery to enter the Purple Palace—thus it is called \"honoring the worthy.\"\nIn youth, qi and vessels are full and abundant, spirit and essence complete—one believes they will live forever.\nYet when the body ages, spirit and brightness all depart—thus it is called \"a treasure hard to obtain.\"\n\"Empty the mind\" means having no thoughts.\n\"Fill the belly\" means constantly closing the breath.\n\"Strengthen the bones\" means not leaking essence.\nThen the upper and lower qi will flow freely, and within the body, all will be ordered.\nSuch are the general principles.\n\nThe Old Master said: “My Dao is profoundly deep and must not be recklessly transmitted.\nThe Dao of life enters and returns; spirit and brightness are all preserved.\nThe hundred joints and orifices, the Six Jia spirits linked,\nWander within the body, interweaving without end.\nEmbryonic breathing guards the center, ascending to connect with heaven—this is called the Great Dao.\nPractice it and become an immortal, ascending to the Great Clarity, honored as a Perfected One.”\n\nThe Pass Keeper bowed his head and said: “Joyfully, I receive your command.\nThe Dao of heaven is weighty; I dare not leak its words.\nI contemplate the Dao Lord, for a moment pitying the common people.”\n\nThe Old Master added: “If you wish to transmit my *Dao and Virtue Classic* and its sectional explanations, you must do so on a *jiazi* day, offering nine thousand gold coins and one bolt each of the five colors of silk. Divide these into four portions, present them at the Yellow Altar, and measure out a *mu* of cinnabar as a covenant. Report to the august spirits above, taking heaven and earth as witness, the sun and moon as pledge. You shall transmit my text, but do not recklessly show it to others.”\n\n“Transmission must not fall to the unworthy—calamity will strike the transgressor, body perishing and name extinguished. Even his descendants will sink into ignominy. Can they not be cautious?\n\nMy Dao is emptiness and spontaneity, mystery and stillness, the guarding of the One. It is not meant for the mediocre. If you seek long life, you must enter deeply and emerge purely. Reduce your food, ingest qi, preserve the Dao, and fix your thoughts on nothingness. Thus your form will never die and endure through ten thousand generations.”\n\nThe Pass Keeper knelt to receive the teaching and thereby attained the Dao of long life.\n\nSome texts speak of slaying a white horse as an oath, but these are spurious interpolations; they are not to be followed.\n\nThe Pass Keeper again bowed his head and said: “The Great Dao is subtle and wondrous, naturally profound and distant. I only hope for enlightenment.”\n\nThereupon, on the Qi-Watching Terrace south of the Pass Keeper’s residence, the Old Lord expounded the *Dao and Virtue Classic*. Its essentials were these:\n\n“I tell you the essentials of the Dao: the Dao is spontaneous. The practitioner can attain it; the hearer can speak of it. The knower does not speak; the speaker does not know. Speech exists to convey sound. Thus we discourse, affirming one another with words. Those who do not know the Dao use words to confuse. Without hearing or speaking, one does not know the source of things. It is like a connoisseur of music who recognizes tones by the strings: his heart knows the sound, but his mouth cannot transmit it. The Dao is profound and subtle; the knower does not speak. Recognizing the sorrow of sound, he turns inward to reflect. Though his heart prompts his mouth to speak, the speaker does not know.\n\nThe Dao’s image has no form or origin; it is evanescent, as if absent yet present. It is like planting a tree: before it sprouts, no branches or leaves are seen. The root unites with earth, water, fire, and wind. The four qi move in their seasons, and the green qi gives life. Earth gathers and congeals, gradually solidifying. It spreads forth in luxuriant growth, its flavors and properties diverse—sweet, bitter, sour, salty, pungent. The qi’s movement varies in strength and weakness, and the fruits are uneven. Though they share a common origin, their names and colors differ, each possessing its own vital principle. From this arise distinct natures and behaviors, and thus they receive form and spirit.\n\nNurturing the Dao of yin and yang, they incline toward what they rely upon as kin. The Dao of life is not of one kind; all beings, human and otherwise, emerge from emptiness and nothingness, stirred to generate spirit. It is like playing music: the hand moves the strings, transmitting gong, shang, jue, zhi, and yu. The breath of qi and the origin of sound arise from body, mouth, and intent. The Dao emerges first from above, its root resting in emptiness and purity. Thus it is said: the Dao is spontaneous.\n\nAll things arise from the Great Simplicity, the primal origin of emptiness and nothingness, the radiant essence of the highest mystery. It is like a ten-thousand-fathom abyss with a gentle spring at its depths. Though faint and murky to the eye, seeing to the bottom is difficult. Dark and obscure, one does not know its source. It is like the departure of the dead: their spirits are not seen. Pure yin harmonizes and unites; yang cannot distinguish its parts. Past and future, what has gone and what is to come—even if one could see ahead, one could not fully comprehend the principle. How then can one know what is lost or preserved?\n\nIt is like one healed of a wound who cannot describe it to others. Playing gong and shang for the deaf, how can they hear? Only those with discernment and wisdom can receive instruction as if spoken directly. Though they claim to grasp the words, their coarse nature cannot express the truth. Thus they lose the root of life and cannot know the origin of the Dao.\n\nI tell you the root of the Dao of life and show you its spontaneity. When all things are born, their natures and behaviors intertwine. Like destruction followed by creation, like death followed by rebirth, they form the five phases. Yin and yang unite, transforming and changing, becoming the essence of things.\n\nI reflect on this Dao, which originates in obscurity. The foolish do not distinguish or understand; they believe themselves born by chance. Without the eye of the Dao, how can you know the spirit of life? False Dao nurtures the form; true Dao nurtures the spirit. When the spirit truly connects with the Dao, it can vanish or endure. The spirit can make the form fly or move mountains. When the form becomes ashes and dust, how can it be recognized?\n\nEars and eyes, sounds and colors—these are your lingering faults. The nose and mouth delight in fragrances and flavors, but these are your foes. The body is the root of affliction: pain, itching, cold, warmth, thoughts, and anxieties—sorrow, poison, worry, and vexation. My attachment to the body is my greatest calamity. Looking to the past and present, who preserves their form intact? Should I still seek to journey afar?”\n\nThe Pass Keeper bowed his head and said: “To ascend to heaven or descend to earth, to climb mountains or cross seas—I will follow you, Master, without fear or taboo.”\n\nThe Old Lord said: “Your Dao is not yet complete. How can you journey afar? You possess accumulated virtue, and thus the Dao is transmitted to you. If you can follow me, simply recite these two chapters. Delve deeply into their myriad subtleties, and your body will enter spontaneity. Only then can I travel with you, ascending to the Nine Heavens to pay homage to my teacher, descending to transform the nations and subdue the malevolent. Now I tell you the essentials of the Dao and reveal its profound words. Diligently cultivate them, and the true Dao will naturally be achieved.\n\nAfter the Dao is achieved, your seven generations of ancestors will be born in lotus blossoms. Heavenly kitchens will provide daily sustenance, and you will naturally fly. Your ears will hear clearly, your eyes will see deeply. You will enter water without drowning, fire without burning. The six penetrations and four attainments will be yours; the true Dao will be complete. Nothing will be beyond your reach—nothing unknown, nothing unattainable. Then you may follow me on distant journeys, observing the transformations of the ten directions, assessing the myriad things. Is this not excellent?\n\nWhen your Dao is about to be achieved, I will come to welcome you. For now, you may not depart. All the Perfected Ones of past kalpas attained the six penetrations through this scripture.”\n\nThe Pass Keeper again bowed his head to receive the command.\n\nOn the eighth day of the fourth month in the *jiayin* year, at the mountain lodge south of his residence, the Old Lord was about to ascend to heaven. He again addressed the Pass Keeper: “You must purify yourself for a thousand days and study my scripture. After three years, go to the Green Sheep Market in Chengdu to seek me, and you will find me.”\n\nHaving spoken, he bowed his head in gratitude. Suddenly, the Old Lord vanished.\n\nIn an instant, the radiant flames coiled and receded, revealing five hues of mysterious yellow. Overjoyed, he rushed into the central courtyard, kowtowing and saying: “I pray the Divine One grant me one more essential teaching, that I may preserve my primordial essence.”\n\nThen, gazing upward, he beheld the Old Lord suspended in midair, seated above the clouds, tens of yards above the earth. His form was like a golden figure, his face radiating the five luminosities. Existence and extinction flickered, youth and age shifted without constancy.\n\nThereupon, nine transcendent immortals of the highest mystery, the five emperors’ direct messengers, and the envoys of the Orthodox Unity, all bearing tablets, came to welcome him. Each emanated a brilliance that illuminated the four directions. Spontaneously transformed, divine kings, mighty warriors, azure dragons, white tigers, qilin, and lions arrayed themselves before and behind, to his left and right.\n\nWitnessing the majesty of heaven, Xi so overwhelmed that he wept in awe, kowtowing as he stood. The Old Lord admonished him: “I have repeatedly exhorted you—guard this well. Dispel defilements, still your thoughts, and with a mind free of contention, preserve the One. When all impurities are removed, all affairs are complete. This is the essential teaching of my Dao.”\n\nHaving spoken, he ascended with the immortals into the Supreme Subtlety. That day, rivers, springs, and pools suddenly surged, well waters overflowed, and mountains and streams trembled. A five-colored light pierced through, and the Supreme Subtlety in the west was suffused with hues of azure and crimson. The grand historian Su You declared: “A great sage has departed; a thousand years hence, his teachings will reach this land.” King Zhao then ordered a stone inscription carved and buried before the southern suburban temple of heaven. This was the omen preceding the Old Lord’s journey west to transform the Hu.\n\nAt that time, the Pass Keeper, deeply moved by the words he had received, wept in longing and remembrance. Claiming illness, he relinquished his post and secluded himself in a quiet chamber.\n\nHe embraced tranquility to contemplate the Dao, his resolve fixed on guarding the One, delving into the root of fundamental nothingness. He dissected the subtle and intricate words of the *Yimi* with meticulous care, yet their inner meaning remained elusive. Then, his mind opened and his intent became clear, and he treasured and practiced them.\n\nOn the first day, in his sleep, he dreamed of flying to the summit of Mount Tai. On the second day, he dreamed of immortals attending him. On the third day, he dreamed of divine radiance. On the fourth day, he dreamed of the world coming to take him as their master and serve him. Through these inner visions and dreams, he understood that the *Five Thousand Characters* contained the Dao, and so he practiced it with purity and clarity.\n\nThe commentary states: According to the *Scripture of Western Ascension*, when the Dao was first revealed in Jambudvīpa, there was an \"Ancient Master\" one might ascend to join—this refers to the admonitions given to the Pass Keeper. The subsequent line, \"The Ancient Master is my own self,\" is precisely the earlier allegory. The essential method for seeking immortality lies in pursuing the true, hence the fictitious reference to an \"Ancient Master\" to whom one might ascend. Yet once the transmission of the Dao was complete, there was no need for further inquiry. Fearing that those who clung to the teachings might fail to grasp the distinction between provisional and ultimate truth, the text thus clarifies in the following passage that it is \"my own self.\" Some say the \"Ancient Master\" is my teacher—this, too, is an allegory. To take it as a factual record is a grave error. For if such a person had truly existed in antiquity, why would he now, in his ascent, appear exactly as he did when first seen there? How could this be called the extinction of the self and the cessation of being? Upon careful consideration, the allegorical reference to a \"teacher\" is evident. Moreover, the \"Nameless\" and the \"Ancient\" are both titles of the Old Lord. Thus, the earlier statement that it is \"my own self\" is confirmed.\n\nSome say he transformed Jambudvīpa and, having long since returned his spirit, now departs. This return to the original source makes clear that his transformations there and here are both the work of a single being, for this return and that origin are not two. Yet fearing that the Dao might remain obscure and that faith and awakening might not run deep, he manifested his numinous power to illuminate the world. By demonstrating his freedom in coming and going and the unparalleled sagely virtue, he sought to awaken true persons and prevent them from growing weary.\n\nYin Zhen said: \"Today, beholding the sagely countenance so transcendent, I see the supreme honor of heaven—how could there be any frontier barbarians?\" These words are subtle indeed.\n\nOn this mountain height, the Pass Keeper had previously built a terrace and lodge to observe the stars and await the qi. When the Old Lord ascended from its midst, later generations called it the \"Tomb of Laozi,\" though it was no tomb at all. As the *Erya* states: \"A great mound is called a *ling*—this is what is meant.\"\n\nThe Old Lord said: \"In practicing the method of preserving the Three Ones, first visualize them between your eyebrows. One inch inward is the Hall of Light, two inches inward is the Cavern Chamber, and three inches inward is the Muddy Pellet—this is the palace of the Upper Cinnabar Field. Within the Upper Cinnabar Field resides a child named Yuanxian, also called the Imperial Minister, three inches in height, clad in red robes and red shoes.\n\nNext, focus on the heart, called the Crimson Palace—this is the Middle Cinnabar Field. Within it dwells a true person named Zidan, also called the Radiant and Firm One, three inches in height, dressed in the same colors as before.\n\nNext, focus three inches below the navel, called the Gate of Destiny—this is the Lower Cinnabar Field. Within it resides an infant named Yuanyang, also called the Valley of Mystery, three inches in height, dressed in the same colors as before.\n\nVisualize them seated beneath a golden forest and jade table, with a golden censer and jade spoon. After stirring the essence, imagine it rising once to the middle, then descending to the left. One hand holds the golden censer and jade spoon at the center, while the other first descends to the right. Feed the essence to the upper infant once, then to the middle infant once, allowing each to drink about ten mouthfuls. Then imagine the upper infant returning to its place, followed by the lower infant, and then cease.\n\nNext, visualize a white qi, vast as a chariot wheel, covering you. Then imagine a red qi covering the white qi, and then you may lie down.\n\nWithin the Cavern Chamber, there is a white qi, large as a chicken’s egg, its light like the moon illuminating all around. These methods should be constantly maintained day and night, for it is said: 'If you desire long life, the Three Ones must be clear. If you can guard the One, the One will guard you.' Whether sitting, moving, walking, entering mountain forests, joining the army, eating, drinking, falling ill, or facing sorrow—guard the One in all things, and no wish will go unfulfilled.\"\n\nThe Old Lord said: \"Essence is the river that flows through the blood and veins, the numinous spirit that guards the bones. When essence departs, the bones wither, and when the bones wither, death follows. Thus, it must be treasured.\n\nThe body is a kingdom, the spirit its ruler, essence its minister, and qi its people. Qi transforms into essence, essence into spirit, and spirit into the infant. The infant ascends to become a true person, and the true person then becomes the child—this is the true One.\n\nHeaven has three luminaries: the sun, moon, and stars. Humans have three treasures: the three Cinnabar Fields. By constantly circulating qi and cherishing essence, the three fields’ treasures and the child are preserved—this is the essential Dao.\n\nIf one can focus solely on the One without forgetfulness, all affairs will be accomplished. He who guards the One may wander heaven and earth without fear. Over time, he will see the thirty-six thousand spirits within his body collectively lift him, ascending to heaven in broad daylight—this is the path of the superior adept. The next level grants extended years and repels evil—this is the path of the middling adept. In times of urgency, if one does not forget the One, one will surely escape disaster—this is the path of the lesser adept.\n\nIn guarding the One, if one encounters nightmares or strange apparitions, one must not speak of them to others. Simply rectify the mind and focus on the One, and no harm will come.\n\nThe One is the sovereign lord of the body. If one can guard the One, the One will guard the person. Entering an army, weapons cannot slay them. Entering mountain forests, no harm will dare approach. Entering rivers and seas, dragons and serpents will avoid them. Entering plague-stricken lands, demonic qi will dissipate. Even when moving, constructing, or traveling, one need not avoid the Tai Sui, the Great General, the eight spirit taboos, or other prohibitions—no misfortune will befall.\n\nThe Old Lord said: 'For those who wish to cultivate the body and nurture nature, practice the Dao and transform form, seek blessings and fulfill wishes, refine qi into spirit, extend years and prolong life, and attain endless beginnings and ends—the essential path is purity and stillness.'\"\n\nThus, heaven governs through stillness, earth stabilizes through stillness, spirits transform through stillness, and humans live through stillness. Therefore, purity enables resonance, and stillness enables response. When about to enter stillness, reverse hearing to listen inward, return vision to observe within the form. The heart does not entertain reckless thoughts, the mouth does not utter reckless words, the body does not make reckless movements. Only then will the color of no-color be seen, the sound of no-sound be heard, the sweetness of no-flavor be tasted, and the reverence of wordless speech be honored. The divine radiance descends, blessings and virtue draw near, and harmonious qi responds. The heart becomes sagely, the mind becomes luminous. Good dreams and auspicious omens appear; by observing signs in dreams, one perceives what has not yet come to pass. If one does not perceive, it is because sincerity has not yet reached its peak—when it does, communion is achieved.\n\nThe Old Lord said: \"If you wish to enter the stillness chamber, always choose an auspicious day. First bathe, fast, and purify yourself for twenty-five days, then you may enter the chamber to refine your body. Only when the hun and po souls within are harmonized may you enter. If the spirits are not in harmony, one becomes restless, agitated within and without, unable to find peace.\"\n\nThus, for the sake of later worthies, I explain these transformations. The Old Lord said: \"When entering the chamber, a cinnabar serpent may come to rest upon your heart. If you are not startled or afraid, it will speak with you as a perfected one. Or you may see the Queen Mother of the West riding a phoenix chariot, followed by six chariots drawn by red dragons, with three vermilion birds preceding her. Do not be alarmed upon seeing her; if she speaks to you, be cautious and do not reply. Should afflictions appear, do not fear them—if they persist, the perfected one will speak on your behalf.\n\nAfter the Queen Mother of the West departs, the Great Dao will come to meet you. When it appears, sun, moon, and stars may be above, or the Heavenly Master and perfected ones may arrive with myriad forms of music—do not look. Immortal maidens and jade women may appear—take care not to gaze upon them. Dragons, serpents, birds, and beasts may approach you—do not be startled. These are all manifestations of the spirits within your form, not real. Simply calm your heart and steady your mind, and these apparitions will depart of their own accord. If an old woman or beings of strange form appear, do not speak with them or engage with them, and all will be auspicious.\n\nAfter twenty-five days in the chamber, two women may come wishing to speak with you—do not converse with them. On the forty-fifth day, a scholar may come wishing to speak with you—do not engage with him. On the sixtieth day, two bright stars will appear above the chamber, lingering for three days—do not be alarmed. On the eighty-fifth day, a white-haired elder riding a white deer will call to you; reply, 'I bear the sins of my ancestors and have not yet attained worthiness.' On the one hundred and fifth day, the Heavenly Master will come to examine the merits of your ancestors; respond, 'Since my forebears, sins have not been exhausted, which is why I refine myself in this chamber.'\n\nOn the one hundred and twenty-fifth day, a thousand chariots and ten thousand riders will appear three hundred paces from the chamber—do not be alarmed. On the one hundred and fiftieth day, evil spirits may impersonate your parents, wife, or children to test you—they are not your true kin. Simply rectify your body, steady your mind, and focus your spirit. After one hundred and eighty days, the chamber will naturally illuminate the safety or peril, survival or demise of the state. Thereafter, the offices and palaces within your body will become fully visible. After two hundred and eighty days, all illnesses and malevolent qi within your form will be expelled, and no evil will afflict you. You will have become a person of the Dao.\n\nThe nine chambers are as follows: The first chamber dispels perverse thoughts, with the Three Spirits guarding it. The Greater Yang resides on the left to instruct, the Greater Yin on the right to assist, and the Supreme Harmony within to benefit. The second chamber rectifies the body’s thoughts, uniting essence and qi to govern. Ghosts and spirits remain outside, observing whether one’s dwelling is upright or not, while the dwelling spirit resides within to assess whether success is possible. The third chamber attains correct thoughts, with essence, qi, ghosts, and spirits all uniting as one. If one dwells amidst the bustle of the world, the spirit resides without—do not be alarmed. The fourth chamber embodies great correctness of thought, where human essence achieves minor union with the spirit. The fifth chamber embodies ultimate correctness of thought, where the true spirit enters within, essence and qi follow, and ghosts and spirits remain outside—only then is departure possible.\n\nThe sixth chamber embodies profound correctness of thought, where spirit and essence are rectified, qi flows correctly, and its place is attained. Thus, qi, ghosts, spirits, and malevolent forces are all expelled. The seventh chamber embodies true correctness of thought, where the Great True Spirit arrives, all evil fears and departs, leaving only the true spirit. The eighth chamber embodies mysterious cavern thought, where body and true spirit unite as one. Day and night, one does not entertain a single worldly thought. The ninth chamber embodies great cavern thought—one has become a perfected person, lying down in the great cavern with the qi, the Dao complete. One presides over the affairs of spirit immortals and no longer comprehends human matters. Be cautious.\n\nThereafter, firmly close the door and take care not to meet with worldly people. Place food outside the door and let it be taken of its own accord. If it is no longer taken, do not let anyone disturb it. One’s appearance will naturally change, and there will be a time to depart.\n\nIn summary: Those who enter the chamber do so with the intent to purify themselves, recite scriptures, ingest medicines, circulate qi, contemplate the true, and refine the spirit—solely to seek the Dao. The more earnest and single-minded one is, the more one can profoundly resonate, transform form, alter countenance, and ascend as an immortal. Those who fail do so because their sincerity is insufficient or cannot be sustained—how could it merely be a matter of secluding the body in a dark chamber?\n\nThe Pass Keeper followed the teachings and cultivated for three years. When his practice was complete, his complexion grew youthful, and his face took on a golden hue—such was the depth of his refinement. After attaining the Dao, he went to Chengdu. By 'Chengdu,' it is meant that his learning of the Dao was complete—this is a metaphorical reference. *The Supreme Record of the Primordial Chaos and the True One* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上混元真录 经名：太上混元真录。 一卷。 编撰者不祥。 底本出处：《正统道藏》洞神部记传类。 太上混元真录 老君在殷周之时，或出或处，凡经一二百余载焉。 每以心为无心，以身为一无身，以太虚为上，存真为宝。 历思天一门之奥，浮游八荒之表。 呼吸生气，与一神相保，无小无大，无丑无好，荣禄代一光，视如刍草。 是故以无心之心、无身一之身，包裹天地，养育万物也。 夫心非．心者，大也。 身非身者，广也。 凡此数者，不可胜也。 取之於无事，故能以道丰国，和柔百姓。 所以成康之际，天下安宁，刑错不用。 康王崩，太子瑕立，是为昭王。 是时太上复命老君开化西域天竺、维卫、大秦、安息、厨宾诸国。 一以八天隐文授於昭王，昭王自谓居自然之运，代五帝之气，错综阴阳之理，不崇天文。 老君知周之衰，乃收天文，因而退官归居故里。 欲往流沙。 其时天西於是隐迟闲居，北有绝灭之国，去昆仑山九十万里，国名长引，其国中一人身长四十尺，寿八千岁，皆有道德。 一欲往从之，言归昆仑。 到无极元年，岁一在癸丑五月壬午，乃爰驾青牛驭晕音盛车，去周西度焉。 其时王道微缺，政教一不行。 故牵成叔《老君颂》曰：",
      "translated_text": "*The Supreme Perfection of the Primordial Chaos: A True Record*\n\n**Title:** *The Supreme Perfection of the Primordial Chaos: A True Record*. One scroll. Compiler unknown. Base text from *The Orthodox Daoist Canon*, \"Records and Biographies\" section of the *Dongshen* Department.\n\n*The Supreme Perfection of the Primordial Chaos: A True Record*\n\nDuring the Yin and Zhou dynasties, Lord Lao appeared and withdrew for over one or two hundred years. He regarded the heart as no-heart, the body as no-body, the Great Void as supreme, and preserving the true as treasure. He pondered the mysteries of the Gate of Heavenly Oneness and roamed beyond the Eight Wastelands. Inhaling and exhaling vital qi, he preserved unity with the One Spirit—neither small nor great, neither ugly nor fair—treating glory and rank as transient as straw. Thus, with the heart of no-heart and the body of no-body, he embraced heaven and earth and nurtured the myriad things.\n\nThe heart that is not a heart is vast. The body that is not a body is boundless. These principles are inexhaustible. Drawing from non-action, he enriched the state with the Dao and harmonized the people. Hence, during the reigns of Kings Cheng and Kang, the realm knew peace, and punishments fell into disuse.\n\nWhen King Kang passed, his son Xia ascended as King Zhao. At that time, the Supreme Lord again commanded Lord Lao to enlighten the western lands—India, Yuezhi, Da Qin, Anxi, and Jibin. He bestowed upon King Zhao the esoteric script of the Eight Heavens, yet the king, believing himself to dwell in the course of nature and succeed the qi of the Five Emperors, mastered the workings of yin and yang but did not revere celestial patterns. Knowing the decline of Zhou, Lord Lao withdrew the celestial texts and retired to his homeland, intending to journey toward the Flowing Sands.\n\nAt that time, the western heavens concealed themselves in seclusion. To the north lay a land of extinction, ninety thousand li from Mount Kunlun, called the Land of Endless Extension. Its people stood forty feet tall, lived eight thousand years, and all possessed virtue and power. Lord Lao wished to follow them, speaking of returning to Kunlun.\n\nIn the first year of the Wuji era, on the *renwu* day of the fifth month in the *guichou* year, he harnessed a blue ox to a resplendent chariot and departed westward from Zhou. By then, the royal Way had waned, and governance and instruction had ceased. Thus, Qian Chengshu composed *The Hymn to Lord Lao*, saying:",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 470,
      "start_sentence": 0,
      "end_sentence": 25,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.931511402130127,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "深哉李氏，诞此圣姿。 研精玄奥，一幽赞神微。 抱质怀素，蕴宝藏晖。 述一而好古，仪圣作师。 周衰道废，厥猷匪宣。 龙潜初九，抗志浩然。 於邈遐风，徽音永传。 薛道衡亦云： 小兹五岳，隘此九州。 逝将高蹈，超然远游。 青牛已驾，紫气先浮。 玄门洞启，神化潜流。 论日：窃按经史，周秦以前帝王诸侯并无年号，皆云元年二年而已。 近至汉文始立中元后元，武帝之时方号元光、元朔。 今据《太玄经》及《节解》、《内解》、《文始内传》、《道德｛经序》并云，老君以上皇元年丁卯下－为周师，到无极元年癸丑去周西度－者，此乃鬼谷子、郭子、张天师、葛仙一公等，引诸天年号以配人问时代者一也。 自非得道真仙，孰能洞究之焉。 亦如开皇、赤明、朱灵、上和等号，固非流俗所知矣。 或云去周西度者，一此正言去周官而归，然后潜度函关．非谓仕周之。 便即公然西适也。 是一时周居丰镐，关在其东，故《文始内传》云：法有圣人，经过京邑。 故扫路烧香，以侯天真入境是也。 若言周在关东，便是天真出境，何谓入境欤？ 由是而论，尤明老君发自濑乡而来，信矣。 或云见周衰者，谓属昭王政化微缺之时也。 而诸经论或云幽、厉、平、敬之时西度者，斯并穿凿，误之深矣。 是时老君浮紫气，乘青牛车，薄版为隆穹，从无极先生、鬼谷先生、北郭先生西迈，道经函谷关。 其关在陕州桃林县南一十二里，有故关墟是也。 关令姓尹名喜，字公文。 其父避纣淫乱，乃潜游秦州天水，因遂家焉。 其先积德累仁，流庆所萃，而乃诞焉。 母氏曾昼寝梦天降电流绕其身，见有长人语令咽之，既觉，口有盈味。 及生时，双光若日，飞游其侧，室内皆明，良久不知所在。 其家堂陆地自生莲华，光色鲜盛。 及诞，眼有日精，姿形长雅，垂臂下膝，堂堂然有天人之貌。 少好学坟索易，善於天文秘纬，仰观俯察莫不洞彻，虽鬼神无以匿其情状。 大度瑰然，不修俗礼，荣戚不形於色。 怀道逍遥，有远游之志。 其后果历涉山水，考详川谷。 卷言此地，知必成真。 乃结草为楼，精思至道。 康王闻之，拜为大夫。 以其因楼观望，故号此宅为楼观。 今之雍州终南山阴，整座县神就乡闻仙里中，有草楼唇坛、仁祠灵宇，历代崇护，于今尚在。 时关令务行阴，不求闻达。 而逸响遐宣，京师美，乃入侍东宫宾友。 至昭王时，瞻见东方紫气西迈，知有圣人当度，乃求出为函谷关令。 以物色而遮之曰：夫阳数尽，九星宿值，今岁月并王复九十日之外，法应有圣人经过京邑。 至期乃斋戒念真，使扫路四十里，夹道烧香，以俟天真入境。 其时先敕关卒孙景云：若有异服古人之状乘青牛薄版车，勿听过关。 其年癸丑七月十二日甲子，果遇老君乘白舆驾青牛而至关。 关吏曰：明府有教，愿大人．少留神。 吏便入白曰：适有一老公丈人之状，乘青牛车，从东来求度西关。 喜日：诺，道今来矣，我得见圣人矣。 即带印绶出迎，设弟子之礼而邀焉。 日：愿大人暂枉神驾。 老君谢曰：吾贫贱老爷耳，居在关东，田在关西，欲往取薪，何故见留，幸相听度。 吾无道德，子焉执敬若斯，谬亦甚矣。 老君故谦辞，聊复试之，未肯以前，此一试也。 喜复稽首曰：大人岂取薪，愿暂留神驾。",
      "translated_text": "Profound indeed was the Li clan, to bring forth such a sagely countenance. He delved into the mysteries of the abstruse, uniquely illuminating the subtle and divine. Embracing purity and holding fast to simplicity, he harbored treasures and concealed radiance. Expounding the One and revering antiquity, he served as the model for sages and the teacher of kings. Yet when Zhou declined and the Dao waned, his grand designs could no longer be proclaimed. Like the dragon in the first *nine*, he held aloft his resolve with boundless aspiration. In distant, remote winds, his illustrious reputation was forever transmitted.\n\nXue Daoheng likewise said:\n*\"Though these five peaks be small,\nThis realm of nine provinces is yet too narrow.\nI shall ascend in lofty flight,\nTranscending all in distant wandering.\nThe blue ox is already harnessed,\nThe purple qi arises first.\nThe gates of the Mysterious swing open,\nThe divine transformation flows in secret.\"*\n\n**Discussion:**\nUpon examining the classics and histories, it is found that before the Zhou and Qin dynasties, emperors and feudal lords used no reign titles, referring only to the first year, second year, and so on. Only in the time of Emperor Wen of Han were the titles *Zhongyuan* and *Houyuan* established, and it was during Emperor Wu’s reign that *Yuan Guang* and *Yuan Shuo* were first used. Yet according to the *Great Mystery Classic*, the *Explanations of the Knots*, the *Inner Explanations*, the *Inner Transmission of the Primordial*, and the *Preface to the Dao and Its Virtue*, Lord Lao descended in the first year of *Shanghuang* (a *dingmao* year) to serve as the Zhou’s teacher, and departed westward from Zhou in the first year of *Wuji* (a *guichou* year). This is one instance where Guiguzi, Master Guo, Celestial Master Zhang, and Lord Ge Xuan cited celestial reign titles to correspond with mortal eras. Had they not been true immortals who had attained the Dao, who could have thoroughly investigated such matters? The same applies to reign titles like *Kaihuang*, *Chiming*, *Zhuling*, and *Shanghe*—these are certainly not known to the common world.\n\nSome say that \"departing westward from Zhou\" simply means resigning from office and returning home, after which he secretly crossed the Hangu Pass—it does not mean that while still serving Zhou, he openly journeyed west. At that time, Zhou’s capital was at Feng and Hao, with the pass to its east. Thus, the *Inner Transmission of the Primordial* states: *\"When a sage passes through the capital, the roads are swept and incense burned to await the arrival of the celestial perfected.\"* If Zhou lay east of the pass, then the celestial perfected would be exiting the realm—how could it be called \"entering\"? From this, it becomes even clearer that Lord Lao set forth from Lai Xiang; this is certain.\n\nSome say that \"seeing Zhou’s decline\" refers to the time of King Zhao, when governance and instruction had grown deficient. Yet various scriptures and treatises claim he crossed west during the reigns of Kings You, Li, Ping, or Jing—these are all forced interpretations, deeply mistaken. At that time, Lord Lao, riding in a chariot drawn by a blue ox and crowned with a thin wooden canopy, set forth westward with Master Wuji, Master Guigu, and Master Beiguo. Their path took them through the Hangu Pass, which lay twelve *li* south of Taolin County in Shanzhou, where the ruins of the old pass remain.\n\nThe pass prefect was named Yin Xi, courtesy name Gongwen. His father had fled the tyranny of King Zhou of Shang and secretly traveled to Qinzhou in Tianshui, where he eventually settled. Their ancestors had accumulated virtue and amassed goodness, and their blessings converged upon him, leading to his birth. His mother once dreamed in broad daylight of lightning encircling her body, and a tall figure instructed her to swallow it. Upon waking, her mouth was filled with a lingering sweetness. When he was born, twin beams of light like the sun flew about his side, illuminating the room, then vanished after some time. In his family’s courtyard, lotuses spontaneously bloomed from the earth, their colors vivid and bright. At birth, his eyes held the essence of the sun, his form tall and refined, his arms hanging past his knees, his bearing majestic with the countenance of a celestial being.\n\nFrom youth, he loved studying the ancient classics and the *Book of Changes*, excelling in astronomy and esoteric apocrypha. Gazing upward and peering downward, nothing escaped his penetrating insight—even spirits and gods could not conceal their true forms from him. His magnanimity was extraordinary, and he paid no heed to conventional rites, his joy or sorrow never showing on his face. Embracing the Dao, he wandered freely, harboring the aspiration for distant travel. Later, he indeed traversed mountains and rivers, examining valleys and streams in detail. Wherever he spoke of a place, he knew it would become a site of transcendence. Thus, he built a thatched hut to cultivate the utmost Dao.\n\nWhen King Kang heard of this, he appointed him a grandee. Because he observed the heavens from his thatched hut, his residence was named *Louguan* (\"Lookout Tower\"). Today, on the northern slopes of Mount Zhongnan in Yongzhou, within the boundaries of Zhengzuo County in Wenshan Village, stand the remnants of the thatched hut, the altar of benevolence, and the sacred halls—venerated and protected through the ages, they remain to this day.\n\nAt the time, the pass prefect practiced hidden virtue and sought no fame or recognition. Yet his reputation spread far, and the capital praised him, so he entered the Eastern Palace as a companion to the crown prince. By the time of King Zhao, he saw purple qi advancing westward from the east and knew a sage would soon pass through. Thus, he requested to be appointed prefect of the Hangu Pass. Using astrological signs, he intercepted travelers, saying: *\"The yang numbers are exhausted, the nine stars are aligned, and this year and month together govern ninety days beyond their term. By the law, a sage should pass through the capital.\"* When the time came, he purified himself and meditated on the perfected, ordering the roads to be swept for forty *li* and incense burned along both sides to await the celestial perfected’s entry.\n\nHe had previously instructed the pass guard, Sun Jingyun: *\"If anyone appears in unusual attire, resembling an ancient figure, riding a blue ox and a thin-planked chariot, do not allow them to pass.\"* On the *jiazi* day of the twelfth day of the seventh month in the *guichou* year, Lord Lao indeed arrived at the pass, riding in a white carriage drawn by a blue ox. The guard said: *\"The prefect has given orders—may the venerable one kindly tarry a moment.\"* The guard then entered to report: *\"Just now, an old man of venerable appearance, riding a blue ox and chariot, has come from the east seeking to cross the western pass.\"*\n\nYin Xi said: *\"Good! The Dao has come now—I shall meet the sage!\"* Immediately donning his official seal and sash, he went out to welcome him, offering the rites of a disciple and entreating him: *\"May the venerable one deign to grace us with your presence.\"* Lord Lao declined, saying: *\"I am but a poor, lowly old man, dwelling east of the pass with my fields to the west. I merely wish to gather firewood—why detain me? Pray, allow me to cross. I possess no virtue or power—why do you show such excessive respect? This is most mistaken.\"* Lord Lao spoke thus in humility, testing him further, unwilling to reveal himself at first—this was one trial.\n\nYin Xi bowed again and said: *\"How could the venerable one be gathering firewood? I beg you, deign to stay a while.\"*",
      "overlap_context": "of Endless Extension. Its people stood forty feet tall, lived eight thousand years, and all possessed virtue and power. Lord Lao wished to follow them, speaking of returning to Kunlun.\n\nIn the first year of the Wuji era, on the *renwu* day of the fifth month in the *guichou* year, he harnessed a blue ox to a resplendent chariot and departed westward from Zhou. By then, the royal Way had waned, and governance and instruction had ceased. Thus, Qian Chengshu composed *The Hymn to Lord Lao*, saying:",
      "start_char": 470,
      "end_char": 1701,
      "start_sentence": 26,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.655494689941406,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "老君又日：闻道竺乾有古先生，善入无为，不终不始，永存绵绵。 是以升就道经历关。 或云：吾闻大秦有古先生，其道无为，故往观焉。 路由於此，何妄留耶。 此二试也。 喜又曰：今睹大人之状，圣姿超绝，乃天上极尊。 何边夷之有可往观乎。 愿不惑言，少垂哀愍。 老君又日：子见何祥，乃能知之。 此三试也。 喜答曰：往冬十月天里之星西行过勖，今之朔内融风三至，东南真气状如龙蛇而西渡汉，此真人之征也。 喜少好读坟易，及仰观天文，俯察地理，风云之应未尝不验。 前望见紫气西迈，夫阳数极九，复九十日当有圣人微服乘青牛薄版车从东来度。 自尔已来，夙夜存思，梦想真人有日久矣。 今睹大人容貌瑰然，圣姿超代，喜自少及长未尝所见。 以喜所知，君岂非上古真人者乎。 老君三试之皆过。 乃怡然笑日：吾知子念道，故来相试。 子有神通之明，当得度代也。 或云老君乃鸪然吐舌日：善哉，子之知吾，吾亦知子矣。 如此三反覆，然后从喜而前。 故四皓日：观老氏与尹生，岂不敬悟先机耶。 而照执谦辞者，欲教代耳。 关令於是设坐官舍，行弟子之礼，北面而事之，命作名厨盛饥以进老君焉。 老君复试其慈舍之心。 时有债客姓徐名甲，日雇钱一百。 先与约语，须吾行达西海大秦、安息国，归以黄金顿备钱限。 甲既见老君方欲远游，疑遂不还其直。 因美女诱之，乃举辞诣关令，讼老君求钱。 老君谓甲曰：汝随我已二百余岁，应还七百二十万钱。 汝命早应死，所以常生至今，赖我太玄生符在身耳。 言毕，见太玄生符飞从甲口出，还老君前，文字新明。 甲已成一聚白骨。 喜见甲违心便死，有意愍之，复欲观老君能起死人不。 因日：喜当代还此直。 即具钱来，曰：伏愿大人赦甲往罪，赐其更生。 老君愍喜慈舍，日：善复。 以向符投其枯骨，甲即还生如故。 老君日：吾不责汝，汝负本约，而道自去汝，故致死耳，今还汝钱矣。 因乃礼遣之。 老君既二三试，关令皆度，知其必得道。 乃停关下百有余日焉。 关今稽首日：晚生浅识，耳目滓滞。 迷惑代俗，沈沦声色。 今见圣人，如聋得听，如盲得视。 投身委命，愿闻大道焉。 ．老君曰：微哉，子之问也。 夫大道守真三品，为则以一为度，以正为德也。 又问曰：道有三品，要得升仙，其以何行乎。 老君日：以一为数。 子能知一，万事毕。 闭塞情欲，入奥室炼金，食气为第一。 子能知之，守莫失。 喜於是踊跃稽首，问日：炼金奈何？ 日：神方也。 自玄元清虚，莫不由金符而得道，履九幽而入杳冥。 上下虚无，因神明而俱升。 喜复稽首，日：愿闻之。 老君於是授喜《太清八符经》、《太清观天经》、《九都经》、《神丹经》、《金液经》及《入炼九转还丹伏火之诀》焉。 其方日：金液还丹仙华流，高飞云翔登天丘。 赤黄之物成须臾，当得雄雌纷乱珠。 可以腾变致行厨，灵人玉女我为夫。 出入无问天同符，其精凝霜善沈浮，汝其震惊必来游。 九丹曰：第一曰丹华，第二日神符，第三日神丹，第四曰还丹，第五日饵丹，第六日炼丹，第七日柔丹，第八日伏丹，第九日寒丹。 又歌日：圆三五，寸一分。 口四八，两寸唇。 长二尺，厚薄均。 腹三齐，坐垂温。",
      "translated_text": "Lord Lao spoke again: *\"I have heard that in Jambudvīpa there dwells an ancient master, skilled in entering non-action, without end or beginning, eternally abiding in continuity. Thus, I ascended to seek the Dao and passed through this pass. Some say: ‘I have heard that in Da Qin there is an ancient master whose Dao is non-action—hence I go to observe him.’ My path lies beyond here—why falsely detain me?\"* This was the second trial.\n\nYin Xi replied: *\"Now beholding the venerable one’s countenance, your sagely bearing transcends all, for you are the supreme honor of heaven. How could there be any borderland barbarian worth observing? I pray you do not be misled by such words and deign to bestow a measure of compassion.\"* Lord Lao asked again: *\"By what auspicious signs do you recognize me?\"* This was the third trial.\n\nYin Xi answered: *\"Last winter, in the tenth month, the star of Heavenly Reason moved westward past Xu. Now, at the new moon, the harmonious wind has blown thrice, and the true qi of the southeast—shaped like dragons and serpents—has crossed the Han River westward. These are the portents of a true person. From my youth, I have delighted in studying the ancient texts and the *Book of Changes*, gazing upward to observe celestial patterns and downward to examine earthly principles. The responses of wind and clouds have never failed to prove true. Previously, I saw purple qi advancing westward. Since the yang number reaches its utmost at nine, after ninety days, a sage would arrive in humble attire, riding a blue ox and a plain-planked cart from the east to cross the pass. From that time onward, I have longed day and night, dreaming of the true person for so long. Now, beholding the venerable one’s majestic countenance, your sagely bearing surpasses all others—I have never seen the like from youth to age. By what I know, could you not be the true person of highest antiquity?\"*\n\nLord Lao, having passed all three trials, then smiled and said: *\"I knew you cherished the Dao, so I came to test you. You possess the clarity of divine insight—you shall attain deliverance for the age.\"* Some say Lord Lao then gaped in astonishment, his tongue protruding, and exclaimed: *\"Excellent! You know me, and I know you as well.\"* Thus, after three exchanges, he at last advanced toward Yin Xi. Hence the Four Hoary Ones said: *\"Beholding Laozi and Yin Xi, how could one not revere and awaken to the foreknowledge of the Dao? Yet his persistent humble words were meant to instruct the age.\"*\n\nThe Pass Prefect then prepared seating in the official residence, performed the rites of a disciple, and served him facing north. He ordered a grand feast to be prepared and offered to Lord Lao. Lord Lao tested his heart of compassionate giving once more. At that time, there was a debtor named Xu Jia, who was hired for one hundred coins a day. Previously, they had agreed that once Lord Lao reached the Western Sea, Da Qin, or Parthia, he would repay the debt in gold upon his return. When Xu Jia saw Lord Lao about to embark on a distant journey, he doubted he would ever return and withheld his wages. Seduced by a beautiful woman, he then brought a complaint to the Pass Prefect, suing Lord Lao for the money.\n\nLord Lao said to Xu Jia: *\"You have followed me for over two hundred years and owe seven million two hundred thousand coins. Your life should have ended long ago—you have lived until now only because of the Great Mystery Life Talisman I placed within you.\"* As he spoke, the Great Mystery Life Talisman flew from Xu Jia’s mouth and returned before Lord Lao, its script fresh and bright. Xu Jia instantly became a pile of white bones.\n\nSeeing Xu Jia die for his deceitful heart, Yin Xi pitied him and wished to observe whether Lord Lao could revive the dead. He said: *\"I shall repay this debt on his behalf.\"* He then prepared the money and said: *\"I humbly beseech the venerable one to pardon Xu Jia’s past transgressions and grant him new life.\"* Lord Lao, moved by Yin Xi’s compassionate giving, said: *\"Very well.\"* He cast the talisman onto the dry bones, and Xu Jia was restored to life as before.\n\nLord Lao said: *\"I do not blame you. You violated our original agreement, and the Dao naturally departed from you—hence your death. Now I return your money to you.\"* He then dismissed him with courtesy.\n\nAfter two or three trials, Lord Lao saw that the Pass Prefect had passed them all and knew he was certain to attain the Dao. Thus, he stayed at the pass for over a hundred days. The Pass Prefect bowed and said: *\"This latecomer’s knowledge is shallow, my senses dull and obstructed. I have been deluded by the customs of the age, sunk in the allure of sounds and sights. Now, beholding the sage, it is as if the deaf have gained hearing, the blind have gained sight. I offer my body and life—pray, let me hear the great Dao.\"*\n\nLord Lao said: *\"Subtle indeed is your question. The great Dao preserves the true in three grades. Its rule takes oneness as its measure, rectitude as its virtue.\"*\n\nYin Xi asked again: *\"The Dao has three grades—what practice must one follow to ascend as an immortal?\"*\n\nLord Lao said: *\"Take oneness as the number. If you can know the One, all affairs are complete. Seal off passions and desires, enter the inner chamber to refine gold, and ingest qi—this is foremost. If you can know this, guard it and do not lose it.\"*\n\nYin Xi then leapt up, bowed, and asked: *\"How does one refine gold?\"*\n\nLord Lao said: *\"It is the divine method. From the primordial origin of pure emptiness, none fail to attain the Dao through the golden talisman, treading the nine depths to enter the boundless. Above and below, in utter vacuity, they ascend together with the divine luminaries.\"*\n\nYin Xi bowed again and said: *\"I wish to hear it.\"*\n\nLord Lao then transmitted to him the *Taiqing Eight Talismans Classic*, the *Taiqing Observing Heaven Classic*, the *Nine Capitals Classic*, the *Divine Elixir Classic*, the *Golden Liquid Classic*, and the *Formulas for Entering the Nine Cycles of Reverted Elixir and Subduing Fire*. The method stated:\n\n*\"The golden liquid, reverted elixir, flows with immortal radiance,\nSoaring high on clouds, ascending to the celestial mounds.\nThe red and yellow substances form in an instant,\nAnd you shall obtain the intermingled pearls of yin and yang.\nYou may transform and summon the traveling kitchen,\nWith spirit persons and jade maidens as your companions.\nEntering and exiting without question, your tally matches heaven’s.\nIts essence congeals like frost, adept at sinking and floating—\nYou must be startled and awed, for they shall surely come to roam.\"*\n\nThe nine elixirs are:\nFirst, Elixir Radiance;\nSecond, Divine Talisman;\nThird, Divine Elixir;\nFourth, Reverted Elixir;\nFifth, Ingested Elixir;\nSixth, Refined Elixir;\nSeventh, Malleable Elixir;\nEighth, Subdued Elixir;\nNinth, Cold Elixir.\n\nAnother song said:\n*\"Round as three-five, a tenth of an inch.\nMouth four-eight, lips two inches.\nTwo feet long, thickness even.\nBelly threefold aligned, seated warmth enduring.\"*",
      "overlap_context": "clined, saying: *\"I am but a poor, lowly old man, dwelling east of the pass with my fields to the west. I merely wish to gather firewood—why detain me? Pray, allow me to cross. I possess no virtue or power—why do you show such excessive respect? This is most mistaken.\"* Lord Lao spoke thus in humility, testing him further, unwilling to reveal himself at first—this was one trial.\n\nYin Xi bowed again and said: *\"How could the venerable one be gathering firewood? I beg you, deign to stay a while.\"*",
      "start_char": 1701,
      "end_char": 2901,
      "start_sentence": 85,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.71606755256653,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "阴在上，阳下奔。 首尾武，中问文。 始七十，终三旬。 内二百，善调匀。 阴火白，黄芽铅。 两奏聚，辅翼人。 子处宫，得安存。 来去游，不出门。 渐成大，性精纯。 即归一，还本原。 至一周，甚殷勤，密防护，莫迷昏。 途路远，甚幽玄。 若达此，会乾坤。 子午治，净魄魂。 得长寿，入仙村。 乐道者，寻其文。 谛思之，勿须论。 夫水银、硝砂、液珠，以作神丹，服一刀圭，飞升天宫。 身坚食气，乃得神仙。 汝当欲神仙，当先服还丹金液。 乃存其神，即时升仙，上为真人。 汝不服还丹金液，虚自苦耳。 为寒温、风湿、鬼气所击，司命不能救也。 道之如此，可不勉哉。 汝善温衣少食，适体守虚，虚无自然，鬼亦不能杀也。 年寿尽竟，即自死耳。 何以言之，以其不坚无神故也。 譬犹万物之生，非欲故求死，但自老朽枯槁腐死耳，人亦如此矣。 吾以此喻汝，汝自弩力存神作丹，早自防卫。 得此道者，长生不死，役鬼使神。 苟非其人，万金不传。 不得以示愚人、口是心非不信之人，令讪毁神道，益子之过。 度世在己，无鬼神也。 嗟乎，行尸虽富有，万物贵为天。 王而快意，从欲不满百年，成一器之土，甚可哀哉。 合作神丹，若须臾耳。 一成便仙，与天相毕。 恣心所欲，乐何央乎。 关令稽首，又问日：食气如何？ 老君日：食气固精，受明玄经生道要妙（，出幽入冥。 上固云门，下固灵根。 如云无足，水之无根。 元气混沌，变化太清。 审而握之，久久自灵。 知之甚易，行之甚难矣。 夫修生之人，故德以形为车，道以气为马，魂以精为根，魄以目为户。 形动德散，气越道叛。 精消魂损，目动魄乱。 是以圣人静形闭气，畜精爱视，道德虚疑，魂魄固守。 形一神万，道乃成就。 道成变化，临危不惧。 子能修之，得道大要。 夫生不再来，故导之以气也。 宝气则得道，得道则长久。 神者，精也。 宝精则神明，神明则长生。 气行之则为道也，精存之则为宝也。 行气一名炼气，一名长息法。 正偃外握固，漱口咽之。 三咽行气，鼻但内气，口但出气。 徐缩鼻引之，莫极满，满则难还。 初为之时，人五息已一息可吐也。 每口吐气，欲止辄一吐之。 安其身，和其气，无与息事。 若不和且止，和乃为之，当守之勿倦。 气至形安，鼻息和则清气来。 至自觉形热，热则汗出。 且勿起安养，务欲久久，则三虫自去，意想分明也。 常以夜半鹦呜，祝日：束方青牙，服食青牙。 饮以朝华，三咽止。 南方朱丹，服食朱丹。 饮以丹池，三咽止。 中央之野，仰太山，服元气。 饮以醴泉，三咽止。 西方明石，服食明石。 饮以灵液，三咽止。 北方玄滋，服食玄滋。 饮以玉饴，三咽止。 如此三十日，三虫皆死，正神正气自安定，伏尸不复还心中，子自仙矣。 於是为作《玉历中经》三篇五十五章，本在上皇藏之金匮玉历笋中。 今将付尔，慎勿妄传。 其要日：养生之术，绝俗事约。 归清净，养元气。 和积蓄神，还反生审。 欲修道，守自然。 慎无导引，劳尔形。 辟谷不食，饿子精。 六甲阴阳，勿扰倾。 心狂意乱，神去身。 枯骨独立，归黄泉。 静处冥室，养尔神。 精熟思之，道自然。 故据《神记》。 论日：其三篇，乃元气之祖。 酌自然之和，其要在於抱一而无离矣。",
      "translated_text": "Yin resides above, yang rushes below.\nHead and tail in martial stance, the center in civil grace.\nBeginning at seventy, ending at thirty days.\nWithin, two hundred—skillfully harmonized.\nYin fire is white, yellow sprouts are lead.\nWhen the two gather, they assist and uphold the practitioner.\nDwell in the palace as a child, and you shall abide in peace.\nComing and going in roaming, yet never leaving the gate.\nGradually growing great, your nature becomes pure and refined.\nThen return to the One, reverting to the original source.\nUpon completing one cycle, be most diligent,\nGuard it closely, lest you fall into confusion and darkness.\nThe path is distant, profoundly subtle and mysterious.\nShould you attain this, you shall comprehend heaven and earth.\nAt midnight and noon, govern and purify the po and hun.\nAttain longevity and enter the immortal village.\nThose who delight in the Dao, seek its texts.\nContemplate them deeply—no need for further discourse.\n\nNow, mercury, sal ammoniac, and liquid pearls,\nWhen wrought into divine elixir,\nIf you ingest a single *daogui*,\nYou shall ascend to the celestial palace.\nWith a body made firm by consuming qi,\nYou may attain the rank of immortal.\nIf you desire to become an immortal,\nFirst ingest the Reverted Elixir and Golden Liquid.\nPreserve your spirit, and you shall ascend as an immortal,\nBecoming a perfected one.\nIf you do not ingest the Reverted Elixir and Golden Liquid,\nYour suffering will be in vain.\nStruck by cold and heat, wind and dampness, or demonic qi,\nEven the Controller of Fate cannot save you.\nThe Dao is thus—how can you not strive?\nTemper your clothing, eat sparingly,\nAccord with the body, and guard emptiness.\nIn emptiness and nothingness, you are naturally so—\nEven demons cannot harm you.\nWhen your years and lifespan are exhausted,\nYou shall simply die.\nWhy say this?\nBecause without firmness and spirit, it is so.\nIt is like the growth of the myriad things—\nNot that they seek death,\nBut they naturally wither, decay, and perish.\nHumans are the same.\nI use this to illustrate for you—\nExert yourself to preserve your spirit and refine the elixir,\nAnd take early precautions.\nThose who attain this Dao shall live forever,\nCommanding ghosts and spirits.\nIf one is not the right person,\nEven ten thousand gold pieces shall not be transmitted.\nDo not show it to fools,\nOr those who speak with forked tongues and do not believe,\nLest they slander the divine Dao,\nAnd compound your transgressions.\nDeliverance from the world lies within yourself—\nThere are no ghosts or gods.\n\nAlas!\nThough a walking corpse may be rich and possess all things,\nEven if one is as noble as heaven and king,\nIndulging in desires without restraint,\nOne’s years shall not exceed a hundred—\nReduced to a vessel of clay,\nHow lamentable!\nYet to compound the divine elixir takes but an instant.\nOnce achieved, you become an immortal,\nAnd your fate is bound to heaven.\nIndulge your heart’s desires—\nWhat limit is there to joy?\n\nThe Pass Keeper bowed his head and asked again:\n“How does one consume qi?”\nThe Old Lord replied:\n“Consuming qi consolidates essence,\nReceiving the luminous mystery of the *Xuanjing* and the essential wonders of the Dao.\nEmerging from darkness into light,\nAbove, secure the Cloud Gate;\nBelow, fortify the numinous root.\nLike clouds without feet,\nLike water without roots.\nThe primordial qi is chaotic,\nTransforming into the Great Clarity.\nGrasp and hold it—\nOver time, you shall naturally become numinous.\nKnowing it is easy,\nPracticing it is difficult.\nFor those who cultivate life,\nVirtue is the chariot of form,\nThe Dao is the horse of qi,\nThe hun is rooted in essence,\nThe po is the gate of the eyes.\nWhen form moves, virtue scatters;\nWhen qi strays, the Dao rebels.\nWhen essence dissipates, the hun is harmed;\nWhen the eyes stir, the po is disordered.\nThus, the sage stills the form and seals the breath,\nAccumulates essence and cherishes vision,\nEmpties virtue and the Dao,\nFirmly guards the hun and po.\nWhen form is one, spirit is myriad—\nThe Dao is then accomplished.\nWith the Dao accomplished, transformations occur,\nAnd one faces peril without fear.\nIf you can cultivate this,\nYou shall grasp the great essentials of the Dao.\n\nLife does not come again,\nThus it is guided by qi.\nTreasure qi, and you attain the Dao;\nAttain the Dao, and you endure long.\nSpirit is essence—\nTreasure essence, and spirit becomes luminous;\nSpirit luminous, and you attain long life.\nQi in motion is the Dao,\nEssence preserved is the treasure.\nThe practice of qi is also called refining qi,\nOr the method of long breath.\nLie flat, clench your fists externally,\nRinse the mouth and swallow.\nAfter three swallows, circulate the qi:\nInhale only through the nose,\nExhale only through the mouth.\nGently contract the nose to draw it in,\nDo not fill to the utmost—\nOverfilling makes return difficult.\nWhen first practicing,\nAfter five breaths, one breath may be exhaled.\nWith each exhalation,\nWhen you wish to stop, exhale once.\nCalm the body,\nHarmonize the qi,\nDo not interfere with breathing.\nIf not harmonized, cease;\nWhen harmonized, proceed.\nGuard it without weariness.\nWhen qi arrives and form is at ease,\nThe nose’s breath harmonized,\nPure qi comes.\nWhen you feel the body grow warm,\nAnd warmth brings forth sweat,\nDo not rise—rest and nurture it.\nStrive for longevity,\nAnd the Three Worms shall depart of themselves,\nWith clear intent and vivid imagination.\n\nAt midnight, when the magpie cries,\nPray thus:\n‘In the east, the Azure Sprout—\nConsume the Azure Sprout.\nDrink from the morning blossom,\nThree swallows, then cease.’\n‘In the south, the Vermilion Cinnabar—\nConsume the Vermilion Cinnabar.\nDrink from the Cinnabar Pool,\nThree swallows, then cease.’\n‘In the central wilds,\nGaze upon Mount Tai,\nConsume the primordial qi.\nDrink from the sweet spring,\nThree swallows, then cease.’\n‘In the west, the Bright Stone—\nConsume the Bright Stone.\nDrink from the numinous liquid,\nThree swallows, then cease.’\n‘In the north, the Mysterious Nourishment—\nConsume the Mysterious Nourishment.\nDrink from the Jade Syrup,\nThree swallows, then cease.’\nAfter thirty days of this,\nThe Three Worms shall die,\nThe true spirit and true qi shall naturally settle,\nThe corpse-worm shall no longer return to the heart,\nAnd you shall become an immortal.\n\nThus, I have composed for you the *Jade Record Central Scripture* in three scrolls and fifty-five chapters,\nOriginally stored in the Golden Coffer and Jade Record Bamboo Case of the Supreme Sovereign.\nNow I entrust it to you—\nGuard it well, and do not transmit it recklessly.\n\nIts essentials state:\nThe art of nurturing life lies in severing worldly affairs and simplifying.\nReturn to purity and tranquility,\nNurture the primordial qi.\nHarmonize and accumulate spirit,\nReturn and reflect upon life’s mysteries.\nIf you wish to cultivate the Dao, guard the natural.\nBeware of guiding and pulling, lest you weary your form.\nAvoiding grains and fasting starves your essence.\nThe six jia and yin-yang—do not disturb their balance.\nWhen the heart is wild and the mind chaotic,\nSpirit departs from the body.\nA withered skeleton stands alone,\nReturning to the Yellow Springs.\nDwell in stillness within a dark chamber,\nNurture your spirit.\nRefine your thoughts—\nThe Dao is natural.\n\nThus, according to the *Divine Records*,\nIts discourse states:\nThese three scrolls are the ancestors of primordial qi.\nThey draw from the harmony of the natural—\nTheir essential lies in embracing the One without departure.”",
      "overlap_context": " and floating—\nYou must be startled and awed, for they shall surely come to roam.\"*\n\nThe nine elixirs are:\nFirst, Elixir Radiance;\nSecond, Divine Talisman;\nThird, Divine Elixir;\nFourth, Reverted Elixir;\nFifth, Ingested Elixir;\nSixth, Refined Elixir;\nSeventh, Malleable Elixir;\nEighth, Subdued Elixir;\nNinth, Cold Elixir.\n\nAnother song said:\n*\"Round as three-five, a tenth of an inch.\nMouth four-eight, lips two inches.\nTwo feet long, thickness even.\nBelly threefold aligned, seated warmth enduring.\"*",
      "start_char": 2901,
      "end_char": 4115,
      "start_sentence": 153,
      "end_sentence": 247,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.52874445915222,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "一日之道，朝饱暮饥。 一月之道，不失盛衰。 一岁之道，夏瘦冬肥。 百岁之道，节谷食枣。 千岁之道，独男无女。 是谓长生久视，道莫有数矣。 次授《自然经》、《历藏经》及《黄庭经》，内秘咽气、吞精、存真、固龄之道。 关令受毕，因各秘而内修焉。 关令又稽首曰：敢问大道如何？ 老君曰：子骨相应真，眼有日光，项负圆耀，五藏有文面、有七星。 上象天文，下顺地理，莫不备足。 故寄慧炼神，挺生末劫，当为真人之长也。 此由先代行善故也。 吾今传子大道，上可以举身升遐度世，不死不生，至真无上，欲教化随意自在，度人无量代。 中可以为国王之师，下可安身、全家救护。 天人命终受化更生，福禄久久，咸使入道，反自然也。 尔岂不愿奉之乎。 喜稽首曰：今闻至道豁然，已历万劫而更生，诚宿命之遇也。 愿天尊大人赐为我着书说大道之意，喜得奉而修焉。 老君日：汝应为此宛利天下，弃贤世界，传弘大道。 子神仙者矣．O 喜於是退官托疾，以其年十二月二十五日邀归本第，至二十八日受五千文於斯地矣。 今之楼观即尹大夫关令故宅焉，其望气草楼及老君所乘车今犹在瞩。 老君曰：《道德经》 正文有五千言，然其中配赞语势凡二篇，有五千余言也。 故《 史记》 日：老子为关令说五千余言，申道德之意是也。 夫道因言以明无言，因形以观无形。 故凡书不尽言，言不尽意。 夫圣人之意，则冥符大道之心□ 乎。 大道何心哉，以天人之心为心。 吾此经淳真，表裹洞虚弥纶。 十方广大周备，天地及万物生乎其中。 散则为无形，见则有文章。 故圣人体而则之意可见矣，大道之化可观矣。 因象以见无象，因形以观无形。 此经可以观上古之始则可知矣。 自然有三万六千威神侍卫经文天地两仪象，此二篇大包天地，细入毫端，八十一章当九州四海天地之数备矣，故能藏昆仑於黍米也。 此经可以静祈难、以言辩矣。 喜礼拜受言毕曰：弟子虽不敏，请事斯语矣。 夫五千文宣道德之原，精进研之，则声参太极高上。 遥唱诸天欢乐，则担挈玄人。 静思祈真，则众妙感会。 内观形影，则神气长存。 体洽道德，则万神震伏、祸灭九幽、福生十方、安国宁家，孰能知乎。 无为之文，污之不辱，饰之不荣，扰之不浊，澄之不清，自然也。 应道而见传告无穷，常者也。 末代之人以《道德经》 为儒谈之书，了无复尊恭之礼，大谬之甚也。 此经本出太上虚无之宫，诸经之祖宗。 上以洞明大道，下以敷弘代教，不可思而议也，辩而诂也。 太上众真诵咏不辍，其况凡人乎道士乎。 关令又稽首日：道德二篇，法象天地。 将欲内修，其理如何？ 老君日：夫道者，虚无自然。 德者，不处成功。 修之者升天，位为真人，长生不死，上古所重也。 · 关令叩头曰：死罪，死罪。 喜虽小鄙，贪慕神仙。 乞授一言，得以生活。 老君日：善乃为注五千文。 次第节解以授之焉。 其要日：道者，谓泥丸也。 名者，谓脾也。 母者，谓丹田也。 泥丸者，天德也，理在人头中。 紫气降下，下至丹田。 脾者，中黄太一也。 黄气徘徊，理中宫其神，太白守之。 中有神一，不可不思。 丹田者，玄牝也。 却着脊膂，居下元中。 夜半之时，一气下降。",
      "translated_text": "One Day’s Dao: sated at dawn, hungry at dusk.\nOne Month’s Dao: never lose its waxing and waning.\nOne Year’s Dao: lean in summer, plump in winter.\nA Century’s Dao: moderate grains, eat jujubes.\nA Millennium’s Dao: only sons, no daughters.\nThis is called long life and enduring vision—\nThe Dao has no fixed number.\n\nNext were bestowed the *Scripture of the Natural*, the *Canon of Cyclical Treasuries*, and the *Yellow Court Scripture*,\nContaining the esoteric methods of swallowing qi, ingesting essence, preserving the true, and securing longevity.\nWhen the Keeper of the Pass had received them, he secretly practiced their inner cultivation.\n\nThe Keeper of the Pass again bowed deeply and asked, “May I inquire: what is the Great Dao?”\nThe Old Master said, “Your bones align with the true, your eyes hold the light of the sun, your nape bears a radiant halo,\nYour five viscera bear patterns, your face the seven stars.\nAbove, you mirror the celestial patterns; below, you accord with earthly principles—nothing is lacking.\nThus, you are destined to refine spirit with wisdom, to emerge in the final kalpa,\nAnd become the foremost of the perfected.\nThis is due to the good deeds of your past lives.\nI now transmit to you the Great Dao:\nAbove, it enables you to ascend bodily, transcend the world, become deathless and unborn, attain the supreme truth,\nAnd teach and transform at will, liberating countless generations.\nIn the middle, it allows you to become the teacher of kings;\nBelow, it secures your body, protects your family, and delivers salvation.\nWhen the lives of heavenly beings end, they are transformed and reborn,\nTheir blessings and fortune enduring, all guided into the Dao, returning to the natural.\nDo you not wish to uphold it?”\n\nXi bowed joyfully and said, “Now that I have heard the supreme Dao, I am suddenly enlightened,\nHaving passed through ten thousand kalpas to be reborn—this is truly a destined encounter from past lives.\nI beseech the Heavenly Worthy and Great One to compose a book expounding the meaning of the Great Dao,\nThat I may receive and cultivate it.”\nThe Old Master said, “You are destined to benefit the world, abandon the mundane realm, and propagate the Great Dao.\nYou shall become a divine immortal.”\n\nThereupon, Xi resigned from office, feigning illness,\nAnd on the twenty-fifth day of the twelfth month of that year, he returned to his estate.\nBy the twenty-eighth day, he received the *Five Thousand Characters* at this place.\nThe present Louguan is the former residence of the Grand Master and Keeper of the Pass, Yin.\nThe *Pavilion of Auspicious Qi* and the chariot once ridden by the Old Master remain visible to this day.\n\nThe Old Master said, “The main text of the *Dao De Jing* consists of five thousand words,\nYet within it, the paired eulogies and勢 amount to two scrolls, totaling over five thousand words.\nThus, the *Records of the Grand Historian* states: ‘Laozi expounded over five thousand words to the Keeper of the Pass, elucidating the meaning of Dao and virtue.’\nThe Dao is made manifest through words, yet it transcends words;\nIt is observed through form, yet it transcends form.\nThus, writings cannot exhaust words, nor words exhaust meaning.\nThe intent of the sage is profoundly aligned with the heart of the Great Dao—\nWhat heart does the Great Dao possess? It takes the heart of heaven and humanity as its own.\nThis scripture is pure and true, its exterior and interior pervaded by emptiness and all-encompassing.\nVast and boundless, it embraces the ten directions, heaven and earth, and all things born within it.\nScattered, it is formless; revealed, it bears patterns.\nThus, the sage embodies and models it—its meaning is evident,\nAnd the transformations of the Great Dao are observable.\nThrough images, the imageless is seen; through forms, the formless is perceived.\nBy this scripture, the beginnings of high antiquity may be known.\n\nThis scripture is attended by thirty-six thousand mighty spirits,\nWho guard its celestial and terrestrial symbols—these two scrolls encompass heaven and earth,\nPenetrating even the finest hair’s tip.\nIts eighty-one chapters correspond to the numbers of the nine provinces, the four seas, and heaven and earth,\nThus it can conceal Kunlun within a millet grain.\nThis scripture can still prayers in times of peril and resolve disputes with words.”\n\nXi bowed, received the teachings, and said,\n“Though I am not clever, I shall devote myself to these words.\nThe *Five Thousand Characters* proclaim the origin of Dao and virtue.\nDiligently studying it, one’s voice resonates with the supreme ultimate.\nChanting it afar delights the heavens, and one carries the mystery of the Dao.\nIn tranquil contemplation, one invokes the true, and all wonders converge.\nInwardly observing form and shadow, spirit and qi endure.\nEmbodying Dao and virtue, the myriad spirits submit,\nDisasters vanish in the nine depths, blessings arise in the ten directions,\nNations are pacified, and families secured—who can fathom this?\nThe text of non-action is not defiled by filth, nor adorned by glory,\nNot disturbed by chaos, nor clarified by stillness—it is natural.\nManifesting the Dao, it is transmitted endlessly—this is its constancy.\nPeople of later ages regard the *Dao De Jing* as a Confucian discourse,\nUtterly lacking reverence and devotion—this is a grave error.\nThis scripture originally issued from the Palace of Supreme Emptiness,\nThe ancestor of all scriptures.\nAbove, it illumines the Great Dao; below, it propagates teachings for the age.\nIt cannot be conceived or debated, nor analyzed or explicated.\nThe Supreme Perfected and all immortals recite it ceaselessly—\nHow much more should ordinary people and Daoists?”\n\nThe Keeper of the Pass again bowed deeply and asked,\n“The two scrolls of Dao and virtue mirror heaven and earth.\nIf one wishes to cultivate them inwardly, what is the principle?”\nThe Old Master said, “The Dao is emptiness and the natural.\nVirtue does not dwell on achievements.\nThose who cultivate it ascend to heaven, become perfected ones,\nAttain long life without death—this was prized in high antiquity.”\n\nThe Keeper of the Pass kowtowed and said, “I am guilty, guilty.\nThough I am humble and lowly, I yearn for divine immortality.\nI beg for a single teaching to attain life.”\nThe Old Master said, “Excellent. I shall annotate the *Five Thousand Characters*,\nProviding a sequential and sectioned explanation to transmit to you.\nIts essentials are these:\nThe Dao refers to the *Niwan* (Mud-Pill Palace).\nThe Name refers to the spleen.\nThe Mother refers to the *Dantian* (Cinnabar Field).\nThe *Niwan* is the virtue of heaven, located within the human head.\nPurple qi descends from above to the *Dantian*.\nThe spleen is the Central Yellow Supreme Unity.\nYellow qi lingers there, governing the central palace—its spirit is guarded by the Great White.\nWithin it dwells a single spirit—do not neglect it.\nThe *Dantian* is the Mysterious Female,\nNestled against the spine, residing in the lower origin.\nAt midnight, a single qi descends.”",
      "overlap_context": "o not disturb their balance.\nWhen the heart is wild and the mind chaotic,\nSpirit departs from the body.\nA withered skeleton stands alone,\nReturning to the Yellow Springs.\nDwell in stillness within a dark chamber,\nNurture your spirit.\nRefine your thoughts—\nThe Dao is natural.\n\nThus, according to the *Divine Records*,\nIts discourse states:\nThese three scrolls are the ancestors of primordial qi.\nThey draw from the harmony of the natural—\nTheir essential lies in embracing the One without departure.”",
      "start_char": 4115,
      "end_char": 5328,
      "start_sentence": 248,
      "end_sentence": 316,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.033265590667725,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "周旋三宫，妙谓守虚无也，异名谓精也。 一曰精，二曰汗，三日液，四曰血，五日涕，六日唾，故曰异名。 玄之又玄，谓左右肾也。 众妙之门，人死气绝於口，故日众妙之门。 夫朝食其美，暮为屎，故日恶也。 人行道将以备死，故日不善。 朝为善功暮为恶，故日斯不善已。 有无相生，谓口与腹也。 难易相成，精与气也。 长短相形，肝与肺也。 高下相倾，心与肾也。 音声相和，口与耳、肠与胃也。 先后相随，两足也。 无为之事，谓守自然也。 万物作焉，谓六甲错身也。 不去谓道一行於形中，不行则形死，次谓心行一。 心神赤赤，气生五色。 过幽关，入明堂。 上至绛宫华盖之，下向穷关入紫宫，故曰尚贤。 年少之时，气脉充盛，精神备具，自谓常生。 及至身老，神明皆去，故曰难得之货。 虚其心，谓无所思。 实其腹，谓常闭气。 强其骨，谓不泄精。 则上下气通，身体之中无不理矣。 其例略如此也。 老君日：吾道甚深，不可妄传。 生道入复，神明皆存。 百节关孔，六甲相连。 徘徊身中，错综无端。 胎息守中，上与天连，名日大道。 行之立仙，上升太清，拜为真人。 关令稽首日：喜受命矣。 天道甚重，不敢泄言。 思惟道君，一辰愍元元，老君又日：欲传吾道德经及节解者，当以甲子之日，以金钱九千、五彩各一匹，作四分出黄坛亩丹为约，上告皇灵。 以天地为信，日月为盟。 子传吾文，勿妄示人。",
      "translated_text": "Circling through the Three Palaces is wondrously called \"guarding emptiness and non-being\"—its alternate names refer to essence.\nFirst is essence, second is sweat, third is fluid, fourth is blood, fifth is mucus, sixth is spittle; thus they are called alternate names.\n\"Mysterious and again mysterious\" refers to the left and right kidneys.\nThe \"gate of all wonders\" means that when a person dies, their qi ceases at the mouth—hence it is called the gate of all wonders.\nIn the morning, one eats fine food; by evening, it becomes excrement—thus it is called foul.\nWhen a person practices the Dao to prepare for death, it is called \"not good.\"\nIn the morning, one performs good deeds; by evening, they turn to evil—thus it is said, \"this is not good.\"\n\"Being and non-being give rise to each other\" refers to the mouth and the belly.\n\"Difficulty and ease complete each other\" refers to essence and qi.\n\"Long and short define each other\" refers to the liver and the lungs.\n\"High and low incline toward each other\" refers to the heart and the kidneys.\n\"Sounds and voices harmonize\" refers to the mouth and ears, the intestines and the stomach.\n\"Before and after follow each other\" refers to the two feet.\n\"Non-action\" means guarding naturalness.\n\"All things arise\" refers to the Six Jia spirits intertwining with the body.\n\"Not departing\" means the Dao moves as one within the body; if it does not move, the body dies—next, it means the mind moves as one.\nThe heart-spirit glows red; qi generates the five colors.\nPassing the Dark Pass, entering the Bright Hall,\nAscending to the Crimson Palace, veiled by the Flowery Canopy,\nDescending toward the Pass of Ultimate Mystery to enter the Purple Palace—thus it is called \"honoring the worthy.\"\nIn youth, qi and vessels are full and abundant, spirit and essence complete—one believes they will live forever.\nYet when the body ages, spirit and brightness all depart—thus it is called \"a treasure hard to obtain.\"\n\"Empty the mind\" means having no thoughts.\n\"Fill the belly\" means constantly closing the breath.\n\"Strengthen the bones\" means not leaking essence.\nThen the upper and lower qi will flow freely, and within the body, all will be ordered.\nSuch are the general principles.\n\nThe Old Master said: “My Dao is profoundly deep and must not be recklessly transmitted.\nThe Dao of life enters and returns; spirit and brightness are all preserved.\nThe hundred joints and orifices, the Six Jia spirits linked,\nWander within the body, interweaving without end.\nEmbryonic breathing guards the center, ascending to connect with heaven—this is called the Great Dao.\nPractice it and become an immortal, ascending to the Great Clarity, honored as a Perfected One.”\n\nThe Pass Keeper bowed his head and said: “Joyfully, I receive your command.\nThe Dao of heaven is weighty; I dare not leak its words.\nI contemplate the Dao Lord, for a moment pitying the common people.”\n\nThe Old Master added: “If you wish to transmit my *Dao and Virtue Classic* and its sectional explanations, you must do so on a *jiazi* day, offering nine thousand gold coins and one bolt each of the five colors of silk. Divide these into four portions, present them at the Yellow Altar, and measure out a *mu* of cinnabar as a covenant. Report to the august spirits above, taking heaven and earth as witness, the sun and moon as pledge. You shall transmit my text, but do not recklessly show it to others.”",
      "overlap_context": "n.\nThe Mother refers to the *Dantian* (Cinnabar Field).\nThe *Niwan* is the virtue of heaven, located within the human head.\nPurple qi descends from above to the *Dantian*.\nThe spleen is the Central Yellow Supreme Unity.\nYellow qi lingers there, governing the central palace—its spirit is guarded by the Great White.\nWithin it dwells a single spirit—do not neglect it.\nThe *Dantian* is the Mysterious Female,\nNestled against the spine, residing in the lower origin.\nAt midnight, a single qi descends.”",
      "start_char": 5328,
      "end_char": 5860,
      "start_sentence": 317,
      "end_sentence": 353,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.352210521697998,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "传不得人，殃及其身，身死名灭。 下流子孙，可不慎焉。 吾道虚无自然，玄静守一，非代庸庸之人所当见。 闻子欲长生，务入深出。 节食服气，存道念无。 令形体不死，万代长存。 关令跪受，遂得长生之道焉。 或云杀白马以为誓者，盖伪文，今非取限也。 关令又稽首曰：大道微妙，自然深远，特希开悟耳。 老君乃於关令宅南望气台上，说《 道德经》 。 其要日：告子道要，云道自然。 行者能得，闻者能言。 知者不言，言者不知。 所以言者，以音声相闻。 是以故谈，以言相然。 不知道者，以言相烦。 不闻不言，不知所由然。 譬如知音者，识音以弦，心知其音，口不能传。 道深微妙，知者不言．o 识音声悲，抑音内推。 心令口言，言者不知。 夫道象无形端，恍惚若亡存。 譬如种木，未生时不见枝叶，根合会地水火风，四气时往，绿气为生者，地聚合凝稍坚，敷荣条达，新味异行不等，甜苦酸咸辛，气行有多少，强弱果不均，同出异名色，各自生意因，从是异性行，而有受形神。 含养阴阳道，随所倚为亲，生道非一类，一切人非人，本出於虚无，感激生精神。 譬如起音者，攘弦手动传，宫商角征羽，口气呼吸元，身口意为本，道出上首先，本静在虚净，故日道自然。 俱出於太素，虚无之始端，髻鬃之精光，微妙之上玄。 譬如万丈坑，下有淡流泉，视之甚浊微，彻见底亦难。 窈窈而冥冥，不知所由然。 亦如终者去，不见其灵魂。 淳阴共和合，阳不能显分，过往与甫来，视譬以见前，尚不能了理，安能知亡存。 譬如疮愈者，不能传人言，为聋弹宫商，其人岂能闻。 才辩有其智，受教如语传。 自谓通其辞，情猥不能宣。 是故失生本，焉能知道原。 告子生道本，示子之自然。 至乎万物生，情行相结连。 如坏复成，如灭复生。 以成五行，阴与阳并，展转变化，遂为物精。 吾思是道，本出窈冥。 愚不别知，自谓适生。 子无道眼，安知生灵。 伪道养形，真道养神。 神真通道，能亡能存。 神能飞形，并复移山。 形为灰土，其可识焉。 耳目声色，为子留愆。 鼻口所喜，香味是冤。 身为恼本，痛痒寒温意为形思，愁毒忧烦。 吾拘於身，知为大患。 观古视今，谁存形完。 吾尚白远行耶。 关令稽首日：上天入地，登山渡海。 愿从大人，无所难忌也。 老君曰：子道未成，岂能得远游耶。 子有宿德，以道相传。 子能随我，但诵二篇。 精研万褊，身入自然。 方可与子同游，上登九天谒见吾师，下化诸国摧伏凶草。 今告子道要，诀其微言。 勤能修之，真道自成也。 道成之后，七祖父母皆当生化莲华之中。 天厨日至，自然飞行。 耳洞听，目洞视。 入水不溺，入火不灼。 六通四达，真道既成。 靡不周备，无所不知，无所不能。 乃可从吾远游，观化十方，推度万物，岂不· 善哉。 子道欲成时，自当相迎，今未得去也。 往劫诸真人无不从此经得六通道矣。 关令复稽首受命焉。 老君以甲寅年四月八日於宅南山馆临欲升天，重告关令日：子当千日清斋，修习吾经。 三年之后，往成都市青羊之肆寻吾，乃可得焉。 言讫，关令稽首礼谢，忽然不见。",
      "translated_text": "“Transmission must not fall to the unworthy—calamity will strike the transgressor, body perishing and name extinguished. Even his descendants will sink into ignominy. Can they not be cautious?\n\nMy Dao is emptiness and spontaneity, mystery and stillness, the guarding of the One. It is not meant for the mediocre. If you seek long life, you must enter deeply and emerge purely. Reduce your food, ingest qi, preserve the Dao, and fix your thoughts on nothingness. Thus your form will never die and endure through ten thousand generations.”\n\nThe Pass Keeper knelt to receive the teaching and thereby attained the Dao of long life.\n\nSome texts speak of slaying a white horse as an oath, but these are spurious interpolations; they are not to be followed.\n\nThe Pass Keeper again bowed his head and said: “The Great Dao is subtle and wondrous, naturally profound and distant. I only hope for enlightenment.”\n\nThereupon, on the Qi-Watching Terrace south of the Pass Keeper’s residence, the Old Lord expounded the *Dao and Virtue Classic*. Its essentials were these:\n\n“I tell you the essentials of the Dao: the Dao is spontaneous. The practitioner can attain it; the hearer can speak of it. The knower does not speak; the speaker does not know. Speech exists to convey sound. Thus we discourse, affirming one another with words. Those who do not know the Dao use words to confuse. Without hearing or speaking, one does not know the source of things. It is like a connoisseur of music who recognizes tones by the strings: his heart knows the sound, but his mouth cannot transmit it. The Dao is profound and subtle; the knower does not speak. Recognizing the sorrow of sound, he turns inward to reflect. Though his heart prompts his mouth to speak, the speaker does not know.\n\nThe Dao’s image has no form or origin; it is evanescent, as if absent yet present. It is like planting a tree: before it sprouts, no branches or leaves are seen. The root unites with earth, water, fire, and wind. The four qi move in their seasons, and the green qi gives life. Earth gathers and congeals, gradually solidifying. It spreads forth in luxuriant growth, its flavors and properties diverse—sweet, bitter, sour, salty, pungent. The qi’s movement varies in strength and weakness, and the fruits are uneven. Though they share a common origin, their names and colors differ, each possessing its own vital principle. From this arise distinct natures and behaviors, and thus they receive form and spirit.\n\nNurturing the Dao of yin and yang, they incline toward what they rely upon as kin. The Dao of life is not of one kind; all beings, human and otherwise, emerge from emptiness and nothingness, stirred to generate spirit. It is like playing music: the hand moves the strings, transmitting gong, shang, jue, zhi, and yu. The breath of qi and the origin of sound arise from body, mouth, and intent. The Dao emerges first from above, its root resting in emptiness and purity. Thus it is said: the Dao is spontaneous.\n\nAll things arise from the Great Simplicity, the primal origin of emptiness and nothingness, the radiant essence of the highest mystery. It is like a ten-thousand-fathom abyss with a gentle spring at its depths. Though faint and murky to the eye, seeing to the bottom is difficult. Dark and obscure, one does not know its source. It is like the departure of the dead: their spirits are not seen. Pure yin harmonizes and unites; yang cannot distinguish its parts. Past and future, what has gone and what is to come—even if one could see ahead, one could not fully comprehend the principle. How then can one know what is lost or preserved?\n\nIt is like one healed of a wound who cannot describe it to others. Playing gong and shang for the deaf, how can they hear? Only those with discernment and wisdom can receive instruction as if spoken directly. Though they claim to grasp the words, their coarse nature cannot express the truth. Thus they lose the root of life and cannot know the origin of the Dao.\n\nI tell you the root of the Dao of life and show you its spontaneity. When all things are born, their natures and behaviors intertwine. Like destruction followed by creation, like death followed by rebirth, they form the five phases. Yin and yang unite, transforming and changing, becoming the essence of things.\n\nI reflect on this Dao, which originates in obscurity. The foolish do not distinguish or understand; they believe themselves born by chance. Without the eye of the Dao, how can you know the spirit of life? False Dao nurtures the form; true Dao nurtures the spirit. When the spirit truly connects with the Dao, it can vanish or endure. The spirit can make the form fly or move mountains. When the form becomes ashes and dust, how can it be recognized?\n\nEars and eyes, sounds and colors—these are your lingering faults. The nose and mouth delight in fragrances and flavors, but these are your foes. The body is the root of affliction: pain, itching, cold, warmth, thoughts, and anxieties—sorrow, poison, worry, and vexation. My attachment to the body is my greatest calamity. Looking to the past and present, who preserves their form intact? Should I still seek to journey afar?”\n\nThe Pass Keeper bowed his head and said: “To ascend to heaven or descend to earth, to climb mountains or cross seas—I will follow you, Master, without fear or taboo.”\n\nThe Old Lord said: “Your Dao is not yet complete. How can you journey afar? You possess accumulated virtue, and thus the Dao is transmitted to you. If you can follow me, simply recite these two chapters. Delve deeply into their myriad subtleties, and your body will enter spontaneity. Only then can I travel with you, ascending to the Nine Heavens to pay homage to my teacher, descending to transform the nations and subdue the malevolent. Now I tell you the essentials of the Dao and reveal its profound words. Diligently cultivate them, and the true Dao will naturally be achieved.\n\nAfter the Dao is achieved, your seven generations of ancestors will be born in lotus blossoms. Heavenly kitchens will provide daily sustenance, and you will naturally fly. Your ears will hear clearly, your eyes will see deeply. You will enter water without drowning, fire without burning. The six penetrations and four attainments will be yours; the true Dao will be complete. Nothing will be beyond your reach—nothing unknown, nothing unattainable. Then you may follow me on distant journeys, observing the transformations of the ten directions, assessing the myriad things. Is this not excellent?\n\nWhen your Dao is about to be achieved, I will come to welcome you. For now, you may not depart. All the Perfected Ones of past kalpas attained the six penetrations through this scripture.”\n\nThe Pass Keeper again bowed his head to receive the command.\n\nOn the eighth day of the fourth month in the *jiayin* year, at the mountain lodge south of his residence, the Old Lord was about to ascend to heaven. He again addressed the Pass Keeper: “You must purify yourself for a thousand days and study my scripture. After three years, go to the Green Sheep Market in Chengdu to seek me, and you will find me.”\n\nHaving spoken, he bowed his head in gratitude. Suddenly, the Old Lord vanished.",
      "overlap_context": "d Master added: “If you wish to transmit my *Dao and Virtue Classic* and its sectional explanations, you must do so on a *jiazi* day, offering nine thousand gold coins and one bolt each of the five colors of silk. Divide these into four portions, present them at the Yellow Altar, and measure out a *mu* of cinnabar as a covenant. Report to the august spirits above, taking heaven and earth as witness, the sun and moon as pledge. You shall transmit my text, but do not recklessly show it to others.”",
      "start_char": 5860,
      "end_char": 7031,
      "start_sentence": 354,
      "end_sentence": 425,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.482335805892944,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "斯须绾舍光炎，五色玄黄。 喜出中庭，叩头曰：愿神人复以一见授吾一要，得以守元。 即仰视睹悬身坐空中，云光之上，去地数十丈，其状金人，面放五明。 存亡恍惚，老少无常。 乃有九玄高仙，五帝直符，与正一使者持节来迎，皆身生光明，洞照四方。 自然化生，神王、力士、青龙、白兽、麒麟、狮子列在前后左右。 喜见天威，不觉悲惶，因稽首而立。 老君告曰：吾重诚尔尔，其守焉。 除垢止念，诤心守一。 众垢除，万事毕。 吾道之要也。 言讫，与诸仙升乎太微焉。 其日江河泉池，忽然泛涨。 井水溢出，山川震动。 有五色光入贯，太微褊於西方，尽作青红色。 太史苏由日：有大圣人往，千年外声教及此。 昭王即敕镌石记之，埋於南郊天祠前。 斯即老君欲西化胡之先兆也。 是时关令受言诚深，泣涕追慕。 称疾弃位，独处空闲之室。",
      "translated_text": "In an instant, the radiant flames coiled and receded, revealing five hues of mysterious yellow. Overjoyed, he rushed into the central courtyard, kowtowing and saying: “I pray the Divine One grant me one more essential teaching, that I may preserve my primordial essence.”\n\nThen, gazing upward, he beheld the Old Lord suspended in midair, seated above the clouds, tens of yards above the earth. His form was like a golden figure, his face radiating the five luminosities. Existence and extinction flickered, youth and age shifted without constancy.\n\nThereupon, nine transcendent immortals of the highest mystery, the five emperors’ direct messengers, and the envoys of the Orthodox Unity, all bearing tablets, came to welcome him. Each emanated a brilliance that illuminated the four directions. Spontaneously transformed, divine kings, mighty warriors, azure dragons, white tigers, qilin, and lions arrayed themselves before and behind, to his left and right.\n\nWitnessing the majesty of heaven, Xi so overwhelmed that he wept in awe, kowtowing as he stood. The Old Lord admonished him: “I have repeatedly exhorted you—guard this well. Dispel defilements, still your thoughts, and with a mind free of contention, preserve the One. When all impurities are removed, all affairs are complete. This is the essential teaching of my Dao.”\n\nHaving spoken, he ascended with the immortals into the Supreme Subtlety. That day, rivers, springs, and pools suddenly surged, well waters overflowed, and mountains and streams trembled. A five-colored light pierced through, and the Supreme Subtlety in the west was suffused with hues of azure and crimson. The grand historian Su You declared: “A great sage has departed; a thousand years hence, his teachings will reach this land.” King Zhao then ordered a stone inscription carved and buried before the southern suburban temple of heaven. This was the omen preceding the Old Lord’s journey west to transform the Hu.\n\nAt that time, the Pass Keeper, deeply moved by the words he had received, wept in longing and remembrance. Claiming illness, he relinquished his post and secluded himself in a quiet chamber.",
      "overlap_context": "ture.”\n\nThe Pass Keeper again bowed his head to receive the command.\n\nOn the eighth day of the fourth month in the *jiayin* year, at the mountain lodge south of his residence, the Old Lord was about to ascend to heaven. He again addressed the Pass Keeper: “You must purify yourself for a thousand days and study my scripture. After three years, go to the Green Sheep Market in Chengdu to seek me, and you will find me.”\n\nHaving spoken, he bowed his head in gratitude. Suddenly, the Old Lord vanished.",
      "start_char": 7031,
      "end_char": 7357,
      "start_sentence": 426,
      "end_sentence": 445,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.478063344955444,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "恬淡思道，归志守一，极虚本无。 剖析乙密罗缕妙言，内意不出。 於是心开意达，宝而行之。 其初日之中，寐梦飞往太山之巅，二日梦仙人随而侍之，三日梦有神光，四日梦天下皆来师而事之。 内观梦寐，知五千文之有道，乃清净而行之。 论曰：按《 西升经》 云，开道竺乾有古先生，欲往升就者，诫关尹之言也。 下文云古先生吾之身者，此正前寓言也。 夫希仙之法要在寻真，故假称彼有先生，欲往升就。 然授道既讫，不假析求，恐执教之人不明权实，故於兹下章云吾身是也。 或云古先生吾之师者，亦寓言也。 而或执之以为实录，误之甚矣。 何者，若古有其人，不应今欲升稣一如彼方见在，何谓灭身绝有乎。 以此详之，寓言称师审矣。 况夫无名有古，并是老君之号者欤。 谓前所言吾之身者，信矣。 或云化乎竺乾，久将返神，吾今逝矣。 亦返一原者，盖明化彼化，此俱是一身，此返彼本来无二。 犹恐不明道，力信悟未深。 故显以神通，光烛天下。 将示去来自在，圣德无伦。 用以警发真人，令其不厌。 尹真云：今睹圣姿超绝，乃天上极尊，何边夷之有。 斯言微矣。 此山阜上，关令先立台馆，以瞻星侯气。 老君於中升虚，后人遂呼为老子陵。 盖非坟陵也。 尔雅日、大阜日，陵此之谓矣。 老君日：存三一之法，先存当两眉间。 却入一寸为明堂，二寸为洞房，三寸为泥丸，此上丹田宫也。 上丹田中有赤子，字日元先。 一名帝卿人，长三寸，赤积赤衣赤履。 次思心中名为绛官，此中丹田也。 其中真人，字子丹。 一名光坚人，长三寸，服色同前。 次思脐下三寸为命门宫，此下丹田也。 其中婴儿，字元阳。 一名谷玄人，长三寸，服色同前。 思见下一坐金林玉几，常以金炉玉匕。 搅精讫，思上一来住中，一．左下。 一手持金炉玉匕立在中，一右先。 以精哺上一次，哺中一计，令人得十饮口许。 便思上一还所住，次哺下一次，思下一复还所住讫，便止。 次又思白气如车输，大以自覆。 次思赤气覆白气，讫，便可卧。 又洞房中有白气大如鸡子，光如月照所在。 凡次上法常当昼夜存之，故日：子欲长生，三一当明。 子能守一，一亦守子。 坐亦念一，外亦念一，行亦念一，入山林亦念一，入军念一，饮食念一，有疾念一，有忧念一，无不得愿也。 老君日：夫精，血脉之川流，守骨之灵神，精去则骨枯，骨枯则死。 是以宝也。 人以身为国，神为君，精为臣，气为人也。 气变为精，精变为神，神化为婴儿。 婴儿上为真人，真人然后为赤子，此真一也。 天有三光日月星，人有三宝三丹田也。 常行气爱精则三田宝、赤子存，此其要道也。 若专存一不忘，则万事毕矣。 夫守一者，游行天地无所畏也。 久久可见，见则身中三万六千神共举其身，白日升天，此上士也。 次则延年却恶，中士也。 有急不忘之，必得过脱灾底，下士也。 守一之道，得恶梦及见怪勿以告人，但正心念一，则不为灾害。 夫一者，身之帝君也。 人能守一，一亦守人。 入三军，甲兵不｀能杀之。 入山林，百害不敢犯之。 入江海，蛟龙避之。 入疫疾，鬼气自消。 乃至移徙起工，但当念一不避太岁大将军八神禁忌，及出入来往，终无殃咎焉。 老君日：夫人欲修身养性，行道化形，求福致愿，结气成神，延年益寿，终始无穷者，要当清静。",
      "translated_text": "He embraced tranquility to contemplate the Dao, his resolve fixed on guarding the One, delving into the root of fundamental nothingness. He dissected the subtle and intricate words of the *Yimi* with meticulous care, yet their inner meaning remained elusive. Then, his mind opened and his intent became clear, and he treasured and practiced them.\n\nOn the first day, in his sleep, he dreamed of flying to the summit of Mount Tai. On the second day, he dreamed of immortals attending him. On the third day, he dreamed of divine radiance. On the fourth day, he dreamed of the world coming to take him as their master and serve him. Through these inner visions and dreams, he understood that the *Five Thousand Characters* contained the Dao, and so he practiced it with purity and clarity.\n\nThe commentary states: According to the *Scripture of Western Ascension*, when the Dao was first revealed in Jambudvīpa, there was an \"Ancient Master\" one might ascend to join—this refers to the admonitions given to the Pass Keeper. The subsequent line, \"The Ancient Master is my own self,\" is precisely the earlier allegory. The essential method for seeking immortality lies in pursuing the true, hence the fictitious reference to an \"Ancient Master\" to whom one might ascend. Yet once the transmission of the Dao was complete, there was no need for further inquiry. Fearing that those who clung to the teachings might fail to grasp the distinction between provisional and ultimate truth, the text thus clarifies in the following passage that it is \"my own self.\" Some say the \"Ancient Master\" is my teacher—this, too, is an allegory. To take it as a factual record is a grave error. For if such a person had truly existed in antiquity, why would he now, in his ascent, appear exactly as he did when first seen there? How could this be called the extinction of the self and the cessation of being? Upon careful consideration, the allegorical reference to a \"teacher\" is evident. Moreover, the \"Nameless\" and the \"Ancient\" are both titles of the Old Lord. Thus, the earlier statement that it is \"my own self\" is confirmed.\n\nSome say he transformed Jambudvīpa and, having long since returned his spirit, now departs. This return to the original source makes clear that his transformations there and here are both the work of a single being, for this return and that origin are not two. Yet fearing that the Dao might remain obscure and that faith and awakening might not run deep, he manifested his numinous power to illuminate the world. By demonstrating his freedom in coming and going and the unparalleled sagely virtue, he sought to awaken true persons and prevent them from growing weary.\n\nYin Zhen said: \"Today, beholding the sagely countenance so transcendent, I see the supreme honor of heaven—how could there be any frontier barbarians?\" These words are subtle indeed.\n\nOn this mountain height, the Pass Keeper had previously built a terrace and lodge to observe the stars and await the qi. When the Old Lord ascended from its midst, later generations called it the \"Tomb of Laozi,\" though it was no tomb at all. As the *Erya* states: \"A great mound is called a *ling*—this is what is meant.\"\n\nThe Old Lord said: \"In practicing the method of preserving the Three Ones, first visualize them between your eyebrows. One inch inward is the Hall of Light, two inches inward is the Cavern Chamber, and three inches inward is the Muddy Pellet—this is the palace of the Upper Cinnabar Field. Within the Upper Cinnabar Field resides a child named Yuanxian, also called the Imperial Minister, three inches in height, clad in red robes and red shoes.\n\nNext, focus on the heart, called the Crimson Palace—this is the Middle Cinnabar Field. Within it dwells a true person named Zidan, also called the Radiant and Firm One, three inches in height, dressed in the same colors as before.\n\nNext, focus three inches below the navel, called the Gate of Destiny—this is the Lower Cinnabar Field. Within it resides an infant named Yuanyang, also called the Valley of Mystery, three inches in height, dressed in the same colors as before.\n\nVisualize them seated beneath a golden forest and jade table, with a golden censer and jade spoon. After stirring the essence, imagine it rising once to the middle, then descending to the left. One hand holds the golden censer and jade spoon at the center, while the other first descends to the right. Feed the essence to the upper infant once, then to the middle infant once, allowing each to drink about ten mouthfuls. Then imagine the upper infant returning to its place, followed by the lower infant, and then cease.\n\nNext, visualize a white qi, vast as a chariot wheel, covering you. Then imagine a red qi covering the white qi, and then you may lie down.\n\nWithin the Cavern Chamber, there is a white qi, large as a chicken’s egg, its light like the moon illuminating all around. These methods should be constantly maintained day and night, for it is said: 'If you desire long life, the Three Ones must be clear. If you can guard the One, the One will guard you.' Whether sitting, moving, walking, entering mountain forests, joining the army, eating, drinking, falling ill, or facing sorrow—guard the One in all things, and no wish will go unfulfilled.\"\n\nThe Old Lord said: \"Essence is the river that flows through the blood and veins, the numinous spirit that guards the bones. When essence departs, the bones wither, and when the bones wither, death follows. Thus, it must be treasured.\n\nThe body is a kingdom, the spirit its ruler, essence its minister, and qi its people. Qi transforms into essence, essence into spirit, and spirit into the infant. The infant ascends to become a true person, and the true person then becomes the child—this is the true One.\n\nHeaven has three luminaries: the sun, moon, and stars. Humans have three treasures: the three Cinnabar Fields. By constantly circulating qi and cherishing essence, the three fields’ treasures and the child are preserved—this is the essential Dao.\n\nIf one can focus solely on the One without forgetfulness, all affairs will be accomplished. He who guards the One may wander heaven and earth without fear. Over time, he will see the thirty-six thousand spirits within his body collectively lift him, ascending to heaven in broad daylight—this is the path of the superior adept. The next level grants extended years and repels evil—this is the path of the middling adept. In times of urgency, if one does not forget the One, one will surely escape disaster—this is the path of the lesser adept.\n\nIn guarding the One, if one encounters nightmares or strange apparitions, one must not speak of them to others. Simply rectify the mind and focus on the One, and no harm will come.\n\nThe One is the sovereign lord of the body. If one can guard the One, the One will guard the person. Entering an army, weapons cannot slay them. Entering mountain forests, no harm will dare approach. Entering rivers and seas, dragons and serpents will avoid them. Entering plague-stricken lands, demonic qi will dissipate. Even when moving, constructing, or traveling, one need not avoid the Tai Sui, the Great General, the eight spirit taboos, or other prohibitions—no misfortune will befall.\n\nThe Old Lord said: 'For those who wish to cultivate the body and nurture nature, practice the Dao and transform form, seek blessings and fulfill wishes, refine qi into spirit, extend years and prolong life, and attain endless beginnings and ends—the essential path is purity and stillness.'\"",
      "overlap_context": "e grand historian Su You declared: “A great sage has departed; a thousand years hence, his teachings will reach this land.” King Zhao then ordered a stone inscription carved and buried before the southern suburban temple of heaven. This was the omen preceding the Old Lord’s journey west to transform the Hu.\n\nAt that time, the Pass Keeper, deeply moved by the words he had received, wept in longing and remembrance. Claiming illness, he relinquished his post and secluded himself in a quiet chamber.",
      "start_char": 7357,
      "end_char": 8605,
      "start_sentence": 446,
      "end_sentence": 514,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.175291776657104,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "故天静以为政，地静以为定，神静以为变，人静以为生。 故清则感，静则应也。 将静之时，反听内观，还念形中。 心不妄念，口不妄言，形不妄动。 然后乃无色之色为之见，无声之声为之闻，无味之味为之甘，不言之言为之崇。 神景为之降，福德为之臻，和气为之应。 心则圣，意则明。 好梦善隐，能睹求於征梦，则正睹於未然。 如未睹者，由精诚未至，至则通矣。 老君日：子欲入静室，常用除日。 先沐浴斋戒二十五日，然后乃可入室，精炼己身。 身中魂魄和平，乃可入室耳。 神不和者，则人烦乱，内外躁动，不能自安也。 故为后贤叔说变事焉。 老君日：入室之时，有丹蛇来着人心。 不惊恐者，．当与真人语。 或见西王母乘凤凰车，后驾六赤龙车，前三朱雀。 见之勿惊，与人语慎勿答。 若见患亦勿恐怖，患不止，真人自代子语矣。 西王母去后，大道来见。 见时上有日月星，或有天师与真人来倡乐万端，勿视也。 仙人玉女，慎勿观也。 龙蛇禽兽或犯子者，慎勿惊也。 此并子形中精神所为，非真也。 汝见之但安心定意，此物自去矣。 或有老妇女及异形者，勿与语，勿交往，乃吉矣。 入室二十五日，有两女来欲与子语，慎勿与语。 四十五日当有一书生来欲与子语，亦勿共语。 六十日室上有两明星，踌躇经三日，亦勿怪。 八十五日有白首老公乘白鹿来呼子，子曰吾有先人罪负，未能致贤也。 百五日有天师来考子祖宗功德，子对曰先代以来，罪过未尽，是以故於室中精炼耳。 百二十五日去室三百步有千乘万骑，子勿怪之。 百五十日邪神称子父母妻子来试子，故非子父母也。 子但正身定意精心，百八十日后室自明知国中安危存亡，自是之后，具列身中官府显见。 二百八十日之后，形中恶病皆除，邪气不加身。 人矣。 其九室者，第一室是去邪思也，三神为其守，太阳居左教之，太阴居右与之，太和居内利之。 第二室是正身思也，与精气合为理，鬼物俱居外，瞻正与不正，宅神居内，视可成不也。 第三室是致正思也，精气鬼物皆合为一，若居都市中，神居其外，勿怪之。 第四室是大正思也，人精得与神小合也。 第五室是极正思也，真神得入其内，精气次之，鬼物居其外，方曰去也。 第六室是探正思也，神精正，行气正，以得其所，故气鬼物邪恶以除去也。 第七室是正真思也，大真神至，众邪畏之，悉除去，独有真神在也。 第八室玄洞思也，身与真神都合为人也，日一夕未尝念地上俗问一事也。 第九室是大洞思也，已成真人也，随气而卧大洞，道备矣，主埋神仙事，不得复知人事也，宜慎之焉。 然后坚闭门，慎不得与俗相见也。 须食置於户外，令之自取，若不复取，勿令人动摇，当易其形容，自有去时矣。 论日：夫人入室者，意在清斋诵经，或服药行气，或思真炼神，志唯求道。 精恳愈切，专想不二，则能洞感、变形、易颜，以至仙飞。 其有不然者，由於精诚不至，至不能久故也，岂徒委形幽室而已乎。 关令奉教修行，三年事毕。 颜容更少，面有金色者，盖精之至也。 道成之后，乃往成都焉，所言成都者，示其学道都成者耳，盖指事以为喻矣。 太上混元真录竟",
      "translated_text": "Thus, heaven governs through stillness, earth stabilizes through stillness, spirits transform through stillness, and humans live through stillness. Therefore, purity enables resonance, and stillness enables response. When about to enter stillness, reverse hearing to listen inward, return vision to observe within the form. The heart does not entertain reckless thoughts, the mouth does not utter reckless words, the body does not make reckless movements. Only then will the color of no-color be seen, the sound of no-sound be heard, the sweetness of no-flavor be tasted, and the reverence of wordless speech be honored. The divine radiance descends, blessings and virtue draw near, and harmonious qi responds. The heart becomes sagely, the mind becomes luminous. Good dreams and auspicious omens appear; by observing signs in dreams, one perceives what has not yet come to pass. If one does not perceive, it is because sincerity has not yet reached its peak—when it does, communion is achieved.\n\nThe Old Lord said: \"If you wish to enter the stillness chamber, always choose an auspicious day. First bathe, fast, and purify yourself for twenty-five days, then you may enter the chamber to refine your body. Only when the hun and po souls within are harmonized may you enter. If the spirits are not in harmony, one becomes restless, agitated within and without, unable to find peace.\"\n\nThus, for the sake of later worthies, I explain these transformations. The Old Lord said: \"When entering the chamber, a cinnabar serpent may come to rest upon your heart. If you are not startled or afraid, it will speak with you as a perfected one. Or you may see the Queen Mother of the West riding a phoenix chariot, followed by six chariots drawn by red dragons, with three vermilion birds preceding her. Do not be alarmed upon seeing her; if she speaks to you, be cautious and do not reply. Should afflictions appear, do not fear them—if they persist, the perfected one will speak on your behalf.\n\nAfter the Queen Mother of the West departs, the Great Dao will come to meet you. When it appears, sun, moon, and stars may be above, or the Heavenly Master and perfected ones may arrive with myriad forms of music—do not look. Immortal maidens and jade women may appear—take care not to gaze upon them. Dragons, serpents, birds, and beasts may approach you—do not be startled. These are all manifestations of the spirits within your form, not real. Simply calm your heart and steady your mind, and these apparitions will depart of their own accord. If an old woman or beings of strange form appear, do not speak with them or engage with them, and all will be auspicious.\n\nAfter twenty-five days in the chamber, two women may come wishing to speak with you—do not converse with them. On the forty-fifth day, a scholar may come wishing to speak with you—do not engage with him. On the sixtieth day, two bright stars will appear above the chamber, lingering for three days—do not be alarmed. On the eighty-fifth day, a white-haired elder riding a white deer will call to you; reply, 'I bear the sins of my ancestors and have not yet attained worthiness.' On the one hundred and fifth day, the Heavenly Master will come to examine the merits of your ancestors; respond, 'Since my forebears, sins have not been exhausted, which is why I refine myself in this chamber.'\n\nOn the one hundred and twenty-fifth day, a thousand chariots and ten thousand riders will appear three hundred paces from the chamber—do not be alarmed. On the one hundred and fiftieth day, evil spirits may impersonate your parents, wife, or children to test you—they are not your true kin. Simply rectify your body, steady your mind, and focus your spirit. After one hundred and eighty days, the chamber will naturally illuminate the safety or peril, survival or demise of the state. Thereafter, the offices and palaces within your body will become fully visible. After two hundred and eighty days, all illnesses and malevolent qi within your form will be expelled, and no evil will afflict you. You will have become a person of the Dao.\n\nThe nine chambers are as follows: The first chamber dispels perverse thoughts, with the Three Spirits guarding it. The Greater Yang resides on the left to instruct, the Greater Yin on the right to assist, and the Supreme Harmony within to benefit. The second chamber rectifies the body’s thoughts, uniting essence and qi to govern. Ghosts and spirits remain outside, observing whether one’s dwelling is upright or not, while the dwelling spirit resides within to assess whether success is possible. The third chamber attains correct thoughts, with essence, qi, ghosts, and spirits all uniting as one. If one dwells amidst the bustle of the world, the spirit resides without—do not be alarmed. The fourth chamber embodies great correctness of thought, where human essence achieves minor union with the spirit. The fifth chamber embodies ultimate correctness of thought, where the true spirit enters within, essence and qi follow, and ghosts and spirits remain outside—only then is departure possible.\n\nThe sixth chamber embodies profound correctness of thought, where spirit and essence are rectified, qi flows correctly, and its place is attained. Thus, qi, ghosts, spirits, and malevolent forces are all expelled. The seventh chamber embodies true correctness of thought, where the Great True Spirit arrives, all evil fears and departs, leaving only the true spirit. The eighth chamber embodies mysterious cavern thought, where body and true spirit unite as one. Day and night, one does not entertain a single worldly thought. The ninth chamber embodies great cavern thought—one has become a perfected person, lying down in the great cavern with the qi, the Dao complete. One presides over the affairs of spirit immortals and no longer comprehends human matters. Be cautious.\n\nThereafter, firmly close the door and take care not to meet with worldly people. Place food outside the door and let it be taken of its own accord. If it is no longer taken, do not let anyone disturb it. One’s appearance will naturally change, and there will be a time to depart.\n\nIn summary: Those who enter the chamber do so with the intent to purify themselves, recite scriptures, ingest medicines, circulate qi, contemplate the true, and refine the spirit—solely to seek the Dao. The more earnest and single-minded one is, the more one can profoundly resonate, transform form, alter countenance, and ascend as an immortal. Those who fail do so because their sincerity is insufficient or cannot be sustained—how could it merely be a matter of secluding the body in a dark chamber?\n\nThe Pass Keeper followed the teachings and cultivated for three years. When his practice was complete, his complexion grew youthful, and his face took on a golden hue—such was the depth of his refinement. After attaining the Dao, he went to Chengdu. By 'Chengdu,' it is meant that his learning of the Dao was complete—this is a metaphorical reference. *The Supreme Record of the Primordial Chaos and the True One* concludes.",
      "overlap_context": "en lands, demonic qi will dissipate. Even when moving, constructing, or traveling, one need not avoid the Tai Sui, the Great General, the eight spirit taboos, or other prohibitions—no misfortune will befall.\n\nThe Old Lord said: 'For those who wish to cultivate the body and nurture nature, practice the Dao and transform form, seek blessings and fulfill wishes, refine qi into spirit, extend years and prolong life, and attain endless beginnings and ends—the essential path is purity and stillness.'\"",
      "start_char": 8605,
      "end_char": 9799,
      "start_sentence": 515,
      "end_sentence": 568,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.25526809692383,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\太上混元真录.txt",
        "category": "记传类"
      }
    }
  ]
}