{
  "source_id": "太上修真体元妙道经",
  "source_file": "chunked_daozang\\太上修真体元妙道经.json",
  "total_chunks": 9,
  "total_original_chars": 8399,
  "total_translated_chars": 44587,
  "total_translation_time": 220.12328243255615,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Scripture on Cultivating the True and Embracing the Mysterious Dao of Primordial Oneness**\n\n**Scripture Title:** *The Supreme Scripture on Cultivating the True and Embracing the Mysterious Dao of Primordial Oneness*\nOne fascicle, composed by Liu Yuanduan of the Southern Song.\nBase text from: *Daoist Canon of the Zhengtong Era*, *Section of Cave Truth*, *Category of Original Texts*\n\n---\n\n**Transmission of the Three Teachings of Mysterious Unity by Master Renshou of Meishan**\n**Chapter One: The Unmanifest in Primal Chaos**\n\nAt the very beginning, the One Chaos arose before form, enfolding the myriad existences in obscurity. Vague and dim, the Three Causes lay concealed in latency.\nIt seemed like *qi* yet was not *qi*; it resembled an image yet had no image. A shapeless mass, neither thing nor non-thing—such was its simplicity!\nIn its semblance of distant likeness, it embraced the four limits within and contained the Three Powers at its core. No sharp blade could force it open, no mighty cudgel could strike it asunder. The Three Realms of Great Clarity were as a mustard seed hidden within, unseen; the ten thousand transformations of the human Dao were as countless as the Ganges’ sands. The *qi*-types held their embryos, their forms like a hen’s egg. From within, it divided into the Two Modes—where then were Qian and Kun? From its midst, it enveloped the Five *Qi*—whence did Water arise?\nGold within sand, jade within stone—without a single chisel or washing, how could they be separated?\nThus, when simplicity scatters, the Great Ultimate unfolds; when form takes shape, the myriad images appear.\nSo vast was it, so hidden was it, so profound was it, so boundless was it—this was called the Dao, for it contained the True.\n**Secret Formula:**\n*No form, no image, no scent, no sound—*\n*Before Heaven and Earth divided, how could I name it?*\n*Obscure as uncut jade, merged in utter tranquility,*\n*Such wondrous function marks the Dao’s course.*\n\n---\n\n**Chapter Two: The Scattering of Simplicity and the Division of Forms**\n\nBefore the undrilled mass of primordial haze congealed, movement and stillness, yin and yang were both obliterated. That which sought ascent could not ascend; that which was about to begin could not begin.\nDrowsy yet containing slumber, slumber yet enfolding drowsiness—none could point to it. Vaporous and dense, like the gloom of layered mist; billowing and hazy, like the obscurity of fog veiling water.\nThis chaos was yin’s desire to scatter and yang’s urge to rise; this extremity was yang’s impending flourishing and yin’s impending division. Without the chaos of extremity, generation and transformation could not occur. Those who fathom the Dao contemplate it in silence.\n**Secret Formula:**\n*The Two Qi merge in chaos, the Three Powers undivided,*\n*Enfolding the myriad existences, poised to unfold yet unformed.*\n*Without extremity, no transformation; without movement, no tranquility.*\n*Generation transforms, transformation generates—opening and closing, closing and opening.*\n\n---\n\n**Chapter Three: The One Qi Divides into Three**\n\nWhen *qi* congealed and coalesced, it was turbid and undifferentiated. Its division lay within: that which was refined and nurtured ascended; that which was heavy and sunk descended. The balanced and unbiased gestated at the center. Thus, the center was the pivot of transformation, and transformation divided through the pivot.\nLike casting water into raging flames, or cleaving an egg with a sharp blade—\nWhen the One *Qi* scattered, the refined ascended, and the *qi* surged and churned, transforming with the clear.\nThe clear was yang, called Heaven. The heavy and turbid *qi* sank and coagulated, congealing with the turbid.\nThe turbid was yin, called Earth.\nAbove, it was Qian’s extreme of ten suns, where utmost yang was vigorous. Below, it was Kun’s extreme of twelve earthly branches, where utmost yin was transformative.\nOnce the Two *Qi* were sundered, what then was Man?\nThe clear was Heaven’s ancestor; the turbid was Earth’s source. The essence resided in the center, issuing forth in kind. When kind took form, it first bore the numinous—such was the inception of the human Dao.\nTo clarify the origin of the Two *Qi* and the beginning of the human Dao, one must seek it in the center.\n**Secret Formula:**\n*The One Qi first divides, the Two Modes come to be,*\n*The human Dao lies within, enfolding the myriad spirits.*\n*I am one with Heaven and Earth—why this division?*\n*The Dao’s transformation lies here; return to it in clarity.*\n\n---\n\n**Chapter Four: The Qi Unfolds and Images Emerge**\n\nFrom the One came the Three; from the Three came the Four; from the Four came the Five.\nThe One generating the Three: Heaven, Earth, and Man.\nThe Three completing the Four: east, west, south, and north.\nThe Five’s generation: Metal, Wood, Water, Fire, and Earth.\nWhat does this mean?\nTake Water as the One. Before the ultimate divided, its body was pure yin. Scattered, it transformed into *qi*; thus, *qi* gave rise to *qi*, and *qi* gave rise to Man.\nThat which *qi* transforms into *qi* is Water. It is born of Wood, transforms through Fire, and returns to Earth—this is the *qi* of future descent.\nThus, life is nurtured by Metal. Metal is the extreme of the Five *Qi*; having reached this point, it cannot revert. It transforms into rain, dew, frost, and snow—this is the meaning of Water to come.\nWhen the Five *Qi* ultimately cease, reverse the sequence: take Metal as Water’s mother, Earth as Water’s father, and Fire as Water’s ancestor.\nWhy? The sun’s waves and the moon’s radiance exemplify this.\nIn the discourse on the Five *Qi*, why is Water the first and the kidneys? Because Man in the womb is like the undivided chaos. Yet why are Earth as One and Fire as Two?\nWhen an infant is born, the Gate of Heaven opens, while the Gate of Earth remains sealed. At three years, speech begins—born of wisdom.\nYet it is not Water as One, Wood as Two, Metal as Three, and Fire as Four—why is this? Those who cultivate the True should observe this in reverse.\nThus, the *Yinfu*’s indications all reside herein.\n**Secret Formula:**\n*Once the One Qi scatters, Heaven, Earth, and Man endure.*\n*The Five Phases and Four Limits—discourse on Water and Wood.*\n*Abiding in the abdomen, breathing in chaos,*\n*Grasp this meaning—it is the gateway to the Supreme Dao.*\n\n---\n\n**Chapter Five: The Myriad Images Contain Transformation**\n\nOnce the Two *Qi* transformed, the clear circulated and the turbid moved. Thus, *qi* had ascent and descent; kinds had birth and flourishing; things had prosperity and withering; affairs had succession and decline. The Five *Qi* each resided in the One.\n\n**Chapter Six: From Void to Substance**\n\nDwelling in the East, it is called Green Yang; dwelling in the West, White Storehouse; dwelling in the South, Vermilion Brightness; dwelling in the North, Dark Splendor. Scattered, they gather; returning, they unite—thus the Central Ultimate is the pivot. Here, the Four *Qi*, Four Seasons, and Four Directions each embrace Earth within three months’ *qi*. Yet roots lie in Earth, birth in Wood, nourishment in Water, withering in Metal, and desiccation in Fire. Though destruction never ceases, what is cut down revives—because the Four Seasons each contain Earth. In spring, yellow blossoms appear, for Wood embraces Earth (present in the *chen* branch); in summer, yellow blooms flourish, for Fire embraces Earth (present in the *wu* branch); in autumn, yellow flowers emerge, for Metal embraces Earth (present in the *shen* branch); in winter, yellow shoots arise, for Water embraces Earth (present in the *hai* branch). The Five Phases, Five *Qi*, Five Images, and Five Directions—nothing is complete without embrace, nothing transforms without containment.\n\nIn the East, *yin* is Wood, yet it is the birthplace of Fire; in the West, Metal resides in *si*, yet it is the remnant of Fire. Within Water’s domain, Fire and Earth lie concealed; within Fire’s domain, the *qi* of Earth is enfolded. Generation and restraint, all embrace, all transform. Thus: one kernel, two sprouts, three husks, four leaves, five branches, six trunks, seven flowers, eight fruits, nine seeds, ten witherings—this is Heaven One, Earth Two; Heaven Three, Earth Four; Heaven Five, Earth Six; Heaven Seven, Earth Eight; Heaven Nine, Earth Ten. The Dao operates through the One *Qi*; one must guard the One. From One to Ten, all are contained within it, preserving the transformation of the unspoken. Thus, the Great One embraces true reality.\n\nThose who cultivate the True should embody and practice this.\n\n**Secret Formula:**\n*From One, the Three arise—*\n*myriad images contained within.*\n*Heaven and Earth revolve at their center,*\n*yin and yang in secret rotation.*\n*A single speck of ancestral qi—*\n*the Four Seasons move therein!*\n*If you can grasp this,*\n*you stand shoulder-to-shoulder with Creation.*\n\n**Chapter Seven: The Transformation of Nature and Emotion**\n\nThe floating and the wandering have no ancestor; the void and the nonexistent have a source—all arise from the scattering of the One *Qi* and the alignment of the Five *Qi*. The void above is the transformation of clear *qi*, called the Vast Expanse; the substance below is born of turbid *qi*, called the Mountains and Rivers. Thus, what arises from the void harbors yang; what arises from substance harbors yin. Therefore, *zi* is void, *wu* is substance. The *qi* of *wu* is yin, yet Fire flourishes here—thus it is substance. The *qi* of *zi* is yang, yet Water flourishes here—thus it is void. Without void, substance is unknowable; without substance, void is unclear.\n\nYet Earth is substance—why does it not manifest in the twelve hours? *Qi* is void—why does it transform into the Three Pure Realms? Seeking substance through void is easy; seeking void through substance is difficult. In the void of Heaven, there is wind, rain, frost, mist, and haze—now gathering, now scattering—this is the origin of void and substance. In the substance of Earth, there are mountains, seas, forests, and crops—yet why do seas dry, rivers run dry, mountain peaks crumble, and earth quake? This is the resonance of void and substance.\n\nWhat arises from nothing to become something is the substance of void; what arises from something to become nothing is the void of substance. Beginning with the mutual resonance of parents’ nature and emotion, a form with awe-inspiring presence takes shape—this is the substance of void. Yet when the Five Desires sprout and the One True scatters, seeking the original nature and emotion becomes impossible—this is the ease of seeking substance through void and the difficulty of seeking void through substance.\n\nThus, those who study the Dao take the prenatal as their foundation—this is precisely in accord with it.\n\n**Secret Formula:**\n*From void, qi is formed;*\n*from qi, kinds arise.*\n*Substance is born of kinds,*\n*and weariness follows substance.*\n*Seeking substance within void—*\n*though difficult, it lies within.*\n*Yet if substance is too substantial,*\n*Water and Fire cannot destroy it.*\n\nOnce qi divides, images follow this illumination—thus, what dwells above the vault are called the sun, moon, and stars, wind, thunder, and lightning; what lies concealed below are called mountains and rivers, grasses and trees, birds and insects. Initially without nature, they respond to movement and thus possess emotion. When emotion stirs, nature follows! In grasses and trees, it manifests as flourishing; in deep pools, it manifests as qi—all born of yin yet generated by yang. Once nature exists, desire arises; once desire exists, emotion is born. Thus, when the solstice arrives, grasses and trees fulfill their nature: willows remain willows, flowers return as flowers. The stirring of insects—this transformation through movement—all begins with the solstice. The solstice is the winter solstice, which is *zi*, the inception of yang. In the hexagrams, this is *Fu* (Return), meaning \"to revert.\" Thereafter, the nature and emotion of heaven, earth, and the myriad things flow through this. If all things are thus, how does human nature and emotion arise? From crown to sole, a person’s bones, hair, qi, and blood—every motion and stillness, opening and closing—mirror heaven, earth, and the myriad things. Thus, from void emotion, one resonates with true nature. Once enveloped in this emotion, one follows this nature, responding and transforming—possessing blood and pearls, clods and embryos—this is called conception, the first of Water. Therefore, it is yin that gives birth to yang, not yang that gives birth to yin. The function of the Dao lies in using emotion and nature as the great elixir—this is mastery of the Dao. Thus, the emotions of heaven and earth and the prenatal nature of parents become as clear as a mirror reflecting one’s visage.\n\n**Secret Formula:**\n*At first, the one qi divides into nature and emotion;*\n*scattered, it turns obscure—gathered, it gives life.*\n*The Three Powers share one origin—why set external measures?*\n*Seek only resonance and union, and the body becomes luminously whole.*\n\n---\n\nPure yang qi ascends to the left, pure yin qi descends to the right, while the central qi of gestation hangs in the center. The single transformation of *Qian* (Heaven) unfolds over ten days—this is the Great Yang. Yet it is said: \"How can solitary yang accomplish creation?\" Thus, nine days are spent in descent, one day in bathing. Once the nine descend, they form six—six being the inception of yin. Therefore, the moon’s light borrows the sun’s radiance. Beyond Mount Sumeru, in the vast heavens, the leftward and rightward revolutions of the celestial bodies leave the moon perpetually trailing the sun—this is due to its pure yin nature. *Qian* possesses the flourishing of the sun, *Kun* (Earth) the gestation of the moon—yin preserves yang, and yang yearns for yin. The sun rises and sets, ascending high: at first emerging from earth, it bursts forth from water, ascends into the void, and illuminates images—yet it can only brighten the day, not the night. The moon waxes and wanes, from new moon to full, from crescent to gibbous—its phases arise from borrowing yang, yet it is often deficient. Thus, its motion is slow or swift, lingering for thirty days without daily renewal—such is the Way of the sun and moon.\n\nWhy is it that their great brilliance, shining externally and illuminating things, cannot penetrate an overturned basin? Because there is no gap. A gap is the opening of transformation—through which the myriad images arise: these are the stars. Stars, too, are born of the sun, corresponding below to humanity. The sun merely revolves through yang, the moon merely circles through yin, but it is the stars that govern the turning of the four seasons, the succession of the Five Phases, and the alignment of the Seven Governors. Yet the stars’ correspondences are unstable and shifting, following the Way of change—thus, they are governed by the Dipper. Stars may wander, but the Dipper does not move carelessly; suspended day and night, luminous in the heavens, nothing rivals the sun—it, too, is but residual qi. Thus, the sun and moon have constancy, while the stars do not.\n\nAt the primordial division, heaven, earth, and humanity took form—signified by the sun, moon, and stars. When the three qi merge and return to oneness, this is the Dao of the prenatal.\n\n**Secret Formula:**\n*Qian holds the great crystal, the moon births great numen;*\n*above and below gestate flourishing—within, stars take shape.*\n*Heaven governs yang’s transformation, Earth governs yin’s balance;*\n*the Three Powers share one qi—rooted in the origin of creation.*\n\nAt its inception lies emotion and attachment, and thus one falls into this realm. Beneath the vow of reverence, male and female take form. They come from the five qi, and within, they hold the dual forces of heaven and earth. Thus, before nurturing and before birth, dwelling in the mother’s womb, they drink blood and receive the placenta, hands covering their eyes, feet curled beneath the chin. With every breath the mother draws, the child draws as well; with every exhalation, the child exhales in turn. In all movements and tremors, inner and outer resonate—what awareness, what knowledge? What clarity, what understanding? The qi of heaven blends with it, the qi of earth blends with it, and the qi of humanity blends with it as well, yet a single breath remains. When the time of separation and birth arrives, heaven and earth seem overturned, the breaking of the placenta shocks the child—like one who, walking atop a great mountain, loses footing. Head suspended, feet braced, they emerge. With a great cry, that breath is forgotten.\n\nThus, they follow nature and follow desire, unable to hold both. The breath of the womb cannot be preserved a second time. Moreover, milk nourishes their cleverness, play delights their eyes, love tugs at their emotions, and desire commands their spirit. Gradually, a vast distance grows, the seeds of discord arise, and the breath of the womb is no longer guarded.\n\nThose who study the Dao should savor this chapter to seek its essential truth.\n\n**Secret Formula:**\n*Beginning in primordial chaos, gestation takes form within;*\n*the seven emotions and six desires settle into constancy.*\n*Inhalation and exhalation—where true nature returns;*\n*womb-breath, womb-breath—the Mysterious Female of the Dao.*\n\n**Text Title:** *The Supreme Scripture on Cultivating the Dao and Realizing the Wondrous Origin of the Body*\n\nOne scroll, composed by Liu Yuanduan of the Southern Song.\nSource edition: *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Benwen* category.\n\n**Preface to *The Supreme Scripture on Cultivating the Dao and Realizing the Wondrous Origin of the Body***\n\nThe Dao originates from the primal word, yet it has no name. Heaven itself does not speak, yet the ten thousand images revolve within it. From the void and origin, the wondrous One is contained; within the three darknesses, the division of the Two Modes later fuses. The three qi are the primordial origin, the primordial beginning, and the primordial ultimate. Without the ultimate, there is no transformation; without transformation, there are no images. Images are the root of all kinds, the source from which the ten thousand things arise. Through the transformation of the four limits, the four limits divide, giving rise to the four directions of heaven and earth, yin and yang, cold and heat, flourishing and withering, growth and decline—each following its kind.\n\nThus, the qi of the five phases transforms through one qi into water, which generates wood; wood generates fire; fire generates earth; earth generates metal. From this, the Dao of ceaseless generation and transformation arises. Once existence emerges, there must be nonexistence. From the interplay of existence and nonexistence, the cycles of birth, prosperity, decline, and death arise—sinking, rising, hidden, and manifest—each nourished in turn. When nourishment deepens, generative qi arises. Yet it is not merely qi; once qi is born, the Three Powers begin, and humanity dwells within them. At first, all arises from one qi; in the end, all scatters into the ten thousand transformations. Thus, emotions and nature, joy and anger, likes and dislikes branch like vines—giving rise to father and mother, husband and wife, male and female. From the ultimate beginning to the final transformation, kinds take form, arising from primordial unity and scattering into the ten thousand existences. Is this not the Dao?\n\n**Chapter Ten: The Correspondences of Jia and Geng**\n\n**Chapter Eleven: Nurturing the True through Breath**\n\nQian’s stem begins with *jia*; Kun’s union responds with *geng*. *Jia* arises from water’s birth, thus dwelling in the East; *geng* is water’s mother, thus nurtured in the West. Though the West is called stern, within *shen* lies water and earth. Thus, the West’s *geng* is destructive, yet life springs from the East’s *jia*, for *jia*’s qi resides in *yin*, also known as the third day of the threefold *jia*. The third day of *jia* divides afterward, preceding *geng*’s third day. *Geng*’s third day follows the beginning and end, for *jia*’s union is *ji*, and within *ji* lies earth—this is the harmony of the Three Yangs. *Geng*’s union is *yi*, within which lies wood; within wood lies fire, and fire can subdue *geng*, yet does not hinder water.\n\nThe marvel of the sagely Dao: *jia* resides in *zi* as the seal, and the seal is uprightness, uprightness is the beginning. Beneath *zi* lies water, and water can generate wood; thus *jia-zi* is the first, ending at *xu*, for *xu* is fire’s storehouse. *Jia* must be paired with *geng*, water’s mother, for within *shen* lies earth, which can generate metal. Yet at *chen* and *si*, it is cut off, for fire’s destructive force prevails.\n\nThus, those skilled in the Dao employ the prior qi of *jia-zi*, *jia-chen*, and *jia-wu* with the prior unions of *geng-zi*, *geng-chen*, and *geng-wu*, nurturing and resting in stillness. From *zi* to *chou*, from *chou* to *yin*, the mind remains unstained, the body like iron walls. Regulating qi and balancing breath, the stems of Heaven, the unions of Earth, and one’s own qi all resonate as one. The Dao of the Three Powers and Three Causes enters the eye and is naturally sufficient.\n\nThe formula states:\n*Three jia and three geng,*\n*First life, then destruction preserved.*\n*At the appointed hour, on these days,*\n*Heaven and Earth’s qi move as one.*\n*No thought, no delusion,*\n*Breath flowing ceaselessly, evenly.*\n*The microcosmic orbit nears completion,*\n*A luminous sphere arises within.*\n\n**Chapter Twelve: Attaining the One and Achieving the Dao**\n\nHeaven has apertures that generate wind; Earth has apertures that generate water. Heaven’s apertures are not easily discerned, while Earth’s may be observed. When an aperture opens, wind arises; when it closes, qi is obstructed. The apertures of Heaven and Earth are the profound mystery of the ten thousand images’ endless transformations.\n\nHeaven and Earth can open through apertures and also rest through them. When at rest, Earth’s qi cannot ascend, and Heaven’s qi can descend. From *zi*, Heaven’s apertures open, its qi pure and descending; from *wu*, Earth’s apertures close, its qi turbid and ascending. All movement and stillness return to the bellows. The bellows is the alternation of opening and closing. Heaven’s bellows is *zi*; Earth’s key is *wu*; humans encompass them through breath.\n\nTracing day and night, one cycle governs 1,600 and more—this is the number of Qian and Kun. Those skilled in the Dao, who can preserve breath and understand apertures, truly nurture without labor.\n\nThe formula states:\n*At the fourth watch, Heaven and Earth unite,*\n*Unfolding the subtle to reveal its depth.*\n*Water and fire are natural affairs,*\n*No need to labor the mind.*\n*Within the nose lie two apertures,*\n*Heaven and Earth not a hair’s breadth apart.*\n*If one can preserve this moment,*\n*The bright moon is grasped in the palm.*\n\nOne is the primordial qi of the ten thousand images, the root and origin of Heaven and Earth, the great essential of the human heart. Qian unifies through one and completes its reckoning; Earth unifies through one and achieves its flourishing; humans unify through one and settle their nature. If one cannot align all with the One but scatters them amidst the ten thousand distractions, confounding the heart, the root and origin cannot be seen. Heaven’s One brings clarity; Earth’s One brings tranquility; the human One brings fragrant virtue; the body’s One brings uprightness; the household’s One brings order; inner One brings freedom from delusion; outer One brings compliance; the heart’s One harmonizes yin and yang; the thought’s One distances perversity; the nature’s One prevents emotions from arising; the qi’s One levels the breath; the breath’s One unites water and fire, bringing harmony to Heaven and Earth—how can one not seek the One?\n\nThe formula states:\n*One is the qi of the Dao,*\n*Qi is the source of the One.*\n*If one can strive for clarity,*\n*Seek only within the One.*\n*Unawares, between dawn and dusk,*\n*Suddenly gold appears in water.*\n*Having attained the One, forget the One—*\n*The spirit abides, truly inviolable.*\n\n---\n\nThe Dao does not cling to words, nor can it be confined by them. Through qi, images take form; when qi is attained, images manifest in kind. Yet few realize that through qi, kinds arise, and from kinds, images emerge. Beneath the chapters, skillful phrasing abounds, but it is better to point to the essential and clarify the images of things, observing their transformations. Yet transformation follows the Dao, and chapters preserve words. Thus, the adept never debates, while those who debate are not adept—like fish in a well, who can fathom them? To know the joy of water, one must ask the fish. This is the meaning.\n\nThe formula states:\n*First entering, the image is unclear,*\n*Only upon seeing the image is the intent known.*\n*Recognizing the image is the gateway—*\n*Why cling to words?*\n*Once clung to, the beginning is forgotten,*\n*Like poling a boat without reaching the shore.*\n*Unaware, the foolish and simple*\n*Take this as the truth of the Dao.*\n\n---\n\nTo nurture the spirit, one must first cultivate the heart; to refine qi, one should regulate the breath. The spirit arises from the heart, for the heart is the spirit’s dwelling; qi is the source of breath, and breath is governed by qi. Those who skillfully cultivate the heart must make it gleam like a clear pool reflecting the moon, still as an empty valley echoing no sound. Only then will the inner realm remain unmoved, external dust unintrusive; thoughts sink like iron in water, nature clings to nothing like the vast void. In profound tranquility, self and things both forgotten, the spirit clears itself, and qi gathers of its own accord. The spirit congeals through qi, and qi lingers for the spirit. At this moment, one is unaware of the breath’s ebb and flow.\n\nThe formula states:\n*First following the breath,*\n*Finally attaining qi.*\n*Qi and breath guard themselves—*\n*Self and things both abandoned.*\n*Movement and stillness both forgotten,*\n*The spirit’s abode is found.*\n*It rests in cultivating the heart—*\n*Not a single thread arises.*\n\n---\n\nThe spirit’s function is not contrived. It begins with the heart’s cultivation and culminates in the preservation of qi to generate life, like clear waves reflecting a shadow or a bright mirror facing a form. Seeking it with a heart intent on possession will never yield it; seeking it with a heart devoid of intent only deepens its absence. How, then, can it be attained? The spirit values non-disturbance; the heart esteems non-thought. Guard it like stone, act like the foolish. The mouth utters no words, the ears hear nothing; thoughts do not arise, and nature does not drift. Like muddy water first strained, it naturally clears at the top while sediment settles below; the wind does not stir, and leaves still themselves. Unaware of Heaven and Earth, unaware of what \"I\" is—having entered the boundless, one dwells in primordial chaos, like the undivided Taiji, the unmanifest Three Powers. Suddenly, a single spark of spirit shines forth, like a vacant room filling with light. This arises from the heart’s absence, not from the heart’s effort. Thus, its comings and goings are without direction, its transformations follow its dwelling.\n\nThe formula states:\n*The Dao is not named as Dao,*\n*The heart forgets its own heart.*\n*When all is unrecognized at once,*\n*Only then is the valley’s echo heard.*\n*Water and fire are not affairs,*\n*Yin and yang arise within me.*\n*Sitting amidst the boundless,*\n*The spirit’s transformations all unfold.*\n\n---\n\nThe Dao in relation to things, and things in relation to the Dao, begin with forgetting images. There are three thousand six hundred minor gates, giving rise to eighty-four thousand great delusions. Often, one hastens toward the strange and lingers in pursuit of the true. Among thousands or tens of thousands who advance in learning, not one or even half attain the Dao—because they cling to delusion and do not grasp the target. People all take the dragon and tiger as primary—this is wrong; they take golden elixirs and cinnabar medicines—this is wrong...\n\nTo take phoenix marrow and crow spirit—this is wrong; to take jade buds and golden blossoms—this is wrong; to take cinnabar lead and dark mercury—this is wrong; to take heart and kidney as water and fire—this is wrong; to take spleen-earth and liver-wood—this is wrong; to swallow saliva and absorb *qi*—this is wrong; to gather the morning sun and harvest the moon—this is wrong; to hum in the mountains, roar in the forests, rinse with springs, and sleep on stones, to daily swallow rosy clouds and nightly gaze at the Dipper—all these are wrong.\n\nScholars repeatedly fail to contemplate their origin and instead seek after its descendants. Before the Supreme Ultimate (*Taiji*) arose, before heaven and earth divided, before humans and things took form—could there have been such categories? In the essential practice, among hundreds of millions, none have truly preserved it. Is this not delusion upon delusion, confusion compounding confusion?\n\nThe formula states:\n*Dragon and tiger are not the Dao,*\n*Swallowing saliva is not merit.*\n*Rosy clouds are not the sun’s harvest,*\n*Spirit’s transformations do not return to wind.*\n*Who has ever known the primordial *qi*?*\n*Who can fathom the true source?*\n*In an instant, the target is clear—*\n*The Three Realms all are pervaded.*\n\n---\n\n**Primordial Water and Primordial Fire (Chapter Seventeen)**\nThe Supreme Ultimate enfolds the ten thousand images within *qi*; heaven and earth separate the clear and turbid through *qi*. It begins with darkness congealing and ends with *qi* transforming, scattering and drifting, each following its direction. Thus, those dwelling in the west are moved by metal’s kindred. The word *water* is the primordial *qi* of heaven and earth; the word *fire* is also the generative *qi* of *Qian* and *Kun*. Thus, from formless it becomes formed. In winter it lies hidden; in summer it unfolds. It enters into yang and emerges from yin; it conceals in yin and flourishes in yang. Human *qi* is the origin of *qi*.\n\nTherefore, those who study the Dao transform *qi* with *qi*, preserve *qi* within *qi*. Through exhalation and inhalation, drawing and adding, it changes and takes form. To take water as water is not the Dao; to take fire as fire is also not the Dao. Only by preserving *qi* within *qi* do they become water and fire. Water and fire are the transformation from nonbeing into being. Only when there is no distinction of dawn or dusk, morning or evening, emergence or withdrawal is it correct.\n\nThus, those skilled in the Dao preserve the One with *qi* and nurture *qi* with *qi*. Then water naturally ascends within, and fire naturally descends from without. How could this be shown externally? One cannot but deeply reflect and understand.\n\nThe formula states:\n*One *qi* unites yin and yang,*\n*Metal and wood arise naturally.*\n*Originally not water or fire,*\n*The ten thousand images each preserve the true.*\n*Qi* is the beginning,*\n*In the midst, all transforms into spirit.*\n*Standing at the shore, the oar is useless—*\n*Only this is the cause of *Kan* and *Li*.*\n\n---\n\n**Preserving the One to Generate Spirit (Chapter Eighteen)**\nWhen the heavens are clear, clouds and *qi* are pure; when the earth is still, grasses and trees are numinous. If one can embody and practice this, yin converges and yang unites. Thus, a single ripple can reflect the stars and constellations; a single numinous soul can know fortune and misfortune—this arises from its undispersed stillness, its unwavering preservation.\n\nYet later learners often fail to sweep the dust from the spirit-terrace and instead expand their verbal eloquence. Thus, through speech they forget *qi*, and losing *qi*, they lose essence. They take skill and clumsiness as freedom, and vast memorization as great ability. Thus, the pure and unified *qi* is lost, and the marvel of yin and yang vanishes with it.\n\nThose who cultivate well gather it through stillness, refine it through simplicity, purify it in thought, and clarify it in the heart. They preserve it in silence and manifest it in plainness. Naturally, the celestial vault is clear, the earth’s axis is tranquil, *qi* embraces the One, and spirit becomes numinous. Then, without talismans, talismans work; without incantations, incantations take effect. Without spirits, spirits guard; evil flees, monsters hide, households are peaceful, and human affairs harmonize. With the ink of silence, one severs unrighteous spirits—this is the primordial, perfectly unified *qi*, the essential method of preserving the One and embracing the origin. Why bother distinguishing dragon and tiger, separating tortoise and snake?\n\nThe formula states:\n*Thought after thought, focus on the cinnabar field,*\n*Gather and preserve it firmly.*\n*Without attachment to the five colors,*\n*Within, heaven naturally appears.*\n*No need to seek water or fire—*\n*In the golden crucible, they are refined.*\n*Morning and evening,*\n*Spirit and *qi* refine the cinnabar field.*\n\n---\n\n**Spirit and *Qi* Form the Embryo (Chapter Nineteen)**\nWithin the heart, there is spirit; within *qi*, *qi* is preserved. If the heart is disturbed, spirit is not clear; if *qi* is depleted, *qi* must weaken. To project it from the crown is not as good as guarding spirit in its abode; to exhale *qi* and retain the true is not as good as nurturing *qi* and preserving *qi*. Spirit is the transformation of *qi*; without spirit, *qi* does not remain. Thus, spirit and *qi* are like mother and child, like heaven and earth—they cannot be separated even for an instant.\n\nThose skilled in practice internally secure *qi*. This securing is not forced but arises naturally from the continuity of breath. As *qi* congeals, breath becomes even, and spirit naturally abides. At first, sitting is like a child falling asleep; over time, it is like a weary laborer shouldering a burden. From the legs to the navel, from the waist upward, one does not seek it. The heart is slightly tranquil, *qi* seems cut off. At this moment, what does the Dao-knower know of spirit? Understanding its transformation, who knows of the embryo? This embryo is not the embryo that births sons and daughters—it is the origin. The key lies in risking death at Hongya, forgetting the body like grass and trees, dying the heart like cold ashes. Unaware of self, unaware of body, after a brief moment when the wind’s sound and rain’s intent settle, breath is no more! *Qi* secures itself, spirit becomes numinous, and the embryo forms.\n\nIf this is so in the quiet of evening, what of daytime distractions? Simply savor the formula and verse—all will be understood.\n\nThe formula states:\n*I use what does not use me,*\n*The spirit-terrace is bare and pure.*\n*Thought after thought, in the cinnabar field,*\n*With the heart, let go.*\n*Eyes and ears cut off seeing and hearing,*\n*The mouth, though present, is as if mute.*\n*A single point like the great void—*\n*Let it be, whether “this” or “that.”*\n\n**Chapter Twenty: Cultivating Virtue and Aiding All Beings**\n\nBenevolence is the root of virtue; virtue is the foundation of the Dao. Those without benevolence cannot speak of the Dao; those without virtue cannot discuss transformation. Many practitioners prioritize longevity, seeking immortality, yet fail to understand what true longevity and immortality are. They strive to surpass others through contrivance, deceive themselves with artifice, delight in the affairs of mountains and forests without their purity, and seek celestial cranes without thoughts of benefit. Goodness has yet to take root while evil already manifests—like clutching prayer beads while stirring litigation, or holding rituals to strike others. Such people are unworthy of discussing the Dao.\n\nThose capable in practice see another’s peril and rescue them, another’s distress and aid them, another’s fall and lift them. They feel another’s illness as their own, transform another’s wrongdoing, and upon seeing another’s beauty, do not entertain private desire. They revere another’s devotion to the truth as their own. Entering the Dao, they practice it; encountering karma, they abandon it. Then, they are frugal with themselves and generous with others, free from discord within or without, honoring parents with reverence. They cultivate simplicity for themselves and abundance for others. Such a person, in seeking truth, will be met with truth; in cultivating the Dao, will achieve the Dao. Moreover, they benefit descendants and transcend nine generations of ancestors—how sublime!\n\nThe formula states:\nThe Dao arises from virtue,\nOnly with virtue can one know the Dao.\nHeaven and earth’s great virtue is life;\nSages and worthies are likewise made.\nLongevity is the one true path,\nImmortality is the Dao itself.\nDao, virtue, nature, and life—\nThese four are perfectly clear.\n\n---\n\n**Chapter Twenty-One: Honoring the Master and Revering the Ancestors**\n\nBefore the primordial chaos divided, one could not perceive the *qi* of heaven, earth, and the three powers. Without the Dao established, how could one understand the causes of parents and the myriad beings? Thus, where there is a root, there are branches; where there is a source, there are streams. Had the Most High not opened the Dao through transformation, had Laozi not set forth teachings, how could one recognize the rites of devotion?\n\nWith the Dao but no affinity, the Dao remains distant. With affinity but no master, the Dao is not clearly encountered. Collecting vast alchemical texts is inferior to seeking the formula; consulting many extraordinary people is inferior to preserving it within oneself. Thus, those who point are deluded; those who transform are upright; those who practice attain the Dao.\n\nTherefore, ancestors must not be forgotten, and masters must not be neglected. When ancestors’ merits accumulate, descendants flourish; when masters are unclear, the root source is obscured. The Dao is specialized through virtue, revered through ancestors, and respected through masters—it must not be abandoned for even a day.\n\nThe formula states:\nThe *qi* of the One is the Dao’s ancestor,\nA single word is the Dao’s master.\nThe ancestral *qi* must not be distanced,\nThe Dao’s words must be known day and night.\nWhen descendants encounter this,\nIt is due to their parents’ hidden virtue.\nDo not rely solely on oneself—\nKnow that it lies in the ancestors’ legacy.\n\n---\n\n**Chapter Twenty-Two: On Attainment and Non-Attainment**\n\nOne who has not traversed the vast sea does not know the peril of wind and waves; one who has ascended Mount Tai only then respects the danger of its peaks. At first, it seems easy to neglect; in the end, it is difficult to practice.\n\nThe Dao encompasses heaven and earth; humans embrace the three powers. Yet all day, they wander in confusion, unaware of its mysteries. Upon entering, they say: the heights of the clouds must be habitable, the depths of the abyss must be reachable. This is the limited skill of a performer, the water of a well-frog.\n\nThe greatness of the Dao cannot be measured; its subtlety, who can fathom? The trivial leaks of the five chapters are exhausted—there is no need to roam mountains and forests in search of wonders, nor to seek scriptures or visit extraordinary friends. Heaven and earth are a single vessel; the myriad beings of the Dao and virtue are all contained within this text.\n\nNow that you have attained knowledge, act as if you have not, striving daily. If you have not yet attained, do not belittle later learners, do not disdain the scriptures, do not forget the ancestral root. The Dao transcends forced names—do not say that those who claim attainment have attained. Only when there is truly no attainment is there eternal attainment.\n\nThe formula states:\nYearn as if parched, seek day and night.\nWith true karmic affinity, encounter the Dao and virtue.\nThe heart ever feels inadequate—\nThis is the highest attainment.\nBeware of fullness, lest it bring reversal and loss.\n\n---\n\n**Chapter Twenty-Three: Saving the Living and Delivering the Dead**\n\nThe Dao transforms through virtue; virtue gives rise to sincerity, and sincerity transforms into reverence. When reverence issues forth as one, the hundred spirits guard it. Thus, to preserve it is to have spirits—this is called \"guard\"; to nurture it is to have qi—this is called \"true.\" A single exhalation can become auspicious clouds; a single breath can become rain and dew. Circulating it can make one a Lord of Southern Florescence; refining and transmuting it can deliver those long submerged in dark obscurity. It is neither talisman nor incantation, neither spirit nor general, neither departure nor arrival. It is but one qi, one heart, one silence, one vigilance, one Dao, one virtue—one self. Applied to saving the living, illnesses are cured; applied to delivering the dead, the dead are transformed. So vast is this—what but the Dao could achieve it? So exalted is this—one must guard it earnestly! One must practice it earnestly!\n\nThe formula states:\nThought is the Dao; the Dao is the talisman.\nGhosts and demons flee in haste; the dark netherworld revives.\nSilent offering lies within me; Heaven above naturally responds.\nSaving the living and delivering the dead—\nLike a fist unclenched, all unfolds with ease.\n\n**Chapter Twenty-Four: The Scripture’s Perfect Completion**\n\nThe practice of merit, the cultivation of virtue, the application of the Dao, the essence of the scriptures—these can illuminate the Three Realms, penetrate the Five Phases, transcend the nine generations of ancestors, and transform the myriad beings. This is the scripture.\n\nAmong the lesser versions of this scripture in the world today, there are three:\nThe first, in the *jiashen* year, returned to the great waves, drowned and never recovered.\nThe second, from the *dingyou* year, was consumed by raging flames, reduced to ashes.\nLater revelations, though descended again, diverged in wording and obscured in principle, like earth compared to jade.\n\nThough it has descended once more, the long loss to flood and fire nearly erased it. Its return today is due to the profound reverence and great joy of devotion, and so it has been bestowed upon your household. You should uphold it, guard it, treasure it, and revere it. When merit, practice, virtue, and the Dao are perfectly complete, you may ascend.\n\nDo not show it to those unworthy, lest they treat it with disdain. The retribution for transgression is severe, and the precepts are not trivial!\n\nThe formula states:\nAncestors possessed inherent virtue,\nThus the true Dao was received.\nThe true Dao, once spread,\nFrom beginning to end, is your creation.\nMerit lies in diligent cultivation;\nVirtue lies in compassion and filial piety.\nWhen virtue and the Dao are complete,\nThe entire household enjoys sublime fortune.\n\nThis scripture was bestowed by the Northern Pole Lord of Thunder Peak, the Golden Watchtower Incarnation of Primordial Essence, who pitied the multitude of beings lost in delusion, their true nature unawakened, their spiritual gate unopened. It descended through brush to the Daoist devotee Liu Yuanrui’s home, intending to spread its transmission and propagate its teachings. Yet Yuanrui failed to grasp the sagely intent, hiding the divine original among literary treasures, concealing it in a repository of offerings, and thus the profound mysteries of the teaching remained unilluminated.\n\nAfter Liu Yuanrui’s passing, the copy preserved in his household was obtained and treasured by Zheng Guan, who had it carved onto blocks and printed for circulation. May those who study the Dao and cultivate truth thereby awaken to its wondrous principles and comprehend this cause.\n\nZheng Guan, however, fears that in future transcriptions, the celestial script’s calligraphy may be misconstrued by vulgar minds, with errors in characters, omissions, or unwarranted additions. It is fitting that those of penetrating insight correct and verify them.\n\nRecorded by the long-devoted Daoist disciple Dong Zhengguan in the auspicious summer month of the *xinyou* year of the Jingding era.\n\n*Here ends the* Supreme Scripture of Cultivating Truth and Embracing the Primordial Wondrous Dao.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上修真体元妙道经 经名：太上修真体元妙道经。 一卷，南宋刘元端撰。 底本出处：《正统道藏》洞真部本文类 通玄三教眉山师仁寿授 混极未判章第一 厥初一混肇於未形，包含而万有潜冥，蒙昧而三因隐忒。 似炁非炁，若象无象，块然如不物非物之状，朴矣！ 於似类远类之仪，四极内括，三才中含，利刀不可以力剖，巨棒禾能以棰攻，太清三境若芥子藏之而不露，人道万汇如恒沙而莫数，炁类含胞，形同鸡卵，以之内分两仪，乾坤何在？ 以之中包五炁，水本何生。 沙内之金，石中之玉，不假一凿一洗，何由得分也？ 故朴散则太极开，形具则万象有。 其为大也若是，其为潜也若是，其为深也若是，其为港也若是，其曰道也，乃含真也。 诀曰：无形无象，无臭无声，天地未判，我何以名？ 冥如在璞，混然一宁，如此妙用，兹道之程。 通玄三教眉山师仁寿授 朴散分形章第二 浑沦凝霭之未凿，动静阴阳之俱泯，欲升者未得其升，将肇者未得於肇。 惺之含蠢，蠢以包惺，莫能指也，氤氤乎如烟重之晦，岚氲氲兮若雾冥而笼水。 此混者．乃阴欲散而阳欲扬，此极者乃阳将畅而阴欲分，故不混极，难以生化，冥於道者，以默而参之。 蠢丑江切， 诀曰：二炁混沦，三才未分，中含万有，欲开未形。 非极不化，无动不宁，生化化生，开扃阖扃。 通玄三教眉山师仁寿授 一炁分三章第三 炁凝而结，既结则混混而不分，分之在中，养之清者，其炁升； 沈之浊者，其炁坠。 均之不偏者孕於中，故中在极之化，化以极而分。 如投水於烈焰之中，若剖卵於利刀之下。 炁之一散升清，炁运荡，随清而化。 清者阳也，日天，坠浊炁滞厚，随浊而凝。 浊者阴也，曰地，上以乾十日之极，而至阳能健者是也。 下以坤十二辰之极，而至阴能化者是也。 二炁既剖，何者为人，清乃天之祖，浊乃地之源，秀在乎中，发之於类，即类成象，始有含灵，人道兆也。 欲明二炁之始，人道之初，宜於中而求之。 诀曰：一炁始判，二仪具生，中有人道，包含万灵。 我同天地，何其自分，道化在此，归之以明。 通玄三教眉山师仁寿授 炁开象兆章第四 始一生三，因三成四，即四分五。 一生三者，天地人； 三成四者，东西南北； 五之生者，金木水火土也。 何谓？ 以水为一也，盖自极未分，其体纯阴，散而化炁，故炁即生炁，炁而有人。 炁炁而化者，水也，其生於木，其化於火，其归於土，乃当来坠之炁也。 故养 生於金也。 金者，乃五炁之极，至此不能反，复化为雨露霜雪，亦当来水之意也。 故五炁终绝，颠倒推之，以金为水之母，以土为水之父, 以火为水之祖。 何也？ 日之有波，月之有曜者是也。 於五炁之论，以水为初为肾者，何也？ 人在胎胞，如混沦未分之间，却以土一火二者，又何也？ 故婴儿一生，天门便开，地户常塞，三岁始言，生於贤也。 又非水一木二，金三火四者，抑何也？ 修真者宜於反观之。 故阴符之指，悉居此也。 诀日：一炁既散，天地人存，五行四极，水木之论。 居腹有息，混混沦沦，消息此意，乃上道门。 通玄三教眉山师仁寿授 万象含化章第五 二炁既化，随清者运，浊者动，故炁有升降，类有生旺，物有荣桔，事有代谢，五炁各居於一也。",
      "translated_text": "**The Supreme Scripture on Cultivating the True and Embracing the Mysterious Dao of Primordial Oneness**\n\n**Scripture Title:** *The Supreme Scripture on Cultivating the True and Embracing the Mysterious Dao of Primordial Oneness*\nOne fascicle, composed by Liu Yuanduan of the Southern Song.\nBase text from: *Daoist Canon of the Zhengtong Era*, *Section of Cave Truth*, *Category of Original Texts*\n\n---\n\n**Transmission of the Three Teachings of Mysterious Unity by Master Renshou of Meishan**\n**Chapter One: The Unmanifest in Primal Chaos**\n\nAt the very beginning, the One Chaos arose before form, enfolding the myriad existences in obscurity. Vague and dim, the Three Causes lay concealed in latency.\nIt seemed like *qi* yet was not *qi*; it resembled an image yet had no image. A shapeless mass, neither thing nor non-thing—such was its simplicity!\nIn its semblance of distant likeness, it embraced the four limits within and contained the Three Powers at its core. No sharp blade could force it open, no mighty cudgel could strike it asunder. The Three Realms of Great Clarity were as a mustard seed hidden within, unseen; the ten thousand transformations of the human Dao were as countless as the Ganges’ sands. The *qi*-types held their embryos, their forms like a hen’s egg. From within, it divided into the Two Modes—where then were Qian and Kun? From its midst, it enveloped the Five *Qi*—whence did Water arise?\nGold within sand, jade within stone—without a single chisel or washing, how could they be separated?\nThus, when simplicity scatters, the Great Ultimate unfolds; when form takes shape, the myriad images appear.\nSo vast was it, so hidden was it, so profound was it, so boundless was it—this was called the Dao, for it contained the True.\n**Secret Formula:**\n*No form, no image, no scent, no sound—*\n*Before Heaven and Earth divided, how could I name it?*\n*Obscure as uncut jade, merged in utter tranquility,*\n*Such wondrous function marks the Dao’s course.*\n\n---\n\n**Chapter Two: The Scattering of Simplicity and the Division of Forms**\n\nBefore the undrilled mass of primordial haze congealed, movement and stillness, yin and yang were both obliterated. That which sought ascent could not ascend; that which was about to begin could not begin.\nDrowsy yet containing slumber, slumber yet enfolding drowsiness—none could point to it. Vaporous and dense, like the gloom of layered mist; billowing and hazy, like the obscurity of fog veiling water.\nThis chaos was yin’s desire to scatter and yang’s urge to rise; this extremity was yang’s impending flourishing and yin’s impending division. Without the chaos of extremity, generation and transformation could not occur. Those who fathom the Dao contemplate it in silence.\n**Secret Formula:**\n*The Two Qi merge in chaos, the Three Powers undivided,*\n*Enfolding the myriad existences, poised to unfold yet unformed.*\n*Without extremity, no transformation; without movement, no tranquility.*\n*Generation transforms, transformation generates—opening and closing, closing and opening.*\n\n---\n\n**Chapter Three: The One Qi Divides into Three**\n\nWhen *qi* congealed and coalesced, it was turbid and undifferentiated. Its division lay within: that which was refined and nurtured ascended; that which was heavy and sunk descended. The balanced and unbiased gestated at the center. Thus, the center was the pivot of transformation, and transformation divided through the pivot.\nLike casting water into raging flames, or cleaving an egg with a sharp blade—\nWhen the One *Qi* scattered, the refined ascended, and the *qi* surged and churned, transforming with the clear.\nThe clear was yang, called Heaven. The heavy and turbid *qi* sank and coagulated, congealing with the turbid.\nThe turbid was yin, called Earth.\nAbove, it was Qian’s extreme of ten suns, where utmost yang was vigorous. Below, it was Kun’s extreme of twelve earthly branches, where utmost yin was transformative.\nOnce the Two *Qi* were sundered, what then was Man?\nThe clear was Heaven’s ancestor; the turbid was Earth’s source. The essence resided in the center, issuing forth in kind. When kind took form, it first bore the numinous—such was the inception of the human Dao.\nTo clarify the origin of the Two *Qi* and the beginning of the human Dao, one must seek it in the center.\n**Secret Formula:**\n*The One Qi first divides, the Two Modes come to be,*\n*The human Dao lies within, enfolding the myriad spirits.*\n*I am one with Heaven and Earth—why this division?*\n*The Dao’s transformation lies here; return to it in clarity.*\n\n---\n\n**Chapter Four: The Qi Unfolds and Images Emerge**\n\nFrom the One came the Three; from the Three came the Four; from the Four came the Five.\nThe One generating the Three: Heaven, Earth, and Man.\nThe Three completing the Four: east, west, south, and north.\nThe Five’s generation: Metal, Wood, Water, Fire, and Earth.\nWhat does this mean?\nTake Water as the One. Before the ultimate divided, its body was pure yin. Scattered, it transformed into *qi*; thus, *qi* gave rise to *qi*, and *qi* gave rise to Man.\nThat which *qi* transforms into *qi* is Water. It is born of Wood, transforms through Fire, and returns to Earth—this is the *qi* of future descent.\nThus, life is nurtured by Metal. Metal is the extreme of the Five *Qi*; having reached this point, it cannot revert. It transforms into rain, dew, frost, and snow—this is the meaning of Water to come.\nWhen the Five *Qi* ultimately cease, reverse the sequence: take Metal as Water’s mother, Earth as Water’s father, and Fire as Water’s ancestor.\nWhy? The sun’s waves and the moon’s radiance exemplify this.\nIn the discourse on the Five *Qi*, why is Water the first and the kidneys? Because Man in the womb is like the undivided chaos. Yet why are Earth as One and Fire as Two?\nWhen an infant is born, the Gate of Heaven opens, while the Gate of Earth remains sealed. At three years, speech begins—born of wisdom.\nYet it is not Water as One, Wood as Two, Metal as Three, and Fire as Four—why is this? Those who cultivate the True should observe this in reverse.\nThus, the *Yinfu*’s indications all reside herein.\n**Secret Formula:**\n*Once the One Qi scatters, Heaven, Earth, and Man endure.*\n*The Five Phases and Four Limits—discourse on Water and Wood.*\n*Abiding in the abdomen, breathing in chaos,*\n*Grasp this meaning—it is the gateway to the Supreme Dao.*\n\n---\n\n**Chapter Five: The Myriad Images Contain Transformation**\n\nOnce the Two *Qi* transformed, the clear circulated and the turbid moved. Thus, *qi* had ascent and descent; kinds had birth and flourishing; things had prosperity and withering; affairs had succession and decline. The Five *Qi* each resided in the One.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1273,
      "start_sentence": 0,
      "end_sentence": 62,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.96554732322693,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "居东者则曰青阳，居西者则曰白藏，居南者则曰朱明，居北者则曰玄英。 以散而聚，以归而一，故中极为央也。 此於四炁，四节四方，各以三月之炁，而包含土也。 然 根於土，生於木，滋於水，凋於金，而枯於火，杀杀之不绝，绝之复生者，以四时各含於土也。 春有黄花，乃木含土，辰支有也； 夏长黄花，乃火含土，午支有也； 秋迸黄花，乃金含土，申支有也； 冬发黄卉，乃水含土，亥支有也。 五行五炁，五象五方，无包不成，无含不化。 东方寅为木，却为火之生； 西方金在巳，却亦火之余。 以水之局，则中含火土； 以火之局，中包上之炁，相生相克，悉包悉化。 故一核二芽，三甲四叶，五枝六干，七花八果，九实十凋。 即天一地二，天三地四，天五地六，天七地八，天九地十也。 道之以一炁，当守一，自一至十，皆包含之中，而存不言之化，故太一含真是也。 修真之士，体此而行之。 诀曰：自一生三，万象中含，天地中运，阴阳密旋。 一点祖炁，四时行焉！ 如能会得，造化齐肩。 通玄三教眉山师仁寿授 因虚化实章第六 浮游之无祖，虚无之有源，皆自一炁之散，五炁之值也。 上之虚乃清炁之化，则名曰寥廓； 下之实乃浊炁而生，则名曰岳渎也。 故因虚者，乃有阳存焉； 因实者，乃有阴存焉。 故子为虚，午为实也。 午之炁乃阴，而火旺於此，则实也。 子之炁乃阳，而水旺於此，则虚也。 无虚则不知实，无实则不明虚。 然土为实也，何十二时不露也？ 炁为虚也，何三清之境化焉？ 以 虚求实则易，以实求虚则难也。 虚之於天有风，有雨，有霜，有雾，有霭，则或聚或散，乃虚实之始也。 以地之实，则有山有海，有林有稼，何海竭江涸，山颠土震？ 此虚实之感也。 因无化有者，虚之实； 即有化无者，乃实之虚。 始自父母情性之所感，终成形貌凛然，此乃虚之实也。 及其五欲萌，一真散，复求其情性之元，不可得也。 此虚求实易，实求虚之难也。 故学道之士，以先天为基者，正合此也。 诀曰：因虚成炁，即炁化类，实自类生，累因实惫。 虚裹求实，虽难即在，实有太实，水火不坏。 通玄三教眉山师仁寿授 性情化育章第七",
      "translated_text": "**Chapter Six: From Void to Substance**\n\nDwelling in the East, it is called Green Yang; dwelling in the West, White Storehouse; dwelling in the South, Vermilion Brightness; dwelling in the North, Dark Splendor. Scattered, they gather; returning, they unite—thus the Central Ultimate is the pivot. Here, the Four *Qi*, Four Seasons, and Four Directions each embrace Earth within three months’ *qi*. Yet roots lie in Earth, birth in Wood, nourishment in Water, withering in Metal, and desiccation in Fire. Though destruction never ceases, what is cut down revives—because the Four Seasons each contain Earth. In spring, yellow blossoms appear, for Wood embraces Earth (present in the *chen* branch); in summer, yellow blooms flourish, for Fire embraces Earth (present in the *wu* branch); in autumn, yellow flowers emerge, for Metal embraces Earth (present in the *shen* branch); in winter, yellow shoots arise, for Water embraces Earth (present in the *hai* branch). The Five Phases, Five *Qi*, Five Images, and Five Directions—nothing is complete without embrace, nothing transforms without containment.\n\nIn the East, *yin* is Wood, yet it is the birthplace of Fire; in the West, Metal resides in *si*, yet it is the remnant of Fire. Within Water’s domain, Fire and Earth lie concealed; within Fire’s domain, the *qi* of Earth is enfolded. Generation and restraint, all embrace, all transform. Thus: one kernel, two sprouts, three husks, four leaves, five branches, six trunks, seven flowers, eight fruits, nine seeds, ten witherings—this is Heaven One, Earth Two; Heaven Three, Earth Four; Heaven Five, Earth Six; Heaven Seven, Earth Eight; Heaven Nine, Earth Ten. The Dao operates through the One *Qi*; one must guard the One. From One to Ten, all are contained within it, preserving the transformation of the unspoken. Thus, the Great One embraces true reality.\n\nThose who cultivate the True should embody and practice this.\n\n**Secret Formula:**\n*From One, the Three arise—*\n*myriad images contained within.*\n*Heaven and Earth revolve at their center,*\n*yin and yang in secret rotation.*\n*A single speck of ancestral qi—*\n*the Four Seasons move therein!*\n*If you can grasp this,*\n*you stand shoulder-to-shoulder with Creation.*\n\n**Chapter Seven: The Transformation of Nature and Emotion**\n\nThe floating and the wandering have no ancestor; the void and the nonexistent have a source—all arise from the scattering of the One *Qi* and the alignment of the Five *Qi*. The void above is the transformation of clear *qi*, called the Vast Expanse; the substance below is born of turbid *qi*, called the Mountains and Rivers. Thus, what arises from the void harbors yang; what arises from substance harbors yin. Therefore, *zi* is void, *wu* is substance. The *qi* of *wu* is yin, yet Fire flourishes here—thus it is substance. The *qi* of *zi* is yang, yet Water flourishes here—thus it is void. Without void, substance is unknowable; without substance, void is unclear.\n\nYet Earth is substance—why does it not manifest in the twelve hours? *Qi* is void—why does it transform into the Three Pure Realms? Seeking substance through void is easy; seeking void through substance is difficult. In the void of Heaven, there is wind, rain, frost, mist, and haze—now gathering, now scattering—this is the origin of void and substance. In the substance of Earth, there are mountains, seas, forests, and crops—yet why do seas dry, rivers run dry, mountain peaks crumble, and earth quake? This is the resonance of void and substance.\n\nWhat arises from nothing to become something is the substance of void; what arises from something to become nothing is the void of substance. Beginning with the mutual resonance of parents’ nature and emotion, a form with awe-inspiring presence takes shape—this is the substance of void. Yet when the Five Desires sprout and the One True scatters, seeking the original nature and emotion becomes impossible—this is the ease of seeking substance through void and the difficulty of seeking void through substance.\n\nThus, those who study the Dao take the prenatal as their foundation—this is precisely in accord with it.\n\n**Secret Formula:**\n*From void, qi is formed;*\n*from qi, kinds arise.*\n*Substance is born of kinds,*\n*and weariness follows substance.*\n*Seeking substance within void—*\n*though difficult, it lies within.*\n*Yet if substance is too substantial,*\n*Water and Fire cannot destroy it.*",
      "overlap_context": "Man endure.*\n*The Five Phases and Four Limits—discourse on Water and Wood.*\n*Abiding in the abdomen, breathing in chaos,*\n*Grasp this meaning—it is the gateway to the Supreme Dao.*\n\n---\n\n**Chapter Five: The Myriad Images Contain Transformation**\n\nOnce the Two *Qi* transformed, the clear circulated and the turbid moved. Thus, *qi* had ascent and descent; kinds had birth and flourishing; things had prosperity and withering; affairs had succession and decline. The Five *Qi* each resided in the One.",
      "start_char": 1273,
      "end_char": 2112,
      "start_sentence": 63,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.819081783294678,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "炁既一分，象随此明，故居其穹者，则曰日月星、风雷电； 隐其下者，则日山川草木、禽虫之类。 始之无性，因动而感，故有情也。 情之一动，性复随焉！ 在草木则感秀，在渊渍则感炁，皆从阴而生於阳也。 既有性则有欲，既有欲则生情，故草木当日至，则性成也。 柳复为柳，花再成花，昆虫蠢动 者，即动而化，皆自日至之所肇也。 日至者，乃冬日之至也。 冬日者，即子也，子者，乃一阳之始也。 在卦曰复，复者，返也。 然后天地万物之性情，从兹而通也。 万物既如此，人性情自何有也？ 缘人之自顶至踵，一身骨毛炁血，动静开阖，皆同天地万物也，故从虚情而感实性也。 然后一入此情，即随此性，感而化，有血有珠，有块有胎，故曰妊也，乃水之一也。 故生阳者阴也，非阳生阴也，道之为用，能以情性作大药者，乃善於道也。 如此则天地万物之情，父母未育之性，若开鉴以照容，朗然可目也。 诀曰：厥初一炁，分成性情，散之转晦，敛之则生。 三才本一，何立外程，但求感合，体自圆明。 通玄三教眉山师仁寿授 日月星炁章第八 纯阳之炁升於左，纯阴之炁降於右，中孕之炁悬於正。 乾之一化，化以十日是太阳。 又曰独阳岂成造化，故九日沈之，一日浴之，九既降下，则成六，六者，方生阴也。 故月之光，有藉於日之华也。 须弥之外，寥霄之左币右旋，月常不及日者，盖独纯阴之故也。 乾有日秀，坤有月之孕者，乃阴存阳，阳恋阴也。 日有出没升高，始出地，发於水，升於空，照於象，只能昱昼，不能明夕也。 月有晦朔弦望，圆阙生沈者，即当来藉阳之故，每多不足，故所行迟而速币，雨於三十，不能益於朝朝尔，此日月之道也。 何大光大晔，明於外，烛於物，不能透於覆盆，何也？ 以其无隙也。 隙者，乃开化也，开化万象，星也，星者，亦自日之生也，下应於人。 日秖能转於阳，月柢善旋於阴，斡迁四序，代谢五行，运齐七政者，星也。 然星之应有不定不一，易变之道，故以斗统之也。 星可妄移，斗不可苟动，日夕之悬，朗朗於天，故其莫敌於日者，盖亦余炁也。 然日月有常星无常者，是也。 元始一判，天地人分，日月星兆也。 三炁混合，复归於一，乃先天之道也。 诀曰：乾有大晶，月生大灵，上下孕秀，其中作星。 天主阳化，地主阴衡，三才一炁，本之化生。 通玄三教眉山师仁寿授 默参显体章第九",
      "translated_text": "Once qi divides, images follow this illumination—thus, what dwells above the vault are called the sun, moon, and stars, wind, thunder, and lightning; what lies concealed below are called mountains and rivers, grasses and trees, birds and insects. Initially without nature, they respond to movement and thus possess emotion. When emotion stirs, nature follows! In grasses and trees, it manifests as flourishing; in deep pools, it manifests as qi—all born of yin yet generated by yang. Once nature exists, desire arises; once desire exists, emotion is born. Thus, when the solstice arrives, grasses and trees fulfill their nature: willows remain willows, flowers return as flowers. The stirring of insects—this transformation through movement—all begins with the solstice. The solstice is the winter solstice, which is *zi*, the inception of yang. In the hexagrams, this is *Fu* (Return), meaning \"to revert.\" Thereafter, the nature and emotion of heaven, earth, and the myriad things flow through this. If all things are thus, how does human nature and emotion arise? From crown to sole, a person’s bones, hair, qi, and blood—every motion and stillness, opening and closing—mirror heaven, earth, and the myriad things. Thus, from void emotion, one resonates with true nature. Once enveloped in this emotion, one follows this nature, responding and transforming—possessing blood and pearls, clods and embryos—this is called conception, the first of Water. Therefore, it is yin that gives birth to yang, not yang that gives birth to yin. The function of the Dao lies in using emotion and nature as the great elixir—this is mastery of the Dao. Thus, the emotions of heaven and earth and the prenatal nature of parents become as clear as a mirror reflecting one’s visage.\n\n**Secret Formula:**\n*At first, the one qi divides into nature and emotion;*\n*scattered, it turns obscure—gathered, it gives life.*\n*The Three Powers share one origin—why set external measures?*\n*Seek only resonance and union, and the body becomes luminously whole.*\n\n---\n\nPure yang qi ascends to the left, pure yin qi descends to the right, while the central qi of gestation hangs in the center. The single transformation of *Qian* (Heaven) unfolds over ten days—this is the Great Yang. Yet it is said: \"How can solitary yang accomplish creation?\" Thus, nine days are spent in descent, one day in bathing. Once the nine descend, they form six—six being the inception of yin. Therefore, the moon’s light borrows the sun’s radiance. Beyond Mount Sumeru, in the vast heavens, the leftward and rightward revolutions of the celestial bodies leave the moon perpetually trailing the sun—this is due to its pure yin nature. *Qian* possesses the flourishing of the sun, *Kun* (Earth) the gestation of the moon—yin preserves yang, and yang yearns for yin. The sun rises and sets, ascending high: at first emerging from earth, it bursts forth from water, ascends into the void, and illuminates images—yet it can only brighten the day, not the night. The moon waxes and wanes, from new moon to full, from crescent to gibbous—its phases arise from borrowing yang, yet it is often deficient. Thus, its motion is slow or swift, lingering for thirty days without daily renewal—such is the Way of the sun and moon.\n\nWhy is it that their great brilliance, shining externally and illuminating things, cannot penetrate an overturned basin? Because there is no gap. A gap is the opening of transformation—through which the myriad images arise: these are the stars. Stars, too, are born of the sun, corresponding below to humanity. The sun merely revolves through yang, the moon merely circles through yin, but it is the stars that govern the turning of the four seasons, the succession of the Five Phases, and the alignment of the Seven Governors. Yet the stars’ correspondences are unstable and shifting, following the Way of change—thus, they are governed by the Dipper. Stars may wander, but the Dipper does not move carelessly; suspended day and night, luminous in the heavens, nothing rivals the sun—it, too, is but residual qi. Thus, the sun and moon have constancy, while the stars do not.\n\nAt the primordial division, heaven, earth, and humanity took form—signified by the sun, moon, and stars. When the three qi merge and return to oneness, this is the Dao of the prenatal.\n\n**Secret Formula:**\n*Qian holds the great crystal, the moon births great numen;*\n*above and below gestate flourishing—within, stars take shape.*\n*Heaven governs yang’s transformation, Earth governs yin’s balance;*\n*the Three Powers share one qi—rooted in the origin of creation.*",
      "overlap_context": "possible—this is the ease of seeking substance through void and the difficulty of seeking void through substance.\n\nThus, those who study the Dao take the prenatal as their foundation—this is precisely in accord with it.\n\n**Secret Formula:**\n*From void, qi is formed;*\n*from qi, kinds arise.*\n*Substance is born of kinds,*\n*and weariness follows substance.*\n*Seeking substance within void—*\n*though difficult, it lies within.*\n*Yet if substance is too substantial,*\n*Water and Fire cannot destroy it.*",
      "start_char": 2112,
      "end_char": 3036,
      "start_sentence": 112,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.178680419921875,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "始於情感，遂堕此中，恭诺之下，男女成形。 来从五炁，中秉二仪，故未育未生之前，居母腹中，饮血受胞，以手掩其目，以两足拳於颔，母之一吸，子亦吸之，母之一吐，子亦吐之。 凡百动荡，内外相感，何识何知？ 何明何晓？ 天之炁混之，地之炁混之，人之炁亦混之，但有一息存焉。 及其分育，天翻地覆，人惊胞破，如行大山颠失足之状，头悬足撑，而出之。 大叫一声，其息即忘。 故随性随情，不可俱也。 胎之一息，元复再守也，况乳以沃其心巧以玩其目，爱以牵其情，欲以使其神，如此渐渐有茫茫之隔，衅衅之端，无复守胎之一息也。 学道之士，当味此章，以求其要耳。 诀曰：始於混沌，中成胎孕，七情六欲，归于一定。 出入呼吸，当来真性，胎息胎息，道中玄牝。 经名：太上修真体元妙道经。 一卷，南宋刘元端撰。 底本出处：《正统道藏》洞真部本文类。 太上修真体元妙道经叙 通玄三教眉山师仁寿授 道本元言，亦元其名，天本不语，万象旋焉。 始自虚元中含妙一，自三黑之内，融后二仪之分判。 三炁者，元初、元始、元极也。 不极则元变，无变则无象。 象者，群类之本，万物之所由也。 而化四极，四极之分，而天地四方，阴阳寒暑，荣枯代谢，随类而消长也。 故五行之炁，以一炁化水而生木，木生火，火生土，土生金也。 而生生化化之道，从兹而有。 既有之后，必曰无，无有有无之数而生旺休囚，沈潜隐显而有以滋之，滋之既深，则生炁。 非炁也，炁既一生，则三才始肇，而人居其中。 始也於一炁，终也散万化，故情性喜怒好恶，随蔓而枝也，则曰父母，夫妇男女，始极终化，即类成象，起於混一，散於万有，岂非其道也哉！ 通玄三教眉山师仁寿授 甲庚应数章第十",
      "translated_text": "At its inception lies emotion and attachment, and thus one falls into this realm. Beneath the vow of reverence, male and female take form. They come from the five qi, and within, they hold the dual forces of heaven and earth. Thus, before nurturing and before birth, dwelling in the mother’s womb, they drink blood and receive the placenta, hands covering their eyes, feet curled beneath the chin. With every breath the mother draws, the child draws as well; with every exhalation, the child exhales in turn. In all movements and tremors, inner and outer resonate—what awareness, what knowledge? What clarity, what understanding? The qi of heaven blends with it, the qi of earth blends with it, and the qi of humanity blends with it as well, yet a single breath remains. When the time of separation and birth arrives, heaven and earth seem overturned, the breaking of the placenta shocks the child—like one who, walking atop a great mountain, loses footing. Head suspended, feet braced, they emerge. With a great cry, that breath is forgotten.\n\nThus, they follow nature and follow desire, unable to hold both. The breath of the womb cannot be preserved a second time. Moreover, milk nourishes their cleverness, play delights their eyes, love tugs at their emotions, and desire commands their spirit. Gradually, a vast distance grows, the seeds of discord arise, and the breath of the womb is no longer guarded.\n\nThose who study the Dao should savor this chapter to seek its essential truth.\n\n**Secret Formula:**\n*Beginning in primordial chaos, gestation takes form within;*\n*the seven emotions and six desires settle into constancy.*\n*Inhalation and exhalation—where true nature returns;*\n*womb-breath, womb-breath—the Mysterious Female of the Dao.*\n\n**Text Title:** *The Supreme Scripture on Cultivating the Dao and Realizing the Wondrous Origin of the Body*\n\nOne scroll, composed by Liu Yuanduan of the Southern Song.\nSource edition: *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Benwen* category.\n\n**Preface to *The Supreme Scripture on Cultivating the Dao and Realizing the Wondrous Origin of the Body***\n\nThe Dao originates from the primal word, yet it has no name. Heaven itself does not speak, yet the ten thousand images revolve within it. From the void and origin, the wondrous One is contained; within the three darknesses, the division of the Two Modes later fuses. The three qi are the primordial origin, the primordial beginning, and the primordial ultimate. Without the ultimate, there is no transformation; without transformation, there are no images. Images are the root of all kinds, the source from which the ten thousand things arise. Through the transformation of the four limits, the four limits divide, giving rise to the four directions of heaven and earth, yin and yang, cold and heat, flourishing and withering, growth and decline—each following its kind.\n\nThus, the qi of the five phases transforms through one qi into water, which generates wood; wood generates fire; fire generates earth; earth generates metal. From this, the Dao of ceaseless generation and transformation arises. Once existence emerges, there must be nonexistence. From the interplay of existence and nonexistence, the cycles of birth, prosperity, decline, and death arise—sinking, rising, hidden, and manifest—each nourished in turn. When nourishment deepens, generative qi arises. Yet it is not merely qi; once qi is born, the Three Powers begin, and humanity dwells within them. At first, all arises from one qi; in the end, all scatters into the ten thousand transformations. Thus, emotions and nature, joy and anger, likes and dislikes branch like vines—giving rise to father and mother, husband and wife, male and female. From the ultimate beginning to the final transformation, kinds take form, arising from primordial unity and scattering into the ten thousand existences. Is this not the Dao?\n\n**Chapter Ten: The Correspondences of Jia and Geng**",
      "overlap_context": "onstancy, while the stars do not.\n\nAt the primordial division, heaven, earth, and humanity took form—signified by the sun, moon, and stars. When the three qi merge and return to oneness, this is the Dao of the prenatal.\n\n**Secret Formula:**\n*Qian holds the great crystal, the moon births great numen;*\n*above and below gestate flourishing—within, stars take shape.*\n*Heaven governs yang’s transformation, Earth governs yin’s balance;*\n*the Three Powers share one qi—rooted in the origin of creation.*",
      "start_char": 3036,
      "end_char": 3720,
      "start_sentence": 154,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.189067840576172,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "乾之干首於甲，坤之合应於庚。 甲自水之生，故居於东； 庚乃水之母，故育於西。 西者，虽言於肃，而申中有水土也； 故西庚之杀，而生於东甲，以其甲之炁在於寅，亦日三肠甲之三日。 甲之三日分於后，先庚之三日，庚之三日次於始末者，缘甲之合者己，已中有土故也，三阳交泰是也。 庚之所合者乙，中有木，木中有火，火可伏庚，不妨於水也。 圣道之妙，以甲居子乃印，印者正也，正者始也。 缘子下有水，水能生木、故甲子为首，至戌为终，盖戌乃火之库也。 甲必云庚者，水之母，缘申中有土，能生於金，至辰巳则绝，缘有火之杀也。 故善於道者，以甲子、甲辰、甲午三日之先炁，用庚子、庚辰、庚午之先合，凝然养息，自子至丑，从丑至寅、心无一毫之染，身如铁壁，调其炁而平其息，则天之干，地之合，我之炁，一时俱孚，三才三因之道，入目自足耳。 诀曰：三甲与三庚，后先生杀存，以时加此日天地炁俱行。 无想亦无妄，绵绵息息平，周天消息近，圆皎坐中生。 通玄三教眉山师仁寿授 存息养真章第十一 天之有窍而生风，地之有窍而生水，盖天窍不可、朋，而地窍易可窥。 窍之一开风从生，窍之一闭炁从塞，天地之窍，乃万象化生无穷之奥也。 天地能以窍而开，亦能以窍而息，息则地无可升，天炁可降也。 自子则天窍开，其炁清而降，自午则地窍塞，其炁浊而升，故动荡皆归於橐钥也。 橐钥者，一开一阖之谓也。 天以子为橐，地以午为钥，人以息而总。 昼夜推之，一万主千六百有余，即乾坤之数也。 善於道者，能存於息，明於窍者，真不劳而养也。 诀曰：四鼓天地交，而演方见韬，水火自然事，不须以意劳。 鼻中有两窍，天地不差毫，能於此时存，明月掌中捞。 通玄三教眉山师仁寿授 得一成道章第十二",
      "translated_text": "**Chapter Eleven: Nurturing the True through Breath**\n\nQian’s stem begins with *jia*; Kun’s union responds with *geng*. *Jia* arises from water’s birth, thus dwelling in the East; *geng* is water’s mother, thus nurtured in the West. Though the West is called stern, within *shen* lies water and earth. Thus, the West’s *geng* is destructive, yet life springs from the East’s *jia*, for *jia*’s qi resides in *yin*, also known as the third day of the threefold *jia*. The third day of *jia* divides afterward, preceding *geng*’s third day. *Geng*’s third day follows the beginning and end, for *jia*’s union is *ji*, and within *ji* lies earth—this is the harmony of the Three Yangs. *Geng*’s union is *yi*, within which lies wood; within wood lies fire, and fire can subdue *geng*, yet does not hinder water.\n\nThe marvel of the sagely Dao: *jia* resides in *zi* as the seal, and the seal is uprightness, uprightness is the beginning. Beneath *zi* lies water, and water can generate wood; thus *jia-zi* is the first, ending at *xu*, for *xu* is fire’s storehouse. *Jia* must be paired with *geng*, water’s mother, for within *shen* lies earth, which can generate metal. Yet at *chen* and *si*, it is cut off, for fire’s destructive force prevails.\n\nThus, those skilled in the Dao employ the prior qi of *jia-zi*, *jia-chen*, and *jia-wu* with the prior unions of *geng-zi*, *geng-chen*, and *geng-wu*, nurturing and resting in stillness. From *zi* to *chou*, from *chou* to *yin*, the mind remains unstained, the body like iron walls. Regulating qi and balancing breath, the stems of Heaven, the unions of Earth, and one’s own qi all resonate as one. The Dao of the Three Powers and Three Causes enters the eye and is naturally sufficient.\n\nThe formula states:\n*Three jia and three geng,*\n*First life, then destruction preserved.*\n*At the appointed hour, on these days,*\n*Heaven and Earth’s qi move as one.*\n*No thought, no delusion,*\n*Breath flowing ceaselessly, evenly.*\n*The microcosmic orbit nears completion,*\n*A luminous sphere arises within.*\n\n**Chapter Twelve: Attaining the One and Achieving the Dao**\n\nHeaven has apertures that generate wind; Earth has apertures that generate water. Heaven’s apertures are not easily discerned, while Earth’s may be observed. When an aperture opens, wind arises; when it closes, qi is obstructed. The apertures of Heaven and Earth are the profound mystery of the ten thousand images’ endless transformations.\n\nHeaven and Earth can open through apertures and also rest through them. When at rest, Earth’s qi cannot ascend, and Heaven’s qi can descend. From *zi*, Heaven’s apertures open, its qi pure and descending; from *wu*, Earth’s apertures close, its qi turbid and ascending. All movement and stillness return to the bellows. The bellows is the alternation of opening and closing. Heaven’s bellows is *zi*; Earth’s key is *wu*; humans encompass them through breath.\n\nTracing day and night, one cycle governs 1,600 and more—this is the number of Qian and Kun. Those skilled in the Dao, who can preserve breath and understand apertures, truly nurture without labor.\n\nThe formula states:\n*At the fourth watch, Heaven and Earth unite,*\n*Unfolding the subtle to reveal its depth.*\n*Water and fire are natural affairs,*\n*No need to labor the mind.*\n*Within the nose lie two apertures,*\n*Heaven and Earth not a hair’s breadth apart.*\n*If one can preserve this moment,*\n*The bright moon is grasped in the palm.*",
      "overlap_context": "manity dwells within them. At first, all arises from one qi; in the end, all scatters into the ten thousand transformations. Thus, emotions and nature, joy and anger, likes and dislikes branch like vines—giving rise to father and mother, husband and wife, male and female. From the ultimate beginning to the final transformation, kinds take form, arising from primordial unity and scattering into the ten thousand existences. Is this not the Dao?\n\n**Chapter Ten: The Correspondences of Jia and Geng**",
      "start_char": 3720,
      "end_char": 4424,
      "start_sentence": 184,
      "end_sentence": 210,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.44895601272583,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "一者，万象之祖炁，天地之根原，人心之大要也。 乾一而咸数，地一而成秀，人一而定情，盖不能齐之以一，而散之於万猬之中，而混塞其心，不可见其本原也。 天一则清，地一则宁，人一则德馨，身一则正，家一则齐，内一则不惑，外一则顺，心一则阴阳和，念一则邪僻远，性一则情不生，炁一则息自平，息一则水火交、天地泰，其可不一哉！ 诀曰：一者道之炁，炁乃一之源，人能求清争，但去一中寻。 不觉朝夕间，忽见水中金，得一后忘一，神存真可侵。 通玄三教眉山师仁寿授 得象元象章第十三 道不元言，亦不可泥言。 因炁成象，得炁则象者形诸类也。 殊不知因炁成类，即类成象，篇章之下，巧於发辞，不若指於实要，明於物象，视於变通。 然变通有道，篇章存辞，故曰善者未常辩，辩者皆不善，若井中之鱼，孰可以窥之哉！ 欲知水之乐，当问於鱼哉，此之谓也。 诀曰：始入未明象，见象方知意，识象是引门，何必以言泥。 一泥转忘初，撑舟不远地，不知痴俚人，却乃道中谛。 通玄三教眉山师仁寿授 育神团黑章第十四 成养神者必先养心，炼炁者宜於平息，故神自心有，心乃神舍，炁即息源，息因炁使。 善养於心者，必使皎之如清渊印月，静之若空谷元声，然后内境不动，外尘不干，念如一铁之沈波，性如太虚之 无着，争静渊默，物我两忘，神之自清，炁之自团也。 神即炁而凝，炁恋神而住，於此之时，不知其息之出入耳。 诀曰：始因其息，终得乎炁，炁息自守，我物俱弃。 动静两忘，神之方住，柢在养心，一丝勿起。 通玄三教眉山师仁寿授 神化出入章第十五 神之为用，非为造作，始自养心之有，终於存炁而生，如清波之照影，若明镜之对容也。 以有心求之，终莫之有，以元心求之，愈见其无。 若何可也？ 盖神贵不挠，心尚不思，守之如石，行之如愚，口元言而耳元听，念不起而性不流，如浊浆之初橙，自然清於上而滓於下，风不生而叶自停。 亦不知天地如何，亦不知我为甚物，既入於溟漠之中，即居混沌之所，如太极之未分，三才之未露，忽然一灵光自朗，如虚室生白之状，此皆无心中有，非有心之可为也。 故出入无方，变化随寓矣！ 诀曰：道以非名道，心皆忘自心，一时俱不识，方见谷中声。 水火非为事，阴阳在我生，坐中存溟涬，神化悉皆经。 通玄三教眉山师仁寿授 破惑守一章第十六 道之於物，物之於道，始於忘象，有三千六百之小门，而生八万四千之大惑，往往速於求异，稽於造真，千人万人之进学，无一无半之成道，以其惑之守也，不明其的也。 人皆以龙虎为首，非也； 以金丹赤药，非也；",
      "translated_text": "One is the primordial qi of the ten thousand images, the root and origin of Heaven and Earth, the great essential of the human heart. Qian unifies through one and completes its reckoning; Earth unifies through one and achieves its flourishing; humans unify through one and settle their nature. If one cannot align all with the One but scatters them amidst the ten thousand distractions, confounding the heart, the root and origin cannot be seen. Heaven’s One brings clarity; Earth’s One brings tranquility; the human One brings fragrant virtue; the body’s One brings uprightness; the household’s One brings order; inner One brings freedom from delusion; outer One brings compliance; the heart’s One harmonizes yin and yang; the thought’s One distances perversity; the nature’s One prevents emotions from arising; the qi’s One levels the breath; the breath’s One unites water and fire, bringing harmony to Heaven and Earth—how can one not seek the One?\n\nThe formula states:\n*One is the qi of the Dao,*\n*Qi is the source of the One.*\n*If one can strive for clarity,*\n*Seek only within the One.*\n*Unawares, between dawn and dusk,*\n*Suddenly gold appears in water.*\n*Having attained the One, forget the One—*\n*The spirit abides, truly inviolable.*\n\n---\n\nThe Dao does not cling to words, nor can it be confined by them. Through qi, images take form; when qi is attained, images manifest in kind. Yet few realize that through qi, kinds arise, and from kinds, images emerge. Beneath the chapters, skillful phrasing abounds, but it is better to point to the essential and clarify the images of things, observing their transformations. Yet transformation follows the Dao, and chapters preserve words. Thus, the adept never debates, while those who debate are not adept—like fish in a well, who can fathom them? To know the joy of water, one must ask the fish. This is the meaning.\n\nThe formula states:\n*First entering, the image is unclear,*\n*Only upon seeing the image is the intent known.*\n*Recognizing the image is the gateway—*\n*Why cling to words?*\n*Once clung to, the beginning is forgotten,*\n*Like poling a boat without reaching the shore.*\n*Unaware, the foolish and simple*\n*Take this as the truth of the Dao.*\n\n---\n\nTo nurture the spirit, one must first cultivate the heart; to refine qi, one should regulate the breath. The spirit arises from the heart, for the heart is the spirit’s dwelling; qi is the source of breath, and breath is governed by qi. Those who skillfully cultivate the heart must make it gleam like a clear pool reflecting the moon, still as an empty valley echoing no sound. Only then will the inner realm remain unmoved, external dust unintrusive; thoughts sink like iron in water, nature clings to nothing like the vast void. In profound tranquility, self and things both forgotten, the spirit clears itself, and qi gathers of its own accord. The spirit congeals through qi, and qi lingers for the spirit. At this moment, one is unaware of the breath’s ebb and flow.\n\nThe formula states:\n*First following the breath,*\n*Finally attaining qi.*\n*Qi and breath guard themselves—*\n*Self and things both abandoned.*\n*Movement and stillness both forgotten,*\n*The spirit’s abode is found.*\n*It rests in cultivating the heart—*\n*Not a single thread arises.*\n\n---\n\nThe spirit’s function is not contrived. It begins with the heart’s cultivation and culminates in the preservation of qi to generate life, like clear waves reflecting a shadow or a bright mirror facing a form. Seeking it with a heart intent on possession will never yield it; seeking it with a heart devoid of intent only deepens its absence. How, then, can it be attained? The spirit values non-disturbance; the heart esteems non-thought. Guard it like stone, act like the foolish. The mouth utters no words, the ears hear nothing; thoughts do not arise, and nature does not drift. Like muddy water first strained, it naturally clears at the top while sediment settles below; the wind does not stir, and leaves still themselves. Unaware of Heaven and Earth, unaware of what \"I\" is—having entered the boundless, one dwells in primordial chaos, like the undivided Taiji, the unmanifest Three Powers. Suddenly, a single spark of spirit shines forth, like a vacant room filling with light. This arises from the heart’s absence, not from the heart’s effort. Thus, its comings and goings are without direction, its transformations follow its dwelling.\n\nThe formula states:\n*The Dao is not named as Dao,*\n*The heart forgets its own heart.*\n*When all is unrecognized at once,*\n*Only then is the valley’s echo heard.*\n*Water and fire are not affairs,*\n*Yin and yang arise within me.*\n*Sitting amidst the boundless,*\n*The spirit’s transformations all unfold.*\n\n---\n\nThe Dao in relation to things, and things in relation to the Dao, begin with forgetting images. There are three thousand six hundred minor gates, giving rise to eighty-four thousand great delusions. Often, one hastens toward the strange and lingers in pursuit of the true. Among thousands or tens of thousands who advance in learning, not one or even half attain the Dao—because they cling to delusion and do not grasp the target. People all take the dragon and tiger as primary—this is wrong; they take golden elixirs and cinnabar medicines—this is wrong...",
      "overlap_context": "erns 1,600 and more—this is the number of Qian and Kun. Those skilled in the Dao, who can preserve breath and understand apertures, truly nurture without labor.\n\nThe formula states:\n*At the fourth watch, Heaven and Earth unite,*\n*Unfolding the subtle to reveal its depth.*\n*Water and fire are natural affairs,*\n*No need to labor the mind.*\n*Within the nose lie two apertures,*\n*Heaven and Earth not a hair’s breadth apart.*\n*If one can preserve this moment,*\n*The bright moon is grasped in the palm.*",
      "start_char": 4424,
      "end_char": 5464,
      "start_sentence": 211,
      "end_sentence": 246,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.529648542404175,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "以凤髓鸦神，非也； 以玉蕊金花，非也； 以朱铅黑汞，非也； 以心肾为水火，非也； 以脾土肝木，非也； 以吞津纳炁，非也； 以朝日采月，非也； 以嚅山啸林，漱泉卧石，日以咽霞，夕以瞻斗，俱非也。 每每学者不思其祖，而求其孙，不知太极未肇，人物未分之前，还有如是之类乎？ 大要之用，百千万亿之人，未尝守之，岂不惑之又惑，迷之转迷哉， 诀曰：龙虎非为道，吞津不是功，丹霞非采日，神化不归风。 祖炁谁曾识？ 真宗孰可穷，须臾端的事，三界悉皆通。 通玄三教眉山师仁寿授 元水元火章第十七 太极以炁而包万象，天地以炁而分清浊，始以黑结，终以炁化，为之散漫，各随其方。 故居西者为金类所感。 水之一字，乃天地本原之炁，火之一字，亦乾坤育化之炁，故因无形而为有形。 冬则伏，夏则舒，入之阳，出之阴，潜之阴，畅之阳，人之炁，乃炁之原。 故学道者，以炁化炁，即炁存炁，嘘呵抽加，则变化而有也。 以水为水，非道也； 以火为火，亦非道也。 如以炁存炁者，则为水火也。 水火者，乃以无化有也。 初无分别旦暮晨昏出入之意，方是也。 故善於道者，以炁守一，以炁养炁，则水自内升，火自裹降，初何示之於外也？ 不可不深省知。 诀曰：一炁阴阳会，金木自然生，本来非水火，万象各存真。 炁炁为初始，中间尽化神，岸临无用檝，只此坎离因。 通玄三教眉山师仁寿授 守一生神章第十八 天净则云炁清，地静则草木灵，人能体此行，阴会阳合并。 故一泓之波，可以瞻星斗； 一灵之魂，可以知吉凶，乃其不散而静，不妄守也。 往往后学不能扫灵台之埃，而广喉舌之辩，故因语忘炁，失炁忘精，以巧拙为纵横，以多记为大能，故纯一之炁失守，而阴阳之妙随失也。 善修者敛之以静，巧之以拙，净之於念，清之於心，存之以嘿，示之以朴，自然天宇清，地轴宁，炁抱一，神自灵。 然后不符而可符，不咒而可嘱，无神而神卫，邪之走，怪之潜，家宅宁，人事和。 以默之墨，以馘不正之祟，此真元至一之炁，为守一抱元之要也。 何假分龙虎别龟蛇哉！ 诀曰：念念念丹田，收之守在坚，五色无心着，中间自有天。 不须求水火，金鼎内烹煎，朝朝与暮暮，神炁炼丹田。 通玄三教眉山师仁寿授 神炁成胎章第十九 心中有神，炁内存炁，心若挠而神不清，炁若耗而炁必惫。 以之出於顶，不如守神於舍； 以之吐炁留真，莫若养炁存炁。 神乃炁之化，炁无神不留，故神炁如子母，如天地，不可一刻离也。 善於行者，以炁内固，固者非做造而固也，绵绵於息，其炁自凝，炁凝息平，其神自住。 始坐如小儿入寝，久之如困夫之入担，自腿至脐，自腰以上，不求也。 心则微冲，炁则如绝，当此之时，为道者何知其神焉！ 明其化，孰知有胎，胎者非产男女之胎也，乃元也，要在拼一死於洪崖，忘一身如草木，死一心如玲灰，不知我，不知身，少顷风声雨意一定之后，息已无矣！ 炁自固也，神自灵也，胎自结也。 若以夕静如是，昼杂如何，但味诀偈，咸自了之。 诀曰：我用不用我，灵台净裸裸，念念在丹田，随心也放下。 目耳绝视听，有口却如哑，一点若太虚，任你之乎者。 通玄三教眉山师仁寿授",
      "translated_text": "To take phoenix marrow and crow spirit—this is wrong; to take jade buds and golden blossoms—this is wrong; to take cinnabar lead and dark mercury—this is wrong; to take heart and kidney as water and fire—this is wrong; to take spleen-earth and liver-wood—this is wrong; to swallow saliva and absorb *qi*—this is wrong; to gather the morning sun and harvest the moon—this is wrong; to hum in the mountains, roar in the forests, rinse with springs, and sleep on stones, to daily swallow rosy clouds and nightly gaze at the Dipper—all these are wrong.\n\nScholars repeatedly fail to contemplate their origin and instead seek after its descendants. Before the Supreme Ultimate (*Taiji*) arose, before heaven and earth divided, before humans and things took form—could there have been such categories? In the essential practice, among hundreds of millions, none have truly preserved it. Is this not delusion upon delusion, confusion compounding confusion?\n\nThe formula states:\n*Dragon and tiger are not the Dao,*\n*Swallowing saliva is not merit.*\n*Rosy clouds are not the sun’s harvest,*\n*Spirit’s transformations do not return to wind.*\n*Who has ever known the primordial *qi*?*\n*Who can fathom the true source?*\n*In an instant, the target is clear—*\n*The Three Realms all are pervaded.*\n\n---\n\n**Primordial Water and Primordial Fire (Chapter Seventeen)**\nThe Supreme Ultimate enfolds the ten thousand images within *qi*; heaven and earth separate the clear and turbid through *qi*. It begins with darkness congealing and ends with *qi* transforming, scattering and drifting, each following its direction. Thus, those dwelling in the west are moved by metal’s kindred. The word *water* is the primordial *qi* of heaven and earth; the word *fire* is also the generative *qi* of *Qian* and *Kun*. Thus, from formless it becomes formed. In winter it lies hidden; in summer it unfolds. It enters into yang and emerges from yin; it conceals in yin and flourishes in yang. Human *qi* is the origin of *qi*.\n\nTherefore, those who study the Dao transform *qi* with *qi*, preserve *qi* within *qi*. Through exhalation and inhalation, drawing and adding, it changes and takes form. To take water as water is not the Dao; to take fire as fire is also not the Dao. Only by preserving *qi* within *qi* do they become water and fire. Water and fire are the transformation from nonbeing into being. Only when there is no distinction of dawn or dusk, morning or evening, emergence or withdrawal is it correct.\n\nThus, those skilled in the Dao preserve the One with *qi* and nurture *qi* with *qi*. Then water naturally ascends within, and fire naturally descends from without. How could this be shown externally? One cannot but deeply reflect and understand.\n\nThe formula states:\n*One *qi* unites yin and yang,*\n*Metal and wood arise naturally.*\n*Originally not water or fire,*\n*The ten thousand images each preserve the true.*\n*Qi* is the beginning,*\n*In the midst, all transforms into spirit.*\n*Standing at the shore, the oar is useless—*\n*Only this is the cause of *Kan* and *Li*.*\n\n---\n\n**Preserving the One to Generate Spirit (Chapter Eighteen)**\nWhen the heavens are clear, clouds and *qi* are pure; when the earth is still, grasses and trees are numinous. If one can embody and practice this, yin converges and yang unites. Thus, a single ripple can reflect the stars and constellations; a single numinous soul can know fortune and misfortune—this arises from its undispersed stillness, its unwavering preservation.\n\nYet later learners often fail to sweep the dust from the spirit-terrace and instead expand their verbal eloquence. Thus, through speech they forget *qi*, and losing *qi*, they lose essence. They take skill and clumsiness as freedom, and vast memorization as great ability. Thus, the pure and unified *qi* is lost, and the marvel of yin and yang vanishes with it.\n\nThose who cultivate well gather it through stillness, refine it through simplicity, purify it in thought, and clarify it in the heart. They preserve it in silence and manifest it in plainness. Naturally, the celestial vault is clear, the earth’s axis is tranquil, *qi* embraces the One, and spirit becomes numinous. Then, without talismans, talismans work; without incantations, incantations take effect. Without spirits, spirits guard; evil flees, monsters hide, households are peaceful, and human affairs harmonize. With the ink of silence, one severs unrighteous spirits—this is the primordial, perfectly unified *qi*, the essential method of preserving the One and embracing the origin. Why bother distinguishing dragon and tiger, separating tortoise and snake?\n\nThe formula states:\n*Thought after thought, focus on the cinnabar field,*\n*Gather and preserve it firmly.*\n*Without attachment to the five colors,*\n*Within, heaven naturally appears.*\n*No need to seek water or fire—*\n*In the golden crucible, they are refined.*\n*Morning and evening,*\n*Spirit and *qi* refine the cinnabar field.*\n\n---\n\n**Spirit and *Qi* Form the Embryo (Chapter Nineteen)**\nWithin the heart, there is spirit; within *qi*, *qi* is preserved. If the heart is disturbed, spirit is not clear; if *qi* is depleted, *qi* must weaken. To project it from the crown is not as good as guarding spirit in its abode; to exhale *qi* and retain the true is not as good as nurturing *qi* and preserving *qi*. Spirit is the transformation of *qi*; without spirit, *qi* does not remain. Thus, spirit and *qi* are like mother and child, like heaven and earth—they cannot be separated even for an instant.\n\nThose skilled in practice internally secure *qi*. This securing is not forced but arises naturally from the continuity of breath. As *qi* congeals, breath becomes even, and spirit naturally abides. At first, sitting is like a child falling asleep; over time, it is like a weary laborer shouldering a burden. From the legs to the navel, from the waist upward, one does not seek it. The heart is slightly tranquil, *qi* seems cut off. At this moment, what does the Dao-knower know of spirit? Understanding its transformation, who knows of the embryo? This embryo is not the embryo that births sons and daughters—it is the origin. The key lies in risking death at Hongya, forgetting the body like grass and trees, dying the heart like cold ashes. Unaware of self, unaware of body, after a brief moment when the wind’s sound and rain’s intent settle, breath is no more! *Qi* secures itself, spirit becomes numinous, and the embryo forms.\n\nIf this is so in the quiet of evening, what of daytime distractions? Simply savor the formula and verse—all will be understood.\n\nThe formula states:\n*I use what does not use me,*\n*The spirit-terrace is bare and pure.*\n*Thought after thought, in the cinnabar field,*\n*With the heart, let go.*\n*Eyes and ears cut off seeing and hearing,*\n*The mouth, though present, is as if mute.*\n*A single point like the great void—*\n*Let it be, whether “this” or “that.”*",
      "overlap_context": "he Dao, begin with forgetting images. There are three thousand six hundred minor gates, giving rise to eighty-four thousand great delusions. Often, one hastens toward the strange and lingers in pursuit of the true. Among thousands or tens of thousands who advance in learning, not one or even half attain the Dao—because they cling to delusion and do not grasp the target. People all take the dragon and tiger as primary—this is wrong; they take golden elixirs and cinnabar medicines—this is wrong...",
      "start_char": 5464,
      "end_char": 6707,
      "start_sentence": 247,
      "end_sentence": 302,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.59388470649719,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "修德济物章第二十 仁者德之本，德乃道之基，不仁者不足以言道，无德者不可与谈化。 往往修者，首务长生，以求不死，殊不明长生不死者，何物也？ 止以有为而先於人，以巧饰而诈於己，无山林之清而乐山林之事，无利益之念而求上天之鹤，善之未有，恶已先彰，如持念珠而兴讼，设醮事以挞人，此等之人，俱不足与言道也。 能於事者，见人之危而捄之，见人困而济之，见人之陷而提之，见人之疾如己之疾，见人之不善而化之，见人之美女不起私之，见人之奉真如己之奉之。 入道则行道，见业则去业，然后俭於己而厚於众，无内外不和之事，有尊敬父母之心，清淡於己，丰利於人，人之如此，以之求真则真感，以之修道则道成。 又且益子孙，而超九祖，岂不美哉！ 诀曰：道本德中来，有德方知道，天地大德生，圣贤亦此造。 长生一径真，不死者乃道，道德与性命，四字甚分晓。 通玄三教眉山师仁寿授 尊师谢祖章第二十一 极未判，无以见天地三才之炁； 道不立，何以明父母万类之因？ 是以有本则有末，有源必有流，太上不以化开道，老君不设教，乌能识奉仪？ 有道无缘，见道则远，有缘无师，遇道不明。 广猎丹书，不如求之於诀，多参异人，不如守之於我，故指之者迷也，化之者正也，行之者道也。 故祖不可忘，而师不可怠祖之积也，则子孙昌，师不明则本源晦。 道专之以德，尊之以祖，敬之於师，不可一日而去也。 诀曰：一炁道之祖，一言道之师，祖炁不可远，道言朝夕知。 子孙逢遇此，父母阴德为，元以自己思，当知在祖祢。 通玄三教眉山师仁寿授 已得不得章第二十二 未游沧海则不明风涛之险，已登泰岳则方敬峰巅之危，始也忽之易，终也行之难。 道包天地，人括三才，终日茫茫，不明其奥，乃其入也，皆曰云霄之上，必可居也； 渊渎之深，必可造也。 此小优之守技，坎蛙之水也。 夫道之大者莫可量，道之微者孰能探？ 区区之泄，五章尽也，不必走山林，寻奇特； 不必索经书，访异友。 天地一壶，道德庶类，悉备此经。 今既已知已得，常如不及日。 如未得，元轻后进，无忽后学，无慢诸经，无忘祖本。 道尚强名，莫言已得者，是为得道，实之无得，方日永得也。 诀曰：慕念如渴，思求朝夕，既真骨缘，遇其道德。 心常不及，斯为至得，当戒满盈，恐返折克。 通玄三教眉山师仁寿授 济生度死章第二十三",
      "translated_text": "**Chapter Twenty: Cultivating Virtue and Aiding All Beings**\n\nBenevolence is the root of virtue; virtue is the foundation of the Dao. Those without benevolence cannot speak of the Dao; those without virtue cannot discuss transformation. Many practitioners prioritize longevity, seeking immortality, yet fail to understand what true longevity and immortality are. They strive to surpass others through contrivance, deceive themselves with artifice, delight in the affairs of mountains and forests without their purity, and seek celestial cranes without thoughts of benefit. Goodness has yet to take root while evil already manifests—like clutching prayer beads while stirring litigation, or holding rituals to strike others. Such people are unworthy of discussing the Dao.\n\nThose capable in practice see another’s peril and rescue them, another’s distress and aid them, another’s fall and lift them. They feel another’s illness as their own, transform another’s wrongdoing, and upon seeing another’s beauty, do not entertain private desire. They revere another’s devotion to the truth as their own. Entering the Dao, they practice it; encountering karma, they abandon it. Then, they are frugal with themselves and generous with others, free from discord within or without, honoring parents with reverence. They cultivate simplicity for themselves and abundance for others. Such a person, in seeking truth, will be met with truth; in cultivating the Dao, will achieve the Dao. Moreover, they benefit descendants and transcend nine generations of ancestors—how sublime!\n\nThe formula states:\nThe Dao arises from virtue,\nOnly with virtue can one know the Dao.\nHeaven and earth’s great virtue is life;\nSages and worthies are likewise made.\nLongevity is the one true path,\nImmortality is the Dao itself.\nDao, virtue, nature, and life—\nThese four are perfectly clear.\n\n---\n\n**Chapter Twenty-One: Honoring the Master and Revering the Ancestors**\n\nBefore the primordial chaos divided, one could not perceive the *qi* of heaven, earth, and the three powers. Without the Dao established, how could one understand the causes of parents and the myriad beings? Thus, where there is a root, there are branches; where there is a source, there are streams. Had the Most High not opened the Dao through transformation, had Laozi not set forth teachings, how could one recognize the rites of devotion?\n\nWith the Dao but no affinity, the Dao remains distant. With affinity but no master, the Dao is not clearly encountered. Collecting vast alchemical texts is inferior to seeking the formula; consulting many extraordinary people is inferior to preserving it within oneself. Thus, those who point are deluded; those who transform are upright; those who practice attain the Dao.\n\nTherefore, ancestors must not be forgotten, and masters must not be neglected. When ancestors’ merits accumulate, descendants flourish; when masters are unclear, the root source is obscured. The Dao is specialized through virtue, revered through ancestors, and respected through masters—it must not be abandoned for even a day.\n\nThe formula states:\nThe *qi* of the One is the Dao’s ancestor,\nA single word is the Dao’s master.\nThe ancestral *qi* must not be distanced,\nThe Dao’s words must be known day and night.\nWhen descendants encounter this,\nIt is due to their parents’ hidden virtue.\nDo not rely solely on oneself—\nKnow that it lies in the ancestors’ legacy.\n\n---\n\n**Chapter Twenty-Two: On Attainment and Non-Attainment**\n\nOne who has not traversed the vast sea does not know the peril of wind and waves; one who has ascended Mount Tai only then respects the danger of its peaks. At first, it seems easy to neglect; in the end, it is difficult to practice.\n\nThe Dao encompasses heaven and earth; humans embrace the three powers. Yet all day, they wander in confusion, unaware of its mysteries. Upon entering, they say: the heights of the clouds must be habitable, the depths of the abyss must be reachable. This is the limited skill of a performer, the water of a well-frog.\n\nThe greatness of the Dao cannot be measured; its subtlety, who can fathom? The trivial leaks of the five chapters are exhausted—there is no need to roam mountains and forests in search of wonders, nor to seek scriptures or visit extraordinary friends. Heaven and earth are a single vessel; the myriad beings of the Dao and virtue are all contained within this text.\n\nNow that you have attained knowledge, act as if you have not, striving daily. If you have not yet attained, do not belittle later learners, do not disdain the scriptures, do not forget the ancestral root. The Dao transcends forced names—do not say that those who claim attainment have attained. Only when there is truly no attainment is there eternal attainment.\n\nThe formula states:\nYearn as if parched, seek day and night.\nWith true karmic affinity, encounter the Dao and virtue.\nThe heart ever feels inadequate—\nThis is the highest attainment.\nBeware of fullness, lest it bring reversal and loss.\n\n---\n\n**Chapter Twenty-Three: Saving the Living and Delivering the Dead**",
      "overlap_context": "it becomes numinous, and the embryo forms.\n\nIf this is so in the quiet of evening, what of daytime distractions? Simply savor the formula and verse—all will be understood.\n\nThe formula states:\n*I use what does not use me,*\n*The spirit-terrace is bare and pure.*\n*Thought after thought, in the cinnabar field,*\n*With the heart, let go.*\n*Eyes and ears cut off seeing and hearing,*\n*The mouth, though present, is as if mute.*\n*A single point like the great void—*\n*Let it be, whether “this” or “that.”*",
      "start_char": 6707,
      "end_char": 7645,
      "start_sentence": 303,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.048076629638672,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "道之化化以德，德生诚，诚化敬，敬之一出，百神卫之。 故存之有神，是日卫也，养之有炁，故曰真也。 一嘘之可以为庆云，一呵之可以为雨露，运之可以为南昌，炼度化之，可以拔久潜幽凝。 非符非咒，非神非将，非去非来也。 乃一炁一心，一嘿一守，一道一德，一我也。 以之济生则疾愈，以之度死则死化，如此之大，非道何也？ 如此之尊，当切守之！ 当切行之！ 诀曰：念即是道，道即为符，鬼邪港走，幽壤咸苏。 嘿醮在我，上苍自孚，济度二事，如拳展舒。 通玄三教眉山师仁寿授 大经圆满章第二十四 功之行，德之修，道之用，经之旨，可以明三界，可以通五行，可以超九祖，可以化万类者，此经也。 此经之下者，凡今三也，一经甲申而归於大波，以溺而不出； 二自丁酉化於烈焰，而煨之也； 以后复降，其辞别，其理泯，若一土之比玉也。 虽云复降，亦为漂焚者久，今日复下者，以奉敬之情，尊乐之大，故以批于子之家庭。 宜当遵之守之，宝之．敬之，功行道德，若之圆备，可以升之。 无对非人而慢示之，愆报非常，戒律不浅矣！ 诀曰：祖先素有德，故得奉真道，真下道已敷，始终归子造。 功在於勤修，德在於慈孝，道德圆满时，一门吉之妙。 此经乃 北极雷岳教主、金阙化身元素真君，悯念群生之多迷真性，未悟灵门，降笔于奉道刘元瑞家，欲广其传，流行教法。 元瑞不明圣意，乃以降灵真本，默奇於文魁达贵，秘藏于报匮之中，未得阐教玄奥。 今刘元瑞既役之后，其家所藏誊本，正观得而宝之，锓诸梓木，印行于世。 庶使学道修真之士，开明妙理，了悟此因。 正观尚虑当来誊真之时，天书草圣，俗意难明，其中若有字样差讹，或误加增损，惟待通明之士改而证诸，不亦宜乎？ 告景定岁次辛酉季夏月吉长奉道弟子董正观馑识。 太上修真体元妙道经竟",
      "translated_text": "The Dao transforms through virtue; virtue gives rise to sincerity, and sincerity transforms into reverence. When reverence issues forth as one, the hundred spirits guard it. Thus, to preserve it is to have spirits—this is called \"guard\"; to nurture it is to have qi—this is called \"true.\" A single exhalation can become auspicious clouds; a single breath can become rain and dew. Circulating it can make one a Lord of Southern Florescence; refining and transmuting it can deliver those long submerged in dark obscurity. It is neither talisman nor incantation, neither spirit nor general, neither departure nor arrival. It is but one qi, one heart, one silence, one vigilance, one Dao, one virtue—one self. Applied to saving the living, illnesses are cured; applied to delivering the dead, the dead are transformed. So vast is this—what but the Dao could achieve it? So exalted is this—one must guard it earnestly! One must practice it earnestly!\n\nThe formula states:\nThought is the Dao; the Dao is the talisman.\nGhosts and demons flee in haste; the dark netherworld revives.\nSilent offering lies within me; Heaven above naturally responds.\nSaving the living and delivering the dead—\nLike a fist unclenched, all unfolds with ease.\n\n**Chapter Twenty-Four: The Scripture’s Perfect Completion**\n\nThe practice of merit, the cultivation of virtue, the application of the Dao, the essence of the scriptures—these can illuminate the Three Realms, penetrate the Five Phases, transcend the nine generations of ancestors, and transform the myriad beings. This is the scripture.\n\nAmong the lesser versions of this scripture in the world today, there are three:\nThe first, in the *jiashen* year, returned to the great waves, drowned and never recovered.\nThe second, from the *dingyou* year, was consumed by raging flames, reduced to ashes.\nLater revelations, though descended again, diverged in wording and obscured in principle, like earth compared to jade.\n\nThough it has descended once more, the long loss to flood and fire nearly erased it. Its return today is due to the profound reverence and great joy of devotion, and so it has been bestowed upon your household. You should uphold it, guard it, treasure it, and revere it. When merit, practice, virtue, and the Dao are perfectly complete, you may ascend.\n\nDo not show it to those unworthy, lest they treat it with disdain. The retribution for transgression is severe, and the precepts are not trivial!\n\nThe formula states:\nAncestors possessed inherent virtue,\nThus the true Dao was received.\nThe true Dao, once spread,\nFrom beginning to end, is your creation.\nMerit lies in diligent cultivation;\nVirtue lies in compassion and filial piety.\nWhen virtue and the Dao are complete,\nThe entire household enjoys sublime fortune.\n\nThis scripture was bestowed by the Northern Pole Lord of Thunder Peak, the Golden Watchtower Incarnation of Primordial Essence, who pitied the multitude of beings lost in delusion, their true nature unawakened, their spiritual gate unopened. It descended through brush to the Daoist devotee Liu Yuanrui’s home, intending to spread its transmission and propagate its teachings. Yet Yuanrui failed to grasp the sagely intent, hiding the divine original among literary treasures, concealing it in a repository of offerings, and thus the profound mysteries of the teaching remained unilluminated.\n\nAfter Liu Yuanrui’s passing, the copy preserved in his household was obtained and treasured by Zheng Guan, who had it carved onto blocks and printed for circulation. May those who study the Dao and cultivate truth thereby awaken to its wondrous principles and comprehend this cause.\n\nZheng Guan, however, fears that in future transcriptions, the celestial script’s calligraphy may be misconstrued by vulgar minds, with errors in characters, omissions, or unwarranted additions. It is fitting that those of penetrating insight correct and verify them.\n\nRecorded by the long-devoted Daoist disciple Dong Zhengguan in the auspicious summer month of the *xinyou* year of the Jingding era.\n\n*Here ends the* Supreme Scripture of Cultivating Truth and Embracing the Primordial Wondrous Dao.",
      "overlap_context": " not forget the ancestral root. The Dao transcends forced names—do not say that those who claim attainment have attained. Only when there is truly no attainment is there eternal attainment.\n\nThe formula states:\nYearn as if parched, seek day and night.\nWith true karmic affinity, encounter the Dao and virtue.\nThe heart ever feels inadequate—\nThis is the highest attainment.\nBeware of fullness, lest it bring reversal and loss.\n\n---\n\n**Chapter Twenty-Three: Saving the Living and Delivering the Dead**",
      "start_char": 7645,
      "end_char": 8367,
      "start_sentence": 340,
      "end_sentence": 368,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.35033917427063,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上修真体元妙道经.txt",
        "category": "本文类"
      }
    }
  ]
}