{
  "source_id": "太上正一阅箓仪",
  "source_file": "chunked_daozang\\太上正一阅箓仪.json",
  "total_chunks": 5,
  "total_original_chars": 5364,
  "total_translated_chars": 36847,
  "total_translation_time": 165.03503561019897,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\太上正一阅箓仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Dongshen Department, Ritual Propriety Section: The Supreme Orthodox Unity Register-Inspection Rite**\n\n**Text Title:** *The Supreme Orthodox Unity Register-Inspection Rite*\nCompiled by Du Guangting, the Master of Broad Accomplishment, in the late Tang dynasty—a revised version of an early Celestial Master register-inspection rite. One fascicle.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Dongshen Department, Ritual Propriety Section.\n\n---\n\n### **The Supreme Orthodox Unity Register-Inspection Rite**\nCompiled by Du Guangting, the Master of Broad Accomplishment\n\nFor all who receive the Orthodox Unity registers, the rites shall be performed on days of *jiazi*, *gengshen*, one’s life-destiny day, the Three Origins, the Three Assemblies, the Five La Festivals, the Eight Nodal Days, and the last and first days of the lunar month. On these days, the celestial *qi* announces renewal, the radiance of Yang dispels darkness, all virtues are made new, the heavenly spirits descend in full, the earthly spirits emerge in full, the water spirits arrive in full, the Great Unity takes its seat, and the seed-people are selected. Their merits and transgressions are examined, life and death are determined, and names are inscribed in the Golden Towers.\n\nOn such days, Daoists and seed-people must purify themselves, enter the oratory in fasting, and at the hours of *mao* and *you*, burn incense and prepare twenty-four portions of wine and fruit—or sixteen, twelve, or eight portions—ensuring all is solemn and immaculate. First, the register is unfurled upon the table. Donning fresh, cool garments and having bathed and rinsed, they then enter the chamber to offer incense and focus their intent, following each step precisely without omission.\n\nThe order of rites is as follows:\nFirst, recite the **Entrance Incantation**;\nNext, offer incense at the **Cave Table**;\nThen, offer incense at the **Primary Table**;\nNext, recite the **Incense Incantation**;\nThen, bow to the master and meditate as prescribed;\nNext, strike the **Ritual Drum** twenty-four times;\nThen, recite the **Furnace-Opening Incantation**:\n\n*\"Supreme Mystery-Origin, Five Numinous Venerable Lord, summon now the Merit-Officials and Messengers, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Messengers of the Three Qi Orthodox Spirits—hasten to report and transmit! To the Three Heavens’ Supreme Mystery-Origin Dao Lord, your servant now enters the oratory to burn incense. On this assembly day—the Upper Assembly on the seventh day of the first month, the Middle Assembly on the seventh day of the seventh month, the Lower Assembly on the fifth day of the tenth month—faithfully following the Celestial Master’s canonical rites, I inspect the Orthodox Unity Alliance-Awe Precious Register bestowed upon my person. May the life-*qi* of the Eight Directions’ Orthodox Perfected descend and flow into my body. May this petition swiftly ascend before the Supreme Perfected, Boundless Great Dao, the Jade Emperor, and the August Emperor of the Most High.\"*\n\nBow thrice after each recitation.\n\nNext, declare the ritual rank:\n*\"From the Great Mystery Capital, Orthodox Unity, Level-*Qi* System, Celestial Master of [X] Treatment, [X]-Qi Red Heaven’s Three-Five Step-Net Destiny Perfected, your servant [Name], humbly petitions the Most High Pure Mystery-Origin, Boundless Three Heavens’ Supreme Great Dao: the Supreme Dao Lord, the Supreme Venerable Lord, the Supreme Elder, the Heavenly Emperor Lord, the Heavenly Emperor Elder, the Nine Elders of the Immortal Capital, the Nine-*Qi* Elder, the myriad layers of Dao-*qi*, the Twelve Hundred Official Lords, and the August Presence beneath the Jade Terrace of the Great Clarity.*\n\n*Though unworthy and foolish, I have received the profound transformation of the Great Dao. As the Dao bestowed its methods and the Orthodox Unity flourished, I was graced by my revered master with the transmission of the secret registers—*Extending Life, Transcendent Flight, Three-Five Grade Scriptures*—to inwardly rectify body and mind, harmonize and pacify spirit and *qi*, and outwardly ward off calamities, suppress misfortunes, and repel pernicious influences. May the superior immortals and numinous marshals, the generals, officials, and merit-officers within the precious registers, each according to their office, protect my body and life, regulate the Six Palaces, calm the Hundred Passes, ensuring that malevolence and misfortune do not intrude, the Three Corpses fall away, the Nine Worms perish, the Nine Ancestors and Seven Generations ascend to heaven and attain the Dao, deliver all beings, broadly aid heaven and humanity, assist the state in its time, establish merit for all things. On each assembly day, may my merits be reported and my rank advanced. I vow to uphold these practices eternally, never betraying my oath of devotion. Humbly beseeching the Great Saints of the Three Heavens and the Venerable Hosts to regard my sincerity and ever grant me grace and forgiveness.\"*\n\nBow repeatedly in reverence.\n\nNext, summon the officials:\n*\"Humbly summon from within your servant’s body:\nThe **Superior Immortals and Numinous Lords**, the **Northern First Supreme Unity General**, the **Ten Generals of the Supreme Unity**, the **One Hundred Fifty Generals of the Superior Immortals**, the **Direct Merit-Officials**, the **Orthodox Unity Merit-Officials**, and the **Healing Merit-Officials**, fifteen each, to emerge and serve as your servant’s executive marshals, overseeing the regulation of *qi* in the east, west, south, and north, dispelling the Hundred Diseases;\nThe **Superior Immortals and Numinous Left and Right Official Messengers**, the **Marshals of the Four Directions**, to repel the Three Calamities, Nine Perils, Five Punishments, and Six Harms;\nThe **Chief Scribes and Soldiers**, leading the left and right, ensuring no errors in sequence;\nThe **Superior Immortal Numinous Yin-Yang Divine Judgment Officials**, fifteen each, to emerge and harmonize your servant’s yin and yang, determine the register of life, pacify spirit and nurture nature, aligning with the Perfected Immortals;\nThe **Superior Immortal Numinous Yin-Yang Healing Merit-Officials**, the **Yin-Yang Healing Heavenly Physician Scribes**, fifteen each, to emerge and regulate your servant’s yin and yang, examine the Five Viscera’s spirits, and administer the immortals’ wondrous medicines to dispel illness and misfortune;\nThe **One Hundred Fifty Generals of the Two Offices of the Superior Immortals and Numinous Lords**, to lead the marshals, officials, scribes, and soldiers in encircling your servant’s body thrice, leaving no gaps;\nThe **Superior Immortal Numinous Gentleman Scribes**, the **Tiger-Rushing Detectives**, the **Hook-Riding Cavalry**, the **Three Officials’ Archery Scribes**, one thousand two hundred each, to emerge and garrison your servant’s dwelling, guarding left and right, following east, west, south, and north within a hundred paces, their weapons outward to hunt and capture rebels and malefactors, executing them utterly without escape, ever protecting your servant’s body;\nThe **Superior Immortal Numinous Heavenly Couriers**, the **Armored Soldiers**, one thousand two hundred each, and the **Heavenly Might Warriors**, one hundred twenty each, to emerge and follow your servant in all directions, responding to every summons with haste;\nThe **Superior Immortal Numinous *Qi*-Gathering, *Qi*-Consuming Scribes**, the **Spirit-Gathering, Spirit-Consuming Scribes**, the **Ghost-Gathering, Ghost-Consuming Scribes**, the **Malevolence-Gathering, Malevolence-Consuming Scribes**, the **Toxin-Gathering, Toxin-Consuming Scribes**, sixty each, to emerge and gather and consume the world’s toxic epidemics, demonic *qi*, malevolent spirits, and pernicious gods, as well as *shanghan* fevers, malarial miasmas, venomous infestations, pestilential evils, and vicious beasts—all to be gathered, consumed, and utterly dispersed.\"*\n\nThe **Superior Immortal Numinous Vermilion Talisman Scribes of the Chariot Division**, the **Stalwart Wind Couriers**, and the **Swift Steeds for Memorials to the Throne**, ten each, to emerge and serve your servant in capturing and seizing treacherous and malevolent spirits, thieving demons, and unrighteous *qi*, presenting memorials and petitions to swiftly transmit them upward.\n\nNext, in accordance with their ranks, emerge the **Officers and Soldiers from the Registers**:\nReverently emerge the **Register of the Supreme Orthodox Unity First General**, with its **Attendant Generals, Envoys, Officers, Soldiers, and Jade Maidens**, to assist your servant in aiding the state and propagating transformation, exterminating the fierce and wicked, that the Supreme Dao may flourish and expand.\nReverently emerge the **Register of the Supreme Orthodox Unity Ten Generals**, with its **Generals, Talisman Scribes, Attendant Officers, and Commanding Generals**, to serve your servant in beheading the evil and rewarding the good, fulfilling ten thousand wishes as the heart desires.\nReverently emerge the **Register of the Supreme Orthodox Unity One Hundred Fifty Generals**, with its **Left Superior Immortals, Right Superior Numinous Attendant Generals, Couriers, Officers, Envoys, and Armored Soldiers**, to serve your servant in repelling and expelling unrighteous humans and ghosts from the four directions, that calamities and harms may forever cease.\nReverently emerge the **Register of the Supreme Orthodox Unity Three Generals**, with its **Generals, Attendant Officers, Divine Lads, and Jade Maidens**, to serve your servant in cultivating life and nurturing *qi*, augmenting and prolonging lifespan and fortune, ensuring peace and tranquility wherever directed.\nReverently emerge the **Register of the Supreme Orthodox Unity Right Superior Numinous Summons of the Hundred Ghosts**, with its **Attendant Generals for Body Protection, Jade Lads, and Jade Maidens**, to serve your servant in capturing and beheading the *chimei* and *wangliang* within the body and throughout the world, that they may cause no harm to people.\nReverently emerge the **Supreme Orthodox Unity Primordial Chaos Original Destiny Vermilion Register**, with its **Jade Lads and Jade Maidens of the Three Heavens for Dispelling Filth, Officers and Soldiers of the Five Directions’ Dragon Kings**, to serve your servant in annihilating the ghosts of blood sacrifices and wandering specters that assail people, utterly sweeping all away.\nReverently emerge the **Supreme Orthodox Unity Superior Immortal Summons of the Hundred Ghosts Register**, with its **Perfected Ones of All Divisions, Direct Spirits, Attendant Officers, and Generals of the Six Jia**, to serve your servant in slaying and extinguishing the three disasters and nine calamities upon the body, that all may be free from harm.\nReverently emerge the **Supreme Orthodox Unity Register of the Nine Provinces’ Community Deities**, with its **Great Generals of All Divisions, Attendant Officers, Jade Lads, Jade Maidens, and Direct Talisman Envoys**, to serve your servant within the twelve states’ territories of the nine provinces, subduing malevolent spirits, deploying divine forces and spreading *qi*, that wherever directed, they may follow and attend, escorting and protecting your servant’s person, ensuring ascension to the ranks of immortality.\nReverently emerge the **Supreme Orthodox Unity Register of the Star Net and Five Dipper**, with its **Generals, Officers, and Soldiers of the Three Masters of the Great Mystery, Western Mystery, and Pot Mystery Prohibitions**, to serve your servant in deploying the net and spreading prohibitions, intercepting and blocking fierce and malevolent spirits, and all demonic afflictions.\nReverently emerge the **Supreme Orthodox Unity *He Tu* Register for Preserving Life**, with its **Perfected Ones, Attendant Officers, Generals, Envoys, Jade Lads, and Jade Maidens**, to serve your servant in protecting the body and safeguarding life, responding to all summons and petitions, ensuring efficacy in every instance.\nReverently emerge the **Supreme Orthodox Unity Register of the Divine Talismans for Dispelling the Six Harms**, with its **Lord of the Great One, Lord Sovereign of August Heaven, Supreme Primordial Lord, Spirits for Dispelling the Six Harms, Generals for Eliminating Punishments and Annihilating Harms, and Attendant Officers**, to serve your servant in driving away portents and omens, dissolving and removing disasters and harms, that the thousand spirits and ten thousand ghosts may all be subdued and vanquished.\nReverently emerge the **Supreme Orthodox Unity Register of the Nine Phoenixes for Breaking Filth**, with its **Heavenly Numinous Vermilion Officials, Generals for Beheading Malevolence, Seizing Malevolence, Breaking Malevolence, Attacking Malevolence, Striking Malevolence, Intercepting Malevolence, Advancing against Malevolence, and Annihilating Malevolence, the *Qinqi* General, Envoys, Jade Lads, and Jade Maidens**, to serve your servant in cleansing and sweeping away the gods not listed in the registers, ensuring their complete eradication.\nReverently emerge the **Supreme Orthodox Unity Register of the Capital Memorials and Completed Seals**, with its **Heavenly Numinous Officials, Attendant Officers, Generals, Immortals, Daoists, Jade Maidens, and Envoys**, to serve your servant in beheading and extinguishing the ten thousand malevolent disasters and calamities, that they may not assail people.\nReverently emerge the **Supreme Orthodox Unity Register of the Great Canopy**, with its **Attendant Officers of All Divisions, Generals, Officers, Soldiers, Jade Lads, Jade Maidens, and Five Cloud Soldiers**, to serve your servant in executing and beheading the rebellious and wicked, annihilating the treacherous and deceitful.\nReverently emerge the **Supreme Orthodox Unity Register of the Nine Heavens’ Military Talismans**, with its **Attendant Officers, Generals, Officers, Soldiers, Envoys, and Armored Troops**, to serve your servant in guarding and fortifying the dwelling, responding to summons with immediate arrival.\nReverently emerge the **Supreme Orthodox Unity Register of the Nine Palaces for Warding Off Calamities**, with its **Attendant Officers, Superior Immortals, Superior Numinous Generals, Envoys, Heavenly Couriers, and Armored Soldiers**, to serve your servant in aiding the state and rescuing people, responding to all summons.\nReverently emerge the **Supreme Orthodox Unity Register of the Eight Trigrams for Body Protection**, with its **Generals of the Five Directions for Summoning Ghosts, Left and Right Commanders, Officers, and Soldiers**, to serve your servant by stationing one soldier every *chi* and one encampment every *li*, wielding swords and halberds, beheading and severing malevolent spirits.\nReverently emerge the **Supreme Orthodox Unity Register of the Three and Five Examinations and Summons**, with its **Generals of the Three Origins, Attendant Officers of the Five Dippers, Attendant Officers of the Five Stars, Divine Lads, and Envoys**, to serve your servant in summoning stars and causing dipper spirits to descend, binding and restraining the forms of fierce gods and evil people, ensuring all are subdued and vanquished.\nReverently emerge the **Supreme Orthodox Unity Register of the Dragon and Tiger for Beheading Malevolence**, with its **Attendant Officers, Generals, Envoys, Jade Lads, and Jade Maidens**, to serve your servant in resisting and expelling demonic and malevolent spirits, responding instantly to focused invocation.\nReverently emerge the **Supreme Orthodox Unity Register of the Wondrous Talismans for Repelling Malevolence**, with its **Mysterious Elder General, Five Canopy Generals, Supreme General, Attendant Officers, and Envoys**, to serve your servant in suppressing the gods of heaven and earth that harm living beings, that the *wangliang* and demonic spirits may never harm people.\nReverently emerge the **Supreme Orthodox Unity Register of the Four Divisions’ Prohibitive *Qi***, with its **Vermilion Officials, Attendant Officers, Generals, Officers, Soldiers, Jade Lads, and Jade Maidens of All Divisions**, to serve your servant in leaping through stars and treading upon dipper spirits, pacing the chronograms and invoking the gods, responding to the heart’s intent without generating illness or affliction.\nReverently emerge the **Supreme Orthodox Unity Register of the Great Beheading of River Malevolence**, with its **Fifty Commanding Generals, Hu, Yue, Di, Qiang, and Cang Generals of the Elder Lord’s Tiger Warriors, Generals for Launching Heaven and Shaking Earth, Generals for Shaking Heaven and Moving Earth, Five-Colored Five-Canopy Soldiers and Horses, the Supreme Mysterious Elder General, Officers, Soldiers, Envoys, Jade Lads, and Jade Maidens**, to serve your servant in brandishing flying daggers and wheeling blades, searching out and scouring demonic spirits, that the encampments and dwellings may all be secure and stable.\nReverently emerge the **Supreme Orthodox Unity Register of the Three and Five Attendant Officers**, with its **Soldiers and Horses for Concealing the Body, Hiding the Form, and Concealing the Self**, to serve your servant in internally guarding the Three Palaces and externally governing the Three Realms, that all celestial gods, earthly deities, and Dao-corrupting demonic forces may be utterly swept away, responding instantly to focused thought.\n\nReverently emerge the **Supreme Orthodox Unity Register for Preserving Life and Prolonging Existence**, with its **Left and Right Marshals of the Principal Network and all Departments’ Attendant Officers, Generals, Officers, Soldiers, and Envoys**, to serve your servant in internally governing the Five Viscera and externally repelling all demonic forces, that the Three Corpses may be annihilated, the Hundred Passes harmonized and unobstructed, merits perfected and deeds fulfilled, and ascension to Heaven in broad daylight achieved, humbly bearing the mysterious grace.\n\nNext emerge the **Generals and Soldiers of the Various Departments**:\nReverently emerge the **Supreme Orthodox Unity Register of the Various Departments’ Mysterious Elders and Five Marquises, Great Generals of Five Hundred Thousand**.\nEmerge the **Supreme Mysterious Elder General**, the **Circumpolar Great General**, the **Canopy Heaven Great General**, the **Establishing Heaven Great General**, the **Central Yue Great General**, the **Central Martial Great General**, the **Central Charioteer Great General**, and the **Central Pavilion Great General**, each with one hundred thousand soldiers.\nEmerge the **Five Canopies Great General of the Supreme**, the **Heavenly Encampment Great General**, the **Nine Kinds Great General**, the **Soaring Heaven Great General**, the **Nine Passes Great General**, the **Northern Watchtower Great General**, the **Nine Pearls Great General**, the **Nine Ways Great General**, the **Orthodox Heaven Great General**, the **Pacifying Heaven Great General**, the **Yue Gate Great General**, the **Central High August Deity Leading the Spirits Great General**, the **Azure-Leading Great General**, the **Vermilion-Leading Great General**, the **Yellow-Leading Great General**, the **White-Leading Great General**, and the **Black-Leading Great General**, each with one hundred thousand soldiers.\nEmerge each to lead their respective divisions, encamping and guarding before, behind, left, and right of your servant, eliminating misfortune and annihilating evil.\n\nThe **Five Kinds of Supreme Soldiers of Five Hundred Fifty Thousand**:\nEmerge the **Central Palace Five Encampments’ Commandant Soldiers of One Hundred Thousand**.\nEmerge the **City Gate Commandant Soldiers of Four Hundred Thousand**.\nEmerge the **Central Great Soldiers of Four Million**.\nEmerge the **Nine Orthodox Elders’ Central Wild Great Soldiers of One Million**.\nEmerge the **Supreme City Gate Great Soldiers of Four Hundred Thousand**.\nEmerge the **Heavenly Ding Soldiers of Four Hundred Thousand**.\nEmerge the **Former Emperor’s Eastern Encampment Great Soldiers of Four Hundred Thousand**, the **Supervising Heaven Great Soldiers of Four Hundred Thousand**, the **Issuing Heaven Great Soldiers of Four Hundred Thousand**, the **Northern Five Qin Soldiers of Four Hundred Thousand**, and the **Five Canopies Great Soldiers of Four Hundred Thousand each**.\nEmerge the **Left and Right Generals’ Annihilation Soldiers of Twenty Each**, the **Left and Right Generals’ Rampant Soldiers of Sixty Each**.\nEmerge the **Eastern Hu Elder Lord’s Reverse-Armor Reverse-Scale Soldiers of Nine Hundred Thousand**, the **Southern Yue Elder Lord’s Fire Encampment Cavalry Officers and Fire-Torch Soldiers of One Hundred Thousand**, the **Western Di Elder Lord’s Smelting-Staff Metal Essence Soldiers of Six Hundred Thousand**, the **Northern Qiang Elder Lord’s Bian Que Wuyuan Soldiers of Five Hundred Thousand**, and the **Central Three Qin Cang Elder Lord’s Twenty-Five Myriad Official Lords and Soldiers of One Million Two Hundred Thousand**.\nEmerge the **Eastern Azure Origin Jia-Yi Lords**, the **Southern Vermilion Origin Bing-Ding Lords**, the **Western White Origin Geng-Xin Lords**, the **Northern Black Origin Ren-Gui Lords**, and the **Central Yellow Origin Wu-Ji Heavenly Pillar Controller of Destiny Lords**, each with one thousand two hundred chariots and cavalry.\nEmerge the **High Heaven Ten-Thousand-Yard Hundred Ghosts’ Central Kings of Twelve Thousand Each**, with soldiers of six hundred thousand.\nEmerge the **High Merit Controller of Horses, Central Cavalry Great General**, the **Officers and Tiger Warriors Inspecting Treachery and Hook Cavalry**, and the **Three Officials’ Archers**, each of one thousand two hundred.\nEmerge the **Heavenly Couriers and Armored Soldiers**, the **Heavenly Ding Valiant Warriors**, the **Qi-Absorbing Qi-Consuming Officers**, the **Spirit-Absorbing Spirit-Consuming Officers**, the **Demon-Absorbing Demon-Consuming Officers**, the **Ghost-Absorbing Ghost-Consuming Officers**, the **Essence-Absorbing Essence-Consuming Officers**, the **Poison-Absorbing Poison-Consuming Officers**, and the **Talisman-Destroying Temple-Demolishing Officers**, each of twelve thousand.\nEmerge the **Soldiers of the Divisions Commanded to Serve and Guard Before and Behind Your Servant**, wielding the instruments of Heavenly Might, to punish and suppress rebellious forces, exterminate demonic essences, and protect your servant’s person, responding instantly to summoning.\n\nReverently emerge the **Upper Three Heavens’ Three and Five Front, Rear, and Central Departments’ Primordial Destiny Chaos Perfected Persons’ Red Register Direct Envoys and Attendant Officers of Fifteen Each**, to serve your servant in wielding and dispatching the Orthodox Qi to the East, West, South, and North, establishing and rectifying it to heal all illnesses, augment longevity, and extend the years, with Official Envoys of fifteen each.\nEmerge to serve your servant in communicating with and ordering the Netherworld, ensuring no advance or retreat in the divine decrees of Yin and Yang, with Officers of fifteen each.\nEmerge to serve your servant in harmonizing Yin and Yang, determining the Register of Life, and circulating the Qi of Life, with the **Yin and Yang Two Officials** and the **Heavenly Physicians Treating Illness**, each of fifteen.\nEmerge to serve your servant in compounding needles and medicines to heal all illnesses.\nReverently emerge the **Attendant Officers and Envoys for Absorbing Demons and Repelling Falsehood of Fifteen Each**, to serve your servant in absorbing demons and repelling falsehood, annihilating evil and punishing rebellion, with the **Controller of Destiny Officers of Fifteen**.\nEmerge to serve your servant in augmenting longevity and increasing lifespan, with the **Controller of Records Officers of Fifteen**.\nEmerge to serve your servant in advancing rank and increasing emolument, with the **Controller of Perils Officers of Fifteen**.\nEmerge to serve your servant in governing and transforming without disorder, with the **Controller of Punishments Officers of Fifteen**.\nEmerge to serve your servant in beheading demons and annihilating malevolent spirits, with the **Controller of Rectitude of Fifteen**.\nEmerge to serve your servant in repelling injustice and eliminating excess, with the **Controller of Treachery Officers of Fifteen**.\nEmerge to serve your servant in restraining and controlling demonic infestations, with the **Controller of Investigation Officers of Fifteen**.\nEmerge to serve your servant in petitioning for right and protecting against wrong, with the **Capital Controller Officers of Fifteen**.\nEmerge to serve your servant in subduing rebellion and governing compliance, with the **Upper Three Heavens’ Literary Prosperity Central Palace Central Yellow Nine Ways Controller of Destiny Lords of Fifteen**.\nEmerge to serve your servant in erasing the Register of Death and rectifying the Name of Life, firmly guarding the Cinnabar Field, and dispelling calamities and averting illnesses.\n\nReverently emerge the **Red Heaven Three and Five Chaos Birth-Body Concealing-Spirit Dipper-Network Great General, Left General, and Right General of Nine Each**, the **Dipper Handle Great General, Left General, and Right General of Nine Each**, the **Dipper [ ] Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s left kidney, the Dipper-Network determining life, the Dipper Handle generating the liver, and the Dipper [ ] generating the hun-soul, with no disobedience permitted.\nReverently emerge the **Red Heaven Three and Five Chaos Birth-Form Concealing-Shadow Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper Seventh Star Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s right kidney, the Dipper [ ] generating form, the Dipper [ ] generating the lungs, and the Dipper Seventh Star generating the po-soul, with no disobedience permitted.\n\nReverently emerge the **Red Heaven Three and Five Chaos Birth-Body Concealing-Self Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper Striking Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s heart, the Dipper [ ] generating humanity, the Dipper [ ] generating sinews, and the Dipper Striking generating the spirit, with no disobedience permitted.\n\nReverently emerge the **Red Heaven Three and Five Assisting-Body Dipper Striking Great General, Left General, and Right General of Nine Each**, the **Dipper Subduing Great General, Left General, and Right General of Nine Each**, the **Dipper Slaying Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s liver, the Dipper Striking pacifying the hun-soul, the Dipper Subduing calming the po-soul, and the Dipper Slaying immortalizing the hun-soul, with no error or conflict allowed.\n\nReverently emerge the **Red Heaven Three and Five Jade-Mechanism Repelling-Enemies Great General, Left General, and Right General of Nine Each**, the **Dipper Balance Breaking-Enemies Great General, Left General, and Right General of Nine Each**, the **Seizing-Strike Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, each to govern your servant’s lungs, repelling enemies to pacify the hun-soul, breaking enemies to calm the hun-soul, and seizing-strike to immortalize the po-soul, with no substitution permitted.\n\nReverently emerge the **Red Heaven Three and Five Central Yellow Controller-of-Life Great General, Left General, and Right General of Nine Each**, the **Life-Determining Great General, Left General, and Right General of Nine Each**, the **Immortal-Determining Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s spleen, the Controller-of-Life pacifying the spirit, the Life-Determining calming the spirit, and the Immortal-Determining stabilizing the hundred spirits, with no violation permitted.\n\nReverently emerge the **Upper Immortal Capital’s Supreme Divine Illustrious Officials, Central Palace Executing-Malevolence Clerks**, the **Tiger-Rushing Warriors**, the **Breaking-Enemies Inspecting-Treachery Hook-Riding Archers**, the **Slaying-Evil Three Offices’ Capital Archers**, each numbering two hundred forty, to serve as guardians of your servant’s dwelling, seizing malevolent rebels, pursuing and capturing treacherous evils, all to be eradicated without omission.\n\nReverently emerge the **Upper Immortal Capital’s Supreme Divine Illustrious Officials, Central Palace Severing-Intercepting Capital Archers**, numbering two hundred forty each, to serve your servant in the four directions, attending and obeying commands, summoned to arrive instantly.\n\nReverently emerge the **Upper Immortal Capital’s Supreme Divine Illustrious Officials, Central Palace Riding-North-Dipper Absorbing-qi Feeding-qi Clerks**, the **Riding-Dipper Absorbing-Spirit Feeding-Spirit Clerks**, the **Riding-Stars Absorbing-Ghosts Feeding-Ghosts Clerks**, the **Riding-Jade-Mechanism Absorbing-Essence Feeding-Essence Clerks**, and the **Riding-Jade-Balance Absorbing-Evil Feeding-Evil Clerks**, each numbering one hundred twenty, to absorb and consume the world’s malevolent destinies, ghostly qi, essences, evils, and demonic afflictions for your servant.\n\nReverently emerge the **Supreme Divine Illustrious Officials, Central Palace Riding-Sun Three and Five Branch-Chariot Red-Tally Clerks**, and the **Riding-Moon Branch-Chariot Ghost-Capturing Envoys**, each numbering one hundred twenty myriad, to execute and eradicate malevolent rebels, pursue and capture essence-evil, with red tallies chasing and seizing, all to be annihilated.\n\nReverently emerge the **Supreme Divine Illustrious Officials, Central Palace Strong-Wind Riders Post-Horse Memorial-Submitting Clerks**, and the **Three and Five Eliminating-Death-Registers Determining-Life-Names Clerks**, each numbering ten myriad, to present memorials and submit petitions for your servant, swiftly transmitting them upward to eliminate death registers and inscribe life names in the Jade Calendar.\n\nReverently emerge the **Upper Immortal Capital’s Supreme Divine Illustrious Officials, Central Palace Central Yellow Nine Dao Determining-Will Clerks**, the **Determining-Intent Clerks**, the **Determining-Courage Clerks**, the **Determining-Wisdom Clerks**, the **Determining-Acuity Clerks**, the **Determining-Bravery Clerks**, and the **Warriors**, each numbering twelve myriad, to open and awaken your servant’s heart-spirit, penetrating the profound and subtle.\n\nReverently emerge the **Supreme Divine Illustrious Officials, Central Palace Six Yin Six Yang Body-Completing Clerks**, each numbering twelve myriad, to regulate yin and yang for your servant, prolonging life and preserving destiny, completing the body and uniting with the Dao, communicating with spirits and connecting with the perfected.\n\nReverently emerge the **Supreme Divine Illustrious Officials, Central Palace Eight Spirit Vajra Warriors, High-Chariot Direct-Affairs Envoys**, the **Red-Chariot Direct-Tally Envoys**, the **Branch-Chariot Inspecting-Capturing Envoys**, and the **Branch-Chariot Intercepting-Striking Warriors**, each numbering seven thousand two hundred, to pursue and strike malevolent rebels, slay and eradicate evil essences, diminish misfortune and exorcise calamities, and expel demonic thieves for your servant.\n\nReverently emerge the **Heavenly Illustrious Red Officials, Direct-Affairs Merit-Recorders**, the **Spirit-Registers Spirit-Capital Protectors, Prison-Capturing Great Clerks**, the **Evil-Capturing Envoys**, and the **Spirit-Direct-Tally Evil-Slaying Treachery-Stabbing Clerks**, each numbering two, along with one hundred twenty **Immortal Persons, Daoist Masters, and Jade Maidens**, the **Seven Body-Guarding Spirits**, fourteen **Unseparating-Body Generals and Clerks**, two **Illness-Treating Merit-Recorders and Body-Guarding Generals**, nine **Military-Affairs Clerks**, two **Bian Que Clerks and Heavenly Physicians**, all to execute authority, slay evil and destroy falsehood, repel death and invite life, assisting your servant’s body, ensuring responsive breath. Your servant, a humble reed of lowly quality, has fortunately encountered this millennial opportunity, prostrating to receive the precious register bestowed by the revered master, restraining the heart and cultivating the body to guard against excess—such grace is boundless.\n\nYour servant, having received the registers of the Upper Immortals and Supreme Spirits, along with their subordinate generals, merit-recorders, envoys, true officials, lords, generals, jade lads, jade maidens, soldiers, clerks, and troops, beseeches them to act according to their respective duties, transmit commands and convey truth, propagate the essentials of the Dao, establish merit to aid the state, practice transformation to save people, instruct the deluded and ignorant, and encourage the good and virtuous. Should any subordinate officials harbor malevolent qi or rebellious intent, or if there be ominous officials, slanderous tongues, or evil persons plotting to harm your servant, may the left and right officials and envoys immediately report to the Heavenly Offices without concealment. From year’s end to year’s end, from month’s end to month’s end, from day’s end to day’s end, from hour’s end to hour’s end, cycling without cease, may they act in accordance with the method, defending and protecting your servant’s body, delivering from calamities and hardships, ensuring longevity and enduring vision, with the heart-spirit settled and stable. Wherever your servant goes, may truth be embraced, and in all travels and destinations, may metal and stone open, water and fire assist. Beneath the covering of august heaven, upon the bearing of august earth, within the illumination of sun and moon, through the passage of mountains and rivers, may the hundred evils be subdued, the myriad spirits obey, the hundred passages flow with moisture, the five viscera generate fluids, true qi descend upon the body, refining form and transforming substance. When merit is accomplished and virtue complete, may your servant ascend to heaven in broad daylight, timely reporting merits without betraying trust.\n\nYour servant, a late and shallow learner, further burdened by foolishness and dimness, having perused the generals, clerks, soldiers, officials, generals, and troops, fears they may not conform to ritual propriety or align in proper order, accumulating a thousand transgressions and ten thousand errors. Humbly beseeches pardon and forgiveness, extending to those yet to awaken, that no punishment be meted. Your servant, with utmost reverence and trepidation, bows twice in prostration.\n\nUpon completion, swallow qi three times.\n\nNext, knock the teeth three times in succession, then kneel lengthily and pray:\nYour servant has concluded the register’s perusal. May the transcendent immortals, celestial spirits, functionaries, envoys, generals, clerks, and soldiers just summoned all return into your servant’s body, entering through the Gate of Myriad Mysteries, resuming their respective positions—those on the left returning to the left, those on the right to the right—resting securely in the golden hall and jade chamber. Let the functionaries and envoys take charge of their oversight, ensuring no disorder in the protective encirclement, that it may enfold and envelop without breach, boundless as heaven and earth. When summoned again, may they arrive as before, in accordance with precedent.\n\nNext, address the incense burner:\nIncense officials and envoys, Lords of the Left and Right Dragon-Tiger, attendant spirit-officials of incense, may this place where your servant peruses the register in quietude naturally generate golden fluid, cinnabar, azure mushrooms, and the assembled host of a hundred numinous perfected, all converging here before the incense burner. May what is here proclaimed ascend directly to the presence of the Most High Jade Emperor, the August Thearch.\n\nBow three times.\n\nNext, chant the *Hymn to the Study of Immortality*.\n\nNext, exit the chamber and recite the spell:\nThe rite of the Orthodox Unity register-perusal is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞神部威仪类 太上正一阅箓仪 经名：太上正一阅箓仪。 唐末杜光庭编集，系早期天师道阅箓仪改编本。 一卷。 底本出处：《正统道藏》洞神部威仪类。 太上正一阅箓仪 广成先生杜光庭集 凡受正一法箓，常以甲子、庚申、本命、三元、三会、五腊、八节、晦朔等日。 是日乃天气告生，阳明消暗，万善惟新，天神尽下，地神尽出，水神悉到，太一在位，搜选种民，考算功过，掇死定生，列名金阙。 道士及种民其日须清斋入靖，以卯酉时焚香，排办酒果二十四分，或一十六分，或一十二分，或八分，务令严洁。 先展舒法箓於几案之上，着新冷衣服，澡浴盥漱毕，然后入户上香存注，一一如法，不可阙也。 先持入户咒， 次上洞案香， 次上本案香， 次上香咒， 次礼师存念如法， 次鸣法鼓二十四通， 次发炉咒， 太上玄元五灵老君，当召功曹使者，左右龙虎君捧香使者三炁正神，急上关启 三天太上玄元道君，臣今正尔入靖烧香，以某会之日，正月七日上会，七月七日中会，十月五日下会谨依天师具典，简阅臣身中所佩正一盟威宝箓，愿得八方正真生炁降流臣某身中，所启速达径御太上至真无极大道玉皇尊帝御前。 各三礼。 次各称法位 泰玄都正一平炁系天师某治某炁赤天三五步纲元命真人臣某，谨上启 太清玄元无上三天无极大道太上道君、太上老君、太上丈人，天帝君、天帝丈人，九老仙都君、九炁丈人，百千万重道炁、千二百官君、太清玉陛下。 臣以凡愚，获奉玄化，大道垂法，正一兴行，叨荷师尊，授传秘箓延生飞化三五品文，内正身心，和宁神炁，外棱灾珍禳制氛邪，上仙上灵魁呈宝诀箓中将吏功曹众官，各有职司，保身护命，调平六府，澄静百关，使妖恶不侵，灾害不扰，三尸堕落，九虫销亡，九祖七玄，生天证道，开度群品，广济天人，佐国为时，立功及物，每以主会之日言功举迁，永誓遵修，不负效信，伏惟 三天大圣太上众尊，省览臣诚，常加恩宥，臣某诚惶诚恐，稽首顿首，谨启。 次出官 谨出臣某身中上仙上灵北一太上一将军，太上十将军，上仙百五十将军，直使功曹，正一功曹，治病功曹，各十五人，出主为臣执使主将，司察东西南北，正定诸炁，消除百病； 上仙上灵左右官使者，主将送东西南北，辟斥三灾九厄，五刑六害之考； 都主吏兵主领左右，无令前后错互； 上仙灵阴阳神决吏各十五人出，为臣和正阴阳，决定生籍，安神养性，使合真仙； 上仙上灵阴阳治病功曹，阴阳治病天医吏，各十五人，出主为臣调理阴阳，察侯五藏神仙妙药，却病消灾； 上仙上灵二官百五十将军，主领官将吏兵士卒，围绕臣身周匝三重，无令空缺； 上仙上灵郎吏、虎贲察奸钩骑，三官仆射吏，各千二百人出，主为臣屯守所居，营卫左右，随逐东西南北，去身百步兵刃，外向讨捕凶逆，执捉奸邪，并令绝灭，不得纵逸，常当保护臣身； 上仙上灵天驺甲卒各千二百人出，天丁力士各百二十人出，主为臣随遂东西南北，所有呼召应声而集； 上仙上灵收炁食炁吏，收神食神吏，收鬼食鬼吏，收邪食邪吏，收毒食毒吏，各六十人出，主为臣收食天下毒疫鬼炁，妖精邪神，伤寒疟疠，毒疰瘟邪，虫兽强（歹＋羊），皆收而食之，悉令荡散；",
      "translated_text": "**Dongshen Department, Ritual Propriety Section: The Supreme Orthodox Unity Register-Inspection Rite**\n\n**Text Title:** *The Supreme Orthodox Unity Register-Inspection Rite*\nCompiled by Du Guangting, the Master of Broad Accomplishment, in the late Tang dynasty—a revised version of an early Celestial Master register-inspection rite. One fascicle.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Dongshen Department, Ritual Propriety Section.\n\n---\n\n### **The Supreme Orthodox Unity Register-Inspection Rite**\nCompiled by Du Guangting, the Master of Broad Accomplishment\n\nFor all who receive the Orthodox Unity registers, the rites shall be performed on days of *jiazi*, *gengshen*, one’s life-destiny day, the Three Origins, the Three Assemblies, the Five La Festivals, the Eight Nodal Days, and the last and first days of the lunar month. On these days, the celestial *qi* announces renewal, the radiance of Yang dispels darkness, all virtues are made new, the heavenly spirits descend in full, the earthly spirits emerge in full, the water spirits arrive in full, the Great Unity takes its seat, and the seed-people are selected. Their merits and transgressions are examined, life and death are determined, and names are inscribed in the Golden Towers.\n\nOn such days, Daoists and seed-people must purify themselves, enter the oratory in fasting, and at the hours of *mao* and *you*, burn incense and prepare twenty-four portions of wine and fruit—or sixteen, twelve, or eight portions—ensuring all is solemn and immaculate. First, the register is unfurled upon the table. Donning fresh, cool garments and having bathed and rinsed, they then enter the chamber to offer incense and focus their intent, following each step precisely without omission.\n\nThe order of rites is as follows:\nFirst, recite the **Entrance Incantation**;\nNext, offer incense at the **Cave Table**;\nThen, offer incense at the **Primary Table**;\nNext, recite the **Incense Incantation**;\nThen, bow to the master and meditate as prescribed;\nNext, strike the **Ritual Drum** twenty-four times;\nThen, recite the **Furnace-Opening Incantation**:\n\n*\"Supreme Mystery-Origin, Five Numinous Venerable Lord, summon now the Merit-Officials and Messengers, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Messengers of the Three Qi Orthodox Spirits—hasten to report and transmit! To the Three Heavens’ Supreme Mystery-Origin Dao Lord, your servant now enters the oratory to burn incense. On this assembly day—the Upper Assembly on the seventh day of the first month, the Middle Assembly on the seventh day of the seventh month, the Lower Assembly on the fifth day of the tenth month—faithfully following the Celestial Master’s canonical rites, I inspect the Orthodox Unity Alliance-Awe Precious Register bestowed upon my person. May the life-*qi* of the Eight Directions’ Orthodox Perfected descend and flow into my body. May this petition swiftly ascend before the Supreme Perfected, Boundless Great Dao, the Jade Emperor, and the August Emperor of the Most High.\"*\n\nBow thrice after each recitation.\n\nNext, declare the ritual rank:\n*\"From the Great Mystery Capital, Orthodox Unity, Level-*Qi* System, Celestial Master of [X] Treatment, [X]-Qi Red Heaven’s Three-Five Step-Net Destiny Perfected, your servant [Name], humbly petitions the Most High Pure Mystery-Origin, Boundless Three Heavens’ Supreme Great Dao: the Supreme Dao Lord, the Supreme Venerable Lord, the Supreme Elder, the Heavenly Emperor Lord, the Heavenly Emperor Elder, the Nine Elders of the Immortal Capital, the Nine-*Qi* Elder, the myriad layers of Dao-*qi*, the Twelve Hundred Official Lords, and the August Presence beneath the Jade Terrace of the Great Clarity.*\n\n*Though unworthy and foolish, I have received the profound transformation of the Great Dao. As the Dao bestowed its methods and the Orthodox Unity flourished, I was graced by my revered master with the transmission of the secret registers—*Extending Life, Transcendent Flight, Three-Five Grade Scriptures*—to inwardly rectify body and mind, harmonize and pacify spirit and *qi*, and outwardly ward off calamities, suppress misfortunes, and repel pernicious influences. May the superior immortals and numinous marshals, the generals, officials, and merit-officers within the precious registers, each according to their office, protect my body and life, regulate the Six Palaces, calm the Hundred Passes, ensuring that malevolence and misfortune do not intrude, the Three Corpses fall away, the Nine Worms perish, the Nine Ancestors and Seven Generations ascend to heaven and attain the Dao, deliver all beings, broadly aid heaven and humanity, assist the state in its time, establish merit for all things. On each assembly day, may my merits be reported and my rank advanced. I vow to uphold these practices eternally, never betraying my oath of devotion. Humbly beseeching the Great Saints of the Three Heavens and the Venerable Hosts to regard my sincerity and ever grant me grace and forgiveness.\"*\n\nBow repeatedly in reverence.\n\nNext, summon the officials:\n*\"Humbly summon from within your servant’s body:\nThe **Superior Immortals and Numinous Lords**, the **Northern First Supreme Unity General**, the **Ten Generals of the Supreme Unity**, the **One Hundred Fifty Generals of the Superior Immortals**, the **Direct Merit-Officials**, the **Orthodox Unity Merit-Officials**, and the **Healing Merit-Officials**, fifteen each, to emerge and serve as your servant’s executive marshals, overseeing the regulation of *qi* in the east, west, south, and north, dispelling the Hundred Diseases;\nThe **Superior Immortals and Numinous Left and Right Official Messengers**, the **Marshals of the Four Directions**, to repel the Three Calamities, Nine Perils, Five Punishments, and Six Harms;\nThe **Chief Scribes and Soldiers**, leading the left and right, ensuring no errors in sequence;\nThe **Superior Immortal Numinous Yin-Yang Divine Judgment Officials**, fifteen each, to emerge and harmonize your servant’s yin and yang, determine the register of life, pacify spirit and nurture nature, aligning with the Perfected Immortals;\nThe **Superior Immortal Numinous Yin-Yang Healing Merit-Officials**, the **Yin-Yang Healing Heavenly Physician Scribes**, fifteen each, to emerge and regulate your servant’s yin and yang, examine the Five Viscera’s spirits, and administer the immortals’ wondrous medicines to dispel illness and misfortune;\nThe **One Hundred Fifty Generals of the Two Offices of the Superior Immortals and Numinous Lords**, to lead the marshals, officials, scribes, and soldiers in encircling your servant’s body thrice, leaving no gaps;\nThe **Superior Immortal Numinous Gentleman Scribes**, the **Tiger-Rushing Detectives**, the **Hook-Riding Cavalry**, the **Three Officials’ Archery Scribes**, one thousand two hundred each, to emerge and garrison your servant’s dwelling, guarding left and right, following east, west, south, and north within a hundred paces, their weapons outward to hunt and capture rebels and malefactors, executing them utterly without escape, ever protecting your servant’s body;\nThe **Superior Immortal Numinous Heavenly Couriers**, the **Armored Soldiers**, one thousand two hundred each, and the **Heavenly Might Warriors**, one hundred twenty each, to emerge and follow your servant in all directions, responding to every summons with haste;\nThe **Superior Immortal Numinous *Qi*-Gathering, *Qi*-Consuming Scribes**, the **Spirit-Gathering, Spirit-Consuming Scribes**, the **Ghost-Gathering, Ghost-Consuming Scribes**, the **Malevolence-Gathering, Malevolence-Consuming Scribes**, the **Toxin-Gathering, Toxin-Consuming Scribes**, sixty each, to emerge and gather and consume the world’s toxic epidemics, demonic *qi*, malevolent spirits, and pernicious gods, as well as *shanghan* fevers, malarial miasmas, venomous infestations, pestilential evils, and vicious beasts—all to be gathered, consumed, and utterly dispersed.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1276,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.801374435424805,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上正一阅箓仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "上仙上灵科车赤符吏，刚风骑置驿马上章吏各十人出，主为臣收捕奸邪鬼贼不正之炁，呈章奏表，速令上达。 次随品出箓中吏兵 谨出太上正一一将军箓，箓中功曹将军使者吏兵玉女等，为臣助国行化，翦灭凶恶，使至道兴弘。 谨出太上正一十将军箓，箓中将军符吏功曹官将等，为臣斩恶赏善，万愿随心。 谨出太上正一百五十将军箓，箓中左上仙，右上灵功曹将军骑吏使者甲卒等，为臣辟斥四方不正人鬼，祸害永消。 谨出太上正一三将军箓，箓中将军功曹童子玉女等，为臣修生养炁，增延寿禄，所向安宁。 谨出太上正一右上灵召百鬼箓，箓中功曹护身将军，玉童玉女等，为臣收斩身中及天下魑魅魍魉，无害於人。 谨出太上正一混沌元命赤箓，箓中三天解秽玉童玉女五方龙王吏兵等，为臣消灭血食浮游侵人之鬼，一切荡除。 谨出太上正一上仙召百鬼箓，箓中诸部真人，直神功曹，六甲神将等，为臣杀灭身上三灾九厄，一切无侵。 谨出太上正一九州社令箓，箓中诸部大将军功曹，玉童玉女，直符使者等，为臣於九州十二国分野之内，制伏邪精，行神布炁，所向之地，随逐司迎拥护臣身，克登仙品。 谨出太上正一星纲五斗箓，箓中太玄西玄壶玄禁契三师将军吏兵等，为臣行纲布禁，遏截凶邪，一切精祟。 谨出太上正一河图保命箓，箓中真人功曹将军使者，玉童玉女等，为臣保身护命，应臣召请，悉令效验。 谨出太上正一解六害神符箓，箓中太一君，皇天上帝君，太上元君，解六害神，消刑灭害功曹将军等，为臣驱逐妖徉，解除灾害，千精万鬼，并令摄伏。 谨出太上正一九凤破秽箓，箓中天灵赤官，斩邪功曹，诛邪摄邪破邪伐邪击邪截邪前邪灭邪禽奇将军使者，玉童玉女等，为臣涤荡不系籍之神，皆令灭除。 谨出太上正一都章毕印箓，箓中天灵官，功曹将军，仙人道士，玉女使者等，为臣斩灭万邪灾祸，不侵於人。 谨出太上正一华盖大箓，箓中诸部功曹，将军吏兵，玉童玉女，五云兵士等，为臣诛斩恶逆，消灭奸伪。 谨出太上正一九天兵符箓，箓中功曹将军吏兵使者甲卒等，为臣守固所居，呼召立到。 谨出太上正一九宫捍厄箓，箓中功曹上仙上灵将军使者，天驺甲卒等，为臣 助国救人，应於所召。 谨出太上正一八卦护身箓，箓中五方召鬼将军，左右仆射吏兵等，为臣尺置一兵，里置一营，按剑持戟，斩绝邪精。 谨出太上正一三五考召箓，箓中三元将军，五斗功曹，五星功曹，童子使者等，为臣招星落斗，缨络身形凶神恶人，并令摄伏。 谨出太上正一龙虎斩邪箓，箓中功曹将军使者，玉童玉女等，为臣抗抒精邪，存念立应。 谨出太上正一辟邪妙箓，箓中玄老将军，五盖将军，太上将军，功曹使者等，为臣镇压天神地只害於物者，魍魉精魅，永不害人。 谨出太上正一四部禁炁箓，箓中赤官诸部功曹将军吏兵，玉童玉女等，为臣跳星蹑斗，步纪存神，应於本心勿生疾患。 谨出太上正一大斩河邪箓，箓中五十领将军，胡越氐羌伧等老君虎贲将士，施天发地，摇天动地将军，五色五盖兵马无上玄老将军吏兵使者，玉童玉女等，为臣飞戈轮刀，搜索精邪，营卫居止，皆令安稳。 谨出太上正一三五功曹箓，箓中蔽身隐形藏己兵马等，为臣内守三宫，外治三界，所有天神地祇坏道邪魔，悉令荡除，思念立应。",
      "translated_text": "The **Superior Immortal Numinous Vermilion Talisman Scribes of the Chariot Division**, the **Stalwart Wind Couriers**, and the **Swift Steeds for Memorials to the Throne**, ten each, to emerge and serve your servant in capturing and seizing treacherous and malevolent spirits, thieving demons, and unrighteous *qi*, presenting memorials and petitions to swiftly transmit them upward.\n\nNext, in accordance with their ranks, emerge the **Officers and Soldiers from the Registers**:\nReverently emerge the **Register of the Supreme Orthodox Unity First General**, with its **Attendant Generals, Envoys, Officers, Soldiers, and Jade Maidens**, to assist your servant in aiding the state and propagating transformation, exterminating the fierce and wicked, that the Supreme Dao may flourish and expand.\nReverently emerge the **Register of the Supreme Orthodox Unity Ten Generals**, with its **Generals, Talisman Scribes, Attendant Officers, and Commanding Generals**, to serve your servant in beheading the evil and rewarding the good, fulfilling ten thousand wishes as the heart desires.\nReverently emerge the **Register of the Supreme Orthodox Unity One Hundred Fifty Generals**, with its **Left Superior Immortals, Right Superior Numinous Attendant Generals, Couriers, Officers, Envoys, and Armored Soldiers**, to serve your servant in repelling and expelling unrighteous humans and ghosts from the four directions, that calamities and harms may forever cease.\nReverently emerge the **Register of the Supreme Orthodox Unity Three Generals**, with its **Generals, Attendant Officers, Divine Lads, and Jade Maidens**, to serve your servant in cultivating life and nurturing *qi*, augmenting and prolonging lifespan and fortune, ensuring peace and tranquility wherever directed.\nReverently emerge the **Register of the Supreme Orthodox Unity Right Superior Numinous Summons of the Hundred Ghosts**, with its **Attendant Generals for Body Protection, Jade Lads, and Jade Maidens**, to serve your servant in capturing and beheading the *chimei* and *wangliang* within the body and throughout the world, that they may cause no harm to people.\nReverently emerge the **Supreme Orthodox Unity Primordial Chaos Original Destiny Vermilion Register**, with its **Jade Lads and Jade Maidens of the Three Heavens for Dispelling Filth, Officers and Soldiers of the Five Directions’ Dragon Kings**, to serve your servant in annihilating the ghosts of blood sacrifices and wandering specters that assail people, utterly sweeping all away.\nReverently emerge the **Supreme Orthodox Unity Superior Immortal Summons of the Hundred Ghosts Register**, with its **Perfected Ones of All Divisions, Direct Spirits, Attendant Officers, and Generals of the Six Jia**, to serve your servant in slaying and extinguishing the three disasters and nine calamities upon the body, that all may be free from harm.\nReverently emerge the **Supreme Orthodox Unity Register of the Nine Provinces’ Community Deities**, with its **Great Generals of All Divisions, Attendant Officers, Jade Lads, Jade Maidens, and Direct Talisman Envoys**, to serve your servant within the twelve states’ territories of the nine provinces, subduing malevolent spirits, deploying divine forces and spreading *qi*, that wherever directed, they may follow and attend, escorting and protecting your servant’s person, ensuring ascension to the ranks of immortality.\nReverently emerge the **Supreme Orthodox Unity Register of the Star Net and Five Dipper**, with its **Generals, Officers, and Soldiers of the Three Masters of the Great Mystery, Western Mystery, and Pot Mystery Prohibitions**, to serve your servant in deploying the net and spreading prohibitions, intercepting and blocking fierce and malevolent spirits, and all demonic afflictions.\nReverently emerge the **Supreme Orthodox Unity *He Tu* Register for Preserving Life**, with its **Perfected Ones, Attendant Officers, Generals, Envoys, Jade Lads, and Jade Maidens**, to serve your servant in protecting the body and safeguarding life, responding to all summons and petitions, ensuring efficacy in every instance.\nReverently emerge the **Supreme Orthodox Unity Register of the Divine Talismans for Dispelling the Six Harms**, with its **Lord of the Great One, Lord Sovereign of August Heaven, Supreme Primordial Lord, Spirits for Dispelling the Six Harms, Generals for Eliminating Punishments and Annihilating Harms, and Attendant Officers**, to serve your servant in driving away portents and omens, dissolving and removing disasters and harms, that the thousand spirits and ten thousand ghosts may all be subdued and vanquished.\nReverently emerge the **Supreme Orthodox Unity Register of the Nine Phoenixes for Breaking Filth**, with its **Heavenly Numinous Vermilion Officials, Generals for Beheading Malevolence, Seizing Malevolence, Breaking Malevolence, Attacking Malevolence, Striking Malevolence, Intercepting Malevolence, Advancing against Malevolence, and Annihilating Malevolence, the *Qinqi* General, Envoys, Jade Lads, and Jade Maidens**, to serve your servant in cleansing and sweeping away the gods not listed in the registers, ensuring their complete eradication.\nReverently emerge the **Supreme Orthodox Unity Register of the Capital Memorials and Completed Seals**, with its **Heavenly Numinous Officials, Attendant Officers, Generals, Immortals, Daoists, Jade Maidens, and Envoys**, to serve your servant in beheading and extinguishing the ten thousand malevolent disasters and calamities, that they may not assail people.\nReverently emerge the **Supreme Orthodox Unity Register of the Great Canopy**, with its **Attendant Officers of All Divisions, Generals, Officers, Soldiers, Jade Lads, Jade Maidens, and Five Cloud Soldiers**, to serve your servant in executing and beheading the rebellious and wicked, annihilating the treacherous and deceitful.\nReverently emerge the **Supreme Orthodox Unity Register of the Nine Heavens’ Military Talismans**, with its **Attendant Officers, Generals, Officers, Soldiers, Envoys, and Armored Troops**, to serve your servant in guarding and fortifying the dwelling, responding to summons with immediate arrival.\nReverently emerge the **Supreme Orthodox Unity Register of the Nine Palaces for Warding Off Calamities**, with its **Attendant Officers, Superior Immortals, Superior Numinous Generals, Envoys, Heavenly Couriers, and Armored Soldiers**, to serve your servant in aiding the state and rescuing people, responding to all summons.\nReverently emerge the **Supreme Orthodox Unity Register of the Eight Trigrams for Body Protection**, with its **Generals of the Five Directions for Summoning Ghosts, Left and Right Commanders, Officers, and Soldiers**, to serve your servant by stationing one soldier every *chi* and one encampment every *li*, wielding swords and halberds, beheading and severing malevolent spirits.\nReverently emerge the **Supreme Orthodox Unity Register of the Three and Five Examinations and Summons**, with its **Generals of the Three Origins, Attendant Officers of the Five Dippers, Attendant Officers of the Five Stars, Divine Lads, and Envoys**, to serve your servant in summoning stars and causing dipper spirits to descend, binding and restraining the forms of fierce gods and evil people, ensuring all are subdued and vanquished.\nReverently emerge the **Supreme Orthodox Unity Register of the Dragon and Tiger for Beheading Malevolence**, with its **Attendant Officers, Generals, Envoys, Jade Lads, and Jade Maidens**, to serve your servant in resisting and expelling demonic and malevolent spirits, responding instantly to focused invocation.\nReverently emerge the **Supreme Orthodox Unity Register of the Wondrous Talismans for Repelling Malevolence**, with its **Mysterious Elder General, Five Canopy Generals, Supreme General, Attendant Officers, and Envoys**, to serve your servant in suppressing the gods of heaven and earth that harm living beings, that the *wangliang* and demonic spirits may never harm people.\nReverently emerge the **Supreme Orthodox Unity Register of the Four Divisions’ Prohibitive *Qi***, with its **Vermilion Officials, Attendant Officers, Generals, Officers, Soldiers, Jade Lads, and Jade Maidens of All Divisions**, to serve your servant in leaping through stars and treading upon dipper spirits, pacing the chronograms and invoking the gods, responding to the heart’s intent without generating illness or affliction.\nReverently emerge the **Supreme Orthodox Unity Register of the Great Beheading of River Malevolence**, with its **Fifty Commanding Generals, Hu, Yue, Di, Qiang, and Cang Generals of the Elder Lord’s Tiger Warriors, Generals for Launching Heaven and Shaking Earth, Generals for Shaking Heaven and Moving Earth, Five-Colored Five-Canopy Soldiers and Horses, the Supreme Mysterious Elder General, Officers, Soldiers, Envoys, Jade Lads, and Jade Maidens**, to serve your servant in brandishing flying daggers and wheeling blades, searching out and scouring demonic spirits, that the encampments and dwellings may all be secure and stable.\nReverently emerge the **Supreme Orthodox Unity Register of the Three and Five Attendant Officers**, with its **Soldiers and Horses for Concealing the Body, Hiding the Form, and Concealing the Self**, to serve your servant in internally guarding the Three Palaces and externally governing the Three Realms, that all celestial gods, earthly deities, and Dao-corrupting demonic forces may be utterly swept away, responding instantly to focused thought.",
      "overlap_context": "pirit-Gathering, Spirit-Consuming Scribes**, the **Ghost-Gathering, Ghost-Consuming Scribes**, the **Malevolence-Gathering, Malevolence-Consuming Scribes**, the **Toxin-Gathering, Toxin-Consuming Scribes**, sixty each, to emerge and gather and consume the world’s toxic epidemics, demonic *qi*, malevolent spirits, and pernicious gods, as well as *shanghan* fevers, malarial miasmas, venomous infestations, pestilential evils, and vicious beasts—all to be gathered, consumed, and utterly dispersed.\"*",
      "start_char": 1276,
      "end_char": 2597,
      "start_sentence": 37,
      "end_sentence": 62,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.64734482765198,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上正一阅箓仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "谨出太上正一保命长生箓，箓中魁纲左右诸部功曹将军吏兵使者等，为臣内治五藏，外却众邪，使三尸殄灭，百关调畅，功成行满，白日升天，仰荷玄泽。 次出诸部将军兵马 谨出太上正一诸部玄老五侯大将军五十万人。 出无上玄留大将军、周天大将军、盖天大将军、建天大将军、中越大将军、中武大将军、中御大将军、中亭大将军各十万人。 出太上五盖大将军、天营大将军、九种大将军、冲天大将军、九关大将军、北阙大将军、九珠大将军、九道大将军、正天大将军、平天大将军、越门大将军、中央高皇领神大将军、青领大将军、赤领大将军、黄领大将军、白领大将军、黑领大将军各十万人。 出各领所部并依本位，营卫臣前后左右，除凶灭恶。 无上五种兵五十五万人，出中宫五营校尉兵十万人出，城门校尉兵四十万人。 出中央大兵四百万人。 出九正丈人中野大兵百万人。 出太上城门大兵四十万人。 出天丁大兵四十万人。 出前帝东营大兵四十万人，出督天大兵四十万人，出发天大兵四十万人，出北方五秦兵四十万人，出五盖大兵各四十万人，出左右将灭亡兵各二十，人出左右将横行兵各六十人，出东方胡老君反甲逆鳞兵九十万人，出南方越老君火营骑吏火烛兵十万人，出西方氏老君炼杖金精兵六十万人，出北方羌老君扁鹊乌丸兵五十万人，出中央三秦伧老君二十五万官君兵士百二十万人，出东方青始甲乙君，南方赤始丙丁君，西方白始庚辛君，北方黑始壬癸君，中央黄始戊己天柱司命君，车骑兵各千二百人，出高天万丈百鬼中王各万二千人，兵士六十万人，出高功司马中骑大将军，郎吏虎贲察奸钩骑、三官仆射，各千二百人，出天驺甲卒、天丁力士、收炁食炁吏，收神食神吏，收邪食邪吏，收鬼食鬼吏，收精食精吏，收毒食毒吏，诛符破庙吏各万二千人，出主为臣侍卫前后所部兵士，备执天威器仗，诛讨凶逆，剪灭精邪，防护臣身，呼召立至。 谨出臣所佩上三天三五前后中部元命混沌真人赤箓直使功曹各十五人，出主为臣执使东西南北布定正炁救疗诸病，益寿延年左右官使者，各十五人。 出为臣通达幽冥，共相整理，无令前却阴阳神决吏各十五人。 出为臣调和阴阳，决定生籍，流布生炁阴阳二官，治病天医吏各十五人，出为臣和合针药，疗诸疾病。 谨出收邪却伪功曹使者各十五人，出为臣收邪却伪，灭恶诛凶司命吏十五人。 出为臣增寿益算司录吏十五人。 出为臣加爵进禄司危吏十五人。 出为臣理化无乱司伐吏十五人。 出为臣斩妖灭魔司直十五人。 出为臣却枉翦滥司奸吏十五人。 出为臣执制邪注司察吏十五人。 出为臣请是护非都司吏十五人。 出为臣伏逆理顺上三天文昌中宫中黄九道司命君十五人。 出为臣除死籍正生名，固守丹田，消灾辟病。 谨出赤天三五混沌生身蔽神斗纲大将军左将军右将军各九人，出斗魁大将军左将军右将军各九人，出斗□大将军左将军右将军各九人，出九部将军并治臣左肾，斗纲定生，斗魁生肝，斗□生魂，不得有违。 谨出赤天三五混沌生形蔽影斗□大将军左将军右将军各九人，出斗□大将军左将军右将军各九人，出斗魓大将军左将军右将军各九人，出九部将军并治臣右肾，斗□生形斗□生肺，斗魓生魄，不得有违。",
      "translated_text": "Reverently emerge the **Supreme Orthodox Unity Register for Preserving Life and Prolonging Existence**, with its **Left and Right Marshals of the Principal Network and all Departments’ Attendant Officers, Generals, Officers, Soldiers, and Envoys**, to serve your servant in internally governing the Five Viscera and externally repelling all demonic forces, that the Three Corpses may be annihilated, the Hundred Passes harmonized and unobstructed, merits perfected and deeds fulfilled, and ascension to Heaven in broad daylight achieved, humbly bearing the mysterious grace.\n\nNext emerge the **Generals and Soldiers of the Various Departments**:\nReverently emerge the **Supreme Orthodox Unity Register of the Various Departments’ Mysterious Elders and Five Marquises, Great Generals of Five Hundred Thousand**.\nEmerge the **Supreme Mysterious Elder General**, the **Circumpolar Great General**, the **Canopy Heaven Great General**, the **Establishing Heaven Great General**, the **Central Yue Great General**, the **Central Martial Great General**, the **Central Charioteer Great General**, and the **Central Pavilion Great General**, each with one hundred thousand soldiers.\nEmerge the **Five Canopies Great General of the Supreme**, the **Heavenly Encampment Great General**, the **Nine Kinds Great General**, the **Soaring Heaven Great General**, the **Nine Passes Great General**, the **Northern Watchtower Great General**, the **Nine Pearls Great General**, the **Nine Ways Great General**, the **Orthodox Heaven Great General**, the **Pacifying Heaven Great General**, the **Yue Gate Great General**, the **Central High August Deity Leading the Spirits Great General**, the **Azure-Leading Great General**, the **Vermilion-Leading Great General**, the **Yellow-Leading Great General**, the **White-Leading Great General**, and the **Black-Leading Great General**, each with one hundred thousand soldiers.\nEmerge each to lead their respective divisions, encamping and guarding before, behind, left, and right of your servant, eliminating misfortune and annihilating evil.\n\nThe **Five Kinds of Supreme Soldiers of Five Hundred Fifty Thousand**:\nEmerge the **Central Palace Five Encampments’ Commandant Soldiers of One Hundred Thousand**.\nEmerge the **City Gate Commandant Soldiers of Four Hundred Thousand**.\nEmerge the **Central Great Soldiers of Four Million**.\nEmerge the **Nine Orthodox Elders’ Central Wild Great Soldiers of One Million**.\nEmerge the **Supreme City Gate Great Soldiers of Four Hundred Thousand**.\nEmerge the **Heavenly Ding Soldiers of Four Hundred Thousand**.\nEmerge the **Former Emperor’s Eastern Encampment Great Soldiers of Four Hundred Thousand**, the **Supervising Heaven Great Soldiers of Four Hundred Thousand**, the **Issuing Heaven Great Soldiers of Four Hundred Thousand**, the **Northern Five Qin Soldiers of Four Hundred Thousand**, and the **Five Canopies Great Soldiers of Four Hundred Thousand each**.\nEmerge the **Left and Right Generals’ Annihilation Soldiers of Twenty Each**, the **Left and Right Generals’ Rampant Soldiers of Sixty Each**.\nEmerge the **Eastern Hu Elder Lord’s Reverse-Armor Reverse-Scale Soldiers of Nine Hundred Thousand**, the **Southern Yue Elder Lord’s Fire Encampment Cavalry Officers and Fire-Torch Soldiers of One Hundred Thousand**, the **Western Di Elder Lord’s Smelting-Staff Metal Essence Soldiers of Six Hundred Thousand**, the **Northern Qiang Elder Lord’s Bian Que Wuyuan Soldiers of Five Hundred Thousand**, and the **Central Three Qin Cang Elder Lord’s Twenty-Five Myriad Official Lords and Soldiers of One Million Two Hundred Thousand**.\nEmerge the **Eastern Azure Origin Jia-Yi Lords**, the **Southern Vermilion Origin Bing-Ding Lords**, the **Western White Origin Geng-Xin Lords**, the **Northern Black Origin Ren-Gui Lords**, and the **Central Yellow Origin Wu-Ji Heavenly Pillar Controller of Destiny Lords**, each with one thousand two hundred chariots and cavalry.\nEmerge the **High Heaven Ten-Thousand-Yard Hundred Ghosts’ Central Kings of Twelve Thousand Each**, with soldiers of six hundred thousand.\nEmerge the **High Merit Controller of Horses, Central Cavalry Great General**, the **Officers and Tiger Warriors Inspecting Treachery and Hook Cavalry**, and the **Three Officials’ Archers**, each of one thousand two hundred.\nEmerge the **Heavenly Couriers and Armored Soldiers**, the **Heavenly Ding Valiant Warriors**, the **Qi-Absorbing Qi-Consuming Officers**, the **Spirit-Absorbing Spirit-Consuming Officers**, the **Demon-Absorbing Demon-Consuming Officers**, the **Ghost-Absorbing Ghost-Consuming Officers**, the **Essence-Absorbing Essence-Consuming Officers**, the **Poison-Absorbing Poison-Consuming Officers**, and the **Talisman-Destroying Temple-Demolishing Officers**, each of twelve thousand.\nEmerge the **Soldiers of the Divisions Commanded to Serve and Guard Before and Behind Your Servant**, wielding the instruments of Heavenly Might, to punish and suppress rebellious forces, exterminate demonic essences, and protect your servant’s person, responding instantly to summoning.\n\nReverently emerge the **Upper Three Heavens’ Three and Five Front, Rear, and Central Departments’ Primordial Destiny Chaos Perfected Persons’ Red Register Direct Envoys and Attendant Officers of Fifteen Each**, to serve your servant in wielding and dispatching the Orthodox Qi to the East, West, South, and North, establishing and rectifying it to heal all illnesses, augment longevity, and extend the years, with Official Envoys of fifteen each.\nEmerge to serve your servant in communicating with and ordering the Netherworld, ensuring no advance or retreat in the divine decrees of Yin and Yang, with Officers of fifteen each.\nEmerge to serve your servant in harmonizing Yin and Yang, determining the Register of Life, and circulating the Qi of Life, with the **Yin and Yang Two Officials** and the **Heavenly Physicians Treating Illness**, each of fifteen.\nEmerge to serve your servant in compounding needles and medicines to heal all illnesses.\nReverently emerge the **Attendant Officers and Envoys for Absorbing Demons and Repelling Falsehood of Fifteen Each**, to serve your servant in absorbing demons and repelling falsehood, annihilating evil and punishing rebellion, with the **Controller of Destiny Officers of Fifteen**.\nEmerge to serve your servant in augmenting longevity and increasing lifespan, with the **Controller of Records Officers of Fifteen**.\nEmerge to serve your servant in advancing rank and increasing emolument, with the **Controller of Perils Officers of Fifteen**.\nEmerge to serve your servant in governing and transforming without disorder, with the **Controller of Punishments Officers of Fifteen**.\nEmerge to serve your servant in beheading demons and annihilating malevolent spirits, with the **Controller of Rectitude of Fifteen**.\nEmerge to serve your servant in repelling injustice and eliminating excess, with the **Controller of Treachery Officers of Fifteen**.\nEmerge to serve your servant in restraining and controlling demonic infestations, with the **Controller of Investigation Officers of Fifteen**.\nEmerge to serve your servant in petitioning for right and protecting against wrong, with the **Capital Controller Officers of Fifteen**.\nEmerge to serve your servant in subduing rebellion and governing compliance, with the **Upper Three Heavens’ Literary Prosperity Central Palace Central Yellow Nine Ways Controller of Destiny Lords of Fifteen**.\nEmerge to serve your servant in erasing the Register of Death and rectifying the Name of Life, firmly guarding the Cinnabar Field, and dispelling calamities and averting illnesses.\n\nReverently emerge the **Red Heaven Three and Five Chaos Birth-Body Concealing-Spirit Dipper-Network Great General, Left General, and Right General of Nine Each**, the **Dipper Handle Great General, Left General, and Right General of Nine Each**, the **Dipper [ ] Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s left kidney, the Dipper-Network determining life, the Dipper Handle generating the liver, and the Dipper [ ] generating the hun-soul, with no disobedience permitted.\nReverently emerge the **Red Heaven Three and Five Chaos Birth-Form Concealing-Shadow Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper Seventh Star Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s right kidney, the Dipper [ ] generating form, the Dipper [ ] generating the lungs, and the Dipper Seventh Star generating the po-soul, with no disobedience permitted.",
      "overlap_context": "pments and dwellings may all be secure and stable.\nReverently emerge the **Supreme Orthodox Unity Register of the Three and Five Attendant Officers**, with its **Soldiers and Horses for Concealing the Body, Hiding the Form, and Concealing the Self**, to serve your servant in internally guarding the Three Palaces and externally governing the Three Realms, that all celestial gods, earthly deities, and Dao-corrupting demonic forces may be utterly swept away, responding instantly to focused thought.",
      "start_char": 2598,
      "end_char": 3846,
      "start_sentence": 63,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.97151708602905,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上正一阅箓仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "谨出赤天三五混沌生躯蔽身斗□大将军左将军右将军各九人，出斗魒大将军左将军右将军各九人，出斗击大将军左将军右将军各九人，出九部将军并治臣心中，斗□生人，斗魒生筋，斗击生神，不得有违。 谨出赤天三五辅体斗击大将军左将军右将军各九人，出斗伐大将军左将军右将军各九人，出斗杀大将军左将军右将军各九人，出九部将军并治臣肝中，斗击安魂，斗伐静魄，斗杀仙魂，不得差互。 谨出赤天三五璇玑却敌大将军左将军右将军各九人，出斗衡破敌大将军左将军右将军各九人，出收击大将军左将军右将军各九人，出九部将军各治臣肺中，却敌安魂，破敌静魂，收击仙魄，不得有替。 谨出赤天三五中黄司命大将军左将军右将军各九人，出定寿大将军左将军右将军各九人，出定仙大将军左将军右将军各九人，出九部将军并治臣脾中，司命安神，定寿静神，定仙百神，不得有犯。 谨出上仙都太上神明上灵官中宫执凶郎吏，虎贲力士，破敌察奸，钩骑仆射力士，斩邪三官都官仆射力士各二百四十人，出主为臣守护所居，执捉凶逆，讨捕奸邪，并令消灭，不得遗失。 谨出上仙都太上神明上灵官中宫断截都官仆射各二百四十人，出主为臣南北束西给侍驱使，呼召立到。 谨出上仙都太上神明上灵官中宫乘魁收炁食炁吏，乘斗收神食神吏，乘星收鬼食鬼吏，乘璇玑收精食精吏，乘玉衡收邪食邪吏各百二十人，出为臣收食天下凶注鬼炁精邪妖孽之神。 谨出太上神明上灵官中宫乘日三五科车赤符吏，乘月科车捕鬼使者各百二十万人，出为臣诛翦凶逆，讨捕精邪，赤符追摄，并令殄灭。 谨出太上神明上灵官中宫刚风骑置驿马上章吏，三五除死籍定生名吏各十万人，出为臣呈章奏表，速令上御消除死籍，注上玉历生名。 谨出上仙都太上神明上灵官中宫中黄九道定志吏，定意吏，定胆吏，定慧吏，定聪吏，定勇吏力士各十二万人，出主令臣心神开悟，通达玄微。 谨出太上神明上灵官中宫六阴六阳成身吏各十二万人，出为臣调理阴阳，延年保命，成身合道，通神接真。 谨出太上神明上灵官中宫八神金刚力士高车直事使者，赤车直符使者，科车检捕使者，科车交击力士各七千二百人，出为臣讨击凶逆，斩伐邪精，减祸禳灾，驱除鬼贼。 谨出天灵赤官直使功曹，摄神籍神都护摄狱大吏，摄邪使者，及摄神直符斩邪刺奸吏各二人，出仙人道士玉女各百二十人，出护身七神，不得离身将吏各十四人，出治病功曹护身将军各二人，出兵马曹吏各九人，出扁鹊吏天医吏各二人，出出者并按威仪诛邪灭伪，却死来生，扶助臣身，令呼吸相应，臣某草茅贱质，千载幸会，伏蒙师尊赐授宝箓，制心修身，以自防保过泰之恩，实为罔极，臣所佩受上仙上灵等箓所部将军功曹使者，真官君将，玉童玉女，士卒吏兵，并乞依按所部当局行事，衔命传真，宣扬道要，立功佐国，行化救人，训道愚迷，劝进良善，若有下官故炁恶逆，凶邪县官口舌，恶人谋议，欲见中伤臣某者，左右官使者径上天曹言白，不得容隐，从岁竟岁，从月竟月，从日竟日，从时竟时，周而复始，奉行如法，营卫臣身，免度厄难，长生久视，心神安定，所向含真，出入行游诸所造诣，金石为开，水火为济，皇天所覆，皇地所载，日月所照，山川所通，百邪摧伏，万神敬诺，百关流润，五藏生津，真炁降身，炼形易质，功成德备，白日升天，当以时言功，不负效信，臣晚学浅劣，加以愚暗，向所简阅将军吏兵官将士卒等，恐不合仪式，不相次比，千愆万过，乞垂赦宥，一及济未悟，不见罪罚，臣某诚惶诚恐，稽首再礼。",
      "translated_text": "Reverently emerge the **Red Heaven Three and Five Chaos Birth-Body Concealing-Self Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper Striking Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s heart, the Dipper [ ] generating humanity, the Dipper [ ] generating sinews, and the Dipper Striking generating the spirit, with no disobedience permitted.\n\nReverently emerge the **Red Heaven Three and Five Assisting-Body Dipper Striking Great General, Left General, and Right General of Nine Each**, the **Dipper Subduing Great General, Left General, and Right General of Nine Each**, the **Dipper Slaying Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s liver, the Dipper Striking pacifying the hun-soul, the Dipper Subduing calming the po-soul, and the Dipper Slaying immortalizing the hun-soul, with no error or conflict allowed.\n\nReverently emerge the **Red Heaven Three and Five Jade-Mechanism Repelling-Enemies Great General, Left General, and Right General of Nine Each**, the **Dipper Balance Breaking-Enemies Great General, Left General, and Right General of Nine Each**, the **Seizing-Strike Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, each to govern your servant’s lungs, repelling enemies to pacify the hun-soul, breaking enemies to calm the hun-soul, and seizing-strike to immortalize the po-soul, with no substitution permitted.\n\nReverently emerge the **Red Heaven Three and Five Central Yellow Controller-of-Life Great General, Left General, and Right General of Nine Each**, the **Life-Determining Great General, Left General, and Right General of Nine Each**, the **Immortal-Determining Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s spleen, the Controller-of-Life pacifying the spirit, the Life-Determining calming the spirit, and the Immortal-Determining stabilizing the hundred spirits, with no violation permitted.\n\nReverently emerge the **Upper Immortal Capital’s Supreme Divine Illustrious Officials, Central Palace Executing-Malevolence Clerks**, the **Tiger-Rushing Warriors**, the **Breaking-Enemies Inspecting-Treachery Hook-Riding Archers**, the **Slaying-Evil Three Offices’ Capital Archers**, each numbering two hundred forty, to serve as guardians of your servant’s dwelling, seizing malevolent rebels, pursuing and capturing treacherous evils, all to be eradicated without omission.\n\nReverently emerge the **Upper Immortal Capital’s Supreme Divine Illustrious Officials, Central Palace Severing-Intercepting Capital Archers**, numbering two hundred forty each, to serve your servant in the four directions, attending and obeying commands, summoned to arrive instantly.\n\nReverently emerge the **Upper Immortal Capital’s Supreme Divine Illustrious Officials, Central Palace Riding-North-Dipper Absorbing-qi Feeding-qi Clerks**, the **Riding-Dipper Absorbing-Spirit Feeding-Spirit Clerks**, the **Riding-Stars Absorbing-Ghosts Feeding-Ghosts Clerks**, the **Riding-Jade-Mechanism Absorbing-Essence Feeding-Essence Clerks**, and the **Riding-Jade-Balance Absorbing-Evil Feeding-Evil Clerks**, each numbering one hundred twenty, to absorb and consume the world’s malevolent destinies, ghostly qi, essences, evils, and demonic afflictions for your servant.\n\nReverently emerge the **Supreme Divine Illustrious Officials, Central Palace Riding-Sun Three and Five Branch-Chariot Red-Tally Clerks**, and the **Riding-Moon Branch-Chariot Ghost-Capturing Envoys**, each numbering one hundred twenty myriad, to execute and eradicate malevolent rebels, pursue and capture essence-evil, with red tallies chasing and seizing, all to be annihilated.\n\nReverently emerge the **Supreme Divine Illustrious Officials, Central Palace Strong-Wind Riders Post-Horse Memorial-Submitting Clerks**, and the **Three and Five Eliminating-Death-Registers Determining-Life-Names Clerks**, each numbering ten myriad, to present memorials and submit petitions for your servant, swiftly transmitting them upward to eliminate death registers and inscribe life names in the Jade Calendar.\n\nReverently emerge the **Upper Immortal Capital’s Supreme Divine Illustrious Officials, Central Palace Central Yellow Nine Dao Determining-Will Clerks**, the **Determining-Intent Clerks**, the **Determining-Courage Clerks**, the **Determining-Wisdom Clerks**, the **Determining-Acuity Clerks**, the **Determining-Bravery Clerks**, and the **Warriors**, each numbering twelve myriad, to open and awaken your servant’s heart-spirit, penetrating the profound and subtle.\n\nReverently emerge the **Supreme Divine Illustrious Officials, Central Palace Six Yin Six Yang Body-Completing Clerks**, each numbering twelve myriad, to regulate yin and yang for your servant, prolonging life and preserving destiny, completing the body and uniting with the Dao, communicating with spirits and connecting with the perfected.\n\nReverently emerge the **Supreme Divine Illustrious Officials, Central Palace Eight Spirit Vajra Warriors, High-Chariot Direct-Affairs Envoys**, the **Red-Chariot Direct-Tally Envoys**, the **Branch-Chariot Inspecting-Capturing Envoys**, and the **Branch-Chariot Intercepting-Striking Warriors**, each numbering seven thousand two hundred, to pursue and strike malevolent rebels, slay and eradicate evil essences, diminish misfortune and exorcise calamities, and expel demonic thieves for your servant.\n\nReverently emerge the **Heavenly Illustrious Red Officials, Direct-Affairs Merit-Recorders**, the **Spirit-Registers Spirit-Capital Protectors, Prison-Capturing Great Clerks**, the **Evil-Capturing Envoys**, and the **Spirit-Direct-Tally Evil-Slaying Treachery-Stabbing Clerks**, each numbering two, along with one hundred twenty **Immortal Persons, Daoist Masters, and Jade Maidens**, the **Seven Body-Guarding Spirits**, fourteen **Unseparating-Body Generals and Clerks**, two **Illness-Treating Merit-Recorders and Body-Guarding Generals**, nine **Military-Affairs Clerks**, two **Bian Que Clerks and Heavenly Physicians**, all to execute authority, slay evil and destroy falsehood, repel death and invite life, assisting your servant’s body, ensuring responsive breath. Your servant, a humble reed of lowly quality, has fortunately encountered this millennial opportunity, prostrating to receive the precious register bestowed by the revered master, restraining the heart and cultivating the body to guard against excess—such grace is boundless.\n\nYour servant, having received the registers of the Upper Immortals and Supreme Spirits, along with their subordinate generals, merit-recorders, envoys, true officials, lords, generals, jade lads, jade maidens, soldiers, clerks, and troops, beseeches them to act according to their respective duties, transmit commands and convey truth, propagate the essentials of the Dao, establish merit to aid the state, practice transformation to save people, instruct the deluded and ignorant, and encourage the good and virtuous. Should any subordinate officials harbor malevolent qi or rebellious intent, or if there be ominous officials, slanderous tongues, or evil persons plotting to harm your servant, may the left and right officials and envoys immediately report to the Heavenly Offices without concealment. From year’s end to year’s end, from month’s end to month’s end, from day’s end to day’s end, from hour’s end to hour’s end, cycling without cease, may they act in accordance with the method, defending and protecting your servant’s body, delivering from calamities and hardships, ensuring longevity and enduring vision, with the heart-spirit settled and stable. Wherever your servant goes, may truth be embraced, and in all travels and destinations, may metal and stone open, water and fire assist. Beneath the covering of august heaven, upon the bearing of august earth, within the illumination of sun and moon, through the passage of mountains and rivers, may the hundred evils be subdued, the myriad spirits obey, the hundred passages flow with moisture, the five viscera generate fluids, true qi descend upon the body, refining form and transforming substance. When merit is accomplished and virtue complete, may your servant ascend to heaven in broad daylight, timely reporting merits without betraying trust.\n\nYour servant, a late and shallow learner, further burdened by foolishness and dimness, having perused the generals, clerks, soldiers, officials, generals, and troops, fears they may not conform to ritual propriety or align in proper order, accumulating a thousand transgressions and ten thousand errors. Humbly beseeches pardon and forgiveness, extending to those yet to awaken, that no punishment be meted. Your servant, with utmost reverence and trepidation, bows twice in prostration.",
      "overlap_context": "orm Concealing-Shadow Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper [ ] Great General, Left General, and Right General of Nine Each**, the **Dipper Seventh Star Great General, Left General, and Right General of Nine Each**, and the **Nine Departments’ Generals**, all to govern your servant’s right kidney, the Dipper [ ] generating form, the Dipper [ ] generating the lungs, and the Dipper Seventh Star generating the po-soul, with no disobedience permitted.",
      "start_char": 3847,
      "end_char": 5250,
      "start_sentence": 90,
      "end_sentence": 102,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.82697296142578,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上正一阅箓仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "毕，三咽炁。 次叩齿三通长跪祝曰 臣阅箓事讫，向所出上仙上灵功曹使者将军吏兵，悉还臣身中，从众妙门而入，依按次位，在左还左，在右还右，安隐金堂玉室，直使功曹主领检押，无令错互营卫，周匝缠绕，表裹弥纶，天地无有违越，须召又到，一如故事。 次复炉 香官使者，左右龙虎君，侍香诸灵官，令臣静室阅箓之所，自然生金液丹碧芝英百灵众真交会在此，香火炉前，所启上达径御太上玉皇尊帝御前。 三礼 次吟学仙颂 次出户咒 太上正一阅箓仪竟",
      "translated_text": "Upon completion, swallow qi three times.\n\nNext, knock the teeth three times in succession, then kneel lengthily and pray:\nYour servant has concluded the register’s perusal. May the transcendent immortals, celestial spirits, functionaries, envoys, generals, clerks, and soldiers just summoned all return into your servant’s body, entering through the Gate of Myriad Mysteries, resuming their respective positions—those on the left returning to the left, those on the right to the right—resting securely in the golden hall and jade chamber. Let the functionaries and envoys take charge of their oversight, ensuring no disorder in the protective encirclement, that it may enfold and envelop without breach, boundless as heaven and earth. When summoned again, may they arrive as before, in accordance with precedent.\n\nNext, address the incense burner:\nIncense officials and envoys, Lords of the Left and Right Dragon-Tiger, attendant spirit-officials of incense, may this place where your servant peruses the register in quietude naturally generate golden fluid, cinnabar, azure mushrooms, and the assembled host of a hundred numinous perfected, all converging here before the incense burner. May what is here proclaimed ascend directly to the presence of the Most High Jade Emperor, the August Thearch.\n\nBow three times.\n\nNext, chant the *Hymn to the Study of Immortality*.\n\nNext, exit the chamber and recite the spell:\nThe rite of the Orthodox Unity register-perusal is now complete.",
      "overlap_context": "ying trust.\n\nYour servant, a late and shallow learner, further burdened by foolishness and dimness, having perused the generals, clerks, soldiers, officials, generals, and troops, fears they may not conform to ritual propriety or align in proper order, accumulating a thousand transgressions and ten thousand errors. Humbly beseeches pardon and forgiveness, extending to those yet to awaken, that no punishment be meted. Your servant, with utmost reverence and trepidation, bows twice in prostration.",
      "start_char": 5250,
      "end_char": 5473,
      "start_sentence": 103,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.787826299667358,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上正一阅箓仪.txt",
        "category": "威仪类"
      }
    }
  ]
}