{
  "source_id": "太上洞真智慧上品大诫",
  "source_file": "chunked_daozang\\太上洞真智慧上品大诫.json",
  "total_chunks": 6,
  "total_original_chars": 7022,
  "total_translated_chars": 43474,
  "total_translation_time": 206.49087166786194,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞真智慧上品大诫.txt",
    "category": "戒律类"
  },
  "full_translation": "*The Supreme Cavern of Realized Wisdom’s Highest Precepts*\n**Sutra Title:** *The Supreme Cavern of Realized Wisdom’s Highest Precepts*\nComposed by an unknown author, approximately dated to the Eastern Jin dynasty. One of the ancient *Scriptures of Numinous Treasure* (*Lingbao Jing*). One scroll.\n\nIn the first year of the Kaihuang era, on the first day of the seventh month at the hour of noon, the Celestial Worthy of Primordial Beginning bestowed upon the Most High Lord of the Dao the *Highest Precepts of Realized Wisdom* within the Long Mulberry Grove of the Floating Mountain of Yucha in the Western Land of Yuna. At that moment, the Lord of the Dao, having received the precepts, prostrated himself facing north, his entire body touching the earth, his heart turning toward the ten directions before returning to bow toward the east.\n\nThe Celestial Worthy addressed the Most High Lord of the Dao, saying: \"Today I shall proclaim the Dharma-sound, awakening those born in drought, delivering all men and women from calamity and affliction, entreating blessings and liberating lives, and uprooting the roots of all suffering. Let the living behold the Dao, their bodies freed from the eight difficulties; let the dead rejoice, feasting in the heavens, soon reborn among men as Wheel-Turning Sage Kings. Those who fast and seek the Dao must single-mindedly receive and uphold these ten precepts, earnestly accepting them without forgetfulness, contemplating them in silent focus, and reflecting upon the spontaneous. Let no stray thoughts disturb body and spirit. Those who can do so shall listen in stillness.\"\n\nThe Celestial Worthy declared:\n1. **The First Precept:** Let the heart harbor no malice or envy. Give rise to no yin thieves. Guard the mouth and be cautious of transgressions. Let thoughts dwell in the Dharma.\n2. **The Second Precept:** Uphold benevolence and refrain from killing. Pity and succor all beings. Let compassion and love extend broadly to rescue all.\n3. **The Third Precept:** Maintain chastity and yield to others. Neither lust nor steal. Constantly cultivate good thoughts, diminishing the self to aid others.\n4. **The Fourth Precept:** Neither indulge in sensuality nor desire. Let the heart be free from dissipation. Uphold purity and caution, ensuring conduct remains unstained.\n5. **The Fifth Precept:** Let the mouth utter no evil words. Speech should not be ornate or deceitful. Be upright within and without, committing no transgressions of the mouth.\n6. **The Sixth Precept:** Reduce wine and regulate conduct. Harmonize qi and temperament. Let the spirit remain unharmed, avoiding all evils.\n7. **The Seventh Precept:** Do not envy those who surpass you or contend for fame and merit. In all matters, yield and withdraw, delivering others.\n8. **The Eighth Precept:** Do not criticize or slander scriptures and sacred texts. Receive the Dharma with your whole heart, ever as though facing the divine.\n9. **The Ninth Precept:** Do not engage in quarrels or disputes, nor judge the four classes of beings. Let neither gods nor men bear resentment, nor harm the spirit and qi.\n10. **The Tenth Precept:** In all actions and deeds, maintain equanimity and single-mindedness. Let harmony prevail among people and reverence among spirits, ever thus in conduct.\n\nThe Celestial Worthy said: \"Those who cultivate and uphold these precepts align with the heart of Heaven. Constantly practice great compassion, vowing to act for the sake of all, universally delivering the world from peril. Be humble and reverent toward the teachings, never growing lax. Better to die upholding goodness than to live in evil. Through unwavering devotion, one may be delivered from the five destinies, avoid the three evils, be protected by all heavens, and revered by the myriad spirits. Through fasting and upholding the precepts, one naturally attains liberation in this world.\"\n\nThe Most High Lord of the Dao, overcome with joy and awe, bowed his head in reverence and received the command.\n\nThe Celestial Worthy said: \"For those who study, fast, and practice the Dao, delivering gods and humans and performing all virtuous deeds, there are twelve principles to follow in order to attain liberation in this world. You should adhere to them, thereby attaining true perfection and ultimately entering the realm of non-action, with all aspirations fulfilled.\n\n1. Upon encountering true scriptures that reveal the Dharma and deliver all beings, one should awaken the Dao-mind, vowing that in future lives one may ascend to great sageliness.\n2. Constantly practice a heart of compassion, vowing that all beings may universally hear and see, with deliverance extending broadly and without obstruction.\n3. Delight in the scriptural teachings, deeply and extensively studying them. Let the will be firm and bright, awakening the ignorant and benighted.\n4. Reverently receive the master’s instructions, broadly exhorting and transforming others, guiding them into the Dharma-enclosure and far from blind paths.\n5. Trust in and turn toward the mysterious and wondrous, reverently upholding the scriptural instructions. Recite and study them morning and evening without weariness.\n6. Do not pursue glory and splendor, severing worldly entanglements. Focus the mind and stabilize the will, directing all endeavors toward the Dharma.\n7. Diligently recite the great scriptures, vowing for the sake of all beings to broadly establish bridges, creating karmic conditions for future lives.\n8. Constantly generate good thoughts, neither deviating nor deceiving, harboring no envy, harm, malice, or jealousy.\n9. Wherever one is reborn, may one always encounter a sagely age, continuously encountering the teachings of the *Numinous Treasure* without interruption.\n10. Purify the body and uphold the precepts. Fast and establish merit, broadly rescuing all beings, universally delivering them.\n11. Extensively study and broadly proclaim the profound Dharma, preparing for the inclusion of gods and humans, universally delivering all.\n12. Always encounter enlightened masters, lifetime after lifetime, receiving their teachings and proclaiming the Dharma, delivering countless beings. Through all good thoughts, one attains the true Dao.\"\n\nThe Celestial Worthy said: \"The method of cultivation for scholars lies in practicing these twelve principles. Those who single-mindedly cultivate these good thoughts will, lifetime after lifetime, behold the sacred texts and form karmic bonds with the Dao. Their celestial acquaintances will be many, and they will alone transcend the three realms, free from all entanglements, forever departing from the three evils, the five destinies, and the eight difficulties. Revered and protected by the myriad spirits, surrounded by earthly deities, their households will be pure and solemn, untouched by the ten thousand calamities. Truly, one may attain the Dao while seated in repose. Diligently study and recite, broadly proclaiming to fellow learners, that all may single-mindedly enter the Dharma-gate together.\"\n\nThe Celestial Worthy said: \"The Dao is revered, the Dharma is wondrous, and the human body is also precious.\"\n\nThus the Dao unfolds the Dharma, bequeathing precept-scriptures to deliver the human body. Once the human body is delivered, it ascends to merge with the Dao. One should therefore cultivate purity in conduct, uphold fasting and observe the precepts, pacify the mind in stillness, and keep aspirations clear. Single-mindedly turn toward the Dao, maintain undivided focus, purify the six repositories, refrain from indulging beyond moderation, and keep inner and outer realms empty and serene, ever in accord with the natural. On the days of fasting, hold incense and make vows, so that one’s sincerity ascends to the heavens. The four heavenly patrol-lords and the ten divisions of mighty spirits will descend to walk the earth, observing and listening to the purest sounds, mirroring the clarity of your heart. Those who uphold the precepts and practice the Dao will have their merits recorded in the heavens, and karmic retribution will swiftly manifest. The Dao does not fail those who diligently practice and sincerely receive; do not let demonic words deceive you.\n\nThe Celestial Worthy said: \"If good men and good women awaken the natural intention for the Dao, enter the Dharma-gate, receive my Ten Precepts, and practice the Twelve Permissible Observances, they shall be called pure and faithful disciples of the Great Dao, their merits equal to those of the valiant Flying Celestials. The Flying Celestials are those who have not yet attained the Dao; they are the tenfold-transformed disciples of the Great Dao, soaring through the empty sky as charioteers for the various heavens. Pure and faithful disciples, while still in the world, may be freed from sorrow and delivered from all suffering. Their bodies enter radiant light, their forms become inwardly pure and upright, and they summon ghosts and command spirits, subduing demonic forces. After ten transformations, they ascend to become Flying Celestials. If, in even a single transformation, they practice with diligence, their hearts unwavering and unrelenting, performing all manner of meritorious deeds, maintaining long fasts and austerities, tireless from dawn to dusk, they shall attain the rank of Flying Celestial. From there, they advance further, transcending the three realms to become Perfected Ones of the Upper Clarity.\n\nThe Celestial Worthy said: \"Those who receive my Ten Precepts and practice the Twelve Permissible Observances should bow their heads and declare: 'As pure and faithful disciples, from this day forth we receive the precepts, single-mindedly upholding them, never daring to disbelieve, surrendering our lives to the ten directions.' Those who can do so will see their households flourish in this life, enjoying health and strength. Earthly deities will attend and protect them, the lords of the three realms will welcome them, and the souls of their seven ancestors will ascend to the Southern Palace, clothed and fed by the celestial kitchens. Soon they will be reborn, returning to the gates of human kings, their connection to the Dao unbroken across lifetimes.\"\n\nThe Celestial Worthy said: \"When establishing fasts and practicing the Dao, the Four Heavenly Kings will ride upon flying cloud-cakes and eight-scene jade chariots, attended by Perfected Ones and jade maidens, their hands holding flowered banners. Phoenix songs lead the way, celestial music follows, with white cranes and lions chanting in harmony. They burn incense and scatter flowers, descending through the void to gaze upon the practice of the Dao and listen to the Dharma-sounds. The Heavenly Kings descend, and the myriad spirits pay homage. How could one not fully uphold this Dharma? First receive the Ten Precepts, then practice the Dao. Move with refined grace, still the mind and close the senses. Whether sitting, rising, lying down, or resting, never depart from proper conduct. The Heavenly Kings will rejoice, and your name will be recorded in the Upper Clarity. Truly, the attainment of the Dao lies within the space of a square inch.\"\n\n**The Six Precepts of the Upper Grade for Closing the Passions and Cultivating Wisdom**\n\nThe first precept: Let the eyes not wander in broad gazing, lest they be distracted by the profusion of colors, harming the pupils and dimming the light, so that clarity is lost.\n\nThe second precept: Let the ears not indulge in chaotic listening, lest they be confused by the five tones, injuring the spirit and corrupting rectitude, drawn to evil sounds and mournful cries.\n\nThe third precept: Let the nose not seek out broad scents, lest it be tainted by impure qi and foul odors, leading to turbidity and a form that is not pure and upright.\n\nThe fourth precept: Let the mouth not crave flavors, especially those rich and greasy, lest they pollute the five spirits and cause the organs to fester and decay.\n\nThe fifth precept: Let the hands not commit evil, nor steal the belongings of others, nor covet profit for oneself, lest misfortune arise unawares.\n\nThe sixth precept: Let the heart not be swayed by desire, lest it agitate the five spirits, harming essence and scattering qi, leaving the body lost and confused.\n\nThe Celestial Worthy said: \"These Six Precepts are the great afflictions of the body. Those who, in future lives, are born as men or women, though they receive human form, will have impure six senses. They will not have seen the scriptures or heard the Dharma-sounds, their forms unaware of themselves, sunk in the gates of sin, their lives cut short, failing to complete their heavenly years. They will long abide in evil destinies—how pitiful they are! Therefore, these precepts are expounded to deliver humans and gods. With a good heart, turn in faith, single-mindedly surrendering your life, revering and upholding the sacred teachings, closing the gates of evil. Then your form will enter the empty void, and you will attain the six penetrations of wisdom.\"\n\nThe six penetrations of wisdom are: penetrating vision, penetrating hearing, penetrating emptiness, penetrating voidness, penetrating clarity, and penetrating subtlety. These are the six penetrations, through which nothing is not penetrated. When the six senses are tranquil, the spirit naturally returns; unity naturally arises; essence naturally stabilizes; and life becomes long and enduring, never to die.\n\n**The Six Great Precepts of the Upper Grade for Delivering Beings Through Wisdom**\n\nThe first: When you see someone in dire distress, deliver them from mortal peril. If you encounter the wise and enlightened in the world, you will be able to restrain the violent and rebellious. Your life will be long and enduring, and your worldly blessings boundless.\n\nThe second: When you see someone impoverished and destitute, suffering from hunger and cold, diminish your own body to bestow alms, bringing them wealth and nobility. The karmic reward will be ten thousandfold, and you will rejoice across lifetimes.\n\nThe third: When creatures of blood and breath, in their distress, turn to humans for refuge, be able to deliver and save them from mortal peril. In this life, you will enjoy health and strength, free from sudden misfortune.\n\nThe fourth: Bestow kindness upon birds and beasts, all living beings. Cut from your own mouth to feed them, sparing nothing. Across lifetimes, you will be sated and content, ever dwelling in blessed lands.\n\nThe fifth: Deliver all senseless creatures, all sentient beings, ensuring their completion without premature harm. In this life, you will flourish, untouched by manifold misfortunes.\n\nThe sixth: Always practice a heart of compassion, taking pity and delivering all beings, releasing life and saving from peril. The merit of this is profound. In this life, it will enable you to turn danger into safety, sickness into health, poverty into wealth, and all your aspirations will follow your heart.\n\nThe Celestial Worthy said: \"These Six Precepts all arise from the heart’s penetration of wisdom. By bestowing virtue and acting in accord with the natural, blessings will constantly reside in your body, and misfortune will forever depart from your gate.\"\n\nThose who indulge in worldly pleasures without cease will, lifetime after lifetime, reap the karmic consequences. Yet with a single turn of merit, their deeds align with the Flying Celestials, transcending the Nine Revolutions of the Wheel. Gradually, they enter the Great Dao. Disciples who achieve the Ten Revolutions have their names inscribed in the heavens. Their seven generations of ancestors ascend together, reborn in celestial realms, where they are clothed and fed by the blessings of virtue. Even in the human realm, they become Wheel-Turning Divine Kings, ever dwelling in the gates of fortune.\n\n**The Ten Wholesome Exhortations to Assist the Supreme Precepts**\n\nThe first: Exhort and assist in revering the Three Treasures and making offerings to Dharma masters. This enables one to be reborn in the world as a noble person—virtuous, filial, and of lofty talent—honored and exalted, revered by all, with a flourishing clan.\n\nThe second: Exhort and assist in copying scriptures. This ensures that one is reborn lifetime after lifetime with keen intelligence, vast learning, and profound understanding, ever encountering sagely eras and able to recite the teachings and their verses.\n\nThe third: Exhort and assist in establishing fasting halls and tranquil abodes. This ensures that one’s family is reborn lifetime after lifetime in nobility, ascending to celestial realms where food and sustenance arise naturally, ever dwelling in non-action.\n\nThe fourth: Exhort and assist in providing incense and oil to those in need. This ensures that one is reborn lifetime after lifetime with fragrant purity, radiant brilliance, and an appearance of surpassing beauty, endowed with celestial grace and lofty refinement.\n\nThe fifth: Exhort and assist in providing Dharma robes for Dharma masters. This ensures that one is reborn lifetime after lifetime with enduring elegance, freely dwelling in the Central Kingdom, never falling among borderland barbarians, with sons and daughters of upright bearing, adorned with crowns, jade, and pendants.\n\nThe sixth: Exhort and assist kings, parents, and the people in loyalty and filial piety. This ensures that one is reborn lifetime after lifetime with many descendants—sons and daughters of wisdom and virtue—spared from all suffering.\n\nThe seventh: Exhort and assist in fasting, tranquility, and scripture recitation. This ensures that one is never reborn in hell but ascends directly to celestial realms, where they pay homage to the multitude of sages. Swiftly, they regain their form, transforming and being reborn in royal households, their every desire fulfilled, their adornments and possessions complete. Their seven generations of ancestors rejoice together, all karmic affinities harmoniously met. From beginning to end, they abide in glory and joy. As the Dharma Wheel turns, they attain the immortal Dao.\n\nThe eighth: Exhort and assist Daoists and the people in scriptural study. This ensures that one is reborn lifetime after lifetime with penetrating wisdom and insight, their every movement and stillness imbued with dignity, ever serving as a teacher to others.\n\nThe ninth: Exhort and assist all in almsgiving and admonition. This ensures that one is reborn lifetime after lifetime with long life, wealth, and joy, ever free from resentment and sorrow.\n\nThe tenth: Exhort and assist all people in relinquishing jealousy and desire, practicing the myriad virtues. This ensures that one is reborn lifetime after lifetime in peace and happiness, free from calamity and disorder. The sick recover, officials ascend in rank, and all look up to them with reverence. None fail to receive blessings. Their households are pure and noble, cherished by celestials and humans, revered by spirits and demons, ever dwelling in lands of fortune.\n\nThe Celestial Worthy said: \"These Ten Wholesome Exhortations can only be practiced by disciples of the Great Dao who have achieved the Ten Revolutions. Those who can practice them will have deeds equal to the Flying Celestials, their hearts in harmony with the Six Penetrations of wisdom, merging with the emptiness of the void. After death, they will all soar through the clouds, with the multitude of sages guiding their chariots as they roam the ten directions. From this, they will never slacken, attaining the rank of Immortal Kings. Their seven generations of ancestors will depart the dark night, ascending to the Southern Palace, where they are clothed and fed by celestial kitchens, receiving blessings naturally. This Dharma is lofty and wondrous, delivering countless beings. Its vast transformation is beyond measure.\"\n\nThe Celestial Worthy said: \"The Six Penetrations of wisdom are as follows: Heaven is called *Dongshi* (Penetrating Sight), Earth is called *Dongting* (Penetrating Hearing), the East is called *Dongkong* (Penetrating Emptiness), the West is called *Dongxu* (Penetrating Void), the South is called *Dongqing* (Penetrating Purity), and the North is called *Dongwei* (Penetrating Subtlety). The Six Penetrations pervade the boundless, without limit or end, unfathomable and inexhaustible, encompassing all, containing all. Those who possess the *qi* of the Six Awarenesses constantly connect with the Six Wisdoms. When human perception attains the Six Penetrations, the Six Awarenesses become luminous. Mastering the Six Emotions, one naturally discards all evil roots and generates wholesome thoughts. When the heart embodies the Six Wisdoms, one attains the immortal Dao.\"\n\nThe Celestial Worthy said: \"The foundation of the Dao is this: to deliver beings from the Ten Sufferings and Eight Adversities, one must receive the Great Precepts, cultivate fasting, establish virtue, and perform wholesome deeds, so as to be praised by the Three Realms and observed by all celestials. Thus, none will fail to be delivered, and the Dao will be perfected. Without receiving the Great Precepts, merely practicing prolonged fasting, abstaining from grains, or retreating to the mountains—seeking deliverance in the flesh without the practice of the Six Penetrations of wisdom—will only waste one’s efforts, with no hope of accomplishment. Good men and good women of sincere hearts, diligently seek and earnestly receive them. Now that this scripture is expounded, may its teachings widely deliver all, so that the Dharma’s voice is universally heard in the ten directions.\"\n\nThe Celestial Worthy said: \"Heaven is *Dongshi* (Penetrating Sight), its wisdom the Heavenly Eye, its insight boundless. From above and below, the four directions and eight quarters, nothing is unseen, nothing is unclear. Though called a single Penetration of wisdom, it encompasses the Five Colors. Heaven’s penetration is natural, thus undamaged. Humans emulate Heaven: the red pupil of the eye also possesses the light of the Five Colors. If one does not uphold the precepts, the *qi* of the Six Awarenesses will not flow through the human apertures, and wisdom will not unfold. Gazing widely at the Five Colors causes the eye’s pupil to scatter, its light to dim and become obscured, leading to blindness. Therefore, these precepts are expounded to deliver celestials and humans, so that all men and women may hear the Dharma’s voice. To attain deliverance and longevity, one must uphold these precepts and practice them diligently, never forgetting. Guard against excessive indulgence in sensory desires, restrain the wandering gaze, and master oneself. Cherish and nurture the eye’s pupil, contemplate the true and still, allowing wisdom to penetrate. With penetrating vision of the void and self-mastery through the precepts, the Five Colors will return to the body. When the Five Colors naturally return, there will be no damage. Preserve your years and life, and they may become boundless.\"\n\nThe Celestial Worthy said: \"Earth is *Dongting* (Penetrating Hearing), its wisdom far-reaching. Thus, its resonance responds to Heaven above and pervades the four directions below, nothing unheard, nothing unperceived. Though called a single Penetration of wisdom, it encompasses the Five Sounds. Earth’s penetration is natural, giving rise to the Five Sounds, stable and unmoving, thus undamaged.\"\n\nJust as humans resemble Earth, within the ear dwell the spirits of the Five Sounds. If one does not uphold the precepts, wisdom remains obstructed, and one must not recklessly heed the sounds of the Five Tones. The Five Tones cause the Five Spirits to scatter and soar, leaving the ear hollow and desolate, resounding with sorrowful wails. The Five Spirits weep, leading to deafness. Thus, these precepts are expounded to deliver celestial beings, that all men and women may universally hear the Dharma’s resonance. To attain longevity, one must uphold the Great Precepts, restraining the ear’s spirit—refraining from excessive listening to unlawful sounds, and instead serenely heeding the wondrous scriptures and divine chapters of the Perfected. This allows wisdom to penetrate, resonating through the Great Void. By upholding the precepts to master oneself, the Five Sounds return to the body. When the Five Sounds naturally return, the ear remains free of harmful noises. Preserve your years and life, and they may endure boundlessly.\n\nThe Celestial Worthy said: \"The East is *Dongkong* (Penetrating Void), the qi of Primordial Yang. Qi emerges from the Void, its wisdom luminous and its insight vast, thus called *Dongkong*. Its penetration is boundless, unfathomable. The qi of nascent green, though termed a single Penetration of wisdom, encompasses the Five Qi. The Void admits all, thus it suffers no damage. Though humans possess form, form too follows the Void. The nose harbors *Huangning*, the spirit that repels impurity. If one does not uphold the precepts, wisdom remains obstructed. Without entering wisdom, one must not indiscriminately consume foul and rank substances. The qi of foulness and rankness congests the nose’s spirit, causing the meridian’s source to risk severance, obstructing the *Mingliang* (Luminous Bridge). Thus, these precepts are expounded to deliver celestial beings, that all men and women may hear the Dharma’s resonance. To transcend the Eight Difficulties and myriad sufferings, one must receive these precepts, restraining the nose’s spirit—refraining from excessive intake of foulness, purifying the *Mingliang*, guiding and conducting the qi of life, illuminating wisdom. When qi penetrates the Void, and the precepts master the self, the manifold qi return to the body. When the qi naturally return, merging with the primordial qi, one preserves life and form, forever free from harm.\"\n\nThe Celestial Worthy said: \"The West is *Dongxu* (Penetrating Emptiness), the qi of Lesser Yang. Qi emerges from Emptiness, its wisdom subtle and its insight radiant, thus called *Dongxu*. Its emptiness is unimpeded, its penetration vast and unfathomable. The qi of Lesser Yin, though termed a single Penetration of wisdom, encompasses the Five Flavors. Emptiness admits all, contains all. Though humans follow Emptiness, if the body does not uphold the precepts, wisdom remains obstructed. Without wisdom’s entry, the Five Flavors become afflictions. Craving rich and greasy foods disturbs the Five Spirits, leading to collapse and exhaustion, shortening one’s years and life. Thus, these precepts are expounded to deliver celestial beings, that all men and women may universally hear the Dharma’s resonance. To attain long life, one must uphold the Great Precepts, restraining the Five Spirits—guarding against greed for the Five Flavors, moderating rich and greasy indulgences, purifying the Five Viscera, keeping them cool and clear. When the body possesses wisdom, the Five Flavors harmonize as fragrance, inner and outer tranquility prevail, and life remains unharmed.\"\n\nThe Celestial Worthy said: \"The South is *Dongqing* (Penetrating Clarity), the qi of Greater Yang. Qi emerges from Clarity, its wisdom pure and its insight lucid, opening the gates to penetrate clarity. Thus, the South harbors the Crimson Emperor’s *Dongyang* (Penetrating Yang) Court, where the myriad things are smelted and refined to brilliance. If one does not uphold the precepts, wisdom remains obstructed. Without wisdom’s flow, the heart’s spirit trembles, giving rise to craving and desire, leading to delusion and dissipation, harming the spirit and shortening life, preventing longevity. Thus, these precepts are expounded to deliver celestial beings, that all men and women may universally hear the Dharma’s resonance. To attain long life and transcend all afflictions, one must receive these precepts, restraining the heart’s spirit—dispelling passions, relinquishing desires, forsaking the dust to enter Clarity. When wisdom illuminates, the Six Perceptions open their passages, the body enters *Dongqing*, merging with the qi of nature. Preserve your years and life, and they may endure eternally.\"\n\nThe Celestial Worthy said: \"The North is *Dongwei* (Penetrating Subtlety), born of the Mysterious. Its wisdom is far-reaching, its insight profound, subtle yet penetrating the Real. It discerns the dark and light of sin and fortune, presiding over the origin of life. The hands emulate the Four Seasons, corresponding above to the Celestial Gate. As the Celestial Gate eternally turns, so too do the hands move. The hands possess a great spirit, receiving life and filling the directions, governing the Four Great Elements of humanity, observing human success and failure. If one does not uphold the precepts, wisdom remains obstructed. Without wisdom’s flow, the heart is agitated, and myriad evils arise. The hands act unconsciously, indulging in greed and theft, leading to a shortened life, failing to complete Heaven’s allotted years. Thus, these precepts are expounded to deliver celestial beings. To attain long life and transcend evil roots, one must receive these precepts, restraining the hands’ spirit. When wisdom illuminates, the heart naturally opens in clarity. The hands refrain from theft, evil roots do not arise, aligning with Heaven and following qi. The body enters nature, preserving your life to endure eternally.\"\n\n**Precepts of Wisdom, Virtue, and Retribution (Upper Grade)**\n\nThe Precepts state: Offerings and alms to the Three Treasures and divine scriptures—even a single coin—shall be repaid seventy-four myriadfold. Ten thousand coins or more bring boundless reward. One’s name is recorded among the heavens, the body ascends as a Ten-Times-Transmitted Disciple of the Most High, and the seven ancestors rise to become honored guests of the heavens.\n\nThe Precepts state: Offerings to Dharma Masters, Dharma robes, copying scriptures, and establishing quiet retreats—even a single coin—shall be repaid thirty-two myriadfold. Ten thousand coins or more bring boundless reward.\n\n**Generation after generation, they shall be wise and bright, ever encountering enlightened masters, born into noble houses, and their seven ancestors shall all become honored guests of the Most High.**\n\nThe Precepts state: Offerings of incense, oil, vegetarian meals, and alms to Dharma Masters and Daoist priests—even a single coin—shall be repaid twenty-four myriadfold. The greater the merit, the weightier the reward. **Generation after generation, they shall abound in wealth, never suffering want, and their seven ancestors shall rejoice in peace, ever feasting from the heavenly kitchens.**\n\nThe Precepts state: Offerings to mountain-dwelling Daoist priests—even a single coin—shall be repaid twelve myriadfold. The greater the merit, the weightier the reward. **Generation after generation, they shall ever encounter sagely masters, behold the teachings of the Dao and its laws, and their seven ancestors shall all become companions of the Five Emperors.**\n\nThe Precepts state: Offerings of incense, candles, vegetarian meals, and alms to devout disciples—even a single coin—shall be repaid thirty-two thousandfold. **Generation after generation, they shall know joy, encounter no suffering, and their seven ancestors shall ascend to the heavenly halls, carefree and unbound, ever dwelling in blessings.**\n\nThe Precepts state: Donations of wealth to construct or repair abbeys and temples—even a single coin—shall be repaid twenty-four thousandfold. The greater the merit, the greater the reward. **Generation after generation, they shall be wise and virtuous, their pleasures unending, and their seven ancestors shall all enter the Realm of Primordial Joy.**\n\nThe Precepts state: Alms to the destitute among heavenly beings and mortals—even a single coin—shall be repaid twelve thousandfold. The greater the merit, the greater the reward. **Generation after generation, they shall be rich and noble, their joy boundless, and their seven ancestors shall all receive sustenance from the four directions’ heavenly kitchens, their clothing and food naturally provided.**\n\nThe Precepts state: Offerings to all beings, sacrificing one’s own provisions to feed others—even a single coin—shall be repaid six thousand two hundredfold. **Generation after generation, their descendants shall flourish, their households prosper, and their seven ancestors shall escape the hells, ascending into the blessings of the natural realm.**\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: \"The Precepts of Wisdom and the Upper Grade of Merit and Virtue—when men and women of heaven and earth awaken the natural intent of the Dao, sacrifice their own resources, and expand the fields of blessings, their merit is most weighty. The merit of a single offering brings a reward of ten thousandfold. The principle of karmic retribution is as clear as the sun and moon, whether manifest in this life or the next. Yet the timing of blessings may vary, and they need not arrive simultaneously. Some may calculate merit to offset transgressions, or use virtue to redeem sins, or liberate their ancestors from punishments—such retributions may not be immediately apparent. The Three Officials and Nine Bureaus record the merits and transgressions of all, with not even the smallest fraction lost. Though one’s sins may have been erased and no further transgressions committed, if later merits remain unmanifested, they may appear no different from the ordinary. This arises from the constraints of one’s birth destiny, awaiting the heavens’ deliverance before blessings unfold. Even so, the souls of the seven ancestors shall have already ascended to the heavenly halls, and the convergence of blessings thereafter shall be without error. Clearly proclaim this to men and women, that they may know karmic retribution is no empty truth. With sincere faith and diligent practice, unwavering in effort, they shall attain deliverance and receive boundless blessings.\"\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: \"All the sagely beings of the heavens, the perfected and great divinities, the heavenly kings, and the countless past multitudes who attained the Dao—none failed to do so through almsgiving, spreading virtue, and performing myriad good deeds. When merit is fulfilled and virtue complete, good retribution follows, ceaseless in its turning. All shall become perfected beings of the Dao, transcending the Three Realms, carefree in the Great Canopy of the Upper Clarity and the Heaven of Great Network, amidst the Seven Jeweled Forests of the Jade Capital and Mystic Terrace. Then shall they know that no act of merit is ever lost, their joy natural and measureless, their blessings infinite for all generations. Yet in this degenerate age, human nature is stingy and greedy, knowing only how to hoard, burdening themselves with wealth, unable to awaken the heart to perform such meritorious deeds. Without accumulated merit, defilements and transgressions grow daily, and the halls of eternal blessings sink into the gates of sin. They shall revolve endlessly through the Five Paths and Eight Difficulties. Once the blessed realm is lost, there shall be no return. Men and women shall drag one another along, unaware of their past lives’ origins, and the sight of their souls shall be most pitiable. Now, for the sake of all heavens, I proclaim these prohibitions and precepts, that all men and women may universally hear the Dharma’s sound, be delivered from the multitudes, and enter into blessings.\"\n\nThe Heavenly Worthy said: \"I have surveyed the hells beneath the heavens and earth, where the souls of men and women toil in dark prisons—none were not those who, in past lives, either failed to encounter these luminous precepts, or having encountered them, did not practice them, or practiced them without devotion, later regretting and returning to the gates of sin. Some were born into evil, never meeting good conditions, or unaware of almsgiving, never awakening the heart to establish merit, broadly cultivate fields of blessings, and uproot karmic roots. Knowing only how to commit transgressions, they drift through the Three Wretched Paths and Eight Difficulties. Pitying their ignorance, I grieve for them. Thus, I proclaim these precepts to deliver the heavenly and mortal realms, that all men and women may universally hear the Dharma’s sound, awaken the heart of the Dao, establish good deeds, uproot all suffering, and form affinities with the Dao. All shall know joy and peace, carefree and natural.\"\n\nThe Most High Lord of the Dao received the precepts from the Primordial Heavenly Worthy, delivering them to all heavens, the four directions, and borderlands. When the merit was accomplished, they were transmitted to the Heavenly Kings of all heavens, the Great Sages of the Ten Directions, the Celestial Lord of the Grand Tenuity, the Perfected of the Four Poles, the Great Divinities of the Eastern Florescence Palace, the Jade Maidens and hosts of immortals, that all might propagate them and save future generations, allowing them to hear the Dharma’s sound. At that time, all the heavens rejoiced, saying, \"Excellent! Excellent!\"\n\n**The Upper Grade Precepts of Wisdom from the Most High Cavern of Mystery and Numinous Treasure thus concludes.**\n\n**The Upper Grade Precepts of Wisdom from the Most High Cavern of Mystery and Numinous Treasure**\n\n---\n\n**Precept Three:**\nDo not covet wealth or property, nor hoard goods for personal gain. Do not seize what others cherish, nor take by force what is not yours. Do not scheme to acquire what belongs to others, nor envy those who possess more. Do not obstruct the flow of generosity, nor hinder the circulation of blessings. Do not refuse to yield or defer to others, nor withhold aid from those in need. Do not indulge in excessive drink, nor allow intoxication to cloud the mind. Do not engage in frivolous disputes or contentious speech, nor provoke strife with harsh words. Do not harbor resentment or bear grudges, nor allow anger to fester within. Do not cling to past grievances, nor seek vengeance for old wrongs. Do not deceive or mislead others, nor distort truth with falsehood. Do not slander the virtuous, nor praise the wicked. Do not associate with the unprincipled, nor befriend those who lack integrity. Do not abandon the Way for worldly gain, nor forsake the Dao for fleeting pleasures. Do not pursue fame or status, nor crave admiration from others. Do not boast of your virtues, nor flaunt your achievements. Do not seek to outshine others, nor strive to surpass all in glory. Do not neglect the cultivation of the Dao, nor abandon the practice of virtue. Do not fail to honor the Perfected, nor disregard the teachings of the sages. Do not sit improperly, nor recline in a slovenly manner. Do not neglect proper attire, nor appear disheveled before others. Do not speak carelessly, nor utter words that sow discord. Do not indulge in idle chatter, nor engage in gossip or slander. Do not listen to lewd or vulgar speech, nor delight in obscene songs. Do not gaze upon improper sights, nor let your eyes wander licentiously. Do not dwell in impure places, nor frequent unwholesome environments. Do not associate with those who defile the Dao, nor consort with the wicked. Do not allow your heart to be swayed by external temptations, nor let your mind be disturbed by worldly affairs. Do not neglect the recitation of scriptures, nor fail to meditate upon the Dao. Do not abandon the practice of stillness, nor forsake the cultivation of emptiness. Do not cling to sensory pleasures, nor indulge in excessive desires. Do not allow your thoughts to scatter, nor let your spirit dissipate. Do not neglect the refinement of qi, nor fail to harmonize the Three Treasures. Do not disrupt the natural order, nor obstruct the flow of the Dao. Do not harm living beings, nor take life without cause. Do not steal or misappropriate, nor covet what is not yours. Do not engage in sexual misconduct, nor indulge in lustful thoughts. Do not speak falsely, nor deceive with cunning words. Do not consume intoxicants, nor cloud your mind with substances. Do not be stingy or withhold generosity, nor refuse to share with those in need. Do not hoard wealth, nor cling to material possessions. Do not neglect filial piety, nor fail to honor your parents. Do not abandon your teachers, nor forget the debt of gratitude. Do not betray your friends, nor sever bonds of trust. Do not neglect the suffering of others, nor turn away from those in distress. Do not fail to repay kindness, nor forget the favors you have received. Do not accumulate wealth without purpose, nor squander it recklessly. Do not lose the Way through negligence, nor stray from the path of virtue. Do not forget the teachings of the sages, nor abandon the precepts of the Dao. Do not allow your heart to be swayed by external phenomena, nor let your spirit be bound by worldly attachments. Do not neglect the cultivation of wisdom, nor fail to refine your inner power. Do not allow your mind to be scattered, nor let your thoughts wander aimlessly. Do not indulge in excessive sleep, nor waste time in idleness. Do not neglect the practice of stillness, nor abandon the cultivation of clarity. Do not allow your qi to stagnate, nor let your spirit grow sluggish. Do not harm the natural world, nor disrupt the balance of Heaven and Earth. Do not pollute the rivers and mountains, nor defile the sacred lands. Do not kill or harm animals without cause, nor destroy the homes of living beings. Do not uproot plants or trees without purpose, nor cut down forests recklessly. Do not neglect the suffering of all beings, nor turn away from their cries for help. Do not fail to practice compassion, nor withhold kindness from any creature. Do not allow your heart to harden, nor let your spirit grow cold. Do not neglect the recitation of sacred texts, nor fail to honor the Perfected Ones. Do not abandon the practice of virtue, nor forsake the path of the Dao.\n\nIf you uphold these precepts with sincerity, your eyes will be bright and clear, your ears sharp and keen. Your mouth will savor the sweetness of the Dao, and your nose will detect the fragrance of virtue. Your body will be light and agile, and your spirit will soar freely. Your wisdom will spread far and wide, and your name will resound throughout the heavens. The gods and immortals will rejoice, and the flying transcendents will descend to welcome you. The divine kings will protect you, and the sages will guide your steps. Your parents and ancestors, spanning six thousand generations, will ascend to the heavens, and your seven generations of forebears will be liberated from suffering. Your wisdom will illuminate the darkest realms, and your virtue will transform all beings. You will repay the kindness of Heaven and Earth, and fulfill the debt of gratitude to your teachers. You will accumulate no ill repute, nor stumble on the path of the Dao. You will ascend to the ranks of the Perfected, and join the assembly of the immortals. The myriad gods will bow before you, and the Three Clarities will bestow their blessings. Your name will be inscribed in the registers of the heavens, and your merit will endure for eternity.\n\n**The Upper Grade Precepts of Wisdom from the Most High Cavern of Mystery and Numinous Treasure thus concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞真智慧上品大诫 经名：太上洞真智慧上品大诫。 撰人不详，约出於东晋。 系古《灵宝经》之一。 一卷。 底本出处：《正统道藏》洞真部诫律类。 参校本：敦煌P.2461、P.2358、S.5746、S.6290、P.3793号抄本。 太上洞真智慧上品大诫#1 元始天尊以开皇元年七月一日午时，於西那玉国郁察#2之山浮罗之岳，长桑林中，授太上道君智慧上品大诫#3法文。 是其时也，道君受诫起，北向首体投地，回心十方，还向东而伏。 天尊告太上道君曰：今当宣通法音，开悟旱生，为诸男女解灾却患，请福度命，拔诸苦根。 使生者见道，身脱八难，死者欢乐，饮食天堂，早生人中，转轮圣王。 修斋求道，皆当一心请奉十诫，谛受勿忘，专心默念，洞思自然，勿得#4杂想，挠乱形神，能如是者，便当静听。 天尊告曰： 第一诫者，心不恶妬，无生阴贼，椷口慎过，想念在法。 第二诫者，守仁不杀，愍济群生，慈爱广救，润及一切。 第三诫者，守贞推让#5，不淫不盗，常行善念，损己济物。 第四诫者，不色不欲，心无放荡，贞洁守慎，行无玷污。 第五诫者，口无恶言，言不华绮，内外中直，不犯口过。 第六诫者，减酒#6节行，调和气性，神不损伤，无犯众恶。 第七诫者，不得嫉人胜己，争竞功名，每事逊让，退身度人。 第八诫者，不得评论经教，訾毁圣文，躬心承法，恒如对神。 第九诫者，不得斗乱口舌，评论#7四辈，天人咎恨，伤损神炁。 第十诫者，举动施为，平等一心，人和神穆，行常使然。 天尊言：修奉诸诫，每合天心。 常行大慈，愿为一切，普度厄世，谦谦尊教，不得中怠。 宁守善而死，不为恶而生。 於是不退，可得拔度五道，不履三恶，诸天所护，万神所敬，长斋奉诫，自得度世。 太上道君不胜喜惧，稽首奉命。 天尊言：夫为#8学者，修斋行道，开度天人，作诸善功，当行十二可从，而得度世者，尔宜从之，自得正真，终入无为，所愿皆成。 第一者，见真经出法开度一切，便发道意，心愿后世得登大圣。 第二者，常行慈心，愿念一切普得见闻，开度广远，无有障翳。 第三者，好乐经教，深远览达，意志坚明，开化愚暗。 第四者，尊受师训，广开劝化，令入法墙，远离盲道。 第五者，信向玄妙，尊奉经诀，晨夕诵习，无有怠倦。 第六者，不务荣华，断俗因缘，专心定志，所营在法。 第七者，勤诵大经，愿念一切，广开桥梁，为来生作缘。 第八者，恒#9生善心，不邪不伪，无嫉无害，无恶无妬。 第九者，在所托生#10，常值圣世，与灵宝法教，相值不绝。 第十者，洁身持诫，修斋建功，广救群生，咸得度脱。 第十一者，学业广览，宣通洞法，预以天人，普令开度。 第十二者，常与明师，世世相值，受教宣化，度人无量，一切善心，皆得真道。 天尊言：学士修行之法，当行十二可从之诫。 能以一心行此善念，世世得见圣文，与道结缘。 诸天友#11识，独超#12三界，无所挂碍，长离三恶五道八难。 万神#13敬护，地祇拥卫，门户清肃，万灾不干，可谓端坐#14而得道也。 勤为习诵，广宣同学，皆使一心，齐入法门。 天尊言：道尊法妙，人身亦贵。",
      "translated_text": "*The Supreme Cavern of Realized Wisdom’s Highest Precepts*\n**Sutra Title:** *The Supreme Cavern of Realized Wisdom’s Highest Precepts*\nComposed by an unknown author, approximately dated to the Eastern Jin dynasty. One of the ancient *Scriptures of Numinous Treasure* (*Lingbao Jing*). One scroll.\n\nIn the first year of the Kaihuang era, on the first day of the seventh month at the hour of noon, the Celestial Worthy of Primordial Beginning bestowed upon the Most High Lord of the Dao the *Highest Precepts of Realized Wisdom* within the Long Mulberry Grove of the Floating Mountain of Yucha in the Western Land of Yuna. At that moment, the Lord of the Dao, having received the precepts, prostrated himself facing north, his entire body touching the earth, his heart turning toward the ten directions before returning to bow toward the east.\n\nThe Celestial Worthy addressed the Most High Lord of the Dao, saying: \"Today I shall proclaim the Dharma-sound, awakening those born in drought, delivering all men and women from calamity and affliction, entreating blessings and liberating lives, and uprooting the roots of all suffering. Let the living behold the Dao, their bodies freed from the eight difficulties; let the dead rejoice, feasting in the heavens, soon reborn among men as Wheel-Turning Sage Kings. Those who fast and seek the Dao must single-mindedly receive and uphold these ten precepts, earnestly accepting them without forgetfulness, contemplating them in silent focus, and reflecting upon the spontaneous. Let no stray thoughts disturb body and spirit. Those who can do so shall listen in stillness.\"\n\nThe Celestial Worthy declared:\n1. **The First Precept:** Let the heart harbor no malice or envy. Give rise to no yin thieves. Guard the mouth and be cautious of transgressions. Let thoughts dwell in the Dharma.\n2. **The Second Precept:** Uphold benevolence and refrain from killing. Pity and succor all beings. Let compassion and love extend broadly to rescue all.\n3. **The Third Precept:** Maintain chastity and yield to others. Neither lust nor steal. Constantly cultivate good thoughts, diminishing the self to aid others.\n4. **The Fourth Precept:** Neither indulge in sensuality nor desire. Let the heart be free from dissipation. Uphold purity and caution, ensuring conduct remains unstained.\n5. **The Fifth Precept:** Let the mouth utter no evil words. Speech should not be ornate or deceitful. Be upright within and without, committing no transgressions of the mouth.\n6. **The Sixth Precept:** Reduce wine and regulate conduct. Harmonize qi and temperament. Let the spirit remain unharmed, avoiding all evils.\n7. **The Seventh Precept:** Do not envy those who surpass you or contend for fame and merit. In all matters, yield and withdraw, delivering others.\n8. **The Eighth Precept:** Do not criticize or slander scriptures and sacred texts. Receive the Dharma with your whole heart, ever as though facing the divine.\n9. **The Ninth Precept:** Do not engage in quarrels or disputes, nor judge the four classes of beings. Let neither gods nor men bear resentment, nor harm the spirit and qi.\n10. **The Tenth Precept:** In all actions and deeds, maintain equanimity and single-mindedness. Let harmony prevail among people and reverence among spirits, ever thus in conduct.\n\nThe Celestial Worthy said: \"Those who cultivate and uphold these precepts align with the heart of Heaven. Constantly practice great compassion, vowing to act for the sake of all, universally delivering the world from peril. Be humble and reverent toward the teachings, never growing lax. Better to die upholding goodness than to live in evil. Through unwavering devotion, one may be delivered from the five destinies, avoid the three evils, be protected by all heavens, and revered by the myriad spirits. Through fasting and upholding the precepts, one naturally attains liberation in this world.\"\n\nThe Most High Lord of the Dao, overcome with joy and awe, bowed his head in reverence and received the command.\n\nThe Celestial Worthy said: \"For those who study, fast, and practice the Dao, delivering gods and humans and performing all virtuous deeds, there are twelve principles to follow in order to attain liberation in this world. You should adhere to them, thereby attaining true perfection and ultimately entering the realm of non-action, with all aspirations fulfilled.\n\n1. Upon encountering true scriptures that reveal the Dharma and deliver all beings, one should awaken the Dao-mind, vowing that in future lives one may ascend to great sageliness.\n2. Constantly practice a heart of compassion, vowing that all beings may universally hear and see, with deliverance extending broadly and without obstruction.\n3. Delight in the scriptural teachings, deeply and extensively studying them. Let the will be firm and bright, awakening the ignorant and benighted.\n4. Reverently receive the master’s instructions, broadly exhorting and transforming others, guiding them into the Dharma-enclosure and far from blind paths.\n5. Trust in and turn toward the mysterious and wondrous, reverently upholding the scriptural instructions. Recite and study them morning and evening without weariness.\n6. Do not pursue glory and splendor, severing worldly entanglements. Focus the mind and stabilize the will, directing all endeavors toward the Dharma.\n7. Diligently recite the great scriptures, vowing for the sake of all beings to broadly establish bridges, creating karmic conditions for future lives.\n8. Constantly generate good thoughts, neither deviating nor deceiving, harboring no envy, harm, malice, or jealousy.\n9. Wherever one is reborn, may one always encounter a sagely age, continuously encountering the teachings of the *Numinous Treasure* without interruption.\n10. Purify the body and uphold the precepts. Fast and establish merit, broadly rescuing all beings, universally delivering them.\n11. Extensively study and broadly proclaim the profound Dharma, preparing for the inclusion of gods and humans, universally delivering all.\n12. Always encounter enlightened masters, lifetime after lifetime, receiving their teachings and proclaiming the Dharma, delivering countless beings. Through all good thoughts, one attains the true Dao.\"\n\nThe Celestial Worthy said: \"The method of cultivation for scholars lies in practicing these twelve principles. Those who single-mindedly cultivate these good thoughts will, lifetime after lifetime, behold the sacred texts and form karmic bonds with the Dao. Their celestial acquaintances will be many, and they will alone transcend the three realms, free from all entanglements, forever departing from the three evils, the five destinies, and the eight difficulties. Revered and protected by the myriad spirits, surrounded by earthly deities, their households will be pure and solemn, untouched by the ten thousand calamities. Truly, one may attain the Dao while seated in repose. Diligently study and recite, broadly proclaiming to fellow learners, that all may single-mindedly enter the Dharma-gate together.\"\n\nThe Celestial Worthy said: \"The Dao is revered, the Dharma is wondrous, and the human body is also precious.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1302,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.52865028381348,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞真智慧上品大诫.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故道开法，遗诫经文，以度人身，人身既度，上与道同。 宜#15为精行，持斋奉诫，夷心静默，志念分明，一意归#16向，专想不二，涤荡六府，过中不味，内外清虚，每合自然。 是其斋日，捻香启愿，应心上彻，四天司逻、十部威神，即下履行，观听至音，鉴映尔心。 如诫行道，皆列功诸天，祸福立彰。 道不负人，勤行谛受，勿使魔言。 天尊言：若善男子、善女人，能发自然道意，来入法门，受我十诫，行十二可从，则为大道清信弟子，皆与勇猛飞天齐功。 飞天，未得道者也，是大道十转弟子，飞天虚空，为诸天策驾。 清信弟子，见在世上，可得免於忧恼，度於众苦，身入光明，形内澄正，招鬼使神，制伏魔精，十转即得上为飞天。 若在一转，而行精进，心不懈退，作诸功德，长斋苦行，晨夕不倦，即得飞天#17，於此而进，超陵三界，为上清真人。 天尊言：受我十诫，行#18十二可从，皆当稽首称； 清信弟子，从今受诫，一心奉行，不敢不信，归#19命十方。 能如是者，见世门户隆盛#20，咸得康强，地祇侍卫，三界司迎，七祖魂神，上升南官，衣饭天厨，早得更生，还於人中国王之门，世世不绝，与道因缘。 天尊言：建斋行道，四天帝王皆驾飞云缘饼，八景玉舆，侍从真人玉女，手把华旛，前导凤歌，后从天钧，白鹤狮子，啸歌雍雍，烧香散华，俘空而来，瞻礼行道，观听法音。 天王下降，万灵朝焉，如是岂可#21不尽其法也。 当先受十诫，然后行道，庠序雅步，静心闭意，坐起卧息，不离仪格。 天王欢悦，列名上清，可谓得道在方寸之间。 智慧闭塞六情上品诫 第一诫者，目无广瞻，乱诸华色，亡睛失瞳#22，光不明彻。 第二诫者，耳无乱听，混於五音，伤神败正，恶声啼吟。 第三诫者，鼻无广嗅，杂炁臭腥，易有混浊，形不澄正。 第四诫者，口无贪味，脂熏之属，浊注五神，脏腑渍溃#23。 第五诫者，手无犯恶，不窃人物，贪利入己，祸不自觉。 第六诫者，心无爱欲，摇动五神，伤精丧炁，体发迷荒。 天尊言：其六诫者，身之大患。 来生男女，虽受人形，而六情不纯，未 见经教，不闻法音，形不自觉，沉迷罪门，致命短促，不竟天年，长处恶道，甚可哀怜。 故说是诚，开度人天，善心信向，一意归命，尊奉圣教，闭诸恶门，则形入虚空，六通智慧。 六通智慧者，洞视、洞#24听、洞空、洞虚、洞清、洞微，是为六通，无所不通也。 六情恬夷，神自归也，一自生也，精自固也，寿命长远，终不死也。 智慧度生上品大诫 一者，见人穷急，度其死厄。 见世明达，能制凶逆。 年命长远，世享无极。 二者，见人穷乏，饥寒困急，损身布施，令人富贵。 福报万倍，世世欢乐。 三者，含血之类，有急投人，能为开度，济其死厄。 见世康强，不遭横恶。 四者，施惠#25鸟兽，有生之类，割口饲#26之，无所爱惜。 世世饱满，常在福地。 五者，度诸蠢动，一切众生，咸使成就，无有夭伤。 见世兴盛，不履众横。 六者，常行慈心，愍济一切，放生度厄，其功甚重。 令人见世，居危得安，居疾得康，居贫得富，举向从心。 天尊言：其六诫者，皆以心通智慧，能施其德，行合自然，庆福恒居其身，祸害常远其门。",
      "translated_text": "Thus the Dao unfolds the Dharma, bequeathing precept-scriptures to deliver the human body. Once the human body is delivered, it ascends to merge with the Dao. One should therefore cultivate purity in conduct, uphold fasting and observe the precepts, pacify the mind in stillness, and keep aspirations clear. Single-mindedly turn toward the Dao, maintain undivided focus, purify the six repositories, refrain from indulging beyond moderation, and keep inner and outer realms empty and serene, ever in accord with the natural. On the days of fasting, hold incense and make vows, so that one’s sincerity ascends to the heavens. The four heavenly patrol-lords and the ten divisions of mighty spirits will descend to walk the earth, observing and listening to the purest sounds, mirroring the clarity of your heart. Those who uphold the precepts and practice the Dao will have their merits recorded in the heavens, and karmic retribution will swiftly manifest. The Dao does not fail those who diligently practice and sincerely receive; do not let demonic words deceive you.\n\nThe Celestial Worthy said: \"If good men and good women awaken the natural intention for the Dao, enter the Dharma-gate, receive my Ten Precepts, and practice the Twelve Permissible Observances, they shall be called pure and faithful disciples of the Great Dao, their merits equal to those of the valiant Flying Celestials. The Flying Celestials are those who have not yet attained the Dao; they are the tenfold-transformed disciples of the Great Dao, soaring through the empty sky as charioteers for the various heavens. Pure and faithful disciples, while still in the world, may be freed from sorrow and delivered from all suffering. Their bodies enter radiant light, their forms become inwardly pure and upright, and they summon ghosts and command spirits, subduing demonic forces. After ten transformations, they ascend to become Flying Celestials. If, in even a single transformation, they practice with diligence, their hearts unwavering and unrelenting, performing all manner of meritorious deeds, maintaining long fasts and austerities, tireless from dawn to dusk, they shall attain the rank of Flying Celestial. From there, they advance further, transcending the three realms to become Perfected Ones of the Upper Clarity.\n\nThe Celestial Worthy said: \"Those who receive my Ten Precepts and practice the Twelve Permissible Observances should bow their heads and declare: 'As pure and faithful disciples, from this day forth we receive the precepts, single-mindedly upholding them, never daring to disbelieve, surrendering our lives to the ten directions.' Those who can do so will see their households flourish in this life, enjoying health and strength. Earthly deities will attend and protect them, the lords of the three realms will welcome them, and the souls of their seven ancestors will ascend to the Southern Palace, clothed and fed by the celestial kitchens. Soon they will be reborn, returning to the gates of human kings, their connection to the Dao unbroken across lifetimes.\"\n\nThe Celestial Worthy said: \"When establishing fasts and practicing the Dao, the Four Heavenly Kings will ride upon flying cloud-cakes and eight-scene jade chariots, attended by Perfected Ones and jade maidens, their hands holding flowered banners. Phoenix songs lead the way, celestial music follows, with white cranes and lions chanting in harmony. They burn incense and scatter flowers, descending through the void to gaze upon the practice of the Dao and listen to the Dharma-sounds. The Heavenly Kings descend, and the myriad spirits pay homage. How could one not fully uphold this Dharma? First receive the Ten Precepts, then practice the Dao. Move with refined grace, still the mind and close the senses. Whether sitting, rising, lying down, or resting, never depart from proper conduct. The Heavenly Kings will rejoice, and your name will be recorded in the Upper Clarity. Truly, the attainment of the Dao lies within the space of a square inch.\"\n\n**The Six Precepts of the Upper Grade for Closing the Passions and Cultivating Wisdom**\n\nThe first precept: Let the eyes not wander in broad gazing, lest they be distracted by the profusion of colors, harming the pupils and dimming the light, so that clarity is lost.\n\nThe second precept: Let the ears not indulge in chaotic listening, lest they be confused by the five tones, injuring the spirit and corrupting rectitude, drawn to evil sounds and mournful cries.\n\nThe third precept: Let the nose not seek out broad scents, lest it be tainted by impure qi and foul odors, leading to turbidity and a form that is not pure and upright.\n\nThe fourth precept: Let the mouth not crave flavors, especially those rich and greasy, lest they pollute the five spirits and cause the organs to fester and decay.\n\nThe fifth precept: Let the hands not commit evil, nor steal the belongings of others, nor covet profit for oneself, lest misfortune arise unawares.\n\nThe sixth precept: Let the heart not be swayed by desire, lest it agitate the five spirits, harming essence and scattering qi, leaving the body lost and confused.\n\nThe Celestial Worthy said: \"These Six Precepts are the great afflictions of the body. Those who, in future lives, are born as men or women, though they receive human form, will have impure six senses. They will not have seen the scriptures or heard the Dharma-sounds, their forms unaware of themselves, sunk in the gates of sin, their lives cut short, failing to complete their heavenly years. They will long abide in evil destinies—how pitiful they are! Therefore, these precepts are expounded to deliver humans and gods. With a good heart, turn in faith, single-mindedly surrendering your life, revering and upholding the sacred teachings, closing the gates of evil. Then your form will enter the empty void, and you will attain the six penetrations of wisdom.\"\n\nThe six penetrations of wisdom are: penetrating vision, penetrating hearing, penetrating emptiness, penetrating voidness, penetrating clarity, and penetrating subtlety. These are the six penetrations, through which nothing is not penetrated. When the six senses are tranquil, the spirit naturally returns; unity naturally arises; essence naturally stabilizes; and life becomes long and enduring, never to die.\n\n**The Six Great Precepts of the Upper Grade for Delivering Beings Through Wisdom**\n\nThe first: When you see someone in dire distress, deliver them from mortal peril. If you encounter the wise and enlightened in the world, you will be able to restrain the violent and rebellious. Your life will be long and enduring, and your worldly blessings boundless.\n\nThe second: When you see someone impoverished and destitute, suffering from hunger and cold, diminish your own body to bestow alms, bringing them wealth and nobility. The karmic reward will be ten thousandfold, and you will rejoice across lifetimes.\n\nThe third: When creatures of blood and breath, in their distress, turn to humans for refuge, be able to deliver and save them from mortal peril. In this life, you will enjoy health and strength, free from sudden misfortune.\n\nThe fourth: Bestow kindness upon birds and beasts, all living beings. Cut from your own mouth to feed them, sparing nothing. Across lifetimes, you will be sated and content, ever dwelling in blessed lands.\n\nThe fifth: Deliver all senseless creatures, all sentient beings, ensuring their completion without premature harm. In this life, you will flourish, untouched by manifold misfortunes.\n\nThe sixth: Always practice a heart of compassion, taking pity and delivering all beings, releasing life and saving from peril. The merit of this is profound. In this life, it will enable you to turn danger into safety, sickness into health, poverty into wealth, and all your aspirations will follow your heart.\n\nThe Celestial Worthy said: \"These Six Precepts all arise from the heart’s penetration of wisdom. By bestowing virtue and acting in accord with the natural, blessings will constantly reside in your body, and misfortune will forever depart from your gate.\"",
      "overlap_context": " five destinies, and the eight difficulties. Revered and protected by the myriad spirits, surrounded by earthly deities, their households will be pure and solemn, untouched by the ten thousand calamities. Truly, one may attain the Dao while seated in repose. Diligently study and recite, broadly proclaiming to fellow learners, that all may single-mindedly enter the Dharma-gate together.\"\n\nThe Celestial Worthy said: \"The Dao is revered, the Dharma is wondrous, and the human body is also precious.\"",
      "start_char": 1302,
      "end_char": 2584,
      "start_sentence": 48,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.788076877593994,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞真智慧上品大诫.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "玩好不绝，世世因缘，一转受报，飞天齐功，超轮九转，渐入大道，十转弟子，名书诸天，七祖同升，上生天堂，衣食福德，即生人中，转轮神王#27，恒居福门。 智慧十善劝助上品大诫 一者，劝助礼敬三宝，供养法师，令人世为君子，贤孝高才，荣贵巍巍，生为人尊，门族昌炽。 二者，劝助治写经书，令人世世聪明，博闻妙义#28，恒值圣世，见诸经教，能诵章句。 三者，劝助建斋静舍#29，令人世世门户高贵，身登天堂，饭食自然，常居无为。 四者，劝助香油众乏，令人世世芳盛，香洁光明，容睟#30绝伟，天姿高秀。 五者，劝助法师法服，令人世世长雅，逍遥中国，不堕边夷，男女端正，冠冕玉佩。 六者，劝助国王父母，子民忠孝，令人世世多嗣，男女贤儒，不经诸苦。 七者，劝助斋静读经，令人世世不堕地狱，即升天堂，礼见众圣，速得反形，化生王家，在意所欲，玩服备足，七祖同欢，善缘悉会，终始荣乐，法轮运至，将得仙道。 八者，劝助道士，众人经学，令人世世才智洞达，动静威仪，常为人师。 九者，劝助一切，布施谏诤，令人世世寿考富乐，常无怨恼。 十者，劝助一切人民，除嫉去欲，履行众善，令人世世安乐，祸乱不生，病者自愈，仕宦高迁，为众所仰，莫不吉佑，门户清贵，天人爱育，神魔敬护，常生福地。 天尊言：其十善劝诫，自非大道十转弟子，莫能行也。 能行之者，与飞天齐功，心与六通智慧参同，洞虚无也。 身后皆得飞行云中，众圣策驾，游乎十方。 从此不懈#31，亦得位及仙王，七祖即离幽夜，升入南宫，衣饭天厨，受福自然。 其法高妙，度人无量，巍巍大化，难可胜焉。 天尊言：六通智慧者，天曰洞视，地曰洞听，东曰洞空，西曰洞虚，南曰洞清，北曰洞微。 六通洞达，辽邈无端，不可得测，不可得穷，无所不包，无所不容。 其有六觉之炁，常通六慧，人识六通，则六觉明焉。 制御六情，使人自然弃诸恶根，生诸善念，心体六慧#32，自得神仙。 天尊言：为道之本，欲度十苦八难之中，当受大诫，修斋建德，立诸善功，为三界所称，诸天所观，身无不度，道无不成。 不受大诫，徒为长斋，或断谷休粮，隐遁山林，肉身求度，而无六通智慧之行，徒失尔功，无由成就。 善男子善女人，有至心者，勤求谛受。 今说是经，广加开度，咸使十方，普闻法音。 天尊言：天为洞视，则．天眼智高，慧洞无穷。 自上自下，四面八方，无所不照，无所不明，虽曰一通智慧，而五色总焉。 天洞自然，故无损伤，人则法天，目中朱童，亦有五色之光。 人不持诫，六觉之炁，不通人孔窍，智慧未开，广视五色，则眼童飞扬，光睛昏翳，令人目盲。 故说是诫，以度天人，咸使男女，得闻法音。 欲得过度，年命长远，当奉是诫，勤行勿忘。 慎多色想，放荡目神，每自制御，爱养眼童，思真静念，令通#33智慧，洞观虚空，持诫制己，则五色归身。 五色自归，则无损伤，保尔年命，可得无穷。 天尊言：地为洞听，智慧远闻#34，故响应天上，下彻四方，无所不穷，无所不闻。 虽曰一通智慧，而五音总焉。 地洞自然，以生五音，朕而不动，故无损伤。",
      "translated_text": "Those who indulge in worldly pleasures without cease will, lifetime after lifetime, reap the karmic consequences. Yet with a single turn of merit, their deeds align with the Flying Celestials, transcending the Nine Revolutions of the Wheel. Gradually, they enter the Great Dao. Disciples who achieve the Ten Revolutions have their names inscribed in the heavens. Their seven generations of ancestors ascend together, reborn in celestial realms, where they are clothed and fed by the blessings of virtue. Even in the human realm, they become Wheel-Turning Divine Kings, ever dwelling in the gates of fortune.\n\n**The Ten Wholesome Exhortations to Assist the Supreme Precepts**\n\nThe first: Exhort and assist in revering the Three Treasures and making offerings to Dharma masters. This enables one to be reborn in the world as a noble person—virtuous, filial, and of lofty talent—honored and exalted, revered by all, with a flourishing clan.\n\nThe second: Exhort and assist in copying scriptures. This ensures that one is reborn lifetime after lifetime with keen intelligence, vast learning, and profound understanding, ever encountering sagely eras and able to recite the teachings and their verses.\n\nThe third: Exhort and assist in establishing fasting halls and tranquil abodes. This ensures that one’s family is reborn lifetime after lifetime in nobility, ascending to celestial realms where food and sustenance arise naturally, ever dwelling in non-action.\n\nThe fourth: Exhort and assist in providing incense and oil to those in need. This ensures that one is reborn lifetime after lifetime with fragrant purity, radiant brilliance, and an appearance of surpassing beauty, endowed with celestial grace and lofty refinement.\n\nThe fifth: Exhort and assist in providing Dharma robes for Dharma masters. This ensures that one is reborn lifetime after lifetime with enduring elegance, freely dwelling in the Central Kingdom, never falling among borderland barbarians, with sons and daughters of upright bearing, adorned with crowns, jade, and pendants.\n\nThe sixth: Exhort and assist kings, parents, and the people in loyalty and filial piety. This ensures that one is reborn lifetime after lifetime with many descendants—sons and daughters of wisdom and virtue—spared from all suffering.\n\nThe seventh: Exhort and assist in fasting, tranquility, and scripture recitation. This ensures that one is never reborn in hell but ascends directly to celestial realms, where they pay homage to the multitude of sages. Swiftly, they regain their form, transforming and being reborn in royal households, their every desire fulfilled, their adornments and possessions complete. Their seven generations of ancestors rejoice together, all karmic affinities harmoniously met. From beginning to end, they abide in glory and joy. As the Dharma Wheel turns, they attain the immortal Dao.\n\nThe eighth: Exhort and assist Daoists and the people in scriptural study. This ensures that one is reborn lifetime after lifetime with penetrating wisdom and insight, their every movement and stillness imbued with dignity, ever serving as a teacher to others.\n\nThe ninth: Exhort and assist all in almsgiving and admonition. This ensures that one is reborn lifetime after lifetime with long life, wealth, and joy, ever free from resentment and sorrow.\n\nThe tenth: Exhort and assist all people in relinquishing jealousy and desire, practicing the myriad virtues. This ensures that one is reborn lifetime after lifetime in peace and happiness, free from calamity and disorder. The sick recover, officials ascend in rank, and all look up to them with reverence. None fail to receive blessings. Their households are pure and noble, cherished by celestials and humans, revered by spirits and demons, ever dwelling in lands of fortune.\n\nThe Celestial Worthy said: \"These Ten Wholesome Exhortations can only be practiced by disciples of the Great Dao who have achieved the Ten Revolutions. Those who can practice them will have deeds equal to the Flying Celestials, their hearts in harmony with the Six Penetrations of wisdom, merging with the emptiness of the void. After death, they will all soar through the clouds, with the multitude of sages guiding their chariots as they roam the ten directions. From this, they will never slacken, attaining the rank of Immortal Kings. Their seven generations of ancestors will depart the dark night, ascending to the Southern Palace, where they are clothed and fed by celestial kitchens, receiving blessings naturally. This Dharma is lofty and wondrous, delivering countless beings. Its vast transformation is beyond measure.\"\n\nThe Celestial Worthy said: \"The Six Penetrations of wisdom are as follows: Heaven is called *Dongshi* (Penetrating Sight), Earth is called *Dongting* (Penetrating Hearing), the East is called *Dongkong* (Penetrating Emptiness), the West is called *Dongxu* (Penetrating Void), the South is called *Dongqing* (Penetrating Purity), and the North is called *Dongwei* (Penetrating Subtlety). The Six Penetrations pervade the boundless, without limit or end, unfathomable and inexhaustible, encompassing all, containing all. Those who possess the *qi* of the Six Awarenesses constantly connect with the Six Wisdoms. When human perception attains the Six Penetrations, the Six Awarenesses become luminous. Mastering the Six Emotions, one naturally discards all evil roots and generates wholesome thoughts. When the heart embodies the Six Wisdoms, one attains the immortal Dao.\"\n\nThe Celestial Worthy said: \"The foundation of the Dao is this: to deliver beings from the Ten Sufferings and Eight Adversities, one must receive the Great Precepts, cultivate fasting, establish virtue, and perform wholesome deeds, so as to be praised by the Three Realms and observed by all celestials. Thus, none will fail to be delivered, and the Dao will be perfected. Without receiving the Great Precepts, merely practicing prolonged fasting, abstaining from grains, or retreating to the mountains—seeking deliverance in the flesh without the practice of the Six Penetrations of wisdom—will only waste one’s efforts, with no hope of accomplishment. Good men and good women of sincere hearts, diligently seek and earnestly receive them. Now that this scripture is expounded, may its teachings widely deliver all, so that the Dharma’s voice is universally heard in the ten directions.\"\n\nThe Celestial Worthy said: \"Heaven is *Dongshi* (Penetrating Sight), its wisdom the Heavenly Eye, its insight boundless. From above and below, the four directions and eight quarters, nothing is unseen, nothing is unclear. Though called a single Penetration of wisdom, it encompasses the Five Colors. Heaven’s penetration is natural, thus undamaged. Humans emulate Heaven: the red pupil of the eye also possesses the light of the Five Colors. If one does not uphold the precepts, the *qi* of the Six Awarenesses will not flow through the human apertures, and wisdom will not unfold. Gazing widely at the Five Colors causes the eye’s pupil to scatter, its light to dim and become obscured, leading to blindness. Therefore, these precepts are expounded to deliver celestials and humans, so that all men and women may hear the Dharma’s voice. To attain deliverance and longevity, one must uphold these precepts and practice them diligently, never forgetting. Guard against excessive indulgence in sensory desires, restrain the wandering gaze, and master oneself. Cherish and nurture the eye’s pupil, contemplate the true and still, allowing wisdom to penetrate. With penetrating vision of the void and self-mastery through the precepts, the Five Colors will return to the body. When the Five Colors naturally return, there will be no damage. Preserve your years and life, and they may become boundless.\"\n\nThe Celestial Worthy said: \"Earth is *Dongting* (Penetrating Hearing), its wisdom far-reaching. Thus, its resonance responds to Heaven above and pervades the four directions below, nothing unheard, nothing unperceived. Though called a single Penetration of wisdom, it encompasses the Five Sounds. Earth’s penetration is natural, giving rise to the Five Sounds, stable and unmoving, thus undamaged.\"",
      "overlap_context": "delivering all beings, releasing life and saving from peril. The merit of this is profound. In this life, it will enable you to turn danger into safety, sickness into health, poverty into wealth, and all your aspirations will follow your heart.\n\nThe Celestial Worthy said: \"These Six Precepts all arise from the heart’s penetration of wisdom. By bestowing virtue and acting in accord with the natural, blessings will constantly reside in your body, and misfortune will forever depart from your gate.\"",
      "start_char": 2584,
      "end_char": 3832,
      "start_sentence": 92,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.12213921546936,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞真智慧上品大诫.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "人则像地，耳中则有五声之神。 人不持诫，则智慧不过，不可乱听五音之声。 五音使人五神飞扬#35，耳中空废，隆隆悲呜。 五神啼泣，致令耳#36聋。 故说是诫，以度天人，咸使男女普闻法音。 欲得长生，当持大诫，以制耳神，勿为多听非法之音，静听妙经神真之章，令通智慧，洞响太空，持诫制己，则五音归身。 五音自归，则耳无恶声，保尔年命，克得长远。 天尊言：东为洞空始阳之炁，炁出於空，智明慧寥，故曰洞空。 洞远无碍，不可得穷，始青之炁，虽曰一通智慧，而五炁总焉。 空无不纳，故无损伤，人虽有形，形亦法空。 鼻有黄宁，辟非之神。 人未持诫，则智慧不通，未入智慧，不可杂食臭腥之物。 臭腥之炁，使人鼻神壅塞，经源易有断绝，明梁不通，故说是诫，以度天人。 成使男女得闻法音。 欲度诸苦八难之中，当受是诫，以制鼻神，勿多受臭，涤荡明梁，导引生炁，通明智慧，洞炁入空，持诫制己，则众炁归身。 众炁自归，与炁混同，长保身命，终不毁伤。 天尊言：西为洞虚少阳之炁，炁出於虚，智微慧朗，故曰洞虚。 虚之无碍，洞远难穷，少阴之炁，虽曰一通智慧，而五味总焉。 虚无不入，虚无不容，人虽法虚，身不持诫，则智慧不通。 智慧未入，财五味为患，贪啖脂熏，则五神不安，致有倾讫，年命不长。 故说是诫，以度天人，咸令男女，普闻法音。 欲得长命，当持大诫，以制五神，慎勿贪五味，甘其#37脂熏，涤荡五脏，每令清凉，身有智慧，则五味和香#38，内外恬夷#39，年命不伤也。 天尊言：南为洞清太阳之炁，炁出於清智清慧，开关而洞清。 故南有赤帝洞阳之庭，冶炼万物，受炼而明也。 人不持诫，则智慧不通。 智慧不通，则心神振动，生於爱欲，使人迷荒，丧神伤命，寿不得长。 故说是诫，以度天人，咸使男女，普闻法音。 欲得长寿，过度诸患，当受是诫，以制心神，除情遣欲，弃尘入清，通明智慧，六觉开津，身入洞清，与炁自然，保尔年命，得永长存。 天尊言：北曰洞微，生於玄，智远慧深，微而洞真，阴察罪福，主人生元，手法四时，上应天关，天关恒转，手亦动焉。 手有大神，接生方盈，运人四大，观人败成。 人不持诫，智慧不通，则摇动人心，众恶并生，手作不觉，贪窃自营，致有短命，不终天#40年。 故说是诫，以度天人，欲得长寿，过度恶根，当奉是诫，以制手神，通明智慧，心自开明，手不贪窃，恶根不生，应天顺炁，身入自然，保尔寿命，永得长存。 智慧功德报应上品诫 诫曰：施散供养三宝神经。 一钱已上，皆七十四万倍报，一万以上，报不可胜。 名记诸天，身登太上十转弟子，七祖上升，为诸天宾友。 诫曰：施散法师法服，治写经书，建立静治。 一钱以上，皆三十二万倍报。 万钱以上，报不可胜。",
      "translated_text": "Just as humans resemble Earth, within the ear dwell the spirits of the Five Sounds. If one does not uphold the precepts, wisdom remains obstructed, and one must not recklessly heed the sounds of the Five Tones. The Five Tones cause the Five Spirits to scatter and soar, leaving the ear hollow and desolate, resounding with sorrowful wails. The Five Spirits weep, leading to deafness. Thus, these precepts are expounded to deliver celestial beings, that all men and women may universally hear the Dharma’s resonance. To attain longevity, one must uphold the Great Precepts, restraining the ear’s spirit—refraining from excessive listening to unlawful sounds, and instead serenely heeding the wondrous scriptures and divine chapters of the Perfected. This allows wisdom to penetrate, resonating through the Great Void. By upholding the precepts to master oneself, the Five Sounds return to the body. When the Five Sounds naturally return, the ear remains free of harmful noises. Preserve your years and life, and they may endure boundlessly.\n\nThe Celestial Worthy said: \"The East is *Dongkong* (Penetrating Void), the qi of Primordial Yang. Qi emerges from the Void, its wisdom luminous and its insight vast, thus called *Dongkong*. Its penetration is boundless, unfathomable. The qi of nascent green, though termed a single Penetration of wisdom, encompasses the Five Qi. The Void admits all, thus it suffers no damage. Though humans possess form, form too follows the Void. The nose harbors *Huangning*, the spirit that repels impurity. If one does not uphold the precepts, wisdom remains obstructed. Without entering wisdom, one must not indiscriminately consume foul and rank substances. The qi of foulness and rankness congests the nose’s spirit, causing the meridian’s source to risk severance, obstructing the *Mingliang* (Luminous Bridge). Thus, these precepts are expounded to deliver celestial beings, that all men and women may hear the Dharma’s resonance. To transcend the Eight Difficulties and myriad sufferings, one must receive these precepts, restraining the nose’s spirit—refraining from excessive intake of foulness, purifying the *Mingliang*, guiding and conducting the qi of life, illuminating wisdom. When qi penetrates the Void, and the precepts master the self, the manifold qi return to the body. When the qi naturally return, merging with the primordial qi, one preserves life and form, forever free from harm.\"\n\nThe Celestial Worthy said: \"The West is *Dongxu* (Penetrating Emptiness), the qi of Lesser Yang. Qi emerges from Emptiness, its wisdom subtle and its insight radiant, thus called *Dongxu*. Its emptiness is unimpeded, its penetration vast and unfathomable. The qi of Lesser Yin, though termed a single Penetration of wisdom, encompasses the Five Flavors. Emptiness admits all, contains all. Though humans follow Emptiness, if the body does not uphold the precepts, wisdom remains obstructed. Without wisdom’s entry, the Five Flavors become afflictions. Craving rich and greasy foods disturbs the Five Spirits, leading to collapse and exhaustion, shortening one’s years and life. Thus, these precepts are expounded to deliver celestial beings, that all men and women may universally hear the Dharma’s resonance. To attain long life, one must uphold the Great Precepts, restraining the Five Spirits—guarding against greed for the Five Flavors, moderating rich and greasy indulgences, purifying the Five Viscera, keeping them cool and clear. When the body possesses wisdom, the Five Flavors harmonize as fragrance, inner and outer tranquility prevail, and life remains unharmed.\"\n\nThe Celestial Worthy said: \"The South is *Dongqing* (Penetrating Clarity), the qi of Greater Yang. Qi emerges from Clarity, its wisdom pure and its insight lucid, opening the gates to penetrate clarity. Thus, the South harbors the Crimson Emperor’s *Dongyang* (Penetrating Yang) Court, where the myriad things are smelted and refined to brilliance. If one does not uphold the precepts, wisdom remains obstructed. Without wisdom’s flow, the heart’s spirit trembles, giving rise to craving and desire, leading to delusion and dissipation, harming the spirit and shortening life, preventing longevity. Thus, these precepts are expounded to deliver celestial beings, that all men and women may universally hear the Dharma’s resonance. To attain long life and transcend all afflictions, one must receive these precepts, restraining the heart’s spirit—dispelling passions, relinquishing desires, forsaking the dust to enter Clarity. When wisdom illuminates, the Six Perceptions open their passages, the body enters *Dongqing*, merging with the qi of nature. Preserve your years and life, and they may endure eternally.\"\n\nThe Celestial Worthy said: \"The North is *Dongwei* (Penetrating Subtlety), born of the Mysterious. Its wisdom is far-reaching, its insight profound, subtle yet penetrating the Real. It discerns the dark and light of sin and fortune, presiding over the origin of life. The hands emulate the Four Seasons, corresponding above to the Celestial Gate. As the Celestial Gate eternally turns, so too do the hands move. The hands possess a great spirit, receiving life and filling the directions, governing the Four Great Elements of humanity, observing human success and failure. If one does not uphold the precepts, wisdom remains obstructed. Without wisdom’s flow, the heart is agitated, and myriad evils arise. The hands act unconsciously, indulging in greed and theft, leading to a shortened life, failing to complete Heaven’s allotted years. Thus, these precepts are expounded to deliver celestial beings. To attain long life and transcend evil roots, one must receive these precepts, restraining the hands’ spirit. When wisdom illuminates, the heart naturally opens in clarity. The hands refrain from theft, evil roots do not arise, aligning with Heaven and following qi. The body enters nature, preserving your life to endure eternally.\"\n\n**Precepts of Wisdom, Virtue, and Retribution (Upper Grade)**\n\nThe Precepts state: Offerings and alms to the Three Treasures and divine scriptures—even a single coin—shall be repaid seventy-four myriadfold. Ten thousand coins or more bring boundless reward. One’s name is recorded among the heavens, the body ascends as a Ten-Times-Transmitted Disciple of the Most High, and the seven ancestors rise to become honored guests of the heavens.\n\nThe Precepts state: Offerings to Dharma Masters, Dharma robes, copying scriptures, and establishing quiet retreats—even a single coin—shall be repaid thirty-two myriadfold. Ten thousand coins or more bring boundless reward.",
      "overlap_context": "rally return, there will be no damage. Preserve your years and life, and they may become boundless.\"\n\nThe Celestial Worthy said: \"Earth is *Dongting* (Penetrating Hearing), its wisdom far-reaching. Thus, its resonance responds to Heaven above and pervades the four directions below, nothing unheard, nothing unperceived. Though called a single Penetration of wisdom, it encompasses the Five Sounds. Earth’s penetration is natural, giving rise to the Five Sounds, stable and unmoving, thus undamaged.\"",
      "start_char": 3832,
      "end_char": 4915,
      "start_sentence": 128,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.355292320251465,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞真智慧上品大诫.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "世世聪明，恒值明师，生於贵门，七祖皆为太上之宾。 诫曰：施散法师道士香油斋食，一钱以上，皆二十四万倍报，功多则报重。 世世丰有，恒无穷乏，七祖欢泰，恒食天厨。 诫曰：施散山栖道士，一钱以上，皆一十二万倍报，功多则报重。 世世恒值圣师，见道法教，七祖皆得五帝交游。 诫曰：施散清信弟子香烛斋食，一钱以上，皆三万二千倍报。 世世欢乐，不见诸苦，七祖上升天堂，逍遥无为，恒居福中。 诫曰：施散财宝，营造观宇，一钱以上，皆二万四千倍报，功多报多，世世贤明，玩好不绝，七祖皆得入元患之国#41。 诫曰：施散天人穷乏，一钱已上，皆一万二千倍报，功多报多。 世世富贵，欢乐无极，七祖皆受四方天厨，衣食自然。 诫曰：施散众生，损己饷食。 一钱已上，皆六千#42二百倍报。 世世子孙昌炽，门户兴盛，七祖#43免离地狱，上升自然福中。 天尊告太上道君曰：智慧#44上品功德之诫，天人男女，有发自然道意，损己布散，开张福田，功德甚重。 施一之功，数万之报。 报#45应之理，明如日月，或在见世、或在来生，但福报差移，不必同至。 其中或有计功补过，或以德赎罪，或为祖世拔诸刑责，是致报应，不即明显。 三官九府，记人功过，毫分不失。 或先罪已除，身不犯过，后功未明，与凡不异。 此由己身受生日克，应诸天解度，然后福报。 虽尔推移，七祖魂神，已升天堂，福会於后，万无差错。 明告男女，令知报应，天道不虚，善心信向，勤行勿懈，克得开度，受福无穷也。 天尊告太上道君曰：诸天上圣、至真大神、诸天帝王，及已过去尘沙之辈，得道之者，莫不由施散布德，作诸善功，功满德足，以致善报，轮转不绝。 皆得道真，超陵三界，逍遥上清大罗之天，玉京玄台七宝林中。 此时皆知施功不失，欢乐自然，世世无量，所施盖微，福庆无极。 末世伪薄，人情悭贪，唯知聚积，为己重担，莫能发心，作此功德。 功既无积#46，罪秽日生，长远福堂，沉沦罪门，展转五道八难之中。 一失#47福世，无有还期，男女相牵，莫识宿命所从而来，见其魂神，甚可痛伤。 今为诸天，说是禁诫，咸令男女，普闻法音，开度群生，使入福中。 天尊言：我历观诸天地狱之中，男女责作幽牢穷魂，莫非先身不见明诫，见而不行，或行而不遵，回生悔心，还入罪门，或生而犯恶，不遇善缘，或不知施散，发心建功，广作福田，以拔宿根。 唯知作罪，流曳三涂八难之中。 念其愚痴，甚可哀伤。 故说是诫，开度天人，咸使男女，普闻法音，知发道心，建立善功，以拔诸苦，与道为缘，咸得欢泰，逍遥自然。 太上道君受诫於元始天尊，开度诸天，四方边土，功德成就，以传诸天#48天王、十方大圣、太微帝君、四极真人、东华宫中#49方诸大神、玉女群仙，普使宣通，济度来生，令闻法音。 是时诸天莫不欣喜，善哉善哉。 太上洞真智慧上品大诫#50竟 #1 按此经名，《道藏》本原误作「太上洞真智慧上品大诚」。 今据敦煌本改题「太上洞玄灵宝智慧上品大诫」。 敦煌本「诫」字下又有「第四」二字，删去。 #2 察：原作「郁剎」，据敦煌本改。",
      "translated_text": "**Generation after generation, they shall be wise and bright, ever encountering enlightened masters, born into noble houses, and their seven ancestors shall all become honored guests of the Most High.**\n\nThe Precepts state: Offerings of incense, oil, vegetarian meals, and alms to Dharma Masters and Daoist priests—even a single coin—shall be repaid twenty-four myriadfold. The greater the merit, the weightier the reward. **Generation after generation, they shall abound in wealth, never suffering want, and their seven ancestors shall rejoice in peace, ever feasting from the heavenly kitchens.**\n\nThe Precepts state: Offerings to mountain-dwelling Daoist priests—even a single coin—shall be repaid twelve myriadfold. The greater the merit, the weightier the reward. **Generation after generation, they shall ever encounter sagely masters, behold the teachings of the Dao and its laws, and their seven ancestors shall all become companions of the Five Emperors.**\n\nThe Precepts state: Offerings of incense, candles, vegetarian meals, and alms to devout disciples—even a single coin—shall be repaid thirty-two thousandfold. **Generation after generation, they shall know joy, encounter no suffering, and their seven ancestors shall ascend to the heavenly halls, carefree and unbound, ever dwelling in blessings.**\n\nThe Precepts state: Donations of wealth to construct or repair abbeys and temples—even a single coin—shall be repaid twenty-four thousandfold. The greater the merit, the greater the reward. **Generation after generation, they shall be wise and virtuous, their pleasures unending, and their seven ancestors shall all enter the Realm of Primordial Joy.**\n\nThe Precepts state: Alms to the destitute among heavenly beings and mortals—even a single coin—shall be repaid twelve thousandfold. The greater the merit, the greater the reward. **Generation after generation, they shall be rich and noble, their joy boundless, and their seven ancestors shall all receive sustenance from the four directions’ heavenly kitchens, their clothing and food naturally provided.**\n\nThe Precepts state: Offerings to all beings, sacrificing one’s own provisions to feed others—even a single coin—shall be repaid six thousand two hundredfold. **Generation after generation, their descendants shall flourish, their households prosper, and their seven ancestors shall escape the hells, ascending into the blessings of the natural realm.**\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: \"The Precepts of Wisdom and the Upper Grade of Merit and Virtue—when men and women of heaven and earth awaken the natural intent of the Dao, sacrifice their own resources, and expand the fields of blessings, their merit is most weighty. The merit of a single offering brings a reward of ten thousandfold. The principle of karmic retribution is as clear as the sun and moon, whether manifest in this life or the next. Yet the timing of blessings may vary, and they need not arrive simultaneously. Some may calculate merit to offset transgressions, or use virtue to redeem sins, or liberate their ancestors from punishments—such retributions may not be immediately apparent. The Three Officials and Nine Bureaus record the merits and transgressions of all, with not even the smallest fraction lost. Though one’s sins may have been erased and no further transgressions committed, if later merits remain unmanifested, they may appear no different from the ordinary. This arises from the constraints of one’s birth destiny, awaiting the heavens’ deliverance before blessings unfold. Even so, the souls of the seven ancestors shall have already ascended to the heavenly halls, and the convergence of blessings thereafter shall be without error. Clearly proclaim this to men and women, that they may know karmic retribution is no empty truth. With sincere faith and diligent practice, unwavering in effort, they shall attain deliverance and receive boundless blessings.\"\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: \"All the sagely beings of the heavens, the perfected and great divinities, the heavenly kings, and the countless past multitudes who attained the Dao—none failed to do so through almsgiving, spreading virtue, and performing myriad good deeds. When merit is fulfilled and virtue complete, good retribution follows, ceaseless in its turning. All shall become perfected beings of the Dao, transcending the Three Realms, carefree in the Great Canopy of the Upper Clarity and the Heaven of Great Network, amidst the Seven Jeweled Forests of the Jade Capital and Mystic Terrace. Then shall they know that no act of merit is ever lost, their joy natural and measureless, their blessings infinite for all generations. Yet in this degenerate age, human nature is stingy and greedy, knowing only how to hoard, burdening themselves with wealth, unable to awaken the heart to perform such meritorious deeds. Without accumulated merit, defilements and transgressions grow daily, and the halls of eternal blessings sink into the gates of sin. They shall revolve endlessly through the Five Paths and Eight Difficulties. Once the blessed realm is lost, there shall be no return. Men and women shall drag one another along, unaware of their past lives’ origins, and the sight of their souls shall be most pitiable. Now, for the sake of all heavens, I proclaim these prohibitions and precepts, that all men and women may universally hear the Dharma’s sound, be delivered from the multitudes, and enter into blessings.\"\n\nThe Heavenly Worthy said: \"I have surveyed the hells beneath the heavens and earth, where the souls of men and women toil in dark prisons—none were not those who, in past lives, either failed to encounter these luminous precepts, or having encountered them, did not practice them, or practiced them without devotion, later regretting and returning to the gates of sin. Some were born into evil, never meeting good conditions, or unaware of almsgiving, never awakening the heart to establish merit, broadly cultivate fields of blessings, and uproot karmic roots. Knowing only how to commit transgressions, they drift through the Three Wretched Paths and Eight Difficulties. Pitying their ignorance, I grieve for them. Thus, I proclaim these precepts to deliver the heavenly and mortal realms, that all men and women may universally hear the Dharma’s sound, awaken the heart of the Dao, establish good deeds, uproot all suffering, and form affinities with the Dao. All shall know joy and peace, carefree and natural.\"\n\nThe Most High Lord of the Dao received the precepts from the Primordial Heavenly Worthy, delivering them to all heavens, the four directions, and borderlands. When the merit was accomplished, they were transmitted to the Heavenly Kings of all heavens, the Great Sages of the Ten Directions, the Celestial Lord of the Grand Tenuity, the Perfected of the Four Poles, the Great Divinities of the Eastern Florescence Palace, the Jade Maidens and hosts of immortals, that all might propagate them and save future generations, allowing them to hear the Dharma’s sound. At that time, all the heavens rejoiced, saying, \"Excellent! Excellent!\"\n\n**The Upper Grade Precepts of Wisdom from the Most High Cavern of Mystery and Numinous Treasure thus concludes.**",
      "overlap_context": "—shall be repaid seventy-four myriadfold. Ten thousand coins or more bring boundless reward. One’s name is recorded among the heavens, the body ascends as a Ten-Times-Transmitted Disciple of the Most High, and the seven ancestors rise to become honored guests of the heavens.\n\nThe Precepts state: Offerings to Dharma Masters, Dharma robes, copying scriptures, and establishing quiet retreats—even a single coin—shall be repaid thirty-two myriadfold. Ten thousand coins or more bring boundless reward.",
      "start_char": 4915,
      "end_char": 6154,
      "start_sentence": 167,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.721094608306885,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞真智慧上品大诫.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "#3 诫：原作「诚」，据敦煌本改。 按《道藏》 原本中「诚」字，敦煌本多「诫」。 后文均据敦煌本改，不复出校记。 #4 勿得：原作「母生」，据敦煌本改。 #5 推让：敦煌本作「让义」。 #6 减酒：敦煌本作「断酒」。 #7 评论：敦煌本作「评详」 。 #8 「为」字据敦煌本补。 #9 恒：原作「敬」，据敦煌本改。 #10 托生：敦煌本作「堕生」。 #11 友：原作「女」，据敦煌本改。 #12 独超：敦煌本作「独步」。 #13 万神：敦煌本作「神明」。 #14 端坐：原作「端正」，据敦煌本改。 #15 宜：原误作「冥」，据敦煌本改。 #16#19  归：原作「皈」，据敦煌本改。 #17 飞天：敦煌本作「飞仙」。 #18 「行」字据敦煌本补。 #20 敦煌本无「隆盛」二字。 #21 「可」字据敦煌本补。 #22 亡睛失瞳：敦煌本作「忘精失童」。 #23 渍溃：敦煌本作「愤溃」。 #24 洞：原作「同」，据敦煌本改。 #25 施惠：原作「施慧」，据敦煌本改。 #26 饲：原作「饴」，据敦煌本改。 #27 神王：敦煌本作「圣王」。 #28 妙义：敦煌本作「妙迹」。 #29 静舍：敦煌本作「静观」。 #30 容眸：敦煌本作「容眸」。 #31 不懈：敦煌本作「十诫」。 #32 敦煌本此二句作：「生诸善心，体洞六慧」。 道本原作「生诸善念，心体六惠」。 今改「惠」字为「慧」。 #33 令通：敦煌本作「六通」。 #34 智慧远闻：原作「智远慧闻」，据敦煌本改。 #35 飞扬：原作「飞歙」，据敦煌本改。 #36 「耳」字据敦煌本补。 #37 甘其：敦煌本作「和甘」，近是。 #38 和香：原作「知香」，据敦煌本改。 #39 恬夷：原作「怡夷」，据敦煌本改。 #40 「天」字据敦煌本补。 #41 按「诫日」以下四十二字，据敦煌本补。 #42 六千：原作「七祖」，据敦煌本改。 #43 七祖：原作「六千」，据敦煌本改。 #44 智慧：原作「智惠」，据敦煌本改。 #45 「报」字据敦煌本补。 #46 无积：敦煌本作「无誉」。 #47 失：敦煌本作「跌」。 #48 诸天：敦煌本作「文始」。 #49 敦煌本「中」字下有「十」字。 #50 尾题据敦煌本改。",
      "translated_text": "**The Upper Grade Precepts of Wisdom from the Most High Cavern of Mystery and Numinous Treasure**\n\n---\n\n**Precept Three:**\nDo not covet wealth or property, nor hoard goods for personal gain. Do not seize what others cherish, nor take by force what is not yours. Do not scheme to acquire what belongs to others, nor envy those who possess more. Do not obstruct the flow of generosity, nor hinder the circulation of blessings. Do not refuse to yield or defer to others, nor withhold aid from those in need. Do not indulge in excessive drink, nor allow intoxication to cloud the mind. Do not engage in frivolous disputes or contentious speech, nor provoke strife with harsh words. Do not harbor resentment or bear grudges, nor allow anger to fester within. Do not cling to past grievances, nor seek vengeance for old wrongs. Do not deceive or mislead others, nor distort truth with falsehood. Do not slander the virtuous, nor praise the wicked. Do not associate with the unprincipled, nor befriend those who lack integrity. Do not abandon the Way for worldly gain, nor forsake the Dao for fleeting pleasures. Do not pursue fame or status, nor crave admiration from others. Do not boast of your virtues, nor flaunt your achievements. Do not seek to outshine others, nor strive to surpass all in glory. Do not neglect the cultivation of the Dao, nor abandon the practice of virtue. Do not fail to honor the Perfected, nor disregard the teachings of the sages. Do not sit improperly, nor recline in a slovenly manner. Do not neglect proper attire, nor appear disheveled before others. Do not speak carelessly, nor utter words that sow discord. Do not indulge in idle chatter, nor engage in gossip or slander. Do not listen to lewd or vulgar speech, nor delight in obscene songs. Do not gaze upon improper sights, nor let your eyes wander licentiously. Do not dwell in impure places, nor frequent unwholesome environments. Do not associate with those who defile the Dao, nor consort with the wicked. Do not allow your heart to be swayed by external temptations, nor let your mind be disturbed by worldly affairs. Do not neglect the recitation of scriptures, nor fail to meditate upon the Dao. Do not abandon the practice of stillness, nor forsake the cultivation of emptiness. Do not cling to sensory pleasures, nor indulge in excessive desires. Do not allow your thoughts to scatter, nor let your spirit dissipate. Do not neglect the refinement of qi, nor fail to harmonize the Three Treasures. Do not disrupt the natural order, nor obstruct the flow of the Dao. Do not harm living beings, nor take life without cause. Do not steal or misappropriate, nor covet what is not yours. Do not engage in sexual misconduct, nor indulge in lustful thoughts. Do not speak falsely, nor deceive with cunning words. Do not consume intoxicants, nor cloud your mind with substances. Do not be stingy or withhold generosity, nor refuse to share with those in need. Do not hoard wealth, nor cling to material possessions. Do not neglect filial piety, nor fail to honor your parents. Do not abandon your teachers, nor forget the debt of gratitude. Do not betray your friends, nor sever bonds of trust. Do not neglect the suffering of others, nor turn away from those in distress. Do not fail to repay kindness, nor forget the favors you have received. Do not accumulate wealth without purpose, nor squander it recklessly. Do not lose the Way through negligence, nor stray from the path of virtue. Do not forget the teachings of the sages, nor abandon the precepts of the Dao. Do not allow your heart to be swayed by external phenomena, nor let your spirit be bound by worldly attachments. Do not neglect the cultivation of wisdom, nor fail to refine your inner power. Do not allow your mind to be scattered, nor let your thoughts wander aimlessly. Do not indulge in excessive sleep, nor waste time in idleness. Do not neglect the practice of stillness, nor abandon the cultivation of clarity. Do not allow your qi to stagnate, nor let your spirit grow sluggish. Do not harm the natural world, nor disrupt the balance of Heaven and Earth. Do not pollute the rivers and mountains, nor defile the sacred lands. Do not kill or harm animals without cause, nor destroy the homes of living beings. Do not uproot plants or trees without purpose, nor cut down forests recklessly. Do not neglect the suffering of all beings, nor turn away from their cries for help. Do not fail to practice compassion, nor withhold kindness from any creature. Do not allow your heart to harden, nor let your spirit grow cold. Do not neglect the recitation of sacred texts, nor fail to honor the Perfected Ones. Do not abandon the practice of virtue, nor forsake the path of the Dao.\n\nIf you uphold these precepts with sincerity, your eyes will be bright and clear, your ears sharp and keen. Your mouth will savor the sweetness of the Dao, and your nose will detect the fragrance of virtue. Your body will be light and agile, and your spirit will soar freely. Your wisdom will spread far and wide, and your name will resound throughout the heavens. The gods and immortals will rejoice, and the flying transcendents will descend to welcome you. The divine kings will protect you, and the sages will guide your steps. Your parents and ancestors, spanning six thousand generations, will ascend to the heavens, and your seven generations of forebears will be liberated from suffering. Your wisdom will illuminate the darkest realms, and your virtue will transform all beings. You will repay the kindness of Heaven and Earth, and fulfill the debt of gratitude to your teachers. You will accumulate no ill repute, nor stumble on the path of the Dao. You will ascend to the ranks of the Perfected, and join the assembly of the immortals. The myriad gods will bow before you, and the Three Clarities will bestow their blessings. Your name will be inscribed in the registers of the heavens, and your merit will endure for eternity.\n\n**The Upper Grade Precepts of Wisdom from the Most High Cavern of Mystery and Numinous Treasure thus concludes.**",
      "overlap_context": "s, the Great Sages of the Ten Directions, the Celestial Lord of the Grand Tenuity, the Perfected of the Four Poles, the Great Divinities of the Eastern Florescence Palace, the Jade Maidens and hosts of immortals, that all might propagate them and save future generations, allowing them to hear the Dharma’s sound. At that time, all the heavens rejoiced, saying, \"Excellent! Excellent!\"\n\n**The Upper Grade Precepts of Wisdom from the Most High Cavern of Mystery and Numinous Treasure thus concludes.**",
      "start_char": 6155,
      "end_char": 7172,
      "start_sentence": 207,
      "end_sentence": 257,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.97561836242676,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞真智慧上品大诫.txt",
        "category": "戒律类"
      }
    }
  ]
}