{
  "source_id": "太上黄庭中景经",
  "source_file": "chunked_daozang\\太上黄庭中景经.json",
  "total_chunks": 12,
  "total_original_chars": 8949,
  "total_translated_chars": 53574,
  "total_translation_time": 269.22570276260376,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Yellow Court Scripture of the Central Radiance**\n\n**Scripture Title:** *The Supreme Yellow Court Scripture of the Central Radiance* (*Taishang Huangting Zhongjing Jing*). Also known as *The Yellow Emperor’s Yellow Court Scripture* (*Huanglao Huangting Jing*). Originally annotated by Li Qianlai, Perfected of Primordial Destiny of the Supreme Clarity. One scroll. Base text from *The Orthodox Daoist Canon*, First Section of the Orthodox Corpus.\n\n**The Supreme Yellow Court Scripture of the Central Radiance**\nAnnotated by Li Qiancheng, Perfected of Primordial Destiny of the Supreme Clarity\n*The Yellow Emperor’s Yellow Court Scripture*\n\nThe *Scripture of the Grotto Chamber* states: \"Humans possess a great chamber, the central hall of the Yellow Court, wherein dwells the Yellow Venerable Lord—this is the Primordial Beginning.\"\n\nThe *Record of Mount Tortoise* states: \"The Yellow Venerable Lord governs transformations in the Golden Pearl Palace of the Supreme Clarity.\"\n\n\"Yellow\" signifies the color of central rectitude. \"Court\" denotes the center of the four directions. Externally, it corresponds to the center of heaven and earth, above the clouds and mist; internally, it resides within the brain, amidst the heart, liver, and spleen. Those who cultivate the Dao refine and preserve form and spirit, achieving transcendence and feathered transformation to attain longevity, surpassing the bounds of the celestial net. Thus, it is called the Yellow Court.\n\nContemplate the celestial deities upon my crown,\nThe qi of the Three Origins descending to generate the twenty-four luminous spirits,\nBorn within the upper grotto-heaven of the human body.\nOne radiance gives rise to the palace of the brain-spirit, wherein resides primordial qi.\nThe human brain has nine petals, within which nine perfected beings are born,\nAll arrayed in their proper stations, encircling the cinnabar field,\nTheir faces outward to repel inauspicious influences.\nThe Supreme Perfected face upward, the Lofty Perfected southward,\nThe Grand Perfected eastward, the Spirit Perfected westward,\nThe Mysterious Perfected northward.\n\nThe *Key to the Conduct of the Twenty-Four Spirits* states: \"The brain-spirit resides in the nine palaces of the head, precisely within the ninefold center, amid the brain’s marrow. Its form is one cun and one fen in length, five and a half fen in height, seated facing outward to guard the spirit of the cinnabar field.\"\n\nThe hair is as the stars, myriad in strands.\nThe hair-spirit is named Mysterious Father Hua, styled Dao-Wei,\nTwo cun and one fen in length, of true mysterious color,\nResiding within the flesh, outside the marrow, circulating through the hair’s roots,\nCentered upon the crown.\n\nAmong the ten thousand things, humans are the most noble.\nWithin a single form, heaven and earth are encompassed,\nAs are the sun, moon, and stars, the altars of soil and grain, hardness and softness—\nNothing is not modeled upon them.\nThus, the Son of Heaven is established,\nWith the Three Dukes, Nine Ministers, Twenty-Seven Grand Masters, Eighty-One Primary Officers,\nOne hundred twenty commanderies, one thousand two hundred counties,\nEighteen thousand townships, thirty-six thousand village chiefs,\nAnd eighteen marquises.\nThere are also the spirits of palaces, residences, gates, doors, wells, and stoves.\n\nThose who partake of food and drink yet know cultivation shall attain longevity.\nThus, the head is round, symbolizing heaven; the feet are square, symbolizing earth.\nThe hair is as the stars, the eyes as the sun and moon,\nThe brows as the Northern Dipper, the ears as the altars of soil and grain,\nThe teeth as jade and stone.\n\n\"Giving\" means governance.\nThe hair’s first branching is one, then the spirit is stored.\nCoiled and winding, its light is as dark mystery,\nTwisting and turning, coiled and knotted, the hair is combed yet the topknot remains undone.\n\nThe face possesses the divine court.\nThe topknot is the flower of the brain.\nWhen the heart grieves, the hair withers.\nWhen the marrow is full and the bones firm, essence and qi are not leaked.\n\nThe center of the crown is called \"Communing with Heaven,\"\nOne cun within the hairline, the crown is named \"Communing with Heaven,\"\nThe dwelling of the abiding spirit.\n\nThe *Scripture of the Dao and Its Virtue* states: \"The demeanor of the aperture of virtue is only that which follows the Dao.\"\nIt is the gate of the myriad mysteries.\n\nThe harmonious qi of the celestial stars emerges from here.\nThe head is the Three Terraces; the Nine Perfected Lords of the celestial stars reside above it.\nNurturing the human bones and marrow, it permeates the numinous root.\nThe Crimson Palace’s threefold radiance converges to nourish the human true self.\nThe numinous root is the tongue—this is the root of the numinous.\n\nBelow, it harmonizes the Six Palaces and connects the Five Offices.\nThe intestines, stomach, large and small intestines, bladder, and Triple Burner are the Six Palaces;\nThe heart, liver, lungs, spleen, and kidneys are the Five Offices.\nIt dispels malign qi, expelling it through the navel gate.\n\nThe lower cinnabar field enters the root of life,\nThe foundation of essence and spirit,\nThe gate that severs the five qi and divides yin and yang.\nIn the morning, it nurtures the jade countenance; by dusk, it becomes the qi of foul dregs.\n\nNext, contemplate the division of black and white in the two eyes.\nThe eyes are the bright mirrors of the body.\nThe incantation of Lady Lin states: \"The eye-lads of the three clouds, the two eye Perfected Lords.\"\nThe *Purple Book of the Cinnabar Script* states: \"Constantly storing the three spirits within the eyes, uniting with the true and looking inward, one shall see the five viscera and intestines. Prolonged practice leads to transcendence.\"\n\nThe left eye stores the celestial deity of the sun.\nThe left eye symbolizes the sun; the spirit is named Supreme Clarity, styled Yingxuan, also called Flying Numinous.\nIts form is one cun in length, clad in vermilion and mystery.\nTwelve spirit maidens encircle its four sides.\n\nThe right eye stores the Great One of the moon.\nThe right eye symbolizes the moon; the spirit is named Great One, styled Chenying, also called Bright Pearl.\nAt cockcrow, store the green qi from the east as it comes from the moon,\nFilling the Mud Pill,\nWithin which green smoke arises, then emerges from the eyes in a dense cloud,\nTransforming into two youths clad in azure, like infants in form.\nThe spirit is one cun in length.\n\n\"White-clasped\" denotes plain white robes. The twelve spirit maidens encircle and return. The twelve spirit maidens of the left eye and the twelve perfected ones encircle and sit in guard of the eye. The sun and moon are three *cun* apart—this \"white moon\" refers to the two eyes, which are three *cun* distant from each other. Within them, the Seven Governors of the Northern Dipper are arrayed. Visualize the Seven Stars of the Northern Dipper as the Celestial Ministers of the Central Palace, the Celestial Ministers of the Mysterious Palace. The Mysterious Palace extends straight upward from the bridge of the nose to the hairline, five *cun* in height. At midnight, face east, sit upright, and loosen the hair. Invoke the Three Perfected Ones of the Upper Prime, the Great Faces of the Perfected within the Prime, each with their own gates and chambers. The Seven Governors resemble the Purple Chamber of the North Pole. The perfected ones and spirits upon the face all occupy their proper positions—this is like gazing upon the Jade Tower of the Purple Chamber of the North Pole. Above it resides the Primordial One, the Lord of the Five Flowers. The Primordial One and the Five Flowers are the spirits of the five viscera. Atop the head, they dwell like a round platter—this is the Great One in the head, for the head follows the pattern of Heaven. The round platter signifies firmness. The form is seven *cun* in length, a spirit of transformation.\n\nThe ears resemble the ceaseless emptiness of day and night, ever-attuned. In cultivating the Dao, one must first ensure the eyes are bright and the ears keen—these are the masters of one’s affairs. Ears and eyes serve as the ladder to seek the perfected and the gates to gather the numinous. The eyes should be frequently pressed and soothed on both sides, yet not excessively, to sharpen perception and clarity. Thus does one govern the city walls, inscribed in the registers of the Jade Emperor.\n\nWithin lies the Yellow Court, master of the Gate of Hearing—the Yellow Court being the perfected one within the brain. When celestial spirits descend, they appear like cinnabar red. The Nine Perfected descend into the chamber of the brain. *Dan* signifies the immortal’s raiment. It measures three *cun* in length, crowned with azure-green silk.\n\nThe ear spirit is named Jiao Nü, also called Kong Xian, with the style You Tian. Its form spans three *cun*, wearing an azure-green silk cap. It ever resides above the nose, awaiting the hundred spirits. The *Scripture of the Great Cavern* states: the nose spirit is named Shan Yuan, also called Gui Jing. It embodies the Three Primes’ mountain peaks, able to await the myriad spirits and serve as the arbiter of the true and the deviant.\n\nRecite: \"May the nose be unobstructed, fragrant as incense,\" to draw the numinous into the body and harmonize the hundred spirits. Within dwells one clad in golden yellow—the perfected one of the nose, robed in golden immortal garb. The spirit measures two *cun* in length, emerging to reside within the person.\n\nThe clear and void spirit-qi abides at the center—the nose’s peak, situated centrally, internally connecting the brain’s twin apertures. The qi of the Cinnabar Field’s purity and truth serves as the capital of the true and the deviant, the martial ford of the body’s pathways. First, seal the mountain source and ghost well, so that regrets and misfortunes remain unmoved—thus attaining long life without hindrance.\n\nEnable me to be unconfused and know the four directions. Through fasting and vigilance, constantly reforming the barbarian heart’s attachments, one stands unconfused. The ears, nose, and tongue each occupy their place, serving as the four directions.\n\nRecite: \"May the mouth be vast and red as a square,\" containing qi and nurturing essence. The *Book of Changes* says: \"Observe my chewing, seeking sustenance from the mouth.\" Let jade liquid surge like golden grain—the mouth’s saliva is jade liquid; abstaining from the five grains, one imbibes wind and drinks dew. *Golden grain* signifies the appearance of one who drinks not.\n\nThe spirit spans seven *cun*, red as strength—the perfected one within the mouth is named Chi Xu Zhang Ren, with the style Su Ming. It resides below the Mysterious Portal, its form seven *cun* and one *fen* in length, three *cun* and a half in height, facing outward, clad in red robes. *Strength* denotes firmness and vigor. Left and right, it turns to absorb jade nectar.\n\nTurning and revolving, ever returning—within lies the perfected one, who draws in the vital fluids, coming and going without weariness. Like the Dipper’s iron core receiving the four directions, the perfected one bears the vessel, warding off evil in form. *Core* is the instrument for harmonizing the spirit.\n\nThose who study the Dao must first restrain the hun and po souls, dispelling the corpse-demons. On the last day of the lunar month, the days of *gengshen* and *jiayin*, purify yourself and enter the chamber. With cinnabar brush, mark beneath the left eye’s corner; with realgar brush, mark beneath the right nostril, allowing a small amount to enter the valley. Then, softly recite the incantation, strike the teeth thrice, swallow saliva three times, and with the left hand’s second finger press beneath the right nostril, the right hand’s second finger beneath the left eye—seven times each, pressing firmly without lifting the hands. Thus is the rite complete.\n\nThese two points are the gateways of the three *hun* and seven *po*, the bridges that annihilate essence-demons. Thus the essence of cinnabar and realgar blocks the path of corpse-demons. This is the supreme method of the Great Ultimate. Practicing it harmonizes the *hun* and *po* with qi, scatters corpse-filth, and severs impurity. The spirit becomes penetrating and clear; after three years of practice, lustful thoughts vanish entirely, the four limbs remain free of illness, and one attains longevity.\n\nThe spirit is three *cun* in length, clad in dark yellow. The spirit in the brain’s first node dwells within the bone, three *cun* in length, one *cun* and seven and a half *fen* in height, seated facing outward. Its divine maidens occupy the eastern and western chambers—within the body, all possess male and female perfected lords, arrayed in the positions of yin and yang. The chambers, left and right, are the Cavernous Palaces and Hall of Light; the perfected one resides at their center, their positions aligned in mutual regard.\n\nThey uphold the Yellow Spring and the five flavors’ longevity. The Yellow Spring lies below the chin and above the throat. The five flavors enter, chewed and swallowed, all sustained by the perfected one. This Dao is wondrously divine, its edge keen—naturally possessing numinous efficacy. *Keen edge* signifies a sharp instrument.\n\nThe Dao by which humans are born, the spirit by which they are nurtured—imbibing the numinous and receiving clarity, the body is thus formed. The common people use it daily yet remain unaware; the myriad things obtain it yet do not perceive it. Concealed within, it operates unseen, or shines without fixed direction.\n\nThe spirit is seven *cun* in length, clad in cinnabar red. Seven *cun* in length, it resides within the Jade Pillow’s brain, the inner gate of marrow and fat, seated facing forward in red garments. The host of spirits transforms and nourishes the Five Constants. The perfected one is the lord of the host of spirits and the Five Constants of yin and yang. *Host* denotes the multitude. *Nourishes* means to engender—the perfected one transforms and nurtures the human body.\n\nThe Great Tube flourishes, commanding the upper region. The Great Tube is the Mysterious Gullet, beneath the tongue and above the throat, also called the Lower Tube, receiving the upper and lower gullets. This tube receives essence and flourishes, eight *cun* in length—hence *flourishes*. Knowing the tongue’s Dao, life remains unceasing. The tongue is the dragon’s mechanism of the *Wu Ying*—if one cultivates it, one attains longevity.\n\nThe tongue’s root has jade branches, red as cinnabar. *Jade branches* is the tongue’s name—if one employs its mechanism, it can dissolve hardness and softness. It governs the discernment of flavors and the flow of sweet springs. The tongue is the heart’s official; when the tongue is harmonized, it distinguishes the five flavors. *Sweet springs* refers to saliva.\n\nBelow, contemplate the throat’s twelve rings. The throat spirit is named *Hu Ze*, the path of true qi and the source of vital fluids, also called the *Chong Tang*, located beneath the chin—hence *below*. The Crimson Palace’s twelve-tiered tower corresponds externally to the twelve hourly guardians. From below, it channels the flow between the two breasts. The two breasts are named Heavenly Storehouse, where the Jade Hall perfected one resides.\n\nWithin are the yin-yang immortal husband and wife. The left breast belongs to yang, where the male perfected one dwells; the right breast belongs to yin, where the female perfected one resides. Each is eight *cun* in length, four *cun* in height, seated facing one another—like humans facing each other, hence *husband and wife*. They wield jade halberds at the four directions’ borders. *Wield* means to grasp—the jade halberds are like the perfected ones guarding the throat. The four directions refer to the chest’s diaphragm, above and below, within and beyond the breasts.\n\nFood and drink do not burden the great, allowing return. Once the upper burner is unobstructed, water and grain do not accumulate, returning to the lower origin. Contemplate the lungs’ five lobes, radiant as jade. Among the five viscera, the lungs rank highest, opposite the chest, with five lobes like gauze veiling the valley.\n\nPale blue-white, gleaming like frost and ice. *Gleaming frost and ice*—the lungs govern the west, the true position of metal. The *Zou Zhen* covers the heart, guarding the four directions. The lungs lie above the heart—hence *covers*. *Zou* are immortal soldiers; *guards* means to be near. The lung’s four lobes hang near the heart—hence the four directions.\n\nAbove is the Mysterious Youth, radiant as moonlight. The lung spirit is named *Hao Hua*, styled *Xu Cheng*, residing within the lungs. The spirit is four and a half *cun* in length, clad in white, seated facing the Dipper. *Moon* is yin essence—the lungs govern yin, like moonlight. The true essence is the canopy’s inner brilliance. The lungs are the heart’s flowery canopy, above the liver—hence *brilliance*.\n\nThe lungs are hollow and empty, moving above and below. The lungs are the palace of the *hun* and *po*; the *hun*’s nature is ethereal and floating. The nose connects to heavenly qi, its five lobes hanging to veil the inner orifices, corresponding in movement above and below. As vast as a sharp aperture, it connects to the Great Constant. Preserving qi ensures communion with the spirit; preserving essence ensures spirit clarity. The lungs’ body is light and floating, its hidden apertures internally linked—qi’s coming and going naturally ascends and descends.\n\nIf exhausted, the Dao’s envoys perish. When the six palaces are harmonized, the spirit remains; when the three regions are unsettled, my true ones must disperse.\n\n\"Enjoy\" is pronounced with a departing tone. When severed, it leaves no room for the myriad spirits to prosper—when the Dao departs, the person dies; when the water dries, the fish perish. If the myriad spirits scatter, how can one not perish?\n\nTo cultivate one’s nature, examine the subtleties of breath. Cultivating the body and nurturing one’s nature—closing the breath is called \"refining qi,\" also named \"embryonic breathing.\" From midnight to noon is the time of generative qi; from noon to midnight is the time of destructive qi. Always practice during the time of generative qi: lie supine or prone, close the eyes, clench the fists, and hold the breath without exhalation at the center until one hundred twenty counts, then release it from the mouth, gradually increasing the count each day. Thus, the body’s spirits will manifest, and the five viscera will be at peace. After two hundred fifty days, the spirits of the Crimson Palace will guard, the Mud Pill will remain full, and the Cinnabar Field will flourish. After three hundred days, the flowery canopy will naturally brighten, and the entire body will be free of illness.\n\nThe method of guiding the breath: neither cold nor heat accumulates, water and grain pass without stagnation. In one day and night, there are thirteen thousand five hundred breaths. If one practices this for a thousand days, one can nourish the entire body. When primordial qi is complete, there is no passage that is not open, no pulse that is not harmonized, no accumulation that does not disperse.\n\nRaising the head and contracting the nose, the qi ascends. The turtle’s guidance: retracting the head and containing the breath, essence and qi descend. The snake’s guidance: coiling without straightening, the qi ascends and circulates. The human’s guidance: closing the mouth and gently breathing, qi enters the Cinnabar Field. By mastering exhalation and inhalation, the true spirits are internally perfected, ascending to the Purple Clarity—this is governed by the regulation of breath.\n\nAbove, the flowing spirits manifest in five forms. The flowing spirits are the luminous spirits of the five viscera.\n\nWhen manifest, by careful contemplation and reflection, their forms become clear.\n\nThe Wind Lord and Rain Master regulate yin and yang:\nThe Wind Lord is named Bijun, styled \"Long Abstinence\";\nThe Rain Master is named Fengxiu, styled \"Bantu.\"\nWithin the human body, they reside in the brain’s \"Temple of the Mind\";\nat the nape, they are called \"Minister\";\nat the spleen’s tip, \"Grain\";\nin the large intestine, \"Wind Lord\";\nand beside the navel, \"Rain Master.\"\n\nThe *Book of Changes* states: \"The alternation of yin and yang is called the Dao.\"\nNearly, we draw from the body; distantly, from all things.\nThe *Nanhua Sutra* says: \"Heaven is within man; earth is within man.\"\nEncompassing the myriad things, the mysterious workings naturally reside in the body.\n\nFu Xi and Nü Wa may endure or perish—\nFu Xi, sovereign of the Three August Ones;\nNü Wa, ruler of high antiquity.\nBoth established reforms and innovations, founding the origins of governance.\nWithin the three offices and five viscera of man, these sovereigns reside.\nThe stomach, the Great Granary, is the transmitted palace of the Three Sovereigns and Five Emperors.\n\nThe lungs connect to the White Flower’s Yin Land—\nThe lungs govern the region of Yongzhou and preside over the Western Marchmount, Mount Hua.\nThey emerge riding white tigers, borne upon wind and rain.\nThe lung spirit manifests externally as the White Tiger.\nThe *Great Cavern Scripture* states: \"The Lung Lord is the White Prime Lord.\"\nDwelling in the Cavern Chamber Palace, he rides forth on a white tiger or upon white qi,\nattended by the Grand Harmony Lord and twenty-six hundred riders.\n\nThe heart, a purple span of five inches, tapers downward—\nThe heart is the Emperor Lord, situated below the lungs and above the liver,\nopposite the point one inch below the coccyx.\nThe heart, also called the Crimson Palace, governs the entire body,\noverseeing all beings, directing the breath of every spirit without fail.\nIts tapering form is the heart’s aperture, through which the myriad spirits enter and exit in response to the eight trigrams.\n\nNurtured like the numinous root supporting the center—\nThe numinous root is the root of life, irrigated by jade liquid transformed into pure water.\nIf one can cultivate the three inches, the heart abides long in the center.\n\nA luminous pearl, red and white as sunlight—\nThe luminous pearl is the heart’s essence,\nits complexion like unbleached silk suffused with crimson.\n\nWithin, three apertures glow resplendently—\nThe heart possesses three apertures through which essence and qi flow.\n\"Resplendently\" describes their radiant expansion.\n\nA thousand chariots assemble at dawn in the Hall of Light—\nThose who cultivate the Dao extinguish the heart and wither the body,\nsitting in forgetfulness, merging inner clarity with perception,\nwhere form and spirit intermingle in illumination.\nWithin the body, they witness a thousand chariots and ten thousand riders.\nThe Hall of Light lies one inch inward from the space between the brows.\n\nEssence and qi flourish on Mount Huo in the south—\nThe heart governs the region of Yangzhou and Mount Huo of the Southern Marchmount.\n\nThe Heart Lord’s wondrous raiment is of great brilliance—\nThe heart spirit, a youth named \"Wondrous Essence,\"\nis the true color of the Great Yang.\n\nAdorned in shimmering green, radiant and crimson-crowned—\n\"Shimmering green\" refers to immortal tresses or the heart’s inner glow of red.\nHe wears a flowered canopy, the Vermilion Bird.\n\nNinefold luminous sashes girded with crimson arms—\nWithin the three divisions, each has nine degrees:\nthe nine qi of the Upper Origin serve as canopy-bearing envoys,\nthe nine qi of the Middle Origin as remonstrators,\nand the nine qi of the Lower Origin as grand heralds.\nTwenty-seven great spirits in all govern and command the numinous,\ndirecting the movements of the body.\nAlternatively, the nine degrees may refer to the nine apertures.\nThe luminous sashes are crimson vessels intertwined,\nlinked to the arms for defense and martial prowess.\nThe upper division undergoes nine transformations,\nthe middle division has nine apertures,\nand the lower division bears nine names,\nthus connecting the nine provinces.\n\nIngesting the flowery essence of the Great Yang’s east—\nThe flowery essence of water and grain, transformed into fluids,\nflows downward from above and must be gathered and circulated,\nguided by the heart after the liver.\nThe left governs the east, hence it is called the east of the Great Yang.\n\nOne should be as spiritually clear as a crimson child—\nThe crimson child, the heart’s spirit,\nis nine inches in length, four and a half inches in height,\nclad in red, seated facing outward.\n\nEmerging in a cinnabar chariot, attended by three pairs—\nThe cinnabar chariot is the heart’s true color,\ndwelling in the Crimson Palace’s Primordial Yang Mansion.\nWhen it emerges, it rides upon three columns of red qi.\nThe heart’s face governs the southern position of the yang heart,\naligned with the face.\nWhen it departs, it is accompanied by the Southern Culmen Elder\nand thirty-six hundred riders in attendance.\n\nA towering canopy, a vermilion carriage, crimson curtains and robes—\n\"Towering\" means lofty.\n\nThe red is the crow.\nThe canopy’s vermilion carriage is drawn by cinnabar serpents.\nThe cinnabar crow bears the tally and beats its wings in flight—\nThe cinnabar crow is the Vermilion Bird,\nan outward manifestation of decay.\nThus the Dark Warrior governs the Water of Jade Liquid,\nwhile the Vermilion Bird appears only when needed,\nhence its presence is not constant.\nThe tally is qi.\nHuman qi rises from below, ascending like a soaring crow spreading its wings.\n\nEmerging and entering, ascending and descending, it discourses on the Nine Stars—\nThe nine qi transform into nine spirits within the human body.\nThe *Great Cavern Scripture* states:\n\"The Celestial Sovereign’s nine souls undergo transformation to become them.\"\n\nReflect upon the purity of the spirits to transcend life and death—\n\"Reflect\" means to contemplate.\n\"Transcend\" means to change.\n\"Purity of the spirits\" refers to the spirits of the five viscera.\nIf one can nurture qi through embryonic breathing,\none may alter the course of life and death,\nand attain the state of divine transcendence.\n\nThrough transformation, one gains heavenly control over one’s robes—\nThe heart governs the body,\ndirecting movement as spirit.\nSubtle and wondrous, the flying form—\nwhen profound sincerity and perfect stillness are achieved,\nthe five illuminations manifest.\n\nDescending past the Long Wall to cross the Nine Beams—\nMount Kunlun has its Five Cities and Twelve Towers,\nand within the human body, these exist in the lower region.\nThe Nine Beams are the nine qi of the lower origin.\n\nThe liver, azure with seven lobes, lodges in the gallbladder’s storehouse—\nThe liver, wood of the eastern direction, is azure.\nThree lobes on the left, four on the right,\nits color like raw silk.\nConnected to the gallbladder, hence it is said to lodge there.\n\nIts form resembles a soaring crow’s wings—\nDrawing from the external analogy of the hare,\nthe hare being the water crow.\nIf embryonic breathing is perfected and the spirit emptied of all but essentials,\nthe liver becomes full and transcendent,\nlike a hare poised for flight.\n\nAgain, it resembles a pheasant soaring into the sun—\nLike the nine cranes and swans.\nWhen qi is full and the liver flourishing,\nit ascends like a pheasant in high flight,\nentering the sun as if rising into heaven.\n\nWithin reside many spirits, the Eastern and Western Kings—\nThe spirits are the Celestial Illumination Lord,\nalso called the Duke, the Radiant One,\nthe primordial true spirit of the liver.\nThe *Scripture of Numinous Treasure* states:\n\"The Primordial Hero Duke,\nthe White Primordial Venerable Spirit,\ndescends to guard the human body,\ndwelling in the Muddy Pellet Palace.\"\n\nIts palace belongs to the Imperial Succession of the Purple Pavilion District—\nThe liver has its Azure Yang Palace,\nwherein resides the Non-Bright True Person,\nwhose spirit governs the register of life.\n\"Succession\" means essence.\nThe Purple Pavilion District is the eyes.\nThe eyes’ qi is purple, governing the liver.\nWhen one consumes turbid substances and the liver flourishes,\nthe eyes grow dim.\nWhen the perfected one’s Dao is empty and the liver full,\nthe eyes become bright.\nIf breathing and absorption are perfected,\nthe liver and gallbladder fill within,\nthen spirit and essence harmonize,\nessence coalesces into unified virtue,\nand there is no danger of collapse.\n\nThe liver’s wondrous spirit wears azure radiance—\nThe liver’s color is azure,\nthe true color of the Wood Star of the eastern direction.\nIts form, eight inches long, rides a green dragon—\nEight inches in length,\nclad in azure robes,\ndwelling in the Hall of Light.\nWhen it emerges, it rides a green dragon,\na chariot of azure hue,\naccompanied by the Eastern Culmen Elder\nand thirty-six hundred riders.\n\nAbove, it encompasses the Year Star and the Sacred Peak of Tai—\nThe Year Star is Horn and Neck.\nThe Sacred Peak of Tai is the Eastern Marchmount,\nthe Azure Province.\n\nThe gallbladder, within the liver, holds greenish-yellow fluid—\nThe gallbladder lies between the liver’s left and right lobes,\na watery extension of bluish-green hue.\nWhen full, it contains a greenish-yellow-white liquid,\nwhich is the greenish-yellow fluid.\n\nLarge as a sparrow hawk, centered in true yellow—\nThe *Oral Instructions on the Twenty-Four Spirits’ Conduct* states:\n\"The gallbladder’s color is azure-yellow-green,\nas large as a sparrow hawk.\"\n\nIts spirit, three inches long, wears azure yang—\nThe gallbladder is named Dragon Leap,\nthree inches and eight fen in length,\nazure-yellow in color,\nseated facing outward.\n\nIts essence transforms into the soaring serpent to ward off inauspicious omens—\nThe gallbladder is one of the six palaces,\nexternally corresponding to the soaring serpent,\nalso known as the Green Dragon.\nThe gallbladder’s courage and vigor\ncan dispel misfortune.\n\"Inauspicious omens\" refers to poisonous creatures,\nor the Three Corpses worms.\n\nIt is named the \"Regulator of Enemies,\" governing the four directions—\nAmong the spirits of the six palaces,\nthe gallbladder is the most robust and valiant.\nHuman conduct, whether upright or perverse,\ndepends on the gallbladder.\nWhen the gallbladder is upright, all is naturally peaceful;\nwhen perverse, its orifices are destroyed.\nIt constantly defends externally,\nregulating by following the gallbladder’s law,\ncommanding resistance against enemies.\nTruly, the cultivation of the supreme Dao\ncannot be achieved without the gallbladder.\n\nThe stomach holds three pints, corresponding to the sun and moon—\nThe stomach is the Great Granary,\nmoving with the five viscera and following the four seasons.\nIt is the sea of water and grain,\nthe convergence of the large intestine,\nthe abode of the numinous.\nIts exterior is white, its interior moist and red with patterns—\nThe stomach’s color is white externally,\nwhile internally it is lustrous red with patterns.\n\nWithin resides harmonious qi, subtly ruling—\nHarmonious qi is true qi.\n\"Subtly ruling\" refers to the true person within the stomach.\nWhen the stomach opens, the five viscera are bright;\nwhen it closes, the five viscera grow dim.\nIt is the overflow and blockage of the myriad spirits,\nthe crucial ford of the unified body.\nClouds move and rain falls—\nall begins here.\n\nWhen thirsty, one craves its water as jade nectar—\nThe *Great Cavern Scripture* states:\n\"In practicing the method of ingesting the Dark Root,\none visualizes the stomach’s opening,\nwhere a maiden, childlike and unclothed,\nstands upright in the stomach’s conduit.\nOpening her mouth to receive the infusion of ethereal liquid,\nshe inhales the five qi,\nand when the mouth is full of saliva,\none swallows it, sending it into the Dark Maiden’s mouth.\nAfter five repetitions,\none clicks the teeth three times,\nswallowing the liquid nine times—\nall according to this method.\"\n\nWhen hungry, one craves its interior as yellow provisions—\nHunger is sated by swallowing saliva,\nwhich is the body’s natural sustenance.\nYellow is the true color of the central direction.\n\nIts spirit, three inches long, wears the central hue—\nThe spirit is named Yellow Emperor’s Son,\nthree inches in length,\nclad in yellow robes,\nseated facing outward,\ndissolving and refining food.\n\nThrough transformation, the Cinnabar Field’s hundred diseases vanish—\nThe Crimson Child dwells in the upper Cinnabar Field,\nthe True Person in the middle,\nthe Infant in the lower.\nOne spirit is named True Person, styled Zidan,\nalso called Guangjian.\nIf one can preserve it,\nthere will be no premature death from illness.\nThe True Person values the three fields uniting as one—\nthe foundation of divine transcendence.\n\nThe spleen’s jade waist is of true yellow—\nThe spleen is the palace of the Yellow Court.\nThe spleen lies across the stomach,\nits color a luminous yellow.\n\nTwo wooden points press against the Great Granary—\nThe two wooden points are its sharp, firm edges,\npressing against the stomach,\nforming the Great Granary’s sides.\n\nIts form resembles a golden weight, its color like a dim lamp—\nGold represents firmness and strength.\n\nThe spleen, when afflicted, bears a fatty membrane like raw silk wrapping yellow and white—this is its radiant, blended state. It constantly envelops sweetness to open the court’s hall. For all who follow the Dao, keeping the Three Passes ever harmonized is the root of essence’s firmness and the body’s stability. When the Three Passes are regulated, the Five Viscera are at peace, and the body knows no illness.\n\nA spirit nine inches tall, clad in yellow light—\nThe spleen spans nine inches, robed in yellow. The Eight Radiant Divine Lads bear these names. When one desires to preserve it, its form grows three inches long, lying transversely above the stomach. At dawn, it serves as the Venerable Lord; at dusk, as the Hall of Light’s Grand Unity Lord.\n\nIt emerges riding a verdant chariot, dragon-drawn in flight—\nThe spleen is the Hall of Light’s office, the Supreme Palace. Within it dwells the Jade Maiden of Mystic Radiance. The maiden of the Cinnabar Field rides forth in a chariot of yellow dragons, attended by three thousand six hundred riders of the Yellow Venerable Lord.\n\nAbove, it connects to the Star of Stability and the Lesser Chamber’s hall—\nThe Star of Stability is the Mystic Chamber. The Lesser Chamber is the Central Marchmount of Yuzhou. It governs the five flavors to nourish the four conducts—\nThe spleen distributes the five flavors, restraining and strengthening the four directions; thus it is their sovereign. By this, one may remain free from hunger and perceive the numinous.\n\nThe kidneys, black, flank the spine and reside at the navel—\nThe kidneys dwell in the lower Water Palace, three inches below the navel, adhering to the spine. The left is the Life Storehouse, the right the Great Harmony; the left governs the Minister, the right the Marshal. The kidneys lie on either side of the navel, directing the qi of the Triple Burner and irrigating the pathways of fluids.\n\nMaster Primal Yang says: Cold and heat beget one another; male and female take form. Within the kidneys dwell two spirits in azure robes—the left male bears the sun, the right female the moon. At midnight, if one can concentrate and visualize with precision, they may be seen.\n\nLarge as a fist, like an overturned cup—\nThe lower Cinnabar Field is the dwelling of the life-root spirit, storing the five qi. Left is azure, right yellow; above black, below white—its size is that of a large fist. It resembles a great rat or the Gate Terrace—\nThe kidneys are like a crouching ox, large or small as a rat. The Terrace faces the kidney’s form; the kidney’s office is the Mystic Gate Terrace.\n\nSwift as pure lacquer, dark as a darting bird—\nThe kidneys’ color is like black lacquer, resembling a frantic rat or a bird. When fetal breathing is complete and kidney qi is drawn upward in a pair, it soars like a flying bird, poised for flight—this is the state of swiftness.\n\nYellow and white suffuse the marrow, filling the body’s core—\nTrue essence overflows, like the body’s radiant joy. Within abide the myriad formless spirits—\nThe formless arises from the formed, hidden yet able to generate the Crimson Child. The Heavenly Department is the Palace of the Great Treasure—\nWhat is prized lies in non-use; nothing is more wondrous than the Dao in its constant sufficiency. Thus within the three degrees, each has nine attendants: on the right, the Director of Destinies; on the left, the Recorder; the left Minister of Justice—all swiftly record a person’s good and evil.\n\nThe kidneys are the Lord of Mystic Origin and Master Primal Yang. The Gate of Life is also called the Jade Capital—the lower Cinnabar Field. It is the place where essence and qi enter and exit, where the spirit resides, located behind the navel. Thus those who seek the true withdraw to secluded cliffs, severing worldly ties, fearing that defilement by women will endanger the lower Cinnabar Field, causing the Dark Bureau to record their offenses and the Underworld to shorten their allotted years.\n\nThe *Scripture of the Three Ones* states: At midnight on days of *jiazi*, *wuzi*, or *renzi*, call out to the Northern Culmen, naming the Mystic Communicant Maiden, saying, “So-and-so desires the Golden Liquid, Jade Nectar, and Sweet Spring to drink.” Thereupon, in profound meditation, visualize within the kidneys a white qi. On the left is the Director of Destinies, on the right the Recorder. Call out, “Recorder, Six Ding Jade Maiden, erase so-and-so’s name from the register of the dead.” All should speak thus to give me life. One who knows the names of the Three Ones’ spirits may attain longevity.\n\nThe *Book of Changes* says: The sage’s great treasure is called *position*—this means the ten thousand images reside within the human body.\n\nA spirit six inches tall, clad in crimson-brown—\nThe spirit is named Mystic Darkness, styled Nurturing Infant. It is six and seven-eighths inches tall, robed in white, seated facing outward. It rides forth in a chariot of the Dark Warrior, drawn by a divine tortoise—\nThe Dark Warrior is the tortoise, the true color of the north. The kidneys are the Dark and Obscure Palace, within which dwells the Grand Unity Lord. It emerges riding the Dark Warrior and flying tortoise, attended by three thousand six hundred riders of the Northern Culmen Venerable Elder.\n\nBearing water above and below, it irrigates the Nine Provinces—\nThe kidneys’ two sides are named the Han Waters. Within dwells a divine tortoise whose breath nourishes the flowing currents, dividing into two streams that circulate through the four limbs, pervading the whole. The *Scripture of the Three Ones* says: The kidneys contain a divine tortoise, also called the Dark Warrior, which distributes moisture and nourishment, connecting the nine orifices and corresponding to the Nine Provinces.\n\nThe hundred vessels and pores flourish and are well-ordered—\nWithin the three regions and nine orifices, the divine tortoise bears water, moistening the nine apertures and hundred vessels, thus bringing harmony. Above, it holds the stars in mutual support—\nThe five stars are stored within, inwardly corresponding to outer movements. The perfected one does not boast of petty conduct but shines with mystic illumination, aligning virtue with heaven and earth, matching the degrees of the stars. The body becomes a net of separation, and the myriad images respond within.\n\nThe *Method of Returning to the Origin* states: Step through the Way of the Seven Stars, visualizing the true person’s star descending from the Dipper and flying into one’s mouth, infusing the liver with light to illuminate the Five Viscera, making inner and outer brilliantly clear. Upon completion, face north and swallow saliva nine times.\n\nBelow, it joins with Mount Heng to lend support.\n\nAt the center of the four directions and above and below, the north is the lowest. Mount Heng, the Northern Marchmount, belongs to the Jizhou division. Its qi converges with the Jade Spring, which is the lower cinnabar field.\n\nThe *Scripture of the Great Cavern* states: The three luminaries transform through yin to form the Three Offices, wherein the nine spirits are registered—these are the Lords of the Upper, Middle, and Lower Primal Origins who govern destiny. The spirit is six inches in height and clad in dark yellow. The spirit is named Infant, styled Primal Yang Master, also called Valley Mystery. His form is six inches long and one inch eight fen tall, robed in red, seated facing outward.\n\nThe spirit-consorts share twelve curtains. The spirit-consorts—Jade Maiden of the Azure Waist and Jade Maiden of the Mystic Radiance—follow their mother within the curtains, dwelling in the cinnabar field to jointly guard the Lower Origin. The fivefold radiance of mystic luminance illumines the four directions, for below the navel lie the five viscera in their entirety—hence the fivefold radiance. Its circumference embraces the four directions—hence the four directions.\n\nClad in azure, red, white, and black without, and yellow within: the kidneys lie outside the navel, near its upper edge—thus the name \"outer yellow.\" Fivefold encircling defenses stand guard at four gates flung wide, as above and below connect and the five viscera interlink in mutual circulation.\n\nThe Five Stars interlink, their quintuple essences circulating in mutual flow, the five qi harmonizing and dissolving. The four gates are the four closures of the navel. Above, they connect to the crown; below, they penetrate the womb-envelope.\n\nAt the center lies the numinous terrace, the resplendent hall—\nThe center void is the spleen’s domain; the numinous terrace, the heart’s abode.\nBeneath the flowering canopy, the navel serves as the lower sea, universally pervading the six qi, its mansion linked to the heart.\n\nA vermilion tower of two inches communicates within itself.\nThe *Shangqing Scripture* states: Within the navel lies the Yellow Gate and Golden Chamber, the Silver City and Vermilion Tower—inner palace of the Lord of Unity, treasure-hall of the Three Perfected.\n\nDivine maidens gather and sport at the center.\nThe *Twenty-Four Divine Rites* states: The divine maiden is named Zhu Yuanma, styled Daojisheng. In men, she dwells within the yin organ; in women, within the womb. Her form measures two inches and two fen, of purple hue, seated facing outward, capable of engendering male and female offspring.\n\nThe *Scripture of Immortals* says: Within the human navel lie Kunlun, the Weak Waters, and the Abyss of Dark Mystery—where the sun and moon traverse, no different from the outer Kunlun. Only the perfected wander their spirits within and behold it. All the flying immortals soar above it, just as in heaven the sun and moon descend to illuminate the earth, and all things become bright. So too with man: the sun and moon shine down upon the navel, keeping the viscera ever luminous. By night, the sun rests in the stomach, casting light upon the navel—thus the navel stands at the very center of heaven, earth, and the Three Origins.\n\nThey harness the boundless to ride yin and yang—\nYin and yang are the lords of the lower cinnabar field, containing the two qi whose transformations give rise to form. Thus, when male and female unite in essence, the myriad transformations are born—this is the true spirit.\n\nThey command the Six Azure Dragons to establish the left—\nThe left governs yang; the Six Azure Dragons are also yang. Three becomes six, the inception of life’s image, the substance of formed being. The *Scripture of Immortals* says: \"Three on the left, seven on the right, nine above, one below.\" Thus, those who seek the true preserve the three and guard the one.\n\nThe White Tiger grasps the bow at the right—\nThe right is yin, the White Tiger. The bow is the arc, governing yang. The *Book of Changes* says: \"First draw the bow; if rain comes, it is auspicious.\" This speaks of yin and yang forming images, weighing and transforming.\n\nThe Vermilion Bird leads the way, wielding the five weapons—\nThe heart is the Vermilion Bird, dwelling above the spleen—thus it leads. Within the five viscera, each has its guardian spirit—these are the five weapons.\n\nThe Dark Warrior carries the drum in the rear—\nThe Dark Warrior is the kidneys, situated on either side of the spine—thus it follows behind. Below, near the bladder, it carries the drum.\n\nA thousand spirits and ten thousand riders charge in all directions—\nWithin a single body dwell thirty-six thousand true spirits and twelve hundred luminous essences, whose encampments and defenses give form. Thus, when the perfected discard the limbs, dim the senses, and nurture the numinous essence, they command a thousand chariots and ten thousand riders. The *Scripture of Western Ascent* says: \"Spirit gives birth to form; form gives birth to spirit. Without spirit, form cannot live; without form, spirit cannot be complete.\" This speaks of the adept’s inward contemplation, which brings about immortality.\n\nSoaring aloft like a chariot ascending the Nine Azure Heavens—\nWhen the crane cries, the young respond; cultivation perfected, it answers purity. The host of immortals flank the chariot, ascending the Nine Heavens.\n\nGrasping my Yellow Spirit, they turn the Eight Passes—\nThe Yellow Spirit is the Yellow Court; the Eight Passes, the eight directions. When the Dao is practiced through inner cultivation, completion allows one to traverse the Six Voids and wander at ease through the eight quarters.\n\nIn union with the Dao, they await and welcome—\nWhen the hook is raised and the fork responds, nurturing the spirit brings recompense. In union with the Dao, one ascends the Purple Ultimate.\n\nReturning once more to the center of my form—\nThe Dao of heaven is not distant; the Three and Five return. Is it possible or not? Yet it is not so—rather, the form returns to spirit, merging into wondrous quiescence.\n\nIn the indistinct and vague, they come and go, their faces without constancy—\nThe *Scripture of Laozi* says: \"Within the indistinct and vague, there are things.\" The *True Records* say: \"The face is the dwelling of a foot.\" The *Scripture of Western Ascent* states: \"The face should often be rubbed with both hands, following its contours up and down until thoroughly warm. This makes the face radiant, prevents wrinkles and blemishes, and after five years, the complexion becomes like a maiden’s.\" This is called \"circulating qi through mountains and rivers, ever full and unceasing.\"\n\nNone can know whether it abides or perishes—\n\nThose who know the true Dao do not decline or weary. Thus, the Five Viscera and Six Bowels reign as kings. The Five Viscera and Six Bowels each have spirits that govern them. Their models converge as one in the Cinnabar Field, named \"the One.\" When virtue abounds and daily grows, the Dao and the One spread transformation to generate the Three Powers. Man, obtaining the One, forms his body and gives rise to the Three Regions. Preserving the Three and guarding the One, he becomes one with the Dao. If you can know the One, all matters are complete—the One is the spirit of the body.\n\nTruly, if one can master this, it is the method to transcend the world. *Cheng* means \"sincerity,\" and *fang* means \"Dao.\" To guard one’s body is to surely attain the Dao of transcending the world.\n\nOne *cun* below the navel is called the Cinnabar Field. The Lower Cinnabar Field is named the Mechanism of Profit, also called Essence Dew, Intermingling Yin, or the Gate of Life—the life of the right府 of the Triple Burner. The various intestines coil and connect to the spine. The various intestines refer to the large and small intestines. Attached to the spine, they bear the stomach’s opening opposite the navel. The large intestine winds left in sixteen curves, the small intestine winds right in sixteen curves, circulating fluids that enter the intestines as turbid waste. The clear portion, passing behind the stomach, enters the kidney bladder, pouring into yin and yang as urine. The turbid portion, divided by the lungs, enters the intestines and exits as feces. Thus, those who circulate qi cease eating, and their spirit becomes bright and clear.\n\nThree *cun* square is called the Pass of Origin. The Pass of Origin lies three *cun* below the navel, also named the Pass of Clarity or the Gate of Fluids. It is the chamber where men store essence and the palace where women nurture the fetus. Extending four directions forms the Vermilion Wall. The four directions are the four cardinal points.\n\nThe vertical and horizontal axes intersect at the vermilion wall. They constantly reside at the central two gateways, which lie between the two kidneys. The spirit extends five *cun* in length, clad in golden script. Storing it morning and evening prevents decline—its length is two *cun* and one *fen*. It can expand or contract, transforming as a spirit. The spirit is that which subtly governs the myriad things. Its transformations arise naturally, bearing the unity of the body.\n\nBelow, contemplate the Gate of Heaven aligned with the Gate of Life. The Gate of Life is the navel, the lord of the inception of life. The ancestral origin is the Golden Gate and Jade Tower. One spirit is named the Peach Boy Lord, who governs the inception of the vital breath of luminous qi. This is the origin of Heaven and Earth, the ancestral root of yin and yang, the treasure of the Golden Gate and Jade Tower, the jewel of the chamber’s portal. A person’s life is governed by the Peach Lord, for the soul transforms into essence and fluids to give birth.\n\nOne *chi* below the navel lies the transforming spirit. This *chi* is above the yin bladder and below the womb, situated before the anus and behind the urethra, at the gate where the two yin meet. Within it dwells the True Person, called the Controller of Life. It is the root of a person’s years and months, the arbiter of questions concerning longevity or early demise. The Great One transforms the hun-soul, and together they attend the assembly of the Lords of Life, aligning with the Hun Emperor Lord. Thus, it is called the spirit of the Lord of Life, who oversees the register of years and the span of life’s authority. It is the repository of primordial unity, from which all records derive. It is also named the Spirit of the Numinous Flower and Ancestral Origin.\n\nTwo maidens stand in attendance, yet they may bring ruin to a person. These two maidens are the spirits of the yin, dwelling below the Gate of Life, through whom the harmony of yin and yang is achieved. If the true spirit is exhausted and the essence-fluids fail to flow, women will miscarry, and men will deplete their inner spirits, inviting calamity. If you wish not to die, gather your essence and turn your gaze inward. If you wish for long life, gather your essence and return to your form.\n\nWho does not know the value of life? Yet one cannot refrain from intercourse. Once essence is discharged through the lower gate, qi becomes turbid and fluids leak. The brain shouts as marrow is exhausted, and all efforts merely hasten dissolution. This is not the original true state but rather an inner corruption. The primordial spirit gradually wanes, and decay draws near. As the *Scripture of Western Ascent* states: \"The reason people treat life lightly and meet early ends is that they themselves invite defilement. It is not Heaven and Earth that destroy them, nor ghosts and spirits that harm them, but their own form.\"\n\nThose who cultivate life earnestly sever worldly affairs and retreat to the mountains and forests. They seek to cut off all frivolous customs, seal the senses, refine the form, and preserve correctness and auspiciousness. They can become great or small, yet their minds remain unconfused. Seeing nothing, they feel no vexation. Naturally, their minds are clear and their intentions settled. When intention is focused and the three spirits are free of illness, the three cinnabar fields are purified. Sincerity and devotion bring resonance. The *Scripture of Peaceful Joy* may then be fully realized. One effort brings eternal ease, and thus long life is attained—what more need be said?\n\nThe Three Ones of the Heavenly Dao are the foremost gate, namely Qian and Kun. Uniting Qian and Kun stabilizes the six palaces. The three give rise to the six palaces, which remain quiescent and unmoving, responsive yet unborn, serene and without action. Thus, one contemplates them. Knowing the mechanism of the true spirit, one exhausts principle and fulfills nature. There is no pore or orifice that does not turn inward. Cultivation completes, one averts disasters and misfortunes, forever leaving the depths of illness. Upright and blameless, one proceeds without hindrance.\n\nRead in accordance with the method: profound meaning enters the spirit, and deep study refines marvelous subtleties. Spirit and essence circulate and transform. Drawing breath in mutual embrace, the form and substance are already complete and return to their proper place. The five viscera generate numinous vitality, and the three fields are inwardly replete. All demonic forces and myriad intrusions flee ten thousand *li*. One enters water without getting wet, and fierce beasts cannot seize them. Guarding the five paths and preserving the Yellow Court, one securely holds the gate and transmits the mirror to worthy scholars. Those who receive it gain fortune and stand before the Most High.\n\nHere ends the *Central Scripture of the Yellow Court*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上黄庭中景经 经名：太上黄庭中景经。 又名《黄老黄庭经》。 原题上清元命真人李千来注。 一卷。 底本出处：《正统道藏》正一部。 太上黄庭中景经 上清元命真人李千乘注 黄老黄庭经 《洞房经》云：人有大室，正房黄庭，庭中黄老君所居，元始也。 《龟山录经》云：黄老君在上清金珠府理化。 黄者，是中正色也。 庭者，四方之中也。 外取在天中地中、云霞之上，内取於脑中、心、肝、脾之问。 为道者，莫不炼存形神，克成羽化，以致长生，超出圆罗之表，故日黄庭者也。 念吾头顶戴天神， 三元之气，降生三八景神，生於人身上洞天部。 一景生脑神之府，有元气。 人脑有九瓣，内生九真，皆列次位，以绕丹田，而外其面，以御不祥。 上真上向，高真南向，太真束向，神真西向，玄真北向。 《二十四神行事抉》云：脑神在头九官正九，当顶内脑膏之中，形长一寸一分，高五分半，向前面外坐，守丹田神是也。 发为星辰万余纶。 发神名玄父华，字道卫，形长二寸一分，色正玄，在躯皮内膏外，周流发根，正在头上。 万物之中，人之最贵，一形之内，包含天地，日月星辰，社稷刚柔，无所不法； 亦立天子，置三公、九卿、二十七大夫、八十一元士，百二十郡、千二百县、万八千乡、三万六十亭长，十八侯； 亦有官阙、宅合、门户、电井诸神。 饮食而知修者，即得长生。 所以头圆象天，足方象地，发为星辰，目为日月，眉为北斗，耳为社稷，为江海，齿为玉石。 给，理也。 发之始叉一，又存神也。 纡长盘屈光若玄， 纡回屈曲盘结，栉发不铃解髻。 面有神庭。 髻，脑之华。 心悲发焦。 髓满骨坚，不泄精气。 顶上中央名通天， 入发际一寸，顶名通天，栖神之宅也。 孔德之容大如钱， 《道德经》云：孔德之容，唯道是从。 为众妙之门者也。 天星和气从此问， 头为三台，天星九真君其上矣。 养人骨髓浸灵根， 绛官三景合明养人真。 灵根，舌也。 本，灵根者是也。 下和六府绍五宫， 肠、胃、大小肠、膀胱、三焦为六府，心、肝、肺、脾、肾为五官。 消除恶气出脐门。 下丹田入命根，精神之本，截五气、分阴阳之户也。 朝养玉候，暮为秽滓之气是也。 还念两目白黑分， 目者，是身之明镜也。 林夫人咒曰：目童三云，两目真君。 《丹字紫书》云：常存目中三神，合真内视，即见五藏肠胃，久行神仙矣。 左目为日天神存， 左目象日，神名上明，字英玄，一名飞灵也。 象长一寸衣丹玄， 目中童子人长一寸，服玄衣。 十二神女迥四边； 左目外有十二真人，周回营卫目也。 右目为月太一然， 右目象月，神名太一，字晨婴，一名明珠。 鹞呜时存束方青气从月来，满泥丸，泥丸中有青烟，又从目出郁郁然，变成二童子，着青衣，如婴儿形状者矣。 神长一寸衣白执， 左目真人长一寸。",
      "translated_text": "**The Supreme Yellow Court Scripture of the Central Radiance**\n\n**Scripture Title:** *The Supreme Yellow Court Scripture of the Central Radiance* (*Taishang Huangting Zhongjing Jing*). Also known as *The Yellow Emperor’s Yellow Court Scripture* (*Huanglao Huangting Jing*). Originally annotated by Li Qianlai, Perfected of Primordial Destiny of the Supreme Clarity. One scroll. Base text from *The Orthodox Daoist Canon*, First Section of the Orthodox Corpus.\n\n**The Supreme Yellow Court Scripture of the Central Radiance**\nAnnotated by Li Qiancheng, Perfected of Primordial Destiny of the Supreme Clarity\n*The Yellow Emperor’s Yellow Court Scripture*\n\nThe *Scripture of the Grotto Chamber* states: \"Humans possess a great chamber, the central hall of the Yellow Court, wherein dwells the Yellow Venerable Lord—this is the Primordial Beginning.\"\n\nThe *Record of Mount Tortoise* states: \"The Yellow Venerable Lord governs transformations in the Golden Pearl Palace of the Supreme Clarity.\"\n\n\"Yellow\" signifies the color of central rectitude. \"Court\" denotes the center of the four directions. Externally, it corresponds to the center of heaven and earth, above the clouds and mist; internally, it resides within the brain, amidst the heart, liver, and spleen. Those who cultivate the Dao refine and preserve form and spirit, achieving transcendence and feathered transformation to attain longevity, surpassing the bounds of the celestial net. Thus, it is called the Yellow Court.\n\nContemplate the celestial deities upon my crown,\nThe qi of the Three Origins descending to generate the twenty-four luminous spirits,\nBorn within the upper grotto-heaven of the human body.\nOne radiance gives rise to the palace of the brain-spirit, wherein resides primordial qi.\nThe human brain has nine petals, within which nine perfected beings are born,\nAll arrayed in their proper stations, encircling the cinnabar field,\nTheir faces outward to repel inauspicious influences.\nThe Supreme Perfected face upward, the Lofty Perfected southward,\nThe Grand Perfected eastward, the Spirit Perfected westward,\nThe Mysterious Perfected northward.\n\nThe *Key to the Conduct of the Twenty-Four Spirits* states: \"The brain-spirit resides in the nine palaces of the head, precisely within the ninefold center, amid the brain’s marrow. Its form is one cun and one fen in length, five and a half fen in height, seated facing outward to guard the spirit of the cinnabar field.\"\n\nThe hair is as the stars, myriad in strands.\nThe hair-spirit is named Mysterious Father Hua, styled Dao-Wei,\nTwo cun and one fen in length, of true mysterious color,\nResiding within the flesh, outside the marrow, circulating through the hair’s roots,\nCentered upon the crown.\n\nAmong the ten thousand things, humans are the most noble.\nWithin a single form, heaven and earth are encompassed,\nAs are the sun, moon, and stars, the altars of soil and grain, hardness and softness—\nNothing is not modeled upon them.\nThus, the Son of Heaven is established,\nWith the Three Dukes, Nine Ministers, Twenty-Seven Grand Masters, Eighty-One Primary Officers,\nOne hundred twenty commanderies, one thousand two hundred counties,\nEighteen thousand townships, thirty-six thousand village chiefs,\nAnd eighteen marquises.\nThere are also the spirits of palaces, residences, gates, doors, wells, and stoves.\n\nThose who partake of food and drink yet know cultivation shall attain longevity.\nThus, the head is round, symbolizing heaven; the feet are square, symbolizing earth.\nThe hair is as the stars, the eyes as the sun and moon,\nThe brows as the Northern Dipper, the ears as the altars of soil and grain,\nThe teeth as jade and stone.\n\n\"Giving\" means governance.\nThe hair’s first branching is one, then the spirit is stored.\nCoiled and winding, its light is as dark mystery,\nTwisting and turning, coiled and knotted, the hair is combed yet the topknot remains undone.\n\nThe face possesses the divine court.\nThe topknot is the flower of the brain.\nWhen the heart grieves, the hair withers.\nWhen the marrow is full and the bones firm, essence and qi are not leaked.\n\nThe center of the crown is called \"Communing with Heaven,\"\nOne cun within the hairline, the crown is named \"Communing with Heaven,\"\nThe dwelling of the abiding spirit.\n\nThe *Scripture of the Dao and Its Virtue* states: \"The demeanor of the aperture of virtue is only that which follows the Dao.\"\nIt is the gate of the myriad mysteries.\n\nThe harmonious qi of the celestial stars emerges from here.\nThe head is the Three Terraces; the Nine Perfected Lords of the celestial stars reside above it.\nNurturing the human bones and marrow, it permeates the numinous root.\nThe Crimson Palace’s threefold radiance converges to nourish the human true self.\nThe numinous root is the tongue—this is the root of the numinous.\n\nBelow, it harmonizes the Six Palaces and connects the Five Offices.\nThe intestines, stomach, large and small intestines, bladder, and Triple Burner are the Six Palaces;\nThe heart, liver, lungs, spleen, and kidneys are the Five Offices.\nIt dispels malign qi, expelling it through the navel gate.\n\nThe lower cinnabar field enters the root of life,\nThe foundation of essence and spirit,\nThe gate that severs the five qi and divides yin and yang.\nIn the morning, it nurtures the jade countenance; by dusk, it becomes the qi of foul dregs.\n\nNext, contemplate the division of black and white in the two eyes.\nThe eyes are the bright mirrors of the body.\nThe incantation of Lady Lin states: \"The eye-lads of the three clouds, the two eye Perfected Lords.\"\nThe *Purple Book of the Cinnabar Script* states: \"Constantly storing the three spirits within the eyes, uniting with the true and looking inward, one shall see the five viscera and intestines. Prolonged practice leads to transcendence.\"\n\nThe left eye stores the celestial deity of the sun.\nThe left eye symbolizes the sun; the spirit is named Supreme Clarity, styled Yingxuan, also called Flying Numinous.\nIts form is one cun in length, clad in vermilion and mystery.\nTwelve spirit maidens encircle its four sides.\n\nThe right eye stores the Great One of the moon.\nThe right eye symbolizes the moon; the spirit is named Great One, styled Chenying, also called Bright Pearl.\nAt cockcrow, store the green qi from the east as it comes from the moon,\nFilling the Mud Pill,\nWithin which green smoke arises, then emerges from the eyes in a dense cloud,\nTransforming into two youths clad in azure, like infants in form.\nThe spirit is one cun in length.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1157,
      "start_sentence": 0,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.27323770523071,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "白执，素衣也。 十二神女周成还。 左目十二神女，十二真人周还坐卫目也。 日月相去三寸问， 白月，两目。 相去三寸。 中有北斗七政陈， 存北斗七星天中帝卿，帝卿玄官。 玄官从准头直上，至发际五寸。 於夜半东向平坐散发，呼上元三真，真中婴兄大人面，各有门户，七政如北极紫房也。 面上真人神皆有方位，若视北极紫房玉阙是也。 上有元一五华君， 元一五华，五藏神也。 当头如居圆如盘， 太一在头，头法天。 圆盘，坚固者也。 象长七寸变化神。 形长七寸。",
      "translated_text": "\"White-clasped\" denotes plain white robes. The twelve spirit maidens encircle and return. The twelve spirit maidens of the left eye and the twelve perfected ones encircle and sit in guard of the eye. The sun and moon are three *cun* apart—this \"white moon\" refers to the two eyes, which are three *cun* distant from each other. Within them, the Seven Governors of the Northern Dipper are arrayed. Visualize the Seven Stars of the Northern Dipper as the Celestial Ministers of the Central Palace, the Celestial Ministers of the Mysterious Palace. The Mysterious Palace extends straight upward from the bridge of the nose to the hairline, five *cun* in height. At midnight, face east, sit upright, and loosen the hair. Invoke the Three Perfected Ones of the Upper Prime, the Great Faces of the Perfected within the Prime, each with their own gates and chambers. The Seven Governors resemble the Purple Chamber of the North Pole. The perfected ones and spirits upon the face all occupy their proper positions—this is like gazing upon the Jade Tower of the Purple Chamber of the North Pole. Above it resides the Primordial One, the Lord of the Five Flowers. The Primordial One and the Five Flowers are the spirits of the five viscera. Atop the head, they dwell like a round platter—this is the Great One in the head, for the head follows the pattern of Heaven. The round platter signifies firmness. The form is seven *cun* in length, a spirit of transformation.",
      "overlap_context": " vermilion and mystery.\nTwelve spirit maidens encircle its four sides.\n\nThe right eye stores the Great One of the moon.\nThe right eye symbolizes the moon; the spirit is named Great One, styled Chenying, also called Bright Pearl.\nAt cockcrow, store the green qi from the east as it comes from the moon,\nFilling the Mud Pill,\nWithin which green smoke arises, then emerges from the eyes in a dense cloud,\nTransforming into two youths clad in azure, like infants in form.\nThe spirit is one cun in length.",
      "start_char": 1157,
      "end_char": 1397,
      "start_sentence": 67,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.130409479141235,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "耳象昼夜空如聪， 修道先令目明耳聪为事主也。 耳目是寻真之梯级，综灵之门户。 夫目欲得数按抑其左右，亦令无数，使人聪彻，所以营理城郭，名书玉皇也。 中有黄庭主听门， 黄庭是脑中真人也。 欲下天神如赤丹， 九真降下於脑官。 丹者，仙服也。 盖长三寸青绩冠。 耳神名娇女，一名空闲，字幽田，形长三寸，青情冠也。 常居鼻上候百神， 《大洞经》云：鼻神名山源，一名鬼井。 有三元之山岳，能侯万神，为邪正之主也。 念鼻通利芳如香， 引灵注体，调和百神也。 中有一人衣黄金， 鼻中真人黄金仙服。 神长二寸出居人。 鼻神长二寸二分半，向外坐，主神他居，在人中上。 清虚神气处中央， 鼻中岳，处中央，内通脑双孔。 丹田清真之气，为邪正之气都府，是一身之武津道者。 先塞山源鬼井，悔吝不动，长生无答也。 令我不惑知四方。 斋戒常革夷心注，立是不惑，耳、鼻、舌各居一处，为四方者。 念口鸿赤大如方， 含气养精，《易》曰：观我朵颐，自求口实。 多淤玉液涌金粮， 口中津为玉液，不食五谷，吸风饮露。 金粮，不饮之貌是也。 神长七寸赤如强， 口中真人名赤虚丈人，字素明，在玄扉之下，形长七寸一分，高三寸半，向外，服赤衣。 强者，犹坚盛之貌也。 左右展转吸玉浆。",
      "translated_text": "The ears resemble the ceaseless emptiness of day and night, ever-attuned. In cultivating the Dao, one must first ensure the eyes are bright and the ears keen—these are the masters of one’s affairs. Ears and eyes serve as the ladder to seek the perfected and the gates to gather the numinous. The eyes should be frequently pressed and soothed on both sides, yet not excessively, to sharpen perception and clarity. Thus does one govern the city walls, inscribed in the registers of the Jade Emperor.\n\nWithin lies the Yellow Court, master of the Gate of Hearing—the Yellow Court being the perfected one within the brain. When celestial spirits descend, they appear like cinnabar red. The Nine Perfected descend into the chamber of the brain. *Dan* signifies the immortal’s raiment. It measures three *cun* in length, crowned with azure-green silk.\n\nThe ear spirit is named Jiao Nü, also called Kong Xian, with the style You Tian. Its form spans three *cun*, wearing an azure-green silk cap. It ever resides above the nose, awaiting the hundred spirits. The *Scripture of the Great Cavern* states: the nose spirit is named Shan Yuan, also called Gui Jing. It embodies the Three Primes’ mountain peaks, able to await the myriad spirits and serve as the arbiter of the true and the deviant.\n\nRecite: \"May the nose be unobstructed, fragrant as incense,\" to draw the numinous into the body and harmonize the hundred spirits. Within dwells one clad in golden yellow—the perfected one of the nose, robed in golden immortal garb. The spirit measures two *cun* in length, emerging to reside within the person.\n\nThe clear and void spirit-qi abides at the center—the nose’s peak, situated centrally, internally connecting the brain’s twin apertures. The qi of the Cinnabar Field’s purity and truth serves as the capital of the true and the deviant, the martial ford of the body’s pathways. First, seal the mountain source and ghost well, so that regrets and misfortunes remain unmoved—thus attaining long life without hindrance.\n\nEnable me to be unconfused and know the four directions. Through fasting and vigilance, constantly reforming the barbarian heart’s attachments, one stands unconfused. The ears, nose, and tongue each occupy their place, serving as the four directions.\n\nRecite: \"May the mouth be vast and red as a square,\" containing qi and nurturing essence. The *Book of Changes* says: \"Observe my chewing, seeking sustenance from the mouth.\" Let jade liquid surge like golden grain—the mouth’s saliva is jade liquid; abstaining from the five grains, one imbibes wind and drinks dew. *Golden grain* signifies the appearance of one who drinks not.\n\nThe spirit spans seven *cun*, red as strength—the perfected one within the mouth is named Chi Xu Zhang Ren, with the style Su Ming. It resides below the Mysterious Portal, its form seven *cun* and one *fen* in length, three *cun* and a half in height, facing outward, clad in red robes. *Strength* denotes firmness and vigor. Left and right, it turns to absorb jade nectar.",
      "overlap_context": " upon the face all occupy their proper positions—this is like gazing upon the Jade Tower of the Purple Chamber of the North Pole. Above it resides the Primordial One, the Lord of the Five Flowers. The Primordial One and the Five Flowers are the spirits of the five viscera. Atop the head, they dwell like a round platter—this is the Great One in the head, for the head follows the pattern of Heaven. The round platter signifies firmness. The form is seven *cun* in length, a spirit of transformation.",
      "start_char": 1398,
      "end_char": 1961,
      "start_sentence": 85,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.577298879623413,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "展转，反覆。 中有真人，能吸津液，往来不倦。 象斗铁初受四方， 真人器戴，遏邪之状。 初，调神之物。 学道之士，先当拘魂魄，消灭尸鬼。 常以月晦日、庚申、甲寅之辰，清斋入室，以真朱笔点左目訾下，雄黄笔点右鼻下，令· 一小入谷中讫，微咒，叩齿三通，咽液三过，以左手第二指捻右鼻孔下，右手第二指捻左目下，各七这当按之勿举手也。 於是都毕。 此二处是三魂七魄之门户，载灭精邪之津粱也。 故朱黄之精，塞尸鬼之路，乃太极上法，，行之则魂魄和气，尸秽散绝，灵通彻视，行之三年，色念都泯，四支无疾，以长生者也。 神长三寸衣玄黄。 神在脑中第一节，居於骨，形长三寸，高一寸七分半，向外坐也。 固其神女东西厢， 体中皆有男女真君，列阴阳之位。 厢左右洞房明堂官，真人在其中央，位相望也。 扶持黄泉五味长。 黄泉是领下喉上。 五味入。 ，咀嚼而咽，皆真人扶持。 此道妙神利锋芒， 自然妙有神通。 锋芒，利器。 夫人道所生，神所育，含灵受爽，以成乎身。 百姓日用不知，万物得之而不见，港行内运，或曜无方矣。 神长七寸衣赤丹， 神长七寸，在玉枕中脑内户髓膏内，向前坐，丹赤衣。 群神化养滋五常。 真人为群神五常阴阳之主，众东日群。 滋，生也。 真人化养生人身也。 大管蕃茂令上方， 大管，玄膺。 在舌下喉上，一名下管，受上下膺。 其管受精蕃茂，形长八寸，故日蕃也。 能知舌道寿未央。 舌者，无英之龙机，若能修之，致长生。 舌根玉股赤如丹， 玉历，舌名也。 若用机行能，以消刚柔者也。 主察滋味通醴泉。 舌是心之官，舌和则审五味。 醴泉，津唾者也。 下念喉咙十二环， 喉神名虎责，真气之路，津液之源，一名重堂，在顿下，故日下念。 绛官重楼十二级，外应十二时亭长也。 自下通流两乳问。 喉咙向下也。 两乳名天府，玉堂真人居其问。 中有阴阳夫妻仙， 左乳属阳，男真所居，右乳属阴，女真所居，形长八寸，高四寸，各面就坐相对向。 似人相对，日夫妻也。 对持玉戟四方边， 持，犹执也。 玉戟，犹真人之以守喉咙。 四方谓胸隔上下，乳内外也。 饮食不累巨令还。 上焦既通，水谷不积，能归下元也。 念肺五叶象玉光， 五藏次第，肺最为上，对胸，有五叶，如纱映谷者也。 青白皓皓若冰霜， 冰霜皓皓，肺主西方，金之正位也。 邹震覆心卫四方， 肺在心上，故日覆。 邹，仙兵也。 卫，近也。 肺叶四垂以近心，故日四方也。 上有玄童象月光， 肺神名皓华，字虚成，在肺中，神长四寸半，白衣，向斗坐。 月，阴精。 肺主阴，如月光也。 真精华盖内修明， 肺，心之华盖。 在肝上，故日明也。 肺中空洞上下行， 肺藏魂魄之官，魂性虚浮，鼻通天气，垂五叶以掩内孔，相应为上下行也。 大如锐孔通太常， 保气则得通神保精也。 保精则神明。 肺体轻浮，隐孔内属，精气往来，自然升降也。 乏绝道使享之亡， 六府调和，神明则住，三部不宁，我真铃散。",
      "translated_text": "Turning and revolving, ever returning—within lies the perfected one, who draws in the vital fluids, coming and going without weariness. Like the Dipper’s iron core receiving the four directions, the perfected one bears the vessel, warding off evil in form. *Core* is the instrument for harmonizing the spirit.\n\nThose who study the Dao must first restrain the hun and po souls, dispelling the corpse-demons. On the last day of the lunar month, the days of *gengshen* and *jiayin*, purify yourself and enter the chamber. With cinnabar brush, mark beneath the left eye’s corner; with realgar brush, mark beneath the right nostril, allowing a small amount to enter the valley. Then, softly recite the incantation, strike the teeth thrice, swallow saliva three times, and with the left hand’s second finger press beneath the right nostril, the right hand’s second finger beneath the left eye—seven times each, pressing firmly without lifting the hands. Thus is the rite complete.\n\nThese two points are the gateways of the three *hun* and seven *po*, the bridges that annihilate essence-demons. Thus the essence of cinnabar and realgar blocks the path of corpse-demons. This is the supreme method of the Great Ultimate. Practicing it harmonizes the *hun* and *po* with qi, scatters corpse-filth, and severs impurity. The spirit becomes penetrating and clear; after three years of practice, lustful thoughts vanish entirely, the four limbs remain free of illness, and one attains longevity.\n\nThe spirit is three *cun* in length, clad in dark yellow. The spirit in the brain’s first node dwells within the bone, three *cun* in length, one *cun* and seven and a half *fen* in height, seated facing outward. Its divine maidens occupy the eastern and western chambers—within the body, all possess male and female perfected lords, arrayed in the positions of yin and yang. The chambers, left and right, are the Cavernous Palaces and Hall of Light; the perfected one resides at their center, their positions aligned in mutual regard.\n\nThey uphold the Yellow Spring and the five flavors’ longevity. The Yellow Spring lies below the chin and above the throat. The five flavors enter, chewed and swallowed, all sustained by the perfected one. This Dao is wondrously divine, its edge keen—naturally possessing numinous efficacy. *Keen edge* signifies a sharp instrument.\n\nThe Dao by which humans are born, the spirit by which they are nurtured—imbibing the numinous and receiving clarity, the body is thus formed. The common people use it daily yet remain unaware; the myriad things obtain it yet do not perceive it. Concealed within, it operates unseen, or shines without fixed direction.\n\nThe spirit is seven *cun* in length, clad in cinnabar red. Seven *cun* in length, it resides within the Jade Pillow’s brain, the inner gate of marrow and fat, seated facing forward in red garments. The host of spirits transforms and nourishes the Five Constants. The perfected one is the lord of the host of spirits and the Five Constants of yin and yang. *Host* denotes the multitude. *Nourishes* means to engender—the perfected one transforms and nurtures the human body.\n\nThe Great Tube flourishes, commanding the upper region. The Great Tube is the Mysterious Gullet, beneath the tongue and above the throat, also called the Lower Tube, receiving the upper and lower gullets. This tube receives essence and flourishes, eight *cun* in length—hence *flourishes*. Knowing the tongue’s Dao, life remains unceasing. The tongue is the dragon’s mechanism of the *Wu Ying*—if one cultivates it, one attains longevity.\n\nThe tongue’s root has jade branches, red as cinnabar. *Jade branches* is the tongue’s name—if one employs its mechanism, it can dissolve hardness and softness. It governs the discernment of flavors and the flow of sweet springs. The tongue is the heart’s official; when the tongue is harmonized, it distinguishes the five flavors. *Sweet springs* refers to saliva.\n\nBelow, contemplate the throat’s twelve rings. The throat spirit is named *Hu Ze*, the path of true qi and the source of vital fluids, also called the *Chong Tang*, located beneath the chin—hence *below*. The Crimson Palace’s twelve-tiered tower corresponds externally to the twelve hourly guardians. From below, it channels the flow between the two breasts. The two breasts are named Heavenly Storehouse, where the Jade Hall perfected one resides.\n\nWithin are the yin-yang immortal husband and wife. The left breast belongs to yang, where the male perfected one dwells; the right breast belongs to yin, where the female perfected one resides. Each is eight *cun* in length, four *cun* in height, seated facing one another—like humans facing each other, hence *husband and wife*. They wield jade halberds at the four directions’ borders. *Wield* means to grasp—the jade halberds are like the perfected ones guarding the throat. The four directions refer to the chest’s diaphragm, above and below, within and beyond the breasts.\n\nFood and drink do not burden the great, allowing return. Once the upper burner is unobstructed, water and grain do not accumulate, returning to the lower origin. Contemplate the lungs’ five lobes, radiant as jade. Among the five viscera, the lungs rank highest, opposite the chest, with five lobes like gauze veiling the valley.\n\nPale blue-white, gleaming like frost and ice. *Gleaming frost and ice*—the lungs govern the west, the true position of metal. The *Zou Zhen* covers the heart, guarding the four directions. The lungs lie above the heart—hence *covers*. *Zou* are immortal soldiers; *guards* means to be near. The lung’s four lobes hang near the heart—hence the four directions.\n\nAbove is the Mysterious Youth, radiant as moonlight. The lung spirit is named *Hao Hua*, styled *Xu Cheng*, residing within the lungs. The spirit is four and a half *cun* in length, clad in white, seated facing the Dipper. *Moon* is yin essence—the lungs govern yin, like moonlight. The true essence is the canopy’s inner brilliance. The lungs are the heart’s flowery canopy, above the liver—hence *brilliance*.\n\nThe lungs are hollow and empty, moving above and below. The lungs are the palace of the *hun* and *po*; the *hun*’s nature is ethereal and floating. The nose connects to heavenly qi, its five lobes hanging to veil the inner orifices, corresponding in movement above and below. As vast as a sharp aperture, it connects to the Great Constant. Preserving qi ensures communion with the spirit; preserving essence ensures spirit clarity. The lungs’ body is light and floating, its hidden apertures internally linked—qi’s coming and going naturally ascends and descends.\n\nIf exhausted, the Dao’s envoys perish. When the six palaces are harmonized, the spirit remains; when the three regions are unsettled, my true ones must disperse.",
      "overlap_context": "taining from the five grains, one imbibes wind and drinks dew. *Golden grain* signifies the appearance of one who drinks not.\n\nThe spirit spans seven *cun*, red as strength—the perfected one within the mouth is named Chi Xu Zhang Ren, with the style Su Ming. It resides below the Mysterious Portal, its form seven *cun* and one *fen* in length, three *cun* and a half in height, facing outward, clad in red robes. *Strength* denotes firmness and vigor. Left and right, it turns to absorb jade nectar.",
      "start_char": 1962,
      "end_char": 3214,
      "start_sentence": 120,
      "end_sentence": 200,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.11433529853821,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "享，去声也。 绝立无万神不详， 道去身人死，水乾鱼终。 万神皆散，岂不亡也。 养性审之喘息端， 修身养性，闭气一名炼‘气，一名胎息，从夜半至日中为生气，从日中至夜半为死气。 常以生气时偃仰，冥目握固，闭气无息於中心，至百二十，口中出之，日增其数。 如此身神见，五藏安。 至二百五十日，即绛官神守，泥丸常满，丹田盛数。 至三百日，华盖自明耳，举身无病。 引息之法，寒热不畜，水谷无滞，一日一夜万三千五百息。 经千焉，具能养一身。 具元气，则无门不通，无豚不齐，无畜不散。 仰头缩鼻，而气上升。 龟导缩头含息，精气下行； 蛇导正屈不直，而气上升即周旋； 人导闭口微息，气入丹田，能明嘘吸，神真内备，飞上紫清，由喘息之所政也。 上有流神五形彰， 流神，五藏神明。",
      "translated_text": "\"Enjoy\" is pronounced with a departing tone. When severed, it leaves no room for the myriad spirits to prosper—when the Dao departs, the person dies; when the water dries, the fish perish. If the myriad spirits scatter, how can one not perish?\n\nTo cultivate one’s nature, examine the subtleties of breath. Cultivating the body and nurturing one’s nature—closing the breath is called \"refining qi,\" also named \"embryonic breathing.\" From midnight to noon is the time of generative qi; from noon to midnight is the time of destructive qi. Always practice during the time of generative qi: lie supine or prone, close the eyes, clench the fists, and hold the breath without exhalation at the center until one hundred twenty counts, then release it from the mouth, gradually increasing the count each day. Thus, the body’s spirits will manifest, and the five viscera will be at peace. After two hundred fifty days, the spirits of the Crimson Palace will guard, the Mud Pill will remain full, and the Cinnabar Field will flourish. After three hundred days, the flowery canopy will naturally brighten, and the entire body will be free of illness.\n\nThe method of guiding the breath: neither cold nor heat accumulates, water and grain pass without stagnation. In one day and night, there are thirteen thousand five hundred breaths. If one practices this for a thousand days, one can nourish the entire body. When primordial qi is complete, there is no passage that is not open, no pulse that is not harmonized, no accumulation that does not disperse.\n\nRaising the head and contracting the nose, the qi ascends. The turtle’s guidance: retracting the head and containing the breath, essence and qi descend. The snake’s guidance: coiling without straightening, the qi ascends and circulates. The human’s guidance: closing the mouth and gently breathing, qi enters the Cinnabar Field. By mastering exhalation and inhalation, the true spirits are internally perfected, ascending to the Purple Clarity—this is governed by the regulation of breath.\n\nAbove, the flowing spirits manifest in five forms. The flowing spirits are the luminous spirits of the five viscera.",
      "overlap_context": "fices, corresponding in movement above and below. As vast as a sharp aperture, it connects to the Great Constant. Preserving qi ensures communion with the spirit; preserving essence ensures spirit clarity. The lungs’ body is light and floating, its hidden apertures internally linked—qi’s coming and going naturally ascends and descends.\n\nIf exhausted, the Dao’s envoys perish. When the six palaces are harmonized, the spirit remains; when the three regions are unsettled, my true ones must disperse.",
      "start_char": 3214,
      "end_char": 3542,
      "start_sentence": 201,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.54386591911316,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "彰，明审而思之，其形乃明矣。 风伯雨师调阴阳， 风伯名比君，号日长斋； 雨师名冯修，号扮徒。 在人脑户日庙，在人项后名仕，在脾端名稷，在人大肠日风伯，在脐傍名雨师。 《易》曰：一阴一阳之谓道。 近取诸身，远取诸物。 《南华经》曰：天在人中，地在人中。 包含万物，自然玄运在身也。 伏羲女娲或存亡， 伏羲，三皇之王。 女祸，上古之君。 皆创立革抉，制造权舆。 人三官五藏之内，有此君王。 胃太仓，乃三皇五帝府传之也。 肺合太白华阴乡， 肺，雍州之分，主西岳华山也。 出驾白虎乘风雨。 肺神在外为白虎。 《大洞经》云：肺君白元君也。 居洞房官，出驾白虎，或乘白气。 从官太和君，二千六百骑矣。 心紫五寸锐下行， 心为帝君，居肺下肝上，对尸尾下一寸。 心者，一名绛．官，为一身之主，以管万民，呼吸诸神，无不到者。 锐者，心中孔，应八作万神出入也。 营若灵根扶中央， 灵根，命根也，玉液化清水灌之。 子能修三寸，长存心居中央也。 明珠赤白如日光， 明珠即心中精。 面色如缟映绛也。 中有三孔气堂堂， 心有三孔，精气流行。 堂堂，施张貌也。 千乘一朝导明堂， 夫修道者，皆灰心槁体，坐忘遗彼，聪内合爽，形神罗照，一身之内，见千乘万骑。 眉间却入一寸为明堂也。 精营霍山在南方， 心扬州之分，衡岳霍山。 心君要妙衣太肠， 心神童子一名要妙。 要妙，太阳之正色是也。 镇绿曜赫履朱冠， 缜绿，仙发，或心中晖赤之色也。 戴华盖，朱雀是也。 九度明带服赤兵， 三部内各为九度，上元九气为冠盖使者，中元九气为谏议，下元九气为鸿胪，三九二十七大神，皆部制神灵，主运骚体。 然义有两说。 九度，九窍也。 明带，赤豚交加，连兵捍武。 上部九变，中部九孔，下部九名，以通九州也。 饮食华澧太阳束， 饮食水谷华澧津液，既从上流下，须摄运，运心次肝。 左主东方，故日太阳之东也。 当如赤子精神澄， 赤子，婴兑，心神。 长九寸，高四寸半，赤衣，面向外坐也。 出驾丹车御三双， 丹车，心正色，居绛官元阳府，出或赤气三亭，人心面主南方阳心之位，．与面相应，出则从官南极老人，三千六百骑卫也。 隆盖朱舆赤帷裳， 隆，高。",
      "translated_text": "When manifest, by careful contemplation and reflection, their forms become clear.\n\nThe Wind Lord and Rain Master regulate yin and yang:\nThe Wind Lord is named Bijun, styled \"Long Abstinence\";\nThe Rain Master is named Fengxiu, styled \"Bantu.\"\nWithin the human body, they reside in the brain’s \"Temple of the Mind\";\nat the nape, they are called \"Minister\";\nat the spleen’s tip, \"Grain\";\nin the large intestine, \"Wind Lord\";\nand beside the navel, \"Rain Master.\"\n\nThe *Book of Changes* states: \"The alternation of yin and yang is called the Dao.\"\nNearly, we draw from the body; distantly, from all things.\nThe *Nanhua Sutra* says: \"Heaven is within man; earth is within man.\"\nEncompassing the myriad things, the mysterious workings naturally reside in the body.\n\nFu Xi and Nü Wa may endure or perish—\nFu Xi, sovereign of the Three August Ones;\nNü Wa, ruler of high antiquity.\nBoth established reforms and innovations, founding the origins of governance.\nWithin the three offices and five viscera of man, these sovereigns reside.\nThe stomach, the Great Granary, is the transmitted palace of the Three Sovereigns and Five Emperors.\n\nThe lungs connect to the White Flower’s Yin Land—\nThe lungs govern the region of Yongzhou and preside over the Western Marchmount, Mount Hua.\nThey emerge riding white tigers, borne upon wind and rain.\nThe lung spirit manifests externally as the White Tiger.\nThe *Great Cavern Scripture* states: \"The Lung Lord is the White Prime Lord.\"\nDwelling in the Cavern Chamber Palace, he rides forth on a white tiger or upon white qi,\nattended by the Grand Harmony Lord and twenty-six hundred riders.\n\nThe heart, a purple span of five inches, tapers downward—\nThe heart is the Emperor Lord, situated below the lungs and above the liver,\nopposite the point one inch below the coccyx.\nThe heart, also called the Crimson Palace, governs the entire body,\noverseeing all beings, directing the breath of every spirit without fail.\nIts tapering form is the heart’s aperture, through which the myriad spirits enter and exit in response to the eight trigrams.\n\nNurtured like the numinous root supporting the center—\nThe numinous root is the root of life, irrigated by jade liquid transformed into pure water.\nIf one can cultivate the three inches, the heart abides long in the center.\n\nA luminous pearl, red and white as sunlight—\nThe luminous pearl is the heart’s essence,\nits complexion like unbleached silk suffused with crimson.\n\nWithin, three apertures glow resplendently—\nThe heart possesses three apertures through which essence and qi flow.\n\"Resplendently\" describes their radiant expansion.\n\nA thousand chariots assemble at dawn in the Hall of Light—\nThose who cultivate the Dao extinguish the heart and wither the body,\nsitting in forgetfulness, merging inner clarity with perception,\nwhere form and spirit intermingle in illumination.\nWithin the body, they witness a thousand chariots and ten thousand riders.\nThe Hall of Light lies one inch inward from the space between the brows.\n\nEssence and qi flourish on Mount Huo in the south—\nThe heart governs the region of Yangzhou and Mount Huo of the Southern Marchmount.\n\nThe Heart Lord’s wondrous raiment is of great brilliance—\nThe heart spirit, a youth named \"Wondrous Essence,\"\nis the true color of the Great Yang.\n\nAdorned in shimmering green, radiant and crimson-crowned—\n\"Shimmering green\" refers to immortal tresses or the heart’s inner glow of red.\nHe wears a flowered canopy, the Vermilion Bird.\n\nNinefold luminous sashes girded with crimson arms—\nWithin the three divisions, each has nine degrees:\nthe nine qi of the Upper Origin serve as canopy-bearing envoys,\nthe nine qi of the Middle Origin as remonstrators,\nand the nine qi of the Lower Origin as grand heralds.\nTwenty-seven great spirits in all govern and command the numinous,\ndirecting the movements of the body.\nAlternatively, the nine degrees may refer to the nine apertures.\nThe luminous sashes are crimson vessels intertwined,\nlinked to the arms for defense and martial prowess.\nThe upper division undergoes nine transformations,\nthe middle division has nine apertures,\nand the lower division bears nine names,\nthus connecting the nine provinces.\n\nIngesting the flowery essence of the Great Yang’s east—\nThe flowery essence of water and grain, transformed into fluids,\nflows downward from above and must be gathered and circulated,\nguided by the heart after the liver.\nThe left governs the east, hence it is called the east of the Great Yang.\n\nOne should be as spiritually clear as a crimson child—\nThe crimson child, the heart’s spirit,\nis nine inches in length, four and a half inches in height,\nclad in red, seated facing outward.\n\nEmerging in a cinnabar chariot, attended by three pairs—\nThe cinnabar chariot is the heart’s true color,\ndwelling in the Crimson Palace’s Primordial Yang Mansion.\nWhen it emerges, it rides upon three columns of red qi.\nThe heart’s face governs the southern position of the yang heart,\naligned with the face.\nWhen it departs, it is accompanied by the Southern Culmen Elder\nand thirty-six hundred riders in attendance.\n\nA towering canopy, a vermilion carriage, crimson curtains and robes—\n\"Towering\" means lofty.",
      "overlap_context": "ontaining the breath, essence and qi descend. The snake’s guidance: coiling without straightening, the qi ascends and circulates. The human’s guidance: closing the mouth and gently breathing, qi enters the Cinnabar Field. By mastering exhalation and inhalation, the true spirits are internally perfected, ascending to the Purple Clarity—this is governed by the regulation of breath.\n\nAbove, the flowing spirits manifest in five forms. The flowing spirits are the luminous spirits of the five viscera.",
      "start_char": 3542,
      "end_char": 4474,
      "start_sentence": 220,
      "end_sentence": 281,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.904272317886353,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "赤，乌。 盖丹蛇为舆也。 丹乌持符鼓翼翔， 丹乌，朱雀，乃败外象，故玄武水玉液，朱雀见，终日用之，故不遍。 符，气也。 人气从下向上出，仰如飞乌举翼也。 出入上下论九星， 九气化为九神，在人身中。 《大洞经》云：天皇九魂，变化为之也。 计曾清神绝存亡， 计，念。 曾，易。 清神，五藏神。 人能胎息养气，叉易生死，则神仙可得也。 迁徙得天制其裳， 心为身主，制动为神，微妙飞形，深诚正静，则五映也。 下历长城度九梁。 昆仑山有五城十二楼，人内亦有之，在下部。 九梁，下元九气是也。 肝青七叶寄胆仓， 肝东方木青，左三右四叶，色如缟。 连胆，故言寄也。 状如亮访乌翼翔， 取兔外喻，兔，水乌。 若胎息既真，神虚叉备，肝满则超，如兔欲翔。 复似鹊葱走日中， 似九鹤鹌鹄也。 气满肝盛，如雉高飞，若升天入日中也。 中多诸神束西王， 神者，天映君，一名公子，一名含明，肝元真神。 《灵宝经》云：元英公子，白元尊神，下镇人身，在泥丸官是也。 宫属皇迭紫亭乡， 肝有青阳官，中有无英真人，其神主生录。 迭，精也。 紫亭乡，目也。 目气紫，主肝也。 人饮浊肝盛，则目暗； 至人道虚肝满，则目明。 若吐纳既备，肝胆内充，则精神和，精以成一德，无倾覆殆也。 肝之妙神衣青光， 肝色青，束方木星，正色也。 形长八寸乘青龙， 长八寸，青色之衣，居明堂官，出乘青龙，青色之车，从官束极老人三千六百骑也。 上包岁星岱岳宗。 岁星，角亢。 岱宗束岳，青州。 胆在肝中色绿浆， 胆在肝中左右叶之问，水延下碧绿色，盛水青黄白，绿浆是也。 大如鹦子中正黄， 《二十四神行事诀》云：胆色青黄绿，大如鹞子是也。 神长三寸衣青阳， 胆名龙跃，形长三寸八分，青黄色，向外坐也。 精为腾蛇辟辈祥， 胆为六府，外为胜蛇，亦为青龙。 胆刚勇奋发，能除不祥。 辈，毒虫，或云三尸虫是也。 名日轨敌御四方。 六府之神，胆最壮勇，人行邪正，皆在胆。 胆正则无事自安，胆邪窍之见灭。 常能外御，轨则法胆，主捍敌。 夫修上道，莫不由於胆也。 胃受三升应日月， 胃太仓，随五藏、逐四季而行。 胃水谷之海，大肠之委输，神灵所舍。 上白中泽赤文章， 胃色外白，中则润赤有文章也。 中有和气上微王， 和气，真气也。 微王，胃中真人。 胃开五藏明，胃闭五藏暗，为万灵之溢塞，成一躯之要津，云行雨施，皆由其始也。 渴思其水当玉浆， 《大洞经》云：夫服玄根之法，心存胃口，有女子如婴儿，无衣，正立胃管，张口承注魂液，仰吸五气，口中津液满口咽之，遣入玄女口中。 五过毕，叩齿三通，咽液九过，皆依是法也。 饥思其内象黄粮， 饥瓢咽液，是自然之粮。 黄，中央正色也。 神长三寸衣中央， 神名黄帝子，形长三寸，衣黄衣，向外坐，消磨食物也。 变化丹田百病亡。 赤子居上丹田，真人居中丹田，婴兑居下丹田。 一神名真人，字子丹，一名光坚。 人能存之，即无病夭。 真人贵三田合而成一，神仙之本也。 脾之璧腰色正黄， 脾，黄庭之官也。 脾横胃上，色黄明也。 两木颇锐迫太仓， 两木，两边锐坚，迫着胃，为太仓两边也。 状象金坠色混灯， 金，坚刚。",
      "translated_text": "The red is the crow.\nThe canopy’s vermilion carriage is drawn by cinnabar serpents.\nThe cinnabar crow bears the tally and beats its wings in flight—\nThe cinnabar crow is the Vermilion Bird,\nan outward manifestation of decay.\nThus the Dark Warrior governs the Water of Jade Liquid,\nwhile the Vermilion Bird appears only when needed,\nhence its presence is not constant.\nThe tally is qi.\nHuman qi rises from below, ascending like a soaring crow spreading its wings.\n\nEmerging and entering, ascending and descending, it discourses on the Nine Stars—\nThe nine qi transform into nine spirits within the human body.\nThe *Great Cavern Scripture* states:\n\"The Celestial Sovereign’s nine souls undergo transformation to become them.\"\n\nReflect upon the purity of the spirits to transcend life and death—\n\"Reflect\" means to contemplate.\n\"Transcend\" means to change.\n\"Purity of the spirits\" refers to the spirits of the five viscera.\nIf one can nurture qi through embryonic breathing,\none may alter the course of life and death,\nand attain the state of divine transcendence.\n\nThrough transformation, one gains heavenly control over one’s robes—\nThe heart governs the body,\ndirecting movement as spirit.\nSubtle and wondrous, the flying form—\nwhen profound sincerity and perfect stillness are achieved,\nthe five illuminations manifest.\n\nDescending past the Long Wall to cross the Nine Beams—\nMount Kunlun has its Five Cities and Twelve Towers,\nand within the human body, these exist in the lower region.\nThe Nine Beams are the nine qi of the lower origin.\n\nThe liver, azure with seven lobes, lodges in the gallbladder’s storehouse—\nThe liver, wood of the eastern direction, is azure.\nThree lobes on the left, four on the right,\nits color like raw silk.\nConnected to the gallbladder, hence it is said to lodge there.\n\nIts form resembles a soaring crow’s wings—\nDrawing from the external analogy of the hare,\nthe hare being the water crow.\nIf embryonic breathing is perfected and the spirit emptied of all but essentials,\nthe liver becomes full and transcendent,\nlike a hare poised for flight.\n\nAgain, it resembles a pheasant soaring into the sun—\nLike the nine cranes and swans.\nWhen qi is full and the liver flourishing,\nit ascends like a pheasant in high flight,\nentering the sun as if rising into heaven.\n\nWithin reside many spirits, the Eastern and Western Kings—\nThe spirits are the Celestial Illumination Lord,\nalso called the Duke, the Radiant One,\nthe primordial true spirit of the liver.\nThe *Scripture of Numinous Treasure* states:\n\"The Primordial Hero Duke,\nthe White Primordial Venerable Spirit,\ndescends to guard the human body,\ndwelling in the Muddy Pellet Palace.\"\n\nIts palace belongs to the Imperial Succession of the Purple Pavilion District—\nThe liver has its Azure Yang Palace,\nwherein resides the Non-Bright True Person,\nwhose spirit governs the register of life.\n\"Succession\" means essence.\nThe Purple Pavilion District is the eyes.\nThe eyes’ qi is purple, governing the liver.\nWhen one consumes turbid substances and the liver flourishes,\nthe eyes grow dim.\nWhen the perfected one’s Dao is empty and the liver full,\nthe eyes become bright.\nIf breathing and absorption are perfected,\nthe liver and gallbladder fill within,\nthen spirit and essence harmonize,\nessence coalesces into unified virtue,\nand there is no danger of collapse.\n\nThe liver’s wondrous spirit wears azure radiance—\nThe liver’s color is azure,\nthe true color of the Wood Star of the eastern direction.\nIts form, eight inches long, rides a green dragon—\nEight inches in length,\nclad in azure robes,\ndwelling in the Hall of Light.\nWhen it emerges, it rides a green dragon,\na chariot of azure hue,\naccompanied by the Eastern Culmen Elder\nand thirty-six hundred riders.\n\nAbove, it encompasses the Year Star and the Sacred Peak of Tai—\nThe Year Star is Horn and Neck.\nThe Sacred Peak of Tai is the Eastern Marchmount,\nthe Azure Province.\n\nThe gallbladder, within the liver, holds greenish-yellow fluid—\nThe gallbladder lies between the liver’s left and right lobes,\na watery extension of bluish-green hue.\nWhen full, it contains a greenish-yellow-white liquid,\nwhich is the greenish-yellow fluid.\n\nLarge as a sparrow hawk, centered in true yellow—\nThe *Oral Instructions on the Twenty-Four Spirits’ Conduct* states:\n\"The gallbladder’s color is azure-yellow-green,\nas large as a sparrow hawk.\"\n\nIts spirit, three inches long, wears azure yang—\nThe gallbladder is named Dragon Leap,\nthree inches and eight fen in length,\nazure-yellow in color,\nseated facing outward.\n\nIts essence transforms into the soaring serpent to ward off inauspicious omens—\nThe gallbladder is one of the six palaces,\nexternally corresponding to the soaring serpent,\nalso known as the Green Dragon.\nThe gallbladder’s courage and vigor\ncan dispel misfortune.\n\"Inauspicious omens\" refers to poisonous creatures,\nor the Three Corpses worms.\n\nIt is named the \"Regulator of Enemies,\" governing the four directions—\nAmong the spirits of the six palaces,\nthe gallbladder is the most robust and valiant.\nHuman conduct, whether upright or perverse,\ndepends on the gallbladder.\nWhen the gallbladder is upright, all is naturally peaceful;\nwhen perverse, its orifices are destroyed.\nIt constantly defends externally,\nregulating by following the gallbladder’s law,\ncommanding resistance against enemies.\nTruly, the cultivation of the supreme Dao\ncannot be achieved without the gallbladder.\n\nThe stomach holds three pints, corresponding to the sun and moon—\nThe stomach is the Great Granary,\nmoving with the five viscera and following the four seasons.\nIt is the sea of water and grain,\nthe convergence of the large intestine,\nthe abode of the numinous.\nIts exterior is white, its interior moist and red with patterns—\nThe stomach’s color is white externally,\nwhile internally it is lustrous red with patterns.\n\nWithin resides harmonious qi, subtly ruling—\nHarmonious qi is true qi.\n\"Subtly ruling\" refers to the true person within the stomach.\nWhen the stomach opens, the five viscera are bright;\nwhen it closes, the five viscera grow dim.\nIt is the overflow and blockage of the myriad spirits,\nthe crucial ford of the unified body.\nClouds move and rain falls—\nall begins here.\n\nWhen thirsty, one craves its water as jade nectar—\nThe *Great Cavern Scripture* states:\n\"In practicing the method of ingesting the Dark Root,\none visualizes the stomach’s opening,\nwhere a maiden, childlike and unclothed,\nstands upright in the stomach’s conduit.\nOpening her mouth to receive the infusion of ethereal liquid,\nshe inhales the five qi,\nand when the mouth is full of saliva,\none swallows it, sending it into the Dark Maiden’s mouth.\nAfter five repetitions,\none clicks the teeth three times,\nswallowing the liquid nine times—\nall according to this method.\"\n\nWhen hungry, one craves its interior as yellow provisions—\nHunger is sated by swallowing saliva,\nwhich is the body’s natural sustenance.\nYellow is the true color of the central direction.\n\nIts spirit, three inches long, wears the central hue—\nThe spirit is named Yellow Emperor’s Son,\nthree inches in length,\nclad in yellow robes,\nseated facing outward,\ndissolving and refining food.\n\nThrough transformation, the Cinnabar Field’s hundred diseases vanish—\nThe Crimson Child dwells in the upper Cinnabar Field,\nthe True Person in the middle,\nthe Infant in the lower.\nOne spirit is named True Person, styled Zidan,\nalso called Guangjian.\nIf one can preserve it,\nthere will be no premature death from illness.\nThe True Person values the three fields uniting as one—\nthe foundation of divine transcendence.\n\nThe spleen’s jade waist is of true yellow—\nThe spleen is the palace of the Yellow Court.\nThe spleen lies across the stomach,\nits color a luminous yellow.\n\nTwo wooden points press against the Great Granary—\nThe two wooden points are its sharp, firm edges,\npressing against the stomach,\nforming the Great Granary’s sides.\n\nIts form resembles a golden weight, its color like a dim lamp—\nGold represents firmness and strength.",
      "overlap_context": "n a cinnabar chariot, attended by three pairs—\nThe cinnabar chariot is the heart’s true color,\ndwelling in the Crimson Palace’s Primordial Yang Mansion.\nWhen it emerges, it rides upon three columns of red qi.\nThe heart’s face governs the southern position of the yang heart,\naligned with the face.\nWhen it departs, it is accompanied by the Southern Culmen Elder\nand thirty-six hundred riders in attendance.\n\nA towering canopy, a vermilion carriage, crimson curtains and robes—\n\"Towering\" means lofty.",
      "start_char": 4474,
      "end_char": 5830,
      "start_sentence": 282,
      "end_sentence": 371,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.883098125457764,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "脾有故，膏膜如缟裹黄白，混焕是也。 常甘包裹开庭堂， 凡为道者，令三关常调，是根精固体。 三关调，五藏安，则身无病也。 神长九寸衣黄光， 脾长九寸，黄衣，八景神童名字，人欲存时，则形长三寸，横於胃上，朝为老君，暮为明堂太一君是也。 出乘苍车驾龙翔， 脾为明堂官、太崇府，中有玄光玉女。 丹田之女，出乘黄龙之车，从官黄老君三千六百骑也。 上连镇星少室堂， 镇星，玄房。 少室者，中岳豫州也。 主生五味养四行， 脾分五味，制强四方，是为主。 可以不饥察神明。 精液内备，神具体安，不饥不渴，长生久视，定慧自然也。 肾黑侠脊当脐居， 肾居下部水宫，在脐下三寸，附着脊，左为命府，右为太和，左司徒，右司寇。 肾在脐内两边，主运三焦之气，灌溉津液通之路。 元阳子云：寒暑相生，男女相形，肾中二神青衣，左男戴日，右女戴月，至夜半时，人能精存思，则可得见也。 大如一拳如覆杯， 下丹田人命根神宅，藏五气，左青右黄，上黑下白，如大拳是也。 又似大鼠如关台， 肾如伏牛，大小如鼠。 台，向肾形，肾部之官玄关台也。 快如纯漆乌憧来， 肾色如黑漆，既若狂鼠，又复如鸟，若胎息既满，引肾气双孚，上如飞鸟而欲飘举，憧憧然是也。 黄白足脂若躯中， 真精溢满，如人体光悦也。 中多无形万物神， 无形生於有形，隐伏能生赤子也。 大宝之宫中天部， 夫无用即有所宝，无用而常足者，莫妙乎道，故三度之中，各有九人，右有司命，左有司录，左司廷尉，皆内外速记人善恶。 肾为玄元君、元阳子。 命门一名玉都，下丹田也。 精气出入，神居之所，当脐后是也。 故寻真之士，外身幽岩，屏绝人事，恐犯女秽，则下丹田危人郁录，冥司夺算。 《三一经》云：以夜半时，甲子、戊子、壬子日呼之日，北极名玄通女，某乙欲得金液、玉浆、醴泉可饮者。 因冥思念肾问有白气，左有司命，右有司录，呼之日，司录六丁玉女，削去某乙死籍。 皆当言之生我，能知三一神名，可长生矣。 《易》曰：圣人之大宝日位。 言万象在人身内也。 神长六寸衣赤褐， 神名玄冥，字育婴，长六寸七分半，衣白，外向坐是也。 出驾玄武御神龟， 玄武神龟，北方正色。 肾为幽暗府，中有太一君，出驾玄武与飞龟，从君官北极老人三千六百骑是也。 戴水上下浸九州， 肾两边名汉水，中有神龟，呼吸养流行为两分，通四支周遍。 《三一经》云：肾有神龟，亦为玄武，乃布流润泽，通九窍，应九州也。 百脉孔窍盛以治。 三部中九窍，神龟戴水，上下九孔百豚皆和润，所以治也。 上有星辰相合持， 五星藏内，皆内应外运。 夫至人不矜其细行，朗然玄照，与天地合其德，与星辰合其度，一体离罗，万象内应。 《回元行事诀》云：诸步七星之道，存真人星从斗而来下，飞入兆口，注在肝中，使光照五藏，内外洞明。 毕，北向再咽液九过矣。 下与恒山相连扶，",
      "translated_text": "The spleen, when afflicted, bears a fatty membrane like raw silk wrapping yellow and white—this is its radiant, blended state. It constantly envelops sweetness to open the court’s hall. For all who follow the Dao, keeping the Three Passes ever harmonized is the root of essence’s firmness and the body’s stability. When the Three Passes are regulated, the Five Viscera are at peace, and the body knows no illness.\n\nA spirit nine inches tall, clad in yellow light—\nThe spleen spans nine inches, robed in yellow. The Eight Radiant Divine Lads bear these names. When one desires to preserve it, its form grows three inches long, lying transversely above the stomach. At dawn, it serves as the Venerable Lord; at dusk, as the Hall of Light’s Grand Unity Lord.\n\nIt emerges riding a verdant chariot, dragon-drawn in flight—\nThe spleen is the Hall of Light’s office, the Supreme Palace. Within it dwells the Jade Maiden of Mystic Radiance. The maiden of the Cinnabar Field rides forth in a chariot of yellow dragons, attended by three thousand six hundred riders of the Yellow Venerable Lord.\n\nAbove, it connects to the Star of Stability and the Lesser Chamber’s hall—\nThe Star of Stability is the Mystic Chamber. The Lesser Chamber is the Central Marchmount of Yuzhou. It governs the five flavors to nourish the four conducts—\nThe spleen distributes the five flavors, restraining and strengthening the four directions; thus it is their sovereign. By this, one may remain free from hunger and perceive the numinous.\n\nThe kidneys, black, flank the spine and reside at the navel—\nThe kidneys dwell in the lower Water Palace, three inches below the navel, adhering to the spine. The left is the Life Storehouse, the right the Great Harmony; the left governs the Minister, the right the Marshal. The kidneys lie on either side of the navel, directing the qi of the Triple Burner and irrigating the pathways of fluids.\n\nMaster Primal Yang says: Cold and heat beget one another; male and female take form. Within the kidneys dwell two spirits in azure robes—the left male bears the sun, the right female the moon. At midnight, if one can concentrate and visualize with precision, they may be seen.\n\nLarge as a fist, like an overturned cup—\nThe lower Cinnabar Field is the dwelling of the life-root spirit, storing the five qi. Left is azure, right yellow; above black, below white—its size is that of a large fist. It resembles a great rat or the Gate Terrace—\nThe kidneys are like a crouching ox, large or small as a rat. The Terrace faces the kidney’s form; the kidney’s office is the Mystic Gate Terrace.\n\nSwift as pure lacquer, dark as a darting bird—\nThe kidneys’ color is like black lacquer, resembling a frantic rat or a bird. When fetal breathing is complete and kidney qi is drawn upward in a pair, it soars like a flying bird, poised for flight—this is the state of swiftness.\n\nYellow and white suffuse the marrow, filling the body’s core—\nTrue essence overflows, like the body’s radiant joy. Within abide the myriad formless spirits—\nThe formless arises from the formed, hidden yet able to generate the Crimson Child. The Heavenly Department is the Palace of the Great Treasure—\nWhat is prized lies in non-use; nothing is more wondrous than the Dao in its constant sufficiency. Thus within the three degrees, each has nine attendants: on the right, the Director of Destinies; on the left, the Recorder; the left Minister of Justice—all swiftly record a person’s good and evil.\n\nThe kidneys are the Lord of Mystic Origin and Master Primal Yang. The Gate of Life is also called the Jade Capital—the lower Cinnabar Field. It is the place where essence and qi enter and exit, where the spirit resides, located behind the navel. Thus those who seek the true withdraw to secluded cliffs, severing worldly ties, fearing that defilement by women will endanger the lower Cinnabar Field, causing the Dark Bureau to record their offenses and the Underworld to shorten their allotted years.\n\nThe *Scripture of the Three Ones* states: At midnight on days of *jiazi*, *wuzi*, or *renzi*, call out to the Northern Culmen, naming the Mystic Communicant Maiden, saying, “So-and-so desires the Golden Liquid, Jade Nectar, and Sweet Spring to drink.” Thereupon, in profound meditation, visualize within the kidneys a white qi. On the left is the Director of Destinies, on the right the Recorder. Call out, “Recorder, Six Ding Jade Maiden, erase so-and-so’s name from the register of the dead.” All should speak thus to give me life. One who knows the names of the Three Ones’ spirits may attain longevity.\n\nThe *Book of Changes* says: The sage’s great treasure is called *position*—this means the ten thousand images reside within the human body.\n\nA spirit six inches tall, clad in crimson-brown—\nThe spirit is named Mystic Darkness, styled Nurturing Infant. It is six and seven-eighths inches tall, robed in white, seated facing outward. It rides forth in a chariot of the Dark Warrior, drawn by a divine tortoise—\nThe Dark Warrior is the tortoise, the true color of the north. The kidneys are the Dark and Obscure Palace, within which dwells the Grand Unity Lord. It emerges riding the Dark Warrior and flying tortoise, attended by three thousand six hundred riders of the Northern Culmen Venerable Elder.\n\nBearing water above and below, it irrigates the Nine Provinces—\nThe kidneys’ two sides are named the Han Waters. Within dwells a divine tortoise whose breath nourishes the flowing currents, dividing into two streams that circulate through the four limbs, pervading the whole. The *Scripture of the Three Ones* says: The kidneys contain a divine tortoise, also called the Dark Warrior, which distributes moisture and nourishment, connecting the nine orifices and corresponding to the Nine Provinces.\n\nThe hundred vessels and pores flourish and are well-ordered—\nWithin the three regions and nine orifices, the divine tortoise bears water, moistening the nine apertures and hundred vessels, thus bringing harmony. Above, it holds the stars in mutual support—\nThe five stars are stored within, inwardly corresponding to outer movements. The perfected one does not boast of petty conduct but shines with mystic illumination, aligning virtue with heaven and earth, matching the degrees of the stars. The body becomes a net of separation, and the myriad images respond within.\n\nThe *Method of Returning to the Origin* states: Step through the Way of the Seven Stars, visualizing the true person’s star descending from the Dipper and flying into one’s mouth, infusing the liver with light to illuminate the Five Viscera, making inner and outer brilliantly clear. Upon completion, face north and swallow saliva nine times.\n\nBelow, it joins with Mount Heng to lend support.",
      "overlap_context": "ues the three fields uniting as one—\nthe foundation of divine transcendence.\n\nThe spleen’s jade waist is of true yellow—\nThe spleen is the palace of the Yellow Court.\nThe spleen lies across the stomach,\nits color a luminous yellow.\n\nTwo wooden points press against the Great Granary—\nThe two wooden points are its sharp, firm edges,\npressing against the stomach,\nforming the Great Granary’s sides.\n\nIts form resembles a golden weight, its color like a dim lamp—\nGold represents firmness and strength.",
      "start_char": 5830,
      "end_char": 7033,
      "start_sentence": 372,
      "end_sentence": 429,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.23872518539429,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "四维上下之中，北方最下，怛山北岳，属冀州分野是也。 气合玉泉，下丹田也。 《大洞经》云：三光阴化成三官，籍三官中九神，上中下三元君主命是也。 神长六寸衣玄黄， 神名婴儿，字元阳子，一名谷玄，形长六寸，高一寸八分，赤衣，面外坐。 神妃十二同帷帐， 神妃则青腰玉女、玄光玉女，并随母所帷帐，丹田中也，同守下元也。 五光玄曜照四方， 脐下都五藏，故云五光。 周圆四方，故云四方是也。 青赤白黑服外黄。 肾在脐外，脐近肾上，是故名外黄。 周卫五重四门张， 上下相连，周卫五藏相通。",
      "translated_text": "At the center of the four directions and above and below, the north is the lowest. Mount Heng, the Northern Marchmount, belongs to the Jizhou division. Its qi converges with the Jade Spring, which is the lower cinnabar field.\n\nThe *Scripture of the Great Cavern* states: The three luminaries transform through yin to form the Three Offices, wherein the nine spirits are registered—these are the Lords of the Upper, Middle, and Lower Primal Origins who govern destiny. The spirit is six inches in height and clad in dark yellow. The spirit is named Infant, styled Primal Yang Master, also called Valley Mystery. His form is six inches long and one inch eight fen tall, robed in red, seated facing outward.\n\nThe spirit-consorts share twelve curtains. The spirit-consorts—Jade Maiden of the Azure Waist and Jade Maiden of the Mystic Radiance—follow their mother within the curtains, dwelling in the cinnabar field to jointly guard the Lower Origin. The fivefold radiance of mystic luminance illumines the four directions, for below the navel lie the five viscera in their entirety—hence the fivefold radiance. Its circumference embraces the four directions—hence the four directions.\n\nClad in azure, red, white, and black without, and yellow within: the kidneys lie outside the navel, near its upper edge—thus the name \"outer yellow.\" Fivefold encircling defenses stand guard at four gates flung wide, as above and below connect and the five viscera interlink in mutual circulation.",
      "overlap_context": "hing the degrees of the stars. The body becomes a net of separation, and the myriad images respond within.\n\nThe *Method of Returning to the Origin* states: Step through the Way of the Seven Stars, visualizing the true person’s star descending from the Dipper and flying into one’s mouth, infusing the liver with light to illuminate the Five Viscera, making inner and outer brilliantly clear. Upon completion, face north and swallow saliva nine times.\n\nBelow, it joins with Mount Heng to lend support.",
      "start_char": 7033,
      "end_char": 7288,
      "start_sentence": 430,
      "end_sentence": 443,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.8102850914001465,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "五星相通，五重精液周流，五气和释。 四门，脐四闭也。 上通於顶，下彻包裹是也。 中虚灵台华屋堂， 中虚，脾部。 灵台，心居。 华益之下，脐为下海，总通六气，府与心连也。 朱楼二寸自相通， 《上清经》云：脐有黄阙金室，银城朱楼，是帝一君之内宅，三真之宝官是也。 神女游戏集中央。 《二十四神行事诀》云：神女名逐元马，字道极生，男则阴茎内，女在子藏中。 形长二寸二分，紫色，向外坐，能为男女生雌雄。 仙经云：人脐中有昆仑、弱水、玄冥之渊，日月所行，与外昆仑不异也。 唯至人游神於内，则见矣。 有一切神仙飞游其上，故天有日月下临地，万物皆明，人亦如之。 日月下照脐，脏腑常明，夜则日在胃，照於脐，故脐正当天地三元中央是也。 驾无极乘焉阴阳， 阴阳，下丹田神阴阳之主，含二气变化成形，故男女媾精万化生，是真神也。 御六苍龙建左方， 左主阳，六苍龙亦阳，三如六，生象之始，成形之质。 仙经云：左三右七，戴九履一。 故求真之人，存三守一也。 白虎把弓居右方， 右阴白虎。 弓，弧也，主阳。 《易》曰：先张之弧，遇雨则吉。 此言阴阳成象，斟酌变化也。 朱雀前引把五兵， 心为朱雀，居脾上，故引前。 五藏之中，各有神守，是五兵也。 玄武提鼓在后行， 玄武为肾，当脊两边，故在后。 下近胞囊，为提鼓是也。 千神万骑引纵横， 夫一体云内有三万六千真神，千二百精光，营卫成形，故至人若廖支体，黜聪明，养精灵，则千乘万骑。 《西升经》云：神生形，形生神，形不得神，不能自生，神不得形，不能自成。 言神人内省，便能致神仙是也。 轩如高举登九苍。 鹤呜子和，修成则应贞，群仙翼轩，乃登九天也。 持我黄神转八关， 黄神，黄庭也。 八关，八方。 若道行内修，备则周行六虚，爻游晏八方也。 与道合同相候迎， 提向叉应，养神见报，与道合同，上升紫极也。 还复返我形中央， 天道不远，三五复返，可乎不可，然而不然，是形返神，归乎妙寂是也。 恍惚出入面无常， 老子经云：恍惚中有物。 《真诰》曰：面为尺宅。 《西升经》云：面常欲两手摩拭，高下随形，使之令极热，令人面光泽，皱斑不生，行之五年，色如少女。 可谓山川行气，常盈不设也。 莫能知之存与亡，",
      "translated_text": "The Five Stars interlink, their quintuple essences circulating in mutual flow, the five qi harmonizing and dissolving. The four gates are the four closures of the navel. Above, they connect to the crown; below, they penetrate the womb-envelope.\n\nAt the center lies the numinous terrace, the resplendent hall—\nThe center void is the spleen’s domain; the numinous terrace, the heart’s abode.\nBeneath the flowering canopy, the navel serves as the lower sea, universally pervading the six qi, its mansion linked to the heart.\n\nA vermilion tower of two inches communicates within itself.\nThe *Shangqing Scripture* states: Within the navel lies the Yellow Gate and Golden Chamber, the Silver City and Vermilion Tower—inner palace of the Lord of Unity, treasure-hall of the Three Perfected.\n\nDivine maidens gather and sport at the center.\nThe *Twenty-Four Divine Rites* states: The divine maiden is named Zhu Yuanma, styled Daojisheng. In men, she dwells within the yin organ; in women, within the womb. Her form measures two inches and two fen, of purple hue, seated facing outward, capable of engendering male and female offspring.\n\nThe *Scripture of Immortals* says: Within the human navel lie Kunlun, the Weak Waters, and the Abyss of Dark Mystery—where the sun and moon traverse, no different from the outer Kunlun. Only the perfected wander their spirits within and behold it. All the flying immortals soar above it, just as in heaven the sun and moon descend to illuminate the earth, and all things become bright. So too with man: the sun and moon shine down upon the navel, keeping the viscera ever luminous. By night, the sun rests in the stomach, casting light upon the navel—thus the navel stands at the very center of heaven, earth, and the Three Origins.\n\nThey harness the boundless to ride yin and yang—\nYin and yang are the lords of the lower cinnabar field, containing the two qi whose transformations give rise to form. Thus, when male and female unite in essence, the myriad transformations are born—this is the true spirit.\n\nThey command the Six Azure Dragons to establish the left—\nThe left governs yang; the Six Azure Dragons are also yang. Three becomes six, the inception of life’s image, the substance of formed being. The *Scripture of Immortals* says: \"Three on the left, seven on the right, nine above, one below.\" Thus, those who seek the true preserve the three and guard the one.\n\nThe White Tiger grasps the bow at the right—\nThe right is yin, the White Tiger. The bow is the arc, governing yang. The *Book of Changes* says: \"First draw the bow; if rain comes, it is auspicious.\" This speaks of yin and yang forming images, weighing and transforming.\n\nThe Vermilion Bird leads the way, wielding the five weapons—\nThe heart is the Vermilion Bird, dwelling above the spleen—thus it leads. Within the five viscera, each has its guardian spirit—these are the five weapons.\n\nThe Dark Warrior carries the drum in the rear—\nThe Dark Warrior is the kidneys, situated on either side of the spine—thus it follows behind. Below, near the bladder, it carries the drum.\n\nA thousand spirits and ten thousand riders charge in all directions—\nWithin a single body dwell thirty-six thousand true spirits and twelve hundred luminous essences, whose encampments and defenses give form. Thus, when the perfected discard the limbs, dim the senses, and nurture the numinous essence, they command a thousand chariots and ten thousand riders. The *Scripture of Western Ascent* says: \"Spirit gives birth to form; form gives birth to spirit. Without spirit, form cannot live; without form, spirit cannot be complete.\" This speaks of the adept’s inward contemplation, which brings about immortality.\n\nSoaring aloft like a chariot ascending the Nine Azure Heavens—\nWhen the crane cries, the young respond; cultivation perfected, it answers purity. The host of immortals flank the chariot, ascending the Nine Heavens.\n\nGrasping my Yellow Spirit, they turn the Eight Passes—\nThe Yellow Spirit is the Yellow Court; the Eight Passes, the eight directions. When the Dao is practiced through inner cultivation, completion allows one to traverse the Six Voids and wander at ease through the eight quarters.\n\nIn union with the Dao, they await and welcome—\nWhen the hook is raised and the fork responds, nurturing the spirit brings recompense. In union with the Dao, one ascends the Purple Ultimate.\n\nReturning once more to the center of my form—\nThe Dao of heaven is not distant; the Three and Five return. Is it possible or not? Yet it is not so—rather, the form returns to spirit, merging into wondrous quiescence.\n\nIn the indistinct and vague, they come and go, their faces without constancy—\nThe *Scripture of Laozi* says: \"Within the indistinct and vague, there are things.\" The *True Records* say: \"The face is the dwelling of a foot.\" The *Scripture of Western Ascent* states: \"The face should often be rubbed with both hands, following its contours up and down until thoroughly warm. This makes the face radiant, prevents wrinkles and blemishes, and after five years, the complexion becomes like a maiden’s.\" This is called \"circulating qi through mountains and rivers, ever full and unceasing.\"\n\nNone can know whether it abides or perishes—",
      "overlap_context": "uminance illumines the four directions, for below the navel lie the five viscera in their entirety—hence the fivefold radiance. Its circumference embraces the four directions—hence the four directions.\n\nClad in azure, red, white, and black without, and yellow within: the kidneys lie outside the navel, near its upper edge—thus the name \"outer yellow.\" Fivefold encircling defenses stand guard at four gates flung wide, as above and below connect and the five viscera interlink in mutual circulation.",
      "start_char": 7288,
      "end_char": 8228,
      "start_sentence": 444,
      "end_sentence": 496,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.465331077575684,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "能知真道，则不衰惫耳。 故日五藏六府王。 五藏六府，各有司主之神。 法象会一於丹田， 名之为一，盛德日生，道与一布化生三才。 人得一成形，而生三部，存三守一与道同，子能知一万事毕。 一身精神是也。 诚能通之度世方， 诚，实也。 方，道也。 能守其身，必获度世之道也。 脐下一寸名丹田， 下丹田名利机，一名精露，一名交阴，一名命门，三焦右府之命也。 诸肠之纡与脊连， 诸肠，大小肠也。 傅着脊双承胃口对脐，大肠左回十六曲，小肠右回十六曲，通津流回入肠，为滓秽之物，清者后胃过入肾胞，注阴阳为溺，浊者从肺而分，入肠出乃为粪，故通者绝饮食，而神灵爽是也。 方圆三寸名关元， 关元在脐下三寸，一名关明，一名液门，男子藏精之阁，女子藏胎之官。 纵横四方为朱垣， 四方，四向也。",
      "translated_text": "Those who know the true Dao do not decline or weary. Thus, the Five Viscera and Six Bowels reign as kings. The Five Viscera and Six Bowels each have spirits that govern them. Their models converge as one in the Cinnabar Field, named \"the One.\" When virtue abounds and daily grows, the Dao and the One spread transformation to generate the Three Powers. Man, obtaining the One, forms his body and gives rise to the Three Regions. Preserving the Three and guarding the One, he becomes one with the Dao. If you can know the One, all matters are complete—the One is the spirit of the body.\n\nTruly, if one can master this, it is the method to transcend the world. *Cheng* means \"sincerity,\" and *fang* means \"Dao.\" To guard one’s body is to surely attain the Dao of transcending the world.\n\nOne *cun* below the navel is called the Cinnabar Field. The Lower Cinnabar Field is named the Mechanism of Profit, also called Essence Dew, Intermingling Yin, or the Gate of Life—the life of the right府 of the Triple Burner. The various intestines coil and connect to the spine. The various intestines refer to the large and small intestines. Attached to the spine, they bear the stomach’s opening opposite the navel. The large intestine winds left in sixteen curves, the small intestine winds right in sixteen curves, circulating fluids that enter the intestines as turbid waste. The clear portion, passing behind the stomach, enters the kidney bladder, pouring into yin and yang as urine. The turbid portion, divided by the lungs, enters the intestines and exits as feces. Thus, those who circulate qi cease eating, and their spirit becomes bright and clear.\n\nThree *cun* square is called the Pass of Origin. The Pass of Origin lies three *cun* below the navel, also named the Pass of Clarity or the Gate of Fluids. It is the chamber where men store essence and the palace where women nurture the fetus. Extending four directions forms the Vermilion Wall. The four directions are the four cardinal points.",
      "overlap_context": " and vague, there are things.\" The *True Records* say: \"The face is the dwelling of a foot.\" The *Scripture of Western Ascent* states: \"The face should often be rubbed with both hands, following its contours up and down until thoroughly warm. This makes the face radiant, prevents wrinkles and blemishes, and after five years, the complexion becomes like a maiden’s.\" This is called \"circulating qi through mountains and rivers, ever full and unceasing.\"\n\nNone can know whether it abides or perishes—",
      "start_char": 8228,
      "end_char": 8586,
      "start_sentence": 497,
      "end_sentence": 516,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.986007690429688,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "纵横，交会於垣墙者也。 常在中央两关门， 对两肾中央也。 神长五寸衣金文， 旦暮存之，令人不衰，长二寸一分是也。 能大能小变化神。 神，妙万物而为言。 变化自然，运载一体是也。 下念天门依命门， 命门，脐也。 之命始君也。 宗，金门玉阙，一神名桃孩君，摄景气之命始君也。 是天地之元，阴阳之宗，金玉玉阙，房户之宝。 夫人命由桃君所制，魂化精液而生也。 去脐一尺变化神， 一尺，阴下胞上，在大便前，小便后，两阴交会之门也。 中有真人，号日制命。 又人主年月之本，命摄寿夭之问，太一变魂，而并列司命之会，而合对魂帝君，故云司命之神，主典年寿魁柄长短之期，是以混合之府籍，莫不由之。 一名灵华神宗也。 两女夹侍败乱人， 两女，阴中之神，居命门下，和合阴阳皆由此。 若真神竭而精液不通，女则胎落，男则内神耗竭，而祸自连也。 子欲不死，收精内视； 子欲长生，收精返形。 夫人谁不知生之可贵乎，只自不能止交接耳。 既泄之以尾闲，而气浊液漏，脑喊髓竭，徒益以消渍，故非本真而邪其内与，元神渐丧而衰朽日逼也。 《西升经》云：人所以轻命早终者，自令返污之然，非天地毁、鬼神害，以其形故也。 养生之夫，恳绝世事，奏彼山林，将欲断诸浮俗，塞兑炼形，保正吉也。 能为大小惑人心。 不见是而无闷，欲何所惑也，自然心清意定也。 意审三神病去身， 三丹田也。 志诚铃感也。 安乐道经可备矣。 一劳永逸，乃得长生，然后复何言乎！ 唯天道三一为首门，乾坤是也。 合乾坤，定六府， 三生六府，寂然不动，感而不生，寂无为也，遂使念之。 知机真神，穷理尽性。 彼肤耳莫不遂内，修成辟灾厄，长离膏肓，利贞无答。 读如法，精义入神，深研妙啧，神精运化，引息相拥，形质已具还部矣。 五藏生灵，三田内实，却众邪魔若干犯，鬼贼逃亡去万里，入水不濡，猛兽不据，秘五道、守我黄庭，蜜掘阙、镜传贤士，受者获福，当朝太上也。 太上黄庭中景经竟",
      "translated_text": "The vertical and horizontal axes intersect at the vermilion wall. They constantly reside at the central two gateways, which lie between the two kidneys. The spirit extends five *cun* in length, clad in golden script. Storing it morning and evening prevents decline—its length is two *cun* and one *fen*. It can expand or contract, transforming as a spirit. The spirit is that which subtly governs the myriad things. Its transformations arise naturally, bearing the unity of the body.\n\nBelow, contemplate the Gate of Heaven aligned with the Gate of Life. The Gate of Life is the navel, the lord of the inception of life. The ancestral origin is the Golden Gate and Jade Tower. One spirit is named the Peach Boy Lord, who governs the inception of the vital breath of luminous qi. This is the origin of Heaven and Earth, the ancestral root of yin and yang, the treasure of the Golden Gate and Jade Tower, the jewel of the chamber’s portal. A person’s life is governed by the Peach Lord, for the soul transforms into essence and fluids to give birth.\n\nOne *chi* below the navel lies the transforming spirit. This *chi* is above the yin bladder and below the womb, situated before the anus and behind the urethra, at the gate where the two yin meet. Within it dwells the True Person, called the Controller of Life. It is the root of a person’s years and months, the arbiter of questions concerning longevity or early demise. The Great One transforms the hun-soul, and together they attend the assembly of the Lords of Life, aligning with the Hun Emperor Lord. Thus, it is called the spirit of the Lord of Life, who oversees the register of years and the span of life’s authority. It is the repository of primordial unity, from which all records derive. It is also named the Spirit of the Numinous Flower and Ancestral Origin.\n\nTwo maidens stand in attendance, yet they may bring ruin to a person. These two maidens are the spirits of the yin, dwelling below the Gate of Life, through whom the harmony of yin and yang is achieved. If the true spirit is exhausted and the essence-fluids fail to flow, women will miscarry, and men will deplete their inner spirits, inviting calamity. If you wish not to die, gather your essence and turn your gaze inward. If you wish for long life, gather your essence and return to your form.\n\nWho does not know the value of life? Yet one cannot refrain from intercourse. Once essence is discharged through the lower gate, qi becomes turbid and fluids leak. The brain shouts as marrow is exhausted, and all efforts merely hasten dissolution. This is not the original true state but rather an inner corruption. The primordial spirit gradually wanes, and decay draws near. As the *Scripture of Western Ascent* states: \"The reason people treat life lightly and meet early ends is that they themselves invite defilement. It is not Heaven and Earth that destroy them, nor ghosts and spirits that harm them, but their own form.\"\n\nThose who cultivate life earnestly sever worldly affairs and retreat to the mountains and forests. They seek to cut off all frivolous customs, seal the senses, refine the form, and preserve correctness and auspiciousness. They can become great or small, yet their minds remain unconfused. Seeing nothing, they feel no vexation. Naturally, their minds are clear and their intentions settled. When intention is focused and the three spirits are free of illness, the three cinnabar fields are purified. Sincerity and devotion bring resonance. The *Scripture of Peaceful Joy* may then be fully realized. One effort brings eternal ease, and thus long life is attained—what more need be said?\n\nThe Three Ones of the Heavenly Dao are the foremost gate, namely Qian and Kun. Uniting Qian and Kun stabilizes the six palaces. The three give rise to the six palaces, which remain quiescent and unmoving, responsive yet unborn, serene and without action. Thus, one contemplates them. Knowing the mechanism of the true spirit, one exhausts principle and fulfills nature. There is no pore or orifice that does not turn inward. Cultivation completes, one averts disasters and misfortunes, forever leaving the depths of illness. Upright and blameless, one proceeds without hindrance.\n\nRead in accordance with the method: profound meaning enters the spirit, and deep study refines marvelous subtleties. Spirit and essence circulate and transform. Drawing breath in mutual embrace, the form and substance are already complete and return to their proper place. The five viscera generate numinous vitality, and the three fields are inwardly replete. All demonic forces and myriad intrusions flee ten thousand *li*. One enters water without getting wet, and fierce beasts cannot seize them. Guarding the five paths and preserving the Yellow Court, one securely holds the gate and transmits the mirror to worthy scholars. Those who receive it gain fortune and stand before the Most High.\n\nHere ends the *Central Scripture of the Yellow Court*.",
      "overlap_context": "on, divided by the lungs, enters the intestines and exits as feces. Thus, those who circulate qi cease eating, and their spirit becomes bright and clear.\n\nThree *cun* square is called the Pass of Origin. The Pass of Origin lies three *cun* below the navel, also named the Pass of Clarity or the Gate of Fluids. It is the chamber where men store essence and the palace where women nurture the fetus. Extending four directions forms the Vermilion Wall. The four directions are the four cardinal points.",
      "start_char": 8586,
      "end_char": 9406,
      "start_sentence": 517,
      "end_sentence": 559,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.29883599281311,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上黄庭中景经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}