{
  "source_id": "太上洞玄灵宝八威召龙妙经",
  "source_file": "chunked_daozang\\太上洞玄灵宝八威召龙妙经.json",
  "total_chunks": 8,
  "total_original_chars": 9577,
  "total_translated_chars": 60968,
  "total_translation_time": 306.1035170555115,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Eight Might’s Summons of the Dragon**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Eight Might’s Summons of the Dragon*. Author unknown, approximately composed during the Northern and Southern Dynasties. Not recorded in the *Catalogue of Numinous Treasure Scriptures*. Originally one scroll, later divided into two. Source of the base text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, *Benwen* Category.\n\n---\n\n**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Eight Might’s Summons of the Dragon, Scroll One**\n\nThe Celestial Worthy of Primordial Beginning spoke:\nAt the dawn of Crimson Clarity, when the primordial chaos first divided, the primordial net flowed and unfolded. What the Most High composed in the obscure darkness of the Dragon Han era shone with the radiance of crimson script—natural celestial writ, subtle and beyond discourse. Dwelling in the profoundest mystery, it was named *Sea Perfection*, the Dragon King Elder. The King of Sea Perfection, for the sea holds truth, resides at its center, veiled by stellar qi, and is called *Mystic Source*. The one hundred and eighty numinous seas each contain over ten thousand vast springs, their waters connected to the water sacs, surging forth to form the thirty-two lesser heavens.\n\nWhen the time of destruction drew near, mountains and seas tilted as one. The Eight Might spewed forth poison; water and fire threatened to arise. The revolving wheels of the sea spun wildly; peaks and ridges shattered violently. Dragons plunged into abysses; flood dragons and serpents churned the ocean depths. The Dragon King’s attendants, the Three Officials, and the various lords, each following the Dao, recorded and proclaimed the *Great Mystery*. Sea Perfection wrought chaos among the seas, sealing the cavern gates.\n\nThe Celestial Worthy of Numinous Treasure, the Primordial Most High Perfected One, summoned the Eight Might and subdued the Dragon King. Within the crimson-script jade incantations lie texts that can deliver beings from life and death, the crawling and flying multitudes. Their luminous efficacy is to be treasured and concealed, for they avert calamities and exorcise misfortunes. Practiced for a thousand days, they yield results. On the *jian* and *zi-wu* days of the established year, perform the Daoist rites: burn incense, circumambulate while reciting the scripture, and invoke the Eight Might. The Dragon King Elder, upon hearing the scripture, rejoices, bows his head, and closes his eyes. Those who receive the summons scripture shall encounter no calamities or misfortunes.\n\nAt the eight solar terms, ascend the mountains; in the four seasons, cast offerings into the abyss. When great or small kalpas arrive, cast the talisman into the ford. The Dragon King shall receive and welcome you; the Bird Mother shall guide and escort you. Ascend to Jade Capital, where you shall be upheld by the Jade Emperor.\n\nThe Celestial Worthy of Primordial Beginning spoke:\nThe thirty-two heavens contain one hundred and eighty seas, and there are also thirty-two mountain seas and water sacs. The Dragon King Elder roams and observes within the seas, mountains, caverns, and abysses. Where he sees beings fit for deliverance, where he sees those fit for transcendence, he expounds and composes the *Scripture of the Eight Might’s Summons of the Dragon King to Repel Floods and Extinguish Flames*. Constantly practicing this art, one may attain longevity, escape the corpse, avoid the ten sufferings and eight difficulties, deliver the seven generations of ancestors, and ascend to the Vermilion Mound Forest of the Southern Palace. There, one shall naturally partake of food and drink, and the dead husk shall return to spirit.\n\nThe Celestial Worthy of Primordial Beginning, with the Most High Perfected One of Mystic Deliverance, on the eight solar term days ascends the mountains to summon the Dragon King Elders of all seas. Recite the eight covenants, the summons texts, and talismans according to the season.\n\nOn the *Lichun* (Beginning of Spring) day, use nine inches of green silk. In cinnabar, inscribe the commandery, prefecture, county, village, and year of birth, along with the name of the sealed master: \"[So-and-so] bears the Three Departments and Eight Effulgences; the celestial immortals and earthly perfected ever abide within.\" Petition: \"On this *Lichun* day, I submit my name to the *Great Mystery*, erase my name from the register of death, and sever the roots of sin.\"\n\nOn the *Lichun* day, recite the four-directional chants, employing the summons text as before:\n\nAlas! Venerable Dragon Han,\nBrave and mighty, exalted spirit-king.\nCavernous abyss, numinous treasures,\nSummon the Dragon King Lords.\nDemon King, Elder, and Master,\nPrimordial and sagely divine.\nSubdue the might, restrain the eight poisons,\nExtinguish floods, halt the flames.\nWander freely, dispersed in emptiness,\nBody born of water and fire’s light.\nWhen the great kalpa opens for deliverance,\nEons merge into a single age.\n\nOn the *Chunfen* (Spring Equinox) day, recite the summons text and talisman, employing the method as above:\n\nAbyssal depths, the Dragon arrives, venerable,\nWater Mother bears the flying clouds.\nAll empty numinous peaks vanish,\nVast and boundless, none remain.\nCrimson seals the Absolute Vessel Ridge,\nEastern Well subdues the Flower Ford.\nMystic harmony, jade maidens,\nNuminous consorts, Six Jia persons.\nEmpty caverns admit no worthies,\nNuminous sovereign returns to the Nine Mysteries.\nDiligently revere the exalted morning’s work,\nTo attain deliverance and the honored Dao.\n\nOn the *Lixia* (Beginning of Summer) day, use eight inches of crimson silk, inscribing in cinnabar as above:\n\nCrimson radiance, jade script arises,\nGreat Tenuity, flourishing Yu Luo.\nOrthodox light bears cloud effulgences,\nCountenance and virtue beyond measure.\nTransforming and roaming the human Dao,\nSupreme Perfected—who is their home?\nPetition to escape the five difficulties,\nSubdue and summon all celestial demons.\nDragon King emerges, talisman in mouth,\nAll seas turn to dust and sand.\nNuminous peaks do not collapse,\nBlessed lands refine the embryo anew.\n\nOn the *Xiazhi* (Summer Solstice) day, use eight inches of crimson silk, inscribing as above:\n\nVacuous Sovereign bears the numinous flight,\nAbove the Nine Mysteries of Great Empyrean.\nWind and clouds conceal subtleties,\nExpounding and reciting the Five Peaks’ artisans.\nBlessed lands lie in river gorges,\nNuminous mountains hold cavernous sanctuaries.\nImmortal fungi, myriad wondrous medicines,\nRefined and ingested, birth radiant countenance.\nDistribute the many treasure gardens,\nPearls and jades guard the numinous treasuries.\nTridacna, refined beryl,\nAmber, vajra mirrors.\n\nOn the *Liqiu* (Beginning of Autumn) day, use six inches of white silk, inscribing as above:\n\nResplendent, the Great White Star,\nTowering, the lofty and jagged ridge.\nDragon King breaches the Celestial River,\nAll seas unite at once.\nThe thirty-two celestial perfected,\nEach bears the *Scripture of the Mighty Dragon*.\nPassing beyond the later Dragon Han,\nScholars ascend to Jade Clarity.\nContemplating and expelling poisonous beasts,\nRinsing fragrance to bathe cap tassels.\nVast and boundless, endless cliffs,\nProfound and distant, the great numinous.\n\nOn the *Qiufen* (Autumn Equinox) day, use six inches of white silk, inscribing as above:\n\nKalpas turn among the heavens,\nThe great image no longer arises.\nThe Venerable Numinous Treasure of the Ten Directions,\nUltimately named the Perfected in form.\nThe Three Caverns uphold the Dao’s origin,\nTrue and wondrous, the Most High scriptures.\nBearers enter emptiness,\nReciting and chanting, all attain Great Clarity.\nThe Dao is the honored within the true,\nDelivering to endless ages.\nThe supremely true returns to non-being,\nCultivating and studying, soar to Highest Clarity.\n\nOn the *Lidong* (Beginning of Winter) day, use five inches of black silk, inscribing as above:\n\nNuminous birds disorder the Dragon Han,\nPhoenix and flood dragon no longer descend.\nBlessed heads, the Three Terraces’ abodes,\nNamed and ranked, true sorrow forgotten.\n\nScholars of the sacred peaks who bear their satchels and seek masters,\nWith these they wander in joyful pilgrimage,\nDispelling demons through recitation of the Luminous Mirror.\nThe Three Origins trace to the Primordial Ancestor,\nWho expounds and invokes the Dragon Kings.\nThe Eight Might’s poisonous qi disperses,\nAll seas remain calm, no surging waves.\n\nOn the Winter Solstice day, use five inches of black silk, inscribing as above:\n\nGreat radiance illumines the ten directions,\nAll heavens tremble on the verge of collapse.\nThe numinous work, great vehicle’s origin,\nAll seas erupt in towering waves.\nAbove, it founds the Jade Capital’s base,\nBelow, it reaches the abyssal caverns’ realm.\nAll creatures—wriggling, flying, crawling—\nFollow the path in their every movement.\nThe host of demons gird themselves anew,\nReceiving precepts, cultivating the precious scriptures.\nRevolving, transforming by nature,\nTheir forms embrace both being and non-being.\n\nRecite at the eight solar terms, each according to its season.\n\n**Method for the Four Seasons’ Summons**\nOn the days of the four seasons—spring *jiayin*, summer *jiawu*, autumn *jiashen*, winter *jiazi*—cast a water tablet. Use one golden dragon and two azure pearls. For waters flowing west to east, this is the source of the numinous sea. Face directly north, recite the contract three times, linking dragon and pearls together. Inscribe in cinnabar on green silk and place in the water. Further exhort the One Hundred Eighty Great Perfected of the Numinous Sea and the Eight Might: do not release poison. The Dragon Kings will receive the talisman, and their response will be immediate. If no form appears, this water will naturally produce strange sounds and surging waves—this is the numinous. After thirty-two years of cultivation, the Eight Might will come to welcome you, with the Dragon Kings leading the way.\n\n**Additional Summons Ritual for the Exhortation Text**\nThe Three Origin Lords of Grand Mystery, Grand Simplicity, and Grand Tenuity; the Primordial Highest Perfected; the Celestial Master of the Upper Realm; the Jade Maidens of Mystic Harmony; the Numinous Consorts; and I, so-and-so, having previously sealed the Spirit King of such-and-such sea, now guard the abyssal passage against celestial floods. Today, on this day of such-and-such season, I present a golden dragon and azure pearls to honor my late lord, beseeching that my name be entered in the Emperor’s register and my root of death be excised.\n\nCast the water tablet on the four seasonal days, inscribing in cinnabar on green paper. Face north and recite the four contracts in the Brahmā voice:\n\n**First Hymn: The Three Origin Lords**\nThe Supreme Cavern Mystery scriptures,\nThe Three Origins’ numinous treasure, true.\nThe Primordial One utters the jade decree,\nThe ancient words of highest antiquity.\nThe Eight Might’s poisonous qi,\nExterminates demonic worldly dust.\nThe true Dao holds emptiness and profundity,\nLofty and wondrous, honored qi of origin.\nIn the blink of an eye, six kalpas pass,\nAscending the body to join Grand Mystery.\nOne hundred eighty seas boil,\nThe Dragon Han opens its floodgates.\nAbyssal passages link all rivers’ heads,\nWhere birds and humans root in sacred peaks.\nFlood dragons, beasts, jiao, and whales,\nVast and boundless, guard the cavern texts.\nBeholding the aspiring transcendents,\nTheir paths emit flames and smoke.\nHastening the net of Yu Yi,\nGathering the dawn’s radiant essence.\nThe yang light no longer shines,\nThe yin essence no longer gleams.\nThe hundred-six and yang-nine are exhausted,\nGreat and small kalpas alternate anew.\n\n**Second Hymn: The Three Origin Lords**\nThe Eight Might and Dragon Kings,\nAbide in the world without birth or surname.\nFrom qi they spew eight poisons,\nNot sparing those without the Dao.\nThe foolish kind, unwashed away,\nAll assemble in the Five Sufferings’ court.\nCorpses lie across the lands,\nWhite bones strewn upon the roads.\nThe sacred peaks teem with worldly filth,\nAll are ministers of sorrow and vexation.\nIn life, they did not cultivate the scriptures,\nHearing the Dharma, their ears did not feast.\nDiligently strive to extinguish the dull-witted,\nAll wriggling, flying, myriad beings.\nFor offenses received in former lives,\nNow I beseech to be absolved of guilt.\n\n**Third Hymn: The Primordial Highest Perfected**\nVast and boundless, the Dragon Han’s abode,\nHazy and obscure, the sacred peaks’ darkness.\nDistant and endless, the heavens’ palaces,\nFrom chaos the primordial qi was born.\nSilent and still, the secluded cavern palace,\nTowering and steep, the numinous perfected’s court.\nSoaring and drifting, the lofty immortals,\nTheir pure admonitions inscribe their original work.\nDragon scales dwell in abyssal sources,\nTigers and leopards hide in rugged fields.\nNo sight of students seeking the ultimate master,\nOnly echoes of careless, idle voices.\nHungry, they swallow primordial qi,\nThirsty, they drink the mysterious jade essence.\nNurturing their withered bones,\nTo endure through endless ages.\n\n**Fourth Hymn: The Celestial Master of the Upper Realm**\nThe boundless and open palace of the primordial void,\nRecitation and revelation, vast and without shore.\nThe constellations all overturn at once,\nStars and planets transform and flee.\nThe root of the forbidden origin, vast and wild,\nThe *Dinghuang* without stable foundation.\nSinking and floating, turning by fate,\nScorching and withering each in their time.\nThe dawn of non-being, without end,\nAfter ten thousand kalpas, it returns anew.\nHuman flesh, life’s fleeting breath,\nThe ultimate Dharma delivers me from calamity.\nReturning to the path of the Void Sovereign,\nA hundred million years are but a single moment.\nBearing the Eight Might’s talismans,\nTo dispel the eight elemental disasters.\n\nThe Primordial Heavenly Worthy, accompanied by the Dragon King Elder, the Perfected of the Dragon Han, the Eight Might leading the way, dragon scales and tiger-leopards, lions and apotropaic beasts, flood dragons and phoenixes, swans and egrets in harmonious flocks, all come to assemble in the Seven Treasures Palace of the Terrace of Southern Yang. Above, they gaze upon Hong Ya.\n\nAt that time, the Heavenly Worthy of Pure Emptiness and Tranquility expounded the Eight Might Dragon Scripture’s talismanic texts, charts, hymns, and recitations, bestowing them upon the unenlightened. Those who clearly follow the secret transmission rites, receiving the precious jade, must guard it closely—guard it closely. To leak it lightly is to invite the destruction of one’s body.\n\n**Eight Might Talismanic Text**\nWhen performing the Numinous Treasure Retreat, bear this talismanic chapter. All Perfected will come to guide you, and demon kings will not interfere.\n\n**Method for the Eight Might Talismanic Text**\nUse true sandalwood, eight inches long and four inches wide. Encase it in white brocade, one foot long and four inches wide, and store it in a pouch. During the retreat, wear it on the body: the Three Divisions’ eight spirits on the left, the talismanic text on the right. The cinnabar characters inside the talisman must be square and precise.\n\nIn the primordial age, the Most High Original Celestial Worthy of the Primordial Beginning, the First-Born Primordial Lord, the Primordial Essence Supreme Perfected, the Supreme Essence Primordial Unity Lord, the Three Essences Lofty Spirits, the Numinous Treasure Primordial Beginning Lord, the Primordial Beginning Venerable Great Emperor, the Jade Clarity Divine Master and Radiant Yang Master, the Grand Clarity Jade Calendar Supreme Perfected Great Sage Great Immortal Lord, the Five Marchmounts Earth Immortals, and the Numinous Mountain Dao Lord—this humble one, born in [such-and-such] commandery, county, village, and hamlet, belonging to [such-and-such] celestial realm, governed by [such-and-such] constellation, and enfeoffed as [such-and-such] Marchmount Master and [such-and-such] Official Daoist—prostrates in reverence.\n\nHaving heard of the Eight Might Divine Talismanic Text, used to summon the Dragon Kings, and of the Primordial Beginning’s nurturing grace, this humble one has been specially favored by the Lofty Perfected, granted enfeoffment and registry in the Celestial Records, with the roots of death excised. Mighty spirits attend in guard, demon hordes retreat, and one may traverse all seas at will, roaming freely as the talismanic writ commands.\n\n**External Talisman of the Talismanic Text**\nThe true forms of the One Hundred Eighty Sea Essence Dragon Kings and Venerable Ones.\nThe covenant text for transcending great and minor kalpas, expounded by the Primordial Beginning.\n\nIn the primordial age, the Lofty Venerable One, the Most High Great Dao Lord, the Primordial Numinous Venerable Master, the Boundless Dao Worthy, the Eastern Mansion Supreme One, the Southern Culmen Venerable One, the Western Numinous Grotto Mother, the Northern Mysterious Perfected One, the Central Palace Supreme Emperor, and the Yellow Venerable Primordial Lord—together they roamed the assembly at the Abyssal Confluence, traversing the myriad heavens and the Dragon-Han interval. In clarity and quiescence, they recorded the revolutions of the kalpas and the reckoning of transcendence.\n\nThe Multitude of Origins dispatched the Mysterious Harmony Jade Maidens and Numinous Consorts, twelve each, bearing the Most High Cavernous Mystery Numinous Treasure texts for great and minor kalpas, the Eight Might Talismanic Text for summoning the Dragon Kings, transforming the hollow emptiness, refining the true spirits, guiding and leading the living diagrams, and pacifying the Twenty-Four Perfected Spirits. This scripture, most exalted and wondrous, was conferred upon the White Stone Cavernous Mystery Transcendent Realized One, who studied and transmitted it to the Lofty Supreme Dao Lord. The Lord transmitted it to the Jade Immortal Metal Mother, who passed it to the Most High Lady Li; she to the Northern Culmen Venerable Master, who transmitted it to the Radiant Yang Master, who in turn passed it to the Grand Harmony King Lord. These lords and their disciples studied it through countless Dragon-Han kalpas, then returned to their cavernous abodes, concealing themselves and no longer emerging. Of those who studied the Most High Cavernous Mystery Numinous Treasure scriptures, not one in a hundred succeeded.\n\nIn the era of the Supreme August One, the Lofty Venerable Master expounded it, appointing flying immortals as seed-sent envoys to bear the thirty-six divisions of wondrous scriptures of the Primordial Beginning Celestial Worthy of the Primordial Age, sealing and depositing them in the grottoes of the Five Marchmounts and Numinous Mountains. Those of utmost virtue in the world may perceive its texts of their own accord.\n\nOn the eleventh day of the seventh month, the first year of the Cheng Emperor’s reign in the Eastern Jin, the Celestial Worthies of the Ten Directions’ Numinous Treasure descended, opening the cavernous scriptures and expounding the Dharma to deliver beings. Thereupon, they conferred this scripture upon the Cheng Emperor. Ascending the Ten Perils, they left its texts in the world to transform and deliver all, illuminating the secret transmission.\n\nThe Cheng Emperor received the scriptures for great and minor kalpas, along with the covenant’s ritual implements: five taels of yellow gold, a pair of gold rings, five-direction patterned silks, a golden dragon, a jade fish, two azure pearls, a censer of broad mountain incense, a ritual mat, ten taels of white silver, and nine attendants for the upper kitchen. The covenant of seven, five, and three was sworn, employing these offerings to invoke the Primordial Numinous Venerable Master and the Primordial August Celestial Worthy.\n\nThe altar was erected upon a cliffside, commanding a distant view of numinous springs and removed from worldly folk. Once the altar was complete, the Dharma Master faced east to proclaim the covenant:\n\nThe recipient, disciple of [such-and-such] prefecture, born of defiled terrestrial qi and the dull-witted masses, has encountered the Primordial Beginning and been graced by harmonious qi, gaining sight of the wondrous texts. Now, presenting the ritual implements, this humble one petitions for the covenant, swearing by the myriad ancestors.\n\nThis disciple, of [such-and-such] commandery, county, village, and hamlet, bearing the name [such-and-such] and the style [such-and-such], aged [such-and-such] years, born beneath the [such-and-such] celestial stem—a defiled vessel, yet graced by numinous harmony, recorded in the Three Origins, nurtured by the Three Caverns—remains ignorant of past lives and the roots of sin, yet awakens to the arts of immortality. Formerly, this humble one sought out the Dharma Master [such-and-such], receiving the Most High Cavernous Mystery Numinous Treasure’s exalted and wondrous scriptures. Their entry and exit are beyond conception; their Dao is most wondrous and precious, beyond the capacity of this humble one’s inferior talents, putrid bones, and foul flesh to bear or recite. Yet, without self-assessment, this one aspires to daily renewal, advancing without retreat.\n\nHaving heard of the Primordial Beginning’s expounded teachings on great and minor kalpas, the Eight Might’s summoning of Dragon Kings, the transformation of hollow emptiness, the Twenty-Four Perfected Spirits, the guiding of the Three Luminaries’ cavernous mystery roots, the precious jade’s exaltation, the Cavernous Unity’s truth, and the essential secrets of the Supreme Perfected—truly, these are rarely heard. This humble one prostrates, head bound, begging for accomplishment. Humbly entreating the Illustrious Master to bestow grace and transmission, this one dares not lightly disclose it. After the covenant is sworn, the seven ancestors serve as witnesses, and this one will seal away the precious jade. Should there be any proclamation or careless disclosure, this humble one’s body and household shall atone to the Three Officials of Heaven, Earth, and Water. Even unto the ten thousandth extinction, this one dares harbor no resentment.\n\nOn [such-and-such] day of [such-and-such] month and year, in [such-and-such] commandery, county, village, and hamlet, the disciple of the Three Caverns and Three Radiance, the Vajra of the Grand Ultimate and Non-Ultimate, the Left-Ruling Divine Supreme Master, the Great Transmitter of the Three Sovereigns and Five Marchmounts, the Northern Marchmount Master and [such-and-such] Official Daoist, the remote descendant and minor portent Realized One [such-and-such], bows twice and prostrates to petition and proclaim:\n\nSupreme petition to the Most High Primordial August Supreme Highest Great Dao Lord, the Primordial Numinous Venerable Master, the Boundless Dao Worthy, the Eastern Mansion Supreme One, the Southern Culmen Primordial Lord Venerable One, the Western Numinous Grotto Mother, the Northern Mysterious Unity Lord, the Central Palace Venerable Master, and the Ten Directions’ Supreme Perfected—this humble servant [such-and-such] petitions the Primordial Lord to manifest the scriptural Dharma and bestow enlightenment.\n\nNow, this humble one [such-and-such] respectfully presents the ritual implements, seeking to behold the scriptural titles. This servant, having departed on [such-and-such] day of [such-and-such] month and year, respectfully sought out the Grotto Master of [such-and-such], the Five Numinous Perfected One and [such-and-such] Palace Daoist of [such-and-such] commandery, county, village, and hamlet, to jointly proclaim the covenant. Precious substances and pearl jades served as tokens, and the thirty-six divisional catalogues were transmitted, separately petitioning the Eight Radiance Divine Perfected for the great and minor kalpas’ revolutions and transcendence, the transformation of hollow emptiness, the circulation through the Five Marchmounts, and the great dwelling of the Numinous Mountain.\n\nNow, the Master of Ceremonies and Libationer [such-and-such] of [such-and-such] prefecture and commandery presents the ritual implements—five-direction patterned silks, golden dragon and jade fish, azure pearls and white silver, ritual mat and incense censer—seeking to proclaim the covenant, receive the transmission of precious secrets, pacify the state and save the people, bringing joy to the land and banishing all woes, to roam the Five Marchmounts.\n\nWherever one traverses—great rivers and lakes, mountains and streams, valleys and ravines—all the host of spirits come forth to await and welcome, while dragons, scaled beasts, tigers, leopards, lions, and apotropaic guardians ever assemble in attendance. The Perfected of Heaven and Earthly Immortals overshadow one’s body.\n\nOnce the ritual of transmission and deliverance is complete, [the adept] such-and-such, following the prescribed observances, humbly petitions the Most High of Antiquity to proclaim to the Thirty-Two Heavens, striking such-and-such’s name from the register of the dead and severing the roots of all transgressions. The disciple then turns toward the east, prostrating one hundred and eighty times and bowing thirty-two times, scattering hair in the four directions.\n\nSuch-and-such further petitions the Most Numinous Perfected of the Mystic Grotto-Heaven of such-and-such mountain, seeking to proclaim the covenant of such-and-such scripture. May the Most Numinous Perfected of such-and-such mountain act as sponsor, granting such-and-such a lifespan equal to the Sacred Marchmounts, unwaning through the kalpas.\n\nThe disciple recites the proclamation of the covenant:\n\nBoundless, the fathomless cliffs,\nDragons and scaled beasts come forth in welcome.\nBeyond the western wanderings of the Water Mother,\nThe scorching fires no longer harm.\nAscending the Jade Capital’s towers,\nOne soars aloft, drifting on high.\n\n*End of the Upper Scroll of the Wondrous Scripture of the Eight Mighty Summons of the Dragon, from the Numinous Treasure of the Dao of Supreme Mystery*\n\n*Beginning of the Lower Scroll of the Wondrous Scripture of the Eight Mighty Summons of the Dragon, from the Numinous Treasure of the Dao of Supreme Mystery*\n\nThe Lord of the Dao declared: The Most High Primal Lord and the Supreme Emperor of the Boundless Non-Ultimate roamed the Kunlun Jade Capital Mountain, accompanied by the Wondrous Practitioner Perfected, the Supreme Perfected Lord, and the Supreme Perfected Elder, along with twenty-four hundred Perfected Immortals from the Five Marchmounts and Four Waterways, all descending together.\n\nThereupon, they invited the Lords of Heaven, Earth, and Humanity to jointly descend upon the Dark Capital Mountain. A host of officials encircled the terrace-palaces, listening to the exposition and discourse of the Dharma.\n\nAt that time, the Elder of the Dragon Abyss, known as the Dragon Lord, arrived leading tens of thousands of dragons to attend the Three August Supreme Emperor Lords, listening to the discourse on virtuous teachings and the performance of meritorious deeds. He sighed, extolling the unsurpassed Dao and virtue, inherently exalted in the supreme void beyond the non-ultimate, the great vehicle of the hundred and six kalpas’ deliverance through boundless transformation, exhorting goodness and salvation from the cycle of birth and death, tirelessly guiding and instructing.\n\nThere were also ninety-six hundred million paths of the Orthodox and Perfected, all through the accumulation of merit and virtue beyond reckoning, employing the Dao to transform and teach the methods of life, wielding skillful means to universally deliver and eradicate all roots of evil and death. Cultivating the heart of the Four Immeasurables, they rescued those harmed by calamities and misfortunes, where heaven and earth lay withered and the people cried out in distress.\n\nThe Dragon Lord then transformed, leading tens of millions of dragons from beyond the Western River’s deserts and the boundless Yu Abyss. Bearing water and riding clouds, they spread across the world, universally bestowing vast rains to moisten and nourish. The spirits of the Five Marchmounts and Four Waterways universally stirred clouds and mist, shading the heavens and covering the earth, delivering the world from drought and thirst.\n\nWithin days, water and land were universally suffused and moistened, valleys and streams filled to overflowing, vast and surging. Then, twenty-four myriad celestial maidens were dispatched from the heavens to escort the Supreme Emperor of the Non-Ultimate, descending beneath the canopy of heaven. They chanted verses and performed dances, circling within the Four Seas, celebrating the joy of the celestial people receiving blessings. The nation enjoyed great peace, and all under heaven rejoiced, their voices harmonizing in unison.\n\nAt that time, the Lord of the Great Dao, the Lord of Virtue, and the Supreme Emperor Lord—three august perfected divine beings—along with the lofty sagely Wondrous Practitioner Perfected, the Celestial Thearch, the Supreme August, and myriad billions upon billions of hosts came in person to attend. Innumerable jade lads and maidens, bearing incense and flowers, descended beneath the canopy of heaven to welcome the Three August Ones and Four Perfected, the Lord of the Non-Ultimate, Non-Precedent, and Primal Origin, the Supreme Emperor and Great Divine Lord, the jade lads and maidens, and the jade maidens of incense and flowers. Singing in harmonious chorus, they advanced with the myriad spirits of heaven and earth and the tens of millions of celestial maidens before the thrones of the Three August Supreme Lords, kneeling reverently.\n\nThen, the Dragon Lord led tens of millions of dragons to prostrate before the Supreme Emperor. After a long while, the Dragon Lord addressed the Supreme Emperor, saying: “Since the Three Lords received the mandate of the Three August Ones and the inception of creation, they have not encountered the ninety-six kalpas of the Yang Disaster. Now, after the great drought following the flood, nine thousand nine hundred years have passed. The scorching Yang obscures the abyss, and the Water Mother has fled into hiding. Thus, the withered Yang conceals its radiance beneath the Nine Springs, while the blazing barrier spreads within the Eight Extremities. The myriad people wither and perish, crying out to heaven in lament. Of those parched to death, more than half of the world’s three parts have been consumed, scorched to near extinction. After three years, all wickedness shall be exhausted.”\n\nThe Supreme Emperor then summoned the Dragon Lord and commanded the Lord of Yu Abyss to lead tens of millions of dragons to spread the celestial net, bearing water to sprinkle and moisten. Within ten days and a month, those who had withered to death were all revived. In the lands, barely one-tenth of the people remained as survivors. Observing and examining them, they asked by what cause they alone had endured, withered yet not perished.\n\nThe survivors said: “We who suffered the cruel drought yet did not perish were precisely those under the scrutiny of the Three Offices. Our ancestors had accumulated meritorious virtue, and their merit extended to us. Moreover, we cultivated ourselves, never straying into wrongdoing, accumulating diligence and piling up virtue, protected by the celestial officials and nurtured by the earth spirits. Thus, scholars such as we should have been ranked among the partial immortals, yet we were unjustly subjected to judgment. When the fires of refinement were first unleashed, the Three Offices of Heaven, Earth, and Water reviewed the merits accumulated by our ancestors, which extended to our own bodies. Our meritorious deeds were recorded, our names left in the Southern Palace. When the time of later calamities came, our cases were thrice memorialized. The Lord of the Southern Marchmount and the Envoys of the Blazing Barrier witnessed the grace of deliverance and petitioned the Celestial Thearch and the Envoys of the Fire Pearl. The radiant talismans of the Golden True Tiger and the Majestic Golden刚 of the Great One, along with the luminous Perfected Phoenix Talismans, were invoked to shield and sweep away the flames, allowing the flying embers to disperse. The Immortals and Sages, together with the Great Golden-Mouthed Birds, came to deliver us, enabling us to escape the calamity and survive, a result of our accumulation of virtuous deeds and the response to our good blessings.”\n\nShould one not diligently cultivate fasting and vigilance?\n\nThe Dragon Lord said: “The merit of accumulated goodness all arises from the Dao. Those who wish to establish merit and accumulate virtue must rely on the fasts of the Supreme Numinous Three Treasures. Through years and months of tireless practice, the Directors of Destiny memorialize their meritorious deeds to the Upper Heavens. The Celestial Thearch commands the Three Offices to record their achievements, enabling them to transcend the Three Calamities and Five Difficulties. The merit of fasting is especially weighty—how could one not diligently pursue it? The root of all future lives is thus firmly established.”\n\nNow, I have compiled and presented the *Scripture of the Supreme Eight Mighty Summons of the Dragon*. The upper chapter invokes and entreats the dragons, while the lower scroll recounts their origins.\n\nThe Supreme Lord of the Great Dao spoke of the cycles of hardship and prosperity, of withering followed by flourishing, and then intoned this ode:\n\n“Vast and boundless, the Dragon Lord,\nEndowed with heaven’s supreme numen.\nYet when the Yang-Nine calamity struck,\nAnd the Hundred-Sixth cycle brought ruin,\nThe myriad people parched and withered,\nDying of thirst in the abyssal pools.\nThey raised their faces to heaven, sighing,\nPleading for mercy amid the flames of disaster.\nTheir cries of sorrow and lament\nTroubled the radiant Perfected of Heaven.\nThe Upper Heavens, moved by their plight,\nSummoned the Dragon Kings.\nBut the dragons fled in terror,\nConcealing their forms in hidden shadows,\nHiding in the depths of Yu Abyss,\nWithin the caverns of cliffs and stones.\nThen the Eight Mighty Decrees were issued,\nCommands intersecting and converging.\n‘Let any Dragon Lord\nWho bears the girdle of the Five Stars\nStrike the cliffs of Yu Abyss—\nLet the dragons take flight with roaring cries!’\nA thousand myriad came to the rescue,\nReceiving merit and renown.\nThey gathered the Rain Masters,\nWeaving clouds over the imperial capital.\nFor three days and nights,\nThey cleansed the abyss, restoring purity.\nCrops flourished in abundance,\nAnd the myriad people were revived.\nThe four seasons harmonized,\nAll enjoying peace and prosperity.”\n\nThe Supreme Lord of the Great Dao said: “In praise of the Dragon Lord’s great merit—how majestic is his virtue!”\n\nThose who expound this teaching observe the Five Precepts, as follows:\n\n“With a heart full of compassion, guide many,\nAnd the heavenly Dao will open the dark.\nCherish and protect, dispelling sorrows,\nSo merit flows to future generations.\nThe Dao does not fail those who act,\nYet people bring misfortune upon themselves.\nWhy does fate turn against them?\nGood-hearted ones grow desolate.\nDiligently urge the cultivation of goodness,\nTo transcend disasters and grasp salvation.\nThe Dragon’s might and virtue are vast,\nHis beneficence bearing heaven’s numen.\nSaving and reviving all under heaven,\nNone fail to receive fortune and glory.\nOnce the Yang-Nine calamity is averted,\nThe Hundred-Sixth cycle is pacified.\nWithered lands are drenched with blessings,\nTurbid afflictions become clear and pure.\nThe Eight Mighty Commands and decrees,\nThe precious talismans and the Emperor’s Jade,\nAll are talismans to subdue poison,\nDiminishing the might of demonic hordes.\nThe Dragon King approaches the riverbank,\nThe dragons emerge with startled cries.\nMerit accumulates, and ten thousand blessings descend;\nLong fasts amplify the sound of praise.\nNone fail to come from goodness,\nTheir might reaching the Upper Numen.\nFortune descends like thunder from heaven,\nThe deaf hear, the mute speak.\nThe blind regain their sight,\nThe lame rise and walk.\nThe good are aided by spirits,\nThe wicked punished by demonic thieves.\nThe Dao takes goodness as its root,\nVirtue takes trust as its light.\nCompassion and filial piety—heaven loves them;\nDiligence in the Dao keeps fate from toppling.”\n\nThe Dao Lord said: “The Dragon Lord’s merit is weighty and great—truly, how excellent! This is the legacy of past deeds that have touched the heart of heaven, and none fail to be moved. How much more so the beauty of the precepts and disciplines expounded by the Divine Perfected and Supreme Perfected!”\n\nThe Dao Lord addressed the Dragon Lord: “You have inherited the merit of past lives, your virtue already manifest, becoming a blessing to all. Your recent labors, especially within the Three Treasures, stand as a testament to your merit. Now, heed my precepts and ponder my words, for I shall further expound the primordial methods of the Great Dao. These words are of utmost importance, guiding the cultivation of boundless goodness.”\n\nThe Dragon Lord said: “What are these great deeds of goodness? I wish to hear and reflect upon them. I shall receive your precepts anew, proclaim them to the ten directions, and encourage the hearts of goodness, that they may never grow weary.”\n\nThereupon, the Supreme Lord of the Great Dao replied to the Dragon Lord: “There is yet another method for Daoist practitioners of goodness. Such a person, adorned with all auspicious marks, obtains the precious scriptures of the Perfected of the Dao. The Perfected of the Three Sovereigns’ Cavern possess the *Great Precepts of the Supreme Perfected*, the cinnabar talismans and ink registers, along with the *Hidden Writings of the Three Sovereigns of Jade Clarity*, the *Cinnabar Scripture of Supreme Clarity* for flying stones and concealment, and the esoteric arts of the numinous youth’s cinnabar—all are true and authentic. The wondrous subtleties of the Dao are recorded in the primordial registers of heaven and earth; their words are clear. The essentials of ascending as an immortal are most weighty—how could one not diligently pursue them? Cultivate goodness with mindfulness.\n\nThe words of the Supreme Dao are the foundation of utmost trust. Great goodness is majestic, governing the lesser vehicle’s methods, which must be restrained and limited. There should be moderation, and moderation must have its bounds. Its might lies in the practice of the greater vehicle, which observes all things. The merit of the Three Treasures enables all beings to progress gradually.\n\nIt is said that the Dragon Lord, through the merit of past deeds and accumulated virtue, possesses thirty-three precepts, adhering to the rites of the thirty-two heavens. These precepts all begin with the encouragement of goodness. Furthermore, there are sixteen practices to enhance wisdom and manifest boundless kindness. What are these sixteen practices that augment wisdom?\n\nBestow goodness upon the multitude, aligning all as if true;\nLet precepts be unbroken in word;\nPatience is not merely endurance;\nAdvance with unwavering resolve to attain concentration;\nAll practices are complete;\nWisdom and sincerity are perfected;\nAll actions are fulfilled;\nServe as the Dao requires;\nRoam in tranquility, delighting in the gate of stillness;\nCultivate the six virtues of the worthy;\nPossess the ten virtues;\nAdorn body, speech, and mind with virtue, maintaining integrity;\nKnow contentment, delighting in stillness;\nExhort oneself thrice to advance;\nCultivate inner and outer goodness;\nEncourage all virtuous deeds;\nAnd practice the sixteen methods of conduct.\nThus, one receives auspicious fortune,\nDevelops the mind of great wisdom,\nAnd is rewarded in the era of the Great Dao.\nExpound and disseminate wisdom,\nFlowing transformation to later generations.\n\nMoreover, the Dragon Lord possesses twenty-two aspects of the heart of good wisdom, also intended to eliminate obstacles and uphold the aspiration of the greater vehicle—lofty and pure. The affairs of Supreme Clarity reject the turbid, suppress the vulgar, avoid idle talk, refrain from improper conduct, cast aside wickedness, grasp wisdom, and cultivate good methods. Thus, the Dao is penetrated, and the Dao is great.”\n\nThe Dragon Lord’s majesty has already been established, having entered the Greater Vehicle—how much more so for those of the Supreme Clarity? The Dragon Lord further practices the twenty-two methods, which advance wisdom and inspire the heart, fostering faith and compliance. No demonic officials, heterodox followers, or external deviants can withstand them; they are repelled and driven back. What is meant by \"inspiring beyond the hearts of ordinary people\"? My heart’s resolve is fierce and steadfast; what it guards is unshakable. With unyielding practice, the heart does not slacken or rest.\n\nWhen inspired, it is as if the majesty of heaven and earth, the might of spirits and ghosts, the authority over the vulgar and the false, the power over poison and hunting, the dominion over the improper and the inanimate—these eight strategies of awe—take form. Awe is like the unbreakable conduct of the great vajra. The Dao states: The Dragon Lord Perfected possesses twenty-two methods of inspiration, capable of majesty, embodying unwavering and resolute conduct, and manifesting the heart of universal wisdom. All demonic beings, external deviants, and heterodox paths dare not oppose the Dragon Lord’s inspired control.\n\nThe Dao does not act in vain; thus, it has its rules and rituals. The Dao says: When rivers and seas surge, the sun scorches, and the four directions are parched, clouds gather to bring rain. When the wind stills and the downpour ceases, the Dragon Lord commands the Perfected. At the moment of majestic vibration, the dragons take flight in alarm. Clouds halt and mists converge, sweeping across the world, nourishing the withered and dry. Five fragrances spread through the courtyard—this is the great illumination of the Great Dao. Such conduct of great goodness—how excellent it is!\n\nThe Lord of the Great Dao says: After the Dragon Lord Perfected has exerted his majestic command to summon the dragon hosts, one must first offer sacrifices to honor the Great Dragon King, perform rites for the River God, Wind Earl, and Rain Master, and invoke the Dragon Lord, River Earl, Water Gods, and Yuanyuan Envoys. After three invocations of prayers, fast for three days, then stand by the flowing rivers and recite this upper chapter of the covenant text. When performing the sacrificial rites and covenant oaths to summon the dragons, one must also reverently honor the River Earl, the Five Peaks, the Four Waterways, and all the gods.\n\nThis is called the descent of heavenly qi and the ascent of earthly qi. The pouring of great currents requires the union of yin and yang, the mutual resonance of the Two Modes, and the harmony of the four seasons. The Five Peaks bow in reverence, the Four Seas merge in darkness, the River God commands the dragons, and Yuanyuan overflows. The Eight Gates open—thus the Dao is accomplished, and its merit is great.\n\nThe Primordial Perfected Dragon Lord says: Having received the method of summoning dragons to bestow seasonal moisture, yet not having witnessed the transformations of the Five Illuminations—what are the Five Illuminations? The first is the illumination of the Upper Cavern’s desirelessness; the second is the illumination of the mutual clarity of self and other; the third is the illumination of the Five Penetrations and Nine Unions; the fourth is the illumination of wisdom responding to circumstances; the fifth is the illumination of gazing afar into the ten directions, unimpeded and without obstruction. These are the Five Illuminations of the Cavern.\n\nThe radiance of the Five Illuminations first receives the essence of the Three Sovereigns and Five Stars, then the numen of the Five Peaks and Four Waterways, and further the brilliance of the Five Fragrant Mushrooms. The Five Fragrances’ illumination reaches even the distant lands beyond the seas. One plant has five roots, one stem five branches, one branch five leaves, one segment five nodes—five and five correspond. Thus, the immortals and sages name it. When the Five Fragrant Wood is burned for ten days, its smoke ascends to the Nine Emperor Heavens. It embodies the heart of great compassion and the sagely virtue of transformation.\n\nThe Lord of the Great Dao further instructs the Dragon Lord: When propagating good methods, if there are those who delight in performing purification rites and seeking the Dao, who possess sincerity and faith, and are fit to cultivate the essential Dao, then bestow it upon them universally to illuminate the divine transformations of the Dharma. Thus, later worthies will inherit the unbroken goodness of enlightenment.\n\nThereupon, the Dragon Lord receives the command, mounts his dragon, and flies to assemble at the Dragon Pond of Yuanyuan. Leading the dragon hosts, he descends upon the various lands, universally enabling those in the world who require rain or drought to follow the covenant text of the upper chapter, performing rites and oaths to the Water Officials, River Gods, and their kind. Then, the Dragon Pond Elder will open the pond’s clouds, bearing water to sprinkle and pour.\n\nThe Lord of the Great Dao says: Command the Perfected Dragon Lord to act in a timely manner for those in need, providing regular sustenance to the Heavenly Immortals, Flying Immortals, and their officials, as well as the customary attendants of the Heavenly Officials. When not entreated for rain, recite the upper and lower chapters of the *Scripture of the Dragon King*. Let the sound be sorrowful and earnest, chanting toward the flowing river seven times each. Next, the Dharma Master praises and intones the good, moving the River God and stirring the dragon hosts to sorrow. Suddenly, they appear naked in the eastern and western directions. After three days of such devotion, daylight shines brightly, and the night becomes luminous—a response to the entreaty for clear skies.\n\nThe Lord of the Great Dao further commands the Perfected Dragon Lord: If, when performing purification rites, the heavens are severely parched, the earth stirs with dust, and months pass without moisture, with scorching yang unrelieved, then summon the Dragon Lord to beseech rain. Recite the upper chapter’s covenant text and the lower chapter seven times each, with mournful and beautiful tones. The Heavenly Perfected Dragon Lord will swiftly mount his dragon and descend. As in the upper chapter, recite both chapters, completing seven repetitions each within a day and a night. Perform rites to the River God and Dragon Lord, dispatching the dragon hosts to fly into the Four Seas and rivers, ascending to bear water, roaming and spreading across the heavens. A torrential downpour will pour for three days, raining for three nights. First, arrange incense, lamps, and continuous offerings day and night. Then, the rain will arrive with a sudden gust. The true power bestowed is boundless, like branches and leaves flourishing in abundance.\n\nThe virtuous conduct of the sagely king ascends in great goodness, transforming beyond all ordinary limits. The command and summons are most difficult, yet the matter is swiftly accomplished. This is the pure and cleansing response of the Dragon Lord’s divine transformation—how could any but the most refined ruler achieve such a descent? Vast and level, it is not to be slighted.\n\nThe supreme words of the Dao’s truth encompass four kinds of great meritorious conduct. What are the four practices? The Dao says: Cultivating purity and stillness is the first practice.\n\nTo set one’s will upon the Dao-heart is the second practice. Transforming beings through virtuous influence to achieve completion is the third practice. Establishing meritorious works and employing skillful means to deliver the lives of sentient beings is the fourth practice.\n\nWhy, then, does one cultivate these four kinds of merit? The Dragon Lord True One says: There are also eight upright practices. Those who enact the eight majestic commands of restraint and summoning all proceed from the heart of the true Dao. If matters are not in accord with the Dao, one must not allow one’s own virtuous worthies to witness unprincipled ordinances. One must clearly proclaim this. If the proclamation of virtue is not universal, the fault lies with the Brahma Lord for not instructing his disciples and masters. It is the master’s responsibility.\n\nThe Dragon Lord True One further says: I have also heard that the Dao encompasses three realms. What are the three realms? Advancing with diligence in cultivating virtue, one practices in accordance with emptiness and non-being, attaining purity in the formless realm. Having purified one’s nature and life, one is also able to transcend the Dharma-realm. When the Dharma-realm is pure, then the numerical realms are pure; when the numerical realms are pure, then the innumerable realms are pure; when the innumerable realms are liberated, the three realms are pure. When the three realms are pure, the eye-consciousness realm is pure; when the eye-consciousness realm is pure, the mind-consciousness realm is pure; when the mind-consciousness realm is pure, the empty realm is pure; when the empty realm is pure, all Dharma-realms are pure. Because of this purity, all dharmas are equally pure. Just as emptiness is pure in its emptiness, so too are sentient beings purified. Because of this purity, sentient beings abide in it. Thus, there is no duality, nor does one cling to the non-dual. Because there is no duality, the Dao is pure. Speaking thus, this is the supreme purity of the Dao.\n\nThe Dragon Lord True One further says: The Dao speaks of non-existence, and the multitude of thoughts does not think of the Dao. All thoughts are utterly purified. If one ascends to the wondrous quiescence of that realm, it is forever without gate—this is called the gateless. Thought should be without thought; the Dao of no-thought is also without cognitive thought. The Dao is entirely without substance, entering into profound obscurity. Practicing this no-thought, the Dao of no-thought is most true.\n\nIf the Dragon Lord True One wishes to practice this Dao with a pure mind, one must clearly understand pure conduct and also ensure that one’s body, speech, and mind generate pure conduct in receiving qi. From non-being, the mysterious endowment of being arises—this is called the Dao of generation, the root of the Dao.\n\nThe Dragon Lord True One asks: What is meant by the perfection of bodily conduct? The Dao says: Bodily conduct encompasses the dharmas of past, future, and present lives. The future has no end, the present is like a fleeting scene, and the end is without limit. That which is without limit is called bodily conduct. Furthermore, when bodily dharmas converge through causes and conditions, those causes and conditions age and become empty and thoughtless, serene and without念. In such subtlety, the Dragon Lord now wishes to model this Dharma, observing the body in this Dao. One must not fail to exert diligent effort, thereby attaining the true Dao.\n\nThe Great Dao Lord says: Dragon Lord True One, if you ride this pure heart and are born into the realm of desire, yet dwell in the form realm among the assembly of Brahma gods, abiding in stillness and advancing without restlessness, then you, Dragon Lord True One, are able to transform and guide gods and humans with skillful means. Or, if born in the form realm yet manifesting in the desire realm with form, and associating with the gods and the thoughts of sentient beings, sitting and rising without awareness of weariness or arrogance, and without the worthy and virtuous belittling themselves—through such conduct, you purify all concentrations. Receiving them with a rectified mind, in the supreme Dao, none fail to soar through the mysterious void.\n\nThe Great Dao Lord says: When the True One has fully aligned with the conduct of spontaneity, possessing a body of purity, the practitioner is truly great. If one stabilizes the body yet does not follow the stability that arises from it, there arises a mind of advance and retreat—this is not the reception of the true. It is like the beginning of the teaching of the Supreme True One, which also employs virtuous skillful means. If a Daoist, resolved in study, understands purity, and soars with boundless transformation, this may be called diligent cultivation—the Dao does not betray one.\n\nThe Great Dao Lord says: I have also heard that at the beginning of the Dragon Lord True One’s teaching, one seeks the Dao without relying on habitual practice. Not practicing, yet not practicing the thought of the Dao—this is how one may know the conduct of the Dao. One does not practice the expectation of the Dao, nor does one originally seek practice to understand it. Or, if one’s bone structure already penetrates this fundamental principle, not practicing what is generated, yet aspiring toward the practice of non-practice in the Dao, one extinguishes and transcends even the Dao of understanding life and death. Practicing non-practice, holding念 constantly in the Dao—is this not luminous? The Dao will be luminous.\n\nThe Supreme Dao says: When the Wheel of the Three Caverns of the True Void turns, the immeasurable Dragon Sutras also cause the dragons to rejoice and leap. The Dragon Lord further says: The true Dao is not distant; the three and five return again. In clear skies, observe the signs, seek rain, and summon the dragon. When the Dragon Lord descends once, his whistling and singing resound. He sprinkles and nourishes the parched seedlings—what is requested is not excessive. The river officials of Yu Yuan, the five sacred peaks—preaching the Dharma and teaching transformation, only goodness is loyalty. Filial piety and compassion flourish, unmatched under heaven. The regulations and methods established may awaken one to the dragon. When the Dragon Lord descends once, none fail to submit.\n\nControlling and summoning the true, even the demon kings are obtained. The myriad ghosts vanish like shadows, and the spirits of the wilds bow. The five paths are severed, and one ascends to the lofty Song Mountain. Together, they issue the fast texts, instructing the young and ignorant. The golden talismans flow like water, resplendent with precious seals. On the left, the Six Jia are girded; on the right, the seal is worn. Only the Three Realities are contemplated, held within the heart and breast. Resolved in the Dao, diligent in fasting—why inquire about soaring through the void? The soaring void is the long Dao, long instruction in ease.\n\nIf the Dao is not obtained through practice, why suddenly entertain thoughts of practice? Seeking the Dao, return to emptiness and non-being; at times, one must establish form and image. If one’s will is not firm, one emerges and follows appearances. Not delighting in the practice of the Dao, one sweeps away all defilements and decay. The true Dao is entirely without practice; purity dispels demons and specters. If one arises in practice, sincerity and wonder may become constant.\n\nThe Dao says: Without the念 of self, the念 of self vanishes without a trace.\n\nExtinguishing thought arises from emptiness; from emptiness, true reality is born.\nIf you can cultivate goodness and transformation, goodness and transformation bring forth the true numen.\nWho knows the true Dao’s worth? The golden elixir lies within your form.\nNurtured beneath the mysterious womb, life is prolonged and enduring.\nWhy pursue a short life, unwilling to release primordial essence?\nPrimordial essence is easily known—securely dwell in the wondrous, mystic city.\nBetween the sun and moon it opens; bells resound as officers and soldiers gather.\nWho can awaken to this truth? It resides in the thought of the Three Origins’ court.\nFailing to seek my Dao, you instead invite calamity’s punishment.\nThe body perishes on the peaks of the Blade Mountains, dishonored and the Dao’s name ruined.\nWhy not cultivate fasting and uprightness, to live ten thousand years free from drifting?\nOnly fear that merit is not accumulated; do not fear that accumulation will not succeed.\nThe great Dao does not speak idly—I fear you will entangle yourself in sin’s net.\nThus I reveal the treasure of the Three Caverns, exhorting you to nurture eternal tranquility.\nPassing through the five trials of suffering, you ascend to the imperial court of immortals.\nWe know one another—who truly listens to what is real?\n\nThe Dragon Lord Perfected says: I received the Dao of the Supreme Great Emperor,\npersonally bearing the unsurpassed, orthodox, and true Dharma.\nThrough diligent fasting and uprightness, I diminished myself to bestow alms.\nIf you wish to deliver yourself, first deliver others.\nIf you wish to perfect yourself, first perfect others.\nIf you wish to honor yourself, first honor others.\nIf you wish to respect yourself, first respect others.\nIf you wish to establish yourself, first establish others.\nIf you wish to serve yourself, first serve others.\nIf you wish to teach yourself, first teach others.\nIf you wish to cultivate yourself, first cultivate others.\nIf you wish to save yourself, first save others.\nIf you wish to reach yourself, first reach others.\nIf you wish to connect yourself, first connect others.\nIf you wish to delight yourself, first delight others.\nIf you wish to sate yourself, first sate others.\nIf you wish to enrich yourself, first enrich others.\nIf you wish to precede yourself, first precede others.\nIf you wish to govern yourself, first govern others.\nIf you wish to stabilize yourself, first stabilize others.\nIf you wish to be kind to yourself, first be kind to others.\nIf you wish to be filial to yourself, first be filial to others.\n\nBow humbly, diligently tend to your body, and soften your countenance.\nMorning and evening, pay homage to my honorable one.\nWhen you see other venerable elders, revere them as you do my elder.\nKeep the Dao in your heart and on your lips, ever wishing to serve with devotion.\nExchange flavors to make offerings sweet, never departing from dawn or dusk.\nDo not clothe yourself before the cold; first clothe the elderly.\nPractice these eighteen virtues, and they shall pierce through to heaven above.\nDo not hoard wealth; open your granaries to aid the poor.\nEach year, dispense thousands of bushels to rescue the destitute and impoverished.\n\nThe Dragon Lord practiced this from youth, awakening to heaven above.\nHeaven demands loyalty and filial piety; when his allotted time was spent, it was extended.\nHis lifespan was lengthened tenfold, and dragons came to welcome him.\nThis arose from accumulated goodness and filial devotion, a compassionate heart that aided the poor.\nThe Dragon’s pride was truly hard to bear—he was revered as the Dragon Lord.\nAscending and descending, his intent was boundless; he roamed and chanted as he pleased.\nHe transformed to appear in other forms, altering his appearance without obstruction.\nHe also expounded the Dharma to the multitude, awakening later disciples.\nHis conduct was full of compassion and mindfulness.\nSeeing the worthy, he was never irreverent.\nThe supreme sages supplemented the Perfected; only then did he transform the world.\nWhen his work was complete, he roamed the four seas, circling the Five Peaks.\nAttaining the immortal Dao, his name endured; his deeds accumulated for later generations.\nHe enlightened later worthies.\n\nIn the world’s end, calamities abound—cultivate fasting to deliver yourself.\nIf you can nurture the Three Lives, the Dao refines the Three Origins.\nSit upright and contemplate my Dao, roaming and feasting on Kunlun.\nIf you cannot ascend to the mysterious void, then delight in wandering as an earthbound immortal.\nDo not envy the joys of the human realm; roam the summits of the Five Peaks.\nThen refine the golden liquid, ascend to the imperial heavens.\nWhy not diligently cultivate fasting, rather than sinking into the mundane world?\nAssailed by a hundred ghosts, I fear your heavenly allotted years will be diminished.\nLet thoughts of goodness continue unbroken; bestow kindness to rescue the poor.\nThe heavenly Dao does not idly preach—it exhorts you to create good karma.\nIf goodness is not long practiced, accumulated virtue extends your blessed lifespan.\n\n*Thus concludes the Lower Scroll of the Supreme Perfected Wondrous Scripture of the Eight Mighty Summons of the Numinous Treasure of the Cavern of Mystery.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝八威召龙妙经 经名：太上洞玄灵宝八威召龙妙经。 撰人不详，约出於南北朝。 灵宝经目着录未出。 原本一卷，后分为二卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝八威召龙妙经卷上 元始天尊言：赤明始开，混沌始分，元纲流演，高上所撰，龙汉冥蒙，赤字辉烂，自然天书，微妙难论。 处於玄之又玄，号为海真，龙王丈人。 海真之王，是海有真，位在其中，星气所盖，以号玄源。 一百八十灵海，各有万余洪泉，泉通於水囊，冲造三十二小天。 其时欲灭，山海一倾，八威吐毒，水火欲生，海游轮转，山岳激崩，龙王纵壑，蛟虬翻洋。 龙王从官，三官诸君，分别有道，记诏泰玄。 海真乱作诸海，闭塞洞门。 灵宝天尊，元始高上真人，已召八威，制伏龙王。 赤字玉诀，其中有文，可度生死，蠢飞众生，明可宝秘，灾眚以禳，千日用习。 岁建日子午行道，烧香转经，呼召八威，龙王丈人，闻经欢悦，低头闭眼。 有受召经，不遇灾眚。 八节登岳，四时投渊，大小劫至，以符投津，龙王奉迎，鸟母引接，上造玉京，提拥玉皇。 元始天尊言：三十二天凡有一百八十海，又有岳海三十二水囊。 龙王丈人游观海岳洞渊之中，见有可度，见有可仙，演造《八威召龙龙王却洪灭炎妙经》。 常为行术，自得延年尸解，免脱十苦八难，拔度七祖，上登南官朱陵林中，自然饮食，死骸还神。 元始天尊以高上玄度真人八节日登山召诸海龙王丈人诵八契并召文及符 随节用，立春之日用青缯九寸，丹书州郡县乡里年纪，所封先生名，某甲佩三部八景，天仙地真常在身中。 乞某今立春之节，奏名泰玄，削除死籍，断绝罪根。 立春日诵四方咏，用法召文如前。 嗟呼龙汉尊，勇猛高神王。 洞渊诸灵宝，以召龙王君。 魔王丈人主，元始元圣神。 制威住八毒，灭洪止炎烟。 逍遥虚无散，身生水火光。 大运会开度，弥劫为一龄。 春分日诵，并召文及符，用如上法。 渊通龙到尊，水母承飞云。 诸虚灵岳没，荡荡无一存。 赤镇绝缸岭，东井伏华津。 玄和诸玉女，灵妃六甲人。 空洞不进贤，灵皇还九玄。 勤敬高晨业，以度得道尊。 立夏日召文，用绛缯八寸，丹书如上法。 赤明玉字生，大微剧郁罗。 正光佩云景，相好不为多。 化游人中道，至真谁是家。 乞免五难中，制召诸天魔。 龙王衔符出，诸海成尘沙。 灵岳不崩陷，福地更炼胎。 夏至日召文，用绛缯八寸，书如上法。 虚皇承灵飞，太霄九玄上。 风云隐宛微，讲诵五岳匠。 福地在河涧，灵山有洞尚。 仙芝多妙药，炼服生光相。 分布诸宝园，珠玉镇灵藏。 砗磲精琉璃，琥珀金刚镜。 立秋日召文，用白素六寸，书如上法。 煌煌太白宿，苕苕峻嶒岭。 龙王决天河，诸海一时并。 三十二天真，各佩威龙经。 以过后龙汉，学者登玉清。 观行吐毒狩，漱芬灌冠缨。 浩浩无穷崖，幽辽远大灵。 秋分日召文，用白素六寸，书如上法。 劫运诸天交，大象不复生。 十方灵宝尊，讫号真人形。 三洞奉道元，真妙高上经。 佩者入空虚，诵咏都泰清。 道为真中尊，以度不穷龄。 至真归是无，学修飞上清。 立冬日召文，用皂缯五寸，书如上法。 灵鸟乱龙汉，凤虬不复降。 福首三台宅，号位真悲忘。",
      "translated_text": "**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Eight Might’s Summons of the Dragon**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Eight Might’s Summons of the Dragon*. Author unknown, approximately composed during the Northern and Southern Dynasties. Not recorded in the *Catalogue of Numinous Treasure Scriptures*. Originally one scroll, later divided into two. Source of the base text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, *Benwen* Category.\n\n---\n\n**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Eight Might’s Summons of the Dragon, Scroll One**\n\nThe Celestial Worthy of Primordial Beginning spoke:\nAt the dawn of Crimson Clarity, when the primordial chaos first divided, the primordial net flowed and unfolded. What the Most High composed in the obscure darkness of the Dragon Han era shone with the radiance of crimson script—natural celestial writ, subtle and beyond discourse. Dwelling in the profoundest mystery, it was named *Sea Perfection*, the Dragon King Elder. The King of Sea Perfection, for the sea holds truth, resides at its center, veiled by stellar qi, and is called *Mystic Source*. The one hundred and eighty numinous seas each contain over ten thousand vast springs, their waters connected to the water sacs, surging forth to form the thirty-two lesser heavens.\n\nWhen the time of destruction drew near, mountains and seas tilted as one. The Eight Might spewed forth poison; water and fire threatened to arise. The revolving wheels of the sea spun wildly; peaks and ridges shattered violently. Dragons plunged into abysses; flood dragons and serpents churned the ocean depths. The Dragon King’s attendants, the Three Officials, and the various lords, each following the Dao, recorded and proclaimed the *Great Mystery*. Sea Perfection wrought chaos among the seas, sealing the cavern gates.\n\nThe Celestial Worthy of Numinous Treasure, the Primordial Most High Perfected One, summoned the Eight Might and subdued the Dragon King. Within the crimson-script jade incantations lie texts that can deliver beings from life and death, the crawling and flying multitudes. Their luminous efficacy is to be treasured and concealed, for they avert calamities and exorcise misfortunes. Practiced for a thousand days, they yield results. On the *jian* and *zi-wu* days of the established year, perform the Daoist rites: burn incense, circumambulate while reciting the scripture, and invoke the Eight Might. The Dragon King Elder, upon hearing the scripture, rejoices, bows his head, and closes his eyes. Those who receive the summons scripture shall encounter no calamities or misfortunes.\n\nAt the eight solar terms, ascend the mountains; in the four seasons, cast offerings into the abyss. When great or small kalpas arrive, cast the talisman into the ford. The Dragon King shall receive and welcome you; the Bird Mother shall guide and escort you. Ascend to Jade Capital, where you shall be upheld by the Jade Emperor.\n\nThe Celestial Worthy of Primordial Beginning spoke:\nThe thirty-two heavens contain one hundred and eighty seas, and there are also thirty-two mountain seas and water sacs. The Dragon King Elder roams and observes within the seas, mountains, caverns, and abysses. Where he sees beings fit for deliverance, where he sees those fit for transcendence, he expounds and composes the *Scripture of the Eight Might’s Summons of the Dragon King to Repel Floods and Extinguish Flames*. Constantly practicing this art, one may attain longevity, escape the corpse, avoid the ten sufferings and eight difficulties, deliver the seven generations of ancestors, and ascend to the Vermilion Mound Forest of the Southern Palace. There, one shall naturally partake of food and drink, and the dead husk shall return to spirit.\n\nThe Celestial Worthy of Primordial Beginning, with the Most High Perfected One of Mystic Deliverance, on the eight solar term days ascends the mountains to summon the Dragon King Elders of all seas. Recite the eight covenants, the summons texts, and talismans according to the season.\n\nOn the *Lichun* (Beginning of Spring) day, use nine inches of green silk. In cinnabar, inscribe the commandery, prefecture, county, village, and year of birth, along with the name of the sealed master: \"[So-and-so] bears the Three Departments and Eight Effulgences; the celestial immortals and earthly perfected ever abide within.\" Petition: \"On this *Lichun* day, I submit my name to the *Great Mystery*, erase my name from the register of death, and sever the roots of sin.\"\n\nOn the *Lichun* day, recite the four-directional chants, employing the summons text as before:\n\nAlas! Venerable Dragon Han,\nBrave and mighty, exalted spirit-king.\nCavernous abyss, numinous treasures,\nSummon the Dragon King Lords.\nDemon King, Elder, and Master,\nPrimordial and sagely divine.\nSubdue the might, restrain the eight poisons,\nExtinguish floods, halt the flames.\nWander freely, dispersed in emptiness,\nBody born of water and fire’s light.\nWhen the great kalpa opens for deliverance,\nEons merge into a single age.\n\nOn the *Chunfen* (Spring Equinox) day, recite the summons text and talisman, employing the method as above:\n\nAbyssal depths, the Dragon arrives, venerable,\nWater Mother bears the flying clouds.\nAll empty numinous peaks vanish,\nVast and boundless, none remain.\nCrimson seals the Absolute Vessel Ridge,\nEastern Well subdues the Flower Ford.\nMystic harmony, jade maidens,\nNuminous consorts, Six Jia persons.\nEmpty caverns admit no worthies,\nNuminous sovereign returns to the Nine Mysteries.\nDiligently revere the exalted morning’s work,\nTo attain deliverance and the honored Dao.\n\nOn the *Lixia* (Beginning of Summer) day, use eight inches of crimson silk, inscribing in cinnabar as above:\n\nCrimson radiance, jade script arises,\nGreat Tenuity, flourishing Yu Luo.\nOrthodox light bears cloud effulgences,\nCountenance and virtue beyond measure.\nTransforming and roaming the human Dao,\nSupreme Perfected—who is their home?\nPetition to escape the five difficulties,\nSubdue and summon all celestial demons.\nDragon King emerges, talisman in mouth,\nAll seas turn to dust and sand.\nNuminous peaks do not collapse,\nBlessed lands refine the embryo anew.\n\nOn the *Xiazhi* (Summer Solstice) day, use eight inches of crimson silk, inscribing as above:\n\nVacuous Sovereign bears the numinous flight,\nAbove the Nine Mysteries of Great Empyrean.\nWind and clouds conceal subtleties,\nExpounding and reciting the Five Peaks’ artisans.\nBlessed lands lie in river gorges,\nNuminous mountains hold cavernous sanctuaries.\nImmortal fungi, myriad wondrous medicines,\nRefined and ingested, birth radiant countenance.\nDistribute the many treasure gardens,\nPearls and jades guard the numinous treasuries.\nTridacna, refined beryl,\nAmber, vajra mirrors.\n\nOn the *Liqiu* (Beginning of Autumn) day, use six inches of white silk, inscribing as above:\n\nResplendent, the Great White Star,\nTowering, the lofty and jagged ridge.\nDragon King breaches the Celestial River,\nAll seas unite at once.\nThe thirty-two celestial perfected,\nEach bears the *Scripture of the Mighty Dragon*.\nPassing beyond the later Dragon Han,\nScholars ascend to Jade Clarity.\nContemplating and expelling poisonous beasts,\nRinsing fragrance to bathe cap tassels.\nVast and boundless, endless cliffs,\nProfound and distant, the great numinous.\n\nOn the *Qiufen* (Autumn Equinox) day, use six inches of white silk, inscribing as above:\n\nKalpas turn among the heavens,\nThe great image no longer arises.\nThe Venerable Numinous Treasure of the Ten Directions,\nUltimately named the Perfected in form.\nThe Three Caverns uphold the Dao’s origin,\nTrue and wondrous, the Most High scriptures.\nBearers enter emptiness,\nReciting and chanting, all attain Great Clarity.\nThe Dao is the honored within the true,\nDelivering to endless ages.\nThe supremely true returns to non-being,\nCultivating and studying, soar to Highest Clarity.\n\nOn the *Lidong* (Beginning of Winter) day, use five inches of black silk, inscribing as above:\n\nNuminous birds disorder the Dragon Han,\nPhoenix and flood dragon no longer descend.\nBlessed heads, the Three Terraces’ abodes,\nNamed and ranked, true sorrow forgotten.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1283,
      "start_sentence": 0,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.61295127868652,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "灵岳至学士，佩笈参师匠。 持以游诣乐，消魔诵明镜。 三元元始宗，演造龙王召。 八威毒气散，诸海无涌辽。 冬至日召文，用皂缯五寸，书如上法。 大明照十方，诸天各欲崩。 灵业大乘宗，诸海发洪波。 上造玉京基，下至渊洞乡。 蠕飞蠢动类，一切随路行。 群魔更束带，受诫修宝经。 轮转变自然，体有无等形。 右八节诵，各随节诵之。 四时召文法。 四时之日，春甲寅、夏甲午、秋甲申、冬甲子，投水简，用金龙一口，碧珠二枚。 西水东向者，是灵海源也。 正向北方，诵契三过，以龙珠相连，朱书青缯置水中。 更重劝百八十灵海大真八威，不得放毒，龙王衔符，即尔响到。 若不见形者，此水自有异声涌浪，即是灵。 应修之三十二年，八威奉迎，龙王导引。 重敕法召文仪 太玄、太素、太微三元君，元始高真，上景先生，玄和玉女，灵妃夫人，某甲先封某海神王，以护渊通天洪漏水灾。 今以某时之日，奏责金龙碧珠，以脆先君，乞上名帝籍，削除死根。 四时日投水简，赤书青纸，以北向诵四契梵天音 太玄太素太微君颂第一 太上洞玄文，三元灵宝真。 元始吐玉诀，是为上古言。 八威从毒气，诛灭妖俗尘。 正道有空洞，高妙元气尊。 瞬目过六度，腾身参泰玄。 百八十海沸，龙汉开洪门。 渊通诸汉首，人鸟灵岳根。 虬兽蛟鲸勇，浩浩守洞文。 观见学仙客，蹊路放炎烟。 催促郁仪纲，收录结璘晨。 阳光不复朗，阴精不复明。 百六阳九尽，大小劫更生。 三元君颂第二 八威龙王神，住世无姓生。 从气吐八毒，不度无道人。 愚类不荡除，俱会五苦庭。 横尸诸国土，白骨暴路间。 灵岳多俗秽，尽是忧恼臣。 存时不修经，闻法耳不餐。 勤竞灭蠢类，蠕飞诸众生。 前身受是对，今乞免罪名。 元始高真颂第三 荡荡龙汉宅，朦胧灵岳冥。 辽辽诸天府，混沌始气生。 寂寂幽洞宫，峻嶒灵真庭。 飘飘高仙士，清诤本业铭。 龙鳞处渊源，虎豹藏拢田。 不见学至师，还闻苟且声。 饥咽餐元气，渴饮玄玉精。 持养枯骨质，以度不穷龄。 上景先生颂第四 溟涬豁落宫，诵泄浩无崖。 列宿一时倒，星辰化为逸。 禁元根莽莽，丁皇无堪基。 沉浮任运转，焦枯各有时。 荡旦无无遂，万劫复更来。 人肌欻倏命，至法度我灾。 回迁虚皇路，亿岁是一时。 身佩八威策，以消八素灾。 元始天尊从龙王丈人，龙汉诸真，八威牵引，龙鳞虎豹，狮子辟邪，虬蛟凤鹄，鸿鹭雍雍，而来俱会南阳洞台七宝宫中，上观洪崖。 其时清虚澹泊天尊，演召八威龙经策文、符图赞诵，以授未悟，明案修秘受法，宝玉得传，秘之秘之，轻泄灭身。 八威策文，修灵宝斋，佩此策章，群真向引，魔王不干。 八威策文法。 用真檀长八寸，广四寸，白地锦衣，长尺，广四寸，囊盛。 斋时佩身，三部八神在左，策文在右。 策文里朱字，皆使方正。",
      "translated_text": "Scholars of the sacred peaks who bear their satchels and seek masters,\nWith these they wander in joyful pilgrimage,\nDispelling demons through recitation of the Luminous Mirror.\nThe Three Origins trace to the Primordial Ancestor,\nWho expounds and invokes the Dragon Kings.\nThe Eight Might’s poisonous qi disperses,\nAll seas remain calm, no surging waves.\n\nOn the Winter Solstice day, use five inches of black silk, inscribing as above:\n\nGreat radiance illumines the ten directions,\nAll heavens tremble on the verge of collapse.\nThe numinous work, great vehicle’s origin,\nAll seas erupt in towering waves.\nAbove, it founds the Jade Capital’s base,\nBelow, it reaches the abyssal caverns’ realm.\nAll creatures—wriggling, flying, crawling—\nFollow the path in their every movement.\nThe host of demons gird themselves anew,\nReceiving precepts, cultivating the precious scriptures.\nRevolving, transforming by nature,\nTheir forms embrace both being and non-being.\n\nRecite at the eight solar terms, each according to its season.\n\n**Method for the Four Seasons’ Summons**\nOn the days of the four seasons—spring *jiayin*, summer *jiawu*, autumn *jiashen*, winter *jiazi*—cast a water tablet. Use one golden dragon and two azure pearls. For waters flowing west to east, this is the source of the numinous sea. Face directly north, recite the contract three times, linking dragon and pearls together. Inscribe in cinnabar on green silk and place in the water. Further exhort the One Hundred Eighty Great Perfected of the Numinous Sea and the Eight Might: do not release poison. The Dragon Kings will receive the talisman, and their response will be immediate. If no form appears, this water will naturally produce strange sounds and surging waves—this is the numinous. After thirty-two years of cultivation, the Eight Might will come to welcome you, with the Dragon Kings leading the way.\n\n**Additional Summons Ritual for the Exhortation Text**\nThe Three Origin Lords of Grand Mystery, Grand Simplicity, and Grand Tenuity; the Primordial Highest Perfected; the Celestial Master of the Upper Realm; the Jade Maidens of Mystic Harmony; the Numinous Consorts; and I, so-and-so, having previously sealed the Spirit King of such-and-such sea, now guard the abyssal passage against celestial floods. Today, on this day of such-and-such season, I present a golden dragon and azure pearls to honor my late lord, beseeching that my name be entered in the Emperor’s register and my root of death be excised.\n\nCast the water tablet on the four seasonal days, inscribing in cinnabar on green paper. Face north and recite the four contracts in the Brahmā voice:\n\n**First Hymn: The Three Origin Lords**\nThe Supreme Cavern Mystery scriptures,\nThe Three Origins’ numinous treasure, true.\nThe Primordial One utters the jade decree,\nThe ancient words of highest antiquity.\nThe Eight Might’s poisonous qi,\nExterminates demonic worldly dust.\nThe true Dao holds emptiness and profundity,\nLofty and wondrous, honored qi of origin.\nIn the blink of an eye, six kalpas pass,\nAscending the body to join Grand Mystery.\nOne hundred eighty seas boil,\nThe Dragon Han opens its floodgates.\nAbyssal passages link all rivers’ heads,\nWhere birds and humans root in sacred peaks.\nFlood dragons, beasts, jiao, and whales,\nVast and boundless, guard the cavern texts.\nBeholding the aspiring transcendents,\nTheir paths emit flames and smoke.\nHastening the net of Yu Yi,\nGathering the dawn’s radiant essence.\nThe yang light no longer shines,\nThe yin essence no longer gleams.\nThe hundred-six and yang-nine are exhausted,\nGreat and small kalpas alternate anew.\n\n**Second Hymn: The Three Origin Lords**\nThe Eight Might and Dragon Kings,\nAbide in the world without birth or surname.\nFrom qi they spew eight poisons,\nNot sparing those without the Dao.\nThe foolish kind, unwashed away,\nAll assemble in the Five Sufferings’ court.\nCorpses lie across the lands,\nWhite bones strewn upon the roads.\nThe sacred peaks teem with worldly filth,\nAll are ministers of sorrow and vexation.\nIn life, they did not cultivate the scriptures,\nHearing the Dharma, their ears did not feast.\nDiligently strive to extinguish the dull-witted,\nAll wriggling, flying, myriad beings.\nFor offenses received in former lives,\nNow I beseech to be absolved of guilt.\n\n**Third Hymn: The Primordial Highest Perfected**\nVast and boundless, the Dragon Han’s abode,\nHazy and obscure, the sacred peaks’ darkness.\nDistant and endless, the heavens’ palaces,\nFrom chaos the primordial qi was born.\nSilent and still, the secluded cavern palace,\nTowering and steep, the numinous perfected’s court.\nSoaring and drifting, the lofty immortals,\nTheir pure admonitions inscribe their original work.\nDragon scales dwell in abyssal sources,\nTigers and leopards hide in rugged fields.\nNo sight of students seeking the ultimate master,\nOnly echoes of careless, idle voices.\nHungry, they swallow primordial qi,\nThirsty, they drink the mysterious jade essence.\nNurturing their withered bones,\nTo endure through endless ages.\n\n**Fourth Hymn: The Celestial Master of the Upper Realm**\nThe boundless and open palace of the primordial void,\nRecitation and revelation, vast and without shore.\nThe constellations all overturn at once,\nStars and planets transform and flee.\nThe root of the forbidden origin, vast and wild,\nThe *Dinghuang* without stable foundation.\nSinking and floating, turning by fate,\nScorching and withering each in their time.\nThe dawn of non-being, without end,\nAfter ten thousand kalpas, it returns anew.\nHuman flesh, life’s fleeting breath,\nThe ultimate Dharma delivers me from calamity.\nReturning to the path of the Void Sovereign,\nA hundred million years are but a single moment.\nBearing the Eight Might’s talismans,\nTo dispel the eight elemental disasters.\n\nThe Primordial Heavenly Worthy, accompanied by the Dragon King Elder, the Perfected of the Dragon Han, the Eight Might leading the way, dragon scales and tiger-leopards, lions and apotropaic beasts, flood dragons and phoenixes, swans and egrets in harmonious flocks, all come to assemble in the Seven Treasures Palace of the Terrace of Southern Yang. Above, they gaze upon Hong Ya.\n\nAt that time, the Heavenly Worthy of Pure Emptiness and Tranquility expounded the Eight Might Dragon Scripture’s talismanic texts, charts, hymns, and recitations, bestowing them upon the unenlightened. Those who clearly follow the secret transmission rites, receiving the precious jade, must guard it closely—guard it closely. To leak it lightly is to invite the destruction of one’s body.\n\n**Eight Might Talismanic Text**\nWhen performing the Numinous Treasure Retreat, bear this talismanic chapter. All Perfected will come to guide you, and demon kings will not interfere.\n\n**Method for the Eight Might Talismanic Text**\nUse true sandalwood, eight inches long and four inches wide. Encase it in white brocade, one foot long and four inches wide, and store it in a pouch. During the retreat, wear it on the body: the Three Divisions’ eight spirits on the left, the talismanic text on the right. The cinnabar characters inside the talisman must be square and precise.",
      "overlap_context": ".\nBearers enter emptiness,\nReciting and chanting, all attain Great Clarity.\nThe Dao is the honored within the true,\nDelivering to endless ages.\nThe supremely true returns to non-being,\nCultivating and studying, soar to Highest Clarity.\n\nOn the *Lidong* (Beginning of Winter) day, use five inches of black silk, inscribing as above:\n\nNuminous birds disorder the Dragon Han,\nPhoenix and flood dragon no longer descend.\nBlessed heads, the Three Terraces’ abodes,\nNamed and ranked, true sorrow forgotten.",
      "start_char": 1283,
      "end_char": 2430,
      "start_sentence": 70,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.994420766830444,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "上古上皇元始天尊、始生元君、元素太真、太素元一君、三素高神、灵宝元始君、元始丈人大帝、玉清神师景阳先生、泰清玉历太真大圣大仙君、五岳地仙、灵山道君，某甲本生某郡县乡里，属某天，被某宿，封某岳先生某官道士。 伏闻八威神策，以召龙王，元始生养，特蒙高真，赐为封合，上名帝籍，削去死根，威神侍卫，群魔却行，周历诸海，任意纵横，如文律令。 策文外符。 百八十海精龙王丈人真形。 度大小劫盟文，元始演。 上古高上丈人、太上大道君、元灵老子、无量道尊、东府太上、南极丈人、西灵洞母、北玄真人、中宫太帝、黄老元君，同游会渊通宗飘竺落诸天龙汉间，清虚静默，记轮转运度劫数。 众始遣玄和玉女、灵妃夫人各十二人，赉太上洞玄灵宝大小劫天地运度八威策文，以召龙王，变化空洞，以炼真神，导引生图，安镇二十四真神。 其经高妙，授与白石空洞玄度真人，修学以付高上道君，传玉仙金母，金母传无上李夫人，夫人传北极老君，老君传上景先生，先生传太和王君。 王君等学，各经数龙汉，经还洞乡，隐不复出。 学太上洞玄灵宝经者，百无一。 上皇之时，高上老子演，置种仙使飞天人，赉太古元始天尊三十六部妙经，封置五岳灵山洞中。 人间有至德者，自见其文也。 至东晋成帝元年七月十一日甲子，十方灵宝天尊众真下降，开洞经演法度人，乃授成帝此经。 上登十绝，遗文世间，化度一切明按秘也。 成帝受大小劫诸经，盟信法物，黄金五两，金环一双，五方纹缯，金龙一口，玉鱼一口，碧珠二枚，博山香炉一口，地布一张，白银十两，上厨九人。 亦七五三盟，法用此信，以脆元灵老子、始皇天尊。 作坛在崖石上，使遥观灵泉，远世人。 坛成，法师东向告盟：受者弟子某州界土秽气胎生蠢类，遭遇元始，加润和气，得盻妙文，今奉赍法仪，蒙以告盟，亿祖为誓。 弟子某郡县乡里，某号某甲，年若干岁，甲以下生秽质，被衔灵和，三元所载，三洞所养，未知宿命拔罪之根，明悟仙术。 昔诣某法师某甲，奉受太上洞玄灵宝尊妙法经，出入难想，至道妙贵，非某甲下才腐骨臭肉所可佩诵。 不自忖量，思效日新，在进无退。 伏闻元始演教大小劫，八威召龙，变化空洞二十四真神，导引三光洞玄之根，宝玉之尊，洞一之真，上真要诀，实所希闻。 甲投命束首，乞丐成就，恩惟明先生垂恩授度，不敢轻露，告盟之后，七祖为誓约，自闭塞宝玉。 有宣轻泄，宣露甲身家口，谢天地水三官。 万没之日，后不敢有怨。 某年月日，某郡县乡里，太一无极金刚毕券三洞三景弟子，左领神太上主者，三皇五岳大传北岳先生，某官道士，曾孙小兆真人某甲，稽首再拜，启盟上告。 上启上上元始上古高上太上大道君、元灵老君、无量道尊、东府太上、南极元君丈人、西灵洞母、北玄一君、中宫老君、十方太真，小臣某甲上启元君，应化经法，赐宣令悟。 今有某甲谨赍法信，求盻篇目。 臣以去某岁某月日，谨诣某洞先生，五灵真人某宫道士，某郡县乡里，某对共告盟，宝质珠玉为信，启付三十六部目录，别告八景神真，大小劫运度，变化空洞，周流五岳，大宅灵山。 今有某州郡先生祭酒某甲，奉赍法信，五方纹缯，金龙玉鱼，碧珠白银，地布香炉，求乞告盟，度授宝秘，安国救民，土地欢乐，无有忧患，以游行五岳。",
      "translated_text": "In the primordial age, the Most High Original Celestial Worthy of the Primordial Beginning, the First-Born Primordial Lord, the Primordial Essence Supreme Perfected, the Supreme Essence Primordial Unity Lord, the Three Essences Lofty Spirits, the Numinous Treasure Primordial Beginning Lord, the Primordial Beginning Venerable Great Emperor, the Jade Clarity Divine Master and Radiant Yang Master, the Grand Clarity Jade Calendar Supreme Perfected Great Sage Great Immortal Lord, the Five Marchmounts Earth Immortals, and the Numinous Mountain Dao Lord—this humble one, born in [such-and-such] commandery, county, village, and hamlet, belonging to [such-and-such] celestial realm, governed by [such-and-such] constellation, and enfeoffed as [such-and-such] Marchmount Master and [such-and-such] Official Daoist—prostrates in reverence.\n\nHaving heard of the Eight Might Divine Talismanic Text, used to summon the Dragon Kings, and of the Primordial Beginning’s nurturing grace, this humble one has been specially favored by the Lofty Perfected, granted enfeoffment and registry in the Celestial Records, with the roots of death excised. Mighty spirits attend in guard, demon hordes retreat, and one may traverse all seas at will, roaming freely as the talismanic writ commands.\n\n**External Talisman of the Talismanic Text**\nThe true forms of the One Hundred Eighty Sea Essence Dragon Kings and Venerable Ones.\nThe covenant text for transcending great and minor kalpas, expounded by the Primordial Beginning.\n\nIn the primordial age, the Lofty Venerable One, the Most High Great Dao Lord, the Primordial Numinous Venerable Master, the Boundless Dao Worthy, the Eastern Mansion Supreme One, the Southern Culmen Venerable One, the Western Numinous Grotto Mother, the Northern Mysterious Perfected One, the Central Palace Supreme Emperor, and the Yellow Venerable Primordial Lord—together they roamed the assembly at the Abyssal Confluence, traversing the myriad heavens and the Dragon-Han interval. In clarity and quiescence, they recorded the revolutions of the kalpas and the reckoning of transcendence.\n\nThe Multitude of Origins dispatched the Mysterious Harmony Jade Maidens and Numinous Consorts, twelve each, bearing the Most High Cavernous Mystery Numinous Treasure texts for great and minor kalpas, the Eight Might Talismanic Text for summoning the Dragon Kings, transforming the hollow emptiness, refining the true spirits, guiding and leading the living diagrams, and pacifying the Twenty-Four Perfected Spirits. This scripture, most exalted and wondrous, was conferred upon the White Stone Cavernous Mystery Transcendent Realized One, who studied and transmitted it to the Lofty Supreme Dao Lord. The Lord transmitted it to the Jade Immortal Metal Mother, who passed it to the Most High Lady Li; she to the Northern Culmen Venerable Master, who transmitted it to the Radiant Yang Master, who in turn passed it to the Grand Harmony King Lord. These lords and their disciples studied it through countless Dragon-Han kalpas, then returned to their cavernous abodes, concealing themselves and no longer emerging. Of those who studied the Most High Cavernous Mystery Numinous Treasure scriptures, not one in a hundred succeeded.\n\nIn the era of the Supreme August One, the Lofty Venerable Master expounded it, appointing flying immortals as seed-sent envoys to bear the thirty-six divisions of wondrous scriptures of the Primordial Beginning Celestial Worthy of the Primordial Age, sealing and depositing them in the grottoes of the Five Marchmounts and Numinous Mountains. Those of utmost virtue in the world may perceive its texts of their own accord.\n\nOn the eleventh day of the seventh month, the first year of the Cheng Emperor’s reign in the Eastern Jin, the Celestial Worthies of the Ten Directions’ Numinous Treasure descended, opening the cavernous scriptures and expounding the Dharma to deliver beings. Thereupon, they conferred this scripture upon the Cheng Emperor. Ascending the Ten Perils, they left its texts in the world to transform and deliver all, illuminating the secret transmission.\n\nThe Cheng Emperor received the scriptures for great and minor kalpas, along with the covenant’s ritual implements: five taels of yellow gold, a pair of gold rings, five-direction patterned silks, a golden dragon, a jade fish, two azure pearls, a censer of broad mountain incense, a ritual mat, ten taels of white silver, and nine attendants for the upper kitchen. The covenant of seven, five, and three was sworn, employing these offerings to invoke the Primordial Numinous Venerable Master and the Primordial August Celestial Worthy.\n\nThe altar was erected upon a cliffside, commanding a distant view of numinous springs and removed from worldly folk. Once the altar was complete, the Dharma Master faced east to proclaim the covenant:\n\nThe recipient, disciple of [such-and-such] prefecture, born of defiled terrestrial qi and the dull-witted masses, has encountered the Primordial Beginning and been graced by harmonious qi, gaining sight of the wondrous texts. Now, presenting the ritual implements, this humble one petitions for the covenant, swearing by the myriad ancestors.\n\nThis disciple, of [such-and-such] commandery, county, village, and hamlet, bearing the name [such-and-such] and the style [such-and-such], aged [such-and-such] years, born beneath the [such-and-such] celestial stem—a defiled vessel, yet graced by numinous harmony, recorded in the Three Origins, nurtured by the Three Caverns—remains ignorant of past lives and the roots of sin, yet awakens to the arts of immortality. Formerly, this humble one sought out the Dharma Master [such-and-such], receiving the Most High Cavernous Mystery Numinous Treasure’s exalted and wondrous scriptures. Their entry and exit are beyond conception; their Dao is most wondrous and precious, beyond the capacity of this humble one’s inferior talents, putrid bones, and foul flesh to bear or recite. Yet, without self-assessment, this one aspires to daily renewal, advancing without retreat.\n\nHaving heard of the Primordial Beginning’s expounded teachings on great and minor kalpas, the Eight Might’s summoning of Dragon Kings, the transformation of hollow emptiness, the Twenty-Four Perfected Spirits, the guiding of the Three Luminaries’ cavernous mystery roots, the precious jade’s exaltation, the Cavernous Unity’s truth, and the essential secrets of the Supreme Perfected—truly, these are rarely heard. This humble one prostrates, head bound, begging for accomplishment. Humbly entreating the Illustrious Master to bestow grace and transmission, this one dares not lightly disclose it. After the covenant is sworn, the seven ancestors serve as witnesses, and this one will seal away the precious jade. Should there be any proclamation or careless disclosure, this humble one’s body and household shall atone to the Three Officials of Heaven, Earth, and Water. Even unto the ten thousandth extinction, this one dares harbor no resentment.\n\nOn [such-and-such] day of [such-and-such] month and year, in [such-and-such] commandery, county, village, and hamlet, the disciple of the Three Caverns and Three Radiance, the Vajra of the Grand Ultimate and Non-Ultimate, the Left-Ruling Divine Supreme Master, the Great Transmitter of the Three Sovereigns and Five Marchmounts, the Northern Marchmount Master and [such-and-such] Official Daoist, the remote descendant and minor portent Realized One [such-and-such], bows twice and prostrates to petition and proclaim:\n\nSupreme petition to the Most High Primordial August Supreme Highest Great Dao Lord, the Primordial Numinous Venerable Master, the Boundless Dao Worthy, the Eastern Mansion Supreme One, the Southern Culmen Primordial Lord Venerable One, the Western Numinous Grotto Mother, the Northern Mysterious Unity Lord, the Central Palace Venerable Master, and the Ten Directions’ Supreme Perfected—this humble servant [such-and-such] petitions the Primordial Lord to manifest the scriptural Dharma and bestow enlightenment.\n\nNow, this humble one [such-and-such] respectfully presents the ritual implements, seeking to behold the scriptural titles. This servant, having departed on [such-and-such] day of [such-and-such] month and year, respectfully sought out the Grotto Master of [such-and-such], the Five Numinous Perfected One and [such-and-such] Palace Daoist of [such-and-such] commandery, county, village, and hamlet, to jointly proclaim the covenant. Precious substances and pearl jades served as tokens, and the thirty-six divisional catalogues were transmitted, separately petitioning the Eight Radiance Divine Perfected for the great and minor kalpas’ revolutions and transcendence, the transformation of hollow emptiness, the circulation through the Five Marchmounts, and the great dwelling of the Numinous Mountain.\n\nNow, the Master of Ceremonies and Libationer [such-and-such] of [such-and-such] prefecture and commandery presents the ritual implements—five-direction patterned silks, golden dragon and jade fish, azure pearls and white silver, ritual mat and incense censer—seeking to proclaim the covenant, receive the transmission of precious secrets, pacify the state and save the people, bringing joy to the land and banishing all woes, to roam the Five Marchmounts.",
      "overlap_context": "at, bear this talismanic chapter. All Perfected will come to guide you, and demon kings will not interfere.\n\n**Method for the Eight Might Talismanic Text**\nUse true sandalwood, eight inches long and four inches wide. Encase it in white brocade, one foot long and four inches wide, and store it in a pouch. During the retreat, wear it on the body: the Three Divisions’ eight spirits on the left, the talismanic text on the right. The cinnabar characters inside the talisman must be square and precise.",
      "start_char": 2431,
      "end_char": 3714,
      "start_sentence": 140,
      "end_sentence": 169,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.09986615180969,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "诸所经由江湖大泽，山川溪谷，群灵皆为伺迎，龙麟虎豹、狮子辟邪，常所持会，天真地仙，覆盖某身。 法启度事竟，某甲案如修承，恩惟上古太上告下三十二天，削某甲死籍，断绝罪根。 弟子更向东方百八十拜礼，三十二揖，向四方散发。 臣某甲重启某山太真灵洞天尊，某甲求某告盟某经，某山太真当为保举，令某甲寿如灵岳，劫数不衰。 弟子读告盟颂： 浩浩无穷崖，龙麟来奉迎。 水母西游外，炎火不复伤。 身登玉京阙，飘然凌高翔。 太上洞玄灵宝八威召龙妙经卷上竟 太上洞玄灵宝八威召龙妙经卷下 大道君曰：太上元君与上皇无极太帝君，游於昆仑玉京之山，又与妙行真人、太真君、太真丈人从五岳四渎诸仙真，各二千四百人俱下游。 因上请天皇、地皇、人皇君，同降玄都山，众官围绕台阙，听讲敷演说法。 尔时有龙渊丈人，号曰龙君者，复乘将群龙数万，来诣三皇太帝君，听说善法，及作功德之事。 叹言无上道德，本自尊高虚无无上之上，大乘百六运度无极之化，劝善敷救生死，化导之勤。 又有九千六百亿正真之道，并累功积德不可称数，并以道化教导生法，执权方便，普为拔度诸恶一切死根。 人行四慈之心，济度伤害横灾，天地枯槁，人民嗷嗷。 龙君仍化，擭将西河沙漠之外，无极虞渊地中群龙数千万，负水乘云，弥布天下，普蒙洪注洒润。 五岳四渎之神，普兴云罗，荫天覆地，济度天下枯渴。 累日之中，水陆普被流润，川谷盈满，浩浩荡荡。 尔时又有上天遣彩女二十四万人，导从太上太上无极太帝君，盖天来下，偈歌作伎，周行四海之内，庆观天民受庆之乐。 国祚太平，天下人人，莫不喜踊，各复音声相和。 其时大道君、道德君、太帝君，三尊至真神人、高圣妙行真人、天帝太皇、万万亿亿亿万众来躬奉。 金童玉女大亿千万众，擎持香华，盖天来下，奉迎三尊四真，无上无极无先元君、太帝太尊君大神、金童玉女、香华玉女，啸歌邕邕，与天下地上亿千万神，并与数千万彩女，俱进太帝三尊几前，长跪肃然。 尔时，龙君又将数千万龙，来伏太帝前。 良久，龙君上白太帝：三君自承三皇造化，开辟以来，未遭阳九百六之运。 今洪水枯后，九千九百岁，枯阳蔽渊，水母逃匿。 故使枯阳藏景於九泉之下，炎障扬於八极之内。 万民枯竭，嗷诉上天，辞诉云云。 枯死之人，天下三分过半，焦煎欲尽。 三年之后，恶逆悉尽。 又召龙君命虞渊令龙君，御群龙数千万众，来施天罗，负水洒泽。 旬月之中，枯死者皆得生苏。 国土之中，十分人民才余一分为种，见而考之，问其何缘独得伦存，枯而不灭也。 种人曰：夫予所以被枯酷而不绝，正受三官劾校，先亡有积善功德，世勋相及。 且一己修身，少不履非，积勤累德，为天官所保，地神所长。 以此学者应在偏仙之列，逆被甄别。 当驱除火炼之初，天地水三官，考雠先世积功，相覆己身，勋勤功着，南宫遗名，后代当灾之时，三奏被＠。 南岳君炎障使者，悉见济度之恩，并请天帝火珠使者，流火飞炼金真虎符、太一金刚赫奕宝章，引景神真凤文真符拥护，洒而拂之，遂得炎飞。 仙贤与金口大鸟兼来济度，得於灾中免脱成生见戒，积善之行所致，善佑之感也。",
      "translated_text": "Wherever one traverses—great rivers and lakes, mountains and streams, valleys and ravines—all the host of spirits come forth to await and welcome, while dragons, scaled beasts, tigers, leopards, lions, and apotropaic guardians ever assemble in attendance. The Perfected of Heaven and Earthly Immortals overshadow one’s body.\n\nOnce the ritual of transmission and deliverance is complete, [the adept] such-and-such, following the prescribed observances, humbly petitions the Most High of Antiquity to proclaim to the Thirty-Two Heavens, striking such-and-such’s name from the register of the dead and severing the roots of all transgressions. The disciple then turns toward the east, prostrating one hundred and eighty times and bowing thirty-two times, scattering hair in the four directions.\n\nSuch-and-such further petitions the Most Numinous Perfected of the Mystic Grotto-Heaven of such-and-such mountain, seeking to proclaim the covenant of such-and-such scripture. May the Most Numinous Perfected of such-and-such mountain act as sponsor, granting such-and-such a lifespan equal to the Sacred Marchmounts, unwaning through the kalpas.\n\nThe disciple recites the proclamation of the covenant:\n\nBoundless, the fathomless cliffs,\nDragons and scaled beasts come forth in welcome.\nBeyond the western wanderings of the Water Mother,\nThe scorching fires no longer harm.\nAscending the Jade Capital’s towers,\nOne soars aloft, drifting on high.\n\n*End of the Upper Scroll of the Wondrous Scripture of the Eight Mighty Summons of the Dragon, from the Numinous Treasure of the Dao of Supreme Mystery*\n\n*Beginning of the Lower Scroll of the Wondrous Scripture of the Eight Mighty Summons of the Dragon, from the Numinous Treasure of the Dao of Supreme Mystery*\n\nThe Lord of the Dao declared: The Most High Primal Lord and the Supreme Emperor of the Boundless Non-Ultimate roamed the Kunlun Jade Capital Mountain, accompanied by the Wondrous Practitioner Perfected, the Supreme Perfected Lord, and the Supreme Perfected Elder, along with twenty-four hundred Perfected Immortals from the Five Marchmounts and Four Waterways, all descending together.\n\nThereupon, they invited the Lords of Heaven, Earth, and Humanity to jointly descend upon the Dark Capital Mountain. A host of officials encircled the terrace-palaces, listening to the exposition and discourse of the Dharma.\n\nAt that time, the Elder of the Dragon Abyss, known as the Dragon Lord, arrived leading tens of thousands of dragons to attend the Three August Supreme Emperor Lords, listening to the discourse on virtuous teachings and the performance of meritorious deeds. He sighed, extolling the unsurpassed Dao and virtue, inherently exalted in the supreme void beyond the non-ultimate, the great vehicle of the hundred and six kalpas’ deliverance through boundless transformation, exhorting goodness and salvation from the cycle of birth and death, tirelessly guiding and instructing.\n\nThere were also ninety-six hundred million paths of the Orthodox and Perfected, all through the accumulation of merit and virtue beyond reckoning, employing the Dao to transform and teach the methods of life, wielding skillful means to universally deliver and eradicate all roots of evil and death. Cultivating the heart of the Four Immeasurables, they rescued those harmed by calamities and misfortunes, where heaven and earth lay withered and the people cried out in distress.\n\nThe Dragon Lord then transformed, leading tens of millions of dragons from beyond the Western River’s deserts and the boundless Yu Abyss. Bearing water and riding clouds, they spread across the world, universally bestowing vast rains to moisten and nourish. The spirits of the Five Marchmounts and Four Waterways universally stirred clouds and mist, shading the heavens and covering the earth, delivering the world from drought and thirst.\n\nWithin days, water and land were universally suffused and moistened, valleys and streams filled to overflowing, vast and surging. Then, twenty-four myriad celestial maidens were dispatched from the heavens to escort the Supreme Emperor of the Non-Ultimate, descending beneath the canopy of heaven. They chanted verses and performed dances, circling within the Four Seas, celebrating the joy of the celestial people receiving blessings. The nation enjoyed great peace, and all under heaven rejoiced, their voices harmonizing in unison.\n\nAt that time, the Lord of the Great Dao, the Lord of Virtue, and the Supreme Emperor Lord—three august perfected divine beings—along with the lofty sagely Wondrous Practitioner Perfected, the Celestial Thearch, the Supreme August, and myriad billions upon billions of hosts came in person to attend. Innumerable jade lads and maidens, bearing incense and flowers, descended beneath the canopy of heaven to welcome the Three August Ones and Four Perfected, the Lord of the Non-Ultimate, Non-Precedent, and Primal Origin, the Supreme Emperor and Great Divine Lord, the jade lads and maidens, and the jade maidens of incense and flowers. Singing in harmonious chorus, they advanced with the myriad spirits of heaven and earth and the tens of millions of celestial maidens before the thrones of the Three August Supreme Lords, kneeling reverently.\n\nThen, the Dragon Lord led tens of millions of dragons to prostrate before the Supreme Emperor. After a long while, the Dragon Lord addressed the Supreme Emperor, saying: “Since the Three Lords received the mandate of the Three August Ones and the inception of creation, they have not encountered the ninety-six kalpas of the Yang Disaster. Now, after the great drought following the flood, nine thousand nine hundred years have passed. The scorching Yang obscures the abyss, and the Water Mother has fled into hiding. Thus, the withered Yang conceals its radiance beneath the Nine Springs, while the blazing barrier spreads within the Eight Extremities. The myriad people wither and perish, crying out to heaven in lament. Of those parched to death, more than half of the world’s three parts have been consumed, scorched to near extinction. After three years, all wickedness shall be exhausted.”\n\nThe Supreme Emperor then summoned the Dragon Lord and commanded the Lord of Yu Abyss to lead tens of millions of dragons to spread the celestial net, bearing water to sprinkle and moisten. Within ten days and a month, those who had withered to death were all revived. In the lands, barely one-tenth of the people remained as survivors. Observing and examining them, they asked by what cause they alone had endured, withered yet not perished.\n\nThe survivors said: “We who suffered the cruel drought yet did not perish were precisely those under the scrutiny of the Three Offices. Our ancestors had accumulated meritorious virtue, and their merit extended to us. Moreover, we cultivated ourselves, never straying into wrongdoing, accumulating diligence and piling up virtue, protected by the celestial officials and nurtured by the earth spirits. Thus, scholars such as we should have been ranked among the partial immortals, yet we were unjustly subjected to judgment. When the fires of refinement were first unleashed, the Three Offices of Heaven, Earth, and Water reviewed the merits accumulated by our ancestors, which extended to our own bodies. Our meritorious deeds were recorded, our names left in the Southern Palace. When the time of later calamities came, our cases were thrice memorialized. The Lord of the Southern Marchmount and the Envoys of the Blazing Barrier witnessed the grace of deliverance and petitioned the Celestial Thearch and the Envoys of the Fire Pearl. The radiant talismans of the Golden True Tiger and the Majestic Golden刚 of the Great One, along with the luminous Perfected Phoenix Talismans, were invoked to shield and sweep away the flames, allowing the flying embers to disperse. The Immortals and Sages, together with the Great Golden-Mouthed Birds, came to deliver us, enabling us to escape the calamity and survive, a result of our accumulation of virtuous deeds and the response to our good blessings.”",
      "overlap_context": "he great dwelling of the Numinous Mountain.\n\nNow, the Master of Ceremonies and Libationer [such-and-such] of [such-and-such] prefecture and commandery presents the ritual implements—five-direction patterned silks, golden dragon and jade fish, azure pearls and white silver, ritual mat and incense censer—seeking to proclaim the covenant, receive the transmission of precious secrets, pacify the state and save the people, bringing joy to the land and banishing all woes, to roam the Five Marchmounts.",
      "start_char": 3714,
      "end_char": 4941,
      "start_sentence": 170,
      "end_sentence": 208,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.86290240287781,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "可不勤修斋直也。 龙君日：积善之功，悉从道来。 夫欲建功积德者，当依太上灵真三宝之斋，累年积月，修习不倦者，司命表奏善功於上天，天帝曹下＠三官记列功绩，三灾五难克得度脱，斋功尤重，可不勤之哉。 生生之根定矣。 今撰出为太上八威召龙经，施请祝龙於上篇，记根原说於下卷也。 太上大道君说运屯泰，因枯而得荣唱，乃说颂曰： 荡荡龙君，受天至灵。 遭时阳九，百六之倾。 万姓煎枯，渴死渊庭。 仰天呼嗟，求愍灾樱。 叩诉悲唤，烦烛天真。 上天感应，呼召龙王。 群龙逃身，匿景潜形。 藏闭虞渊，崖石之硎。 八威严敕，命召交并。 如有龙君，胁带五星。 指叩虞渊，群龙飞呜。 匡御千万，承受功名。 收摄雨师，云罗上京。 三日三夜，洒渊清静。 禾稼丰茂，万民受生。 四时和调，咸亨泰宁。 大道君曰：赠赞龙君之大功，其德巍巍乎。 说者有习，明有五戒文，如左： 训导多慈心，天道为开冥。 爱护释忧患，功德流后生。 道不负人功，患人不能营。 奈何来运雕，善士心伶俜。 勤勤劝修善，过度愍灾攫。 龙威功德大，惠泽荷天灵。 济活天下人，莫不受福荣。 阳九既得免，百六亦夷平。 枯邪被洒泽，烦浊见澄清。 八威制命策，宝章及帝琼。 悉是制毒章，威减狩魔兵。 龙王投河侧，群龙出骇鸣。 积善万福降，长斋赞音声。 莫不从善来，威致於上灵。 福降如天雷，聋痾悉得听。 盲者并开见，跛者得起行。 善者神所助，恶者鬼贼刑。 道以善为本，德以信为明。 慈孝天所爱，勤道命不倾。 道君曰：龙君之功重矣大矣，可谓善哉善哉者，其乃宿勋天心，莫不感焉。 况神真太真说科戒之美矣。 道君语龙君曰：汝承宿世，功德已显，乃为众恩。 及近劳勤，三宝之中，功之表也。 汝谛听吾戒，思惟吾言，当复广说大道元始之法。 其言至要，应所修行无限之善法。 龙君言曰：大善之行云何，愿闻思听，辄当更受戒言，宣布十方，劝进善心，令不倦也。 於是太上大道君答龙君曰：又有一法，行善道士者，其人相好备具，得诸道真人宝经。 三皇洞真人有太真大科丹简墨箓，并三皇玉清隐书三皇文字，泰清丹经飞石隐形，灵妙童丹之秘术，亦其真也。 道之妙真，天地元谱所记，其言明矣。 飞仙之要，至矣重矣，可不勤之。 善修念也。 至道之言，夫行至信之信本也。 大善巍巍，制御小乘之法，宜禁之限也。 宜有节也。 节之有所止，其威也，大乘之行，观乎一切，一切众生三宝之功，使其有渐也。 谓龙君有宿功积德之行，别有三十三戒法，承三十二天之仪。 戒法皆劝善之始也。 复有十六事进增智慧，显布弘惠之勤。 何谓十六进增智邪。 施善行众，齐具如真，戒言无缺，忍不应谓忍，果上精进致定，诸行已具，智慧情信，行悉已足，供事如道，游静乐门，闲备六贤法，最有十善。 饰身口意德具操行，知足乐静之身，三自劝进，修内外之善，劝诸德行，并修十六行法之事。 应受祥福，演大智心显，赏功於大道之世。 施弘布慧，流化於后代也。 又复龙君有善智慧之心二十二事，亦令除径之意，存大乘之志，高且清也。 夫太清去浊事，抑诸俗，不言杂事，不行非法，弃去邪恶，执诸智慧，修行善法者，其道通焉，其道大焉。",
      "translated_text": "Should one not diligently cultivate fasting and vigilance?\n\nThe Dragon Lord said: “The merit of accumulated goodness all arises from the Dao. Those who wish to establish merit and accumulate virtue must rely on the fasts of the Supreme Numinous Three Treasures. Through years and months of tireless practice, the Directors of Destiny memorialize their meritorious deeds to the Upper Heavens. The Celestial Thearch commands the Three Offices to record their achievements, enabling them to transcend the Three Calamities and Five Difficulties. The merit of fasting is especially weighty—how could one not diligently pursue it? The root of all future lives is thus firmly established.”\n\nNow, I have compiled and presented the *Scripture of the Supreme Eight Mighty Summons of the Dragon*. The upper chapter invokes and entreats the dragons, while the lower scroll recounts their origins.\n\nThe Supreme Lord of the Great Dao spoke of the cycles of hardship and prosperity, of withering followed by flourishing, and then intoned this ode:\n\n“Vast and boundless, the Dragon Lord,\nEndowed with heaven’s supreme numen.\nYet when the Yang-Nine calamity struck,\nAnd the Hundred-Sixth cycle brought ruin,\nThe myriad people parched and withered,\nDying of thirst in the abyssal pools.\nThey raised their faces to heaven, sighing,\nPleading for mercy amid the flames of disaster.\nTheir cries of sorrow and lament\nTroubled the radiant Perfected of Heaven.\nThe Upper Heavens, moved by their plight,\nSummoned the Dragon Kings.\nBut the dragons fled in terror,\nConcealing their forms in hidden shadows,\nHiding in the depths of Yu Abyss,\nWithin the caverns of cliffs and stones.\nThen the Eight Mighty Decrees were issued,\nCommands intersecting and converging.\n‘Let any Dragon Lord\nWho bears the girdle of the Five Stars\nStrike the cliffs of Yu Abyss—\nLet the dragons take flight with roaring cries!’\nA thousand myriad came to the rescue,\nReceiving merit and renown.\nThey gathered the Rain Masters,\nWeaving clouds over the imperial capital.\nFor three days and nights,\nThey cleansed the abyss, restoring purity.\nCrops flourished in abundance,\nAnd the myriad people were revived.\nThe four seasons harmonized,\nAll enjoying peace and prosperity.”\n\nThe Supreme Lord of the Great Dao said: “In praise of the Dragon Lord’s great merit—how majestic is his virtue!”\n\nThose who expound this teaching observe the Five Precepts, as follows:\n\n“With a heart full of compassion, guide many,\nAnd the heavenly Dao will open the dark.\nCherish and protect, dispelling sorrows,\nSo merit flows to future generations.\nThe Dao does not fail those who act,\nYet people bring misfortune upon themselves.\nWhy does fate turn against them?\nGood-hearted ones grow desolate.\nDiligently urge the cultivation of goodness,\nTo transcend disasters and grasp salvation.\nThe Dragon’s might and virtue are vast,\nHis beneficence bearing heaven’s numen.\nSaving and reviving all under heaven,\nNone fail to receive fortune and glory.\nOnce the Yang-Nine calamity is averted,\nThe Hundred-Sixth cycle is pacified.\nWithered lands are drenched with blessings,\nTurbid afflictions become clear and pure.\nThe Eight Mighty Commands and decrees,\nThe precious talismans and the Emperor’s Jade,\nAll are talismans to subdue poison,\nDiminishing the might of demonic hordes.\nThe Dragon King approaches the riverbank,\nThe dragons emerge with startled cries.\nMerit accumulates, and ten thousand blessings descend;\nLong fasts amplify the sound of praise.\nNone fail to come from goodness,\nTheir might reaching the Upper Numen.\nFortune descends like thunder from heaven,\nThe deaf hear, the mute speak.\nThe blind regain their sight,\nThe lame rise and walk.\nThe good are aided by spirits,\nThe wicked punished by demonic thieves.\nThe Dao takes goodness as its root,\nVirtue takes trust as its light.\nCompassion and filial piety—heaven loves them;\nDiligence in the Dao keeps fate from toppling.”\n\nThe Dao Lord said: “The Dragon Lord’s merit is weighty and great—truly, how excellent! This is the legacy of past deeds that have touched the heart of heaven, and none fail to be moved. How much more so the beauty of the precepts and disciplines expounded by the Divine Perfected and Supreme Perfected!”\n\nThe Dao Lord addressed the Dragon Lord: “You have inherited the merit of past lives, your virtue already manifest, becoming a blessing to all. Your recent labors, especially within the Three Treasures, stand as a testament to your merit. Now, heed my precepts and ponder my words, for I shall further expound the primordial methods of the Great Dao. These words are of utmost importance, guiding the cultivation of boundless goodness.”\n\nThe Dragon Lord said: “What are these great deeds of goodness? I wish to hear and reflect upon them. I shall receive your precepts anew, proclaim them to the ten directions, and encourage the hearts of goodness, that they may never grow weary.”\n\nThereupon, the Supreme Lord of the Great Dao replied to the Dragon Lord: “There is yet another method for Daoist practitioners of goodness. Such a person, adorned with all auspicious marks, obtains the precious scriptures of the Perfected of the Dao. The Perfected of the Three Sovereigns’ Cavern possess the *Great Precepts of the Supreme Perfected*, the cinnabar talismans and ink registers, along with the *Hidden Writings of the Three Sovereigns of Jade Clarity*, the *Cinnabar Scripture of Supreme Clarity* for flying stones and concealment, and the esoteric arts of the numinous youth’s cinnabar—all are true and authentic. The wondrous subtleties of the Dao are recorded in the primordial registers of heaven and earth; their words are clear. The essentials of ascending as an immortal are most weighty—how could one not diligently pursue them? Cultivate goodness with mindfulness.\n\nThe words of the Supreme Dao are the foundation of utmost trust. Great goodness is majestic, governing the lesser vehicle’s methods, which must be restrained and limited. There should be moderation, and moderation must have its bounds. Its might lies in the practice of the greater vehicle, which observes all things. The merit of the Three Treasures enables all beings to progress gradually.\n\nIt is said that the Dragon Lord, through the merit of past deeds and accumulated virtue, possesses thirty-three precepts, adhering to the rites of the thirty-two heavens. These precepts all begin with the encouragement of goodness. Furthermore, there are sixteen practices to enhance wisdom and manifest boundless kindness. What are these sixteen practices that augment wisdom?\n\nBestow goodness upon the multitude, aligning all as if true;\nLet precepts be unbroken in word;\nPatience is not merely endurance;\nAdvance with unwavering resolve to attain concentration;\nAll practices are complete;\nWisdom and sincerity are perfected;\nAll actions are fulfilled;\nServe as the Dao requires;\nRoam in tranquility, delighting in the gate of stillness;\nCultivate the six virtues of the worthy;\nPossess the ten virtues;\nAdorn body, speech, and mind with virtue, maintaining integrity;\nKnow contentment, delighting in stillness;\nExhort oneself thrice to advance;\nCultivate inner and outer goodness;\nEncourage all virtuous deeds;\nAnd practice the sixteen methods of conduct.\nThus, one receives auspicious fortune,\nDevelops the mind of great wisdom,\nAnd is rewarded in the era of the Great Dao.\nExpound and disseminate wisdom,\nFlowing transformation to later generations.\n\nMoreover, the Dragon Lord possesses twenty-two aspects of the heart of good wisdom, also intended to eliminate obstacles and uphold the aspiration of the greater vehicle—lofty and pure. The affairs of Supreme Clarity reject the turbid, suppress the vulgar, avoid idle talk, refrain from improper conduct, cast aside wickedness, grasp wisdom, and cultivate good methods. Thus, the Dao is penetrated, and the Dao is great.”",
      "overlap_context": "hearch and the Envoys of the Fire Pearl. The radiant talismans of the Golden True Tiger and the Majestic Golden刚 of the Great One, along with the luminous Perfected Phoenix Talismans, were invoked to shield and sweep away the flames, allowing the flying embers to disperse. The Immortals and Sages, together with the Great Golden-Mouthed Birds, came to deliver us, enabling us to escape the calamity and survive, a result of our accumulation of virtuous deeds and the response to our good blessings.”",
      "start_char": 4941,
      "end_char": 6191,
      "start_sentence": 209,
      "end_sentence": 277,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.101369857788086,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "龙君之威已制，已入大乘，况於太上者乎。 龙君复行二十二事，能进智踊，能信顺心，不可当诸魔官属并邪俗外道，降而却之，何谓踊过於常人之心。 我心志猛定志，言所防必固，强行不堕，心不懈息也。 踊时正如天地威神威鬼，威俗威伪，威毒威狩，威非威物，八威之策，故有所像也。 威者，如大金刚坚固之行是谓。 道言：龙君真人有二十二踊法，能有威，罔致有踊刚之行，致普智慧之心。 一切众魔及诸魔外邪外道，不得敢亡当龙君之踊制也。 道不虚行，故有轨仪。 道曰：夫河海扬波，太阳枯焦，洪彼四合，兴云造雨。 静风止注，役龙命真，威振之时，群龙惊飞，云停雾聚，开荡宇内，加润旱桔，五香敷庭，正大道大明也。 大善之行，可谓善哉。 大道君曰：龙君真人亦既施威录召群龙，时当先祭劳大龙王，醮河神风伯雨师，又祝龙咏河伯水神虞渊使者，三过祝愿，身斋三日，临河川流而颂咏此上篇盟文也。 祭醮盟誓求命龙之时，常亦奉敬恭恪河伯五岳四渎诸神也。 可谓天气下降，地气上升，洪流之注，要须阴阳合德，二仪相感，四时顺焉。 五岳操躬，四海冥合，河神操龙，虞渊洞溢，八门开通也，其道成焉，功之大也。 大元真人龙君曰：已受四时洒泽命龙之法，有未见五明之化，何谓五明。 一曰上洞无欲之明，二曰彼我心志之明，三曰五达九合之明，四曰智慧应机之明，五曰远瞻十方朗无碍违之明，是为五明洞焉。 五明之照，上承三皇五星之精，次承五岳四渎之灵，又承五香芝英之明。 五香之明，绝海异邦，一株五根，一茎五枝，一枝五叶，一间五节，五五相当，故仙贤名之。 五香之木，烧之十日，上彻九皇之天，有大慈之心，德化之圣也。 大道君又告龙君曰：宣化善方，若有好乐修斋求道之人，有情信，可修要道者，乃可普加授之，以明法化之神，则后贤有通明不绝之善义也。 於是龙君受命，乃乘龙飞集虞渊龙池，引将群龙来降到诸国，普使天下须水旱者，悉使依上篇经告誓醮水官河神之属，然后龙渊丈人当开池云，升负水来洒注也。 大道君曰：命真人龙君以时使之非时所须，依常自供，给天仙飞仙官属，自各各常所给天官之羽仪，非请时求雨水之事，欲斋转龙王经上下二篇。 使之音气悲切，向河水流之中咏之，各七遍。 次法师赞梵唱善，咸使河神感动，群龙悲切者，翳然赤身降见形於东西之方。 三日感至，即白日扬光而夜明，以通晴之感应也。 大道君又命龙君真人曰：若当欲斋，值天大旱，遍地扬尘，积月累日，亢阳不泽者，又应命召龙君告求雨施也。 依上篇盟文诵咏下篇七遍，哀而美者，天真龙君奄为之乘龙降矣。 依如上篇，当咏诵之上篇下篇，立一日一夕，各得七遍。 祭醮河神龙君求遣群龙飞入四海江河之中，飞降升上负水，游演弥布天中，洪注滂沱三日，雨洒三夕。 先罗香灯绩夜昼，则雨施吹呼立至，正真所加，无量枝条，累柯堂堂。 圣王德行，大善升登，变通非常所尽，命召甚难。 事竟速遣，此龙君神化清静洒泽之感，非至精国主，何便能致此降哉。 缅缅夷平，非笃不矜。 道真无上言，并有四等行善功德之大者，何为四行，道曰：如其修清静，为之一行也。",
      "translated_text": "The Dragon Lord’s majesty has already been established, having entered the Greater Vehicle—how much more so for those of the Supreme Clarity? The Dragon Lord further practices the twenty-two methods, which advance wisdom and inspire the heart, fostering faith and compliance. No demonic officials, heterodox followers, or external deviants can withstand them; they are repelled and driven back. What is meant by \"inspiring beyond the hearts of ordinary people\"? My heart’s resolve is fierce and steadfast; what it guards is unshakable. With unyielding practice, the heart does not slacken or rest.\n\nWhen inspired, it is as if the majesty of heaven and earth, the might of spirits and ghosts, the authority over the vulgar and the false, the power over poison and hunting, the dominion over the improper and the inanimate—these eight strategies of awe—take form. Awe is like the unbreakable conduct of the great vajra. The Dao states: The Dragon Lord Perfected possesses twenty-two methods of inspiration, capable of majesty, embodying unwavering and resolute conduct, and manifesting the heart of universal wisdom. All demonic beings, external deviants, and heterodox paths dare not oppose the Dragon Lord’s inspired control.\n\nThe Dao does not act in vain; thus, it has its rules and rituals. The Dao says: When rivers and seas surge, the sun scorches, and the four directions are parched, clouds gather to bring rain. When the wind stills and the downpour ceases, the Dragon Lord commands the Perfected. At the moment of majestic vibration, the dragons take flight in alarm. Clouds halt and mists converge, sweeping across the world, nourishing the withered and dry. Five fragrances spread through the courtyard—this is the great illumination of the Great Dao. Such conduct of great goodness—how excellent it is!\n\nThe Lord of the Great Dao says: After the Dragon Lord Perfected has exerted his majestic command to summon the dragon hosts, one must first offer sacrifices to honor the Great Dragon King, perform rites for the River God, Wind Earl, and Rain Master, and invoke the Dragon Lord, River Earl, Water Gods, and Yuanyuan Envoys. After three invocations of prayers, fast for three days, then stand by the flowing rivers and recite this upper chapter of the covenant text. When performing the sacrificial rites and covenant oaths to summon the dragons, one must also reverently honor the River Earl, the Five Peaks, the Four Waterways, and all the gods.\n\nThis is called the descent of heavenly qi and the ascent of earthly qi. The pouring of great currents requires the union of yin and yang, the mutual resonance of the Two Modes, and the harmony of the four seasons. The Five Peaks bow in reverence, the Four Seas merge in darkness, the River God commands the dragons, and Yuanyuan overflows. The Eight Gates open—thus the Dao is accomplished, and its merit is great.\n\nThe Primordial Perfected Dragon Lord says: Having received the method of summoning dragons to bestow seasonal moisture, yet not having witnessed the transformations of the Five Illuminations—what are the Five Illuminations? The first is the illumination of the Upper Cavern’s desirelessness; the second is the illumination of the mutual clarity of self and other; the third is the illumination of the Five Penetrations and Nine Unions; the fourth is the illumination of wisdom responding to circumstances; the fifth is the illumination of gazing afar into the ten directions, unimpeded and without obstruction. These are the Five Illuminations of the Cavern.\n\nThe radiance of the Five Illuminations first receives the essence of the Three Sovereigns and Five Stars, then the numen of the Five Peaks and Four Waterways, and further the brilliance of the Five Fragrant Mushrooms. The Five Fragrances’ illumination reaches even the distant lands beyond the seas. One plant has five roots, one stem five branches, one branch five leaves, one segment five nodes—five and five correspond. Thus, the immortals and sages name it. When the Five Fragrant Wood is burned for ten days, its smoke ascends to the Nine Emperor Heavens. It embodies the heart of great compassion and the sagely virtue of transformation.\n\nThe Lord of the Great Dao further instructs the Dragon Lord: When propagating good methods, if there are those who delight in performing purification rites and seeking the Dao, who possess sincerity and faith, and are fit to cultivate the essential Dao, then bestow it upon them universally to illuminate the divine transformations of the Dharma. Thus, later worthies will inherit the unbroken goodness of enlightenment.\n\nThereupon, the Dragon Lord receives the command, mounts his dragon, and flies to assemble at the Dragon Pond of Yuanyuan. Leading the dragon hosts, he descends upon the various lands, universally enabling those in the world who require rain or drought to follow the covenant text of the upper chapter, performing rites and oaths to the Water Officials, River Gods, and their kind. Then, the Dragon Pond Elder will open the pond’s clouds, bearing water to sprinkle and pour.\n\nThe Lord of the Great Dao says: Command the Perfected Dragon Lord to act in a timely manner for those in need, providing regular sustenance to the Heavenly Immortals, Flying Immortals, and their officials, as well as the customary attendants of the Heavenly Officials. When not entreated for rain, recite the upper and lower chapters of the *Scripture of the Dragon King*. Let the sound be sorrowful and earnest, chanting toward the flowing river seven times each. Next, the Dharma Master praises and intones the good, moving the River God and stirring the dragon hosts to sorrow. Suddenly, they appear naked in the eastern and western directions. After three days of such devotion, daylight shines brightly, and the night becomes luminous—a response to the entreaty for clear skies.\n\nThe Lord of the Great Dao further commands the Perfected Dragon Lord: If, when performing purification rites, the heavens are severely parched, the earth stirs with dust, and months pass without moisture, with scorching yang unrelieved, then summon the Dragon Lord to beseech rain. Recite the upper chapter’s covenant text and the lower chapter seven times each, with mournful and beautiful tones. The Heavenly Perfected Dragon Lord will swiftly mount his dragon and descend. As in the upper chapter, recite both chapters, completing seven repetitions each within a day and a night. Perform rites to the River God and Dragon Lord, dispatching the dragon hosts to fly into the Four Seas and rivers, ascending to bear water, roaming and spreading across the heavens. A torrential downpour will pour for three days, raining for three nights. First, arrange incense, lamps, and continuous offerings day and night. Then, the rain will arrive with a sudden gust. The true power bestowed is boundless, like branches and leaves flourishing in abundance.\n\nThe virtuous conduct of the sagely king ascends in great goodness, transforming beyond all ordinary limits. The command and summons are most difficult, yet the matter is swiftly accomplished. This is the pure and cleansing response of the Dragon Lord’s divine transformation—how could any but the most refined ruler achieve such a descent? Vast and level, it is not to be slighted.\n\nThe supreme words of the Dao’s truth encompass four kinds of great meritorious conduct. What are the four practices? The Dao says: Cultivating purity and stillness is the first practice.",
      "overlap_context": "\nExpound and disseminate wisdom,\nFlowing transformation to later generations.\n\nMoreover, the Dragon Lord possesses twenty-two aspects of the heart of good wisdom, also intended to eliminate obstacles and uphold the aspiration of the greater vehicle—lofty and pure. The affairs of Supreme Clarity reject the turbid, suppress the vulgar, avoid idle talk, refrain from improper conduct, cast aside wickedness, grasp wisdom, and cultivate good methods. Thus, the Dao is penetrated, and the Dao is great.”",
      "start_char": 6191,
      "end_char": 7412,
      "start_sentence": 278,
      "end_sentence": 312,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.97561526298523,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "申志道心者，二行也。 善化物得成为三行也，建功方便济度众生之命为四行也。 夫修四功等者，何也哉。 且龙君真人曰：乃有八直之行，如行八威制召之命者，皆从正道之心等焉。 如非法之事，故不使已善之贤见非法之科也。 入当明宣之，宣善不普，各由梵主不告诸弟子师之咎也。 师之责也。 真人龙君曰：亦闻道有三界。 何为三界？ 进勤修德，於虚无应行者，於无色界，已悉清净，得净我性命，亦能过法界。 法界净，故则数界净，数界净，故则无数界净，无数界挣，故得三界净。 三界净，故眼识界净，眼识界净，故意识界净，意识界净，故得空界净，空界净，故诸法界净。 因是净故，则诸法等净，如空空等净，故得众生净以诸净，故得众生守以诸净，故便无其二，亦不着二无二净，故则道清净，以斯言之清净之上道矣。 真人龙君又言：道说亦无，众念亦不念道，诸念悉净，若如登上妙寂於彼，永无是谓无门。 念应无所念，无念道者，亦无识念，其道都无，入乎冥冥。 行此无念，无念道之至真矣。 若龙君真人欲行斯道清净意者，当明晓净行，亦使其身口意清净行生受气也。 於无中而玄禀有也，谓之生道，道之根焉。 真人龙君曰：何谓身行至。 道言曰：身行去来生法，来无尽法，现在景法，终无尽法。 其无尽者，是谓身行。 又复身法因缘合会，其因缘老则空无想，淡然无念，如此之眇眇，龙君今欲像之模法，观身如斯之道，不可不汲勤之焉，得真道矣。 大道君曰：龙君真人，若乘是净心，生於有欲之界，而在色界与诸天俱处众梵之中，安静进止无躁动者，是龙君真人能与诸天神人化导以权。 或生色界而欲界现而有象。 又与诸天念众生周旋，坐起不觉，有劳拂之慢，众生贤德亦无自轻。 彼以斯行清净诸定，正心受之，於上道莫不飞行於玄虚也。 大道君日：夫真人已悉合自然之行，桓有清净之体，行者斯其真大矣。 自执身已定，复不随止以定所生者，故有进退之心，非受真之谓。 之譬如无上真人教化之始，亦有善权方便。 若道士志学晓解清净，飞行变化无方，可谓勤修，道不负人。 大道君曰：又闻龙君真人教化之始，以不习以求道习。 不习无习以想道习者，故可以知道之行。 亦不习於望道之习，亦本不求习了解者。 或自骨法已洞此元由也，不习所生，冀向道习不习之行，灭度亦无解死生之道。 习不习，执念恒在道，不亦明哉，道将明哉。 至道言曰：夫转虚真三洞法轮，无量龙经者，亦草龙欢踊。 龙君又言： 真道不远，三五复反。 清晴见候，求雨召龙。 龙君一降，啸歌嗈嗈。 洒沾旱苗，所请非衡。 虞渊河官，五岳高峰。 说法教化，唯善为忠。 孝慈蒸蒸，天下无双。 节法所造，或悟以龙。 龙君一降，莫不倾匡。 制策召真，并得魔王。 万鬼灭景，蓬神曲躬。 断绝五道，升举高嵩。 并出斋文，教导童蒙。 流水金符，赫奕宝章。 左带六甲，右佩印章。 唯念三实，执在心胸。 志道勤斋，何问飞空。 飞空道长，长训从容。 道若非习得，何忽与习想。 求道归空无，时须立形像。 患人志不坚，是故出随景。 不乐求道习，荡除诸秽坏。 真道都无习，清净却魍魉。 若有起习者，精诚奇可常。 道云无我念，我念绝无影。",
      "translated_text": "To set one’s will upon the Dao-heart is the second practice. Transforming beings through virtuous influence to achieve completion is the third practice. Establishing meritorious works and employing skillful means to deliver the lives of sentient beings is the fourth practice.\n\nWhy, then, does one cultivate these four kinds of merit? The Dragon Lord True One says: There are also eight upright practices. Those who enact the eight majestic commands of restraint and summoning all proceed from the heart of the true Dao. If matters are not in accord with the Dao, one must not allow one’s own virtuous worthies to witness unprincipled ordinances. One must clearly proclaim this. If the proclamation of virtue is not universal, the fault lies with the Brahma Lord for not instructing his disciples and masters. It is the master’s responsibility.\n\nThe Dragon Lord True One further says: I have also heard that the Dao encompasses three realms. What are the three realms? Advancing with diligence in cultivating virtue, one practices in accordance with emptiness and non-being, attaining purity in the formless realm. Having purified one’s nature and life, one is also able to transcend the Dharma-realm. When the Dharma-realm is pure, then the numerical realms are pure; when the numerical realms are pure, then the innumerable realms are pure; when the innumerable realms are liberated, the three realms are pure. When the three realms are pure, the eye-consciousness realm is pure; when the eye-consciousness realm is pure, the mind-consciousness realm is pure; when the mind-consciousness realm is pure, the empty realm is pure; when the empty realm is pure, all Dharma-realms are pure. Because of this purity, all dharmas are equally pure. Just as emptiness is pure in its emptiness, so too are sentient beings purified. Because of this purity, sentient beings abide in it. Thus, there is no duality, nor does one cling to the non-dual. Because there is no duality, the Dao is pure. Speaking thus, this is the supreme purity of the Dao.\n\nThe Dragon Lord True One further says: The Dao speaks of non-existence, and the multitude of thoughts does not think of the Dao. All thoughts are utterly purified. If one ascends to the wondrous quiescence of that realm, it is forever without gate—this is called the gateless. Thought should be without thought; the Dao of no-thought is also without cognitive thought. The Dao is entirely without substance, entering into profound obscurity. Practicing this no-thought, the Dao of no-thought is most true.\n\nIf the Dragon Lord True One wishes to practice this Dao with a pure mind, one must clearly understand pure conduct and also ensure that one’s body, speech, and mind generate pure conduct in receiving qi. From non-being, the mysterious endowment of being arises—this is called the Dao of generation, the root of the Dao.\n\nThe Dragon Lord True One asks: What is meant by the perfection of bodily conduct? The Dao says: Bodily conduct encompasses the dharmas of past, future, and present lives. The future has no end, the present is like a fleeting scene, and the end is without limit. That which is without limit is called bodily conduct. Furthermore, when bodily dharmas converge through causes and conditions, those causes and conditions age and become empty and thoughtless, serene and without念. In such subtlety, the Dragon Lord now wishes to model this Dharma, observing the body in this Dao. One must not fail to exert diligent effort, thereby attaining the true Dao.\n\nThe Great Dao Lord says: Dragon Lord True One, if you ride this pure heart and are born into the realm of desire, yet dwell in the form realm among the assembly of Brahma gods, abiding in stillness and advancing without restlessness, then you, Dragon Lord True One, are able to transform and guide gods and humans with skillful means. Or, if born in the form realm yet manifesting in the desire realm with form, and associating with the gods and the thoughts of sentient beings, sitting and rising without awareness of weariness or arrogance, and without the worthy and virtuous belittling themselves—through such conduct, you purify all concentrations. Receiving them with a rectified mind, in the supreme Dao, none fail to soar through the mysterious void.\n\nThe Great Dao Lord says: When the True One has fully aligned with the conduct of spontaneity, possessing a body of purity, the practitioner is truly great. If one stabilizes the body yet does not follow the stability that arises from it, there arises a mind of advance and retreat—this is not the reception of the true. It is like the beginning of the teaching of the Supreme True One, which also employs virtuous skillful means. If a Daoist, resolved in study, understands purity, and soars with boundless transformation, this may be called diligent cultivation—the Dao does not betray one.\n\nThe Great Dao Lord says: I have also heard that at the beginning of the Dragon Lord True One’s teaching, one seeks the Dao without relying on habitual practice. Not practicing, yet not practicing the thought of the Dao—this is how one may know the conduct of the Dao. One does not practice the expectation of the Dao, nor does one originally seek practice to understand it. Or, if one’s bone structure already penetrates this fundamental principle, not practicing what is generated, yet aspiring toward the practice of non-practice in the Dao, one extinguishes and transcends even the Dao of understanding life and death. Practicing non-practice, holding念 constantly in the Dao—is this not luminous? The Dao will be luminous.\n\nThe Supreme Dao says: When the Wheel of the Three Caverns of the True Void turns, the immeasurable Dragon Sutras also cause the dragons to rejoice and leap. The Dragon Lord further says: The true Dao is not distant; the three and five return again. In clear skies, observe the signs, seek rain, and summon the dragon. When the Dragon Lord descends once, his whistling and singing resound. He sprinkles and nourishes the parched seedlings—what is requested is not excessive. The river officials of Yu Yuan, the five sacred peaks—preaching the Dharma and teaching transformation, only goodness is loyalty. Filial piety and compassion flourish, unmatched under heaven. The regulations and methods established may awaken one to the dragon. When the Dragon Lord descends once, none fail to submit.\n\nControlling and summoning the true, even the demon kings are obtained. The myriad ghosts vanish like shadows, and the spirits of the wilds bow. The five paths are severed, and one ascends to the lofty Song Mountain. Together, they issue the fast texts, instructing the young and ignorant. The golden talismans flow like water, resplendent with precious seals. On the left, the Six Jia are girded; on the right, the seal is worn. Only the Three Realities are contemplated, held within the heart and breast. Resolved in the Dao, diligent in fasting—why inquire about soaring through the void? The soaring void is the long Dao, long instruction in ease.\n\nIf the Dao is not obtained through practice, why suddenly entertain thoughts of practice? Seeking the Dao, return to emptiness and non-being; at times, one must establish form and image. If one’s will is not firm, one emerges and follows appearances. Not delighting in the practice of the Dao, one sweeps away all defilements and decay. The true Dao is entirely without practice; purity dispels demons and specters. If one arises in practice, sincerity and wonder may become constant.\n\nThe Dao says: Without the念 of self, the念 of self vanishes without a trace.",
      "overlap_context": "ansforming beyond all ordinary limits. The command and summons are most difficult, yet the matter is swiftly accomplished. This is the pure and cleansing response of the Dragon Lord’s divine transformation—how could any but the most refined ruler achieve such a descent? Vast and level, it is not to be slighted.\n\nThe supreme words of the Dao’s truth encompass four kinds of great meritorious conduct. What are the four practices? The Dao says: Cultivating purity and stillness is the first practice.",
      "start_char": 7412,
      "end_char": 8644,
      "start_sentence": 313,
      "end_sentence": 374,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.54809498786926,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "绝念从虚来，虚来有实生。 子能修善化，善化致真灵。 谁知真道贵，金丹在子形。 养育玄邕下，寿命延且长。 何为营短命，不肯脱元精。 元精甚易知，安存玄妙城。 间开日月下，鸣锺会吏兵。 谁能解悟然，在想三元庭。 不解求吾道，反为灾所刑。 身灭刀山峰，毁辱败道名。 何不修斋直，万岁免飘零。 但患功不积，不患积不成。 大道不虚言，恐子罗罪撄。 故开三洞宝，劝尔养长宁。 过度五难苦，仙飞之皇庭。 吾我自相知，谁知真可聆。 龙君真人曰：吾受太上太帝之道，躬禀无上正真之法，以勤营斋直，损己布施。 尔欲度身，必先度人。 尔欲成身，必先成人。 尔欲自贵，必先贵人。 尔欲自敬，必先敬人。 尔欲自立，必先立人。 尔欲自躬，必先躬人。 尔欲自师，必先师人。 尔欲自营，必先营人。 尔欲自济，必先济人。 尔欲自达，必先达人。 尔欲自通，必先通人。 尔欲自乐，必先乐人。 尔欲自饱，必先饱人。 尔欲自饶，必先饶人。 尔欲自先，必须先人。 尔欲自政，必先政人。 尔欲自定，必先定人。 尔欲自慈，必先慈人。 尔欲自孝，必先孝人。 谦躬勤身和颜，晨夕礼侍我尊，见他尊老人，敬如我老尊，心存口念道，恒愿躬礼勤，易味使甘进，不离於晨昏，寒冰不先衣，当先衣老人，行此十八善，应彻於上天。 有财不藏蓄，开仓惠穷人，年出数千斛，悉以救困贫。 龙君少行此，感悟於上天，上天须忠孝，命尽得申延，延益十倍算，命过龙来迎。 积善孝所致，慈心多惠穷，龙骄实难领，拜之为龙君。 升降遍其意，游咏任所之。 兼化别见形，变景靡不通。 亦为众说法，戒悟后学童，为行多慈念。 见贤靡不恭，上圣补真人，方始化世间。 功成游四海，五岳遍周旋，得仙道遗名，行积於后代，化悟於后贤。 世末多灾横，勤斋以度身。 若能养三命，道炼於三元。 端坐思吾道，游宴於昆仑。 未能升玄虚，且乐游地仙。 不羡人间乐，遨游五岳巅。 然后炼金液，飞升造皇乾。 何不勤修斋，沦逮世俗间。 百鬼所攻伐，恐亏天命年。 念念善相续，施惠救穷人。 天道不虚戒，劝子作善缘。 为善患不久，积德福命延。 太上洞玄灵宝八威召龙妙经卷下竟",
      "translated_text": "Extinguishing thought arises from emptiness; from emptiness, true reality is born.\nIf you can cultivate goodness and transformation, goodness and transformation bring forth the true numen.\nWho knows the true Dao’s worth? The golden elixir lies within your form.\nNurtured beneath the mysterious womb, life is prolonged and enduring.\nWhy pursue a short life, unwilling to release primordial essence?\nPrimordial essence is easily known—securely dwell in the wondrous, mystic city.\nBetween the sun and moon it opens; bells resound as officers and soldiers gather.\nWho can awaken to this truth? It resides in the thought of the Three Origins’ court.\nFailing to seek my Dao, you instead invite calamity’s punishment.\nThe body perishes on the peaks of the Blade Mountains, dishonored and the Dao’s name ruined.\nWhy not cultivate fasting and uprightness, to live ten thousand years free from drifting?\nOnly fear that merit is not accumulated; do not fear that accumulation will not succeed.\nThe great Dao does not speak idly—I fear you will entangle yourself in sin’s net.\nThus I reveal the treasure of the Three Caverns, exhorting you to nurture eternal tranquility.\nPassing through the five trials of suffering, you ascend to the imperial court of immortals.\nWe know one another—who truly listens to what is real?\n\nThe Dragon Lord Perfected says: I received the Dao of the Supreme Great Emperor,\npersonally bearing the unsurpassed, orthodox, and true Dharma.\nThrough diligent fasting and uprightness, I diminished myself to bestow alms.\nIf you wish to deliver yourself, first deliver others.\nIf you wish to perfect yourself, first perfect others.\nIf you wish to honor yourself, first honor others.\nIf you wish to respect yourself, first respect others.\nIf you wish to establish yourself, first establish others.\nIf you wish to serve yourself, first serve others.\nIf you wish to teach yourself, first teach others.\nIf you wish to cultivate yourself, first cultivate others.\nIf you wish to save yourself, first save others.\nIf you wish to reach yourself, first reach others.\nIf you wish to connect yourself, first connect others.\nIf you wish to delight yourself, first delight others.\nIf you wish to sate yourself, first sate others.\nIf you wish to enrich yourself, first enrich others.\nIf you wish to precede yourself, first precede others.\nIf you wish to govern yourself, first govern others.\nIf you wish to stabilize yourself, first stabilize others.\nIf you wish to be kind to yourself, first be kind to others.\nIf you wish to be filial to yourself, first be filial to others.\n\nBow humbly, diligently tend to your body, and soften your countenance.\nMorning and evening, pay homage to my honorable one.\nWhen you see other venerable elders, revere them as you do my elder.\nKeep the Dao in your heart and on your lips, ever wishing to serve with devotion.\nExchange flavors to make offerings sweet, never departing from dawn or dusk.\nDo not clothe yourself before the cold; first clothe the elderly.\nPractice these eighteen virtues, and they shall pierce through to heaven above.\nDo not hoard wealth; open your granaries to aid the poor.\nEach year, dispense thousands of bushels to rescue the destitute and impoverished.\n\nThe Dragon Lord practiced this from youth, awakening to heaven above.\nHeaven demands loyalty and filial piety; when his allotted time was spent, it was extended.\nHis lifespan was lengthened tenfold, and dragons came to welcome him.\nThis arose from accumulated goodness and filial devotion, a compassionate heart that aided the poor.\nThe Dragon’s pride was truly hard to bear—he was revered as the Dragon Lord.\nAscending and descending, his intent was boundless; he roamed and chanted as he pleased.\nHe transformed to appear in other forms, altering his appearance without obstruction.\nHe also expounded the Dharma to the multitude, awakening later disciples.\nHis conduct was full of compassion and mindfulness.\nSeeing the worthy, he was never irreverent.\nThe supreme sages supplemented the Perfected; only then did he transform the world.\nWhen his work was complete, he roamed the four seas, circling the Five Peaks.\nAttaining the immortal Dao, his name endured; his deeds accumulated for later generations.\nHe enlightened later worthies.\n\nIn the world’s end, calamities abound—cultivate fasting to deliver yourself.\nIf you can nurture the Three Lives, the Dao refines the Three Origins.\nSit upright and contemplate my Dao, roaming and feasting on Kunlun.\nIf you cannot ascend to the mysterious void, then delight in wandering as an earthbound immortal.\nDo not envy the joys of the human realm; roam the summits of the Five Peaks.\nThen refine the golden liquid, ascend to the imperial heavens.\nWhy not diligently cultivate fasting, rather than sinking into the mundane world?\nAssailed by a hundred ghosts, I fear your heavenly allotted years will be diminished.\nLet thoughts of goodness continue unbroken; bestow kindness to rescue the poor.\nThe heavenly Dao does not idly preach—it exhorts you to create good karma.\nIf goodness is not long practiced, accumulated virtue extends your blessed lifespan.\n\n*Thus concludes the Lower Scroll of the Supreme Perfected Wondrous Scripture of the Eight Mighty Summons of the Numinous Treasure of the Cavern of Mystery.*",
      "overlap_context": "tertain thoughts of practice? Seeking the Dao, return to emptiness and non-being; at times, one must establish form and image. If one’s will is not firm, one emerges and follows appearances. Not delighting in the practice of the Dao, one sweeps away all defilements and decay. The true Dao is entirely without practice; purity dispels demons and specters. If one arises in practice, sincerity and wonder may become constant.\n\nThe Dao says: Without the念 of self, the念 of self vanishes without a trace.",
      "start_char": 8644,
      "end_char": 9463,
      "start_sentence": 375,
      "end_sentence": 431,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.90829634666443,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝八威召龙妙经.txt",
        "category": "本文类"
      }
    }
  ]
}