{
  "source_id": "太上洞神洞渊神咒治病口章",
  "source_file": "chunked_daozang\\太上洞神洞渊神咒治病口章.json",
  "total_chunks": 14,
  "total_original_chars": 13291,
  "total_translated_chars": 76576,
  "total_translation_time": 354.3958783149719,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Cavernous Divine and Abyssal Divine Incantations for Healing Illnesses – Oral Petition Chapter**\n\n**Title:** *The Supreme Cavernous Divine and Abyssal Divine Incantations for Healing Illnesses – Oral Petition Chapter*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\n**The Supreme Cavernous Divine and Abyssal Divine Incantations for Healing Illnesses – Oral Petition Chapter**\n\nSound the celestial drum thrice to open the incense burner.\n\nSupreme Mysterious Origin, Five Numinous Venerable Lord, Three *Qi* Orthodox Deities—hasten to summon within us, your servants: the True Officials of the Five Corporeal Forms, the Three-and-Five Merit Officers, the Upper and Lower Grand Masters, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Envoys, the Message-Transmitting Celestial Maidens, and the Document-Holding Lads—twenty-four each.\n\nThe Ministers and Vice Ministers, the Messengers and Lesser Clerks—one hundred twenty thousand.\n\nWe hereby report to the Supreme Three Heavens’ Mysterious Origin Great Dao Lord and the Ten Directions’ Supreme Ones.\n\nAs we now enter the oratory and burn incense to present this oral petition, we pray for healing and disaster dispelling, that the Eight Directions’ Orthodox *Qi* may enter our bodies, allowing our supplications to ascend directly before the Jade Emperor’s throne.\n\nNext, bow to the four directions, beginning in the west and ending in the east, sounding the celestial drum thirty-six times.\n\nThen, kneel to dispatch the officers and soldiers:\n\nFrom within us, your servants, we reverently send forth:\n- The Transcendent Numinous High Officials and Direct Merit Officers—one hundred twenty thousand each.\n- The Orthodox Unity Merit Officers—one hundred twenty thousand.\n- The Three-in-One Merit Officers—one hundred twenty thousand.\n- The *Qi*-Hastening Merit Officers—one hundred twenty thousand.\n- The Illness-Healing Merit Officers—one hundred twenty thousand.\n- The Lesser Physician Clerks—one hundred twenty thousand.\n- The Upper, Middle, and Lower Section Merit Officers—one hundred twenty thousand each.\n- The Upper, Middle, and Lower Section Envoys—one hundred twenty thousand each.\n- The High Chariot Envoys—one hundred twenty thousand.\n- The Crimson Chariot Envoys—one hundred twenty thousand.\n- The Primordial True Envoys—one hundred twenty thousand.\n- The Primordial Spirit Envoys—one hundred twenty thousand.\n- The Yang Spirit Envoys—one hundred twenty thousand.\n- The Yin Spirit Envoys—one hundred twenty thousand.\n- The High Chariot Governors—two hundred forty thousand.\n- The *Qi*-Seizing and *Qi*-Consuming Clerks, Ghost-Seizing and Ghost-Consuming Clerks, Malevolence-Seizing and Malevolence-Consuming Clerks, Calamity-Seizing and Calamity-Consuming Clerks, Essence-Seizing and Essence-Consuming Clerks, Misfortune-Seizing and Misfortune-Consuming Clerks, Illness-Seizing and Illness-Consuming Clerks—six hundred thousand each.\n- The Supreme Healing Jade Maidens and the Ten Directions’ Overseers—seven hundred thousand each.\n\nLet all who emerge don their solemn attire, crowns and pendants, and arrange their majestic regalia. Let them array their processional insignia, rank upon rank, standing in solemn formation.\n\nBefore, behind, left, and right of us, your servants, let each wield blades outward, ordering weapons and staves. Let a thousand voices chant in unison, ten thousand in harmony.\n\nThree paces from us, let them regard one another, awaiting the Direct Merit Officers—each wearing a Heaven-Reaching Crown, clad in black single robes, girded with Dragon-Tiger Talismans, and wielding Vajra Halberds—seven hundred twenty thousand.\n\nBefore us, the Orthodox Unity Merit Officers—each wearing a Vermilion Yang Headband, clad in crimson ceremonial robes, girded with Heaven-Reaching Spears, and wielding Luminous Swords—seven hundred eighty thousand.\n\nBehind us, the Soaring Heaven Great Generals—each wearing a Five-Colored Crown, clad in brocade armor, girded with Hundred-Forged Blades, and wielding Nine-Bend Blades—four hundred thousand.\n\nTo our left, the Fierce Horizontal Great Generals—each wearing a Dark Yin Crimson Headband, clad in Seven-Jade Black Robes, and girded with Hundred-Forged Black Halberds—nine hundred thousand.\n\nTo our right, the Merit Officers above, the Registrars below, the Heavenly Officials to the left, the Earthly Officials to the right, the Civil Officials before, and the Martial Officials behind.\n\nThe Five-Colored Banners flutter in majestic order. They ride chariots and mount steeds, dragon and tiger cavalry. Those on foot and in palanquins proceed in ranks.\n\nThe Azure Hosts in the east, the White Hosts in the west, the Crimson Hosts in the south, the Black Hosts in the north, and the Yellow Hosts at the center.\n\nThe shield-bearers advance, the archers follow. The Bandit Officers to the left, the Guardians to the right. Drums and bells resound, horns echo—deep and thunderous.\n\nThe Five Marchmounts’ armies patrol the streets. The Four Seas’ armies blockade the nine provinces. The armies of Kunlun’s Jade Capital overflow. The voids within and without respond in unison.\n\nCommand the various Ghost Kings to order the demonic soldiers, each to slay the ghosts.\n\nNow, from [so-and-so] prefecture, county, village, and household, [so-and-so] man or woman petitions:\n\nDescendants of ancient officials, common folk by custom, we have, through a thousand years’ fate, entered the Daoist gate. As latter-day followers, we submit to the Great Dao, privately rejoicing in its grace.\n\nYet, through unclear devotion, we have incurred *qi*-afflictions and attracted misfortune. Of late, our households suffer ill fortune, our dwellings harbor calamities—ten thousand miseries, countless disasters.\n\nMoreover, [so-and-so] has, for [so many] months and days, suddenly fallen ill, with symptoms [as described], fearing survival is unlikely.\n\nWe have heard that the Dao can reverse death and restore life. Those who surrender to it are never left unaided. Petitions that reach the throne are never unanswered. The grace lies with the Supreme Ones; the matter rests with the Overseers.\n\nWe, your foolish servants, uphold the Three Caverns’ decrees, unable to bear the urgency of the suffering before us. Great and small, high and low—we kowtow, beat our cheeks, and plead in earnest, seeking deliverance.\n\nUnable to endure the sight of this mortal’s desperate plight, like a candle in the wind, we prostrate ourselves, presenting this oral petition once, laid upon the jade table before us.\n\nAs the petitioner’s words are recorded, we humbly submit each matter. We dare not transgress the rites, though much remains to be said.\n\nMay it be that today, the Direct Talismanic Envoys who hold the case, the Overseers, the Guiding Attendants, the Left and Right Announcers, the officials in charge of affairs, the Upper and Lower Plain Women, the Merit Scribes, the Left Millet and Right Sacrificial Officers, and the Case-Holding Clerks—seven hundred thousand each—ascend together with this petition, facing the Celestial Courts, that every matter may be judged and decided, every document transmitted and delivered, all clearly and distinctly.\n\nMay the Merit Scribes and minor clerks, once assembled, descend to heed the oral petition of your servants. When the matters are concluded, may each return to their palaces and resume their positions as before. Let the exchange of officers and soldiers be commanded by the Celestial Courts. May every matter be judged without delay; let no stagnation occur. Those who cause delay shall be the first to face punishment.\n\nMay the timing be opportune for transmission, allowing the Dao’s qi to flow downward, covering the mortal in need. May the afflicted recover swiftly, and may those who recover bring merit to the officers and soldiers. Let their merit be reported to the Celestial Courts, their ranks elevated, and their positions advanced. May all inform one another.\n\nFrom the officials above to the spirits within heaven and earth, may the ghosts afflicting the sick be seized and driven away one by one. May the illness be cured, and may the Jade Maidens of healing attend to them. May every action be carried out in accordance with the ailment, and medicine dispensed as needed. May the inspectors below verify the treatment, addressing each condition according to its symptoms, ensuring clear recovery, with merit and reward for each cure.\n\nShould any among the myriad ranks bear resentment toward the officials, soldiers, or healing officers, let them be furnished with treasured needles, medicinal tools, and the company of Master Lu and Bian Que, leading the Kings of Medicine of the world, along with three hundred sixty Healing Merit Scribes and twenty-four thousand Minor Life Officers. May seven hundred thousand Jade Lads be entreated to descend, responding to the petition in full array. Let recovery be swift, restoring health and mobility.\n\nWith dragon’s ascent and tiger’s tread, may health and fortune abide, free from all else.\n\nRespectfully, with utmost sincerity, this petition is humbly presented for review.\n\nFrom the Great Mystery Capital, the Orthodox Unity, the Balanced Qi Lineage of the Celestial Master, the Yangping Abbey, the Three Caverns Disciple, the Perfected of Mount [X]—your servant [Name]—kneels and bows twice to submit this address:\n\nIn accordance with the documents, [Name], a Daoist official of such-and-such prefecture, county, township, and village, aged [number] years, along with [number] household members, male and female, hereby declares the following as stated.\n\nThe entire household, born of womb and bone, is blessed with descendants. Yet like ants in the grass, we remain mired in vulgar customs, unenlightened. Through the cycles of birth and death, we have attained this present form—raised in the wilds, unable to distinguish the six livestock. Misguided by false beliefs and inverted views, we have strayed for kalpas untold. Our past lives bear the weight of a thousand years’ fate, and only by fortunate encounter have we entered the realm of pure transformation. We have embraced the teachings of the Dharma, pledged ourselves to the Great Dao, and, though but sprouts in the field, have been counted among the people of Heaven, a cause for private joy.\n\nYet this flesh-bound servant has violated the hundred virtues in manifold ways. My transgressions are as scattered as a wolf’s tracks, so grave that the Three Officials weigh them heavily, bringing misfortune upon me. Of late, afflictions great and small, illnesses, calamities, demonic apparitions, and malevolent spirits have plagued my home, draining wealth and fortune, while inauspicious dreams haunt my nights. Moreover, my illness has grown severe, with sufferings too numerous to recount. Though family tends to me, no relief comes. I have prayed to the myriad spirits and made offerings, yet to no avail. Now, beset by hardship, I fear I may not survive. Pressed from above and below, I lack the resolve to rouse myself. I have consulted diviners far and wide, yet the tortoise-shell and milfoil reveal no favorable omen.\n\nI confess that from the thirty-six generations of my great ancestors and forefathers, there have been offenses against the curses of Heaven and Earth, the sun and moon, the stars and constellations, the Five Earth Gods, the curses of water and fire, and the transgressions of the Five Covenants and Seven Curses. The sins of my forebears have incurred the judgments of the Three Officials, bringing harm and depletion to the living. Thus, my life has been beset with hardship, and my affairs have been fraught with misfortune.\n\nI fear that my seven generations of ancestors, during their lifetimes, defied Heaven and betrayed Earth, committing the five acts of rebellion and unfilial impiety, usurping rulers and seizing thrones, murdering sovereigns and lords. They may have wronged regional governors, high ministers, the Three Dukes, the Nine Chamberlains, the Directors of the Imperial Secretariat, the celestial ministers, or the starry hosts. Some may have deceived the gods and scorned their teachers, reviled and humiliated their parents. Others may have spurned sacred teachings, acting recklessly and self-servingly. They may have desecrated the pure abodes and tranquil sanctuaries of the gods, stolen others’ oxen, horses, livestock, or wealth, and when exposed, invoked the wrath of Heaven and Earth. They may have deceived the gods by calling upon the sun, pointed at the stars, or cursed one another beneath the altars of earth gods and ancestral temples, dying in wild places or through mutual retribution. The dead have drawn one another into endless cycles of suffering, leading to utter annihilation. Descendants have called out to one another in an unbroken chain, their torments in the underworld unceasing, extending calamity to later generations.\n\nI further fear that my seven generations of ancestors, while serving in official posts, wrongfully killed the innocent and harmed the good and virtuous. They may have falsely accused and imprisoned worthy men, or seized others’ slaves, cattle, horses, and property, unjustly taking lives without reason. Some may have plotted against uncles and other kin, seizing their wealth, engaging in incestuous relations, or committing unspeakable acts. They may have murdered a man to take his wife, or schemed from both sides, sowing discord between two states. They knew not whose father they killed, whose son they harmed, whose husband they murdered, whose wife they took. They knew not whose state they plotted against, whose lord they harmed, whose ruler they slew, whose minister they betrayed. They knew not whose mother they killed, leaving whose child orphaned, whose goodness they deceived, whose worth they destroyed. They knew not whose possessions they stole, whose wealth they plundered, whose ancestors they felled, whose descendants they slaughtered. They knew not whose house they burned, whose lineage they extinguished. From generation to generation, the dead among my seven ancestors may have committed such sins, drawing the living into their retribution.\n\nIf any of my ancestors died by drowning, I pray they may be interred by water, their inner and outer selves cleansed and radiant. If any perished by fire, I pray they may be buried by fire, ascending as soaring immortals without hindrance. If any died by the sword, I pray they may be buried by the blade, their weapons sharp and auspicious for posterity. If any died in prison or the marketplace, I pray they may be buried there, their sufferings flowing away, ensuring no further misfortune for generations to come. If any were crushed by falling rocks, I pray they may be buried beneath them, their path unobstructed, with verdant grasses flourishing forever. If any were slain by tigers or wolves, I pray they may be buried by these beasts, their pelts and markings bringing boundless fortune through ten thousand kalpas. If any died by oppressive forces, I pray they may be buried thus, their rest undisturbed, their descendants forever secure. If any died of illness, choking, hanging, strangulation, or execution by the sword, may they each be interred according to their fate.\n\nI further fear that those among my ancestors who met such deaths did so on inauspicious days, under ill-omened stars, their spirits condemned to the Three Officials and the Twenty-Four Hells. Some may have been forced by the living to labor in abandoned earth-god shrines, carrying sand and stones day and night to fill rivers and seas, never resting. The tormented dead have pleaded with the celestial bureaus, seeking to replace themselves with the living, thus bringing grave illness, peril, and misfortune upon me. All this stems from the inauspicious deaths of my ancestors, whose suffering harms the living, as they conspire with a hundred ghosts to deplete and afflict us. I fear that in their lifetimes, on the days they took wives, moved homes, or were buried, they violated taboos and prohibitions. Their deaths were ill-starred, their sins unexpiated.\n\nNow I invoke the Eastern constellations—Horn, Neck, Root, Chamber, Heart, Tail, and Winnowing Basket—to extract and absolve the accumulated judgments and condemnations of my seven generations of ancestors and thirty-six generations of forebears, dissolving them entirely. May they ascend to the ranks of celestial beings, their clothing and sustenance naturally provided. If any remain in the Three Wretched Realms or the Eight Difficulties, may they each be delivered. If my seven generations of ancestors and forebears strayed from the Dao into heresy, their transgressions as vast as mountains, yet unabsolved, I pray that a hundred and twenty minor Perfected Officers and a host of celestial generals descend to harmonize and heal them. May they dispel all misfortune, expel malevolent ghosts, and drive away the specters of epidemics and wandering plagues, seizing and confining them all.\n\nMay the sins of my seven generations of ancestors—those of the five rebellions, the countless transgressions, the offenses against Heaven and Earth, the unforgivable crimes—all be pardoned and absolved, their judgments resolved. May my seven generations of ancestors and thirty-six generations of forebears who died by the sword, in bonds, by official execution, in prison or the marketplace, or were crushed by wood or stone, or perished from festering sores, drowning, burning, or were left unburied in distant lands, each be interred according to their fate. If in moving homes, marrying, building dwellings, or other undertakings, my seven generations of ancestors and thirty-six generations of forebears violated the baleful stars or the inauspicious lunar mansions, acted against reason, encountered adversity, or offended the Green Dragon, White Tiger, Vermilion Bird, Black Tortoise, or Hook Star, or the eight divine prohibitions, bringing misfortune, or if their burials or relocations transgressed the Great General of Disaster—may all such offenses be resolved.\n\nMay the Year Star and Great Yin, the clashes and baleful stars, be resolved. The Five Divisions’ piercing deceits and the Twelve Life-Mandating Deities; the monthly establishments, the Five Deficiencies and Six Expenditures; the celestial Year Star and the hidden dragon within the dwelling; the seven prison wardens and the spirits of wells and hearths; the Green Dragon, White Tiger, Vermilion Bird, Black Tortoise, Six Harmonies, and Hook Star; the abodes of the Heavenly Queen, Heavenly Void, Heavenly One, Merit Clerk, Messenger, Grand Unity, Ascending Brightness, Heavenly Rigidity, Follower, River Marshal, Great Auspice, and Lesser Auspice; the Dipper’s encroachment; the yin and yang on all four sides, the inscribed baleful influences, the clamorous corpses, and the Six Harmings; the high merits and low merits, the celestial merits and terrestrial merits, the water merits and earth merits, the metal merits and wood merits; the ghosts of inauspicious times and the calamities of litigation and torture; the green merits, red merits, white merits, black merits, and yellow merits; the celestial fines and terrestrial fines, the green fines, red fines, yellow fines, white fines, and black fines; the ghosts of spilled water and polluted pools, the ghosts of withered groves; the spirits of relay stations and talismanic temples, the ghosts of food and drink; those who delight in blood sacrifices and money, the impure and unrighteous deities; the Mountain and Forest Elders, the Twelve Stream Women; the Male Elders and Female Elders, the Greater Elders and Lesser Elders, the Green Elders, Red Elders, White Elders, Black Elders, and Yellow Elders; the hundred hunting ghosts on the move, the destructive and slaying subordinate officials; the residual qi of mountains, rivers, temples, and shrines, the myriad malevolent ghosts and deities, the supplications and curses; the celestial prayers and terrestrial prayers, the great prayers and small prayers; the Three Examinations of the Southern Village, the Life-Mandating Great King; the deities of crossroads, the Three Sovereigns and Five Emperors; the Fuxi General, who styles himself among the Five Hegemons; the Slaying General, the Celestial Heart Governor; the Great Deity of the Nine Rivers, the Twelve Water Emperors; the Five Paths General and his left and right aides; all the prohibiting officials and the roving hunters of the Four Seas; the travelers on the roads, the Five Deficiencies and Six Expenditures; the Five Poisons and baleful winds, the Twelve Unyielding Ghosts; the qi of spring, autumn, winter, and summer, both pure and turbid; the years overlapping months, the days overlapping hours; may all ghosts, bandits, and entanglements that linger be distinguished and, in accordance with the times, dispersed and dissolved on all four sides, along with the curses.\n\nFrom the Five Hegemons of the Yellow Emperor onward, the ghosts of ruined armies and slain generals who escaped the blade, the strange apparitions that gather and coalesce into malevolent spirits; the essences of cliffs, stones, grasses, and trees, of insects, rats, dragons, and snakes, of foxes, tigers, leopards, and crows, the myriad essences; the subordinate officials and residual qi of the Six Jia, Six Yi, Six Bing, Six Ding, Six Wu, Six Ji, Six Geng, Six Xin, Six Ren, and Six Gui, the ghosts of the Heavenly Stems and Earthly Branches’ prohibitions in the twelve hours—may all such malevolent spirits, as they pursue one another, whether riding in chariots, on horseback, or on foot, be resolved. May the ghostly soldiers who bar the way and seize the souls of the living, harming the people of heaven, summoning the dead, and entangling the living through the unresolved oaths and curses of seven generations of parents and thirty-six generations of forebears, be dispersed.\n\nFrom what place do the deceased seven generations of parents of this household come? What are their surnames and clans, and from which marriages do they derive? From which prefecture, county, village, and hamlet did they depart on the day of their death? What were the names of the officials who presided over their burials? To which stellar officials do they belong, and which constellations govern them?\n\nThe Horn, Neck, Root, Chamber, Heart, Tail, and Winnowing Basket—these Seven Stars of the Green Dragon govern them. Their position pertains to the East, to Jia and Yi, to the Green Emperor, the Year Star, and the essence of wood. They preside over the first, second, and third months of spring, the years, months, days, and hours of Yin, Mao, and Chen. At the onset of spring, when wood is in its prime, it can dissolve the essence of earth.\n\nThe Dipper, Ox, Girl, Void, Danger, House, and Wall—these Seven Stars of the Black Tortoise govern them. Their position pertains to the North, to Ren and Gui, to the Black Emperor, the Chronographic Star, and the essence of water. They preside over the tenth, eleventh, and twelfth months of winter, the years, months, days, and hours of Hai, Zi, and Chou. At the onset of winter, when water is in its prime, it can dissolve the essence of fire.\n\nThe Straddler, Harvester, Stomach, Net, Turtle, Hairy Head, and Triaster—these Seven Stars of the White Tiger govern them. Their position pertains to the West, to Geng and Xin, to the White Emperor, Venus, and the essence of metal. They preside over the seventh, eighth, and ninth months of autumn, the years, months, days, and hours of Shen, You, and Xu. At the onset of autumn, when metal is in its prime, it can dissolve the essence of wood.\n\nThe Well, Ghost, Willow, Star, Spread, Wings, and Axletree—these Seven Stars of the Vermilion Bird govern them. Their position pertains to the South, to Bing and Ding, to the Red Emperor, Mars, and the essence of fire. They preside over the fourth, fifth, and sixth months of summer, the years, months, days, and hours of Si, Wu, and Wei. At the onset of summer, when fire is in its prime, it can dissolve the essence of metal.\n\nThe Seven Stars of [missing text] govern the Center, pertaining to Wu and Ji, to the Hook Star, Saturn, and the essence of earth. They preside over the intercalary months, and when earth is in its prime, it can dissolve the essence of water.\n\nThe twenty-eight lunar mansions and thirty-five stellar officials to which the deceased belong—may the celestial soldiers resolve their entanglements in accordance with the circumstances.\n\nMoreover, it is feared that the deceased ancestors and seven generations of parents of this household, from the Boundless Realm onward, may have committed offenses against the following:\n\nThe Horn Mansion, three stars, twelve degrees. Two pure and two turbid generals, accompanied by 270 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Neck Mansion, four stars, nine degrees. One pure and three turbid generals, accompanied by 350 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Root Mansion, four stars, fifteen degrees. One pure and three turbid generals, accompanied by 350 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Chamber Mansion, four stars, with the Hook and Iron stars (six in total), five degrees. One pure and two turbid generals, accompanied by 150 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Heart Mansion, three stars, five degrees. One pure and one turbid general, accompanied by 310 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Tail Mansion, nine stars, eighteen degrees. One pure and two turbid generals, accompanied by 125 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Winnowing Basket Mansion, four stars, twelve degrees. One pure and one turbid general, accompanied by 390 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Nine Yi of the East, the eighty-one lords and generals of the nine-by-nine, accompanied by seventy billion myriad soldiers, to descend as one.\n\nFor the liberation of so-and-so’s seven generations of parents, ancestors, and the deceased across thirty-six lineages—those bound to the seven lodgings of Horn, Neck, Root, Chamber, Heart, Tail, and Winnowing Basket, their seven stars totaling seventy-five degrees, with one hundred pure and eighty turbid—each shall be released according to their respective star and lodging, all to be dissolved and severed. Let the baleful stars be extinguished, and their lingering connections severed.\n\nThe Dipper Mansion, six stars, twenty-eight degrees. One pure and two turbid generals, accompanied by 365 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Ox Mansion, eight stars, eight degrees. One pure and three turbid generals, accompanied by 365 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Girl Mansion, four stars, ten degrees. Three pure and two turbid generals, accompanied by 235 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Emptiness Mansion, three stars, ten degrees. Three pure and one turbid general, accompanied by 235 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Rooftop Mansion, two stars, and the Grave Mansion, four stars—together six stars, fourteen degrees. Two pure and one turbid general, accompanied by 480,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe House Mansion, two stars, and the Detached Palace, sixty stars—together 1,200 degrees. One pure and nine turbid generals, accompanied by 1,200 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Wall Mansion, two stars, seventy degrees. One thousand pure and one hundred turbid generals, accompanied by 39,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Five Di Lords of the North, the twenty-five lords and generals of the five-by-five, accompanied by 29 million soldiers and 700,000 troops, to descend as one. For the liberation of so-and-so’s seven generations of parents and the deceased across thirty-six lineages—those bound to the seven lodgings of the Northern Dark Warrior: Dipper, Ox, Girl, Emptiness, Rooftop, House, and Wall, their seven stars totaling ninety-eight degrees, with ten thousand pure and nine thousand turbid—each shall be released according to their respective star and lodging, all to be dissolved and severed.\n\nThe Straddler Mansion, sixteen stars, sixteen degrees. One pure and two turbid generals, accompanied by 120,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Bond Mansion, three stars, fifteen degrees. One pure and one turbid general, accompanied by 260,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Stomach Mansion, three stars, fourteen degrees. One pure and one turbid general, accompanied by 1,400 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Hair Mansion, seven stars, 1,200 degrees. Two thousand pure and one hundred turbid generals, accompanied by 320 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Net Mansion, eight stars, 1,600 degrees. Two pure and one turbid general, accompanied by 136 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Turtle Beak Mansion, three stars, eleven degrees. One pure and ten turbid generals, accompanied by 89 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Three Stars Mansion, ninety stars, one hundred degrees. Thirty pure and forty turbid generals, accompanied by 800,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Six Rong Lords of the West, the thirty-six lords and generals of the six-by-six, accompanied by 400,000 troops, to descend as one. For the liberation of so-and-so’s seven generations of ancestors and the deceased across thirty-six lineages—those bound to the seven lodgings of the Western White Tiger: Straddler, Bond, Stomach, Pleiades, Net, Turtle Beak, and Three Stars, their seven stars totaling 80,000 degrees, with one thousand pure and ten thousand turbid—each shall be released according to their respective lodging and star, all to be dissolved and severed.\n\nThe Well Mansion, eight stars, thirty-six degrees. Twenty pure and ninety turbid generals, accompanied by 7,600 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Ghost Mansion, five stars, forty degrees. Twenty pure and thirty turbid generals, accompanied by 70,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Willow Mansion, seven stars, seventy degrees. Nineteen pure and twenty turbid generals, accompanied by 3,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Star Mansion, seven stars, seven degrees. Twenty pure and thirty turbid generals, accompanied by 9,900 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Spread Mansion, six stars, sixty degrees. One hundred pure and three hundred turbid generals, accompanied by 97,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Wings Mansion, twenty-two stars, 1,800 degrees. Twenty pure and thirty turbid generals, accompanied by 390 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Chariot Mansion, seven stars, seventy-two degrees. Thirty pure and ninety turbid generals, accompanied by 760 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Eight Man Lords of the South, the 640,000 lords and generals of the eight-by-eight, accompanied by 640,000 troops and 700,000 myriad soldiers, to descend as one. For the liberation of so-and-so’s seven generations of ancestors and the deceased across thirty-six lineages—those bound to the seven lodgings of the Southern Vermilion Bird: Well, Ghost, Willow, Star, Spread, Wings, and Chariot, their seven stars totaling twelve degrees, with nine pure and nine turbid—each shall be released according to their respective star and lodging, all to be dissolved, severed, and dispersed.\n\n[...] seven lodgings, positioned at the center. The Curved Array of seven stars, the Yellow Emperor of the wu-earth and ji-earth, the Star of Earth’s Essence, governing the four seasons and their divisions, with the waxing and waning of the water essence. The Jade Armillary and Vermilion Palace, the seven stars of the Northern Dipper, together with the twenty-eight lodgings, encircle the heavens in 365¼ degrees. With ten thousand pure and eighty thousand turbid, the invoked lords and generals traverse and return, all to be liberated and transcended.\n\nLet the malevolent stars be extinguished, and those bound for severance be cut off once more. Further dissolve the three yin and three yang, the thousand yielding and ten thousand norms, the thousand pure and ten thousand turbid, that they may no longer afflict the living.\n\nFor the thirty-six generations of ancestral fathers since the dawn of heaven and earth—those who passed before and those who died after—release the spirits of the deceased bound to the six jia and six yi, six bing and six ding, six wu and six ji, six geng and six xin, six ren and six gui, the gods of the Five Paths upon the twelve earthly branches. Let the baleful be extinguished, the auspicious set free, and all bonds severed. For those under the jurisdiction of the Five Punishments—five zi and five chou, five yin and five mao, five chen and five si, five wu and five wei, five shen and five you, five xu and five hai—the gods of the twelve earthly branches, let the malevolent spirits be extinguished and all ties cut off once more. Dissolve the bonds of the six jia cycles.\n\nAll great spirits of the Six Bowels and Six Yin, on behalf of this household, release the seven generations of parents and the thirty-six generations of ancestors, liberating all the deceased. If the departed has transgressed in the jiazi cycle with a thousand curses and ten thousand reproaches, a thousand calamities and ten thousand trials, a thousand sins and ten thousand faults, let the divine general Tianpeng, the yin official Lord Yin’a, and the Jade Maiden of the Great Mystery beseech their dissolution. If the departed has transgressed in the jiaxu cycle with a thousand sins and ten thousand faults, a thousand curses and ten thousand bonds, a thousand calamities and ten thousand trials, let the divine general Tiannei, the official Zhang Bulin, and his four hundred attendants, along with the Yellow-Silk Jade Maiden, dissolve them. If the departed has transgressed in the jiashen cycle with a thousand sins and ten thousand faults, let the divine general Tianchong, the official Cheng Zien, and the White-Silk Jade Maiden dissolve them. If the departed has transgressed in the jiawu cycle with a thousand sins and ten thousand faults, let the divine general Tianfu, the official Du Chujun, and the Han-Ying Jade Maiden dissolve them. If the departed has transgressed in the jiachen cycle with a thousand sins and ten thousand faults, let the divine general Tianqin, the official Duke Gongsun Tai, and the Prostrate-Essence Jade Maiden dissolve them. If the departed has transgressed in the jiayin cycle with a thousand sins and ten thousand faults, let the divine general Tianxin, the official Xu Junyao, and the Azure Essence Jade Maiden dissolve them.\n\nIn the first month, the Winnowing Basket Star belongs to the Heart Lodge. The three pure and three turbid of the five yin, governed by the Merit Officer, shall no longer afflict the living. In the second month, the Heart Star belongs to the Chamber Lodge. The three pure and three turbid of the five mao, governed by the Grand Impulse, shall no longer afflict the living. In the third month, the Clan Star belongs to the Horn Lodge. The three pure and five turbid of the five chen, governed by Heavenly Rigor, shall no longer afflict the living. In the fourth month, the Chariot Star belongs to the Wings Lodge. The three pure and one turbid of the five si, governed by the Great One, shall no longer afflict the living. In the fifth month, the Spread Star belongs to the Star Lodge. The four pure and five turbid of the five wu, governed by Victory First, shall no longer afflict the living. In the sixth month, the Willow Star belongs to the Well Lodge. The four pure and three turbid of the five wei, governed by Minor Auspice, shall no longer afflict the living. In the seventh month, the Three Stars belong to the Ghost Lodge. The two pure and three turbid of the five shen, governed by Transmission, shall no longer afflict the living. In the eighth month, the Net Lodge belongs to the Encouragement Star. The three pure and five turbid of the five you, governed by Following Chief, shall no longer afflict the living. In the ninth month, the Stomach Lodge belongs to the Straddling Star. The three pure and one turbid of the five xu, governed by River Chief, shall no longer afflict the living. In the tenth month, the Wall Lodge belongs to the House Star. The three pure and two turbid of the five hai, governed by Ascending Light, shall no longer afflict the living. In the eleventh month, the Danger Lodge belongs to the Dipper Star. The seven pure and nine turbid of the five zi, governed by Divine Assistant, shall no longer afflict the living. In the twelfth month, the Woman Star belongs to the Ox Lodge. The three pure and eight turbid of the five chou, governed by Great Auspice, shall no longer afflict the living. The five yielding and five firm, the three yin and five yang, shall no longer afflict the living.\n\nSince the beginning of heaven and earth, the deceased have lived and died. The dead may have committed grievous sins in their past lives, unforgivable transgressions. Cast into the Nine Dark Hells of the Long Night, they suffer for all time—thirst quenched by icy water, hunger fed by iron pellets, fire and smoke forced down their throats. For a thousand kalpas and ten thousand eons, they cycle through the Five Paths, wandering in filth and ash, dragged through the Eight Difficulties, shamed in the Three Disciplines, forever bound to the realm of hungry ghosts, with no hope of escape. Unable to endure such torment, they reach out to the living, draining vitality, bringing a thousand misfortunes—illness in the household, great and small misfortunes, and all manner of afflictions. They claim the house is plagued by malevolent spirits and killing ghosts, that armies march and halt at will.\n\nThe Eastern Malevolent Spirit-King of Ghosts, surnamed Zhang, named Jiaozi. Nine feet and three inches tall, wielding a red staff and black rope, leading a hundred thousand green-clad soldiers. He specializes in inflicting twelve kinds of abdominal pain and green-faced illnesses. The afflicted suffer from eye pain, trembling in the head, neck, and body, constant chills and fever, heavy limbs, inability to eat, and vomiting when they do. His lesser ghost-king, named Zishi, strikes the family of the deceased, their punishment recorded in the Three Offices. The Hearth Lord, enraged, ascends daily to report their sins. The misfortunes of men and women, the twelve seductive worms, the ghosts of mountains, rivers, and earth altars—all unresolved. Drawn together, they come to afflict the living.\n\nThe Southern Malevolent Spirit-King of Ghosts, surnamed Zhu, named Long’an. Leading eighty thousand red-clad soldiers and ten thousand troops. He specializes in inflicting dysentery, sudden headaches, and acute illnesses—some dying in two or three days, others lingering for years. He causes people to vomit blood, their limbs wracked with pain, summoning the ghosts of the Three Mounds, earth altars, and wild places to afflict the living.\n\nThe Western Malevolent Spirit-King of Ghosts, surnamed Shi, named Guzi. Leading a hundred thousand white-clad soldiers and six hundred thousand officials and troops. He specializes in inflicting white dysentery, sudden death, deafness, and swelling—some dying in three, seven, or ten years.\n\nThe Northern Malevolent Spirit-King of Ghosts, surnamed Yang, named Jing.\n\nThe Northern Malevolent Spirit-King of Ghosts, surnamed Yang, named Jing, leads five hundred thousand black-clad soldiers, specializing in inflicting cholera and swelling diseases.\n\nThe Central Malevolent Spirit-King of Ghosts, surnamed Chen, named Rong, leads seven hundred thousand troops, specializing in inflicting water-borne diseases.\n\nThe Southeastern Malevolent Spirit-King of Ghosts, surname missing, named Da, leads nine hundred thousand troops, specializing in inflicting wind-borne diseases.\n\nThe Northwestern Malevolent Spirit-King of Ghosts, surnamed Lin, named Shizi, leads six hundred thousand troops, specializing in inflicting hernia.\n\nThe Three Heavens Ghost-King, surnamed Shi, named Long, leads seventy million, specializing in inflicting swelling diseases.\n\nThe Great Ghost-King of the Nine Heavens, surnamed Yan, leads ten thousand ghosts, specializing in inflicting malignant qi and poisonous diseases that swiftly kill.\n\nAnother Ghost-King, surnamed Shi, named Shou, leads seven hundred thousand troops, specializing in inflicting chills that kill.\n\nAnother Ghost-King, surnamed Zhao, named Ju, leads thirty million troops, specializing in inflicting malaria.\n\nAnother Ghost-King, surnamed Gongsun, named Yue, leads thirty-six thousand ghosts, specializing in inflicting dampness-borne diseases.\n\nAnother Ghost-King, surnamed Cao, named Wenzhi, leads ten thousand ghosts, specializing in inflicting consumptive diseases.\n\nAnother Ghost-King, surnamed Huo, named Xiong, leads seven hundred thousand ghosts, specializing in inflicting thirst diseases.\n\nAnother Ghost-King, surnamed Yuan, named Jing, leads three million six hundred thousand troops, specializing in inflicting shortness of breath.\n\nAnother Ghost-King, surnamed Yi, named Mingzhi, leads seven hundred thousand ghosts, specializing in inflicting cloud-borne diseases that seize infants, causing sudden death.\n\nAnother Ghost-King, surnamed Ji, named Ziao, leads ten thousand ghosts, causing people to die at birth.\n\nAnother Ghost-King, surnamed Guo, named Linzhi, leads thirty million ghosts, causing people to die by blades or in marketplaces.\n\nAnother Ghost-King, surnamed Yang, named Mou, leads ten thousand ghosts, causing people to die in dark prisons.\n\nAnother Ghost-King, surnamed Kong, named Shiming, leads seven hundred thousand ghosts, causing people to die in nightmares.\n\nAnother Ghost-King, surnamed Ren, named Chang, leads thirty-eight thousand ghosts, causing people to die by self-strangulation.\n\nAnother Ghost-King, surnamed Luo, named Qian, leads ten thousand ghosts, causing people to die from red diseases.\n\nAnother Ghost-King, surnamed Yan, named Zhun, leads ten thousand ghosts, specializing in causing women to suffer from breech birth, killing both mother and child.\n\nAnother Ghost-King, surnamed Lu, named Qiang, leads ten million ghosts, specializing in inflicting madness, driving people to drown themselves.\n\nAnother Ghost-King, surnamed Lü, named Fuzhi, leads thirty-nine thousand ghosts, inflicting bewilderment that causes people to die from heart distress.\n\nAnother Ghost-King, surnamed Huangfu, named Anzhi, leads ten thousand ghosts, specializing in inflicting deafness and shortness of breath leading to death.\n\nAnother Ghost-King, surnamed Ding, named Shiqi, leads ten thousand ghosts, seizing people’s fields and silkworms, causing crop failure.\n\nAnother Ghost-King, surnamed Tan, named Daozhi, leads seven hundred thousand ghosts, specializing in inflicting fire qi, burning houses and killing people.\n\nAnother Ghost-King, self-styled Headless Great General, leads ten thousand ghosts, specializing in inflicting heart and abdominal diseases leading to death.\n\nAnother Ghost-King, surnamed Fang, named Chebing, leads thirty million ghosts, specializing in inflicting yin omens.\n\nAnother Ghost-King, surnamed Qiu, named Zhongzi, leads thirty thousand ghosts, specializing in inflicting heat diseases.\n\nAnother Ghost-King, surnamed Mu, named Xuanling, leads ten million ghosts, specializing in inflicting madness.\n\nAnother Ghost-King, surnamed Wen, named Jinzhi, leads ten thousand ghosts, specializing in inflicting throat diseases.\n\nAnother Ghost-King, surnamed Ji, named Bingzhi, leads seven hundred thousand ghosts, specializing in inflicting urinary blockage.\n\nAnother Ghost-King, surnamed Gan, named Qi, leads six hundred thousand ghosts, specializing in inflicting breech birth, killing infants at birth.\n\nSuch Ghost-Kings, along with the spirits of water and fire, the Five Dipper Generals, the Twelve Hour Spirits, the Five Marchmounts’ Mighty Warriors, and the Heavenly Soldiers—totaling two hundred sixty thousand—join with Sima Jizhu, the Cloud Master of Destiny, the Eldest Son of the Underworld, and eight hundred thousand others. Wherever their armies march or halt, they bring chaos to the people, causing endless calamities.\n\nSummoning now the Demon-Heaven’s five million and fifty thousand warriors to descend, they are commanded to restrain these Ghost-Kings, forbidding them to rampage and recklessly slaughter the good and innocent. The Most High shall gather the last generations of the people, and each Ghost-King shall withdraw of its own accord. Should this petition be presented, for the master’s household—seven generations of ancestors and thirty-six generations of forebears—any lingering *qi* of the deceased that remains unresolved, any lingering misfortunes unfulfilled, or any who drag the living into their wake, each shall be curbed by the Green Maiden’s *Shaoshu* writ.\n\nAnother Ghost-King, overseer of the five directions, surnamed Hu, named Ling, leads thirty-nine thousand ghosts, causing people to bear no children, or their children to die at birth. If one’s active year falls in the *zi* branch, those who fall ill on the *zi* day are afflicted by the ghost named Xiang; on the *chou* day, by the ghost named Shiqui; on the *yin* day, by the ghost named Lan; on the *mao* day, by the ghost named Ahu; on the *chen* day, by the ghost named Wenzhi; on the *si* day, by the ghost named Ahuan; on the *wu* day, by the ghost named Shiqiang; on the *wei* day, by the ghost named Zhangnu; on the *shen* day, by the ghost named Xiaodu; on the *you* day, by the ghost named Anhou; on the *xu* day, by the ghost named Adu; on the *hai* day, by the ghost named Wenhou. The ghost of the day itself is named Changzi, leading thirty-six million.\n\nThe great Ghost-King belongs to the Grand Marshal Zhi Xun, who commands seventy million lesser Ghost-Kings. From this day forth, upon hearing the recitation of this petition, all shall be gathered and repelled.\n\nThe Ghost-King of the Nine Provinces, surnamed Ge, named Chuan, leads ten thousand ghosts, killing women. The Qiang Ghost-King, surnamed Hu, named Baifang, leads one ghost, killing people by choking on parrot tongues. The Rong Ghost-King, surnamed [missing], named Cheng, leads thirty thousand ghosts, inflicting *baixia* disease. The Hu-Lu Ghost-King, surnamed Wu, named Xiao, leads ten thousand ghosts, inflicting bewilderment. The Man-Liao Ghost-King, surnamed Lan, named Zhong, leads ten thousand ghosts, inflicting mouth pain. The Mountain Ghost-King, surnamed Qiu, named Wenqing, leads ten thousand ghosts, inflicting chest pain. The Ghost-King of the Ten Directions, surnamed Zhou, named Ju, leads thirty million ghosts, inflicting weak legs. The Water Spirit Ghost-King, surnamed Meng, named Ben, leads ten thousand ghosts, inflicting blindness. The Ghost-King of the Five Marchmounts, surnamed Yang, named Guanglong, leads seven hundred thousand ghosts, inflicting gluttony and causing sleep sickness.\n\nAll such Ghost-Kings, leading their ghosts to roam among people, lie in wait for human decline to plot harm against the living. Today, upon the presentation of this petition, let the spirits of mountains, rivers, forests, and marshes, the village shrines of the world, and all perverse ghosts and malevolent deities be scattered and routed, collapsing like sand or shattering like tiles, dissolving in accordance with this writ. Let the master’s household recover from illness, and let the ten thousand spirits come to their aid. Should any of the master’s kin or in-laws be imprisoned or exiled, let them all be released.\n\nThe Eastern Directing Talisman’s great ghost is named Qingcao, leading seventy million ghosts, specializing in inflicting lower back pain. Another Ghost-King, surnamed Qiang, named Dang, leads twenty-eight million ghosts, specializing in inflicting qi depletion, incessant bloody flux, and dribbling urine. Another Ghost-King, surnamed Yuan, named Wenxuan, leads seventy million ghosts, specializing in inflicting soul-loss death, rendering the afflicted beyond aid. Another Ghost-King, surnamed Xu, named Jing, leads seventy-eight thousand ghosts, specializing in inflicting loss of spirit. Another Ghost-King, surnamed Le, named Yu, leads six hundred thousand ghosts, specializing in inflicting tumors and swellings. Another Ghost-King, surnamed Rong, named Qi, leads eleven thousand ghosts, specializing in inflicting heart confusion. Another Ghost-King, surnamed Cui, named Shishan, leads thirty thousand ghosts, specializing in inflicting genital swelling and bloody flux. Another Ghost-King, surnamed Ma, named Xiang, leads thirty-seven thousand ghosts, specializing in inciting people to kill parents, teachers, and disciples, to burn people’s grain, wheat, houses, and altars, and to afflict people with incurable diseases, entering their hearts to drive them to such acts.\n\nAnother Ghost-King, surnamed Wu, named Ban, leads three thousand ghosts, specializing in inflicting red and yellow bloody flux. Another Ghost-King, surnamed Ming, named Changsheng, leads twelve thousand ghosts, specializing in inflicting mutual hatred between husband and wife. Another Ghost-King, surnamed Xie, named Langzhi, leads six hundred thousand ghosts, specializing in inflicting mutual aversion between men and women. Another Ghost-King, surnamed Xie, named Mingzhi, leads fifty thousand ghosts, specializing in inflicting cleft-lip children. Another Ghost-King, surnamed Lan, named Jinzhi, leads seventy thousand ghosts, specializing in inflicting rebellious children and frequent internal strife. Another Ghost-King, surnamed Tang, named Lu, leads thirty thousand ghosts, specializing in inflicting malign *qi* disease.\n\nSuch Ghost-Kings, along with the Five Directions’ *zhu* ghosts—eastern blue *zhu*, southern red *zhu*, western white *zhu*, northern black *zhu*, and central yellow *zhu*—the *zhu* of those who die at dawn, the *zhu* of those who die at dusk; the *zhu* of one *li*, two *li*, three *li*, four *li*, five *li*, ten *li*, twenty *li*, thirty *li*, forty *li*, fifty *li*, a hundred *li*, two hundred *li*, three hundred *li*, four hundred *li*, five hundred *li*, six hundred *li*, seven hundred *li*, eight hundred *li*, nine hundred *li*, a thousand *li*, ten thousand *li*; the *zhu* of men, the *zhu* of women, the *zhu* of servants and maids, near *zhu* and far *zhu*; blue *zhu*, white *zhu*, red *zhu*, black *zhu*, yellow *zhu*, the Five *Zhu* Generals; great *zhu* and small *zhu*, high *zhu* and low *zhu*; the *zhu* of the six livestock, the *zhu* of birds and beasts, the *zhu* of grasses and trees.\n\nThe *zhu* of the sun and moon, the *zhu* of the stars and constellations. The *zhu* of the Rong and Qiang, the *zhu* of the Hu and barbarian captives. The *zhu* of Wu and Shu, the *zhu* of the Yi and Di, the *zhu* of the Man and Liao. The *zhu* of thirty-seven thousand, the *zhu* of omens and portents, the *zhu* of gates and households. The *zhu* of the sun’s wandering, the *zhu* of the moon’s passage. The *zhu* of the Great General, the *zhu* of Tai Sui, the *zhu* of Tai Yin. The *zhu* of the Five Phases, the *zhu* of the four seasons’ transitions. The *zhu* of funeral carts and the Dipper’s conjunction, the *zhu* of death’s sequence. The *zhu* of the year’s fate, one’s original destiny, the three punishments, and the red affliction; the *zhu* of male and female. The *zhu* of names that seize one another, the *zhu* of eyes and colors that correspond, the *zhu* of surnames that mutually claim one another.\n\nWhen *zhu* comes from the east, sever it with metal. When *zhu* comes from the south, extinguish it with water. When *zhu* comes from the north, repel it with earth. When *zhu* comes from the west, dissolve it with fire. When *zhu* comes from the center, exorcise it with wood. The *zhu* of the Five Phases, each in its proper position, will naturally cease and vanish.\n\nIf there is an ominous black qi in the east, I humbly invoke the Nine Billion and Nine Million Soldiers of the Azure Emperor Lord, leading seventy myriad azure troops, to exorcise and dissolve it. When *zhu* comes from the south, I humbly invoke the Eight Hundred Thousand Soldiers of the Vermilion Emperor Lord, leading seventy myriad vermilion troops, to dissolve and repel it. When *zhu* comes from the west, I humbly invoke the Six Hundred Thousand Soldiers of the White Emperor Lord, leading ninety myriad and ten thousand white troops, to dissolve and repel it. When *zhu* comes from the north, I humbly invoke the Five Hundred Thousand Soldiers of the Black Emperor Great General, leading seventy myriad black troops, to come and exorcise and repel it. When *zhu* comes from the center, I humbly invoke the One Hundred Twenty Thousand Soldiers of the Yellow Emperor Lord, leading seventy myriad yellow troops, to descend and sever it.\n\nShould the pestilential afflictions of the five directions, the Yellow Slave Brothers seventy-two in number, and the plague-bearing ghosts ride the wind and mount the sparrows, entering the homes of men to await their moments of weakness and seize their young, may all be gathered, severed, and banished ten thousand *li* away. Moreover, the *zhu* ghosts of the five directions, styling themselves Meng Tian, Chi Jing, Ji Liang, and Wang Zu, each leading a thousand men, enter homes to seize the young, bringing malarial fevers. Also, the malevolent ghosts of the five directions, calling themselves Wu Emperor, Han King, Wu Zixu, Duke of Zhou, and Great Ministers, specialize in causing abdominal distension. Further, *zhu* ghosts styling themselves ancient great kings and lords of the world’s great generals come to sicken and deceive men, falsely claiming kinship as elders, slaying the young, and filling homes with misfortune, illness, and calamity.\n\nThere is also a ghost king surnamed Yan, named Gaozi, who leads thirty thousand men to spread madness and wailing sickness. The *zhu* ghosts of the Five Emperors of the five directions, calling themselves Zhang Yuanbo, lead ten thousand ghosts to spread chills, fevers, and perverse malarial afflictions. The *zhu* ghosts of the five directions, styling themselves Jiao Dan and the Innocent Yang, lead three thousand ghosts to slay children. Another of the five directions’ killing ghosts, calling himself Liu Yuanda, leads seven hundred myriad ghosts to perpetrate seventy kinds of epidemics. Another ghost king, calling himself Zhong Shiji, leads six hundred myriad ghosts to cause five kinds of dysentery. Another ghost king, calling himself Zhao Gongming, leads thirty thousand ghosts to cause axe wounds in homes. Another ghost king, calling himself Shi Wenye, leads seventy-two myriad ghosts to cause death by swelling and qi. Another ghost king, surnamed Du and named Zhou, leads seventy myriad ghosts to preside over prison deaths. Another ghost king, surnamed Zong and named Wenhou, leads three thousand six hundred ghosts to cause fires. Another ghost king, calling himself Wu Wang Ghost, leads ten million ghosts to cause drowning deaths. Another ghost king, calling himself Tian Dao, leads seventy myriad ghosts to cause death by longing. Another ghost king, calling himself Wang Qian, Bai Qi, and Deng Ai’s ghosts, leads thirty thousand ghosts to spread myriad illnesses and kill men.\n\nThere is yet another ghost king, claiming to be the Great Spirit of the August Emperor, who enters homes to drive out household ghosts, demanding blood sacrifices, along with the ghosts of omens and portents, hunting and communal sacrifices, and the spirits of those who come seeking. I further invoke the Qiungqi, devourers of ghosts, seven hundred myriad in number, to descend together in succession and consume them, allowing none to escape.\n\nMoreover, I, [Name], of high and low station in this household, declare: in this life’s encounter, I have been numbered among the Dao’s followers, yet I have failed to respond with devotion to the Dao, and my offenses have not been sufficiently prolonged. My household is not harmonious. Now, afflicted by illness and distress, I fear I cannot escape. I have heard that the great Dao succors all things; none who surrender themselves to it fail to receive its grace. Yet my original master is distant, and my pleas cannot reach him. Seeing that I share the same dharma as you, I hasten to welcome you to my home, beseeching a written petition to save and cure myself.\n\nTo you, who hold office and bear the beauty of the dharma’s qi, I declare my inability to fully proclaim the dharma’s power as I witness the calamities and distress of this household. With trepidation, I prostrate myself and humbly submit this petition, one document addressed to the Heavenly Courts, along with offerings to the Five Emperors. I beg the Most High Lord Lao, the Most High Elder, the Celestial Master, the Lineage Masters, the Three Masters, the Lady of the Gate, the Twenty-Four Worthies, the Twelve Perfected Saints, the Compassionate Father and Holy Mother, and the Lords of Qi, to bestow the Dao’s qi upon this household, to cover and clothe us in its grace.\n\nI respectfully follow the Celestial Master’s *One Thousand Two Hundred Officials’ Petition Text* to invoke the One Hundred Twenty Thousand Soldiers of the Five Canopies Great Generals of the Void, along with two thousand officials and generals. I further invoke the One Hundred Twenty Thousand Soldiers of the Five Divisions’ Great Generals, and the One Hundred Twenty Thousand Soldiers of the Vigorous and Stalwart Great Generals, along with one thousand two hundred officials and generals.\n\nI further invoke the Seven Hundred Thousand Soldiers of the Central Palace of the Vermilion Heaven, the Great Army of the Southern Encampment, the Vermilion Soldiers of Bingzi, and the Valiant and Stalwart Officers and Soldiers. May they descend to this household to seize and eradicate any malevolent qi or possessing spirits from the Five Directions, severing their roots and lineages.\n\nI also invoke the One Hundred Twenty Thousand Soldiers of the Lord of Balanced Qi, along with one thousand two hundred officials and generals, together with the Six Hundred Million Officers of Qi-Seizing and Qi-Consuming, Ghost-Seizing and Ghost-Consuming, Evil-Seizing and Evil-Consuming, Ominous-Seizing and Ominous-Consuming, and Sickness-Seizing and Sickness-Consuming, all to descend as one and arrive above this household to seize and consume them. Should there be any malevolent demons or evil ghosts, may they be utterly swept away and annihilated.\n\nI further invoke the Nine Hundred Thousand Soldiers of the Eastern Garrison Great General to encamp at the eastern gate of this household. I invoke the Eight Hundred Thousand Soldiers of the Southern Garrison Great General to encamp at the southern gate. I invoke the Six Hundred Thousand Soldiers of the Western Garrison Great General to encamp at the western gate. I invoke the Five Hundred Thousand Soldiers of the Northern Garrison Great General to encamp at the northern gate. I invoke the One Hundred Twenty Thousand Soldiers of the Central Garrison Great General to encamp in the central courtyard.\n\nI also invoke the Seventy Million Myriad Hosts of the Ghost-Consuming Officers of Qiongqi to descend as one and consume the Five Crones and Fengqi Ghosts within this household. Should there be the Five Contract Generals—the Front Hunting General, Rear Hunting General, Left Hunting General, Right Hunting General—along with Fengqi Lady, the Five Contract Parents, Male and Female Contracts, Child and Grandchild Contracts, and the Five Thousand Six Hundred Contract Officials, all conspiring to assemble and plot harm against the master and household, may they all be driven out and banished ten thousand leagues away, shattered like crumbling sand and collapsing tiles.\n\nI earnestly invoke the One Hundred Twenty Thousand Soldiers of the Immortal Officials and Generals, along with one thousand two hundred officials and generals, to seize and repel all ghosts in the world who claim the titles of the Five Wilds and Six Poisons, and the One Hundred Twenty Ominous Howling Spirits, sweeping them from this dwelling and utterly annihilating them.\n\nI further invoke the One Hundred Twenty Thousand Soldiers of the True Heaven Great General, along with one thousand two hundred officials and generals, to descend upon this household and seize and expel all ghosts falsely claiming ominous titles, banishing them ten thousand leagues away.\n\nI also invoke the One Hundred Twenty Thousand Soldiers of the Lord of the White Chariot and White Horse in the Most High Palace, along with one thousand two hundred officials, and the Seven Hundred Twenty Thousand Encamped Troops, to seize and slay all malevolent and murderous ghosts from the Four Directions.\n\nI further invoke the Seventy Million Soldiers of the Nine Provinces’ Inspectors and the Son of Heaven’s Supervisors, each to encamp within the gates of this household, to seize and slay all malevolent possessing spirits from the Five Directions that initiate harm, utterly eradicating them.\n\nI also invoke the Eight Hundred Thousand Soldiers of the Lord of Heaven-Shaking Earth-Quaking in the Supreme Heaven’s Qian Palace to descend as one and arrive above this household, to seize and slay all encamped ghosts and the malevolent qi of the Five Directions’ possessing spirits, utterly repelling them.\n\nI further invoke the Seven Hundred Eighty Thousand Soldiers of the Great Drum of Lofty Demons and the Red Yang Troops of the Five Hu Generals to descend as one and arrive within this household, to seize and eradicate all encamped calamity-possessing ghosts, the hundred evil ghosts and bandits, and the ghosts of monsters and specters, utterly slaying them.\n\nI also invoke the One Hundred Twenty Thousand Soldiers of the Ghost-Slaying Great General, along with one thousand two hundred officials and generals, to descend as one and arrive above this household, to seize, slay, and disperse all ghosts causing illness, utterly shattering and banishing them.\n\nI further invoke the Seven Hundred Thousand Soldiers of the Iron-Faced Ghost-Consuming Cavalry, the Winged Serpent and White Tiger Cavalry, and the Driving-Out Great General to descend as one and arrive above this household, to seize the Five Ailment-Encamped Ghosts, the myriad evil and deceased spirits haunting this dwelling, and all banished ghosts, utterly crushing and annihilating them.\n\nI also invoke the One Hundred Twenty Thousand Soldiers of the Lofty Heaven’s Ten-Thousand-Fathom Great Ghost and the King of a Hundred Ghosts, along with seven hundred thousand officials and generals, to descend as one and arrive above this household, to seize and repel all encamped ghosts, the Yellow Slave and Pestilence Ghost Bandits, utterly seizing and banishing them.\n\nI further invoke the Two Thousand Two Hundred Lords of Life-Prolonging and Calamity-Averting, and the Two Thousand Two Hundred Lords of Substitution and Replacement, to descend as one and arrive above this household, to substitute and prolong the life of the afflicted, averting calamity. May the perils of the Five Directions all be transcended, extending years and increasing longevity, passing through disasters and averting calamities, preserving life without end.\n\nI also invoke the Fifteen Attendants of Healing Merit, the Celestial Physicians and Grand Physicians, the Officers of Medicine, Master Lu, Bian Que, the Jade Maidens, each one thousand two hundred in number, to descend as one, bearing efficacious prescriptions, divine decoctions, sacred pills, and the tools of acupuncture and moxibustion, entering the body of the afflicted to circulate life and distribute qi. Where needles are fitting, let needles be applied; where moxibustion is fitting, let moxibustion be given; where decoctions are fitting, let decoctions be administered; where pills are fitting, let pills be bestowed. According to the location of the illness, may they devote themselves to healing and protection, ensuring complete recovery. May the Five Viscera be harmonized, the Hundred Vessels flow freely, the hun-soul be settled, the po-soul be stabilized, and the myriad spirits stand guard.\n\nShould there be deafness or blindness, I invoke the Twelve Lords of Bright Vision, along with one hundred twenty officials and generals, to descend as one and attend to the healing of deafness and blindness, restoring clarity and brightness, sharp hearing and keen sight.\n\nI further invoke the Seven Hundred Thousand Soldiers of the Heavenly Valiant General and the Ghost-Slaying Officers, along with the Seven Hundred Thousand Tiger-Rushing Officers, each wielding ghost-slaying axes and halberds, peach decoctions, and sand and stones, to descend as one and enter this household, driving out the malevolent possessions of the Five Directions, the Five Ailment evil spirits, specters and monsters, lingering deceased qi, household obstructions, malevolent gods, and evil ghosts, utterly executing and slaying them, severing their roots and lineages.\n\nShould the seven generations of ancestors—parents, uncles, and departed kin of this household—have committed, in life, the Five Oaths and Seven Curses, the Five Heinous Crimes, acts of unfiliality and unkindness, or the murder of the virtuous; or engaged in banditry, plundering people and property; or stolen oxen and horses, abducted servants and maids; or bound and deceived the good, selling the innocent into servitude—\n\nOr slain others’ fathers and mothers, husbands and wives, sons and daughters; or harmed others’ masters, extinguishing their lineages; or stolen scriptures, defamed the true and upright, defiled sacred texts, betrayed the Dao to embrace heterodoxy, forsaking truth for falsehood.\n\nOr uttered vicious curses, groundlessly slandered, or recklessly slighted gods and spirits with idle speech; or beneath the sun, moon, and stars, within village altars, talismanic shrines, or sacred precincts, or beneath trees, in the wilds, or by wells and hearths, jointly performed binding prayers.\n\nOr in Daoist or Buddhist halls of healing, burned incense and swore oaths, invoking Heaven and Earth, pleading before the gods, claiming grievance or righteousness, forgetting gratitude for favor, and failing to requite the gods. After death, they sink into the Three Wretched Realms, enduring interrogation. The deceased, bitter and distressed, unable to extricate themselves, lodge complaints in the celestial courts, dragging the living into their suits.\n\nThe ghosts of three-case and five-case judgments, the curses of myriad evils and the hundred gods, together invade the household, ceaselessly wreaking havoc. We beseech that, following this memorial, each be dissolved and eradicated, that no longer may baleful infesting ghosts or wayward spirits recklessly cause harm.\n\nShould any of the thirty-six generations of the deceased stubbornly persist, we pray the Twelve Lords of the Five Directions’ Release, with their one hundred twenty officials, descend as one to resolve for this household all interrogations of curses and binding prayers from former lives, thoroughly pacifying and dispersing them, that they may no longer harm the living.\n\nIf any resist and refuse to depart, we pray the Lord of Execution and his one thousand two hundred officials descend as one to this household, seizing and expelling the lingering deceased qi, malevolent gods, evil ghosts, and all manner of spirits, driving them into the wild mountains, allowing no lingering.\n\nShould any act with violence, we beseech that, following the submission of this oral memorial, the afflicted swiftly recover, the household remain free of misfortune, wealth and treasure flow in, blessings and prosperity daily increase, all wishes be fulfilled, and every direction yield compliance.\n\nFor all the lords, generals, officers, and soldiers who have rendered service in capturing and aiding, we shall, on the three auspicious days of the triennial assembly, submit a comprehensive memorial detailing their merits and recommending promotions, sparing no effort to honor our vows.\n\nWith gratitude, we implore the Most High to discern and heed our plea. Your humble servant, in reverence, respectfully entrusts this to the Inner and Outer Officials, the Direct Envoys of the Orthodox Unity, the Merit Registrars, the Left and Right Envoys, the Yin-Yang Decree Officers, the Chariot of Scarlet Talisman Officers, the Officers of the Rushing Wind Couriers, and the Memorial-Mounted Steeds Officers—one hundred twenty each—to carry out the task.\n\nYour servants, in utmost sincerity, on behalf of the living man or woman of such-and-such household, whose parents, siblings, spouse, and children suffer misfortune, whose illnesses of such-and-such nature are grave, whose life hangs in peril, and who fears for survival, humbly invoke the Celestial Officials to dissolve the qi of curses and binding prayers from thirty-six generations past, to disperse baleful infestations, sever all lingering ties, restrain and admonish demon-kings, capture ghosts to treat illness, and substitute for life to seek deliverance.\n\nWe submit this urgent oral memorial, one copy, to the Three Celestial Courts of the Most High, awaiting your decree. Your servant, with trepidation and awe, bows his head to the ground, prostrates himself, and respectfully submits this for your attention. Your servant, of such-and-such surname, from such-and-such prefecture and county.\n\nIn accordance with the rites of the Grand Clarity,\n\nOn the day and hour of such-and-such month in the year of the Great Year [Tai Sui], at the altar of so-and-so,\n\nYour servants, so-and-so and others, respectfully submit this solemn memorial:\n\nTo the Most High Lord of the Great Dao, the Most High Elder, the Celestial Masters, the Female Masters, the Lineage Masters, the Succession Masters, and the Lady of the Three Masters.\n\nYour servants have already presented the memorial and concluded the petition. We now humbly request that the thirty-six officers on duty at this hour, the thirty-six officers on duty today, the thirty-six officers on duty this month, the thirty-six officers on duty this year, the thirty-six officers on duty under the Five Emperors, the thirty-six officers on duty in the Four Seasons, the twelve Golden Radiance Lads and Jade Maidens, the twelve Messengers of the Memorial, the twelve Attendants of the Memorial, and the twelve Scribes of the Day—all assemble and descend.\n\nTogether with the Lords of the Land to the left of the altar and the right of the sacred altar, they shall accompany the memorial upward and ensure its delivery to the plain-clad men and women of the Celestial Courts, guaranteeing its unimpeded transmission.\n\nShould the text of the memorial be improperly written, stained, or misaligned, let it be corrected with the Dragon-Head Writing Knife and the long-haired, sharp-tipped brush, amending errors, filling omissions, and ensuring its perfect conformity, so that no official in the upper courts may reject or return it.\n\nShould any subordinate officials, baleful qi, demonic spirits, or ghostly bandits intercept or obstruct the memorial along its path, let them be seized and delivered to the nearest prison, to be punished according to the law.\n\nWe entreat that this oral memorial, submitted by your servants, proceed directly to the presence of the Most High Lord of the Limitless Dao, the Most Venerable Lord Lao.\n\nLet the Left Lord pass through the gates, the Right Lord ascend the steps, and all officials transmit it in proper sequence, each according to their rank.\n\nYour servants, being of humble and unenlightened minds, fear that we may have violated the statutes or failed in the rites of reverence. We humbly beseech the boundless grace of the Most High to pardon each and every transgression.\n\nShould there be malicious persons on all sides who recklessly scheme or slander, let all such be averted and dispelled.\n\nWe pray that what is submitted be heard above, what is requested be granted below, what is summoned arrive, what is transformed be transformed, what is treated be healed, what is condemned be destroyed, what is suppressed be subdued, what is dissolved be dispersed, and what is released be freed.\n\nLet the Merit Officers and Messengers distinguish the urgent from the routine, ascend without delay, and take care not to linger.\n\nYour servants prostrate themselves upon the earth, awaiting your decree. We shall hold our breath as if for three meals.\n\nThe submission of this oral memorial is now concluded. Next, we present it to the officials.\n\nThe aforementioned emissaries now dispatched—your servants’ inner Merit Officers, Messengers, Generals, and attendant hosts—shall each return to their stations within your servants’ bodies. All shall pass through the Gates of Myriad Wonders, reentering in proper sequence. The Directing Messenger and Chief Attendant shall take their places: those on the left return to the left, those on the right to the right. They shall coil about the bones, weave through the hundred vessels, encircle the entire body, and encompass heaven and earth. Descending, they enter the Cinnabar Field; ascending, they rise to the Mud-Pill Palace, adhering fast within your servants’ bodies. The five viscera and six bowels, the Seven Governors and Nine Palaces, the Twelve Chambers, the Four Seasons and Five Phases, the hundred-and-eighty joints and mechanisms—all shall resume their hidden offices, arrayed in their proper positions, without confusion or disorder.\n\nThe Generals and attendant hosts previously summoned shall each return to your servants’ bodies, entering the Golden Hall and Jade Chamber. When your servants later issue the call, they shall emerge again, performing their duties as before.\n\nNext, the Incense Officers and Messengers are summoned to invoke the Dragon and Tiger Lords at your servants’ left and right, and to urgently call forth the Messengers of the Five Directions. Your servants’ oral memorial is now concluded.\n\nMay the stillness of this chamber spontaneously generate golden liquid, cinnabar, and azure mushroom blossoms before this incense flame. May your servants attain the true qi of the Dao, thereby achieving long life and transcending mortality. May all people ascend as immortals. May your servants’ names be stricken from the registers of death and inscribed anew in the ledgers of life. May the white-clad men and women, the jade youths, and the boy and girl attendants all guard the incense smoke, so that what your servants have presented may proceed directly to the throne of the Most High, Utmost, and Boundless Dao—the Perfected Jade Sovereign of the Three Heavens.\n\nThe oral memorial for healing through the incantations of the *Highest Clarity’s Divine and Abyssal Dao* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞神洞渊神咒治病口章 经名：太上洞神洞渊神咒治病口章。 撰人不详。 一卷。 底本出处：《正统道藏》正一部。 太上洞神洞渊神咒治病口章 呜天鼓三通发炉 太上玄元五灵老君，三炁正神，急召臣等身中：五体真官，三五功曹，上下大夫，左右龙虎君，捧香使者，传言素女，执案童子，各二十四人。 尚书仆射，通事小吏，十二万人。 关启无上三天玄元大道君，十方太上。 臣等正尔入靖，烧香奏上口章，治病消灾，愿得八方正炁入臣身中，令所启上御，径达无上玉皇上帝几前。 次四方拜，西方始，讫向东，鸣天鼓三十六通。 次长跪出吏兵 谨出臣等身中：仙灵高官，直使功曹，各十二万人。 正一功曹，十二万人。 三一功曹，十二万人。 促气功曹，十二万人。 治病功曹，十二万人。 太医小吏，十二万人。 上部功曹，十二万人。 中部功曹，十二万人。 下部功曹，十二万人。 上部使者，十二万人。 中部使者，十二万人。 下部使者，十二万人。 高车使者，十二万人。 赤车使者，十二万人。 元真使者，十二万人。 元神使者，十二万人。 阳神使者，十二万人。 阴神使者，十二万人。 高车刺史，二十四万人。 收气食气吏，收鬼食鬼吏，收邪食邪吏，收凶食凶吏，收精食精吏，收殃食殃吏，收病食病吏，各六十万人。 太上治病玉女，十方主者，各七十万人。 出出者，严装显服，冠带垂缨，整其威仪，罗列卤簿，上下相次，森然住立。 臣等前后左右，各各兵刀外向，整顿刀杖，千人齐唱，万人同和。 去臣等三步，自共相顾，望直使功曹，头戴通天之冠，身着皂执单衣，腰带龙虎之符，手捉金刚之戟，各七十二万人。 在臣等前，正一功曹，头戴朱阳之帻，身着绛章单衣，腰带通天之矛，手捉夜光之剑，各七十八万人。 在臣等之后，冲天大将军，头戴五色之冠，身,着锦炼之袍，腰带百炼之刀，手捉九折之刃，各四十万人。 在臣等左，横奋大将军，头戴玄阴赤帻，身着七玉黑衣，腰带百炼黑戟，各九十万人。 在臣等之右，功曹在上，主簿在下，天官在左，地官在右，文官在前，武官在后。 五色之幢，威仪翼翼。 乘车驾马，龙虎之骑。 步行乘舆，各各相次。 青队在东，白队在西，赤队在南，黑队在北，黄队在中央。 步楯在前，细射在后。 贼曹在左，禁防在右。 槌锺呜角，隐隐阗阗。 五岳军马，伺候巷陌。 四海军马，罗截九州。 昆仑玉京，军马骇满。 虚空各各，内外相应。 将领诸鬼王，令勅魔兵，各各令杀鬼。 今某郡县乡里，男女某甲辞列。 昔日百官子孙，习俗常人。 千载之运，得在道门。 末民之例，奉属大道，私自欣慰蒙恩。 某口辞奉神不明，多有考气，招延不祥。 自顷以来，家业不利，宅中凶耗，万端不吉，灾祟云云。 又某身，若干月日，忽得疾病，状云云，虑不育活。 盖闻夫道，能回死易生。 归命之者，无溺不济。 章奏通达，无往不救。 恩在太上，事由主者。 臣等凡愚，事在宣扬三洞之旨，不忍所见煎厄之急。 大小元元向，臣等叩头搏颊，告诉丹赤，求乞救济。 臣等不胜所见，肉人穷命转烛，专至可愍。 辄为伏地，拜口章一通，露在臣等前玉案上。 如前人口章留辞，事事上启。 不敢越诀，多有所语。",
      "translated_text": "**The Supreme Cavernous Divine and Abyssal Divine Incantations for Healing Illnesses – Oral Petition Chapter**\n\n**Title:** *The Supreme Cavernous Divine and Abyssal Divine Incantations for Healing Illnesses – Oral Petition Chapter*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\n**The Supreme Cavernous Divine and Abyssal Divine Incantations for Healing Illnesses – Oral Petition Chapter**\n\nSound the celestial drum thrice to open the incense burner.\n\nSupreme Mysterious Origin, Five Numinous Venerable Lord, Three *Qi* Orthodox Deities—hasten to summon within us, your servants: the True Officials of the Five Corporeal Forms, the Three-and-Five Merit Officers, the Upper and Lower Grand Masters, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Envoys, the Message-Transmitting Celestial Maidens, and the Document-Holding Lads—twenty-four each.\n\nThe Ministers and Vice Ministers, the Messengers and Lesser Clerks—one hundred twenty thousand.\n\nWe hereby report to the Supreme Three Heavens’ Mysterious Origin Great Dao Lord and the Ten Directions’ Supreme Ones.\n\nAs we now enter the oratory and burn incense to present this oral petition, we pray for healing and disaster dispelling, that the Eight Directions’ Orthodox *Qi* may enter our bodies, allowing our supplications to ascend directly before the Jade Emperor’s throne.\n\nNext, bow to the four directions, beginning in the west and ending in the east, sounding the celestial drum thirty-six times.\n\nThen, kneel to dispatch the officers and soldiers:\n\nFrom within us, your servants, we reverently send forth:\n- The Transcendent Numinous High Officials and Direct Merit Officers—one hundred twenty thousand each.\n- The Orthodox Unity Merit Officers—one hundred twenty thousand.\n- The Three-in-One Merit Officers—one hundred twenty thousand.\n- The *Qi*-Hastening Merit Officers—one hundred twenty thousand.\n- The Illness-Healing Merit Officers—one hundred twenty thousand.\n- The Lesser Physician Clerks—one hundred twenty thousand.\n- The Upper, Middle, and Lower Section Merit Officers—one hundred twenty thousand each.\n- The Upper, Middle, and Lower Section Envoys—one hundred twenty thousand each.\n- The High Chariot Envoys—one hundred twenty thousand.\n- The Crimson Chariot Envoys—one hundred twenty thousand.\n- The Primordial True Envoys—one hundred twenty thousand.\n- The Primordial Spirit Envoys—one hundred twenty thousand.\n- The Yang Spirit Envoys—one hundred twenty thousand.\n- The Yin Spirit Envoys—one hundred twenty thousand.\n- The High Chariot Governors—two hundred forty thousand.\n- The *Qi*-Seizing and *Qi*-Consuming Clerks, Ghost-Seizing and Ghost-Consuming Clerks, Malevolence-Seizing and Malevolence-Consuming Clerks, Calamity-Seizing and Calamity-Consuming Clerks, Essence-Seizing and Essence-Consuming Clerks, Misfortune-Seizing and Misfortune-Consuming Clerks, Illness-Seizing and Illness-Consuming Clerks—six hundred thousand each.\n- The Supreme Healing Jade Maidens and the Ten Directions’ Overseers—seven hundred thousand each.\n\nLet all who emerge don their solemn attire, crowns and pendants, and arrange their majestic regalia. Let them array their processional insignia, rank upon rank, standing in solemn formation.\n\nBefore, behind, left, and right of us, your servants, let each wield blades outward, ordering weapons and staves. Let a thousand voices chant in unison, ten thousand in harmony.\n\nThree paces from us, let them regard one another, awaiting the Direct Merit Officers—each wearing a Heaven-Reaching Crown, clad in black single robes, girded with Dragon-Tiger Talismans, and wielding Vajra Halberds—seven hundred twenty thousand.\n\nBefore us, the Orthodox Unity Merit Officers—each wearing a Vermilion Yang Headband, clad in crimson ceremonial robes, girded with Heaven-Reaching Spears, and wielding Luminous Swords—seven hundred eighty thousand.\n\nBehind us, the Soaring Heaven Great Generals—each wearing a Five-Colored Crown, clad in brocade armor, girded with Hundred-Forged Blades, and wielding Nine-Bend Blades—four hundred thousand.\n\nTo our left, the Fierce Horizontal Great Generals—each wearing a Dark Yin Crimson Headband, clad in Seven-Jade Black Robes, and girded with Hundred-Forged Black Halberds—nine hundred thousand.\n\nTo our right, the Merit Officers above, the Registrars below, the Heavenly Officials to the left, the Earthly Officials to the right, the Civil Officials before, and the Martial Officials behind.\n\nThe Five-Colored Banners flutter in majestic order. They ride chariots and mount steeds, dragon and tiger cavalry. Those on foot and in palanquins proceed in ranks.\n\nThe Azure Hosts in the east, the White Hosts in the west, the Crimson Hosts in the south, the Black Hosts in the north, and the Yellow Hosts at the center.\n\nThe shield-bearers advance, the archers follow. The Bandit Officers to the left, the Guardians to the right. Drums and bells resound, horns echo—deep and thunderous.\n\nThe Five Marchmounts’ armies patrol the streets. The Four Seas’ armies blockade the nine provinces. The armies of Kunlun’s Jade Capital overflow. The voids within and without respond in unison.\n\nCommand the various Ghost Kings to order the demonic soldiers, each to slay the ghosts.\n\nNow, from [so-and-so] prefecture, county, village, and household, [so-and-so] man or woman petitions:\n\nDescendants of ancient officials, common folk by custom, we have, through a thousand years’ fate, entered the Daoist gate. As latter-day followers, we submit to the Great Dao, privately rejoicing in its grace.\n\nYet, through unclear devotion, we have incurred *qi*-afflictions and attracted misfortune. Of late, our households suffer ill fortune, our dwellings harbor calamities—ten thousand miseries, countless disasters.\n\nMoreover, [so-and-so] has, for [so many] months and days, suddenly fallen ill, with symptoms [as described], fearing survival is unlikely.\n\nWe have heard that the Dao can reverse death and restore life. Those who surrender to it are never left unaided. Petitions that reach the throne are never unanswered. The grace lies with the Supreme Ones; the matter rests with the Overseers.\n\nWe, your foolish servants, uphold the Three Caverns’ decrees, unable to bear the urgency of the suffering before us. Great and small, high and low—we kowtow, beat our cheeks, and plead in earnest, seeking deliverance.\n\nUnable to endure the sight of this mortal’s desperate plight, like a candle in the wind, we prostrate ourselves, presenting this oral petition once, laid upon the jade table before us.\n\nAs the petitioner’s words are recorded, we humbly submit each matter. We dare not transgress the rites, though much remains to be said.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1222,
      "start_sentence": 0,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.76693344116211,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "唯愿今日直符执案主者，导候令使，左右宣直，官治从事，上下素女功曹，与左社右稷，擎案主簿，各七十万人。 与章俱上，对应天曹。 令事事判决，文书传达，了了分明。 功曹小吏，一合来下，听省臣等口奏章言。 须事讫，各各还宫室，复位如初。 吏兵交关，天曹必令。 事事判了，勿使稽停。 停者，吏兵先坐。 时为通达，令道炁下流，覆衣肉人。 令病者速差，差者吏兵有功。 言功天曹，加爵迁秩。 各各相告。 下上官天地之中，所病人之鬼，一一收而却之。 令病得愈，医治玉女。 事事按行，随病布药。 令下检校，随病状治之，了了得差，差各有功赏。 万等不合，有恚恨治病之官吏兵，各宝针药之具，与卢医扁鹊，领天下医王与治病功曹三百六十人，主生小吏二十四万人，祈请玉童七十万人。 一一来下，应章罗载。 急令得差，平复能行。",
      "translated_text": "May it be that today, the Direct Talismanic Envoys who hold the case, the Overseers, the Guiding Attendants, the Left and Right Announcers, the officials in charge of affairs, the Upper and Lower Plain Women, the Merit Scribes, the Left Millet and Right Sacrificial Officers, and the Case-Holding Clerks—seven hundred thousand each—ascend together with this petition, facing the Celestial Courts, that every matter may be judged and decided, every document transmitted and delivered, all clearly and distinctly.\n\nMay the Merit Scribes and minor clerks, once assembled, descend to heed the oral petition of your servants. When the matters are concluded, may each return to their palaces and resume their positions as before. Let the exchange of officers and soldiers be commanded by the Celestial Courts. May every matter be judged without delay; let no stagnation occur. Those who cause delay shall be the first to face punishment.\n\nMay the timing be opportune for transmission, allowing the Dao’s qi to flow downward, covering the mortal in need. May the afflicted recover swiftly, and may those who recover bring merit to the officers and soldiers. Let their merit be reported to the Celestial Courts, their ranks elevated, and their positions advanced. May all inform one another.\n\nFrom the officials above to the spirits within heaven and earth, may the ghosts afflicting the sick be seized and driven away one by one. May the illness be cured, and may the Jade Maidens of healing attend to them. May every action be carried out in accordance with the ailment, and medicine dispensed as needed. May the inspectors below verify the treatment, addressing each condition according to its symptoms, ensuring clear recovery, with merit and reward for each cure.\n\nShould any among the myriad ranks bear resentment toward the officials, soldiers, or healing officers, let them be furnished with treasured needles, medicinal tools, and the company of Master Lu and Bian Que, leading the Kings of Medicine of the world, along with three hundred sixty Healing Merit Scribes and twenty-four thousand Minor Life Officers. May seven hundred thousand Jade Lads be entreated to descend, responding to the petition in full array. Let recovery be swift, restoring health and mobility.",
      "overlap_context": "ree Caverns’ decrees, unable to bear the urgency of the suffering before us. Great and small, high and low—we kowtow, beat our cheeks, and plead in earnest, seeking deliverance.\n\nUnable to endure the sight of this mortal’s desperate plight, like a candle in the wind, we prostrate ourselves, presenting this oral petition once, laid upon the jade table before us.\n\nAs the petitioner’s words are recorded, we humbly submit each matter. We dare not transgress the rites, though much remains to be said.",
      "start_char": 1222,
      "end_char": 1550,
      "start_sentence": 70,
      "end_sentence": 88,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.83993411064148,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "龙登虎步，康休无他。 谨以元元上启，请省章言。 泰玄都正一平炁系天师阳平治太上中炁三洞弟子某岳先生臣某，稽首再拜上言：谨按文书，某郡县乡里，同道男女官某甲，年如干岁，户男女口，如干人，愿辞所云列。 阖门胎生，佑骨子孙。 蚁细常菁，习俗之未。 轮转生死，得有今身。 长於草野，六畜不别。 信邪倒见，非为一劫。 先身实缘，千载之运。 遭幸之际，得入清化。 参染法教，奉属大道。 草苗之次，得在天民，私自欣慰。 但某肉人，百行多违。 罪过狼藉，考重三官，以招不利。 顷者以来，大小病疾灾祸，妖怪鬼精，灾害宅舍，虚耗钱财，梦景不吉。 又某疾病淹笃，所苦云云。 大小相守，不能有感。 请祈万神，梼赛无益。 今者厄困，恐不全济。 上穷下迮，无心自厉。 东西卜问，龟易所推。",
      "translated_text": "With dragon’s ascent and tiger’s tread, may health and fortune abide, free from all else.\n\nRespectfully, with utmost sincerity, this petition is humbly presented for review.\n\nFrom the Great Mystery Capital, the Orthodox Unity, the Balanced Qi Lineage of the Celestial Master, the Yangping Abbey, the Three Caverns Disciple, the Perfected of Mount [X]—your servant [Name]—kneels and bows twice to submit this address:\n\nIn accordance with the documents, [Name], a Daoist official of such-and-such prefecture, county, township, and village, aged [number] years, along with [number] household members, male and female, hereby declares the following as stated.\n\nThe entire household, born of womb and bone, is blessed with descendants. Yet like ants in the grass, we remain mired in vulgar customs, unenlightened. Through the cycles of birth and death, we have attained this present form—raised in the wilds, unable to distinguish the six livestock. Misguided by false beliefs and inverted views, we have strayed for kalpas untold. Our past lives bear the weight of a thousand years’ fate, and only by fortunate encounter have we entered the realm of pure transformation. We have embraced the teachings of the Dharma, pledged ourselves to the Great Dao, and, though but sprouts in the field, have been counted among the people of Heaven, a cause for private joy.\n\nYet this flesh-bound servant has violated the hundred virtues in manifold ways. My transgressions are as scattered as a wolf’s tracks, so grave that the Three Officials weigh them heavily, bringing misfortune upon me. Of late, afflictions great and small, illnesses, calamities, demonic apparitions, and malevolent spirits have plagued my home, draining wealth and fortune, while inauspicious dreams haunt my nights. Moreover, my illness has grown severe, with sufferings too numerous to recount. Though family tends to me, no relief comes. I have prayed to the myriad spirits and made offerings, yet to no avail. Now, beset by hardship, I fear I may not survive. Pressed from above and below, I lack the resolve to rouse myself. I have consulted diviners far and wide, yet the tortoise-shell and milfoil reveal no favorable omen.",
      "overlap_context": "y among the myriad ranks bear resentment toward the officials, soldiers, or healing officers, let them be furnished with treasured needles, medicinal tools, and the company of Master Lu and Bian Que, leading the Kings of Medicine of the world, along with three hundred sixty Healing Merit Scribes and twenty-four thousand Minor Life Officers. May seven hundred thousand Jade Lads be entreated to descend, responding to the petition in full array. Let recovery be swift, restoring health and mobility.",
      "start_char": 1550,
      "end_char": 1863,
      "start_sentence": 89,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.315221309661865,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "唯言某家亲大祖父三十六世以来，有犯天诅地诅、日月之诅、星辰之诅、五社之诅、水火之诅、五盟七诅之罪。 先世所犯，谴在三官，来耗害生人。 致令居生轗轲，事云云。 皆恐某家七世父祖，昔日生在之时，违天负地，五逆不孝，诛君截位，杀害帝主。 方伯二千石，令长大臣，三公九卿，尚书仆射，星宿大臣。 或欺神慢师，骂辱父母。 或嫌度圣闻，妄造自用。 或坏真宫静治神人鬼屋，偷人牛马牲口财帛，人所发觉，引天及地。 欺神唤日，指点星辰。 社祠庙下，更相咒诅，野道复连而死。 死者相引，历劫不休，遂至弥灭。 子孙相呼，展转不绝，地下不断，殃及后世。 又恐某家先世七祖父母，依官仕宦，枉杀无辜，杀害良善。 讼系贤人璧他奴婢牛马之属，枉绝人命，不以道理。 或谋伯叔中外之亲，取其钱财，淫色内乱，非人所知。 或杀人之夫，图人之妻。 细作两头，交乱二国。 不知杀谁之父，害谁之子。 不知杀谁之夫，害谁之妇。 不知图谁之国，害谁之主。 不知杀谁之君，不知害谁之臣。 不知杀何人之母，孤何人之子。 不知欺谁之善，杀谁之贤。 不知偷何人之物，不知盗何人之财。 不知伐何人之祖，不知杀何人之孙。 木知烧何人之屋，灭谁之门。 先世以来，亡人七祖，有如此罪，引逮及先亡者。 某家先世，或有落水死者，即请水葬之，清凉内外朗然。 若以火烧死者，即请火葬之，赫赫飞仙无碍。 若刀兵而死者，即请刀兵而葬之，刀兵滑利，利於后世。 若狱市死者，即请狱市葬之，狱市长流，世世无他。 若落崟石而死者，请以崟石葬之，崟石道畅，万草青青。 若虎狼害死者，即请以虎狼葬之，虎狼毛皮文章，使万劫通利。 若卧厌死者，即请卧厌葬之，清净绵绵，世世安吉。 若有病死者，哽死、缢死、绞死、刀兵斩死者，各随所属，安而葬之。 又恐上世亡人等，有如此死者，死日不吉，星宿不度，亡者谪作，在三官二十四地狱之中。 或世人社庙道废，昼夜担沙负石，填江塞海，不得休息。 亡人愁毒，讼诉天曹主者，求取生人自代，致令某疾病危厄、灾殃患祸。 皆是先世亡人死日不吉，不利生人，与百鬼梯道来往，耗害生人。 恐亡人生存之日，取妇移徙之日，葬埋之时，犯触禁忌。 亡人死日不吉，星宿不灭。 今请东方角亢氏房心尾箕，拔出某家亡人七世父母三十六世以来殃考基谪，悉令除判，消然解脱。 上生天人之中，衣食自然。 若在三涂八难之中者，一一为迁拔之。 若亡人等七世父母先世以来，叛道入邪，反覆之愆，罪结山岳，未蒙原赦者，愿请太真小吏百二十人，官将一合来下，和愈之。 解否无他摄鬼等，合共驱逐小鬼，时行疫疠脱籍之鬼，一切收而郁之。 若先亡后死七祖父母，五逆之殃，无状之罪，万过千咎，违天负地，难恕之愆，一切原赦，除判了了。 令某家七祖父母三十六世以来，刀兵木索、县官牢狱市死者，或木石所槌磔死者，或痍肿恶疮死者，或落水火沉烧死者，或有流离他方不得葬埋之者，各各随其死处而葬之。 若某家七祖父母三十六世以来，移徙嫁娶，造宅所为，犯触恶星丑宿，不得道理，逢逆劫杀，青龙、白虎、朱雀、玄武、勾陈，八神禁忌，以致不祥。 或移徙葬埋，犯解大将军。",
      "translated_text": "I confess that from the thirty-six generations of my great ancestors and forefathers, there have been offenses against the curses of Heaven and Earth, the sun and moon, the stars and constellations, the Five Earth Gods, the curses of water and fire, and the transgressions of the Five Covenants and Seven Curses. The sins of my forebears have incurred the judgments of the Three Officials, bringing harm and depletion to the living. Thus, my life has been beset with hardship, and my affairs have been fraught with misfortune.\n\nI fear that my seven generations of ancestors, during their lifetimes, defied Heaven and betrayed Earth, committing the five acts of rebellion and unfilial impiety, usurping rulers and seizing thrones, murdering sovereigns and lords. They may have wronged regional governors, high ministers, the Three Dukes, the Nine Chamberlains, the Directors of the Imperial Secretariat, the celestial ministers, or the starry hosts. Some may have deceived the gods and scorned their teachers, reviled and humiliated their parents. Others may have spurned sacred teachings, acting recklessly and self-servingly. They may have desecrated the pure abodes and tranquil sanctuaries of the gods, stolen others’ oxen, horses, livestock, or wealth, and when exposed, invoked the wrath of Heaven and Earth. They may have deceived the gods by calling upon the sun, pointed at the stars, or cursed one another beneath the altars of earth gods and ancestral temples, dying in wild places or through mutual retribution. The dead have drawn one another into endless cycles of suffering, leading to utter annihilation. Descendants have called out to one another in an unbroken chain, their torments in the underworld unceasing, extending calamity to later generations.\n\nI further fear that my seven generations of ancestors, while serving in official posts, wrongfully killed the innocent and harmed the good and virtuous. They may have falsely accused and imprisoned worthy men, or seized others’ slaves, cattle, horses, and property, unjustly taking lives without reason. Some may have plotted against uncles and other kin, seizing their wealth, engaging in incestuous relations, or committing unspeakable acts. They may have murdered a man to take his wife, or schemed from both sides, sowing discord between two states. They knew not whose father they killed, whose son they harmed, whose husband they murdered, whose wife they took. They knew not whose state they plotted against, whose lord they harmed, whose ruler they slew, whose minister they betrayed. They knew not whose mother they killed, leaving whose child orphaned, whose goodness they deceived, whose worth they destroyed. They knew not whose possessions they stole, whose wealth they plundered, whose ancestors they felled, whose descendants they slaughtered. They knew not whose house they burned, whose lineage they extinguished. From generation to generation, the dead among my seven ancestors may have committed such sins, drawing the living into their retribution.\n\nIf any of my ancestors died by drowning, I pray they may be interred by water, their inner and outer selves cleansed and radiant. If any perished by fire, I pray they may be buried by fire, ascending as soaring immortals without hindrance. If any died by the sword, I pray they may be buried by the blade, their weapons sharp and auspicious for posterity. If any died in prison or the marketplace, I pray they may be buried there, their sufferings flowing away, ensuring no further misfortune for generations to come. If any were crushed by falling rocks, I pray they may be buried beneath them, their path unobstructed, with verdant grasses flourishing forever. If any were slain by tigers or wolves, I pray they may be buried by these beasts, their pelts and markings bringing boundless fortune through ten thousand kalpas. If any died by oppressive forces, I pray they may be buried thus, their rest undisturbed, their descendants forever secure. If any died of illness, choking, hanging, strangulation, or execution by the sword, may they each be interred according to their fate.\n\nI further fear that those among my ancestors who met such deaths did so on inauspicious days, under ill-omened stars, their spirits condemned to the Three Officials and the Twenty-Four Hells. Some may have been forced by the living to labor in abandoned earth-god shrines, carrying sand and stones day and night to fill rivers and seas, never resting. The tormented dead have pleaded with the celestial bureaus, seeking to replace themselves with the living, thus bringing grave illness, peril, and misfortune upon me. All this stems from the inauspicious deaths of my ancestors, whose suffering harms the living, as they conspire with a hundred ghosts to deplete and afflict us. I fear that in their lifetimes, on the days they took wives, moved homes, or were buried, they violated taboos and prohibitions. Their deaths were ill-starred, their sins unexpiated.\n\nNow I invoke the Eastern constellations—Horn, Neck, Root, Chamber, Heart, Tail, and Winnowing Basket—to extract and absolve the accumulated judgments and condemnations of my seven generations of ancestors and thirty-six generations of forebears, dissolving them entirely. May they ascend to the ranks of celestial beings, their clothing and sustenance naturally provided. If any remain in the Three Wretched Realms or the Eight Difficulties, may they each be delivered. If my seven generations of ancestors and forebears strayed from the Dao into heresy, their transgressions as vast as mountains, yet unabsolved, I pray that a hundred and twenty minor Perfected Officers and a host of celestial generals descend to harmonize and heal them. May they dispel all misfortune, expel malevolent ghosts, and drive away the specters of epidemics and wandering plagues, seizing and confining them all.\n\nMay the sins of my seven generations of ancestors—those of the five rebellions, the countless transgressions, the offenses against Heaven and Earth, the unforgivable crimes—all be pardoned and absolved, their judgments resolved. May my seven generations of ancestors and thirty-six generations of forebears who died by the sword, in bonds, by official execution, in prison or the marketplace, or were crushed by wood or stone, or perished from festering sores, drowning, burning, or were left unburied in distant lands, each be interred according to their fate. If in moving homes, marrying, building dwellings, or other undertakings, my seven generations of ancestors and thirty-six generations of forebears violated the baleful stars or the inauspicious lunar mansions, acted against reason, encountered adversity, or offended the Green Dragon, White Tiger, Vermilion Bird, Black Tortoise, or Hook Star, or the eight divine prohibitions, bringing misfortune, or if their burials or relocations transgressed the Great General of Disaster—may all such offenses be resolved.",
      "overlap_context": "agued my home, draining wealth and fortune, while inauspicious dreams haunt my nights. Moreover, my illness has grown severe, with sufferings too numerous to recount. Though family tends to me, no relief comes. I have prayed to the myriad spirits and made offerings, yet to no avail. Now, beset by hardship, I fear I may not survive. Pressed from above and below, I lack the resolve to rouse myself. I have consulted diviners far and wide, yet the tortoise-shell and milfoil reveal no favorable omen.",
      "start_char": 1863,
      "end_char": 3076,
      "start_sentence": 110,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.24165439605713,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "太岁太阴，冲破劫杀。 五部刺奸，十二司命。 十二月建，五虚六耗。 天年岁星，宅中伏龙。 七狱吏，井灶之神。 青龙白虎，朱雀玄武，六合勾陈。 天后所居，天空天一，功曹传送，太一登明，天刚从魁，河魁大吉，小吉斗加。 阴阳四面，注杀声尸六害。 高功卑功，天功地功，水功土功，金功木功。 时恶之鬼，讼考之殃。 青功赤功，白功黑功黄功。 天赀地赀，青赀赤赀，黄赀白赀黑赀。 覆水污池，零林之鬼。 营传符庙，饮食之鬼。 杀生血食爱钱，邪浊不正之神。 山林孟长，十二溪女。 男孟女孟，大孟小孟，青孟赤孟，白孟黑孟黄孟。 百猎鬼行，破杀下官。 故气山川庙祠，众邪鬼神，祈梼咒诅。 天祷地祷，大祷小祷。 南乡三考，司命大王。 立路之神，三皇五帝。 伏羲将军，自称五霸。 伐杀将军，天心太守。 九江大神，十二水帝。 五道将军，左右掾吏。 一切禁官，四海游猎。 道上行客，五虚六耗。 五毒凶吹，十二不媚之鬼。 春秋冬夏，清浊之气。 岁复月连，日复时连。 鬼贼盘结不去者，愿一切分别，随时解散四面咒诅。 黄帝五霸以来，坏军死将脱锋之鬼，光怪集聚，合为精祟。 崟石草木、虫鼠龙蛇、狐狸虎豹、乌雀众精，下官故气六甲六乙、六丙六丁、六戊六己、六庚六辛六壬六癸十二时上支干禁忌之鬼，共为精祟。 群辈相逐，皆共乘车，骑马步从。 鬼兵枸闭生人魂魄，残害天民，招唤死人。 七世父母三十六世以来，盟诅不了，地下相引，逮及生人。 不知某家七世父母死人，从何许来？ 姓族所由婚姻，悉何方人？ 死亡之日，属何郡县何乡里？ 将作缘吏，为何姓名？ 皆属星官，为是何宿？ 角亢氏房心尾箕，青龙七星主之。 位属东方，甲乙，官青帝，岁星，木精。 主春正月、二月、三月，寅卯辰岁月日时。 始春，王相能消土精。 斗牛女虚危室壁，玄武七星主之。 位属北方，壬癸，黑帝，辰星，水精。 主冬十月、十一月、十二月，亥子丑。 始冬，王相能消火精。 奎娄胄勖毕赀参，白虎七星主之。 位属西方，庚辛，白帝，太白，金精。 主秋七月、八月、九月，申酉戌。 始秋，王相能消木精。 井鬼柳星张翼轸，朱雀七星主之。 位属南方，丙丁，赤帝，荧惑，火精。 主夏四月、五月、六月，巳午未。 始夏，王相能消金精。 □□□□□□□七星，位属中央，戊己，勾陈，镇星，土精。 分节，王相能消水精。 二十八宿，三十五官，死人所属诸官，天兵随事解释。 又恐某家先亡后死七祖父母，从无极世界以来，有诸犯触。 角宿三星，十二度。 二清二浊将，从二百七十人。 恶星当灭，复连当绝。 亢宿四星，九度。 一清三浊将，从三百五十人。 恶星当灭，复连当绝。 氏宿四星，十五度。 一清三浊将，从三百五十人。 恶星当灭，复连当绝。 房星四星，钩铁二星，合六星，五度。 一清二浊将，从一百五十人。 恶星当灭，复连当绝。 心宿三星，五度。 一清一浊将，从三百一十人。 恶星当灭，复连当绝。 尾宿九星，十八度。 一清二浊将，从一百二十五人。 恶星当灭，复连当绝。 箕宿四星，十二度。 一清一浊将，从三百九十人。 恶星当灭，复连当绝。 谨请东方九夷，九九八十一官君将，从兵士七十亿万众，一合来下。",
      "translated_text": "May the Year Star and Great Yin, the clashes and baleful stars, be resolved. The Five Divisions’ piercing deceits and the Twelve Life-Mandating Deities; the monthly establishments, the Five Deficiencies and Six Expenditures; the celestial Year Star and the hidden dragon within the dwelling; the seven prison wardens and the spirits of wells and hearths; the Green Dragon, White Tiger, Vermilion Bird, Black Tortoise, Six Harmonies, and Hook Star; the abodes of the Heavenly Queen, Heavenly Void, Heavenly One, Merit Clerk, Messenger, Grand Unity, Ascending Brightness, Heavenly Rigidity, Follower, River Marshal, Great Auspice, and Lesser Auspice; the Dipper’s encroachment; the yin and yang on all four sides, the inscribed baleful influences, the clamorous corpses, and the Six Harmings; the high merits and low merits, the celestial merits and terrestrial merits, the water merits and earth merits, the metal merits and wood merits; the ghosts of inauspicious times and the calamities of litigation and torture; the green merits, red merits, white merits, black merits, and yellow merits; the celestial fines and terrestrial fines, the green fines, red fines, yellow fines, white fines, and black fines; the ghosts of spilled water and polluted pools, the ghosts of withered groves; the spirits of relay stations and talismanic temples, the ghosts of food and drink; those who delight in blood sacrifices and money, the impure and unrighteous deities; the Mountain and Forest Elders, the Twelve Stream Women; the Male Elders and Female Elders, the Greater Elders and Lesser Elders, the Green Elders, Red Elders, White Elders, Black Elders, and Yellow Elders; the hundred hunting ghosts on the move, the destructive and slaying subordinate officials; the residual qi of mountains, rivers, temples, and shrines, the myriad malevolent ghosts and deities, the supplications and curses; the celestial prayers and terrestrial prayers, the great prayers and small prayers; the Three Examinations of the Southern Village, the Life-Mandating Great King; the deities of crossroads, the Three Sovereigns and Five Emperors; the Fuxi General, who styles himself among the Five Hegemons; the Slaying General, the Celestial Heart Governor; the Great Deity of the Nine Rivers, the Twelve Water Emperors; the Five Paths General and his left and right aides; all the prohibiting officials and the roving hunters of the Four Seas; the travelers on the roads, the Five Deficiencies and Six Expenditures; the Five Poisons and baleful winds, the Twelve Unyielding Ghosts; the qi of spring, autumn, winter, and summer, both pure and turbid; the years overlapping months, the days overlapping hours; may all ghosts, bandits, and entanglements that linger be distinguished and, in accordance with the times, dispersed and dissolved on all four sides, along with the curses.\n\nFrom the Five Hegemons of the Yellow Emperor onward, the ghosts of ruined armies and slain generals who escaped the blade, the strange apparitions that gather and coalesce into malevolent spirits; the essences of cliffs, stones, grasses, and trees, of insects, rats, dragons, and snakes, of foxes, tigers, leopards, and crows, the myriad essences; the subordinate officials and residual qi of the Six Jia, Six Yi, Six Bing, Six Ding, Six Wu, Six Ji, Six Geng, Six Xin, Six Ren, and Six Gui, the ghosts of the Heavenly Stems and Earthly Branches’ prohibitions in the twelve hours—may all such malevolent spirits, as they pursue one another, whether riding in chariots, on horseback, or on foot, be resolved. May the ghostly soldiers who bar the way and seize the souls of the living, harming the people of heaven, summoning the dead, and entangling the living through the unresolved oaths and curses of seven generations of parents and thirty-six generations of forebears, be dispersed.\n\nFrom what place do the deceased seven generations of parents of this household come? What are their surnames and clans, and from which marriages do they derive? From which prefecture, county, village, and hamlet did they depart on the day of their death? What were the names of the officials who presided over their burials? To which stellar officials do they belong, and which constellations govern them?\n\nThe Horn, Neck, Root, Chamber, Heart, Tail, and Winnowing Basket—these Seven Stars of the Green Dragon govern them. Their position pertains to the East, to Jia and Yi, to the Green Emperor, the Year Star, and the essence of wood. They preside over the first, second, and third months of spring, the years, months, days, and hours of Yin, Mao, and Chen. At the onset of spring, when wood is in its prime, it can dissolve the essence of earth.\n\nThe Dipper, Ox, Girl, Void, Danger, House, and Wall—these Seven Stars of the Black Tortoise govern them. Their position pertains to the North, to Ren and Gui, to the Black Emperor, the Chronographic Star, and the essence of water. They preside over the tenth, eleventh, and twelfth months of winter, the years, months, days, and hours of Hai, Zi, and Chou. At the onset of winter, when water is in its prime, it can dissolve the essence of fire.\n\nThe Straddler, Harvester, Stomach, Net, Turtle, Hairy Head, and Triaster—these Seven Stars of the White Tiger govern them. Their position pertains to the West, to Geng and Xin, to the White Emperor, Venus, and the essence of metal. They preside over the seventh, eighth, and ninth months of autumn, the years, months, days, and hours of Shen, You, and Xu. At the onset of autumn, when metal is in its prime, it can dissolve the essence of wood.\n\nThe Well, Ghost, Willow, Star, Spread, Wings, and Axletree—these Seven Stars of the Vermilion Bird govern them. Their position pertains to the South, to Bing and Ding, to the Red Emperor, Mars, and the essence of fire. They preside over the fourth, fifth, and sixth months of summer, the years, months, days, and hours of Si, Wu, and Wei. At the onset of summer, when fire is in its prime, it can dissolve the essence of metal.\n\nThe Seven Stars of [missing text] govern the Center, pertaining to Wu and Ji, to the Hook Star, Saturn, and the essence of earth. They preside over the intercalary months, and when earth is in its prime, it can dissolve the essence of water.\n\nThe twenty-eight lunar mansions and thirty-five stellar officials to which the deceased belong—may the celestial soldiers resolve their entanglements in accordance with the circumstances.\n\nMoreover, it is feared that the deceased ancestors and seven generations of parents of this household, from the Boundless Realm onward, may have committed offenses against the following:\n\nThe Horn Mansion, three stars, twelve degrees. Two pure and two turbid generals, accompanied by 270 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Neck Mansion, four stars, nine degrees. One pure and three turbid generals, accompanied by 350 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Root Mansion, four stars, fifteen degrees. One pure and three turbid generals, accompanied by 350 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Chamber Mansion, four stars, with the Hook and Iron stars (six in total), five degrees. One pure and two turbid generals, accompanied by 150 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Heart Mansion, three stars, five degrees. One pure and one turbid general, accompanied by 310 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Tail Mansion, nine stars, eighteen degrees. One pure and two turbid generals, accompanied by 125 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Winnowing Basket Mansion, four stars, twelve degrees. One pure and one turbid general, accompanied by 390 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Nine Yi of the East, the eighty-one lords and generals of the nine-by-nine, accompanied by seventy billion myriad soldiers, to descend as one.",
      "overlap_context": "g homes, marrying, building dwellings, or other undertakings, my seven generations of ancestors and thirty-six generations of forebears violated the baleful stars or the inauspicious lunar mansions, acted against reason, encountered adversity, or offended the Green Dragon, White Tiger, Vermilion Bird, Black Tortoise, or Hook Star, or the eight divine prohibitions, bringing misfortune, or if their burials or relocations transgressed the Great General of Disaster—may all such offenses be resolved.",
      "start_char": 3076,
      "end_char": 4320,
      "start_sentence": 160,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.77880120277405,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "主解某家七世父母先亡后死三十六世以来，所属七宿角亢氏房心尾箕，七星都合七十五度，一百清八十浊，各随所属何星何宿，一切解脱，悉为消除断绝之。 皆令恶星当灭，复连当绝。 斗宿六星，二十八度。 一清二浊将，从三百六十五人。 恶星当灭，复连当绝。 牛宿八星，八度。 一清三浊将，从三百六十五人。 恶星当灭，复连当绝。 女宿四星，十度。 三清二浊将，从二百三十五人。 恶星当灭，复连当绝。 虚宿三星，十度。 三清一浊将，从二石三十五人。 恶星当灭，复连当绝。 危宿二星，坟墓四星，合六星，十四度。 二清一浊将，从四十八万人。 恶星当灭，复连当绝。 室宿二星，离宫六十星，千二百度。 一清九浊将，从千二百人。 恶星当灭，复连当绝。 壁宿二星，七十度。 千清百浊将，从三万九千人。 恶星当灭，复连当绝。 谨请北方五狄君，五五二十五官君将，从二千九百万人，兵士七十万众一合来下。 主解某家七世父母三十六世以来先亡后死，所属北方玄武七宿斗牛女虚危室壁，七星都合九十八度，万清九千浊，各随所属何星何宿，一切尽为解除断绝之。 奎宿十六星，十六度。 一清二浊将，从十二万人。 恶星当灭，复连当绝。 娄宿三星，十五度。 一清一浊将，从二十六万人。 恶星当灭，复连当绝。 胄宿三星，十四度。 一清一浊将，从一千四百人。 恶星当灭，复连当绝。 昴宿七星，千二百度。 二千清一百浊将，从三百二十人。 恶星当灭，复连当绝。 毕宿八星，千六百度。 二清一浊将，从一百三十六人。 恶星当灭，复连当绝。 觜宿三星，十一度。 一清十浊将，从八十九人。 恶星当灭，复连当绝。 参宿九十星，一百度。 三十清四十浊将，从八十万人。 恶星当灭，复连当绝。 谨请西方六戎君，六六三十六官君，兵士四十万众，一合来下。 主为某家解七祖父母三十六世以来先亡后死，一切死人所属西方白虎七宿奎娄胃勖毕觜参，七星合八万度，千清万浊，各随所属何宿何星，一切悉为解除断绝之。 井宿八星，三十六度。 二十清九十浊将，从七千六百人。 恶星当灭，复连当绝。 鬼宿五星，四十度。 二十清三十浊将，从七万人。 恶星当灭，复连当绝。 柳宿七星，七十度。 十九清二十浊将，从三千人。 恶星当灭，复连当绝。 星宿七星，七度。 二十清三十浊将，从九千九百人。 恶星当灭，复连当绝。 张宿六星，六十度。 一百清三百浊将，从九万七千人。 恶星当灭，复连当绝。 翼宿二十二星，千八百度。 二十清三十浊将，从三百九十人。 恶星当灭，复连当绝。 轸宿七星，七十二度。 三十清九十浊将，从七百六十人。 恶星当灭，复连当绝。 谨请南方八蛮君，八八六十四万官君将，从六十四万众，兵士七十万亿众，一合来下。 主解某家七祖父母三十六世以来先亡后死，所属南方朱雀七宿，井鬼柳星张翼轸七星，都合十二度，九清九浊，各随死人所属何星何宿，一切悉为解除之，断绝了了，复连解散之。 □□□□□□□七宿，位在中央。 勾陈七星，戊己黄帝，镇星土精，四季分节，王相消解水精。 璇玑玉衡，明堂绛宫，七星北斗，共二十八宿，周天三百六十五度四分度之一十八。 万清八万浊，所请官将，周游反覆，尽为解度。",
      "translated_text": "For the liberation of so-and-so’s seven generations of parents, ancestors, and the deceased across thirty-six lineages—those bound to the seven lodgings of Horn, Neck, Root, Chamber, Heart, Tail, and Winnowing Basket, their seven stars totaling seventy-five degrees, with one hundred pure and eighty turbid—each shall be released according to their respective star and lodging, all to be dissolved and severed. Let the baleful stars be extinguished, and their lingering connections severed.\n\nThe Dipper Mansion, six stars, twenty-eight degrees. One pure and two turbid generals, accompanied by 365 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Ox Mansion, eight stars, eight degrees. One pure and three turbid generals, accompanied by 365 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Girl Mansion, four stars, ten degrees. Three pure and two turbid generals, accompanied by 235 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Emptiness Mansion, three stars, ten degrees. Three pure and one turbid general, accompanied by 235 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Rooftop Mansion, two stars, and the Grave Mansion, four stars—together six stars, fourteen degrees. Two pure and one turbid general, accompanied by 480,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe House Mansion, two stars, and the Detached Palace, sixty stars—together 1,200 degrees. One pure and nine turbid generals, accompanied by 1,200 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Wall Mansion, two stars, seventy degrees. One thousand pure and one hundred turbid generals, accompanied by 39,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Five Di Lords of the North, the twenty-five lords and generals of the five-by-five, accompanied by 29 million soldiers and 700,000 troops, to descend as one. For the liberation of so-and-so’s seven generations of parents and the deceased across thirty-six lineages—those bound to the seven lodgings of the Northern Dark Warrior: Dipper, Ox, Girl, Emptiness, Rooftop, House, and Wall, their seven stars totaling ninety-eight degrees, with ten thousand pure and nine thousand turbid—each shall be released according to their respective star and lodging, all to be dissolved and severed.\n\nThe Straddler Mansion, sixteen stars, sixteen degrees. One pure and two turbid generals, accompanied by 120,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Bond Mansion, three stars, fifteen degrees. One pure and one turbid general, accompanied by 260,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Stomach Mansion, three stars, fourteen degrees. One pure and one turbid general, accompanied by 1,400 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Hair Mansion, seven stars, 1,200 degrees. Two thousand pure and one hundred turbid generals, accompanied by 320 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Net Mansion, eight stars, 1,600 degrees. Two pure and one turbid general, accompanied by 136 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Turtle Beak Mansion, three stars, eleven degrees. One pure and ten turbid generals, accompanied by 89 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Three Stars Mansion, ninety stars, one hundred degrees. Thirty pure and forty turbid generals, accompanied by 800,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Six Rong Lords of the West, the thirty-six lords and generals of the six-by-six, accompanied by 400,000 troops, to descend as one. For the liberation of so-and-so’s seven generations of ancestors and the deceased across thirty-six lineages—those bound to the seven lodgings of the Western White Tiger: Straddler, Bond, Stomach, Pleiades, Net, Turtle Beak, and Three Stars, their seven stars totaling 80,000 degrees, with one thousand pure and ten thousand turbid—each shall be released according to their respective lodging and star, all to be dissolved and severed.\n\nThe Well Mansion, eight stars, thirty-six degrees. Twenty pure and ninety turbid generals, accompanied by 7,600 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Ghost Mansion, five stars, forty degrees. Twenty pure and thirty turbid generals, accompanied by 70,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Willow Mansion, seven stars, seventy degrees. Nineteen pure and twenty turbid generals, accompanied by 3,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Star Mansion, seven stars, seven degrees. Twenty pure and thirty turbid generals, accompanied by 9,900 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Spread Mansion, six stars, sixty degrees. One hundred pure and three hundred turbid generals, accompanied by 97,000 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Wings Mansion, twenty-two stars, 1,800 degrees. Twenty pure and thirty turbid generals, accompanied by 390 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Chariot Mansion, seven stars, seventy-two degrees. Thirty pure and ninety turbid generals, accompanied by 760 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Eight Man Lords of the South, the 640,000 lords and generals of the eight-by-eight, accompanied by 640,000 troops and 700,000 myriad soldiers, to descend as one. For the liberation of so-and-so’s seven generations of ancestors and the deceased across thirty-six lineages—those bound to the seven lodgings of the Southern Vermilion Bird: Well, Ghost, Willow, Star, Spread, Wings, and Chariot, their seven stars totaling twelve degrees, with nine pure and nine turbid—each shall be released according to their respective star and lodging, all to be dissolved, severed, and dispersed.\n\n[...] seven lodgings, positioned at the center. The Curved Array of seven stars, the Yellow Emperor of the wu-earth and ji-earth, the Star of Earth’s Essence, governing the four seasons and their divisions, with the waxing and waning of the water essence. The Jade Armillary and Vermilion Palace, the seven stars of the Northern Dipper, together with the twenty-eight lodgings, encircle the heavens in 365¼ degrees. With ten thousand pure and eighty thousand turbid, the invoked lords and generals traverse and return, all to be liberated and transcended.",
      "overlap_context": " generals, accompanied by 125 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nThe Winnowing Basket Mansion, four stars, twelve degrees. One pure and one turbid general, accompanied by 390 soldiers. The baleful stars are to be extinguished, and their lingering connections severed.\n\nWith reverence, we invoke the Nine Yi of the East, the eighty-one lords and generals of the nine-by-nine, accompanied by seventy billion myriad soldiers, to descend as one.",
      "start_char": 4320,
      "end_char": 5606,
      "start_sentence": 244,
      "end_sentence": 318,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.00646948814392,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "使恶星当灭，复连当绝。 又解三阴三阳，千柔万则，千清万浊，复连生人。 先世祖考三十六世以来，先亡后死，亡人所属六甲六乙、六丙六丁、六戊六己、六庚六辛、六壬六癸十二支干之上五道之神，凶者当灭，吉者当出，复连当绝。 刑属五子五丑、五寅五卯、五辰五已、五午五未、五申五酉、五戌五亥十二支干之神，凶神当灭，复连当绝。 解除所属六甲旬。 六肠六阴一切大神，为某家解除七祖父母三十六世以来，一切亡人悉令解脱。 若亡人有犯甲子旬中千基万谴、千殃万考、千罪万过，神将天蓬吏阴阿君与太玄玉女，请解释之。 若亡人有犯甲戌旬中千罪万过、千基万谊、千殃万考，神将天内吏张不临将从四百人，与黄素玉女解释之。 若亡人有犯甲申旬中千罪万过，神将天冲吏程子恩与白素玉女解释之。 若亡人等有犯甲午旬中千罪万过，神将天辅吏杜除君与汉英玉女解释之。 若亡人等有犯甲辰旬中千罪万过，神将天禽吏公孙太君与拜精玉女解释之。 若亡人等有犯甲寅旬中千罪万过，神将天心吏徐君瑶与青要玉女解释之。 正月箕星，属心宿。 三清三浊五寅，功曹主之，不得复连后生人。 二月心星，房宿。 三清三浊五卯，太冲主之，不得复连后生人。 三月氏星，角宿。 三清五浊五辰，天刚主之，不得复连后生人。 四月轸星，翼宿。 三清一浊五巳，太一主之，不得复连后生人。 五月张星，星宿。 四清五浊五午，胜先主之，不得复连后生人。 六月柳星，井宿。 四清三浊五未，小吉主之，不得复连后生人。 七月参星，赀宿。 二清三浊五申，传送主之，不得复连后生人。 八月毕宿，勖星。 三清五浊五酉，从魁主之，不得复连后生人。 九月胃宿，奎星。 三清一浊五戌，河魁主之，不得复连后生人。 十月壁宿，室星。 三清二浊五亥，登明主之，不得复连后生人。 十一月危宿，斗星。 七清九浊五子，神后主之，不得复连后生人。 十二月女星，牛宿。 三清八浊五丑，大吉主之，不得复连后生人。 五柔五刚，三阴五阳，不得复连后生人。 亡人等先生天地以来，有死有生。 死人恐往日生存之时，作诸罪原，不可忍恕。 死入九幽长夜地狱，终天毕地，渴饮寒水，饥食铁丸，吞服火烟。 千年万劫，轮转五道，徘徊涂炭，流曳八难，困辱三徒，长守饿鬼，无有出期。 不堪苦毒，引逮生人，梯首虚耗，万端屯集，宅中疾病，大小不利事状云云。 但言宅中恶神杀鬼，军行师止云。 东方凶神鬼王，姓张，名角子。 身长九尺三寸，手捉赤棒黑索，领青兵大卒十万人。 专行腹痛，下青面之病十二种。 病病苦眼目，头颈身中索索，常苦寒热，四支沉沉，不能饮食，食即逆。 与小鬼王名之，子石家亲被击，击在三官。 灶君慎怒，日日上天，言白罪过。 殃祥男女，十二媚虫，山川社祠鬼事，不了了。 上下相引，共来病人。 南方凶神鬼王，姓祝，名龙安。 领赤兵八十万人，士卒十万人。 专行下痢头痛卒病，二日三日，或十日，或三年乃死。 今人吐下血，四支烦疼，引三丘社祠山野鬼，来病人身。 西方凶神鬼王，姓石，名古子。 领白兵十万人，吏卒六十万人。 专行白下卒死磬病肿下，三年七年十年乃死。 北方凶神鬼王，姓杨，名静。",
      "translated_text": "Let the malevolent stars be extinguished, and those bound for severance be cut off once more. Further dissolve the three yin and three yang, the thousand yielding and ten thousand norms, the thousand pure and ten thousand turbid, that they may no longer afflict the living.\n\nFor the thirty-six generations of ancestral fathers since the dawn of heaven and earth—those who passed before and those who died after—release the spirits of the deceased bound to the six jia and six yi, six bing and six ding, six wu and six ji, six geng and six xin, six ren and six gui, the gods of the Five Paths upon the twelve earthly branches. Let the baleful be extinguished, the auspicious set free, and all bonds severed. For those under the jurisdiction of the Five Punishments—five zi and five chou, five yin and five mao, five chen and five si, five wu and five wei, five shen and five you, five xu and five hai—the gods of the twelve earthly branches, let the malevolent spirits be extinguished and all ties cut off once more. Dissolve the bonds of the six jia cycles.\n\nAll great spirits of the Six Bowels and Six Yin, on behalf of this household, release the seven generations of parents and the thirty-six generations of ancestors, liberating all the deceased. If the departed has transgressed in the jiazi cycle with a thousand curses and ten thousand reproaches, a thousand calamities and ten thousand trials, a thousand sins and ten thousand faults, let the divine general Tianpeng, the yin official Lord Yin’a, and the Jade Maiden of the Great Mystery beseech their dissolution. If the departed has transgressed in the jiaxu cycle with a thousand sins and ten thousand faults, a thousand curses and ten thousand bonds, a thousand calamities and ten thousand trials, let the divine general Tiannei, the official Zhang Bulin, and his four hundred attendants, along with the Yellow-Silk Jade Maiden, dissolve them. If the departed has transgressed in the jiashen cycle with a thousand sins and ten thousand faults, let the divine general Tianchong, the official Cheng Zien, and the White-Silk Jade Maiden dissolve them. If the departed has transgressed in the jiawu cycle with a thousand sins and ten thousand faults, let the divine general Tianfu, the official Du Chujun, and the Han-Ying Jade Maiden dissolve them. If the departed has transgressed in the jiachen cycle with a thousand sins and ten thousand faults, let the divine general Tianqin, the official Duke Gongsun Tai, and the Prostrate-Essence Jade Maiden dissolve them. If the departed has transgressed in the jiayin cycle with a thousand sins and ten thousand faults, let the divine general Tianxin, the official Xu Junyao, and the Azure Essence Jade Maiden dissolve them.\n\nIn the first month, the Winnowing Basket Star belongs to the Heart Lodge. The three pure and three turbid of the five yin, governed by the Merit Officer, shall no longer afflict the living. In the second month, the Heart Star belongs to the Chamber Lodge. The three pure and three turbid of the five mao, governed by the Grand Impulse, shall no longer afflict the living. In the third month, the Clan Star belongs to the Horn Lodge. The three pure and five turbid of the five chen, governed by Heavenly Rigor, shall no longer afflict the living. In the fourth month, the Chariot Star belongs to the Wings Lodge. The three pure and one turbid of the five si, governed by the Great One, shall no longer afflict the living. In the fifth month, the Spread Star belongs to the Star Lodge. The four pure and five turbid of the five wu, governed by Victory First, shall no longer afflict the living. In the sixth month, the Willow Star belongs to the Well Lodge. The four pure and three turbid of the five wei, governed by Minor Auspice, shall no longer afflict the living. In the seventh month, the Three Stars belong to the Ghost Lodge. The two pure and three turbid of the five shen, governed by Transmission, shall no longer afflict the living. In the eighth month, the Net Lodge belongs to the Encouragement Star. The three pure and five turbid of the five you, governed by Following Chief, shall no longer afflict the living. In the ninth month, the Stomach Lodge belongs to the Straddling Star. The three pure and one turbid of the five xu, governed by River Chief, shall no longer afflict the living. In the tenth month, the Wall Lodge belongs to the House Star. The three pure and two turbid of the five hai, governed by Ascending Light, shall no longer afflict the living. In the eleventh month, the Danger Lodge belongs to the Dipper Star. The seven pure and nine turbid of the five zi, governed by Divine Assistant, shall no longer afflict the living. In the twelfth month, the Woman Star belongs to the Ox Lodge. The three pure and eight turbid of the five chou, governed by Great Auspice, shall no longer afflict the living. The five yielding and five firm, the three yin and five yang, shall no longer afflict the living.\n\nSince the beginning of heaven and earth, the deceased have lived and died. The dead may have committed grievous sins in their past lives, unforgivable transgressions. Cast into the Nine Dark Hells of the Long Night, they suffer for all time—thirst quenched by icy water, hunger fed by iron pellets, fire and smoke forced down their throats. For a thousand kalpas and ten thousand eons, they cycle through the Five Paths, wandering in filth and ash, dragged through the Eight Difficulties, shamed in the Three Disciplines, forever bound to the realm of hungry ghosts, with no hope of escape. Unable to endure such torment, they reach out to the living, draining vitality, bringing a thousand misfortunes—illness in the household, great and small misfortunes, and all manner of afflictions. They claim the house is plagued by malevolent spirits and killing ghosts, that armies march and halt at will.\n\nThe Eastern Malevolent Spirit-King of Ghosts, surnamed Zhang, named Jiaozi. Nine feet and three inches tall, wielding a red staff and black rope, leading a hundred thousand green-clad soldiers. He specializes in inflicting twelve kinds of abdominal pain and green-faced illnesses. The afflicted suffer from eye pain, trembling in the head, neck, and body, constant chills and fever, heavy limbs, inability to eat, and vomiting when they do. His lesser ghost-king, named Zishi, strikes the family of the deceased, their punishment recorded in the Three Offices. The Hearth Lord, enraged, ascends daily to report their sins. The misfortunes of men and women, the twelve seductive worms, the ghosts of mountains, rivers, and earth altars—all unresolved. Drawn together, they come to afflict the living.\n\nThe Southern Malevolent Spirit-King of Ghosts, surnamed Zhu, named Long’an. Leading eighty thousand red-clad soldiers and ten thousand troops. He specializes in inflicting dysentery, sudden headaches, and acute illnesses—some dying in two or three days, others lingering for years. He causes people to vomit blood, their limbs wracked with pain, summoning the ghosts of the Three Mounds, earth altars, and wild places to afflict the living.\n\nThe Western Malevolent Spirit-King of Ghosts, surnamed Shi, named Guzi. Leading a hundred thousand white-clad soldiers and six hundred thousand officials and troops. He specializes in inflicting white dysentery, sudden death, deafness, and swelling—some dying in three, seven, or ten years.\n\nThe Northern Malevolent Spirit-King of Ghosts, surnamed Yang, named Jing.",
      "overlap_context": "ved Array of seven stars, the Yellow Emperor of the wu-earth and ji-earth, the Star of Earth’s Essence, governing the four seasons and their divisions, with the waxing and waning of the water essence. The Jade Armillary and Vermilion Palace, the seven stars of the Northern Dipper, together with the twenty-eight lodgings, encircle the heavens in 365¼ degrees. With ten thousand pure and eighty thousand turbid, the invoked lords and generals traverse and return, all to be liberated and transcended.",
      "start_char": 5606,
      "end_char": 6883,
      "start_sentence": 319,
      "end_sentence": 377,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.498708486557007,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "领黑兵五十万人，专行霍乱臃肿之病。 中央凶神鬼王，姓陈，名冗。 领七十万人，专行水病。 东南方凶神鬼王，姓原缺，名达。 领九十万人，专行风病。 西北方凶神鬼王，姓林，名石子。 领六十万人，专行颓病。 三天鬼王，姓石，名龙。 领七十兆众，专行肿病。 九天大鬼王，姓阎，名。 领万鬼，专行恶气毒病，病来杀人。 又一鬼王，姓史，名狩。 领七十万人，专行玲病杀人。 又一鬼王，姓赵，名驹。 领三千万人，专行疟病。 又一鬼王，姓公孙，名岳。 领三万，六千鬼，专行湿气病。 又一鬼王，姓曹名文之。 领万鬼，专行注病。 又一鬼王，姓霍，名凶。 领七十万鬼，专行渴病。 又一鬼王，姓袁，名京。 领三百六十万人，专行短气病。 又一鬼王，姓伊，名明之。 领七十万鬼，专行云中病，取人小儿，卒死病。 又一鬼王，姓季，名子敖。 领万鬼，令人生辄死。 又一鬼王，姓郭，名林之。 领三千万鬼，令人刀兵市死。 又一鬼王，姓杨，名谋。 领万鬼，令人狱幽而死。 又一鬼王，姓孔，名世明。 领七十万鬼，令人魇死。 又一鬼王，姓任，名长。 领三万八千鬼行病，令人自绞而死。 又一鬼王，姓罗，名千。 领万鬼，令人赤病而死。 又一鬼王，姓颜，名肫。 领万鬼，专行令人妇女倒生病，令人母子俱死。 又一鬼王，姓路，名强。 领千万鬼，专行狂病，令人入水取死。 又一鬼王，姓吕，名抚之。 领三万九千鬼，行迷惑病，令人心闷死。 又一鬼王，姓皇甫，名安之。 领万鬼，专行磬病，短气而死。 又一鬼王，姓丁，名石期。 领万鬼，取人田蚕，令人不收。 又一鬼王，姓谈，名道之。 领七十万鬼，专行火气，令人烧屋烧杀人。 又一鬼王，自称无头大将军，领万鬼，专行心腹病死。 又一鬼王，姓房，名车兵。 领三千万鬼，专行阴祥病。 又一鬼王，姓仇，名仲子。 领三万鬼，专行热病。 又一鬼王，姓木，名玄灵。 领千万鬼，专行狂病。 又一鬼王，姓文，名进之。 领万鬼，专行咽病。 又一鬼王，姓季，名兵之。 领七十万鬼，专行癃病。 又一鬼王，姓敢，名奇。 领六十万鬼，专行逆生病，生子即死。 如此之鬼王等，水火之神，五斗将军，十二时神，五岳力士天丁，二十六万人。 与司马季主，云中司命，地下长子，八十万人。 军行师止，耗乱百姓，祸害无端。 ．",
      "translated_text": "The Northern Malevolent Spirit-King of Ghosts, surnamed Yang, named Jing, leads five hundred thousand black-clad soldiers, specializing in inflicting cholera and swelling diseases.\n\nThe Central Malevolent Spirit-King of Ghosts, surnamed Chen, named Rong, leads seven hundred thousand troops, specializing in inflicting water-borne diseases.\n\nThe Southeastern Malevolent Spirit-King of Ghosts, surname missing, named Da, leads nine hundred thousand troops, specializing in inflicting wind-borne diseases.\n\nThe Northwestern Malevolent Spirit-King of Ghosts, surnamed Lin, named Shizi, leads six hundred thousand troops, specializing in inflicting hernia.\n\nThe Three Heavens Ghost-King, surnamed Shi, named Long, leads seventy million, specializing in inflicting swelling diseases.\n\nThe Great Ghost-King of the Nine Heavens, surnamed Yan, leads ten thousand ghosts, specializing in inflicting malignant qi and poisonous diseases that swiftly kill.\n\nAnother Ghost-King, surnamed Shi, named Shou, leads seven hundred thousand troops, specializing in inflicting chills that kill.\n\nAnother Ghost-King, surnamed Zhao, named Ju, leads thirty million troops, specializing in inflicting malaria.\n\nAnother Ghost-King, surnamed Gongsun, named Yue, leads thirty-six thousand ghosts, specializing in inflicting dampness-borne diseases.\n\nAnother Ghost-King, surnamed Cao, named Wenzhi, leads ten thousand ghosts, specializing in inflicting consumptive diseases.\n\nAnother Ghost-King, surnamed Huo, named Xiong, leads seven hundred thousand ghosts, specializing in inflicting thirst diseases.\n\nAnother Ghost-King, surnamed Yuan, named Jing, leads three million six hundred thousand troops, specializing in inflicting shortness of breath.\n\nAnother Ghost-King, surnamed Yi, named Mingzhi, leads seven hundred thousand ghosts, specializing in inflicting cloud-borne diseases that seize infants, causing sudden death.\n\nAnother Ghost-King, surnamed Ji, named Ziao, leads ten thousand ghosts, causing people to die at birth.\n\nAnother Ghost-King, surnamed Guo, named Linzhi, leads thirty million ghosts, causing people to die by blades or in marketplaces.\n\nAnother Ghost-King, surnamed Yang, named Mou, leads ten thousand ghosts, causing people to die in dark prisons.\n\nAnother Ghost-King, surnamed Kong, named Shiming, leads seven hundred thousand ghosts, causing people to die in nightmares.\n\nAnother Ghost-King, surnamed Ren, named Chang, leads thirty-eight thousand ghosts, causing people to die by self-strangulation.\n\nAnother Ghost-King, surnamed Luo, named Qian, leads ten thousand ghosts, causing people to die from red diseases.\n\nAnother Ghost-King, surnamed Yan, named Zhun, leads ten thousand ghosts, specializing in causing women to suffer from breech birth, killing both mother and child.\n\nAnother Ghost-King, surnamed Lu, named Qiang, leads ten million ghosts, specializing in inflicting madness, driving people to drown themselves.\n\nAnother Ghost-King, surnamed Lü, named Fuzhi, leads thirty-nine thousand ghosts, inflicting bewilderment that causes people to die from heart distress.\n\nAnother Ghost-King, surnamed Huangfu, named Anzhi, leads ten thousand ghosts, specializing in inflicting deafness and shortness of breath leading to death.\n\nAnother Ghost-King, surnamed Ding, named Shiqi, leads ten thousand ghosts, seizing people’s fields and silkworms, causing crop failure.\n\nAnother Ghost-King, surnamed Tan, named Daozhi, leads seven hundred thousand ghosts, specializing in inflicting fire qi, burning houses and killing people.\n\nAnother Ghost-King, self-styled Headless Great General, leads ten thousand ghosts, specializing in inflicting heart and abdominal diseases leading to death.\n\nAnother Ghost-King, surnamed Fang, named Chebing, leads thirty million ghosts, specializing in inflicting yin omens.\n\nAnother Ghost-King, surnamed Qiu, named Zhongzi, leads thirty thousand ghosts, specializing in inflicting heat diseases.\n\nAnother Ghost-King, surnamed Mu, named Xuanling, leads ten million ghosts, specializing in inflicting madness.\n\nAnother Ghost-King, surnamed Wen, named Jinzhi, leads ten thousand ghosts, specializing in inflicting throat diseases.\n\nAnother Ghost-King, surnamed Ji, named Bingzhi, leads seven hundred thousand ghosts, specializing in inflicting urinary blockage.\n\nAnother Ghost-King, surnamed Gan, named Qi, leads six hundred thousand ghosts, specializing in inflicting breech birth, killing infants at birth.\n\nSuch Ghost-Kings, along with the spirits of water and fire, the Five Dipper Generals, the Twelve Hour Spirits, the Five Marchmounts’ Mighty Warriors, and the Heavenly Soldiers—totaling two hundred sixty thousand—join with Sima Jizhu, the Cloud Master of Destiny, the Eldest Son of the Underworld, and eight hundred thousand others. Wherever their armies march or halt, they bring chaos to the people, causing endless calamities.",
      "overlap_context": " blood, their limbs wracked with pain, summoning the ghosts of the Three Mounds, earth altars, and wild places to afflict the living.\n\nThe Western Malevolent Spirit-King of Ghosts, surnamed Shi, named Guzi. Leading a hundred thousand white-clad soldiers and six hundred thousand officials and troops. He specializes in inflicting white dysentery, sudden death, deafness, and swelling—some dying in three, seven, or ten years.\n\nThe Northern Malevolent Spirit-King of Ghosts, surnamed Yang, named Jing.",
      "start_char": 6883,
      "end_char": 7842,
      "start_sentence": 378,
      "end_sentence": 443,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.0191593170166,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "又请魔天万丈五百万人来下，禁此等鬼王。 令不纵横妄杀良善，太上末民收摄，鬼王各各自止。 若章上之后，主某家七祖父母三十六世以来，亡人考气不解，殃谊不了。 牵引生人者，一一令女青韶书制之。 又五方统领鬼王，姓胡，名令。 领三万九千鬼，令人不宜子，而子生自死。 行年在子，子日病者，鬼名祥。 丑日病者，鬼名石期。 寅日病者，鬼名兰。 卯日病者，鬼名阿护。 辰日病者，鬼名文之。 巳日病者，鬼名阿欢。 午日病者，鬼名石强。 未日病者，鬼名张奴。 申日病者，鬼名小都。 酉日病者，鬼名安侯。 戌日病者，鬼名阿都。 亥日病者，鬼名文侯。 直日鬼，鬼名昌子，三千六万人。 大鬼王属大统支训，支训领七千万小鬼王。 自今闻上口章之后，一切收而却之。 九州鬼王，姓革，名川。 领万鬼，杀人妇女。 羌鬼王，姓虎，名百方。 领一鬼，杀人鹦肫。 戎鬼王，姓口口名澄。 领三万鬼，行白下病。 胡虏鬼王，姓乌，名小。 领万鬼，行迷惑病。 蛮撩鬼王，姓兰，名种。 领万鬼，行口痛病。 山鬼神王，姓丘名文庆。 领万鬼，行胸痛病。 十方鬼王，姓周，名举。 领三千万鬼，行脚弱病。 水神鬼王，姓孟，名奔。 领万鬼，行盲冥病。 五岳鬼王，姓阳，名光龙。 领七十万鬼，行恶食，令人睡病。 凡如此诸鬼王，领鬼纵横人问，伺候人衰，便图害生人。 今日章奏，闻令山川林薮、世问里社、符庙邪鬼恶神，皆令窜走，沙崩瓦解，应章消灭。 令主家病差，万神来助。 若某家亲丈人，若有囚徒谴作，一切放遣之。 东方直符大鬼，名青草。 领七千万鬼，专行腰痛病。 又一鬼王，姓强，名当。 领二千八万鬼，专行失气病、下血淋沥不止病。 又一鬼王，姓袁，名文玄。 领七千万鬼，专行失魂死，病人不可近救。 又一鬼王，姓许，名静。 领七十八万鬼，专行令人失魄病。 又一鬼王，姓乐，名玉。 领六十万鬼，专行令人身中瘤肿病。 又一鬼王，姓荣，名期。 领十一万鬼，专行心迷病。 又一鬼王，姓崔，名石杉。 领三万鬼，专行阴肿下血病。 又一鬼王，姓马，名像。 领三万七千鬼，专行令人杀父母师徒，烧人谷麦屋舍治坛，令人恶病不可治，入人心中，令人如此。 又一鬼王，姓吴，名板。 领三千鬼，专行令人赤黄下血病。 又一鬼王，姓明，名长生。 领十二万鬼，专行令人夫妻相憎病。 又一鬼王，姓谢，名朗之。 领六十万鬼，专行令人男女相僧病。 又一鬼王，姓谢，名明之。 领五十万鬼，专行令人生兔缺子。 又一鬼王，姓兰，名进之。 领七十万鬼，专行令人生逆子多有内乱者。 又一鬼王，姓唐，名禄。 领三万鬼，专行恶气病。 如此之鬼王，与五方注鬼，东方青注，南方赤注，西方白注，北方黑注，中央黄注。 朝死之注，暮死之注。 一里之注，二里之注，三里之注，四里之注，五里之注，十里之注，二十里之注，三十里之注，四十里之注，五十里之注，百里之注，二百里之注，三百里之注，四百里之注，五百里之注，六百里之注，七百里之注，八百里之注，九百里之注，千里之注，万里之注。 男注女注，奴婢之注，近注远注。 青注白注，赤注黑注黄注，五注将军。 大注小注，高注卑注。 六畜之注，乌兽之注，草木之注。",
      "translated_text": "Summoning now the Demon-Heaven’s five million and fifty thousand warriors to descend, they are commanded to restrain these Ghost-Kings, forbidding them to rampage and recklessly slaughter the good and innocent. The Most High shall gather the last generations of the people, and each Ghost-King shall withdraw of its own accord. Should this petition be presented, for the master’s household—seven generations of ancestors and thirty-six generations of forebears—any lingering *qi* of the deceased that remains unresolved, any lingering misfortunes unfulfilled, or any who drag the living into their wake, each shall be curbed by the Green Maiden’s *Shaoshu* writ.\n\nAnother Ghost-King, overseer of the five directions, surnamed Hu, named Ling, leads thirty-nine thousand ghosts, causing people to bear no children, or their children to die at birth. If one’s active year falls in the *zi* branch, those who fall ill on the *zi* day are afflicted by the ghost named Xiang; on the *chou* day, by the ghost named Shiqui; on the *yin* day, by the ghost named Lan; on the *mao* day, by the ghost named Ahu; on the *chen* day, by the ghost named Wenzhi; on the *si* day, by the ghost named Ahuan; on the *wu* day, by the ghost named Shiqiang; on the *wei* day, by the ghost named Zhangnu; on the *shen* day, by the ghost named Xiaodu; on the *you* day, by the ghost named Anhou; on the *xu* day, by the ghost named Adu; on the *hai* day, by the ghost named Wenhou. The ghost of the day itself is named Changzi, leading thirty-six million.\n\nThe great Ghost-King belongs to the Grand Marshal Zhi Xun, who commands seventy million lesser Ghost-Kings. From this day forth, upon hearing the recitation of this petition, all shall be gathered and repelled.\n\nThe Ghost-King of the Nine Provinces, surnamed Ge, named Chuan, leads ten thousand ghosts, killing women. The Qiang Ghost-King, surnamed Hu, named Baifang, leads one ghost, killing people by choking on parrot tongues. The Rong Ghost-King, surnamed [missing], named Cheng, leads thirty thousand ghosts, inflicting *baixia* disease. The Hu-Lu Ghost-King, surnamed Wu, named Xiao, leads ten thousand ghosts, inflicting bewilderment. The Man-Liao Ghost-King, surnamed Lan, named Zhong, leads ten thousand ghosts, inflicting mouth pain. The Mountain Ghost-King, surnamed Qiu, named Wenqing, leads ten thousand ghosts, inflicting chest pain. The Ghost-King of the Ten Directions, surnamed Zhou, named Ju, leads thirty million ghosts, inflicting weak legs. The Water Spirit Ghost-King, surnamed Meng, named Ben, leads ten thousand ghosts, inflicting blindness. The Ghost-King of the Five Marchmounts, surnamed Yang, named Guanglong, leads seven hundred thousand ghosts, inflicting gluttony and causing sleep sickness.\n\nAll such Ghost-Kings, leading their ghosts to roam among people, lie in wait for human decline to plot harm against the living. Today, upon the presentation of this petition, let the spirits of mountains, rivers, forests, and marshes, the village shrines of the world, and all perverse ghosts and malevolent deities be scattered and routed, collapsing like sand or shattering like tiles, dissolving in accordance with this writ. Let the master’s household recover from illness, and let the ten thousand spirits come to their aid. Should any of the master’s kin or in-laws be imprisoned or exiled, let them all be released.\n\nThe Eastern Directing Talisman’s great ghost is named Qingcao, leading seventy million ghosts, specializing in inflicting lower back pain. Another Ghost-King, surnamed Qiang, named Dang, leads twenty-eight million ghosts, specializing in inflicting qi depletion, incessant bloody flux, and dribbling urine. Another Ghost-King, surnamed Yuan, named Wenxuan, leads seventy million ghosts, specializing in inflicting soul-loss death, rendering the afflicted beyond aid. Another Ghost-King, surnamed Xu, named Jing, leads seventy-eight thousand ghosts, specializing in inflicting loss of spirit. Another Ghost-King, surnamed Le, named Yu, leads six hundred thousand ghosts, specializing in inflicting tumors and swellings. Another Ghost-King, surnamed Rong, named Qi, leads eleven thousand ghosts, specializing in inflicting heart confusion. Another Ghost-King, surnamed Cui, named Shishan, leads thirty thousand ghosts, specializing in inflicting genital swelling and bloody flux. Another Ghost-King, surnamed Ma, named Xiang, leads thirty-seven thousand ghosts, specializing in inciting people to kill parents, teachers, and disciples, to burn people’s grain, wheat, houses, and altars, and to afflict people with incurable diseases, entering their hearts to drive them to such acts.\n\nAnother Ghost-King, surnamed Wu, named Ban, leads three thousand ghosts, specializing in inflicting red and yellow bloody flux. Another Ghost-King, surnamed Ming, named Changsheng, leads twelve thousand ghosts, specializing in inflicting mutual hatred between husband and wife. Another Ghost-King, surnamed Xie, named Langzhi, leads six hundred thousand ghosts, specializing in inflicting mutual aversion between men and women. Another Ghost-King, surnamed Xie, named Mingzhi, leads fifty thousand ghosts, specializing in inflicting cleft-lip children. Another Ghost-King, surnamed Lan, named Jinzhi, leads seventy thousand ghosts, specializing in inflicting rebellious children and frequent internal strife. Another Ghost-King, surnamed Tang, named Lu, leads thirty thousand ghosts, specializing in inflicting malign *qi* disease.\n\nSuch Ghost-Kings, along with the Five Directions’ *zhu* ghosts—eastern blue *zhu*, southern red *zhu*, western white *zhu*, northern black *zhu*, and central yellow *zhu*—the *zhu* of those who die at dawn, the *zhu* of those who die at dusk; the *zhu* of one *li*, two *li*, three *li*, four *li*, five *li*, ten *li*, twenty *li*, thirty *li*, forty *li*, fifty *li*, a hundred *li*, two hundred *li*, three hundred *li*, four hundred *li*, five hundred *li*, six hundred *li*, seven hundred *li*, eight hundred *li*, nine hundred *li*, a thousand *li*, ten thousand *li*; the *zhu* of men, the *zhu* of women, the *zhu* of servants and maids, near *zhu* and far *zhu*; blue *zhu*, white *zhu*, red *zhu*, black *zhu*, yellow *zhu*, the Five *Zhu* Generals; great *zhu* and small *zhu*, high *zhu* and low *zhu*; the *zhu* of the six livestock, the *zhu* of birds and beasts, the *zhu* of grasses and trees.",
      "overlap_context": "ts, specializing in inflicting breech birth, killing infants at birth.\n\nSuch Ghost-Kings, along with the spirits of water and fire, the Five Dipper Generals, the Twelve Hour Spirits, the Five Marchmounts’ Mighty Warriors, and the Heavenly Soldiers—totaling two hundred sixty thousand—join with Sima Jizhu, the Cloud Master of Destiny, the Eldest Son of the Underworld, and eight hundred thousand others. Wherever their armies march or halt, they bring chaos to the people, causing endless calamities.",
      "start_char": 7842,
      "end_char": 9109,
      "start_sentence": 444,
      "end_sentence": 521,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.325228452682495,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "日月之注，星辰之注。 戎羌之注，胡虏之注。 吴蜀之注，夷狄之注，蛮獠之注。 三万七千之注，凶祥之注，门户之注。 日游之注，月行之注。 大将军之注，太岁之注，太阴之注。 五行之注，四时代谢之注。 丧车斗加之注，死次之注。 行年本命三刑赤色之注，雄雌之注。 姓名相收之注，目色相当之注，姓复相取之注。 注从东方来者，以金断之。 注从南方来者，以水灭之。 注从北方来者，以土却之。 注从西方来者，以火消之。 注从中央来者，以木禳之。 五行之注，各各当位，自止除灭之。 东方有恶黑气者，愿请青帝君九千万人，领青兵士卒七十万众，禳除消灭之。 注从南方来者，愿请赤帝君兵马八十万人，领赤卒七十万众，消而却之。 注从西方来者，愿请白帝君兵马六十万人，领白卒九十万兆众，消而却之。 注从北方来者，愿请黑帝大将军五十万人，领黑卒七十万众，来禳却之。 注从中央来者，愿请黄帝君兵马十二万人，领黄卒七十万众，来下断绝 之。 若五方殟疾、黄奴兄弟七十二人、行病之鬼，乘风驾雀，入人家宅中，伺人衰便，取人小口，一切收除断绝之，令斥去万里。 又五方注鬼，自称蒙恬、赤境、纪良、王卒，各领千人，入宅中取人小口，令其疟病。 又五方恶鬼，自称武帝、汉王、子胥、周公、大臣等，专行腹胀之病。 又注鬼自称古之大王，主天下大将军，来欲病欺人，诈称家亲丈人，杀人小口，令人宅中，多凶病疾。 又一鬼王，姓晏，名羔子。 领三万人，行狂哭病。 又五方五帝注鬼，自称张元伯，领万鬼，行寒热逆疟病。 又五方注鬼，自称焦淡无辜之烊，领三千鬼杀小儿。 又一五方杀鬼，自称刘元达，领七十万鬼，常行七十种疫病。 又一鬼王，自称锺士季，领六十万鬼，主令五种下痢病。 又一鬼王，自称赵公明，领三万鬼，主令人家中斧创伤。 又一鬼王，自称史文业，领七十二万鬼，主令人肿气而死。 又一鬼王，自称姓杜名周，领七十万鬼，主领狱死。 又一鬼王，自称姓宗名文侯，领三千六百鬼，主令人失火。 又一鬼王，自称昊王鬼，领千万鬼，主令人落水死。 又一鬼王，自称田盗者，领七十万鬼，主令人心思而死。 又一鬼王，自称王前、白起、邓艾之鬼，领三万鬼，行万病杀人。 又一鬼王，言是皇帝大神，入人家宅中，驱逐人家鬼，责求血食，与凶祥之鬼、兵猎社祠之鬼、来向之神。 又请穷奇食鬼吏，七十万人，一合来下，次次收食之，无令落失。 又某肉人大小口辞，各称一生之遇，得在道民之次，不能有感奉道，不称多延罪考，阖门不和。 某疾病厄困，惧不自免。 盖闻大道，无物不济。 归命之者，莫不蒙恩。 又本师悬远，告诉不及。 见臣等同法，驰来迎臣等到宅，求乞口章，以自救治。 至臣主职任机美，法气宣扬不胜，所见肉人灾厄。 谨为某冒罪伏地，拜口奏章一通，上诣天曹，并奉醮五帝。 乞丐太上老君，太上丈人，天师嗣师系师，三师君夫人门下，二十四尊贤，十二圣真，慈父圣母之气主者，为肉人某家，道气下流，覆衣肉人。 臣等谨按天师千二百官章本，上请太上空中五盖大将军十二万人，官将二千人。 又请五部大将军十二万人。 又请刚健大将军十二万人，官将千二百人。",
      "translated_text": "The *zhu* of the sun and moon, the *zhu* of the stars and constellations. The *zhu* of the Rong and Qiang, the *zhu* of the Hu and barbarian captives. The *zhu* of Wu and Shu, the *zhu* of the Yi and Di, the *zhu* of the Man and Liao. The *zhu* of thirty-seven thousand, the *zhu* of omens and portents, the *zhu* of gates and households. The *zhu* of the sun’s wandering, the *zhu* of the moon’s passage. The *zhu* of the Great General, the *zhu* of Tai Sui, the *zhu* of Tai Yin. The *zhu* of the Five Phases, the *zhu* of the four seasons’ transitions. The *zhu* of funeral carts and the Dipper’s conjunction, the *zhu* of death’s sequence. The *zhu* of the year’s fate, one’s original destiny, the three punishments, and the red affliction; the *zhu* of male and female. The *zhu* of names that seize one another, the *zhu* of eyes and colors that correspond, the *zhu* of surnames that mutually claim one another.\n\nWhen *zhu* comes from the east, sever it with metal. When *zhu* comes from the south, extinguish it with water. When *zhu* comes from the north, repel it with earth. When *zhu* comes from the west, dissolve it with fire. When *zhu* comes from the center, exorcise it with wood. The *zhu* of the Five Phases, each in its proper position, will naturally cease and vanish.\n\nIf there is an ominous black qi in the east, I humbly invoke the Nine Billion and Nine Million Soldiers of the Azure Emperor Lord, leading seventy myriad azure troops, to exorcise and dissolve it. When *zhu* comes from the south, I humbly invoke the Eight Hundred Thousand Soldiers of the Vermilion Emperor Lord, leading seventy myriad vermilion troops, to dissolve and repel it. When *zhu* comes from the west, I humbly invoke the Six Hundred Thousand Soldiers of the White Emperor Lord, leading ninety myriad and ten thousand white troops, to dissolve and repel it. When *zhu* comes from the north, I humbly invoke the Five Hundred Thousand Soldiers of the Black Emperor Great General, leading seventy myriad black troops, to come and exorcise and repel it. When *zhu* comes from the center, I humbly invoke the One Hundred Twenty Thousand Soldiers of the Yellow Emperor Lord, leading seventy myriad yellow troops, to descend and sever it.\n\nShould the pestilential afflictions of the five directions, the Yellow Slave Brothers seventy-two in number, and the plague-bearing ghosts ride the wind and mount the sparrows, entering the homes of men to await their moments of weakness and seize their young, may all be gathered, severed, and banished ten thousand *li* away. Moreover, the *zhu* ghosts of the five directions, styling themselves Meng Tian, Chi Jing, Ji Liang, and Wang Zu, each leading a thousand men, enter homes to seize the young, bringing malarial fevers. Also, the malevolent ghosts of the five directions, calling themselves Wu Emperor, Han King, Wu Zixu, Duke of Zhou, and Great Ministers, specialize in causing abdominal distension. Further, *zhu* ghosts styling themselves ancient great kings and lords of the world’s great generals come to sicken and deceive men, falsely claiming kinship as elders, slaying the young, and filling homes with misfortune, illness, and calamity.\n\nThere is also a ghost king surnamed Yan, named Gaozi, who leads thirty thousand men to spread madness and wailing sickness. The *zhu* ghosts of the Five Emperors of the five directions, calling themselves Zhang Yuanbo, lead ten thousand ghosts to spread chills, fevers, and perverse malarial afflictions. The *zhu* ghosts of the five directions, styling themselves Jiao Dan and the Innocent Yang, lead three thousand ghosts to slay children. Another of the five directions’ killing ghosts, calling himself Liu Yuanda, leads seven hundred myriad ghosts to perpetrate seventy kinds of epidemics. Another ghost king, calling himself Zhong Shiji, leads six hundred myriad ghosts to cause five kinds of dysentery. Another ghost king, calling himself Zhao Gongming, leads thirty thousand ghosts to cause axe wounds in homes. Another ghost king, calling himself Shi Wenye, leads seventy-two myriad ghosts to cause death by swelling and qi. Another ghost king, surnamed Du and named Zhou, leads seventy myriad ghosts to preside over prison deaths. Another ghost king, surnamed Zong and named Wenhou, leads three thousand six hundred ghosts to cause fires. Another ghost king, calling himself Wu Wang Ghost, leads ten million ghosts to cause drowning deaths. Another ghost king, calling himself Tian Dao, leads seventy myriad ghosts to cause death by longing. Another ghost king, calling himself Wang Qian, Bai Qi, and Deng Ai’s ghosts, leads thirty thousand ghosts to spread myriad illnesses and kill men.\n\nThere is yet another ghost king, claiming to be the Great Spirit of the August Emperor, who enters homes to drive out household ghosts, demanding blood sacrifices, along with the ghosts of omens and portents, hunting and communal sacrifices, and the spirits of those who come seeking. I further invoke the Qiungqi, devourers of ghosts, seven hundred myriad in number, to descend together in succession and consume them, allowing none to escape.\n\nMoreover, I, [Name], of high and low station in this household, declare: in this life’s encounter, I have been numbered among the Dao’s followers, yet I have failed to respond with devotion to the Dao, and my offenses have not been sufficiently prolonged. My household is not harmonious. Now, afflicted by illness and distress, I fear I cannot escape. I have heard that the great Dao succors all things; none who surrender themselves to it fail to receive its grace. Yet my original master is distant, and my pleas cannot reach him. Seeing that I share the same dharma as you, I hasten to welcome you to my home, beseeching a written petition to save and cure myself.\n\nTo you, who hold office and bear the beauty of the dharma’s qi, I declare my inability to fully proclaim the dharma’s power as I witness the calamities and distress of this household. With trepidation, I prostrate myself and humbly submit this petition, one document addressed to the Heavenly Courts, along with offerings to the Five Emperors. I beg the Most High Lord Lao, the Most High Elder, the Celestial Master, the Lineage Masters, the Three Masters, the Lady of the Gate, the Twenty-Four Worthies, the Twelve Perfected Saints, the Compassionate Father and Holy Mother, and the Lords of Qi, to bestow the Dao’s qi upon this household, to cover and clothe us in its grace.\n\nI respectfully follow the Celestial Master’s *One Thousand Two Hundred Officials’ Petition Text* to invoke the One Hundred Twenty Thousand Soldiers of the Five Canopies Great Generals of the Void, along with two thousand officials and generals. I further invoke the One Hundred Twenty Thousand Soldiers of the Five Divisions’ Great Generals, and the One Hundred Twenty Thousand Soldiers of the Vigorous and Stalwart Great Generals, along with one thousand two hundred officials and generals.",
      "overlap_context": " hundred *li*, four hundred *li*, five hundred *li*, six hundred *li*, seven hundred *li*, eight hundred *li*, nine hundred *li*, a thousand *li*, ten thousand *li*; the *zhu* of men, the *zhu* of women, the *zhu* of servants and maids, near *zhu* and far *zhu*; blue *zhu*, white *zhu*, red *zhu*, black *zhu*, yellow *zhu*, the Five *Zhu* Generals; great *zhu* and small *zhu*, high *zhu* and low *zhu*; the *zhu* of the six livestock, the *zhu* of birds and beasts, the *zhu* of grasses and trees.",
      "start_char": 9109,
      "end_char": 10392,
      "start_sentence": 522,
      "end_sentence": 574,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.93758511543274,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "又请赤天中宫、南营大兵、赤兵丙子、敢健士吏兵七十万人。 主收某家宅中，若有五方恶气注鬼者，次次斩其根种。 又请平炁君十二万人，官将千二百人，与收气食气吏、收鬼食鬼吏、收邪食邪吏、收凶食凶吏、收病食病吏，各六千万人，一合来下，到某家宅上收而食之。 若有凶魔恶鬼，一切扫荡消灭之。 又请东镇大将军九十万人，屯某家东门。 又请南镇大将军八十万人，屯某家南门。 又请西镇大将军六十万人，屯某家西门。 又请北镇大将军五十万人，屯某家北门。 又请中镇大将军十二万人，屯某家中庭。 又请穷奇食鬼吏七十万兆众，一合来下，食某家宅中五媪逢契之鬼。 若有五契将军，前猎将军，后猎将军，左猎将军，右猎将军，逢契夫人，五契父母，男契女契，子契孙契，五千六百契官主者，各各共合，集百恶图害主人家大小者，一切悉为驱除之，令斥去万里，使如沙崩瓦解。 重请仙官将军十二万人，官将千二百人，主收天下自称五野六毒之鬼、百二十凶吹之神，一切收而却之，荡除宅上，悉令了了。 又请真天大将军十二万人，官将千二百人，下之某家宅上，收除诈称凶拜之鬼，一切却之，斥去万里。 又请太上宫中素车白马君兵十二万人，官千二百人，屯军七十二万人，主收杀四方凶杀恶鬼。 又请九州刺史、天子督邮兵士七千万人，各屯某家宅门中，收杀五方恶注始害之鬼，一切绝灭之。 又请无上天乾宫中摇天动地君兵士八十万人，一合来下，诣某家宅上，收杀屯聚之鬼、五方注杀之气，一切却之。 又请高魔大鼓、五胡将军赤阳兵士七十八万人，一合来下，诣某家宅中，收除屯聚殃注鬼、百邪鬼贼、魍魉之鬼，一切斩之。 又请杀鬼大将军兵士十二万人，官将千二百人，一合下之，诣某家宅上，收杀疾病人鬼，一切斩破，散除却之。 又请食鬼铁面大兵骑、螣蛇白虎骑、驱除大将军七十万人，一合下之，诣某家宅上，收五殟屯聚之鬼、宅上万邪考精鬼魅、一切斥却之鬼，一切槌破斩灭之。 又请高天万丈大鬼、百鬼中王十二万人，官将七十万人，一合下之，诣某家宅上，收杀屯聚百鬼、黄奴疫病鬼贼，一切收而却之。 又请延命度厄君、补代君，各二千二百人，一合下诣某家上，为病者之身补代延命度厄。 五方之厄，一切为度之。 延年益寿，过灾度厄，保命无穷。 又请治病功曹十五人，天医太医吏、卢医、扁鹊、医吏、玉女，各千二百人，一合来下，责良方善药神汤圣丸针灸之具，入某身中，行生布气。 宜针下针，宜灸与灸，宜汤与汤，宜丸赐丸。 随病所在，尽心治护。 取令除差。 调和五藏，通利百脉，魂安魄定，万神备守。 若耳声目冥者，上请决明君十二人，官将百二十人，一合来下，主为治护耳聋目冥，皆得开朗，听视聪明。 又请天刚将军、杀鬼吏七十万人，虎贲吏七十万人，各持斩鬼钺斧、桃汤沙石，一合来下，入某宅中，驱除五方凶注、五殟邪精、妖魅魍魉、下官故气、宅中妨害、凶神恶鬼，一切诛除斩杀，绝其根种。 若某家七祖父母伯叔先亡后死，生存之日。 有犯五盟七诅，五逆大罪，不慈不孝，杀害贤良。 或作劫贼，掠夺人物。 或偷牛盗马，诱人奴婢。 或掩缚良善，度卖生口。",
      "translated_text": "I further invoke the Seven Hundred Thousand Soldiers of the Central Palace of the Vermilion Heaven, the Great Army of the Southern Encampment, the Vermilion Soldiers of Bingzi, and the Valiant and Stalwart Officers and Soldiers. May they descend to this household to seize and eradicate any malevolent qi or possessing spirits from the Five Directions, severing their roots and lineages.\n\nI also invoke the One Hundred Twenty Thousand Soldiers of the Lord of Balanced Qi, along with one thousand two hundred officials and generals, together with the Six Hundred Million Officers of Qi-Seizing and Qi-Consuming, Ghost-Seizing and Ghost-Consuming, Evil-Seizing and Evil-Consuming, Ominous-Seizing and Ominous-Consuming, and Sickness-Seizing and Sickness-Consuming, all to descend as one and arrive above this household to seize and consume them. Should there be any malevolent demons or evil ghosts, may they be utterly swept away and annihilated.\n\nI further invoke the Nine Hundred Thousand Soldiers of the Eastern Garrison Great General to encamp at the eastern gate of this household. I invoke the Eight Hundred Thousand Soldiers of the Southern Garrison Great General to encamp at the southern gate. I invoke the Six Hundred Thousand Soldiers of the Western Garrison Great General to encamp at the western gate. I invoke the Five Hundred Thousand Soldiers of the Northern Garrison Great General to encamp at the northern gate. I invoke the One Hundred Twenty Thousand Soldiers of the Central Garrison Great General to encamp in the central courtyard.\n\nI also invoke the Seventy Million Myriad Hosts of the Ghost-Consuming Officers of Qiongqi to descend as one and consume the Five Crones and Fengqi Ghosts within this household. Should there be the Five Contract Generals—the Front Hunting General, Rear Hunting General, Left Hunting General, Right Hunting General—along with Fengqi Lady, the Five Contract Parents, Male and Female Contracts, Child and Grandchild Contracts, and the Five Thousand Six Hundred Contract Officials, all conspiring to assemble and plot harm against the master and household, may they all be driven out and banished ten thousand leagues away, shattered like crumbling sand and collapsing tiles.\n\nI earnestly invoke the One Hundred Twenty Thousand Soldiers of the Immortal Officials and Generals, along with one thousand two hundred officials and generals, to seize and repel all ghosts in the world who claim the titles of the Five Wilds and Six Poisons, and the One Hundred Twenty Ominous Howling Spirits, sweeping them from this dwelling and utterly annihilating them.\n\nI further invoke the One Hundred Twenty Thousand Soldiers of the True Heaven Great General, along with one thousand two hundred officials and generals, to descend upon this household and seize and expel all ghosts falsely claiming ominous titles, banishing them ten thousand leagues away.\n\nI also invoke the One Hundred Twenty Thousand Soldiers of the Lord of the White Chariot and White Horse in the Most High Palace, along with one thousand two hundred officials, and the Seven Hundred Twenty Thousand Encamped Troops, to seize and slay all malevolent and murderous ghosts from the Four Directions.\n\nI further invoke the Seventy Million Soldiers of the Nine Provinces’ Inspectors and the Son of Heaven’s Supervisors, each to encamp within the gates of this household, to seize and slay all malevolent possessing spirits from the Five Directions that initiate harm, utterly eradicating them.\n\nI also invoke the Eight Hundred Thousand Soldiers of the Lord of Heaven-Shaking Earth-Quaking in the Supreme Heaven’s Qian Palace to descend as one and arrive above this household, to seize and slay all encamped ghosts and the malevolent qi of the Five Directions’ possessing spirits, utterly repelling them.\n\nI further invoke the Seven Hundred Eighty Thousand Soldiers of the Great Drum of Lofty Demons and the Red Yang Troops of the Five Hu Generals to descend as one and arrive within this household, to seize and eradicate all encamped calamity-possessing ghosts, the hundred evil ghosts and bandits, and the ghosts of monsters and specters, utterly slaying them.\n\nI also invoke the One Hundred Twenty Thousand Soldiers of the Ghost-Slaying Great General, along with one thousand two hundred officials and generals, to descend as one and arrive above this household, to seize, slay, and disperse all ghosts causing illness, utterly shattering and banishing them.\n\nI further invoke the Seven Hundred Thousand Soldiers of the Iron-Faced Ghost-Consuming Cavalry, the Winged Serpent and White Tiger Cavalry, and the Driving-Out Great General to descend as one and arrive above this household, to seize the Five Ailment-Encamped Ghosts, the myriad evil and deceased spirits haunting this dwelling, and all banished ghosts, utterly crushing and annihilating them.\n\nI also invoke the One Hundred Twenty Thousand Soldiers of the Lofty Heaven’s Ten-Thousand-Fathom Great Ghost and the King of a Hundred Ghosts, along with seven hundred thousand officials and generals, to descend as one and arrive above this household, to seize and repel all encamped ghosts, the Yellow Slave and Pestilence Ghost Bandits, utterly seizing and banishing them.\n\nI further invoke the Two Thousand Two Hundred Lords of Life-Prolonging and Calamity-Averting, and the Two Thousand Two Hundred Lords of Substitution and Replacement, to descend as one and arrive above this household, to substitute and prolong the life of the afflicted, averting calamity. May the perils of the Five Directions all be transcended, extending years and increasing longevity, passing through disasters and averting calamities, preserving life without end.\n\nI also invoke the Fifteen Attendants of Healing Merit, the Celestial Physicians and Grand Physicians, the Officers of Medicine, Master Lu, Bian Que, the Jade Maidens, each one thousand two hundred in number, to descend as one, bearing efficacious prescriptions, divine decoctions, sacred pills, and the tools of acupuncture and moxibustion, entering the body of the afflicted to circulate life and distribute qi. Where needles are fitting, let needles be applied; where moxibustion is fitting, let moxibustion be given; where decoctions are fitting, let decoctions be administered; where pills are fitting, let pills be bestowed. According to the location of the illness, may they devote themselves to healing and protection, ensuring complete recovery. May the Five Viscera be harmonized, the Hundred Vessels flow freely, the hun-soul be settled, the po-soul be stabilized, and the myriad spirits stand guard.\n\nShould there be deafness or blindness, I invoke the Twelve Lords of Bright Vision, along with one hundred twenty officials and generals, to descend as one and attend to the healing of deafness and blindness, restoring clarity and brightness, sharp hearing and keen sight.\n\nI further invoke the Seven Hundred Thousand Soldiers of the Heavenly Valiant General and the Ghost-Slaying Officers, along with the Seven Hundred Thousand Tiger-Rushing Officers, each wielding ghost-slaying axes and halberds, peach decoctions, and sand and stones, to descend as one and enter this household, driving out the malevolent possessions of the Five Directions, the Five Ailment evil spirits, specters and monsters, lingering deceased qi, household obstructions, malevolent gods, and evil ghosts, utterly executing and slaying them, severing their roots and lineages.\n\nShould the seven generations of ancestors—parents, uncles, and departed kin of this household—have committed, in life, the Five Oaths and Seven Curses, the Five Heinous Crimes, acts of unfiliality and unkindness, or the murder of the virtuous; or engaged in banditry, plundering people and property; or stolen oxen and horses, abducted servants and maids; or bound and deceived the good, selling the innocent into servitude—",
      "overlap_context": " grace.\n\nI respectfully follow the Celestial Master’s *One Thousand Two Hundred Officials’ Petition Text* to invoke the One Hundred Twenty Thousand Soldiers of the Five Canopies Great Generals of the Void, along with two thousand officials and generals. I further invoke the One Hundred Twenty Thousand Soldiers of the Five Divisions’ Great Generals, and the One Hundred Twenty Thousand Soldiers of the Vigorous and Stalwart Great Generals, along with one thousand two hundred officials and generals.",
      "start_char": 10392,
      "end_char": 11652,
      "start_sentence": 575,
      "end_sentence": 609,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.24281907081604,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "或杀人父母、夫妻子女。 或害人害主，灭人种族。 或窃盗经书，毁辱真正，秽污圣文，叛道入邪，舍真就伪。 或恶口咒诅，无端欺言，妄语轻忽神鬼。 或於日月星辰之下，里社符庙神祠之中，木下四野井灶之边，共相厌祷。 或於道佛治舍，烧香咒誓，牵引天地，论诉神祇，称怨理直，得恩忘义，不赛神祇。 殁命之后，沦坠三涂，受其考对。 亡人苦涩，不能自拔，诉论天曹，引逮生人。 将三案五案之鬼，咒诅众邪百神，共来侵入宅中，妄作祸害不止者，乞丐於今章之后，一一解除消灭之。 不得复令殃注之鬼与野道之神，妄作耗害。 若有三十六世亡人犹执驻不解者，愿诸五方解禁君十二人，官将百二十人，一合下，主为某家，分解上世以来咒诅厌祷之考，悉令和散，不得复来侵害生人。 苦有拒违不去者，愿请诛殃君官将千二百人，一合下到某家宅中，收除下官故气、凶神恶鬼众邪，一切驱逐，奔走山野，勿使留停。 苟行凶暴者，乞今口章表奏之后，令某病者，速得差愈，阖门无他，来财致宝，福庆日隆，所愿谐遂，万向克从。 所请君将吏兵士众用事，收捕救济诸有功劳者，随臣等三会吉日，三月一时都章，言功举迁，千万不负信誓。 恩惟太上，分别求哀。 臣愚，谨因内外二官直使，正一功曹，左右官使者，阴阳神决吏，科车赤符吏，刚风骑置吏，驿马上章吏官，各百二十人出操。 臣等谨为男女生某甲家，不利父母兄弟妻息，甲乙疾病，云云。 性命危急，恐不生活。 拜请天官，解除三十六世以来咒诅厌梼之气。 度星列宿，消灭殃注，断绝复连。 制劝魔王，收鬼治病，补代求生。 救急口启露章一通，上诣太上三天曹，伏须告报。 臣某诚惶诚恐，稽首顿首，再拜以闻。 臣姓属某郡某县。",
      "translated_text": "Or slain others’ fathers and mothers, husbands and wives, sons and daughters; or harmed others’ masters, extinguishing their lineages; or stolen scriptures, defamed the true and upright, defiled sacred texts, betrayed the Dao to embrace heterodoxy, forsaking truth for falsehood.\n\nOr uttered vicious curses, groundlessly slandered, or recklessly slighted gods and spirits with idle speech; or beneath the sun, moon, and stars, within village altars, talismanic shrines, or sacred precincts, or beneath trees, in the wilds, or by wells and hearths, jointly performed binding prayers.\n\nOr in Daoist or Buddhist halls of healing, burned incense and swore oaths, invoking Heaven and Earth, pleading before the gods, claiming grievance or righteousness, forgetting gratitude for favor, and failing to requite the gods. After death, they sink into the Three Wretched Realms, enduring interrogation. The deceased, bitter and distressed, unable to extricate themselves, lodge complaints in the celestial courts, dragging the living into their suits.\n\nThe ghosts of three-case and five-case judgments, the curses of myriad evils and the hundred gods, together invade the household, ceaselessly wreaking havoc. We beseech that, following this memorial, each be dissolved and eradicated, that no longer may baleful infesting ghosts or wayward spirits recklessly cause harm.\n\nShould any of the thirty-six generations of the deceased stubbornly persist, we pray the Twelve Lords of the Five Directions’ Release, with their one hundred twenty officials, descend as one to resolve for this household all interrogations of curses and binding prayers from former lives, thoroughly pacifying and dispersing them, that they may no longer harm the living.\n\nIf any resist and refuse to depart, we pray the Lord of Execution and his one thousand two hundred officials descend as one to this household, seizing and expelling the lingering deceased qi, malevolent gods, evil ghosts, and all manner of spirits, driving them into the wild mountains, allowing no lingering.\n\nShould any act with violence, we beseech that, following the submission of this oral memorial, the afflicted swiftly recover, the household remain free of misfortune, wealth and treasure flow in, blessings and prosperity daily increase, all wishes be fulfilled, and every direction yield compliance.\n\nFor all the lords, generals, officers, and soldiers who have rendered service in capturing and aiding, we shall, on the three auspicious days of the triennial assembly, submit a comprehensive memorial detailing their merits and recommending promotions, sparing no effort to honor our vows.\n\nWith gratitude, we implore the Most High to discern and heed our plea. Your humble servant, in reverence, respectfully entrusts this to the Inner and Outer Officials, the Direct Envoys of the Orthodox Unity, the Merit Registrars, the Left and Right Envoys, the Yin-Yang Decree Officers, the Chariot of Scarlet Talisman Officers, the Officers of the Rushing Wind Couriers, and the Memorial-Mounted Steeds Officers—one hundred twenty each—to carry out the task.\n\nYour servants, in utmost sincerity, on behalf of the living man or woman of such-and-such household, whose parents, siblings, spouse, and children suffer misfortune, whose illnesses of such-and-such nature are grave, whose life hangs in peril, and who fears for survival, humbly invoke the Celestial Officials to dissolve the qi of curses and binding prayers from thirty-six generations past, to disperse baleful infestations, sever all lingering ties, restrain and admonish demon-kings, capture ghosts to treat illness, and substitute for life to seek deliverance.\n\nWe submit this urgent oral memorial, one copy, to the Three Celestial Courts of the Most High, awaiting your decree. Your servant, with trepidation and awe, bows his head to the ground, prostrates himself, and respectfully submits this for your attention. Your servant, of such-and-such surname, from such-and-such prefecture and county.",
      "overlap_context": "ts, utterly executing and slaying them, severing their roots and lineages.\n\nShould the seven generations of ancestors—parents, uncles, and departed kin of this household—have committed, in life, the Five Oaths and Seven Curses, the Five Heinous Crimes, acts of unfiliality and unkindness, or the murder of the virtuous; or engaged in banditry, plundering people and property; or stolen oxen and horses, abducted servants and maids; or bound and deceived the good, selling the innocent into servitude—",
      "start_char": 11652,
      "end_char": 12316,
      "start_sentence": 610,
      "end_sentence": 633,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.340545654296875,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "泰清如法。 太岁某年月日时，於某甲中。 臣某等，谨重上启：太上大道君，太上丈人，天师女师嗣师系师，三师君夫人。 臣上章已讫，启事已竟。 重请今时直符直事各三十六人，今日直符直事各三十六人，今月直符直事各三十六人，今岁直符直事各三十六人，五帝直符直事各三十六人，四时直符直事各三十六人，金光童子玉女各十二人，通章舍人十二人，御章从事十二人，今日典章吏十二人，一合来下。 与左社右稷土地之君，与章俱上，应对天曹素男素女，必令通达。 若章上文字不正、沾污不成、上下不合者，以龙头书刀，长毛利笔，寻丈削治，误字为正，脱字为定，必使上合，无令上官典者，有所谴却。 下官故气、邪精鬼贼，於中道断截章文不达者，收付所在近狱，依法治罪。 责今臣等所上口章，径达无极大道太上老君御前。 左君历关，右君历启，诸官历递，以次分别。 臣等下愚，不明科律，惧有犯触，俯仰之仪，多有不合。 特乞太上弘泛之恩，一一原恕。 若有四面恶人，妄生谋议，口舌云云者，一切禳却之。 乞所奏上闻，所请者下，所召者到，所化者化，所治者愈，所诛者灭，所厌者伏，所消者散，所解者解。 功曹使者，分别朱紫，闭口气升，慎勿稽停。 臣请伏地，须待告报。 伏更闭气如三餐。 臣等上口章事讫。 次纳官",
      "translated_text": "In accordance with the rites of the Grand Clarity,\n\nOn the day and hour of such-and-such month in the year of the Great Year [Tai Sui], at the altar of so-and-so,\n\nYour servants, so-and-so and others, respectfully submit this solemn memorial:\n\nTo the Most High Lord of the Great Dao, the Most High Elder, the Celestial Masters, the Female Masters, the Lineage Masters, the Succession Masters, and the Lady of the Three Masters.\n\nYour servants have already presented the memorial and concluded the petition. We now humbly request that the thirty-six officers on duty at this hour, the thirty-six officers on duty today, the thirty-six officers on duty this month, the thirty-six officers on duty this year, the thirty-six officers on duty under the Five Emperors, the thirty-six officers on duty in the Four Seasons, the twelve Golden Radiance Lads and Jade Maidens, the twelve Messengers of the Memorial, the twelve Attendants of the Memorial, and the twelve Scribes of the Day—all assemble and descend.\n\nTogether with the Lords of the Land to the left of the altar and the right of the sacred altar, they shall accompany the memorial upward and ensure its delivery to the plain-clad men and women of the Celestial Courts, guaranteeing its unimpeded transmission.\n\nShould the text of the memorial be improperly written, stained, or misaligned, let it be corrected with the Dragon-Head Writing Knife and the long-haired, sharp-tipped brush, amending errors, filling omissions, and ensuring its perfect conformity, so that no official in the upper courts may reject or return it.\n\nShould any subordinate officials, baleful qi, demonic spirits, or ghostly bandits intercept or obstruct the memorial along its path, let them be seized and delivered to the nearest prison, to be punished according to the law.\n\nWe entreat that this oral memorial, submitted by your servants, proceed directly to the presence of the Most High Lord of the Limitless Dao, the Most Venerable Lord Lao.\n\nLet the Left Lord pass through the gates, the Right Lord ascend the steps, and all officials transmit it in proper sequence, each according to their rank.\n\nYour servants, being of humble and unenlightened minds, fear that we may have violated the statutes or failed in the rites of reverence. We humbly beseech the boundless grace of the Most High to pardon each and every transgression.\n\nShould there be malicious persons on all sides who recklessly scheme or slander, let all such be averted and dispelled.\n\nWe pray that what is submitted be heard above, what is requested be granted below, what is summoned arrive, what is transformed be transformed, what is treated be healed, what is condemned be destroyed, what is suppressed be subdued, what is dissolved be dispersed, and what is released be freed.\n\nLet the Merit Officers and Messengers distinguish the urgent from the routine, ascend without delay, and take care not to linger.\n\nYour servants prostrate themselves upon the earth, awaiting your decree. We shall hold our breath as if for three meals.\n\nThe submission of this oral memorial is now concluded. Next, we present it to the officials.",
      "overlap_context": " baleful infestations, sever all lingering ties, restrain and admonish demon-kings, capture ghosts to treat illness, and substitute for life to seek deliverance.\n\nWe submit this urgent oral memorial, one copy, to the Three Celestial Courts of the Most High, awaiting your decree. Your servant, with trepidation and awe, bows his head to the ground, prostrates himself, and respectfully submits this for your attention. Your servant, of such-and-such surname, from such-and-such prefecture and county.",
      "start_char": 12317,
      "end_char": 12832,
      "start_sentence": 634,
      "end_sentence": 652,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.506143808364868,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "向来所出，臣等身中功曹使者、将军吏兵，各还臣等身中。 悉从众妙门，各依次第而入。 直使功曹主相，差次在左归左，在右归右。 缠身绕骨，经纬百脉，周身匝体，弥纶天地，下入丹田，上升泥丸，附着臣等身中。 五藏六府，七政九宫，十二宫室，四时五行，百八十关机，安官隐职，列居常位，无令错互。 臣等向所请将军吏兵，各还臣等身中，入金堂玉室。 须臣等，后召复出，奉行一如故事。 次复炉 香官使者，召臣等左右龙虎君，急召五方使者，臣等上口章己讫。 当令靖室之中，自然生金液丹碧芝英，在此香火之前。 令臣等得道真炁，以长生过度。 一切之人，悉今升仙。 削臣等死籍，更上生名算录。 十方素男素女，玉男玉女，童男童女，各侍卫香烟，令臣所上，径诣三天无极大道至真玉皇上帝几前。 太上洞神洞渊神咒治病口章竟",
      "translated_text": "The aforementioned emissaries now dispatched—your servants’ inner Merit Officers, Messengers, Generals, and attendant hosts—shall each return to their stations within your servants’ bodies. All shall pass through the Gates of Myriad Wonders, reentering in proper sequence. The Directing Messenger and Chief Attendant shall take their places: those on the left return to the left, those on the right to the right. They shall coil about the bones, weave through the hundred vessels, encircle the entire body, and encompass heaven and earth. Descending, they enter the Cinnabar Field; ascending, they rise to the Mud-Pill Palace, adhering fast within your servants’ bodies. The five viscera and six bowels, the Seven Governors and Nine Palaces, the Twelve Chambers, the Four Seasons and Five Phases, the hundred-and-eighty joints and mechanisms—all shall resume their hidden offices, arrayed in their proper positions, without confusion or disorder.\n\nThe Generals and attendant hosts previously summoned shall each return to your servants’ bodies, entering the Golden Hall and Jade Chamber. When your servants later issue the call, they shall emerge again, performing their duties as before.\n\nNext, the Incense Officers and Messengers are summoned to invoke the Dragon and Tiger Lords at your servants’ left and right, and to urgently call forth the Messengers of the Five Directions. Your servants’ oral memorial is now concluded.\n\nMay the stillness of this chamber spontaneously generate golden liquid, cinnabar, and azure mushroom blossoms before this incense flame. May your servants attain the true qi of the Dao, thereby achieving long life and transcending mortality. May all people ascend as immortals. May your servants’ names be stricken from the registers of death and inscribed anew in the ledgers of life. May the white-clad men and women, the jade youths, and the boy and girl attendants all guard the incense smoke, so that what your servants have presented may proceed directly to the throne of the Most High, Utmost, and Boundless Dao—the Perfected Jade Sovereign of the Three Heavens.\n\nThe oral memorial for healing through the incantations of the *Highest Clarity’s Divine and Abyssal Dao* is now complete.",
      "overlap_context": " what is treated be healed, what is condemned be destroyed, what is suppressed be subdued, what is dissolved be dispersed, and what is released be freed.\n\nLet the Merit Officers and Messengers distinguish the urgent from the routine, ascend without delay, and take care not to linger.\n\nYour servants prostrate themselves upon the earth, awaiting your decree. We shall hold our breath as if for three meals.\n\nThe submission of this oral memorial is now concluded. Next, we present it to the officials.",
      "start_char": 12832,
      "end_char": 13170,
      "start_sentence": 653,
      "end_sentence": 667,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.576674461364746,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上洞神洞渊神咒治病口章.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}