{
  "source_id": "太上洞渊北帝天蓬护命消灾神咒妙经",
  "source_file": "chunked_daozang\\太上洞渊北帝天蓬护命消灾神咒妙经.json",
  "total_chunks": 5,
  "total_original_chars": 2738,
  "total_translated_chars": 16920,
  "total_translation_time": 89.93766260147095,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\太上洞渊北帝天蓬护命消灾神咒妙经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Supreme Cavernous Abyss Scripture of the Northern Emperor Tianpeng’s Divine Incantation for Life-Protection and Disaster-Dissolution*\n\nThe compiler remains unknown. Four scriptures share this scroll.\n*Source text:* *Daoist Canon of the Orthodox Unity Tradition*, Cavernous Truth Division, Original Texts Section.\n\n---\n\nThe *Supreme Cavernous Abyss Scripture of the Northern Emperor Tianpeng’s Divine Incantation for Life-Protection and Disaster-Dissolution*\n\nAt that time, the Celestial Worthy of Primordial Beginning was within the Fragrant Grove Garden, expounding the Dharma and reciting the precepts to the assembly of heavenly youths. When the discourse was complete, a youth named Vast Goodness arose from his rank, stepped forward, and bowed in reverence. He addressed the Celestial Worthy:\n\n“Today, seated in attendance, we have heard the twenty-four articles of the luminous and true precepts—how the causes of good and evil bear their karmic retribution. The great assembly, filled with awe and joy, each uttered praises, realizing the supreme vehicle without further obstruction. Moreover, we have received your revelation of the karmic conditions of transgression, the methods of deliverance through purification rites, and the salvation of suffering souls from the long night of darkness, ascending to the halls of fortune where clothing and sustenance arise naturally. This Dharma is vast and universal; even the dead rely upon it.\n\nYet in this present world and future lives, men and women remain unacquainted with these scriptural admonitions. Some, weak in qi and strength, are unable to uphold them. Lacking protection against adversity, they are often assailed by the manifold malevolent spirits and perverse demons of the world, their lives cut short, their allotted years unfulfilled. Since the Celestial Worthy has already opened the transformation of great compassion, aiding both the living and the dead, the living and the departed alike bear the weight of your grace. We only beseech your mercy to further reveal a method for future men and women to defend their bodies and protect their lives, that they may be spared the three calamities and nine perils of this world, the five pestilences and seven afflictions, the poisons of illness and noxious qi, the host of demonic specters, and all manner of dire misfortunes. May their lives remain unharmed. Should you deign to show compassion, we would look up in reverence to your sacred grace.”\n\nThen the Celestial Worthy rejoiced and replied: \"Excellent, excellent. What you have requested is indeed of utmost importance. I pity all sentient beings as a mother cherishes her child. Now I shall expound it—listen carefully, hold fast, and never forget.\"\n\nAt that moment, the great assembly rejoiced and received the teaching with reverence.\n\nThe Celestial Worthy said: \"In the distant past, people were simple and guileless, free from malice. They accepted their fate, whether long or short, and fulfilled their allotted years without premature death or unjust harm; no ghosts inflicted violence upon them. But in this later age, the world has grown shallow and hearts have turned corrupt. People sow mutual suspicion, each deceiving the other, rejecting the true Dharma and embracing only perverse conduct. They turn their backs on reality and chase after falsehood, straying from the Dao. They defy Heaven and rebel against Earth, severing their roots and felling their foundations. They are neither loyal nor filial, devoid of compassion. They deceive the multitudes, oppress the common folk, slaughter living beings, and destroy lives. Thus, they accumulate boundless karmic grievances. As a result, men and women of this generation constantly encounter misfortunes: some fall prey to bandits, others are harmed by malevolent ghosts; some perish without cause due to official or private slander; others are wounded by serpents, tigers, wolves, or venomous creatures. Some suffer unjust official calamities, imprisoned without reason, subjected to whips, cudgels, or execution. Others see their households ravaged by pestilence, their bodies afflicted by noxious qi, their families stricken with illness, their kin perishing, their loved ones scattered and lost. All such miseries arise because the qi of the Three Heavens has waned while the qi of the Six Heavens prevails. The realms of humans and ghosts are no longer distinct, and the boundaries between the perverse and the upright have blurred. Thus, the qi of imprisonment, the qi of sorrow, the qi of demonic possession, and the qi of licentiousness assail the living, spreading plagues and epidemics.\n\nNow, the qi of imprisonment arises first, emerging from the north. From one it generates two, and sorrow follows in its wake. From two it generates three, and demonic forces wage their assault.\"\n\nThe kidneys wane and the heart is depleted; the lungs fail and the liver withers. Yellow clouds do not congeal, and black and white turn against each other. The demonic forces of the Six Heavens thus come to invade and harm. The eight legions of ghosts and spirits recklessly seek to annihilate. To attain deliverance, one must know the names of the Six Heavenly Gates and recite the Great Tianpeng Mantra. Rectify the mind, stabilize the thoughts, and contemplate with subtle wisdom. Only then will the great spirits appear, severing the old qi. Peace of body and tranquility of spirit arise therefrom. Prosperity of households and flourishing fortunes are thereby achieved.\n\nThereupon, the jade tones resonate, revealing the names of the Six Heavenly Palaces:\n\nThe first palace is named the Restful Brightness and All-Spirit Cavern Heavenly Palace.\nThe second palace is named the Primordial Controller of the Heavy and Upright Ancestral Spirit Heavenly Palace.\nThe third palace is named the Unifying Immortals Ascending Spirit and Rare Search Heavenly Palace.\nThe fourth palace is named the Upright and True Shao Spirit Search Controller Heavenly Palace.\nThe fifth palace is named the Cloud Terrace Jade Chronicle Bright Primordial Heavenly Palace.\nThe sixth palace is named the Revered Spirit Red Radiance Cloud Vale Heavenly Palace.\n\nThese heavenly palaces lie within the Ren and Gui mountains of the north, in the realm of Luofeng. The Northern Yin Spirit Lord governs over them. Flanking halls and chambers are administered by ghosts and spirits. Internally, they uphold the yin-yang principles of the Six Heavens; externally, they govern the dark boundaries of the Six Heavens’ Luo and Deng. Rewards for merit and punishments for transgressions are meted out without the slightest error.\n\nWith a single thought of upright truth, the six palaces open benevolently. With a single thought of perverse desire, the six palaces open malevolently. Though the qi of perversity flows unchecked, it is still summoned by the human heart. To sever the roots of evil, one must still the mind. Recite the names of the Six Heavenly Gates, bow to the north, and the divine spirits will revere and obey, daring not to inflict harm.\n\nAt that time, the Vastly Good Youth and the great assembly, having heard these words, were filled with both fear and joy. They stepped forward again, bowed, and addressed the Heavenly Worthy: \"We have silently awakened to the conditions of the Dao through countless kalpas. We have known only to uphold the念 of the Dao, gathering our minds into one, and gazing down upon the human realm. We have ever grieved over the plagues and epidemics that cruelly harm living beings, leaving them bewildered and sunk in delusion, without escape. Though we have deeply pitied them, we did not know of such causes and conditions, nor of such virulent qi wreaking havoc in the world. Today, we have received your illumination—truths unheard for kalpas untold. Living beings and their kin may now know what to uphold and where to turn. Boundless are the benefits; we reverently bear the primordial grace. The names of the Six Heavenly Palaces are now inscribed upon golden tablets. The Great Tianpeng Mantra we listen to in stillness, ready to receive.\"\n\nThereupon, the Heavenly Worthy’s jade countenance, moved by the subtle truth of the念, widely proclaimed, \"Excellent indeed!\" The causes and conditions of the Great Vastly Good Mantra are of the gravest prohibitions. I now entrust it to you truly out of compassion for those below, to deliver the multitudes. When my golden mouth expounds it, heaven and earth tremble in solemnity, divine spirits bow in reverence, the jade laws renew themselves, and humans and gods alike rejoice.\n\nThen, turning to the left, he commanded the Left Primordial Perfected One in the Court of the Great Possession to open the purple-sun cloud-brocade casket and produce the Great Mantra, bestowing it upon the assembly of dharma practitioners. The Vastly Good Youth, having received the Great Mantra, was filled with exultation. Immediately, from his seat, he intoned the mantra in a resonant voice:\n\nTianpeng, Tianpeng,\nNine Primordials, Slaying Youth.\nFive Ding Controllers,\nLofty Diao, Northern Lord.\nSeven Governances, Eight Spirits,\nSupreme Vastness, Mighty and Fierce.\n\nThe long-skulled giant beast wields the Emperor’s bell.\nThe Three White Owl Spirits harness the stern-drawn Kui-dragon chariot.\nThe Mighty Sword Spirit-King severs evil and erases traces.\nPurple qi ascends to heaven; crimson clouds blaze and surge.\nDevouring demons, consuming ghosts, his body spans the winds.\nAzure tongue, green teeth, the Four-Eyed Old Man.\nHeavenly Ding warriors, warding the south with awe to quell malice.\nHeavenly Couriers, fierce and swift, bearing blades to the north.\nThree hundred thousand troops guard my ninefold gates.\nSplit corpses for a thousand leagues, sweeping away all ill fortune.\nShould any petty ghost dare approach to witness this,\nthe Heaven-Splitting Great Axe hews its fivefold form.\nThe Fiery Emperor’s scorching blood, the Northern Emperor’s burning bones.\nThe Four Luminaries shatter its remains; the Heavenly Strategist annihilates its kind.\nOne stroke of the divine blade, and ten thousand ghosts scatter in rout.\nSwiftly, swiftly, as the Northern Emperor’s Luminous Might decrees by oral command!\n\nThe recitation now complete, the great assembly pressed close, praising their karmic affinity and rejoicing in their encounter with this hidden name. In an instant, from the east came hosts of great deities, clouds and radiance scattering their hues as they tread the void through empty space. Some bore banners and regalia, some grasped halberds and spears; some trod upon the Eight Trigrams’ divine tortoise, some held the Three Heavens’ Fire Seal. Dragons and tigers flanked them as escorts; bells and drums resounded in unison. Streaming light blazed brilliantly as they made straight for the ritual arena. Emitting manifold dharma-sounds, their voices shook the vault of heaven. Circling before the Dao altar, they bowed twice and entreated earnestly: “We, benighted in the pure emptiness of the Dao, received life in the Thunderclap Realm of the East. Endowed with yang’s vigor, our forms coalesced from pure essence, and our name and title is Tianpeng. Above, we assist the Jade Emperor, administering the Brahma-realm; below, we descend to the abyssal springs, marshaling the hosts of the Primordial August One.”\n\nThe Six Heavens are governed solely by the principle of *sincere venom*. Yet how is it that today, crimson light fills the sky, illuminating the vast universe, its radiance bearing hidden scriptures that descend even to the domains under this humble minister’s command? We, struck with awe and dread, cannot fathom the cause. Thus, we have followed the light upward to seek enlightenment.\n\nThe Heavenly Venerable nodded and replied slowly: “Excellent, great general! From the union of yin and yang, qi coalesces; from the commingling of male and female, essence is conceived. There is the Dao of life, the Dao of death, the Dao of humans, the Dao of ghosts. Life gives rise to humanity; death gives rise to ghosts. Though the paths of life and death diverge, the nature of principle remains one. Yet through creation and action, karmic retribution varies.\n\nI, together with the divine youths of the heavens, expound the essentials of the *Vajra Prohibitions*, discoursing on the causes and conditions of life and death. We see that throughout the world, the Six Heavens are steeped in poison, and perverse qi flows unchecked. The true Dao does not arise; wayward thoughts take root forever. Beings sink into the sea of suffering, adrift upon the river of craving. When one spirit falters, a hundred evils assail; the five spirits become inverted, the three palaces blocked. The Five Emperors no longer traverse their abodes, and the sacred dwelling is choked with dust. Flesh and muscle wither, while hun and shen are tormented and interrogated. Illness lingers, and the pain of poison is unbearable. This is truly lamentable, stirring the depths of compassion.\n\nOnly you, the gods, assist and guard the Northern Emperor. Your might subdues the multitudes; your power dispels evil. You stabilize heaven and earth, accruing great merit and virtue. Thus, I reveal the prohibitions of ten thousand kalpas and bestow the true tabooed name. I instruct the divine youths to transmit it throughout the world, that it may be recited forever. By your awe-inspiring virtue, descend to cast aside the unworthy. Subdue all demons, dispel inauspicious omens, sweep away all filth and poison, and ensure purity and solemnity.\n\nNow that your retinue has arrived at the ritual arena, I further entrust you with this charge for the men and women of the world: bound by lust, imprisoned by killing, fettered by false thoughts, and self-harming through love and aversion. They do not realize that delusion arises from truth, and truth shifts through delusion. Once a single delusion is born, ten thousand evils flourish unchecked.\n\nI now commission you to discern and rectify this: gather the perverse and return them to the true, using the true to suppress the perverse. Throughout the world, if there are good men and good women who suffer the calamities of the *Nine Nines and Sixes*, the *Three Declines, Eight Difficulties, Nine Obstructions, and Five Sufferings*—beset by malevolent qi, epidemics, and accumulated misfortunes—let them recite the great divine incantation. You shall follow the sound to respond to their pleas, rescuing them from peril, restoring them to health, preserving their allotted lifespan, and aiding the spread of the Dao.\n\nAt that moment, the Vastly Good Divine Youth, having heard the Heavenly Venerable’s weighty commission, rose from his seat, bowed twice, and addressed the assembly: “The Heavenly Peng General has personally received the compassionate countenance of the Heavenly Venerable. His divine thoughts are expounded, and his awe-inspiring virtue is fully prepared. Possessing such divine power, he can deliver all beings. We, having heard this together, are deeply fortunate.\n\nWhen one invokes him, let them recite this hymn of praise:\n*We bow our heads and take refuge in the Heavenly Peng General,*\n*The mighty divine one who crushes hordes of demons.*\n*His majestic chariot, drawn by dragons, descends to the ritual arena;*\n*His blazing radiance shakes heaven and earth.*\n*Lord of the twenty-eight lunar mansions and bright stars,*\n*King of the thirty-six divisions of great gods.*\n*Wielding a divine sword to slay demons and evil spirits,*\n*Grasping the sacred seal to smite spectral fiends.*\n*With his hoe-axe, he cleaves open the hells;*\n*The imperial bell he shakes resounds through the celestial palace.*\n*Lightning flashes and thunder rolls, winds and clouds surge;*\n*His vast armored hosts brandish halberds and spears.*\n*The Southern Dipper’s Fire Officials purge poison and harm;*\n*The Northern Emperor’s Water Gods extinguish disasters and misfortunes.*\n*Subduing the great demon kings of the Six Heavens,*\n*Sweeping away the epidemic qi of the ten directions.*\n*In his wrath, the sun and moon lose their brilliance;*\n*At his breath, mountains and rivers boil.*\n*Purple qi rides the heavens, circling below;*\n*Three hundred thousand troops stand in silent readiness.*\n\nWhen the recitation of the hymn was complete, celestial music and mysterious tones resonated spontaneously in the void, while flowers rained down and incense wafted through the air. The countless hosts, along with the Heavenly Peng General’s retinue of divine warriors, each bowed their heads to the Great Dao and joined their voices in praise. Benevolent clouds spread widely, bestowing grace afar. They vowed to transmit this teaching, transforming and delivering all beings. Having paid their respects, they took their leave.\n\nThus concludes the *Wondrous Scripture of the Heavenly Venerable of the Northern Depths, the Heavenly Peng, Protector of Life and Dispeller of Disasters*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞渊北帝天蓬护命消灾神咒妙经 经名：太上洞渊北帝天蓬护命消灾神咒妙经。 撰人不详。 四经同卷。 底本出处：《正统道减》洞真部本文类。 太上洞渊北帝天蓬护命消灾神咒妙经 元始天尊在香林园内，与诸天童子说法演戒。 既毕，时於座中有一童子，名日广善。 越班而出，前进作礼，上白天尊：今日侍座，得闻明真科律二十四条，善恶因绿受报之因。 大众惧喜，各生赞叹。 证无上乘，更无余滞。 又蒙开示罪缘，拔度斋法，救济幽魂长夜之苦，上升福堂，衣食自然。 其法弘普，死者咸赖。 然今见世及来生男女，未见经诫。 或气力薄弱，不堪受持。 复无捍难，多为世问众邪恶鬼横来侵害，夭折寿命，不终天年。 天尊既开大慈之化，生死俱济，存亡荷恩。 唯愿哀怜，更示来生男女防身护命之法。 令得免离见世三灾九横，五瘟七疰，疾病毒气，众邪魍魉，诸厄之难。 令其性命，无有中伤。 如蒙哀愍，仰荷圣恩。",
      "translated_text": "*The Supreme Cavernous Abyss Scripture of the Northern Emperor Tianpeng’s Divine Incantation for Life-Protection and Disaster-Dissolution*\n\nThe compiler remains unknown. Four scriptures share this scroll.\n*Source text:* *Daoist Canon of the Orthodox Unity Tradition*, Cavernous Truth Division, Original Texts Section.\n\n---\n\nThe *Supreme Cavernous Abyss Scripture of the Northern Emperor Tianpeng’s Divine Incantation for Life-Protection and Disaster-Dissolution*\n\nAt that time, the Celestial Worthy of Primordial Beginning was within the Fragrant Grove Garden, expounding the Dharma and reciting the precepts to the assembly of heavenly youths. When the discourse was complete, a youth named Vast Goodness arose from his rank, stepped forward, and bowed in reverence. He addressed the Celestial Worthy:\n\n“Today, seated in attendance, we have heard the twenty-four articles of the luminous and true precepts—how the causes of good and evil bear their karmic retribution. The great assembly, filled with awe and joy, each uttered praises, realizing the supreme vehicle without further obstruction. Moreover, we have received your revelation of the karmic conditions of transgression, the methods of deliverance through purification rites, and the salvation of suffering souls from the long night of darkness, ascending to the halls of fortune where clothing and sustenance arise naturally. This Dharma is vast and universal; even the dead rely upon it.\n\nYet in this present world and future lives, men and women remain unacquainted with these scriptural admonitions. Some, weak in qi and strength, are unable to uphold them. Lacking protection against adversity, they are often assailed by the manifold malevolent spirits and perverse demons of the world, their lives cut short, their allotted years unfulfilled. Since the Celestial Worthy has already opened the transformation of great compassion, aiding both the living and the dead, the living and the departed alike bear the weight of your grace. We only beseech your mercy to further reveal a method for future men and women to defend their bodies and protect their lives, that they may be spared the three calamities and nine perils of this world, the five pestilences and seven afflictions, the poisons of illness and noxious qi, the host of demonic specters, and all manner of dire misfortunes. May their lives remain unharmed. Should you deign to show compassion, we would look up in reverence to your sacred grace.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 372,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.220566987991333,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上洞渊北帝天蓬护命消灾神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "於是，天尊欢喜，答曰：善哉，善哉。 子之所请，亦为至要。 吾愍一切众生，如母念子。 今当为说，汝等谛听，坚持勿忘。 尔时，大众忻喜，一切听受。 天尊曰：往昔过去，人民淳朴，无有恶心。 任命短长，终其天寿，无有夭枉，鬼不横伤。 但今来时代浇薄，人心破坏，更相疑惑。 互为彼此，不信正法，唯有邪行。 背真向伪，不正於道。 违天逆地，攻根伐本。 不忠不孝，无慈愍心。 欺诱万民，酷虐百姓。 杀戮众生，残害物命。 结诸冤对，无量无边。 致使今生男女，动见患难。 或为劫贼之所伤害。 或为恶鬼之所加害。 或官私口舌，无故灭身。 或蛇虺虎狼、百虫毒螫之所害伤。 或官厄之灾，无故横生，闭在牢狱，鞭杖屠刑。 或复家遭瘟疾，身染毒气，大小疾病，人口死亡，六亲断绝，骨肉离散。 诸余此等，盖缘三天炁绝，六天炁行。 人鬼不分，邪正未别。 所以有幽囚之气，惨怛之气，邪魅之气，妖淫之气，妄侵生人，传成疫疠。 於是，幽囚之气，自一而生，从北而起。 一以生二，惨怛相仍。 二以生三，邪魅功伐。",
      "translated_text": "Then the Celestial Worthy rejoiced and replied: \"Excellent, excellent. What you have requested is indeed of utmost importance. I pity all sentient beings as a mother cherishes her child. Now I shall expound it—listen carefully, hold fast, and never forget.\"\n\nAt that moment, the great assembly rejoiced and received the teaching with reverence.\n\nThe Celestial Worthy said: \"In the distant past, people were simple and guileless, free from malice. They accepted their fate, whether long or short, and fulfilled their allotted years without premature death or unjust harm; no ghosts inflicted violence upon them. But in this later age, the world has grown shallow and hearts have turned corrupt. People sow mutual suspicion, each deceiving the other, rejecting the true Dharma and embracing only perverse conduct. They turn their backs on reality and chase after falsehood, straying from the Dao. They defy Heaven and rebel against Earth, severing their roots and felling their foundations. They are neither loyal nor filial, devoid of compassion. They deceive the multitudes, oppress the common folk, slaughter living beings, and destroy lives. Thus, they accumulate boundless karmic grievances. As a result, men and women of this generation constantly encounter misfortunes: some fall prey to bandits, others are harmed by malevolent ghosts; some perish without cause due to official or private slander; others are wounded by serpents, tigers, wolves, or venomous creatures. Some suffer unjust official calamities, imprisoned without reason, subjected to whips, cudgels, or execution. Others see their households ravaged by pestilence, their bodies afflicted by noxious qi, their families stricken with illness, their kin perishing, their loved ones scattered and lost. All such miseries arise because the qi of the Three Heavens has waned while the qi of the Six Heavens prevails. The realms of humans and ghosts are no longer distinct, and the boundaries between the perverse and the upright have blurred. Thus, the qi of imprisonment, the qi of sorrow, the qi of demonic possession, and the qi of licentiousness assail the living, spreading plagues and epidemics.\n\nNow, the qi of imprisonment arises first, emerging from the north. From one it generates two, and sorrow follows in its wake. From two it generates three, and demonic forces wage their assault.\"",
      "overlap_context": "the weight of your grace. We only beseech your mercy to further reveal a method for future men and women to defend their bodies and protect their lives, that they may be spared the three calamities and nine perils of this world, the five pestilences and seven afflictions, the poisons of illness and noxious qi, the host of demonic specters, and all manner of dire misfortunes. May their lives remain unharmed. Should you deign to show compassion, we would look up in reverence to your sacred grace.”",
      "start_char": 372,
      "end_char": 781,
      "start_sentence": 21,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.237052917480469,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上洞渊北帝天蓬护命消灾神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "肾衰心耗，肺绝肝枯。 黄云不凝，黑白相背。 六天邪魔，故来侵害。 八部鬼神，妄来绝灭。 欲得开度，当知六天门名，持天蓬大咒。 正心定念，微妙思惟。 见诸大神，始绝故气。 身安神泰，自此而生。 门户兴隆，自此而致。 於是，玉音振发，显说六天宫名。 第一宫名，休明总灵洞天宫。 第二宫名，元司重正宗灵天官。 第三宫名，统仙升灵希搜天宫。 第四宫名，正真邵灵搜司天官。 第五宫名，云楼玉纪明元天宫。 第六宫名，崇灵赤映云曲天官。 如是天宫，在北方壬癸之山，罗酆之境。 北阴神君，总统其上。 旁列宫室，鬼神所司。 内奉六天阴阳纲纪，外制六天罗邓幽境。 赏功罚罪，无失毫分。 一念正真，六宫善开。 一念邪欲，六宫恶开。 虽是邪气流行，亦自人心所召。 斩灭恶根，当须静心。 持念六天门名，北向稽首，神灵钦从，不敢肆害。 尔时，广善童子与诸大众，闻是说已，心大惧喜。 再进作礼，上白天尊：臣等静悟道缘，已经累劫。 但知奉行道念，收敛一心，下观人间。 每念疠疫，苦害生人。 颠倒沈迷，无有解脱。 虽切哀愍，不知有如是因缘，如是厉气，肆毒世间。 今蒙开谕，旷劫未闻。 生世种亲，知有持守，知有皈向。 无边利益，仰戴元恩。 六天宫名，已铭金简。 天蓬大咒，静念听受。 尔时，天尊琼颜，妙感真念，遐张善哉。 广善大咒因缘，禁戒甚重。 吾今相付，实因愍念下方，开度群品。 若吾金口敷演，天地震肃，神灵拜迎，玉律自新，人天当庆。 於是左顾，勅左元真人於大有之庭，启紫阳云锦之笈，出是大咒，宣付法众。 广善童子得受大咒，心生踊跃，即於座中广声诵咏，咒曰：天蓬天蓬，九元煞童。 五丁都司，高刁北公。 七政八灵，太上浩凶。",
      "translated_text": "The kidneys wane and the heart is depleted; the lungs fail and the liver withers. Yellow clouds do not congeal, and black and white turn against each other. The demonic forces of the Six Heavens thus come to invade and harm. The eight legions of ghosts and spirits recklessly seek to annihilate. To attain deliverance, one must know the names of the Six Heavenly Gates and recite the Great Tianpeng Mantra. Rectify the mind, stabilize the thoughts, and contemplate with subtle wisdom. Only then will the great spirits appear, severing the old qi. Peace of body and tranquility of spirit arise therefrom. Prosperity of households and flourishing fortunes are thereby achieved.\n\nThereupon, the jade tones resonate, revealing the names of the Six Heavenly Palaces:\n\nThe first palace is named the Restful Brightness and All-Spirit Cavern Heavenly Palace.\nThe second palace is named the Primordial Controller of the Heavy and Upright Ancestral Spirit Heavenly Palace.\nThe third palace is named the Unifying Immortals Ascending Spirit and Rare Search Heavenly Palace.\nThe fourth palace is named the Upright and True Shao Spirit Search Controller Heavenly Palace.\nThe fifth palace is named the Cloud Terrace Jade Chronicle Bright Primordial Heavenly Palace.\nThe sixth palace is named the Revered Spirit Red Radiance Cloud Vale Heavenly Palace.\n\nThese heavenly palaces lie within the Ren and Gui mountains of the north, in the realm of Luofeng. The Northern Yin Spirit Lord governs over them. Flanking halls and chambers are administered by ghosts and spirits. Internally, they uphold the yin-yang principles of the Six Heavens; externally, they govern the dark boundaries of the Six Heavens’ Luo and Deng. Rewards for merit and punishments for transgressions are meted out without the slightest error.\n\nWith a single thought of upright truth, the six palaces open benevolently. With a single thought of perverse desire, the six palaces open malevolently. Though the qi of perversity flows unchecked, it is still summoned by the human heart. To sever the roots of evil, one must still the mind. Recite the names of the Six Heavenly Gates, bow to the north, and the divine spirits will revere and obey, daring not to inflict harm.\n\nAt that time, the Vastly Good Youth and the great assembly, having heard these words, were filled with both fear and joy. They stepped forward again, bowed, and addressed the Heavenly Worthy: \"We have silently awakened to the conditions of the Dao through countless kalpas. We have known only to uphold the念 of the Dao, gathering our minds into one, and gazing down upon the human realm. We have ever grieved over the plagues and epidemics that cruelly harm living beings, leaving them bewildered and sunk in delusion, without escape. Though we have deeply pitied them, we did not know of such causes and conditions, nor of such virulent qi wreaking havoc in the world. Today, we have received your illumination—truths unheard for kalpas untold. Living beings and their kin may now know what to uphold and where to turn. Boundless are the benefits; we reverently bear the primordial grace. The names of the Six Heavenly Palaces are now inscribed upon golden tablets. The Great Tianpeng Mantra we listen to in stillness, ready to receive.\"\n\nThereupon, the Heavenly Worthy’s jade countenance, moved by the subtle truth of the念, widely proclaimed, \"Excellent indeed!\" The causes and conditions of the Great Vastly Good Mantra are of the gravest prohibitions. I now entrust it to you truly out of compassion for those below, to deliver the multitudes. When my golden mouth expounds it, heaven and earth tremble in solemnity, divine spirits bow in reverence, the jade laws renew themselves, and humans and gods alike rejoice.\n\nThen, turning to the left, he commanded the Left Primordial Perfected One in the Court of the Great Possession to open the purple-sun cloud-brocade casket and produce the Great Mantra, bestowing it upon the assembly of dharma practitioners. The Vastly Good Youth, having received the Great Mantra, was filled with exultation. Immediately, from his seat, he intoned the mantra in a resonant voice:\n\nTianpeng, Tianpeng,\nNine Primordials, Slaying Youth.\nFive Ding Controllers,\nLofty Diao, Northern Lord.\nSeven Governances, Eight Spirits,\nSupreme Vastness, Mighty and Fierce.",
      "overlap_context": "x Heavens prevails. The realms of humans and ghosts are no longer distinct, and the boundaries between the perverse and the upright have blurred. Thus, the qi of imprisonment, the qi of sorrow, the qi of demonic possession, and the qi of licentiousness assail the living, spreading plagues and epidemics.\n\nNow, the qi of imprisonment arises first, emerging from the north. From one it generates two, and sorrow follows in its wake. From two it generates three, and demonic forces wage their assault.\"",
      "start_char": 781,
      "end_char": 1435,
      "start_sentence": 49,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.61744451522827,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上洞渊北帝天蓬护命消灾神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "长颅巨兽，手把帝锺。 素枭三神，严驾夔龙。 威剑神王，斩邪灭踪。 紫炁乘天，丹霞赫冲。 吞魔食鬼，横身饮风。 苍舌绿齿，四目老翁。 天丁力士，威南御凶。 天驺激戾，威北衔锋。 三十万兵，卫我九重。 劈尸千里，扫却不祥。 敢有小鬼，欲来见状。 镢天大斧，斩鬼五形。 炎帝烈血，北帝然骨。 四明破骸，天猷灭类。 神刀一下，万鬼自溃。 急急如北帝明威口勅律 令。 诵咒既已，大众方切，赞叹夙缘，庆幸得遇隐名。 俄顷之问，东方有诸大神，云霞散彩，乘空步虚。 或持旌节，或执戈矛，或踏八卦神龟，或持三天火印。 龙虎翊卫，钟鼓交呜，流光辉焕，径诣道场。 作诸法音，振响空界，旋绕道前，再拜恳请：臣等昧道清虚，禀生震地，阳刚受任，纯精结形，名号天蓬。 上辅玉帝，分司梵境。 下临泉渊，整队元皇。",
      "translated_text": "The long-skulled giant beast wields the Emperor’s bell.\nThe Three White Owl Spirits harness the stern-drawn Kui-dragon chariot.\nThe Mighty Sword Spirit-King severs evil and erases traces.\nPurple qi ascends to heaven; crimson clouds blaze and surge.\nDevouring demons, consuming ghosts, his body spans the winds.\nAzure tongue, green teeth, the Four-Eyed Old Man.\nHeavenly Ding warriors, warding the south with awe to quell malice.\nHeavenly Couriers, fierce and swift, bearing blades to the north.\nThree hundred thousand troops guard my ninefold gates.\nSplit corpses for a thousand leagues, sweeping away all ill fortune.\nShould any petty ghost dare approach to witness this,\nthe Heaven-Splitting Great Axe hews its fivefold form.\nThe Fiery Emperor’s scorching blood, the Northern Emperor’s burning bones.\nThe Four Luminaries shatter its remains; the Heavenly Strategist annihilates its kind.\nOne stroke of the divine blade, and ten thousand ghosts scatter in rout.\nSwiftly, swiftly, as the Northern Emperor’s Luminous Might decrees by oral command!\n\nThe recitation now complete, the great assembly pressed close, praising their karmic affinity and rejoicing in their encounter with this hidden name. In an instant, from the east came hosts of great deities, clouds and radiance scattering their hues as they tread the void through empty space. Some bore banners and regalia, some grasped halberds and spears; some trod upon the Eight Trigrams’ divine tortoise, some held the Three Heavens’ Fire Seal. Dragons and tigers flanked them as escorts; bells and drums resounded in unison. Streaming light blazed brilliantly as they made straight for the ritual arena. Emitting manifold dharma-sounds, their voices shook the vault of heaven. Circling before the Dao altar, they bowed twice and entreated earnestly: “We, benighted in the pure emptiness of the Dao, received life in the Thunderclap Realm of the East. Endowed with yang’s vigor, our forms coalesced from pure essence, and our name and title is Tianpeng. Above, we assist the Jade Emperor, administering the Brahma-realm; below, we descend to the abyssal springs, marshaling the hosts of the Primordial August One.”",
      "overlap_context": "ne in the Court of the Great Possession to open the purple-sun cloud-brocade casket and produce the Great Mantra, bestowing it upon the assembly of dharma practitioners. The Vastly Good Youth, having received the Great Mantra, was filled with exultation. Immediately, from his seat, he intoned the mantra in a resonant voice:\n\nTianpeng, Tianpeng,\nNine Primordials, Slaying Youth.\nFive Ding Controllers,\nLofty Diao, Northern Lord.\nSeven Governances, Eight Spirits,\nSupreme Vastness, Mighty and Fierce.",
      "start_char": 1435,
      "end_char": 1758,
      "start_sentence": 94,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.651297092437744,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上洞渊北帝天蓬护命消灾神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "总制六天，惟以诚毒为专。 何缘今日，红光满空，照耀广宇，飞扬隐字，下及小臣所部之域。 臣等惊怖，未省所因。 是以寻光上诣，愿求开释。 天尊肯首，趋徐而答：善哉大将，阴阳结气，男女媾精。 有生道，有死道，有人道，有鬼道。 生则成人，死则成鬼。 生死殊途，性理惟一。 盖因造作，报应不同。 吾与诸天童子，演说威禁科要，论次生死因缘。 见诸世间，六天浸毒，邪气流行。 正道不生，邪念永结。 沦沈苦海，流浪爱河。 一神所亏，百邪侵克。 五神颠倒，三宫闭塞。 五帝不游，尘埃灵宅。 肌肉不生，魂神考责。 疾病缠绵，痛毒难忍。 是可悲哀，推心悯恻。 惟汝诸神，辅卫北帝。 威能伏众，威能荡邪。 立地安天，有大功德。 是以泄万劫之禁，宣付真讳。 告诸童子，流传世间，永令持诵。 假汝威德，下降弃贤。 降伏众魔，消荡祆凶，扫诸秽毒，保令清肃。 汝今部从，既到道场，更当付嘱，世间男女。 淫欲缠缚，杀害拘囚。 妄想贪生，爱恶自贼。 殊不知，妄从真出，真自妄移。 一妄既生，万祆纵孽。 吾今委付，汝当分别，摄邪归正，用正降邪。 凡诸世间，若有善男子善女人，遭阳九百六之灾，三衰八难九横五苦之厄。 精邪毒气，疫疠屯殃。 诵大神咒，汝当寻声赴感，救度衰危，使致康宁，保终天年，辅道行化。 是时、广善童子，仰闻天尊，付嘱至重。 即於座中再拜而起，敷白四众：天蓬大将，亲奉慈颜，神念敷陈，威德广备。 有是神力，能度众生。 我等同闻，实深庆幸。 若人启请，而说颂曰： 稽首皈命天蓬将，摧碎群魔大力神。 严驾夔龙降道场，赫弈威光动天地。 二十八宿明星主，三十六部大神王。 手持神剑斩妖邪，掌握宝印戮精魅。 镢斧劈破诸地狱，帝钟摇振彻天宫。 飞雷掣电走风云，巨大甲卒持戈戟。 南斗火官除毒害，北帝水神灭灾殃。 降伏六天大鬼王，扫荡十方诸疫气。 忿怒日月失精光，呼吸山河皆鼎沸。 紫气乘天下徘徊，三十万兵密加备。 尔时，说颂既毕。 天乐玄音，空中自振，飞花散香。 无量数众与天蓬大将部从威神，各各稽首大道，几前同声赞咏。 慈云广布，惠泽遐宣。 誓愿流传，化度群品。 作礼奉辞而退。 太上洞渊北帝天蓬护命消灾神咒妙经竟",
      "translated_text": "The Six Heavens are governed solely by the principle of *sincere venom*. Yet how is it that today, crimson light fills the sky, illuminating the vast universe, its radiance bearing hidden scriptures that descend even to the domains under this humble minister’s command? We, struck with awe and dread, cannot fathom the cause. Thus, we have followed the light upward to seek enlightenment.\n\nThe Heavenly Venerable nodded and replied slowly: “Excellent, great general! From the union of yin and yang, qi coalesces; from the commingling of male and female, essence is conceived. There is the Dao of life, the Dao of death, the Dao of humans, the Dao of ghosts. Life gives rise to humanity; death gives rise to ghosts. Though the paths of life and death diverge, the nature of principle remains one. Yet through creation and action, karmic retribution varies.\n\nI, together with the divine youths of the heavens, expound the essentials of the *Vajra Prohibitions*, discoursing on the causes and conditions of life and death. We see that throughout the world, the Six Heavens are steeped in poison, and perverse qi flows unchecked. The true Dao does not arise; wayward thoughts take root forever. Beings sink into the sea of suffering, adrift upon the river of craving. When one spirit falters, a hundred evils assail; the five spirits become inverted, the three palaces blocked. The Five Emperors no longer traverse their abodes, and the sacred dwelling is choked with dust. Flesh and muscle wither, while hun and shen are tormented and interrogated. Illness lingers, and the pain of poison is unbearable. This is truly lamentable, stirring the depths of compassion.\n\nOnly you, the gods, assist and guard the Northern Emperor. Your might subdues the multitudes; your power dispels evil. You stabilize heaven and earth, accruing great merit and virtue. Thus, I reveal the prohibitions of ten thousand kalpas and bestow the true tabooed name. I instruct the divine youths to transmit it throughout the world, that it may be recited forever. By your awe-inspiring virtue, descend to cast aside the unworthy. Subdue all demons, dispel inauspicious omens, sweep away all filth and poison, and ensure purity and solemnity.\n\nNow that your retinue has arrived at the ritual arena, I further entrust you with this charge for the men and women of the world: bound by lust, imprisoned by killing, fettered by false thoughts, and self-harming through love and aversion. They do not realize that delusion arises from truth, and truth shifts through delusion. Once a single delusion is born, ten thousand evils flourish unchecked.\n\nI now commission you to discern and rectify this: gather the perverse and return them to the true, using the true to suppress the perverse. Throughout the world, if there are good men and good women who suffer the calamities of the *Nine Nines and Sixes*, the *Three Declines, Eight Difficulties, Nine Obstructions, and Five Sufferings*—beset by malevolent qi, epidemics, and accumulated misfortunes—let them recite the great divine incantation. You shall follow the sound to respond to their pleas, rescuing them from peril, restoring them to health, preserving their allotted lifespan, and aiding the spread of the Dao.\n\nAt that moment, the Vastly Good Divine Youth, having heard the Heavenly Venerable’s weighty commission, rose from his seat, bowed twice, and addressed the assembly: “The Heavenly Peng General has personally received the compassionate countenance of the Heavenly Venerable. His divine thoughts are expounded, and his awe-inspiring virtue is fully prepared. Possessing such divine power, he can deliver all beings. We, having heard this together, are deeply fortunate.\n\nWhen one invokes him, let them recite this hymn of praise:\n*We bow our heads and take refuge in the Heavenly Peng General,*\n*The mighty divine one who crushes hordes of demons.*\n*His majestic chariot, drawn by dragons, descends to the ritual arena;*\n*His blazing radiance shakes heaven and earth.*\n*Lord of the twenty-eight lunar mansions and bright stars,*\n*King of the thirty-six divisions of great gods.*\n*Wielding a divine sword to slay demons and evil spirits,*\n*Grasping the sacred seal to smite spectral fiends.*\n*With his hoe-axe, he cleaves open the hells;*\n*The imperial bell he shakes resounds through the celestial palace.*\n*Lightning flashes and thunder rolls, winds and clouds surge;*\n*His vast armored hosts brandish halberds and spears.*\n*The Southern Dipper’s Fire Officials purge poison and harm;*\n*The Northern Emperor’s Water Gods extinguish disasters and misfortunes.*\n*Subduing the great demon kings of the Six Heavens,*\n*Sweeping away the epidemic qi of the ten directions.*\n*In his wrath, the sun and moon lose their brilliance;*\n*At his breath, mountains and rivers boil.*\n*Purple qi rides the heavens, circling below;*\n*Three hundred thousand troops stand in silent readiness.*\n\nWhen the recitation of the hymn was complete, celestial music and mysterious tones resonated spontaneously in the void, while flowers rained down and incense wafted through the air. The countless hosts, along with the Heavenly Peng General’s retinue of divine warriors, each bowed their heads to the Great Dao and joined their voices in praise. Benevolent clouds spread widely, bestowing grace afar. They vowed to transmit this teaching, transforming and delivering all beings. Having paid their respects, they took their leave.\n\nThus concludes the *Wondrous Scripture of the Heavenly Venerable of the Northern Depths, the Heavenly Peng, Protector of Life and Dispeller of Disasters*.",
      "overlap_context": "manifold dharma-sounds, their voices shook the vault of heaven. Circling before the Dao altar, they bowed twice and entreated earnestly: “We, benighted in the pure emptiness of the Dao, received life in the Thunderclap Realm of the East. Endowed with yang’s vigor, our forms coalesced from pure essence, and our name and title is Tianpeng. Above, we assist the Jade Emperor, administering the Brahma-realm; below, we descend to the abyssal springs, marshaling the hosts of the Primordial August One.”",
      "start_char": 1758,
      "end_char": 2632,
      "start_sentence": 118,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.21130108833313,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上洞渊北帝天蓬护命消灾神咒妙经.txt",
        "category": "本文类"
      }
    }
  ]
}