{
  "source_id": "太上洞玄灵宝三元无量寿经",
  "source_file": "chunked_daozang\\太上洞玄灵宝三元无量寿经.json",
  "total_chunks": 5,
  "total_original_chars": 5550,
  "total_translated_chars": 30992,
  "total_translation_time": 96.05579543113708,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元无量寿经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Wondrous Treasure Scripture of the Three Primes and Boundless Longevity of the Supreme Cavern Mystery**\n\nAt that time, the Supreme Dao Lord was expounding the Dao in a great assembly within the Palace of the Three Primes. Among the assembly was a perfected one named Yike, whose wisdom and fearlessness were boundless. Rising from his seat, he approached with dignified steps, knelt, and inquired of the essential teachings: \"I do not yet understand—from whence do all dharmas arise? And once arisen, how may one cultivate contemplative practice to attain the Dao?\"\n\nHaving spoken thus, he stood solemnly.\n\nThe Supreme Dao Lord stroked the table and smiled faintly, saying: \"All dharmas of the Three Realms arise from the Dao. If you seek the Dao, you must cultivate contemplative wisdom. As contemplative wisdom grows, you gradually approach the Eternal Dao. The Eternal Dao is boundless, and its practices are not singular. If you wish to know them, listen with single-minded focus—there are dozens of matters beyond reckoning.\n\nWhat are these dozens of matters?\n\nFirst, the method of wisdom in distant bodily conduct is beyond reckoning.\nSecond, the method of compassion in distant bodily conduct is beyond reckoning.\nThird, the method of forbearance in distant bodily conduct is beyond reckoning.\nFourth, the method of meritorious action in distant bodily conduct is beyond reckoning.\nFifth, the method of cultivating the mind in distant bodily conduct is beyond reckoning.\nSixth, the method of virtuous karma in distant bodily conduct is beyond reckoning.\nSeventh, the method of diligent progress in distant bodily conduct is beyond reckoning.\nEighth, the method of adorning the body in distant bodily conduct is beyond reckoning.\nNinth, the method of dispelling attachments in distant bodily conduct is beyond reckoning.\nTenth, the method of universal mind in distant bodily conduct is beyond reckoning.\nThese are the ten methods of distant bodily conduct.\n\nThe Supreme Lord said: There are also ten methods for avoiding transgressions of speech, beyond reckoning.\n\nWhat are the ten methods for avoiding transgressions of speech?\n\nFirst, the method of wisdom in avoiding transgressions of speech is beyond reckoning.\nSecond, the method of compassion in avoiding transgressions of speech is beyond reckoning.\nThird, the method of forbearance in avoiding transgressions of speech is beyond reckoning.\nFourth, the method of meritorious action in avoiding transgressions of speech is beyond reckoning.\nFifth, the method of cultivating the mind in avoiding transgressions of speech is beyond reckoning.\nSixth, the method of virtuous karma in avoiding transgressions of speech is beyond reckoning.\nSeventh, the method of diligent progress in avoiding transgressions of speech is beyond reckoning.\nEighth, the method of adorning the body in avoiding transgressions of speech is beyond reckoning.\nNinth, the method of dispelling attachments in avoiding transgressions of speech is beyond reckoning.\nTenth, the method of universal mind in avoiding transgressions of speech is beyond reckoning.\nThese are the ten methods for avoiding transgressions of speech.\n\nThe Supreme Lord said: There are also ten methods for eliminating evil thoughts, beyond reckoning.\n\nWhat are the ten methods for eliminating evil thoughts?\n\nFirst, the method of wisdom in eliminating evil thoughts is beyond reckoning.\nSecond, the method of compassion in eliminating evil thoughts is beyond reckoning.\nThird, the method of forbearance in eliminating evil thoughts is beyond reckoning.\nFourth, the method of meritorious action in eliminating evil thoughts is beyond reckoning.\nFifth, the method of cultivating the mind in eliminating evil thoughts is beyond reckoning.\nSixth, the method of virtuous karma in eliminating evil thoughts is beyond reckoning.\nSeventh, the method of diligent progress in eliminating evil thoughts is beyond reckoning.\nEighth, the method of adorning the body in eliminating evil thoughts is beyond reckoning.\nNinth, the method of dispelling attachments in eliminating evil thoughts is beyond reckoning.\nTenth, the method of universal mind in eliminating evil thoughts is beyond reckoning.\nThese are the ten methods for eliminating evil thoughts.\n\nThe Supreme Lord said: There are also ten methods for uprooting the roots of bondage, beyond reckoning.\n\nWhat are the ten methods for uprooting the roots of bondage?\n\nFirst, the method of wisdom in uprooting the roots of bondage is beyond reckoning.\nSecond, the method of compassion in uprooting the roots of bondage is beyond reckoning.\nThird, the method of forbearance in uprooting the roots of bondage is beyond reckoning.\nFourth, the method of meritorious action in uprooting the roots of bondage is beyond reckoning.\nFifth, the method of cultivating the mind in uprooting the roots of bondage is beyond reckoning.\nSixth, the method of virtuous karma in uprooting the roots of bondage is beyond reckoning.\nSeventh, the method of diligent progress in uprooting the roots of bondage is beyond reckoning.\nEighth, the method of adorning the body in uprooting the roots of bondage is beyond reckoning.\nNinth, the method of dispelling attachments in uprooting the roots of bondage is beyond reckoning.\nTenth, the method of universal mind in uprooting the roots of bondage is beyond reckoning.\nThese are the ten methods for uprooting the roots of bondage.\n\nThe Supreme Lord said: There are also ten methods for severing sound and form, beyond reckoning.\n\nWhat are the ten methods for severing sound and form?\n\nFirst, the method of wisdom in severing sound and form is beyond reckoning.\nSecond, the method of compassion in severing sound and form is beyond reckoning.\nThird, the method of forbearance in severing sound and form is beyond reckoning.\nFourth, the method of meritorious action in severing sound and form is beyond reckoning.\nFifth, the method of cultivating the mind in severing sound and form is beyond reckoning.\nSixth, the method of virtuous karma in severing sound and form is beyond reckoning.\nSeventh, the method of diligent progress in severing sound and form is beyond reckoning.\nEighth, the method of adorning the body in severing sound and form is beyond reckoning.\nNinth, the method of dispelling attachments in severing sound and form is beyond reckoning.\nTenth, the method of universal mind in severing sound and form is beyond reckoning.\nThese are the ten methods for satiating sound and form.\n\nThe Supreme Lord said: There are also ten methods for restraining desire and attachment, which may be reckoned.\n\nWhat are the ten methods for restraining desire and attachment?\n\nFirst, the method of wisdom in restraining desire and attachment is beyond reckoning.\nSecond, the method of compassion in restraining desire and attachment is beyond reckoning.\nThird, the method of forbearance in restraining desire and attachment is beyond reckoning.\nFourth, the method of meritorious action in restraining desire and attachment is beyond reckoning.\nFifth, the method of cultivating the mind in restraining desire and attachment is beyond reckoning.\n\nSixth, the method of meritorious action in restraining desire and attachment is beyond reckoning.\nSeventh, the method of diligence in restraining desire and attachment is beyond reckoning.\nEighth, the method of adorning the body in restraining desire and attachment is beyond reckoning.\nNinth, the method of dispelling emotions in restraining desire and attachment is beyond reckoning.\nTenth, the method of universal mind in restraining desire and attachment is beyond reckoning.\nThese are the ten methods for restraining desire and attachment.\n\nThe Supreme Lord said: There are also ten methods for releasing and cultivating habits, which are beyond reckoning.\n\nWhat are the ten methods for releasing and cultivating habits?\n\nFirst, the method of wisdom in releasing and cultivating habits is beyond reckoning.\nSecond, the method of compassion in releasing and cultivating habits is beyond reckoning.\nThird, the method of forbearance in releasing and cultivating habits is beyond reckoning.\nFourth, the method of meritorious action in releasing and cultivating habits is beyond reckoning.\nFifth, the method of cultivating the mind in releasing and cultivating habits is beyond reckoning.\nSixth, the method of meritorious action in releasing and cultivating habits is beyond reckoning.\nSeventh, the method of diligence in releasing and cultivating habits is beyond reckoning.\nEighth, the method of adorning the body in releasing and cultivating habits is beyond reckoning.\nNinth, the method of dispelling emotions in releasing and cultivating habits is beyond reckoning.\nTenth, the method of universal mind in releasing and cultivating habits is beyond reckoning.\nThese are the ten methods for releasing and cultivating habits.\n\nThe Supreme Lord said: There are also ten methods for washing away defilements, which are beyond reckoning.\n\nWhat are the ten methods for washing away defilements?\n\nFirst, the method of wisdom in washing away defilements is beyond reckoning.\nSecond, the method of compassion in washing away defilements is beyond reckoning.\nThird, the method of forbearance in washing away defilements is beyond reckoning.\nFourth, the method of meritorious action in washing away defilements is beyond reckoning.\nFifth, the method of cultivating the mind in washing away defilements is beyond reckoning.\nSixth, the method of meritorious action in washing away defilements is beyond reckoning.\nSeventh, the method of diligence in washing away defilements is beyond reckoning.\nEighth, the method of adorning the body in washing away defilements is beyond reckoning.\nNinth, the method of dispelling emotions in washing away defilements is beyond reckoning.\nTenth, the method of universal mind in washing away defilements is beyond reckoning.\nThese are the ten methods for washing away defilements.\n\nThe Supreme Lord said: There are also ten methods for being free from delusion, which are beyond reckoning.\n\nWhat are the ten methods for being free from delusion?\n\nFirst, the method of wisdom in being free from delusion is beyond reckoning.\nSecond, the method of compassion in being free from delusion is beyond reckoning.\nThird, the method of forbearance in being free from delusion is beyond reckoning.\nFourth, the method of meritorious action in being free from delusion is beyond reckoning.\nFifth, the method of cultivating the mind in being free from delusion is beyond reckoning.\nSixth, the method of meritorious action in being free from delusion is beyond reckoning.\nSeventh, the method of diligence in being free from delusion is beyond reckoning.\nEighth, the method of adorning the body in being free from delusion is beyond reckoning.\nNinth, the method of dispelling emotions in being free from delusion is beyond reckoning.\nTenth, the method of universal mind in being free from delusion is beyond reckoning.\nThese are the ten methods for being free from delusion.\n\nThe Supreme Lord said: There are also ten methods for being free from lustful thoughts, which are beyond reckoning.\n\nWhat are the ten methods for being free from lustful thoughts?\n\nFirst, the method of wisdom in being free from lustful thoughts is beyond reckoning.\nSecond, the method of compassion in being free from lustful thoughts is beyond reckoning.\nThird, the method of forbearance in being free from lustful thoughts is beyond reckoning.\nFourth, the method of meritorious action in being free from lustful thoughts is beyond reckoning.\nFifth, the method of cultivating the mind in being free from lustful thoughts is beyond reckoning.\nSixth, the method of meritorious action in being free from lustful thoughts is beyond reckoning.\nSeventh, the method of diligence in being free from lustful thoughts is beyond reckoning.\nEighth, the method of adorning the body in being free from lustful thoughts is beyond reckoning.\nNinth, the method of dispelling emotions in being free from lustful thoughts is beyond reckoning.\nTenth, the method of universal mind in being free from lustful thoughts is beyond reckoning.\nThese are the ten methods for being free from lustful thoughts.\n\nThe Supreme Lord said: There are also ten methods for being free from doubt about emptiness, which are beyond reckoning.\n\nWhat are the ten methods for being free from doubt about emptiness?\n\nFirst, the method of wisdom in being free from doubt about emptiness is beyond reckoning.\nSecond, the method of compassion in being free from doubt about emptiness is beyond reckoning.\nThird, the method of forbearance in being free from doubt about emptiness is beyond reckoning.\nFourth, the method of meritorious action in being free from doubt about emptiness is beyond reckoning.\nFifth, the method of cultivating the mind in being free from doubt about emptiness is beyond reckoning.\nSixth, the method of meritorious action in being free from doubt about emptiness is beyond reckoning.\nSeventh, the method of diligence in being free from doubt about emptiness is beyond reckoning.\nEighth, the method of adorning the body in being free from doubt about emptiness is beyond reckoning.\nNinth, the method of dispelling emotions in being free from doubt about emptiness is beyond reckoning.\nTenth, the method of universal mind in being free from doubt about emptiness is beyond reckoning.\nThese are the ten methods for being free from doubt about emptiness.\n\nThe Supreme Lord said: There are also ten methods for equalizing beauty and ugliness, which are beyond reckoning.\n\nWhat are the ten methods for equalizing beauty and ugliness?\n\nFirst, the method of wisdom in equalizing beauty and ugliness is beyond reckoning.\nSecond, the method of compassion in equalizing beauty and ugliness is beyond reckoning.\nThird, the method of forbearance in equalizing beauty and ugliness is beyond reckoning.\nFourth, the method of meritorious action in equalizing beauty and ugliness is beyond reckoning.\nFifth, the method of cultivating the mind in equalizing beauty and ugliness is beyond reckoning.\nSixth, the method of meritorious action in equalizing beauty and ugliness is beyond reckoning.\nSeventh, the method of diligence in equalizing beauty and ugliness is beyond reckoning.\nEighth, the method of adorning the body in equalizing beauty and ugliness is beyond reckoning.\nNinth, the method of dispelling emotions in equalizing beauty and ugliness is beyond reckoning.\nTenth, the method of universal mind in equalizing beauty and ugliness is beyond reckoning.\nThese are the ten methods for equalizing beauty and ugliness.\n\nThe Supreme Lord said: There are also ten methods for not returning to depravity, which are beyond reckoning.\n\nWhat are the ten methods for not returning to depravity?\n\nFirst, the method of wisdom in not returning to depravity is beyond reckoning.\nSecond, the method of compassion in not returning to depravity is beyond reckoning.\nThird, the method of forbearance in not returning to depravity is beyond reckoning.\n\nThird, the method of forbearance in not returning to depravity is beyond reckoning.\nFourth, the method of meritorious action in not returning to depravity is beyond reckoning.\nFifth, the method of cultivating the mind in not returning to depravity is beyond reckoning.\nSixth, the method of virtuous karma in not returning to depravity is beyond reckoning.\nSeventh, the method of diligence in not returning to depravity is beyond reckoning.\nEighth, the method of adorning the body in not returning to depravity is beyond reckoning.\nNinth, the method of dispelling emotions in not returning to depravity is beyond reckoning.\nTenth, the method of universal mind in not returning to depravity is beyond reckoning.\nThese are the ten methods for not returning to depravity.\n\nThe Supreme Lord said: There are also ten methods for abiding in constancy, which are beyond reckoning.\n\nWhat are the ten methods for abiding in constancy?\n\nFirst, the method of wisdom in abiding in constancy is beyond reckoning.\nSecond, the method of compassion in abiding in constancy is beyond reckoning.\nThird, the method of forbearance in abiding in constancy is beyond reckoning.\nFourth, the method of meritorious action in abiding in constancy is beyond reckoning.\nFifth, the method of cultivating the mind in abiding in constancy is beyond reckoning.\nSixth, the method of virtuous karma in abiding in constancy is beyond reckoning.\nSeventh, the method of diligence in abiding in constancy is beyond reckoning.\nEighth, the method of adorning the body in abiding in constancy is beyond reckoning.\nNinth, the method of dispelling emotions in abiding in constancy is beyond reckoning.\nTenth, the method of universal mind in abiding in constancy is beyond reckoning.\nThese are the ten methods for abiding in constancy.\n\nThe Supreme Lord said: There are also ten methods for severing deluded thoughts, which are beyond reckoning.\n\nWhat are the ten methods for severing deluded thoughts?\n\nFirst, the method of wisdom in severing deluded thoughts is beyond reckoning.\nSecond, the method of compassion in severing deluded thoughts is beyond reckoning.\nThird, the method of forbearance in severing deluded thoughts is beyond reckoning.\nFourth, the method of meritorious action in severing deluded thoughts is beyond reckoning.\nFifth, the method of cultivating the mind in severing deluded thoughts is beyond reckoning.\nSixth, the method of virtuous karma in severing deluded thoughts is beyond reckoning.\nSeventh, the method of diligence in severing deluded thoughts is beyond reckoning.\nEighth, the method of adorning the body in severing deluded thoughts is beyond reckoning.\nNinth, the method of dispelling emotions in severing deluded thoughts is beyond reckoning.\nTenth, the method of universal mind in severing deluded thoughts is beyond reckoning.\nThese are the ten methods for severing deluded thoughts.\n\nThe Supreme Lord said: There are also ten methods for perfecting the will, which are beyond reckoning.\n\nWhat are the ten methods for perfecting the will?\n\nFirst, the method of wisdom in perfecting the will is beyond reckoning.\nSecond, the method of compassion in perfecting the will is beyond reckoning.\nThird, the method of forbearance in perfecting the will is beyond reckoning.\nFourth, the method of meritorious action in perfecting the will is beyond reckoning.\nFifth, the method of cultivating the mind in perfecting the will is beyond reckoning.\nSixth, the method of virtuous karma in perfecting the will is beyond reckoning.\nSeventh, the method of diligence in perfecting the will is beyond reckoning.\nEighth, the method of adorning the body in perfecting the will is beyond reckoning.\nNinth, the method of dispelling emotions in perfecting the will is beyond reckoning.\nTenth, the method of universal mind in perfecting the will is beyond reckoning.\nThese are the ten methods for perfecting the will.\n\nThe Supreme Lord said: There are also ten methods for skillfully guarding speech, which are beyond reckoning.\n\nWhat are the ten methods for skillfully guarding speech?\n\nFirst, the method of wisdom in skillfully guarding speech is beyond reckoning.\nSecond, the method of compassion in skillfully guarding speech is beyond reckoning.\nThird, the method of forbearance in skillfully guarding speech is beyond reckoning.\nFourth, the method of meritorious action in skillfully guarding speech is beyond reckoning.\nFifth, the method of cultivating the mind in skillfully guarding speech is beyond reckoning.\nSixth, the method of virtuous karma in skillfully guarding speech is beyond reckoning.\nSeventh, the method of diligence in skillfully guarding speech is beyond reckoning.\nEighth, the method of adorning the body in skillfully guarding speech is beyond reckoning.\nNinth, the method of dispelling emotions in skillfully guarding speech is beyond reckoning.\nTenth, the method of universal mind in skillfully guarding speech is beyond reckoning.\nThese are the ten methods for skillfully guarding speech.\n\nThe Supreme Lord said: There are also ten methods for non-distraction, which are beyond reckoning.\n\nWhat are the ten methods for non-distraction?\n\nFirst, the method of wisdom in non-distraction is beyond reckoning.\nSecond, the method of compassion in non-distraction is beyond reckoning.\nThird, the method of forbearance in non-distraction is beyond reckoning.\nFourth, the method of meritorious action in non-distraction is beyond reckoning.\nFifth, the method of cultivating the mind in non-distraction is beyond reckoning.\nSixth, the method of virtuous karma in non-distraction is beyond reckoning.\nSeventh, the method of diligence in non-distraction is beyond reckoning.\nEighth, the method of adorning the body in non-distraction is beyond reckoning.\nNinth, the method of dispelling emotions in non-distraction is beyond reckoning.\nTenth, the method of universal mind in non-distraction is beyond reckoning.\nThese are the ten methods for non-distraction.\n\nThe Supreme Lord said: There are also ten methods for non-delusion, which are beyond reckoning.\n\nWhat are the ten methods for non-delusion?\n\nFirst, the method of wisdom in non-delusion is beyond reckoning.\nSecond, the method of compassion in non-delusion is beyond reckoning.\nThird, the method of forbearance in non-delusion is beyond reckoning.\nFourth, the method of meritorious action in non-delusion is beyond reckoning.\nFifth, the method of cultivating the mind in non-delusion is beyond reckoning.\nSixth, the method of virtuous karma in non-delusion is beyond reckoning.\nSeventh, the method of diligence in non-delusion is beyond reckoning.\nEighth, the method of adorning the body in non-delusion is beyond reckoning.\nNinth, the method of dispelling emotions in non-delusion is beyond reckoning.\nTenth, the method of universal mind in non-delusion is beyond reckoning.\nThese are the ten methods for non-delusion.\n\nThe Supreme Lord said: There are also ten methods for non-attachment, which are beyond reckoning.\n\nWhat are the ten methods for non-attachment? First, the method of wisdom in non-attachment is beyond reckoning. Second, the method of compassion in non-attachment is beyond reckoning. Third, the method of forbearance in non-attachment is beyond reckoning. Fourth, the method of meritorious action in non-attachment is beyond reckoning. Fifth, the method of cultivating the mind in non-attachment is beyond reckoning. Sixth, the method of virtuous karma in non-attachment is beyond reckoning. Seventh, the method of diligence in non-attachment is beyond reckoning. Eighth, the method of adorning the body in non-attachment is beyond reckoning. Ninth, the method of dispelling emotions in non-attachment is beyond reckoning. Tenth, the method of universal mind in non-attachment is beyond reckoning. These are the ten methods for non-attachment.\n\nThe Supreme Lord said: There are also ten methods for non-distraction, which are beyond reckoning.\n\nWhat are the ten methods for non-distraction? First, the method of wisdom in non-distraction is beyond reckoning. Second, the method of compassion in non-distraction is beyond reckoning. Third, the method of forbearance in non-distraction is beyond reckoning. Fourth, the method of meritorious action in non-distraction is beyond reckoning. Fifth, the method of cultivating the mind in non-distraction is beyond reckoning. Sixth, the method of virtuous karma in non-distraction is beyond reckoning. Seventh, the method of diligence in non-distraction is beyond reckoning. Eighth, the method of adorning the body in non-distraction is beyond reckoning. Ninth, the method of dispelling emotions in non-distraction is beyond reckoning. Tenth, the method of universal mind in non-distraction is beyond reckoning. These are the ten methods for non-distraction.\n\nThe Supreme Lord said: There are also ten methods for impermanence and stability, which are beyond reckoning.\n\nWhat are the ten methods for impermanence and stability? First, the method of wisdom in impermanence and stability is beyond reckoning. Second, the method of compassion in impermanence and stability is beyond reckoning. Third, the method of forbearance in impermanence and stability is beyond reckoning. Fourth, the method of meritorious action in impermanence and stability is beyond reckoning. Fifth, the method of cultivating the mind in impermanence and stability is beyond reckoning. Sixth, the method of virtuous karma in impermanence and stability is beyond reckoning. Seventh, the method of diligence in impermanence and stability is beyond reckoning. Eighth, the method of adorning the body in impermanence and stability is beyond reckoning. Ninth, the method of dispelling emotions in impermanence and stability is beyond reckoning. Tenth, the method of universal mind in impermanence and stability is beyond reckoning. These are the ten methods for impermanence and stability.\n\nThe Supreme Lord said: There are also ten methods for the impermanent, which are beyond reckoning.\n\nWhat are the ten methods for the impermanent? First, the method of wisdom in the impermanent is beyond reckoning. Second, the method of compassion in the impermanent is beyond reckoning. Third, the method of forbearance in the impermanent is beyond reckoning. Fourth, the method of meritorious action in the impermanent is beyond reckoning. Fifth, the method of cultivating the mind in the impermanent is beyond reckoning. Sixth, the method of virtuous karma in the impermanent is beyond reckoning. Seventh, the method of diligence in the impermanent is beyond reckoning. Eighth, the method of adorning the body in the impermanent is beyond reckoning. Ninth, the method of dispelling emotions in the impermanent is beyond reckoning. Tenth, the method of universal mind in the impermanent is beyond reckoning. These are the ten methods for the impermanent.\n\nThe Supreme Lord said: There are also ten methods for impermanence and contemplation, which are beyond reckoning.\n\nWhat are the ten methods for impermanence and contemplation? First, the method of wisdom in impermanence and contemplation is beyond reckoning. Second, the method of compassion in impermanence and contemplation is beyond reckoning. Third, the method of forbearance in impermanence and contemplation is beyond reckoning. Fourth, the method of meritorious action in impermanence and contemplation is beyond reckoning. Fifth, the method of cultivating the mind in impermanence and contemplation is beyond reckoning. Sixth, the method of virtuous karma in impermanence and contemplation is beyond reckoning. Seventh, the method of diligence in impermanence and contemplation is beyond reckoning. Eighth, the method of adorning the body in impermanence and contemplation is beyond reckoning. Ninth, the method of dispelling emotions in impermanence and contemplation is beyond reckoning. Tenth, the method of universal mind in impermanence and contemplation is beyond reckoning. These are the ten methods for impermanence and contemplation.\n\nThe Supreme Lord said: There are also ten methods for non-recollection, which are beyond reckoning.\n\nWhat are the ten methods for non-recollection? First, the method of wisdom in non-recollection is beyond reckoning. Second, the method of compassion in non-recollection is beyond reckoning. Third, the method of forbearance in non-recollection is beyond reckoning. Fourth, the method of meritorious action in non-recollection is beyond reckoning. Fifth, the method of cultivating the mind in non-recollection is beyond reckoning. Sixth, the method of virtuous karma in non-recollection is beyond reckoning. Seventh, the method of diligence in non-recollection is beyond reckoning. Eighth, the method of adorning the body in non-recollection is beyond reckoning. Ninth, the method of dispelling emotions in non-recollection is beyond reckoning. Tenth, the method of universal mind in non-recollection is beyond reckoning. These are the ten methods for non-recollection.\n\nThe Supreme Lord said: There are also ten methods for non-hesitation, which are beyond reckoning.\n\nWhat are the ten methods for non-hesitation? First, the method of wisdom in non-hesitation is beyond reckoning. Second, the method of compassion in non-hesitation is beyond reckoning. Third, the method of forbearance in non-hesitation is beyond reckoning. Fourth, the method of meritorious action in non-hesitation is beyond reckoning. Fifth, the method of cultivating the mind in non-hesitation is beyond reckoning. Sixth, the method of virtuous karma in non-hesitation is beyond reckoning. Seventh, the method of diligence in non-hesitation is beyond reckoning. Eighth, the method of adorning the body in non-hesitation is beyond reckoning. Ninth, the method of dispelling emotions in non-hesitation is beyond reckoning.\n\nTenth, the method of universal mind in non-hesitation is beyond reckoning.\nThese are the ten methods for non-hesitation.\n\nThe Most High said: There are also ten methods of forbearance for the unbearable, which are beyond reckoning.\nWhat are the ten methods of forbearance for the unbearable? First, the method of wisdom in forbearance for the unbearable is beyond reckoning. Second, the method of compassion in forbearance for the unbearable is beyond reckoning. Third, the method of endurance in forbearance for the unbearable is beyond reckoning. Fourth, the method of meritorious action in forbearance for the unbearable is beyond reckoning. Fifth, the method of cultivating the mind in forbearance for the unbearable is beyond reckoning. Sixth, the method of virtuous karma in forbearance for the unbearable is beyond reckoning. Seventh, the method of diligence in forbearance for the unbearable is beyond reckoning. Eighth, the method of adorning the body in forbearance for the unbearable is beyond reckoning. Ninth, the method of relinquishing emotions in forbearance for the unbearable is beyond reckoning. Tenth, the method of universal mind in forbearance for the unbearable is beyond reckoning.\nThese are the ten methods of forbearance for the unbearable.\n\nThe Dao says: The *Dongxuan Sutra* is the source of Heaven and Earth, the origin of the Dao and virtue, revered by the highest sages, and feared by ghosts and spirits. Its height reaches beyond the Nine Heavens, and its depth penetrates below the Nine Earths. Myriad transformations and infinite changes of the Dao are fully contained within it. If one can receive, uphold, read, and recite this sutra with an unwavering mind, they will attain boundless wisdom, accumulate boundless good causes, eradicate boundless karmic obstacles, dispel boundless afflictions, extend boundless lifespan, and expand boundless fields of merit. They will enjoy prosperity in every life and happiness in every rebirth. One must always revere it, copy it, and circulate it to benefit all beings—this is immeasurable. The perfected ones, upon hearing this, believe, accept, and practice it.\n\nThus concludes the *Taishang Dongxuan Lingbao Sanyuan Wuliangshou Jing*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝三元无量寿经 经名：太上洞玄灵宝三元无量寿经。 撰人不详，约出於南北朝或隋唐。 言修行观慧之法。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝三元无量寿经 尔时太上道君於三元宫中大会说法，众内有一真人名曰仪可，则智力无畏，从座而起，雅步前跪，谘论请诀：不审一切诸法，从何而生。 既得生已，云何观行而得成道。 作是语已，俨然而立。 太上道君抚几微笑曰：夫三界诸法，皆从道生，若欲求道，当修观慧。 观慧增益，渐至常道。 常道无边，行亦非一。 子欲知之，当一心听，有数十事，不可称量。 何谓为数十事。 一者智慧远身行法，不可称量。 二者慈悲远身行法，不可称量。 三者含忍远身行法，不可称量。 四者行功远身行法，不可称量。 五者修心远身行法，不可称量。 六者善业远身行法，不可称量。 七者精进波身行法，不可称量。 八者饰身远身行法，不可称量。 九者遣情远身行法，不可称量。 十者普心远身行法，不可称量。 是为十种远身行法。 太上曰：复有十种离口过法，不可称量。 何等为十种离口过法。 一者智慧离口过法，不可称量。 二者慈悲离口过法，不可称量。 三者含忍离口过法，不可称量。 四者行功离口过法，不可称量。 五者修心离口过法，不可称量。 六者善业离口过法，不可称量。 七者精进离口过法，不可称量。 八者饰身离口过法，不可称量。 九者遣情离口过法，不可称量。 十者普心离口过法，不可称量。 是为十种离口过法。 太上曰：复有十种除恶想法，不可称量。 何等为十种除恶想法。 一者智慧除恶想法，不可称量。 二者慈悲除恶想法，不可称量。 三者含忍除恶想法，不可称量。 四者行功除恶想法，不可称量。 五者修心除恶想法，不可称量。 六者善业除恶想法，不可称量。 七者精进除恶想法，不可称量。 八者饰身除恶想法，不可称量。 九者遣情除恶想法，不可称量。 十者普心除恶想法，不可称量。 是为十种除恶想法。 太上曰：复有十种拔逮根法，不可称量。 何等为十种拔逮根法。 一者智慧拔逮根法，不可称量。 二者慈悲拔逮根法，不可称量。 三者含忍拔逮根法，不可称量。 四者行功拔逮根法，不可称量。 五者修心拔逮根法，不可称量。 六者善业拔逮根法，不可称量。 七者精进拔逮根法，不可称量。 八者饰身拔逮根法，不可称量。 九者遣情拔逮根法，不可称量。 十者普心拔逮根法，不可称量。 是为十种拔逮根法。 太上曰：复有十种绝声色法，不可称量。 何等为十种绝声色法。 一者智慧绝声色法，不可称量。 二者慈悲绝声色法，不可称量。 三者含忍绝声色法，不可称量。 四者行功绝声色法，不可称量。 五者修心绝声色法，不可称量。 六者善业绝声色法，不可称量。 七者精进绝声色法，不可称量。 八者饰身绝声色法，不可称量。 九者遣情绝声色法，不可称量。 十者普心绝声色法，不可称量。 是为十种饱声色法。 太上曰：复有十种俭爱欲法，可称量。 何等为十种检爱欲法。 一者智慧俭爱欲法，不可称量。 二者慈悲俭爱欲法，不可称量。 三者含忍俭爱欲法，不可称量。 四者行功俭爱欲法，不可称量。 五者修心俭爱欲法，不可称量。",
      "translated_text": "**The Wondrous Treasure Scripture of the Three Primes and Boundless Longevity of the Supreme Cavern Mystery**\n\nAt that time, the Supreme Dao Lord was expounding the Dao in a great assembly within the Palace of the Three Primes. Among the assembly was a perfected one named Yike, whose wisdom and fearlessness were boundless. Rising from his seat, he approached with dignified steps, knelt, and inquired of the essential teachings: \"I do not yet understand—from whence do all dharmas arise? And once arisen, how may one cultivate contemplative practice to attain the Dao?\"\n\nHaving spoken thus, he stood solemnly.\n\nThe Supreme Dao Lord stroked the table and smiled faintly, saying: \"All dharmas of the Three Realms arise from the Dao. If you seek the Dao, you must cultivate contemplative wisdom. As contemplative wisdom grows, you gradually approach the Eternal Dao. The Eternal Dao is boundless, and its practices are not singular. If you wish to know them, listen with single-minded focus—there are dozens of matters beyond reckoning.\n\nWhat are these dozens of matters?\n\nFirst, the method of wisdom in distant bodily conduct is beyond reckoning.\nSecond, the method of compassion in distant bodily conduct is beyond reckoning.\nThird, the method of forbearance in distant bodily conduct is beyond reckoning.\nFourth, the method of meritorious action in distant bodily conduct is beyond reckoning.\nFifth, the method of cultivating the mind in distant bodily conduct is beyond reckoning.\nSixth, the method of virtuous karma in distant bodily conduct is beyond reckoning.\nSeventh, the method of diligent progress in distant bodily conduct is beyond reckoning.\nEighth, the method of adorning the body in distant bodily conduct is beyond reckoning.\nNinth, the method of dispelling attachments in distant bodily conduct is beyond reckoning.\nTenth, the method of universal mind in distant bodily conduct is beyond reckoning.\nThese are the ten methods of distant bodily conduct.\n\nThe Supreme Lord said: There are also ten methods for avoiding transgressions of speech, beyond reckoning.\n\nWhat are the ten methods for avoiding transgressions of speech?\n\nFirst, the method of wisdom in avoiding transgressions of speech is beyond reckoning.\nSecond, the method of compassion in avoiding transgressions of speech is beyond reckoning.\nThird, the method of forbearance in avoiding transgressions of speech is beyond reckoning.\nFourth, the method of meritorious action in avoiding transgressions of speech is beyond reckoning.\nFifth, the method of cultivating the mind in avoiding transgressions of speech is beyond reckoning.\nSixth, the method of virtuous karma in avoiding transgressions of speech is beyond reckoning.\nSeventh, the method of diligent progress in avoiding transgressions of speech is beyond reckoning.\nEighth, the method of adorning the body in avoiding transgressions of speech is beyond reckoning.\nNinth, the method of dispelling attachments in avoiding transgressions of speech is beyond reckoning.\nTenth, the method of universal mind in avoiding transgressions of speech is beyond reckoning.\nThese are the ten methods for avoiding transgressions of speech.\n\nThe Supreme Lord said: There are also ten methods for eliminating evil thoughts, beyond reckoning.\n\nWhat are the ten methods for eliminating evil thoughts?\n\nFirst, the method of wisdom in eliminating evil thoughts is beyond reckoning.\nSecond, the method of compassion in eliminating evil thoughts is beyond reckoning.\nThird, the method of forbearance in eliminating evil thoughts is beyond reckoning.\nFourth, the method of meritorious action in eliminating evil thoughts is beyond reckoning.\nFifth, the method of cultivating the mind in eliminating evil thoughts is beyond reckoning.\nSixth, the method of virtuous karma in eliminating evil thoughts is beyond reckoning.\nSeventh, the method of diligent progress in eliminating evil thoughts is beyond reckoning.\nEighth, the method of adorning the body in eliminating evil thoughts is beyond reckoning.\nNinth, the method of dispelling attachments in eliminating evil thoughts is beyond reckoning.\nTenth, the method of universal mind in eliminating evil thoughts is beyond reckoning.\nThese are the ten methods for eliminating evil thoughts.\n\nThe Supreme Lord said: There are also ten methods for uprooting the roots of bondage, beyond reckoning.\n\nWhat are the ten methods for uprooting the roots of bondage?\n\nFirst, the method of wisdom in uprooting the roots of bondage is beyond reckoning.\nSecond, the method of compassion in uprooting the roots of bondage is beyond reckoning.\nThird, the method of forbearance in uprooting the roots of bondage is beyond reckoning.\nFourth, the method of meritorious action in uprooting the roots of bondage is beyond reckoning.\nFifth, the method of cultivating the mind in uprooting the roots of bondage is beyond reckoning.\nSixth, the method of virtuous karma in uprooting the roots of bondage is beyond reckoning.\nSeventh, the method of diligent progress in uprooting the roots of bondage is beyond reckoning.\nEighth, the method of adorning the body in uprooting the roots of bondage is beyond reckoning.\nNinth, the method of dispelling attachments in uprooting the roots of bondage is beyond reckoning.\nTenth, the method of universal mind in uprooting the roots of bondage is beyond reckoning.\nThese are the ten methods for uprooting the roots of bondage.\n\nThe Supreme Lord said: There are also ten methods for severing sound and form, beyond reckoning.\n\nWhat are the ten methods for severing sound and form?\n\nFirst, the method of wisdom in severing sound and form is beyond reckoning.\nSecond, the method of compassion in severing sound and form is beyond reckoning.\nThird, the method of forbearance in severing sound and form is beyond reckoning.\nFourth, the method of meritorious action in severing sound and form is beyond reckoning.\nFifth, the method of cultivating the mind in severing sound and form is beyond reckoning.\nSixth, the method of virtuous karma in severing sound and form is beyond reckoning.\nSeventh, the method of diligent progress in severing sound and form is beyond reckoning.\nEighth, the method of adorning the body in severing sound and form is beyond reckoning.\nNinth, the method of dispelling attachments in severing sound and form is beyond reckoning.\nTenth, the method of universal mind in severing sound and form is beyond reckoning.\nThese are the ten methods for satiating sound and form.\n\nThe Supreme Lord said: There are also ten methods for restraining desire and attachment, which may be reckoned.\n\nWhat are the ten methods for restraining desire and attachment?\n\nFirst, the method of wisdom in restraining desire and attachment is beyond reckoning.\nSecond, the method of compassion in restraining desire and attachment is beyond reckoning.\nThird, the method of forbearance in restraining desire and attachment is beyond reckoning.\nFourth, the method of meritorious action in restraining desire and attachment is beyond reckoning.\nFifth, the method of cultivating the mind in restraining desire and attachment is beyond reckoning.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1227,
      "start_sentence": 0,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.53974986076355,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元无量寿经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "六者善业俭爱欲法，不可称量。 七者精进俭爱欲法，不可称量。 八者，饰身俭爱欲法、不可称量。 九者遣情俭爱欲法，不可称量。 十者普心俭爱欲法，不可称量。 是为十种俭爱欲法。 太上曰：复有十种放玩习法，不可称量。 何等为十种放玩习法。 一者智慧放玩习法，不可称量。 二者慈悲放玩习法，不可称量。 三者含忍放玩习法，不可称量。 四者行功放玩习法，不可称量。 五者修心放玩习法，不可称量。 六者善业放玩习法，不可称量。 七者精进放玩习法，不可称量。 八者市饰身放玩习法，不可称量。 九者遣情放玩习法，不可称量。 十者普心放玩习法，不可称量。 是谓十种放玩习法。 太上曰：复有十种洗垢秽法，不可称量。 何等为十种洗垢秽法。 一者智慧洗垢秽法，不可称量。 二者慈悲洗垢秽法，不可称量。 三者含忍洗垢秽法，不可称量。 四者行功洗垢秽法，不可称量。 五者修心洗垢秽法，不可称量。 六者善业洗垢秽法，不可称量。 七者精进洗垢秽法，不可称量。 八者市饰身洗垢秽法，不可称量。 九者遣情洗垢秽法，不可称量。 十者普心洗垢秽法，不可称量。 是谓十种洗垢秽法。 太上曰：复有十种无昏惑法，不可称量。 何等为十种无昏惑法。 一者智慧无昏惑法，不可称量。 二者慈悲无昏惑法，不可称量。 三者含忍无昏惑法，不可称量。 四者行功无昏惑法，不可称量。 五者修心无昏惑法，不可称量。 六者善业无昏惑法，不可称量。 七者精进无昏惑法，不可称量。 八者市饰身无昏惑法，不可称量。 九者遣情无昏惑法，不可称量。 十者普心无昏惑法，不可称量。 是谓十种无昏惑法。 太上曰：复有十种不淫想法，不可称量。 何等为十种不淫想法。 一者智慧不淫想法，不可称量。 二者慈悲不淫想法，不可称量。 三者含忍不淫想法，不可称量。 四者行功不淫想法，不可称量。 五者修心不淫想法，不可称量。 六者善业不淫想法，不可称量。 七者精进不淫想法，不可称量。 八者饰身不淫想法，不可称量。 九者遣情不淫想法，不可称量。 十者普心不淫想法，不可称量。 是谓十种不淫想法。 太上曰：复有十种不疑空法，不可称量。 何等为十种不疑空法。 一者智慧不疑空法，不可称量。 二者慈悲不疑空法，不可称量。 三者含忍不疑空法，不可称量。 四者行功不疑空法，不可称量。 五者修心不疑空法，不可称量。 六者善业不疑空法，不可称量。 七者精进不疑空法，不可称量。 八者饰身不疑空法，不可称量。 九者遣情不疑空法，不可称量。 十者普心不疑空法，不可称量。 是谓十种不疑空法。 太上曰：复有十种平好丑法，不可称量。 何等为十种平好丑法。 一者智慧平好丑法，不可称量。 二者慈悲平好丑法，不可称量。 三者含忍平好丑法，不可称量。 四者行功平好丑法，不可称量。 五者修心平好丑法，不可称量。 六者善业平好丑法，不可称量。 七者精进平好丑法，不可称量。 八者饰身平好丑法，不可称量。 九者遣情平好丑法，不可称量。 十者普心平好丑法，不可称量。 是谓十种平好丑法。 太上曰：复有十种不邪还法，不可称量。 何等为十种不邪还法。 一者智慧不邪还法，不可称量。 二者慈悲不邪还法，不可称量。",
      "translated_text": "Sixth, the method of meritorious action in restraining desire and attachment is beyond reckoning.\nSeventh, the method of diligence in restraining desire and attachment is beyond reckoning.\nEighth, the method of adorning the body in restraining desire and attachment is beyond reckoning.\nNinth, the method of dispelling emotions in restraining desire and attachment is beyond reckoning.\nTenth, the method of universal mind in restraining desire and attachment is beyond reckoning.\nThese are the ten methods for restraining desire and attachment.\n\nThe Supreme Lord said: There are also ten methods for releasing and cultivating habits, which are beyond reckoning.\n\nWhat are the ten methods for releasing and cultivating habits?\n\nFirst, the method of wisdom in releasing and cultivating habits is beyond reckoning.\nSecond, the method of compassion in releasing and cultivating habits is beyond reckoning.\nThird, the method of forbearance in releasing and cultivating habits is beyond reckoning.\nFourth, the method of meritorious action in releasing and cultivating habits is beyond reckoning.\nFifth, the method of cultivating the mind in releasing and cultivating habits is beyond reckoning.\nSixth, the method of meritorious action in releasing and cultivating habits is beyond reckoning.\nSeventh, the method of diligence in releasing and cultivating habits is beyond reckoning.\nEighth, the method of adorning the body in releasing and cultivating habits is beyond reckoning.\nNinth, the method of dispelling emotions in releasing and cultivating habits is beyond reckoning.\nTenth, the method of universal mind in releasing and cultivating habits is beyond reckoning.\nThese are the ten methods for releasing and cultivating habits.\n\nThe Supreme Lord said: There are also ten methods for washing away defilements, which are beyond reckoning.\n\nWhat are the ten methods for washing away defilements?\n\nFirst, the method of wisdom in washing away defilements is beyond reckoning.\nSecond, the method of compassion in washing away defilements is beyond reckoning.\nThird, the method of forbearance in washing away defilements is beyond reckoning.\nFourth, the method of meritorious action in washing away defilements is beyond reckoning.\nFifth, the method of cultivating the mind in washing away defilements is beyond reckoning.\nSixth, the method of meritorious action in washing away defilements is beyond reckoning.\nSeventh, the method of diligence in washing away defilements is beyond reckoning.\nEighth, the method of adorning the body in washing away defilements is beyond reckoning.\nNinth, the method of dispelling emotions in washing away defilements is beyond reckoning.\nTenth, the method of universal mind in washing away defilements is beyond reckoning.\nThese are the ten methods for washing away defilements.\n\nThe Supreme Lord said: There are also ten methods for being free from delusion, which are beyond reckoning.\n\nWhat are the ten methods for being free from delusion?\n\nFirst, the method of wisdom in being free from delusion is beyond reckoning.\nSecond, the method of compassion in being free from delusion is beyond reckoning.\nThird, the method of forbearance in being free from delusion is beyond reckoning.\nFourth, the method of meritorious action in being free from delusion is beyond reckoning.\nFifth, the method of cultivating the mind in being free from delusion is beyond reckoning.\nSixth, the method of meritorious action in being free from delusion is beyond reckoning.\nSeventh, the method of diligence in being free from delusion is beyond reckoning.\nEighth, the method of adorning the body in being free from delusion is beyond reckoning.\nNinth, the method of dispelling emotions in being free from delusion is beyond reckoning.\nTenth, the method of universal mind in being free from delusion is beyond reckoning.\nThese are the ten methods for being free from delusion.\n\nThe Supreme Lord said: There are also ten methods for being free from lustful thoughts, which are beyond reckoning.\n\nWhat are the ten methods for being free from lustful thoughts?\n\nFirst, the method of wisdom in being free from lustful thoughts is beyond reckoning.\nSecond, the method of compassion in being free from lustful thoughts is beyond reckoning.\nThird, the method of forbearance in being free from lustful thoughts is beyond reckoning.\nFourth, the method of meritorious action in being free from lustful thoughts is beyond reckoning.\nFifth, the method of cultivating the mind in being free from lustful thoughts is beyond reckoning.\nSixth, the method of meritorious action in being free from lustful thoughts is beyond reckoning.\nSeventh, the method of diligence in being free from lustful thoughts is beyond reckoning.\nEighth, the method of adorning the body in being free from lustful thoughts is beyond reckoning.\nNinth, the method of dispelling emotions in being free from lustful thoughts is beyond reckoning.\nTenth, the method of universal mind in being free from lustful thoughts is beyond reckoning.\nThese are the ten methods for being free from lustful thoughts.\n\nThe Supreme Lord said: There are also ten methods for being free from doubt about emptiness, which are beyond reckoning.\n\nWhat are the ten methods for being free from doubt about emptiness?\n\nFirst, the method of wisdom in being free from doubt about emptiness is beyond reckoning.\nSecond, the method of compassion in being free from doubt about emptiness is beyond reckoning.\nThird, the method of forbearance in being free from doubt about emptiness is beyond reckoning.\nFourth, the method of meritorious action in being free from doubt about emptiness is beyond reckoning.\nFifth, the method of cultivating the mind in being free from doubt about emptiness is beyond reckoning.\nSixth, the method of meritorious action in being free from doubt about emptiness is beyond reckoning.\nSeventh, the method of diligence in being free from doubt about emptiness is beyond reckoning.\nEighth, the method of adorning the body in being free from doubt about emptiness is beyond reckoning.\nNinth, the method of dispelling emotions in being free from doubt about emptiness is beyond reckoning.\nTenth, the method of universal mind in being free from doubt about emptiness is beyond reckoning.\nThese are the ten methods for being free from doubt about emptiness.\n\nThe Supreme Lord said: There are also ten methods for equalizing beauty and ugliness, which are beyond reckoning.\n\nWhat are the ten methods for equalizing beauty and ugliness?\n\nFirst, the method of wisdom in equalizing beauty and ugliness is beyond reckoning.\nSecond, the method of compassion in equalizing beauty and ugliness is beyond reckoning.\nThird, the method of forbearance in equalizing beauty and ugliness is beyond reckoning.\nFourth, the method of meritorious action in equalizing beauty and ugliness is beyond reckoning.\nFifth, the method of cultivating the mind in equalizing beauty and ugliness is beyond reckoning.\nSixth, the method of meritorious action in equalizing beauty and ugliness is beyond reckoning.\nSeventh, the method of diligence in equalizing beauty and ugliness is beyond reckoning.\nEighth, the method of adorning the body in equalizing beauty and ugliness is beyond reckoning.\nNinth, the method of dispelling emotions in equalizing beauty and ugliness is beyond reckoning.\nTenth, the method of universal mind in equalizing beauty and ugliness is beyond reckoning.\nThese are the ten methods for equalizing beauty and ugliness.\n\nThe Supreme Lord said: There are also ten methods for not returning to depravity, which are beyond reckoning.\n\nWhat are the ten methods for not returning to depravity?\n\nFirst, the method of wisdom in not returning to depravity is beyond reckoning.\nSecond, the method of compassion in not returning to depravity is beyond reckoning.\nThird, the method of forbearance in not returning to depravity is beyond reckoning.",
      "overlap_context": "straining desire and attachment?\n\nFirst, the method of wisdom in restraining desire and attachment is beyond reckoning.\nSecond, the method of compassion in restraining desire and attachment is beyond reckoning.\nThird, the method of forbearance in restraining desire and attachment is beyond reckoning.\nFourth, the method of meritorious action in restraining desire and attachment is beyond reckoning.\nFifth, the method of cultivating the mind in restraining desire and attachment is beyond reckoning.",
      "start_char": 1227,
      "end_char": 2449,
      "start_sentence": 85,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.140934705734253,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元无量寿经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "三者含忍不邪还法，不可称量。 四者行功不邪还法，不可称量。 五者修心不邪还法，不可称量。 六者善业不邪还法，不可称量。 七者精进不邪还法，不可称量。 八者饰身不邪还法，不可称量。 九者遣情不邪还法，不可称量。 十者普心不邪还法，不可称量。 是谓十种不邪还法。 太上曰：复有十种常住无法，不可称量。 何等为十种常住无法。 一者智慧常住无法，不可称量。 二者慈悲常住无法，不可称量。 三者含忍常住无法，不可称量。 四者行功常住无法，不可称量。 五者修心常住无法，不可称量。 六者善业常住无法，不可称量。 七者精进常住无法，不可称量。 八者饰身常住无法，不可称量。 九者遣情常住无法，不可称量。 十者普心常住无法，不可称量。 是谓十种常住无法。 太上曰：复有十种绝心想法，不可称量。 何等为十种绝心想法。 一者智慧绝心想法，不可称量。 二者慈悲绝心想法，不可称量。 三者含忍绝心想法，不可称量。 四者行功绝心想法，不可称量。 五者修心绝心想法，不可称量。 六者善业绝心想法，不可称量。 七者精进绝心想法，不可称量。 八者饰身绝心想法，不可称量。 九者遣情绝心想法，不可称量。 十者普心绝心想法，不可称量。 是谓十种绝心想法。 太上曰：复有十种习悉意法，不可称量。 何等为十种习悉意法。 一者智慧习悉意法，不可称量。 二者慈悲习悉意法，不可称量。 三者含忍习悉意法，不可称量。 四者行功习悉意法，不可称量。 五者修心习悉意法，不可称量。 六者善业习悉意法，不可称量。 七者精进习悉意法，不可称量。 八者饰身习悉意法，不可称量。 九者遣情习悉意法，不可称量。 十者普心习悉意法，不可称量。 是谓十种习悉意法。 太上曰：复有十种善防言法，不可称量。 何等为十种善防言法。 一者智慧善防言法，不可称量。 二者慈悲善防言法，不可称量。 三者含忍善防言法，不可称量。 四者行功善防言法，不可称量。 五者修心善防言法，不可称量。 六者善业善防言法，不可称量。 七者精进善防言法，不可称量。 八者饰身善防言法，不可称量。 九者遣情善防言法，不可称量。 十者普心善防言法，不可称量。 是谓十种善防言法。 太上曰：复有十种不乱转法，不可称量。 何等为十种不乱转法。 一者智慧不乱转法，不可称量。 二者慈悲不乱转法，不可称量。 三者含忍不乱转法，不可称量。 四者行功不乱转法，不可称量。 五者修心不乱转法，不可称量。 六者善业不乱转法，不可称量。 七者精进不乱转法，不可称量。 八者饰身不乱转法，不可称量。 九者遣情不乱转法，不可称量。 十者普心不乱转法，不可称量。 是谓十种不乱转法。 太上曰：复有十种不悟念法，不可称量。 何等为十种不悟念法。 一者智慧不悟念法，不可称量。 二者慈悲不悟念法，不可称量。 三者含忍不悟念法，不可称量。 四者行功不悟念法，不可称量。 五者修心不悟念法，不可称量。 六者善业不悟念法，不可称量。 七者精进不悟念法，不可称量。 八者饰身不悟念法，不可称量。 九者遣情不悟念法，不可称量。 十者普心不悟念法，不可称量。 是谓十种不悟念法。 太上曰：复有十种不彼念法，不可称量。",
      "translated_text": "Third, the method of forbearance in not returning to depravity is beyond reckoning.\nFourth, the method of meritorious action in not returning to depravity is beyond reckoning.\nFifth, the method of cultivating the mind in not returning to depravity is beyond reckoning.\nSixth, the method of virtuous karma in not returning to depravity is beyond reckoning.\nSeventh, the method of diligence in not returning to depravity is beyond reckoning.\nEighth, the method of adorning the body in not returning to depravity is beyond reckoning.\nNinth, the method of dispelling emotions in not returning to depravity is beyond reckoning.\nTenth, the method of universal mind in not returning to depravity is beyond reckoning.\nThese are the ten methods for not returning to depravity.\n\nThe Supreme Lord said: There are also ten methods for abiding in constancy, which are beyond reckoning.\n\nWhat are the ten methods for abiding in constancy?\n\nFirst, the method of wisdom in abiding in constancy is beyond reckoning.\nSecond, the method of compassion in abiding in constancy is beyond reckoning.\nThird, the method of forbearance in abiding in constancy is beyond reckoning.\nFourth, the method of meritorious action in abiding in constancy is beyond reckoning.\nFifth, the method of cultivating the mind in abiding in constancy is beyond reckoning.\nSixth, the method of virtuous karma in abiding in constancy is beyond reckoning.\nSeventh, the method of diligence in abiding in constancy is beyond reckoning.\nEighth, the method of adorning the body in abiding in constancy is beyond reckoning.\nNinth, the method of dispelling emotions in abiding in constancy is beyond reckoning.\nTenth, the method of universal mind in abiding in constancy is beyond reckoning.\nThese are the ten methods for abiding in constancy.\n\nThe Supreme Lord said: There are also ten methods for severing deluded thoughts, which are beyond reckoning.\n\nWhat are the ten methods for severing deluded thoughts?\n\nFirst, the method of wisdom in severing deluded thoughts is beyond reckoning.\nSecond, the method of compassion in severing deluded thoughts is beyond reckoning.\nThird, the method of forbearance in severing deluded thoughts is beyond reckoning.\nFourth, the method of meritorious action in severing deluded thoughts is beyond reckoning.\nFifth, the method of cultivating the mind in severing deluded thoughts is beyond reckoning.\nSixth, the method of virtuous karma in severing deluded thoughts is beyond reckoning.\nSeventh, the method of diligence in severing deluded thoughts is beyond reckoning.\nEighth, the method of adorning the body in severing deluded thoughts is beyond reckoning.\nNinth, the method of dispelling emotions in severing deluded thoughts is beyond reckoning.\nTenth, the method of universal mind in severing deluded thoughts is beyond reckoning.\nThese are the ten methods for severing deluded thoughts.\n\nThe Supreme Lord said: There are also ten methods for perfecting the will, which are beyond reckoning.\n\nWhat are the ten methods for perfecting the will?\n\nFirst, the method of wisdom in perfecting the will is beyond reckoning.\nSecond, the method of compassion in perfecting the will is beyond reckoning.\nThird, the method of forbearance in perfecting the will is beyond reckoning.\nFourth, the method of meritorious action in perfecting the will is beyond reckoning.\nFifth, the method of cultivating the mind in perfecting the will is beyond reckoning.\nSixth, the method of virtuous karma in perfecting the will is beyond reckoning.\nSeventh, the method of diligence in perfecting the will is beyond reckoning.\nEighth, the method of adorning the body in perfecting the will is beyond reckoning.\nNinth, the method of dispelling emotions in perfecting the will is beyond reckoning.\nTenth, the method of universal mind in perfecting the will is beyond reckoning.\nThese are the ten methods for perfecting the will.\n\nThe Supreme Lord said: There are also ten methods for skillfully guarding speech, which are beyond reckoning.\n\nWhat are the ten methods for skillfully guarding speech?\n\nFirst, the method of wisdom in skillfully guarding speech is beyond reckoning.\nSecond, the method of compassion in skillfully guarding speech is beyond reckoning.\nThird, the method of forbearance in skillfully guarding speech is beyond reckoning.\nFourth, the method of meritorious action in skillfully guarding speech is beyond reckoning.\nFifth, the method of cultivating the mind in skillfully guarding speech is beyond reckoning.\nSixth, the method of virtuous karma in skillfully guarding speech is beyond reckoning.\nSeventh, the method of diligence in skillfully guarding speech is beyond reckoning.\nEighth, the method of adorning the body in skillfully guarding speech is beyond reckoning.\nNinth, the method of dispelling emotions in skillfully guarding speech is beyond reckoning.\nTenth, the method of universal mind in skillfully guarding speech is beyond reckoning.\nThese are the ten methods for skillfully guarding speech.\n\nThe Supreme Lord said: There are also ten methods for non-distraction, which are beyond reckoning.\n\nWhat are the ten methods for non-distraction?\n\nFirst, the method of wisdom in non-distraction is beyond reckoning.\nSecond, the method of compassion in non-distraction is beyond reckoning.\nThird, the method of forbearance in non-distraction is beyond reckoning.\nFourth, the method of meritorious action in non-distraction is beyond reckoning.\nFifth, the method of cultivating the mind in non-distraction is beyond reckoning.\nSixth, the method of virtuous karma in non-distraction is beyond reckoning.\nSeventh, the method of diligence in non-distraction is beyond reckoning.\nEighth, the method of adorning the body in non-distraction is beyond reckoning.\nNinth, the method of dispelling emotions in non-distraction is beyond reckoning.\nTenth, the method of universal mind in non-distraction is beyond reckoning.\nThese are the ten methods for non-distraction.\n\nThe Supreme Lord said: There are also ten methods for non-delusion, which are beyond reckoning.\n\nWhat are the ten methods for non-delusion?\n\nFirst, the method of wisdom in non-delusion is beyond reckoning.\nSecond, the method of compassion in non-delusion is beyond reckoning.\nThird, the method of forbearance in non-delusion is beyond reckoning.\nFourth, the method of meritorious action in non-delusion is beyond reckoning.\nFifth, the method of cultivating the mind in non-delusion is beyond reckoning.\nSixth, the method of virtuous karma in non-delusion is beyond reckoning.\nSeventh, the method of diligence in non-delusion is beyond reckoning.\nEighth, the method of adorning the body in non-delusion is beyond reckoning.\nNinth, the method of dispelling emotions in non-delusion is beyond reckoning.\nTenth, the method of universal mind in non-delusion is beyond reckoning.\nThese are the ten methods for non-delusion.\n\nThe Supreme Lord said: There are also ten methods for non-attachment, which are beyond reckoning.",
      "overlap_context": " is beyond reckoning.\nThese are the ten methods for equalizing beauty and ugliness.\n\nThe Supreme Lord said: There are also ten methods for not returning to depravity, which are beyond reckoning.\n\nWhat are the ten methods for not returning to depravity?\n\nFirst, the method of wisdom in not returning to depravity is beyond reckoning.\nSecond, the method of compassion in not returning to depravity is beyond reckoning.\nThird, the method of forbearance in not returning to depravity is beyond reckoning.",
      "start_char": 2449,
      "end_char": 3671,
      "start_sentence": 173,
      "end_sentence": 260,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.821353435516357,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元无量寿经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "何等为十种不彼念法。 一者智慧不彼念法，不可称量。 二者慈悲不彼念法，不可称量。 三者含忍不彼念法，不可称量。 四者行功不彼念法，不可称量。 五者修心不彼念法，不可称量。 六者善业不彼念法，不可称量。 七者精进不彼念法，不可称量。 八者饰身不彼念法，不可称量。 九者遣情不彼念法，不可称量。 十者普心不彼念法，不可称量。 是谓十种不彼念法。 太上曰：复有十种不悠想法，不可称量。 何等为十种不悠想法。 一者智慧不悠想法，不可称量。 二者慈悲不悠想法，不可称量。 三者含忍不悠想法，不可称量。 四者行功不悠想法，不可称量。 五者修心不悠想法，不可称量。 六者善业不悠想法，不可称量。 七者精进不悠想法，不可称量。 八者饰身不悠想法，不可称量。 九者遣情不悠想法，不可称量。 十者普心不悠想法，不可称量。 是谓十种不悠想法。 太上曰：复有十种无常定法，不可称量。 何等为十种无常定法。 一者智慧无常定法，不可称量。 二者慈悲无常定法，不可称量。 三者含忍无常定法，不可称量。 四者行功无常定法，不可称量。 五者修心无常定法，不可称量。 六者善业无常定法，不可称量。 七者精进无常定法，不可称量。 八者饰身无常定法，不可称量。 九者遣情无常定法，不可称量。 十者普心无常定法，不可称量。 是谓十种无常定法。 太上曰：复有十种无常的法，不可称量。 何等为十种无常的法。 一者智慧无常的法，不可称量。 二者慈悲无常的法，不可称量。 三者含忍无常的法，不可称量。 四者行功无常的法，不可称量。 五者修心无常的法，不可称量。 六者善业无常的法，不可称量。 七者精进无常的法，不可称量。 八者饰身无常的法，不可称量。 九者遣情无常的法，不可称量。 十者普心无常的法，不可称量。 是谓十种无常的法。 太上曰：复有十种无常顾法，不可称量。 何等为十种无常顾法。 一者智慧无常顾法，不可称量。 二者慈悲无常顾法，不可称量。 三者含忍无常顾法，不可称量。 四者行功无常顾法，不可称量。 五者修心无常顾法，不可称量。 六者善业无常顾法，不可称量。 七者精进无常顾法，不可称量。 八者饰身无常顾法，不可称量。 九者遣情无常顾法，不可称量。 十者普心无常顾法，不可称量。 是谓十种无常顾法。 太上曰：复有十种不追怀法，不可称量。 何等为十种不追怀法。 一者智慧不追怀法，不可称量。 二者慈悲不追怀法，不可称量。 三者含忍不追怀法，不可称量。 四者行功不追怀法，不可称量。 五者修心不追怀法，不可称量。 六者善业不追怀法，不可称量。 七者精进不追怀法，不可称量。 八者饰身不追怀法，不可称量。 九者遣情不追怀法，不可称量。 十者普心不追怀法，不可称量。 是谓十种不追怀法。 太上曰：复有十种无犹豫法，不可称量。 ＂何等为十种无犹豫法。 一者智慧无犹豫法，不可称量。 二者慈悲无犹豫法，不可称量。 三者含忍无犹豫法，不可称量。 四者行功无犹豫法，不可称量。 五者修心无犹豫法，不可称量。 六者善业无犹豫法，不可称量。 七者精进无犹豫法，不可称量。 八者饰身无犹豫法，不可称量。 九者遣情无犹豫法，．不可称量。",
      "translated_text": "What are the ten methods for non-attachment? First, the method of wisdom in non-attachment is beyond reckoning. Second, the method of compassion in non-attachment is beyond reckoning. Third, the method of forbearance in non-attachment is beyond reckoning. Fourth, the method of meritorious action in non-attachment is beyond reckoning. Fifth, the method of cultivating the mind in non-attachment is beyond reckoning. Sixth, the method of virtuous karma in non-attachment is beyond reckoning. Seventh, the method of diligence in non-attachment is beyond reckoning. Eighth, the method of adorning the body in non-attachment is beyond reckoning. Ninth, the method of dispelling emotions in non-attachment is beyond reckoning. Tenth, the method of universal mind in non-attachment is beyond reckoning. These are the ten methods for non-attachment.\n\nThe Supreme Lord said: There are also ten methods for non-distraction, which are beyond reckoning.\n\nWhat are the ten methods for non-distraction? First, the method of wisdom in non-distraction is beyond reckoning. Second, the method of compassion in non-distraction is beyond reckoning. Third, the method of forbearance in non-distraction is beyond reckoning. Fourth, the method of meritorious action in non-distraction is beyond reckoning. Fifth, the method of cultivating the mind in non-distraction is beyond reckoning. Sixth, the method of virtuous karma in non-distraction is beyond reckoning. Seventh, the method of diligence in non-distraction is beyond reckoning. Eighth, the method of adorning the body in non-distraction is beyond reckoning. Ninth, the method of dispelling emotions in non-distraction is beyond reckoning. Tenth, the method of universal mind in non-distraction is beyond reckoning. These are the ten methods for non-distraction.\n\nThe Supreme Lord said: There are also ten methods for impermanence and stability, which are beyond reckoning.\n\nWhat are the ten methods for impermanence and stability? First, the method of wisdom in impermanence and stability is beyond reckoning. Second, the method of compassion in impermanence and stability is beyond reckoning. Third, the method of forbearance in impermanence and stability is beyond reckoning. Fourth, the method of meritorious action in impermanence and stability is beyond reckoning. Fifth, the method of cultivating the mind in impermanence and stability is beyond reckoning. Sixth, the method of virtuous karma in impermanence and stability is beyond reckoning. Seventh, the method of diligence in impermanence and stability is beyond reckoning. Eighth, the method of adorning the body in impermanence and stability is beyond reckoning. Ninth, the method of dispelling emotions in impermanence and stability is beyond reckoning. Tenth, the method of universal mind in impermanence and stability is beyond reckoning. These are the ten methods for impermanence and stability.\n\nThe Supreme Lord said: There are also ten methods for the impermanent, which are beyond reckoning.\n\nWhat are the ten methods for the impermanent? First, the method of wisdom in the impermanent is beyond reckoning. Second, the method of compassion in the impermanent is beyond reckoning. Third, the method of forbearance in the impermanent is beyond reckoning. Fourth, the method of meritorious action in the impermanent is beyond reckoning. Fifth, the method of cultivating the mind in the impermanent is beyond reckoning. Sixth, the method of virtuous karma in the impermanent is beyond reckoning. Seventh, the method of diligence in the impermanent is beyond reckoning. Eighth, the method of adorning the body in the impermanent is beyond reckoning. Ninth, the method of dispelling emotions in the impermanent is beyond reckoning. Tenth, the method of universal mind in the impermanent is beyond reckoning. These are the ten methods for the impermanent.\n\nThe Supreme Lord said: There are also ten methods for impermanence and contemplation, which are beyond reckoning.\n\nWhat are the ten methods for impermanence and contemplation? First, the method of wisdom in impermanence and contemplation is beyond reckoning. Second, the method of compassion in impermanence and contemplation is beyond reckoning. Third, the method of forbearance in impermanence and contemplation is beyond reckoning. Fourth, the method of meritorious action in impermanence and contemplation is beyond reckoning. Fifth, the method of cultivating the mind in impermanence and contemplation is beyond reckoning. Sixth, the method of virtuous karma in impermanence and contemplation is beyond reckoning. Seventh, the method of diligence in impermanence and contemplation is beyond reckoning. Eighth, the method of adorning the body in impermanence and contemplation is beyond reckoning. Ninth, the method of dispelling emotions in impermanence and contemplation is beyond reckoning. Tenth, the method of universal mind in impermanence and contemplation is beyond reckoning. These are the ten methods for impermanence and contemplation.\n\nThe Supreme Lord said: There are also ten methods for non-recollection, which are beyond reckoning.\n\nWhat are the ten methods for non-recollection? First, the method of wisdom in non-recollection is beyond reckoning. Second, the method of compassion in non-recollection is beyond reckoning. Third, the method of forbearance in non-recollection is beyond reckoning. Fourth, the method of meritorious action in non-recollection is beyond reckoning. Fifth, the method of cultivating the mind in non-recollection is beyond reckoning. Sixth, the method of virtuous karma in non-recollection is beyond reckoning. Seventh, the method of diligence in non-recollection is beyond reckoning. Eighth, the method of adorning the body in non-recollection is beyond reckoning. Ninth, the method of dispelling emotions in non-recollection is beyond reckoning. Tenth, the method of universal mind in non-recollection is beyond reckoning. These are the ten methods for non-recollection.\n\nThe Supreme Lord said: There are also ten methods for non-hesitation, which are beyond reckoning.\n\nWhat are the ten methods for non-hesitation? First, the method of wisdom in non-hesitation is beyond reckoning. Second, the method of compassion in non-hesitation is beyond reckoning. Third, the method of forbearance in non-hesitation is beyond reckoning. Fourth, the method of meritorious action in non-hesitation is beyond reckoning. Fifth, the method of cultivating the mind in non-hesitation is beyond reckoning. Sixth, the method of virtuous karma in non-hesitation is beyond reckoning. Seventh, the method of diligence in non-hesitation is beyond reckoning. Eighth, the method of adorning the body in non-hesitation is beyond reckoning. Ninth, the method of dispelling emotions in non-hesitation is beyond reckoning.",
      "overlap_context": "thod of virtuous karma in non-delusion is beyond reckoning.\nSeventh, the method of diligence in non-delusion is beyond reckoning.\nEighth, the method of adorning the body in non-delusion is beyond reckoning.\nNinth, the method of dispelling emotions in non-delusion is beyond reckoning.\nTenth, the method of universal mind in non-delusion is beyond reckoning.\nThese are the ten methods for non-delusion.\n\nThe Supreme Lord said: There are also ten methods for non-attachment, which are beyond reckoning.",
      "start_char": 3671,
      "end_char": 4889,
      "start_sentence": 261,
      "end_sentence": 348,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.3828547000885,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元无量寿经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "十者普心无犹豫法，不可称量。 是谓十种无犹豫法。 太上曰：复有十种忍不可忍法，不可称量。 何等为十种忍不可忍法。 一者智慧忍不可忍法，不可称量。 二者慈悲忍不可忍法，不可称量。 三者含忍忍不可忍法，不可称量。 四者行功忍不可忍法，不可称量。 五者修心忍不可忍法，不可称量。 六者善业忍不可忍法，不可称量。 七者精进忍不可忍法，不可称量。 八者饰身忍不可忍法，不可称量。 九者遗情忍不可忍法，不可称量。 十者普心忍不可忍法，不可称量。 是谓十种忍不可忍法。 道言：夫洞玄经者，盖天地之源，道德之宗，上圣所尊贵，鬼神所畏伏。 其高则出九天之上，其深则通九地之下。 千变万化，道尽於此。 若复有人能於此经受持读诵，心无懈怠，即得生无量智慧，增无量善因，灭无量业障，消无量烦恼，延无量寿算，长无量福田。 世世欢荣，生生快乐。 恒须恭敬，抄写流传，利益众生，是为无量，真人闻说，信受奉行。 太上洞玄灵宝三元无量寿经竟",
      "translated_text": "Tenth, the method of universal mind in non-hesitation is beyond reckoning.\nThese are the ten methods for non-hesitation.\n\nThe Most High said: There are also ten methods of forbearance for the unbearable, which are beyond reckoning.\nWhat are the ten methods of forbearance for the unbearable? First, the method of wisdom in forbearance for the unbearable is beyond reckoning. Second, the method of compassion in forbearance for the unbearable is beyond reckoning. Third, the method of endurance in forbearance for the unbearable is beyond reckoning. Fourth, the method of meritorious action in forbearance for the unbearable is beyond reckoning. Fifth, the method of cultivating the mind in forbearance for the unbearable is beyond reckoning. Sixth, the method of virtuous karma in forbearance for the unbearable is beyond reckoning. Seventh, the method of diligence in forbearance for the unbearable is beyond reckoning. Eighth, the method of adorning the body in forbearance for the unbearable is beyond reckoning. Ninth, the method of relinquishing emotions in forbearance for the unbearable is beyond reckoning. Tenth, the method of universal mind in forbearance for the unbearable is beyond reckoning.\nThese are the ten methods of forbearance for the unbearable.\n\nThe Dao says: The *Dongxuan Sutra* is the source of Heaven and Earth, the origin of the Dao and virtue, revered by the highest sages, and feared by ghosts and spirits. Its height reaches beyond the Nine Heavens, and its depth penetrates below the Nine Earths. Myriad transformations and infinite changes of the Dao are fully contained within it. If one can receive, uphold, read, and recite this sutra with an unwavering mind, they will attain boundless wisdom, accumulate boundless good causes, eradicate boundless karmic obstacles, dispel boundless afflictions, extend boundless lifespan, and expand boundless fields of merit. They will enjoy prosperity in every life and happiness in every rebirth. One must always revere it, copy it, and circulate it to benefit all beings—this is immeasurable. The perfected ones, upon hearing this, believe, accept, and practice it.\n\nThus concludes the *Taishang Dongxuan Lingbao Sanyuan Wuliangshou Jing*.",
      "overlap_context": "n-hesitation is beyond reckoning. Fourth, the method of meritorious action in non-hesitation is beyond reckoning. Fifth, the method of cultivating the mind in non-hesitation is beyond reckoning. Sixth, the method of virtuous karma in non-hesitation is beyond reckoning. Seventh, the method of diligence in non-hesitation is beyond reckoning. Eighth, the method of adorning the body in non-hesitation is beyond reckoning. Ninth, the method of dispelling emotions in non-hesitation is beyond reckoning.",
      "start_char": 4889,
      "end_char": 5281,
      "start_sentence": 349,
      "end_sentence": 370,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.170902729034424,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三元无量寿经.txt",
        "category": "本文类"
      }
    }
  ]
}