{
  "source_id": "太上老君说天妃救苦灵验经",
  "source_file": "chunked_daozang\\太上老君说天妃救苦灵验经.json",
  "total_chunks": 3,
  "total_original_chars": 2388,
  "total_translated_chars": 14855,
  "total_translation_time": 79.40002703666687,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说天妃救苦灵验经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Heavenly Honored Lord Lao Speaks the Efficacious Sutra of the Heavenly Consort’s Salvation from Suffering*\n\n**Title:** *The Heavenly Honored Lord Lao Speaks the Efficacious Sutra of the Heavenly Consort’s Salvation from Suffering*\nAuthor unknown, dating to the early Ming dynasty. Falsely attributed to the Heavenly Honored Lord Lao and the Perfected One of Vast Salvation, recounting the Heavenly Consort’s (Mazu’s) descent into the world to save the suffering and protect the people. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, *Wondrous Writings* section of the *Divine Empyrean* Department.\n\n---\n\n*The Heavenly Honored Lord Lao Speaks the Efficacious Sutra of the Heavenly Consort’s Salvation from Suffering*\n\nWe look up to invoke the imperial-bestowed title, boundless in majesty,\nA compassionate assistant to the Northern Dipper, divinity most efficacious.\nHer awe-inspiring presence manifests upon the great seas,\nHer virtue and power widely bestowed—all under heaven revere her.\nShe shields the realm and saves the people without obstruction,\nAiding the perilous and rescuing the imperiled in an instant.\nNow roaming the celestial realms, now the human world,\nNow traversing the waves and billows, now the earthly prisons.\nDemons and specters all submit to her,\nPhantoms and malevolent spirits all hide in retreat.\nShe transforms misfortune into fortune as swiftly as a finger-snap,\nBestows blessings and dispels calamities as if annihilating dust.\nWhen mortals pray, holding golden censers,\nAll turn their hearts to her in earnest supplication.\n\n**Sincere Devotion and Homage:**\nIn the wondrous realm of Putuo, on Meizhou of Xinghua,\nHer numinous responses and virtue are extraordinary,\nHer filial piety moves the gods, her divine power vast.\nShe calms the waves to rescue those in distress,\nUpholds the perilous to revive the dying.\nGreat in compassion, great in mercy,\nShe saves the suffering, delivers from hardship—\nBy imperial decree, her luminous efficacy shines forth:\n*Heavenly Consort, Illustrious in Wondrous Response, Vast in Benevolence, Universally Salvific, Protector of the Realm, Shelter of the People.*\n\n**Invocation Mantra:**\nWe invoke the Three Heavens’ Supreme Overseer,\nThe Nine Heavens’ roaming sentinel, never at rest.\nThe August Heavenly Consort, whose merit shields the realm,\nBy imperial decree, her numinous grace defends the court.\nAdorned with a floral crown, she rides a phoenix chariot,\nClad in kingfisher robes, wielding a dragon’s form.\nTo the east, the Western Flower’s ghostly generals array,\nTo the south, she leads expeditions, aiding the divine hosts.\nHer sword and talisman gleam with the Dipper’s light,\nHer decrees and commands sweep away demonic spirits.\nHer majestic presence manifests—all revere her,\nHer heart moves with compassion, rain and dew equally bestowed.\nShe saves the people, shields the realm, bestowing grace,\nUpholds the harmed, eradicates calamity, fostering prosperity.\nHer power and virtue pervade the upper realms,\nHer mercy descends to the world, delivering all beings.\nMountains and rivers, altars and states, forever secure,\nWind in harmony, rain in season, preserving great peace.\nHer radiance scatters, her brilliance fills the Three Realms,\nIn the human world and heavens, sun and moon shine bright.\nCelestial dragons and ghosts all pay reverence,\nBy decree, all ascend to the Supreme Clarity.\nI now vow to uphold this forever,\nWith wholehearted devotion, I honor the true sutra.\n\n**Homage Mantra:**\nYin’s virtue first arises,\nYang’s light brings auspicious purity.\nHer majesty blazes forth,\nSaving and delivering the people.\nShe beheads demons, eradicates evil,\nSwiftly ascending to the Supreme Clarity.\nThe Three Terraces come to guard,\nAll sages welcome her.\nWearing heaven, treading earth,\nShe paces the Dipper and the Striding Star.\nNo sorrow remains unvanquished,\nNo wish left unfulfilled.\nRecite the divine mantra,\nThe Dao’s *qi* endures forever.\n\n---\n\nAt that time, the Heavenly Honored Lord Lao was in the Boundless Realm. Gazing upon the vast oceans, the great rivers and their sources, the Four Seas and Nine Rivers, the Five Lakes and watery marshes, he saw dragons, serpents, fish, and leviathans emerging and transforming, spirits and demons assuming a thousand forms.\n\nAmong the multitudes of beings, some engaged in commerce and trade, seeking treasures and rarities; some ventured to distant lands, trafficking with foreign domains; some from outer realms presented tribute, while the imperial state bestowed grace; some transported grain and tribute, sailing to and fro. Yet when winds and waters turned treacherous, tides surged violently, waves rose suddenly, or when wind and thunder struck, rain and hail poured down—then ghosts and spirits, seizing the shifts of yin and yang, capsized boats, took lives, and wrought indiscriminate harm. Those thus afflicted had no escape, forced to seize others to replace their deaths, their resentment surging upward—how could they be saved?\n\nThereupon, the Perfected One of Vast Salvation ascended to address the Heavenly Worthy: \"Within the Dipper resides the Wondrous Conduct Jade Maiden. Since kalpas past, she has cultivated myriad virtuous practices, vowing to propagate the true teaching and broadly deliver beings, universally granting peace and bliss.\"\n\nThen the Heavenly Worthy commanded the Wondrous Conduct Jade Maiden to descend into the human world and save the people’s afflictions. In the year of *jiashen*, on the twenty-third day of the third month at the hour of *chen*, she was born into the world.\n\nFrom birth, she was spiritually attuned; as she grew, her divinity was extraordinary. She cultivated wondrous practices, demonstrated great spiritual powers, and delivered the people. She vowed to resolve the hardships of all sentient beings, eradicate calamities, uphold the distressed, and relieve suffering. When her merit was complete and her fruit full, she ascended in broad daylight. The earth gods and altar lords memorialized her to the Three Heavens.\n\nThereupon, the Lord Lao issued a decree, bestowing upon her the title: *Heavenly Consort, Assistant to the Dipper, Filial and Pure in Illustrious Response, Faithfully Salvific, Protector of the Realm, Shelter of the People, Illustrious in Wondrous Response, Vast in Benevolence, Universally Salvific.*\n\nThen the Heavenly Consort, hearing the proclamation of the Dharma, expansively declared her vow: \"From this day forward, if there are traveling merchants or settled traders seeking wealth, or farmers, artisans, and craftsmen tilling and managing; if armies array in battle, or women struggle in childbirth; if official disputes arise, or slanderous tongues assail; if myriad vexations afflict, or illnesses linger without respite—whoever can arise with reverence and invoke my name, I shall respond in that very moment, granting their wishes and fulfilling their hearts’ desires, their plans succeeding as they intend.\n\nI constantly roam the celestial realms, pervading the human world, even to the earthly prisons, springs, rivers, and seas—every place. All who seek shall have their wishes fulfilled.\"\n\nThereupon, the Perfected One of Vast Salvation, hearing these vows, bowed in reverence and submitted, reciting a gatha:\n\nBy decree, she assists the Dipper,\nHer traces manifest, her power divine.\nFlying talismans, racing seals,\nShe commands the celestial soldiers.\nShe captures traitors, beheads demons,\nUpholds the perilous, rescues the imperiled, aiding the heavenly hosts.\nEvil spirits forever annihilated,\nIllnesses pacified, peace restored.\nThose who revere her prosper,\nThose who oppose her fall.\nShe suppresses fires and thefts,\nSevers the paths of darkness.\nEast, west, south, north—\nThe four directions purified.\nHer divine might shakes all,\nFamilies and realms secure.\nThe heroic Heavenly Consort,\nAuspicious in this enlightened age.\nRoaming the Three Realms,\nPervading all spirits.\nWind and thunder guard her,\nGenerals and soldiers sustain her.\n\nDescending to the mortal realm, she annihilates disasters and wrongs.\nBelow, she reaches the earthly prisons, notifying all divine administrators.\nThe wrongfully oppressed are avenged,\nThose who kill are executed.\nThose who give are loved,\nThose who scheme are pursued.\nWith wholehearted reverence,\nAll things flourish in harmony.\nSwiftly, swiftly, as the law commands!\n\nThereupon, the Heavenly Consort, having heard the gatha, bowed before the Heavenly Venerable and proclaimed her vows:\n\nFirst, she vows to ferry boats and ships safely to the other shore.\nSecond, she vows to protect merchants and travelers, ensuring their peace and joy.\nThird, she vows to expel malevolent spirits, forever dispelling them.\nFourth, she vows to eradicate calamities and misfortunes, purifying households.\nFifth, she vows to hunt down traitors and thieves, banishing their traces and forms.\nSixth, she vows to capture and execute the wicked, eradicating the violent and obstinate.\nSeventh, she vows to save the people and protect the realm, bringing them great peace.\nEighth, she vows to absolve sins and dissolve transgressions, freeing all from karmic retribution.\nNinth, she vows to assist in difficult childbirths, ensuring the safety of mother and child.\nTenth, she vows to shelter the virtuous, sparing them from unjust harm.\nEleventh, she vows to guard the Dharma realm, bringing timely winds and rains.\nTwelfth, she vows that all who turn to her shall be protected and blessed with peace.\nThirteenth, she vows that those who cultivate the Dao shall achieve fruition in their practice.\nFourteenth, she vows that those who seek office and promotion shall attain rank and prosperity.\nFifteenth, she vows that the departed shall transcend suffering, and the Nine Dark Realms shall know rest.\n\nThen, the Venerable Lord, having heard the Heavenly Consort’s vows, commanded the Mysterious and Wondrous Jade Maiden to bestow upon her the title of **Unbounded Dipper-Assisting Governance and Universal Salvation Heavenly Consort**. He granted her a pearl crown and cloud-embroidered slippers, jade pendants and a ritual scepter, crimson robes with azure sashes, a dragon-drawn chariot and phoenix palanquin, a sword and seal. Before and behind, her retinue was majestic and solemn. Her forces included the **Yellow Wasp Marshal**, the **White Horse General**, the **Ding-Ren Envoys**, the **Tamarix Incense Great Sage**, and the **Yan the Great Deity**, who possessed the **Thousand-Mile Eye** to detect treachery and the **Favorable Wind Ear** to report affairs. Blue-robed youths, water bureau officials, and divine aides bolstered her might, manifesting the true transformation.\n\nShould any man or woman reverently invoke her name, or perform purification rites and establish altars, or maintain a pure household, or recite this sutra once—even a hundred or a thousand times—over rivers and seas, they shall be delivered from disasters, malevolent spirits annihilated, illnesses healed, official misfortunes forever stilled. In battle, evil shall depart; in prisons, peace shall reign. Bandits shall not invade, slander shall not harm. Silkworms and crops shall yield a hundredfold, livestock shall multiply, wealth and emoluments overflow, commerce thrive. Merchants and traders, seeking treasures, shall traverse the seas in safety, free from fear. Those seeking office or undertaking affairs shall achieve their desires.\n\nWhen the Heavenly Venerable had finished expounding this sutra, the devas, dragons, ghosts, and spirits all vowed to uphold it. Thereupon, the **Vast Salvation Perfected One** recited another gatha:\n\nThe Golden Portal’s Sacred Empress,\nEnfeoffed to assist the Dipper.\nHer divine traces manifest among heaven and humankind,\nMountains and rivers nurture her excellence.\nThe third month’s *chen* day,\nThe waning moon answers the season.\nProtecting the realm, her spirit endures,\nA myriad lifetimes proclaimed in homage.\nWhat blessing does she not bestow?\nWhat peril does she not rescue?\nIn harmony with the Dao, true and real,\nThe Jade Emperor cherishes and protects her.\nRecite this sutra in accord,\nAnd demonic spirits shall bow their heads.\nBurn incense, scatter flowers,\nPerform purification rites, establish altars.\nIn times of urgent peril,\nPray devoutly.\nReceive and uphold it as prescribed,\nAnd all shall be answered.\nSwiftly, swiftly, as the law commands!\n\nThe Dipper Immortal, True Empress,\nRanked among the Nine Heavens.\nAbove, she aids the Golden Portal,\nBelow, she reaches the springs’ source.\nThe Seven Primes’ Envoys,\nIn harmony with the Dao’s spontaneity.\nMortals revere and turn to her,\nTheir blessings boundless.\nThe boundless heavens,\nBestow blessings without end.\nThe heroic Heavenly Consort,\nHer responses boundless.\nBetween heaven and earth,\nAll honor her name.\nHer pure virtue manifests protection,\nThe realm knows peace.\nYour servant now obeys and upholds,\nForever preserving prosperity and integrity.\n\nWhen the Vast Salvation had finished reciting this gatha, the Wondrous Conduct Heavenly Consort bowed before the Heavenly Venerable, took her leave, and departed. The spirits of the Three Realms, devas, dragons, gods, and ghosts all rejoiced, faithfully receiving and practicing it.\n\n**Heavenly Consort’s Salvific Talisman**\nThe talisman’s incantation proclaims:\nDipper-Assisting Perfected One,\nResponsive and transformative in birth.\nOne talisman, one draught of water,\nSaves and aids the myriad people.\nDispels disasters, removes obstacles,\nForever ensures peace and tranquility.\nSwiftly, swiftly, as the law commands!\n\nThe Celestial Empress,\nDescended from the Northern Dipper.\nHer traces manifest in the Three Realms,\nHer spirit flows through the vast seas.\nDivine transformations, wondrous powers,\nInvoked by name, she brings salvation.\nThirty-two marks,\nHer countenance perfect and complete.\nResponsive to every thought,\nMost sacred, most divine.\nHer majestic radiance resplendent,\nProtecting the realm, sheltering the people.\nSea winds stir the waves,\nHer blessings descend upon prayer.\nWith wholehearted reverence,\nHer true form manifests.\nAppearing in the void,\nCommanding the heavenly hosts.\nHer divine might descends,\nGhosts submit, spirits tremble.\nThe **Putian Earth Lord**,\nSacred transformation in the bamboo grove.\nThe **Northern Dipper Great Sage**,\nDrives away malevolent spirits.\nDispels disasters, scatters misfortunes,\nHouseholds and realm secure.\nSwiftly, swiftly, as the law commands!\n\nThe **Divine Talisman of the Heavenly Consort**—when in urgent need, burn incense, recite the preceding incantation seven times, inscribe this talisman, and grind it with well-drawn water and frankincense to consume. Naturally, all shall be well, and none shall fail to receive response.\n\nThus concludes the *Most High Lord Lao’s Scripture of the Heavenly Consort’s Efficacious Salvation from Suffering*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君说天妃救苦灵验经 经名：太上老君说天妃救苦灵验经。 撰人不详，出於明初。 假托太上老君及广救真人说天妃（妈祖）降世救苦护民之事。 一卷。 底本出处：《正统道藏》洞神部本文类。 太上老君说天妃救苦灵验经 仰启勑封号无极，仁慈辅斗至灵神。 威容显现大海中，德广徧施天下仰。 护国救民无壅滞，扶危救险在须臾。 或游天界或人间，或徧波涛并地府。 邪魔鬼魅总归依，魍魉妖精皆潜伏。 变凶为吉如弹指，赐福消灾若殄微。 凡人有祷捧金炉，一切归心从恳祷。 至心归命礼：浦沱胜境，兴化湄州，灵应威德非常，孝感神通广大，救厄而平波息浪，扶危而起死回生，大慈大悲，救苦救难，勑封护国庇民明着妙灵昭应弘仁普济天妃。 启请咒 奉请三天都总管，九天游奕不曾停。 上圣天妃功护国，勑封灵惠卫朝廷。 头戴花冠乘凤辇，身披翚服仗龙形。 东列西华排鬼将，南征北讨助神兵。 剑佩斗牛光凛冽，简书勑命扫妖精。 威容显现人钦仰，心运慈悲雨露均。 救民护国施恩德，扶害除灾利泽兴。 威德周圆通上界，垂慈降世度群生。 山河社稷永安镇，雨顺风调保太平。 散影分辉遍三界，人间天上日月明。 天龙鬼神咸恭敬，奉勑皆令达上清。 我今誓愿永受持，一心归命奉真经。 奉礼咒 阴德始生，阳光吉贞。 威容烜赫，救度生民。 斩鬼除魔，速达上清。 三台来护，众圣皆迎。 戴天履地，步斗魁星。 无忧不灭，无愿不成。 诵持神咒，道炁长存。 尔时太上老君在无极境界，观见大洋溟渤、河渎川源、四海九江、五湖水泽、蛟蜃鱼龙，出没变化精妖鬼怪，千状万端。 有诸众生，或以兴商买卖，采宝求珍，出使遐荒，交通异域，外邦进贡，上国颁恩，轮运钱粮，进纳贡赋，舟船往复，风水不便，潮势汹涌，惊涛仓卒，或风雷震击，雨雹滂沱，其诸鬼神，乘此阴阳变化，翻覆舟船，损人性命，横被伤杀，无由解脱，以致捉生代死，怨怒上冲，何由救免。 於是广救真人上白天尊曰：斗中有妙行玉女，於昔劫以来，修诸妙行，誓扬正化，广济众生，普令安乐。 於是天尊乃命妙行玉女降生人间，救民疾苦，乃於甲申之岁，三月二十三日辰时，降生世间。 生而通灵，长而神异，精修妙行，示大神通，救度生民，愿与一切含灵解厄消灾，扶难拔苦，功圆果满，白日上升，土神社主奏上三天。 於是老君勑下辅斗昭孝纯正灵应孚济护国庇民妙灵昭应弘仁普济天妃。 於是天妃听宣法音，弘是愿言：自今以后，若有行商坐贾，买卖求财，或农工伎艺，种作经营，或行兵布阵，或产难不分，或官非挠聒，或口舌所侵，多诸恼害，或疾病缠绵，无有休息，但能起恭敬心称吾名者，我即应时孚感，令得所愿遂心，所谋如意。 吾常游行天界，徧察人间，以致地府泉源江河海上，一切去处，令诸所求，悉皆遂愿。 於是广救真人闻是愿言，稽首归依，而说偈曰： 勑封辅斗，显迹威灵。 飞符走印，统领天丁。 收捕奸盗，斩灭妖精。 扶危济险，护助天兵。 邪魔永殄，疾病安宁。 敬顺者泰，横逆者倾。 厌息火盗，断绝邪冥。 东西南北，四方肃清。 神威震肃，家国咸宁。 英烈天妃，善庆明时。 游行三界，徧察灵祇。 风雷卫护，兵将维持。",
      "translated_text": "*The Heavenly Honored Lord Lao Speaks the Efficacious Sutra of the Heavenly Consort’s Salvation from Suffering*\n\n**Title:** *The Heavenly Honored Lord Lao Speaks the Efficacious Sutra of the Heavenly Consort’s Salvation from Suffering*\nAuthor unknown, dating to the early Ming dynasty. Falsely attributed to the Heavenly Honored Lord Lao and the Perfected One of Vast Salvation, recounting the Heavenly Consort’s (Mazu’s) descent into the world to save the suffering and protect the people. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, *Wondrous Writings* section of the *Divine Empyrean* Department.\n\n---\n\n*The Heavenly Honored Lord Lao Speaks the Efficacious Sutra of the Heavenly Consort’s Salvation from Suffering*\n\nWe look up to invoke the imperial-bestowed title, boundless in majesty,\nA compassionate assistant to the Northern Dipper, divinity most efficacious.\nHer awe-inspiring presence manifests upon the great seas,\nHer virtue and power widely bestowed—all under heaven revere her.\nShe shields the realm and saves the people without obstruction,\nAiding the perilous and rescuing the imperiled in an instant.\nNow roaming the celestial realms, now the human world,\nNow traversing the waves and billows, now the earthly prisons.\nDemons and specters all submit to her,\nPhantoms and malevolent spirits all hide in retreat.\nShe transforms misfortune into fortune as swiftly as a finger-snap,\nBestows blessings and dispels calamities as if annihilating dust.\nWhen mortals pray, holding golden censers,\nAll turn their hearts to her in earnest supplication.\n\n**Sincere Devotion and Homage:**\nIn the wondrous realm of Putuo, on Meizhou of Xinghua,\nHer numinous responses and virtue are extraordinary,\nHer filial piety moves the gods, her divine power vast.\nShe calms the waves to rescue those in distress,\nUpholds the perilous to revive the dying.\nGreat in compassion, great in mercy,\nShe saves the suffering, delivers from hardship—\nBy imperial decree, her luminous efficacy shines forth:\n*Heavenly Consort, Illustrious in Wondrous Response, Vast in Benevolence, Universally Salvific, Protector of the Realm, Shelter of the People.*\n\n**Invocation Mantra:**\nWe invoke the Three Heavens’ Supreme Overseer,\nThe Nine Heavens’ roaming sentinel, never at rest.\nThe August Heavenly Consort, whose merit shields the realm,\nBy imperial decree, her numinous grace defends the court.\nAdorned with a floral crown, she rides a phoenix chariot,\nClad in kingfisher robes, wielding a dragon’s form.\nTo the east, the Western Flower’s ghostly generals array,\nTo the south, she leads expeditions, aiding the divine hosts.\nHer sword and talisman gleam with the Dipper’s light,\nHer decrees and commands sweep away demonic spirits.\nHer majestic presence manifests—all revere her,\nHer heart moves with compassion, rain and dew equally bestowed.\nShe saves the people, shields the realm, bestowing grace,\nUpholds the harmed, eradicates calamity, fostering prosperity.\nHer power and virtue pervade the upper realms,\nHer mercy descends to the world, delivering all beings.\nMountains and rivers, altars and states, forever secure,\nWind in harmony, rain in season, preserving great peace.\nHer radiance scatters, her brilliance fills the Three Realms,\nIn the human world and heavens, sun and moon shine bright.\nCelestial dragons and ghosts all pay reverence,\nBy decree, all ascend to the Supreme Clarity.\nI now vow to uphold this forever,\nWith wholehearted devotion, I honor the true sutra.\n\n**Homage Mantra:**\nYin’s virtue first arises,\nYang’s light brings auspicious purity.\nHer majesty blazes forth,\nSaving and delivering the people.\nShe beheads demons, eradicates evil,\nSwiftly ascending to the Supreme Clarity.\nThe Three Terraces come to guard,\nAll sages welcome her.\nWearing heaven, treading earth,\nShe paces the Dipper and the Striding Star.\nNo sorrow remains unvanquished,\nNo wish left unfulfilled.\nRecite the divine mantra,\nThe Dao’s *qi* endures forever.\n\n---\n\nAt that time, the Heavenly Honored Lord Lao was in the Boundless Realm. Gazing upon the vast oceans, the great rivers and their sources, the Four Seas and Nine Rivers, the Five Lakes and watery marshes, he saw dragons, serpents, fish, and leviathans emerging and transforming, spirits and demons assuming a thousand forms.\n\nAmong the multitudes of beings, some engaged in commerce and trade, seeking treasures and rarities; some ventured to distant lands, trafficking with foreign domains; some from outer realms presented tribute, while the imperial state bestowed grace; some transported grain and tribute, sailing to and fro. Yet when winds and waters turned treacherous, tides surged violently, waves rose suddenly, or when wind and thunder struck, rain and hail poured down—then ghosts and spirits, seizing the shifts of yin and yang, capsized boats, took lives, and wrought indiscriminate harm. Those thus afflicted had no escape, forced to seize others to replace their deaths, their resentment surging upward—how could they be saved?\n\nThereupon, the Perfected One of Vast Salvation ascended to address the Heavenly Worthy: \"Within the Dipper resides the Wondrous Conduct Jade Maiden. Since kalpas past, she has cultivated myriad virtuous practices, vowing to propagate the true teaching and broadly deliver beings, universally granting peace and bliss.\"\n\nThen the Heavenly Worthy commanded the Wondrous Conduct Jade Maiden to descend into the human world and save the people’s afflictions. In the year of *jiashen*, on the twenty-third day of the third month at the hour of *chen*, she was born into the world.\n\nFrom birth, she was spiritually attuned; as she grew, her divinity was extraordinary. She cultivated wondrous practices, demonstrated great spiritual powers, and delivered the people. She vowed to resolve the hardships of all sentient beings, eradicate calamities, uphold the distressed, and relieve suffering. When her merit was complete and her fruit full, she ascended in broad daylight. The earth gods and altar lords memorialized her to the Three Heavens.\n\nThereupon, the Lord Lao issued a decree, bestowing upon her the title: *Heavenly Consort, Assistant to the Dipper, Filial and Pure in Illustrious Response, Faithfully Salvific, Protector of the Realm, Shelter of the People, Illustrious in Wondrous Response, Vast in Benevolence, Universally Salvific.*\n\nThen the Heavenly Consort, hearing the proclamation of the Dharma, expansively declared her vow: \"From this day forward, if there are traveling merchants or settled traders seeking wealth, or farmers, artisans, and craftsmen tilling and managing; if armies array in battle, or women struggle in childbirth; if official disputes arise, or slanderous tongues assail; if myriad vexations afflict, or illnesses linger without respite—whoever can arise with reverence and invoke my name, I shall respond in that very moment, granting their wishes and fulfilling their hearts’ desires, their plans succeeding as they intend.\n\nI constantly roam the celestial realms, pervading the human world, even to the earthly prisons, springs, rivers, and seas—every place. All who seek shall have their wishes fulfilled.\"\n\nThereupon, the Perfected One of Vast Salvation, hearing these vows, bowed in reverence and submitted, reciting a gatha:\n\nBy decree, she assists the Dipper,\nHer traces manifest, her power divine.\nFlying talismans, racing seals,\nShe commands the celestial soldiers.\nShe captures traitors, beheads demons,\nUpholds the perilous, rescues the imperiled, aiding the heavenly hosts.\nEvil spirits forever annihilated,\nIllnesses pacified, peace restored.\nThose who revere her prosper,\nThose who oppose her fall.\nShe suppresses fires and thefts,\nSevers the paths of darkness.\nEast, west, south, north—\nThe four directions purified.\nHer divine might shakes all,\nFamilies and realms secure.\nThe heroic Heavenly Consort,\nAuspicious in this enlightened age.\nRoaming the Three Realms,\nPervading all spirits.\nWind and thunder guard her,\nGenerals and soldiers sustain her.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1292,
      "start_sentence": 0,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.586782693862915,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说天妃救苦灵验经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "中临人世，为殄灾非。 下通地府，徧告神司。 枉横者戮，杀人者诛。 施人者爱，谋人者追。 一心归仰，万物咸熙。 急急如律令！ 尔时天妃闻说偈已，稽首天尊道前，而说誓言：一者，誓救舟船达于彼岸。 二者，誓护客商，咸令安乐。 三者，袪逐邪祟，永得消除。 四者，荡灭灾述，家门清浄。 五者，搜捕奸盗，屏迹潜形。 六者，收斩恶人，诛锄强梗。 七者，救民护国，民称太平。 八者，释罪解愆，离诸报对。 九者，扶持产难，母子安全。 十者，庇护良民，兔遭横逆。 十一者，卫护法界，风雨顺时。 十二者，凡有归向，保佑安宁。 十三者，修学至人，功行果满。 十四者，求官进职，爵禄亨通。 十五者，过去超生，九幽息对。 是时老君闻天妃誓言，乃勑玄妙玉女锡以无极辅斗助政普济天妃之号，赐珠冠云履，玉佩宝圭，绯衣青绶，龙车凤辇，佩剑持印，前后导从，部卫精严，黄蜂兵帅，白马将军，丁壬使者，柽香大圣，晏公大神，有千里眼之察奸，顺风耳之报事，青衣童子，水部判官，佐助威灵，显扬正化。 世间若有男女恭敬信礼，称其名号，或修斋设醮，建置道场，或清浄家庭，或江河水上转诵是经一徧，乃至百徧千徧，即得袪除灾难，殄灭邪魔，疾病自痊，官灾永息，行兵临阵，凶恶自离，囚狱之中，自然清泰，贼寇不侵，恶言无害，田蚕呎百倍，牛畜孳生，财禄盈余，经营获利，行商坐贾，采宝求珍，海途平善，无诸惊恐，求官作事，遂意称心。 是时天尊说是经毕，天龙鬼神咸愿护持，於是广救真人复说偈曰： 金阙圣后，勑封辅斗。 天人显迹，岳渎毓秀。 三月建辰，下弦应候。 护国灵长，嵩呼万寿。 □福不臻，何难不救。 与道合真，玉皇眷佑。 依经转诵，魔灵束首。 烧香散花，修斋设醮。 应有急难，即当虔告。 如法受持，无不应验。 急急如律令！ 真后斗仙，位列九天。 上佐金阙，下及泉源。 七元使者，道合自然。 人间皈仰，福报无边。 昊天罔极，降福绵延。 英烈天妃，应感无方。 人间天上，成敬其名。 贞风显佑，国土清平。 臣今遵奉，永保利贞。 是时广救说是偈已，妙行天妃稽首天尊，奉辞而退。 三界灵祇，天龙神鬼，咸生欢喜，信受奉行。 天妃救苦灵符 勑符咒曰 辅斗真人，感应化生。 一符一水，救济万民。 除灾去障，永保安宁。 急急如律令！ 齐天圣后，北斗降身。 三界显迹，巨海通灵。 神通变化，顺济称名。 三十二相，相貌端成。 随念随应，至圣至灵。 威光显赫，护国庇民。 海风吹浪，至祝降临。 一心瞻仰，显现真身。 虚空出现，统领天兵。 威神下降，鬼伏神惊。 莆田土主，圣化竹林。 北斗大圣，驱逐邪精。 消灾散祸，家国安宁。 急急如律令！",
      "translated_text": "Descending to the mortal realm, she annihilates disasters and wrongs.\nBelow, she reaches the earthly prisons, notifying all divine administrators.\nThe wrongfully oppressed are avenged,\nThose who kill are executed.\nThose who give are loved,\nThose who scheme are pursued.\nWith wholehearted reverence,\nAll things flourish in harmony.\nSwiftly, swiftly, as the law commands!\n\nThereupon, the Heavenly Consort, having heard the gatha, bowed before the Heavenly Venerable and proclaimed her vows:\n\nFirst, she vows to ferry boats and ships safely to the other shore.\nSecond, she vows to protect merchants and travelers, ensuring their peace and joy.\nThird, she vows to expel malevolent spirits, forever dispelling them.\nFourth, she vows to eradicate calamities and misfortunes, purifying households.\nFifth, she vows to hunt down traitors and thieves, banishing their traces and forms.\nSixth, she vows to capture and execute the wicked, eradicating the violent and obstinate.\nSeventh, she vows to save the people and protect the realm, bringing them great peace.\nEighth, she vows to absolve sins and dissolve transgressions, freeing all from karmic retribution.\nNinth, she vows to assist in difficult childbirths, ensuring the safety of mother and child.\nTenth, she vows to shelter the virtuous, sparing them from unjust harm.\nEleventh, she vows to guard the Dharma realm, bringing timely winds and rains.\nTwelfth, she vows that all who turn to her shall be protected and blessed with peace.\nThirteenth, she vows that those who cultivate the Dao shall achieve fruition in their practice.\nFourteenth, she vows that those who seek office and promotion shall attain rank and prosperity.\nFifteenth, she vows that the departed shall transcend suffering, and the Nine Dark Realms shall know rest.\n\nThen, the Venerable Lord, having heard the Heavenly Consort’s vows, commanded the Mysterious and Wondrous Jade Maiden to bestow upon her the title of **Unbounded Dipper-Assisting Governance and Universal Salvation Heavenly Consort**. He granted her a pearl crown and cloud-embroidered slippers, jade pendants and a ritual scepter, crimson robes with azure sashes, a dragon-drawn chariot and phoenix palanquin, a sword and seal. Before and behind, her retinue was majestic and solemn. Her forces included the **Yellow Wasp Marshal**, the **White Horse General**, the **Ding-Ren Envoys**, the **Tamarix Incense Great Sage**, and the **Yan the Great Deity**, who possessed the **Thousand-Mile Eye** to detect treachery and the **Favorable Wind Ear** to report affairs. Blue-robed youths, water bureau officials, and divine aides bolstered her might, manifesting the true transformation.\n\nShould any man or woman reverently invoke her name, or perform purification rites and establish altars, or maintain a pure household, or recite this sutra once—even a hundred or a thousand times—over rivers and seas, they shall be delivered from disasters, malevolent spirits annihilated, illnesses healed, official misfortunes forever stilled. In battle, evil shall depart; in prisons, peace shall reign. Bandits shall not invade, slander shall not harm. Silkworms and crops shall yield a hundredfold, livestock shall multiply, wealth and emoluments overflow, commerce thrive. Merchants and traders, seeking treasures, shall traverse the seas in safety, free from fear. Those seeking office or undertaking affairs shall achieve their desires.\n\nWhen the Heavenly Venerable had finished expounding this sutra, the devas, dragons, ghosts, and spirits all vowed to uphold it. Thereupon, the **Vast Salvation Perfected One** recited another gatha:\n\nThe Golden Portal’s Sacred Empress,\nEnfeoffed to assist the Dipper.\nHer divine traces manifest among heaven and humankind,\nMountains and rivers nurture her excellence.\nThe third month’s *chen* day,\nThe waning moon answers the season.\nProtecting the realm, her spirit endures,\nA myriad lifetimes proclaimed in homage.\nWhat blessing does she not bestow?\nWhat peril does she not rescue?\nIn harmony with the Dao, true and real,\nThe Jade Emperor cherishes and protects her.\nRecite this sutra in accord,\nAnd demonic spirits shall bow their heads.\nBurn incense, scatter flowers,\nPerform purification rites, establish altars.\nIn times of urgent peril,\nPray devoutly.\nReceive and uphold it as prescribed,\nAnd all shall be answered.\nSwiftly, swiftly, as the law commands!\n\nThe Dipper Immortal, True Empress,\nRanked among the Nine Heavens.\nAbove, she aids the Golden Portal,\nBelow, she reaches the springs’ source.\nThe Seven Primes’ Envoys,\nIn harmony with the Dao’s spontaneity.\nMortals revere and turn to her,\nTheir blessings boundless.\nThe boundless heavens,\nBestow blessings without end.\nThe heroic Heavenly Consort,\nHer responses boundless.\nBetween heaven and earth,\nAll honor her name.\nHer pure virtue manifests protection,\nThe realm knows peace.\nYour servant now obeys and upholds,\nForever preserving prosperity and integrity.\n\nWhen the Vast Salvation had finished reciting this gatha, the Wondrous Conduct Heavenly Consort bowed before the Heavenly Venerable, took her leave, and departed. The spirits of the Three Realms, devas, dragons, gods, and ghosts all rejoiced, faithfully receiving and practicing it.\n\n**Heavenly Consort’s Salvific Talisman**\nThe talisman’s incantation proclaims:\nDipper-Assisting Perfected One,\nResponsive and transformative in birth.\nOne talisman, one draught of water,\nSaves and aids the myriad people.\nDispels disasters, removes obstacles,\nForever ensures peace and tranquility.\nSwiftly, swiftly, as the law commands!\n\nThe Celestial Empress,\nDescended from the Northern Dipper.\nHer traces manifest in the Three Realms,\nHer spirit flows through the vast seas.\nDivine transformations, wondrous powers,\nInvoked by name, she brings salvation.\nThirty-two marks,\nHer countenance perfect and complete.\nResponsive to every thought,\nMost sacred, most divine.\nHer majestic radiance resplendent,\nProtecting the realm, sheltering the people.\nSea winds stir the waves,\nHer blessings descend upon prayer.\nWith wholehearted reverence,\nHer true form manifests.\nAppearing in the void,\nCommanding the heavenly hosts.\nHer divine might descends,\nGhosts submit, spirits tremble.\nThe **Putian Earth Lord**,\nSacred transformation in the bamboo grove.\nThe **Northern Dipper Great Sage**,\nDrives away malevolent spirits.\nDispels disasters, scatters misfortunes,\nHouseholds and realm secure.\nSwiftly, swiftly, as the law commands!",
      "overlap_context": " the heavenly hosts.\nEvil spirits forever annihilated,\nIllnesses pacified, peace restored.\nThose who revere her prosper,\nThose who oppose her fall.\nShe suppresses fires and thefts,\nSevers the paths of darkness.\nEast, west, south, north—\nThe four directions purified.\nHer divine might shakes all,\nFamilies and realms secure.\nThe heroic Heavenly Consort,\nAuspicious in this enlightened age.\nRoaming the Three Realms,\nPervading all spirits.\nWind and thunder guard her,\nGenerals and soldiers sustain her.",
      "start_char": 1292,
      "end_char": 2333,
      "start_sentence": 57,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.37863254547119,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说天妃救苦灵验经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右天妃灵符，如有急告焚香，念前咒七遍，书此符，用井花水磨乳香调服，自然安好，无不应验。 太上老君说天妃救苦灵验经竟",
      "translated_text": "The **Divine Talisman of the Heavenly Consort**—when in urgent need, burn incense, recite the preceding incantation seven times, inscribe this talisman, and grind it with well-drawn water and frankincense to consume. Naturally, all shall be well, and none shall fail to receive response.\n\nThus concludes the *Most High Lord Lao’s Scripture of the Heavenly Consort’s Efficacious Salvation from Suffering*.",
      "overlap_context": "m, sheltering the people.\nSea winds stir the waves,\nHer blessings descend upon prayer.\nWith wholehearted reverence,\nHer true form manifests.\nAppearing in the void,\nCommanding the heavenly hosts.\nHer divine might descends,\nGhosts submit, spirits tremble.\nThe **Putian Earth Lord**,\nSacred transformation in the bamboo grove.\nThe **Northern Dipper Great Sage**,\nDrives away malevolent spirits.\nDispels disasters, scatters misfortunes,\nHouseholds and realm secure.\nSwiftly, swiftly, as the law commands!",
      "start_char": 2334,
      "end_char": 2396,
      "start_sentence": 123,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.4346117973327637,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说天妃救苦灵验经.txt",
        "category": "本文类"
      }
    }
  ]
}