{
  "source_id": "太上元宝金庭无为妙经",
  "source_file": "chunked_daozang\\太上元宝金庭无为妙经.json",
  "total_chunks": 7,
  "total_original_chars": 7202,
  "total_translated_chars": 40840,
  "total_translation_time": 189.66211891174316,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上元宝金庭无为妙经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Primordial Treasure Scripture of the Golden Court of Non-Action**\n\n**Scripture Title:** *The Supreme Primordial Treasure Scripture of the Golden Court of Non-Action*\n**Volume:** One\n**Source:** Ming Dynasty *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\n### **The Supreme Primordial Treasure Scripture of the Golden Court of Non-Action**\n\n#### **Chapter One: The Great Void**\nThe Dao speaks:\nFormless, it merges with the Void; within it, the myriad things move through the Two Modes—this is called the Great Void.\nThus, within the Void there is Non-Being; within Non-Being there is Being. Being gives rise to the One; the One gives rise to the Two; the Two gives rise to the Three; the Three gives rise to the myriad things—this is called the Great Origin.\nThe Great Void is the workings of spirit; through its workings, the myriad things are born.\nThe Great Origin is the transformation of spirit; through its transformation, the myriad things take form.\nBorn without attachment, formed without action—how wondrous its principle! Who would claim that the vastness of Heaven and Earth could ever alter its law?\n\nThe Queen Mother of the West says:\nThe Dao is so great that it encompasses Heaven and Earth, yet its Dao is unseen.\nI would transcend Heaven and Earth to behold the formless Dao, to create the True Void, and to turn the mechanism of supreme subtlety—how could this be otherwise?\nThus, for the divine person who would observe beyond Heaven and Earth, nothing surpasses the formless.\nTo fashion the Eight Subtleties of the Void, nothing surpasses spiritual transformation.\nThe form of the formless, the transformation of spiritual transformation—this may be called the Dao.\n\n#### **Chapter Two: Wondrous Transformation**\nThe Dao speaks:\nCan the Dao be enacted? Its function lies in wondrous application; its essence lies in True Emptiness.\nThus, the living observe it to live; the dying observe it to die.\nHard and soft draw upon the Dao of Earth as their material; yin and yang follow the Dao of Heaven to attain fulfillment.\nThereafter, the myriad things transform without comprehension; the Five Phases each follow their nature—all through the Dao of Primordial Unity, conforming to the numbers of spontaneity.\nThe sage embodies subtlety to observe the world.\nThe world transforms spontaneously, thus following the course of nature and destiny.\nTo observe the heart of Heaven and Earth is to attain the subtlety of the world’s heart.\nThe world’s heart is the attainment of the people.\nHaving attained the people and drawn them near, they return as infants to their nursing mother.\nThose who establish the world’s laws model them upon the heart’s own attainment.\n\nThe Queen Mother of the West says:\nWith a single heart, one observes the world—the world is but a single heart.\nWith many hearts, one observes the world—the world is but many hearts.\nExhaust the heart to observe the people’s hearts; the people’s hearts rest in the heart.\nPreserve the heart with one’s own heart—then the world is all one’s own heart.\nHeart upon heart, subtlety upon subtlety; observation upon observation, spontaneous transformation.\nTo govern the world without disorder, to govern the four limbs without peril—if later generations practice this, who would not find peace and return to the world?\n\n#### **Chapter Three: Spontaneity**\nThe Dao speaks:\nThat which is nameless yet named is spiritual transformation; that which arises spontaneously is wondrous application.\nThe world’s subtleties have form: the subtlety of yin and yang, the presence of cold and heat.\nThe sage attains the Dao of spontaneity, embodying Heaven and Earth, calculating yin and yang, modeling cold and heat, circulating qi, and harmonizing male and female through the union of essence and spirit—shifting with the four seasons’ swiftness and slowness.\nObserving from beyond Heaven and Earth through the Dao of spontaneity, thus all who cast off the mundane and enter sageliness undergo transformation, and those who enter the divine undergo transmutation—transforming Heaven and Earth.\nThe mechanism of the Perfected is the law beyond form.\nWho can wield the subtlety of the formless to transform the formless? The formless, in turn, takes form.\nIf one wishes to enter form from the formless, to employ form for this—all is the Dao of spontaneity.\n\nThe Queen Mother of the West says:\nThe Dao of spontaneity refines qi to preserve the True, emerging from the gate of life and death.\nWithin the utmost emptiness and non-being, it once more unites the utmost spirit with form, shifting and transforming in coming and going, aligning with the revolutions to observe the sagely, responding to the mechanism’s Dao—yet it cannot be approached.\nHaving already transcended life and death, entered non-being and formlessness—why then return to the bodily form?\nFor if all is non-being, how can spirit know? If all is being, how can spirit depart?\nSpontaneous spiritual transformation—all being, all non-being—spirit remains whole and undispersed.\nYet when proven in material form, what thing does it enter or leave?\nThus it is said: The sage leaves no traces; the Perfected leaves no tracks.\n\n#### **Chapter Four: The Great Subtlety**\nThe Dao speaks:\nThe Dao has that which cannot be spoken, and that which can be spoken.\nThat which cannot be spoken is great; that which can be spoken is small.\nThat which cannot be spoken gives life and death to the myriad things, shifting spirit and altering subtlety.\nThat which can be spoken gives rise to the life and death of the myriad things; Heaven and Earth are created and transformed through it.\nThus, the Dao of the Perfected attains the principle of the Great Subtlety—yet it cannot be expressed in form or words.\nIf it cannot be spoken, then observe only the words of Heaven and Earth.\nThe Dao of Heaven has short and long: only the short becomes shorter, while the long does not become longer again.\nMoreover, to the right of the Great Origin, days grow long and people grow great; years lengthen and things flourish—yet in this age, all is short: the people are frivolous, the fortunes brief.\nThe measure of Heaven is three hundred and sixty-five calendrical divisions; if diminished, it harmonizes; if augmented, it weakens.\n\nThe Queen Mother of the West says:\nThe Great Subtlety is the law of Heaven’s waxing and waning.\nThe Dao of Heaven gradually shortens; the Dao of Earth gradually lengthens.\nRulers multiply their departures; the people suffer hunger and thinness.\nThe Dao of Heaven often seems insufficient—thus the revolutions of graded difference.\nHeaven is long, Earth is short; Heaven is distant, Earth is near; yang wanes, yin reaches its extreme.\nEver knowing the Dao of the Great Subtlety, one thereby rectifies and orders yin and yang, observing Heaven, Earth, and humanity.\n\n#### **Chapter Five: Spirit-Wandering**\nThe Dao speaks:\nSpirit-wandering traverses beyond the Eight Heavens, to the utmost qi of the Eight Yangs, the stars that weave Heaven’s woof, the degrees that measure the River’s warp—thus the *Supreme Primordial Treasure Scripture of the Golden Court of Non-Action* transforms form.\nThe Dao of Heaven responds with goodness to non-being.\nThe subtlety of wordless speech—the Perfected grasps the true mechanism of Heaven and Earth.\nThus, the Eight Limits revolve in cycles; one may wander and interchange forms and vessels.\nThe spirit of humanity arises from wholeness and stability, attaining perfection—its wondrous wandering cannot be guarded, for all is the principle of spontaneity.\n\nThe Queen Mother of the West says:\nI once received from the Yellow Emperor the subtlety of spirit-wandering.\n\nThe spirit-wanderer rides the fire dragon to ascend and govern Heaven. The Perfected’s spirit flourishes in wholeness; yin and yang are complete, the body is harmonious, the voice carries far and distinct. With a finger, one opens the Gate of Heaven, releasing the crimson seal’s radiance—thus the spirit crosses of itself. Returning to the great gate, the finger descends of itself. Since the spirit is whole and able to depart, one naturally senses no constraint within. Spirit and body separate; the mind directs toward the Gate of Heaven, emitting light from between the brows and the Hall of the Seal—thus the spirit emerges of itself. If one merely exits the Gate of Heaven without opening the Hall of the Seal, the departure will be irreversible. The crimson palace’s seal is the heart; though the spirit departs, the hun-soul does not. The crimson palace’s seal, where the heart retains the hun-soul, is not yet dead—thus the spirit still has a body.\n\n**Chapter Six: Governing Qi**\nThe Dao speaks: Qi is the substance of form and formlessness. Gathered, it becomes form; dispersed, it becomes wind; stirred, it becomes movement; congealed, it becomes things. For the Perfected to govern qi is to preserve qi and refine the bones—when bones are light, there is no clumping. Accumulate essence to perfect the spirit; the spirit transforms and qi rides upon it. The Dao of governing qi begins with lightening the body. To lighten the body, set immortality as the heart’s intent, and first cease labor, hunger, thirst, and desire. Act before the body, and qi will begin to ride. When the body departs yet the spirit remains whole, qi governs of itself.\n\nThe Queen Mother of the West says: To guard the governing of qi—if one relies on the body, it is laborious and difficult to achieve; if one relies on the spirit’s spontaneity, it may be attained. The ancients consumed qi to lighten the bones and ingested herbs to lighten the body. Thus, with lightened body and bones, qi may be governed—entering water without drowning, entering fire without burning. The Dao begins with ingesting herbs to cease grain-eating as supreme, and consuming qi with a mindless heart as foremost. When the Perfected’s body is light, the body resembles pine and poria. Consuming qi is the qi of the Zi-Wu hexagram’s completion. Ingesting herbs creates emptiness; emptiness becomes the body—thus qi is attained.\n\n**Chapter Seven: The Great One**\nThe Dao speaks: Heaven is eternally clear, Earth eternally tranquil—all is the Dao of the Great One. Thus, affairs value having a beginning, and then there is constancy. With constancy, there is no arising or ceasing. Without arising or ceasing, Heaven and Earth do not act as thieves to it, and it is called the Great One. Heaven has the Great One, and the myriad things are born. Humans have the Great One, and the Five Phases are employed. The One is Heaven’s utmost essence—unmuddied, unburdened, supremely clear, supremely numinous. The true treasury of ceaseless generation—thus the Four Images are illuminated.\n\nThe Queen Mother of the West says: The Great One is the primordial ancestor. Nurtured, it is inexhaustible; employed, it is unfailing. It generates the myriad things, the ancestor of qi, the foundation of creation. Once humans enter the subtlety of the Five Phases and Eight Trigrams and again perceive the Great One, they know that Heaven and Earth’s yin and yang do not steal from them, and all revolving to left and right is their own possession. Unassailed by weapons, unenticed by profit—this may be called utmost oneness. Form attains the One and is not wearied; spirit attains the One and is greatly perfected. Thus, the One—at the beginning, observe the great river’s waters, flowing ceaselessly. Overflowing the heart’s source, they breach the ocean’s waves, surging endlessly, streaming into the spirit’s treasury. Then the spirit moves and form is whole; the spirit is whole and form flourishes.\n\n**Chapter Eight: Non-Action**\nThe Dao speaks: Non-action is non-action without non-action; action is action with action. The spirit can shift and transform, seizing the true qi. It can inhale and exhale yin and yang, externally forgetting hunger and cold, internally forgetting ascent and descent, taking self-attainment as the heart, taking emptiness and non-being as conduct. Thus it is said: non-action. Non-action should have no use for action, yet takes action as its root. With a root in action, the Five Phases come first. For those who act as Heaven and Earth, there is action in the many hands, non-action in the folded hands. For those who match the Five Phases, there is action in the Four Images, non-action in imagelessness. Folded hands—sages let robes and skirts hang loose, and the world is governed. Imagelessness—the Perfected perfects the spirit, and form is naturally at peace.\n\nThe Queen Mother of the West says: Learning reaches its limit in reduction; the Dao reaches its limit in non-action—this is the ultimate attainment. Observing without observation, abiding without abode, moving without movement, employing without employment—though Heaven and Earth are vast, they are not vast; though yin and yang are subtle, they are not subtle. The Perfected enters the realm of utmost stillness, the realm of emptiness and non-being—this may be called non-action. Thus, non-action has its mechanism, and action is unceasing; non-action loses its mechanism and perishes of itself.\n\n**Chapter Nine: Generating the Spirit**\nThe Dao speaks: When the Five Stars gather in the Celestial Market, sages are born; when the Five Phases match Earth’s qi, the myriad things take form—thus the Dao of Heaven and Earth all has constant numeration. Humans have the Five Stars gathered in the central treasury, the utmost refined qi, and thus the inner sage is born. The Five Phases match Earth’s qi, and thus things take form. Within humans, the Five Phases gather in the spirit’s treasury, the Jade Flower appears, and the Five Phases descend to the center and preside. The Perfected is humanity’s true self. First is the womb immortal, second the true form, third the true child, fourth the womb true—all are one. Able to be one’s own form, able to speak one’s own affairs, knowing all, penetrating all, exiting and entering life and death, lifting and carrying Heaven and Earth—thus it is called spirit. This is the Perfected.\n\nThe Queen Mother of the West says: The spirit first knows to preserve form, preserves life without dying, exits and enters the Gate of Heaven, becomes one’s inner body, adheres and transforms, accompanying the body equally—this is the true within the womb. Within, Kan and Li intermingle and generate the womb; the womb generates inner and outer numinosity—thus one can exit form without dying, enter life without being born.\n\n**Chapter Ten: The Jade Flower**\nThe Dao speaks: Humans are constantly without mind, constantly without constant form—Heaven and Earth move and rest. Yet there are those who can endure long, for they attain the One, and the spirit resides within. Humans have minds, and thus drift in the currents of life and death, emerging and submerging in love and desire—then they scatter and are no longer seen.\n\nOne who can preserve the One and maintain authenticity for long, practicing the Dao of stabilizing the spirit, may then perceive it. The Queen Mother of the West says: The human heart is the palace of the Sovereign; its spirit is the Lord of Jade Flower. Stabilizing the spirit and severing thoughts, free from dreams, waking terrors, or palpitations—practicing this long and steadfastly—one may respond to the mechanisms of Heaven and Earth, the affairs of ghosts and spirits, all becoming thoroughly clear and understood. Thus one becomes an Inner Sage. The true persons of antiquity took this as their teacher, crossing unknowable perils, aiding the ghosts of Yellow Springs. All ascend through the Three Realms, gathering the hidden and obscure of Heaven and Earth, tracing the subtle and concealed of yin and yang—all is naturally attained.\n\nThe spirit arises from the completeness of the Five Phases, transforming and ascending into the Cinnabar Chamber, seated at the Southern Culmen upon the Winding River. Within the body, the eight stars and three primordial spirits pay homage day and night. If even one spirit fails to attend, it is said that unforeseen calamity will strike, and one’s name will be erased from the registers of the unseen.\n\n**Chapter Eleven: Uniting the Body**\nThe Dao speaks: The Five Phases gather, husband and wife unite—when husband and wife unite, the true becomes true. After ten months, the true child is born. The true child is the spirit complete, the inner body. It exits and enters beyond Heaven and Earth, traverses beyond the eight poles of creation, comes and goes through the celestial cycles, paces the stars and steps the sun, parts the near clouds and rainbows, gathers the sources of the Milky Way, and returns to the things of transformation—thus it is called *Uniting the Body*.\n\nThe Queen Mother of the West says: The formless within form unites with form—thus humans may attain long life. Form is vast because of the formless. Forms are many because of the formless. What exists can be measured; what exists can be seen. Yet the form of the formless, transforming into myriad bodies, is not considered numerous. The formless attaches to form, and form becomes its dwelling. Form attaches to the formless, and the formless becomes its master. All masters thus do not die. Those who pace the stars do so by exiting the Gate of Heaven with this body, reaching the Ox and Dipper, and proceeding to the Celestial Market—thus knowing the yet-unrealized affairs of the world.\n\n**Chapter Twelve: Preserving the Form**\nThe Dao speaks: The Dao of not dying is thus called *Preserving the Form*. The Dao of preserving the form lies in refining the form. When the true person can refine the Five Phases, unite yin and yang, and intermingle Kan and Li, then old age returns to a state like an infant. Thereafter, returning to the Cinnabar Field, one naturally possesses qi. When clarity ascends to the Crimson Palace, it transforms into spontaneous radiance, suffusing the entire body. In the dark of night, amidst quiet observation, myriad spirits pay homage—then the form is not stolen by thieves.\n\n**The Queen Mother of the West states:** The formless form enables longevity; the qi-less qi enables immortality. The formless means not taking form as form. The qi-less means qi is what forms it. Ordinary people’s qi scatters and does not transform; the true person’s qi transforms and does not scatter.\n\n**Chapter Thirteen: Kan and Li**\nThe Dao speaks: Within yin there is yang, and yang is the supreme yang. Within yang there is yin, and yin is the supreme yin. The north is yin, its spirit is water, which gives birth to the myriad things—it is the ancestor of qi and the origin of all yang. The south is yang, its spirit is fire, which transforms the myriad things—it is the root of form and the convergence of all yin. Kan preserves essence and safeguards qi without withering; Li stabilizes spirit and refines the true without obscurity. To know this most subtly is to be called a true person.\n\n**The Queen Mother of the West states:** The essence of yin and yang is Kan and Li. Stabilizing spirit and rectifying nature arise from the heart’s unwavering clarity; preserving essence and nurturing qi ensure qi is never exhausted. Water, if dammed, flows; if blocked, it rots. Fire, if stirred, burns; if stilled, it shines. Thus, the sage guides the water, causing it to ascend from the earthly gate to irrigate the Muddy Pellet, then descend to the Flowery Pond and enter the Crimson Palace. As for fire, if the heart is not constrained by things, always existing as if non-existent, and not moved by externals, then over time, the spirit will not scatter.\n\n**Chapter Fourteen: Union**\nThe Dao speaks: Kan male and Li female, the Yellow Dame arranges their marriage; the Metal Mother and Wood Father serve as matchmakers to connect them. Moreover, the Dao of union lies in the convergence of the Five Phases. The Five Phases are union. When the Five Phases gather, metal and wood interact, then Kan male and Li female meet and unite. The Four Symbols come and go, communicating affection. The Five Phases assemble, forming pairs.\n\n**The Queen Mother of the West states:** When male and female meet, it occurs at the fiftieth cycle. Fifty signifies a man at thirty and a woman at twenty—this is the harmony of heaven and earth’s numbers. The man embodies the heavenly Dao: Kan moves with one, its palace holding water. The woman embodies the earthly Dao: Li corresponds to two, its palace holding fire. When Kan encounters three, wood connects and fire depletes. When Li encounters four, metal speaks of water’s nature. When Kan encounters five, the Yellow Dame guides it upward. When Li encounters six, water draws it downward. When Kan encounters seven, fire matures and they unite. When Li encounters eight, wood adorns it with roots. When Kan encounters nine, the Metal Mother meets in union. When Li encounters ten, earth forms the pair. These are the numbers of the Five Phases’ interactions. Preserve the spirit to perfection, and water and fire will naturally become efficacious.\n\n**Chapter Fifteen: The Five Phases**\nThe Dao speaks: The heavens have five planets, the earth has five constants, and humans have the Five Phases—these are natural things. Only when the Four Symbols gather at the center does the Golden Elixir shine brilliantly. When yin and yang unite and the Two Modes form a pair, then ascent and descent begin. Metal fills and generates water, and water first transforms—thus it is called *qi-water*. Qi-water, when moving, ascends as qi; when still, it takes form as water. Water has great benefit, giving life to the myriad things—thus water is the essence of the myriad things. When water is complete, fire gathers; then the dragon moves ahead, the tiger follows behind, the Four Symbols unite as one, and the Five Phases assemble.\n\n**The Queen Mother of the West states:** When qi is still and spirit is stabilized, Kan and Li are complete. When Kan and Li are complete, then metal and wood separate. When metal and wood separate, the Five Phases move. When the Five Phases move, the center gathers. Fire arises from below, water irrigates from above; the elixir forms in the heated crucible. Taking day and night as a cycle, the twelve hours as twelve months, and the twenty-four qi as seasonal divisions—this models heaven and earth, creates yin and yang, and follows the natural pattern. Thus it is said: Nurturing the Golden Elixir for three years makes one a true person. At the winter solstice, yang is born and fire is advanced; at the summer solstice, yin is born and fire is withdrawn. Advancing and withdrawing each use twelve measures.\n\n**Chapter Sixteen: Obtaining the Ground**\nThe Dao speaks: When the two qi ascend and descend, and the three palaces rise and fall, then the Five Phases unite and gather in the central land. The union of the Five Phases first depends on its ground. Water is born from metal: Kan moves and Dui generates, advancing fire. Fire is born from wood: Li moves and Zhen leads, circulating water. Without metal, water does not form; without wood, fire does not move. The Yellow Dao resides at the center, and the Five Phases gather there. The method of obtaining the ground lies in balancing qi and regulating water, stabilizing breath and nurturing fire, ensuring that above and below do not separate. After three hundred and sixty days of practice, one enters stillness—this is where the method of longevity begins.\n\n**The Queen Mother of the West states:** The Dao of life and nurturance fundamentally seeks its root; the benefit of planting and cultivation lies in obtaining the ground. Obtaining the ground means the three fields are level and the Four Symbols are harmonious. The three fields being level refers to the three cinnabar fields being balanced, their names unchanging, allowing one to observe the natural qi of the Four Symbols—this is called obtaining the ground. Obtaining the ground is the Dao of the true person. The Five Phases’ abilities, the five evils and ten poisons, leave the skin without cold or suffering, the flesh without decay or neglect. Against the weapons of the five armies, even blood does not flow. Blood not flowing means the spirit is stabilized.\n\n**Chapter Seventeen: The Three Palaces**\nThe Dao speaks: Above is the Muddy Pellet, in the center is the Divine Mansion, and below is the Azure Sea. The three palaces are the source of life and death, each capable of giving life or causing death. To attain longevity, one must know their spirits. Obtain their spirits and employ their methods. The upper palace, the Muddy Pellet, is the source of essence. If the Muddy Pellet does not open, essence does not scatter and spirit does not depart. The middle palace, the Crimson Palace, is the dwelling of spirit. If the Crimson Palace is unmoved, essence does not stray and spirit does not weary. The lower palace, the Cinnabar Field, is the root of true water. If the Cinnabar Field is not agitated, essence does not leak and spirit does not die.\n\n**Chapter Eighteen: The Two Qi**\n\nThe Dao speaks: The first death is called \"brain leakage into essence\"; the second death, \"spirit shifting into the kidneys\"; the third death, \"essence draining and spirit scattering.\" To attain longevity, ensure the upper and lower do not abandon each other.\n\nThe Queen Mother of the West says: The upper Cinnabar Field’s palace is the palace of all yang. The utmost essence of yang gathers in the Celestial Pool. The Celestial Pool is the palace of the Cinnabar Field within the brain, the root of life and the dwelling of primordial *qi*. If one wishes the spirit not to scatter, guard the Muddy Pellet without movement. To keep the Muddy Pellet unmoved, guard the heart. When the heart is still, all things are complete. Thus it is said: Fire refines the Muddy Pellet, consolidating it so it does not leak; fire draws the Muddy Pellet, causing leakage and the death of spirit.\n\n**Chapter Eighteen: The Two Qi**\n\nThe Dao speaks: When the two *qi* are harmonized and set in motion, the Four Symbols contain radiance. The body transforms into primordial subtlety, movement and bearing circulate in all directions. Left and right, above and below, water and fire are drawn to and fro, nurturing the golden elixir’s embryonic treasure. Use metal as the crucible. Metal is *qi*. Burn it with wood. Wood is power. Within are the Eight Trigrams, Four Symbols, and Five Phases—natural things. The trigrams of the celestial cycle are the numbers of nature. Only the method of drawing water and fire with the two *qi* first requires harmonization.\n\nThe Queen Mother of the West says: The two *qi* are metal and wood. Metal is white in color; its virtue is majesty; its spirit, the tiger. Thus the *qi* of the lungs is called the White Tiger. Wood is green in color; its virtue is gentleness; its spirit, the dragon. Thus the *qi* of the liver is called the Green Dragon. Without the two *qi*, Kan and Li do not arise. If Kan and Li do not arise, there is no configuration for union. Therefore, regulate the *qi* to nurture the dragon, circulating it through the Gate of Heaven and Earth. The Gate of Heaven is the Muddy Pellet; the Gate of Earth, the Tail Gate. Then accumulate *qi* to nourish the dragon. Thus *qi* accumulates into water, and from water the dragon is born. Dragon moves and tiger follows, ascending and descending, drawing water and fire.\n\n**Chapter Nineteen: Seizing the Movements**\n\nThe Dao speaks: Heaven has the Five Movements; Earth has the Six Qi. They generate the myriad things and accomplish transformation. If one knows the movements of Heaven and Earth, one attains longevity without death. To understand their *qi*, know this: Heaven’s Five Movements are the *qi* of the Five Phases; Earth’s Six Qi are the numina of the Six Jia. One who knows the Five Phases and Six Jia yet is not a thief of Heaven and Earth is a Perfected Person. The Perfected Person seizes the movements of Heaven and Earth, ingesting the *qi* of the eight seasonal nodes.\n\nZhen corresponds to the eastern wood and is suitable for nourishing the liver. Li corresponds to the southern fire and is suitable for nourishing the heart. Dui corresponds to the western metal and is suitable for nourishing the lungs. Kan corresponds to the northern water and is suitable for nourishing the kidneys. Xun in the southeast is suitable for nourishing the gallbladder. Kun in the southwest is suitable for nourishing the stomach. Qian in the northwest is suitable for nourishing the large intestine. Gen in the northeast is suitable for nourishing the small intestine and bladder. This is seizing the movements of Heaven and Earth, not being a thief of them.\n\nThe Queen Mother of the West says: In spring and summer, nourish yang; in autumn and winter, nourish yin. Nourish yang with water; nourish yin with fire. The Five Phases rely on the two *qi*. Exhalation expels yin; inhalation draws in yang. Preserve the upright *qi* of the Five Phases: wood grows, fire sharpens, metal squares, water scatters. Thus inbreath and outbreath form a cycle. Regulate and nourish them—this is also called ingesting the flourishing *qi* of the eight nodes. Practiced over time, one will no longer hunger or thirst.\n\n**Chapter Twenty: Riding the Wind**\n\nThe Dao speaks: Heaven and Earth possess the *qi* of yin and yang, circulating through the four seasons to produce cold and heat. Thus cold arises when yang conceals and yin emerges; heat arises when yin recedes and yang ascends. Heaven and Earth have the signs of cold and heat; humans also have the signs of cold and heat. The natural cold and heat of Heaven’s movements have differences in speed and slowness, but human movements have no reversal of yin and yang’s transformations. When Heaven’s yin emerges and yang conceals, great cold causes *qi* to congeal and accumulate, hence winter’s descent of frost and snow is fitting. When Heaven’s yin recedes and yang ascends, great heat causes coagulation, hence summer’s rains are often torrential. If one embodies this, making yin overcome heat and yang overcome cold, then clouds may be ridden and wind may be harnessed.\n\n**Chapter Twenty-One: Forgetting Form**\n\nThe Dao speaks: To forget form is where *qi* gathers; *qi* is what form employs. Since there is form, without *qi* it cannot live. The way to nourish form begins with *qi*. Now that there is form, it is merely constrained by *qi*. All people take *qi* as their root; form should not be burdened by *qi*. Thus the Perfected Person, though possessing form, can forget it—this is the true Dao. To forget form is to refine *qi* and unite with form, unattached to things. Thus refining *qi* stabilizes the spirit. When the spirit is stable, *qi* is upright; when *qi* is upright, there is no cold or heat. Without cold or heat, form is not constrained. When form is not constrained, form may be forgotten.\n\nThe Queen Mother of the West says: Form is the dwelling of *qi*; *qi* is the function of spirit. When *qi* is complete and spirit is upright, there is inner true *qi*. Thus form does not cling to *qi*, and *qi* is not constrained by form. Its subtlety lies in circulating the full *qi* of the Five Phases up and down at midnight, as if in a primordial chaos. After three thousand days, *qi* can depart from form, and thus form may be forgotten. To depart from form is for spirit to emerge. When spirit emerges, it moves through *qi* by means of spirit-*qi*. When *qi* moves, then form becomes formless.\n\n**Chapter Twenty-Two: Primordial Qi**\n\nThe Dao speaks: When *qi* is ordered, illness does not arise; when *qi* is complete, spirit is naturally numinous. To order *qi* is to regulate the disharmony of the five viscera and four limbs. If there is illness in the abdomen, direct the gaze up and down, send left to right and right to left. Then lie prone, bend both hands beneath the heart, and align with the nape of the neck—benefit will come naturally. When the five viscera are deficient, face the five directions and visualize their colors, absorbing them to be cured.\n\nThe method for preserving primordial *qi*: Visualize *qi* ascending from the Primordial Sea, causing it to flow and circulate without cease. After thirty days, form will naturally depart.\n\nTo cultivate primordial *qi*, let it transform from small to great, adding to it daily. After forty-nine days, it will fill the body. When the body is full of *qi* and devoid of illness, the spirit will naturally align.\n\nThe Queen Mother of the West says: Primordial *qi* is refined *qi*. First, let fire flow unceasingly from the cinnabar field. At the initial hour of *zi*, perform three hundred and sixty cycles. At the initial hour of *wu*, let it descend from the heart and perform another three hundred and sixty cycles—then *qi* is primordial. One cycle is one round.\n\n**Chapter Twenty-Three: Entering the Chamber**\n\nThe Dao speaks: For the perfected person to nurture form, nothing surpasses refining *qi*. To refine *qi*, nothing surpasses stabilizing the spirit. To stabilize the spirit, nothing surpasses entering the chamber. Entering the chamber is the method for nurturing and settling the spirit.\n\nIn winter, keep warm; in summer, keep cool. In winter, do not use fire; in summer, do not use wind. Sit only on a proper mat, and the chamber must face south. First, dispel external pathogenic influences so they do not invade; then internal pathogenic influences will not arise. To dispel is to prevent pathogenic *qi* from invading, so the body naturally finds peace.\n\nThe Queen Mother of the West says: The art of entering the chamber requires a room six *zhang* square. Place windows on the east and west, and a door on the south, twelve *chi* high. The seating area should be eight *chi* square, furnished with thick woolen cushions. In summer, add a mat on top, and place armrests on either side. Sit upright with feet hanging down, one *chi* and two *cun* from the floor, so that rising and resting on either side does not cause fatigue. Then arrange the four sides.\n\nThe four sides should be draped with blue and white curtains; do not use the five colors, lest prolonged exposure blind the eyes. The eaves outside the door should be white, so the body finds peace and *qi* is not harmed.\n\n**Chapter Twenty-Four: Serving Qi**\n\nThe Dao speaks: *Qi* is supremely great and numinous, transforming heaven and earth, nurturing the myriad things. Though its bounds are unseen, every thing is of it. Without carving, the myriad things take form; without lifting, the myriad things come to life. Gathered, it becomes substance; dispersed, it becomes wind. Heaven knows not *qi* as heaven, earth knows not *qi* as earth, humans know not *qi* as humans, the myriad things know not *qi* as the myriad things, ghosts and spirits know not *qi* as ghosts and spirits, the ten thousand images know not *qi* as the ten thousand images.\n\nIf one knows what *qi* transforms, does one not know what *qi* steals? Heaven’s movements are external; humans respond, yet heaven does not steal their lifespan. Earth bears all below; humans respond, yet earth does not steal their bodies. The myriad things appear and respond, yet do not steal their *qi*. One who knows *qi* knows where yang is born.\n\nThe Queen Mother of the West says: *Qi* in heaven generates one yang at the winter solstice, and the myriad images respond. *Qi* on earth generates one yin at the summer solstice, and the myriad things respond. *Qi* in humans: at the initial hour of *zi*, when all yin converges, one yang is born—yang is born from true water. At the initial hour of *wu*, when all yang converges, one yin is born—yin is born from true fire.\n\nTrue water’s *qi* resides in the kidneys; kidney *qi* must not be stirred. True fire’s *qi* resides in the heart; heart *qi* must not be stirred. Where *qi* resides, visualize and respond to it.\n\n**Chapter Twenty-Five: Stabilizing the Spirit**\n\nThe Dao speaks: The human spirit has the heart as its chamber, blood as its sustenance, *qi* as its root, and the four limbs and five viscera as its servants. The spirit in the body is like a dwelling with life. If the dwelling has life, it thrives; without life, it decays.\n\nWhen the dwelling is new but lifeless, doors and windows unclosed, dust and filth enter from all sides. Pigs and rats gnaw its foundation, birds and sparrows peck its holes—gradually, it collapses. When the dwelling is dilapidated and lifeless, doors and windows crumble, dust and filth overflow. Pigs and rats ruin its foundation, birds and sparrows overturn its roof—then, though one wishes it not to decay, there is no way; it soon collapses.\n\nWhen a person’s spirit is whole and *qi* is aligned, stabilizing it is easy. The way to stabilize the spirit lies in guarding the heart; guarding the heart lies in cutting off thoughts; cutting off thoughts lies in ceasing desires—then the heart is upright. When the heart is upright, the spirit is stabilized.\n\nThe Queen Mother of the West says: The way of stabilizing and guarding is to know contentment, ensuring hunger and cold do not press in, and no reckless thoughts bind you. Nurture it by ascending to the heart with joy. At midnight, do not sit upright—simply level your hands, let the four limbs rest, cut off reckless thoughts, and visualize your body sitting within your heart. Practice this for seven months, and the spirit will not age. When the spirit is stabilized and *qi* is aligned, it remains ever like an infant, and the spirit is naturally numinous.\n\n**Chapter Twenty-Six: Cutting Off Thoughts**\n\nThe Dao speaks: Thoughts arise from the human mind. Humans have constant desires; when the mind strays even a single thought, the spirit stirs heaven and earth, searching the traces of yin and yang, going everywhere—where it goes is desire. Knowing and seeing desires arise, they become habitual.\n\nThoughts are a net in the void, vast and without attachment. The mind roams without cease, the spirit does not rest, *qi* is not aligned, the body is not at peace. Over time, this causes blood to wane, bones to decay, sinews to weaken, and essence to deplete. Then one dies yet does not transform; the hun-soul still wanders, unable to return and be reborn—thus becoming a *wangliang*.\n\nTherefore, the perfected person cuts off thoughts: acting without acting, not seeking appearances in future thoughts, responding to things as they come, adapting to affairs as they arise, acting when possible, stopping when not—thus, even in death, the spirit does not become a *wangliang*.\n\nThe Queen Mother of the West says: Human thoughts, when acted upon, bring misfortune. If humans had no thoughts, they would be unaware. Cutting off thoughts means not being greedy for or attached to sounds and sights, so the spirit is not enslaved.\n\nThe art of the perfected lies in guarding the heart without movement. The method for guarding the heart: at dawn, rise, adjust your robes and cap, enter the chamber, face south, clasp your hands, and sit. Envision your heart as white jade. Practice this for forty-nine days, and the spirit will stabilize.\n\n**Chapter Twenty-Seven: Cessation of Desires**\n\nThe Dao says: Reduce thoughts and diminish desires, and heaven and earth will not overturn. Still contemplation and forget schemes, and yin and yang will harmonize. All worldly scholars who cherish life must first cultivate the heart. Cultivating the heart lies in acting when desiring to act, yet not acting; moving when desiring to move, yet not moving—thus, even when not yet perfected, there is no harm in non-action.\n\nTherefore, the perfected first nurture the body, then nurture the heart. Only after nurturing the heart can desires be without desire, and thus one knows the spirits of heaven and earth and does not die. Not only does one not die, but one does not age.\n\nThe Queen Mother of the West says: Humans have hearts, and thus they fall ill; without illness, they live. Knowing what is wrong, they do not act. Heaven and earth have decay, yet heaven and earth do not change, and thus they do not die. Knowing what is wrong and rejecting it, ghosts and spirits do not steal, and heaven and earth do not take away.\n\nTherefore, in the dead of night, guard the *qi* of the cinnabar field, as the moon wanes and waxes. With the heart shielding and cutting off desires, after seven days of practice, the light will illuminate the body. Knowing the world’s wrongs and refraining from useless acts, the heart naturally achieves spiritual penetration.\n\nIt is said: Heaven and earth, water and fire, wind—the five phases of metal, wood, water, fire, and earth—unite to form the true. Like a towering peak built of piled stones, it scatters when touched and shatters when struck. To restore success—how easily can this be achieved?\n\n*The Supreme Primordial Treasure Scripture of the Golden Court of Non-Action* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上元宝金庭无为妙经 经名：太上元宝金庭无为妙经。 一卷。 底本出处：明《正统道藏》 正一部。 太上元宝金庭无为妙经 太虚章第一 道言：无形合虚，中有万物，而行二仪，是谓太虚。 故虚中无，无中有，有生一，一生二，二生三，三生万物，是谓太始。 太虚者，神运也，神运而万物生。 太始者，神化也，神化而万物形。 生而无托，形而无为，吾不知其至妙之理如是，孰谓天地之大，未易其法焉。 西王母曰：道至大，包天地不见其道也。 吾将欲出天地，观无形之道，造真虚，斡至妙之机，何能若是。 故神人者，欲观天地之外，莫若无形； 造八妙之虚，莫若神化。 无形之形，神化之化，可谓道也。 妙化章第二 道言：道可为哉，以妙用为用，真虚为体。 故生者观是以生，死者观是以死。 刚柔因地道以为材，阴阳法天道以为达。 然后万物不喻而化，五行各遂其性，皆由元为之道，合自然之数也。 圣人体妙以观天下。 天下自然而化者，乃顺性命而行焉。 观天地之心，其妙得天下心。 天下心是为得民。 得民而归之，若赤子之归乳母。 作天下法者，法得自心焉。 西王母日：以一心而观天下，天下惟一心耳，以众心而观天下，天下惟众心也。 尽心以观民心，民心以息心； 保心以己心，天下皆己心也。 心心自妙，观观自化，治天下以无乱，治四体以图安，后世行之，孰不安归天下也。 自然章第三 道言：名无名者，神化也； 生自然者，妙用也。 天下之妙有象，有阴阳之妙，有寒有暑。 圣人得自然之道，体天地，算阴阳，法寒暑，行炁运，男女以精神交，四时迟疾移。 以天地之外自然之道观之，故凡脱而入圣之化，而入神之移，而化天地。 真人之机，乃形外之法。 孰无形之妙而化无形，无形复有形。 若欲以无形入有形，以有形为之，皆自然之道也。 西王母曰：自然之道，炼炁全真，出生死门，至虚无之中，复以至神就形，移化往来，合运观圣，应机之道，仍不可迩边之。 且既出死生，入无有形，何谓复形躯也？ 盖全无，神何以知； 全有，神何以离？ 自然神化，全有全无，神圆不散。 然证於物形，出入何复物焉。 故日：圣人不迹，真人无迹。 太微章第四 道言： 道有不可言，道有可言。 不可言则大，可言则小。 不可言者，能生死万物，移神易妙。 可言者，万物由之生死，天地由之造化。 故真人之道得太微之理，然不可以形言。 不可以言，则惟观天地之言者。 天之道有短有长，惟短者更短，长者不复长也。 且太始之右，日长人大，年长物盈，今世短耳，民轻耳，短运耳。 天之度，三百六十五历，喊之则合，加之则弱。 西王母曰：大微者，天道盈亏之法也。 天道渐短，地道渐长，君繁离，民饥薄，天道常若不及，则等差之运，以天长地短，天远地近，阳衰阴极。 常知太微之道，是以整肃阴阳，观天地人也。 神游章第五 道言：神游者，八天之表，八阳之极炁，纬天之星，经河之度，是以五运太上元宝金庭无为妙经化形。 天道以善应无。 无言之妙，真人将天地之真机。 是以八表周旋，可游而互形器也。 夫人之神，由圆定，以全至，可游之妙非卫之为可，皆自然之理也。 西王母日； 吾尝受黄帝以神游之妙。",
      "translated_text": "**The Supreme Primordial Treasure Scripture of the Golden Court of Non-Action**\n\n**Scripture Title:** *The Supreme Primordial Treasure Scripture of the Golden Court of Non-Action*\n**Volume:** One\n**Source:** Ming Dynasty *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\n### **The Supreme Primordial Treasure Scripture of the Golden Court of Non-Action**\n\n#### **Chapter One: The Great Void**\nThe Dao speaks:\nFormless, it merges with the Void; within it, the myriad things move through the Two Modes—this is called the Great Void.\nThus, within the Void there is Non-Being; within Non-Being there is Being. Being gives rise to the One; the One gives rise to the Two; the Two gives rise to the Three; the Three gives rise to the myriad things—this is called the Great Origin.\nThe Great Void is the workings of spirit; through its workings, the myriad things are born.\nThe Great Origin is the transformation of spirit; through its transformation, the myriad things take form.\nBorn without attachment, formed without action—how wondrous its principle! Who would claim that the vastness of Heaven and Earth could ever alter its law?\n\nThe Queen Mother of the West says:\nThe Dao is so great that it encompasses Heaven and Earth, yet its Dao is unseen.\nI would transcend Heaven and Earth to behold the formless Dao, to create the True Void, and to turn the mechanism of supreme subtlety—how could this be otherwise?\nThus, for the divine person who would observe beyond Heaven and Earth, nothing surpasses the formless.\nTo fashion the Eight Subtleties of the Void, nothing surpasses spiritual transformation.\nThe form of the formless, the transformation of spiritual transformation—this may be called the Dao.\n\n#### **Chapter Two: Wondrous Transformation**\nThe Dao speaks:\nCan the Dao be enacted? Its function lies in wondrous application; its essence lies in True Emptiness.\nThus, the living observe it to live; the dying observe it to die.\nHard and soft draw upon the Dao of Earth as their material; yin and yang follow the Dao of Heaven to attain fulfillment.\nThereafter, the myriad things transform without comprehension; the Five Phases each follow their nature—all through the Dao of Primordial Unity, conforming to the numbers of spontaneity.\nThe sage embodies subtlety to observe the world.\nThe world transforms spontaneously, thus following the course of nature and destiny.\nTo observe the heart of Heaven and Earth is to attain the subtlety of the world’s heart.\nThe world’s heart is the attainment of the people.\nHaving attained the people and drawn them near, they return as infants to their nursing mother.\nThose who establish the world’s laws model them upon the heart’s own attainment.\n\nThe Queen Mother of the West says:\nWith a single heart, one observes the world—the world is but a single heart.\nWith many hearts, one observes the world—the world is but many hearts.\nExhaust the heart to observe the people’s hearts; the people’s hearts rest in the heart.\nPreserve the heart with one’s own heart—then the world is all one’s own heart.\nHeart upon heart, subtlety upon subtlety; observation upon observation, spontaneous transformation.\nTo govern the world without disorder, to govern the four limbs without peril—if later generations practice this, who would not find peace and return to the world?\n\n#### **Chapter Three: Spontaneity**\nThe Dao speaks:\nThat which is nameless yet named is spiritual transformation; that which arises spontaneously is wondrous application.\nThe world’s subtleties have form: the subtlety of yin and yang, the presence of cold and heat.\nThe sage attains the Dao of spontaneity, embodying Heaven and Earth, calculating yin and yang, modeling cold and heat, circulating qi, and harmonizing male and female through the union of essence and spirit—shifting with the four seasons’ swiftness and slowness.\nObserving from beyond Heaven and Earth through the Dao of spontaneity, thus all who cast off the mundane and enter sageliness undergo transformation, and those who enter the divine undergo transmutation—transforming Heaven and Earth.\nThe mechanism of the Perfected is the law beyond form.\nWho can wield the subtlety of the formless to transform the formless? The formless, in turn, takes form.\nIf one wishes to enter form from the formless, to employ form for this—all is the Dao of spontaneity.\n\nThe Queen Mother of the West says:\nThe Dao of spontaneity refines qi to preserve the True, emerging from the gate of life and death.\nWithin the utmost emptiness and non-being, it once more unites the utmost spirit with form, shifting and transforming in coming and going, aligning with the revolutions to observe the sagely, responding to the mechanism’s Dao—yet it cannot be approached.\nHaving already transcended life and death, entered non-being and formlessness—why then return to the bodily form?\nFor if all is non-being, how can spirit know? If all is being, how can spirit depart?\nSpontaneous spiritual transformation—all being, all non-being—spirit remains whole and undispersed.\nYet when proven in material form, what thing does it enter or leave?\nThus it is said: The sage leaves no traces; the Perfected leaves no tracks.\n\n#### **Chapter Four: The Great Subtlety**\nThe Dao speaks:\nThe Dao has that which cannot be spoken, and that which can be spoken.\nThat which cannot be spoken is great; that which can be spoken is small.\nThat which cannot be spoken gives life and death to the myriad things, shifting spirit and altering subtlety.\nThat which can be spoken gives rise to the life and death of the myriad things; Heaven and Earth are created and transformed through it.\nThus, the Dao of the Perfected attains the principle of the Great Subtlety—yet it cannot be expressed in form or words.\nIf it cannot be spoken, then observe only the words of Heaven and Earth.\nThe Dao of Heaven has short and long: only the short becomes shorter, while the long does not become longer again.\nMoreover, to the right of the Great Origin, days grow long and people grow great; years lengthen and things flourish—yet in this age, all is short: the people are frivolous, the fortunes brief.\nThe measure of Heaven is three hundred and sixty-five calendrical divisions; if diminished, it harmonizes; if augmented, it weakens.\n\nThe Queen Mother of the West says:\nThe Great Subtlety is the law of Heaven’s waxing and waning.\nThe Dao of Heaven gradually shortens; the Dao of Earth gradually lengthens.\nRulers multiply their departures; the people suffer hunger and thinness.\nThe Dao of Heaven often seems insufficient—thus the revolutions of graded difference.\nHeaven is long, Earth is short; Heaven is distant, Earth is near; yang wanes, yin reaches its extreme.\nEver knowing the Dao of the Great Subtlety, one thereby rectifies and orders yin and yang, observing Heaven, Earth, and humanity.\n\n#### **Chapter Five: Spirit-Wandering**\nThe Dao speaks:\nSpirit-wandering traverses beyond the Eight Heavens, to the utmost qi of the Eight Yangs, the stars that weave Heaven’s woof, the degrees that measure the River’s warp—thus the *Supreme Primordial Treasure Scripture of the Golden Court of Non-Action* transforms form.\nThe Dao of Heaven responds with goodness to non-being.\nThe subtlety of wordless speech—the Perfected grasps the true mechanism of Heaven and Earth.\nThus, the Eight Limits revolve in cycles; one may wander and interchange forms and vessels.\nThe spirit of humanity arises from wholeness and stability, attaining perfection—its wondrous wandering cannot be guarded, for all is the principle of spontaneity.\n\nThe Queen Mother of the West says:\nI once received from the Yellow Emperor the subtlety of spirit-wandering.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1236,
      "start_sentence": 0,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.078912019729614,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上元宝金庭无为妙经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "神游者，乘火龙以御天也。 真人神熙全，阴阳备，形体胖，声迩殊，以指开天门，放朱印之光，神自度焉。 复入大门，其指自下，且神圆能出，自觉中问不拘，神与身离，心指天门，发两眉问及印堂之光，神自出焉。 若止出天门，不开印堂，则出不返也。 朱官之印乃心，尚有神出魂不出也。 朱宫之印，心之留魂未死，神自有身焉。 御炁章第六 道言：炁者有形无形之物也； 聚而为形，散而为风，动而为运，结而为物。 使真人御炁者，保炁以炼骨，骨轻则无聚。 积精以全神J 神化而炁乘。 御炁之道，先轻身也。 若欲轻身，以不死为心，而休劳渴贪欲先焉。 先身而行，炁始乘焉。 身离而全神，炁自御焉。 西王母日：御炁之卫，以身则劳而难成，以神自然则可致。 古人有服炁轻骨，服药以轻身，故身骨轻，炁可御，入水不溺，入火不焚也。 其道先服药以绝粒为上，服炁以无心为最。 真人以身轻，身乃松相狭苓之类也。 服熙者，乃子午既济之炁也。 服药以为虚空，虚空为身，炁之致也。 太一章第七 道言：天常清，地常宁，皆太一之道也。 故事贵有始，则有常。 有常则无生灭。 无生灭则天地不为之．贼，而称太一也。 天有太一，万物生焉。 人有太一，五行用焉。 一者天之至精，不浊不重，至清至灵，生生真府，则四象明焉。 西王母日：太一者，元祖也。 养之不穷，用之不竭，能生万物，乃炁之祖宗，造化之基也。 人既入五行八卦之妙，复见太一，而知天地阴阳不为己盗，而左右周旋皆自己有也。 兵之不劫，利之不诱，可谓至一也。 形得一以不劳，神得一以大全。 故一者，始则观大江之水，泛泛不绝，溢于心源则决沧海之波，浩浩不止，流於神府。 然后神移形全，神全形滋也。 无为章第八 道言：无为无不为，有为有以为。 神能移化，夺其真炁，能呼吸阴阳，外忘饥寒，内忘升降，以自得为心，以虚无为行。 故日：无为。 夫无为者，当无有为之用，以有为为本。 为有本，以五行为先，为天地者，有为於众手，无为於拱手。 配五行者，有为於四象，无为於无象。 拱手者，圣人垂衣裳而天下治。 无象者，真人全神而形自安。 西王母日：学至於损，道至於无为，极致矣。 观无所观，住无所住，行无所行，用无所用，虽天地之大，不为大，阴阳之妙，不为妙。 真人入至静之境，虚无之方，可谓无为也。 故无为有机为不绝，无为失机而自灭。 生神章第九 道言：五星聚天市而圣人生，五行配地炁而万物形，故天地之道皆有常数也。 人之有五星聚於中府，至秀之炁而亦生内圣人。 五行配地炁，而亦物形焉。 人之内有五行，既聚神府，见玉华，五行降中央而主。 真人者，乃人之真也。 一日胎仙，二日真形，三曰真子，四日胎真，皆一也。 · 能为己之形，能言己之事，无所不知，无所不通，出入生死，提挈天地，故曰神也。 有是为真人也。 西王母日：神者，保形先知，保命不死，出入天门，为己之内身，依拘变化，与身等俱，此乃胎中之真也。 内坎离交媾生胎，胎生内外灵，故能不死出形，无生而入生也。 玉华章第十 道言：人常无心，常无常形，天地动静。 然有能常久者，以其得一也，有神在焉。 夫人有心，既流浪生死，出没爱欲，则散而不见。",
      "translated_text": "The spirit-wanderer rides the fire dragon to ascend and govern Heaven. The Perfected’s spirit flourishes in wholeness; yin and yang are complete, the body is harmonious, the voice carries far and distinct. With a finger, one opens the Gate of Heaven, releasing the crimson seal’s radiance—thus the spirit crosses of itself. Returning to the great gate, the finger descends of itself. Since the spirit is whole and able to depart, one naturally senses no constraint within. Spirit and body separate; the mind directs toward the Gate of Heaven, emitting light from between the brows and the Hall of the Seal—thus the spirit emerges of itself. If one merely exits the Gate of Heaven without opening the Hall of the Seal, the departure will be irreversible. The crimson palace’s seal is the heart; though the spirit departs, the hun-soul does not. The crimson palace’s seal, where the heart retains the hun-soul, is not yet dead—thus the spirit still has a body.\n\n**Chapter Six: Governing Qi**\nThe Dao speaks: Qi is the substance of form and formlessness. Gathered, it becomes form; dispersed, it becomes wind; stirred, it becomes movement; congealed, it becomes things. For the Perfected to govern qi is to preserve qi and refine the bones—when bones are light, there is no clumping. Accumulate essence to perfect the spirit; the spirit transforms and qi rides upon it. The Dao of governing qi begins with lightening the body. To lighten the body, set immortality as the heart’s intent, and first cease labor, hunger, thirst, and desire. Act before the body, and qi will begin to ride. When the body departs yet the spirit remains whole, qi governs of itself.\n\nThe Queen Mother of the West says: To guard the governing of qi—if one relies on the body, it is laborious and difficult to achieve; if one relies on the spirit’s spontaneity, it may be attained. The ancients consumed qi to lighten the bones and ingested herbs to lighten the body. Thus, with lightened body and bones, qi may be governed—entering water without drowning, entering fire without burning. The Dao begins with ingesting herbs to cease grain-eating as supreme, and consuming qi with a mindless heart as foremost. When the Perfected’s body is light, the body resembles pine and poria. Consuming qi is the qi of the Zi-Wu hexagram’s completion. Ingesting herbs creates emptiness; emptiness becomes the body—thus qi is attained.\n\n**Chapter Seven: The Great One**\nThe Dao speaks: Heaven is eternally clear, Earth eternally tranquil—all is the Dao of the Great One. Thus, affairs value having a beginning, and then there is constancy. With constancy, there is no arising or ceasing. Without arising or ceasing, Heaven and Earth do not act as thieves to it, and it is called the Great One. Heaven has the Great One, and the myriad things are born. Humans have the Great One, and the Five Phases are employed. The One is Heaven’s utmost essence—unmuddied, unburdened, supremely clear, supremely numinous. The true treasury of ceaseless generation—thus the Four Images are illuminated.\n\nThe Queen Mother of the West says: The Great One is the primordial ancestor. Nurtured, it is inexhaustible; employed, it is unfailing. It generates the myriad things, the ancestor of qi, the foundation of creation. Once humans enter the subtlety of the Five Phases and Eight Trigrams and again perceive the Great One, they know that Heaven and Earth’s yin and yang do not steal from them, and all revolving to left and right is their own possession. Unassailed by weapons, unenticed by profit—this may be called utmost oneness. Form attains the One and is not wearied; spirit attains the One and is greatly perfected. Thus, the One—at the beginning, observe the great river’s waters, flowing ceaselessly. Overflowing the heart’s source, they breach the ocean’s waves, surging endlessly, streaming into the spirit’s treasury. Then the spirit moves and form is whole; the spirit is whole and form flourishes.\n\n**Chapter Eight: Non-Action**\nThe Dao speaks: Non-action is non-action without non-action; action is action with action. The spirit can shift and transform, seizing the true qi. It can inhale and exhale yin and yang, externally forgetting hunger and cold, internally forgetting ascent and descent, taking self-attainment as the heart, taking emptiness and non-being as conduct. Thus it is said: non-action. Non-action should have no use for action, yet takes action as its root. With a root in action, the Five Phases come first. For those who act as Heaven and Earth, there is action in the many hands, non-action in the folded hands. For those who match the Five Phases, there is action in the Four Images, non-action in imagelessness. Folded hands—sages let robes and skirts hang loose, and the world is governed. Imagelessness—the Perfected perfects the spirit, and form is naturally at peace.\n\nThe Queen Mother of the West says: Learning reaches its limit in reduction; the Dao reaches its limit in non-action—this is the ultimate attainment. Observing without observation, abiding without abode, moving without movement, employing without employment—though Heaven and Earth are vast, they are not vast; though yin and yang are subtle, they are not subtle. The Perfected enters the realm of utmost stillness, the realm of emptiness and non-being—this may be called non-action. Thus, non-action has its mechanism, and action is unceasing; non-action loses its mechanism and perishes of itself.\n\n**Chapter Nine: Generating the Spirit**\nThe Dao speaks: When the Five Stars gather in the Celestial Market, sages are born; when the Five Phases match Earth’s qi, the myriad things take form—thus the Dao of Heaven and Earth all has constant numeration. Humans have the Five Stars gathered in the central treasury, the utmost refined qi, and thus the inner sage is born. The Five Phases match Earth’s qi, and thus things take form. Within humans, the Five Phases gather in the spirit’s treasury, the Jade Flower appears, and the Five Phases descend to the center and preside. The Perfected is humanity’s true self. First is the womb immortal, second the true form, third the true child, fourth the womb true—all are one. Able to be one’s own form, able to speak one’s own affairs, knowing all, penetrating all, exiting and entering life and death, lifting and carrying Heaven and Earth—thus it is called spirit. This is the Perfected.\n\nThe Queen Mother of the West says: The spirit first knows to preserve form, preserves life without dying, exits and enters the Gate of Heaven, becomes one’s inner body, adheres and transforms, accompanying the body equally—this is the true within the womb. Within, Kan and Li intermingle and generate the womb; the womb generates inner and outer numinosity—thus one can exit form without dying, enter life without being born.\n\n**Chapter Ten: The Jade Flower**\nThe Dao speaks: Humans are constantly without mind, constantly without constant form—Heaven and Earth move and rest. Yet there are those who can endure long, for they attain the One, and the spirit resides within. Humans have minds, and thus drift in the currents of life and death, emerging and submerging in love and desire—then they scatter and are no longer seen.",
      "overlap_context": "aven responds with goodness to non-being.\nThe subtlety of wordless speech—the Perfected grasps the true mechanism of Heaven and Earth.\nThus, the Eight Limits revolve in cycles; one may wander and interchange forms and vessels.\nThe spirit of humanity arises from wholeness and stability, attaining perfection—its wondrous wandering cannot be guarded, for all is the principle of spontaneity.\n\nThe Queen Mother of the West says:\nI once received from the Yellow Emperor the subtlety of spirit-wandering.",
      "start_char": 1236,
      "end_char": 2484,
      "start_sentence": 68,
      "end_sentence": 131,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.22094416618347,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上元宝金庭无为妙经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "能守一全真久久，行定神之道，则可见焉。 西王母曰：人之有心，为帝之府，其神乃玉华君也。 定神绝念，无梦觉惊悸而生，久久行之，可以应天地之机君，鬼神之事，无不洞达晓了，故为内圣人。 古之真 人，以此为师，度不测之危，济还泉之鬼，悉合上升三界，采天地幽冥，迹阴阳微隐，尽自得之。 神生因五行全体，化生而升於丹室，南极坐于曲江也。 凡身中八星三元之神，日夜朝礼，若有一神不朝，皆谓未然之祸住削冥籍也。 合体章第十一 道言：五行聚，夫妇配，夫妇配，真成真。 十月始生，降为真子。 真子者，神全也，内身也。 出入天地之外，造化八极之表，往来周天，分星步日，披云霓迩，采河汉源，归于变化之物，故日合体。 西王母日：形中无形，与形合体，故人能长生。 形甚大，以无故大。 形甚众，以无故众。 有者可以量，有者可以见。 夫无形之形，化亿万身亦不为众也。 无形附有形，有形为之宅。 有形附无形，无形为之主者。 诸主故不死。 其历星步者，以是身出天门，至牛斗而往天市，知天下未然之事。 全形章第十二 道言：不死之道故曰全形。 全形之道故在炼形。 真人既能炼五行，配合阴阳，交媾坎离，则老返，状如婴儿，然后复於丹田，而自有炁。 若明升于绛宫，化成自光，能遍满身。 当夜幽视之中，有万神朝礼，则形不为之盗。",
      "translated_text": "One who can preserve the One and maintain authenticity for long, practicing the Dao of stabilizing the spirit, may then perceive it. The Queen Mother of the West says: The human heart is the palace of the Sovereign; its spirit is the Lord of Jade Flower. Stabilizing the spirit and severing thoughts, free from dreams, waking terrors, or palpitations—practicing this long and steadfastly—one may respond to the mechanisms of Heaven and Earth, the affairs of ghosts and spirits, all becoming thoroughly clear and understood. Thus one becomes an Inner Sage. The true persons of antiquity took this as their teacher, crossing unknowable perils, aiding the ghosts of Yellow Springs. All ascend through the Three Realms, gathering the hidden and obscure of Heaven and Earth, tracing the subtle and concealed of yin and yang—all is naturally attained.\n\nThe spirit arises from the completeness of the Five Phases, transforming and ascending into the Cinnabar Chamber, seated at the Southern Culmen upon the Winding River. Within the body, the eight stars and three primordial spirits pay homage day and night. If even one spirit fails to attend, it is said that unforeseen calamity will strike, and one’s name will be erased from the registers of the unseen.\n\n**Chapter Eleven: Uniting the Body**\nThe Dao speaks: The Five Phases gather, husband and wife unite—when husband and wife unite, the true becomes true. After ten months, the true child is born. The true child is the spirit complete, the inner body. It exits and enters beyond Heaven and Earth, traverses beyond the eight poles of creation, comes and goes through the celestial cycles, paces the stars and steps the sun, parts the near clouds and rainbows, gathers the sources of the Milky Way, and returns to the things of transformation—thus it is called *Uniting the Body*.\n\nThe Queen Mother of the West says: The formless within form unites with form—thus humans may attain long life. Form is vast because of the formless. Forms are many because of the formless. What exists can be measured; what exists can be seen. Yet the form of the formless, transforming into myriad bodies, is not considered numerous. The formless attaches to form, and form becomes its dwelling. Form attaches to the formless, and the formless becomes its master. All masters thus do not die. Those who pace the stars do so by exiting the Gate of Heaven with this body, reaching the Ox and Dipper, and proceeding to the Celestial Market—thus knowing the yet-unrealized affairs of the world.\n\n**Chapter Twelve: Preserving the Form**\nThe Dao speaks: The Dao of not dying is thus called *Preserving the Form*. The Dao of preserving the form lies in refining the form. When the true person can refine the Five Phases, unite yin and yang, and intermingle Kan and Li, then old age returns to a state like an infant. Thereafter, returning to the Cinnabar Field, one naturally possesses qi. When clarity ascends to the Crimson Palace, it transforms into spontaneous radiance, suffusing the entire body. In the dark of night, amidst quiet observation, myriad spirits pay homage—then the form is not stolen by thieves.",
      "overlap_context": "es inner and outer numinosity—thus one can exit form without dying, enter life without being born.\n\n**Chapter Ten: The Jade Flower**\nThe Dao speaks: Humans are constantly without mind, constantly without constant form—Heaven and Earth move and rest. Yet there are those who can endure long, for they attain the One, and the spirit resides within. Humans have minds, and thus drift in the currents of life and death, emerging and submerging in love and desire—then they scatter and are no longer seen.",
      "start_char": 2484,
      "end_char": 3013,
      "start_sentence": 132,
      "end_sentence": 158,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.876943588256836,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上元宝金庭无为妙经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "西王母日：形无形，能长生； 炁无炁，能不死。 形无者，不以形为形也。 炁无者，炁所成也。 凡人之炁散而不化，真人之炁化而不散。 坎离章第十三 道言：阴中有阳，阳为至阳； 阳太上元宝金庭无为妙经中有阴，阴为至阴。 夫北方为阴，其神水，能生万物，乃炁之祖，诸阳之元。 夫南方为阳，其神火，能化万物，乃形之宗，诸阴之交也。 坎能全精保炁而不枯，离能定神炼真而不昧。 知之至妙，谓之真人。 西王母日：阴阳之精，坎离也。 定神正性，由心不珠，保精养炁，固炁不竭。 夫水庾之则流，壅之则腐； 火奋之则燥，亭之则明。 故圣人导其水，使自地户上升灌泥丸，复下华池入绛宫。 其火使心不为物所拘，常有若无，不为动者，则久久长而精神不散耶。 交媾章第十四 道言：坎男离女，黄婆嫁娶，金母木公，媒妁相通。 且交媾之道，在五行配合之际也？ 五行者，交媾也。 五行既聚，金木互用，然后坎男离女遇而媾也。 四象往来，通好也。 五行相聚，配合也。 西王母日：男女相遇，当五十之期。 五十者，男年三十，女年二十，乃天地数之合也。 男子象天道，坎行一，本宫有水。 女子象地道，离应二，本官有火。 坎见三，木通火耗。 离见四，金言水之情。 坎见五，黄婆引之以升。 离见六，水引之以降。 坎见七＇火见成人而交。 离见八，木饰之以根。 坎见九，金母而交会。 离见十，土为配形。 此五行往来之数。 存神至真，水火自灵也。 五行章第十五 道言：天之五纬，地之五经，人之五行，乃自然之物也。 惟四象聚中，金丹光伟？ 阴阳交合，二仪配形，始有升降。 夫金盈生水，水始化，故曰炁水也。 炁水者，动而升则炁，静而形则水。 水有大利，能生万物，故水为万物之精也。 水成则火聚，然后龙行其先，虎行其后，四象合一，五行聚焉。 西王母日：炁静而神定，乃坎离成。 坎离成，然后金木分。 金木分，然后五行运。 五行运，然后中央聚。 火发于下，水灌于上，丹成鼎热，以昼夜为周天，十二时为十二月，二十四炁以时分之，故象天地，作阴阳，法出自然。 故曰：金丹养之三年，自为真人。 冬至阳生进火，夏至阴生退火，进退各一十二两。 得地章第十六 道言：二炁上下，三宫升降，然后五行配合，聚于中洲也。 五行之合，先本其地。 夫水生於金，坎运兑生，进火。 火生於木，离运震先，行水。 夫水非金不成，火非木不行，黄道於中，五行聚焉。 得地之术，平炁调水，定息养火，使上下亦不相离，得三百六十之功，然后入静，长生之法，自此始也。 西王母日：生养之道，莫非务本； 种植之利，莫若得地。 得地者，三田平，四象和也。 三田平者，谓三丹平，名不动，以观四象自然之炁，是谓得地也。 得地者，真人之道也。 五行之能，五恶十毒，皮无寒苦，肌无溃忽，五兵之敌，亦血不濡也。 血不出是神定。 三官章第十七 道言：上有泥丸，中有神府，下有沧海。 三宫者，乃生死之由，皆能生死人。 夫欲长生，当知其神。 得其神，用其法。 上元泥丸者，乃精之泉源。 泥丸不开，则精不散而神不离。 中元绛宫者，乃神之舍宇。 绛宫不动，则精不驰而神不疲。 下元丹田者，乃真水之根蒂。 丹田不振，则精不漏而神不死。",
      "translated_text": "**The Queen Mother of the West states:** The formless form enables longevity; the qi-less qi enables immortality. The formless means not taking form as form. The qi-less means qi is what forms it. Ordinary people’s qi scatters and does not transform; the true person’s qi transforms and does not scatter.\n\n**Chapter Thirteen: Kan and Li**\nThe Dao speaks: Within yin there is yang, and yang is the supreme yang. Within yang there is yin, and yin is the supreme yin. The north is yin, its spirit is water, which gives birth to the myriad things—it is the ancestor of qi and the origin of all yang. The south is yang, its spirit is fire, which transforms the myriad things—it is the root of form and the convergence of all yin. Kan preserves essence and safeguards qi without withering; Li stabilizes spirit and refines the true without obscurity. To know this most subtly is to be called a true person.\n\n**The Queen Mother of the West states:** The essence of yin and yang is Kan and Li. Stabilizing spirit and rectifying nature arise from the heart’s unwavering clarity; preserving essence and nurturing qi ensure qi is never exhausted. Water, if dammed, flows; if blocked, it rots. Fire, if stirred, burns; if stilled, it shines. Thus, the sage guides the water, causing it to ascend from the earthly gate to irrigate the Muddy Pellet, then descend to the Flowery Pond and enter the Crimson Palace. As for fire, if the heart is not constrained by things, always existing as if non-existent, and not moved by externals, then over time, the spirit will not scatter.\n\n**Chapter Fourteen: Union**\nThe Dao speaks: Kan male and Li female, the Yellow Dame arranges their marriage; the Metal Mother and Wood Father serve as matchmakers to connect them. Moreover, the Dao of union lies in the convergence of the Five Phases. The Five Phases are union. When the Five Phases gather, metal and wood interact, then Kan male and Li female meet and unite. The Four Symbols come and go, communicating affection. The Five Phases assemble, forming pairs.\n\n**The Queen Mother of the West states:** When male and female meet, it occurs at the fiftieth cycle. Fifty signifies a man at thirty and a woman at twenty—this is the harmony of heaven and earth’s numbers. The man embodies the heavenly Dao: Kan moves with one, its palace holding water. The woman embodies the earthly Dao: Li corresponds to two, its palace holding fire. When Kan encounters three, wood connects and fire depletes. When Li encounters four, metal speaks of water’s nature. When Kan encounters five, the Yellow Dame guides it upward. When Li encounters six, water draws it downward. When Kan encounters seven, fire matures and they unite. When Li encounters eight, wood adorns it with roots. When Kan encounters nine, the Metal Mother meets in union. When Li encounters ten, earth forms the pair. These are the numbers of the Five Phases’ interactions. Preserve the spirit to perfection, and water and fire will naturally become efficacious.\n\n**Chapter Fifteen: The Five Phases**\nThe Dao speaks: The heavens have five planets, the earth has five constants, and humans have the Five Phases—these are natural things. Only when the Four Symbols gather at the center does the Golden Elixir shine brilliantly. When yin and yang unite and the Two Modes form a pair, then ascent and descent begin. Metal fills and generates water, and water first transforms—thus it is called *qi-water*. Qi-water, when moving, ascends as qi; when still, it takes form as water. Water has great benefit, giving life to the myriad things—thus water is the essence of the myriad things. When water is complete, fire gathers; then the dragon moves ahead, the tiger follows behind, the Four Symbols unite as one, and the Five Phases assemble.\n\n**The Queen Mother of the West states:** When qi is still and spirit is stabilized, Kan and Li are complete. When Kan and Li are complete, then metal and wood separate. When metal and wood separate, the Five Phases move. When the Five Phases move, the center gathers. Fire arises from below, water irrigates from above; the elixir forms in the heated crucible. Taking day and night as a cycle, the twelve hours as twelve months, and the twenty-four qi as seasonal divisions—this models heaven and earth, creates yin and yang, and follows the natural pattern. Thus it is said: Nurturing the Golden Elixir for three years makes one a true person. At the winter solstice, yang is born and fire is advanced; at the summer solstice, yin is born and fire is withdrawn. Advancing and withdrawing each use twelve measures.\n\n**Chapter Sixteen: Obtaining the Ground**\nThe Dao speaks: When the two qi ascend and descend, and the three palaces rise and fall, then the Five Phases unite and gather in the central land. The union of the Five Phases first depends on its ground. Water is born from metal: Kan moves and Dui generates, advancing fire. Fire is born from wood: Li moves and Zhen leads, circulating water. Without metal, water does not form; without wood, fire does not move. The Yellow Dao resides at the center, and the Five Phases gather there. The method of obtaining the ground lies in balancing qi and regulating water, stabilizing breath and nurturing fire, ensuring that above and below do not separate. After three hundred and sixty days of practice, one enters stillness—this is where the method of longevity begins.\n\n**The Queen Mother of the West states:** The Dao of life and nurturance fundamentally seeks its root; the benefit of planting and cultivation lies in obtaining the ground. Obtaining the ground means the three fields are level and the Four Symbols are harmonious. The three fields being level refers to the three cinnabar fields being balanced, their names unchanging, allowing one to observe the natural qi of the Four Symbols—this is called obtaining the ground. Obtaining the ground is the Dao of the true person. The Five Phases’ abilities, the five evils and ten poisons, leave the skin without cold or suffering, the flesh without decay or neglect. Against the weapons of the five armies, even blood does not flow. Blood not flowing means the spirit is stabilized.\n\n**Chapter Seventeen: The Three Palaces**\nThe Dao speaks: Above is the Muddy Pellet, in the center is the Divine Mansion, and below is the Azure Sea. The three palaces are the source of life and death, each capable of giving life or causing death. To attain longevity, one must know their spirits. Obtain their spirits and employ their methods. The upper palace, the Muddy Pellet, is the source of essence. If the Muddy Pellet does not open, essence does not scatter and spirit does not depart. The middle palace, the Crimson Palace, is the dwelling of spirit. If the Crimson Palace is unmoved, essence does not stray and spirit does not weary. The lower palace, the Cinnabar Field, is the root of true water. If the Cinnabar Field is not agitated, essence does not leak and spirit does not die.",
      "overlap_context": "he Dao of preserving the form lies in refining the form. When the true person can refine the Five Phases, unite yin and yang, and intermingle Kan and Li, then old age returns to a state like an infant. Thereafter, returning to the Cinnabar Field, one naturally possesses qi. When clarity ascends to the Crimson Palace, it transforms into spontaneous radiance, suffusing the entire body. In the dark of night, amidst quiet observation, myriad spirits pay homage—then the form is not stolen by thieves.",
      "start_char": 3013,
      "end_char": 4255,
      "start_sentence": 159,
      "end_sentence": 237,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.74916195869446,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上元宝金庭无为妙经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "一死谓之脑漏入精，二死谓之神移入肾，三死谓之精泄神散。 欲其长，长使上下不相舍。 西王母曰：上丹田之府，乃诸阳之府。 阳之至精，聚于天池。 天池者，脑中丹田之府，乃生命之根，元炁之所也。 若欲精神不散，当守泥丸不动。 欲泥丸不动，当守其心。 心静而万物毕矣。 故曰：火炼泥丸，固之不泄； 火引泥丸，漏之神死也。 二炁章第十八 道言：二炁调运，四象含光，体化元妙，动容周旋，左右上下，引水火往来，养金丹胎宝，以金为鼎。 金者，炁也。 以木焚之。 木者，力也。 内有八卦四象五行，自然之物也。 周天之卦，自然之数也。 惟二炁引水火之法，先务调和。 西王母日：二炁者，金木也。 金色白，其德威，其神虎，故肺之炁乃日白虎也。 木色青，其德柔，其神龙，故肝之炁乃曰青龙也。 若不得二炁，则坎离不生。 坎离不生，则配合无象。 故调炁养龙，往来于天地门。 天门者，泥丸也。 地户者，尾闲也。 然后积炁以养龙。 故炁积成水，水中生龙。 龙行虎顺，升降上下，而引水火也。 夺运章第十九 道言：天有五运，地有六气，以生万物，以成造化。 人能知天地之运，则长生不死。 若欲当知其炁。 夫天之五运，五行之炁； 地之六气，六甲之灵。 知五行六甲，不为天地之盗者，乃为真人。 以真人者，夺天地之运，服八节之炁也。 震，束方木，宜养肝。 离，南方火，宜养心。 兑，西方金，宜养肺。 坎，北方水，宜养肾。 束南巽，宜养胆。 西南坤，宜养胃。 西北乾，宜养大肠。 束北艮，宜养小肠膀胱。 此夺天地之运，不为之盗也。 西王母日：春夏养阳，秋冬养阴。 养阳以水，养阴以火。 五行以二炁，呼者出阴，吸者入阳。 存是五行正炁，木长火锐，金方水散，然出入成为数，以节养之，亦曰服八节旺炁。 久久行之，不饥渴。 御风章第二十 道言：天地有阴阳之炁，运行四时而为寒暑。 故寒者阳藏而阴发，暑者阴伏而阳升。 天地有寒暑之候，人亦有寒暑之候。 天运之自然寒暑有疾迟之差，人运无反复阴阳之变也。 天地阴发而阳藏，故大寒气多翳而多结，故冬降霜雪之宜也。 天地阴伏而阳升，故大暑多结，故夏雨多沸骤。 人能体之，使阴胜暑，阳胜寒，则云可乘，风可御也。 忘形章第二十一 道言：忘形者，炁所聚； 炁者，形所用。 既有形，非炁莫生。 养形之道，以炁先焉。 今既有形，但为炁所拘耳。 人皆以炁为本，形不为炁累耳。 故真人者有形能忘，是为真道。 忘形者，炼炁合形，与物无着，故炼炁而神定。 神定炁正，炁正而无寒暑。 无寒暑而形、不拘。 形不拘而形可忘也。 西王母曰：形者炁之宅，炁者神之用。 炁全神正，有内真炁。 故形不着炁，炁不为形所拘也。 其妙至半夜运五行全炁上下升降，若混沌形，至三千日炁能离形，故形可忘也。 离形者，神出也。 神出者，由炁以行神炁。 炁动然后形无形也。 元炁章第二十二 道言：炁治则疾不生，炁完则神自灵也。 治炁，治五脏四肢之不顺也。 若腹中病，当接目上下，左使之右，右使之左，然后伏外，曲两手于心下，当少项，利自愈。 五脏不足，向五方存色，纳之则愈。 全元炁之法：存元海中升其炁，使上下流转不定，经三十日，形自离。",
      "translated_text": "**Chapter Eighteen: The Two Qi**\n\nThe Dao speaks: The first death is called \"brain leakage into essence\"; the second death, \"spirit shifting into the kidneys\"; the third death, \"essence draining and spirit scattering.\" To attain longevity, ensure the upper and lower do not abandon each other.\n\nThe Queen Mother of the West says: The upper Cinnabar Field’s palace is the palace of all yang. The utmost essence of yang gathers in the Celestial Pool. The Celestial Pool is the palace of the Cinnabar Field within the brain, the root of life and the dwelling of primordial *qi*. If one wishes the spirit not to scatter, guard the Muddy Pellet without movement. To keep the Muddy Pellet unmoved, guard the heart. When the heart is still, all things are complete. Thus it is said: Fire refines the Muddy Pellet, consolidating it so it does not leak; fire draws the Muddy Pellet, causing leakage and the death of spirit.\n\n**Chapter Eighteen: The Two Qi**\n\nThe Dao speaks: When the two *qi* are harmonized and set in motion, the Four Symbols contain radiance. The body transforms into primordial subtlety, movement and bearing circulate in all directions. Left and right, above and below, water and fire are drawn to and fro, nurturing the golden elixir’s embryonic treasure. Use metal as the crucible. Metal is *qi*. Burn it with wood. Wood is power. Within are the Eight Trigrams, Four Symbols, and Five Phases—natural things. The trigrams of the celestial cycle are the numbers of nature. Only the method of drawing water and fire with the two *qi* first requires harmonization.\n\nThe Queen Mother of the West says: The two *qi* are metal and wood. Metal is white in color; its virtue is majesty; its spirit, the tiger. Thus the *qi* of the lungs is called the White Tiger. Wood is green in color; its virtue is gentleness; its spirit, the dragon. Thus the *qi* of the liver is called the Green Dragon. Without the two *qi*, Kan and Li do not arise. If Kan and Li do not arise, there is no configuration for union. Therefore, regulate the *qi* to nurture the dragon, circulating it through the Gate of Heaven and Earth. The Gate of Heaven is the Muddy Pellet; the Gate of Earth, the Tail Gate. Then accumulate *qi* to nourish the dragon. Thus *qi* accumulates into water, and from water the dragon is born. Dragon moves and tiger follows, ascending and descending, drawing water and fire.\n\n**Chapter Nineteen: Seizing the Movements**\n\nThe Dao speaks: Heaven has the Five Movements; Earth has the Six Qi. They generate the myriad things and accomplish transformation. If one knows the movements of Heaven and Earth, one attains longevity without death. To understand their *qi*, know this: Heaven’s Five Movements are the *qi* of the Five Phases; Earth’s Six Qi are the numina of the Six Jia. One who knows the Five Phases and Six Jia yet is not a thief of Heaven and Earth is a Perfected Person. The Perfected Person seizes the movements of Heaven and Earth, ingesting the *qi* of the eight seasonal nodes.\n\nZhen corresponds to the eastern wood and is suitable for nourishing the liver. Li corresponds to the southern fire and is suitable for nourishing the heart. Dui corresponds to the western metal and is suitable for nourishing the lungs. Kan corresponds to the northern water and is suitable for nourishing the kidneys. Xun in the southeast is suitable for nourishing the gallbladder. Kun in the southwest is suitable for nourishing the stomach. Qian in the northwest is suitable for nourishing the large intestine. Gen in the northeast is suitable for nourishing the small intestine and bladder. This is seizing the movements of Heaven and Earth, not being a thief of them.\n\nThe Queen Mother of the West says: In spring and summer, nourish yang; in autumn and winter, nourish yin. Nourish yang with water; nourish yin with fire. The Five Phases rely on the two *qi*. Exhalation expels yin; inhalation draws in yang. Preserve the upright *qi* of the Five Phases: wood grows, fire sharpens, metal squares, water scatters. Thus inbreath and outbreath form a cycle. Regulate and nourish them—this is also called ingesting the flourishing *qi* of the eight nodes. Practiced over time, one will no longer hunger or thirst.\n\n**Chapter Twenty: Riding the Wind**\n\nThe Dao speaks: Heaven and Earth possess the *qi* of yin and yang, circulating through the four seasons to produce cold and heat. Thus cold arises when yang conceals and yin emerges; heat arises when yin recedes and yang ascends. Heaven and Earth have the signs of cold and heat; humans also have the signs of cold and heat. The natural cold and heat of Heaven’s movements have differences in speed and slowness, but human movements have no reversal of yin and yang’s transformations. When Heaven’s yin emerges and yang conceals, great cold causes *qi* to congeal and accumulate, hence winter’s descent of frost and snow is fitting. When Heaven’s yin recedes and yang ascends, great heat causes coagulation, hence summer’s rains are often torrential. If one embodies this, making yin overcome heat and yang overcome cold, then clouds may be ridden and wind may be harnessed.\n\n**Chapter Twenty-One: Forgetting Form**\n\nThe Dao speaks: To forget form is where *qi* gathers; *qi* is what form employs. Since there is form, without *qi* it cannot live. The way to nourish form begins with *qi*. Now that there is form, it is merely constrained by *qi*. All people take *qi* as their root; form should not be burdened by *qi*. Thus the Perfected Person, though possessing form, can forget it—this is the true Dao. To forget form is to refine *qi* and unite with form, unattached to things. Thus refining *qi* stabilizes the spirit. When the spirit is stable, *qi* is upright; when *qi* is upright, there is no cold or heat. Without cold or heat, form is not constrained. When form is not constrained, form may be forgotten.\n\nThe Queen Mother of the West says: Form is the dwelling of *qi*; *qi* is the function of spirit. When *qi* is complete and spirit is upright, there is inner true *qi*. Thus form does not cling to *qi*, and *qi* is not constrained by form. Its subtlety lies in circulating the full *qi* of the Five Phases up and down at midnight, as if in a primordial chaos. After three thousand days, *qi* can depart from form, and thus form may be forgotten. To depart from form is for spirit to emerge. When spirit emerges, it moves through *qi* by means of spirit-*qi*. When *qi* moves, then form becomes formless.\n\n**Chapter Twenty-Two: Primordial Qi**\n\nThe Dao speaks: When *qi* is ordered, illness does not arise; when *qi* is complete, spirit is naturally numinous. To order *qi* is to regulate the disharmony of the five viscera and four limbs. If there is illness in the abdomen, direct the gaze up and down, send left to right and right to left. Then lie prone, bend both hands beneath the heart, and align with the nape of the neck—benefit will come naturally. When the five viscera are deficient, face the five directions and visualize their colors, absorbing them to be cured.\n\nThe method for preserving primordial *qi*: Visualize *qi* ascending from the Primordial Sea, causing it to flow and circulate without cease. After thirty days, form will naturally depart.",
      "overlap_context": "s. Obtain their spirits and employ their methods. The upper palace, the Muddy Pellet, is the source of essence. If the Muddy Pellet does not open, essence does not scatter and spirit does not depart. The middle palace, the Crimson Palace, is the dwelling of spirit. If the Crimson Palace is unmoved, essence does not stray and spirit does not weary. The lower palace, the Cinnabar Field, is the root of true water. If the Cinnabar Field is not agitated, essence does not leak and spirit does not die.",
      "start_char": 4255,
      "end_char": 5487,
      "start_sentence": 238,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.579466581344604,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上元宝金庭无为妙经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "欲元其炁，自小转大，日加之，则四十九日充满其形，形充无炁，则神自正也。 西王母曰：元炁者，炼炁也。 以火先自丹田流转不定，至子初三百六十功，至午初又自心而下，又行三百六十功，则炁元也。 一功者，一遍也。 人室章第二十三 道言：真人养形，莫若炼炁。 炼炁莫若定神。 定神莫若入室。 入室者，养神安定之法也。 夫冬则温，夏则清。 冬无用火，夏无用风。 居必正席，室必南向。 先治外邪不干，然后内邪必不起也。 治者，使邪炁不干，而形自安也。 西王母日：入室之术，室可方圆六丈，束西置牖，南立户，高一丈二尺。 坐处令方圆八尺，安厚毛球，夏则上又置席，左右置几。 令安坐，下垂足，下床自坐，下长一尺二寸，使起居左右皆不为倦，然后於四安。 四安，青白之帐，勿安五色，恐久令人目盲。 户外檐当使见白，然后形安，炁不为所伤也。 服炁章第二十四 道言：炁者，至大至灵，化天地，育万物，然不见其边，而物物皆是。 不雕刻而万物成，不提挈而万物生，聚而为体，散而为风，天不知炁之为天，地不知炁之为地，人不知炁之为人，万物不知炁之为万物，鬼神不知炁之为鬼神，万象不知炁之为万象。 若知炁所化，则不知炁之所盗耶。 天运之为外，人应之而天不为盗其寿。 地载之于下，人应之而地不为盗其体。 万物见之而应，不为盗其炁。 能知炁者，乃知阳之所生也。 西王母日：炁之在天，冬至而生一阳，万象应焉。 炁之在地，夏至而生一阴，万物应焉。 炁之在人，子初诸阴会而一阳生，一阳生，生於真水。 午初诸阳会而一阴生。 一阴生，生於真火。 生真水，炁在肾，肾炁不可动。 生真火，炁在心，心炁不可动。 炁之所在，存而应之。 定神章第二十五 道言：人之神者，心为之室，血为之禄，炁为之本，四体五藏为之使。 夫神之在身，由舍之有生。 舍之有生则成，无生则败。 且舍之新，若无生，门户不闭，尘秽四入，豕鼠耗其基，乌雀穿其穴，亦渐至屿坏。 舍之圬，若无生，门户摧塌，尘秽溢满，豕鼠败其基，乌雀翻其盖，则欲不朽，无由也，立至崩坠。 人之神全炁正，亦易定也。 定神之道在守心，守心在绝念，绝念在休欲，然后心正。 心正然后神定。 西王母日：定守之道，知安知足，使饥寒不逼，无妄想执缚，以熙上升至心而养之。 当夜半时，不以正坐，但平两手，使四体安休，绝妄想，存心中有己身坐。 行之七月，神不衰老，神定炁正，常如婴儿，神自灵也。 绝念章第二十六 道言：念者，人起心意者。 人有常欲，人离心一念，神动天地，搜迹阴阳，无所不往，无所往者，是欲也。 知见欲作，习而成之者也。 念者，虚无中网，广大无着，游心不停，神不息，炁不正，体不安，久之令人血衰、骨败筋弱而精竭，然死而不化，其魂尚往来，亦不还上复生，故为魍魉者耶。 故真人绝念者，为不为，未来思念为觅相，物来而应，事至而变，可作而作，不可则止，故死神不为魍魉耳。 西王母日：人生念相，作之有凶。 人若无念，亦不知觉。 绝念者，不为贪着声色，使神不役也。 至人之术，在守心不动。 守心心法，平旦起，整衣冠，入室，南面拱手坐，回视其心若白玉，行之四十九日神定。",
      "translated_text": "To cultivate primordial *qi*, let it transform from small to great, adding to it daily. After forty-nine days, it will fill the body. When the body is full of *qi* and devoid of illness, the spirit will naturally align.\n\nThe Queen Mother of the West says: Primordial *qi* is refined *qi*. First, let fire flow unceasingly from the cinnabar field. At the initial hour of *zi*, perform three hundred and sixty cycles. At the initial hour of *wu*, let it descend from the heart and perform another three hundred and sixty cycles—then *qi* is primordial. One cycle is one round.\n\n**Chapter Twenty-Three: Entering the Chamber**\n\nThe Dao speaks: For the perfected person to nurture form, nothing surpasses refining *qi*. To refine *qi*, nothing surpasses stabilizing the spirit. To stabilize the spirit, nothing surpasses entering the chamber. Entering the chamber is the method for nurturing and settling the spirit.\n\nIn winter, keep warm; in summer, keep cool. In winter, do not use fire; in summer, do not use wind. Sit only on a proper mat, and the chamber must face south. First, dispel external pathogenic influences so they do not invade; then internal pathogenic influences will not arise. To dispel is to prevent pathogenic *qi* from invading, so the body naturally finds peace.\n\nThe Queen Mother of the West says: The art of entering the chamber requires a room six *zhang* square. Place windows on the east and west, and a door on the south, twelve *chi* high. The seating area should be eight *chi* square, furnished with thick woolen cushions. In summer, add a mat on top, and place armrests on either side. Sit upright with feet hanging down, one *chi* and two *cun* from the floor, so that rising and resting on either side does not cause fatigue. Then arrange the four sides.\n\nThe four sides should be draped with blue and white curtains; do not use the five colors, lest prolonged exposure blind the eyes. The eaves outside the door should be white, so the body finds peace and *qi* is not harmed.\n\n**Chapter Twenty-Four: Serving Qi**\n\nThe Dao speaks: *Qi* is supremely great and numinous, transforming heaven and earth, nurturing the myriad things. Though its bounds are unseen, every thing is of it. Without carving, the myriad things take form; without lifting, the myriad things come to life. Gathered, it becomes substance; dispersed, it becomes wind. Heaven knows not *qi* as heaven, earth knows not *qi* as earth, humans know not *qi* as humans, the myriad things know not *qi* as the myriad things, ghosts and spirits know not *qi* as ghosts and spirits, the ten thousand images know not *qi* as the ten thousand images.\n\nIf one knows what *qi* transforms, does one not know what *qi* steals? Heaven’s movements are external; humans respond, yet heaven does not steal their lifespan. Earth bears all below; humans respond, yet earth does not steal their bodies. The myriad things appear and respond, yet do not steal their *qi*. One who knows *qi* knows where yang is born.\n\nThe Queen Mother of the West says: *Qi* in heaven generates one yang at the winter solstice, and the myriad images respond. *Qi* on earth generates one yin at the summer solstice, and the myriad things respond. *Qi* in humans: at the initial hour of *zi*, when all yin converges, one yang is born—yang is born from true water. At the initial hour of *wu*, when all yang converges, one yin is born—yin is born from true fire.\n\nTrue water’s *qi* resides in the kidneys; kidney *qi* must not be stirred. True fire’s *qi* resides in the heart; heart *qi* must not be stirred. Where *qi* resides, visualize and respond to it.\n\n**Chapter Twenty-Five: Stabilizing the Spirit**\n\nThe Dao speaks: The human spirit has the heart as its chamber, blood as its sustenance, *qi* as its root, and the four limbs and five viscera as its servants. The spirit in the body is like a dwelling with life. If the dwelling has life, it thrives; without life, it decays.\n\nWhen the dwelling is new but lifeless, doors and windows unclosed, dust and filth enter from all sides. Pigs and rats gnaw its foundation, birds and sparrows peck its holes—gradually, it collapses. When the dwelling is dilapidated and lifeless, doors and windows crumble, dust and filth overflow. Pigs and rats ruin its foundation, birds and sparrows overturn its roof—then, though one wishes it not to decay, there is no way; it soon collapses.\n\nWhen a person’s spirit is whole and *qi* is aligned, stabilizing it is easy. The way to stabilize the spirit lies in guarding the heart; guarding the heart lies in cutting off thoughts; cutting off thoughts lies in ceasing desires—then the heart is upright. When the heart is upright, the spirit is stabilized.\n\nThe Queen Mother of the West says: The way of stabilizing and guarding is to know contentment, ensuring hunger and cold do not press in, and no reckless thoughts bind you. Nurture it by ascending to the heart with joy. At midnight, do not sit upright—simply level your hands, let the four limbs rest, cut off reckless thoughts, and visualize your body sitting within your heart. Practice this for seven months, and the spirit will not age. When the spirit is stabilized and *qi* is aligned, it remains ever like an infant, and the spirit is naturally numinous.\n\n**Chapter Twenty-Six: Cutting Off Thoughts**\n\nThe Dao speaks: Thoughts arise from the human mind. Humans have constant desires; when the mind strays even a single thought, the spirit stirs heaven and earth, searching the traces of yin and yang, going everywhere—where it goes is desire. Knowing and seeing desires arise, they become habitual.\n\nThoughts are a net in the void, vast and without attachment. The mind roams without cease, the spirit does not rest, *qi* is not aligned, the body is not at peace. Over time, this causes blood to wane, bones to decay, sinews to weaken, and essence to deplete. Then one dies yet does not transform; the hun-soul still wanders, unable to return and be reborn—thus becoming a *wangliang*.\n\nTherefore, the perfected person cuts off thoughts: acting without acting, not seeking appearances in future thoughts, responding to things as they come, adapting to affairs as they arise, acting when possible, stopping when not—thus, even in death, the spirit does not become a *wangliang*.\n\nThe Queen Mother of the West says: Human thoughts, when acted upon, bring misfortune. If humans had no thoughts, they would be unaware. Cutting off thoughts means not being greedy for or attached to sounds and sights, so the spirit is not enslaved.\n\nThe art of the perfected lies in guarding the heart without movement. The method for guarding the heart: at dawn, rise, adjust your robes and cap, enter the chamber, face south, clasp your hands, and sit. Envision your heart as white jade. Practice this for forty-nine days, and the spirit will stabilize.",
      "overlap_context": "e abdomen, direct the gaze up and down, send left to right and right to left. Then lie prone, bend both hands beneath the heart, and align with the nape of the neck—benefit will come naturally. When the five viscera are deficient, face the five directions and visualize their colors, absorbing them to be cured.\n\nThe method for preserving primordial *qi*: Visualize *qi* ascending from the Primordial Sea, causing it to flow and circulate without cease. After thirty days, form will naturally depart.",
      "start_char": 5487,
      "end_char": 6720,
      "start_sentence": 322,
      "end_sentence": 379,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.15471625328064,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上元宝金庭无为妙经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "休欲章第二十七 道言：少思寡欲，天地不覆，息虑忘机，阴阳合宜。 凡世之士欲好生，当先习心。 习心在欲作不作，欲动不动，然未至无至，无为之损。 故真人先养身，后养心。 养心然后欲无欲，是知天下神，故不死。 非唯不死，故不老。 王母日：人有心则病，无病则生。 知非，故不作。 天地有蠹而天地不变，故不死。 知非而非之，鬼神不盗，天地不夺。 故长夜半守丹田元炁，如月能至，心屏绝欲，行之七日光昭一其身。 知天下非，不作无益，心自神通。 日：天地水火风，五行金木水火土，合成真，如垒仰之高峰，触之则散，击则破，复欲成功，岂易致哉。 太上元宝金庭无为妙经竟",
      "translated_text": "**Chapter Twenty-Seven: Cessation of Desires**\n\nThe Dao says: Reduce thoughts and diminish desires, and heaven and earth will not overturn. Still contemplation and forget schemes, and yin and yang will harmonize. All worldly scholars who cherish life must first cultivate the heart. Cultivating the heart lies in acting when desiring to act, yet not acting; moving when desiring to move, yet not moving—thus, even when not yet perfected, there is no harm in non-action.\n\nTherefore, the perfected first nurture the body, then nurture the heart. Only after nurturing the heart can desires be without desire, and thus one knows the spirits of heaven and earth and does not die. Not only does one not die, but one does not age.\n\nThe Queen Mother of the West says: Humans have hearts, and thus they fall ill; without illness, they live. Knowing what is wrong, they do not act. Heaven and earth have decay, yet heaven and earth do not change, and thus they do not die. Knowing what is wrong and rejecting it, ghosts and spirits do not steal, and heaven and earth do not take away.\n\nTherefore, in the dead of night, guard the *qi* of the cinnabar field, as the moon wanes and waxes. With the heart shielding and cutting off desires, after seven days of practice, the light will illuminate the body. Knowing the world’s wrongs and refraining from useless acts, the heart naturally achieves spiritual penetration.\n\nIt is said: Heaven and earth, water and fire, wind—the five phases of metal, wood, water, fire, and earth—unite to form the true. Like a towering peak built of piled stones, it scatters when touched and shatters when struck. To restore success—how easily can this be achieved?\n\n*The Supreme Primordial Treasure Scripture of the Golden Court of Non-Action* concludes.",
      "overlap_context": " acted upon, bring misfortune. If humans had no thoughts, they would be unaware. Cutting off thoughts means not being greedy for or attached to sounds and sights, so the spirit is not enslaved.\n\nThe art of the perfected lies in guarding the heart without movement. The method for guarding the heart: at dawn, rise, adjust your robes and cap, enter the chamber, face south, clasp your hands, and sit. Envision your heart as white jade. Practice this for forty-nine days, and the spirit will stabilize.",
      "start_char": 6721,
      "end_char": 6989,
      "start_sentence": 380,
      "end_sentence": 394,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.00197434425354,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上元宝金庭无为妙经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}